[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Al-Ahqaf.html",
    "contnent": "حمٓ ١",
    "tafsier": {
      "ibnkther": "حمٓ ١\n                                    \n                                    \n                                    مكية\nقد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم.\n                                    ",
      "qortoby": "حمٓ ١\n                                    \n                                    \n                                    مكية في قول جميعهم .\nوهي أربع وثلاثون آية , وقيل : خمس .\n\" حم \" مبتدأ و \" تنزيل \" خبره .\nوقال بعضهم : \" حم \" اسم السورة .\nو \" تنزيل الكتاب \" مبتدأ .\nوخبره \" من الله \" .\nواختلف في معناه ; فقال عكرمة : قال النبي صلى الله عليه وسلم : ( \" حم \" اسم من أسماء الله تعالى وهي مفاتيح خزائن ربك ) قال ابن عباس : \" حم \" اسم الله الأعظم .\nوعنه : \" الر \" و \" حم \" و \" ن \" حروف الرحمن مقطعة .\nوعنه أيضا : اسم من أسماء الله تعالى أقسم به .\nوقال قتادة : إنه اسم من أسماء القرآن .\nمجاهد : فواتح السور .\nوقال عطاء الخراساني : الحاء افتتاح اسمه حميد وحنان وحليم وحكيم , والميم افتتاح اسمه ملك ومجيد ومنان ومتكبر ومصور ; يدل عليه ما روى أنس أن أعرابيا سأل النبي صلى الله عليه وسلم : ما \" حم \" فإنا لا نعرفها في لساننا ؟ فقال النبي صلى الله عليه وسلم : ( بدء أسماء وفواتح سور ) وقال الضحاك والكسائي : معناه قضي ما هو كائن .\nكأنه أراد الإشارة إلى تهجي \" حم \" ; لأنها تصير حم بضم الحاء وتشديد الميم ; أي قضي ووقع .\nوقال كعب بن مالك : فلما تلاقيناهم ودارت بنا الرحى وليس لأمر حمه الله مدفع وعنه أيضا : إن المعنى حم أمر الله أي قرب ; كما قال الشاعر : قد حم يومي فسر قوم قوم بهم غفلة ونوم ومنه سميت الحمى ; لأنها تقرب من المنية .\nوالمعنى المراد قرب نصره لأوليائه , وانتقامه من أعدائه كيوم بدر .\nوقيل : حروف هجاء ; قال الجرمي : ولهذا تقرأ ساكنة الحروف فخرجت مخرج التهجي وإذا سميت سورة بشيء من هذه الحروف أعربت ; فتقول : قرأت \" حم \" فتنصب ; قال الشاعر : يذكرني حاميم والرمح شاجر فهلا تلا حاميم قبل التقدم وقرأ عيسى بن عمر الثقفي : \" حم \" بفتح الميم على معنى اقرأ حم أو لالتقاء الساكنين .\nابن أبي إسحاق وأبو السمال بكسرها .\nوالإمالة والكسر لالتقاء الساكنين , أو على وجه القسم .\nوقرأ أبو جعفر بقطع الحاء من الميم .\nالباقون بالوصل .\nوكذلك في \" حم .\nعسق \" .\nوقرأ أبو عمرو وأبو بكر وحمزة والكسائي وخلف وابن ذكوان بالإمالة في الحاء .\nوروي عن أبي عمرو بين اللفظين وهي قراءة نافع وأبي جعفر وشيبة .\nالباقون بالفتح مشبعا .\n                                    ",
      "saadi": "حمٓ ١\n                                        \n                                        \n                                        \n                                        تقدم تفسير الحروف المقطعة\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Al-Ahqaf.html",
    "contnent": "تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ ٢",
    "tafsier": {
      "ibnkther": "تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ ٢\n                                    \n                                    \n                                    يخبر تعالى أنه نزل الكتاب على عبده ورسوله محمد ، صلوات الله وسلامه عليه دائما إلى يوم الدين ، ووصف نفسه بالعزة التي لا ترام ، والحكمة في الأقوال والأفعال\n                                    ",
      "qortoby": "تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ ٢\n                                    \n                                    \n                                    تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ\n\" حم \" مبتدأ و \" تنزيل \" خبره .\nوقال بعضهم : \" حم \" اسم السورة .\nو \" تنزيل الكتاب \" مبتدأ .\nوخبره \" من الله \" .\nوالكتاب القرآن .الْعَزِيزِ\n\" العزيز \" المنيع .الْحَكِيمِ\nالحكيم في فعله\n                                    ",
      "saadi": "تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ ٢\n                                        \n                                        \n                                        \n                                        هذا ثناء منه تعالى على كتابه العزيز وتعظيم له، وفي ضمن ذلك إرشاد العباد إلى الاهتداء بنوره والإقبال على تدبر آياته واستخراج كنوزه.\nولما بين إنزال كتابه المتضمن للأمر والنهي ذكر خلقه السماوات والأرض فجمع بين الخلق والأمر { أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ } كما قال تعالى: { اللَّهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ } وكما قال تعالى: { يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ أَنْ أَنْذِرُوا أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاتَّقُونِ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقّ } فالله تعالى هو الذي خلق المكلفين وخلق مساكنهم وسخر لهم ما في السماوات وما في الأرض ثم أرسل إليهم رسله وأنزل عليهم كتبه وأمرهم ونهاهم وأخبرهم أن هذه الدار دار أعمال وممر للعمال لا دار إقامة لا يرحل عنها أهلها، وأنهم سينتقلون منها إلى دار الإقامة والقرار وموطن الخلود والدوام، وإنما أعمالهم التي عملوها في هذه الدار سيجدون ثوابها في تلك الدار كاملا موفرا.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Al-Ahqaf.html",
    "contnent": "مَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۚ وَٱلَّذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعۡرِضُونَ ٣",
    "tafsier": {
      "ibnkther": "مَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۚ وَٱلَّذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعۡرِضُونَ ٣\n                                    \n                                    \n                                    ثم قال : ( ما خلقنا السموات والأرض وما بينهما إلا بالحق ) أي : لا على وجه العبث والباطل ، ( وأجل مسمى ) أي : إلى مدة معينة مضروبة لا تزيد ولا تنقص .\nقوله : ( والذين كفروا عما أنذروا معرضون ) أي : لاهون عما يراد بهم ، وقد أنزل إليهم كتابا وأرسل إليهم رسول ، وهم معرضون عن ذلك كله ، أي : وسيعلمون غب ذلك .\n                                    ",
      "qortoby": "مَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۚ وَٱلَّذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعۡرِضُونَ ٣\n                                    \n                                    \n                                    مَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ\nأي للزوال والفناء .\nوقيل : أي لأجازي المحسن والمسيء ; كما قال : \" ولله ما في السماوات وما في الأرض ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى \" [ النجم : 31 ] .وَأَجَلٍ مُسَمًّى\n\" وأجل مسمى \" يعني القيامة , في قول ابن عباس وغيره .\nوهو الأجل الذي تنتهي إليه السماوات والأرض .\nوقيل : إنه هو الأجل المقدور لكل مخلوق .وَالَّذِينَ كَفَرُوا عَمَّا أُنْذِرُوا مُعْرِضُونَ\n\" والذين كفروا عما أنذروا \" خوفوه\n\" معرضون \" مولون لاهون غير مستعدين له .\nيجوز أن تكون \" ما \" مصدرية , أي عن إنذارهم ذلك اليوم .\n                                    ",
      "saadi": "مَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۚ وَٱلَّذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعۡرِضُونَ ٣\n                                        \n                                        \n                                        \n                                        وأقام تعالى الأدلة على تلك الدار وأذاق العباد نموذجا من الثواب والعقاب العاجل ليكون أدعى لهم إلى طلب المحبوب والهرب من المرهوب، ولهذا قال هنا: { مَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقّ } أي: لا عبثا ولا سدى بل ليعرف العباد عظمة خالقهما ويستدلوا على كماله ويعلموا أن الذي خلقهما على عظمهما قادر على أن يعيد العباد بعد موتهم للجزاء وأن خلقهما وبقاءهما مقدر إلى { أَجَلٍ مُسَمًّى }\nفلما أخبر بذلك -وهو أصدق القائلين وأقام الدليل وأنار السبيل أخبر -مع ذلك- أن طائفة من الخلق قد أبوا إلا إعراضا عن الحق، وصدوفا عن دعوة الرسل فقال: { وَالَّذِينَ كَفَرُوا عَمَّا أُنْذِرُوا مُعْرِضُونَ } وأما الذين آمنوا فلما علموا حقيقة الحال قبلوا وصايا ربهم، وتلقوها بالقبول والتسليم وقابلوها بالانقياد والتعظيم ففازوا بكل خير، واندفع عنهم كل شر.\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Al-Ahqaf.html",
    "contnent": "قُلۡ أَرَءَيۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِي مَاذَا خَلَقُواْ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكٞ فِي ٱلسَّمَٰوَٰتِۖ ٱئۡتُونِي بِكِتَٰبٖ مِّن قَبۡلِ هَٰذَآ أَوۡ أَثَٰرَةٖ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ ٤",
    "tafsier": {
      "ibnkther": "قُلۡ أَرَءَيۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِي مَاذَا خَلَقُواْ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكٞ فِي ٱلسَّمَٰوَٰتِۖ ٱئۡتُونِي بِكِتَٰبٖ مِّن قَبۡلِ هَٰذَآ أَوۡ أَثَٰرَةٖ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ ٤\n                                    \n                                    \n                                    ثم قال : ( قل ) أي : لهؤلاء المشركين العابدين مع الله غيره : ( أرأيتم ما تدعون من دون الله أروني ماذا خلقوا من الأرض ) أي : أرشدوني إلى المكان الذي استقلوا بخلقه من الأرض ، ( أم لهم شرك في السموات ) أي : ولا شرك لهم في السموات ولا في الأرض ، وما يملكون من قطمير ، إن الملك والتصرف كله إلا لله ، عز وجل ، فكيف تعبدون معه غيره ، وتشركون به ؟ من أرشدكم إلى هذا ؟ من دعاكم إليه ؟ أهو أمركم به ؟ أم هو شيء اقترحتموه من عند أنفسكم ؟ ولهذا قال : ( ائتوني بكتاب من قبل هذا ) أي : هاتوا كتابا من كتب الله المنزلة على الأنبياء ، عليهم الصلاة والسلام ، يأمركم بعبادة هذه الأصنام ، ( أو أثارة من علم ) أي : دليل بين على هذا المسلك الذي سلكتموه ( إن كنتم صادقين ) أي : لا دليل لكم نقليا ولا عقليا على ذلك ; ولهذا قرأ آخرون : \" أو أثرة من علم \" أي : أو علم صحيح يأثرونه عن أحد ممن قبلهم ، كما قال مجاهد في قوله : ( أو أثارة من علم ) أو أحد يأثر علما .\nوقال العوفي ، عن ابن عباس : أو بينة من الأمر .\nوقال الإمام أحمد : حدثنا يحيى ، عن سفيان ، حدثنا صفوان بن سليم ، عن أبي سلمة بن عبد الرحمن ، عن ابن عباس قال سفيان : لا أعلم إلا عن النبي - صلى الله عليه وسلم - : \" أو أثرة من علم \" قال : \" الخط \" .\nوقال أبو بكر بن عياش : أو بقية من علم . وقال الحسن البصري : ( أو أثارة ) شيء يستخرجه فيثيره .\nوقال ابن عباس ، ومجاهد ، وأبو بكر بن عياش أيضا : ( أو أثارة من علم ) يعني الخط .\nوقال قتادة : ( أو أثارة من علم ) خاصة من علم .\nوكل هذه الأقوال متقاربة ، وهي راجعة إلى ما قلناه ، وهو اختيار ابن جرير رحمه الله وأكرمه ، وأحسن مثواه .\n                                    ",
      "qortoby": "قُلۡ أَرَءَيۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِي مَاذَا خَلَقُواْ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكٞ فِي ٱلسَّمَٰوَٰتِۖ ٱئۡتُونِي بِكِتَٰبٖ مِّن قَبۡلِ هَٰذَآ أَوۡ أَثَٰرَةٖ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ ٤\n                                    \n                                    \n                                    قوله تعالى : قل أرأيتم ما تدعون من دون الله أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات ائتوني بكتاب من قبل هذا أو أثارة من علم إن كنتم صادقين .\nفيه خمس مسائل : الأولى : قوله تعالى : قل أرأيتم ما تدعون من دون الله أي ما تعبدون من الأصنام والأنداد من دون الله . أروني ماذا خلقوا من الأرض أي هل خلقوا شيئا من الأرض أم لهم شرك أي نصيب في السماوات أي في خلق السماوات مع الله . ائتوني بكتاب من قبل هذا أي من قبل هذا القرآن .\nالثانية : قوله تعالى : أو أثارة من علم قراءة العامة أو أثارة بألف بعد الثاء . قال ابن عباس عن النبي - صلى الله عليه وسلم - : [ هو خط كانت تخطه العرب في الأرض ] ، ذكره المهدوي والثعلبي .\nوقال ابن العربي : ولم يصح . وفي مشهور الحديث عن النبي - صلى الله عليه وسلم - قال : [ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ] ولم يصح أيضا .\nقلت : هو ثابت من حديث معاوية بن الحكم السلمي ، خرجه مسلم . وأسند النحاس : حدثنا محمد بن أحمد ( يعرف بالجرايجي ) قال حدثنا محمد بن بندار قال حدثنا يحيى بن سعيد عن سفيان الثوري عن صفوان بن سليم عن أبي سلمة عن ابن عباس عن النبي - صلى الله عليه وسلم - في قوله - عز وجل - : أو أثارة من علم قال : [ الخط ] وهذا صحيح أيضا .\nقال ابن العربي : واختلفوا في تأويله ، فمنهم من قال : جاء لإباحة الضرب لأن بعض الأنبياء كان يفعله . ومنهم من قال جاء للنهي عنه ; لأنه - صلى الله عليه وسلم - قال : [ فمن وافق خطه فذاك ] . ولا سبيل إلى معرفة طريق النهي المتقدم فيه ، فإذا لا سبيل إلى العمل به . قال :\nلعمرك ما تدري الضوارب بالحصا ولا زاجرات الطير ما الله صانع\nوحقيقته عند أربابه ترجع إلى صور الكواكب ، فيدل ما يخرج منها على ما تدل عليه تلك الكواكب من سعد أو نحس يحل بهم ، فصار ظنا مبنيا على ظن ، وتعلقا بأمر غائب قد درست طريقه وفات تحقيقه ، وقد نهت الشريعة عنه ، وأخبرت أن ذلك مما اختص الله به ، وقطعه عن الخلق ، وإن كانت لهم قبل ذلك أسباب يتعلقون بها في درك الأشياء المغيبة ، فإن الله قد رفع تلك الأسباب وطمس تلك الأبواب وأفرد نفسه بعلم الغيب ، فلا يجوز مزاحمته في ذلك ، ولا يحل لأحد دعواه . وطلبه عناء لو لم يكن فيه نهي . فإذ وقد ورد النهي فطلبه معصية أو كفر بحسب قصد الطالب .\nقلت : ما اختاره هو قول الخطابي . قال الخطابي : قوله - عليه السلام - : [ فمن وافق خطه فذاك ] هذا يحتمل الزجر إذ كان ذلك علما لنبوته وقد انقطعت ، فنهينا عن التعاطي لذلك .\nقال القاضي عياض : الأظهر من اللفظ خلاف هذا ، وتصويب خط من يوافق خطه ، لكن من أين تعلم الموافقة والشرع منع من التخرص وادعاء الغيب جملة - فإنما معناه أن من وافق خطه فذاك الذي يجدون إصابته ، لا أنه يريد إباحة ذلك لفاعله على ما تأوله بعضهم . وحكى مكي في تفسير قوله : [ كان نبي من الأنبياء يخط ] أنه كان يخط بأصبعه السبابة والوسطى في الرمل ثم يزجر .\nوقال ابن عباس في تفسير قوله [ ومنا رجال يخطون ] : هو الخط الذي يخطه الحازي فيعطى حلوانا فيقول : اقعد حتى أخط لك ، وبين يدي الحازي غلام معه ميل ثم يأتي إلى أرض رخوة فيخط الأستاذ خطوطا معجلة لئلا يلحقها العدد ، ثم يرجع فيمحو على مهل خطين خطين ، فإن بقي خطان فهو علامة النجح ، وإن بقي خط فهو علامة الخيبة . والعرب تسميه الأسحم وهو مشئوم عندهم .\nالثالثة : قال ابن العربي : إن الله تعالى لم يبق من الأسباب الدالة على الغيب التي أذن في التعلق بها والاستدلال منها إلا الرؤيا ، فإنه أذن فيها ، وأخبر أنها جزء من النبوة وكذلك الفأل ، وأما الطيرة والزجر فإنه نهى عنهما . والفأل : هو الاستدلال بما يسمع من الكلام على ما يريد من الأمر إذا كان حسنا ، فإذا سمع مكروها فهو تطير ، أمره الشرع بأن يفرح بالفأل ويمضي على أمره مسرورا . وإذا سمع المكروه أعرض عنه ولم يرجع لأجله ، وقد قال النبي - صلى الله عليه وسلم - : [ اللهم لا طير إلا طيرك ولا خير إلا خيرك ولا إله غيرك ] . وقد روى بعض الأدباء :\nالفأل والزجر والكهان كلهم مضللون ودون الغيب أقفال\nوهذا كلام صحيح ، إلا في الفأل فإن الشرع استثناه وأمر به ، فلا يقبل من هذا الشاعر ما نظمه فيه ، فإنه تكلم بجهل ، وصاحب الشرع أصدق وأعلم وأحكم .\nقلت : قد مضى في الطيرة والفأل وفي الفرق بينهما ما يكفي في ( المائدة ) وغيرها . ومضى في ( الأنعام ) أن الله سبحانه منفرد بعلم الغيب ، وأن أحدا لا يعلم ذلك إلا ما أعلمه الله ، أو يجعل على ذلك دلالة عادية يعلم بها ما يكون على جري العادة ، وقد يختلف . مثاله إذا رأى نخلة قد أطلعت فإنه يعلم أنها ستثمر ، وإذا رآها قد تناثر طلعها علم أنها لا تثمر . وقد يجوز أن يأتي عليها آفة تهلك ثمرها فلا تثمر ، كما أنه جائز أن تكون النخلة التي تناثر طلعها يطلع الله فيها طلعا ثانيا فتثمر . وكما أنه جائز أيضا ألا يلي شهره شهر ولا يومه يوم إذا أراد الله إفناء العالم ذلك الوقت . إلى غير ذلك مما تقدم في ( الأنعام ) بيانه .\nالرابعة : قال ابن خويز منداد : قوله تعالى : أو أثارة من علم يريد الخط . وقد كان مالك رحمه الله يحكم بالخط إذا عرف الشاهد خطه . وإذا عرف الحاكم خطه أو خط من كتب إليه حكم به ، ثم رجع عن ذلك حين ظهر في الناس ما ظهر من الحيل والتزوير . وقد روي عنه أنه قال : [ يحدث الناس فجورا فتحدث لهم أقضية ] . فأما إذا شهد الشهود على الخط المحكوم به ، مثل أن يشهدوا أن هذا خط الحاكم وكتابه ، أشهدنا على ما فيه وإن لم يعلموا ما في الكتاب . وكذلك الوصية أو خط الرجل باعترافه بمال لغيره يشهدون أنه خطه ونحو ذلك - فلا يختلف مذهبه أن يحكم به . وقيل : أو أثارة من علم أو بقية من علم ، قاله ابن عباس والكلبي وأبو بكر بن عياش وغيرهم . وفي الصحاح أو أثارة من علم بقية منه . وكذلك الأثرة ( بالتحريك ) . ويقال : سمنت الإبل على أثارة ، أي : بقية شحم كان قبل ذلك . وأنشد الماوردي والثعلبي قول الراعي :\nوذات أثارة أكلت عليها نباتا في أكمته ففارا\nوقال الهروي : والأثارة والأثر : البقية ، يقال : ما ثم عين ولا أثر . وقال ميمون بن مهران وأبو سلمة بن عبد الرحمن وقتادة : أو أثارة من علم خاصة من علم . وقال مجاهد : رواية تأثرونها عمن كان قبلكم . وقال عكرمة ومقاتل : رواية عن الأنبياء . وقال القرظي : هو الإسناد الحسن المعنى ، شيء يثار أو يستخرج . وقال الزجاج : أو أثارة أي : علامة . والأثارة مصدر كالسماحة والشجاعة . وأصل الكلمة من الأثر ، وهي الرواية ، يقال : أثرت الحديث آثره أثرا وأثارة وأثرة فأنا آثر ، إذا ذكرته عن غيرك . ومنه قيل : حديث مأثور ، أي : نقله خلف عن سلف . قال الأعشى :\nإن الذي فيه تماريتما بين للسامع والآثر\nويروى ( بين ) وقرئ ( أو أثرة ) بضم الهمزة وسكون الثاء . ويجوز أن يكون معناه بقية من علم . ويجوز أن يكون معناه شيئا مأثورا من كتب الأولين . والمأثور : ما يتحدث به مما صح سنده عمن تحدث به عنه . وقرأالسلمي والحسن وأبو رجاء بفتح الهمزة والثاء من غير ألف ، أي : خاصة من علم أوتيتموها أو أوثرتم بها على غيركم . وروي عن الحسن أيضا وطائفة ( أثرة ) مفتوحة الألف ساكنة الثاء ، ذكر الأولى الثعلبي والثانية الماوردي . وحكى الثعلبي عن عكرمة : أو ميراث من علم . إن كنتم صادقين\nالخامسة : قوله تعالى : ائتوني بكتاب من قبل هذا أو أثارة من علم فيه بيان مسالك الأدلة بأسرها ، فأولها المعقول ، وهو قوله تعالى : قل أرأيتم ما تدعون من دون الله أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات وهو احتجاج بدليل العقل في أن الجماد لا يصح أن يدعى من دون الله فإنه لا يضر ولا ينفع . ثم قال : ائتوني بكتاب من قبل هذا فيه بيان أدلة السمع أو أثارة من علم\n                                    ",
      "saadi": "قُلۡ أَرَءَيۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِي مَاذَا خَلَقُواْ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكٞ فِي ٱلسَّمَٰوَٰتِۖ ٱئۡتُونِي بِكِتَٰبٖ مِّن قَبۡلِ هَٰذَآ أَوۡ أَثَٰرَةٖ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ ٤\n                                        \n                                        \n                                        \n                                        أي: { قُلْ } لهؤلاء الذين أشركوا بالله أوثانا وأندادا لا تملك نفعا ولا ضرا ولا موتا ولا حياة ولا نشورا، قل لهم -مبينا عجز أوثانهم وأنها لا تستحق شيئا من العبادة-: { أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ } هل خلقوا من أجرام السماوات والأرض شيئا؟ هل خلقوا جبالا؟ هل أجروا أنهارا؟ هل نشروا حيوانا؟ هل أنبتوا أشجارا؟ هل كان منهم معاونة على خلق شيء من ذلك؟\nلا شيء من ذلك بإقرارهم على أنفسهم فضلا عن غيرهم، فهذا دليل عقلي قاطع على أن كل من سوى الله فعبادته باطلة.\nثم ذكر انتفاء الدليل النقلي فقال: { اِئْتُونِي بِكِتَابٍ مِنْ قَبْلِ هَذَا } الكتاب يدعو إلى الشرك { أَوْ أَثَارَةٍ مِنْ عِلْمٍ } موروث عن الرسل يأمر بذلك. من المعلوم أنهم عاجزون أن يأتوا عن أحد من الرسل بدليل يدل على ذلك، بل نجزم ونتيقن أن جميع الرسل دعوا إلى توحيد ربهم ونهوا عن الشرك به، وهي أعظم ما يؤثر عنهم من العلم قال تعالى: { وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَسُولًا أَنِ اُعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ } وكل رسول قال لقومه: { اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ } فعلم أن جدال المشركين في شركهم غير مستندين فيه على برهان ولا دليل وإنما اعتمدوا على ظنون كاذبة وآراء كاسدة وعقول فاسدة. يدلك على فسادها استقراء أحوالهم وتتبع علومهم وأعمالهم والنظر في حال من أفنوا أعمارهم بعبادته هل أفادهم شيئا في الدنيا أو في الآخرة؟\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَمَنۡ أَضَلُّ مِمَّن يَدۡعُواْ مِن دُونِ ٱللَّهِ مَن لَّا يَسۡتَجِيبُ لَهُۥٓ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ وَهُمۡ عَن دُعَآئِهِمۡ غَٰفِلُونَ ٥",
    "tafsier": {
      "ibnkther": "وَمَنۡ أَضَلُّ مِمَّن يَدۡعُواْ مِن دُونِ ٱللَّهِ مَن لَّا يَسۡتَجِيبُ لَهُۥٓ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ وَهُمۡ عَن دُعَآئِهِمۡ غَٰفِلُونَ ٥\n                                    \n                                    \n                                    وقوله : ( ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون ) أي : لا أضل ممن يدعو أصناما ، ويطلب منها ما لا تستطيعه إلى يوم القيامة ، وهي غافلة عما يقول ، لا تسمع ولا تبصر ولا تبطش ; لأنها جماد حجارة صم .\n                                    ",
      "qortoby": "وَمَنۡ أَضَلُّ مِمَّن يَدۡعُواْ مِن دُونِ ٱللَّهِ مَن لَّا يَسۡتَجِيبُ لَهُۥٓ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ وَهُمۡ عَن دُعَآئِهِمۡ غَٰفِلُونَ ٥\n                                    \n                                    \n                                    قوله تعالى : ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون .\nقوله تعالى : ومن أضل أي لا أحد أضل وأجهل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهي الأوثان . وهم عن دعائهم غافلون يعني لا يسمعون ولا يفهمون ، فأخرجها وهي جماد مخرج ذكور بني آدم ، إذ قد مثلتها عبدتها بالملوك والأمراء التي تخدم .\n                                    ",
      "saadi": "وَمَنۡ أَضَلُّ مِمَّن يَدۡعُواْ مِن دُونِ ٱللَّهِ مَن لَّا يَسۡتَجِيبُ لَهُۥٓ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ وَهُمۡ عَن دُعَآئِهِمۡ غَٰفِلُونَ ٥\n                                        \n                                        \n                                        \n                                        { وَمَنْ أَضَلُّ مِمَّنْ يَدْعُو مِنْ دُونِ اللَّهِ مَنْ لَا يَسْتَجِيبُ لَهُ إِلَى يَوْمِ الْقِيَامَةِ } أي: مدة مقامه في الدنيا لا ينتفع به بمثقال ذرة { وَهُمْ عَنْ دُعَائِهِمْ غَافِلُونَ } لا يسمعون منهم دعاء ولا يجيبون لهم نداء هذا حالهم في الدنيا، ويوم القيامة يكفرون بشركهم.\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَإِذَا حُشِرَ ٱلنَّاسُ كَانُواْ لَهُمۡ أَعۡدَآءٗ وَكَانُواْ بِعِبَادَتِهِمۡ كَٰفِرِينَ ٦",
    "tafsier": {
      "ibnkther": "وَإِذَا حُشِرَ ٱلنَّاسُ كَانُواْ لَهُمۡ أَعۡدَآءٗ وَكَانُواْ بِعِبَادَتِهِمۡ كَٰفِرِينَ ٦\n                                    \n                                    \n                                    وقوله : ( وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين ) ، كقوله تعالى : ( واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا ) [ مريم : 81 ، 82 ] أي : سيخونونهم أحوج ما يكونون إليهم ، وقال الخليل : ( إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين ) [ العنكبوت : 25 ] .\n                                    ",
      "qortoby": "وَإِذَا حُشِرَ ٱلنَّاسُ كَانُواْ لَهُمۡ أَعۡدَآءٗ وَكَانُواْ بِعِبَادَتِهِمۡ كَٰفِرِينَ ٦\n                                    \n                                    \n                                    قوله تعالى : وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين.\nقوله تعالى : وإذا حشر الناس يريد يوم القيامة . كانوا لهم أعداء أي هؤلاء المعبودون أعداء الكفار يوم القيامة . فالملائكة أعداء الكفار ، والجن والشياطين يتبرءون غدا من عبدتهم ، ويلعن بعضهم بعضا . ويجوز أن تكون الأصنام للكفار الذين عبدوها أعداء ، على تقدير خلق الحياة لها ، دليله قوله تعالى : تبرأنا إليك ما كانوا إيانا يعبدون وقيل : عادوا معبوداتهم لأنهم كانوا سبب هلاكهم ، وجحد المعبودون عبادتهم ، وهو قوله : وكانوا بعبادتهم كافرين\n                                    ",
      "saadi": "وَإِذَا حُشِرَ ٱلنَّاسُ كَانُواْ لَهُمۡ أَعۡدَآءٗ وَكَانُواْ بِعِبَادَتِهِمۡ كَٰفِرِينَ ٦\n                                        \n                                        \n                                        \n                                        { وَإِذَا حُشرَ النَّاسُ كَانُوا لَهُمْ أَعْدَاءً } يلعن بعضهم بعضا ويتبرأ بعضهم من بعض { وَكَانُوا بِعِبَادَتِهِمْ كَافِرِينَ }\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلۡحَقِّ لَمَّا جَآءَهُمۡ هَٰذَا سِحۡرٞ مُّبِينٌ ٧",
    "tafsier": {
      "ibnkther": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلۡحَقِّ لَمَّا جَآءَهُمۡ هَٰذَا سِحۡرٞ مُّبِينٌ ٧\n                                    \n                                    \n                                    يقول تعالى مخبرا عن المشركين في كفرهم وعنادهم : أنهم إذا تتلى عليهم آيات الله بينات ، أي : في حال بيانها ووضوحها وجلائها ، يقولون : ( هذا سحر مبين ) أي : سحر واضح ، وقد كذبوا وافتروا وضلوا وكفروا\n                                    ",
      "qortoby": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلۡحَقِّ لَمَّا جَآءَهُمۡ هَٰذَا سِحۡرٞ مُّبِينٌ ٧\n                                    \n                                    \n                                    قوله تعالى : وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للحق لما جاءهم هذا سحر مبين .\nقوله تعالى : وإذا تتلى عليهم آياتنا بينات يعني القرآن . قال الذين كفروا للحق لما جاءهم هذا سحر مبين\n                                    ",
      "saadi": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلۡحَقِّ لَمَّا جَآءَهُمۡ هَٰذَا سِحۡرٞ مُّبِينٌ ٧\n                                        \n                                        \n                                        \n                                        أي: وإذا تتلى على المكذبين { آيَاتُنَا بَيِّنَاتٍ } بحيث تكون على وجه لا يمترى بها ولا يشك في وقوعها وحقها لم تفدهم خيرا بل قامت عليهم بذلك الحجة، ويقولون من إفكهم وافترائهم { لِلْحَقِّ لَمَّا جَاءَهُمْ هَذَا سِحْرٌ مُبِينٌ } أي: ظاهر لا شك فيه وهذا من باب قلب الحقائق الذي لا يروج إلا على ضعفاء العقول، وإلا فبين الحق الذي جاء به الرسول صلى الله عليه وسلم وبين السحر من المنافاة والمخالفة أعظم مما بين السماء والأرض، وكيف يقاس الحق -الذي علا وارتفع ارتفاعا على الأفلاك وفاق بضوئه ونوره نور الشمس وقامت الأدلة الأفقية والنفسية عليه، وأقرت به وأذعنت أولو البصائر والعقول الرزينة- بالباطل الذي هو السحر الذي لا يصدر إلا من ضال ظالم خبيث النفس خبيث العمل؟! فهو مناسب له وموافق لحاله وهل هذا إلا من البهرجة؟\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Al-Ahqaf.html",
    "contnent": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَيۡتُهُۥ فَلَا تَمۡلِكُونَ لِي مِنَ ٱللَّهِ شَيۡ‍ًٔاۖ هُوَ أَعۡلَمُ بِمَا تُفِيضُونَ فِيهِۚ كَفَىٰ بِهِۦ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۖ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ ٨",
    "tafsier": {
      "ibnkther": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَيۡتُهُۥ فَلَا تَمۡلِكُونَ لِي مِنَ ٱللَّهِ شَيۡ‍ًٔاۖ هُوَ أَعۡلَمُ بِمَا تُفِيضُونَ فِيهِۚ كَفَىٰ بِهِۦ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۖ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ ٨\n                                    \n                                    \n                                    ( أم يقولون افتراه ) يعنون : محمدا - صلى الله عليه وسلم - . قال الله [ تعالى ] ( قل إن افتريته فلا تملكون لي من الله شيئا ) أي : لو كذبت عليه وزعمت أنه أرسلني - وليس كذلك - لعاقبني أشد العقوبة ، ولم يقدر أحد من أهل الأرض ، لا أنتم ولا غيركم أن يجيرني منه ، كقوله : ( قل إني لن يجيرني من الله أحد ولن أجد من دونه ملتحدا إلا بلاغا من الله ورسالاته ) [ الجن : 22 ، 23 ] ، وقال تعالى : ( ولو تقول علينا بعض الأقاويل . لأخذنا منه باليمين . ثم لقطعنا منه الوتين . فما منكم من أحد عنه حاجزين ) [ الحاقة : 44 - 47 ] ; ولهذا قال هاهنا : ( قل إن افتريته فلا تملكون لي من الله شيئا هو أعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم ) ، هذا تهديد لهم ، ووعيد أكيد ، وترهيب شديد .\nوقوله : ( وهو الغفور الرحيم ) ترغيب لهم إلى التوبة والإنابة ، أي : ومع هذا كله إن رجعتم وتبتم ، تاب عليكم وعفا عنكم ، وغفر [ لكم ] ورحم . وهذه الآية كقوله في سورة الفرقان : ( وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا . قل أنزله الذي يعلم السر في السموات والأرض إنه كان غفورا رحيما ) [ الفرقان : 5 ، 6 ] .\n                                    ",
      "qortoby": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَيۡتُهُۥ فَلَا تَمۡلِكُونَ لِي مِنَ ٱللَّهِ شَيۡ‍ًٔاۖ هُوَ أَعۡلَمُ بِمَا تُفِيضُونَ فِيهِۚ كَفَىٰ بِهِۦ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۖ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ ٨\n                                    \n                                    \n                                    قوله تعالى : أم يقولون افتراه قل إن افتريته فلا تملكون لي من الله شيئا هو أعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم وهو الغفور الرحيم .\nقوله تعالى : أم يقولون افتراه الميم صلة ، التقدير : أيقولون افتراه ، أي : تقوله محمد . وهو إضراب عن ذكر تسميتهم الآيات سحرا . ومعنى الهمزة في ( أم ) الإنكار والتعجب ، كأنه قال : دع هذا واسمع قولهم المستنكر المقضي منه العجب . وذلك أن محمدا كان لا يقدر عليه حتى يقوله ويفتريه على الله ، ولو قدر عليه دون أمة العرب لكانت قدرته عليه معجزة لخرقها العادة ، وإذا كانت معجزة كانت تصديقا من الله له ، والحكيم لا يصدق الكاذب فلا يكون مفتريا ، والضمير للحق ، والمراد به الآيات . قل إن افتريته على سبيل الفرض . فلا تملكون لي من الله شيئا أي لا تقدرون على أن تردوا عني عذاب الله ، فكيف أفتري على الله لأجلكم . هو أعلم بما تفيضون فيه أي تقولونه ، عن مجاهد . وقيل : تخوضون فيه من التكذيب . والإفاضة في الشيء : الخوض فيه والاندفاع . أفاضوا في الحديث أي : اندفعوا فيه . وأفاض البعير أي : دفع جرته من كرشه فأخرجها ، ومنه قول الشاعر [ ياقوت الحموي ] :\nوأفضن بعد كظومهن بجرة\nوأفاض الناس من عرفات إلى منى أي : دفعوا ، وكل دفعة إفاضة . كفى به شهيدا نصب على التمييز . بيني وبينكم أي : هو يعلم صدقي وأنكم مبطلون . وهو الغفور لمن تاب الرحيم بعباده المؤمنين .\n                                    ",
      "saadi": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَيۡتُهُۥ فَلَا تَمۡلِكُونَ لِي مِنَ ٱللَّهِ شَيۡ‍ًٔاۖ هُوَ أَعۡلَمُ بِمَا تُفِيضُونَ فِيهِۚ كَفَىٰ بِهِۦ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۖ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ ٨\n                                        \n                                        \n                                        \n                                        { أَمْ يَقُولُونَ افْتَرَاهُ } أي: افترى محمد هذا القرآن من عند نفسه فليس هو من عند الله.\n{ قُلْ } لهم: { إِنِ افْتَرَيْتُهُ } فالله علي قادر وبما تفيضون فيه عالم، فكيف لم يعاقبني على افترائي الذي زعمتم ؟\nفهل { تَمْلِكُونَ لِي مِنَ اللَّهِ شَيْئًا } إن أرادني الله بضر أو أرادني برحمة { كَفَى بِهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ } فلو كنت متقولا عليه لأخذ مني باليمين ولعاقبني عقابا يراه كل أحد لأن هذا أعظم أنواع الافتراء لو كنت متقولا، ثم دعاهم إلى التوبة مع ما صدر منهم من معاندة الحق ومخاصمته فقال: { وَهُوَ الْغَفُورُ الرَّحِيمُ } أي: فتوبوا إليه وأقلعوا عما أنتم فيه يغفر لكم ذنوبكم ويرحمكم فيوفقكم للخير ويثيبكم جزيل الأجر.\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Al-Ahqaf.html",
    "contnent": "قُلۡ مَا كُنتُ بِدۡعٗا مِّنَ ٱلرُّسُلِ وَمَآ أَدۡرِي مَا يُفۡعَلُ بِي وَلَا بِكُمۡۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّ وَمَآ أَنَا۠ إِلَّا نَذِيرٞ مُّبِينٞ ٩",
    "tafsier": {
      "ibnkther": "قُلۡ مَا كُنتُ بِدۡعٗا مِّنَ ٱلرُّسُلِ وَمَآ أَدۡرِي مَا يُفۡعَلُ بِي وَلَا بِكُمۡۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّ وَمَآ أَنَا۠ إِلَّا نَذِيرٞ مُّبِينٞ ٩\n                                    \n                                    \n                                    وقوله : ( قل ما كنت بدعا من الرسل ) أي : لست بأول رسول طرق العالم ، بل قد جاءت الرسل من قبلي ، فما أنا بالأمر الذي لا نظير له حتى تستنكروني وتستبعدوا بعثتي إليكم ، فإنه قد أرسل الله قبلي جميع الأنبياء إلى الأمم .\nقال ابن عباس ، ومجاهد ، وقتادة : ( قل ما كنت بدعا من الرسل ) ما أنا بأول رسول . ولم يحك ابن جرير ولا ابن أبي حاتم غير ذلك .\nوقوله : ( وما أدري ما يفعل بي ولا بكم ) قال علي بن أبي طلحة ، عن ابن عباس في هذه الآية : نزل بعدها ( ليغفر لك الله ما تقدم من ذنبك وما تأخر ) [ الفتح : 2 ] . وهكذا قال عكرمة ، والحسن ، وقتادة : إنها منسوخة بقوله : ( ليغفر لك الله ما تقدم من ذنبك وما تأخر ) ، قالوا : ولما نزلت هذه الآية قال رجل من المسلمين : هذا قد بين الله ما هو فاعل بك يا رسول الله ، فما هو فاعل بنا ؟ فأنزل الله : ( ليدخل المؤمنين والمؤمنات جنات ) [ الفتح : 5 ] .\nهكذا قال ، والذي هو ثابت في الصحيح أن المؤمنين قالوا : هنيئا لك يا رسول الله ، فما لنا ؟ فأنزل الله هذه الآية .\nوقال الضحاك : ( وما أدري ما يفعل بي ولا بكم ) : ما أدري بماذا أومر ، وبماذا أنهى بعد هذا ؟\nوقال أبو بكر الهذلي ، عن الحسن البصري في قوله : ( وما أدري ما يفعل بي ولا بكم ) قال : أما في الآخرة فمعاذ الله ، قد علم أنه في الجنة ، ولكن قال : لا أدري ما يفعل بي ولا بكم في الدنيا ، أخرج كما أخرجت الأنبياء [ من ] قبلي ؟ أم أقتل كما قتلت الأنبياء من قبلي ؟ ولا أدري أيخسف بكم أو ترمون بالحجارة ؟\nوهذا القول هو الذي عول عليه ابن جرير ، وأنه لا يجوز غيره ، ولا شك أن هذا هو اللائق به ، صلوات الله وسلامه عليه ، فإنه بالنسبة إلى الآخرة جازم أنه يصير إلى الجنة هو ومن اتبعه ، وأما في الدنيا فلم يدر ما كان يئول إليه أمره وأمر مشركيقريش إلى ماذا : أيؤمنون أم يكفرون ، فيعذبون فيستأصلون بكفرهم ؟ فأما الحديث الذي رواه الإمام أحمد :\nحدثنا يعقوب ، حدثنا أبي ، عن ابن شهاب عن خارجة بن زيد بن ثابت ، عن أم العلاء - وهي امرأة من نسائهم - أخبرته - وكانت بايعت رسول الله - صلى الله عليه وسلم - - قالت : طار لهم في السكنى حين اقترعت الأنصار على سكنى المهاجرين عثمان بن مظعون . فاشتكى عثمان عندنا فمرضناه ، حتى إذا توفي أدرجناه في أثوابه ، فدخل علينا رسول الله فقلت : رحمة الله عليك أبا السائب ، شهادتي عليك ، لقد أكرمك الله . فقال رسول الله - صلى الله عليه وسلم - : \" وما يدريك أن الله أكرمه ؟ \" فقلت : لا أدري بأبي أنت وأمي ! فقال رسول الله - صلى الله عليه وسلم - : \" أما هو فقد جاءه اليقين من ربه ، وإني لأرجو له الخير ، والله ما أدري وأنا رسول الله ما يفعل بي ! \" قالت : فقلت : والله لا أزكي أحدا بعده أبدا . وأحزنني ذلك ، فنمت فرأيت لعثمان عينا تجري ، فجئت إلى رسول الله - صلى الله عليه وسلم - فأخبرته بذلك ، فقال رسول الله - صلى الله عليه وسلم - : \" ذاك عمله \" .\nفقد انفرد بإخراجه البخاري دون مسلم ، وفي لفظ له : \" ما أدري وأنا رسول الله ما يفعل به \" . وهذا أشبه أن يكون هو المحفوظ ، بدليل قولها : \" فأحزنني ذلك \" . وفي هذا وأمثاله دلالة على أنه لا يقطع لمعين بالجنة إلا الذي نص الشارع على تعيينهم ، كالعشرة ، وابن سلام ، والغميصاء ، وبلال ، وسراقة ، وعبد الله بن عمرو بن حرام والد جابر ، والقراء السبعين الذين قتلوا ببئر معونة ، وزيد بن حارثة ، وجعفر ، وابن رواحة ، وما أشبه هؤلاء .\nوقوله : ( إن أتبع إلا ما يوحى إلي ) أي : إنما أتبع ما ينزله الله علي من الوحي ، ( وما أنا إلا نذير مبين ) أي : بين النذارة ، وأمري ظاهر لكل ذي لب وعقل .\n                                    ",
      "qortoby": "قُلۡ مَا كُنتُ بِدۡعٗا مِّنَ ٱلرُّسُلِ وَمَآ أَدۡرِي مَا يُفۡعَلُ بِي وَلَا بِكُمۡۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّ وَمَآ أَنَا۠ إِلَّا نَذِيرٞ مُّبِينٞ ٩\n                                    \n                                    \n                                    قوله تعالى : قل ما كنت بدعا من الرسل وما أدري ما يفعل بي ولا بكم إن أتبع إلا ما يوحى إلي وما أنا إلا نذير مبين .\nقوله تعالى : قل ما كنت بدعا من الرسل أي أول من أرسل ، قد كان قبلي رسل ، عن ابن عباس وغيره . والبدع : الأول . وقرأ عكرمة وغيره ( بدعا ) بفتح الدال ، على تقدير حذف المضاف ، والمعنى : ما كنت صاحب بدع . وقيل : بدع وبديع بمعنى ، مثل نصف ونصيف . وأبدع الشاعر : جاء بالبديع . وشيء بدع ( بالكسر ) أي : مبتدع . وفلان بدع في هذا الأمر أي : بديع . وقوم أبداع ، عن الأخفش . وأنشد قطرب قول عدي بن زيد :\nفلا أنا بدع من حوادث تعتري رجالا غدت من بعد بؤسي بأسعد\n[ قوله تعالى : ] وما أدري ما يفعل بي ولا بكم يريد يوم القيامة . ولما نزلت فرح المشركون واليهود والمنافقون وقالوا : كيف نتبع نبيا لا يدري ما يفعل به ولا بنا ، وأنه لا فضل له علينا ، ولولا أنه ابتدع الذي يقوله من تلقاء نفسه لأخبره الذي بعثه بما يفعل به ، فنزلت : ليغفر لك الله ما تقدم من ذنبك وما تأخر فنسخت هذه الآية ، وأرغم الله أنف الكفار . وقالت الصحابة : هنيئا لك يا رسول الله ، لقد بين الله لك ما يفعل بك يا رسول الله ، فليت شعرنا ما هو فاعل بنا ؟ فنزلت : ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار الآية . ونزلت : وبشر المؤمنين بأن لهم من الله فضلا كبيرا قاله أنس وابن عباس وقتادة والحسن وعكرمة والضحاك . وقالت أم العلاء امرأة من الأنصار : اقتسمنا المهاجرين فصار لنا عثمان بن مظعون بن حذافة بن جمح ، فأنزلناه أبياتنا فتوفي ، فقلت : رحمة الله عليك أبا السائب إن الله أكرمك . فقال النبي - صلى الله عليه وسلم - : [ وما يدريك أن الله أكرمه ] ؟ فقلت : بأبي وأمي يا رسول الله فمن ؟ قال : [ أما هو فقد جاءه اليقين وما رأينا إلا خيرا فوالله إني لأرجو له الجنة ووالله إني لرسول الله وما أدري ما يفعل بي ولا بكم ] . قالت : فوالله لا أزكي بعده أحدا أبدا . ذكره الثعلبي ، وقال : وإنما قال هذا حين لم يعلم بغفران ذنبه ، وإنما غفر الله له ذنبه في غزوة الحديبية قبل موته بأربع سنين .\nقلت : حديث أم العلاء خرجه البخاري ، وروايتي فيه : وما أدري ما يفعل به ليس فيه بي ولا بكم وهو الصحيح إن شاء الله ، على ما يأتي بيانه . والآية ليست منسوخة ; لأنها خبر .\nقال النحاس : محال أن يكون في هذا ناسخ ولا منسوخ من جهتين : أحدهما أنه خبر ، والآخر أنه من أول السورة إلى هذا الموضع خطاب للمشركين واحتجاج عليهم وتوبيخ لهم ، فوجب أن يكون هذا أيضا خطابا للمشركين كما كان قبله وما بعده ، ومحال أن يقول النبي - صلى الله عليه وسلم - للمشركين ما أدري ما يفعل بي ولا بكم في الآخرة ، ولم يزل - صلى الله عليه وسلم - من أول مبعثه إلى مماته يخبر أن من مات على الكفر مخلد في النار ، ومن مات على الإيمان واتبعه وأطاعه فهو في الجنة ، فقد رأى - صلى الله عليه وسلم - ما يفعل به وبهم في الآخرة . وليس يجوز أن يقول لهم ما أدري ما يفعل بي ولا بكم في الآخرة ، فيقولون كيف نتبعك وأنت لا تدري أتصير إلى خفض ودعة أم إلى عذاب وعقاب . والصحيح في الآية قول الحسن ، كما قرأ علي بن محمد بن جعفر بن حفص عن يوسف بن موسى قال حدثنا وكيع قال حدثنا أبو بكر الهذلي عن الحسن : \" وما أدري ما يفعل بي ولا بكم في الدنيا \" قال أبو جعفر : وهذا أصح قول وأحسنه ، لا يدري - صلى الله عليه وسلم - ما يلحقه وإياهم من مرض وصحة ورخص وغلاء وغنى وفقر . ومثله : ولو كنت أعلم الغيب لاستكثرت من الخير وما مسني السوء الكلبي عن أبي صالح عن ابن عباس : لما اشتد البلاء بأصحاب رسول الله - صلى الله عليه وسلم - رأى في المنام أنه يهاجر إلى أرض ذات نخل وشجر وماء ، فقصها على أصحابه فاستبشروا بذلك ، ورأوا فيها فرجا مما هم فيه من أذى المشركين ، ثم إنهم مكثوا برهة لا يرون ذلك فقالوا : يا رسول الله ، متى نهاجر إلى الأرض التي رأيت ؟ فسكت النبي - صلى الله عليه وسلم - فأنزل الله تعالى : وما أدري ما يفعل بي ولا بكم أي : لا أدري أأخرج إلى الموضع الذي رأيته في منامي أم لا . ثم قال : [ إنما هو شيء رأيته في منامي ما أتبع إلا ما يوحى إلي ] أي : لم يوح إلي ما أخبرتكم به . قال القشيري : فعلى هذا لا نسخ في الآية . وقيل : المعنى لا أدري ما يفرض علي وعليكم من الفرائض . واختار الطبري أن يكون المعنى : ما أدري ما يصير إليه أمري وأمركم في الدنيا ، أتؤمنون أم تكفرون ، أم تعاجلون بالعذاب أم تؤخرون .\nقلت : وهو معنى قول الحسن والسدي وغيرهما . قال الحسن : ما أدري ما يفعل بي ولا بكم في الدنيا ، أما في الآخرة فمعاذ الله ، قد علم أنه في الجنة حين أخذ ميثاقه في الرسل ، ولكن قال ما أدري ما يفعل بي في الدنيا أأخرج كما أخرجت الأنبياء قبلي ، أو أقتل كما قتلت الأنبياء قبلي ، ولا أدري ما يفعل بكم ، أأمتي المصدقة أم المكذبة ، أم أمتي المرمية بالحجارة من السماء قذفا ، أو مخسوف بها خسفا ، ثم نزلت : هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله . يقول : سيظهر دينه على الأديان . ثم قال في أمته : وما كان الله ليعذبهم وأنت فيهم فأخبره تعالى بما يصنع به وبأمته ، ولا نسخ على هذا كله ، والحمد لله .\nوقال الضحاك أيضا : ما أدري ما يفعل بي ولا بكم أي : ما تؤمرون به وتنهون عنه . وقيل : أمر النبي - صلى الله عليه وسلم - أن يقول للمؤمنين ما أدري ما يفعل بي ولا بكم في القيامة ، ثم بين الله تعالى ذلك في قوله : ليغفر لك الله ما تقدم من ذنبك وما تأخر وبين فيما بعد ذلك حال المؤمنين ثم بين حال الكافرين .\nقلت : وهذا معنى القول الأول ، إلا أنه أطلق فيه النسخ بمعنى البيان ، وأنه أمر أن يقول ذلك للمؤمنين ، والصحيح ما ذكرناه عن الحسن وغيره . وما في ما يفعل يجوز أن تكون موصولة ، وأن تكون استفهامية مرفوعة .\nإن أتبع إلا ما يوحى إلي وما أنا إلا نذير مبين . وقرئ يوحي أي : الله عز وجل . تقدم في غير موضع .\n                                    ",
      "saadi": "قُلۡ مَا كُنتُ بِدۡعٗا مِّنَ ٱلرُّسُلِ وَمَآ أَدۡرِي مَا يُفۡعَلُ بِي وَلَا بِكُمۡۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّ وَمَآ أَنَا۠ إِلَّا نَذِيرٞ مُّبِينٞ ٩\n                                        \n                                        \n                                        \n                                        { قُلْ مَا كُنْتُ بِدْعًا مِنَ الرُّسُلِ } أي: لست بأول رسول جاءكم حتى تستغربوا رسالتي وتستنكروا دعوتي فقد تقدم من الرسل والأنبياء من وافقت دعوتي دعوتهم فلأي شيء تنكرون رسالتي؟ { وَمَا أَدْرِي مَا يُفْعَلُ بِي وَلَا بِكُمْ } أي: لست إلا بشرا ليس بيدي من الأمر شيء والله تعالى هو المتصرف بي وبكم الحاكم علي وعليكم، ولست الآتي بالشيء من عندي، { وَمَا أَنَا إِلَّا نَذِيرٌ مُبِينٌ } فإن قبلتم رسالتي وأجبتم دعوتي فهو حظكم ونصيبكم في الدنيا والآخرة، وإن رددتم ذلك علي فحسابكم على الله وقد أنذرتكم ومن أنذر فقد أعذر.\n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Al-Ahqaf.html",
    "contnent": "قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدٞ مِّنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ مِثۡلِهِۦ فَ‍َٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٠١",
    "tafsier": {
      "ibnkther": "قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدٞ مِّنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ مِثۡلِهِۦ فَ‍َٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٠١\n                                    \n                                    \n                                    يقول تعالى : ( قل ) يا محمد لهؤلاء المشركين الكافرين بالقرآن : ( أرأيتم إن كان ) هذا القرآن ( من عند الله وكفرتم به ) أي : ما ظنكم أن الله صانع بكم إن كان هذا الكتاب الذي جئتكم به قد أنزله علي لأبلغكموه ، وقد كفرتم به وكذبتموه ، ( وشهد شاهد من بني إسرائيل على مثله ) أي : وقد شهدت بصدقه وصحته الكتب المتقدمة المنزلة على الأنبياء قبلي ، بشرت به وأخبرت بمثل ما أخبر هذا القرآن به .\nوقوله : ( فآمن ) أي : هذا الذي شهد بصدقه من بني إسرائيل لمعرفته بحقيته ) واستكبرتم ) أنتم : عن اتباعه .\nوقال مسروق : فآمن هذا الشاهد بنبيه وكتابه ، وكفرتم أنتم بنبيكم وكتابكم ( إن الله لا يهدي القوم الظالمين )\nوهذا الشاهد اسم جنس يعم عبد الله بن سلام وغيره ؛ فإن هذه الآية مكية نزلت قبل إسلام عبد الله بن سلام . وهذه كقوله : ( وإذا يتلى عليهم قالوا آمنا به إنه الحق من ربنا إنا كنا من قبله مسلمين ) [ القصص : 53 ] ، وقال : ( إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا ) [ الإسراء : 107 ، 108 ] .\nقال مسروق ، والشعبي : ليس بعبد الله بن سلام ، هذه الآية مكية ، وإسلام عبد الله بن سلام كان بالمدينة . رواه عنهما ابن جرير وابن أبي حاتم ، واختاره ابن جرير .\nوقال مالك ، عن أبي النضر ، عن عامر بن سعد ، عن أبيه قال : ما سمعت رسول الله - صلى الله عليه وسلم - يقول لأحد يمشي على وجه الأرض : \" إنه من أهل الجنة \" ، إلا لعبد الله بن سلام ، قال : وفيه نزلت : ( وشهد شاهد من بني إسرائيل على مثله )\nرواه البخاري ومسلم والنسائي ، من حديث مالك ، به . وكذا قال ابن عباس ، ومجاهد ، والضحاك ، وقتادة ، وعكرمة ، ويوسف بن عبد الله بن سلام ، وهلال بن يساف ، والسدي ، والثوري ، ومالك بن أنس ، وابن زيد ; أنهم كلهم قالوا : إنه عبد الله بن سلام .\n                                    ",
      "qortoby": "قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدٞ مِّنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ مِثۡلِهِۦ فَ‍َٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٠١\n                                    \n                                    \n                                    قوله تعالى : قل أرأيتم إن كان من عند الله وكفرتم به وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين .\nقوله تعالى : قل أرأيتم إن كان من عند الله يعني القرآن . وكفرتم به وقال الشعبي : المراد محمد صلى الله عليه وسلم . وشهد شاهد من بني إسرائيل قال ابن عباس والحسن وعكرمة وقتادة ومجاهد : هو عبد الله بن سلام ، شهد على اليهود أن رسول الله - صلى الله عليه وسلم - مذكور في التوراة ، وأنه نبي من عند الله . وفي الترمذي عنه : ونزلت في آيات من كتاب الله ، نزلت في : وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين وقد تقدم في آخر سورة ( الرعد ) وقال مسروق : هو موسى والتوراة ، لا ابن سلام ; لأنه أسلم بالمدينة والسورة مكية . وقال : وقوله : وكفرتم به مخاطبة لقريش . الشعبي : هو من آمن من بني إسرائيل بموسى والتوراة ; لأن ابن سلام إنما أسلم قبل وفاة النبي - صلى الله عليه وسلم - بعامين ، والسورة مكية . قال القشيري : ومن قال الشاهد موسى قال السورة مكية ، وأسلم ابن سلام قبل موت النبي - صلى الله عليه وسلم - بعامين . ويجوز أن تكون الآية نزلت بالمدينة وتوضع في سورة مكية ، فإن الآية كانت تنزل فيقول النبي - صلى الله عليه وسلم - ضعوها في سورة كذا . والآية في محاجة المشركين ، ووجه الحجة أنهم كانوا يراجعون اليهود في أشياء ، أي : شهادتهم لهم وشهادة نبيهم لي من أوضح الحجج . ولا يبعد أن تكون السورة في محاجة اليهود ، ولما جاء ابن سلام مسلما من قبل أن تعلم اليهود بإسلامه قال : يا رسول الله ، اجعلني حكما بينك وبين اليهود ، فسألهم عنه : [ أي رجل هو فيكم ؟ ] قالوا : سيدنا وعالمنا . فقال : [ إنه قد آمن بي ] فأساءوا القول فيه . . . الحديث ، وقد تقدم . قال ابن عباس : رضيت اليهود بحكم ابن سلام ، وقالت للنبي - صلى الله عليه وسلم - : إن يشهد لك آمنا بك ، فسئل فشهد ثم أسلم .\nعلى مثله أي على مثل ما جئتكم به ، فشهد موسى على التوراة ومحمد على القرآن . وقال الجرجاني . ( مثل ) صلة ، أي : وشهد شاهد عليه أنه من عند الله . فآمن أي هذا الشاهد . واستكبرتم أنتم عن الإيمان . وجواب إن كان محذوف تقديره : فآمن أتؤمنون ، قال الزجاج . وقيل : فآمن واستكبرتم أليس قد ظلمتم ، يبينه إن الله لا يهدي القوم الظالمين وقيل : فآمن واستكبرتم أفتأمنون عذاب الله . وأرأيتم لفظ موضوع للسؤال والاستفهام ، ولذلك لا يقتضي مفعولا . وحكى النقاش وغيره : أن في الآية تقديما وتأخيرا ، وتقديره : قل أرأيتم إن كان من عند الله وشهد شاهد من بني إسرائيل فآمن هو وكفرتم إن الله لا يهدي القوم الظالمين .\n                                    ",
      "saadi": "قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدٞ مِّنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ مِثۡلِهِۦ فَ‍َٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٠١\n                                        \n                                        \n                                        \n                                        { قُلْ أَرَأَيْتُمْ إِنْ كَانَ مِنْ عِنْدِ اللَّهِ وَكَفَرْتُمْ بِهِ وَشَهِدَ شَاهِدٌ مِنْ بَنِي إِسْرَائِيلَ عَلَى مِثْلِهِ فَآمَنَ وَاسْتَكْبَرْتُمْ } أي: أخبروني لو كان هذا القرآن من عند الله وشهد على صحته الموفقون من أهل الكتاب الذين عندهم من الحق ما يعرفون أنه الحق فآمنوا به واهتدوا فتطابقت أنباء الأنبياء وأتباعهم النبلاء واستكبرتم أيها الجهلاء الأغبياء فهل هذا إلا أعظم الظلم وأشد الكفر؟ { إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ } ومن الظلم الاستكبار عن الحق بعد التمكن منه.\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ لَوۡ كَانَ خَيۡرٗا مَّا سَبَقُونَآ إِلَيۡهِۚ وَإِذۡ لَمۡ يَهۡتَدُواْ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفۡكٞ قَدِيمٞ ١١",
    "tafsier": {
      "ibnkther": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ لَوۡ كَانَ خَيۡرٗا مَّا سَبَقُونَآ إِلَيۡهِۚ وَإِذۡ لَمۡ يَهۡتَدُواْ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفۡكٞ قَدِيمٞ ١١\n                                    \n                                    \n                                    وقوله تعالى : ( وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه ) أي : قالوا عن المؤمنين بالقرآن : لو كان القرآن خيرا ما سبقنا هؤلاء إليه . يعنون بلالا وعمارا وصهيبا وخبابا وأشباههم وأقرانهم من المستضعفين والعبيد والإماء ، وما ذاك إلا لأنهم عند أنفسهم يعتقدون أن لهم عند الله وجاهة وله بهم عناية . وقد غلطوا في ذلك غلطا فاحشا ، وأخطئوا خطأ بينا ، كما قال تعالى : ( وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا ) [ الأنعام : 53 ] أي : يتعجبون : كيف اهتدى هؤلاء دوننا ; ولهذا قالوا : ( لو كان خيرا ما سبقونا إليه ) وأما أهل السنة والجماعة فيقولون في كل فعل وقول لم يثبت عن الصحابة : هو بدعة ; لأنه لو كان خيرا لسبقونا إليه ؛ لأنهم لم يتركوا خصلة من خصال الخير إلا وقد بادروا إليها .\nوقوله : ( وإذ لم يهتدوا به ) أي : بالقرآن ( فسيقولون هذا إفك ) أي : كذب ) قديم ) أي : مأثور عن الأقدمين ، فينتقصون القرآن وأهله ، وهذا هو الكبر الذي قال رسول الله - صلى الله عليه وسلم - : \" بطر الحق ، وغمط الناس \" .\n                                    ",
      "qortoby": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ لَوۡ كَانَ خَيۡرٗا مَّا سَبَقُونَآ إِلَيۡهِۚ وَإِذۡ لَمۡ يَهۡتَدُواْ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفۡكٞ قَدِيمٞ ١١\n                                    \n                                    \n                                    قوله تعالى : وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه وإذ لم يهتدوا به فسيقولون هذا إفك قديم .\nقوله تعالى : وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه اختلف في سبب نزولها على ستة أقوال : الأول : أن أبا ذر الغفاري دعاه النبي - صلى الله عليه وسلم - إلى الإسلام بمكة فأجاب ، واستجار به قومه فأتاه زعيمهم فأسلم ، ثم دعاهم الزعيم فأسلموا ، فبلغ ذلك قريشا فقالوا : غفار الحلفاء لو كان هذا خيرا ما سبقونا إليه ، فنزلت هذه الآية ، قاله أبو المتوكل .\nالثاني : أن زنيرة أسلمت فأصيب بصرها فقالوا لها : أصابك اللات والعزى ، فرد الله عليها بصرها . فقال عظماء قريش : لو كان ما جاء به محمد خيرا ما سبقتنا إليه زنيرة ، فأنزل الله تعالى هذه الآية ، قاله عروة بن الزبير .\nالثالث : أن الذين كفروا هم بنو عامر وغطفان وتميم وأسد وحنظلة وأشجع قالوا لمن أسلم من غفار وأسلم وجهينة ومزينة وخزاعة : لو كان ما جاء به محمد خيرا ما سبقتنا إليه رعاة البهم إذ نحن أعز منهم ، قاله الكلبي والزجاج ، وحكاه القشيري عن ابن عباس .\nالرابع : وقال قتادة : نزلت في مشركي قريش ، قالوا : لو كان ما يدعونا إليه محمد خيرا ما سبقنا إليه بلال وصهيب وعمار وفلان وفلان .\nالخامس : أن الذين كفروا من اليهود قالوا للذين آمنوا يعني عبد الله بن سلام وأصحابه : لو كان دين محمد حقا ما سبقونا إليه ، قاله أكثر المفسرين ، حكاه الثعلبي . وقال مسروق : إن الكفار قالوا لو كان خيرا ما سبقتنا إليه اليهود ، فنزلت هذه الآية .\nوهذه المعارضة من الكفار في قولهم : لو كان خيرا ما سبقونا إليه من أكبر المعارضات بانقلابها عليهم لكل من خالفهم ، حتى يقال لهم : لو كان ما أنتم عليه خيرا ما عدلنا عنه ، ولو كان تكذيبكم للرسول خيرا ما سبقتمونا إليه ، ذكره الماوردي . ثم قيل : قوله : ما سبقونا إليه يجوز أن يكون من قول الكفار لبعض المؤمنين ، ويجوز أن يكون على الخروج من الخطاب إلى الغيبة ، كقوله تعالى : حتى إذا كنتم في الفلك وجرين بهم\nوإذ لم يهتدوا به يعني الإيمان . وقيل : القرآن . وقيل : محمد صلى الله عليه وسلم . فسيقولون هذا إفك قديم أي لما لم يصيبوا الهدى بالقرآن ولا بمن جاء به عادوه ونسبوه إلى الكذب ، وقالوا هذا إفك قديم ، كما قالوا : أساطير الأولين وقيل لبعضهم : هل في القرآن : من جهل شيئا عاداه ؟ فقال نعم ، قال الله تعالى : وإذ لم يهتدوا به فسيقولون هذا إفك قديم ومثله : بل كذبوا بما لم يحيطوا بعلمه .\n                                    ",
      "saadi": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ لَوۡ كَانَ خَيۡرٗا مَّا سَبَقُونَآ إِلَيۡهِۚ وَإِذۡ لَمۡ يَهۡتَدُواْ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفۡكٞ قَدِيمٞ ١١\n                                        \n                                        \n                                        \n                                        أي: قال الكفار بالحق معاندين له ورادين لدعوته: { لَوْ كَانَ خَيْرًا مَا سَبَقُونَا إِلَيْهِ } أي: ما سبقنا إليه المؤمنون أي: لكنا أول مبادر به وسابق إليه وهذا من البهرجة في مكان، فأي دليل يدل على أن علامة الحق سبق المكذبين به للمؤمنين؟ هل هم أزكى نفوسا؟ أم أكمل عقولا؟ أم الهدى بأيديهم؟ ولكن هذا الكلام الذي صدر منهم يعزون به أنفسهم بمنزلة من لم يقدر على الشيء ثم طفق يذمه ولهذا قال: { وَإِذْ لَمْ يَهْتَدُوا بِهِ فَسَيَقُولُونَ هَذَا إِفْكٌ قَدِيمٌ } أي: هذا السبب الذي دعاهم إليه أنهم لما لم يهتدوا بهذا القرآن وفاتهم أعظم المواهب وأجل الرغائب قدحوا فيه بأنه كذب وهو الحق الذي لا شك فيه ولا امتراء يعتريه.\n                                    "
    }
  },
  {
    "id": 11,
    "versesNumber": 12,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةٗۚ وَهَٰذَا كِتَٰبٞ مُّصَدِّقٞ لِّسَانًا عَرَبِيّٗا لِّيُنذِرَ ٱلَّذِينَ ظَلَمُواْ وَبُشۡرَىٰ لِلۡمُحۡسِنِينَ ٢١",
    "tafsier": {
      "ibnkther": "وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةٗۚ وَهَٰذَا كِتَٰبٞ مُّصَدِّقٞ لِّسَانًا عَرَبِيّٗا لِّيُنذِرَ ٱلَّذِينَ ظَلَمُواْ وَبُشۡرَىٰ لِلۡمُحۡسِنِينَ ٢١\n                                    \n                                    \n                                    ثم قال : ( ومن قبله كتاب موسى ) وهو التوراة ( إماما ورحمة وهذا كتاب ) يعني القرآن ) مصدق ) أي : لما قبله من الكتب ( لسانا عربيا ) أي : فصيحا بينا واضحا ، ( لينذر الذين ظلموا وبشرى للمحسنين ) أي : مشتمل على النذارة للكافرين والبشارة للمؤمنين .\n                                    ",
      "qortoby": "وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةٗۚ وَهَٰذَا كِتَٰبٞ مُّصَدِّقٞ لِّسَانًا عَرَبِيّٗا لِّيُنذِرَ ٱلَّذِينَ ظَلَمُواْ وَبُشۡرَىٰ لِلۡمُحۡسِنِينَ ٢١\n                                    \n                                    \n                                    قوله تعالى : ومن قبله كتاب موسى إماما ورحمة وهذا كتاب مصدق لسانا عربيا لينذر الذين ظلموا وبشرى للمحسنين .\nقوله تعالى : ومن قبله أي ومن قبل القرآن كتاب موسى أي التوراة إماما يقتدى بما فيه . وإماما نصب على الحال ; لأن المعنى : وتقدمه كتاب موسى إماما . ورحمة معطوف عليه . وقيل : انتصب بإضمار فعل ، أي : أنزلناه إماما ورحمة . وقال الأخفش : على القطع ; لأن كتاب موسى معرفة بالإضافة ; لأن النكرة إذا أعيدت أو أضيفت أو أدخل عليها ألف ولام صارت معرفة . وهذا كتاب يعني القرآن مصدق يعني للتوراة ولما قبله من الكتب . وقيل : مصدق للنبي صلى الله عليه وسلم . لسانا عربيا منصوب على الحال ، أي : مصدق لما قبله عربيا ، ولسانا توطئة للحال أي : تأكيد ، كقولهم : جاءني زيد رجلا صالحا ، فتذكر رجلا توكيدا . وقيل : نصب بإضمار فعل تقديره : وهذا كتاب مصدق أعني لسانا عربيا . وقيل : نصب بإسقاط حرف الخفض تقديره : بلسان عربي . وقيل : إن لسانا مفعول والمراد به النبي - صلى الله عليه وسلم - ، أي : وهذا كتاب مصدق للنبي - صلى الله عليه وسلم - لأنه معجزته ، والتقدير : مصدق ذا لسان عربي . فاللسان منصوب بمصدق ، وهو النبي صلى الله عليه وسلم . ويبعد أن يكون اللسان القرآن ; لأن المعنى يكون يصدق نفسه .\nلينذر الذين ظلموا قراءة العامة لينذر بالياء خبر عن الكتاب ، أي : لينذر الذين ظلموا أنفسهم بالكفر والمعصية . وقيل : هو خبر عن الرسول صلى الله عليه وسلم . وقرأ نافع وابن عامر والبزي بالتاء ، واختاره أبو عبيد وأبو حاتم ، على خطاب النبي - صلى الله عليه وسلم - ، قال الله تعالى : إنما أنت منذر . وبشرى للمحسنين بشرى في موضع رفع ، أي : وهو بشرى . وقيل : عطفا على الكتاب ، أي : وهذا كتاب مصدق وبشرى . ويجوز أن يكون منصوبا بإسقاط حرف الخفض ، أي : لينذر الذين ظلموا وللبشرى ، فلما حذف الخافض نصب . وقيل : على المصدر ، أي : وتبشر المحسنين بشرى ، فلما جعل مكان وتبشر بشرى أو بشارة نصب ، كما تقول : أتيتك لأزورك ، وكرامة لك وقضاء لحقك ، يعني لأزورك وأكرمك وأقضي حقك ، فنصب الكرامة بفعل مضمر .\n                                    ",
      "saadi": "وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةٗۚ وَهَٰذَا كِتَٰبٞ مُّصَدِّقٞ لِّسَانًا عَرَبِيّٗا لِّيُنذِرَ ٱلَّذِينَ ظَلَمُواْ وَبُشۡرَىٰ لِلۡمُحۡسِنِينَ ٢١\n                                        \n                                        \n                                        \n                                        الذي قد وافق الكتب السماوية خصوصا أكملها وأفضلها بعد القرآن وهي التوراة التي أنزلها الله على موسى { إِمَامًا وَرَحْمَةً } أي: يقتدي بها بنو إسرائيل ويهتدون بها فيحصل لهم خير الدنيا والآخرة. { وَهَذَا } القرآن { كِتَابٌ مُصَدِّقٌ } للكتب السابقة شهد بصدقها وصدَّقها بموافقته لها وجعله الله { لِسَانًا عَرَبِيًّا } ليسهل تناوله ويتيسر تذكره، { لِيُنْذِرَ الَّذِينَ ظَلَمُوا } أنفسهم بالكفر والفسوق والعصيان إن استمروا على ظلمهم بالعذاب الوبيل ويبشر المحسنين في عبادة الخالق وفي نفع المخلوقين بالثواب الجزيل في الدنيا والآخرة ويذكر الأعمال التي ينذر عنها والأعمال التي يبشر بها.\n\n                                    "
    }
  },
  {
    "id": 12,
    "versesNumber": 13,
    "souraName": "Al-Ahqaf.html",
    "contnent": "إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٣١",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٣١\n                                    \n                                    \n                                    وقوله : ( إن الذين قالوا ربنا الله ثم استقاموا ) تقدم تفسيرها في سورة \" حم ، السجدة \" .\nوقوله : ( فلا خوف عليهم ) أي : فيما يستقبلون ، ( ولا هم يحزنون ) على ما خلفوا ،\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٣١\n                                    \n                                    \n                                    قوله تعالى : إن الذين قالوا ربنا الله ثم استقاموا فلا خوف عليهم ولا هم يحزنون\nقوله تعالى : إن الذين قالوا ربنا الله ثم استقاموا الآية تقدم معناها . وقال ابن عباس : نزلت في أبي بكر الصديق والآية تعم .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٣١\n                                        \n                                        \n                                        \n                                        أي: إن الذين أقروا بربهم وشهدوا له بالوحدانية والتزموا طاعته\nوداموا على ذلك، و { اسْتَقَامُوا } مدة حياتهم { فَلَا خَوْفٌ عَلَيْهِمْ } من كل شر أمامهم، { وَلَا هُمْ يَحْزَنُونَ } على ما خلفوا وراءهم.\n                                    "
    }
  },
  {
    "id": 13,
    "versesNumber": 14,
    "souraName": "Al-Ahqaf.html",
    "contnent": "أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ ٤١",
    "tafsier": {
      "ibnkther": "أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ ٤١\n                                    \n                                    \n                                    ( أولئك أصحاب الجنة خالدين فيها جزاء بما كانوا يعملون ) أي : الأعمال سبب لنيل الرحمة لهم وسبوغها عليهم .\n                                    ",
      "qortoby": "أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ ٤١\n                                    \n                                    \n                                    جزاء نصب على المصدر .\n                                    ",
      "saadi": "أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا جَزَآءَۢ بِمَا كَانُواْ يَعۡمَلُونَ ٤١\n                                        \n                                        \n                                        \n                                        { أُولَئِكَ أَصْحَابُ الْجَنَّةِ } أي: أهلها الملازمون لها الذين لا يبغون عنها حولا ولا يريدون بها بدلا، { خَالِدِينَ فِيهَا جَزَاءً بِمَا كَانُوا يَعْمَلُونَ } من الإيمان بالله المقتضى للأعمال الصالحة التي استقاموا عليها.\n                                    "
    }
  },
  {
    "id": 14,
    "versesNumber": 15,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهٗا وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِينَ سَنَةٗ قَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَصۡلِحۡ لِي فِي ذُرِّيَّتِيٓۖ إِنِّي تُبۡتُ إِلَيۡكَ وَإِنِّي مِنَ ٱلۡمُسۡلِمِينَ ٥١",
    "tafsier": {
      "ibnkther": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهٗا وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِينَ سَنَةٗ قَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَصۡلِحۡ لِي فِي ذُرِّيَّتِيٓۖ إِنِّي تُبۡتُ إِلَيۡكَ وَإِنِّي مِنَ ٱلۡمُسۡلِمِينَ ٥١\n                                    \n                                    \n                                    لما ذكر تعالى في الآية الأولى التوحيد له وإخلاص العبادة والاستقامة إليه ، عطف بالوصية بالوالدين ، كما هو مقرون في غير ما آية من القرآن ، كقوله : ( وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا ) [ الإسراء : 23 ] وقال : ( أن اشكر لي ولوالديك إلي المصير ) [ لقمان : 14 ] ، إلى غير ذلك من الآيات الكثيرة . وقال هاهنا : ( ووصينا الإنسان بوالديه إحسانا ) أي : أمرناه بالإحسان إليهما والحنو عليهما .\nوقال أبو داود الطيالسي : حدثنا شعبة ، أخبرني سماك بن حرب قال : سمعت مصعب بن سعد يحدث عن سعد قال : قالت أم سعد لسعد : أليس قد أمر الله بطاعة الوالدين ، فلا آكل طعاما ، ولا أشرب شرابا حتى تكفر بالله . فامتنعت من الطعام والشراب ، حتى جعلوا يفتحون فاها بالعصا ، ونزلت هذه الآية : ( ووصينا الإنسان بوالديه حسنا ) الآية [ العنكبوت : 8 ] .\nورواه مسلم وأهل السنن إلا ابن ماجه ، من حديث شعبة بإسناده ، نحوه وأطول منه .\n( حملته أمه كرها ) أي : قاست بسببه في حال حمله مشقة وتعبا ، من وحام وغشيان وثقل وكرب ، إلى غير ذلك مما تنال الحوامل من التعب والمشقة ، ( ووضعته كرها ) أي : بمشقة أيضا من الطلق وشدته ، ( وحمله وفصاله ثلاثون شهرا )\nوقد استدل علي ، رضي الله عنه ، بهذه الآية مع التي في لقمان : ( وفصاله في عامين ) [ لقمان : 14 ] ، وقوله : ( والوالدات يرضعن أولادهن حولين كاملين لمن أراد أن يتم الرضاعة ) [ البقرة : 233 ] ، على أن أقل مدة الحمل ستة أشهر ، وهو استنباط قوي صحيح . ووافقه عليه عثمان وجماعة من الصحابة ، رضي الله عنهم .\nقال محمد بن إسحاق بن يسار ، عن يزيد بن عبد الله بن قسيط ، عن بعجة بن عبد الله الجهني قال : تزوج رجل منا امرأة من جهينة ، فولدت له لتمام ستة أشهر ، فانطلق زوجها إلى عثمان فذكر ذلك له ، فبعث إليها ، فلما قامت لتلبس ثيابها بكت أختها ، فقالت : ما يبكيك ؟ ! فوالله ما التبس بي أحد من خلق الله غيره قط ، فيقضي الله في ما شاء . فلما أتي بها عثمان أمر برجمها ، فبلغ ذلك عليا فأتاه ، فقال له : ما تصنع ؟ قال : ولدت تماما لستة أشهر ، وهل يكون ذلك ؟ فقال له [ علي ] أما تقرأ القرآن ؟ قال : بلى . قال : أما سمعت الله يقول : ( وحمله وفصاله ثلاثون شهرا ) وقال : ( [ يرضعن أولادهن ] حولين كاملين ) ، فلم نجده بقى إلا ستة أشهر ، قال : فقال عثمان : والله ما فطنت لهذا ، علي بالمرأة فوجدوها قد فرغ منها ، قال : فقال بعجة : فوالله ما الغراب بالغراب ، ولا البيضة بالبيضة بأشبه منه بأبيه . فلما رآه أبوه قال : ابني إني والله لا أشك فيه ، قال : وأبلاه الله بهذه القرحة قرحة الأكلة ، فما زالت تأكله حتى مات .\nرواه ابن أبي حاتم ، وقد أوردناه من وجه آخر عند قوله : ( فأنا أول العابدين ) [ الزخرف : 81 ] .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا فروة بن أبي المغراء ، حدثنا علي بن مسهر ، عن داود بن أبي هند ، عن عكرمة ، عن ابن عباس قال : إذا وضعت المرأة لتسعة أشهر كفاه من الرضاع أحد وعشرون شهرا ، وإذا وضعته لسبعة أشهر كفاه من الرضاع ثلاثة وعشرون شهرا ، وإذا وضعته لستة أشهر فحولين كاملين ; لأن الله تعالى يقول : ( وحمله وفصاله ثلاثون شهرا )\n( حتى إذا بلغ أشده ) أي : قوي وشب وارتجل ( وبلغ أربعين سنة ) أي : تناهى عقله وكمل فهمه وحلمه . ويقال : إنه لا يتغير غالبا عما يكون عليه ابن الأربعين .\nقال أبو بكر بن عياش ، عن الأعمش ، عن القاسم بن عبد الرحمن قال : قلت لمسروق : متى يؤخذ الرجل بذنوبه ؟ قال : إذا بلغت الأربعين ، فخذ حذرك .\nوقال الحافظ أبو يعلى الموصلي : حدثنا عبيد الله القواريري ، حدثنا عزرة بن قيس الأزدي - وكان قد بلغ مائة سنة - حدثنا أبو الحسن السلولي عنه وزادني قال : قال محمد بن عمرو بن عثمان ، عن عثمان ، عن النبي - صلى الله عليه وسلم - قال : \" العبد المسلم إذا بلغ أربعين سنة خفف الله حسابه ، وإذا بلغ ستين سنة رزقه الله الإنابة إليه ، وإذا بلغ سبعين سنة أحبه أهل السماء ، وإذا بلغ ثمانين سنة ثبت الله حسناته ومحا سيئاته ، وإذا بلغ تسعين سنة غفر الله له ما تقدم من ذنبه وما تأخر ، وشفعه الله في أهل بيته ، وكتب في السماء أسير الله في أرضه \" .\nوقد روي هذا من غير هذا الوجه ، وهو في مسند الإمام أحمد .\nوقد قال الحجاج بن عبد الله الحكمي أحد أمراء بني أمية بدمشق : تركت المعاصي والذنوب أربعين سنة حياء من الناس ، ثم تركتها حياء من الله ، عز وجل .\nوما أحسن قول الشاعر :\nصبا ما صبا حتى علا الشيب رأسه فلما علاه قال للباطل : ابطل\n( قال رب أوزعني ) أي : ألهمني ( أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه ) أي : في المستقبل ، ( وأصلح لي في ذريتي ) أي : نسلي وعقبي ، ( إني تبت إليك وإني من المسلمين ) وهذا فيه إرشاد لمن بلغ الأربعين أن يجدد التوبة والإنابة إلى الله ، عز وجل ، ويعزم عليها .\nوقد روى أبو داود في سننه ، عن ابن مسعود ، رضي الله عنه ، أن رسول الله - صلى الله عليه وسلم - كان يعلمهم أن يقولوا في التشهد : \" اللهم ، ألف بين قلوبنا ، وأصلح ذات بيننا ، واهدنا سبل السلام ، ونجنا من الظلمات إلى النور ، وجنبنا الفواحش ما ظهر منها وما بطن ، وبارك لنا في أسماعنا وأبصارنا وقلوبنا ، وأزواجنا ، وذرياتنا ، وتب علينا إنك أنت التواب الرحيم ، واجعلنا شاكرين لنعمتك ، مثنين بها قابليها ، وأتممها علينا \" .\n                                    ",
      "qortoby": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهٗا وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِينَ سَنَةٗ قَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَصۡلِحۡ لِي فِي ذُرِّيَّتِيٓۖ إِنِّي تُبۡتُ إِلَيۡكَ وَإِنِّي مِنَ ٱلۡمُسۡلِمِينَ ٥١\n                                    \n                                    \n                                    قوله تعالى : ووصينا الإنسان بوالديه إحسانا حملته أمه كرها ووضعته كرها وحمله وفصاله ثلاثون شهرا حتى إذا بلغ أشده وبلغ أربعين سنة قال رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأصلح لي في ذريتي إني تبت إليك وإني من المسلمين .\nفيه سبع مسائل : الأولى : قوله تعالى : ووصينا الإنسان بوالديه إحسانا بين اختلاف حال الإنسان مع أبويه ، فقد يطيعهما وقد يخالفهما ، أي : فلا يبعد مثل هذا في حق النبي - صلى الله عليه وسلم - وقومه حتى يستجيب له البعض ويكفر البعض . فهذا وجه اتصال الكلام بعضه ببعض ، قاله القشيري .\nالثانية : قوله تعالى : إحسانا قراءة العامة ( حسنا ) وكذا هو في مصاحف أهل الحرمين والبصرة والشام . وقرأ ابن عباس والكوفيون إحسانا وحجتهم قوله تعالى في سورة ( الأنعام وبني إسرائيل ) : وبالوالدين إحسانا وكذا هو في مصاحف الكوفة . وحجة القراءة الأولى قوله تعالى في سورة العنكبوت : ووصينا الإنسان بوالديه حسنا ولم يختلفوا فيها . والحسن خلاف القبح . والإحسان خلاف الإساءة . والتوصية : الأمر . وقد مضى القول في هذا وفيمن نزلت .\nالثالثة : قوله تعالى : حملته أمه كرها ووضعته كرها أي بكره ومشقة . وقراءة العامة بفتح الكاف . واختاره أبو عبيد ، قال : وكذلك لفظ الكره في كل القرآن بالفتح إلا التي في سورة البقرة : كتب عليكم القتال وهو كره لكم لأن ذلك اسم وهذه كلها مصادر . وقرأ الكوفيون كرها بالضم . قيل : هما لغتان مثل الضعف والضعف والشهد والشهد ، قاله الكسائي ، وكذلك هو عند جميع البصريين . وقال الكسائي أيضا والفراء في الفرق بينهما : إن الكره ( بالضم ) ما حمل الإنسان على نفسه ، وبالفتح ما حمل على غيره ، أي : قهرا وغضبا ، ولهذا قال بعض أهل العربية إن كرها ( بفتح الكاف ) لحن .\nالرابعة : قوله تعالى : وحمله وفصاله ثلاثون شهرا قال ابن عباس : إذا حملت تسعة أشهر أرضعت إحدى وعشرين شهرا ، وإن حملت ستة أشهر أرضعت أربعة وعشرين شهرا . وروي أن عثمان قد أتي بامرأة قد ولدت لستة أشهر ، فأراد أن يقضي عليها بالحد ، فقال له علي - رضي الله عنه - : ليس ذلك عليها ، قال الله تعالى : وحمله وفصاله ثلاثون شهرا وقال تعالى : والوالدات يرضعن أولادهن حولين كاملين فالرضاع أربعة وعشرون شهرا والحمل ستة أشهر ، فرجع عثمان عن قوله ولم يحدها . وقد مضى في ( البقرة ) وقيل : لم يعد ثلاثة أشهر في ابتداء الحمل ; لأن الولد فيها نطفة وعلقة ومضغة فلا يكون له ثقل يحس به ، وهو معنى قوله تعالى : فلما تغشاها حملت حملا خفيفا فمرت به . والفصال الفطام . وقد تقدم في ( لقمان ) الكلام فيه . وقرأ الحسن ويعقوب وغيرهما ( وفصله ) بفتح الفاء وسكون الصاد . وروي أن الآية نزلت في أبي بكر الصديق ، وكان حمله وفصاله في ثلاثين شهرا ، حملته أمه تسعة أشهر وأرضعته إحدى وعشرين شهرا . وفي الكلام إضمار ، أي : ومدة حمله ومدة فصاله ثلاثون شهرا ، ولولا هذا الإضمار لنصب ثلاثون على الظرف وتغير المعنى .\nالخامسة : قوله تعالى : حتى إذا بلغ أشده قال ابن عباس : أشده ثماني عشرة سنة . وقال في رواية عطاء عنه : إن أبا بكر صحب النبي - صلى الله عليه وسلم - وهو ابن ثماني عشرة سنة والنبي - صلى الله عليه وسلم - ابن عشرين سنة ، وهم يريدون الشام للتجارة ، فنزلوا منزلا فيه سدرة ، فقعد النبي - صلى الله عليه وسلم - في ظلها ، ومضى أبو بكر إلى راهب هناك فسأله عن الدين . فقال الراهب : من الرجل الذي في ظل الشجرة ؟ فقال : ذاك محمد بن عبد الله بن عبد المطلب . فقال : هذا والله نبي ، وما استظل أحد تحتها بعد عيسى . فوقع في قلب أبي بكر اليقين والتصديق ، وكان لا يكاد يفارق رسول الله - صلى الله عليه وسلم - في أسفاره وحضره . فلما نبئ رسول الله - صلى الله عليه وسلم - وهو ابن أربعين سنة ، صدق أبو بكر - رضي الله عنه - رسول الله - صلى الله عليه وسلم - وهو ابن ثمانية وثلاثين سنة . فلما بلغ أربعين سنة قال : رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي الآية . وقال الشعبي وابن زيد : الأشد : الحلم . وقال الحسن : هو بلوغ الأربعين . وعنه قيام الحجة عليه . وقد مضى في ( الأنعام ) الكلام في الآية . وقال السدي والضحاك : نزلت في سعد بن أبي وقاص . وقد تقدم . وقال الحسن : هي مرسلة نزلت على العموم . والله أعلم .\nالسادسة : قوله تعالى : قال رب أوزعني أي ألهمني . أن أشكر في موضع نصب على المصدر ، أي : شكر نعمتك علي أي ما أنعمت به علي من الهداية وعلى والدي بالتحنن والشفقة حتى ربياني صغيرا . وقيل : أنعمت علي بالصحة والعافية وعلى والدي بالغنى والثروة . وقال علي - رضي الله عنه - : هذه الآية نزلت في أبي بكر الصديق - رضي الله عنه - ، أسلم أبواه جميعا ولم يجتمع لأحد من المهاجرين أن أسلم أبواه غيره ، فأوصاه الله بهما ولزم ذلك من بعده . ووالده هو قحافة عثمان بن عامر بن عمرو بن كعب بن سعد بن تيم . وأمه أم الخير ، واسمها سلمى بنت صخر بن عامر بن كعب بن سعد . وأم أبيه أبي قحافة ( قيلة ) ( بالياء المعجمة باثنتين من تحتها ) وامرأة أبي بكر الصديق اسمها ( قتيلة ) ( بالتاء المعجمة باثنتين من فوقها ) بنت عبد العزى .\nوأن أعمل صالحا ترضاه قال ابن عباس : فأجابه الله فأعتق تسعة من المؤمنين يعذبون في الله منهم بلال وعامر بن فهيرة ، ولم يدع شيئا من الخير إلا أعانه الله عليه . وفي الصحيح عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : [ من أصبح منكم اليوم صائما ] ؟ قال أبو بكر أنا . قال : [ فمن تبع منكم اليوم جنازة ] ؟ قال أبو بكر أنا . قال : [ فمن أطعم منكم اليوم مسكينا ] ؟ قال أبو بكر أنا . قال : [ فمن عاد منكم اليوم مريضا ] ؟ قال أبو بكر أنا . قال رسول الله - صلى الله عليه وسلم - : [ ما اجتمعن في امرئ إلا دخل الجنة ] .\nالسابعة : قوله تعالى : وأصلح لي في ذريتي أي اجعل ذريتي صالحين . قال ابن عباس : فلم يبق له ولد ولا والد ولا والدة إلا آمنوا بالله وحده . ولم يكن أحد من أصحاب رسول الله أسلم هو وأبواه وأولاده وبناته كلهم إلا أبو بكر . وقال سهل بن عبد الله : المعنى اجعلهم لي خلف صدق ، ولك عبيد حق . وقال أبو عثمان : اجعلهم أبرارا لي مطيعين لك . وقال ابن عطاء : وفقهم لصالح أعمال ترضى بها عنهم . وقال محمد بن علي : لا تجعل للشيطان والنفس والهوى عليهم سبيلا . وقال مالك بن مغول : اشتكى أبو معشر ابنه إلى طلحة بن مصرف ، فقال : استعن عليه بهذه الآية ، وتلا : رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأصلح لي في ذريتي إني تبت إليك وإني من المسلمين إني تبت إليك قال ابن عباس : رجعت عن الأمر الذي كنت عليه . وإني من المسلمين أي المخلصين بالتوحيد .\n                                    ",
      "saadi": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهٗا وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِينَ سَنَةٗ قَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَصۡلِحۡ لِي فِي ذُرِّيَّتِيٓۖ إِنِّي تُبۡتُ إِلَيۡكَ وَإِنِّي مِنَ ٱلۡمُسۡلِمِينَ ٥١\n                                        \n                                        \n                                        \n                                        هذا من لطفه تعالى بعباده وشكره للوالدين أن وصى الأولاد وعهد إليهم أن يحسنوا إلى والديهم بالقول اللطيف والكلام اللين وبذل المال والنفقة وغير ذلك من وجوه الإحسان.\nثم نبه على ذكر السبب الموجب لذلك فذكر ما تحملته الأم من ولدها وما قاسته من المكاره وقت حملها ثم مشقة ولادتها المشقة الكبيرة ثم مشقة الرضاع وخدمة الحضانة، وليست المذكورات مدة يسيرة ساعة أو ساعتين،\nوإنما ذلك مدة طويلة قدرها { ثَلَاثُونَ شَهْرًا } للحمل تسعة أشهر ونحوها والباقي للرضاع هذا هو الغالب.\nويستدل بهذه الآية مع قوله: { وَالْوَالِدَاتُ يُرْضِعْنَ أَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ } أن أقل مدة الحمل ستة أشهر لأن مدة الرضاع -وهي سنتان- إذا سقطت منها السنتان بقي ستة أشهر مدة للحمل، { حَتَّى إِذَا بَلَغَ أَشُدَّهُ } أي: نهاية قوته وشبابه وكمال عقله، { وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِي } أي: ألهمني ووفقني { أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ } أي: نعم الدين ونعم الدنيا، وشكره بصرف النعم في طاعة مسديها وموليها ومقابلته منته بالاعتراف والعجز عن الشكر والاجتهاد في الثناء بها على الله، والنعم على الوالدين نعم على أولادهم وذريتهم لأنهم لا بد أن ينالهم منها ومن أسبابها وآثارها، خصوصا نعم الدين فإن صلاح الوالدين بالعلم والعمل من أعظم الأسباب لصلاح أولادهم.\n{ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ } بأن يكون جامعا لما يصلحه سالما مما يفسده، فهذا العمل الذي يرضاه الله ويقبله ويثيب عليه. { وَأَصْلِحْ لِي فِي ذُرِّيَّتِي } لما دعا لنفسه بالصلاح دعا لذريته أن يصلح الله أحوالهم، وذكر أن صلاحهم يعود نفعه على والديهم لقوله: { وَأَصْلِحْ لِي }\n{ إِنِّي تُبْتُ إِلَيْكَ } من الذنوب والمعاصي ورجعت إلى طاعتك { وَإِنِّي مِنَ الْمُسْلِمِينَ }\n                                    "
    }
  },
  {
    "id": 15,
    "versesNumber": 16,
    "souraName": "Al-Ahqaf.html",
    "contnent": "أُوْلَٰٓئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنۡهُمۡ أَحۡسَنَ مَا عَمِلُواْ وَنَتَجَاوَزُ عَن سَيِّ‍َٔاتِهِمۡ فِيٓ أَصۡحَٰبِ ٱلۡجَنَّةِۖ وَعۡدَ ٱلصِّدۡقِ ٱلَّذِي كَانُواْ يُوعَدُونَ ٦١",
    "tafsier": {
      "ibnkther": "أُوْلَٰٓئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنۡهُمۡ أَحۡسَنَ مَا عَمِلُواْ وَنَتَجَاوَزُ عَن سَيِّ‍َٔاتِهِمۡ فِيٓ أَصۡحَٰبِ ٱلۡجَنَّةِۖ وَعۡدَ ٱلصِّدۡقِ ٱلَّذِي كَانُواْ يُوعَدُونَ ٦١\n                                    \n                                    \n                                    قال الله تعالى : ( أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم ) أي : هؤلاء المتصفون بما ذكرنا ، التائبون إلى الله المنيبون إليه ، المستدركون ما فات بالتوبة والاستغفار ، هم الذين يتقبل عنهم أحسن ما عملوا ، ويتجاوز عن سيئاتهم ، فيغفر لهم الكثير من الزلل ، ويتقبل منهم اليسير من العمل ، ( في أصحاب الجنة ) أي : هم في جملة أصحاب الجنة ، وهذا حكمهم عند الله كما وعد الله من تاب إليه وأناب ; ولهذا قال : ( وعد الصدق الذي كانوا يوعدون )\nقال ابن جرير : حدثني يعقوب بن إبراهيم ، حدثنا المعتمر بن سليمان ، عن الحكم بن أبان ، عن الغطريف ، عن جابر بن زيد ، عن ابن عباس ، عن رسول الله - صلى الله عليه وسلم - عن الروح الأمين ، عليه السلام ، قال : \" يؤتى بحسنات العبد وسيئاته ، فيقتص بعضها ببعض ، فإن بقيت حسنة وسع الله له في الجنة \" قال : فدخلت على يزداد فحدث بمثل هذا الحديث قال : قلت : فإن ذهبت الحسنة ؟ قال : ( أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون ) .\nوهكذا رواه ابن أبي حاتم ، عن أبيه ، عن محمد بن عبد الأعلى الصنعاني ، عن المعتمر بن سليمان ، بإسناده مثله - وزاد عن الروح الأمين . قال : قال الرب ، جل جلاله : يؤتى بحسنات العبد وسيئاته . . . فذكره ، وهو حديث غريب ، وإسناد جيد لا بأس به .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا سليمان بن معبد ، حدثنا عمرو بن عاصم الكلائي ، حدثنا أبو عوانة ، عن أبي بشر جعفر بن أبي وحشية ، عن يوسف بن سعد ، عن محمد بن حاطب قال : ونزل في داري حيث ظهر علي على أهل البصرة ، فقال لي يوما : لقد شهدت أمير المؤمنين عليا ، وعنده عمار وصعصعة والأشتر ومحمد بن أبي بكر ، فذكروا عثمان فنالوا منه ، وكان علي ، رضي الله عنه ، على السرير ، ومعه عود في يده ، فقال قائل منهم : إن عندكم من يفصل بينكم ، فسألوه ، فقال علي : كان عثمان من الذين قال الله : ( أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون ) قال : والله عثمان وأصحاب عثمان - قالها ثلاثا - قال يوسف : فقلت لمحمد بن حاطب : آلله لسمعت هذا من علي ؟ قال : آلله لسمعت هذا من علي ، رضي الله عنه .\n                                    ",
      "qortoby": "أُوْلَٰٓئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنۡهُمۡ أَحۡسَنَ مَا عَمِلُواْ وَنَتَجَاوَزُ عَن سَيِّ‍َٔاتِهِمۡ فِيٓ أَصۡحَٰبِ ٱلۡجَنَّةِۖ وَعۡدَ ٱلصِّدۡقِ ٱلَّذِي كَانُواْ يُوعَدُونَ ٦١\n                                    \n                                    \n                                    قوله تعالى : أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون .\nقوله تعالى : أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم قراءة العامة بضم الياء فيهما . وقرئ ( يتقبل ، ويتجاوز ) بفتح الياء ، والضمير فيهما يرجع لله عز وجل . وقرأ حفص وحمزة والكسائي نتقبل ، ونتجاوز النون فيهما ، أي : نغفرها ونصفح عنها . والتجاوز أصله من جزت الشيء إذا لم تقف عليه . وهذه الآية تدل على أن الآية التي قبلها ووصينا الإنسان إلى آخرها مرسلة نزلت على العموم . وهو قول الحسن . ومعنى نتقبل عنهم أي : نتقبل منهم الحسنات ونتجاوز عن السيئات . قال زيد بن أسلم - ويحكيه مرفوعا - : إنهم إذا أسلموا قبلت حسناتهم وغفرت سيئاتهم . وقيل : الأحسن ما يقتضي الثواب من الطاعات ، وليس في الحسن المباح ثواب ولا عقاب ، حكاه ابن عيسى .\nفي أصحاب الجنة في بمعنى مع ، أي : مع أصحاب الجنة ، تقول : أكرمك وأحسن إليك في جميع أهل البلد ، أي : مع جميعهم .\nوعد الصدق نصب لأنه مصدر مؤكد لما قبله ، أي : وعد الله أهل الإيمان أن يتقبل من محسنهم ويتجاوز عن مسيئهم وعد الصدق . وهو من باب إضافة الشيء إلى نفسه لأن الصدق هو ذلك الوعد الذي وعده الله ، وهو كقوله تعالى : حق اليقين وهذا عند الكوفيين ، فأما عند البصريين فتقديره : وعد الكلام الصدق أو الكتاب الصدق ، فحذف الموصوف . وقد مضى هذا في غير موضع . الذي كانوا يوعدون في الدنيا على ألسنة الرسل ، وذلك الجنة .\n                                    ",
      "saadi": "أُوْلَٰٓئِكَ ٱلَّذِينَ نَتَقَبَّلُ عَنۡهُمۡ أَحۡسَنَ مَا عَمِلُواْ وَنَتَجَاوَزُ عَن سَيِّ‍َٔاتِهِمۡ فِيٓ أَصۡحَٰبِ ٱلۡجَنَّةِۖ وَعۡدَ ٱلصِّدۡقِ ٱلَّذِي كَانُواْ يُوعَدُونَ ٦١\n                                        \n                                        \n                                        \n                                        { أُولَئِكَ } الذين ذكرت أوصافهم { الَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا } وهو الطاعات لأنهم يعملون أيضا غيرها. { وَنَتَجاوَزُ عَنْ سَيِّئَاتِهِمْ } فِي جملة { أَصْحَابُ الْجَنَّةِ } فحصل لهم الخير والمحبوب وزال عنهم الشر والمكروه.\n{ وَعْدَ الصِّدْقِ الَّذِي كَانُوا يُوعَدُونَ } أي: هذا الوعد الذي وعدناهم هو وعد صادق من أصدق القائلين الذي لا يخلف الميعاد.\n                                    "
    }
  },
  {
    "id": 16,
    "versesNumber": 17,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَٱلَّذِي قَالَ لِوَٰلِدَيۡهِ أُفّٖ لَّكُمَآ أَتَعِدَانِنِيٓ أَنۡ أُخۡرَجَ وَقَدۡ خَلَتِ ٱلۡقُرُونُ مِن قَبۡلِي وَهُمَا يَسۡتَغِيثَانِ ٱللَّهَ وَيۡلَكَ ءَامِنۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ فَيَقُولُ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٧١",
    "tafsier": {
      "ibnkther": "وَٱلَّذِي قَالَ لِوَٰلِدَيۡهِ أُفّٖ لَّكُمَآ أَتَعِدَانِنِيٓ أَنۡ أُخۡرَجَ وَقَدۡ خَلَتِ ٱلۡقُرُونُ مِن قَبۡلِي وَهُمَا يَسۡتَغِيثَانِ ٱللَّهَ وَيۡلَكَ ءَامِنۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ فَيَقُولُ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٧١\n                                    \n                                    \n                                    لما ذكر تعالى حال الداعين للوالدين البارين بهما وما لهم عنده من الفوز والنجاة ، عطف بحال الأشقياء العاقين للوالدين فقال : ( والذي قال لوالديه أف لكما ) - وهذا عام في كل من قال هذا ، ومن زعم أنها نزلت في عبد الرحمن بن أبي بكر فقوله ضعيف ; لأن عبد الرحمن بن أبي بكر أسلم بعد ذلك وحسن إسلامه ، وكان من خيار أهل زمانه .\nوروى العوفي ، عن ابن عباس : أنها نزلت في ابن لأبي بكر الصديق . وفي صحة هذا نظر ، والله أعلم .\nوقال ابن جريج ، عن مجاهد : نزلت في عبد الله بن أبي بكر . وهذا أيضا قاله ابن جريج .\nوقال آخرون : عبد الرحمن بن أبي بكر . وقاله السدي . وإنما هذا عام في كل من عق والديه وكذب بالحق ، فقال لوالديه : ( أف لكما ) عقهما .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا محمد بن العلاء ، حدثنا يحيى بن أبي زائدة ، عن إسماعيل بن أبي خالد ، أخبرني عبد الله بن المديني قال : إني لفي المسجد حين خطب مروان ، فقال : إن الله أرى أمير المؤمنين في يزيد رأيا حسنا ، وإن يستخلفه فقد استخلف أبو بكر عمر ، فقال عبد الرحمن بن أبي بكر : أهرقلية ؟ ! إن أبا بكر والله ما جعلها في أحد من ولده ، ولا أحد من أهل بيته ، ولا جعلها معاوية في ولده إلا رحمة وكرامة لولده . فقال مروان : ألست الذي قال لوالديه : أف لكما ؟ فقال عبد الرحمن : ألست ابن اللعين الذي لعن رسول الله - صلى الله عليه وسلم - أباك ؟ قال : وسمعتهما عائشة فقالت : يا مروان ، أنت القائل لعبد الرحمن كذا وكذا ؟ كذبت ، ما فيه نزلت ، ولكن نزلت في فلان بن فلان . ثم انتحب مروان ، ثم نزل عن المنبر حتى أتى باب حجرتها ، فجعل يكلمها حتى انصرف .\nوقد رواه البخاري بإسناد آخر ولفظ آخر ، فقال : حدثنا موسى بن إسماعيل ، حدثنا أبو عوانة ، عن أبي بشر ، عن يوسف بن ماهك قال : كان مروان على الحجاز ، استعمله معاوية بن أبي سفيان ، فخطب وجعل يذكر يزيد بن معاوية لكي يبايع له بعد أبيه ، فقال له عبد الرحمن بن أبي بكر شيئا ، فقال : خذوه . فدخل بيت عائشة ، رضي الله عنها ، فلم يقدروا عليه ، فقال مروان : إن هذا الذي أنزل فيه : ( والذي قال لوالديه أف لكما أتعدانني أن أخرج وقد خلت القرون من قبلي ) فقالت عائشة من وراء الحجاب : ما أنزل الله فينا شيئا من القرآن ، إلا أن الله أنزل عذري .\nطريق أخرى : قال النسائي : حدثنا علي بن الحسين ، حدثنا أمية بن خالد ، حدثنا شعبة ، عن محمد بن زياد قال : لما بايع معاوية لابنه ، قال مروان : سنة أبي بكر وعمر . فقال عبد الرحمن بن أبي بكر : سنة هرقل وقيصر . فقال مروان : هذا الذي أنزل الله فيه : ( والذي قال لوالديه أف لكما ) الآية ، فبلغ ذلك عائشة فقالت : كذب مروان ! والله ما هو به ، ولو شئت أن أسمي الذي أنزلت فيه لسميته ، ولكن رسول الله - صلى الله عليه وسلم - لعن أبا مروان ومروان في صلبه ، فمروان فضض من لعنة الله .\nوقوله : ( أتعدانني أن أخرج ) أي : [ أن ] أبعث ( وقد خلت القرون من قبلي ) أن قد مضى الناس فلم يرجع منهم مخبر ، ( وهما يستغيثان الله ) أي : يسألان الله فيه أن يهديه ويقولان لولدهما : ( ويلك آمن إن وعد الله حق فيقول ما هذا إلا أساطير الأولين ) قال الله [ تعالى ] ( أولئك الذين حق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين ) أي : دخلوا في زمرة أشباههم وأضرابهم من الكافرين الخاسرين أنفسهم وأهليهم يوم القيامة .\n                                    ",
      "qortoby": "وَٱلَّذِي قَالَ لِوَٰلِدَيۡهِ أُفّٖ لَّكُمَآ أَتَعِدَانِنِيٓ أَنۡ أُخۡرَجَ وَقَدۡ خَلَتِ ٱلۡقُرُونُ مِن قَبۡلِي وَهُمَا يَسۡتَغِيثَانِ ٱللَّهَ وَيۡلَكَ ءَامِنۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ فَيَقُولُ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٧١\n                                    \n                                    \n                                    قوله تعالى : والذي قال لوالديه أف لكما أتعدانني أن أخرج وقد خلت القرون من قبلي وهما يستغيثان الله ويلك آمن إن وعد الله حق فيقول ما هذا إلا أساطير الأولين\nقوله تعالى : والذي قال لوالديه أف لكما أتعدانني أن أخرج أي : أن أبعث . وقد خلت القرون من قبلي قراءة نافع وحفص وغيرهما أف مكسور منون . وقرأ ابن كثير وابن محيصن وابن عامر والمفضل عن عاصم ( أف ) بالفتح من غير تنوين . الباقون بالكسر غير منون ، وكلها لغات ، وقد مضى في ( بني إسرائيل ) وقراءة العامة أتعدانني بنونين مخففتين . وفتح ياءه أهل المدينة ومكة . وأسكن الباقون . وقرأ أبو حيوة والمغيرة وهشام ( أتعداني ) بنون واحدة مشددة ، وكذلك هي في مصاحف أهل الشام . والعامة على ضم الألف وفتح الراء من أن أخرج وقرأ الحسن ونصر وأبو العالية والأعمش وأبو معمر بفتح الألف وضم الراء . قال ابن عباس والسدي وأبو العالية ومجاهد : نزلت في عبد الله بن أبي بكر - رضي الله عنهما ، وكان يدعوه أبواه إلى الإسلام فيجيبهما بما أخبر الله عز وجل . وقال قتادة والسدي أيضا : هو عبد الرحمن بن أبي بكر قبل إسلامه ، وكان أبوه وأمه أم رومان يدعوانه إلى الإسلام ويعدانه بالبعث ، فيرد عليهما بما حكاه الله - عز وجل - عنه ، وكان هذا منه قبل إسلامه . وروي أن عائشة رضي الله عنها أنكرت أن تكون نزلت في عبد الرحمن . وقال الحسن وقتادة أيضا : هي نعت عبد كافر عاق لوالديه . وقال الزجاج : كيف يقال نزلت في عبد الرحمن قبل إسلامه والله - عز وجل - يقول : أولئك الذين حق عليهم القول في أمم أي : العذاب ، ومن ضرورته عدم الإيمان ، وعبد الرحمن من أفاضل المؤمنين ، فالصحيح أنها نزلت في عبد كافر عاق لوالديه .\nوقال محمد بن زياد : كتب معاوية إلى مروان بن الحكم حتى يبايع الناس ليزيد ، فقال عبد الرحمن بن أبي بكر : لقد جئتم بها هرقلية ، أتبايعون لأبنائكم فقال مروان : هو الذي يقول الله فيه : والذي قال لوالديه أف لكما الآية . فقال : والله ما هو به . ولو شئت لسميت ، ولكن الله لعن أباك وأنت في صلبه ، فأنت فضض من لعنة الله . قال المهدوي : ومن جعل الآية في عبد الرحمن كان قوله بعد ذلك أولئك الذين حق عليهم القول يراد به من اعتقد ما تقدم ذكره ، فأول الآية خاص وآخرها عام . وقيل : إن عبد الرحمن لما قال : وقد خلت القرون من قبلي قال مع ذلك : فأين عبد الله بن جدعان ، وأين عثمان بن عمرو ، وأين عامر بن كعب ومشايخ قريش حتى أسألهم عما يقولون . فقوله : أولئك الذين حق عليهم القول يرجع إلى أولئك الأقوام .\nقلت : قد مضى من خبر عبد الرحمن بن أبي بكر في سورة ( الأنعام ) عند قوله : له أصحاب يدعونه إلى الهدى ما يدل على نزول هذه الآية فيه ، إذ كان كافرا وعند إسلامه وفضله تعين أنه ليس المراد بقوله : أولئك الذين حق عليهم القول وهما يعني والديه . يستغيثان الله أي يدعوان الله له بالهداية . أو يستغيثان بالله من كفره ، فلما حذف الجار وصل الفعل فنصب . وقيل : الاستغاثة الدعاء ، فلا حاجة إلى الباء . قال الفراء : أجاب الله دعاءه وغواثه . ويلك آمن أي صدق بالبعث . إن وعد الله حق أي صدق لا خلف فيه . فيقول ما هذا أي ما يقوله والداه . إلا أساطير الأولين أي أحاديثهم وما سطروه مما لا أصل له .\n                                    ",
      "saadi": "وَٱلَّذِي قَالَ لِوَٰلِدَيۡهِ أُفّٖ لَّكُمَآ أَتَعِدَانِنِيٓ أَنۡ أُخۡرَجَ وَقَدۡ خَلَتِ ٱلۡقُرُونُ مِن قَبۡلِي وَهُمَا يَسۡتَغِيثَانِ ٱللَّهَ وَيۡلَكَ ءَامِنۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ فَيَقُولُ مَا هَٰذَآ إِلَّآ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٧١\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى حال الصالح البار لوالديه ذكر حالة العاق وأنها شر الحالات فقال: { وَالَّذِي قَالَ لِوَالِدَيْهِ } إذ دعواه إلى الإيمان بالله واليوم الآخر وخوفاه الجزاء.\nوهذا أعظم إحسان يصدر من الوالدين لولدهما أن يدعواه إلى ما فيه سعادته الأبدية وفلاحه السرمدي فقابلهما بأقبح مقابلة فقال: { أُفٍّ لَكُمَا } أي: تبا لكما ولما جئتما به.\nثم ذكر وجه استبعاده وإنكاره لذلك فقال: { أَتَعِدَانِنِي أَنْ أُخْرَجَ } من قبري إلى يوم القيامة { وَقَدْ خَلَتِ الْقُرُونُ مِنْ قَبْلِي } على التكذيب وسلفوا على الكفر وهم الأئمة المقتدى بهم لكل كفور وجهول ومعاند؟ { وَهُمَا } أي: والداه { يَسْتَغِيثَانِ اللَّهَ } عليه ويقولان له: { وَيْلَكَ آمِنْ } أي: يبذلان غاية جهدهما ويسعيان في هدايته أشد السعي حتى إنهما -من حرصهما عليه- أنهما يستغيثان الله له استغاثة الغريق ويسألانه سؤال الشريق ويعذلان ولدهما ويتوجعان له ويبينان له الحق فيقولان: { إِنَّ وَعْدَ اللَّهِ حَقٌّ } ثم يقيمان عليه من الأدلة ما أمكنهما، وولدهما لا يزداد إلا عتوا ونفورا واستكبارا عن الحق وقدحا فيه، { فَيَقُولُ مَا هَذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ } أي: إلا منقول من كتب المتقدمين ليس من عند الله ولا أوحاه الله إلى رسوله، وكل أحد يعلم أن محمدا صلى الله عليه وسلم أمي لا يكتب ولا يقرأ ولا تعلم من أحد، فمن أين يتعلمه؟ وأنى للخلق أن يأتوا بمثل هذا القرآن ولو كان بعضهم لبعض ظهيرا؟.\n                                    "
    }
  },
  {
    "id": 17,
    "versesNumber": 18,
    "souraName": "Al-Ahqaf.html",
    "contnent": "أُوْلَٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ ٨١",
    "tafsier": {
      "ibnkther": "أُوْلَٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ ٨١\n                                    \n                                    \n                                    وقوله : ( أولئك ) بعد قوله : ( والذي قال ) دليل على ما ذكرناه من أنه جنس يعم كل من كان كذلك .\nوقال الحسن وقتادة : هو الكافر الفاجر العاق لوالديه ، المكذب بالبعث .\nوقد روى الحافظ ابن عساكر في ترجمة سهل بن داود ، من طريق هشام بن عمار : حدثنا حماد بن عبد الرحمن ، حدثنا خالد بن الزبرقان الحلبي ، عن سليمان بن حبيب المحاربي ، عن أبي أمامة الباهلي ، عن النبي - صلى الله عليه وسلم - قال : \" أربعة لعنهم الله من فوق عرشه ، وأمنت عليهم الملائكة : مضل المساكين - قال خالد : الذي يهوي بيده إلى المسكين فيقول : هلم أعطيك ، فإذا جاءه قال : ليس معي شيء - والذي يقول للمكفوف : اتق الدابة ، وليس بين يديه شيء . والرجل يسأل عن دار القوم فيدلونه على غيرها ، والذي يضرب الوالدين حتى يستغيثا \" . غريب جدا .\n                                    ",
      "qortoby": "أُوْلَٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ ٨١\n                                    \n                                    \n                                    أولئك الذين حق عليهم القول يعني الذين أشار إليهم ابن أبي بكر في قوله أحيوا لي مشايخ قريش ، وهم المعنيون بقوله : وقد خلت القرون من قبلي فأما ابن أبي بكر عبد الله أو عبد الرحمن فقد أجاب الله فيه دعاء أبيه في قوله : وأصلح لي في ذريتي على ما تقدم . حق عليهم القول أي ، وجب عليهم العذاب ، وهي كلمة الله : [ هؤلاء في الجنة ولا أبالي وهؤلاء في النار ولا أبالي ] . في أمم أي مع أمم قد خلت من قبلهم تقدمت ومضت . من الجن والإنس الكافرين إنهم أي تلك الأمم الكافرة كانوا خاسرين لأعمالهم ، أي : ضاع سعيهم وخسروا الجنة .\n                                    ",
      "saadi": "أُوْلَٰٓئِكَ ٱلَّذِينَ حَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ ٨١\n                                        \n                                        \n                                        \n                                        { أُولَئِكَ الَّذِينَ } بهذه الحالة الذميمة { حَقَّ عَلَيْهِمُ الْقَوْلُ } أي: حقت عليهم كلمة العذاب { فِي } جملة { أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ الْجِنِّ وَالْإِنْسِ } على الكفر والتكذيب فسيدخل هؤلاء في غمارهم وسيغرقون في تيارهم.\n{ إِنَّهُمْ كَانُوا خَاسِرِينَ } والخسران فوات رأس مال الإنسان، وإذا فقد رأس ماله فالأرباح من باب أولى وأحرى، فهم قد فاتهم الإيمان ولم يحصلوا على شيء من النعيم ولا سلموا من عذاب الجحيم.\n                                    "
    }
  },
  {
    "id": 18,
    "versesNumber": 19,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَلِكُلّٖ دَرَجَٰتٞ مِّمَّا عَمِلُواْۖ وَلِيُوَفِّيَهُمۡ أَعۡمَٰلَهُمۡ وَهُمۡ لَا يُظۡلَمُونَ ٩١",
    "tafsier": {
      "ibnkther": "وَلِكُلّٖ دَرَجَٰتٞ مِّمَّا عَمِلُواْۖ وَلِيُوَفِّيَهُمۡ أَعۡمَٰلَهُمۡ وَهُمۡ لَا يُظۡلَمُونَ ٩١\n                                    \n                                    \n                                    وقوله : ( ولكل درجات مما عملوا ) أي : لكل عذاب بحسب عمله ، ( وليوفيهم أعمالهم وهم لا يظلمون ) أي : لا يظلمهم مثقال ذرة فما دونها .\nقال عبد الرحمن بن زيد بن أسلم : درجات النار تذهب سفالا ودرجات الجنة تذهب علوا .\n                                    ",
      "qortoby": "وَلِكُلّٖ دَرَجَٰتٞ مِّمَّا عَمِلُواْۖ وَلِيُوَفِّيَهُمۡ أَعۡمَٰلَهُمۡ وَهُمۡ لَا يُظۡلَمُونَ ٩١\n                                    \n                                    \n                                    قوله تعالى : ولكل درجات مما عملوا وليوفيهم أعمالهم وهم لا يظلمون .\nقوله تعالى : ولكل درجات أي ولكل واحد من الفريقين المؤمنين والكافرين من الجن والإنس مراتب عند الله يوم القيامة بأعمالهم . قال ابن زيد : درجات أهل النار في هذه الآية تذهب سفالا ، ودرج أهل الجنة علوا . وليوفيهم أعمالهم قرأ ابن كثير وابن محيصن وعاصم وأبو عمرو ويعقوب بالياء لذكر الله قبله ، وهو قوله تعالى : إن وعد الله حق واختاره أبو حاتم . الباقون بالنون ردا على قوله تعالى : ووصينا الإنسان بوالديه وهو اختيار أبي عبيد . وهم لا يظلمون أي لا يزاد على مسيء ولا ينقص من محسن .\n                                    ",
      "saadi": "وَلِكُلّٖ دَرَجَٰتٞ مِّمَّا عَمِلُواْۖ وَلِيُوَفِّيَهُمۡ أَعۡمَٰلَهُمۡ وَهُمۡ لَا يُظۡلَمُونَ ٩١\n                                        \n                                        \n                                        \n                                        { وَلِكُلٍّ } من أهل الخير وأهل الشر { دَرَجَاتٌ مِمَّا عَمِلُوا } أي: كل على حسب مرتبته من الخير والشر ومنازلهم في الدار الآخرة على قدر أعمالهم ولهذا قال: { وَلِيُوَفِّيَهُمْ أَعْمَالَهُمْ وَهُمْ لَا يُظْلَمُونَ } بأن لا يزاد في سيئاتهم ولا ينقص من حسناتهم.\n                                    "
    }
  },
  {
    "id": 19,
    "versesNumber": 20,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَيِّبَٰتِكُمۡ فِي حَيَاتِكُمُ ٱلدُّنۡيَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ ٠٢",
    "tafsier": {
      "ibnkther": "وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَيِّبَٰتِكُمۡ فِي حَيَاتِكُمُ ٱلدُّنۡيَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ ٠٢\n                                    \n                                    \n                                    وقوله : ( ويوم يعرض الذين كفروا على النار أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها ) أي : يقال لهم ذلك تقريعا وتوبيخا . وقد تورع [ أمير المؤمنين ] عمر بن الخطاب - رضي الله عنه - عن كثير من طيبات المآكل والمشارب ، وتنزه عنها ، ويقول : [ إني ] أخاف أن أكون كالذين قال الله تعالى لهم وقرعهم : ( أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها )\nوقال أبو مجلز : ليتفقدن أقوام حسنات كانت لهم في الدنيا ، فيقال لهم : ( أذهبتم طيباتكم في حياتكم الدنيا )\nوقوله : ( فاليوم تجزون عذاب الهون بما كنتم تستكبرون في الأرض بغير الحق وبما كنتم تفسقون ) فجوزوا من جنس عملهم ، فكما نعموا أنفسهم واستكبروا عن اتباع الحق ، وتعاطوا الفسق والمعاصي ، جازاهم الله بعذاب الهون ، وهو الإهانة والخزي والآلام الموجعة ، والحسرات المتتابعة والمنازل في الدركات المفظعة ، أجارنا الله من ذلك كله .\n                                    ",
      "qortoby": "وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَيِّبَٰتِكُمۡ فِي حَيَاتِكُمُ ٱلدُّنۡيَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ ٠٢\n                                    \n                                    \n                                    قوله تعالى : ويوم يعرض الذين كفروا على النار أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها فاليوم تجزون عذاب الهون بما كنتم تستكبرون في الأرض بغير الحق وبما كنتم تفسقون .\nقوله تعالى : ويوم يعرض أي ذكرهم يا محمد يوم يعرض . الذين كفروا على النار أي يكشف الغطاء فيقربون من النار وينظرون إليها . أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها أي يقال لهم أذهبتم ، فالقول مضمر . وقرأ الحسن ونصر وأبو العالية ويعقوب وابن كثير ( أأذهبتم ) بهمزتين مخففتين ، واختاره أبو حاتم . وقرأ أبو حيوة وهشام ( آذهبتم ) بهمزة واحدة مطولة على الاستفهام . الباقون بهمزة واحدة من غير مد على الخبر ، وكلها لغات فصيحة ومعناها التوبيخ ، والعرب توبخ بالاستفهام وبغير الاستفهام ، وقد تقدم . واختار أبو عبيد ترك الاستفهام لأنه قراءة أكثر أئمة السبعة نافع وعاصم وأبي عمرو وحمزة والكسائي ، مع من وافقهم شيبة والزهري وابن محيصن والمغيرة بن أبي شهاب ويحيى بن الحارث والأعمش ويحيى بن وثاب وغيرهم ، فهذه عليها جلة الناس . وترك الاستفهام أحسن ; لأن إثباته يوهم أنهم لم يفعلوا ذلك ، كما تقول : أنا ظلمتك ؟ تريد أنا لم أظلمك . وإثباته حسن أيضا ، يقول القائل : ذهبت ؟ فعلت كذا ؟ ، يوبخ ويقول : أذهبت ؟ فعلت ؟ . كل ذلك جائز . ومعنى أذهبتم طيباتكم أي : تمتعتم بالطيبات في الدنيا واتبعتم الشهوات واللذات ، يعني المعاصي . فاليوم تجزون عذاب الهون أي عذاب الخزي والفضيحة . قال مجاهد : الهون الهوان . قتادة : بلغة قريش .\n[ قوله تعالى : ] بما كنتم تستكبرون في الأرض بغير الحق أي تستعلون على أهلها بغير استحقاق . وبما كنتم تفسقون في أفعالكم بغيا وظلما . وقيل : أذهبتم طيباتكم أي : أفنيتم شبابكم في الكفر والمعاصي . قال ابن بحر : الطيبات الشباب والقوة ، مأخوذ من قولهم : ذهب أطيباه ، أي : شبابه وقوته . قال الماوردي : ووجدت الضحاك قاله أيضا .\nقلت : القول الأول أظهر ، روى الحسن عن الأحنف بن قيس أنه سمع عمر بن الخطاب - رضي الله عنه - يقول : لأنا أعلم بخفض العيش ، ولو شئت لجعلت أكبادا وصلاء وصنابا وصلائق ، ولكني أستبقي حسناتي ، فإن الله - عز وجل - وصف أقواما فقال : أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها وقال أبو عبيد في حديث عمر : لو شئت لدعوت بصلائق وصناب وكراكر وأسنمة . وفي بعض الحديث : وأفلاذ . قال أبو عمرو وغيره : الصلاء ( بالمد والكسر ) : الشواء ، سمي بذلك لأنه يصلى بالنار . والصلاء أيضا : صلاء النار ، فإن فتحت الصاد قصرت وقلت : صلى النار . والصناب : الأصبغة المتخذة من الخردل والزبيب . قال أبو عمرو : ولهذا قيل للبرذون : صنابي ، وإنما شبه لونه بذلك . قال : والسلائق ( بالسين ) هو ما يسلق من البقول وغيرها . وقال غيره : هي الصلائق بالصاد ، قال جرير :\nتكلفني معيشة آل زيد ومن لي بالصلائق والصناب\nوالصلائق : الخبز الرقاق العريض . وقد مضى هذا المعنى في ( الأعراف ) . وأما الكراكر فكراكر الإبل ، واحدتها كركرة وهي معروفة ، هذا قول أبي عبيد . وفي الصحاح : والكركرة رحى زور البعير ، وهي إحدى النفثات الخمس . والكركرة أيضا الجماعة من الناس . وأبو مالك عمرو بن كركرة رجل من علماء اللغة . قال أبو عبيد : وأما الأفلاذ فإن واحدها فلذ ، وهي القطعة من الكبد . قال أعشى باهلة :\nتكفيه حزة فلذ إن ألم بها من الشواء ويروي شربه الغمر\nوقال قتادة : ذكر لنا أن عمر - رضي الله عنه - قال : لو شئت كنت أطيبكم طعاما ، وألينكم لباسا ، ولكني أستبقي طيباتي للآخرة . ولما قدم عمر الشام صنع له طعام لم ير قط مثله قال : هذا لنا! فما لفقراء المسلمين الذين ماتوا وما شبعوا من خبز الشعير فقالخالد بن الوليد : لهم الجنة ، فاغرورقت عينا عمر بالدموع وقال : لئن كان حظنا من الدنيا هذا الحطام ، وذهبوا هم في حظهم بالجنة فلقد باينونا بونا بعيدا . وفي صحيح مسلم وغيره أن عمر - رضي الله عنه - دخل على النبي - صلى الله عليه وسلم - وهو في مشربته حين هجر نساءه قال : فالتفت فلم أر شيئا يرد البصر إلا أهبا جلودا معطونة قد سطع ريحها ، فقلت : يا رسول الله ، أنت رسول الله وخيرته ، وهذا كسرى وقيصر في الديباج والحرير ؟ قال : فاستوى جالسا وقال : ( أفي شك أنت يا ابن الخطاب . أولئك قوم عجلت لهم طيباتهم في حياتهم الدنيا ) فقلت : استغفر لي فقال : ( اللهم اغفر له ) .\nوقال حفص بن أبي العاص : كنت أتغدى عند عمر بن الخطاب - رضي الله عنه - الخبز والزيت ، والخبز والخل ، والخبز واللبن ، والخبز والقديد ، وأقل ذلك اللحم الغريض . وكان يقول : لا تنخلوا الدقيق فإنه طعام كله ، فجيء بخبز متفلع غليظ ، فجعل يأكل ويقول : كلوا ، فجعلنا لا نأكل ، فقال : ما لكم لا تأكلون ؟ فقلنا : والله يا أمير المؤمنين نرجع إلى طعام ألين من طعامك هذا ، فقال : يا ابن أبي العاص أما ترى بأني عالم أن لو أمرت بعناق سمينة فيلقى عنها شعرها ثم تخرج مصلية كأنها كذا وكذا ، أما ترى بأني عالم أن لو أمرت بصاع أو صاعين من زبيب فأجعله في سقاء ثم أشن عليه من الماء فيصبح كأنه دم غزال ، فقلت : يا أمير المؤمنين ، أجل ما تنعت العيش ، قال : أجل والله الذي لا إله إلا هو لولا أني أخاف أن تنقص حسناتي يوم القيامة لشاركناكم في العيش ولكني سمعت الله تعالى يقول لأقوام : أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها فاليوم تجزون عذاب الهون أي : الهوان . بما كنتم تستكبرون في الأرض بغير الحق أي : تتعظمون عن طاعة الله وعلى عباد الله . وبما كنتم تفسقون تخرجون عن طاعة الله . وقال جابر : اشتهى أهلي لحما فاشتريته لهم فمررت بعمر بن الخطاب - رضي الله عنه - فقال : ما هذا يا جابر ؟ فأخبرته ، فقال : أوكلما اشتهى أحدكم شيئا جعله في بطنه أما يخشى أن يكون من أهل هذه الآية : أذهبتم طيباتكم الآية . قال ابن العربي : وهذا عتاب منه له على التوسع بابتياع اللحم والخروج عن جلف الخبز والماء ، فإن تعاطي الطيبات من الحلال تستشره لها الطباع وتستمرئها العادة فإذا فقدتها استسهلت في تحصيلها بالشبهات حتى تقع في الحرام المحض بغلبة العادة واستشراه الهوى على النفس الأمارة بالسوء . فأخذ عمر الأمر من أوله وحماه من ابتدائه كما يفعله مثله . والذي يضبط هذا الباب ويحفظ قانونه : على المرء أن يأكل ما وجد ، طيبا كان أو قفارا ، ولا يتكلف الطيب ويتخذه عادة ، وقد كان النبي - صلى الله عليه وسلم - يشبع إذا وجد ، ويصبر إذا عدم ، ويأكل الحلوى إذا قدر عليها ، ويشرب العسل إذا اتفق له ، ويأكل اللحم إذا تيسر ، ولا يعتمد أصلا ، ولا يجعله ديدنا . ومعيشة النبي - صلى الله عليه وسلم - معلومة ، وطريقة الصحابة منقولة ، فأما اليوم عند استيلاء الحرام وفساد الحطام فالخلاص عسير ، والله يهب الإخلاص ، ويعين على الخلاص برحمته . وقيل : إن التوبيخ واقع على ترك الشكر لا على تناول الطيبات المحللة ، وهو حسن ، فإن تناول الطيب الحلال مأذون فيه ، فإذا ترك الشكر عليه واستعان به على ما لا يحل له فقد أذهبه . والله أعلم .\n                                    ",
      "saadi": "وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَيِّبَٰتِكُمۡ فِي حَيَاتِكُمُ ٱلدُّنۡيَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ ٠٢\n                                        \n                                        \n                                        \n                                        يذكر تعالى حال الكفار عند عرضهم على النار حين يوبخون ويقرعون فيقال لهم: { أَذْهَبْتُمْ طَيِّبَاتِكُمْ فِي حَيَاتِكُمُ الدُّنْيَا } حيث اطمأننتم إلى الدنيا، واغتررتم بلذاتها ورضيتم بشهواتها وألهتكم طيباتها عن السعي لآخرتكم وتمتعتم تمتع الأنعام السارحة فهي حظكم من آخرتكم، { فَالْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ } أي: العذاب الشديد الذي يهينكم ويفضحكم بما كنتم تقولون على الله غير الحق، أي: تنسبون الطريق الضالة التي أنتم عليها إلى الله وإلى حكمه وأنتم كذبة في ذلك، { وَبِمَا كُنْتُمْ تَفْسُقُونَ } أي: تتكبرون عن طاعته، فجمعوا بين قول الباطل والعمل بالباطل والكذب على الله بنسبته إلى رضاه والقدح في الحق والاستكبار عنه فعوقبوا أشد العقوبة.\n                                    "
    }
  },
  {
    "id": 20,
    "versesNumber": 21,
    "souraName": "Al-Ahqaf.html",
    "contnent": "۞ وَٱذۡكُرۡ أَخَا عَادٍ إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦٓ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ عَظِيمٖ ١٢",
    "tafsier": {
      "ibnkther": "۞ وَٱذۡكُرۡ أَخَا عَادٍ إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦٓ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ عَظِيمٖ ١٢\n                                    \n                                    \n                                    يقول تعالى مسليا لنبيه في تكذيب من كذبه من قومه : ( واذكر أخا عاد ) وهو هود ، عليه السلام ، بعثه الله إلى عاد الأولى ، وكانوا يسكنون الأحقاف - جمع حقف وهو : الجبل من الرمل - قاله ابن زيد . وقال عكرمة : الأحقاف : الجبل والغار . وقال علي بن أبي طالب ، رضي الله عنه : الأحقاف : واد بحضرموت ، يدعى برهوت ، تلقى فيه أرواح الكفار . وقال قتادة : ذكر لنا أن عادا كانوا حيا باليمن أهل رمل مشرفين على البحر بأرض يقال لها : الشحر .\nقال ابن ماجه : \" باب إذا دعا فليبدأ بنفسه \" : حدثنا الحسين بن علي الخلال ، حدثنا زيد بن الحباب ، حدثنا سفيان ، عن أبي إسحاق ، عن سعيد بن جبير ، عن ابن عباس قال : قال رسول الله - صلى الله عليه وسلم - : \" يرحمنا الله ، وأخا عاد \" .\nوقوله : ( وقد خلت النذر من بين يديه ومن خلفه ) يعني : وقد أرسل الله إلى من حول بلادهم من القرى مرسلين ومنذرين ، كقوله : ( فجعلناها نكالا لما بين يديها وما خلفها ) [ البقرة : 66 ] ، وكقوله : ( فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود إذ جاءتهم الرسل من بين أيديهم ومن خلفهم ألا تعبدوا إلا الله قالوا لو شاء ربنا لأنزل ملائكة فإنا بما أرسلتم به كافرون ) [ فصلت : 13 ، 14 ] أي : قال لهم هود ذلك\n                                    ",
      "qortoby": "۞ وَٱذۡكُرۡ أَخَا عَادٍ إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦٓ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ عَظِيمٖ ١٢\n                                    \n                                    \n                                    قوله تعالى : واذكر أخا عاد إذ أنذر قومه بالأحقاف وقد خلت النذر من بين يديه ومن خلفه ألا تعبدوا إلا الله إني أخاف عليكم عذاب يوم عظيم .\nقوله تعالى : واذكر أخا عاد هو هود بن عبد الله بن رباح - عليه السلام - ، كان أخاهم في النسب لا في الدين . إذ أنذر قومه بالأحقاف أي اذكر لهؤلاء المشركين قصة عاد ليعتبروا بها . وقيل : أمره بأن يتذكر في نفسه قصة هود ليقتدي به ، ويهون عليه تكذيب قومه له . والأحقاف : ديار عاد . وهي الرمال العظام ، في قول الخليل وغيره . وكانوا قهروا أهل الأرض بفضل قوتهم . والأحقاف جمع حقف ، وهو ما استطال من الرمل العظيم واعوج ولم يبلغ أن يكون جبلا ، والجمع حقاف وأحقاف وحقوف . واحقوقف الرمل والهلال أي : اعوج . وقيل : الحقف جمع حقاف . والأحقاف جمع الجمع . ويقال : حقف أحقف . قال الأعشى : .\nبات إلى أرطاة حقف أحقفا\nأي : رمل مستطيل مشرف . والفعل منه احقوقف . قال العجاج :\nطي الليالي زلفا فزلفا سماوة الهلال حتى احقوقفا\nأي : انحنى واستدار . وقال امرؤ القيس :\nكحقف النقا يمشي الوليدان فوقه بما احتسبا من لين مس وتسهال\nوفيما أريد بالأحقاف هاهنا مختلف فيه . فقال ابن زيد : هي رمال مشرفة مستطيلة كهيئة الجبال ، ولم تبلغ أن تكون جبالا ، وشاهده ما ذكرناه . وقال قتادة : هي جبال مشرفة بالشحر ، والشحر قريب من عدن ، يقال : شحر عمان وشحر عمان ، وهو ساحل البحر بين عمان وعدن . وعنه أيضا : ذكر لنا أن عادا كانوا أحياء باليمن ، أهل رمل مشرفين على البحر بأرض يقال لها : الشحر .\nوقال مجاهد : هي أرض من حسمى تسمى بالأحقاف . وحسمى ( بكسر الحاء ) اسم أرض بالبادية فيها جبال شواهق ملس الجوانب لا يكاد القتام يفارقها . قال النابغة :\nفأصبح عاقلا بجبال حسمى دقاق الترب محتزم القتام\nقاله الجوهري . وقال ابن عباس والضحاك : الأحقاف جبل بالشام . وعن ابن عباس أيضا : واد بين عمان ومهرة . وقال مقاتل : كانت منازل عاد باليمن في حضرموت بواد يقال له مهرة ، وإليه تنسب الإبل المهرية ، فيقال : إبل مهرية ومهاري . وكانوا أهل عمد سيارة في الربيع فإذا هاج العود رجعوا إلى منازلهم ، وكانوا من قبيلة إرم . وقال الكلبي : أحقاف الجبل ما نضب عنه الماء زمان الغرق ، كان ينضب الماء من الأرض ويبقى أثره .\nوروى الطفيل عن علي بن أبي طالب - رضي الله عنه - أنه قال : خير واديين في الناس واد بمكة وواد نزل به آدم بأرض الهند . وشر واديين في الناس واد بالأحقاف وواد بحضرموت يدعى برهوت تلقى فيه أرواح الكفار . وخير بئر في الناس بئر زمزم . وشر بئر في الناس بئر برهوت ، وهو في ذلك الوادي الذي بحضرموت . وقد خلت النذر أي مضت الرسل . من بين يديه أي من قبل هود . ومن خلفه أي ومن بعده ، قاله الفراء . وفي قراءة ابن مسعود ( من بين يديه ومن بعده ) . ألا تعبدوا إلا الله هذا من قول المرسل ، فهو كلام معترض . ثم قال هود : إني أخاف عليكم عذاب يوم عظيم وقيل : ألا تعبدوا إلا الله من كلام هود ، والله أعلم .\n                                    ",
      "saadi": "۞ وَٱذۡكُرۡ أَخَا عَادٍ إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦٓ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ عَظِيمٖ ١٢\n                                        \n                                        \n                                        \n                                        أي: { وَاذْكُرْ } بالثناء الجميل { أَخَا عَادٍ } وهو هود عليه السلام، حيث كان من الرسل الكرام الذين فضلهم الله تعالى بالدعوة إلى دينه وإرشاد الخلق إليه.\n{ إِذْ أَنْذَرَ قَوْمَهُ } وهم عاد { بِالْأَحْقَافِ } أي: في منازلهم المعروفة بالأحقاف وهي: الرمال الكثيرة في أرض اليمن.\n{ وَقَدْ خَلَتِ النُّذُرُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ } فلم يكن بدعا منهم ولا مخالفا لهم، قائلا لهم: { أَلَّا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ }\nفأمرهم بعبادة الله الجامعة لكل قول سديد وعمل حميد، ونهاهم عن الشرك والتنديد وخوفهم -إن لم يطيعوه- العذاب الشديد فلم تفد فيهم تلك الدعوة.\n                                    "
    }
  },
  {
    "id": 21,
    "versesNumber": 22,
    "souraName": "Al-Ahqaf.html",
    "contnent": "قَالُوٓاْ أَجِئۡتَنَا لِتَأۡفِكَنَا عَنۡ ءَالِهَتِنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٢٢",
    "tafsier": {
      "ibnkther": "قَالُوٓاْ أَجِئۡتَنَا لِتَأۡفِكَنَا عَنۡ ءَالِهَتِنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٢٢\n                                    \n                                    \n                                    فأجابه قومه قائلين : ( أجئتنا لتأفكنا ) أي : لتصدنا ( عن آلهتنا فأتنا بما تعدنا إن كنت من الصادقين ) استعجلوا عذاب الله وعقوبته ، استبعادا منهم وقوعه ، كقوله : ( يستعجل بها الذين لا يؤمنون بها ) [ الشورى : 18 ] .\n                                    ",
      "qortoby": "قَالُوٓاْ أَجِئۡتَنَا لِتَأۡفِكَنَا عَنۡ ءَالِهَتِنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٢٢\n                                    \n                                    \n                                    قوله تعالى : قالوا أجئتنا لتأفكنا عن آلهتنا فيه وجهان : أحدهما : لتزيلنا عن عبادتها بالإفك . الثاني : لتصرفنا عن آلهتنا بالمنع ، قاله الضحاك قال عروة بن أذينة :\nإن تك عن أحسن الصنيعة مأ فوكا ففي آخرين قد أفكوا\nيقول : إن لم توفق للإحسان فأنت في قوم قد صرفوا . فأتنا بما تعدنا هذا يدل على أن الوعد قد يوضع موضع الوعيد . إن كنت من الصادقين أنك نبي\n                                    ",
      "saadi": "قَالُوٓاْ أَجِئۡتَنَا لِتَأۡفِكَنَا عَنۡ ءَالِهَتِنَا فَأۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٢٢\n                                        \n                                        \n                                        \n                                        { قَالُوا أَجِئْتَنَا لِتَأْفِكَنَا عَنْ آلِهَتِنَا } أي: ليس لك من القصد ولا معك من الحق إلا أنك حسدتنا على آلهتنا فأردت أن تصرفنا عنها.\n{ فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ } وهذا غاية الجهل والعناد.\n                                    "
    }
  },
  {
    "id": 22,
    "versesNumber": 23,
    "souraName": "Al-Ahqaf.html",
    "contnent": "قَالَ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّآ أُرۡسِلۡتُ بِهِۦ وَلَٰكِنِّيٓ أَرَىٰكُمۡ قَوۡمٗا تَجۡهَلُونَ ٣٢",
    "tafsier": {
      "ibnkther": "قَالَ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّآ أُرۡسِلۡتُ بِهِۦ وَلَٰكِنِّيٓ أَرَىٰكُمۡ قَوۡمٗا تَجۡهَلُونَ ٣٢\n                                    \n                                    \n                                    ( قال إنما العلم عند الله ) أي : الله أعلم بكم إن كنتم مستحقين لتعجيل العذاب فيفعل ذلك بكم ، وأما أنا فمن شأني أني أبلغكم ما أرسلت به ، ( ولكني أراكم قوما تجهلون ) أي : لا تعقلون ولا تفهمون .\n                                    ",
      "qortoby": "قَالَ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّآ أُرۡسِلۡتُ بِهِۦ وَلَٰكِنِّيٓ أَرَىٰكُمۡ قَوۡمٗا تَجۡهَلُونَ ٣٢\n                                    \n                                    \n                                    قال إنما العلم بوقت مجيء العذاب . عند الله لا عندي وأبلغكم ما أرسلت به عن ربكم . ولكني أراكم قوما تجهلون في سؤالكم استعجال العذاب .\n                                    ",
      "saadi": "قَالَ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّآ أُرۡسِلۡتُ بِهِۦ وَلَٰكِنِّيٓ أَرَىٰكُمۡ قَوۡمٗا تَجۡهَلُونَ ٣٢\n                                        \n                                        \n                                        \n                                        { قَالَ إِنَّمَا الْعِلْمُ عِنْدَ اللَّهِ } فهو الذي بيده أزمة الأمور ومقاليدها وهو الذي يأتيكم بالعذاب إن شاء. { وَأُبَلِّغُكُمْ مَا أُرْسِلْتُ بِهِ } أي: ليس علي إلا البلاغ المبين، { وَلَكِنِّي أَرَاكُمْ قَوْمًا تَجْهَلُونَ } فلذلك صدر منكم ما صدر من هذه الجرأة الشديدة، فأرسل الله عليهم العذاب العظيم وهو الريح التي دمرتهم وأهلكتهم.\n                                    "
    }
  },
  {
    "id": 23,
    "versesNumber": 24,
    "souraName": "Al-Ahqaf.html",
    "contnent": "فَلَمَّا رَأَوۡهُ عَارِضٗا مُّسۡتَقۡبِلَ أَوۡدِيَتِهِمۡ قَالُواْ هَٰذَا عَارِضٞ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِيحٞ فِيهَا عَذَابٌ أَلِيمٞ ٤٢",
    "tafsier": {
      "ibnkther": "فَلَمَّا رَأَوۡهُ عَارِضٗا مُّسۡتَقۡبِلَ أَوۡدِيَتِهِمۡ قَالُواْ هَٰذَا عَارِضٞ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِيحٞ فِيهَا عَذَابٌ أَلِيمٞ ٤٢\n                                    \n                                    \n                                    قال الله تعالى : ( فلما رأوه عارضا مستقبل أوديتهم ) أي : لما رأوا العذاب مستقبلهم ، اعتقدوا أنه عارض ممطر ، ففرحوا واستبشروا به ، وقد كانوا ممحلين محتاجين إلى المطر ، قال الله تعالى : ( بل هو ما استعجلتم به ريح فيها عذاب أليم ) أي : هو العذاب الذي قلتم : ( فأتنا بما تعدنا إن كنت من الصادقين )\n                                    ",
      "qortoby": "فَلَمَّا رَأَوۡهُ عَارِضٗا مُّسۡتَقۡبِلَ أَوۡدِيَتِهِمۡ قَالُواْ هَٰذَا عَارِضٞ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِيحٞ فِيهَا عَذَابٌ أَلِيمٞ ٤٢\n                                    \n                                    \n                                    فلما رأوه عارضا قال المبرد : الضمير في رأوه يعود إلى غير مذكور ، وبينه قوله : عارضا فالضمير يعود إلى السحاب ، أي : فلما رأوا السحاب عارضا . فعارضا نصب على التكرير ، سمي بذلك لأنه يبدو في عرض السماء . وقيل : نصب على الحال . وقيل : يرجع الضمير إلى قوله : فأتنا بما تعدنا فلما رأوه حسبوه سحابا يمطرهم ، وكان المطر قد أبطأ عنهم ، فلما رأوه مستقبل أوديتهم استبشروا . وكان قد جاءهم من واد جرت العادة أن ما جاء منه يكون غيثا ، قاله ابن عباس وغيره . قال الجوهري : والعارض السحاب يعترض في الأفق ، ومنه قوله تعالى : هذا عارض ممطرنا أي : ممطر لنا ; لأنه معرفة لا يجوز أن يكون صفة لعارض وهو نكرة . والعرب إنما تفعل مثل هذا في الأسماء المشتقة من الأفعال دون غيرها . قال جرير :\nيا رب غابطنا لو كان يطلبكم لاقى مباعدة منكم وحرمانا\nولا يجوز أن يقال : هذا رجل غلامنا . وقال أعرابي بعد الفطر : رب صائمة لن تصومه ، وقائمة لن تقومه ، فجعله نعتا للنكرة وأضافه إلى المعرفة .\nقلت : قوله : ( لا يجوز أن يكون صفة لعارض ) خلاف قول النحويين ، والإضافة في تقدير الانفصال ، فهي إضافة لفظية لا حقيقية ; لأنها لم تفد الأول تعريفا ، بل الاسم نكرة على حاله ، فلذلك جرى نعتا على النكرة . هذا قول النحويين في الآية والبيت . ونعت النكرة نكرة . و ( رب ) لا تدخل إلا على النكرة .\nبل هو أي قال هود لهم . والدليل عليه قراءة من قرأ ( قال هود بل هو ) وقرئ ( قل بل ما استعجلتم به هي ريح ) أي : قال الله : قل بل هو ما استعجلتم به ، ويعني قولهم : فأتنا بما تعدنا ريح فيها عذاب أليم والريح التي عذبوا بها نشأت من ذلك السحاب الذي رأوه ، وخرج هود من بين أظهرهم ، فجعلت تحمل الفساطيط وتحمل الظعينة فترفعها كأنها جرادة ، ثم تضرب بها الصخور . قال ابن عباس : أول ما رأوا العارض قاموا فمدوا أيديهم ، فأول ما عرفوا أنه عذاب رأوا ما كان خارجا من ديارهم من الرجال والمواشي تطير بهم الريح ما بين السماء والأرض مثل الريش ، فدخلوا بيوتهم وأغلقوا أبوابهم ، فقلعت الريح الأبواب وصرعتهم ، وأمر الله الريح فأمالت عليهم الرمال ، فكانوا تحت الرمال سبع ليال وثمانية أيام حسوما ، ولهم أنين ، ثم أمر الله الريح فكشف عنهم الرمال واحتملتهم فرمتهم في البحر ، فهي التي قال الله تعالى فيها : تدمر كل شيء بأمر ربها أي : كل شيء مرت عليه من رجال عاد وأموالها . قال ابن عباس : أي : كل شيء بعثت إليه .\n                                    ",
      "saadi": "فَلَمَّا رَأَوۡهُ عَارِضٗا مُّسۡتَقۡبِلَ أَوۡدِيَتِهِمۡ قَالُواْ هَٰذَا عَارِضٞ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِيحٞ فِيهَا عَذَابٌ أَلِيمٞ ٤٢\n                                        \n                                        \n                                        \n                                        { فَلَمَّا رَأَوْهُ } أي: العذاب { عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ } أي: معترضا كالسحاب قد أقبل على أوديتهم التي تسيل فتسقي نوابتهم ويشربون من آبارها وغدرانها.\n{ قَالُوا } مستبشرين: { هَذَا عَارِضٌ مُمْطِرُنَا } أي: هذا السحاب سيمطرنا.\nقال تعالى: { بَلْ هُوَ مَا اسْتَعْجَلْتُمْ بِهِ } أي: هذا الذي جنيتم به على أنفسكم حيث قلتم: { فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ } { رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ }\n                                    "
    }
  },
  {
    "id": 24,
    "versesNumber": 25,
    "souraName": "Al-Ahqaf.html",
    "contnent": "تُدَمِّرُ كُلَّ شَيۡءِۢ بِأَمۡرِ رَبِّهَا فَأَصۡبَحُواْ لَا يُرَىٰٓ إِلَّا مَسَٰكِنُهُمۡۚ كَذَٰلِكَ نَجۡزِي ٱلۡقَوۡمَ ٱلۡمُجۡرِمِينَ ٥٢",
    "tafsier": {
      "ibnkther": "تُدَمِّرُ كُلَّ شَيۡءِۢ بِأَمۡرِ رَبِّهَا فَأَصۡبَحُواْ لَا يُرَىٰٓ إِلَّا مَسَٰكِنُهُمۡۚ كَذَٰلِكَ نَجۡزِي ٱلۡقَوۡمَ ٱلۡمُجۡرِمِينَ ٥٢\n                                    \n                                    \n                                    ( تدمر ) أي : تخرب ) كل شيء ) من بلادهم ، مما من شأنه الخراب ( بأمر ربها ) أي : بإذن الله لها في ذلك ، كقوله : ( ما تذر من شيء أتت عليه إلا جعلته كالرميم ) [ الذاريات : 42 ] أي : كالشيء البالي . ولهذا قال : ( فأصبحوا لا يرى إلا مساكنهم ) أي : قد بادوا كلهم عن آخرهم ولم تبق لهم باقية ، ( كذلك نجزي القوم المجرمين ) أي : هذا حكمنا فيمن كذب رسلنا ، وخالف أمرنا .\nوقد ورد حديث في قصتهم وهو غريب جدا من غرائب الحديث وأفراده ، قال الإمام أحمد :\nحدثنا زيد بن الحباب ، حدثني أبو المنذر سلام بن سليمان النحوي قال : حدثنا عاصم بن أبي النجود ، عن أبي وائل ، عن الحارث البكري قال : خرجت أشكو العلاء بن الحضرمي إلى رسول الله - صلى الله عليه وسلم - فمررت بالربذة ، فإذا عجوز من بني تميم منقطع بها ، فقالت لي : يا عبد الله ، إن لي إلى رسول الله - صلى الله عليه وسلم - حاجة ، فهل أنت مبلغي إليه ؟ قال : فحملتها فأتيت بها المدينة ، فإذا المسجد غاص بأهله ، وإذا راية سوداء تخفق ، وإذا بلال متقلد السيف بين يدي رسول الله - صلى الله عليه وسلم - فقلت : ما شأن الناس ؟ قالوا : يريد أن يبعث عمرو بن العاص وجها . قال : فجلست ، فدخل منزله - أو قال : رحله - فاستأذنت عليه ، فأذن لي ، فدخلت فسلمت ، فقال : \" هل كان بينكم وبين تميم شيء ؟ قلت : نعم ، وكانت لنا الدبرة عليهم ، ومررت بعجوز من بني تميم منقطع بها فسألتني أن أحملها إليك ، وها هي بالباب : فأذن لها فدخلت ، فقلت : يا رسول الله ، إن رأيت أن تجعل بيننا وبين تميم حاجزا فاجعل الدهناء ، فحميت العجوز واستوفزت ، وقالت : يا رسول الله ، فإلى أين يضطر مضطرك ؟ قال : قلت : إن مثلي ما قال الأول : \" معزى حملت حتفها \" ، حملت هذه ولا أشعر أنها كانت لي خصما ، أعوذ بالله ورسوله أن أكون كوافد عاد . قال : \" هيه ، وما وافد عاد ؟ \" - وهو أعلم بالحديث منه ، ولكن يستطعمه - قلت : إن عادا قحطوا فبعثوا وافدا لهم يقال له : قيل ، فمر بمعاوية بن بكر ، فأقام عنده شهرا يسقيه الخمر وتغنيه جاريتان يقال لهما \" الجرادتان \" - فلما مضى الشهر خرج إلى جبال مهرة فقال : اللهم ، إنك تعلم أني لم أجئ إلى مريض فأداويه ، ولا إلى أسير فأفاديه ، اللهم اسق عادا ما كنت تسقيه . فمرت به سحابات سود ، فنودي منها : \" اختر \" ، فأومأ إلى سحابة منها سوداء ، فنودي منها : \" خذها رمادا رمددا ، لا تبقي من عاد أحدا \" . قال : فما بلغني أنه أرسل عليهم من الريح إلا كقدر ما يجري في خاتمي هذا ، حتى هلكوا - قال أبو وائل : وصدق - وكانت المرأة والرجل إذا بعثوا وافدا لهم قالوا : \" لا تكن كوافد عاد \" .\nرواه الترمذي والنسائي وابن ماجه ، كما تقدم في سورة \" الأعراف \" .\nوقال الإمام أحمد : حدثنا هارون بن معروف ، أخبرنا ابن وهب ، أخبرنا عمرو : أن أبا النضر حدثه عن سليمان بن يسار ، عن عائشة أنها قالت : ما رأيت رسول الله - صلى الله عليه وسلم - مستجمعا ضاحكا حتى أرى منه لهواته ، إنما كان يتبسم . قالت : وكان إذا رأى غيما - أو ريحا - عرف ذلك في وجهه ، قالت : يا رسول الله ، الناس إذا رأوا الغيم فرحوا رجاء أن يكون فيه المطر ، وأراك إذا رأيته عرفت في وجهك الكراهية ؟ فقال : \" يا عائشة ، ما يؤمنني أن يكون فيه عذاب ، قد عذب قوم بالريح ، وقد رأى قوم العذاب فقالوا : هذا عارض ممطرنا \" . وأخرجاه من حديث ابن وهب .\nطريق أخرى : قال أحمد : حدثنا عبد الرحمن ، عن سفيان ، عن المقدام بن شريح ، عن أبيه ، عن عائشة أن رسول الله - صلى الله عليه وسلم - كان إذا رأى ناشئا في أفق من آفاق السماء ، ترك عمله ، وإن كان في صلاته ، ثم يقول : \" اللهم ، إني أعوذ بك من شر ما فيه \" . فإن كشفه الله حمد الله ، وإن أمطرت قال : \" اللهم ، صيبا نافعا \" .\nطريق أخرى : قال مسلم في صحيحه : حدثنا أبو الطاهر ، أخبرنا ابن وهب ، سمعت ابن جريج يحدث عن عطاء بن أبي رباح ، عن عائشة قالت : كان رسول الله - صلى الله عليه وسلم - إذا عصفت الريح قال : \" اللهم ، إني أسألك خيرها ، وخير ما فيها ، وخير ما أرسلت به ، وأعوذ بك من شرها ، وشر ما فيها ، وشر ما أرسلت به \" . قالت : وإذا تخيلت السماء تغير لونه ، وخرج ودخل ، وأقبل وأدبر ، فإذا مطرت سري عنه ، فعرفت ذلك عائشة ، فسألته ، فقال : \" لعله يا عائشة كما قال قوم عاد : ( فلما رأوه عارضا مستقبل أوديتهم قالوا هذا عارض ممطرنا ) .\nوقد ذكرنا قصة هلاك عاد في سورتي \" الأعراف وهود \" بما أغنى عن إعادته هاهنا ، ولله الحمد والمنة .\nوقال الطبراني : حدثنا عبدان بن أحمد ، حدثنا إسماعيل بن زكريا الكوفي ، حدثنا أبو مالك ، عن مسلم الملائي ، عن مجاهد وسعيد بن جبير ، عن ابن عباس قال : قال رسول الله - صلى الله عليه وسلم - : \" ما فتح على عاد من الريح إلا مثل موضع الخاتم ، ثم أرسلت عليهم [ فحملتهم ] البدو إلى الحضر فلما رآها أهل الحضر قالوا : هذا عارض ممطرنا مستقبل أوديتنا . وكان أهل البوادي فيها ، فألقي أهل البادية على أهل الحاضرة حتى هلكوا . قال : عتت على خزانها حتى خرجت من خلال الأبواب \" .\n\n                                    ",
      "qortoby": "تُدَمِّرُ كُلَّ شَيۡءِۢ بِأَمۡرِ رَبِّهَا فَأَصۡبَحُواْ لَا يُرَىٰٓ إِلَّا مَسَٰكِنُهُمۡۚ كَذَٰلِكَ نَجۡزِي ٱلۡقَوۡمَ ٱلۡمُجۡرِمِينَ ٥٢\n                                    \n                                    \n                                    والتدمير : الهلاك . وكذلك الدمار . وقرئ ( يدمر كل شيء ) من دمر دمارا . يقال : دمره تدميرا ودمارا ودمر عليه بمعنى . ودمر يدمر دمورا دخل بغير إذن . وفي الحديث : [ من سبق طرفه استئذانه فقد دمر ] مخفف الميم . وتدمر : بلد بالشام . ويربوع تدمري إذا كان صغيرا قصيرا . بأمر ربها بإذن ربها . وفي البخاري عن عائشة رضي الله عنها زوج النبي - صلى الله عليه وسلم - قالت : ما رأيت رسول الله - صلى الله عليه وسلم - ضاحكا حتى أرى منه لهواته إنما كان يتبسم . قالت : وكان إذا رأى غيما أو ريحا عرف في وجهه . قالت : يا رسول الله ، الناس إذا رأوا الغيم فرحوا رجاء أن يكون فيه المطر ، وأراك إذا رأيته عرف في وجهك الكراهية ؟ فقال : [ يا عائشة ما يؤمنني أن يكون فيه عذاب عذب قوم بالريح وقد رأى قوم العذاب فقالوا هذا عارض ممطرنا ] خرجه مسلم والترمذي ، وقال فيه : حديث حسن . وفي صحيح مسلم عن ابن عباس عن النبي - صلى الله عليه وسلم - أنه قال : [ نصرت بالصبا وأهلكت عاد بالدبور ] . وذكر الماوردي أن القائل هذا عارض ممطرنا من قوم عاد : بكر بن معاوية ، ولما رأى السحاب قال : إني لأرى سحابا مرمدا ، لا تدع من عاد أحدا . فذكر عمرو بن ميمون أنها كانت تأتيهم بالرجل الغائب حتى تقذفه في ناديهم . قال ابن إسحاق : واعتزل هود ومن معه من المؤمنين في حظيرة ، ما يصيبه ومن معه منها إلا ما يلين أعلى ثيابهم . وتلتذ الأنفس به ، وإنها لتمر من عاد بالظعن بين السماء والأرض وتدمغهم بالحجارة حتى هلكوا . وحكى الكلبي أن شاعرهم قال في ذلك :\nفدعا هود عليهم دعوة أضحوا همودا\nعصفت ريح عليهم تركت عادا خمودا\nسخرت سبع ليال لم تدع في الأرض عودا\nوعمر هود في قومه بعدهم مائة وخمسين سنة .\nفأصبحوا لا يرى إلا مساكنهم قرأ عاصم وحمزة لا يرى إلا مساكنهم بالياء غير مسمي الفاعل . وكذلك روى حماد بن سلمة عن ابن كثير إلا أنه قرأ ( ترى ) بالتاء . وقد روي ذلك عن أبي بكر عن عاصم . الباقون ( ترى ) بتاء مفتوحة . ( مساكنهم ) بالنصب ، أي : لا ترى يا محمد إلا مساكنهم . قال المهدوي : ومن قرأ بالتاء غير مسمي الفاعل فعلى لفظ الظاهر الذي هو المساكن المؤنثة ، وهو قليل لا يستعمل إلا في الشعر . وقال أبو حاتم : لا يستقيم هذا في اللغة إلا أن يكون فيها إضمار ، كما تقول في الكلام ألا ترى النساء إلا زينب . ولا يجوز لا ترى إلا زينب . وقال سيبويه : معناه لا ترى أشخاصهم إلا مساكنهم . واختار أبو عبيد وأبو حاتم قراءة عاصم وحمزة . قال الكسائي : معناه لا يرى شيء إلا مساكنهم ، فهو محمول على المعنى ، كما تقول : ما قام إلا هند ، والمعنى ما قام أحد إلا هند . وقال الفراء : لا يرى الناس لأنهم كانوا تحت الرمل ، وإنما ترى مساكنهم لأنها قائمة . كذلك نجزي القوم المجرمين أي مثل هذه العقوبة نعاقب بها المشركين .\n                                    ",
      "saadi": "تُدَمِّرُ كُلَّ شَيۡءِۢ بِأَمۡرِ رَبِّهَا فَأَصۡبَحُواْ لَا يُرَىٰٓ إِلَّا مَسَٰكِنُهُمۡۚ كَذَٰلِكَ نَجۡزِي ٱلۡقَوۡمَ ٱلۡمُجۡرِمِينَ ٥٢\n                                        \n                                        \n                                        \n                                        { تُدَمِّرُ كُلَّ شَيْءٍ } تمر عليه من شدتها ونحسها.\nفسلطها الله عليهم { سبع ليالي وثمانية أيام حسوما فترى القوم فيها صرعى كأنهم أعجاز نخل خاوية } [ { بِأَمْرِ رَبِّهَا } أي: بإذنه ومشيئته]. { فَأَصْبَحُوا لَا يُرَى إِلَّا مَسَاكِنُهُمْ } قد تلفت مواشيهم وأموالهم وأنفسهم. { كَذَلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ } بسبب جرمهم وظلمهم.\n                                    "
    }
  },
  {
    "id": 25,
    "versesNumber": 26,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَلَقَدۡ مَكَّنَّٰهُمۡ فِيمَآ إِن مَّكَّنَّٰكُمۡ فِيهِ وَجَعَلۡنَا لَهُمۡ سَمۡعٗا وَأَبۡصَٰرٗا وَأَفۡ‍ِٔدَةٗ فَمَآ أَغۡنَىٰ عَنۡهُمۡ سَمۡعُهُمۡ وَلَآ أَبۡصَٰرُهُمۡ وَلَآ أَفۡ‍ِٔدَتُهُم مِّن شَيۡءٍ إِذۡ كَانُواْ يَجۡحَدُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ٦٢",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ مَكَّنَّٰهُمۡ فِيمَآ إِن مَّكَّنَّٰكُمۡ فِيهِ وَجَعَلۡنَا لَهُمۡ سَمۡعٗا وَأَبۡصَٰرٗا وَأَفۡ‍ِٔدَةٗ فَمَآ أَغۡنَىٰ عَنۡهُمۡ سَمۡعُهُمۡ وَلَآ أَبۡصَٰرُهُمۡ وَلَآ أَفۡ‍ِٔدَتُهُم مِّن شَيۡءٍ إِذۡ كَانُواْ يَجۡحَدُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ٦٢\n                                    \n                                    \n                                    يقول تعالى : ولقد مكنا الأمم السالفة في الدنيا من الأموال والأولاد ، وأعطيناهم منها ما لم نعطكم مثله ولا قريبا منه ، ( وجعلنا لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء إذ كانوا يجحدون بآيات الله وحاق بهم ما كانوا به يستهزئون ) أي : وأحاط بهم العذاب والنكال الذي كانوا يكذبون به ويستبعدون وقوعه ، أي : فاحذروا أيها المخاطبون أن تكونوا مثلهم ، فيصيبكم مثل ما أصابهم من العذاب في الدنيا والآخرة .\n                                    ",
      "qortoby": "وَلَقَدۡ مَكَّنَّٰهُمۡ فِيمَآ إِن مَّكَّنَّٰكُمۡ فِيهِ وَجَعَلۡنَا لَهُمۡ سَمۡعٗا وَأَبۡصَٰرٗا وَأَفۡ‍ِٔدَةٗ فَمَآ أَغۡنَىٰ عَنۡهُمۡ سَمۡعُهُمۡ وَلَآ أَبۡصَٰرُهُمۡ وَلَآ أَفۡ‍ِٔدَتُهُم مِّن شَيۡءٍ إِذۡ كَانُواْ يَجۡحَدُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ٦٢\n                                    \n                                    \n                                    قوله تعالى : ولقد مكناهم فيما إن مكناكم فيه قيل : إن إن زائدة ، تقديره ولقد مكناكم فيما مكناكم فيه . وهذا قول القتبي . وأنشد الأخفش :\nيرجي المرء ما إن لا يراه وتعرض دون أدناه الخطوب\nوقال آخر [ فروة بن مسيك المرادي ] :\nفما إن طبنا جبن ولكن منايانا ودولة آخرينا\nوقيل : إن ما بمعنى الذي . وإن بمعنى ما ، والتقدير ولقد مكناهم في الذي ما مكناكم فيه ، قاله المبرد . وقيل : شرطية وجوابها مضمر محذوف ، والتقدير ولقد مكناهم في ما إن مكناكم فيه كان بغيكم أكثر وعنادكم أشد ، وتم الكلام .\nثم ابتدأ فقال : وجعلنا لهم سمعا وأبصارا وأفئدة يعني قلوبا يفقهون بها . فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء من عذاب الله . إذ كانوا يجحدون يكفرون بآيات الله وحاق بهم أحاط بهم ما كانوا به يستهزئون .\n                                    ",
      "saadi": "وَلَقَدۡ مَكَّنَّٰهُمۡ فِيمَآ إِن مَّكَّنَّٰكُمۡ فِيهِ وَجَعَلۡنَا لَهُمۡ سَمۡعٗا وَأَبۡصَٰرٗا وَأَفۡ‍ِٔدَةٗ فَمَآ أَغۡنَىٰ عَنۡهُمۡ سَمۡعُهُمۡ وَلَآ أَبۡصَٰرُهُمۡ وَلَآ أَفۡ‍ِٔدَتُهُم مِّن شَيۡءٍ إِذۡ كَانُواْ يَجۡحَدُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ٦٢\n                                        \n                                        \n                                        \n                                        هذا مع أن الله تعالى قد أدر عليهم النعم العظيمة فلم يشكروه ولا ذكروه ولهذا قال: { وَلَقَدْ مَكَّنَّاهُمْ فِيمَا إِنْ مَكَّنَّاكُمْ فِيهِ } أي: مكناهم في الأرض يتناولون طيباتها ويتمتعون بشهواتها\nوعمرناهم عمرا يتذكر فيه من تذكر، ويتعظ فيه المهتدي، أي: ولقد مكنا عادا كما مكناكم يا هؤلاء المخاطبون أي: فلا تحسبوا أن ما مكناكم فيه مختص بكم وأنه سيدفع عنكم من عذاب الله شيئا، بل غيركم أعظم منكم تمكينا فلم تغن عنهم أموالهم ولا أولادهم ولا جنودهم من الله شيئا.\n{ وَجَعَلْنَا لَهُمْ سَمْعًا وَأَبْصَارًا وَأَفْئِدَةً } أي: لا قصور في أسماعهم ولا أبصارهم ولا أذهانهم حتى يقال إنهم تركوا الحق جهلا منهم وعدم تمكن من العلم به ولا خلل في عقولهم ولكن التوفيق بيد الله. { فَمَا أَغْنَى عَنْهُمْ سَمْعُهُمْ وَلَا أَبْصَارُهُمْ وَلَا أَفْئِدَتُهُمْ مِنْ شَيْءٍ } لا قليل ولا كثير، وذلك بسبب أنهم { يَجْحَدُونَ بِآيَاتِ اللَّهِ } الدالة على توحيده وإفراده بالعبادة.\n{ وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ } أي: نزل بهم العذاب الذي يكذبون بوقوعه ويستهزئون بالرسل الذين حذروهم منه.\n                                    "
    }
  },
  {
    "id": 26,
    "versesNumber": 27,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَلَقَدۡ أَهۡلَكۡنَا مَا حَوۡلَكُم مِّنَ ٱلۡقُرَىٰ وَصَرَّفۡنَا ٱلۡأٓيَٰتِ لَعَلَّهُمۡ يَرۡجِعُونَ ٧٢",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ أَهۡلَكۡنَا مَا حَوۡلَكُم مِّنَ ٱلۡقُرَىٰ وَصَرَّفۡنَا ٱلۡأٓيَٰتِ لَعَلَّهُمۡ يَرۡجِعُونَ ٧٢\n                                    \n                                    \n                                    وقوله : ( ولقد أهلكنا ما حولكم من القرى ) يعني : أهل مكة ، قد أهلك الله الأمم المكذبة بالرسل مما حولها كعاد ، وكانوا بالأحقاف بحضرموت عند اليمن وثمود ، وكانت منازلهم بينهم وبين الشام ، وكذلك سبأ وهم أهل اليمن ، ومدين وكانت في طريقهم وممرهم إلى غزة ، وكذلك بحيرة قوم لوط ، كانوا يمرون بها أيضا .\nوقوله : ( وصرفنا الآيات ) أي : بيناها ووضحناها ، ( لعلهم يرجعون)\n                                    ",
      "qortoby": "وَلَقَدۡ أَهۡلَكۡنَا مَا حَوۡلَكُم مِّنَ ٱلۡقُرَىٰ وَصَرَّفۡنَا ٱلۡأٓيَٰتِ لَعَلَّهُمۡ يَرۡجِعُونَ ٧٢\n                                    \n                                    \n                                    قوله تعالى : ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون .\nقوله تعالى : ولقد أهلكنا ما حولكم من القرى يريد حجر ثمود وقرى لوط ونحوهما مما كان يجاور بلاد الحجاز ، وكانت أخبارهم متواترة عندهم . وصرفنا الآيات يعني الحجج والدلالات وأنواع البينات والعظات ، أي : بيناها لأهل تلك القرى . لعلهم يرجعون فلم يرجعوا . وقيل : أي : صرفنا آيات القرآن في الوعد والوعيد والقصص والإعجاز لعل هؤلاء المشركين يرجعون .\n                                    ",
      "saadi": "وَلَقَدۡ أَهۡلَكۡنَا مَا حَوۡلَكُم مِّنَ ٱلۡقُرَىٰ وَصَرَّفۡنَا ٱلۡأٓيَٰتِ لَعَلَّهُمۡ يَرۡجِعُونَ ٧٢\n                                        \n                                        \n                                        \n                                        يحذر تعالى مشركي العرب وغيرهم بإهلاك الأمم المكذبين الذين هم حول ديارهم، بل كثير منهم في جزيرة العرب كعاد وثمود ونحوهم وأن الله تعالى صرف لهم الآيات أي: نوعها من كل وجه، { لَعَلَّهُمْ يَرْجِعُونَ } عماهم عليه من الكفر والتكذيب.\n                                    "
    }
  },
  {
    "id": 27,
    "versesNumber": 28,
    "souraName": "Al-Ahqaf.html",
    "contnent": "فَلَوۡلَا نَصَرَهُمُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ قُرۡبَانًا ءَالِهَةَۢۖ بَلۡ ضَلُّواْ عَنۡهُمۡۚ وَذَٰلِكَ إِفۡكُهُمۡ وَمَا كَانُواْ يَفۡتَرُونَ ٨٢",
    "tafsier": {
      "ibnkther": "فَلَوۡلَا نَصَرَهُمُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ قُرۡبَانًا ءَالِهَةَۢۖ بَلۡ ضَلُّواْ عَنۡهُمۡۚ وَذَٰلِكَ إِفۡكُهُمۡ وَمَا كَانُواْ يَفۡتَرُونَ ٨٢\n                                    \n                                    \n                                    أي : فهلا نصروهم عند احتياجهم إليهم ، ( بل ضلوا عنهم ) أي : بل ذهبوا عنهم أحوج ما كانوا إليهم ، ( وذلك إفكهم ) أي : كذبهم ، ( وما كانوا يفترون ) أي : وافتراؤهم في اتخاذهم إياهم آلهة ، وقد خابوا وخسروا في عبادتهم لها ، واعتمادهم عليها .\n                                    ",
      "qortoby": "فَلَوۡلَا نَصَرَهُمُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ قُرۡبَانًا ءَالِهَةَۢۖ بَلۡ ضَلُّواْ عَنۡهُمۡۚ وَذَٰلِكَ إِفۡكُهُمۡ وَمَا كَانُواْ يَفۡتَرُونَ ٨٢\n                                    \n                                    \n                                    قوله تعالى : فلولا نصرهم الذين اتخذوا من دون الله قربانا آلهة بل ضلوا عنهم وذلك إفكهم وما كانوا يفترون .\nقوله تعالى : فلولا نصرهم لولا بمعنى هلا ، أي : هلا نصرهم آلهتهم التي تقربوا بها بزعمهم إلى الله لتشفع لهم حيث قالوا : هؤلاء شفعاؤنا عند الله ومنعتهم من الهلاك الواقع بهم . قال الكسائي : القربان كل ما يتقرب به إلى الله تعالى من طاعة ونسيكة ، والجمع قرابين ، كالرهبان والرهابين . وأحد مفعولي اتخذ الراجع إلى الذين المحذوف ، والثاني آلهة وقربانا حال ، ولا يصح أن يكون قربانا مفعولا ثانيا . وآلهة بدل منه لفساد المعنى ، قال الزمخشري . وقرئ ( قربانا ) بضم الراء .\nبل ضلوا عنهم أي هلكوا عنهم . وقيل : بل ضلوا عنهم أي : ضلت عنهم آلهتهم لأنها لم يصبها ما أصابهم ، إذ هي جماد . وقيل : ضلوا عنهم ، أي : تركوا الأصنام وتبرءوا منها .\nوذلك إفكهم أي والآلهة التي ضلت عنهم هي إفكهم في قولهم : إنها تقربهم إلى الله زلفى . وقراءة العامة إفكهم بكسر الهمزة وسكون الفاء ، أي : كذبهم . والإفك : الكذب ، وكذلك الأفيكة ، والجمع الأفائك . ورجل أفاك أي : كذاب . وقرأ ابن عباس ومجاهد وابن الزبير ( وذلك أفكهم ) بفتح الهمزة والفاء والكاف ، على الفعل ، أي : ذلك القول صرفهم عن التوحيد . والأفك ( بالفتح ) مصدر قولك : أفكه يأفكه أفكا ، أي : قلبه وصرفه عن الشيء . وقرأ عكرمة ( أفكهم ) بتشديد الفاء على التأكيد والتكثير . قال أبو حاتم : يعني قلبهم عما كانوا عليه من النعيم . وذكر المهدوي عن ابن عباس أيضا ( آفكهم ) بالمد وكسر الفاء ، بمعنى صارفهم . وعن عبد الله بن الزبير باختلاف عنه ( آفكهم ) بالمد ، فجاز أن يكون أفعلهم ، أي : أصارهم إلى الإفك . وجاز أن يكون فاعلهم كخادعهم . ودليل قراءة العامة إفكهم قوله : وما كانوا يفترون أي يكذبون . وقيل : ( أفكهم ) مثل ( أفكهم ) الإفك والأفك كالحذر والحذر ، قاله المهدوي .\n                                    ",
      "saadi": "فَلَوۡلَا نَصَرَهُمُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ قُرۡبَانًا ءَالِهَةَۢۖ بَلۡ ضَلُّواْ عَنۡهُمۡۚ وَذَٰلِكَ إِفۡكُهُمۡ وَمَا كَانُواْ يَفۡتَرُونَ ٨٢\n                                        \n                                        \n                                        \n                                        فلما لم يؤمنوا أخذهم الله أخذ عزيز مقتدر ولم تنفعهم آلهتهم التي يدعون من دون الله من شيء ولهذا قال هنا: { فَلَوْلَا نَصَرَهُمُ الَّذِينَ اتَّخَذُوا مِنْ دُونِ اللَّهِ قُرْبَانًا آلِهَةً } أي: يتقربون إليهم ويتألهونهم لرجاء نفعهم.\n{ بَلْ ضَلُّوا عَنْهُمْ } فلم يجيبوهم ولا دفعوا عنهم، { وَذَلِكَ إِفْكُهُمْ وَمَا كَانُوا يَفْتَرُونَ } من الكذب الذي يمنون به أنفسهم حيث يزعمون أنهم على الحق وأن أعمالهم ستنفعهم فضلت وبطلت.\n                                    "
    }
  },
  {
    "id": 28,
    "versesNumber": 29,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَإِذۡ صَرَفۡنَآ إِلَيۡكَ نَفَرٗا مِّنَ ٱلۡجِنِّ يَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوٓاْ أَنصِتُواْۖ فَلَمَّا قُضِيَ وَلَّوۡاْ إِلَىٰ قَوۡمِهِم مُّنذِرِينَ ٩٢",
    "tafsier": {
      "ibnkther": "وَإِذۡ صَرَفۡنَآ إِلَيۡكَ نَفَرٗا مِّنَ ٱلۡجِنِّ يَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوٓاْ أَنصِتُواْۖ فَلَمَّا قُضِيَ وَلَّوۡاْ إِلَىٰ قَوۡمِهِم مُّنذِرِينَ ٩٢\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا سفيان ، حدثنا عمرو : سمعت عكرمة ، عن الزبير : ( وإذ صرفنا إليك نفرا من الجن يستمعون القرآن ) قال : بنخلة ، ورسول الله - صلى الله عليه وسلم - يصلي العشاء الآخرة ، ( كادوا يكونون عليه لبدا ) [ الجن : 19 ] ، قال سفيان : اللبد : بعضهم على بعض ، كاللبد بعضه على بعض .\nتفرد به أحمد ، وسيأتي من رواية ابن جرير ، عن عكرمة ، عن ابن عباس : أنهم سبعة من جن نصيبين .\nوقال الإمام أحمد : حدثنا عفان ، حدثنا أبو عوانة ( ح ) - وقال الحافظ أبو بكر البيهقي في كتابه \" دلائل النبوة \" : أخبرنا أبو الحسن علي بن أحمد بن عبدان ، أخبرنا أحمد بن عبيد الصفار ، حدثنا إسماعيل القاضي ، أخبرنا مسدد ، حدثنا أبو عوانة عن أبي بشر ، عن سعيد بن جبير ، عن ابن عباس قال : ما قرأ رسول الله - صلى الله عليه وسلم - على الجن ولا رآهم ، انطلق رسول الله - صلى الله عليه وسلم - في طائفة من أصحابه عامدين إلى سوق عكاظ ، وقد حيل بين الشياطين وبين خبر السماء ، وأرسلت عليهم الشهب ، فرجعت الشياطين إلى قومهم فقالوا : ما لكم ؟ فقالوا : حيل بيننا وبين خبر السماء ، وأرسلت علينا الشهب . قالوا : ما حال بينكم وبين خبر السماء إلا شيء حدث ، فاضربوا مشارق الأرض ومغاربها وانظروا ما هذا الذي حال بينكم وبين خبر السماء . فانطلقوا يضربون مشارق الأرض ومغاربها يبتغون ما هذا الذي حال بينهم وبين خبر السماء ، فانصرف أولئك النفر الذين توجهوا نحو تهامة إلى رسول الله - صلى الله عليه وسلم - وهو بنخلة عامدا إلى سوق عكاظ ، وهو يصلي بأصحابه صلاة الفجر ، فلما سمعوا القرآن استمعوا له ، فقالوا : هذا - والله - الذي حال بينكم وبين خبر السماء ، فهنالك حين رجعوا إلى قومهم ، قالوا : يا قومنا ، إنا سمعنا قرآنا عجبا ، يهدي إلى الرشد فآمنا به ، ولن نشرك بربنا أحدا ، وأنزل الله على نبيه : ( قل أوحي إلي أنه استمع نفر من الجن ) [ الجن : 1 ] ، وإنما أوحي إليه قول الجن .\nرواه البخاري عن مسدد بنحوه ، وأخرجه مسلم عن شيبان بن فروخ ، عن أبي عوانة ، به . ورواه الترمذي والنسائي في التفسير ، من حديث أبي عوانة .\nوقال الإمام أحمد أيضا : حدثنا أبو أحمد ، حدثنا إسرائيل ، عن أبي إسحاق ، عن سعيد بن جبير ، عن ابن عباس ، قال : كان الجن يستمعون الوحي ، فيسمعون الكلمة فيزيدون فيها عشرا ، فيكون ما سمعوا حقا وما زادوا باطلا وكانت النجوم لا يرمى بها قبل ذلك ، فلما بعث رسول الله - صلى الله عليه وسلم - كان أحدهم لا يأتي مقعده إلا رمي بشهاب يحرق ما أصاب ، فشكوا ذلك إلى إبليس فقال : ما هذا إلا من أمر قد حدث . فبث جنوده ، فإذا بالنبي - صلى الله عليه وسلم - يصلي بين جبلي نخلة ، فأتوه فأخبروه ، فقال : هذا الحدث الذي حدث في الأرض .\nورواه الترمذي والنسائي في كتابي التفسير من سننيهما ، من حديث إسرائيل به وقال الترمذي : حسن صحيح .\nوهكذا رواه أيوب عن سعيد بن جبير ، عن ابن عباس . وكذا رواه العوفي ، عن ابن عباس أيضا ، بمثل هذا السياق بطوله ، وهكذا قال الحسن البصري : إنه ، عليه السلام ، ما شعر بأمرهم حتى أنزل الله عليه بخبرهم .\nوذكر محمد بن إسحاق ، عن يزيد بن رومان ، عن محمد بن كعب القرظي قصة خروج رسول الله - صلى الله عليه وسلم - إلى الطائف ودعائه إياهم إلى الله عز وجل ، وإبائهم عليه . فذكر القصة بطولها ، وأورد ذلك الدعاء الحسن : \" اللهم إليك أشكو ضعف قوتي وقلة حيلتي \" إلى آخره . قال : فلما انصرف عنهم بات بنخلة ، فقرأ تلك الليلة من القرآن فاستمعه الجن من أهل نصيبين .\nوهذا صحيح ، ولكن قوله : \" إن الجن كان استماعهم تلك الليلة \" . فيه نظر ; لأن الجن كان استماعهم في ابتداء الإيحاء ، كما دل عليه حديث ابن عباس المذكور ، وخروجه ، عليه السلام ، إلى الطائف كان بعد موت عمه ، وذلك قبل الهجرة بسنة أو سنتين ، كما قرره ابن إسحاق وغيره [ والله أعلم ] .\nوقال أبو بكر بن أبي شيبة : حدثنا أبو أحمد الزبيري ، حدثنا سفيان ، عن عاصم ، عن زر ، عن عبد الله بن مسعود قال : هبطوا على النبي - صلى الله عليه وسلم - وهو يقرأ القرآن ببطن نخلة ، فلما سمعوه قالوا : أنصتوا . قال صه ، وكانوا تسعة أحدهم زوبعة ، فأنزل الله عز وجل : ( وإذ صرفنا إليك نفرا من الجن يستمعون القرآن فلما حضروه قالوا أنصتوا فلما قضي ولوا إلى قومهم منذرين ) إلى : ( ضلال مبين ) .\nفهذا مع الأول من رواية ابن عباس يقتضي أن رسول الله - صلى الله عليه وسلم - لم يشعر بحضورهم في هذه المرة وإنما استمعوا قراءته ، ثم رجعوا إلى قومهم ثم بعد ذلك وفدوا إليه أرسالا قوما بعد قوم ، وفوجا بعد فوج ، كما سيأتي بذلك الأخبار في موضعها والآثار ، مما سنوردها هاهنا إن شاء الله تعالى وبه الثقة .\nفأما ما رواه البخاري ومسلم جميعا ، عن أبي قدامة عبيد الله بن سعيد السرخسي ، عن أبي أسامة حماد بن أسامة ، عن مسعر بن كدام ، عن معن بن عبد الرحمن قال : سمعت أبي قال : سألت مسروقا : من آذن النبي - صلى الله عليه وسلم - ليلة استمعوا القرآن ؟ فقال : حدثني أبوك - يعني ابن مسعود - أنه آذنته بهم شجرة - فيحتمل أن يكون هذا في المرة الأولى ، ويكون إثباتا مقدما على نفي ابن عباس ، ويحتمل أن يكون هذا في بعض المرات المتأخرات ، والله أعلم . ويحتمل أن يكون في الأولى ولكن لم يشعر بهم حال استماعهم حتى آذنته بهم الشجرة ، أي : أعلمته باستماعهم ، والله أعلم .\nقال الحافظ البيهقي : وهذا الذي حكاه ابن عباس رضي الله عنهما ، إنما هو في أول ما سمعت الجن قراءة رسول الله - صلى الله عليه وسلم - وعلمت حاله ، وفي ذلك الوقت لم يقرأ عليهم ولم يرهم ، ثم بعد ذلك أتاه داعي الجن فقرأ عليهم القرآن ، ودعاهم إلى الله ، عز وجل ، كما رواه عبد الله بن مسعود ، رضي الله عنه .\nذكر الرواية عنه بذلك :\nقال الإمام أحمد : حدثنا إسماعيل بن إبراهيم ، حدثنا داود عن الشعبي - وابن أبي زائدة ، أخبرنا داود ، عن الشعبي - عن علقمة قال : قلت لعبد الله بن مسعود : هل صحب رسول الله - صلى الله عليه وسلم - ليلة الجن منكم أحد ؟ فقال : ما صحبه منا أحد ، ولكنا فقدناه ذات ليلة بمكة ، فقلنا : اغتيل ؟ استطير ؟ ما فعل ؟ قال : فبتنا بشر ليلة بات بها قوم ، فلما كان في وجه الصبح - أو قال : في السحر - إذا نحن به يجيء من قبل حراء ، فقلنا : يا رسول الله - فذكروا له الذي كانوا فيه - فقال : \" إنه أتاني داعي الجن ، فأتيتهم فقرأت عليهم \" . قال : فانطلق ، فأرانا آثارهم وآثار نيرانهم - قال : وقال الشعبي : سألوه الزاد - قال عامر : سألوه بمكة ، وكانوا من جن الجزيرة ، فقال : \" كل عظم ذكر اسم الله عليه يقع في أيديكم أوفر ما كان عليه لحما ، وكل بعرة أو روثة علف لدوابكم - قال - فلا تستنجوا بهما ، فإنهما زاد إخوانكم من الجن \" .\nوهكذا رواه مسلم في صحيحه ، عن علي بن حجر ، عن إسماعيل ابن علية ، به نحوه .\nوقال مسلم أيضا : حدثنا محمد بن المثنى ، حدثنا عبد الأعلى ، حدثنا داود - وهو ابن أبي هند - عن عامر قال : سألت علقمة : هل كان ابن مسعود ، رضي الله عنه ، شهد مع رسول الله - صلى الله عليه وسلم - ليلة الجن ؟ قال : فقال علقمة : أنا سألت ابن مسعود ; فقلت : هل شهد أحد منكم مع رسول الله - صلى الله عليه وسلم - ليلة الجن ؟ قال : لا ولكنا كنا مع رسول الله - صلى الله عليه وسلم - ذات ليلة ففقدناه فالتمسناه في الأودية والشعاب ، فقلنا : استطير ؟ اغتيل ؟ قال : فبتنا بشر ليلة بات بها قوم ، فلما أصبحنا إذا هو جاء من قبل حراء ، قال : فقلنا : يا رسول الله ، فقدناك فطلبناك فلم نجدك ، فبتنا بشر ليلة بات بها قوم . فقال : \" أتاني داعي الجن ، فذهبت معهم ، فقرأت عليهم القرآن \" . قال : فانطلق بنا فأرانا آثارهم وآثار نيرانهم ، وسألوه الزاد فقال : \" كل عظم ذكر اسم الله عليه يقع في أيديكم أوفر ما يكون لحما ، وكل بعرة أو روثة علف لدوابكم \" . قال رسول الله - صلى الله عليه وسلم - : \" فلا تستنجوا بهما ، فإنهما طعام إخوانكم \" .\nطريق أخرى عن ابن مسعود : قال أبو جعفر بن جرير : حدثني أحمد بن عبد الرحمن ، حدثني عمي ، حدثني يونس ، عن الزهري ، عن عبيد الله بن عبد الله ; أن ابن مسعود قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" بت الليلة أقرأ على الجن ربعا بالحجون \" .\nطريق أخرى : فيها أنه كان معه ليلة الجن ، قال ابن جرير رحمه الله : حدثني أحمد بن عبد الرحمن بن وهب ، حدثنا عمي عبد الله بن وهب ، أخبرني يونس ، عن ابن شهاب ، عن أبي عثمان بن سنة الخزاعي - وكان من أهل الشام - أن عبد الله بن مسعود قال : قال رسول الله - صلى الله عليه وسلم - لأصحابه وهو بمكة : \" من أحب منكم أن يحضر أمر الجن الليلة فليفعل \" . فلم يحضر منهم أحد غيري ، قال : فانطلقنا حتى إذا كنا بأعلى مكة خط لي برجله خطا ، ثم أمرني أن أجلس فيه ، ثم انطلق حتى قام ، فافتتح القرآن فغشيته أسودة كثيرة حالت بيني وبينه ، حتى ما أسمع صوته ، ثم طفقوا يتقطعون مثل قطع السحاب ذاهبين ، حتى بقي منهم رهط ، ففرغ رسول الله - صلى الله عليه وسلم - مع الفجر ، فانطلق فتبرز ، ثم أتاني فقال : \" ما فعل الرهط ؟ \" فقلت : هم أولئك يا رسول الله ، فأعطاهم عظما وروثا زادا ، ثم نهى أن يستطيب أحد بروث أو عظم .\nورواه ابن جرير عن محمد بن عبد الله بن عبد الحكم ، عن أبي زرعة وهب الله بن راشد ، عن يونس بن يزيد الأيلي ، به .\nورواه البيهقي في الدلائل ، من حديث عبد الله بن صالح - كاتب الليث - عن الليث ، عن يونس به .\nوقد روى إسحاق بن راهويه ، عن جرير ، عن قابوس بن أبي ظبيان ، عن أبيه ، عن ابن مسعود ، فذكر نحو ما تقدم .\nورواه الحافظ أبو نعيم ، من طريق موسى بن عبيدة ، عن سعيد بن الحارث ، عن أبي المعلى ، عن ابن مسعود فذكر نحوه أيضا .\nطريق أخرى : قال أبو نعيم : حدثنا أبو بكر بن مالك ، حدثنا عبد الله بن أحمد بن حنبل ، حدثني أبي قال : حدثنا عفان وعكرمة قالا حدثنا معتمر قال : قال أبي : حدثني أبو تميمة ، عن عمرو - ولعله قد يكون قال : البكالي - يحدثه عمرو ، عن عبد الله بن مسعود ، رضي الله عنه ، قال : استتبعني رسول الله - صلى الله عليه وسلم - فانطلقنا حتى أتينا مكان كذا وكذا ، فخط لي خطا فقال : \" كن بين ظهر هذه لا تخرج منها ; فإنك إن خرجت منها هلكت \" فذكر الحديث بطوله وفيه غرابة شديدة .\nطريق أخرى : قال ابن جرير : حدثنا ابن عبد الأعلى ، حدثنا ابن ثور ، عن معمر ، عن يحيى بن أبي كثير ، عن عبد الله بن عمرو بن غيلان الثقفي أنه قال لابن مسعود : حدثت أنك كنت مع رسول الله - صلى الله عليه وسلم - ليلة وفد الجن ؟ قال : أجل . قال : فكيف كان ؟ فذكر الحديث كله ، وذكر أن النبي - صلى الله عليه وسلم - خط عليه خطا ، وقال : \" لا تبرح منها \" فذكر مثل العجاجة السوداء غشيت رسول الله - صلى الله عليه وسلم - فذعر ثلاث مرات ، حتى إذا كان قريبا من الصبح ، أتاني النبي - صلى الله عليه وسلم - فقال : \" أنمت ؟ \" فقلت : لا والله ، ولقد هممت مرارا أن أستغيث بالناس حتى سمعتك تقرعهم بعصاك ، تقول : \" اجلسوا \" فقال : \" لو خرجت لم آمن أن يخطفك بعضهم \" . ثم قال : \" هل رأيت شيئا ؟ \" فقلت : نعم رأيت رجالا سودا مستشعرين ثيابا بياضا . قال : \" أولئك جن نصيبين سألوني المتاع - والمتاع : الزاد - فمتعتهم بكل عظم حائل ، أو بعرة أو روثة \" - فقلت : يا رسول الله ، وما يغني ذلك عنهم ؟ فقال : \" إنهم لا يجدون عظما إلا وجدوا عليه لحمه يوم أكل ، ولا روثا إلا وجدوا فيها حبها يوم أكلت ، فلا يستنقين أحد منكم إذا خرج من الخلاء بعظم ولا بعرة ولا روثة \" .\nطريق أخرى : قال الحافظ أبو بكر البيهقي : أخبرنا أبو عبد الرحمن السلمي وأبو نصر بن قتادة قالا : أخبرنا أبو محمد يحيى بن منصور القاضي ، حدثنا أبو عبد الله محمد بن إبراهيم البوشنجي ، حدثنا روح بن صلاح ، حدثنا موسى بن علي بن رباح ، عن أبيه ، عن عبد الله بن مسعود قال : استتبعني رسول الله - صلى الله عليه وسلم - فقال : \" إن نفرا من الجن - خمسة عشر بني إخوة وبني عم - يأتونني الليلة ، فأقرأ عليهم القرآن \" ، فانطلقت معه إلى المكان الذي أراد ، فخط لي خطا وأجلسني فيه ، وقال لي : \" لا تخرج من هذا \" . فبت فيه حتى أتاني رسول الله - صلى الله عليه وسلم - مع السحر في يده عظم حائل وروثة حممة فقال لي : \" إذا ذهبت إلى الخلاء فلا تستنج بشيء من هؤلاء \" . قال : فلما أصبحت قلت : لأعلمن علمي حيث كان رسول الله - صلى الله عليه وسلم - قال ، فذهبت فرأيت موضع مبرك ستين بعيرا .\nطريق أخرى : قال البيهقي : أخبرنا أبو عبد الله الحافظ ، أخبرنا أبو العباس الأصم ، حدثنا العباس بن محمد الدوري ، حدثنا عثمان بن عمر ، عن المستمر بن الريان ، عن أبي الجوزاء ، عن عبد الله بن مسعود قال : انطلقت مع رسول الله - صلى الله عليه وسلم - ليلة الجن ، حتى أتى الحجون ، فخط لي خطا ، ثم تقدم إليهم فازدحموا عليه ، فقال سيد لهم يقال له : \" وردان \" : أنا أرحلهم عنك . فقال : إني لن يجيرني من الله أحد .\nطريق أخرى : قال الإمام أحمد : حدثنا عبد الرزاق ، حدثنا سفيان ، عن أبي فزارة العبسي ، حدثنا أبو زيد - مولى عمرو بن حريث - عن ابن مسعود قال : لما كان ليلة الجن قال لي النبي - صلى الله عليه وسلم - : \" أمعك ماء ؟ \" قلت : ليس معي ماء ، ولكن معي إداوة فيها نبيذ . فقال النبي : \" تمرة طيبة وماء طهور \" فتوضأ .\nورواه أبو داود ، والترمذي ، وابن ماجه من حديث أبي زيد به .\nطريق أخرى : قال أحمد : حدثنا يحيى بن إسحاق ، أخبرنا ابن لهيعة ، عن قيس بن الحجاج ، عن حنش الصنعاني ، عن ابن عباس ، عن عبد الله بن مسعود أنه كان مع رسول الله - صلى الله عليه وسلم - ليلة الجن ، فقال رسول الله : \" يا عبد الله ، أمعك ماء ؟ \" قال : معي نبيذ في إداوة ، فقال اصبب علي \" . فتوضأ ، فقال النبي - صلى الله عليه وسلم - : \" يا عبد الله شراب وطهور \" .\nتفرد به أحمد من هذا الوجه ، وقد أورده الدارقطني من طريق آخر ، عن ابن مسعود [ به ] .\nطريق أخرى : قال الإمام أحمد : حدثنا عبد الرزاق ، أخبرني أبي عن ميناء ، عن عبد الله قال : كنت مع رسول الله - صلى الله عليه وسلم - ليلة وفد الجن ، فلما انصرف تنفس ، فقلت : ما شأنك ؟ قال : \" نعيت إلي نفسي يا ابن مسعود \" .\nهكذا رأيته في المسند مختصرا ، وقد رواه الحافظ أبو نعيم في كتابه \" دلائل النبوة \" ، فقال : حدثنا سليمان بن أحمد بن أيوب ، حدثنا إسحاق بن إبراهيم - وحدثنا أبو بكر بن مالك ، حدثنا عبد الله بن أحمد بن حنبل ، حدثنا أبي قالا : حدثنا عبد الرزاق ، عن أبيه ، عن ميناء ، عن ابن مسعود قال : كنت مع رسول الله - صلى الله عليه وسلم - ليلة وفد الجن ، فتنفس ، فقلت : ما لك يا رسول الله ؟ قال : \" نعيت إلي نفسي يا ابن مسعود \" . قلت : استخلف . قال : \" من ؟ \" قلت : أبا بكر . فسكت ، ثم مضى ساعة فتنفس ، فقلت : ما شأنك بأبي أنت وأمي يا رسول الله ؟ قال : \" نعيت إلي نفسي يا ابن مسعود \" . قلت : استخلف . قال : \" من ؟ \" قلت : عمر [ بن الخطاب ] . فسكت ، ثم مضى ساعة ، ثم تنفس فقلت : ما شأنك ؟ قال : \" نعيت إلي نفسي \" . قلت : فاستخلف . قال - صلى الله عليه وسلم - : \" من ؟ \" قلت : علي بن أبي طالب . قال - صلى الله عليه وسلم - : \" أما والذي نفسي بيده ، لئن أطاعوه ليدخلن الجنة أجمعين أكتعين . .\n[ ص: 2 95 ]\nوهو حديث غريب جدا ، وأحرى به ألا يكون محفوظا ، وبتقدير صحته فالظاهر أن هذا بعد وفودهم إليه بالمدينة على ما سنورده ، فإن في ذلك الوقت في آخر الأمر لما فتحت مكة ، ودخل الناس والجان أيضا في دين الله أفواجا ، نزلت سورة ( إذا جاء نصر الله والفتح ورأيت الناس يدخلون في دين الله أفواجا فسبح بحمد ربك واستغفره إنه كان توابا ) ، وهي السورة التي نعيت نفسه الكريمة فيها إليه ، كما قد نص على ذلك ابن عباس ، ووافقه عمر بن الخطاب عليه ، وقد ورد في ذلك حديث سنورده عند تفسيرها ، والله أعلم . وقد رواه أبو نعيم أيضا ، عن الطبراني ، عن محمد بن عبد الله الحضرمي ، عن علي بن الحسين بن أبي بردة ، عن يحيى بن سعيد الأسلمي ، عن حرب بن صبيح ، عن سعيد بن مسلمة ، عن أبي مرة الصنعاني ، عن أبي عبد الله الجدلي ، عن ابن مسعود ، فذكره ، وذكر فيه قصة الاستخلاف ، وهذا إسناد غريب ، وسياق عجيب .\nطريق أخرى : قال الإمام أحمد : حدثنا أبو سعيد ، حدثنا حماد بن سلمة ، عن علي بن زيد ، عن أبي رافع ، عن ابن مسعود أن رسول الله - صلى الله عليه وسلم - خط حوله ، فكان أحدهم مثل سواد النحل ، وقال لي : \" لا تبرح مكانك \" ، فأقرأهم كتاب الله \" ، فلما رأى الزط قال : كأنهم هؤلاء . وقال النبي - صلى الله عليه وسلم - : \" أمعك ماء ؟ \" قلت : لا . قال : \" أمعك نبيذ ؟ \" قلت : نعم . فتوضأ به .\nطريق أخرى مرسلة : قال ابن أبي حاتم : حدثنا أبو عبد الله الظهراني ، أخبرنا حفص بن عمر العدني ، حدثنا الحكم بن أبان ، عن عكرمة في قوله تعالى : ( وإذ صرفنا إليك نفرا من الجن ) قال : هم اثنا عشر ألفا جاءوا من جزيرة الموصل ، فقال النبي - صلى الله عليه وسلم - لابن مسعود : \" أنظرني حتى آتيك \" ، وخط عليه خطا ، وقال : \" لا تبرح حتى آتيك \" . فلما خشيهم ابن مسعود كاد أن يذهب ، فذكر قول رسول الله - صلى الله عليه وسلم - فلم يبرح ، فقال له النبي - صلى الله عليه وسلم - : \" لو ذهبت ما التقينا إلى يوم القيامة \" .\nطريق أخرى مرسلة أيضا : قال سعيد بن أبي عروبة ، عن قتادة في قوله تعالى : ( وإذ صرفنا إليك نفرا من الجن ) قال : ذكر لنا أنهم صرفوا إليه من نينوى ، وأن نبي الله - صلى الله عليه وسلم - قال : \" إني أمرت أن أقرأ على الجن فأيكم يتبعني ؟ \" فأطرقوا ، ثم استتبعهم فأطرقوا ، ثم استتبعهم الثالثة فقال رجل : يا رسول الله ، إن ذاك لذو ندبة فأتبعه ابن مسعود أخو هذيل ، قال : فدخل النبي - صلى الله عليه وسلم - شعبا يقال له : \" شعب الحجون \" ، وخط عليه ، وخط على ابن مسعود ليثبته بذلك ، قال : فجعلت أهال وأرى أمثال النسور تمشي في دفوفها ، وسمعت لغطا شديدا ، حتى خفت على نبي الله - صلى الله عليه وسلم - ثم تلا القرآن ، فلما رجع رسول الله - صلى الله عليه وسلم - قلت : يا رسول الله ، ما اللغط الذي سمعت ؟ قال : \" اختصموا في قتيل ، فقضي بينهم بالحق \" . رواه ابن جرير ، وابن أبي حاتم .\nفهذه الطرق كلها تدل على أنه - صلى الله عليه وسلم - ذهب إلى الجن قصدا ، فتلا عليهم القرآن ، ودعاهم إلى الله ، عز وجل ، وشرع الله لهم على لسانه ما هم محتاجون إليه في ذلك الوقت . وقد يحتمل أن أول مرة سمعوه يقرأ القرآن [ و ] لم يشعر بهم ، كما قاله ابن عباس ، رضي الله عنهما ، ثم بعد ذلك وفدوا إليه كما رواه ابن مسعود . وأما ابن مسعود فإنه لم يكن مع رسول الله - صلى الله عليه وسلم - حال مخاطبته الجن ودعائه إياهم ، وإنما كان بعيدا منه ، ولم يخرج مع النبي - صلى الله عليه وسلم - أحد سواه ، ومع هذا لم يشهد حال المخاطبة ، هذه طريقة البيهقي .\nوقد يحتمل أن يكون أول مرة خرج إليهم لم يكن معه ابن مسعود ولا غيره ، كما هو ظاهر سياق الرواية الأولى من طريق الإمام أحمد ، وهي عند مسلم . ثم بعد ذلك خرج معه ليلة أخرى ، والله أعلم ، كما روى ابن أبي حاتم في تفسير : ( قل أوحي ) ، من حديث ابن جريج قال : قال عبد العزيز بن عمر : أما الجن الذين لقوه بنخلة فجن نينوى ، وأما الجن الذين لقوه بمكة فجن نصيبين ، وتأوله البيهقي على أنه يقول : \" فبتنا بشر ليلة بات بها قوم \" على غير ابن مسعود ممن لم يعلم بخروجه - صلى الله عليه وسلم - إلى الجن ، وهو محتمل على بعد ، والله أعلم .\nوقد قال الحافظ أبو بكر البيهقي : أخبرنا أبو عمرو محمد بن عبد الله الأديب ، أخبرنا أبو بكر الإسماعيلي ، أخبرنا الحسن بن سفيان ، حدثني سويد بن سعيد ، حدثنا عمرو بن يحيى ، عن جده سعيد بن عمرو ، قال كان أبو هريرة يتبع رسول الله - صلى الله عليه وسلم - بإداوة لوضوئه وحاجته ، فأدركه يوما فقال : \" من هذا ؟ \" قال : أنا أبو هريرة قال : \" ائتني بأحجار أستنج بها ، ولا تأتني بعظم ولا روثة \" . فأتيته بأحجار في ثوبي ، فوضعتها إلى جنبه حتى إذا فرغ وقام اتبعته ، فقلت : يا رسول الله ، ما بال العظم والروثة ؟ قال : \" أتاني وفد جن نصيبين ، فسألوني الزاد ، فدعوت الله لهم ألا يمروا بعظم ولا بروثة إلا وجدوه طعاما \" .\nأخرجه البخاري في صحيحه ، عن موسى بن إسماعيل ، عن عمرو بن يحيى بإسناده قريبا منه فهذا يدل مع ما تقدم على أنهم وفدوا عليه بعد ذلك . وسنذكر ما يدل على تكرار ذلك .\nوقد روي عن ابن عباس غير ما ذكر عنه أولا من وجه جيد ، فقال ابن جرير :\nحدثنا أبو كريب ، حدثنا عبد الحميد الحماني ، حدثنا النضر بن عربي ، عن عكرمة ، عن ابن عباس في قوله : ( وإذ صرفنا إليك نفرا من الجن ) الآية ، [ قال ] كانوا سبعة نفر من أهل نصيبين فجعلهم رسول الله - صلى الله عليه وسلم - رسلا إلى قومهم .\nفهذا يدل على أنه قد روى القصتين .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا سويد بن عبد العزيز ، حدثنا رجل سماه ، عن ابن جريج ، عن مجاهد : ( وإذ صرفنا إليك نفرا من الجن ) الآية ، قال : كانوا سبعة نفر ، ثلاثة من أهل حران ، وأربعة من أهل نصيبين ، وكانت أسماؤهم حيى وحسى ومسى ، وشاصر وناصر ، والأرد وإبيان والأحقم .\nوذكر أبو حمزة الثمالي أن هذا الحي من الجن كان يقال لهم : بنو الشيصبان ، وكانوا أكثر الجن عددا وأشرفهم نسبا ، وهم كانوا عامة جنود إبليس .\nوقال سفيان الثوري ، عن عاصم ، عن ذر ، عن ابن مسعود : كانوا تسعة ، أحدهم زوبعة ، أتوه من أصل نخلة .\nوتقدم عنه أنهم كانوا خمسة عشر ، وفي رواية : أنهم كانوا على ستين راحلة ، وتقدم عنه أن اسم سيدهم وردان ، وقيل : كانوا ثلاثمائة ، وتقدم عن عكرمة أنهم كانوا اثني عشر ألفا ، فلعل هذا الاختلاف دليل على تكرر وفادتهم عليه صلوات الله وسلامه عليه ، ومما يدل على ذلك ما قاله البخاري في صحيحه :\nحدثنا يحيى بن سليمان ، حدثني ابن وهب ، حدثني عمر - هو ابن محمد - أن سالما حدثه ، عن عبد الله بن عمر قال : ما سمعت عمر يقول لشيء قط : \" إني لأظنه كذا \" إلا كان كما يظن ، بينما عمر بن الخطاب جالس إذ مر به رجل جميل ، فقال : لقد أخطأ ظني - أو : إن هذا على دينه في الجاهلية - أو لقد كان كاهنهم - علي بالرجل ، فدعي له ، فقال له ذلك ، فقال : ما رأيت كاليوم استقبل له رجل مسلم . قال : فإني أعزم عليك إلا ما أخبرتني . قال : كنت كاهنهم في الجاهلية . قال : فما أعجب ما جاءتك به جنيتك ؟ قال : بينما أنا يوما في السوق جاءتني أعرف فيها الفزع ، فقالت :\nألم تر الجن وإبلاسها ويأسها من بعد إنكاسها\nولحوقها بالقلاص وأحلاسها\nقال عمر : صدق ، بينما أنا نائم عند آلهتهم ، إذ جاء رجل بعجل فذبحه ، فصرخ به صارخ ، لم أسمع صارخا قط أشد صوتا منه يقول : يا جليح ، أمر نجيح ، رجل فصيح يقول : \" لا إله إلا الله \" فوثب القوم ، فقلت : لا أبرح حتى أعلم ما وراء هذا ؟ ثم نادى يا جليح ، أمر نجيح ، رجل فصيح يقول : \" لا إله إلا الله \" . فقمت ، فما نشبنا أن قيل : هذا نبي .\nهذا سياق البخاري ، وقد رواه البيهقي من حديث ابن وهب بنحوه ، ثم قال : \" وظاهر هذه الرواية يوهم أن عمر بنفسه سمع الصارخ يصرخ من العجل الذي ذبح ، وكذلك هو صريح في رواية ضعيفة عن عمر في إسلامه ، وسائر الروايات تدل على أن هذا الكاهن هو الذي أخبر بذلك عن رؤيته وسماعه ، والله أعلم \" .\nوهذا الذي قاله البيهقي هو المتجه وهذا الرجل هو سواد بن قارب ، وقد ذكرت هذا مستقصى في سيرة عمر ، رضي الله عنه ، فمن أراده فليأخذه من ثم ، ولله الحمد [ والمنة ] .\nقال البيهقي : \" حديث سواد بن قارب ، ويشبه أن يكون هذا هو الكاهن الذي لم يذكر اسمه في الحديث الصحيح \" .\nأخبرنا أبو القاسم الحسن بن محمد بن حبيب المفسر من أصل سماعه ، أخبرنا أبو عبد الله محمد بن عبد الله الصفار الأصبهاني ، قراءة عليه ، حدثنا أبو جعفر أحمد بن موسى الحمار الكوفي بالكوفة ، حدثنا زياد بن يزيد بن بادويه أبو بكر القصري ، حدثنا محمد بن النواس الكوفي ، حدثنا أبو بكر بن عياش ، عن أبي إسحاق ، عن البراء [ رضي الله عنه ] قال : بينما عمر بن الخطاب يخطب الناس على منبر رسول الله - صلى الله عليه وسلم - إذ قال : أيها الناس ، أفيكم سواد بن قارب ؟ قال : فلم يجبه أحد تلك السنة ، فلما كانت السنة المقبلة قال : أيها الناس ، أفيكم سواد بن قارب ؟ قال : فقلت : يا أمير المؤمنين ، وما سواد بن قارب ؟ قال : فقال له عمر : إن سواد بن قارب كان بدء إسلامه شيئا عجيبا ، قال : فبينا نحن كذلك إذ طلع سواد بن قارب ، قال : فقال له عمر : يا سواد حدثنا ببدء إسلامك ، كيف كان ؟ قال سواد : فإني كنت نازلا بالهند ، وكان لي رئي من الجن ، قال : فبينا أنا ذات ليلة نائم ، إذ جاءني في منامي ذلك . قال : قم فافهم واعقل إن كنت تعقل ، قد بعث رسول من لؤي بن غالب ، ثم أنشأ يقول :\nعجبت للجن وأنجاسها وشدها العيس بأحلاسها\nتهوي إلى مكة تبغي الهدى ما مؤمنو الجن كأرجاسها\nفانهض إلى الصفوة من هاشم واسم بعينيك إلى راسها\nقال : ثم أنبهني فأفزعني ، وقال : يا سواد بن قارب ، إن الله بعث نبيا فانهض إليه تهتد وترشد . فلما كان من الليلة الثانية أتاني فأنبهني ، ثم أنشأ يقول كذلك :\nعجبت للجن وتطلابها وشدها العيس بأقتابها\nتهوي إلى مكة تبغي الهدى ليس قداماها كأذنابها\nفانهض إلى الصفوة من هاشم واسم بعينيك إلى نابها\nفلما كان في الليلة الثالثة أتاني فأنبهني ، ثم قال :\nعجبت للجن وتخبارها وشدها العيس بأكوارها\nتهوي إلى مكة تبغي الهدى ليس ذوو الشر كأخيارها\nفانهض إلى الصفوة من هاشم ما مؤمنو الجن ككفارها\nقال : فلما سمعته تكرر ليلة بعد ليلة ، وقع في قلبي حب الإسلام من أمر رسول الله - صلى الله عليه وسلم - ما شاء الله ، قال : فانطلقت إلى رحلي فشددته على راحلتي ، فما حللت [ عليه ] نسعة ولا عقدت أخرى حتى أتيت رسول الله - صلى الله عليه وسلم - فإذا هو بالمدينة - يعني مكة - والناس عليه كعرف الفرس ، فلما رآني النبي - صلى الله عليه وسلم - قال : \" مرحبا بك يا سواد بن قارب ، قد علمنا ما جاء بك \" . قال : قلت : يا رسول الله ، قد قلت شعرا ، فاسمعه مني . قال سواد : فقلت :\nأتاني رئي بعد ليل وهجعة ولم يك فيما قد بلوت بكاذب\nثلاث ليال قوله كل ليلة أتاك رسول من لؤي بن غالب\nفشمرت عن ساقي الإزار ووسطت بي الدعلب الوجناء عند السباسب\nفأشهد أن الله لا شيء غيره وأنك مأمون على كل غائب\nوأنك أدنى المرسلين شفاعة إلى الله يا ابن الأكرمين الأطايب\nفمرنا بما يأتيك يا خير مرسل وإن كان فيما جاء شيب الذوائب\nوكن لي شفيعا يوم لا ذو شفاعة سواك بمغن عن سواد بن قارب\nقال : فضحك رسول الله - صلى الله عليه وسلم - حتى بدت نواجذه ، وقال لي : \" أفلحت يا سواد \" : فقال له عمر : هل يأتيك رئيك الآن ؟ فقال : منذ قرأت القرآن لم يأتني ، ونعم العوض كتاب الله من الجن .\nثم أسنده البيهقي من وجهين آخرين . ومما يدل على وفادتهم إليه ، عليه السلام ، بعد ما هاجر إلى المدينة ، الحديث الذي رواه الحافظ أبو نعيم في كتاب \" دلائل النبوة \" [ فقال ] :\nحدثنا سليمان بن أحمد ، حدثنا محمد بن عبدة المصيصي ، حدثنا أبو توبة الربيع بن نافع ، حدثنا معاوية بن سلام ، عن زيد بن أسلم : أنه سمع أبا سلام يقول : حدثني من حدثه عمرو بن غيلان الثقفي قال : أتيت عبد الله بن مسعود فقلت له : حدثت أنك كنت مع رسول الله - صلى الله عليه وسلم - ليلة وفد الجن ؟ قال : أجل ، قلت : حدثني كيف كان شأنه ؟ فقال : إن أهل الصفة أخذ كل رجل منهم رجل يعشيه ، وتركت فلم يأخذني أحد منهم ، فمر بي رسول الله - صلى الله عليه وسلم - فقال : \" من هذا ؟ \" فقلت : أنا ابن مسعود . فقال : \" ما أخذك أحد يعشيك ؟ \" فقلت : لا . قال : \" فانطلق لعلي أجد لك شيئا \" . قال : فانطلقنا حتى أتى حجرة أم سلمة فتركني ودخل إلى أهله ، ثم خرجت الجارية فقالت : يا ابن مسعود ، إن رسول الله - صلى الله عليه وسلم - لم يجد لك عشاء ، فارجع إلى مضجعك . قال : فرجعت إلى المسجد ، فجمعت حصباء المسجد فتوسدته ، والتففت بثوبي ، فلم ألبث إلا قليلا حتى جاءت الجارية ، فقالت : أجب رسول الله . فاتبعتها وأنا أرجو العشاء ، حتى إذا بلغت مقامي ، خرج رسول الله - صلى الله عليه وسلم - وفي يده عسيب من نخل ، فعرض به على صدري فقال : \" أتنطلق أنت معي حيث انطلقت ؟ \" قلت : ما شاء الله . فأعادها علي ثلاث مرات ، كل ذلك أقول : ما شاء الله . فانطلق وانطلقت معه ، حتى أتينا بقيع الغرقد ، فخط بعصاه خطا ، ثم قال : \" اجلس فيها ، ولا تبرح حتى آتيك \" . ثم انطلق يمشي وأنا أنظر إليه خلال النخل ، حتى إذا كان من حيث لا أراه ثارت العجاجة السوداء ، ففرقت فقلت : ألحق برسول الله - صلى الله عليه وسلم - فإني أظن أن هوازن مكروا برسول الله - صلى الله عليه وسلم - ليقتلوه ، فأسعى إلى البيوت ، فأستغيث الناس . فذكرت أن رسول الله - صلى الله عليه وسلم - أوصاني : أن لا أبرح مكاني الذي أنا فيه ، فسمعت رسول الله - صلى الله عليه وسلم - يقرعهم بعصاه ويقول : \" اجلسوا \" . فجلسوا حتى كاد ينشق عمود الصبح ، ثم ثاروا وذهبوا ، فأتاني رسول الله - صلى الله عليه وسلم - فقال : \" أنمت بعدي ؟ \" فقلت : لا ، ولقد فزعت الفزعة الأولى ، حتى رأيت أن آتي البيوت فأستغيث الناس حتى سمعتك تقرعهم بعصاك ، وكنت أظنها هوازن ، مكروا برسول الله - صلى الله عليه وسلم - ليقتلوه . فقال : \" لو أنك خرجت من هذه الحلقة ما آمنهم عليك أن يختطفك بعضهم ، فهل رأيت من شيء منهم ؟ \" فقلت : رأيت رجالا سودا مستشعرين بثياب بيض ، فقال رسول الله - صلى الله عليه وسلم - : \" أولئك وفد جن نصيبين ، أتوني فسألوني الزاد والمتاع ، فمتعتهم بكل عظم حائل أو روثة أو بعرة \" . قلت : وما يغني عنهم ذلك ؟ قال : \" إنهم لا يجدون عظما إلا وجدوا عليه لحمه الذي كان عليه يوم أكل ، ولا روثة إلا وجدوا فيها حبها الذي كان فيها يوم أكلت ، فلا يستنقي أحد منكم بعظم ولا بعرة \" .\nوهذا إسناد غريب جدا ، ولكن فيه رجل مبهم لم يسم [ والله أعلم ] . وقد روى الحافظ أبو نعيم من حديث بقية بن الوليد ، حدثني نمير بن زيد القنبر ، حدثنا أبي ، حدثنا قحافة بن ربيعة ، حدثني الزبير بن العوام قال : صلى بنا رسول الله - صلى الله عليه وسلم - صلاة الصبح في مسجد المدينة ، فلما انصرف قال : \" أيكم يتبعني إلى وفد الجن الليلة ؟ \" فأسكت القوم ثلاثا ، فمر بي فأخذ بيدي ، فجعلت أمشي معه حتى حبست عنا جبال المدينة كلها ، وأفضينا إلى أرض براز ، فإذا برجال طوال كأنهم الرماح ، مستشعرين بثيابهم من بين أرجلهم ، فلما رأيتهم غشيتني رعدة شديدة ، ثم ذكر نحو حديث ابن مسعود المتقدم ، وهذا حديث غريب ، والله أعلم .\nومما يتعلق بوفود الجن ما رواه الحافظ أبو نعيم : حدثنا أبو محمد بن حيان ، حدثنا أبو الطيب أحمد بن روح ، حدثنا يعقوب الدورقي ، حدثنا الوليد بن بكير التميمي ، حدثنا حصين بن عمر أخبرني عبيد المكتب ، عن إبراهيم قال : خرج نفر من أصحاب عبد الله يريدون الحج ، حتى إذا كانوا في بعض الطريق ، إذا هم بحية تنثني على الطريق أبيض ، ينفخ منه ريح المسك ، فقلت لأصحابي : امضوا ، فلست ببارح حتى أنظر إلى ما يصير إليه أمر هذه الحية . قال : فما لبثت أن ماتت ، فعمدت إلى خرقة بيضاء فلففتها فيها ، ثم نحيتها عن الطريق فدفنتها ، وأدركت أصحابي في المتعشى . قال : فوالله إنا لقعود إذ أقبل أربع نسوة من قبل المغرب ، فقالت واحدة منهن : أيكم دفن عمرا ؟ قلنا : ومن عمرو ؟ قالت : أيكم دفن الحية ؟ قال : قلت : أنا . قالت : أما والله لقد دفنت صواما قواما ، يأمر بما أنزل الله ، ولقد آمن بنبيكم ، وسمع صفته من السماء قبل أن يبعث بأربعمائة عام . قال الرجل : فحمدنا الله ، ثم قضينا حجتنا ، ثم مررت بعمر بن الخطاب في المدينة ، فأنبأته بأمر الحية ، فقال : صدقت ، سمعت رسول الله - صلى الله عليه وسلم - يقول : \" لقد آمن بي قبل أن أبعث بأربعمائة سنة \" .\nوهذا حديث غريب جدا ، والله أعلم .\nقال أبو نعيم : وقد روى الثوري ، عن أبي إسحاق ، عن الشعبي ، عن رجل من ثقيف ، بنحوه . وروى عبد الله بن أحمد والظهراني ، عن صفوان بن المعطل - هو الذي نزل ودفن تلك الحية من بين الصحابة - وأنهم قالوا : أما إنه آخر التسعة موتا الذين أتوا رسول الله - صلى الله عليه وسلم - يستمعون القرآن .\nوروى أبو نعيم من حديث الليث بن سعد ، عن عبد العزيز بن أبي سلمة الماجشون ، عن عمه ، عن معاذ بن عبيد الله بن معمر قال : كنت جالسا عند عثمان بن عفان ، فجاء رجل فقال : يا أمير المؤمنين ، إني كنت بفلاة من الأرض ، فذكر أنه رأى ثعبانين اقتتلا ثم قتل أحدهما الآخر ، قال : فذهبت إلى المعترك ، فوجدت حيات كثيرة مقتولة ، وإذ ينفح من بعضها ريح المسك ، فجعلت أشمها واحدة واحدة ، حتى وجدت ذلك من حية صفراء رقيقة ، فلففتها في عمامتي ودفنتها . فبينا أنا أمشي إذ ناداني مناد : يا عبد الله ، لقد هديت ! هذان حيان من الجن بنو أشعيبان وبنو أقيش التقوا ، فكان من القتلى ما رأيت ، واستشهد الذي دفنته ، وكان من الذين سمعوا الوحي من رسول الله - صلى الله عليه وسلم - . قال : فقال عثمان لذلك الرجل : إن كنت صادقا فقد رأيت عجبا ، وإن كنت كاذبا فعليك كذبك .\nفقوله تعالى : ( وإذ صرفنا إليك نفرا من الجن ) أي : طائفة من الجن ، ( يستمعون القرآن فلما حضروه قالوا أنصتوا ) أي : استمعوا وهذا أدب منهم .\nوقد قال الحافظ البيهقي : حدثنا الإمام أبو الطيب سهل بن محمد بن سليمان ، أخبرنا أبو الحسن محمد بن عبد الله الدقاق ، حدثنا محمد بن إبراهيم البوشنجي ، حدثنا هشام بن عمار الدمشقي ، حدثنا الوليد بن مسلم ، عن زهير بن محمد ، عن محمد بن المنكدر ، عن جابر بن عبد الله قال : قرأ رسول الله - صلى الله عليه وسلم - سورة \" الرحمن \" حتى ختمها ، ثم قال : \" ما لي أراكم سكوتا ، للجن كانوا أحسن منكم ردا ، ما قرأت عليهم هذه الآية من مرة : ( فبأي آلاء ربكما تكذبان ) إلا قالوا : ولا بشيء من آلائك - أو نعمك - ربنا نكذب ، فلك الحمد \" .\nورواه الترمذي في التفسير ، عن أبي مسلم عبد الرحمن بن واقد ، عن الوليد بن مسلم به . قال : خرج رسول الله - صلى الله عليه وسلم - على أصحابه ، فقرأ عليهم سورة الرحمن ، فذكره ، ثم قال الترمذي : \" غريب لا نعرفه إلا من حديث الوليد ، عن زهير \" كذا قال . وقد رواه البيهقي من حديث مروان بن محمد الطاطري ، عن زهير بن محمد ، به مثله .\nوقوله : ( فلما قضي ) أي : فرغ . كقوله : ( فإذا قضيت الصلاة ) [ الجمعة : 10 ] ، ( فقضاهن سبع سماوات في يومين ) [ فصلت : 12 ] ، ( فإذا قضيتم مناسككم ) [ البقرة : 200 ] ( ولوا إلى قومهم منذرين ) أي : رجعوا إلى قومهم فأنذروهم ما سمعوه من رسول الله - صلى الله عليه وسلم - كقوله : ( ليتفقهوا في الدين ولينذروا قومهم إذا رجعوا إليهم لعلهم يحذرون ) [ التوبة : 122 ] .\nوقد استدل بهذه الآية على أنه في الجن نذر ، وليس فيهم رسل : ولا شك أن الجن لم يبعث الله منهم رسولا ; لقوله : ( وما أرسلنا من قبلك إلا رجالا نوحي إليهم من أهل القرى ) [ يوسف : 109 ] ، وقال ( وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق ) [ الفرقان : 20 ] ، وقال عن إبراهيم الخليل : ( وجعلنا في ذريته النبوة والكتاب ) [ العنكبوت : 27 ] .\nفكل نبي بعثه الله بعد إبراهيم فمن ذريته وسلالته ، فأما قوله تعالى في [ سورة ] الأنعام : ( يا معشر الجن والإنس ألم يأتكم رسل منكم ) [ الأنعام : 130 ] ، فالمراد من مجموع الجنسين ، فيصدق على أحدهما وهو الإنس ، كقوله : ( يخرج منهما اللؤلؤ والمرجان ) [ الرحمن : 22 ] أي : أحدهما .\n                                    ",
      "qortoby": "وَإِذۡ صَرَفۡنَآ إِلَيۡكَ نَفَرٗا مِّنَ ٱلۡجِنِّ يَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوٓاْ أَنصِتُواْۖ فَلَمَّا قُضِيَ وَلَّوۡاْ إِلَىٰ قَوۡمِهِم مُّنذِرِينَ ٩٢\n                                    \n                                    \n                                    قوله تعالى : وإذ صرفنا إليك نفرا من الجن يستمعون القرآن فلما حضروه قالوا أنصتوا فلما قضي ولوا إلى قومهم منذرين .\nقوله تعالى : وإذ صرفنا إليك نفرا من الجن يستمعون القرآن هذا توبيخ لمشركي قريش ، أي : إن الجن سمعوا القرآن فآمنوا به وعلموا أنه من عند الله وأنتم معرضون مصرون على الكفر . ومعنى : صرفنا وجهنا إليك وبعثنا . وذلك أنهم صرفوا عن استراق السمع من السماء برجوم الشهب - على ما يأتي - ولم يكونوا بعد عيسى قد صرفوا عنه إلا عند مبعث النبي صلى الله عليه وسلم . قال المفسرون ابن عباس وسعيد بن جبير ومجاهد وغيرهم : لما مات أبو طالب خرج النبي - صلى الله عليه وسلم - وحده إلى الطائف يلتمس من ثقيف النصرة فقصد عبد ياليل ومسعودا وحبيبا وهم إخوة - بنو عمرو بن عمير - وعندهم امرأة من قريش من بني جمح ، فدعاهم إلى الإيمان وسألهم أن ينصروه على قومه فقال أحدهم : هو يمرط ثياب الكعبة إن كان الله أرسلك وقال الآخر : ما وجد الله أحدا يرسله غيرك وقال الثالث : والله لا أكلمك كلمة أبدا ، إن كان الله أرسلك كما تقول فأنت أعظم خطرا من أن أرد عليك الكلام ، وإن كنت تكذب فما ينبغي لي أن أكلمك . ثم أغروا به سفهاءهم وعبيدهم يسبونه ويضحكون به ، حتى اجتمع عليه الناس وألجئوه إلى حائط لعتبة وشيبة ابني ربيعة . فقال للجمحية : [ ماذا لقينا من أحمائك ] ؟ ثم قال : اللهم إني أشكو إليك ضعف قوتي وقلة حيلتي وهواني على الناس ، يا أرحم الراحمين ، أنت رب المستضعفين ، وأنت ربي ، لمن تكلني إلى عبد يتجهمني ، أو إلى عدو ملكته أمري إن لم يكن بك غضب علي فلا أبالي ، ولكن عافيتك هي أوسع لي ، أعوذ بنور وجهك من أن ينزل بي غضبك ، أو يحل علي سخطك ، لك العتبى حتى ترضى ، ولا حول ولا قوة إلا بك . فرحمه ابنا ربيعة وقالا لغلام لهما نصراني يقال له عداس : خذ قطفا من العنب وضعه في هذا الطبق ثم ضعه بين يدي هذا الرجل ، فلما وضعه بين يدي رسول الله - صلى الله عليه وسلم - قال النبي - صلى الله عليه وسلم - : باسم الله ثم أكل ، فنظر عداس إلى وجهه ثم قال : والله إن هذا الكلام ما يقوله أهل هذه البلدة فقال النبي - صلى الله عليه وسلم - : من أي البلاد أنت يا عداس وما دينك قال : أنا نصراني من أهل نينوى . فقال له النبي - صلى الله عليه وسلم - : أمن قرية الرجل الصالح يونس بن متى ؟ فقال : وما يدريك ما يونس بن متى ؟ قال : ذاك أخي كان نبيا وأنا نبي فانكب عداس حتى قبل رأس النبي - صلى الله عليه وسلم - ويديه ورجليه . فقال له ابنا ربيعة : لم فعلت هكذا ؟ فقال : يا سيدي ما في الأرض خير من هذا ، أخبرني بأمر ما يعلمه إلا نبي .\nثم انصرف النبي - صلى الله عليه وسلم - حين يئس من خير ثقيف ، حتى إذا كان ببطن نخلة قام من الليل يصلي فمر به نفر من جن أهل نصيبين . وكان سبب ذلك أن الجن كانوا يسترقون السمع ، فلما حرست السماء ورموا بالشهب قال إبليس : إن هذا الذي حدث في السماء لشيء حدث في الأرض ، فبعث سراياه ليعرف الخبر ، أولهم ركب نصيبين وهم أشراف الجن إلى تهامة ، فلما بلغوا بطن نخلة سمعوا النبي - صلى الله عليه وسلم - يصلي صلاة الغداة ببطن نخلة ويتلو القرآن ، فاستمعوا له وقالوا : أنصتوا .\nوقالت طائفة : بل أمر النبي - صلى الله عليه وسلم - أن ينذر الجن ويدعوهم إلى الله تعالى ويقرأ عليهم القرآن ، فصرف الله - عز وجل - إليه نفرا من الجن من نينوى وجمعهم له ، فقال النبي - صلى الله عليه وسلم - : إني أريد أن أقرأ القرآن على الجن الليلة فأيكم يتبعني ؟ فأطرقوا ، ثم قال الثانية فأطرقوا ، ثم قال الثالثة فأطرقوا ، فقال ابن مسعود : أنا يا رسول الله ، قال ابن مسعود : ولم يحضر معه أحد غيري ، فانطلقنا حتى إذا كنا بأعلى مكة دخل النبي - صلى الله عليه وسلم - شعبا يقال له ( شعب الحجون ) وخط لي خطا وأمرني أن أجلس فيه وقال : لا تخرج منه حتى أعود إليك . ثم انطلق حتى قام فافتتح القرآن ، فجعلت أرى أمثال النسور تهوي وتمشي في رفرفها ، وسمعت لغطا وغمغمة حتى خفت على النبي - صلى الله عليه وسلم - ، وغشيته أسودة كثيرة حالت بيني وبينه حتى ما أسمع صوته ، ثم طفقوا يتقطعون مثل قطع السحاب ذاهبين ، ففرغ النبي - صلى الله عليه وسلم - مع الفجر فقال : أنمت ؟ قلت : لا والله ، ولقد هممت مرارا أن أستغيث بالناس حتى سمعتك تقرعهم بعصاك تقول اجلسوا ، فقال : لو خرجت لم آمن عليك أن يخطفك بعضهم ثم قال : هل رأيت شيئا ؟ قلت : نعم يا رسول الله ، رأيت رجالا سودا مستثفري ثيابا بيضا ، فقال : أولئك جن نصيبين سألوني المتاع والزاد فمتعتهم بكل عظم حائل وروثة وبعرة . فقالوا : يا رسول الله يقذرها الناس علينا . فنهى رسول الله - صلى الله عليه وسلم - أن يستنجى بالعظم والروث .\nقلت : يا نبي الله ، وما يغني ذلك عنهم قال : إنهم لا يجدون عظما إلا وجدوا عليه لحمه يوم أكل ، ولا روثة إلا وجدوا فيها حبها يوم أكل فقلت : يا رسول الله ، لقد سمعت لغطا شديدا ؟ فقال : إن الجن تدارأت في قتيل بينهم فتحاكموا إلي فقضيت بينهم بالحق . ثم تبرز النبي - صلى الله عليه وسلم - ثم أتاني فقال : هل معك ماء ؟ فقلت يا نبي الله ، معي إداوة فيها شيء من نبيذ التمر فصببت على يديه فتوضأ فقال : تمرة طيبة وماء طهور روى معناه معمر عن قتادة وشعبة أيضا عن ابن مسعود . وليس في حديث معمر ذكر نبيذ التمر .\nروي عن أبي عثمان النهدي أن ابن مسعود أبصر زطا فقال : ما هؤلاء ؟ قال : هؤلاء الزط . قال : ما رأيت شبههم إلا الجن ليلة الجن فكانوا مستفزين يتبع بعضهم بعضا . وذكر الدارقطني عن عبد الله بن لهيعة حدثني قيس بن الحجاج عن حنش عن ابن عباس عن ابن مسعود أنه وضأ النبي - صلى الله عليه وسلم - ليلة الجن بنبيذ فتوضأ به وقال : شراب وطهور . ابن لهيعة لا يحتج به . وبهذا السند عن ابن مسعود : أنه خرج مع النبي - صلى الله عليه وسلم - ليلة الجن ، فقال له رسول الله - صلى الله عليه وسلم - : أمعك ماء يا بن مسعود ؟ فقال : معي نبيذ في إداوة ، فقال رسول الله - صلى الله عليه وسلم - : صب علي منه . فتوضأ وقال : هو شراب وطهور تفرد به ابن لهيعة وهو ضعيف الحديث .\nقال الدارقطني : وقيل إن ابن مسعود لم يشهد مع النبي - صلى الله عليه وسلم - ليلة الجن . كذلك رواه علقمة بن قيس وأبو عبيدة بن عبد الله وغيرهما عنه أنه قال : ما شهدت ليلة الجن . حدثنا أبو محمد بن صاعد حدثنا أبو الأشعث حدثنا بشر بن المفضل حدثنا داود بن أبي هند عن عامر عن علقمة بن قيس قال قلت لعبد الله بن مسعود : أشهد رسول الله - صلى الله عليه وسلم - أحد منكم ليلة أتاه داعي الجن ؟ قال لا . قال الدارقطني : هذا إسناد صحيح لا يختلف في عدالة راويه . وعن عمرو بن مرة قال قلت لأبي عبيدة : حضر عبد الله بن مسعود ليلة الجن ؟ فقال لا . قال ابن عباس : كان الجن سبعة نفر من جن نصيبين فجعلهم النبي - صلى الله عليه وسلم - رسلا إلى قومهم . وقال زر بن حبيش : كانوا تسعة أحدهم زوبعة . وقال قتادة : إنهم من أهل نينوى . وقال مجاهد : من أهل حران . وقال عكرمة : من جزيرة الموصل . وقيل : إنهم كانوا سبعة ، ثلاثة من أهل نجران وأربعة من أهل نصيبين . وروى ابن أبي الدنيا أن النبي - صلى الله عليه وسلم - قال في هذا الحديث وذكر فيه نصيبين فقال : رفعت إلي حتى رأيتها فدعوت الله أن يكثر مطرها وينضر شجرها وأن يغزو نهرها . وقال السهيلي : ويقال كانوا سبعة ، وكانوا يهودا فأسلموا ، ولذلك قالوا : أنزل من بعد موسى وقيل في أسمائهم : شاصر وماصر ومنشى وماشي والأحقب ، ذكر هؤلاء الخمسة ابن دريد . ومنهم عمرو بن جابر ، ذكره ابن سلام من طريق أبي إسحاق السبيعي عن أشياخه عن ابن مسعود أنه كان في نفر من أصحاب النبي - صلى الله عليه وسلم - يمشون فرفع لهم إعصار ثم جاء إعصار أعظم منه فإذا حية قتيل ، فعمد رجل منا إلى ردائه فشقه وكفن الحية ببعضه ودفنها ، فلما جن الليل إذا امرأتان تسألان : أيكم دفن عمرو بن جابر ؟ فقلنا : ما ندري من عمرو بن جابر فقالتا : إن كنتم ابتغيتم الأجر فقد وجدتموه ، إن فسقة الجن اقتتلوا مع المؤمنين فقتل عمرو ، وهو الحية التي رأيتم ، وهو من النفر الذين استمعوا القرآن من محمد - صلى الله عليه وسلم - ثم ولوا إلى قومهم منذرين . وذكر ابن سلام رواية أخرى : أن الذي كفنه هو صفوان بن المعطل .\nقلت : وذكر هذا الخبر الثعلبي بنحوه فقال : وقال ثابت بن قطبة جاء أناس إلى ابن مسعود فقالوا : إنا كنا في سفر فرأينا حية متشحطة في دمائها ، فأخذها رجل منا فواريناها ، فجاء أناس فقالوا : أيكم دفن عمرا ؟ قلنا وما عمرو ؟ قالوا الحية التي دفنتم في مكان كذا ، أما إنه كان من النفر الذين سمعوا القرآن من النبي - صلى الله عليه وسلم - وكان بين حيين من الجن مسلمين وكافرين قتال فقتل . ففي هذا الخبر أن ابن مسعود لم يكن في سفر ولا حضر الدفن ، والله أعلم .\nوذكر ابن أبي الدنيا عن رجل من التابعين سماه : أن حية دخلت عليه في خبائه تلهث عطشا فسقاها ثم أنها ماتت فدفنها ، فأتي من الليل فسلم عليه وشكر ، وأخبر أن تلك الحية كانت رجلا من جن نصيبين اسمه زوبعة . قال السهيلي : وبلغنا في فضائل عمر بن عبد العزيز - رضي الله عنه - مما حدثنا به أبو بكر بن طاهر الأشبيلي أن عمر بن عبد العزيز كان يمشي بأرض فلاة ، فإذا حية ميتة فكفنها بفضلة من ردائه ودفنها ، فإذا قائل يقول : يا سرق ، أشهد لسمعت رسول الله - صلى الله عليه وسلم - يقول : [ ستموت بأرض فلاة فيكفنك رجل صالح ] . فقال : ومن أنت يرحمك الله ؟ فقال : رجل من الجن الذين استمعوا القرآن من رسول الله - صلى الله عليه وسلم - لم يبق منهم إلا أنا وسرق ، وهذا سرق قد مات .\nوقد قتلت عائشة رضي الله عنها حية رأتها في حجرتها تستمع وعائشة تقرأ ، فأتيت في المنام فقيل لها : إنك قتلت رجلا مؤمنا من الجن الذين قدموا على رسول الله - صلى الله عليه وسلم - ، فقالت : لو كان مؤمنا ما دخل على حرم رسول الله - صلى الله عليه وسلم - ، فقيل لها : ما دخل عليك إلا وأنت متقنعة ، وما جاء إلا ليستمع الذكر . فأصبحت عائشة فزعة ، واشترت رقابا فأعتقتهم .\nقال السهيلي : وقد ذكرنا من أسماء هؤلاء الجن ما حضرنا ، فإن كانوا سبعة فالأحقب منهم وصف لأحدهم ، وليس باسم علم ، فإن الأسماء التي ذكرناها آنفا ثمانية بالأحقب . والله أعلم .\nقلت : وقد ذكر الحافظ ابن عساكر في تاريخه : هامة بن الهيم بن الأقيس بن إبليس ، قيل : إنه من مؤمني الجن وممن لقي النبي - صلى الله عليه وسلم - وعلمه سورة ( إذا وقعت الواقعة ) و ( المرسلات ) و ( عم يتساءلون ) و ( إذا الشمس كورت ) و ( الحمد ) و ( المعوذتين ) وذكر أنه حضر قتل هابيل وشرك في دمه وهو غلام ابن أعوام ، وأنه لقي نوحا وتاب على يديه ، وهودا وصالحا ويعقوب ويوسف وإلياس وموسى بن عمران وعيسى ابن مريم عليهم السلام . وقد ذكر الماوردي أسماءهم عن مجاهد فقال : حسى ومسى ومنشى وشاصر وماصر والأرد وأنيان والأحقم . وذكرها أبو عمرو عثمان بن أحمد المعروف بابن السماك قال : حدثنا محمد بن البراء قال حدثنا الزبير بن بكار قال : كان حمزة بن عتبة بن أبي لهب يسمي جن نصيبين الذين قدموا على رسول الله - صلى الله عليه وسلم - فيقول : حسى ومسى وشاصر وماصر والأفخر والأرد وأنيال .\nقوله تعالى : فلما حضروه أي حضروا النبي - صلى الله عليه وسلم - ، وهو من باب تلوين الخطاب . وقيل : لما حضروا القرآن واستماعه . قالوا أنصتوا أي قال بعضهم لبعض اسكتوا لاستماع القرآن . قال ابن مسعود : هبطوا على النبي - صلى الله عليه وسلم - وهو يقرأ القرآن ببطن نخلة ، فلما سمعوه قالوا أنصتوا قالوا صه . وكانوا سبعة : أحدهم زوبعة ، فأنزل الله تعالى : وإذ صرفنا إليك نفرا من الجن يستمعون القرآن فلما حضروه قالوا أنصتوا الآية إلى قوله : في ضلال مبين وقيل : أنصتوا لسماع قول رسول الله - صلى الله عليه وسلم - ، والمعنى متقارب . فلما قضي وقرأ لاحق بن حميد وخبيب بن عبد الله بن الزبير ( فلما قضى ) بفتح القاف والضاد ، يعني النبي - صلى الله عليه وسلم - قبل الصلاة . وذلك أنهم خرجوا حين حرست السماء من استراق السمع ليستخبروا ما أوجب ذلك ؟ فجاءوا وادي نخلة والنبي - صلى الله عليه وسلم - يقرأ في صلاة الفجر ، وكانوا سبعة ، فسمعوه وانصرفوا إلى قومهم منذرين ، ولم يعلم بهم النبي صلى الله عليه وسلم . وقيل : بل أمر النبي - صلى الله عليه وسلم - أن ينذر الجن ويقرأ عليهم القرآن ، فصرف الله إليه نفرا من الجن ليستمعوا منه وينذروا قومهم ، فلما تلا عليهم القرآن وفرغ انصرفوا بأمره قاصدين من وراءهم من قومهم من الجن ، منذرين لهم مخالفة القرآن ومحذرين إياهم بأس الله إن لم يؤمنوا . وهذا يدل على أنهم آمنوا بالنبي - صلى الله عليه وسلم - ، وأنه أرسلهم . ويدل على هذا قولهم : ياقومنا أجيبوا داعي الله وآمنوا به ولولا ذلك لما أنذروا قومهم . وقد تقدم عن ابن عباس أن النبي - صلى الله عليه وسلم - جعلهم رسلا إلى قومهم ، فعلى هذا ليلة الجن ليلتان ، وقد تقدم هذا المعنى مستوفى . وفي صحيح مسلم ما يدل على ذلك على ما يأتي بيانه في ( قل أوحي إلي ) . وفي صحيح مسلم عن معن قال : سمعت أبي قال سألت مسروقا : من آذن النبي - صلى الله عليه وسلم - بالجن ليلة استمعوا القرآن ؟ فقال : حدثني أبوك - يعني ابن مسعود - أنه آذنته بهم شجرة .\n                                    ",
      "saadi": "وَإِذۡ صَرَفۡنَآ إِلَيۡكَ نَفَرٗا مِّنَ ٱلۡجِنِّ يَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوٓاْ أَنصِتُواْۖ فَلَمَّا قُضِيَ وَلَّوۡاْ إِلَىٰ قَوۡمِهِم مُّنذِرِينَ ٩٢\n                                        \n                                        \n                                        \n                                        كان الله تعالى قد أرسل رسوله محمدا صلى الله عليه وسلم إلى الخلق إنسهم وجنهم وكان لا بد من إبلاغ الجميع لدعوة النبوة والرسالة.\nفالإنس يمكنه عليه الصلاة والسلام دعوتهم وإنذارهم، وأما الجن فصرفهم الله إليه بقدرته وأرسل إليه { نَفَرًا مِنَ الْجِنِّ يَسْتَمِعُونَ الْقُرْآنَ فَلَمَّا حَضَرُوهُ قَالُوا أَنْصِتُوا } أي: وصى بعضهم بعضا بذلك، { فَلَمَّا قُضِي } وقد وعوه وأثر ذلك فيهم { وَلَّوْا إِلَى قَوْمِهِمْ مُنْذِرِينَ } نصحا منهم لهم وإقامة لحجة الله عليهم وقيضهم الله معونة لرسوله صلى الله عليه وسلم في نشر دعوته في الجن.\n                                    "
    }
  },
  {
    "id": 29,
    "versesNumber": 30,
    "souraName": "Al-Ahqaf.html",
    "contnent": "قَالُواْ يَٰقَوۡمَنَآ إِنَّا سَمِعۡنَا كِتَٰبًا أُنزِلَ مِنۢ بَعۡدِ مُوسَىٰ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ يَهۡدِيٓ إِلَى ٱلۡحَقِّ وَإِلَىٰ طَرِيقٖ مُّسۡتَقِيمٖ ٠٣",
    "tafsier": {
      "ibnkther": "قَالُواْ يَٰقَوۡمَنَآ إِنَّا سَمِعۡنَا كِتَٰبًا أُنزِلَ مِنۢ بَعۡدِ مُوسَىٰ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ يَهۡدِيٓ إِلَى ٱلۡحَقِّ وَإِلَىٰ طَرِيقٖ مُّسۡتَقِيمٖ ٠٣\n                                    \n                                    \n                                    ثم إنه تعالى فسر إنذار الجن لقومهم فقال مخبرا عنهم : ( قالوا يا قومنا إنا سمعنا كتابا أنزل من بعد موسى [ مصدقا لما بين يديه يهدي إلى الحق ] ) ، ولم يذكروا عيسى ; لأن عيسى ، عليه السلام ، أنزل عليه الإنجيل فيه مواعظ وترقيقات وقليل من التحليل والتحريم ، وهو في الحقيقة كالمتمم لشريعة التوراة ، فالعمدة هو التوراة ; فلهذا قالوا : أنزل من بعد موسى . وهكذا قال ورقة بن نوفل ، حين أخبره النبي - صلى الله عليه وسلم - بقصة نزول جبريل [ عليه السلام ] عليه أول مرة ، فقال : بخ بخ ، هذا الناموس الذي كان يأتي موسى ، يا ليتني أكون فيها جذعا .\n( مصدقا لما بين يديه ) أي : من الكتب المنزلة قبله على الأنبياء . وقولهم : ( يهدي إلى الحق ) أي : في الاعتقاد والإخبار ، ( وإلى طريق مستقيم ) في الأعمال ، فإن القرآن يشتمل على شيئين خبر وطلب ، فخبره صدق ، وطلبه عدل ، كما قال : ( وتمت كلمة ربك صدقا وعدلا ) [ الأنعام : 115 ] ، وقال ( هو الذي أرسل رسوله بالهدى ودين الحق ) [ التوبة : 33 ] ، فالهدى هو : العلم النافع ، ودين الحق : هو العمل الصالح . وهكذا قالت الجن : ( يهدي إلى الحق ) في الاعتقادات ، ( وإلى طريق مستقيم ) أي : في العمليات .\n                                    ",
      "qortoby": "قَالُواْ يَٰقَوۡمَنَآ إِنَّا سَمِعۡنَا كِتَٰبًا أُنزِلَ مِنۢ بَعۡدِ مُوسَىٰ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ يَهۡدِيٓ إِلَى ٱلۡحَقِّ وَإِلَىٰ طَرِيقٖ مُّسۡتَقِيمٖ ٠٣\n                                    \n                                    \n                                    قوله تعالى : قالوا ياقومنا إنا سمعنا كتابا أنزل من بعد موسى أي القرآن ، وكانوا مؤمنين بموسى . قال عطاء : كانوا يهودا فأسلموا ، ولذلك قالوا : أنزل من بعد موسى وعن ابن عباس : أن الجن لم تكن سمعت بأمر عيسى ، فلذلك قالت : أنزل من بعد موسى\nمصدقا لما بين يديه يعني ما قبله من التوراة . يهدي إلى دين الحق . وإلى طريق مستقيم دين الله القويم .\n                                    ",
      "saadi": "قَالُواْ يَٰقَوۡمَنَآ إِنَّا سَمِعۡنَا كِتَٰبًا أُنزِلَ مِنۢ بَعۡدِ مُوسَىٰ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ يَهۡدِيٓ إِلَى ٱلۡحَقِّ وَإِلَىٰ طَرِيقٖ مُّسۡتَقِيمٖ ٠٣\n                                        \n                                        \n                                        \n                                        { قَالُوا يَا قَوْمَنَا إِنَّا سَمِعْنَا كِتَابًا أُنْزِلَ مِنْ بَعْدِ مُوسَى } لأن كتاب موسى أصل للإنجيل وعمدة لبني إسرائيل في أحكام الشرع، وإنما الإنجيل متمم ومكمل ومغير لبعض الأحكام.\n{ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ يَهْدِي } هذا الكتاب الذي سمعناه { إِلَى الْحَقِّ } وهو الصواب في كل مطلوب وخبر { وَإِلَى طَرِيقٍ مُسْتَقِيمٍ } موصل إلى الله وإلى جنته من العلم بالله وبأحكامه الدينية وأحكام الجزاء.\n                                    "
    }
  },
  {
    "id": 30,
    "versesNumber": 31,
    "souraName": "Al-Ahqaf.html",
    "contnent": "يَٰقَوۡمَنَآ أَجِيبُواْ دَاعِيَ ٱللَّهِ وَءَامِنُواْ بِهِۦ يَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَيُجِرۡكُم مِّنۡ عَذَابٍ أَلِيمٖ ١٣",
    "tafsier": {
      "ibnkther": "يَٰقَوۡمَنَآ أَجِيبُواْ دَاعِيَ ٱللَّهِ وَءَامِنُواْ بِهِۦ يَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَيُجِرۡكُم مِّنۡ عَذَابٍ أَلِيمٖ ١٣\n                                    \n                                    \n                                    ( يا قومنا أجيبوا داعي الله ) فيه دلالة على أنه تعالى أرسل محمدا صلوات الله وسلامه عليه إلى الثقلين الإنس والجن حيث دعاهم إلى الله ، وقرأ عليهم السورة التي فيها خطاب الفريقين ، وتكليفهم ووعدهم ووعيدهم ، وهي سورة الرحمن ; ولهذا قال ( أجيبوا داعي الله وآمنوا به )\nوقوله : ( يغفر لكم من ذنوبكم ) قيل : إن \" من \" هاهنا زائدة وفيه نظر ; لأن زيادتها في الإثبات قليل ، وقيل : إنها على بابها للتبعيض ، ( ويجركم من عذاب أليم ) أي : ويقيكم من عذابه الأليم .\nوقد استدل بهذه الآية من ذهب من العلماء إلى أن الجن المؤمنين لا يدخلون الجنة ، وإنما جزاء صالحيهم أن يجاروا من عذاب النار يوم القيامة ; ولهذا قالوا هذا في هذا المقام ، وهو مقام تبجح ومبالغة فلو كان لهم جزاء على الإيمان أعلى من هذا لأوشك أن يذكروه .\nوقال ابن أبي حاتم : حدثنا أبي قال : حدثت عن جرير ، عن ليث ، عن مجاهد ، عن ابن عباس قال : لا يدخل مؤمنو الجن الجنة ; لأنهم من ذرية إبليس ، ولا تدخل ذرية إبليس الجنة .\nوالحق أن مؤمنهم كمؤمني الإنس يدخلون الجنة ، كما هو مذهب جماعة من السلف ، وقد استدل بعضهم لهذا بقوله : ( لم يطمثهن إنس قبلهم ولا جان ) [ الرحمن : 74 ] ، وفي هذا الاستدلال نظر ، وأحسن منه قوله تعالى : ( ولمن خاف مقام ربه جنتان فبأي آلاء ربكما تكذبان ) [ الرحمن : 46 ، 47 ] ، فقد امتن تعالى على الثقلين بأن جعل جزاء محسنهم الجنة ، وقد قابلت الجن هذه الآية بالشكر القولي أبلغ من الإنس ، فقالوا : \" ولا بشيء من آلائك ربنا نكذب ، فلك الحمد \" فلم يكن تعالى ليمتن عليهم بجزاء لا يحصل لهم ، وأيضا فإنه إذا كان يجازي كافرهم بالنار - وهو مقام عدل - فلأن يجازي مؤمنهم بالجنة - وهو مقام فضل - بطريق الأولى والأحرى . ومما يدل أيضا على ذلك عموم قوله تعالى : ( إن الذين آمنوا وعملوا الصالحات كانت لهم جنات الفردوس نزلا ) [ الكهف : 107 ] ، وما أشبه ذلك من الآيات . وقد أفردت هذه المسألة في جزء على حدة ، ولله الحمد والمنة . وهذه الجنة لا يزال فيها فضل حتى ينشئ الله لها خلقا ، أفلا يسكنها من آمن به وعمل له صالحا ؟ وما ذكروه هاهنا من الجزاء على الإيمان من تكفير الذنوب والإجارة من العذاب الأليم ، هو يستلزم دخول الجنة ; لأنه ليس في الآخرة إلا الجنة أو النار ، فمن أجير من النار دخل الجنة لا محالة . ولم يرد معنا نص صريح ولا ظاهر عن الشارع أن مؤمني الجن لا يدخلون الجنة وإن أجيروا من النار ، ولو صح لقلنا به ، والله أعلم . وهذا نوح ، عليه السلام ، يقول لقومه : ( يغفر لكم من ذنوبكم ويؤخركم إلى أجل مسمى ) [ نوح : 4 ] ، ولا خلاف أن مؤمني قومه في الجنة ، فكذلك هؤلاء . وقد حكي فيهم أقوال غريبة فعن عمر بن عبد العزيز : أنهم لا يدخلون بحبوحة الجنة ، وإنما يكونون في ربضها وحولها وفي أرجائها . ومن الناس من زعم أنهم في الجنة يراهم بنو آدم ولا يرون بني آدم عكس ما كانوا عليه في الدار الدنيا . ومن الناس من قال : لا يأكلون في الجنة ولا يشربون ، وإنما يلهمون التسبيح والتحميد والتقديس ، عوضا عن الطعام والشراب كالملائكة ، لأنهم من جنسهم . وكل هذه الأقوال فيها نظر ، ولا دليل عليها .\n                                    ",
      "qortoby": "يَٰقَوۡمَنَآ أَجِيبُواْ دَاعِيَ ٱللَّهِ وَءَامِنُواْ بِهِۦ يَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَيُجِرۡكُم مِّنۡ عَذَابٍ أَلِيمٖ ١٣\n                                    \n                                    \n                                    يا قومنا أجيبوا داعي يعني محمدا - صلى الله عليه وسلم - ، وهذا يدل على أنه كان مبعوثا إلى الجن والإنس . قال مقاتل : ولم يبعث الله نبيا إلى الجن والإنس قبل محمد صلى الله عليه وسلم .\nقلت : يدل على قوله ما في صحيح مسلم عن جابر بن عبد الله الأنصاري قال : قال رسول الله - صلى الله عليه وسلم - : أعطيت خمسا لم يعطهن أحد قبلي كان كل نبي يبعث إلى قومه خاصة وبعثت إلى كل أحمر وأسود وأحلت لي الغنائم ولم تحل لأحد قبلي وجعلت لي الأرض طيبة طهورا ومسجدا فأيما رجل أدركته الصلاة صلى حيث كان ونصرت بالرعب بين يدي مسيرة شهر وأعطيت الشفاعة . قال مجاهد : الأحمر والأسود : الجن والإنس . وفي رواية من حديث أبي هريرة وبعثت إلى الخلق كافة وختم بي النبيون\nوآمنوا به أي بالداعي ، وهو محمد صلى الله عليه وسلم . وقيل : به أي : بالله ، لقوله : يغفر لكم من ذنوبكم قال ابن عباس : فاستجاب لهم من قومهم سبعون رجلا ، فرجعوا إلى النبي - صلى الله عليه وسلم - فوافقوه بالبطحاء ، فقرأ عليهم القرآن وأمرهم ونهاهم .\nمسألة : هذه الآي تدل على أن الجن كالإنس في الأمر والنهي والثواب والعقاب . وقال الحسن : ليس لمؤمني الجن ثواب غير نجاتهم من النار ، يدل عليه قوله تعالى : يغفر لكم من ذنوبكم ويجركم من عذاب أليم وبه قال أبو حنيفة قال : ليس ثواب الجن إلا أن يجاروا من النار ، ثم يقال لهم : كونوا ترابا مثل البهائم . وقال آخرون : إنهم كما يعاقبون في الإساءة يجازون في الإحسان مثل الإنس . وإليه ذهب مالك والشافعي وابن أبي ليلى . وقد قال الضحاك : الجن يدخلون الجنة ويأكلون ويشربون . قال القشيري : والصحيح أن هذا مما لم يقطع فيه بشيء ، والعلم عند الله .\nقلت : قوله تعالى : ولكل درجات مما عملوا يدل على أنهم يثابون ويدخلون الجنة ; لأنه قال في أول الآية : يامعشر الجن والإنس ألم يأتكم رسل منكم يقصون عليكم آياتي إلى أن قال ولكل درجات مما عملوا . والله أعلم ، وسيأتي لهذا في سورة ( الرحمن ) مزيد بيان إن شاء الله تعالى .\n                                    ",
      "saadi": "يَٰقَوۡمَنَآ أَجِيبُواْ دَاعِيَ ٱللَّهِ وَءَامِنُواْ بِهِۦ يَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَيُجِرۡكُم مِّنۡ عَذَابٍ أَلِيمٖ ١٣\n                                        \n                                        \n                                        \n                                        فلما مدحوا القرآن وبينوا محله ومرتبته دعوهم إلى الإيمان به، فقالوا: { يَا قَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ } أي: الذي لا يدعو إلا إلى ربه لا يدعوكم إلى غرض من أغراضه ولا هوى وإنما يدعوكم إلى ربكم ليثيبكم ويزيل عنكم كل شر ومكروه، ولهذا قالوا: { يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُجِرْكُمْ مِنْ عَذَابٍ أَلِيمٍ } وإذا أجارهم من العذاب الأليم فما ثم بعد ذلك إلا النعيم فهذا جزاء من أجاب داعي الله.\n                                    "
    }
  },
  {
    "id": 31,
    "versesNumber": 32,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَمَن لَّا يُجِبۡ دَاعِيَ ٱللَّهِ فَلَيۡسَ بِمُعۡجِزٖ فِي ٱلۡأَرۡضِ وَلَيۡسَ لَهُۥ مِن دُونِهِۦٓ أَوۡلِيَآءُۚ أُوْلَٰٓئِكَ فِي ضَلَٰلٖ مُّبِينٍ ٢٣",
    "tafsier": {
      "ibnkther": "وَمَن لَّا يُجِبۡ دَاعِيَ ٱللَّهِ فَلَيۡسَ بِمُعۡجِزٖ فِي ٱلۡأَرۡضِ وَلَيۡسَ لَهُۥ مِن دُونِهِۦٓ أَوۡلِيَآءُۚ أُوْلَٰٓئِكَ فِي ضَلَٰلٖ مُّبِينٍ ٢٣\n                                    \n                                    \n                                    ثم قال مخبرا عنه : ( ومن لا يجب داعي الله فليس بمعجز في الأرض ) أي : بل قدرة الله شاملة له ومحيطة به ، ( وليس له من دونه أولياء ) أي : لا يجيرهم منه أحد ( أولئك في ضلال مبين ) وهذا مقام تهديد وترهيب ، فدعوا قومهم بالترغيب والترهيب ; ولهذا نجع في كثير منهم ، وجاءوا إلى رسول الله - صلى الله عليه وسلم - وفودا وفودا ، كما تقدم بيانه .\n                                    ",
      "qortoby": "وَمَن لَّا يُجِبۡ دَاعِيَ ٱللَّهِ فَلَيۡسَ بِمُعۡجِزٖ فِي ٱلۡأَرۡضِ وَلَيۡسَ لَهُۥ مِن دُونِهِۦٓ أَوۡلِيَآءُۚ أُوْلَٰٓئِكَ فِي ضَلَٰلٖ مُّبِينٍ ٢٣\n                                    \n                                    \n                                    قوله تعالى : ومن لا يجب داعي الله فليس بمعجز في الأرض وليس له من دونه أولياء أولئك في ضلال مبين .\nقوله تعالى : ومن لا يجب داعي الله فليس بمعجز في الأرض أي لا يفوت الله ولا يسبقه وليس له من دونه أولياء أي أنصار يمنعونه من عذاب الله . أولئك في ضلال مبين\n\n                                    ",
      "saadi": "وَمَن لَّا يُجِبۡ دَاعِيَ ٱللَّهِ فَلَيۡسَ بِمُعۡجِزٖ فِي ٱلۡأَرۡضِ وَلَيۡسَ لَهُۥ مِن دُونِهِۦٓ أَوۡلِيَآءُۚ أُوْلَٰٓئِكَ فِي ضَلَٰلٖ مُّبِينٍ ٢٣\n                                        \n                                        \n                                        \n                                        { وَمَنْ لَا يُجِبْ دَاعِيَ اللَّهِ فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ } فإن الله على كل شيء قدير فلا يفوته هارب ولا يغالبه مغالب. { وَلَيْسَ لَهُ مِنْ دُونِهِ أَولِيَاءُ أُولَئِكَ فِي ضَلَالٍ مُبِينٍ } وأي ضلال أبلغ من ضلال من نادته الرسل ووصلت إليه النذر بالآيات البينات، والحجج المتواترات فأعرض واستكبر؟\"\n                                    "
    }
  },
  {
    "id": 32,
    "versesNumber": 33,
    "souraName": "Al-Ahqaf.html",
    "contnent": "أَوَ لَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَلَمۡ يَعۡيَ بِخَلۡقِهِنَّ بِقَٰدِرٍ عَلَىٰٓ أَن يُحۡـِۧيَ ٱلۡمَوۡتَىٰۚ بَلَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٣٣",
    "tafsier": {
      "ibnkther": "أَوَ لَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَلَمۡ يَعۡيَ بِخَلۡقِهِنَّ بِقَٰدِرٍ عَلَىٰٓ أَن يُحۡـِۧيَ ٱلۡمَوۡتَىٰۚ بَلَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٣٣\n                                    \n                                    \n                                    يقول تعالى : ( أولم يروا ) أي : هؤلاء المنكرون للبعث يوم القيامة ، المستبعدون لقيام الأجساد يوم المعاد ( أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن ) أي : ولم يكرثه خلقهن ، بل قال لها : \" كوني \" فكانت ، بلا ممانعة ولا مخالفة ، بل طائعة مجيبة خائفة وجلة ، أفليس ذلك بقادر على أن يحيي الموتى ؟ كما قال في الآية الأخرى : ( لخلق السماوات والأرض أكبر من خلق الناس ولكن أكثر الناس لا يعلمون ) [ غافر : 57 ] ، ولهذا قال : ( بلى إنه على كل شيء قدير ) .\n                                    ",
      "qortoby": "أَوَ لَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَلَمۡ يَعۡيَ بِخَلۡقِهِنَّ بِقَٰدِرٍ عَلَىٰٓ أَن يُحۡـِۧيَ ٱلۡمَوۡتَىٰۚ بَلَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٣٣\n                                    \n                                    \n                                    قوله تعالى : أولم يروا أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير .\nقوله تعالى : أولم يروا أن الله الذي خلق السماوات والأرض الرؤية هنا بمعنى العلم . وأن واسمها وخبرها سدت مسد مفعولي الرؤية . ومعنى لم يعي يعجز ويضعف عن إبداعهن . يقال : عي بأمره وعيي إذا لم يهتد لوجهه ، والإدغام أكثر . وتقول في الجمع عيوا ، مخففا ، وعيوا أيضا بالتشديد . قال\nعيوا بأمرهم كما عيت ببيضتها الحمامة\nوعييت بأمري إذا لم تهتد لوجهه . وأعياني هو . وقرأ الحسن ( ولم يعي ) بكسر العين وإسكان الياء ، وهو قليل شاذ ، لم يأت إعلال العين وتصحيح اللام إلا في أسماء قليلة ، نحو غاية وآية . ولم يأت في الفعل سوى بيت أنشده الفراء ، وهو قول الشاعر :\nفكأنها بين النساء سبيكة تمشي بسدة بيتها فتعي\nبقادر قال أبو عبيدة والأخفش : الباء زائدة للتوكيد كالباء في قوله : وكفى بالله شهيدا وقوله : تنبت بالدهن . وقال الكسائي والفراء والزجاج : الباء فيه خلف الاستفهام والجحد في أول الكلام . قال الزجاج : والعرب تدخلها مع الجحد تقول : ما ظننت أن زيدا بقائم . ولا تقول : ظننت أن زيدا بقائم . وهو لدخول ما ودخول أن للتوكيد . والتقدير : أليس الله بقادر ، كقوله تعالى : أوليس الذي خلق السماوات والأرض بقادر . وقرأ ابن مسعود والأعرج والجحدري وابن أبي إسحاق ويعقوب ( يقدر ) واختاره أبو حاتم ; لأن دخول الباء في خبر ( أن ) قبيح . واختار أبو عبيد قراءة العامة ; لأنها في قراءة عبد الله ( خلق السماوات والأرض قادر ) بغير باء . والله أعلم .\n                                    ",
      "saadi": "أَوَ لَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَلَمۡ يَعۡيَ بِخَلۡقِهِنَّ بِقَٰدِرٍ عَلَىٰٓ أَن يُحۡـِۧيَ ٱلۡمَوۡتَىٰۚ بَلَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٣٣\n                                        \n                                        \n                                        \n                                        هذا استدلال منه تعالى على الإعادة بعد الموت بما هو أبلغ منها، وهو أنه الذي خلق السماوات والأرض على عظمهما وسعتهما وإتقان خلقهما من دون أن يكترث بذلك ولم يعي بخلقهن فكيف تعجزه إعادتكم بعد موتكم وهو على كل شيء قدير؟\"\n                                    "
    }
  },
  {
    "id": 33,
    "versesNumber": 34,
    "souraName": "Al-Ahqaf.html",
    "contnent": "وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَلَيۡسَ هَٰذَا بِٱلۡحَقِّۖ قَالُواْ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ ٤٣",
    "tafsier": {
      "ibnkther": "وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَلَيۡسَ هَٰذَا بِٱلۡحَقِّۖ قَالُواْ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ ٤٣\n                                    \n                                    \n                                    ثم قال متهددا ومتوعدا لمن كفر به : ( ويوم يعرض الذين كفروا على النار أليس هذا بالحق ) أي : يقال لهم : أما هذا حق ؟ أفسحر هذا ؟ أم أنتم لا تبصرون ؟ ( قالوا بلى وربنا ) أي : لا يسعهم إلا الاعتراف ، ( قال فذوقوا العذاب بما كنتم تكفرون ) ثم قال تعالى آمرا رسوله - صلى الله عليه وسلم - بالصبر على تكذيب من كذبه من قومه\n                                    ",
      "qortoby": "وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَلَيۡسَ هَٰذَا بِٱلۡحَقِّۖ قَالُواْ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ ٤٣\n                                    \n                                    \n                                    قوله تعالى : ويوم يعرض الذين كفروا على النار أي ذكرهم يوم يعرضون فيقال لهم : أليس هذا بالحق قالوا بلى وربنا فيقول لهم المقرر : فذوقوا العذاب بما كنتم تكفرون بكفركم .\n                                    ",
      "saadi": "وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَلَيۡسَ هَٰذَا بِٱلۡحَقِّۖ قَالُواْ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُواْ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ ٤٣\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن حال الكفار الفظيعة عند عرضهم على النار التي كانوا يكذبون بها وأنهم يوبخون ويقال لهم: { أَلَيْسَ هَذَا بِالْحَقِّ } فقد حضرتموه وشاهدتموه عيانا؟ { قَالُوا بَلَى وَرَبِّنَا } فاعترفوا بذنبهم وتبين كذبهم { قَالَ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ } أي: عذابا لازما دائما كما كان كفركم صفة لازمة.\n                                    "
    }
  },
  {
    "id": 34,
    "versesNumber": 35,
    "souraName": "Al-Ahqaf.html",
    "contnent": "فَٱصۡبِرۡ كَمَا صَبَرَ أُوْلُواْ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَ مَا يُوعَدُونَ لَمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّن نَّهَارِۢۚ بَلَٰغٞۚ فَهَلۡ يُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَٰسِقُونَ ٥٣",
    "tafsier": {
      "ibnkther": "فَٱصۡبِرۡ كَمَا صَبَرَ أُوْلُواْ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَ مَا يُوعَدُونَ لَمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّن نَّهَارِۢۚ بَلَٰغٞۚ فَهَلۡ يُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَٰسِقُونَ ٥٣\n                                    \n                                    \n                                    ( فاصبر كما صبر أولو العزم من الرسل ) أي : على تكذيب قومهم لهم . وقد اختلفوا في تعداد أولي العزم على أقوال ، وأشهرها أنهم : نوح ، وإبراهيم ، وموسى ، وعيسى ، وخاتم الأنبياء كلهم محمد - صلى الله عليه وسلم - قد نص الله على أسمائهم من بين الأنبياء في آيتين من سورتي \" الأحزاب \" و \" الشورى \" ، وقد يحتمل أن يكون المراد بأولي العزم جميع الرسل ، وتكون ) من ) في قوله : ( من الرسل ) لبيان الجنس ، والله أعلم . وقد قال ابن أبي حاتم :\nحدثنا محمد بن الحجاج الحضرمي ، حدثنا السري بن حيان ، حدثنا عباد بن عباد ، حدثنا مجالد بن سعيد ، عن الشعبي ، عن مسروق قال : قالت لي عائشة [ رضي الله عنها ] : ظل رسول الله - صلى الله عليه وسلم - صائما ثم طواه ، ثم ظل صائما ثم طواه ، ثم ظل صائما ، [ ثم ] قال : \" يا عائشة ، إن الدنيا لا تنبغي لمحمد ولا لآل محمد . يا عائشة ، إن الله لم يرض من أولي العزم من الرسل إلا بالصبر على مكروهها والصبر عن محبوبها ، ثم لم يرض مني إلا أن يكلفني ما كلفهم ، فقال : ( فاصبر كما صبر أولو العزم من الرسل ) وإني - والله - لأصبرن كما صبروا جهدي ، ولا قوة إلا بالله \"\n( ولا تستعجل لهم ) أي : لا تستعجل لهم حلول العقوبة بهم ، كقوله : ( وذرني والمكذبين أولي النعمة ومهلهم قليلا ) [ المزمل : 11 ] ، وكقوله ( فمهل الكافرين أمهلهم رويدا ) [ الطارق : 17 ] .\n( كأنهم يوم يرون ما يوعدون لم يلبثوا إلا ساعة من نهار ) ، كقوله ( كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها ) [ النازعات : 46 ] ، وكقوله ( ويوم يحشرهم كأن لم يلبثوا إلا ساعة من النهار يتعارفون بينهم قد خسر الذين كذبوا بلقاء الله وما كانوا مهتدين ) [ يونس : 45 ] ، [ وحاصل ذلك أنهم استقصروا مدة لبثهم في الدنيا وفي البرزخ حين عاينوا يوم القيامة وشدائدها وطولها ] .\nوقوله : ( بلاغ ) قال ابن جرير : يحتمل معنيين ، أحدهما : أن يكون تقديره : وذلك لبث بلاغ . والآخر : أن يكون تقديره : هذا القرآن بلاغ .\nوقوله : ( فهل يهلك إلا القوم الفاسقون ) أي : لا يهلك على الله إلا هالك ، وهذا من عدله تعالى أنه لا يعذب إلا من يستحق العذاب .\nآخر تفسير سورة الأحقاف .\n                                    ",
      "qortoby": "فَٱصۡبِرۡ كَمَا صَبَرَ أُوْلُواْ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَ مَا يُوعَدُونَ لَمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّن نَّهَارِۢۚ بَلَٰغٞۚ فَهَلۡ يُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَٰسِقُونَ ٥٣\n                                    \n                                    \n                                    قوله تعالى : فاصبر كما صبر أولو العزم من الرسل ولا تستعجل لهم كأنهم يوم يرون ما يوعدون لم يلبثوا إلا ساعة من نهار بلاغ فهل يهلك إلا القوم الفاسقون .\nقوله تعالى : فاصبر كما صبر أولو العزم من الرسل وقال ابن عباس : ذوو الحزم والصبر ، قال مجاهد : هم خمسة : نوح ، وإبراهيم ، وموسى ، وعيسى ، ومحمد عليهم الصلاة والسلام . وهم أصحاب الشرائع . وقال أبو العالية : إن أولي العزم : نوح ، وهود ، وإبراهيم . فأمر الله - عز وجل - نبيه عليه الصلاة والسلام أن يكون رابعهم . وقال السدي : هم ستة : إبراهيم ، وموسى ، وداود ، وسليمان ، وعيسى ، ومحمد ، صلوات الله عليهم أجمعين . وقيل : نوح ، وهود ، وصالح ، وشعيب ، ولوط ، وموسى ، وهم المذكورون على النسق في سورتي ( الأعراف والشعراء ) وقال مقاتل : هم ستة : نوح صبر على أذى قومه مدة . وإبراهيم صبر على النار . وإسحاق صبر على الذبح . ويعقوب صبر على فقد الولد وذهاب البصر . ويوسف صبر على البئر والسجن . وأيوب صبر على الضر . وقال ابن جريج : إن منهم إسماعيل ويعقوب وأيوب ، وليس منهم يونس ولا سليمان ولا آدم . وقال الشعبي والكلبي ومجاهد أيضا : هم الذين أمروا بالقتال فأظهروا المكاشفة وجاهدوا الكفرة . وقيل : هم نجباء الرسل المذكورون في سورة ( الأنعام ) وهم ثمانية عشر : إبراهيم ، وإسحاق ، ويعقوب ، ونوح ، وداود ، وسليمان ، وأيوب ، ويوسف ، وموسى ، وهارون ، وزكرياء ، ويحيى ، وعيسى ، وإلياس ، وإسماعيل ، واليسع ، ويونس ، ولوط . واختاره الحسن بن الفضل لقوله في عقبه : أولئك الذين هدى الله فبهداهم اقتده وقال ابن عباس أيضا : كل الرسل كانوا أولي عزم . واختاره علي بن مهدي الطبري ، قال : وإنما دخلت من للتجنيس لا للتبعيض ، كما تقول : اشتريت أردية من البز وأكسية من الخز . أي : اصبر كما صبر الرسل . وقيل : كل الأنبياء أولو عزم إلا يونس بن متى ، ألا ترى أن النبي - صلى الله عليه وسلم - نهى أن يكون مثله ، لخفة وعجلة ظهرت منه حين ولى مغاضبا لقومه ، فابتلاه الله بثلاث : سلط عليه العمالقة حتى أغاروا على أهله وماله ، وسلط الذئب على ولده فأكله ، وسلط عليه الحوت فابتلعه ، قال أبو القاسم الحكيم . وقال بعض العلماء : أولو العزم اثنا عشر نبيا أرسلوا إلى بني إسرائيل بالشام فعصوهم ، فأوحى الله إلى الأنبياء أني مرسل عذابي إلى عصاة بني إسرائيل ، فشق ذلك على المرسلين فأوحى الله إليهم اختاروا لأنفسكم ، إن شئتم أنزلت بكم العذاب وأنجيت بني إسرائيل ، وإن شئتم نجيتكم وأنزلت العذاب ببني إسرائيل ، فتشاوروا بينهم فاجتمع رأيهم على أن ينزل بهم العذاب وينجي الله بني إسرائيل ، فأنجى الله بني إسرائيل وأنزل بأولئك العذاب . وذلك أنه سلط عليهم ملوك الأرض ، فمنهم من نشر بالمناشير ، ومنهم من سلخ جلدة رأسه ووجهه ، ومنهم من صلب على الخشب حتى مات ، ومنهم من حرق بالنار . والله أعلم .\nوقال الحسن : أولو العزم أربعة : إبراهيم ، وموسى ، وداود ، وعيسى ، فأما إبراهيم فقيل له : أسلم قال أسلمت لرب العالمين ثم ابتلي في ماله وولده ووطنه ونفسه ، فوجد صادقا وافيا في جميع ما ابتلي به . وأما موسى فعزمه حين قال له قومه : إنا لمدركون . قال كلا إن معي ربي سيهدين وأما داود فأخطأ خطيئته فنبه عليها ، فأقام يبكي أربعين سنة حتى نبتت من دموعه شجرة ، فقعد تحت ظلها . وأما عيسى فعزمه أنه لم يضع لبنة على لبنة وقال : ( إنها معبرة فاعبروها ولا تعمروها ) فكأن الله تعالى يقول لرسوله - صلى الله عليه وسلم - : اصبر ، أي : كن صادقا فيما ابتليت به مثل صدق إبراهيم ، واثقا بنصرة مولاك مثل ثقة موسى ، مهتما بما سلف من هفواتك مثل اهتمام داود ، زاهدا في الدنيا مثل زهد عيسى . ثم قيل هي : منسوخة بآية السيف . وقيل : محكمة ، والأظهر أنها منسوخة ; لأن السورة مكية . وذكر مقاتل : أن هذه الآية نزلت على رسول الله - صلى الله عليه وسلم - يوم أحد ، فأمره الله - عز وجل - أن يصبر على ما أصابه كما صبر أولو العزم من الرسل ، تسهيلا عليه وتثبيتا له . والله أعلم .\nولا تستعجل لهم قال مقاتل : بالدعاء عليهم . وقيل : في إحلال العذاب بهم ، فإن أبعد غاياتهم يوم القيامة . ومفعول الاستعجال محذوف ، وهو العذاب . كأنهم يوم يرون ما يوعدون قال يحيى : من العذاب . النقاش : من الآخرة . لم يلبثوا أي في الدنيا حتى جاءهم العذاب ، وهو مقتضى قول يحيى . وقال النقاش : في قبورهم حتى بعثوا للحساب . إلا ساعة من نهار يعني في جنب يوم القيامة . وقيل : نساهم هول ما عاينوا من العذاب طول لبثهم في الدنيا . بلاغ أي هذا القرآن بلاغ ، قاله الحسن . فبلاغ رفع على إضمار مبتدإ ، دليله قوله تعالى : هذا بلاغ للناس ولينذروا به وقوله : إن في هذا لبلاغا لقوم عابدين . والبلاغ بمعنى التبليغ . وقيل : أي : إن ذلك اللبث بلاغ ، قاله ابن عيسى ، فيوقف على هذا على بلاغ وعلى نهار وذكر أبو حاتم أن بعضهم وقف على ولا تستعجل ثم ابتدأ لهم على معنى لهم بلاغ . قال ابن الأنباري : وهذا خطأ ، لأنك قد فصلت بين البلاغ وبين اللام ، - وهي رافعة - بشيء ليس منهما . ويجوز في العربية : بلاغا وبلاغ ، النصب على معنى إلا ساعة بلاغا ، على المصدر أو على النعت للساعة . والخفض على معنى من نهار بلاغ . وبالنصب قرأ عيسى بن عمر والحسن . وروي عن بعض القراء ( بلغ ) على الأمر ، فعلى هذه القراءة يكون الوقف على من نهار ثم يبتدئ ( بلغ )\nفهل يهلك إلا القوم الفاسقون أي الخارجون عن أمر الله ، قاله ابن عباس وغيره . وقرأ ابن محيصن ( فهل يهلك إلا القوم ) على إسناد الفعل إلى القوم . وقال ابن عباس : إذا عسر على المرأة ولدها تكتب هاتين الآيتين والكلمتين في صحيفة ثم تغسل وتسقى منها ، وهي : بسم الله الرحمن الرحيم لا إله إلا الله العظيم الحليم الكريم ، سبحان الله رب السماوات ورب الأرض ورب العرش العظيم كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها . كأنهم يوم يرون ما يوعدون لم يلبثوا إلا ساعة من نهار بلاغ فهل يهلك إلا القوم الفاسقون صدق الله العظيم . وعن قتادة : لا يهلك الله إلا هالكا مشركا . وقيل : هذه أقوى آية في الرجاء . والله أعلم .\n                                    ",
      "saadi": "فَٱصۡبِرۡ كَمَا صَبَرَ أُوْلُواْ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ يَوۡمَ يَرَوۡنَ مَا يُوعَدُونَ لَمۡ يَلۡبَثُوٓاْ إِلَّا سَاعَةٗ مِّن نَّهَارِۢۚ بَلَٰغٞۚ فَهَلۡ يُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَٰسِقُونَ ٥٣\n                                        \n                                        \n                                        \n                                        ثم أمر تعالى رسوله أن يصبر على أذية المكذبين المعادين له وأن لا يزال داعيا لهم إلى الله وأن يقتدي بصبر أولي العزم من المرسلين سادات الخلق أولي العزائم والهمم العالية الذين عظم صبرهم، وتم يقينهم، فهم أحق الخلق بالأسوة بهم والقفو لآثارهم والاهتداء بمنارهم.\nفامتثل صلى الله عليه وسلم لأمر ربه فصبر صبرا لم يصبره نبي قبله حتى رماه المعادون له عن قوس واحدة، وقاموا جميعا بصده عن الدعوة إلى الله وفعلوا ما يمكنهم من المعاداة والمحاربة، وهو صلى الله عليه وسلم لم يزل صادعا بأمر الله مقيما على جهاد أعداء الله صابرا على ما يناله من الأذى، حتى مكن الله له في الأرض وأظهر دينه على سائر الأديان وأمته على الأمم، فصلى الله عليه وسلم تسليما.\nوقوله: { وَلَا تَسْتَعْجِلْ لَهُمْ } أي: لهؤلاء المكذبين المستعجلين للعذاب فإن هذا من جهلهم وحمقهم فلا يستخفنك بجهلهم ولا يحملك ما ترى من استعجالهم على أن تدعو الله عليهم بذلك فإن كل ما هو آت قريب، و { كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا } في الدنيا { إِلَّا سَاعَةً مِنْ نَهَارٍ } فلا يحزنك تمتعهم القليل وهم صائرون إلى العذاب الوبيل.\n{ بَلَاغٌ } أي: هذه الدنيا متاعها وشهوتها ولذاتها بلغة منغصة ودفع وقت حاضر قليل.\nأو هذا القرآن العظيم الذي بينا لكم فيه البيان التام بلاغ لكم، وزاد إلى الدار الآخرة، ونعم الزاد والبلغة زاد يوصل إلى دار النعيم ويعصم من العذاب الأليم، فهو أفضل زاد يتزوده الخلائق وأجل نعمة أنعم الله بها عليهم.\n{ فَهَلْ يُهْلَكُ } بالعقوبات { إِلَّا الْقَوْمُ الْفَاسِقُونَ } أي: الذين لا خير فيهم وقد خرجوا عن طاعة ربهم ولم يقبلوا الحق الذي جاءتهم به الرسل.\nوأعذر الله لهم وأنذرهم فبعد ذلك إذ يستمرون على تكذيبهم وكفرهم نسأل\nالله العصمة.\nآخر تفسير سورة الأحقاف، والحمد لله رب العالمين\n                                    "
    }
  }
]