[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Al-Fath.html",
    "contnent": "إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا ١",
    "tafsier": {
      "ibnkther": "إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا ١\n                                    \n                                    \n                                    تفسير سورة الفتح وهي مكية تفسير سورة الفتح وهي مكية .\nقال الإمام أحمد حدثنا وكيع ، حدثنا شعبة ، عن معاوية بن قرة قال : سمعت عبد الله بن مغفل يقول : قرأ رسول الله - صلى الله عليه وسلم - عام الفتح في مسيره سورة الفتح على راحلته فرجع فيها - قال معاوية : لولا أني أكره أن يجتمع الناس علينا لحكيت لكم قراءته ، أخرجاه من حديث شعبة به .\nبسم الله الرحمن الرحيم ( إنا فتحنا لك فتحا مبينا ( 1 ) ليغفر لك الله ما تقدم من ذنبك وما تأخر ويتم نعمته عليك ويهديك صراطا مستقيما ( 2 ) وينصرك الله نصرا عزيزا ( 3 ) ) .\nنزلت هذه السورة الكريمة لما رجع رسول الله - صلى الله عليه وسلم - من الحديبية في ذي القعدة من سنة ست من الهجرة ، حين صده المشركون عن الوصول إلى المسجد الحرام ليقضي عمرته فيه ، وحالوا بينه وبين ذلك ، ثم مالوا إلى المصالحة والمهادنة ، وأن يرجع عامه هذا ثم يأتي من قابل ، فأجابهم إلى ذلك على تكره من جماعة من الصحابة ، منهم عمر بن الخطاب - رضي الله عنه - كما سيأتي تفصيله في موضعه من تفسير هذه السورة إن شاء الله . فلما نحر هديه حيث أحصر ، ورجع ، أنزل الله عز وجل ، هذه السورة فيما كان من أمره وأمرهم ، وجعل ذلك الصلح فتحا باعتبار ما فيه من المصلحة ، وما آل الأمر إليه ، كما روي عن ابن مسعود - رضي الله عنه - وغيره أنه قال : إنكم تعدون الفتح فتح مكة ، ونحن نعد الفتح صلح الحديبية .\nوقال الأعمش ، عن أبي سفيان ، عن جابر قال : ما كنا نعد الفتح إلا يوم الحديبية .\nوقال البخاري : حدثنا عبيد الله بن موسى ، عن إسرائيل ، عن أبي إسحاق ، عن البراء قال : تعدون أنتم الفتح فتح مكة ، وقد كان فتح مكة فتحا ، ونحن نعد الفتح بيعة الرضوان يوم الحديبية ، كنا مع رسول الله - صلى الله عليه وسلم - أربع عشرة مائة ، والحديبية بئر . فنزحناها فلم نترك فيها قطرة ، فبلغ ذلك رسول الله - صلى الله عليه وسلم - فأتاها فجلس على شفيرها ، ثم دعا بإناء من ماء فتوضأ ، ثم تمضمض ودعا ، ثم صبه فيها ، فتركناها غير بعيد ، ثم إنها أصدرتنا ما شئنا نحن وركائبنا .\nوقال الإمام أحمد : حدثنا أبو نوح ، حدثنا مالك بن أنس ، عن زيد بن أسلم ، عن أبيه ، عن عمر بن الخطاب قال : كنا مع رسول الله - صلى الله عليه وسلم - في سفر ، قال : فسألته عن شيء - ثلاث مرات - فلم يرد علي ، قال : فقلت لنفسي : ثكلتك أمك يابن الخطاب ، نزرت رسول الله - صلى الله عليه وسلم - ثلاث مرات فلم يرد عليك ؟ قال : فركبت راحلتي فتقدمت مخافة أن يكون نزل في شيء ، قال : فإذا أنا بمناد ينادي : يا عمر ، أين عمر ؟ قال : فرجعت وأنا أظن أنه نزل في شيء ، قال : فقال النبي - صلى الله عليه وسلم - : \" نزلت علي الليلة سورة هي أحب إلي من الدنيا وما فيها : ( إنا فتحنا لك فتحا مبينا . ليغفر لك الله ما تقدم من ذنبك وما تأخر ) .\nورواه البخاري ، والترمذي ، والنسائي من طرق ، عن مالك ، رحمه الله ، وقال علي بن المديني : هذا إسناد مديني [ جيد ] لم نجده إلا عندهم .\nوقال الإمام أحمد : حدثنا عبد الرزاق ، أخبرنا معمر ، عن قتادة ، عن أنس بن مالك - رضي الله عنه - قال : نزلت على النبي - صلى الله عليه وسلم - : ( ليغفر لك الله ما تقدم من ذنبك وما تأخر ) مرجعه من الحديبية ، قال النبي - صلى الله عليه وسلم - : \" لقد أنزلت علي آية أحب إلي مما على الأرض \" ، ثم قرأها عليهم النبي - صلى الله عليه وسلم - فقالوا : هنيئا مريئا يا نبي الله ، لقد بين الله - عز وجل - ماذا يفعل بك ، فماذا يفعل بنا ؟ فنزلت عليه : ( ليدخل المؤمنين والمؤمنات جنات ) حتى بلغ : ( فوزا عظيما ) [ الفتح : 5 ] ، أخرجاه في الصحيحين من رواية قتادة به .\nوقال الإمام أحمد : حدثنا إسحاق بن عيسى ، حدثنا مجمع بن يعقوب ، قال : سمعت أبي يحدث عن عمه عبد الرحمن بن أبي يزيد الأنصاري عن عمه مجمع بن جارية الأنصاري - وكان أحد القراء الذين قرءوا القرآن - قال : شهدنا الحديبية فلما انصرفنا عنها إذا الناس ينفرون الأباعر ، فقال الناس بعضهم لبعض : ما للناس ؟ قالوا : أوحي إلى رسول الله - صلى الله عليه وسلم - فخرجنا مع الناس نوجف ، فإذا رسول الله - صلى الله عليه وسلم - على راحلته عند كراع الغميم ، فاجتمع الناس عليه ، فقرأ عليهم : ( إنا فتحنا لك فتحا مبينا ) ، قال : فقال رجل من أصحاب رسول الله - صلى الله عليه وسلم - : أي رسول الله ، وفتح هو ؟ قال : \" إي والذي نفس محمد بيده ، إنه لفتح \" . فقسمت خيبر على أهل الحديبية لم يدخل معهم فيها أحد إلا من شهد الحديبية ، فقسمها رسول الله - صلى الله عليه وسلم - على ثمانية عشر سهما ، وكان الجيش ألفا وخمسمائة فارس ، فأعطى الفارس سهمين ، وأعطى الراجل سهما .\nرواه أبو داود في الجهاد عن محمد بن عيسى ، عن مجمع بن يعقوب ، به .\nوقال ابن جرير : حدثنا محمد بن عبد الله بن بزيع ، حدثنا أبو بحر ، حدثنا شعبة ، حدثنا جامع بن شداد ، عن عبد الرحمن بن أبي علقمة ، قال : سمعت عبد الله بن مسعود يقول : لما أقبلنا من الحديبية أعرسنا فنمنا ، فلم نستيقظ إلا بالشمس قد طلعت ، فاستيقظنا ورسول الله - صلى الله عليه وسلم - نائم ، قال : فقلنا : \" امضوا \" . فاستيقظ رسول الله - صلى الله عليه وسلم - : فقال : \" افعلوا ما كنتم تفعلون وكذلك [ يفعل ] من نام أو نسي \" . قال : وفقدنا ناقة رسول الله - صلى الله عليه وسلم - فطلبناها ، فوجدناها قد تعلق خطامها بشجرة ، فأتيته بها فركبها ، فبينا نحن نسير إذ أتاه الوحي ، قال : وكان إذا أتاه [ الوحي ] اشتد عليه ، فلما سري عنه أخبرنا أنه أنزل عليه : ( إنا فتحنا لك فتحا مبينا ) .\nوقد رواه أحمد وأبو داود ، والنسائي من غير وجه ، عن جامع بن شداد به .\nوقال الإمام أحمد : حدثنا عبد الرحمن ، حدثنا سفيان عن زياد بن علاقة ، قال : سمعت المغيرة بن شعبة يقول : كان النبي - صلى الله عليه وسلم - يصلي حتى ترم قدماه ، فقيل له : أليس قد غفر الله لك ما تقدم من ذنبك وما تأخر ؟ فقال : \" أفلا أكون عبدا شكورا \" .\nأخرجاه وبقية الجماعة إلا أبا داود من حديث زياد به .\nوقال الإمام أحمد : حدثنا هارون بن معروف ، حدثنا ابن وهب ، حدثني أبو صخر ، عن ابن قسيط ، عن عروة بن الزبير ، عن عائشة ، قالت : كان رسول الله - صلى الله عليه وسلم - إذا صلى قام حتى تتفطر رجلاه .\nفقالت له عائشة : يا رسول الله ، أتصنع هذا وقد غفر لك الله ما تقدم من ذنبك وما تأخر ؟ فقال : \" يا عائشة ، أفلا أكون عبدا شكورا ؟ \" .\nأخرجه مسلم في الصحيح من رواية عبد الله بن وهب ، به .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا عبد الله بن عون الخراز - وكان ثقة بمكة - حدثنا محمد بن بشر حدثنا مسعر ، عن قتادة ، عن أنس ، قال : قام رسول الله - صلى الله عليه وسلم - حتى تورمت قدماه - أو قال ساقاه - فقيل له : أليس قد غفر الله لك ما تقدم من ذنبك وما تأخر ؟ قال : \" أفلا أكون عبدا شكورا ؟ \" غريب من هذا الوجه .\nفقوله : ( إنا فتحنا لك فتحا مبينا ) أي : بينا ظاهرا ، والمراد به صلح الحديبية فإنه حصل بسببه خير جزيل ، وآمن الناس واجتمع بعضهم ببعض ، وتكلم المؤمن مع الكافر ، وانتشر العلم النافع والإيمان .\n                                    ",
      "qortoby": "إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا ١\n                                    \n                                    \n                                    سورة الفتح .\nمدنية بإجماع ، وهي تسع وعشرون آية . ونزلت ليلا بين مكة والمدينة في شأن الحديبية . روى محمد بن إسحاق عن الزهري عن عروة عن المسور بن مخرمة ومروان بن الحكم ، قالا : نزلت سورة الفتح بين مكة والمدينة في شأن الحديبية من أولها إلى آخرها . وفي الصحيحين عن زيد بن أسلم عن أبيه أن رسول الله - صلى الله عليه وسلم - كان يسير في بعض أسفاره وعمر بن الخطاب يسير معه ليلا فسأله عمر عن شيء فلم يجبه رسول الله - صلى الله عليه وسلم - ، ثم سأله فلم يجبه ، ثم سأله فلم يجبه ، فقال عمر بن الخطاب : ثكلت أم عمر ، نزرت رسول الله - صلى الله عليه وسلم - ثلاث مرات كل ذلك لم يجبك ، فقال عمر : فحركت بعيري ثم تقدمت أمام الناس وخشيت أن ينزل في قرآن ، فما نشبت أن سمعت صارخا يصرخ بي ، فقلت : لقد خشيت أن يكون نزل في قرآن ، فجئت رسول الله - صلى الله عليه وسلم - فسلمت عليه ، فقال : لقد أنزلت علي الليلة سورة لهي أحب إلي مما طلعت عليه الشمس - ثم قرأ - إنا فتحنا لك فتحا مبينا لفظ البخاري . وقال الترمذي : حديث حسن غريب صحيح . وفي صحيح مسلم عن قتادة أن أنس بن مالك حدثهم قال : لما نزلت : إنا فتحنا لك فتحا مبينا ليغفر لك الله ما تقدم من ذنبك وما تأخر ويتم نعمته عليك ويهديك صراطا مستقيما - إلى قوله - فوزا عظيما مرجعه من الحديبية وهم يخالطهم الحزن والكآبة ، وقد نحر الهدي بالحديبية ، فقال : لقد أنزلت علي آية هي أحب إلي من الدنيا جميعا . وقال عطاء عن ابن عباس : إن اليهود شتموا النبي - صلى الله عليه وسلم - والمسلمين لما نزل قوله تعالى : وما أدري ما يفعل بي ولا بكم قالوا : كيف نتبع رجلا لا يدري ما يفعل به فاشتد ذلك على النبي - صلى الله عليه وسلم - فأنزل الله تعالى : إنا فتحنا لك فتحا مبينا ليغفر لك الله ما تقدم من ذنبك وما تأخر ونحوه قال مقاتل بن سليمان : لما نزل قوله تعالى : وما أدري ما يفعل بي ولا بكم فرح المشركون والمنافقون وقالوا : كيف نتبع رجلا لا يدري ما يفعل به ولا بأصحابه ، فنزلت بعدما رجع من الحديبية : إنا فتحنا لك فتحا مبينا أي : قضينا لك قضاء . فنسخت هذه الآية تلك . فقال النبي - صلى الله عليه وسلم - : [ لقد أنزلت علي سورة ما يسرني بها حمر النعم ] . وقال المسعودي : بلغني أنه من قرأ سورة الفتح في أول ليلة من رمضان في صلاة التطوع حفظه الله ذلك العام .\nبسم الله الرحمن الرحيم .\nقوله تعالى : إنا فتحنا لك فتحا مبينا .\nاختلف في هذا الفتح ما هو ؟ ففي البخاري حدثني محمد بن بشار قال حدثنا غندر قال حدثنا شعبة قال سمعت قتادة عن أنس إنا فتحنا لك فتحا مبينا قال : الحديبية . وقال جابر : ما كنا نعد فتح مكة إلا يوم الحديبية . وقال الفراء : تعدون أنتم الفتح فتح مكة وقد كان فتح مكة فتحا ونحن نعد الفتح بيعة الرضوان يوم الحديبية ، كنا نعد مع النبي - صلى الله عليه وسلم - أربع عشرة مائة ، والحديبية بئر . وقال الضحاك : إنا فتحنا لك فتحا مبينا بغير قتال . وكان الصلح من الفتح . وقال مجاهد : هو منحره بالحديبية وحلقه رأسه . وقال : كان فتح الحديبية آية عظيمة ، نزح ماؤها فمج فيها فدرت بالماء حتى شرب جميع من كان معه . وقال موسى بن عقبة : قال رجل عند منصرفهم من الحديبية : ما هذا بفتح ، لقد صدونا عن البيت . فقال النبي - صلى الله عليه وسلم - : [ بل هو أعظم الفتوح قد رضي المشركون أن يدفعوكم عن بلادهم بالراح ويسألوكم القضية ويرغبوا إليكم في الأمان وقد رأوا منكم ما كرهوا ] . وقال الشعبي في قوله تعالى : إنا فتحنا لك فتحا مبينا قال : هو فتح الحديبية ، لقد أصاب بها ما لم يصب في غزوة ، غفر الله له ما تقدم من ذنبه وما تأخر ، وبويع بيعة الرضوان ، وأطعموا نخل خيبر ، وبلغ الهدي محله ، وظهرت الروم على فارس ، ففرح المؤمنون بظهور أهل الكتاب على المجوس . وقال الزهري : لقد كان الحديبية أعظم الفتوح ، وذلك أن النبي - صلى الله عليه وسلم - جاء إليها في ألف وأربعمائة ، فلما وقع الصلح مشى الناس بعضهم في بعض وعلموا وسمعوا عن الله ، فما أراد أحد الإسلام إلا تمكن منه ، فما مضت تلك السنتان إلا والمسلمون قد جاءوا إلى مكة في عشرة آلاف . وقال مجاهد أيضا والعوفي : هو فتح خيبر . والأول أكثر ، وخيبر إنما كانت وعدا وعدوه ، على ما يأتي بيانه في قوله تعالى : سيقول المخلفون إذا انطلقتم وقوله : وعدكم الله مغانم كثيرة تأخذونها فعجل لكم هذه . وقال مجمع بن جارية - وكان أحد القراء الذين قرءوا القرآن - : شهدنا الحديبية مع النبي - صلى الله عليه وسلم - ، فلما انصرفنا عنها إذا الناس يهزون الأباعر ، فقال بعض الناس لبعض : ما بال الناس ؟ قالوا : أوحى الله إلى النبي - صلى الله عليه وسلم - . قال : فخرجنا نوجف فوجدنا نبي الله - صلى الله عليه وسلم - عند كراع الغميم ، فلما اجتمع الناس قرأ النبي - صلى الله عليه وسلم - إنا فتحنا لك فتحا مبينا فقال عمر بن الخطاب : أوفتح هو يا رسول الله ؟ قال : [ نعم ، والذي نفسي بيده إنه لفتح ] . فقسمت خيبر على أهل الحديبية ، لم يدخل أحد إلا من شهد الحديبية .\nوقيل : إن قوله تعالى : فتحا يدل على أن مكة فتحت عنوة ; لأن اسم الفتح لا يقع مطلقا إلا على ما فتح عنوة . هذا هو حقيقة الاسم . وقد يقال : فتح البلد صلحا ، فلا يفهم الصلح إلا بأن يقرن بالفتح ، فصار الفتح في الصلح مجازا . والأخبار دالة على أنها فتحت عنوة ، وقد مضى القول فيها ، ويأتي .\n                                    ",
      "saadi": "إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا ١\n                                        \n                                        \n                                        \n                                        هذا الفتح المذكور هو صلح الحديبية، حين صد المشركون رسول الله صلى الله عليه وسلم لما جاء معتمرا في قصة طويلة، صار آخر أمرها أن صالحهم رسول الله صلى الله عليه وسلم على وضع الحرب بينه وبينهم عشر سنين، وعلى أن يعتمر من العام المقبل، وعلى أن من أراد أن يدخل في عهد قريش وحلفهم دخل، ومن أحب أن يدخل في عهد رسول الله صلى الله عليه وسلم وعقده فعل.\nوبسبب ذلك لما أمن الناس بعضهم بعضا، اتسعت دائرة الدعوة لدين الله عز وجل، وصار كل مؤمن بأي محل كان من تلك الأقطار، يتمكن من ذلك، وأمكن الحريص على الوقوف على حقيقة الإسلام، فدخل الناس في تلك المدة في دين الله أفواجا، فلذلك سماه الله فتحا، ووصفه بأنه فتح مبين أي: ظاهر جلي، وذلك لأن المقصود في فتح بلدان المشركين إعزاز دين الله، وانتصار المسلمين، وهذا حصل بذلك الفتح.\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Al-Fath.html",
    "contnent": "لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا ٢",
    "tafsier": {
      "ibnkther": "لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا ٢\n                                    \n                                    \n                                    وقوله : ( ليغفر لك الله ما تقدم من ذنبك وما تأخر ) : هذا من خصائصه - صلوات الله وسلامه عليه - التي لا يشاركه فيها غيره . وليس صحيحا في ثواب الأعمال لغيره غفر له ما تقدم من ذنبه وما تأخر . وهذا فيه تشريف عظيم لرسول الله - صلى الله عليه وسلم - وهو - صلوات الله وسلامه عليه - في جميع أموره على الطاعة والبر والاستقامة التي لم ينلها بشر سواه ، لا من الأولين ولا من الآخرين ، وهو أكمل البشر على الإطلاق ، وسيدهم في الدنيا والآخرة . ولما كان أطوع خلق الله لله ، وأكثرهم تعظيما لأوامره ونواهيه . قال حين بركت به الناقة : \" حبسها حابس الفيل \" ثم قال : \" والذي نفسي بيده ، لا يسألوني اليوم شيئا يعظمون به حرمات الله إلا أجبتهم إليها \" فلما أطاع الله في ذلك وأجاب إلى الصلح ، قال الله له : ( إنا فتحنا لك فتحا مبينا ليغفر لك الله ما تقدم من ذنبك وما تأخر ويتم نعمته عليك ) أي : في الدنيا والآخرة ، ( ويهديك صراطا مستقيما ) أي : بما يشرعه لك من الشرع العظيم والدين القويم .\n                                    ",
      "qortoby": "لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا ٢\n                                    \n                                    \n                                    قوله تعالى : ليغفر لك الله ما تقدم من ذنبك وما تأخر ويتم نعمته عليك ويهديك صراطا مستقيما\nقال ابن الأنباري : فتحا مبينا غير تام ; لأن قوله : ليغفر لك الله ما تقدم متعلق بالفتح . كأنه قال : إنا فتحنا لك فتحا مبينا لكي يجمع الله لك مع الفتح المغفرة ، فيجمع الله لك به ما تقر به عينك في الدنيا والآخرة . وقال أبو حاتم السجستاني : هي لام القسم . وهذا خطأ ; لأن لام القسم لا تكسر ولا ينصب بها ، ولو جاز هذا لجاز : ليقوم زيد ، بتأويل ليقومن زيد . الزمخشري : فإن قلت كيف جعل فتح مكة علة للمغفرة ؟ قلت : لم يجعل علة للمغفرة ، ولكن لاجتماع ما عدد من الأمور الأربعة ، وهي : المغفرة ، وإتمام النعمة ، وهداية الصراط المستقيم ، والنصر العزيز . كأنه قال يسرنا لك فتح مكة ونصرناك على عدوك ليجمع لك عز الدارين وأعراض العاجل والآجل . ويجوز أن يكون فتح مكة من حيث إنه جهاد للعدو سببا للغفران والثواب . وفي الترمذي عن أنس قال : أنزلت على النبي - صلى الله عليه وسلم - ليغفر لك الله ما تقدم من ذنبك وما تأخر مرجعه من الحديبية ، فقال النبي - صلى الله عليه وسلم - : [ لقد أنزلت علي آية أحب إلي مما على وجه الأرض ] . ثم قرأها النبي - صلى الله عليه وسلم - عليهم ، فقالوا : هنيئا مريئا يا رسول الله ، لقد بين الله لك ماذا يفعل بك ، فماذا يفعل بنا ، فنزلت عليه : ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار - حتى بلغ - فوزا عظيما قال حديث حسن صحيح . وفيه عن مجمع بن جارية .\nواختلف أهل التأويل في معنى ليغفر لك الله ما تقدم من ذنبك وما تأخر فقيل : ما تقدم من ذنبك قبل الرسالة . وما تأخر بعدها ، قاله مجاهد . ونحوه قال الطبري وسفيان الثوري ، قال الطبري : هو راجع إلى قوله تعالى : إذا جاء نصر الله والفتح إلى قوله توابا ليغفر لك الله ما تقدم من ذنبك قبل الرسالة وما تأخر إلى وقت نزول هذه الآية . وقال سفيان الثوري : ليغفر لك الله ما تقدم من ذنبك ما عملته في الجاهلية من قبل أن يوحى إليك . وما تأخر كل شيء لم تعمله ، وقاله الواحدي . وقد مضى الكلام في جريان الصغائر على الأنبياء في سورة \" البقرة \" ، فهذا قول .\nوقيل : ما تقدم قبل الفتح . وما تأخر بعد الفتح . وقيل : ما تقدم قبل نزول هذه الآية . وما تأخر بعدها . وقال عطاء الخراساني : ما تقدم من ذنبك يعني من ذنب أبويك آدم وحواء . وما تأخر من ذنوب أمتك . وقيل : من ذنب أبيك إبراهيم . وما تأخر من ذنوب النبيين . وقيل : ما تقدم من ذنب يوم بدر . وما تأخر من ذنب يوم حنين . وذلك أن الذنب المتقدم يوم بدر ، أنه جعل يدعو ويقول : اللهم إن تهلك هذه العصابة لا تعبد في الأرض أبدا وجعل يردد هذا القول دفعات ، فأوحى الله إليه : من أين تعلم أني لو أهلكت هذه العصابة لا أعبد أبدا ، فكان هذا الذنب المتقدم . وأما الذنب المتأخر فيوم حنين ، لما انهزم الناس قال لعمه العباس ولابن عمه أبي سفيان : [ ناولاني كفا من حصباء الوادي ] فناولاه فأخذه بيده ورمى به في وجوه المشركين وقال : [ شاهت الوجوه . حم . لا ينصرون ] فانهزم القوم عن آخرهم ، فلم يبق أحد إلا امتلأت عيناه رملا وحصباء . ثم نادى في أصحابه فرجعوا فقال لهم عند رجوعهم : [ لو لم أرمهم لم ينهزموا ] فأنزل الله - عز وجل - : وما رميت إذ رميت ولكن الله رمى فكان هذا هو الذنب المتأخر . وقال أبو علي الروذباري : يقول لو كان لك ذنب قديم أو حديث لغفرناه لك .\nقوله تعالى : ويتم نعمته عليك قال ابن عباس : في الجنة . وقيل : بالنبوة والحكمة . وقيل : بفتح مكة والطائف وخيبر . وقيل : بخضوع من استكبر وطاعة من تجبر . ويهديك صراطا مستقيما أي يثبتك على الهدى إلى أن يقبضك إليه .\n                                    ",
      "saadi": "لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا ٢\n                                        \n                                        \n                                        \n                                        ورتب الله على هذا الفتح عدة أمور، فقال: { لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ }\nوذلك -والله أعلم- بسبب ما حصل بسببه من الطاعات الكثيرة، والدخول في الدين بكثرة، وبما تحمل صلى الله عليه وسلم من تلك الشروط التي لا يصبر عليها إلا أولو العزم من المرسلين، وهذا من أعظم مناقبه وكراماته صلى الله عليه وسلم، أن غفر الله له ما تقدم من ذنبه وما تأخر.\n{ وَيُتِمُّ نِعْمَتَهُ عَلَيْكَ } بإعزاز دينك، ونصرك على أعدائك، واتساع كلمتك، { وَيَهْدِيَكَ صِرَاطًا مُسْتَقِيمًا } تنال به السعادة الأبدية، والفلاح السرمدي.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Al-Fath.html",
    "contnent": "وَيَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِيزًا ٣",
    "tafsier": {
      "ibnkther": "وَيَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِيزًا ٣\n                                    \n                                    \n                                    ( وينصرك الله نصرا عزيزا ) أي : بسبب خضوعك لأمر الله يرفعك الله وينصرك على أعدائك ، كما جاء في الحديث الصحيح : \" وما زاد الله عبدا بعفو إلا عزا ، وما تواضع أحد لله إلا رفعه الله \" . وعن عمر بن الخطاب [ رضي الله عنه ] أنه قال : ما عاقبت - أي في الدنيا والآخرة - أحدا عصى الله تعالى فيك بمثل أن تطيع الله فيه .\n                                    ",
      "qortoby": "وَيَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِيزًا ٣\n                                    \n                                    \n                                    وينصرك الله نصرا عزيزا أي غالبا منيعا لا يتبعه ذل .\n                                    ",
      "saadi": "وَيَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِيزًا ٣\n                                        \n                                        \n                                        \n                                        { وَيَنْصُرَكَ اللَّهُ نَصْرًا عَزِيزًا } أي: قويا لا يتضعضع فيه الإسلام، بل يحصل الانتصار التام، وقمع الكافرين، وذلهم ونقصهم، مع توفر قوى المسلمين ونموهم، ونمو أموالهم.\nثم ذكر آثار هذا الفتح على المؤمنين فقال:s\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Al-Fath.html",
    "contnent": "هُوَ ٱلَّذِيٓ أَنزَلَ ٱلسَّكِينَةَ فِي قُلُوبِ ٱلۡمُؤۡمِنِينَ لِيَزۡدَادُوٓاْ إِيمَٰنٗا مَّعَ إِيمَٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا ٤",
    "tafsier": {
      "ibnkther": "هُوَ ٱلَّذِيٓ أَنزَلَ ٱلسَّكِينَةَ فِي قُلُوبِ ٱلۡمُؤۡمِنِينَ لِيَزۡدَادُوٓاْ إِيمَٰنٗا مَّعَ إِيمَٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا ٤\n                                    \n                                    \n                                    يقول تعالى : ( هو الذي أنزل السكينة ) أي : جعل الطمأنينة . قاله ابن عباس ، وعنه : الرحمة .\nوقال قتادة : الوقار في قلوب المؤمنين . وهم الصحابة يوم الحديبية ، الذين استجابوا لله ولرسوله وانقادوا لحكم الله ورسوله ، فلما اطمأنت قلوبهم لذلك ، واستقرت ، زادهم إيمانا مع إيمانهم .\nوقد استدل بها البخاري وغيره من الأئمة على تفاضل الإيمان في القلوب .\nثم ذكر تعالى أنه لو شاء لانتصر من الكافرين ، فقال : ( ولله جنود السماوات والأرض ) أي : ولو أرسل عليهم ملكا واحدا لأباد خضراءهم ، ولكنه تعالى شرع لعباده المؤمنين الجهاد والقتال ، لما له في ذلك من الحكمة البالغة والحجة القاطعة ، والبراهين الدامغة ; ولهذا قال : ( وكان الله عليما حكيما )\n                                    ",
      "qortoby": "هُوَ ٱلَّذِيٓ أَنزَلَ ٱلسَّكِينَةَ فِي قُلُوبِ ٱلۡمُؤۡمِنِينَ لِيَزۡدَادُوٓاْ إِيمَٰنٗا مَّعَ إِيمَٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا ٤\n                                    \n                                    \n                                    قوله تعالى : هو الذي أنزل السكينة في قلوب المؤمنين ليزدادوا إيمانا مع إيمانهم ولله جنود السماوات والأرض وكان الله عليما حكيما .\nالسكينة : السكون والطمأنينة . قال ابن عباس : كل سكينة في القرآن هي الطمأنينة إلا التي في ( البقرة ) وتقدم معنى زيادة الإيمان في آل عمران قال ابن عباس : بعث النبي - صلى الله عليه وسلم - بشهادة أن لا إله إلا الله ، فلما صدقوه فيها زادهم الصلاة ، فلما صدقوه زادهم الزكاة ، فلما صدقوه زادهم الصيام ، فلما صدقوه زادهم الحج ، ثم أكمل لهم دينهم ، فذلك قوله : ليزدادوا إيمانا مع إيمانهم أي : تصديقا بشرائع الإيمان مع تصديقهم بالإيمان . وقال الربيع بن أنس : خشية مع خشيتهم . وقال الضحاك : يقينا مع يقينهم . ولله جنود السماوات والأرض قال ابن عباس : يريد الملائكة والجن والشياطين والإنس وكان الله عليما بأحوال خلقه حكيما فيما يريده .\n                                    ",
      "saadi": "هُوَ ٱلَّذِيٓ أَنزَلَ ٱلسَّكِينَةَ فِي قُلُوبِ ٱلۡمُؤۡمِنِينَ لِيَزۡدَادُوٓاْ إِيمَٰنٗا مَّعَ إِيمَٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا ٤\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن منته على المؤمنين بإنزال السكينة في قلوبهم، وهي السكون والطمأنينة، والثبات عند نزول المحن المقلقة، والأمور الصعبة، التي تشوش القلوب، وتزعج الألباب، وتضعف النفوس، فمن نعمة الله على عبده في هذه الحال أن يثبته ويربط على قلبه، وينزل عليه السكينة، ليتلقى هذه المشقات بقلب ثابت ونفس مطمئنة، فيستعد بذلك لإقامة أمر الله في هذه الحال، فيزداد بذلك إيمانه، ويتم إيقانه، فالصحابة رضي الله عنهم لما جرى ما جرى بين رسول الله صلى الله عليه وسلم والمشركين، من تلك الشروط التي ظاهرها أنها غضاضة عليهم، وحط من أقدارهم، وتلك لا تكاد تصبر عليها النفوس، فلما صبروا عليها ووطنوا أنفسهم لها، ازدادوا بذلك إيمانا مع إيمانهم. وقوله: { وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ } أي: جميعها في ملكه، وتحت تدبيره وقهره، فلا يظن المشركون أن الله لا ينصر دينه ونبيه، ولكنه تعالى عليم حكيم، فتقتضي حكمته المداولة بين الناس في الأيام، وتأخير نصر المؤمنين إلى وقت آخر.\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Al-Fath.html",
    "contnent": "لِّيُدۡخِلَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَيُكَفِّرَ عَنۡهُمۡ سَيِّ‍َٔاتِهِمۡۚ وَكَانَ ذَٰلِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِيمٗا ٥",
    "tafsier": {
      "ibnkther": "لِّيُدۡخِلَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَيُكَفِّرَ عَنۡهُمۡ سَيِّ‍َٔاتِهِمۡۚ وَكَانَ ذَٰلِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِيمٗا ٥\n                                    \n                                    \n                                    ثم قال تعالى : ( ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ) ، قد تقدم حديث أنس : قالوا : هنيئا لك يا رسول الله ، هذا لك فما لنا ؟ فأنزل الله : ( ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ) أي : ماكثين فيها أبدا . ( ويكفر عنهم سيئاتهم ) أي : خطاياهم وذنوبهم ، فلا يعاقبهم عليها ، بل يعفو ويصفح ويغفر ، ويستر ويرحم ويشكر ، ( وكان ذلك عند الله فوزا عظيما ) ، كقوله ( فمن زحزح عن النار وأدخل الجنة فقد فاز وما الحياة الدنيا إلا متاع الغرور ) [ آل عمران : 185 ] .\n                                    ",
      "qortoby": "لِّيُدۡخِلَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَيُكَفِّرَ عَنۡهُمۡ سَيِّ‍َٔاتِهِمۡۚ وَكَانَ ذَٰلِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِيمٗا ٥\n                                    \n                                    \n                                    قوله تعالى : ليدخل المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ويكفر عنهم سيئاتهم وكان ذلك عند الله فوزا عظيما .\nأي أنزل السكينة ليزدادوا إيمانا . ثم تلك الزيادة بسبب إدخالهم الجنة . وقيل : اللام في \" ليدخل \" يتعلق بما يتعلق به اللام في قوله : ليغفر لك الله وقيل : لما قرأ النبي - صلى الله عليه وسلم - على أصحابه ليغفر لك الله ما تقدم من ذنبك وما تأخر قالوا : هنيئا لك يا رسول الله ، فماذا لنا ؟ فنزل : ليدخل المؤمنين والمؤمنات جنات ولما قرأ ويتم نعمته عليك قالوا : هنيئا لك ، فنزلت : وأتممت عليكم نعمتي فلما قرأ ويهديك صراطا مستقيما نزل في حق الأمة : ويهديكم صراطا مستقيما . ولما قال : وينصرك الله نصرا عزيزا نزل : وكان حقا علينا نصر المؤمنين . وهو كقوله تعالى : إن الله وملائكته يصلون على النبي يا أيها الذين آمنوا صلوا عليه وسلموا تسليما . ثم قال : هو الذي يصلي عليكم ذكره القشيري .\n                                    ",
      "saadi": "لِّيُدۡخِلَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا وَيُكَفِّرَ عَنۡهُمۡ سَيِّ‍َٔاتِهِمۡۚ وَكَانَ ذَٰلِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِيمٗا ٥\n                                        \n                                        \n                                        \n                                        { لِيُدْخِلَ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَيُكَفِّرَ عَنْهُمْ سَيِّئَاتِهِمْ } فهذا أعظم ما يحصل للمؤمنين، أن يحصل لهم المرغوب المطلوب بدخول الجنات، ويزيل عنهم المحذور بتكفير السيئات. { وَكَانَ ذَلِكَ } الجزاء المذكور للمؤمنين { عِنْدَ اللَّهِ فَوْزًا عَظِيمًا } فهذا ما يفعل بالمؤمنين في ذلك الفتح المبين.\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Al-Fath.html",
    "contnent": "وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡمُشۡرِكِينَ وَٱلۡمُشۡرِكَٰتِ ٱلظَّآنِّينَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَيۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرٗا ٦",
    "tafsier": {
      "ibnkther": "وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡمُشۡرِكِينَ وَٱلۡمُشۡرِكَٰتِ ٱلظَّآنِّينَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَيۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرٗا ٦\n                                    \n                                    \n                                    وقوله : ( ويعذب المنافقين والمنافقات والمشركين والمشركات الظانين بالله ظن السوء ) أي : يتهمون الله في حكمه ، ويظنون بالرسول وأصحابه أن يقتلوا ويذهبوا بالكلية ; ولهذا قال : ( عليهم دائرة السوء وغضب الله عليهم ولعنهم ) أي : أبعدهم من رحمته ( وأعد لهم جهنم وساءت مصيرا ) .\n                                    ",
      "qortoby": "وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡمُشۡرِكِينَ وَٱلۡمُشۡرِكَٰتِ ٱلظَّآنِّينَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَيۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرٗا ٦\n                                    \n                                    \n                                    قوله تعالى : ويعذب المنافقين والمنافقات والمشركين والمشركات الظانين بالله ظن السوء عليهم دائرة السوء وغضب الله عليهم ولعنهم وأعد لهم جهنم وساءت مصيرا\nقوله تعالى : ويعذب المنافقين والمنافقات والمشركين والمشركات أي بإيصال الهموم إليهم بسبب علو كلمة المسلمين ، وبأن يسلط النبي - عليه السلام - قتلا وأسرا واسترقاقا . الظانين بالله ظن السوء يعني ظنهم أن النبي - صلى الله عليه وسلم - لا يرجع إلى المدينة ، ولا أحد من أصحابه حين خرج إلى الحديبية ، وأن المشركين يستأصلونهم . كما قال : بل ظننتم أن لن ينقلب الرسول والمؤمنون إلى أهليهم أبدا . وقال الخليل وسيبويه : السوء هنا الفساد . عليهم دائرة السوء في الدنيا بالقتل والسبي والأسر ، وفي الآخرة جهنم . وقرأ ابن كثير وأبو عمرو ( دائرة السوء ) بالضم . وفتح الباقون . قال الجوهري : ساءه يسوءه سوءا ( بالفتح ) ومساءة ومساية ، نقيض سره ، والاسم السوء ( بالضم ) . وقرئ ( عليهم دائرة السوء ) يعني الهزيمة والشر . ومن فتح فهو من المساءة .\nوغضب الله عليهم ولعنهم وأعد لهم جهنم وساءت مصيرا\n                                    ",
      "saadi": "وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ وَٱلۡمُنَٰفِقَٰتِ وَٱلۡمُشۡرِكِينَ وَٱلۡمُشۡرِكَٰتِ ٱلظَّآنِّينَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَيۡهِمۡ دَآئِرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَيۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرٗا ٦\n                                        \n                                        \n                                        \n                                        وأما المنافقون والمنافقات، والمشركون والمشركات، فإن الله يعذبهم بذلك، ويريهم ما يسوءهم؛ حيث كان مقصودهم خذلان المؤمنين، وظنوا بالله الظن السوء، أنه لا ينصر دينه، ولا يعلي كلمته، وأن أهل الباطل، ستكون لهم الدائرة على أهل الحق، فأدار الله عليهم ظنهم، وكانت دائرة السوء عليهم في الدنيا، { وَغَضِبَ اللَّهُ عَلَيْهِمْ } بما اقترفوه من المحادة لله ولرسوله، { وَلَعَنَهُمْ } أي: أبعدهم وأقصاهم عن رحمته { وَأَعَدَّ لَهُمْ جَهَنَّمَ وَسَاءَتْ مَصِيرًا }\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Al-Fath.html",
    "contnent": "وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا ٧",
    "tafsier": {
      "ibnkther": "وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا ٧\n                                    \n                                    \n                                    ثم قال مؤكدا لقدرته على الانتقام من الأعداء - أعداء الإسلام من الكفرة والمنافقين - : ( ولله جنود السماوات والأرض وكان الله عزيزا حكيما ) .\n                                    ",
      "qortoby": "وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا ٧\n                                    \n                                    \n                                    ولله جنود السماوات والأرض وكان الله عزيزا حكيما دليل على كفرهم لأن الله تعالى لا يغضب إلا على كافر خارج عن الإيمان تقدم في غير موضع جميعه ، والحمد لله . وقيل : لما جرى صلح الحديبية قال ابن أبي : أيظن محمد أنه إذا صالح أهل مكة أو فتحها لا يبقى له عدو ، فأين فارس والروم فبين الله - عز وجل - أن جنود السماوات والأرض أكثر من فارس والروم . وقيل : يدخل فيه جميع المخلوقات . وقال ابن عباس : ولله جنود السماوات الملائكة . وجنود الأرض المؤمنون . وأعاد لأن الذي سبق عقيب ذكر المشركين من قريش ، وهذا عقيب ذكر المنافقين وسائر المشركين . والمراد في الموضعين التخويف والتهديد . فلو أراد إهلاك المنافقين والمشركين لم يعجزه ذلك ، ولكن يؤخرهم إلى أجل مسمى .\n                                    ",
      "saadi": "وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمًا ٧\n                                        \n                                        \n                                        \n                                        كرر الإخبار بأن له ملك السماوات والأرض وما فيهما من الجنود، ليعلم العباد أنه تعالى هو المعز المذل، وأنه سينصر جنوده المنسوبة إليه، كما قال تعالى: { وَإِنَّ جُنْدَنَا لَهُمُ الْغَالِبُونَ } { وَكَانَ اللَّهُ عَزِيزًا } أي: قويا غالبا، قاهرا لكل شيء، ومع عزته وقوته فهو حكيم في خلقه وتدبيره، يجري على ما تقتضيه حكمته وإتقانه.\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Al-Fath.html",
    "contnent": "إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا ٨",
    "tafsier": {
      "ibnkther": "إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا ٨\n                                    \n                                    \n                                    يقول تعالى لنبيه محمد - صلوات الله وسلامه عليه ( إنا أرسلناك شاهدا ) أي : على الخلق ، ( ومبشرا ) أي : للمؤمنين ، ( ونذيرا ) أي : للكافرين . وقد تقدم تفسيرها في سورة \" الأحزاب \" .\n                                    ",
      "qortoby": "إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا ٨\n                                    \n                                    \n                                    قوله تعالى : إنا أرسلناك شاهدا ومبشرا ونذيرا\nقوله تعالى : إنا أرسلناك شاهدا قال قتادة : على أمتك بالبلاغ . وقيل : شاهدا عليهم بأعمالهم من طاعة أو معصية . وقيل : مبينا لهم ما أرسلناك به إليهم . وقيل : شاهدا عليهم يوم القيامة . فهو شاهد أفعالهم اليوم ، والشهيد عليهم يوم القيامة . وقد مضى في ( النساء ) عن سعيد بن جبير هذا المعنى مبينا . ومبشرا : لمن أطاعه بالجنة . ونذيرا : من النار لمن عصى ، قاله قتادة وغيره . وقد مضى في ( البقرة ) اشتقاق البشارة والنذارة ومعناهما . وانتصب \" شاهدا ومبشرا ونذيرا \" على الحال المقدرة . حكى سيبويه : مررت برجل معه صقر صائدا به غدا ، فالمعنى : إنا أرسلناك مقدرين بشهادتك يوم القيامة . وعلى هذا تقول : رأيت عمرا قائما غدا .\n                                    ",
      "saadi": "إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا ٨\n                                        \n                                        \n                                        \n                                        أي: { إِنَّا أَرْسَلْنَاكَ } أيها الرسول الكريم { شَاهِدًا } لأمتك بما فعلوه من خير وشر، وشاهدا على المقالات والمسائل، حقها وباطلها، وشاهدا لله تعالى بالوحدانية والانفراد بالكمال من كل وجه، { وَمُبَشِّرًا } من أطاعك وأطاع الله بالثواب الدنيوي والديني والأخروي، ومنذرا من عصى الله بالعقاب العاجل والآجل، ومن تمام البشارة والنذارة، بيان الأعمال والأخلاق التي يبشر بها وينذر، فهو المبين للخير والشر، والسعادة والشقاوة، والحق من الباطل.\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Al-Fath.html",
    "contnent": "لِّتُؤۡمِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا ٩",
    "tafsier": {
      "ibnkther": "لِّتُؤۡمِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا ٩\n                                    \n                                    \n                                    ( لتؤمنوا بالله ورسوله وتعزروه ) ، قال ابن عباس وغير واحد : يعظموه ، ( وتوقروه ) من التوقير وهو الاحترام والإجلال والإعظام ، ( وتسبحوه ) أي : يسبحون الله ، ( بكرة وأصيلا ) أي : أول النهار وآخره .\n                                    ",
      "qortoby": "لِّتُؤۡمِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا ٩\n                                    \n                                    \n                                    لتؤمنوا بالله ورسوله قرأ ابن كثير وابن محيصن وأبو عمرو ( ليؤمنوا ) بالياء ، وكذلك ( يعزروه ويوقروه ويسبحوه ) كله بالياء على الخبر . واختاره أبو عبيد لذكر المؤمنين قبله وبعده ، فأما قبله فقوله : \" ليدخل \" وأما بعده فقوله : إن الذين يبايعونك الباقون بالتاء على الخطاب ، واختاره أبو حاتم . وتعزروه أي تعظموه وتفخموه ، قاله الحسن والكلبي ، والتعزيز : التعظيم والتوقير . وقال قتادة : تنصروه وتمنعوا منه . ومنه التعزير في الحد لأنه مانع . قال القطامي :\nألا بكرت مي بغير سفاهة تعاتب والمودود ينفعه العزر\nوقال ابن عباس وعكرمة : تقاتلون معه بالسيف . وقال بعض أهل اللغة : تطيعوه .\nوتوقروه أي تسودوه ، قاله السدي . وقيل : تعظموه . والتوقير : التعظيم والترزين أيضا . والهاء فيهما للنبي - صلى الله عليه وسلم - . وهنا وقف تام ، ثم تبتدئ وتسبحوه أي تسبحوا الله بكرة وأصيلا أي عشيا . وقيل : الضمائر كلها لله تعالى ، فعلى هذا يكون تأويل تعزروه وتوقروه أي : تثبتوا له صحة الربوبية وتنفوا عنه أن يكون له ولد أو شريك . واختار هذا القول القشيري . والأول قول الضحاك ، وعليه يكون بعض الكلام راجعا إلى الله سبحانه وتعالى ، وهو وتسبحوه من غير خلاف . وبعضه راجعا إلى رسوله - صلى الله عليه وسلم - وهو وتعزروه وتوقروه أي : تدعوه بالرسالة والنبوة لا بالاسم والكنية . وفي ( تسبحوه ) وجهان : تسبيحه بالتنزيه له سبحانه من كل قبيح . والثاني : هو فعل الصلاة التي فيها التسبيح . ( بكرة وأصيلا ) أي : غدوة وعشيا . وقد مضى القول فيه . وقال الشاعر [ أبو ذؤيب ] :\nلعمري لأنت البيت أكرم أهله وأجلس في أفيائه بالأصائل\n                                    ",
      "saadi": "لِّتُؤۡمِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا ٩\n                                        \n                                        \n                                        \n                                        { لِتُؤْمِنُوا بِاللَّهِ وَرَسُولِهِ }\nأي: بسبب دعوة الرسول لكم، وتعليمه لكم ما ينفعكم، أرسلناه لتقوموا بالإيمان بالله ورسوله، المستلزم ذلك لطاعتهما في جميع الأمور.\n{ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ } أي: تعزروا الرسول صلى الله عليه وسلم وتوقروه أي: تعظموه وتجلوه، وتقوموا بحقوقه، كما كانت له المنة العظيمة برقابكم، { وَتُسَبِّحُوهُ } أي: تسبحوا لله { بُكْرَةً وَأَصِيلًا } أول النهار وآخره، فذكر الله في هذه الآية الحق المشترك بين الله وبين رسوله، وهو الإيمان بهما، والمختص بالرسول، وهو التعزير والتوقير، والمختص بالله، وهو التسبيح له والتقديس بصلاة أو غيرها.\n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Al-Fath.html",
    "contnent": "إِنَّ ٱلَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ ٱللَّهَ يَدُ ٱللَّهِ فَوۡقَ أَيۡدِيهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَٰهَدَ عَلَيۡهُ ٱللَّهَ فَسَيُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٠١",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ ٱللَّهَ يَدُ ٱللَّهِ فَوۡقَ أَيۡدِيهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَٰهَدَ عَلَيۡهُ ٱللَّهَ فَسَيُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٠١\n                                    \n                                    \n                                    ثم قال تعالى لرسوله - صلى الله عليه وسلم - تشريفا له وتعظيما وتكريما : ( إن الذين يبايعونك إنما يبايعون الله ) كقوله ( من يطع الرسول فقد أطاع الله ) [ النساء : 80 ] ، ( يد الله فوق أيديهم ) أي : هو حاضر معهم يسمع أقوالهم ويرى مكانهم ، ويعلم ضمائرهم وظواهرهم ، فهو تعالى هو المبايع بواسطة رسوله - صلى الله عليه وسلم - كقوله : ( إن الله اشترى من المؤمنين أنفسهم وأموالهم بأن لهم الجنة يقاتلون في سبيل الله فيقتلون ويقتلون وعدا عليه حقا في التوراة والإنجيل والقرآن ومن أوفى بعهده من الله فاستبشروا ببيعكم الذي بايعتم به وذلك هو الفوز العظيم ) [ التوبة : 111 ] .\nوقد قال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا الفضل بن يحيى الأنباري ، حدثنا علي بن بكار ، عن محمد بن عمرو ، عن أبي سلمة ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" من سل سيفه في سبيل الله ، فقد بايع الله \" .\nوحدثنا أبي ، حدثنا يحيى بن المغيرة ، أخبرنا جرير ، عن عبد الله بن عثمان بن خثيم ، عن سعيد بن جبير ، عن ابن عباس ، قال : قال رسول الله - صلى الله عليه وسلم - في الحجر : \" والله ليبعثه الله يوم القيامة له عينان ينظر بهما ، ولسان ينطق ، به ويشهد على من استلمه بالحق ، فمن استلمه فقد بايع الله \" ، ثم قرأ : ( إن الذين يبايعونك إنما يبايعون الله يد الله فوق أيديهم ) .\nولهذا قال هاهنا : ( فمن نكث فإنما ينكث على نفسه ) أي : إنما يعود وبال ذلك على الناكث ، والله غني عنه ، ( ومن أوفى بما عاهد عليه الله فسيؤتيه أجرا عظيما ) أي : ثوابا جزيلا . وهذه البيعة هي بيعة الرضوان ، وكانت تحت شجرة سمر بالحديبية ، وكان الصحابة الذين بايعوا رسول الله - صلى الله عليه وسلم - يومئذ قيل : ألف وثلاثمائة . وقيل : أربعمائة . وقيل : وخمسمائة . والأوسط أصح .\nذكر الأحاديث الواردة في ذلك :\nقال البخاري : حدثنا قتيبة ، حدثنا سفيان ، عن عمرو ، عن جابر قال : كنا يوم الحديبية ألفا وأربعمائة .\nورواه مسلم من حديث سفيان بن عيينة ، به . وأخرجاه أيضا من حديث الأعمش ، عن سالم بن أبي الجعد ، عن جابر قال : كنا يومئذ ألفا وأربعمائة ، ووضع يده في ذلك الماء ، فنبع الماء من بين أصابعه ، حتى رووا كلهم .\nوهذا مختصر من سياق آخر حين ذكر قصة عطشهم يوم الحديبية ، وأن رسول الله - صلى الله عليه وسلم - أعطاهم سهما من كنانته ، فوضعوه في بئر الحديبية ، فجاشت بالماء ، حتى كفتهم ، فقيل لجابر : كم كنتم يومئذ ؟ قال : كنا ألفا وأربعمائة ، ولو كنا مائة ألف لكفانا . وفي رواية [ في ] الصحيحين عن جابر : أنهم كانوا خمس عشرة مائة .\nوروى البخاري من حديث قتادة ، قلت لسعيد بن المسيب : كم كان الذين شهدوا بيعة الرضوان ؟ قال : خمس عشرة مائة .\nقلت : فإن جابر بن عبد الله ، رضي الله عنهما ، قال : كانوا أربع عشرة مائة . قال رحمه الله : وهم ، هو حدثني أنهم كانوا خمس عشرة مائة .\nقال البيهقي : هذه الرواية تدل على أنه كان في القديم يقول : خمس عشرة مائة ، ثم ذكر الوهم فقال : أربع عشرة مائة .\nوروى العوفي عن ابن عباس : أنهم كانوا ألفا وخمسمائة وخمسة وعشرين . والمشهور الذي رواه غير واحد عنه : أربع عشرة مائة ، وهذا هو الذي رواه البيهقي ، عن الحاكم ، عن الأصم ، عن العباس الدوري ، عن يحيى بن معين ، عن شبابة بن سوار ، عن شعبة ، عن قتادة ، عن سعيد بن المسيب ، عن أبيه قال : كنا مع رسول الله - صلى الله عليه وسلم - تحت الشجرة ألفا وأربعمائة . وكذلك هو في رواية سلمة بن الأكوع ، ومعقل بن يسار ، والبراء بن عازب . وبه يقول غير واحد من أصحاب المغازي والسير . وقد أخرج صاحبا الصحيح من حديث شعبة ، عن عمرو بن مرة قال : سمعت عبد الله بن أبي أوفى يقول : كان أصحاب الشجرة ألفا وأربعمائة ، وكانت أسلم يومئذ ثمن المهاجرين .\nوروى محمد بن إسحاق في السيرة ، عن الزهري ، عن عروة بن الزبير ، عن المسور بن مخرمة ، ومروان بن الحكم ، أنهما حدثاه قالا خرج رسول الله - صلى الله عليه وسلم - عام الحديبية يريد زيارة البيت ، لا يريد قتالا وساق معه الهدي سبعين بدنة ، وكان الناس سبعمائة رجل ، كل بدنة عن عشرة نفر ، وكان جابر بن عبد الله فيما بلغني عنه يقول : كنا أصحاب الحديبية أربع عشرة مائة .\nكذا قال ابن إسحاق وهو معدود من أوهامه ، فإن المحفوظ في الصحيحين أنهم كانوا بضع عشرة مائة\nذكر سبب هذه البيعة العظيمة :\nقال محمد بن إسحاق بن يسار في السيرة : ثم دعا رسول الله - صلى الله عليه وسلم - عمر بن الخطاب ليبعثه إلى مكة ليبلغ عنه أشراف قريش ما جاء له ، فقال : يا رسول الله ، إني أخاف قريشا على نفسي ، وليس بمكة من بني عدي بن كعب من يمنعني ، وقد عرفت قريش عداوتي إياها ، وغلظي عليها ، ولكني أدلك على رجل أعز بها مني ، عثمان بن عفان ، فبعثه إلى أبي سفيان وأشراف قريش ، يخبرهم أنه لم يأت لحرب ، وأنه جاء زائرا لهذا البيت ومعظما لحرمته .\nفخرج عثمان إلى مكة ، فلقيه أبان بن سعيد بن العاص حين دخل مكة ، أو قبل أن يدخلها ، فحمله بين يديه ، ثم أجاره حتى بلغ رسالة رسول الله - صلى الله عليه وسلم - فانطلق عثمان حتى أتى أبا سفيان وعظماء قريش فبلغهم عن رسول الله [ - صلى الله عليه وسلم - ] ما أرسله به ، فقالوا لعثمان حين فرغ من رسالة رسول الله - صلى الله عليه وسلم - إليهم : إن شئت أن تطوف بالبيت فطف . فقال : ما كنت لأفعل حتى يطوف به رسول الله - صلى الله عليه وسلم - . واحتبسته قريش عندها ، فبلغ رسول الله - صلى الله عليه وسلم - والمسلمين أن عثمان قد قتل .\nقال ابن إسحاق : فحدثني عبد الله بن أبي بكر أن رسول الله - صلى الله عليه وسلم - قال حين بلغه أن عثمان قد قتل : \" لا نبرح حتى نناجز القوم \" . ودعا رسول الله - صلى الله عليه وسلم - الناس إلى البيعة . فكانت بيعة الرضوان تحت الشجرة ، فكان الناس يقولون : بايعهم رسول الله - صلى الله عليه وسلم - على الموت . وكان جابر بن عبد الله يقول : إن رسول الله - صلى الله عليه وسلم - لم يبايعهم على الموت ، ولكن بايعنا على ألا نفر .\nفبايع الناس ، ولم يتخلف أحد من المسلمين حضرها إلا الجد بن قيس أخو بني سلمة ، فكان جابر يقول : والله لكأني أنظر إليه لاصقا بإبط ناقته ، قد ضبأ إليها يستتر بها من الناس ، ثم أتى رسول الله - صلى الله عليه وسلم - أن الذي كان من أمر عثمان باطل .\nوذكر ابن لهيعة عن الأسود . عن عروة بن الزبير قريبا من هذا السياق ، وزاد في سياقه : أن قريشا بعثوا وعندهم عثمان [ بن عفان ] سهيل بن عمرو ، وحويطب بن عبد العزى ، ومكرز بن حفص إلى رسول الله - صلى الله عليه وسلم - فبينما هم عندهم إذ وقع كلام بين بعض المسلمين وبعض المشركين ، وتراموا بالنبل والحجارة ، وصاح الفريقان كلاهما ، وارتهن كل من الفريقين من عنده من الرسل ، ونادى منادي رسول الله - صلى الله عليه وسلم - : ألا إن روح القدس قد نزل على رسول الله - صلى الله عليه وسلم - وأمر بالبيعة ، فاخرجوا على اسم الله فبايعوا ، فسار المسلمون إلى رسول الله - صلى الله عليه وسلم - وهو تحت الشجرة فبايعوه على ألا يفروا أبدا ، فأرعب ذلك المشركين ، وأرسلوا من كان عندهم من المسلمين ، ودعوا إلى الموادعة والصلح .\nوقال الحافظ أبو بكر البيهقي : أخبرنا علي بن أحمد بن عبدان ، أخبرنا أحمد بن عبيد الصفار ، حدثنا تمتام ، حدثنا الحسن بن بشر ، حدثنا الحكم بن عبد الملك ، عن قتادة ، عن أنس بن مالك قال : لما أمر رسول الله - صلى الله عليه وسلم - ببيعة الرضوان كان عثمان بن عفان [ رضي الله عنه ] رسول رسول الله - صلى الله عليه وسلم - إلى أهل مكة ، فبايع الناس ، فقال رسول الله - صلى الله عليه وسلم - : \" اللهم إن عثمان في حاجة الله وحاجة رسوله \" . فضرب بإحدى يديه على الأخرى ، فكانت يد رسول الله - صلى الله عليه وسلم - لعثمان خيرا من أيديهم لأنفسهم .\nقال ابن هشام : حدثني من أثق به عمن حدثه بإسناد له ، عن أبي مليكة ، عن ابن عمر قال : بايع رسول الله - صلى الله عليه وسلم - لعثمان ، فضرب بإحدى يديه على الأخرى .\nوقال عبد الملك بن هشام النحوي : فذكر وكيع ، عن إسماعيل بن أبي خالد ، عن الشعبي : أن أول من بايع رسول الله - صلى الله عليه وسلم - بيعة الرضوان أبو سنان الأسدي .\nوقال أبو بكر عبد الله بن الزبير الحميدي : حدثنا سفيان ، حدثنا ابن أبي خالد ، عن الشعبي ، قال : لما دعا رسول الله - صلى الله عليه وسلم - الناس إلى البيعة ، كان أول من انتهى إليه أبو سنان [ الأسدي رضي الله عنه ] ، فقال : ابسط يدك أبايعك . فقال النبي - صلى الله عليه وسلم - : \" علام تبايعني ؟ \" . فقال أبو سنان : على ما في نفسك . هذا أبو سنان [ بن ] وهب الأسدي [ رضي الله عنه ] .\nوقال البخاري : حدثنا شجاع بن الوليد ، سمع النضر بن محمد : حدثنا صخر [ بن الربيع ] ، عن نافع ، قال : إن الناس يتحدثون أن ابن عمر أسلم قبل عمر ، وليس كذلك ، ولكن عمر يوم الحديبية أرسل عبد الله إلى فرس له عند رجل من الأنصار أن يأتي به ليقاتل عليه ، ورسول الله - صلى الله عليه وسلم - يبايع عند الشجرة ، وعمر لا يدري بذلك ، فبايعه عبد الله ، ثم ذهب إلى الفرس فجاء به إلى عمر ، وعمر يستلئم للقتال ، فأخبره أن رسول الله - صلى الله عليه وسلم - يبايع تحت الشجرة ، فانطلق ، فذهب معه حتى بايع رسول الله - صلى الله عليه وسلم - وهي التي يتحدث الناس أن ابن عمر أسلم قبل عمر .\nثم قال البخاري : وقال هشام بن عمار : حدثنا الوليد بن مسلم ، حدثنا عمر بن محمد العمري ، أخبرني نافع ، عن ابن عمر ، أن الناس كانوا مع رسول الله - صلى الله عليه وسلم - يوم الحديبية قد تفرقوا في ظلال الشجر ، فإذا الناس محدقون بالنبي - صلى الله عليه وسلم - فقال - يعني عمر - : يا عبد الله ، انظر ما شأن الناس قد أحدقوا برسول الله - صلى الله عليه وسلم - . فوجدهم يبايعون ، فبايع ثم رجع إلى عمر فخرج فبايع .\nوقد أسنده البيهقي عن أبي عمرو الأديب ، عن أبي بكر الإسماعيلي ، عن الحسن بن سفيان ، عن دحيم : حدثني الوليد بن مسلم فذكره .\nوقال الليث ، عن أبي الزبير ، عن جابر ، قال : كنا يوم الحديبية ألفا وأربعمائة فبايعناه ، وعمر آخذ بيده تحت الشجرة وهي سمرة ، وقال : بايعناه على ألا نفر ، ولم نبايعه على الموت . رواه مسلم عن قتيبة عنه .\nوروى مسلم عن يحيى بن يحيى ، عن يزيد بن زريع ، عن خالد ، عن الحكم بن عبد الله بن الأعرج ، عن معقل بن يسار ، قال : لقد رأيتني يوم الشجرة والنبي - صلى الله عليه وسلم - يبايع الناس ، وأنا رافع غصنا من أغصانها عن رأسه ، ونحن أربع عشرة مائة ، قال : ولم نبايعه على الموت ، ولكن بايعناه على ألا نفر .\nوقال البخاري : حدثنا المكي بن إبراهيم ، عن يزيد بن أبي عبيد ، عن سلمة بن الأكوع ، قال : بايعت رسول الله - صلى الله عليه وسلم - تحت الشجرة . قال يزيد : قلت : يا أبا مسلم ، على أي شيء كنتم تبايعون يومئذ ؟ قال : على الموت .\nوقال البخاري أيضا : حدثنا أبو عاصم ، حدثنا يزيد بن أبي عبيد عن سلمة ، قال : بايعت رسول الله - صلى الله عليه وسلم - يوم الحديبية ثم تنحيت ، فقال : \" يا سلمة ألا تبايع ؟ \" قلت : بايعت ، قال : \" أقبل فبايع \" . فدنوت فبايعته . قلت : علام بايعته يا سلمة ؟ قال : على الموت . وأخرجه مسلم من وجه آخر عن يزيد بن أبي عبيد . وكذا روى البخاري عن عباد بن تميم ، أنهم بايعوه على الموت .\nوقال البيهقي : أخبرنا أبو عبد الله الحافظ ، أخبرنا أبو الفضل بن إبراهيم ، حدثنا أحمد بن سلمة ، حدثنا إسحاق بن إبراهيم ، حدثنا أبو عامر العقدي عبد الملك بن عمرو ، حدثنا عكرمة بن عمار اليمامي ، عن إياس بن سلمة ، عن أبيه سلمة بن الأكوع قال : قدمنا الحديبية مع رسول الله - صلى الله عليه وسلم - ونحن أربع عشرة مائة ، وعليها خمسون شاة لا ترويها ، فقعد رسول الله - صلى الله عليه وسلم - على جباها - يعني الركي - فإما دعا وإما بصق فيها ، فجاشت ، فسقينا واستقينا . قال : ثم إن رسول الله - صلى الله عليه وسلم - دعا إلى البيعة في أصل الشجرة . فبايعته أول الناس ، ثم بايع وبايع ، حتى إذا كان في وسط الناس قال - صلى الله عليه وسلم - : \" بايعني يا سلمة \" . قال : قلت : يا رسول الله ، قد بايعتك في أول الناس . قال : \" وأيضا \" . قال : ورآني رسول الله - صلى الله عليه وسلم - عزلا فأعطاني حجفة - أو درقة - ثم بايع حتى إذا كان في آخر الناس قال - صلى الله عليه وسلم - : \" ألا تبايع يا سلمة ؟ \" قال : قلت : يا رسول الله ، قد بايعتك في أول الناس وأوسطهم . قال : \" وأيضا \" . فبايعته الثالثة ، فقال : \" يا سلمة ، أين حجفتك أو درقتك التي أعطيتك ؟ \" . قال : قلت : يا رسول الله ، لقيني عامر عزلا فأعطيتها إياه : فضحك رسول الله - صلى الله عليه وسلم - ثم قال : \" إنك كالذي قال الأول : اللهم أبغني حبيبا هو أحب إلي من نفسي \" قال : ثم إن المشركين من أهل مكة راسلونا في الصلح حتى مشى بعضنا في بعض فاصطلحنا . قال : وكنت خادما لطلحة بن عبيد الله رضي الله عنه ، أسقي فرسه وأحسه وآكل من طعامه ، وتركت أهلي ومالي مهاجرا إلى الله ورسوله . فلما اصطلحنا نحن وأهل مكة ، واختلط بعضنا ببعض ، أتيت شجرة فكسحت شوكها ، ثم اضطجعت في أصلها في ظلها ، فأتاني أربعة من مشركي أهل مكة ، فجعلوا يقعون في رسول الله - صلى الله عليه وسلم - فأبغضتهم ، وتحولت إلى شجرة أخرى فعلقوا سلاحهم واضطجعوا ، فبينما هم كذلك إذ نادى مناد من أسفل الوادي : يا للمهاجرين ، قتل ابن زنيم . فاخترطت سيفي ، فشددت على أولئك الأربعة وهم رقود ، فأخذت سلاحهم وجعلته ضغثا في يدي ، ثم قلت : والذي كرم وجه محمد - صلى الله عليه وسلم - لا يرفع أحد منكم رأسه إلا ضربت الذي فيه عيناه ، قال : ثم جئت بهم أسوقهم إلى رسول الله - صلى الله عليه وسلم - قال : وجاء عمي عامر برجل من العبلات يقال له : \" مكرز \" من المشركين يقوده ، حتى وقفنا بهم على رسول الله - صلى الله عليه وسلم - في سبعين من المشركين ، فنظر إليهم رسول الله - صلى الله عليه وسلم - وقال : \" دعوهم يكن لهم بدء الفجور وثناه \" ، فعفا عنهم رسول الله - صلى الله عليه وسلم - وأنزل الله [ عز وجل ] : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم ) الآية [ الفتح : 24 ] .\nوهكذا رواه مسلم عن إسحاق بن إبراهيم بن راهويه بسنده نحوه ، أو قريبا منه .\nوثبت في الصحيحين من حديث أبي عوانة ، عن طارق ، عن سعيد بن المسيب ، قال : كان أبي ممن بايع رسول الله - صلى الله عليه وسلم - تحت الشجرة . قال : فانطلقنا من قابل حاجين ، فخفي علينا مكانها ، فإن كان تبينت لكم ، فأنتم أعلم .\nوقال أبو بكر الحميدي : حدثنا سفيان ، حدثنا أبو الزبير ، حدثنا جابر ، قال : لما دعا رسول الله - صلى الله عليه وسلم - الناس إلى البيعة ، وجدنا رجلا منا يقال له \" الجد بن قيس \" مختبئا تحت إبط بعيره \" .\nرواه مسلم من حديث ابن جريج ، عن ابن الزبير ، به .\nوقال الحميدي أيضا : حدثنا سفيان ، عن عمرو ، سمع جابرا ، قال : كنا يوم الحديبية ألفا وأربعمائة ، فقال لنا رسول الله - صلى الله عليه وسلم - \" أنتم خير أهل الأرض اليوم \" . قال جابر : لو كنت أبصر لأريتكم موضع الشجرة . قال سفيان : إنهم اختلفوا في موضعها . أخرجاه من حديث سفيان .\nوقال الإمام أحمد : حدثنا يونس ، حدثنا الليث . عن أبي الزبير ، عن جابر ، عن رسول الله - صلى الله عليه وسلم - أنه قال : \" لا يدخل النار أحد ممن بايع تحت الشجرة \" .\nوقال ابن أبي حاتم : حدثنا محمد بن هارون الفلاس المخرمي ، حدثنا سعد بن عمرو الأشعثي ، حدثنا محمد بن ثابت العبدي ، عن خداش بن عياش ، عن أبي الزبير ، عن جابر ، قال : قال رسول الله - صلى الله عليه وسلم - : \" يدخل من بايع تحت الشجرة كلهم الجنة إلا صاحب الجمل الأحمر \" . قال : فانطلقنا نبتدره فإذا رجل قد أضل بعيره ، فقلنا : تعال فبايع . فقال : أصيب بعيري أحب إلي من أن أبايع .\nوقال عبد الله بن أحمد : حدثنا عبيد الله بن معاذ ، حدثنا أبي حدثنا قرة ، عن أبي الزبير ، عن جابر ، عن النبي - صلى الله عليه وسلم - أنه قال : \" من يصعد الثنية ، ثنية المرار ، فإنه يحط عنه ما حط عن بني إسرائيل \" . فكان أول من صعد خيل بني الخزرج ، ثم تبادر الناس بعد ، فقال رسول الله - صلى الله عليه وسلم - : \" كلكم مغفور له إلا صاحب الجمل الأحمر \" . فقلنا : تعال يستغفر لك رسول الله [ - صلى الله عليه وسلم - ] . فقال : والله لأن أجد ضالتي أحب إلي من أن يستغفر لي صاحبكم . فإذا هو رجل ينشد ضالة . رواه مسلم عن عبيد الله ، به .\nوقال ابن جريج : أخبرني أبو الزبير ، أنه سمع جابرا يقول : أخبرتني أم مبشر أنها سمعت رسول الله - صلى الله عليه وسلم - يقول عند حفصة : \" لا يدخل النار - إن شاء الله - من أصحاب الشجرة الذين بايعوا تحتها أحد \" . قالت : بلى يا رسول الله . فانتهرها ، فقالت لحفصة : ( وإن منكم إلا واردها ) [ مريم : 71 ] ، فقال النبي - صلى الله عليه وسلم - : \" قد قال الله : ( ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا ) [ مريم : 72 ] ، رواه مسلم .\nوفيه أيضا عن قتيبة ، عن الليث ، عن أبي الزبير ، عن جابر ; أن عبدا لحاطب بن أبي بلتعة جاء يشكو حاطبا ، فقال : يا رسول الله ، ليدخلن حاطب النار ، فقال رسول الله - صلى الله عليه وسلم - : \" كذبت ، لا يدخلها ; فإنه قد شهد بدرا والحديبية \" .\nولهذا قال تعالى في الثناء عليهم : ( إن الذين يبايعونك إنما يبايعون الله يد الله فوق أيديهم فمن نكث فإنما ينكث على نفسه ومن أوفى بما عاهد عليه الله فسيؤتيه أجرا عظيما ) [ الفتح : 10 ] ، كما قال تعالى في الآية الأخرى : ( لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة فعلم ما في قلوبهم فأنزل السكينة عليهم وأثابهم فتحا قريبا ) [ الفتح : 18 ] .\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ ٱللَّهَ يَدُ ٱللَّهِ فَوۡقَ أَيۡدِيهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَٰهَدَ عَلَيۡهُ ٱللَّهَ فَسَيُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٠١\n                                    \n                                    \n                                    قوله تعالى : إن الذين يبايعونك إنما يبايعون الله يد الله فوق أيديهم فمن نكث فإنما ينكث على نفسه ومن أوفى بما عاهد عليه الله فسيؤتيه أجرا عظيما .\nقوله تعالى : إن الذين يبايعونك بالحديبية يا محمد . إنما يبايعون الله بين أن بيعتهم لنبيه - صلى الله عليه وسلم - إنما هي بيعة الله ، كما قال تعالى : من يطع الرسول فقد أطاع الله . وهذه المبايعة هي بيعة الرضوان ، على ما يأتي بيانها في هذه السورة إن شاء الله تعالى . يد الله فوق أيديهم قيل : يده في الثواب فوق أيديهم في الوفاء ، ويده في المنة عليهم بالهداية فوق أيديهم في الطاعة . وقال الكلبي : معناه نعمة الله عليهم فوق ما صنعوا من البيعة . وقال ابن كيسان : قوة الله ونصرته فوق قوتهم ونصرتهم . فمن نكث بعد البيعة . فإنما ينكث على نفسه أي يرجع ضرر النكث عليه ; لأنه حرم نفسه الثواب وألزمها العقاب . ومن أوفى بما عاهد عليه الله قيل في البيعة . وقيل : في إيمانه . وقرأ حفص والزهري عليه بضم الهاء . وجرها الباقون . فسيؤتيه أجرا عظيما يعني في الجنة . وقرأ نافع وابن كثير وابن عامر ( فسنؤتيه ) بالنون . واختاره الفراء وأبو معاذ . وقرأ الباقون بالياء . وهو اختيار أبي عبيد وأبي حاتم ، لقرب اسم الله منه .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ ٱللَّهَ يَدُ ٱللَّهِ فَوۡقَ أَيۡدِيهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَٰهَدَ عَلَيۡهُ ٱللَّهَ فَسَيُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٠١\n                                        \n                                        \n                                        \n                                        هذه المبايعة التي أشار الله إليها هي { بيعة الرضوان } التي بايع الصحابة رضي الله عنهم فيها رسول الله صلى الله عليه وسلم، على أن لا يفروا عنه، فهي عقد خاص، من لوازمه أن لا يفروا، ولو لم يبق منهم إلا القليل، ولو كانوا في حال يجوز الفرار فيها، فأخبر تعالى: أن الذين بايعوك حقيقة الأمر أنهم { يُبَايِعُونَ اللَّهَ } ويعقدون العقد معه، حتى إنه من شدة تأكده أنه قال: { يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ } أي: كأنهم بايعوا الله وصافحوه بتلك المبايعة، وكل هذا لزيادة التأكيد والتقوية، وحملهم على الوفاء بها، ولهذا قال: { فَمَنْ نَكَثَ } فلم يف بما عاهد الله عليه { فَإِنَّمَا يَنْكُثُ عَلَى نَفْسِهِ } أي: لأن وبال ذلك راجع إليه، وعقوبته واصلة له، { وَمَنْ أَوْفَى بِمَا عَاهَدَ عَلَيْهُ اللَّهَ } أي: أتى به كاملا موفرا، { فَسَيُؤْتِيهِ أَجْرًا عَظِيمًا } لا يعلم عظمه وقدره إلا الذي آتاه إياه.\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Al-Fath.html",
    "contnent": "سَيَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَآ أَمۡوَٰلُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ يَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَيۡسَ فِي قُلُوبِهِمۡۚ قُلۡ فَمَن يَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَيۡ‍ًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرَۢا ١١",
    "tafsier": {
      "ibnkther": "سَيَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَآ أَمۡوَٰلُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ يَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَيۡسَ فِي قُلُوبِهِمۡۚ قُلۡ فَمَن يَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَيۡ‍ًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرَۢا ١١\n                                    \n                                    \n                                    يقول تعالى مخبرا رسوله - صلوات الله وسلامه عليه - بما يعتذر به المخلفون من الأعراب الذين اختاروا المقام في أهليهم وشغلهم ، وتركوا المسير مع رسول الله - صلى الله عليه وسلم - فاعتذروا بشغلهم بذلك ، وسألوا أن يستغفر لهم الرسول - صلى الله عليه وسلم - وذلك قول منهم لا على سبيل الاعتقاد ، بل على وجه التقية والمصانعة ; ولهذا قال تعالى : ( يقولون بألسنتهم ما ليس في قلوبهم قل فمن يملك لكم من الله شيئا إن أراد بكم ضرا أو أراد بكم نفعا ) أي : لا يقدر أحد أن يرد ما أراده فيكم تعالى وتقدس ، وهو العليم بسرائركم وضمائركم ، وإن صانعتمونا وتابعتمونا ; ولهذا قال : ( بل كان الله بما تعملون خبيرا ) .\n                                    ",
      "qortoby": "سَيَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَآ أَمۡوَٰلُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ يَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَيۡسَ فِي قُلُوبِهِمۡۚ قُلۡ فَمَن يَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَيۡ‍ًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرَۢا ١١\n                                    \n                                    \n                                    قوله تعالى : سيقول لك المخلفون من الأعراب شغلتنا أموالنا وأهلونا فاستغفر لنا يقولون بألسنتهم ما ليس في قلوبهم قل فمن يملك لكم من الله شيئا إن أراد بكم ضرا أو أراد بكم نفعا بل كان الله بما تعملون خبيرا .\nقوله تعالى : سيقول لك المخلفون من الأعراب قال مجاهد وابن عباس : يعني أعراب غفار ومزينة وجهينة وأسلم وأشجع والديل ، وهم الأعراب الذين كانوا حول المدينة ، تخلفوا عن رسول الله - صلى الله عليه وسلم - حين أراد السفر إلى مكة عام الفتح ، بعد أن كان استنفرهم ليخرجوا معه حذرا من قريش ، وأحرم بعمرة وساق معه الهدي ، ليعلم الناس أنه لا يريد حربا فتثاقلوا عنه واعتلوا بالشغل ، فنزلت . وإنما قال : ( المخلفون ) لأن الله خلفهم عن صحبة نبيه . والمخلف المتروك . وقد مضى في ( التوبة ) شغلتنا أموالنا وأهلونا أي ليس لنا من يقوم بهما . فاستغفر لنا جاءوا يطلبون الاستغفار واعتقادهم بخلاف ظاهرهم ، ففضحهم الله تعالى بقوله : يقولون بألسنتهم ما ليس في قلوبهم وهذا هو النفاق المحض . قل فمن يملك لكم من الله شيئا إن أراد بكم ضرا قرأ حمزة والكسائي ( ضرا ) بضم الضاد هنا فقط ، أي : أمرا يضركم . وقال ابن عباس : الهزيمة . الباقون بالفتح ، وهو مصدر ضررته ضرا . وبالضم اسم لما ينال الإنسان من الهزال وسوء الحال . والمصدر يؤدي عن المرة وأكثر . واختاره أبو عبيد وأبو حاتم ، قالا : لأنه قابله بالنفع وهو ضد الضر . وقيل : هما لغتان بمعنى ، كالفقر والفقر والضعف والضعف . أو أراد بكم نفعا أي نصرا وغنيمة . وهذا رد عليهم حين ظنوا أن التخلف عن الرسول يدفع عنهم الضر ويعجل لهم النفع .\n                                    ",
      "saadi": "سَيَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَآ أَمۡوَٰلُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ يَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَيۡسَ فِي قُلُوبِهِمۡۚ قُلۡ فَمَن يَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَيۡ‍ًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرَۢا ١١\n                                        \n                                        \n                                        \n                                        يذم تعالى المتخلفين عن رسوله، في الجهاد في سبيله، من الأعراب الذين ضعف إيمانهم، وكان في قلوبهم مرض، وسوء ظن بالله تعالى، وأنهم سيعتذرون بأن أموالهم وأهليهم شغلتهم عن الخروج في الجهاد، وأنهم طلبوا من رسول الله صلى الله عليه وسلم أن يستغفر لهم، قال الله تعالى: { يَقُولُونَ بِأَلْسِنَتِهِمْ مَا لَيْسَ فِي قُلُوبِهِمْ } فإن طلبهم الاستغفار من رسول الله صلى الله عليه وسلم يدل على ندمهم وإقرارهم على أنفسهم بالذنب، وأنهم تخلفوا تخلفا يحتاج إلى توبة واستغفار، فلو كان هذا الذي في قلوبهم، لكان استغفار الرسول نافعا لهم، لأنهم قد تابوا وأنابوا، ولكن الذي في قلوبهم، أنهم إنما تخلفوا لأنهم ظنوا بالله ظن السوء.\n                                    "
    }
  },
  {
    "id": 11,
    "versesNumber": 12,
    "souraName": "Al-Fath.html",
    "contnent": "بَلۡ ظَنَنتُمۡ أَن لَّن يَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰٓ أَهۡلِيهِمۡ أَبَدٗا وَزُيِّنَ ذَٰلِكَ فِي قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورٗا ٢١",
    "tafsier": {
      "ibnkther": "بَلۡ ظَنَنتُمۡ أَن لَّن يَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰٓ أَهۡلِيهِمۡ أَبَدٗا وَزُيِّنَ ذَٰلِكَ فِي قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورٗا ٢١\n                                    \n                                    \n                                    ثم قال : ( بل ظننتم أن لن ينقلب الرسول والمؤمنون إلى أهليهم أبدا ) أي : لم يكن تخلفكم تخلف معذور ولا عاص ، بل تخلف نفاق ، ( بل ظننتم أن لن ينقلب الرسول والمؤمنون إلى أهليهم أبدا ) أي : اعتقدتم أنهم يقتلون وتستأصل شأفتهم وتستباد خضراؤهم ، ولا يرجع منهم مخبر ، ( وظننتم ظن السوء وكنتم قوما بورا ) أي : هلكى . قاله ابن عباس ، ومجاهد ، وغير واحد . وقال قتادة : فاسدين . وقيل : هي بلغة عمان .\n                                    ",
      "qortoby": "بَلۡ ظَنَنتُمۡ أَن لَّن يَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰٓ أَهۡلِيهِمۡ أَبَدٗا وَزُيِّنَ ذَٰلِكَ فِي قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورٗا ٢١\n                                    \n                                    \n                                    قوله تعالى : بل ظننتم أن لن ينقلب الرسول والمؤمنون إلى أهليهم أبدا وزين ذلك في قلوبكم وظننتم ظن السوء وكنتم قوما بورا .\nقوله تعالى : بل ظننتم أن لن ينقلب الرسول والمؤمنون إلى أهليهم أبدا وقالوا أنهم قالوا : إن محمدا وأصحابه أكلة رأس لا يرجعون . ( وزين ذلك ) أي النفاق . ( في قلوبكم ) وهذا التزيين من الشيطان ، أو يخلق الله ذلك في قلوبهم . ( وظننتم ظن السوء ) أن الله لا ينصر رسوله . ( وكنتم قوما بورا ) أي هلكى ، قاله مجاهد . وقال قتادة : فاسدين لا يصلحون لشيء من الخير . قال الجوهري : البور : الرجل الفاسد الهالك الذي لا خير فيه . قال عبد الله بن الزبعرى السهمي :\nيا رسول المليك إن لساني راتق ما فتقت إذ أنا بور\nوامرأة بور أيضا ، حكاه أبو عبيد . وقوم بور هلكى . قال تعالى : وكنتم قوما بورا وهو جمع بائر ، مثل حائل وحول . وقد بار فلان أي : هلك . وأباره الله أي : أهلكه . وقيل : بورا أشرارا ، قاله ابن بحر . وقال حسان بن ثابت :\nلا ينفع الطول من نوك الرجال وقد يهدي الإله سبيل المعشر البور\nأي : الهالك .\n                                    ",
      "saadi": "بَلۡ ظَنَنتُمۡ أَن لَّن يَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰٓ أَهۡلِيهِمۡ أَبَدٗا وَزُيِّنَ ذَٰلِكَ فِي قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورٗا ٢١\n                                        \n                                        \n                                        \n                                        فظنوا { أَنْ لَنْ يَنْقَلِبَ الرَّسُولُ وَالْمُؤْمِنُونَ إِلَى أَهْلِيهِمْ أَبَدًا } أي: إنهم سيقتلون ويستأصلون، ولم يزل هذا الظن يزين في قلوبهم، ويطمئنون إليه، حتى استحكم، وسبب ذلك أمران:\nأحدها: أنهم كانوا { قَوْمًا بُورًا } أي: هلكى، لا خير فيهم، فلو كان فيهم خير لم يكن هذا في قلوبهم.\n                                    "
    }
  },
  {
    "id": 12,
    "versesNumber": 13,
    "souraName": "Al-Fath.html",
    "contnent": "وَمَن لَّمۡ يُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّآ أَعۡتَدۡنَا لِلۡكَٰفِرِينَ سَعِيرٗا ٣١",
    "tafsier": {
      "ibnkther": "وَمَن لَّمۡ يُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّآ أَعۡتَدۡنَا لِلۡكَٰفِرِينَ سَعِيرٗا ٣١\n                                    \n                                    \n                                    ثم قال : ( ومن لم يؤمن بالله ورسوله ) أي : من لم يخلص العمل في الظاهر والباطن لله ، فإن الله تعالى سيعذبه في السعير ، وإن أظهر للناس ما يعتقدون خلاف ما هو عليه في نفس الأمر .\n                                    ",
      "qortoby": "وَمَن لَّمۡ يُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّآ أَعۡتَدۡنَا لِلۡكَٰفِرِينَ سَعِيرٗا ٣١\n                                    \n                                    \n                                    قوله تعالى : ومن لم يؤمن بالله ورسوله فإنا أعتدنا للكافرين سعيرا .\nوعيد لهم ، وبيان أنهم كفروا بالنفاق .\n                                    ",
      "saadi": "وَمَن لَّمۡ يُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّآ أَعۡتَدۡنَا لِلۡكَٰفِرِينَ سَعِيرٗا ٣١\n                                        \n                                        \n                                        \n                                        الثاني: ضعف إيمانهم ويقينهم بوعد الله، ونصر دينه، وإعلاء كلمته، ولهذا قال: { وَمَنْ لَمْ يُؤْمِنْ بِاللَّهِ وَرَسُولِهِ } أي: فإنه كافر مستحق للعقاب، { فَإِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَعِيرًا }\n                                    "
    }
  },
  {
    "id": 13,
    "versesNumber": 14,
    "souraName": "Al-Fath.html",
    "contnent": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٤١",
    "tafsier": {
      "ibnkther": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٤١\n                                    \n                                    \n                                    ثم بين تعالى أنه الحاكم المالك المتصرف في أهل السماوات والأرض : ( يغفر لمن يشاء ويعذب من يشاء وكان الله غفورا رحيما ) أي : لمن تاب إليه وأناب ، وخضع لديه .\n                                    ",
      "qortoby": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٤١\n                                    \n                                    \n                                    قوله تعالى : ولله ملك السماوات والأرض يغفر لمن يشاء ويعذب من يشاء وكان الله غفورا رحيما .\nأي هو غني عن عباده ، وإنما ابتلاهم بالتكليف ليثيب من آمن ويعاقب من كفر وعصى .\n                                    ",
      "saadi": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٤١\n                                        \n                                        \n                                        \n                                        أي: هو تعالى المنفرد بملك السماوات والأرض، يتصرف فيهما بما يشاء من الأحكام القدرية، والأحكام الشرعية، والأحكام الجزائية، ولهذا ذكر حكم الجزاء المرتب على الأحكام الشرعية، فقال: { يَغْفِرُ لِمَنْ يَشَاءُ } وهو من قام بما أمره الله به { وَيُعَذِّبُ مَنْ يَشَاءُ } ممن تهاون بأمر الله، { وَكَانَ اللَّهُ غَفُورًا رَحِيمًا } أي: وصفه اللازم الذي لا ينفك عنه المغفرة والرحمة، فلا يزال في جميع الأوقات يغفر للمذنبين، ويتجاوز عن الخطائين، ويتقبل توبة التائبين، وينزل خيره المدرار، آناء الليل والنهار.\n                                    "
    }
  },
  {
    "id": 14,
    "versesNumber": 15,
    "souraName": "Al-Fath.html",
    "contnent": "سَيَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ يُرِيدُونَ أَن يُبَدِّلُواْ كَلَٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَٰلِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَيَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُواْ لَا يَفۡقَهُونَ إِلَّا قَلِيلٗا ٥١",
    "tafsier": {
      "ibnkther": "سَيَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ يُرِيدُونَ أَن يُبَدِّلُواْ كَلَٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَٰلِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَيَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُواْ لَا يَفۡقَهُونَ إِلَّا قَلِيلٗا ٥١\n                                    \n                                    \n                                    يقول تعالى مخبرا عن الأعراب الذين تخلفوا عن النبي - صلى الله عليه وسلم - في غزوة الحديبية ، إذ ذهب النبي - صلى الله عليه وسلم - وأصحابه إلى خيبر يفتتحونها : أنهم يسألون أن يخرجوا معهم إلى المغنم ، وقد تخلفوا عن وقت محاربة الأعداء ومجالدتهم ومصابرتهم ، فأمر الله رسوله - صلى الله عليه وسلم - ألا يأذن لهم في ذلك ، معاقبة لهم من جنس ذنبهم . فإن الله تعالى قد وعد أهل الحديبية بمغانم خيبر وحدهم لا يشركهم فيها غيرهم من الأعراب المتخلفين ، فلا يقع غير ذلك شرعا وقدرا ; ولهذا قال : ( يريدون أن يبدلوا كلام الله )\nقال مجاهد ، وقتادة ، وجويبر : وهو الوعد الذي وعد به أهل الحديبية . واختاره ابن جرير .\nوقال ابن زيد : هو قوله : ( فإن رجعك الله إلى طائفة منهم فاستأذنوك للخروج فقل لن تخرجوا معي أبدا ولن تقاتلوا معي عدوا إنكم رضيتم بالقعود أول مرة فاقعدوا مع الخالفين ) [ التوبة : 83 ] .\nوهذا الذي قاله ابن زيد فيه نظر ; لأن هذه الآية التي في \" براءة \" نزلت في غزوة تبوك ، وهي متأخرة عن غزوة الحديبية .\nوقال ابن جريج : ( يريدون أن يبدلوا كلام الله ) يعني : بتثبيطهم المسلمين عن الجهاد .\n( قل لن تتبعونا كذلكم قال الله من قبل ) أي : وعد الله أهل الحديبية قبل سؤالكم الخروج معهم ، ( فسيقولون بل تحسدوننا ) أي : أن نشرككم في المغانم ، ( بل كانوا لا يفقهون إلا قليلا ) أي : ليس الأمر كما زعموا ، ولكن لا فهم لهم .\n                                    ",
      "qortoby": "سَيَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ يُرِيدُونَ أَن يُبَدِّلُواْ كَلَٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَٰلِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَيَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُواْ لَا يَفۡقَهُونَ إِلَّا قَلِيلٗا ٥١\n                                    \n                                    \n                                    قوله تعالى : سيقول المخلفون إذا انطلقتم إلى مغانم لتأخذوها ذرونا نتبعكم يريدون أن يبدلوا كلام الله قل لن تتبعونا كذلكم قال الله من قبل فسيقولون بل تحسدوننا بل كانوا لا يفقهون إلا قليلا .\nقوله تعالى : سيقول المخلفون إذا انطلقتم إلى مغانم لتأخذوها يعني مغانم خيبر ; لأن الله - عز وجل - وعد أهل الحديبية فتح خيبر ، وأنها لهم خاصة من غاب منهم ومن حضر . ولم يغب منهم عنها غير جابر بن عبد الله فقسم له رسول الله - صلى الله عليه وسلم - كسهم من حضر . قال ابن إسحاق : وكان المتولي للقسمة بخيبر جبار بن صخر الأنصاري من بني سلمة ، وزيد بن ثابت من بني النجار ، كانا حاسبين قاسمين . ذرونا نتبعكم أي دعونا . تقول : ذره ، أي : دعه . وهو يذره ، أي : يدعه . وأصله وذره يذره مثال وسعه يسعه . وقد أميت صدره ، لا يقال : وذره ولا واذر ، ولكن تركه وهو تارك . قال مجاهد : تخلفوا عن الخروج إلى مكة ، فلما خرج النبي - صلى الله عليه وسلم - وأخذ قوما ووجه بهم قالوا ذرونا نتبعكم فنقاتل معكم .\nيريدون أن يبدلوا كلام الله أي يغيروا . قال ابن زيد : هو قوله تعالى : فاستأذنوك للخروج فقل لن تخرجوا معي أبدا ولن تقاتلوا معي عدوا الآية . وأنكر هذا القول الطبري وغيره ، بسبب أن غزوة تبوك كانت بعد فتح خيبر وبعد فتح مكة . وقيل : المعنى يريدون أن يغيروا وعد الله الذي وعد لأهل الحديبية ، وذلك أن الله تعالى جعل لهم غنائم خيبر عوضا عن فتح مكة إذ رجعوا من الحديبية على صلح ، قاله مجاهد وقتادة ، واختاره الطبري وعليه عامة أهل التأويل . وقرأ حمزة والكسائي ( كلم ) بإسقاط الألف وكسر اللام ، جمع كلمة ، نحو سلمة وسلم . الباقون ( كلام ) على المصدر . واختاره أبو عبيد وأبو حاتم ، واختارا بقوله : إني اصطفيتك على الناس برسالاتي وبكلامي . والكلام : ما استقل بنفسه من الجمل . قال الجوهري : الكلام اسم جنس يقع على القليل والكثير . والكلم لا يكون أقل من ثلاث كلمات لأنه جمع كلمة ، مثل نبقة ونبق . ولهذا قال سيبويه : ( هذا باب علم ما الكلم من العربية ) ولم يقل ما الكلام ; لأنه أراد نفس ثلاثة أشياء : الاسم ، والفعل ، والحرف ، فجاء بما لا يكون إلا جمعا ، وترك ما يمكن أن يقع على الواحد والجماعة . وتميم تقول : هي كلمة ، بكسر الكاف ، وقد مضى في ( براءة ) القول فيها .\n( كذلكم قال الله من قبل ) أي من قبل رجوعنا من الحديبية إن غنيمة خيبر لمن شهد الحديبية خاصة . فسيقولون بل تحسدوننا أن نصيب معكم من الغنائم . وقيل : قال رسول الله - صلى الله عليه وسلم - ، [ إن خرجتم لم أمنعكم إلا أنه لا سهم لكم ] . فقالوا : هذا حسد . فقال المسلمون : قد أخبرنا الله في الحديبية بما سيقولونه وهو قوله تعالى : فسيقولون بل تحسدوننا بل كانوا لا يفقهون إلا قليلا يعني لا يعلمون إلا أمر الدنيا . وقيل : لا يفقهون من أمر الدين إلا قليلا ، وهو ترك القتال .\n                                    ",
      "saadi": "سَيَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ يُرِيدُونَ أَن يُبَدِّلُواْ كَلَٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَٰلِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَيَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُواْ لَا يَفۡقَهُونَ إِلَّا قَلِيلٗا ٥١\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى المخلفين وذمهم، ذكر أن من عقوبتهم الدنيوية، أن رسول الله صلى الله عليه وسلم وأصحابه إذا انطلقوا إلى غنائم لا قتال فيها ليأخذوها، طلبوا منهم الصحبة والمشاركة، ويقولون: { ذَرُونَا نَتَّبِعْكُمْ يُرِيدُونَ } بذلك { أَنْ يُبَدِّلُوا كَلَامَ اللَّهِ } حيث حكم بعقوبتهم، واختصاص الصحابة المؤمنين بتلك الغنائم، شرعا وقدرا. { قُلْ } لهم { لَنْ تَتَّبِعُونَا كَذَلِكُمْ قَالَ اللَّهُ مِنْ قَبْلُ } إنكم محرومون منها بما جنيتم على أنفسكم، وبما تركتم القتال أول مرة.\n{ فَسَيَقُولُونَ } مجيبين لهذا الكلام، الذي منعوا به عن الخروج: { بَلْ تَحْسُدُونَنَا } على الغنائم، هذا منتهى علمهم في هذا الموضع، ولو فهموا رشدهم، لعلموا أن حرمانهم بسبب عصيانهم، وأن المعاصي لها عقوبات دنيوية ودينية، ولهذا قال: { بَلْ كَانُوا لَا يَفْقَهُونَ إِلَّا قَلِيلًا }\n                                    "
    }
  },
  {
    "id": 15,
    "versesNumber": 16,
    "souraName": "Al-Fath.html",
    "contnent": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا ٦١",
    "tafsier": {
      "ibnkther": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا ٦١\n                                    \n                                    \n                                    اختلف المفسرون في هؤلاء القوم الذين يدعون إليهم ، الذين هم أولو بأس شديد ، على أقوال :\nأحدها : أنهم هوازن . رواه شعبة عن أبي بشر ، عن سعيد بن جبير - أو عكرمة ، أو جميعا - ورواه هشيم عن أبي بشر ، عنهما . وبه يقول قتادة في رواية عنه .\nالثاني : ثقيف ، قاله الضحاك .\nالثالث : بنو حنيفة ، قاله جويبر . ورواه محمد بن إسحاق ، عن الزهري . وروي مثله عن سعيد وعكرمة .\nالرابع : هم أهل فارس . رواه علي بن أبي طلحة ، عن ابن عباس ، وبه يقول عطاء ، ومجاهد ، وعكرمة - في إحدى الروايات عنه .\nوقال كعب الأحبار : هم الروم . وعن ابن أبي ليلى ، وعطاء ، والحسن ، وقتادة : هم فارس والروم . وعن مجاهد : هم أهل الأوثان . وعنه أيضا : هم رجال أولو بأس شديد ، ولم يعين فرقة . وبه يقول ابن جريج ، وهو اختيار ابن جرير .\nوقال ابن أبي حاتم : حدثنا الأشج ، حدثنا عبد الرحمن بن الحسن القواريري ، عن معمر ، عن الزهري ، في قوله : ( ستدعون إلى قوم أولي بأس شديد ) قال : لم يأت أولئك بعد .\nوحدثنا أبي ، حدثنا ابن أبي عمر ، حدثنا سفيان ، عن ابن أبي خالد ، عن أبيه ، عن أبي هريرة في قوله : ( ستدعون إلى قوم أولي بأس شديد ) قال : هم البارزون .\nقال : وحدثنا سفيان ، عن الزهري ، عن سعيد بن المسيب ، عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - قال : \" لا تقوم الساعة حتى تقاتلوا قوما صغار الأعين ، ذلف الآنف ، كأن وجوههم المجان المطرقة \" . قال سفيان : هم الترك .\nقال ابن أبي عمر : وجدت في مكان آخر : ابن أبي خالد عن أبيه قال : نزل علينا أبو هريرة ففسر قول رسول الله - صلى الله عليه وسلم - : \" تقاتلون قوما نعالهم الشعر \" قال : هم البارزون ، يعني الأكراد .\nوقوله : ( تقاتلونهم أو يسلمون ) يعني : يشرع لكم جهادهم وقتالهم ، فلا يزال ذلك مستمرا عليهم ، ولكم النصرة عليهم ، أو يسلمون فيدخلون في دينكم بلا قتال بل باختيار .\nثم قال : ( فإن تطيعوا ) أي : تستجيبوا وتنفروا في الجهاد وتؤدوا الذي عليكم فيه ، ( يؤتكم الله أجرا حسنا وإن تتولوا كما توليتم من قبل ) يعني : زمن الحديبية ، حيث دعيتم فتخلفتم ، ( يعذبكم عذابا أليما )\n                                    ",
      "qortoby": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا ٦١\n                                    \n                                    \n                                    قوله تعالى : قل للمخلفين من الأعراب ستدعون إلى قوم أولي بأس شديد تقاتلونهم أو يسلمون فإن تطيعوا يؤتكم الله أجرا حسنا وإن تتولوا كما توليتم من قبل يعذبكم عذابا أليما .\nفيه أربع مسائل : الأولى : قوله تعالى : قل للمخلفين من الأعراب أي قل لهؤلاء الذين تخلفوا عن الحديبية . ستدعون إلى قوم أولي بأس شديد قال ابن عباس وعطاء بن أبي رباح ومجاهد وابن أبي ليلى وعطاء الخراساني : هم فارس . وقال كعب والحسن وعبد الرحمن بن أبي ليلى : الروم . وعن الحسن أيضا : فارس والروم . وقال ابن جبير : هوازن وثقيف . وقال عكرمة : هوازن . وقال قتادة : هوازن وغطفان يوم حنين . وقال الزهري ومقاتل : بنو حنيفة أهل اليمامة أصحاب مسيلمة . وقال رافع بن خديج : والله لقد كنا نقرأ هذه الآية فيما مضى ستدعون إلى قوم أولي بأس شديد فلا نعلم من هم حتى دعانا أبو بكر إلى قتال بني حنيفة فعلمنا أنهم هم . وقال أبو هريرة : لم تأت هذه الآية بعد . وظاهر الآية يرده .\nالثانية : في هذه الآية دليل على صحة إمامة أبي بكر وعمر - رضي الله عنهما - ; لأن أبا بكر دعاهم إلى قتال بني حنيفة ، وعمر دعاهم إلى قتال فارس والروم . وأما قول عكرمة وقتادة إن ذلك في هوازن وغطفان يوم حنين فلا ; لأنه يمتنع أن يكون الداعي لهم الرسول - عليه السلام - ; لأنه قال : لن تخرجوا معي أبدا ولن تقاتلوا معي عدوا فدل على أن المراد بالداعي غير النبي - صلى الله عليه وسلم - . ومعلوم أنه لم يدع هؤلاء القوم بعد النبي - صلى الله عليه وسلم - إلا أبو بكر وعمر - رضي الله عنهما - . الزمخشري : فإن صح ذلك عن قتادة فالمعنى لن تخرجوا معي أبدا ما دمتم على ما أنتم عليه من مرض القلوب والاضطراب في الدين . أو على قول مجاهد كان الموعد أنهم لا يتبعون رسول الله - صلى الله عليه وسلم - إلا متطوعين لا نصيب لهم في المغنم . والله أعلم .\nالثالثة : قوله تعالى : تقاتلونهم أو يسلمون هذا حكم من لا تؤخذ منهم الجزية ، وهو معطوف على تقاتلونهم أي : يكون أحد الأمرين : إما المقاتلة وإما الإسلام ، لا ثالث لهما . وفي حرف أبي ( أو يسلموا ) بمعنى حتى يسلموا ، كما تقول : كل أو تشبع ، أي : حتى تشبع . قال [ امرؤ القيس ] :\nفقلت له لا تبك عينك إنما نحاول ملكا أو نموت فنعذرا\nوقال الزجاج : قال أو يسلمون لأن المعنى أو هم يسلمون من غير قتال . وهذا في قتال المشركين لا في أهل الكتاب .\nالرابعة : قوله تعالى : فإن تطيعوا يؤتكم الله أجرا حسنا الغنيمة والنصر في الدنيا ، والجنة في الآخرة . وإن تتولوا كما توليتم من قبل عام الحديبية . يعذبكم عذابا أليما وهو عذاب النار .\n                                    ",
      "saadi": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا ٦١\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى أن المخلفين من الأعراب يتخلفون عن الجهاد في سبيله، ويعتذرون بغير عذر، وأنهم يطلبون الخروج معهم إذا لم يكن شوكة ولا قتال، بل لمجرد الغنيمة، قال تعالى ممتحنا لهم: { قُلْ لِلْمُخَلَّفِينَ مِنَ الْأَعْرَابِ سَتُدْعَوْنَ إِلَى قَوْمٍ أُولِي بَأْسٍ شَدِيدٍ } أي: سيدعوكم الرسول ومن ناب منابه من الخلفاء الراشدين والأئمة، وهؤلاء القوم فارس والروم ومن نحا نحوهم وأشبههم. { تُقَاتِلُونَهُمْ أَوْ يُسْلِمُونَ } أي: إما هذا وإما هذا، وهذا هو الأمر الواقع، فإنهم في حال قتالهم ومقاتلتهم لأولئك الأقوام، إذ كانت شدتهم وبأسهم معهم، فإنهم في تلك الحال لا يقبلون أن يبذلوا الجزية، بل إما أن يدخلوا في الإسلام، وإما أن يقاتلوا على ما هم عليه، فلما أثخنهم المسلمون، وضعفوا وذلوا، ذهب بأسهم، فصاروا إما أن يسلموا، وإما أن يبذلوا الجزية، { فَإِنْ تُطِيعُوا } الداعي لكم إلى قتال هؤلاء { يُؤْتِكُمُ اللَّهُ أَجْرًا حَسَنًا } وهو الأجر الذي رتبه الله ورسوله على الجهاد في سبيل الله، { وَإِنْ تَتَوَلَّوْا كَمَا تَوَلَّيْتُمْ مِنْ قَبْلُ } عن قتال من دعاكم الرسول إلى قتاله، { يُعَذِّبْكُمْ عَذَابًا أَلِيمًا } ودلت هذه الآية على فضيلة الخلفاء الراشدين، الداعين لجهاد أهل البأس من الناس، وأنه تجب طاعتهم في ذلك.\n                                    "
    }
  },
  {
    "id": 16,
    "versesNumber": 17,
    "souraName": "Al-Fath.html",
    "contnent": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا ٧١",
    "tafsier": {
      "ibnkther": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا ٧١\n                                    \n                                    \n                                    ثم ذكر الأعذار في ترك الجهاد ، فمنها لازم كالعمى والعرج المستمر ، وعارض كالمرض الذي يطرأ أياما ثم يزول ، فهو في حال مرضه ملحق بذوي الأعذار اللازمة حتى يبرأ .\nثم قال تعالى مرغبا في الجهاد وطاعة الله ورسوله : ( ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار ومن يتول ) أي : ينكل عن الجهاد ، ويقبل على المعاش ( يعذبه عذابا أليما ) في الدنيا بالمذلة ، وفي الآخرة بالنار .\n                                    ",
      "qortoby": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا ٧١\n                                    \n                                    \n                                    قوله تعالى : ليس على الأعمى حرج ولا على الأعرج حرج ولا على المريض حرج ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار ومن يتول يعذبه عذابا أليما .\nقال ابن عباس : لما نزلت : وإن تتولوا كما توليتم من قبل يعذبكم عذابا أليما قال أهل الزمانة : كيف بنا يا رسول الله ؟ فنزلت ليس على الأعمى حرج ولا على الأعرج حرج ولا على المريض حرج أي : لا إثم عليهم في التخلف عن الجهاد لعماهم وزمانتهم وضعفهم . وقد مضى في ( براءة ) وغيرها الكلام فيه مبينا . والعرج : آفة تعرض لرجل واحدة ، وإذا كان ذلك مؤثرا فخلل الرجلين أولى أن يؤثر . وقال مقاتل : هم أهل الزمانة الذين تخلفوا عن الحديبية وقد عذرهم . أي : من شاء أن يسير منهم معكم إلى خيبر فليفعل .\nومن يطع الله ورسوله فيما أمره . يدخله جنات تجري من تحتها الأنهار قرأ نافع وابن عامر ( ندخله ) بالنون على التعظيم . الباقون بالياء ، واختاره أبو عبيد وأبو حاتم لتقدم اسم الله أولا . ومن يتول يعذبه عذابا أليما\n                                    ",
      "saadi": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا ٧١\n                                        \n                                        \n                                        \n                                        ثم ذكر الأعذار التي يعذر بها العبد عن الخروج إلى الجهاد، فقال: { لَيْسَ عَلَى الْأَعْمَى حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ } أي: في التخلف عن الجهاد لعذرهم المانع.\n{ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ } في امتثال أمرهما، واجتناب نهيهما { يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ } فيها ما تشتهيه الأنفس، وتلذ الأعين، { وَمَنْ يَتَوَلَّ } عن طاعة الله ورسوله { يُعَذِّبْهُ عَذَابًا أَلِيمًا } فالسعادة كلها في طاعة الله، والشقاوة في معصيته ومخالفته.\n                                    "
    }
  },
  {
    "id": 17,
    "versesNumber": 18,
    "souraName": "Al-Fath.html",
    "contnent": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا ٨١",
    "tafsier": {
      "ibnkther": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا ٨١\n                                    \n                                    \n                                    يخبر تعالى عن رضاه عن المؤمنين الذين بايعوا رسول الله - صلى الله عليه وسلم - تحت الشجرة ، وقد تقدم ذكر عدتهم ، وأنهم كانوا ألفا وأربعمائة ، وأن الشجرة كانت سمرة بأرض الحديبية .\nقال البخاري : حدثنا محمود ، حدثنا عبيد الله ، عن إسرائيل ، عن طارق بن عبد الرحمن قال : انطلقت حاجا فمررت بقوم يصلون ، فقلت ما هذا المسجد ؟ قالوا : هذه الشجرة ، حيث بايع رسول الله - صلى الله عليه وسلم - بيعة الرضوان ، فأتيت سعيد بن المسيب فأخبرته ، فقال سعيد : حدثني أبي أنه كان فيمن بايع رسول الله - صلى الله عليه وسلم - تحت الشجرة . قال : فلما خرجنا من العام المقبل نسيناها فلم نقدر عليها ، فقال سعيد : إن أصحاب محمد - صلى الله عليه وسلم - لم يعلموها وعلمتموها أنتم ، فأنتم أعلم .\nوقوله : ( فعلم ما في قلوبهم ) أي : من الصدق والوفاء ، والسمع والطاعة ، ( فأنزل السكينة ) : وهي الطمأنينة ، ( عليهم وأثابهم فتحا قريبا ) : وهو ما أجرى الله على أيديهم من الصلح بينهم وبين أعدائهم ، وما حصل بذلك من الخير العام المستمر المتصل بفتح خيبر وفتح مكة ، ثم فتح سائر البلاد والأقاليم عليهم ، وما حصل لهم من العز والنصر والرفعة في الدنيا والآخرة ; ولهذا قال :\n                                    ",
      "qortoby": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا ٨١\n                                    \n                                    \n                                    قوله تعالى : لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة فعلم ما في قلوبهم فأنزل السكينة عليهم وأثابهم فتحا قريبا\nقوله تعالى : لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة هذه بيعة الرضوان ، وكانت بالحديبية ، وهذا خبر الحديبية على اختصار : وذلك أن النبي - صلى الله عليه وسلم - أقام منصرفه من غزوة بني المصطلق في شوال ، وخرج في ذي القعدة معتمرا ، واستنفر الأعراب الذين حول المدينة فأبطأ عنه أكثرهم ، وخرج النبي - صلى الله عليه وسلم - بمن معه من المهاجرين والأنصار ومن اتبعه من العرب ، وجميعهم نحو ألف وأربعمائة . وقيل : ألف وخمسمائة . وقيل : غير هذا ، على ما يأتي . وساق معه الهدي ، فأحرم رسول الله - صلى الله عليه وسلم - ليعلم الناس أنه لم يخرج لحرب ، فلما بلغ خروجه قريشا خرج جمعهم صادين لرسول الله - صلى الله عليه وسلم - عن المسجد الحرام ودخول مكة ، وإنه إن قاتلهم قاتلوه دون ذلك ، وقدموا خالد بن الوليد في خيل إلى ( كراع الغميم ) فورد الخبر بذلك على رسول الله - صلى الله عليه وسلم - وهو ( بعسفان ) وكان المخبر له بشر بن سفيان الكعبي ، فسلك طريقا يخرج به في ظهورهم ، وخرج إلى الحديبية من أسفل مكة ، وكان دليله فيهم رجل من أسلم ، فلما بلغ ذلك خيل قريش التي مع خالد جرت إلى قريش تعلمهم بذلك ، فلما وصل رسول الله - صلى الله عليه وسلم - إلى الحديبية بركت ناقته - صلى الله عليه وسلم - فقال الناس : خلأت خلأت فقال النبي - صلى الله عليه وسلم - : ما خلأت وما هو لها بخلق ولكن حبسها حابس الفيل عن مكة ، لا تدعوني قريش اليوم إلى خطة يسألوني فيها صلة رحم إلا أعطيتهم إياها . ثم نزل - صلى الله عليه وسلم - هناك ، فقيل : يا رسول الله ، ليس بهذا الوادي ماء فأخرج عليه الصلاة والسلام سهما من كنانته فأعطاه رجلا من أصحابه ، فنزل في قليب من تلك القلب فغرزه في جوفه فجاش بالماء الرواء حتى كفى جميع الجيش . وقيل : إن الذي نزل بالسهم في القليب ناجية بن جندب بن عمير الأسلمي وهو سائق بدن النبي - صلى الله عليه وسلم - يومئذ .\nوقيل : نزل بالسهم في القليب البراء بن عازب ، ثم جرت السفراء بين رسول الله - صلى الله عليه وسلم - وبين كفار قريش ، وطال التراجع والتنازع إلى أن جاء سهيل بن عمرو العامري ، فقاضاه على أن ينصرف - عليه الصلاة والسلام - عامه ذلك ، فإذا كان من قابل أتى معتمرا ودخل هو وأصحابه مكة بغير سلاح ، حاشا السيوف في قربها فيقيم بها ثلاثا ويخرج ، وعلى أن يكون بينه وبينهم صلح عشرة أعوام ، يتداخل فيها الناس ويأمن بعضهم بعضا ، وعلى أن من جاء من الكفار إلى المسلمين مسلما من رجل أو امرأة رد إلى الكفار ، ومن جاء من المسلمين إلى الكفار مرتدا لم يردوه إلى المسلمين ، فعظم ذلك على المسلمين حتى كان لبعضهم فيه كلام ، وكان رسول الله - صلى الله عليه وسلم - أعلم بما علمه الله من أنه سيجعل للمسلمين فرجا ، فقال لأصحابه اصبروا فإن الله يجعل هذا الصلح سببا إلى ظهور دينه فأنس الناس إلى قوله هذا بعد نفار منهم ، وأبى سهيل بن عمرو أن يكتب في صدر صحيفة الصلح : من محمد رسول الله ، وقالوا له : لو صدقناك بذلك ما دفعناك عما تريد فلا بد أن تكتب : باسمك اللهم . فقال لعلي وكان يكتب صحيفة الصلح : امح يا علي ، واكتب باسمك اللهم فأبى علي أن يمحو بيده ( محمد رسول الله ) فقال له رسول الله - صلى الله عليه وسلم - : اعرضه علي فأشار إليه فمحاه رسول الله - صلى الله عليه وسلم - بيده ، وأمره أن يكتب [ من محمد بن عبد الله ] .\nوأتى أبو جندل بن سهيل يومئذ بأثر كتاب الصلح وهو يرسف في قيوده ، فرده رسول الله - صلى الله عليه وسلم - إلى أبيه ، فعظم ذلك على المسلمين ، فأخبرهم رسول الله - صلى الله عليه وسلم - وأخبر أبا جندل [ أن الله سيجعل له فرجا ومخرجا ] . وكان رسول الله - صلى الله عليه وسلم - قبل الصلح قد بعث عثمان بن عفان إلى مكة رسولا ، فجاء خبر إلى رسول الله - صلى الله عليه وسلم - بأن أهل مكة قتلوه ، فدعا رسول الله - صلى الله عليه وسلم - حينئذ إلى المبايعة له على الحرب والقتال لأهل مكة ، فروي أنه بايعهم على الموت . وروي أنه بايعهم على ألا يفروا . وهي بيعة الرضوان تحت الشجرة ، التي أخبر الله تعالى أنه رضي عن المبايعين لرسول الله - صلى الله عليه وسلم - تحتها . وأخبر رسول الله - صلى الله عليه وسلم - أنهم لا يدخلون النار . وضرب رسول الله - صلى الله عليه وسلم - بيمينه في شماله لعثمان ، فهو كمن شهدها . وذكر وكيع عن إسماعيل بن أبي خالد عن الشعبي قال : أول من بايع رسول الله - صلى الله عليه وسلم - يوم الحديبية أبو سفيان الأسدي . وفي صحيح مسلم عن أبي الزبير عن جابر قال : كنا يوم الحديبية ألفا وأربعمائة ، فبايعناه وعمر آخذ بيده تحت الشجرة وهي سمرة ، وقال : بايعناه على ألا نفر ولم نبايعه على الموت وعنه أنه سمع جابرا يسأل : كم كانوا يوم الحديبية ؟ قال : كنا أربع عشرة مائة ، فبايعناه وعمر آخذ بيده تحت الشجرة وهي سمرة ، فبايعناه ، غير جد بن قيس الأنصاري اختبأ تحت بطن بعيره . وعن سالم بن أبي الجعد قال : سألت جابر بن عبد الله عن أصحاب الشجرة . فقال : لو كنا مائة ألف لكفانا ، كنا ألفا وخمسمائة . وفي رواية : كنا خمس عشرة مائة . وعن عبد الله بن أبي أوفى قال : كان أصحاب الشجرة ألفا وثلاثمائة ، وكانت أسلم ثمن المهاجرين . وعن يزيد بن أبي عبيد قال : قلت لسلمة : على أي شيء بايعتم رسول الله - صلى الله عليه وسلم - يوم الحديبية ؟ قال : على الموت . وعن البراء بن عازب قال : كتب علي - رضي الله عنه - الصلح بين النبي - صلى الله عليه وسلم - وبين المشركين يوم الحديبية ، فكتب : هذا ما كاتب عليه محمد رسول الله - صلى الله عليه وسلم - فقالوا : لا تكتب رسول الله ، فلو نعلم أنك رسول الله لم نقاتلك . فقال النبي - صلى الله عليه وسلم - لعلي : [ امحه ] . فقال : ما أنا بالذي أمحاه ، فمحاه النبي - صلى الله عليه وسلم - بيده . وكان فيما اشترطوا : أن يدخلوا مكة فيقيموا فيها ثلاثا ، ولا يدخلها بسلاح إلا جلبان السلاح . قلت لأبي إسحاق وما جلبان السلاح ؟ قال : القراب وما فيه . وعن أنس : أن قريشا صالحوا النبي - صلى الله عليه وسلم - فيهم سهيل بن عمرو ، فقال النبي - صلى الله عليه وسلم - لعلي : [ اكتب بسم الله الرحمن الرحيم ] فقال سهيل بن عمرو : أما بسم الله ، فما ندري ما بسم الله الرحمن الرحيم ولكن اكتب ما نعرف : باسمك اللهم . فقال : [ اكتب من محمد رسول الله ] قالوا : لو علمنا أنك رسوله لاتبعناك ولكن اكتب اسمك واسم أبيك . فقال النبي - صلى الله عليه وسلم - : [ اكتب من محمد بن عبد الله ] فاشترطوا على النبي - صلى الله عليه وسلم - : أن من جاء منكم لم نرده عليكم ، ومن جاءكم منا رددتموه علينا . فقالوا : يا رسول الله ، أنكتب هذا قال : [ نعم إنه من ذهب منا إليهم فأبعده الله ومن جاءنا منهم فسيجعل الله له فرجا ومخرجا ] .\nوعن أبي وائل قال : قام سهل بن حنيف يوم صفين فقال يا أيها الناس ، اتهموا أنفسكم ، لقد كنا مع رسول الله - صلى الله عليه وسلم - يوم الحديبية ولو نرى قتالا لقاتلنا ، وذلك في الصلح الذي كان بين رسول الله - صلى الله عليه وسلم - وبين المشركين . فجاء عمر بن الخطاب - - رضي الله عنه - فأتى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله ، ألسنا على حق وهم على باطل ؟ قال [ بلى ] قال : أليس قتلانا في الجنة وقتلاهم في النار ؟ قال [ بلى ] قال ففيم نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا وبينهم ؟ فقال [ يا بن الخطاب إني رسول الله ولن يضيعني الله أبدا ] قال : فانطلق عمر ، فلم يصبر متغيظا فأتى أبا بكر فقال : يا أبا بكر ، ألسنا على حق وهم على باطل ؟ قال بلى ، قال : أليس قتلانا في الجنة وقتلاهم في النار ؟ قال بلى . قال : فعلام نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا وبينهم ؟ فقال : يا بن الخطاب ، إنه رسول الله ولن يضيعه الله أبدا . قال : فنزل القرآن على رسول الله - صلى الله عليه وسلم - بالفتح ، فأرسل إلى عمر فأقرأه إياه ، فقال : يا رسول الله ، أوفتح هو ؟ قال [ نعم ] . فطابت نفسه ورجع .\nقوله تعالى : فعلم ما في قلوبهم من الصدق والوفاء ، قاله الفراء . وقال ابن جريج وقتادة : من الرضا بأمر البيعة على ألا يفروا . وقال مقاتل : من كراهة البيعة على أن يقاتلوا معه على الموت . فأنزل السكينة عليهم حتى بايعوا . وقيل : فعلم ما في قلوبهم من الكآبة بصد المشركين إياهم وتخلف رؤيا النبي - صلى الله عليه وسلم - عنهم ، إذ رأى أنه يدخل الكعبة ، حتى قال رسول الله - صلى الله عليه وسلم - : [ إنما ذلك رؤيا منام ] . وقال الصديق : لم يكن فيها الدخول في هذا العام .\nوالسكينة : الطمأنينة وسكون النفس إلى صدق الوعد . وقيل : الصبر . وأثابهم فتحا قريبا قال قتادة وابن أبي ليلى : فتح خيبر . وقيل : فتح مكة . وقرئ ( وآتاهم )\n                                    ",
      "saadi": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا ٨١\n                                        \n                                        \n                                        \n                                        يخبر تعالى بفضله ورحمته، برضاه عن المؤمنين إذ يبايعون الرسول صلى الله عليه وسلم تلك المبايعة التي بيضت وجوههم، واكتسبوا بها سعادة الدنيا والآخرة، وكان سبب هذه البيعة -التي يقال لها \"بيعة الرضوان\" لرضا الله عن المؤمنين فيها، ويقال لها \"بيعة أهل الشجرة\" - أن رسول الله صلى الله عليه وسلم لما دار الكلام بينه وبين المشركين يوم الحديبية في شأن مجيئه، وأنه لم يجئ لقتال أحد، وإنما جاء زائرا هذا البيت، معظما له، فبعث رسول الله صلى الله عليه وسلم عثمان بن عفان لمكة في ذلك، فجاء خبر غير صادق، أن عثمان قتله المشركون، فجمع رسول الله صلى الله عليه وسلم من معه من المؤمنين، وكانوا نحوا من ألف وخمسمائة، فبايعوه تحت شجرة على قتال المشركين، وأن لا يفروا حتى يموتوا، فأخبر تعالى أنه رضي عن المؤمنين في تلك الحال، التي هي من أكبر الطاعات وأجل القربات، { فَعَلِمَ مَا فِي قُلُوبِهِمْ } من الإيمان، { فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ } شكرا لهم على ما في قلوبهم، زادهم هدى، وعلم ما في قلوبهم من الجزع من تلك الشروط التي شرطها المشركون على رسوله، فأنزل عليهم السكينة تثبتهم، وتطمئن بها قلوبهم، { وَأَثَابَهُمْ فَتْحًا قَرِيبًا } وهو: فتح خيبر، لم يحضره سوى أهل الحديبية، فاختصوا بخيبر وغنائمها، جزاءا لهم، وشكرا على ما فعلوه من طاعة الله تعالى والقيام بمرضاته.\n                                    "
    }
  },
  {
    "id": 18,
    "versesNumber": 19,
    "souraName": "Al-Fath.html",
    "contnent": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا ٩١",
    "tafsier": {
      "ibnkther": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا ٩١\n                                    \n                                    \n                                    ( ومغانم كثيرة يأخذونها وكان الله عزيزا حكيما )\nقال ابن أبي حاتم : حدثنا أحمد بن محمد بن يحيى بن سعيد القطان ، حدثنا عبيد الله بن موسى ، أخبرنا موسى ، أخبرنا موسى - يعني ابن عبيدة - حدثني إياس بن سلمة ، عن أبيه ، قال : بينما نحن قائلون . إذ نادى منادي رسول الله - صلى الله عليه وسلم - : أيها الناس ، البيعة البيعة ، نزل روح القدس . قال : فثرنا إلى رسول الله - صلى الله عليه وسلم - وهو تحت شجرة سمرة فبايعناه ، فذلك قول الله تعالى : ( لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة ) [ قال ] : فبايع لعثمان بإحدى يديه على الأخرى ، فقال الناس : هنيئا لابن عفان ، طوف بالبيت ونحن هاهنا . فقال رسول الله - صلى الله عليه وسلم - : \" لو مكث كذا كذا سنة ما طاف حتى أطوف \" .\n                                    ",
      "qortoby": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا ٩١\n                                    \n                                    \n                                    ومغانم كثيرة يأخذونها يعني أموال خيبر ، وكانت خيبر ذات عقار وأموال ، وكانت بين الحديبية ومكة . ف ( مغانم ) على هذا بدل من ( فتحا قريبا ) والواو مقحمة . وقيل : ومغانم فارس والروم .\n                                    ",
      "saadi": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا ٩١\n                                        \n                                        \n                                        \n                                        { وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا } أي: له العزة والقدرة، التي قهر بها الأشياء، فلو شاء لانتصر من الكفار في كل وقعة تكون بينهم وبين المؤمنين، ولكنه حكيم، يبتلي بعضهم ببعض، ويمتحن المؤمن بالكافر.\n                                    "
    }
  },
  {
    "id": 19,
    "versesNumber": 20,
    "souraName": "Al-Fath.html",
    "contnent": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٠٢",
    "tafsier": {
      "ibnkther": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٠٢\n                                    \n                                    \n                                    قال مجاهد في قوله : ( وعدكم الله مغانم كثيرة تأخذونها ) : هي جميع المغانم إلى اليوم ، ( فعجل لكم هذه ) يعني : فتح خيبر .\nوروى العوفي عن ابن عباس : ( فعجل لكم هذه ) يعني : صلح الحديبية .\n( وكف أيدي الناس عنكم ) أي : لم ينلكم سوء مما كان أعداؤكم أضمروه لكم من المحاربة والقتال . وكذلك كف أيدي الناس [ عنكم ] الذين خلفتموهم وراء أظهركم عن عيالكم وحريمكم ، ( ولتكون آية للمؤمنين ) أي : يعتبرون بذلك ، فإن الله حافظهم وناصرهم على سائر الأعداء ، مع قلة عددهم ، وليعلموا بصنيع الله هذا بهم أنه العليم بعواقب الأمور ، وأن الخيرة فيما يختاره لعباده المؤمنين وإن كرهوه في الظاهر ، كما قال : ( وعسى أن تكرهوا شيئا وهو خير لكم ) [ البقرة : 216 ] .\n( ويهديكم صراطا مستقيما ) أي : بسبب انقيادكم لأمره واتباعكم طاعته ، وموافقتكم رسوله .\n                                    ",
      "qortoby": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٠٢\n                                    \n                                    \n                                    قوله تعالى : وعدكم الله مغانم كثيرة تأخذونها قال ابن عباس ومجاهد . إنها المغانم التي تكون إلى يوم القيامة . وقال ابن زيد : هي مغانم خيبر . فعجل لكم هذه أي خيبر ، قاله مجاهد . وقال ابن عباس : عجل لكم صلح الحديبية . وكف أيدي الناس عنكم يعني أهل مكة ، كفهم عنكم بالصلح . وقال قتادة : كف أيدي اليهود عن المدينة بعد خروج النبي - صلى الله عليه وسلم - إلى الحديبية وخيبر . وهو اختيار الطبري ; لأن كف أيدي المشركين بالحديبية مذكور في قوله : وهو الذي كف أيديهم عنكم . وقال ابن عباس : في كف أيدي الناس عنكم يعني عيينة بن حصن الفزاري وعوف بن مالك النضري ومن كان معهما ، إذ جاءوا لينصروا أهل خيبر والنبي - صلى الله عليه وسلم - محاصر لهم ، فألقى الله - عز وجل - في قلوبهم الرعب وكفهم عن المسلمين ولتكون آية للمؤمنين أي ولتكون هزيمتهم وسلامتكم آية للمؤمنين ، فيعلموا أن الله يحرسهم في مشهدهم ومغيبهم . وقيل : أي : لتكون كف أيديهم عنكم آية للمؤمنين . وقيل : أي : ولتكون هذه التي عجلها لكم آية للمؤمنين على صدقك حيث وعدتهم أن يصيبوها . والواو في ( ولتكون ) مقحمة عند الكوفيين . وقال البصريون : عاطفة على مضمر ، أي : وكف أيدي الناس عنكم لتشكروه ولتكون آية للمؤمنين . ويهديكم صراطا مستقيما أي يزيدكم هدى ، أو يثبتكم على الهداية .\n                                    ",
      "saadi": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٠٢\n                                        \n                                        \n                                        \n                                        { وَعَدَكُمُ اللَّهُ مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا } وهذا يشمل كل غنيمة غنمها المسلمين إلى يوم القيامة، { فَعَجَّلَ لَكُمْ هَذِهِ } أي: غنيمة خيبر أي: فلا تحسبوها وحدها، بل ثم شيء كثير من الغنائم سيتبعها، { و } احمدوا الله إذ { كف أَيْدِي النَّاسِ } القادرين على قتالكم، الحريصين عليه { عَنْكُمْ } فهي نعمة، وتخفيف عنكم.\n{ وَلِتَكُونَ } هذه الغنيمة { آيَةً لِلْمُؤْمِنِينَ } يستدلون بها على خبر الله الصادق، ووعده الحق، وثوابه للمؤمنين، وأن الذي قدرها سيقدر غيرها، { وَيَهْدِيَكُمْ } بما يقيض لكم من الأسباب { صِرَاطًا مُسْتَقِيمًا } من العلم والإيمان والعمل.\n                                    "
    }
  },
  {
    "id": 20,
    "versesNumber": 21,
    "souraName": "Al-Fath.html",
    "contnent": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ١٢",
    "tafsier": {
      "ibnkther": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ١٢\n                                    \n                                    \n                                    وقوله : ( وأخرى لم تقدروا عليها قد أحاط الله بها وكان الله على كل شيء قديرا ) أي : وغنيمة أخرى وفتحا آخر معينا لم تكونوا تقدرون عليها ، قد يسرها الله عليكم ، وأحاط بها لكم ، فإنه تعالى يرزق عباده المتقين له من حيث لا يحتسبون .\nوقد اختلف المفسرون في هذه الغنيمة ، ما المراد بها ؟ فقال العوفي عن ابن عباس : هي خيبر . وهذا على قوله في قوله تعالى : ( فعجل لكم هذه ) إنها صلح الحديبية . وقاله الضحاك ، وابن إسحاق ، وعبد الرحمن بن زيد بن أسلم .\nوقال قتادة : هي مكة . واختاره ابن جرير .\nوقال ابن أبي ليلى ، والحسن البصري : هي فارس والروم .\nوقال مجاهد : هي كل فتح وغنيمة إلى يوم القيامة .\nوقال أبو داود الطيالسي : حدثنا شعبة ، عن سماك الحنفي ، عن ابن عباس : ( وأخرى لم تقدروا عليها قد أحاط الله بها ) قال : هذه الفتوح التي تفتح إلى اليوم .\n                                    ",
      "qortoby": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ١٢\n                                    \n                                    \n                                    قوله تعالى : وأخرى لم تقدروا عليها قد أحاط الله بها وكان الله على كل شيء قديرا .\nقوله تعالى : ( وأخرى ) أخرى معطوفة على هذه ، أي : فعجل لكم هذه المغانم ومغانم أخرى . لم تقدروا عليها قد أحاط الله بها قال ابن عباس : هي الفتوح التي فتحت على المسلمين ، كأرض فارس والروم ، وجميع ما فتحه المسلمون . وهو قول الحسن ومقاتل وابن أبي ليلى . وعن ابن عباس أيضا والضحاك وابن زيد وابن إسحاق : هي خيبر ، وعدها الله نبيه قبل أن يفتحها ، ولم يكونوا يرجونها حتى أخبرهم الله بها . وعن الحسن أيضا وقتادة : هو فتح مكة . وقال عكرمة : حنين ; لأنه قال : لم تقدروا عليها وهذا يدل على تقدم محاولة لها وفوات درك المطلوب في الحال كما كان في مكة ، قاله القشيري . وقال مجاهد : هي ما يكون إلى يوم القيامة . ومعنى قد أحاط الله بها : أي : أعدها لكم . فهي كالشيء الذي قد أحيط به من جوانبه ، فهو محصور لا يفوت ، فأنتم وإن لم تقدروا عليها في الحال فهي محبوسة عليكم لا تفوتكم . وقيل : أحاط الله بها علم أنها ستكون لكم ، كما قال : وأن الله قد أحاط بكل شيء علما . وقيل : حفظها الله عليكم . ليكون فتحها لكم . وكان الله على كل شيء قديرا\n\n                                    ",
      "saadi": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ١٢\n                                        \n                                        \n                                        \n                                        { وَأُخْرَى } أي: وعدكم أيضا غنيمة أخرى { لَمْ تَقْدِرُوا عَلَيْهَا } وقت هذا الخطاب، { قَدْ أَحَاطَ اللَّهُ بِهَا } أي: هو قادر عليها، وتحت تدبيره وملكه، وقد وعدكموها، فلا بد من وقوع ما وعد به، لكمال اقتدار الله تعالى، ولهذا قال: { وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرًا }\n                                    "
    }
  },
  {
    "id": 21,
    "versesNumber": 22,
    "souraName": "Al-Fath.html",
    "contnent": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا ٢٢",
    "tafsier": {
      "ibnkther": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا ٢٢\n                                    \n                                    \n                                    وقوله : ( ولو قاتلكم الذين كفروا لولوا الأدبار ثم لا يجدون وليا ولا نصيرا ) يقول تعالى مبشرا لعباده المؤمنين : بأنه لو ناجزهم المشركون لنصر الله رسوله وعباده المؤمنين عليهم ، ولانهزم جيش الكفار فارا مدبرا لا يجدون وليا ولا نصيرا ; لأنهم محاربون لله ولرسوله ولحزبه المؤمنين .\n                                    ",
      "qortoby": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا ٢٢\n                                    \n                                    \n                                    قوله تعالى : ولو قاتلكم الذين كفروا لولوا الأدبار قال قتادة : يعني كفار قريش في الحديبية . وقيل : ولو قاتلكم غطفان وأسد والذين أرادوا نصرة أهل خيبر ، لكانت الدائرة عليهم . ثم لا يجدون وليا ولا نصيرا\n                                    ",
      "saadi": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا ٢٢\n                                        \n                                        \n                                        \n                                        هذه بشارة من الله لعباده المؤمنين، بنصرهم على أعدائهم الكافرين، وأنهم لو قابلوهم وقاتلوهم { لَوَلَّوُا الْأَدْبَارَ ثُمَّ لَا يَجِدُونَ وَلِيًّا } يتولى أمرهم، { وَلَا نَصِيرًا } ينصرهم ويعينهم على قتالكم، بل هم مخذولون مغلوبون.\n                                    "
    }
  },
  {
    "id": 22,
    "versesNumber": 23,
    "souraName": "Al-Fath.html",
    "contnent": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا ٣٢",
    "tafsier": {
      "ibnkther": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا ٣٢\n                                    \n                                    \n                                    ثم قال : ( سنة الله التي قد خلت من قبل ولن تجد لسنة الله تبديلا ) أي : هذه سنة الله وعادته في خلقه ، ما تقابل الكفر والإيمان في موطن فيصل إلى نصر الله الإيمان على الكفر ، فرفع الحق ووضع الباطل ، كما فعل تعالى يوم بدر بأوليائه المؤمنين نصرهم على أعدائه من المشركين ، مع قلة عدد المسلمين وعددهم ، وكثرة المشركين وعددهم .\n                                    ",
      "qortoby": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا ٣٢\n                                    \n                                    \n                                    سنة الله التي قد خلت من قبل يعني طريقة الله وعاداته السالفة نصر أوليائه على أعدائه . وانتصب ( سنة ) على المصدر . وقيل : سنة الله أي : كسنة الله . والسنة الطريقة والسيرة . قال :\nفلا تجزعن من سيرة أنت سرتها فأول راض سنة من يسيرها\nوالسنة أيضا : ضرب من تمر المدينة . ولن تجد لسنة الله تبديلا\n                                    ",
      "saadi": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا ٣٢\n                                        \n                                        \n                                        \n                                        وهذه سنة الله في الأمم السابقة، أن جند الله هم الغالبون، { وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا }\n                                    "
    }
  },
  {
    "id": 23,
    "versesNumber": 24,
    "souraName": "Al-Fath.html",
    "contnent": "وَهُوَ ٱلَّذِي كَفَّ أَيۡدِيَهُمۡ عَنكُمۡ وَأَيۡدِيَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَيۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا ٤٢",
    "tafsier": {
      "ibnkther": "وَهُوَ ٱلَّذِي كَفَّ أَيۡدِيَهُمۡ عَنكُمۡ وَأَيۡدِيَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَيۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا ٤٢\n                                    \n                                    \n                                    وقوله : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم وكان الله بما تعملون بصيرا ) : هذا امتنان من الله على عباده المؤمنين حين كف أيدي المشركين عنهم ، فلم يصل إليهم منهم سوء ، وكف أيدي المؤمنين من المشركين فلم يقاتلوهم عند المسجد الحرام ، بل صان كلا من الفريقين ، وأوجد بينهم صلحا فيه خيرة للمؤمنين ، وعاقبة لهم في الدنيا والآخرة . وقد تقدم في حديث سلمة بن الأكوع حين جاءوا بأولئك السبعين الأسارى فأوثقوهم بين يدي رسول الله - صلى الله عليه وسلم - فنظر إليهم وقال : \" أرسلوهم يكن لهم بدء الفجور وثناه \" . قال : وفي ذلك أنزل الله : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ) الآية .\nوقال الإمام أحمد : حدثنا يزيد بن هارون ، حدثنا حماد ، عن ثابت ، عن أنس بن مالك قال : لما كان يوم الحديبية هبط على رسول الله - صلى الله عليه وسلم - وأصحابه ثمانون رجلا من أهل مكة في السلاح ، من قبل جبل التنعيم ، يريدون غرة رسول الله - صلى الله عليه وسلم - فدعا عليهم فأخذوا - قال عفان : فعفا عنهم - ونزلت هذه الآية : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم )\nورواه مسلم وأبو داود في سننه ، والترمذي والنسائي في التفسير من سننيهما ، من طرق ، عن حماد بن سلمة ، به .\nوقال أحمد - أيضا - : حدثنا زيد بن الحباب ، حدثنا الحسين بن واقد ، حدثنا ثابت البناني ، عن عبد الله بن مغفل المزني قال : كنا مع رسول الله - صلى الله عليه وسلم - في أصل الشجرة التي قال الله تعالى في القرآن ، وكان يقع من أغصان تلك الشجرة على ظهر رسول الله - صلى الله عليه وسلم - وعلي بن أبي طالب وسهل بن عمرو بين يديه ، فقال رسول الله - صلى الله عليه وسلم - لعلي : \" اكتب : بسم الله الرحمن الرحيم \" ، فأخذ سهل بيده وقال : ما نعرف الرحمن الرحيم . اكتب في قضيتنا ما نعرف . قال : \" اكتب باسمك اللهم \" ، وكتب : \" هذا ما صالح عليه محمد رسول الله أهل مكة \" . فأمسك سهل بن عمرو بيده وقال : لقد ظلمناك إن كنت رسوله ، اكتب في قضيتنا ما نعرف . فقال : \" اكتب هذا ما صالح عليه محمد بن عبد الله \" . فبينا نحن كذلك إذ خرج علينا ثلاثون شابا عليهم السلاح ، فثاروا في وجوهنا ، فدعا عليهم رسول الله - صلى الله عليه وسلم - فأخذ الله بأسماعهم ، فقمنا إليهم فأخذناهم ، فقال رسول الله - صلى الله عليه وسلم - : \" هل جئتم في عهد أحد ؟ أو : هل جعل لكم أحد أمانا ؟ \" فقالوا : لا . فخلى سبيلهم ، فأنزل الله : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم وكان الله بما تعملون بصيرا ) . رواه النسائي من حديث حسين بن واقد ، به .\nوقال ابن جرير : حدثنا ابن حميد ، حدثنا يعقوب القمي ، حدثنا جعفر ، عن ابن أبزى قال : لما خرج النبي - صلى الله عليه وسلم - بالهدي وانتهى إلى ذي الحليفة ، قال له عمر : يا نبي الله ، تدخل على قوم لك حرب بغير سلاح ولا كراع ؟ قال : فبعث إلى المدينة ، فلم يدع فيها كراعا ولا سلاحا إلا حمله ، فلما دنا من مكة منعوه أن يدخل ، فسار حتى أتى منى ، فنزل بمنى ، فأتاه عينه أن عكرمة بن أبي جهل قد خرج عليك في خمسمائة ، فقال لخالد بن الوليد : \" يا خالد ، هذا ابن عمك أتاك في الخيل ، فقال خالد : أنا سيف الله ، وسيف رسوله - فيومئذ سمي سيف الله - يا رسول الله ، ارم بي أين شئت . فبعثه على خيل ، فلقي عكرمة في الشعب فهزمه حتى أدخله حيطان مكة ، ثم عاد في الثانية فهزمه حتى أدخله حيطان مكة ، ثم عاد في الثالثة فهزمه حتى أدخله حيطان مكة ، فأنزل الله : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة [ من بعد أن أظفركم عليهم ] ) إلى : ( عذابا أليما ) . قال : فكف الله النبي عنهم من بعد أن أظفره عليهم لبقايا من المسلمين كانوا بقوا فيها كراهية أن تطأهم الخيل .\nورواه ابن أبي حاتم عن ابن أبزى بنحوه . وهذا السياق فيه نظر ; فإنه لا يجوز أن يكون عام الحديبية ; لأن خالدا لم يكن أسلم ; بل قد كان طليعة المشركين يومئذ ، كما ثبت في الصحيح . ولا يجوز أن يكون في عمرة القضاء ، لأنهم قاضوه على أن يأتي من العام المقبل فيعتمر ويقيم بمكة ثلاثة أيام ، فلما قدم لم يمانعوه ، ولا حاربوه ولا قاتلوه . فإن قيل : فيكون يوم الفتح ؟ فالجواب : ولا يجوز أن يكون يوم الفتح ; لأنه لم يسق عام الفتح هديا ، وإنما جاء محاربا مقاتلا في جيش عرمرم ، فهذا السياق فيه خلل ، قد وقع فيه شيء فليتأمل ، والله أعلم .\nوقال ابن إسحاق : حدثني من لا أتهم ، عن عكرمة مولى ابن عباس : أن قريشا بعثوا أربعين رجلا منهم أو خمسين ، وأمروهم أن يطيفوا بعسكر رسول الله - صلى الله عليه وسلم - ليصيبوا من أصحابه أحدا ، فأخذوا أخذا ، فأتي بهم رسول الله - صلى الله عليه وسلم - فعفا عنهم وخلى سبيلهم ، وقد كانوا رموا إلى عسكر رسول الله - صلى الله عليه وسلم - بالحجارة والنبل . قال ابن إسحاق : وفي ذلك أنزل الله : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ) الآية .\nوقال قتادة : ذكر لنا أن رجلا يقال له : \" ابن زنيم \" اطلع على الثنية من الحديبية ، فرماه المشركون بسهم فقتلوه ، فبعث رسول الله - صلى الله عليه وسلم - خيلا فأتوه باثني عشر فارسا من الكفار ، فقال لهم : \" هل لكم علي عهد ؟ هل لكم علي ذمة ؟ \" . قالوا : لا . فأرسلهم ، وأنزل الله في ذلك : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ) الآية .\n                                    ",
      "qortoby": "وَهُوَ ٱلَّذِي كَفَّ أَيۡدِيَهُمۡ عَنكُمۡ وَأَيۡدِيَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَيۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا ٤٢\n                                    \n                                    \n                                    قوله تعالى : وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم وكان الله بما تعملون بصيرا .\nقوله تعالى : وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة وهي الحديبية . من بعد أن أظفركم عليهم روى يزيد بن هارون قال : أخبرنا حماد بن سلمة عن ثابت عن أنس أن ثمانين رجلا من أهل مكة هبطوا على النبي - صلى الله عليه وسلم - من جبل التنعيم متسلحين يريدون غرة النبي - صلى الله عليه وسلم - وأصحابه ، فأخذناهم سلما فاستحييناهم ، فأنزل الله تعالى : وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم وقال عبد الله بن مغفل المزني : كنا مع النبي - صلى الله عليه وسلم - بالحديبية في أصل الشجرة التي قال الله في القرآن ، فبينا نحن كذلك إذ خرج علينا ثلاثون شابا عليهم السلاح فثاروا في وجوهنا فدعا عليهم النبي - صلى الله عليه وسلم - فأخذ الله بأبصارهم ، فقال لهم رسول الله - صلى الله عليه وسلم - : [ هل جئتم في عهد أحد أو هل جعل لكم أحد أمانا ] . قالوا : اللهم لا ، فخلى سبيلهم . فأنزل الله تعالى : وهو الذي كف أيديهم عنكم الآية . وذكر ابن هشام عن وكيع : وكانت قريش قد جاء منهم نحو سبعين رجلا أو ثمانين رجلا للإيقاع بالمسلمين وانتهاز الفرصة في أطرافهم ، ففطن المسلمون لهم فأخذوهم أسرى ، وكان ذلك والسفراء يمشون بينهم في الصلح ، فأطلقهم رسول الله - صلى الله عليه وسلم - ، فهم الذين يسمون العتقاء ، ومنهم معاوية وأبوه . وقال مجاهد : أقبل النبي - صلى الله عليه وسلم - معتمرا ، إذ أخذ أصحابه ناسا من الحرم غافلين فأرسلهم النبي - صلى الله عليه وسلم - ، فذلك الإظفار ببطن مكة . وقال قتادة : ذكر لنا أن رجلا من أصحاب رسول الله - صلى الله عليه وسلم - يقال له زنيم ، اطلع الثنية من الحديبية فرماه المشركون بسهم فقتلوه ، فبعث النبي - صلى الله عليه وسلم - خيلا فأتوا باثني عشر فارسا من الكفار ، فقال لهم النبي - صلى الله عليه وسلم - : [ هل لكم علي ذمة ] قالوا لا ؟ فأرسلهم فنزلت . وقال ابن أبزى والكلبي : هم أهل الحديبية ، كف الله أيديهم عن المسلمين حتى وقع الصلح ، وكانوا خرجوا بأجمعهم وقصدوا المسلمين ، وكف أيدي المسلمين عنهم . وقد تقدم أن خالد بن الوليد كان في خيل المشركين . قال القشيري : فهذه رواية ، والصحيح أنه كان مع النبي - صلى الله عليه وسلم - في ذلك الوقت . وقد قال سلمة بن الأكوع : كانوا في أمر الصلح إذ أقبل أبو سفيان ، فإذا الوادي يسير بالرجال والسلاح ، قال : فجئت بستة من المشركين أسوقهم متسلحين لا يملكون لأنفسهم نفعا ولا ضرا ، فأتيت بهم رسول الله - صلى الله عليه وسلم - . وكان عمر قال في الطريق : يا رسول الله ، نأتي قوما حربا وليس معنا سلاح ولا كراع ؟ فبعث رسول الله - صلى الله عليه وسلم - إلى المدينة من الطريق فأتوه بكل سلاح وكراع كان فيها ، وأخبر رسول الله - صلى الله عليه وسلم - أن عكرمة بن أبي جهل خرج إليه في خمسمائة فارس ، فقال رسول الله - صلى الله عليه وسلم - لخالد بن الوليد : [ هذا ابن عمك أتاك في خمسمائة ] . فقال خالد : أنا سيف الله وسيف رسوله ، فيومئذ سمي بسيف الله ، فخرج ومعه خيل وهزم الكفار ودفعهم إلى حوائط مكة .\nوهذه الرواية أصح ، وكان بينهم قتال بالحجارة ، وقيل بالنبل والظفر . وقيل : أراد بكف اليد أنه شرط في الكتاب أن من جاءنا منهم فهو رد عليهم ، فخرج أقوام من مكة مسلمون وخافوا أن يردهم الرسول - عليه السلام - إلى المشركين لحقوا بالساحل ، ومنهم أبو بصير ، وجعلوا يغيرون على الكفار ويأخذون عيرهم ، حتى جاء كبار قريش إلى النبي - صلى الله عليه وسلم - وقالوا : اضممهم إليك حتى نأمن ، ففعل . وقيل : همت غطفان وأسد منع المسلمين من يهود خيبر لأنهم كانوا حلفاءهم فمنعهم الله عن ذلك ، فهو كف اليد . ببطن مكة فيه قولان : أحدهما : يريد به مكة . الثاني : الحديبية ; لأن بعضها مضاف إلى الحرم . قال الماوردي : وفي قوله : من بعد أن أظفركم عليهم بفتح مكة . وتكون هذه نزلت بعد فتح مكة ، وفيها دليل على أن مكة فتحت صلحا لقوله - عز وجل - : كف أيديهم عنكم وأيديكم عنهم\nقلت : الصحيح أن هذه الآية نزلت في الحديبية قبل فتح مكة ، حسب ما قدمناه عن أهل التأويل من الصحابة والتابعين . وروى الترمذي قال : حدثنا عبد بن حميد قال حدثني سليمان بن حرب قال حدثنا حماد بن سلمة عن ثابت عن أنس : أن ثمانين هبطوا على رسول الله - صلى الله عليه وسلم - وأصحابه من جبل التنعيم عند صلاة الصبح وهم يريدون أن يقتلوه ، فأخذوا أخذا فأعتقهم رسول الله - صلى الله عليه وسلم - ، فأنزل الله تعالى : وهو الذي كف أيديهم عنكم وأيديكم عنهم الآية . قال أبو عيسى : هذا حديث حسن صحيح ، وقد تقدم . وأما فتح مكة فالذي تدل عليه الأخبار أنها إنما فتحت عنوة ، وقد مضى القول في ذلك في ( الحج ) وغيرها . وكان الله بما تعملون بصيرا\n                                    ",
      "saadi": "وَهُوَ ٱلَّذِي كَفَّ أَيۡدِيَهُمۡ عَنكُمۡ وَأَيۡدِيَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَيۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا ٤٢\n                                        \n                                        \n                                        \n                                        يقول تعالى ممتنا على عباده بالعافية، من شر الكفار ومن قتالهم، فقال: { وَهُوَ الَّذِي كَفَّ أَيْدِيَهُمْ } أي: أهل مكة { عَنْكُمْ وَأَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ مِنْ بَعْدِ أَنْ أَظْفَرَكُمْ عَلَيْهِمْ } أي: من بعد ما قدرتم عليهم، وصاروا تحت ولايتكم بلا عقد ولا عهد، وهم نحو ثمانين رجلا، انحدروا على المسلمين ليصيبوا منهم غرة، فوجدوا المسلمين منتبهين فأمسكوهم، فتركوهم ولم يقتلوهم، رحمة من الله بالمؤمنين إذ لم يقتلوهم، { وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا } فيجازي كل عامل بعمله، ويدبركم أيها المؤمنون بتدبيره الحسن.\n                                    "
    }
  },
  {
    "id": 24,
    "versesNumber": 25,
    "souraName": "Al-Fath.html",
    "contnent": "هُمُ ٱلَّذِينَ كَفَرُواْ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡيَ مَعۡكُوفًا أَن يَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالٞ مُّؤۡمِنُونَ وَنِسَآءٞ مُّؤۡمِنَٰتٞ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَ‍ُٔوهُمۡ فَتُصِيبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَيۡرِ عِلۡمٖۖ لِّيُدۡخِلَ ٱللَّهُ فِي رَحۡمَتِهِۦ مَن يَشَآءُۚ لَوۡ تَزَيَّلُواْ لَعَذَّبۡنَا ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابًا أَلِيمًا ٥٢",
    "tafsier": {
      "ibnkther": "هُمُ ٱلَّذِينَ كَفَرُواْ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡيَ مَعۡكُوفًا أَن يَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالٞ مُّؤۡمِنُونَ وَنِسَآءٞ مُّؤۡمِنَٰتٞ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَ‍ُٔوهُمۡ فَتُصِيبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَيۡرِ عِلۡمٖۖ لِّيُدۡخِلَ ٱللَّهُ فِي رَحۡمَتِهِۦ مَن يَشَآءُۚ لَوۡ تَزَيَّلُواْ لَعَذَّبۡنَا ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابًا أَلِيمًا ٥٢\n                                    \n                                    \n                                    يقول تعالى مخبرا عن الكفار من مشركي العرب من قريش ومن مالأهم على نصرتهم على رسول الله - صلى الله عليه وسلم - : ( هم الذين كفروا ) أي : هم الكفار دون غيرهم ، ( وصدوكم عن المسجد الحرام ) أي : وأنتم أحق به ، وأنتم أهله في نفس الأمر ، ( والهدي معكوفا أن يبلغ محله ) أي : وصدوا الهدي أن يصل إلى محله ، وهذا من بغيهم وعنادهم ، وكان الهدي سبعين بدنة ، كما سيأتي بيانه .\nوقوله : ( ولولا رجال مؤمنون ونساء مؤمنات ) أي : بين أظهرهم ممن يكتم إيمانه ويخفيه منهم خيفة على أنفسهم من قومهم ، لكنا سلطناكم عليهم فقتلتموهم وأبدتم خضراءهم ، ولكن بين أفنائهم من المؤمنين والمؤمنات أقوام لا تعرفونهم حالة القتل ; ولهذا قال : ( لم تعلموهم أن تطئوهم فتصيبكم منهم معرة ) أي : إثم وغرامة ( بغير علم ليدخل الله في رحمته من يشاء ) أي : يؤخر عقوبتهم ليخلص من بين أظهرهم المؤمنين ، وليرجع كثير منهم إلى الإسلام .\nثم قال : ( لو تزيلوا ) أي : لو تميز الكفار من المؤمنين الذين بين أظهرهم ( لعذبنا الذين كفروا منهم عذابا أليما ) أي : لسلطناكم عليهم فلقتلتموهم قتلا ذريعا .\nقال الحافظ أبو القاسم الطبراني : حدثنا أبو الزنباع روح بن الفرج - حدثنا عبد الرحمن بن أبي عباد المكي ، حدثنا عبد الرحمن بن عبد الله أبو سعيد - مولى بني هاشم - حدثنا حجر بن خلف : سمعت عبد الله بن عوف يقول : سمعت جنيد بن سبع يقول : قاتلت رسول الله - صلى الله عليه وسلم - أول النهار كافرا ، وقاتلت معه آخر النهار مسلما ، وفينا نزلت : ( ولولا رجال مؤمنون ونساء مؤمنات ) قال : كنا تسعة نفر : سبعة رجال وامرأتين .\nثم رواه من طريق أخرى عن محمد بن عباد المكي به ، وقال فيه : عن أبي جمعة جنيد بن سبع ، فذكره والصواب أبو جعفر : حبيب بن سباع . ورواه ابن أبي حاتم من حديث حجر بن خلف ، به . وقال : كنا ثلاثة رجال وتسع نسوة ، وفينا نزلت : ( ولولا رجال مؤمنون ونساء مؤمنات ) .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا محمد بن إسماعيل البخاري ، حدثنا عبد الله بن عثمان بن جبلة ، عن أبي حمزة ، عن عطاء عن سعيد بن جبير ، عن ابن عباس : ( لو تزيلوا لعذبنا الذين كفروا منهم عذابا أليما ) يقول : لو تزيل الكفار من المؤمنين ، لعذبهم الله عذابا أليما بقتلهم إياهم .\n                                    ",
      "qortoby": "هُمُ ٱلَّذِينَ كَفَرُواْ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡيَ مَعۡكُوفًا أَن يَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالٞ مُّؤۡمِنُونَ وَنِسَآءٞ مُّؤۡمِنَٰتٞ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَ‍ُٔوهُمۡ فَتُصِيبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَيۡرِ عِلۡمٖۖ لِّيُدۡخِلَ ٱللَّهُ فِي رَحۡمَتِهِۦ مَن يَشَآءُۚ لَوۡ تَزَيَّلُواْ لَعَذَّبۡنَا ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابًا أَلِيمًا ٥٢\n                                    \n                                    \n                                    قوله تعالى : هم الذين كفروا وصدوكم عن المسجد الحرام والهدي معكوفا أن يبلغ محله ولولا رجال مؤمنون ونساء مؤمنات لم تعلموهم أن تطئوهم فتصيبكم منهم معرة بغير علم ليدخل الله في رحمته من يشاء لو تزيلوا لعذبنا الذين كفروا منهم عذابا أليما .\nقوله تعالى : هم الذين كفروا وصدوكم عن المسجد الحرام والهدي معكوفا أن يبلغ محله فيه ثلاث مسائل : الأولى : قوله تعالى : هم الذين كفروا يعني قريشا ، منعوكم دخول المسجد الحرام عام الحديبية حين أحرم النبي - صلى الله عليه وسلم - مع أصحابه بعمرة ، ومنعوا الهدي وحبسوه عن أن يبلغ محله . وهذا كانوا لا يعتقدونه ، ولكنه حملتهم الأنفة ودعتهم حمية الجاهلية إلى أن يفعلوا ما لا يعتقدونه دينا ، فوبخهم الله على ذلك وتوعدهم عليه ، وأدخل الأنس على رسول الله - صلى الله عليه وسلم - ببيانه ووعده .\nالثانية : قوله تعالى : والهدي معكوفا أي محبوسا . وقيل : موقوفا . وقال أبو عمرو بن العلاء : مجموعا . الجوهري : عكفه أي : حبسه ووقفه ، يعكفه ويعكفه عكفا ، ومنه قوله تعالى : والهدي معكوفا ، يقال ما عكفك عن كذا . ومنه الاعتكاف في المسجد وهو الاحتباس . أن يبلغ محله أي منحره ، قاله الفراء . وقال الشافعي - رضي الله عنه - : الحرم . وكذا قال أبو حنيفة - رضي الله عنه - ، المحصر محل هديه الحرم . والمحل ( بكسر الحاء ) : غاية الشيء . ( وبالفتح ) : هو الموضع الذي يحله الناس . وكان الهدي سبعين بدنة ، ولكن الله بفضله جعل ذلك الموضع له محلا .\nوقد اختلف العلماء في هذا على ما تقدم بيانه في ( البقرة ) عند قوله تعالى : فإن أحصرتم والصحيح ما ذكرناه .\nوفي صحيح مسلم عن أبي الزبير عن جابر بن عبد الله قال : نحرنا مع رسول الله - صلى الله عليه وسلم - عام الحديبية البدنة عن سبعة ، والبقرة عن سبعة . وعنه قال : اشتركنا مع رسول الله - صلى الله عليه وسلم - في الحج والعمرة كل سبعة في بدنة . فقال رجل لجابر : أيشترك في البدنة ما يشترك في الجزور ؟ قال : ما هي إلا من البدن . وحضر جابر الحديبية قال : ونحرنا يومئذ سبعين بدنة ، اشتركنا كل سبعة في بدنة . وفي البخاري عن ابن عمر قال : خرجنا مع رسول الله - صلى الله عليه وسلم - معتمرين ، فحال كفار قريش دون البيت ، فنحر رسول الله - صلى الله عليه وسلم - بدنة وحلق رأسه . قيل : إن الذي حلق رأسه يومئذ خراش بن أمية بن أبي العيص الخزاعي ، وأمر رسول الله - صلى الله عليه وسلم - المسلمين أن ينحروا ويحلوا ، ففعلوا بعد توقف كان منهم أغضب رسول الله - صلى الله عليه وسلم - . فقالت له أم سلمة : لو نحرت لنحروا ، فنحر رسول الله - صلى الله عليه وسلم - هديه ونحروا بنحره ، وحلق رسول الله - صلى الله عليه وسلم - رأسه ودعا للمحلقين ثلاثا وللمقصرين مرة . ورأى كعب بن عجرة والقمل يسقط على وجهه ، فقال : [ أيؤذيك هوامك ] ؟ قال نعم ، فأمره أن يحلق وهو بالحديبية . خرجه البخاري والدارقطني . وقد مضى في ( البقرة )\nالثالثة : قوله تعالى : والهدي الهدي والهدي لغتان . وقرئ حتى يبلغ الهدي محله بالتخفيف والتشديد ، الواحدة هدية . وقد مضى في ( البقرة ) أيضا . وهو معطوف على الكاف والميم من صدوكم ومعكوفا حال ، وموضع أن من قوله : أن يبلغ محله نصب على تقدير الحمل على صدوكم أي : صدوكم وصدوا الهدي عن أن يبلغ . ويجوز أن يكون مفعولا له ، كأنه قال : وصدوا الهدي كراهية أن يبلغ محله . أبو علي : لا يصح حمله على العكف ، لأنا لا نعلم ( عكف ) جاء متعديا ، ومجيء معكوفا في الآية يجوز أن يكون محمولا على المعنى ، كأنه لما كان حبسا حمل المعنى على ذلك ، كما حمل الرفث على معنى الإفضاء فعدي بإلى ، فإن حمل على ذلك كان موضعه نصبا على قياس قول سيبويه ، وجرا على قياس قول الخليل . أو يكون مفعولا له ، كأنه قال : محبوسا كراهية أن يبلغ محله . ويجوز تقدير الجر في أن لأن عن تقدمت ، فكأنه قال : وصدوكم عن المسجد الحرام ، وصدوا الهدي ( عن ) أن يبلغ محله . ومثله ما حكاه سيبويه عن يونس : مررت برجل إن زيد وإن عمرو ، فأضمر الجار لتقدم ذكره .\nقوله تعالى : ولولا رجال مؤمنون ونساء مؤمنات لم تعلموهم أن تطئوهم فتصيبكم منهم معرة بغير علم فيه ثلاث مسائل : الأولى : قوله تعالى : ولولا رجال مؤمنون يعني المستضعفين من المؤمنين بمكة وسط الكفار ، كسلمة بن هشام وعياش بن أبي ربيعة وأبي جندل بن سهيل ، وأشباههم . لم تعلموهم أي : تعرفوهم . وقيل : لم تعلموهم أنهم مؤمنون . أن تطئوهم بالقتل والإيقاع بهم ، يقال : وطئت القوم ، أي : أوقعت بهم . وأن يجوز أن يكون رفعا على البدل من رجال ، ونساء كأنه قال ولولا وطؤكم رجالا مؤمنين ونساء مؤمنات . ويجوز أن يكون نصبا على البدل من الهاء والميم في تعلموهم ، فيكون التقدير : لم تعلموا وطأهم ، وهو في الوجهين بدل الاشتمال . لم تعلموهم نعت ل ( رجال ) و ( نساء ) ، وجواب لولا محذوف ، والتقدير : ولو أن تطئوا رجالا مؤمنين ونساء مؤمنات لم تعلموهم لأذن الله لكم في دخول مكة ، ولسلطكم عليهم ، ولكنا صنا من كان فيها يكتم إيمانه . وقال الضحاك : لولا من في أصلاب الكفار وأرحام نسائهم من رجال مؤمنين ونساء مؤمنات لم تعلموا أن تطئوا آباءهم فتهلك أبناؤهم .\nالثانية : قوله تعالى : فتصيبكم منهم معرة بغير علم المعرة العيب ، وهي مفعلة من العر وهو الجرب ، أي : يقول المشركون : قد قتلوا أهل دينهم . وقيل : المعنى يصيبكم من قتلهم ما يلزمكم من أجله كفارة قتل الخطأ ; لأن الله تعالى إنما أوجب على قاتل المؤمن في دار الحرب إذا لم يكن هاجر منها ولم يعلم بإيمانه الكفارة دون الدية في قوله : فإن كان من قوم عدو لكم وهو مؤمن فتحرير رقبة مؤمنة قاله الكلبي ومقاتل وغيرهما . وقد مضى في ( النساء ) القول فيه . وقال ابن زيد : معرة : إثم . وقال الجوهري وابن إسحاق : غرم الدية . قطرب : شدة . وقيل : غم .\nالثالثة : قوله تعالى : بغير علم تفضيل للصحابة وإخبار عن صفتهم الكريمة من العفة عن المعصية والعصمة عن التعدي ، حتى لو أنهم أصابوا من ذلك أحدا لكان عن غير قصد . وهذا كما وصفت النملة عن جند سليمان - عليه السلام - في قولها : لا يحطمنكم سليمان وجنوده وهم لا يشعرون .\nقوله تعالى : ليدخل الله في رحمته من يشاء لو تزيلوا فيه أربع مسائل : الأولى : قوله تعالى : ليدخل الله في رحمته من يشاء لو تزيلوا اللام في ليدخل متعلقة بمحذوف ، أي : لو قتلتموهم لأدخلهم الله في رحمته . ويجوز أن تتعلق بالإيمان . ولا تحمل على مؤمنين دون مؤمنات ولا على مؤمنات دون مؤمنين لأن الجميع يدخلون في الرحمة . وقيل : المعنى لم يأذن الله لكم في قتال المشركين ليسلم بعد الصلح من قضى أن يسلم من أهل مكة ، وكذلك كان ؛ أسلم الكثير منهم وحسن إسلامه ، ودخلوا في رحمته ، أي : جنته .\nالثانية : قوله تعالى : لو تزيلوا أي تميزوا ، قاله القتبي . وقيل : لو تفرقوا ، قاله الكلبي . وقيل : لو زال المؤمنون من بين أظهر الكفار لعذب الكفار بالسيف ، قاله الضحاك ولكن الله يدفع بالمؤمنين عن الكفار . وقال علي - رضي الله عنه - : سألت النبي - صلى الله عليه وسلم - عن هذه الآية لو تزيلوا لعذبنا الذين كفروا فقال : [ هم المشركون من أجداد نبي الله ومن كان بعدهم وفي عصرهم كان في أصلابهم قوم مؤمنون فلو تزيل المؤمنون عن أصلاب الكافرين لعذب الله تعالى الكافرين عذابا أليما ] .\nالثالثة : هذه الآية دليل على مراعاة الكافر في حرمة المؤمن ، إذ لا يمكن أذية الكافر إلا بأذية المؤمن . قال أبو زيد قلت لابن القاسم : أرأيت لو أن قوما من المشركين في حصن من حصونهم ، حصرهم أهل الإسلام وفيهم قوم من المسلمين أسارى في أيديهم ، أيحرق هذا الحصن أم لا ؟ قال : سمعت مالكا وسئل عن قوم من المشركين في مراكبهم : أنرمي في مراكبهم بالنار ومعهم الأسارى في مراكبهم ؟ قال : فقال مالك لا أرى ذلك ، لقوله تعالى لأهل مكة : لو تزيلوا لعذبنا الذين كفروا منهم عذابا أليما وكذلك لو تترس كافر بمسلم لم يجز رميه . وإن فعل ذلك فاعل فأتلف أحدا من المسلمين فعليه الدية والكفارة . فإن لم يعلموا فلا دية ولا كفارة ، وذلك أنهم إذا علموا فليس لهم أن يرموا ، فإذا فعلوه صاروا قتلة خطأ والدية على عواقلهم . فإن لم يعلموا فلهم أن يرموا . وإذا أبيحوا الفعل لم يجز أن يبقى عليهم فيها تباعة . قال ابن العربي : وقد قال جماعة إن معناه لو تزيلوا عن بطون النساء وأصلاب الرجال . وهذا ضعيف ; لأن من في الصلب أو في البطن لا يوطأ ولا تصيب منه معرة . وهو سبحانه قد صرح فقال : ولولا رجال مؤمنون ونساء مؤمنات لم تعلموهم أن تطئوهم ، وذلك لا ينطلق على من في بطن المرأة وصلب الرجال ، وإنما ينطلق على مثل الوليد بن الوليد ، وسلمة بن هشام ، وعياش بن أبي ربيعة ، وأبي جندل بن سهيل . وكذلك قال مالك : وقد حاصرنا مدينة الروم فحبس عنهم الماء ، فكانوا ينزلون الأسارى يستقون لهم الماء ، فلا يقدر أحد على رميهم بالنبل ، فيحصل لهم الماء بغير اختيارنا . وقد جوز أبو حنيفة وأصحابه والثوري الرمي في حصون المشركين وإن كان فيهم أسارى من المسلمين وأطفالهم . ولو تترس كافر بولد مسلم رمي المشرك ، وإن أصيب أحد من المسلمين فلا دية فيه ولا كفارة . وقال الثوري : فيه الكفارة ولا دية . وقال الشافعي بقولنا . وهذا ظاهر ، فإن التوصل إلى المباح بالمحظور لا يجوز ، سيما بروح المسلم ، فلا قول إلا ما قالهمالك - رضي الله عنه - . والله أعلم .\nقلت : قد يجوز قتل الترس ، ولا يكون فيه اختلاف إن شاء الله ، وذلك إذا كانت المصلحة ضرورية كلية قطعية . فمعنى كونها ضرورية : أنها لا يحصل الوصول إلى الكفار إلا بقتل الترس . ومعنى أنها كلية : أنها قاطعة لكل الأمة ، حتى يحصل من قتل الترس مصلحة كل المسلمين ، فإن لم يفعل قتل الكفار الترس واستولوا على كل الأمة . ومعنى كونها قطعية : أن تلك المصلحة حاصلة من قتل الترس قطعا . قال علماؤنا : وهذه المصلحة بهذه القيود لا ينبغي أن يختلف في اعتبارها ; لأن الفرض أن الترس مقتول قطعا ، فإما بأيدي العدو فتحصل المفسدة العظيمة التي هي استيلاء العدو على كل المسلمين . وإما بأيدي المسلمين فيهلك العدو وينجو المسلمون أجمعون . ولا يتأتى لعاقل أن يقول : لا يقتل الترس في هذه الصورة بوجه ; لأنه يلزم منه ذهاب الترس والإسلام والمسلمين ، لكن لما كانت هذه المصلحة غير خالية من المفسدة ، نفرت منها نفس من لم يمعن النظر فيها ، فإن تلك المفسدة بالنسبة إلى ما يحصل منها عدم أو كالعدم . والله أعلم .\nالرابعة : قراءة العامة لو تزيلوا إلا أبا حيوة فإنه قرأ ( تزايلوا ) وهو مثل تزيلوا في المعنى . والتزايل : التباين . وتزيلوا تفعلوا ، من زلت . وقيل : هي تفيعلوا . لعذبنا الذين كفروا قيل : اللام جواب لكلامين ، أحدهما : لولا رجال والثاني : لو تزيلوا وقيل : جواب لولا محذوف ، وقد تقدم . ولو تزيلوا ابتداء كلام .\n                                    ",
      "saadi": "هُمُ ٱلَّذِينَ كَفَرُواْ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡيَ مَعۡكُوفًا أَن يَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالٞ مُّؤۡمِنُونَ وَنِسَآءٞ مُّؤۡمِنَٰتٞ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَ‍ُٔوهُمۡ فَتُصِيبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَيۡرِ عِلۡمٖۖ لِّيُدۡخِلَ ٱللَّهُ فِي رَحۡمَتِهِۦ مَن يَشَآءُۚ لَوۡ تَزَيَّلُواْ لَعَذَّبۡنَا ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ عَذَابًا أَلِيمًا ٥٢\n                                        \n                                        \n                                        \n                                        ثم ذكر تعالى الأمور المهيجة على قتال المشركين، وهي كفرهم بالله ورسوله، وصدهم رسول الله ومن معه من المؤمنين، أن يأتوا للبيت الحرام زائرين معظمين له بالحج والعمرة، وهم الذين أيضا صدوا { الهدي مَعْكُوفًا } أي: محبوسا { أَنْ يَبْلُغَ مَحِلَّهُ } وهو محل ذبحه وهو مكة، فمنعوه من الوصول إليه ظلما وعدوانا، وكل هذه أمور موجبة وداعية إلى قتالهم، ولكن ثم مانع وهو: وجود رجال ونساء من أهل الإيمان بين أظهر المشركين، وليسوا متميزين بمحلة أو مكان يمكن أن لا ينالهم أذى، فلولا هؤلاء الرجال المؤمنون، والنساء المؤمنات، الذين لا يعلمهم المسلمون أن تطأوهم، أي: خشية أن تطأوهم { فَتُصِيبَكُمْ مِنْهُمْ مَعَرَّةٌ بِغَيْرِ عِلْمٍ } والمعرة: ما يدخل تحت قتالهم، من نيلهم بالأذى والمكروه، وفائدة أخروية، وهو: أنه ليدخل في رحمته من يشاء فيمن عليهم بالإيمان بعد الكفر، وبالهدى بعد الضلال، فيمنعكم من قتالهم لهذا السبب.\n{ لَوْ تَزَيَّلُوا } أي: لو زالوا من بين أظهرهم { لَعَذَّبْنَا الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابًا أَلِيمًا } بأن نبيح لكم قتالهم، ونأذن فيه، وننصركم عليهم.\n                                    "
    }
  },
  {
    "id": 25,
    "versesNumber": 26,
    "souraName": "Al-Fath.html",
    "contnent": "إِذۡ جَعَلَ ٱلَّذِينَ كَفَرُواْ فِي قُلُوبِهِمُ ٱلۡحَمِيَّةَ حَمِيَّةَ ٱلۡجَٰهِلِيَّةِ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوٓاْ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا ٦٢",
    "tafsier": {
      "ibnkther": "إِذۡ جَعَلَ ٱلَّذِينَ كَفَرُواْ فِي قُلُوبِهِمُ ٱلۡحَمِيَّةَ حَمِيَّةَ ٱلۡجَٰهِلِيَّةِ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوٓاْ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا ٦٢\n                                    \n                                    \n                                    وقوله : ( إذ جعل الذين كفروا في قلوبهم الحمية حمية الجاهلية ) ، وذلك حين أبوا أن يكتبوا \" بسم الله الرحمن الرحيم \" ، وأبوا أن يكتبوا : \" هذا ما قاضى عليه محمد رسول الله \" ، ( فأنزل الله سكينته على رسوله وعلى المؤمنين وألزمهم كلمة التقوى ) ، وهي قول : \" لا إله إلا الله \" ، كما قال ابن جرير ، وعبد الله ابن الإمام أحمد : حدثنا الحسن بن قزعة أبو علي البصري ، حدثنا سفيان بن حبيب ، حدثنا شعبة ، عن ثوير ، عن أبيه عن الطفيل - يعني : ابن أبي بن كعب [ رضي الله عنه ] - عن أبيه [ أنه ] سمع رسول الله - صلى الله عليه وسلم - يقول : ( وألزمهم كلمة التقوى ) قال : \" لا إله إلا الله \" .\nوكذا رواه الترمذي عن الحسن بن قزعة ، وقال : غريب لا نعرفه إلا من حديثه ، وسألت أبا زرعة عنه فلم يعرفه إلا من هذا الوجه .\nوقال ابن أبي حاتم : حدثنا أحمد بن منصور الرمادي ، حدثنا عبد الله بن صالح ، حدثني الليث ، حدثني عبد الرحمن بن خالد ، عن ابن شهاب ، عن سعيد بن المسيب ، أن أبا هريرة أخبره ، أن رسول الله - صلى الله عليه وسلم - قال : \" أمرت أن أقاتل الناس حتى يقولوا : لا إله إلا الله ، فمن قال : لا إله إلا الله ، فقد عصم مني ماله ونفسه إلا بحقه ، وحسابه على الله \" ، وأنزل الله في كتابه ، وذكر قوما فقال : ( إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون ) [ الصافات : 35 ] ، وقال الله جل ثناؤه : ( وألزمهم كلمة التقوى وكانوا أحق بها وأهلها ) وهي : \" لا إله إلا الله ، محمد رسول الله \" ، فاستكبروا عنها واستكبر عنها المشركون يوم الحديبية ، وكاتبهم رسول الله - صلى الله عليه وسلم - على قضية المدة .\nوكذا رواه بهذه الزيادات ابن جرير من حديث الزهري ، والظاهر أنها مدرجة من كلام الزهري ، والله أعلم .\nوقال مجاهد : ( كلمة التقوى ) : الإخلاص . وقال عطاء بن أبي رباح : هي لا إله إلا الله وحده لا شريك له له الملك وله الحمد ، وهو على كل شيء قدير .\nوقال يونس بن بكير ، عن ابن إسحاق ، عن الزهري ، عن عروة ، عن المسور : ( وألزمهم كلمة التقوى ) قال : لا إله إلا الله ، وحده لا شريك له .\nوقال الثوري ، عن سلمة بن كهيل ، عن عباية بن ربعي ، عن علي : ( وألزمهم كلمة التقوى ) قال : لا إله إلا الله ، والله أكبر . وكذا قال ابن عمر ، رضي الله عنهما .\nوقال علي بن أبي طلحة ، عن ابن عباس قوله : ( وألزمهم كلمة التقوى ) قال : يقول : شهادة أن لا إله إلا الله ، وهي رأس كل تقوى .\nوقال سعيد بن جبير : ( وألزمهم كلمة التقوى ) قال : لا إله إلا الله والجهاد في سبيله .\nوقال عطاء الخراساني : هي : لا إله إلا الله ، محمد رسول الله .\nوقال عبد الله بن المبارك ، عن معمر عن الزهري : ( وألزمهم كلمة التقوى ) قال : بسم الله الرحمن الرحيم .\nوقال قتادة : ( وألزمهم كلمة التقوى ) قال : لا إله إلا الله .\n( وكانوا أحق بها وأهلها ) : كان المسلمون أحق بها ، وكانوا أهلها .\n( وكان الله بكل شيء عليما ) أي : هو عليم بمن يستحق الخير ومن يستحق الشر .\nوقد قال النسائي : حدثنا إبراهيم بن سعيد ، حدثنا شبابة بن سوار ، عن أبي رزين ، عن عبد الله بن العلاء بن زبر ، عن بسر بن عبيد الله ، عن أبي إدريس ، عن أبي بن كعب أنه كان يقرأ : ( إذ جعل الذين كفروا في قلوبهم الحمية حمية الجاهلية ) [ الفتح : 26 ] ، ولو حميتم كما حموا لفسد المسجد الحرام . فبلغ ذلك عمر فأغلظ له ، فقال : إنك لتعلم أني كنت أدخل على رسول الله - صلى الله عليه وسلم - فيعلمني مما علمه الله . فقال عمر : بل أنت رجل عندك علم وقرآن ، فاقرأ وعلم مما علمك الله ورسوله .\nوهذا ذكر الأحاديث الواردة في قصة الحديبية وقصة الصلح :\nقال الإمام أحمد : حدثنا يزيد بن هارون ، أخبرنا محمد بن إسحاق بن يسار ، عن الزهري ، عن عروة بن الزبير ، عن المسور بن مخرمة ومروان بن الحكم قالا خرج رسول الله - صلى الله عليه وسلم - عام الحديبية يريد زيارة البيت ، لا يريد قتالا وساق معه الهدي سبعين بدنة ، وكان الناس سبعمائة رجل ، فكانت كل بدنة عن عشرة ، وخرج رسول الله - صلى الله عليه وسلم - حتى إذا كان بعسفان لقيه بشر بن سفيان الكعبي ، فقال : يا رسول الله ، هذه قريش قد سمعت بمسيرك فخرجت معها العوذ المطافيل ، قد لبست جلود النمور ، يعاهدون الله ألا تدخلها عليهم عنوة أبدا ، وهذا خالد بن الوليد في خيلهم قد قدموه إلى كراع الغميم ، فقال رسول الله - صلى الله عليه وسلم - : \" يا ويح قريش ! قد أكلتهم الحرب ، ماذا عليهم لو خلوا بيني وبين سائر الناس ؟ فإن أصابوني كان الذي أرادوا ، وإن أظهرني الله [ عليهم ] دخلوا في الإسلام وهم وافرون ، وإن لم يفعلوا قاتلوا وبهم قوة ، فماذا تظن قريش ؟ فوالله لا أزال أجاهدهم على الذي بعثني الله به حتى يظهرني الله أو تنفرد هذه السالفة \" . ثم أمر الناس فسلكوا ذات اليمين بين ظهري الحمض على طريق تخرجه على ثنية المرار والحديبية من أسفل مكة . قال : فسلك بالجيش تلك الطريق ، فلما رأت خيل قريش قترة الجيش قد خالفوا عن طريقهم ، ركضوا راجعين إلى قريش ، فخرج رسول الله - صلى الله عليه وسلم - حتى إذا سلك ثنية المرار ، بركت ناقته ، فقال الناس : خلأت . فقال رسول الله - صلى الله عليه وسلم - : \" ما خلأت ، وما ذلك لها بخلق ، ولكن حبسها حابس الفيل عن مكة ، والله لا تدعوني قريش اليوم إلى خطة يسألوني فيها صلة الرحم ، إلا أعطيتهم إياها \" [ ثم ] قال للناس : \" انزلوا \" . قالوا : يا رسول الله ، ما بالوادي من ماء ينزل عليه الناس . فأخرج رسول الله - صلى الله عليه وسلم - سهما من كنانته فأعطاه رجلا من أصحابه ، فنزل في قليب من تلك القلب ، فغرزه فيه فجاش بالماء حتى ضرب الناس عنه بعطن . فلما اطمأن رسول الله - صلى الله عليه وسلم - إذا بديل بن ورقاء في رجال من خزاعة ، فقال لهم كقوله لبشر بن سفيان ، فرجعوا إلى قريش فقالوا : يا معشر قريش ، إنكم تعجلون على محمد ، وإن محمدا لم يأت لقتال ، إنما جاء زائرا لهذا البيت معظما لحقه ، فاتهموهم .\nقال محمد بن إسحاق : قال الزهري : [ و ] كانت خزاعة في عيبة رسول الله - صلى الله عليه وسلم - مشركها ومسلمها ، لا يخفون على رسول الله - صلى الله عليه وسلم - شيئا كان بمكة ، فقالوا : وإن كان إنما جاء لذلك فوالله لا يدخلها أبدا علينا عنوة ، ولا يتحدث بذلك العرب . ثم بعثوا إليه مكرز بن حفص ، أحد بني عامر بن لؤي ، فلما رآه رسول الله - صلى الله عليه وسلم - قال : \" هذا رجل غادر \" . فلما انتهى إلى رسول الله - صلى الله عليه وسلم - كلمه رسول الله - صلى الله عليه وسلم - بنحو ما كلم به أصحابه ، ثم رجع إلى قريش فأخبرهم بما قال له رسول الله [ - صلى الله عليه وسلم - ] ; فبعثوا إليه الحليس بن علقمة الكناني ، وهو يومئذ سيد الأحابيش ، فلما رآه رسول الله - صلى الله عليه وسلم - قال : \" هذا من قوم يتألهون ، فابعثوا الهدي \" في وجهه ، فبعثوا الهدي ، فلما رأى الهدي يسيل عليه من عرض الوادي في قلائده قد أكل أوتاره من طول الحبس عن محله ، رجع ولم يصل إلى رسول الله - صلى الله عليه وسلم - إعظاما لما رأى ، فقال : يا معشر قريش ، قد رأيت ما لا يحل صده ، الهدي في قلائده قد أكل أوتاره من طول الحبس عن محله . قالوا : اجلس ، إنما أنت أعرابي لا علم لك . فبعثوا إليه عروة بن مسعود الثقفي ، فقال : يا معشر قريش ، إن قد رأيت ما يلقى منكم من تبعثون إلى محمد إذا جاءكم ، من التعنيف وسوء اللفظ ، وقد عرفتم أنكم والد وأني ولد ، وقد سمعت بالذي نابكم ، فجمعت من أطاعني من قومي ، ثم جئت حتى آسيتكم بنفسي . قالوا : صدقت ما أنت عندنا بمتهم . فخرج حتى أتى رسول الله - صلى الله عليه وسلم - فجلس بين يديه ، فقال : يا محمد جمعت أوباش الناس ، ثم جئت بهم لبيضتك لتفضها ، إنها قريش قد خرجت معها العوذ المطافيل ، قد لبسوا جلود النمور ، يعاهدون الله ألا تدخلها عليهم عنوة أبدا ، وايم الله لكأني بهؤلاء قد انكشفوا عنك غدا . قال : وأبو بكر قاعد خلف رسول الله - صلى الله عليه وسلم - فقال : امصص بظر اللات ! أنحن ننكشف عنه ؟ ! قال : من هذا يا محمد ؟ قال : \" هذا ابن أبي قحافة \" . قال : أما والله لولا يد كانت لك عندي لكافأتك بها ، ولكن هذه بها . ثم تناول لحية رسول الله - صلى الله عليه وسلم - والمغيرة بن شعبة واقف على رأس رسول الله - صلى الله عليه وسلم - في الحديد ، قال : فقرع يده . ثم قال : أمسك يدك عن لحية رسول الله - صلى الله عليه وسلم - قبل - والله - لا تصل إليك . قال : ويحك ! ما أفظعك وأغلظك ! فتبسم رسول الله - صلى الله عليه وسلم - . قال : من هذا يا محمد ؟ قال - صلى الله عليه وسلم - : \" هذا ابن أخيك المغيرة بن شعبة \" . قال : أغدر ، وهل غسلت سوأتك إلا بالأمس ؟ ! قال فكلمه رسول الله - صلى الله عليه وسلم - بمثل ما كلم به أصحابه ، وأخبره أنه لم يأت يريد حربا . قال : فقام من عند رسول الله [ - صلى الله عليه وسلم - ] وقد رأى ما يصنع به أصحابه ، لا يتوضأ وضوءا إلا ابتدروه ، ولا يبصق بصاقا إلا ابتدروه ، ولا يسقط من شعره شيء إلا أخذوه . فرجع إلى قريش فقال : يا معشر قريش ، إنى جئت كسرى في ملكه ، وجئت قيصر والنجاشي في ملكهما ، والله ما رأيت ملكا قط مثل محمد في أصحابه ، ولقد رأيت قوما لا يسلمونه لشيء أبدا ، فروا رأيكم . قال : وقد كان رسول الله - صلى الله عليه وسلم - قبل ذلك قد بعث خراش بن أمية الخزاعي إلى مكة ، وحمله على جمل له يقال له : \" الثعلب \" فلما دخل مكة عقرت به قريش ، وأرادوا قتل خراش ، فمنعتهم الأحابيش ، حتى أتى رسول الله - صلى الله عليه وسلم - فدعا عمر ليبعثه إلى مكة ، فقال : يا رسول الله ، إنى أخاف قريشا على نفسي ، وليس بها من بني عدي أحد يمنعني ، وقد عرفت قريش عداوتي إياها وغلظتي عليها ، ولكن أدلك على رجل هو أعز مني : عثمان بن عفان . قال : فدعاه رسول الله - صلى الله عليه وسلم - فبعثه إلى قريش يخبرهم أنه لم يأت لحرب أحد ، وإنما جاء زائرا لهذا البيت ، معظما لحرمته . فخرج عثمان حتى أتى مكة ، فلقيه أبان بن سعيد بن العاص ، فنزل عن دابته وحمله بين يديه وردف خلفه ، وأجاره حتى بلغ رسالة رسول الله - صلى الله عليه وسلم - فانطلق عثمان حتى أتى أبا سفيان وعظماء قريش ، فبلغهم عن رسول الله - صلى الله عليه وسلم - ما أرسله به ، فقالوا لعثمان : إن شئت أن تطوف بالبيت فطف به ، فقال : ما كنت لأفعل حتى يطوف به رسول الله [ - صلى الله عليه وسلم - ] قال : واحتبسته قريش عندها ، قال : وبلغ رسول الله أن عثمان قد قتل .\nقال محمد : فحدثني الزهري : أن قريشا بعثوا سهل بن عمرو ، وقالوا : ائت محمدا فصالحه ولا يكون في صلحه إلا أن يرجع عنا عامه هذا ، فوالله لا تحدث العرب أنه دخلها علينا عنوة أبدا . فأتاه سهل بن عمرو فلما رآه رسول الله - صلى الله عليه وسلم - قال : \" قد أراد القوم الصلح حين بعثوا هذا الرجل \" . فلما انتهى إلى رسول الله - صلى الله عليه وسلم - تكلما وأطالا الكلام ، وتراجعا حتى جرى بينهما الصلح ، فلما التأم الأمر ولم يبق إلا الكتاب ، وثب عمر بن الخطاب فأتى أبا بكر فقال : يا أبا بكر ، أوليس برسول الله ؟ أولسنا بالمسلمين ؟ أوليسوا بالمشركين ؟ قال : بلى . قال : فعلام نعطى الذلة في ديننا ؟ فقال أبو بكر : يا عمر ، الزم غرزه حيث كان ، فإني أشهد أنه رسول الله . [ ثم ] قال عمر : وأنا أشهد . ثم أتى رسول الله فقال : يا رسول الله ، أولسنا بالمسلمين أوليسوا بالمشركين ؟ قال : \" بلى \" قال : فعلام نعطى الذلة في ديننا ؟ فقال : \" أنا عبد الله ورسوله ، لن أخالف أمره ولن يضيعني \" . ثم قال عمر : ما زلت أصوم وأصلي وأتصدق وأعتق من الذي صنعت مخافة كلامي الذي تكلمت به يومئذ حتى رجوت أن يكون خيرا . قال : ثم دعا رسول الله - صلى الله عليه وسلم - علي بن أبي طالب [ رضي الله عنه ] فقال : اكتب : \" بسم الله الرحمن الرحيم \" . فقال سهل بن عمرو : ولا أعرف هذا ، ولكن اكتب : \" باسمك اللهم ، فقال رسول الله : \" اكتب باسمك اللهم . هذا ما صالح عليه محمد رسول الله ، سهل بن عمرو \" ، فقال سهل بن عمرو : ولو شهدت أنك رسول الله لم أقاتلك ، ولكن اكتب : هذا ما اصطلح عليه محمد بن عبد الله ، وسهل بن عمرو ، على وضع الحرب عشر سنين ، يأمن فيها الناس ، ويكف بعضهم عن بعض ، على أنه من أتى رسول الله من أصحابه بغير إذن وليه ، رده عليهم ، ومن أتى قريشا ممن مع رسول الله - صلى الله عليه وسلم - لم يردوه عليه وأن بيننا عيبة مكفوفة ، وأنه لا إسلال ولا إغلال ، وكان في شرطهم حين كتبوا الكتاب : أنه من أحب أن يدخل في عقد محمد وعهده ، دخل فيه ، ومن أحب أن يدخل في عقد قريش وعهدهم دخل فيه ، فتواثبت خزاعة فقالوا : نحن في عقد رسول الله وعهده ، وتواثبت بنو بكر فقالوا : نحن في عقد قريش وعهدهم ، وأنك ترجع عنا عامنا هذا فلا تدخل علينا مكة ، وأنه إذا كان عام قابل خرجنا عنك فتدخلها بأصحابك ، وأقمت بها ثلاثا معك سلاح الراكب لا تدخلها بغير السيوف في القرب ، فبينا رسول الله - صلى الله عليه وسلم - يكتب الكتاب ، إذا جاءه أبو جندل بن سهل بن عمرو في الحديد قد انفلت إلى رسول الله - صلى الله عليه وسلم - قال : وقد كان أصحاب رسول الله خرجوا وهم لا يشكون في الفتح ، لرؤيا رآها رسول الله - صلى الله عليه وسلم - فلما رأوا ما رأوا من الصلح والرجوع ، وما تحمل رسول الله [ - صلى الله عليه وسلم - ] على نفسه ، دخل الناس من ذلك أمر عظيم ، حتى كادوا أن يهلكوا . فلما رأى سهل أبا جندل قام إليه فضرب وجهه وقال : يا محمد ، قد لجت القضية بيني وبينك قبل أن يأتيك هذا . قال : \" صدقت \" . فقام إليه فأخذ بتلابيبه . قال : وصرخ أبو جندل بأعلى صوته : يا معشر المسلمين ، أتردونني إلى أهل الشرك فيفتنوني في ديني ؟ قال : فزاد الناس شرا إلى ما بهم ، فقال رسول الله - صلى الله عليه وسلم - : \" يا أبا جندل ، اصبر واحتسب ، فإن الله جاعل لك ولمن معك من المستضعفين فرجا ومخرجا ، إنا قد عقدنا بيننا وبين القوم صلحا فأعطيناهم على ذلك وأعطونا عليه عهدا ، وإنا لن نغدر بهم \" . قال : فوثب إليه عمر بن الخطاب فجعل يمشي مع [ أبي ] جندل إلى جنبه وهو يقول : اصبر أبا جندل ، فإنما هم المشركون ، وإنما دم أحدهم دم كلب ، قال : ويدني قائم السيف منه ، قال : يقول : رجوت أن يأخذ السيف فيضرب به أباه قال : فضن الرجل بأبيه . قال : ونفذت القضية ، فلما فرغا من الكتاب ، وكان رسول الله - صلى الله عليه وسلم - يصلي في الحرم ، وهو مضطرب في الحل ، قال : فقام رسول الله - صلى الله عليه وسلم - فقال : \" يا أيها الناس ، انحروا واحلقوا \" . قال : فما قام أحد . قال : ثم عاد بمثلها ، فما قام رجل حتى عاد - صلى الله عليه وسلم - بمثلها ، فما قام رجل .\nفرجع رسول الله - صلى الله عليه وسلم - فدخل على أم سلمة فقال : \" يا أم سلمة ما شأن الناس ؟ \" قالت : يا رسول الله ، قد دخلهم ما رأيت ، فلا تكلمن منهم إنسانا ، واعمد إلى هديك حيث كان فانحره واحلق ، فلو قد فعلت ذلك فعل الناس ذلك . فخرج رسول الله - صلى الله عليه وسلم - لا يكلم أحدا حتى أتى هديه فنحره ، ثم جلس فحلق ، قال : فقام الناس ينحرون ويحلقون . قال : حتى إذا كان بين مكة والمدينة في وسط الطريق نزلت سورة الفتح .\nهكذا ساقه أحمد من هذا الوجه ، وهكذا رواه يونس بن بكير وزياد البكائي ، عن ابن إسحاق ، بنحوه ، وفيه إغراب ، وقد رواه أيضا عن عبد الرزاق ، عن معمر ، عن الزهري ، به نحوه وخالفه في أشياء وقد رواه البخاري ، رحمه الله ، في صحيحه ، فساقه سياقة حسنة مطولة بزيادات جيدة ، فقال في كتاب الشروط من صحيحه :\nحدثنا عبد الله بن محمد ، حدثنا عبد الرزاق ، أخبرنا معمر : أخبرني الزهري : أخبرني عروة بن الزبير ، عن المسور بن مخرمة ومروان بن الحكم ، يصدق كل واحد منهما حديث صاحبه ، قالا خرج رسول الله - صلى الله عليه وسلم - زمن الحديبية في بضع عشرة مائة من أصحابه ، فلما أتى ذا الحليفة قلد الهدي وأشعره ، وأحرم منها بعمرة وبعث عينا له من خزاعة ، وسار حتى إذا كان بغدير الأشطاط أتاه عينه ، فقال : إن قريشا قد جمعوا لك جموعا ، وقد جمعوا لك الأحابيش وهم مقاتلوك وصادوك ومانعوك . فقال : \" أشيروا أيها الناس علي ، أترون أن نميل على عيالهم ، وذراري هؤلاء الذين يريدون أن صدونا عن البيت ؟ \" وفي لفظ : \" أترون أن نميل على ذراري هؤلاء الذين أعانوهم . فإن يأتونا كان الله قد قطع عنقا من المشركين وإلا تركناهم محزونين \" ، وفي لفظ : \" فإن قعدوا قعدوا موتورين مجهودين محروبين وإن نجوا يكن عنقا قطعها الله ، أم ترون أن نؤم البيت فمن صدنا عنه قاتلناه ؟ \" . فقال أبو بكر [ رضي الله عنه ] : يا رسول الله خرجت عامدا لهذا البيت ، لا نريد قتل أحد ولا حربا ، فتوجه له ، فمن صدنا عنه قاتلناه . وفي لفظ : فقال أبو بكر رضي الله عنه : الله ورسوله علم إنما جئنا معتمرين ، ولم نجئ لقتال أحد ، ولكن من حال بيننا وبين البيت قاتلناه . فقال النبي - صلى الله عليه وسلم - : \" فروحوا إذن \" ، وفي لفظ : \" فامضوا على اسم الله \" .\nحتى إذا كانوا ببعض الطريق ، قال النبي - صلى الله عليه وسلم - : \" إن خالد بن الوليد في خيل لقريش طليعة ، فخذوا ذات اليمين \" . فوالله ما شعر بهم خالد حتى إذا هم بقترة الجيش ، فانطلق يركض نذيرا لقريش ، وسار النبي - صلى الله عليه وسلم - حتى إذا كان بالثنية التي يهبط عليهم منها ، بركت به راحلته . فقال الناس : حل حل فألحت ، فقالوا : خلأت القصواء ، خلأت القصواء ، فقال النبي - صلى الله عليه وسلم - : \" ما خلأت القصواء ، وما ذاك لها بخلق ، ولكن حبسها حابس الفيل \" . ثم قال : \" والذي نفسي بيده ، لا يسألوني خطة يعظمون فيها حرمات الله ، إلا أعطيتهم إياها \" . ثم زجرها فوثبت ، فعدل عنهم حتى نزل بأقصى الحديبية على ثمد قليل الماء ، يتبرضه الناس تبرضا ، فلم يلبث الناس حتى نزحوه ، وشكي إلى رسول الله - صلى الله عليه وسلم - العطش ، فانتزع من كنانته سهما ثم أمرهم أن يجعلوه فيه ، فوالله ما زال يجيش لهم بالري حتى صدروا عنه ، فبينما هم كذلك إذ جاء بديل بن ورقاء الخزاعي في نفر من قومه من خزاعة ، وكانوا عيبة نصح رسول الله [ - صلى الله عليه وسلم - ] من أهل تهامة ، فقال : إني تركت كعب بن لؤي وعامر بن لؤي ، نزلوا أعداد مياه الحديبية معهم العوذ المطافيل ، وهم مقاتلوك وصادوك عن البيت . فقال النبي - صلى الله عليه وسلم - : \" إنا لم نجئ لقتال أحد ، ولكن جئنا معتمرين ، وإن قريشا قد نهكتهم الحرب فأضرت بهم ، فإن شاءوا ماددتهم مدة ويخلوا بيني وبين الناس ، فإن أظهر فإن شاءوا أن يدخلوا فيما دخل فيه الناس فعلوا ، وإلا فقد جموا ، وإن هم أبوا فوالذي نفسي بيده لأقاتلنهم على أمري هذا حتى تنفرد سالفتي ، ولينفذن الله أمره \" قال بديل : سأبلغهم ما تقول ، فانطلق حتى أتى قريشا فقال : إنا قد جئنا من عند هذا الرجل ، وسمعناه يقول قولا فإن شئتم أن نعرضه عليكم فعلنا ، فقال سفهاؤهم : لا حاجة لنا أن تخبرنا عنه بشيء . وقال ذوو الرأي منهم : هات ما سمعته يقول قال : سمعته يقول كذا وكذا ، فحدثهم بما قال رسول الله - صلى الله عليه وسلم - فقام عروة بن مسعود فقال : أي قوم ، ألستم بالوالد ؟ قالوا : بلى . قال : أولست بالولد ؟ قالوا : بلى . قال : فهل تتهموني ؟ قالوا : لا . قال : ألستم تعلمون أني استنفرت أهل عكاظ ، فلما بلحوا علي جئتكم بأهلي وولدي ومن أطاعني ؟ قالوا : بلى . قال : فإن هذا قد عرض عليكم خطة رشد فاقبلوها ودعوني آته . قالوا : ائته . فأتاه فجعل يكلم رسول الله - صلى الله عليه وسلم - فقال النبي - صلى الله عليه وسلم - له نحوا من قوله لبديل بن ورقاء . فقال عروة عند ذلك : أي محمد ، أرأيت إن استأصلت أمر قومك ، هل سمعت بأحد من العرب اجتاح أصله قبلك ؟ وإن تك الأخرى فإني والله لأرى وجوها ، وإني لأرى أشوابا من الناس خليقا أن يفروا ويدعوك ، فقال أبو بكر رضي الله عنه : امصص بظر اللات ! أنحن نفر وندعه ؟ ! قال : من ذا ؟ قالوا : أبو بكر . قال : أما والذي نفسي بيده لولا يد كانت لك عندي لم أجزك بها ، لأجبتك . قال : وجعل يكلم النبي - صلى الله عليه وسلم - فكلما كلمه أخذ بلحيته ، والمغيرة بن شعبة رضي الله عنه قائم على رأس النبي - صلى الله عليه وسلم - ومعه السيف وعليه المغفر ، فكلما أهوى عروة بيده إلى لحية النبي - صلى الله عليه وسلم - ضرب يده بنعل السيف ، وقال له : أخر يدك من لحية النبي - صلى الله عليه وسلم - . فرفع عروة رأسه وقال : من هذا ؟ قال : المغيرة بن شعبة . فقال : أي غدر ، ألست أسعى في غدرتك ؟ ! وكان المغيرة بن شعبة صحب قوما في الجاهلية فقتلهم وأخذ أموالهم ، ثم جاء فأسلم ، فقال النبي - صلى الله عليه وسلم - : \" أما الإسلام فأقبل ، وأما المال فلست منه في شي \" . ثم إن عروة جعل يرمق أصحاب النبي - صلى الله عليه وسلم - بعينيه ، قال : فوالله ما تنخم رسول الله [ - صلى الله عليه وسلم - ] نخامة إلا وقعت في كف رجل منهم ، فدلك بها وجهه وجلده ، وإذا أمرهم ابتدروا أمره ، وإذا توضأ كادوا يقتتلون على وضوئه ، وإذا تكلم خفضوا أصواتهم عنده ، وما يحدون النظر إليه ، تعظيما له - صلى الله عليه وسلم - فرجع عروة إلى أصحابه فقال : أي قوم ، والله لقد وفدت على الملوك ، ووفدت على كسرى وقيصر والنجاشي ، والله إن رأيت ملكا قط يعظمه أصحابه ما يعظم أصحاب محمد محمدا ، والله إن تنخم نخامة إلا وقعت في كف رجل منهم ، فدلك بها وجهه وجلده ، وإذا أمرهم ابتدروا أمره ، وإذا توضأ كادوا يقتتلون على وضوئه ، وإذا تكلم خفضوا أصواتهم عنده ، وما يحدون النظر إليه تعظيما له ، وإنه قد عرض عليكم خطة رشد فاقبلوها . فقال رجل منهم من بني كنانة : دعوني آته . فقالوا : ائته فلما أشرف على النبي - صلى الله عليه وسلم - وأصحابه ، قال النبي - صلى الله عليه وسلم - : \" هذا فلان ، وهو من قوم يعظمون البدن ، فابعثوها له \" فبعثت له ، واستقبله الناس يلبون ، فلما رأى ذلك قال : سبحان الله ! ما ينبغي لهؤلاء أن يصدوا عن البيت . فلما رجع إلى أصحابه قال : رأيت البدن قد قلدت وأشعرت ، فما أرى أن يصدوا عن البيت . فقال رجل منهم يقال له : \" مكرز بن حفص \" ، فقال : دعوني آته . فقالوا : ائته . فلما أشرف عليهم قال النبي - صلى الله عليه وسلم - : \" هذا مكرز [ بن حفص ] وهو رجل فاجر \" ، فجعل يكلم النبي - صلى الله عليه وسلم - فبينما هو يكلمه إذ جاء سهل بن عمرو .\nوقال معمر : أخبرني أيوب ، عن عكرمة أنه قال : لما جاء سهيل بن عمرو قال النبي - صلى الله عليه وسلم - : \" قد سهل لكم من أمركم \" .\nقال معمر : قال الزهري في حديثه : فجاء سهيل بن عمرو فقال : هات أكتب بيننا وبينك كتابا فدعا النبي - صلى الله عليه وسلم - الكاتب ، فقال النبي - صلى الله عليه وسلم - : \" [ اكتب ] : بسم الله الرحمن الرحيم \" ، فقال سهل [ بن عمرو ] : أما \" الرحمن \" فوالله ما أدري ما هو ، ولكن اكتب : \" باسمك اللهم \" ، كما كنت تكتب . فقال المسلمون : والله لا نكتبها إلا \" بسم الله الرحمن الرحيم \" . فقال النبي - صلى الله عليه وسلم - : \" اكتب : باسمك اللهم \" . ثم قال : \" هذا ما قاضى عليه محمد رسول الله \" . فقال سهل : والله لو كنا نعلم أنك رسول الله ما صددناك عن البيت ولا قاتلناك ، ولكن اكتب : \" محمد بن عبد الله \" ، فقال النبي - صلى الله عليه وسلم - : \" والله إني لرسول الله وإن كذبتموني . اكتب محمد بن عبد الله \" قال الزهري : وذلك لقوله : \" والله لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتهم إياها \" . فقال له النبي - صلى الله عليه وسلم - : \" على أن تخلوا بيننا وبين البيت فنطوف به \" . فقال سهل : والله لا تتحدث العرب أنا أخذنا ضغطة ، ولكن ذلك من العام المقبل ، فكتب ، فقال سهل : \" وعلى أن لا يأتيك منا رجل وإن كان على دينك إلا رددته إلينا \" . فقال المسلمون : سبحان الله ! كيف يرد إلى المشركين وقد جاء مسلما ؟ ! فبينما هم كذلك إذ جاء أبو جندل بن سهل بن عمرو يرسف في قيوده قد خرج من أسفل مكة حتى رمى بنفسه بين أظهر المسلمين ، فقال سهل : هذا يا محمد أول من أقاضيك عليه أن ترده إلي ، فقال النبي - صلى الله عليه وسلم - : \" إنا لم نقض الكتاب بعد \" . قال : فوالله إذا لا أصالحك على شيء أبدا . فقال النبي - صلى الله عليه وسلم - : \" فأجزه لي \" فقال : ما أنا بمجيز ذلك لك ، قال : \" بلى فافعل \" . قال : ما أنا بفاعل . قال مكرز : بلى قد أجزناه لك . قال أبو جندل : أي معشر المسلمين ، أرد إلى المشركين وقد جئت مسلما ؟ ألا ترون ما قد لقيت ؟ ! وكان قد عذب عذابا شديدا في الله عز وجل . قال عمر [ بن الخطاب ] رضي الله عنه : فأتيت نبي الله - صلى الله عليه وسلم - فقلت : ألست نبي الله حقا ؟ قال - صلى الله عليه وسلم - : \" بلى \" . قلت : ألسنا على الحق وعدونا على الباطل ؟ قال : \" بلى \" . قلت : فلم نعطي الدنية في ديننا إذا ؟ قال : \" إني رسول الله ، ولست أعصيه ، وهو ناصري \" ، قلت : أولست كنت تحدثنا أنا سنأتي البيت ونطوف به ؟ قال : \" بلى ، أفأخبرتك أنا نأتيه العام ؟ \" قلت : لا قال : \" فإنك آتيه ومطوف به \" . قال : فأتيت أبا بكر فقلت : يا أبا بكر أليس هذا نبي الله حقا ؟ قال : بلى . قلت : ألسنا على الحق وعدونا على الباطل ؟ قال : بلى . قلت : فلم نعطي الدنية في ديننا إذا ؟ قال : أيها الرجل ، إنه رسول الله ، وليس يعصي ربه ، وهو ناصره ، فاستمسك بغرزه ، فوالله إنه على الحق . قلت : أوليس كان يحدثنا أنا سنأتي البيت ونطوف به ؟ قال : بلى قال : أفأخبرك أنك تأتيه العام ؟ قلت : لا . قال : فإنك تأتيه وتطوف به .\nقال الزهري : قال عمر : فعملت لذلك أعمالا . قال : فلما فرغ من قضية الكتاب قال رسول الله - صلى الله عليه وسلم - لأصحابه : \" قوموا فانحروا ثم احلقوا \" . قال : فوالله ما قام منهم رجل حتى قال ذلك ثلاث مرات ! ! فلما لم يقم منهم أحد دخل على أم سلمة ، فذكر لها ما لقي من الناس ، قالت له أم سلمة : يا نبي الله ، أتحب ذلك ؟ اخرج ثم لا تكلم أحدا منهم كلمة حتى تنحر بدنك وتدعو حالقك فيحلقك ، فخرج فلم يكلم أحدا منهم حتى فعل ذلك ، نحر بدنه ، ودعا حالقه فحلقه ، فلما رأوا ذلك قاموا فنحروا وجعل بعضهم يحلق بعضا ، حتى كاد بعضهم يقتل بعضا غما ، ثم جاءه نسوة مؤمنات ، فأنزل الله ، عز وجل : ( يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات ) حتى بلغ : ( بعصم الكوافر ) [ الممتحنة : 10 ] . فطلق عمر يومئذ امرأتين كانتا له في الشرك ، فتزوج إحداهما معاوية بن أبي سفيان ، والأخرى صفوان بن أمية . ثم رجع النبي - صلى الله عليه وسلم - إلى المدينة فجاءه أبو بصير - رجل من قريش - وهو مسلم ، فأرسلوا في طلبه رجلين ، فقالوا : العهد الذي جعلت لنا ، فدفعه إلى الرجلين فخرجا به حتى بلغا ذا الحليفة ، فنزلوا يأكلون من تمر لهم ، فقال أبو بصير لأحد الرجلين : والله إني لأرى سيفك هذا يا فلان جيدا ، فاستله الآخر ، فقال : أجل ! والله إنه لجيد ، لقد جربت منه ثم جربت ، فقال أبو بصير : أرني أنظر إليه ، فأمكنه منه فضربه حتى برد ، وفر الآخر حتى أتى المدينة ، فدخل المسجد يعدو ، فقال رسول الله - صلى الله عليه وسلم - حين رآه : \" لقد رأى هذا ذعرا \" ، فلما انتهى إلى النبي - صلى الله عليه وسلم - قال : قتل والله صاحبي ، وإني لمقتول . فجاء أبو بصير فقال : يا رسول الله ، قد - والله - أوفى الله ذمتك ، قد رددتني إليهم ثم نجاني الله منهم ، فقال النبي - صلى الله عليه وسلم - : \" ويل أمه مسعر حرب ! لو كان له أحد \" . فلما سمع ذلك عرف أنه سيرده إليهم ، فخرج حتى أتى سيف البحر ، قال : وتفلت منهم أبو جندل بن سهل ، فلحق بأبي بصير ، فجعل لا يخرج من قريش رجل قد أسلم إلا لحق بأبي بصير ، حتى اجتمعت منهم عصابة ، فوالله ما يسمعون بعير خرجت لقريش إلى الشام إلا اعترضوا لها فقتلوهم ، وأخذوا أموالهم . فأرسلت قريش إلى النبي - صلى الله عليه وسلم - تناشده الله والرحم لما أرسل إليهم : \" فمن أتاه منهم فهو آمن \" . فأرسل النبي - صلى الله عليه وسلم - إليهم ، وأنزل الله عز وجل : ( وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة ) حتى بلغ : ( حمية الجاهلية ) ، وكانت حميتهم أنهم لم يقروا أنه رسول الله ولم يقروا ببسم الله الرحمن الرحيم ، وحالوا بينهم وبين البيت .\nهكذا ساقه البخاري هاهنا ، وقد أخرجه في التفسير ، وفي عمرة الحديبية ، وفي الحج ، وغير ذلك من حديث معمر وسفيان بن عيينة ، كلاهما عن الزهري ، به ووقع في بعض الأماكن عن الزهري ، عن عروة ، عن مروان والمسور بن [ مخرمة ] ، عن رجال من أصحاب النبي - صلى الله عليه وسلم - بذلك . وهذا أشبه والله أعلم ، ولم يسقه أبسط من هاهنا ، وبينه وبين سياق ابن إسحاق تباين في مواضع ، وهناك فوائد ينبغي إضافتها إلى ما هاهنا ، ولذلك سقنا تلك الرواية وهذه ، والله المستعان وعليه التكلان ، ولا حول ولا قوة إلا بالله العزيز الحكيم .\nوقال البخاري في التفسير : حدثنا أحمد بن إسحاق السلمي ، حدثنا يعلى ، حدثنا عبد العزيز بن سياه ، عن حبيب بن أبي ثابت ، قال : أتيت أبا وائل أسأله فقال : كنا بصفين فقال رجل : ألم تر إلى الذين يدعون إلى كتاب الله ؟ فقال علي بن أبي طالب : نعم . فقال سهل بن حنيف : اتهموا أنفسكم ، فلقد رأيتنا يوم الحديبية - يعني : الصلح الذي كان بين النبي - صلى الله عليه وسلم - والمشركين - ولو نرى قتالا لقاتلنا ، فجاء عمر فقال : ألسنا على الحق وهم على الباطل ؟ أليس قتلانا في الجنة وقتلاهم في النار ؟ فقال : \" بلى \" قال : ففيم نعطي الدنية في ديننا ، ونرجع ولما يحكم الله بيننا ؟ فقال : \" يابن الخطاب ، إني رسول الله ، ولن يضيعني الله أبدا \" ، فرجع متغيظا ، فلم يصبر حتى جاء أبا بكر فقال : يا أبا بكر ، ألسنا على الحق وهم على الباطل ، فقال : يابن الخطاب ، إنه رسول الله ، ولن يضيعه الله أبدا ، فنزلت سورة الفتح .\nوقد رواه البخاري أيضا في مواضع أخر ومسلم والنسائي من طرق أخر عن أبي وائل سفيان بن سلمة ، عن سهل بن حنيف به ، وفي بعض ألفاظه : \" يا أيها الناس ، اتهموا الرأي ، فلقد رأيتني يوم أبي جندل ولو أقدر على أن أرد على رسول الله - صلى الله عليه وسلم - أمره لرددته \" وفي رواية : فنزلت سورة الفتح ، فدعا رسول الله - صلى الله عليه وسلم - عمر بن الخطاب فقرأها عليه .\nقال الإمام أحمد : حدثنا عفان ، حدثنا حماد ، عن ثابت ، عن أنس ، أن قريشا صالحوا النبي - صلى الله عليه وسلم - فيهم سهل بن عمرو ، فقال النبي - صلى الله عليه وسلم - لعلي : \" اكتب : بسم الله الرحمن الرحيم \" ، فقال سهل : لا ندري ما بسم الله الرحمن الرحيم ، ولكن اكتب ما نعرف : \" باسمك اللهم \" . فقال : \" اكتب من محمد رسول الله \" . قال : لو نعلم أنك رسول الله لاتبعناك ، ولكن اكتب اسمك واسم أبيك . فقال النبي - صلى الله عليه وسلم - : \" اكتب : من محمد بن عبد الله \" . واشترطوا على النبي - صلى الله عليه وسلم - أن من جاء منكم لم نرده عليكم ، ومن جاءكم منا رددتموه علينا ، فقال : يا رسول الله أتكتب هذا ؟ قال : \" نعم ، إنه من ذهب منا إليهم فأبعده الله \" . رواه مسلم من حديث حماد بن سلمة ، به .\nوقال أحمد أيضا : حدثنا عبد الرحمن بن مهدي ، حدثنا عكرمة بن عمار قال : حدثني سماك ، عن عبد الله بن عباس قال : لما خرجت الحرورية اعتزلوا ، فقلت لهم : إن رسول الله - صلى الله عليه وسلم - يوم الحديبية صالح المشركين ، فقال لعلي : \" اكتب يا علي : هذا ما صالح عليه محمد رسول الله \" قالوا : لو نعلم أنك رسول الله ما قاتلناك ، فقال رسول الله : \" امح يا علي ، اللهم إنك تعلم أني رسولك ، امح يا علي ، واكتب : هذا ما صالح عليه محمد بن عبد الله \" . والله لرسول الله خير من علي ، وقد محا نفسه ، ولم يكن محوه ذلك يمحاه من النبوة ، أخرجت من هذه ؟ قالوا : نعم .\nورواه أبو داود من حديث عكرمة بن عمار اليمامي ، بنحوه .\nوروى الإمام أحمد ، عن يحيى بن آدم : حدثنا زهير ، عن محمد بن عبد الرحمن بن أبي ليلى ، عن الحكم ، عن مقسم ، عن ابن عباس ، رضي الله عنهما ، قال : نحر رسول الله - صلى الله عليه وسلم - يوم الحديبية سبعين بدنة فيها جمل لأبي جهل ، فلما صدت عن البيت حنت كما تحن إلى أولادها .\n                                    ",
      "qortoby": "إِذۡ جَعَلَ ٱلَّذِينَ كَفَرُواْ فِي قُلُوبِهِمُ ٱلۡحَمِيَّةَ حَمِيَّةَ ٱلۡجَٰهِلِيَّةِ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوٓاْ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا ٦٢\n                                    \n                                    \n                                    قوله تعالى : إذ جعل الذين كفروا في قلوبهم الحمية حمية الجاهلية فأنزل الله سكينته على رسوله وعلى المؤمنين وألزمهم كلمة التقوى وكانوا أحق بها وأهلها وكان الله بكل شيء عليما .\nالعامل في إذ قوله تعالى : لعذبنا أي : لعذبناهم إذ جعلوا هذا . أو فعل مضمر تقديره واذكروا . الحمية فعيلة وهي الأنفة . يقال : حميت عن كذا حمية ( بالتشديد ) ومحمية إذا أنفت منه وداخلك عار وأنفة أن تفعله . ومنه قول المتلمس :\nألا إنني منهم وعرضي عرضهم كذي الأنف يحمي أنفه أن يكشما\nأي : يمنع . قال الزهري : حميتهم أنفتهم من الإقرار للنبي - صلى الله عليه وسلم - بالرسالة والاستفتاح ببسم الله الرحمن الرحيم ، ومنعهم من دخول مكة . وكان الذي امتنع من كتابة بسم الله الرحمن الرحيم ومحمد رسول الله : سهيل بن عمرو ، على ما تقدم . وقال ابن بحر : حميتهم عصبيتهم لآلهتهم التي كانوا يعبدونها من دون الله تعالى ، والأنفة من أن يعبدوا غيرها . وقيل : حمية الجاهلية إنهم قالوا : قتلوا أبناءنا وإخواننا ثم يدخلون علينا في منازلنا ، واللات والعزى لا يدخلها أبدا . فأنزل الله سكينته أي الطمأنينة والوقار . على رسوله وعلى المؤمنين وقيل : ثبتهم على الرضا والتسليم ، ولم يدخل قلوبهم ما أدخل قلوب أولئك من الحمية . وألزمهم كلمة التقوى قيل : لا إله إلا الله . روي مرفوعا من حديث أبي بن كعب عن النبي - صلى الله عليه وسلم - . وهو قول علي وابن عمر وابن عباس ، وعمرو بن ميمون ومجاهد وقتادة وعكرمة والضحاك ، وسلمة بن كهيل وعبيد بن عمير وطلحة بن مصرف ، والربيع والسدي وابن زيد . وقاله عطاء الخراساني ، وزاد ( محمد رسول الله ) وعن علي وابن عمر أيضا هي لا إله إلا الله والله أكبر . وقال عطاء بن أبي رباح ومجاهد أيضا : هي لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شيء قدير . وقال الزهري : بسم الله الرحمن الرحيم . يعني أن المشركين لم يقروا بهذه الكلمة ، فخص الله بها المؤمنين . وكلمة التقوى هي التي يتقى بها من الشرك . وعن مجاهد أيضا أن كلمة التقوى الإخلاص . وكانوا أحق بها أي أحق بها من كفار مكة ; لأن الله تعالى اختارهم لدينه وصحبة نبيه . وكان الله بكل شيء عليما\n                                    ",
      "saadi": "إِذۡ جَعَلَ ٱلَّذِينَ كَفَرُواْ فِي قُلُوبِهِمُ ٱلۡحَمِيَّةَ حَمِيَّةَ ٱلۡجَٰهِلِيَّةِ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوٓاْ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا ٦٢\n                                        \n                                        \n                                        \n                                        يقول تعالى: { إِذْ جَعَلَ الَّذِينَ كَفَرُوا فِي قُلُوبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ } حيث أنفوا من كتابة { بسم الله الرحمن الرحيم } وأنفوا من دخول رسول الله صلى الله عليه وسلم والمؤمنين إليهم في تلك السنة، لئلا يقول الناس: { دخلوا مكة قاهرين لقريش } وهذه الأمور ونحوها من أمور الجاهلية، لم تزل في قلوبهم حتى أوجبت لهم ما أوجبت من كثير من المعاصي، { فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ } فلم يحملهم الغضب على مقابلة المشركين بما قابلوهم به، بل صبروا لحكم الله، والتزموا الشروط التي فيها تعظيم حرمات الله ولو كانت ما كانت، ولم يبالوا بقول القائلين، ولا لوم اللائمين.\n{ وَأَلْزَمَهُمْ كَلِمَةَ التَّقْوَى } وهي { لا إله إلا الله } وحقوقها، ألزمهم القيام بها، فالتزموها وقاموا بها، { وَكَانُوا أَحَقَّ بِهَا } من غيرهم { و } كانوا { أهلها } الذين استأهلوها لما يعلم الله عندهم وفي قلوبهم من الخير، ولهذا قال: { وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا }\n                                    "
    }
  },
  {
    "id": 26,
    "versesNumber": 27,
    "souraName": "Al-Fath.html",
    "contnent": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡيَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَآءَ ٱللَّهُ ءَامِنِينَ مُحَلِّقِينَ رُءُوسَكُمۡ وَمُقَصِّرِينَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُواْ فَجَعَلَ مِن دُونِ ذَٰلِكَ فَتۡحٗا قَرِيبًا ٧٢",
    "tafsier": {
      "ibnkther": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡيَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَآءَ ٱللَّهُ ءَامِنِينَ مُحَلِّقِينَ رُءُوسَكُمۡ وَمُقَصِّرِينَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُواْ فَجَعَلَ مِن دُونِ ذَٰلِكَ فَتۡحٗا قَرِيبًا ٧٢\n                                    \n                                    \n                                    كان رسول الله - صلى الله عليه وسلم - قد أري في المنام أنه دخل مكة وطاف بالبيت فأخبر أصحابه بذلك وهو بالمدينة ، فلما ساروا عام الحديبية لم يشك جماعة منهم أن هذه الرؤيا تتفسر هذا العام ، فلما وقع ما وقع من قضية الصلح ورجعوا عامهم ذلك على أن يعودوا من قابل ، وقع في نفوس بعض الصحابة من ذلك شيء ، حتى سأل عمر بن الخطاب ، رضي الله عنه في ذلك ، فقال له فيما قال : أفلم تكن تخبرنا أنا سنأتي البيت ونطوف به ؟ قال : \" بلى ، أفأخبرتك أنك تأتيه عامك هذا \" قال : لا قال : \" فإنك آتيه ومطوف به \" . وبهذا أجاب الصديق - رضي الله عنه - أيضا حذو القذة بالقذة ; ولهذا قال تعالى : ( لقد صدق الله رسوله الرؤيا بالحق لتدخلن المسجد الحرام إن شاء الله ) : [ و ] هذا لتحقيق الخبر وتوكيده ، وليس هذا من الاستثناء في شيء ، [ وقوله ] : ( آمنين ) أي : في حال دخولكم . وقوله : ( محلقين رءوسكم ومقصرين ) ، حال مقدرة ; لأنهم في حال حرمهم لم يكونوا محلقين ومقصرين ، وإنما كان هذا في ثاني الحال ، كان منهم من حلق رأسه ومنهم من قصره ، وثبت في الصحيحين أن رسول الله - صلى الله عليه وسلم - قال : \" رحم الله المحلقين \" ، قالوا : والمقصرين يا رسول الله ؟ قال : \" رحم الله المحلقين \" . قالوا : والمقصرين يا رسول الله ؟ قال : \" رحم الله المحلقين \" . قالوا : والمقصرين يا رسول الله ؟ قال : \" والمقصرين \" في الثالثة أو الرابعة .\nوقوله : ( لا تخافون ) : حال مؤكدة في المعنى ، فأثبت لهم الأمن حال الدخول ، ونفى عنهم الخوف حال استقرارهم في البلد لا يخافون من أحد . وهذا كان في عمرة القضاء في ذي القعدة سنة سبع ، فإن النبي - صلى الله عليه وسلم - لما رجع منالحديبية في ذي القعدة رجع إلى المدينة فأقام بها ذا الحجة والمحرم ، وخرج في صفر إلى خيبر ففتحها الله عليه بعضها عنوة وبعضها صلحا ، وهي إقليم عظيم كثير النخل والزروع ، فاستخدم من فيها من اليهود عليها على الشطر ، وقسمها بين أهل الحديبية وحدهم ، ولم يشهدها أحد غيرهم إلا الذين قدموا من الحبشة ، جعفر بن أبي طالب وأصحابه ، وأبو موسى الأشعري وأصحابه ، ولم يغب منهم أحد ، قال ابن زيد : إلا أبا دجانة سماك بن خرشة ، كما هو مقرر في موضعه ثم رجع إلى المدينة ، فلما كان في ذي القعدة [ في ] سنة سبع خرج إلى مكة معتمرا هو وأهل الحديبية ، فأحرم من ذي الحليفة ، وساق معه الهدي ، قيل : كان ستين بدنة ، فلبى وسار أصحابه يلبون . فلما كان قريبا من مر الظهران بعث محمد بن مسلمة بالخيل والسلاح أمامه ، فلما رآه المشركون رعبوا رعبا شديدا ، وظنوا أن رسول الله - صلى الله عليه وسلم - يغزوهم ، وأنه قد نكث العهد الذي بينه وبينهم من وضع القتال عشر سنين ، وذهبوا فأخبروا أهل مكة ، فلما جاء رسول الله - صلى الله عليه وسلم - فنزل بمر الظهران حيث ينظر إلى أنصاب الحرم ، بعث السلاح من القسي والنبل والرماح إلى بطن يأجج ، وسار إلى مكة بالسيف مغمدة في قربها ، كما شارطهم عليه . فلما كان في أثناء الطريق بعثت قريش مكرز بن حفص فقال : يا محمد ، ما عرفناك تنقض العهد . قال : \" وما ذاك ؟ \" قال : دخلت : علينا بالسلاح والقسي والرماح . فقال : \" لم يكن ذلك ، وقد بعثنا به إلى يأجج \" ، فقال : بهذا عرفناك ، بالبر والوفاء . وخرجت رءوس الكفار من مكة لئلا ينظروا إلى رسول الله - صلى الله عليه وسلم - و [ لا ] إلى أصحابه غيظا وحنقا ، وأما بقية أهل مكة من الرجال والنساء والولدان فجلسوا في الطرق وعلى البيوت ينظرون إلى رسول الله - صلى الله عليه وسلم - وأصحابه ، فدخلها عليه الصلاة والسلام ، وبين يديه أصحابه يلبون ، والهدي قد بعثه إلى ذي طوى ، وهو راكب ناقته القصواء التي كان راكبها يوم الحديبية ، وعبد الله بن رواحة الأنصاري آخذ بزمام ناقة رسول الله - صلى الله عليه وسلم - يقودها ، وهو يقول :\nباسم الذي لا دين إلا دينه باسم الذي محمد رسوله خلوا بني الكفار عن سبيله\nاليوم نضربكم على تأويله كما ضربناكم على تنزيله\nضربا يزيل الهام عن مقيله ويذهل الخليل عن خليله\nقد أنزل الرحمن في تنزيله في صحف تتلى على رسوله\nبأن خير القتل في سبيله يا رب إني مؤمن بقيله\nفهذا مجموع من روايات متفرقة .\nقال يونس بن بكير ، عن محمد بن إسحاق : حدثني عبد الله بن أبي بكر بن حزم قال : لما دخل رسول الله - صلى الله عليه وسلم - مكة في عمرة القضاء ، دخلها وعبد الله بن رواحة آخذ بخطام ناقته - صلى الله عليه وسلم - وهو يقول :\nخلوا بني الكفار عن سبيله إني شهيد أنه رسوله\nخلوا فكل الخير في رسوله يا رب إني مؤمن بقيله\nنحن قتلناكم على تأويله كما قتلناكم على تنزيله\nضربا يزيل الهام عن مقيله ويذهل الخليل عن خليله\nوقال عبد الرزاق : أخبرنا معمر ، عن الزهري ، عن أنس بن مالك قال : لما دخل رسول الله - صلى الله عليه وسلم - مكة في عمرة القضاء ، مشى عبد الله بن رواحة بين يديه ، وفي رواية وابن رواحة آخذ بغرزه ، وهو يقول :\nخلوا بني الكفار عن سبيله قد نزل الرحمن في تنزيله\nبأن خير القتل في سبيله يا رب إني مؤمن بقيله\nنحن قتلناكم على تأويله كما قتلناكم على تنزيله\nضربا يزيل الهام عن مقيله ويذهل الخليل عن خليله\nوقال الإمام أحمد : حدثنا محمد بن الصباح ، حدثنا إسماعيل - يعني ابن زكريا - عن عبد الله - يعني ابن عثمان - عن أبي الطفيل ، عن ابن عباس ; أن رسول الله - صلى الله عليه وسلم - لما نزل مر الظهران في عمرته ، بلغ أصحاب رسول الله - صلى الله عليه وسلم - أن قريشا [ تقول ] : ما يتباعثون من العجف . فقال أصحابه : لو انتحرنا من ظهرنا ، فأكلنا من لحمه ، وحسونا من مرقه ، أصبحنا غدا حين ندخل على القوم وبنا جمامة . قال : \" لا تفعلوا ، ولكن اجمعوا لي من أزوادكم \" . فجمعوا له وبسطوا الأنطاع ، فأكلوا حتى تركوا وحثا كل واحد منهم في جرابه ، ثم أقبل رسول الله - صلى الله عليه وسلم - حتى دخل المسجد ، وقعدت قريش نحو الحجر ، فاضطبع بردائه ، ثم قال : \" لا يرى القوم فيكم غميرة \" فاستلم الركن ثم رمل ، حتى إذا تغيب بالركن اليماني مشى إلى الركن الأسود ، فقالت قريش : ما ترضون بالمشي أما إنكم لتنقزون نقز الظباء ، ففعل ذلك ثلاثة أشواط ، فكانت سنة . قال أبو الطفيل : فأخبرني ابن عباس : أن رسول الله - صلى الله عليه وسلم - فعل ذلك في حجة الوداع .\nوقال أحمد أيضا : حدثنا يونس ; حدثنا حماد بن زيد ، حدثنا أيوب ، عن سعيد بن جبير ، عن ابن عباس قال : قدم رسول الله - صلى الله عليه وسلم - وأصحابه مكة ، وقد وهنتهم حمى يثرب ، ولقوا منها سوءا ، فقال المشركون : إنه يقدم عليكم قوم قد وهنتهم حمى يثرب ، ولقوا منها شرا ، وجلس المشركون من الناحية التي تلي الحجر ، فأطلع الله نبيه - صلى الله عليه وسلم - على ما قالوا ، فأمر رسول الله - صلى الله عليه وسلم - [ أصحابه ] أن يرملوا الأشواط الثلاثة ; ليرى المشركون جلدهم ، قال : فرملوا ثلاثة أشواط ، وأمرهم أن يمشوا بين الركنين حيث لا يراهم المشركون ، ولم يمنع النبي - صلى الله عليه وسلم - أن يرملوا الأشواط كلها إلا إبقاء عليهم ، فقال المشركون : أهؤلاء الذين زعمتم أن الحمى قد وهنتهم ؟ هؤلاء أجلد من كذا وكذا .\nأخرجاه في الصحيحين من حديث حماد بن زيد ، به وفي لفظ : قدم النبي - صلى الله عليه وسلم - وأصحابه صبيحة رابعة ، أي من ذي القعدة ، فقال المشركون : إنه يقدم عليكم وفد قد وهنتهم حمى يثرب ، فأمرهم النبي - صلى الله عليه وسلم - أن يرملوا الأشواط الثلاثة ، ولم يمنعهم أن يرملوا الأشواط كلها إلا الإبقاء عليهم .\nقال البخاري : وزاد ابن سلمة - يعني حماد بن سلمة - عن أيوب ، عن سعيد بن جبير ، عن ابن عباس قال : لما قدم النبي - صلى الله عليه وسلم - لعامه الذي استأمن قال : \" ارملوا \" . ليرى المشركون قوتهم ، والمشركون من قبل قعيقعان .\nوحدثنا محمد ، حدثنا سفيان بن عيينة ، عن عمرو بن دينار ، عن عطاء ، عن ابن عباس قال : إنما سعى النبي - صلى الله عليه وسلم - بالبيت وبالصفا والمروة ، ليرى المشركون قوته .\nورواه في مواضع أخر ، ومسلم والنسائي ، من طرق ، عن سفيان بن عيينة ، به .\nوقال أيضا : حدثنا علي بن عبد الله ، حدثنا سفيان ، حدثنا إسماعيل بن أبي خالد ، سمع ابن أبي أوفى يقول : لما اعتمر رسول الله - صلى الله عليه وسلم - سترناه من غلمان المشركين ومنهم ; أن يؤذوا رسول الله - صلى الله عليه وسلم - . انفرد به البخاري دون مسلم .\nوقال البخاري أيضا : حدثنا محمد بن رافع ، حدثنا سريج بن النعمان ، حدثنا فليح ، وحدثني محمد بن الحسين بن إبراهيم ، حدثنا أبي حدثنا فليح بن سليمان ، عن نافع ، عن ابن عمر ; أن رسول الله - صلى الله عليه وسلم - خرج معتمرا ، فحال كفار قريش بينه وبين البيت ، فنحر هديه وحلق رأسه بالحديبية ، وقاضاهم على أن يعتمر العام المقبل ، ولا يحمل سلاحا عليهم إلا سيوفا ، ولا يقيم بها إلا ما أحبوا . فاعتمر من العام المقبل ، فدخلها كما كان صالحهم ، فلما أن قام بها ثلاثا ، أمروه أن يخرج فخرج .\nوهو في صحيح مسلم أيضا .\nوقال البخاري أيضا : حدثنا عبيد الله بن موسى ، عن إسرائيل ، عن أبي إسحاق ، عن البراء ، قال : اعتمر النبي - صلى الله عليه وسلم - في ذي القعدة ، فأبى أهل مكة أن يدعوه يدخل مكة حتى قاضاهم على أن يقيم بها ثلاثة أيام ، فلما كتبوا الكتاب كتبوا : \" هذا ما قاضانا عليه محمد رسول الله \" . قالوا : لا نقر بهذا ، ولو نعلم أنك رسول الله ما منعناك شيئا ، ولكن أنت محمد بن عبد الله . قال : \" أنا رسول الله ، وأنا محمد بن عبد الله \" . ثم قال لعلي بن أبي طالب : \" امح : رسول الله \" . قال : لا والله لا أمحوك أبدا . فأخذ رسول الله - صلى الله عليه وسلم - الكتاب ، وليس يحسن يكتب ، فكتب : \" هذا ما قاضى عليه محمد بن عبد الله : لا يدخل مكة السلاح إلا السيف في القراب ، وألا يخرج من أهلها بأحد أراد أن يتبعه ، وألا يمنع من أصحابه أحدا إن أراد أن يقيم بها \" فلما دخلها ومضى الأجل ، أتوا عليا فقالوا : قل لصاحبك : اخرج عنا فقد مضى الأجل ، فخرج النبي - صلى الله عليه وسلم - فتبعته ابنة حمزة تنادي : يا عم ، يا عم . فتناولها علي فأخذ بيدها ، وقال لفاطمة : دونك ابنة عمك فحملتها ، فاختصم فيها علي وزيد وجعفر ، فقال علي : أنا أخذتها وهي ابنة عمي ، وقال جعفر : ابنة عمي وخالتها تحتي ، وقال زيد : ابنة أخي ، فقضى بها النبي - صلى الله عليه وسلم - لخالتها ، وقال : \" الخالة بمنزلة الأم \" ، وقال لعلي : \" أنت مني وأنا منك \" وقال لجعفر : \" أشبهت خلقي وخلقي \" وقال لزيد : \" أنت أخونا ومولانا \" قال علي : ألا تتزوج ابنة حمزة ؟ قال : \" إنها ابنة أخي من الرضاعة \" انفرد به من هذا الوجه .\nوقوله : ( فعلم ما لم تعلموا فجعل من دون ذلك فتحا قريبا ) أي : فعلم الله تعالى من الخيرة والمصلحة في صرفكم عن مكة ودخولكم إليها عامكم ذلك ما لم تعلموا أنتم ، ( فجعل من دون ذلك )\nأي : قبل دخولكم الذي وعدتم به في رؤيا النبي - صلى الله عليه وسلم - ( فتحا قريبا ) : وهو الصلح الذي كان بينكم وبين أعدائكم من المشركين .\n                                    ",
      "qortoby": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡيَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَآءَ ٱللَّهُ ءَامِنِينَ مُحَلِّقِينَ رُءُوسَكُمۡ وَمُقَصِّرِينَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُواْ فَجَعَلَ مِن دُونِ ذَٰلِكَ فَتۡحٗا قَرِيبًا ٧٢\n                                    \n                                    \n                                    قوله تعالى : لقد صدق الله رسوله الرؤيا بالحق لتدخلن المسجد الحرام إن شاء الله آمنين محلقين رءوسكم ومقصرين لا تخافون فعلم ما لم تعلموا فجعل من دون ذلك فتحا قريبا .\nقال قتادة : كان رسول الله - صلى الله عليه وسلم - رأى في المنام أنه يدخل مكة على هذه الصفة ، فلما صالح قريشا بالحديبية ارتاب المنافقون حتى قال رسول الله - صلى الله عليه وسلم - إنه يدخل مكة ، فأنزل الله تعالى : لقد صدق الله رسوله الرؤيا بالحق فأعلمهم أنهم سيدخلون في غير ذلك العام ، وأن رؤياه - صلى الله عليه وسلم - حق . وقيل : إن أبا بكر هو الذي قال إن المنام لم يكن مؤقتا بوقت ، وأنه سيدخل . وروي أن الرؤيا كانت بالحديبية ، وأن رؤيا الأنبياء حق . والرؤيا أحد وجوه الوحي إلى الأنبياء . لتدخلن أي في العام القابل المسجد الحرام إن شاء الله قال ابن كيسان : إنه حكاية ما قيل للنبي - صلى الله عليه وسلم - في منامه ، خوطب في منامه بما جرت به العادة ، فأخبر الله عن رسوله أنه قال ذلك ولهذا استثنى ، تأدب بأدب الله تعالى حيث قال تعالى : ولا تقولن لشيء إني فاعل ذلك غدا إلا أن يشاء الله . وقيل : خاطب الله العباد بما يحب أن يقولوه ، كما قال : ولا تقولن لشيء إني فاعل ذلك غدا إلا أن يشاء الله وقيل : استثنى فيما يعلم ليستثني الخلق فيما لا يعلمون ، قاله ثعلب . وقيل : كان الله علم أنه يميت بعض هؤلاء الذين كانوا معه بالحديبية فوقع الاستثناء لهذا المعنى ، قاله الحسين بن الفضل . وقيل : الاستثناء من آمنين ، وذلك راجع إلى مخاطبة العباد على ما جرت به العادة . وقيل : معنى إن شاء الله إن أمركم الله بالدخول . وقيل : أي : إن سهل الله . وقيل : إن شاء الله أي : كما شاء الله . وقال أبو عبيدة : إن بمعنى \" إذ \" ، أي : إذ شاء الله ، كقوله تعالى : اتقوا الله وذروا ما بقي من الربا إن كنتم مؤمنين أي : إذ كنتم . وفيه بعد ; لأن ( إذ ) في الماضي من الفعل ، و ( إذا ) في المستقبل ، وهذا الدخول في المستقبل ، فوعدهم دخول المسجد الحرام وعلقه بشرط المشيئة ، وذلك عام الحديبية ، فأخبر أصحابه بذلك فاستبشروا ، ثم تأخر ذلك عن العام الذي طمعوا فيه فساءهم ذلك واشتد عليهم وصالحهم ورجع ، ثم أذن الله في العام المقبل فأنزل الله : لقد صدق الله رسوله الرؤيا بالحق وإنما قيل له في المنام : لتدخلن المسجد الحرام إن شاء الله فحكى في التنزيل ما قيل له في المنام ، فليس هنا شك كما زعم بعضهم أن الاستثناء يدل على الشك ، والله تعالى لا يشك ، ولتدخلن تحقيق فكيف يكون شك . فإن بمعنى ( إذا )\nآمنين أي من العدو . محلقين رءوسكم ومقصرين والتحليق والتقصير جميعا للرجال ، ولذلك غلب المذكر على المؤنث . والحلق أفضل ، وليس للنساء إلا التقصير . وقد مضى القول في هذا في ( البقرة ) وفي الصحيح أن معاوية أخذ من شعر النبي - صلى الله عليه وسلم - على المروة بمشقص . وهذا كان في العمرة لا في الحج ; لأن النبي - صلى الله عليه وسلم - حلق في حجته . ( لا تخافون ) حال من المحلقين والمقصرين ، والتقدير : غير خائفين . فعلم ما لم تعلموا أي علم ما في تأخير الدخول من الخير والصلاح ما لم تعلموه أنتم . وذلك أنه - عليه السلام - لما رجع مضى منها إلى خيبر فافتتحها ، ورجع بأموال خيبر وأخذ من العدة والقوة أضعاف ما كان فيه في ذلك العام ، وأقبل إلى مكة على أهبة وقوة وعدة بأضعاف ذلك . وقال الكلبي : أي : علم أن دخولها إلى سنة ولم تعلموه أنتم . وقيل : علم أن بمكة رجالا مؤمنين ونساء مؤمنات لم تعلموهم .\nفجعل من دون ذلك فتحا قريبا أي من دون رؤيا النبي - صلى الله عليه وسلم - فتح خيبر ، قاله ابن زيد والضحاك . وقيل : فتح مكة . وقال مجاهد : هو صلح الحديبية ، وقاله أكثر المفسرين . قال الزهري : ما فتح الله في الإسلام كان أعظم من صلح الحديبية ; لأنه إنما كان القتال حين تلتقي الناس ، فلما كانت الهدنة وضعت الحرب أوزارها وأمن الناس بعضهم بعضا ، فالتقوا وتفاوضوا الحديث والمناظرة . فلم يكلم أحد بالإسلام يعقل شيئا إلا دخل فيه ، فلقد دخل في تينك السنتين في الإسلام مثل ما كان في الإسلام قبل ذلك وأكثر . يدلك على ذلك أنهم كانوا سنة ست يوم الحديبية ألفا وأربعمائة ، وكانوا بعد عام الحديبية سنة ثمان في عشرة آلاف .\n                                    ",
      "saadi": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡيَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَآءَ ٱللَّهُ ءَامِنِينَ مُحَلِّقِينَ رُءُوسَكُمۡ وَمُقَصِّرِينَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُواْ فَجَعَلَ مِن دُونِ ذَٰلِكَ فَتۡحٗا قَرِيبًا ٧٢\n                                        \n                                        \n                                        \n                                        يقول تعالى: { لَقَدْ صَدَقَ اللَّهُ رَسُولَهُ الرُّؤْيَا بِالْحَقِّ } وذلك أن رسول الله صلى الله عليه وسلم رأى في المدينة رؤيا أخبر بها أصحابه، أنهم سيدخلون مكة ويطوفون بالبيت، فلما جرى يوم الحديبية ما جرى، ورجعوا من غير دخول لمكة، كثر في ذلك الكلام منهم، حتى إنهم قالوا ذلك لرسول الله صلى الله عليه وسلم: ألم تخبرنا أنا سنأتي البيت ونطوف به؟ فقال: \" أخبرتكم أنه العام؟\" قالوا: لا، قال: \"فإنكم ستأتونه وتطوفون به\" قال الله هنا: { لَقَدْ صَدَقَ اللَّهُ رَسُولَهُ الرُّؤْيَا بِالْحَقِّ } أي: لا بد من وقوعها وصدقها، ولا يقدح في ذلك تأخر تأويلها، { لَتَدْخُلُنَّ الْمَسْجِدَ الْحَرَامَ إِنْ شَاءَ اللَّهُ آمِنِينَ مُحَلِّقِينَ رُءُوسَكُمْ وَمُقَصِّرِينَ } أي: في هذه الحال المقتضية لتعظيم هذا البيت الحرام، وأدائكم للنسك، وتكميله بالحلق والتقصير، وعدم الخوف، { فَعَلِمَ } من المصلحة والمنافع { مَا لَمْ تَعْلَمُوا فَجَعَلَ مِنْ دُونِ ذَلِكَ } الدخول بتلك الصفة { فَتْحًا قَرِيبًا }\nولما كانت هذه الواقعة مما تشوشت بها قلوب بعض المؤمنين، وخفيت عليهم حكمتها، فبين تعالى حكمتها ومنفعتها، وهكذا سائر أحكامه الشرعية، فإنها كلها، هدى ورحمة.\n                                    "
    }
  },
  {
    "id": 27,
    "versesNumber": 28,
    "souraName": "Al-Fath.html",
    "contnent": "هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ٨٢",
    "tafsier": {
      "ibnkther": "هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ٨٢\n                                    \n                                    \n                                    ثم قال تعالى ، مبشرا للمؤمنين بنصرة الرسول صلوات الله [ وسلامه ] عليه على عدوه وعلى سائر أهل الأرض : ( هو الذي أرسل رسوله بالهدى ودين الحق ) أي : بالعلم النافع والعمل الصالح ; فإن الشريعة تشتمل على شيئين : علم وعمل ، فالعلم الشرعي صحيح ، والعمل الشرعي مقبول ، فإخباراتها حق وإنشاءاتها عدل ، ( ليظهره على الدين كله ) أي : على أهل جميع الأديان من سائر أهل الأرض ، من عرب وعجم ومليين ومشركين ، ( وكفى بالله شهيدا ) أي : أنه رسوله ، وهو ناصره .\n                                    ",
      "qortoby": "هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ٨٢\n                                    \n                                    \n                                    قوله تعالى : هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله وكفى بالله شهيدا .\nقوله تعالى : هو الذي أرسل رسوله يعني محمدا - صلى الله عليه وسلم - بالهدى ودين الحق ليظهره على الدين كله أي يعليه على كل الأديان . فالدين اسم بمعنى المصدر ، ويستوي لفظ الواحد والجمع فيه . وقيل : أي : ليظهر رسوله على الدين كله ، أي : على الدين الذي هو شرعه بالحجة ثم باليد والسيف ، ونسخ ما عداه .\nوكفى بالله شهيدا شهيدا نصب على التفسير ، والباء زائدة ، أي : كفى الله شهيدا لنبيه - صلى الله عليه وسلم - ، وشهادته له تبين صحة نبوته بالمعجزات . وقيل : شهيدا على ما أرسل به لأن الكفار أبوا أن يكتبوا : هذا ما صالح عليه محمد رسول الله .\n                                    ",
      "saadi": "هُوَ ٱلَّذِيٓ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِينِ ٱلۡحَقِّ لِيُظۡهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ٨٢\n                                        \n                                        \n                                        \n                                        أخبر بحكم عام، فقال: { هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى } الذي هو العلم النافع، الذي يهدي من الضلالة، ويبين طرق الخير والشر.\n{ وَدِينِ الْحَقِّ } أي: الدين الموصوف بالحق، وهو العدل والإحسان والرحمة.\nوهو كل عمل صالح مزك للقلوب، مطهر للنفوس، مرب للأخلاق، معل للأقدار.\n{ لِيُظْهِرَهُ } بما بعثه الله به { عَلَى الدِّينِ كُلِّهِ } بالحجة والبرهان، ويكون داعيا لإخضاعهم بالسيف والسنان.\n                                    "
    }
  },
  {
    "id": 28,
    "versesNumber": 29,
    "souraName": "Al-Fath.html",
    "contnent": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡ‍َٔهُۥ فَ‍َٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا ٩٢",
    "tafsier": {
      "ibnkther": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡ‍َٔهُۥ فَ‍َٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا ٩٢\n                                    \n                                    \n                                    يخبر تعالى عن محمد صلوات الله عليه ، أنه رسوله حقا بلا شك ولا ريب ، فقال : ( محمد رسول الله ) ، وهذا مبتدأ وخبر ، وهو مشتمل على كل وصف جميل ، ثم ثنى بالثناء على أصحابه فقال : ( والذين معه أشداء على الكفار رحماء بينهم ) ، كما قال تعالى : ( فسوف يأتي الله بقوم يحبهم ويحبونه أذلة على المؤمنين أعزة على الكافرين ) [ المائدة : 54 ] وهذه صفة المؤمنين أن يكون أحدهم شديدا عنيفا على الكفار ، رحيما برا بالأخيار ، غضوبا عبوسا في وجه الكافر ، ضحوكا بشوشا في وجه أخيه المؤمن ، كما قال تعالى : ( يا أيها الذين آمنوا قاتلوا الذين يلونكم من الكفار وليجدوا فيكم غلظة ) [ التوبة : 123 ] ، وقال النبي - صلى الله عليه وسلم - : \" مثل المؤمنين في توادهم وتراحمهم كمثل الجسد الواحد ، إذا اشتكى منه عضو تداعى له سائر الجسد بالحمى والسهر \" ، وقال : \" المؤمن للمؤمن كالبنيان يشد بعضه بعضا \" وشبك بين أصابعه كلا الحديثين في الصحيح .\nوقوله : ( تراهم ركعا سجدا يبتغون فضلا من الله ورضوانا ) : وصفهم بكثرة العمل وكثرة الصلاة ، وهي خير الأعمال ، ووصفهم بالإخلاص فيها لله - عز وجل - والاحتساب عند الله جزيل الثواب ، وهو الجنة المشتملة على فضل الله ، وهو سعة الرزق عليهم ، ورضاه تعالى ، عنهم وهو أكبر من الأول ، كما قال : ( ورضوان من الله أكبر ) [ التوبة : 72 ] .\nوقوله : ( سيماهم في وجوههم من أثر السجود ) : قال علي بن أبي طلحة ، عن ابن عباس : ( سيماهم في وجوههم ) يعني : السمت الحسن .\nوقال مجاهد وغير واحد : يعني الخشوع والتواضع .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا علي بن محمد الطنافسي ، حدثنا حسين الجعفي ، عن زائدة ، عن منصور عن مجاهد : ( سيماهم في وجوههم من أثر السجود ) قال : الخشوع ، قلت : ما كنت أراه إلا هذا الأثر في الوجه ، فقال : ربما كان بين عيني من هو أقسى قلبا من فرعون .\nوقال السدي : الصلاة تحسن وجوههم .\nوقال بعض السلف : من كثرت صلاته بالليل حسن وجهه بالنهار .\nوقد أسنده ابن ماجه في سننه ، عن إسماعيل بن محمد الطلحي ، عن ثابت بن موسى ، عن شريك ، عن الأعمش ، عن أبي سفيان ، عن جابر قال : قال رسول الله - صلى الله عليه وسلم - : \" من كثرت صلاته بالليل حسن وجهه بالنهار \" والصحيح أنه موقوف .\nوقال بعضهم : إن للحسنة نورا في القلب ، وضياء في الوجه ، وسعة في الرزق ، ومحبة في قلوب الناس .\nوقال أمير المؤمنين عثمان : ما أسر أحد سريرة إلا أبداها الله على صفحات وجهه ، وفلتات لسانه .\nوالغرض أن الشيء الكامن في النفس يظهر على صفحات الوجه ، فالمؤمن إذا كانت سريرته صحيحة مع الله أصلح الله ظاهره للناس ، كما روي عن عمر بن الخطاب - رضي الله عنه - أنه قال : من أصلح سريرته أصلح الله علانيته .\nوقال أبو القاسم الطبراني : حدثنا محمود بن محمد المروزي ، حدثنا حامد بن آدم المروزي ، حدثنا الفضل بن موسى ، عن محمد بن عبيد الله العرزمي ، عن سلمة بن كهيل ، عن جندب بن سفيان البجلي قال : قال النبي - صلى الله عليه وسلم - : \" ما أسر أحد سريرة إلا ألبسه الله رداءها ، إن خيرا فخير ، وإن شرا فشر \" ، العرزمي متروك .\nوقال الإمام أحمد : حدثنا حسن بن موسى ، حدثنا ابن لهيعة ، حدثنا دراج ، عن أبي الهيثم ، عن أبي سعيد ، عن رسول الله - صلى الله عليه وسلم - أنه قال : \" لو أن أحدكم يعمل في صخرة صماء ليس لها باب ولا كوة ، لخرج عمله للناس كائنا ما كان \" .\nوقال الإمام أحمد [ أيضا ] : حدثنا حسن ، حدثنا زهير ، حدثنا قابوس بن أبي ظبيان : أن أباه حدثه عن ابن عباس ، عن النبي - صلى الله عليه وسلم - قال : \" إن الهدي الصالح ، والسمت الصالح ، والاقتصاد جزء من خمسة وعشرين جزءا من النبوة \" ورواه أبو داود عن عبد الله بن محمد النفيلي ، عن زهير ، به .\nفالصحابة [ رضي الله عنهم ] خلصت نياتهم وحسنت أعمالهم ، فكل من نظر إليهم أعجبوه في سمتهم وهديهم .\nوقال مالك ، رحمه الله : بلغني أن النصارى كانوا إذا رأوا الصحابة الذين فتحوا الشام يقولون : \" والله لهؤلاء خير من الحواريين فيما بلغنا \" . وصدقوا في ذلك ، فإن هذه الأمة معظمة في الكتب المتقدمة ، وأعظمها وأفضلها أصحاب رسول الله - صلى الله عليه وسلم - وقد نوه الله بذكرهم في الكتب المنزلة والأخبار المتداولة ; ولهذا قال هاهنا : ( ذلك مثلهم في التوراة ) ، ثم قال : ( ومثلهم في الإنجيل كزرع أخرج شطأه [ فآزره فاستغلظ فاستوى على سوقه ) : ( أخرج شطأه ] ) أي : فراخه ، ( فآزره ) أي : شده ( فاستغلظ ) أي : شب وطال ، ( فاستوى على سوقه يعجب الزراع ) أي : فكذلك أصحاب محمد - صلى الله عليه وسلم - آزروه وأيدوه ونصروه فهم معه كالشطء مع الزرع ، ( ليغيظ بهم الكفار ) .\nومن هذه الآية انتزع الإمام مالك - رحمه الله ، في رواية عنه - بتكفير الروافض الذين يبغضون الصحابة ، قال : لأنهم يغيظونهم ، ومن غاظ الصحابة فهو كافر لهذه الآية . ووافقه طائفة من العلماء على ذلك . والأحاديث في فضائل الصحابة والنهي عن التعرض لهم بمساءة كثيرة ، ويكفيهم ثناء الله عليهم ، ورضاه عنهم .\nثم قال : ( وعد الله الذين آمنوا وعملوا الصالحات منهم ) من \" هذه لبيان الجنس ، ( مغفرة ) أي : لذنوبهم . ( وأجرا عظيما ) أي : ثوابا جزيلا ورزقا كريما ، ووعد الله حق وصدق ، لا يخلف ولا يبدل ، وكل من اقتفى أثر الصحابة فهو في حكمهم ، ولهم الفضل والسبق والكمال الذي لا يلحقهم فيه أحد من هذه الأمة رضي الله عنهم وأرضاهم ، وجعل جنات الفردوس مأواهم ، وقد فعل .\nقال مسلم في صحيحه : حدثنا يحيى بن يحيى ، حدثنا أبو معاوية ، عن الأعمش ، عن أبي صالح ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" لا تسبوا أصحابي ، فوالذي نفسي بيده لو أن أحدكم أنفق مثل أحد ذهبا ما أدرك مد أحدهم ولا نصيفه \" .\nآخر تفسير سورة الفتح ، ولله الحمد والمنة .\n                                    ",
      "qortoby": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡ‍َٔهُۥ فَ‍َٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا ٩٢\n                                    \n                                    \n                                    قوله تعالى : محمد رسول الله والذين معه أشداء على الكفار رحماء بينهم تراهم ركعا سجدا يبتغون فضلا من الله ورضوانا سيماهم في وجوههم من أثر السجود ذلك مثلهم في التوراة ومثلهم في الإنجيل كزرع أخرج شطأه فآزره فاستغلظ فاستوى على سوقه يعجب الزراع ليغيظ بهم الكفار وعد الله الذين آمنوا وعملوا الصالحات منهم مغفرة وأجرا عظيما .\nفيه خمس مسائل : الأولى : قوله تعالى : محمد رسول الله محمد مبتدأ و ( رسول ) خبره . وقيل : محمد ابتداء و ( رسول ) الله نعته .\nوالذين معه عطف على المبتدأ ، والخبر فيما بعده ، فلا يوقف على هذا التقدير على رسول الله وعلى الأول يوقف على رسول الله ; لأن صفاته - عليه السلام - تزيد على ما وصف أصحابه ، فيكون محمد ابتداء ورسول الله الخبر والذين معه ابتداء ثان . وأشداء خبره ورحماء خبر ثان . وكون الصفات في جملة أصحاب النبي - صلى الله عليه وسلم - هو الأشبه . وقيل : المراد بالذين معه جميع المؤمنين .\nرحماء بينهم أي يرحم بعضهم بعضا . وقيل : متعاطفون متوادون . وقرأ الحسن أشداء على الكفار رحماء بينهم بالنصب على الحال ، كأنه قال : والذين معه في حال شدتهم على الكفار وتراحمهم بينهم . تراهم ركعا سجدا إخبار عن كثرة صلاتهم . يبتغون فضلا من الله ورضوانا أي يطلبون الجنة ورضا الله تعالى .\nالثانية : قوله تعالى : سيماهم في وجوههم من أثر السجود السيما العلامة ، وفيها لغتان : المد والقصر ، أي : لاحت علامات التهجد بالليل وأمارات السهر . وفي سنن ابن ماجه قال : حدثنا إسماعيل بن محمد الطلحي قال حدثنا ثابت بن موسى أبو يزيد عن شريك عن الأعمش عن أبي سفيان عن جابر قال : قال رسول الله - صلى الله عليه وسلم - : من كثرت صلاته بالليل حسن وجهه بالنهار . وقال ابن العربي : ودسه قوم في حديث النبي - صلى الله عليه وسلم - على وجه الغلط ، وليس عن النبي - صلى الله عليه وسلم - فيه ذكر بحرف . وقد روى ابن وهب عن مالك سيماهم في وجوههم من أثر السجود ذلك مما يتعلق بجباههم من الأرض عند السجود ، وبه قال سعيد بن جبير . وفي الحديث الصحيح عن النبي - صلى الله عليه وسلم - : صلى صبيحة إحدى وعشرين من رمضان وقد وكف المسجد وكان على عريش ، فانصرف النبي - صلى الله عليه وسلم - من صلاته وعلى جبهته وأرنبته أثر الماء والطين . وقال الحسن : هو بياض يكون في الوجه يوم القيامة . وقاله سعيد بن جبير أيضا ، ورواه العوفي عن ابن عباس ، قاله الزهري . وفي الصحيح عن رسول الله - صلى الله عليه وسلم - من حديث أبي هريرة ، وفيه : [ حتى إذا فرغ الله من القضاء بين العباد وأراد أن يخرج برحمته من أراد من أهل النار أمر الملائكة أن يخرجوا من النار من كان لا يشرك بالله شيئا ممن أراد الله أن يرحمه ممن يقول لا إله إلا الله فيعرفونهم في النار بأثر السجود تأكل النار ابن آدم إلا أثر السجود حرم الله على النار أن تأكل أثر السجود ] . وقال شهر بن حوشب : يكون موضع السجود من وجوههم كالقمر ليلة البدر . وقال ابن عباس ومجاهد : السيما في الدنيا وهو السمت الحسن . وعن مجاهد أيضا : هو الخشوع والتواضع . قال منصور : سألت مجاهدا عن قوله تعالى : سيماهم في وجوههم أهو أثر يكون بين عيني الرجل ؟ قال لا ، ربما يكون بين عيني الرجل مثل ركبة العنز وهو أقسى قلبا من الحجارة ولكنه نور في وجوههم من الخشوع . وقال ابن جريج : هو الوقار والبهاء . وقال شمر بن عطية : هو صفرة الوجه من قيام الليل . قال الحسن : إذا رأيتهم حسبتهم مرضى وما هم بمرضى . وقال الضحاك : أما إنه ليس بالندب في وجوههم ولكنه الصفرة . وقال سفيان الثوري : يصلون بالليل فإذا أصبحوا رئي ذلك في وجوههم ، بيانه قوله - صلى الله عليه وسلم - : من كثرت صلاته بالليل حسن وجهه بالنهار . وقد مضى القول فيه آنفا . وقال عطاء الخراساني : دخل في هذه الآية كل من حافظ على الصلوات الخمس .\nالثالثة : قوله تعالى : ذلك مثلهم في التوراة ومثلهم في الإنجيل قال الفراء : فيه وجهان ، إن شئت قلت المعنى ذلك مثلهم في التوراة وفي الإنجيل أيضا ، كمثلهم في القرآن ، فيكون الوقف على الإنجيل وإن شئت قلت : تمام الكلام ذلك مثلهم في التوراة ، ثم ابتدأ فقال : ومثلهم في الإنجيل . وكذا قال ابن عباس وغيره : هما مثلان ، أحدهما في التوراة والآخر في الإنجيل ، فيوقف على هذا على التوراة وقال مجاهد : هو مثل واحد ، يعني أن هذه صفتهم في التوراة والإنجيل ، فلا يوقف على التوراة على هذا ، ويوقف على الإنجيل ويبتدئ كزرع أخرج شطأه على معنى وهم كزرع . وشطأه يعني فراخه وأولاده ، قاله ابن زيد وغيره . وقال مقاتل : هو نبت واحد ، فإذا خرج ما بعده فقد شطأه . قال الجوهري : شطء الزرع والنبات فراخه ، والجمع أشطاء . وقد أشطأ الزرع خرج شطؤه . قال الأخفش في قوله : أخرج شطأه أي : طرفه . وحكاه الثعلبي عن الكسائي . وقال الفراء : أشطأ الزرع فهو مشطئ إذا خرج . قال الشاعر :\nأخرج الشطء على وجه الثرى ومن الأشجار أفنان الثمر\nالزجاج : أخرج شطأه أي : نباته . وقيل : إن الشطء شوك السنبل ، والعرب أيضا تسميه : السفا ، وهو شوك البهمى ، قاله قطرب . وقيل : إنه السنبل ، فيخرج من الحبة عشر سنبلات وتسع وثمان ، قال الفراء ، حكاه الماوردي . وقرأ ابن كثير وابن ذكوان ( شطأه ) بفتح الطاء ، وأسكن الباقون . وقرأ أنس ونصر بن عاصم وابن وثاب ( شطاه ) مثل عصاه . وقرأ الجحدري وابن أبي إسحاق ( شطه ) بغير همز ، وكلها لغات فيها .\nوهذا مثل ضربه الله تعالى لأصحاب النبي - صلى الله عليه وسلم - ، يعني أنهم يكونون قليلا ثم يزدادون ويكثرون ، فكان النبي - صلى الله عليه وسلم - حين بدأ بالدعاء إلى دينه ضعيفا فأجابه الواحد بعد الواحد حتى قوي أمره ، كالزرع يبدو بعد البذر ضعيفا فيقوى حالا بعد حال حتى يغلظ نباته وأفراخه . فكان هذا من أصح مثل وأقوى بيان . وقال قتادة : مثل أصحاب محمد - صلى الله عليه وسلم - في الإنجيل مكتوب أنه سيخرج من قوم ينبتون نبات الزرع ، يأمرون بالمعروف وينهون عن المنكر .\nفآزره أي قواه وأعانه وشده ، أي : قوى الشطء الزرع . وقيل : بالعكس ، أي : قوى الزرع الشطء . وقراءة العامة آزره بالمد . وقرأ ابن ذكوان وأبو حيوة وحميد بن قيس ( فأزره ) مقصورة ، مثل فعله . والمعروف المد . قال امرؤ القيس :\nبمحنية قد آزر الضال نبتها مجر جيوش غانمين وخيب\nفاستوى على سوقه على عوده الذي يقوم عليه فيكون ساقا له . والسوق : جمع الساق . يعجب الزراع أي يعجب هذا الزرع زراعه . وهو مثل كما بينا ، فالزرع محمد - صلى الله عليه وسلم - ، والشطء أصحابه ، كانوا قليلا فكثروا ، وضعفاء فقووا ، قاله الضحاك وغيره . ليغيظ بهم الكفار اللام متعلقة بمحذوف ، أي : فعل الله هذا لمحمد - صلى الله عليه وسلم - وأصحابه ليغيظ بهم الكفار .\nالرابعة : قوله تعالى : وعد الله الذين آمنوا أي وعد الله هؤلاء الذين مع محمد ، وهم المؤمنون الذين أعمالهم صالحة . و ( من ) في قوله : منهم مبعضة لقوم من الصحابة دون قوم ، ولكنها عامة مجنسة ، مثل قوله تعالى : فاجتنبوا الرجس من الأوثان لا يقصد للتبعيض لكنه يذهب إلى الجنس ، أي : فاجتنبوا الرجس من جنس الأوثان ، إذ كان الرجس يقع من أجناس شتى ، منها الزنى والربا وشرب الخمر والكذب ، فأدخل ( من ) يفيد بها الجنس وكذا منهم ، أي : من هذا الجنس ، يعني جنس الصحابة . ويقال : أنفق نفقتك من الدراهم ، أي : اجعل نفقتك هذا الجنس . وقد يخصص أصحاب محمد - صلى الله عليه وسلم - بوعد المغفرة تفضيلا لهم ، وإن وعد الله جميع المؤمنين المغفرة . وفي الآية جواب آخر : وهو أن ( من ) مؤكدة للكلام ، والمعنى وعدهم الله كلهم مغفرة وأجرا عظيما . فجرى مجرى قول العربي : قطعت من الثوب قميصا ، يريد قطعت الثوب كله قميصا . و ( من ) لم يبعض شيئا . وشاهد هذا من القرآن وننزل من القرآن ما هو شفاء معناه وننزل القرآن شفاء ; لأن كل حرف منه يشفي ، وليس الشفاء مختصا به بعضه دون بعض . على أن من اللغويين من يقول : ( من ) مجنسة ، تقديرها ننزل الشفاء من جنس القرآن ، ومن جهة القرآن ، ومن ناحية القرآن . قال زهير :\nأمن أم أوفى دمنة لم تكلم\nأراد من ناحية أم أوفى دمنة ، أم من منازلها دمنة . وقال الآخر [ الأعشى ] :\nأخو رغائب يعطيها ويسألها يأبى الظلامة منه النوفل الزفر\nف ( من ) لم تبعض شيئا ، إذ كان المقصد يأبى الظلامة لأنه نوفل زفر . والنوفل : الكثير العطاء . والزفر : حامل الأثقال والمؤن عن الناس .\nالخامسة : روى أبو عروة الزبيري من ولد الزبير : كنا عند مالك بن أنس ، فذكروا رجلا ينتقص أصحاب رسول الله - صلى الله عليه وسلم - ، فقرأ مالك هذه الآية محمد رسول الله والذين معه حتى بلغ يعجب الزراع ليغيظ بهم الكفار فقال مالك : من أصبح من الناس في قلبه غيظ على أحد من أصحاب رسول الله - صلى الله عليه وسلم - فقد أصابته هذه الآية ، ذكره الخطيب أبو بكر .\nقلت : لقد أحسن مالك في مقالته وأصاب في تأويله . فمن نقص واحدا منهم أو طعن عليه في روايته فقد رد على الله رب العالمين ، وأبطل شرائع المسلمين ، قال الله تعالى : محمد رسول الله والذين معه أشداء على الكفار الآية . وقال : لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة إلى غير ذلك من الآي التي تضمنت الثناء عليهم ، والشهادة لهم بالصدق والفلاح ، قال الله تعالى : رجال صدقوا ما عاهدوا الله عليه وقال : للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم يبتغون فضلا من الله ورضوانا إلى قوله أولئك هم الصادقون ، ثم قال عز من قائل : والذين تبوءوا الدار والإيمان من قبلهم إلى قوله فأولئك هم المفلحون . وهذا كله مع علمه تبارك وتعالى بحالهم ومآل أمرهم ، وقال رسول الله - صلى الله عليه وسلم - : خير الناس قرني ثم الذين يلونهم وقال : لا تسبوا أصحابي فلو أن أحدكم أنفق مثل أحد ذهبا لم يدرك مد أحدهم ولا نصيفه خرجهما البخاري . وفي حديث آخر : فلو أن أحدكم أنفق ما في الأرض لم يدرك مد أحدهم ولا نصيفه .\nقال أبو عبيد : معناه لم يدرك مد أحدهم إذا تصدق به ولا نصف المد ، فالنصيف هو النصف هنا . وكذلك يقال للعشر عشير ، وللخمس خميس ، وللتسع تسيع ، وللثمن ثمين ، وللسبع سبيع ، وللسدس سديس ، وللربع ربيع . ولم تقل العرب للثلث ثليث . وفي البزار عن جابر مرفوعا صحيحا : [ إن الله اختار أصحابي على العالمين سوى النبيين والمرسلين واختار لي من أصحابي أربعة - يعني أبا بكر وعمر وعثمان وعليا - فجعلهم أصحابي ] . وقال : [ في أصحابي كلهم خير ] . وروى عويم بن ساعدة قال : قال رسول الله - صلى الله عليه وسلم - : [ إن الله - عز وجل - اختارني واختار لي أصحابي فجعل لي منهم وزراء وأختانا وأصهارا فمن سبهم فعليه لعنة الله والملائكة والناس أجمعين ولا يقبل الله منه يوم القيامة صرفا ولا عدلا ] . والأحاديث بهذا المعنى كثيرة ، فحذار من الوقوع في أحد منهم ، كما فعل من طعن في الدين فقال : إن المعوذتين ليستا من القرآن ، وما صح حديث عن رسول الله - صلى الله عليه وسلم - في تثبيتهما ودخولهما في جملة التنزيل إلا عن عقبة بن عامر ، وعقبة بن عامر ضعيف لم يوافقه غيره عليها ، فروايته مطرحة . وهذا رد لما ذكرناه من الكتاب والسنة ، وإبطال لما نقلته لنا الصحابة من الملة . فإن عقبة بن عامر بن عيسى الجهني ممن روى لنا الشريعة في الصحيحين البخاري ومسلم وغيرهما ، فهو ممن مدحهم الله ووصفهم وأثنى عليهم ووعدهم مغفرة وأجرا عظيما . فمن نسبه أو واحدا من الصحابة إلى كذب فهو خارج عن الشريعة ، مبطل للقرآن طاعن على رسول الله - صلى الله عليه وسلم - . ومتى ألحق واحد منهم تكذيبا فقد سب ; لأنه لا عار ولا عيب بعد الكفر بالله أعظم من الكذب ، وقد لعن رسول الله - صلى الله عليه وسلم - من سب أصحابه ، فالمكذب لأصغرهم - ولا صغير فيهم - داخل في لعنة الله التي شهد بها رسول الله - صلى الله عليه وسلم - ، وألزمها كل من سب واحدا من أصحابه أو طعن عليه . وعن عمر بن حبيب قال : حضرت مجلس هارون الرشيد فجرت مسألة تنازعها الحضور وعلت أصواتهم ، فاحتج بعضهم بحديث يرويه أبو هريرة عن رسول الله - صلى الله عليه وسلم - ، فرفع بعضهم الحديث وزادت المدافعة والخصام حتى قال قائلون منهم : لا يقبل هذا الحديث على رسول الله - صلى الله عليه وسلم - ; لأن أبا هريرة متهم فيما يرويه ، وصرحوا بتكذيبه ، ورأيت الرشيد قد نحا نحوهم ونصر قولهم فقلت أنا : الحديث صحيح عن رسول الله - صلى الله عليه وسلم - ، وأبو هريرة صحيح النقل صدوق فيما يرويه عن النبي - صلى الله عليه وسلم - وغيره ، فنظر إلي الرشيد نظر مغضب ، وقمت من المجلس فانصرفت إلى منزلي ، فلم ألبث حتى قيل : صاحب البريد بالباب ، فدخل فقال لي : أجب أمير المؤمنين إجابة مقتول ، وتحنط وتكفن فقلت : اللهم إنك تعلم أني دافعت عن صاحب نبيك ، وأجللت نبيك أن يطعن على أصحابه ، فسلمني منه . فأدخلت على الرشيد وهو جالس على كرسي من ذهب ، حاسر عن ذراعيه ، بيده السيف وبين يديه النطع ، فلما بصر بي قال لي : يا عمر بن حبيب ما تلقاني أحد من الرد والدفع لقولي بمثل ما تلقيتني به ، فقلت : يا أمير المؤمنين ، إن الذي قلته وجادلت عنه فيه ازدراء على رسول الله - صلى الله عليه وسلم - وعلى ما جاء به ، إذا كان أصحابه كذابين فالشريعة باطلة ، والفرائض والأحكام في الصيام والصلاة والطلاق والنكاح والحدود كله مردود غير مقبول فرجع إلى نفسه ثم قال : أحييتني يا عمر بن حبيب أحياك الله ، وأمر لي بعشرة آلاف درهم .\nقلت : فالصحابة كلهم عدول ، أولياء الله تعالى وأصفياؤه ، وخيرته من خلقه بعد أنبيائه ورسله . هذا مذهب أهل السنة ، والذي عليه الجماعة من أئمة هذه الأمة . وقد ذهبت شرذمة لا مبالاة بهم إلى أن حال الصحابة كحال غيرهم ، فيلزم البحث عن عدالتهم . ومنهم من فرق بين حالهم في بداءة الأمر فقال : إنهم كانوا على العدالة إذ ذاك ، ثم تغيرت بهم الأحوال فظهرت فيهم الحروب وسفك الدماء ، فلا بد من البحث . وهذا مردود ، فإن خيار الصحابة وفضلاءهم كعلي وطلحة والزبير وغيرهم - رضي الله عنهم - ممن أثنى الله عليهم وزكاهم ورضي عنهم وأرضاهم ووعدهم الجنة بقوله تعالى : مغفرة وأجرا عظيما وخاصة العشرة المقطوع لهم بالجنة بإخبار الرسول هم القدوة مع علمهم بكثير من الفتن والأمور الجارية عليهم بعد نبيهم بإخباره لهم بذلك . وذلك غير مسقط من مرتبتهم وفضلهم ، إذ كانت تلك الأمور مبنية على الاجتهاد ، وكل مجتهد مصيب . وسيأتي الكلام في تلك الأمور في سورة ( الحجرات ) مبينة إن شاء الله تعالى :\nتم تفسير سورة ( الفتح ) والحمد لله .\n                                    ",
      "saadi": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡ‍َٔهُۥ فَ‍َٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا ٩٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن رسوله صلى الله عليه وسلم وأصحابه من المهاجرين والأنصار، أنهم بأكمل الصفات، وأجل الأحوال، وأنهم { أَشِدَّاءُ عَلَى الْكُفَّارِ } أي: جادون ومجتهدون في عداوتهم، وساعون في ذلك بغاية جهدهم، فلم يروا منهم إلا الغلظة والشدة، فلذلك ذل أعداؤهم لهم، وانكسروا، وقهرهم المسلمون، { رُحَمَاءُ بَيْنَهُمْ } أي: متحابون متراحمون متعاطفون، كالجسد الواحد، يحب أحدهم لأخيه ما يحب لنفسه، هذه معاملتهم مع الخلق، وأما معاملتهم مع الخالق فإنك { تَرَاهُمْ رُكَّعًا سُجَّدًا } أي: وصفهم كثرة الصلاة، التي أجل أركانها الركوع والسجود.\n{ يَبْتَغُونَ } بتلك العبادة { فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا } أي: هذا مقصودهم بلوغ رضا ربهم، والوصول إلى ثوابه.\n{ سِيمَاهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ } أي: قد أثرت العبادة -من كثرتها وحسنها- في وجوههم، حتى استنارت، لما استنارت بالصلاة بواطنهم، استنارت [بالجلال] ظواهرهم.\n{ ذَلِكَ } المذكور { مَثَلُهُمْ فِي التَّوْرَاةِ } أي: هذا وصفهم الذي وصفهم الله به، مذكور بالتوراة هكذا.\nوأما مثلهم في الإنجيل، فإنهم موصوفون بوصف آخر، وأنهم في كمالهم وتعاونهم { كَزَرْعٍ أَخْرَجَ شَطْأَهُ فَآزَرَهُ } أي: أخرج فراخه، فوازرته فراخه في الشباب والاستواء.\n{ فَاسْتَغْلَظَ } ذلك الزرع أي: قوي وغلظ { فَاسْتَوَى عَلَى سُوقِهِ } جمع ساق، { يُعْجِبُ الزُّرَّاعَ } من كماله واستوائه، وحسنه واعتداله، كذلك الصحابة رضي الله عنهم، هم كالزرع في نفعهم للخلق واحتياج الناس إليهم، فقوة إيمانهم وأعمالهم بمنزلة قوة عروق الزرع وسوقه، وكون الصغير والمتأخر إسلامه، قد لحق الكبير السابق ووازره وعاونه على ما هو عليه، من إقامة دين الله والدعوة إليه، كالزرع الذي أخرج شطأه، فآزره فاستغلظ، ولهذا قال: { لِيَغِيظَ بِهِمُ الْكُفَّارَ } حين يرون اجتماعهم وشدتهم على دينهم، وحين يتصادمون هم وهم في معارك النزال، ومعامع القتال.\n{ وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنْهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا } فالصحابة رضي الله عنهم، الذين جمعوا بين الإيمان والعمل الصالح، قد جمع الله لهم بين المغفرة، التي من لوازمها وقاية شرور الدنيا والآخرة، والأجر العظيم في الدنيا والآخرة.\nولنسق قصة الحديبية بطولها، كما ساقها الإمام شمس الدين ابن القيم في { الهدي النبوي } فإن فيها إعانة على فهم هذه السورة، وتكلم على معانيها وأسرارها، قال -رحمه الله تعالى:-\nفصل في قصة الحديبية\nقال نافع: كانت سنة ست في ذي القعدة، وهذا هو الصحيح، وهو قول الزهري، وقتادة، وموسى بن عقبة، ومحمد بن إسحاق وغيرهم.\nوقال هشام بن عروة، عن أبيه: خرج رسول الله صلى الله عليه وسلم إلى الحديبية في رمضان، وكانت في شوال، وهذا وهم، وإنما كانت غزاة الفتح في رمضان. قال أبو الأسود عن عروة: إنها كانت في ذي القعدة على الصواب.\nوفي الصحيحين عن أنس، أن النبي صلى الله عليه وسلم اعتمر أربع عمر، كلهن في ذي القعدة، فذكر منهن عمرة الحديبية، وكان معه ألف وخمسمائة، هكذا في الصحيحين عن جابر، وعنه فيهما: كانوا ألفا وأربعمائة، وفيهما، عن عبد الله بن أبي أوفى: كنا ألفا وثلاثمائة، قال قتادة: قلت لسعيد بن المسيب: كم كان الجماعة الذين شهدوا بيعة الرضوان؟ قال: خمس عشرة مائة، قال: قلت: فإن جابر بن عبد الله قال: كانوا أربع عشرة مائة، قال: يرحمه الله وهم، وهو حدثني أنهم كانوا خمس عشرة مائة، قلت: وقد صح عن جابر القولان، وصح عنه أنهم نحروا عام الحديبية سبعين بدنة، البدنة عن سبعة، فقيل له: كم كنتم؟ قال: ألفا وأربعمائة، بخيلنا ورجلنا، يعني: فارسهم وراجلهم.\nوالقلب إلى هذا أميل، وهو قول البراء بن عازب، ومعقل بن يسار، وسلمة بن الأكوع، في أصح الروايتين، وقول المسيب بن حزن، قال شعبة، عن قتادة، عن سعيد بن المسيب، عن أبيه: كنا مع رسول الله صلى الله عليه وسلم تحت الشجرة ألفا وأربعمائة، وغلط غلطا بينا من قال: كانوا سبعمائة، وعذره أنهم نحروا يومئذ سبعين بدنة، والبدنة قد جاء إجزاؤها عن سبعة أو عشرة، وهذا لا يدل على ما قاله هذا القائل، فإنه قد صرح بأن البدنة كانت في هذه الغزوة عن سبعة، فلو كانت السبعون عن جميعهم، لكانوا أربعمائة وتسعين رجلا، وقد قال بتمام الحديث بعينه، أنهم كانوا ألفا وأربعمائة.\nفصل\nفلما كانوا بذي الحليفة، قلد رسول الله صلى الله عليه وسلم الهدي وأشعره، وأحرم بالعمرة، وبعث عينا له بين يديه من خزاعة، يخبره عن قريش، حتى إذا كانوا قريبا من عسفان، أتاه عينه، فقال: إني قد تركت كعب بن لؤي، قد جمعوا لك الأحابيش، وجمعوا لك جموعا، وهم مقاتلوك وصادوك عن البيت.\nواستشار النبي صلى الله عليه وسلم أصحابه: أترون أن نميل إلى ذراري هؤلاء الذين أعانوهم فنصيبهم، فإن قعدوا قعدوا موتورين محزونين، وإن نجوا تكن عنقا قطعها الله، أم ترون أن نؤم البيت؟ فمن صدنا عنه قاتلناه؟ قال أبو بكر: الله ورسوله أعلم، إنما جئنا معتمرين، ولم نجئ لقتال أحد، ولكن من حال بيننا وبين البيت قاتلناه، فقال النبي صلى الله عليه وسلم: \"فروحوا إذا\" فراحوا، حتى إذا كانوا ببعض الطريق، قال النبي صلى الله عليه وسلم: \"إن خالد بن الوليد بالغميم في خيل لقريش، فخذوا ذات اليمين\" ، فوالله ما شعر بهم خالد، حتى إذا هو بغبرة الجيش، فانطلق يركض نذيرا لقريش.\nوسار النبي صلى الله عليه وسلم، حتى إذا كان بالثنية التي يهبط عليهم منها، بركت راحلته، فقال الناس: حل حل، فألحت، فقالوا: خلأت القصواء، فقال النبي صلى الله عليه وسلم: \"ما خلأت القصواء، وما ذاك لها بخلق، ولكن حبسها حابس الفيل\" ثم قال: \"والذي نفسي بيده، لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتموها\" ثم زجرها، فوثبت به، فعدل حتى نزل بأقصى الحديبية، على ثمد قليل الماء، إنما يتبرضه الناس تبرضا، فلم يلبث الناس أن نزحوه، فشكوا إلى رسول الله صلى الله عليه وسلم العطش.\nفانتزع سهما من كنانته، ثم أمرهم أن يجعلوها فيه، قال: فوالله ما زال يجيش لهم بالري حتى صدروا عنها، وفزعت قريش لنزوله عليهم، فأحب رسول الله صلى الله عليه وسلم أن يبعث إليهم رجلا من أصحابه، فدعا عمر بن الخطاب ليبعثه إليهم، فقال: يا رسول الله، ليس بمكة أحد من بني كعب يغضب لي، إن أوذيت، فأرسل عثمان بن عفان، فإن عشيرته بها، وإنه مبلغ ما أردت.\nفدعا رسول الله صلى الله عليه وسلم عثمان بن عفان، فأرسله إلى قريش، وقال: \"أخبرهم أنا لم نأت لقتال، إنما جئنا عمارا، وادعهم إلى الإسلام\"\nوأمره أن يأتي رجالا بمكة مؤمنين، ونساء مؤمنات، فيدخل عليهم ويبشرهم بالفتح، ويخبرهم أن الله عز وجل مظهر دينه بمكة، حتى لا يستخفى فيها بالإيمان، فانطلق عثمان، فمر على قريش ببلدح، فقالوا: أين تريد؟ فقال: بعثني رسول الله صلى الله عليه وسلم أدعوكم إلى الله وإلى الإسلام، ونخبركم أنا لم نأت لقتال، وإنما جئنا عمارا، قالوا: قد سمعنا ما تقول، فانفذ لحاجتك.\nوقام إليه أبان بن سعيد بن العاص، فرحب به، وأسرج فرسه، فحمل عثمان على الفرس، فأجاره، وأردفه أبان حتى جاء مكة، وقال المسلمون قبل أن يرجع عثمان: خلص عثمان قبلنا إلى البيت وطاف به، فقال رسول الله صلى الله عليه وسلم: \"ما أظنه طاف بالبيت ونحن محصورون\" فقالوا: وما يمنعه يا رسول الله وقد خلص؟ قال: \"ذاك ظني به، أن لا يطوف بالكعبة حتى نطوف معه\" واختلط المسلمون بالمشركين في أمر الصلح، فرمى رجل من أحد الفريقين رجلا من الفريق الآخر، وكانت معركة، وتراموا بالنبل والحجارة، وصاح الفريقان كلاهما، وارتهن كل واحد من الفريقين بمن فيهم، وبلغ رسول الله صلى الله عليه وسلم أن عثمان قد قتل، فدعا إلى البيعة.\nفثار المسلمون إلى رسول الله صلى الله عليه وسلم، وهو تحت الشجرة، فبايعوه على أن لا يفروا، فأخذ رسول الله صلى الله عليه وسلم بيد نفسه، وقال: \"هذه عن عثمان\" ولما تمت البيعة، رجع عثمان، فقال له المسلمون: اشتفيت يا أبا عبد الله من الطواف بالبيت، فقال: بئسما ظننتم بي، والذي نفسي بيده، لو مكثت بها سنة، ورسول الله صلى الله عليه وسلم، مقيم بالحديبية، ما طفت بها حتى يطوف بها رسول الله صلى الله عليه وسلم ولقد دعتني قريش إلى الطواف بالبيت فأبيت، فقال المسلمون: رسول الله صلى الله عليه وسلم، كان أعلمنا بالله، وأحسننا ظنا.\nوكان عمر أخذ بيد رسول الله صلى الله عليه وسلم للبيعة تحت الشجرة، فبايعه المسلمون كلهم إلا الجد ابن قيس، وكان معقل بن يسار، أخذ بغصنها يرفعه عن رسول الله صلى الله عليه وسلم، وكان أول من بايعه، أبو سنان الأسدي، وبايعه سلمة بن الأكوع ثلاث مرات، في أول الناس، وأوسطهم، وآخرهم.\nفبينما هم كذلك، إذ جاء بديل بن ورقاء الخزاعي، في نفر من خزاعة، وكانوا عيبة نصح لرسول الله صلى الله عليه وسلم، من أهل تهامة، فقال: إني تركت كعب بن لؤي، وعامر بن لؤي، نزلوا أعداد مياه الحديبية، معهم العوذ المطافيل، وهم مقاتلوك، وصادوك عن البيت.\nقال رسول الله صلى الله عليه وسلم: \"إنا لم نجئ لقتال أحد، ولكن جئنا معتمرين، وإن قريشا قد نهكتهم الحرب وأضرت بهم، فإن شاءوا أماددهم ويخلوا بيني وبين الناس، وإن شاءوا أن يدخلوا فيما دخل فيه الناس فعلوا، وإلا فقد جموا، وإن أبوا إلا القتال، فوالذي نفسي بيده، لأقاتلنهم على أمري هذا حتى تنفرد سالفتي، أو لينفذن الله أمره\" قال بديل: سأبلغهم ما تقول.\nفانطلق حتى أتى قريشا، فقال: إني قد جئتكم من عند هذا الرجل، وسمعته يقول قولا، فإن شئتم عرضته عليكم، فقال سفهاؤهم: لا حاجة لنا أن تحدثنا عنه بشيء، وقال ذوو الرأي: منهم: هات ما سمعته، قال: سمعته يقول كذا وكذا، فقال عروة بن مسعود الثقفي: إن هذا قد عرض عليكم خطة رشد، فاقبلوها، ودعوني آته، فقالوا: ائته، فأتاه، فجعل يكلمه، فقال له النبي صلى الله عليه وسلم نحوا من قوله لبديل، فقال له عروة عند ذلك: أي: محمد، أرأيت لو استأصلت قومك، هل سمعت بأحد من العرب اجتاح أهله قبلك؟ وإن تكن الأخرى، فوالله إني لأرى وجوها، وأرى أوباشا من الناس، خليقا أن يفروا ويدعوك، فقال له أبو بكر: امصص بظر اللات، أنحن نفر عنه وندعه؟ قال: من ذا؟ قال: أبو بكر، قال: أما والذي نفسي بيده، لولا يد كانت لك عندي لم أجزك بها، لأجبتك.\nوجعل يكلم النبي صلى الله عليه وسلم، وكلما كلمه أخذ بلحيته، والمغيرة بن شعبة على رأس النبي صلى الله عليه وسلم، ومعه السيف، وعليه المغفر فكلما أهوى عروة إلى لحية النبي صلى الله عليه وسلم، ضرب يده بنعل السيف، وقال: أخر يدك عن لحية رسول الله صلى الله عليه وسلم، فرفع عروة رأسه، وقال: من ذا؟ قال: المغيرة بن شعبة، فقال: أي: غدر، أولست أسعى في غدرتك؟ وكان المغيرة صحب قوما في الجاهلية، فقتلهم وأخذ أموالهم، ثم جاء فأسلم، فقال النبي صلى الله عليه وسلم: \"أما الإسلام فأقبل، وأما المال فلست منه في شيء\"\nثم إن عروة جعل يرمق أصحاب رسول الله صلى الله عليه وسلم، فوالله إن تنخم النبي صلى الله عليه وسلم نخامة، إلا وقعت في كف رجل منهم، فدلك بها جلده ووجهه.\nوإذا أمرهم ابتدروا إلى أمره، وإذا توضأ، كادوا يقتتلون على وضوئه، وإذا تكلم، خفضوا أصواتهم عنده، وما يحدون إليه النظر، تعظيما له.\nفرجع عروة إلى أصحابه، فقال: أي قوم، والله لقد وفدت على الملوك، على كسرى، وقيصر، والنجاشي، والله ما رأيت ملكا يعظمه أصحابه، ما يعظم أصحاب محمد محمدا، والله ما تنخم نخامة إلا وقعت في كف رجل منهم، فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره، وإذا توضأ كادوا يقتتلون على وضوئه، وإذا تكلم، خفضوا أصواتهم عنده، وما يحدون إليه النظر تعظيما له، وقد عرض عليكم خطة رشد فاقبلوها.\nفقال رجل من بني كنانة: دعوني آته، فقالوا: ائته.\nفلما أشرف على النبي صلى الله عليه وسلم، قال رسول الله صلى الله عليه وسلم: \"هذا فلان، وهو من قوم يعظمون البدن فابعثوها له\" فبعثوها فاستقبله القوم يلبون، فلما رأى ذلك، قال: سبحان الله، لا ينبغي لهؤلاء أن يصدوا عن البيت.\nفرجع إلى أصحابه، فقال: رأيت البدن قد قلدت وأشعرت، وما أرى أن يصدوا عن البيت فقام مكرز بن حفص، وقال: دعوني آته، فقالوا: ائته، فلما أشرف عليهم، قال النبي صلى الله عليه وسلم: \"هذا مكرز بن حفص، وهو رجل فاجر\" فجعل يكلم رسول الله صلى الله عليه وسلم، فبينا هو يكلمه، إذ جاء سهيل بن عمرو، فقال النبي صلى الله عليه وسلم: \"قد سهل لكم من أمركم\" فقال: هات، اكتب بيننا وبينك كتابا، فدعا الكاتب، فقال: \"اكتب: بسم الله الرحمن الرحيم\" فقال سهيل: أما الرحمن، فوالله ما ندري ما هو، ولكن اكتب: \"باسمك اللهم\" كما كنت تكتب، فقال المسلمون: والله لا نكتبها إلا بسم الله الرحمن الرحيم.\nفقال النبي صلى الله عليه وسلم: \"اكتب باسمك اللهم\"\nثم قال: \"اكتب: هذا ما قاضى عليه محمد رسول الله \" فقال سهيل: فوالله لو نعلم أنك رسول الله، ما صددناك عن البيت ولا قاتلناك، ولكن اكتب: محمد بن عبد الله، فقال النبي صلى الله عليه وسلم: \"إني رسول الله وإن كذبتموني، اكتب: محمد بن عبد الله \" فقال النبي صلى الله عليه وسلم: \"على أن تخلوا بيننا وبين البيت فنطوف به\" فقال سهيل: والله لا تتحدث العرب أنا أخذنا ضغطة، ولكن لك من العام المقبل، فكتب.\nفقال سهيل: على أن لا يأتيك منا رجل، وإن كان على دينك، إلا رددته علينا.\nفقال المسلمون: سبحان الله، كيف يرد إلى المشركين وقد جاء مسلما؟\nفبينما هم كذلك إذ جاء أبو جندل بن سهيل يرسف في قيوده، قد خرج من أسفل مكة، حتى رمى بنفسه بين أظهر المسلمين، فقال سهيل: هذا يا محمد أول ما قاضيتك عليه، أن ترده، فقال النبي صلى الله عليه وسلم: \"إنا لم نقض الكتاب بعد\" فقال: فوالله إذا لا أصالحك على شيء أبدا، فقال النبي صلى الله عليه وسلم: \"فأجزه لي\" فقال: ما أنا بمجيزه، فقال: \"بلى فافعل\" قال: ما أنا بفاعل، قال مكرز: قد أجزناه.\nفقال أبو جندل: يا معشر المسلمين، أرد إلى المشركين وقد جئت مسلما، ألا ترون ما لقيت؟ وكان قد عذب في الله عذابا شديدا.\nقال عمر بن الخطاب: والله ما شككت منذ أسلمت إلا يومئذ، فأتيت النبي صلى الله عليه وسلم، فقلت: يا رسول الله ألست نبي الله؟ قال: \"بلى\" قلت: ألسنا على الحق، وعدونا على الباطل؟ قال: \"بلى\" فقلت: علام نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا وبين أعدائنا؟ فقال: \"إني رسول الله، وهو ناصري، ولست أعصيه\" قلت: أولست كنت تحدثنا أنا سنأتي البيت ونطوف به؟ قال: \"بلى، أفأخبرتك أنك تأتيه العام؟\" قلت: لا، قال: \"فإنك آتيه ومطوف به\"\nقال: فأتيت أبا بكر، فقلت له كما قلت لرسول الله صلى الله عليه وسلم، ورد عليه أبو بكر كما رد عليه رسول الله صلى الله عليه وسلم سواء، وزاد: فاستمسك بغرزه حتى تموت، فوالله إنه لعلى الحق، قال عمر: فعملت لذلك أعمالا.\nفلما فرغ من قضية الكتاب، قال رسول الله صلى الله عليه وسلم: \"قوموا وانحروا، ثم احلقوا\" فوالله ما قام منهم رجل حتى قال ثلاث مرات، فلما لم يقم منهم أحد، قام فدخل على أم سلمة، فذكر لها ما لقي من الناس، فقالت: يا رسول الله أتحب ذلك؟ اخرج، ثم لا تكلم أحدا كلمة حتى تنحر بدنك، وتدعو حالقك فيحلق لك، فقام فخرج، فلم يكلم أحدا منهم حتى فعل ذلك، نحر بدنه، ودعا حالقه فحلقه، فلما رأى الناس ذلك، قاموا فنحروا، وجعل بعضهم يحلق بعضا، حتى كاد بعضهم يقتل بعضا غما، ثم جاءت نسوة مؤمنات، فأنزل الله عز وجل: { إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ } حتى بلغ { بِعِصَمِ الْكَوَافِرِ } فطلق عمر يومئذ امرأتين كانتا له في الشرك، فتزوج إحداهما معاوية، والأخرى صفوان بن أمية، ثم رجع إلى المدينة.\nوفي مرجعه أنزل الله عليه: { إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا } إلى آخرها، فقال عمر: أفتح هو يا رسول الله؟ فقال: \"نعم\" فقال الصحابة: هنيئا لك يا رسول الله، فما لنا؟\nفأنزل الله عز وجل: { هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ }\nالآية. انتهى.\nوهذا آخر تفسير سورة الفتح ولله الحمد والمنة\n[وصلى الله على نبينا محمد وعلى آله وصحبه، نقلته من خط المفسر رحمه الله وعفا عنه، وكان الفراغ من كتابته في 13 ذي الحجة 1345 وصلى الله على نبينا محمد وعلى آله وصحبه وسلم تسليما كثيرا إلى يوم الدين آمين.\nبقلم الفقير إلى ربه سليمان بن حمد العبد الله البسام. غفر الله له ولوالديه ولجميع المسلمين آمين. وصلى الله على محمد وعلى آله وصحبه أجمعين وسلم تسليما كثيرا إلى يوم الدين والحمد لله الذي بنعمته تتم الصالحات]\n                                    "
    }
  }
]