[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Al-Hijr.html",
    "contnent": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ ١",
    "tafsier": {
      "ibnkther": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ ١\n                                    \n                                    \n                                    قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه.\nوحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\n                                    ",
      "qortoby": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ ١\n                                    \n                                    \n                                    الر\nسورة الحجر : مكية إلا آية 87 فمدنية وآياتها 99 نزلت بعد يوسف قال النحاس : قرئ على أبي جعفر أحمد بن شعيب بن علي بن الحسين بن حريث قال : أخبرنا علي بن الحسن عن أبيه عن يزيد أن عكرمة حدثه عن ابن عباس : الر , حم ونون حروف الرحمن مفرقة ; فحدثت به الأعمش فقال : عندك أشباه هذا ولا تخبرني به ؟ .\nوعن ابن عباس أيضا قال : \" الر \" أنا الله أرى .\nقال النحاس : ورأيت أبا إسحاق يميل إلى هذا القول ; لأن سيبويه قد حكى مثله عن العرب وأنشد : بالخير خيرات وإن شرا فا ولا أريد الشر إلا أن تا وقال الحسن وعكرمة : \" الر \" قسم .\nوقال سعيد عن قتادة : \" الر \" اسم السورة ; قال : وكذلك كل هجاء في القرآن .\nوقال مجاهد : هي فواتح السور .\nوقال محمد بن يزيد : هي تنبيه , وكذا حروف التهجي .\nوقرئ \" الر \" من غير إمالة .\nوقرئ بالإمالة لئلا تشبه ما ولا من الحروف .الْكِتَابِ\nقيل فيه : إنه اسم لجنس الكتب المتقدمة من التوراة والإنجيل , ثم قرنهما بالكتاب المبين .\nوقيل : الكتاب هو القرآن , جمع له بين الاسمين .\n                                    ",
      "saadi": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ ١\n                                        \n                                        \n                                        \n                                        يقول تعالى معظما لكتابه مادحا له { تِلْكَ آيَاتُ الْكِتَابِ } أي: الآيات الدالة على أحسن المعاني وأفضل المطالب، { وَقُرْآنٍ مُبِينٍ } للحقائق بأحسن لفظ وأوضحه وأدله على المقصود، وهذا مما يوجب على الخلق الانقياد إليه، والتسليم لحكمه وتلقيه بالقبول والفرح والسرور.\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Al-Hijr.html",
    "contnent": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ ٢",
    "tafsier": {
      "ibnkther": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ ٢\n                                    \n                                    \n                                    وقوله : ( ربما يود الذين كفروا لو كانوا مسلمين ) إخبار عنهم أنهم سيندمون على ما كانوا فيه من الكفر ، ويتمنون لو كانوا مع المسلمين في الدار الدنيا .\nونقل السدي في تفسيره بسنده المشهور عن ابن عباس ، وابن مسعود ، وغيرهما من الصحابة : أن الكفار لما عرضوا على النار ، تمنوا أن لو كانوا مسلمين .\nوقيل : المراد أن كل كافر يود عند احتضاره أن لو كان مؤمنا .\nوقيل : هذا إخبار عن يوم القيامة ، كما في قوله تعالى : ( ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين ) [ الأنعام : 27 ]\nوقال سفيان الثوري : عن سلمة بن كهيل ، عن أبي الزعراء ، عن عبد الله في قوله : ( ربما يود الذين كفروا لو كانوا مسلمين ) قال : هذا في الجهنميين إذ رأوهم يخرجون من النار .\nوقال ابن جرير : حدثنا المثنى ، حدثنا مسلم ، حدثنا القاسم ، حدثنا ابن أبي فروة العبدي أن ابن عباس وأنس بن مالك كانا يتأولان هذه الآية : ( ربما يود الذين كفروا لو كانوا مسلمين ) يتأولانها : يوم يحبس الله أهل الخطايا من المسلمين مع المشركين في النار . قال : فيقول لهم المشركون : ما أغنى عنكم ما كنتم تعبدون في الدنيا . قال : فيغضب الله لهم بفضل رحمته ، فيخرجهم ، فذلك حين يقول : ( ربما يود الذين كفروا لو كانوا مسلمين )\nوقال عبد الرزاق : أخبرنا الثوري ، عن حماد ، عن إبراهيم ، عن خصيف ، عن مجاهد قالا : يقول أهل النار للموحدين : ما أغنى عنكم إيمانكم ؟ فإذا قالوا ذلك ، قال : أخرجوا من كان في قلبه مثقال ذرة ، قال : فعند ذلك قوله : ( [ ربما ] يود الذين كفروا لو كانوا مسلمين )\nوهكذا روي عن الضحاك ، وقتادة ، وأبي العالية ، وغيرهم . وقد ورد في ذلك أحاديث مرفوعة ، فقال الحافظ أبو القاسم الطبراني .\nحدثنا محمد بن العباس هو الأخرم ، حدثنا محمد بن منصور الطوسي ، حدثنا صالح بن إسحاق الجهبذ - دلني عليه يحيى بن معين - حدثنا معرف بن واصل ، عن يعقوب بن أبي نباتة عن عبد الرحمن الأغر ، عن أنس بن مالك - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" إن ناسا من أهل لا إله إلا الله يدخلون النار بذنوبهم ، فيقول لهم أهل اللات والعزى : ما أغنى عنكم قولكم : لا إله إلا الله وأنتم معنا في النار ، فيغضب الله لهم ، فيخرجهم ، فيلقيهم في نهر الحياة ، فيبرءون من حرقهم كما يبرأ القمر من خسوفه ، فيدخلون الجنة ، ويسمون فيها الجهنميين \" فقال رجل : يا أنس ، أنت سمعت هذا من رسول الله - صلى الله عليه وسلم - ؟ فقال أنس : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" من كذب علي متعمدا فليتبوأ مقعده من النار \" . نعم ، أنا سمعت رسول الله - صلى الله عليه وسلم - يقول هذا .\nثم قال الطبراني : تفرد به الجهبذ\nالحديث الثاني : وقال الطبراني أيضا : حدثنا عبد الله بن أحمد بن حنبل ، حدثنا أبو الشعثاء علي بن حسن الواسطي ، حدثنا خالد بن نافع الأشعري ، عن سعيد بن أبي بردة ، عن أبيه ، عن أبي موسى - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" إذا اجتمع أهل النار في النار ، ومعهم من شاء الله من أهل القبلة ، قال الكفار للمسلمين : ألم تكونوا مسلمين ؟ قالوا : بلى . قالوا : فما أغنى عنكم الإسلام ! فقد صرتم معنا في النار ؟ قالوا : كانت لنا ذنوب فأخذنا بها . فسمع الله ما قالوا ، فأمر بمن كان في النار من أهل القبلة فأخرجوا ، فلما رأى ذلك من بقي من الكفار قالوا : يا ليتنا كنا مسلمين فنخرج كما خرجوا \" . قال : ثم قرأ رسول الله - صلى الله عليه وسلم - : أعوذ بالله من الشيطان الرجيم ( الر تلك آيات الكتاب وقرآن مبين ربما يود الذين كفروا لو كانوا مسلمين )\nورواه ابن أبي حاتم من حديث خالد بن نافع به ، وزاد فيه : ( بسم الله الرحمن الرحيم ) ، عوض الاستعاذة .\nالحديث الثالث : وقال الطبراني أيضا : حدثنا موسى بن هارون ، حدثنا إسحاق بن راهويه قال : قلت لأبي أسامة : أحدثكم أبو روق - واسمه عطية بن الحارث - : حدثني صالح بن أبي طريف قال : سألت أبا سعيد الخدري فقلت له : هل سمعت رسول الله - صلى الله عليه وسلم - يقول في هذه الآية : ( ربما يود الذين كفروا لو كانوا مسلمين ) ؟ قال : نعم ، سمعته يقول : \" يخرج الله ناسا من المؤمنين من النار بعدما يأخذ نقمته منهم \" . وقال : \" لما أدخلهم الله النار مع المشركين قال لهم المشركون : تزعمون أنكم أولياء الله في الدنيا ، فما بالكم معنا في النار ؟ فإذا سمع الله ذلك منهم ، أذن في الشفاعة لهم فتشفع الملائكة والنبيون ، ويشفع المؤمنون ، حتى يخرجوا بإذن الله ، فإذا رأى المشركون ذلك ، قالوا : يا ليتنا كنا مثلهم ، فتدركنا الشفاعة ، فنخرج معهم \" . قال : \" فذلك قول الله : ( ربما يود الذين كفروا لو كانوا مسلمين ) فيسمون في الجنة الجهنميين من أجل سواد في وجوههم ، فيقولون : يا رب ، أذهب عنا هذا الاسم ، فيأمرهم فيغتسلون في نهر الجنة ، فيذهب ذلك الاسم عنهم \" ، فأقر به أبو أسامة ، وقال : نعم .\nالحديث الرابع وقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا العباس بن الوليد النرسي حدثنا مسكين أبو فاطمة ، حدثني اليمان بن يزيد ، عن محمد بن حمير عن محمد بن علي ، عن أبيه ، عن جده قال : قال رسول الله - صلى الله عليه وسلم - : \" منهم من تأخذه النار إلى ركبتيه ، ومنهم من تأخذه النار إلى حجزته ، ومنهم من تأخذه النار إلى عنقه ، على قدر ذنوبهم وأعمالهم ، ومنهم من يمكث فيها شهرا ثم يخرج منها ، ومنهم من يمكث فيها سنة ثم يخرج منها ، وأطولهم فيها مكثا بقدر الدنيا منذ يوم خلقت إلى أن تفنى ، فإذا أراد الله أن يخرجوا منها قالت اليهود والنصارى ومن في النار من أهل الأديان والأوثان لمن في النار من أهل التوحيد : آمنتم بالله وكتبه ورسله ، فنحن وأنتم اليوم في النار سواء ، فيغضب الله لهم غضبا لم يغضبه لشيء فيما مضى ، فيخرجهم إلى عين في الجنة ، وهو قوله : ( ربما يود الذين كفروا لو كانوا مسلمين ) .\n                                    ",
      "qortoby": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ ٢\n                                    \n                                    \n                                    قوله تعالى : ربما يود الذين كفروا لو كانوا مسلمين رب لا تدخل على الفعل ، فإذا لحقتها \" ما \" هيأتها للدخول على الفعل تقول : ربما قام زيد ، وربما يقوم زيد . ويجوز أن تكون ما نكرة بمعنى شيء ، ويود صفة له ; أي رب شيء يود الكافر . وقرأ نافع وعاصم ربما مخفف الباء . الباقون مشددة ، وهما لغتان . قال أبو حاتم : أهل الحجاز يخففون ربما ; قال الشاعر :\nربما ضربة بسيف صقيل بين بصرى وطعنة نجلاء\nوتميم وقيس وربيعة يثقلونها . وحكي فيها : ربما وربما ، وربتما وربتما ، بتخفيف الباء وتشديدها أيضا . وأصلها أن تستعمل في القليل وقد تستعمل في الكثير ; أي يود الكفار في أوقات كثيرة لو كانوا مسلمين ; قاله الكوفيون . ومنه قول الشاعر :\nألا ربما أهدت لك العين نظرة قصاراك منها أنها عنك لا تجدي\nوقال بعضهم : هي للتقليل في هذا الموضع ; لأنهم قالوا ذلك في بعض المواضع لا في كلها ; لشغلهم بالعذاب ، والله أعلم . قال : ربما يود وهي إنما تكون لما وقع ; لأنه لصدق الوعد كأنه عيان قد كان . وخرج الطبراني أبو القاسم من حديث جابر بن عبد الله قال : قال رسول الله - صلى الله عليه وسلم - : إن ناسا من أمتي يدخلون النار بذنوبهم فيكونون في النار ما شاء الله أن يكونوا ثم يعيرهم أهل الشرك فيقولون ما نرى ما كنتم تخالفونا فيه من تصديقكم وإيمانكم نفعكم فلا يبقى موحد إلا أخرجه الله من النار - ثم قرأ رسول الله - صلى الله عليه وسلم - - ربما يود الذين كفروا لو كانوا مسلمين . قال الحسن \" إذا رأى المشركون المسلمين وقد دخلوا الجنة ومأواهم في النار تمنوا أنهم كانوا مسلمين . وقال الضحاك : هذا التمني إنما هو عند المعاينة في الدنيا حين تبين لهم الهدى من الضلالة . وقيل : في القيامة إذا رأوا كرامة المؤمنين وذل الكافرين .\n                                    ",
      "saadi": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ ٢\n                                        \n                                        \n                                        \n                                        فأما من قابل هذه النعمة العظيمة بردها والكفر بها، فإنه من المكذبين الضالين، الذين سيأتي عليهم وقت يتمنون أنهم مسلمون، أي: منقادون لأحكامه وذلك حين ينكشف الغطاء وتظهر أوائل الآخرة ومقدمات الموت، فإنهم في أحوال الآخرة كلها يتمنون أنهم مسلمون، وقد فات وقت الإمكان، ولكنهم في هذه الدنيا مغترون.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Al-Hijr.html",
    "contnent": "ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ٣",
    "tafsier": {
      "ibnkther": "ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ٣\n                                    \n                                    \n                                    وقوله : ( ذرهم يأكلوا ويتمتعوا ) تهديد لهم شديد ، ووعيد أكيد ، كقوله تعالى : ( قل تمتعوا فإن مصيركم إلى النار ) [ إبراهيم : 30 ] وقوله : ( كلوا وتمتعوا قليلا إنكم مجرمون ) [ المرسلات : 46 ] ولهذا قال : ( ويلههم الأمل ) أي : عن التوبة والإنابة ، ( فسوف يعلمون ) أي : عاقبة أمرهم .\n                                    ",
      "qortoby": "ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ٣\n                                    \n                                    \n                                    قوله تعالى : ذرهم يأكلوا ويتمتعوا ويلههم الأمل فسوف يعلمون فيه مسألتان :\nالأولى : قوله - تعالى - : ذرهم يأكلوا ويتمتعوا تهديد لهم . ويلههم الأمل أي يشغلهم عن الطاعة . يقال : ألهاه عن كذا أي شغله . ولهي هو عن الشيء يلهى . فسوف يعلمون إذا رأوا القيامة وذاقوا وبال ما صنعوا . وهذه الآية منسوخة بالسيف .\nالثانية : في مسند البزار عن أنس قال : قال رسول الله - صلى الله عليه وسلم - : أربعة من الشقاء : جمود العين ، وقساوة القلب ، وطول الأمل ، والحرص على الدنيا . وطول الأمل داء عضال ومرض مزمن ، ومتى تمكن من القلب فسد مزاجه واشتد علاجه ، ولم يفارقه داء ولا نجح فيه دواء ، بل أعيا الأطباء ويئس من برئه الحكماء والعلماء . وحقيقة الأمل : الحرص على الدنيا والانكباب عليها ، والحب لها والإعراض عن الآخرة . وروي عن رسول الله - صلى الله عليه وسلم - أنه قال : نجا أول هذه الأمة باليقين والزهد ويهلك آخرها بالبخل والأمل . ويروى عن أبي الدرداء - رضي الله عنه - أنه قام على درج مسجد دمشق فقال : ( يا أهل دمشق ، ألا تسمعون من أخ لكم ناصح ، إن من كان قبلكم كانوا يجمعون كثيرا ويبنون مشيدا ويأملون بعيدا ، فأصبح جمعهم بورا وبنيانهم قبورا وأملهم غرورا . هذه عاد قد ملأت البلاد أهلا ومالا وخيلا ورجالا ، فمن يشتري مني اليوم تركتهم بدرهمين ! وأنشد :\nيا ذا المؤمل آمالا وإن بعدت منه ويزعم أن يحظى بأقصاها أنى تفوز بما ترجوه ويك وما\nأصبحت في ثقة من نيل أدناها\nوقال الحسن : ( ما أطال عبد الأمل إلا أساء العمل ) . وصدق - رضي الله عنه - ! فالأمل يكسل عن العمل ويورث التراخي والتواني ، ويعقب التشاغل والتقاعس ، ويخلد إلى الأرض ويميل إلى الهوى . وهذا أمر قد شوهد بالعيان فلا يحتاج إلى بيان ولا يطلب صاحبه ببرهان ; كما أن قصر الأمل يبعث على العمل ، ويحيل على المبادرة ، ويحث على المسابقة .\n                                    ",
      "saadi": "ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ٣\n                                        \n                                        \n                                        \n                                        فـ { ذَرْهُمْ يَأْكُلُوا وَيَتَمَتَّعُوا } بلذاتهم { وَيُلْهِهِمُ الْأَمَلُ } أي: يؤملون البقاء في الدنيا فيلهيهم عن الآخرة، { فَسَوْفَ يَعْلَمُونَ } أن ما هم عليه باطل وأن أعمالهم ذهبت خسرانا عليهم ولا يغتروا بإمهال الله تعالى فإن هذه سنته في الأمم.\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Al-Hijr.html",
    "contnent": "وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ ٤",
    "tafsier": {
      "ibnkther": "وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ ٤\n                                    \n                                    \n                                    يخبر تعالى أنه ما أهلك قرية إلا بعد قيام الحجة عليها وانتهاء أجلها.\n                                    ",
      "qortoby": "وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ ٤\n                                    \n                                    \n                                    قوله تعالى : وما أهلكنا من قرية إلا ولها كتاب معلوم أي أجل مؤقت كتب لهم في اللوح المحفوظ .\n                                    ",
      "saadi": "وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ ٤\n                                        \n                                        \n                                        \n                                        { وَمَا أَهْلَكْنَا مِنْ قَرْيَةٍ } كانت مستحقة للعذاب { إِلَّا وَلَهَا كِتَابٌ مَعْلُومٌ } مقدر لإهلاكها.\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Al-Hijr.html",
    "contnent": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ٥",
    "tafsier": {
      "ibnkther": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ٥\n                                    \n                                    \n                                    وأنه لا يؤخر أمة حان هلاكهم عن ميقاتهم ولا يتقدمون عن مدتهم وهذا تنبيه لأهل مكة وإرشاد لهم إلى الإقلاع عما هم عليه من الشرك والعناد والإلحاد الذي يستحقون به الهلاك.\n                                    ",
      "qortoby": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ٥\n                                    \n                                    \n                                    قوله تعالى : ما تسبق من أمة أجلها وما يستأخرون ( من ) صلة ; كقولك : ما جاءني من أحد . أي لا تتجاوز أجلها فتزيد عليه ، ولا تتقدم قبله . ونظيره قوله - تعالى - : فإذا جاء أجلهم لا يستأخرون ساعة ولا يستقدمون .\n                                    ",
      "saadi": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ٥\n                                        \n                                        \n                                        \n                                        { مَا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَأْخِرُونَ } وإلا فالذنوب لا بد من وقوع أثرها وإن تأخر\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Al-Hijr.html",
    "contnent": "وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونٞ ٦",
    "tafsier": {
      "ibnkther": "وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونٞ ٦\n                                    \n                                    \n                                    يخبر تعالى عن كفرهم وعتوهم وعنادهم في قولهم : ( يا أيها الذي نزل عليه الذكر ) أي : الذي يدعي ذلك ( إنك لمجنون ) أي : في دعائك إيانا إلى اتباعك وترك ما وجدنا عليه آباءنا .\n                                    ",
      "qortoby": "وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونٞ ٦\n                                    \n                                    \n                                    قاله كفار قريش لمحمد صلى الله عليه وسلم على جهة الاستهزاء .\n                                    ",
      "saadi": "وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونٞ ٦\n                                        \n                                        \n                                        \n                                        أي: وقال المكذبون لمحمد صلى الله عليه وسلم استهزاء وسخرية: { يا أيها الذي نزل عليه الذكر } على زعمك { إنك لمجنون } إذ تظن أنا سنتبعك ونترك ما وجدنا عليه آباءنا لمجرد قولك.\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Al-Hijr.html",
    "contnent": "لَّوۡ مَا تَأۡتِينَا بِٱلۡمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٧",
    "tafsier": {
      "ibnkther": "لَّوۡ مَا تَأۡتِينَا بِٱلۡمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٧\n                                    \n                                    \n                                    ( لو ما ) أي : هلا ( تأتينا بالملائكة ) أي : يشهدون لك بصحة ما جئت به ( إن كنت من الصادقين ) كما قال فرعون : ( فلولا ألقي عليه أسورة من ذهب أو جاء معه الملائكة مقترنين ) [ الزخرف : 53 ] ( وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا لقد استكبروا في أنفسهم وعتوا عتوا كبيرا يوم يرون الملائكة لا بشرى يومئذ للمجرمين ويقولون حجرا محجورا ) [ الفرقان : 21 ، 22 ]\n                                    ",
      "qortoby": "لَّوۡ مَا تَأۡتِينَا بِٱلۡمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٧\n                                    \n                                    \n                                    ثم طلبوا منه إتيان الملائكة دلالة على صدقه . ولوما تحضيض على الفعل كلولا وهلا . وقال الفراء : الميم في لوما بدل من اللام في لولا . ومثله استولى على الشيء واستومى عليه ، ومثله خالمته وخاللته ، فهو خلي وخلمي ; أي صديقي . وعلى هذا يجوز لوما بمعنى الخبر ، تقول : لوما زيد لضرب عمرو . قال الكسائي : لولا ولوما سواء في الخبر والاستفهام .\nقال ابن مقبل :\nلوما الحياء ولوما الدين عبتكما ببعض ما فيكما إذ عبتما عوري\nيريد لولا الحياء . وحكى النحاس لوما ولولا وهلا واحد . وأنشد أهل اللغة على ذلك :\nتعدون عقر النيب أفضل مجدكم بني ضوطرى لولا الكمي المقنعا\nأي هلا تعدون الكمي المقنعا .\n                                    ",
      "saadi": "لَّوۡ مَا تَأۡتِينَا بِٱلۡمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٧\n                                        \n                                        \n                                        \n                                        { لو ما تأتينا بالملائكة } يشهدون لك بصحة ما جئت به { إن كنت من الصادقين } فلما لم تأت بالملائكة فلست بصادق، وهذا من أعظم الظلم والجهل.\nأما الظلم فظاهر فإن هذا تجرؤ على الله وتعنت بتعيين الآيات التي لم يخترها وحصل المقصود والبرهان بدونها من الآيات الكثيرة الدالة على صحة ما جاء به، وأما الجهل، فإنهم جهلوا مصلحتهم من مضرتهم، فليس في إنزال الملائكة، خير لهم بل لا ينزل الله الملائكة إلا بالحق الذي لا إمهال على من لم يتبعه وينقد له.\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Al-Hijr.html",
    "contnent": "مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ ٨",
    "tafsier": {
      "ibnkther": "مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ ٨\n                                    \n                                    \n                                    وكذا قال في هذه الآية : ( ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين )\nوقال مجاهد في قوله : ( ما ننزل الملائكة إلا بالحق ) بالرسالة والعذاب .\n                                    ",
      "qortoby": "مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ ٨\n                                    \n                                    \n                                    قوله تعالى : ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين / قرأ حفص وحمزة والكسائي ما ننزل الملائكة إلا بالحق واختاره أبو عبيد .\nوقرأ أبو بكر والمفضل \" ما تنزل الملائكة \" . الباقون \" ما تنزل الملائكة \" وتقديره : ما تتنزل بتاءين حذفت إحداهما تخفيفا ، وقد شدد التاء البزي ، واختاره أبو حاتم اعتبارا بقوله : تنزل الملائكة والروح .\nومعنى إلا بالحق إلا بالقرآن . وقيل بالرسالة ; عن مجاهد . وقال الحسن : إلا بالعذاب إن لم يؤمنوا .\nوما كانوا إذا منظرين أي لو تنزلت الملائكة بإهلاكهم لما أمهلوا ولا قبلت لهم توبة . وقيل : المعنى لو تنزلت الملائكة تشهد لك فكفروا بعد ذلك لم ينظروا . وأصل إذا إذ أن - ومعناه حينئذ - فضم إليها أن ، واستثقلوا الهمزة فحذفوها .\n                                    ",
      "saadi": "مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ ٨\n                                        \n                                        \n                                        \n                                        لا ينزل الله الملائكة إلا بالحق الذي لا إمهال على من لم يتبعه وينقد له.( وَمَا كَانُوا إِذًا ) أي: حين تنزل الملائكة، إن لم يؤمنوا، ولن يؤمنوا بـ ( مُنْظَرِينَ ) أي: بمهملين، فصار طلبهم لإنزال الملائكة تعجيلا لأنفسهم بالهلاك والدمار، فإن الإيمان ليس في أيديهم وإنما هو بيد الله، وَلَوْ أَنَّنَا نَزَّلْنَا إِلَيْهِمُ الْمَلائِكَةَ وَكَلَّمَهُمُ الْمَوْتَى وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلا مَا كَانُوا لِيُؤْمِنُوا إِلا أَنْ يَشَاءَ اللَّهُ وَلَكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ ويكفيهم من الآيات إن كانوا صادقين، هذا القرآن العظيم ولهذا قال هنا:\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Al-Hijr.html",
    "contnent": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٩",
    "tafsier": {
      "ibnkther": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٩\n                                    \n                                    \n                                    ثم قرر تعالى أنه هو الذي أنزل الذكر ، وهو القرآن ، وهو الحافظ له من التغيير والتبديل .\nومنهم من أعاد الضمير في قوله تعالى : ( له لحافظون ) على النبي - صلى الله عليه وسلم - كقوله : ( والله يعصمك من الناس ) [ المائدة : 67 ] والمعنى الأول أولى ، وهو ظاهر السياق ، [ والله أعلم ]\n                                    ",
      "qortoby": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٩\n                                    \n                                    \n                                    قوله تعالى : إنا نحن نزلنا الذكر وإنا له لحافظون قوله تعالى : إنا نحن نزلنا الذكر يعني القرآن .\nوإنا له لحافظون من أن يزاد فيه أو ينقص منه . قال قتادة وثابت البناني : حفظه الله من أن تزيد فيه الشياطين باطلا أو تنقص منه حقا ; فتولى سبحانه حفظه فلم يزل محفوظا ، وقال في غيره : بما استحفظوا ، فوكل حفظه إليهم فبدلوا وغيروا . أنبأنا الشيخ الفقيه الإمام أبو القاسم عبد الله عن أبيه الشيخ الفقيه الإمام المحدث أبي الحسن علي بن خلف بن معزوز الكومي التلمساني قال : قرئ على الشيخة العالمة فخر النساء شهدة بنت أبي نصر أحمد بن الفرج الدينوري وذلك بمنزلها بدار السلام في آخر جمادى الآخرة من سنة أربع وستين وخمسمائة ، قيل لها : أخبركم الشيخ الأجل العامل نقيب النقباء أبو الفوارس طراد بن محمد الزيني قراءة عليه وأنت تسمعين سنة تسعين وأربعمائة ، أخبرنا علي بن عبد الله بن إبراهيم حدثنا أبو علي عيسى بن محمد بن أحمد بن عمر بن عبد الملك بن عبد العزيز بن جريج المعروف بالطوماري حدثنا الحسين بن فهم قال : سمعت يحيى بن أكثم يقول : كان للمأمون - وهو أمير إذ ذاك - مجلس نظر ، فدخل في جملة الناس رجل يهودي حسن الثوب حسن الوجه طيب الرائحة ، قال : فتكلم فأحسن الكلام والعبارة ، قال : فلما تقوض المجلس دعاه المأمون فقال له : إسرائيلي ؟ قال نعم . قال له : أسلم حتى أفعل بك وأصنع ، ووعده . فقال : ديني ودين آبائي ! وانصرف . قال : فلما كان بعد سنة جاءنا مسلما ، قال : فتكلم على الفقه فأحسن الكلام ; فلما تقوض المجلس دعاه المأمون وقال : ألست صاحبنا بالأمس ؟ قال له : بلى . قال : فما كان سبب إسلامك ؟ قال : انصرفت من حضرتك فأحببت أن أمتحن هذه الأديان ، وأنت تراني حسن الخط ، فعمدت إلى التوراة فكتبت ثلاث نسخ فزدت فيها ونقصت ، وأدخلتها الكنيسة فاشتريت مني ، وعمدت إلى الإنجيل فكتبت ثلاث نسخ فزدت فيها ونقصت ، وأدخلتها البيعة فاشتريت مني ، وعمدت إلى القرآن فعملت ثلاث نسخ وزدت فيها ونقصت ، وأدخلتها الوراقين فتصفحوها ، فلما أن وجدوا فيها الزيادة والنقصان رموا بها فلم يشتروها ; فعلمت أن هذا كتاب محفوظ ، فكان هذا سبب إسلامي . قال يحيى بن أكثم : فحججت تلك السنة فلقيت سفيان بن عيينة فذكرت له الخبر فقال لي : مصداق هذا في كتاب الله - عز وجل - . قال قلت : في أي موضع ؟ قال : في قول الله - تبارك وتعالى - في التوراة والإنجيل : بما استحفظوا من كتاب الله ، فجعل حفظه إليهم فضاع ، وقال - عز وجل - : إنا نحن نزلنا الذكر وإنا له لحافظون فحفظه الله - عز وجل - علينا فلم يضع . وقيل : وإنا له لحافظون أي لمحمد - صلى الله عليه وسلم - من أن يتقول علينا أو نتقول عليه . أو وإنا له لحافظون من أن يكاد أو يقتل . نظيره والله يعصمك من الناس . ونحن نجوز أن يكون موضعه رفعا بالابتداء \" ونزلنا \" الخبر . والجملة خبر إن . ويجوز أن يكون نحن تأكيدا لاسم إن في موضع نصب ، ولا تكون فاصلة لأن الذي بعدها ليس بمعرفة وإنما هو جملة ، والجمل تكون نعوتا للنكرات فحكمها حكم النكرات .\n                                    ",
      "saadi": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٩\n                                        \n                                        \n                                        \n                                        ( إِنَّا نَحْنُ نزلْنَا الذِّكْرَ ) أي: القرآن الذي فيه ذكرى لكل شيء من المسائل والدلائل الواضحة، وفيه يتذكر من أراد التذكر، ( وَإِنَّا لَهُ لَحَافِظُونَ ) أي: في حال إنزاله وبعد إنزاله، ففي حال إنزاله حافظون له من استراق كل شيطان رجيم، وبعد إنزاله أودعه الله في قلب رسوله، واستودعه فيها ثم في قلوب أمته، وحفظ الله ألفاظه من التغيير فيها والزيادة والنقص، ومعانيه من التبديل، فلا يحرف محرف معنى من معانيه إلا وقيض الله له من يبين الحق المبين، وهذا من أعظم آيات الله ونعمه على عباده المؤمنين، ومن حفظه أن الله يحفظ أهله من أعدائهم، ولا يسلط عليهم عدوا يجتاحهم.\n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Al-Hijr.html",
    "contnent": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ٠١",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ٠١\n                                    \n                                    \n                                    يقول تعالى مسليا لرسوله في تكذيب من كذبه من كفار قريش : إنه أرسل من قبله في الأمم الماضية ، وإنه ما أتى أمة رسول إلا كذبوه واستهزءوا به .\n                                    ",
      "qortoby": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ٠١\n                                    \n                                    \n                                    قوله تعالى : ولقد أرسلنا من قبلك في شيع الأولين المعنى : ولقد أرسلنا من قبلك رسلا ، فحذف . والشيع جمع شيعة وهي الأمة ، أي في أممهم ; قاله ابن عباس وقتادة . والحسن : في فرقهم . والشيعة : الفرقة والطائفة من الناس المتآلفة المتفقة الكلمة . فكأن الشيع الفرق ; ومنه قوله - تعالى - : أو يلبسكم شيعا . وأصله مأخوذ من الشياع وهو الحطب الصغار يوقد به الكبار - كما تقدم في \" الأنعام \" . - وقال الكلبي : إن الشيع هنا القرى .\n                                    ",
      "saadi": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ٠١\n                                        \n                                        \n                                        \n                                        يقول تعالى لنبيه إذ كذبه المشركون: لم يزل هذا دأب الأمم الخالية والقرون الماضية: { ولقد أرسلنا من قبلك في شيع الأولين } أي: فرقهم وجماعتهم رسلا.\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Al-Hijr.html",
    "contnent": "وَمَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ١١",
    "tafsier": {
      "ibnkther": "وَمَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ١١\n                                    \n                                    \n                                    ثم أخبر أنه سلك التكذيب في قلوب المجرمين الذين عاندوا واستكبروا عن اتباع الهدى .\n                                    ",
      "qortoby": "وَمَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : وما يأتيهم من رسول إلا كانوا به يستهزئون تسلية للنبي - صلى الله عليه وسلم - ; أي كما فعل بك هؤلاء المشركون فكذلك فعل بمن قبلك من الرسل .\n                                    ",
      "saadi": "وَمَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ١١\n                                        \n                                        \n                                        \n                                        { وما يأتيهم من رسول } يدعوهم إلى الحق والهدى { إلا كانوا به يستهزئون }\n                                    "
    }
  },
  {
    "id": 11,
    "versesNumber": 12,
    "souraName": "Al-Hijr.html",
    "contnent": "كَذَٰلِكَ نَسۡلُكُهُۥ فِي قُلُوبِ ٱلۡمُجۡرِمِينَ ٢١",
    "tafsier": {
      "ibnkther": "كَذَٰلِكَ نَسۡلُكُهُۥ فِي قُلُوبِ ٱلۡمُجۡرِمِينَ ٢١\n                                    \n                                    \n                                    قال أنس ، والحسن البصري : ( كذلك نسلكه في قلوب المجرمين ) يعني : الشرك .\n                                    ",
      "qortoby": "كَذَٰلِكَ نَسۡلُكُهُۥ فِي قُلُوبِ ٱلۡمُجۡرِمِينَ ٢١\n                                    \n                                    \n                                    قوله تعالى : كذلك نسلكه في قلوب المجرمين\nقوله - تعالى - : كذلك نسلكه أي الضلال والكفر والاستهزاء والشرك . في قلوب المجرمين من قومك ; عن الحسن وقتادة وغيرهما . أي كما سلكناه في قلوب من تقدم من شيع الأولين كذلك نسلكه في قلوب مشركي قومك حتى لا يؤمنوا بك ، كما لم يؤمن من قبلهم برسلهم . وروى ابن جريج عن مجاهد قال : نسلك التكذيب . والسلك : إدخال الشيء في الشيء كإدخال الخيط في المخيط . يقال : سلكه يسلكه سلكا وسلوكا ، وأسلكه إسلاكا . وسلك الطريق سلوكا وسلكا وأسلكه دخله ، والشيء في غيره مثله ، والشيء كذلك والرمح ، والخيط في الجوهر ; كله فعل وأفعل . وقال عدي بن زيد :\nوقد سلكوك في يوم عصيب\nوالسلك ( بالكسر ) الخيط . وفي الآية رد على القدرية والمعتزلة . وقيل : المعنى نسلك القرآن في قلوبهم فيكذبون به . وقال الحسن ومجاهد وقتادة القول الذي عليه أكثر أهل التفسير ، وهو ألزم حجة على المعتزلة . وعن الحسن أيضا : نسلك الذكر إلزاما للحجة ; ذكره الغزنوي .\n                                    ",
      "saadi": "كَذَٰلِكَ نَسۡلُكُهُۥ فِي قُلُوبِ ٱلۡمُجۡرِمِينَ ٢١\n                                        \n                                        \n                                        \n                                        { كذلك نسلكه } أي: ندخل التكذيب { في قلوب المجرمين } أي: الذين وصفهم لظلم والبهت، عاقبناهم لما اشتبهت قلوبهم بالكفر والتكذيب، تشابهت معاملتهم لأنبيائهم ورسلهم بالاستهزاء والسخرية وعدم الإيمان\n                                    "
    }
  },
  {
    "id": 12,
    "versesNumber": 13,
    "souraName": "Al-Hijr.html",
    "contnent": "لَا يُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ ٣١",
    "tafsier": {
      "ibnkther": "لَا يُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ ٣١\n                                    \n                                    \n                                    وقوله : ( وقد خلت سنة الأولين ) أي : قد علم ما فعل تعالى بمن كذب رسله من الهلاك والدمار ، وكيف أنجى الله الأنبياء وأتباعهم في الدنيا والآخرة .\n                                    ",
      "qortoby": "لَا يُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ ٣١\n                                    \n                                    \n                                    وقد خلت سنة الأولين أي مضت سنة الله بإهلاك الكفار ، فما أقرب هؤلاء من الهلاك . وقيل : خلت سنة الأولين بمثل ما فعل هؤلاء من التكذيب والكفر ، فهم يقتدون بأولئك .\n                                    ",
      "saadi": "لَا يُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ ٣١\n                                        \n                                        \n                                        \n                                        { لا يؤمنون به وقد خلت سنة الأولين } أي: عادة الله فيهم بإهلاك من لم يؤمن بآيات الله.\n                                    "
    }
  },
  {
    "id": 13,
    "versesNumber": 14,
    "souraName": "Al-Hijr.html",
    "contnent": "وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ فِيهِ يَعۡرُجُونَ ٤١",
    "tafsier": {
      "ibnkther": "وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ فِيهِ يَعۡرُجُونَ ٤١\n                                    \n                                    \n                                    يخبر تعالى عن قوة كفرهم وعنادهم ومكابرتهم للحق أنه لو فتح لهم بابا من السماء ، فجعلوا يصعدون فيه ، لما صدقوا بذلك\n                                    ",
      "qortoby": "وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ فِيهِ يَعۡرُجُونَ ٤١\n                                    \n                                    \n                                    قوله تعالى : ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون\nيقال : ظل يفعل كذا ، أي يفعله بالنهار . والمصدر الظلول . أي لو أجيبوا إلى ما اقترحوا من الآيات لأصروا على الكفر وتعللوا بالخيالات ; كما قالوا للقرآن المعجز : إنه سحر . يعرجون من عرج يعرج أي صعد . والمعارج المصاعد . أي لو صعدوا إلى السماء وشاهدوا الملكوت والملائكة لأصروا على الكفر ; عن الحسن وغيره . وقيل : الضمير في عليهم للمشركين . وفي فظلوا للملائكة ، تذهب وتجيء . أي لو كشف لهؤلاء حتى يعاينوا أبوابا في السماء تصعد فيها الملائكة وتنزل لقالوا : رأينا بأبصارنا ما لا حقيقة له ; عن ابن عباس وقتادة .\n                                    ",
      "saadi": "وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ فِيهِ يَعۡرُجُونَ ٤١\n                                        \n                                        \n                                        \n                                        أي: ولو جاءتهم كل آية عظيمة لم يؤمنوا وكابروا { ولو فتحنا عليهم بابا من السماء } فصاروا يعرجون فيه، ويشاهدونه عيانا بأنفسهم\n                                    "
    }
  },
  {
    "id": 14,
    "versesNumber": 15,
    "souraName": "Al-Hijr.html",
    "contnent": "لَقَالُوٓاْ إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ ٥١",
    "tafsier": {
      "ibnkther": "لَقَالُوٓاْ إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ ٥١\n                                    \n                                    \n                                    بل قالوا : ( سكرت أبصارنا )\nقال مجاهد وابن كثير ، والضحاك : سدت أبصارنا .\nوقال قتادة ، عن ابن عباس : أخذت أبصارنا .\nوقال العوفي عن ابن عباس : شبه علينا ، وإنما سحرنا .\nوقال الكلبي : عميت أبصارنا .\nوقال ابن زيد : ( سكرت أبصارنا ) السكران الذي لا يعقل .\n                                    ",
      "qortoby": "لَقَالُوٓاْ إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ ٥١\n                                    \n                                    \n                                    معنى سكرت سدت بالسحر ; قاله ابن عباس والضحاك . وقال الحسن : سحرت . الكلبي : أغشيت أبصارنا ; وعنه أيضا عميت . قتادة : أخذت . وقال المؤرج : دير بنا من الدوران ; أي صارت أبصارنا سكرى . جويبر : خدعت . وقال أبو عمرو بن العلاء : سكرت غشيت وغطيت . ومنه قول الشاعر :\nوطلعت شمس عليها مغفر وجعلت عين الحرور تسكر\nوقال مجاهد : سكرت حبست . ومنه قول أوس بن حجر :\nفصرت على ليلة ساهرة فليست بطلق ولا ساكرةs\nقلت : وهذه أقوال متقاربة يجمعها قولك : منعت . قال ابن عزيز : سكرت أبصارنا سدت أبصارنا ; هو من قولك ، سكرت النهر إذا سددته . ويقال : هو من سكر الشراب ، كأن العين يلحقها ما يلحق الشارب إذا سكر . وقرأ ابن كثير \" سكرت \" بالتخفيف ، . والباقون بالتشديد . قال ابن الأعرابي : سكرت ملئت . قال المهدوي : والتخفيف والتشديد في سكرت ظاهران ، التشديد للتكثير والتخفيف يؤدي عن معناه . والمعروف أن \" سكر \" لا يتعدى . قال أبو علي : يجوز أن يكون سمع متعديا في البصر . ومن قرأ \" سكرت \" فإنه شبه ما عرض لأبصارهم بحال السكران ، كأنها جرت مجرى السكران لعدم تحصيله . وقد قيل : إنه بالتخفيف [ من ] سكر الشراب ، وبالتشديد أخذت ، ذكرهما الماوردي . وقال النحاس : والمعروف من قراءة مجاهد والحسن \" سكرت \" بالتخفيف . قال الحسن : أي سحرت وحكى أبو عبيد عن أبي عبيدة أنه يقال : سكرت أبصارهم إذا غشيها سمادير حتى لا يبصروا . وقال الفراء : من قرأ سكرت أخذه من سكور الريح . قال النحاس : وهذه الأقوال متقاربة . والأصل فيها ما قال أبو عمرو بن العلاء - رحمه الله تعالى - ، قال : هو من السكر في الشراب . وهذا قول حسن ; أي غشيهم ما غطى أبصارهم كما غشي السكران ما غطى عقله . وسكور الريح سكونها وفتورها ; فهو يرجع إلى معنى التحيير .\n                                    ",
      "saadi": "لَقَالُوٓاْ إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ ٥١\n                                        \n                                        \n                                        \n                                        لقالوا من ظلمهم وعنادهم منكرين لهذه الآية: { إنما سكرت أبصارنا } أي: أصابها سكر وغشاوة حتى رأينا ما لم نر، { بل نحن قوم مسحورون } أي: ليس هذا بحقيقة، بل هذا سحر، وقوم وصلت بهم الحال إلى هذا الإنكار، فإنهم لا مطمع فيهم ولا رجاء\n                                    "
    }
  },
  {
    "id": 15,
    "versesNumber": 16,
    "souraName": "Al-Hijr.html",
    "contnent": "وَلَقَدۡ جَعَلۡنَا فِي ٱلسَّمَآءِ بُرُوجٗا وَزَيَّنَّٰهَا لِلنَّٰظِرِينَ ٦١",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ جَعَلۡنَا فِي ٱلسَّمَآءِ بُرُوجٗا وَزَيَّنَّٰهَا لِلنَّٰظِرِينَ ٦١\n                                    \n                                    \n                                    يذكر تعالى خلقه السماء في ارتفاعها وما زينها به من الكواكب الثواقب لمن تأملها ، وكرر النظر فيها ، يرى فيها من العجائب والآيات الباهرات ، ما يحار نظره فيه . ولهذا قال مجاهد وقتادة : البروج هاهنا هي : الكواكب .\nقلت : وهذا كقوله تعالى : ( تبارك الذي جعل في السماء بروجا وجعل فيها سراجا وقمرا منيرا ) [ الفرقان : 61 ] ومنهم من قال : البروج هي : منازل الشمس والقمر .\nوقال عطية العوفي : البروج هاهنا : هي قصور الحرس\nوجعل الشهب حرسا لها من مردة الشياطين ، لئلا يسمعوا إلى الملأ الأعلى ، فمن تمرد منهم [ وتقدم ] لاستراق السمع ، جاءه ( شهاب مبين ) فأتلفه ، فربما يكون قد ألقى الكلمة التي سمعها قبل أن يدركه الشهاب إلى الذي هو دونه ، فيأخذها الآخر ، ويأتي بها إلى وليه ، كما جاء مصرحا به في الصحيح ، كما قال البخاري في تفسير هذه الآية :\nحدثنا علي بن عبد الله ، حدثنا سفيان عن عمرو ، عن عكرمة ، عن أبي هريرة ، يبلغ به النبي - صلى الله عليه وسلم - قال : \" إذا قضى الله الأمر في السماء ، ضربت الملائكة بأجنحتها خضعانا لقوله كأنه سلسلة على صفوان \" . قال علي : وقال غيره : صفوان ينفذهم ذلك ، فإذا فزع عن قلوبهم قالوا : ماذا قال ربكم ؟ قالوا : الذي قال : الحق ، وهو العلي الكبير . فيسمعها مسترقو السمع ، ومسترقو السمع هكذا واحد فوق آخر - ووصف سفيان بيده ففرج بين أصابع يده اليمنى ، نصبها بعضها فوق بعض - فربما أدرك الشهاب المستمع قبل أن يرمي بها إلى صاحبه فيحرقه ، وربما لم يدركه [ حتى ] يرمي بها إلى الذي يليه ، [ إلى الذي ] هو أسفل منه ، حتى يلقوها إلى الأرض - وربما قال سفيان : حتى تنتهي إلى الأرض فتلقى على فم الساحر - أو : الكاهن - فيكذب معها مائة كذبة فيقولون : ألم يخبرنا يوم كذا وكذا يكون كذا وكذا ، فوجدناه حقا ؟ للكلمة التي سمعت من السماء \"\n                                    ",
      "qortoby": "وَلَقَدۡ جَعَلۡنَا فِي ٱلسَّمَآءِ بُرُوجٗا وَزَيَّنَّٰهَا لِلنَّٰظِرِينَ ٦١\n                                    \n                                    \n                                    قوله تعالى : ولقد جعلنا في السماء بروجا وزيناها للناظرين لما ذكر كفر الكافرين وعجز أصنامهم ذكر كمال قدرته ليستدل بها على وحدانيته . والبروج : القصور والمنازل . قال ابن عباس : أي جعلنا في السماء بروج الشمس والقمر ; أي منازلهما . وأسماء هذه البروج : الحمل ، والثور ، والجوزاء ، والسرطان ، والأسد ، والسنبلة ، والميزان ، والعقرب ، والقوس ، والجدي ، والدلو ، والحوت . والعرب تعد المعرفة لمواقع النجوم وأبوابها من أجل العلوم ، ويستدلون بها على الطرقات والأوقات والخصب والجدب . وقالوا : الفلك اثنا عشر برجا ، كل برج ميلان ونصف . وأصل البروج الظهور ومنه تبرج المرأة بإظهار زينتها . وقد تقدم هذا المعنى في النساء . وقال الحسن وقتادة : البروج النجوم ، وسميت بذلك لظهورها . وارتفاعها . وقيل : الكواكب العظام ; قاله أبو صالح : يعني السبعة السيارة . وقال قوم : بروجا ; أي قصورا وبيوتا فيها الحرس ، خلقها الله في السماء . فالله أعلم . وزيناها يعني السماء ; كما قال في سورة الملك : ولقد زينا السماء الدنيا بمصابيح . للناظرين للمعتبرين والمتفكرين .\n                                    ",
      "saadi": "وَلَقَدۡ جَعَلۡنَا فِي ٱلسَّمَآءِ بُرُوجٗا وَزَيَّنَّٰهَا لِلنَّٰظِرِينَ ٦١\n                                        \n                                        \n                                        \n                                        يقول تعالى -مبينا كمال اقتداره ورحمته بخلقه-: { ولقد جعلنا في السماء بروجا } أي: نجوما كالأبراج والأعلام العظام يهتدى بها في ظلمات البر والبحر، { وزيناها للناظرين } فإنه لولا النجوم لما كان للسماء هذا المنظر البهي والهيئة العجيبة، وهذا مما يدعو الناظرين إلى التأمل فيها والنظر في معانيها والاستدلال بها على باريها.\n                                    "
    }
  },
  {
    "id": 16,
    "versesNumber": 17,
    "souraName": "Al-Hijr.html",
    "contnent": "وَحَفِظۡنَٰهَا مِن كُلِّ شَيۡطَٰنٖ رَّجِيمٍ ٧١",
    "tafsier": {
      "ibnkther": "وَحَفِظۡنَٰهَا مِن كُلِّ شَيۡطَٰنٖ رَّجِيمٍ ٧١\n                                    \n                                    \n                                    قال عطية العوفي : البروج هاهنا : هي قصور الحرس\nوجعل الشهب حرسا لها من مردة الشياطين ، لئلا يسمعوا إلى الملأ الأعلى ، فمن تمرد منهم [ وتقدم ] لاستراق السمع ، جاءه ( شهاب مبين ) فأتلفه ، فربما يكون قد ألقى الكلمة التي سمعها قبل أن يدركه الشهاب إلى الذي هو دونه ، فيأخذها الآخر ، ويأتي بها إلى وليه ، كما جاء مصرحا به في الصحيح ، كما قال البخاري في تفسير هذه الآية :\nحدثنا علي بن عبد الله ، حدثنا سفيان عن عمرو ، عن عكرمة ، عن أبي هريرة ، يبلغ به النبي - صلى الله عليه وسلم - قال : \" إذا قضى الله الأمر في السماء ، ضربت الملائكة بأجنحتها خضعانا لقوله كأنه سلسلة على صفوان \" . قال علي : وقال غيره : صفوان ينفذهم ذلك ، فإذا فزع عن قلوبهم قالوا : ماذا قال ربكم ؟ قالوا : الذي قال : الحق ، وهو العلي الكبير . فيسمعها مسترقو السمع ، ومسترقو السمع هكذا واحد فوق آخر - ووصف سفيان بيده ففرج بين أصابع يده اليمنى ، نصبها بعضها فوق بعض - فربما أدرك الشهاب المستمع قبل أن يرمي بها إلى صاحبه فيحرقه ، وربما لم يدركه [ حتى ] يرمي بها إلى الذي يليه ، [ إلى الذي ] هو أسفل منه ، حتى يلقوها إلى الأرض - وربما قال سفيان : حتى تنتهي إلى الأرض فتلقى على فم الساحر - أو : الكاهن - فيكذب معها مائة كذبة فيقولون : ألم يخبرنا يوم كذا وكذا يكون كذا وكذا ، فوجدناه حقا ؟ للكلمة التي سمعت من السماء \"\n                                    ",
      "qortoby": "وَحَفِظۡنَٰهَا مِن كُلِّ شَيۡطَٰنٖ رَّجِيمٍ ٧١\n                                    \n                                    \n                                    قوله تعالى : وحفظناها من كل شيطان رجيم أي مرجوم . والرجم الرمي بالحجارة . وقيل : الرجم اللعن والطرد . وقد تقدم . وقال الكسائي : كل رجيم في القرآن فهو بمعنى الشتم . وزعم الكلبي أن السماوات كلها لم تحفظ من الشياطين إلى زمن عيسى ، فلما بعث الله - تعالى - عيسى حفظ منها ثلاث سماوات إلى مبعث رسول الله - صلى الله عليه وسلم - ، فحفظ جميعها بعد بعثه وحرست منهم بالشهب . وقاله ابن عباس - رضي الله عنه - . قال ابن عباس : ( وقد كانت الشياطين لا يحجبون عن السماء ، فكانوا يدخلونها ويلقون أخبارها على الكهنة ، فيزيدون عليها تسعا فيحدثون بها أهل الأرض ; الكلمة حق والتسع باطل ; فإذا رأوا شيئا مما قالوه صدقوهم فيما جاءوا به ، فلما ولد عيسى ابن مريم - عليهما السلام - منعوا من ثلاث سماوات ، فلما ولد محمد - صلى الله عليه وسلم - منعوا من السماوات كلها ، فما منهم من أحد يريد استراق السمع إلا رمي بشهاب ; على ما يأتي .\n                                    ",
      "saadi": "وَحَفِظۡنَٰهَا مِن كُلِّ شَيۡطَٰنٖ رَّجِيمٍ ٧١\n                                        \n                                        \n                                        \n                                        { وحفظناها من كل شيطان رجيم } إذا استرق السمع أتبعته الشهب الثواقب فبقيت السماء ظاهرها مجملا بالنجوم النيرات وباطنها محروسا ممنوعا من الآفات.\n                                    "
    }
  },
  {
    "id": 17,
    "versesNumber": 18,
    "souraName": "Al-Hijr.html",
    "contnent": "إِلَّا مَنِ ٱسۡتَرَقَ ٱلسَّمۡعَ فَأَتۡبَعَهُۥ شِهَابٞ مُّبِينٞ ٨١",
    "tafsier": {
      "ibnkther": "إِلَّا مَنِ ٱسۡتَرَقَ ٱلسَّمۡعَ فَأَتۡبَعَهُۥ شِهَابٞ مُّبِينٞ ٨١\n                                    \n                                    \n                                    وجعل الشهب حرسا لها من مردة الشياطين ، لئلا يسمعوا إلى الملأ الأعلى ، فمن تمرد منهم [ وتقدم ] لاستراق السمع ، جاءه ( شهاب مبين ) فأتلفه ، فربما يكون قد ألقى الكلمة التي سمعها قبل أن يدركه الشهاب إلى الذي هو دونه ، فيأخذها الآخر ، ويأتي بها إلى وليه ، كما جاء مصرحا به في الصحيح ، كما قال البخاري في تفسير هذه الآية :\nحدثنا علي بن عبد الله ، حدثنا سفيان عن عمرو ، عن عكرمة ، عن أبي هريرة ، يبلغ به النبي - صلى الله عليه وسلم - قال : \" إذا قضى الله الأمر في السماء ، ضربت الملائكة بأجنحتها خضعانا لقوله كأنه سلسلة على صفوان \" . قال علي : وقال غيره : صفوان ينفذهم ذلك ، فإذا فزع عن قلوبهم قالوا : ماذا قال ربكم ؟ قالوا : الذي قال : الحق ، وهو العلي الكبير . فيسمعها مسترقو السمع ، ومسترقو السمع هكذا واحد فوق آخر - ووصف سفيان بيده ففرج بين أصابع يده اليمنى ، نصبها بعضها فوق بعض - فربما أدرك الشهاب المستمع قبل أن يرمي بها إلى صاحبه فيحرقه ، وربما لم يدركه [ حتى ] يرمي بها إلى الذي يليه ، [ إلى الذي ] هو أسفل منه ، حتى يلقوها إلى الأرض - وربما قال سفيان : حتى تنتهي إلى الأرض فتلقى على فم الساحر - أو : الكاهن - فيكذب معها مائة كذبة فيقولون : ألم يخبرنا يوم كذا وكذا يكون كذا وكذا ، فوجدناه حقا ؟ للكلمة التي سمعت من السماء \"\n\n                                    ",
      "qortoby": "إِلَّا مَنِ ٱسۡتَرَقَ ٱلسَّمۡعَ فَأَتۡبَعَهُۥ شِهَابٞ مُّبِينٞ ٨١\n                                    \n                                    \n                                    قوله تعالى : إلا من استرق السمع فأتبعه شهاب مبين أي لكن من استرق السمع ، أي الخطفة اليسيرة ، فهو استثناء منقطع . وقيل ، هو متصل ، أي إلا ممن استرق السماع . أي حفظنا السماء من الشياطين أن تسمع شيئا من الوحي وغيره ; إلا من استرق السمع فإنا لم نحفظها منه أن تسمع الخبر من أخبار السماء سوى الوحي ، فأما الوحي فلا تسمع منه شيئا ; لقوله : إنهم عن السمع لمعزولون . وإذا استمع الشياطين إلى شيء ليس بوحي فإنهم يقذفونه إلى الكهنة في أسرع من طرفة عين ، ثم تتبعهم الشهب فتقتلهم أو تخبلهم ; ذكره الحسن وابن عباس .\nقوله - تعالى - : فأتبعه شهاب مبين أتبعه : أدركه ولحقه . شهاب : كوكب مضيء . وكذلك شهاب ثاقب . وقوله : بشهاب قبس بشعلة نار في رأس عود ; قاله ابن عزيز . وقال ذو الرمة :\nكأنه كوكب في إثر عفرية مسوم في سواد الليل منقضب\nوسمي الكوكب شهابا لبريقه ، يشبه النار . وقيل : شهاب لشعلة من نار ، قبس لأهل الأرض ، فتحرقهم ولا تعود إذا أحرقت كما إذا أحرقت النار لم تعد ، بخلاف الكوكب فإنه إذا أحرق عاد إلى مكانه . قال ابن عباس : تصعد الشياطين أفواجا تسترق السمع فينفرد المارد منها فيعلو ، فيرمى بالشهاب فيصيب جبهته أو أنفه أو ما شاء الله فيلتهب ، فيأتي أصحابه وهو يلتهب فيقول : إنه كان من الأمر كذا وكذا ، فيذهب أولئك إلى إخوانهم من الكهنة فيزيدون عليها تسعا ، فيحدثون بها أهل الأرض ; الكلمة حق والتسع باطل . فإذا رأوا شيئا مما قالوا قد كان صدقوهم بكل ما جاءوا به من كذبهم . وسيأتي هذا المعنى مرفوعا في سورة \" سبأ \" إن شاء الله - تعالى - .\nواختلف في الشهاب هل يقتل أم لا . فقال ابن عباس : الشهاب يجرح ويحرق ويخبل ولا يقتل . وقال الحسن وطائفة : يقتل ; فعلى هذا القول في قتلهم بالشهب قبل إلقاء السمع إلى الجن قولان :\nأحدهما : أنهم يقتلون قبل إلقائهم ما استرقوه من السمع إلى غيرهم ; فعلى هذا لا تصل أخبار السماء إلى غير الأنبياء ، ولذلك انقطعت الكهانة .\nوالثاني : أنهم يقتلون بعد إلقائهم ما استرقوه من السمع إلى غيرهم من الجن ; ولذلك ما يعودون إلى استراقه ، ولو لم يصل لانقطع الاستراق وانقطع الإحراق ; ذكره الماوردي\nقلت : والقول الأول أصح على ما يأتي بيانه في \" الصافات \" . واختلف هل كان رمي بالشهب قبل المبعث ; فقال الأكثرون نعم . وقيل لا ، وإنما ذلك بعد المبعث . وسيأتي بيان هذه المسألة في سورة \" الجن \" إن شاء الله - تعالى - . وفي \" الصافات \" أيضا . قال الزجاج : والرمي بالشهب من آيات النبي - صلى الله عليه وسلم - مما حدث بعد مولده ; لأن الشعراء في القديم لم يذكروه في أشعارهم ، ولم يشبهوا الشيء السريع به كما شبهوا بالبرق وبالسيل . ولا يبعد أن يقال : انقضاض الكواكب كان في قديم الزمان ولكنه لم يكن رجوما للشياطين ، ثم صار رجوما حين ولد النبي - صلى الله عليه وسلم - .\nوقال العلماء : نحن نرى انقضاض الكواكب ، فيجوز أن يكون ذلك كما نرى ثم يصير نارا إذا أدرك الشيطان . ويجوز أن يقال : يرمون بشعلة من نار من الهوى فيخيل إلينا أنه نجم سرى .\nوالشهاب في اللغة النار الساطعة .\nوذكر أبو داود عن عامر الشعبي قال : لما بعث النبي - صلى الله عليه وسلم - رجمت الشياطين بنجوم لم تكن ترجم بها قبل ، فأتوا عبد ياليل بن عمرو الثقفي فقالوا : إن الناس قد فزعوا وقد أعتقوا رقيقهم وسيبوا أنعامهم لما رأوا في النجوم . فقال لهم - وكان رجلا أعمى - : لا تعجلوا ، وانظروا فإن كانت النجوم التي تعرف فهي عند فناء الناس ، وإن كانت لا تعرف فهي من حدث . فنظروا فإذا هي نجوم لا تعرف ، فقالوا : هذا من حدث . فلم يلبثوا حتى سمعوا بالنبي - صلى الله عليه وسلم - .\n                                    ",
      "saadi": "إِلَّا مَنِ ٱسۡتَرَقَ ٱلسَّمۡعَ فَأَتۡبَعَهُۥ شِهَابٞ مُّبِينٞ ٨١\n                                        \n                                        \n                                        \n                                        { إلا من استرق السمع } أي: في بعض الأوقات قد يسترق بعض الشياطين السمع بخفية واختلاس، { فأتبعه شهاب مبين } أي: بين منير يقتله أو يخبله. فربما أدركه الشهاب قبل أن يوصلها الشيطان إلى وليه فينقطع خبر السماء عن الأرض، وربما ألقاها إلى وليه قبل أن يدركه الشهاب فيضمُّها ويكذب معها مائة كذبة، ويستدل بتلك الكلمة التي سمعت من السماء.\n                                    "
    }
  },
  {
    "id": 18,
    "versesNumber": 19,
    "souraName": "Al-Hijr.html",
    "contnent": "وَٱلۡأَرۡضَ مَدَدۡنَٰهَا وَأَلۡقَيۡنَا فِيهَا رَوَٰسِيَ وَأَنۢبَتۡنَا فِيهَا مِن كُلِّ شَيۡءٖ مَّوۡزُونٖ ٩١",
    "tafsier": {
      "ibnkther": "وَٱلۡأَرۡضَ مَدَدۡنَٰهَا وَأَلۡقَيۡنَا فِيهَا رَوَٰسِيَ وَأَنۢبَتۡنَا فِيهَا مِن كُلِّ شَيۡءٖ مَّوۡزُونٖ ٩١\n                                    \n                                    \n                                    ثم ذكر تعالى خلقه الأرض ومده إياها وتوسيعها وبسطها وما جعل فيها من الجبال الرواسي والأودية والأراضي والرمال وما أنبت فيها من الزروع والثمار المتناسبة وقال ابن عباس \" من كل شيء موزون \" أي معلوم وكذا قال سعيد بن جبير وعكرمة وأبو مالك ومجاهد والحكم بن عيينة والحسن بن محمد وأبو صالح وقتادة ومنهم من قول مقدر بقدر وقال ابن زيد من كل شيء يوزن ويقدر بقدر وقال ابن زيد ما يزنه أهل الأسواق.\n                                    ",
      "qortoby": "وَٱلۡأَرۡضَ مَدَدۡنَٰهَا وَأَلۡقَيۡنَا فِيهَا رَوَٰسِيَ وَأَنۢبَتۡنَا فِيهَا مِن كُلِّ شَيۡءٖ مَّوۡزُونٖ ٩١\n                                    \n                                    \n                                    قوله تعالى : والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل شيء موزون\nقوله تعالى : والأرض مددناها هذا من نعمه أيضا ، ومما يدل على كمال قدرته .\nقال ابن عباس : بسطناها على وجه الماء ; كما قال : والأرض بعد ذلك دحاها أي بسطها . وقال : والأرض فرشناها فنعم الماهدون . وهو يرد على من زعم أنها كالكرة . وقد تقدم .\nوألقينا فيها رواسي جبالا ثابتة لئلا تتحرك بأهلها .\nوأنبتنا فيها من كل شيء موزون أي مقدر معلوم ; قاله ابن عباس وسعيد بن جبير . وإنما قال موزون لأن الوزن يعرف به مقدار الشيء . قال الشاعر :\nقد كنت قبل لقائكم ذا مرة عندي لكل مخاصم ميزانه\nوقال قتادة : موزون يعني مقسوم . وقال مجاهد : موزون معدود ; ويقال : هذا كلام موزون ; أي منظوم غير منتثر . فعلى هذا أي أنبتنا في الأرض ما يوزن من الجواهر والحيوانات والمعادن . وقد قال الله - عز وجل - في الحيوان : وأنبتها نباتا حسنا . والمقصود من الإنبات الإنشاء والإيجاد . وقيل : أنبتنا فيها أي في الجبال من كل شيء موزون من الذهب والفضة والنحاس والرصاص والقصدير ، حتى الزرنيخ والكحل ، كل ذلك يوزن وزنا . روي معناه عن الحسن وابن زيد . وقيل : أنبتنا في الأرض الثمار مما يكال ويوزن . وقيل : ما يوزن فيه الأثمان لأنه أجل قدرا وأعم نفعا مما لا ثمن له .\n                                    ",
      "saadi": "وَٱلۡأَرۡضَ مَدَدۡنَٰهَا وَأَلۡقَيۡنَا فِيهَا رَوَٰسِيَ وَأَنۢبَتۡنَا فِيهَا مِن كُلِّ شَيۡءٖ مَّوۡزُونٖ ٩١\n                                        \n                                        \n                                        \n                                        { والأرض مددناها } أي: وسعناها سعة يتمكن الآدميون والحيوانات كلها على الامتداد بأرجائها والتناول من أرزاقها والسكون في نواحيها.\n{ وألقينا فيها رواسي } أي: جبالا عظاما تحفظ الأرض بإذن الله أن تميد وتثبتها أن تزول { وأنبتنا فيها من كل شيء موزون } أي: نافع متقوم يضطر إليه العباد والبلاد ما بين نخيل وأعناب وأصناف الأشجار وأنواع النبات.\n                                    "
    }
  },
  {
    "id": 19,
    "versesNumber": 20,
    "souraName": "Al-Hijr.html",
    "contnent": "وَجَعَلۡنَا لَكُمۡ فِيهَا مَعَٰيِشَ وَمَن لَّسۡتُمۡ لَهُۥ بِرَٰزِقِينَ ٠٢",
    "tafsier": {
      "ibnkther": "وَجَعَلۡنَا لَكُمۡ فِيهَا مَعَٰيِشَ وَمَن لَّسۡتُمۡ لَهُۥ بِرَٰزِقِينَ ٠٢\n                                    \n                                    \n                                    وقوله \" وجعلنا لكم فيها معايش \" يذكر تعالى أنه صرفهم في الأرض فى صنوف الأسباب والمعايش وهي جمع معيشة وقوله \" ومن لستم له برازقين \" قال مجاهد هي الدواب والأنعام وقال ابن جرير هم العبيد والإماء والدواب والأنعام والقصد أنه تعالى يمتن عليهم بما يسر لهم من أسباب المكاسب ووجوه الأسباب وصنوف المعايش وبما سخر لهم من الدواب التي يركبونها والأنعام التي يأكلونها والعبيد والإماء التي يستخدمونها ورزقهم على خالقهم لا عليهم فلهم هم المنفعة والرزق على الله تعالى.\n                                    ",
      "qortoby": "وَجَعَلۡنَا لَكُمۡ فِيهَا مَعَٰيِشَ وَمَن لَّسۡتُمۡ لَهُۥ بِرَٰزِقِينَ ٠٢\n                                    \n                                    \n                                    وجعلنا لكم فيها معايش يعني المطاعم والمشارب التي يعيشون بها ; واحدها معيشة ( بسكون الياء ) . ومنه قول جرير :\nتكلفني معيشة آل زيد ومن لي بالمرقق والصناب\nوالأصل معيشة على مفعلة ( بتحريك الياء ) . وقد تقدم في الأعراف . وقيل : إنها الملابس ; قاله الحسن . وقيل : إنها التصرف في أسباب الرزق مدة الحياة . قال الماوردي : وهو الظاهر .\nومن لستم له برازقين يريد الدواب والأنعام ; قاله مجاهد . وعنده أيضا هم العبيد والأولاد الذين قال الله فيهم : نحن نرزقهم وإياكم ولفظ من يجوز أن يتناول العبيد والدواب إذا اجتمعوا ; لأنه إذا اجتمع من يعقل وما لا يعقل ، غلب من يعقل . أي جعلنا لكم فيها معايش وعبيدا وإماء ودواب وأولادا نرزقهم ولا ترزقونهم . ف \" من \" على هذا التأويل في موضع نصب ; قال معناه مجاهد وغيره . وقيل : أراد به الوحش . قال سعيد : قرأ علينا منصور ومن لستم له برازقين قال : الوحش . ف من على هذا تكون لما لا يعقل ; مثل فمنهم من يمشي على بطنه الآية . وهي في محل خفض عطفا على الكاف والميم في قوله : \" لكم \" . وفيه قبح عند البصريين ; فإنه لا يجوز عندهم عطف الظاهر على المضمر إلا بإعادة حرف الجر ; مثل مررت به وبزيد . ولا يجوز مررت به وزيد إلا في الشعر . كما قال :\nفاليوم قربت تهجونا وتشتمنا فاذهب فما بك والأيام من عجب\nوقد مضى هذا المعنى في \" البقرة \" وسورة \" النساء \" .\n                                    ",
      "saadi": "وَجَعَلۡنَا لَكُمۡ فِيهَا مَعَٰيِشَ وَمَن لَّسۡتُمۡ لَهُۥ بِرَٰزِقِينَ ٠٢\n                                        \n                                        \n                                        \n                                        { وجعلنا لكم فيها معايش } من الحرث ومن الماشية ومن أنواع المكاسب والحرف. { ومن لستم له برازقين } أي: أنعمنا عليكم بعبيد وإماء وأنعام لنفعكم ومصالحكم وليس عليكم رزقها، بل خولكم الله إياها وتكفل بأرزاقها.\n                                    "
    }
  },
  {
    "id": 20,
    "versesNumber": 21,
    "souraName": "Al-Hijr.html",
    "contnent": "وَإِن مِّن شَيۡءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٖ مَّعۡلُومٖ ١٢",
    "tafsier": {
      "ibnkther": "وَإِن مِّن شَيۡءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٖ مَّعۡلُومٖ ١٢\n                                    \n                                    \n                                    يخبر - تعالى - أنه مالك كل شيء ، وأن كل شيء سهل عليه ، يسير لديه ، وأن عنده خزائن الأشياء من جميع الصنوف ، ( وما ننزله إلا بقدر معلوم ) كما يشاء وكما يريد ، ولما له في ذلك من الحكمة البالغة ، والرحمة بعباده ، لا على [ وجه ] الوجوب ، بل هو كتب على نفسه الرحمة .\nقال يزيد بن أبي زياد ، عن أبي جحيفة ، عن عبد الله : ما من عام بأمطر من عام ، ولكن الله يقسمه حيث شاء عاما هاهنا ، وعاما هاهنا . ثم قرأ : ( وإن من شيء إلا عندنا خزائنه وما ننزله إلا بقدر معلوم ) رواه ابن جرير\nوقال أيضا : حدثنا القاسم ، حدثنا الحسن حدثنا هشيم ، أخبرنا إسماعيل بن سالم ، عن الحكم بن عتيبة في قوله : ( وما ننزله إلا بقدر معلوم ) قال : ما عام بأكثر مطرا من عام ولا أقل ، ولكنه يمطر قوم ويحرم آخرون وربما كان في البحر . قال : وبلغنا أنه ينزل مع المطر من الملائكة أكثر من عدد ولد إبليس وولد آدم ، يحصون كل قطرة حيث تقع وما تنبت\nوقال البزار : حدثنا داود - وهو ابن بكر التستري - حدثنا حبان بن أغلب بن تميم ، حدثني أبي ، عن هشام ، عن محمد بن سيرين ، عن أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" خزائن الله الكلام ، فإذا أراد شيئا قال له : كن ، فكان \"\nثم قال : لا يرويه إلا أغلب ، ولم يكن بالقوي ، وقد حدث عنه غير واحد من المتقدمين ، ولم يروه عنه إلا ابنه .\n                                    ",
      "qortoby": "وَإِن مِّن شَيۡءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٖ مَّعۡلُومٖ ١٢\n                                    \n                                    \n                                    قوله تعالى : وإن من شيء إلا عندنا خزائنه وما ننزله إلا بقدر معلوم قوله - تعالى - : وإن من شيء إلا عندنا خزائنه أي وإن من شيء من أرزاق الخلق ومنافعهم إلا عندنا خزائنه ; يعني المطر المنزل من السماء ، لأن به نبات كل شيء . قال الحسن : المطر خزائن كل شيء . وقيل : الخزائن المفاتيح ، أي في السماء مفاتيح الأرزاق ; قاله الكلبي . والمعنى واحد . وما ننزله إلا بقدر معلوم أي ولكن لا ننزله إلا على حسب مشيئتنا وعلى حسب حاجة الخلق إليه ; كما قال : ولو بسط الله الرزق لعباده لبغوا في الأرض ولكن ينزل بقدر ما يشاء . وروي عن ابن مسعود والحكم بن عيينة وغيرهما أنه ليس عام أكثر مطرا من عام ، ولكن الله يقسمه كيف شاء ، فيمطر قوم ويحرم آخرون ، وربما كان المطر . في البحار والقفار . والخزائن جمع الخزانة ، وهو الموضع الذي يستر فيه الإنسان ماله والخزانة أيضا مصدر خزن يخزن . وما كان في خزانة الإنسان كان معدا له . فكذلك ما يقدر عليه الرب فكأنه معد عنده ; قاله القشيري . وروى جعفر بن محمد عن أبيه عن جده أنه قال : في العرش مثال كل شيء خلقه الله في البر والبحر . وهو تأويل قوله - تعالى - : وإن من شيء إلا عندنا خزائنه . والإنزال بمعنى الإنشاء والإيجاد ; كقوله : وأنزل لكم من الأنعام ثمانية أزواج وقوله : وأنزلنا الحديد فيه بأس شديد . وقيل : الإنزال بمعنى الإعطاء ، وسماه إنزالا لأن أحكام الله إنما تنزل من السماء .\n                                    ",
      "saadi": "وَإِن مِّن شَيۡءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٖ مَّعۡلُومٖ ١٢\n                                        \n                                        \n                                        \n                                        أي: جميع الأرزاق وأصناف الأقدار لا يملكها أحد إلا الله، فخزائنها بيده يعطي من يشاء، ويمنع من يشاء، بحسب حكمته ورحمته الواسعة، { وَمَا نُنَزِّلُهُ } أي: المقدر من كل شيء من مطر وغيره، { إِلَّا بِقَدَرٍ مَعْلُومٍ } فلا يزيد على ما قدره الله ولا ينقص منه.\n                                    "
    }
  },
  {
    "id": 21,
    "versesNumber": 22,
    "souraName": "Al-Hijr.html",
    "contnent": "وَأَرۡسَلۡنَا ٱلرِّيَٰحَ لَوَٰقِحَ فَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَسۡقَيۡنَٰكُمُوهُ وَمَآ أَنتُمۡ لَهُۥ بِخَٰزِنِينَ ٢٢",
    "tafsier": {
      "ibnkther": "وَأَرۡسَلۡنَا ٱلرِّيَٰحَ لَوَٰقِحَ فَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَسۡقَيۡنَٰكُمُوهُ وَمَآ أَنتُمۡ لَهُۥ بِخَٰزِنِينَ ٢٢\n                                    \n                                    \n                                    وقوله : ( وأرسلنا الرياح لواقح ) أي : تلقح السحاب فتدر ماء ، وتلقح الشجر فتتفتح عن أوراقها وأكمامها .\nهذه \" الرياح \" ذكرها بصيغة الجمع ؛ ليكون منها الإنتاج ، بخلاف الريح العقيم فإنه أفردها ، ووصفها بالعقيم ، وهو عدم الإنتاج ; لأنه لا يكون إلا من شيئين فصاعدا .\nوقال الأعمش ، عن المنهال بن عمرو ، عن قيس بن السكن ، عن عبد الله بن مسعود في قوله : ( وأرسلنا الرياح لواقح ) قال : ترسل الرياح ، فتحمل الماء من السماء ، ثم تمرى السحاب ، حتى تدر كما تدر اللقحة .\nوكذا قال ابن عباس ، وإبراهيم النخعي ، وقتادة .\nوقال الضحاك : يبعثها الله على السحاب ، فتلقحه ، فيمتلئ ماء .\nوقال عبيد بن عمير الليثي : يبعث الله المبشرة فتقم الأرض قما ثم يبعث الله المثيرة فتثير السحاب ، ثم يبعث الله المؤلفة فتؤلف السحاب ، ثم يبعث الله اللواقح فتلقح الشجر ، ثم تلا ( وأرسلنا الرياح لواقح )\nوقد روى ابن جرير من حديث عبيس بن ميمون ، عن أبي المهزم ، عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - قال : \" الريح الجنوب من الجنة ، وهي [ الريح اللواقح ، وهي التي ] ذكر الله في كتابه ، وفيها منافع للناس \" وهذا إسناد ضعيف .\nوقال الإمام أبو بكر عبد الله بن الزبير الحميدي في مسنده : حدثنا سفيان ، حدثنا عمرو بن دينار ، أخبرني يزيد بن جعدبة الليثي : أنه سمع عبد الله بن مخراق ، يحدث عن أبي ذر قال : قال رسول الله - صلى الله عليه وسلم - : \" إن الله خلق في الجنة ريحا بعد الريح بسبع سنين ، وإن من دونها بابا مغلقا ، وإنما يأتيكم الريح من ذلك الباب ، ولو فتح لأذرت ما بين السماء والأرض من شيء ، وهي عند الله الأزيب ، وهي فيكم الجنوب \"\nوقوله : ( فأسقيناكموه ) أي : أنزلناه لكم عذبا يمكنكم أن تشربوا منه ، ولو نشاء لجعلناه أجاجا . كما ينبه الله على ذلك في الآية الأخرى في سورة \" الواقعة \" وهو قوله : ( أفرأيتم الماء الذي تشربون أأنتم أنزلتموه من المزن أم نحن المنزلون لو نشاء جعلناه أجاجا فلولا تشكرون ) [ الواقعة : 68 - 70 ] وفي قوله : ( هو الذي أنزل من السماء ماء لكم منه شراب ومنه شجر فيه تسيمون ) [ النمل : 10 ]\nوقوله : ( وما أنتم له بخازنين ) قال سفيان الثوري : بمانعين .\nويحتمل أن المراد : وما أنتم له بحافظين ، بل نحن ننزله ونحفظه عليكم ، ونجعله معينا وينابيع في الأرض ، ولو شاء تعالى لأغاره وذهب به ، ولكن من رحمته أنزله وجعله عذبا ، وحفظه في العيون والآبار والأنهار وغير ذلك ؛ ليبقى لهم في طول السنة ، يشربون ويسقون أنعامهم وزروعهم وثمارهم .\n                                    ",
      "qortoby": "وَأَرۡسَلۡنَا ٱلرِّيَٰحَ لَوَٰقِحَ فَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَسۡقَيۡنَٰكُمُوهُ وَمَآ أَنتُمۡ لَهُۥ بِخَٰزِنِينَ ٢٢\n                                    \n                                    \n                                    قوله تعالى : وأرسلنا الرياح لواقح فأنزلنا من السماء ماء فأسقيناكموه وما أنتم له بخازنين فيه خمس مسائل :\nالأولى : قوله - تعالى - : وأرسلنا الرياح قراءة العامة الرياح بالجمع . وقرأ حمزة بالتوحيد ; لأن معنى الريح الجمع أيضا وإن كان لفظها لفظ الواحد . كما يقال : جاءت الريح من كل جانب . كما يقال : أرض سباسب وثوب أخلاق . وكذلك تفعل العرب في كل شيء اتسع . وأما وجه قراءة العامة فلأن الله - تعالى - نعتها ب لواقح وهي جمع . ومعنى لواقح حوامل ; لأنها تحمل الماء والتراب والسحاب والخير والنفع . قال الأزهري : وجعل الريح لاقحا لأنها تحمل السحاب ; أي تقله وتصرفه ثم تمريه فتستدره ، أي تنزله ; قال الله - تعالى - : حتى إذا أقلت سحابا ثقالا أي حملت . وناقة لاقح ونوق لواقح إذا حملت الأجنة في بطونها . وقيل : لواقح بمعنى ملقحة وهو الأصل ، ولكنها لا تلقح إلا وهي في نفسها لاقح ، كأن الرياح لقحت بخير . وقيل : ذوات لقح ، وكل ذلك صحيح ; أي منها ما يلقح الشجر ; كقولهم : عيشة راضية ; أي فيها رضا ، وليل نائم ; أي فيه نوم . ومنها ما تأتي بالسحاب . يقال : لقحت الناقة ( بالكسر ) لقحا ولقاحا ( بالفتح ) فهي لاقح . وألقحها الفحل أي ألقى إليها الماء فحملته ; فالرياح كالفحل للسحاب . قال الجوهري : ورياح لواقح ولا يقال ملاقح ، وهو من النوادر . وحكى المهدوي عن أبي عبيدة : لواقح بمعنى ملاقح ، ذهب إلى أنه جمع ملقحة وملقح ، ثم حذفت زوائده . وقيل : هو جمع لاقحة ولاقح ، على معنى ذات اللقاح على النسب . ويجوز أن يكون معنى لاقح حاملا . والعرب تقول للجنوب : لاقح وحامل ، وللشمال حائل وعقيم . وقال عبيد بن عمير : يرسل الله المبشرة فتقم الأرض قما ، ثم يرسل المثيرة فتثير السحاب ، ثم يرسل المؤلفة فتؤلفه ، ثم يبعث اللواقح فتلقح الشجر . وقيل : الريح الملاقح التي تحمل الندى فتمجه في السحاب ، فإذا اجتمع فيه صار مطرا . وعن أبي هريرة قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : الريح الجنوب من الجنة وهي الريح اللواقح التي ذكرها الله في كتابه وفيها منافع للناس . وروي عنه - عليه السلام - أنه قال : ما هبت جنوب إلا أنبع الله بها عينا غدقة . وقال أبو بكر بن عياش : لا تقطر قطرة من السحاب إلا بعد أن تعمل الرياح الأربع فيها ; فالصبا تهيجه ، والدبور تلقحه ، والجنوب تدره ، والشمال تفرقه .\nالثانية : روى ابن وهب وابن القاسم وأشهب وابن عبد الحكم عن مالك - واللفظ لأشهب - قال مالك : قال الله - تعالى - : وأرسلنا الرياح لواقح فلقاح القمح عندي أن يحبب ويسنبل ، ولا أدري ما ييبس في أكمامه ، ولكن يحبب حتى يكون لو يبس حينئذ لم يكن فساد الأخير فيه . ولقاح الشجر كلها أن تثمر ثم يسقط منها ما يسقط ويثبت ما يثبت ، وليس ذلك بأن تورد . قال ابن العربي : إنما عول مالك في هذا التفسير على تشبيه لقاح الشجر بلقاح الحمل ، وأن الولد إذا عقد وخلق ونفخ فيه الروح كان بمنزلة تحبب الثمر وتسنبله ; لأنه سمي باسم تشترك فيه كل حاملة وهو اللقاح ، وعليه جاء الحديث نهى النبي - صلى الله عليه وسلم - عن بيع الحب حتى يشتد . قال ابن عبد البر : الإبار عند أهل العلم في النخل التلقيح ، وهو أن يؤخذ شيء من طلع [ ذكور ] النخل فيدخل بين ظهراني طلع الإناث . ومعنى ذلك في سائر الثمار طلوع الثمرة من التين وغيره حتى تكون الثمرة مرئية منظورا إليها . والمعتبر عند مالك وأصحابه فيما يذكر من الثمار التذكير ، وفيما لا يذكر أن يثبت ما يثبت ويسقط ما يسقط . وحد ذلك في الزرع ظهوره من الأرض ; قاله مالك . وقد روي عنه أن إباره أن يحبب . ولم يختلف العلماء أن الحائط إذا انشق طلع إناثه فأخر إباره وقد أبر غيره ممن حاله مثل حاله ، أن حكمه حكم ما أبر ; لأنه قد جاء عليه وقت الإبار وثمرته ظاهرة بعد تغيبها في الحب . فإن أبر بعض الحائط كان ما لم يؤبر تبعا له . كما أن الحائط إذا بدا صلاحه كان سائر الحائط تبعا لذلك الصلاح في جواز بيعه .\nالثالثة : روى الأئمة كلهم عن ابن عمر قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : من ابتاع نخلا بعد أن تؤبر فثمرتها للذي باعها إلا أن يشترط المبتاع . ومن ابتاع عبدا فماله للذي باعه إلا أن يشترطه المبتاع . قال علماؤنا : إنما لم يدخل الثمر المؤبر مع الأصول في البيع إلا بالشرط ; لأنه عين موجودة يحاط بها أمن سقوطها غالبا . بخلاف التي لم تؤبر ; إذ ليس سقوطها مأمونا فلم يتحقق لها وجود ، فلم يجز للبائع اشتراطها ولا استثناؤها ; لأنها كالجنين . وهذا هو المشهور من مذهب مالك . وقيل : يجوز استثناؤها ; هو قول الشافعي .\nالرابعة : لو اشتري النخل وبقي الثمر للبائع جاز لمشتري الأصل شراء الثمرة قبل طيبها على مشهور قول مالك ، ويرى لها حكم التبعية وإن أفردت بالعقد . وعنه في رواية : لا يجوز . وبذلك قال الشافعي وأبو حنيفة والثوري وأهل الظاهر وفقهاء الحديث . وهو الأظهر من أحاديث النهي عن بيع الثمرة قبل بدو صلاحها .\nالخامسة : ومما يتعلق بهذا الباب النهي عن بيع الملاقح ; والملاقح الفحول من الإبل ، الواحد ملقح . والملاقح أيضا الإناث التي في بطونها أولادها ، الواحدة ملقحة ( بفتح القاف ) . والملاقيح ما في بطون النوق من الأجنة ، الواحدة ملقوحة ; من قولهم : لقحت ; كالمحموم من حم ، والمجنون من جن . وفي هذا جاء النهي .\nوقد روي عن النبي - صلى الله عليه وسلم - : أنه نهى عن المجر وهو بيع ما في بطون الإناث . ونهى عن المضامين والملاقيح . قال أبو عبيد : المضامين ما في البطون ، وهي الأجنة . والملاقيح ما في أصلاب الفحول . وهو قول سعيد بن المسيب وغيره . وقيل بالعكس : إن المضامين ما في ظهور الجمال ، والملاقيح ما في بطون الإناث . وهو قول ابن حبيب وغيره . وأي الأمرين كان ، فعلماء المسلمين مجمعون على أن ذلك لا يجوز . وذكر المزني عن ابن هشام شاهدا بأن الملاقيح ما في البطون لبعض الأعراب :\nمنيتي ملاقحا في الأبطن تنتج ما تلقح بعد أزمن\nوذكر الجوهري على ذلك شاهدا قول الراجز :\nإنا وجدنا طرد الهوامل خيرا من التأنان والمسائل\nوعدة العام وعام قابل ملقوحة في بطن ناب حامل\nقوله - تعالى - : وأنزلنا من السماء أي من السحاب . وكل ما علاك فأظلك يسمى سماء . وقيل : من جهة السماء . ماء أي قطرا . فأسقيناكموه أي جعلنا ذلك المطر لسقياكم ولشرب مواشيكم وأرضكم . وقيل : سقى وأسقى بمعنى . وقيل بالفرق ، وقد تقدم . وما أنتم له بخازنين أي ليست خزائنه عندكم ; أي نحن الخازنون لهذا الماء ننزله إذا شئنا ونمسكه إذا شئنا . ومثله وأنزلنا من السماء ماء طهورا ، وأنزلنا من السماء ماء بقدر فأسكناه في الأرض وإنا على ذهاب به لقادرون . وقال سفيان : لستم بمانعين المطر .\n                                    ",
      "saadi": "وَأَرۡسَلۡنَا ٱلرِّيَٰحَ لَوَٰقِحَ فَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَسۡقَيۡنَٰكُمُوهُ وَمَآ أَنتُمۡ لَهُۥ بِخَٰزِنِينَ ٢٢\n                                        \n                                        \n                                        \n                                        أي: وسخرنا الرياح، رياح الرحمة تلقح السحاب، كما يلقح الذكر الأنثى، فينشأ عن ذلك الماء بإذن الله، فيسقيه الله العباد ومواشيهم وأرضهم، ويبقى في الأرض مدخرا لحاجاتهم وضروراتهم ما هو مقتضى قدرته ورحمته، { وَمَا أَنْتُمْ لَهُ بِخَازِنِينَ } أي: لا قدرة لكم على خزنه وادخاره، ولكن الله يخزنه لكم ويسلكه ينابيع في الأرض رحمة بكم وإحسانا إليكم.\n                                    "
    }
  },
  {
    "id": 22,
    "versesNumber": 23,
    "souraName": "Al-Hijr.html",
    "contnent": "وَإِنَّا لَنَحۡنُ نُحۡيِۦ وَنُمِيتُ وَنَحۡنُ ٱلۡوَٰرِثُونَ ٣٢",
    "tafsier": {
      "ibnkther": "وَإِنَّا لَنَحۡنُ نُحۡيِۦ وَنُمِيتُ وَنَحۡنُ ٱلۡوَٰرِثُونَ ٣٢\n                                    \n                                    \n                                    وقوله : ( وإنا لنحن نحيي ونميت ) إخبار عن قدرته تعالى على بدء الخلق وإعادته ، وأنه هو الذي أحيا الخلق من العدم ، ثم يميتهم ثم يبعثهم كلهم ليوم الجمع .\nوأخبر أنه - تعالى - يرث الأرض ومن عليها وإليه يرجعون .\n                                    ",
      "qortoby": "وَإِنَّا لَنَحۡنُ نُحۡيِۦ وَنُمِيتُ وَنَحۡنُ ٱلۡوَٰرِثُونَ ٣٢\n                                    \n                                    \n                                    قوله تعالى : وإنا لنحن نحيي ونميت ونحن الوارثون أي الأرض ومن عليها ، ولا يبقى شيء سوانا . نظيره إنا نحن نرث الأرض ومن عليها وإلينا يرجعون . فملك كل شيء لله - تعالى - . ولكن ملك عباده أملاكا فإذا ماتوا انقطعت الدعاوى ، فكان الله وارثا من هذا الوجه . وقيل : الإحياء في هذه الآية إحياء النطفة في الأرحام . فأما البعث فقد ذكره بعد هذا في قوله : وإن ربك هو يحشرهم .\n                                    ",
      "saadi": "وَإِنَّا لَنَحۡنُ نُحۡيِۦ وَنُمِيتُ وَنَحۡنُ ٱلۡوَٰرِثُونَ ٣٢\n                                        \n                                        \n                                        \n                                        أي: هو وحده لا شريك له الذي يحيي الخلق من العدم بعد أن لم يكونوا شيئا مذكورا ويميتهم لآجالهم التي قدرها { وَنَحْنُ الْوَارِثُونَ } كقوله: { إِنَّا نَحْنُ نَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا وَإِلَيْنَا يُرْجَعُونَ } وليس ذلك بعزيز ولا ممتنع على الله\n                                    "
    }
  },
  {
    "id": 23,
    "versesNumber": 24,
    "souraName": "Al-Hijr.html",
    "contnent": "وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَقۡدِمِينَ مِنكُمۡ وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَ‍ٔۡخِرِينَ ٤٢",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَقۡدِمِينَ مِنكُمۡ وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَ‍ٔۡخِرِينَ ٤٢\n                                    \n                                    \n                                    ثم قال مخبرا عن تمام علمه بهم أولهم وآخرهم : ( ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين ) قال ابن عباس - رضي الله عنهما - المستقدمون : كل من هلك من لدن آدم - عليه السلام - والمستأخرون : من هو حي ومن سيأتي إلى يوم القيامة .\nوروي نحوه عن عكرمة ، ومجاهد ، والضحاك ، وقتادة ، ومحمد بن كعب ، والشعبي ، وغيرهم . وهو اختيار ابن جرير - رحمه الله -\nوقال ابن جرير : حدثنا محمد بن عبد الأعلى ، حدثنا المعتمر بن سليمان ، عن أبيه ، عن رجل عن مروان بن الحكم أنه قال : كان أناس يستأخرون في الصفوف من أجل النساء فأنزل الله : ( ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين )\nوقد ورد في هذا حديث غريب جدا ، فقال ابن جرير : حدثني محمد بن موسى الحرشي ، حدثنا نوح بن قيس ، حدثنا عمرو بن مالك ، عن أبي الجوزاء ، عن ابن عباس - رضي الله عنهما - قال : كانت تصلي خلف رسول الله - صلى الله عليه وسلم - امرأة - قال ابن عباس : لا والله ما إن رأيت مثلها قط - وكان بعض المسلمين إذا صلوا استقدموا يعني : لئلا يراها - وبعض يستأخرون ، فإذا سجدوا نظروا إليها من تحت أيديهم ، فأنزل الله : ( ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين )\nوكذا رواه أحمد وابن أبي حاتم في تفسيره ، والترمذي والنسائي في كتاب التفسير من سننيهما وابن ماجه من طرق عن نوح بن قيس الحداني وقد وثقه أحمد وأبو داود وغيرهما ، وحكي عن ابن معين تضعيفه ، وأخرج له مسلم وأهل السنن .\nوهذا الحديث فيه نكارة شديدة ، وقد رواه عبد الرزاق ، عن جعفر بن سليمان ، عن عمرو بن مالك وهو النكري أنه سمع أبا الجوزاء يقول في قوله : ( ولقد علمنا المستقدمين منكم ) في الصفوف في الصلاة ) والمستأخرين ) فالظاهر أنه من كلام أبي الجوزاء فقط ، ليس فيه لابن عباس ذكر وقد قال الترمذي : هذا أشبه من رواية نوح بن قيس ، والله أعلم .\nوهكذا روى ابن جرير عن محمد بن أبي معشر ، عن أبيه : أنه سمع عون بن عبد الله يذاكر محمد بن كعب في قوله : ( ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين ) وأنها في صفوف الصلاة ، فقال محمد بن كعب : ليس هكذا ( ولقد علمنا المستقدمين منكم ) الميت والمقتول ، و ( المستأخرين ) من يخلق بعد ، ( وإن ربك هو يحشرهم إنه حكيم عليم ) فقال عون بن عبد الله : وفقك الله وجزاك خيرا\n                                    ",
      "qortoby": "وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَقۡدِمِينَ مِنكُمۡ وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَ‍ٔۡخِرِينَ ٤٢\n                                    \n                                    \n                                    قوله تعالى : ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين فيه ثلاث مسائل :\nالأولى : قوله تعالى : ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين فيه ثمان تأويلات :\nالأول - المستقدمين في الخلق إلى اليوم ، والمستأخرين الذين لم يخلقوا بعد ; قاله قتادة وعكرمة وغيرهما .\nالثاني - المستقدمين الأموات ، والمستأخرين الأحياء ; قاله ابن عباس والضحاك .\nالثالث : المستقدمين من تقدم أمة محمد ، والمستأخرين أمة محمد - صلى الله عليه وسلم - ; قاله مجاهد .\nالرابع - المستقدمين في الطاعة والخير ، والمستأخرين في المعصية والشر ; قاله الحسن وقتادة أيضا .\nالخامس - المستقدمين في صفوف الحرب ، والمستأخرين فيها ; قاله سعيد بن المسيب .\nالسادس : المستقدمين من قتل في الجهاد ، والمستأخرين من لم يقتل ، قاله القرظي .\nالسابع : المستقدمين أول الخلق ، والمستأخرين آخر الخلق ، قاله الشعبي .\nالثامن : المستقدمين في صفوف الصلاة ، والمستأخرين فيها بسبب النساء . وكل هذا معلوم لله - تعالى - ; فإنه عالم بكل موجود ومعدوم ، وعالم بمن خلق وما هو خالقه إلى يوم القيامة . إلا أن القول الثامن هو سبب نزول الآية ; لما رواه النسائي والترمذي عن أبي الجوزاء عن ابن عباس قال : \" كانت امرأة تصلي خلف رسول الله - صلى الله عليه وسلم - حسناء من أحسن الناس ، فكان بعض القوم يتقدم حتى يكون في الصف الأول لئلا يراها ، ويتأخر بعضهم حتى يكون في الصف المؤخر ، فإذا ركع نظر من تحت إبطه ، فأنزل الله - عز وجل - ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين . وروي عن أبي الجوزاء ولم يذكر ابن عباس . وهو أصح .\nالثانية : هذا يدل على فضل أول الوقت في الصلاة وعلى فضل الصف الأول ; قال النبي - صلى الله عليه وسلم - : لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا عليه لاستهموا . فإذا جاء الرجل عند الزوال فنزل في الصف الأول مجاور الإمام ، حاز ثلاث مراتب في الفضل : أول الوقت ، والصف الأول ، ومجاورة الإمام . فإن جاء عند الزوال فنزل في الصف الآخر أو فيما نزل عن الصف الأول ، فقد حاز فضل أول الوقت وفاته فضل الصف الأول والمجاورة . فإن جاء وقت الزوال ونزل في الصف الأول دون ما يلي الإمام فقد حاز فضل أول الوقت وفضل الصف الأول ، وفاته مجاورة الإمام . فإن جاء بعد الزوال ونزل في الصف الأول فقد فاته فضيلة أول الوقت ، وحاز فضيلة الصف الأول ومجاورة الإمام . وهكذا . ومجاورة الإمام لا تكون لكل أحد ، وإنما هي كما قال - صلى الله عليه وسلم - : ليلني منكم أولو الأحلام والنهى الحديث . فما يلي الإمام ينبغي أن يكون لمن كانت هذه صفته ، فإن نزلها غيره أخر وتقدم هو إلى الموضع ; لأنه حقه بأمر صاحب الشرع ، كالمحراب هو موضع الإمام تقدم أو تأخر ; قاله ابن العربي .\nقلت : وعليه يحمل قول عمر - رضي الله عنه - : تأخر يا فلان ، تقدم يا فلان ; ثم يتقدم فيكبر . وقد روي عن كعب أن الرجل من هذه الأمة ليخر ساجدا فيغفر لمن خلفه . وكان كعب يتوخى الصف المؤخر من المسجد رجاء ذلك ، ويذكر أنه وجده كذلك في التوراة . ذكره الترمذي الحكيم في نوادر الأصول . وسيأتي في سورة \" الصافات \" زيادة بيان لهذا الباب إن شاء الله - تعالى - .\nالثالثة : وكما تدل هذه الآية على فضل الصف الأول في الصلاة ، فكذلك تدل على فضل الصف الأول في القتال ; فإن القيام في نحر العدو ، وبيع العبد نفسه من الله - تعالى - لا يوازيه عمل ; فالتقدم إليه أفضل ، ولا خلاف فيه ولا خفاء به . ولم يكن أحد يتقدم في الحرب بين يدي رسول الله - صلى الله عليه وسلم - ، لأنه كان أشجع الناس . قال البراء : كنا والله إذا احمر البأس نتقي به ، وإن الشجاع منا للذي يحاذي به ، يعني النبي - صلى الله عليه وسلم - .\n                                    ",
      "saadi": "وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَقۡدِمِينَ مِنكُمۡ وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَ‍ٔۡخِرِينَ ٤٢\n                                        \n                                        \n                                        \n                                        تقسير الآيتين 24 و 25 :ـ\nيعلم المستقدمين من الخلق والمستأخرين منهم ويعلم ما تنقص الأرض منهم وما تفرق من أجزائهم، وهو الذي قدرته لا يعجزها معجز فيعيد عباده خلقا جديدا ويحشرهم إليه.\n{ إِنَّهُ حَكِيمٌ } يضع الأشياء مواضعها، وينزلها منازلها، ويجازي كل عامل بعمله، إن خيرا فخير، وإن شرا فشر.\n                                    "
    }
  },
  {
    "id": 24,
    "versesNumber": 25,
    "souraName": "Al-Hijr.html",
    "contnent": "وَإِنَّ رَبَّكَ هُوَ يَحۡشُرُهُمۡۚ إِنَّهُۥ حَكِيمٌ عَلِيمٞ ٥٢",
    "tafsier": {
      "ibnkther": "وَإِنَّ رَبَّكَ هُوَ يَحۡشُرُهُمۡۚ إِنَّهُۥ حَكِيمٌ عَلِيمٞ ٥٢\n                                    \n                                    \n                                    \" وإن ربك هو يحشرهم إنه حكيم عليم \" فقال عون بن عبد الله وفقك الله وجزاك خيرا.\n                                    ",
      "qortoby": "وَإِنَّ رَبَّكَ هُوَ يَحۡشُرُهُمۡۚ إِنَّهُۥ حَكِيمٌ عَلِيمٞ ٥٢\n                                    \n                                    \n                                    قوله تعالى : وإن ربك هو يحشرهم إنه حكيم عليم\nقوله تعالى : وإن ربك هو يحشرهم أي للحساب والجزاء .\nإنه حكيم عليم يضع كل شيء موضعه\n                                    ",
      "saadi": "وَإِنَّ رَبَّكَ هُوَ يَحۡشُرُهُمۡۚ إِنَّهُۥ حَكِيمٌ عَلِيمٞ ٥٢\n                                        \n                                        \n                                        \n                                        تقسير الآيتين 24 و 25 :ـ\nيعلم المستقدمين من الخلق والمستأخرين منهم ويعلم ما تنقص الأرض منهم وما تفرق من أجزائهم، وهو الذي قدرته لا يعجزها معجز فيعيد عباده خلقا جديدا ويحشرهم إليه.\n{ إِنَّهُ حَكِيمٌ } يضع الأشياء مواضعها، وينزلها منازلها، ويجازي كل عامل بعمله، إن خيرا فخير، وإن شرا فشر.\n                                    "
    }
  },
  {
    "id": 25,
    "versesNumber": 26,
    "souraName": "Al-Hijr.html",
    "contnent": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٦٢",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٦٢\n                                    \n                                    \n                                    قال ابن عباس ، ومجاهد ، وقتادة : المراد بالصلصال هاهنا : التراب اليابس .\nوالظاهر أنه كقوله تعالى : ( خلق الإنسان من صلصال كالفخار وخلق الجان من مارج من نار ) [ الرحمن : 14 - 15 ]\nوعن مجاهد أيضا : الصلصال : المنتن .\nوتفسيرها بالآية أولى\nوقوله : ( من حمإ مسنون ) أي : الصلصال من حمأ ، وهو : الطين . والمسنون : الأملس ، كما قال الشاعر\nثم خاصرتها إلى القبة الخضراء تمشي في مرمر مسنون\nأي : أملس صقيل .\nولهذا روي عن ابن عباس : أنه قال : هو التراب الرطب . وعن ابن عباس ، ومجاهد ، والضحاك أيضا : أن الحمأ المسنون هو المنتن . وقيل : المراد بالمسنون هاهنا : المصبوب .\n                                    ",
      "qortoby": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٦٢\n                                    \n                                    \n                                    قوله تعالى : ولقد خلقنا الإنسان من صلصال من حمإ مسنون قوله تعالى : ولقد خلقنا الإنسان يعني آدم - عليه السلام - .\nمن صلصال أي من طين يابس ; عن ابن عباس وغيره . والصلصال : الطين الحر خلط بالرمل فصار يتصلصل إذا جف ، فإذا طبخ بالنار فهو الفخار ; عن أبي عبيدة . وهو قول أكثر المفسرين . وأنشد أهل اللغة :\nكعدو المصلصل الجوال\nوقال مجاهد : هو الطين المنتن ; واختاره الكسائي . قال : وهو من قول العرب : صل اللحم وأصل إذا أنتن - مطبوخا كان أو نيئا - يصل صلولا . قال الحطيئة :\nذاك فتى يبذل ذا قدره لا يفسد اللحم لديه الصلول\nوطين صلال ومصلال ; أي يصوت إذا نقرته كما يصوت الحديد . فكان أول ترابا ، أي متفرق الأجزاء ثم بل فصار طينا ; ثم ترك حتى أنتن فصار حمأ مسنونا ; أي متغيرا ، ثم يبس فصار صلصالا ; على قول الجمهور . وقد مضى في \" البقرة \" بيان هذا . والحمأ : الطين الأسود ، وكذلك الحمأة بالتسكين ; تقول منه : حمئت البئر حمأ ( بالتسكين ) إذا نزعت حمأتها . وحمئت البئر حمأ ( بالتحريك ) كثرت حمأتها . وأحمأتها إحماء ألقيت الحمأة ; عن ابن السكيت . وقال أبو عبيدة : الحمأة ( بسكون الميم ) مثل الكمأة . والجمع حمء ، مثل تمرة وتمر . والحمأ المصدر ، مثل الهلع والجزع ، ثم سمي به . والمسنون المتغير . قال ابن عباس : ( هو التراب المبتل المنتن ، فجعل صلصالا كالفخار ) . ومثله قول مجاهد وقتادة ، قالا : المنتن المتغير ; من قولهم : قد أسن الماء إذا تغير ; ومنه \" يتسنه \" و ماء غير آسن . ومنه قول أبي قيس بن الأسلت :\nسقت صداي رضابا غير ذي أسن كالمسك فت على ماء العناقيد\nوقال الفراء : هو المتغير ، وأصله من قولهم : سننت الحجر على الحجر إذا حككته به . وما يخرج من الحجرين يقال له السنانة والسنين ; ومنه المسن . قال الشاعر :\nثم خاصرتها إلى القبة الحمراء تمشي في مرمر مسنون\nأي محكوك مملس . حكي أن يزيد بن معاوية قال لأبيه : ألا ترى عبد الرحمن بن حسان يشبب بابنتك . فقال معاوية : وما قال ؟ فقال : قال :\nهي زهراء مثل لؤلؤة الغواص ميزت من جوهر مكنون\nفقال معاوية : صدق ! فقال يزيد : [ إنه يقول ] :\nوإذا ما نسبتها لم تجدها في سناء من المكارم دون\nفقال : صدق ! فقال : أين قوله : ثم خاصرتها . . . البيت . فقال معاوية : كذب . وقال أبو عبيدة : المسنون المصبوب ، وهو من قول العرب : سننت الماء وغيره على الوجه إذا صببته . والسن الصب . وروى علي بن أبي طلحة عن ابن عباس قال : ( المسنون الرطب ) ; وهذا بمعنى المصبوب ; لأنه لا يكون مصبوبا إلا وهو رطب . النحاس : وهذا قول حسن ; لأنه يقال : سننت الشيء أي صببته . قال أبو عمرو بن العلاء : ومنه الأثر المروي عن عمر أنه كان يسن الماء على وجهه ولا يشنه . والشن ( بالشين ) تفريق الماء ، وبالسين المهملة صبه من غير تفريق . وقال سيبويه : المسنون المصور . أخذ من سنة الوجه وهو صورته . وقال ذو الرمة :\nتريك سنة وجه غير مقرفة ملساء ليس لها خال ولا ندب\nوقال الأخفش : المسنون . المنصوب القائم ; من قولهم : وجه مسنون إذا كان فيه طول . وقد قيل : إن الصلصال للتراب المدقق ; حكاه المهدوي . ومن قال : إن الصلصال هو المنتن فأصله صلال ، فأبدل من إحدى اللامين الصاد .\n\" من حمإ \" مفسر لجنس الصلصال ; كقولك : أخذت هذا من رجل من العرب .\n                                    ",
      "saadi": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٦٢\n                                        \n                                        \n                                        \n                                        يذكر تعالى نعمته وإحسانه على أبينا آدم عليه السلام، وما جرى من عدوه إبليس، وفي ضمن ذلك التحذير لنا من شره وفتنته فقال تعالى: { وَلَقَدْ خَلَقْنَا الْإِنْسَانَ } أي آدم عليه السلام { مِنْ صَلْصَالٍ مِنْ حَمَإٍ مَسْنُونٍ } أي: من طين قد يبس بعد ما خمر حتى صار له صلصلة وصوت، كصوت الفخار، والحمأ المسنون: الطين المتغير لونه وريحه من طول مكثه.\n                                    "
    }
  },
  {
    "id": 26,
    "versesNumber": 27,
    "souraName": "Al-Hijr.html",
    "contnent": "وَٱلۡجَآنَّ خَلَقۡنَٰهُ مِن قَبۡلُ مِن نَّارِ ٱلسَّمُومِ ٧٢",
    "tafsier": {
      "ibnkther": "وَٱلۡجَآنَّ خَلَقۡنَٰهُ مِن قَبۡلُ مِن نَّارِ ٱلسَّمُومِ ٧٢\n                                    \n                                    \n                                    وقوله : ( والجان خلقناه من قبل ) أي : من قبل الإنسان ( من نار السموم ) قال ابن عباس : هي السموم التي تقتل .\nوقال بعضهم : السموم بالليل والنهار . ومنهم من يقول : السموم بالليل ، والحرور بالنهار .\nوقال أبو داود الطيالسي : حدثنا شعبة ، عن أبي إسحاق قال : دخلت على عمرو الأصم أعوده ، فقال : ألا أحدثك حديثا سمعته من عبد الله بن مسعود يقول : هذه السموم جزء من سبعين جزءا من السموم التي خلق منها الجان ، ثم قرأ : ( والجان خلقناه من قبل من نار السموم )\nوعن ابن عباس : أن الجان خلق من لهب النار ، وفي رواية : من أحسن النار .\nوعن عمرو بن دينار : من نار الشمس . وقد ورد في الصحيح : \" خلقت الملائكة من نور ، وخلقت الجان من مارج من نار ، وخلق بنو آدم مما وصف لكم \" ومقصود الآية : التنبيه على شرف آدم - عليه السلام - وطيب عنصره ، وطهارة محتده\n                                    ",
      "qortoby": "وَٱلۡجَآنَّ خَلَقۡنَٰهُ مِن قَبۡلُ مِن نَّارِ ٱلسَّمُومِ ٧٢\n                                    \n                                    \nقوله تعالى : والجان خلقناه من قبل من نار السموم قوله تعالى : والجان خلقناه من قبل أي من قبل خلق آدم . وقال الحسن : يعني إبليس ، خلقه الله - تعالى - قبل آدم - عليه السلام - . وسمي جانا لتواريه عن الأعين . وفي صحيح مسلم من حديث ثابت عن أنس أن رسول الله - صلى الله عليه وسلم - قال : لما صور الله - تعالى - آدم - عليه السلام - في الجنة تركه ما شاء الله أن يتركه فجعل إبليس يطيف به ينظر ما هو فلما رآه أجوف عرف أنه خلق خلقا لا يتمالك .\nمن نار السموم قال ابن مسعود : ( نار السموم التي خلق الله منها الجان جزء من سبعين جزءا من نار جهنم ) . وقال ابن عباس : ( السموم الريح الحارة التي تقتل ) . وعنه ( أنها نار لا دخان لها ) ، والصواعق تكون منها ، وهي نار تكون بين السماء والحجاب . فإذا أحدث الله أمرا اخترقت الحجاب فهوت الصاعقة إلى ما أمرت . فالهدة التي تسمعون خرق ذلك الحجاب . وقال الحسن : نار السموم نار دونها حجاب ، والذي تسمعون من انغطاط السحاب صوتها . وعن ابن عباس أيضا قال : ( كان إبليس من حي من أحياء الملائكة يقال لهم الجن خلقوا من نار السموم من بين الملائكة - قال - : وخلقت الجن الذين ذكروا في القرآن من مارج من نار .\nقلت : هذا فيه نظر ; فإنه يحتاج إلى سند يقطع العذر ; إذ مثله لا يقال من جهة الرأي . وقد خرج مسلم من حديث عروة عن عائشة قال رسول الله - صلى الله عليه وسلم - : خلقت الملائكة من نور وخلق الجان من مارج من نار وخلق آدم مما وصف لكم . فقوله : خلقت الملائكة من نور يقتضي العموم . والله أعلم . وقال الجوهري : مارج من نار نار لا دخان لها خلق منها الجان . والسموم الريح الحارة تؤنث ; يقال منه : سم يومنا فهو يوم مسموم ، والجمع سمائم . قال أبو عبيدة : ( السموم بالنهار وقد تكون بالليل ، والحرور بالليل وقد تكون بالنهار ) . القشيري : وسميت الريح الحارة سموما لدخولها في مسام البدن .\n                                    ",
      "saadi": "وَٱلۡجَآنَّ خَلَقۡنَٰهُ مِن قَبۡلُ مِن نَّارِ ٱلسَّمُومِ ٧٢\n                                        \n                                        \n                                        \n                                        { وَالْجَانَّ } وهو: أبو الجن أي: إبليس { خَلَقْنَاهُ مِنْ قَبْلُ } خلق آدم { مِنْ نَارِ السَّمُومِ } أي: من النار الشديدة الحرارة\n                                    "
    }
  },
  {
    "id": 27,
    "versesNumber": 28,
    "souraName": "Al-Hijr.html",
    "contnent": "وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٨٢",
    "tafsier": {
      "ibnkther": "وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٨٢\n                                    \n                                    \n                                    يذكر - تعالى - تنويهه بذكر آدم في ملائكته قبل خلقه له ، وتشريفه إياه بأمره الملائكة بالسجود له . ويذكر تخلف إبليس عدوه عن السجود له من بين سائر الملائكة ، حسدا وكفرا ، وعنادا واستكبارا ، وافتخارا بالباطل ، ولهذا قال : ( لم أكن لأسجد لبشر خلقته من صلصال من حمإ مسنون ) كما قال في الآية الأخرى : ( أنا خير منه خلقتني من نار وخلقته من طين ) [ الأعراف : 12 ] وقوله : ( أرأيتك هذا الذي كرمت علي لئن أخرتني إلى يوم القيامة لأحتنكن ذريته إلا قليلا ) [ الإسراء : 62 ]\n                                    ",
      "qortoby": "وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٨٢\n                                    \n                                    \n                                    وإذ قال ربك للملائكة إني خالق بشرا من صلصال من حمإ مسنون\nقوله تعالى : وإذ قال ربك للملائكة تقدم في البقرة . إني خالق بشرا من صلصال من طين\n                                    ",
      "saadi": "وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٨٢\n                                        \n                                        \n                                        \n                                        فلما أراد الله خلق آدم قال للملائكة: { إِنِّي خَالِقٌ بَشَرًا مِنْ صَلْصَالٍ مِنْ حَمَإٍ مَسْنُونٍ }\n                                    "
    }
  },
  {
    "id": 28,
    "versesNumber": 29,
    "souraName": "Al-Hijr.html",
    "contnent": "فَإِذَا سَوَّيۡتُهُۥ وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ ٩٢",
    "tafsier": {
      "ibnkther": "فَإِذَا سَوَّيۡتُهُۥ وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ ٩٢\n                                    \n                                    \n                                    وقد روى ابن جرير هاهنا أثرا غريبا عجيبا من حديث شبيب بن بشر ، عن عكرمة ، عن ابن عباس قال : لما خلق الله الملائكة قال : إني خالق بشرا من طين ، فإذا سويته فاسجدوا له ، قالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم ، ثم خلق ملائكة فقال لهم مثل ذلك [ فقالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة أخرى فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له فأبوا ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له ] قالوا سمعنا وأطعنا ، إلا إبليس كان من الكافرين الأولين\nوفي ثبوت هذا عنه بعد ، والظاهر أنه إسرائيلي ، والله أعلم .\n                                    ",
      "qortoby": "فَإِذَا سَوَّيۡتُهُۥ وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ ٩٢\n                                    \n                                    \n                                    فإذا سويته أي سويت خلقه وصورته .\nونفخت فيه من روحي النفخ إجراء الريح في الشيء . والروح جسم لطيف ، أجرى الله العادة بأن يخلق الحياة في البدن مع ذلك الجسم . وحقيقته إضافة خلق إلى خالق ; فالروح خلق من خلقه أضافه إلى نفسه تشريفا وتكريما ; كقوله : ( أرضي وسمائي وبيتي وناقة الله وشهر الله ) . ومثله وروح منه وقد تقدم في \" النساء \" مبينا . وذكرنا في كتاب ( التذكرة ) الأحاديث الواردة التي تدل على أن الروح جسم لطيف ، وأن النفس والروح اسمان لمسمى واحد . وسيأتي ذلك إن شاء الله . ومن قال إن الروح هو الحياة قال أراد : فإذا ركبت فيه الحياة .\nفقعوا له ساجدين أي خروا له ساجدين . وهو سجود تحية وتكريم لا سجود عبادة . ولله أن يفضل من يريد ; ففضل الأنبياء على الملائكة . وقد تقدم في \" البقرة \" هذا المعنى . وقال القفال : كانوا أفضل من آدم ، وامتحنهم بالسجود له تعريضا لهم للثواب الجزيل . وهو مذهب المعتزلة . وقيل : أمروا بالسجود لله عند آدم ، وكان آدم قبلة لهم .\n                                    ",
      "saadi": "فَإِذَا سَوَّيۡتُهُۥ وَنَفَخۡتُ فِيهِ مِن رُّوحِي فَقَعُواْ لَهُۥ سَٰجِدِينَ ٩٢\n                                        \n                                        \n                                        \n                                        {فَإِذَا سَوَّيْتُهُ } جسدا تاما { وَنَفَخْتُ فِيهِ مِنْ رُوحِي فَقَعُوا لَهُ سَاجِدِينَ } فامتثلوا أمر ربهم.\n                                    "
    }
  },
  {
    "id": 29,
    "versesNumber": 30,
    "souraName": "Al-Hijr.html",
    "contnent": "فَسَجَدَ ٱلۡمَلَٰٓئِكَةُ كُلُّهُمۡ أَجۡمَعُونَ ٠٣",
    "tafsier": {
      "ibnkther": "فَسَجَدَ ٱلۡمَلَٰٓئِكَةُ كُلُّهُمۡ أَجۡمَعُونَ ٠٣\n                                    \n                                    \n                                    وقد روى ابن جرير هاهنا أثرا غريبا عجيبا من حديث شبيب بن بشر ، عن عكرمة ، عن ابن عباس قال : لما خلق الله الملائكة قال : إني خالق بشرا من طين ، فإذا سويته فاسجدوا له ، قالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم ، ثم خلق ملائكة فقال لهم مثل ذلك [ فقالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة أخرى فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له فأبوا ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له ] قالوا سمعنا وأطعنا ، إلا إبليس كان من الكافرين الأولين\nوفي ثبوت هذا عنه بعد ، والظاهر أنه إسرائيلي ، والله أعلم .\n                                    ",
      "qortoby": "فَسَجَدَ ٱلۡمَلَٰٓئِكَةُ كُلُّهُمۡ أَجۡمَعُونَ ٠٣\n                                    \n                                    \n                                    قوله تعالى : فسجد الملائكة كلهم أجمعون\nقوله - تعالى - فسجد الملائكة كلهم أجمعون إلا إبليس\nلا شك أن إبليس كان مأمورا بالسجود ; لقوله : ما منعك ألا تسجد إذ أمرتك وإنما منعه من ذلك الاستكبار والاستعظام ; كما تقدم في \" البقرة \" بيانه . ثم قيل : كان من الملائكة ; فهو استثناء من الجنس . وقال قوم : لم يكن من الملائكة ; فهو استثناء منقطع . وقد مضى في \" البقرة \" هذا كله مستوفى . وقال ابن عباس : الجان أبو الجن وليسوا شياطين . والشياطين ولد إبليس ; لا يموتون إلا مع إبليس . والجن يموتون ، ومنهم المؤمن ومنهم الكافر . فآدم أبو الإنس . والجان أبو الجن . وإبليس أبو الشياطين ; ذكره الماوردي . والذي تقدم في \" البقرة \" خلاف هذا ، فتأمله هناك .\n\n                                    ",
      "saadi": "فَسَجَدَ ٱلۡمَلَٰٓئِكَةُ كُلُّهُمۡ أَجۡمَعُونَ ٠٣\n                                        \n                                        \n                                        \n                                        { فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ } تأكيد بعد تأكيد ليدل على أنه لم يتخلف منهم أحد، وذلك تعظيما لأمر الله وإكراما لآدم حيث علم ما لم يعلموا.\n                                    "
    }
  },
  {
    "id": 30,
    "versesNumber": 31,
    "souraName": "Al-Hijr.html",
    "contnent": "إِلَّآ إِبۡلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ ٱلسَّٰجِدِينَ ١٣",
    "tafsier": {
      "ibnkther": "إِلَّآ إِبۡلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ ٱلسَّٰجِدِينَ ١٣\n                                    \n                                    \n                                    وقد روى ابن جرير هاهنا أثرا غريبا عجيبا من حديث شبيب بن بشر ، عن عكرمة ، عن ابن عباس قال : لما خلق الله الملائكة قال : إني خالق بشرا من طين ، فإذا سويته فاسجدوا له ، قالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم ، ثم خلق ملائكة فقال لهم مثل ذلك [ فقالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة أخرى فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له فأبوا ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له ] قالوا سمعنا وأطعنا ، إلا إبليس كان من الكافرين الأولين\nوفي ثبوت هذا عنه بعد ، والظاهر أنه إسرائيلي ، والله أعلم .\n                                    ",
      "qortoby": "إِلَّآ إِبۡلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ ٱلسَّٰجِدِينَ ١٣\n                                    \n                                    \n                                    الاستثناء من الجنس غير الجنس صحيح عند الشافعي ، حتى لو قال : لفلان علي دينار إلا ثوبا ، أو عشرة أثواب إلا قفيز حنطة ، وما جانس ذلك كان مقبولا ، ولا يسقط عنه من المبلغ قيمة الثوب والحنطة . ويستوي في ذلك المكيلات والموزونات والمقدرات . وقال مالك وأبو حنيفة - رضي الله عنهما - : استثناء المكيل من الموزون والموزون من المكيل جائز ، حتى لو استثنى الدراهم من الحنطة والحنطة من الدراهم قبل . فأما إذا استثنى المقومات من المكيلات أو الموزونات ، والمكيلات من المقومات ، مثل أن يقول : علي عشرة دنانير إلا ثوبا ، أو عشرة أثواب إلا دينارا لا يصح الاستثناء ، ويلزم المقر جميع المبلغ . وقال محمد بن الحسن : الاستثناء من غير الجنس لا يصح ، ويلزم المقر جملة ما أقر به . والدليل لقول الشافعي أن لفظ الاستثناء يستعمل في الجنس وغير الجنس ; قال الله - تعالى - : لا يسمعون فيها لغوا ولا تأثيما إلا قيلا سلاما سلاما فاستثنى السلام من جملة اللغو . ومثله فسجد الملائكة كلهم أجمعون إلا إبليس وإبليس من جملة الملائكة ; قال الله - تعالى - : إلا إبليس كان من الجن ففسق عن أمر ربه وقال الشاعر :\nوبلدة ليس بها أنيس إلا اليعافير وإلا العيس\nفاستثنى اليعافير وهي ذكور الظباء ، والعيس وهي الجمال البيض من الأنيس ; ومثله قول النابغة :\nحلفت يمينا غير ذي مثنوية ولا علم إلا حسن ظن بصاحب\n                                    ",
      "saadi": "إِلَّآ إِبۡلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ ٱلسَّٰجِدِينَ ١٣\n                                        \n                                        \n                                        \n                                        { إِلَّا إِبْلِيسَ أَبَى أَنْ يَكُونَ مَعَ السَّاجِدِينَ } وهذه أول عداوته لآدم وذريته\n                                    "
    }
  },
  {
    "id": 31,
    "versesNumber": 32,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ يَٰٓإِبۡلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّٰجِدِينَ ٢٣",
    "tafsier": {
      "ibnkther": "قَالَ يَٰٓإِبۡلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّٰجِدِينَ ٢٣\n                                    \n                                    \n                                    وقد روى ابن جرير هاهنا أثرا غريبا عجيبا من حديث شبيب بن بشر ، عن عكرمة ، عن ابن عباس قال : لما خلق الله الملائكة قال : إني خالق بشرا من طين ، فإذا سويته فاسجدوا له ، قالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم ، ثم خلق ملائكة فقال لهم مثل ذلك [ فقالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة أخرى فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له فأبوا ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له ] قالوا سمعنا وأطعنا ، إلا إبليس كان من الكافرين الأولين\nوفي ثبوت هذا عنه بعد ، والظاهر أنه إسرائيلي ، والله أعلم .\n                                    ",
      "qortoby": "قَالَ يَٰٓإِبۡلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّٰجِدِينَ ٢٣\n                                    \n                                    \n                                    قال يا إبليس ما\nأي ما المانع لك .لك ألا تكون مع\nأي في ألا تكون .\n                                    ",
      "saadi": "قَالَ يَٰٓإِبۡلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّٰجِدِينَ ٢٣\n                                        \n                                        \n                                        \n                                        تفسير ألايتين 32 و 33 :ـ\nقال الله: { يَا إِبْلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ السَّاجِدِينَ قَالَ لَمْ أَكُنْ لِأَسْجُدَ لِبَشَرٍ خَلَقْتَهُ مِنْ صَلْصَالٍ مِنْ حَمَإٍ مَسْنُونٍ } فاستكبر على أمر الله وأبدى العداوة لآدم وذريته وأعجب بعنصره، وقال: أنا خير من آدم.\n                                    "
    }
  },
  {
    "id": 32,
    "versesNumber": 33,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ لَمۡ أَكُن لِّأَسۡجُدَ لِبَشَرٍ خَلَقۡتَهُۥ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٣٣",
    "tafsier": {
      "ibnkther": "قَالَ لَمۡ أَكُن لِّأَسۡجُدَ لِبَشَرٍ خَلَقۡتَهُۥ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٣٣\n                                    \n                                    \n                                    وقد روى ابن جرير هاهنا أثرا غريبا عجيبا من حديث شبيب بن بشر ، عن عكرمة ، عن ابن عباس قال : لما خلق الله الملائكة قال : إني خالق بشرا من طين ، فإذا سويته فاسجدوا له ، قالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم ، ثم خلق ملائكة فقال لهم مثل ذلك [ فقالوا : لا نفعل ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة أخرى فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له فأبوا ، فأرسل عليهم نارا فأحرقتهم . ثم خلق ملائكة فقال : إني خالق بشرا من طين ، فإذا أنا خلقته فاسجدوا له ] قالوا سمعنا وأطعنا ، إلا إبليس كان من الكافرين الأولين\nوفي ثبوت هذا عنه بعد ، والظاهر أنه إسرائيلي ، والله أعلم .\n                                    ",
      "qortoby": "قَالَ لَمۡ أَكُن لِّأَسۡجُدَ لِبَشَرٍ خَلَقۡتَهُۥ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٣٣\n                                    \n                                    \n                                    قال لم أكن لأسجد لبشر خلقته من صلصال من حمإ مسنون\nبين تكبره وحسده , وأنه خير منه , إذ هو من نار والنار تأكل الطين ; كما تقدم في \" الأعراف \" بيانه .\n                                    ",
      "saadi": "قَالَ لَمۡ أَكُن لِّأَسۡجُدَ لِبَشَرٍ خَلَقۡتَهُۥ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ ٣٣\n                                        \n                                        \n                                        \n                                        تفسير ألايتين 32 و 33 :ـ\nقال الله: { يَا إِبْلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ السَّاجِدِينَ قَالَ لَمْ أَكُنْ لِأَسْجُدَ لِبَشَرٍ خَلَقْتَهُ مِنْ صَلْصَالٍ مِنْ حَمَإٍ مَسْنُونٍ } فاستكبر على أمر الله وأبدى العداوة لآدم وذريته وأعجب بعنصره، وقال: أنا خير من آدم.\n                                    "
    }
  },
  {
    "id": 33,
    "versesNumber": 34,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِيمٞ ٤٣",
    "tafsier": {
      "ibnkther": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِيمٞ ٤٣\n                                    \n                                    \n                                    يذكر تعالى أنه أمر إبليس أمرا كونيا لا يخالف ولا يمانع بالخروج من المنزلة التي كان فيها من الملإ الأعلى وأنه رجيم أي مرجوم وأنه قد اتبعته لعنة لا تزال متصلة به لاحقة له متواترة عليه إلى يوم القيامة.\n                                    ",
      "qortoby": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِيمٞ ٤٣\n                                    \n                                    \n                                    قَالَ فَاخْرُجْ مِنْهَا\nأي من السموات , أو من جنة عدن , أو من جملة الملائكة .فَإِنَّكَ رَجِيمٌ\nأي مرجوم بالشهب .\nوقيل : ملعون مشئوم .\nوقد تقدم هذا كله مستوفى في البقرة والأعراف .\n                                    ",
      "saadi": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِيمٞ ٤٣\n                                        \n                                        \n                                        \n                                        { قَالَ } الله معاقبا له على كفره واستكباره { فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ } أي: مطرود مبعد من كل خير\n                                    "
    }
  },
  {
    "id": 34,
    "versesNumber": 35,
    "souraName": "Al-Hijr.html",
    "contnent": "وَإِنَّ عَلَيۡكَ ٱللَّعۡنَةَ إِلَىٰ يَوۡمِ ٱلدِّينِ ٥٣",
    "tafsier": {
      "ibnkther": "وَإِنَّ عَلَيۡكَ ٱللَّعۡنَةَ إِلَىٰ يَوۡمِ ٱلدِّينِ ٥٣\n                                    \n                                    \n                                    يذكر تعالى أنه أمر إبليس أمرا كونيا لا يخالف ولا يمانع بالخروج من المنزلة التي كان فيها من الملأ الأعلى وأنه رجيم أي مرجوم وأنه قد اتبعته لعنة لا تزال متصلة به لاحقة له متواترة عليه إلى يوم القيامة.\n                                    ",
      "qortoby": "وَإِنَّ عَلَيۡكَ ٱللَّعۡنَةَ إِلَىٰ يَوۡمِ ٱلدِّينِ ٥٣\n                                    \n                                    \n                                    أي لعنتي , كما في سورة \" ص \" .\n                                    ",
      "saadi": "وَإِنَّ عَلَيۡكَ ٱللَّعۡنَةَ إِلَىٰ يَوۡمِ ٱلدِّينِ ٥٣\n                                        \n                                        \n                                        \n                                        { وَإِنَّ عَلَيْكَ اللَّعْنَةَ } أي: الذم والعيب، والبعد عن رحمة الله، { إِلَى يَوْمِ الدِّينِ } ففيها وما أشبهها دليل على أنه سيستمر على كفره وبعده من الخير.\n                                    "
    }
  },
  {
    "id": 35,
    "versesNumber": 36,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ ٦٣",
    "tafsier": {
      "ibnkther": "قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ ٦٣\n                                    \n                                    \n                                    وعن سعيد بن جبير أنه قال: لما لعن الله إبليس تغيرت صورته عن صورة الملائكة ورن رنة فكل رنة في الدنيا إلى يوم القيامة منها.\nرواه ابن أبي حاتم وأنه لما تحقق الغضب الذي لا مرد له سأل من تمام حسده لآدم وذريته النظِرة إلى يوم القيامة وهو يوم البعث.\n                                    ",
      "qortoby": "قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ ٦٣\n                                    \n                                    \n                                    أي يشكون أنه نازل بهم , وهو العذاب .\n                                    ",
      "saadi": "قَالَ رَبِّ فَأَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ ٦٣\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 36 الى 38 :ـ\n{ قَالَ رَبِّ فَأَنْظِرْنِي } أي: أمهلني { إِلَى يَوْمِ يُبْعَثُونَ قَالَ فَإِنَّكَ مِنَ الْمُنْظَرِينَ إِلَى يَوْمِ الْوَقْتِ الْمَعْلُومِ } وليس إجابة الله لدعائه كرامة في حقه وإنما ذلك امتحان وابتلاء من الله له وللعباد ليتبين الصادق الذي يطيع مولاه دون عدوه ممن ليس كذلك، ولذلك حذرنا منه غاية التحذير، وشرح لنا ما يريده منا.\n                                    "
    }
  },
  {
    "id": 36,
    "versesNumber": 37,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِينَ ٧٣",
    "tafsier": {
      "ibnkther": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِينَ ٧٣\n                                    \n                                    \n                                    وأنه أجيب إلى ذلك استدراجا له وإمهالا.\n                                    ",
      "qortoby": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِينَ ٧٣\n                                    \n                                    \n                                    يعني من المؤجلين .\n                                    ",
      "saadi": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِينَ ٧٣\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 36 الى 38 :ـ\n{ قَالَ رَبِّ فَأَنْظِرْنِي } أي: أمهلني { إِلَى يَوْمِ يُبْعَثُونَ قَالَ فَإِنَّكَ مِنَ الْمُنْظَرِينَ إِلَى يَوْمِ الْوَقْتِ الْمَعْلُومِ } وليس إجابة الله لدعائه كرامة في حقه وإنما ذلك امتحان وابتلاء من الله له وللعباد ليتبين الصادق الذي يطيع مولاه دون عدوه ممن ليس كذلك، ولذلك حذرنا منه غاية التحذير، وشرح لنا ما يريده منا.\n                                    "
    }
  },
  {
    "id": 37,
    "versesNumber": 38,
    "souraName": "Al-Hijr.html",
    "contnent": "إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ ٨٣",
    "tafsier": {
      "ibnkther": "إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ ٨٣\n                                    \n                                    \n                                    فلما تحقق النظرة قبحه الله.\n                                    ",
      "qortoby": "إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ ٨٣\n                                    \n                                    \n                                    قال ابن عباس : ( أراد به النفخة الأولى ) , أي حين تموت الخلائق .\nوقيل : الوقت المعلوم الذي استأثر الله بعلمه , ويجهله إبليس .\nفيموت إبليس ثم يبعث ; قال الله تعالى : \" كل من عليها فان \" [ الرحمن : 26 ] .\nوفي كلام الله تعالى له قولان :\nأحدهما : كلمه على لسان رسوله .\nالثاني : كلمه تغليظا في الوعيد لا على وجه التكرمة والتقريب .\n                                    ",
      "saadi": "إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ ٨٣\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 36 الى 38 :ـ\n{ قَالَ رَبِّ فَأَنْظِرْنِي } أي: أمهلني { إِلَى يَوْمِ يُبْعَثُونَ قَالَ فَإِنَّكَ مِنَ الْمُنْظَرِينَ إِلَى يَوْمِ الْوَقْتِ الْمَعْلُومِ } وليس إجابة الله لدعائه كرامة في حقه وإنما ذلك امتحان وابتلاء من الله له وللعباد ليتبين الصادق الذي يطيع مولاه دون عدوه ممن ليس كذلك، ولذلك حذرنا منه غاية التحذير، وشرح لنا ما يريده منا.\n                                    "
    }
  },
  {
    "id": 38,
    "versesNumber": 39,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ رَبِّ بِمَآ أَغۡوَيۡتَنِي لَأُزَيِّنَنَّ لَهُمۡ فِي ٱلۡأَرۡضِ وَلَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ ٩٣",
    "tafsier": {
      "ibnkther": "قَالَ رَبِّ بِمَآ أَغۡوَيۡتَنِي لَأُزَيِّنَنَّ لَهُمۡ فِي ٱلۡأَرۡضِ وَلَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ ٩٣\n                                    \n                                    \n                                    يقول تعالى مخبرا عن إبليس وتمرده وعتوه أنه قال للرب : ( بما أغويتني ) قال بعضهم : أقسم بإغواء الله له .\nقلت : ويحتمل أنه بسبب ما أغويتني وأضللتني ( لأزينن لهم ) أي : لذرية آدم - عليه السلام - ( في الأرض ) أي : أحبب إليهم المعاصي وأرغبهم فيها ، وأؤزهم إليها ، وأزعجهم إزعاجا ، ( ولأغوينهم ) أي : كما أغويتني وندرت على ذلك\n                                    ",
      "qortoby": "قَالَ رَبِّ بِمَآ أَغۡوَيۡتَنِي لَأُزَيِّنَنَّ لَهُمۡ فِي ٱلۡأَرۡضِ وَلَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ ٩٣\n                                    \n                                    \n                                    قوله تعالى : قال رب بما أغويتني لأزينن لهم في الأرض ولأغوينهم أجمعين قوله تعالى : قال رب بما أغويتني لأزينن لهم في الأرض تقدم معنى الإغواء والزينة في الأعراف . وتزيينه هنا يكون بوجهين : إما بفعل المعاصي ، وإما بشغلهم بزينة الدنيا عن فعل الطاعة .\nولأغوينهم أجمعين أي لأضلنهم عن طريق الهدى .\nوروى ابن لهيعة عبد الله عن دراج أبي السمح عن أبي الهيثم عن أبي سعيد الخدري قال : قال رسول الله - صلى الله عليه وسلم - : إن إبليس قال يا رب وعزتك وجلالك لا أزال أغوي بني آدم ما دامت أرواحهم في أجسامهم فقال الرب وعزتي وجلالي لا أزال أغفر لهم ما استغفروني .\n                                    ",
      "saadi": "قَالَ رَبِّ بِمَآ أَغۡوَيۡتَنِي لَأُزَيِّنَنَّ لَهُمۡ فِي ٱلۡأَرۡضِ وَلَأُغۡوِيَنَّهُمۡ أَجۡمَعِينَ ٩٣\n                                        \n                                        \n                                        \n                                        { قَالَ رَبِّ بِمَا أَغْوَيْتَنِي لَأُزَيِّنَنَّ لَهُمْ فِي الْأَرْضِ } أي: أزين لهم الدنيا وأدعوهم إلى إيثارها على الأخرى، حتى يكونوا منقادين لكل معصية. { وَلَأُغْوِيَنَّهُمْ أَجْمَعِينَ } أي: أصدهم كلهم عن الصراط المستقيم،\n                                    "
    }
  },
  {
    "id": 39,
    "versesNumber": 40,
    "souraName": "Al-Hijr.html",
    "contnent": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ ٠٤ ",
    "tafsier": {
      "ibnkther": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ ٠٤\n                                    \n                                    \n                                    إلا عبادك منهم المخلصين \" كقوله \" أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا \" \" قال \"الله تعالى له متهددا ومتوعدا.\n                                    ",
      "qortoby": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ ٠٤\n                                    \n                                    \n                                    قوله تعالى : إلا عبادك منهم المخلصين قرأ أهل المدينة وأهل الكوفة بفتح اللام ; أي الذين استخلصتهم وأخلصتهم . وقرأ الباقون بكسر اللام ; أي الذين أخلصوا لك العبادة من فساد أو رياء . حكى أبو ثمامة أن الحواريين سألوا عيسى - عليه السلام - عن المخلصين لله فقال : ( الذي يعمل ولا يحب أن يحمده الناس ) .\n                                    ",
      "saadi": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ ٠٤\n                                        \n                                        \n                                        \n                                        { إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ } أي: الذين أخلصتهم واجتبيتهم لإخلاصهم، وإيمانهم وتوكلهم.\n                                    "
    }
  },
  {
    "id": 40,
    "versesNumber": 41,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ هَٰذَا صِرَٰطٌ عَلَيَّ مُسۡتَقِيمٌ ١٤",
    "tafsier": {
      "ibnkther": "قَالَ هَٰذَا صِرَٰطٌ عَلَيَّ مُسۡتَقِيمٌ ١٤\n                                    \n                                    \n                                    قال الله تعالى له متهددا ومتوعدا ( هذا صراط علي مستقيم ) أي : مرجعكم كلكم إلي ، فأجازيكم بأعمالكم ، إن خيرا فخير ، وإن شرا فشر ، كما قال تعالى : ( إن ربك لبالمرصاد ) [ الفجر : 14 ]\nوقيل : طريق الحق مرجعها إلى الله تعالى ، وإليه تنتهي . قاله مجاهد ، والحسن ، وقتادة كما قال : ( وعلى الله قصد السبيل ) [ النحل : 9 ]\nوقرأ قيس بن عباد ، ومحمد بن سيرين ، وقتادة : \" هذا صراط علي مستقيم \" كقوله : ( وإنه في أم الكتاب لدينا لعلي حكيم ) [ الزخرف : 4 ] أي : رفيع . والمشهور القراءة الأولى .\n                                    ",
      "qortoby": "قَالَ هَٰذَا صِرَٰطٌ عَلَيَّ مُسۡتَقِيمٌ ١٤\n                                    \n                                    \n                                    قوله تعالى : قال هذا صراط علي مستقيم قال عمر بن الخطاب : ( معناه هذا صراط يستقيم بصاحبه حتى يهجم به على الجنة ) . الحسن : علي بمعنى إلي . مجاهد والكسائي : هذا على الوعيد والتهديد ; كقولك لمن تهدده : طريقك علي ومصيرك إلي . وكقوله : إن ربك لبالمرصاد . فكان معنى الكلام : هذا طريق مرجعه إلي فأجازي كلا بعمله ، يعني طريق العبودية . وقيل : المعنى علي أن أدل على الصراط المستقيم بالبيان والبرهان . وقيل : بالتوفيق والهداية . وقرأ ابن سيرين وقتادة والحسن وقيس بن عباد وأبو رجاء وحميد ويعقوب \" هذا صراط علي مستقيم \" برفع \" علي \" وتنوينه ; ومعناه رفيع مستقيم ، أي رفيع في الدين والحق . وقيل : رفيع أن ينال ، مستقيم أن يمال .\n                                    ",
      "saadi": "قَالَ هَٰذَا صِرَٰطٌ عَلَيَّ مُسۡتَقِيمٌ ١٤\n                                        \n                                        \n                                        \n                                        قال الله تعالى: { هَذَا صِرَاطٌ عَلَيَّ مُسْتَقِيمٌ } أي: معتدل موصل إليَّ وإلى دار كرامتي.\n                                    "
    }
  },
  {
    "id": 41,
    "versesNumber": 42,
    "souraName": "Al-Hijr.html",
    "contnent": "إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلۡغَاوِينَ ٢٤",
    "tafsier": {
      "ibnkther": "إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلۡغَاوِينَ ٢٤\n                                    \n                                    \n                                    وقوله : ( إن عبادي ليس لك عليهم سلطان ) أي : الذين قدرت لهم الهداية ، فلا سبيل لك عليهم ، ولا وصول لك إليهم ، ( إلا من اتبعك من الغاوين ) استثناء منقطع . \nوقد أورد ابن جرير هاهنا من حديث عبد الله بن المبارك ، عن عبد الله بن موهب حدثنا يزيد بن قسيط قال : كانت الأنبياء يكون لهم مساجد خارجة من قراهم ، فإذا أراد النبي أن يستنبئ ربه عن شيء ، خرج إلى مسجده فصلى ما كتب الله له ، ثم سأل ما بدا له ، فبينا نبي في مسجده إذ جاء عدو الله - يعني - : إبليس حتى جلس بينه وبين القبلة ، فقال النبي : أعوذ بالله من الشيطان الرجيم . [ فقال عدو الله : أرأيت الذي تعوذ منه ؟ فهو هو . فقال النبي : أعوذ بالله من الشيطان الرجيم ] قال : فردد ذلك ثلاث مرات ، فقال عدو الله : أخبرني بأي شيء تنجو مني ؟ فقال النبي : بل أخبرني بأي شيء تغلب ابن آدم مرتين ؟ فأخذ كل [ واحد ] منهما على صاحبه ، فقال النبي : إن الله تعالى يقول : ( إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين ) قال عدو الله : قد سمعت هذا قبل أن تولد . قال النبي : ويقول الله : ( وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه سميع عليم ) [ الأعراف : 200 ] وإني والله ما أحسست بك قط إلا استعذت بالله منك . قال عدو الله : صدقت ، بهذا تنجو مني . فقال النبي : \" أخبرني بأي شيء تغلب ابن آدم \" ؟ قال : آخذه عند الغضب والهوى\n                                    ",
      "qortoby": "إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلۡغَاوِينَ ٢٤\n                                    \n                                    \n                                    قوله تعالى : إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين فيه مسألتان :\nالأولى : قوله تعالى : إن عبادي ليس لك عليهم سلطان قال العلماء : يعني على قلوبهم . وقال ابن عيينة : أي في أن يلقيهم في ذنب يمنعهم عفوي ويضيقه عليهم . وهؤلاء الذين هداهم الله واجتباهم واختارهم واصطفاهم .\nقلت : لعل قائلا يقول : قد أخبر الله عن صفة آدم وحواء - عليهما السلام - بقوله : فأزلهما الشيطان وعن جملة من أصحاب نبيه بقوله : إنما استزلهم الشيطان ببعض ما كسبوا فالجواب ما ذكر ، وهو أنه ليس له سلطان على قلوبهم ، ولا موضع إيمانهم ، ولا يلقيهم في ذنب يئول إلى عدم القبول ، بل تزيله التوبة وتمحوه الأوبة . ولم يكن خروج آدم عقوبة لما تناول ; على ما تقدم في \" البقرة \" بيانه . وأما أصحاب النبي - صلى الله عليه وسلم - فقد مضى القول عنهم في آل عمران . ثم إن قوله سبحانه : ليس لك عليهم سلطان يحتمل أن يكون خاصا فيمن حفظه الله ، ويحتمل أن يكون في أكثر الأوقات والأحوال ، وقد يكون في تسلطه تفريج كربة وإزالة غمة ; كما فعل ببلال ، إذ أتاه يهدئه كما يهدأ الصبي حتى نام ، ونام النبي - صلى الله عليه وسلم - وأصحابه فلم يستيقظوا حتى طلعت الشمس ، وفزعوا وقالوا : ما كفارة ما صنعنا بتفريطنا في صلاتنا ؟ فقال لهم النبي - صلى الله عليه وسلم - : ليس في النوم تفريط ففرج عنهم .\nإلا من اتبعك من الغاوين أي الضالين المشركين . أي سلطانه على هؤلاء ; دليله إنما سلطانه على الذين يتولونه والذين هم به مشركون .\nالثانية : وهذه الآية والتي قبلها دليل على جواز استثناء القليل من الكثير والكثير من القليل ; مثل أن يقول : عشرة إلا درهما . أو يقول : عشرة إلا تسعة . وقال أحمد بن حنبل : لا يجوز أن يستثنى إلا قدر النصف فما دونه . وأما استثناء الأكثر من الجملة فلا يصح . ودليلنا هذه الآية ، فإن فيها استثناء الغاوين من العباد والعباد من الغاوين ، وذلك يدل على أن استثناء الأقل من الجملة واستثناء الأكثر من الجملة جائز .\n                                    ",
      "saadi": "إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلۡغَاوِينَ ٢٤\n                                        \n                                        \n                                        \n                                        { إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ } تميلهم به إلى ما تشاء من أنواع الضلالات، بسبب عبوديتهم لربهم وانقيادهم لأوامره أعانهم الله وعصمهم من الشيطان.\n{ إِلَّا مَنِ اتَّبَعَكَ } فرضي بولايتك وطاعتك بدلا من طاعة الرحمن، { مِنَ الْغَاوِينَ } والغاوي: ضد الراشد فهو الذي عرف الحق وتركه، والضال: الذي تركه من غير علم منه به.\n                                    "
    }
  },
  {
    "id": 42,
    "versesNumber": 43,
    "souraName": "Al-Hijr.html",
    "contnent": "وَإِنَّ جَهَنَّمَ لَمَوۡعِدُهُمۡ أَجۡمَعِينَ ٣٤",
    "tafsier": {
      "ibnkther": "وَإِنَّ جَهَنَّمَ لَمَوۡعِدُهُمۡ أَجۡمَعِينَ ٣٤\n                                    \n                                    \n                                    وقوله \" وإن جهنم لموعدهم أجمعين أي جهنم موعد جميع من اتبع إبليس كما قال عن القرآن \" ومن يكفر به من الأحزاب فالنار موعده.\n                                    ",
      "qortoby": "وَإِنَّ جَهَنَّمَ لَمَوۡعِدُهُمۡ أَجۡمَعِينَ ٣٤\n                                    \n                                    \n                                    يعني إبليس ومن اتبعه .\n                                    ",
      "saadi": "وَإِنَّ جَهَنَّمَ لَمَوۡعِدُهُمۡ أَجۡمَعِينَ ٣٤\n                                        \n                                        \n                                        \n                                        { وَإِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ أَجْمَعِينَ } أي: إبليس وجنوده\n                                    "
    }
  },
  {
    "id": 43,
    "versesNumber": 44,
    "souraName": "Al-Hijr.html",
    "contnent": "لَهَا سَبۡعَةُ أَبۡوَٰبٖ لِّكُلِّ بَابٖ مِّنۡهُمۡ جُزۡءٞ مَّقۡسُومٌ ٤٤",
    "tafsier": {
      "ibnkther": "لَهَا سَبۡعَةُ أَبۡوَٰبٖ لِّكُلِّ بَابٖ مِّنۡهُمۡ جُزۡءٞ مَّقۡسُومٌ ٤٤\n                                    \n                                    \n                                    ثم أخبر أن لجهنم سبعة أبواب : ( لكل باب منهم جزء مقسوم ) أي : قد كتب لكل باب منها جزء من أتباع إبليس يدخلونه ، لا محيد لهم عنه - أجارنا الله منها - وكل يدخل من باب بحسب عمله ، ويستقر في درك بقدر فعله .\nقال إسماعيل ابن علية وشعبة كلاهما ، عن أبي هارون الغنوي ، عن حطان بن عبد الله أنه قال : سمعت علي بن أبي طالب وهو يخطب قال : إن أبواب جهنم هكذا - قال أبو هارون : أطباقا بعضها فوق بعض\nوقال إسرائيل ، عن أبي إسحاق ، عن هبيرة بن يريم عن علي - رضي الله عنه - قال : أبواب جهنم سبعة بعضها فوق بعض ، فيمتلئ الأول ، ثم الثاني ، ثم الثالث ، حتى تملأ كلها\nوقال عكرمة : ( سبعة أبواب ) سبعة أطباق .\nوقال ابن جريج : ( سبعة أبواب ) أولها جهنم ، ثم لظى ، ثم الحطمة ، ثم سعير ، ثم سقر ، ثم الجحيم ، ثم الهاوية .\nوروى الضحاك عن ابن عباس نحوه . وكذا [ روي ] عن الأعمش بنحوه أيضا .\nوقال قتادة : ( لها سبعة أبواب لكل باب منهم جزء مقسوم ) وهي والله منازل بأعمالهم ، رواهن ابن جرير .\nوقال جويبر ، عن الضحاك : ( لها سبعة أبواب لكل باب منهم جزء مقسوم ) قال : باب لليهود ، وباب للنصارى ، وباب للصابئين ، وباب للمجوس ، وباب للذين أشركوا - وهم كفار العرب - وباب للمنافقين ، وباب لأهل التوحيد ، فأهل التوحيد يرجى لهم ولا يرجى لأولئك أبدا .\nوقال الترمذي : حدثنا عبد بن حميد ، حدثنا عثمان بن عمر ، عن مالك بن مغول ، عن جنيد عن ابن عمر ، عن النبي - صلى الله عليه وسلم - قال : \" لجهنم سبعة أبواب : باب منها لمن سل السيف على أمتي - أو قال : على أمة محمد .\nثم قال : لا نعرفه إلا من حديث مالك بن مغول\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا ، عباس بن الوليد الخلال ، حدثنا زيد - يعني - ابن يحيى - حدثنا سعيد بن بشير ، ، عن أبي نضرة ، عن قتادة 55 عن سمرة بن جندب ، عن النبي - صلى الله عليه وسلم - في قوله : ( لكل باب منهم جزء مقسوم ) قال : \" إن من أهل النار من تأخذه النار إلى كعبيه ، وإن منهم من تأخذه النار إلى حجزته ، ومنهم من تأخذه النار إلى تراقيه ، منازل بأعمالهم ، فذلك قوله : ( لكل باب منهم جزء مقسوم )\n                                    ",
      "qortoby": "لَهَا سَبۡعَةُ أَبۡوَٰبٖ لِّكُلِّ بَابٖ مِّنۡهُمۡ جُزۡءٞ مَّقۡسُومٌ ٤٤\n                                    \n                                    \n                                    لها سبعة أبواب أي أطباق ، طبق فوق طبق\nلكل باب منهم أي لكل طبقة\nجزء مقسوم أي حظ معلوم . ذكر ابن المبارك قال : أخبرنا إبراهيم أبو هارون الغنوي قال : سمعت حطان بن عبد الله الرقاشي يقول سمعت عليا - رضي الله عنه - يقول : ( هل تدرون كيف أبواب جهنم ؟ قلنا : هي مثل أبوابنا . قال لا ، هي هكذا بعضها فوق بعض ، - زاد الثعلبي : ووضع إحدى يديه على الأخرى : وأن الله وضع الجنان على الأرض ، والنيران بعضها فوق بعض ، فأسفلها جهنم ، وفوقها الحطمة ، وفوقها سقر ، وفوقها الجحيم ، وفوقها لظى ، وفوقها السعير ، وفوقها الهاوية ، وكل باب أشد حرا من الذي يليه سبعين مرة ) .\nقلت : كذا وقع هذا التفسير . والذي عليه الأكثر من العلماء أن جهنم أعلى الدركات ، وهي مختصة بالعصاة من أمة محمد - صلى الله عليه وسلم - ، وهي التي تخلى من أهلها فتصفق الرياح أبوابها . ثم لظى ، ثم الحطمة ، ثم سعير ، ثم سقر ، ثم الجحيم ، ثم الهاوية . قال الضحاك : في الدرك الأعلى المحمديون ، وفي الثاني النصارى ، وفي الثالث اليهود ، وفي الرابع الصابئون ، وفي الخامس المجوس ، وفي السادس مشركو العرب ، وفي السابع المنافقون وآل فرعون ومن كفر من أهل المائدة . قال الله - تعالى - : إن المنافقين في الدرك الأسفل من النار - وقد تقدم في النساء - ، وقال : أدخلوا آل فرعون أشد العذاب . وقسم معاذ بن جبل - رضي الله عنه - العلماء السوء من هذه الأمة تقسيما على تلك الأبواب ; ذكرناه في كتاب ( التذكرة ) وروى الترمذي من حديث ابن عمر قال : قال رسول الله - صلى الله عليه وسلم - : لجهنم سبعة أبواب باب منها لمن سل سيفه على أمتي قال : حديث غريب . وقال أبي بن كعب : ( لجهنم سبعة أبواب باب منها للحرورية .\nوقال وهب بن منبه : بين كل بابين مسيرة سبعين سنة ، كل باب أشد حرا من الذي فوقه بسبعين ضعفا ، وقد ذكرنا هذا كله في كتاب التذكرة . وروى سلام الطويل عن أبي سفيان عن أنس بن مالك عن النبي - صلى الله عليه وسلم - في قول الله - تعالى - : لها سبعة أبواب لكل باب منهم جزء مقسوم جزء أشركوا بالله ، وجزء شكوا في الله ، وجزء غفلوا عن الله ، وجزء آثروا شهواتهم على الله ، وجزء شفوا غيظهم بغضب الله ، وجزء صيروا رغبتهم بحظهم من الله ، وجزء عتوا على الله . ذكره الحليمي أبو عبد الله الحسين بن الحسن في كتاب ( منهاج الدين ) له ، وقال : فإن كان ثابتا فالمشركون بالله هم الثنوية . والشاكون هم الذين لا يدرون أن لهم إلها أو لا إله لهم ، ويشكون في شريعته أنها من عنده أم لا . والغافلون عن الله هم الذين يجحدونه أصلا ولا يثبتونه ، وهم الدهرية . والمؤثرون شهواتهم على الله هم المنهمكون في المعاصي ; لتكذيبهم رسل الله وأمره ونهيه . والشافون غيظهم بغضب الله هم القاتلون أنبياء الله وسائر الداعين إليه ، المعذبون من ينصح لهم أو يذهب غير مذهبهم . والمصيرون رغبتهم بحظهم من الله هم المنكرون بالبعث والحساب ; فهم يعبدون ما يرغبون فيه ، لهم جميع حظهم من الله - تعالى - . والعاتون على الله الذين لا يبالون بأن يكون ما هم فيه حقا أو باطلا ، فلا يتفكرون ولا يعتبرون ولا يستدلون . والله أعلم بما أراد رسوله - صلى الله عليه وسلم - إن ثبت الحديث . ويروى أن سلمان الفارسي - رضي الله عنه - لما سمع هذه الآية وإن جهنم لموعدهم أجمعين فر ثلاثة أيام من الخوف لا يعقل ، فجيء به إلى رسول الله - صلى الله عليه وسلم - فسأله فقال : يا رسول الله ، أنزلت هذه الآية وإن جهنم لموعدهم أجمعين ؟ فوالذي بعثك بالحق لقد قطعت قلبي ; فأنزل الله - تعالى - إن المتقين في جنات وعيون . وقال بلال : كان النبي - صلى الله عليه وسلم - يصلي في مسجد المدينة وحده ، فمرت به امرأة أعرابية فصلت خلفه ولم يعلم بها ، فقرأ رسول الله - صلى الله عليه وسلم - هذه الآية لها سبعة أبواب لكل باب منهم جزء مقسوم فخرت الأعرابية مغشيا عليها ، وسمع النبي - صلى الله عليه وسلم - وجبتها فانصرف ودعا بماء فصب على وجهها حتى أفاقت وجلست ، فقال النبي - صلى الله عليه وسلم - : يا هذه مالك ؟ فقالت : أهذا شيء من كتاب الله المنزل ، أو تقوله من تلقاء نفسك ؟ فقال : يا أعرابية ، بل هو من كتاب الله - تعالى - المنزل فقالت : كل عضو من أعضائي يعذب على كل باب منها ؟ قال : يا أعرابية ، بل لكل باب منهم جزء مقسوم يعذب أهل كل منها على قدر أعمالهم فقالت : والله إني امرأة مسكينة ، ما لي مال ، وما لي إلا سبعة أعبد ، أشهدك يا رسول الله ، أن كل عبد منهم عن كل باب من أبواب جهنم حر لوجه الله - تعالى - : فأتاه جبريل فقال . \" يا رسول الله ، بشر الأعرابية أن الله قد حرم عليها أبواب جهنم كلها وفتح لها أبواب الجنة كلها ) .\n                                    ",
      "saadi": "لَهَا سَبۡعَةُ أَبۡوَٰبٖ لِّكُلِّ بَابٖ مِّنۡهُمۡ جُزۡءٞ مَّقۡسُومٌ ٤٤\n                                        \n                                        \n                                        \n                                        { لَهَا سَبْعَةُ أَبْوَابٍ } كل باب أسفل من الآخر، { لِكُلِّ بَابٍ مِنْهُمْ } أي: من أتباع إبليس { جُزْءٌ مَقْسُومٌ } بحسب أعمالهم. قال الله تعالى: { فَكُبْكِبُوا فِيهَا هُمْ وَالْغَاوُونَ وَجُنُودُ إِبْلِيسَ أَجْمَعُونَ }\n                                    "
    }
  },
  {
    "id": 44,
    "versesNumber": 45,
    "souraName": "Al-Hijr.html",
    "contnent": "إِنَّ ٱلۡمُتَّقِينَ فِي جَنَّٰتٖ وَعُيُونٍ ٥٤",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلۡمُتَّقِينَ فِي جَنَّٰتٖ وَعُيُونٍ ٥٤\n                                    \n                                    \n                                    لما ذكر تعالى حال أهل النار عطف على ذكر أصل الجنة وأنهم في جنات وعيون.\n                                    ",
      "qortoby": "إِنَّ ٱلۡمُتَّقِينَ فِي جَنَّٰتٖ وَعُيُونٍ ٥٤\n                                    \n                                    \n                                    قوله تعالى : إن المتقين في جنات وعيون ادخلوها بسلام آمنين قوله تعالى : إن المتقين في جنات وعيون أي الذين اتقوا الفواحش والشرك .\nفي جنات أي بساتين .\nوعيون هي الأنهار الأربعة : ماء وخمر ولبن وعسل . وأما العيون المذكورة في سورة \" الإنسان \" : الكافور والزنجبيل والسلسبيل ، وفي \" المطففين \" : التسنيم ، فيأتي ذكرها وأهلها إن شاء الله . وضم العين من \" عيون \" على الأصل ، والكسر مراعاة للياء ، وقرئ بهما\n                                    ",
      "saadi": "إِنَّ ٱلۡمُتَّقِينَ فِي جَنَّٰتٖ وَعُيُونٍ ٥٤\n                                        \n                                        \n                                        \n                                        ولما ذكر تعالى ما أعد لأعدائه أتباع إبليس من النكال والعذاب الشديد ذكر ما أعد لأوليائه من الفضل العظيم والنعيم المقيم فقال تعالى: { إِنَّ الْمُتَّقِينَ } الذين اتقوا طاعة الشيطان وما يدعوهم إليه من جميع الذنوب والعصيان { فِي جَنَّاتٍ وَعُيُونٍ } قد احتوت على جميع الأشجار وأينعت فيها جميع الثمار اللذيذة في جميع الأوقات.\n                                    "
    }
  },
  {
    "id": 45,
    "versesNumber": 46,
    "souraName": "Al-Hijr.html",
    "contnent": "ٱدۡخُلُوهَا بِسَلَٰمٍ ءَامِنِينَ ٦٤",
    "tafsier": {
      "ibnkther": "ٱدۡخُلُوهَا بِسَلَٰمٍ ءَامِنِينَ ٦٤\n                                    \n                                    \n                                    وقوله \" ادخلوها بسلام \" أي سالمين من الآفات مسلم عليكم \" آمنين \" أي من كل خوف وفزع ولا تخشوا من إخراج ولا انقطاع ولا فناء.\n                                    ",
      "qortoby": "ٱدۡخُلُوهَا بِسَلَٰمٍ ءَامِنِينَ ٦٤\n                                    \n                                    \n                                    ادخلوها بسلام آمنين قراءة العامة ادخلوها بوصل الألف وضم الخاء ، من دخل يدخل ، على الأمر . تقديره : قيل ادخلوها . وقرأ الحسن وأبو العالية ورويس عن يعقوب \" أدخلوها \" بضم التنوين ووصل الألف وكسر الخاء على الفعل المجهول ، من أدخل . أي أدخلهم الله إياها . ومذهبهم كسر التنوين في مثل برحمة ادخلوا الجنة وشبهه ; إلا أنهم هاهنا ألقوا حركة الهمزة على التنوين ; إذ هي ألف قطع ، ولكن فيه انتقال من كسر إلى ضم ثم من ضم إلى كسر فيثقل على اللسان . بسلام أي بسلامة من كل داء وآفة . وقيل : بتحية من الله لهم . آمنين أي من الموت والعذاب والعزل والزوال .\n                                    ",
      "saadi": "ٱدۡخُلُوهَا بِسَلَٰمٍ ءَامِنِينَ ٦٤\n                                        \n                                        \n                                        \n                                        ويقال لهم حال دخولها: { ادْخُلُوهَا بِسَلَامٍ آمِنِينَ } من الموت والنوم والنصب، واللغوب وانقطاع شيء من النعيم الذي هم فيه أو نقصانه ومن المرض، والحزن والهم وسائر المكدرات\n                                    "
    }
  },
  {
    "id": 46,
    "versesNumber": 47,
    "souraName": "Al-Hijr.html",
    "contnent": "وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلٍّ إِخۡوَٰنًا عَلَىٰ سُرُرٖ مُّتَقَٰبِلِينَ ٧٤",
    "tafsier": {
      "ibnkther": "وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلٍّ إِخۡوَٰنًا عَلَىٰ سُرُرٖ مُّتَقَٰبِلِينَ ٧٤\n                                    \n                                    \n                                    وقوله : ( ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين ) روى القاسم ، عن أبي أمامة قال : يدخل أهل الجنة الجنة على ما في صدورهم في الدنيا من الشحناء والضغائن ، حتى إذا توافوا وتقابلوا نزع الله ما في صدورهم في الدنيا من غل ، ثم قرأ : ( ونزعنا ما في صدورهم من غل )\nهكذا في هذه الرواية ، والقاسم بن عبد الرحمن - في روايته عن أبي أمامة - ضعيف .\nوقد روى سنيد في تفسيره : حدثنا ابن فضالة ، عن لقمان ، عن أبي أمامة قال : لا يدخل مؤمن الجنة حتى ينزع الله ما في صدرهم من غل ، حتى ينزع منه مثل السبع الضاري\nوهذا موافق لما في الصحيح من رواية قتادة ، حدثنا أبو المتوكل الناجي : أن أبا سعيد الخدري حدثهم : أن رسول الله - صلى الله عليه وسلم - قال : \" يخلص المؤمنون من النار ، فيحبسون على قنطرة بين الجنة والنار ، فيقتص لبعضهم من بعضهم مظالم كانت بينهم في الدنيا ، حتى إذا هذبوا ونقوا ، أذن لهم في دخول الجنة \"\nوقال ابن جرير : حدثنا الحسن ، حدثنا يزيد بن هارون ، أخبرنا هشام ، عن محمد - هو ابن سيرين - قال : استأذن الأشتر على علي - رضي الله عنه - وعنده ابن لطلحة ، فحبسه ثم أذن له . فلما دخل قال : إني لأراك إنما احتبستني لهذا ؟ قال : أجل . قال : إني لأراه لو كان عندك ابن لعثمان لحبستني ؟ قال : أجل إني لأرجو أن أكون أنا وعثمان ممن قال الله تعالى : ( ونزعنا ما في صدورهم من غل [ إخوانا ] على سرر متقابلين )\nوحدثنا الحسن : حدثنا أبو معاوية الضرير ، حدثنا أبو مالك الأشجعي ، عن أبي حبيبة - مولى لطلحة - قال : دخل عمران بن طلحة على علي - رضي الله عنه - بعدما فرغ من أصحاب الجمل ، فرحب به وقال : إني لأرجو أن يجعلني الله وأباك من الذين قال الله : ( ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين ) - قال : ورجلان جالسان على ناحية البساط ، فقالا : الله أعدل من ذلك ، تقتلهم بالأمس ، وتكونون إخوانا ؟ ! فقال علي - رضي الله عنه - : قوما أبعد أرض وأسحقها ، فمن هو إذا إن لم أكن أنا وطلحة ، وذكر أبو معاوية الحديث بطوله\nوروى وكيع ، عن أبان بن عبد الله البجلي ، عن نعيم بن أبي هند ، عن ربعي بن حراش ، عن علي نحوه . وقال فيه : فقام رجل من همدان فقال : الله أعدل من ذاك يا أمير المؤمنين ، قال : فصاح به علي صيحة ، فظننت أن القصر تدهده لها ، ثم قال : إذا لم نكن نحن فمن هو ؟\nوقال سعيد بن مسروق ، عن أبي طلحة - وذكره - فيه : فقال الحارث الأعور ذلك ، فقام إليه علي - رضي الله عنه - فضربه بشيء كان في يده في رأسه ، وقال : فمن هم يا أعور إذا لم نكن نحن ؟\nوقال سفيان الثوري : عن منصور ، عن إبراهيم قال : جاء ابن جرموز قاتل الزبير يستأذن على علي - رضي الله عنه - فحجبه طويلا ثم أذن له ، فقال له : أما أهل البلاء فتجفوهم ، فقال علي : بفيك التراب ، إني لأرجو أن أكون أنا وطلحة والزبير ممن قال الله : ( ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين )\nوكذا روى الثوري ، عن جعفر بن محمد ، عن أبيه ، عن علي بنحوه .\nوقال سفيان بن عيينة ، عن إسرائيل ، عن أبي موسى ، سمع الحسن البصري يقول : قال علي : فينا والله - أهل بدر - نزلت هذه الآية : ( ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين )\nوقال كثير النواء : دخلت على أبي جعفر محمد بن علي فقلت : وليي وليكم ، وسلمي سلمكم ، وعدوي عدوكم ، وحربي حربكم ، إني أسألك بالله : أتبرأ من أبي بكر وعمر ؟ فقال : ( قد ضللت إذا وما أنا من المهتدين ) [ الأنعام : 56 ] تولهما يا كثير ، فما أدركك فهو في رقبتي هذه ، ثم تلا هذه الآية : ( إخوانا على سرر متقابلين ) قال : أبو بكر ، وعمر ، وعلي رضي الله عنهم أجمعين .\nوقال الثوري ، عن رجل ، عن أبي صالح في قوله : ( إخوانا على سرر متقابلين ) قال : هم عشرة : أبو بكر ، وعمر ، وعثمان ، وعلي ، وطلحة ، والزبير ، وعبد الرحمن بن عوف ، وسعد بن أبي وقاص ، وسعيد بن زيد ، وعبد الله بن مسعود ، رضي الله عنهم أجمعين .\nوقوله : ( متقابلين ) قال مجاهد : لا ينظر بعضهم في قفا بعض .\nوفيه حديث مرفوع ، قال ابن أبي حاتم : حدثنا يحيى بن عبدك القزويني ، حدثنا حسان بن حسان ، حدثنا إبراهيم بن بشر حدثنا يحيى بن معين ، عن إبراهيم القرشي ، عن سعيد بن شرحبيل ، عن زيد بن أبي أوفى قال : خرج علينا رسول الله - صلى الله عليه وسلم - فتلا هذه الآية : ( إخوانا على سرر متقابلين ) في الله ، ينظر بعضهم إلى بعض\n                                    ",
      "qortoby": "وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلٍّ إِخۡوَٰنًا عَلَىٰ سُرُرٖ مُّتَقَٰبِلِينَ ٧٤\n                                    \n                                    \n                                    قوله تعالى : ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين\nقال ابن عباس : أول ما يدخل أهل الجنة الجنة تعرض لهم عينان ، فيشربون من إحدى العينين فيذهب الله ما في قلوبهم من غل ، ثم يدخلون العين الأخرى فيغتسلون فيها فتشرق ألوانهم وتصفو وجوههم ، وتجري عليهم نضرة النعيم ; ونحوه عن علي - رضي الله عنه - . وقال علي بن الحسين : نزلت في أبي بكر وعمر وعلي والصحابة ، يعني ما كان بينهم في الجاهلية من الغل . والقول الأول أظهر ، يدل عليه سياق الآية . وقال علي - رضي الله عنه - : ( أرجو أن أكون أنا وطلحة والزبير من هؤلاء ) . والغل : الحقد والعداوة ; يقال منه : غل يغل . ويقال من الغلول وهو السرقة من المغنم : غل يغل : ويقال من الخيانة : أغل يغل . كما قال :\nجزى الله عنا حمزة بنة نوفل جزاء مغل بالأمانة كاذب\nوقد مضى هذا في آل عمران . إخوانا على سرر متقابلين أي لا ينظر بعضهم إلى قفا بعض تواصلا وتحاببا ; عن مجاهد وغيره . وقيل : الأسرة تدور كيفما شاءوا ، فلا يرى أحد قفا أحد . وقيل : متقابلين قد أقبلت عليهم الأزواج وأقبلوا عليهن بالود . وسرر جمع سرير . مثل جديد وجدد . وقيل : هو من السرور ; فكأنه مكان رفيع ممهد للسرور . والأول أظهر . قال ابن عباس : ( على سرر مكللة بالياقوت والزبرجد والدر ) ، السرير ما بين صنعاء إلى الجابية وما بين عدن إلى أيلة . وإخوانا نصب على الحال من المتقين أو من المضمر في ادخلوها ، أو من المضمر في آمنين ، أو يكون حالا مقدرة من الهاء والميم في صدورهم .\n                                    ",
      "saadi": "وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلٍّ إِخۡوَٰنًا عَلَىٰ سُرُرٖ مُّتَقَٰبِلِينَ ٧٤\n                                        \n                                        \n                                        \n                                        { وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ } فتبقى قلوبهم سالمة من كل دغل وحسد متصافية متحابة { إخوانا على سرر متقابلين }\nدل ذلك على تزاورهم واجتماعهم وحسن أدبهم فيما بينهم في كون كل منهم مقابلا للآخر لا مستدبرا له متكئين على تلك السرر المزينة بالفرش واللؤلؤ وأنواع الجواهر.\n                                    "
    }
  },
  {
    "id": 47,
    "versesNumber": 48,
    "souraName": "Al-Hijr.html",
    "contnent": "لَا يَمَسُّهُمۡ فِيهَا نَصَبٞ وَمَا هُم مِّنۡهَا بِمُخۡرَجِينَ ٨٤",
    "tafsier": {
      "ibnkther": "لَا يَمَسُّهُمۡ فِيهَا نَصَبٞ وَمَا هُم مِّنۡهَا بِمُخۡرَجِينَ ٨٤\n                                    \n                                    \n                                    وقوله : ( لا يمسهم فيها نصب ) يعني : المشقة والأذى ، كما جاء في الصحيحين : \" إن الله أمرني أن أبشر خديجة ببيت في الجنة من قصب ، لا صخب فيه ولا نصب \"\nوقوله : ( وما هم منها بمخرجين ) كما جاء في الحديث : \" يقال يا أهل الجنة ، إن لكم أن تصحوا فلا تمرضوا أبدا ، وإن لكم أن تعيشوا فلا تموتوا أبدا ، وإن لكم أن تشبوا فلا تهرموا أبدا ، وإن لكم أن تقيموا فلا تظعنوا أبدا \" ، وقال الله تعالى : ( خالدين فيها لا يبغون عنها حولا ) [ الكهف : 108 ]\n                                    ",
      "qortoby": "لَا يَمَسُّهُمۡ فِيهَا نَصَبٞ وَمَا هُم مِّنۡهَا بِمُخۡرَجِينَ ٨٤\n                                    \n                                    \n                                    لا يمسهم فيها نصب أي إعياء وتعب .\nوما هم منها بمخرجين دليل على أن نعيم الجنة دائم لا يزول ، وأن أهلها فيها باقون . أكلها دائم إن هذا لرزقنا ما له من نفاد .\n                                    ",
      "saadi": "لَا يَمَسُّهُمۡ فِيهَا نَصَبٞ وَمَا هُم مِّنۡهَا بِمُخۡرَجِينَ ٨٤\n                                        \n                                        \n                                        \n                                        { لَا يَمَسُّهُمْ فِيهَا نَصَبٌ } لا ظاهر ولا باطن، وذلك لأن الله ينشئهم نشأة وحياة كاملة لا تقبل شيئا من الآفات، { وَمَا هُمْ مِنْهَا بِمُخْرَجِينَ } على سائر الأوقات.\n                                    "
    }
  },
  {
    "id": 48,
    "versesNumber": 49,
    "souraName": "Al-Hijr.html",
    "contnent": "۞ نَبِّئۡ عِبَادِيٓ أَنِّيٓ أَنَا ٱلۡغَفُورُ ٱلرَّحِيمُ ٩٤",
    "tafsier": {
      "ibnkther": "۞ نَبِّئۡ عِبَادِيٓ أَنِّيٓ أَنَا ٱلۡغَفُورُ ٱلرَّحِيمُ ٩٤\n                                    \n                                    \n                                    وقوله : ( نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم ) أي : أخبر يا محمد عبادي أني ذو رحمة وذو عقاب أليم .\nوقد تقدم ذكر نظير هذه الآية الكريمة ، وهي دالة على مقامي الرجاء والخوف ، وذكر في سبب نزولها ما رواه موسى بن عبيدة عن مصعب بن ثابت قال : مر رسول الله - صلى الله عليه وسلم - على ناس من أصحابه يضحكون ، فقال : \" اذكروا الجنة ، واذكروا النار \" . فنزلت : ( نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم ) رواه ابن أبي حاتم ، وهو مرسل\nوقال ابن جرير ، حدثني المثنى ، حدثنا إسحاق ، أخبرنا ابن المكي ، أخبرنا ابن المبارك ، أخبرنا مصعب بن ثابت ، حدثنا عاصم بن عبيد الله ، عن ابن أبي رباح ، عن رجل من أصحاب النبي - صلى الله عليه وسلم - قال : طلع علينا رسول الله - صلى الله عليه وسلم - من الباب الذي يدخل منه بنو شيبة ، فقال : \" ألا أراكم تضحكون ؟ \" ثم أدبر ، حتى إذا كان عند الحجر رجع إلينا القهقرى ، فقال : \" إني لما خرجت جاء جبريل - عليه السلام - فقال : يا محمد ، إن الله يقول لم تقنط عبادي ؟ ( نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم )\nوقال سعيد ، عن قتادة في قوله تعالى : ( نبئ عبادي أني أنا الغفور الرحيم ) قال : بلغنا أن رسول الله - صلى الله عليه وسلم - قال : \" لو يعلم العبد قدر عفو الله لما تورع من حرام ، ولو يعلم قدر عقابه لبخع نفسه \"\n                                    ",
      "qortoby": "۞ نَبِّئۡ عِبَادِيٓ أَنِّيٓ أَنَا ٱلۡغَفُورُ ٱلرَّحِيمُ ٩٤\n                                    \n                                    \n                                    قوله تعالى : نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم هذه الآية وزان قوله - عليه السلام - : لو يعلم المؤمن ما عند الله من العقوبة ما طمع بجنته أحد ولو يعلم الكافر ما عند الله من الرحمة ما قنط من رحمته أحد أخرجه مسلم من حديث أبي هريرة . وقد تقدم في الفاتحة . وهكذا ينبغي للإنسان أن يذكر نفسه وغيره فيخوف ويرجي ، ويكون الخوف في الصحة أغلب عليه منه في المرض . وجاء في الحديث أن النبي - صلى الله عليه وسلم - خرج على الصحابة وهم يضحكون فقال : أتضحكون وبين أيديكم الجنة والنار فشق ذلك عليهم فنزلت الآية . ذكره الماوردي والمهدوي . ولفظ الثعلبي عن ابن عمر قال : اطلع علينا النبي - صلى الله عليه وسلم - من الباب الذي يدخل منه بنو شيبة ونحن نضحك فقال : مالكم تضحكون لا أراكم تضحكون ثم أدبر حتى إذا كان عند الحجر رجع القهقرى فقال لنا : إني لما خرجت جاءني جبريل فقال يا محمد لم تقنط عبادي من رحمتي نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم .\nفالقنوط إياس ، والرجاء إهمال ، وخير الأمور أوساطها .\n                                    ",
      "saadi": "۞ نَبِّئۡ عِبَادِيٓ أَنِّيٓ أَنَا ٱلۡغَفُورُ ٱلرَّحِيمُ ٩٤\n                                        \n                                        \n                                        \n                                        ولما ذكر ما يوجب الرغبة والرهبة من مفعولات الله من الجنة والنار، ذكر ما يوجب ذلك من أوصافه تعالى فقال: { نَبِّئْ عِبَادِي } أي: أخبرهم خبرا جازما مؤيدا بالأدلة، { أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ } فإنهم إذا عرفوا كمال رحمته، ومغفرته سَعَوا في الأسباب الموصلة لهم إلى رحمته وأقلعوا عن الذنوب وتابوا منها، لينالوا مغفرته.\n                                    "
    }
  },
  {
    "id": 49,
    "versesNumber": 50,
    "souraName": "Al-Hijr.html",
    "contnent": "وَأَنَّ عَذَابِي هُوَ ٱلۡعَذَابُ ٱلۡأَلِيمُ ٠٥",
    "tafsier": {
      "ibnkther": "وَأَنَّ عَذَابِي هُوَ ٱلۡعَذَابُ ٱلۡأَلِيمُ ٠٥\n                                    \n                                    \n                                    أي أخبر يا محمد عبادي أنى ذو رحمة وذو عذاب أليم وقد تقدم ذكر نظير هذه الآية الكريمة وهي دالة على مقامي الرجاء والخوف.\n                                    ",
      "qortoby": "وَأَنَّ عَذَابِي هُوَ ٱلۡعَذَابُ ٱلۡأَلِيمُ ٠٥\n                                    \n                                    \n                                    قوله تعالى : نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم هذه الآية وزان قوله - عليه السلام - : لو يعلم المؤمن ما عند الله من العقوبة ما طمع بجنته أحد ولو يعلم الكافر ما عند الله من الرحمة ما قنط من رحمته أحد أخرجه مسلم من حديث أبي هريرة . وقد تقدم في الفاتحة . وهكذا ينبغي للإنسان أن يذكر نفسه وغيره فيخوف ويرجي ، ويكون الخوف في الصحة أغلب عليه منه في المرض . وجاء في الحديث أن النبي - صلى الله عليه وسلم - خرج على الصحابة وهم يضحكون فقال : أتضحكون وبين أيديكم الجنة والنار فشق ذلك عليهم فنزلت الآية . ذكره الماوردي والمهدوي . ولفظ الثعلبي عن ابن عمر قال : اطلع علينا النبي - صلى الله عليه وسلم - من الباب الذي يدخل منه بنو شيبة ونحن نضحك فقال : مالكم تضحكون لا أراكم تضحكون ثم أدبر حتى إذا كان عند الحجر رجع القهقرى فقال لنا : إني لما خرجت جاءني جبريل فقال يا محمد لم تقنط عبادي من رحمتي نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم .\nفالقنوط إياس ، والرجاء إهمال ، وخير الأمور أوساطها .\n                                    ",
      "saadi": "وَأَنَّ عَذَابِي هُوَ ٱلۡعَذَابُ ٱلۡأَلِيمُ ٠٥\n                                        \n                                        \n                                        \n                                        ومع هذا فلا ينبغي أن يتمادى بهم الرجاء إلى حال الأمن والإدلال، فنبئهم { وَأَنَّ عَذَابِي هُوَ الْعَذَابُ الْأَلِيمُ } أي: لا عذاب في الحقيقة إلا عذاب الله الذي لا يقادر قدره ولا يبلغ كنهه نعوذ به من عذابه، فإنهم إذا عرفوا أنه { لا يعذب عذابه أحد ولا يوثق وثاقه أحد } حذروا وأبعدوا عن كل سبب يوجب لهم العقاب، فالعبد ينبغي أن يكون قلبه دائما بين الخوف والرجاء، والرغبة والرهبة، فإذا نظر إلى رحمة ربه ومغفرته وجوده وإحسانه، أحدث له ذلك الرجاء والرغبة، وإذا نظر إلى ذنوبه وتقصيره في حقوق ربه، أحدث له الخوف والرهبة والإقلاع عنها.\n                                    "
    }
  },
  {
    "id": 50,
    "versesNumber": 51,
    "souraName": "Al-Hijr.html",
    "contnent": "وَنَبِّئۡهُمۡ عَن ضَيۡفِ إِبۡرَٰهِيمَ ١٥",
    "tafsier": {
      "ibnkther": "وَنَبِّئۡهُمۡ عَن ضَيۡفِ إِبۡرَٰهِيمَ ١٥\n                                    \n                                    \n                                    يقول تعالى وأخبرهم يا محمد عن قصة ضيف إبراهيم والضيف يطلق على الواحد والجمع كالزور والسفر.\n                                    ",
      "qortoby": "وَنَبِّئۡهُمۡ عَن ضَيۡفِ إِبۡرَٰهِيمَ ١٥\n                                    \n                                    \n                                    ضيف إبراهيم : الملائكة الذين بشروه بالولد وبهلاك قوم لوط .\nوقد تقدم ذكرهم .\nوكان إبراهيم عليه السلام يكنى أبا الضيفان , وكان لقصره أربعة أبواب لكيلا يفوته أحد .\nوسمي الضيف ضيفا لإضافته إليك ونزوله عليك .\nوقد مضى من حكم الضيف في \" هود \" ما يكفي والحمد لله .\n                                    ",
      "saadi": "وَنَبِّئۡهُمۡ عَن ضَيۡفِ إِبۡرَٰهِيمَ ١٥\n                                        \n                                        \n                                        \n                                        يقول تعالى لنبيه محمد صلى الله عليه وسلم: { وَنَبِّئْهُمْ عَنْ ضَيْفِ إِبْرَاهِيمَ } أي: عن تلك القصة العجيبة فإن في قصك عليهم أنباء الرسل وما جرى لهم ما يوجب لهم العبرة والاقتداء بهم، خصوصا إبراهيم الخليل، الذي أمرنا الله أن نتبع ملته، وضيفه هم الملائكة الكرام أكرمه الله بأن جعلهم أضيافه.\n                                    "
    }
  },
  {
    "id": 51,
    "versesNumber": 52,
    "souraName": "Al-Hijr.html",
    "contnent": "إِذۡ دَخَلُواْ عَلَيۡهِ فَقَالُواْ سَلَٰمٗا قَالَ إِنَّا مِنكُمۡ وَجِلُونَ ٢٥",
    "tafsier": {
      "ibnkther": "إِذۡ دَخَلُواْ عَلَيۡهِ فَقَالُواْ سَلَٰمٗا قَالَ إِنَّا مِنكُمۡ وَجِلُونَ ٢٥\n                                    \n                                    \n                                    وكيف دخلوا عليه فقالوا سلاما \" قال إنا منكم وجلون \" أي خائفون وقد ذكر سبب خوفه منهم لما رأى أيديهم لا تصل إلى ما قربه إليهم من الضيافة وهو العجل السمين الحنيذ.\n                                    ",
      "qortoby": "إِذۡ دَخَلُواْ عَلَيۡهِ فَقَالُواْ سَلَٰمٗا قَالَ إِنَّا مِنكُمۡ وَجِلُونَ ٢٥\n                                    \n                                    \n                                    إذ دخلوا عليه جمع الخبر لأن الضيف اسم يصلح للواحد والجمع والتثنية والمذكر والمؤنث كالمصدر . ضافه وأضافه أماله ; ومنه الحديث ( حين تضيف الشمس للغروب ) ، وضيفوفة السهم ، والإضافة النحوية .\nفقالوا سلاما أي سلموا سلاما .\nقال إنا منكم وجلون أي فزعون خائفون ، وإنما قال هذا بعد أن قرب العجل ورآهم لا يأكلون ، على ما تقدم في هود . وقيل : أنكر السلام ولم يكن في بلادهم رسم السلام .\n                                    ",
      "saadi": "إِذۡ دَخَلُواْ عَلَيۡهِ فَقَالُواْ سَلَٰمٗا قَالَ إِنَّا مِنكُمۡ وَجِلُونَ ٢٥\n                                        \n                                        \n                                        \n                                        { إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًا } أي: سلموا عليه فرد عليهم { قَالَ إِنَّا مِنْكُمْ وَجِلُونَ } أي: خائفون، لأنه لما دخلوا عليه وحسبهم ضيوفا ذهب مسرعا إلى بيته فأحضر لهم ضيافتهم، عجلا حنيذا فقدمه إليهم، فلما رأى أيديهم لا تصل، إليه خاف منهم أن يكونوا لصوصا أو نحوهم.\n                                    "
    }
  },
  {
    "id": 52,
    "versesNumber": 53,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالُواْ لَا تَوۡجَلۡ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ عَلِيمٖ ٣٥",
    "tafsier": {
      "ibnkther": "قَالُواْ لَا تَوۡجَلۡ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ عَلِيمٖ ٣٥\n                                    \n                                    \n                                    \" قالوا لا توجل \" أي لا تخف وبشروه \" بغلام عليم \" أى إسحاق \" كما تقدم في سورة هود.\n                                    ",
      "qortoby": "قَالُواْ لَا تَوۡجَلۡ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ عَلِيمٖ ٣٥\n                                    \n                                    \n                                    قَالُوا لَا تَوْجَلْ\nأي قالت الملائكة لا تخف .إِنَّا نُبَشِّرُكَ بِغُلَامٍ عَلِيمٍ\nأي حليم ; قاله مقاتل .\nوقال الجمهور : عالم .\nوهو إسحاق .\n                                    ",
      "saadi": "قَالُواْ لَا تَوۡجَلۡ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ عَلِيمٖ ٣٥\n                                        \n                                        \n                                        \n                                        فـ { قَالُوا } له: { لَا تَوْجَلْ إِنَّا نُبَشِّرُكَ بِغُلَامٍ عَلِيمٍ } وهو إسحاق عليه الصلاة والسلام، تضمنت هذه البشارة بأنه ذكر لا أنثى عليم أي: كثير العلم، وفي الآية الأخرى { وَبَشَّرْنَاهُ بِإِسْحَاقَ نَبِيًّا مِنَ الصَّالِحِينَ }\n                                    "
    }
  },
  {
    "id": 53,
    "versesNumber": 54,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ أَبَشَّرۡتُمُونِي عَلَىٰٓ أَن مَّسَّنِيَ ٱلۡكِبَرُ فَبِمَ تُبَشِّرُونَ ٤٥",
    "tafsier": {
      "ibnkther": "قَالَ أَبَشَّرۡتُمُونِي عَلَىٰٓ أَن مَّسَّنِيَ ٱلۡكِبَرُ فَبِمَ تُبَشِّرُونَ ٤٥\n                                    \n                                    \n                                    ثم \" قال \"متعجبا من كبره وكبر زوجته ومتحققا للوعد \" أبشرتموني على أن مسني الكبر فبم تبشرون \" فأجابوه مؤكدين لما بشروه به تحقيقا وبشارة بعد بشارة.\n                                    ",
      "qortoby": "قَالَ أَبَشَّرۡتُمُونِي عَلَىٰٓ أَن مَّسَّنِيَ ٱلۡكِبَرُ فَبِمَ تُبَشِّرُونَ ٤٥\n                                    \n                                    \n                                    قال أبشرتموني على أن مسني الكبر أن مصدرية ; أي على مس الكبر إياي وزوجتي ، وقد تقدم في هود وإبراهيم ،\nفبم تبشرون استفهام تعجب . وقيل : استفهام حقيقي . وقرأ الحسن \" توجل \" بضم التاء . والأعمش \" بشرتموني \" بغير ألف ، ونافع وشيبة \" تبشرون بكسر النون والتخفيف ; مثل ، أتحاجونني وقد تقدم تعليله . وقرأ ابن كثير وابن محيصن تبشرون بكسر النون مشددة ، تقديره تبشرونني ، فأدغم النون في النون . الباقون \" تبشرون \" بنصب النون بغير إضافة .\n                                    ",
      "saadi": "قَالَ أَبَشَّرۡتُمُونِي عَلَىٰٓ أَن مَّسَّنِيَ ٱلۡكِبَرُ فَبِمَ تُبَشِّرُونَ ٤٥\n                                        \n                                        \n                                        \n                                        فقال لهم متعجبا من هذه البشارة: { أَبَشَّرْتُمُونِي } بالولد { عَلَى أَنْ مَسَّنِيَ الْكِبَرُ } وصار نوع إياس منه { فَبِمَ تُبَشِّرُونَ } أي: على أي وجه تبشرون وقد عدمت الأسباب؟\n                                    "
    }
  },
  {
    "id": 54,
    "versesNumber": 55,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالُواْ بَشَّرۡنَٰكَ بِٱلۡحَقِّ فَلَا تَكُن مِّنَ ٱلۡقَٰنِطِينَ ٥٥",
    "tafsier": {
      "ibnkther": "قَالُواْ بَشَّرۡنَٰكَ بِٱلۡحَقِّ فَلَا تَكُن مِّنَ ٱلۡقَٰنِطِينَ ٥٥\n                                    \n                                    \n                                    \" قالوا بشرناك بالحق فلا تكن من القانطين \" وقرأ بعضهم القنطين.\n                                    ",
      "qortoby": "قَالُواْ بَشَّرۡنَٰكَ بِٱلۡحَقِّ فَلَا تَكُن مِّنَ ٱلۡقَٰنِطِينَ ٥٥\n                                    \n                                    \n                                    قوله تعالى : قالوا بشرناك بالحق فلا تكن من القانطين قوله تعالى : قالوا بشرناك بالحق أي بما لا خلف فيه ، وأن الولد لا بد منه .\nفلا تكن من القانطين أي من الآيسين من الولد ، وكان قد أيس من الولد لفرط الكبر . وقراءة العامة من القانطين بالألف . وقرأ الأعمش ويحيى بن وثاب من القنطين بلا ألف . وروي عن أبي عمرو . وهو مقصور من القانطين . ويجوز أن يكون من لغة من قال : قنط يقنط ; مثل حذر يحذر . وفتح النون وكسرها من يقنط لغتان قرئ بهما . وحكي فيه \" يقنط \" بالضم . ولم يأت فيه \" قنط يقنط \" [ و ] من فتح النون في الماضي والمستقبل فإنه جمع بين اللغتين ، فأخذ في الماضي بلغة من قال : قنط يقنط ، وفي المستقبل بلغة من قال : قنط يقنط ; ذكره المهدوي .\n                                    ",
      "saadi": "قَالُواْ بَشَّرۡنَٰكَ بِٱلۡحَقِّ فَلَا تَكُن مِّنَ ٱلۡقَٰنِطِينَ ٥٥\n                                        \n                                        \n                                        \n                                        { قَالُوا بَشَّرْنَاكَ بِالْحَقِّ } الذي لا شك فيه لأن الله على كل شيء قدير، وأنتم بالخصوص -يا أهل هذا البيت- رحمة الله وبركاته عليكم فلا يستغرب فضل الله وإحسانه إليكم.\n{ فَلَا تَكُنْ مِنَ الْقَانِطِينَ } الذين يستبعدون وجود الخير، بل لا تزال راجيا لفضل الله وإحسانه، وبره وامتنانه،\n                                    "
    }
  },
  {
    "id": 55,
    "versesNumber": 56,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ وَمَن يَقۡنَطُ مِن رَّحۡمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ ٦٥",
    "tafsier": {
      "ibnkther": "قَالَ وَمَن يَقۡنَطُ مِن رَّحۡمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ ٦٥\n                                    \n                                    \n                                    فأجابهم بأنه ليس يقنط ولكن يرجو من الله الولد وإن كان قد كبر وأسنت امرأته فإنه يعلم من قدرة الله ورحمته ما هو أبلغ من ذلك.\n                                    ",
      "qortoby": "قَالَ وَمَن يَقۡنَطُ مِن رَّحۡمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ ٦٥\n                                    \n                                    \n                                    قوله تعالى : قال ومن يقنط من رحمة ربه إلا الضالون أي المكذبون الذاهبون عن طريق الصواب . يعني أنه استبعد الولد لكبر سنه لا أنه قنط من رحمة الله - تعالى - .\n                                    ",
      "saadi": "قَالَ وَمَن يَقۡنَطُ مِن رَّحۡمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ ٦٥\n                                        \n                                        \n                                        \n                                        فأجابهم إبراهيم بقوله: { وَمَنْ يَقْنَطُ مِنْ رَحْمَةِ رَبِّهِ إِلَّا الضَّالُّونَ } الذين لا علم لهم بربهم، وكمال اقتداره وأما من أنعم الله عليه بالهداية والعلم العظيم، فلا سبيل إلى القنوط إليه لأنه يعرف من كثرة الأسباب والوسائل والطرق لرحمة الله شيئا كثيرا، ثم لما بشروه بهذه البشارة، عرف أنهم مرسلون لأمر مهم.\n                                    "
    }
  },
  {
    "id": 56,
    "versesNumber": 57,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ فَمَا خَطۡبُكُمۡ أَيُّهَا ٱلۡمُرۡسَلُونَ ٧٥",
    "tafsier": {
      "ibnkther": "قَالَ فَمَا خَطۡبُكُمۡ أَيُّهَا ٱلۡمُرۡسَلُونَ ٧٥\n                                    \n                                    \n                                    يقول تعالى إخبارا عن إبراهيم عليه السلام لما ذهب عنه الروع وجاءته البشرى أنه شرع يسألهم عما جاءوا له.\n                                    ",
      "qortoby": "قَالَ فَمَا خَطۡبُكُمۡ أَيُّهَا ٱلۡمُرۡسَلُونَ ٧٥\n                                    \n                                    \n                                    لما علم أنهم ملائكة - إذ أخبروه بأمر خارق للعادة وهو بشراهم بالولد - قال : فما خطبكم ؟ والخطب الأمر الخطير .\nأي فما أمركم وشأنكم وما الذي جئتم به .\n                                    ",
      "saadi": "قَالَ فَمَا خَطۡبُكُمۡ أَيُّهَا ٱلۡمُرۡسَلُونَ ٧٥\n                                        \n                                        \n                                        \n                                        أي: { قَالَ } الخليل عليه السلام للملائكة: { فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ } أي: ما شأنكم ولأي شيء أرسلتم؟\n                                    "
    }
  },
  {
    "id": 57,
    "versesNumber": 58,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالُوٓاْ إِنَّآ أُرۡسِلۡنَآ إِلَىٰ قَوۡمٖ مُّجۡرِمِينَ ٨٥",
    "tafsier": {
      "ibnkther": "قَالُوٓاْ إِنَّآ أُرۡسِلۡنَآ إِلَىٰ قَوۡمٖ مُّجۡرِمِينَ ٨٥\n                                    \n                                    \n                                    فقالوا إنا أرسلنا إلى قوم مجرمين \" يعنون قوم لوط.\n                                    ",
      "qortoby": "قَالُوٓاْ إِنَّآ أُرۡسِلۡنَآ إِلَىٰ قَوۡمٖ مُّجۡرِمِينَ ٨٥\n                                    \n                                    \n                                    أي مشركين ضالين .\nوفي الكلام إضمار ; أي أرسلنا إلى قوم مجرمين لنهلكهم .\n                                    ",
      "saadi": "قَالُوٓاْ إِنَّآ أُرۡسِلۡنَآ إِلَىٰ قَوۡمٖ مُّجۡرِمِينَ ٨٥\n                                        \n                                        \n                                        \n                                        { قَالُوا إِنَّا أُرْسِلْنَا إِلَى قَوْمٍ مُجْرِمِينَ } أي: كثر فسادهم وعظم شرهم، لنعذبهم ونعاقبهم\n                                    "
    }
  },
  {
    "id": 58,
    "versesNumber": 59,
    "souraName": "Al-Hijr.html",
    "contnent": "إِلَّآ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمۡ أَجۡمَعِينَ ٩٥",
    "tafsier": {
      "ibnkther": "إِلَّآ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمۡ أَجۡمَعِينَ ٩٥\n                                    \n                                    \n                                    وأخبروه أنهم سينجون آل لوط من بينهم.\n                                    ",
      "qortoby": "إِلَّآ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمۡ أَجۡمَعِينَ ٩٥\n                                    \n                                    \n                                    إِلَّا آلَ لُوطٍ\nأتباعه وأهل دينه .إِنَّا لَمُنَجُّوهُمْ أَجْمَعِينَ\nوقرأ حمزة والكسائي \" لمنجوهم \" بالتخفيف من أنجى .\nالباقون : بالتشديد من نجى , واختاره أبو عبيد وأبو حاتم .\nوالتنجية والإنجاء التخليص .\n                                    ",
      "saadi": "إِلَّآ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمۡ أَجۡمَعِينَ ٩٥\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 59 و 60 :ـ\n{ إِلَّا آلَ لُوطٍ } أي: إلا لوطا وأهله { إِلَّا امْرَأَتَهُ قَدَّرْنَا إِنَّهَا لَمِنَ الْغَابِرِينَ } أي: الباقين بالعذاب، وأما لوط فسنخرجنه وأهله وننجيهم منها، فجعل إبراهيم يجادل الرسل في إهلاكهم ويراجعهم، فقيل له: { يا إبراهيم أعرض عن هذا إنه قد جاء أمر ربك وإنهم آتيهم عذاب غير مردود } فذهبوا منه.\n                                    "
    }
  },
  {
    "id": 59,
    "versesNumber": 60,
    "souraName": "Al-Hijr.html",
    "contnent": "إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَآ إِنَّهَا لَمِنَ ٱلۡغَٰبِرِينَ ٠٦",
    "tafsier": {
      "ibnkther": "إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَآ إِنَّهَا لَمِنَ ٱلۡغَٰبِرِينَ ٠٦\n                                    \n                                    \n                                    إلا امرأته فإنها من الهالكين ولهذا قالوا \" إلا امرأته قدرنا إنها لمن الغابرين \" أي الباقين المهلكين.\n                                    ",
      "qortoby": "إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَآ إِنَّهَا لَمِنَ ٱلۡغَٰبِرِينَ ٠٦\n                                    \n                                    \n                                    إلا امرأته قدرنا إنها لمن الغابرين إلا امرأته استثنى من آل لوط امرأته وكانت كافرة فالتحقت بالمجرمين في الهلاك . وقد تقدمت قصة قوم لوط في \" الأعراف \" وسورة \" هود \" بما فيه كفاية . قدرنا إنها لمن الغابرين أي قضينا وكتبنا إنها لمن الباقين في العذاب . والغابر : الباقي . قال :\nلا تكسع الشول بأغبارها إنك لا تدري من الناتج\nالأغبار بقايا اللبن . وقرأ أبو بكر والمفضل \" قدرنا \" بالتخفيف هنا وفي النمل ، وشدد الباقون . الهروي : يقال قدر وقدر ، بمعنى .\nلا خلاف بين أهل اللسان وغيرهم أن الاستثناء من النفي إثبات ومن الإثبات نفي ; فإذا قال رجل : له علي عشرة دراهم إلا أربعة إلا درهما ; ثبت الإقرار بسبعة ; لأن الدرهم مستثنى من الأربعة ، وهو مثبت لأنه مستثنى من منفي ، وكانت الأربعة منفية لأنها مستثناة من موجب وهو العشرة ، فعاد الدرهم إلى الستة فصارت سبعة . وكذلك لو قال : علي خمسة دراهم إلا درهما إلا ثلثيه ; كان عليه أربعة دراهم وثلث . وكذلك إذا قال : لفلان علي عشرة إلا تسعة إلا ثمانية إلا سبعة ; كان الاستثناء الثاني راجعا إلى ما قبله ، والثالث إلى الثاني فيكون عليه درهمان ; لأن العشرة إثبات والثمانية إثبات فيكون مجموعها ثمانية عشر . والتسعة نفي والسبعة نفي فيكون ستة عشر تسقط من ثمانية عشر ويبقى درهمان ، وهو القدر الواجب بالإقرار لا غير . فقوله سبحانه : إنا أرسلنا إلى قوم مجرمين إلا آل لوط إنا لمنجوهم أجمعين إلا امرأته فاستثنى آل لوط من القوم المجرمين ، ثم قال : إلا امرأته فاستثناها من آل لوط ، فرجعت في التأويل إلى القوم المجرمين كما بينا . وهكذا الحكم في الطلاق ، لو قال لزوجته : أنت طالق ثلاثا إلا اثنتين إلا واحدة طلقت اثنتين ; لأن الواحدة رجعت إلى الباقي من المستثنى منه وهي الثلاث . وكذا كل ما جاء من هذا ، فتفهمه .\n                                    ",
      "saadi": "إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَآ إِنَّهَا لَمِنَ ٱلۡغَٰبِرِينَ ٠٦\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 59 و 60 :ـ\n{ إِلَّا آلَ لُوطٍ } أي: إلا لوطا وأهله { إِلَّا امْرَأَتَهُ قَدَّرْنَا إِنَّهَا لَمِنَ الْغَابِرِينَ } أي: الباقين بالعذاب، وأما لوط فسنخرجنه وأهله وننجيهم منها، فجعل إبراهيم يجادل الرسل في إهلاكهم ويراجعهم، فقيل له: { يا إبراهيم أعرض عن هذا إنه قد جاء أمر ربك وإنهم آتيهم عذاب غير مردود } فذهبوا منه.\n                                    "
    }
  },
  {
    "id": 60,
    "versesNumber": 61,
    "souraName": "Al-Hijr.html",
    "contnent": "فَلَمَّا جَآءَ ءَالَ لُوطٍ ٱلۡمُرۡسَلُونَ ١٦",
    "tafsier": {
      "ibnkther": "فَلَمَّا جَآءَ ءَالَ لُوطٍ ٱلۡمُرۡسَلُونَ ١٦\n                                    \n                                    \n                                    يخبر تعالى عن لوط لما جاءته الملائكة في صورة شباب حسان الوجوه فدخلوا عليه داره.\n                                    ",
      "qortoby": "فَلَمَّا جَآءَ ءَالَ لُوطٍ ٱلۡمُرۡسَلُونَ ١٦\n                                    \n                                    \n                                    فَلَمَّا جَاءَ آلَ لُوطٍ الْمُرْسَلُونَ\n                                    ",
      "saadi": "فَلَمَّا جَآءَ ءَالَ لُوطٍ ٱلۡمُرۡسَلُونَ ١٦\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 61 و 62 :ـ\n{ فَلَمَّا جَاءَ آلَ لُوطٍ الْمُرْسَلُونَ قَالَ } لهم لوط { إِنَّكُمْ قَوْمٌ مُنْكَرُونَ } أي: لا أعرفكم ولا أدري من أنتم.\n                                    "
    }
  },
  {
    "id": 61,
    "versesNumber": 62,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ إِنَّكُمۡ قَوۡمٞ مُّنكَرُونَ ٢٦",
    "tafsier": {
      "ibnkther": "قَالَ إِنَّكُمۡ قَوۡمٞ مُّنكَرُونَ ٢٦\n                                    \n                                    \n                                    قال إنكم قوم منكرون.\n                                    ",
      "qortoby": "قَالَ إِنَّكُمۡ قَوۡمٞ مُّنكَرُونَ ٢٦\n                                    \n                                    \n                                    أي لا أعرفكم .\nوقيل : كانوا شبابا ورأى جمالا فخاف عليهم من فتنة قومه ; فهذا هو الإنكار .\n                                    ",
      "saadi": "قَالَ إِنَّكُمۡ قَوۡمٞ مُّنكَرُونَ ٢٦\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 61 و 62 :ـ\n{ فَلَمَّا جَاءَ آلَ لُوطٍ الْمُرْسَلُونَ قَالَ } لهم لوط { إِنَّكُمْ قَوْمٌ مُنْكَرُونَ } أي: لا أعرفكم ولا أدري من أنتم.\n                                    "
    }
  },
  {
    "id": 62,
    "versesNumber": 63,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالُواْ بَلۡ جِئۡنَٰكَ بِمَا كَانُواْ فِيهِ يَمۡتَرُونَ ٣٦",
    "tafsier": {
      "ibnkther": "قَالُواْ بَلۡ جِئۡنَٰكَ بِمَا كَانُواْ فِيهِ يَمۡتَرُونَ ٣٦\n                                    \n                                    \n                                    \"قالوا بل جئناك بما كانوا فيه يمترون\" يعنون بعذابهم وهلاكهم ودمارهم الذي كانوا يشكون في وقوعه بهم وحلوله بساحتهم.\n                                    ",
      "qortoby": "قَالُواْ بَلۡ جِئۡنَٰكَ بِمَا كَانُواْ فِيهِ يَمۡتَرُونَ ٣٦\n                                    \n                                    \n                                    قالوا بل جئناك بما كانوا فيه يمترون\nأي يشكون أنه نازل بهم , وهو العذاب .\n                                    ",
      "saadi": "قَالُواْ بَلۡ جِئۡنَٰكَ بِمَا كَانُواْ فِيهِ يَمۡتَرُونَ ٣٦\n                                        \n                                        \n                                        \n                                        { قَالُوا بَلْ جِئْنَاكَ بِمَا كَانُوا فِيهِ يَمْتَرُونَ } أي: جئناك بعذابهم الذي كانوا يشكون فيه ويكذبونك حين تعدهم به\n                                    "
    }
  },
  {
    "id": 63,
    "versesNumber": 64,
    "souraName": "Al-Hijr.html",
    "contnent": "وَأَتَيۡنَٰكَ بِٱلۡحَقِّ وَإِنَّا لَصَٰدِقُونَ ٤٦",
    "tafsier": {
      "ibnkther": "وَأَتَيۡنَٰكَ بِٱلۡحَقِّ وَإِنَّا لَصَٰدِقُونَ ٤٦\n                                    \n                                    \n                                    \"وأتيناك بالحق\" كقوله تعالى \"ما ننزل الملائكة إلا بالحق\" وقوله \"وإنا لصادقون\" تأكيد لخبرهم إياه بما أخبروه به من نجاته وإهلاك قومه.\n                                    ",
      "qortoby": "وَأَتَيۡنَٰكَ بِٱلۡحَقِّ وَإِنَّا لَصَٰدِقُونَ ٤٦\n                                    \n                                    \n                                    وأتيناك بالحق\nأي بالصدق . وقيل : بالعذاب .وإنا لصادقون\nأي في هلاكهم .\n                                    ",
      "saadi": "وَأَتَيۡنَٰكَ بِٱلۡحَقِّ وَإِنَّا لَصَٰدِقُونَ ٤٦\n                                        \n                                        \n                                        \n                                        { وَأَتَيْنَاكَ بِالْحَقِّ } الذي ليس بالهزل { وَإِنَّا لَصَادِقُونَ } فيما قلنا لك.\n                                    "
    }
  },
  {
    "id": 64,
    "versesNumber": 65,
    "souraName": "Al-Hijr.html",
    "contnent": "فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعٖ مِّنَ ٱلَّيۡلِ وَٱتَّبِعۡ أَدۡبَٰرَهُمۡ وَلَا يَلۡتَفِتۡ مِنكُمۡ أَحَدٞ وَٱمۡضُواْ حَيۡثُ تُؤۡمَرُونَ ٥٦ ",
    "tafsier": {
      "ibnkther": "فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعٖ مِّنَ ٱلَّيۡلِ وَٱتَّبِعۡ أَدۡبَٰرَهُمۡ وَلَا يَلۡتَفِتۡ مِنكُمۡ أَحَدٞ وَٱمۡضُواْ حَيۡثُ تُؤۡمَرُونَ ٥٦\n                                    \n                                    \n                                    يذكر تعالى عن الملائكة أنهم أمروه أن يسري بأهله بعد مضي جانب من الليل ، وأن يكون لوط - عليه السلام - يمشي وراءهم ، ليكون أحفظ لهم .\nوهكذا كان رسول الله - صلى الله عليه وسلم - يمشي في الغزاة بما كان يكون ساقة ، يزجي الضعيف ، ويحمل المنقطع\nوقوله : ( ولا يلتفت منكم أحد ) أي : إذا سمعتم الصيحة بالقوم فلا تلتفتوا إليهم ، وذروهم فيما حل بهم من العذاب والنكال ، ( وامضوا حيث تؤمرون ) كأنه كان معهم من يهديهم السبيل .\n                                    ",
      "qortoby": "فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعٖ مِّنَ ٱلَّيۡلِ وَٱتَّبِعۡ أَدۡبَٰرَهُمۡ وَلَا يَلۡتَفِتۡ مِنكُمۡ أَحَدٞ وَٱمۡضُواْ حَيۡثُ تُؤۡمَرُونَ ٥٦\n                                    \n                                    \n                                    فأسر بأهلك بقطع من الليل فأسر بأهلك قرئ \" فاسر \" بوصل الألف وقطعها ; لغتان فصيحتان . قال الله - تعالى - : والليل إذا يسر وقال : سبحان الذي أسرى وقال النابغة : فجمع بين اللغتين :\nأسرت عليه من الجوزاء سارية تزجي الشمال عليه جامد البرد\nوقال آخر :\nحي النضيرة ربة الخدر أسرت إليك ولم تكن تسري\nوقد قيل : فأسر بالقطع إذا سار من أول الليل ، وسرى إذا سار من آخره ; ولا يقال في النهار إلا سار . وقال لبيد :\nإذا المرء أسرى ليلة ظن أنه قضى عملا والمرء ما عاش عامل\nوقال عبد الله بن رواحة :\nعند الصباح يحمد القوم السرى وتنجلي عنهم غيابات الكرى\nبقطع من الليل قال ابن عباس : ( بطائفة من الليل ) . الضحاك : ببقية من الليل . وقيل : بظلمة من الليل . وقيل : بعد هدء من الليل . وقيل : هزيع من الليل . وكلها متقاربة ; وقيل إنه نصف الليل ; مأخوذ من قطعه نصفين ; ومنه قول الشاعر :\nونائحة تنوح بقطع ليل على رجل بقارعة الصعيد\nفإن قيل : السرى لا يكون إلا بالليل ، فما معنى بقطع من الليل ؟ فالجواب : أنه لو لم يقل : بقطع من الليل جاز أن يكون أوله .\nواتبع أدبارهم أي كن من ورائهم لئلا يتخلف منهم أحد فيناله العذاب .\nولا يلتفت منكم أحد نهوا عن الالتفات ليجدوا في السير ويتباعدوا عن القرية قبل أن يفاجئهم الصبح . وقيل : المعنى لا يتخلف .\nوامضوا حيث تؤمرون قال ابن عباس ( يعني الشام ) . مقاتل . يعني صفد ، قرية من قرى لوط . وقد تقدم . وقيل : إنه مضى إلى أرض الخليل بمكان يقال له اليقين ، وإنما سمي اليقين لأن إبراهيم لما خرجت الرسل شيعهم ، فقال لجبريل : من أين يخسف بهم ؟ قال : ( من هاهنا ) وحد له حدا ، وذهب جبريل ، فلما جاء لوط . جلس عند إبراهيم وارتقبا ذلك العذاب ، فلما اهتزت الأرض قال إبراهيم : ( أيقنت بالله ) فسمي اليقين .\n                                    ",
      "saadi": "فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعٖ مِّنَ ٱلَّيۡلِ وَٱتَّبِعۡ أَدۡبَٰرَهُمۡ وَلَا يَلۡتَفِتۡ مِنكُمۡ أَحَدٞ وَٱمۡضُواْ حَيۡثُ تُؤۡمَرُونَ ٥٦\n                                        \n                                        \n                                        \n                                        { فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِنَ اللَّيْلِ } أي: في أثنائه حين تنام العيون ولا يدري أحد عن مسراك، { وَلَا يَلْتَفِتْ مِنْكُمْ أَحَدٌ } أي: بادروا وأسرعوا، { وَامْضُوا حَيْثُ تُؤْمَرُونَ } كأن معهم دليلا يدلهم إلى أين يتوجهون\n                                    "
    }
  },
  {
    "id": 65,
    "versesNumber": 66,
    "souraName": "Al-Hijr.html",
    "contnent": "وَقَضَيۡنَآ إِلَيۡهِ ذَٰلِكَ ٱلۡأَمۡرَ أَنَّ دَابِرَ هَٰٓؤُلَآءِ مَقۡطُوعٞ مُّصۡبِحِينَ ٦٦",
    "tafsier": {
      "ibnkther": "وَقَضَيۡنَآ إِلَيۡهِ ذَٰلِكَ ٱلۡأَمۡرَ أَنَّ دَابِرَ هَٰٓؤُلَآءِ مَقۡطُوعٞ مُّصۡبِحِينَ ٦٦\n                                    \n                                    \n                                    ( وقضينا إليه ذلك الأمر ) أي : تقدمنا إليه في هذا ( أن دابر هؤلاء مقطوع مصبحين ) أي : وقت الصباح كما قال في الآية الأخرى : ( إن موعدهم الصبح أليس الصبح بقريب ) [ هود : 81 ]\n                                    ",
      "qortoby": "وَقَضَيۡنَآ إِلَيۡهِ ذَٰلِكَ ٱلۡأَمۡرَ أَنَّ دَابِرَ هَٰٓؤُلَآءِ مَقۡطُوعٞ مُّصۡبِحِينَ ٦٦\n                                    \n                                    \n                                    وَقَضَيْنَا إِلَيْهِ\nأي أوحينا إلى لوط .أَنَّ دَابِرَ هَؤُلَاءِ مَقْطُوعٌ مُصْبِحِينَ\nنظيره \" فقطع دابر القوم الذين ظلموا \" .\n[ الأنعام : 45 ] \" مصبحين \" أي عند طلوع الصبح .\nوقد تقدم .\n                                    ",
      "saadi": "وَقَضَيۡنَآ إِلَيۡهِ ذَٰلِكَ ٱلۡأَمۡرَ أَنَّ دَابِرَ هَٰٓؤُلَآءِ مَقۡطُوعٞ مُّصۡبِحِينَ ٦٦\n                                        \n                                        \n                                        \n                                        { وَقَضَيْنَا إِلَيْهِ ذَلِكَ } أي: أخبرناه خبرا لا مثنوية فيه، { أَنَّ دَابِرَ هَؤُلَاءِ مَقْطُوعٌ مُصْبِحِينَ } أي: سيصبحهم العذاب الذي يجتاحهم ويستأصلهم\n                                    "
    }
  },
  {
    "id": 66,
    "versesNumber": 67,
    "souraName": "Al-Hijr.html",
    "contnent": "وَجَآءَ أَهۡلُ ٱلۡمَدِينَةِ يَسۡتَبۡشِرُونَ ٧٦",
    "tafsier": {
      "ibnkther": "وَجَآءَ أَهۡلُ ٱلۡمَدِينَةِ يَسۡتَبۡشِرُونَ ٧٦\n                                    \n                                    \n                                    يخبر تعالى عن مجيء قوم لوط لما علموا بأضيافه وصباحة وجوههم ، وأنهم جاءوا مستبشرين بهم فرحين ،\n                                    ",
      "qortoby": "وَجَآءَ أَهۡلُ ٱلۡمَدِينَةِ يَسۡتَبۡشِرُونَ ٧٦\n                                    \n                                    \n                                    وَجَاءَ أَهْلُ الْمَدِينَةِ\nأي أهل مدينة لوط يَسْتَبْشِرُونَ\nمستبشرين بالأضياف طمعا منهم في ركوب الفاحشة .\n                                    ",
      "saadi": "وَجَآءَ أَهۡلُ ٱلۡمَدِينَةِ يَسۡتَبۡشِرُونَ ٧٦\n                                        \n                                        \n                                        \n                                        { وَجَاءَ أَهْلُ الْمَدِينَةِ } أي: المدينة التي فيها قوم لوط { يَسْتَبْشِرُونَ } أي: يبشر بعضهم بعضا بأضياف لوط وصباحة وجوههم واقتدارهم عليهم، وذلك لقصدهم فعل الفاحشة فيهم، فجاءوا حتى وصلوا إلى بيت لوط فجعلوا يعالجون لوطا على أضيافه، ولوط يستعيذ منهم ويقول: { إِنَّ هَؤُلَاءِ ضَيْفِي فَلَا تَفْضَحُون وَاتَّقُوا اللَّهَ وَلَا تُخْزُون }\n                                    "
    }
  },
  {
    "id": 67,
    "versesNumber": 68,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ إِنَّ هَٰٓؤُلَآءِ ضَيۡفِي فَلَا تَفۡضَحُونِ ٨٦ ",
    "tafsier": {
      "ibnkther": "قَالَ إِنَّ هَٰٓؤُلَآءِ ضَيۡفِي فَلَا تَفۡضَحُونِ ٨٦\n                                    \n                                    \n                                    قال إن هؤلاء ضيفي فلا تفضحون واتقوا الله ولا تخزون \" وهذا إنما قاله لهم قبل أن يعلم بأنهم رسل الله كما قال في سورة هود وأما ههنا فتقدم ذكر أنهم رسل الله وعطف ذكر مجيء قومه ومحاجته لهم ولكن الواو لا تقتضي الترتيب ولا سيما إذا دل دليل على خلافه.\n                                    ",
      "qortoby": "قَالَ إِنَّ هَٰٓؤُلَآءِ ضَيۡفِي فَلَا تَفۡضَحُونِ ٨٦\n                                    \n                                    \n                                    قَالَ إِنَّ هَؤُلَاءِ ضَيْفِي\nأي أضيافي .فَلَا تَفْضَحُونِ\nأي تخجلون .\n                                    ",
      "saadi": "قَالَ إِنَّ هَٰٓؤُلَآءِ ضَيۡفِي فَلَا تَفۡضَحُونِ ٨٦\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 68 و69 :ـ\n{ إِنَّ هَؤُلَاءِ ضَيْفِي فَلَا تَفْضَحُون وَاتَّقُوا اللَّهَ وَلَا تُخْزُون } أي: راقبوا الله أول ذلك وإن كان ليس فيكم خوف من الله فلا تفضحون في أضيافي، وتنتهكوا منهم الأمر الشنيع.\n                                    "
    }
  },
  {
    "id": 68,
    "versesNumber": 69,
    "souraName": "Al-Hijr.html",
    "contnent": "وَٱتَّقُواْ ٱللَّهَ وَلَا تُخۡزُونِ ٩٦",
    "tafsier": {
      "ibnkther": "وَٱتَّقُواْ ٱللَّهَ وَلَا تُخۡزُونِ ٩٦\n                                    \n                                    \n                                    وهذا إنما قاله لهم قبل أن يعلم بأنهم رسل الله.\n                                    ",
      "qortoby": "وَٱتَّقُواْ ٱللَّهَ وَلَا تُخۡزُونِ ٩٦\n                                    \n                                    \n                                    يجوز أن يكون من الخزي وهو الذل والهوان , ويجوز أن يكون من الخزاية وهو الحياء والخجل .\nوقد تقدم في هود .\n                                    ",
      "saadi": "وَٱتَّقُواْ ٱللَّهَ وَلَا تُخۡزُونِ ٩٦\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 68 و69 :ـ\n{ إِنَّ هَؤُلَاءِ ضَيْفِي فَلَا تَفْضَحُون وَاتَّقُوا اللَّهَ وَلَا تُخْزُون } أي: راقبوا الله أول ذلك وإن كان ليس فيكم خوف من الله فلا تفضحون في أضيافي، وتنتهكوا منهم الأمر الشنيع.\n                                    "
    }
  },
  {
    "id": 69,
    "versesNumber": 70,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالُوٓاْ أَوَ لَمۡ نَنۡهَكَ عَنِ ٱلۡعَٰلَمِينَ ٠٧",
    "tafsier": {
      "ibnkther": "قَالُوٓاْ أَوَ لَمۡ نَنۡهَكَ عَنِ ٱلۡعَٰلَمِينَ ٠٧\n                                    \n                                    \n                                    فقالوا له مجيبين \" أولم ننهك عن العالمين \" أي أوما نهيناك أن تضيف أحدا؟.\n                                    ",
      "qortoby": "قَالُوٓاْ أَوَ لَمۡ نَنۡهَكَ عَنِ ٱلۡعَٰلَمِينَ ٠٧\n                                    \n                                    \n                                    أي عن أن تضيف , أحدا لأنا نريد منهم الفاحشة .\nوكانوا يقصدون بفعلهم الغرباء ; عن الحسن .\nوقد تقدم في الأعراف .\nوقيل : أولم ننهك عن أن تكلمنا في أحد من الناس إذا قصدناه بالفاحشة .\n                                    ",
      "saadi": "قَالُوٓاْ أَوَ لَمۡ نَنۡهَكَ عَنِ ٱلۡعَٰلَمِينَ ٠٧\n                                        \n                                        \n                                        \n                                        فـ { قَالُوا } له جوابا عن قوله ولا تخزون فقط: { أَوَلَمْ نَنْهَكَ عَنِ الْعَالَمِينَ } أن تضيفهم فنحن قد أنذرناك، ومن أنذر فقد أعذر\n                                    "
    }
  },
  {
    "id": 70,
    "versesNumber": 71,
    "souraName": "Al-Hijr.html",
    "contnent": "قَالَ هَٰٓؤُلَآءِ بَنَاتِيٓ إِن كُنتُمۡ فَٰعِلِينَ ١٧",
    "tafsier": {
      "ibnkther": "قَالَ هَٰٓؤُلَآءِ بَنَاتِيٓ إِن كُنتُمۡ فَٰعِلِينَ ١٧\n                                    \n                                    \n                                    فأرشدهم إلى نسائهم ، وما خلق لهم ربهم منهن من الفروج المباحة . وقد تقدم أيضا القول في ذلك ، بما أغنى عن إعادته .\nهذا كله وهم غافلون عما يراد بهم ، وما قد أحاط بهم من البلاء ، وماذا يصبحهم من العذاب المستقر ; ولهذا قال تعالى لنبيه - صلى الله عليه وسلم - : ( لعمرك إنهم لفي سكرتهم يعمهون ) أقسم تعالى بحياة نبيه - صلوات الله وسلامه عليه - وفي هذا تشريف عظيم ، ومقام رفيع وجاه عريض .\nقال عمرو بن مالك النكري عن أبي الجوزاء ، عن ابن عباس أنه قال : ما خلق الله وما ذرأ وما برأ نفسا أكرم عليه من محمد - صلى الله عليه وسلم - وما سمعت الله أقسم بحياة أحد غيره\n                                    ",
      "qortoby": "قَالَ هَٰٓؤُلَآءِ بَنَاتِيٓ إِن كُنتُمۡ فَٰعِلِينَ ١٧\n                                    \n                                    \n                                    أي فتزوجوهن ولا تركنوا إلى الحرام .\nوقد تقدم بيان هذا في هود .\n                                    ",
      "saadi": "قَالَ هَٰٓؤُلَآءِ بَنَاتِيٓ إِن كُنتُمۡ فَٰعِلِينَ ١٧\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 71و 72 :ـ\nفـ { قَالَ } لهم لوط من شدة الأمر الذي أصابه: { هَؤُلَاءِ بَنَاتِي إِنْ كُنْتُمْ فَاعِلِينَ } فلم يبالوا بقوله ولهذا قال الله لرسوله محمد صلى الله عليه وسلم { لَعَمْرُكَ إِنَّهُمْ لَفِي سَكْرَتِهِمْ يَعْمَهُونَ } وهذه السكرة هي سكرة محبة الفاحشة التي لا يبالون معها بعذل ولا لوم.\n                                    "
    }
  },
  {
    "id": 71,
    "versesNumber": 72,
    "souraName": "Al-Hijr.html",
    "contnent": "لَعَمۡرُكَ إِنَّهُمۡ لَفِي سَكۡرَتِهِمۡ يَعۡمَهُونَ ٢٧",
    "tafsier": {
      "ibnkther": "لَعَمۡرُكَ إِنَّهُمۡ لَفِي سَكۡرَتِهِمۡ يَعۡمَهُونَ ٢٧\n                                    \n                                    \n                                    قال الله تعالى : ( لعمرك إنهم لفي سكرتهم يعمهون ) [ يقول : وحياتك وعمرك وبقائك في الدنيا \" إنهم لفي سكرتهم يعمهون ] رواه ابن جرير .\nوقال قتادة : ( في سكرتهم ) أي : في ضلالتهم ، ( يعمهون ) أي : يلعبون .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( لعمرك ) لعيشك ، ( إنهم لفي سكرتهم يعمهون ) قال : يتحيرون\n                                    ",
      "qortoby": "لَعَمۡرُكَ إِنَّهُمۡ لَفِي سَكۡرَتِهِمۡ يَعۡمَهُونَ ٢٧\n                                    \n                                    \n                                    قوله تعالى : لعمرك إنهم لفي سكرتهم يعمهون فيه ثلاث مسائل :\nالأولى : قال القاضي أبو بكر بن العربي : قال المفسرون بأجمعهم أقسم الله - تعالى - هاهنا بحياة محمد - صلى الله عليه وسلم - تشريفا له ، أن قومه من قريش في سكرتهم يعمهون وفي حيرتهم يترددون . قلت : وهكذا قال القاضي عياض : أجمع أهل التفسير في هذا أنه قسم من الله جل جلاله بمدة حياة محمد - صلى الله عليه وسلم - . وأصله ضم العين من العمر ولكنها فتحت لكثرة الاستعمال . ومعناه وبقائك يا محمد . وقيل وحياتك . وهذا نهاية التعظيم وغاية البر والتشريف . قال أبو الجوزاء : ما أقسم الله بحياة أحد غير محمد - صلى الله عليه وسلم - ; لأنه أكرم البرية عنده . قال ابن العربي : \" ما الذي يمنع أن يقسم الله - سبحانه وتعالى - بحياة لوط ويبلغ به من التشريف ما شاء ، وكل ما يعطيه الله - تعالى - للوط من فضل يؤتي ضعفيه من شرف لمحمد - صلى الله عليه وسلم - ; لأنه أكرم على الله منه ; أولا ترى أنه سبحانه أعطى إبراهيم الخلة وموسى التكليم وأعطى ذلك لمحمد ، فإذا أقسم بحياة لوط فحياة محمد أرفع . ولا يخرج من كلام إلى كلام لم يجر له ذكر لغير ضرورة \" . قلت : ما قاله حسن ; فإنه كان يكون قسمه سبحانه بحياة محمد - صلى الله عليه وسلم - كلاما معترضا في قصة لوط . قال القشيري أبو نصر عبد الرحيم بن عبد الكريم في تفسيره : ويحتمل أن يقال : يرجع ذلك إلى قوم لوط ، أي كانوا في سكرتهم يعمهون . وقيل : لما وعظ لوط قومه وقال هؤلاء بناتي قالت الملائكة : يا لوط ، لعمرك إنهم لفي سكرتهم يعمهون ولا يدرون ما يحل بهم صباحا . فإن قيل : فقد أقسم - تعالى - بالتين والزيتون وطور سينين ; فما في هذا ؟ قيل له : ما من شيء أقسم الله به إلا وذلك دلالة على فضله على ما يدخل في عداده ، فكذلك نبينا - صلى الله عليه وسلم - يجب أن يكون أفضل ممن هو في عداده . والعمر والعمر ( بضم العين وفتحها ) لغتان ومعناهما واحد ; إلا أنه لا يستعمل في القسم إلا بالفتح لكثرة الاستعمال . وتقول : عمرك الله ، أي أسأل الله تعميرك . ولعمرك رفع بالابتداء وخبره محذوف . المعنى لعمرك مما أقسم به .\nالثانية : كره كثير من العلماء أن يقول الإنسان لعمري ; لأن معناه وحياتي . قال إبراهيم النخعي : يكره للرجل أن يقول لعمري ; لأنه حلف بحياة نفسه ، وذلك من كلام ضعفة الرجال . ونحو هذا قال مالك : إن المستضعفين من الرجال والمؤنثين يقسمون بحياتك وعيشك ، وليس من كلام أهل الذكران ، وإن كان الله سبحانه أقسم به في هذه القصة ، فذلك بيان لشرف المنزلة والرفعة لمكانه ، فلا يحمل عليه سواه ولا يستعمل في غيره . وقال ابن حبيب : ينبغي أن يصرف لعمرك في الكلام لهذه الآية . وقال قتادة : هو من كلام العرب . قال ابن العربي : وبه أقول ، لكن الشرع قد قطعه في الاستعمال ورد القسم إليه .\nقلت . القسم ب \" لعمرك ولعمري \" ونحوه في أشعار العرب وفصيح كلامها كثير .\nقال النابغة :\nلعمري وما عمري علي بهين لقد نطقت بطلا علي الأقارع\nآخر :\nلعمرك إن الموت ما أخطأ الفتى لكالطول المرخى وثنياه باليد\nآخر :\nأيها المنكح الثريا سهيلا عمرك الله كيف يلتقيان\nآخر :\nإذا رضيت علي بنو قشير لعمر الله أعجبني رضاها\nوقال بعض أهل المعاني : لا يجوز هذا ; لأنه لا يقال لله عمر ، وإنما هو - تعالى - أزلي . ذكره الزهراوي .\nالثالثة : قد مضى الكلام فيما يحلف به وما لا يجوز الحلف به في \" المائدة \" ، وذكرنا هناك قول أحمد بن حنبل فيمن أقسم بالنبي - صلى الله عليه وسلم - لزمته الكفارة . قال ابن خويز منداد : من جوز الحلف بغير الله - تعالى - مما يجوز تعظيمه بحق من الحقوق فليس يقول إنها يمين تتعلق بها كفارة ; إلا أنه من قصد الكذب كان ملوما ; لأنه في الباطن مستخف بما وجب عليه تعظيمه . قالوا : وقوله - تعالى - لعمرك أي وحياتك . وإذا أقسم الله - تعالى - بحياة نبيه فإنما أراد بيان التصريح لنا أنه يجوز لنا أن نحلف بحياته . وعلى مذهب مالك معنى قوله : لعمرك والتين والزيتون . والطور وكتاب مسطور والنجم إذا هوى والشمس وضحاها لا أقسم بهذا البلد وأنت حل بهذا البلد ووالد وما ولد كل هذا معناه : وخالق التين والزيتون ، وبرب الكتاب المسطور ، وبرب البلد الذي حللت به ، وخالق عيشك وحياتك ، وحق محمد ; فاليمين والقسم حاصل به سبحانه لا بالمخلوق . قال ابن خويز منداد : ومن جوز اليمين بغير الله - تعالى - تأول قوله - صلى الله عليه وسلم - : لا تحلفوا بآبائكم وقال : إنما نهى عن الحلف بالآباء الكفار ، ألا ترى أنه قال لما حلفوا بآبائهم : ( للجبل عند الله أكرم من آبائكم الذين ماتوا في الجاهلية ) . ومالك حمل الحديث على ظاهره . قال ابن خويز منداد : واستدل أيضا من جوز ذلك بأن أيمان المسلمين جرت منذ عهد النبي - صلى الله عليه وسلم - إلى يومنا هذا أن يحلفوا بالنبي - صلى الله عليه وسلم - ، حتى أن أهل المدينة إلى يومنا هذا إذا حاكم أحدهم صاحبه قال : احلف لي بحق ما حواه هذا القبر ، وبحق ساكن هذا القبر ، يعني النبي - صلى الله عليه وسلم - ، وكذلك بالحرم والمشاعر العظام ، والركن والمقام والمحراب وما يتلى فيه .\n                                    ",
      "saadi": "لَعَمۡرُكَ إِنَّهُمۡ لَفِي سَكۡرَتِهِمۡ يَعۡمَهُونَ ٢٧\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 71و 72 :ـ\nفـ { قَالَ } لهم لوط من شدة الأمر الذي أصابه: { هَؤُلَاءِ بَنَاتِي إِنْ كُنْتُمْ فَاعِلِينَ } فلم يبالوا بقوله ولهذا قال الله لرسوله محمد صلى الله عليه وسلم { لَعَمْرُكَ إِنَّهُمْ لَفِي سَكْرَتِهِمْ يَعْمَهُونَ } وهذه السكرة هي سكرة محبة الفاحشة التي لا يبالون معها بعذل ولا لوم.\n                                    "
    }
  },
  {
    "id": 72,
    "versesNumber": 73,
    "souraName": "Al-Hijr.html",
    "contnent": "فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ مُشۡرِقِينَ ٣٧",
    "tafsier": {
      "ibnkther": "فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ مُشۡرِقِينَ ٣٧\n                                    \n                                    \n                                    يقول : تعالى : ( فأخذتهم الصيحة ) وهي ما جاءهم من الصوت القاصف عند شروق الشمس ، وهو طلوعها ، وذلك مع رفع بلادهم إلى عنان السماء ثم قلبها ،\n                                    ",
      "qortoby": "فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ مُشۡرِقِينَ ٣٧\n                                    \n                                    \n                                    قوله تعالى : فأخذتهم الصيحة مشرقين\nقوله تعالى : فأخذتهم الصيحة مشرقين نصب على الحال ، أي وقت شروق الشمس . يقال : أشرقت الشمس أي أضاءت ، وشرقت إذا طلعت . وقيل : هما لغتان بمعنى . وأشرق القوم أي دخلوا في وقت شروق الشمس . مثل أصبحوا وأمسوا ، وهو المراد في الآية . وقيل : أراد شروق الفجر . وقيل : أول العذاب كان عند الصبح وامتد إلى شروق الشمس ، فكان تمام الهلاك عند ذلك . والله أعلم .\nوالصيحة العذاب .\n\n                                    ",
      "saadi": "فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ مُشۡرِقِينَ ٣٧\n                                        \n                                        \n                                        \n                                        فلما بينت له الرسل حالهم، زال عن لوط ما كان يجده من الضيق والكرب، فامتثل أمر ربه وسرى بأهله ليلا فنجوا، وأما أهل القرية { فَأَخَذَتْهُمُ الصَّيْحَةُ مُشْرِقِينَ } أي: وقت شروق الشمس حين كانت العقوبة عليهم أشد\n                                    "
    }
  },
  {
    "id": 73,
    "versesNumber": 74,
    "souraName": "Al-Hijr.html",
    "contnent": "فَجَعَلۡنَا عَٰلِيَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَيۡهِمۡ حِجَارَةٗ مِّن سِجِّيلٍ ٤٧",
    "tafsier": {
      "ibnkther": "فَجَعَلۡنَا عَٰلِيَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَيۡهِمۡ حِجَارَةٗ مِّن سِجِّيلٍ ٤٧\n                                    \n                                    \n                                    وجعل عاليها سافلها ، وإرسال حجارة السجيل عليهم . وقد تقدم الكلام على السجيل في [ سورة ] هود بما فيه كفاية .\n                                    ",
      "qortoby": "فَجَعَلۡنَا عَٰلِيَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَيۡهِمۡ حِجَارَةٗ مِّن سِجِّيلٍ ٤٧\n                                    \n                                    \n                                    دليل على أن من فعل فعلهم حكمه الرجم ; وقد تقدم في \" الأعراف \" .\nوفي التفسير : أمطرنا في العذاب , ومطرنا في الرحمة .\nوأما كلام العرب فيقال : مطرت السماء وأمطرت : حكاه الهروي .\nواختلف في \" السجيل \" فقال النحاس : السجيل الشديد الكثير ; وسجيل وسجين اللام والنون أختان .\nوقال أبو عبيدة : السجيل الشديد ; وأنشد : ضربا تواصى به الأبطال سجينا قال النحاس : ورد عليه هذا القول عبد الله بن مسلم وقال : هذا سجين وذلك سجيل فكيف يستشهد به ؟ ! قال النحاس : وهذا الرد لا يلزم ; لأن أبا عبيدة ذهب إلى أن اللام تبدل من النون لقرب إحداهما من الأخرى ; وقول أبي عبيدة يرد من جهة أخرى ; وهي أنه لو كان على قوله لكان حجارة سجيلا ; لأنه لا يقال : حجارة من شديد ; لأن شديدا نعت .\nوحكى أبو عبيدة عن الفراء أنه قد يقال لحجارة الأرحاء سجيل .\nوحكى عنه محمد بن الجهم أن سجيلا طين يطبخ حتى يصير بمنزلة الأرحاء .\nوقالت طائفة منهم ابن عباس وسعيد بن جبير وابن إسحاق : إن سجيلا لفظة غير عربية عربت , أصلها سنج وجيل .\nويقال : سنك وكيل ; بالكاف موضع الجيم , وهما بالفارسية حجر وطين عربتهما العرب فجعلتهما اسما واحدا .\nوقيل هو من لغة العرب .\nوقال قتادة وعكرمة : السجيل الطين بدليل قوله : \" لنرسل عليهم حجارة من طين \" [ الذاريات : 33 ] .\nوقال الحسن : كان أصل الحجارة طينا فشددت .\nوالسجيل عند العرب كل شديد صلب .\nوقال الضحاك : يعني الآجر .\nوقال ابن زيد : طين طبخ حتى كان كالآجر ; وعنه أن سجيلا اسم السماء الدنيا ; ذكره المهدوي ; وحكاه الثعلبي عن أبي العالية ; وعن عكرمة : أنه بحر معلق بين السماء والأرض منه نزلت الحجارة .\nوقيل : هي جبال في السماء , وهي التي أشار الله تعالى إليها بقوله : \" وينزل من السماء من جبال فيها من برد \" [ النور : 43 ] .\nوقيل : هو مما سجل لهم أي كتب لهم أن يصيبهم ; فهو في معنى سجين ; قال الله تعالى : \" وما أدراك ما سجين .\nكتاب مرقوم \" [ المطففين : 8 - 9 ] قاله الزجاج واختاره .\nوقيل : هو فعيل من أسجلته أي أرسلته فكأنها مرسلة عليهم .\nوقيل : هو من أسجلته إذا أعطيته ; فكأنه عذاب أعطوه ; قال : من يساجلني يساجل ماجدا يملأ الدلو إلى عقد الكرب وقال أهل المعاني : السجيل والسجين الشديد من الحجر والضرب ; قال ابن مقبل : ورجلة يضربون البيض ضاحية ضربا تواصى به الأبطال سجينا\n                                    ",
      "saadi": "فَجَعَلۡنَا عَٰلِيَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَيۡهِمۡ حِجَارَةٗ مِّن سِجِّيلٍ ٤٧\n                                        \n                                        \n                                        \n                                        { فَجَعَلْنَا عَالِيَهَا سَافِلَهَا } أي: قلبنا عليهم مدينتهم، { وَأَمْطَرْنَا عَلَيْهِمْ حِجَارَةً مِنْ سِجِّيلٍ } تتبع فيها من شذ من البلد منهم.\n                                    "
    }
  },
  {
    "id": 74,
    "versesNumber": 75,
    "souraName": "Al-Hijr.html",
    "contnent": "إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّلۡمُتَوَسِّمِينَ ٥٧",
    "tafsier": {
      "ibnkther": "إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّلۡمُتَوَسِّمِينَ ٥٧\n                                    \n                                    \n                                    وقوله : ( إن في ذلك لآيات للمتوسمين ) أي : إن آثار هذه النقم ظاهرة على تلك البلاد لمن تأمل ذلك وتوسمه بعين بصره وبصيرته ، كما قال مجاهد في قوله : ( للمتوسمين ) قال : المتفرسين .\nوعن ابن عباس ، والضحاك : للناظرين . وقال قتادة : للمعتبرين . وقال مالك عن بعض أهل المدينة : ( للمتوسمين ) للمتأملين .\nوقال ابن أبي حاتم : حدثنا الحسن بن عرفة ، حدثنا محمد بن كثير العبدي ، عن عمرو بن قيس ، عن عطية ، عن أبي سعيد قال : قال رسول الله - صلى الله عليه وسلم - \" اتقوا فراسة المؤمن ، فإنه ينظر بنور الله \" . ثم قرأ النبي - صلى الله عليه وسلم - : ( إن في ذلك لآيات للمتوسمين )\nرواه الترمذي ، وابن جرير من حديث عمرو بن قيس الملائي وقال الترمذي : لا نعرفه إلا من هذا الوجه .\nوقال ابن جرير أيضا : حدثني أحمد بن محمد الطوسي ، حدثنا الحسن بن محمد ، حدثنا الفرات بن السائب ، حدثنا ميمون بن مهران ، عن ابن عمر قال : قال رسول الله - صلى الله عليه وسلم - : \" اتقوا فراسة المؤمن ; فإن المؤمن ينظر بنور الله \"\nوقال ابن جرير : حدثني أبو شرحبيل الحمصي ، حدثنا سليمان بن سلمة ، حدثنا المؤمل بن سعيد بن يوسف الرحبي ، حدثنا أبو المعلى أسد بن وداعة الطائي ، حدثنا وهب بن منبه ، عن طاوس بن كيسان ، عن ثوبان قال : قال رسول الله - صلى الله عليه وسلم - : \" احذروا فراسة المؤمن ; فإنه ينظر بنور الله وينطق بتوفيق الله \"\nوقال أيضا : حدثنا عبد الأعلى بن واصل ، حدثنا سعيد بن محمد الجرمي ، حدثنا عبد الواحد بن واصل ، حدثنا أبو بشر المزلق ، عن ثابت ، عن أنس بن مالك قال : قال النبي - صلى الله عليه وسلم - : \" إن لله عبادا يعرفون الناس بالتوسم \"\nورواه الحافظ أبو بكر البزار : حدثنا سهل بن بحر ، حدثنا سعيد بن محمد الجرمي ، حدثنا أبو بشر - يقال له : ابن المزلق قال : وكان ثقة - عن ثابت ، عن أنس قال : قال رسول الله - صلى الله عليه وسلم - : \" إن لله عبادا يعرفون الناس بالتوسم \"\n                                    ",
      "qortoby": "إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّلۡمُتَوَسِّمِينَ ٥٧\n                                    \n                                    \n                                    قوله تعالى : إن في ذلك لآيات للمتوسمين فيه مسألتان :س\nالأولى : قوله - تعالى - : للمتوسمين روى الترمذي الحكيم في ( نوادر الأصول ) من حديث أبي سعيد الخدري عن رسول الله - صلى الله عليه وسلم - أنه قال : ( للمتفرسين ) وهو قول مجاهد . وروى أبو عيسى الترمذي عن أبي سعيد الخدري قال : قال رسول الله - صلى الله عليه وسلم - : اتقوا فراسة المؤمن فإنه ينظر بنور الله - ثم قرأ - إن في ذلك لآيات للمتوسمين . قال : هذا حديث غريب . وقال مقاتل وابن زيد : للمتوسمين للمتفكرين . الضحاك : للنظارين . قال الشاعر :س\nأوكلما وردت عكاظ قبيلة بعثوا إلى عريفهم يتوسمس\nوقال قتادة : للمعتبرين . قال زهير :س\nوفيهن ملهى للصديق ومنظر أنيق لعين الناظر المتوسمس\nوقال أبو عبيدة : للمتبصرين ، والمعنى متقارب . وروى الترمذي الحكيم من حديث ثابت عن أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - : إن لله - عز وجل - عبادا يعرفون الناس بالتوسم . قال العلماء : التوسم تفعل من الوسم ، وهي العلامة التي يستدل بها على مطلوب غيرها . يقال : توسمت فيه الخير إذا رأيت ميسم ذلك فيه ; ومنه قول عبد الله بن رواحة للنبي - صلى الله عليه وسلم - :\nإني توسمت فيك الخير أعرفه الله يعلم أني ثابت البصر\nآخر :\nتوسمته لما رأيت مهابة عليه وقلت المرء من آل هاشم\nواتسم الرجل إذا جعل لنفسة علامة يعرف بها . وتوسم الرجل طلب كلأ النسمي . وأنشد :\nوأصبحن كالدوم النواعم غدوة على وجهة من ظاعن متوسم\nوقال ثعلب : الواسم الناظر إليك من فرقك إلى قدمك . وأصل التوسم التثبت والتفكر ; مأخوذ من الوسم وهو التأثير بحديدة في جلد البعير وغيره ، وذلك يكون بجودة القريحة وحدة الخاطر وصفاء الفكر . زاد غيره : وتفريغ القلب من حشو الدنيا ، وتطهيره من أدناس المعاصي وكدورة الأخلاق وفضول الدنيا . روى نهشل عن ابن عباس للمتوسمين قال : لأهل الصلاح والخير . وزعمت الصوفية أنها كرامة . وقيل : بل هي استدلال بالعلامات ، ومن العلامات ما يبدو ظاهرا لكل أحد وبأول نظرة ، ومنها ما يخفى فلا يبدو لكل أحد ولا يدرك ببادئ النظر . قال الحسن : المتوسمون هم الذين يتوسمون الأمور فيعلمون أن الذي أهلك قوم لوط قادر على أن يهلك الكفار ; فهذا من الدلائل الظاهرة . ومثله قول ابن عباس ، : ( ما سألني أحد عن شيء إلا عرفت أفقيه هو أو غير فقيه ) . وروي عن الشافعي ومحمد بن الحسن أنهما كانا بفناء الكعبة ورجل على باب المسجد فقال أحدهما : أراه نجارا ، وقال الآخر : بل حدادا ، فتبادر من حضر إلى الرجل فسأل فقال : كنت نجارا وأنا اليوم حداد . وروي عن جندب بن عبد الله البجلي أنه أتى على رجل يقرأ القرآن فوقف فقال : من سمع سمع الله به ، ومن راءى راءى الله به . فقلنا له : كأنك عرضت بهذا الرجل ، فقال : إن هذا يقرأ عليك القرآن اليوم ويخرج غدا حروريا ; فكان رأس الحرورية ، واسمه مرداس . وروي عن الحسن البصري أنه دخل عليه عمرو بن عبيد فقال : هذا سيد فتيان البصرة إن لم يحدث ، فكان من أمره من القدر ما كان ، حتى هجره عامة إخوانه . وقال لأيوب : هذا سيد فتيان أهل البصرة ، ولم يستثن . وروي عن الشعبي أنه قال لداود الأزدي وهو يماريه : إنك لا تموت حتى تكوى في رأسك ، وكان كذلك . وروي أن عمر بن الخطاب - رضي الله عنه - دخل عليه قوم من مذحج فيهم الأشتر ، فصعد فيه النظر وصوبه وقال : أيهم هذا ؟ قالوا : مالك بن الحارث . فقال : ما له قاتله الله ! إني لأرى للمسلمين منه يوما عصيبا ; فكان منه في الفتنة ما كان . وروي عن عثمان بن عفان - رضي الله عنه - : أن أنس بن مالك دخل عليه ، وكان قد مر بالسوق فنظر إلى امرأة ، فلما نظر إليه قال عثمان : ( يدخل أحدكم علي وفي عينيه أثر الزنا ! فقال له أنس : أوحيا بعد رسول الله - صلى الله عليه وسلم - ؟ فقال لا ولكن برهان وفراسة وصدق ) . ومثله كثير عن الصحابة والتابعين - رضي الله عنهم أجمعين - .\nالثانية : قال أبو بكر بن العربي : \" إذا ثبت أن التوسم والتفرس من مدارك المعاني فإن ذلك لا يترتب عليه حكم ولا يؤخذ به موسوم ولا متفرس . وقد كان قاضي القضاة الشامي المالكي ببغداد أيام كوني بالشام يحكم بالفراسة في الأحكام ، جريا على طريق إياس بن معاوية أيام كان قاضيا ، وكان شيخنا فخر الإسلام أبو بكر الشاشي صنف جزءا في الرد عليه ، كتبه لي بخطه وأعطانيه ، وذلك صحيح ; فإن مدارك الأحكام معلومة شرعا مدركة قطعا وليست الفراسة منها\n                                    ",
      "saadi": "إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّلۡمُتَوَسِّمِينَ ٥٧\n                                        \n                                        \n                                        \n                                        { إِنَّ فِي ذَلِكَ لَآيَاتٍ لِلْمُتَوَسِّمِينَ } أي: المتأملين المتفكرين، الذين لهم فكر وروية وفراسة، يفهمون بها ما أريد بذلك، من أن من تجرأ على معاصي الله، خصوصا هذه الفاحشة العظيمة، وأن الله سيعاقبهم بأشنع العقوبات، كما تجرأوا على أشنع السيئات.\n                                    "
    }
  },
  {
    "id": 75,
    "versesNumber": 76,
    "souraName": "Al-Hijr.html",
    "contnent": "وَإِنَّهَا لَبِسَبِيلٖ مُّقِيمٍ ٦٧",
    "tafsier": {
      "ibnkther": "وَإِنَّهَا لَبِسَبِيلٖ مُّقِيمٍ ٦٧\n                                    \n                                    \n                                    وقوله : ( وإنها لبسبيل مقيم ) أي : وإن قرية سدوم التي أصابها ما أصابها من القلب الصوري والمعنوي ، والقذف بالحجارة ، حتى صارت بحيرة منتنة خبيثة لبطريق مهيع مسالكه مستمرة إلى اليوم ، كما قال تعالى : ( وإنكم لتمرون عليهم مصبحين وبالليل أفلا تعقلون ) [ الصافات : 137 ، 138 ]\nوقال مجاهد ، والضحاك : ( وإنها لبسبيل مقيم ) قال : معلم . وقال قتادة : بطريق واضح . وقال قتادة أيضا : بصقع من الأرض واحد .\nوقال السدي : بكتاب مبين ، يعني كقوله : ( وكل شيء أحصيناه في إمام مبين ) [ يس : 12 ] ولكن ليس المعنى على ما قال هاهنا ، والله أعلم .\n                                    ",
      "qortoby": "وَإِنَّهَا لَبِسَبِيلٖ مُّقِيمٍ ٦٧\n                                    \n                                    \n                                    وَإِنَّهَا\nيعني قرى قوم لوط .لَبِسَبِيلٍ مُقِيمٍ\nأي على طريق قومك يا محمد إلى الشام .\n                                    ",
      "saadi": "وَإِنَّهَا لَبِسَبِيلٖ مُّقِيمٍ ٦٧\n                                        \n                                        \n                                        \n                                        { وَإِنَّهَا } أي: مدينة قوم لوط { لَبِسَبِيلٍ مُقِيمٍ } للسالكين، يعرفه كل من تردد في تلك الديار\n                                    "
    }
  },
  {
    "id": 76,
    "versesNumber": 77,
    "souraName": "Al-Hijr.html",
    "contnent": "إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّلۡمُؤۡمِنِينَ ٧٧",
    "tafsier": {
      "ibnkther": "إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّلۡمُؤۡمِنِينَ ٧٧\n                                    \n                                    \n                                    وقوله : ( إن في ذلك لآية للمؤمنين ) أي : إن الذي صنعنا بقوم لوط من الهلاك والدمار وإنجائنا لوطا وأهله لدلالة واضحة جلية للمؤمنين بالله ورسله .\n                                    ",
      "qortoby": "إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّلۡمُؤۡمِنِينَ ٧٧\n                                    \n                                    \n                                    أي لعبرة للمصدقين .\n                                    ",
      "saadi": "إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّلۡمُؤۡمِنِينَ ٧٧\n                                        \n                                        \n                                        \n                                        { إِنَّ فِي ذَلِكَ لَآيَةً لِلْمُؤْمِنِينَ } وفي هذه القصة من العبر: عنايته تعالى بخليله إبراهيم، فإن لوطا عليه السلام من أتباعه، وممن آمن به فكأنه تلميذ له، فحين أراد الله إهلاك قوم لوط حين استحقوا ذلك، أمر رسله أن يمروا على إبراهيم عليه السلام كي يبشروه بالولد ويخبروه بما بعثوا له، حتى إنه جادلهم عليه السلام في إهلاكهم حتى أقنعوه، فطابت نفسه.\nوكذلك لوط عليه السلام، لما كانوا أهل وطنه، فربما أخذته الرقة عليهم والرأفة بهم قدَّر الله من الأسباب ما به يشتد غيظه وحنقه عليهم، حتى استبطأ إهلاكهم لما قيل له: { إن موعدهم الصبح أليس الصبح بقريب } ومنها: أن الله تعالى إذا أراد أن يهلك قرية [ازداد] شرهم وطغيانهم، فإذا انتهى أوقع بهم من العقوبات ما يستحقونه.\n                                    "
    }
  },
  {
    "id": 77,
    "versesNumber": 78,
    "souraName": "Al-Hijr.html",
    "contnent": "وَإِن كَانَ أَصۡحَٰبُ ٱلۡأَيۡكَةِ لَظَٰلِمِينَ ٨٧",
    "tafsier": {
      "ibnkther": "وَإِن كَانَ أَصۡحَٰبُ ٱلۡأَيۡكَةِ لَظَٰلِمِينَ ٨٧\n                                    \n                                    \n                                    صحاب الأيكة : هم قوم شعيب .\nقال الضحاك ، وقتادة وغيرهما : الأيكة : الشجر الملتف .\nوكان ظلمهم بشركهم بالله وقطعهم الطريق ، ونقصهم المكيال والميزان\n                                    ",
      "qortoby": "وَإِن كَانَ أَصۡحَٰبُ ٱلۡأَيۡكَةِ لَظَٰلِمِينَ ٨٧\n                                    \n                                    \n                                    وإن كان أصحاب الأيكة لظالمين يريد قوم شعيب ، كانوا أصحاب غياض ورياض وشجر مثمر . والأيكة : الغيضة ، وهي جماعة الشجر ، والجمع الأيك . ويروى أن شجرهم كان دوما وهو المقل . قال النابغة :\nتجلو بقادمتي حمامة أيكة بردا أسف لثاته بالإثمد\nوقيل : الأيكة اسم القرية . وقيل اسم البلدة . وقال أبو عبيدة : الأيكة وليكة مدينتهم ، بمنزلة بكة من مكة . وتقدم خبر شعيب وقومه .\nوإنهما لبإمام مبين أي بطريق واضح في نفسه ، يعني مدينة قوم لوط وبقعة أصحاب الأيكة يعتبر بهما من يمر عليهما .\n                                    ",
      "saadi": "وَإِن كَانَ أَصۡحَٰبُ ٱلۡأَيۡكَةِ لَظَٰلِمِينَ ٨٧\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 78 و79 :ـ \nوهؤلاء هم قوم شعيب، نعتهم الله وأضافهم إلى الأيكة، وهو البستان كثير الأشجار، ليذكر نعمته عليهم، وأنهم ما قاموا بها بل جاءهم نبيهم شعيب، فدعاهم إلى التوحيد، وترك ظلم الناس في المكاييل والموازين، وعالجهم على ذلك على أشد المعالجة فاستمروا على ظلمهم في حق الخالق، وفي حق الخلق، ولهذا وصفهم هنا بالظلم، { فَانْتَقَمْنَا مِنْهُمْ } فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم. { وَإِنَّهُمَا } أي: ديار قوم لوط وأصحاب الأيكة { لَبِإِمَامٍ مُبِينٍ } أي: لبطريق واضح يمر بهم المسافرون كل وقت، فيبين من آثارهم ما هو مشاهد بالأبصار فيعتبر بذلك أولوا الألباب.\n                                    "
    }
  },
  {
    "id": 78,
    "versesNumber": 79,
    "souraName": "Al-Hijr.html",
    "contnent": "فَٱنتَقَمۡنَا مِنۡهُمۡ وَإِنَّهُمَا لَبِإِمَامٖ مُّبِينٖ ٩٧",
    "tafsier": {
      "ibnkther": "فَٱنتَقَمۡنَا مِنۡهُمۡ وَإِنَّهُمَا لَبِإِمَامٖ مُّبِينٖ ٩٧\n                                    \n                                    \n                                    فانتقم الله منهم بالصيحة والرجفة وعذاب يوم الظلة ، وقد كانوا قريبا من قوم لوط ، بعدهم في الزمان ، ومسامتين لهم في المكان ; ولهذا قال تعالى : ( وإنهما لبإمام مبين ) أي : طريق مبين .\nقال ابن عباس ، ومجاهد ، والضحاك : طريق ظاهر ; ولهذا لما أنذر شعيب قومه قال في نذارته إياهم : ( وما قوم لوط منكم ببعيد )\n                                    ",
      "qortoby": "فَٱنتَقَمۡنَا مِنۡهُمۡ وَإِنَّهُمَا لَبِإِمَامٖ مُّبِينٖ ٩٧\n                                    \n                                    \n                                    أي بطريق واضح في نفسه , يعني مدينة قوم لوط وبقعة أصحاب الأيكة يعتبر بهما من يمر عليهما .\n                                    ",
      "saadi": "فَٱنتَقَمۡنَا مِنۡهُمۡ وَإِنَّهُمَا لَبِإِمَامٖ مُّبِينٖ ٩٧\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 78 و79 :ـ \nوهؤلاء هم قوم شعيب، نعتهم الله وأضافهم إلى الأيكة، وهو البستان كثير الأشجار، ليذكر نعمته عليهم، وأنهم ما قاموا بها بل جاءهم نبيهم شعيب، فدعاهم إلى التوحيد، وترك ظلم الناس في المكاييل والموازين، وعالجهم على ذلك على أشد المعالجة فاستمروا على ظلمهم في حق الخالق، وفي حق الخلق، ولهذا وصفهم هنا بالظلم، { فَانْتَقَمْنَا مِنْهُمْ } فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم. { وَإِنَّهُمَا } أي: ديار قوم لوط وأصحاب الأيكة { لَبِإِمَامٍ مُبِينٍ } أي: لبطريق واضح يمر بهم المسافرون كل وقت، فيبين من آثارهم ما هو مشاهد بالأبصار فيعتبر بذلك أولوا الألباب.\n                                    "
    }
  },
  {
    "id": 79,
    "versesNumber": 80,
    "souraName": "Al-Hijr.html",
    "contnent": "وَلَقَدۡ كَذَّبَ أَصۡحَٰبُ ٱلۡحِجۡرِ ٱلۡمُرۡسَلِينَ ٠٨ ",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ كَذَّبَ أَصۡحَٰبُ ٱلۡحِجۡرِ ٱلۡمُرۡسَلِينَ ٠٨\n                                    \n                                    \n                                    أصحاب الحجر هم : ثمود الذين كذبوا صالحا نبيهم ، ومن كذب برسول فقد كذب بجميع المرسلين ; ولهذا أطلق عليهم تكذيب المرسلين .\n                                    ",
      "qortoby": "وَلَقَدۡ كَذَّبَ أَصۡحَٰبُ ٱلۡحِجۡرِ ٱلۡمُرۡسَلِينَ ٠٨\n                                    \n                                    \n                                    قوله تعالى : ولقد كذب أصحاب الحجر المرسلين الحجر ينطلق على معان : منها حجر الكعبة . ومنها الحرام ; قال الله - تعالى - : وحجرا محجورا أي حراما محرما . والحجر العقل ; قال الله - تعالى - : لذي حجر والحجر حجر القميص ; والفتح أفصح . والحجر الفرس الأنثى . والحجر ديار ثمود ، وهو المراد هنا ، أي المدينة ; قاله الأزهري . قتادة : وهي ما بين مكة وتبوك ، وهو الوادي الذي فيه ثمود . الطبري : هي أرض بين الحجاز والشام ، وهم قوم صالح . وقال : \" المرسلين \" وهو صالح وحده ، ولكن من كذب نبيا فقد كذب الأنبياء كلهم ; لأنهم على دين واحد في الأصول فلا يجوز التفريق بينهم . وقيل : كذبوا صالحا ومن تبعه ومن تقدمه من النبيين أيضا . والله أعلم\nروى البخاري عن ابن عمر أن رسول الله - صلى الله عليه وسلم - لما نزل الحجر في غزوة تبوك أمرهم ألا يشربوا من بئرها ولا يستقوا منها . فقالوا : قد عجنا واستقينا . فأمرهم رسول الله - صلى الله عليه وسلم - أن يهريقوا الماء وأن يطرحوا ذلك العجين .\nوفي الصحيح عن ابن عمر أن الناس نزلوا مع رسول الله - صلى الله عليه وسلم - على الحجر أرض ثمود ، فاستقوا من آبارها وعجنوا به العجين ، فأمرهم رسول الله - صلى الله عليه وسلم - أن يهريقوا ما استقوا ويعلفوا الإبل العجين ، وأمرهم أن يستقوا من البئر التي تردها الناقة . وروي أيضا عن ابن عمر قال : مررنا مع رسول الله - صلى الله عليه وسلم - على الحجر فقال لنا رسول الله - صلى الله عليه وسلم - : لا تدخلوا مساكن الذين ظلموا أنفسهم إلا أن تكونوا باكين حذرا أن يصيبكم مثل ما أصابهم ثم زجر فأسرع .\nقلت : ففي هذه الآية التي بين الشارع حكمها وأوضح أمرها ثمان مسائل ، استنبطها العلماء واختلف في بعضها الفقهاء ،\nفأولها : كراهة دخول تلك المواضع ، وعليها حمل بعض العلماء دخول مقابر الكفار ; فإن دخل الإنسان شيئا من تلك المواضع والمقابر فعلى الصفة التي أرشد إليها النبي - صلى الله عليه وسلم - من الاعتبار والخوف والإسراع . وقد قال رسول الله - صلى الله عليه وسلم - : لا تدخلوا أرض بابل فإنها ملعونة .\n[ مسألة ] . أمر النبي بهرق ما استقوا من بئر ثمود وإلقاء ما عجن وخبز به لأجل أنه ماء سخط ، فلم يجز الانتفاع به فرارا من سخط الله . وقال اعلفوه الإبل .\nقلت : وهكذا حكم الماء النجس وما يعجن به .\nوثانيها : قال مالك : إن ما لا يجوز استعماله من الطعام والشراب يجوز أن تعلفه الإبل والبهائم ; إذ لا تكليف عليها ; وكذلك قال ، في العسل النجس : إنه يعلفه النحل .\nوثالثها : أمر رسول الله - صلى الله عليه وسلم - بعلف ما عجن بهذا الماء الإبل ، ولم يأمر بطرحه كما أمر في لحوم الحمر الإنسية يوم خيبر ; فدل على أن لحم الحمر أشد في التحريم وأغلظ في التنجيس . وقد أمر رسول الله - صلى الله عليه وسلم - بكسب الحجام أن يعلف الناضح والرقيق ، ولم يكن ذلك لتحريم ولا تنجيس . قال الشافعي : ولو كان حراما لم يأمره أن يطعمه رقيقه ; لأنه متعبد فيه كما تعبد في نفسه .\nورابعها : في أمره - صلى الله عليه وسلم - بعلف الإبل العجين دليل على جواز حمل الرجل النجاسة إلى كلابه ليأكلوها ; خلافا لمن منع ذلك من أصحابنا وقال : تطلق الكلاب عليها ولا يحملها إليهم .\nوخامسها : أمره - صلى الله عليه وسلم - أن يستقوا من بئر الناقة دليل على التبرك بآثار الأنبياء والصالحين ، وإن تقادمت أعصارهم وخفيت آثارهم ; كما أن في الأول دليلا على بغض أهل الفساد وذم ديارهم وآثارهم . هذا ، وإن كان التحقيق أن الجمادات غير مؤاخذات ، لكن المقرون بالمحبوب محبوب ، والمقرون بالمكروه المبغوض مبغوض ; كما قال كثير :\nأحب لحبها السودان حتى أحب لحبها سود الكلاب\nوكما قال آخر :\nأمر على الديار ديار ليلى أقبل ذا الجدار وذا الجدارا\nوما تلك الديار شغفن قلبي ولكن حب من سكن الديارا\nوسادسها : منع بعض العلماء الصلاة بهذا الموضع وقال : لا تجوز الصلاة فيها لأنها دار سخط وبقعة غضب . قال ابن العربي : فصارت هذه البقعة مستثناة من قوله - صلى الله عليه وسلم - : جعلت لي الأرض مسجدا وطهورا فلا يجوز التيمم بترابها ولا الوضوء من مائها ولا الصلاة فيها . وقد روى الترمذي عن ابن عمر أن رسول الله - صلى الله عليه وسلم - نهى أن يصلى في سبع مواطن : في المزبلة والمجزرة والمقبرة وقارعة الطريق ، وفي الحمام وفي معاطن الإبل وفوق بيت الله . وفي الباب عن أبي مرثد وجابر وأنس : حديث ابن عمر إسناده ليس بذاك القوي ، وقد تكلم في زيد بن جبيرة من قبل حفظه . وقد زاد علماؤنا : الدار المغصوبة والكنيسة والبيعة والبيت الذي فيه تماثيل ، والأرض المغصوبة أو موضعا تستقبل فيه نائما أو وجه رجل أو جدارا عليه نجاسة . قال ابن العربي : ومن هذه المواضع ما منع لحق الغير ، ومنه ما منع لحق الله - تعالى - ، ومنه ما منع لأجل النجاسة المحققة أو لغلبتها ; فما منع لأجل النجاسة إن فرش فيه ثوب طاهر كالحمام والمقبرة فيها أو إليها فإن ذلك جائز في المدونة . وذكر أبو مصعب عنه الكراهة . وفرق علماؤنا بين المقبرة القديمة والجديدة لأجل النجاسة ، وبين مقبرة المسلمين والمشركين ; لأنها دار عذاب وبقعة سخط كالحجر . وقال مالك في المجموعة : لا يصلي في أعطان الإبل وإن فرش ثوبا ; كأنه رأى لها علتين : الاستتار بها ونفارها فتفسد على المصلي صلاته ، فإن كانت واحدة فلا بأس ; كما كان النبي - صلى الله عليه وسلم - يفعل ; في الحديث الصحيح . وقال مالك : لا يصلى على بساط فيه تماثيل إلا من ضرورة . وكره ابن القاسم الصلاة إلى القبلة فيها تماثيل ، وفي الدار المغصوبة ، فإن فعل أجزأه وذكر بعضهم عن مالك أن الصلاة في الدار المغصوبة لا تجزئ . قال ابن العربي : وذلك عندي بخلاف الأرض . فإن الدار لا تدخل إلا بإذن ، والأرض وإن كانت ملكا فإن المسجدية فيها قائمة لا يبطلها الملك .\nقلت : الصحيح - إن شاء الله - الذي يدل عليه النظر والخبر أن الصلاة بكل موضع طاهر جائزة صحيحة . وما روي من قوله - صلى الله عليه وسلم - : إن هذا واد به شيطان وقد رواه معمر عن الزهري فقال : واخرجوا عن الموضع الذي أصابتكم فيه الغفلة . وقول علي : نهاني رسول الله - صلى الله عليه وسلم - أن أصلي بأرض بابل فإنها ملعونة . وقوله - عليه السلام - حين مر بالحجر من ثمود : لا تدخلوا على هؤلاء المعذبين إلا أن تكونوا باكين ونهيه عن الصلاة في معاطن الإبل إلى ذلك مما في هذا الباب ، فإنه مردود إلى الأصول المجتمع عليها والدلائل الصحيح مجيئها . قال الإمام الحافظ أبو عمر : المختار عندنا في هذا الباب أن ذلك الوادي وغيره من بقاع الأرض جائز أن يصلى فيها كلها ما لم تكن فيها نجاسة متيقنة تمنع من ذلك ، ولا معنى لاعتلال من اعتل بأن موضع النوم عن الصلاة موضع شيطان ، وموضع ملعون لا يجب أن تقام فيه الصلاة ، وكل ما روي في هذا الباب من النهي عن الصلاة في المقبرة وبأرض بابل وأعطان الإبل وغير ذلك مما في هذا المعنى ، كل ذلك عندنا منسوخ ومدفوع لعموم قوله - صلى الله عليه وسلم - : جعلت لي الأرض كلها مسجدا وطهورا ، وقوله - صلى الله عليه وسلم - مخبرا : إن ذلك من فضائله ومما خص به ، وفضائله عند أهل العلم لا يجوز عليها النسخ ولا التبديل ولا النقص . قال - صلى الله عليه وسلم - : أوتيت خمسا - وقد روي ستا ، وقد روي ثلاثا وأربعا ، وهي تنتهي إلى أزيد من تسع ، قال فيهن - لم يؤتهن أحد قبلي بعثت إلى الأحمر والأسود ونصرت بالرعب وجعلت أمتي خير الأمم وأحلت لي الغنائم وجعلت لي الأرض مسجدا وطهورا وأوتيت الشفاعة وبعثت بجوامع الكلم وبينا أنا نائم أوتيت بمفاتيح الأرض فوضعت في يدي وأعطيت الكوثر . وختم بي النبيون رواه جماعة من الصحابة . وبعضهم يذكر بعضها ، ويذكر بعضهم ما لم يذكر غيره ، وهي صحاح كلها . وجائز على فضائله الزيادة وغير جائز فيها النقصان ; ألا ترى أنه كان عبدا قبل أن يكون نبيا ثم كان نبيا قبل أن يكون رسولا ; وكذلك روي عنه . وقال : ما أدري ما يفعل بي ولا بكم ثم نزلت ليغفر لك الله ما تقدم من ذنبك وما تأخر . وسمع رجلا يقول : يا خير البرية ; فقال : ذاك إبراهيم وقال : لا يقولن أحدكم أنا خير من يونس بن متى وقال : السيد يوسف بن يعقوب بن إسحاق بن إبراهيم - عليهم السلام - ثم قال بعد ذلك كله : أنا سيد ولد آدم ولا فخر . ففضائله - صلى الله عليه وسلم - لم تزل تزداد إلى أن قبضه الله ; فمن هاهنا قلنا : إنه لا يجوز عليها النسخ ولا الاستثناء ولا النقصان ، وجائز فيها الزيادة . وبقوله - صلى الله عليه وسلم - : جعلت لي الأرض مسجدا وطهورا أجزنا الصلاة في المقبرة والحمام وفي كل موضع من الأرض إذا كان طاهرا من الأنجاس . وقال - صلى الله عليه وسلم - لأبي ذر : حيثما أدركتك الصلاة فصل فإن الأرض كلها مسجد ذكره البخاري ولم يخص موضعا من موضع . وأما من احتج بحديث ابن وهب قال : أخبرني يحيى بن أيوب عن زيد بن جبيرة عن داود بن حصين عن نافع عن ابن عمر حديث الترمذي الذي ذكرناه فهو حديث انفرد به زيد بن جبيرة وأنكروه عليه ، ولا يعرف هذا الحديث مسندا إلا برواية يحيى بن أيوب عن زيد بن جبيرة . وقد كتب الليث بن سعد إلى عبد الله بن نافع مولى ابن عمر يسأله عن هذا الحديث ، وكتب إليه عبد الله بن نافع لا أعلم من حدث بهذا عن نافع إلا قد قال عليه الباطل . ذكره الحلواني عن سعيد بن أبي مريم عن الليث ، وليس فيه تخصيص مقبرة المشركين من غيرها . وقد روي عن علي بن أبي طالب قال : نهاني حبيبي - صلى الله عليه وسلم - أن أصلي في المقبرة ، ونهاني أن أصلي في أرض بابل فإنها ملعونة . وإسناده ضعيف مجتمع على ضعفه ، وأبو صالح الذي رواه عن علي هو سعيد بن عبد الرحمن الغفاري ، بصري ليس بمشهور ولا يصح له سماع عن علي ، ومن دونه مجهولون لا يعرفون . قال أبو عمر : وفي الباب عن علي من قوله غير مرفوع حديث حسن الإسناد ، رواه الفضل بن دكين قال : حدثنا المغيرة بن أبي الحر الكندي قال حدثني أبو العنبس حجر بن عنبس قال : خرجنا مع علي إلى الحرورية ، فلما جاوزنا سوريا وقع بأرض بابل ، قلنا : يا أمير المؤمنين أمسيت ، الصلاة الصلاة ; فأبى أن يكلم أحدا . قالوا : يا أمير المؤمنين ، قد أمسيت . قال بلى ، ولكن لا أصلي في أرض خسف الله بها . والمغيرة بن أبي الحر كوفي ثقة ; قاله يحيى بن معين وغيره . وحجر بن عنبس من كبار أصحاب علي . وروى الترمذي عن أبي سعيد الخدري قال : قال رسول الله - صلى الله عليه وسلم - : الأرض كلها مسجد إلا المقبرة والحمام . قال الترمذي : رواه سفيان الثوري عن عمرو بن يحيى عن أبيه عن النبي - صلى الله عليه وسلم - مرسلا ، وكأنه أثبت وأصح . قال أبو عمر : فسقط الاحتجاج به عند من لا يرى المرسل حجة ، ولو ثبت كان الوجه ما ذكرنا . ولسنا نقول كما قال بعض المنتحلين لمذهب المدنيين : أن المقبرة في هذا الحديث وغيره أريد بها مقبرة المشركين خاصة ; فإنه قال : المقبرة والحمام بالألف واللام ; فغير جائز أن يرد ذلك إلى مقبرة دون مقبرة أو حمام دون حمام بغير توقيف عليه ، فهو قول لا دليل عليه من كتاب ولا سنة ولا خبر صحيح ، ولا مدخل له في القياس ولا في المعقول ، ولا دل عليه فحوى الخطاب ولا خرج عليه الخبر . ولا يخلو تخصيص من خص مقبرة المشركين من أحد وجهين : إما أن يكون من أجل اختلاف الكفار إليها بأقدامهم فلا معنى لخصوص المقبرة بالذكر ; لأن كل موضع هم فيه بأجسامهم وأقدامهم فهو كذلك ، وقد جل رسول الله - صلى الله عليه وسلم - أن يتكلم بما لا معنى له . أو يكون من أجل أنها بقعة سخط ، فلو كان كذلك ما كان رسول الله - صلى الله عليه وسلم - ليبني مسجده في مقبرة المشركين وينبشها ويسويها ويبني عليها ، ولو جاز لقائل أن يخص من المقام مقبرة للصلاة فيها لكانت مقبرة المشركين أولى بالخصوص والاستثناء من أجل هذا الحديث . وكل من كره الصلاة في المقبرة لم يخص مقبرة من مقبرة ; لأن الألف واللام إشارة إلى الجنس لا إلى معهود ، ولو كان بين مقبرة المسلمين والمشركين فرق لبينه - صلى الله عليه وسلم - ولم يهمله ; لأنه بعث مبينا . ولو ساغ لجاهل أن يقول : مقبرة كذا لجاز لآخر أن يقول : حمام كذا ; لأن في الحديث المقبرة والحمام . وكذلك قوله : المزبلة والمجزرة ; غير جائز أن يقال : مزبلة كذا ولا مجزرة كذا ولا طريق كذا ; لأن التحكم في دين الله غير جائز . وأجمع العلماء على أن التيمم على مقبرة المشركين إذا كان الموضع طيبا طاهرا نظيفا جائز . وكذلك أجمعوا على أن من صلى في كنيسة أو بيعة على موضع طاهر ، أن صلاته ماضية جائزة . وقد تقدم هذا في سورة \" براءة \" . ومعلوم أن الكنيسة أقرب إلى أن تكون بقعة سخط من المقبرة ; لأنها بقعة يعصى الله ويكفر به فيها ، وليس كذلك المقبرة . وقد وردت السنة باتخاذ البيع والكنائس مساجد . روى النسائي عن طلق بن علي قال : خرجنا وفدا إلى النبي - صلى الله عليه وسلم - فبايعناه وصلينا معه ، وأخبرناه أن بأرضنا بيعة لنا ، وذكر الحديث . وفيه : فإذا أتيتم أرضكم فاكسروا بيعتكم واتخذوها مسجدا . وذكر أبو داود عن عثمان بن أبي العاص أن النبي - صلى الله عليه وسلم - أمره أن يجعل مسجد الطائف حيث كانت طواغيتهم . وقد تقدم في \" براءة \" . وحسبك بمسجد النبي - صلى الله عليه وسلم - الذي أسس على التقوى مبنيا في مقبرة المشركين ; وهو حجة على كل من كره الصلاة فيها . وممن كره الصلاة في المقبرة سواء كانت لمسلمين أو مشركين الثوري وأبو حنيفة والأوزاعي والشافعي وأصحابهم وعند الثوري لا يعيد . وعند الشافعي أجزأه إذا صلى في المقبرة في موضع ليس فيه نجاسة ; للأحاديث المعلومة في ذلك ، ولحديث أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : صلوا في بيوتكم ولا تتخذوها قبورا ، ولحديث أبي مرثد الغنوي عن النبي - صلى الله عليه وسلم - أنه قال : لا تصلوا إلى القبور ولا تجلسوا عليها . وهذان حديثان ثابتان من جهة الإسناد ، ولا حجة فيهما ; لأنهما محتملان للتأويل ، ولا يجب أن يمتنع من الصلاة في كل موضع طاهر إلا بدليل لا يحتمل تأويلا . ولم يفرق أحد من فقهاء المسلمين بين مقبرة المسلمين والمشركين إلا ما حكيناه من خطل القول الذي لا يشتغل بمثله ، ولا وجه له في نظر ولا في صحيح أثر .\nوثامنها : الحائط يلقى فيه النتن والعذرة ليكرم فلا يصلى فيه حتى يسقى ثلاث مرات ، لما رواه الدارقطني عن مجاهد عن ابن عباس عن النبي - صلى الله عليه وسلم - في الحائط يلقى فيه العذرة والنتن قال : إذا سقي ثلاث مرات فصل فيه . وخرجه أيضا من حديث نافع عن ابن عمر أنه سئل عن هذه الحيطان التي تلقى فيها العذرات وهذا الزبل ، أيصلى فيها ؟ فقال : إذا سقيت ثلاث مرات فصل فيها . رفع ذلك إلى النبي - صلى الله عليه وسلم - واختلف في الإسناد ، والله أعلم .\n                                    ",
      "saadi": "وَلَقَدۡ كَذَّبَ أَصۡحَٰبُ ٱلۡحِجۡرِ ٱلۡمُرۡسَلِينَ ٠٨\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن أهل الحجر، وهم قوم صالح الذين كانوا يسكنون الحجر المعروف في أرض الحجاز، أنهم كذبوا المرسلين أي: كذبوا صالحا، ومن كذب رسولا فقد كذب سائر الرسل، لاتفاق دعوتهم، وليس تكذيب بعضهم لشخصه بل لما جاء به من الحق الذي اشترك جميع الرسل بالإتيان به\n                                    "
    }
  },
  {
    "id": 80,
    "versesNumber": 81,
    "souraName": "Al-Hijr.html",
    "contnent": "وَءَاتَيۡنَٰهُمۡ ءَايَٰتِنَا فَكَانُواْ عَنۡهَا مُعۡرِضِينَ ١٨",
    "tafsier": {
      "ibnkther": "وَءَاتَيۡنَٰهُمۡ ءَايَٰتِنَا فَكَانُواْ عَنۡهَا مُعۡرِضِينَ ١٨\n                                    \n                                    \n                                    وذكر تعالى أنه آتاهم من الآيات ما يدلهم على صدق ما جاءهم به صالح ، كالناقة التي أخرجها الله لهم بدعاء صالح من صخرة صماء فكانت تسرح في بلادهم ، لها شرب ولهم شرب يوم معلوم . فلما عتوا وعقروها قال لهم : ( تمتعوا في داركم ثلاثة أيام ذلك وعد غير مكذوب ) [ هود : 65 ] وقال تعالى : ( وأما ثمود فهديناهم فاستحبوا العمى على الهدى ) [ فصلت : 17 ]\n                                    ",
      "qortoby": "وَءَاتَيۡنَٰهُمۡ ءَايَٰتِنَا فَكَانُواْ عَنۡهَا مُعۡرِضِينَ ١٨\n                                    \n                                    \n                                    قوله تعالى : وآتيناهم آياتنا فكانوا عنها معرضين قوله تعالى : وآتيناهم آياتنا أي بآياتنا . كقوله : آتنا غداءنا أي بغدائنا . والمراد الناقة ، وكان فيها آيات جمة : خروجها من الصخرة ، ودنو نتاجها عند خروجها ، وعظمها حتى لم تشبهها ناقة ، وكثرة لبنها حتى تكفيهم جميعا . ويحتمل أنه كان لصالح آيات أخر سوى الناقة ، كالبئر وغيره .\nمعرضين أي لم يعتبروا .\n                                    ",
      "saadi": "وَءَاتَيۡنَٰهُمۡ ءَايَٰتِنَا فَكَانُواْ عَنۡهَا مُعۡرِضِينَ ١٨\n                                        \n                                        \n                                        \n                                        { وَآتَيْنَاهُمْ آيَاتِنَا } الدالة على صحة ما جاءهم به صالح من الحق التي من جملتها: تلك الناقة التي هي من آيات الله العظيمة.\n{ فَكَانُوا عَنْهَا مُعْرِضِينَ } كبرا وتجبرا على الله\n                                    "
    }
  },
  {
    "id": 81,
    "versesNumber": 82,
    "souraName": "Al-Hijr.html",
    "contnent": "وَكَانُواْ يَنۡحِتُونَ مِنَ ٱلۡجِبَالِ بُيُوتًا ءَامِنِينَ ٢٨",
    "tafsier": {
      "ibnkther": "وَكَانُواْ يَنۡحِتُونَ مِنَ ٱلۡجِبَالِ بُيُوتًا ءَامِنِينَ ٢٨\n                                    \n                                    \n                                    وذكر تعالى : أنهم كانوا ( ينحتون من الجبال بيوتا آمنين ) أي : من غير خوف ولا احتياج إليها ، بل أشرا وبطرا وعبثا ، كما هو المشاهد من صنيعهم في بيوتهم بوادي الحجر ، الذي مر به رسول الله - صلى الله عليه وسلم - وهو ذاهب إلى تبوك فقنع رأسه وأسرع دابته ، وقال لأصحابه : \" لا تدخلوا بيوت القوم المعذبين إلا أن تكونوا باكين ، فإن لم تبكوا فتباكوا خشية أن يصيبكم ما أصابهم \"\n                                    ",
      "qortoby": "وَكَانُواْ يَنۡحِتُونَ مِنَ ٱلۡجِبَالِ بُيُوتًا ءَامِنِينَ ٢٨\n                                    \n                                    \n                                    قوله تعالى : وكانوا ينحتون من الجبال بيوتا آمنين\nالنحت في كلام العرب : البري والنجر . نحته ينحته ( بالكسر ) نحتا أي براه . والنحاتة البراية . والمنحت ما ينحت به . وفي التنزيل أتعبدون ما تنحتون أي تنجرون وتصنعون . فكانوا يتخذون من الجبال بيوتا لأنفسهم بشدة قوتهم .\nآمنين أي من أن تسقط عليهم أو تخرب . وقيل : آمنين من الموت . وقيل : من العذاب .\n                                    ",
      "saadi": "وَكَانُواْ يَنۡحِتُونَ مِنَ ٱلۡجِبَالِ بُيُوتًا ءَامِنِينَ ٢٨\n                                        \n                                        \n                                        \n                                        { وَكَانُوا } من كثرة إنعام الله عليهم { يَنْحِتُونَ مِنَ الْجِبَالِ بُيُوتًا آمِنِينَ } من المخاوف مطمئنين في ديارهم، فلو شكروا النعمة وصدقوا نبيهم صالحا عليه السلام لأدرَّ الله عليهم الأرزاق، ولأكرمهم بأنواع من الثواب العاجل والآجل، ولكنهم -لما كذبوا وعقروا الناقة، وعتوا عن أمر ربهم وقالوا: { يا صالح ائتنا بما تعدنا إن كنت من الصادقين }\n                                    "
    }
  },
  {
    "id": 82,
    "versesNumber": 83,
    "souraName": "Al-Hijr.html",
    "contnent": "فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ مُصۡبِحِينَ ٣٨",
    "tafsier": {
      "ibnkther": "فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ مُصۡبِحِينَ ٣٨\n                                    \n                                    \n                                    وقوله : ( فأخذتهم الصيحة مصبحين ) أي : وقت الصباح من اليوم الرابع\n                                    ",
      "qortoby": "فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ مُصۡبِحِينَ ٣٨\n                                    \n                                    \n                                    أي في وقت الصبح , وهو نصب على الحال .\nوقد تقدم ذكر الصيحة في هود والأعراف .\n                                    ",
      "saadi": "فَأَخَذَتۡهُمُ ٱلصَّيۡحَةُ مُصۡبِحِينَ ٣٨\n                                        \n                                        \n                                        \n                                        { فَأَخَذَتْهُمُ الصَّيْحَةُ مُصْبِحِينَ } فتقطعت قلوبهم في أجوافهم وأصبحوا في دارهم جاثمين هلكى، مع ما يتبع ذلك من الخزي واللعنة المستمرة\n                                    "
    }
  },
  {
    "id": 83,
    "versesNumber": 84,
    "souraName": "Al-Hijr.html",
    "contnent": "فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ ٤٨",
    "tafsier": {
      "ibnkther": "فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ ٤٨\n                                    \n                                    \n                                    ( فما أغنى عنهم ما كانوا يكسبون ) أي : ما كانوا يستغلونه من زروعهم وثمارهم التي ضنوا بمائها عن الناقة ، حتى عقروها لئلا تضيق عليهم في المياه ، فما دفعت عنهم تلك الأموال ، ولا نفعتهم لما جاء أمر ربك .\n                                    ",
      "qortoby": "فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ ٤٨\n                                    \n                                    \n                                    من الأموال والحصون في الجبال , ولا ما أعطوه من القوة .\n                                    ",
      "saadi": "فَمَآ أَغۡنَىٰ عَنۡهُم مَّا كَانُواْ يَكۡسِبُونَ ٤٨\n                                        \n                                        \n                                        \n                                        { فَمَا أَغْنَى عَنْهُمْ مَا كَانُوا يَكْسِبُونَ } لأن أمر الله إذا جاء لا يرده كثرة جنود، ولا قوة أنصار ولا غزارة أموال.\n                                    "
    }
  },
  {
    "id": 84,
    "versesNumber": 85,
    "souraName": "Al-Hijr.html",
    "contnent": "وَمَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّۗ وَإِنَّ ٱلسَّاعَةَ لَأٓتِيَةٞۖ فَٱصۡفَحِ ٱلصَّفۡحَ ٱلۡجَمِيلَ ٥٨",
    "tafsier": {
      "ibnkther": "وَمَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّۗ وَإِنَّ ٱلسَّاعَةَ لَأٓتِيَةٞۖ فَٱصۡفَحِ ٱلصَّفۡحَ ٱلۡجَمِيلَ ٥٨\n                                    \n                                    \n                                    يقول تعالى : ( وما خلقنا السماوات والأرض وما بينهما إلا بالحق ) أي : بالعدل ; ( ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى ) [ النجم : 31 ] وقال تعالى : ( وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا فويل للذين كفروا من النار ) وقال ( أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون فتعالى الله الملك الحق لا إله إلا هو رب العرش الكريم ) [ المؤمنون : 115 - 116 ]\nثم أخبر نبيه بقيام الساعة ، وأنها كائنة لا محالة ، ثم أمره بالصفح الجميل عن المشركين ، في أذاهم له وتكذيبهم ما جاءهم به ، كما قال تعالى : ( فاصفح عنهم وقل سلام فسوف يعلمون ) [ الزخرف : 89 ]\nوقال مجاهد وقتادة وغيرهما : كان هذا قبل القتال . وهو كما قالا فإن هذه مكية ، والقتال إنما شرع بعد الهجرة .\n                                    ",
      "qortoby": "وَمَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّۗ وَإِنَّ ٱلسَّاعَةَ لَأٓتِيَةٞۖ فَٱصۡفَحِ ٱلصَّفۡحَ ٱلۡجَمِيلَ ٥٨\n                                    \n                                    \n                                    قوله تعالى : وما خلقنا السماوات والأرض وما بينهما إلا بالحق وإن الساعة لآتية فاصفح الصفح الجميل\nقوله تعالى : وما خلقنا السماوات والأرض وما بينهما إلا بالحق أي للزوال والفناء . وقيل : أي لأجازي المحسن والمسيء ; كما قال : ولله ما في السماوات وما في الأرض ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى .\nوإن الساعة لآتية أي لكائنة فيجزى كل بعمله .\nفاصفح الصفح الجميل مثل واهجرهم هجرا جميلا أي تجاوز عنهم يا محمد ، واعف عفوا حسنا ; ثم نسخ بالسيف . قال قتادة : نسخه قوله :\nفخذوهم واقتلوهم حيث ثقفتموهم . وأن النبي - صلى الله عليه وسلم - قال لهم : لقد جئتكم بالذبح وبعثت بالحصاد ولم أبعث بالزراعة ; قاله عكرمة ومجاهد . وقيل : ليس بمنسوخ ، وأنه أمر بالصفح في حق نفسه فيما بينه وبينهم . والصفح : الإعراض عن الحسن وغيره .\n                                    ",
      "saadi": "وَمَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّۗ وَإِنَّ ٱلسَّاعَةَ لَأٓتِيَةٞۖ فَٱصۡفَحِ ٱلصَّفۡحَ ٱلۡجَمِيلَ ٥٨\n                                        \n                                        \n                                        \n                                        أي: ما خلقناهما عبثا وباطلا كما يظن ذلك أعداء الله، بل ما خلقناهما { إِلَّا بِالْحَقِّ } الذي منه أن يكونا بما فيهما دالتين على كمال خالقهما، واقتداره، وسعة رحمته وحكمته، وعلمه المحيط، وأنه الذي لا تنبغي العبادة إلا له وحده لا شريك له، { وَإِنَّ السَّاعَةَ لَآتِيَةٌ } لا ريب فيها لخلق السماوات والأرض أكبر من خلق الناس { فَاصْفَحِ الصَّفْحَ الْجَمِيلَ } وهو الصفح الذي لا أذية فيه بل يقابل إساءة المسيء بالإحسان، وذنبه بالغفران، لتنال من ربك جزيل الأجر والثواب، فإن كل ما هو آت فهو قريب، وقد ظهر لي معنى أحسن مما ذكرت هنا.\nوهو: أن المأمور به هو الصفح الجميل أي: الحسن الذي قد سلم من الحقد والأذية القولية والفعلية، دون الصفح الذي ليس بجميل، وهو الصفح في غير محله، فلا يصفح حيث اقتضى المقام العقوبة، كعقوبة المعتدين الظالمين الذين لا ينفع فيهم إلا العقوبة، وهذا هو المعنى.\n                                    "
    }
  },
  {
    "id": 85,
    "versesNumber": 86,
    "souraName": "Al-Hijr.html",
    "contnent": " إِنَّ رَبَّكَ هُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ ٦٨",
    "tafsier": {
      "ibnkther": "إِنَّ رَبَّكَ هُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ ٦٨\n                                    \n                                    \n                                    وقوله : ( إن ربك هو الخلاق العليم ) تقرير للمعاد ، وأنه تعالى قادر على إقامة الساعة ، فإنه الخلاق الذي لا يعجزه خلق ما يشاء ، وهو العليم بما تمزق من الأجساد ، وتفرق في سائر أقطار الأرض ، كما قال تعالى : ( أوليس الذي خلق السماوات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم إنما أمره إذا أراد شيئا أن يقول له كن فيكون فسبحان الذي بيده ملكوت كل شيء وإليه ترجعون ) [ يس : 81 - 83 ] .\n                                    ",
      "qortoby": "إِنَّ رَبَّكَ هُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ ٦٨\n                                    \n                                    \n                                    إن ربك هو الخلاق أي المقدر للخلق والأخلاق .\nالعليم بأهل الوفاق والنفاق .\n                                    ",
      "saadi": "إِنَّ رَبَّكَ هُوَ ٱلۡخَلَّٰقُ ٱلۡعَلِيمُ ٦٨\n                                        \n                                        \n                                        \n                                        { إِنَّ رَبَّكَ هُوَ الْخَلَّاقُ } لكل مخلوق { الْعَلِيمُ } بكل شيء، فلا يعجزه أحد من جميع ما أحاط به علمه وجرى عليه خلقه، وذلك سائر الموجودات.\n                                    "
    }
  },
  {
    "id": 86,
    "versesNumber": 87,
    "souraName": "Al-Hijr.html",
    "contnent": "وَلَقَدۡ ءَاتَيۡنَٰكَ سَبۡعٗا مِّنَ ٱلۡمَثَانِي وَٱلۡقُرۡءَانَ ٱلۡعَظِيمَ ٧٨",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ ءَاتَيۡنَٰكَ سَبۡعٗا مِّنَ ٱلۡمَثَانِي وَٱلۡقُرۡءَانَ ٱلۡعَظِيمَ ٧٨\n                                    \n                                    \n                                    يقول تعالى لنبيه : كما آتيناك القرآن العظيم ، فلا تنظرن إلى الدنيا وزينتها ، وما متعنا به أهلها من الزهرة الفانية لنفتنهم فيه ، فلا تغبطهم بما هم فيه ، ولا تذهب نفسك عليهم حسرات حزنا عليهم في تكذيبهم لك ، ومخالفتهم دينك . ( واخفض جناحك لمن اتبعك من المؤمنين ) [ الشعراء : 215 ] أي : ألن لهم جانبك كما قال تعالى : ( لقد جاءكم رسول من أنفسكم عزيز عليه ما عنتم حريص عليكم بالمؤمنين رءوف رحيم ) [ التوبة : 128 ]\nوقد اختلف في السبع المثاني : ما هي ؟\nفقال ابن مسعود ، وابن عمر ، وابن عباس ، ومجاهد ، وسعيد بن جبير ، والضحاك وغير واحد : هي السبع الطول . يعنون : البقرة ، وآل عمران ، والنساء ، والمائدة ، والأنعام ، والأعراف ، ويونس ، نص عليه ابن عباس ، وسعيد بن جبير .\nوقال سعيد : بين فيهن الفرائض ، والحدود ، والقصص ، والأحكام .\nوقال ابن عباس : بين الأمثال والخبر والعبر\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا ابن أبي عمر قال : قال سفيان : ( المثاني ) المثنى : البقرة ، وآل عمران ، والنساء ، والمائدة ، والأنعام ، والأعراف ، والأنفال وبراءة سورة واحدة .\nقال ابن عباس : ولم يعطهن أحد إلا النبي - صلى الله عليه وسلم - وأعطي موسى منهن ثنتين .\nرواه هشيم ، عن الحجاج ، عن الوليد بن العيزار عن سعيد بن جبير عنه .\n[ و ] قال الأعمش ، عن مسلم البطين ، عن سعيد بن جبير ، عن ابن عباس قال : أوتي النبي - صلى الله عليه وسلم - سبعا من المثاني الطول ، وأوتي موسى - عليه السلام - ستا ، فلما ألقى الألواح ارتفع اثنتان وبقيت أربع .\nوقال مجاهد : هي السبع الطول . ويقال : هي القرآن العظيم .\nوقال خصيف ، عن زياد بن أبي مريم في قوله تعالى : ( سبعا من المثاني ) قال : أعطيتك سبعة أجزاء : آمر ، وأنهى ، وأبشر وأنذر ، وأضرب الأمثال ، وأعدد النعم ، وأنبئك بنبأ القرآن . رواه ابن جرير ، وابن أبي حاتم .\nوالقول الثاني : أنها الفاتحة ، وهي سبع آيات . روي ذلك عن عمر وعلي ، وابن مسعود ، وابن عباس . قال ابن عباس : والبسملة هي الآية السابعة ، وقد خصكم الله بها . وبه قال إبراهيم النخعي ، وعبد الله بن عبيد بن عمير ، وابن أبي مليكة ، وشهر بن حوشب ، والحسن البصري ، ومجاهد .\nوقال قتادة : ذكر لنا أنهن فاتحة الكتاب ، وأنهن يثنين في كل قراءة . وفي رواية : في كل ركعة مكتوبة أو تطوع .\nواختاره ابن جرير ، واحتج بالأحاديث الواردة في ذلك ، وقد قدمناها في فضائل سورة \" الفاتحة \" في أول التفسير ، ولله الحمد .\nوقد أورد البخاري - رحمه الله - هاهنا حديثين :\nأحدهما : قال : حدثنا محمد بن بشار ، حدثنا غندر ، حدثنا شعبة ، عن خبيب بن عبد الرحمن ، عن حفص بن عاصم ، عن أبي سعيد بن المعلى قال : مر بي النبي - صلى الله عليه وسلم - وأنا أصلي ، فدعاني فلم آته حتى صليت ، ثم أتيته فقال : \" ما منعك أن تأتيني ؟ \" . فقلت : كنت أصلي . فقال : \" ألم يقل الله : ( يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم ) [ الأنفال : 24 ] ألا أعلمك أعظم سورة في القرآن قبل أن أخرج من المسجد ؟ \" فذهب النبي - صلى الله عليه وسلم - ليخرج ، فذكرته فقال : \" ( الحمد لله رب العالمين ) [ الفاتحة : 2 ] هي السبع المثاني والقرآن العظيم الذي أوتيته \"\n[ و ] الثاني : قال : حدثنا آدم ، حدثنا ابن أبي ذئب ، حدثنا المقبري ، عن أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" أم القرآن هي : السبع المثاني والقرآن العظيم \"\nفهذا نص في أن الفاتحة السبع المثاني والقرآن العظيم ، ولكن لا ينافي وصف غيرها من السبع الطول بذلك ، لما فيها من هذه الصفة ، كما لا ينافي وصف القرآن بكماله بذلك أيضا ، كما قال تعالى : ( الله نزل أحسن الحديث كتابا متشابها مثاني ) [ الزمر : 23 ] فهو مثاني من وجه ، ومتشابه من وجه ، وهو القرآن العظيم أيضا ، كما أنه - عليه السلام - لما سئل عن المسجد الذي أسس على التقوى ، فأشار إلى مسجده ، والآية نزلت في مسجد قباء ، فلا تنافي ، فإن ذكر الشيء لا ينفي ذكر ما عداه إذا اشتركا في تلك الصفة ، والله أعلم .\n                                    ",
      "qortoby": "وَلَقَدۡ ءَاتَيۡنَٰكَ سَبۡعٗا مِّنَ ٱلۡمَثَانِي وَٱلۡقُرۡءَانَ ٱلۡعَظِيمَ ٧٨\n                                    \n                                    \n                                    قوله تعالى : ولقد آتيناك سبعا من المثاني والقرآن العظيم اختلف العلماء في السبع المثاني ; فقيل : الفاتحة ; قاله علي بن أبى طالب وأبو هريرة والربيع بن أنس وأبو العالية والحسن وغيرهم ، وروي عن النبي - صلى الله عليه وسلم - من وجوه ثابتة ، من حديث أبي بن كعب وأبي سعيد بن المعلى . وقد تقدم في تفسير الفاتحة . وخرج الترمذي من حديث أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : الحمد لله أم القرآن وأم الكتاب والسبع المثاني . قال : هذا حديث حسن صحيح . وهذا نص ، وقد تقدم في الفاتحة . وقال الشاعر :\nنشدتكم بمنزل القرآن أم الكتاب السبع من مثاني\nوقال ابن عباس : ( هي السبع الطول : البقرة ، وآل عمران ، والنساء ، والمائدة ، والأنعام ، والأعراف ، والأنفال والتوبة معا ; إذ ليس بينهما التسمية ) . روى النسائي حدثنا علي بن حجر أخبرنا شريك عن أبي إسحاق عن سعيد بن جبير . عن ابن عباس في قوله - عز وجل - : سبعا من المثاني قال : السبع الطول ، وسميت مثاني لأن العبر والأحكام والحدود ثنيت فيها . وأنكر قوم هذا وقالوا : أنزلت هذه الآية بمكة ، ولم ينزل من الطول شيء إذ ذاك . وأجيب بأن الله - تعالى - أنزل القرآن إلى السماء الدنيا ثم أنزل منها نجوما ، فما أنزله إلى السماء الدنيا فكأنما آتاه محمدا - صلى الله عليه وسلم - وإن لم ينزل عليه بعد . وممن قال إنها السبع الطول : عبد الله بن مسعود وعبد الله بن عمر وسعيد بن جبير ومجاهد . وقال جرير :\nجزى الله الفرزدق حين يمسي مضيعا للمفصل والمثاني\nوقيل : ( المثاني القرآن كله ; قال الله - تعالى - : كتابا متشابها مثاني . هذا قول الضحاك وطاوس وأبي مالك ، وقاله ابن عباس . وقيل له مثاني لأن الأنباء والقصص ثنيت فيه . وقالت صفية بنت عبد المطلب ترثي رسول الله - صلى الله عليه وسلم - :\nفقد كان نورا ساطعا يهتدى به يخص بتنزيل القرآن المعظم\nأي القرآن . وقيل : المراد بالسبع المثاني أقسام القرآن من الأمر والنهي والتبشير والإنذار وضرب الأمثال وتعديد نعم وأنباء قرون ; قال زياد بن أبي مريم . والصحيح الأول لأنه نص . وقد قدمنا في الفاتحة أنه ليس في تسميتها بالمثاني ما يمنع من تسمية غيرها بذلك ; إلا أنه إذا ورد عن النبي - صلى الله عليه وسلم - وثبت عنه نص في شيء لا يحتمل التأويل كان الوقوف عنده .\nقوله تعالى : والقرآن العظيم فيه إضمار تقديره : وهو أن الفاتحة القرآن العظيم لاشتمالها على ما يتعلق بأصول الإسلام . وقد تقدم في الفاتحة . وقيل : الواو مقحمة ، التقدير : ولقد آتيناك سبعا من المثاني القرآن العظيم . ومنه قول الشاعر :\nإلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم\nوقد تقدم عند قوله : حافظوا على الصلوات والصلاة الوسطى\n                                    ",
      "saadi": "وَلَقَدۡ ءَاتَيۡنَٰكَ سَبۡعٗا مِّنَ ٱلۡمَثَانِي وَٱلۡقُرۡءَانَ ٱلۡعَظِيمَ ٧٨\n                                        \n                                        \n                                        \n                                        يقول تعالى ممتنًّا على رسوله { ولقد آتيناك سبعا من المثاني } وهن -على الصحيح- السور السبع الطوال: \" البقرة \" و \" آل عمران \" و \" النساء \" و \" المائدة \" و \" الأنعام \" و \" الأعراف \" و \" الأنفال \" مع \" التوبة \" أو أنها فاتحة الكتاب لأنها سبع آيات، فيكون عطف { القرآن العظيم } على ذلك من باب عطف العام على الخاص، لكثرة ما في المثاني من التوحيد، وعلوم الغيب، والأحكام الجليلة، وتثنيتها فيها.وعلى القول بأن \" الفاتحة \" هي السبع المثاني معناها: أنها سبع آيات، تثنى في كل ركعة، واذا كان الله قد أعطاه القرآن العظيم مع السبع المثاني كان قد أعطاه أفضل ما يتنافس فيه المتنافسون، وأعظم ما فرح به المؤمنون، { قل بفضل الله وبرحمته فبذلك فليفرحوا هو خير مما يجمعون }\n                                    "
    }
  },
  {
    "id": 87,
    "versesNumber": 88,
    "souraName": "Al-Hijr.html",
    "contnent": "لَا تَمُدَّنَّ عَيۡنَيۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّنۡهُمۡ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَٱخۡفِضۡ جَنَاحَكَ لِلۡمُؤۡمِنِينَ ٨٨",
    "tafsier": {
      "ibnkther": "لَا تَمُدَّنَّ عَيۡنَيۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّنۡهُمۡ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَٱخۡفِضۡ جَنَاحَكَ لِلۡمُؤۡمِنِينَ ٨٨\n                                    \n                                    \n                                    وقوله : ( لا تمدن عينيك إلى ما متعنا به أزواجا منهم ) أي : استغن بما آتاك الله من القرآن العظيم عما هم فيه من المتاع والزهرة الفانية .\nومن هاهنا ذهب ابن عيينة إلى تفسير الحديث الصحيح : \" ليس منا من لم يتغن بالقرآن \" إلى أنه يستغنى به عما عداه ، وهو تفسير صحيح ، ولكن ليس هو المقصود من الحديث ، كما تقدم في أول التفسير .\nوقال ابن أبي حاتم : ذكر عن وكيع بن الجراح ، حدثنا موسى بن عبيدة ، عن يزيد بن عبد الله بن قسيط ، عن أبي رافع صاحب النبي - صلى الله عليه وسلم - قال : أضاف النبي - صلى الله عليه وسلم - ضيفا ولم يكن عند النبي - صلى الله عليه وسلم - شيء يصلحه ، فأرسل إلى رجل من اليهود : يقول لك محمد رسول الله : أسلفني دقيقا إلى هلال رجب . قال : لا إلا برهن . فأتيت النبي - صلى الله عليه وسلم - [ فأخبرته ] فقال : \" أما والله إني لأمين من في السماء وأمين من في الأرض ولئن أسلفني أو باعني لأؤدين إليه \" . فلما خرجت من عنده نزلت هذه الآية : ( ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا ) إلى آخر الآية . [ طه : 131 ] كأنه يعزيه عن الدنيا\nوقال العوفي ، عن ابن عباس : ( لا تمدن عينيك ) قال : نهي الرجل أن يتمنى مال صاحبه .\nوقال مجاهد : ( إلى ما متعنا به أزواجا منهم ) هم الأغنياء .\n                                    ",
      "qortoby": "لَا تَمُدَّنَّ عَيۡنَيۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّنۡهُمۡ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَٱخۡفِضۡ جَنَاحَكَ لِلۡمُؤۡمِنِينَ ٨٨\n                                    \n                                    \n                                    قوله تعالى : لا تمدن عينيك إلى ما متعنا به أزواجا منهم ولا تحزن عليهم واخفض جناحك للمؤمنين فيه مسألتان : الأولى : قوله - تعالى - : لا تمدن عينيك المعنى : قد أغنيتك بالقرآن عما في أيدي الناس ; فإنه ليس منا من لم يتغن بالقرآن ; أي ليس منا من رأى أنه ليس يغنى بما عنده من القرآن حتى يطمح بصره إلى زخارف الدنيا وعنده معارف المولى . يقال : إنه وافى سبع قوافل من البصرى وأذرعات ليهود قريظة والنضير في يوم واحد ، فيها البر والطيب والجوهر وأمتعة البحر ، فقال المسلمون : لو كانت هذه الأموال لنا لتقوينا بها وأنفقناها في سبيل الله ، فأنزل الله - تعالى - : ولقد آتيناك سبعا من المثاني أي فهي خير لكم من القوافل السبع ، فلا تمدن أعينكم إليها . وإلى هذا صار ابن عيينة ، وأورد قوله - عليه السلام - : ليس منا من لم يتغن بالقرآن أي من لم يستغن به . وقد تقدم هذا المعنى في أول الكتاب . أزواجا منهم أي أمثالا في النعم ، أي الأغنياء بعضهم أمثال بعض في الغنى ، فهم أزواج .\nالثانية : هذه الآية تقتضي الزجر عن التشوف إلى متاع الدنيا على الدوام ، وإقبال العبد على عبادة مولاه . ومثله ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه الآية . وليس كذلك ; فإنه روي عن النبي - صلى الله عليه وسلم - أنه قال : حبب إلي من دنياكم النساء والطيب وجعلت قرة عيني في الصلاة . وكان - عليه الصلاة والسلام - يتشاغل بالنساء ، جبلة الآدمية وتشوف الخلقة الإنسانية ، ويحافظ على الطيب ، ولا تقر له عين إلا في الصلاة لدى مناجاة المولى . ويرى أن مناجاته أحرى من ذلك وأولى . ولم يكن في دين محمد الرهبانية والإقبال على الأعمال الصالحة بالكلية كما كان في دين عيسى ، وإنما شرع الله سبحانه حنيفية سمحة خالصة عن الحرج خفيفة على الآدمي ، يأخذ من الآدمية بشهواتها ويرجع إلى الله بقلب سليم . ورأى القراء والمخلصون من الفضلاء الانكفاف عن اللذات والخلوص لرب الأرض والسماوات اليوم أولى ; لما غلب على الدنيا من الحرام ، واضطر العبد في المعاش إلى مخالطة من لا تجوز مخالطته ومصانعة من تحرم مصانعته ، فكانت القراءة أفضل ، والفرار عن الدنيا أصوب للعبد وأعدل ; قال - صلى الله عليه وسلم - : يأتي على الناس زمان يكون خير مال المسلم غنما يتبع بها شعف الجبال ومواقع القطر يفر بدينه من الفتن .\nقوله تعالى : ولا تحزن عليهم أي ولا تحزن على المشركين إن لم يؤمنوا . وقيل : المعنى لا تحزن على ما متعوا به في الدنيا فلك في الآخرة أفضل منه . وقيل : لا تحزن عليهم إن صاروا إلى العذاب فهم أهل العذاب .\nواخفض جناحك للمؤمنين أي ألن جانبك لمن آمن بك وتواضع لهم . وأصله أن الطائر إذا ضم فرخه إلى نفسه بسط جناحه ثم قبضه على الفرخ ، فجعل ذلك وصفا لتقريب الإنسان أتباعه . ويقال : فلان خافض الجناح ، أي وقور ساكن . والجناحان من ابن آدم جانباه ; ومنه واضمم يدك إلى جناحك وجناح الطائر يده . وقال الشاعر :\nوحسبك فتية لزعيم قوم يمد على أخي سقم جناحا\nأي تواضعا ولينا .\n                                    ",
      "saadi": "لَا تَمُدَّنَّ عَيۡنَيۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّنۡهُمۡ وَلَا تَحۡزَنۡ عَلَيۡهِمۡ وَٱخۡفِضۡ جَنَاحَكَ لِلۡمُؤۡمِنِينَ ٨٨\n                                        \n                                        \n                                        \n                                        { لا تمدن عينيك إلى ما متعنا به أزواجا منهم } أي: لا تعجب إعجابا يحملك على إشغال فكرك بشهوات الدنيا التي تمتع بها المترفون، واغترَّ بها الجاهلون، واستغن بما آتاك الله من المثاني والقرآن العظيم، { ولا تحزن عليهم } فإنهم لا خير فيهم يرجى، ولا نفع يرتقب، فلك في المؤمنين عنهم أحسن البدل وأفضل العوض، { واخفض جناحك للمؤمنين } أي: ألن لهم جانبك، وحسِّن لهم خلقك، محبة وإكراما وتودُّدا\n                                    "
    }
  },
  {
    "id": 88,
    "versesNumber": 89,
    "souraName": "Al-Hijr.html",
    "contnent": "وَقُلۡ إِنِّيٓ أَنَا ٱلنَّذِيرُ ٱلۡمُبِينُ ٩٨",
    "tafsier": {
      "ibnkther": "وَقُلۡ إِنِّيٓ أَنَا ٱلنَّذِيرُ ٱلۡمُبِينُ ٩٨\n                                    \n                                    \n                                    يأمر تعالى نبيه - صلوات الله وسلامه عليه - أن يقول للناس : إنه ( النذير المبين ) البين النذارة ، نذير للناس من عذاب أليم أن يحل بهم على تكذيبه كما حل بمن تقدمهم من الأمم المكذبة لرسلها، وما أنزل الله عليهم من العذاب والانتقام .\n                                    ",
      "qortoby": "وَقُلۡ إِنِّيٓ أَنَا ٱلنَّذِيرُ ٱلۡمُبِينُ ٩٨\n                                    \n                                    \n                                    في الكلام حذف ; أي إني أنا النذير المبين عذابا , فحذف المفعول , إذ كان الإنذار يدل عليه , كما قال في موضع آخر : \" أنذرتكم صاعقة مثل صاعقة عاد وثمود \" [ فصلت : 13 ] .\n                                    ",
      "saadi": "وَقُلۡ إِنِّيٓ أَنَا ٱلنَّذِيرُ ٱلۡمُبِينُ ٩٨\n                                        \n                                        \n                                        \n                                        { وقل إني أنا النذير المبين } أي: قم بما عليك من النذارة وأداء الرسالة والتبليغ للقريب والبعيد والعدو والصديق، فإنك إذا فعلت ذلك فليس عليك من حسابهم من شيء، وما من حسابك عليهم من شيء.\n                                    "
    }
  },
  {
    "id": 89,
    "versesNumber": 90,
    "souraName": "Al-Hijr.html",
    "contnent": "كَمَآ أَنزَلۡنَا عَلَى ٱلۡمُقۡتَسِمِينَ ٠٩",
    "tafsier": {
      "ibnkther": "كَمَآ أَنزَلۡنَا عَلَى ٱلۡمُقۡتَسِمِينَ ٠٩\n                                    \n                                    \n                                    وقوله : ( المقتسمين ) أي : المتحالفين ، أي : تحالفوا على مخالفة الأنبياء وتكذيبهم وأذاهم ، كما قال تعالى إخبارا عن قوم صالح أنهم : ( قالوا تقاسموا بالله لنبيتنه وأهله ) [ النمل : 46 ] أي : نقتلهم ليلا قال مجاهد : تقاسموا : تحالفوا .\n( وأقسموا بالله جهد أيمانهم لا يبعث الله من يموت ) [ النحل : 38 ] ( أولم تكونوا أقسمتم من قبل ما لكم من زوال ) [ إبراهيم : 44 ] ( أهؤلاء الذين أقسمتم لا ينالهم الله برحمة ) [ الأعراف : 49 ] فكأنهم كانوا لا يكذبون بشيء إلا أقسموا عليه ، فسموا مقتسمين .\nقال عبد الرحمن بن زيد بن أسلم : المقتسمون أصحاب صالح ، الذين تقاسموا بالله لنبيتنه وأهله .\nوفي الصحيحين ، عن أبي موسى [ الأشعري ] عن النبي - صلى الله عليه وسلم - قال : \" إنما مثلي ومثل ما بعثني الله به ، كمثل رجل أتى قومه فقال : يا قوم ، إني رأيت الجيش بعيني ، وإني أنا النذير العريان ، فالنجاء النجاء ! فأطاعه طائفة من قومه فأدلجوا ، وانطلقوا على مهلهم فنجوا ، وكذبه طائفة منهم فأصبحوا مكانهم ، فصبحهم الجيش فأهلكهم واجتاحهم ، فذلك مثل من أطاعني واتبع ما جئت به ، ومثل من عصاني وكذب ما جئت به من الحق \"\n                                    ",
      "qortoby": "كَمَآ أَنزَلۡنَا عَلَى ٱلۡمُقۡتَسِمِينَ ٠٩\n                                    \n                                    \n                                    وقيل : الكاف زائدة ، أي أنذرتكم ما أنزلنا على المقتسمين ; كقوله : ليس كمثله شيء وقيل : أنذرتكم مثل ما أنزلنا بالمقتسمين . وقيل : المعنى كما أنزلنا على المقتسمين ، أي من العذاب وكفيناك المستهزئين ، فاصدع بما تؤمر وأعرض عن المشركين الذين بغوا ، فإنا كفيناك أولئك الرؤساء الذين كنت تلقى منهم ما تلقى .\nواختلف في المقتسمين على أقوال سبعة :\nالأول : قال مقاتل والفراء : هم ستة عشر رجلا بعثهم الوليد بن المغيرة أيام الموسم فاقتسموا أعقاب مكة وأنقابها وفجاجها يقولون لمن سلكها : لا تغتروا بهذا الخارج فينا يدعي النبوة ; فإنه مجنون ، وربما قالوا ساحر ، وربما قالوا شاعر ، وربما قالوا كاهن . وسموا المقتسمين لأنهم اقتسموا هذه الطرق ، فأماتهم الله شر ميتة ، وكانوا نصبوا الوليد بن المغيرة حكما على باب المسجد ، فإذا سألوه عن النبي - صلى الله عليه وسلم - قال : صدق أولئك .\nالثاني : قال قتادة : هم قوم من كفار قريش اقتسموا كتاب الله فجعلوا بعضه شعرا ، وبعضه سحرا ، وبعضه كهانة ، وبعضه أساطير الأولين .\nالثالث : قال ابن عباس : ( هم أهل الكتاب آمنوا ببعضه وكفروا ببعضه ) . وكذلك قال عكرمة : هم أهل الكتاب ،\nوسموا مقتسمين لأنهم كانوا مستهزئين ، فيقول بعضهم : هذه السورة لي وهذه السورة لك . وهو القول الرابع .\nالخامس : قال قتادة : قسموا كتابهم ففرقوه وبددوه وحرفوه .\nالسادس : قال زيد بن أسلم : المراد قوم صالح ، تقاسموا على قتله فسموا مقتسمين ; كما قال - تعالى - : تقاسموا بالله لنبيتنه وأهله .\nالسابع : قال الأخفش : هم قوم اقتسموا أيمانا تحالفوا عليها . وقيل : إنهم العاص بن وائل وعتبة وشيبة ابنا ربيعة وأبو جهل بن هشام وأبو البختري بن هشام والنضر بن الحارث وأمية بن خلف ومنبه بن الحجاج ; ذكره الماوردي .\n                                    ",
      "saadi": "كَمَآ أَنزَلۡنَا عَلَى ٱلۡمُقۡتَسِمِينَ ٠٩\n                                        \n                                        \n                                        \n                                        وقوله: { كما أنزلنا على المقتسمين } أي: كما أنزلنا العقوبة على المقتسمين على بطلان ما جئت به، الساعين لصد الناس عن سبيل الله.\n                                    "
    }
  },
  {
    "id": 90,
    "versesNumber": 91,
    "souraName": "Al-Hijr.html",
    "contnent": "ٱلَّذِينَ جَعَلُواْ ٱلۡقُرۡءَانَ عِضِينَ ١٩",
    "tafsier": {
      "ibnkther": "ٱلَّذِينَ جَعَلُواْ ٱلۡقُرۡءَانَ عِضِينَ ١٩\n                                    \n                                    \n                                    وقوله : ( الذين جعلوا القرآن عضين ) أي : جزءوا كتبهم المنزلة عليهم ، فآمنوا ببعض وكفروا ببعض .\nقال البخاري : حدثنا يعقوب بن إبراهيم ، حدثنا هشيم ، أنبأنا أبو بشر ، عن سعيد بن جبير ، عن ابن عباس : ( جعلوا القرآن عضين ) قال : هم أهل الكتاب ، جزءوه أجزاء ، فآمنوا ببعضه ، وكفروا ببعضه\nحدثنا عبيد الله بن موسى ، عن الأعمش ، عن أبي ظبيان ، عن ابن عباس : ( كما أنزلنا على المقتسمين ) قال : آمنوا ببعض ، وكفروا ببعض : اليهود والنصارى\nقال ابن أبي حاتم : وروي عن مجاهد ، وعكرمة ، وسعيد بن جبير ، والحسن ، والضحاك مثل ذلك .\nوقال الحكم بن أبان ، عن عكرمة ، عن ابن عباس : ( جعلوا القرآن عضين ) قال : السحر . وقال عكرمة : العضه : السحر بلسان قريش ، تقول للساحرة : إنها العاضهة\nوقال مجاهد : عضوه أعضاء ، قالوا : سحر ، وقالوا : كهانة ، وقالوا : أساطير الأولين .\nوقال عطاء : قال بعضهم : ساحر ، وقال بعضهم : مجنون . وقال بعضهم كاهن . فذلك العضين ، وكذا روي عن الضحاك وغيره .\nوقال محمد بن إسحاق ، عن محمد بن أبي محمد ، عن سعيد أو عكرمة ، عن ابن عباس : أن الوليد بن المغيرة اجتمع إليه نفر من قريش ، وكان ذا شرف فيهم ، وقد حضر الموسم فقال لهم : يا معشر قريش ، إنه قد حضر هذا الموسم ، وإن وفود العرب ستقدم عليكم فيه ، وقد سمعوا بأمر صاحبكم هذا ، فأجمعوا فيه رأيا واحدا ولا تختلفوا فيكذب بعضكم بعضا ، ويرد قولكم بعضه بعضا . فقالوا : وأنت يا أبا عبد شمس ، فقل وأقم لنا رأيا نقول به . قال : بل أنتم قولوا لأسمع . قالوا : نقول كاهن \" . قال : ما هو بكاهن . قالوا : فنقول : \" مجنون \" . قال : ما هو بمجنون ! قالوا فنقول : \" شاعر \" . قال : ما هو بشاعر . قالوا : فنقول : \" ساحر \" . قال : ما هو بساحر . قالوا : فماذا نقول ؟ قال : والله إن لقوله حلاوة ، فما أنتم بقائلين من هذا شيئا إلا عرف أنه باطل ، وإن أقرب القول أن تقولوا : هو ساحر . فتفرقوا عنه بذلك ، وأنزل الله فيهم : ( الذين جعلوا القرآن عضين ) أصنافا\n                                    ",
      "qortoby": "ٱلَّذِينَ جَعَلُواْ ٱلۡقُرۡءَانَ عِضِينَ ١٩\n                                    \n                                    \n                                    قوله تعالى : الذين جعلوا القرآن عضين هذه صفة المقتسمين . وقيل : هو مبتدأ وخبره لنسألنهم . وواحد العضين عضة ، من عضيت الشيء تعضية أي فرقته ; وكل فرقة عضة . وقال بعضهم : كانت في الأصل عضوة فنقصت الواو ، ولذلك جمعت عضين ; كما قالوا : عزين في جمع عزة ، والأصل عزوة . وكذلك ثبة وثبين . ويرجع المعنى إلى ما ذكرناه في المقتسمين . قال ابن عباس : ( آمنوا ببعض وكفروا ببعض ) . وقيل : فرقوا أقاويلهم فيه فجعلوه كذبا وسحرا وكهانة وشعرا . عضوته أي فرقته . قال الشاعر - هو رؤبة - :\nوليس دين الله بالمعضى\nأي بالمفرق . ويقال : نقصانه الهاء وأصله عضهة ; لأن العضه والعضين في لغة قريش السحر . وهم يقولون للساحر : عاضه وللساحرة عاضهة . قال الشاعر :\nأعوذ بربي من النافثا ت في عقد العاضه المعضه\nوفي الحديث : لعن رسول الله - صلى الله عليه وسلم - العاضهة والمستعضهة ، وفسر : الساحرة والمستسحرة .\nوالمعنى : أكثروا البهت على القرآن ونوعوا الكذب فيه ، فقالوا : سحر وأساطير الأولين ، وأنه مفترى ، إلى غير ذلك . ونظير عضة في النقصان شفة ، والأصل شفهة . كما قالوا : سنة ، والأصل سنهة ، فنقصوا الهاء الأصلية وأثبتت هاء العلامة وهي للتأنيث . وقيل : هو من العضه وهي النميمة . والعضيهة البهتان ، وهو أن يعضه الإنسان ويقول ، فيه ما ليس فيه . يقال عضهه عضها رماه بالبهتان . وقد أعضهت أي جئت بالبهتان . قال الكسائي : العضة الكذب والبهتان ، وجمعها عضون ; مثل عزة وعزون ; قال - تعالى - : الذين جعلوا القرآن عضين . ويقال : عضوه أي آمنوا بما أحبوا منه وكفروا بالباقي ، فأحبط كفرهم إيمانهم . وكان الفراء يذهب إلى أنه مأخوذ من العضاة ، وهي شجر الوادي ويخرج كالشوك .\n                                    ",
      "saadi": "ٱلَّذِينَ جَعَلُواْ ٱلۡقُرۡءَانَ عِضِينَ ١٩\n                                        \n                                        \n                                        \n                                        { الذين جعلوا القرآن عضين } أي: أصنافا وأعضاء وأجزاء، يصرفونه بحسب ما يهوونه، فمنهم من يقول: سحر ومنهم من يقول: كهانة ومنهم من يقول: مفترى إلى غير ذلك من أقوال الكفرة المكذبين به، الذين جعلوا قدحهم فيه ليصدوا الناس عن الهدى.\n                                    "
    }
  },
  {
    "id": 91,
    "versesNumber": 92,
    "souraName": "Al-Hijr.html",
    "contnent": "فَوَرَبِّكَ لَنَسۡ‍َٔلَنَّهُمۡ أَجۡمَعِينَ ٢٩",
    "tafsier": {
      "ibnkther": "فَوَرَبِّكَ لَنَسۡ‍َٔلَنَّهُمۡ أَجۡمَعِينَ ٢٩\n                                    \n                                    \n                                    \" فوربك لنسألنهم أجمعين عما كانوا يعملون \" أولئك النفر الذين قالوا لرسول الله.\nوقال عبد الله هو ابن مسعود والذي لا إله غيره ما منكم من أحد إلا سيخلو الله به يوم القيامة كما يخلو أحدكم بالقمر ليلة البدر فيقول: ابن آدم ماذا غرك منى بي؟ ابن آدم ماذا عملت فيما علمت؟ ابن آدم ماذا أجبت المرسلين؟.\n                                    ",
      "qortoby": "فَوَرَبِّكَ لَنَسۡ‍َٔلَنَّهُمۡ أَجۡمَعِينَ ٢٩\n                                    \n                                    \n                                    قوله تعالى : فوربك لنسألنهم أجمعين\nقوله تعالى : فوربك لنسألنهم أجمعين أي لنسألن هؤلاء الذين جرى ذكرهم عما عملوا في الدنيا . وفي البخاري : وقال عدة من أهل العلم في قوله : \" فوربك لنسألنهم أجمعين عما كانوا يعملون \" عن لا إله إلا الله .\nقلت : وهذا قد روي مرفوعا ، روى الترمذي الحكيم قال : حدثنا الجارود بن معاذ قال حدثنا الفضل بن موسى عن شريك عن ليث عن بشير بن نهيك عن أنس بن مالك عن رسول الله - صلى الله عليه وسلم - في قوله : فوربك لنسألنهم أجمعين عما كانوا يعملون قال : عن قول لا إله إلا الله قال أبو عبد الله : معناه عندنا عن صدق لا إله إلا الله ووفائها ; وذلك أن الله - تعالى - ذكر في تنزيله العمل فقال : عما كانوا يعملون ولم يقل عما كانوا يقولون ، وإن كان قد يجوز أن يكون القول أيضا عمل اللسان ، فإنما المعني به ما يعرفه أهل اللغة أن القول قول والعمل عمل . وإنما قال رسول الله - صلى الله عليه وسلم - : عن لا إله إلا الله أي عن الوفاء بها والصدق لمقالها . كما قال الحسن البصري : ليس الإيمان بالتحلي ولا الدين بالتمني ولكن ما وقر في القلوب وصدقته الأعمال . ولهذا ما قال رسول الله - صلى الله عليه وسلم - : من قال لا إله إلا الله مخلصا دخل الجنة قيل : يا رسول الله ، وما إخلاصها ؟ قال : أن تحجزه عن محارم الله . رواه زيد بن أرقم . وعنه أيضا قال : قال رسول الله - صلى الله عليه وسلم - : إن الله عهد إلي ألا يأتيني أحد من أمتي بلا إله إلا الله لا يخلط بها شيئا إلا وجبت له الجنة قالوا : يا رسول الله ، وما الذي يخلط بلا إله إلا الله ؟ قال : حرصا على الدنيا وجمعا لها ومنعا لها ، يقولون قول الأنبياء ويعملون أعمال الجبابرة . وروى أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - : لا إله إلا الله تمنع العباد من سخط الله ما لم يؤثروا صفقة دنياهم على دينهم فإذا آثروا صفقة دنياهم على دينهم ثم قالوا لا إله إلا الله ردت عليهم وقال الله كذبتم . أسانيدها في نوادر الأصول .\nقلت : والآية بعمومها تدل على سؤال الجميع ومحاسبتهم كافرهم ومؤمنهم ، إلا من دخل الجنة بغير حساب على ما بيناه في كتاب ( التذكرة ) . فإن قيل : وهل يسأل الكافر ويحاسب ؟ قلنا : فيه خلاف وذكرناه في التذكرة . والذي يظهر سؤاله للآية وقوله : وقفوهم إنهم مسئولون وقوله : إن إلينا إيابهم ثم إن علينا حسابهم . فإن قيل : فقد قال - تعالى - : ولا يسأل عن ذنوبهم المجرمون وقال : فيومئذ لا يسأل عن ذنبه إنس ولا جان ، وقال : ولا يكلمهم الله ، وقال : إنهم عن ربهم يومئذ لمحجوبون . قلنا : القيامة مواطن ، فموطن يكون فيه سؤال وكلام ، وموطن لا يكون ذلك فيه . قال عكرمة : القيامة مواطن ، يسأل في بعضها ولا يسأل في بعضها . وقال ابن عباس : ( لا يسألهم سؤال استخبار واستعلام هل عملتم كذا وكذا ; لأن الله عالم بكل شيء ، ولكن يسألهم سؤال تقريع وتوبيخ فيقول لهم : لم عصيتم القرآن وما حجتكم فيه ؟ واعتمد قطرب هذا القول . وقيل : لنسألنهم أجمعين يعني المؤمنين المكلفين ; بيانه قوله - تعالى - : ثم لتسئلن يومئذ عن النعيم . والقول بالعموم أولى كما ذكر . والله أعلم .\n                                    ",
      "saadi": "فَوَرَبِّكَ لَنَسۡ‍َٔلَنَّهُمۡ أَجۡمَعِينَ ٢٩\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 92 و93 :ـ\n{ فوربك لنسألنهم أجمعين } أي: جميع من قدح فيه وعابه وحرفه وبدله { عما كانوا يعملون } وفي هذا أعظم ترهيب وزجر لهم عن الإقامة على ما كانوا عليه\n                                    "
    }
  },
  {
    "id": 92,
    "versesNumber": 93,
    "souraName": "Al-Hijr.html",
    "contnent": "عَمَّا كَانُواْ يَعۡمَلُونَ ٣٩",
    "tafsier": {
      "ibnkther": "عَمَّا كَانُواْ يَعۡمَلُونَ ٣٩\n                                    \n                                    \n                                    وقال عطية العوفي ، عن ابن عمر في قوله : ( لنسألنهم أجمعين عما كانوا يعملون ) قال : عن لا إله إلا الله .\nوقال عبد الرزاق ، أنبأنا الثوري ، عن ليث - هو ابن أبي سليم - عن مجاهد في قوله : ( لنسألنهم أجمعين عما كانوا يعملون ) قال : عن لا إله إلا الله\nوقد روى الترمذي ، وأبو يعلى الموصلي ، وابن جرير ، وابن أبي حاتم من حديث شريك القاضي ، عن ليث بن أبي سليم ، عن بشير بن نهيك ، عن أنس ، عن النبي - صلى الله عليه وسلم - : ( فوربك لنسألنهم أجمعين ) [ قال ] عن لا إله إلا الله\nورواه ابن إدريس ، عن ليث ، عن بشير عن أنس موقوفا\nوقال ابن جرير : حدثنا أحمد ، حدثنا أبو أحمد ، حدثنا شريك ، عن هلال ، عن عبد الله بن عكيم قال : قال عبد الله - هو ابن مسعود - : والذي لا إله غيره ، ما منكم من أحد إلا سيخلو الله به يوم القيامة ، كما يخلو أحدكم بالقمر ليلة البدر ، فيقول : ابن آدم ماذا غرك مني بي ؟ ابن آدم ماذا عملت فيما علمت ؟ ابن آدم ، ماذا أجبت المرسلين ؟\nوقال أبو جعفر : عن الربيع ، عن أبي العالية : قال : يسأل العباد كلهم عن خلتين يوم القيامة ، عما كانوا يعبدون ، وماذا أجابوا المرسلين .\nوقال ابن عيينة عن عملك ، وعن مالك .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا أحمد بن أبي الحواري ، حدثنا يونس الحذاء ، عن أبي حمزة الشيباني ، عن معاذ بن جبل قال : قال لي رسول الله - صلى الله عليه وسلم - : \" يا معاذ إن المؤمن ليسأل يوم القيامة عن جميع سعيه ، حتى كحل عينيه ، وعن فتات الطينة بأصبعيه ، فلا ألفينك يوم القيامة وأحد أسعد بما آتى الله منك \"\nوقال علي بن أبي طلحة ، عن ابن عباس : ( فوربك لنسألنهم أجمعين عما كانوا يعملون ) ثم قال ( فيومئذ لا يسأل عن ذنبه إنس ولا جان ) [ الرحمن : 39 ] قال : لا يسألهم : هل عملتم كذا ؛ لأنه أعلم بذلك منهم ، ولكن يقول : لم عملتم كذا وكذا ؟\n                                    ",
      "qortoby": "عَمَّا كَانُواْ يَعۡمَلُونَ ٣٩\n                                    \n                                    \n                                    قوله تعالى : فوربك لنسألنهم أجمعين\nقوله تعالى : فوربك لنسألنهم أجمعين أي لنسألن هؤلاء الذين جرى ذكرهم عما عملوا في الدنيا . وفي البخاري : وقال عدة من أهل العلم في قوله : \" فوربك لنسألنهم أجمعين عما كانوا يعملون \" عن لا إله إلا الله .\nقلت : وهذا قد روي مرفوعا ، روى الترمذي الحكيم قال : حدثنا الجارود بن معاذ قال حدثنا الفضل بن موسى عن شريك عن ليث عن بشير بن نهيك عن أنس بن مالك عن رسول الله - صلى الله عليه وسلم - في قوله : فوربك لنسألنهم أجمعين عما كانوا يعملون قال : عن قول لا إله إلا الله قال أبو عبد الله : معناه عندنا عن صدق لا إله إلا الله ووفائها ; وذلك أن الله - تعالى - ذكر في تنزيله العمل فقال : عما كانوا يعملون ولم يقل عما كانوا يقولون ، وإن كان قد يجوز أن يكون القول أيضا عمل اللسان ، فإنما المعني به ما يعرفه أهل اللغة أن القول قول والعمل عمل . وإنما قال رسول الله - صلى الله عليه وسلم - : عن لا إله إلا الله أي عن الوفاء بها والصدق لمقالها . كما قال الحسن البصري : ليس الإيمان بالتحلي ولا الدين بالتمني ولكن ما وقر في القلوب وصدقته الأعمال . ولهذا ما قال رسول الله - صلى الله عليه وسلم - : من قال لا إله إلا الله مخلصا دخل الجنة قيل : يا رسول الله ، وما إخلاصها ؟ قال : أن تحجزه عن محارم الله . رواه زيد بن أرقم . وعنه أيضا قال : قال رسول الله - صلى الله عليه وسلم - : إن الله عهد إلي ألا يأتيني أحد من أمتي بلا إله إلا الله لا يخلط بها شيئا إلا وجبت له الجنة قالوا : يا رسول الله ، وما الذي يخلط بلا إله إلا الله ؟ قال : حرصا على الدنيا وجمعا لها ومنعا لها ، يقولون قول الأنبياء ويعملون أعمال الجبابرة . وروى أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - : لا إله إلا الله تمنع العباد من سخط الله ما لم يؤثروا صفقة دنياهم على دينهم فإذا آثروا صفقة دنياهم على دينهم ثم قالوا لا إله إلا الله ردت عليهم وقال الله كذبتم . أسانيدها في نوادر الأصول .\nقلت : والآية بعمومها تدل على سؤال الجميع ومحاسبتهم كافرهم ومؤمنهم ، إلا من دخل الجنة بغير حساب على ما بيناه في كتاب ( التذكرة ) . فإن قيل : وهل يسأل الكافر ويحاسب ؟ قلنا : فيه خلاف وذكرناه في التذكرة . والذي يظهر سؤاله للآية وقوله : وقفوهم إنهم مسئولون وقوله : إن إلينا إيابهم ثم إن علينا حسابهم . فإن قيل : فقد قال - تعالى - : ولا يسأل عن ذنوبهم المجرمون وقال : فيومئذ لا يسأل عن ذنبه إنس ولا جان ، وقال : ولا يكلمهم الله ، وقال : إنهم عن ربهم يومئذ لمحجوبون . قلنا : القيامة مواطن ، فموطن يكون فيه سؤال وكلام ، وموطن لا يكون ذلك فيه . قال عكرمة : القيامة مواطن ، يسأل في بعضها ولا يسأل في بعضها . وقال ابن عباس : ( لا يسألهم سؤال استخبار واستعلام هل عملتم كذا وكذا ; لأن الله عالم بكل شيء ، ولكن يسألهم سؤال تقريع وتوبيخ فيقول لهم : لم عصيتم القرآن وما حجتكم فيه ؟ واعتمد قطرب هذا القول . وقيل : لنسألنهم أجمعين يعني المؤمنين المكلفين ; بيانه قوله - تعالى - : ثم لتسئلن يومئذ عن النعيم . والقول بالعموم أولى كما ذكر . والله أعلم .\n                                    ",
      "saadi": "عَمَّا كَانُواْ يَعۡمَلُونَ ٣٩\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 92 و93 :ـ\n{ فوربك لنسألنهم أجمعين } أي: جميع من قدح فيه وعابه وحرفه وبدله { عما كانوا يعملون } وفي هذا أعظم ترهيب وزجر لهم عن الإقامة على ما كانوا عليه\n                                    "
    }
  },
  {
    "id": 93,
    "versesNumber": 94,
    "souraName": "Al-Hijr.html",
    "contnent": "فَٱصۡدَعۡ بِمَا تُؤۡمَرُ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِينَ ٤٩",
    "tafsier": {
      "ibnkther": "فَٱصۡدَعۡ بِمَا تُؤۡمَرُ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِينَ ٤٩\n                                    \n                                    \n                                    يقول تعالى آمرا رسوله - صلوات الله وسلامه عليه - بإبلاغ ما بعثه به وبإنفاذه والصدع به ، وهو مواجهة المشركين به ، كما قال ابن عباس : ( فاصدع بما تؤمر ) أي : أمضه . وفي رواية : افعل ما تؤمر .\nوقال مجاهد : هو الجهر بالقرآن في الصلاة .\nوقال أبو عبيدة ، عن عبد الله بن مسعود : ما زال النبي - صلى الله عليه وسلم - مستخفيا ، حتى نزلت : ( فاصدع بما تؤمر ) فخرج هو وأصحابه\nوقوله : ( وأعرض عن المشركين)\n                                    ",
      "qortoby": "فَٱصۡدَعۡ بِمَا تُؤۡمَرُ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِينَ ٤٩\n                                    \n                                    \n                                    قوله تعالى : فاصدع بما تؤمر وأعرض عن المشركين\nقوله تعالى : فاصدع بما تؤمر أي بالذي تؤمر به ، أي بلغ رسالة الله جميع الخلق لتقوم الحجة عليهم ، فقد أمرك الله بذلك . والصدع : الشق . وتصدع القوم أي تفرقوا ; ومنه يومئذ يصدعون أي يتفرقون . وصدعته فانصدع أي انشق . أصل الصدع الفرق والشق . قال أبو ذؤيب يصف الحمار وأتنه :\nوكأنهن ربابة وكأنه يسر يفيض على القداح ويصدع\nأي يفرق ويشق . فقوله : اصدع بما تؤمر قال الفراء : أراد فاصدع بالأمر ، أي أظهر دينك ، ف \" ما \" مع الفعل على هذا بمنزلة المصدر . وقال ابن الأعرابي : معنى اصدع بما تؤمر ، أي اقصد . وقيل : فاصدع بما تؤمر أي فرق جمعهم وكلمتهم بأن تدعوهم إلى التوحيد فإنهم يتفرقون بأن يجيب البعض ; فيرجع الصدع على هذا إلى صدع جماعة الكفار .\nقوله تعالى : وأعرض عن المشركين أي عن الاهتمام باستهزائهم وعن المبالاة بقولهم ، فقد برأك الله عما يقولون . وقال ابن عباس : ( هو منسوخ بقوله فاقتلوا المشركين ) . وقال عبد الله بن عبيد : ما زال النبي - صلى الله عليه وسلم - مستخفيا حتى نزل قوله - تعالى - : فاصدع بما تؤمر فخرج هو وأصحابه . وقال مجاهد : أراد الجهر بالقرآن في الصلاة . وأعرض عن المشركين لا تبال بهم .\n                                    ",
      "saadi": "فَٱصۡدَعۡ بِمَا تُؤۡمَرُ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِينَ ٤٩\n                                        \n                                        \n                                        \n                                        ثم أمر الله رسوله ان لا يبالي بهم ولا بغيرهم وأن يصدع بما أمر الله ويعلن بذلك لكل أحد ولا يعوقنه عن أمره عائق ولا تصده أقوال المتهوكين، { وأعرض عن المشركين } أي: لا تبال بهم واترك مشاتمتهم ومسابتهم مقبلا على شأنك\n                                    "
    }
  },
  {
    "id": 94,
    "versesNumber": 95,
    "souraName": "Al-Hijr.html",
    "contnent": "إِنَّا كَفَيۡنَٰكَ ٱلۡمُسۡتَهۡزِءِينَ ٥٩ ",
    "tafsier": {
      "ibnkther": "إِنَّا كَفَيۡنَٰكَ ٱلۡمُسۡتَهۡزِءِينَ ٥٩\n                                    \n                                    \n                                    وقوله : ( وأعرض عن المشركين إنا كفيناك المستهزئين ) أي : بلغ ما أنزل إليك من ربك ، ولا تلتفت إلى المشركين الذين يريدون أن يصدوك عن آيات الله . ( ودوا لو تدهن فيدهنون ) [ القلم : 9 ] ولا تخفهم ; فإن الله كافيك إياهم ، وحافظك منهم ، كما قال تعالى : ( يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس ) [ المائدة : 67 ]\nوقال الحافظ أبو بكر البزار : حدثنا يحيى بن محمد بن السكن ، حدثنا إسحاق بن إدريس ، حدثنا عون بن كهمس ، عن يزيد بن درهم قال : سمعت أنسا يقول في هذه الآية : ( إنا كفيناك المستهزئين الذين يجعلون مع الله إلها آخر ) قال : مر رسول الله - صلى الله عليه وسلم - فغمزه بعضهم ، فجاء جبريل أحسبه قال : فغمزهم فوقع في أجسادهم كهيئة الطعنة حتى ماتوا\nوقال محمد بن إسحاق : كان عظماء المستهزئين - كما حدثني يزيد بن رومان ، عن عروة بن الزبير - خمسة نفر ، كانوا ذوي أسنان وشرف في قومهم ، من بني أسد بن عبد العزى بن قصي : الأسود بن المطلب أبو زمعة كان رسول الله - صلى الله عليه وسلم - فيما بلغني - قد دعا عليه ؛ لما كان يبلغه من أذاه واستهزائه [ به ] فقال : اللهم ، أعم بصره ، وأثكله ولده . ومن بني زهرة : الأسود بن عبد يغوث بن وهب بن عبد مناف بن زهرة . ومن بني مخزوم : الوليد بن المغيرة بن عبد الله بن عمر بن مخزوم . ومن بني سهم بن عمرو بن هصيص بن كعب بن لؤي : العاص بن وائل بن هشام بن سعيد بن سعد . ومن خزاعة : الحارث بن الطلاطلة بن عمرو بن الحارث بن عبد عمرو بن ملكان - فلما تمادوا في الشر وأكثروا برسول الله - صلى الله عليه وسلم - الاستهزاء ، أنزل الله تعالى : ( فاصدع بما تؤمر وأعرض عن المشركين إنا كفيناك المستهزئين ) إلى قوله : ( فسوف يعلمون )\nوقال ابن إسحاق : فحدثني يزيد بن رومان ، عن عروة بن الزبير ، أو غيره من العلماء ، أن جبريل أتى رسول الله - صلى الله عليه وسلم - وهو يطوف بالبيت ، فقام وقام رسول الله - صلى الله عليه وسلم - إلى جنبه ، فمر به الأسود [ ابن المطلب فرمى في وجهه بورقة خضراء ، فعمي . ومر به الأسود ] بن عبد يغوث ، فأشار إلى بطنه ، فاستسقى بطنه ، فمات منه حبنا . ومر به الوليد بن المغيرة ، فأشار إلى أثر جرح بأسفل كعب رجله - كان أصابه قبل ذلك بسنتين وهو يجر إزاره - وذلك أنه مر برجل من خزاعة يريش نبلا له ، فتعلق سهم من نبله بإزاره ، فخدش رجله ذلك الخدش ، وليس بشيء - فانتقض به فقتله . ومر به العاص بن وائل ، فأشار إلى أخمص قدمه ، فخرج على حمار له يريد الطائف ، فربض على شبرقة فدخلت في أخمص رجله منها شوكة فقتلته . ومر به الحارث بن الطلاطلة ، فأشار إلى رأسه ، فامتخط قيحا ، فقتله\nقال محمد بن إسحاق : حدثني محمد بن أبي محمد ، عن رجل ، عن ابن عباس قال : كان رأسهم الوليد بن المغيرة ، وهو الذي جمعهم .\nوهكذا روي عن سعيد بن جبير وعكرمة نحو سياق محمد بن إسحاق ، عن يزيد ، عن عروة بطوله ، إلا أن سعيدا يقول : الحارث بن غيطلة . وعكرمة يقول : الحارث بن قيس .\nقال الزهري : وصدقا ، هو الحارث بن قيس ، وأمه غيطلة .\nوكذا روي عن مجاهد ، ومقسم ، وقتادة ، وغير واحد ، أنهم كانوا خمسة .\nوقال الشعبي : كانوا سبعة .\nوالمشهور الأول .\n                                    ",
      "qortoby": "إِنَّا كَفَيۡنَٰكَ ٱلۡمُسۡتَهۡزِءِينَ ٥٩\n                                    \n                                    \n                                    إنا كفيناك المستهزئين قال ابن إسحاق : لما تمادوا في الشر وأكثروا برسول الله - صلى الله عليه وسلم - الاستهزاء أنزل الله - تعالى - فاصدع بما تؤمر وأعرض عن المشركين إنا كفيناك المستهزئين الذين يجعلون مع الله إلها آخر فسوف يعلمون . والمعنى : اصدع بما تؤمر ولا تخف غير الله ; فإن الله كافيك من أذاك كما كفاك المستهزئين ، وكانوا خمسة من رؤساء أهل مكة ، وهم الوليد بن المغيرة وهو رأسهم ، والعاص بن وائل ، والأسود بن المطلب بن أسد أبو زمعة . والأسود بن عبد يغوث ، والحارث بن الطلاطلة ، أهلكهم الله جميعا ، قبل يوم بدر في يوم واحد ; لاستهزائهم برسول الله - صلى الله عليه وسلم - . وسبب هلاكهم فيما ذكر ابن إسحاق : أن جبريل أتى رسول الله - صلى الله عليه وسلم - وهم يطوفون بالبيت ، فقام وقام رسول الله - صلى الله عليه وسلم - فمر به الأسود بن المطلب فرمى في وجهه بورقة خضراء فعمي ووجعت عينه ، فجعل يضرب برأسه الجدار . ومر به الأسود بن عبد يغوث فأشار إلى بطنه فاستسقى بطنه فمات منه حبنا . ( يقال : حبن ( بالكسر ) ) حبنا وحبن للمفعول عظم بطنه بالماء الأصفر ، فهو أحبن ، والمرأة حبناء ; قاله في الصحاح ) . ومر به الوليد بن المغيرة فأشار إلى أثر جرح بأسفل كعب رجله ، وكان أصابه قبل ذلك بسنين ، وهو يجر سبله ، وذلك أنه مر برجل من خزاعة يريش نبلا له فتعلق سهم من نبله بإزاره فخدش في رجله ذلك الخدش وليس بشيء ، فانتقض به فقتله . ومر به العاص بن وائل فأشار إلى أخمص رجله ، فمرج على حمار له يريد الطائف ، فربض به على شبرقة فدخلت في أخمص رجله شوكة فقتلته . ومر به الحارث بن الطلاطلة ، فأشار إلى رأسه فامتخط قيحا فقتله . وقد ذكر في سبب موتهم اختلاف قريب من هذا . وقيل : إنهم المراد بقوله - تعالى - : فخر عليهم السقف من فوقهم شبه ما أصابهم في موتهم بالسقف الواقع عليهم ; على ما يأتي .\n                                    ",
      "saadi": "إِنَّا كَفَيۡنَٰكَ ٱلۡمُسۡتَهۡزِءِينَ ٥٩\n                                        \n                                        \n                                        \n                                        { إنا كفيناك المستهزئين } بك وبما جئت به وهذا وعد من الله لرسوله، أن لا يضره المستهزئون، وأن يكفيه الله إياهم بما شاء من أنواع العقوبة. وقد فعل تعالى فإنه ما تظاهر أحد بالاستهزاء برسول الله صلى الله عليه وسلم وبما جاء به إلا أهلكه الله وقتله شر قتلة.\n                                    "
    }
  },
  {
    "id": 95,
    "versesNumber": 96,
    "souraName": "Al-Hijr.html",
    "contnent": "ٱلَّذِينَ يَجۡعَلُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَۚ فَسَوۡفَ يَعۡلَمُونَ ٦٩",
    "tafsier": {
      "ibnkther": "ٱلَّذِينَ يَجۡعَلُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَۚ فَسَوۡفَ يَعۡلَمُونَ ٦٩\n                                    \n                                    \n                                    وقوله : ( الذين يجعلون مع الله إلها آخر فسوف يعلمون ) تهديد شديد ، ووعيد أكيد ، لمن جعل مع الله معبودا آخر .\n                                    ",
      "qortoby": "ٱلَّذِينَ يَجۡعَلُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَۚ فَسَوۡفَ يَعۡلَمُونَ ٦٩\n                                    \n                                    \n                                    قوله تعالى : الذين يجعلون مع الله إلها آخر فسوف يعلمون هذه صفة المستهزئين . وقيل : هو ابتداء وخبره فسوف يعلمون .\nقوله تعالى : الذين يجعلون مع الله إلها آخر فسوف يعلمون\n                                    ",
      "saadi": "ٱلَّذِينَ يَجۡعَلُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَۚ فَسَوۡفَ يَعۡلَمُونَ ٦٩\n                                        \n                                        \n                                        \n                                        ثم ذكر وصفهم وأنهم كما يؤذونك يا رسول الله، فإنهم أيضا يؤذون الله ويجعلون معه { إلها آخر } وهو ربهم وخالقهم ومدبرهم { فسوف يعلمون } غب أفعالهم إذا وردوا القيامة\n                                    "
    }
  },
  {
    "id": 96,
    "versesNumber": 97,
    "souraName": "Al-Hijr.html",
    "contnent": "وَلَقَدۡ نَعۡلَمُ أَنَّكَ يَضِيقُ صَدۡرُكَ بِمَا يَقُولُونَ ٧٩",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ نَعۡلَمُ أَنَّكَ يَضِيقُ صَدۡرُكَ بِمَا يَقُولُونَ ٧٩\n                                    \n                                    \n                                    وقوله : ( ولقد نعلم أنك يضيق صدرك بما يقولون فسبح بحمد ربك وكن من الساجدين ) أي : وإنا لنعلم يا محمد أنك يحصل لك من أذاهم لك انقباض وضيق صدر ، فلا يهيدنك ذلك ، ولا يثنينك عن إبلاغك رسالة الله ، وتوكل على الله فإنه كافيك وناصرك عليهم ، فاشتغل بذكر الله وتحميده وتسبيحه وعبادته التي هي الصلاة ; ولهذا قال : ( وكن من الساجدين ) كما جاء في الحديث الذي رواه الإمام أحمد :\nحدثنا عبد الرحمن بن مهدي ، حدثنا معاوية بن صالح ، عن أبي الزاهرية ، عن كثير بن مرة ، عن نعيم بن همار أنه سمع رسول الله - صلى الله عليه وسلم - يقول : \" قال الله : يا ابن آدم ، لا تعجز عن أربع ركعات من أول النهار أكفك آخره . .\nورواه أبو داود من حديث مكحول ، عن كثير بن مرة ، بنحوه\nولهذا كان رسول الله - صلى الله عليه وسلم - إذا حزبه أمر صلى .\n                                    ",
      "qortoby": "وَلَقَدۡ نَعۡلَمُ أَنَّكَ يَضِيقُ صَدۡرُكَ بِمَا يَقُولُونَ ٧٩\n                                    \n                                    \n                                    وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ أي قلبك ; لأن الصدر محل القلب . بِمَا يَقُولُونَ أي بما تسمعه من تكذيبك ورد قولك , وتناله .\nويناله أصحابك من أعدائك .\n                                    ",
      "saadi": "وَلَقَدۡ نَعۡلَمُ أَنَّكَ يَضِيقُ صَدۡرُكَ بِمَا يَقُولُونَ ٧٩\n                                        \n                                        \n                                        \n                                        { ولقد نعلم أنك يضيق صدرك بما يقولون } لك من التكذيب والاستهزاء، فنحن قادرون على استئصالهم بالعذاب، والتعجيل لهم بما يستحقون، ولكن الله يمهلهم ولا يهملهم.\n                                    "
    }
  },
  {
    "id": 97,
    "versesNumber": 98,
    "souraName": "Al-Hijr.html",
    "contnent": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ ٨٩",
    "tafsier": {
      "ibnkther": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ ٨٩\n                                    \n                                    \n                                    وقوله : ( ولقد نعلم أنك يضيق صدرك بما يقولون فسبح بحمد ربك وكن من الساجدين ) أي : وإنا لنعلم يا محمد أنك يحصل لك من أذاهم لك انقباض وضيق صدر ، فلا يهيدنك ذلك ، ولا يثنينك عن إبلاغك رسالة الله ، وتوكل على الله فإنه كافيك وناصرك عليهم ، فاشتغل بذكر الله وتحميده وتسبيحه وعبادته التي هي الصلاة ; ولهذا قال : ( وكن من الساجدين ) كما جاء في الحديث الذي رواه الإمام أحمد :\nحدثنا عبد الرحمن بن مهدي ، حدثنا معاوية بن صالح ، عن أبي الزاهرية ، عن كثير بن مرة ، عن نعيم بن همار أنه سمع رسول الله - صلى الله عليه وسلم - يقول : \" قال الله : يا ابن آدم ، لا تعجز عن أربع ركعات من أول النهار أكفك آخره . .\nورواه أبو داود من حديث مكحول ، عن كثير بن مرة ، بنحوه\nولهذا كان رسول الله - صلى الله عليه وسلم - إذا حزبه أمر صلى .\n                                    ",
      "qortoby": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ ٨٩\n                                    \n                                    \n                                    قوله تعالى : فسبح بحمد ربك وكن من الساجدين فيه مسألتان : الأولى : فسبح أي فافزع إلى الصلاة ، فهي غاية التسبيح ونهاية التقديس .\nوكن من الساجدين لا خفاء أن غاية القرب في الصلاة حال السجود ، كما قال - عليه السلام - : أقرب ما يكون العبد من ربه وهو ساجد فأخلصوا الدعاء . ولذلك خص السجود بالذكر .\nالثانية : قال ابن العربي : ظن بعض الناس أن المراد بالأمر هنا السجود نفسه ، فرأى هذا الموضع محل سجود في القرآن ، وقد شاهدت الإمام بمحراب زكريا من البيت المقدس طهره الله ، يسجد في هذا الموضع وسجدت معه فيها ، ولم يره جماهير العلماء .\nقلت : قد ذكر أبو بكر النقاش أن هاهنا سجدة عند أبي حذيفة ويمان بن رئاب ، ورأى أنها واجبة\n                                    ",
      "saadi": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ ٨٩\n                                        \n                                        \n                                        \n                                        فأنت يا محمد { فسبح بحمد ربك وكن من الساجدين } أي: أكثر من ذكر الله وتسبيحه وتحميده والصلاة فإن ذلك يوسع الصدر ويشرحه ويعينك على أمورك.\n                                    "
    }
  },
  {
    "id": 98,
    "versesNumber": 99,
    "souraName": "Al-Hijr.html",
    "contnent": "وَٱعۡبُدۡ رَبَّكَ حَتَّىٰ يَأۡتِيَكَ ٱلۡيَقِينُ ٩٩",
    "tafsier": {
      "ibnkther": "وَٱعۡبُدۡ رَبَّكَ حَتَّىٰ يَأۡتِيَكَ ٱلۡيَقِينُ ٩٩\n                                    \n                                    \n                                    وقوله : ( واعبد ربك حتى يأتيك اليقين ) قال البخاري : قال سالم : الموت\nوسالم هذا هو : سالم بن عبد الله بن عمر ، كما قال ابن جرير :\nحدثنا محمد بن بشار ، حدثنا يحيى بن سعيد ، عن سفيان ، حدثني طارق بن عبد الرحمن ، عن سالم بن عبد الله : ( واعبد ربك حتى يأتيك اليقين ) قال : الموت\nوهكذا قال مجاهد ، والحسن ، وقتادة ، وعبد الرحمن بن زيد بن أسلم ، وغيره\nوالدليل على ذلك قوله تعالى إخبارا عن أهل النار أنهم قالوا : ( لم نك من المصلين ولم نك نطعم المسكين وكنا نخوض مع الخائضين وكنا نكذب بيوم الدين حتى أتانا اليقين ) [ المدثر : 43 - 47 ]\nوفي الصحيح من حديث الزهري ، عن خارجة بن زيد بن ثابت ، عن أم العلاء - امرأة من الأنصار - أن رسول الله - صلى الله عليه وسلم - لما دخل على عثمان بن مظعون - وقد مات - قلت : رحمة الله عليك أبا السائب ، فشهادتي عليك لقد أكرمك الله ، فقال رسول الله - صلى الله عليه وسلم - : \" وما يدريك أن الله أكرمه ؟ \" فقلت : بأبي وأمي يا رسول الله ، فمن ؟ فقال : \" أما هو فقد جاءه اليقين ، وإني لأرجو له الخير \"\nويستدل من هذه الآية الكريمة وهي قوله : ( واعبد ربك حتى يأتيك اليقين ) - على أن العبادة كالصلاة ونحوها واجبة على الإنسان ما دام عقله ثابتا فيصلي بحسب حاله ، كما ثبت في صحيح البخاري ، عن عمران بن حصين - رضي الله عنهما - أن رسول الله - صلى الله عليه وسلم - قال : \" صل قائما ، فإن لم تستطع فقاعدا ، فإن لم تستطع فعلى جنب \"\nويستدل بها على تخطئة من ذهب من الملاحدة إلى أن المراد باليقين المعرفة ، فمتى وصل أحدهم إلى المعرفة سقط عنه التكليف عندهم . وهذا كفر وضلال وجهل ، فإن الأنبياء - عليهم السلام - كانوا هم وأصحابهم أعلم الناس بالله وأعرفهم بحقوقه وصفاته ، وما يستحق من التعظيم ، وكانوا مع هذا أعبد الناس وأكثر الناس عبادة ومواظبة على فعل الخيرات إلى حين الوفاة . وإنما المراد باليقين هاهنا الموت ، كما قدمناه . ولله الحمد والمنة ، والحمد لله على الهداية ، وعليه الاستعانة والتوكل ، وهو المسئول أن يتوفانا على أكمل الأحوال وأحسنها [ فإنه جواد كريم ]\n[ وحسبنا الله ونعم الوكيل ]\n                                    ",
      "qortoby": "وَٱعۡبُدۡ رَبَّكَ حَتَّىٰ يَأۡتِيَكَ ٱلۡيَقِينُ ٩٩\n                                    \n                                    \n                                    قوله تعالى : واعبد ربك حتى يأتيك اليقين فيه مسألة واحدة : وهو أن اليقين الموت . أمره بعبادته إذ قصر عباده في خدمته ، وأن ذلك يجب عليه . فإن قيل : فما فائدة قوله : حتى يأتيك اليقين وكان قوله : واعبد ربك كافيا في الأمر بالعبادة . قيل له : الفائدة في هذا أنه لو قال : واعبد ربك مطلقا ثم عبده مرة واحدة كان مطيعا ; وإذا قال حتى يأتيك اليقين كان معناه لا تفارق هذا حتى تموت . فإن قيل : كيف قال سبحانه : واعبد ربك حتى يأتيك اليقين ولم يقل أبدا ; فالجواب أن اليقين أبلغ من قوله : أبدا ; لاحتمال لفظ الأبد للحظة الواحدة ولجميع الأبد . وقد تقدم هذا المعنى . والمراد استمرار العبادة مدة حياته ، كما قال العبد الصالح : وأوصاني بالصلاة والزكاة ما دمت حيا . ويتركب على هذا أن الرجل إذا قال لامرأته : أنت طالق أبدا ، وقال : نويت يوما أو شهرا كانت عليه الرجعة . ولو قال : طلقتها حياتها لم يراجعها . والدليل على أن اليقين الموت حديث أم العلاء الأنصارية ، وكانت من المبايعات ، وفيه : فقال رسول الله - صلى الله عليه وسلم - : أما عثمان - أعني عثمان بن مظعون - فقد جاءه اليقين وإني لأرجو له الخير والله ما أدري وأنا رسول الله ما يفعل به وذكر الحديث . انفرد بإخراجه البخاري - رحمه الله - ! وكان عمر بن عبد العزيز يقول : ما رأيت يقينا أشبه بالشك من يقين الناس بالموت ثم لا يستعدون له ; يعني كأنهم فيه شاكون . وقد قيل : إن اليقين هنا الحق الذي لا ريب فيه من نصرك على أعدائك ; قاله ابن شجرة ; والأول أصح ، وهو قول مجاهد وقتادة والحسن . والله أعلم . وقد روى جبير بن نفير عن أبي مسلم الخولاني أنه سمعه يقول إن النبي - صلى الله عليه وسلم - قال : ما أوحي إلي أن أجمع المال وأكون من التاجرين لكن أوحي إلي أن سبح بحمد ربك وكن من الساجدين واعبد ربك حتى يأتيك اليقين .\n                                    ",
      "saadi": "وَٱعۡبُدۡ رَبَّكَ حَتَّىٰ يَأۡتِيَكَ ٱلۡيَقِينُ ٩٩\n                                        \n                                        \n                                        \n                                        { واعبد ربك حتى يأتيك اليقين } أي: الموت أي: استمر في جميع الأوقات على التقرب إلى الله بأنواع العبادات، فامتثل صلى الله عليه وسلم أمر ربه، فلم يزل دائبا في العبادة، حتى أتاه اليقين من ربه صلى الله عليه وسلم تسليما كثيرا.\nتم تفسير سورة الحجر\n                                    "
    }
  }
]