[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Al-Hujurat.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ ١",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ ١\n                                    \n                                    \n                                    تفسير سورة الحجرات وهي مدنية .\nهذه آداب أدب الله بها عباده المؤمنين فيما يعاملون به الرسول - صلى الله عليه وسلم - من التوقير والاحترام والتبجيل والإعظام ، فقال : ( يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله [ واتقوا الله ] ) ، أي : لا تسرعوا في الأشياء بين يديه ، أي : قبله ، بل كونوا تبعا له في جميع الأمور ، حتى يدخل في عموم هذا الأدب الشرعي حديث معاذ ، [ إذ ] قال له النبي - صلى الله عليه وسلم - حين بعثه إلى اليمن : \" بم تحكم ؟ \" قال : بكتاب الله . قال : \" فإن لم تجد ؟ \" قال : بسنة رسول الله . قال : \" فإن لم تجد ؟ \" قال : أجتهد رأيي ، فضرب في صدره وقال : \" الحمد لله الذي وفق رسول رسول الله ، لما يرضي رسول الله \" .\nوقد رواه أحمد ، وأبو داود ، والترمذي ، وابن ماجه . فالغرض منه أنه أخر رأيه ونظره واجتهاده إلى ما بعد الكتاب والسنة ، ولو قدمه قبل البحث عنهما لكان من باب التقديم بين يدي الله ورسوله .\nقال علي بن أبي طلحة ، عن ابن عباس : ( لا تقدموا بين يدي الله ورسوله ) : لا تقولوا خلاف الكتاب والسنة .\nوقال العوفي عنه : نهى أن يتكلموا بين يدي كلامه .\nوقال مجاهد : لا تفتاتوا على رسول الله - صلى الله عليه وسلم - بشيء ، حتى يقضي الله على لسانه .\nوقال الضحاك : لا تقضوا أمرا دون الله ورسوله من شرائع دينكم .\nوقال سفيان الثوري : ( لا تقدموا بين يدي الله ورسوله ) بقول ولا فعل .\nوقال الحسن البصري : ( لا تقدموا بين يدي الله ورسوله ) قال : لا تدعوا قبل الإمام .\nوقال قتادة : ذكر لنا أن ناسا كانوا يقولون : لو أنزل في كذا كذا ، وكذا لو صنع كذا ، فكره الله ذلك ، وتقدم فيه .\n( واتقوا الله ) أي : فيما أمركم به ، ( إن الله سميع ) أي : لأقوالكم ) عليم ) بنياتكم .\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ ١\n                                    \n                                    \n                                    تفسير سورة الحجرات .\nمدنية بإجماع . وهي ثماني عشرة آية .\nبسم الله الرحمن الرحيم .\nيا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله واتقوا الله إن الله سميع عليم .\nفيه ثلاث مسائل : الأولى : قوله تعالى : يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله قال العلماء : كان في العربي جفاء وسوء أدب في خطاب النبي - صلى الله عليه وسلم - وتلقيب الناس . فالسورة في الأمر بمكارم الأخلاق ورعاية الآداب . وقرأ الضحاك ويعقوب الحضرمي : ( لا تقدموا ) بفتح التاء والدال من التقدم . الباقون تقدموا بضم التاء وكسر الدال من التقديم . ومعناهما ظاهر ، أي : لا تقدموا قولا ولا فعلا بين يدي الله وقول رسوله وفعله فيما سبيله أن تأخذوه عنه من أمر الدين والدنيا . ومن قدم قوله أو فعله على الرسول - صلى الله عليه وسلم - فقد قدمه على الله تعالى لأن الرسول - صلى الله عليه وسلم - إنما يأمر عن أمر الله عز وجل .\nالثانية : واختلف في سبب نزولها على أقوال ستة :\nالأول : ما ذكره الواحدي من حديث ابن جريج قال : حدثني ابن أبي مليكة أن عبد الله بن الزبير أخبره أنه قدم ركب من بني تميم على رسول الله - صلى الله عليه وسلم - ، فقال أبو بكر : أمر القعقاع بن معبد . وقال عمر : أمر الأقرع بن حابس . فقال أبو بكر : ما أردت إلا خلافي . وقال عمر : ما أردت خلافك . فتماديا حتى ارتفعت أصواتهما ، فنزل في ذلك : يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله - إلى قوله - ولو أنهم صبروا حتى تخرج إليهم رواه البخاري عن الحسن بن محمد بن الصباح ، ذكره المهدوي أيضا .\nالثاني : ما روي أن النبي - صلى الله عليه وسلم - أراد أن يستخلف على المدينة رجلا إذا مضى إلى خيبر ، فأشار عليه عمر برجل آخر ، فنزل : يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله ذكره المهدوي أيضا .\nالثالث : ما ذكره الماوردي عن الضحاك عن ابن عباس - رضي الله عنهما - : أن النبي - صلى الله عليه وسلم - أنفذ أربعة وعشرين رجلا من أصحابه إلى بني عامر فقتلوهم ، إلا ثلاثة تأخروا عنهم فسلموا وانكفئوا إلى المدينة ، فلقوا رجلين من بني سليم فسألوهما عن نسبهما فقالا : من بني عامر لأنهم أعز من بني سليم فقتلوهما ، فجاء نفر من بني سليم إلى رسول الله - صلى الله عليه وسلم - فقالوا : إن بيننا وبينك عهدا ، وقد قتل منا رجلان ، فوداهما النبي - صلى الله عليه وسلم - بمائة بعير ، ونزلت عليه هذه الآية في قتلهم الرجلين .\nالرابع : وقال قتادة : إن ناسا كانوا يقولون لو أنزل في كذا ، لو أنزل في كذا ؟ فنزلت هذه الآية . ابن عباس : نهوا أن يتكلموا بين يدي كلامه . مجاهد : لا تفتاتوا على الله ورسوله حتى يقضي الله على لسان رسوله ، ذكره البخاري أيضا .\n[ الخامس ] : [ وقال ] الحسن : نزلت في قوم ذبحوا قبل أن يصلي رسول الله - صلى الله عليه وسلم - ، فأمرهم أن يعيدوا الذبح . ابن جريج : لا تقدموا أعمال الطاعات قبل وقتها الذي أمر الله تعالى به ورسوله - صلى الله عليه وسلم - .\nقلت : هذه الأقوال الخمسة المتأخرة ذكرها القاضي أبو بكر بن العربي ، وسردها قبله الماوردي . قال القاضي : وهي كلها صحيحة تدخل تحت العموم ، فالله أعلم ما كان السبب المثير للآية منها ، ولعلها نزلت دون سبب ، والله أعلم . قال القاضي : إذا قلنا إنها نزلت في تقديم الطاعات على أوقاتها فهو صحيح ; لأن كل عبادة مؤقتة بميقات لا يجوز تقديمها عليه كالصلاة والصوم والحج ، وذلك بين . إلا أن العلماء اختلفوا في الزكاة ، لما كانت عبادة مالية وكانت مطلوبة لمعنى مفهوم ، وهو سد خلة الفقير ، ولأن النبي - صلى الله عليه وسلم - استعجل من العباس صدقة عامين ، ولما جاء من جمع صدقة الفطر قبل يوم الفطر حتى تعطى لمستحقيها يوم الوجوب وهو يوم الفطر ، فاقتضى ذلك كله جواز تقديمها العام والاثنين . فإن جاء رأس العام والنصاب بحاله وقعت موقعها . وإن جاء رأس العام وقد تغير النصاب تبين أنها صدقة تطوع . وقال أشهب : لا يجوز تقديمها على الحول لحظة كالصلاة ، وكأنه طرد الأصل في العبادات فرأى أنها إحدى دعائم الإسلام فوفاها حقها في النظام وحسن الترتيب . ورأى سائر علمائنا أن التقديم اليسير فيها جائز ; لأنه معفو عنه في الشرع بخلاف الكثير . وما قاله أشهب أصح ، فإن مفارقة اليسير الكثير في أصول الشريعة صحيح ولكنه لمعان تختص باليسير دون الكثير . فأما في مسألتنا فاليوم فيه كالشهر ، والشهر كالسنة . فإما تقديم كلي كما قاله أبو حنيفة والشافعي ، وإما حفظ العبادة على ميقاتها كما قال أشهب .\nالثالثة : قوله تعالى : لا تقدموا بين يدي الله أصل في ترك التعرض لأقوال النبي - صلى الله عليه وسلم - ، وإيجاب اتباعه والاقتداء به ، وكذلك قال النبي - صلى الله عليه وسلم - في مرضه : مروا أبا بكر فليصل بالناس . فقالت عائشة لحفصة - رضي الله عنهما : قولي له إن أبا بكر رجل أسيف ، وإنه متى يقم مقامك لا يسمع الناس من البكاء ، فمر عمر فليصل بالناس . فقال - صلى الله عليه وسلم - : إنكن لأنتن صواحب يوسف . مروا أبا بكر فليصل بالناس . فمعنى قوله ( صواحب يوسف ) الفتنة بالرد عن الجائز إلى غير الجائز . وربما احتج بغاة القياس بهذه الآية . وهو باطل منهم ، فإن ما قامت دلالته فليس في فعله تقديم بين يديه . وقد قامت دلالة الكتاب والسنة على وجوب القول بالقياس في فروع الشرع ، فليس إذا تقدم بين يديه .\nواتقوا الله يعني في التقدم المنهي عنه . إن الله سميع لقولكم عليم بفعلكم .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ ١\n                                        \n                                        \n                                        \n                                        هذا متضمن للأدب، مع الله تعالى، ومع رسول الله صلى الله عليه وسلم، والتعظيم له ، واحترامه، وإكرامه، فأمر [الله] عباده المؤمنين، بما يقتضيه الإيمان، بالله وبرسوله، من امتثال أوامر الله، واجتناب نواهيه، وأن يكونوا ماشين، خلف أوامر الله، متبعين لسنة رسول الله صلى الله عليه وسلم، في جميع أمورهم، و [أن] لا يتقدموا بين يدي الله ورسوله، ولا يقولوا، حتى يقول، ولا يأمروا، حتى يأمر، فإن هذا، حقيقة الأدب الواجب، مع الله ورسوله، وهو عنوان سعادة العبد وفلاحه، وبفواته، تفوته السعادة الأبدية، والنعيم السرمدي، وفي هذا، النهي [الشديد] عن تقديم قول غير الرسول صلى الله عليه وسلم، على قوله، فإنه متى استبانت سنة رسول الله صلى الله عليه وسلم، وجب اتباعها، وتقديمها على غيرها، كائنا ما كان\nثم أمر الله بتقواه عمومًا، وهي كما قال طلق بن حبيب: أن تعمل بطاعة الله، على نور من الله، ترجو ثواب الله، وأن تترك معصية الله، على نور من الله، تخشى عقاب الله.\nوقوله: { إِنَّ اللَّهَ سَمِيعٌ } أي: لجميع الأصوات في جميع الأوقات، في خفي المواضع والجهات، { عَلِيمٌ } بالظواهر والبواطن، والسوابق واللواحق، والواجبات والمستحيلات والممكنات\nوفي ذكر الاسمين الكريمين -بعد النهي عن التقدم بين يدي الله ورسوله، والأمر بتقواه- حث على امتثال تلك الأوامر الحسنة، والآداب المستحسنة، وترهيب عن عدم الامتثال\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Al-Hujurat.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ ٢",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ ٢\n                                    \n                                    \n                                    وقوله : ( ياأيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ) : هذا أدب ثان أدب الله به المؤمنين ألا يرفعوا أصواتهم بين يدي النبي - صلى الله عليه وسلم - [ فوق صوته ] . وقد روي أنها نزلت في الشيخين أبي بكر وعمر ، رضي الله عنهما .\nوقال البخاري : حدثنا بسرة بن صفوان اللخمي ، حدثنا نافع بن عمر ، عن ابن أبي مليكة قال : كاد الخيران أن يهلكا ، أبو بكر وعمر ، رضي الله عنهما ، رفعا أصواتهما عند النبي - صلى الله عليه وسلم - حين قدم عليه ركب بني تميم ، فأشار أحدهما بالأقرع بن حابس أخي بني مجاشع ، وأشار الآخر برجل آخر - قال نافع : لا أحفظ اسمه - فقال أبو بكر لعمر : ما أردت إلا خلافي . قال : ما أردت خلافك . فارتفعت أصواتهما في ذلك ، فأنزل الله : ( يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض ) الآية ، قال ابن الزبير : فما كان عمر يسمع رسول الله - صلى الله عليه وسلم - بعد هذه الآية حتى يستفهمه ، ولم يذكر ذلك عن أبيه : يعني أبا بكر رضي الله عنه . انفرد به دون مسلم .\nثم قال البخاري : حدثنا حسن بن محمد ، حدثنا حجاج ، عن ابن جريج ، حدثني ابن أبي مليكة : أن عبد الله بن الزبير أخبره : أنه قدم ركب من بني تميم على النبي - صلى الله عليه وسلم - فقال أبو بكر : أمر القعقاع بن معبد . وقال عمر : بل أمر الأقرع بن حابس ، فقال أبو بكر : ما أردت إلى - أو : إلا - خلافي . فقال عمر : ما أردت خلافك ، فتماريا حتى ارتفعت أصواتهما ، فنزلت في ذلك : ( يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله ) ، حتى انقضت الآية ، ( ولو أنهم صبروا حتى تخرج إليهم ) الآية [ الحجرات : 5 ] .\nوهكذا رواه هاهنا منفردا به أيضا .\nوقال الحافظ أبو بكر البزار في مسنده : حدثنا الفضل بن سهل ، حدثنا إسحاق بن منصور ، حدثنا حصين بن عمر ، عن مخارق ، عن طارق بن شهاب ، عن أبي بكر الصديق قال : لما نزلت هذه الآية : ( يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ) ، قلت : يا رسول الله ، والله لا أكلمك إلا كأخي السرار .\nحصين بن عمر هذا - وإن كان ضعيفا - لكن قد رويناه من حديث عبد الرحمن بن عوف ، وأبي هريرة [ رضي الله عنه ] بنحو ذلك ، والله أعلم .\nوقال البخاري : حدثنا علي بن عبد الله ، حدثنا أزهر بن سعد ، أخبرنا ابن عون ، أنبأني موسى بن أنس ، عن أنس بن مالك رضي الله عنه ، أن النبي - صلى الله عليه وسلم - افتقد ثابت بن قيس ، فقال رجل : يا رسول الله ، أنا أعلم لك علمه . فأتاه فوجده في بيته منكسا رأسه ، فقال له : ما شأنك ؟ فقال : شر ، كان يرفع صوته فوق صوت النبي - صلى الله عليه وسلم - فقد حبط عمله ، فهو من أهل النار . فأتى الرجل النبي - صلى الله عليه وسلم - فأخبره أنه قال كذا وكذا ، قال موسى : فرجع إليه المرة الآخرة ببشارة عظيمة فقال : \" اذهب إليه فقل له : إنك لست من أهل النار ، ولكنك من أهل الجنة \" تفرد به البخاري من هذا الوجه .\nوقال الإمام أحمد : حدثنا هاشم ، حدثنا سليمان بن المغيرة ، عن ثابت ، عن أنس قال : لما نزلت هذه الآية : ( يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ) إلى : ( وأنتم لا تشعرون ) ، وكان ثابت بن قيس بن الشماس رفيع الصوت فقال : أنا الذي كنت أرفع صوتي على رسول الله - صلى الله عليه وسلم - حبط عملي ، أنا من أهل النار ، وجلس في أهله حزينا ، ففقده رسول الله - صلى الله عليه وسلم - فانطلق بعض القوم إليه فقالوا له : تفقدك رسول الله - صلى الله عليه وسلم - ما لك ؟ قال : أنا الذي أرفع صوتي فوق صوت النبي - صلى الله عليه وسلم - وأجهر له بالقول حبط عملي ، أنا من أهل النار . فأتوا النبي - صلى الله عليه وسلم - فأخبروه بما قال ، فقال : \" لا بل هو من أهل الجنة \" . قال أنس : فكنا نراه يمشي بين أظهرنا ، ونحن نعلم أنه من أهل الجنة . فلما كان يوم اليمامة كان فينا بعض الانكشاف ، فجاء ثابت بن قيس بن شماس ، وقد تحنط ولبس كفنه ، فقال : بئسما تعودون أقرانكم . فقاتلهم حتى قتل .\nوقال مسلم : حدثنا أبو بكر بن أبي شيبة ، حدثنا الحسن بن موسى ، حدثنا حماد بن سلمة ، عن ثابت البناني ، عن أنس بن مالك قال : لما نزلت هذه الآية : ( يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ) إلى آخر الآية ، جلس ثابت في بيته ، قال : أنا من أهل النار . واحتبس عن النبي - صلى الله عليه وسلم - فقال النبي - صلى الله عليه وسلم - لسعد بن معاذ : \" يا أبا عمرو ، ما شأن ثابت ؟ أشتكى ؟ \" فقال سعد : إنه لجاري ، وما علمت له بشكوى . قال : فأتاه سعد فذكر له قول رسول الله - صلى الله عليه وسلم - فقال ثابت : أنزلت هذه الآية ، ولقد علمتم أني من أرفعكم صوتا على رسول الله - صلى الله عليه وسلم - فأنا من أهل النار . فذكر ذلك سعد للنبي - صلى الله عليه وسلم - فقال رسول الله - صلى الله عليه وسلم - : \" بل هو من أهل الجنة \" .\nثم رواه مسلم عن أحمد بن سعيد الدارمي ، عن حيان بن هلال ، عن سليمان بن المغيرة ، به ، قال : ولم يذكر سعد بن معاذ . وعن قطن بن نسير عن جعفر بن سليمان ، عن ثابت ، عن أنس بنحوه . وقال : ليس فيه ذكر سعد بن معاذ .\nحدثنا هريم بن عبد الأعلى الأسدي ، حدثنا المعتمر بن سليمان ، سمعت أبي يذكر عن ثابت ، عن أنس قال : لما نزلت هذه الآية ، واقتص الحديث ، ولم يذكر سعد بن معاذ ، وزاد : فكنا نراه يمشي بين أظهرنا رجل من أهل الجنة . .\nفهذه الطرق الثلاث معللة لرواية حماد بن سلمة ، فيما تفرد به من ذكر سعد بن معاذ . والصحيح : أن حال نزول هذه الآية لم يكن سعد بن معاذ موجودا ; لأنه كان قد مات بعد بني قريظة بأيام قلائل سنة خمس ، وهذه الآية نزلت في وفد بني تميم ، والوفود إنما تواتروا في سنة تسع من الهجرة ، والله أعلم .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا زيد بن الحباب ، حدثنا أبو ثابت بن ثابت بن قيس بن شماس ، حدثني عمي إسماعيل بن محمد بن ثابت بن قيس بن شماس ، عن أبيه قال : لما نزلت هذه الآية : ( لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول ) قال : قعد ثابت بن قيس في الطريق يبكي ، قال : فمر به عاصم بن عدي من بني العجلان ، فقال : ما يبكيك يا ثابت ؟ قال : هذه الآية ، أتخوف أن تكون نزلت في وأنا صيت ، رفيع الصوت . قال : فمضى عاصم بن عدي إلى رسول الله - صلى الله عليه وسلم - قال : وغلبه البكاء ، فأتى امرأته جميلة ابنة عبد الله بن أبي ابن سلول فقال لها : إذا دخلت بيت فرسي فشدي علي الضبة بمسمار فضربته بمسمار حتى إذا خرج عطفه ، وقال : لا أخرج حتى يتوفاني الله عز وجل ، أو يرضى عني رسول الله - صلى الله عليه وسلم - . قال : وأتى عاصم رسول الله - صلى الله عليه وسلم - فأخبره خبره ، فقال : \" اذهب فادعه لي \" . فجاء عاصم إلى المكان فلم يجده ، فجاء إلى أهله فوجده في بيت الفرس ، فقال له : إن رسول الله - صلى الله عليه وسلم - يدعوك . فقال : اكسر الضبة . قال : فخرجا فأتيا النبي - صلى الله عليه وسلم - فقال له رسول الله - صلى الله عليه وسلم - : \" ما يبكيك يا ثابت ؟ \" . فقال : أنا صيت وأتخوف أن تكون هذه الآية نزلت في : ( لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول ) . فقال له رسول الله - صلى الله عليه وسلم - : \" أما ترضى أن تعيش حميدا ، وتقتل شهيدا ، وتدخل الجنة ؟ \" . فقال : رضيت ببشرى الله ورسوله - صلى الله عليه وسلم - ولا أرفع صوتي أبدا على صوت النبي - صلى الله عليه وسلم - .\nوقال العلماء : يكره رفع الصوت عند قبره ، كما كان يكره في حياته ; لأنه محترم حيا وفي قبره ، صلوات الله وسلامه عليه ، دائما . ثم نهى عن الجهر له بالقول كما يجهر الرجل لمخاطبه ممن عداه ، بل يخاطب بسكينة ووقار وتعظيم ; ولهذا قال : ( ولا تجهروا له بالقول كجهر بعضكم لبعض ) ، كما قال : ( لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا ) [ النور : 63 ] .\nوقوله : ( أن تحبط أعمالكم وأنتم لا تشعرون ) أي : إنما نهيناكم عن رفع الصوت عنده خشية أن يغضب من ذلك ، فيغضب الله لغضبه ، فيحبط الله عمل من أغضبه وهو لا يدري ، كما جاء في الصحيح : \" إن الرجل ليتكلم بالكلمة من رضوان الله لا يلقي لها بالا يكتب له بها الجنة . وإن الرجل ليتكلم بالكلمة من سخط الله لا يلقي لها بالا يهوي بها في النار أبعد ما بين السماوات والأرض \" .\nثم ندب الله عز وجل ، إلى خفض الصوت عنده ، وحث على ذلك ، وأرشد إليه ، ورغب فيه ، فقال : ( إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى ) أي : أخلصها لها وجعلها أهلا ومحلا ( لهم مغفرة وأجر عظيم ) .\nوقد قال الإمام أحمد في كتاب الزهد : حدثنا عبد الرحمن ، حدثنا سفيان ، عن منصور ، عن مجاهد ، قال : كتب إلى عمر يا أمير المؤمنين ، رجل لا يشتهي المعصية ولا يعمل بها ، أفضل ، أم رجل يشتهي المعصية ولا يعمل بها ؟ فكتب عمر ، رضي الله عنه : إن الذين يشتهون المعصية ولا يعملون بها ( أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم ) . قال : وأنزل الله : ( إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى ) .\nوقد ذكر هذه القصة غير واحد من التابعين كذلك ، فقد نهى الله عز وجل ، عن رفع الأصوات بحضرة رسول الله - صلى الله عليه وسلم - وقد روينا عن أمير المؤمنين عمر بن الخطاب [ رضي الله عنه ] أنه سمع صوت رجلين في مسجد رسول الله - صلى الله عليه وسلم - قد ارتفعت أصواتهما ، فجاء ، فقال : أتدريان أين أنتما ؟ ثم قال : من أين أنتما ؟ قالا : من أهل الطائف . فقال : لو كنتما من أهل المدينة لأوجعتكما ضربا . وقال العلماء : يكره رفع الصوت عند قبره ، كما كان يكره في حياته ; لأنه محترم حيا وفي قبره ، صلوات الله وسلامه عليه ، دائما . ثم نهى عن الجهر له بالقول كما يجهر الرجل لمخاطبه ممن عداه ، بل يخاطب بسكينة ووقار وتعظيم ; ولهذا قال : ( ولا تجهروا له بالقول كجهر بعضكم لبعض ) ، كما قال : ( لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا ) [ النور : 63 ] .\nوقوله : ( أن تحبط أعمالكم وأنتم لا تشعرون ) أي : إنما نهيناكم عن رفع الصوت عنده خشية أن يغضب من ذلك ، فيغضب الله لغضبه ، فيحبط الله عمل من أغضبه وهو لا يدري ، كما جاء في الصحيح : \" إن الرجل ليتكلم بالكلمة من رضوان الله لا يلقي لها بالا يكتب له بها الجنة . وإن الرجل ليتكلم بالكلمة من سخط الله لا يلقي لها بالا يهوي بها في النار أبعد ما بين السماوات والأرض \" .\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض أن تحبط أعمالكم وأنتم لا تشعرون .\nفيه ست مسائل : الأولى : قوله تعالى : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي روى البخاري والترمذي عن ابن أبي مليكة قال : حدثني عبد الله بن الزبير أن الأقرع بن حابس قدم على النبي - صلى الله عليه وسلم - ، فقال أبو بكر : يا رسول الله استعمله على قومه ، فقال عمر : لا تستعمله يا رسول الله ، فتكلما عند النبي - صلى الله عليه وسلم - حتى ارتفعت أصواتهما ، فقال أبو بكر لعمر : ما أردت إلا خلافي . فقال عمر : ما أردت خلافك ، قال : فنزلت هذه الآية : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي قال : فكان عمر بعد ذلك إذا تكلم عند النبي - صلى الله عليه وسلم - لم يسمع كلامه حتى يستفهمه . قال : وما ذكر ابن الزبير جده يعني أبا بكر . قال : هذا حديث غريب حسن . وقد رواه بعضهم عن ابن أبي مليكة مرسلا ، لم يذكر فيه عن عبد الله بن الزبير .\nقلت : هو البخاري ، قال : عن ابن أبي مليكة كاد الخيران أن يهلكا أبو بكر وعمر ، رفعا أصواتهما عند النبي - صلى الله عليه وسلم - حين قدم عليه ركب بني تميم ، فأشار أحدهما بالأقرع بن حابس أخي بني مجاشع ، وأشار الآخر برجل آخر ، فقال نافع : لا أحفظ اسمه ، فقال أبو بكر لعمر : ما أردت إلا خلافي . فقال : ما أردت خلافك . فارتفعت أصواتهما في ذلك ، فأنزل الله - عز وجل - : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي الآية . فقال ابن الزبير : فما كان عمر يسمع رسول الله - صلى الله عليه وسلم - بعد هذه الآية حتى يستفهمه . ولم يذكر ذلك عن أبيه ، يعني أبا بكر الصديق .\nوذكر المهدوي عن علي - رضي الله عنه - : نزل قوله : لا ترفعوا أصواتكم فوق صوت النبي فينا لما ارتفعت أصواتنا أنا وجعفر وزيد بن حارثة ، نتنازع ابنة حمزة لما جاء بها زيد من مكة ، فقضى بها رسول الله - صلى الله عليه وسلم - لجعفر ; لأن خالتها عنده . وقد تقدم هذا الحديث في ( آل عمران ) وفي الصحيحين عن أنس بن مالك أن النبي - صلى الله عليه وسلم - افتقد ثابت بن قيس فقال رجل : يا رسول الله ، أنا أعلم لك علمه ، فأتاه فوجده جالسا في بيته منكسا رأسه ، فقال له : ما شأنك ؟ فقال : شر! كان يرفع صوته فوق صوت النبي - صلى الله عليه وسلم - فقد حبط عمله وهو من أهل النار . فأتى الرجل النبي - صلى الله عليه وسلم - فأخبره أنه قال كذا وكذا . فقال موسى : فرجع إليه المرة الآخرة ببشارة عظيمة ، فقال : اذهب إليه فقل له إنك لست من أهل النار ولكنك من أهل الجنة ( لفظ البخاري ) وثابت هذا هو ثابت بن قيس بن شماس الخزرجي يكنى أبا محمد بابنه محمد . وقيل : أبا عبد الرحمن . قتل له يوم الحرة ثلاثة من الولد : محمد ، ويحيى ، وعبد الله . وكان خطيبا بليغا معروفا بذلك ، كان يقال له خطيب رسول الله - صلى الله عليه وسلم - ، كما يقال لحسان شاعر رسول الله - صلى الله عليه وسلم - . ولما قدم وفد تميم على رسول الله - صلى الله عليه وسلم - وطلبوا المفاخرة قام خطيبهم فافتخر ، ثم قام ثابت بن قيس فخطب خطبة بليغة جزلة فغلبهم ، وقام شاعرهم وهو الأقرع بن حابس فأنشد :\nأتيناك كيما يعرف الناس فضلنا إذا خالفونا عند ذكر المكارم وإنا رءوس الناس من كل معشر\nوأن ليس في أرض الحجاز كدارم وإن لنا المرباع في كل غارة\nتكون بنجد أو بأرض التهائم\nفقام حسان فقال :\nبني دارم لا تفخروا إن فخركم يعود وبالا عند ذكر المكارم\nهبلتم علينا تفخرون وأنتم لنا خول من بين ظئر وخادم\nفي أبيات لهما .\nفقالوا : خطيبهم أخطب من خطيبنا ، وشاعرهم أشعر من شاعرنا ، فارتفعت أصواتهم فأنزل الله تعالى : لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول وقال عطاء الخراساني : حدثتني ابنة ثابت بن قيس قالت : لما نزلت : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي الآية ، دخل أبوها بيته وأغلق عليه بابه ، ففقده النبي - صلى الله عليه وسلم - فأرسل إليه يسأله ما خبره ، فقال : أنا رجل شديد الصوت ، أخاف أن يكون حبط عملي . فقال - عليه السلام - : ( لست منهم بل تعيش بخير وتموت بخير ) . قال : ثم أنزل الله : إن الله لا يحب كل مختال فخور فأغلق بابه وطفق يبكي ، ففقده النبي - صلى الله عليه وسلم - فأرسل إليه فأخبره ، فقال : يا رسول الله ، إني أحب الجمال وأحب أن أسود قومي . فقال : ( لست منهم بل تعيش حميدا وتقتل شهيدا وتدخل الجنة ) . قالت : فلما كان يوم اليمامة خرج مع خالد بن الوليد إلى مسيلمة فلما التقوا انكشفوا ، فقال ثابت وسالم مولى أبي حذيفة : ما هكذا كنا نقاتل مع رسول الله - صلى الله عليه وسلم - ، ثم حفر كل واحد منهما له حفرة فثبتا وقاتلا حتى قتلا ، وعلى ثابت يومئذ درع له نفيسة ، فمر به رجل من المسلمين فأخذها ، فبينا رجل من المسلمين نائم أتاه ثابت في منامه فقال له : أوصيك بوصية ، فإياك أن تقول هذا حلم فتضيعه ، إني لما قتلت أمس مر بي رجل من المسلمين فأخذ درعي ومنزله في أقصى الناس ، وعند خبائه فرس يستن في طوله ، وقد كفأ على الدرع برمة ، وفوق البرمة رحل ، فأت خالدا فمره أن يبعث إلى درعي فيأخذها ، وإذا قدمت المدينة على خليفة رسول الله - صلى الله عليه وسلم - - يعني أبا بكر - فقل له : إن علي من الدين كذا وكذا ، وفلان من رقيقي عتيق وفلان ، فأتى الرجل خالدا فأخبره ، فبعث إلى الدرع فأتي بها وحدث أبا بكر برؤياه فأجاز وصيته . قال : ولا نعلم أحدا أجيزت وصيته بعد موته غير ثابت ، رحمه الله ، ذكره أبو عمر في الاستيعاب .\nالثانية : قوله تعالى : ولا تجهروا له بالقول أي لا تخاطبوه : يا محمد ، ويا أحمد . ولكن : يا نبي الله ، ويا رسول الله ، توقيرا له . وقيل : كان المنافقون يرفعون أصواتهم عند النبي - صلى الله عليه وسلم - ، ليقتدي بهم ضعفة المسلمين فنهي المسلمون عن ذلك . وقيل : لا تجهروا له أي : لا تجهروا عليه ، كما يقال : سقط لفيه ، أي : على فيه . كجهر بعضكم لبعض الكاف كاف التشبيه في محل النصب ، أي : لا تجهروا له جهرا مثل جهر بعضكم لبعض . وفي هذا دليل على أنهم لم ينهوا عن الجهر مطلقا حتى لا يسوغ لهم إلا أن يكلموه بالهمس والمخافتة ، وإنما نهوا عن جهر مخصوص مقيد بصفة ، أعني الجهر المنعوت بمماثلة ما قد اعتادوه منهم فيما بينهم ، وهو الخلو من مراعاة أبهة النبوة وجلالة مقدارها وانحطاط سائر الرتب وإن جلت عن رتبتها . أن تحبط أعمالكم وأنتم لا تشعرون أي من أجل أن تحبط ، أي : تبطل ، هذا قول البصريين . وقال الكوفيون : أي : لئلا تحبط أعمالكم .\nالثالثة : معنى الآية الأمر بتعظيم رسول الله - صلى الله عليه وسلم - وتوقيره ، وخفض الصوت بحضرته وعند مخاطبته ، أي : إذا نطق ونطقتم فعليكم ألا تبلغوا بأصواتكم وراء الحد الذي يبلغه بصوته ، وأن تغضوا منها بحيث يكون كلامه غالبا لكلامكم ، وجهره باهرا لجهركم ، حتى تكون مزيته عليكم لائحة ، وسابقته واضحة ، وامتيازه عن جمهوركم كشية الأبلق . لا أن تغمروا صوته بلغطكم ، وتبهروا منطقه بصخبكم . وفي قراءة ابن مسعود ( لا ترفعوا بأصواتكم ) وقد كره بعض العلماء رفع الصوت عند قبره - عليه السلام - . وكره بعض العلماء رفع الصوت في مجالس العلماء تشريفا لهم ، إذ هم ورثة الأنبياء .\nالرابعة : قال القاضي أبو بكر بن العربي : حرمة النبي - صلى الله عليه وسلم - ميتا كحرمته حيا ، وكلامه المأثور بعد موته في الرقعة مثال كلامه المسموع من لفظه ، فإذا قرئ كلامه ، وجب على كل حاضر ألا يرفع صوته عليه ، ولا يعرض عنه ، كما كان يلزمه ذلك في مجلسه عند تلفظه به . وقد نبه الله سبحانه على دوام الحرمة المذكورة على مرور الأزمنة بقوله تعالى : وإذا قرئ القرآن فاستمعوا له وأنصتوا . وكلامه - صلى الله عليه وسلم - من الوحي ، وله من الحكمة مثل ما للقرآن ، إلا معان مستثناة ، بيانها في كتب الفقه .\nالخامسة : وليس الغرض برفع الصوت ولا الجهر ما يقصد به الاستخفاف والاستهانة ; لأن ذلك كفر والمخاطبون مؤمنون . وإنما الغرض صوت هو في نفسه ، والمسموع من جرسه غير مناسب لما يهاب به العظماء ويوقر الكبراء ، فيتكلف الغض منه ورده إلى حد يميل به إلى ما يستبين فيه المأمور به من التعزير والتوقير . ولم يتناول النهي أيضا رفع الصوت الذي يتأذى به رسول الله - صلى الله عليه وسلم - ، وهو ما كان منهم في حرب أو مجادلة معاند أو إرهاب عدو أو ما أشبه ذلك ، ففي الحديث أنه قال - عليه السلام - للعباس بن عبد المطلب لما انهزم الناس يوم حنين : ( اصرخ بالناس ) ، وكان العباس أجهر الناس صوتا . يروى أن غارة أتتهم يوما فصاح العباس : يا صاحباه! فأسقطت الحوامل لشدة صوته ، وفيه يقول نابغة بني جعدة :\nزجر أبي عروة السباع إذا أشفق أن يختلطن بالغنم\nزعمت الرواة أنه كان يزجر السباع عن الغنم فيفتق مرارة السبع في جوفه .\nالسادسة : قال الزجاج : أن تحبط أعمالكم التقدير لأن تحبط ، أي : فتحبط أعمالكم ، فاللام المقدرة لام الصيرورة وليس قوله : أن تحبط أعمالكم وأنتم لا تشعرون بموجب أن يكفر الإنسان وهو لا يعلم ، فكما لا يكون الكافر مؤمنا إلا باختياره الإيمان على الكفر ، كذلك لا يكون المؤمن كافرا من حيث لا يقصد إلى الكفر ولا يختاره بإجماع . كذلك لا يكون الكافر كافرا من حيث لا يعلم .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ ٢\n                                        \n                                        \n                                        \n                                        { يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ } وهذا أدب مع رسول الله صلى الله عليه وسلم، في خطابه، أي: لا يرفع المخاطب له، صوته معه، فوق صوته، ولا يجهر له بالقول، بل يغض الصوت، ويخاطبه بأدب ولين، وتعظيم وتكريم، وإجلال وإعظام، ولا يكون الرسول كأحدهم، بل يميزوه في خطابهم، كما تميز عن غيره، في وجوب حقه على الأمة، ووجوب الإيمان به، والحب الذي لا يتم الإيمان إلا به، فإن في عدم القيام بذلك، محذورًا، وخشية أن يحبط عمل العبد وهو لا يشعر، كما أن الأدب معه، من أسباب [حصول الثواب و] قبول الأعمال.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Al-Hujurat.html",
    "contnent": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ ٣",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ ٣\n                                    \n                                    \n                                    ثم ندب الله عز وجل ، إلى خفض الصوت عنده ، وحث على ذلك ، وأرشد إليه ، ورغب فيه ، فقال : ( إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى ) أي : أخلصها لها وجعلها أهلا ومحلا ( لهم مغفرة وأجر عظيم ) .\nوقد قال الإمام أحمد في كتاب الزهد : حدثنا عبد الرحمن ، حدثنا سفيان ، عن منصور ، عن مجاهد ، قال : كتب إلى عمر يا أمير المؤمنين ، رجل لا يشتهي المعصية ولا يعمل بها ، أفضل ، أم رجل يشتهي المعصية ولا يعمل بها ؟ فكتب عمر ، رضي الله عنه : إن الذين يشتهون المعصية ولا يعملون بها ( أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم ) .\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ ٣\n                                    \n                                    \n                                    قوله تعالى : إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم\nقوله تعالى : إن الذين يغضون أصواتهم عند رسول الله أي يخفضون أصواتهم عنده إذا تكلموا إجلالا له ، أو كلموا غيره بين يديه إجلالا له . قال أبو هريرة : لما نزلت لا ترفعوا أصواتكم قال أبو بكر - رضي الله عنه - : والله لا أرفع صوتي إلا كأخي السرار . وذكر سنيد قال : حدثنا عباد بن العوام عن محمد بن عمرو عن أبي سلمة قال : لما نزلت : لا تقدموا بين يدي الله ورسوله قال أبو بكر : والذي بعثك بالحق لا أكلمك بعد هذا إلا كأخي السرار . وقال عبد الله بن الزبير : لما نزلت : لا ترفعوا أصواتكم ما حدث عمر عند النبي - صلى الله عليه وسلم - بعد ذلك فسمع كلامه حتى يستفهمه مما يخفض ، فنزلت : إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى . قال الفراء : أي : أخلصها للتقوى . وقال الأخفش : أي : اختصها للتقوى . وقال ابن عباس : امتحن الله قلوبهم للتقوى طهرهم من كل قبيح ، وجعل في قلوبهم الخوف من الله والتقوى . وقال عمر - رضي الله عنه - : أذهب عن قلوبهم الشهوات . والامتحان : افتعال من محنت الأديم محنا حتى أوسعته . فمعنى امتحن الله قلوبهم للتقوى وسعها وشرحها للتقوى . وعلى الأقوال المتقدمة : امتحن قلوبهم فأخلصها ، كقولك : امتحنت الفضة أي : اختبرتها حتى خلصت . ففي الكلام حذف يدل عليه الكلام ، وهو الإخلاص . وقال أبو عمرو : كل شيء جهدته فقد محنته . وأنشد :\nأتت رذايا باديا كلالها قد محنت واضطربت آطالها\nلهم مغفرة وأجر عظيم .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ ٣\n                                        \n                                        \n                                        \n                                        ثم مدح من غض صوته عند رسول الله صلى الله عليه وسلم، بأن الله امتحن قلوبهم للتقوى، أي: ابتلاها واختبرها، فظهرت نتيجة ذلك، بأن صلحت قلوبهم للتقوى، ثم وعدهم المغفرة لذنوبهم، المتضمنة لزوال الشر والمكروه، والأجر العظيم، الذي لا يعلم وصفه إلا الله تعالى، وفي الأجر العظيم وجود المحبوب وفي هذا، دليل على أن الله يمتحن القلوب، بالأمر والنهي والمحن، فمن لازم أمر الله، واتبع رضاه، وسارع إلى ذلك، وقدمه على هواه، تمحض وتمحص للتقوى، وصار قلبه صالحًا لها ومن لم يكن كذلك، علم أنه لا يصلح للتقوى.\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Al-Hujurat.html",
    "contnent": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ ٤",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ ٤\n                                    \n                                    \n                                    ثم إنه تعالى ذم الذين ينادونه من وراء الحجرات ، وهي بيوت نسائه ، كما يصنع أجلاف الأعراب ، فقال : ( أكثرهم لا يعقلون )\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ ٤\n                                    \n                                    \n                                    قوله تعالى : إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون .\nقال مجاهد وغيره : نزلت في أعراب بني تميم ، قدم الوفد منهم على النبي - صلى الله عليه وسلم - ، فدخلوا المسجد ونادوا النبي - صلى الله عليه وسلم - من وراء حجرته أن اخرج إلينا ، فإن مدحنا زين وذمنا شين . وكانوا سبعين رجلا قدموا الفداء ذراري لهم ، وكان النبي - صلى الله عليه وسلم - نام للقائلة . وروي أن الذي نادى الأقرع بن حابس ، وأنه القائل : إن مدحي زين وإن ذمي شين ، فقال النبي - صلى الله عليه وسلم - : ( ذاك الله ) . ذكره الترمذي عن البراء بن عازب أيضا .\nوروى زيد بن أرقم فقال : أتى أناس النبي - صلى الله عليه وسلم - فقال بعضهم لبعض : انطلقوا بنا إلى هذا الرجل ، فإن يكن نبيا فنحن أسعد الناس باتباعه ، وإن يكن ملكا نعش في جنابه . فأتوا النبي - صلى الله عليه وسلم - فجعلوا ينادونه وهو في حجرته : يا محمد ، يا محمد ، فأنزل الله تعالى هذه الآية . قيل : إنهم كانوا من بني تميم . قال مقاتل كانوا تسعة عشر : قيس بن عاصم ، والزبرقان بن بدر ، والأقرع بن حابس ، وسويد بن هاشم ، وخالد بن مالك ، وعطاء بن حابس ، والقعقاع بن معبد ، ووكيع بن وكيع ، وعيينة بن حصن وهو الأحمق المطاع ، وكان من الجرارين يجر عشرة آلاف قناة ، أي : يتبعه ، وكان اسمه حذيفة وسمي عيينة لشتر كان في عينيه ذكر عبد الرزاق في عيينة هذا : أنه الذي نزل فيه ولا تطع من أغفلنا قلبه عن ذكرنا . وقد مضى في آخر ( الأعراف ) من قوله لعمر - رضي الله عنه - ما فيه كفاية ، ذكره البخاري .\nوروي أنهم وفدوا وقت الظهيرة ورسول الله - صلى الله عليه وسلم - راقد ، فجعلوا ينادونه : يا محمد يا محمد ، اخرج إلينا ، فاستيقظ وخرج ، ونزلت . وسئل رسول الله - صلى الله عليه وسلم - فقال : ( هم جفاة بني تميم لولا أنهم من أشد الناس قتالا للأعور الدجال لدعوت الله عليهم أن يهلكهم ) . والحجرات جمع حجرة ، كالغرفات جمع غرفة ، والظلمات جمع ظلمة . وقيل : الحجرات جمع الحجر ، والحجر جمع حجرة ، فهو جمع الجمع . وفيه لغتان : ضم الجيم وفتحها . قال :\nولما رأونا باديا ركباتنا على موطن لا نخلط الجد بالهزل\nوالحجرة : الرقعة من الأرض المحجورة بحائط يحوط عليها . وحظيرة الإبل تسمى الحجرة ، وهي فعلة بمعنى مفعولة . وقرأ أبو جعفر بن القعقاع ( الحجرات ) بفتح الجيم استثقالا للضمتين . وقرئ ( الحجرات ) بسكون الجيم تخفيفا . وأصل الكلمة المنع . وكل ما منعت أن يوصل إليه فقد حجرت عليه . ثم يحتمل أن يكون المنادي بعضا من الجملة فلهذا قال : أكثرهم لا يعقلون أي إن الذين ينادونك من جملة قوم الغالب عليهم الجهل .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ ٤\n                                        \n                                        \n                                        \n                                        نزلت هذه الآيات الكريمة، في أناس من الأعراب، الذين وصفهم الله تعالى بالجفاء، وأنهم أجدر أن لا يعلموا حدود ما أنزل الله على رسوله، قدموا وافدين على رسول الله صلى الله عليه وسلم، فوجدوه في بيته وحجرات نسائه، فلم يصبروا ويتأدبوا حتى يخرج، بل نادوه: يا محمد يا محمد، [أي: اخرج إلينا]، فذمهم الله بعدم العقل، حيث لم يعقلوا عن الله الأدب مع رسوله واحترامه، كما أن من العقل وعلامته استعمال الأدب.\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Al-Hujurat.html",
    "contnent": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٥",
    "tafsier": {
      "ibnkther": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٥\n                                    \n                                    \n                                    ثم أرشد إلى الأدب في ذلك فقال : ( ولو أنهم صبروا حتى تخرج إليهم لكان خيرا لهم ) أي : لكان لهم في ذلك الخيرة والمصلحة في الدنيا والآخرة .\nثم قال داعيا لهم إلى التوبة والإنابة : ( والله غفور رحيم )\nوقد ذكر أنها نزلت في الأقرع بن حابس التميمي ، فيما أورده غير واحد ، قال الإمام أحمد : حدثنا عفان ، حدثنا وهيب ، حدثنا موسى بن عقبة ، عن أبي سلمة بن عبد الرحمن ، عن الأقرع بن حابس ; أنه نادى رسول الله - صلى الله عليه وسلم - من وراء الحجرات ، فقال : يا محمد ، يا محمد وفي رواية : يا رسول الله - فلم يجبه . فقال : يا رسول الله ، إن حمدي لزين ، وإن ذمي لشين ، فقال : \" ذاك الله عز وجل \" .\nوقال ابن جرير : حدثنا أبو عمار الحسين بن حريث المروزي ، حدثنا الفضل بن موسى ، عن الحسين بن واقد ، عن أبي إسحاق ، عن البراء في قوله : ( إن الذين ينادونك من وراء الحجرات ) قال : جاء رجل رسول الله فقال : يا محمد ، إن حمدي زين ، وذمي شين . فقال : \" ذاك الله عز وجل \" .\nوهكذا ذكره الحسن البصري ، وقتادة مرسلا .\nوقال سفيان الثوري ، عن حبيب بن أبي عمرة قال : كان بشر بن غالب ولبيد بن عطارد - أو بشر بن عطارد ولبيد بن غالب - وهما عند الحجاج جالسان - فقال بشر بن غالب للبيد بن عطارد : نزلت في قومك بني تميم : ( إن الذين ينادونك من وراء الحجرات ) قال : فذكرت ذلك لسعيد بن جبير فقال : أما إنه لو علم بآخر الآية أجابه : ( يمنون عليك أن أسلموا ) [ الحجرات : 17 ] ، قالوا : أسلمنا ، ولم يقاتلك بنو أسد .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا عمرو بن علي الباهلي ، حدثنا المعتمر بن سليمان : سمعت داود الطفاوي يحدث عن أبي مسلم البجلي ، عن زيد بن أرقم قال : اجتمع أناس من العرب فقالوا : انطلقوا بنا إلى هذا الرجل ، فإن يك نبيا فنحن أسعد الناس به ، وإن يك ملكا نعش بجناحه . قال : فأتيت رسول الله - صلى الله عليه وسلم - فأخبرته بما قالوا ، فجاءوا إلى حجرته فجعلوا ينادونه وهو في حجرته : يا محمد ، يا محمد . فأنزل الله [ عز وجل ] : ( إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون ) قال : فأخذ رسول الله - صلى الله عليه وسلم - بأذني فمدها ، فجعل يقول : \" لقد صدق الله قولك يا زيد ، لقد صدق الله قولك يا زيد \" .\nورواه ابن جرير ، عن الحسن بن عرفة ، عن المعتمر بن سليمان ، به .\n                                    ",
      "qortoby": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٥\n                                    \n                                    \n                                    قوله تعالى : ولو أنهم صبروا حتى تخرج إليهم لكان خيرا لهم والله غفور رحيم .\nأي لو انتظروا خروجك لكان أصلح في دينهم ودنياهم . وكان - صلى الله عليه وسلم - لا يحتجب عن الناس إلا في أوقات يشتغل فيهما بمهمات نفسه ، فكان إزعاجه في تلك الحالة من سوء الأدب وقيل : كانوا جاءوا شفعاء في أسارى بني عنبر فأعتق رسول الله - صلى الله عليه وسلم - نصفهم ، وفادى على النصف . ولو صبروا لأعتق جميعهم بغير فداء . والله غفور رحيم\n                                    ",
      "saadi": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٥\n                                        \n                                        \n                                        \n                                        فأدب العبد، عنوان عقله، وأن الله مريد به الخير، ولهذا قال: { وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَهُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ } أي: غفور لما صدر عن عباده من الذنوب، والإخلال بالآداب، رحيم بهم، حيث لم يعاجلهم بذنوبهم بالعقوبات والمثلات.\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Al-Hujurat.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ ٦",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ ٦\n                                    \n                                    \n                                    يأمر تعالى بالتثبت في خبر الفاسق ليحتاط له ، لئلا يحكم بقوله فيكون في نفس الأمر - كاذبا أو مخطئا ، فيكون الحاكم بقوله قد اقتفى وراءه ، وقد نهى الله عن اتباع سبيل المفسدين ، ومن هاهنا امتنع طوائف من العلماء من قبول رواية مجهول الحال لاحتمال فسقه في نفس الأمر ، وقبلها آخرون لأنا إنما أمرنا بالتثبت عند خبر الفاسق ، وهذا ليس بمحقق الفسق لأنه مجهول الحال . وقد قررنا هذه المسألة في كتاب العلم من شرح البخاري ، ولله الحمد والمنة .\nوقد ذكر كثير من المفسرين أن هذه الآية نزلت في الوليد بن عقبة بن أبي معيط ، حين بعثه رسول الله - صلى الله عليه وسلم - على صدقات بني المصطلق . وقد روي ذلك من طرق ، ومن أحسنها ما رواه الإمام أحمد في مسنده من رواية ملك بني المصطلق ، وهو الحارث بن ضرار ، والد جويرية بنت الحارث أم المؤمنين ، رضي الله عنها ، قال الإمام أحمد : حدثنا محمد بن سابق ، حدثنا عيسى بن دينار ، حدثني أبي أنه سمع الحارث بن ضرار الخزاعي يقول : قدمت على رسول الله - صلى الله عليه وسلم - فدعاني إلى الإسلام ، فدخلت فيه وأقررت به ، ودعاني إلى الزكاة فأقررت بها ، وقلت : يا رسول الله ، أرجع إليهم فأدعوهم إلى الإسلام وأداء الزكاة ، فمن استجاب لي جمعت زكاته ، ويرسل إلي رسول الله رسولا لإبان كذا وكذا ليأتيك بما جمعت من الزكاة . فلما جمع الحارث الزكاة ممن استجاب له ، وبلغ الإبان الذي أراد رسول الله - صلى الله عليه وسلم - أن يبعث إليه ، احتبس عليه الرسول فلم يأته ، فظن الحارث أنه قد حدث فيه سخطة من الله ورسوله ، فدعا بسروات قومه ، فقال لهم : إن رسول الله - صلى الله عليه وسلم - كان وقت لي وقتا يرسل إلي رسوله ليقبض ما كان عندي من الزكاة ، وليس من رسول الله - صلى الله عليه وسلم - الخلف ، ولا أرى حبس رسوله إلا من سخطة كانت ، فانطلقوا فنأتي رسول الله - صلى الله عليه وسلم - وبعث رسول الله - صلى الله عليه وسلم - الوليد بن عقبة إلى الحارث ليقبض ما كان عنده مما جمع من الزكاة ، فلما أن سار الوليد حتى بلغ بعض الطريق فرق - أي : خاف - فرجع فأتى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله ، إن الحارث منعني الزكاة وأراد قتلي . فضرب رسول الله - صلى الله عليه وسلم - البعث إلى الحارث . وأقبل الحارث بأصحابه حتى إذا استقبل البعث وفصل عن المدينة لقيهم الحارث ، فقالوا : هذا الحارث ، فلما غشيهم قال لهم : إلى من بعثتم ؟ قالوا : إليك . قال : ولم ؟ قالوا : إن رسول الله - صلى الله عليه وسلم - كان بعث إليك الوليد بن عقبة ، فزعم أنك منعته الزكاة وأردت قتله . قال : لا والذي بعث محمدا بالحق ما رأيته بتة ولا أتاني . فلما دخل الحارث على رسول الله - صلى الله عليه وسلم - قال : \" منعت الزكاة وأردت قتل رسولي ؟ \" . قال : لا والذي بعثك بالحق ما رأيته ولا أتاني ، وما أقبلت إلا حين احتبس علي رسول رسول الله - صلى الله عليه وسلم - خشيت أن يكون كانت سخطة من الله ورسوله . قال : فنزلت الحجرات : ( يا أيها الذين آمنوا إن جاءكم فاسق بنبإ ) إلى قوله : ( حكيم )\nورواه ابن أبي حاتم عن المنذر بن شاذان التمار ، عن محمد بن سابق به . ورواه الطبراني من حديث محمد بن سابق ، به ، غير أنه سماه الحارث بن سرار ، والصواب : الحارث بن ضرار ، كما تقدم .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا جعفر بن عون ، عن موسى بن عبيدة ، عن ثابت مولى أم سلمة ، عن أم سلمة قالت : بعث رسول الله - صلى الله عليه وسلم - رجلا في صدقات بني المصطلق بعد الوقيعة ، فسمع بذلك القوم ، فتلقوه يعظمون أمر رسول الله - صلى الله عليه وسلم - قالت : فحدثه الشيطان أنهم يريدون قتله ، قالت : فرجع إلى رسول الله فقال : إن بني المصطلق قد منعوني صدقاتهم . فغضب رسول الله - صلى الله عليه وسلم - والمسلمون . قالت : فبلغ القوم رجوعه فأتوا رسول الله - صلى الله عليه وسلم - فصفوا له حين صلى الظهر ، فقالوا : نعوذ بالله من سخط الله وسخط رسوله ، بعثت إلينا رجلا مصدقا ، فسررنا بذلك ، وقرت به أعيننا ، ثم إنه رجع من بعض الطريق ، فخشينا أن يكون ذلك غضبا من الله ومن رسوله ، فلم يزالوا يكلمونه حتى جاء بلال فأذن بصلاة العصر ، قالت : ونزلت : ( يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا أن تصيبوا قوما بجهالة فتصبحوا على ما فعلتم نادمين ) .\nوروى ابن جرير أيضا من طريق العوفي ، عن ابن عباس في هذه الآية قال : كان رسول الله - صلى الله عليه وسلم - بعث الوليد بن عقبة بن أبي معيط إلى بني المصطلق ليأخذ منهم الصدقات ، وإنهم لما أتاهم الخبر فرحوا وخرجوا يتلقون رسول رسول الله - صلى الله عليه وسلم - وأنه لما حدث الوليد أنهم خرجوا يتلقونه ، رجع الوليد إلى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله ، إن بني المصطلق قد منعوا الصدقة . فغضب رسول الله - صلى الله عليه وسلم - من ذلك غضبا شديدا ، فبينا هو يحدث نفسه أن يغزوهم إذ أتاه الوفد فقالوا : يا رسول الله ، إنا حدثنا أن رسولك رجع من نصف الطريق ، وإنا خشينا أن ما رده كتاب جاء منك لغضب غضبته علينا ، وإنا نعوذ بالله من غضبه وغضب رسوله . وإن النبي - صلى الله عليه وسلم - استغشهم وهم بهم ، فأنزل الله عذرهم في الكتاب ، فقال : ( يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا ) إلى آخر الآية .\nوقال مجاهد وقتادة : أرسل رسول الله الوليد بن عقبة إلى بني المصطلق ليصدقهم ، فتلقوه بالصدقة ، فرجع فقال : إن بني المصطلق قد جمعت لك لتقاتلك زاد قتادة : وإنهم قد ارتدوا عن الإسلام - فبعث رسول الله خالد بن الوليد إليهم ، وأمره أن يتثبت ولا يعجل . فانطلق حتى أتاهم ليلا فبعث عيونه ، فلما جاءوا أخبروا خالدا أنهم مستمسكون بالإسلام ، وسمعوا أذانهم وصلاتهم ، فلما أصبحوا أتاهم خالد فرأى الذي يعجبه ، فرجع إلى رسول الله - صلى الله عليه وسلم - فأخبره الخبر ، فأنزل الله هذه الآية . قال قتادة : فكان رسول الله - صلى الله عليه وسلم - يقول : \" التبين من الله ، والعجلة من الشيطان \" .\nوكذا ذكر غير واحد من السلف ، منهم : ابن أبي ليلى ، ويزيد بن رومان ، والضحاك ، ومقاتل بن حيان ، وغيرهم في هذه الآية : أنها نزلت في الوليد بن عقبة ، والله أعلم .\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ ٦\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا أن تصيبوا قوما بجهالة فتصبحوا على ما فعلتم نادمين .\nفيه سبع مسائل : الأولى : قوله تعالى : يا أيها الذين آمنوا إن جاءكم فاسق بنبإ قيل : إن هذه الآية نزلت في الوليد بن عقبة بن أبي معيط . وسبب ذلك ما رواه سعيد عن قتادة أن النبي - صلى الله عليه وسلم - بعث الوليد بن عقبة مصدقا إلى بني المصطلق ، فلما أبصروه أقبلوا نحوه فهابهم - في رواية : لإحنة كانت بينه وبينهم - ، فرجع إلى النبي - صلى الله عليه وسلم - فأخبره أنهم قد ارتدوا عن الإسلام . فبعث نبي الله - صلى الله عليه وسلم - خالد بن الوليد وأمره أن يتثبت ولا يعجل ، فانطلق خالد حتى أتاهم ليلا ، فبعث عيونه فلما جاءوا أخبروا خالدا أنهم متمسكون بالإسلام ، وسمعوا أذانهم وصلاتهم ، فلما أصبحوا أتاهم خالد ورأى صحة ما ذكروه ، فعاد إلى نبي الله - صلى الله عليه وسلم - فأخبره ، فنزلت هذه الآية ، فكان يقول نبي الله - صلى الله عليه وسلم - : ( التأني من الله والعجلة من الشيطان ) .\nوفي رواية : أن النبي - صلى الله عليه وسلم - بعثه إلى بني المصطلق بعد إسلامهم ، فلما سمعوا به ركبوا إليه ، فلما سمع بهم خافهم ، فرجع إلى رسول الله - صلى الله عليه وسلم - فأخبره أن القوم قد هموا بقتله ، ومنعوا صدقاتهم . فهم رسول الله - صلى الله عليه وسلم - بغزوهم ، فبينما هم كذلك إذ قدم وفدهم على رسول الله - صلى الله عليه وسلم - فقالوا : يا رسول الله ، سمعنا برسولك فخرجنا إليه لنكرمه ، ونؤدي إليه ما قبلنا من الصدقة ، فاستمر راجعا ، وبلغنا أنه يزعم لرسول الله أنا خرجنا لنقاتله ، والله ما خرجنا لذلك ، فأنزل الله تعالى هذه الآية .\nوسمي الوليد فاسقا أي : كاذبا . قال ابن زيد ومقاتل وسهل بن عبد الله : الفاسق الكذاب . وقال أبو الحسن الوراق : هو المعلن بالذنب . وقال ابن طاهر : الذي لا يستحي من الله . وقرأ حمزة والكسائي ( فتثبتوا ) من التثبت . الباقون فتبينوا من التبيين أن تصيبوا أي لئلا تصيبوا ، ف ( أن ) في محل نصب بإسقاط الخافض . قوما بجهالة أي بخطإ . فتصبحوا على ما فعلتم على العجلة وترك التأني .\nالثانية : في هذه الآية دليل على قبول خبر الواحد إذا كان عدلا ; لأنه إنما أمر فيها بالتثبت عند نقل خبر الفاسق . ومن ثبت فسقه بطل قوله في الأخبار إجماعا ; لأن الخبر أمانة والفسق قرينة يبطلها . وقد استثنى الإجماع من جملة ذلك ما يتعلق بالدعوى والجحود ، وإثبات حق مقصود على الغير ، مثل أن يقول : هذا عبدي ، فإنه يقبل قوله . وإذا قال : قد أنفذ فلان هذا لك هدية ، فإنه يقبل ذلك . وكذلك يقبل في مثله خبر الكافر . وكذلك إذا أقر لغيره بحق على نفسه فلا يبطل إجماعا . وأما في الإنشاء على غيره فقال الشافعي وغيره : لا يكون وليا في النكاح . وقال أبو حنيفة ومالك : يكون وليا لأنه يلي مالها فيلي بضعها . كالعدل ، وهو وإن كان فاسقا في دينه إلا أن غيرته موفرة وبها يحمي الحريم ، وقد يبذل المال ويصون الحرمة ، وإذا ولي المال فالنكاح أولى .\nالثالثة : قال ابن العربي : ومن العجب أن يجوز الشافعي ونظراؤه إمامة الفاسق . ومن لا يؤتمن على حبة مال كيف يصح أن يؤتمن على قنطار دين . وهذا إنما كان أصله أن الولاة الذين كانوا يصلون بالناس لما فسدت أديانهم ولم يمكن ترك الصلاة وراءهم ، ولا استطيعت إزالتهم صلي معهم ووراءهم ، كما قال عثمان : الصلاة أحسن ما يفعل الناس ، فإذا أحسنوا فأحسن ، وإذا أساءوا فاجتنب إساءتهم . ثم كان من الناس من إذا صلى معهم تقية أعادوا الصلاة لله ، ومنهم من كان يجعلها صلاته . وبوجوب الإعادة أقول ، فلا ينبغي لأحد أن يترك الصلاة مع من لا يرضى من الأئمة ، ولكن يعيد سرا في نفسه ، ولا يؤثر ذلك عند غيره .\nالرابعة : وأما أحكامه إن كان واليا فينفذ منها ما وافق الحق ويرد ما خالفه ، ولا ينقض حكمه الذي أمضاه بحال ، ولا تلتفتوا إلى غير هذا القول من رواية تؤثر أو قول يحكى ، فإن الكلام كثير والحق ظاهر .\nالخامسة : لا خلاف في أنه يصح أن يكون رسولا عن غيره في قول يبلغه أو شيء يوصله ، أو إذن يعلمه ، إذا لم يخرج عن حق المرسل ، والمبلغ ، فإن تعلق به حق لغيرهما لم يقبل قوله . وهذا جائز للضرورة الداعية إليه ، فإنه لو لم يتصرف بين الخلق في هذه المعاني إلا العدول لم يحصل منها شيء لعدمهم في ذلك . والله أعلم .\nالسادسة : وفي الآية دليل على فساد من قال : إن المسلمين كلهم عدول حتى تثبت الجرحة ; لأن الله تعالى أمر بالتثبت قبل القبول ، ولا معنى للتثبت بعد إنفاذ الحكم ، فإن حكم الحاكم قبل التثبت فقد أصاب المحكوم عليه بجهالة .\nالسابعة : فإن قضى بما يغلب على الظن لم يكن ذلك عملا بجهالة ، كالقضاء بالشاهدين العدلين ، وقبول قول العالم المجتهد . وإنما العمل بالجهالة قبول قول من لا يحصل غلبة الظن بقبوله . ذكر هذه المسألة القشيري ، والذي قبلها المهدوي .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ ٦\n                                        \n                                        \n                                        \n                                        وهذا أيضًا، من الآداب التي على أولي الألباب، التأدب بها واستعمالها، وهو أنه إذا أخبرهم فاسق بخبر أن يتثبتوا في خبره، ولا يأخذوه مجردًا، فإن في ذلك خطرًا كبيرًا، ووقوعًا في الإثم، فإن خبره إذا جعل بمنزلة خبر الصادق العدل، حكم بموجب ذلك ومقتضاه، فحصل من تلف النفوس والأموال، بغير حق، بسبب ذلك الخبر ما يكون سببًا للندامة، بل الواجب عند خبر الفاسق، التثبت والتبين، فإن دلت الدلائل والقرائن على صدقه، عمل به وصدق، وإن دلت على كذبه، كذب، ولم يعمل به، ففيه دليل، على أن خبر الصادق مقبول، وخبر الكاذب، مردود، وخبر الفاسق متوقف فيه كما ذكرنا، ولهذا كان السلف يقبلون روايات كثير [من] الخوارج، المعروفين بالصدق، ولو كانوا فساقًا.\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Al-Hujurat.html",
    "contnent": " وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ ٧",
    "tafsier": {
      "ibnkther": "وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ ٧\n                                    \n                                    \n                                    وقوله : ( واعلموا أن فيكم رسول الله ) أي : اعلموا أن بين أظهركم رسول الله فعظموه ووقروه ، وتأدبوا معه ، وانقادوا لأمره ، فإنه أعلم بمصالحكم ، وأشفق عليكم منكم ، ورأيه فيكم أتم من رأيكم لأنفسكم ، كما قال تعالى : ( النبي أولى بالمؤمنين من أنفسهم ) [ الأحزاب : 6 ] .\nثم بين [ تعالى ] أن رأيهم سخيف بالنسبة إلى مراعاة مصالحهم فقال : ( لو يطيعكم في كثير من الأمر لعنتم ) أي : لو أطاعكم في جميع ما تختارونه لأدى ذلك إلى عنتكم وحرجكم ، كما قال تعالى : ( ولو اتبع الحق أهواءهم لفسدت السماوات والأرض ومن فيهن بل أتيناهم بذكرهم فهم عن ذكرهم معرضون ) [ المؤمنون : 71 ] .\nوقوله : ( ولكن الله حبب إليكم الإيمان وزينه في قلوبكم ) أي : حببه إلى نفوسكم وحسنه في قلوبكم .\nقال الإمام أحمد : حدثنا بهز ، حدثنا علي بن مسعدة ، حدثنا قتادة ، عن أنس قال : كان رسول الله - صلى الله عليه وسلم - يقول : \" الإسلام علانية ، والإيمان في القلب \" قال : ثم يشير بيده إلى صدره ثلاث مرات ، ثم يقول : \" التقوى هاهنا ، التقوى هاهنا \" .\n( وكره إليكم الكفر والفسوق والعصيان ) أي : وبغض إليكم الكفر والفسوق ، وهي : الذنوب الكبار . والعصيان وهي جميع المعاصي . وهذا تدريج لكمال النعمة .\nوقوله : ( أولئك هم الراشدون ) أي : المتصفون بهذه الصفة هم الراشدون ، الذين قد آتاهم الله رشدهم .\nقال الإمام أحمد : حدثنا مروان بن معاوية الفزاري ، حدثنا عبد الواحد بن أيمن المكي ، عن ابن رفاعة الزرقي ، عن أبيه قال : لما كان يوم أحد وانكفأ المشركون ، قال رسول الله - صلى الله عليه وسلم - : \" استووا حتى أثني على ربي عز وجل \" فصاروا خلفه صفوفا ، فقال : \" اللهم لك الحمد كله . اللهم لا قابض لما بسطت ، ولا باسط لما قبضت ، ولا هادي لمن أضللت ، ولا مضل لمن هديت . ولا معطي لما منعت ، ولا مانع لما أعطيت . ولا مقرب لما باعدت ، ولا مباعد لما قربت . اللهم ابسط علينا من بركاتك ورحمتك وفضلك ورزقك . اللهم إني أسألك النعيم المقيم الذي لا يحول ولا يزول . اللهم إني أسألك النعيم يوم العيلة ، والأمن يوم الخوف . اللهم إنى عائذ بك من شر ما أعطيتنا ، ومن شر ما منعتنا . اللهم حبب إلينا الإيمان وزينه في قلوبنا ، وكره إلينا الكفر والفسوق والعصيان ، واجعلنا من الراشدين . اللهم توفنا مسلمين ، وأحينا مسلمين ، وألحقنا بالصالحين ، غير خزايا ولا مفتونين . اللهم قاتل الكفرة الذين يكذبون رسلك ويصدون عن سبيلك ، واجعل عليهم رجزك وعذابك . اللهم قاتل الكفرة الذين أوتوا الكتاب ، إله الحق \" .\nورواه النسائي في اليوم والليلة عن زياد بن أيوب ، عن مروان بن معاوية ، عن عبد الواحد بن أيمن ، عن عبيد بن رفاعة ، عن أبيه ، به .\nوفي الحديث المرفوع : \" من سرته حسنته ، وساءته سيئته ، فهو مؤمن \" .\n                                    ",
      "qortoby": "وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ ٧\n                                    \n                                    \n                                    وله تعالى : واعلموا أن فيكم رسول الله لو يطيعكم في كثير من الأمر لعنتم ولكن الله حبب إليكم الإيمان وزينه في قلوبكم وكره إليكم الكفر والفسوق والعصيان أولئك هم الراشدون.\nقوله تعالى : واعلموا أن فيكم رسول الله فلا تكذبوا ، فإن الله يعلمه أنباءكم فتفتضحون . لو يطيعكم في كثير من الأمر لعنتم أي لو تسارع إلى ما أردتم قبل وضوح الأمر لنالكم مشقة وإثم ، فإنه لو قتل القوم الذين سعى بهم الوليد بن عقبة إليه لكان خطأ ، ولعنت من أراد إيقاع الهلاك بأولئك القوم لعداوة كانت بينه وبينهم . ومعنى طاعة الرسول لهم : الائتمار بما يأمر به فيما يبلغونه عن الناس والسماع منهم . والعنت : الإثم ، يقال : عنت الرجل . والعنت أيضا الفجور والزنى ، كما في سورة ( النساء ) والعنت أيضا الوقوع في أمر شاق ، وقد مضى في آخر ( براءة ) القول في عنتم بأكثر من هذا . ولكن الله حبب إليكم الإيمان هذا خطاب للمؤمنين المخلصين الذين لا يكذبون النبي - صلى الله عليه وسلم - ولا يخبرون بالباطل ، أي : جعل الإيمان أحب الأديان إليكم . وزينه بتوفيقه . في قلوبكم أي : حسنه إليكم حتى اخترتموه . وفي هذا رد على القدرية والإمامية وغيرهم ، حسب ما تقدم في غير موضع . فهو سبحانه المنفرد بخلق ذوات الخلق وخلق أفعالهم وصفاتهم واختلاف ألسنتهم وألوانهم ، لا شريك له .\nوكره إليكم الكفر والفسوق والعصيان قال ابن عباس : يريد به الكذب خاصة . وقاله ابن زيد . وقيل : كل ما خرج عن الطاعة ، مشتق من فسقت الرطبة خرجت من قشرها . والفأرة من جحرها . وقد مضى في ( البقرة ) القول فيه مستوفى . والعصيان جمع المعاصي . أولئك هم يعني هم الذين وفقهم الله فحبب إليهم الإيمان وكره إليهم الكفر أي : قبحه عندهم ، الراشدون كقوله تعالى : وما آتيتم من زكاة تريدون وجه الله فأولئك هم المضعفون . قال النابغة :\nيا دار مية بالعلياء فالسند أقوت وطال عليها سالف الأمد\nوالرشد الاستقامة على طريق الحق مع تصلب فيه ، من الرشاد وهي الصخرة . قال أبو الوازع : كل صخرة رشادة . وأنشد :\nوغير مقلد وموشمات صلين الضوء من صم الرشاد\n                                    ",
      "saadi": "وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ ٧\n                                        \n                                        \n                                        \n                                        أي: ليكن لديكم معلومًا أن رسول الله صلى الله عليه وسلم، بين أظهركم، وهو الرسول الكريم، البار، الراشد، الذي يريد بكم الخير وينصح لكم، وتريدون لأنفسكم من الشر والمضرة، ما لا يوافقكم الرسول عليه، ولو يطيعكم في كثير من الأمر لشق عليكم وأعنتكم، ولكن الرسول يرشدكم، والله تعالى يحبب إليكم الإيمان، ويزينه في قلوبكم، بما أودع الله في قلوبكم من محبة الحق وإيثاره، وبما ينصب على الحق من الشواهد، والأدلة الدالة على صحته، وقبول القلوب والفطر له، وبما يفعله تعالى بكم، من توفيقه للإنابة إليه، ويكره إليكم الكفر والفسوق، أي: الذنوب الكبار، والعصيان: هي ما دون ذلك من الذنوب بما أودع في قلوبكم من كراهة الشر، وعدم إرادة فعله، وبما نصبه من الأدلة والشواهد على فساده، وعدم قبول الفطر له، وبما يجعله الله من الكراهة في القلوب له\n{ أُولَئِكَ } أي: الذين زين الله الإيمان في قلوبهم، وحببه إليهم، وكره إليهم الكفر والفسوق والعصيان { هُمُ الرَّاشِدُونَ } أي: الذين صلحت علومهم وأعمالهم، واستقاموا على الدين القويم، والصراط المستقيم.\nوضدهم الغاوون، الذين حبب إليهم الكفر والفسوق والعصيان، وكره إليهم الإيمان، والذنب ذنبهم، فإنهم لما فسقوا طبع الله على قلوبهم، ولما { زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ } ولما لم يؤمنوا بالحق لما جاءهم أول مرة، قلب الله أفئدتهم.\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Al-Hujurat.html",
    "contnent": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٨",
    "tafsier": {
      "ibnkther": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٨\n                                    \n                                    \n                                    ثم قال : ( فضلا من الله ونعمة ) أي : هذا العطاء الذي منحكموه هو فضل منه عليكم ونعمة من لدنه ، ( والله عليم حكيم ) أي : عليم بمن يستحق الهداية ممن يستحق الغواية ، حكيم في أقواله وأفعاله ، وشرعه وقدره .\n                                    ",
      "qortoby": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٨\n                                    \n                                    \n                                    فضلا من الله ونعمة أي فعل الله ذلك بكم فضلا ، أي : الفضل والنعمة ، فهو مفعول له . والله عليم حكيم عليم بما يصلحكم حكيم في تدبيركم .\n                                    ",
      "saadi": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٨\n                                        \n                                        \n                                        \n                                        { فَضْلًا مِنَ اللَّهِ وَنِعْمَةً } أي: ذلك الخير الذي حصل لهم، هو بفضل الله عليهم وإحسانه، لا بحولهم وقوتهم.\n{ وَاللَّهُ عَلِيمٌ حَكِيمٌ } أي: عليم بمن يشكر النعمة، فيوفقه لها، ممن لا يشكرها، ولا تليق به، فيضع فضله، حيث تقتضيه حكمته.\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Al-Hujurat.html",
    "contnent": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٩",
    "tafsier": {
      "ibnkther": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٩\n                                    \n                                    \n                                    يقول تعالى آمرا بالإصلاح بين المسلمين الباغين بعضهم على بعض : ( وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما ) ، فسماهم مؤمنين مع الاقتتال . وبهذا استدل البخاري وغيره على أنه لا يخرج من الإيمان بالمعصية وإن عظمت ، لا كما يقوله الخوارج ومن تابعهم من المعتزلة ونحوهم . وهكذا ثبت في صحيح البخاري من حديث الحسن ، عن أبي بكرة أن رسول الله - صلى الله عليه وسلم - خطب يوما ومعه على المنبر الحسن بن علي ، فجعل ينظر إليه مرة وإلى الناس أخرى ويقول : \" إن ابني هذا سيد ولعل الله أن يصلح به بين فئتين عظيمتين من المسلمين \" . فكان كما قال ، صلوات الله وسلامه عليه ، أصلح الله به بين أهل الشام وأهل العراق ، بعد الحروب الطويلة والواقعات المهولة .\nوقوله : ( فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله ) أي : حتى ترجع إلى أمر الله وتسمع للحق وتطيعه ، كما ثبت في الصحيح عن أنس : أن رسول الله - صلى الله عليه وسلم - قال : \" انصر أخاك ظالما أو مظلوما \" . قلت : يا رسول الله ، هذا نصرته مظلوما فكيف أنصره ظالما ؟ قال : \" تمنعه من الظلم ، فذاك نصرك إياه \" .\nوقال الإمام أحمد : حدثنا عارم ، حدثنا معتمر قال : سمعت أبي يحدث : أن أنسا قال : قيل للنبي - صلى الله عليه وسلم - : لو أتيت عبد الله بن أبي ؟ فانطلق إليه نبي الله - صلى الله عليه وسلم - وركب حمارا ، وانطلق المسلمون يمشون ، وهي أرض سبخة ، فلما انطلق إليه النبي - صلى الله عليه وسلم - قال : \" إليك عني ، فوالله لقد آذاني ريح حمارك \" فقال رجل من الأنصار : والله لحمار رسول الله أطيب ريحا منك . قال : فغضب لعبد الله رجال من قومه ، فغضب لكل واحد منهما أصحابه ، قال : فكان بينهم ضرب بالجريد والأيدي والنعال ، فبلغنا أنه أنزلت فيهم : ( وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما )\nورواه البخاري في \" الصلح \" عن مسدد ، ومسلم في \" المغازي \" عن محمد بن عبد الأعلى ، كلاهما عن المعتمر بن سليمان ، عن أبيه ، به نحوه .\nوذكر سعيد بن جبير : أن الأوس والخزرج كان بينهما قتال بالسعف والنعال ، فأنزل الله هذه الآية ، فأمر بالصلح بينهما .\nوقال السدي : كان رجل من الأنصار يقال له : \" عمران \" ، كانت له امرأة تدعى أم زيد ، وإن المرأة أرادت أن تزور أهلها فحبسها زوجها وجعلها في علية له لا يدخل عليها أحد من أهلها . وإن المرأة بعثت إلى أهلها ، فجاء قومها وأنزلوها لينطلقوا بها ، وإن الرجل قد كان خرج ، فاستعان أهل الرجل ، فجاء بنو عمه ليحولوا بين المرأة وبين أهلها ، فتدافعوا واجتلدوا بالنعال ، فنزلت فيهم هذه الآية . فبعث إليهم رسول الله - صلى الله عليه وسلم - وأصلح بينهم ، وفاءوا إلى أمر الله .\nوقوله : ( فإن فاءت فأصلحوا بينهما بالعدل وأقسطوا إن الله يحب المقسطين ) أي : اعدلوا بينهم فيما كان أصاب بعضهم لبعض ، بالقسط ، وهو العدل ، ( إن الله يحب المقسطين )\nقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا محمد بن أبي بكر المقدمي ، حدثنا عبد الأعلى ، عن معمر ، عن الزهري ، عن سعيد بن المسيب ، عن عبد الله بن عمر أن رسول الله - صلى الله عليه وسلم - قال : \" إن المقسطين في الدنيا على منابر من لؤلؤ بين يدي الرحمن ، بما أقسطوا في الدنيا \" .\nورواه النسائي عن محمد بن المثنى ، عن عبد الأعلى ، به . وهذا إسناده جيد قوي ، رجاله على شرط الصحيح .\nوحدثنا محمد بن عبد الله بن يزيد ، حدثنا سفيان بن عيينة ، عن عمرو بن دينار ، عن عمرو بن أوس ، عن عبد الله بن عمرو ، عن النبي - صلى الله عليه وسلم - قال : \" المقسطون عند الله يوم القيامة على منابر من نور على يمين العرش ، الذين يعدلون في حكمهم وأهاليهم وما ولوا \" .\nورواه مسلم والنسائي ، من حديث سفيان بن عيينة ، به .\n                                    ",
      "qortoby": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٩\n                                    \n                                    \n                                    قوله تعالى : وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله فإن فاءت فأصلحوا بينهما بالعدل وأقسطوا إن الله يحب المقسطين .\nفيه عشر مسائل :\nالأولى : قوله تعالى : وإن طائفتان من المؤمنين اقتتلوا روى المعتمر بن سليمان عن أنس بن مالك قال : قلت : يا نبي الله ، لو أتيت عبد الله بن أبي ؟ فانطلق إليه النبي - صلى الله عليه وسلم - ، فركب حمارا وانطلق المسلمون يمشون ، وهي أرض سبخة ، فلما أتاه النبي - صلى الله عليه وسلم - قال : إليك عني! فوالله لقد آذاني نتن حمارك . فقال رجل من الأنصار : والله لحمار رسول الله - صلى الله عليه وسلم - أطيب ريحا منك . فغضب لعبد الله رجل من قومه ، وغضب لكل واحد منهما أصحابه ، فكان بينهم حرب بالجريد والأيدي والنعال ، فبلغنا أنه أنزل فيهم هذه الآية .\nوقال مجاهد : نزلت في الأوس والخزرج . قال مجاهد : تقاتل حيان من الأنصار بالعصي والنعال فنزلت الآية . ومثله عن سعيد بن جبير : أن الأوس والخزرج كان بينهم على عهد رسول الله - صلى الله عليه وسلم - قتال بالسعف والنعال ونحوه ، فأنزل الله هذه الآية فيهم .\nوقال قتادة : نزلت في رجلين من الأنصار كانت بينهما مدارأة في حق بينهما! فقال أحدهما : لآخذن حقي عنوة ، لكثرة عشيرته . ودعاه الآخر إلى أن يحاكمه إلى رسول الله - صلى الله عليه وسلم - فأبى أن يتبعه ، فلم يزل الأمر بينهما حتى تواقعا وتناول بعضهم بعضا بالأيدي والنعال والسيوف ، فنزلت هذه الآية . وقال الكلبي : نزلت في حرب سمير وحاطب ، وكان سمير قتل حاطبا ، فاقتتل الأوس والخزرج حتى أتاهم النبي - صلى الله عليه وسلم - ، فنزلت . وأمر الله نبيه - صلى الله عليه وسلم - والمؤمنين أن يصلحوا بينهما . وقال السدي : كانت امرأة من الأنصار يقال لها : أم زيد تحت رجل من غير الأنصار ، فتخاصمت مع زوجها ، أرادت أن تزور قومها فحبسها زوجها وجعلها في علية لا يدخل عليها أحد من أهلها ، وأن المرأة بعثت إلى قومها ، فجاء قومها فأنزلوها لينطلقوا بها ، فخرج الرجل فاستغاث أهله فخرج بنو عمه ليحولوا بين المرأة وأهلها ، فتدافعوا وتجالدوا بالنعال ، فنزلت الآية .\nوالطائفة تتناول الرجل الواحد والجمع والاثنين ، فهو مما حمل على المعنى دون اللفظ ; لأن الطائفتين في معنى القوم والناس . وفي قراءة عبد الله ( حتى يفيئوا إلى أمر الله فإن فاءوا فخذوا بينهم بالقسط ) وقرأ ابن أبي عبلة ( اقتتلتا ) على لفظ الطائفتين . وقد مضى في آخر ( براءة ) القول فيه . وقال ابن عباس في قوله - عز وجل - : وليشهد عذابهما طائفة من المؤمنين قال : الواحد فما فوقه ، والطائفة من الشيء القطعة منه . فأصلحوا بينهما بالدعاء إلى كتاب الله لهما أو عليهما . فإن بغت إحداهما على الأخرى تعدت ولم تجب إلى حكم الله وكتابه . والبغي : التطاول والفساد . فقاتلوا التي تبغي حتى تفيء إلى أمر الله أي ترجع إلى كتابه . فإن فاءت أي فإن رجعت فأصلحوا بينهما بالعدل أي احملوهما على الإنصاف . وأقسطوا أيها الناس فلا تقتتلوا . وقيل : أقسطوا أي : اعدلوا . إن الله يحب المقسطين أي العادلين المحقين .\nالثانية : قال العلماء : لا تخلو الفئتان من المسلمين في اقتتالهما ، إما أن يقتتلا على سبيل البغي منهما جميعا أو لا . فإن كان الأول فالواجب في ذلك أن يمشى بينهما بما يصلح ذات البين ويثمر المكافة والموادعة . فإن لم يتحاجزا ولم يصطلحا وأقامتا على البغي صير إلى مقاتلتهما . وأما إن كان الثاني وهو أن تكون إحداهما باغية على الأخرى ، فالواجب أن تقاتل فئة البغي إلى أن تكف وتتوب ، فإن فعلت أصلح بينها وبين المبغي عليها بالقسط والعدل . فإن التحم القتال بينهما لشبهة دخلت عليهما وكلتاهما عند أنفسهما محقة ، فالواجب إزالة الشبهة بالحجة النيرة والبراهين القاطعة على مراشد الحق . فإن ركبتا متن اللجاج ولم تعملا على شاكلة ما هديتا إليه ونصحتا به من اتباع الحق بعد وضوحه لهما فقد لحقتا بالفئتين الباغيتين . والله أعلم .\nالثالثة : هذه الآية دليل على وجوب قتال الفئة الباغية المعلوم بغيها على الإمام أو على أحد من المسلمين ، وعلى فساد قول من منع من قتال المؤمنين ، واحتج بقوله - عليه السلام - : ( قتال المؤمن كفر ) . ولو كان قتال المؤمن الباغي كفرا لكان الله تعالى قد أمر بالكفر ، تعالى الله عن ذلك! وقد قاتل الصديق - رضي الله عنه - : من تمسك بالإسلام وامتنع من الزكاة ، وأمر ألا يتبع مول ، ولا يجهز على جريح ، ولم تحل أموالهم ، بخلاف الواجب في الكفار . وقال الطبري : لو كان الواجب في كل اختلاف يكون بين الفريقين الهرب منه ولزوم المنازل لما أقيم حد ولا أبطل باطل ، ولوجد أهل النفاق والفجور سبيلا إلى استحلال كل ما حرم الله عليهم من أموال المسلمين وسبي نسائهم وسفك دمائهم ، بأن يتحزبوا عليهم ، ويكف المسلمون أيديهم عنهم ، وذلك مخالف لقوله - عليه السلام - : ( خذوا على أيدي سفهائكم ) .\nالرابعة : قال القاضي أبو بكر بن العربي : هذه الآية أصل في قتال المسلمين ، والعمدة في حرب المتأولين ، وعليها عول الصحابة ، وإليها لجأ الأعيان من أهل الملة ، وإياها عنى النبي - صلى الله عليه وسلم - بقوله : ( تقتل عمارا الفئة الباغية ) . وقوله - عليه السلام - في شأن الخوارج : ( يخرجون على خير فرقة أو على حين فرقة ] ، والرواية الأولى أصح ، لقوله - عليه السلام - : ( تقتلهم أولى الطائفتين إلى الحق ) . وكان الذي قتلهم علي بن أبي طالب ومن كان معه . فتقرر عند علماء المسلمين وثبت بدليل الدين أن عليا - رضي الله عنه - كان إماما ، وأن كل من خرج عليه باغ وأن قتاله واجب حتى يفيء إلى الحق وينقاد إلى الصلح ; لأن عثمان - رضي الله عنه - قتل والصحابة برآء من دمه ; لأنه منع من قتال من ثار عليه وقال : لا أكون أول من خلف رسول الله - صلى الله عليه وسلم - في أمته بالقتل ، فصبر على البلاء ، واستسلم للمحنة وفدى بنفسه الأمة . ثم لم يمكن ترك الناس سدى ، فعرضت على باقي الصحابة الذين ذكرهم عمر في الشورى ، وتدافعوها ، وكان علي كرم الله وجهه أحق بها وأهلها ، فقبلها حوطة على الأمة أن تسفك دماؤها بالتهارج والباطل ، أو يتخرق أمرها إلى ما لا يتحصل . فربما تغير الدين وانقض عمود الإسلام . فلما بويع له طلب أهل الشام في شرط البيعة التمكن من قتلة عثمان وأخذ القود منهم ، فقال لهم علي - رضي الله عنه - : ادخلوا في البيعة واطلبوا الحق تصلوا إليه . فقالوا : لا تستحق بيعة وقتلة عثمان معك تراهم صباحا ومساء . فكان علي في ذلك أشد رأيا وأصوب قيلا ; لأن عليا لو تعاطى القود منهم لتعصبت لهم قبائل وصارت حربا ثالثة ، فانتظر بهم أن يستوثق الأمر وتنعقد البيعة ، ويقع الطلب من الأولياء في مجلس الحكم ، فيجري القضاء بالحق .\nولا خلاف بين الأمة أنه يجوز للإمام تأخير القصاص إذا أدى ذلك إلى إثارة الفتنة أو تشتيت الكلمة . وكذلك جرى لطلحة والزبير ، فإنهما ما خلعا عليا من ولاية ولا اعترضا عليه في ديانة ، وإنما رأيا أن البداءة بقتل أصحاب عثمان أولى .\nقلت : فهذا قول في سبب الحرب الواقع بينهم . وقال جلة من أهل العلم : إن الوقعة بالبصرة بينهم كانت على غير عزيمة منهم على الحرب بل فجأة ، وعلى سبيل دفع كل واحد من الفريقين عن أنفسهم لظنه أن الفريق الآخر قد غدر به ; لأن الأمر كان قد انتظم بينهم ، وتم الصلح والتفرق على الرضا . فخاف قتلة عثمان - رضي الله عنه - من التمكين منهم والإحاطة بهم ، فاجتمعوا وتشاوروا واختلفوا ، ثم اتفقت آراؤهم على أن يفترقوا فريقين ، ويبدءوا بالحرب سحرة في العسكرين ، وتختلف السهام بينهم ، ويصيح الفريق الذي في عسكرعلي : غدر طلحة والزبير . والفريق الذي في عسكر طلحة والزبير : غدر علي . فتم لهم ذلك على ما دبروه ، ونشبت الحرب ، فكان كل فريق دافعا لمكرته عند نفسه ، ومانعا من الإشاطة بدمه . وهذا صواب من الفريقين وطاعة لله تعالى ، إذ وقع القتال والامتناع منهما على هذه السبيل . وهذا هو الصحيح المشهور . والله أعلم .\nالخامسة : قوله تعالى : فقاتلوا التي تبغي حتى تفيء إلى أمر الله أمر بالقتال . وهو فرض على الكفاية إذا قام به البعض سقط عن الباقين ، ولذلك تخلف قوم من الصحابة - رضي الله عنهم - عن هذه المقامات ، كسعد بن أبي وقاص وعبد الله بن عمرو ومحمد بن مسلمة وغيرهم . وصوب ذلك علي بن أبي طالب لهم ، واعتذر إليه كل واحد منهم بعذر قبله منه . ويروى أن معاوية - رضي الله عنه - لما أفضى إليه الأمر ، عاتب سعدا على ما فعل ، وقال له : لم تكن ممن أصلح بين الفئتين حين اقتتلا ، ولا ممن قاتل الفئة الباغية . فقال له سعد : ندمت على تركي قتال الفئة الباغية . فتبين أنه ليس على الكل درك فيما فعل ، وإنما كان تصرفا بحكم الاجتهاد وإعمالا بمقتضى الشرع . والله أعلم .\nالسادسة : وقوله تعالى : فإن فاءت فأصلحوا بينهما بالعدل ومن العدل في صلحهم ألا يطالبوا بما جرى بينهم من دم ولا مال ، فإنه تلف على تأويل . وفي طلبهم تنفير لهم عن الصلح واستشراء في البغي . وهذا أصل في المصلحة . وقد قال لسان الأمة : إن حكمة الله تعالى في حرب الصحابة التعريف منهم لأحكام قتال أهل التأويل ، إذ كان أحكام قتال أهل الشرك قد عرفت على لسان الرسول - صلى الله عليه وسلم - وفعله .\nالسابعة : إذا خرجت على الإمام العدل خارجة باغية ولا حجة لها ، قاتلهم الإمام بالمسلمين كافة أو من فيه كفاية ، ويدعوهم قبل ذلك إلى الطاعة والدخول في الجماعة ، فإن أبوا من الرجوع والصلح قوتلوا . ولا يقتل أسيرهم ولا يتبع مدبرهم ولا يذفف على جريحهم ، ولا تسبى ذراريهم ولا أموالهم . وإذا قتل العادل الباغي ، أو الباغي العادل وهو وليه لم يتوارثا . ولا يرث قاتل عمدا على حال . وقيل : إن العادل يرث الباغي ، قياسا على القصاص .\nالثامنة : وما استهلكه البغاة والخوارج من دم أو مال ثم تابوا لم يؤاخذوا به . وقال أبو حنيفة : يضمنون . وللشافعي قولان . وجه قول أبي حنيفة أنه إتلاف بعدوان فيلزم الضمان . والمعول في ذلك عندنا أن الصحابة - رضي الله عنهم في حروبهم لم يتبعوا مدبرا ولا ذففوا على جريح ولا قتلوا أسيرا ولا ضمنوا نفسا ولا مالا ، وهم القدوة . وقال ابن عمر : قال النبي - صلى الله عليه وسلم - : ( يا عبد الله أتدري كيف حكم الله فيمن بغى من هذه الأمة ) ؟ قال : الله ورسوله أعلم . فقال : ( لا يجهز على جريحها ولا يقتل أسيرها ولا يطلب هاربها ولا يقسم فيؤها ) . فأما ما كان قائما رد بعينه . هذا كله فيمن خرج بتأويل يسوغ له . وذكر الزمخشري في تفسيره : إن كانت الباغية من قلة العدد بحيث لا منعة لها ضمنت بعد الفيئة ما جنت ، وإن كانت كثيرة ذات منعة وشوكة لم تضمن ، إلا عند محمد بن الحسن رحمه الله فإنه كان يفتي بأن الضمان يلزمها إذا فاءت . وأما قبل التجمع والتجند أو حين تتفرق عند وضع الحرب أوزارها ، فما جنته ضمنته عند الجميع . فحمل الإصلاح بالعدل في قوله : فأصلحوا بينهما بالعدل على مذهب محمد واضح منطبق على لفظ التنزيل . وعلى قول غيره وجهه أن يحمل على كون الفئة الباغية قليلة العدد . والذي ذكروا أن الغرض إماتة الضغائن وسل الأحقاد دون ضمان الجنايات ليس بحسن الطباق المأمور به من أعمال العدل ومراعاة القسط . قال الزمخشري : فإن قلت : لم قرن بالإصلاح الثاني العدل دون الأول ؟ قلت : لأن المراد بالاقتتال في أول الآية أن يقتتلا باغيتين أو راكبتي شبهة ، وأيتهما كانت فالذي يجب على المسلمين أن يأخذوا به في شأنهما إصلاح ذات البين وتسكين الدهماء بإراءة الحق والمواعظ الشافية ونفي الشبهة ، إلا إذا أصرتا فحينئذ تجب المقاتلة ، وأما الضمان فلا يتجه . وليس كذلك إذا بغت إحداهما ، فإن الضمان متجه على الوجهين المذكورين .\nالتاسعة : ولو تغلبوا على بلد فأخذوا الصدقات وأقاموا الحدود وحكموا فيهم بالأحكام ، لم تثن عليهم الصدقات ولا الحدود ، ولا ينقض من أحكامهم إلا ما كان خلافا للكتاب أو السنة أو الإجماع ، كما تنقض أحكام أهل العدل والسنة ، قاله مطرف وابن الماجشون . وقال ابن القاسم : لا تجوز بحال . وروي عن أصبغ أنه جائز . وروي عنه أيضا أنه لا يجوز كقول ابن القاسم . وبه قال أبو حنيفة ; لأنه عمل بغير حق ممن لا تجوز توليته . فلم يجز كما لو لم يكونوا بغاة . والعمدة لنا ما قدمناه من أن الصحابة - رضي الله عنهم ، لما انجلت الفتنة وارتفع الخلاف بالهدنة والصلح ، لم يعرضوا لأحد منهم في حكم . قال ابن العربي : الذي عندي أن ذلك لا يصلح ; لأن الفتنة لما انجلت كان الإمام هو الباغي ، ولم يكن هناك من يعترضه والله أعلم .\nالعاشرة : لا يجوز أن ينسب إلى أحد من الصحابة خطأ مقطوع به ، إذ كانوا كلهم اجتهدوا فيما فعلوه وأرادوا الله عز وجل ، وهم كلهم لنا أئمة ، وقد تعبدنا بالكف عما شجر بينهم ، وألا نذكرهم إلا بأحسن الذكر ، لحرمة الصحبة ولنهي النبي - صلى الله عليه وسلم - عن سبهم ، وأن الله غفر لهم ، وأخبر بالرضا عنهم . هذا مع ما قد ورد من الأخبار من طرق مختلفة عن النبي - صلى الله عليه وسلم - أن طلحة شهيد يمشي على وجه الأرض ، فلو كان ما خرج إليه من الحرب عصيانا لم يكن بالقتل فيه شهيدا . وكذلك لو كان ما خرج إليه خطأ في التأويل وتقصيرا في الواجب عليه ; لأن الشهادة لا تكون إلا بقتل في طاعة ، فوجب حمل أمرهم على ما بيناه . ومما يدل على ذلك ما قد صح وانتشر من أخبار علي بأن قاتل الزبير في النار . وقوله : سمعت رسول الله - صلى الله عليه وسلم - يقول : ( بشر قاتل ابن صفية بالنار ) . وإذا كان كذلك فقد ثبت أن طلحة والزبير غير عاصيين ولا آثمين بالقتال ; لأن ذلك لو كان كذلك لم يقل النبي - صلى الله عليه وسلم - في طلحة : ( شهيد ) . ولم يخبر أن قاتل الزبير في النار . وكذلك من قعد غير مخطئ في التأويل . بل صواب أراه الله الاجتهاد . وإذا كان كذلك لم يوجب ذلك لعنهم ، والبراءة منهم وتفسيقهم ، وإبطال فضائلهم وجهادهم ، وعظيم غنائهم في الدين - رضي الله عنهم . وقد سئل بعضهم عن الدماء التي أريقت فيما بينهم فقال : تلك أمة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسألون عما كانوا يعملون .\nسئل بعضهم عنها أيضا فقال : تلك دماء طهر الله منها يدي ، فلا أخضب بها لساني . يعني في التحرز من الوقوع في خطأ ، والحكم على بعضهم بما لا يكون مصيبا فيه . قال ابن فورك : ومن أصحابنا من قال : إن سبيل ما جرت بين الصحابة من المنازعات كسبيل ما جرى بين إخوة يوسف مع يوسف ، ثم إنهم لم يخرجوا بذلك عن حد الولاية والنبوة ، فكذلك الأمر فيما جرى بين الصحابة . وقال المحاسبي : فأما الدماء فقد أشكل علينا القول فيها باختلافهم . وقد سئل الحسن البصري عن قتالهم فقال : قتال شهده أصحاب محمد - صلى الله عليه وسلم - وغبنا ، وعلموا وجهلنا ، واجتمعوا فاتبعنا ، واختلفوا فوقفنا . قال المحاسبي : فنحن نقول كما قال الحسن ، ونعلم أن القوم كانوا أعلم بما دخلوا فيه منا ، ونتبع ما اجتمعوا عليه ، ونقف عند ما اختلفوا فيه ولا نبتدع رأيا منا ، ونعلم أنهم اجتهدوا وأرادوا الله عز وجل ، إذ كانوا غير متهمين في الدين ، ونسأل الله التوفيق .\n                                    ",
      "saadi": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٩\n                                        \n                                        \n                                        \n                                        هذا متضمن لنهي المؤمنين، [عن] أن يبغي بعضهم على بعض، ويقاتل بعضهم بعضًا، وأنه إذا اقتتلت طائفتان من المؤمنين، فإن على غيرهم من المؤمنين أن يتلافوا هذا الشر الكبير، بالإصلاح بينهم، والتوسط بذلك على أكمل وجه يقع به الصلح، ويسلكوا الطريق الموصلة إلى ذلك، فإن صلحتا، فبها ونعمت، وإن { بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَى فَقَاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِيءَ إِلَى أَمْرِ اللَّهِ } أي: ترجع إلى ما حد الله ورسوله، من فعل الخير وترك الشر، الذي من أعظمه، الاقتتال، [وقوله] { فَإِنْ فَاءَتْ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ } هذا أمر بالصلح، وبالعدل في الصلح، فإن الصلح، قد يوجد، ولكن لا يكون بالعدل، بل بالظلم والحيف على أحد الخصمين، فهذا ليس هو الصلح المأمور به، فيجب أن لا يراعى أحدهما، لقرابة، أو وطن، أو غير ذلك من المقاصد والأغراض، التي توجب العدول عن العدل، { إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ } أي: العادلين في حكمهم بين الناس وفي جميع الولايات، التي تولوها، حتى إنه، قد يدخل في ذلك عدل الرجل في أهله، وعياله، في أدائه حقوقهم، وفي الحديث الصحيح: \"المقسطون عند الله، على منابر من نور الذين يعدلون في حكمهم وأهليهم، وما ولوا\"\n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Al-Hujurat.html",
    "contnent": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ ٠١",
    "tafsier": {
      "ibnkther": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ ٠١\n                                    \n                                    \n                                    وقوله : ( إنما المؤمنون إخوة ) أي : الجميع إخوة في الدين ، كما قال رسول الله - صلى الله عليه وسلم - : \" المسلم أخو المسلم لا يظلمه ولا يسلمه \" . وفي الصحيح : \" والله في عون العبد ما كان العبد في عون أخيه \" . وفي الصحيح أيضا : \" إذا دعا المسلم لأخيه بظهر الغيب قال الملك : آمين ، ولك بمثله \" . والأحاديث في هذا كثيرة ، وفي الصحيح : \" مثل المؤمنين في توادهم وتراحمهم وتواصلهم كمثل الجسد الواحد ، إذا اشتكى منه عضو تداعى له سائر الجسد بالحمى والسهر \" . وفي الصحيح أيضا : \" المؤمن للمؤمن كالبنيان يشد بعضه بعضا \" وشبك بين أصابعه .\nوقال أحمد : حدثنا أحمد بن الحجاج ، حدثنا عبد الله ، أخبرنا مصعب بن ثابت ، حدثني أبو حازم قال : سمعت سهل بن سعد الساعدي يحدث عن رسول الله - صلى الله عليه وسلم - قال : \" إن المؤمن من أهل الإيمان بمنزلة الرأس من الجسد ، يألم المؤمن لأهل الإيمان ، كما يألم الجسد لما في الرأس \" . تفرد به ولا بأس بإسناده .\nوقوله : ( فأصلحوا بين أخويكم ) يعني : الفئتين المقتتلتين ، ( واتقوا الله ) أي : في جميع أموركم ( لعلكم ترحمون ) ، وهذا تحقيق منه تعالى للرحمة لمن اتقاه .\n                                    ",
      "qortoby": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ ٠١\n                                    \n                                    \n                                    قوله تعالى : إنما المؤمنون إخوة فأصلحوا بين أخويكم واتقوا الله لعلكم ترحمون .\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : إنما المؤمنون إخوة أي في الدين والحرمة لا في النسب ، ولهذا قيل : أخوة الدين أثبت من أخوة النسب ، فإن أخوة النسب تنقطع بمخالفة الدين ، وأخوة الدين لا تنقطع بمخالفة النسب . وفي الصحيحين عن أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : لا تحاسدوا ولا تباغضوا ولا تجسسوا ولا تحسسوا ولا تناجشوا وكونوا عباد الله إخوانا . وفي رواية : لا تحاسدوا ولا تناجشوا ولا تباغضوا ولا تدابروا ولا يبع بعضكم على بيع بعض وكونوا عباد الله إخوانا ، المسلم أخو المسلم لا يظلمه ولا يخذله ولا يحقره ، التقوى هاهنا - ويشير إلى صدره ثلاث مرات - بحسب امرئ من الشر أن يحقر أخاه المسلم ، كل المسلم على المسلم حرام دمه وماله وعرضه لفظ مسلم . وفي غير الصحيحين عن أبي هريرة قال النبي - صلى الله عليه وسلم - : المسلم أخو المسلم لا يظلمه ولا يعيبه ولا يخذله ولا يتطاول عليه في البنيان فيستر عليه الريح إلا بإذنه ولا يؤذيه بقتار قدره إلا أن يغرف له غرفة ولا يشتري لبنيه الفاكهة فيخرجون بها إلى صبيان جاره ولا يطعمونهم منها . ثم قال النبي - صلى الله عليه وسلم - : ( احفظوا ولا يحفظ منكم إلا قليل ) .\nالثانية : قوله تعالى : فأصلحوا بين أخويكم أي بين كل مسلمين تخاصما . وقيل : بين الأوس والخزرج ، على ما تقدم . وقال أبو علي : أراد بالأخوين الطائفتين ; لأن لفظ التثنية يرد والمراد به الكثرة ، كقوله تعالى : بل يداه مبسوطتان وقال أبو عبيدة : أي : أصلحوا بين كل أخوين ، فهو آت على الجميع . وقرأ ابن سيرين ونصر بن عاصم وأبو العالية والجحدري ويعقوب ( بين إخوتكم ) بالتاء على الجمع . وقرأ الحسن ( إخوانكم ) الباقون : أخويكم بالياء على التثنية .\nالثالثة : في هذه الآية والتي قبلها دليل على أن البغي لا يزيل اسم الإيمان ; لأن الله تعالى سماهم إخوة مؤمنين مع كونهم باغين . قال الحارث الأعور : سئل علي بن أبي طالب - رضي الله عنه - وهو القدوة عن قتال أهل البغي من أهل الجمل وصفين : أمشركون هم ؟ قال : لا ، من الشرك فروا . فقيل : أمنافقون ؟ قال : لا ; لأن المنافقين لا يذكرون الله إلا قليلا . قيل له : فما حالهم ؟ قال إخواننا بغوا علينا .\n                                    ",
      "saadi": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ ٠١\n                                        \n                                        \n                                        \n                                        { إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ } هذا عقد، عقده الله بين المؤمنين، أنه إذا وجد من أي شخص كان، في مشرق الأرض ومغربها، الإيمان بالله، وملائكته، وكتبه، ورسله، واليوم الآخر، فإنه أخ للمؤمنين، أخوة توجب أن يحب له المؤمنون، ما يحبون لأنفسهم، ويكرهون له، ما يكرهون لأنفسهم، ولهذا قال النبي صلى الله عليه وسلم آمرًا بحقوق الأخوة الإيمانية: \"لا تحاسدوا، ولا تناجشوا، ولا تباغضوا، ولا يبع أحدكم على بيع بعض، وكونوا عباد الله إخوانًا المؤمن أخو المؤمن، لا يظلمه، ولا يخذله، ولا يحقره\"\nوقال صلى الله عليه وسلم \"المؤمن للمؤمن، كالبنيان يشد بعضه بعضًا\" وشبك صلى الله عليه وسلم بين أصابعه.\nولقد أمر الله ورسوله، بالقيام بحقوق المؤمنين، بعضهم لبعض، وبما به يحصل التآلف والتوادد، والتواصل بينهم، كل هذا، تأييد لحقوق بعضهم على بعض، فمن ذلك، إذا وقع الاقتتال بينهم، الموجب لتفرق القلوب وتباغضها [وتدابرها]، فليصلح المؤمنون بين إخوانهم، وليسعوا فيما به يزول شنآنهم.\nثم أمر بالتقوى عمومًا، ورتب على القيام بحقوق المؤمنين وبتقوى الله، الرحمة [ فقال: { لَعَلَّكُمْ تُرْحَمُونَ } وإذا حصلت الرحمة، حصل خير الدنيا والآخرة، ودل ذلك، على أن عدم القيام بحقوق المؤمنين، من أعظم حواجب الرحمة.\nوفي هاتين الآيتين من الفوائد، غير ما تقدم: أن الاقتتال بين المؤمنين مناف للأخوة الإيمانية، ولهذا، كان من أكبر الكبائر، وأن الإيمان، والأخوة الإيمانية، لا تزول مع وجود القتال كغيره من الذنوب الكبار، التي دون الشرك، وعلى ذلك مذهب أهل السنة والجماعة، وعلى وجوب الإصلاح، بين المؤمنين بالعدل، وعلى وجوب قتال البغاة، حتى يرجعوا إلى أمر الله، وعلى أنهم لو رجعوا، لغير أمر الله، بأن رجعوا على وجه لا يجوز الإقرار عليه والتزامه، أنه لا يجوز ذلك، وأن أموالهم معصومة، لأن الله أباح دماءهم وقت استمرارهم على بغيهم خاصة، دون أموالهم.\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Al-Hujurat.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ١١",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ١١\n                                    \n                                    \n                                    ينهى تعالى عن السخرية بالناس ، وهو احتقارهم والاستهزاء بهم ، كما ثبت في الصحيح عن رسول الله - صلى الله عليه وسلم - أنه قال : \" الكبر بطر الحق وغمص الناس \" ويروى : \" وغمط الناس \" والمراد من ذلك : احتقارهم واستصغارهم ، وهذا حرام ، فإنه قد يكون المحتقر أعظم قدرا عند الله وأحب إليه من الساخر منه المحتقر له ; ولهذا قال : ( يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن ) ، فنص على نهي الرجال وعطف بنهي النساء .\nوقوله : ( ولا تلمزوا أنفسكم ) أي : لا تلمزوا الناس . والهماز اللماز من الرجال مذموم ملعون ، كما قال [ تعالى ] : ( ويل لكل همزة لمزة ) [ الهمزة : 1 ] ، فالهمز بالفعل واللمز بالقول ، كما قال : ( هماز مشاء بنميم ) [ القلم : 11 ] أي : يحتقر الناس ويهمزهم طاعنا عليهم ، ويمشي بينهم بالنميمة وهي : اللمز بالمقال ; ولهذا قال هاهنا : ( ولا تلمزوا أنفسكم ) ، كما قال : ( ولا تقتلوا أنفسكم ) [ النساء : 29 ] أي : لا يقتل بعضكم بعضا .\nقال ابن عباس ، ومجاهد ، وسعيد بن جبير ، وقتادة ، ومقاتل بن حيان : ( ولا تلمزوا أنفسكم ) أي : لا يطعن بعضكم على بعض .\nوقوله : ( ولا تنابزوا بالألقاب ) أي : لا تتداعوا بالألقاب ، وهي التي يسوء الشخص سماعها .\nقال الإمام أحمد : حدثنا إسماعيل ، حدثنا داود بن أبي هند ، عن الشعبي قال : حدثني أبو جبيرة بن الضحاك قال : فينا نزلت في بني سلمة : ( ولا تنابزوا بالألقاب ) قال : قدم رسول الله - صلى الله عليه وسلم - المدينة وليس فينا رجل إلا وله اسمان أو ثلاثة ، فكان إذا دعي أحد منهم باسم من تلك الأسماء قالوا : يا رسول الله ، إنه يغضب من هذا . فنزلت : ( ولا تنابزوا بالألقاب )\nورواه أبو داود عن موسى بن إسماعيل ، عن وهيب ، عن داود ، به .\nوقوله : ( بئس الاسم الفسوق بعد الإيمان ) أي : بئس الصفة والاسم الفسوق وهو : التنابز بالألقاب ، كما كان أهل الجاهلية يتناعتون ، بعدما دخلتم في الإسلام وعقلتموه ، ( ومن لم يتب ) أي : من هذا ( فأولئك هم الظالمون )\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن ولا تلمزوا أنفسكم ولا تنابزوا بالألقاب بئس الاسم الفسوق بعد الإيمان ومن لم يتب فأولئك هم الظالمون .\nقوله تعالى : يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن فيه أربع مسائل : الأولى : قوله تعالى : يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم قيل عند الله . وقيل : خيرا منهم أي : معتقدا وأسلم باطنا . والسخرية : الاستهزاء . سخرت منه أسخر سخرا ( بالتحريك ) ومسخرا وسخرا ( بالضم ) . وحكى أبو زيد سخرت به ، وهو أردأ اللغتين . وقال الأخفش : سخرت منه وسخرت به ، وضحكت منه وضحكت به ، وهزئت منه وهزئت به ، كل يقال . والاسم السخرية والسخري ، وقرئ بهما قوله تعالى : ليتخذ بعضهم بعضا سخريا وقد تقدم . وفلان سخرة ، يتسخر في العمل . يقال : خادم سخرة . ورجل سخرة أيضا يسخر منه . وسخرة ( بفتح الخاء ) يسخر من الناس .\nالثانية : واختلف في سبب نزولها ، فقال ابن عباس : نزلت في ثابت بن قيس بن شماس كان في أذنه وقر ، فإذا سبقوه إلى مجلس النبي - صلى الله عليه وسلم - أوسعوا له إذا أتى حتى يجلس إلى جنبه ليسمع ما يقول ، فأقبل ذات يوم وقد فاتته من صلاة الفجر ركعة مع النبي - صلى الله عليه وسلم - ، فلما انصرف النبي - صلى الله عليه وسلم - أخذ أصحابه مجالسهم منه ، فربض كل رجل منهم بمجلسه ، وعضوا فيه فلا يكاد يوسع أحد لأحد حتى يظل الرجل لا يجد مجلسا فيظل قائما ، فلما انصرف ثابت من الصلاة تخطى رقاب الناس ويقول : تفسحوا تفسحوا ، ففسحوا له حتى انتهى إلى النبي - صلى الله عليه وسلم - وبينه وبينه رجل فقال له : تفسح . فقال له الرجل : قد وجدت مجلسا فاجلس! فجلس ثابت من خلفه مغضبا ، ثم قال : من هذا ؟ قالوا فلان ، فقال ثابت : ابن فلانة! يعيره بها ، يعني أما له في الجاهلية ، فاستحيا الرجل ، فنزلت . وقال الضحاك : نزلت في وفد بني تميم الذي تقدم ذكرهم في أول ( السورة ) استهزءوا بفقراء الصحابة ، مثل عمار وخباب وابن فهيرة وبلال وصهيب وسلمان وسالم مولى أبي حذيفة وغيرهم ، لما رأوا من رثاثة حالهم ، فنزلت في الذين آمنوا منهم . وقال مجاهد : هو سخرية الغني من الفقير . وقال ابن زيد : لا يسخر من ستر الله عليه ذنوبه ممن كشفه الله ، فلعل إظهار ذنوبه في الدنيا خير له في الآخرة . وقيل : نزلت في عكرمة بن أبي جهل حين قدم المدينة مسلما ، وكان المسلمون إذا رأوه قالوا ابن فرعون هذه الأمة . فشكا ذلك إلى رسول الله - صلى الله عليه وسلم - فنزلت .\nوبالجملة فينبغي ألا يجترئ أحد على الاستهزاء بمن يقتحمه بعينه إذا رآه رث الحال أو ذا عاهة في بدنه أو غير لبيق في محادثته ، فلعله أخلص ضميرا وأنقى قلبا ممن هو على ضد صفته ، فيظلم نفسه بتحقير من وقره الله ، والاستهزاء بمن عظمه الله . ولقد بلغ بالسلف إفراط توقيهم وتصونهم من ذلك أن قال عمرو بن شرحبيل : لو رأيت رجلا يرضع عنزا فضحكت منه لخشيت أن أصنع مثل الذي صنع . وعن عبد الله بن مسعود : البلاء موكل بالقول ، لو سخرت من كلب لخشيت أن أحول كلبا . وقوم في اللغة للمذكرين خاصة . قال زهير :\nوما أدري وسوف إخال أدري أقوم آل حصن أم نساء\nوسموا قوما لأنهم يقومون مع داعيهم في الشدائد . وقيل : إنه جمع قائم ، ثم استعمل في كل جماعة وإن لم يكونوا قائمين . وقد يدخل في القوم النساء مجازا ، وقد مضى في ( البقرة ) بيانه .\nالثالثة : قوله تعالى : ولا نساء من نساء عسى أن يكن خيرا أفرد النساء بالذكر لأن السخرية منهن أكثر . وقد قال الله تعالى : إنا أرسلنا نوحا إلى قومه فشمل الجميع .\nقال المفسرون : نزلت في امرأتين من أزواج النبي - صلى الله عليه وسلم - سخرتا من أم سلمة ، وذلك أنها ربطت خصريها بسبيبة - وهو ثوب أبيض ، ومثلها السب - وسدلت طرفيها خلفها فكانت تجرها ، فقالت عائشة لحفصة - رضي الله عنهما : انظري! ما تجر خلفها كأنه لسان كلب ، فهذه كانت سخريتهما . وقال أنس وابن زيد : نزلت في نساء النبي - صلى الله عليه وسلم - ، عيرن أم سلمة بالقصر . وقيل : نزلت في عائشة ، أشارت بيدها إلى أم سلمة ، يا نبي الله إنها لقصيرة . وقال عكرمة عن ابن عباس : إن صفية بنت حيي بن أخطب أتت رسول الله - صلى الله عليه وسلم - فقالت : يا رسول الله ، إن النساء يعيرنني ، ويقلن لي يا يهودية بنت يهوديين! فقال رسول الله - صلى الله عليه وسلم - : هلا قلت إن أبي هارون وإن عمي موسى وإن زوجي محمد . فأنزل الله هذه الآية .\nالرابعة : في صحيح الترمذي عن عائشة قالت : حكيت للنبي - صلى الله عليه وسلم - رجلا ، فقال : ما يسرني أني حكيت رجلا وأن لي كذا وكذا . قالت فقلت : يا رسول الله ، إن صفية امرأة - وقالت بيدها - هكذا ، يعني أنها قصيرة . فقال : ( لقد مزجت بكلمة لو مزج بها البحر لمزج ) . وفي البخاري عن عبد الله بن زمعة قال : نهى النبي - صلى الله عليه وسلم - أن يضحك الرجل مما يخرج من الأنفس . وقال : لم يضرب أحدكم امرأته ضرب الفحل ثم لعله يعانقها . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : إن الله لا ينظر إلى صوركم وأموالكم ولكن ينظر إلى قلوبكم وأعمالكم . وهذا حديث عظيم يترتب عليه ألا يقطع بعيب أحد لما يرى عليه من صور أعمال الطاعة أو المخالفة ، فلعل من يحافظ على الأعمال الظاهرة يعلم الله من قلبه وصفا مذموما لا تصح معه تلك الأعمال . ولعل من رأينا عليه تفريطا أو معصية يعلم الله من قلبه وصفا محمودا يغفر له بسببه . فالأعمال أمارات ظنية لا أدلة قطعية . ويترتب عليها عدم الغلو في تعظيم من رأينا عليه أفعالا صالحة ، وعدم الاحتقار لمسلم رأينا عليه أفعالا سيئة . بل تحتقر وتذم تلك الحالة السيئة ، لا تلك الذات المسيئة . فتدبر هذا ، فإنه نظر دقيق ، وبالله التوفيق .\nقوله تعالى : ولا تلمزوا أنفسكم فيه ثلاث مسائل : الأولى : قوله تعالى : ولا تلمزوا أنفسكم اللمز : العيب ، وقد مضى في ( براءة ) عند قوله تعالى : ومنهم من يلمزك في الصدقات وقال الطبري : اللمز باليد والعين واللسان والإشارة . والهمز لا يكون إلا باللسان . وهذه الآية مثل قوله تعالى : ولا تقتلوا أنفسكم أي : لا يقتل بعضكم بعضا ; لأن المؤمنين كنفس واحدة ، فكأنه بقتل أخيه قاتل نفسه . وكقوله تعالى : فسلموا على أنفسكم يعني يسلم بعضكم على بعض . والمعنى : لا يعب بعضكم بعضا . وقال ابن عباس ومجاهد وقتادة وسعيد بن جبير : لا يطعن بعضكم على بعض . وقال الضحاك : لا يلعن بعضكم بعضا . وقرئ : ( ولا تلمزوا ) بالضم . وفي قوله : أنفسكم تنبيه على أن العاقل لا يعيب نفسه ، فلا ينبغي أن يعيب غيره لأنه كنفسه ، قال - صلى الله عليه وسلم - : ( المؤمنون كجسد واحد إن اشتكى عضو منه تداعى له سائر الجسد بالسهر والحمى ) . وقال بكر بن عبد الله المزني : إذا أردت أن تنظر العيوب جمة فتأمل عيابا ، فإنه إنما يعيب الناس بفضل ما فيه من العيب . وقال - صلى الله عليه وسلم - : يبصر أحدكم القذاة في عين أخيه ويدع الجذع في عينه وقيل : من سعادة المرء أن يشتغل بعيوب نفسه عن عيوب غيره . قال الشاعر :\nالمرء إن كان عاقلا ورعا أشغله عن عيوبه ورعه كما السقيم المريض يشغله\nعن وجع الناس كلهم وجعه\nوقال آخر :\nلا تكشفن مساوي الناس ما ستروا فيهتك الله سترا عن مساويكا\nواذكر محاسن ما فيهم إذا ذكروا ولا تعب أحدا منهم بما فيكا\nالثانية : قوله تعالى : ولا تنابزوا بالألقاب النبز ( بالتحريك ) اللقب ، والجمع : الأنباز . والنبز ( بالتسكين ) المصدر ، تقول : نبزه ينبزه نبزا ، أي : لقبه . وفلان ينبز بالصبيان أي : يلقبهم ، شدد للكثرة . ويقال النبز والنزب لقب السوء . وتنابزوا بالألقاب : أي : لقب بعضهم بعضا . وفي الترمذي عن أبي جبيرة بن الضحاك قال : كان الرجل منا يكون له الاسمان والثلاثة فيدعى ببعضها فعسى أن يكره ، فنزلت هذه الآية : ولا تنابزوا بالألقاب قال هذا حديث حسن . وأبو جبيرة هذا هو أخو ثابت بن الضحاك بن خليفة الأنصاري . وأبو زيد سعيد بن الربيع صاحب الهروي ثقة . وفي مصنف أبي داود عنه قال : فينا نزلت هذه الآية ، في بني سلمة ولا تنابزوا بالألقاب بئس الاسم الفسوق بعد الإيمان قال : قدم رسول الله - صلى الله عليه وسلم - وليس منا رجل إلا وله اسمان أو ثلاثة ، فجعل رسول الله - صلى الله عليه وسلم - يقول يا فلان فيقولون مه يا رسول الله ، إنه يغضب من هذا الاسم ، فنزلت هذه الآية : ولا تنابزوا بالألقاب فهذا قول .\nوقول ثان - قال الحسن ومجاهد : كان الرجل يعير بعد إسلامه بكفره يا يهودي يا نصراني ، فنزلت . وروي عن قتادة وأبي العالية وعكرمة . وقال قتادة : هو قول الرجل للرجل يا فاسق يا منافق ، وقاله مجاهد والحسن أيضا .\nوقد روي أن أبا ذر - رضي الله عنه - كان عند النبي - صلى الله عليه وسلم - فنازعه رجل فقال له أبو ذر : يا ابن اليهودية! فقال النبي - صلى الله عليه وسلم - : ( ما ترى هاهنا أحمر وأسود ما أنت بأفضل منه ) يعني بالتقوى ، ونزلت : ولا تنابزوا بالألقاب وقال ابن عباس : التنابز بالألقاب أن يكون الرجل قد عمل السيئات ثم تاب ، فنهى الله أن يعير بما سلف . يدل عليه ما روي أن النبي - صلى الله عليه وسلم - قال : من عير مؤمنا بذنب تاب منه كان حقا على الله أن يبتليه به ويفضحه فيه في الدنيا والآخرة .\nالثالثة : وقع من ذلك مستثنى من غلب عليه الاستعمال كالأعرج والأحدب ولم يكن له فيه كسب يجد في نفسه منه عليه ، فجوزته الأمة واتفق على قوله أهل الملة . قال ابن العربي : وقد ورد لعمر الله من ذلك في كتبهم ما لا أرضاه في صالح حزرة ; لأنه صحف ( خرزة ) فلقب بها . وكذلك قولهم في محمد بن سليمان الحضرمي : مطين ; لأنه وقع في طين ونحو ذلك مما غلب على المتأخرين ، ولا أراه سائغا في الدين . وقد كان موسى بن علي بن رباح المصري يقول : لا أجعل أحدا صغر اسم أبي في حل ، وكان الغالب على اسمه التصغير بضم العين . والذي يضبط هذا كله : أن كل ما يكره الإنسان إذا نودي به فلا يجوز لأجل الأذية . والله أعلم .\nقلت : وعلى هذا المعنى ترجم البخاري رحمه الله في ( كتاب الأدب ) من الجامع الصحيح . في ( باب ما يجوز من ذكر الناس نحو قولهم الطويل والقصير لا يراد به شين الرجل ) قال : وقال النبي - صلى الله عليه وسلم - : ( ما يقول ذو اليدين ) قال أبو عبد الله بن خويز منداد : تضمنت الآية المنع من تلقيب الإنسان بما يكره ، ويجوز تلقيبه بما يحب ، ألا ترى أن النبي - صلى الله عليه وسلم - لقب عمر بالفاروق ، وأبا بكر بالصديق ، وعثمان بذي النورين ، وخزيمة بذي الشهادتين ، وأبا هريرة بذي الشمالين وبذي اليدين ، في أشباه ذلك . الزمخشري : روي عن النبي - صلى الله عليه وسلم - ( من حق المؤمن على المؤمن أن يسميه بأحب أسمائه إليه ) . ولهذا كانت التكنية من السنة والأدب الحسن ، قال عمر - رضي الله عنه - : أشيعوا الكنى فإنها منبهة . ولقد لقب أبو بكر بالعتيق والصديق ، وعمر بالفاروق ، وحمزة بأسد الله ، وخالد بسيف الله . وقل من المشاهير في الجاهلية والإسلام من ليس له لقب . ولم تزل هذه الألقاب الحسنة في الأمم كلها - من العرب والعجم - تجري في مخاطباتهم ومكاتباتهم من غير نكير . قال الماوردي : فأما مستحب الألقاب ومستحسنها فلا يكره . وقد وصف رسول الله - صلى الله عليه وسلم - عددا من أصحابه بأوصاف صارت لهم من أجل الألقاب .\nقلت : فأما ما يكون ظاهرها الكراهة إذا أريد بها الصفة لا العيب فذلك كثير . وقد سئل عبد الله بن المبارك عن الرجل يقول : حميد الطويل ، وسليمان الأعمش ، وحميد الأعرج ، ومروان الأصغر ، فقال : إذا أردت صفته ولم ترد عيبه فلا بأس به . وفي صحيح مسلم عن عبد الله بن سرجس قال : رأيت الأصلع - يعني عمر - يقبل الحجر . في رواية الأصيلع .\nقوله تعالى : ومن لم يتب أي عن هذه الألقاب التي يتأذى بها السامعون . فأولئك هم الظالمون لأنفسهم بارتكاب هذه المناهي .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ١١\n                                        \n                                        \n                                        \n                                        وهذا أيضًا، من حقوق المؤمنين، بعضهم على بعض، أن { لَا يَسْخَرْ قَومٌ مِنْ قَوْمٍ } بكل كلام، وقول، وفعل دال على تحقير الأخ المسلم، فإن ذلك حرام، لا يجوز، وهو دال على إعجاب الساخر بنفسه، وعسى أن يكون المسخور به خيرًا من الساخر، كما هو الغالب والواقع، فإن السخرية، لا تقع إلا من قلب ممتلئ من مساوئ الأخلاق، متحل بكل خلق ذميم، ولهذا قال النبي صلى الله عليه وسلم \"بحسب امرئ من الشر، أن يحقر أخاه المسلم\"\nثم قال: { وَلَا تَلْمِزُوا أَنْفُسَكُمْ } أي: لا يعب بعضكم على بعض، واللمز: بالقول، والهمز: بالفعل، وكلاهما منهي عنه حرام، متوعد عليه بالنار.\nكما قال تعالى: { وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ } الآية، وسمي الأخ المؤمن نفسًا لأخيه، لأن المؤمنين ينبغي أن يكون هكذا حالهم كالجسد الواحد، ولأنه إذا همز غيره، أوجب للغير أن يهمزه، فيكون هو المتسبب لذلك.\n{ وَلَا تَنَابَزُوا بِالْأَلْقَابِ } أي: لا يعير أحدكم أخاه، ويلقبه بلقب ذم يكره أن يطلق عليه وهذا هو التنابز، وأما الألقاب غير المذمومة، فلا تدخل في هذا.\n{ بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمَانِ } أي: بئسما تبدلتم عن الإيمان والعمل بشرائعه، وما تقتضيه، بالإعراض عن أوامره ونواهيه، باسم الفسوق والعصيان، الذي هو التنابز بالألقاب.\n{ وَمَنْ لَمْ يَتُبْ فَأُولَئِكَ هُمُ الظَّالِمُونَ } فهذا [هو] الواجب على العبد، أن يتوب إلى الله تعالى، ويخرج من حق أخيه المسلم، باستحلاله، والاستغفار، والمدح له مقابلة [على] ذمه.\n{ وَمَنْ لَمْ يَتُبْ فَأُولَئِكَ هُمُ الظَّالِمُونَ } فالناس قسمان: ظالم لنفسه غير تائب، وتائب مفلح، ولا ثم قسم ثالث غيرهما.\n                                    "
    }
  },
  {
    "id": 11,
    "versesNumber": 12,
    "souraName": "Al-Hujurat.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَ لَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ ٢١",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَ لَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ ٢١\n                                    \n                                    \n                                    يقول تعالى ناهيا عباده المؤمنين عن كثير من الظن ، وهو التهمة والتخون للأهل والأقارب والناس في غير محله ; لأن بعض ذلك يكون إثما محضا ، فليجتنب كثير منه احتياطا ، وروينا عن أمير المؤمنين عمر بن الخطاب - رضي الله عنه - أنه قال : ولا تظنن بكلمة خرجت من أخيك المسلم إلا خيرا ، وأنت تجد لها في الخير محملا .\nوقال أبو عبد الله بن ماجه : حدثنا أبو القاسم بن أبي ضمرة نصر بن محمد بن سليمان الحمصي ، حدثنا أبي ، حدثنا عبد الله بن أبي قيس النضري ، حدثنا عبد الله بن عمر قال : رأيت النبي - صلى الله عليه وسلم - يطوف بالكعبة ويقول : \" ما أطيبك وأطيب ريحك ، ما أعظمك وأعظم حرمتك . والذي نفس محمد بيده ، لحرمة المؤمن أعظم عند الله حرمة منك ، ماله ودمه ، وأن يظن به إلا خير . تفرد به ابن ماجه من هذا الوجه .\nوقال مالك ، عن أبي الزناد ، عن الأعرج ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" إياكم والظن فإن الظن أكذب الحديث ، ولا تجسسوا ولا تحسسوا ، ولا تنافسوا ، ولا تحاسدوا ، ولا تباغضوا ، ولا تدابروا ، وكونوا عباد الله إخوانا \" .\nرواه البخاري عن عبد الله بن يوسف ، ومسلم عن يحيى بن يحيى ، وأبو داود عن العتبي [ ثلاثتهم ] ، عن مالك ، به .\nوقال سفيان بن عيينة ، عن الزهري ، عن أنس [ رضي الله عنه ] قال : قال رسول الله - صلى الله عليه وسلم - : \" لا تقاطعوا ، ولا تدابروا ، ولا تباغضوا ، ولا تحاسدوا ، وكونوا عباد الله إخوانا ، ولا يحل للمسلم أن يهجر أخاه فوق ثلاثة أيام \" .\nرواه مسلم والترمذي - وصححه - من حديث سفيان بن عيينة ، به .\nوقال الطبراني : حدثنا محمد بن عبد الله القرمطي العدوي ، حدثنا بكر بن عبد الوهاب المدني ، حدثنا إسماعيل بن قيس الأنصاري ، حدثني عبد الرحمن بن محمد بن أبي الرجال ، عن أبيه ، عن جده حارثة بن النعمان قال : قال رسول الله - صلى الله عليه وسلم - : \" ثلاث زمات لأمتي : الطيرة ، والحسد وسوء الظن \" . فقال رجل : ما يذهبهن يا رسول الله ممن هن فيه ؟ قال : \" إذا حسدت فاستغفر الله ، وإذا ظننت فلا تحقق ، وإذا تطيرت فأمض \" . وقال أبو داود : حدثنا أبو بكر بن أبي شيبة ، حدثنا أبو معاوية ، عن الأعمش ، عن زيد قال : أتي ابن مسعود ، رضي الله عنه برجل ، فقيل له : هذا فلان تقطر لحيته خمرا . فقال عبد الله : إنا قد نهينا عن التجسس ، ولكن إن يظهر لنا شيء نأخذ به .\nسماه ابن أبي حاتم في روايته الوليد بن عقبة بن أبي معيط .\nوقال الإمام أحمد : حدثنا هاشم ، حدثنا ليث ، عن إبراهيم بن نشيط الخولاني ، عن كعب بن علقمة ، عن أبي الهيثم ، عن دخين كاتب عقبة قال : قلت لعقبة : إن لنا جيرانا يشربون الخمر ، وأنا داع لهم الشرط فيأخذونهم . قال : لا تفعل ، ولكن عظهم وتهددهم . قال : ففعل فلم ينتهوا . قال : فجاءه دخين فقال : إني قد نهيتهم فلم ينتهوا ، وإني داع لهم الشرط فيأخذونهم . قال : لا تفعل ، ولكن عظهم وتهددهم . قال : ففعل فلم ينتهوا . قال : فجاءه دخين فقال : إني قد نهيتهم فلم ينتهوا ، وإني داع لهم الشرط فتأخذهم . فقال له عقبة : ويحك لا تفعل ، فإني سمعت رسول الله - صلى الله عليه وسلم - يقول : \" من ستر عورة مؤمن فكأنما استحيا موءودة من قبرها \" .\nورواه أبو داود والنسائي من حديث الليث بن سعد ، به نحوه .\nوقال سفيان الثوري ، عن ثور ، عن راشد بن سعد ، عن معاوية قال : سمعت النبي - صلى الله عليه وسلم - يقول : \" إنك إن اتبعت عورات الناس أفسدتهم \" أو : \" كدت أن تفسدهم \" . فقال أبو الدرداء : كلمة سمعها معاوية من رسول الله - صلى الله عليه وسلم - نفعه الله بها . رواه أبو داود منفردا به من حديث الثوري ، به .\nوقال أبو داود أيضا : حدثنا سعيد بن عمرو الحضرمي ، حدثنا إسماعيل بن عياش ، حدثنا ضمضم بن زرعة ، عن شريح بن عبيد ، عن جبير بن نفير ، وكثير بن مرة ، وعمرو بن الأسود ، والمقدام بن معدي كرب ، وأبي أمامة ، عن النبي - صلى الله عليه وسلم - قال : \" إن الأمير إذا ابتغى الريبة في الناس ، أفسدهم \" .\n[ وقوله ] : ( ولا تجسسوا ) أي : على بعضكم بعضا . والتجسس غالبا يطلق في الشر ، ومنه الجاسوس . وأما التحسس فيكون غالبا في الخير ، كما قال تعالى إخبارا عن يعقوب [ عليه السلام ] أنه قال : ( يا بني اذهبوا فتحسسوا من يوسف وأخيه ولا تيأسوا من روح الله ) [ يوسف : 87 ] ، وقد يستعمل كل منهما في الشر ، كما ثبت في الصحيح أن رسول الله - صلى الله عليه وسلم - قال : \" لا تجسسوا ، ولا تحسسوا ، ولا تباغضوا ، ولا تدابروا ، وكونوا عباد الله إخوانا \" .\nوقال الأوزاعي : التجسس : البحث عن الشيء . والتحسس : الاستماع إلى حديث القوم وهم له كارهون ، أو يتسمع على أبوابهم . والتدابر : الصرم . رواه ابن أبي حاتم .\nوقوله : ( ولا يغتب بعضكم بعضا ) فيه نهي عن الغيبة ، وقد فسرها الشارع كما جاء في الحديث الذي رواه أبو داود : حدثنا القعنبي ، حدثنا عبد العزيز بن محمد ، عن العلاء ، عن أبيه ، عن أبي هريرة قال : قيل : يا رسول الله ، ما الغيبة ؟ قال : \" ذكرك أخاك بما يكره \" . قيل : أفرأيت إن كان في أخي ما أقول ؟ قال : \" إن كان فيه ما تقول فقد اغتبته ، وإن لم يكن فيه ما تقول فقد بهته \" .\nورواه الترمذي عن قتيبة ، عن الدراوردي ، به . وقال : حسن صحيح . ورواه ابن جرير عن بندار ، عن غندر ، عن شعبة ، عن العلاء . وهكذا قال ابن عمر ، ومسروق ، وقتادة ، وأبو إسحاق ، ومعاوية بن قرة .\nوقال أبو داود : حدثنا مسدد ، حدثنا يحيى ، عن سفيان ، حدثني علي بن الأقمر ، عن أبي حذيفة ، عن عائشة قالت : قلت للنبي - صلى الله عليه وسلم - : حسبك من صفية كذا وكذا ! - قال غير مسدد : تعني قصيرة - فقال : \" لقد قلت كلمة لو مزجت بماء البحر لمزجته \" . قالت : وحكيت له إنسانا ، فقال - صلى الله عليه وسلم - : \" ما أحب أني حكيت إنسانا ، وإن لي كذا وكذا \" .\nورواه الترمذي من حديث يحيى القطان ، وعبد الرحمن بن مهدي ، ووكيع ، ثلاثتهم عن سفيان الثوري ، عن علي بن الأقمر ، عن أبي حذيفة سلمة بن صهيبة الأرحبي ، عن عائشة ، به . وقال : حسن صحيح .\nوقال ابن جرير : حدثني ابن أبي الشوارب : حدثنا عبد الواحد بن زياد ، حدثنا سليمان الشيباني ، حدثنا حسان بن المخارق ; أن امرأة دخلت على عائشة ، فلما قامت لتخرج أشارت عائشة بيدها إلى النبي - صلى الله عليه وسلم - أي : إنها قصيرة - فقال النبي - صلى الله عليه وسلم - : \" اغتبتيها \" .\nوالغيبة محرمة بالإجماع ، ولا يستثنى من ذلك إلا ما رجحت مصلحته ، كما في الجرح والتعديل والنصيحة ، كقوله - صلى الله عليه وسلم - لما استأذن عليه ذلك الرجل الفاجر : \" ائذنوا له ، بئس أخو العشيرة \" ، وكقوله لفاطمة بنت قيس - وقد خطبها معاوية وأبو الجهم - : \" أما معاوية فصعلوك ، وأما أبو الجهم فلا يضع عصاه عن عاتقه \" . وكذا ما جرى مجرى ذلك . ثم بقيتها على التحريم الشديد ، وقد ورد فيها الزجر الأكيد ; ولهذا شبهها تعالى بأكل اللحم من الإنسان الميت ، كما قال تعالى : ( أيحب أحدكم أن يأكل لحم أخيه ميتا فكرهتموه ) ؟ أي : كما تكرهون هذا طبعا ، فاكرهوا ذاك شرعا ; فإن عقوبته أشد من هذا وهذا من التنفير عنها والتحذير منها ، كما قال عليه السلام ، في العائد في هبته : \" كالكلب يقيء ثم يرجع في قيئه \" ، وقد قال : \" ليس لنا مثل السوء \" . وثبت في الصحاح والحسان والمسانيد من غير وجه أنه عليه السلام ، قال في خطبة [ حجة ] الوداع : \" إن دماءكم وأموالكم وأعراضكم عليكم حرام كحرمة يومكم هذا ، في شهركم هذا ، في بلدكم هذا \" .\nوقال أبو داود : حدثنا واصل بن عبد الأعلى ، حدثنا أسباط بن محمد ، عن هشام بن سعد ، عن زيد بن أسلم ، عن أبي صالح ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" كل المسلم على المسلم حرام : ماله وعرضه ودمه ، حسب امرئ من الشر أن يحقر أخاه المسلم \" .\nورواه الترمذي عن عبيد بن أسباط بن محمد ، عن أبيه ، به . وقال : حسن غريب .\nوحدثنا عثمان بن أبي شيبة ، حدثنا الأسود بن عامر ، حدثنا أبو بكر بن عياش ، عن الأعمش ، عن سعيد بن عبد الله بن جريج ، عن أبي برزة الأسلمي قال : قال رسول الله - صلى الله عليه وسلم - : \" يا معشر من آمن بلسانه ولم يدخل الإيمان قلبه ، لا تغتابوا المسلمين ، ولا تتبعوا عوراتهم ، فإنه من يتبع عوراتهم يتبع الله عورته ومن يتبع الله عورته يفضحه في بيته \" .\nتفرد به أبو داود . وقد روي من حديث البراء بن عازب ، فقال الحافظ أبو يعلى في مسنده : حدثنا إبراهيم بن دينار ، حدثنا مصعب بن سلام ، عن حمزة بن حبيب الزيات ، عن أبي إسحاق السبيعي ، عن البراء بن عازب قال : خطبنا رسول الله - صلى الله عليه وسلم - حتى أسمع العواتق في بيوتها - أو قال : في خدورها - فقال : \" يا معشر من آمن بلسانه ، لا تغتابوا المسلمين ، ولا تتبعوا عوراتهم ، فإنه من يتبع عورة أخيه يتبع الله عورته ، ومن يتبع الله عورته يفضحه في جوف بيته \" .\nطريق أخرى عن ابن عمر : قال أبو بكر أحمد بن إبراهيم الإسماعيلي : أخبرنا عبد الله بن ناجية ، حدثنا يحيى بن أكثم ، حدثنا الفضل بن موسى الشيباني ، عن الحسين بن واقد ، عن أوفى بن دلهم ، عن نافع ، عن ابن عمر ; أن رسول الله - صلى الله عليه وسلم - قال : \" يا معشر من آمن بلسانه ولم يفض الإيمان إلى قلبه ، لا تغتابوا المسلمين ، ولا تتبعوا عوراتهم ; فإنه من يتبع عورات المسلمين يتبع الله عورته ، ومن يتبع الله عورته يفضحه ولو في جوف رحله \" . قال : ونظر ابن عمر يوما إلى الكعبة فقال : ما أعظمك وأعظم حرمتك ، وللمؤمن أعظم حرمة عند الله منك .\nقال أبو داود : وحدثنا حيوة بن شريح ، حدثنا بقية ، عن ابن ثوبان ، عن أبيه ، عن مكحول ، عن وقاص بن ربيعة ، عن المستورد أنه حدثه أن النبي - صلى الله عليه وسلم - قال : \" من أكل برجل مسلم أكلة فإن الله يطعمه مثلها في جهنم ، ومن كسي ثوبا برجل مسلم فإن الله يكسوه مثله في جهنم . ومن قام برجل مقام سمعة ورياء فإن الله يقوم به مقام سمعة ورياء يوم القيامة \" . تفرد به أبو داود .\nوحدثنا ابن مصفى ، حدثنا بقية وأبو المغيرة قالا حدثنا صفوان ، حدثني راشد بن سعد وعبد الرحمن بن جبير ، عن أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - : \" لما عرج بي مررت بقوم لهم أظفار من نحاس ، يخمشون وجوههم وصدورهم ، قلت : من هؤلاء يا جبرائيل ؟ قال : هؤلاء الذين يأكلون لحوم الناس ، ويقعون في أعراضهم \" .\nتفرد به أبو داود ، وهكذا رواه الإمام أحمد ، عن أبي المغيرة عبد القدوس بن الحجاج الشامي ، به .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا أحمد بن عبدة ، حدثنا أبو عبد الصمد عبد العزيز بن عبد الصمد العمي ، حدثنا أبو هارون العبدي ، عن أبي سعيد الخدري [ رضي الله عنه ] قال : قلنا : يا رسول الله ، حدثنا ما رأيت ليلة أسري بك ؟ . . . قال : \" ثم انطلق بي إلى خلق من خلق الله كثير ، رجال ونساء موكل بهم رجال يعمدون إلى عرض جنب أحدهم فيحذون منه الحذوة من مثل النعل ثم يضعونه في في أحدهم ، فيقال له : \" كل كما أكلت \" ، وهو يجد من أكله الموت - يا محمد - لو يجد الموت وهو يكره عليه فقلت : يا جبرائيل ، من هؤلاء ؟ قال : هؤلاء الهمازون اللمازون أصحاب النميمة . فيقال : ( أيحب أحدكم أن يأكل لحم أخيه ميتا فكرهتموه ) وهو يكره على أكل لحمه .\nهكذا أورد هذا الحديث ، وقد سقناه بطوله في أول تفسير \" سورة سبحان \" ولله الحمد .\nوقال أبو داود الطيالسي في مسنده : حدثنا الربيع ، عن يزيد ، عن أنس ; أن رسول الله - صلى الله عليه وسلم - أمر الناس أن يصوموا يوما ولا يفطرن أحد حتى آذن له . فصام الناس ، فلما أمسوا جعل الرجل يجيء إلى رسول الله - صلى الله عليه وسلم - فيقول : ظللت منذ اليوم صائما ، فائذن لي فأفطر فيأذن له ، ويجيء الرجل فيقول ذلك ، فيأذن له حتى جاء رجل فقال : يا رسول الله ، إن فتاتين من أهلك ظلتا منذ اليوم صائمتين ، فائذن لهما فليفطرا فأعرض عنه ، ثم أعاد ، فقال رسول الله - صلى الله عليه وسلم - : \" ما صامتا ، وكيف صام من ظل يأكل لحوم الناس ؟ اذهب ، فمرهما إن كانتا صائمتين أن يستقيئا \" . ففعلتا ، فقاءت كل واحدة منهما علقة علقة فأتى النبي - صلى الله عليه وسلم - فأخبره ، فقال رسول الله - صلى الله عليه وسلم - : \" لو ماتتا وهما فيهما لأكلتهما النار \" .\nإسناد ضعيف ، ومتن غريب . وقد رواه الحافظ البيهقي من حديث يزيد بن هارون : حدثنا سليمان التيمي قال : سمعت رجلا يحدث في مجلس أبي عثمان النهدي عن عبيد - مولى رسول الله - أن امرأتين صامتا على عهد رسول الله - صلى الله عليه وسلم - وأن رجلا أتى رسول الله فقال : يا رسول الله ، إن هاهنا امرأتين صامتا ، وإنهما كادتا تموتان من العطش - أراه قال : بالهاجرة - فأعرض عنه - أو : سكت عنه - فقال : يا نبي الله ، إنهما - والله قد ماتتا أو كادتا تموتان . فقال : ادعهما . فجاءتا ، قال : فجئ بقدح - أو عس - فقال لإحداهما : \" قيئي \" فقاءت من قيح ودم وصديد حتى قاءت نصف القدح . ثم قال للأخرى : قيئي فقاءت قيحا ودما وصديدا ولحما ودما عبيطا وغيره حتى ملأت القدح . فقال : إن هاتين صامتا عما أحل الله لهما ، وأفطرتا على ما حرم الله عليهما ، جلست إحداهما إلى الأخرى فجعلتا تأكلان لحوم الناس .\nوهكذا قد رواه الإمام أحمد عن يزيد بن هارون وابن أبي عدي ، كلاهما عن سليمان بن طرخان التيمي ، به مثله أو نحوه . ثم رواه أيضا من حديث مسدد ، عن يحيى القطان ، عن عثمان بن غياث ، حدثني رجل أظنه في حلقة أبي عثمان ، عن سعد - مولى رسول الله - صلى الله عليه وسلم - أنهم أمروا بصيام ، فجاء رجل في نصف النهار فقال : يا رسول الله ، فلانة وفلانة قد بلغتا الجهد . فأعرض عنه مرتين أو ثلاثا ، ثم قال : \" ادعهما \" . فجاء بعس - أو : قدح - فقال لإحداهما : \" قيئي \" ، فقاءت لحما ودما عبيطا وقيحا ، وقال للأخرى مثل ذلك ، فقال : \" إن هاتين صامتا عما أحل الله لهما ، وأفطرتا على ما حرم الله عليهما ، أتت إحداهما للأخرى فلم تزالا تأكلان لحوم الناس حتى امتلأت أجوافهما قيحا \" .\nوقال البيهقي : كذا قال \" عن سعد \" ، والأول - وهو عبيد - أصح .\nوقال الحافظ أبو يعلى : حدثنا عمرو بن الضحاك بن مخلد ، حدثنا أبي أبو عاصم ، حدثنا ابن جريج ، أخبرني أبو الزبير عن ابن عم لأبي هريرة أن ماعزا جاء إلى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله ، إني قد زنيت فأعرض عنه - قالها أربعا - فلما كان في الخامسة قال : \" زنيت \" ؟ قال : نعم . قال : \" وتدري ما الزنا ؟ \" قال : نعم ، أتيت منها حراما ما يأتي الرجل من امرأته حلالا . قال : \" ما تريد إلى هذا القول ؟ \" قال : أريد أن تطهرني . قال : فقال رسول الله - صلى الله عليه وسلم - : \" أدخلت ذلك منك في ذلك منها كما يغيب الميل في المكحلة والرشاء في البئر ؟ \" . قال : نعم ، يا رسول الله . قال : فأمر برجمه فرجم ، فسمع النبي - صلى الله عليه وسلم - رجلين يقول أحدهما لصاحبه : ألم تر إلى هذا الذي ستر الله عليه فلم تدعه نفسه حتى رجم رجم الكلب . ثم سار النبي - صلى الله عليه وسلم - حتى مر بجيفة حمار فقال : أين فلان وفلان ؟ انزلا فكلا من جيفة هذا الحمار \" قالا : غفر الله لك يا رسول الله وهل يؤكل هذا ؟ قال : \" فما نلتما من أخيكما آنفا أشد أكلا منه ، والذي نفسي بيده ، إنه الآن لفي أنهار الجنة ينغمس فيها \" ] إسناده صحيح ] .\nوقال الإمام أحمد : حدثنا عبد الصمد ، حدثني أبي ، حدثنا واصل - مولى ابن عيينة - حدثني خالد بن عرفطة ، عن طلحة بن نافع ، عن جابر بن عبد الله قال : كنا مع النبي - صلى الله عليه وسلم - فارتفعت ريح جيفة منتنة ، فقال رسول الله - صلى الله عليه وسلم - : \" أتدرون ما هذه الريح ؟ هذه ريح الذين يغتابون المؤمنين \" .\nطريق أخرى : قال عبد بن حميد في مسنده : حدثنا إبراهيم بن الأشعث ، حدثنا الفضيل بن عياض ، عن سليمان ، عن أبي سفيان - وهو طلحة بن نافع - عن جابر قال : كنا مع النبي - صلى الله عليه وسلم - في سفر فهاجت ريح منتنة ، فقال النبي - صلى الله عليه وسلم - : \" إن نفرا من المنافقين اغتابوا ناسا من المسلمين ، فلذلك بعثت هذه الريح \" وربما قال : \" فلذلك هاجت هذه الريح \" .\nوقال السدي في قوله : ( أيحب أحدكم أن يأكل لحم أخيه ميتا ) : زعم أن سلمان الفارسي كان مع رجلين من أصحاب النبي - صلى الله عليه وسلم - في سفر يخدمهما ويخف لهما ، وينال من طعامهما ، وأن سلمان لما سار الناس ذات يوم وبقي سلمان نائما ، لم يسر معهم ، فجعل صاحباه يكلمانه فلم يجداه ، فضربا الخباء فقالا : ما يريد سلمان - أو : هذا العبد - شيئا غير هذا : أن يجيء إلى طعام مقدور ، وخباء مضروب ! فلما جاء سلمان أرسلاه إلى رسول الله - صلى الله عليه وسلم - يطلب لهما إداما ، فانطلق فأتى رسول الله [ - صلى الله عليه وسلم - ] ومعه قدح له ، فقال : يا رسول الله ، بعثني أصحابي لتؤدمهم إن كان عندك ؟ قال : \" ما يصنع أصحابك بالأدم ؟ قد ائتدموا \" . فرجع سلمان يخبرهما بقول رسول الله - صلى الله عليه وسلم - فانطلقا حتى أتيا رسول الله - صلى الله عليه وسلم - فقالا : لا والذي بعثك بالحق ، ما أصبنا طعاما منذ نزلنا . قال : \" إنكما قد ائتدمتما بسلمان بقولكما \" .\nقال : ونزلت : ( أيحب أحدكم أن يأكل لحم أخيه ميتا ) ، إنه كان نائما .\nوروى الحافظ الضياء المقدسي في كتابه \" المختارة \" من طريق حبان بن هلال ، عن حماد بن سلمة ، عن ثابت ، عن أنس بن مالك قال : كانت العرب تخدم بعضها بعضا في الأسفار ، وكان مع أبي بكر وعمر رجل يخدمهما ، فناما فاستيقظا ولم يهيئ لهما طعاما ، فقالا : إن هذا لنئوم ، فأيقظاه ، فقالا له : ائت رسول الله فقل له : إن أبا بكر وعمر يقرئانك السلام ، ويستأدمانك .\nفقال : \" إنهما قد ائتدما \" فجاءا فقالا : يا رسول الله ، بأي شيء ائتدمنا ؟ فقال : \" بلحم أخيكما ، والذي نفسي بيده ، إني لأرى لحمه بين ثناياكما \" . فقالا : استغفر لنا يا رسول الله فقال : \" مراه فليستغفر لكما \" .\nوقال الحافظ أبو يعلى : حدثنا الحكم بن موسى ، حدثنا محمد بن مسلم ، عن محمد بن إسحاق ، عن عمه موسى بن يسار ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" من أكل من لحم أخيه في الدنيا ، قرب له لحمه في الآخرة ، فيقال له : كله ميتا كما أكلته حيا . قال : فيأكله ويكلح ويصيح \" . غريب جدا .\nوقوله : ( واتقوا الله ) أي : فيما أمركم به ونهاكم عنه ، فراقبوه في ذلك واخشوا منه ، ( إن الله تواب رحيم ) أي : تواب على من تاب إليه ، رحيم بمن رجع إليه ، واعتمد عليه .\nقال الجمهور من العلماء : طريق المغتاب للناس في توبته أن يقلع عن ذلك ، ويعزم على ألا يعود . وهل يشترط الندم على ما فات ؟ فيه نزاع ، وأن يتحلل من الذي اغتابه . وقال آخرون : لا يشترط أن يتحلله فإنه إذا أعلمه بذلك ربما تأذى أشد مما إذا لم يعلم بما كان منه ، فطريقه إذا أن يثني عليه بما فيه في المجالس التي كان يذمه فيها ، وأن يرد عنه الغيبة بحسبه وطاقته ، فتكون تلك بتلك ، كما قال الإمام أحمد :\nحدثنا أحمد بن الحجاج ، أخبرنا عبد الله ، أخبرنا يحيى بن أيوب ، عن عبد الله بن سليمان ; أن إسماعيل بن يحيى المعافري أخبره أن سهل بن معاذ بن أنس الجهني أخبره ، عن أبيه ، عن النبي - صلى الله عليه وسلم - قال : \" من حمى مؤمنا من منافق يعيبه ، بعث الله إليه ملكا يحمي لحمه يوم القيامة من نار جهنم . ومن رمى مؤمنا بشيء يريد شينه ، حبسه الله على جسر جهنم حتى يخرج مما قال \" . وكذا رواه أبو داود من حديث عبد الله - وهو ابن المبارك - به بنحوه .\nوقال أبو داود أيضا : حدثنا إسحاق بن الصباح ، حدثنا ابن أبي مريم ، أخبرنا الليث : حدثني يحيى بن سليم ; أنه سمع إسماعيل بن بشير يقول : سمعت جابر بن عبد الله ، وأبا طلحة بن سهل الأنصاري يقولان : قال رسول الله - صلى الله عليه وسلم - : \" ما من امرئ يخذل امرأ مسلما في موضع تنتهك فيه حرمته وينتقص فيه من عرضه ، إلا خذله الله في مواطن يحب فيها نصرته . وما من امرئ ينصر امرأ مسلما في موضع ينتقص فيه من عرضه ، وينتهك فيه من حرمته إلا نصره الله في مواطن يحب فيها نصرته \" . تفرد به أبو داود .\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَ لَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ ٢١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا اجتنبوا كثيرا من الظن إن بعض الظن إثم ولا تجسسوا ولا يغتب بعضكم بعضا أيحب أحدكم أن يأكل لحم أخيه ميتا فكرهتموه واتقوا الله إن الله تواب رحيم .\nفيه عشر مسائل :\nالأولى : قوله تعالى : يا أيها الذين آمنوا اجتنبوا كثيرا من الظن قيل : إنها نزلت في رجلين من أصحاب النبي - صلى الله عليه وسلم - اغتابا رفيقهما . وذلك أن النبي - صلى الله عليه وسلم - كان إذا سافر ضم الرجل المحتاج إلى الرجلين الموسرين فيخدمهما . فضم سلمان إلى رجلين ، فتقدم سلمان إلى المنزل فغلبته عيناه فنام ولم يهيئ لهما شيئا ، فجاءا فلم يجدا طعاما وإداما ، فقالا له : انطلق فاطلب لنا من النبي - صلى الله عليه وسلم - طعاما وإداما ، فذهب فقال له النبي - صلى الله عليه وسلم - : اذهب إلى أسامة بن زيد فقل له إن كان عندك فضل من طعام فليعطك وكان أسامة خازن النبي - صلى الله عليه وسلم - ، فذهب إليه ، فقال أسامة : ما عندي شيء ، فرجع إليهما فأخبرهما ، فقالا : قد كان عنده ولكنه بخل . ثم بعثا سلمان إلى طائفة من الصحابة فلم يجد عندهم شيئا ، فقالا : لو بعثنا سلمان إلى بئر سميحة لغار ماؤها . ثم انطلقا يتجسسان هل عند أسامة شيء ، فرآهما النبي - صلى الله عليه وسلم - فقال : ( ما لي أرى خضرة اللحم في أفواهكما ) فقالا : يا نبي الله ، والله ما أكلنا في يومنا هذا لحما ولا غيره . فقال : ( ولكنكما ظلتما تأكلان لحم سلمان وأسامة ) فنزلت : يا أيها الذين آمنوا اجتنبوا كثيرا من الظن إن بعض الظن إثم ذكره الثعلبي . أي : لا تظنوا بأهل الخير سوءا إن كنتم تعلمون من ظاهر أمرهم الخير .\nالثانية : ثبت في الصحيحين عن أبي هريرة أن النبي - صلى الله عليه وسلم - قال : إياكم والظن فإن الظن أكذب الحديث ولا تحسسوا ولا تجسسوا ولا تناجشوا ولا تحاسدوا ولا تباغضوا ولا تدابروا وكونوا عباد الله إخوانا لفظ البخاري . قال علماؤنا : فالظن هنا وفي الآية هو التهمة . ومحل التحذير والنهي إنما هو تهمة لا سبب لها يوجبها ، كمن يتهم بالفاحشة أو بشرب الخمر مثلا ولم يظهر عليه ما يقتضي ذلك . ودليل كون الظن هنا بمعنى التهمة قوله تعالى : ولا تجسسوا وذلك أنه قد يقع له خاطر التهمة ابتداء ويريد أن يتجسس خبر ذلك ويبحث عنه ، ويتبصر ويستمع لتحقيق ما وقع له من تلك التهمة . فنهى النبي - صلى الله عليه وسلم - عن ذلك . وإن شئت قلت : والذي يميز الظنون التي يجب اجتنابها عما سواها ، أن كل ما لم تعرف له أمارة صحيحة وسبب ظاهر كان حراما واجب الاجتناب . وذلك إذا كان المظنون به ممن شوهد منه الستر والصلاح ، وأونست منه الأمانة في الظاهر ، فظن الفساد به والخيانة محرم ، بخلاف من اشتهره الناس بتعاطي الريب والمجاهرة بالخبائث .\nوعن النبي - صلى الله عليه وسلم - أن الله حرم من المسلم دمه وعرضه وأن يظن به ظن السوء . وعن الحسن : كنا في زمن الظن بالناس فيه حرام ، وأنت اليوم في زمن اعمل واسكت وظن في الناس ما شئت .\nالثالثة : للظن حالتان : حالة تعرف وتقوى بوجه من وجوه الأدلة فيجوز الحكم بها ، وأكثر أحكام الشريعة مبنية على غلبة الظن ، كالقياس وخبر الواحد وغير ذلك من قيم المتلفات وأروش الجنايات . والحالة الثانية : أن يقع في النفس شيء من غير دلالة فلا يكون ذلك أولى من ضده ، فهذا هو الشك ، فلا يجوز الحكم به ، وهو المنهي عنه على ما قررناه آنفا . وقد أنكرت جماعة من المبتدعة تعبد الله بالظن وجواز العمل به ، تحكما في الدين ودعوى في المعقول . وليس في ذلك أصل يعول عليه ، فإن البارئ تعالى لم يذم جميعه ، وإنما أورد الذم في بعضه . وربما تعلقوا بحديث أبي هريرة إياكم والظن فإن هذا لا حجة فيه ; لأن الظن في الشريعة قسمان : محمود ومذموم ، فالمحمود منه ما سلم معه دين الظان والمظنون به عند بلوغه . والمذموم ضده ، بدلالة قوله تعالى : إن بعض الظن إثم ، وقوله : لولا إذ سمعتموه ظن المؤمنون والمؤمنات بأنفسهم خيرا ، وقوله : وظننتم ظن السوء وكنتم قوما بورا وقال النبي - صلى الله عليه وسلم - : إذا كان أحدكم مادحا أخاه فليقل أحسب كذا ولا أزكي على الله أحدا . وقال : إذا ظننت فلا تحقق وإذا حسدت فلا تبغ وإذا تطيرت فامض خرجه أبو داود . وأكثر العلماء على أن الظن القبيح بمن ظاهره الخير لا يجوز ، وأنه لا حرج في الظن القبيح بمن ظاهره القبيح ، قاله المهدوي .\nالرابعة : قوله تعالى : ولا تجسسوا قرأ أبو رجاء والحسن باختلاف وغيرهما ( ولا تحسسوا ) بالحاء . واختلف هل هما بمعنى واحد أو بمعنيين ، فقال الأخفش : ليس تبعد إحداهما من الأخرى ; لأن التجسس البحث عما يكتم عنك . والتحسس ( بالحاء ) طلب الأخبار والبحث عنها . وقيل : إن التجسس ( بالجيم ) هو البحث ، ومنه قيل : رجل جاسوس إذا كان يبحث عن الأمور . وبالحاء : هو ما أدركه الإنسان ببعض حواسه . وقول ثان في الفرق : أنه بالحاء تطلبه لنفسه ، وبالجيم أن يكون رسولا لغيره ، قاله ثعلب . والأول أعرف . جسست الأخبار وتجسستها أي : تفحصت عنها ، ومنه الجاسوس . ومعنى الآية : خذوا ما ظهر ولا تتبعوا عورات المسلمين ، أي : لا يبحث أحدكم عن عيب أخيه حتى يطلع عليه بعد أن ستره الله . وفي كتاب أبي داود عن معاوية قال سمعت رسول الله - صلى الله عليه وسلم - يقول : إنك إن اتبعت عورات الناس أفسدتهم أو كدت تفسدهم فقال أبو الدرداء : كلمة سمعها معاوية من رسول الله - صلى الله عليه وسلم - نفعه الله تعالى بها . وعن المقدام بن معدي كرب عن أبي أمامة عن النبي - صلى الله عليه وسلم - قال : ( إن الأمير إذا ابتغى الريبة في الناس أفسدهم ) . وعن زيد بن وهب قال : أتي ابن مسعود فقيل : هذا فلان تقطر لحيته خمرا . فقال عبد الله : إنا قد نهينا عن التجسس ، ولكن إن يظهر لنا شيء نأخذ به . وعن أبي برزة الأسلمي قال : قال رسول الله - صلى الله عليه وسلم - : يا معشر من آمن بلسانه ولم يدخل الإيمان قلبه لا تغتابوا المسلمين ولا تتبعوا عوراتهم ، فإن من اتبع عوراتهم يتبع الله عورته ومن يتبع الله عورته يفضحه في بيته . وقال عبد الرحمن بن عوف : حرست ليلة مع عمر بن الخطاب - رضي الله عنه - بالمدينة إذ تبين لنا سراج في بيت بابه مجاف على قوم لهم أصوات مرتفعة ولغط ، فقال عمر : هذا بيت ربيعة بن أمية بن خلف ، وهم الآن شرب فما ترى! ؟ قلت : أرى أنا قد أتينا ما نهى الله عنه ، قال الله تعالى : ولا تجسسوا وقد تجسسنا ، فانصرف عمر وتركهم . وقال أبو قلابة : حدث عمر بن الخطاب أن أبا محجن الثقفي يشرب الخمر مع أصحاب له في بيته ، فانطلق عمر حتى دخل عليه ، فإذا ليس عنده إلا رجل ، فقال أبو محجن : إن هذا لا يحل لك! قد نهاك الله عن التجسس ، فخرج عمر وتركه . وقال زيد بن أسلم : خرج عمر وعبد الرحمن يعسان ، إذ تبينت لهما نار فاستأذنا ففتح الباب ، فإذا رجل وامرأة تغني وعلى يد الرجل قدح ، فقال عمر : وأنت بهذا يا فلان ؟ فقال : وأنت بهذا يا أمير المؤمنين! قال عمر : فمن هذه منك ؟ قال امرأتي ، قال فما في هذا القدح ؟ قال ماء زلال ، فقال للمرأة : وما الذي تغنين ؟ فقالت :\nتطاول هذا الليل واسود جانبه وأرقني أن لا خليل ألاعبه فوالله لولا الله أني أراقبه\nلزعزع من هذا السرير جوانبه ولكن عقلي والحياء يكفني\nوأكرم بعلي أن تنال مراكبه\nثم قال الرجل : ما بهذا أمرنا يا أمير المؤمنين! قال الله تعالى : ولا تجسسوا قال صدقت .\nقلت : لا يفهم من هذا الخبر أن المرأة كانت غير زوجة الرجل ; لأن عمر لا يقر على الزنى ، وإنما غنت بتلك الأبيات تذكارا لزوجها ، وأنها قالتها في مغيبه عنها . والله أعلم .\nوقال عمرو بن دينار : كان رجل من أهل المدينة له أخت فاشتكت ، فكان يعودها فماتت فدفنها . فكان هو الذي نزل في قبرها ، فسقط من كمه كيس فيه دنانير ، فاستعان ببعض أهله فنبشوا قبرها فأخذ الكيس ثم قال : لأكشفن حتى أنظر ما آل حال أختي إليه ، فكشف عنها فإذا القبر مشتعل نارا ، فجاء إلى أمه فقال : أخبريني ما كان عمل أختي ؟ فقالت : قد ماتت أختك فما سؤالك عن عملها! فلم يزل بها حتى قالت له : كان من عملها أنها كانت تؤخر الصلاة عن مواقيتها ، وكانت إذا نام الجيران قامت إلى بيوتهم فألقمت أذنها أبوابهم ، فتجسس عليهم وتخرج أسرارهم ، فقال : بهذا هلكت !\nالخامسة : قوله تعالى : ولا يغتب بعضكم بعضا نهى - عز وجل - عن الغيبة ، وهي أن تذكر الرجل بما فيه ، فإن ذكرته بما ليس فيه فهو البهتان . ثبت معناه في صحيح مسلم عن أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : أتدرون ما الغيبة ؟ قالوا : الله ورسوله أعلم . قال : ذكرك أخاك بما يكره قيل : أفرأيت إن كان في أخي ما أقول ؟ قال : إن كان فيه ما تقول فقد اغتبته وإن لم يكن فيه فقد بهته . يقال : اغتابه اغتيابا إذا وقع فيه ، والاسم الغيبة ، وهي ذكر العيب بظهر الغيب .\nقال الحسن : الغيبة ثلاثة أوجه كلها في كتاب الله تعالى : الغيبة والإفك والبهتان . فأما الغيبة فهو أن تقول في أخيك ما هو فيه . وأما الإفك فأن تقول فيه ما بلغك عنه . وأما البهتان فأن تقول فيه ما ليس فيه .\nوعن شعبة قال : قال لي معاوية - يعني ابن قرة - : لو مر بك رجل أقطع ، فقلت هذا أقطع كان غيبة . قال شعبة : فذكرته لأبي إسحاق فقال صدق . وروى أبو هريرة أن الأسلمي ماعزا جاء إلى النبي - صلى الله عليه وسلم - فشهد على نفسه بالزنى فرجمه رسول الله - صلى الله عليه وسلم - . فسمع نبي الله - صلى الله عليه وسلم - رجلين من أصحابه يقول أحدهما للآخر : انظر إلى هذا الذي ستر الله عليه فلم تدعه نفسه حتى رجم رجم الكلب ، فسكت عنهما . ثم سار ساعة حتى مر بجيفة حمار شائل برجله فقال : أين فلان وفلان ؟ فقالا : نحن ذا يا رسول الله ، قال : انزلا فكلا من جيفة هذا الحمار فقالا : يا نبي الله ومن يأكل من هذا! قال : فما نلتما من عرض أخيكما أشد من الأكل منه والذي نفسي بيده إنه الآن لفي أنهار الجنة ينغمس فيها .\nالسادسة : قوله تعالى : أيحب أحدكم أن يأكل لحم أخيه ميتا مثل الله الغيبة بأكل الميتة ; لأن الميت لا يعلم بأكل لحمه كما أن الحي لا يعلم بغيبة من اغتابه .وقال ابن عباس : إنما ضرب الله هذا المثل للغيبة لأن أكل لحم الميت حرام مستقذر ، وكذا الغيبة حرام في الدين وقبيح في النفوس . وقال قتادة : كما يمتنع أحدكم أن يأكل لحم أخيه ميتا كذلك يجب أن يمتنع من غيبته حيا . واستعمل أكل اللحم مكان الغيبة لأن عادة العرب بذلك جارية . قال الشاعر [ المقنع الكندي ] :\nفإن أكلوا لحمي وفرت لحومهم وإن هدموا مجدي بنيت لهم مجدا\nوقال - صلى الله عليه وسلم - : ما صام من ظل يأكل لحوم الناس . فشبه الوقيعة في الناس بأكل لحومهم . فمن تنقص مسلما أو ثلم عرضه فهو كالآكل لحمه حيا ، ومن اغتابه فهو كالآكل لحمه ميتا . وفي كتاب أبي داود عن أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - : لما عرج بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم فقلت من هؤلاء يا جبريل ؟ قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم . وعن المستورد أن رسول الله - صلى الله عليه وسلم - قال : من أكل برجل مسلم أكلة فإن الله يطعمه مثلها من جهنم ومن كسي ثوبا برجل مسلم فإن الله يكسوه مثله من جهنم ومن أقام برجل مقام سمعة ورياء فإن الله يقوم به مقام سمعة ورياء يوم القيامة . وقد تقدم قوله - صلى الله عليه وسلم - : يا معشر من آمن بلسانه ولم يدخل الإيمان قلبه لا تغتابوا المسلمين . وقوله للرجلين : ما لي أرى خضرة اللحم في أفواهكما . وقال أبو قلابة الرقاشي : سمعت أبا عاصم يقول : ما اغتبت أحدا مذ عرفت ما في الغيبة . وكان ميمون بن سياه لا يغتاب أحدا ، ولا يدع أحدا يغتاب أحدا عنده ، ينهاه فإن انتهى وإلا قام . وذكر الثعلبي من حديث أبي هريرة قال : قام رجل من عند النبي - صلى الله عليه وسلم - فرأوا في قيامه عجزا فقالوا : يا رسول الله ما أعجز فلانا! فقال : أكلتم لحم أخيكم واغتبتموه . وعن سفيان الثوري قال : أدنى الغيبة أن تقول إن فلانا جعد قطط ، إلا أنه يكره ذلك . وقال عمر بن الخطاب - رضي الله عنه - : إياكم وذكر الناس فإنه داء ، وعليكم بذكر الله فإنه شفاء . وسمع علي بن الحسين - رضي الله عنهما رجلا يغتاب آخر ، فقال : إياك والغيبة فإنها إدام كلاب الناس . وقيل : لعمرو بن عبيد : لقد وقع فيك فلان حتى رحمناك ، قال : إياه فارحموا . وقال رجل للحسن : بلغني أنك تغتابني! فقال : لم يبلغ قدرك عندي أن أحكمك في حسناتي .\nالسابعة : ذهب قوم إلى أن الغيبة لا تكون إلا في الدين ولا تكون في الخلقة والحسب . وقالوا : ذلك فعل الله به . وذهب آخرون إلى عكس هذا فقالوا : لا تكون الغيبة إلا في الخلق والخلق والحسب . والغيبة في الخلق أشد ; لأن من عيب صنعة فإنما عيب صانعها . وهذا كله مردود . أما الأول فيرده حديث عائشة حين قالت في صفية : إنها امرأة قصيرة ، فقال لها النبي - صلى الله عليه وسلم - : لقد قلت كلمة لو مزج بها البحر لمزجته . خرجه أبو داود . وقال فيه الترمذي : حديث حسن صحيح ، وما كان في معناه حسب ما تقدم . وإجماع العلماء قديما على أن ذلك غيبة إذا أريد به العيب . وأما الثاني فمردود أيضا عند جميع العلماء ; لأن العلماء من أول الدهر من أصحاب رسول الله - صلى الله عليه وسلم - والتابعين بعدهم لم تكن الغيبة عندهم في شيء أعظم من الغيبة في الدين ; لأن عيب الدين أعظم العيب ، فكل مؤمن يكره أن يذكر في دينه أشد مما يكره في بدنه . وكفى ردا لمن قال هذا القول قوله - عليه السلام - : إذا قلت في أخيك ما يكره فقد اغتبته . . . الحديث . فمن زعم أن ذلك ليس بغيبة فقد رد ما قال النبي - صلى الله عليه وسلم - نصا . وكفى بعموم قول النبي - صلى الله عليه وسلم - : دماؤكم وأموالكم وأعراضكم عليكم حرام وذلك عام للدين والدنيا . وقول النبي : من كانت عنده لأخيه مظلمة في عرضه أو ماله فليتحلله منه . فعم كل عرض ، فمن خص من ذلك شيئا دون شيء فقد عارض ما قال النبي صلى الله عليه وسلم .\nالثامنة : لا خلاف أن الغيبة من الكبائر ، وأن من اغتاب أحدا عليه أن يتوب إلى الله عز وجل . وهل يستحل المغتاب ؟ اختلف فيه ، فقالت فرقة : ليس عليه استحلاله ، وإنما هي خطيئة بينه وبين ربه . واحتجت بأنه لم يأخذ من ماله ولا أصاب من بدنه ما ينقصه ، فليس ذلك بمظلمة يستحلها منه ، وإنما المظلمة ما يكون منه البدل والعوض في المال والبدن . وقالت فرقة : هي مظلمة ، وكفارتها الاستغفار لصاحبها الذي اغتابه . واحتجت بحديث يروى عن الحسن قال : كفارة الغيبة أن تستغفر لمن اغتبته . وقالت فرقة : هي مظلمة وعليه الاستحلال منها . واحتجت بقول النبي - صلى الله عليه وسلم - : من كانت لأخيه عنده مظلمة في عرض أو مال فليتحلله منه من قبل أن يأتي يوم ليس هناك دينار ولا درهم يؤخذ من حسناته فإن لم يكن له حسنات أخذ من سيئات صاحبه فزيد على سيئاته . خرجه البخاري من حديث أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : من كانت له مظلمة لأخيه من عرضه أو شيء فليتحلله منه اليوم قبل ألا يكون له دينار ولا درهم إن كان له عمل صالح أخذ منه بقدر مظلمته وإن لم يكن له حسنات أخذ من سيئات صاحبه فحمل عليه . وقد تقدم هذا المعنى في سورة ( آل عمران ) عند قوله تعالى : ولا تحسبن الذين قتلوا في سبيل الله أمواتا بل أحياء . وقد روي من حديث عائشة أن امرأة دخلت عليها فلما قامت قالت امرأة : ما أطول ذيلها! فقالت لها عائشة : لقد اغتبتيها فاستحليها . فدلت الآثار عن النبي - صلى الله عليه وسلم - أنها مظلمة يجب على المغتاب استحلالها . وأما قول من قال : إنما الغيبة في المال والبدن ، فقد أجمعت العلماء على أن على القاذف للمقذوف مظلمة يأخذه بالحد حتى يقيمه عليه ، وذلك ليس في البدن ولا في المال ، ففي ذلك دليل على أن الظلم في العرض والبدن والمال ، وقد قال الله تعالى في القاذف : فإذ لم يأتوا بالشهداء فأولئك عند الله هم الكاذبون . وقد قال رسول الله - صلى الله عليه وسلم - : من بهت مؤمنا بما ليس فيه حبسه الله في طينة الخبال . وذلك كله في غير المال والبدن . وأما من قال : إنها مظلمة ، وكفارة المظلمة أن يستغفر لصاحبها ، فقد ناقض إذ سماها مظلمة ثم قال : كفارتها أن يستغفر لصاحبها ; لأن قوله مظلمة تثبت ظلامة المظلوم ، فإذا ثبتت الظلامة لم يزلها عن الظالم إلا إحلال المظلوم له . وأما قول الحسن فليس بحجة ، وقد قال النبي - صلى الله عليه وسلم - : من كانت له عند أخيه مظلمة في عرض أو مال فليتحللها منه .\nوقد ذهب بعضهم إلى ترك التحليل لمن سأله ، ورأى أنه لا يحل ما حرم الله عليه ، منهم سعيد بن المسيب قال : لا أحلل من ظلمني . وقيل : لابن سيرين : يا أبا بكر ، هذا رجل سألك أن تحلله من مظلمة هي لك عنده ، فقال : إني لم أحرمها عليه فأحلها ، إن الله حرم الغيبة عليه ، وما كنت لأحل ما حرم الله عليه أبدا . وخبر النبي - صلى الله عليه وسلم - يدل على التحليل ، وهو الحجة والمبين . والتحليل يدل على الرحمة وهو من وجه العفو ، وقد قال تعالى : فمن عفا وأصلح فأجره على الله .\nالتاسعة : ليس من هذا الباب غيبة الفاسق المعلن به المجاهر ، فإن في الخبر من ألقى جلباب الحياء فلا غيبة له . وقال - صلى الله عليه وسلم - : اذكروا الفاجر بما فيه كي يحذره الناس . فالغيبة إذا في المرء الذي يستر نفسه . وروي عن الحسن أنه قال : ثلاثة ليس لهم حرمة : صاحب الهوى ، والفاسق المعلن ، والإمام الجائر . وقال الحسن لما مات الحجاج : اللهم أنت أمته فاقطع عنا سنته - وفي رواية شينه - فإنه أتانا أخيفش أعيمش ، يمد بيد قصيرة البنان ، والله ما عرق فيها غبار في سبيل الله ، يرجل جمته ويخطر في مشيته ، ويصعد المنبر فيهدر حتى تفوته الصلاة . لا من الله يتقي ، ولا من الناس يستحي ، فوقه الله وتحته مائة ألف أو يزيدون ، لا يقول له قائل : الصلاة أيها الرجل . ثم يقول الحسن : هيهات! حال دون ذلك السيف والسوط . وروى الربيع بن صبيح عن الحسن قال : ليس لأهل البدع غيبة . وكذلك قولك للقاضي تستعين به على أخذ حقك ممن ظلمك فتقول فلان ظلمني أو غضبني أو خانني أو ضربني أو قذفني أو أساء إلي ، ليس بغيبة . وعلماء الأمة على ذلك مجمعة . وقال النبي - صلى الله عليه وسلم - في ذلك : لصاحب الحق مقال . وقال : مطل الغني ظلم وقال لي الواجد يحل عرضه وعقوبته . ومن ذلك الاستفتاء ، كقول هند للنبي - صلى الله عليه وسلم - : إن أبا سفيان رجل شحيح لا يعطيني ما يكفيني أنا وولدي ، فآخذ من غير علمه ؟ فقال النبي - صلى الله عليه وسلم - : نعم فخذي . فذكرته بالشح والظلم لها ولولدها ، ولم يرها مغتابة ; لأنه لم يغير عليها ، بل أجابها عليه الصلاة والسلام بالفتيا لها . وكذلك إذا كان في ذكره بالسوء فائدة ، كقوله - صلى الله عليه وسلم - : أما معاوية فصعلوك لا مال له وأما أبو جهم فلا يضع عصاه عن عاتقه . فهذا جائز ، وكان مقصوده ألا تغتر فاطمة بنت قيس بهما . قال جميعه المحاسبي رحمه الله .\nالعاشرة : قوله تعالى : ميتا وقرئ ( ميتا ) وهو نصب على الحال من اللحم . ويجوز أن ينصب على الأخ ، ولما قررهم - عز وجل - بأن أحدا منهم لا يجب أكل جيفة أخيه عقب ذلك بقوله تعالى : فكرهتموه وفيه وجهان : أحدهما : فكرهتم أكل الميتة فكذلك فاكرهوا الغيبة ، روي معناه عن مجاهد . الثاني : فكرهتم أن يغتابكم الناس فاكرهوا غيبة الناس . وقال الفراء : أي : فقد كرهتموه فلا تفعلوه . وقيل : لفظه خبر ومعناه أمر ، أي : اكرهوه . واتقوا الله عطف عليه . وقيل : عطف على قوله : اجتنبوا . ولا تجسسوا إن الله تواب رحيم\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَ لَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ ٢١\n                                        \n                                        \n                                        \n                                        نهى الله تعالى عن كثير من الظن السوء بالمؤمنين، فـ { إِنَّ بَعْضَ الظَّنِّ إِثْمٌ } وذلك، كالظن الخالي من الحقيقة والقرينة، وكظن السوء، الذي يقترن به كثير من الأقوال، والأفعال المحرمة، فإن بقاء ظن السوء بالقلب، لا يقتصر صاحبه على مجرد ذلك، بل لا يزال به، حتى يقول ما لا ينبغي، ويفعل ما لا ينبغي، وفي ذلك أيضًا، إساءة الظن بالمسلم، وبغضه، وعداوته المأمور بخلاف ذلك منه.\n{ وَلَا تَجَسَّسُوا } أي: لا تفتشوا عن عورات المسلمين، ولا تتبعوها، واتركوا المسلم على حاله، واستعملوا التغافل عن أحواله التي إذا فتشت، ظهر منها ما لا ينبغي.\n{ وَلَا يَغْتَبْ بَعْضُكُمْ بَعْضًا } والغيبة، كما قال النبي صلى الله عليه وسلم: { ذكرك أخاك بما يكره ولو كان فيه }\nثم ذكر مثلاً منفرًا عن الغيبة، فقال: { أَيُحِبُّ أَحَدُكُمْ أَنْ يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ } شبه أكل لحمه ميتًا، المكروه للنفوس [غاية الكراهة]، باغتيابه، فكما أنكم تكرهون أكل لحمه، وخصوصًا إذا كان ميتًا، فاقد الروح، فكذلك، [فلتكرهوا] غيبته، وأكل لحمه حيًا.\n{ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ تَوَّابٌ رَحِيمٌ } والتواب، الذي يأذن بتوبة عبده، فيوفقه لها، ثم يتوب عليه، بقبول توبته، رحيم بعباده، حيث دعاهم إلى ما ينفعهم، وقبل منهم التوبة، وفي هذه الآية، دليل على التحذير الشديد من الغيبة، وأن الغيبة من الكبائر، لأن الله شبهها بأكل لحم الميت، وذلك من الكبائر.\n                                    "
    }
  },
  {
    "id": 12,
    "versesNumber": 13,
    "souraName": "Al-Hujurat.html",
    "contnent": "يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ ٣١",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ ٣١\n                                    \n                                    \n                                    يقول تعالى مخبرا للناس أنه خلقهم من نفس واحدة ، وجعل منها زوجها ، وهما آدم وحواء ، وجعلهم شعوبا ، وهي أعم من القبائل ، وبعد القبائل مراتب أخر كالفصائل والعشائر والعمائر والأفخاذ وغير ذلك .\nوقيل : المراد بالشعوب بطون العجم ، وبالقبائل بطون العرب ، كما أن الأسباط بطون بني إسرائيل . وقد لخصت هذا في مقدمة مفردة جمعتها من كتاب : \" الإنباه \" لأبي عمر بن عبد البر ، ومن كتاب \" القصد والأمم ، في معرفة أنساب العرب والعجم \" . فجميع الناس في الشرف بالنسبة الطينية إلى آدم وحواء سواء ، وإنما يتفاضلون بالأمور الدينية ، وهي طاعة الله ومتابعة رسوله - صلى الله عليه وسلم - ; ولهذا قال تعالى بعد النهي عن الغيبة واحتقار بعض الناس بعضا ، منبها على تساويهم في البشرية : ( يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا ) أي : ليحصل التعارف بينهم ، كل يرجع إلى قبيلته .\nوقال مجاهد في قوله : ( لتعارفوا ) ، كما يقال : فلان بن فلان من كذا وكذا ، أي : من قبيلة كذا وكذا .\nوقال سفيان الثوري : كانت حمير ينتسبون إلى مخاليفها ، وكانت عرب الحجاز ينتسبون إلى قبائلها .\nوقد قال أبو عيسى الترمذي : حدثنا أحمد بن محمد ، حدثنا عبد الله بن المبارك ، عن عبد الملك بن عيسى الثقفي ، عن يزيد - مولى المنبعث - عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - قال : \" تعلموا من أنسابكم ما تصلون به أرحامكم ; فإن صلة الرحم محبة في الأهل ، مثراة في المال ، منسأة في الأثر \" . ثم قال : غريب ، لا نعرفه إلا من هذا الوجه .\nوقوله : ( إن أكرمكم عند الله أتقاكم ) أي : إنما تتفاضلون عند الله بالتقوى لا بالأحساب . وقد وردت الأحاديث بذلك عن رسول الله - صلى الله عليه وسلم - :\nقال البخاري رحمه الله : حدثنا محمد بن سلام ، حدثنا عبدة ، عن عبيد الله ، عن سعيد بن أبي سعيد ، عن أبي هريرة قال : سئل رسول الله - صلى الله عليه وسلم - : أي الناس أكرم ؟ قال : \" أكرمهم عند الله أتقاهم \" قالوا : ليس عن هذا نسألك . قال : \" فأكرم الناس يوسف نبي الله ، ابن نبي الله ، ابن خليل الله \" . قالوا : ليس عن هذا نسألك . قال : \" فعن معادن العرب تسألوني ؟ \" قالوا : نعم . قال : \" فخياركم في الجاهلية خياركم في الإسلام إذا فقهوا \" .\nوقد رواه البخاري في غير موضع من طرق عن عبدة بن سليمان . ورواه النسائي في التفسير من حديث عبيد الله - وهو ابن عمر العمري - به .\nحديث آخر : قال مسلم ، رحمه الله : حدثنا عمرو الناقد ، حدثنا كثير بن هشام ، حدثنا جعفر بن برقان ، عن يزيد بن الأصم ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" إن الله لا ينظر إلى صوركم وأموالكم ، ولكن ينظر إلى قلوبكم وأعمالكم \" .\nورواه ابن ماجه عن أحمد بن سنان ، عن كثير بن هشام ، به .\nحديث آخر : وقال الإمام أحمد : حدثنا وكيع ، عن أبي هلال ، عن بكر ، عن أبي ذر قال : إن النبي - صلى الله عليه وسلم - قال له : \" انظر ، فإنك لست بخير من أحمر ولا أسود إلا أن تفضله بتقوى . تفرد به أحمد .\nحديث آخر : وقال الحافظ أبو القاسم الطبراني : حدثنا أبو عبيدة عبد الوارث بن إبراهيم العسكري ، حدثنا عبد الرحمن بن عمرو بن جبلة ، حدثنا عبيد بن حنين الطائي ، سمعت محمد بن حبيب بن خراش العصري ، يحدث عن أبيه : أنه سمع رسول الله - صلى الله عليه وسلم - يقول : المسلمون إخوة ، لا فضل لأحد على أحد إلا بالتقوى \"\nحديث آخر : قال أبو بكر البزار في مسنده : حدثنا أحمد بن يحيى الكوفي ، حدثنا الحسن بن الحسين ، حدثنا قيس - يعني ابن الربيع - عن شبيب بن غرقدة ، عن المستظل بن حصين ، عن حذيفة قال : قال رسول الله - صلى الله عليه وسلم - : \" كلكم بنو آدم . وآدم خلق من تراب ، ولينتهين قوم يفخرون بآبائهم ، أو ليكونن أهون على الله من الجعلان \" .\nثم قال : لا نعرفه عن حذيفة إلا من هذا الوجه .\nحديث آخر : قال ابن أبي حاتم : حدثنا الربيع بن سليمان ، حدثنا أسد بن موسى ، حدثنا يحيى بن زكريا القطان ، حدثنا موسى بن عبيدة ، عن عبد الله بن دينار ، عن ابن عمر قال : طاف رسول الله - صلى الله عليه وسلم - يوم فتح مكة على ناقته القصواء يستلم الأركان بمحجن في يده ، فما وجد لها مناخا في المسجد حتى نزل - صلى الله عليه وسلم - على أيدي الرجال ، فخرج بها إلى بطن المسيل فأنيخت . ثم إن رسول الله - صلى الله عليه وسلم - خطبهم على راحلته ، فحمد الله وأثنى عليه بما هو له أهل ثم قال : \" يا أيها الناس ، إن الله قد أذهب عنكم عبية الجاهلية وتعظمها بآبائها ، فالناس رجلان : رجل بر تقي كريم على الله ، وفاجر شقي هين على الله . إن الله يقول : ( يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا إن أكرمكم عند الله أتقاكم إن الله عليم خبير ) ثم قال : \" أقول قولي هذا وأستغفر الله لي ولكم \" .\nهكذا رواه عبد بن حميد ، عن أبي عاصم الضحاك بن مخلد ، عن موسى بن عبيدة ، به .\nحديث آخر : قال الإمام أحمد : حدثنا يحيى بن إسحاق ، حدثنا ابن لهيعة ، عن الحارث بن يزيد ، عن علي بن رباح ، عن عقبة بن عامر ; أن رسول الله - صلى الله عليه وسلم - قال : \" إن أنسابكم هذه ليست بمسبة على أحد ، كلكم بنو آدم طف الصاع لم يملأه ، ليس لأحد على أحد فضل إلا بدين وتقوى ، وكفى بالرجل أن يكون بذيا بخيلا فاحشا \" .\nوقد رواه ابن جرير ، عن يونس ، عن ابن وهب ، عن ابن لهيعة ، به ولفظه : \" الناس لآدم وحواء ، طف الصاع لم يملئوه ، إن الله لا يسألكم عن أحسابكم ولا عن أنسابكم يوم القيامة ، إن أكرمكم عند الله أتقاكم \" .\nوليس هو في شيء من الكتب الستة من هذا الوجه .\nحديث آخر : قال الإمام أحمد : حدثنا أحمد بن عبد الملك ، حدثنا شريك ، عن سماك ، عن عبد الله بن عميرة زوج درة ابنة أبي لهب ، عن درة بنت أبي لهب قالت : قام رجل إلى النبي - صلى الله عليه وسلم - وهو على المنبر ، فقال : يا رسول الله ، أي الناس خير ؟ فقال - صلى الله عليه وسلم - : \" خير الناس أقرؤهم ، وأتقاهم لله عز وجل ، وآمرهم بالمعروف ، وأنهاهم عن المنكر ، وأوصلهم للرحم \" .\nحديث آخر : قال الإمام أحمد : حدثنا حسن ، حدثنا ابن لهيعة ، حدثنا أبو الأسود ، عن القاسم بن محمد ، عن عائشة قالت : ما أعجب رسول الله - صلى الله عليه وسلم - شيء من الدنيا ، ولا أعجبه أحد قط ، إلا ذو تقى . تفرد به أحمد رحمه الله .\nوقوله : ( إن الله عليم خبير ) أي : عليم بكم ، خبير بأموركم ، فيهدي من يشاء ، ويضل من يشاء ، ويرحم من يشاء ، ويعذب من يشاء ، ويفضل من يشاء على من يشاء ، وهو الحكيم العليم الخبير في ذلك كله . وقد استدل بهذه الآية الكريمة وهذه الأحاديث الشريفة ، من ذهب من العلماء إلى أن الكفاءة في النكاح لا تشترط ، ولا يشترط سوى الدين ، لقوله : ( إن أكرمكم عند الله أتقاكم ) وذهب الآخرون إلى أدلة أخرى مذكورة في كتب الفقه ، وقد ذكرنا طرفا من ذلك في \" كتاب الأحكام \" ولله الحمد والمنة . وقد روى الطبراني عن عبد الرحمن أنه سمع رجلا من بني هاشم يقول : أنا أولى الناس برسول الله . فقال : غيرك أولى به منك ، ولك منه نسبه .\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ ٣١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا إن أكرمكم عند الله أتقاكم إن الله عليم خبير .\nفيه سبع مسائل :\nالأولى : قوله تعالى : يا أيها الناس إنا خلقناكم من ذكر وأنثى يعني آدم وحواء . ونزلت الآية في أبي هند ، ذكره أبو داود في ( المراسيل ) ، حدثنا عمرو بن عثمان وكثير بن عبيد قالا حدثنا بقية بن الوليد قال حدثني الزهري قال : أمر رسول الله - صلى الله عليه وسلم - بني بياضة أن يزوجوا أبا هند امرأة منهم ، فقالوا لرسول الله - صلى الله عليه وسلم - : نزوج بناتنا موالينا ؟ فأنزل الله - عز وجل - : إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا الآية . قال الزهري : نزلت في أبي هند خاصة . وقيل : إنها نزلت في ثابت بن قيس بن شماس . وقوله في الرجل الذي لم يتفسح له : ابن فلانة ، فقال النبي - صلى الله عليه وسلم - : ( من الذاكر فلانة ) ؟ قال ثابت : أنا يا رسول الله ، فقال النبي - صلى الله عليه وسلم - : ( انظر في وجوه القوم ) فنظر ، فقال : ( ما رأيت ) ؟ قال رأيت أبيض وأسود وأحمر ، فقال : ( فإنك لا تفضلهم إلا بالتقوى ) فنزلت في ثابت هذه الآية . ونزلت في الرجل الذي لم يتفسح له : يا أيها الذين آمنوا إذا قيل لكم تفسحوا في المجالس الآية . قال ابن عباس : لما كان يوم فتح مكة أمر النبي - صلى الله عليه وسلم - بلالا حتى علا على ظهر الكعبة فأذن ، فقال عتاب بن أسيد بن أبي العيص : الحمد لله الذي قبض أبي حتى لا يرى هذا اليوم . قال الحارث بن هشام : ما وجد محمد غير هذا الغراب الأسود مؤذنا . وقال سهيل بن عمرو : إن يرد الله شيئا يغيره . وقال أبو سفيان : إني لا أقول شيئا أخاف أن يخبر به رب السماء ، فأتى جبريل النبي - صلى الله عليه وسلم - وأخبره بما قالوا ، فدعاهم وسألهم عما قالوا فأقروا ، فأنزل الله تعالى هذه الآية . زجرهم عن التفاخر بالأنساب ، والتكاثر بالأموال ، والازدراء بالفقراء ، فإن المدار على التقوى . أي : الجميع من آدم وحواء ، إنما الفضل بالتقوى . وفي الترمذي عن ابن عمر أن رسول الله - صلى الله عليه وسلم - خطب بمكة فقال : ( يا أيها الناس إن الله قد أذهب عنكم عبية الجاهلية وتعاظمها بآبائها . فالناس رجلان : رجل بر تقي كريم على الله ، وفاجر شقي هين على الله . والناس بنو آدم وخلق الله آدم من تراب قال الله تعالى : يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا إن أكرمكم عند الله أتقاكم إن الله عليم خبير ) . خرجه من حديث عبد الله بن جعفر والد علي بن المديني وهو ضعيف ، ضعفه يحيى بن معين وغيره . وقد خرج الطبري في كتاب ( آداب النفوس ) وحدثني يعقوب بن إبراهيم قال حدثنا إسماعيل قال حدثنا سعيد الجريري عن أبي نضرة قال : حدثني أو حدثنا من شهد خطب رسول الله - صلى الله عليه وسلم - بمنى في وسط أيام التشريق وهو على بعير فقال : أيها الناس ألا إن ربكم واحد وإن أباكم واحد ألا لا فضل لعربي على عجمي ولا عجمي على عربي ولا لأسود على أحمر ولا لأحمر على أسود إلا بالتقوى ألا هل بلغت ؟ - قالوا نعم قال - ليبلغ الشاهد الغائب . وفيه عن مالك الأشعري قال : قال رسول الله - صلى الله عليه وسلم - : إن الله لا ينظر إلى أحسابكم ولا إلى أنسابكم ولا إلى أجسامكم ولا إلى أموالكم ولكن ينظر إلى قلوبكم فمن كان له قلب صالح تحنن الله عليه وإنما أنتم بنو آدم وأحبكم إليه أتقاكم . ولعلي - رضي الله عنه - في هذا المعنى وهو مشهور من شعره :\nالناس من جهة التمثيل أكفاء أبوهم آدم والأم حواء نفس كنفس وأرواح مشاكلة\nوأعظم خلقت فيهم وأعضاء فإن يكن لهم من أصلهم حسب\nيفاخرون به فالطين والماء ما الفضل إلا لأهل العلم إنهم\nعلى الهدى لمن استهدى أدلاء وقدر كل امرئ ما كان يحسنه\nوللرجال على الأفعال سيماء وضد كل امرئ ما كان يجهله\nوالجاهلون لأهل العلم أعداء\nالثانية : بين الله تعالى في هذه الآية أنه خلق الخلق من الذكر والأنثى ، وكذلك في أول سورة ( النساء ) ولو شاء لخلقه دونهما كخلقه لآدم ، أو دون ذكر كخلقه لعيسى - عليه السلام - ، أو دون أنثى كخلقه حواء من إحدى الجهتين . وهذا الجائز في القدرة لم يرد به الوجود . وقد جاء أن آدم خلق الله منه حواء من ضلع انتزعها من أضلاعه ، فلعله هذا القسم ، قاله ابن العربي .\nالثالثة : خلق الله الخلق بين الذكر والأنثى أنسابا وأصهارا وقبائل وشعوبا ، وخلق لهم منها التعارف ، وجعل لهم بها التواصل للحكمة التي قدرها وهو أعلم بها ، فصار كل أحد يحوز نسبه ، فإذا نفاه رجل عنه استوجب الحد بقذفه ، مثل أن ينفيه عن رهطه وحسبه ، بقوله للعربي : يا عجمي ، وللعجمي : يا عربي ، ونحو ذلك مما يقع به النفي حقيقة . انتهى .\nالرابعة : ذهب قوم من الأوائل إلى أن الجنين إنما يكون من ماء الرجل وحده ، ويتربى في رحم الأم ، ويستمد من الدم الذي يكون فيه . واحتجوا بقوله تعالى : ألم نخلقكم من ماء مهين فجعلناه في قرار مكين . وقوله تعالى : ثم جعل نسله من سلالة من ماء مهين . وقوله : ألم يك نطفة من مني يمنى فدل على أن الخلق من ماء واحد . والصحيح أن الخلق إنما يكون من ماء الرجل والمرأة لهذه الآية ، فإنها نص لا يحتمل التأويل . وقوله تعالى : خلق من ماء دافق يخرج من بين الصلب والترائب والمراد منه أصلاب الرجال وترائب النساء ، على ما يأتي بيانه . وأما ما احتجوا به فليس فيه أكثر من أن الله تعالى ذكر خلق الإنسان من الماء والسلالة والنطفة ولم يضفها إلى أحد الأبوين دون الآخر . فدل على أن الماء والسلالة لهما والنطفة منهما بدلالة ما ذكرنا . وبأن المرأة تمني كما يمني الرجل ، وعن ذلك يكون الشبه ، حسب ما تقدم بيانه في آخر ( الشورى ) وقد قال في قصة نوح : فالتقى الماء على أمر قد قدر وإنما أراد ماء السماء وماء الأرض ; لأن الالتقاء لا يكون إلا من اثنين ، فلا ينكر أن يكون ثم جعل نسله من سلالة من ماء مهين وقوله تعالى : ألم نخلقكم من ماء مهين ويريد ماءين . والله أعلم .\nالخامسة : قوله تعالى : وجعلناكم شعوبا وقبائل لتعارفوا الشعوب : رءوس القبائل ، مثل ربيعة ومضر والأوس والخزرج ، واحدها شعب بفتح الشين ، سموا به لتشعبهم واجتماعهم كشعب أغصان الشجرة . والشعب من الأضداد ، يقال شعبته إذا جمعته ، ومنه المشعب ( بكسر الميم ) وهو الإشفى ; لأنه يجمع به ويشعب . قال :\nفكاب على حر الجبين ومتق بمدرية كأنه ذلق مشعب\nوشعبته إذا فرقته ، ومنه سميت المنية شعوبا لأنها مفرقة . فأما الشعب ( بالكسر ) فهو الطريق في الجبل ، والجمع الشعاب . قال الجوهري : الشعب : ما تشعب من قبائل العرب والعجم ، والجمع الشعوب . والشعوبية : فرقة لا تفضل العرب على العجم . وأما الذي في الحديث : أن رجلا من الشعوب أسلم ، فإنه يعني من العجم . والشعب : القبيلة العظيمة ، وهو أبو القبائل الذي ينسبون إليه ، أي : يجمعهم ويضمهم . قال ابن عباس : الشعوب الجمهور ، مثل مضر . والقبائل : الأفخاذ . وقال مجاهد : الشعوب البعيد من النسب ، والقبائل دون ذلك . وعنه أيضا أن الشعوب النسب الأقرب . وقاله قتادة . ذكر الأول عنه المهدوي ، والثاني الماوردي . قال الشاعر [ طرفة بن العبد ] :\nرأيت سعودا من شعوب كثيرة فلم أر سعدا مثل سعد بن مالك\nوقال آخر :\nقبائل من شعوب ليس فيهم كريم قد يعد ولا نجيب\nوقيل : إن الشعوب عرب اليمن من قحطان ، والقبائل من ربيعة ومضر وسائر عدنان . وقيل : إن الشعوب بطون العجم ، والقبائل بطون العرب . وقال ابن عباس في رواية : إن الشعوب الموالي ، والقبائل العرب . قال القشيري : وعلى هذا فالشعوب من لا يعرف لهم أصل نسب كالهند والجبل والترك ، والقبائل من العرب . الماوردي : ويحتمل أن الشعوب هم المضافون إلى النواحي والشعاب ، والقبائل هم المشتركون في الأنساب . قال الشاعر :\nوتفرقوا شعبا فكل جزيرة فيها أمير المؤمنين ومنبر\nوحكى أبو عبيد عن ابن الكلبي عن أبيه : الشعب أكبر من القبيلة ثم الفصيلة ثم العمارة ثم البطن ثم الفخذ . وقيل : الشعب ثم القبيلة ثم العمارة ثم البطن ثم الفخذ ثم الفصيلة ثم العشيرة ، وقد نظمها بعض الأدباء فقال :\nاقصد الشعب فهو أكثر حي عددا في الحواء ثم القبيله\nثم تتلوها العمارة ثم ال بطن والفخذ بعدها والفصيله\nثم من بعدها العشيرة لكن هي في جنب ما ذكرناه قليله\nوقال آخر :\nقبيلة قبلها شعب وبعدهما عمارة ثم بطن تلوه فخذ\nوليس يؤوي الفتى إلا فصيلته ولا سداد لسهم ما له قذذ\nالسادسة : قوله تعالى : لتعارفوا إن أكرمكم عند الله وقد تقدم في سورة ( الزخرف ) عند قوله تعالى : وإنه لذكر لك ولقومك . وفي هذه الآية ما يدلك على أن التقوى هي المراعى عند الله تعالى وعند رسوله دون الحسب والنسب . وقرئ ( أن ) بالفتح . كأنه قيل : لم يتفاخر بالأنساب ؟ قيل : لأن أكرمكم عند الله أتقاكم لا أنسبكم . وفي الترمذي عن سمرة عن النبي - صلى الله عليه وسلم - قال : ( الحسب المال والكرم التقوى ) . قال : هذا حديث حسن غريب صحيح . وذلك يرجع إلى قوله تعالى : إن أكرمكم عند الله أتقاكم ، وقد جاء منصوصا عنه - عليه السلام - : ( من أحب أن يكون أكرم الناس فليتق الله ) .\nوالتقوى معناه مراعاة حدود الله تعالى أمرا ونهيا ، والاتصاف بما أمرك أن تتصف به ، والتنزه عما نهاك عنه . وقد مضى هذا في غير موضع .\nوفي الخبر من رواية أبي هريرة عن النبي - صلى الله عليه وسلم - : ( إن الله تعالى يقول يوم القيامة إني جعلت نسبا وجعلتم نسبا فجعلت أكرمكم أتقاكم وأبيتم إلا أن تقولوا فلان ابن فلان وأنا اليوم أرفع نسبي وأضع أنسابكم ، أين المتقون ؟ أين المتقون ؟ ) . وروى الطبري من حديث أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : ( إن أوليائي المتقون يوم القيامة وإن كان نسب أقرب من نسب . يأتي الناس بالأعمال وتأتون بالدنيا تحملونها على رقابكم تقولون يا محمد فأقول هكذا وهكذا ) . وأعرض في كل عطفيه .\nوفي صحيح مسلم من حديث عبد الله بن عمرو قال : سمعت رسول الله - صلى الله عليه وسلم - جهارا غير سر يقول : ( إن آل أبي ليسوا لي بأولياء إنما وليي الله وصالح المؤمنين ) . وعن أبي هريرة أن النبي - صلى الله عليه وسلم - سئل : من أكرم الناس ؟ فقال : ( يوسف بن يعقوب بن إسحاق بن إبراهيم ) قالوا : ليس عن هذا نسألك ، قال : ( فأكرمهم عند الله أتقاهم ) فقالوا : ليس عن هذا نسألك ، فقال : ( عن معادن العرب ؟ خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا ) وأنشدوا في ذلك :\nما يصنع العبد بعز الغنى والعز كل العز للمتقي\nمن عرف الله فلم تغنه معرفة الله فذاك الشقي\nالسابعة : ذكر الطبري حدثني عمر بن محمد قال حدثنا عبيد بن إسحاق العطار قال حدثنا مندل بن علي عن ثور بن يزيد عن سالم بن أبي الجعد قال : تزوج رجل من الأنصار امرأة فطعن عليها في حسبها ، فقال الرجل : إني لم أتزوجها لحسبها إنما تزوجتها لدينها وخلقها ، فقال النبي - صلى الله عليه وسلم - : ( ما يضرك ألا تكون من آل حاجب بن زرارة ) . ثم قال النبي - صلى الله عليه وسلم - : ( إن الله تبارك وتعالى جاء بالإسلام فرفع به الخسيسة وأتم به الناقصة وأذهب به اللوم فلا لوم على مسلم إنما اللوم لوم الجاهلية ) . وقال النبي - صلى الله عليه وسلم - : إني لأرجو أن أكون أخشاكم لله وأعلمكم بما أتقي ولذلك كان أكرم البشر على الله تعالى .\nقال ابن العربي : وهذا الذي لحظ مالك في الكفاءة في النكاح . روى عبد الله عن مالك : يتزوج المولى العربية ، واحتج بهذه الآية . وقال أبو حنيفة والشافعي : يراعى الحسب والمال . وفي الصحيح عن عائشة أن أبا حذيفة بن عتبة بن ربيعة - وكان ممن شهد بدرا مع النبي - صلى الله عليه وسلم - تبنى سالما وأنكحه هندا بنت أخيه الوليد بن عتبة بن ربيعة ، وهو مولى لامرأة من الأنصار . وضباعة بنت الزبير كانت تحت المقداد بن الأسود .\nقلت : وأخت عبد الرحمن بن عوف كانت تحت بلال . وزينب بنت جحش كانت تحت زيد بن حارثة . فدل على جواز نكاح الموالي العربية ، وإنما تراعى الكفاءة في الدين . والدليل عليه أيضا ما روى سهل بن سعد في صحيح البخاري أن النبي - صلى الله عليه وسلم - مر عليه رجل فقال : ( ما تقولون في هذا ) ؟ فقالوا : حري إن خطب أن ينكح ، وإن شفع أن يشفع وإن قال أن يسمع . قال : ثم سكت ، فمر رجل من فقراء المسلمين فقال : ( ما تقولون في هذا ؟ ) قالوا : حري إن خطب ألا ينكح ، وإن شفع ألا يشفع ، وإن قال ألا يسمع . فقال رسول الله - صلى الله عليه وسلم - : ( هذا خير من ملء الأرض مثل هذا ) . وقال - صلى الله عليه وسلم - : تنكح المرأة لمالها وجمالها ودينها - وفي رواية - ولحسبها فعليك بذات الدين تربت يداك .\nوقد خطب سلمان إلى أبي بكر ابنته فأجابه ، وخطب إلى عمر ابنته فالتوى عليه ، ثم سأله أن ينكحها فلم يفعل سلمان . وخطب بلال بنت البكير فأبى إخوتها ، قال بلال : يا رسول الله ، ماذا لقيت من بني البكير ! خطبت إليهم أختهم فمنعوني وآذوني ، فغضب رسول الله - صلى الله عليه وسلم - من أجل بلال ، فبلغهم الخبر فأتوا أختهم فقالوا : ماذا لقينا من سببك ؟ فقالت أختهم : أمري بيد رسول الله - صلى الله عليه وسلم - ، فزوجوها . وقال النبي - صلى الله عليه وسلم - في أبي هند حين حجمه : ( أنكحوا أبا هند وأنكحوا إليه ) . وهو مولى بني بياضة .\nوروى الدارقطني من حديث الزهري عن عروة عن عائشة أن أبا هند مولى بني بياضة كان حجاما فحجم النبي - صلى الله عليه وسلم - ، فقال النبي - صلى الله عليه وسلم - : ( من سره أن ينظر إلى من صور الله الإيمان في قلبه فلينظر إلى أبي هند ) . وقال رسول الله - صلى الله عليه وسلم - : ( أنكحوه وأنكحوا إليه ) . قال القشيري أبو نصر : وقد يعتبر النسب في الكفاءة في النكاح وهو الاتصال بشجرة النبوة أو بالعلماء الذين هم ورثة الأنبياء ، أو بالمرموقين في الزهد والصلاح . والتقي المؤمن أفضل من الفاجر النسيب ، فإن كانا تقيين فحينئذ يقدم النسيب منهما ، كما تقدم الشاب على الشيخ في الصلاة إذا استويا في التقوى .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَٰكُم مِّن ذَكَرٖ وَأُنثَىٰ وَجَعَلۡنَٰكُمۡ شُعُوبٗا وَقَبَآئِلَ لِتَعَارَفُوٓاْۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرٞ ٣١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه خلق بني آدم، من أصل واحد، وجنس واحد، وكلهم من ذكر وأنثى، ويرجعون جميعهم إلى آدم وحواء، ولكن الله [تعالى] بث منهما رجالاً كثيرا ونساء، وفرقهم، وجعلهم شعوبًا وقبائل أي: قبائل صغارًا وكبارًا، وذلك لأجل أن يتعارفوا، فإنهم لو استقل كل واحد منهم بنفسه، لم يحصل بذلك، التعارف الذي يترتب عليه التناصر والتعاون، والتوارث، والقيام بحقوق الأقارب، ولكن الله جعلهم شعوبًا وقبائل، لأجل أن تحصل هذه الأمور وغيرها، مما يتوقف على التعارف، ولحوق الأنساب، ولكن الكرم بالتقوى، فأكرمهم عند الله، أتقاهم، وهو أكثرهم طاعة وانكفافًا عن المعاصي، لا أكثرهم قرابة وقومًا، ولا أشرفهم نسبًا، ولكن الله تعالى عليم خبير، يعلم من يقوم منهم بتقوى الله، ظاهرًا وباطنًا، ممن يقوم بذلك، ظاهرًا لا باطنًا، فيجازي كلا، بما يستحق.\nوفي هذه الآية دليل على أن معرفة الأنساب، مطلوبة مشروعة، لأن الله جعلهم شعوبًا وقبائل، لأجل ذلك.\n                                    "
    }
  },
  {
    "id": 13,
    "versesNumber": 14,
    "souraName": "Al-Hujurat.html",
    "contnent": "۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُواْ وَلَٰكِن قُولُوٓاْ أَسۡلَمۡنَا وَلَمَّا يَدۡخُلِ ٱلۡإِيمَٰنُ فِي قُلُوبِكُمۡۖ وَإِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ لَا يَلِتۡكُم مِّنۡ أَعۡمَٰلِكُمۡ شَيۡ‍ًٔاۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٤١",
    "tafsier": {
      "ibnkther": "۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُواْ وَلَٰكِن قُولُوٓاْ أَسۡلَمۡنَا وَلَمَّا يَدۡخُلِ ٱلۡإِيمَٰنُ فِي قُلُوبِكُمۡۖ وَإِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ لَا يَلِتۡكُم مِّنۡ أَعۡمَٰلِكُمۡ شَيۡ‍ًٔاۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٤١\n                                    \n                                    \n                                    يقول تعالى منكرا على الأعراب الذين أول ما دخلوا في الإسلام ادعوا لأنفسهم مقام الإيمان ، ولم يتمكن الإيمان في قلوبهم بعد : ( قالت الأعراب آمنا قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم ) . وقد استفيد من هذه الآية الكريمة : أن الإيمان أخص من الإسلام كما هو مذهب أهل السنة والجماعة ، ويدل عليه حديث جبريل ، عليه السلام ، حين سأل عن الإسلام ، ثم عن الإيمان ، ثم عن الإحسان ، فترقى من الأعم إلى الأخص ، ثم للأخص منه .\nقال الإمام أحمد : حدثنا عبد الرزاق ، أخبرنا معمر ، عن الزهري ، عن عامر بن سعد بن أبي وقاص ، عن أبيه قال : أعطى رسول الله - صلى الله عليه وسلم - رجالا ولم يعط رجلا منهم شيئا ، فقال سعد : يا رسول الله ، أعطيت فلانا وفلانا ولم تعط فلانا شيئا ، وهو مؤمن ؟ فقال النبي - صلى الله عليه وسلم - : \" أو مسلم \" حتى أعادها سعد ثلاثا ، والنبي - صلى الله عليه وسلم - يقول : \" أو مسلم \" ثم قال النبي - صلى الله عليه وسلم - : \" إني لأعطي رجالا وأدع من هو أحب إلي منهم فلم أعطه شيئا ; مخافة أن يكبوا في النار على وجوههم \" .\nأخرجاه في الصحيحين من حديث الزهري ، به .\nفقد فرق النبي - صلى الله عليه وسلم - بين المسلم والمؤمن ، فدل على أن الإيمان أخص من الإسلام . وقد قررنا ذلك بأدلته في أول شرح كتاب الإيمان من \" صحيح البخاري \" ولله الحمد والمنة . ودل ذلك على أن ذاك الرجل كان مسلما ليس منافقا ; لأنه تركه من العطاء ووكله إلى ما هو فيه من الإسلام ، فدل هذا على أن هؤلاء الأعراب المذكورين في هذه الآية ليسوا بمنافقين ، وإنما هم مسلمون لم يستحكم الإيمان في قلوبهم ، فادعوا لأنفسهم مقاما أعلى مما وصلوا إليه ، فأدبوا في ذلك . وهذا معنى قول ابن عباس وإبراهيم النخعي ، وقتادة ، واختاره ابن جرير . وإنما قلنا هذا لأن البخاري رحمه الله ذهب إلى أن هؤلاء كانوا منافقين يظهرون الإيمان وليسوا كذلك . وقد روي عن سعيد بن جبير ، ومجاهد ، وابن زيد أنهم قالوا في قوله : ( ولكن قولوا أسلمنا ) أي : استسلمنا خوف القتل والسباء . قال مجاهد : نزلت في بني أسد بن خزيمة . وقال قتادة : نزلت في قوم امتنوا بإيمانهم على رسول الله - صلى الله عليه وسلم - .\nوالصحيح الأول أنهم قوم ادعوا لأنفسهم مقام الإيمان ، ولم يحصل لهم بعد ، فأدبوا وأعلموا أن ذلك لم يصلوا إليه بعد ، ولو كانوا منافقين لعنفوا وفضحوا ، كما ذكر المنافقون في سورة براءة . وإنما قيل لهؤلاء تأديبا : ( قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم ) أي : لم تصلوا إلى حقيقة الإيمان بعد .\nثم قال : ( وإن تطيعوا الله ورسوله لا يلتكم من أعمالكم [ شيئا ] ) أي : لا ينقصكم من أجوركم شيئا ، كقوله : ( وما ألتناهم من عملهم من شيء ) [ الطور : 21 ] .\nوقوله : ( إن الله غفور رحيم ) أي : لمن تاب إليه وأناب .\n                                    ",
      "qortoby": "۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُواْ وَلَٰكِن قُولُوٓاْ أَسۡلَمۡنَا وَلَمَّا يَدۡخُلِ ٱلۡإِيمَٰنُ فِي قُلُوبِكُمۡۖ وَإِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ لَا يَلِتۡكُم مِّنۡ أَعۡمَٰلِكُمۡ شَيۡ‍ًٔاۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٤١\n                                    \n                                    \n                                    قوله تعالى : قالت الأعراب آمنا قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم وإن تطيعوا الله ورسوله لا يلتكم من أعمالكم شيئا إن الله غفور رحيم .\nنزلت في أعراب من بني أسد بن خزيمة قدموا على رسول الله - صلى الله عليه وسلم - في سنة جدبة وأظهروا الشهادتين ولم يكونوا مؤمنين في السر . وأفسدوا طرق المدينة بالعذرات وأغلوا أسعارها ، وكانوا يقولون لرسول الله - صلى الله عليه وسلم - : أتيناك بالأثقال والعيال ولم نقاتلك كما قاتلك بنو فلان فأعطنا من الصدقة ، وجعلوا يمنون عليه فأنزل الله تعالى فيهم هذه الآية . وقال ابن عباس : نزلت في أعراب أرادوا أن يتسموا باسم الهجرة قبل أن يهاجروا ، فأعلم الله أن لهم أسماء الأعراب لا أسماء المهاجرين . وقال السدي : نزلت في الأعراب المذكورين في سورة الفتح : أعراب مزينة وجهينة وأسلم وغفار والديل وأشجع ، قالوا آمنا ليأمنوا على أنفسهم وأموالهم ، فلما استنفروا إلى المدينة تخلفوا ، فنزلت .\nوبالجملة فالآية خاصة لبعض الأعراب ; لأن منهم من يؤمن بالله واليوم الآخر كما وصف الله تعالى . ومعنى ولكن قولوا أسلمنا أي : استسلمنا خوف القتل والسبي ، وهذه صفة المنافقين ; لأنهم أسلموا في ظاهر إيمانهم ولم تؤمن قلوبهم ، وحقيقة الإيمان التصديق بالقلب . وأما الإسلام فقبول ما أتى به النبي - صلى الله عليه وسلم - في الظاهر ، وذلك يحقن الدم .\nوإن تطيعوا الله ورسوله يعني إن تخلصوا الإيمان لا يلتكم أي : لا ينقصكم . من أعمالكم شيئا لاته يليته ويلوته : نقصه . وقرأ أبو عمرو ( لا يألتكم ) بالهمزة ، من ألت يألت ألتا ، وهو اختيار أبي حاتم ، اعتبارا بقوله تعالى : وما ألتناهم من عملهم من شيء قال الشاعر :\nأبلغ بني ثعل عني مغلغلة جهد الرسالة لا ألتا ولا كذبا\nواختار الأولى أبو عبيد . قال رؤبة :\nوليلة ذات ندى سريت ولم يلتني عن سراها ليت\nأي : لم يمنعني عن سراها مانع ، وكذلك ألاته عن وجهه ، فعل وأفعل بمعنى . ويقال أيضا : ما ألاته من عمله شيئا ، أي : ما نقصه ، مثل ألته ، قاله الفراء . وأنشد [ للشاعر عدي بن زيد ] :\nويأكلن ما أعنى الولي فلم يلت كأن بحافات النهاء المزارعا\nقوله : فلم يلت أي : لم ينقص منه شيئا . وأعنى بمعنى أنبت ، يقال : ما أعنت الأرض شيئا ، أي : ما أنبتت . والولي المطر بعد الوسمي ، سمي وليا لأنه يلي الوسمي . ولم يقل : لا يألتاكم ، لأن طاعة الله تعالى طاعة الرسول .\n                                    ",
      "saadi": "۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُواْ وَلَٰكِن قُولُوٓاْ أَسۡلَمۡنَا وَلَمَّا يَدۡخُلِ ٱلۡإِيمَٰنُ فِي قُلُوبِكُمۡۖ وَإِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ لَا يَلِتۡكُم مِّنۡ أَعۡمَٰلِكُمۡ شَيۡ‍ًٔاۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٤١\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن مقالة الأعراب، الذين دخلوا في الإسلام في عهد رسول الله صلى الله عليه وسلم، دخولاً من غير بصيرة، ولا قيام بما يجب ويقتضيه الإيمان، أنهم ادعوا مع هذا وقالوا: آمنا أي: إيمانًا كاملاً، مستوفيًا لجميع أموره هذا موجب هذا الكلام، فأمر الله رسوله، أن يرد عليهم، فقال: { قُلْ لَمْ تُؤْمِنُوا } أي: لا تدعوا لأنفسكم مقام الإيمان، ظاهرًا، وباطنًا، كاملاً.\n{ وَلَكِنْ قُولُوا أَسْلَمْنَا } أي: دخلنا في الإسلام، واقتصروا على ذلك.\n{ و } السبب في ذلك، أنه { لَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ } وإنما آمنتم خوفًا، أو رجاء، أو نحو ذلك، مما هو السبب في إيمانكم، فلذلك لم تدخل بشاشة الإيمان في قلوبكم، وفي قوله: { وَلَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ } أي: وقت هذا الكلام، الذي صدر منكم فكان فيه إشارة إلى أحوالهم بعد ذلك، فإن كثيرًا منهم، من الله عليهم بالإيمان الحقيقي، والجهاد في سبيل الله، { وَإِنْ تُطِيعُوا اللَّهَ وَرَسُولَهُ } بفعل خير، أو ترك شر { لَا يَلِتْكُمْ مِنْ أَعْمَالِكُمْ شَيْئًا } أي: لا ينقصكم منها، مثقال ذرة، بل يوفيكم إياها، أكمل ما تكون لا تفقدون منها، صغيرًا، ولا كبيرًا، { إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } أي: غفور لمن تاب إليه وأناب، رحيم به، حيث قبل توبته.\n                                    "
    }
  },
  {
    "id": 14,
    "versesNumber": 15,
    "souraName": "Al-Hujurat.html",
    "contnent": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ يَرۡتَابُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِۚ أُوْلَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ ٥١",
    "tafsier": {
      "ibnkther": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ يَرۡتَابُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِۚ أُوْلَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ ٥١\n                                    \n                                    \n                                    وقوله : ( إنما المؤمنون ) أي : إنما المؤمنون الكمل ( الذين آمنوا بالله ورسوله ثم لم يرتابوا ) أي : لم يشكوا ولا تزلزلوا ، بل ثبتوا على حال واحدة ، وهي التصديق المحض ، ( وجاهدوا بأموالهم وأنفسهم في سبيل الله ) أي : وبذلوا مهجهم ونفائس أموالهم في طاعة الله ورضوانه ، ( أولئك هم الصادقون ) أي : في قولهم إذا قالوا : \" إنهم مؤمنون \" ، لا كبعض الأعراب الذين ليس معهم من الدين إلا الكلمة الظاهرة .\nوقال الإمام أحمد : حدثنا يحيى بن غيلان ، حدثنا رشدين ، حدثني عمرو بن الحارث ، عن أبي السمح ، عن أبي الهيثم ، عن أبي سعيد قال : إن النبي - صلى الله عليه وسلم - قال : \" المؤمنون في الدنيا على ثلاثة أجزاء : [ الذين ] آمنوا بالله ورسوله ثم لم يرتابوا وجاهدوا بأموالهم وأنفسهم في سبيل الله . والذي يأمنه الناس على أموالهم وأنفسهم . ثم الذي إذا أشرف على طمع تركه لله عز وجل \" .\n                                    ",
      "qortoby": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ يَرۡتَابُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِۚ أُوْلَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ ٥١\n                                    \n                                    \n                                    قوله تعالى : إنما المؤمنون الذين آمنوا بالله ورسوله ثم لم يرتابوا أي : صدقوا ولم يشكوا وحققوا ذلك بالجهاد والأعمال الصالحة . أولئك هم الصادقون في إيمانهم ، لا من أسلم خوف القتل ورجاء الكسب . فلما نزلت حلف الأعراب أنهم مؤمنون في السر والعلانية وكذبوا ، فنزلت .\n                                    ",
      "saadi": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ يَرۡتَابُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِۚ أُوْلَٰٓئِكَ هُمُ ٱلصَّٰدِقُونَ ٥١\n                                        \n                                        \n                                        \n                                        { إِنَّمَا الْمُؤْمِنُونَ } أي: على الحقيقة { الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرتَابُوا وَجَاهَدُوا بِأمْوَالِهِمْ وَأنْفُسِهُم في سبيل الله } أي: من جمعوا بين الإيمان والجهاد في سبيله، فإن من جاهد الكفار، دل ذلك، على الإيمان التام في القلب، لأن من جاهد غيره على الإسلام، والقيام بشرائعه، فجهاده لنفسه على ذلك، من باب أولى وأحرى؛ ولأن من لم يقو على الجهاد، فإن ذلك، دليل على ضعف إيمانه، وشرط تعالى في الإيمان عدم الريب، وهو الشك، لأن الإيمان النافع هو الجزم اليقيني، بما أمر الله بالإيمان به، الذي لا يعتريه شك، بوجه من الوجوه.\nوقوله: { أُولَئِكَ هُمُ الصَّادِقُونَ } أي: الذين صدقوا إيمانهم بأعمالهم الجميلة، فإن الصدق، دعوى كبيرة في كل شيء يدعى يحتاج صاحبه إلى حجة وبرهان، وأعظم ذلك، دعوى الإيمان، الذي هو مدار السعادة، والفوز الأبدي، والفلاح السرمدي، فمن ادعاه، وقام بواجباته، ولوازمه، فهو الصادق المؤمن حقًا، ومن لم يكن كذلك، علم أنه ليس بصادق في دعواه، وليس لدعواه فائدة، فإن الإيمان في القلب لا يطلع عليه إلا الله تعالى.\nفإثباته ونفيه، من باب تعليم الله بما في القلب، وهذا سوء أدب، وظن بالله.\n                                    "
    }
  },
  {
    "id": 15,
    "versesNumber": 16,
    "souraName": "Al-Hujurat.html",
    "contnent": "قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمۡ وَٱللَّهُ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ ٦١",
    "tafsier": {
      "ibnkther": "قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمۡ وَٱللَّهُ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ ٦١\n                                    \n                                    \n                                    وقوله : ( قل أتعلمون الله بدينكم ) أي : أتخبرونه بما في ضمائركم ، ( والله يعلم ما في السماوات وما في الأرض ) أي : لا يخفى عليه مثقال ذرة في الأرض ولا في السماء ، ولا أصغر من ذلك ولا أكبر ، ( والله بكل شيء عليم ) .\n                                    ",
      "qortoby": "قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمۡ وَٱللَّهُ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ ٦١\n                                    \n                                    \n                                    الذي أنتم عليه .\n                                    ",
      "saadi": "قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمۡ وَٱللَّهُ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٞ ٦١\n                                        \n                                        \n                                        \n                                        { قُلْ أَتُعَلِّمُونَ اللَّهَ بِدِينِكُمْ وَاللَّهُ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ } وهذا شامل للأشياء كلها، التي من جملتها، ما في القلوب من الإيمان والكفران، والبر والفجور، فإنه تعالى، يعلم ذلك كله، ويجازي عليه، إن خيرًا فخير، وإن شرًا فشر.\n                                    "
    }
  },
  {
    "id": 16,
    "versesNumber": 17,
    "souraName": "Al-Hujurat.html",
    "contnent": "يَمُنُّونَ عَلَيۡكَ أَنۡ أَسۡلَمُواْۖ قُل لَّا تَمُنُّواْ عَلَيَّ إِسۡلَٰمَكُمۖ بَلِ ٱللَّهُ يَمُنُّ عَلَيۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِيمَٰنِ إِن كُنتُمۡ صَٰدِقِينَ ٧١",
    "tafsier": {
      "ibnkther": "يَمُنُّونَ عَلَيۡكَ أَنۡ أَسۡلَمُواْۖ قُل لَّا تَمُنُّواْ عَلَيَّ إِسۡلَٰمَكُمۖ بَلِ ٱللَّهُ يَمُنُّ عَلَيۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِيمَٰنِ إِن كُنتُمۡ صَٰدِقِينَ ٧١\n                                    \n                                    \n                                    ثم قال [ تعالى ] : ( يمنون عليك أن أسلموا ) ، يعني : الأعراب [ الذين ] يمنون بإسلامهم ومتابعتهم ونصرتهم على الرسول ، يقول الله ردا عليهم : ( قل لا تمنوا علي إسلامكم ) ، فإن نفع ذلك إنما يعود عليكم ، ولله المنة عليكم فيه ، ( بل الله يمن عليكم أن هداكم للإيمان إن كنتم صادقين ) أي : في دعواكم ذلك ، كما قال النبي - صلى الله عليه وسلم - للأنصار يوم حنين : \" يا معشر الأنصار ، ألم أجدكم ضلالا فهداكم الله بي ؟ وكنتم متفرقين فألفكم الله بي ؟ وعالة فأغناكم الله بي ؟ \" كلما قال شيئا قالوا : الله ورسوله أمن .\nوقال الحافظ أبو بكر البزار : حدثنا إبراهيم بن سعيد الجوهري ، حدثنا يحيى بن سعيد الأموي ، عن محمد بن قيس ، عن أبي عون ، عن سعيد بن جبير ، عن ابن عباس [ رضي الله عنهما ] قال : جاءت بنو أسد إلى رسول الله - صلى الله عليه وسلم - فقالوا : يا رسول الله ، أسلمنا وقاتلتك العرب ، ولم نقاتلك ، فقال رسول الله - صلى الله عليه وسلم - : \" إن فقههم قليل ، وإن الشيطان ينطق على ألسنتهم \" . ونزلت هذه الآية : ( يمنون عليك أن أسلموا قل لا تمنوا علي إسلامكم بل الله يمن عليكم أن هداكم للإيمان إن كنتم صادقين )\nثم قال : لا نعلمه يروى إلا من هذا الوجه ، ولا نعلم روى أبو عون محمد بن عبيد الله ، عن سعيد بن جبير ، غير هذا الحديث .\n                                    ",
      "qortoby": "يَمُنُّونَ عَلَيۡكَ أَنۡ أَسۡلَمُواْۖ قُل لَّا تَمُنُّواْ عَلَيَّ إِسۡلَٰمَكُمۖ بَلِ ٱللَّهُ يَمُنُّ عَلَيۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِيمَٰنِ إِن كُنتُمۡ صَٰدِقِينَ ٧١\n                                    \n                                    \n                                    قوله تعالى : يمنون عليك أن أسلموا إشارة إلى قولهم : جئناك بالأثقال والعيال . و ( أن ) في موضع نصب على تقدير لأن أسلموا . قل لا تمنوا علي إسلامكم أي بإسلامكم . بل الله يمن عليكم أن هداكم للإيمان ( أن ) موضع نصب ، تقديره بأن . وقيل : لأن . وفي مصحف عبد الله ( إذ هداكم ) إن كنتم صادقين صادقين أنكم مؤمنون . وقرأ عاصم ( إن هداكم ) بالكسر ، وفيه بعد ، لقوله : إن كنتم صادقين ولا يقال يمن عليكم أن يهديكم إن صدقتم . والقراءة الظاهرة أن هداكم وهذا لا يدل على أنهم كانوا مؤمنين ; لأن تقدير الكلام : إن آمنتم فذلك منة الله عليكم .\n                                    ",
      "saadi": "يَمُنُّونَ عَلَيۡكَ أَنۡ أَسۡلَمُواْۖ قُل لَّا تَمُنُّواْ عَلَيَّ إِسۡلَٰمَكُمۖ بَلِ ٱللَّهُ يَمُنُّ عَلَيۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِيمَٰنِ إِن كُنتُمۡ صَٰدِقِينَ ٧١\n                                        \n                                        \n                                        \n                                        هذه حالة من أحوال من ادعى لنفسه الإيمان، وليس به، فإنه إما أن يكون ذلك تعليمًا لله، وقد علم أنه عالم بكل شيء، وإما أن يكون قصدهم بهذا الكلام، المنة على رسوله، وأنهم قد بذلوا له [وتبرعوا] بما ليس من مصالحهم، بل هو من حظوظه الدنيوية، وهذا تجمل بما لا يجمل، وفخر بما لا ينبغي لهم أن يفتخروا على رسوله به فإن المنة لله تعالى عليهم، فكما أنه تعالى يمن عليهم، بالخلق والرزق، والنعم الظاهرة والباطنة، فمنته عليهم بهدايتهم إلى الإسلام، ومنته عليهم بالإيمان، أعظم من كل شيء، ولهذا قال تعالى: { يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا قُلْ لَا تَمُنُّوا عَلَيَّ إِسْلَامَكُمْ بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ إِنْ كُنْتُمْ صَادِقِينَ } .\n                                    "
    }
  },
  {
    "id": 17,
    "versesNumber": 18,
    "souraName": "Al-Hujurat.html",
    "contnent": "إِنَّ ٱللَّهَ يَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِيرُۢ بِمَا تَعۡمَلُونَ ٨١",
    "tafsier": {
      "ibnkther": "إِنَّ ٱللَّهَ يَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِيرُۢ بِمَا تَعۡمَلُونَ ٨١\n                                    \n                                    \n                                    ثم كرر الإخبار بعلمه بجميع الكائنات ، وبصره بأعمال المخلوقات فقال : ( إن الله يعلم غيب السماوات والأرض والله بصير بما تعملون )\nآخر تفسير الحجرات ، ولله الحمد والمنة\n                                    ",
      "qortoby": "إِنَّ ٱللَّهَ يَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِيرُۢ بِمَا تَعۡمَلُونَ ٨١\n                                    \n                                    \n                                    إن الله يعلم غيب السماوات والأرض والله بصير بما تعملون قرأ ابن كثير وابن محيصن وأبو عمرو بالياء على الخبر ، ردا على قوله : قالت الأعراب الباقون بالتاء على الخطاب\nتم بعون الله تعالى الجزء السادس عشر من تفسير القرطبي .\nيتلوه إن شاء الله تعالى الجزء السابع عشر ، وأوله : \" سورة ( ق ) \" .\n                                    ",
      "saadi": "إِنَّ ٱللَّهَ يَعۡلَمُ غَيۡبَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِيرُۢ بِمَا تَعۡمَلُونَ ٨١\n                                        \n                                        \n                                        \n                                        { إِنَّ اللَّهَ يَعْلَمُ غَيْبَ السَّمَاوَاتِ وَالْأَرْضِ } أي: الأمور الخفية فيهما، التي تخفى على الخلق، كالذي في لجج البحار، ومهامه القفار، وما جنه الليل أو واراه النهار، يعلم قطرات الأمطار، وحبات الرمال، ومكنونات الصدور، وخبايا الأمور.\n{ وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين }\n{ وَاللَّهُ بَصِيرٌ بِمَا تَعْمَلُونَ } يحصي عليكم أعمالكم، ويوفيكم إياها، ويجازيكم عليها بما تقتضيه رحمته الواسعة، وحكمته البالغة.\nتم تفسير سورة الحجرات\nبعون الله ومنه وجوده وكرمه،\nفلك اللهم من الحمد أكمله وأتمه،\nومن الجود أفضله وأعمه\n                                    "
    }
  }
]