[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Al-Munafiqun.html",
    "contnent": "إِذَا جَآءَكَ ٱلۡمُنَٰفِقُونَ قَالُواْ نَشۡهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِۗ وَٱللَّهُ يَعۡلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشۡهَدُ إِنَّ ٱلۡمُنَٰفِقِينَ لَكَٰذِبُونَ ١ ",
    "tafsier": {
      "ibnkther": "إِذَا جَآءَكَ ٱلۡمُنَٰفِقُونَ قَالُواْ نَشۡهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِۗ وَٱللَّهُ يَعۡلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشۡهَدُ إِنَّ ٱلۡمُنَٰفِقِينَ لَكَٰذِبُونَ ١\n                                    \n                                    \n                                    تفسير سورة المنافقون وهي مدنية\nيقول تعالى مخبرا عن المنافقين : إنهم إنما يتفوهون بالإسلام إذا جاءوا النبي - صلى الله عليه وسلم - فأما في باطن الأمر فليسوا كذلك ، بل على الضد من ذلك ; ولهذا قال تعالى : ( إذا جاءك المنافقون قالوا نشهد إنك لرسول الله ) أي : إذا حضروا عندك واجهوك بذلك ، وأظهروا لك ذلك ، وليسوا كما يقولون : ولهذا اعترض بجملة مخبرة أنه رسول الله ، فقال الله : ( والله يعلم إنك لرسوله )\nثم قال : ( والله يشهد إن المنافقين لكاذبون ) أي : فيما أخبروا به ، وإن كان مطابقا للخارج ; لأنهم لم يكونوا يعتقدون صحة ما يقولون ولا صدقه ; ولهذا كذبهم بالنسبة إلى اعتقادهم .\n                                    ",
      "qortoby": "إِذَا جَآءَكَ ٱلۡمُنَٰفِقُونَ قَالُواْ نَشۡهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِۗ وَٱللَّهُ يَعۡلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشۡهَدُ إِنَّ ٱلۡمُنَٰفِقِينَ لَكَٰذِبُونَ ١\n                                    \n                                    \n                                    سورة المنافقون .\nمدنية في قول الجميع ، وهي إحدى عشرة آية\nبسم الله الرحمن الرحيم\nإذا جاءك المنافقون قالوا نشهد إنك لرسول الله والله يعلم إنك لرسوله والله يشهد إن المنافقين لكاذبون\nقوله تعالى : إذا جاءك المنافقون قالوا نشهد إنك لرسول الله روى البخاري عن زيد بن أرقم قال : كنت مع عمي فسمعت عبد الله بن أبي ابن سلول يقول : لا تنفقوا على من عند رسول الله حتى ينفضوا . وقال : لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل فذكرت ذلك لعمي فذكر عمي لرسول الله صلى الله عليه وسلم ; فأرسل رسول الله صلى الله عليه وسلم إلى عبد الله بن أبي وأصحابه فحلفوا ما قالوا ; فصدقهم رسول الله صلى الله عليه وسلم وكذبني . فأصابني هم لم يصبني مثله ، فجلست في بيتي فأنزل الله عز وجل : إذا جاءك المنافقون إلى قوله : هم الذين يقولون لا تنفقوا على من عند رسول الله إلى قوله : ليخرجن الأعز منها الأذل فأرسل إلي رسول الله صلى الله عليه وسلم ، ثم قال : \" إن الله قد صدقك \" خرجه الترمذي قال : هذا حديث حسن صحيح . وفي الترمذي عن زيد بن أرقم قال : غزونا مع رسول الله صلى الله عليه وسلم وكان معنا أناس من الأعراب فكنا نبدر الماء ، وكان الأعراب يسبقونا إليه فيسبق الأعرابي أصحابه فيملأ الحوض ويجعل حوله حجارة ، ويجعل النطع عليه حتى تجيء أصحابه . قال : فأتى رجل من الأنصار أعرابيا فأرخى زمام ناقته لتشرب فأبى أن يدعه ، فانتزع حجرا فغاض الماء ; فرفع الأعرابي خشبة فضرب بها رأس الأنصاري فشجه ، فأتى عبد الله بن أبي رأس المنافقين فأخبره - وكان من أصحابه - فغضب عبد الله بن أبي ثم قال : لا تنفقوا على من عند رسول الله حتى ينفضوا من حوله - يعني الأعراب - وكانوا يحضرون رسول الله صلى الله عليه وسلم عند الطعام ; فقال عبد الله : إذا انفضوا من عند محمد فأتوا محمدا بالطعام ، فليأكل هو ومن عنده . ثم قال لأصحابه : لئن رجعتم إلى المدينة ليخرجن الأعز منها الأذل . قال زيد : وأنا ردف عمي فسمعت عبد الله بن أبي فأخبرت عمي ، فانطلق فأخبر رسول الله صلى الله عليه وسلم ; فأرسل إليه رسول الله صلى الله عليه وسلم فحلف وجحد . قال : فصدقه رسول الله صلى الله عليه وسلم وكذبني . قال : فجاء عمي إلي فقال : ما أردت إلى أن مقتك رسول الله صلى الله عليه وسلم وكذبك والمنافقون . قال : فوقع علي من جرأتهم ما لم يقع على أحد . قال : فبينما أنا أسير مع رسول الله صلى الله عليه وسلم في سفر قد خففت برأسي من الهم إذ أتاني رسول الله صلى الله عليه وسلم فعرك أذني وضحك في وجهي ; فما كان يسرني أن لي بها الخلد في الدنيا . ثم إن أبا بكر لحقني فقال : ما قال لك رسول الله صلى الله عليه وسلم ؟ قلت : ما قال شيئا إلا أنه عرك أذني وضحك في وجهي ; فقال : أبشر ! ثم لحقني عمر فقلت له مثل قولي لأبي بكر . فلما أصبحنا قرأ رسول الله صلى الله عليه وسلم سورة المنافقين . قال أبو عيسى : هذا حديث حسن صحيح . وسئل حذيفة بن اليمان عن المنافق ، فقال : الذي يصف الإسلام ولا يعمل به . وهو اليوم شر منهم على عهد رسول الله صلى الله عليه وسلم ; لأنهم كانوا يكتمونه وهم اليوم يظهرونه . وفي الصحيحين عن أبي هريرة أن النبي صلى الله عليه وسلم قال : \" آية المنافق ثلاث : إذا حدث كذب ، وإذا وعد أخلف ، وإذا اؤتمن خان \" . وعن عبد الله بن عمرو أن النبي صلى الله عليه وسلم قال : \" أربع من كن فيه كان منافقا خالصا ، ومن كانت فيه خصلة منهن كان فيه خصلة من النفاق حتى يدعها : إذا اؤتمن خان ، وإذا حدث كذب ، وإذا عاهد غدر ، وإذا خاصم فجر \" . أخبر عليه السلام أن من جمع هذه الخصال كان منافقا ، وخبره صدق . وروي عن الحسن أنه ذكر له هذا الحديث فقال : إن بني يعقوب حدثوا فكذبوا ، ووعدوا فأخلفوا ، واؤتمنوا فخانوا . إنما هذا القول من النبي صلى الله عليه وسلم على سبيل الإنذار للمسلمين ، والتحذير لهم أن يعتادوا هذه الخصال ; شفقا أن تقضي بهم إلى النفاق . وليس المعنى : أن من بدرت منه هذه الخصال من غير اختيار واعتياد أنه منافق . وقد مضى في سورة \" التوبة \" القول في هذا مستوفى والحمد لله .\nوقال رسول الله صلى الله عليه وسلم : \" المؤمن إذا حدث صدق ، وإذا وعد أنجز ، وإذا اؤتمن وفى \" . والمعنى : المؤمن الكامل إذا حدث صدق . والله أعلم .\nقوله تعالى : قالوا نشهد إنك لرسول الله قيل : معنى نشهد نحلف . فعبر عن الحلف بالشهادة ; لأن كل واحد من الحلف والشهادة إثبات لأمر مغيب ; ومنه قول قيس بن ذريح .\nوأشهد عند الله أني أحبها فهذا لها عندي فما عندها ليا\nويحتمل أن يكون ذلك محمولا على ظاهره أنهم يشهدون أن محمدا رسول الله صلى الله عليه وسلم اعترافا بالإيمان ونفيا للنفاق عن أنفسهم ، وهو الأشبه .\nوالله يعلم إنك لرسوله كما قالوه بألسنتهم .\nوالله يشهد إن المنافقين لكاذبون أي فيما أظهروا من شهادتهم وحلفهم بألسنتهم .\nوقال الفراء : والله يشهد إن المنافقين لكاذبون بضمائرهم ، فالتكذيب راجع إلى الضمائر . وهذا يدل على أن الإيمان تصديق القلب ، وعلى أن الكلام الحقيقي كلام القلب . ومن قال شيئا واعتقد خلافه فهو كاذب . وقد مضى هذا المعنى في أول \" البقرة \" مستوفى وقيل : أكذبهم الله في أيمانهم وهو قوله تعالى : يحلفون بالله إنهم لمنكم وما هم منكم .\n\n                                    ",
      "saadi": "إِذَا جَآءَكَ ٱلۡمُنَٰفِقُونَ قَالُواْ نَشۡهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِۗ وَٱللَّهُ يَعۡلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشۡهَدُ إِنَّ ٱلۡمُنَٰفِقِينَ لَكَٰذِبُونَ ١\n                                        \n                                        \n                                        \n                                        لما قدم النبي صلى الله عليه وسلم المدينة، وكثر المسلمون في المدينة واعتز الإسلام بها ، صار أناس من أهلها من الأوس والخزرج، يظهرون الإيمان ويبطنون الكفر، ليبقى جاههم، وتحقن دماؤهم، وتسلم أموالهم، فذكر الله من أوصافهم ما به يعرفون، لكي يحذر العباد منهم، ويكونوا منهم على بصيرة، فقال: { إِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا } على وجه الكذب: { نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ } وهذه الشهادة من المنافقين على وجه الكذب والنفاق، مع أنه لا حاجة لشهادتهم في تأييد رسوله، فإن { اللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ } في قولهم ودعواهم، وأن ذلك ليس بحقيقة منهم.\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Al-Munafiqun.html",
    "contnent": "ٱتَّخَذُوٓاْ أَيۡمَٰنَهُمۡ جُنَّةٗ فَصَدُّواْ عَن سَبِيلِ ٱللَّهِۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ ٢",
    "tafsier": {
      "ibnkther": "ٱتَّخَذُوٓاْ أَيۡمَٰنَهُمۡ جُنَّةٗ فَصَدُّواْ عَن سَبِيلِ ٱللَّهِۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ ٢\n                                    \n                                    \n                                    وقوله : ( اتخذوا أيمانهم جنة فصدوا عن سبيل الله ) أي : اتقوا الناس بالأيمان الكاذبة ، والحلفات الآثمة ، ليصدقوا فيما يقولون ، فاغتر بهم من لا يعرف جلية أمرهم ، فاعتقدوا أنهم مسلمون فربما اقتدى بهم فيما يفعلون وصدقهم فيما يقولون ، وهم من شأنهم أنهم كانوا في الباطن لا يألون الإسلام وأهله خبلا فحصل بهذا القدر ضرر كبير على كثير من الناس ولهذا قال تعالى : ( فصدوا عن سبيل الله إنهم ساء ما كانوا يعملون ) ولهذا كان الضحاك بن مزاحم يقرؤها : \" اتخذوا إيمانهم جنة \" أي : تصديقهم الظاهر جنة ، أي : تقية يتقون به القتل . والجمهور يقرؤها : ( أيمانهم ) جمع يمين .\n                                    ",
      "qortoby": "ٱتَّخَذُوٓاْ أَيۡمَٰنَهُمۡ جُنَّةٗ فَصَدُّواْ عَن سَبِيلِ ٱللَّهِۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : اتخذوا أيمانهم جنة فصدوا عن سبيل الله إنهم ساء ما كانوا يعملون\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : اتخذوا أيمانهم جنة أي سترة . وليس يرجع إلى قوله : نشهد إنك لرسول الله وإنما يرجع إلى سبب الآية التي نزلت عليه ، حسب ما ذكره البخاري والترمذي عن ابن أبي أنه حلف ما قال وقد قال . وقال الضحاك : يعني حلفهم بالله إنهم لمنكم . وقيل : يعني بأيمانهم ما أخبر الرب عنهم في سورة \" التوبة \" إذ قال : يحلفون بالله ما قالوا .\nالثانية : من قال : أقسم بالله أو أشهد بالله أو أعزم بالله أو أحلف بالله ، أو أقسمت بالله أو أشهدت بالله أو أعزمت بالله أو أحلفت بالله ، فقال في ذلك كله \" بالله \" فلا خلاف أنها يمين . وكذلك عند مالك وأصحابه إن قال : أقسم أو أشهد أو أعزم أو أحلف ، ولم يقل \" بالله \" ، إذا أراد \" بالله \" . وإن لم يرد \" بالله \" فليس بيمين . وحكاه الكيا عن الشافعي ، قال الشافعي : إذا قال : أشهد بالله ، ونوى اليمين كان يمينا . وقال أبو حنيفة وأصحابه : لو قال : أشهد بالله ، لقد كان كذا ، كان يمينا ، ولو قال : أشهد لقد كان كذا ، دون النية كان يمينا لهذه الآية ، لأن الله تعالى ذكر منهم الشهادة ثم قال : اتخذوا أيمانهم جنة .\nوعند الشافعي لا يكون ذلك يمينا وإن نوى اليمين ، لأن قوله تعالى : اتخذوا أيمانهم جنة ليس يرجع إلى قوله : \" قالوا نشهد \" وإنما يرجع إلى ما في \" التوبة \" من قوله تعالى : يحلفون بالله ما قالوا .\nالثالثة : قوله تعالى : فصدوا عن سبيل الله أي أعرضوا ، وهو من الصدود . أو صرفوا المؤمنين عن إقامة حكم الله عليهم من القتل والسبي وأخذ الأموال ، فهو من الصد ، أو منعوا الناس عن الجهاد بأن يتخلفوا ويقتدي بهم غيرهم . وقيل : فصدوا اليهود والمشركين عن الدخول في الإسلام ، بأن يقولوا ها نحن كافرون بهم ، ولو كان محمد حقا لعرف هذا منا ، ولجعلنا نكالا . فبين الله أن حالهم لا يخفى عليه ، ولكن حكمه أن من أظهر الإيمان أجري عليه في الظاهر حكم الإيمان .\nإنهم ساء ما كانوا يعملون أي بئست أعمالهم الخبيثة - من نفاقهم وأيمانهم الكاذبة وصدهم عن سبيل الله - أعمالا .\n                                    ",
      "saadi": "ٱتَّخَذُوٓاْ أَيۡمَٰنَهُمۡ جُنَّةٗ فَصَدُّواْ عَن سَبِيلِ ٱللَّهِۚ إِنَّهُمۡ سَآءَ مَا كَانُواْ يَعۡمَلُونَ ٢\n                                        \n                                        \n                                        \n                                        { اتَّخَذُوا أَيْمَانَهُمْ جُنَّةً } أي: ترسًا يتترسون بها من نسبتهم إلى النفاق.\nفصدوا عن سبيله بأنفسهم، وصدوا غيرهم ممن يخفى عليه حالهم، { إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ } حيث أظهروا الإيمان وأبطنوا الكفر، وأقسموا على ذلك وأوهموا صدقهم.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Al-Munafiqun.html",
    "contnent": "ذَٰلِكَ بِأَنَّهُمۡ ءَامَنُواْ ثُمَّ كَفَرُواْ فَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ ٣",
    "tafsier": {
      "ibnkther": "ذَٰلِكَ بِأَنَّهُمۡ ءَامَنُواْ ثُمَّ كَفَرُواْ فَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ ٣\n                                    \n                                    \n                                    وقوله ( ذلك بأنهم آمنوا ثم كفروا فطبع على قلوبهم فهم لا يفقهون ) أي : إنما قدر عليهم النفاق لرجوعهم عن الإيمان إلى الكفران ، واستبدالهم الضلالة بالهدى ( فطبع على قلوبهم فهم لا يفقهون ) أي : فلا يصل إلى قلوبهم هدى ، ولا يخلص إليها خير ، فلا تعي ولا تهتدي .\n                                    ",
      "qortoby": "ذَٰلِكَ بِأَنَّهُمۡ ءَامَنُواْ ثُمَّ كَفَرُواْ فَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ ٣\n                                    \n                                    \n                                    قوله تعالى : ذلك بأنهم آمنوا ثم كفروا فطبع على قلوبهم فهم لا يفقهون\nهذا إعلام من الله تعالى بأن المنافق كافر . أي أقروا باللسان ثم كفروا بالقلب . وقيل : نزلت الآية في قوم آمنوا ثم ارتدوا\nفطبع على قلوبهم أي ختم عليها بالكفر\nفهم لا يفقهون الإيمان ولا الخير . وقرأ زيد بن علي \" فطبع الله على قلوبهم \" .\n                                    ",
      "saadi": "ذَٰلِكَ بِأَنَّهُمۡ ءَامَنُواْ ثُمَّ كَفَرُواْ فَطُبِعَ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَفۡقَهُونَ ٣\n                                        \n                                        \n                                        \n                                        { ذَلِكَ } الذي زين لهم النفاق { بـ } سبب أنهم لا يثبتون على الإيمان.\nبل { آمَنُوا ثُمَّ كَفَرُوا فَطُبِعَ عَلَى قُلُوبِهِمْ } بحيث لا يدخلها الخير أبدًا، { فَهُمْ لَا يَفْقَهُونَ } ما ينفعهم، ولا يعون ما يعود بمصالحهم.\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Al-Munafiqun.html",
    "contnent": "۞ وَإِذَا رَأَيۡتَهُمۡ تُعۡجِبُكَ أَجۡسَامُهُمۡۖ وَإِن يَقُولُواْ تَسۡمَعۡ لِقَوۡلِهِمۡۖ كَأَنَّهُمۡ خُشُبٞ مُّسَنَّدَةٞۖ يَحۡسَبُونَ كُلَّ صَيۡحَةٍ عَلَيۡهِمۡۚ هُمُ ٱلۡعَدُوُّ فَٱحۡذَرۡهُمۡۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ ٤",
    "tafsier": {
      "ibnkther": "۞ وَإِذَا رَأَيۡتَهُمۡ تُعۡجِبُكَ أَجۡسَامُهُمۡۖ وَإِن يَقُولُواْ تَسۡمَعۡ لِقَوۡلِهِمۡۖ كَأَنَّهُمۡ خُشُبٞ مُّسَنَّدَةٞۖ يَحۡسَبُونَ كُلَّ صَيۡحَةٍ عَلَيۡهِمۡۚ هُمُ ٱلۡعَدُوُّ فَٱحۡذَرۡهُمۡۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ ٤\n                                    \n                                    \n                                    ( وإذا رأيتهم تعجبك أجسامهم وإن يقولوا تسمع لقولهم ) أي : كانوا أشكالا حسنة وذوي فصاحة وألسنة ، إذا سمعهم السامع يصغي إلى قولهم لبلاغتهم ، وهم مع ذلك في غاية الضعف ، والخور ، والهلع ، والجزع ، والجبن ; ولهذا قال : ( يحسبون كل صيحة عليهم ) أي : كلما وقع أمر ، أو كائنة ، أو خوف يعتقدون لجبنهم أنه نازل بهم ، كما قال تعالى : ( أشحة عليكم فإذا جاء الخوف رأيتهم ينظرون إليك تدور أعينهم كالذي يغشى عليه من الموت فإذا ذهب الخوف سلقوكم بألسنة حداد أشحة على الخير أولئك لم يؤمنوا فأحبط الله أعمالهم وكان ذلك على الله يسيرا ) [ الأحزاب : 19 ] فهم جهامات وصور بلا معاني . ولهذا قال : ( هم العدو فاحذرهم قاتلهم الله أنى يؤفكون ) أي : كيف يصرفون عن الهدى إلى الضلال .\nوقد قال الإمام أحمد : حدثنا يزيد ، حدثنا عبد الملك بن قدامة الجمحي ، عن إسحاق بن بكر بن أبي الفرات ، عن سعيد بن أبي سعيد المقبري ، . عن أبيه ، عن أبي هريرة رضي الله عنه ، عن النبي - صلى الله عليه وسلم - قال : \" إن للمنافقين علامات يعرفون بها : تحيتهم لعنة ، وطعامهم نهبة ، وغنيمتهم غلول ، ولا يقربون المساجد إلا هجرا ، ولا يأتون الصلاة إلا دبرا ، مستكبرين لا يألفون ولا يؤلفون ، خشب بالليل ، صخب بالنهار \" . وقال يزيد مرة : سخب بالنهار\n\n                                    ",
      "qortoby": "۞ وَإِذَا رَأَيۡتَهُمۡ تُعۡجِبُكَ أَجۡسَامُهُمۡۖ وَإِن يَقُولُواْ تَسۡمَعۡ لِقَوۡلِهِمۡۖ كَأَنَّهُمۡ خُشُبٞ مُّسَنَّدَةٞۖ يَحۡسَبُونَ كُلَّ صَيۡحَةٍ عَلَيۡهِمۡۚ هُمُ ٱلۡعَدُوُّ فَٱحۡذَرۡهُمۡۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ ٤\n                                    \n                                    \n                                    قوله تعالى : وإذا رأيتهم تعجبك أجسامهم وإن يقولوا تسمع لقولهم كأنهم خشب مسندة يحسبون كل صيحة عليهم هم العدو فاحذرهم قاتلهم الله أنى يؤفكون\nقوله تعالى : وإذا رأيتهم تعجبك أجسامهم أي هيئاتهم ومناظرهم .\nوإن يقولوا تسمع لقولهم يعني عبد الله بن أبي . قال ابن عباس : كان عبد الله بن أبي وسيما جسيما صحيحا صبيحا ذلق اللسان ، فإذا قال سمع النبي صلى الله عليه وسلم مقالته . وصفه الله بتمام الصورة وحسن الإبانة . وقال الكلبي : المراد ابن أبي وجد بن قيس ومعتب بن قشير ، كانت لهم أجسام ومنظر وفصاحة . وفي صحيح مسلم : وقوله كأنهم خشب مسندة قال : كانوا رجالا أجمل شيء كأنهم خشب مسندة ، شبههم بخشب مسندة إلى الحائط لا يسمعون ولا يعقلون ، أشباح بلا أرواح وأجسام بلا أحلام . وقيل : شبههم بالخشب التي قد تآكلت فهي مسندة بغيرها لا يعلم ما في بطنها . وقرأ قنبل وأبو عمرو والكسائي \" خشب \" بإسكان الشين . وهي قراءة البراء بن عازب واختيار أبي عبيد ، لأن واحدتها خشبة . كما تقول : بدنة وبدن ، وليس في اللغة فعلة يجمع على فعل . ويلزم من ثقلها أن تقول : البدن ، فتقرأ \" والبدن \" . وذكر اليزيدي أنه جماع الخشباء ، كقوله عز وجل : وحدائق غلبا واحدتها حديقة غلباء . وقرأ الباقون بالتثقيل وهي رواية البزي عن ابن كثير وعياش عن أبي عمرو ، وأكثر الروايات عن عاصم . واختاره أبو حاتم ، كأنه جمع خشاب وخشب ، نحو ثمرة وثمار وثمر . وإن شئت جمعت خشبة على خشب كما قالوا : بدنة وبدن وبدن . وقد روي عن ابن المسيب فتح الخاء والشين في \" خشب \" . قال سيبويه : خشبة وخشب ، مثل بدنة وبدن ، قال : ومثله بغير هاء أسد وأسد ، ووثن ووثن وتقرأ خشب ، وهو جمع الجمع ، خشبة وخشاب وخشب ، مثل ثمرة وثمار وثمر . والإسناد الإمالة ، تقول : أسندت الشيء أي أملته . و \" مسندة \" للتكثير ; أي استندوا إلى الأيمان بحقن دمائهم .\nقوله تعالى : يحسبون كل صيحة عليهم هم العدو أي كل أهل صيحة عليهم هم العدو . ف \" هم العدو \" في موضع المفعول الثاني على أن الكلام لا ضمير فيه . يصفهم بالجبن والخور . قال مقاتل والسدي : أي إذا نادى مناد في العسكر أن انفلتت دابة أو أنشدت ضالة ظنوا أنهم المرادون ; لما في قلوبهم من الرعب . كما قال الشاعر وهو الأخطل :\nما زلت تحسب كل شيء بعدهم خيلا تكر عليهم ورجالا\nوقيل : يحسبون كل صيحة عليهم هم العدو كلام ضميره فيه لا يفتقر إلى ما بعد ; وتقديره : يحسبون كل صيحة عليهم أنهم قد فطن بهم وعلم بنفاقهم ; لأن للريبة خوفا . ثم استأنف الله خطاب نبيه صلى الله عليه وسلم فقال : \" هم العدو \" وهذا معنى قول الضحاك وقيل : يحسبون كل صيحة يسمعونها في المسجد أنها عليهم ، وأن النبي صلى الله عليه وسلم قد أمر فيها بقتلهم ; فهم أبدا وجلون من أن ينزل الله فيهم أمرا يبيح به دماءهم ، ويهتك به أستارهم . وفي هذا المعنى قول الشاعر :\nفلو أنها عصفورة لحسبتها مسومة تدعو عبيدا وأزنما\nبطن من بني يربوع .\nثم وصفهم الله بقوله : هم العدو فاحذرهم حكاه عبد الرحمن بن أبي حاتم . وفي قوله تعالى : فاحذرهم وجهان : أحدهما : فاحذر أن تثق بقولهم أو تميل إلى كلامهم .\nالثاني : فاحذر ممايلتهم لأعدائك وتخذيلهم لأصحابك .\n\" قاتلهم الله \" أي لعنهم الله قاله ابن عباس وأبو مالك . وهي كلمة ذم وتوبيخ . وقد تقول العرب : قاتله الله ما أشعره ! يضعونه موضع التعجب . وقيل : معنى قاتلهم الله أي أحلهم محل من قاتله عدو قاهر ; لأن الله تعالى قاهر لكل معاند . حكاه ابن عيسى .\n\" أنى يؤفكون \" أي يكذبون ; قاله ابن عباس . قتادة : معناه يعدلون عن الحق . الحسن : معناه يصرفون عن الرشد . وقيل : معناه كيف تضل عقولهم عن هذا مع وضوح الدلائل ; وهو من الإفك وهو الصرف . و \" أنى \" بمعنى كيف ; وقد تقدم .\n                                    ",
      "saadi": "۞ وَإِذَا رَأَيۡتَهُمۡ تُعۡجِبُكَ أَجۡسَامُهُمۡۖ وَإِن يَقُولُواْ تَسۡمَعۡ لِقَوۡلِهِمۡۖ كَأَنَّهُمۡ خُشُبٞ مُّسَنَّدَةٞۖ يَحۡسَبُونَ كُلَّ صَيۡحَةٍ عَلَيۡهِمۡۚ هُمُ ٱلۡعَدُوُّ فَٱحۡذَرۡهُمۡۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ ٤\n                                        \n                                        \n                                        \n                                        { وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ } من روائها ونضارتها، { وَإِنْ يَقُولُوا تَسْمَعْ لِقَوْلِهِمْ } أي: من حسن منطقهم تستلذ لاستماعه، فأجسامهم وأقوالهم معجبة، ولكن ليس وراء ذلك من الأخلاق الفاضلة والهدى الصالح شيء، ولهذا قال: { كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ } لا منفعة فيها، ولا ينال منها إلا الضرر المحض، { يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ } وذلك لجبنهم وفزعهم وضعف قلوبهم، والريب الذي في قلوبهم يخافون أن يطلع عليهم.\nفهؤلاء { هُمُ الْعَدُوُّ } على الحقيقة، لأن العدو البارز المتميز، أهون من العدو الذي لا يشعر به، وهو مخادع ماكر، يزعم أنه ولي، وهو العدو المبين، { فَاحْذَرْهُمْ قَاتَلَهُمُ اللَّهُ أَنَّى يُؤْفَكُونَ } أي: كيف يصرفون عن الدين الإسلامي بعد ما تبينت أدلته، واتضحت معالمه، إلى الكفر الذي لا يفيدهم إلا الخسار والشقاء.\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Al-Munafiqun.html",
    "contnent": "وَإِذَا قِيلَ لَهُمۡ تَعَالَوۡاْ يَسۡتَغۡفِرۡ لَكُمۡ رَسُولُ ٱللَّهِ لَوَّوۡاْ رُءُوسَهُمۡ وَرَأَيۡتَهُمۡ يَصُدُّونَ وَهُم مُّسۡتَكۡبِرُونَ ٥",
    "tafsier": {
      "ibnkther": "وَإِذَا قِيلَ لَهُمۡ تَعَالَوۡاْ يَسۡتَغۡفِرۡ لَكُمۡ رَسُولُ ٱللَّهِ لَوَّوۡاْ رُءُوسَهُمۡ وَرَأَيۡتَهُمۡ يَصُدُّونَ وَهُم مُّسۡتَكۡبِرُونَ ٥\n                                    \n                                    \n                                    يقول تعالى مخبرا عن المنافقين - عليهم لعائن الله - أنهم ( وإذا قيل لهم تعالوا يستغفر لكم رسول الله لووا رءوسهم ) أي : صدوا وأعرضوا عما قيل لهم استكبارا عن ذلك ، واحتقارا لما قيل لهم ولهذا قال : ( ورأيتهم يصدون وهم مستكبرون )\n                                    ",
      "qortoby": "وَإِذَا قِيلَ لَهُمۡ تَعَالَوۡاْ يَسۡتَغۡفِرۡ لَكُمۡ رَسُولُ ٱللَّهِ لَوَّوۡاْ رُءُوسَهُمۡ وَرَأَيۡتَهُمۡ يَصُدُّونَ وَهُم مُّسۡتَكۡبِرُونَ ٥\n                                    \n                                    \n                                    قوله تعالى : وإذا قيل لهم تعالوا يستغفر لكم رسول الله لووا رءوسهم ورأيتهم يصدون وهم مستكبرون\nقوله تعالى : وإذا قيل لهم تعالوا يستغفر لكم رسول الله لما نزل القرآن بصفتهم مشى إليهم عشائرهم وقالوا : افتضحتم بالنفاق فتوبوا إلى رسول الله من النفاق ، واطلبوا أن يستغفر لكم . فلووا رءوسهم ; أي حركوها استهزاء وإباء ; قاله ابن عباس . وعنه أنه كان لعبد الله بن أبي موقف في كل سبب يحض على طاعة الله وطاعة رسوله ; فقيل له : وما ينفعك ذلك ورسول الله صلى الله عليه وسلم غضبان فأته يستغفر لك ; فأبى وقال : لا أذهب إليه . وسبب نزول هذه الآيات أن النبي صلى الله عليه وسلم غزا بني المصطلق على ماء يقال له \" المريسيع \" من ناحية \" قديد \" إلى الساحل ، فازدحم أجير لعمر يقال له : \" جهجاه \" مع حليف لعبد الله بن أبي يقال له : \" سنان \" على ماء \" بالمشلل \" ; فصرخ جهجاه بالمهاجرين ، وصرخ سنان بالأنصار ; فلطم جهجاه سنانا فقال عبد الله بن أبي : أوقد فعلوها ! والله ما مثلنا ومثلهم إلا كما قال الأول : سمن كلبك يأكلك ، أما والله لئن رجعنا إلى المدينة ليخرجن الأعز - يعني أبيا - الأذل ; يعني محمدا صلى الله عليه وسلم . ثم قال لقومه : كفوا طعامكم عن هذا الرجل ، ولا تنفقوا على من عنده حتى ينفضوا ويتركوه . فقال زيد بن أرقم - وهو من رهط عبد الله - أنت والله الذليل المنتقص في قومك ; ومحمد صلى الله عليه وسلم في عز من الرحمن ومودة من المسلمين ، والله لا أحبك بعد كلامك هذا أبدا . فقال عبد الله : اسكت إنما كنت ألعب . فأخبر زيد النبي صلى الله عليه وسلم بقوله ، فأقسم بالله ما فعل ولا قال ; فعذره النبي صلى الله عليه وسلم . قال زيد : فوجدت في نفسي ولامني الناس ; فنزلت سورة المنافقين في تصديق زيد وتكذيب عبد الله . فقيل لعبد الله : قد نزلت فيك آيات شديدة فاذهب إلى رسول الله صلى الله عليه وسلم ليستغفر لك ; فألوى برأسه ، فنزلت الآيات . خرجه البخاري ومسلم والترمذي بمعناه . وقد تقدم أول السورة . وقيل : \" يستغفر لكم \" يستتبكم من النفاق ; لأن التوبة استغفار .\nورأيتهم يصدون وهم مستكبرون أي يعرضون عن الرسول متكبرين عن الإيمان . وقرأ نافع \" لووا \" بالتخفيف . وشدد الباقون ; واختاره أبو عبيد وقال : هو فعل لجماعة . النحاس : وغلط في هذا ; لأنه نزل في عبد الله بن أبي لما قيل له : تعال يستغفر لك رسول الله صلى الله عليه وسلم - حرك رأسه استهزاء . فإن قيل : كيف أخبر عنه بفعل الجماعة ؟ قيل له : العرب تفعل هذا إذا كنت عن الإنسان . أنشد سيبويه لحسان :\nظننتم بأن يخفى الذي قد صنعتم وفينا رسول عنده الوحي واضعه\nوإنما خاطب حسان ابن الأبيرق في شيء سرقه بمكة . وقصته مشهورة . وقد يجوز أن يخبر عنه وعمن فعل فعله . وقيل : قال ابن أبي لما لوى رأسه : أمرتموني أن أومن فقد آمنت ، وأن أعطي زكاة مالي فقد أعطيت ; فما بقي إلا أن أسجد لمحمد .\n                                    ",
      "saadi": "وَإِذَا قِيلَ لَهُمۡ تَعَالَوۡاْ يَسۡتَغۡفِرۡ لَكُمۡ رَسُولُ ٱللَّهِ لَوَّوۡاْ رُءُوسَهُمۡ وَرَأَيۡتَهُمۡ يَصُدُّونَ وَهُم مُّسۡتَكۡبِرُونَ ٥\n                                        \n                                        \n                                        \n                                        { وَإِذَا قِيلَ } لهؤلاء المنافقين { تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللَّهِ } عما صدر منكم، لتحسن أحوالكم، وتقبل أعمالكم، امتنعوا من ذلك أشد الامتناع، و { لَوَّوْا رُءُوسَهُمْ } امتناعًا من طلب الدعاء من الرسول، { وَرَأَيْتَهُمْ يَصُدُّونَ } عن الحق بغضًا له { وَهُمْ مُسْتَكْبِرُونَ } عن اتباعه بغيًا وعنادًا، فهذه حالهم عندما يدعون إلى طلب الدعاء من الرسول، وهذا من لطف الله وكرامته لرسوله، حيث لم يأتوا إليه، فيستغفر لهم،\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Al-Munafiqun.html",
    "contnent": "سَوَآءٌ عَلَيۡهِمۡ أَسۡتَغۡفَرۡتَ لَهُمۡ أَمۡ لَمۡ تَسۡتَغۡفِرۡ لَهُمۡ لَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ ٦",
    "tafsier": {
      "ibnkther": "سَوَآءٌ عَلَيۡهِمۡ أَسۡتَغۡفَرۡتَ لَهُمۡ أَمۡ لَمۡ تَسۡتَغۡفِرۡ لَهُمۡ لَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ ٦\n                                    \n                                    \n                                    ثم جازاهم على ذلك فقال تعالى \"سواء عليهم أستغفرت لهم أم لم تستغفر لهم لن يغفر الله لهم إن الله لا يهدي القوم الفاسقين\" كما قال في سورة براءة وقد تقدم الكلام على ذلك وإيراد الأحاديث المروية هناك وقال ابن أبي حاتم حدثنا أبي حدثنا ابن أبي عمر العدني قال: قال سفيان \"لووا رءوسهم\" قال ابن أبي عمر حول سفيان وجهه على يمينه ونظر بعينه شذرا ثم قال هو هذا.\nوقد ذكر غير واحد من السلف أن هذا السياق كله نزل في عبدالله بن أبي بن سلول كما سنورده قريبا إن شاء الله تعالى وبه الثقة وعليه التكلان.\nوقد قال محمد بن إسحق في السيرة ولما قدم رسول الله صلى الله عليه وسلم المدينة يعني مرجعه من أحد وكان عبدالله بن أبي بن سلول كما حدثني ابن شهاب الزهري له مقام يقومه كل جمعة لا ينكر شرفا له من نفسه ومن قومه وكان فيهم شريفا إذا جلس النبي صلى الله عليه وسلم يوم الجمعة وهو يخطب الناس قام فقال أيها الناس هذا رسول الله صلى الله عليه وسلم بين أظهركم أكرمكم الله به وأعزكم به فانصروه وعزروه واسمعوا له وأطيعوا ثم يجلس حتى إذا صنع يوم أحد ما صنع يعني مرجعه بثلث الجيش ورجع الناس قام يفعل ذلك كما كان يفعله فأخذ المسلمون بثيابه من نواحيه وقالوا اجلس أي عدو الله لست لذلك بأهل وقد صنعت ما صنعت فخرج يتخطى رقاب الناس وهو يقول: والله لكأنما قلت بجرا أأن قمت أشدد أمره فلقيه رجال من الأنصار بباب المسجد فقالوا ويلك مالك؟ قال قمت أشدد أمره فوثب علي رجال من أصحابه يجذبونني ويعنفونني لكأنما قلت بجرا أأن قمت أشدد أمره قالوا ويلك ارجع يستغفر لك رسول الله صلى الله عليه وسلم قال والله ما أبتغي أن يستغفر لي.\nوقال قتادة والسدي أنزلت هذه الآية في عبدالله بن أبي وذلك أن غلاما من قرابته انطلق إلى رسول الله صلى الله عليه وسلم فحدثه بحديث عنه وأمر شديد فدعاه رسول الله صلى الله عليه وسلم فإذا هو يحلف بالله ويتبرأ من ذلك وأقبلت الأنصار على ذلك الغلام فلاموه وعزلوه وأنزل الله فيه ما تسمعون وقيل لعدو الله لو أتيت رسول الله فجعل يلوي رأسه أي لست فاعلا.\nوقال ابن أبي حاتم حدثنا أبي حدثنا أبو الربيع الزهراني حدثنا حماد بن زيد حدثنا أيوب عن سعيد بن جبير أن رسول الله صلى الله عليه وسلم كان إذا نزل منزلا لم يرتحل حتى يصلي فيه فلما كانت غزوة تبوك بلغه أن عبدالله ابن أبي بن سلول قال ليخرجن الأعز منها الأذل فارتحل قبل أن ينزل آخر النهار وقيل لعبدالله بن أبي ائت النبي صلى الله عليه وسلم حتى يستغفر لك فأنزل الله تعالى \"إذا جاءك المنافقون - إلى قوله - وإذا قيل لهم تعالوا يستغفر لكم رسول الله لووا رؤوسهم\" وهذا إسناد صحيح إلى سعيد بن جبير وقوله إن ذلك كان فى غزوة تبوك فيه نظر بل ليس بجيد فإن عبدالله بن أبي بن سلول لم يكن ممن خرج في غزوة تبوك بل رجع بطائفة من الجيش وإنما المشهور عند أصحاب المغازي والسير أن ذلك كان في غزوة المريسيع وهي غزوة بني المصطلق وقال يونس بن بكير عن ابن إسحاق حدثني محمد بن يحي بن حبان وعبدالله بن أبي بكر وعاصم بن عمر بن قتادة في قصة بني المصطلق فبينا رسول الله صلى الله عليه وسلم مقيم هناك اقتتل على الماء جهجاه بن سعيد الغفاري وكان أجيرا لعمر بن الخطاب وسنان بن يزيد قال ابن إسحاق فحدثني محمد بن يحيى بن حبان قال ازدحما على الماء فاقتتلا فقال سنان يا معشر الأنصار وقال الجهجاه يا معشر المهاجرين وزيد بن أرقم ونفر من الأنصار عند عبدالله بن أبي فلما سمعها قال قد ثاورونا في بلادنا والله ما مثلنا وجلابيب قريش هذه إلا كما قال القائل سمن كلبك يأكلك والله لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل ثم أقبل على من عنده من قومه وقال هذا ما صنعتم بأنفسكم أحللتموهم بلادكم وقاسمتموهم أموالكم أما والله لو كففتم عنهم لتحولوا عنكم في بلادكم إلى غيرها فسمعها زيد ابن أرقم رضي الله عنه فذهب بها إلى رسول الله صلى الله عليه وسلم وهو غليم عنده عمر بن الخطاب رضي الله عنه فأخبره الخبر فقال عمر رضي الله عنه يا رسول الله مر عباد بن بشر فليضرب عنقه فقال رسول الله صلى الله عليه وسلم: \"فكيف إذا تحدث الناس يا عمر أن محمدا يقتل أصحابه؟ لا ولكن ناد يا عمر الرحيل\" فلما بلغ عبدالله بن أبي أن ذلك قد بلغ رسول الله صلى الله عليه وسلم أتاه فاعتذر إليه وحلف بالله ما قال ما قال عليه زيد بن أرقم وكان عند قومه بمكان فقالوا يا رسول الله عسى أن يكون هذا الغلام أوهم ولم يثبت ما قال الرجل وراح رسول الله صلى الله عليه وسلم مهجرا في ساعة كان لا يروح فيها فلقيه أسيد بن الحضير رضي الله عنه فسلم عليه بتحية النبوة ثم قال والله لقد رحت في ساعة منكرة ما كنت تروح فيها فقال رسول الله صلى الله عليه وسلم \"أما بلغك ما قال صاحبك ابن أبي؟ زعم أنه إذا قدم المدينة سيخرج الأعز منها الأذل\" قال فأنت يا رسول الله العزيز وهو الذليل ثم قال ارفق به يا رسول الله فوالله لقد جاء الله بك وإنا لننظم له الخرز لنتوجه فإنه ليرى أن قد سلبته ملكا فسار رسول الله صلى الله عليه وسلم بالناس حتى أمسوا وليلته حتى أصبحوا وصدر يومه حتى اشتد الضحى ثم نزل بالناس ليشغلهم عما كان من الحديث فلم يأمن الناس أن وجدوا مس الأرض فناموا ونزلت سورة المنافقين.\nوقال الحافظ أبو بكر البيهقى أخبرنا أبو عبدالله الحافظ أخبرنا أبو بكر بن إسحاق أخبرنا بشر بن موسى حدثنا الحميدي حدثنا سفيان حدثنا عمر بن دينار سمعت جابر بن عبدالله يقول كنا مع رسول الله صلى الله عليه وسلم في غزاة فكسع رجل من المهاجرين رجلا من الأنصار فقال الأنصاري يا للأنصار وقال المهاجري يا للمهاجرين فقال رسول الله صلى الله عليه وسلم \"ما بال دعوى الجاهلية؟ دعوها فإنها منتنة\" وقال عبدالله بن أبي بن سلول وقد فعلوها: والله لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل قال جابر وكان الأنصار بالمدينة أكثر من المهاجرين حين قدم رسول الله صلى الله عليه وسلم ثم كثر المهاجرون بعد ذلك فقال عمر دعني أضرب عنق هذا المنافق فقال النبي صلى الله عليه وسلم \"دعه لا يتحدث الناس أن محمدا يقتل أصحابه\" ورواه الإمام أحمد عن حسن بن محمد المروزي عن سفيان بن عيينة ورواه البخاري عن الحميدي ومسلم عن أبي بكر بن أبي شيبة وغيره عن سفيان به نحوه وقال الإمام أحمد حدثنا محمد بن جعفر حدثنا شعبة عن الحكم عن محمد بن كعب القرظى عن زيد بن أرقم قال كنت مع رسول الله صلى الله عليه وسلم في غزوة تبوك فقال عبدالله بن أبي لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل قال فأتيت النبي صلى الله عليه وسلم فأخبرته قال فحلف عبدالله بن أبي أنه لم يكن شيء من ذلك قال فلامني قومي وقالوا ما أردت إلى هذا؟ قال فانطلقت فنمت كئيبا حزينا قال فأرسل إلي نبي الله صلى الله عليه وسلم فقال \"إن الله قد أنزل عذرك وصدقك\".\n                                    ",
      "qortoby": "سَوَآءٌ عَلَيۡهِمۡ أَسۡتَغۡفَرۡتَ لَهُمۡ أَمۡ لَمۡ تَسۡتَغۡفِرۡ لَهُمۡ لَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ ٦\n                                    \n                                    \n                                    قوله تعالى : سواء عليهم أأستغفرت لهم أم لم تستغفر لهم لن يغفر الله لهم إن الله لا يهدي القوم الفاسقين\nقوله تعالى : سواء عليهم أستغفرت لهم أم لم تستغفر لهم يعني كل ذلك سواء ، لا ينفع استغفارك شيئا ; لأن الله لا يغفر لهم . نظيره : \" سواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون \" سواء علينا أوعظت أم لم تكن من الواعظين . وقد تقدم .\nإن الله لا يهدي القوم الفاسقين أي من سبق في علم الله أنه يموت فاسقا .\n                                    ",
      "saadi": "سَوَآءٌ عَلَيۡهِمۡ أَسۡتَغۡفَرۡتَ لَهُمۡ أَمۡ لَمۡ تَسۡتَغۡفِرۡ لَهُمۡ لَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ ٦\n                                        \n                                        \n                                        \n                                        فإنه سواء استغفر لهم أم لم يستغفر لهم فلن يغفر الله لهم، وذلك لأنهم قوم فاسقون، خارجون عن طاعة الله، مؤثرون للكفر على الإيمان، فلذلك لا ينفع فيهم استغفار الرسول، لو استغفر لهم كما قال تعالى: { اسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ } { إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ } .\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Al-Munafiqun.html",
    "contnent": "هُمُ ٱلَّذِينَ يَقُولُونَ لَا تُنفِقُواْ عَلَىٰ مَنۡ عِندَ رَسُولِ ٱللَّهِ حَتَّىٰ يَنفَضُّواْۗ وَلِلَّهِ خَزَآئِنُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَفۡقَهُونَ ٧",
    "tafsier": {
      "ibnkther": "هُمُ ٱلَّذِينَ يَقُولُونَ لَا تُنفِقُواْ عَلَىٰ مَنۡ عِندَ رَسُولِ ٱللَّهِ حَتَّىٰ يَنفَضُّواْۗ وَلِلَّهِ خَزَآئِنُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَفۡقَهُونَ ٧\n                                    \n                                    \n                                    قال فنزلت هذه الآية \"هم الذين يقولون لا تنفقوا على من عند رسول الله حتى ينفضوا - حتى بلغ - لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل\" ورواه البخاري عند هذه الآية عن آدم بن أبي إياس عن شعبة ثم قال وقال ابن أبي زائدة عن الأعمش عن عمرو عن ابن أبي ليلى عن زيد عن النبي صلى الله عليه وسلم ورواه الترمذي والنسائي عندها أيضا من حديث شعبة به.\n\"طريق أخرى عن زيد\" قال الإمام أحمد رحمه الله حدثنا يحيى بن آدم ويحيى بن أبي بكير قالا حدثنا إسرائيل عن أبي إسحاق قال سمعت زيد بن أرقم وقال أبو بكر عن زيد بن أرقم قال خرجت مع عمي في غزاة فسمعت عبدالله بن أبي بن سلول يقول لأصحابه لا تنفقوا على من عند رسول الله ولئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل فذكرت ذلك لعمي فذكره عمى لرسول الله صلى الله عليه وسلم فأرسل إلى رسول الله صلى الله عليه وسلم فحدثته فأرسل إلى عبدالله بن أبي بن سلول وأصحابه فحلفوا بالله ما قالوا فكذبني رسول الله صلى الله عليه وسلم وصدقه فأصابني هم لم يصبني مثله قط وجلست في البيت فقال عمي: ما أردت إلا أن كذبك رسول الله صلى الله عليه وسلم ومقتك؟ قال حتى أنزل الله \"إذا جاءك المنافقون\" قال فبعث إليّ رسول الله صلى الله عليه وسلم فقرأها رسول الله صلى الله عليه وسلم علي ثم قال \"إن الله قد صدقك\" ثم قال أحمد أيضا حدثنا حسن بن موسى حدثنا زهير حدثنا أبو إسحاق أنه سمع زيد بن أرقم يقول خرجنا مع رسول الله صلى الله عليه وسلم في سفر فأصاب الناس شدة وقال عبدالله بن أبي لاصحابه لا تنفقوا على من عند رسول الله حتى ينفضوا من حوله وقال لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل فأتيت النبي صلى الله عليه وسلم فأخبرته بذلك فأرسل إلى عبدالله بن أبي فسأله فاجتهد يمينه ما فعل فقالوا: كذب زيد يا رسول الله فوقع في نفسي مما قالوا فأنزل الله تصديقي \"إذا جاءك المنافقون\" قال ودعاهم رسول الله صلى الله عليه وسلم ليستغفر لهم فلووا رءوسهم وقد رواه البخاري ومسلم والنسائي من حديث زهير ورواه البخاري أيضا والترمذي من حديث إسرائيل كلاهما عن أبي إسحاق عمرو بن عبدالله السبيعي الهمدانى الكوفي عن زيد به \"طريق أخرى عن زيد\" قال أبو عيسى الترمذي حدثنا عبد بن حميد حدثنا عبيد الله بن موسى عن إسرائيل عن السدى عن أبي سعيد الأزدي قال حدثنا زيد بن أرقم قال غزونا مع رسول الله صلى الله عليه وسلم وكان معنا أناس من الأعراب فكنا نبتدر الماء وكان الأعراب يسبقوننا إليه فسبق أعرابي أصحابه ليملأ الحوض ويجعل حوله حجارة ويجعل النطع عليه حتى يجيء أصحابه قال فأتى رجل من الأنصار الأعرابي فأرخى زمام ناقته لتشرب فأبى أن يدعه فانتزع حجرا فغاض الماء فرفع الاعرابي خشبته فضرب بها رأس الأنصاري فشجه فأتى عبد الله بن أبي رأس المنافقين فأخبره وكان من أصحابه فغضب عبدالله بن أبي ثم قال: لا تنفقوا على من عند رسول الله حتى ينفضوا من حوله يعني الأعراب وكانوا يحضرون رسول الله صلى الله عليه وسلم عند الطعام فقال عبدالله لأصحابه إذا انفضوا من عند محمد فائتوا محمدا بالطعام فليأكل هو ومن معه ثم قال لأصحابه لئن رجعتم إلى المدينة فليخرج الأعز منها الأذل قال زيد وأنا ردف عمي قال فسمعت عبدالله بن أبي يقول ما قال فأخبرت عمي فانطلق فأخبر رسول الله صلى الله عليه وسلم فأرسل إليه رسول الله صلى الله عليه وسلم فحلف وجحد قال فصدقه رسول الله صلى الله عليه وسلم وكذبني قال فجاء إلي عمي فقال ما أردت إلا أن مقتك رسول الله صلى الله عليه وسلم وكذبك المسلمون؟ قال فوقع علي من الغم ما لم يقع على أحد قط قال فبينما أنا أسير مع رسول الله صلى الله عليه وسلم في سفر وقد خفقت برأسي من الهم إذ أتاني رسول الله صلى الله عليه وسلم فعرك أذني وضحك في وجهي فما كان يسرني أن لي بها الخلد في الدنيا ثم إن أبا بكر لحقني وقال ما قال لك رسول الله صلى الله عليه وسلم؟ قلت ما قال شيئا إلا أنه عرك أذني وضحك في وجهي فقال أبشر ثم لحقني عمر فقلت له مثل قولي لأبي بكر فلما أن أصبحنا قرأ رسول الله صلى الله عليه وسلم سورة المنافقين.\nانفرد بإخراجه الترمذي وقال هذا حديث حسن صحيح.\nوهكذا رواه الحافظ البيهقي عن الحاكم عن عبيدالله بن موسى به وزاد بعد قوله سورة المنافقين \"إذا جاءك المنافقون قالوا فشهد إنك لرسول الله - حتى بلغ- هم الذين يقولون لا تنفقوا على من عند رسول الله حتى ينفضوا - حتى بلغ - ليخرجن الأعز منها الأذل\".\nوقد ورى عبدالله بن لهيعة عن أبي الأسود عروة بن الزبير في المغازي وكذا ذكر موسى بن عقبة في مغازيه أيضا هذه القصة بهذا السياق ولكن جعلا الذي بلغ رسول الله صلى الله عليه وسلم كلام عبدالله بن أبي بن سلول إنما هو أوس بن أقرم من بني الحارث بن الخزرج فلعله مبلغ آخر أو تصحيف من جهة السمع والله أعلم.\nوقد قال ابن أبي حاتم رحمه الله حدثنا محمد عزيز الأيلي حدثنا سلام حدثني عقيل أخبرت محمد بن مسلم أن عروة بن الزبير وعمرو بن ثابت الأنصاري أخبراه أن رسول الله صلى الله عليه وسلم غزا غزوة المريسيع وهي التي هدم رسول الله صلى الله عليه وسلم فيها مناة الطاغية التي كانت بين قفا المشلل وبين البحر فبعث رسول الله صلى الله عليه وسلم خالد بن الوليد فكسر مناة فاقتتل رجلان في غزوة رسول الله صلى الله عليه وسلم تلك أحدهما من المهاجرين والآخر من بهز وهم حلفاء الأنصار فاستعلى الرجل الذي من المهاجرين على البهزي فقال البهزي يا معشر الأنصار فنصره رجال من الأنصار وقال المهاجري يا معشر المهاجرين فنصره رجال من المهاجرين حتى كان بين أولئك الرجال من المهاجرين والرجال من الأنصار شىء من القتال ثم حجز بينهم فانكفأ كل منافق أو رجل في قلبه مرض إلى عبدالله بن أبي بن سلول فقال قد كنت ترجى وتدفع فأصبحت لا تضر ولا تنفع قد تناصرت علينا الجلابيب وكانوا يدعون كل حديث الهجرة الجلابيب.\n                                    ",
      "qortoby": "هُمُ ٱلَّذِينَ يَقُولُونَ لَا تُنفِقُواْ عَلَىٰ مَنۡ عِندَ رَسُولِ ٱللَّهِ حَتَّىٰ يَنفَضُّواْۗ وَلِلَّهِ خَزَآئِنُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَفۡقَهُونَ ٧\n                                    \n                                    \n                                    قوله تعالى : هم الذين يقولون لا تنفقوا على من عند رسول الله حتى ينفضوا ولله خزائن السماوات والأرض ولكن المنافقين لا يفقهون\nذكرنا سبب النزول فيما تقدم . وابن أبي قال : لا تنفقوا على من عند محمد حتى ينفضوا ; حتى يتفرقوا عنه .\nفأعلمهم الله سبحانه أن خزائن السموات والأرض له ، ينفق كيف يشاء . قال رجل لحاتم الأصم : من أين تأكل ؟ فقال : ولله خزائن السموات والأرض .\nوقال الجنيد : خزائن السموات الغيوب ، وخزائن الأرض القلوب ; فهو علام الغيوب ومقلب القلوب . وكان الشبلي يقول : ولله خزائن السموات والأرض فأين تذهبون .\nولكن المنافقين لا يفقهون أنه إذا أراد أمرا يسره .\n                                    ",
      "saadi": "هُمُ ٱلَّذِينَ يَقُولُونَ لَا تُنفِقُواْ عَلَىٰ مَنۡ عِندَ رَسُولِ ٱللَّهِ حَتَّىٰ يَنفَضُّواْۗ وَلِلَّهِ خَزَآئِنُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَفۡقَهُونَ ٧\n                                        \n                                        \n                                        \n                                        وهذا من شدة عداوتهم للنبي صلى الله عليه وسلم، والمسلمين، لما رأوا اجتماع أصحابه وائتلافهم، ومسارعتهم في مرضاة الرسول صلى الله عليه وسلم، قالوا بزعمهم الفاسد:\n{ لَا تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ حَتَّى يَنْفَضُّوا } فإنهم - بزعمهم - لولا أموال المنافقين ونفقاتهم عليهم، لما اجتمعوا في نصرة دين الله، وهذا من أعجب العجب، أن يدعى هؤلاء المنافقون الذين هم أحرص الناس على خذلان الدين، وأذية المسلمين، مثل هذه الدعوى، التي لا تروج إلا على من لا علم له بحقائق الأمور ولهذا قال الله ردًا لقولهم: { وَلِلَّهِ خَزَائِنُ السَّمَاوَاتِ وَالْأَرْضِ } فيؤتي الرزق من يشاء، ويمنعه من يشاء، وييسر الأسباب لمن يشاء، ويعسرها على من يشاء، { وَلَكِنَّ الْمُنَافِقِينَ لَا يَفْقَهُونَ } فلذلك قالوا تلك المقالة، التي مضمونها أن خزائن الرزق في أيديهم، وتحت مشيئتهم.\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Al-Munafiqun.html",
    "contnent": "يَقُولُونَ لَئِن رَّجَعۡنَآ إِلَى ٱلۡمَدِينَةِ لَيُخۡرِجَنَّ ٱلۡأَعَزُّ مِنۡهَا ٱلۡأَذَلَّۚ وَلِلَّهِ ٱلۡعِزَّةُ وَلِرَسُولِهِۦ وَلِلۡمُؤۡمِنِينَ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَعۡلَمُونَ ٨",
    "tafsier": {
      "ibnkther": "يَقُولُونَ لَئِن رَّجَعۡنَآ إِلَى ٱلۡمَدِينَةِ لَيُخۡرِجَنَّ ٱلۡأَعَزُّ مِنۡهَا ٱلۡأَذَلَّۚ وَلِلَّهِ ٱلۡعِزَّةُ وَلِرَسُولِهِۦ وَلِلۡمُؤۡمِنِينَ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَعۡلَمُونَ ٨\n                                    \n                                    \n                                    فقال عبدالله بن أبي عدو الله لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل قال مالك بن الدخشن وكان من المنافقين ألم أقل لكم لا تنفقوا على من عند رسول الله حتى ينفضوا؟ فسمع بذلك عمر بن الخطاب فأقبل يمشي حتى أتي رسول الله صلى الله عليه وسلم فقال يا رسول الله ائذن لي في هذا الرجل الذي قد أفتن الناس أضرب عنقه يريد عمر عبدالله بن أبي فقال رسول الله صلى الله عليه وسلم لعمر: \"أو قاتله أنت إن أمرتك بقتله؟\" فقال عمر نعم والله لئن أمرتني بقتله لأضربن عنقه فقال رسول الله صلى الله عليه وسلم \"اجلس\" فأقبل أسيد بن حضير وهو أحد الأنصار ثم أحد بني عبد الأشهل حتى أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله ائذن لي في هذا الرجل الذي قد أفتن الناس أضرب عنقه فقال رسول الله صلى الله عليه وسلم \"أو قاتله أنت إن امرتك بقتله؟\" قال نعم والله لئن أمرتني بقتله لأضربن بالسيف تحت قرط أذنيه فقال رسول الله صلى الله عليه وسلم \"اجلس\" ثم قال رسول الله صلى الله عليه وسلم \"آذنوا بالرحيل\" فهجر بالناس فسار يومه وليلته والغد حتى متع النهار ثم نزل ثم هجر بالناس مثلها حتى صبح بالمدينة في ثلاث سارها من قفا المشلل فلما قدم رسول الله صلى الله عليه وسلم المدينة أرسل إلى عمر فدعاه فقال له رسول الله صلى الله عليه وسلم \"أي عمر أكنت قاتله لو أمرتك بقتله؟\" فقال عمر نعم فقال رسول الله صلى الله عليه وسلم \"والله لو قتلته يومئذ لأرغمت أنوف رجال لو أمرتهم اليوم بقتله لقتلوه فيتحدث الناس أني قد وقعت علي أصحابي فأقتلهم صبرا\" وأنزل الله عز وجل \"هم الذين يقولون لا تنفقوا على من عند رسول الله ختى ينفضوا - إلى قوله تعالى - يقولون لئن رجعنا إلى المدينة\" الآية وهذا سياق غريب وفيه أشياء نفيسة لا توجد إلا فيه وقال محمد بن إسحاق بن يسار حدثني عاصم بن عمر بن قتادة أن عبدالله بن عبدالله بن أبي لما بلغه ما كان من أمر أبيه أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إنه بلغني أنك تريد قتل عبدالله بن أبي فيما بلغك عنه فإن كنت فاعلا فمرني به فأنا أحمل إليك رأسه فوالله لقد علمت الخزرج ما كان لها من رجل أبر بوالده مني إني أخشى أن تأمر به غيري فيقتله فلا تدعني نفسي أنظر إلى قاتل عبدالله بن أبي يمسي في الناس فأقتله فأقتل مؤمنا بكافر فأدخل النار فقال رسول الله صلى الله عليه وسلم \"بل نترفق به ونحسن صحبته ما بقي معنا\" وذكر عكرمة وابن زيد وغيرهما أن الناس لما قفلوا راجعين إلى المدينة وقف عبدالله بن عبدالله هذا على باب المدينة واستل سيفه فجعل الناس يمرون عليه فلما جاء أبوه عبدالله بن أبي قال له ابنه وراءك فقال مالك ويلك؟ فقال والله لا تجوز من ههنا حتى يأذن لك رسول الله صلى الله عليه وسلم فإنه العزيز وأنت الذليل فلما جاء رسول الله صلى الله عليه وسلم وكان إنما يسير ساقة فشكا إليه عبدالله بن أبي ابنه فقال ابنه عبدالله والله يا رسول الله لا يدخلها حتى تأذن له فأذن له رسول الله صلى الله عليه وسلم فقال أما إذا أذن لك رسول الله صلى الله عليه وسلم فجز الآن وقال أبو بكر عبدالله بن الزبير الحميدي في مسنده حدثنا سفيان بن عيينة حدثنا أبو هارون المدني قال: قال عبدالله بن عبدالله ابن أبي بن سلول لأبيه والله لا تدخل المدينة أبدا حتى تقول رسول الله صلى الله عليه وسلم الأعز وأنا الأذل قال وجاء إلى النبي صلى الله عليه وسلم فقال يا رسول الله إنه بلغني أنك تريد أن تقتل أبي فوالذي بعثك بالحق ما تأملت وجهه قط هيبة له لئن شئت أن آتيك برأسه لأتيتك فإني أكره أن أرى قاتل أبي.\n                                    ",
      "qortoby": "يَقُولُونَ لَئِن رَّجَعۡنَآ إِلَى ٱلۡمَدِينَةِ لَيُخۡرِجَنَّ ٱلۡأَعَزُّ مِنۡهَا ٱلۡأَذَلَّۚ وَلِلَّهِ ٱلۡعِزَّةُ وَلِرَسُولِهِۦ وَلِلۡمُؤۡمِنِينَ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَعۡلَمُونَ ٨\n                                    \n                                    \n                                    قوله تعالى : يقولون لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل ولله العزة ولرسوله وللمؤمنين ولكن المنافقين لا يعلمون القائل ابن أبي كما تقدم . وقيل : إنه لما قال : ليخرجن الأعز منها الأذل ورجع إلى المدينة لم يلبث إلا أياما يسيرة حتى مات ; فاستغفر له رسول الله صلى الله عليه وسلم ، وألبسه قميصه ; فنزلت هذه الآية : لن يغفر الله لهم . وقد مضى بيان هذا كله في سورة \" التوبة \" مستوفى .\nوروي أن عبد الله بن عبد الله بن أبي ابن سلول قال لأبيه : والذي لا إله إلا هو لا تدخل المدينة حتى تقول : إن رسول الله صلى الله عليه وسلم هو الأعز وأنا الأذل ; فقاله . توهموا أن العزة بكثرة الأموال والأتباع ; فبين الله أن العزة والمنعة والقوة لله .\n                                    ",
      "saadi": "يَقُولُونَ لَئِن رَّجَعۡنَآ إِلَى ٱلۡمَدِينَةِ لَيُخۡرِجَنَّ ٱلۡأَعَزُّ مِنۡهَا ٱلۡأَذَلَّۚ وَلِلَّهِ ٱلۡعِزَّةُ وَلِرَسُولِهِۦ وَلِلۡمُؤۡمِنِينَ وَلَٰكِنَّ ٱلۡمُنَٰفِقِينَ لَا يَعۡلَمُونَ ٨\n                                        \n                                        \n                                        \n                                        { يَقُولُونَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ } وذلك في غزوة المريسيع، حين صار بين بعض المهاجرين والأنصار، بعض كلام كدر الخواطر، ظهر حينئذ نفاق المنافقين، وأظهروا ما في نفوسهم .\nوقال كبيرهم، عبد الله بن أبي بن سلول: ما مثلنا ومثل هؤلاء -يعني المهاجرين- إلا كما قال القائل: \" غذ كلبك يأكلك \"\nوقال: لئن رجعنا إلى المدينة { لَيُخْرِجَنَّ الْأَعَزُّ مِنْهَا الْأَذَلَّ } بزعمه أنه هو وإخوانه من المنافقين الأعزون، وأن رسول الله ومن معه هم الأذلون، والأمر بعكس ما قال هذا المنافق، فلهذا قال [تعالى:] { وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ } فهم الأعزاء، والمنافقون وإخوانهم من الكفار [هم] الأذلاء. { وَلَكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ } ذلك زعموا أنهم الأعزاء، اغترارًا بما هم عليه من الباطل، ثم قال تعالى:\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Al-Munafiqun.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُلۡهِكُمۡ أَمۡوَٰلُكُمۡ وَلَآ أَوۡلَٰدُكُمۡ عَن ذِكۡرِ ٱللَّهِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ ٩",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُلۡهِكُمۡ أَمۡوَٰلُكُمۡ وَلَآ أَوۡلَٰدُكُمۡ عَن ذِكۡرِ ٱللَّهِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ ٩\n                                    \n                                    \n                                    يقول تعالى آمرا لعباده المؤمنين بكثرة ذكره وناهيا لهم عن أن تشغلهم الأموال ، والأولاد عن ذلك ، ومخبرا لهم بأنه من التهى بمتاع الحياة الدنيا وزينتها عما خلق له من طاعة ربه وذكره ، فإنه من الخاسرين الذين يخسرون أنفسهم ، وأهليهم يوم القيامة\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُلۡهِكُمۡ أَمۡوَٰلُكُمۡ وَلَآ أَوۡلَٰدُكُمۡ عَن ذِكۡرِ ٱللَّهِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ ٩\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون حذر المؤمنين أخلاق المنافقين ; أي لا تشتغلوا بأموالكم كما فعل المنافقون إذ قالوا - للشح بأموالهم - : لا تنفقوا على من عند رسول الله . عن ذكر الله ؛ أي عن الحج والزكاة . وقيل : عن قراءة القرآن . وقيل : عن إدامة الذكر . وقيل : عن الصلوات الخمس ; قاله الضحاك . وقال الحسن : جميع الفرائض ; كأنه قال عن طاعة الله . وقيل : هو خطاب للمنافقين ; أي آمنتم بالقول فآمنوا بالقلب . ومن يفعل ذلك أي من يشتغل بالمال والولد عن طاعة ربه فأولئك هم الخاسرون .s\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُلۡهِكُمۡ أَمۡوَٰلُكُمۡ وَلَآ أَوۡلَٰدُكُمۡ عَن ذِكۡرِ ٱللَّهِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ ٩\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده المؤمنين بالإكثار من ذكره، فإن في ذلك الربح والفلاح، والخيرات الكثيرة، وينهاهم أن تشغلهم أموالهم وأولادهم عن ذكره، فإن محبة المال والأولاد مجبولة عليها أكثر النفوس، فتقدمها على محبة الله، وفي ذلك الخسارة العظيمة، ولهذا قال تعالى: { وَمَنْ يَفْعَلْ ذَلِكَ } أي: يلهه ماله وولده، عن ذكر الله { فَأُولَئِكَ هُمُ الْخَاسِرُونَ } للسعادة الأبدية، والنعيم المقيم، لأنهم آثروا ما يفنى على ما يبقى، قال تعالى: { إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ } .\n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Al-Munafiqun.html",
    "contnent": "وَأَنفِقُواْ مِن مَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ أَحَدَكُمُ ٱلۡمَوۡتُ فَيَقُولَ رَبِّ لَوۡلَآ أَخَّرۡتَنِيٓ إِلَىٰٓ أَجَلٖ قَرِيبٖ فَأَصَّدَّقَ وَأَكُن مِّنَ ٱلصَّٰلِحِينَ ٠١",
    "tafsier": {
      "ibnkther": "وَأَنفِقُواْ مِن مَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ أَحَدَكُمُ ٱلۡمَوۡتُ فَيَقُولَ رَبِّ لَوۡلَآ أَخَّرۡتَنِيٓ إِلَىٰٓ أَجَلٖ قَرِيبٖ فَأَصَّدَّقَ وَأَكُن مِّنَ ٱلصَّٰلِحِينَ ٠١\n                                    \n                                    \n                                    ثم حثهم على الإنفاق في طاعته فقال : ( وأنفقوا من ما رزقناكم من قبل أن يأتي أحدكم الموت فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين ) فكل مفرط يندم عند الاحتضار ، ويسأل طول المدة ولو شيئا يسيرا ، يستعتب ويستدرك ما فاته ، وهيهات ! كان ما كان ، وأتى ما هو آت ، وكل بحسب تفريطه ، أما الكفار فكما قال الله تعالى : ( وأنذر الناس يوم يأتيهم العذاب فيقول الذين ظلموا ربنا أخرنا إلى أجل قريب نجب دعوتك ونتبع الرسل أولم تكونوا أقسمتم من قبل ما لكم من زوال ) [ إبراهيم : 44 ] وقال تعالى : ( حتى إذا جاء أحدهم الموت قال رب ارجعون لعلي أعمل صالحا فيما تركت كلا إنها كلمة هو قائلها ومن ورائهم برزخ إلى يوم يبعثون ) [ المؤمنون : 99 ، 100 ]\n                                    ",
      "qortoby": "وَأَنفِقُواْ مِن مَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ أَحَدَكُمُ ٱلۡمَوۡتُ فَيَقُولَ رَبِّ لَوۡلَآ أَخَّرۡتَنِيٓ إِلَىٰٓ أَجَلٖ قَرِيبٖ فَأَصَّدَّقَ وَأَكُن مِّنَ ٱلصَّٰلِحِينَ ٠١\n                                    \n                                    \n                                    قوله تعالى : وأنفقوا من ما رزقناكم من قبل أن يأتي أحدكم الموت فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين\nفيه أربع مسائل :\nالأولى : قوله تعالى : وأنفقوا مما رزقناكم من قبل أن يأتي أحدكم الموت يدل على وجوب تعجيل أداء الزكاة ، ولا يجوز تأخيرها أصلا . وكذلك سائر العبادات إذا تعين وقتها .\nالثانية : قوله تعالى : فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين سأل الرجعة إلى الدنيا ليعمل صالحا . وروى الترمذي عن الضحاك بن مزاحم عن ابن عباس قال : من كان له مال يبلغه حج بيت ربه أو تجب عليه فيه زكاة فلم يفعل ، سأل الرجعة عند الموت . فقال رجل : يا ابن عباس ، اتق الله ، إنما سأل الرجعة الكفار . فقال : سأتلو عليك بذلك قرآنا : يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون وأنفقوا مما رزقناكم من قبل أن يأتي أحدكم الموت فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين إلى قوله : والله خبير بما تعملون قال : فما يوجب الزكاة ؟ قال : إذا بلغ المال مائتين فصاعدا . قال : فما يوجب الحج ؟ قال : الزاد والراحلة .\nقلت : ذكره الحليمي أبو عبد الله الحسين بن الحسن في كتاب ( منهاج الدين ) مرفوعا فقال : وقال ابن عباس قال رسول الله صلى الله عليه وسلم : من كان عنده مال يبلغه الحج . . . الحديث ; فذكره . وقد تقدم في \" آل عمران \" لفظه .\nالثالثة : قال ابن العربي : \" أخذ ابن عباس بعموم الآية في إنفاق الواجب خاصة دون النفل ; فأما تفسيره بالزكاة فصحيح كله عموما وتقديرا بالمائتين . وأما القول في الحج ففيه إشكال ; لأنا إن قلنا : إن الحج على التراخي ففي المعصية في الموت قبل الحج خلاف بين العلماء ; فلا تخرج الآية عليه . وإن قلنا : إن الحج على الفور فالآية في العموم صحيح ; لأن من وجب عليه الحج فلم يؤده لقي من الله ما يود أنه رجع ليأتي بما ترك من العبادات . وأما تقدير الأمر بالزاد والراحلة ففي ذلك خلاف مشهور بين العلماء . وليس لكلام ابن عباس فيه مدخل ; لأجل أن الرجعة والوعيد لا يدخل في المسائل المجتهد فيها ولا المختلف عليها ، وإنما يدخل في المتفق عليه . والصحيح تناوله للواجب من الإنفاق كيف تصرف بالإجماع أو بنص القرآن ; لأجل أن ما عدا ذلك لا يتطرق إليه تحقيق الوعيد .\nالرابعة : قوله تعالى : لولا أي هلا ; فيكون استفهاما . وقيل : \" لا \" صلة ; فيكون الكلام بمعنى التمني . \" فأصدق \" نصب على جواب التمني بالفاء . \" وأكون \" عطف على \" فأصدق \" وهي قراءة ابن عمرو وابن محيصن ومجاهد . وقرأ الباقون \" وأكن \" بالجزم عطفا على موضع الفاء ; لأن قوله : \" فأصدق \" لو لم تكن الفاء لكان مجزوما ; أي أصدق . ومثله من يضلل الله فلا هادي له ويذرهم فيمن جزم . قال ابن عباس : هذه الآية أشد على أهل التوحيد ; لأنه لا يتمنى الرجوع في الدنيا أو التأخير فيها أحد له عند الله خير في الآخرة .\nقلت : إلا الشهيد فإنه يتمنى الرجوع حتى يقتل ، لما يرى من الكرامة .\n                                    ",
      "saadi": "وَأَنفِقُواْ مِن مَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ أَحَدَكُمُ ٱلۡمَوۡتُ فَيَقُولَ رَبِّ لَوۡلَآ أَخَّرۡتَنِيٓ إِلَىٰٓ أَجَلٖ قَرِيبٖ فَأَصَّدَّقَ وَأَكُن مِّنَ ٱلصَّٰلِحِينَ ٠١\n                                        \n                                        \n                                        \n                                        { وَأَنْفِقُوا مِنْ مَا رَزَقْنَاكُمْ } يدخل في هذا، النفقات الواجبة، من الزكاة والكفارات ونفقة الزوجات، والمماليك، ونحو ذلك، والنفقات المستحبة، كبذل المال في جميع المصالح، وقال: { مِمَّا رَزَقْنَاكُمْ } ليدل ذلك على أنه تعالى، لم يكلف العباد من النفقة، ما يعنتهم ويشق عليهم، بل أمرهم بإخراج جزء مما رزقهم الله الذي يسره لهم ويسر لهم أسبابه.\nفليشكروا الذي أعطاهم، بمواساة إخوانهم المحتاجين، وليبادروا بذلك، الموت الذي إذا جاء، لم يمكن العبد أن يأتي بمثقال ذرة من الخير، ولهذا قال: { مِنْ قَبْلِ أَنْ يَأْتِيَ أَحَدَكُمُ الْمَوْتُ فَيَقُولَ } متحسرًا على ما فرط في وقت الإمكان، سائلاً الرجعة التي هي محال: { رَبِّ لَوْلَا أَخَّرْتَنِي إِلَى أَجَلٍ قَرِيبٍ } أي: لأتدارك ما فرطت فيه، { فَأَصَّدَّقَ } من مالي، ما به أنجو من العذاب، وأستحق به جزيل الثواب، { وَأَكُنْ مِنَ الصَّالِحِينَ } بأداء المأمورات كلها، واجتناب المنهيات، ويدخل في هذا، الحج وغيره، وهذا السؤال والتمني، قد فات وقته، ولا يمكن تداركه.\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Al-Munafiqun.html",
    "contnent": "وَلَن يُؤَخِّرَ ٱللَّهُ نَفۡسًا إِذَا جَآءَ أَجَلُهَاۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ ١١",
    "tafsier": {
      "ibnkther": "وَلَن يُؤَخِّرَ ٱللَّهُ نَفۡسًا إِذَا جَآءَ أَجَلُهَاۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ ١١\n                                    \n                                    \n                                    ثم قال تعالى : ( ولن يؤخر الله نفسا إذا جاء أجلها والله خبير بما تعملون ) أي : لا ينظر أحدا بعد حلول أجله ، وهو أعلم وأخبر بمن يكون صادقا في قوله وسؤاله ممن لو رد لعاد إلى شر مما كان عليه ; ولهذا قال : ( والله خبير بما تعملون ) وقال أبو عيسى الترمذي : حدثنا عبد بن حميد ، حدثنا جعفر بن عون ، حدثنا أبو جناب الكلبي ، عن الضحاك بن مزاحم ، عن ابن عباس قال : من كان له مال يبلغه حج بيت ربه ، أو تجب عليه فيه زكاة ، فلم يفعل ، سأل الرجعة عند الموت . فقال رجل : يا ابن عباس اتق الله ، فإنما يسأل الرجعة الكفار . فقال سأتلو عليك بذلك قرآنا : ( يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون وأنفقوا من ما رزقناكم من قبل أن يأتي أحدكم الموت فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين ولن يؤخر الله نفسا إذا جاء أجلها والله خبير بما تعملون ) قال : فما يوجب الزكاة ؟ قال : إذا بلغ المال مائتين فصاعدا . قال : فما يوجب الحج ؟ قال : الزاد والبعير .\nثم قال : حدثنا عبد بن حميد ، حدثنا عبد الرزاق ، عن الثوري ، عن يحيى بن أبي حية - وهو أبو جناب الكلبي - عن الضحاك ، عن ابن عباس عن النبي - صلى الله عليه وسلم - بنحوه\nثم قال : وقد رواه سفيان بن عيينة ، وغيره ، عن أبي جناب ، عن ابن الضحاك ، عن ابن عباس من قوله . وهو أصح ، وضعف أبا جناب الكلبي .\nقلت : رواية الضحاك ، عن ابن عباس فيها انقطاع ، والله أعلم .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا ابن نفيل ، حدثنا سليمان بن عطاء ، عن مسلمة الجهني ، عن عمه - يعني أبا مشجعة بن ربعي - عن أبي الدرداء رضي الله عنه ، قال : ذكرنا عند رسول الله - صلى الله عليه وسلم - الزيادة في العمر فقال : \" إن الله لا يؤخر نفسا إذا جاء أجلها ، وإنما الزيادة في العمر أن يرزق الله العبد ذرية صالحة يدعون له ، فيلحقه دعاؤهم في قبره \"\nآخر تفسير سورة \" المنافقون \" ولله الحمد والمنة .\n                                    ",
      "qortoby": "وَلَن يُؤَخِّرَ ٱللَّهُ نَفۡسًا إِذَا جَآءَ أَجَلُهَاۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ ١١\n                                    \n                                    \n                                    والله خبير بما تعملون من خير وشر . وقراءة العامة بالتاء على الخطاب . وقرأ أبو بكر عن عاصم والسلمي بالياء ; على الخبر عمن مات وقال هذه المقالة .\nتمت السورة بحمد الله وعونه\n                                    ",
      "saadi": "وَلَن يُؤَخِّرَ ٱللَّهُ نَفۡسًا إِذَا جَآءَ أَجَلُهَاۚ وَٱللَّهُ خَبِيرُۢ بِمَا تَعۡمَلُونَ ١١\n                                        \n                                        \n                                        \n                                        { وَلَنْ يُؤَخِّرَ اللَّهُ نَفْسًا إِذَا جَاءَ أَجَلُهَا } المحتوم لها { وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ } من خير وشر، فيجازيكم على ما علمه منكم، من النيات والأعمال.\nتم تفسير سورة المنافقين،\nولله الحمد\n                                    "
    }
  }
]