[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ١",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ١\n                                    \n                                    \n                                    تفسير سورة الممتحنة وهي مدنية .\nكان سبب نزول صدر هذه السورة الكريمة قصة حاطب بن أبي بلتعة ، وذلك أن حاطبا هذا كان رجلا من المهاجرين ، وكان من أهل بدر أيضا ، وكان له بمكة أولاد ومال ، ولم يكن من قريش أنفسهم ، بل كان حليفا لعثمان . فلما عزم رسول الله - صلى الله عليه وسلم - على فتح مكة لما نقض أهلها العهد ، فأمر النبي - صلى الله عليه وسلم - المسلمين بالتجهيز لغزوهم ، وقال : \" اللهم ، عم عليهم خبرنا \" . فعمد حاطب هذا فكتب كتابا ، وبعثه مع امرأة من قريش إلى أهل مكة ، يعلمهم بما عزم عليه رسول الله - صلى الله عليه وسلم - من غزوهم ، ليتخذ بذلك عندهم يدا ، فأطلع الله رسوله على ذلك استجابة لدعائه . فبعث في أثر المرأة فأخذ الكتاب منها ، وهذا بين في هذا الحديث المتفق على صحته . قال الإمام أحمد :\nحدثنا سفيان ، عن عمرو ، أخبرني حسن بن محمد بن علي ، أخبرني عبيد الله بن أبي رافع - وقال مرة : إن عبيد الله بن أبي رافع أخبره : أنه سمع عليا رضي الله عنه ، يقول : بعثني رسول الله - صلى الله عليه وسلم - أنا ، والزبير ، والمقداد فقال : \" انطلقوا حتى تأتوا روضة خاخ فإن بها ظعينة معها كتاب ، فخذوه منها \" . فانطلقنا تعادى بنا خيلنا حتى أتينا الروضة ، فإذا نحن بالظعينة ، قلنا : أخرجي الكتاب . قالت : ما معي كتاب . قلنا : لتخرجن الكتاب أو لنلقين الثياب . قال : فأخرجت الكتاب من عقاصها ، فأخذنا الكتاب فأتينا به رسول الله - صلى الله عليه وسلم - فإذا فيه : من حاطب بن أبي بلتعة إلى ناس من المشركين بمكة يخبرهم ببعض أمر رسول الله - صلى الله عليه وسلم - . فقال رسول الله - صلى الله عليه وسلم - : \" يا حاطب ، ما هذا ؟ \" . قال : لا تعجل علي ، إني كنت امرأ ملصقا في قريش ، ولم أكن من أنفسهم ، وكان من معك من المهاجرين لهم قرابات يحمون أهليهم بمكة ، فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ فيهم يدا يحمون بها قرابتي ، وما فعلت ذلك كفرا ولا ارتدادا عن ديني ولا رضا بالكفر بعد الإسلام . فقال رسول الله - صلى الله عليه وسلم - : \" إنه صدقكم \" . فقال عمر : دعني أضرب عنق هذا المنافق . فقال : \" إنه قد شهد بدرا ما يدريك لعل الله اطلع إلى أهل بدر فقال : اعملوا ما شئتم فقد غفرت لكم \" .\nوهكذا أخرجه الجماعة إلا ابن ماجه ، من غير وجه ، عن سفيان بن عيينة به . . وزاد البخاري في كتاب \" المغازي \" : فأنزل الله السورة : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء ) . وقال في كتاب التفسير : قال عمرو : ونزلت فيه : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء ) قال : \" لا أدري الآية في الحديث أو قال عمرو \" . قال البخاري : قال علي - يعني : ابن المديني - : قيل لسفيان في هذا : نزلت ( لا تتخذوا عدوي وعدوكم أولياء ) ؟ فقال سفيان : هذا في حديث الناس ، حفظته من عمرو ما تركت منه حرفا ، وما أرى أحدا حفظه غيري .\nوقد أخرجاه في الصحيحين من حديث حصين بن عبد الرحمن ، عن سعد بن عبيدة عن أبي عبد الرحمن السلمي ، عن علي قال : بعثني رسول الله - صلى الله عليه وسلم - وأبا مرثد والزبير بن العوام ، وكلنا فارس ، وقال : انطلقوا حتى تأتوا روضة خاخ ، فإن بها امرأة من المشركين معها كتاب من حاطب إلى المشركين : فأدركناها تسير على بعير لها حيث قال رسول الله - صلى الله عليه وسلم - فقلنا : الكتاب ؟ فقالت : ما معي كتاب . فأنخناها فالتمسنا فلم نر كتابا ، فقلنا : ما كذب رسول الله - صلى الله عليه وسلم - ! لتخرجن الكتاب أو لنجردنك . فلما رأت الجد أهوت إلى حجزتها وهي محتجزة بكساء فأخرجته . فانطلقنا بها إلى رسول الله - صلى الله عليه وسلم - فقال عمر : يا رسول الله ، قد خان الله ورسوله والمؤمنين ، فدعني فلأضرب عنقه . فقال : \" ما حملك على ما صنعت ؟ \" . قال : والله ما بي إلا أن أكون مؤمنا بالله ورسوله ، أردت أن تكون لي عند القوم يد يدفع الله بها عن أهلي ومالي ، وليس أحد من أصحابك إلا له هنالك من عشيرته من يدفع الله به عن أهله وماله . فقال : \" صدق ، لا تقولوا له إلا خيرا \" . فقال عمر : إنه قد خان الله ورسوله والمؤمنين ، فدعني فلأضرب عنقه . فقال : \" أليس من أهل بدر ؟ \" فقال : \" لعل الله قد اطلع إلى أهل بدر فقال : اعملوا ما شئتم فقد وجبت لكم الجنة - أو : قد غفرت لكم \" . فدمعت عينا عمر ، وقال : الله ورسوله أعلم .\nهذا لفظ البخاري في \" المغازي \" في غزوة بدر وقد روي من وجه آخر عن علي قال ابن أبي حاتم :\nحدثنا علي بن الحسن الهسنجاني ، حدثنا عبيد بن يعيش ، حدثنا إسحاق بن سليمان الرازي ، عن أبي سنان - هو سعيد بن سنان ، - عن عمرو بن مرة الجملي ، عن أبي البختري الطائي ، عن الحارث عن علي قال : لما أراد النبي - صلى الله عليه وسلم - أن يأتي مكة أسر إلى أناس من أصحابه أنه يريد مكة ، فيهم حاطب بن أبي بلتعة وأفشى في الناس أنه يريد خيبر . قال : فكتب حاطب بن أبي بلتعة إلى أهل مكة أن رسول الله - صلى الله عليه وسلم - يريدكم . فأخبر رسول الله - صلى الله عليه وسلم - قال : فبعثني رسول الله - صلى الله عليه وسلم - وأبا مرثد ، وليس منا رجل إلا وعنده فرس ، فقال : \" ائتوا روضة خاخ فإنكم ستلقون بها امرأة معها كتاب ، فخذوه منها \" . فانطلقنا حتى رأيناها بالمكان الذي ذكر رسول الله - صلى الله عليه وسلم - . فقلنا لها : هات الكتاب . فقالت : ما معي كتاب . فوضعنا متاعها وفتشناها فلم نجده في متاعها ، فقال أبو مرثد : لعله ألا يكون معها . فقلت : ما كذب رسول الله - صلى الله عليه وسلم - ولا كذبنا . فقلنا لها : لتخرجنه أو لنعرينك . فقالت : أما تتقون الله ؟ ! ألستم مسلمين ؟ فقلنا : لتخرجنه أو لنعرينك . قال عمرو بن مرة : فأخرجته من حجزتها . وقال حبيب بن أبي ثابت : أخرجته من قبلها . فأتينا به رسول الله - صلى الله عليه وسلم - فإذا الكتاب من حاطب بن أبي بلتعة . فقام عمر فقال : يا رسول الله ، خان الله ورسوله ، فائذن لي فلأضرب عنقه . فقال رسول الله : \" أليس قد شهد بدرا ؟ \" . قالوا : بلى . وقال عمر : بلى ، ولكنه قد نكث وظاهر أعداءك عليك . فقال رسول الله - صلى الله عليه وسلم - : \" فلعل الله اطلع إلى أهل بدر فقال : اعملوا ما شئتم ، إني بما تعملون بصير \" . ففاضت عينا عمر وقال : الله ورسوله أعلم . فأرسل رسول الله - صلى الله عليه وسلم - إلى حاطب فقال : \" يا حاطب ، ما حملك على ما صنعت ؟ \" . فقال : يا رسول الله ، إني كنت امرأ ملصقا في قريش ، وكان لي بها مال وأهل ، ولم يكن من أصحابك أحد إلا وله بمكة من يمنع أهله وماله ، فكتبت إليهم بذلك ووالله - يا رسول الله - إني لمؤمن بالله ورسوله . فقال رسول الله - صلى الله عليه وسلم - : \" صدق حاطب ، فلا تقولوا لحاطب إلا خيرا \" . قال حبيب بن أبي ثابت : فأنزل الله : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة ) الآية .\nوهكذا رواه ابن جرير ، عن ابن حميد ، عن مهران ، عن أبي سنان - سعيد بن سنان - بإسناده مثله . وقد ذكر ذلك أصحاب المغازي والسير ، فقال محمد بن إسحاق بن يسار في السيرة .\nحدثني محمد بن جعفر بن الزبير ، عن عروة بن الزبير وغيره من علمائنا قال : لما أجمع رسول الله - صلى الله عليه وسلم - المسير إلى مكة ، كتب حاطب بن أبي بلتعة كتابا إلى قريش يخبرهم بالذي أجمع عليه رسول الله - صلى الله عليه وسلم - من الأمر في السير إليهم ، ثم أعطاه امرأة - زعم محمد بن جعفر أنها من مزينة وزعم غيره أنها : سارة مولاة لبني عبد المطلب - وجعل لها جعلا على أن تبلغه قريشا فجعلته في رأسها ، ثم فتلت عليه قرونها ، ثم خرجت به . وأتى رسول الله - صلى الله عليه وسلم - الخبر من السماء بما صنع حاطب ، فبعث علي بن أبي طالب ، والزبير بن العوام ، فقال : \" أدركا امرأة قد كتب معها حاطب بكتاب إلى قريش ، يحذرهم ما قد أجمعنا له من أمرهم \" .\nفخرجا حتى أدركاها بالخليفة - خليفة بني أبي أحمد - فاستنزلاها بالخليفة ، فالتمسا في رحلها فلم يجدا شيئا ، فقال لها علي بن أبي طالب : إني أحلف بالله ما كذب رسول الله وما كذبنا ولتخرجن لنا هذا الكتاب أو لنكشفنك . فلما رأت الجد منه قالت : أعرض . فأعرض ، فحلت قرون رأسها ، فاستخرجت الكتاب منها ، فدفعته إليه . فأتى به رسول الله - صلى الله عليه وسلم - فدعا رسول الله حاطبا فقال : \" يا حاطب ما حملك على هذا ؟ \" . فقال : يا رسول الله ، أما والله إني لمؤمن بالله ورسوله ما غيرت ولا بدلت ، ولكني كنت امرأ ليس لي في القوم من أهل ولا عشيرة ، وكان لي بين أظهرهم ولد وأهل فصانعتهم عليهم فقال عمر بن الخطاب : يا رسول الله ، دعني فلأضرب عنقه ، فإن الرجل قد نافق . فقال رسول الله - صلى الله عليه وسلم - : \" وما يدريك يا عمر ! لعل الله قد اطلع إلى أصحاب بدر يوم بدر فقال : اعملوا ما شئتم ، فقد غفرت لكم \" . فأنزل الله ، عز وجل ، في حاطب : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة ) إلى قوله : ( قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العداوة والبغضاء أبدا حتى تؤمنوا بالله وحده ) [ الممتحنة : 4 ] إلى آخر القصة .\nوروى معمر ، عن الزهري ، عن عروة نحو ذلك . وهكذا ذكر مقاتل بن حيان : أن هذه الآيات نزلت في حاطب بن أبي بلتعة : أنه بعث سارة مولاة بني هاشم ، وأنه أعطاها عشرة دراهم ، وأن رسول الله - صلى الله عليه وسلم - بعث في أثرها عمر بن الخطاب ، وعلي بن أبي طالب ، رضي الله عنهما ، فأدركاها بالجحفة . . . وذكر تمام القصة كنحو ما تقدم . وعن السدي قريبا منه . وهكذا قال العوفي ، عن ابن عباس ، ومجاهد ، وقتادة ، وغير واحد : أن هذه الآيات نزلت في حاطب بن أبي بلتعة .\nفقوله تعالى : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة وقد كفروا بما جاءكم من الحق ) يعني : المشركين والكفار الذين هم محاربون لله ولرسوله وللمؤمنين ، الذين شرع الله عداوتهم ومصارمتهم ، ونهى أن يتخذوا أولياء ، وأصدقاء ، وأخلاء ، كما قال ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم ) [ المائدة : 51 ] . وهذا تهديد شديد ووعيد أكيد ، وقال تعالى : ( يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم والكفار أولياء واتقوا الله إن كنتم مؤمنين ) [ المائدة : 57 ] وقال تعالى : ( يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء من دون المؤمنين أتريدون أن تجعلوا لله عليكم سلطانا مبينا ) [ النساء : 144 ] . وقال تعالى : ( لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه ) [ آل عمران : 28 ] ; ولهذا قبل رسول الله - صلى الله عليه وسلم - عذر حاطب لما ذكر أنه إنما فعل ذلك مصانعة لقريش ، لأجل ما كان له عندهم من الأموال والأولاد .\nويذكر ها هنا الحديث الذي رواه الإمام أحمد :\nحدثنا مصعب بن سلام ، حدثنا الأجلح ، عن قيس بن أبي مسلم ، عن ربعي بن حراش ، سمعت حذيفة يقول : ضرب لنا رسول الله - صلى الله عليه وسلم - أمثالا : واحدا ، وثلاثة ، وخمسة ، وسبعة ، وتسعة ، وأحد عشر - قال : فضرب لنا منها مثلا وترك سائرها ، قال : \" إن قوما كانوا أهل ضعف ومسكنة ، قاتلهم أهل تجبر وعداء ، فأظهر الله أهل الضعف عليهم ، فعمدوا إلى عدوهم فاستعملوهم وسلطوهم ، فأسخطوا الله عليهم إلى يوم يلقونه \" .\nوقوله : ( يخرجون الرسول وإياكم ) هذا مع ما قبله من التهييج على عداوتهم وعدم موالاتهم ، لأنهم أخرجوا الرسول وأصحابه من بين أظهرهم كراهة لما هم عليه من التوحيد وإخلاص العبادة لله وحده ; ولهذا قال : ( أن تؤمنوا بالله ربكم ) أي : لم يكن لكم عندهم ذنب إلا إيمانكم بالله رب العالمين ، كقوله : ( وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد ) [ البروج : 8 ] ، وكقوله ( الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله ) [ الحج : 40 ] .\nوقوله : ( إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي ) أي : إن كنتم كذلك فلا تتخذوهم أولياء ، إن كنتم خرجتم مجاهدين في سبيلي باغين لمرضاتي عنكم فلا توالوا أعدائي وأعداءكم ، وقد أخرجوكم من دياركم وأموالكم حنقا عليكم وسخطا لدينكم .\nوقوله : ( تسرون إليهم بالمودة وأنا أعلم بما أخفيتم وما أعلنتم ) أي : تفعلون ذلك وأنا العالم بالسرائر والضمائر والظواهر ( ومن يفعله منكم فقد ضل سواء السبيل)\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ١\n                                    \n                                    \n                                    مدنية في قول الجميع ، وهي ثلاث عشرة آية .\nالممتحنة ( بكسر الحاء ) أي المختبرة ، أضيف الفعل إليها مجازا ، كما سميت سورة \" التوبة \" المبعثرة والفاضحة ; لما كشفت من عيوب المنافقين . ومن قال في هذه السورة : الممتحنة ( بفتح الحاء ) فإنه أضافها إلى المرأة التي نزلت فيها ، وهي أم كلثوم بنت عقبة بن أبي معيط ، قال الله تعالى : فامتحنوهن الله أعلم بإيمانهن الآية . وهي امرأة عبد الرحمن بن عوف ، ولدت له إبراهيم بن عبد الرحمن .\nبسم الله الرحمن الرحيم\nيا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة وقد كفروا بما جاءكم من الحق يخرجون الرسول وإياكم أن تؤمنوا بالله ربكم إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي تسرون إليهم بالمودة وأنا أعلم بما أخفيتم وما أعلنتم ومن يفعله منكم فقد ضل سواء السبيل\nقوله تعالى : يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء عدى اتخذ إلى مفعولين وهما عدوكم أولياء . والعدو فعول من عدا ، كعفو من عفا . ولكونه على زنة المصدر أوقع على الجماعة إيقاعه على الواحد .\nوفي هذه الآية سبع مسائل :\nالأولى : قوله تعالى : يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم روى الأئمة - واللفظ لمسلم - عن علي رضي الله عنه قال : بعثنا رسول الله صلى الله عليه وسلم أنا والزبير والمقداد فقال : \" ائتوا روضة خاخ فإن بها ظعينة معها كتاب فخذوه منها \" ، فانطلقنا تعادى بنا خيلنا ، فإذا نحن بالمرأة ، فقلنا : أخرجي الكتاب ، فقالت : ما معي كتاب . فقلنا : لتخرجن الكتاب أو لتلقين الثياب ، فأخرجته من عقاصها . فأتينا به رسول الله صلى الله عليه وسلم فإذا فيه : من حاطب بن أبي بلتعة . . . إلى ناس من المشركين من أهل مكة يخبرهم ببعض أمر رسول الله صلى الله عليه وسلم . فقال رسول الله صلى الله عليه وسلم : \" يا حاطب ، ما هذا ؟ \" قال : لا تعجل علي يا رسول الله ، إني كنت امرأ ملصقا في قريش - قال سفيان : كان حليفا لهم ، ولم يكن من أنفسها - وكان ممن كان معك من المهاجرين لهم قرابات يحمون بها أهليهم ، فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ فيهم يدا يحمون بها قرابتي ، ولم أفعله كفرا ولا ارتدادا عن ديني ، ولا رضا بالكفر بعد الإسلام . فقال النبي صلى الله عليه وسلم : \" صدق \" . فقال عمر : دعني يا رسول الله أضرب عنق هذا المنافق . فقال : \" إنه قد شهد بدرا ، وما يدريك لعل الله اطلع على أهل بدر فقال : اعملوا ما شئتم فقد غفرت لكم \" . فأنزل الله عز وجل : يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء . قيل : اسم المرأة سارة من موالي قريش . وكان في الكتاب : \" أما بعد ، فإن رسول الله صلى الله عليه وسلم قد توجه إليكم بجيش كالليل يسير كالسيل ، وأقسم بالله لو لم يسر إليكم إلا وحده لأظفره الله بكم ، وأنجز له موعده فيكم ، فإن الله وليه وناصره . ذكره بعض المفسرين . وذكر القشيري والثعلبي : أن حاطب بن أبي بلتعة كان رجلا من أهل اليمن ، وكان له حلف بمكة في بني أسد بن عبد العزى رهط الزبير بن العوام . وقيل : كان حليفا للزبير بن العوام ، فقدمت من مكة سارة مولاة أبي عمرو بن صيفي بن هشام بن عبد مناف إلى المدينة ، ورسول الله صلى الله عليه وسلم يتجهز لفتح مكة . وقيل : كان هذا في زمن الحديبية ; فقال لها رسول الله صلى الله عليه وسلم : \" أمهاجرة جئت يا سارة ؟ \" . فقالت : لا . قال : \" أمسلمة جئت ؟ \" قالت : لا . قال : \" فما جاء بك ؟ \" قالت : كنتم الأهل والموالي والأصل والعشيرة ، وقد ذهب الموالي - تعني قتلوا يوم بدر - وقد احتجت حاجة شديدة فقدمت عليكم لتعطوني وتكسوني ; فقال عليه الصلاة والسلام : \" فأين أنت عن شباب أهل مكة \" وكانت مغنية ، قالت : ما طلب مني شيء بعد وقعة بدر . فحث رسول الله صلى الله عليه وسلم بني عبد المطلب وبني المطلب على إعطائها ; فكسوها وأعطوها وحملوها فخرجت إلى مكة ، وأتاها حاطب فقال : أعطيك عشرة دنانير وبردا على أن تبلغي هذا الكتاب إلى أهل مكة . وكتب في الكتاب : أن رسول الله صلى الله عليه وسلم يريدكم فخذوا حذركم . فخرجت سارة ، ونزل جبريل فأخبر النبي صلى الله عليه وسلم بذلك ، فبعث عليا والزبير وأبا مرثد الغنوي . وفي رواية : عليا والزبير والمقداد . وفي رواية : أرسل عليا وعمار بن ياسر . وفي رواية : عليا وعمارا وعمر والزبير وطلحة والمقداد وأبا مرثد - وكانوا كلهم فرسانا - وقال لهم : \" انطلقوا حتى تأتوا روضة خاخ فإن بها ظعينة ومعها كتاب من حاطب إلى المشركين ، فخذوه منها وخلوا سبيلها ، فإن لم تدفعه لكم فاضربوا عنقها \" فأدركوها في ذلك المكان ، فقالوا لها : أين الكتاب ؟ فحلفت ما معها كتاب ، ففتشوا أمتعتها فلم يجدوا معها كتابا ، فهموا بالرجوع فقال علي : والله ما كذبنا ولا كذبنا ! وسل سيفه وقال : أخرجي الكتاب وإلا والله لأجردنك ولأضربن عنقك ، فلما رأت الجد أخرجته من ذؤابتها - وفي رواية من حجزتها - فخلوا سبيلها ورجعوا بالكتاب إلى رسول الله صلى الله عليه وسلم . فأرسل إلى حاطب فقال : \" هل تعرف الكتاب ؟ \" قال : نعم . وذكر الحديث بنحو ما تقدم . وروي أن النبي صلى الله عليه وسلم أمن جميع الناس يوم الفتح إلا أربعة هي أحدهم .\nالثانية : السورة أصل في النهي عن موالاة الكفار . وقد مضى ذلك في غير موضع . من ذلك قوله تعالى : لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين . يا أيها الذين آمنوا لا تتخذوا بطانة من دونكم . يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء . ومثله كثير . وذكر أن حاطبا لما سمع يا أيها الذين آمنوا غشي عليه من الفرح بخطاب الإيمان .\nالثالثة : قوله تعالى : تلقون إليهم بالمودة يعني بالظاهر ; لأن قلب حاطب كان سليما ; بدليل أن النبي صلى الله عليه وسلم قال لهم : \" أما صاحبكم فقد صدق \" وهذا نص في سلامة فؤاده وخلوص اعتقاده . والباء في بالمودة زائدة ; كما تقول : قرأت السورة وقرأت بالسورة ، ورميت إليه ما في نفسي وبما في نفسي . ويجوز أن تكون ثابتة على أن مفعول تلقون محذوف ; معناه تلقون إليهم أخبار رسول الله صلى الله عليه وسلم بسبب المودة التي بينكم وبينهم . وكذلك : تسرون إليهم بالمودة أي بسبب المودة . وقال الفراء : تلقون إليهم بالمودة من صلة أولياء ، ودخول الباء في المودة وخروجها سواء . ويجوز أن تتعلق ب لا تتخذوا حالا من ضميره . وب أولياء صفة له ، ويجوز أن تكون استئنافا . ومعنى تلقون إليهم بالمودة تخبرونهم بسرائر المسلمين وتنصحون لهم ; وقاله الزجاج .\nالرابعة : من كثر تطلعه على عورات المسلمين وينبه عليهم ويعرف عدوهم بأخبارهم لم يكن بذلك كافرا إذا كان فعله لغرض دنيوي ، واعتقاده على ذلك سليم ; كما فعل حاطب حين قصد بذلك اتخاذ اليد ولم ينو الردة عن الدين .\nالخامسة : إذا قلنا لا يكون بذلك كافرا فهل يقتل بذلك حدا أم لا ؟ اختلف الناس فيه ; فقال مالك وابن القاسم وأشهب : يجتهد في ذلك الإمام . وقال عبد الملك : إذا كانت عادته تلك قتل لأنه جاسوس ، وقد قال مالك بقتل الجاسوس - وهو صحيح لإضراره بالمسلمين وسعيه بالفساد في الأرض . ولعل ابن الماجشون إنما اتخذ التكرار في هذا لأن حاطبا أخذ في أول فعله . والله أعلم .\nالسادسة : فإن كان الجاسوس كافرا ، فقال الأوزاعي : يكون نقضا لعهده . وقال أصبغ : الجاسوس الحربي يقتل ، والجاسوس المسلم والذمي يعاقبان إلا إن تظاهرا على الإسلام فيقتلان . وقد روي عن علي بن أبي طالب رضي الله عنه أن النبي صلى الله عليه وسلم أتى بعين للمشركين اسمه فرات بن حيان ، فأمر به أن يقتل ; فصاح : يا معشر الأنصار ، أقتل وأنا أشهد أن لا إله إلا الله وأن محمدا رسول الله ! فأمر به النبي صلى الله عليه وسلم فخلى سبيله . ثم قال : \" إن منكم من أكله إلى إيمانه منهم فرات بن حيان \" . وقوله : \" وقد كفروا \" حال ، إما من : لا تتخذوا ، وإما من \" تلقون \" ؛ أي لا تتولوهم أو توادوهم ، وهذه حالهم . وقرأ الجحدري \" لما جاءكم \" أي كفروا لأجل ما جاءكم من الحق .\nالسابعة : قوله تعالى : يخرجون الرسول استئناف كلام كالتفسير لكفرهم وعتوهم ، أو حال من كفروا . وإياكم أن تؤمنوا بالله ربكم تعليل ل يخرجون ؛ المعنى يخرجون الرسول ويخرجونكم من مكة لأن تؤمنوا بالله أي لأجل إيمانكم بالله . قال ابن عباس : وكان حاطب ممن أخرج مع النبي صلى الله عليه وسلم . وقيل : في الكلام تقديم وتأخير ، والتقدير لا تتخذوا عدوي وعدوكم أولياء إن كنتم خرجتم مجاهدين في سبيلي . وقيل : في الكلام حذف ، والمعنى إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي ، فلا تلقوا إليهم بالمودة .\nقيل : إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي شرط وجوابه مقدم . والمعنى إن كنتم خرجتم جهادا في سبيلي فلا تتخذوا عدوي وعدوكم أولياء . ونصب جهادا وابتغاء ؛ لأنه مفعول . وقوله : تسرون إليهم بالمودة بدل من تلقون ومبين عنه . والأفعال تبدل من الأفعال ، كما قال تعالى : ومن يفعل ذلك يلق أثاما يضاعف له العذاب . وأنشد سيبويه :\nمتى تأتنا تلمم بنا في ديارنا تجد حطبا جزلا ونارا تأججا\nوقيل : هو على تقدير أنتم تسرون إليهم بالمودة ، فيكون استئنافا . وهذا كله معاتبة لحاطب . وهو يدل على فضله وكرامته ونصيحته لرسول الله صلى الله عليه وسلم وصدق إيمانه ، فإن المعاتبة لا تكون إلا من محب لحبيبه . كما قال :\nأعاتب ذا المودة من صديق إذا ما رابني منه اجتناب\nإذا ذهب العتاب فليس ود ويبقى الود ما بقي العتاب\nومعنى بالمودة أي بالنصيحة في الكتاب إليهم . والباء زائدة كما ذكرنا ، أو ثابتة غير زائدة .\nقوله تعالى : وأنا أعلم بما أخفيتم : أضمرتم ، وما أعلنتم : أظهرتم . والباء في بما زائدة ; يقال : علمت كذا ، وعلمت بكذا . وقيل : وأنا أعلم من كل أحد بما تخفون وما تعلنون ، فحذف من كل أحد . كما يقال : فلان أعلم وأفضل من غيره . وقال ابن عباس : وأنا أعلم بما أخفيتم في صدوركم ، وما أظهرتم بألسنتكم من الإقرار والتوحيد .\nومن يفعله منكم أي من يسر إليهم ويكاتبهم منكم .\nفقد ضل سواء السبيل أي أخطأ قصد الطريق .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ١\n                                        \n                                        \n                                        \n                                        ذكر كثير من المفسرين، [رحمهم الله]، أن سبب نزول هذه الآيات الكريمات في قصة حاطب بن أبي بلتعة، حين غزا النبي صلى الله عليه وسلم غزوة الفتح، فكتب حاطب إلى قريش يخبرهم بمسير رسول الله صلى الله عليه وسلم إليهم، ليتخذ بذلك يدا عندهم لا [شكا و] نفاقا، وأرسله مع امرأة، فأخبر النبي صلى الله عليه وسلم بشأنه، فأرسل إلى المرأة قبل وصولها وأخذ منها الكتاب.\nوعاتب حاطبا، فاعتذر رضي الله عنه بعذر قبله النبي صلى الله عليه وسلم، وهذه الآيات فيها النهي الشديد عن موالاة الكفار من المشركين وغيرهم، وإلقاء المودة إليهم، وأن ذلك مناف للإيمان، ومخالف لملة إبراهيم الخليل عليه الصلاة والسلام، ومناقض للعقل الذي يوجب الحذر كل الحذر من العدو، الذي لا يبقي من مجهوده في العداوة شيئا، وينتهز الفرصة في إيصال الضرر إلى عدوه، فقال تعالى: { يَا أَيُّهَا الَّذِينَ آمَنُوا } اعملوا بمقتضى إيمانكم، من ولاية من قام بالإيمان، ومعاداة من عاداه، فإنه عدو لله، وعدو للمؤمنين.\nفلا تتخذوا عدو الله { وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ } أي: تسارعون في مودتهم وفي السعي بأسبابها، فإن المودة إذا حصلت، تبعتها النصرة والموالاة، فخرج العبد من الإيمان، وصار من جملة أهل الكفران، وانفصل عن أهل الإيمان.\nوهذا المتخذ للكافر وليا، عادم المروءة أيضا، فإنه كيف يوالي أعدى أعدائه الذي لا يريد له إلا الشر، ويخالف ربه ووليه الذي يريد به الخير، ويأمره به، ويحثه عليه؟! ومما يدعو المؤمن أيضا إلى معاداة الكفار، أنهم قد كفروا بما جاء المؤمنين من الحق، ولا أعظم من هذه المخالفة والمشاقة، فإنهم قد كفروا بأصل دينكم، وزعموا أنكم ضلال على غير هدى.\nوالحال أنهم كفروا بالحق الذي لا شك فيه ولا مرية، ومن رد الحق فمحال أن يوجد له دليل أو حجة تدل على صحة قوله، بل مجرد العلم بالحق يدل على بطلان قول من رده وفساده.\nومن عداوتهم البليغة أنهم { يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ } أيها المؤمنون من دياركم، ويشردونكم من أوطانكم، ولا ذنب لكم في ذلك عندهم، إلا أنكم تؤمنون بالله ربكم الذي يتعين على الخلق كلهم القيام بعبوديته، لأنه رباهم، وأنعم عليهم، بالنعم الظاهرة والباطنة، وهو الله تعالى.\nفلما أعرضوا عن هذا الأمر، الذي هو أوجب الواجبات، وقمتم به، عادوكم، وأخرجوكم - من أجله - من دياركم، فأي دين، وأي مروءة وعقل، يبقى مع العبد إذا والى الكفار الذين هذا وصفهم في كل زمان أو مكان؟\" ولا يمنعهم منه إلا خوف، أو مانع قوي.\n{ إِنْ كُنْتُمْ خَرَجْتُمْ جِهَادًا فِي سَبِيلِي وَابْتِغَاءَ مَرْضَاتِي } أي: إن كان خروجكم مقصودكم به الجهاد في سبيل الله، لإعلاء كلمة الله، وابتغاء مرضاة الله فاعملوا بمقتضى هذا، من موالاة أولياء الله ومعاداة أعدائه، فإن هذا هو الجهاد في سبيله وهو من أعظم ما يتقرب به المتقربون إلى ربهم ويبتغون به رضاه.\n{ تُسِرُّونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِمَا أَخْفَيْتُمْ وَمَا أَعْلَنْتُمْ } أي: كيف تسرون المودة للكافرين وتخفونها، مع علمكم أن الله عالم بما تخفون وما تعلنون؟!، فهو وإن خفي على المؤمنين، فلا يخفى على الله تعالى، وسيجازي العباد بما يعلمه منهم من الخير والشر، { وَمَنْ يَفْعَلْهُ مِنْكُمْ } أي: موالاة الكافرين بعد ما حذركم الله منها { فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ } لأنه سلك مسلكا مخالفا للشرع وللعقل والمروءة الإنسانية.\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ ٢",
    "tafsier": {
      "ibnkther": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ ٢\n                                    \n                                    \n                                    إن يثقفوكم يكونوا لكم أعداء ويبسطوا إليكم أيديهم وألسنتهم بالسوء ) أي : لو قدروا عليكم لما اتقوا فيكم من أذى ينالونكم به بالمقال والفعال . ( وودوا لو تكفرون ) أي : ويحرصون على ألا تنالوا خيرا ، فهم عداوتهم لكم كامنة وظاهرة ، فكيف توالون مثل هؤلاء ؟ وهذا تهييج على عداوتهم أيضا .\n                                    ",
      "qortoby": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : إن يثقفوكم يكونوا لكم أعداء ويبسطوا إليكم أيديهم وألسنتهم بالسوء وودوا لو تكفرون\nقوله تعالى : \" إن يثقفوكم \" : يلقوكم ويصادفوكم ; ومنه المثاقفة ; أي طلب مصادفة الغرة في المسايفة وشبهها . وقيل : يثقفوكم يظفروا بكم ويتمكنوا منكم .\nيكونوا لكم أعداء ويبسطوا إليكم أيديهم وألسنتهم بالسوء أي أيديهم بالضرب والقتل ، وألسنتهم بالشتم .\nوودوا لو تكفرون بمحمد ; فلا تناصحوهم فإنهم لا يناصحونكم .\n                                    ",
      "saadi": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ ٢\n                                        \n                                        \n                                        \n                                        ثم بين تعالى شدة عداوتهم، تهييجا للمؤمنين على عداوتهم، { إِنْ يَثْقَفُوكُمْ } أي: يجدوكم، وتسنح لهم الفرصة في أذاكم، { يَكُونُوا لَكُمْ أَعْدَاءً } ظاهرين { وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ } بالقتل والضرب، ونحو ذلك.\n{ وَأَلْسِنَتَهُمْ بِالسُّوءِ } أي: بالقول الذي يسوء، من شتم وغيره، { وَوَدُّوا لَوْ تَكْفُرُونَ } فإن هذا غاية ما يريدون منكم.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٣",
    "tafsier": {
      "ibnkther": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٣\n                                    \n                                    \n                                    وقوله : ( لن تنفعكم أرحامكم ولا أولادكم يوم القيامة يفصل بينكم والله بما تعملون بصير ) أي : قراباتكم لا تنفعكم عند الله إذا أراد الله بكم سوءا ، ونفعهم لا يصل إليكم إذا أرضيتموهم بما يسخط الله ، ومن وافق أهله على الكفر ليرضيهم فقد خاب وخسر وضل عمله ، ولا ينفعه عند الله قرابته من أحد ، ولو كان قريبا إلى نبي من الأنبياء . قال الإمام أحمد :\nحدثنا عفان ، حدثنا حماد ، عن ثابت ، عن أنس أن رجلا قال : يا رسول الله : أين أبي ؟ قال : \" في النار \" فلما قفى دعاه فقال : \" إن أبي وأباك في النار \" .\nورواه مسلم ، وأبو داود ، من حديث حماد بن سلمة به .\n                                    ",
      "qortoby": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٣\n                                    \n                                    \n                                    قوله تعالى : لن تنفعكم أرحامكم ولا أولادكم يوم القيامة يفصل بينكم والله بما تعملون بصير\nقوله تعالى : لن تنفعكم أرحامكم لما اعتذر حاطب بأن له أولادا وأرحاما فيما بينهم ، بين الرب عز وجل أن الأهل والأولاد لا ينفعون شيئا يوم القيامة إن عصي من أجل ذلك .\nيفصل بينكم فيدخل المؤمنين الجنة ويدخل الكافرين النار . وفي يفصل قراءات سبع : قرأ عاصم \" يفصل \" بفتح الياء وكسر الصاد مخففا . وقرأ حمزة والكسائي مشددا إلا أنه على ما لم يسم فاعله . وقرأ طلحة والنخعي بالنون وكسر الصاد مشددة . وروي عن علقمة كذلك بالنون مخففة . وقرأ قتادة وأبو حيوة \" يفصل \" بضم الياء وكسر الصاد مخففة من أفصل . وقرأ الباقون \" يفصل \" بياء مضمومة وتخفيف الفاء وفتح الصاد على الفعل المجهول ، واختاره أبو عبيد . فمن خفف فلقوله : وهو خير الفاصلين وقوله : إن يوم الفصل . ومن شدد فلأن ذلك أبين في الفعل الكثير المكرر المتردد . ومن أتى به على ما لم يسم فاعله فلأن الفاعل معروف . ومن أتى به مسمى الفاعل رد الضمير إلى الله تعالى . ومن قرأ بالنون فعلى التعظيم .\nوالله بما تعملون بصير\n                                    ",
      "saadi": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٣\n                                        \n                                        \n                                        \n                                        فإن احتججتم وقلتم: نوالي الكفار لأجل القرابة والأموال، فلن تغني عنكم أموالكم ولا أولادكم من الله شيئا. { والله بما تعملون بصير } فلذلك حذركم من موالاة الكافرين الذين تضركم موالاتهم.\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٤",
    "tafsier": {
      "ibnkther": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٤\n                                    \n                                    \n                                    يقول تعالى لعباده المؤمنين الذين أمرهم بمصارمة الكافرين ، وعداوتهم ، ومجانبتهم ، والتبري منهم : ( قد كانت لكم أسوة حسنة في إبراهيم والذين معه ) أي : وأتباعه الذين آمنوا معه ( إذ قالوا لقومهم إنا برآء منكم ) أي : تبرأنا منكم ( ومما تعبدون من دون الله كفرنا بكم ) أي : بدينكم وطريقكم ( وبدا بيننا وبينكم العداوة والبغضاء أبدا ) يعني : وقد شرعت العداوة والبغضاء من الآن بيننا وبينكم ، ما دمتم على كفركم فنحن أبدا نتبرأ منكم ونبغضكم ( حتى تؤمنوا بالله وحده ) أي : إلى أن توحدوا الله فتعبدوه وحده لا شريك له ، وتخلعوا ما تعبدون معه من الأنداد والأوثان .\nوقوله : ( إلا قول إبراهيم لأبيه لأستغفرن لك ) أي : لكم في إبراهيم وقومه أسوة حسنة تتأسون بها ، إلا في استغفار إبراهيم لأبيه ، فإنه إنما كان عن موعدة وعدها إياه ، فلما تبين له أنه عدو لله تبرأ منه . وذلك أن بعض المؤمنين كانوا يدعون لآبائهم الذين ماتوا على الشرك ويستغفرون لهم ، ويقولون : إن إبراهيم كان يستغفر لأبيه ، فأنزل الله ، عز وجل : ( ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى من بعد ما تبين لهم أنهم أصحاب الجحيم وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه إن إبراهيم لأواه حليم ) [ التوبة : 113 ، 114 ] . وقال تعالى في هذه الآية الكريمة : ( قد كانت لكم أسوة حسنة في إبراهيم والذين معه ) إلى قوله : ( إلا قول إبراهيم لأبيه لأستغفرن لك وما أملك لك من الله من شيء ) أي : ليس لكم في ذلك أسوة ، أي : في الاستغفار للمشركين ، هكذا قال ابن عباس ، ومجاهد ، وقتادة ، ومقاتل ، والضحاك ، وغير واحد .\nثم قال تعالى مخبرا عن قول إبراهيم والذين معه ، حين فارقوا قومهم وتبرءوا منهم ، فلجئوا إلى الله وتضرعوا إليه فقالوا : ( ربنا عليك توكلنا وإليك أنبنا وإليك المصير ) أي : توكلنا عليك في جميع الأمور ، وسلمنا أمورنا إليك ، وفوضناها إليك ( وإليك المصير ) أي : المعاد في الدار الآخرة .\n                                    ",
      "qortoby": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٤\n                                    \n                                    \n                                    قوله تعالى : قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العداوة والبغضاء أبدا حتى تؤمنوا بالله وحده إلا قول إبراهيم لأبيه لأستغفرن لك وما أملك لك من الله من شيء ربنا عليك توكلنا وإليك أنبنا وإليك المصير\nقوله تعالى : قد كانت لكم أسوة حسنة في إبراهيم لما نهى عز وجل عن موالاة الكفار ذكر قصة إبراهيم عليه السلام ، وأن من سيرته التبرؤ من الكفار ; أي فاقتدوا به وأتموا ; إلا في استغفاره لأبيه . والإسوة والأسوة ما يتأسى به ، مثل القدوة والقدوة . ويقال : هو إسوتك ; أي مثلك وأنت مثله . وقرأ عاصم أسوة بضم الهمزة لغتان .\nوالذين معه يعني أصحاب إبراهيم من المؤمنين . وقال ابن زيد : هم الأنبياء\nإذ قالوا لقومهم الكفار .\nإنا برآء منكم ومما تعبدون من دون الله أي الأصنام . وبرآء جمع بريء ; مثل شريك وشركاء ، وظريف وظرفاء . وقراءة العامة على وزن فعلاء . وقرأ عيسى بن عمر وابن أبي إسحاق \" براء \" بكسر الباء على وزن فعال ; مثل قصير وقصار ، وطويل وطوال ، وظريف وظراف . ويجوز ترك الهمزة حتى تقول : برا ; وتنون . وقرئ \" براء \" على الوصف بالمصدر . وقرئ \" براء \" على إبدال الضم من الكسر ; كرخال ورباب . والآية نص في الأمر بالاقتداء بإبراهيم عليه السلام في فعله . وذلك يصحح أن شرع من قبلنا شرع لنا فيما أخبر الله ورسوله .\n\" كفرنا بكم \" أي بما آمنتم به من الأوثان . وقيل : أي بأفعالكم وكذبناها وأنكرنا أن تكونوا على حق .\nوبدا بيننا وبينكم العداوة والبغضاء أبدا أي هذا دأبنا معكم ما دمتم على كفركم .\nحتى تؤمنوا بالله وحده فحينئذ تنقلب المعاداة موالاة .\nإلا قول إبراهيم لأبيه لأستغفرن لك فلا تتأسوا به في الاستغفار فتستغفرون للمشركين ; فإنه كان عن موعدة منه له ; قاله قتادة ومجاهد وغيرهما . وقيل : معنى الاستثناء أن إبراهيم هجر قومه وباعدهم إلا في الاستغفار لأبيه ، ثم بين عذره في سورة \" التوبة \" . وفي هذا دلالة على تفضيل نبينا عليه الصلاة والسلام على سائر الأنبياء ; لأنا حين أمرنا بالاقتداء به أمرنا أمرا مطلقا في قوله تعالى : وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا وحين أمرنا بالاقتداء بإبراهيم عليه السلام استثنى بعض أفعاله . وقيل : هو استثناء منقطع ; أي لكن قول إبراهيم لأبيه لأستغفرن لك ، إنما جرى لأنه ظن أنه أسلم ، فلما بان له أنه لم يسلم تبرأ منه . وعلى هذا يجوز الاستغفار لمن يظن أنه أسلم ; وأنتم لم تجدوا مثل هذا الظن ، فلم توالوهم .\nوما أملك لك من الله من شيء هذا من قول إبراهيم عليه السلام لأبيه ; أي ما أدفع عنك من عذاب الله شيئا إن أشركت به .\n\" ربنا عليك توكلنا \" هذا من دعاء إبراهيم عليه السلام وأصحابه . وقيل : علم المؤمنين أن يقولوا هذا . أي تبرءوا من الكفار وتوكلوا على الله وقولوا : ربنا عليك توكلنا ؛ أي اعتمدنا .\nوإليك أنبنا ؛ أي رجعنا .\n\" وإليك المصير \" لك الرجوع في الآخرة .\n                                    ",
      "saadi": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٤\n                                        \n                                        \n                                        \n                                        قد كان لكم يا معشر المؤمنين { أُسْوَةٌ حَسَنَةٌ } أي: قدوة صالحة وائتمام ينفعكم، { فِي إِبْرَاهِيمَ وَالَّذِينَ مَعَهُ } من المؤمنين، لأنكم قد أمرتم أن تتبعوا ملة إبراهيم حنيفا، { إِذْ قَالُوا لِقَوْمِهِمْ إِنَّا بُرَآءُ مِنْكُمْ وَمِمَّا تَعْبُدُونَ مِنْ دُونِ اللَّهِ } أي: إذ تبرأ إبراهيم عليه السلام ومن معه من المؤمنين، من قومهم المشركين ومما يعبدون من دون الله.\nثم صرحوا بعداوتهم غاية التصريح، فقالوا: { كَفَرْنَا بِكُمْ وَبَدَا } أي: ظهر وبان { بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَاءُ } أي: البغض بالقلوب، وزوال مودتها، والعداوة بالأبدان، وليس لتلك العداوة والبغضاء وقت ولا حد، بل ذلك { أَبَدًا } ما دمتم مستمرين على كفركم { حَتَّى تُؤْمِنُوا بِاللَّهِ وَحْدَهُ } أي: فإذا آمنتم بالله وحده، زالت العداوة والبغضاء، وانقلبت مودة وولاية، فلكم أيها المؤمنون أسوة [حسنة] في إبراهيم ومن معه في القيام بالإيمان والتوحيد، والقيام بلوازم ذلك ومقتضياته، وفي كل شيء تعبدوا به لله وحده، { إِلَّا } في خصلة واحدة وهي { قَوْلَ إِبْرَاهِيمَ لِأَبِيهِ } آزر المشرك، الكافر، المعاند، حين دعاه إلى الإيمان والتوحيد، فامتنع، فقال إبراهيم : { لَأَسْتَغْفِرَنَّ لَكَ و } الحال أني لا { أَمْلِكُ لَكَ مِنَ اللَّهِ مِنْ شَيْءٍ } لكني أدعو ربي عسى أن لا أكون بدعاء ربي شقيا، فليس لكم أن تقتدوا بإبراهيم في هذه الحالة التي دعا بها للمشرك، فليس لكم أن تدعوا للمشركين، وتقولوا: إنا في ذلك متبعون لملة إبراهيم، فإن الله ذكر عذر إبراهيم في ذلك بقوله: { وَمَا كَانَ اسْتِغْفَارُ إِبْرَاهِيمَ لِأَبِيهِ إِلَّا عَنْ مَوْعِدَةٍ وَعَدَهَا إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ إن إبراهيم لأواه حليم }\nولكم أسوة حسنة في إبراهيم ومن معه، حين دعوا الله وتوكلوا عليه وأنابوا إليه، واعترفوا بالعجز والتقصير، فقالوا: { رَبَّنَا عَلَيْكَ تَوَكَّلْنَا } أي: اعتمدنا عليك في جلب ما ينفعنا ودفع ما يضرنا، ووثقنا بك يا ربنا في ذلك.\n{ وَإِلَيْكَ أَنَبْنَا } أي: رجعنا إلى طاعتك ومرضاتك وجميع ما يقرب إليك، فنحن في ذلك ساعون، وبفعل الخيرات مجتهدون، ونعلم أنا إليك نصير، فسنستعد للقدوم عليك، ونعمل ما يقربنا الزلفى إليك\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٥",
    "tafsier": {
      "ibnkther": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٥\n                                    \n                                    \n                                    ( ربنا لا تجعلنا فتنة للذين كفروا ) قال مجاهد : معناه : لا تعذبنا بأيديهم ، ولا بعذاب من عندك ، فيقولوا : لو كان هؤلاء على حق ما أصابهم هذا . وكذا قال الضحاك .\nوقال قتادة لا تظهرهم علينا فيفتتنوا بذلك ، يرون أنهم إنما ظهروا علينا لحق هم عليه . واختاره ابن جرير .\nوقال علي بن أبي طلحة ، عن ابن عباس : لا تسلطهم علينا فيفتنونا .\nوقوله : ( واغفر لنا ربنا إنك أنت العزيز الحكيم ) أي : واستر ذنوبنا عن غيرك ، واعف عنها فيما بيننا وبينك ، ( إنك أنت العزيز الحكيم ) أي : الذي لا يضام من لاذ بجناحك ) الحكيم ) في أقوالك وأفعالك وشرعك وقدرك .\n                                    ",
      "qortoby": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٥\n                                    \n                                    \n                                    ربنا لا تجعلنا فتنة للذين كفروا أي لا تظهر عدونا علينا فيظنوا أنهم على حق فيفتتنوا بذلك . وقيل : لا تسلطهم علينا فيفتنونا ويعذبونا .\nواغفر لنا ربنا إنك أنت العزيز الحكيم\n                                    ",
      "saadi": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٥\n                                        \n                                        \n                                        \n                                        { رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا } أي: لا تسلطهم علينا بذنوبنا، فيفتنونا، ويمنعونا مما يقدرون عليه من أمور الإيمان، ويفتنون أيضا بأنفسهم، فإنهم إذا رأوا لهم الغلبة، ظنوا أنهم على الحق وأنا على الباطل، فازدادوا كفرا وطغيانا، { وَاغْفِرْ لَنَا } ما اقترفنا من الذنوب والسيئات، وما قصرنا به من المأمورات، { رَبَّنَا إِنَّكَ أَنْتَ الْعَزِيزُ } القاهر لكل شيء، { الْحَكِيمُ } الذي يضع الأشياء مواضعها، فبعزتك وحكمتك انصرنا على أعدائنا، واغفر لنا ذنوبنا، وأصلح عيوبنا.\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "لَقَدۡ كَانَ لَكُمۡ فِيهِمۡ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَۚ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ ٦",
    "tafsier": {
      "ibnkther": "لَقَدۡ كَانَ لَكُمۡ فِيهِمۡ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَۚ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ ٦\n                                    \n                                    \n                                    ثم قال تعالى : ( لقد كان لكم فيهم أسوة حسنة لمن كان يرجو الله واليوم الآخر ) وهذا تأكيد لما تقدم ومستثنى منه ما تقدم أيضا لأن هذه الأسوة المثبتة ها هنا هي الأولى بعينها .\nوقوله : ( لمن كان يرجو الله واليوم الآخر ) تهييج إلى ذلك كل مقر بالله والمعاد .\nوقوله : ( ومن يتول ) أي : عما أمر الله به ، ( فإن الله هو الغني الحميد ) كقوله ( إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد ) [ إبراهيم : 8 ] .\nوقال علي بن أبي طلحة عن ابن عباس : ( الغني ) الذي قد كمل في غناه ، وهو الله ، هذه صفته لا تنبغي إلا له ، ليس له كفء ، وليس كمثله شيء ، سبحان الله الواحد القهار . ) الحميد ) المستحمد إلى خلقه ، أي : هو المحمود في جميع أفعاله وأقواله ، لا إله غيره ، ولا رب سواه .\n                                    ",
      "qortoby": "لَقَدۡ كَانَ لَكُمۡ فِيهِمۡ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَۚ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ ٦\n                                    \n                                    \n                                    قوله تعالى : لقد كان لكم فيهم أسوة حسنة لمن كان يرجو الله واليوم الآخر ومن يتول فإن الله هو الغني الحميد عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة والله قدير والله غفور رحيم\nقوله تعالى : لقد كان لكم فيهم أي في إبراهيم ومن معه من الأنبياء والأولياء .\n\" أسوة حسنة \" أي في التبرؤ من الكفار . وقيل : كرر للتأكيد . وقيل : نزل الثاني بعد الأول بمدة ; وما أكثر المكررات في القرآن على هذا الوجه .\n\" ومن يتول \" أي عن الإسلام وقبول هذه المواعظ\nفإن الله هو الغني أي لم يتعبدهم لحاجته إليهم .\n\" الحميد \" في نفسه وصفاته . ولما نزلت عادى المسلمون أقرباءهم من المشركين فعلم الله شدة وجد المسلمين في ذلك فنزلت\n                                    ",
      "saadi": "لَقَدۡ كَانَ لَكُمۡ فِيهِمۡ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَۚ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ ٦\n                                        \n                                        \n                                        \n                                        ثم كرر الحث [لهم] على الاقتداء بهم، فقال: { لَقَدْ كَانَ لَكُمْ فِيهِمْ أُسْوَةٌ حَسَنَةٌ } وليس كل أحد تسهل عليه هذه الأسوة، وإنما تسهل على من { كَانَ يَرْجُو اللَّهَ وَالْيَوْمَ الْآخِرَ } فإن الإيمان واحتساب الأجر والثواب، يسهل على العبد كل عسير، ويقلل لديه كل كثير، ويوجب له الإكثار من الاقتداء بعباد الله الصالحين، والأنبياء والمرسلين، فإنه يرى نفسه مفتقرا ومضطرا إلى ذلك غاية الاضطرار.\n{ وَمَنْ يَتَوَلَّ } عن طاعة الله والتأسي برسل الله، فلن يضر إلا نفسه، ولا يضر الله شيئا، { فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ } الذي له الغنى التام [المطلق] من جميع الوجوه، فلا يحتاج إلى أحد من خلقه [بوجه]، { الْحَمِيدُ } في ذاته وأسمائه وصفاته وأفعاله، فإنه محمود على ذلك كله.\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "۞ عَسَى ٱللَّهُ أَن يَجۡعَلَ بَيۡنَكُمۡ وَبَيۡنَ ٱلَّذِينَ عَادَيۡتُم مِّنۡهُم مَّوَدَّةٗۚ وَٱللَّهُ قَدِيرٞۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٧",
    "tafsier": {
      "ibnkther": "۞ عَسَى ٱللَّهُ أَن يَجۡعَلَ بَيۡنَكُمۡ وَبَيۡنَ ٱلَّذِينَ عَادَيۡتُم مِّنۡهُم مَّوَدَّةٗۚ وَٱللَّهُ قَدِيرٞۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٧\n                                    \n                                    \n                                    يقول تعالى لعباده المؤمنين بعد أن أمرهم بعداوة الكافرين : ( عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة ) أي : محبة بعد البغضة ، ومودة بعد النفرة ، وألفة بعد الفرقة . ( والله قدير ) أي : على ما يشاء من الجمع بين الأشياء المتنافرة ، والمتباينة ، والمختلفة ، فيؤلف بين القلوب بعد العداوة والقساوة ، فتصبح مجتمعة متفقة ، كما قال تعالى ممتنا على الأنصار : ( واذكروا نعمة الله عليكم إذ كنتم أعداء فألف بين قلوبكم فأصبحتم بنعمته إخوانا وكنتم على شفا حفرة من النار فأنقذكم منها ) الآية [ آل عمران : 103 ] . وكذا قال لهم النبي - صلى الله عليه وسلم - : \" ألم أجدكم ضلالا فهداكم الله بي ، وكنتم متفرقين فألفكم الله بي ؟ \" . وقال الله تعالى : ( هو الذي أيدك بنصره وبالمؤمنين وألف بين قلوبهم لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم ولكن الله ألف بينهم إنه عزيز حكيم ) [ الأنفال : 62 ، 63 ] . وفي الحديث \" أحبب حبيبك هونا ما ، فعسى أن يكون بغيضك يوما ما . وأبغض بغيضك هونا ما ، فعسى أن يكون حبيبك يوما ما \" . وقال الشاعر\nوقد يجمع الله الشتيتين بعد ما يظنان كل الظن ألا تلاقيا\nوقوله تعالى : ( والله غفور رحيم ) أي : يغفر للكافرين كفرهم إذا تابوا منه وأنابوا إلى ربهم وأسلموا له ، وهو الغفور الرحيم بكل من تاب إليه ، من أي ذنب كان .\nوقد قال مقاتل بن حيان : إن هذه الآية نزلت في أبي سفيان صخر بن حرب ، فإن رسول الله - صلى الله عليه وسلم - تزوج ابنته فكانت هذه مودة ما بينه وبينه .\nوفي هذا الذي قاله مقاتل نظر ; فإن رسول الله تزوج بأم حبيبة بنت أبي سفيان قبل الفتح وأبو سفيان إنما أسلم ليلة الفتح بلا خلاف . وأحسن من هذا ما رواه ابن أبي حاتم حيث قال :\nقرئ على محمد بن عزيز : حدثني سلامة ، حدثني عقيل ، حدثني ابن شهاب ; أن رسول الله - صلى الله عليه وسلم - استعمل أبا سفيان بن حرب على بعض اليمن فلما قبض رسول الله - صلى الله عليه وسلم - أقبل فلقي ذا الخمار مرتدا ، فقاتله ، فكان أول من قاتل في الردة وجاهد عن الدين . قال ابن شهاب : وهو ممن أنزل الله فيه : ( عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة والله قدير والله غفور رحيم ) .\nوفي صحيح مسلم ، عن ابن عباس : أن أبا سفيان قال : يا رسول الله ، ثلاث أعطنيهن . قال : \" نعم \" . قال : وتؤمرني حتى أقاتل الكفار كما كنت أقاتل المسلمين . قال : \" نعم \" . قال : ومعاوية تجعله كاتبا بين يديك . قال : \" نعم \" . قال : وعندي أحسن العرب وأجمله ، أم حبيبة بنت أبي سفيان أزوجكها . . . الحديث . وقد تقدم الكلام عليه .\n                                    ",
      "qortoby": "۞ عَسَى ٱللَّهُ أَن يَجۡعَلَ بَيۡنَكُمۡ وَبَيۡنَ ٱلَّذِينَ عَادَيۡتُم مِّنۡهُم مَّوَدَّةٗۚ وَٱللَّهُ قَدِيرٞۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٧\n                                    \n                                    \n                                    عسى الله أن يجعل بينكم وبين الذين عاديتم منهم مودة وهذا بأن يسلم الكافر . وقد أسلم قوم منهم بعد فتح مكة وخالطهم المسلمون ; كأبي سفيان بن حرب ، والحارث بن هشام ، وسهيل بن عمرو ، وحكيم بن حزام . وقيل : المودة تزويج النبي صلى الله عليه وسلم أم حبيبة بنت أبي سفيان ; فلانت عند ذلك عريكة أبي سفيان ، واسترخت شكيمته في العداوة . قال ابن عباس : كانت المودة بعد الفتح تزويج النبي صلى الله عليه وسلم أم حبيبة بنت أبي سفيان ; وكانت تحت عبد الله بن جحش ، وكانت هي وزوجها من مهاجرة الحبشة . فأما زوجها فتنصر وسألها أن تتابعه على دينه فأبت وصبرت على دينها ، ومات زوجها على النصرانية . فبعث النبي صلى الله عليه وسلم إلى النجاشي فخطبها ; فقال النجاشي لأصحابه : من أولاكم بها ؟ قالوا : خالد بن سعيد بن العاص . قال : فزوجها من نبيكم . ففعل ; وأمهرها النجاشي من عنده أربعمائة دينار . وقيل : خطبها النبي صلى الله عليه وسلم إلى عثمان بن عفان ، فلما زوجه إياها بعث إلى النجاشي فيها ; فساق عنه المهر وبعث بها إليه . فقال أبو سفيان وهو مشرك لما بلغه تزويج النبي صلى الله عليه وسلم ابنته : ذلك الفحل لا يقدع أنفه . \" يقدع \" بالدال غير المعجمة ; يقال : هذا فحل لا يقدع أنفه ; أي لا يضرب أنفه . وذلك إذا كان كريما .\n                                    ",
      "saadi": "۞ عَسَى ٱللَّهُ أَن يَجۡعَلَ بَيۡنَكُمۡ وَبَيۡنَ ٱلَّذِينَ عَادَيۡتُم مِّنۡهُم مَّوَدَّةٗۚ وَٱللَّهُ قَدِيرٞۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٧\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى أن هذه العداوة التي أمر بها المؤمنين للمشركين، ووصفهم بالقيام بها أنهم ما داموا على شركهم وكفرهم، وأنهم إن انتقلوا إلى الإيمان، فإن الحكم يدور مع علته، فإن المودة الإيمانية ترجع، فلا تيأسوا أيها المؤمنون، من رجوعهم إلى الإيمان، فـ { عَسَى اللَّهُ أَنْ يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُمْ مِنْهُمْ مَوَدَّةً } سببها رجوعهم إلى الإيمان، { وَاللَّهُ قَدِيرٌ } على كل شيء، ومن ذلك هداية القلوب وتقليبها من حال إلى حال، { وَاللَّهُ غَفُورٌ رَحِيمٌ } لا يتعاظمه ذنب أن يغفره، ولا يكبر عليه عيب أن يستره، { قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ } وفي هذه الآية إشارة وبشارة إلى إسلام بعض المشركين، الذين كانوا إذ ذاك أعداء للمؤمنين، وقد وقع ذلك، ولله الحمد والمنة.\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٨",
    "tafsier": {
      "ibnkther": "لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٨\n                                    \n                                    \n                                    وقوله تعالى : ( لا ينهاكم الله عن الذين لم يقاتلوكم في الدين ولم يخرجوكم من دياركم ) أي لا ينهاكم عن الإحسان إلى الكفرة الذين لا يقاتلونكم في الدين ، كالنساء والضعفة منهم ، ( أن تبروهم ) أي : تحسنوا إليهم ( وتقسطوا إليهم ) أي : تعدلوا ( إن الله يحب المقسطين ) .\nقال الإمام أحمد : حدثنا أبو معاوية ، حدثنا هشام بن عروة ، عن فاطمة بنت المنذر ، عن أسماء - هي بنت أبي بكر ، رضي الله عنهما - قالت : قدمت أمي وهي مشركة في عهد قريش إذ عاهدوا ، فأتيت النبي - صلى الله عليه وسلم - فقلت : يا رسول الله ، إن أمي قدمت وهي راغبة ، أفأصلها ؟ قال : \" نعم ، صلي أمك \" أخرجاه .\nوقال الإمام أحمد : حدثنا عارم ، حدثنا عبد الله بن المبارك ، حدثنا مصعب بن ثابت ، حدثنا عامر بن عبد الله بن الزبير ، عن أبيه قال : قدمت قتيلة على ابنتها أسماء بنت أبي بكر بهدايا : صناب ، وأقط ، وسمن ، وهي مشركة ، فأبت أسماء أن تقبل هديتها ، وأن تدخلها بيتها ، فسألت عائشة النبي - صلى الله عليه وسلم - فأنزل الله ، عز وجل : ( لا ينهاكم الله عن الذين لم يقاتلوكم في الدين ) إلى آخر الآية ، فأمرها أن تقبل هديتها ، وأن تدخلها بيتها .\nوهكذا رواه ابن جرير ، وابن أبي حاتم ، من حديث مصعب بن ثابت به . وفي رواية لأحمد ، وابن جرير : \" قتيلة بنت عبد العزى بن عبد أسعد من بني مالك بن حسل . وزاد ابن أبي حاتم : \" في المدة التي كانت بين قريش ، ورسول الله - صلى الله عليه وسلم - \" .\nوقال أبو بكر أحمد بن عمرو بن عبد الخالق البزار : حدثنا عبد الله بن شبيب ، حدثنا أبو بكر بن أبي شيبة ، حدثنا أبو قتادة العدوي ، عن ابن أخي الزهري ، عن الزهري ، عن عروة عن عائشة وأسماء أنهما قالتا : قدمت علينا أمنا المدينة وهي مشركة ، في الهدنة التي كانت بين قريش وبين رسول الله - صلى الله عليه وسلم - فقلنا : يا رسول الله ، إن أمنا قدمت علينا المدينة راغبة ، أفنصلها ؟ قال : \" نعم ، فصلاها \" .\nثم قال : وهذا الحديث لا نعلمه يروى عن الزهري ، عن عروة ، عن عائشة إلا من هذا الوجه .\nقلت : وهو منكر بهذا السياق ; لأن أم عائشة هي أم رومان ، وكانت مسلمة مهاجرة ، وأم أسماء غيرها ، كما هو مصرح باسمها في هذه الأحاديث المتقدمة والله أعلم .\nوقوله : ( إن الله يحب المقسطين ) تقدم تفسير ذلك في سورة \" الحجرات \" ، وأورد الحديث الصحيح : \" المقسطون على منابر من نور عن يمين العرش ، الذين يعدلون في حكمهم ، وأهاليهم ، وما ولوا \" .\n                                    ",
      "qortoby": "لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٨\n                                    \n                                    \n                                    قوله تعالى : لا ينهاكم الله عن الذين لم يقاتلوكم في الدين فيه ثلاث مسائل :\nالأولى : هذه الآية رخصة من الله تعالى في صلة الذين لم يعادوا المؤمنين ولم يقاتلوهم . قال ابن زيد : كان هذا في أول الإسلام عند الموادعة وترك الأمر بالقتال ثم نسخ . قال قتادة : نسختها فاقتلوا المشركين حيث وجدتموهم . وقيل : كان هذا الحكم لعلة وهو الصلح ، فلما زال الصلح بفتح مكة نسخ الحكم وبقي الرسم يتلى . وقيل : هي مخصوصة في حلفاء النبي صلى الله عليه وسلم ومن بينه وبينه عهد لم ينقضه ; قاله الحسن . الكلبي : هم خزاعة وبنو الحارث بن عبد مناف . وقاله أبو صالح ، وقال : هم خزاعة . وقال مجاهد : هي مخصوصة في الذين آمنوا ولم يهاجروا . وقيل : يعني به النساء والصبيان لأنهم ممن لا يقاتل ; فأذن الله في برهم . حكاه بعض المفسرين . وقال أكثر أهل التأويل : هي محكمة . واحتجوا بأن أسماء بنت أبي بكر سألت النبي صلى الله عليه وسلم : هل تصل أمها حين قدمت عليها مشركة ؟ قال : \" نعم \" خرجه البخاري ومسلم . وقيل : إن الآية فيها نزلت . روى عامر بن عبد الله بن الزبير عن أبيه : أن أبا بكر الصديق طلق امرأته قتيلة في الجاهلية ، وهي أم أسماء بنت أبي بكر ، فقدمت عليهم في المدة التي كانت فيها المهادنة بين رسول الله صلى الله عليه وسلم وبين كفار قريش ، فأهدت إلى أسماء بنت أبي بكر الصديق قرطا وأشياء ; فكرهت أن تقبل منها حتى أتت رسول الله صلى الله عليه وسلم فذكرت ذلك له ، فأنزل الله تعالى : لا ينهاكم الله عن الذين لم يقاتلوكم في الدين . ذكر هذا الخبر الماوردي وغيره ، وخرجه أبو داود الطيالسي في مسنده .\nالثانية : قوله تعالى : \" أن تبروهم \" أن في موضع خفض على البدل من الذين ; أي لا ينهاكم الله عن أن تبروا الذين لم يقاتلوكم . وهم خزاعة ، صالحوا النبي صلى الله عليه وسلم على ألا يقاتلوه ولا يعينوا عليه أحدا ; فأمر ببرهم والوفاء لهم إلى أجلهم ; حكاه الفراء .\n\" وتقسطوا إليهم \" أي تعطوهم قسطا من أموالكم على وجه الصلة . وليس يريد به من العدل ; فإن العدل واجب فيمن قاتل وفيمن لم يقاتل ; قاله ابن العربي .\nالثالثة : قال القاضي أبو بكر في كتاب الأحكام له : \" استدل به بعض من تعقد عليه الخناصر على وجوب نفقة الابن المسلم على أبيه الكافر . وهذه وهلة عظيمة ، إذ الإذن في الشيء أو ترك النهي عنه لا يدل على وجوبه ، وإنما يعطيك الإباحة خاصة . وقد بينا أن إسماعيل بن إسحاق القاضي دخل عليه ذمي فأكرمه ، فأخذ عليه الحاضرون في ذلك ; فتلا هذه الآية عليهم \" .\n                                    ",
      "saadi": "لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٨\n                                        \n                                        \n                                        \n                                        ولما نزلت هذه الآيات الكريمات، المهيجة على عداوة الكافرين، وقعت من المؤمنين كل موقع، وقاموا بها أتم القيام، وتأثموا من صلة بعض أقاربهم المشركين، وظنوا أن ذلك داخل فيما نهى الله عنه.\nفأخبرهم الله أن ذلك لا يدخل في المحرم فقال: { لَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ لَمْ يُقَاتِلُوكُمْ فِي الدِّينِ وَلَمْ يُخْرِجُوكُمْ مِنْ دِيَارِكُمْ أَنْ تَبَرُّوهُمْ وَتُقْسِطُوا إِلَيْهِمْ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ } أي: لا ينهاكم الله عن البر والصلة، والمكافأة بالمعروف، والقسط للمشركين، من أقاربكم وغيرهم، حيث كانوا بحال لم ينتصبوا لقتالكم في الدين والإخراج من دياركم، فليس عليكم جناح أن تصلوهم، فإن صلتهم في هذه الحالة، لا محذور فيها ولا مفسدة كما قال تعالى عن الأبوين المشركين إذا كان ولدهما مسلما: { وَإِنْ جَاهَدَاكَ عَلى أَنْ تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا }\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "إِنَّمَا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَٰتَلُوكُمۡ فِي ٱلدِّينِ وَأَخۡرَجُوكُم مِّن دِيَٰرِكُمۡ وَظَٰهَرُواْ عَلَىٰٓ إِخۡرَاجِكُمۡ أَن تَوَلَّوۡهُمۡۚ وَمَن يَتَوَلَّهُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٩",
    "tafsier": {
      "ibnkther": "إِنَّمَا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَٰتَلُوكُمۡ فِي ٱلدِّينِ وَأَخۡرَجُوكُم مِّن دِيَٰرِكُمۡ وَظَٰهَرُواْ عَلَىٰٓ إِخۡرَاجِكُمۡ أَن تَوَلَّوۡهُمۡۚ وَمَن يَتَوَلَّهُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٩\n                                    \n                                    \n                                    وقوله : ( إنما ينهاكم الله عن الذين قاتلوكم في الدين وأخرجوكم من دياركم وظاهروا على إخراجكم أن تولوهم ) أي : إنما ينهاكم عن موالاة هؤلاء الذين ناصبوكم العداوة ، فقاتلوكم وأخرجوكم ، وعاونوا على إخراجكم ، ينهاكم الله عن موالاتهم ويأمركم بمعاداتهم . ثم أكد الوعيد على موالاتهم فقال : ( ومن يتولهم فأولئك هم الظالمون ) كقوله ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم إن الله لا يهدي القوم الظالمين ) [ المائدة : 51 ] .\n                                    ",
      "qortoby": "إِنَّمَا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَٰتَلُوكُمۡ فِي ٱلدِّينِ وَأَخۡرَجُوكُم مِّن دِيَٰرِكُمۡ وَظَٰهَرُواْ عَلَىٰٓ إِخۡرَاجِكُمۡ أَن تَوَلَّوۡهُمۡۚ وَمَن يَتَوَلَّهُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٩\n                                    \n                                    \n                                    قوله تعالى : إنما ينهاكم الله عن الذين قاتلوكم في الدين أي جاهدوكم على الدين .\nوأخرجوكم من دياركم وهم عتاة أهل مكة .\nوظاهروا على إخراجكم أي عاونوا على إخراجكم وهم مشركو أهل مكة .\n\" أن تولوهم \" أن في موضع جر على البدل على ما تقدم في أن تبروهم .\n\" ومن يتولهم \" أي يتخذهم أولياء وأنصارا وأحبابا\nفأولئك هم الظالمون\n                                    ",
      "saadi": "إِنَّمَا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَٰتَلُوكُمۡ فِي ٱلدِّينِ وَأَخۡرَجُوكُم مِّن دِيَٰرِكُمۡ وَظَٰهَرُواْ عَلَىٰٓ إِخۡرَاجِكُمۡ أَن تَوَلَّوۡهُمۡۚ وَمَن يَتَوَلَّهُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٩\n                                        \n                                        \n                                        \n                                        { إِنَّمَا يَنْهَاكُمُ اللَّهُ عَنِ الَّذِينَ قَاتَلُوكُمْ فِي الدِّينِ } أي: لأجل دينكم، عداوة لدين الله ولمن قام به، { وَأَخْرَجُوكُمْ مِنْ دِيَارِكُمْ وَظَاهَرُوا } أي: عاونوا غيرهم { عَلَى إِخْرَاجِكُمْ } نهاكم الله { أَنْ تَوَلَّوْهُمْ } بالمودة والنصرة، بالقول والفعل، وأما بركم وإحسانكم، الذي ليس بتول للمشركين، فلم ينهكم الله عنه، بل ذلك داخل في عموم الأمر بالإحسان إلى الأقارب وغيرهم من الآدميين، وغيرهم.\n{ وَمَنْ يَتَوَلَّهُمْ فَأُولَئِكَ هُمُ الظَّالِمُونَ } وذلك الظلم يكون بحسب التولي، فإن كان توليا تاما، صار ذلك كفرا مخرجا عن دائرة الإسلام، وتحت ذلك من المراتب ما هو غليظ، وما هو دون ذلك.\n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡ‍َٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡ‍َٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٠١",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡ‍َٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡ‍َٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٠١\n                                    \n                                    \n                                    تقدم في سورة \" الفتح \" ذكر صلح الحديبية الذي وقع بين رسول الله - صلى الله عليه وسلم - وبين كفار قريش فكان فيه : \" على ألا يأتيك منا رجل - وإن كان على دينك - إلا رددته إلينا \" . وفي رواية : \" على أنه لا يأتيك منا أحد - وإن كان على دينك - إلا رددته إلينا \" . وهذا قول عروة ، والضحاك ، وعبد الرحمن بن زيد ، والزهري ، ومقاتل ، والسدي . فعلى هذه الرواية تكون هذه الآية مخصصة للسنة ، وهذا من أحسن أمثلة ذلك ، وعلى طريقة بعض السلف ناسخة ، فإن الله ، عز وجل ، أمر عباده المؤمنين إذا جاءهم النساء مهاجرات أن يمتحنوهن ، فإن علموهن مؤمنات فلا يرجعوهن إلى الكفار ، لا هن حل لهم ولا هم يحلون لهن .\nوقد ذكرنا في ترجمة عبد الله بن أبي أحمد بن جحش ، من المسند الكبير ، من طريق أبي بكر بن أبي عاصم ، عن محمد بن يحيى الذهلي ، عن يعقوب بن محمد ، عن عبد العزيز بن عمران ، عن مجمع بن يعقوب ، عن حسين بن أبي لبانة ، عن عبد الله بن أبي أحمد قال : هاجرت أم كلثوم بنت عقبة بن أبي معيط في الهجرة ، فخرج أخواها عمارة ، والوليد حتى قدما على رسول الله - صلى الله عليه وسلم - فكلماه فيها أن يردها إليهما ، فنقض الله العهد بينه وبين المشركين في النساء خاصة ، ومنعهن أن يرددن إلى المشركين ، وأنزل الله آية الامتحان .\nقال ابن جرير : حدثنا أبو كريب ، حدثنا يونس بن بكير ، عن قيس بن الربيع ، عن الأغر بن الصباح ، عن خليفة ، عن حصين ، عن أبي نصر الأسدي قال : سئل ابن عباس : كيف كان امتحان رسول الله - صلى الله عليه وسلم - النساء ؟ قال : كان يمتحنهن : بالله ما خرجت من بغض زوج ؟ وبالله ما خرجت رغبة عن أرض إلى أرض ؟ وبالله ما خرجت التماس دنيا ؟ وبالله ما خرجت إلا حبا لله ولرسوله ؟ .\nثم رواه من وجه آخر ، عن الأغر بن الصباح به . وكذا رواه البزار من طريقه ، وذكر فيه أن الذي كان يحلفهن عن أمر رسول الله - صلى الله عليه وسلم - له عمر بن الخطاب .\nوقال العوفي ، عن ابن عباس في قوله : ( يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن ) كان امتحانهن أن يشهدن أن لا إله إلا الله ، وأن محمدا عبد الله ورسوله .\nوقال مجاهد : ( فامتحنوهن ) فاسألوهن : عما جاء بهن ؟ فإن كان بهن غضب على أزواجهن أو سخطة أو غيره ، ولم يؤمن فارجعوهن إلى أزواجهن .\nوقال عكرمة : يقال لها : ما جاء بك إلا حب الله ورسوله ؟ وما جاء بك عشق رجل منا ، ولا فرار من زوجك ؟ فذلك قوله : ( فامتحنوهن )\nوقال قتادة : كانت محنتهن أن يستحلفن بالله : ما أخرجكن النشوز ؟ وما أخرجكن إلا حب الإسلام وأهله وحرص عليه ؟ فإذا قلن ذلك قبل ذلك منهن .\nوقوله : ( فإن علمتموهن مؤمنات فلا ترجعوهن إلى الكفار ) فيه دلالة على أن الإيمان يمكن الاطلاع عليه يقينا .\nوقوله : ( لا هن حل لهم ولا هم يحلون لهن ) هذه الآية هي التي حرمت المسلمات على المشركين ، وقد كان جائزا في ابتداء الإسلام أن يتزوج المشرك المؤمنة ; ولهذا كان أبو العاص بن الربيع زوج ابنة النبي - صلى الله عليه وسلم - زينب رضي الله عنها ، وقد كانت مسلمة وهو على دين قومه ، فلما وقع في الأسارى يوم بدر بعثت امرأته زينب في فدائه بقلادة لها كانت لأمها خديجة ، فلما رآها رسول الله - صلى الله عليه وسلم - رق لها رقة شديدة ، وقال للمسلمين : \" إن رأيتم أن تطلقوا لها أسيرها فافعلوا \" . ففعلوا ، فأطلقه رسول الله - صلى الله عليه وسلم - على أن يبعث ابنته إليه ، فوفى له بذلك وصدقه فيما وعده ، وبعثها إلى رسول الله - صلى الله عليه وسلم - مع زيد بن حارثة ، رضي الله عنه ، فأقامت بالمدينة من بعد وقعة بدر وكانت سنة اثنتين إلى أن أسلم زوجها العاص بن الربيع سنة ثمان فردها عليه بالنكاح الأول ، ولم يحدث لها صداقا ، كما قال الإمام أحمد :\nحدثنا يعقوب ، حدثنا أبي ، حدثنا ابن إسحاق ، حدثنا داود بن الحصين ، عن عكرمة ، عن ابن عباس ، أن رسول الله - صلى الله عليه وسلم - رد ابنته زينب على أبي العاص بن الربيع وكانت هجرتها قبل إسلامه بست سنين على النكاح الأول ، ولم يحدث شهادة ولا صداقا .\nورواه أبو داود ، والترمذي ، وابن ماجه . ومنهم من يقول : \" بعد سنتين \" ، وهو صحيح ; لأن إسلامه كان بعد تحريم المسلمات على المشركين بسنتين . وقال الترمذي : \" ليس بإسناده بأس ، ولا نعرف وجه هذا الحديث ، ولعله جاء من حفظ داود بن الحصين . وسمعت عبد بن حميد يقول : سمعت يزيد بن هارون يذكر عن ابن إسحاق هذا الحديث ، وحديث ابن الحجاج - يعني ابن أرطاة - عن عمرو بن شعيب ، عن أبيه ، عن جده ، أن رسول الله - صلى الله عليه وسلم - رد ابنته على أبي العاص بن الربيع بمهر جديد ونكاح جديد . فقال يزيد : حديث ابن عباس أجود إسنادا والعمل على حديث عمرو بن شعيب \" .\nقلت : وقد روى حديث الحجاج بن أرطاة ، عن عمرو بن شعيب الإمام أحمد ، والترمذي ، وابن ماجه ، وضعفه الإمام أحمد ، وغير واحد ، والله أعلم .\nوأجاب الجمهور عن حديث ابن عباس بأن ذلك كان قضية عين يحتمل أنه لم تنقض عدتها منه ; لأن الذي عليه الأكثرون أنها متى انقضت العدة ولم يسلم انفسخ نكاحها منه .\nوقال آخرون : بل إذا انقضت العدة هي بالخيار ، إن شاءت أقامت على النكاح واستمرت ، وإن شاءت فسخته وذهبت فتزوجت ، وحملوا عليه حديث ابن عباس ، والله أعلم .\nوقوله : ( وآتوهم ما أنفقوا ) يعني : أزواج المهاجرات من المشركين ، ادفعوا إليهم الذي غرموه عليهن من الأصدقة . قاله ابن عباس ، ومجاهد ، وقتادة ، والزهري ، وغير واحد .\nوقوله : ( ولا جناح عليكم أن تنكحوهن إذا آتيتموهن أجورهن ) يعني : إذا أعطيتموهن أصدقتهن فانكحوهن ، أي : تزوجوهن بشرطه من انقضاء العدة ، والولي ، وغير ذلك .\nوقوله : ( ولا تمسكوا بعصم الكوافر ) تحريم من الله ، عز وجل ، على عباده المؤمنين نكاح المشركات ، والاستمرار معهن .\nوفي الصحيح ، عن الزهري ، عن عروة ، عن المسور ، ومروان بن الحكم : أن رسول الله - صلى الله عليه وسلم - لما عاهد كفار قريش يوم الحديبية جاء نساء من المؤمنات ، فأنزل الله عز وجل : ( يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن ) إلى قوله : ( ولا تمسكوا بعصم الكوافر ) فطلق عمر بن الخطاب يومئذ امرأتين ، تزوج إحداهما معاوية بن أبي سفيان ، والأخرى صفوان بن أمية .\nوقال ابن ثور ، عن معمر ، عن الزهري : أنزلت هذه الآية على رسول الله - صلى الله عليه وسلم - وهو بأسفل الحديبية حين صالحهم على أنه من أتاه منهم رده إليهم ، فلما جاءه النساء نزلت هذه الآية ، وأمره أن يرد الصداق إلى أزواجهن ، وحكم على المشركين مثل ذلك إذا جاءتهم امرأة من المسلمين أن يردوا الصداق إلى زوجها ، وقال : ( ولا تمسكوا بعصم الكوافر ) وهكذا قال عبد الرحمن بن زيد بن أسلم ، وقال : وإنما حكم الله بينهم بذلك ، لأجل ما كان بينهم وبينهم من العهد .\nوقال محمد بن إسحاق ، عن الزهري : طلق عمر يومئذ قريبة بنت أبي أمية بن المغيرة ، فتزوجها معاوية ، وأم كلثوم بنت عمرو بن جرول الخزاعية ، وهي أم عبيد الله ، فتزوجها أبو جهم بن حذيفة بن غانم ، رجل من قومه ، وهما على شركهما ، وطلق طلحة بن عبيد الله أروى بنت ربيعة بن الحارث بن عبد المطلب ، فتزوجها بعده خالد بن سعيد بن العاص .\nوقوله : ( واسألوا ما أنفقتم وليسألوا ما أنفقوا ) أي : وطالبوا بما أنفقتم على أزواجكم اللاتي يذهبن إلى الكفار ، إن ذهبن ، وليطالبوا بما أنفقوا على أزواجهم اللاتي هاجرن إلى المسلمين .\nوقوله : ( ذلكم حكم الله يحكم بينكم ) أي : في الصلح واستثناء النساء منه ، والأمر بهذا كله هو حكم الله يحكم به بين خلقه : ( والله عليم حكيم ) أي عليم بما يصلح عباده ، حكيم في ذلك .\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡ‍َٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡ‍َٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٠١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن الله أعلم بإيمانهن فإن علمتموهن مؤمنات فلا ترجعوهن إلى الكفار لا هن حل لهم ولا هم يحلون لهن وآتوهم ما أنفقوا ولا جناح عليكم أن تنكحوهن إذا آتيتموهن أجورهن ولا تمسكوا بعصم الكوافر واسألوا ما أنفقتم وليسألوا ما أنفقوا ذلكم حكم الله يحكم بينكم والله عليم حكيم\nقوله تعالى : يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فيه ست عشرة مسألة :\nالأولى : قوله تعالى : يا أيها الذين آمنوا إذا جاءكم المؤمنات لما أمر المسلمين بترك موالاة المشركين اقتضى ذلك مهاجرة المسلمين عن بلاد الشرك إلى بلاد الإسلام ، وكان التناكح من أوكد أسباب الموالاة ; فبين أحكام مهاجرة النساء . قال ابن عباس : جرى الصلح مع مشركي قريش عام الحديبية ، على أن من أتاه من أهل مكة رده إليهم ، فجاءت سعيدة بنت الحارث الأسلمية بعد الفراغ من الكتاب ، والنبي صلى الله عليه وسلم بالحديبية بعد ; فأقبل زوجها وكان كافرا - وهو صيفي بن الراهب . وقيل : مسافر المخزومي - فقال : يا محمد ، اردد علي امرأتي ، فإنك شرطت ذلك ! وهذه طينة الكتاب لم تجف بعد ، فأنزل الله تعالى هذه الآية . وقيل : جاءت أم كلثوم بنت عقبة بن أبي معيط ، فجاء أهلها يسألون رسول الله صلى الله عليه وسلم أن يردها . وقيل : هربت من زوجها عمرو بن العاص ومعها أخواها عمارة والوليد ، فرد رسول الله صلى الله عليه وسلم أخويها وحبسها ، فقالوا للنبي صلى الله عليه وسلم : ردها علينا للشرط ، فقال صلى الله عليه وسلم : \" كان الشرط في الرجال لا في النساء \" فأنزل الله تعالى هذه الآية . وعن عروة قال : كان مما اشترط سهيل بن عمرو على النبي صلى الله عليه وسلم يوم الحديبية : ألا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا ، حتى أنزل الله تعالى في المؤمنات ما أنزل ; يومئ إلى أن الشرط في رد النساء نسخ بذلك . وقيل : إن التي جاءت أميمة بنت بشر ، كانت عند ثابت بن الشمراخ ففرت منه وهو يومئذ كافر ، فتزوجها سهل بن حنيف فولدت له عبد الله ، قال زيد بن حبيب . كذا قال الماوردي : أميمة بنت بشر كانت عند ثابت بن الشمراخ . وقال المهدوي : وروى ابن وهب عن خالد أن هذه الآية نزلت في أميمة بنت بشر من بني عمرو بن عوف . وهي امرأة حسان بن الدحداح ، وتزوجها بعد هجرتها سهل بن حنيف . وقال مقاتل : إنها سعيدة زوجة صيفي بن الراهب مشرك من أهل مكة . والأكثر من أهل العلم أنها أم كلثوم بنت عقبة .\nالثانية : واختلف أهل العلم هل دخل النساء في عقد المهادنة لفظا أو عموما ; فقالت طائفة منهم : قد كان شرط ردهن في عقد المهادنة لفظا صريحا فنسخ الله ردهن من العقد ومنع منه ، وبقاه في الرجال على ما كان . وهذا يدل على أن للنبي صلى الله عليه وسلم أن يجتهد رأيه في الأحكام ، ولكن لا يقره الله على خطأ . وقالت طائفة من أهل العلم : لم يشترط ردهن في العقد لفظا ، وإنما أطلق العقد في رد من أسلم ; فكان ظاهر العموم اشتماله عليهن مع الرجال . فبين الله تعالى خروجهن عن عمومه . وفرق بينهن وبين الرجال لأمرين : أحدهما : أنهن ذوات فروج يحرمن عليهم . الثاني : أنهن أرق قلوبا وأسرع تقلبا منهم . فأما المقيمة منهن على شركها فمردودة عليهم .\nالثالثة : قوله تعالى : فامتحنوهن قيل : إنه كان من أرادت منهن إضرار زوجها فقالت : سأهاجر إلى محمد صلى الله عليه وسلم ; فلذلك أمر صلى الله عليه وسلم بامتحانهن . واختلف فيما كان يمتحنهن به على ثلاثة أقوال :\nالأول : قال ابن عباس : كانت المحنة أن تستحلف بالله أنها ما خرجت من بغض زوجها ، ولا رغبة من أرض إلى أرض ، ولا التماس دنيا ، ولا عشقا لرجل منا ; بل حبا لله ولرسوله . فإذا حلفت بالله الذي لا إله إلا هو على ذلك ، أعطى النبي صلى الله عليه وسلم زوجها مهرها وما أنفق عليها ولم يردها ; فذلك قوله تعالى : فإن علمتموهن مؤمنات فلا ترجعوهن إلى الكفار لا هن حل لهم ولا هم يحلون لهن .\nالثاني : أن المحنة كانت أن تشهد أن لا إله إلا الله وأن محمدا رسول الله ; قاله ابن عباس أيضا\nالثالث : بما بينه في السورة بعد من قوله تعالى : يا أيها النبي إذا جاءك المؤمنات قالت عائشة رضي الله عنها : ما كان رسول الله صلى الله عليه وسلم يمتحن إلا بالآية التي قال الله : إذا جاءك المؤمنات يبايعنك رواه معمر عن الزهري عن عائشة . خرجه الترمذي وقال : هذا حديث حسن صحيح .\nالرابعة : أكثر العلماء على أن هذا ناسخ لما كان عليه الصلاة والسلام عاهد عليه قريشا ، من أنه يرد إليهم من جاءه منهم مسلما ; فنسخ من ذلك النساء . وهذا مذهب من يرى نسخ السنة بالقرآن . وقال بعض العلماء : كله منسوخ في الرجال والنساء ، ولا يجوز أن يهادن الإمام العدو على أن يرد إليهم من جاءه مسلما ، لأن إقامة المسلم بأرض الشرك لا تجوز . وهذا مذهب الكوفيين . وعقد الصلح على ذلك جائز عند مالك . وقد احتج الكوفيون لما ذهبوا إليه من ذلك بحديث إسماعيل بن أبي خالد عن قيس بن أبي حازم عن خالد بن الوليد ، أن رسول الله صلى الله عليه وسلم بعثه إلى قوم من خثعم فاعتصموا بالسجود فقتلهم ، فوداهم رسول الله صلى الله عليه وسلم بنصف الدية ، وقال : \" أنا بريء من كل مسلم أقام مع مشرك في دار الحرب لا تراءى نارهما \" قالوا : فهذا ناسخ لرد المسلمين إلى المشركين ، إذ كان رسول الله صلى الله عليه وسلم قد برئ ممن أقام معهم في دار الحرب . ومذهب مالك والشافعي أن هذا الحكم غير منسوخ . قال الشافعي : وليس لأحد هذا العقد إلا الخليفة أو رجل يأمره ، لأنه يلي الأموال كلها . فمن عقد غير الخليفة هذا العقد فهو مردود .\nالخامسة : قوله تعالى : الله أعلم بإيمانهن أي هذا الامتحان لكم ، والله أعلم بإيمانهن ، لأنه متولي السرائر .\nفإن علمتموهن مؤمنات أي بما يظهر من الإيمان . وقيل : إن علمتموهن مؤمنات قبل الامتحان\nفلا ترجعوهن إلى الكفار لا هن حل لهم ولا هم يحلون لهن أي لم يحل الله مؤمنة لكافر ، ولا نكاح مؤمن لمشركة .\nوهذا أدل دليل على أن الذي أوجب فرقة المسلمة من زوجها إسلامها لا هجرتها . وقال أبو حنيفة : الذي فرق بينهما هو اختلاف الدارين . وإليه إشارة في مذهب مالك بل عبارة . والصحيح الأول ، لأن الله تعالى قال : لا هن حل لهم ولا هم يحلون لهن فبين أن العلة عدم الحل بالإسلام وليس باختلاف الدار . والله أعلم .\nوقال أبو عمر : لا فرق بين الدارين لا في الكتاب ولا في السنة ولا في القياس ، وإنما المراعاة في ذلك الدينان ، فباختلافهما يقع الحكم وباجتماعهما ، لا بالدار . والله المستعان .\nالسادسة : قوله تعالى : وآتوهم ما أنفقوا ، أمر الله تعالى إذا أمسكت المرأة المسلمة أن يرد على زوجها ما أنفق وذلك من الوفاء بالعهد ، لأنه لما منع من أهله بحرمة الإسلام ، أمر برد المال إليه حتى لا يقع عليهم خسران من الوجهين : الزوجة والمال .\nالسابعة : ولا غرم إلا إذا طالب الزوج الكافر ، فإذا حضر وطالب منعناها وغرمنا . فإن كانت ماتت قبل حضور الزوج لم نغرم المهر إذ لم يتحقق المنع . وإن كان المسمى خمرا أو خنزيرا لم نغرم شيئا ، لأنه لا قيمة له . وللشافعي في هذه الآية قولان : أحدهما : أن هذا منسوخ . قال الشافعي : وإذا جاءتنا المرأة الحرة من أهل الهدنة مسلمة مهاجرة من دار الحرب إلى الإمام في دار السلام أو في دار الحرب ، فمن طلبها من ولي سوى زوجها منع منها بلا عوض . وإذا طلبها زوجها لنفسه أو غيره بوكالته ففيه قولان : أحدهما : يعطي العوض ، والقول ما قال الله عز وجل . وفيه قول آخر : أنه لا يعطى الزوج المشرك الذي جاءت زوجته مسلمة العوض . فإن شرط الإمام رد النساء كان الشرط ورسول الله صلى الله عليه وسلم ألا يرد النساء كان شرط من شرط رد النساء منسوخا وليس عليه عوض ، لأن الشرط المنسوخ باطل ولا عوض للباطل .\nالثامنة : أمر الله تعالى برد مثل ما أنفقوا إلى الأزواج ، وأن المخاطب بهذا الإمام ، ينفذ مما بين يديه من بيت المال الذي لا يتعين له مصرف . وقال مقاتل : يرد المهر الذي يتزوجها من المسلمين ، فإن لم يتزوجها من المسلمين أحد فليس لزوجها الكافر شيء . وقال قتادة : الحكم في رد الصداق إنما هو في نساء أهل العهد ; فأما من لا عهد بينه وبين المسلمين فلا يرد إليهم الصداق . والأمر كما قاله .\nالتاسعة : قوله تعالى : ولا جناح عليكم أن تنكحوهن يعني إذا أسلمن وانقضت عدتهن لما ثبت من تحريم نكاح المشركة والمعتدة . فإن أسلمت قبل الدخول ثبت النكاح في الحال ولها التزوج .\nالعاشرة : قوله تعالى : إذا آتيتموهن أجورهن أباح نكاحها بشرط المهر ; لأن الإسلام فرق بينها وبين زوجها الكافر .\nالحادية عشرة : قوله تعالى : ولا تمسكوا بعصم الكوافر قراءة العامة بالتخفيف من الإمساك . وهو اختيار أبي عبيد لقوله تعالى : فأمسكوهن بمعروف . وقرأ الحسن وأبو العالية وأبو عمرو \" ولا تمسكوا \" مشددة من التمسك . يقال : مسك يمسك تمسكا ; بمعنى أمسك يمسك . وقرئ \" ولا تمسكوا \" بنصب التاء ; أي لا تتمسكوا . والعصم جمع العصمة ; وهو ما اعتصم به . والمراد بالعصمة هنا النكاح . يقول : من كانت له امرأة كافرة بمكة فلا يعتد بها ، فليست له امرأة ، فقد انقطعت عصمتها لاختلاف الدارين . وعن النخعي : هي المسلمة تلحق بدار الحرب فتكفر ; وكان الكفار يتزوجون المسلمات والمسلمون يتزوجون المشركات ; ثم نسخ ذلك في هذه الآية . فطلق عمر بن الخطاب حينئذ امرأتين له بمكة مشركتين : قريبة بنت أبي أمية فتزوجها معاوية بن أبي سفيان وهما على شركهما بمكة . وأم كلثوم بنت عمرو الخزاعية أم عبد الله بن المغيرة ; فتزوجها أبو جهم بن حذافة وهما على شركهما . فلما ولي عمر قال أبو سفيان لمعاوية : طلق قريبة لئلا يرى عمر سلبه في بيتك ، فأبى معاوية من ذلك . وكانت عند طلحة بن عبيد الله أروى بنت ربيعة بن الحارث بن عبد المطلب ففرق الإسلام بينهما ، ثم تزوجها في الإسلام خالد بن سعيد بن العاص ، وكانت ممن فر إلى النبي صلى الله عليه وسلم من نساء الكفار ، فحبسها وزوجها خالدا . وزوج النبي صلى الله عليه وسلم زينب ابنته - وكانت كافرة - من أبي العاص بن الربيع ، ثم أسلمت وأسلم زوجها بعدها . ذكر عبد الرزاق عن ابن جريج عن رجل عن ابن شهاب قال : أسلمت زينب بنت النبي صلى الله عليه وسلم وهاجرت بعد النبي صلى الله عليه وسلم في الهجرة الأولى ، وزوجها أبو العاص بن الربيع عبد العزى مشرك بمكة . الحديث . وفيه : أنه أسلم بعدها . وكذلك قال الشعبي . قال الشعبي : وكانت زينب بنت رسول الله صلى الله عليه وسلم امرأة أبي العاص بن الربيع ، فأسلمت ثم لحقت بالنبي صلى الله عليه وسلم ، ثم أتى زوجها المدينة فأمنته فأسلم فردها عليه النبي صلى الله عليه وسلم . وقال أبو داود عن عكرمة عن ابن عباس : بالنكاح الأول ; ولم يحدث شيئا . قال محمد بن عمر في حديثه : بعد ست سنين . وقال الحسن بن علي : بعد سنتين . قال أبو عمر : فإن صح هذا فلا يخلو من وجهين : إما أنها لم تحض حتى أسلم زوجها ، وإما أن الأمر فيها منسوخ بقول الله عز وجل : وبعولتهن أحق بردهن في ذلك يعني في عدتهن . وهذا ما لا خلاف فيه بين العلماء أنه عنى به العدة . وقال ابن شهاب الزهري رحمه الله في قصة زينب هذه : كان قبل أن تنزل الفرائض . وقال قتادة : كان هذا قبل أن تنزل سورة \" التوبة \" بقطع العهود بينهم وبين المشركين . والله أعلم .\nالثانية عشرة : قوله تعالى : بعصم الكوافر المراد بالكوافر هنا عبدة الأوثان من لا يجوز ابتداء نكاحها ، فهي خاصة بالكوافر من غير أهل الكتاب . وقيل : هي عامة ، نسخ منها نساء أهل الكتاب . ولو كان إلى ظاهر الآية لم تحل كافرة بوجه . وعلى القول الأول إذا أسلم وثني أو مجوسي ولم تسلم امرأته فرق بينهما . وهذا قول بعض أهل العلم . ومنهم من قال : ينتظر بها تمام العدة . فمن قال يفرق بينهما في الوقت ولا ينتظر تمام العدة إذا عرض عليها الإسلام ولم تسلم - مالك بن أنس . وهو قول الحسن وطاوس ومجاهد وعطاء وعكرمة وقتادة والحكم ، واحتجوا بقوله تعالى : ولا تمسكوا بعصم الكوافر . وقال الزهري : ينتظر بها العدة . وهو قول الشافعي وأحمد . واحتجوا بأن أبا سفيان بن حرب أسلم قبل هند بنت عتبة امرأته ، وكان إسلامه بمر الظهران ثم رجع إلى مكة وهند بها كافرة مقيمة على كفرها ، فأخذت بلحيته وقالت : اقتلوا الشيخ الضال . ثم أسلمت بعده بأيام ، فاستقرا على نكاحهما لأن عدتها لم تكن انقضت . قالوا : ومثله حكيم بن حزام أسلم قبل امرأته ، ثم أسلمت بعده فكانا على نكاحهما . قال الشافعي : ولا حجة لمن احتج بقوله تعالى : ولا تمسكوا بعصم الكوافر لأن نساء المسلمين محرمات على الكفار ; كما أن المسلمين لا تحل لهم الكوافر والوثنيات ولا المجوسيات بقول الله عز وجل : ولا هن حل لهم ولا هم يحلون لهن ثم بينت السنة أن مراد الله من قوله هذا أنه لا يحل بعضهم لبعض إلا أن يسلم الباقي منهما في العدة . وأما الكوفيون وهم سفيان وأبو حنيفة وأصحابه فإنهم قالوا في الكافرين الذميين : إذا أسلمت المرأة عرض على الزوج الإسلام ، فإن أسلم وإلا فرق بينهما . قالوا : ولو كانا حربيين فهي امرأته حتى تحيض ثلاث حيض إذا كانا جميعا في دار الحرب أو في دار الإسلام . وإن كان أحدهما في دار الإسلام والآخر في دار الحرب انقطعت العصمة بينهما فراعوا الدار ; وليس بشيء . وقد تقدم .\nالثالثة عشرة : هذا الاختلاف إنما هو في المدخول بها ، فإن كانت غير مدخول بها فلا نعلم اختلافا في انقطاع العصمة بينهما ; إذ لا عدة عليها . كذا يقول مالك في المرأة ترتد وزوجها مسلم : انقطعت العصمة بينهما . وحجته : ولا تمسكوا بعصم الكوافر وهو قول الحسن البصري والحسن بن صالح بن حي . ومذهب الشافعي وأحمد أنه ينتظر بها تمام العدة .\nالرابعة عشرة : فإن كان الزوجان نصرانيين فأسلمت الزوجة ففيها أيضا اختلاف . ومذهب مالك وأحمد والشافعي الوقوف إلى تمام العدة . وهو قول مجاهد . وكذا الوثني تسلم زوجته ، إنه إن أسلم في عدتها فهو أحق بها ; كما كان صفوان بن أمية وعكرمة بن أبي جهل أحق بزوجتيهما لما أسلما في عدتيهما ; على حديث ابن شهاب . ذكره مالك في الموطأ . قال ابن شهاب : كان بين إسلام صفوان وبين إسلام زوجته نحو من شهر . قال ابن شهاب : ولم يبلغنا أن امرأة هاجرت إلى رسول الله صلى الله عليه وسلم وزوجها كافر مقيم بدار الحرب إلا فرقت هجرتها بينه وبينها ; إلا أن يقدم زوجها مهاجرا قبل أن تنقضي عدتها . ومن العلماء من قال : ينفسخ النكاح بينهما . قال يزيد بن علقمة : أسلم جدي ولم تسلم جدتي ففرق عمر بينهما رضي الله عنه ; وهو قول طاوس . وجماعة غيره منهم عطاء والحسن وعكرمة قالوا : لا سبيل عليها إلا بخطبة .\nالخامسة عشرة : قوله تعالى : واسألوا ما أنفقتم وليسألوا ما أنفقوا قال المفسرون : كان من ذهب من المسلمات مرتدات إلى الكفار من أهل العهد يقال للكفار : هاتوا مهرها . ويقال للمسلمين إذا جاء أحد من الكافرات مسلمة مهاجرة : ردوا إلى الكفار مهرها . وكان ذلك نصفا وعدلا بين الحالتين . وكان هذا حكم الله مخصوصا بذلك الزمان في تلك النازلة خاصة بإجماع الأمة ; قاله ابن العربي .\nالسادسة عشرة : قوله تعالى : ذلكم حكم الله ؛ أي ما ذكر في هذه الآية .\nيحكم بينكم والله عليم حكيم تقدم في غير موضع .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡ‍َٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡ‍َٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٠١\n                                        \n                                        \n                                        \n                                        لما كان صلح الحديبية، صالح النبي صلى الله عليه وسلم المشركين، على أن من جاء منهم إلى المسلمين مسلما، أنه يرد إلى المشركين، وكان هذا لفظا عاما، [مطلقا] يدخل في عمومه النساء والرجال، فأما الرجال فإن الله لم ينه رسوله عن ردهم، إلى المشركين وفاء بالشرط وتتميما للصلح الذي هو من أكبر المصالح، وأما النساء فلما كان ردهن فيه مفاسد كثيرة، أمر الله المؤمنين إذا جاءهم المؤمنات مهاجرات، وشكوا في صدق إيمانهن، أن يمتحنوهن ويختبروهن، بما يظهر به صدقهن، من أيمان مغلظة وغيرها، فإنه يحتمل أن يكون إيمانها غير صادق بل رغبة في زوج أو بلد أو غير ذلك من المقاصد الدنيوية.\nفإن كن بهذا الوصف، تعين ردهن وفاء بالشرط، من غير حصول مفسدة، وإن امتحنوهن، فوجدن صادقات، أو علموا ذلك منهن من غير امتحان، فلا يرجعوهن إلى الكفار، { لَا هُنَّ حِلٌّ لَهُمْ وَلَا هُمْ يَحِلُّونَ لَهُنَّ } فهذه مفسدة كبيرة في ردهن راعاها الشارع، وراعى أيضا الوفاء بالشرط، بأن يعطوا الكفار أزواجهن ما أنفقوا عليهن من المهر وتوابعه عوضا عنهن، ولا جناح حينئذ على المسلمين أن ينكحوهن ولو كان لهن أزواج في دار الشرك، ولكن بشرط أن يؤتوهن أجورهن من المهر والنفقة، وكما أن المسلمة لا تحل للكافر، فكذلك الكافرة لا تحل للمسلم أن يمسكها ما دامت على كفرها، غير أهل الكتاب، ولهذا قال تعالى: { وَلَا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ } وإذا نهى عن الإمساك بعصمتها فالنهي عن ابتداء تزويجها أولى، { وَاسْأَلُوا مَا أَنْفَقْتُمْ } أيها المؤمنون، حين ترجع زوجاتكم مرتدات إلى الكفار، فإذا كان الكفار يأخذون من المسلمين نفقة من أسلمت من نسائهم، استحق المسلمون أن يأخذوا مقابلة ما ذهب من نسائهم إلى الكفار، وفي هذا دليل على أن خروج البضع من الزوج متقوم، فإذا أفسد مفسد نكاح امرأة رجل، برضاع أو غيره، كان عليه ضمان المهر، وقوله: { ذَلِكُمْ حُكْمُ اللَّهِ } أي: ذلكم الحكم الذي ذكره الله وبينه لكم يحكم به بينكم { وَاللَّهُ عَلِيمٌ حَكِيمٌ } فيعلم تعالى، ما يصلح لكم من الأحكام، ويشرع لكم ما تقتضيه الحكمة\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "وَإِن فَاتَكُمۡ شَيۡءٞ مِّنۡ أَزۡوَٰجِكُمۡ إِلَى ٱلۡكُفَّارِ فَعَاقَبۡتُمۡ فَ‍َٔاتُواْ ٱلَّذِينَ ذَهَبَتۡ أَزۡوَٰجُهُم مِّثۡلَ مَآ أَنفَقُواْۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ ١١",
    "tafsier": {
      "ibnkther": "وَإِن فَاتَكُمۡ شَيۡءٞ مِّنۡ أَزۡوَٰجِكُمۡ إِلَى ٱلۡكُفَّارِ فَعَاقَبۡتُمۡ فَ‍َٔاتُواْ ٱلَّذِينَ ذَهَبَتۡ أَزۡوَٰجُهُم مِّثۡلَ مَآ أَنفَقُواْۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ ١١\n                                    \n                                    \n                                    ثم قال : ( وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا ) قال مجاهد ، وقتادة : هذا في الكفار الذين ليس لهم عهد ، إذا فرت إليهم امرأة ولم يدفعوا إلى زوجها شيئا ، فإذا جاءت منهم امرأة لا يدفع إلى زوجها شيء ، حتى يدفع إلى زوج الذاهبة إليهم مثل نفقته عليها .\nوقال ابن جرير : حدثنا يونس حدثنا ابن وهب ، أخبرني يونس ، عن الزهري قال : أقر المؤمنون بحكم الله ، فأدوا ما أمروا به من نفقات المشركين التي أنفقوا على نسائهم ، وأبى المشركون أن يقروا بحكم الله فيما فرض عليهم من أداء نفقات المسلمين ، فقال الله للمؤمنين به : ( وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا واتقوا الله الذي أنتم به مؤمنون ) فلو أنها ذهبت بعد هذه الآية امرأة من أزواج المؤمنين إلى المشركين ، رد المؤمنون إلى زوجها النفقة التي أنفق عليها من العقب الذي بأيديهم الذي أمروا أن يردوه على المشركين من نفقاتهم التي أنفقوا على أزواجهم اللاتي آمن وهاجرن ، ثم ردوا إلى المشركين فضلا إن كان بقي لهم . والعقب : ما كان بأيدي المؤمنين من صداق نساء الكفار حين آمن وهاجرن .\nوقال العوفي ، عن ابن عباس في هذه الآية : يعني إن لحقت امرأة رجل من المهاجرين بالكفار ، أمر له رسول الله - صلى الله عليه وسلم - أنه يعطى من الغنيمة مثل ما أنفق .\nوهكذا قال مجاهد : ( فعاقبتم ) أصبتم غنيمة من قريش أو غيرهم ( فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا ) يعني : مهر مثلها . وهكذا قال مسروق ، وإبراهيم ، وقتادة ، ومقاتل ، والضحاك ، وسفيان بن حسين ، والزهري أيضا .\nوهذا لا ينافي الأول ; لأنه إن أمكن الأول فهو أولى ، وإلا فمن الغنائم اللاتي تؤخذ من أيدي الكفار . وهذا أوسع ، وهو اختيار ابن جرير ، ولله الحمد والمنة .\n                                    ",
      "qortoby": "وَإِن فَاتَكُمۡ شَيۡءٞ مِّنۡ أَزۡوَٰجِكُمۡ إِلَى ٱلۡكُفَّارِ فَعَاقَبۡتُمۡ فَ‍َٔاتُواْ ٱلَّذِينَ ذَهَبَتۡ أَزۡوَٰجُهُم مِّثۡلَ مَآ أَنفَقُواْۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا واتقوا الله الذي أنتم به مؤمنون\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : وإن فاتكم شيء من أزواجكم إلى الكفار في الخبر : أن المسلمين قالوا : رضينا بما حكم الله ; وكتبوا إلى المشركين فامتنعوا فنزلت : وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا . وروى الزهري عن عروة عن عائشة رضي الله عنها قالت : حكم الله عز وجل بينكم فقال جل ثناؤه : واسألوا ما أنفقتم وليسألوا ما أنفقوا فكتب إليهم المسلمون : قد حكم الله عز وجل بيننا بأنه إن جاءتكم امرأة منا أن توجهوا إلينا بصداقها ، وإن جاءتنا امرأة منكم وجهنا إليكم بصداقها . فكتبوا إليهم : أما نحن فلا نعلم لكم عندنا شيئا ، فإن كان لنا عندكم شيء فوجهوا به ، فأنزل الله عز وجل : وإن فاتكم شيء من أزواجكم إلى الكفار فعاقبتم فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا . وقال ابن عباس في قوله تعالى : ذلكم حكم الله يحكم بينكم أي بين المسلمين والكفار من أهل العهد من أهل مكة يرد بعضهم إلى بعض . قال الزهري : ولولا العهد لأمسك النساء ولم يرد إليهم صداقا . وقال قتادة ومجاهد : إنما أمروا أن يعطوا الذين ذهبت أزواجهم مثل ما أنفقوا من الفيء والغنيمة . وقالا : هي فيمن بيننا وبينه عهد وليس بيننا وبينه عهد . وقالا : ومعنى فعاقبتم فاقتصصتم . فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا يعني الصدقات . فهي عامة في جميع الكفار . وقال قتادة أيضا : وإن فاتكم شيء من أزواجكم إلى الكفار الذين بينكم وبينهم عهد ، فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا . ثم نسخ هذا في سورة \" التوبة \" . وقال الزهري : انقطع هذا عام الفتح . وقال سفيان الثوري : لا يعمل به اليوم . وقال قوم : هو ثابت الحكم الآن أيضا . حكاه القشيري .\nالثانية : قوله تعالى : فعاقبتم قراءة العامة فعاقبتم ، وقرأ علقمة والنخعي وحميد والأعرج \" فعقبتم \" مشددة . وقرأ مجاهد \" فأعقبتم \" وقال : صنعتم كما صنعوا بكم . وقرأ الزهري \" فعقبتم \" خفيفة بغير ألف . وقرأ مسروق وشقيق بن سلمة \" فعقبتم \" بكسر القاف خفيفة . وقال : غنمتم . وكلها لغات بمعنى واحد . يقال : عاقب وعقب وعقب وأعقب وتعقب واعتقب وتعاقب إذا غنم . وقال القتبي : فعاقبتم فغزوتم معاقبين غزوا بعد غزو . وقال ابن بحر : أي فعاقبتم المرتدة بالقتل فلزوجها مهرها من غنائم المسلمين .\nالثالثة : قوله تعالى : فآتوا الذين ذهبت أزواجهم مثل ما أنفقوا قال ابن عباس : يقول : إن لحقت امرأة مؤمنة بكفار أهل مكة ، وليس بينكم وبينهم عهد ، ولها زوج مسلم قبلكم فغنمتم ، فأعطوا هذا الزوج المسلم مهره من الغنيمة قبل أن تخمس . وقال الزهري : يعطى من مال الفيء . وعنه يعطى من صداق من لحق بنا . وقيل : أي إن امتنعوا من أن يغرموا مهر هذه المرأة التي ذهبت إليهم ، فانبذوا العهد إليهم حتى إذا ظفرتم فخذوا ذلك منهم . قال الأعمش : هي منسوخة . وقال عطاء : بل حكمها ثابت . وقد تقدم جميع هذا . القشيري : والآية نزلت في أم الحكم بنت أبي سفيان ، ارتدت وتركت زوجها عياض بن غنم القرشي ، ولم ترتد امرأة من قريش غيرها ، ثم عادت إلى الإسلام . وحكى الثعلبي عن ابن عباس : هن ست نسوة رجعن عن الإسلام ولحقن بالمشركين من نساء المؤمنين المهاجرين : أم الحكم بنت أبي سفيان كانت تحت عياض بن أبي شداد الفهري . وفاطمة بنت أبي أمية بن المغيرة أخت أم سلمة ، وكانت تحت عمر بن الخطاب ، فلما هاجر عمر أبت وارتدت . وبروع بنت عقبة ، كانت تحت شماس بن عثمان . وعبدة بنت عبد العزى ، كانت تحت هشام بن العاص . وأم كلثوم بنت جرول تحت عمر بن الخطاب . وشهبة بنت غيلان . فأعطاهم النبي صلى الله عليه وسلم مهور نسائهم من الغنيمة .\nواتقوا الله : احذروا أن تتعدوا ما أمرتم به .\n\n                                    ",
      "saadi": "وَإِن فَاتَكُمۡ شَيۡءٞ مِّنۡ أَزۡوَٰجِكُمۡ إِلَى ٱلۡكُفَّارِ فَعَاقَبۡتُمۡ فَ‍َٔاتُواْ ٱلَّذِينَ ذَهَبَتۡ أَزۡوَٰجُهُم مِّثۡلَ مَآ أَنفَقُواْۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ أَنتُم بِهِۦ مُؤۡمِنُونَ ١١\n                                        \n                                        \n                                        \n                                        { وَإِنْ فَاتَكُمْ شَيْءٌ مِنْ أَزْوَاجِكُمْ إِلَى الْكُفَّارِ } بأن ذهبن مرتدات { فَعَاقَبْتُمْ فَآتُوا الَّذِينَ ذَهَبَتْ أَزْوَاجُهُمْ مِثْلَ مَا أَنْفَقُوا } كما تقدم أن الكفار إذا كانوا يأخذون بدل ما يفوت من أزواجهم إلى المسلمين، فمن ذهبت زوجته من المسلمين إلى الكفار وفاتت عليه، لزم أن يعطيه فعلى المسلمون من الغنيمة بدل ما أنفق\n{ وَاتَّقُوا اللَّهَ الَّذِي أَنْتُمْ بِهِ مُؤْمِنُونَ } فإيمانكم بالله، يقتضي منكم أن تكونوا ملازمين للتقوى على الدوام.\n                                    "
    }
  },
  {
    "id": 11,
    "versesNumber": 12,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا جَآءَكَ ٱلۡمُؤۡمِنَٰتُ يُبَايِعۡنَكَ عَلَىٰٓ أَن لَّا يُشۡرِكۡنَ بِٱللَّهِ شَيۡ‍ٔٗا وَلَا يَسۡرِقۡنَ وَلَا يَزۡنِينَ وَلَا يَقۡتُلۡنَ أَوۡلَٰدَهُنَّ وَلَا يَأۡتِينَ بِبُهۡتَٰنٖ يَفۡتَرِينَهُۥ بَيۡنَ أَيۡدِيهِنَّ وَأَرۡجُلِهِنَّ وَلَا يَعۡصِينَكَ فِي مَعۡرُوفٖ فَبَايِعۡهُنَّ وَٱسۡتَغۡفِرۡ لَهُنَّ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٢١",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا جَآءَكَ ٱلۡمُؤۡمِنَٰتُ يُبَايِعۡنَكَ عَلَىٰٓ أَن لَّا يُشۡرِكۡنَ بِٱللَّهِ شَيۡ‍ٔٗا وَلَا يَسۡرِقۡنَ وَلَا يَزۡنِينَ وَلَا يَقۡتُلۡنَ أَوۡلَٰدَهُنَّ وَلَا يَأۡتِينَ بِبُهۡتَٰنٖ يَفۡتَرِينَهُۥ بَيۡنَ أَيۡدِيهِنَّ وَأَرۡجُلِهِنَّ وَلَا يَعۡصِينَكَ فِي مَعۡرُوفٖ فَبَايِعۡهُنَّ وَٱسۡتَغۡفِرۡ لَهُنَّ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٢١\n                                    \n                                    \n                                    قال البخاري : حدثنا يعقوب بن إبراهيم ، حدثنا ابن أخي ابن شهاب ، عن عمه قال : أخبرني عروة أن عائشة زوج النبي - صلى الله عليه وسلم - أخبرته : أن رسول الله - صلى الله عليه وسلم - كان يمتحن من هاجر إليه من المؤمنات بهذه الآية : ( يا أيها النبي إذا جاءك المؤمنات يبايعنك ) إلى قوله : ( غفور رحيم ) قال عروة : قالت عائشة : فمن أقر بهذا الشرط من المؤمنات ، قال لها رسول الله - صلى الله عليه وسلم - : \" قد بايعتك \" ، كلاما ، ولا والله ما مست يده يد امرأة قط في المبايعة ، ما يبايعهن إلا بقوله : \" قد بايعتك على ذلك \" هذا لفظ البخاري .\nوقال الإمام أحمد : حدثنا عبد الرحمن بن مهدي ، حدثنا سفيان ، عن محمد بن المنكدر ، عن أميمة بنت رقيقة قالت : أتيت رسول الله - صلى الله عليه وسلم - في نساء لنبايعه ، فأخذ علينا ما في القرآن : ( أن لا يشركن بالله شيئا ) الآية ، وقال : \" فيما استطعتن وأطقتن \" ، قلنا : الله ورسوله أرحم بنا من أنفسنا ، قلنا : يا رسول الله ، ألا تصافحنا ؟ قال \" إني لا أصافح النساء ، إنما قولي لامرأة واحدة كقولي لمائة امرأة \" .\nهذا إسناد صحيح ، وقد رواه الترمذي ، والنسائي ، وابن ماجه ، من حديث سفيان بن عيينة ، - والنسائي أيضا من حديث الثوري ، - ومالك بن أنس كلهم ، عن محمد بن المنكدر به . . وقال الترمذي : حسن صحيح ، لا نعرفه إلا من حديث محمد بن المنكدر .\nوقد رواه أحمد أيضا من حديث محمد بن إسحاق ، عن محمد بن المنكدر ، عن أميمة به . وزاد : \" ولم يصافح منا امرأة \" . وكذا رواه ابن جرير من طريق موسى بن عقبة ، عن محمد بن المنكدر به . . ورواه ابن أبي حاتم من حديث أبي جعفر الرازي ، عن محمد بن المنكدر : حدثتني أميمة بنت رقيقة - وكانت أخت خديجة خالة فاطمة ، من فيها إلى في ، فذكره .\nوقال الإمام أحمد : حدثنا يعقوب حدثنا أبي ، عن ابن إسحاق ، حدثني سليط بن أيوب بن الحكم بن سليم ، عن أمه سلمى بنت قيس - وكانت إحدى خالات رسول الله - صلى الله عليه وسلم - قد صلت معه القبلتين ، وكانت إحدى نساء بني عدي بن النجار - قالت : جئت رسول الله - صلى الله عليه وسلم - نبايعه في نسوة من الأنصار ، فلما شرط علينا : ألا نشرك بالله شيئا ، ولا نسرق ، ولا نزني ، ولا نقتل أولادنا ، ولا نأتي ببهتان نفتريه بين أيدينا وأرجلنا ، ولا نعصيه في معروف - قال : \" ولا تغششن أزواجكن \" . قالت : فبايعناه ، ثم انصرفنا ، فقلت لامرأة منهن : ارجعي فسلي رسول الله - صلى الله عليه وسلم - : ما غش أزواجنا ؟ قال : فسألته فقال : \" تأخذ ماله ، فتحابي به غيره \" .\nوقال الإمام أحمد : حدثنا إبراهيم بن أبي العباس ، حدثنا عبد الرحمن بن عثمان بن إبراهيم بن محمد بن حاطب ، حدثني أبي ، عن أمه عائشة بنت قدامة - يعني : ابن مظعون - قالت : أنا مع أمي رائطة بنت سفيان الخزاعية ، والنبي - صلى الله عليه وسلم - يبايع النسوة ويقول : \" أبايعكن على أن لا تشركن بالله شيئا ، ولا تسرقن ، ولا تزنين ، ولا تقتلن أولادكن ، ولا تأتين ببهتان تفترينه بين أيديكن وأرجلكن ، ولا تعصينني في معروف \" . قالت : فأطرقن . فقال لهن النبي - صلى الله عليه وسلم - قلن : نعم فيما استطعتن \" . فكن يقلن وأقول معهن ، وأمي تلقني : قولي أي بنية ، نعم فيما استطعت . فكنت أقول كما يقلن\nوقال البخاري : حدثنا أبو معمر ، حدثنا عبد الوارث ، حدثنا أيوب ، عن حفصة بنت سيرين ، عن أم عطية قالت : بايعنا رسول الله - صلى الله عليه وسلم - فقرأ علينا : ( أن لا يشركن بالله شيئا ) ونهانا عن النياحة ، فقبضت امرأة يدها ، قالت : أسعدتني فلانة أريد أن أجزيها . فما قال لها رسول الله - صلى الله عليه وسلم - شيئا ، فانطلقت ورجعت فبايعها .\nورواه مسلم . وفي رواية : \" فما وفى منهن امرأة غيرها ، وغير أم سليم ابنة ملحان \" .\nوللبخاري عن أم عطية قالت : أخذ علينا رسول الله - صلى الله عليه وسلم - عند البيعة ألا ننوح ، فما وفت منا امرأة غير خمس نسوة : أم سليم ، وأم العلاء ، وابنة أبي سبرة امرأة معاذ ، وامرأتان - أو : ابنة أبي سبرة ، وامرأة معاذ ، وامرأة أخرى .\nوقد كان رسول الله - صلى الله عليه وسلم - يتعاهد النساء بهذه البيعة يوم العيد ، كما قال البخاري :\nحدثنا محمد بن عبد الرحيم ، حدثنا هارون بن معروف ، حدثنا عبد الله بن وهب ، أخبرني ابن جريج : أن الحسن بن مسلم أخبره ، عن طاوس ، عن ابن عباس قال : شهدت الصلاة يوم الفطر مع رسول الله - صلى الله عليه وسلم - ، وأبي بكر ، وعمر ، وعثمان فكلهم يصليها قبل الخطبة ثم يخطب بعد ، فنزل نبي الله - صلى الله عليه وسلم - فكأني أنظر إليه حين يجلس الرجال بيده ، ثم أقبل يشقهم حتى أتى النساء مع بلال فقال : ( ياأيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ) حتى فرغ من الآية كلها . ثم قال حين فرغ : \" أنتن على ذلك ؟ \" . فقالت امرأة واحدة ، ولم يجبه غيرها : نعم يا رسول الله - لا يدري الحسن من هي - قال : \" فتصدقن \" ، قال : وبسط بلال ثوبه فجعلن يلقين الفتخ والخواتيم في ثوب بلال .\nوقال الإمام أحمد : حدثنا خلف بن الوليد ، حدثنا ابن عياش ، عن سليمان بن سليم ، عن عمرو بن شعيب ، عن أبيه ، عن جده قال : جاءت أميمة بنت رقيقة إلى رسول الله - صلى الله عليه وسلم - تبايعه على الإسلام ، فقال : \" أبايعك على ألا تشركي بالله شيئا ، ولا تسرقي ، ولا تزني ، ولا تقتلي ولدك ، ولا تأتي ببهتان تفترينه بين يديك ورجليك ، ولا تنوحي ، ولا تبرجي تبرج الجاهلية الأولى \"\nوقال الإمام أحمد : حدثنا سفيان ، عن الزهري ، عن أبي إدريس الخولاني ، عن عبادة بن الصامت قال : كنا عند رسول الله - صلى الله عليه وسلم - في مجلس فقال : \" تبايعوني على ألا تشركوا بالله شيئا ، ولا تسرقوا ، ولا تزنوا ، ولا تقتلوا أولادكم - قرأ الآية التي أخذت على النساء ( إذا جاءك المؤمنات ) فمن وفى منكم فأجره على الله ، ومن أصاب من ذلك شيئا فعوقب به ، فهو كفارة له ، ومن أصاب من ذلك شيئا فستره الله عليه ، فهو إلى الله ، إن شاء غفر له ، وإن شاء عذبه \" . أخرجاه في الصحيحين .\nوقال محمد بن إسحاق ، عن يزيد بن أبي حبيب ، عن مرثد بن عبد الله اليزني عن أبي عبد الله عبد الرحمن بن عسيلة الصنابحي ، عن عبادة بن الصامت قال : كنت فيمن حضر العقبة الأولى ، وكنا اثني عشر رجلا فبايعنا رسول الله - صلى الله عليه وسلم - على بيعة النساء ، وذلك قبل أن يفرض الحرب ، على ألا نشرك بالله شيئا ، ولا نسرق ، ولا نزني ، ولا نقتل أولادنا ، ولا نأتي ببهتان نفتريه بين أيدينا وأرجلنا ، ولا نعصيه في معروف ، وقال : \" فإن وفيتم فلكم الجنة \" رواه ابن أبي حاتم .\nوقد روى ابن جرير من طريق العوفي ، عن ابن عباس : أن رسول الله - صلى الله عليه وسلم - أمر عمر بن الخطاب فقال : \" قل لهن : إن رسول الله يبايعكن على ألا تشركن بالله شيئا \" - وكانت هند بنت عتبة بن ربيعة التي شقت بطن حمزة منكرة في النساء - فقالت : \" إني إن أتكلم يعرفني ، وإن عرفني قتلني \" . وإنما تنكرت فرقا من رسول الله - صلى الله عليه وسلم - فسكت النسوة اللاتي مع هند ، وأبين أن يتكلمن . فقالت هند وهي منكرة : كيف تقبل من النساء شيئا لم تقبله من الرجال ؟ ففطن إليها رسول الله وقال لعمر : \" قل لهن : ولا تسرقن \" . قالت هند : والله إني لأصيب من أبي سفيان الهنات ، ما أدري أيحلهن لي أم لا ؟ قال أبو سفيان : ما أصبت من شيء مضى أو قد بقي ، فهو لك حلال . فضحك رسول الله - صلى الله عليه وسلم - وعرفها ، فدعاها فأخذت بيده ، فعاذت به ، فقال : \" أنت هند ؟ \" . قالت : عفا الله عما سلف . فصرف عنها رسول الله - صلى الله عليه وسلم - فقال : \" ولا يزنين \" ، فقالت : يا رسول الله ، وهل تزني الحرة ؟ قال : \" لا والله ما تزني الحرة \" . فقال : \" ولا يقتلن أولادهن \" . قالت هند : أنت قتلتهم يوم بدر ، فأنت وهم أبصر . قال : ( ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ) قال ( ولا يعصينك في معروف ) قال : منعهن أن ينحن ، وكان أهل الجاهلية يمزقن الثياب ويخدشن الوجوه ، ويقطعن الشعور ، ويدعون بالثبور . والثبور : الويل .\nوهذا أثر غريب ، وفي بعضه نكارة ، والله أعلم ; فإن أبا سفيان وامرأته لما أسلما لم يكن رسول الله - صلى الله عليه وسلم - يخيفهما ، بل أظهر الصفاء والود له ، وكذلك كان الأمر من جانبه ، عليه السلام ، لهما .\nوقال مقاتل بن حيان : أنزلت هذه الآية يوم الفتح ، فبايع رسول الله - صلى الله عليه وسلم - الرجال على الصفا ، وعمر يبايع النساء تحتها عن رسول الله - صلى الله عليه وسلم - فذكر بقيته كما تقدم وزاد : فلما قال : ( ولا يقتلن أولادهن ) قالت هند : ربيناهم صغارا فقتلتموهم كبارا . فضحك عمر بن الخطاب حتى استلقى . رواه ابن أبي حاتم .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا نصر بن علي ، حدثتني غبطة بنت سليمان ، حدثتني عمتي ، عن جدتها ، عن عائشة قالت : جاءت هند بنت عتبة إلى رسول الله - صلى الله عليه وسلم - لتبايعه ، فنظر إلى يدها فقال : \" اذهبي فغيري يدك \" . فذهبت فغيرتها بحناء ، ثم جاءت فقال : \" أبايعك على ألا تشركي بالله شيئا \" ، فبايعها وفي يدها سواران من ذهب ، فقالت : ما تقول في هذين السوارين ؟ فقال : \" جمرتان من جمر جهنم \" .\nفقوله : ( يا أيها النبي إذا جاءك المؤمنات يبايعنك ) أي : من جاءك منهن يبايع على هذه الشروط فبايعها ، ( على أن لا يشركن بالله شيئا ولا يسرقن ) أي : أموال الناس الأجانب ، فأما إذا كان الزوج مقصرا في نفقتها ، فلها أن تأكل من ماله بالمعروف ، ما جرت به عادة أمثالها ، وإن كان بغير علمه ، عملا بحديث هند بنت عتبة أنها قالت : يا رسول الله ، إن أبا سفيان رجل شحيح لا يعطيني من النفقة ما يكفيني ويكفي بني ، فهل علي جناح إن أخذت من ماله بغير علمه ؟ فقال رسول الله - صلى الله عليه وسلم - : \" خذي من ماله بالمعروف ما يكفيك ويكفي بنيك \" . أخرجاه في الصحيحين .\nوقوله : ( ولا يزنين ) كقوله ( ولاتقربوا الزنا إنه كان فاحشة وساء سبيلا ) [ الإسراء : 32 ] . وفي حديث سمرة ذكر عقوبة الزناة بالعذاب الأليم في نار الجحيم .\nوقال الإمام أحمد : حدثنا عبد الرزاق ، أخبرنا معمر ، عن الزهري ، عن عروة ، عن عائشة قالت : جاءت فاطمة بنت عتبة تبايع رسول الله - صلى الله عليه وسلم - فأخذ عليها : ( أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ) الآية ، قالت : فوضعت يدها على رأسها حياء ، فأعجبه ما رأى منها ، فقالت عائشة : أقري أيتها المرأة ، فوالله ما بايعنا إلا على هذا . قالت : فنعم إذا . فبايعها بالآية .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا ابن فضيل ، عن حصين ، عن عامر - هو الشعبي - قال : بايع رسول الله - صلى الله عليه وسلم - النساء ، وعلى يده ثوب قد وضعه على كفه ، ثم قال : \" ولا تقتلن أولادكن \" . فقالت امرأة : تقتل آباءهم وتوصينا بأولادهم ؟ قال : وكان بعد ذلك إذا جاءت النساء يبايعنه ، جمعهن فعرض عليهن ، فإذا أقررن رجعن .\nوقوله ( ولا يقتلن أولادهن ) وهذا يشمل قتله بعد وجوده ، كما كان أهل الجاهلية يقتلون أولادهم خشية الإملاق ، ويعم قتله وهو جنين ، كما قد يفعله بعض الجهلة من النساء ، تطرح نفسها لئلا تحبل إما لغرض فاسد ، أو ما أشبهه .\nوقوله : ( ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ) قال ابن عباس : يعني لا يلحقن بأزواجهن غير أولادهم . وكذا قال مقاتل . ويؤيد هذا الحديث الذي رواه أبو داود :\nحدثنا أحمد بن صالح ، حدثنا ابن وهب ، حدثنا عمرو - يعني : ابن الحارث ، - عن ابن الهاد ، عن عبد الله بن يونس ، عن سعيد المقبري ، عن أبي هريرة أنه سمع رسول الله - صلى الله عليه وسلم - يقول حين نزلت آية الملاعنة : \" أيما امرأة أدخلت على قوم من ليس منهم ، فليست من الله في شيء ، ولن يدخلها الله جنته ، وأيما رجل جحد ولده وهو ينظر إليه ، احتجب الله منه ، وفضحه على رءوس الأولين والآخرين \" .\nوقوله : ( ولا يعصينك في معروف ) يعني : فيما أمرتهن به من معروف ، ونهيتهن عنه من منكر .\nقال البخاري : حدثنا عبد الله بن محمد ، حدثنا وهب بن جرير ، حدثنا أبي قال : سمعت الزبير ، عن عكرمة ، عن ابن عباس في قوله : ( ولا يعصينك في معروف ) قال : إنما هو شرط شرطه الله للنساء .\nوقال ميمون بن مهران : لم يجعل الله لنبيه طاعة إلا لمعروف ، والمعروف : طاعة .\nوقال ابن زيد : أمر الله بطاعة رسوله ، وهو خيرة الله من خلقه في المعروف . وقد قال غيره عن ابن عباس ، وأنس بن مالك ، وسالم بن أبي الجعد ، وأبي صالح ، وغير واحد : نهاهن يومئذ عن النوح . وقد تقدم حديث أم عطية في ذلك أيضا .\nوقال ابن جرير : حدثنا بشر ، حدثنا يزيد ، حدثنا سعيد ، عن قتادة في هذه الآية : ذكر لنا أن نبي الله - صلى الله عليه وسلم - أخذ عليهن النياحة ، ولا تحدثن الرجال إلا رجلا منكن محرما . فقال عبد الرحمن بن عوف : يا نبي الله ، إن لنا أضيافا ، وإنا نغيب عن نسائنا . فقال رسول الله - صلى الله عليه وسلم - : \" ليس أولئك عنيت ، ليس أولئك عنيت \" .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا إبراهيم بن موسى الفراء ، أخبرنا ابن أبي زائدة ، حدثني مبارك ، عن الحسن قال : كان فيما أخذ النبي - صلى الله عليه وسلم - : \" ألا تحدثن الرجال إلا أن تكون ذات محرم ، فإن الرجل لا يزال يحدث المرأة حتى يمذي بين فخذيه \" .\nوقال ابن جرير : حدثنا ابن حميد ، حدثنا هارون ، عن عمرو ، عن عاصم ، عن ابن سيرين ، عن أم عطية الأنصارية قالت : كان فيما اشترط علينا من المعروف حين بايعنا ألا ننوح ، فقالت امرأة من بني فلان : إن بني فلان أسعدوني ، فلا حتى أجزيهم ، فانطلقت ، فأسعدتهم ، ثم جاءت فبايعت ، قالت : فما وفى منهن غيرها ، وغير أم سليم ابنة ملحان أم أنس بن مالك .\nوقد روى البخاري هذا الحديث من طريق حفصة بنت سيرين ، عن أم عطية نسيبة الأنصارية رضي الله عنها وقد روي نحوه من وجه آخر أيضا .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا أبو نعيم ، حدثنا عمر بن فروخ القتات ، حدثني مصعب بن نوح الأنصاري قال : أدركت عجوزا لنا كانت فيمن بايع رسول الله - صلى الله عليه وسلم - . قالت : فأتيته لأبايعه ، فأخذ علينا فيما أخذ ألا تنحن . فقالت عجوز : يا رسول الله ، إن ناسا قد كانوا أسعدوني على مصائب أصابتني ، وأنهم قد أصابتهم مصيبة ، فأنا أريد أسعدهم . قال : \" فانطلقي فكافئيهم \" . فانطلقت فكافأتهم ، ثم إنها أتته فبايعته ، وقال : هو المعروف الذي قال الله عز وجل : ( ولا يعصينك في معروف ) .\nوقال ابن أبي حاتم : حدثنا أحمد بن منصور الرمادي ، حدثنا القعنبي ، حدثنا الحجاج بن صفوان ، عن أسيد بن أبي أسيد البراد ، عن امرأة من المبايعات قالت : كان فيما أخذ علينا رسول الله - صلى الله عليه وسلم - : أن لا نعصيه في معروف : أن لا نخمش وجوها ، ولا ننشر شعرا ، ولا نشق جيبا ، ولا ندعو ويلا .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا وكيع ، عن يزيد مولى الصهباء ، عن شهر بن حوشب ، عن أم سلمة ، عن رسول الله - صلى الله عليه وسلم - في قوله : ( ولا يعصينك في معروف ) قال : \" النوح \" .\nورواه الترمذي في التفسير ، عن عبد بن حميد ، عن أبي نعيم ، وابن ماجه ، عن أبي بكر بن أبي شيبة ، عن وكيع - كلاهما عن يزيد بن عبد الله الشيباني مولى الصهباء به . ، وقال الترمذي : حسن غريب .\nوقال ابن جرير : حدثنا محمد بن سنان القزاز ، حدثنا إسحاق بن إدريس ، حدثنا إسحاق بن عثمان أبو يعقوب ، حدثني إسماعيل بن عبد الرحمن بن عطية ، عن جدته أم عطية قالت : لما قدم رسول الله - صلى الله عليه وسلم - جمع نساء الأنصار في بيت ، ثم أرسل إلينا عمر بن الخطاب ، رضي الله عنه ، فقام على الباب وسلم علينا ، فرددن - أو : فرددنا - عليه السلام ، ثم قال : \" أنا رسول رسول الله - صلى الله عليه وسلم - إليكن \" . قالت : فقلنا : مرحبا برسول الله وبرسول رسول الله . فقال : \" تبايعن على ألا تشركن بالله شيئا ، ولا تسرقن ، ولا تزنين ؟ \" قالت : فقلنا : نعم . قالت : فمد يده من خارج الباب - أو : البيت - ومددنا أيدينا من داخل البيت ، ثم قال : \" اللهم اشهد \" . قالت : وأمرنا في العيدين أن نخرج فيه الحيض ، والعواتق ، ولا جمعة علينا ، ونهانا عن اتباع الجنائز . قال إسماعيل : فسألت جدتي عن قوله : ( ولا يعصينك في معروف ) قالت : النياحة .\nوفي الصحيحين من طريق الأعمش ، عن عبد الله بن مرة ، عن مسروق ، عن عبد الله بن مسعود قال : قال رسول الله - صلى الله عليه وسلم - : \" ليس منا من ضرب الخدود ، وشق الجيوب ، ودعا بدعوى الجاهلية \" .\nوفي الصحيحين أيضا عن أبي موسى : أن رسول الله - صلى الله عليه وسلم - برئ من الصالقة ، والحالقة ، والشاقة .\nوقال الحافظ أبو يعلى : حدثنا هدبة بن خالد ، حدثنا أبان بن يزيد ، حدثنا يحيى بن أبي كثير : أن زيدا حدثه : أن أبا سلام حدثه : أن أبا مالك الأشعري حدثه : أن رسول الله - صلى الله عليه وسلم - قال : \" أربع في أمتي من أمر الجاهلية لا يتركونهن : الفخر في الأحساب ، والطعن في الأنساب ، والاستسقاء بالنجوم ، والنياحة . وقال : النائحة إذا لم تتب قبل موتها تقام يوم القيامة وعليها سربال من قطران ، ودرع من جرب \" .\nورواه مسلم في صحيحه منفردا به ، من حديث أبان بن يزيد العطار به . .\nوعن أبي سعيد : أن رسول الله - صلى الله عليه وسلم - لعن النائحة والمستمعة . رواه أبو داود\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا جَآءَكَ ٱلۡمُؤۡمِنَٰتُ يُبَايِعۡنَكَ عَلَىٰٓ أَن لَّا يُشۡرِكۡنَ بِٱللَّهِ شَيۡ‍ٔٗا وَلَا يَسۡرِقۡنَ وَلَا يَزۡنِينَ وَلَا يَقۡتُلۡنَ أَوۡلَٰدَهُنَّ وَلَا يَأۡتِينَ بِبُهۡتَٰنٖ يَفۡتَرِينَهُۥ بَيۡنَ أَيۡدِيهِنَّ وَأَرۡجُلِهِنَّ وَلَا يَعۡصِينَكَ فِي مَعۡرُوفٖ فَبَايِعۡهُنَّ وَٱسۡتَغۡفِرۡ لَهُنَّ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٢١\n                                    \n                                    \n                                    قوله تعالى : يا أيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ولا يعصينك في معروف فبايعهن واستغفر لهن الله إن الله غفور رحيم\nفيها ثماني مسائل :\nالأولى : قوله تعالى : يا أيها النبي إذا جاءك المؤمنات يبايعنك لما فتح رسول الله صلى الله عليه وسلم مكة جاء نساء أهل مكة يبايعنه ، فأمر أن يأخذ عليهن ألا يشركن . وفي صحيح مسلم عن عائشة زوج النبي صلى الله عليه وسلم قالت : كان المؤمنات إذا هاجرن إلى رسول الله صلى الله عليه وسلم يمتحن بقول الله تعالى : يا أيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين إلى آخر الآية . قالت عائشة : فمن أقر بهذا من المؤمنات فقد أقر بالمحنة ، وكان رسول الله صلى الله عليه وسلم إذا أقررن بذلك من قولهن قال لهن رسول الله صلى الله عليه وسلم : \" انطلقن فقد بايعتكن \" ولا والله ما مست يد رسول الله يد امرأة قط ، غير أنه بايعهن بالكلام . قالت عائشة : والله ما أخذ رسول الله صلى الله عليه وسلم على النساء قط إلا بما أمره الله عز وجل ، وما مست كف رسول الله صلى الله عليه وسلم كف امرأة قط ; وكان يقول لهن إذا أخذ عليهن : \" قد بايعتكن \" كلاما . وروي أنه عليه الصلاة والسلام بايع النساء وبين يديه وأيديهن ثوب ، وكان يشترط عليهن . وقيل : لما فرغ من بيعة الرجال جلس على الصفا ومعه عمر أسفل منه ، فجعل يشترط على النساء البيعة وعمر يصافحهن . وروي أنه كلف امرأة وقفت على الصفا فبايعتهن . ابن العربي : وذلك ضعيف ، وإنما ينبغي التعويل على ما في الصحيح . وقالت أم عطية : لما قدم رسول الله صلى الله عليه وسلم المدينة جمع نساء الأنصار في بيت ، ثم أرسل إلينا عمر بن الخطاب ، فقام على الباب فسلم فرددن عليه السلام ، فقال : أنا رسول رسول الله صلى الله عليه وسلم إليكن ; ألا تشركن بالله شيئا . فقلن : نعم . فمد يده من خارج البيت ومددنا أيدينا من داخل البيت ; ثم قال : اللهم اشهد . وروى عمرو بن شعيب عن أبيه عن جده أن النبي صلى الله عليه وسلم كان إذا بايع النساء دعا بقدح من ماء ، فغمس يده فيه ثم أمر النساء فغمسن أيديهن فيه .\nالثانية : روي أن النبي صلى الله عليه وسلم لما قال : على ألا يشركن بالله شيئا ، قالت هند بنت عتبة وهي منتقبة خوفا من النبي صلى الله عليه وسلم أن يعرفها لما صنعته بحمزة يوم أحد : والله إنك لتأخذ علينا أمرا ما رأيتك أخذته على الرجال ، وكان بايع الرجال يومئذ على الإسلام والجهاد فقط - فقال النبي صلى الله عليه وسلم : \" ولا يسرقن \" فقالت هند : إن أبا سفيان رجل شحيح ، وإني أصيب من ماله قوتنا . فقال أبو سفيان : هو لك حلال . فضحك النبي صلى الله عليه وسلم وعرفها وقال : \" أنت هند \" فقالت : عفا الله عما سلف . ثم قال : \" ولا يزنين \" فقالت هند : أوتزني الحرة ! ثم قال : \" ولا يقتلن أولادهن \" أي لا يئدن الموءودات ولا يسقطن الأجنة . فقالت هند : ربيناهم صغارا وقتلتهم كبارا يوم بدر ، فأنتم وهم أبصر . وروى مقاتل أنها قالت : ربيناهم صغارا وقتلتموهم كبارا ، وأنتم وهم أعلم . فضحك عمر بن الخطاب حتى استلقى . وكان حنظلة بن أبي سفيان وهو بكرها قتل يوم بدر . ثم قال : ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ولا يعصينك في معروف قيل : معنى بين أيديهن \" : ألسنتهن بالنميمة . ومعنى بين أرجلهن : فروجهن . وقيل : ما كان بين أيديهن من قبلة أو جسة ، وبين أرجلهن الجماع ، وقيل : المعنى لا يلحقن برجالهن ولدا من غيرهم . وهذا قول الجمهور . وكانت المرأة تلتقط ولدا فتلحقه بزوجها وتقول : هذا ولدي منك . فكان هذا من البهتان والافتراء . وقيل : ما بين يديها ورجليها كناية عن الولد ; لأن بطنها الذي تحمل فيه الولد بين يديها ، وفرجها الذي تلد منه بين رجليها . وهذا عام في الإتيان بولد وإلحاقه بالزوج وإن سبق النهي عن الزنى . وروي أن هندا لما سمعت ذلك قالت : والله إن البهتان لأمر قبيح ; ما تأمر إلا بالأرشد ومكارم الأخلاق ! ثم قال : ولا يعصينك في معروف قال قتادة : لا ينحن . ولا تخلو امرأة منهن إلا بذي محرم . وقال سعيد بن المسيب ، ومحمد بن السائب وزيد بن أسلم : هو ألا يخمشن وجها . ولا يشققن جيبا ، ولا يدعون ويلا ، ولا ينشرن شعرا ، ولا يحدثن الرجال إلا ذا محرم . وروت أم عطية عن النبي صلى الله عليه وسلم أن ذلك في النوح . وهو قول ابن عباس . وروى شهر بن حوشب عن أم سلمة عن النبي صلى الله عليه وسلم ولا يعصينك في معروف فقال : هو النوح . وقال مصعب بن نوح : أدركت عجوزا ممن بايع النبي صلى الله عليه وسلم ، فحدثتني عنه عليه الصلاة والسلام في قول : ولا يعصينك في معروف فقال : \" النوح \" . وفي صحيح مسلم عن أم عطية لما نزلت هذه الآية : يبايعنك على ألا يشركن بالله شيئا إلى قوله : ولا يعصينك في معروف قال : كان منه النياحة قالت : فقلت : يا رسول الله ، إلا آل فلان فإنهم كانوا أسعدوني في الجاهلية ; فلا بد لي من أن أسعدهم . فقال رسول الله صلى الله عليه وسلم : \" إلا آل فلان \" . وعنها قالت : أخذ علينا رسول الله صلى الله عليه وسلم مع البيعة ألا ننوح ; فما وفت منا امرأة إلا خمس : أم سليم ، وأم العلاء ، وابنة أبي سبرة امرأة معاذ أو ابنة أبي سبرة ، وامرأة معاذ . وقيل : إن المعروف هاهنا الطاعة لله ولرسوله ; قاله ميمون بن مهران . وقال بكر بن عبد الله المزني : لا يعصينك في كل أمر فيه رشدهن . الكلبي : هو عام في كل معروف أمر الله عز وجل ورسوله به . فروي أن هندا قالت عند ذلك : ما جلسنا في مجلسنا هذا وفي أنفسنا أن نعصيك في شيء .\nالثالثة : ذكر الله عز وجل ورسوله عليه الصلاة والسلام في صفة البيعة خصالا شتى ; صرح فيهن بأركان النهي في الدين ولم يذكر أركان الأمر . وهي ستة أيضا : الشهادة ، والصلاة ، والزكاة ، والصيام ، والحج ، والاغتسال من الجنابة . وذلك لأن النهي دائم في كل الأزمان وكل الأحوال ; فكان التنبيه على اشتراط الدائم آكد . وقيل : إن هذه المناهي كان في النساء كثير من يرتكبها ولا يحجزهن عنها شرف النسب ، فخصت بالذكر لهذا . ونحو منه قوله عليه الصلاة والسلام لوفد عبد القيس : \" وأنهاكم عن الدباء والحنتم والنقير والمزفت \" فنبههم على ترك المعصية في شرب الخمر دون سائر المعاصي ، لأنها كانت شهوتهم وعادتهم ، وإذا ترك المرء شهوته من المعاصي هان عليه ترك سائرها مما لا شهوة له فيها .\nالرابعة : لما قال النبي صلى الله عليه وسلم في البيعة : \" ولا يسرقن \" قالت هند : يا رسول الله ، إن أبا سفيان رجل مسيك ، فهل علي حرج أن آخذ ما يكفيني وولدي ؟ قال : \" لا إلا بالمعروف \" فخشيت هند أن تقتصر على ما يعطيها فتضيع ، أو تأخذ أكثر من ذلك فتكون سارقة ناكثة للبيعة المذكورة . فقال لها النبي صلى الله عليه وسلم : لا ؛ أي لا حرج عليك فيما أخذت بالمعروف ، يعني من غير استطالة إلى أكثر من الحاجة . قال ابن العربي وهذا إنما هو فيما لا يخزنه عنها في حجاب ولا يضبط عليه بقفل فإنه إذا هتكته الزوجة وأخذت منه كانت سارقة تعصي به وتقطع يدها .\nالخامسة : قال عبادة بن الصامت : أخذ علينا رسول الله صلى الله عليه وسلم كما أخذ على النساء : \" ألا تشركوا بالله شيئا ، ولا تسرقوا ، ولا تزنوا ، ولا تقتلوا أولادكم ، ولا يعضه بعضكم بعضا ، ولا تعصوا في معروف أمركم به \" . معنى \" يعضه \" يسحر . والعضه : السحر . ولهذا قال ابن بحر وغيره في قوله تعالى : ولا يأتين ببهتان : إنه السحر . وقال الضحاك : هذا نهي عن البهتان ، أي لا يعضهن رجلا ولا امرأة . ببهتان أي بسحر . والله أعلم . يفترينه بين أيديهن وأرجلهن والجمهور على أن معنى ببهتان بولد يفترينه بين أيديهن ما أخذته لقيطا . وأرجلهن ما ولدته من زنى . وقد تقدم .\nالسادسة : قوله تعالى : ولا يعصينك في معروف في البخاري عن ابن عباس في قوله تعالى : ولا يعصينك في معروف قال : إنما هو شرط شرطه الله للنساء . واختلف في معناه على ما ذكرنا . والصحيح أنه عام في جميع ما يأمر به النبي صلى الله عليه وسلم وينهى عنه ; فيدخل فيه النوح وتخريق الثياب وجز الشعر والخلوة بغير محرم إلى غير ذلك . وهذه كلها كبائر ومن أفعال الجاهلية . وفي صحيح مسلم عن أبي مالك الأشعري أن النبي صلى الله عليه وسلم قال : \" أربع في أمتي من أمر الجاهلية فذكر منها النياحة \" . وروى يحيى بن أبي كثير عن أبي سلمة عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" هذه النوائح يجعلن يوم القيامة صفين ، صفا عن اليمين وصفا عن اليسار ، ينبحن كما تنبح الكلاب في يوم كان مقداره خمسين ألف سنة ، ثم يؤمر بهن إلى النار \" . وعنه قال : قال رسول الله صلى الله عليه وسلم : \" لا تصلي الملائكة على نائحة ولا مرنة \" . وروي عن عمر بن الخطاب رضي الله عنه أنه سمع نائحة فأتاها فضربها بالدرة حتى وقع خمارها عن رأسها . فقيل : يا أمير المؤمنين ، المرأة المرأة ! قد وقع خمارها . فقال : إنها لا حرمة لها . أسند جميعه الثعلبي رحمه الله .\nأما تخصيص قوله : \" في معروف \" مع قوة قوله : \" ولا يعصينك \" ففيه قولان : أحدهما : أنه تفسير للمعنى على التأكيد ; كما قال تعالى : قال رب احكم بالحق لأنه لو قال احكم لكفى . الثاني : إنما شرط المعروف في بيعة النبي صلى الله عليه وسلم حتى يكون تنبيها على أن غيره أولى بذلك وألزم له وأنفى للإشكال .\nالسابعة : روى البخاري عن عبادة بن الصامت قال : كنا عند النبي صلى الله عليه وسلم فقال : \" أتبايعونني على ألا تشركوا بالله شيئا ولا تزنوا ولا تسرقوا \" - قرأ آية النساء ، وأكثر لفظ سفيان : قرأ في الآية - \" فمن وفى منكم فأجره على الله ، ومن أصاب من ذلك شيئا فعوقب فهو كفارة له ، ومن أصاب من ذلك شيئا فستره الله فهو إلى الله ، إن شاء عذبه وإن شاء غفر له منها \" . وفي الصحيحين عن ابن عباس قال : شهدت الصلاة يوم الفطر مع رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان ; فكلهم يصليها قبل الخطبة ثم يخطب ; فنزل نبي الله صلى الله عليه وسلم فكأني أنظر إليه حين يجلس الرجال بيده ، ثم أقبل يشقهم حتى أتى النساء مع بلال فقال : يا أيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله شيئا ولا يسرقن ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن - حتى فرغ من الآية كلها ، ثم قال حين فرغ - : \" أنتن على ذلك ؟ \" فقالت امرأة واحدة لم يجبه غيرها : نعم يا رسول الله ; لا يدري الحسن من هي . قال : \" فتصدقن \" وبسط بلال ثوبه فجعلن يلقين الفتخ والخواتيم في ثوب بلال . لفظ البخاري .\nالثامنة : قال المهدوي : أجمع المسلمون على أنه ليس للإمام أن يشترط عليهن هذا ; والأمر بذلك ندب لا إلزام . وقال بعض أهل النظر : إذا احتيج إلى المحنة من أجل تباعد الدار كان على إمام المسلمين إقامة المحنة .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا جَآءَكَ ٱلۡمُؤۡمِنَٰتُ يُبَايِعۡنَكَ عَلَىٰٓ أَن لَّا يُشۡرِكۡنَ بِٱللَّهِ شَيۡ‍ٔٗا وَلَا يَسۡرِقۡنَ وَلَا يَزۡنِينَ وَلَا يَقۡتُلۡنَ أَوۡلَٰدَهُنَّ وَلَا يَأۡتِينَ بِبُهۡتَٰنٖ يَفۡتَرِينَهُۥ بَيۡنَ أَيۡدِيهِنَّ وَأَرۡجُلِهِنَّ وَلَا يَعۡصِينَكَ فِي مَعۡرُوفٖ فَبَايِعۡهُنَّ وَٱسۡتَغۡفِرۡ لَهُنَّ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٢١\n                                        \n                                        \n                                        \n                                        هذه الشروط المذكورة في هذه الآية، تسمى \"مبايعة النساء\" اللاتي [كن] يبايعن على إقامة الواجبات المشتركة، التي تجب على الذكور والنساء في جميع الأوقات.\nوأما الرجال، فيتفاوت ما يلزمهم بحسب أحوالهم ومراتبهم وما يتعين عليهم، فكان النبي صلى الله عليه وسلم يمتثل ما أمره الله به، فكان إذا جاءته النساء يبايعنه، والتزمن بهذه الشروط بايعهن، وجبر قلوبهن، واستغفر لهن الله، فيما يحصل منهن من التقصير وأدخلهن في جملة المؤمنين بأن { لَا يُشْرِكْنَ بِاللَّهِ شَيْئًا } بأن يفردن الله [وحده] بالعبادة.\n{ وَلَا يَزْنِينَ } كما كان ذلك موجودا كثيرا في البغايا وذوات الأخدان، { وَلَا يَقْتُلْنَ أَوْلَادَهُنَّ } كما يجري لنساء الجاهلية الجهلاء.\n{ وَلَا يَأْتِينَ بِبُهْتَانٍ يَفْتَرِينَهُ بَيْنَ أَيْدِيهِنَّ وَأَرْجُلِهِنَّ } والبهتان: الافتراء على الغير أي: لا يفترين بكل حالة، سواء تعلقت بهن وأزواجهن أو سواء تعلق ذلك بغيرهم، { وَلَا يَعْصِينَكَ فِي مَعْرُوفٍ } أي: لا يعصينك في كل أمر تأمرهن به، لأن أمرك لا يكون إلا بمعروف، ومن ذلك طاعتهن [لك] في النهي عن النياحة، وشق الثياب، وخمش الوجوه، والدعاء بدعاء الجاهلية.\n{ فَبَايِعْهُنَّ } إذا التزمن بجميع ما ذكر.\n{ وَاسْتَغْفِرْ لَهُنَّ اللَّهَ } عن تقصيرهن، وتطييبا لخواطرهن، { إِنَّ اللَّهَ غَفُورٌ } أي: كثير المغفرة للعاصين، والإحسان إلى المذنبين التائبين، { رَحِيمٌ } وسعت رحمته كل شيء، وعم إحسانه البرايا.\n                                    "
    }
  },
  {
    "id": 12,
    "versesNumber": 13,
    "souraName": "Al-Mumtahanah.html",
    "contnent": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِمۡ قَدۡ يَئِسُواْ مِنَ ٱلۡأٓخِرَةِ كَمَا يَئِسَ ٱلۡكُفَّارُ مِنۡ أَصۡحَٰبِ ٱلۡقُبُورِ ٣١",
    "tafsier": {
      "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِمۡ قَدۡ يَئِسُواْ مِنَ ٱلۡأٓخِرَةِ كَمَا يَئِسَ ٱلۡكُفَّارُ مِنۡ أَصۡحَٰبِ ٱلۡقُبُورِ ٣١\n                                    \n                                    \n                                    ينهى تبارك وتعالى عن موالاة الكافرين في آخر \" هذه السورة \" كما نهى عنها في أولها فقال : ( يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم ) يعني : اليهود والنصارى وسائر الكفار ، ممن غضب الله عليه ولعنه واستحق من الله الطرد والإبعاد ، فكيف توالونهم وتتخذونهم أصدقاء وأخلاء وقد يئسوا من الآخرة ، أي : من ثواب الآخرة ونعيمها في حكم الله عز وجل . وقوله : ( كما يئس الكفار من أصحاب القبور ) فيه قولان ، أحدهما : كما يئس الكفار الأحياء من قراباتهم الذين في القبور أن يجتمعوا بهم بعد ذلك ; لأنهم لا يعتقدون بعثا ولا نشورا ، فقد انقطع رجاؤهم منهم فيما يعتقدونه .\nقال العوفي ، عن ابن عباس : ( يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم ) إلى آخر السورة ، يعني من مات من الذين كفروا فقد يئس الأحياء من الذين كفروا أن يرجعوا إليهم أو يبعثهم الله عز وجل .\nوقال الحسن البصري : ( كما يئس الكفار من أصحاب القبور ) قال : الكفار الأحياء قد يئسوا من الأموات .\nوقال قتادة : كما يئس الكفار أن يرجع إليهم أصحاب القبور الذين ماتوا . وكذا قال الضحاك . رواهن ابن جرير .\nوالقول الثاني : معناه : كما يئس الكفار الذين هم في القبور من كل خير .\nقال الأعمش ، عن أبي الضحى ، عن مسروق ، عن ابن مسعود : ( كما يئس الكفار من أصحاب القبور ) قال : كما يئس هذا الكافر إذا مات وعاين ثوابه واطلع عليه . وهذا قول مجاهد ، وعكرمة ، ومقاتل ، وابن زيد ، والكلبي ، ومنصور . وهو اختيار ابن جرير .\nآخر تفسير سورة الممتحنة ولله الحمد والمنة.\n                                    ",
      "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِمۡ قَدۡ يَئِسُواْ مِنَ ٱلۡأٓخِرَةِ كَمَا يَئِسَ ٱلۡكُفَّارُ مِنۡ أَصۡحَٰبِ ٱلۡقُبُورِ ٣١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم قد يئسوا من الآخرة كما يئس الكفار من أصحاب القبور\nقوله تعالى : يا أيها الذين آمنوا لا تتولوا قوما غضب الله عليهم يعني اليهود . وذلك أن ناسا من فقراء المسلمين كانوا يخبرون اليهود بأخبار المؤمنين ويواصلونهم فيصيبون بذلك من ثمارهم فنهوا عن ذلك . قد يئسوا من الآخرة يعني اليهود قاله ابن زيد . وقيل : هم المنافقون . وقال الحسن : هم اليهود والنصارى . قال ابن مسعود : معناه أنهم تركوا العمل للآخرة وآثروا الدنيا . وقيل : المعنى يئسوا من ثواب الآخرة ، قاله مجاهد .\nومعنى كما يئس الكفار أي الأحياء من الكفار .\nمن أصحاب القبور أن يرجعوا إليهم ; قاله الحسن وقتادة . قال ابن عرفة : وهم الذين قالوا : وما يهلكنا إلا الدهر . وقال مجاهد : المعنى كما يئس الكفار الذين في القبور أن يرجعوا إلى الدنيا .\nوقيل : إن الله تعالى ختم السورة بما بدأها من ترك موالاة الكفار ; وهي خطاب لحاطب بن أبي بلتعة وغيره . قال ابن عباس : يا أيها الذين آمنوا لا تتولوا أي لا توالوهم ولا تناصحوهم ; رجع تعالى بطوله وفضله على حاطب بن أبي بلتعة . يريد أن كفار قريش قد يئسوا من خير الآخرة كما يئس الكفار المقبورون من حظ يكون لهم في الآخرة من رحمة الله تعالى . وقال القاسم بن أبي بزة في قوله تعالى : قد يئسوا من الآخرة كما يئس الكفار من أصحاب القبور قال : من مات من الكفار يئس من الخير . والله أعلم .\n                                    ",
      "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَوَلَّوۡاْ قَوۡمًا غَضِبَ ٱللَّهُ عَلَيۡهِمۡ قَدۡ يَئِسُواْ مِنَ ٱلۡأٓخِرَةِ كَمَا يَئِسَ ٱلۡكُفَّارُ مِنۡ أَصۡحَٰبِ ٱلۡقُبُورِ ٣١\n                                        \n                                        \n                                        \n                                        أي: يا أيها المؤمنون، إن كنتم مؤمنين بربكم، ومتبعين لرضاه ومجانبين لسخطه، { لَا تَتَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ } وإنما غضب عليهم لكفرهم، وهذا شامل لجميع أصناف الكفار. { قَدْ يَئِسُوا مِنَ الْآخِرَةِ } أي: قد حرموا من خير الآخرة، فليس لهم منها نصيب، فاحذروا أن تولوهم فتوافقوهم على شرهم وكفرهم فتحرموا خير الآخرة كما حرموا.\n[وقوله] { كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ } حين أفضوا إلى الدار الآخرة، ووقفوا على حقيقة الأمر وعلموا علم اليقين أنهم لا نصيب لهم منها. ويحتمل أن المعنى: قد يئسوا من الآخرة أي: قد أنكروها وكفروا بها، فلا يستغرب حينئذ منهم الإقدام على مساخط الله وموجبات عذابه وإياسهم من الآخرة، كما يئس الكفار المنكرون للبعث في الدنيا من رجوع أصحاب القبور إلى الله تعالى.\nتم تفسير سورة الممتحنة،\nوالحمد لله رب العالمين.\n                                    "
    }
  }
]