[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَيۡلٞ لِّلۡمُطَفِّفِينَ ١",
    "tafsier": {
      "ibnkther": "وَيۡلٞ لِّلۡمُطَفِّفِينَ ١\n                                    \n                                    \n                                    سورة المطففين وهي مدنية\nقال النسائي وابن ماجه أخبرنا محمد بن عقيل زاد ابن ماجه وعبد الرحمن بن بشر قالا حدثنا علي بن الحسين بن واقد حدثني أبي عن يزيد هو ابن أبي سعيد النحوي مولى قريش عن عكرمة عن ابن عباس قال لما قدم نبي الله صلى الله عليه وسلم المدينة كانوا من أخبث الناس كيلا فأنزل الله ( ويل للمطففين ) فحسنوا الكيل بعد ذلك .\nوقال ابن أبي حاتم حدثنا جعفر بن النضر بن حماد حدثنا محمد بن عبيد عن الأعمش عن عمرو بن مرة عن عبد الله بن الحارث عن هلال بن طلق قال بينا أنا أسير مع ابن عمر فقلت من أحسن الناس هيئة وأوفاه كيلا أهل مكة أو المدينة قال حق لهم أما سمعت الله يقول ( ويل للمطففين )\nوقال ابن جرير حدثنا أبو السائب حدثنا ابن فضيل عن ضرار عن عبد الله المكتب عن رجل عن عبد الله قال قال له رجل يا أبا عبد الرحمن إن أهل المدينة ليوفون الكيل . قال وما يمنعهم أن يوفوا الكيل وقد قال الله عز وجل ( ويل للمطففين ) حتى بلغ ( يوم يقوم الناس لرب العالمين ) .\nفالمراد بالتطفيف هاهنا البخس في المكيال والميزان إما بالازدياد إن اقتضى من الناس وإما بالنقصان إن قضاهم\n                                    ",
      "qortoby": "وَيۡلٞ لِّلۡمُطَفِّفِينَ ١\n                                    \n                                    \n                                    سورة المطففين\nمكية في قول ابن مسعود والضحاك ومقاتل . ومدنية في قول الحسن وعكرمة . وهي ست وثلاثون آية\nقال مقاتل : وهي أول سورة نزلت بالمدينة . وقال ابن عباس وقتادة : مدنية إلا ثماني آيات من قوله : إن الذين أجرموا إلى آخرها مكي . وقال الكلبي وجابر بن زيد : نزلت بين مكة والمدينة .\nبسم الله الرحمن الرحيم\nويل للمطففين\nفيه أربع مسائل :\nالأولى : روى النسائي عن ابن عباس قال : لما قدم النبي - صلى الله عليه وسلم - المدينة كانوا من أخبث الناس كيلا ، فأنزل الله تعالى : ويل للمطففين فأحسنوا الكيل بعد ذلك . قال الفراء : فهم من أوفى الناس كيلا إلى يومهم هذا . وعن ابن عباس أيضا قال : هي : أول سورة نزلت على رسول الله - صلى الله عليه وسلم - ساعة نزل المدينة ، وكان هذا فيهم ; كانوا إذا اشتروا استوفوا بكيل راجح ، فإذا باعوا بخسوا المكيال والميزان ، فلما نزلت هذه السورة انتهوا ، فهم أوفى الناس كيلا إلى يومهم هذا . وقال قوم : نزلت في رجل يعرف بأبي جهينة ، واسمه عمرو ; كان له صاعان يأخذ بأحدهما ، ويعطي بالآخر ; قاله أبو هريرة - رضي الله عنه - .\nالثانية : قوله تعالى : ويل أي شدة عذاب في الآخرة . وقال ابن عباس : إنه واد في جهنم يسيل فيه صديد أهل النار ، فهو قوله تعالى : ويل للمطففين أي الذين ينقصون مكاييلهم وموازينهم . وروي عن ابن عمر قال : المطفف : الرجل يستأجر المكيال وهو يعلم أنه يحيف في كيله فوزره عليه . وقال آخرون : التطفيف في الكيل والوزن والوضوء والصلاة ، والحديث في الموطأ قال مالك : ويقال لكل شيء وفاء وتطفيف . وروي عن سالم بن أبي الجعد قال : الصلاة بمكيال ، فمن أوفى له ومن طفف فقد علمتم ما قال الله - عز وجل - في ذلك : ويل للمطففين .\nالثالثة : قال أهل اللغة : المطفف مأخوذ من الطفيف ، وهو القليل ، والمطفف هو المقل حق صاحبه بنقصانه عن الحق ، في كيل أو وزن . وقال الزجاج : إنما قيل للفاعل من هذا مطفف ; لأنه لا يكاد يسرق من المكيال والميزان إلا الشيء الطفيف الخفيف ، وإنما أخذ من طف الشيء وهو جانبه . وطفاف المكوك وطفافه بالكسر والفتح : ما ملأ أصباره ، وكذلك طف المكوك وطففه ; وفي الحديث : كلكم بنو آدم طف الصاع لم تملؤوه . وهو أن يقرب أن يمتلئ فلا يفعل ، والمعنى بعضكم من بعض قريب ، فليس لأحد على أحد فضل إلا بالتقوى . والطفاف والطفافة بالضم : ما فوق المكيال . وإناء طفاف : إذا بلغ الملء طفافه ; تقول منه : أطففت . والتطفيف : نقص المكيال وهو ألا تملأه إلى أصباره ، أي جوانبه ; يقال : أدهقت الكأس إلى أصبارها أي إلى رأسها . وقول ابن عمر حين ذكر النبي - صلى الله عليه وسلم - سبق الخيل : كنت فارسا يومئذ فسبقت الناس حتى طفف بي الفرس مسجد بني زريق ، حتى كاد يساوي المسجد . يعني : وثب بي .\nالرابعة : المطفف : هو الذي يخسر في الكيل والوزن ، ولا يوفي حسب ما بيناه ; وروى ابن القاسم عن مالك : أنه قرأ ويل للمطففين فقال : لا تطفف ولا تخلب ، ولكن أرسل وصب عليه صبا ، حتى إذا استوفى أرسل يدك ولا تمسك . وقال عبد الملك بن الماجشون : نهى رسول الله - صلى الله عليه وسلم - عن مسح الطفاف ، وقال : إن البركة في رأسه . قال : وبلغني أن كيل فرعون كان مسحا بالحديد .\n                                    ",
      "saadi": "وَيۡلٞ لِّلۡمُطَفِّفِينَ ١\n                                        \n                                        \n                                        \n                                        { وَيْلٌ } كلمة عذاب، ووعيد { لِلْمُطَفِّفِينَ }\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "ٱلَّذِينَ إِذَا ٱكۡتَالُواْ عَلَى ٱلنَّاسِ يَسۡتَوۡفُونَ ٢",
    "tafsier": {
      "ibnkther": "ٱلَّذِينَ إِذَا ٱكۡتَالُواْ عَلَى ٱلنَّاسِ يَسۡتَوۡفُونَ ٢\n                                    \n                                    \n                                    بقوله تعالى \"الذين إذا اكتالوا على الناس\" أي من الناس \"يستوفون\" أي يأخذون حقهم بالوافي والزائد.\n                                    ",
      "qortoby": "ٱلَّذِينَ إِذَا ٱكۡتَالُواْ عَلَى ٱلنَّاسِ يَسۡتَوۡفُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : الذين إذا اكتالوا على الناس يستوفون قال الفراء : أي من الناس يقال : اكتلت منك : أي استوفيت منك ، ويقال : اكتلت ما عليك : أي أخذت ما عليك . وقال الزجاج : أي إذا اكتالوا من الناس استوفوا عليهم الكيل ; والمعنى : الذين إذا استوفوا أخذوا الزيادة ، وإذا أوفوا أو وزنوا لغيرهم نقصوا ، فلا يرضون للناس ما يرضون لأنفسهم . الطبري : ( على ) بمعنى ( عند ) .\n                                    ",
      "saadi": "ٱلَّذِينَ إِذَا ٱكۡتَالُواْ عَلَى ٱلنَّاسِ يَسۡتَوۡفُونَ ٢\n                                        \n                                        \n                                        \n                                        وفسر الله المطففين بقوله { الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ } أي: أخذوا منهم وفاء عما ثبت لهم قبلهم { يَسْتَوْفُونَ } يستوفونه كاملا من غير نقص.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَإِذَا كَالُوهُمۡ أَو وَّزَنُوهُمۡ يُخۡسِرُونَ ٣",
    "tafsier": {
      "ibnkther": "وَإِذَا كَالُوهُمۡ أَو وَّزَنُوهُمۡ يُخۡسِرُونَ ٣\n                                    \n                                    \n                                    أي ينقصون والأحسن أن يجعل كالوا و وزنوا \" متعديا ويكون هم في محل نصب ومنهم من يجعلها ضميرا مؤكدا للمستتر في قوله كالوا و \" وزنوا ويحذف المفعول لدلالة الكلام عليه وكلاهما متقارب\nوقد أمر الله تعالى بالوفاء في الكيل والميزان فقال ( وأوفوا الكيل إذا كلتم وزنوا بالقسطاس المستقيم ذلك خير وأحسن تأويلا ) الإسراء 35 وقال ( وأوفوا الكيل والميزان بالقسط لا نكلف نفسا إلا وسعها ) الأنعام 152 وقال ( وأقيموا الوزن بالقسط ولا تخسروا الميزان ) الرحمن : 9 وأهلك الله قوم شعيب ودمرهم على ما كانوا يبخسون الناس في المكيال والميزان .\n                                    ",
      "qortoby": "وَإِذَا كَالُوهُمۡ أَو وَّزَنُوهُمۡ يُخۡسِرُونَ ٣\n                                    \n                                    \n                                    قوله تعالى : وإذا كالوهم أو وزنوهم يخسرون فيه مسألتان :\nالأولى : قوله تعالى : وإذا كالوهم أو وزنوهم : أي كالوا لهم أو وزنوا لهم فحذفت اللام ، فتعدى الفعل فنصب ; ومثله نصحتك ونصحت لك ، وأمرتك به وأمرتكه ; قاله الأخفش والفراء . قال الفراء : وسمعت أعرابية تقول إذا صدر الناس أتينا التاجر فيكيلنا المد والمدين إلى الموسم المقبل . وهو من كلام أهل الحجاز ومن جاورهم من قيس . قال الزجاج : لا يجوز الوقف على ( كالوا ) و ( وزنوا ) حتى تصل به ( هم ) قال : ومن الناس من يجعلها توكيدا ، ويجيز الوقف على ( كالوا ) و ( وزنوا ) والأول الاختيار ; لأنها حرف واحد . وهو قول الكسائي . قال أبو عبيد : وكان عيسى بن عمر يجعلها حرفين ، ويقف على ( كالوا ) و ( وزنوا ) ويبتدئ ( هم يجسرون ) قال : وأحسب قراءة حمزة كذلك أيضا .\nقال أبو عبيد : والاختيار أن يكونا كلمة واحدة من جهتين : إحداهما : الخط ; وذلك أنهم كتبوهما بغير ألف ، ولو كانتا مقطوعتين لكانتا ( كالوا ) و ( وزنوا ) بالألف ، والأخرى : أنه يقال : كلتك ووزنتك بمعنى كلت لك ، ووزنت لك ، وهو كلام عربي ; كما يقال : صدتك وصدت لك ، وكسبتك وكسبت لك ، وكذلك شكرتك ونصحتك ونحو ذلك . قول : يخسرون : أي ينقصون ; والعرب تقول : أخسرت الميزان وخسرته . و ( هم ) في موضع نصب على قراءة العامة راجع إلى الناس ، تقديره ( وإذا كالوا ) الناس ( أو وزنوهم يخسرون ) وفيه وجهان : أحدهما أن يراد كالوا لهم أو وزنوا لهم ، فحذف الجار ، وأوصل الفعل ، كما قال :\nولقد جنيتك أكمؤا وعساقلا ولقد نهيتك عن بنات الأوبر\nأراد : جنيت لك ، والوجه الآخر : أن يكون على حذف المضاف ، وإقامة المضاف إليه مقامه ، والمضاف هو المكيل والموزون .\nوعن ابن عباس - رضي الله عنه - : إنكم معاشر الأعاجم وليتم أمرين بهما هلك من كان قبلكم : المكيال والميزان . وخص الأعاجم ، لأنهم كانوا يجمعون الكيل والوزن جميعا ، وكانا مفرقين في الحرمين ; كان أهل مكة يزنون ، وأهل المدينة يكيلون . وعلى القراءة الثانية ( هم ) في موضع رفع بالابتداء ; أي وإذا كالوا للناس أو وزنوا لهم فهم يخسرون . ولا يصح ; لأنه تكون الأولى ملغاة ، ليس لها خبر ، وإنما كانت تستقيم لو كان بعدها : وإذا كالوا هم ينقصون ، أو وزنوا هم يخسرون .\nالثانية : قال ابن عباس قال النبي - صلى الله عليه وسلم - : خمس بخمس : ما نقض قوم العهد إلا سلط الله عليهم عدوهم ، ولا حكموا بغير ما أنزل الله إلا فشا فيهم الفقر ، وما ظهرت الفاحشة فيهم إلا ظهر فيهم الطاعون ، وما طففوا الكيل إلا منعوا النبات ، وأخذوا بالسنين ، ولا منعوا الزكاة إلا حبس الله عنهم المطر خرجه أبو بكر البزار بمعناه ، ومالك بن أنس أيضا من حديث ابن عمر . وقد ذكرناه في كتاب التذكرة . وقال مالك بن دينار : دخلت على جار لي قد نزل به الموت ، فجعل يقول : جبلين من نار ، جبلين من نار فقلت : ما تقول ؟ أتهجر ؟ قال : يا أبا يحيى ، كان لي مكيالان ، أكيل بأحدهما ، وأكتال بالآخر فقمت فجعلت أضرب أحدهما بالآخر حتى كسرتهما فقال يا أبا يحيى كلما ضربت أحدهما بالآخر ازداد عظما ، فمات من وجعه .\nوقال عكرمة : أشهد على كل كيال أو وزان أنه في النار . قيل له : فإن ابنك كيال أو وزان . فقال : أشهد أنه في النار . قال الأصمعي : وسمعت أعرابية تقول : لا تلتمس المروءة ممن مروءته في رؤوس المكاييل ، ولا ألسنة الموازين . وروي ذلك عن علي - رضي الله عنه - ، وقال عبد خير : مر علي - رضي الله عنه - على رجل وهو يزن الزعفران وقد أرجح ، فأكفأ الميزان ، ثم قال : أقم الوزن بالقسط ; ثم أرجح بعد ذلك ما شئت . كأنه أمره بالتسوية أولا ليعتادها ، ويفضل الواجب من النفل .\nوقال نافع : كان ابن عمر يمر بالبائع فيقول : اتق الله وأوف الكيل والوزن بالقسط ، فإن المطففين يوم القيامة يوقفون حتى إن العرق ليلجمهم إلى أنصاف آذانهم . وقد روي أن أبا هريرة قدم المدينة وقد خرج النبي - صلى الله عليه وسلم - إلى خيبر واستخلف على المدينة سباع بن عرفطة ، فقال أبو هريرة : فوجدناه في صلاة الصبح فقرأ في الركعة الأولى ( كهيعص ) وقرأ في الركعة الثانية ويل للمطففين قال أبو هريرة : فأقول في صلاتي : ويل لأبي فلان ، كان له مكيالان إذا اكتال اكتال بالوافي ، وإذا كال كال بالناقص .\n                                    ",
      "saadi": "وَإِذَا كَالُوهُمۡ أَو وَّزَنُوهُمۡ يُخۡسِرُونَ ٣\n                                        \n                                        \n                                        \n                                        { وَإِذَا كَالُوهُمْ أَوْ وَزَنُوهُمْ } أي: إذا أعطوا الناس حقهم، الذي للناس عليهم بكيل أو وزن، { يُخْسِرُونَ } أي: ينقصونهم ذلك، إما بمكيال وميزان ناقصين، أو بعدم ملء المكيال والميزان، أو نحو ذلك. فهذا سرقة [لأموال] الناس ، وعدم إنصاف [لهم] منهم.\nوإذا كان هذا الوعيد على الذين يبخسون الناس بالمكيال والميزان، فالذي يأخذ أموالهم قهرًا أو سرقة، أولى بهذا الوعيد من المطففين.\nودلت الآية الكريمة، على أن الإنسان كما يأخذ من الناس الذي له، يجب عليه أن يعطيهم كل ما لهم من الأموال والمعاملات، بل يدخل في [عموم هذا] الحجج والمقالات، فإنه كما أن المتناظرين قد جرت العادة أن كل واحد [منهما] يحرص على ماله من الحجج، فيجب عليه أيضًا أن يبين ما لخصمه من الحجج [التي لا يعلمها]، وأن ينظر في أدلة خصمه كما ينظر في أدلته هو، وفي هذا الموضع يعرف إنصاف الإنسان من تعصبه واعتسافه، وتواضعه من كبره، وعقله من سفهه، نسأل الله التوفيق لكل خير.\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "أَلَا يَظُنُّ أُوْلَٰٓئِكَ أَنَّهُم مَّبۡعُوثُونَ ٤",
    "tafsier": {
      "ibnkther": "أَلَا يَظُنُّ أُوْلَٰٓئِكَ أَنَّهُم مَّبۡعُوثُونَ ٤\n                                    \n                                    \n                                    أي أما يخاف أولئك من البعث والقيام بين يدي من يعلم السرائر والضمائر.\n                                    ",
      "qortoby": "أَلَا يَظُنُّ أُوْلَٰٓئِكَ أَنَّهُم مَّبۡعُوثُونَ ٤\n                                    \n                                    \n                                    قوله تعالى : ألا يظن أولئك إنكار وتعجب عظيم من حالهم ، في الاجتراء على التطفيف ، كأنهم لا يخطرون التطفيف ببالهم ، ولا يخمنون تخمينا أنهم مبعوثون فمسئولون عما يفعلون . والظن هنا بمعنى اليقين ; أي ألا يوقن أولئك ، ولو أيقنوا ما نقصوا في الكيل والوزن . وقيل : الظن بمعنى التردد ، أي إن كانوا لا يستيقنون بالبعث ، فهلا ظنوه ، حتى يتدبروا ويبحثوا عنه ، ويأخذوا بالأحوط\n                                    ",
      "saadi": "أَلَا يَظُنُّ أُوْلَٰٓئِكَ أَنَّهُم مَّبۡعُوثُونَ ٤\n                                        \n                                        \n                                        \n                                        ثم توعد تعالى المطففين، وتعجب من حالهم وإقامتهم على ما هم عليه، فقال: { أَلَا يَظُنُّ أُولَئِكَ أَنَّهُمْ مَبْعُوثُونَ لِيَوْمٍ عَظِيمٍ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ } فالذي جرأهم على التطفيف عدم إيمانهم باليوم الآخر، وإلا فلو آمنوا به، وعرفوا أنهم يقومون بين يدى الله، يحاسبهم على القليل والكثير، لأقلعوا عن ذلك وتابوا منه.\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "لِيَوۡمٍ عَظِيمٖ ٥",
    "tafsier": {
      "ibnkther": "لِيَوۡمٍ عَظِيمٖ ٥\n                                    \n                                    \n                                    في يوم عظيم الهول كثير الفزع جليل الخطب من خسر فيه أدخل نارا حامية\n                                    ",
      "qortoby": "لِيَوۡمٍ عَظِيمٖ ٥\n                                    \n                                    \n                                    شأنه وهو يوم القيامة .\n                                    ",
      "saadi": "لِيَوۡمٍ عَظِيمٖ ٥\n                                        \n                                        \n                                        \n                                        ثم توعد تعالى المطففين، وتعجب من حالهم وإقامتهم على ما هم عليه، فقال: { أَلَا يَظُنُّ أُولَئِكَ أَنَّهُمْ مَبْعُوثُونَ لِيَوْمٍ عَظِيمٍ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ } فالذي جرأهم على التطفيف عدم إيمانهم باليوم الآخر، وإلا فلو آمنوا به، وعرفوا أنهم يقومون بين يدى الله، يحاسبهم على القليل والكثير، لأقلعوا عن ذلك وتابوا منه.\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "يَوۡمَ يَقُومُ ٱلنَّاسُ لِرَبِّ ٱلۡعَٰلَمِينَ ٦",
    "tafsier": {
      "ibnkther": "يَوۡمَ يَقُومُ ٱلنَّاسُ لِرَبِّ ٱلۡعَٰلَمِينَ ٦\n                                    \n                                    \n                                    وقوله ( يوم يقوم الناس لرب العالمين ) أي يقومون حفاة عراة غرلا في موقف صعب حرج ضيق ضنك على المجرم ويغشاهم من أمر الله ما تعجز القوى والحواس عنه\nقال الإمام مالك عن نافع عن ابن عمر أن النبي صلى الله عليه وسلم قال : \" ( يوم يقوم الناس لرب العالمين ) حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه\nرواه البخاري من حديث مالك وعبد الله بن عون كلاهما عن نافع به . ورواه مسلم من الطريقين أيضا وكذلك رواه صالح وثابت بن كيسان وأيوب بن يحيى وعبد الله وعبيد الله ابنا عمر ومحمد بن إسحاق عن نافع عن ابن عمر به .\nولفظ الإمام أحمد حدثنا يزيد أخبرنا ابن إسحاق عن نافع عن ابن عمر سمعت رسول الله صلى الله عليه وسلم يقول : ) يوم يقوم الناس لرب العالمين ) لعظمة الرحمن عز وجل يوم القيامة حتى إن العرق ليلجم الرجال إلى أنصاف آذانهم \"\nحديث آخر قال الإمام أحمد حدثنا إبراهيم بن إسحاق حدثنا ابن المبارك عن عبد الرحمن بن يزيد بن جابر حدثني سليم بن عامر حدثني المقداد يعني ابن الأسود الكندي قال سمعت رسول الله صلى الله عليه وسلم - يقول إذا كان يوم القيامة أدنيت الشمس من العباد حتى تكون قيد ميل أو ميلين قال فتصهرهم الشمس فيكونون في العرق كقدر أعمالهم منهم من يأخذه إلى عقبيه ومنهم من يأخذه إلى ركبتيه ومنهم من يأخذه إلى حقويه ومنهم من يلجمه إلجاما\nرواه مسلم عن الحكم بن موسى عن يحيى بن حمزة والترمذي عن سويد عن ابن المبارك كلاهما عن ابن جابر به .\nحديث آخر قال الإمام أحمد حدثنا الحسن بن سوار حدثنا الليث بن سعد عن معاوية بن صالح أن أبا عبد الرحمن حدثه ، عن أبي أمامة أن رسول الله صلى الله عليه وسلم - قال تدنو الشمس يوم القيامة على قدر ميل ويزاد في حرها كذا وكذا تغلي منها الهوام كما تغلي القدور يعرقون فيها على قدر خطاياهم منهم من يبلغ إلى كعبيه ومنهم من يبلغ إلى ساقيه ومنهم من يبلغ إلى وسطه ومنهم من يلجمه العرق انفرد به أحمد .\nحديث آخر قال الإمام أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا أبو عشانة حي بن يؤمن أنه سمع عقبة بن عامر يقول سمعت رسول صلى الله عليه وسلم - يقول تدنو الشمس من الأرض فيعرق الناس فمن الناس من يبلغ عرقه عقبيه ومنهم من يبلغ إلى نصف الساق ومنهم من يبلغ إلى ركبتيه ومنهم من يبلغ العجز ومنهم من يبلغ الخاصرة ومنهم من يبلغ منكبيه ومنهم من يبلغ وسط فيه وأشار بيده فألجمها فاه رأيت رسول الله صلى الله عليه وسلم يشير هكذا ومنهم من يغطيه عرقه وضرب بيده إشارة انفرد به أحمد .\nوفي حديث أنهم يقومون سبعين سنة لا يتكلمون وقيل يقومون ثلاثمائة سنة وقيل يقومون أربعين ألف سنة ويقضى بينهم في مقدار عشرة آلاف سنة كما في صحيح مسلم عن أبي هريرة مرفوعا : في يوم كان مقداره خمسين ألف سنة \"\nوقد قال ابن أبي حاتم حدثنا أبي ، حدثنا أبو عون الزيادي أخبرنا عبد السلام بن عجلان سمعت أبا يزيد المدني عن أبي هريرة قال قال النبي صلى الله عليه وسلم لبشير الغفاري كيف أنت صانع في يوم يقوم الناس فيه ثلاثمائة سنة لرب العالمين من أيام الدنيا لا يأتيهم فيه خبر من السماء ولا يؤمر فيه بأمر قال بشير المستعان الله . قال فإذا أويت إلى فراشك فتعوذ بالله من كرب يوم القيامة وسوء الحساب\nورواه ابن جرير من طريق عبد السلام به .\nوفي سنن أبي داود أن رسول الله صلى الله عليه وسلم كان يتعوذ بالله من ضيق المقام يوم القيامة .\nوعن ابن مسعود يقومون أربعين سنة رافعي رءوسهم إلى السماء لا يكلمهم أحد قد ألجم العرق برهم وفاجرهم\nوعن ابن عمر يقومون مائة سنة رواهما ابن جرير .\nوفي سنن أبي داود والنسائي وابن ماجه من حديث زيد بن الحباب عن معاوية بن\nصالح عن أزهر بن سعيد الحواري عن عاصم بن حميد عن عائشة أن رسول الله صلى الله عليه وسلم كان يفتتح قيام الليل يكبر عشرا ويحمد عشرا ويسبح عشرا ويستغفر عشرا ، ويقول اللهم اغفر لي واهدني وارزقني وعافني ويتعوذ من ضيق المقام يوم القيامة .\n                                    ",
      "qortoby": "يَوۡمَ يَقُومُ ٱلنَّاسُ لِرَبِّ ٱلۡعَٰلَمِينَ ٦\n                                    \n                                    \n                                    قوله تعالى : يوم يقوم الناس لرب العالمين فيه أربع مسائل :\nالأولى : العامل في ( يوم ) فعل مضمر ، دل عليه مبعوثون والمعنى يبعثون يوم يقوم الناس لرب العالمين . ويجوز أن يكون بدلا من يوم في ليوم عظيم ، وهو مبني . وقيل : هو في موضع خفض ; لأنه أضيف إلى غير متمكن . وقيل : هو منصوب على الظرف أي في يوم ، ويقال : أقم إلى يوم يخرج فلان ، فتنصب يوم ، فإن أضافوا إلى الاسم فحينئذ يخفضون ويقولون : أقم إلى يوم خروج فلان . وقيل : في الكلام تقديم وتأخير ، التقدير إنهم مبعوثون يوم يقوم الناس لرب العالمين ليوم عظيم .\nالثانية : وعن عبد الملك بن مروان : أن أعرابيا قال له : قد سمعت ما قال الله تعالى في المطففين ; أراد بذلك أن المطففين قد توجه عليهم هذا الوعيد العظيم الذي سمعت به ، فما ظنك بنفسك وأنت تأخذ أموال المسلمين بلا كيل ولا وزن . وفي هذا الإنكار والتعجيب وكلمة الظن ، ووصف اليوم بالعظيم ، وقيام الناس فيه لله خاضعين ، ووصف ذاته برب العالمين بيان بليغ لعظم الذنب ، وتفاقم الإثم في التطفيف ، وفيما كان في مثل حاله من الحيف ، وترك القيام بالقسط ، والعمل على التسوية والعدل في كل أخذ وإعطاء ، بل في كل قول وعمل .\nالثالثة : قرأ ابن عمر : ويل للمطففين حتى بلغ يوم يقوم الناس لرب العالمين فبكى حتى سقط ، وامتنع من قراءة ما بعده ، ثم قال : سمعت النبي - صلى الله عليه وسلم - يقول : \" يوم يقوم الناس لرب العالمين ، في يوم كان مقداره خمسين ألف سنة ، فمنهم من يبلغ العرق كعبيه ، ومنهم من يبلغ ركبتيه ، ومنهم من يبلغ حقويه ، ومنهم من يبلغ صدره ، ومنهم من يبلغ أذنيه ، حتى إن أحدهم ليغيب في رشحه كما يغيب الضفدع \" . وروى ناس عن ابن عباس قال : يقومون مقدار ثلاثمائة سنة . قال : ويهون على المؤمنين قدر صلاتهم الفريضة . وروي عن عبد الله بن عمر عن النبي - صلى الله عليه وسلم - قال : \" يقومون ألف عام في الظلة \" . وروى مالك عن نافع عن ابن عمر عن النبي - صلى الله عليه وسلم - قال : \" يوم يقوم الناس لرب العالمين حتى إن أحدهم ليقوم في رشحه إلى أنصاف أذنيه \" . وعنه أيضا عن النبي - صلى الله عليه وسلم - : \" يقوم مائة سنة \" . وقال أبو هريرة قال النبي - صلى الله عليه وسلم - لبشير الغفاري : \" كيف أنت صانع في يوم يقوم الناس فيه مقدار ثلاثمائة سنة لرب العالمين ، لا يأتيهم فيه خبر ، ولا يؤمر فيه بأمر \" قال بشير : المستعان الله .\nقلت : قد ذكرناه مرفوعا من حديث أبي سعيد الخدري عن النبي - صلى الله عليه وسلم - : \" إنه ليخفف عن المؤمن ، حتى يكون أخف عليه من صلاة المكتوبة يصليها في الدنيا \" في ( سأل سائل ) . وعن ابن عباس : يهون على المؤمنين قدر صلاتهم الفريضة . وقيل : إن ذلك المقام على المؤمن كزوال الشمس ; والدليل على هذا من الكتاب قوله الحق : ألا إن أولياء الله لا خوف عليهم ولا هم يحزنون ثم وصفهم فقال : الذين آمنوا وكانوا يتقون جعلنا الله منهم بفضله وكرمه وجوده . ومنه آمين . وقيل : المراد بالناس جبريل - عليه السلام - يقوم لرب العالمين ; قاله ابن جبير وفيه بعد ; لما ذكرنا من الأخبار في ذلك ، وهي صحيحة ثابتة ، وحسبك بما في صحيح مسلم ، والبخاري والترمذي من حديث ابن عمر عن النبي - صلى الله عليه وسلم - يوم يقوم الناس لرب العالمين قال : \" يقوم أحدهم في رشحه إلى نصف أذنيه \" . ثم قيل : هذا القيام يوم يقومون من قبورهم . وقيل : في الآخرة بحقوق عباده في الدنيا . وقال يزيد الرشك : يقومون بين يديه للقضاء .\nالرابعة : القيام لله رب العالمين سبحانه حقير بالإضافة إلى عظمته وحقه ، فأما قيام الناس بعضهم لبعض فاختلف فيه الناس ; فمنهم من أجازه ، ومنهم من منعه . وقد روي أن النبي - صلى الله عليه وسلم - قام إلى جعفر بن أبي طالب واعتنقه ، وقام طلحة لكعب بن مالك يوم تيب عليه . وقول النبي - صلى الله عليه وسلم - للأنصار حين طلع عليه سعد بن معاذ : \" قوموا إلى سيدكم \" . وقال أيضا : \" من سره أن يتمثل له الناس قياما فليتبوأ مقعده من النار \" . وذلك يرجع إلى حال الرجل ونيته ، فإن انتظر ذلك واعتقده لنفسه ، فهو ممنوع ، وإن كان على طريق البشاشة والوصلة فإنه جائز ، وخاصة عند الأسباب ، كالقدوم من السفر ونحوه . وقد مضى في آخر سورة ( يوسف ) شيء من هذا .\n                                    ",
      "saadi": "يَوۡمَ يَقُومُ ٱلنَّاسُ لِرَبِّ ٱلۡعَٰلَمِينَ ٦\n                                        \n                                        \n                                        \n                                        ثم توعد تعالى المطففين، وتعجب من حالهم وإقامتهم على ما هم عليه، فقال: { أَلَا يَظُنُّ أُولَئِكَ أَنَّهُمْ مَبْعُوثُونَ لِيَوْمٍ عَظِيمٍ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ } فالذي جرأهم على التطفيف عدم إيمانهم باليوم الآخر، وإلا فلو آمنوا به، وعرفوا أنهم يقومون بين يدى الله، يحاسبهم على القليل والكثير، لأقلعوا عن ذلك وتابوا منه.\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "كَلَّآ إِنَّ كِتَٰبَ ٱلۡفُجَّارِ لَفِي سِجِّينٖ ٧",
    "tafsier": {
      "ibnkther": "كَلَّآ إِنَّ كِتَٰبَ ٱلۡفُجَّارِ لَفِي سِجِّينٖ ٧\n                                    \n                                    \n                                    يقول تعالى حقا\" إن كتاب الفجار لفي سجين\"أي أن مصيرهم ومأواهم لفي سجين فعيل من السجن وهو الضيق كما يقال فسيق وشريب وخمير وسكير ونحو ذلك.\n                                    ",
      "qortoby": "كَلَّآ إِنَّ كِتَٰبَ ٱلۡفُجَّارِ لَفِي سِجِّينٖ ٧\n                                    \n                                    \n                                    قوله تعالى : كلا إن كتاب الفجار لفي سجين قال قوم من أهل العلم بالعربية : ( كلا ) ردع وتنبيه ، أي ليس الأمر على ما هم عليه من تطفيف الكيل والميزان ، أو تكذيب بالآخرة ، فليرتدعوا عن ذلك . فهي كلمة ردع وزجر ، ثم استأنف فقال : إن كتاب الفجار . وقال الحسن : كلا بمعنى حقا . وروى ناس عن ابن عباس كلا قال : ألا تصدقون ; فعلى هذا : الوقف \" لرب العالمين . وفي تفسير مقاتل : إن أعمال الفجار . وروى ناس عن ابن عباس قال : إن أرواح الفجار وأعمالهم لفي سجين . وروى ابن أبي نجيح عن مجاهد قال : سجين صخرة تحت الأرض السابعة ، تقلب فيجعل كتاب الفجار تحتها . ونحوه عن ابن عباس وقتادة وسعيد بن جبير ومقاتل وكعب ; قال كعب : تحتها أرواح الكفار تحت خد إبليس . وعن كعب أيضا قال : سجين صخرة سوداء تحت الأرض السابعة ، مكتوب فيها اسم كل شيطان ، تلقى أنفس الكفار عندها .\nوقال سعيد بن جبير : سجين تحت خد إبليس . يحيى بن سلام : حجر أسود تحت الأرض ، يكتب فيه أرواح الكفار . وقال عطاء الخراساني : هي الأرض السابعة السفلى ، وفيها إبليس وذريته . وعن ابن عباس قال : إن الكافر يحضره الموت ، وتحضره رسل الله ، فلا يستطيعون لبغض الله له وبغضهم إياه ، أن يؤخروه ولا يعجلوه حتى تجيء ساعته ، فإذا جاءت ساعته قبضوا نفسه ، ورفعوه إلى ملائكة العذاب ، فأروه ما شاء الله أن يروه من الشر ، ثم هبطوا به إلى الأرض السابعة ، وهي سجين ، وهي آخر سلطان إبليس ، فأثبتوا فيها كتابه . وعن كعب الأحبار في هذه الآية قال : إن روح الفاجر إذا قبضت يصعد بها إلى السماء ، فتأبى السماء أن تقبلها ، ثم يهبط بها إلى الأرض ، فتأبى الأرض أن تقبلها ، فتدخل في سبع أرضين ، حتى ينتهى بها إلى سجين ، وهو خد إبليس . فيخرج لها من سجين من تحت خد إبليس رق ، فيرقم فيوضع تحت خد إبليس . وقال الحسن : سجين في الأرض السابعة . وقيل : هو ضرب مثل وإشارة إلى أن الله تعالى يرد أعمالهم التي ظنوا أنها تنفعهم .\nقال مجاهد : المعنى عملهم تحت الأرض السابعة لا يصعد منها شيء . وقال : سجين صخرة في الأرض السابعة . وروى أبو هريرة عن النبي - صلى الله عليه وسلم - قال : \" سجين جب في جهنم وهو مفتوح \" وقال في الفلق : \" إنه جب مغطى \" . وقال أنس : هي دركة في الأرض السفلى . وقال أنس قال النبي - صلى الله عليه وسلم - : \" سجين أسفل الأرض السابعة \" . وقال عكرمة : \" سجين : خسار وضلال \" ; كقولهم لمن سقط قدره : قد زلق بالحضيض . وقال أبو عبيدة والأخفش والزجاج : لفي سجين لفي حبس وضيق شديد ، فعيل من السجن ; كما يقول : فسيق وشريب ; قال ابن مقبل :\nورفقة يضربون البيض ضاحية ضربا تواصت به الأبطال سجينا\nوالمعنى : كتابهم في حبس ; جعل ذلك دليلا على خساسة منزلتهم ، أو لأنه يحل من الإعراض عنه والإبعاد له محل الزجر والهوان . وقيل : أصله سجيل ، فأبدلت اللام نونا . وقد تقدم ذلك . وقال زيد بن أسلم : سجين في الأرض السافلة ، وسجيل في السماء الدنيا . القشيري : سجين : موضع في السافلين ، يدفن فيه كتاب هؤلاء ، فلا يظهر بل يكون في ذلك الموضع كالمسجون . وهذا دليل على خبث أعمالهم ، وتحقير الله إياها ; ولهذا قال في كتاب الأبرار : يشهده المقربون .\n                                    ",
      "saadi": "كَلَّآ إِنَّ كِتَٰبَ ٱلۡفُجَّارِ لَفِي سِجِّينٖ ٧\n                                        \n                                        \n                                        \n                                        يقول تعالى: { كَلَّا إِنَّ كِتَابَ الْفُجَّارِ } [وهذا شامل لكل فاجر] من أنواع الكفرة والمنافقين، والفاسقين { لَفِي سِجِّينٍ }\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَمَآ أَدۡرَىٰكَ مَا سِجِّينٞ ٨",
    "tafsier": {
      "ibnkther": "وَمَآ أَدۡرَىٰكَ مَا سِجِّينٞ ٨\n                                    \n                                    \n                                    ولهذا عظم أمره فقال ( وما أدراك ما سجين ) ؟ أي هو أمر عظيم وسجن مقيم وعذاب أليم\nثم قد قال قائلون هي تحت الأرض السابعة وقد تقدم في حديث البراء بن عازب في حديثه الطويل يقول الله عز وجل في روح الكافر اكتبوا كتابه في سجين\nوسجين هي تحت الأرض السابعة وقيل صخرة تحت السابعة خضراء وقيل بئر في جهنم\nوقد روى ابن جرير في ذلك حديثا غريبا منكرا لا يصح فقال حدثنا إسحاق بن وهب الواسطي حدثنا مسعود بن موسى بن مشكان الواسطي حدثنا نصر بن خزيمة الواسطي عن شعيب بن صفوان عن محمد بن كعب القرظي عن أبي هريرة عن النبي صلى الله عليه وسلم قال : الفلق جب في جهنم مغطى وأما سجين فمفتوح \"\nوالصحيح أن سجينا مأخوذ من السجن وهو الضيق فإن المخلوقات كل ما تسافل منها ضاق وكل ما تعالى منها اتسع فإن الأفلاك السبعة كل واحد منها أوسع وأعلى من الذي دونه وكذلك الأرضون كل واحدة أوسع من التي دونها حتى ينتهي السفول المطلق والمحل الأضيق إلى المركز في وسط الأرض السابعة ولما كان مصير الفجار إلى جهنم وهي أسفل السافلين كما قال تعالى ( ثم رددناه أسفل سافلين إلا الذين آمنوا وعملوا الصالحات ) التين 5 ، 6 وقال هاهنا ( كلا إن كتاب الفجار لفي سجين وما أدراك ما سجين ) وهو يجمع الضيق والسفول كما قال ) وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا ) الفرقان : 13\n                                    ",
      "qortoby": "وَمَآ أَدۡرَىٰكَ مَا سِجِّينٞ ٨\n                                    \n                                    \n                                    وما أدراك ما سجين أي ليس ذلك مما كنت تعلمه يا محمد أنت ولا قومك .\nوليس في قوله : وما أدراك ما سجين ما يدل على أن لفظ سجين ليس عربيا ، كما لا يدل في قوله : القارعة ما القارعة وما أدراك ما القارعة بل هو تعظيم لأمر سجين ، وقد مضى في مقدمة الكتاب - والحمد لله - أنه ليس في القرآن غير عربي .\n                                    ",
      "saadi": "وَمَآ أَدۡرَىٰكَ مَا سِجِّينٞ ٨\n                                        \n                                        \n                                        \n                                        { وَمَا أَدْرَاكَ مَا سِجِّينٌ كِتَابٌ مَرْقُومٌ } أي: كتاب مذكور فيه أعمالهم الخبيثة، والسجين: المحل الضيق الضنك، و { سجين } ضد { عليين } الذي هو محل كتاب الأبرار، كما سيأتي.\nوقد قيل: إن { سجين } هو أسفل الأرض السابعة، مأوى الفجار ومستقرهم في معادهم.\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "كِتَٰبٞ مَّرۡقُومٞ ٩",
    "tafsier": {
      "ibnkther": "كِتَٰبٞ مَّرۡقُومٞ ٩\n                                    \n                                    \n                                    وقوله ( كتاب مرقوم ) ليس تفسيرا لقوله ( وما أدراك ما سجين ) وإنما هو تفسير لما كتب لهم من المصير إلى سجين أي مرقوم مكتوب مفروغ منه لا يزاد فيه أحد ولا ينقص منه أحد قاله محمد بن كعب القرظي\n                                    ",
      "qortoby": "كِتَٰبٞ مَّرۡقُومٞ ٩\n                                    \n                                    \n                                    كتاب مرقوم أي مكتوب كالرقم في الثوب ، لا ينسى ولا يمحى . وقال قتادة : مرقوم أي مكتوب ، رقم لهم بشر : لا يزاد فيهم أحد ولا ينقص منهم أحد . وقال الضحاك : مرقوم : مختوم ، بلغة حمير ; وأصل الرقم الكتابة ; قال :\nسأرقم في الماء القراح إليكم على بعدكم إن كان للماء راقم\n                                    ",
      "saadi": "كِتَٰبٞ مَّرۡقُومٞ ٩\n                                        \n                                        \n                                        \n                                        { وَمَا أَدْرَاكَ مَا سِجِّينٌ كِتَابٌ مَرْقُومٌ } أي: كتاب مذكور فيه أعمالهم الخبيثة، والسجين: المحل الضيق الضنك، و { سجين } ضد { عليين } الذي هو محل كتاب الأبرار، كما سيأتي.\nوقد قيل: إن { سجين } هو أسفل الأرض السابعة، مأوى الفجار ومستقرهم في معادهم.\n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَيۡلٞ يَوۡمَئِذٖ لِّلۡمُكَذِّبِينَ ٠١",
    "tafsier": {
      "ibnkther": "وَيۡلٞ يَوۡمَئِذٖ لِّلۡمُكَذِّبِينَ ٠١\n                                    \n                                    \n                                    ثم قال ( ويل يومئذ للمكذبين ) أي إذا صاروا يوم القيامة إلى ما أوعدهم الله من السجن والعذاب المهين وقد تقدم الكلام على قوله : ( ويل ) بما أغنى عن إعادته وأن المراد من ذلك الهلاك والدمار كما يقال ويل لفلان وكما جاء في المسند والسنن من رواية بهز بن حكيم بن معاوية بن حيدة عن أبيه عن جده قال قال رسول الله صلى الله عليه وسلم ويل للذي يحدث فيكذب ليضحك الناس ويل له ويل له \"\n                                    ",
      "qortoby": "وَيۡلٞ يَوۡمَئِذٖ لِّلۡمُكَذِّبِينَ ٠١\n                                    \n                                    \n                                    أي شدة وعذاب يوم القيامة للمكذبين .\nثم بين تعالى أمرهم فقال : \" الذين يكذبون بيوم الدين \"\n                                    ",
      "saadi": "وَيۡلٞ يَوۡمَئِذٖ لِّلۡمُكَذِّبِينَ ٠١\n                                        \n                                        \n                                        \n                                        { وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ }\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "ٱلَّذِينَ يُكَذِّبُونَ بِيَوۡمِ ٱلدِّينِ ١١",
    "tafsier": {
      "ibnkther": "ٱلَّذِينَ يُكَذِّبُونَ بِيَوۡمِ ٱلدِّينِ ١١\n                                    \n                                    \n                                    أي لا يصدقون بوقوعه ولا يعتقدون كونه ويستبعدون أمره.\n                                    ",
      "qortoby": "ٱلَّذِينَ يُكَذِّبُونَ بِيَوۡمِ ٱلدِّينِ ١١\n                                    \n                                    \n                                    أي بيوم الحساب والجزاء والفصل بين العباد .\n                                    ",
      "saadi": "ٱلَّذِينَ يُكَذِّبُونَ بِيَوۡمِ ٱلدِّينِ ١١\n                                        \n                                        \n                                        \n                                        ثم بين المكذبين بأنهم { الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ } أي: يوم الجزاء، يوم يدين الله فيه الناس بأعمالهم.\n                                    "
    }
  },
  {
    "id": 11,
    "versesNumber": 12,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَمَا يُكَذِّبُ بِهِۦٓ إِلَّا كُلُّ مُعۡتَدٍ أَثِيمٍ ٢١",
    "tafsier": {
      "ibnkther": "وَمَا يُكَذِّبُ بِهِۦٓ إِلَّا كُلُّ مُعۡتَدٍ أَثِيمٍ ٢١\n                                    \n                                    \n                                    أي معتد في أفعاله من تعاطي الحرام والمجاوزة في تناول المباح والأثيم في أقواله إن حدث كذب وإن وعد أخلف وإن خاصم فجر.\n                                    ",
      "qortoby": "وَمَا يُكَذِّبُ بِهِۦٓ إِلَّا كُلُّ مُعۡتَدٍ أَثِيمٍ ٢١\n                                    \n                                    \n                                    أي فاجر جائز عن الحق , معتد على الخلق في معاملته إياهم وعلى نفسه , وهو أثيم في ترك أمر الله .\nوقيل هذا في الوليد بن المغيرة وأبي جهل ونظرائهما\n                                    ",
      "saadi": "وَمَا يُكَذِّبُ بِهِۦٓ إِلَّا كُلُّ مُعۡتَدٍ أَثِيمٍ ٢١\n                                        \n                                        \n                                        \n                                        { وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ } على محارم الله، متعد من الحلال إلى الحرام.\n{ أَثِيمٍ } أي كثير الإثم، فهذا الذي يحمله عدوانه على التكذيب، ويحمله [عدوانه على التكذيب ويوجب له] كبره رد الحق\n                                    "
    }
  },
  {
    "id": 12,
    "versesNumber": 13,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "إِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا قَالَ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٣١",
    "tafsier": {
      "ibnkther": "إِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا قَالَ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٣١\n                                    \n                                    \n                                    وقوله ( إذا تتلى عليه آياتنا قال أساطير الأولين ) أي إذا سمع كلام الله من الرسول يكذب به ويظن به ظن السوء فيعتقد أنه مفتعل مجموع من كتب الأوائل كما قال تعالى ( وإذا قيل لهم ماذا أنزل ربكم قالوا أساطير الأولين ) النحل 24 وقال ( وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا ) الفرقان : 5\n                                    ",
      "qortoby": "إِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا قَالَ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٣١\n                                    \n                                    \n                                    وقراءة العامة \" تتلى \" بتاءين , وقراءة أبي حيوة وأبي سماك وأشهب العقيلي والسلمي : \" إذا يتلى \" بالياء .\nوأساطير الأولين : أحاديثهم وأباطيلهم التي كتبوها وزخرفوها .\nواحدها أسطورة وإسطارة , وقد تقدم .\n                                    ",
      "saadi": "إِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا قَالَ أَسَٰطِيرُ ٱلۡأَوَّلِينَ ٣١\n                                        \n                                        \n                                        \n                                        ولهذا { إِذَا تُتْلَى عَلَيْهِ آيَاتُنَا } الدالة على الحق، و[على] صدق ما جاءت به رسله، كذبها وعاندها، و { قَالَ } هذه { أَسَاطِيرُ الْأَوَّلِينَ } أي: من ترهات المتقدمين، وأخبار الأمم الغابرين، ليس من عند الله تكبرا وعنادا.\n                                    "
    }
  },
  {
    "id": 13,
    "versesNumber": 14,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "كَلَّاۖ بَلۡۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُواْ يَكۡسِبُونَ ٤١",
    "tafsier": {
      "ibnkther": "كَلَّاۖ بَلۡۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُواْ يَكۡسِبُونَ ٤١\n                                    \n                                    \n                                    ( كلا بل ران على قلوبهم ما كانوا يكسبون ) أي ليس الأمر كما زعموا ولا كما قالوا إن هذا القرآن أساطير الأولين بل هو كلام الله ووحيه وتنزيله على رسوله صلى الله عليه وسلم وإنما حجب قلوبهم عن الإيمان به ما عليها من الرين الذي قد لبس قلوبهم من كثرة الذنوب والخطايا ولهذا قال تعالى ( كلا بل ران على قلوبهم ما كانوا يكسبون ) والرين يعتري قلوب الكافرين والغيم للأبرار والغين للمقربين\nوقد روى ابن جرير والترمذي والنسائي وابن ماجه من طرق عن محمد بن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم قال إن العبد إذا أذنب ذنبا كانت نكتة سوداء في قلبه فإن تاب منها صقل قلبه وإن زاد زادت فذلك قول الله ( كلا بل ران على قلوبهم ما كانوا يكسبون ) .\nوقال الترمذي حسن صحيح ولفظ النسائي إن العبد إذا أخطأ خطيئة نكت في قلبه نكتة فإن هو نزع واستغفر وتاب صقل قلبه فإن عاد زيد فيها حتى تعلو قلبه فهو الران الذي قال الله ( كلا بل ران على قلوبهم ما كانوا يكسبون )\nوقال أحمد : حدثنا صفوان بن عيسى أخبرنا ابن عجلان عن القعقاع بن حكيم عن أبي صالح عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم إن المؤمن إذا أذنب كانت نكتة سوداء في قلبه فإن تاب ونزع واستغفر صقل قلبه فإن زاد زادت حتى تعلو قلبه وذاك الران الذي ذكر الله في القرآن ( كلا بل ران على قلوبهم ما كانوا يكسبون ) \" .\nوقال الحسن البصري : هو الذنب على الذنب حتى يعمى القلب فيموت وكذا قال مجاهد بن جبر وقتادة وابن زيد وغيرهم .\n                                    ",
      "qortoby": "كَلَّاۖ بَلۡۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُواْ يَكۡسِبُونَ ٤١\n                                    \n                                    \n                                    قوله تعالى : كلا بل ران على قلوبهم ما كانوا يكسبون : كلا : ردع وزجر ، أي ليس هو أساطير الأولين . وقال الحسن : معناها حقا ران على قلوبهم . وقيل : في الترمذي : عن أبي هريرة عن رسول الله - صلى الله عليه وسلم - قال : إن العبد إذا أخطأ خطيئة نكتت في قلبه نكتة سوداء ، فإذا هو نزع واستغفر الله وتاب ، صقل قلبه ، فإن عاد زيد . فيها ، حتى تعلو على قلبه ، وهو الران الذي ذكر الله في كتابه : كلا بل ران على قلوبهم ما كانوا يكسبون . قال : هذا حديث حسن صحيح . وكذا قال المفسرون : هو الذنب على الذنب حتى يسود القلب .\nقال مجاهد : هو الرجل يذنب الذنب ، فيحيط الذنب بقلبه ، ثم يذنب الذنب فيحيط الذنب بقلبه ، حتى تغشي الذنوب قلبه . قال مجاهد : هي مثل الآية التي في سورة البقرة : بلى من كسب سيئة الآية . ونحوه عن الفراء ; قال : يقول كثرت المعاصي منهم والذنوب ، فأحاطت بقلوبهم ، فذلك الرين عليها . وروي عن مجاهد أيضا قال : القلب مثل الكهف ورفع كفه ، فإذا أذنب العبد الذنب انقبض ، وضم إصبعه ، فإذا أذنب الذنب انقبض ، وضم أخرى ، حتى ضم أصابعه كلها ، حتى يطبع على قلبه . قال : وكانوا يرون أن ذلك هو الرين ، ثم قرأ : كلا بل ران على قلوبهم ما كانوا يكسبون . ومثله عن حذيفة - رضي الله عنه - سواء . وقال بكر بن عبد الله : إن العبد إذا أذنب صار في قلبه كوخزة الإبرة ، ثم صار إذا أذنب ثانيا صار كذلك ، ثم إذا كثرت الذنوب صار القلب كالمنخل ، أو كالغربال ، لا يعي خيرا ، ولا يثبت فيه صلاح . وقد بينا في ( البقرة ) القول في هذا المعنى بالأخبار الثابتة عن رسول الله - صلى الله عليه وسلم - ، فلا معنى لإعادتها .\nوقد روى عبد الغني بن سعيد عن موسى بن عبد الرحمن عن ابن جريج عن عطاء عن ابن عباس ، وعن موسى عن مقاتل عن الضحاك عن ابن عباس شيئا الله أعلم بصحته ; قال : هو الران الذي يكون على الفخذين والساق والقدم ، وهو الذي يلبس في الحرب .قال : وقال آخرون : الران : الخاطر الذي يخطر بقلب الرجل . وهذا مما لا يضمن عهدة صحته . فالله أعلم .\nفأما عامة أهل التفسير فعلى ما قد مضى ذكره قبل هذا . وكذلك أهل اللغة عليه ; يقال : ران على قلبه ذنبه يرين رينا وريونا أي غلب . قال أبو عبيدة في قوله : كلا بل ران على قلوبهم ما كانوا يكسبون أي غلب ; وقال أبو عبيد : كل ما غلبك وعلاك فقد ران بك ، ورانك ، وران عليك ; وقال الشاعر :\nوكم ران من ذنب على قلب فاجر فتاب من الذنب الذي ران وانجلى\nورانت الخمر على عقله : أي غلبته ، وران عليه النعاس : إذا غطاه ; ومنه قول عمر في الأسيفع - أسيفع جهينة - : فأصبح قد رين به . أي غلبته الديون ، وكان يدان ; ومنه قول أبي زبيد يصف رجلا شرب حتى غلبه الشراب سكرا ، فقال :\nثم لما رآه رانت به الخم ر وأن لا ترينه باتقاء\nفقوله : رانت به الخمر ، أي غلبت على عقله وقلبه . وقال الأموي : قد أران القوم فهم مرينون : إذا هلكت مواشيهم وهزلت . وهذا من الأمر الذي أتاهم مما يغلبهم ، فلا يستطيعون احتماله . قال أبو زيد يقال : قد رين بالرجل رينا : إذا وقع فيما لا يستطيع الخروج منه ، ولا قبل له وقال أبو معاذ النحوي : الرين : أن يسود القلب من الذنوب ، والطبع أن يطبع على القلب ، وهذا أشد من الرين ، والإقفال أشد من الطبع . الزجاج : الرين : هو كالصدأ يغشي القلب كالغيم الرقيق ، ومثله الغين ، يقال : غين على قلبه : غطي . والغين : شجر ملتف ، الواحدة غيناء ، أي خضراء ، كثيرة الورق ، ملتفة الأغصان . وقد تقدم قول الفراء : إنه إحاطة الذنب بالقلوب . وذكر الثعلبي عن ابن عباس : ران على قلوبهم : أي غطى عليها . وهذا هو الصحيح عنه إن شاء الله . وقرأ حمزة والكسائي والأعمش وأبو بكر والمفضل ( ران ) بالإمالة ; لأن فاء الفعل الراء ، وعينه الألف منقلبة من ياء ، فحسنت الإمالة لذلك . ومن فتح فعلى الأصل ; لأن باب فاء الفعل في ( فعل ) الفتح ، مثل كال وباع ونحوه . واختاره أبو عبيد وأبو حاتم ووقف حفص ( بل ) ثم يبتدئ ( ران ) وقفا يبين اللام ، لا للسكت .\n                                    ",
      "saadi": "كَلَّاۖ بَلۡۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُواْ يَكۡسِبُونَ ٤١\n                                        \n                                        \n                                        \n                                        وأما من أنصف، وكان مقصوده الحق المبين، فإنه لا يكذب بيوم الدين، لأن الله قد أقام عليه من الأدلة القاطعة، والبراهين الساطعة، ما يجعله حق اليقين، وصار لقلوبهم مثل الشمس للأبصار ، بخلاف من ران على قلبه كسبه، وغطته معاصيه\n                                    "
    }
  },
  {
    "id": 14,
    "versesNumber": 15,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "كَلَّآ إِنَّهُمۡ عَن رَّبِّهِمۡ يَوۡمَئِذٖ لَّمَحۡجُوبُونَ ٥١",
    "tafsier": {
      "ibnkther": "كَلَّآ إِنَّهُمۡ عَن رَّبِّهِمۡ يَوۡمَئِذٖ لَّمَحۡجُوبُونَ ٥١\n                                    \n                                    \n                                    وقوله ( كلا إنهم عن ربهم يومئذ لمحجوبون ) أي لهم يوم القيامة منزل ونزل سجين ثم هم يوم القيامة مع ذلك محجوبون عن رؤية ربهم وخالقهم\nقال الإمام أبو عبد الله الشافعي في هذه الآية دليل على أن المؤمنين يرونه عز وجل يومئذ .\nوهذا الذي قاله الإمام الشافعي رحمه الله في غاية الحسن وهو استدلال بمفهوم هذه الآية كما دل عليه منطوق قوله ( وجوه يومئذ ناضرة إلى ربها ناظرة ) القيامة 22 ، 23 وكما دلت على ذلك الأحاديث الصحاح المتواترة في رؤية المؤمنين ربهم عز وجل في الدار الآخرة رؤية بالأبصار في عرصات القيامة وفي روضات الجنان الفاخرة\nوقد قال ابن جرير محمد بن عمار الرازي : حدثنا أبو معمر المنقري حدثنا عبد الوارث بن سعيد عن عمرو بن عبيد عن الحسن في قوله ( كلا إنهم عن ربهم يومئذ لمحجوبون ) قال يكشف الحجاب فينظر إليه المؤمنون والكافرون ثم يحجب عنه الكافرون وينظر إليه المؤمنون كل يوم غدوة وعشية أو كلاما هذا معناه\n                                    ",
      "qortoby": "كَلَّآ إِنَّهُمۡ عَن رَّبِّهِمۡ يَوۡمَئِذٖ لَّمَحۡجُوبُونَ ٥١\n                                    \n                                    \n                                    قوله تعالى : ( كلا ) أي حقا إنهم يعني الكفار عن ربهم يومئذ أي يوم القيامة لمحجوبون . وقيل : كلا ردع وزجر ، أي ليس كما يقولون ، بل إنهم عن ربهم يومئذ لمحجوبون . قال الزجاج : في هذه الآية دليل على أن الله - عز وجل - يرى في القيامة ، ولولا ذلك ما كان في هذه الآية فائدة ، ولا خست منزلة الكفار بأنهم يحجبون . وقال جل ثناؤه : وجوه يومئذ ناضرة إلى ربها ناظرة فأعلم الله - جل ثناؤه - أن المؤمنين ينظرون إليه ، وأعلم أن الكفار محجوبون عنه ، وقال مالك بن أنس في هذه الآية : لما حجب أعداءه فلم يروه تجلى لأوليائه حتى رأوه . وقال الشافعي : لما حجب قوما بالسخط ، دل على أن قوما يرونه بالرضا . ثم قال : أما والله لو لم يوقن محمد بن إدريس أنه يرى ربه في المعاد لما عبده في الدنيا . وقال الحسين بن الفضل : لما حجبهم في الدنيا عن نور توحيده حجبهم في الآخرة عن رؤيته . وقال مجاهد في قوله تعالى : لمحجوبون : أي عن كرامته ورحمته ممنوعون . وقال قتادة : هو أن الله لا ينظر إليهم برحمته ، ولا يزكيهم ولهم عذاب أليم . وعلى الأول الجمهور ، وأنهم محجوبون عن رؤيته فلا يرونه .\n                                    ",
      "saadi": "كَلَّآ إِنَّهُمۡ عَن رَّبِّهِمۡ يَوۡمَئِذٖ لَّمَحۡجُوبُونَ ٥١\n                                        \n                                        \n                                        \n                                        فإنه محجوب عن الحق، ولهذا جوزي على ذلك، بأن حجب عن الله، كما حجب قلبه في الدنيا عن آيات الله\n                                    "
    }
  },
  {
    "id": 15,
    "versesNumber": 16,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "ثُمَّ إِنَّهُمۡ لَصَالُواْ ٱلۡجَحِيمِ ٦١",
    "tafsier": {
      "ibnkther": "ثُمَّ إِنَّهُمۡ لَصَالُواْ ٱلۡجَحِيمِ ٦١\n                                    \n                                    \n                                    قوله ( ثم إنهم لصالو الجحيم ) أي ثم هم مع هذا الحرمان عن رؤية الرحمن من أهل النيران\n                                    ",
      "qortoby": "ثُمَّ إِنَّهُمۡ لَصَالُواْ ٱلۡجَحِيمِ ٦١\n                                    \n                                    \n                                    ثم إنهم لصالو الجحيم أي ملازموها ، ومحترقون فيها غير خارجين منها ، كلما نضجت جلودهم بدلناهم جلودا غيرها و كلما خبت زدناهم سعيرا . ويقال : الجحيم الباب الرابع من النار .\n                                    ",
      "saadi": "ثُمَّ إِنَّهُمۡ لَصَالُواْ ٱلۡجَحِيمِ ٦١\n                                        \n                                        \n                                        \n                                        { ثُمَّ إِنَّهُمْ } مع هذه العقوبة البليغة { لَصَالُوا الْجَحِيمِ }\n                                    "
    }
  },
  {
    "id": 16,
    "versesNumber": 17,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "ثُمَّ يُقَالُ هَٰذَا ٱلَّذِي كُنتُم بِهِۦ تُكَذِّبُونَ ٧١",
    "tafsier": {
      "ibnkther": "ثُمَّ يُقَالُ هَٰذَا ٱلَّذِي كُنتُم بِهِۦ تُكَذِّبُونَ ٧١\n                                    \n                                    \n                                    ( ثم يقال هذا الذي كنتم به تكذبون ) أي يقال لهم ذلك على وجه التقريع والتوبيخ والتصغير والتحقير .\n                                    ",
      "qortoby": "ثُمَّ يُقَالُ هَٰذَا ٱلَّذِي كُنتُم بِهِۦ تُكَذِّبُونَ ٧١\n                                    \n                                    \n                                    ثم يقال لهم أي تقول لهم خزنة جهنم هذا الذي كنتم به تكذبون رسل الله في الدنيا .\n                                    ",
      "saadi": "ثُمَّ يُقَالُ هَٰذَا ٱلَّذِي كُنتُم بِهِۦ تُكَذِّبُونَ ٧١\n                                        \n                                        \n                                        \n                                        ثم يقال لهم توبيخا وتقريعًا: هَذَا الَّذِي كُنْتُمْ بِهِ تُكَذِّبُونَ } فذكر لهم ثلاثة أنواع من العذاب: عذاب الجحيم، وعذاب التوبيخ، واللوم.\nوعذاب الحجاب من رب العالمين، المتضمن لسخطه وغضبه عليهم، وهو أعظم عليهم من عذاب النار، ودل مفهوم الآية، على أن المؤمنين يرون ربهم يوم القيامة وفي الجنة، ويتلذذون بالنظر إليه أعظم من سائر اللذات، ويبتهجون بخطابه، ويفرحون بقربه، كما ذكر الله ذلك في عدة آيات من القرآن، وتواتر فيه النقل عن رسول الله.\nوفي هذه الآيات، التحذير من الذنوب، فإنها ترين على القلب وتغطيه شيئا فشيئا، حتى ينطمس نوره، وتموت بصيرته، فتنقلب عليه الحقائق، فيرى الباطل حقًا، والحق باطلًا، وهذا من بعض عقوبات الذنوب.\n                                    "
    }
  },
  {
    "id": 17,
    "versesNumber": 18,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "كَلَّآ إِنَّ كِتَٰبَ ٱلۡأَبۡرَارِ لَفِي عِلِّيِّينَ ٨١",
    "tafsier": {
      "ibnkther": "كَلَّآ إِنَّ كِتَٰبَ ٱلۡأَبۡرَارِ لَفِي عِلِّيِّينَ ٨١\n                                    \n                                    \n                                    يقول تعالى حقا ( إن كتاب الأبرار ) وهم بخلاف الفجار ( لفي عليين ) أي مصيرهم إلى عليين وهو بخلاف سجين\nقال الأعمش عن شمر بن عطية عن هلال بن يساف قال : سأل ابن عباس كعبا وأنا حاضر عن سجين قال هي الأرض السابعة وفيها أرواح الكفار وسأله عن عليين فقال هي السماء السابعة وفيها أرواح المؤمنين وهكذا قال غير واحد إنها السماء السابعة\nوقال علي بن أبي طلحة عن ابن عباس في قوله ( كلا إن كتاب الأبرار لفي عليين ) يعني الجنة\nوفي رواية العوفي عنه أعمالهم في السماء عند الله وكذا قال الضحاك\nوقال قتادة عليون ساق العرش اليمنى وقال غيره عليون عند سدرة المنتهى\nوالظاهر أن عليين مأخوذ من العلو وكلما علا الشيء وارتفع عظم واتسع\n                                    ",
      "qortoby": "كَلَّآ إِنَّ كِتَٰبَ ٱلۡأَبۡرَارِ لَفِي عِلِّيِّينَ ٨١\n                                    \n                                    \n                                    قوله تعالى : كلا إن كتاب الأبرار لفي عليين كلا بمعنى حقا ، والوقف على تكذبون . وقيل أي ليس الأمر كما يقولون ولا كما ظنوا بل كتابهم في سجين ، وكتاب المؤمنين في عليين . وقال مقاتل : كلا ، أي لا يؤمنون بالعذاب الذي يصلونه . ثم استأنف فقال : إن كتاب الأبرار مرفوع في عليين على قدر مرتبتهم . قال ابن عباس : أي في الجنة . وعنه أيضا قال : أعمالهم في كتاب الله في السماء . وقال الضحاك ومجاهد وقتادة : يعني السماء السابعة فيها أرواح المؤمنين . وروى ابن الأجلح عن الضحاك قال : هي سدرة المنتهى ، ينتهي إليها كل شيء من أمر الله لا يعدوها ، فيقولون : رب عبدك فلان ، وهو أعلم به منهم ، فيأتيه كتاب من الله - عز وجل - مختوم بأمانه من العذاب . فذلك قوله تعالى : كلا إن كتاب الأبرار . وعن كعب الأحبار قال : إن روح المؤمن إذا قبضت صعد بها إلى السماء ، وفتحت لها أبواب السماء ، وتلقتها الملائكة بالبشرى ، ثم يخرجون معها حتى ينتهوا إلى العرش ، فيخرج لهم من تحت العرش رق فيرقم ويختم فيه النجاة من الحساب يوم القيامة ويشهده المقربون . وقال قتادة أيضا : في عليين هي فوق السماء السابعة عند قائمة العرش اليمنى . وقال البراء بن عازب قال النبي - صلى الله عليه وسلم - : \" عليون في السماء السابعة تحت العرش \" .\nوعن ابن عباس أيضا : هو لوح من زبرجدة خضراء معلق بالعرش ، أعمالهم مكتوبة فيه . وقال الفراء : عليون ارتفاع بعد ارتفاع . وقيل : عليون أعلى الأمكنة . وقيل : معناه علو في علو مضاعف ، كأنه لا غاية له ; ولذلك جمع بالواو والنون . وهو معنى قول الطبري . قال الفراء : هو اسم موضوع على صفة الجمع ، ولا واحد له من لفظه ; كقولك : عشرون وثلاثون ، والعرب إذا جمعت جمعا ولم يكن له بناء من واحده ولا تثنية ، قالوا في المذكر والمؤنث بالنون . وهي معنى قول الطبري .\nوقال الزجاج : إعراب هذا الاسم كإعراب الجمع ، كما تقول : هذه قنسرون ، ورأيت قنسرين . وقال يونس النحوي واحدها : علي وعلية . وقال أبو الفتح : عليين : جمع علي ، وهو فعيل من العلو . وكان سبيله أن يقول علية كما قالوا للغرفة علية ; لأنها من العلو ، فلما حذف التاء من علية عوضوا منها الجمع بالواو والنون ، كما قالوا في أرضين . وقيل : إن عليين صفة للملائكة ، فإنهم الملأ الأعلى ; كما يقال : فلان في بني فلان ; أي هو في جملتهم وعندهم . والذي في الخبر من حديث ابن عمر أن رسول الله - صلى الله عليه وسلم - قال : \" إن أهل عليين لينظرون إلى الجنة من كذا ، فإذا أشرف رجل من أهل عليين أشرقت الجنة لضياء وجهه ، فيقولون : ما هذا النور ؟ فيقال أشرف رجل من أهل عليين الأبرار أهل الطاعة والصدق \" . وفي خبر آخر : \" إن أهل الجنة ليرون أهل عليين كما يرى الكوكب الدري في أفق السماء \" يدل على أن عليين اسم الموضع المرتفع . وروى ناس عن ابن عباس في قوله عليين قال : أخبر أن أعمالهم وأرواحهم في السماء الرابعة .\n                                    ",
      "saadi": "كَلَّآ إِنَّ كِتَٰبَ ٱلۡأَبۡرَارِ لَفِي عِلِّيِّينَ ٨١\n                                        \n                                        \n                                        \n                                        لما ذكر أن كتاب الفجار في أسفل الأمكنة وأضيقها، ذكر أن كتاب الأبرار في أعلاها وأوسعها، وأفسحها\n                                    "
    }
  },
  {
    "id": 18,
    "versesNumber": 19,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَمَآ أَدۡرَىٰكَ مَا عِلِّيُّونَ ٩١",
    "tafsier": {
      "ibnkther": "وَمَآ أَدۡرَىٰكَ مَا عِلِّيُّونَ ٩١\n                                    \n                                    \n                                    ولهذا قال معظما أمره ومفخما شأنه ( وما أدراك ما عليون )\n                                    ",
      "qortoby": "وَمَآ أَدۡرَىٰكَ مَا عِلِّيُّونَ ٩١\n                                    \n                                    \n                                    أي ما الذي أعلمك يا محمد أي شيء عليون ؟ على جهة التفخيم والتعظيم له في المنزلة الرفيعة .\nثم فسره له فقال : \" كتاب مرقوم يشهده المقربون \" .\n                                    ",
      "saadi": "وَمَآ أَدۡرَىٰكَ مَا عِلِّيُّونَ ٩١\n                                        \n                                        \n                                        \n                                        وَمَا أَدْرَاكَ مَا عِلِّيُّونَ\n                                    "
    }
  },
  {
    "id": 19,
    "versesNumber": 20,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "كِتَٰبٞ مَّرۡقُومٞ  ٠٢",
    "tafsier": {
      "ibnkther": "كِتَٰبٞ مَّرۡقُومٞ ٠٢\n                                    \n                                    \n                                    ثم قال مؤكدا لما كتب لهم ( كتاب مرقوم )\n                                    ",
      "qortoby": "كِتَٰبٞ مَّرۡقُومٞ ٠٢\n                                    \n                                    \n                                    كتاب مرقوم يشهده المقربون .\nوقيل إن كتاب مرقوم ليس تفسيرا لعليين ، بل تم الكلام عند قوله ( عليون ) ثم ابتدأ وقال : كتاب مرقوم أي كتاب الأبرار كتاب مرقوم ولهذا عكس الرقم في كتاب الفجار ; قاله القشيري . وروي : أن الملائكة تصعد بعمل العبد ، فيستقبلونه فإذا انتهوا به إلى ما شاء الله من سلطانه أوحى إليهم : إنكم الحفظة على عبدي ، وأنا الرقيب على ما في قلبه ، وإنه أخلص لي عمله ، فاجعلوه في عليين ، فقد غفرت له ، وإنها لتصعد بعمل العبد ، فيتركونه فإذا انتهوا به إلى ما شاء الله أوحى إليهم : أنتم الحفظة على عبدي وأنا الرقيب على ما في قلبه ، وإنه لم يخلص لي عمله ، فاجعلوه في سجين .\n                                    ",
      "saadi": "كِتَٰبٞ مَّرۡقُومٞ ٠٢\n                                        \n                                        \n                                        \n                                        كِتَابٌ مَّرْقُومٌ\n                                    "
    }
  },
  {
    "id": 20,
    "versesNumber": 21,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "يَشۡهَدُهُ ٱلۡمُقَرَّبُونَ ١٢",
    "tafsier": {
      "ibnkther": "يَشۡهَدُهُ ٱلۡمُقَرَّبُونَ ١٢\n                                    \n                                    \n                                    ( يشهده المقربون ) وهم الملائكة قاله قتادة\nوقال العوفي عن ابن عباس يشهده من كل سماء مقربوها .\n                                    ",
      "qortoby": "يَشۡهَدُهُ ٱلۡمُقَرَّبُونَ ١٢\n                                    \n                                    \n                                    قوله تعالى : يشهده المقربون أي يشهد عمل الأبرار مقربو كل سماء من الملائكة . وقال وهب وابن إسحاق : المقربون هنا إسرافيل - عليه السلام - ، فإذا عمل المؤمن عمل البر ، صعدت الملائكة بالصحيفة وله نور يتلألأ في السماوات كنور الشمس في الأرض ، حتى ينتهى بها إلى إسرافيل ، فيختم عليها ويكتب فهو قوله : يشهده المقربون أي يشهد كتابتهم .\n                                    ",
      "saadi": "يَشۡهَدُهُ ٱلۡمُقَرَّبُونَ ١٢\n                                        \n                                        \n                                        \n                                        وأن كتابهم المرقوم { يَشْهَدُهُ الْمُقَرَّبُونَ } من الملائكة الكرام، وأرواح الأنبياء، والصديقين والشهداء، وينوه الله بذكرهم في الملأ الأعلى، و { عليون } اسم لأعلى الجنة\n                                    "
    }
  },
  {
    "id": 21,
    "versesNumber": 22,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "إِنَّ ٱلۡأَبۡرَارَ لَفِي نَعِيمٍ ٢٢",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلۡأَبۡرَارَ لَفِي نَعِيمٍ ٢٢\n                                    \n                                    \n                                    أي يوم القيامة هم في نعيم مقيم وجنات فيها فضل عميم.\n                                    ",
      "qortoby": "إِنَّ ٱلۡأَبۡرَارَ لَفِي نَعِيمٍ ٢٢\n                                    \n                                    \n                                    قوله تعالى : إن الأبرار أي أهل الصدق والطاعة . لفي نعيم أي نعمة ، والنعمة بالفتح : التنعيم ; يقال : نعمه الله وناعمه فتنعم وامرأة منعمة ومناعمة بمعنى . أي إن الأبرار في الجنات يتنعمون .\n                                    ",
      "saadi": "إِنَّ ٱلۡأَبۡرَارَ لَفِي نَعِيمٍ ٢٢\n                                        \n                                        \n                                        \n                                        فلما ذكر كتابهم، ذكر أنهم في نعيم، وهو اسم جامع لنعيم القلب والروح والبدن\n                                    "
    }
  },
  {
    "id": 22,
    "versesNumber": 23,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "عَلَى ٱلۡأَرَآئِكِ يَنظُرُونَ ٣٢",
    "tafsier": {
      "ibnkther": "عَلَى ٱلۡأَرَآئِكِ يَنظُرُونَ ٣٢\n                                    \n                                    \n                                    ( على الأرائك ) وهي السرر تحت الحجال ، ( ينظرون ) قيل : معناه ينظرون في ملكهم وما أعطاهم الله من الخير والفضل الذي لا ينقضي ولا يبيد وقيل معناه ( على الأرائك ينظرون ) إلى الله عز وجل وهذا مقابلة لما وصف به أولئك الفجار ( كلا إنهم عن ربهم يومئذ لمحجوبون ) فذكر عن هؤلاء أنهم يباحون النظر إلى الله عز وجل وهم على سررهم وفرشهم كما تقدم في حديث ابن عمر إن أدنى أهل الجنة منزلة لمن ينظر في ملكه مسيرة ألفي سنة يرى أقصاه كما يرى أدناه وإن أعلاه لمن ينظر إلى الله في اليوم مرتين \"\n                                    ",
      "qortoby": "عَلَى ٱلۡأَرَآئِكِ يَنظُرُونَ ٣٢\n                                    \n                                    \n                                    على الأرائك وهي الأسرة في الحجال ينظرون أي إلى ما أعد الله لهم من الكرامات ; قاله عكرمة وابن عباس ومجاهد . وقال مقاتل : ينظرون إلى أهل النار . وعن النبي - صلى الله عليه وسلم - : \" ينظرون إلى أعدائهم في النار \" ذكره المهدوي . وقيل : على أرائك أفضاله ينظرون إلى وجهه وجلاله .\n                                    ",
      "saadi": "عَلَى ٱلۡأَرَآئِكِ يَنظُرُونَ ٣٢\n                                        \n                                        \n                                        \n                                        { عَلَى الْأَرَائِكِ } أي: [على] السرر المزينة بالفرش الحسان.\n{ يُنْظَرُونَ } إلى ما أعد الله لهم من النعيم, وينظرون إلى وجه ربهم الكريم\n                                    "
    }
  },
  {
    "id": 23,
    "versesNumber": 24,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "تَعۡرِفُ فِي وُجُوهِهِمۡ نَضۡرَةَ ٱلنَّعِيمِ ٤٢",
    "tafsier": {
      "ibnkther": "تَعۡرِفُ فِي وُجُوهِهِمۡ نَضۡرَةَ ٱلنَّعِيمِ ٤٢\n                                    \n                                    \n                                    أي تعرف إذا نظرت إليهم في وجوههم نضرة النعيم أي صفة الترافة والحشمة والسرور والدعة والرياسة مما هم فيه من النعيم العظيم.\n                                    ",
      "qortoby": "تَعۡرِفُ فِي وُجُوهِهِمۡ نَضۡرَةَ ٱلنَّعِيمِ ٤٢\n                                    \n                                    \n                                    أي بهجته وغضارته ونوره ; يقال : نضر النبات : إذا أزهر ونور .\nوقراءة العامة \" تعرف \" بفتح التاء وكسر الراء \" نضرة \" نصبا ; أي تعرف يا محمد .\nوقرأ أبو جعفر بن القعقاع ويعقوب وشيبة وابن أبي إسحاق : \" تعرف \" بضم التاء وفتح الراء على الفعل المجهول \" نضرة \" رفعا .\n                                    ",
      "saadi": "تَعۡرِفُ فِي وُجُوهِهِمۡ نَضۡرَةَ ٱلنَّعِيمِ ٤٢\n                                        \n                                        \n                                        \n                                        { تَعْرِفُ } أيها الناظر إليهم { فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ } أي: بهاء النعيم ونضارته ورونقه، فإن توالي اللذة والسرور يكسب الوجه نورًا وحسنًا وبهجة.\n                                    "
    }
  },
  {
    "id": 24,
    "versesNumber": 25,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "يُسۡقَوۡنَ مِن رَّحِيقٖ مَّخۡتُومٍ ٥٢",
    "tafsier": {
      "ibnkther": "يُسۡقَوۡنَ مِن رَّحِيقٖ مَّخۡتُومٍ ٥٢\n                                    \n                                    \n                                    وقوله ( يسقون من رحيق مختوم ) أي يسقون من خمر من الجنة والرحيق من أسماء الخمر قاله ابن مسعود وابن عباس ومجاهد والحسن وقتادة وابن زيد\nقال الإمام أحمد حدثنا حسن حدثنا زهير عن سعد أبي المجاهد الطائي عن عطية بن سعد العوفي عن أبي سعيد الخدري أراه قد رفعه إلى النبي صلى الله عليه وسلم قال أيما مؤمن سقى مؤمنا شربة على ظمأ سقاه الله تعالى يوم القيامة من الرحيق المختوم وأيما مؤمن أطعم مؤمنا على جوع أطعمه الله من ثمار الجنة وأيما مؤمن كسا مؤمنا ثوبا على عري كساه الله من خضر الجنة \"\n                                    ",
      "qortoby": "يُسۡقَوۡنَ مِن رَّحِيقٖ مَّخۡتُومٍ ٥٢\n                                    \n                                    \n                                    يسقون من رحيق أي من شراب لا غش فيه . قاله الأخفش والزجاج . وقيل ، الرحيق الخمر الصافية . وفي الصحاح : الرحيق صفوة الخمر . والمعنى واحد . الخليل : أقصى الخمر وأجودها . وقال مقاتل وغيره : هي الخمر العتيقة البيضاء الصافية من الغش النيرة ، قال حسان :\nيسقون من ورد البريص عليهم بردى يصفق بالرحيق السلسل\nوقال آخر :\nأم لا سبيل إلى الشباب وذكره أشهى إلي من الرحيق السلسل\nمختوم\n                                    ",
      "saadi": "يُسۡقَوۡنَ مِن رَّحِيقٖ مَّخۡتُومٍ ٥٢\n                                        \n                                        \n                                        \n                                        { يُسْقَوْنَ مِنْ رَحِيقٍ } وهو من أطيب ما يكون من الأشربة وألذها، { مَخْتُومٍ }\n                                    "
    }
  },
  {
    "id": 25,
    "versesNumber": 26,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "خِتَٰمُهُۥ مِسۡكٞۚ وَفِي ذَٰلِكَ فَلۡيَتَنَافَسِ ٱلۡمُتَنَٰفِسُونَ ٦٢",
    "tafsier": {
      "ibnkther": "خِتَٰمُهُۥ مِسۡكٞۚ وَفِي ذَٰلِكَ فَلۡيَتَنَافَسِ ٱلۡمُتَنَٰفِسُونَ ٦٢\n                                    \n                                    \n                                    وقال ابن مسعود في قوله ( ختامه مسك ) أي خلطه مسك\nوقال العوفي عن ابن عباس طيب الله لهم الخمر فكان آخر شيء جعل فيها مسك ختم بمسك وكذا قال قتادة والضحاك\nوقال إبراهيم والحسن ( ختامه مسك ) أي عاقبته مسك\nوقال ابن جرير حدثنا ابن حميد حدثنا يحيى بن واضح حدثنا أبو حمزة عن جابر عن عبد الرحمن بن سابط عن أبي الدرداء ( ختامه مسك ) قال شراب أبيض مثل الفضة يختمون به شرابهم ولو أن رجلا من أهل الدنيا أدخل أصبعه فيه ثم أخرجها لم يبق ذو روح إلا وجد طيبها .\nوقال ابن أبي نجيح عن مجاهد ( ختامه مسك ) قال طيبه مسك\nوقوله ( وفي ذلك فليتنافس المتنافسون ) أي وفي مثل هذا الحال فليتفاخر المتفاخرون ، وليتباه ويكاثر ويستبق إلى مثله المستبقون كقوله ( لمثل هذا فليعمل العاملون ) الصافات : 61\n                                    ",
      "qortoby": "خِتَٰمُهُۥ مِسۡكٞۚ وَفِي ذَٰلِكَ فَلۡيَتَنَافَسِ ٱلۡمُتَنَٰفِسُونَ ٦٢\n                                    \n                                    \n                                    ختامه مسك قال مجاهد : يختم به آخر جرعة . وقيل : المعنى إذا شربوا هذا الرحيق ففني ما في الكأس ، انختم ذلك بخاتم المسك . وكان ابن مسعود يقول : يجدون عاقبتها طعم المسك . ونحوه عن سعيد بن جبير وإبراهيم النخعي قالا : ختامه آخر طعمه . وهو حسن ; لأن سبيل الأشربة أن يكون الكدر في آخرها ، فوصف شراب أهل الجنة بأن رائحة آخره رائحة المسك . وعن مسروق عن عبد الله قال : المختوم الممزوج . وقيل : مختوم أي ختمت ومنعت عن أن يمسها ماس إلى أن يفك ختامها الأبرار . وقرأ علي وعلقمة وشقيق والضحاك وطاوس والكسائي ( خاتمه ) بفتح الخاء والتاء وألف بينهما . قاله علقمة : أما رأيت المرأة تقول للعطار : اجعل خاتمه مسكا ، تريد آخره . والخاتم والختام متقاربان في المعنى ، إلا أن الخاتم الاسم ، والختام المصدر ; قاله الفراء . وفي الصحاح : والختام : الطين الذي يختم به . وكذا قال مجاهد وابن زيد : ختم إناؤه بالمسك بدلا من الطين . حكاه المهدوي . وقال الفرزدق :\nوبت أفض أغلاق الختام\nوقال الأعشى :\nوأبرزها وعليها ختم\nأي عليها طينة مختومة ; مثل نفض بمعنى منفوض ، وقبض بمعنى مقبوض . وذكر ابن المبارك وابن وهب ، واللفظ لابن وهب ، عن عبد الله بن مسعود في قوله تعالى : ختامه مسك : خلطه ، ليس بخاتم يختم ، ألا ترى إلى قول المرأة من نسائكم : إن خلطه من الطيب كذا وكذا . إنما خلطه مسك ; قال : شراب أبيض مثل الفضة يختمون به آخر أشربتهم ، لو أن رجلا من أهل الدنيا أدخل فيه يده ثم أخرجها ، لم يبق ذو روح إلا وجد ريح طيبها . وروى أبي بن كعب قال : قيل يا رسول الله ما الرحيق المختوم ؟ قال : \" غدران الخمر \" . وقيل : مختوم في الآنية ، وهو غير الذي يجري في الأنهار . فالله أعلم .\nوفي ذلك أي وفي الذي وصفناه من أمر الجنة فليتنافس المتنافسون أي فليرغب الراغبون يقال : ( نفست عليه الشيء أنفسه نفاسة : أي ضننت به ، ولم أحب أن يصير إليه . وقيل : الفاء بمعنى إلى ، أي وإلى ذلك فليتبادر المتبادرون في العمل ; نظيره : لمثل هذا فليعمل العاملون ) .\n                                    ",
      "saadi": "خِتَٰمُهُۥ مِسۡكٞۚ وَفِي ذَٰلِكَ فَلۡيَتَنَافَسِ ٱلۡمُتَنَٰفِسُونَ ٦٢\n                                        \n                                        \n                                        \n                                        ذلك الشراب { خِتَامُهُ مِسْكٌ } يحتمل أن المراد مختوم عن أن يداخله شيء ينقص لذته، أو يفسد طعمه، وذلك الختام، الذي ختم به, مسك.\nويحتمل أن المراد أنه [الذي] يكون في آخر الإناء، الذي يشربون منه الرحيق حثالة، وهي المسك الأذفر، فهذا الكدر منه، الذي جرت العادة في الدنيا أنه يراق, يكون في الجنة بهذه المثابة، { وَفِي ذَلِكَ } النعيم المقيم، الذي لا يعلم حسنه ومقداره إلا الله، { فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ } أي: يتسابقوا في المبادرة إليه بالأعمال الموصلة إليه، فهذا أولى ما بذلت فيه نفائس الأنفاس، وأحرى ما تزاحمت للوصول إليه فحول الرجال.\n                                    "
    }
  },
  {
    "id": 26,
    "versesNumber": 27,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَمِزَاجُهُۥ مِن تَسۡنِيمٍ ٧٢",
    "tafsier": {
      "ibnkther": "وَمِزَاجُهُۥ مِن تَسۡنِيمٍ ٧٢\n                                    \n                                    \n                                    أي ومزاج هذا الرحيق الموصوف من تسنيم أي من شراب يقال له تسنيم وهو أشرف شراب أهل الجنة وأعلاه قاله أبو صالح والضحاك.\n                                    ",
      "qortoby": "وَمِزَاجُهُۥ مِن تَسۡنِيمٍ ٧٢\n                                    \n                                    \n                                    ومزاجه أي ومزاج ذلك الرحيق من تسنيم وهو شراب ينصب عليهم من علو ، وهو أشرف شراب في الجنة . وأصل التسنيم في اللغة : الارتفاع فهي عين ماء تجري من علو إلى أسفل ; ومنه سنام البعير لعلوه من بدنه ، وكذلك تسنيم القبور . وروي عن عبد الله قال : ( تسنيم ) عين في الجنة يشرب بها المقربون صرفا ، ويمزج منها كأس أصحاب اليمين فتطيب . وقال ابن عباس في قوله - عز وجل - : ومزاجه من تسنيم قال : هذا مما قال الله تعالى : فلا تعلم نفس ما أخفي لهم من قرة أعين . وقيل : التسنيم عين تجري في الهواء بقدرة الله تعالى ، فتنصب في أواني أهل الجنة على قدر مائها ، فإذا امتلأت أمسك الماء ، فلا تقع منه قطرة على الأرض ، ولا يحتاجون إلى الاستقاء ; قاله قتادة ، ابن زيد : بلغنا أنها عين تجري من تحت العرش . وكذا في مراسيل الحسن . وقد ذكرناه في سورة ( الإنسان ) .\n                                    ",
      "saadi": "وَمِزَاجُهُۥ مِن تَسۡنِيمٍ ٧٢\n                                        \n                                        \n                                        \n                                        ومزاج هذا الشراب من تسنيم\n                                    "
    }
  },
  {
    "id": 27,
    "versesNumber": 28,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "عَيۡنٗا يَشۡرَبُ بِهَا ٱلۡمُقَرَّبُونَ ٨٢",
    "tafsier": {
      "ibnkther": "عَيۡنٗا يَشۡرَبُ بِهَا ٱلۡمُقَرَّبُونَ ٨٢\n                                    \n                                    \n                                    أي يشربها المقربون صرفا وتمزج لأصحاب اليمين مزجا قاله ابن مسعود وابن عباس ومسروق وقتادة وغيرهم.\n                                    ",
      "qortoby": "عَيۡنٗا يَشۡرَبُ بِهَا ٱلۡمُقَرَّبُونَ ٨٢\n                                    \n                                    \n                                    عينا يشرب بها المقربون أي يشرب منها أهل جنة عدن ، وهم أفاضل أهل الجنة صرفا ، وهي لغيرهم مزاج . و ( عينا ) نصب على المدح . وقال الزجاج : نصب على الحال من تسنيم ، وتسنيم معرفة ، ليس يعرف له اشتقاق ، وإن جعلته مصدرا مشتقا من السنام ف ( عينا ) نصب ; لأنه مفعول به ; كقوله تعالى : أو إطعام في يوم ذي مسغبة يتيما وهذا قول الفراء إنه منصوب بتسنيم . وعند الأخفش ب \" يسقون \" أي يسقون عينا أو من عين . وعند المبرد بإضمار أعني على المدح .\n                                    ",
      "saadi": "عَيۡنٗا يَشۡرَبُ بِهَا ٱلۡمُقَرَّبُونَ ٨٢\n                                        \n                                        \n                                        \n                                        وهي عين { يَشْرَبُ بِهَا الْمُقَرَّبُونَ } صرفا، وهي أعلى أشربة الجنة على الإطلاق، فلذلك كانت خالصة للمقربين، الذين هم أعلى الخلق منزلة، وممزوجة لأصحاب اليمين أي: مخلوطة بالرحيق وغيره من الأشربة اللذيذة.\n                                    "
    }
  },
  {
    "id": 28,
    "versesNumber": 29,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "إِنَّ ٱلَّذِينَ أَجۡرَمُواْ كَانُواْ مِنَ ٱلَّذِينَ ءَامَنُواْ يَضۡحَكُونَ ٩٢",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ أَجۡرَمُواْ كَانُواْ مِنَ ٱلَّذِينَ ءَامَنُواْ يَضۡحَكُونَ ٩٢\n                                    \n                                    \n                                    يخبر تعالى عن المجرمين أنهم كانوا في الدار الدنيا يضحكون من المؤمنين أي يستهزئون بهم ويحتقرونهم.\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ أَجۡرَمُواْ كَانُواْ مِنَ ٱلَّذِينَ ءَامَنُواْ يَضۡحَكُونَ ٩٢\n                                    \n                                    \n                                    قوله تعالى : إن الذين أجرموا وصف أرواح الكفار في الدنيا مع المؤمنين باستهزائهم بهم والمراد رؤساء قريش من أهل الشرك . روى ناس عن ابن عباس قال : هو الوليد بن المغيرة ، وعقبة بن أبي معيط ، والعاص بن وائل ، والأسود بن عبد يغوث ، والعاص بن هشام ، وأبو جهل ، والنضر بن الحارث ; وأولئك كانوا من الذين آمنوا من أصحاب محمد - صلى الله عليه وسلم - مثل عمار ، وخباب وصهيب وبلال يضحكون على وجه السخرية .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ أَجۡرَمُواْ كَانُواْ مِنَ ٱلَّذِينَ ءَامَنُواْ يَضۡحَكُونَ ٩٢\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى جزاء المجرمين وجزاء المؤمنين و [ذكر] ما بينهما من التفاوت العظيم، أخبر أن المجرمين كانوا في الدنيا يسخرون بالمؤمنين، ويستهزئون بهم، ويضحكون منهم\n                                    "
    }
  },
  {
    "id": 29,
    "versesNumber": 30,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَإِذَا مَرُّواْ بِهِمۡ يَتَغَامَزُونَ ٠٣",
    "tafsier": {
      "ibnkther": "وَإِذَا مَرُّواْ بِهِمۡ يَتَغَامَزُونَ ٠٣\n                                    \n                                    \n                                    وإذا مروا بالمؤمنين يتغامزون عليهم أي محتقرين لهم.\n                                    ",
      "qortoby": "وَإِذَا مَرُّواْ بِهِمۡ يَتَغَامَزُونَ ٠٣\n                                    \n                                    \n                                    وإذا مروا بهم عند إتيانهم رسول الله - صلى الله عليه وسلم - يتغامزون يغمز بعضهم بعضا ، ويشيرون بأعينهم . وقيل : أي يعيرونهم بالإسلام ويعيبونهم به يقال : غمزت الشيء بيدي ; قال :\nوكنت إذا غمزت قناة قوم كسرت كعوبها أو تستقيما\nوقالت عائشة : كان النبي - صلى الله عليه وسلم - إذا سجد غمزني ، فقبضت رجلي . الحديث ; وقد مضى في ( النساء ) . وغمزته بعيني . وقيل : الغمز : بمعنى العيب ، يقال غمزه : أي عابه ، وما في فلان غمزة أي عيب . وقال مقاتل : نزلت في علي بن أبي طالب جاء في نفر من المسلمين إلى النبي - صلى الله عليه وسلم - فلمزهم المنافقون ، وضحكوا عليهم وتغامزوا .\n                                    ",
      "saadi": "وَإِذَا مَرُّواْ بِهِمۡ يَتَغَامَزُونَ ٠٣\n                                        \n                                        \n                                        \n                                        ويتغامزون بهم عند مرورهم عليهم، احتقارا لهم وازدراء، ومع هذا تراهم مطمئنين، لا يخطر الخوف على بالهم\n                                    "
    }
  },
  {
    "id": 30,
    "versesNumber": 31,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَإِذَا ٱنقَلَبُوٓاْ إِلَىٰٓ أَهۡلِهِمُ ٱنقَلَبُواْ فَكِهِينَ ١٣",
    "tafsier": {
      "ibnkther": "وَإِذَا ٱنقَلَبُوٓاْ إِلَىٰٓ أَهۡلِهِمُ ٱنقَلَبُواْ فَكِهِينَ ١٣\n                                    \n                                    \n                                    أي وإذا انقلب أى رجع هؤلاء المجرمون إلى منازلهم انقلبوا إليها فكهين أي مهما طلبوا وجدوا ومع هذا ما شكروا نعمة الله عليهم بل اشتغلوا بالقوم المؤمنين يحقرونهم ويحسدونهم.\n                                    ",
      "qortoby": "وَإِذَا ٱنقَلَبُوٓاْ إِلَىٰٓ أَهۡلِهِمُ ٱنقَلَبُواْ فَكِهِينَ ١٣\n                                    \n                                    \n                                    وإذا انقلبوا أي انصرفوا إلى أهلهم وأصحابهم وذويهم انقلبوا فكهين أي معجبين منهم . وقيل : معجبون بما هم عليه من الكفر ، متفكهون بذكر المؤمنين . وقرأ ابن القعقاع وحفص والأعرج والسلمي : فكهين بغير ألف . الباقون بألف . قال الفراء : هما لغتان مثل طمع وطامع وحذر وحاذر ، وقد تقدم في سورة ( الدخان ) والحمد لله . وقيل : الفكه : الأشر البطر والفاكه : الناعم المتنعم .\n                                    ",
      "saadi": "وَإِذَا ٱنقَلَبُوٓاْ إِلَىٰٓ أَهۡلِهِمُ ٱنقَلَبُواْ فَكِهِينَ ١٣\n                                        \n                                        \n                                        \n                                        { وَإِذَا انْقَلَبُوا إِلَى أَهْلِهِمُ } صباحًا أو مساء { انْقَلَبُوا فَكِهِينَ } أي: مسرورين مغتبطين \n                                    "
    }
  },
  {
    "id": 31,
    "versesNumber": 32,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَإِذَا رَأَوۡهُمۡ قَالُوٓاْ إِنَّ هَٰٓؤُلَآءِ لَضَآلُّونَ ٢٣",
    "tafsier": {
      "ibnkther": "وَإِذَا رَأَوۡهُمۡ قَالُوٓاْ إِنَّ هَٰٓؤُلَآءِ لَضَآلُّونَ ٢٣\n                                    \n                                    \n                                    أي لكونهم على غير دينهم.\n                                    ",
      "qortoby": "وَإِذَا رَأَوۡهُمۡ قَالُوٓاْ إِنَّ هَٰٓؤُلَآءِ لَضَآلُّونَ ٢٣\n                                    \n                                    \n                                    وإذا رأوهم أي إذا رأى هؤلاء الكفار أصحاب محمد - صلى الله عليه وسلم - قالوا إن هؤلاء لضالون في اتباعهم محمدا - صلى الله عليه وسلم \n                                    ",
      "saadi": "وَإِذَا رَأَوۡهُمۡ قَالُوٓاْ إِنَّ هَٰٓؤُلَآءِ لَضَآلُّونَ ٢٣\n                                        \n                                        \n                                        \n                                        وهذا من أعظم ما يكون من الاغترار، أنهم جمعوا بين غاية الإساءة والأمن في الدنيا، حتى كأنهم قد جاءهم كتاب من الله وعهد، أنهم من أهل السعادة، وقد حكموا لأنفسهم أنهم أهل الهدى، وأن المؤمنين ضالون، افتراء على الله، وتجرأوا على القول عليه بلا علم.\n                                    "
    }
  },
  {
    "id": 32,
    "versesNumber": 33,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "وَمَآ أُرۡسِلُواْ عَلَيۡهِمۡ حَٰفِظِينَ ٣٣",
    "tafsier": {
      "ibnkther": "وَمَآ أُرۡسِلُواْ عَلَيۡهِمۡ حَٰفِظِينَ ٣٣\n                                    \n                                    \n                                    ( وما أرسلوا عليهم حافظين ) أي وما بعث هؤلاء المجرمون حافظين على هؤلاء المؤمنين ما يصدر من أعمالهم وأقوالهم ولا كلفوا بهم فلم اشتغلوا بهم وجعلوهم نصب أعينهم كما قال تعالى ( قال اخسئوا فيها ولا تكلمون إنه كان فريق من عبادي يقولون ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين فاتخذتموهم سخريا حتى أنسوكم ذكري وكنتم منهم تضحكون إني جزيتهم اليوم بما صبروا أنهم هم الفائزون ) المؤمنون 108 - 111\n                                    ",
      "qortoby": "وَمَآ أُرۡسِلُواْ عَلَيۡهِمۡ حَٰفِظِينَ ٣٣\n                                    \n                                    \n                                    لأعمالهم , موكلين بأحوالهم , رقباء عليهم .\n                                    ",
      "saadi": "وَمَآ أُرۡسِلُواْ عَلَيۡهِمۡ حَٰفِظِينَ ٣٣\n                                        \n                                        \n                                        \n                                        { وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ } أي: وما أرسلوا وكلاء على المؤمنين ملزمين بحفظ أعمالهم، حتى يحرصوا على رميهم بالضلال، وما هذا منهم إلا تعنت وعناد وتلاعب، ليس له مستند ولا برهان\n                                    "
    }
  },
  {
    "id": 33,
    "versesNumber": 34,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "فَٱلۡيَوۡمَ ٱلَّذِينَ ءَامَنُواْ مِنَ ٱلۡكُفَّارِ يَضۡحَكُونَ ٤٣",
    "tafsier": {
      "ibnkther": "فَٱلۡيَوۡمَ ٱلَّذِينَ ءَامَنُواْ مِنَ ٱلۡكُفَّارِ يَضۡحَكُونَ ٤٣\n                                    \n                                    \n                                    \"فاليوم\" يعني يوم القيامة \"الذين آمنوا من الكفار يضحكون\" أي في مقابلة ما ضحك بهم أولئك.\n                                    ",
      "qortoby": "فَٱلۡيَوۡمَ ٱلَّذِينَ ءَامَنُواْ مِنَ ٱلۡكُفَّارِ يَضۡحَكُونَ ٤٣\n                                    \n                                    \n                                    ( فاليوم ) يعني هذا اليوم الذي هو يوم القيامة الذين آمنوا بمحمد - صلى الله عليه وسلم - من الكفار يضحكون كما ضحك الكفار منهم في الدنيا . نظيره في آخر سورة ( المؤمنين ) وقد تقدم . وذكر ابن المبارك : أخبرنا محمد بن بشار عن قتادة في قوله تعالى : فاليوم الذين آمنوا من الكفار يضحكون قال : ذكر لنا أن كعبا كان يقول إن بين الجنة والنار كوى ، فإذا أراد المؤمن أن ينظر إلى عدو كان له في الدنيا اطلع من بعض الكوى ; قال الله تعالى في آية أخرى : فاطلع فرآه في سواء الجحيم قال : ذكر لنا أنه اطلع فرأى جماجم القوم تغلي . وذكر ابن المبارك أيضا : أخبرنا الكلبي عن أبي صالح في قوله تعالى : الله يستهزئ بهم قال : يقال لأهل النار وهم في النار : اخرجوا ، فتفتح لهم أبواب النار ، فإذا رأوها قد فتحت أقبلوا إليها يريدون الخروج ، والمؤمنون ينظرون إليهم على الأرائك ، فإذا انتهوا إلى أبوابها غلقت دونهم ; فذلك قوله : الله يستهزئ بهم ويضحك منهم المؤمنون حين غلقت دونهم فذلك قوله تعالى : فاليوم الذين آمنوا من الكفار يضحكون .\n                                    ",
      "saadi": "فَٱلۡيَوۡمَ ٱلَّذِينَ ءَامَنُواْ مِنَ ٱلۡكُفَّارِ يَضۡحَكُونَ ٤٣\n                                        \n                                        \n                                        \n                                        ولهذا كان جزاؤهم في الآخرة من جنس عملهم، قال تعالى: { فَالْيَوْمَ } أي: يوم القيامة، { الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ } حين يرونهم في غمرات العذاب يتقلبون، وقد ذهب عنهم ما كانوا يفترون، والمؤمنون في غاية الراحة والطمأنينة\n                                    "
    }
  },
  {
    "id": 34,
    "versesNumber": 35,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "عَلَى ٱلۡأَرَآئِكِ يَنظُرُونَ ٥٣",
    "tafsier": {
      "ibnkther": "عَلَى ٱلۡأَرَآئِكِ يَنظُرُونَ ٥٣\n                                    \n                                    \n                                    أي إلى الله عز وجل في مقابلة من زعم فيهم أنهم ضالون وليسوا بضالين بل هم من أولياء الله المقربين ينظرون إلى ربهم في دار كرامته.\n                                    ",
      "qortoby": "عَلَى ٱلۡأَرَآئِكِ يَنظُرُونَ ٥٣\n                                    \n                                    \n                                    على الأرائك ينظرون وقد مضى هذا في أول سورة ( البقرة ) .\n                                    ",
      "saadi": "عَلَى ٱلۡأَرَآئِكِ يَنظُرُونَ ٥٣\n                                        \n                                        \n                                        \n                                        { عَلَى الْأَرَائِكِ } وهي السرر المزينة، { يُنْظَرُونَ } إلى ما أعد الله لهم من النعيم، وينظرون إلى وجه ربهم الكريم.\n                                    "
    }
  },
  {
    "id": 35,
    "versesNumber": 36,
    "souraName": "Al-Mutaffifin.html",
    "contnent": "هَلۡ ثُوِّبَ ٱلۡكُفَّارُ مَا كَانُواْ يَفۡعَلُونَ ٦٣",
    "tafsier": {
      "ibnkther": "هَلۡ ثُوِّبَ ٱلۡكُفَّارُ مَا كَانُواْ يَفۡعَلُونَ ٦٣\n                                    \n                                    \n                                    أي هل جوزي الكفار على ما كانوا يقابلون به المؤمنين من الاستهزاء والتنقيص أم لا؟ يعني قد جوزوا أوفر الجزاء وأتمه وأكمله.\nآخر تفسير سورة المطففين ولله الحمد والمنة.\n                                    ",
      "qortoby": "هَلۡ ثُوِّبَ ٱلۡكُفَّارُ مَا كَانُواْ يَفۡعَلُونَ ٦٣\n                                    \n                                    \n                                    وقد مضى هذا في أول سورة \" البقرة \" .\nومعنى هل ثوب أي هل جوزي بسخريتهم في الدنيا بالمؤمنين إذا فعل بهم ذلك . وقيل : إنه متعلق ب \" ينظرون \" أي ينظرون : هل جوزي الكفار ؟ فيكون معنى ( هل ) التقرير وموضعها نصبا ب ينظرون . وقيل : استئناف لا موضع له من الإعراب . وقيل : هو إضمار على القول ، والمعنى ; يقول بعض المؤمنين لبعض : هل ثوب الكفار أي أثيب وجوزي . وهو من ثاب يثوب أي رجع ; فالثواب ما يرجع على العبد في مقابلة عمله ، ويستعمل في الخير والشر .\n                                    ختمت السورة والله أعلم .\n                                    ",
      "saadi": "هَلۡ ثُوِّبَ ٱلۡكُفَّارُ مَا كَانُواْ يَفۡعَلُونَ ٦٣\n                                        \n                                        \n                                        \n                                        { هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ } أي: هل جوزوا من جنس عملهم ؟\nفكما ضحكوا في الدنيا من المؤمنين ورموهم بالضلال، ضحك المؤمنون منهم في الآخرة، ورأوهم في العذاب والنكال، الذي هو عقوبة الغي والضلال.\nنعم، ثوبوا ما كانوا يفعلون، عدلًا من الله وحكمة، والله عليم حكيم.\n                                    "
    }
  }
]