[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Ar-Ra'd.html",
    "contnent": "الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ١",
    "tafsier": {
      "ibnkther": "الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ١\n                                    \n                                    \n                                    تفسير سورة الرعد [ وهي مكية ]\nأما الكلام على الحروف المقطعة في أوائل السورة قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال ألم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه.\nوحكى مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى ألم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه وليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسئلة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسئلة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وإن شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها إسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن اسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\n( تلك آيات الكتاب ) أي : هذه آيات الكتاب ، وهو القرآن ، وقيل : التوارة والإنجيل . قاله مجاهد وقتادة ، وفيه نظر بل هو بعيد .\nثم عطف على ذلك عطف صفات ، قوله : ( والذي أنزل إليك ) أي : يا محمد ، ( من ربك الحق ) خبر تقدم مبتدؤه ، وهو قوله : ( والذي أنزل إليك من ربك ) هذا هو الصحيح المطابق لتفسير مجاهد وقتادة . واختار ابن جرير أن تكون الواو زائدة أو عاطفة صفة على صفة كما قدمنا ، واستشهد بقول الشاعر :\nإلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم\nوقوله : ( ولكن أكثر الناس لا يؤمنون ) كقوله : ( وما أكثر الناس ولو حرصت بمؤمنين ) [ يوسف : 103 ] أي : مع هذا البيان والجلاء والوضوح ، لا يؤمن أكثرهم لما فيهم من الشقاق والعناد والنفاق .\n                                    ",
      "qortoby": "الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ١\n                                    \n                                    \n                                    سورة الرعد\nمكية في قول الحسن وعكرمة وعطاء وجابر ، ومدنية في قول الكلبي ومقاتل . وقال ابن عباس وقتادة : مدنية إلا آيتين منها نزلتا بمكة ; وهما قوله - عز وجل - : ولو أن قرآنا سيرت به الجبال إلى آخرهما\nقوله تعالى : المر تلك آيات الكتاب تقدم القول فيها . والذي أنزل إليك يعني وهذا القرآن الذي أنزل إليك .\nمن ربك الحق لا كما يقول المشركون : إنك تأتي به من تلقاء نفسك ; فاعتصم به ، واعمل بما فيه . قال مقاتل : نزلت حين قال المشركون : إن محمدا أتى بالقرآن من تلقاء نفسه . \" والذي \" في موضع رفع عطفا على \" آيات \" أو على الابتداء ، و \" الحق \" خبره ; ويجوز أن يكون موضعه جرا على تقدير : وآيات الذي أنزل إليك ، وارتفاع الحق على هذا على إضمار مبتدأ ، تقديره : ذلك الحق ; كقوله تعالى : وهم يعلمون الحق ، يعني ذلك الحق . قال الفراء : وإن شئت جعلت الذي خفضا نعتا للكتاب ، وإن كانت فيه الواو كما يقال : أتانا هذا الكتاب عن أبي حفص والفاروق ; ومنه قول الشاعر :\nإلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم\nيريد : إلى الملك القرم بن الهمام ، ليث الكتيبة . ولكن أكثر الناس لا يؤمنون\n                                    ",
      "saadi": "الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أن هذا القرآن هو آيات الكتاب الدالة على كل ما يحتاج إليه العباد من أصول الدين وفروعه، وأن الذي أنزل إلى الرسول من ربه هو الحق المبين، لأن أخباره صدق، وأوامره ونواهيه عدل، مؤيدة بالأدلة والبراهين القاطعة، فمن أقبل عليه وعلى علمه، كان من أهل العلم بالحق، الذي يوجب لهم علمهم العمل بما أحب الله.\n{ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ } بهذا القرآن، إما جهلا وإعراضا عنه وعدم اهتمام به، وإما عنادا وظلما، فلذلك أكثر الناس غير منتفعين به، لعدم السبب الموجب للانتفاع.\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Ar-Ra'd.html",
    "contnent": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ ٢",
    "tafsier": {
      "ibnkther": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ ٢\n                                    \n                                    \n                                    يخبر الله تعالى عن كمال قدرته وعظيم سلطانه : أنه الذي بإذنه وأمره رفع السماوات بغير عمد ، بل بإذنه وأمره وتسخيره رفعها عن الأرض بعدا لا تنال ولا يدرك مداها ، فالسماء الدنيا محيطة بجميع الأرض وما حولها من الماء والهواء من جميع نواحيها وجهاتها وأرجائها ، مرتفعة عليها من كل جانب على السواء ، وبعد ما بينها وبين الأرض من كل ناحية مسيرة خمسمائة عام ، وسمكها في نفسها مسيرة خمسمائة عام . ثم السماء الثانية محيطة بالسماء الدنيا وما حوت ، وبينها وبينها من البعد مسيرة خمسمائة عام ، وسمكها خمسمائة عام ، ثم السماء الثالثة محيطة بالثانية ، بما فيها ، وبينها وبينها خمسمائة عام ، وسمكها خمسمائة عام ، وكذا الرابعة والخامسة والسادسة والسابعة ، كما قال [ الله ] تعالى : ( الله الذي خلق سبع سماوات ومن الأرض مثلهن يتنزل الأمر بينهن لتعلموا أن الله على كل شيء قدير وأن الله قد أحاط بكل شيء علما ) [ الطلاق : 12 ] وفي الحديث : \" ما السماوات السبع وما فيهن وما بينهن في الكرسي إلا كحلقة ملقاة بأرض فلاة ، والكرسي في العرش كتلك الحلقة في تلك الفلاة وفي رواية : \" والعرش لا يقدر قدره إلا الله ، عز وجل ، وجاء عن بعض السلف أن بعد ما بين العرش إلى الأرض مسيرة خمسين ألف سنة ، وبعد ما بين قطريه مسيرة خمسين ألف سنة ، وهو من ياقوتة حمراء .\nوقوله : ( بغير عمد ترونها ) روي عن ابن عباس ، ومجاهد ، والحسن ، وقتادة : أنهم : قالوا : لها عمد ولكن لا ترى .\nوقال إياس بن معاوية : السماء على الأرض مثل القبة ، يعني بلا عمد . وكذا روي عن قتادة ، وهذا هو اللائق بالسياق . والظاهر من قوله تعالى : ( ويمسك السماء أن تقع على الأرض إلا بإذنه ) [ الحج : 65 ] فعلى هذا يكون قوله : ( ترونها ) تأكيدا لنفي ذلك ، أي : هي مرفوعة بغير عمد كما ترونها . هذا هو الأكمل في القدرة . وفي شعر أمية بن أبي الصلت الذي آمن شعره وكفر قلبه ، كما ورد في الحديث ويروى لزيد بن عمرو بن نفيل ، رحمه الله ورضي عنه :\nوأنت الذي من فضل من ورحمة بعثت إلى موسى رسولا مناديا فقلت له : فاذهب وهارون فادعوا\nإلى الله فرعون الذي كان طاغيا وقولا له : هل أنت سويت هذه\nبلا [ وتد حتى اطمأنت كما هيا وقولا له : أأنت رفعت هذه\nبلا ] عمد أرفق إذا بك بانيا ؟ وقولا له : هل أنت سويت وسطها\nمنيرا إذا ما جنك الليل هاديا وقولا له : من يرسل الشمس غدوة\nفيصبح ما مست من الأرض ضاحيا ؟ وقولا له : من ينبت الحب في الثرى\nفيصبح منه العشب يهتز رابيا ؟ ويخرج منه حبه في رءوسه\nففي ذاك آيات لمن كان واعيا\nوقوله : ( ثم استوى على العرش ) تقدم تفسير ذلك في سورة \" الأعراف \" وأنه يمرر كما جاء من غير تكييف ، ولا تشبيه ، ولا تعطيل ، ولا تمثيل ، تعالى الله علوا كبيرا .\nوقوله : ( وسخر الشمس والقمر كل يجري لأجل مسمى ) قيل : المراد أنهما يجريان إلى انقطاعهما بقيام الساعة ، كما في قوله تعالى : ( والشمس تجري لمستقر لها ذلك تقدير العزيز العليم ) [ يس : 38 ] .\nوقيل : المراد إلى مستقرهما ، وهو تحت العرش مما يلي بطن الأرض من الجانب الآخر ، فإنهما وسائر الكواكب إذا وصلوا هنالك ، يكونون أبعد ما يكون عن العرش; لأنه على الصحيح الذي تقوم عليه الأدلة ، قبة مما يلي العالم من هذا الوجه ، وليس بمحيط كسائر الأفلاك; لأنه له قوائم وحملة يحملونه . ولا يتصور هذا في الفلك المستدير ، وهذا واضح لمن تدبر ما وردت به الآيات والأحاديث الصحيحة ، ولله الحمد والمنة .\nوذكر الشمس والقمر; لأنهما أظهر الكواكب السيارة السبعة ، التي هي أشرف وأعظم .\nمن الثوابت ، فإذا كان قد سخر هذه ، فلأن يدخل في التسخير سائر الكواكب بطريق الأولى والأحرى ، كما نبه بقوله تعالى : ( لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون ) [ فصلت : 37 ] مع أنه قد صرح بذلك بقوله ( والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين ) [ الأعراف : 54 ] .\nوقوله : ( يفصل الآيات لعلكم بلقاء ربكم توقنون ) أي : يوضح الآيات والدلالات الدالة على أنه لا إله إلا هو ، وأنه يعيد الخلق إذا شاء كما ابتدأ خلقه .\n                                    ",
      "qortoby": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : الله الذي رفع السماوات بغير عمد ترونها ثم استوى على العرش وسخر الشمس والقمر كل يجري لأجل مسمى يدبر الأمر يفصل الآيات لعلكم بلقاء ربكم توقنون\nقوله تعالى : الله الذي رفع السماوات بغير عمد ترونها الآية . لما بين تعالى أن القرآن حق ، بين أن من أنزله قادر على الكمال ; فانظروا في مصنوعاته لتعرفوا كمال قدرته ; وقد تقدم هذا المعنى . وفي قوله : بغير عمد ترونها قولان : أحدهما : أنها مرفوعة بغير عمد ترونها ; قاله قتادة وإياس بن معاوية وغيرهما . الثاني : لها عمد ، ولكنا لا نراه ; قال ابن عباس : لها عمد على جبل قاف ; ويمكن أن يقال على هذا القول : العمد قدرته التي يمسك بها السماوات والأرض ، وهي غير مرئية لنا ; ذكره الزجاج . وقال ابن عباس أيضا : هي توحيد المؤمن . أعمدت السماء حين كادت تنفطر من كفر الكافر ; ذكره الغزنوي . والعمد جمع عمود ; قال النابغة :\nوخيس الجن إني قد أذنت لهم يبنون تدمر بالصفاح والعمد\nثم استوى على العرش تقدم الكلام فيه وسخر الشمس والقمر أي ذللهما لمنافع خلقه ومصالح عباده ; وكل مخلوق مذلل للخالق .\nكل يجري لأجل مسمى أي إلى وقت معلوم ; وهو فناء الدنيا ، وقيام الساعة التي عندها تكور الشمس ، ويخسف القمر ، وتنكدر النجوم ، وتنتثر الكواكب . وقال ابن عباس : أراد بالأجل المسمى درجاتهما ومنازلهما التي ينتهيان إليها لا يجاوزانها . وقيل : معنى الأجل المسمى أن القمر يقطع فلكه في شهر ، والشمس في سنة .\nيدبر الأمر أي يصرفه على ما يريد .\nيفصل الآيات أي يبينها أي من قدر على هذه الأشياء يقدر على الإعادة ; ولهذا قال : لعلكم بلقاء ربكم توقنون\n                                    ",
      "saadi": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ ٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن انفراده بالخلق والتدبير، والعظمة والسلطان الدال على أنه وحده المعبود الذي لا تنبغي العبادة إلا له فقال: { اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ } على عظمها واتساعها بقدرته العظيمة، { بِغَيْرِ عَمَدٍ تَرَوْنَهَا } أي: ليس لها عمد من تحتها، فإنه لو كان لها عمد، لرأيتموها { ثُمَّ } بعد ما خلق السماوات والأرض { اسْتَوَى عَلَى الْعَرْشِ } العظيم الذي هو أعلى المخلوقات، استواء يليق بجلاله ويناسب كماله.\n{ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ } لمصالح العباد ومصالح مواشيهم وثمارهم، { كُلِّ } من الشمس والقمر { يَجْرِي } بتدبير العزيز العليم، { لأَجَلٍ مُسَمًّى } بسير منتظم، لا يفتران ولا ينيان، حتى يجيء الأجل المسمى وهو طي الله هذا العالم، ونقلهم إلى الدار الآخرة التي هي دار القرار، فعند ذلك يطوي الله السماوات ويبدلها، ويغير الأرض ويبدلها. فتكور الشمس والقمر، ويجمع بينهما فيلقيان في النار، ليرى من عبدهما أنهما غير أهل للعبادة؛ فيتحسر بذلك أشد الحسرة وليعلم الذين كفروا أنهم كانوا كاذبين.\nوقوله { يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ } هذا جمع بين الخلق والأمر، أي: قد استوى الله العظيم على سرير الملك، يدبر الأمور في العالم العلوي والسفلي، فيخلق ويرزق، ويغني ويفقر، ويرفع أقواما ويضع آخرين، ويعز ويذل، ويخفض ويرفع، ويقيل العثرات، ويفرج الكربات، وينفذ الأقدار في أوقاتها التي سبق بها علمه، وجرى بها قلمه، ويرسل ملائكته الكرام لتدبير ما جعلهم على تدبيره.\nوينزل الكتب الإلهية على رسله ويبين ما يحتاج إليه العباد من الشرائع والأوامر والنواهي، ويفصلها غاية التفصيل ببيانها وإيضاحها وتمييزها، { لَعَلَّكُمْ } بسبب ما أخرج لكم من الآيات الأفقية والآيات القرآنية، { بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ } فإن كثرة الأدلة وبيانها ووضوحها، من أسباب حصول اليقين في جميع الأمور الإلهية، خصوصا في العقائد الكبار، كالبعث والنشور والإخراج من القبور.\nوأيضا فقد علم أن الله تعالى حكيم لا يخلق الخلق سدى، ولا يتركهم عبثا، فكما أنه أرسل رسله وأنزل كتبه لأمر العباد ونهيهم، فلا بد أن ينقلهم إلى دار يحل فيها جزاؤه، فيجازي المحسنين بأحسن الجزاء، ويجازي المسيئين بإساءتهم.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ ٣",
    "tafsier": {
      "ibnkther": "وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ ٣\n                                    \n                                    \n                                    لما ذكر تعالى العالم العلوي ، شرع في ذكر قدرته وحكمته وإحكامه للعالم السفلي ، فقال : ( وهو الذي مد الأرض ) أي : جعلها متسعة ممتدة في الطول والعرض ، وأرساها بجبال راسيات شامخات ، وأجرى فيها الأنهار والجداول والعيون لسقي ما جعل فيها من الثمرات المختلفة الألوان والأشكال والطعوم والروائح ، من كل زوجين اثنين ، أي : من كل شكل صنفان .\n( يغشي الليل النهار ) أي : جعل كلا منهما يطلب الآخر طلبا حثيثا ، فإذا ذهب هذا غشيه هذا ، وإذا انقضى هذا جاء الآخر ، فيتصرف أيضا في الزمان كما تصرف في المكان والسكان .\n( إن في ذلك لآيات لقوم يتفكرون ) أي : في آلاء الله وحكمته ودلائله .\n                                    ",
      "qortoby": "وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ ٣\n                                    \n                                    \n                                    قوله تعالى : وهو الذي مد الأرض وجعل فيها رواسي وأنهارا ومن كل الثمرات جعل فيها زوجين اثنين يغشي الليل النهار إن في ذلك لآيات لقوم يتفكرون\nقوله تعالى : وهو الذي مد الأرض لما بين آيات السماوات بين آيات الأرض ; أي بسط الأرض طولا وعرضا .\nوجعل فيها رواسي أي جبالا ثوابت ; واحدها راسية ; لأن الأرض ترسو بها ، أي تثبت ; والإرساء الثبوت ; قال عنترة :\nفصبرت عارفة لذلك حرة ترسو إذا نفس الجبان تطلع\nوقال جميل :\nأحبها والذي أرسى قواعده حبا إذا ظهرت آياته بطنا\nوقال ابن عباس وعطاء : أول جبل وضع على الأرض أبو قبيس .\nمسألة : في هذه الآية رد على من زعم أن الأرض كالكرة ، ورد على من زعم أن الأرض تهوي أبوابها عليها ; وزعم ابن الراوندي أن تحت الأرض جسما صعادا كالريح الصعادة ; وهي منحدرة فاعتدل الهاوي والصعادي في الجرم والقوة فتوافقا . وزعم آخرون أن الأرض مركب من جسمين ، أحدهما منحدر ، والآخر مصعد ، فاعتدلا ، فلذلك وقفت . والذي عليه المسلمون وأهل الكتاب القول بوقوف الأرض وسكونها ومدها ، وأن حركتها إنما تكون في العادة بزلزلة تصيبها .\nوقوله تعالى : وأنهارا أي مياها جارية في الأرض ، فيها منافع الخلق .\nومن كل الثمرات جعل فيها زوجين اثنين بمعنى صنفين . قال أبو عبيدة : الزوج واحد ، ويكون اثنين . الفراء : يعني بالزوجين هاهنا الذكر والأنثى ; وهذا خلاف النص . وقيل : معنى زوجين نوعان ، كالحلو والحامض ، والرطب واليابس ، والأبيض والأسود ، والصغير والكبير .\nإن في ذلك لآيات أي دلالات وعلامات لقوم يتفكرون\n                                    ",
      "saadi": "وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ ٣\n                                        \n                                        \n                                        \n                                        { وَهُوَ الَّذِي مَدَّ الْأَرْضَ } أي: خلقها للعباد، ووسعها وبارك فيها ومهدها للعباد، وأودع فيها من مصالحهم ما أودع، { وَجَعَلَ فِيهَا رَوَاسِيَ } أي: جبالا عظاما، لئلا تميد بالخلق، فإنه لولا الجبال لمادت بأهلها، لأنها على تيار ماء، لا ثبوت لها ولا استقرار إلا بالجبال الرواسي، التي جعلها الله أوتادا لها.\n{ و } جعل فيها { أَنْهَارًا } تسقي الآدميين وبهائمهم وحروثهم، فأخرج بها من الأشجار والزروع والثمار خيرا كثيرا ولهذا قال: { وَمِنْ كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ } أي: صنفين مما يحتاج إليه العباد.\n{ يُغْشِي اللَّيْلَ النَّهَارَ } فتظلم الآفاق فيسكن كل حيوان إلى مأواه ويستريحون من التعب والنصب في النهار، ثم إذا قضوا مأربهم من النوم غشي النهار الليل فإذا هم مصبحون منتشرون في مصالحهم وأعمالهم في النهار.\n{ ومن رحمته جعل لكم الليل والنهار لتسكنوا فيه ولتبتغوا من فضله ولعلكم تشكرون }\n{ إِنَّ فِي ذَلِكَ لَآيَاتٍ } على المطالب الإلهية { لِقَوْمٍ يَتَفَكَّرُونَ } فيها، وينظرون فيها نظر اعتبار دالة على أن الذي خلقها ودبرها وصرفها، هو الله الذي لا إله إلا هو، ولا معبود سواه، وأنه عالم الغيب والشهادة، الرحمن الرحيم، وأنه القادر على كل شيء، الحكيم في كل شيء المحمود على ما خلقه وأمر به تبارك وتعالى.\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤",
    "tafsier": {
      "ibnkther": "وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤\n                                    \n                                    \n                                    وقوله : ( وفي الأرض قطع متجاورات ) أي : أراض تجاور بعضها بعضا ، مع أن هذه طيبة تنبت ما ينتفع به الناس ، وهذه سبخة مالحة لا تنبت شيئا . هكذا روي عن ابن عباس ، ومجاهد ، وسعيد بن جبير ، والضحاك ، وغيرهم .\nوكذا يدخل في هذه الآية اختلاف ألوان بقاع الأرض ، فهذه تربة حمراء ، وهذه بيضاء ، وهذه صفراء ، وهذه سوداء ، وهذه محجرة وهذه سهلة ، وهذه مرملة ، وهذه سميكة ، وهذه رقيقة ، والكل متجاورات . فهذه بصفتها ، وهذه بصفتها الأخرى ، فهذا كله مما يدل على الفاعل المختار ، لا إله إلا هو ، ولا رب سواه .\nوقوله : ( وجنات من أعناب وزرع ونخيل ) يحتمل أن تكون عاطفة على ) جنات ) فيكون ( وزرع ونخيل ) مرفوعين . ويحتمل أن يكون معطوفا على أعناب ، فيكون مجرورا; ولهذا قرأ بكل منهما طائفة من الأئمة .\nوقوله : ( صنوان وغير صنوان ) الصنوان : هي الأصول المجتمعة في منبت واحد ، كالرمان والتين وبعض النخيل ، ونحو ذلك . وغير الصنوان : ما كان على أصل واحد ، كسائر الأشجار ، ومنه سمي عم الرجل صنو أبيه ، كما جاء في الحديث الصحيح : أن رسول الله - صلى الله عليه وسلم - قال لعمر : \" أما شعرت أن عم الرجل صنو أبيه ؟ \" .\nوقال سفيان الثوري ، وشعبة ، عن أبى إسحاق ، عن البراء ، رضي الله عنه : الصنوان : هي النخلات في أصل واحد ، وغير الصنوان : المتفرقات . وقاله ابن عباس ، ومجاهد ، والضحاك ، وقتادة ، وعبد الرحمن بن زيد بن أسلم .\nوقوله : ( يسقى بماء واحد ونفضل بعضها على بعض في الأكل ) قال الأعمش ، عن أبي صالح ، عن أبي هريرة ، رضي الله عنه ، عن النبي ، صلى الله عليه وسلم : ( ونفضل بعضها على بعض في الأكل ) قال : \" الدقل والفارسي ، والحلو والحامض \" . رواه الترمذي وقال : حسن غريب .\nأي : هذا الاختلاف في أجناس الثمرات والزروع ، في أشكالها وألوانها ، وطعومها وروائحها ، وأوراقها وأزهارها .\nفهذا في غاية الحلاوة وذا في غاية الحموضة ، وذا في غاية المرارة وذا عفص ، وهذا عذب وهذا جمع هذا وهذا ، ثم يستحيل إلى طعم آخر بإذن الله تعالى . وهذا أصفر وهذا أحمر ، وهذا أبيض وهذا أسود وهذا أزرق . وكذلك الزهورات مع أن كلها يستمد من طبيعة واحدة ، وهو الماء ، مع هذا الاختلاف الكبير الذي لا ينحصر ولا ينضبط ، ففي ذلك آيات لمن كان واعيا ، وهذا من أعظم الدلالات على الفاعل المختار ، الذي بقدرته فاوت بين الأشياء وخلقها على ما يريد; ولهذا قال تعالى : ( إن في ذلك لآيات لقوم يعقلون )\n                                    ",
      "qortoby": "وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤\n                                    \n                                    \n                                    قوله تعالى : وفي الأرض قطع متجاورات وجنات من أعناب وزرع ونخيل صنوان وغير صنوان يسقى بماء واحد ونفضل بعضها على بعض في الأكل إن في ذلك لآيات لقوم يعقلون\nفيه خمس مسائل :\nالأولى : قوله تعالى : وفي الأرض قطع متجاورات في الكلام حذف ; المعنى :\nوفي الأرض قطع متجاورات وغير متجاورات ; كما قال : سرابيل تقيكم الحر والمعنى : وتقيكم البرد ، ثم حذف لعلم السامع . والمتجاورات المدن وما كان عامرا ، وغير متجاورات الصحاري وما كان غير عامر .\nالثانية : قوله تعالى : \" متجاورات \" أي قرى متدانيات ، ترابها واحد ، وماؤها واحد ، وفيها زروع وجنات ، ثم تتفاوت في الثمار والتمر ; فيكون البعض حلوا ، والبعض حامضا ; والغصن الواحد من الشجرة قد يختلف الثمر فيه من الصغر والكبر واللون والمطعم ، وإن انبسط الشمس والقمر على الجميع على نسق واحد ; وفي هذا أدل دليل على وحدانيته وعظم صمديته ، والإرشاد لمن ضل عن معرفته ; فإنه نبه سبحانه بقوله : يسقى بماء واحد على أن ذلك كله ليس إلا بمشيئته وإرادته ، وأنه مقدور بقدرته ; وهذا أدل دليل على بطلان القول بالطبع ; إذ لو كان ذلك بالماء والتراب والفاعل له الطبيعة لما وقع الاختلاف . وقيل : وجه الاحتجاج أنه أثبت التفاوت بين البقاع ; فمن تربة عذبة ، ومن تربة سبخة مع تجاورهما ; وهذا أيضا من دلالات كمال قدرته ; جل وعز تعالى عما يقول الظالمون والجاحدون علوا كبيرا .\nالثالثة : ذهبت الكفرة - لعنهم الله - إلى أن كل حادث يحدث بنفسه لا من صانع ; وادعوا ذلك في الثمار الخارجة من الأشجار ، وقد أقروا بحدوثها ، وأنكروا محدثها ، وأنكروا الأعراض . وقالت فرقة بحدوث الثمار لا من صانع ، وأثبتوا للأعراض فاعلا ; والدليل على أن الحادث لا بد له من محدث أنه يحدث في وقت ، ويحدث ما هو من جنسه في وقت آخر ; فلو كان حدوثه في وقته لاختصاصه به ، لوجب أن يحدث في وقته كل ما هو من جنسه ; وإذا بطل اختصاصه بوقته صح أن اختصاصه به لأجل مخصص خصصه به ، ولولا تخصيصه إياه به لم يكن حدوثه في وقته أولى من حدوثه قبل ذلك أو بعده ; واستيفاء هذا في علم الكلام .\nالرابعة : قوله تعالى : وجنات من أعناب وقرأ الحسن \" وجنات \" بكسر التاء ، على التقدير : وجعل فيها جنات ، فهو محمول على قوله : \" وجعل فيها رواسي \" . ويجوز أن تكون مجرورة على الحمل على \" كل \" التقدير : ومن كل الثمرات ، ومن جنات . الباقون \" جنات \" بالرفع على تقدير : وبينهما جنات .\n\" وزرع ونخيل صنوان وغير صنوان \" بالرفع . ابن كثير وأبو عمرو وحفص عطفا على الجنات ; أي على تقدير : وفي الأرض زرع ونخيل . وخفضها الباقون نسقا على الأعناب ; فيكون الزرع والنخيل من الجنات ; ويجوز أن يكون معطوفا على \" كل \" حسب ما تقدم في \" وجنات \" . وقرأ مجاهد والسلمي وغيرهما \" صنوان \" بضم الصاد ، الباقون بالكسر ; وهما لغتان ; وهما جمع صنو ، وهي النخلات والنخلتان ، يجمعهن أصل واحد ، وتتشعب منه رءوس فتصير نخيلا ; نظيرها قنوان ، واحدها قنو وروى أبو إسحاق عن البراء قال : الصنوان المجتمع ، وغير الصنوان المتفرق ; النحاس : وكذلك هو في اللغة ; يقال للنخلة إذا كانت فيها نخلة أخرى أو أكثر صنوان . والصنو المثل ; ومنه قول النبي - صلى الله عليه وسلم - : عم الرجل صنو أبيه . ولا فرق فيها بين التثنية والجمع ولا بالإعراب ; فتعرب نون الجمع ، وتكسر نون التثنية ; قال الشاعر :\nالعلم والحلم خلتا كرم للمرء زين إذا هما اجتمعا صنوان لا يستتم حسنهما\nإلا بجمع ذا وذاك معا\nالخامسة : قوله تعالى : \" يسقى بماء واحد \" كصالح بني آدم وخبيثهم ; أبوهم واحد ; قاله النحاس والبخاري . وقرأ عاصم وابن عامر : يسقى بالياء ، أي يسقى ذلك كله . وقرأ الباقون بالتاء ، لقوله : جنات واختاره أبو حاتم وأبو عبيدة ; قال أبو عمرو : والتأنيث أحسن .\n\" ونفضل بعضها على بعض في الأكل \" ولم يقل بعضه . وقرأ حمزة والكسائي وغيرهما \" ويفضل \" بالياء ردا على قوله : \" يدبر الأمر \" و \" يفصل \" و \" يغشي \" الباقون بالنون على معنى : ونحن نفضل . وروى جابر بن عبد الله قال : سمعت النبي - صلى الله عليه وسلم - يقول لعلي - رضي الله عنه - : الناس من شجر شتى وأنا وأنت من شجرة واحدة ثم قرأ النبي - صلى الله عليه وسلم - وفي الأرض قطع متجاورات حتى بلغ قوله : يسقى بماء واحد و \" الأكل \" الثمر . قال ابن عباس : يعني الحلو والحامض والفارسي والدقل . وروي مرفوعا من حديث أبي هريرة ( أن رسول الله - صلى الله عليه وسلم - قال في قوله تعالى : \" ونفضل بعضها على بعض في الأكل \" قال : الفارسي والدقل والحلو والحامض ) ذكره الثعلبي . قال الحسن : المراد بهذه الآية المثل ; ضربه الله تعالى لبني آدم ، أصلهم واحد ، وهم مختلفون في الخير والشر . والإيمان والكفر ، كاختلاف الثمار التي تسقى بماء واحد ; ومنه قول الشاعر :\nالناس كالنبت والنبت ألوان منها شجر الصندل والكافور والبان\nومنها شجر ينضح طول الدهر قطران\n\" إن في ذلك لآيات لقوم يعقلون \" أي لعلامات لمن كان له قلب يفهم عن الله تعالى .\n                                    ",
      "saadi": "وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤\n                                        \n                                        \n                                        \n                                        ومن الآيات على كمال قدرته وبديع صنعته أن جعل { فِي الْأَرْضِ قِطَعٌ مُتَجَاوِرَاتٌ وَجَنَّاتٌ } فيها أنواع الأشجار { مِنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ } وغير ذلك، والنخيل التي بعضها { صِنْوَانٌ } أي: عدة أشجار في أصل واحد، { وَغَيْرُ صِنْوَانٍ } بأن كان كل شجرة على حدتها، والجميع { يُسْقَى بِمَاءٍ وَاحِدٍ } وأرضه واحدة { وَنُفَضِّلُ بَعْضَهَا عَلَى بَعْضٍ فِي الْأُكُلِ } لونا وطعما ونفعا ولذة؛ فهذه أرض طيبة تنبت الكلأ والعشب الكثير والأشجار والزروع، وهذه أرض تلاصقها لا تنبت كلأ ولا تمسك ماء، وهذه تمسك الماء ولا تنبت الكلأ، وهذه تنبت الزرع والأشجار ولا تنبت الكلأ، وهذه الثمرة حلوة وهذه مرة وهذه بين ذلك.\nفهل هذا التنوع في ذاتها وطبيعتها؟ أم ذلك تقدير العزيز الرحيم؟\n{ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ } أي: لقوم لهم عقول تهديهم إلى ما ينفعهم، وتقودهم إلى ما يرشدهم ويعقلون عن الله وصاياه وأوامره ونواهيه، وأما أهل الإعراض، وأهل البلادة فهم في ظلماتهم يعمهون، وفي غيهم يترددون، لا يهتدون إلى ربهم سبيلا ولا يعون له قيلا.\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Ar-Ra'd.html",
    "contnent": "۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥",
    "tafsier": {
      "ibnkther": "۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥\n                                    \n                                    \n                                    يقول تعالى لرسوله محمد ، صلوات الله وسلامه عليه : ( وإن تعجب ) من تكذيب هؤلاء المشركين بأمر المعاد مع ما يشاهدونه من آيات الله سبحانه ودلالاته في خلقه على أنه القادر على ما يشاء ، ومع ما يعترفون به من أنه ابتدأ خلق الأشياء ، فكونها بعد أن لم تكن شيئا مذكورا ، ثم هم بعد هذا يكذبون خبره في أنه سيعيد العالمين خلقا جديدا ، وقد اعترفوا وشاهدوا ما هو أعجب مما كذبوا به ، فالعجب من قولهم : ( أئذا كنا ترابا أئنا لفي خلق جديد ) وقد علم كل عالم وعاقل أن خلق السماوات والأرض أكبر من خلق الناس ، وأن من بدأ الخلق فالإعادة سهلة عليه ، كما قال تعالى : ( أولم يروا أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير )\nثم نعت المكذبين بهذا فقال : ( أولئك الذين كفروا بربهم وأولئك الأغلال في أعناقهم ) أي : يسحبون بها في النار ، ( وأولئك أصحاب النار هم فيها خالدون ) أي : ماكثون فيها أبدا ، لا يحولون عنها ولا يزولون .\n                                    ",
      "qortoby": "۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥\n                                    \n                                    \n                                    قوله تعالى : وإن تعجب فعجب قولهم أئذا كنا ترابا أئنا لفي خلق جديد أولئك الذين كفروا بربهم وأولئك الأغلال في أعناقهم وأولئك أصحاب النار هم فيها خالدون\nقوله تعالى : وإن تعجب فعجب قولهم أي إن تعجب يا محمد من تكذيبهم لك بعدما كنت عندهم الصادق الأمين فأعجب منه تكذيبهم بالبعث ; والله تعالى لا يتعجب ، ولا يجوز عليه التعجب ; لأنه تغير النفس بما تخفى أسبابه ، وإنما ذكر ذلك ليتعجب منه نبيه والمؤمنون . وقيل المعنى : أي إن عجبت يا محمد من إنكارهم الإعادة مع إقرارهم بأني خالق السماوات والأرض والثمار المختلفة من الأرض الواحدة فقولهم عجب يعجب منه الخلق ; لأن الإعادة في معنى الابتداء . وقيل : الآية في منكري الصانع ; أي إن تعجب من إنكارهم الصانع مع الأدلة الواضحة بأن المتغير لا بد له من مغير فهو محل التعجب ; ونظم الآية يدل على الأول والثاني ; لقوله : أئذا كنا ترابا أي أنبعث إذا كنا ترابا ؟ !\n\" أئنا لفي خلق جديد \" وقرئ \" إنا \" .\nو \" الأغلال \" جمع غل ; وهو طوق تشد به اليد إلى العنق ، أي يغلون يوم القيامة ; بدليل قوله : إذ الأغلال في أعناقهم إلى قوله : ثم في النار يسجرون . وقيل : الأغلال أعمالهم السيئة التي هي لازمة لهم .\n                                    ",
      "saadi": "۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥\n                                        \n                                        \n                                        \n                                        يحتمل أن معنى قوله { وَإِنْ تَعْجَبْ } من عظمة الله تعالى وكثرة أدلة توحيده، فإن العجب -مع هذا- إنكار المكذبين وتكذيبهم بالبعث، وقولهم { أَئِذَا كُنَّا تُرَابًا أَئِنَّا لَفِي خَلْقٍ جَدِيدٍ } أي: هذا بعيد في غاية الامتناع بزعمهم، أنهم بعد ما كانوا ترابا، أن الله يعيدهم، فإنهم -من جهلهم- قاسوا قدرة الخالق بقدرة المخلوق.\nفلما رأوا هذا ممتنعا في قدرة المخلوق ظنوا أنه ممتنع على قدرة الخالق، ونسوا أن الله خلقهم أول مرة ولم يكونوا شيئا.\nويحتمل أن معناه: وإن تعجب من قولهم وتكذيبهم للبعث، فإن ذلك من العجائب، فإن الذي توضح له الآيات، ويرى من الأدلة القاطعة على البعث ما لا يقبل الشك والريب، ثم ينكر ذلك فإن قوله من العجائب.\nولكن ذلك لا يستغرب على { الَّذِينَ كَفَرُوا بِرَبِّهِمْ } وجحدوا وحدانيته، وهي أظهر الأشياء وأجلاها، { وَأُولَئِكَ الْأَغْلَالُ } المانعة لهم من الهدى { فِي أَعْنَاقِهِمْ } حيث دعوا إلى الإيمان فلم يؤمنوا، وعرض عليهم الهدى فلم يهتدوا، فقلبت قلوبهم وأفئدتهم عقوبة على أنهم لم يؤمنوا به أول مرة، { وَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ } لا يخرجون منها أبدا.\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ ٦",
    "tafsier": {
      "ibnkther": "وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ ٦\n                                    \n                                    \n                                    يقول تعالى : ( ويستعجلونك ) أي : هؤلاء المكذبون ( بالسيئة قبل الحسنة ) أي : بالعقوبة ، كما أخبر عنهم في قوله : ( وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون لو ما تأتينا بالملائكة إن كنت من الصادقين ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين ) [ الحجر : 6 - 8 ] وقال تعالى : ( ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب وليأتينهم بغتة وهم لا يشعرون يستعجلونك بالعذاب وإن جهنم لمحيطة بالكافرين ) [ العنكبوت : 53 ، 54 ] وقال : ( سأل سائل بعذاب واقع ) [ المعارج : 1 ] وقال : ( يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق ) [ الشورى : 18 ] ( وقالوا ربنا عجل لنا قطنا قبل يوم الحساب ) أي : حسابنا وعقابنا ، كما قال مخبرا عنهم : ( وإذ قالوا اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم ) [ الأنفال : 32 ] فكانوا يطلبون من الرسول أن يأتيهم بعذاب الله ، وذلك من شدة تكذيبهم وكفرهم وعنادهم .\nقال الله تعالى : ( وقد خلت من قبلهم المثلات ) أي : قد أوقعنا نقمتنا بالأمم الخالية وجعلناهم مثلة وعبرة وعظة لمن اتعظ بهم .\nثم أخبر تعالى أنه لولا حلمه وعفوه [ وغفره ] لعاجلهم بالعقوبة ، كما قال تعالى : ( ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة ) [ فاطر : 45 ] .\nوقال تعالى في هذه الآية الكريمة : ( وإن ربك لذو مغفرة للناس على ظلمهم ) أي : إنه ذو عفو وصفح وستر للناس مع أنهم يظلمون ويخطئون بالليل والنهار . ثم قرن هذا الحكم بأنه شديد العقاب ، ليعتدل الرجاء والخوف ، كما قال تعالى : ( فإن كذبوك فقل ربكم ذو رحمة واسعة ولا يرد بأسه عن القوم المجرمين ) [ الأنعام : 147 ] وقال : ( إن ربك لسريع العقاب وإنه لغفور رحيم ) [ الأعراف : 167 ] وقال : ( نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم ) [ الحجر : 49 ، 50 ] إلى أمثال ذلك من الآيات التي تجمع الرجاء والخوف .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا موسى بن إسماعيل ، حدثنا حماد ، عن علي بن زيد ، عن سعيد بن المسيب قال : لما نزلت هذه الآية : ( وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب ) قال رسول الله ، صلى الله عليه وسلم : \" لولا عفو الله وتجاوزه ، ما هنأ أحدا العيش ولولا وعيده وعقابه ، لاتكل كل أحد \" .\nوروى الحافظ ابن عساكر في ترجمة الحسن بن عثمان أبي حسان الزيادي : أنه رأى رب العزة في النوم - ورسول الله صلى الله عليه وسلم - واقف بين يديه يشفع في رجل من أمته ، فقال له : ألم يكفك أني أنزلت عليك في سورة الرعد : ( وإن ربك لذو مغفرة للناس على ظلمهم ) ؟ قال : ثم انتبهت .\n                                    ",
      "qortoby": "وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ ٦\n                                    \n                                    \n                                    قوله : ويستعجلونك بالسيئة قبل الحسنة وقد خلت من قبلهم المثلات وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب\nقوله تعالى : ويستعجلونك بالسيئة قبل الحسنة أي لفرط إنكارهم وتكذيبهم يطلبون العذاب ; قيل هو قولهم : اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء . قال قتادة : طلبوا العقوبة قبل العافية ; وقد حكم سبحانه بتأخير العقوبة عن هذه الأمة إلى يوم القيامة . وقيل : قبل الحسنة أي قبل الإيمان الذي يرجى به الأمان والحسنات .\nو \" المثلات \" ; الواحدة مثلة . وروي عن الأعمش أنه قرأ \" المثلات \" بضم الميم وإسكان الثاء ; وهذا جمع مثلة ، ويجوز \" المثلات \" تبدل من الضمة فتحة لثقلها ، وقيل : يؤتى بالفتحة عوضا من الهاء . وروي عن الأعمش أنه قرأ \" المثلات \" بفتح الميم وإسكان الثاء ; فهذا جمع مثلة ، ثم حذف الضمة لثقلها ; ذكره جميعه النحاس - رحمه الله - . وعلى قراءة الجماعة واحده مثلة ، نحو صدقة وصدقة ; وتميم تضم الثاء والميم جميعا ، واحدها على لغتهم مثلة ، بضم الميم وجزم الثاء ; مثل : غرفة وغرفات ، والفعل منه مثلت به أمثل مثلا ، بفتح الميم وسكون الثاء .\nوإن ربك لذو مغفرة أي لذو تجاوز عن المشركين إذا آمنوا ، وعن المذنبين إذا تابوا . وقال ابن عباس : أرجى آية في كتاب الله تعالى وإن ربك لذو مغفرة للناس على ظلمهم . \" وإن ربك لشديد العقاب \" إذا أصروا على الكفر . وروى حماد بن سلمة عن علي بن زيد عن سعيد بن المسيب قال : لما نزلت : وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب قال رسول الله - صلى الله عليه وسلم - : لولا عفو الله ورحمته وتجاوزه لما هنأ أحدا عيش ولولا عقابه ووعيده وعذابه لاتكل كل أحد .\n                                    ",
      "saadi": "وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ ٦\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن جهل المكذبين لرسوله المشركين به، الذين وعظوا فلم يتعظوا، وأقيمت عليهم الأدلة فلم ينقادوا لها، بل جاهروا بالإنكار، واستدلوا بحلم [الله] الواحد القهار عنهم، وعدم معاجلتهم بذنوبهم أنهم على حق، وجعلوا يستعجلون الرسول بالعذاب، ويقول قائلهم: { اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم }\n{ و } الحال أنه { قَدْ خَلَتْ مِنْ قَبْلِهِمُ الْمَثُلَاتُ } أي: وقائع الله وأيامه في الأمم المكذبين، أفلا يتفكرون في حالهم ويتركون جهلهم { وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلَى ظُلْمِهِمْ } أي: لا يزال خيره إليهم وإحسانه وبره وعفوه نازلا إلى العباد، وهم لا يزال شرهم وعصيانهم إليه صاعدًا.\nيعصونه فيدعوهم إلى بابه، ويجرمون فلا يحرمهم خيره وإحسانه، فإن تابوا إليه فهو حبيبهم لأنه يحب التوابين، ويحب المتطهرين وإن لم يتوبوا فهو طبيبهم، يبتليهم بالمصائب، ليطهرهم من المعايب { قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم }\n{ وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ } على من لم يزل مصرا على الذنوب، قد أبى التوبة والاستغفار والالتجاء إلى العزيز الغفار، فليحذر العباد عقوباته بأهل الجرائم، فإن أخذه أليم شديد.\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ إِنَّمَآ أَنتَ مُنذِرٞۖ وَلِكُلِّ قَوۡمٍ هَادٍ ٧",
    "tafsier": {
      "ibnkther": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ إِنَّمَآ أَنتَ مُنذِرٞۖ وَلِكُلِّ قَوۡمٍ هَادٍ ٧\n                                    \n                                    \n                                    يقول تعالى إخبارا عن المشركين أنهم يقولون كفرا وعنادا : لولا يأتينا بآية من ربه كما أرسل الأولون ، كما تعنتوا عليه أن يجعل لهم الصفا ذهبا ، وأن يزيل عنهم الجبال ، ويجعل مكانها مروجا وأنهارا ، قال الله تعالى : ( وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا ) [ الإسراء : 59 ] .\nقال الله تعالى : ( إنما أنت منذر ) أي : إنما عليك أن تبلغ رسالة الله التي أمرك بها ، ( ليس عليك هداهم ولكن الله يهدي من يشاء ) [ البقرة : 272 ] .\nوقوله : ( ولكل قوم هاد ) قال علي بن أبي طلحة ، عن ابن عباس ، أي : ولكل قوم داع .\nوقال العوفي ، عن ابن عباس في تفسيرهما : يقول الله تعالى : أنت يا محمد منذر ، وأنا هادي كل قوم ، وكذا قال مجاهد ، وسعيد بن جبير ، والضحاك .\nوعن مجاهد : ( ولكل قوم هاد ) أي : نبي . كما قال : ( وإن من أمة إلا خلا فيها نذير ) [ فاطر : 24 ] وبه قال قتادة ، وعبد الرحمن بن زيد .\nوقال أبو صالح ، ويحيى بن رافع : ( ولكل قوم هاد ) أي : قائد .\nوقال أبو العالية : الهادي : القائد ، والقائد : الإمام ، والإمام : العمل .\nوعن عكرمة ، وأبي الضحى : ( ولكل قوم هاد ) قالا هو محمد [ رسول الله ] صلى الله عليه وسلم .\nوقال مالك : ( ولكل قوم هاد ) من يدعوهم إلى الله ، عز وجل .\nوقال أبو جعفر بن جرير : حدثني أحمد بن يحيى الصوفي ، حدثنا الحسن بن الحسين الأنصاري ، حدثنا معاذ بن مسلم بياع الهروي ، عن عطاء بن السائب ، عن سعيد بن جبير ، عن ابن عباس ، رضي الله عنهما ، قال : لما نزلت : ( إنما أنت منذر ولكل قوم هاد ) قال : وضع رسول الله - صلى الله عليه وسلم - يده على صدره ، وقال : \" أنا المنذر ، ولكل قوم هاد \" . وأومأ بيده إلى منكب علي ، فقال : \" أنت الهادي يا علي ، بك يهتدي المهتدون من بعدي \" .\nوهذا الحديث فيه نكارة شديدة .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا عثمان بن أبي شيبة ، حدثنا المطلب بن زياد ، عن السدي ، عن عبد خير ، عن علي : ( ولكل قوم هاد ) قال : الهادي : رجل من بني هاشم . قال الجنيد هو علي بن أبي طالب ، رضي الله عنه .\nقال ابن أبي حاتم : وروي عن ابن عباس ، في إحدى الروايات ، وعن أبي جعفر محمد بن علي ، نحو ذلك .\n                                    ",
      "qortoby": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ إِنَّمَآ أَنتَ مُنذِرٞۖ وَلِكُلِّ قَوۡمٍ هَادٍ ٧\n                                    \n                                    \n                                    قوله تعالى : ويقول الذين كفروا لولا أي هلا \" أنزل عليه آية من ربه \" . لما اقترحوا الآيات وطلبوها قال الله تعالى لنبيه - صلى الله عليه وسلم - : \" إنما أنت منذر \" أي معلم . \" ولكل قوم هاد \" أي نبي يدعوهم إلى الله . وقيل : الهادي الله ; أي عليك الإنذار ، والله هادي كل قوم إن أراد هدايتهم .\n                                    ",
      "saadi": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ إِنَّمَآ أَنتَ مُنذِرٞۖ وَلِكُلِّ قَوۡمٍ هَادٍ ٧\n                                        \n                                        \n                                        \n                                        أي: ويقترح الكفار عليك من الآيات، التي يعينونها ويقولون: { لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ } ويجعلون هذا القول منهم، عذرا لهم في عدم الإجابة إلى الرسول، والحال أنه منذر ليس له من الأمر شيء، والله هو الذي ينزل الآيات.\nوقد أيده بالأدلة البينات التي لا تخفى على أولي الألباب، وبها يهتدي من قصده الحق، وأما الكافر الذي -من ظلمه وجهله- يقترح على الله الآيات فهذا اقتراح منه باطل وكذب وافتراء\nفإنه لو جاءته أي آية كانت لم يؤمن ولم ينقد؛ لأنه لم يمتنع من الإيمان، لعدم ما يدله على صحته وإنما ذلك لهوى نفسه واتباع شهوته { وَلِكُلِّ قَوْمٍ هَادٍ } أي: داع يدعوهم إلى الهدى من الرسل وأتباعهم، ومعهم من الأدلة والبراهين ما يدل على صحة ما معهم من الهدى.\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Ar-Ra'd.html",
    "contnent": "ٱللَّهُ يَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَيۡءٍ عِندَهُۥ بِمِقۡدَارٍ ٨",
    "tafsier": {
      "ibnkther": "ٱللَّهُ يَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَيۡءٍ عِندَهُۥ بِمِقۡدَارٍ ٨\n                                    \n                                    \n                                    يخبر تعالى عن تمام علمه الذي لا يخفى عليه شيء ، وأنه محيط بما تحمله الحوامل من كل إناث الحيوانات ، كما قال تعالى : ( ويعلم ما في الأرحام ) [ لقمان : 34 ] أي : ما حملت من ذكر أو أنثى ، أو حسن أو قبيح ، أو شقي أو سعيد ، أو طويل العمر أو قصيره ، كما قال تعالى : ( هو أعلم بكم إذ أنشأكم من الأرض وإذ أنتم أجنة في بطون أمهاتكم فلا تزكوا أنفسكم هو أعلم بمن اتقى ) [ النجم : 32 ] .\nوقال تعالى : ( يخلقكم في بطون أمهاتكم خلقا من بعد خلق في ظلمات ثلاث ) [ الزمر : 6 ] أي : خلقكم طورا من بعد طور ، كما قال تعالى : ( ولقد خلقنا الإنسان من سلالة من طين ثم جعلناه نطفة في قرار مكين ثم خلقنا النطفة علقة فخلقنا العلقة مضغة فخلقنا المضغة عظاما فكسونا العظام لحما ثم أنشأناه خلقا آخر فتبارك الله أحسن الخالقين ) [ المؤمنون : 12 - 14 ] وفي الصحيحين عن ابن مسعود قال : قال رسول الله ، صلى الله عليه وسلم : \" إن خلق أحدكم يجمع في بطن أمه أربعين يوما ، ثم يكون علقة مثل ذلك ، ثم يكون مضغة مثل ذلك ، ثم يبعث إليه ملك فيؤمر بأربع كلمات : يكتب رزقه ، وعمره ، وعمله ، وشقي أو سعيد \" .\nوفي الحديث الآخر : \" فيقول الملك : أي رب ، أذكر أم أنثى ؟ أي رب ، أشقي أم سعيد ؟ فما الرزق ؟ فما الأجل ؟ فيقول الله ويكتب الملك \" .\nوقوله : ( وما تغيض الأرحام وما تزداد ) قال البخاري : حدثنا إبراهيم بن المنذر ، حدثنا معن ، حدثنا مالك ، عن عبد الله بن دينار ، عن ابن عمر ; أن رسول الله - صلى الله عليه وسلم - قال : \" مفاتيح الغيب خمس لا يعلمها إلا الله : لا يعلم ما في غد إلا الله ، ولا يعلم ما تغيض الأرحام إلا الله ، ولا يعلم متى يأتي المطر أحد إلا الله ، ولا تدري نفس بأي أرض تموت ، ولا يعلم متى تقوم الساعة إلا الله \" .\nوقال العوفي ، عن ابن عباس : ( وما تغيض الأرحام ) يعني : السقط ( وما تزداد ) يقول : ما زادت الرحم في الحمل على ما غاضت حتى ولدته تماما . وذلك أن من النساء من تحمل عشرة أشهر ، ومنهن من تحمل تسعة أشهر ، ومنهن من تزيد في الحمل ، ومنهن من تنقص ، فذلك الغيض والزيادة التي ذكر الله تعالى ، وكل ذلك بعلمه تعالى .\nوقال الضحاك ، عن ابن عباس في قوله : ( وما تغيض الأرحام وما تزداد ) قال : ما نقصت من تسعة وما زاد عليها .\nوقال الضحاك : وضعتني أمي وقد حملتني في بطنها سنتين ، وولدتني وقد نبتت ثنيتي .\nوقال ابن جريج ، عن جميلة بنت سعد ، عن عائشة قالت : لا يكون الحمل أكثر من سنتين ، قدر ما يتحرك ظل مغزل .\nوقال مجاهد : ( وما تغيض الأرحام وما تزداد ) قال : ما ترى من الدم في حملها ، وما تزداد على تسعة أشهر . وبه قال عطية العوفي وقتادة ، والحسن البصري ، والضحاك .\nوقال مجاهد أيضا : إذا رأت المرأة الدم دون التسعة زاد على التسعة ، مثل أيام الحيض . وقاله عكرمة ، وسعيد بن جبير ، وابن زيد .\nوقال مجاهد أيضا : ( وما تغيض الأرحام ) إراقة المرأة حتى يخس الولد ( وما تزداد ) إن لم تهرق المرأة تم الولد وعظم .\nوقال مكحول : الجنين في بطن أمه لا يطلب ، ولا يحزن ولا يغتم ، وإنما يأتيه رزقه في بطن أمه من دم حيضتها فمن ثم لا تحيض الحامل . فإذا وقع إلى الأرض استهل ، واستهلاله استنكار لمكانه ، فإذا قطعت سرته حول الله رزقه إلى ثديي أمه حتى لا يطلب ولا يحزن ولا يغتم ، ثم يصير طفلا يتناول الشيء بكفه فيأكله ، فإذا هو بلغ قال : هو الموت أو القتل ، أنى لي بالرزق ؟ فيقول مكحول : يا ويلك ! غذاك وأنت في بطن أمك ، وأنت طفل صغير ، حتى إذا اشتددت وعقلت قلت : هو الموت أو القتل ، أنى لي بالرزق ؟ ثم قرأ مكحول : ( الله يعلم ما تحمل كل أنثى وما تغيض الأرحام وما تزداد وكل شيء عنده بمقدار )\nوقال قتادة : ( وكل شيء عنده بمقدار ) أي : بأجل ، حفظ أرزاق خلقه وآجالهم ، وجعل لذلك أجلا معلوما .\nوفي الحديث الصحيح : أن إحدى بنات النبي - صلى الله عليه وسلم - بعثت إليه : أن ابنا لها في الموت ، وأنها تحب أن يحضره . فبعث إليها يقول : \" إن لله ما أخذ ، وله ما أعطى ، وكل شيء عنده بأجل مسمى ، فمروها فلتصبر ولتحتسب \" الحديث بتمامه\n                                    ",
      "qortoby": "ٱللَّهُ يَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَيۡءٍ عِندَهُۥ بِمِقۡدَارٍ ٨\n                                    \n                                    \n                                    قوله تعالى : الله يعلم ما تحمل كل أنثى وما تغيض الأرحام وما تزداد وكل شيء عنده بمقدار\nفيه ثمان مسائل :\nالأولى : قوله تعالى : الله يعلم ما تحمل كل أنثى أي من ذكر وأنثى ، صبيح وقبيح ، صالح وطالح ; وقد تقدم في سورة \" الأنعام \" أن الله سبحانه منفرد بعلم الغيب وحده لا شريك له ; وذكرنا هناك حديث البخاري عن ابن عمر أن رسول الله - صلى الله عليه وسلم - قال : مفاتيح الغيب خمس الحديث . وفيه لا يعلم ما تغيض الأرحام إلا الله .\nواختلف العلماء في تأويل قوله : وما تغيض الأرحام وما تزداد فقال قتادة : المعنى ما تسقط قبل التسعة الأشهر ، وما تزداد فوق التسعة ; وكذلك قال ابن عباس . وقال مجاهد : إذا حاضت المرأة في حملها كان ذلك نقصانا في ولدها ; فإن زادت على التسعة كان تماما لما نقص ; وعنه : الغيض ما تنقصه الأرحام من الدم ، والزيادة ما تزداد منه . وقيل : الغيض والزيادة . يرجعان إلى الولد ، كنقصان إصبع أو غيرها ، وزيادة إصبع أو غيرها . وقيل : الغيض انقطاع دم الحيض . \" وما تزداد \" بدم النفاس بعد الوضع .\nالثانية : في هذه الآية دليل على أن الحامل تحيض ; وهو مذهب مالك والشافعي في أحد قوليه . وقال عطاء والشعبي وغيرهما : لا تحيض ; وبه قال أبو حنيفة ; ودليله الآية . قال ابن عباس في تأويلها : إنه حيض الحبالى ، وكذلك روي عن عكرمة ومجاهد ; وهو قول عائشة ، وأنها كانت تفتي النساء الحوامل إذا حضن أن يتركن الصلاة ; والصحابة إذ ذاك متوافرون ، ولم ينكر منهم أحد عليها ، فصار كالإجماع ; قاله ابن القصار . وذكر أن رجلين ، تنازعا ولدا ، فترافعا إلى عمر - رضي الله عنه - فعرضه على القافة ، فألحقه القافة بهما ، فعلاه عمر بالدرة ، وسأل نسوة من قريش فقال : انظرن ما شأن هذا الولد ؟ فقلن : إن الأول خلا بها وخلاها ، فحاضت على الحمل ، فظنت أن عدتها انقضت ; فدخل بها الثاني ، فانتعش الولد بماء الثاني ; فقال عمر : الله أكبر ! وألحقه بالأول ، ولم يقل إن الحامل لا تحيض ، ولا قال ذلك أحد من الصحابة ; فدل أنه إجماع ، والله أعلم . واحتج المخالف بأن قال لو كانت الحامل تحيض ، وكان ما تراه المرأة من الدم حيضا لما صح استبراء الأمة بحيض ; وهو إجماع وروي عن مالك في كتاب محمد ما يقتضي أنه ليس بحيض .\nالثالثة : في هذه الآية دليل على أن الحامل قد تضع حملها لأقل من تسعة أشهر وأكثر ، وأجمع العلماء على أن أقل الحمل ستة أشهر ، وأن عبد الملك بن مروان ولد لستة أشهر .\nالرابعة : وهذه الستة الأشهر هي بالأهلة كسائر أشهر الشريعة ; ولذلك قد روي في المذهب عن بعض أصحاب مالك ، وأظنه في كتاب ابن حارث أنه إن نقص عن الأشهر الستة ثلاثة أيام فإن الولد يلحق لعلة نقص الأشهر وزيادتها ; حكاه ابن عطية .\nالخامسة : واختلف العلماء في أكثر الحمل ; فروى ابن جريج عن جميلة بنت سعد عن عائشة قالت : يكون الحمل أكثر من سنتين قدر ما يتحول ظل المغزل ; ذكره الدارقطني . وقالت جميلة بنت سعد - أخت عبيد بن سعد ، وعن الليث بن سعد - إن أكثره ثلاث سنين . وعن الشافعي أربع سنين ; وروي عن مالك في إحدى روايتيه ، والمشهور عنه خمس سنين ; وروي عنه لا حد له ، ولو زاد على العشرة الأعوام ; وهي الرواية الثالثة عنه . وعن الزهري ست وسبع . قال أبو عمر : ومن الصحابة من يجعله إلى سبع ; والشافعي : مدة الغاية منها أربع سنين . والكوفيون يقولون : سنتان لا غير . ومحمد بن عبد الحكم يقول : سنة لا أكثر . وداود يقول : تسعة أشهر ، لا يكون عنده حمل أكثر منها . قال أبو عمر : وهذه مسألة لا أصل لها إلا الاجتهاد ، والرد إلى ما عرف من أمر النساء وبالله التوفيق . روى الدارقطني عن الوليد بن مسلم قال : قلت لمالك بن أنس إني حدثت عن عائشة أنها قالت : لا تزيد المرأة في حملها على سنتين قدر ظل المغزل ، فقال : سبحان الله ! من يقول هذا ؟ ! هذه جارتنا امرأة محمد بن عجلان ، تحمل وتضع في أربع سنين ، امرأة صدق ، وزوجها رجل صدق ; حملت ثلاثة أبطن في اثنتي عشرة سنة ، تحمل كل بطن أربع سنين . وذكره عن المبارك بن مجاهد قال : مشهور عندنا كانت امرأة محمد بن عجلان تحمل وتضع في أربع سنين ، وكانت تسمى حاملة الفيل . وروى أيضا قال : بينما مالك بن دينار يوما جالس إذ جاءه رجل فقال : يا أبا يحيى ! ادع لامرأة حبلى منذ أربع سنين قد أصبحت في كرب شديد ; فغضب مالك وأطبق المصحف ثم قال : ما يرى هؤلاء القوم إلا أنا أنبياء ! ثم قرأ ، ثم دعا ، ثم قال : اللهم هذه المرأة إن كان في بطنها ريح فأخرجه عنها الساعة ، وإن كان في بطنها جارية فأبدلها بها غلاما ، فإنك تمحو ما تشاء وتثبت ، وعندك أم الكتاب ، ورفع مالك يده ، ورفع الناس أيديهم ، وجاء الرسول إلى الرجل فقال : أدرك امرأتك ، فذهب الرجل ، فما حط مالك يده حتى طلع الرجل من باب المسجد على رقبته غلام جعد قطط ، ابن أربع سنين ، قد استوت أسنانه ، ما قطعت سراره ; وروي أيضا أن رجلا جاء إلى عمر بن الخطاب فقال : يا أمير المؤمنين ! إني غبت عن امرأتي سنتين فجئت وهي حبلى ; فشاور عمر الناس في رجمها ، فقال معاذ بن جبل : يا أمير المؤمنين ! إن كان لك عليها سبيل فليس لك على ما في بطنها سبيل ; فاتركها حتى تضع ، فتركها ، فوضعت غلاما قد خرجت ثنيتاه ; فعرف الرجل الشبه فقال : ابني ورب الكعبة ! ; فقال عمر : عجزت النساء أن يلدن مثل معاذ ; لولا معاذ لهلك عمر . وقال الضحاك : وضعتني أمي وقد حملت بي في بطنها سنتين ، فولدتني وقد خرجت سني . ويذكر عن مالك أنه حمل به في بطن أمه سنتين ، وقيل : ثلاث سنين . ويقال : إن محمد بن عجلان مكث في بطن أمه ثلاث سنين ، فماتت به وهو يضطرب اضطرابا شديدا ، فشق بطنها وأخرج وقد نبتت أسنانه . وقال حماد بن سلمة : إنما سمي هرم بن حيان هرما لأنه بقي في بطن أمه أربع سنين . وذكر الغزنوي أن الضحاك ولد لسنتين ، وقد طلعت سنه فسمي ضحاكا . وقال عباد بن العوام : ولدت جارة لنا لأربع سنين غلاما شعره إلى منكبيه ، فمر به طير فقال : كش .\nالسادسة : قال ابن خويز منداد : أقل الحيض والنفاس وأكثره وأقل الحمل وأكثره مأخوذ من طريق الاجتهاد ; لأن علم ذلك استأثر الله به ، فلا يجوز أن يحكم في شيء منه إلا بقدر ما أظهره لنا ، ووجد ظاهرا في النساء نادرا أو معتادا ; ولما وجدنا امرأة قد حملت أربع سنين وخمس سنين حكمنا بذلك ، والنفاس والحيض لما لم نجد فيه أمرا مستقرأ رجعنا فيه إلى ما يوجد في النادر منهن .\nالسابعة : قال ابن العربي : نقل بعض المتساهلين من المالكيين أن أكثر الحمل تسعة أشهر ; وهذا ما لم ينطق به قط إلا مالكي ، وهم الطبائعيون الذين يزعمون أن مدبر الحمل في الرحم الكواكب السبعة ; تأخذه شهرا شهرا ، ويكون الشهر الرابع منها للشمس ; ولذلك يتحرك ويضطرب ، وإذا تكامل التداول في السبعة الأشهر بين الكواكب السبعة عاد في الشهر الثامن إلى زحل ، فيبقله ببرده ; فيا ليتني تمكنت من مناظرتهم أو مقاتلتهم ! ما بال المرجع بعد تمام الدور يكون إلى زحل دون غيره ؟ الله أخبركم بهذا أم على الله تفترون ؟ ! وإذا جاز أن يعود إلى اثنين منها لم لا يجوز أن يعود التدبير إلى ثلاث أو أربع ، أو يعود إلى جميعها مرتين أو ثلاثا ؟ ! ما هذا التحكم بالظنون الباطلة على الأمور الباطنة ! .\nالثامنة : قوله تعالى : وكل شيء عنده بمقدار يعني من النقصان والزيادة . ويقال : بمقدار قدر خروج الولد من بطن أمه ، وقدر مكثه في بطنها إلى خروجه . وقال قتادة : في الرزق والأجل . والمقدار القدر ; وعموم الآية يتناول كل ذلك ، والله سبحانه أعلم . قلت : هذه الآية تمدح الله سبحانه وتعالى بها بأنه عالم الغيب والشهادة\n                                    ",
      "saadi": "ٱللَّهُ يَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَيۡءٍ عِندَهُۥ بِمِقۡدَارٍ ٨\n                                        \n                                        \n                                        \n                                        يخبر تعالى بعموم علمه وسعة اطلاعه وإحاطته بكل شيء فقال: { اللَّهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ أُنْثَى } من بني آدم وغيرهم، { وَمَا تَغِيضُ الْأَرْحَامُ } أي: تنقص مما فيها إما أن يهلك الحمل أو يتضاءل أو يضمحل { وَمَا تَزْدَادُ } الأرحام وتكبر الأجنة التي فيها، { وَكُلُّ شَيْءٍ عِنْدَهُ بِمِقْدَارٍ } لا يتقدم عليه ولا يتأخر ولا يزيد ولا ينقص إلا بما تقتضيه حكمته وعلمه.\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Ar-Ra'd.html",
    "contnent": "عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ ٩",
    "tafsier": {
      "ibnkther": "عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ ٩\n                                    \n                                    \n                                    وقوله : ( عالم الغيب والشهادة ) أي : يعلم كل شيء مما يشاهده العباد ومما يغيب عنهم ، ولا يخفى عليه منه شيء . ) الكبير ) الذي هو أكبر من كل شيء ، ( المتعال ) أي : على كل شيء ، قد أحاط بكل شيء علما ، وقهر كل شيء ، فخضعت له الرقاب ودان له العباد ، طوعا وكرها .\n                                    ",
      "qortoby": "عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ ٩\n                                    \n                                    \n                                    أي هو عالم بما غاب عن الخلق ، وبما شهدوه . فالغيب مصدر بمعنى الغائب . والشهادة مصدر بمعنى الشاهد ; فنبه سبحانه على انفراده بعلم الغيب ، والإحاطة بالباطن الذي يخفى على الخلق ، فلا يجوز أن يشاركه في ذلك أحد ; فأما أهل الطب الذين يستدلون بالأمارات والعلامات فإن قطعوا بذلك فهو كفر ، وإن قالوا إنها تجربة تركوا وما هم عليه ، ولم يقدح ذلك في الممدوح ; فإن العادة يجوز انكسارها ، والعلم لا يجوز تبدله . و \" الكبير \" الذي كل شيء دونه . \" المتعال \" عما يقول المشركون ، المستعلي على كل شيء بقدرته وقهره ; وقد ذكرناهما في شرح الأسماء مستوفى ، والحمد لله .\n                                    ",
      "saadi": "عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ ٩\n                                        \n                                        \n                                        \n                                        فإنه { عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيرُ } في ذاته وأسمائه وصفاته { الْمُتَعَالِ } على جميع خلقه بذاته وقدرته وقهره.\n \n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Ar-Ra'd.html",
    "contnent": "سَوَآءٞ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۢ بِٱلَّيۡلِ وَسَارِبُۢ بِٱلنَّهَارِ ٠١",
    "tafsier": {
      "ibnkther": "سَوَآءٞ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۢ بِٱلَّيۡلِ وَسَارِبُۢ بِٱلنَّهَارِ ٠١\n                                    \n                                    \n                                    يخبر تعالى عن إحاطة علمه بجميع خلقه ، سواء منهم من أسر قوله أو جهر به ، فإنه يسمعه لا يخفى عليه شيء كما قال : ( وإن تجهر بالقول فإنه يعلم السر وأخفى ) [ طه : 7 ] وقال : ( ويعلم ما تخفون وما تعلنون ) [ النمل : 25 ] وقالت عائشة ، رضي الله عنها : سبحان الذي وسع سمعه الأصوات ، والله لقد جاءت المجادلة تشتكي زوجها إلى رسول الله - صلى الله عليه وسلم - وأنا في جنب البيت ، وإنه ليخفى علي بعض كلامها ، فأنزل الله : ( قد سمع الله قول التي تجادلك في زوجها وتشتكي إلى الله والله يسمع تحاوركما إن الله سميع بصير ) [ المجادلة : 1 ] .\nوقوله : ( ومن هو مستخف بالليل ) أي : مختف في قعر بيته في ظلام الليل ، ( وسارب بالنهار ) أي : ظاهر ماش في بياض النهار وضيائه ، فإن كليهما في علم الله على السواء ، كما قال تعالى : ( ألا حين يستغشون ثيابهم يعلم ما يسرون وما يعلنون ) [ هود : 5 ] وقال تعالى : ( وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه وما يعزب عن ربك من مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر إلا في كتاب مبين ) [ يونس : 61 ] .\n                                    ",
      "qortoby": "سَوَآءٞ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۢ بِٱلَّيۡلِ وَسَارِبُۢ بِٱلنَّهَارِ ٠١\n                                    \n                                    \n                                    قوله تعالى : سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار قوله تعالى : سواء منكم من أسر القول ومن جهر به إسرار القول : ما حدث به المرء نفسه ، والجهر ما حدث به غيره ; والمراد بذلك أن الله سبحانه يعلم ما أسره الإنسان من خير وشر ، كما يعلم ما جهر به من خير وشر . و \" منكم \" يحتمل أن يكون وصفا ل \" سواء \" التقدير : سر من أسر وجهر من جهر سواء منكم ; ويجوز أن يتعلق ب \" سواء \" على معنى : يستوي منكم ، كقولك : مررت بزيد . ويجوز أن يكون على تقدير : سر من أسر منكم وجهر من جهر منكم . ويجوز أن يكون التقدير : ذو سواء منكم من أسر القول ومن جهر به ، كما تقول : عدل زيد وعمرو أي ذوا عدل . وقيل : سواء أي مستو ، فلا يحتاج إلى تقدير حذف مضاف .\nومن هو مستخف بالليل وسارب بالنهار أي يستوي في علم الله السر والجهر ، والظاهر في الطرقات ، والمستخفي في الظلمات . وقال الأخفش وقطرب : المستخفي بالليل الظاهر ; ومنه خفيت الشيء وأخفيته أي أظهرته ; وأخفيت الشيء أي استخرجته ; ومنه قيل للنباش : المختفي . وقال امرؤ القيس :\nخفاهن من أنفاقهن كأنما خفاهن ودق من عشي مجلب\nوالسارب المتواري ، أي الداخل سربا ; ومنه قولهم : انسرب الوحشي إذا دخل في كناسه . وقال ابن عباس : مستخف مستتر ، وسارب ظاهر . مجاهد : مستخف بالمعاصي ، وسارب ظاهر . وقيل : معنى سارب ذاهب ; قال الكسائي : سرب يسرب سربا وسروبا إذا ذهب ; وقال الشاعر :\nوكل أناس قاربوا قيد فحلهم ونحن خلعنا قيده فهو سارب\nأي ذاهب . وقال أبو رجاء : السارب الذاهب على وجهه في الأرض ; قال الشاعر :\nأنى سربت وكنت غير سروب\nوقال القتبي : سارب بالنهار أي منصرف في حوائجه بسرعة ; من قولهم : انسرب الماء . وقال الأصمعي : خل سربه أي طريقه .\n                                    ",
      "saadi": "سَوَآءٞ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۢ بِٱلَّيۡلِ وَسَارِبُۢ بِٱلنَّهَارِ ٠١\n                                        \n                                        \n                                        \n                                        { سَوَاءٌ مِنْكُمْ } في علمه وسمعه وبصره.\n{ مَنْ أَسَرَّ الْقَوْلَ وَمَنْ جَهَرَ بِهِ وَمَنْ هُوَ مُسْتَخْفٍ بِاللَّيْلِ } أي: مستقر بمكان خفي فيه، { وَسَارِبٌ بِالنَّهَارِ } أي: داخل سربه في النهار والسرب هو ما يختفي فيه الإنسان إما جوف بيته أو غار أو مغارة أو نحو ذلك.\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Ar-Ra'd.html",
    "contnent": "لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ ١١",
    "tafsier": {
      "ibnkther": "لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ ١١\n                                    \n                                    \n                                    وقوله : ( له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله ) أي : للعبد ملائكة يتعاقبون عليه ، حرس بالليل وحرس بالنهار ، يحفظونه من الأسواء والحادثات ، كما يتعاقب ملائكة آخرون لحفظ الأعمال من خير أو شر ، ملائكة بالليل وملائكة بالنهار ، فاثنان عن اليمين و [ عن ] الشمال يكتبان الأعمال ، صاحب اليمين يكتب الحسنات ، وصاحب الشمال يكتب السيئات ، وملكان آخران يحفظانه ويحرسانه ، واحدا من ورائه وآخر من قدامه ، فهو بين أربعة أملاك بالنهار ، وأربعة آخرين بالليل بدلا حافظان وكاتبان ، كما جاء في الصحيح : \" يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار ، ويجتمعون في صلاة الصبح وصلاة العصر ، فيصعد إليه الذين باتوا فيكم فيسألهم وهو أعلم بكم : كيف تركتم عبادي ؟ فيقولون : أتيناهم وهم يصلون ، وتركناهم وهم يصلون \" وفي الحديث الآخر : \" إن معكم من لا يفارقكم إلا عند الخلاء وعند الجماع ، فاستحيوهم وأكرموهم \" . وقال علي بن أبي طلحة ، عن ابن عباس : ( له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله ) والمعقبات من أمر الله ، وهي الملائكة .\nوقال عكرمة ، عن ابن عباس : ( يحفظونه من أمر الله ) قال : ملائكة يحفظونه من بين يديه ومن خلفه ، فإذا جاء قدر الله خلوا عنه .\nوقال مجاهد : ما من عبد إلا له ملك موكل ، يحفظه في نومه ويقظته من الجن والإنس والهوام ، فما منها شيء يأتيه يريده إلا قال الملك : وراءك إلا شيء يأذن الله فيه فيصيبه .\nوقال الثوري عن حبيب بن أبي ثابت ، عن سعيد بن جبير ، عن ابن عباس : ( له معقبات من بين يديه ومن خلفه ) قال : ذلك ملك من ملوك الدنيا ، له حرس من دونه حرس .\nوقال العوفي ، عن ابن عباس : ( له معقبات من بين يديه ومن خلفه ) يعني : ولي الشيطان ، يكون عليه الحرس . وقال عكرمة في تفسيرها : هؤلاء الأمراء : المواكب من بين يديه ومن خلفه .\nوقال الضحاك : ( له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله ) قال : هو السلطان المحترس من أمر الله ، وهم أهل الشرك .\nوالظاهر ، والله أعلم ، أن مراد ابن عباس وعكرمة والضحاك بهذا أن حرس الملائكة للعبيد يشبه حرس هؤلاء لملوكهم وأمرائهم .\nوقد روى الإمام أبو جعفر بن جرير هاهنا حديثا غريبا جدا فقال :\nحدثني المثنى ، حدثنا إبراهيم بن عبد السلام بن صالح القشيري ، حدثنا علي بن جرير ، عن حماد بن سلمة ، عن عبد الحميد بن جعفر ، عن كنانة العدوي قال : دخل عثمان بن عفان على رسول الله صلى الله عليه وسلم . فقال : يا رسول الله ، أخبرني عن العبد ، كم معه من ملك ؟ فقال : \" ملك على يمينك على حسناتك ، وهو آمر على الذي على الشمال ، إذا عملت حسنة كتبت عشرا ، فإذا عملت سيئة قال الذي على الشمال للذي على اليمين : أكتب ؟ قال : لا لعله يستغفر الله ويتوب . فإذا قال ثلاثا قال : نعم ، اكتب أراحنا الله منه ، فبئس القرين . ما أقل مراقبته لله وأقل استحياءه منا \" . يقول الله : ( ما يلفظ من قول إلا لديه رقيب عتيد ) [ ق : 18 ] وملكان من بين يديك ومن خلفك ، يقول الله : ( له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله ) وملك قابض على ناصيتك ، فإذا تواضعت لله رفعك ، وإذا تجبرت على الله قصمك ، وملكان على شفتيك ، ليس يحفظان عليك إلا الصلاة على محمد - صلى الله عليه وسلم - وملك قائم على فيك لا يدع الحية أن تدخل في فيك ، وملكان على عينيك فهؤلاء عشرة أملاك على كل آدمي ينزلون ملائكة الليل على ملائكة النهار; لأن ملائكة الليل سوى ملائكة النهار ، فهؤلاء عشرون ملكا على كل آدمي وإبليس بالنهار وولده بالليل \" .\nقال الإمام أحمد ، رحمه الله : حدثنا أسود بن عامر ، حدثنا سفيان ، حدثني منصور ، عن سالم بن أبي الجعد عن أبيه ، عن عبد الله قال : قال رسول الله ، صلى الله عليه وسلم : \" ما منكم من أحد إلا وقد وكل به قرينه من الجن وقرينه من الملائكة \" . قالوا : وإياك يا رسول الله ، قال : \" وإياي ، ولكن أعانني الله عليه فلا يأمرني إلا بخير \" .\nانفرد بإخراجه مسلم .\nوقوله : ( يحفظونه من أمر الله ) قيل : المراد حفظهم له من أمر الله . رواه علي بن أبي طلحة ، وغيره ، عن ابن عباس . وإليه ذهب مجاهد ، وسعيد بن جبير ، وإبراهيم النخعي ، وغيرهم .\nوقال قتادة : ( يحفظونه من أمر الله ) قال : وفي بعض القراءات : \" يحفظونه بأمر الله \" .\nوقال كعب الأحبار : لو تجلى لابن آدم كل سهل وحزن ، لرأى كل شيء من ذلك شياطين لولا أن الله وكل بكم ملائكة عنكم في مطعمكم ومشربكم وعوراتكم ، إذا لتخطفتم .\nوقال أبو أمامة ما من آدمي إلا ومعه ملك يذود عنه ، حتى يسلمه للذي قدر له .\nوقال أبو مجلز : جاء رجل من مراد إلى علي ، رضي الله عنه ، وهو يصلي ، فقال : احترس ، فإن ناسا من مراد يريدون قتلك . فقال : إن مع كل رجل ملكين يحفظانه مما لم يقدر ، فإذا جاء القدر خليا بينه وبينه ، وإن الأجل جنة حصينة .\nوقال بعضهم : ( يحفظونه من أمر الله ) بأمر الله ، كما جاء في الحديث أنهم قالوا : يا رسول الله ، أرأيت رقى نسترقي بها ، هل ترد من قدر الله شيئا ؟ فقال : \" هي من قدر الله \" .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا حفص بن غياث ، عن أشعث ، عن جهم ، عن إبراهيم قال : أوحى الله إلى نبي من أنبياء بني إسرائيل : أن قل لقومك : إنه ليس من أهل قرية ولا أهل بيت يكونون على طاعة الله فيتحولون منها إلى معصية الله ، إلا تحول لهم مما يحبون إلى ما يكرهون ، ثم قال : إن مصداق ذلك في كتاب الله : ( إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم )\nوقد ورد هذا في حديث مرفوع ، فقال الحافظ محمد بن عثمان بن أبي شيبة في كتابه \" صفة العرش \" : حدثنا الحسن بن علي ، حدثنا الهيثم بن الأشعث السلمي ، حدثنا أبو حنيفة اليمامي الأنصاري ، عن عمير بن عبد الله قال : خطبنا علي بن أبي طالب على منبر الكوفة ، قال : كنت إذا سكت عن رسول الله - صلى الله عليه وسلم - ابتدأني ، وإذا سألته عن الخبر أنبأني ، وإنه حدثني عن ربه ، عز وجل ، قال : \" قال الرب : وعزتي وجلالي ، وارتفاعي فوق عرشي ، ما من أهل قرية ولا أهل بيت كانوا على ما كرهت من معصيتي ، ثم تحولوا عنها إلى ما أحببت من طاعتي ، إلا تحولت لهم عما يكرهون من عذابي إلى ما يحبون من رحمتي \" .\nوهذا غريب ، وفي إسناده من لا أعرفه .\n                                    ",
      "qortoby": "لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ ١١\n                                    \n                                    \n                                    قوله تعالى : له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم وإذا أراد الله بقوم سوءا فلا مرد له وما لهم من دونه من وال\nقوله تعالى : \" له معقبات \" أي لله ملائكة يتعاقبون بالليل والنهار ; فإذا صعدت ملائكة الليل أعقبتها ملائكة النهار . وقال : معقبات والملائكة ذكران لأنه جمع معقبة ; يقال : ملك معقب ، وملائكة معقبة ، ثم معقبات جمع الجمع . وقرأ بعضهم - \" له معاقيب من بين يديه ومن خلفه \" . ومعاقيب جمع معقب ; وقيل للملائكة معقبة على لفظ الملائكة وقيل : أنث لكثرة ذلك منهم ; نحو نسابة وعلامة وراوية ; قاله الجوهري وغيره . والتعقب العود بعد البدء ; قال الله تعالى : ولى مدبرا ولم يعقب أي لم يرجع ; وفي الحديث : معقبات لا يخيب قائلهن - أو - فاعلهن فذكر التسبيح والتحميد والتكبير . قال أبو الهيثم : سمين \" معقبات \" لأنهن عادت مرة بعد مرة ، فعل من عمل عملا ثم عاد إليه فقد عقب . والمعقبات من الإبل اللواتي يقمن عند أعجاز الإبل المعتركات على الحوض ; فإذا انصرفت ناقة دخلت مكانها أخرى .\nوقوله : من بين يديه أي المستخفي بالليل والسارب بالنهار .\nيحفظونه من أمر الله اختلف في هذا الحفظ ; فقيل : يحتمل أن يكون توكيل الملائكة بهم لحفظهم من الوحوش والهوام والأشياء المضرة ، لطفا منه به ، فإذا جاء القدر خلوا بينه وبينه ; قاله ابن عباس وعلي بن أبي طالب - رضي الله عنهما - . قال أبو مجلز : جاء رجل من مراد إلى علي فقال : احترس فإن ناسا من مراد يريدون قتلك ; فقال : إن مع كل رجل ملكين يحفظانه ما لم يقدر ، فإذا جاء القدر خليا بينه وبين قدر الله ، وإن الأجل حصن حصينة ; وعلى هذا ، يحفظونه من أمر الله أي بأمر الله وبإذنه ; ف \" من \" بمعنى الباء ; وحروف الصفات يقوم بعضها مقام بعض . وقيل : من بمعنى عن ; أي يحفظونه عن أمر الله ، وهذا قريب من الأول ; أي حفظهم عن أمر الله لا من عند أنفسهم ; وهذا قول الحسن ; تقول : كسوته عن عري ومن عري ; ومنه قوله - عز وجل - : أطعمهم من جوع أي عن جوع . وقيل : يحفظونه من ملائكة العذاب ، حتى لا تحل به عقوبة ; لأن الله لا يغير ما بقوم من النعمة والعافية حتى يغيروا ما بأنفسهم بالإصرار على الكفر ، فإن أصروا حان الأجل المضروب ونزلت بهم النقمة ، وتزول عنهم الحفظة المعقبات . وقيل : يحفظونه من الجن ; قال كعب : لولا أن الله وكل بكم ملائكة يذبون عنكم في مطعمكم ومشربكم وعوراتكم لتخطفتكم الجن وملائكة العذاب من أمر الله ; وخصهم بأن قال : من أمر الله لأنهم غير معاينين ; كما قال : قل الروح من أمر ربي أي ليس مما تشاهدونه أنتم . وقال الفراء : في الكلام تقديم وتأخير ، تقديره ، له معقبات من أمر الله من بين يديه ومن خلفه يحفظونه ، وهو مروي عن مجاهد وابن جريج والنخعي ; وعلى أن ملائكة العذاب والجن من أمر الله لا تقديم فيه ولا تأخير . وقال ابن جريج : إن المعنى يحفظون عليه عمله ; فحذف المضاف . وقال قتادة : يكتبون أقواله وأفعاله . ويجوز إذا كانت المعقبات الملائكة أن تكون الهاء في له لله - عز وجل - كما ذكرنا ; ويجوز أن تكون للمستخفي ، فهذا قول . وقيل : له معقبات من بين يديه ومن خلفه يعني به النبي - صلى الله عليه وسلم - أي أن الملائكة تحفظه من أعدائه ; وقد جرى ذكر الرسول في قوله :لولا أنزل عليه آية من ربه إنما أنت منذر أي سواء منكم من أسر القول ومن جهر به في أنه لا يضر النبي - صلى الله عليه وسلم - بل له معقبات يحفظونه - عليه السلام - ; ويجوز أن يرجع هذا إلى جميع الرسل ; لأنه قد قال : ولكل قوم هاد أي يحفظون الهادي من بين يديه ومن خلفه . وقول رابع : أن المراد بالآية السلاطين والأمراء الذين لهم قوم من بين أيديهم ومن خلفهم يحفظونهم ; فإذا جاء أمر الله لم يغنوا عنهم من الله شيئا ; قاله ابن عباس وعكرمة ; وكذلك قال الضحاك : هو السلطان المتحرس من أمر الله ، المشرك . وقد قيل : إن في الكلام على هذا التأويل نفيا محذوفا ، تقديره : لا يحفظونه من أمر الله تعالى ، ذكره الماوردي . قال المهدوي : ومن جعل المعقبات الحرس فالمعنى : يحفظونه من أمر الله على ظنه وزعمه . وقيل : سواء من أسر القول ومن جهر به فله حراس وأعوان يتعاقبون عليه فيحملونه على المعاصي ، ويحفظونه من أن ينجع فيه وعظ ; قال القشيري : وهذا لا يمنع الرب من الإمهال إلى أن يحق العذاب ; وهو إذا غير هذا العاصي ما بنفسه بطول الإصرار فيصير ذلك سببا للعقوبة ; فكأنه الذي يحل العقوبة بنفسه ; فقوله : يحفظونه من أمر الله أي من امتثال أمر الله . وقال عبد الرحمن بن زيد : المعقبات ما يتعاقب من أمر الله تعالى وقضائه في عباده ; قال الماوردي : ومن قال بهذا القول ففي تأويل قوله : يحفظونه من أمر الله وجهان : أحدهما : يحفظونه من الموت ما لم يأت أجل ; قاله الضحاك . الثاني : يحفظونه من الجن والهوام المؤذية ، ما لم يأت قدر ; - قاله أبو أمامة وكعب الأحبار - فإذا جاء المقدور خلوا عنه ; والصحيح أن المعقبات الملائكة ، وبه قال الحسن ومجاهد وقتادة وابن جريج ; وروي عن ابن عباس ، واختاره النحاس ، واحتج بقول النبي - صلى الله عليه وسلم - : يتعاقبون فيكم ملائكة بالليل وملائكة بالنهار الحديث ، رواه الأئمة . وروى الأئمة عن عمرو عن ابن عباس قرأ \" معقبات من بين يديه ورقباء من خلفه من أمر الله يحفظونه \" فهذا قد بين المعنى . وقال كنانة العدوي : دخل عثمان - رضي الله عنه - على النبي - صلى الله عليه وسلم - فقال : يا رسول الله ! أخبرني عن العبد كم معه من ملك ؟ قال : ملك عن يمينك يكتب الحسنات ، وآخر عن الشمال يكتب السيئات ، والذي على اليمين أمير على الذي على الشمال ، فإذا عملت حسنة كتبت عشرا ، وإذا عملت سيئة قال الذي على الشمال للذي على اليمين أأكتب ؟ قال لا ؛ لعله يستغفر الله تعالى أو يتوب إليه ، فإذا قال ثلاثا ، قال نعم اكتب أراحنا الله تعالى منه فبئس القرين هو ما أقل مراقبته لله - عز وجل - وأقل استحياءه منا ، يقول الله تعالى ما يلفظ من قول إلا لديه رقيب عتيد وملكان من بين يديك ومن خلفك يقول الله تعالى له معقبات من بين يديه ومن خلفه يحفظونه من أمر الله وملك قابض على ناصيتك فإذا تواضعت لله رفعك وإذا تجبرت على الله قصمك ، وملكان على شفتيك وليس يحفظان عليك إلا الصلاة على محمد وآله ، وملك قائم على فيك لا يدع أن تدخل الحية في فيك ، وملكان على عينيك فهؤلاء عشرة أملاك على كل آدمي يتداولون ، ملائكة الليل على ملائكة النهار ، لأن ملائكة الليل ليسوا بملائكة النهار ، فهؤلاء عشرون ملكا على كل آدمي ، وإبليس مع ابن آدم بالنهار وولده بالليل . ذكره الثعلبي . قال الحسن : المعقبات أربعة أملاك يجتمعون عند صلاة الفجر . واختيار الطبري : أن المعقبات المواكب بين أيدي الأمراء وخلفهم ; والهاء في \" له \" لهن ; على ما تقدم . وقال العلماء رضوان الله عليهم : إن الله سبحانه جعل أوامره على وجهين : أحدهما : قضى حلوله ووقوعه بصاحبه ; فذلك لا يدفعه أحد ولا يغيره . والآخر : قضى مجيئه ولم يقض حلوله ووقوعه ، بل قضى صرفه بالتوبة والدعاء والصدقة والحفظ .\nقوله تعالى : إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم أخبر الله تعالى في هذه الآية أنه لا يغير ما بقوم حتى يقع منهم تغيير ، إما منهم أو من الناظر لهم ، أو ممن هو منهم بسبب ; كما غير الله بالمنهزمين يوم أحد بسبب تغيير الرماة بأنفسهم ، إلى غير هذا من أمثلة الشريعة ; فليس معنى الآية أنه ليس ينزل بأحد عقوبة إلا بأن يتقدم منه ذنب ، بل قد تنزل المصائب بذنوب الغير ; كما قال - صلى الله عليه وسلم - : وقد سئل أنهلك وفينا الصالحون ؟ قال : نعم إذا كثر الخبث . والله أعلم .\nقوله تعالى : وإذا أراد الله بقوم سوءا أي هلاكا وعذابا .\nفلا مرد له وقيل : إذا أراد بهم بلاء من أمراض وأسقام فلا مرد لبلائه . وله : إذا أراد الله بقوم سوءا أعمى أبصارهم حتى يختاروا ما فيه البلاء ويعملوه ; فيمشون إلى هلاكهم بأقدامهم ، حتى يبحث أحدهم عن حتفه بكفه ، ويسعى بقدمه إلى إراقة دمه .\nوما لهم من دونه من وال أي ملجأ ; وهو معنى قول السدي . وقيل : من ناصر يمنعهم من عذابه ; وقال الشاعر :\nما في السماء سوى الرحمن من وال\nووال وولي كقادر وقدير .\n                                    ",
      "saadi": "لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ ١١\n                                        \n                                        \n                                        \n                                        { لَه} أي: للإنسان { مُعَقِّبَاتٌ } من الملائكة يتعاقبون في الليل والنهار.\n{ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ } أي: يحفظون بدنه وروحه من كل من يريده بسوء، ويحفظون عليه أعماله، وهم ملازمون له دائما، فكما أن علم الله محيط به، فالله قد أرسل هؤلاء الحفظة على العباد، بحيث لا تخفى أحوالهم ولا أعمالهم، ولا ينسى منها شيء، { إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ } من النعمة والإحسان ورغد العيش { حَتَّى يُغَيِّرُوا مَا بِأَنْفُسِهِمْ } بأن ينتقلوا من الإيمان إلى الكفر ومن الطاعة إلى المعصية، أو من شكر نعم الله إلى البطر بها فيسلبهم الله عند ذلك إياها.\nوكذلك إذا غير العباد ما بأنفسهم من المعصية، فانتقلوا إلى طاعة الله، غير الله عليهم ما كانوا فيه من الشقاء إلى الخير والسرور والغبطة والرحمة، { وَإِذَا أَرَادَ اللَّهُ بِقَوْمٍ سُوءًا } أي: عذابا وشدة وأمرا يكرهونه، فإن إرادته لا بد أن تنفذ فيهم.\nفـإنه { لَا مَرَدَّ لَهُ } ولا أحد يمنعهم منه، { وَمَا لَهُمْ مِنْ دُونِهِ مِنْ وَالٍ } يتولى أمورهم فيجلب لهم المحبوب، ويدفع عنهم المكروه، فليحذروا من الإقامة على ما يكره الله خشية أن يحل بهم من العقاب ما لا يرد عن القوم المجرمين.\n                                    "
    }
  },
  {
    "id": 11,
    "versesNumber": 12,
    "souraName": "Ar-Ra'd.html",
    "contnent": "هُوَ ٱلَّذِي يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ ٢١",
    "tafsier": {
      "ibnkther": "هُوَ ٱلَّذِي يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ ٢١\n                                    \n                                    \n                                    يخبر تعالى أنه هو الذي يسخر البرق ، وهو ما يرى من النور اللامع ساطعا من خلل السحاب .\nوروى ابن جرير أن ابن عباس كتب إلى أبي الجلد يسأله عن البرق ، فقال : البرق : الماء .\nوقوله : ( خوفا وطمعا ) قال قتادة : خوفا للمسافر ، يخاف أذاه ومشقته ، وطمعا للمقيم يرجو بركته ومنفعته ، ويطمع في رزق الله .\n( وينشئ السحاب الثقال ) أي : ويخلقها منشأة جديدة ، وهي لكثرة مائها ثقيلة قريبة إلى الأرض .\nقال مجاهد : والسحاب الثقال : الذي فيه الماء .\n                                    ",
      "qortoby": "هُوَ ٱلَّذِي يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ ٢١\n                                    \n                                    \n                                    أي بالمطر .\n\" السحاب \" جمع , والواحدة سحابة , وسحب وسحائب في الجمع أيضا .\n                                    ",
      "saadi": "هُوَ ٱلَّذِي يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا وَطَمَعٗا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ ٢١\n                                        \n                                        \n                                        \n                                        يقول تعالى: { هُوَ الَّذِي يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا } أي: يخاف منه الصواعق والهدم وأنواع الضرر، على بعض الثمار ونحوها ويطمع في خيره ونفعه،\n{ وَيُنْشِئُ السَّحَابَ الثِّقَالَ } بالمطر الغزير الذي به نفع العباد والبلاد.\n                                    "
    }
  },
  {
    "id": 12,
    "versesNumber": 13,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَيُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَٰٓئِكَةُ مِنۡ خِيفَتِهِۦ وَيُرۡسِلُ ٱلصَّوَٰعِقَ فَيُصِيبُ بِهَا مَن يَشَآءُ وَهُمۡ يُجَٰدِلُونَ فِي ٱللَّهِ وَهُوَ شَدِيدُ ٱلۡمِحَالِ ٣١",
    "tafsier": {
      "ibnkther": "وَيُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَٰٓئِكَةُ مِنۡ خِيفَتِهِۦ وَيُرۡسِلُ ٱلصَّوَٰعِقَ فَيُصِيبُ بِهَا مَن يَشَآءُ وَهُمۡ يُجَٰدِلُونَ فِي ٱللَّهِ وَهُوَ شَدِيدُ ٱلۡمِحَالِ ٣١\n                                    \n                                    \n                                    ( ويسبح الرعد بحمده ) كما قال تعالى : ( وإن من شيء إلا يسبح بحمده ) [ الإسراء : 44 ] .\nوقال الإمام أحمد : حدثنا يزيد ، حدثنا إبراهيم بن سعد ، أخبرني أبي قال : كنت جالسا إلى جنب حميد بن عبد الرحمن في المسجد ، فمر شيخ من بني غفار ، فأرسل إليه حميد ، فلما أقبل قال : يا ابن أخي ، وسع له فيما بيني وبينك ، فإنه قد صحب رسول الله صلى الله عليه وسلم . فجاء حتى جلس فيما بيني وبينه ، فقال له حميد : ما الحديث الذي حدثتني عن رسول الله ، صلى الله عليه وسلم ؟ فقال الشيخ : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" إن الله ينشئ السحاب ، فينطق أحسن النطق ، ويضحك أحسن الضحك \" .\nوالمراد - والله أعلم - أن نطقها الرعد ، وضحكها البرق .\nوقال موسى بن عبيدة ، عن سعد بن إبراهيم قال : يبعث الله الغيث ، فلا أحسن منه مضحكا ، ولا آنس منه منطقا ، فضحكه البرق ، ومنطقه الرعد .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا هشام بن عبيد الله الرازي ، عن محمد بن مسلم قال : بلغنا أن البرق ملك له أربعة وجوه : وجه إنسان ، ووجه ثور ، ووجه نسر ، ووجه أسد ، فإذا مصع بذنبه فذاك البرق .\nوقال الإمام أحمد : حدثنا عفان ، حدثنا عبد الواحد بن زياد ، حدثنا الحجاج ، حدثني أبو مطر ، عن سالم ، عن أبيه قال : كان رسول الله - صلى الله عليه وسلم - إذا سمع الرعد والصواعق قال : \" اللهم ، لا تقتلنا بغضبك ، ولا تهلكنا بعذابك ، وعافنا قبل ذلك \" .\nورواه الترمذي ، والبخاري في كتاب الأدب ، والنسائي في اليوم والليلة ، والحاكم في مستدركه ، من حديث الحجاج بن أرطاة ، عن أبي مطر ، ولم يسم به .\nوقال [ الإمام ] أبو جعفر بن جرير : حدثنا أحمد بن إسحاق ، حدثنا أبو أحمد ، حدثنا إسرائيل ، عن أبيه عن رجل ، عن أبي هريرة ، رفع الحديث قال : إنه كان إذا سمع الرعد قال : \" سبحان من يسبح الرعد بحمده \" .\nوروي عن علي - رضي الله عنه - أنه كان إذا سمع صوت الرعد قال : سبحان من سبحت له .\nوكذا روي عن ابن عباس ، والأسود بن يزيد ، وطاوس : أنهم كانوا يقولون كذلك .\nوقال الأوزاعي : كان ابن أبي زكريا يقول : من قال حين يسمع الرعد : سبحان الله وبحمده ، لم تصبه صاعقة .\nوعن عبد الله بن الزبير أنه كان إذا سمع الرعد ترك الحديث وقال : سبحان الذي يسبح الرعد بحمده والملائكة من خيفته ، ويقول : إن هذا لوعيد شديد لأهل الأرض . رواه مالك في الموطأ ، والبخاري في كتاب الأدب .\nوقال الإمام أحمد : حدثنا سليمان بن داود الطيالسي ، حدثنا صدقة بن موسى ، حدثنا محمد بن واسع ، عن شتير بن نهار ، عن أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : \" قال ربكم عز وجل : لو أن عبيدي أطاعوني لأسقيتهم المطر بالليل ، وأطلعت عليهم الشمس بالنهار ، ولما أسمعتهم صوت الرعد \" .\nوقال الطبراني : حدثنا زكريا بن يحيى الساجي ، حدثنا أبو كامل الجحدري ، حدثنا يحيى بن كثير أبو النضر ، حدثنا عبد الكريم ، حدثنا عطاء ، عن ابن عباس قال : قال رسول الله ، صلى الله عليه وسلم : \" إذا سمعتم الرعد فاذكروا الله ، فإنه لا يصيب ذاكرا \" .s\nوقوله : ( ويرسل الصواعق فيصيب بها من يشاء ) أي : يرسلها نقمة ينتقم بها ممن يشاء ، ولهذا تكثر في آخر الزمان ، كما قال الإمام أحمد :s\nحدثنا محمد بن مصعب ، حدثنا عمارة عن أبي نضرة ، عن أبي سعيد الخدري ، رضي الله عنه; أن النبي - صلى الله عليه وسلم - قال : \" تكثر الصواعق عند اقتراب الساعة ، حتى يأتي الرجل القوم فيقول : من صعق تلكم الغداة ؟ فيقولون صعق فلان وفلان وفلان \" .s\nوقد روي في سبب نزولها ما رواه الحافظ أبو يعلى الموصلي :s\nحدثنا إسحاق ، حدثنا علي بن أبي سارة الشيباني ، حدثنا ثابت ، عن أنس : أن رسول الله صلى الله عليه وسلم بعث رجلا مرة إلى رجل من فراعنة العرب فقال : \" اذهب فادعه لي \" . قال : فذهب إليه فقال : يدعوك رسول الله - صلى الله عليه وسلم - فقال له : من رسول الله ؟ وما الله ؟ أمن ذهب هو ؟ أم من فضة هو ؟ أم من نحاس هو ؟ قال : فرجع إلى رسول الله - صلى الله عليه وسلم - فأخبره ، فقال : يا رسول الله ، قد أخبرتك أنه أعتى من ذلك ، قال لي كذا وكذا . فقال : \" ارجع إليه الثانية \" . أراه ، فذهب فقال له مثلها . فرجع إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، قد أخبرتك أنه أعتى من ذلك . قال : \" ارجع إليه فادعه \" . فرجع إليه الثالثة . قال : فأعاد عليه ذلك الكلام . فبينا هو يكلمه ، إذ بعث الله ، عز وجل ، سحابة حيال رأسه ، فرعدت ، فوقعت منها صاعقة ، فذهب بقحف رأسه فأنزل الله : ( ويرسل الصواعق فيصيب بها من يشاء وهم يجادلون في الله وهو شديد المحال )s\nورواه ابن جرير ، من حديث علي بن أبي سارة ، به ورواه الحافظ أبو بكر البزار ، عن عبدة بن عبد الله ، عن يزيد بن هارون ، عن ديلم بن غزوان ، عن ثابت ، عن أنس ، فذكر نحوه .s\nوقال : حدثنا الحسن بن محمد ، حدثنا عفان ، حدثنا أبان بن يزيد ، حدثنا أبو عمران الجوني ، عن عبد الرحمن بن صحار العبدي : أنه بلغه أن نبي الله بعثه إلى جبار يدعوه ، فقال : أرأيتم ربكم ، أذهب هو ؟ أو فضة هو ؟ ألؤلؤ هو ؟ قال : فبينا هو يجادلهم ، إذ بعث الله سحابة فرعدت فأرسل عليه صاعقة فذهبت بقحف رأسه ، ونزلت هذه الآية .s\nوقال أبو بكر بن عياش ، عن ليث بن أبي سليم ، عن مجاهد قال : جاء يهودي فقال : يا محمد ، أخبرني عن ربك ، [ من أي شيء هو ] من نحاس هو ؟ من لؤلؤ ؟ أو ياقوت ؟ قال : فجاءت صاعقة فأخذته ، وأنزل الله : ( ويرسل الصواعق فيصيب بها من يشاء )s\nوقال قتادة : ذكر لنا أن رجلا أنكر القرآن ، وكذب النبي - صلى الله عليه وسلم - فأرسل الله صاعقة فأهلكته وأنزل : ( ويرسل الصواعق ) الآية .s\nوذكروا في سبب نزولها قصة عامر بن الطفيل وأربد بن ربيعة لما قدما على رسول الله - صلى الله عليه وسلم - المدينة ، فسألاه أن يجعل لهما نصف الأمر فأبى عليهما رسول الله - صلى الله عليه وسلم - فقال له عامر بن الطفيل ، لعنه الله : أما والله لأملأنها عليك خيلا جردا ورجالا مردا . فقال له رسول الله ، صلى الله عليه وسلم : يأبى الله عليك ذلك وأبناء قيلة . يعني : الأنصار ، ثم إنهما هما بالفتك بالنبي - صلى الله عليه وسلم - وجعل أحدهما يخاطبه ، والآخر يستل سيفه ليقتله من ورائه ، فحماه الله منهما وعصمه ، فخرجا من المدينة فانطلقا في أحياء العرب ، يجمعان الناس لحربه ، عليه السلام فأرسل الله على أربد سحابة فيها صاعقة فأحرقته . وأما عامر بن الطفيل فأرسل الله عليه الطاعون ، فخرجت فيه غدة عظيمة ، فجعل يقول : يا آل عامر ، غدة كغدة البكر ، وموت في بيت سلولية ؟ حتى ماتا لعنهما الله ، وأنزل الله في مثل ذلك :\n( ويرسل الصواعق فيصيب بها من يشاء ) وفي ذلك يقول لبيد بن ربيعة ، أخو أربد يرثيه :\nأخشى على أربد الحتوف ولا أرهب نوء السماك والأسد فجعني الرعد والصواعق بال\nفارس يوم الكريهة النجد\nوقال الحافظ أبو القاسم الطبراني : حدثنا مسعدة بن سعد العطار ، حدثنا إبراهيم بن المنذر الحزامي ، حدثني عبد العزيز بن عمران ، حدثني عبد الرحمن وعبد الله ابنا زيد بن أسلم ، عن أبيهما ، عن عطاء بن يسار ، عن ابن عباس ، أن أربد بن قيس بن جزء بن جليد بن جعفر بن كلاب ، وعامر بن الطفيل بن مالك ، قدما المدينة على رسول الله - صلى الله عليه وسلم ، فانتهيا إليه وهو جالس ، فجلسا بين يديه ، فقال عامر بن الطفيل : يا محمد ، ما تجعل لي إن أسلمت ؟ فقال رسول الله ، صلى الله عليه وسلم : \" لك ما للمسلمين ، وعليك ما عليهم \" . قال عامر بن الطفيل : أتجعل لي الأمر إن أسلمت من بعدك ؟ قال رسول الله ، صلى الله عليه وسلم : \" ليس ذلك لك ولا لقومك ، ولكن لك أعنة الخيل \" . قال : أنا الآن في أعنة خيل نجد ، اجعل لي الوبر ولك المدر . قال رسول الله : \" لا \" . فلما قفلا من عنده قال عامر : أما والله لأملأنها عليك خيلا ورجالا فقال له رسول الله ، صلى الله عليه وسلم : \" يمنعك الله \" . فلما خرج أربد وعامر ، قال عامر : يا أربد ، أنا أشغل عنك محمدا - صلى الله عليه وسلم - بالحديث ، فاضربه بالسيف ، فإن الناس إذا قتلت محمدا لم يزيدوا على أن يرضوا بالدية ، ويكرهوا الحرب ، فنعطيهم الدية . قال أربد : أفعل . فأقبلا راجعين إليه ، فقال عامر : يا محمد ، قم معي أكلمك . فقام معه رسول الله - صلى الله عليه وسلم - فجلسا إلى الجدار ، ووقف معه رسول الله - صلى الله عليه وسلم - يكلمه ، وسل أربد السيف ، فلما وضع يده على السيف يبست يده على قائم السيف ، فلم يستطع سل السيف ، فأبطأ أربد على عامر بالضرب ، فالتفت رسول الله - صلى الله عليه وسلم - فرأى أربد ، وما يصنع ، فانصرف عنهما . فلما خرج عامر وأربد من عند رسول الله - صلى الله عليه وسلم - حتى إذا كانا بالحرة ، حرة واقم نزلا فخرج إليهما سعد بن معاذ وأسيد بن حضير فقالا اشخصا يا عدوي الله ، لعنكما الله . فقال عامر : من هذا يا سعد ؟ قال : هذا أسيد بن حضير الكتائب فخرجا حتى إذا كانا بالرقم ، أرسل الله على أربد صاعقة فقتلته ، وخرج عامر حتى إذا كان بالخريم ، أرسل الله قرحة فأخذته فأدركه الليل في بيت امرأة من بني سلول ، فجعل يمس قرحته في حلقه ويقول : غدة كغدة الجمل في بيت سلولية ترغب أن يموت في بيتها! ثم ركب فرسه فأحضره حتى مات عليه راجعا ، فأنزل الله فيهما : ( الله يعلم ما تحمل كل أنثى وما تغيض الأرحام ) إلى قوله : ( وما لهم من دونه من وال ) [ الرعد : 8 - 11 ] - قال : المعقبات من أمر الله يحفظون محمدا - صلى الله عليه وسلم - ثم ذكر أربد وما قتله به ، فقال : ( ويرسل الصواعق فيصيب بها من يشاء ) الآية .\nوقوله : ( وهم يجادلون في الله ) أي : يشكون في عظمته ، وأنه لا إله إلا هو ، ( وهو شديد المحال )\nقال ابن جرير : شديدة مماحلته في عقوبة من طغى عليه وعتا وتمادى في كفره .\nوهذه الآية شبيهة بقوله : ( ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين ) [ النمل : 50 ، 51 ] .\nوعن علي ، رضي الله عنه : ( وهو شديد المحال ) أي : شديد الأخذ . وقال مجاهد : شديد القوة .\n                                    ",
      "qortoby": "وَيُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَٰٓئِكَةُ مِنۡ خِيفَتِهِۦ وَيُرۡسِلُ ٱلصَّوَٰعِقَ فَيُصِيبُ بِهَا مَن يَشَآءُ وَهُمۡ يُجَٰدِلُونَ فِي ٱللَّهِ وَهُوَ شَدِيدُ ٱلۡمِحَالِ ٣١\n                                    \n                                    \n                                    ويسبح الرعد بحمده والملائكة من خيفته ويرسل الصواعق قد مضى في \" البقرة \" القول في الرعد والبرق والصواعق فلا معنى للإعادة ; والمراد بالآية بيان كمال قدرته ; وأن تأخير العقوبة ليس عن عجز ; أي يريكم البرق في السماء خوفا للمسافر ; فإنه يخاف أذاه لما يناله من المطر والهول والصواعق ; قال الله تعالى : أذى من مطر وطمعا للحاضر أن يكون عقبه مطر وخصب ; قال معناه قتادة ومجاهد وغيرهما . وقال الحسن : خوفا من صواعق البرق ، وطمعا في غيثه المزيل للقحط . وينشئ السحاب الثقال قال مجاهد : أي بالماء . ويسبح الرعد بحمده من قال إن الرعد صوت السحاب فيجوز أن يسبح الرعد بدليل خلق الحياة فيه ; ودليل صحة هذا القول قوله : والملائكة من خيفته فلو كان الرعد ملكا لدخل في جملة الملائكة . ومن قال إنه ملك قال : معنى . من خيفته من خيفة الله ; قاله الطبري وغيره . قال ابن عباس : إن الملائكة خائفون من الله ليس كخوف ابن آدم ; لا يعرف واحدهم من على يمينه ومن على يساره ، لا يشغلهم عن عبادة الله طعام ولا شراب ; وعنه قال : الرعد ملك يسوق السحاب ، وإن بخار الماء لفي نقرة إبهامه ، وإنه موكل بالسحاب يصرفه حيث يؤمر ، وإنه يسبح الله ; فإذا سبح الرعد لم يبق ملك في السماء إلا رفع صوته بالتسبيح ، فعندها ينزل القطر ، وعنه أيضا كان إذا سمع صوت الرعد قال : سبحان الذي سبحت له . وروى مالك عن عامر بن عبد الله عن أبيه أنه كان إذا سمع صوت الرعد قال : سبحانه الذي يسبح الرعد بحمده والملائكة من خيفته ، ثم يقول : إن هذا وعيد لأهل الأرض شديد . وقيل : إنه ملك جالس على كرسي بين السماء والأرض ، وعن يمينه سبعون ألف ملك وعن يساره مثل ذلك ; فإذا أقبل على يمينه وسبح سبح الجميع من خوف الله ، وإذا أقبل على يساره وسبح سبح الجميع من خوف الله .\nويرسل الصواعق فيصيب بها من يشاء ذكر الماوردي عن ابن عباس وعلي بن أبي طالب ومجاهد : نزلت في يهودي قال للنبي - صلى الله عليه وسلم - : أخبرني من أي شيء ربك ; أمن لؤلؤ أم من ياقوت ؟ فجاءت صاعقة فأحرقته . وقيل : نزلت في بعض كفار العرب ; قال الحسن : ( كان رجل من طواغيت العرب بعث النبي - صلى الله عليه وسلم - نفرا يدعونه إلى الله ورسوله والإسلام فقال لهم : أخبروني عن رب محمد ما هو ، ومم هو ، أمن فضة أم من حديد أم نحاس ؟ فاستعظم القوم مقالته ; فقال : أجيب محمدا إلى رب لا يعرفه ! فبعث النبي - صلى الله عليه وسلم - إليه مرارا وهو يقول مثل هذا ; فبينا النفر ينازعونه ويدعونه إذ ارتفعت سحابة فكانت فوق رءوسهم ، فرعدت وأبرقت ورمت بصاعقة ، فأحرقت الكافر وهم جلوس ; فرجعوا إلى النبي - صلى الله عليه وسلم - فاستقبلهم بعض أصحاب رسول الله - صلى الله عليه وسلم - فقالوا : احترق صاحبكم ، فقالوا : من أين علمتم ؟ قالوا : أوحى الله إلى النبي - صلى الله عليه وسلم - . ويرسل الصواعق فيصيب بها من يشاء ) . ذكره الثعلبي عن الحسن ; والقشيري بمعناه عن أنس ، وسيأتي . وقيل : نزلت الآية في أربد بن ربيعة أخي لبيد بن ربيعة ، وفي عامر بن الطفيل ; قال ابن عباس : ( أقبل عامر بن الطفيل وأربد بن ربيعة العامريان يريدان النبي - صلى الله عليه وسلم - وهو في المسجد جالس في نفر من أصحابه ، فدخلا المسجد ، فاستشرف الناس لجمال عامر وكان أعور ، وكان من أجمل الناس ; فقال رجل من أصحاب النبي - صلى الله عليه وسلم - : هذا يا رسول الله عامر بن الطفيل قد أقبل نحوك ; فقال : دعه فإن يرد الله به خيرا يهده فأقبل حتى قام عليه فقال ; يا محمد ما لي إن أسلمت ؟ فقال : لك ما للمسلمين وعليك ما على المسلمين . قال : أتجعل لي الأمر من بعدك ؟ قال : ليس ذاك إلي إنما ذلك إلى الله يجعله حيث يشاء . قال : أفتجعلني على الوبر وأنت على المدر ؟ قال : لا . قال : فما تجعل لي ؟ قال : ( أجعل لك أعنة الخيل تغزو عليها في سبيل الله ) . قال : أوليس لي أعنة الخيل اليوم ؟ قم معي أكلمك ، فقام معه رسول الله - صلى الله عليه وسلم - وكان عامر أومأ إلى أربد : إذا رأيتني أكلمه فدر من خلفه واضربه بالسيف ، فجعل يخاصم النبي - صلى الله عليه وسلم - ويراجعه ; فاخترط أربد من سيفه شبرا ثم حبسه الله ، فلم يقدر على سله ، ويبست يده على سيفه ; وأرسل الله عليه صاعقة في يوم صائف صاح فأحرقته ; وولى عامر هاربا وقال : يا محمد ! دعوت ربك على أربد حتى قتلته ; والله لأملأنها عليك خيلا جردا ، وفتيانا مردا ; فقال - عليه السلام - : يمنعك الله من ذلك وأبناء قيلة يعني الأوس والخزرج ; فنزل عامر بيت امرأة سلولية ; وأصبح وهو يقول : والله لئن أصحر لي محمد وصاحبه - يريد ملك الموت - لأنفذتهما برمحي ; فأرسل الله ملكا فلطمه بجناحه فأذراه في التراب ; وخرجت على ركبته غدة عظيمة في الوقت ; فعاد إلى بيت السلولية وهو يقول : غدة كغدة البعير ، وموت في بيت سلولية ; ثم ركب على فرسه فمات على ظهره ) . ورثى لبيد بن ربيعة أخاه أربد فقال :\nيا عين هلا بكيت أربد إذ قم نا وقام الخصوم في كبد أخشى على أربد الحتوف ولا\nأرهب نوء السماك والأسد فجعني الرعد والصواعق بالفا\nرس يوم الكريهة النجد\nوفيه قال :\nإن الرزية لا رزية مثلها فقدان كل أخ كضوء الكوكب\nيا أربد الخير الكريم جدوده أفردتني أمشي بقرن أعضب\nوأسلم لبيد بعد ذلك - رضي الله عنه - . مسألة : روى أبان عن أنس قال : قال رسول الله - صلى الله عليه وسلم - : لا تأخذ الصاعقة ذاكرا لله - عز وجل - . وقال أبو هريرة - رضي الله عنه - : كان النبي - صلى الله عليه وسلم - إذا سمع صوت الرعد يقول : سبحان من يسبح الرعد بحمده والملائكة من خيفته وهو على كل شيء قدير فإن أصابته صاعقة فعلي ديته . وذكر الخطيب من حديث سليمان بن علي بن عبد الله بن عباس عن أبيه عن جده قال : كنا مع عمر في سفر فأصابنا رعد وبرد ، فقال لنا كعب : من قال حين يسمع الرعد : سبحان من يسبح الرعد بحمده والملائكة من خيفته ثلاثا عوفي مما يكون في ذلك الرعد ; ففعلنا فعوفينا ; ثم لقيت عمر بن الخطاب - رضي الله عنه - فإذا بردة قد أصابت أنفه فأثرت به ، فقلت : يا أمير المؤمنين ما هذا ؟ قال بردة أصابت أنفي فأثرت ، فقلت : إن كعبا حين سمع الرعد قال لنا : من قال حين يسمع الرعد سبحان من يسبح الرعد بحمده والملائكة من خيفته ثلاثا عوفي مما يكون في ذلك الرعد ; فقلنا فعوفينا ; فقال عمر : أفلا قلتم لنا حتى نقولها ؟ وقد تقدم هذا المعنى في \" البقرة \" .\nقوله تعالى : وهم يجادلون في الله يعني جدال اليهودي حين سأل عن الله تعالى : من أي شيء هو ؟ قاله مجاهد . وقال ابن جريج : جدال أربد فيما هم به من قتل النبي - صلى الله عليه وسلم - . ويجوز أن يكون وهم يجادلون في الله حالا ، ويجوز أن يكون منقطعا . وروى أنس أن رسول الله - صلى الله عليه وسلم - بعث إلى عظيم من المشركين يدعوه إلى الله - عز وجل - فقال لرسول الله : أخبرني عن إلهك هذا ؟ أهو من فضة أم من ذهب أم من نحاس ؟ فاستعظم ذلك ; فرجع إليه فأعلمه ; فقال : ارجع إليه فادعه فرجع إليه وقد أصابته صاعقة ، وعاد إلى رسول الله - صلى الله عليه وسلم - وقد نزل : وهم يجادلون في الله\nوهو شديد المحال قال ابن الأعرابي : المحال المكر ، والمكر من الله - عز وجل - التدبير بالحق . النحاس : المكر من الله إيصال المكروه إلى من يستحقه من حيث لا يشعر . وروى ابن اليزيدي عن أبي زيد وهو شديد المحال أي النقمة . وقال الأزهري : المحال أي القوة والشدة . والمحل : الشدة ; الميم أصلية ، وماحلت فلانا محالا أي قاويته حتى يتبين أينا أشد . وقال أبو عبيد : المحال العقوبة والمكروه . وقال ابن عرفة : المحال الجدال ; يقال : ماحل عن أمره أي جادل . وقال القتيبي : أي شديد الكيد ; وأصله من الحيلة ، جعل ميمه كميم المكان ; وأصله من الكون ، ثم يقال : تمكنت . وقال الأزهري : غلط ابن قتيبة أن الميم فيه زائدة ; بل هي أصلية ، وإذا رأيت الحرف على مثال فعال أوله ميم مكسورة فهي أصلية ; مثل : مهاد وملاك ومراس ، وغير ذلك من الحروف . ومفعل إذا كانت من بنات الثلاثة فإنه يجيء بإظهار الواو مثل : مزود ومحول ومحور ، وغيرها من الحروف ; وقال : وقرأ الأعرج \" وهو شديد المحال \" بفتح الميم ; وجاء تفسيره على هذه القراءة عن ابن عباس أنه الحول ، ذكر هذا كله أبو عبيد الهروي ، إلا ما ذكرناه أولا عن ابن الأعرابي ; وأقاويل الصحابة والتابعين بمعناها ; وهي ثمانية : أولها : شديد العداوة ، قاله ابن عباس . وثانيها : شديد الحول ، قاله ابن عباس أيضا . وثالثها : شديد الأخذ ، قاله علي بن أبي طالب . ورابعها : شديد الحقد ، قاله ابن عباس . وخامسها : شديد القوة ، قاله مجاهد . وسادسها : شديد الغضب ، قاله وهب بن منبه . وسابعها : شديد الهلاك بالمحل ، وهو القحط ; قاله الحسن أيضا . وثامنها : شديد الحيلة ; قاله قتادة . وقال أبو عبيدة ومعمر : المحال والمماحلة المماكرة والمغالبة ; وأنشد للأعشى :\nفرع نبع يهتز في غصن المج د كثير الندى شديد المحال\nوقال آخر :\nولبس بين أقوام فكل أعد له الشغازب والمحالا\nوقال عبد المطلب :\nلاهم إن المرء يم نع رحله فامنع حلالك\nلا يغلبن صليبهم ومحا لهم عدوا محالك\n                                    ",
      "saadi": "وَيُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَٰٓئِكَةُ مِنۡ خِيفَتِهِۦ وَيُرۡسِلُ ٱلصَّوَٰعِقَ فَيُصِيبُ بِهَا مَن يَشَآءُ وَهُمۡ يُجَٰدِلُونَ فِي ٱللَّهِ وَهُوَ شَدِيدُ ٱلۡمِحَالِ ٣١\n                                        \n                                        \n                                        \n                                        { وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ } وهو الصوت الذي يسمع من السحاب المزعج للعباد، فهو خاضع لربه مسبح بحمده، { و } تسبح { الْمَلَائِكَةُ مِنْ خِيفَتِهِ } أي: خشعا لربهم خائفين من سطوته، { وَيُرْسِلُ الصَّوَاعِقَ } وهي هذه النار التي تخرج من السحاب، { فَيُصِيبُ بِهَا مَنْ يَشَاءُ } من عباده بحسب ما شاءه وأراده وَهُوَ شَدِيدُ الْمِحَالِ أي: شديد الحول والقوة فلا يريد شيئا إلا فعله، ولا يتعاصى عليه شيء ولا يفوته هارب.\nفإذا كان هو وحده الذي يسوق للعباد الأمطار والسحب التي فيها مادة أرزاقهم، وهو الذي يدبر الأمور، وتخضع له المخلوقات العظام التي يخاف منها، وتزعج العباد وهو شديد القوة - فهو الذي يستحق أن يعبد وحده لا شريك له.\n                                    "
    }
  },
  {
    "id": 13,
    "versesNumber": 14,
    "souraName": "Ar-Ra'd.html",
    "contnent": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ ٤١",
    "tafsier": {
      "ibnkther": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ ٤١\n                                    \n                                    \n                                    قال علي بن أبى طالب ، رضي الله عنه : ( له دعوة الحق ) قال : التوحيد . رواه ابن جرير .\nوقال ابن عباس ، وقتادة ، ومالك عن محمد بن المنكدر : ( له دعوة الحق ) [ قال ] لا إله إلا الله .\n( والذين يدعون من دونه ) أي : ومثل الذين يعبدون آلهة غير الله . ( كباسط كفيه إلى الماء ليبلغ فاه ) قال علي بن أبي طالب : كمثل الذي يتناول الماء من طرف البئر بيده ، وهو لا يناله أبدا بيده ، فكيف يبلغ فاه ؟ .\nوقال مجاهد : ( كباسط كفيه ) يدعو الماء بلسانه ، ويشير إليه [ بيده ] فلا يأتيه أبدا .\nوقيل : المراد كقابض يده على الماء ، فإنه لا يحكم منه على شيء ، كما قال الشاعر :\nفإني وإياكم وشوقا إليكم كقابض ماء لم تسقه أنامله\nوقال الآخر :\nفأصبحت مما كان بيني وبينها من الود مثل القابض الماء باليد\nومعنى الكلام : أن هذا الذي يبسط يده إلى الماء ، إما قابضا وإما متناولا له من بعد ، كما أنه لا ينتفع بالماء الذي لم يصل إلى فيه ، الذي جعله محلا للشرب ، فكذلك هؤلاء المشركون الذين يعبدون مع الله إلها غيره ، لا ينتفعون بهم أبدا في الدنيا ولا في الآخرة; ولهذا قال : ( وما دعاء الكافرين إلا في ضلال )\n                                    ",
      "qortoby": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ ٤١\n                                    \n                                    \n                                    قوله تعالى : له دعوة الحق والذين يدعون من دونه لا يستجيبون لهم بشيء إلا كباسط كفيه إلى الماء ليبلغ فاه وما هو ببالغه وما دعاء الكافرين إلا في ضلال\nقوله تعالى : له دعوة الحق أي لله دعوة الصدق . قال ابن عباس وقتادة وغيرهما : لا إله إلا الله . وقال الحسن : إن الله هو الحق ، فدعاؤه دعوة الحق . وقيل : إن الإخلاص في الدعاء هو دعوة الحق ; قال بعض المتأخرين . وقيل : دعوة الحق دعاؤه عند الخوف ; فإنه لا يدعى فيه إلا إياه . كما قال : ضل من تدعون إلا إياه ; قال الماوردي : وهو أشبه بسياق الآية ; لأنه قال : والذين يدعون من دونه\nوالذين يدعون من دونه يعني الأصنام والأوثان .\nلا يستجيبون لهم بشيء أي لا يستجيبون لهم دعاء ، ولا يسمعون لهم نداء .\nإلا كباسط كفيه إلى الماء ليبلغ فاه وما هو ببالغه ضرب الله - عز وجل - الماء مثلا ليأسهم من الإجابة لدعائهم ; لأن العرب تضرب لمن سعى فيما لا يدركه مثلا بالقابض الماء باليد ; قال :\nفأصبحت فيما كان بيني وبينها من الود مثل القابض الماء باليد\nوفي معنى هذا المثل ثلاثة أوجه أن الذي يدعو إلها من دون الله كالظمآن الذي يدعو الماء إلى فيه من بعيد يريد تناوله ولا يقدر عليه بلسانه ، ويشير إليه بيده فلا يأتيه أبدا ، لأن الماء لا يستجيب ، وما الماء ببالغ إليه ; قاله مجاهد .\nأنه كالظمآن الذي يرى خياله في الماء وقد بسط كفه فيه ليبلغ فاه وما هو ببالغه ، لكذب ظنه ، وفساد توهمه ; قاله ابن عباس . الثالث : أنه كباسط كفه إلى الماء ليقبض عليه فلا يجمد في كفه شيء منه . وزعم الفراء أن المراد بالماء هاهنا البئر ; لأنها معدن للماء ، وأن المثل كمن مد يده إلى البئر بغير رشاء ; وشاهده قول الشاعر :\nفإن الماء ماء أبي وجدي وبئري ذو حفرت وذو طويت\nقال علي - رضي الله عنه - : هو كالعطشان على شفة البئر ، فلا يبلغ قعر البئر ، ولا الماء يرتفع إليه ، ومعنى إلا كباسط إلا كاستجابة باسط كفيه إلى الماء فالمصدر مضاف إلى الباسط ، ثم حذف المضاف ; وفاعل المصدر المضاف مراد في المعنى وهو الماء ; والمعنى : إلا كإجابة باسط كفيه إلى الماء ; واللام في قوله : ليبلغ فاه متعلقة بالبسط ، وقوله : وما هو ببالغه كناية عن الماء ; أي وما الماء ببالغ فاه . ويجوز أن يكون هو كناية عن الفم ; أي ما الفم ببالغ الماء .\nوما دعاء الكافرين إلا في ضلال أي ليست عبادة الكافرين الأصنام إلا في ضلال ، لأنها شرك ، وقيل : إلا في ضلال أي يضل عنهم ذلك الدعاء ، فلا يجدون منه سبيلا ; كما قال : أين ما كنتم تدعون من دون الله قالوا ضلوا عنا وقال ابن عباس : أي أصوات الكافرين محجوبة عن الله فلا يسمع دعاءهم .\n                                    ",
      "saadi": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ ٤١\n                                        \n                                        \n                                        \n                                        أي: لله وحده { دَعْوَةُ الْحَقِّ } وهي: عبادته وحده لا شريك له، وإخلاص دعاء العبادة ودعاء المسألة له تعالى، أي: هو الذي ينبغي أن يصرف له الدعاء، والخوف، والرجاء، والحب، والرغبة، والرهبة، والإنابة؛ لأن ألوهيته هي الحق، وألوهية غيره باطلة { وَالَّذِينَ يَدْعُونَ مِنْ دُونِهِ } من الأوثان والأنداد التي جعلوها شركاء لله.\n{ لَا يَسْتَجِيبُونَ لَهُمْ } أي: لمن يدعوها ويعبدها بشيء قليل ولا كثير لا من أمور الدنيا ولا من أمور الآخرة { إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ } الذي لا تناله كفاه لبعده، { لِيَبْلُغَ } ببسط كفيه إلى الماء { فَاهُ } فإنه عطشان ومن شدة عطشه يتناول بيده، ويبسطها إلى الماء الممتنع وصولها إليه، فلا يصل إليه.\nكذلك الكفار الذين يدعون معه آلهة لا يستجيبون لهم بشيء ولا ينفعونهم في أشد الأوقات إليهم حاجة لأنهم فقراء كما أن من دعوهم فقراء، لا يملكون مثقال ذرة في الأرض ولا في السماء، وما لهم فيهما من شرك وما له منهم من ظهير.\n{ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ } لبطلان ما يدعون من دون الله، فبطلت عباداتهم ودعاؤهم؛ لأن الوسيلة تبطل ببطلان غايتها، ولما كان الله تعالى هو الملك الحق المبين، كانت عبادته حقًّا متصلة النفع لصاحبها في الدنيا والآخرة.\nوتشبيه دعاء الكافرين لغير الله بالذي يبسط كفيه إلى الماء ليبلغ فاه من أحسن الأمثلة؛ فإن ذلك تشبيه بأمر محال، فكما أن هذا محال، فالمشبه به محال، والتعليق على المحال من أبلغ ما يكون في نفي الشيء كما قال تعالى: { إن الذين كذبوا بآياتنا واستكبروا عنها لا تفتح لهم أبواب السماء ولا يدخلون الجنة حتى يلج الجمل في سم الخياط }\n                                    "
    }
  },
  {
    "id": 14,
    "versesNumber": 15,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ ۩ ٥١",
    "tafsier": {
      "ibnkther": "وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ ۩ ٥١\n                                    \n                                    \n                                    يخبر تعالى عن عظمته وسلطانه الذي قهر كل شيء ، ودان له كل شيء . ولهذا يسجد له كل شيء طوعا من المؤمنين ، وكرها من المشركين ، ( وظلالهم بالغدو ) أي : البكر والآصال ، وهو جمع أصيل وهو آخر النهار ، كما قال تعالى : ( أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون ) [ النحل : 48 ] .\n                                    ",
      "qortoby": "وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ ۩ ٥١\n                                    \n                                    \n                                    قوله تعالى : ولله يسجد من في السماوات والأرض طوعا وكرها وظلالهم بالغدو والآصال قوله تعالى : ولله يسجد من في السماوات والأرض طوعا وكرها قال الحسن وقتادة وغيرهما : المؤمن يسجد طوعا ، والكافر يسجد كرها بالسيف . وعن قتادة أيضا : يسجد الكافر كارها حين لا ينفعه الإيمان . وقال الزجاج : سجود الكافر كرها ما فيه من الخضوع وأثر الصنعة . وقال ابن زيد : \" طوعا \" من دخل في الإسلام رغبة ، و \" كرها \" من دخل فيه رهبة بالسيف . وقيل : \" طوعا \" من طالت مدة إسلامه فألف السجود ، و \" كرها \" من يكره نفسه لله تعالى ; فالآية في المؤمنين ، وعلى هذا يكون معنى \" والأرض \" وبعض من في الأرض . قال القشيري : وفي الآية مسلكان : أحدهما : أنها عامة والمراد بها التخصيص ; فالمؤمن يسجد طوعا ، وبعض الكفار يسجدون إكراها وخوفا كالمنافقين ; فالآية محمولة على هؤلاء ، ذكره الفراء . وقيل على هذا القول : الآية في المؤمنين ; منهم من يسجد طوعا لا يثقل عليه السجود ، ومنهم من يثقل عليه ; لأن التزام التكليف مشقة ، ولكنهم يتحملون المشقة إخلاصا وإيمانا ، إلى أن يألفوا الحق ويمرنوا عليه . والمسلك الثاني : وهو الصحيح - إجراء الآية على التعميم ; وعلى هذا طريقان : أحدهما : أن المؤمن يسجد طوعا ، وأما الكافر فمأمور بالسجود مؤاخذ به . والثاني : وهو الحق - أن المؤمن يسجد ببدنه طوعا ، وكل مخلوق من المؤمن والكافر يسجد من حيث إنه مخلوق ، يسجد دلالة وحاجة إلى الصانع ; وهذا كقوله : وإن من شيء إلا يسبح بحمده وهو تسبيح دلالة لا تسبيح عبادة .\nوظلالهم بالغدو والآصال أي ظلال الخلق ساجدة لله تعالى بالغدو والآصال ; لأنها تبين في هذين الوقتين ، وتميل من ناحية إلى ناحية ; وذلك تصريف الله إياها على ما يشاء ; وهو كقوله تعالى : أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون قاله ابن عباس وغيره . وقال مجاهد : ظل المؤمن يسجد طوعا وهو طائع ; وظل الكافر يسجد كرها وهو كاره . وقال ابن الأنباري : يجعل للظلال عقول تسجد بها وتخشع بها ، كما جعل للجبال أفهام حتى خاطبت وخوطبت . قال القشيري : في هذا نظر ; لأن الجبل عين ، فيمكن أن يكون له عقل بشرط تقدير الحياة ، وأما الظلال فآثار وأعراض ، ولا يتصور تقدير الحياة لها ، والسجود بمعنى الميل ; فسجود الظلال ميلها من جانب إلى جانب ; يقال : سجدت النخلة أي مالت . و الآصال جمع أصل ، والأصل جمع أصيل ; وهو ما بين العصر إلى الغروب ، ثم أصائل جمع الجمع ; قال أبو ذؤيب الهذلي :\nلعمري لأنت البيت أكرم أهله وأقعد في أفيائه بالأصائل\nو \" ظلالهم \" يجوز أن يكون معطوفا على \" من \" ويجوز أن يكون ارتفع بالابتداء والخبر محذوف ; التقدير : وظلالهم سجد بالغدو والآصال و \" بالغدو \" يجوز أن يكون مصدرا ، ويجوز أن يكون جمع غداة ; يقوي كونه جمعا مقابلة الجمع الذي هو الآصال به .\n                                    ",
      "saadi": "وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ ۩ ٥١\n                                        \n                                        \n                                        \n                                        أي: جميع ما احتوت عليه السماوات والأرض كلها خاضعة لربها، تسجد له { طَوْعًا وَكَرْهًا } فالطوع لمن يأتي بالسجود والخضوع اختيارا كالمؤمنين، والكره لمن يستكبر عن عبادة ربه، وحاله وفطرته تكذبه في ذلك، { وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ } أي: ويسجد له ظلال المخلوقات أول النهار وآخره وسجود كل شيء بحسب حاله كما قال تعالى: { وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم } فإذا كانت المخلوقات كلها تسجد لربها طوعا وكرها كان هو الإله حقا المعبود المحمود حقا وإلاهية غيره باطلة، ولهذا ذكر بطلانها\n                                    "
    }
  },
  {
    "id": 15,
    "versesNumber": 16,
    "souraName": "Ar-Ra'd.html",
    "contnent": "قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ ٦١",
    "tafsier": {
      "ibnkther": "قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ ٦١\n                                    \n                                    \n                                    يقرر تعالى أنه لا إله إلا هو; لأنهم معترفون أنه هو الذي خلق السموات والأرض ، وهو ربها ومدبرها ، وهم مع هذا قد اتخذوا من دونه أولياء يعبدونهم ، وأولئك الآلهة لا تملك لنفسها ولا لعابديها بطريق الأولى ( نفعا ولا ضرا ) أي : لا تحصل منفعة ، ولا تدفع مضرة . فهل يستوي من عبد هذه الآلهة مع الله ، ومن عبد الله وحده لا شريك له ، وهو على نور من ربه ؟ ولهذا قال : ( قل هل يستوي الأعمى والبصير أم هل تستوي الظلمات والنور أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم ) أي : أجعل هؤلاء المشركون مع الله آلهة تناظر الرب وتماثله في الخلق ، فخلقوا كخلقه ، فتشابه الخلق عليهم ، فلا يدرون أنها مخلوقة من مخلوق غيره ؟ أي : ليس الأمر كذلك ، فإنه لا يشابهه شيء ولا يماثله ، ولا ند له ولا عدل له ، ولا وزير له ، ولا ولد ولا صاحبة ، تعالى الله عن ذلك علوا كبيرا . وإنما عبد هؤلاء المشركون معه آلهة هم يعترفون أنها مخلوقة له عبيد له ، كما كانوا يقولون في تلبيتهم : لبيك لا شريك لك ، إلا شريكا هو لك ، تملكه وما ملك . وكما أخبر تعالى عنهم في قوله : ( ما نعبدهم إلا ليقربونا إلى الله زلفى ) [ الزمر : 3 ] فأنكر تعالى ذلك عليهم ، حيث اعتقدوا ذلك ، وهو تعالى لا يشفع عنده أحد إلا بإذنه ، ( ولا تنفع الشفاعة عنده إلا لمن أذن له ) [ سبأ : 23 ] ، ( وكم من ملك في السماوات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى ) [ النجم : 26 ] وقال : ( إن كل من في السماوات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا ) [ مريم : 93 - 95 ] فإذا كان الجميع عبيدا ، فلم يعبد بعضهم بعضا بلا دليل ولا برهان ، بل بمجرد الرأي والاختراع والابتداع ؟ ثم قد أرسل رسله من أولهم إلى آخرهم تزجرهم عن ذلك ، وتنهاهم عن عبادة من سوى الله ، فكذبوهم وخالفوهم ، فحقت عليهم كلمة العذاب لا محالة ، ( ولا يظلم ربك أحدا ) [ الكهف : 49 ] .\n                                    ",
      "qortoby": "قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ ٦١\n                                    \n                                    \n                                    قوله تعالى : قل من رب السماوات والأرض قل الله قل أفاتخذتم من دونه أولياء لا يملكون لأنفسهم نفعا ولا ضرا قل هل يستوي الأعمى والبصير أم هل تستوي الظلمات والنور أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم قل الله خالق كل شيء وهو الواحد القهار\nقوله تعالى : قل من رب السماوات والأرض قل الله أمر الله تعالى نبيه - صلى الله عليه وسلم - أن يقول للمشركين : قل من رب السماوات والأرض ثم أمره أن يقول لهم : هو الله إلزاما للحجة إن لم يقولوا ذلك ، وجهلوا من هو .\nقل أفاتخذتم من دونه أولياء هذا يدل على اعترافهم بأن الله هو الخالق وإلا لم يكن للاحتجاج بقوله : قل أفاتخذتم من دونه أولياء معنى ; دليله قوله : ولئن سألتهم من خلق السماوات والأرض ليقولن الله أي فإذا اعترفتم فلم تعبدون غيره ؟ ! وذلك الغير لا ينفع ولا يضر ; وهو إلزام صحيح .\nقل هل يستوي الأعمى والبصير ثم ضرب لهم مثلا فقال : قل هل يستوي الأعمى والبصير فكذلك لا يستوي المؤمن الذي يبصر الحق ، والمشرك الذي لا يبصر الحق . وقيل : الأعمى مثل لما عبدوه من دون الله ، والبصير مثل الله تعالى :\nأم هل تستوي الظلمات والنور أي الشرك والإيمان . وقرأ ابن محيصن وأبو بكر والأعمش وحمزة والكسائي \" يستوي \" بالياء لتقدم الفعل ; ولأن تأنيث الظلمات ليس بحقيقي . الباقون بالتاء ; واختاره أبو عبيد ، قال : لأنه لم يحل بين المؤنث والفعل حائل . و الظلمات والنور مثل الإيمان والكفر ; ونحن لا نقف على كيفية ذلك .\nأم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم هذا من تمام الاحتجاج ; أي خلق غير الله مثل خلقه فتشابه الخلق عليهم ، فلا يدرون خلق الله من خلق آلهتهم .\nقل الله خالق كل شيء أي قل لهم يا محمد : الله خالق كل شيء ، فلزم لذلك أن يعبده كل شيء . والآية رد على المشركين والقدرية الذين زعموا أنهم خلقوا كما خلق الله .\nوهو الواحد قبل كل شيء . \" القهار \" الغالب لكل شيء ، الذي يغلب في مراده كل مريد . قال القشيري أبو نصر : ولا يبعد أن تكون الآية واردة فيمن لا يعترف بالصانع ; أي سلهم عن خالق السماوات والأرض ، فإنه يسهل تقرير الحجة فيه عليهم ، ويقرب الأمر من الضرورة ; فإن عجز الجماد وعجز كل مخلوق عن خلق السماوات والأرض معلوم ، وإذا تقرر هذا وبان أن الصانع هو الله فكيف يجوز اعتداد الشريك له ؟ ! وبين في أثناء الكلام أنه لو كان للعالم صانعان لاشتبه الخلق ، ولم يتميز فعل هذا عن فعل ذلك ، فبم يعلم أن الفعل من اثنين ؟ ! .\n                                    ",
      "saadi": "قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ ٦١\n                                        \n                                        \n                                        \n                                        أي: قل لهؤلاء المشركين به أوثانا وأندادا يحبونها كما يحبون الله، ويبذلون لها أنواع التقربات والعبادات: أفتاهت عقولكم حتى اتخذتم من دونه أولياء تتولونهم بالعبادة وليسوا بأهل لذلك ؟\nفإنهم { لَا يَمْلِكُونَ لِأَنْفُسِهِمْ نَفْعًا وَلَا ضَرًّا } وتتركون ولاية من هو كامل الأسماء والصفات، المالك للأحياء والأموات، الذي بيده الخلق والتدبير والنفع والضر ؟\nفما تستوي عبادة الله وحده، وعبادة المشركين به، كما لا يستوي الأعمى والبصير، وكما لا تستوي الظلمات والنور.\nفإن كان عندهم شك واشتباه، وجعلوا له شركاء زعموا أنهم خلقوا كخلقه وفعلوا كفعله، فأزلْ عنهم هذا الاشتباه واللبس بالبرهان الدال على توحد الإله بالوحدانية، فقل لهم: { اللَّهُ خَالِقُ كُلِّ شَيْءٍ } فإنه من المحال أن يخلق شيء من الأشياء نفسه.\nومن المحال أيضا أن يوجد من دون خالق، فتعين أن لها إلها خالقا لا شريك له في خلقه لأنه الواحد القهار، فإنه لا توجد الوحدة والقهر إلا لله وحده، فالمخلوقات وكل مخلوق فوقه مخلوق يقهره ثم فوق ذلك القاهر قاهر أعلى منه، حتى ينتهي القهر للواحد القهار، فالقهر والتوحيد متلازمان متعينان لله وحده، فتبين بالدليل العقلي القاهر، أن ما يدعى من دون الله ليس له شيء من خلق المخلوقات وبذلك كانت عبادته باطلة.\n                                    "
    }
  },
  {
    "id": 16,
    "versesNumber": 17,
    "souraName": "Ar-Ra'd.html",
    "contnent": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ ٧١",
    "tafsier": {
      "ibnkther": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ ٧١\n                                    \n                                    \n                                    اشتملت هذه الآية الكريمة على مثلين مضروبين للحق في ثباته وبقائه ، والباطل في اضمحلاله وفنائه ، فقال تعالى : ( أنزل من السماء ماء ) أي : مطرا ، ( فسالت أودية بقدرها ) أي : أخذ كل واد بحسبه ، فهذا كبير وسع كثيرا من الماء ، وهذا صغير فوسع بقدره ، وهو إشارة إلى القلوب وتفاوتها ، فمنها ما يسع علما كثيرا ، ومنها ما لا يتسع لكثير من العلوم بل يضيق عنها ، ( فاحتمل السيل زبدا رابيا ) أي : فجاء على وجه الماء الذي سال في هذه الأودية زبد عال عليه ، هذا مثل ، وقوله : ( ومما يوقدون عليه في النار ) هذا هو المثل الثاني ، وهو ما يسبك في النار من ذهب أو فضة ( ابتغاء حلية ) أي : ليجعل حلية أو نحاسا أو حديدا ، فيجعل متاعا فإنه يعلوه زبد منه ، كما يعلو ذلك زبد منه . ( كذلك يضرب الله الحق والباطل ) أي : إذا اجتمعا لا ثبات للباطل ولا دوام له ، كما أن الزبد لا يثبت مع الماء ، ولا مع الذهب ونحوه مما يسبك في النار ، بل يذهب ويضمحل; ولهذا قال : ( فأما الزبد فيذهب جفاء ) أي : لا ينتفع به ، بل يتفرق ويتمزق ويذهب في جانبي الوادي ، ويعلق بالشجر وتنسفه الرياح . وكذلك خبث الذهب والفضة والحديد والنحاس يذهب ، لا يرجع منه شيء ، ولا يبقى إلا الماء وذلك الذهب ونحوه ينتفع به; ولهذا قال : ( وأما ما ينفع الناس فيمكث في الأرض كذلك يضرب الله الأمثال ) كما قال تعالى : ( وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون ) [ العنكبوت : 43 ] .\nقال بعض السلف : كنت إذا قرأت مثلا من القرآن فلم أفهمه بكيت على نفسي; لأن الله تعالى يقول : ( وما يعقلها إلا العالمون )\nقال علي بن أبي طلحة ، عن ابن عباس : قوله تعالى : ( أنزل من السماء ماء فسالت أودية بقدرها ) هذا مثل ضربه الله ، احتملت منه القلوب على قدر يقينها وشكها ، فأما الشك فلا ينفع معه العمل ، وأما اليقين فينفع الله به أهله . وهو قوله : ( فأما الزبد فيذهب جفاء ) [ وهو الشك ] ( وأما ما ينفع الناس فيمكث في الأرض ) وهو اليقين ، وكما يجعل الحلي في النار فيؤخذ خالصه ويترك خبثه في النار; فكذلك يقبل الله اليقين ويترك الشك .\nوقال العوفي ، عن ابن عباس : قوله : ( أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا ) يقول : احتمل السيل ما في الوادي من عود ودمنة ( ومما يوقدون عليه في النار ) فهو الذهب والفضة والحلية والمتاع والنحاس والحديد ، فللنحاس والحديد خبث ، فجعل الله مثل خبثه كزبد الماء ، فأما ما ينفع الناس فالذهب والفضة ، وأما ما ينفع الأرض فما شربت من الماء فأنبتت . فجعل ذاك مثل العمل الصالح يبقى لأهله ، والعمل السيئ يضمحل عن أهله ، كما يذهب هذا الزبد ، فكذلك الهدى والحق جاءا من عند الله ، فمن عمل بالحق كان له ، ويبقى كما يبقى ما ينفع الناس في الأرض . وكذلك الحديد لا يستطاع أن يعمل منه سكين ولا سيف حتى يدخل في النار فتأكل خبثه ، ويخرج جيده فينتفع به . كذلك يضمحل الباطل إذا كان يوم القيامة ، وأقيم الناس ، وعرضت الأعمال ، فيزيغ الباطل ويهلك ، وينتفع أهل الحق بالحق .\nوكذلك روي في تفسيرها عن مجاهد ، والحسن البصري ، وعطاء ، وقتادة ، وغير واحد من السلف والخلف .\nوقد ضرب الله ، سبحانه وتعالى ، في أول سورة البقرة للمنافقين مثلين ناريا ومائيا ، وهما قوله : ( مثلهم كمثل الذي استوقد نارا فلما أضاءت ما حوله ) الآية [ البقرة : 17 ] ، ثم قال : ( أو كصيب من السماء فيه ظلمات ورعد وبرق ) الآية [ البقرة : 19 ] . وهكذا ضرب للكافرين في سورة النور مثلين ، أحدهما : قوله : ( والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء ) [ النور : 39 ] الآية ، والسراب إنما يكون في شدة الحر; ولهذا جاء في الصحيحين : \" فيقال لليهود يوم القيامة : فما تريدون ؟ فيقولون : أي ربنا ، عطشنا فاسقنا . فيقال : ألا تردون ؟ فيردون النار فإذا هي كالسراب يحطم بعضها بعضا \" .\nثم قال في المثل الآخر : ( أو كظلمات في بحر لجي يغشاه موج من فوقه موج من فوقه سحاب ) الآية [ النور : 40 ] . وفي الصحيحين عن أبي موسى الأشعري قال : قال رسول الله ، صلى الله عليه وسلم : \" إن مثل ما بعثني الله به من الهدى والعلم ، كمثل غيث أصاب أرضا ، فكان منها طائفة قبلت الماء فأنبتت الكلأ والعشب الكثير ، وكانت منها أجادب أمسكت الماء ، فنفع الله بها الناس ، فشربوا ورعوا وسقوا وزرعوا ، وأصابت طائفة منها [ أخرى ] إنما هي قيعان لا تمسك ماء ولا تنبت كلأ فذلك مثل من فقه في دين الله ونفعه الله بما بعثني ونفع به ، فعلم وعلم ، ومثل من لم يرفع بذلك رأسا ولم يقبل هدى الله الذي أرسلت به \" .\nفهذا مثل مائي ، وقال في الحديث الآخر الذي رواه الإمام أحمد :\nحدثنا عبد الرزاق ، حدثنا معمر ، عن همام بن منبه قال : هذا ما حدثنا أبو هريرة عن رسول الله - صلى الله عليه وسلم - أنه قال : \" مثلي ومثلكم ، كمثل رجل استوقد نارا ، فلما أضاءت ما حوله جعل الفراش وهذه الدواب التي يقعن في النار يقعن فيها ، وجعل يحجزهن ويغلبنه فيقتحمن فيها \" . قال : \" فذلكم مثلي ومثلكم ، أنا آخذ بحجزكم عن النار ، هلم عن النار [ هلم عن النار ، هلم ] فتغلبوني فتقتحمون فيها \" . وأخرجاه في الصحيحين أيضا فهذا مثل ناري .\n                                    ",
      "qortoby": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ ٧١\n                                    \n                                    \n                                    قوله : أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا ومما يوقدون عليه في النار ابتغاء حلية أو متاع زبد مثله كذلك يضرب الله الحق والباطل فأما الزبد فيذهب جفاء وأما ما ينفع الناس فيمكث في الأرض كذلك يضرب الله الأمثال\nقوله تعالى : أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا ضرب مثلا للحق والباطل ; فشبه الكفر بالزبد الذي يعلو الماء ، فإنه يضمحل ويعلق بجنبات الأودية ، وتدفعه الرياح ; فكذلك يذهب الكفر ويضمحل ، على ما نبينه . قال مجاهد : فسالت أودية بقدرها قال : بقدر ملئها . وقال ابن جريج : بقدر صغرها وكبرها . وقرأ الأشهب العقيلي والحسن \" بقدرها \" بسكون الدال ، والمعنى واحد . وقيل : معناها بما قدر لها . والأودية . جمع الوادي ; وسمي واديا لخروجه وسيلانه ; فالوادي على هذا اسم للماء السائل . وقال أبو علي : فسالت أودية توسع ; أي سال ماؤها فحذف ، قال : ومعنى \" بقدرها \" بقدر مياهها ; لأن الأودية ما سالت بقدر أنفسها . فاحتمل السيل زبدا رابيا أي طالعا عاليا مرتفعا فوق الماء ; وتم الكلام ; قاله مجاهد . ثم قال : ومما يوقدون عليه في النار وهو المثل الثاني . ابتغاء حلية أي حلية الذهب والفضة . أو متاع زبد مثله قال مجاهد : الحديد والنحاس والرصاص . وقوله : \" زبد مثله \" أي يعلو هذه الأشياء زبد كما يعلو السيل ; وإنما احتمل السيل الزبد لأن الماء خالطه تراب الأرض فصار ذلك زبدا ، كذلك ما يوقد عليه في النار من الجوهر ومن الذهب والفضة مما ينبث في الأرض من المعادن فقد خالطه التراب ; فإنما يوقد عليه ليذوب فيزايله تراب الأرض . وقوله : كذلك يضرب الله الحق والباطل فأما الزبد فيذهب جفاء قال مجاهد : جمودا . وقال أبو عبيدة قال أبو عمرو بن العلاء : أجفأت القدر إذا غلت حتى ينصب زبدها ، وإذا جمد في أسفلها . والجفاء ما أجفاه الوادي أي رمى به . وحكى أبو عبيدة أنه سمع رؤبة يقرأ \" جفالا \" قال أبو عبيدة : يقال أجفلت القدر إذا قذفت بزبدها ، وأجفلت الريح السحاب إذا قطعته . وأما ما ينفع الناس فيمكث في الأرض قال مجاهد : هو الماء الخالص الصافي . وقيل : الماء وما خلص من الذهب والفضة والحديد والنحاس والرصاص ; وهو أن المثلين ضربهما الله للحق في ثباته ، والباطل في اضمحلاله ، فالباطل وإن علا في بعض الأحوال فإنه يضمحل كاضمحلال الزبد والخبث . وقيل : المراد مثل ضربه الله للقرآن وما يدخل منه القلوب ; فشبه القرآن بالمطر لعموم خيره وبقاء نفعه ، وشبه القلوب بالأودية ، يدخل فيها من القرآن مثل ما يدخل في الأودية بحسب سعتها وضيقها . قال ابن عباس : أنزل من السماء ماء قال : قرآنا ، فسالت أودية بقدرها قال : الأودية قلوب العباد . قال صاحب \" سوق العروس \" إن صح هذا التفسير فالمعنى فيه أن الله سبحانه مثل القرآن بالماء . ومثل القلوب بالأودية ، ومثل المحكم بالصافي ، ومثل المتشابه بالزبد . وقيل : الزبد مخايل النفس وغوائل الشك ترتفع من حيث ما فيها فتضطرب من سلطان تلعها ، كما أن ماء السيل يجري صافيا فيرفع ما يجد في الوادي باقيا ، وأما حلية الذهب والفضة فمثل الأحوال السنية . والأخلاق الزكية ; التي بها جمال الرجال ، وقوام صالح الأعمال ، كما أن من الذهب والفضة زينة النساء ، وبهما قيمة الأشياء . وقرأ حميد وابن محيصن ويحيى والأعمش وحمزة والكسائي وحفص ، يوقدون بالياء واختاره أبو عبيد ; لقوله : ينفع الناس فأخبر ، ولا مخاطبة هاهنا . الباقون بالتاء لقوله في أول الكلام : أفاتخذتم من دونه أولياء . وقوله : \" في النار \" متعلق بمحذوف ، وهو في موضع الحال ، وذو الحال الهاء التي في \" عليه \" التقدير : ومما توقدون عليه ثابتا في النار أو كائنا . وفي قوله : \" في النار \" ضمير مرفوع يعود إلى الهاء التي هي اسم ذي الحال ولا يستقيم أن يتعلق \" في النار \" ب \" يوقدون \" من حيث لا يستقيم أوقدت عليه في النار ; لأن الموقد عليه يكون في النار ، فيصير قوله : \" في النار \" غير مفيد . وقوله : \" ابتغاء حلية \" مفعول له . \" زبد مثله \" ابتداء وخبر ; أي زبد مثل زبد السيل . وقيل : إن خبر \" زبد \" قوله : \" في النار \" . الكسائي : \" زبد \" ابتداء ، و \" مثله \" نعت له ، والخبر في الجملة التي قبله ، وهو مما يوقدون . \" كذلك يضرب الله الأمثال \" أي كما بين لكم هذه الأمثال فكذلك يضربها بينات . تم الكلام ،\n                                    ",
      "saadi": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ ٧١\n                                        \n                                        \n                                        \n                                        شبّه تعالى الهدى الذي أنزله على رسوله لحياة القلوب والأرواح، بالماء الذي أنزله لحياة الأشباح، وشبّه ما في الهدى من النفع العام الكثير الذي يضطر إليه العباد، بما في المطر من النفع العام الضروري، وشبه القلوب الحاملة للهدى وتفاوتها بالأودية التي تسيل فيها السيول، فواد كبير يسع ماء كثيرا، كقلب كبير يسع علما كثيرا، وواد صغير يأخذ ماء قليلا، كقلب صغير، يسع علما قليلا، وهكذا.\nوشبه ما يكون في القلوب من الشهوات والشبهات عند وصول الحق إليها، بالزبد الذي يعلو الماء ويعلو ما يوقد عليه النار من الحلية التي يراد تخليصها وسبكها، وأنها لا تزال فوق الماء طافية مكدرة له حتى تذهب وتضمحل، ويبقى ما ينفع الناس من الماء الصافي والحلية الخالصة.\nكذلك الشبهات والشهوات لا يزال القلب يكرهها، ويجاهدها بالبراهين الصادقة، والإرادات الجازمة، حتى تذهب وتضمحل ويبقى القلب خالصا صافيا ليس فيه إلا ما ينفع الناس من العلم بالحق وإيثاره، والرغبة فيه، فالباطل يذهب ويمحقه الحق { إِنَّ الْبَاطِلَ كَانَ زَهُوقًا } وقال هنا: { كَذَلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ } ليتضح الحق من الباطل والهدى والضلال.\n                                    "
    }
  },
  {
    "id": 17,
    "versesNumber": 18,
    "souraName": "Ar-Ra'd.html",
    "contnent": "لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ٨١",
    "tafsier": {
      "ibnkther": "لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ٨١\n                                    \n                                    \n                                    يخبر تعالى عن مآل السعداء والأشقياء فقال : ( للذين استجابوا لربهم ) أي : أطاعوا الله ورسوله ، وانقادوا لأوامره ، وصدقوا أخباره الماضية والآتية ، فلهم ) الحسنى ) وهو الجزاء الحسن كما قال تعالى مخبرا عن ذي القرنين أنه قال : ( قال أما من ظلم فسوف نعذبه ثم يرد إلى ربه فيعذبه عذابا نكرا وأما من آمن وعمل صالحا فله جزاء الحسنى وسنقول له من أمرنا يسرا ) [ الكهف : 87 ، 88 ] وقال تعالى : ( للذين أحسنوا الحسنى وزيادة ) [ يونس : 26 ] .\nوقوله : ( والذين لم يستجيبوا له ) أي لم : يطيعوا الله ( لو أن لهم ما في الأرض جميعا ) أي : في الدار الآخرة ، لو أن يمكنهم أن يفتدوا من عذاب الله بملء الأرض ذهبا ومثله معه لافتدوا به ، ولكن لا يتقبل منهم; لأنه تعالى لا يقبل منهم يوم القيامة صرفا ولا عدلا ( أولئك لهم سوء الحساب ) أي : في الدار الآخرة ، أي : يناقشون على النقير والقطمير ، والجليل والحقير ، ومن نوقش الحساب عذب; ولهذا قال : ( ومأواهم جهنم وبئس المهاد )\n                                    ",
      "qortoby": "لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ٨١\n                                    \n                                    \n                                    ثم قال : للذين استجابوا لربهم الحسنى أي أجابوا ; واستجاب بمعنى أجاب ; قال :\nفلم يستجبه عند ذاك مجيب\nوقد تقدم ; أي أجاب إلى ما دعاه الله من التوحيد والنبوات . \" الحسنى \" لأنها في نهاية الحسن . وقيل : من الحسنى النصر في الدنيا ، والنعيم المقيم غدا .\nوالذين لم يستجيبوا له أي لم يجيبوا إلى الإيمان به . لو أن لهم ما في الأرض جميعا أي من الأموال . \" ومثله معه \" ملك لهم . \" لافتدوا به \" من عذاب يوم القيامة ; نظيره في \" آل عمران \" إن الذين كفروا لن تغني عنهم أموالهم ولا أولادهم من الله شيئا ، إن الذين كفروا وماتوا وهم كفار فلن يقبل من أحدهم ملء الأرض ذهبا ولو افتدى به حسب ما تقدم بيانه هناك .\nأولئك لهم سوء الحساب أي لا يقبل لهم حسنة ، ولا يتجاوز لهم عن سيئة . وقال فرقد السبخي قال لي إبراهيم النخعي : يا فرقد ! أتدري ما سوء الحساب ؟ قلت لا ! قال : أن يحاسب الرجل بذنبه كله لا يفقد منه شيء .\nومأواهم جهنم أي مسكنهم ومقامهم .\n\" وبئس المهاد \" أي الفراش الذي مهدوا لأنفسهم .\n                                    ",
      "saadi": "لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ٨١\n                                        \n                                        \n                                        \n                                        لما بيّن تعالى الحق من الباطل ذكر أن الناس على قسمين: مستجيب لربه، فذكر ثوابه، وغير مستجيب فذكر عقابه فقال: { لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ } أي: انقادت قلوبهم للعلم والإيمان وجوارحهم للأمر والنهي، وصاروا موافقين لربهم فيما يريده منهم، فلهم { الْحُسْنَى } أي: الحالة الحسنة والثواب الحسن.\nفلهم من الصفات أجلها ومن المناقب أفضلها ومن الثواب العاجل والآجل ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر، { وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ } بعد ما ضرب لهم الأمثال وبين لهم الحق، لهم الحالة غير الحسنة، فـ { لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا } من ذهب وفضة وغيرها، { وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ } من عذاب يوم القيامة ما تقبل منهم وأنى لهم ذلك؟\"\n{ أُولَئِكَ لَهُمْ سُوءُ الْحِسَابِ } وهو الحساب الذي يأتي على كل ما أسلفوه من عمل سيئ وما ضيعوه من حقوق الله وحقوق عباده قد كتب ذلك وسطر عليهم وقالوا: { يا ويلتنا ما لهذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا } { و } بعد هذا الحساب السيئ { وَمَأْوَاهُمْ جَهَنَّمُ } الجامعة لكل عذاب، من الجوع الشديد، والعطش الوجيع، والنار الحامية والزقوم والزمهرير، والضريع وجميع ما ذكره الله من أصناف العذاب { وَبِئْسَ الْمِهَادُ } أي: المقر والمسكن مسكنهم.\n                                    "
    }
  },
  {
    "id": 18,
    "versesNumber": 19,
    "souraName": "Ar-Ra'd.html",
    "contnent": "۞ أَفَمَن يَعۡلَمُ أَنَّمَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰٓۚ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ ١٩",
    "tafsier": {
      "ibnkther": "۞ أَفَمَن يَعۡلَمُ أَنَّمَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰٓۚ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ ١٩\n                                    \n                                    \n                                    يقول تعالى : لا يستوي من يعلم من الناس أن الذي ( أنزل إليك ) يا محمد ( من ربك ) هو ) الحق ) أي : الذي لا شك فيه ولا مرية ولا لبس فيه ولا اختلاف فيه ، بل هو كله حق يصدق بعضه بعضا ، لا يضاد شيء منه شيئا آخر ، فأخباره كلها حق ، وأوامره ونواهيه عدل ، كما قال تعالى : ( وتمت كلمة ربك صدقا وعدلا ) [ الأنعام : 115 ] أي : صدقا في الإخبار ، وعدلا في الطلب ، فلا يستوي من تحقق صدق ما جئت به يا محمد ، ومن هو أعمى لا يهتدي إلى خير ولا يفهمه ، ولو فهمه ما انقاد له ، ولا صدقه ولا اتبعه ، كما قال تعالى : ( لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون ) [ الحشر : 20 ] وقال في هذه الآية الكريمة : ( أفمن يعلم أنما أنزل إليك من ربك الحق كمن هو أعمى ) أي : أفهذا كهذا ؟ لا استواء .\nوقوله : ( إنما يتذكر أولو الألباب ) أي : إنما يتعظ ويعتبر ويعقل أولو العقول السليمة الصحيحة جعلنا الله منهم [ بفضله وكرمه ] .يقول تعالى مخبرا عمن اتصف بهذه الصفات الحميدة ، بأن لهم ( عقبى الدار ) وهي العاقبة والنصرة في الدنيا والآخرة .\n                                    ",
      "qortoby": "۞ أَفَمَن يَعۡلَمُ أَنَّمَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰٓۚ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ ١٩\n                                    \n                                    \n                                    قوله تعالى : أفمن يعلم أنما أنزل إليك من ربك الحق كمن هو أعمى هذا مثل ضربه الله للمؤمن والكافر ، وروي أنها نزلت في حمزة بن عبد المطلب - رضي الله عنه - وأبي جهل لعنه الله . والمراد بالعمى عمى القلب ، والجاهل بالدين أعمى القلب . إنما يتذكر أولو الألباب .\n                                    ",
      "saadi": "۞ أَفَمَن يَعۡلَمُ أَنَّمَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰٓۚ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ ١٩\n                                        \n                                        \n                                        \n                                        يقول تعالى: مفرقا بين أهل العلم والعمل وبين ضدهم: { أَفَمَنْ يَعْلَمُ أَنَّمَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ } ففهم ذلك وعمل به. { كَمَنْ هُوَ أَعْمَى } لا يعلم الحق ولا يعمل به فبينهما من الفرق كما بين السماء والأرض، فحقيق بالعبد أن يتذكر ويتفكر أي الفريقين أحسن حالا وخير مآلا فيؤثر طريقها ويسلك خلف فريقها، ولكن ما كل أحد يتذكر ما ينفعه ويضره.\n{ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ } أي: أولو العقول الرزينة، والآراء الكاملة، الذين هم لُبّ العالم، وصفوة بني آدم\n                                    "
    }
  },
  {
    "id": 19,
    "versesNumber": 20,
    "souraName": "Ar-Ra'd.html",
    "contnent": "ٱلَّذِينَ يُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلۡمِيثَٰقَ ٠٢",
    "tafsier": {
      "ibnkther": "ٱلَّذِينَ يُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلۡمِيثَٰقَ ٠٢\n                                    \n                                    \n                                    ( الذين يوفون بعهد الله ولا ينقضون الميثاق ) وليسوا كالمنافقين الذين إذا عاهد أحدهم غدر ، وإذا خاصم فجر ، وإذا حدث كذب ، وإذا ائتمن خان .\n                                    ",
      "qortoby": "ٱلَّذِينَ يُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلۡمِيثَٰقَ ٠٢\n                                    \n                                    \n                                    قوله تعالى : الذين يوفون بعهد الله ولا ينقضون الميثاق فيه مسألتان :\nالأولى : قوله تعالى : الذين يوفون بعهد الله هذا من صفة ذوي الألباب ، أي إنما يتذكر أولو الألباب الموفون بعهد الله . والعهد اسم للجنس ; أي بجميع عهود الله ، وهي أوامره ونواهيه التي وصى بها عبيده ; ويدخل في هذه الألفاظ التزام جميع الفروض ، وتجنب جميع المعاصي . وقوله : ولا ينقضون الميثاق يحتمل أن يريد به جنس المواثيق ، أي إذا عقدوا في طاعة الله عهدا لم ينقضوه . قال قتادة : تقدم الله إلى عباده في نقض الميثاق ونهى عنه في بضع وعشرين آية ; ويحتمل أن يشير إلى ميثاق بعينه ، هو الذي أخذه الله على عباده حين أخرجهم من صلب أبيهم آدم . وقال القفال : هو ما ركب في عقولهم من دلائل التوحيد والنبوات .\nالثانية : روى أبو داود وغيره عن عوف بن مالك قال : كنا عند رسول الله - صلى الله عليه وسلم - سبعة أو ثمانية أو تسعة فقال : ألا تبايعون رسول الله - صلى الله عليه وسلم - وكنا حديث عهد ببيعة فقلنا : قد بايعناك حتى قالها ثلاثا ; فبسطنا أيدينا فبايعناه ، فقال قائل : يا رسول الله ! إنا قد بايعناك فعلى ماذا نبايعك ؟ قال : أن تعبدوا الله ولا تشركوا به شيئا وتصلوا الصلوات الخمس وتسمعوا وتطيعوا - وأسر كلمة خفية - قال : لا تسألوا الناس شيئا . قال : ولقد كان بعض أولئك النفر يسقط - سوطه فما يسأل أحدا أن يناوله إياه . قال ابن العربي : من أعظم المواثيق في الذكر ألا يسأل سواه ; فقد كان أبو حمزة الخراساني من كبار العباد سمع أن أناسا بايعوا رسول الله - صلى الله عليه وسلم - ألا يسألوا أحدا شيئا ، الحديث ; فقال أبو حمزة : رب ! إن هؤلاء عاهدوا نبيك إذ رأوه ، وأنا أعاهدك ألا أسأل أحدا شيئا ; قال : فخرج حاجا من الشام يريد مكة فبينما هو يمشي في الطريق من الليل إذ بقي عن أصحابه لعذر ثم أتبعهم ، فبينما هو يمشي إليهم إذ سقط في بئر على حاشية الطريق ; فلما حل في قعره قال : أستغيث لعل أحدا يسمعني . ثم قال : إن الذي عاهدته يراني ويسمعني ، والله ! لا تكلمت بحرف للبشر ، ثم لم يلبث إلا يسيرا إذ مر بذلك البئر نفر ، فلما رأوه على حاشية الطريق قالوا : إنه لينبغي سد هذا البئر ; ثم قطعوا خشبا ونصبوها على فم البئر وغطوها بالتراب ; فلما رأى ذلك أبو حمزة قال : هذه مهلكة ، ثم أراد أن يستغيث بهم ، ثم قال : والله ! لا أخرج منها أبدا ; ثم رجع إلى نفسه فقال : أليس قد عاهدت من يراك ؟ فسكت وتوكل ، ثم استند في قعر البئر مفكرا في أمره ، فإذا بالتراب يقع عليه ; والخشب يرفع عنه ، وسمع في أثناء ذلك من يقول : هات يدك ! قال : فأعطيته يدي فأقلني في مرة واحدة إلى فم البئر ; فخرجت فلم أر أحدا ; فسمعت هاتفا يقول : كيف رأيت ثمرة التوكل ; وأنشد :\nنهاني حيائي منك أن أكشف الهوى فأغنيتني بالعلم منك عن الكشف تلطفت في أمري فأبديت شاهدي\nإلى غائبي واللطف يدرك باللطف تراءيت لي بالعلم حتى كأنما\nتخبرني بالغيب أنك في كف أراني وبي من هيبتي لك وحشة\nفتؤنسني باللطف منك وبالعطف وتحيي محبا أنت في الحب حتفه\nوذا عجب كيف الحياة مع الحتف\nقال ابن العربي : هذا رجل عاهد الله فوجد الوفاء على التمام والكمال ، فاقتدوا به إن شاء الله تهتدوا . قال أبو الفرج الجوزي : سكوت هذا الرجل في هذا المقام على التوكل بزعمه إعانة على نفسه ، وذلك لا يحل ; ولو فهم معنى التوكل لعلم أنه لا ينافي استغاثته في تلك الحالة ; كما لم يخرج رسول الله - صلى الله عليه وسلم - من التوكل بإخفائه الخروج من مكة ، واستئجاره دليلا ، واستكتامه ذلك الأمر ، واستتاره في الغار ، وقوله لسراقة : اخف عنا . فالتوكل الممدوح لا ينال بفعل محظور ; وسكوت هذا الواقع في البئر محظور عليه ، وبيان ذلك أن الله تعالى قد خلق للآدمي آلة يدفع عنه بها الضرر ، وآلة يجتلب بها النفع ، فإذا عطلها مدعيا للتوكل كان ذلك جهلا بالتوكل ، وردا لحكمة التواضع ; لأن التوكل إنما هو اعتماد القلب على الله تعالى ، وليس من ضرورته قطع الأسباب ; ولو أن إنسانا جاع فلم يسأل حتى مات دخل النار ; قاله سفيان الثوري وغيره ، لأنه قد دل على طريقة السلامة ، فإذا تقاعد عنها أعان على نفسه . وقال أبو الفرج : ولا التفات إلى قول أبي حمزة : \" فجاء أسد فأخرجني \" فإنه إن صح ذلك فقد يقع مثله اتفاقا وقد يكون لطفا من الله تعالى بالعبد الجاهل ، ولا ينكر أن يكون الله تعالى لطف به ، إنما ينكر فعله الذي هو كسبه ، وهو إعانته على نفسه التي هي وديعة لله تعالى عنده ، وقد أمره بحفظها .\n                                    ",
      "saadi": "ٱلَّذِينَ يُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلۡمِيثَٰقَ ٠٢\n                                        \n                                        \n                                        \n                                        فإن سألت عن وصفهم، فلا تجد أحسن من وصف الله لهم بقوله:\n{ الَّذِينَ يُوفُونَ بِعَهْدِ اللَّهِ } الذي عهده إليهم والذي عاهدهم عليه من القيام بحقوقه كاملة موفرة، فالوفاء بها توفيتها حقها من التتميم لها، والنصح فيها { و } من تمام الوفاء بها أنهم { لَا يَنْقُضُونَ الْمِيثَاقَ } أي: العهد الذي عاهدوا عليه الله، فدخل في ذلك جميع المواثيق والعهود والأيمان والنذور، التي يعقدها العباد. فلا يكون العبد من أولي الألباب الذين لهم الثواب العظيم، إلا بأدائها كاملة، وعدم نقضها وبخسها.\n                                    "
    }
  },
  {
    "id": 20,
    "versesNumber": 21,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخۡشَوۡنَ رَبَّهُمۡ وَيَخَافُونَ سُوٓءَ ٱلۡحِسَابِ ١٢",
    "tafsier": {
      "ibnkther": "وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخۡشَوۡنَ رَبَّهُمۡ وَيَخَافُونَ سُوٓءَ ٱلۡحِسَابِ ١٢\n                                    \n                                    \n                                    ( والذين يصلون ما أمر الله به أن يوصل ) من صلة الأرحام ، والإحسان إليهم وإلى الفقراء والمحاويج ، وبذل المعروف ، ( ويخشون ربهم ) أي : فيما يأتون وما يذرون من الأعمال ، يراقبون الله في ذلك ، ويخافون سوء الحساب في الدار الآخرة . فلهذا أمرهم على السداد والاستقامة في جميع حركاتهم وسكناتهم وجميع أحوالهم القاصرة والمتعدية .\n                                    ",
      "qortoby": "وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخۡشَوۡنَ رَبَّهُمۡ وَيَخَافُونَ سُوٓءَ ٱلۡحِسَابِ ١٢\n                                    \n                                    \n                                    قوله تعالى : والذين يصلون ما أمر الله به أن يوصل ظاهر في صلة الأرحام ، وهو قول قتادة وأكثر المفسرين ، وهو مع ذلك يتناول جميع الطاعات . \" ويخشون ربهم \" قيل : في قطع الرحم . وقيل : في جميع المعاصي .\n\" ويخافون سوء الحساب \" ، سوء الحساب الاستقصاء فيه والمناقشة ; ومن نوقش الحساب عذب . وقال ابن عباس وسعيد بن جبير :\nمعنى . \" يصلون ما أمر الله به \" الإيمان بجميع الكتب والرسل كلهم . الحسن : هو صلة محمد - صلى الله عليه وسلم - . ويحتمل رابعا : أن يصلوا الإيمان بالعمل الصالح ; \" ويخشون ربهم \" فيما أمرهم بوصله ، \" ويخافون سوء الحساب \" في تركه ; والقول الأول يتناول هذه الأقوال كما ذكرنا ، وبالله توفيقنا .\n                                    ",
      "saadi": "وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخۡشَوۡنَ رَبَّهُمۡ وَيَخَافُونَ سُوٓءَ ٱلۡحِسَابِ ١٢\n                                        \n                                        \n                                        \n                                        { وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ } وهذا عام في كل ما أمر الله بوصله، من الإيمان به وبرسوله، ومحبته ومحبة رسوله، والانقياد لعبادته وحده لا شريك له، ولطاعة رسوله.\nويصلون آباءهم وأمهاتهم ببرهم بالقول والفعل وعدم عقوقهم، ويصلون الأقارب والأرحام، بالإحسان إليهم قولا وفعلا، ويصلون ما بينهم وبين الأزواج والأصحاب والمماليك، بأداء حقهم كاملا موفرا من الحقوق الدينية والدنيوية.\nوالسبب الذي يجعل العبد واصلا ما أمر الله به أن يوصل، خشية الله وخوف يوم الحساب، ولهذا قال: { وَيَخْشَوْنَ رَبَّهُمْ } أي: يخافونه،\nفيمنعهم خوفهم منه، ومن القدوم عليه يوم الحساب، أن يتجرؤوا على معاصي الله، أو يقصروا في شيء مما أمر الله به خوفا من العقاب ورجاء للثواب.\n                                    "
    }
  },
  {
    "id": 21,
    "versesNumber": 22,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ ٢٢",
    "tafsier": {
      "ibnkther": "وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ ٢٢\n                                    \n                                    \n                                    ( والذين صبروا ابتغاء وجه ربهم ) أي : عن المحارم والمآثم ، ففطموا نفوسهم عن ذلك لله عز وجل; ابتغاء مرضاته وجزيل ثوابه ( وأقاموا الصلاة ) بحدودها ومواقيتها وركوعها وسجودها وخشوعها على الوجه الشرعي المرضي ، ( وأنفقوا مما رزقناهم ) أي : على الذين يجب عليهم الإنفاق لهم من زوجات وقرابات وأجانب ، من فقراء ومحاويج ومساكين ، ( سرا وعلانية ) أي : في السر والجهر ، لم يمنعهم من ذلك حال من الأحوال ، في آناء الليل وأطراف النهار ، ( ويدرءون بالحسنة السيئة ) أي : يدفعون القبيح بالحسن ، فإذا آذاهم أحد قابلوه بالجميل صبرا واحتمالا وصفحا وعفوا ، كما قال تعالى : ( ادفع بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم وما يلقاها إلا الذين صبروا وما يلقاها إلا ذو حظ عظيم ) [ فصلت : 34 ، 35 ] ; ولهذا قال مخبرا عن هؤلاء السعداء المتصفين بهذه الصفات الحسنة بأن لهم عقبى الدار.\n                                    ",
      "qortoby": "وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ ٢٢\n                                    \n                                    \n                                    قوله تعالى : والذين صبروا ابتغاء وجه ربهم قيل : \" الذين \" مستأنف ; لأن صبروا ماض فلا ينعطف على \" يوفون \" وقيل : هو من وصف من تقدم ، ويجوز الوصف تارة بلفظ الماضي ، وتارة بلفظ المستقبل ; لأن المعنى من يفعل كذا فله كذا ; ولما كان الذين يتضمن الشرط ، والماضي في الشرط كالمستقبل جاز ذلك ; ولهذا قال : الذين يوفون ثم قال : والذين صبروا ثم عطف عليه فقال : ويدرءون بالحسنة السيئة . قال ابن زيد : صبروا على طاعة الله ، وصبروا عن معصية الله . وقال عطاء : صبروا على الرزايا والمصائب والحوادث والنوائب . وقال أبو عمران الجوني : صبروا على دينهم ابتغاء وجه الله\nوأقاموا الصلاة أدوها بفروضها وخشوعها في مواقيتها .\nوأنفقوا مما رزقناهم سرا وعلانية يعني الزكاة المفروضة ، عن ابن عباس ، وقد مضى القول في هذا في \" البقرة \" وغيرها\nويدرءون بالحسنة السيئة أي يدفعون بالعمل الصالح السيئ من الأعمال ، قاله ابن عباس . ابن زيد : يدفعون الشر بالخير . سعيد بن جبير : يدفعون المنكر بالمعروف . الضحاك : يدفعون الفحش بالسلام . جويبر : يدفعون الظلم بالعفو . ابن شجرة : يدفعون الذنب بالتوبة . القتبي : يدفعون سفه الجاهل بالحلم ; فالسفه السيئة ، والحلم الحسنة . وقيل : إذا هموا بسيئة رجعوا عنها واستغفروا . وقيل : يدفعون الشرك بشهادة أن لا إله إلا الله ; فهذه تسعة أقوال معناها كلها متقارب ، والأول يتناولها بالعموم ; ونظيره : إن الحسنات يذهبن السيئات ومنه قوله - عليه السلام - لمعاذ : وأتبع السيئة الحسنة تمحها وخالق الناس بخلق حسن .\nأولئك لهم عقبى الدار أي عاقبة الآخرة ، وهي الجنة بدل النار ، والدار غدا داران : الجنة للمطيع ، والنار للعاصي ; فلما ذكر وصف المطيعين فدارهم الجنة لا محالة . وقيل : عني بالدار دار الدنيا ; أي لهم جزاء ما عملوا من الطاعات في دار الدنيا .\n                                    ",
      "saadi": "وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ ٢٢\n                                        \n                                        \n                                        \n                                        { وَالَّذِينَ صَبَرُوا } علىالمأمورات بالامتثال، وعن المنهيات بالانكفاف عنها والبعد منها، وعلى أقدار الله المؤلمة بعدم تسخطها.\nولكن بشرط أن يكون ذلك الصبر { ابْتِغَاءَ وَجْهِ رَبِّهِمْ } لا لغير ذلك من المقاصد والأغراض الفاسدة فإن هذا هو الصبر النافع الذي يحبس به العبد نفسه، طلبا لمرضاة ربه، ورجاء للقرب منه، والحظوة بثوابه، وهو الصبر الذي من خصائص أهل الإيمان، وأما الصبر المشترك الذي غايته التجلد ومنتهاه الفخر، فهذا يصدر من البر والفاجر، والمؤمن والكافر، فليس هو الممدوح على الحقيقة.\n{ وَأَقَامُوا الصَّلَاةَ } بأركانها وشروطها ومكملاتها ظاهرا وباطنا، { وَأَنْفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً } دخل في ذلك النفقات الواجبة كالزكوات والكفارات والنفقات المستحبة وأنهم ينفقون حيث دعت الحاجة إلى النفقة، سرا وعلانية، { وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ } أي: من أساء إليهم بقول أو فعل، لم يقابلوه بفعله، بل قابلوه بالإحسان إليه.\nفيعطون من حرمهم، ويعفون عمن ظلمهم، ويصلون من قطعهم، ويحسنون إلى من أساء إليهم، وإذا كانوا يقابلون المسيء بالإحسان، فما ظنك بغير المسيء؟!{ أُولَئِكَ } الذين وصفت صفاتهم الجليلة ومناقبهم الجميلة { لَهُمْ عُقْبَى الدَّارِ }\n                                    "
    }
  },
  {
    "id": 22,
    "versesNumber": 23,
    "souraName": "Ar-Ra'd.html",
    "contnent": "جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۖ وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ ٣٢",
    "tafsier": {
      "ibnkther": "جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۖ وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ ٣٢\n                                    \n                                    \n                                    ثم فسر ذلك بقوله : ( جنات عدن ) والعدن : الإقامة ، أي : جنات إقامة يخلدون فيها .\nوعن عبد الله بن عمرو أنه قال : إن في الجنة قصرا يقال له : \" عدن \" ، حوله البروج والمروج ، فيه خمسة آلاف باب ، على كل باب خمسة آلاف حبرة لا يدخله إلا نبي أو صديق أو شهيد .\nوقال الضحاك في قوله : ( جنات عدن ) مدينة الجنة ، فيها الرسل والأنبياء والشهداء وأئمة الهدى ، والناس حولهم بعد والجنات حولها . رواهما ابن جرير .\nوقوله : ( ومن صلح من آبائهم وأزواجهم وذرياتهم ) أي : يجمع بينهم وبين أحبابهم فيها من الآباء والأهلين والأبناء ، ممن هو صالح لدخول الجنة من المؤمنين; لتقر أعينهم بهم ، حتى إنه ترفع درجة الأدنى إلى درجة الأعلى ، من غير تنقيص لذلك الأعلى عن درجته ، بل امتنانا من الله وإحسانا ، كما قال تعالى : ( والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء كل امرئ بما كسب رهين ) [ الطور : 21 ] .\n( والملائكة يدخلون عليهم من كل باب )\n                                    ",
      "qortoby": "جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۖ وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ ٣٢\n                                    \n                                    \n                                    قوله تعالى : جنات عدن يدخلونها أي لهم جنات عدن ; ف \" جنات عدن \" بدل من عقبى ويجوز أن تكون تفسيرا ل \" عقبى الدار \" أي لهم دخول جنات عدن ; لأن عقبى الدار حدث و \" جنات عدن \" عين ، والحدث إنما يفسر بحدث مثله ; فالمصدر المحذوف مضاف إلى المفعول . ويجوز أن يكون \" جنات عدن \" خبر ابتداء محذوف . و \" جنات عدن \" وسط الجنة وقصبتها ، وسقفها عرش الرحمن ; قاله القشيري أبو نصر عبد الملك . وفي صحيح البخاري : إذا سألتم الله فاسألوه الفردوس فإنه أوسط الجنة وأعلى الجنة وفوقه عرش الرحمن ومنه تفجر أنهار الجنة فيحتمل أن يكون \" جنات \" كذلك إن صح فذلك خبر . وقال عبد الله بن عمرو : إن في الجنة قصرا يقال له عدن ، حوله البروج والمروج ; فيه ألف باب ، على كل باب خمسة آلاف حبرة لا يدخله إلا نبي أو صديق أو شهيد . وعدن مأخوذ من عدن بالمكان إذا أقام فيه ; على ما يأتي بيانه في سورة \" الكهف \" إن شاء الله تعالى .\nومن صلح من آبائهم وأزواجهم وذرياتهم يجوز أن يكون معطوفا على أولئك المعنى : أولئك ومن صلح من آبائهم وأزواجهم وذرياتهم لهم عقبى الدار . ويجوز أن يكون معطوفا على الضمير المرفوع في \" يدخلونها \" وحسن العطف لما حال الضمير المنصوب بينهما . ويجوز أن يكون المعنى : يدخلونها ويدخلها من صلح من آبائهم ، أي من كان صالحا ، لا يدخلونها بالأنساب . ويجوز أن يكون موضع \" من \" نصبا على تقدير : يدخلونها مع من صلح من آبائهم ، وإن لم يعمل مثل أعمالهم يلحقه الله بهم كرامة لهم . وقال ابن عباس : هذا الصلاح الإيمان بالله والرسول ، ولو كان لهم مع الإيمان طاعات أخرى لدخلوها بطاعتهم لا على وجه التبعية . قال القشيري : وفي هذا نظر ; لأنه لا بد من الإيمان ، فالقول في اشتراط العمل الصالح كالقول في اشتراط الإيمان . فالأظهر أن هذا الصلاح في جملة الأعمال ، والمعنى : أن النعمة غدا تتم عليهم بأن جعلهم مجتمعين مع قرابتهم في الجنة ، وإن دخلها كل إنسان بعمل نفسه ; بل برحمة الله تعالى .\nقوله تعالى : والملائكة يدخلون عليهم من كل باب أي بالتحف والهدايا من عند الله تكرمة لهم .\n                                    ",
      "saadi": "جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۖ وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ ٣٢\n                                        \n                                        \n                                        \n                                        { جَنَّاتِ عَدْنٍ } أي: إقامة لا يزولون عنها، ولا يبغون عنها حولا؛ لأنهم لا يرون فوقها غاية لما اشتملت عليه من النعيم والسرور، الذي تنتهي إليه المطالب والغايات. ومن تمام نعيمهم وقرة أعينهم أنهم { يَدْخُلُونَهَا وَمَنْ صَلَحَ مِنْ آبَائِهِمْ } من الذكور والإناث { وَأَزْوَاجِهِمْ } أي الزوج أو الزوجة وكذلك النظراء والأشباه، والأصحاب والأحباب، فإنهم من أزواجهم وذرياتهم، { وَالْمَلَائِكَةُ يَدْخُلُونَ عَلَيْهِمْ مِنْ كُلِّ بَابٍ } يهنئونهم بالسلامة وكرامة الله لهم\n                                    "
    }
  },
  {
    "id": 23,
    "versesNumber": 24,
    "souraName": "Ar-Ra'd.html",
    "contnent": "سَلَٰمٌ عَلَيۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ ٤٢",
    "tafsier": {
      "ibnkther": "سَلَٰمٌ عَلَيۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ ٤٢\n                                    \n                                    \n                                    أي : وتدخل عليهم الملائكة من هاهنا وهاهنا للتهنئة بدخول الجنة ، فعند دخولهم إياها تفد عليهم الملائكة مسلمين مهنئين لهم بما حصل لهم من الله من التقريب والإنعام ، والإقامة في دار السلام ، في جوار الصديقين والأنبياء والرسل الكرام .\nوقال الإمام أحمد ، رحمه الله : حدثنا أبو عبد الرحمن ، حدثني سعيد بن أبي أيوب ، حدثنا معروف بن سويد الجذامي عن أبي عشانة المعافري ، عن عبد الله بن عمرو بن العاص ، رضي الله عنهما عن رسول الله صلى الله عليه وسلم أنه قال : \" هل تدرون أول من يدخل الجنة من خلق الله ؟ \" قالوا : الله ورسوله أعلم . قال : \" أول من يدخل الجنة من خلق الله الفقراء المهاجرون الذين تسد بهم الثغور ، وتتقى بهم المكاره ، ويموت أحدهم وحاجته في صدره لا يستطيع لها قضاء ، فيقول الله تعالى لمن يشاء من ملائكته : ائتوهم فحيوهم . فتقول الملائكة : نحن سكان سمائك ، وخيرتك من خلقك ، أفتأمرنا أن نأتي هؤلاء فنسلم عليهم ؟ قال : إنهم كانوا عبادا يعبدونني لا يشركون بي شيئا ، وتسد بهم الثغور ، وتتقى بهم المكاره ، ويموت أحدهم وحاجته في صدره فلا يستطيع لها قضاء \" . قال : \" فتأتيهم الملائكة عند ذلك ، فيدخلون عليهم من كل باب ، ( سلام عليكم بما صبرتم فنعم عقبى الدار )\nورواه أبو القاسم الطبراني ، عن أحمد بن رشدين ، عن أحمد بن صالح ، عن عبد الله بن وهب ، عن عمرو بن الحارث ، عن أبي عشانة سمع عبد الله بن عمرو ، عن النبي - صلى الله عليه وسلم - قال : \" أول ثلة يدخلون الجنة فقراء المهاجرين ، الذين تتقى بهم المكاره ، وإذا أمروا سمعوا وأطاعوا ، وإن كانت لرجل منهم حاجة إلى سلطان لم تقض حتى يموت وهي في صدره ، وإن الله يدعو يوم القيامة الجنة فتأتي بزخرفها وزينتها ، فيقول : أين عبادي الذين قاتلوا في سبيلي ، وأوذوا في سبيلي ، وجاهدوا في سبيلي ؟ ادخلوا الجنة بغير عذاب ولا حساب ، وتأتي الملائكة فيسجدون ويقولون : ربنا نحن نسبحك الليل والنهار ، ونقدس لك ، من هؤلاء الذين آثرتهم علينا ؟ فيقول الرب عز وجل : هؤلاء عبادي الذين جاهدوا في سبيلي ، وأوذوا في سبيلي فتدخل عليهم الملائكة من كل باب : ( سلام عليكم بما صبرتم فنعم عقبى الدار )\nوقال عبد الله بن المبارك ، عن بقية بن الوليد ، حدثنا أرطاة بن المنذر ، سمعت رجلا من مشيخة الجند ، يقال له \" أبو الحجاج \" يقول : جلست إلى أبي أمامة فقال : إن المؤمن ليكون متكئا على أريكته إذا دخل الجنة ، وعنده سماطان من خدم ، وعند طرف السماطين باب مبوب ، فيقبل الملك فيستأذن ، فيقول [ أقصى الخدم ] للذي يليه : \" ملك يستأذن \" ، ويقول الذي يليه للذي يليه : \" ملك يستأذن \" ، حتى يبلغ المؤمن فيقول : ائذنوا . فيقول أقربهم إلى المؤمن : ائذنوا ، ويقول الذي يليه للذي يليه : ائذنوا حتى يبلغ أقصاهم الذي عند الباب ، فيفتح له ، فيدخل فيسلم ثم ينصرف . رواه ابن جرير .\nورواه ابن أبي حاتم من حديث إسماعيل بن عياش ، عن أرطاة بن المنذر ، عن أبي الحجاج يوسف الألهاني قال : سمعت أبا أمامة ، فذكر نحوه .\nوقد جاء في الحديث : أن رسول الله - صلى الله عليه وسلم - كان يزور قبور الشهداء في رأس كل حول ، فيقول لهم : ( سلام عليكم بما صبرتم فنعم عقبى الدار ) وكذا أبو بكر ، وعمر وعثمان .\n                                    ",
      "qortoby": "سَلَٰمٌ عَلَيۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ ٤٢\n                                    \n                                    \n                                    سلام عليكم أي يقولون : سلام عليكم ; فأضمر القول ، أي قد سلمتم من الآفات والمحن . وقيل : هو دعاء لهم بدوام السلامة ، وإن كانوا سالمين ، أي سلمكم الله ، فهو خبر معناه الدعاء ; ويتضمن الاعتراف بالعبودية .\nبما صبرتم أي بصبركم ; ف \" ما \" مع الفعل بمعنى المصدر ، والباء في \" بما \" متعلقة بمعنى . سلام عليكم ويجوز أن تتعلق بمحذوف ; أي هذه الكرامة بصبركم ، أي على أمر الله تعالى ونهيه ; قال سعيد بن جبير . وقيل : على الفقر في الدنيا ; قاله أبو عمران الجوني . وقيل : على الجهاد في سبيل الله ; كما روي عن عبد الله بن عمر قال : قال رسول الله - صلى الله عليه وسلم - : هل تدرون من يدخل الجنة من خلق الله ؟ قالوا : الله ورسوله أعلم ; قال : المجاهدون الذين تسد بهم الثغور وتتقى بهم المكاره فيموت أحدهم وحاجته في نفسه لا يستطيع لها قضاء فتأتيهم الملائكة فيدخلون عليهم من كل باب سلام عليكم بما صبرتم فنعم عقبى الدار . وقال محمد بن إبراهيم : كان النبي - صلى الله عليه وسلم - يأتي قبور الشهداء على رأس كل حول فيقول : السلام عليكم بما صبرتم فنعم عقبى الدار وكذلك أبو بكر وعمر وعثمان ; وذكره البيهقي عن أبي هريرة قال : كان النبي - صلى الله عليه وسلم - يأتي الشهداء ، فإذا أتى فرضة الشعب يقول : السلام عليكم بما صبرتم فنعم عقبى الدار . ثم كان أبو بكر بعد النبي - صلى الله عليه وسلم - يفعله ، وكان عمر بعد أبي بكر يفعله ، وكان عثمان بعد عمر يفعله . وقال الحسن البصري - رحمه الله - : بما صبرتم عن فضول الدنيا . وقيل : بما صبرتم على ملازمة الطاعة ، ومفارقة المعصية ; قال معناه الفضيل بن عياض . ابن زيد : بما صبرتم عما تحبونه إذا فقدتموه . ويحتمل سابعا - بما صبرتم عن اتباع الشهوات . وعن عبد الله بن سلام وعلي بن الحسين - رضي الله عنهم - أنهما قالا : إذا كان يوم القيامة ينادي مناد ليقم أهل الصبر ; فيقوم ناس من الناس فيقال لهم : انطلقوا إلى الجنة فتتلقاهم الملائكة فيقولون : إلى أين ؟ فيقولون : إلى الجنة ; قالوا : قبل الحساب ؟ قالوا نعم ! فيقولون : من أنتم ؟ فيقولون : نحن أهل الصبر ، قالوا : وما كان صبركم ؟ قالوا : صبرنا أنفسنا على طاعة الله ، وصبرناها عن معاصي الله وصبرناها على البلاء والمحن في الدنيا . قال علي بن الحسين : فتقول لهم الملائكة : ادخلوا الجنة فنعم أجر العاملين . وقال ابن سلام : فتقول لهم الملائكة : سلام عليكم بما صبرتم .\nفنعم عقبى الدار أي نعم عاقبة الدار التي كنتم فيها ; عملتم فيها ما أعقبكم هذا الذي أنتم فيه ; فالعقبى على هذا اسم ، والدار هي الدنيا . وقال أبو عمران الجوني : فنعم عقبى الدار الجنة عن النار . وعنه : فنعم عقبى الدار الجنة عن الدنيا\n                                    ",
      "saadi": "سَلَٰمٌ عَلَيۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ ٤٢\n                                        \n                                        \n                                        \n                                        { سَلَامٌ عَلَيْكُمْ } أي: حلت عليكم السلامة والتحية من الله وحصلت لكم، وذلك متضمن لزوال كل مكروه، ومستلزم لحصول كل محبوب.\n{ بِمَا صَبَرْتُمْ } أي: صبركم هو الذي أوصلكم إلى هذه المنازل العالية، والجنان الغالية، { فَنِعْمَ عُقْبَى الدَّارِ }\nفحقيق بمن نصح نفسه وكان لها عنده قيمة، أن يجاهدها، لعلها تأخذ من أوصاف أولي الألباب بنصيب، لعلها تحظى بهذه الدار، التي هي منية النفوس، وسرور الأرواح الجامعة لجميع اللذات والأفراح، فلمثلها فليعمل العاملون وفيها فليتنافس المتنافسون.\n                                    "
    }
  },
  {
    "id": 24,
    "versesNumber": 25,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ أُوْلَٰٓئِكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ ٥٢",
    "tafsier": {
      "ibnkther": "وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ أُوْلَٰٓئِكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ ٥٢\n                                    \n                                    \n                                    هذا حال الأشقياء وصفاتهم ، وذكر مآلهم في الدار الآخرة ومصيرهم إلى خلاف ما صار إليه المؤمنون ، كما أنهم اتصفوا بخلاف صفاتهم في الدنيا ، فأولئك كانوا يوفون بعهد الله ويصلون ما أمر الله به أن يوصل ، وهؤلاء ( ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض ) كما ثبت في الحديث : \" آية المنافق ثلاث : إذا حدث كذب ، وإذا وعد أخلف ، وإذا ائتمن خان \" وفي رواية : \" وإذا عاهد غدر ، وإذا خاصم فجر \" .\nولهذا قال : ( أولئك لهم اللعنة ) وهي الإبعاد عن الرحمة ، ( ولهم سوء الدار ) وهي سوء العاقبة والمآل ، ومأواهم جهنم وبئس القرار .\nوقال أبو العالية في قوله : ( والذين ينقضون عهد الله ) الآية ، قال : هي ست خصال في المنافقين إذا كان فيهم الظهرة على الناس أظهروا هذه الخصال : إذا حدثوا كذبوا ، وإذا وعدوا أخلفوا ، وإذا ائتمنوا خانوا ، ونقضوا عهد الله من بعد ميثاقه ، وقطعوا ما أمر الله به أن يوصل ، وأفسدوا في الأرض . وإذا كانت الظهرة عليهم أظهروا الثلاث الخصال : إذا حدثوا كذبوا ، وإذا وعدوا أخلفوا ، وإذا ائتمنوا خانوا .\n                                    ",
      "qortoby": "وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ أُوْلَٰٓئِكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ ٥٢\n                                    \n                                    \n                                    قوله تعالى : والذين ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض أولئك لهم اللعنة ولهم سوء الدار الله يبسط الرزق لمن يشاء ويقدر وفرحوا بالحياة الدنيا وما الحياة الدنيا في الآخرة إلا متاع\nقوله تعالى : والذين ينقضون عهد الله من بعد ميثاقه لما ذكر الموفين بعهده ، والمواصلين لأمره ، وذكر ما لهم ذكر عكسهم . نقض الميثاق : ترك أمره . وقيل : إهمال عقولهم ، فلا يتدبرون بها ليعرفوا الله تعالى .\nويقطعون ما أمر الله به أن يوصل أي من الأرحام . والإيمان بجميع الأنبياء .\nويفسدون في الأرض أي بالكفر وارتكاب المعاصي\nأولئك لهم اللعنة أي الطرد والإبعاد من الرحمة .\nولهم سوء الدار أي سوء المنقلب ، وهو جهنم . وقال سعد بن أبي وقاص : والله الذي لا إله إلا هو ! إنهم الحرورية .\n                                    ",
      "saadi": "وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ أُوْلَٰٓئِكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوٓءُ ٱلدَّارِ ٥٢\n                                        \n                                        \n                                        \n                                        لما ذكر حال أهل الجنة ذكر أن أهل النار بعكس ما وصفهم به، فقال عنهم: { والَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِ } أي: من بعد ما أكده عليهم على أيدي رسله، وغلظ عليهم، فلم يقابلوه بالانقياد والتسليم، بل قابلوه بالإعراض والنقص، { وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ } فلم يصلوا ما بينهم وبين ربهم بالإيمان والعمل الصالح، ولا وصلوا الأرحام ولا أدوا الحقوق، بل أفسدوا في الأرض بالكفر والمعاصي، والصد عن سبيل الله وابتغائها عوجا، { أُولَئِكَ لَهُمُ اللَّعْنَةُ } أي: البعد والذم من الله وملائكته وعباده المؤمنين، { وَلَهُمْ سُوءُ الدَّارِ } وهي: الجحيم بما فيها من العذاب الأليم.\n                                    "
    }
  },
  {
    "id": 25,
    "versesNumber": 26,
    "souraName": "Ar-Ra'd.html",
    "contnent": "ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ ٦٢",
    "tafsier": {
      "ibnkther": "ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ ٦٢\n                                    \n                                    \n                                    يذكر تعالى أنه هو الذي يوسع الرزق على من يشاء ، ويقتره على من يشاء ، لما له في ذلك من الحكمة والعدل . وفرح هؤلاء الكفار بما أوتوا في الحياة الدنيا استدراجا لهم وإمهالا كما قال تعالى : ( أيحسبون أنما نمدهم به من مال وبنين نسارع لهم في الخيرات بل لا يشعرون ) [ المؤمنون : 55 ، 56 ] .\nثم حقر الحياة الدنيا بالنسبة إلى ما ادخره تعالى لعباده المؤمنين في الدار الآخرة فقال : ( وما الحياة الدنيا في الآخرة إلا متاع ) كما قال : ( قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا ) [ النساء : 77 ] وقال ( بل تؤثرون الحياة الدنيا والآخرة خير وأبقى ) [ الأعلى : 16 ، 17 ] .\nوقال الإمام أحمد : حدثنا وكيع ويحيى بن سعيد قالا حدثنا إسماعيل بن أبي خالد ، عن قيس ، عن المستورد أخي بني فهر قال : قال رسول الله ، صلى الله عليه وسلم : \" ما الدنيا في الآخرة إلا كمثل ما يجعل أحدكم أصبعه هذه في اليم ، فلينظر بم ترجع \" وأشار بالسبابة . ورواه مسلم في صحيحه .\nوفي الحديث الآخر : أن رسول الله - صلى الله عليه وسلم - مر بجدي أسك ميت - والأسك الصغير الأذنين - فقال : \" والله للدنيا أهون على الله من هذا على أهله حين ألقوه \" .\n                                    ",
      "qortoby": "ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ ٦٢\n                                    \n                                    \n                                    الله يبسط الرزق لمن يشاء ويقدر لما ذكر عاقبة المؤمن وعاقبة المشرك بين أنه تعالى الذي يبسط الرزق ويقدر في الدنيا ، لأنها دار امتحان ; فبسط الرزق على الكافر لا يدل على كرامته ، والتقتير على بعض المؤمنين لا يدل على إهانتهم . ويقدر أي يضيق ; ومنه \" ومن قدر عليه رزقه \" أي ضيق . وقيل : يقدر يعطي بقدر الكفاية .\nوفرحوا بالحياة الدنيا يعني مشركي مكة ; فرحوا بالدنيا ولم يعرفوا غيرها ، وجهلوا ما عند الله ; وهو معطوف على ويفسدون في الأرض . وفي الآية تقديم وتأخير ; التقدير : والذين ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض وفرحوا بالحياة الدنيا .\nوما الحياة الدنيا في الآخرة إلا متاع أي في جنبها . إلا متاع أي متاع من الأمتعة ، كالقصعة والسكرجة . وقال مجاهد : شيء قليل ذاهب من متع النهار إذا ارتفع ; فلا بد له من زوال . ابن عباس : زاد كزاد الراعي . وقيل : متاع الحياة الدنيا ما يستمتع بها منها . وقيل : ما يتزود منها إلى الآخرة من التقوى والعمل الصالح ، \" ولهم سوء الدار \" ، ثم ابتداء . \" الله يبسط الرزق لمن يشاء ويقدر \" أي يوسع ويضيق .\n                                    ",
      "saadi": "ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ ٦٢\n                                        \n                                        \n                                        \n                                        أي: هو وحده يوسع الرزق ويبسطه على من يشاء ويقدره ويضيقه على من يشاء، { وَفَرِحُوا } أي: الكفار { بِالْحَيَاةِ الدُّنْيَا } فرحا أوجب لهم أن يطمئنوا بها، ويغفلوا عن الآخرة وذلك لنقصان عقولهم، { وَمَا الْحَيَاةُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَتَاعٌ } أي: شيء حقير يتمتع به قليلا ويفارق أهله وأصحابه ويعقبهم ويلا طويلا.\n                                    "
    }
  },
  {
    "id": 26,
    "versesNumber": 27,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَنۡ أَنَابَ ٧٢",
    "tafsier": {
      "ibnkther": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَنۡ أَنَابَ ٧٢\n                                    \n                                    \n                                    يخبر تعالى عن قيل المشركين : ( لولا ) أي : هلا ( أنزل عليه آية من ربه ) كما قالوا : ( فليأتنا بآية كما أرسل الأولون ) [ الأنبياء : 5 ] وقد تقدم الكلام على هذا غير مرة ، وإن الله قادر على إجابة ما سألوا . وفي الحديث : أن الله أوحى إلى رسوله لما سألوه أن يحول لهم الصفا ذهبا ، وأن يجري لهم ينبوعا ، وأن يزيح الجبال من حول مكة فيصير مكانها مروج وبساتين : إن شئت يا محمد أعطيتهم ذلك ، فإن كفروا فإني أعذبهم عذابا لا أعذبه أحدا من العالمين ، وإن شئت فتحت عليهم باب التوبة والرحمة ، فقال : \" بل تفتح لهم باب التوبة والرحمة \" ; ولهذا قال لرسوله : ( قل إن الله يضل من يشاء ويهدي إليه من أناب ) أي : هو المضل والهادي ، سواء بعث الرسول بآية على وفق ما اقترحوا ، أو لم يجبهم إلى سؤالهم; فإن الهداية والإضلال ليس منوطا بذلك ولا عدمه ، كما قال : ( وما تغني الآيات والنذر عن قوم لا يؤمنون ) [ يونس : 101 ] وقال ( إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم ) [ يونس : 96 ، 97 ] وقال ( ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون ) [ الأنعام : 111 ] ; ولهذا قال : ( قل إن الله يضل من يشاء ويهدي إليه من أناب ) أي : ويهدي من أناب إلى الله ، ورجع إليه ، واستعان به ، وتضرع لديه .\n                                    ",
      "qortoby": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَنۡ أَنَابَ ٧٢\n                                    \n                                    \n                                    قوله تعالى : ويقول الذين كفروا لولا أنزل عليه آية من ربه قل إن الله يضل من يشاء ويهدي إليه من أناب\nقوله تعالى : ويقول الذين كفروا لولا أنزل عليه آية من ربه بين في مواضع أن اقتراح الآيات على الرسل جهل ، بعد أن رأوا آية واحدة تدل على الصدق ، والقائل ، عبد الله بن أبي أمية وأصحابه حين طالبوا النبي - صلى الله عليه وسلم - بالآيات .\nقل إن الله - عز وجل - يضل من يشاء أي كما أضلكم بعد ما أنزل من الآيات وحرمكم الاستدلال بها يضلكم عند نزول غيرها .\nويهدي إليه من أناب أي من رجع . والهاء في إليه للحق ، أو للإسلام ، أو لله - عز وجل - ; على تقدير : ويهدي إلى دينه وطاعته من رجع إليه بقلبه . وقيل : هي للنبي - صلى الله عليه وسلم - .\n                                    ",
      "saadi": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِيٓ إِلَيۡهِ مَنۡ أَنَابَ ٧٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى أن الذين كفروا بآيات الله يتعنتون على رسول الله، ويقترحون ويقولون: { لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ } وبزعمهم أنها لو جاءت لآمنوا فأجابهم الله بقوله: { قُلْ إِنَّ اللَّهَ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ أَنَابَ } أي: طلب رضوانه، فليست الهداية والضلال بأيديهم حتى يجعلوا ذلك متوقفا على الآيات، ومع ذلك فهم كاذبون، { ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون }\nولا يلزم أن يأتي الرسول بالآية التي يعينونها ويقترحونها، بل إذا جاءهم بآية تبين ما جاء به من الحق، كفى ذلك وحصل المقصود، وكان أنفع لهم من طلبهم الآيات التي يعينونها، فإنها لو جاءتهم طبق ما اقترحوا فلم يؤمنوا بها لعاجلهم العذاب.\n                                    "
    }
  },
  {
    "id": 27,
    "versesNumber": 28,
    "souraName": "Ar-Ra'd.html",
    "contnent": "ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ ٨٢",
    "tafsier": {
      "ibnkther": "ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ ٨٢\n                                    \n                                    \n                                    الذين آمنوا وتطمئن قلوبهم بذكر الله ) أي : تطيب وتركن إلى جانب الله ، وتسكن عند ذكره ، وترضى به مولى ونصيرا; ولهذا قال : ( ألا بذكر الله تطمئن القلوب ) أي : هو حقيق بذلك .\n                                    ",
      "qortoby": "ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ ٨٢\n                                    \n                                    \n                                    قوله تعالى : \" الذين آمنوا \" الذين في موضع نصب ، لأنه مفعول ; أي يهدي الله الذين آمنوا . وقيل بدل من قوله : من أناب فهو في محل نصب أيضا . وتطمئن قلوبهم بذكر الله أي تسكن وتستأنس بتوحيد الله فتطمئن ; قال : أي وهم تطمئن قلوبهم على الدوام بذكر الله بألسنتهم ; قال قتادة : وقال مجاهد وقتادة وغيرهما : بالقرآن . وقال سفيان بن عيينة : بأمره . مقاتل : بوعده . ابن عباس : بالحلف باسمه ، أو تطمئن بذكر فضله وإنعامه ; كما توجل بذكر عدله وانتقامه وقضائه . وقيل : بذكر الله أي يذكرون الله ويتأملون آياته فيعرفون كمال قدرته عن بصيرة .\nألا بذكر الله تطمئن القلوب أي قلوب المؤمنين . قال ابن عباس : هذا في الحلف ; فإذا حلف خصمه بالله سكن قلبه . وقيل : بذكر الله أي بطاعة الله . وقيل : بثواب الله . وقيل : بوعد الله . وقال مجاهد : هم أصحاب النبي - صلى الله عليه وسلم - .\n                                    ",
      "saadi": "ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ ٨٢\n                                        \n                                        \n                                        \n                                        ثم ذكر تعالى علامة المؤمنين فقال: { الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ } أي: يزول قلقها واضطرابها، وتحضرها أفراحها ولذاتها.\n{ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ } أي: حقيق بها وحريٌّ أن لا تطمئن لشيء سوى ذكره، فإنه لا شيء ألذ للقلوب ولا أشهى ولا أحلى من محبة خالقها، والأنس به ومعرفته، وعلى قدر معرفتها بالله ومحبتها له، يكون ذكرها له، هذا على القول بأن ذكر الله، ذكر العبد لربه، من تسبيح وتهليل وتكبير وغير ذلك.\nوقيل: إن المراد بذكر الله كتابه الذي أنزله ذكرى للمؤمنين، فعلى هذا معنى طمأنينة القلوب بذكر الله: أنها حين تعرف معاني القرآن وأحكامه تطمئن لها، فإنها تدل على الحق المبين المؤيد بالأدلة والبراهين، وبذلك تطمئن القلوب، فإنها لا تطمئن القلوب إلا باليقين والعلم، وذلك في كتاب الله، مضمون على أتم الوجوه وأكملها، وأما ما سواه من الكتب التي لا ترجع إليه فلا تطمئن بها، بل لا تزال قلقة من تعارض الأدلة وتضاد الأحكام.\n{ ولو كان من عند غير الله لوجدوا فيه اختلافا كثيرا } وهذا إنما يعرفه من خبر كتاب الله وتدبره، وتدبر غيره من أنواع العلوم، فإنه يجد بينها وبينه فرقا عظيما.\n                                    "
    }
  },
  {
    "id": 28,
    "versesNumber": 29,
    "souraName": "Ar-Ra'd.html",
    "contnent": "ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَ‍َٔابٖ ٩٢",
    "tafsier": {
      "ibnkther": "ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَ‍َٔابٖ ٩٢\n                                    \n                                    \n                                    ( الذين آمنوا وعملوا الصالحات طوبى لهم وحسن مآب ) قال ابن أبي طلحة ، عن ابن عباس : فرح وقرة عين . وقال عكرمة : نعم ما لهم .\nوقال الضحاك : غبطة لهم . وقال إبراهيم النخعي : خير لهم .\nوقال قتادة : هي كلمة عربية يقول الرجل : \" طوبى لك \" ، أي : أصبت خيرا . وقال في رواية : ( طوبى لهم ) حسنى لهم .\n( وحسن مآب ) أي : مرجع .\nوهذه الأقوال شيء واحد لا منافاة بينها .\nوقال سعيد بن جبير ، عن ابن عباس : ( طوبى لهم ) قال : هي أرض الجنة بالحبشية .\nوقال سعيد بن مسجوح : طوبى اسم الجنة بالهندية . وكذا روى السدي ، عن عكرمة : ( طوبى لهم ) أي : الجنة . وبه قال مجاهد .\nوقال العوفي ، عن ابن عباس : لما خلق الله الجنة وفرغ منها قال : ( الذين آمنوا وعملوا الصالحات طوبى لهم وحسن مآب ) وذلك حين أعجبته .\nوقال ابن جرير : حدثنا ابن حميد ، حدثنا يعقوب ، عن جعفر ، عن شهر بن حوشب قال : ( طوبى ) شجرة في الجنة ، كل شجر الجنة منها ، أغصانها من وراء سور الجنة .\nوهكذا روي عن أبي هريرة ، وابن عباس ، ومغيث بن سمى ، وأبي إسحاق السبيعي وغير واحد من السلف : أن طوبى شجرة في الجنة ، في كل دار منها غصن منها .\nوذكر بعضهم أن الرحمن ، تبارك وتعالى ، غرسها بيده من حبة لؤلؤة ، وأمرها أن تمتد ، فامتدت إلى حيث يشاء الله تبارك وتعالى ، وخرجت من أصلها ينابيع أنهار الجنة ، من عسل وخمر وماء ولبن .\nوقد قال عبد الله بن وهب : حدثنا عمرو بن الحارث ، أن دراجا أبا السمح حدثه ، عن أبي الهيثم ، عن أبي سعيد الخدري - رضي الله عنه - [ مرفوعا : \" طوبى : شجرة في الجنة مسيرة مائة سنة ، ثياب أهل الجنة تخرج من أكمامها \" .\nوقال الإمام أحمد : حدثنا حسن بن موسى ، سمعت عبد الله بن لهيعة ، حدثنا دراج أبو السمح ، أن أبا الهيثم حدثه ، عن أبي سعيد الخدري ] عن رسول الله ، صلى الله عليه وسلم : أن رجلا قال : يا رسول الله ، طوبى لمن رآك وآمن بك . قال : \" طوبى لمن رآني وآمن بي ، ثم طوبى ، ثم طوبى ، ثم طوبى لمن آمن بي ولم يرني \" . قال له رجل : وما طوبى ؟ قال : \" شجرة في الجنة مسيرة مائة عام ، ثياب أهل الجنة تخرج من أكمامها \" .\nوروى البخاري ومسلم جميعا ، عن إسحاق بن راهويه ، عن مغيرة المخزومي ، عن وهيب ، عن أبي حازم ، عن سهل بن سعد قال : قال رسول الله ، صلى الله عليه وسلم : \" إن في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها \" قال : فحدثت به النعمان بن أبي عياش الزرقي ، فقال : حدثني أبو سعيد الخدري ، عن النبي - صلى الله عليه وسلم - قال : \" إن في الجنة شجرة يسير الراكب الجواد المضمر السريع مائة عام ما يقطعها \" .\nوفي صحيح البخاري ، من حديث يزيد بن زريع ، عن سعيد ، عن قتادة ، عن أنس - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - في قول الله : ( وظل ممدود ) [ الواقعة : 30 ] قال : \" في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها \" .\nوقال الإمام أحمد : حدثنا سريج ، حدثنا فليح ، عن هلال بن علي ، عن عبد الرحمن بن أبي عمرة ، عن أبي هريرة قال : قال رسول الله ، صلى الله عليه وسلم : \" في الجنة شجرة يسير الراكب في ظلها مائة سنة اقرءوا إن شئتم ( وظل ممدود ) أخرجاه في الصحيحين .\nوقال [ الإمام ] أحمد أيضا : حدثنا محمد بن جعفر وحجاج ، قالا حدثنا شعبة ، سمعت أبا الضحاك يحدث عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - أنه قال : \" إن في الجنة شجرة يسير الراكب في ظلها سبعين - أو : مائة - سنة هي شجرة الخلد \" .\nوقال محمد بن إسحاق ، عن يحيى بن عباد بن عبد الله بن الزبير ، عن أبيه ، عن أسماء بنت أبي بكر ، رضي الله عنها ، قالت : سمعت رسول الله - صلى الله عليه وسلم - وذكر سدرة المنتهى ، قال : \" يسير في ظل الفنن منها الراكب مائة سنة ، أو قال : يستظل في الفنن منها مائة راكب ، فيها فراش الذهب ، كأن ثمرها القلال \" . رواه الترمذي .\nوقال إسماعيل بن عياش ، عن سعيد بن يوسف ، عن يحيى بن أبي كثير ، عن أبي سلام الأسود قال : سمعت أبا أمامة الباهلي قال : قال رسول الله ، صلى الله عليه وسلم : \" ما منكم من أحد يدخل الجنة إلا انطلق به إلى طوبى ، فتفتح له أكمامها ، فيأخذ من أي ذلك شاء ، إن شاء أبيض ، وإن شاء أحمر ، وإن شاء أصفر ، وإن شاء أسود ، مثل شقائق النعمان ، وأرق وأحسن \" .\nوقال الإمام أبو جعفر بن جرير : حدثنا محمد بن عبد الأعلى ، حدثنا محمد بن ثور ، عن معمر ، عن أشعث بن عبد الله ، عن شهر بن حوشب ، عن أبي هريرة - رضي الله عنه - قال : طوبى شجرة في الجنة ، يقول الله لها : \" تفتقي لعبدي عما شاء; فتفتق له عن الخيل بسروجها ولجمها ، وعن الإبل بأزمتها ، وعما شاء من الكسوة \" .\nوقد روى ابن جرير عن وهب بن منبه هاهنا أثرا غريبا عجيبا ، قال وهب ، رحمه الله : إن في الجنة شجرة يقال لها : \" طوبى \" ، يسير الراكب في ظلها مائة عام لا يقطعها ، زهرها رياط ، وورقها برود ، وقضبانها عنبر ، وبطحاؤها ياقوت ، وترابها كافور ، ووحلها مسك ، يخرج من أصلها أنهار الخمر واللبن والعسل ، وهي مجلس لأهل الجنة ، فبينا هم في مجلسهم إذ أتتهم ملائكة من ربهم يقودون نجبا مزمومة بسلاسل من ذهب وجوهها كالمصابيح حسنا ووبرها كخز المرعزى من لينه ، عليها رحال ألواحها من ياقوت ، ودفوفها من ذهب ، وثيابها من سندس وإستبرق ، فينيخونها ويقولون : إن ربنا أرسلنا إليكم لتزوروه وتسلموا عليه قال : فيركبونها ، فهي أسرع من الطائر ، وأوطأ من الفراش ، نجيا من غير مهنة ، يسير الرجل إلى جنب أخيه وهو يكلمه ويناجيه ، لا تصيب أذن راحلة منها أذن الأخرى ، ولا برك راحلة برك الأخرى ، حتى إن شجرة لتتنحى عن طريقهم ، لئلا تفرق بين الرجل وأخيه . قال : فيأتون إلى الرحمن الرحيم فيسفر لهم عن وجهه الكريم حتى ينظروا إليه ، فإذا رأوه قالوا : اللهم ، أنت السلام ومنك السلام ، وحق لك الجلال والإكرام . قال : فيقول تعالى [ عند ذلك ] أنا السلام ومني السلام ، وعليكم حقت رحمتي ومحبتي ، مرحبا بعبادي الذين خشوني بغيب وأطاعوا أمري \" .\nقال : فيقولون : ربنا لم نعبدك حق عبادتك ، ولم نقدرك حق قدرك ، فأذن لنا في السجود قدامك قال : فيقول الله : \" إنها ليست بدار نصب ولا عبادة ، ولكنها دار ملك ونعيم ، وإني قد رفعت عنكم نصب العبادة ، فسلوني ما شئتم ، فإن لكل رجل منكم أمنيته \" فيسألونه ، حتى إن أقصرهم أمنية ليقول : رب ، تنافس أهل الدنيا في دنياهم فتضايقوا فيها ، رب فآتنى مثل كل شيء كانوا فيه من يوم خلقتها إلى أن انتهت الدنيا . فيقول الله تعالى : \" لقد قصرت بك أمنيتك ، ولقد سألت دون منزلتك ، هذا لك مني ، [ وسأتحفك بمنزلتي ] ; لأنه ليس في عطائي نكد ولا تصريد \" . قال : ثم يقول : \" اعرضوا على عبادي ما لم يبلغ أمانيهم ، ولم يخطر لهم على بال \" . قال : فيعرضون عليهم حتى تقصر بهم أمانيهم التي في أنفسهم ، فيكون فيما يعرضون عليهم براذين مقرنة ، على كل أربعة منها سرير من ياقوتة واحدة ، على كل سرير منها قبة من ذهب مفرغة ، في كل قبة منها فرش من فرش الجنة متظاهرة ، في كل قبة منها جاريتان من الحور العين ، على كل جارية منهن ثوبان من ثياب الجنة ، وليس في الجنة لون إلا وهو فيهما ولا ريح طيبة إلا قد عبقتا به ينفذ ضوء وجوههما غلظ القبة ، حتى يظن من يراهما أنهما دون القبة ، يرى مخهما من فوق سوقهما ، كالسلك الأبيض في ياقوتة حمراء ، يريان له من الفضل على صاحبته كفضل الشمس على الحجارة أو أفضل ، ويرى هو لهما مثل ذلك ، ويدخل إليهما فيحييانه ويقبلانه ويعتنقانه به ، ويقولان له : والله ما ظننا أن الله يخلق مثلك . ثم يأمر الله تعالى الملائكة فيسيرون بهم صفا في الجنة ، حتى ينتهى بكل رجل منهم إلى منزلته التي أعدت له .\nوقد روى هذا الأثر ابن أبي حاتم بسنده ، عن وهب بن منبه ، وزاد : فانظروا إلى موهوب ربكم الذي وهب لكم ، فإذا هو بقباب في الرفيق الأعلى ، وغرف مبنية من الدر والمرجان ، وأبوابها من ذهب ، وسررها من ياقوت ، وفرشها من سندس وإستبرق ، ومنابرها من نور ، يفور من أبوابها وعراصها نور مثل شعاع الشمس عنده مثل الكوكب الدري في النهار المضيء ، وإذا بقصور شامخة في أعلى عليين من الياقوت يزهو نورها ، فلولا أنه مسخر ، إذا لالتمع الأبصار ، فما كان من تلك القصور من الياقوت [ الأبيض ، فهو مفروش بالحرير الأبيض ، وما كان منها من الياقوت الأحمر فهو مفروش بالعبقري الأحمر ، وما كان منها من الياقوت الأخضر ] فهو مفروش بالسندس الأخضر ، وما كان منها من الياقوت الأصفر ، فهو مفروش بالأرجوان الأصفر منزه بالزمرد الأخضر ، والذهب الأحمر ، والفضة البيضاء ، قوائمها وأركانها من الجوهر ، وشرفها قباب من لؤلؤ ، وبروجها غرف من المرجان . فلما انصرفوا إلى ما أعطاهم ربهم ، قربت لهم براذين من ياقوت أبيض ، منفوخ فيها الروح ، تجنبها الولدان المخلدون بيد كل وليد منهم حكمة برذون من تلك البراذين ، ولجمها وأعنتها من فضة بيضاء ، منظومة بالدر والياقوت ، سروجها سرر مرضونة ، مفروشة بالسندس والإستبرق . فانطلقت بهم تلك البراذين تزف بهم ببطن رياض الجنة . فلما انتهوا إلى منازلهم ، وجدوا الملائكة قعودا على منابر من نور ، ينتظرونهم ليزوروهم ويصافحوهم ويهنئوهم كرامة ربهم . فلما دخلوا قصورهم وجدوا فيها جميع ما تطاول به عليهم وما سألوا وتمنوا ، وإذا على باب كل قصر من تلك القصور أربعة جنان ، [ جنتان ] ذواتا أفنان ، وجنتان مدهامتان ، وفيهما عينان نضاختان ، وفيهما من كل فاكهة زوجان ، وحور مقصورات في الخيام ، فلما تبينوا منازلهم واستقروا قرارهم قال لهم ربهم : هل وجدتم ما وعدتكم حقا ؟ قالوا : نعم وربنا . قال : هل رضيتم ثواب ربكم ؟ قالوا : ربنا رضينا فارض عنا قال : برضاي عنكم حللتم داري ، ونظرتم إلى وجهي ، وصافحتكم ملائكتي ، فهنيئا هنيئا لكم ، ( عطاء غير مجذوذ ) [ هود : 108 ] ليس فيه تنغيص ولا تصريد . فعند ذلك قالوا : الحمد لله الذي أذهب عنا الحزن ، وأدخلنا دار المقامة من فضله ، لا يمسنا فيها نصب ولا يمسنا فيها لغوب ، إن ربنا لغفور شكور .\nوهذا سياق غريب ، وأثر عجيب ولبعضه شواهد ، ففي الصحيحين : أن الله تعالى يقول لذلك الرجل الذي يكون آخر أهل الجنة دخولا الجنة : تمن \" ، فيتمنى حتى إذا انتهت به الأماني يقول الله تعالى : \" تمن من كذا وتمن من كذا \" ، يذكره ، ثم يقول : \" ذلك لك ، وعشرة أمثاله \" .\nوفي صحيح مسلم ، عن أبي ذر عن رسول الله - صلى الله عليه وسلم - عن الله ، عز وجل يا عبادي ، لو أن أولكم وآخركم ، وإنسكم وجنكم ، قاموا في صعيد واحد ، فسألوني ، فأعطيت كل إنسان مسألته ، ما نقص ذلك من ملكي شيئا ، إلا كما ينقص المخيط إذا أدخل في البحر \" الحديث بطوله .\nوقال خالد بن معدان : إن في الجنة شجرة يقال لها طوبى ، لها ضروع ، كلها ترضع صبيان أهل الجنة ، وإن سقط المرأة يكون في نهر من أنهار الجنة ، يتقلب فيه حتى تقوم القيامة ، فيبعث ابن أربعين سنة . رواه ابن أبي حاتم .\n                                    ",
      "qortoby": "ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَ‍َٔابٖ ٩٢\n                                    \n                                    \n                                    قوله تعالى : الذين آمنوا وعملوا الصالحات طوبى لهم وحسن مآب قوله تعالى : الذين آمنوا وعملوا الصالحات طوبى لهم ابتداء وخبره . وقيل : معناه لهم طوبى ، ف \" طوبى \" رفع بالابتداء ، ويجوز أن يكون موضعه نصبا على تقدير : جعل لهم طوبى ، ويعطف عليه \" وحسن مآب \" على الوجهين المذكورين ، فترفع أو تنصب . وذكر عبد الرزاق : أخبرنا معمر عن يحيى بن أبي كثير عن عمرو بن أبي يزيد البكالي عن عتبة بن عبد السلمي قال : ( جاء أعرابي إلى النبي - صلى الله عليه وسلم - فسأله عن الجنة وذكر الحوض فقال : فيها فاكهة ؟ قال : نعم شجرة تدعى طوبى قال : يا رسول الله ! أي شجر أرضنا تشبه ؟ قال لا تشبه شيئا من شجر أرضك ، أأتيت الشام هناك شجرة تدعى الجوزة تنبت على ساق ويفترش أعلاها . قال : يا رسول الله ! فما عظم أصلها ؟ ! قال : لو ارتحلت جذعة من إبل أهلك ما أحطت بأصلها حتى تنكسر ترقوتها هرما . وذكر الحديث ، وقد كتبناه بكماله في أبواب الجنة من كتاب \" التذكرة \" ، والحمد لله . وذكر ابن المبارك قال : أخبرنا معمر عن الأشعث عن عبد الله عن شهر بن حوشب عن أبي هريرة قال : في الجنة شجرة يقال لها طوبى ; يقول الله تعالى لها : تفتقي لعبدي عما شاء ; فتفتق له عن فرس بسرجه ولجامه وهيئته كما شاء ، وتفتق عن الراحلة برحلها وزمامها وهيئتها كما شاء ، وعن النجائب والثياب . وذكر ابن وهب من حديث شهر بن حوشب عن أبي أمامة الباهلي قال : طوبى شجرة في الجنة ليس منها دار إلا وفيها غصن منها ، ولا طير حسن إلا هو فيها ، ولا ثمرة إلا هي منها ; وقد قيل : إن أصلها في قصر النبي - صلى الله عليه وسلم - في الجنة ، ثم تنقسم فروعها على منازل أهل الجنة ، كما انتشر منه العلم والإيمان على جميع أهل الدنيا . وقال ابن عباس : طوبى لهم فرح لهم وقرة عين ; وعنه أيضا أن طوبى اسم الجنة بالحبشية ; وقاله سعيد بن جبير . الربيع بن أنس : هو البستان بلغة الهند ; قال القشيري : إن صح هذا فهو وفاق بين اللغتين . وقال قتادة : طوبى لهم حسنى لهم . عكرمة : نعمى لهم . إبراهيم النخعي : خير لهم ، وعنه أيضا كرامة من الله لهم . الضحاك : غبطة لهم . النحاس : وهذه الأقوال متقاربة ; لأن طوبى فعلى من الطيب ; أي العيش الطيب لهم ; وهذه الأشياء ترجع إلى الشيء الطيب . وقال الزجاج : طوبى فعلى من الطيب ، وهي الحالة المستطابة لهم ; والأصل طيبى ، فصارت الياء واوا لسكونها وضم ما قبلها ، كما قالوا : موسر وموقن . قلت : والصحيح أنها شجرة ; للحديث المرفوع الذي ذكرناه ، وهو صحيح على ما ذكره السهيلي ; ذكره أبو عمر في التمهيد ، ومنه نقلناه ; وذكره أيضا الثعلبي في تفسيره ; وذكر أيضا المهدوي والقشيري عن معاوية بن قرة عن أبيه أن رسول الله - صلى الله عليه وسلم - قال : طوبى شجرة في الجنة غرسها الله بيده ونفخ فيها من روحه تنبت الحلي والحلل وإن أغصانها لترى من وراء سور الجنة ومن أراد زيادة على هذه الأخبار فليطالع الثعلبي . وقال ابن عباس : طوبى شجرة في الجنة أصلها في دار علي ، وفي دار كل مؤمن منها غصن . وقال أبو جعفر محمد بن علي : ( سئل النبي - صلى الله عليه وسلم - عن قوله تعالى : طوبى لهم وحسن مآب قال : شجرة أصلها في داري وفروعها في الجنة ثم سئل عنها مرة أخرى فقال : شجرة أصلها في دار علي وفروعها في الجنة . فقيل له : يا رسول الله ! سئلت عنها فقلت : أصلها في داري وفروعها في الجنة ثم سئلت عنها فقلت : أصلها في دار علي وفروعها في الجنة فقال النبي - صلى الله عليه وسلم - : إن داري ودار علي غدا في الجنة واحدة في مكان واحد وعنه - صلى الله عليه وسلم - : هي شجرة أصلها في داري وما من دار من دوركم إلا مدلى فيها غصن منها وحسن مآب آب إذا رجع . وقيل : تقدير الكلام الذين آمنوا وتطمئن قلوبهم بذكر الله وعملوا الصالحات طوبى لهم .\n                                    ",
      "saadi": "ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَ‍َٔابٖ ٩٢\n                                        \n                                        \n                                        \n                                        ثم قال تعالى: { الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ } أي: آمنوا بقلوبهم بالله وملائكته، وكتبه ورسله واليوم الآخر، وصدقوا هذا الإيمان بالأعمال الصالحة، أعمال القلوب كمحبة الله وخشيته ورجائه، وأعمال الجوارح كالصلاة ونحوها،\n{ طُوبَى لَهُمْ وَحُسْنُ مَآبٍ } أي: لهم حالة طيبة ومرجع حسن.\nوذلك بما ينالون من رضوان الله وكرامته في الدنيا والآخرة، وأن لهم كمال الراحة وتمام الطمأنينة، ومن جملة ذلك شجرة طوبى التي في الجنة، التي يسير الراكب في ظلها مائة عام ما يقطعها، كما وردت بها الأحاديث الصحيحة.\n                                    "
    }
  },
  {
    "id": 29,
    "versesNumber": 30,
    "souraName": "Ar-Ra'd.html",
    "contnent": "كَذَٰلِكَ أَرۡسَلۡنَٰكَ فِيٓ أُمَّةٖ قَدۡ خَلَتۡ مِن قَبۡلِهَآ أُمَمٞ لِّتَتۡلُوَاْ عَلَيۡهِمُ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ قُلۡ هُوَ رَبِّي لَآ إِلَٰهَ إِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ مَتَابِ ٠٣",
    "tafsier": {
      "ibnkther": "كَذَٰلِكَ أَرۡسَلۡنَٰكَ فِيٓ أُمَّةٖ قَدۡ خَلَتۡ مِن قَبۡلِهَآ أُمَمٞ لِّتَتۡلُوَاْ عَلَيۡهِمُ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ قُلۡ هُوَ رَبِّي لَآ إِلَٰهَ إِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ مَتَابِ ٠٣\n                                    \n                                    \n                                    يقول تعالى : وكما أرسلناك يا محمد في هذه الأمة : ( لتتلو عليهم الذي أوحينا إليك ) أي : لتبلغهم رسالة الله إليهم ، كذلك أرسلنا في الأمم الماضية الكافرة بالله ، وقد كذب الرسل من قبلك ، فلك بهم أسوة ، وكما أوقعنا بأسنا ونقمتنا بأولئك ، فليحذر هؤلاء من حلول النقم بهم ، فإن تكذيبهم لك أشد من تكذيب غيرك من المرسلين ، قال الله تعالى : ( تالله لقد أرسلنا إلى أمم من قبلك فزين لهم الشيطان أعمالهم فهو وليهم اليوم ولهم عذاب أليم ) [ النحل : 63 ] وقال تعالى : ( ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأوذوا حتى أتاهم نصرنا ولا مبدل لكلمات الله ولقد جاءك من نبأ المرسلين ) [ الأنعام : 34 ] أي : كيف نصرناهم ، وجعلنا العاقبة لهم ولأتباعهم في الدنيا والآخرة .\nوقوله : ( وهم يكفرون بالرحمن ) أي : هذه الأمة التي بعثناك فيهم يكفرون بالرحمن ، لا يقرون به; لأنهم كانوا يأنفون من وصف الله بالرحمن الرحيم; ولهذا أنفوا يوم الحديبية أن يكتبوا \" بسم الله الرحمن الرحيم \" وقالوا : ما ندري ما الرحمن الرحيم . قاله قتادة ، والحديث في صحيح البخاري وقد قال الله تعالى : ( قل ادعوا الله أو ادعوا الرحمن أيا ما تدعوا فله الأسماء الحسنى ) [ الإسراء : 110 ] وفي صحيح مسلم عن عبد الله بن عمر قال : قال رسول الله ، صلى الله عليه وسلم : \" إن أحب الأسماء إلى الله عبد الله وعبد الرحمن .\n( قل هو ربي لا إله إلا هو ) أي : هذا الذي تكفرون به أنا مؤمن به ، معترف مقر له بالربوبية والإلهية ، هو ربي لا إله إلا هو ، ( عليه توكلت ) أي : في جميع أموري ، ( وإليه متاب ) أي : إليه أرجع وأنيب ، فإنه لا يستحق ذلك أحد سواه .\n                                    ",
      "qortoby": "كَذَٰلِكَ أَرۡسَلۡنَٰكَ فِيٓ أُمَّةٖ قَدۡ خَلَتۡ مِن قَبۡلِهَآ أُمَمٞ لِّتَتۡلُوَاْ عَلَيۡهِمُ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ قُلۡ هُوَ رَبِّي لَآ إِلَٰهَ إِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ مَتَابِ ٠٣\n                                    \n                                    \n                                    قوله تعالى : كذلك أرسلناك في أمة قد خلت من قبلها أمم لتتلو عليهم الذي أوحينا إليك وهم يكفرون بالرحمن قل هو ربي لا إله إلا هو عليه توكلت وإليه متاب\nقوله تعالى : كذلك أرسلناك في أمة قد خلت من قبلها أمم أي أرسلناك كما أرسلنا الأنبياء من قبلك ; قاله الحسن . وقيل : شبه الإنعام على من أرسل إليه محمد - عليه السلام - بالإنعام على من أرسل إليه الأنبياء قبله .\nلتتلو عليهم الذي أوحينا إليك يعني القرآن .\nوهم يكفرون بالرحمن قال مقاتل وابن جريج : نزلت في صلح الحديبية حين أرادوا أن يكتبوا كتاب الصلح ، فقال النبي - صلى الله عليه وسلم - لعلي : اكتب بسم الله الرحمن الرحيم فقال سهيل بن عمرو والمشركون : ما نعرف الرحمن إلا صاحب اليمامة ، يعنون مسيلمة الكذاب ; اكتب باسمك اللهم ، وهكذا كان أهل الجاهلية يكتبون ; فقال النبي - صلى الله عليه وسلم - لعلي : اكتب هذا ما صالح عليه محمد رسول الله فقال مشركو قريش : لئن كنت رسول الله ثم قاتلناك وصددناك لقد ظلمناك ، ولكن اكتب : هذا ما صالح عليه محمد بن عبد الله ; فقال أصحاب النبي - صلى الله عليه وسلم - : دعنا نقاتلهم ; فقال : لا ولكن اكتب ما يريدون فنزلت . وقال ابن عباس : نزلت في كفار قريش حين قال لهم النبي - صلى الله عليه وسلم - : اسجدوا للرحمن قالوا وما الرحمن فنزلت . قل هو ربي لا إله إلا هو\nقل هو ربي لا إله إلا هو قل لهم يا محمد : الذي أنكرتم . هو ربي لا إله إلا هو ولا معبود سواه ; هو واحد بذاته ; وإن اختلفت أسماء صفاته .\nعليه توكلت واعتمدت ووثقت . وإليه متاب أي مرجعي غدا ، واليوم أيضا عليه توكلت ووثقت ، رضا بقضائه ، وتسليما لأمره . وقيل : سمع أبو جهل رسول الله - صلى الله عليه وسلم - يدعو في الحجر ويقول : ( يا الله يا رحمن ) فقال : كان محمد ينهانا عن عبادة الآلهة وهو يدعو إلهين ; فنزلت هذه الآية ، ونزل . قل ادعوا الله أو ادعوا الرحمن .\n                                    ",
      "saadi": "كَذَٰلِكَ أَرۡسَلۡنَٰكَ فِيٓ أُمَّةٖ قَدۡ خَلَتۡ مِن قَبۡلِهَآ أُمَمٞ لِّتَتۡلُوَاْ عَلَيۡهِمُ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ قُلۡ هُوَ رَبِّي لَآ إِلَٰهَ إِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ مَتَابِ ٠٣\n                                        \n                                        \n                                        \n                                        يقول تعالى لنبيه محمد صلى الله عليه وسلم: { كَذَلِكَ أَرْسَلْنَاكَ } إلى قومك تدعوهم إلى الهدى { قَدْ خَلَتْ مِنْ قَبْلِهَا أُمَمٌ } أرسلنا فيهم رسلنا، فلست ببدع من الرسل حتى يستنكروا رسالتك، ولست تقول من تلقاء نفسك، بل تتلو عليهم آيات الله التي أوحاها الله إليك ، التي تطهر القلوب وتزكي النفوس.\nوالحال أن قومك يكفرون بالرحمن، فلم يقابلوا رحمته وإحسانه -التي أعظمها أن أرسلناك إليهم رسولا وأنزلنا عليك كتابا- بالقبول والشكر بل قابلوها بالإنكار والرد، أفلا يعتبرون بمن خلا من قبلهم من القرون المكذبة كيف أخذهم الله بذنوبهم، { قُلْ هُوَ رَبِّي لَا إِلَهَ إِلَّا هُوَ } وهذا متضمن للتوحيدين توحيد الألوهية وتوحيد الربوبية.\nفهو ربي الذي رباني بنعمه منذ أوجدني، وهو إلهي الذي { عَلَيْهِ تَوَكَّلْتُ } في جميع أموري { وَإِلَيْهِ متاب } أي: أرجع في جميع عباداتي وفي حاجاتي.\n                                    "
    }
  },
  {
    "id": 30,
    "versesNumber": 31,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَلَوۡ أَنَّ قُرۡءَانٗا سُيِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِيعًاۗ أَفَلَمۡ يَاْيۡ‍َٔسِ ٱلَّذِينَ ءَامَنُوٓاْ أَن لَّوۡ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعٗاۗ وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ قَارِعَةٌ أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ حَتَّىٰ يَأۡتِيَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ١٣",
    "tafsier": {
      "ibnkther": "وَلَوۡ أَنَّ قُرۡءَانٗا سُيِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِيعًاۗ أَفَلَمۡ يَاْيۡ‍َٔسِ ٱلَّذِينَ ءَامَنُوٓاْ أَن لَّوۡ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعٗاۗ وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ قَارِعَةٌ أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ حَتَّىٰ يَأۡتِيَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ١٣\n                                    \n                                    \n                                    يقول تعالى مادحا للقرآن الذي أنزله على محمد - صلى الله عليه وسلم - ومفضلا له على سائر الكتب المنزلة قبله : ( ولو أن قرآنا سيرت به الجبال ) أي : لو كان في الكتب الماضية كتاب تسير به الجبال عن أماكنها ، أو تقطع به الأرض وتنشق أو تكلم به الموتى في قبورها ، لكان هذا القرآن هو المتصف بذلك دون غيره ، أو بطريق الأولى أن يكون كذلك; لما فيه من الإعجاز الذي لا يستطيع الإنس والجن عن آخرهم إذا اجتمعوا أن يأتوا بمثله ، ولا بسورة من مثله ، ومع هذا فهؤلاء المشركون كافرون به ، جاحدون له ، ( بل لله الأمر جميعا ) أي : مرجع الأمور كلها إلى الله ، عز وجل ، ما شاء الله كان ، وما لم يشأ لم يكن ، ومن يضلل الله فلا هادي له ، ومن يهد الله فلا مضل له .\nوقد يطلق اسم القرآن على كل من الكتب المتقدمة; لأنه مشتق من الجميع ، قال الإمام أحمد :\nحدثنا عبد الرزاق ، حدثنا معمر ، عن همام بن منبه قال : هذا ما حدثنا أبو هريرة قال : قال رسول الله ، صلى الله عليه وسلم : \" خففت على داود القراءة ، فكان يأمر بدابته أن تسرج ، فكان يقرأ القرآن من قبل أن تسرج دابته ، وكان لا يأكل إلا من عمل يديه \" . انفرد بإخراجه البخاري .\nوالمراد بالقرآن هنا الزبور .\nوقوله : ( أفلم ييأس الذين آمنوا ) أي : من إيمان جميع الخلق ويعلموا أو يتبينوا ( أن لو يشاء الله لهدى الناس جميعا ) فإنه ليس ثم حجة ولا معجزة أبلغ ولا أنجع في النفوس والعقول من هذا القرآن ، الذي لو أنزله الله على جبل لرأيته خاشعا متصدعا من خشية الله . وثبت في الصحيح أن رسول الله - صلى الله عليه وسلم - قال : \" ما من نبي إلا وقد أوتي ما آمن على مثله البشر ، وإنما كان الذي أوتيته وحيا أوحاه الله إلي ، فأرجو أن أكون أكثرهم تابعا يوم القيامة \" معناه : أن معجزة كل نبي انقرضت بموته ، وهذا القرآن حجة باقية على الآباد ، لا تنقضي عجائبه ، ولا يخلق عن كثرة الرد ، ولا يشبع منه العلماء ، هو الفصل ليس بالهزل . من تركه من جبار قصمه الله ، ومن ابتغى الهدى من غيره أضله الله .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا منجاب بن الحارث ، أنبأنا بشر بن عمارة ، حدثنا عمر بن حسان ، عن عطية العوفي قال : قلت له : ( ولو أن قرآنا سيرت به الجبال ) الآية ، قالوا لمحمد ، صلى الله عليه وسلم : لو سيرت لنا جبال مكة حتى تتسع فنحرث فيها ، أو قطعت لنا الأرض كما كان سليمان يقطع لقومه بالريح ، أو أحييت لنا الموتى كما كان عيسى يحيي الموتى لقومه فأنزل الله هذه الآية . قال : قلت : هل تروون هذا الحديث عن أحد من أصحاب النبي ، صلى الله عليه وسلم ؟ قال : نعم ، عن أبي سعيد ، عن النبي ، صلى الله عليه وسلم .\nوكذا روي عن ابن عباس ، والشعبي ، وقتادة ، والثوري ، وغير واحد في سبب نزول هذه الآية ، فالله أعلم .\nوقال قتادة : لو فعل هذا بقرآن غير قرآنكم ، فعل بقرآنكم .\nوقوله : ( بل لله الأمر جميعا ) قال ابن عباس : [ أي ] لا يصنع من ذلك إلا ما يشاء ، ولم يكن ليفعل ، رواه ابن إسحاق بسنده عنه ، وقاله ابن جرير أيضا .\nوقال غير واحد من السلف في قوله : ( أفلم ييأس الذين آمنوا ) أفلم يعلم الذين آمنوا . وقرأ آخرون : \" أفلم يتبين الذين آمنوا أن لو يشاء الله لهدى الناس جميعا \" .\nوقال أبو العالية : قد يئس الذين آمنوا أن يهدوا ، ولو يشاء الله لهدى الناس جميعا .\nوقوله : ( ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة أو تحل قريبا من دارهم ) أي : بسبب تكذيبهم ، لا تزال القوارع تصيبهم في الدنيا ، أو تصيب من حولهم ليتعظوا ويعتبروا ، كما قال تعالى : ( ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون ) [ الأحقاف : 27 ] وقال ( أفلا يرون أنا نأتي الأرض ننقصها من أطرافها أفهم الغالبون ) [ الأنبياء : 44 ] .\nقال قتادة ، عن الحسن : ( أو تحل قريبا من دارهم ) أي : القارعة . وهذا هو الظاهر من السياق .\nقال أبو داود الطيالسي : حدثنا المسعودي ، عن قتادة ، عن سعيد بن جبير ، عن ابن عباس في قوله : ( ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة ) قال : سرية ، ( أو تحل قريبا من دارهم ) قال : محمد صلى الله عليه وسلم ، ( حتى يأتي وعد الله ) قال : فتح مكة .\nوهكذا قال عكرمة ، وسعيد بن جبير ، ومجاهد ، في رواية .\nوقال العوفي ، عن ابن عباس : ( تصيبهم بما صنعوا قارعة ) قال : عذاب من السماء ينزل عليهم ( أو تحل قريبا من دارهم ) يعني : نزول رسول الله - صلى الله عليه وسلم - بهم وقتاله إياهم .\nوكذا قال مجاهد ، وقتادة ، وقال عكرمة في رواية عنه ، عن ابن عباس : ( قارعة ) أي : نكبة .\nوكلهم قال : ( حتى يأتي وعد الله ) يعني : فتح مكة . وقال الحسن البصري : يوم القيامة .\nوقوله : ( إن الله لا يخلف الميعاد ) أي : لا ينقض وعده لرسله بالنصرة لهم ولأتباعهم في الدنيا والآخرة ، ( فلا تحسبن الله مخلف وعده رسله إن الله عزيز ذو انتقام ) [ إبراهيم : 47 ] .\n                                    ",
      "qortoby": "وَلَوۡ أَنَّ قُرۡءَانٗا سُيِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِيعًاۗ أَفَلَمۡ يَاْيۡ‍َٔسِ ٱلَّذِينَ ءَامَنُوٓاْ أَن لَّوۡ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعٗاۗ وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ قَارِعَةٌ أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ حَتَّىٰ يَأۡتِيَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ١٣\n                                    \n                                    \n                                    قوله تعالى : ولو أن قرآنا سيرت به الجبال أو قطعت به الأرض أو كلم به الموتى بل لله الأمر جميعا أفلم ييأس الذين آمنوا أن لو يشاء الله لهدى الناس جميعا ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة أو تحل قريبا من دارهم حتى يأتي وعد الله إن الله لا يخلف الميعاد\nقوله تعالى : ولو أن قرآنا سيرت به الجبال هذا متصل بقول : لولا أنزل عليه آية من ربه . وذلك أن نفرا من مشركي مكة فيهم أبو جهل وعبد الله بن أبي أمية المخزوميان جلسوا خلف الكعبة ، ثم أرسلوا إلى رسول الله فأتاهم ; فقال له عبد الله : إن سرك أن نتبعك فسير لنا جبال مكة بالقرآن ، فأذهبها عنا حتى تنفسح ; فإنها أرض ضيقة ، واجعل لنا فيها عيونا وأنهارا ، حتى نغرس ونزرع ; فلست كما زعمت بأهون على ربك من داود حين سخر له الجبال تسير معه ، وسخر لنا الريح فنركبها إلى الشام نقضي عليها ميرتنا وحوائجنا ، ثم نرجع من يومنا ; فقد كان سليمان سخرت له الريح كما زعمت ; فلست بأهون على ربك من سليمان بن داود ، وأحي لنا قصيا جدك ، أو من شئت أنت من موتانا نسأله ; أحق ما تقول أنت أم باطل ؟ فإن عيسى كان يحيي الموتى ، ولست بأهون على الله منه ; فأنزل الله تعالى : ولو أن قرآنا سيرت به الجبال الآية ; قال معناه الزبير بن العوام ومجاهد وقتادة والضحاك ; والجواب محذوف تقديره : لكان هذا القرآن ، لكن حذف إيجازا ، لما في ظاهر الكلام من الدلالة عليه ; كما قال امرؤ القيس :\nفلو أنها نفس تموت جميعة ولكنها نفس تساقط أنفسا\nيعني لهان علي ; هذا معنى قول قتادة ; قال : لو فعل هذا قرآن قبل قرآنكم لفعله قرآنكم . وقيل : الجواب متقدم ، وفي الكلام تقديم وتأخير ; أي وهم يكفرون بالرحمن لو أنزلنا القرآن وفعلنا بهم ما اقترحوا . الفراء : يجوز أن يكون الجواب لو فعل بهم هذا لكفروا بالرحمن . الزجاج : ولو أن قرآنا إلى قوله : الموتى لما آمنوا ، والجواب المضمر هنا ما أظهر في قوله : \" ولو أننا نزلنا إليهم الملائكة \" إلى قوله : \" ما كانوا ليؤمنوا إلا أن يشاء الله \" .\nبل لله الأمر جميعا أي هو المالك لجميع الأمور ، الفاعل لما يشاء منها ، فليس ما تلتمسونه مما يكون بالقرآن ، إنما يكون بأمر الله .\nقوله تعالى : أفلم ييأس الذين آمنوا قال الفراء قال الكلبي : \" ييأس \" بمعنى يعلم ، لغة النخع ; وحكاه القشيري عن ابن عباس ; أي أفلم يعلموا ; وقاله الجوهري في الصحاح . وقيل : هو لغة هوازن ; أي أفلم يعلم ; عن ابن عباس ومجاهد والحسن . وقال أبو عبيدة : أفلم يعلموا ويتبينوا ، وأنشد في ذلك أبو عبيدة لمالك بن عوف النصري :\nأقول لهم بالشعب إذ ييسرونني ألم تيأسوا أني ابن فارس زهدم\nييسرونني من الميسر ، وقد تقدم في \" البقرة \" ويروى يأسرونني من الأسر . وقال رباح بن عدي :\nألم ييئس الأقوام أني أنا ابنه وإن كنت عن أرض العشيرة نائيا\nفي كتاب الرد \" أني أنا ابنه \" وكذا ذكره الغزنوي : ألم يعلم ; والمعنى على هذا : أفلم يعلم الذين آمنوا أن لو يشاء الله لهدى الناس جميعا من غير أن يشاهدوا الآيات . وقيل : هو من اليأس المعروف ; أي أفلم ييئس الذين آمنوا من إيمان هؤلاء الكفار ، لعلمهم أن الله تعالى لو أراد هدايتهم لهداهم ; لأن المؤمنين تمنوا نزول الآيات طمعا في إيمان الكفار . وقرأ علي وابن عباس : \" أفلم يتبين الذين آمنوا \" من البيان . قال القشيري : وقيل لابن عباس المكتوب \" أفلم ييئس \" قال : أظن الكاتب كتبها وهو ناعس ; أي زاد بعض الحروف حتى صار ييئس . قال أبو بكر الأنباري : روي عن عكرمة عن ابن أبي نجيح أنه قرأ - \" أفلم يتبين الذين آمنوا \" وبها احتج من زعم أنه الصواب في التلاوة ; وهو باطل عن ابن عباس ، لأن مجاهدا وسعيد بن جبير حكيا الحرف عن ابن عباس ، على ما هو في المصحف بقراءة أبي عمرو وروايته عن مجاهد وسعيد بن جبير عن ابن عباس ; ثم إن معناه : أفلم يتبين ; فإن كان مراد الله تحت اللفظة التي خالفوا بها الإجماع فقراءتنا تقع عليها ، وتأتي بتأويلها ، وإن أراد الله المعنى الآخر الذي اليأس فيه ليس من طريق العلم فقد سقط مما أوردوا ; وأما سقوطه يبطل القرآن ، ولزوم أصحابه البهتان . \" أن لو يشاء الله لهدى الناس جميعا \" \" أن \" مخففة من الثقيلة ، أي أنه لو يشاء الله \" لهدى الناس جميعا \" وهو يرد على القدرية وغيرهم .\nقوله تعالى : ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة أي داهية تفجؤهم بكفرهم وعتوهم ، ويقال : قرعه أمر إذا أصابه ، والجمع قوارع ; والأصل في القرع الضرب ; قال :\nأفنى تلادي وما جمعت من نشب قرع القواقيز أفواه الأباريق\nأي لا يزال الكافرون تصيبهم داهية مهلكة من صاعقة كما أصاب أربد ، أو من قتل أو من أسر أو جدب ، أو غير ذلك من العذاب والبلاء ; كما نزل بالمستهزئين ، وهم رؤساء المشركين . وقال عكرمة عن ابن عباس : القارعة النكبة . وقال ابن عباس أيضا وعكرمة : القارعة الطلائع والسرايا التي كان ينفذها رسول الله - صلى الله عليه وسلم - لهم . أو تحل أي القارعة . قريبا من دارهم قاله قتادة والحسن . وقال ابن عباس : أو تحل أنت قريبا من دارهم . وقيل : نزلت الآية بالمدينة ; أي لا تزال تصيبهم القوارع فتنزل بساحتهم أو بالقرب منهم كقرى المدينة ومكة .\n\" حتى يأتي وعد الله \" في فتح مكة ; قاله مجاهد وقتادة وقيل : نزلت بمكة ; أي تصيبهم القوارع ، وتخرج عنهم إلى المدينة يا محمد ، فتحل قريبا من دارهم ، أو تحل بهم محاصرا لهم ; وهذه المحاصرة لأهل الطائف ، ولقلاع خيبر ، ويأتي وعد الله بالإذن لك في قتالهم وقهرهم . وقال الحسن : وعد الله يوم القيامة .\n                                    ",
      "saadi": "وَلَوۡ أَنَّ قُرۡءَانٗا سُيِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِيعًاۗ أَفَلَمۡ يَاْيۡ‍َٔسِ ٱلَّذِينَ ءَامَنُوٓاْ أَن لَّوۡ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعٗاۗ وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ قَارِعَةٌ أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ حَتَّىٰ يَأۡتِيَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ١٣\n                                        \n                                        \n                                        \n                                        يقول تعالى مبينا فضل القرآن الكريم على سائر الكتب المنزلة: { وَلَوْ أَنَّ قُرْآنًا } من الكتب الإلهية { سُيِّرَتْ بِهِ الْجِبَالُ } عن أماكنها { أَوْ قُطِّعَتْ بِهِ الْأَرْضُ } جنانا وأنهارا { أَوْ كُلِّمَ بِهِ الْمَوْتَى } لكان هذا القرآن. { بَلْ لِلَّهِ الْأَمْرُ جَمِيعًا } فيأتي بالآيات التي تقتضيها حكمته، فما بال المكذبين يقترحون من الآيات ما يقترحون؟ فهل لهم أو لغيرهم من الأمر شيء؟.\n{ أَفَلَمْ يَيْأَسِ الَّذِينَ آمَنُوا أَنْ لَوْ يَشَاءُ اللَّهُ لَهَدَى النَّاسَ جَمِيعًا } فليعلموا أنه قادر على هدايتهم جميعا ولكنه لا يشاء ذلك، بل يهدي من يشاء، ويضل من يشاء { وَلَا يَزَالُ الَّذِينَ كَفَرُوا } على كفرهم، لا يعتبرون ولا يتعظون، والله تعالى يوالي عليهم القوارع التي تصيبهم في ديارهم أو تحل قريبا منها، وهم مصرون على كفرهم { حَتَّى يَأْتِيَ وَعْدُ اللَّهِ } الذي وعدهم به، لنزول العذاب المتصل الذي لا يمكن رفعه، { إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ } وهذا تهديد لهم وتخويف من نزول ما وعدهم الله به على كفرهم وعنادهم وظلمهم.\n                                    "
    }
  },
  {
    "id": 31,
    "versesNumber": 32,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَأَمۡلَيۡتُ لِلَّذِينَ كَفَرُواْ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ ٢٣",
    "tafsier": {
      "ibnkther": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَأَمۡلَيۡتُ لِلَّذِينَ كَفَرُواْ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ ٢٣\n                                    \n                                    \n                                    يقول تعالى مسليا لرسوله - صلى الله عليه وسلم - في تكذيب من كذبه من قومه : ( ولقد استهزئ برسل من قبلك ) أي : فلك فيهم أسوة ، ( فأمليت للذين كفروا ) أي : أنظرتهم وأجلتهم ، ( ثم أخذتهم ) أخذة رابية ، فكيف بلغك ما صنعت بهم وعاقبتهم ؟ كما قال تعالى : ( وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير ) [ الحج : 48 ] وفي الصحيحين : \" إن الله ليملي للظالم حتى إذا أخذه لم يفلته \" ، ثم قرأ رسول الله ، صلى الله عليه وسلم : ( وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد ) [ هود : 102 ] .\n                                    ",
      "qortoby": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَأَمۡلَيۡتُ لِلَّذِينَ كَفَرُواْ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ ٢٣\n                                    \n                                    \n                                    قوله تعالى : ولقد استهزئ برسل من قبلك فأمليت للذين كفروا ثم أخذتهم تقدم معنى الاستهزاء في \" البقرة \" ومعنى الإملاء في \" آل عمران \" أي سخر بهم ، وأزري عليهم ; فأمهلت الكافرين مدة ليؤمن من كان في علمي أنه يؤمن منهم ; فلما حق القضاء أخذتهم بالعقوبة .\nفكيف كان عقاب أي فكيف رأيتم ما صنعت بهم ، فكذلك أصنع بمشركي قومك .\n                                    ",
      "saadi": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَأَمۡلَيۡتُ لِلَّذِينَ كَفَرُواْ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ عِقَابِ ٢٣\n                                        \n                                        \n                                        \n                                        يقول تعالى لرسوله -مثبتا له ومسليا- { وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِنْ قَبْلِكَ } فلست أول رسول كذب وأوذي { فَأَمْلَيْتُ لِلَّذِينَ كَفَرُوا } برسلهم أي: أمهلتهم مدة حتى ظنوا أنهم غير معذبين. { ثُمَّ أَخَذْتُهُمْ } بأنواع العذاب { فَكَيْفَ كَانَ عِقَابِ } كان عقابا شديدا وعذابا أليما، فلا يغتر هؤلاء الذين كذبوك واستهزؤوا بك بإمهالنا، فلهم أسوة فيمن قبلهم من الأمم، فليحذروا أن يفعل بهم كما فعل بأولئك.\n                                    "
    }
  },
  {
    "id": 32,
    "versesNumber": 33,
    "souraName": "Ar-Ra'd.html",
    "contnent": "أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۢ بِمَا كَسَبَتۡۗ وَجَعَلُواْ لِلَّهِ شُرَكَآءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّ‍ُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ وَصُدُّواْ عَنِ ٱلسَّبِيلِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ ٣٣",
    "tafsier": {
      "ibnkther": "أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۢ بِمَا كَسَبَتۡۗ وَجَعَلُواْ لِلَّهِ شُرَكَآءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّ‍ُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ وَصُدُّواْ عَنِ ٱلسَّبِيلِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ ٣٣\n                                    \n                                    \n                                    يقول تعالى : ( أفمن هو قائم على كل نفس بما كسبت ) أي : حفيظ عليم رقيب على كل نفس منفوسة ، يعلم ما يعمل العاملون من خير وشر ، ولا يخفى عليه خافية ، ( وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه ) [ يونس : 61 ] وقال تعالى : ( وما تسقط من ورقة إلا يعلمها ) [ الأنعام : 59 ] وقال ( وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين ) [ هود : 6 ] وقال ( سواء منكم من أسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار ) [ الرعد : 10 ] وقال ( يعلم السر وأخفى ) [ طه : 7 ] وقال ( وهو معكم أين ما كنتم والله بما تعملون بصير ) [ الحديد : 4 ] أفمن هو هكذا كالأصنام التي يعبدونها لا تسمع ولا تبصر ولا تعقل ، ولا تملك نفعا لأنفسها ولا لعابديها ، ولا كشف ضر عنها ولا عن عابديها ؟ وحذف هذا الجواب اكتفاء بدلالة السياق عليه ، وهو قوله : ( وجعلوا لله شركاء ) أي : عبدوها معه ، من أصنام وأنداد وأوثان .\n( قل سموهم ) أي : أعلمونا بهم ، واكشفوا عنهم حتى يعرفوا ، فإنهم لا حقيقة لهم; ولهذا قال : ( أم تنبئونه بما لا يعلم في الأرض ) أي : لا وجود له; لأنه لو كان له وجود في الأرض لعلمها; لأنه لا تخفى عليه خافية .\n( أم بظاهر من القول ) قال مجاهد : بظن من القول .\nوقال الضحاك وقتادة : بباطل من القول .\nأي إنما عبدتم هذه الأصنام بظن منكم أنها تنفع وتضر ، وسميتموها آلهة ، ( إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان إن يتبعون إلا الظن وما تهوى الأنفس ولقد جاءهم من ربهم الهدى ) [ النجم : 23 ] .\n( بل زين للذين كفروا مكرهم ) قال مجاهد : قولهم ، أي : ما هم عليه من الضلال والدعوة إليه آناء الليل وأطراف النهار ، كما قال تعالى : ( وقيضنا لهم قرناء فزينوا لهم ما بين أيديهم وما خلفهم وحق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين ) [ فصلت : 25 ] .\n\" وصدوا عن السبيل \" : من قرأها بفتح الصاد ، معناه : أنهم لما زين لهم ما فيه وأنه حق ، دعوا إليه وصدوا الناس عن اتباع طريق الرسل . ومن قرأها ) وصدوا ) أي : بما زين لهم من صحة ما هم عليه ، صدوا به عن سبيل الله; ولهذا قال : ( ومن يضلل الله فما له من هاد ) كما قال ( ومن يرد الله فتنته فلن تملك له من الله شيئا ) [ المائدة : 41 ] وقال ( إن تحرص على هداهم فإن الله لا يهدي من يضل وما لهم من ناصرين ) [ النحل : 37 ] .\n                                    ",
      "qortoby": "أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۢ بِمَا كَسَبَتۡۗ وَجَعَلُواْ لِلَّهِ شُرَكَآءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّ‍ُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ وَصُدُّواْ عَنِ ٱلسَّبِيلِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ ٣٣\n                                    \n                                    \n                                    قوله تعالى : أفمن هو قائم على كل نفس بما كسبت ليس هذا القيام القيام الذي هو ضد القعود ، بل هو بمعنى التولي لأمور الخلق ; كما يقال : قام فلان بشغل كذا ; فإنه قائم على كل نفس بما كسبت أي يقدرها على الكسب ، ويخلقها ويرزقها ويحفظها ويجازيها على عملها ; فالمعنى : أنه حافظ لا يغفل ، والجواب محذوف ; والمعنى : أفمن هو حافظ لا يغفل كمن يغفل . وقيل : أفمن هو قائم أي عالم ; قاله الأعمش . قال الشاعر :\nفلولا رجال من قريش أعزة سرقتم ثياب البيت والله قائم\nأي عالم ; فالله عالم بكسب كل نفس . وقيل : المراد بذلك الملائكة الموكلون ببني آدم ، عن الضحاك .\nوجعلوا حال ; أي أوقد جعلوا ، أو عطف على استهزئ أي استهزءوا وجعلوا ; أي سموا لله شركاء يعني أصناما جعلوها آلهة . قل سموهم أي قل لهم يا محمد : سموهم أي بينوا أسماءهم ، على جهة التهديد ; أي إنما يسمون : اللات والعزى ومناة وهبل .\nأم تنبئونه بما لا يعلم في الأرض \" أم \" استفهام توبيخ ، أي أتنبئونه ; وهو على التحقيق عطف على استفهام متقدم في المعنى ; لأن قوله : سموهم معناه : ألهم أسماء الخالقين . أم تنبئونه بما لا يعلم في الأرض ؟ . وقيل : المعنى قل لهم أتنبئون الله بباطن لا يعلمه .\nأم بظاهر من القول يعلمه ؟ فإن قالوا : بباطن لا يعلمه أحالوا ، وإن قالوا : بظاهر يعلمه فقل لهم : سموهم ; فإذا سموهم اللات والعزى فقل لهم : إن الله لا يعلم لنفسه شريكا . وقيل : أم تنبئونه عطف على قوله : أفمن هو قائم أي أفمن هو قائم ، أم تنبئون الله بما لا يعلم ; أي أنتم تدعون لله شريكا ، والله لا يعلم لنفسه شريكا ; أفتنبئونه بشريك له في الأرض وهو لا يعلمه ! وإنما خص الأرض بنفي الشريك عنها وإن لم يكن له شريك في غير الأرض لأنهم ادعوا له شركاء في الأرض . ومعنى أم بظاهر من القول : الذي أنزل الله على أنبيائه . وقال قتادة : معناه بباطل من القول ; ومنه قول الشاعر :\nأعيرتنا ألبانها ولحومها وذلك عار يا ابن ريطة ظاهر\nأي باطل . وقال الضحاك : بكذب من القول . ويحتمل خامسا - أن يكون الظاهر من القول حجة يظهرونها بقولهم ; ويكون معنى الكلام : أتخبرونه بذلك مشاهدين ، أم تقولون محتجين .\nبل زين للذين كفروا مكرهم أي دع هذا ! بل زين للذين كفروا مكرهم قيل : استدراك . على هذا الوجه ، أي ليس لله شريك ، لكن زين للذين كفروا مكرهم . وقرأ ابن عباس ومجاهد \" بل زين للذين كفروا مكرهم \" مسمى الفاعل ، وعلى قراءة الجماعة فالذي زين للكافرين مكرهم الله تعالى ، وقيل : الشيطان . ويجوز أن يسمى الكفر مكرا ; لأن مكرهم بالرسول كان كفرا .\nوصدوا عن السبيل أي صدهم الله ; وهي قراءة حمزة والكسائي . الباقون بالفتح ; أي صدوا غيرهم ; واختاره أبو حاتم ، اعتبارا بقوله : ويصدون عن سبيل الله وقوله : هم الذين كفروا وصدوكم عن المسجد الحرام . وقراءة الضم أيضا حسنة في \" زين \" و \" صدوا \" لأنه معلوم أن الله فاعل ، ذلك في مذهب أهل السنة ; ففيه إثبات القدر ، وهو اختيار أبي عبيد . وقرأ يحيى بن وثاب وعلقمة - \" وصدوا \" بكسر الصاد ; وكذلك . \" هذه بضاعتنا ردت إلينا \" بكسر الراء أيضا على ما لم يسم فاعله ; وأصلها صددوا ورددت ، فلما أدغمت الدال الأولى في الثانية نقلت حركتها على ما قبلها فانكسر .\n\" ومن يضلل الله \" بخذلانه .\nفما له من هاد أي موفق ; وفي هذا إثبات قراءة الكوفيين ومن تابعهم ; لقوله : ، ومن يضلل الله فكذلك قوله : \" وصدوا \" . ومعظم القراء يقفون على الدال من غير الياء ; وكذلك \" وال \" و \" واق \" ; لأنك تقول في الرجل : هذا قاض ووال وهاد ، فتحذف الياء لسكونها والتقائها مع التنوين . وقرئ \" فما له من هادي \" و \" والي \" و \" واقي \" بالياء ; وهو على لغة من يقول : هذا داعي وواقي بالياء ; لأن حذف الياء في حالة الوصل لالتقائها مع التنوين ، وقد أمنا هذا في الوقف ; فردت الياء فصار هادي ووالي وواقي . وقال الخليل في نداء قاض : يا قاضي بإثبات الياء ; إذ لا تنوين مع النداء ، كما لا تنوين في نحو الداعي والمتعالي .\n                                    ",
      "saadi": "أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۢ بِمَا كَسَبَتۡۗ وَجَعَلُواْ لِلَّهِ شُرَكَآءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّ‍ُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ وَصُدُّواْ عَنِ ٱلسَّبِيلِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ ٣٣\n                                        \n                                        \n                                        \n                                        يقول تعالى: { أَفَمَنْ هُوَ قَائِمٌ عَلَى كُلِّ نَفْسٍ بِمَا كَسَبَتْ } بالجزاء العاجل والآجل، بالعدل والقسط، وهو الله تبارك وتعالى كمن ليس كذلك ؟\nولهذا قال: { وَجَعَلُوا لِلَّهِ شُرَكَاءَ } وهو الله الأحد الفرد الصمد، الذي لا شريك له ولا ند ولا نظير، { قُلْ } لهم إن كانوا صادقين: { سَمُّوهُمْ } لتعلم حالهم { أَمْ تُنَبِّئُونَهُ بِمَا لَا يَعْلَمُ فِي الْأَرْضِ } فإنه إذا كان عالم الغيب والشهادة وهو لا يعلم له شريكا، علم بذلك بطلان دعوى الشريك له، وأنكم بمنزلة الذي يُعَلِّمُ الله أن له شريكا وهو لا يعلمه، وهذا أبطل ما يكون؛ ولهذا قال: { أَمْ بِظَاهِرٍ مِنَ الْقَوْلِ } أي: غاية ما يمكن من دعوى الشريك له تعالى أنه بظاهر أقوالكم.\nوأما في الحقيقة، فلا إله إلا الله، وليس أحد من الخلق يستحق شيئا من العبادة، ولكن { زُيِّنَ لِلَّذِينَ كَفَرُوا مَكْرُهُمْ } الذي مكروه وهو كفرهم وشركهم، وتكذيبهم لآيات الله { وَصُدُّوا عَنِ السَّبِيلِ } أي: عن الطريق المستقيمة الموصلة إلى الله وإلى دار كرامته، { وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ } لأنه ليس لأحد من الأمر شيء.\n                                    "
    }
  },
  {
    "id": 33,
    "versesNumber": 34,
    "souraName": "Ar-Ra'd.html",
    "contnent": "لَّهُمۡ عَذَابٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ ٤٣",
    "tafsier": {
      "ibnkther": "لَّهُمۡ عَذَابٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ ٤٣\n                                    \n                                    \n                                    ذكر تعالى عقاب الكفار وثواب الأبرار : فقال بعد إخباره عن حال المشركين وما هم عليه من الكفر والشرك : ( لهم عذاب في الحياة الدنيا ) أي : بأيدي المؤمنين قتلا وأسرا ، ( ولعذاب الآخرة ) أي : المدخر [ لهم ] مع هذا الخزي في الدنيا ، \" أشق \" أي : من هذا بكثير ، كما قال رسول الله - صلى الله عليه وسلم - للمتلاعنين : \" إن عذاب الدنيا أهون من عذاب الآخرة \" وهو كما قال ، صلوات الله وسلامه عليه ، فإن عذاب الدنيا له انقضاء ، وذاك دائم أبدا في نار هي بالنسبة إلى هذه سبعون ضعفا ، ووثاق لا يتصور كثافته وشدته ، كما قال تعالى : ( فيومئذ لا يعذب عذابه أحد ولا يوثق وثاقه أحد ) [ الفجر : 25 ، 26 ] وقال تعالى : ( بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا لا تدعوا اليوم ثبورا واحدا وادعوا ثبورا كثيرا قل أذلك خير أم جنة الخلد التي وعد المتقون كانت لهم جزاء ومصيرا ) [ الفرقان : 11 - 15 ] .\n                                    ",
      "qortoby": "لَّهُمۡ عَذَابٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ ٤٣\n                                    \n                                    \n                                    قوله تعالى : \" لهم عذاب في الحياة الدنيا \" أي للمشركين الصادين : بالقتل والسبي والإسار ، وغير ذلك من الأسقام والمصائب .\nولعذاب الآخرة أشق أي أشد ; من قولك : شق علي كذا يشق .\nوما لهم من الله من واق أي مانع يمنعهم من عذابه ولا دافع . و \" من \" زائدة .\n                                    ",
      "saadi": "لَّهُمۡ عَذَابٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ ٤٣\n                                        \n                                        \n                                        \n                                        { لَهُمْ عَذَابٌ فِي الْحَيَاةِ الدُّنْيَا وَلَعَذَابُ الْآخِرَةِ أَشَقُّ } من عذاب الدنيا لشدته ودوامه، { وَمَا لَهُمْ مِنَ اللَّهِ مِنْ وَاقٍ } يقيهم من عذاب الله، فعذابه إذا وجهه إليهم لا مانع منه.\n                                    "
    }
  },
  {
    "id": 34,
    "versesNumber": 35,
    "souraName": "Ar-Ra'd.html",
    "contnent": "۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ أُكُلُهَا دَآئِمٞ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِينَ ٱتَّقَواْۚ وَّعُقۡبَى ٱلۡكَٰفِرِينَ ٱلنَّارُ ٥٣",
    "tafsier": {
      "ibnkther": "۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ أُكُلُهَا دَآئِمٞ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِينَ ٱتَّقَواْۚ وَّعُقۡبَى ٱلۡكَٰفِرِينَ ٱلنَّارُ ٥٣\n                                    \n                                    \n                                    ولهذا قرن هذا بهذا; فقال : ( مثل الجنة التي وعد المتقون ) أي : صفتها ونعتها ، ( تجري من تحتها الأنهار ) أي : سارحة في أرجائها وجوانبها ، وحيث شاء أهلها ، يفجرونها تفجيرا ، أي : يصرفونها كيف شاءوا وأين شاءوا ، كما قال تعالى : ( مثل الجنة التي وعد المتقون فيها أنهار من ماء غير آسن وأنهار من لبن لم يتغير طعمه وأنهار من خمر لذة للشاربين وأنهار من عسل مصفى ولهم فيها من كل الثمرات ومغفرة من ربهم كمن هو خالد في النار وسقوا ماء حميما فقطع أمعاءهم ) [ محمد : 15 ] . وقوله : ( أكلها دائم وظلها ) أي : فيها المطاعم والفواكه والمشارب ، لا انقطاع [ لها ] ولا فناء .\nوفي الصحيحين ، من حديث ابن عباس في صلاة الكسوف ، وفيه قالوا : يا رسول الله ، رأيناك تناولت شيئا في مقامك هذا ، ثم رأيناك تكعكعت فقال : \" إني رأيت الجنة - أو أريت الجنة - فتناولت منها عنقودا ، ولو أخذته لأكلتم منه ما بقيت الدنيا \" .\nوقال الحافظ أبو يعلى : حدثنا أبو خيثمة ، حدثنا عبد الله بن جعفر ، حدثنا عبيد الله ، حدثنا أبو عقيل ، عن جابر قال : بينما نحن في صلاة الظهر ، إذ تقدم رسول الله - صلى الله عليه وسلم - فتقدمنا ، ثم تناول شيئا ليأخذه ثم تأخر . فلما قضى الصلاة قال له أبي بن كعب : يا رسول الله ، صنعت اليوم في الصلاة شيئا ما رأيناك كنت تصنعه . فقال : \" إني عرضت علي الجنة وما فيها من الزهرة والنضرة ، فتناولت منها قطفا من عنب لآتيكم به ، فحيل بيني وبينه ، ولو أتيتكم به لأكل منه من بين السماء والأرض لا ينقصونه \" .\nوروى مسلم من حديث أبي الزبير ، عن جابر ، شاهدا لبعضه .\nوعن عتبة بن عبد السلمي : أن أعرابيا سأل النبي - صلى الله عليه وسلم - عن الجنة ، فقال : فيها عنب ؟ قال : \" نعم \" . قال : فما عظم العنقود ؟ قال : \" مسيرة شهر للغراب الأبقع ولا يفتر \" . رواه أحمد .\nوقال الطبراني : حدثنا معاذ بن المثنى ، حدثنا علي بن المديني ، حدثنا ريحان بن سعيد ، عن عبادة بن منصور ، عن أيوب ، عن أبي قلابة ، عن أبي أسماء ، عن ثوبان قال : قال رسول الله ، صلى الله عليه وسلم : \" إن الرجل إذا نزع ثمرة من الجنة عادت مكانها أخرى \" .\nوعن جابر بن عبد الله قال : قال رسول الله ، صلى الله عليه وسلم : \" يأكل أهل الجنة ويشربون ، ولا يمتخطون ولا يتغوطون ولا يبولون ، طعامهم جشاء كريح المسك ، ويلهمون التسبيح والتقديس كما يلهمون النفس \" . رواه مسلم .\nوروى الإمام أحمد والنسائي ، من حديث الأعمش ، عن ثمامة بن عقبة سمعت زيد بن أرقم قال : جاء رجل من أهل الكتاب فقال : يا أبا القاسم ، تزعم أن أهل الجنة يأكلون ويشربون ؟ قال : نعم ، والذي نفس محمد بيده ، [ إن الرجل من أهل الجنة ] ليعطى قوة مائة رجل في الأكل والشرب والجماع والشهوة \" . قال : فإن الذي يأكل ويشرب تكون له الحاجة ، وليس في الجنة أذى ؟ قال : \" حاجة أحدهم رشح يفيض من جلودهم ، كريح المسك ، فيضمر بطنه \" .\nوقال الحسن بن عرفة : حدثنا خلف بن خليفة ، عن حميد الأعرج ، عن عبد الله بن الحارث ، عن عبد الله بن مسعود ، رضي الله عنه ، قال : قال لي رسول الله ، صلى الله عليه وسلم : \" إنك لتنظر إلى الطير في الجنة ، فيخر بين يديك مشويا .\nوجاء في بعض الأحاديث : أنه إذا فرغ منه عاد طائرا كما كان بإذن الله تعالى .\nوقد قال تعالى : ( وفاكهة كثيرة لا مقطوعة ولا ممنوعة ) [ الواقعة : 32 ، 33 ] وقال ( ودانية عليهم ظلالها وذللت قطوفها تذليلا ) [ الإنسان : 14 ] .\nوكذلك ظلها لا يزول ولا يقلص ، كما قال تعالى : ( والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدا لهم فيها أزواج مطهرة وندخلهم ظلا ظليلا ) [ النساء : 57 ] .\nوقد تقدم في الصحيحين من غير وجه أن رسول الله - صلى الله عليه وسلم - قال : \" إن في الجنة شجرة ، يسير الراكب المجد الجواد المضمر السريع في ظلها مائة عام لا يقطعها \" ، ثم قرأ : ( وظل ممدود ) [ الواقعة : 30 ] .\nوكثيرا ما يقرن الله تعالى بين صفة الجنة وصفة النار ، ليرغب في الجنة ويحذر من النار; ولهذا لما ذكر صفة الجنة بما ذكر ، قال بعده : ( تلك عقبى الذين اتقوا وعقبى الكافرين النار ) كما قال تعالى : ( لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون ) [ الحشر : 20 ] .\nوقال بلال بن سعد خطيب دمشق في بعض خطبه : عباد الله هل جاءكم مخبر يخبركم أن شيئا من عبادتكم تقبلت منكم ، أو أن شيئا من خطاياكم غفرت لكم ؟ ( أفحسبتم أنما خلقناكم عبثا وأنكم إلينا لا ترجعون ) [ المؤمنون : 115 ] والله لو عجل لكم الثواب في الدنيا لاستقللتم كلكم ما افترض عليكم ، أو ترغبون في طاعة الله لتعجيل دنياكم ، ولا تنافسون في جنة ( أكلها دائم وظلها تلك عقبى الذين اتقوا وعقبى الكافرين النار ) رواه ابن أبي حاتم .\n                                    ",
      "qortoby": "۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ أُكُلُهَا دَآئِمٞ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِينَ ٱتَّقَواْۚ وَّعُقۡبَى ٱلۡكَٰفِرِينَ ٱلنَّارُ ٥٣\n                                    \n                                    \n                                    قوله تعالى : مثل الجنة التي وعد المتقون تجري من تحتها الأنهار أكلها دائم وظلها تلك عقبى الذين اتقوا وعقبى الكافرين النار\nقوله تعالى : مثل الجنة التي وعد المتقون اختلف النحاة في رفع \" مثل \" فقال سيبويه : ارتفع بالابتداء والخبر محذوف ; والتقدير : وفيما يتلى عليكم مثل الجنة . وقال الخليل : ارتفع بالابتداء وخبره تجري من تحتها الأنهار أي صفة الجنة التي وعد المتقون تجري من تحتها الأنهار ; كقولك : قولي يقوم زيد ; فقولي مبتدأ ، ويقوم زيد خبره ; والمثل بمعنى الصفة موجود ; قال الله تعالى : ذلك مثلهم في التوراة ومثلهم في الإنجيل وقال : ولله المثل الأعلى أي الصفة العليا ; وأنكره أبو علي وقال : لم يسمع مثل بمعنى الصفة ; إنما معناه الشبه ; ألا تراه يجري مجراه في مواضعه ومتصرفاته ، كقولهم : مررت برجل مثلك ; كما تقول : مررت برجل شبهك ; قال : ويفسد أيضا من جهة المعنى ; لأن مثلا إذا كان معناه صفة كان تقدير الكلام : صفة الجنة التي فيها أنهار ، وذلك غير مستقيم ; لأن الأنهار في الجنة نفسها لا صفتها وقال الزجاج : مثل الله - عز وجل - لنا ما غاب عنا بما نراه ; والمعنى : مثل الجنة جنة تجري من تحتها الأنهار ; وأنكرهأبو علي فقال : لا يخلو المثل على قوله أن يكون الصفة أو الشبه ، وفي كلا الوجهين لا يصح ما قاله ; لأنه إذا كان بمعنى الصفة لم يصح ، لأنك إذا قلت : صفة الجنة جنة ، فجعلت الجنة خبرا لم يستقم ذلك ; لأن الجنة لا تكون الصفة ، وكذلك أيضا شبه الجنة جنة ; ألا ترى أن الشبه عبارة عن المماثلة التي بين المتماثلين ، وهو حدث ; والجنة غير حدث ; فلا يكون الأول الثاني . وقال الفراء : المثل مقحم للتأكيد ; والمعنى : الجنة التي وعد المتقون تجري من تحتها الأنهار ; والعرب تفعل ذلك كثيرا بالمثل ; كقوله : ليس كمثله شيء : أي ليس هو كشيء . وقيل التقدير : صفة الجنة التي وعد المتقون صفة جنة تجري من تحتها الأنهار وقيل معناه : شبه الجنة التي وعد المتقون في الحسن والنعمة والخلود كشبه النار في العذاب والشدة والخلود ; قاله مقاتل .\nأكلها دائم لا ينقطع ; وفي الخبر : إذا أخذت ثمرة عادت مكانها أخرى وقد بيناه في \" التذكرة \" . وظلها أي وظلها كذلك ; فحذف ; أي ثمرها لا ينقطع ، وظلها لا يزول ; وهذا رد على الجهمية في زعمهم أن نعيم الجنة يزول ويفنى .\nتلك عقبى الذين اتقوا وعقبى الكافرين النار أي عاقبة أمر المكذبين وآخرتهم النار يدخلونها .\n                                    ",
      "saadi": "۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ أُكُلُهَا دَآئِمٞ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِينَ ٱتَّقَواْۚ وَّعُقۡبَى ٱلۡكَٰفِرِينَ ٱلنَّارُ ٥٣\n                                        \n                                        \n                                        \n                                        يقول تعالى: { مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ } الذين تركوا ما نهاهم الله عنه، ولم يقصروا فيما أمرهم به، أي: صفتها وحقيقتها { تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ } أنهار العسل، وأنهار الخمر، وأنهار اللبن، وأنهار الماء التي تجري في غير أخدود، فتسقى تلك البساتين والأشجار فتحمل من جميع أنواع الثمار.\n{ أُكُلُهَا دَائِمٌ وَظِلُّهَا } دائم أيضا، { تِلْكَ عُقْبَى الَّذِينَ اتَّقَوْا } أي: عاقبتهم ومآلهم التي إليها يصيرون، { وَعُقْبَى الْكَافِرِينَ النَّارُ } فكم بين الفريقين من الفرق المبين؟\"\n                                    "
    }
  },
  {
    "id": 35,
    "versesNumber": 36,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن يُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَآ أُشۡرِكَ بِهِۦٓۚ إِلَيۡهِ أَدۡعُواْ وَإِلَيۡهِ مَ‍َٔابِ ٦٣",
    "tafsier": {
      "ibnkther": "وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن يُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَآ أُشۡرِكَ بِهِۦٓۚ إِلَيۡهِ أَدۡعُواْ وَإِلَيۡهِ مَ‍َٔابِ ٦٣\n                                    \n                                    \n                                    يقول تعالى : ( والذين آتيناهم الكتاب ) وهم قائمون بمقتضاه ( يفرحون بما أنزل إليك ) أي : من القرآن لما في كتبهم من الشواهد على صدقه والبشارة به ، كما قال تعالى : ( الذين آتيناهم الكتاب يتلونه حق تلاوته أولئك يؤمنون به ومن يكفر به فأولئك هم الخاسرون ) [ البقرة : 121 ] وقال تعالى : ( قل آمنوا به أو لا تؤمنوا إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا ) [ الإسراء : 107 ، 108 ] أي : إن كان ما وعدنا الله به في كتبنا من إرسال محمد - صلى الله عليه وسلم - لحقا وصدقا مفعولا لا محالة ، وكائنا ، فسبحانه ما أصدق وعده ، فله الحمد وحده ، (ويخرون للأذقان يبكون ويزيدهم خشوعا ) [ الإسراء : 109 ] .\nوقوله : ( ومن الأحزاب من ينكر بعضه ) أي : ومن الطوائف من يكذب ببعض ما أنزل إليك .\nوقال مجاهد : ( ومن الأحزاب ) اليهود والنصارى ، من ينكر بعضه ما جاءك من الحق . وكذا قال قتادة ، وعبد الرحمن بن زيد بن أسلم .\nوهذا كما قال تعالى : ( وإن من أهل الكتاب لمن يؤمن بالله وما أنزل إليكم وما أنزل إليهم خاشعين لله لا يشترون بآيات الله ثمنا قليلا أولئك لهم أجرهم عند ربهم إن الله سريع الحساب ) [ آل عمران : 199 ] .\n( قل إنما أمرت أن أعبد الله ولا أشرك به ) أي : إنما بعثت بعبادة الله وحده لا شريك له ، كما أرسل الأنبياء من قبلي ، ( إليه أدعو ) أي : إلى سبيله أدعو الناس ، ( وإليه مآب ) أي : مرجعي ومصيري .\n                                    ",
      "qortoby": "وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن يُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَآ أُشۡرِكَ بِهِۦٓۚ إِلَيۡهِ أَدۡعُواْ وَإِلَيۡهِ مَ‍َٔابِ ٦٣\n                                    \n                                    \n                                    قوله تعالى : والذين آتيناهم الكتاب يفرحون بما أنزل إليك ومن الأحزاب من ينكر بعضه قل إنما أمرت أن أعبد الله ولا أشرك به إليه أدعو وإليه مآب\nقوله تعالى : والذين آتيناهم الكتاب يفرحون بما أنزل إليك أي بعض من أوتي الكتاب يفرح بالقرآن ، كابن سلام وسلمان ، والذين جاءوا من الحبشة ; فاللفظ عام ، والمراد الخصوص . وقال قتادة : هم أصحاب محمد - صلى الله عليه وسلم - يفرحون بنور القرآن ; وقاله مجاهد وابن زيد . وعن مجاهد أيضا أنهم مؤمنو أهل الكتاب . وقيل : هم جماعة أهل الكتاب من اليهود والنصارى يفرحون بنزول القرآن لتصديقه كتبهم . وقال أكثر العلماء : كان ذكر الرحمن في القرآن قليلا في أول ما أنزل ، فلما أسلم عبد الله بن سلام وأصحابه ساءهم قلة ذكر الرحمن في القرآن مع كثرة ذكره في التوراة ; فسألوا النبي - صلى الله عليه وسلم - عن ذلك ; فأنزل الله تعالى : قل ادعوا الله أو ادعوا الرحمن أيا ما تدعوا فله الأسماء الحسنى فقالت قريش : ما بال محمد يدعو إلى إله واحد فأصبح اليوم يدعو إلهين ، الله والرحمن ! والله ما نعرف الرحمن إلا رحمان اليمامة ، يعنون مسيلمة الكذاب ; فنزلت : وهم بذكر الرحمن هم كافرون وهم يكفرون بالرحمن ففرح مؤمنو أهل الكتاب بذكر الرحمن ; فأنزل الله تعالى : والذين آتيناهم الكتاب يفرحون بما أنزل إليك .\nومن الأحزاب يعني مشركي مكة ، ومن لم يؤمن من اليهود والنصارى والمجوس . وقيل : هم العرب المتحزبون على النبي - صلى الله عليه وسلم - . وقيل : ومن أعداء المسلمين من ينكر بعض ما في القرآن ; لأن فيهم من كان يعترف ببعض الأنبياء ، وفيهم من كان يعترف بأن الله خالق السماوات والأرض .\nقل إنما أمرت أن أعبد الله ولا أشرك به قراءة الجماعة بالنصب عطفا على \" أعبد \" . وقرأ أبو خالد بالرفع على الاستئناف أي أفرده بالعبادة وحده لا شريك له ، وأتبرأ عن المشركين ، ومن قال : المسيح ابن الله وعزير ابن الله ، ومن اعتقد التشبيه كاليهود .\nإليه أدعو أي إلى عبادته أدعو الناس .\nوإليه مآب أي أرجع في أموري كلها .\n                                    ",
      "saadi": "وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن يُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَآ أُشۡرِكَ بِهِۦٓۚ إِلَيۡهِ أَدۡعُواْ وَإِلَيۡهِ مَ‍َٔابِ ٦٣\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ } أي: مننا عليهم به وبمعرفته، { يَفْرَحُونَ بِمَا أُنْزِلَ إِلَيْكَ } فيؤمنون به ويصدقونه، ويفرحون بموافقة الكتب بعضها لبعض، وتصديق بعضها بعضا وهذه حال من آمن من أهل الكتابين، { وَمِنَ الْأَحْزَابِ مَنْ يُنْكِرُ بَعْضَهُ } أي: ومن طوائف الكفار المنحرفين عن الحق، من ينكر بعض هذا القرآن ولا يصدقه.\n{ فمن اهتدى فلنفسه ومن ضل فإنما يضل عليها } إنما أنت يا محمد منذر تدعوا إلى الله، { قُلْ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ وَلَا أُشْرِكَ بِهِ } أي: بإخلاص الدين لله وحده، { إِلَيْهِ أَدْعُو وَإِلَيْهِ مَآبِ } أي: مرجعي الذي أرجع به إليه فيجازيني بما قمت به من الدعوة إلى دينه والقيام بما أمرت به.\n                                    "
    }
  },
  {
    "id": 36,
    "versesNumber": 37,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ ٧٣",
    "tafsier": {
      "ibnkther": "وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ ٧٣\n                                    \n                                    \n                                    وقوله : ( وكذلك أنزلناه حكما عربيا ) أي : وكما أرسلنا قبلك المرسلين ، وأنزلنا عليهم الكتب من السماء ، كذلك أنزلنا عليك القرآن محكما معربا ، شرفناك به وفضلناك على من سواك بهذا الكتاب المبين الواضح الجلي الذي ) لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد ) [ فصلت : 11 ] .\nوقوله : ( ولئن اتبعت أهواءهم ) أي : آراءهم ، ( أهواءهم بعدما جاءك من العلم ) أي : من الله تعالى ( ما لك من الله من ولي ولا واق ) أي : من الله تعالى . وهذا وعيد لأهل العلم أن يتبعوا سبل أهل الضلالة بعدما صاروا إليه من سلوك السنة النبوية والمحجة المحمدية ، على من جاء بها أفضل الصلاة والسلام [ والتحية والإكرام ] .\n                                    ",
      "qortoby": "وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ ٧٣\n                                    \n                                    \n                                    قوله تعالى : وكذلك أنزلناه حكما عربيا ولئن اتبعت أهواءهم بعدما جاءك من العلم ما لك من الله من ولي ولا واق\nقوله تعالى : وكذلك أنزلناه حكما عربيا أي وكما أنزلنا عليك القرآن فأنكره بعض الأحزاب كذلك أنزلناه حكما عريبا ; وإذا وصفه بذلك لأنه أنزله على محمد - صلى الله عليه وسلم - وهو عربي ، فكذب الأحزاب بهذا الحكم أيضا . وقيل نظم الآية : وكما أنزلنا الكتب على الرسل بلغاتهم كذلك أنزلنا إليك القرآن حكما عربيا ، أي بلسان العرب ; ويريد بالحكم ما فيه من الأحكام . وقيل : أراد بالحكم العربي القرآن كله ; لأنه يفصل بين الحق والباطل ويحكم .\nولئن اتبعت أهواءهم أي أهواء المشركين في عبادة ما دون الله ، وفي التوجيه إلى غير الكعبة .\nبعدما جاءك من العلم ما لك من الله من ولي أي ناصر ينصرك . ولا واق يمنعك من عذابه ; والخطاب للنبي - صلى الله عليه وسلم - والمراد الأمة .\n                                    ",
      "saadi": "وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ ٧٣\n                                        \n                                        \n                                        \n                                        أي: ولقد أنزلنا هذا القرآن والكتاب حكما، عربيا أي: محكما متقنا، بأوضح الألسنة وأفصح اللغات، لئلا يقع فيه شك واشتباه، وليوجب أن يتبع وحده، ولا يداهن فيه، ولا يتبع ما يضاده ويناقضه من أهواء الذين لا يعلمون.\nولهذا توعد رسوله -مع أنه معصوم- ليمتن عليه بعصمته ولتكون أمته أسوته في الأحكام فقال: { وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ بَعْدَمَا جَاءَكَ مِنَ الْعِلْمِ } البين الذي ينهاك عن اتباع أهوائهم، { مَا لَكَ مِنَ اللَّهِ مِنْ وَلِيٍّ } يتولاك فيحصل لك الأمر المحبوب، { وَلَا وَاقٍ } يقيك من الأمر المكروه.\n                                    "
    }
  },
  {
    "id": 37,
    "versesNumber": 38,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِ‍َٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ ٨٣",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِ‍َٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ ٨٣\n                                    \n                                    \n                                    يقول تعالى : وكما أرسلناك ، يا محمد ، رسولا بشريا كذلك [ قد ] بعثنا المرسلين قبلك بشرا يأكلون الطعام ، ويمشون في الأسواق ويأتون الزوجات ، ويولد لهم ، وجعلنا لهم أزواجا وذرية ، وقد قال [ الله ] تعالى لأشرف الرسل وخاتمهم : ( قل إنما أنا بشر مثلكم يوحى إلي ) [ الكهف : 110 ] .\nوفي الصحيحين : أن رسول الله - صلى الله عليه وسلم - قال : \" أما أنا فأصوم وأفطر ، وأقوم وأنام ، وآكل الدسم وأتزوج النساء ، فمن رغب عن سنتي فليس مني \" .\nوقال الإمام أحمد : حدثنا يزيد ، أنبأنا الحجاج بن أرطاة عن مكحول قال : قال أبو أيوب : قال رسول الله ، صلى الله عليه وسلم : \" أربع من سنن المرسلين : التعطر ، والنكاح ، والسواك ، والحناء \" .\nوقد رواه أبو عيسى الترمذي ، عن سفيان بن وكيع عن حفص بن غياث ، عن الحجاج ، عن مكحول ، عن أبى الشمال عن أبي أيوب . . . فذكره ، ثم قال : وهذا أصح من الحديث الذي لم يذكر فيه أبو الشمال .\nوقوله : ( وما كان لرسول أن يأتي بآية إلا بإذن الله ) أي : لم يكن يأتي قومه بخارق إلا إذا أذن له فيه ، ليس ذلك إليه ، بل إلى الله ، عز وجل ، يفعل ما يشاء ، ويحكم ما يريد .\n( لكل أجل كتاب ) أي : لكل مدة مضروبة كتاب مكتوب بها ، وكل شيء عنده بمقدار ، ( ألم تعلم أن الله يعلم ما في السماء والأرض إن ذلك في كتاب إن ذلك على الله يسير ) [ الحج : 70 ] .\nوكان الضحاك بن مزاحم يقول في قوله : ( لكل أجل كتاب ) أي : لكل كتاب أجل يعني لكل كتاب أنزله من السماء مدة مضروبة عند الله ومقدار معين ، فلهذا يمحو ما يشاء منها ويثبت ، يعني حتى نسخت كلها بالقرآن الذي أنزله الله على رسوله ، صلوات الله وسلامه عليه .\n                                    ",
      "qortoby": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِ‍َٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ ٨٣\n                                    \n                                    \n                                    قوله تعالى : ولقد أرسلنا رسلا من قبلك وجعلنا لهم أزواجا وذرية وما كان لرسول أن يأتي بآية إلا بإذن الله لكل أجل كتاب\nفيه مسألتان :\nالأولى : قيل : إن اليهود عابوا على النبي - صلى الله عليه وسلم - الأزواج ، وعيرته بذلك وقالوا : ما نرى لهذا الرجل همة إلا النساء والنكاح ، ولو كان نبيا لشغله أمر النبوة عن النساء ; فأنزل الله هذه الآية ، وذكرهم أمر داود وسليمان فقال : ولقد أرسلنا رسلا من قبلك وجعلنا لهم أزواجا وذرية أي جعلناهم بشرا يقصون ما أحل الله من شهوات الدنيا ، وإنما التخصيص في الوحي .\nالثانية : هذه الآية تدل على الترغيب في النكاح والحض عليه ، وتنهى عن التبتل ، وهو ترك النكاح ، وهذه سنة المرسلين كما نصت عليه هذه الآية ، والسنة واردة بمعناها ; قال - صلى الله عليه وسلم - : تزوجوا فإني مكاثر بكم الأمم الحديث . وقد تقدم في \" آل عمران \" وقال : من تزوج فقد استكمل نصف الدين فليتق الله في النصف الثاني . ومعنى ذلك أن النكاح يعف عن الزنا ، والعفاف أحد الخصلتين اللتين ضمن رسول الله - صلى الله عليه وسلم - عليهما الجنة فقال : من وقاه الله شر اثنتين ولج الجنة ما بين لحييه وما بين رجليه خرجه الموطأ وغيره . وفي صحيح البخاري عن أنس قال : جاء ثلاثة رهط إلى بيوت أزواج النبي - صلى الله عليه وسلم - يسألون عن عبادة النبي - صلى الله عليه وسلم - فلما أخبروا كأنهم تقالوها فقالوا : وأين نحن من النبي - صلى الله عليه وسلم - ! قد غفر الله له ما تقدم من ذنبه وما تأخر . فقال أحدهم : أما أنا فإني أصلي الليل أبدا ، وقال الآخر : إني أصوم الدهر فلا أفطر . وقال الآخر : أنا أعتزل النساء فلا أتزوج ; فجاء رسول الله - صلى الله عليه وسلم - إليهم فقال : ( أنتم الذين قلتم كذا وكذا أما والله إني لأخشاكم لله وأتقاكم له لكني أصوم وأفطر وأصلي وأرقد وأتزوج النساء فمن رغب عن سنتي فليس مني . خرجه مسلم بمعناه ; وهذا أبين . وفي صحيح مسلم عن سعد بن أبي وقاص قال : ( أراد عثمان أن يتبتل فنهاه النبي - صلى الله عليه وسلم - ; ولو أجاز له ذلك اختصينا ، وقد تقدم في \" آل عمران \" الحض على طلب الولد والرد على من جهل ذلك . وقد روي عن عمر بن الخطاب - رضي الله عنه - أنه كان يقول : إني لأتزوج المرأة وما لي فيها من حاجة ، وأطؤها وما أشتهيها ; قيل له : وما يحملك على ذلك يا أمير المؤمنين ؟ قال : حبي أن يخرج الله مني من يكاثر به النبي - صلى الله عليه وسلم - النبيين يوم القيامة ; وإني سمعته يقول : عليكم بالأبكار فإنهن أعذب أفواها وأحسن أخلاقا وأنتق أرحاما وإني مكاثر بكم الأمم يوم القيامة يعني بقوله : أنتق أرحاما أقبل للولد ; ويقال للمرأة الكثيرة الولد ناتق ; لأنها ترمي بالأولاد رميا . وخرج أبو داود عن معقل بن يسار قال : جاء رجل إلى رسول الله - صلى الله عليه وسلم - فقال : إني أصبت امرأة ذات حسب وجمال ، وإنها لا تلد ، أفأتزوجها ؟ قال لا ثم أتاه الثانية فنهاه ، ثم أتاه الثالثة فقال : تزوجوا الودود الولود فإني مكاثر بكم الأمم صححه أبو محمد عبد الحق وحسبك .\nقوله تعالى : وما كان لرسول أن يأتي بآية إلا بإذن الله عاد الكلام إلى ما اقترحوا من الآيات - ما تقدم ذكره في هذه السورة - فأنزل الله ذلك فيهم ; وظاهر الكلام حظر ومعناه النفي ; لأنه لا يحظر على أحد ما لا يقدر عليه .\nلكل أجل كتاب أي لكل أمر قضاه الله كتاب عند الله ; قاله الحسن . وقيل : فيه تقديم وتأخير ، المعنى : لكل كتاب أجل ; قاله الفراء والضحاك ; أي لكل أمر كتبه الله أجل مؤقت ، ووقت معلوم ; نظيره . لكل نبإ مستقر ; بين أن المراد ليس على اقتراح الأمم في نزول العذاب ، بل لكل أجل كتاب . وقيل : المعنى لكل مدة كتاب مكتوب ، وأمر مقدر لا تقف عليه الملائكة . وذكر الترمذي الحكيم في \" نوادر الأصول \" عن شهر بن حوشب عن أبي هريرة قال : لما ارتقى موسى - صلوات الله عليه وسلامه - طور سيناء رأى الجبار في إصبعه خاتما ، فقال : يا موسى ما هذا ؟ وهو أعلم به ، قال : شيء من حلي الرجال ، قال : فهل عليه شيء من أسمائي مكتوب أو كلامي ؟ قال : لا ، قال : فاكتب عليه لكل أجل كتاب .\n                                    ",
      "saadi": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِ‍َٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ ٨٣\n                                        \n                                        \n                                        \n                                        أي: لست أول رسول أرسل إلى الناس حتى يستغربوا رسالتك، { وَلَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً } فلا يعيبك أعداؤك بأن يكون لك أزواج وذرية، كما كان لإخوانك المرسلين، فلأي شيء يقدحون فيك بذلك وهم يعلمون أن الرسل قبلك كذلك؛ إلا لأجل أغراضهم الفاسدة وأهوائهم؟ وإن طلبوا منك آية اقترحوها فليس لك من الأمر شيء.\n{ وَمَا كَانَ لِرَسُولٍ أَنْ يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ } والله لا يأذن فيها إلا في وقتها الذي قدره وقضاه، { لِكُلِّ أَجَلٍ كِتَابٌ } لا يتقدم عليه ولا يتأخر عنه، فليس استعجالهم بالآيات أو بالعذاب موجبا لأن يقدم الله ما كتب أنه يؤخر مع أنه تعالى فعال لما يريد.\n                                    "
    }
  },
  {
    "id": 38,
    "versesNumber": 39,
    "souraName": "Ar-Ra'd.html",
    "contnent": "يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ ٩٣",
    "tafsier": {
      "ibnkther": "يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ ٩٣\n                                    \n                                    \n                                    وقوله : ( يمحو الله ما يشاء ويثبت ) اختلف المفسرون في ذلك ، فقال الثوري ، ووكيع ، وهشيم ، عن ابن أبي ليلى ، عن المنهال بن عمرو ، عن سعيد بن جبير ، عن ابن عباس : يدبر أمر السنة ، فيمحو ما يشاء ، إلا الشقاء والسعادة ، والحياة والموت . وفي رواية : ( يمحو الله ما يشاء ويثبت ) قال : كل شيء إلا الحياة والموت ، والشقاء والسعادة فإنهما قد فرغ منهما .\nوقال مجاهد : ( يمحوا الله ما يشاء ويثبت ) إلا الحياة والموت ، والشقاء والسعادة ، فإنهما لا يتغيران .\nوقال منصور : سألت مجاهدا فقلت : أرأيت دعاء أحدنا يقول : اللهم ، إن كان اسمي في السعداء فأثبته فيهم ، وإن كان في الأشقياء فامحه عنهم واجعله في السعداء . فقال : حسن . ثم لقيته بعد ذلك بحول أو أكثر ، فسألته عن ذلك ، فقال : ( إنا أنزلناه في ليلة مباركة إنا كنا منذرين فيها يفرق كل أمر حكيم ) [ الدخان : 3 ، 4 ] قال : يقضي في ليلة القدر ما يكون في السنة من رزق أو مصيبة ، ثم يقدم ما يشاء ويؤخر ما يشاء ، فأما كتاب الشقاوة والسعادة فهو ثابت لا يغير .\nوقال الأعمش ، عن أبي وائل شقيق بن سلمة : إنه كان يكثر أن يدعو بهذا الدعاء : اللهم ، إن كنت كتبتنا أشقياء فامحه ، واكتبنا سعداء ، وإن كنت كتبتنا سعداء فأثبتنا ، فإنك تمحو ما تشاء وتثبت وعندك أم الكتاب . رواه ابن جرير .\nوقال ابن جرير أيضا : حدثنا عمرو بن علي ، حدثنا معاذ بن هشام ، حدثني أبي ، عن أبي حكيمة عصمة ، عن أبي عثمان النهدي; أن عمر بن الخطاب - رضي الله عنه - قال وهو يطوف بالبيت وهو يبكي : اللهم ، إن كنت كتبت علي شقوة أو ذنبا فامحه ، فإنك تمحو ما تشاء وتثبت ، وعندك أم الكتاب ، فاجعله سعادة ومغفرة .\nوقال حماد عن خالد الحذاء ، عن أبي قلابة عن ابن مسعود أنه كان يدعو بهذا الدعاء أيضا .\nورواه شريك ، عن هلال بن حميد ، عن عبد الله بن عكيم ، عن ابن مسعود ، بمثله .\nوقال ابن جرير : حدثني المثنى ، حدثنا حجاج ، حدثنا خصاف ، عن أبي حمزة ، عن إبراهيم; أن كعبا قال لعمر بن الخطاب : يا أمير المؤمنين ، لولا آية في كتاب الله لأنبأتك بما هو كائن إلى يوم القيامة . قال : وما هي ؟ قال : قول الله تعالى : ( يمحوا الله ما يشاء ويثبت وعنده أم الكتاب ) .\nومعنى هذه الأقوال : أن الأقدار ينسخ الله ما يشاء منها ، ويثبت منها ما يشاء ، وقد يستأنس لهذا القول بما رواه الإمام أحمد :\nحدثنا وكيع ، حدثنا سفيان ، وهو الثوري ، عن عبد الله بن عيسى ، عن عبد الله بن أبي الجعد ، عن ثوبان قال : قال رسول الله ، صلى الله عليه وسلم : \" إن الرجل ليحرم الرزق بالذنب يصيبه ، ولا يرد القدر إلا الدعاء ، ولا يزيد في العمر إلا البر \" .\nورواه النسائي وابن ماجه ، من حديث سفيان الثوري ، به .\nوثبت في الصحيح أن صلة الرحم تزيد في العمر وفي الحديث الآخر : \" إن الدعاء والقضاء ليعتلجان بين السماء والأرض \" .\nوقال ابن جرير : حدثني محمد بن سهل بن عسكر ، حدثنا عبد الرزاق ، أخبرنا ابن جريج ، عن عطاء ، عن ابن عباس قال : إن لله لوحا محفوظا مسيرة خمسمائة عام ، من درة بيضاء لها دفتان من ياقوت - والدفتان لوحان - لله ، عز وجل [ كل يوم ثلاثمائة ] وستون لحظة ، يمحو ما يشاء ويثبت وعنده أم الكتاب .\nوقال الليث بن سعد ، عن زياد بن محمد ، عن محمد بن كعب القرظي ، عن فضالة بن عبيد ، عن أبي الدرداء قال : قال رسول الله ، صلى الله عليه وسلم : \" [ إن الله ] يفتح الذكر في ثلاث ساعات يبقين من الليل ، في الساعة الأولى منها ينظر في الذكر الذي لا ينظر فيه أحد غيره ، فيمحو ما يشاء ويثبت \" . وذكر تمام الحديث . رواه ابن جرير .\nوقال الكلبي : ( يمحوا الله ما يشاء ويثبت ) قال : يمحو من الرزق ويزيد فيه ، ويمحو من الأجل ويزيد فيه . فقيل له : من حدثك بهذا ؟ فقال : أبو صالح ، عن جابر بن عبد الله بن رئاب ، عن النبي - صلى الله عليه وسلم - ثم سئل بعد ذلك عن هذه الآية فقال : يكتب القول كله ، حتى إذا كان يوم الخميس ، طرح منه كل شيء ليس فيه ثواب ولا عقاب ، مثل قولك : أكلت وشربت ، دخلت وخرجت ونحوه من الكلام ، وهو صادق ، ويثبت ما كان فيه الثواب ، وعليه العقاب .\nوقال عكرمة ، عن ابن عباس : الكتاب كتابان : فكتاب يمحو الله منه ما يشاء ويثبت وعنده أم الكتاب .\nوقال العوفي ، عن ابن عباس في قوله : ( يمحو الله ما يشاء ويثبت وعنده أم الكتاب ) يقول : هو الرجل يعمل الزمان بطاعة الله ، ثم يعود لمعصية الله فيموت على ضلالة ، فهو الذي يمحو ، والذي يثبت : الرجل يعمل بمعصية الله ، وقد كان سبق له خير حتى يموت وهو في طاعة الله ، وهو الذي يثبت .\nوروي عن سعيد بن جبير : أنها بمعنى : ( فيغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير ) [ البقرة : 284 ] .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( يمحو الله ما يشاء ويثبت ) يقول : يبدل ما يشاء فينسخه ، ويثبت ما يشاء فلا يبدله ، ( وعنده أم الكتاب ) يقول : وجملة ذلك عنده في أم الكتاب ، الناسخ والمنسوخ ، وما يبدل ، وما يثبت كل ذلك في كتاب .\nوقال قتادة في قوله : ( يمحو الله ما يشاء ويثبت ) كقوله ( ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها ) [ البقرة : 106 ]\nوقال ابن أبي نجيح ، عن مجاهد في قوله : ( يمحو الله ما يشاء ويثبت ) قال : قالت كفار قريش حين أنزلت : ( وما كان لرسول أن يأتي بآية إلا بإذن الله ) ما نراك يا محمد تملك من شيء ، ولقد فرغ من الأمر . فأنزلت هذه الآية تخويفا ، ووعيدا لهم : إنا إن شئنا أحدثنا له من أمرنا ما شئنا ، ونحدث في كل رمضان ، فنمحو ونثبت ما نشاء من أرزاق الناس ومصائبهم ، وما نعطيهم ، وما نقسم لهم .\nوقال الحسن البصري : ( يمحو الله ما يشاء ) قال : من جاء أجله ، فذهب ، ويثبت الذي هو حي يجري إلى أجله .\nوقد اختار هذا القول أبو جعفر بن جرير ، رحمه الله .\nوقوله : ( وعنده أم الكتاب ) قال : الحلال والحرام .\nوقال قتادة : أي جملة الكتاب وأصله .\nوقال الضحاك : ( وعنده أم الكتاب ) قال : كتاب عند رب العالمين .\nوقال سنيد بن داود ، حدثني معتمر ، عن أبيه ، عن سيار ، عن ابن عباس; أنه سأل كعبا عن \" أم الكتاب \" ، فقال : علم الله ، ما هو خالق ، وما خلقه عاملون ، ثم قال لعلمه : \" كن كتابا \" . فكانا كتابا .\nوقال ابن جرير ، عن ابن عباس : ( وعنده أم الكتاب ) قال : الذكر ، [ والله أعلم ] .\n                                    ",
      "qortoby": "يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ ٩٣\n                                    \n                                    \n                                    قوله تعالى : يمحو الله ما يشاء ويثبت أي يمحو من ذلك الكتاب ما يشاء أن يوقعه بأهله ويأتي به . ويثبت ما يشاء ; أي يؤخره إلى وقته ; يقال : محوت الكتاب محوا ، أي أذهبت أثره . ويثبت أي ويثبته ; كقوله : \" والذاكرين الله كثيرا والذاكرات \" أي والذاكرات الله . وقرأ ابن كثير وأبو عمرو وعاصم ويثبت بالتخفيف ، وشدد الباقون ; وفي قراءة ابن عباس ، واختيار أبي حاتم وأبي عبيد لكثرة من قرأ بها ; لقوله : يثبت الله الذين آمنوا . وقال ابن عمر : سمعت النبي - صلى الله عليه وسلم - يقول : يمحو الله ما يشاء ويثبت إلا السعادة والشقاوة والموت . وقال ابن عباس : يمحو الله ما يشاء ويثبت إلا أشياء ; الخلق والخلق والأجل والرزق والسعادة والشقاوة ; وعنه : هما كتابان سوى أم الكتاب ، يمحو الله منهما ما يشاء ويثبت . وعنده أم الكتاب الذي لا يتغير منه شيء . قال القشيري : وقيل السعادة والشقاوة والخلق والخلق والرزق لا تتغير ; فالآية فيما عدا هذه الأشياء ; وفي هذا القول نوع تحكم . قلت : مثل هذا لا يدرك بالرأي والاجتهاد ، وإنما يؤخذ : توقيفا ، فإن صح فالقول به يجب ويوقف عنده ، وإلا فتكون الآية عامة في جميع الأشياء ، وهو الأظهر والله أعلم ; وهذا يروى معناه عن عمر بن الخطاب - رضي الله عنه - وابن مسعود وأبي وائل وكعب الأحبار وغيرهم ، وهو قول الكلبي . وعن أبي عثمان النهدي أن عمر بن الخطاب - رضي الله عنه - كان يطوف بالبيت وهو يبكي ويقول : اللهم إن كنت كتبتني في أهل السعادة فأثبتني فيها ، وإن كنت كتبتني في أهل الشقاوة والذنب فامحني وأثبتني في أهل السعادة والمغفرة ; فإنك تمحو ما تشاء وتثبت ، وعندك أم الكتاب . وقال ابن مسعود : اللهم إن كنت كتبتني في السعداء فأثبتني فيهم ، وإن كنت كتبتني في الأشقياء فامحني من الأشقياء واكتبني في السعداء ; فإنك تمحو ما تشاء وتثبت ; وعندك أم الكتاب . وكان أبو وائل يكثر أن يدعو : اللهم إن كنت كتبتنا أشقياء فامح واكتبنا سعداء ، وإن كنت كتبتنا سعداء فأثبتنا ، فإنك تمحو ما تشاء وتثبت وعندك أم الكتاب . وقال كعب لعمر بن الخطاب : لولا آية في كتاب الله لأنبأتك بما هو كائن إلى يوم القيامة . يمحو الله ما يشاء ويثبت وعنده أم الكتاب . وقال مالك بن دينار في المرأة التي دعا لها : اللهم إن كان في بطنها جارية فأبدلها غلاما فإنك تمحو ما تشاء وتثبت وعندك أم الكتاب . وقد تقدم في الصحيحين عن أبي هريرة قال : سمعت النبي - صلى الله عليه وسلم - يقول : من سره أن يبسط له في رزقه وينسأ له في أثره فليصل رحمه . ومثله عن أنس بن مالك أن رسول الله - صلى الله عليه وسلم - قال : من أحب فذكره بلفظه سواء ; وفيه تأويلان : أحدهما : معنوي ، وهو ما يبقى بعده من الثناء الجميل والذكر الحسن ، والأجر المتكرر ، فكأنه لم يمت . والآخر : يؤخر أجله المكتوب في اللوح المحفوظ ; والذي في علم الله ثابت لا تبدل له ، كما قال : يمحو الله ما يشاء ويثبت وعنده أم الكتاب . وقيل لابن عباس لما روى الحديث الصحيح عن رسول الله - صلى الله عليه وسلم - أنه قال : من أحب أن يمد الله في عمره وأجله ويبسط له في رزقه فليتق الله وليصل رحمه كيف يزاد في العمر والأجل ؟ ! فقال : قال الله - عز وجل - : هو الذي خلقكم من طين ثم قضى أجلا وأجل مسمى عنده . فالأجل الأول أجل العبد من حين ولادته إلى حين موته ، والأجل الثاني : يعني المسمى عنده - من حين وفاته إلى يوم يلقاه في البرزخ لا يعلمه إلا الله ; فإذا اتقى العبد ربه ووصل رحمه زاده الله في أجل عمره الأول من أجل البرزخ ما شاء ، وإذا عصى وقطع رحمه نقصه الله من أجل عمره في الدنيا ما شاء ، فيزيده في أجل البرزخ ، فإذا تحتم الأجل في علمه السابق امتنع الزيادة والنقصان ; لقوله تعالى : فإذا جاء أجلهم لا يستأخرون ساعة ولا يستقدمون فتوافق الخبر والآية ; وهذه زيادة في نفس العمر وذات الأجل على ظاهر اللفظ ، في اختيار حبر الأمة ، والله أعلم . وقال مجاهد : يحكم الله أمر السنة في رمضان فيمحو ما يشاء ويثبت ما يشاء ، إلا الحياة والموت ، والشقاء والسعادة ; وقد مضى القول فيه . وقال الضحاك : يمحو الله ما يشاء من ديوان الحفظة ما ليس فيه ثواب ولا عقاب ، ويثبت ما فيه ثواب وعقاب ; وروى معناه أبو صالح عن ابن عباس . وقال الكلبي : يمحو من الرزق ويزيد فيه ، ويمحو من الأجل ويزيد فيه ، ورواه عن النبي صلى الله عليه وسلم . ثم سئل الكلبي عن هذه الآية فقال : يكتب القول كله ، حتى إذا كان يوم الخميس طرح منه كل شيء ليس فيه ثواب ولا عقاب ، مثل قولك : أكلت وشربت ودخلت وخرجت ونحوه ، وهو صادق ، ويثبت ما فيه الثواب والعقاب . وقال قتادة وابن زيد وسعيد بن جبير : يمحو الله ما يشاء من الفرائض والنوافل فينسخه ويبدله ، ويثبت ما يشاء فلا ينسخه ، وجملة الناسخ والمنسوخ عنده في أم الكتاب ; ونحوه ذكره النحاس والمهدوي عن ابن عباس ; قال النحاس : وحدثنا بكر بن سهل ، قال حدثنا أبو صالح ، عن معاوية بن صالح ، عن علي بن أبي طلحة عن ابن عباس ، يمحو الله ما يشاء يقول : يبدل الله من القرآن ما يشاء فينسخه ، ويثبت ما يشاء فلا يبدله ، وعنده أم الكتاب يقول : جملة ذلك عنده في أم الكتاب ، الناسخ والمنسوخ . وقال سعيد بن جبير أيضا : يغفر ما يشاء - يعني - من ذنوب عباده ، ويترك ما يشاء فلا يغفره . وقال عكرمة : يمحو ما يشاء - يعني بالتوبة - جميع الذنوب ويثبت بدل الذنوب حسنات قال تعالى : إلا من تاب وآمن وعمل عملا صالحا الآية . وقال الحسن : يمحو الله ما يشاء من جاء أجله ، ويثبت من لم يأت أجله . وقال الحسن : يمحو الآباء ، ويثبت الأبناء . وعنه أيضا . ينسي الحفظة من الذنوب ولا ينسي . وقال السدي : يمحو الله ما يشاء يعني القمر ، ويثبت يعني الشمس ; بيانه قوله : فمحونا آية الليل وجعلنا آية النهار مبصرة وقال الربيع بن أنس : هذا في الأرواح حالة النوم ; يقبضها عند النوم ، ثم إذا أراد موته فجأة أمسكه ، ومن أراد بقاءه أثبته ورده إلى صاحبه ; بيانه قوله : الله يتوفى الأنفس حين موتها الآية . وقال علي بن أبي طالب يمحو الله ما يشاء من القرون ، كقوله : ألم يروا كم أهلكنا قبلهم من القرون ويثبت ما يشاء منها ، كقوله : ثم أنشأنا من بعدهم قرنا آخرين فيمحو قرنا ، ويثبت قرنا . وقيل : هو الرجل يعمل الزمن الطويل بطاعة الله ، ثم يعمل بمعصية الله فيموت على ضلاله ; فهو الذي يمحو ، والذي يثبت : الرجل يعمل بمعصية الله الزمان الطويل ثم يتوب ، فيمحوه الله من ديوان السيئات ، ويثبته في ديوان الحسنات ; ذكره الثعلبي والماوردي عن ابن عباس . وقيل : يمحو الله ما يشاء - يعني الدنيا - ويثبت الآخرة . وقال قيس بن عباد في اليوم العاشر من رجب : هو اليوم الذي يمحو الله فيه ما يشاء ، ويثبت فيه ما يشاء ، وقد تقدم عن مجاهد أن ذلك يكون في رمضان . وقال ابن عباس : إن لله لوحا محفوظا مسيرة خمسمائة عام ، من درة بيضاء ، لها دفتان من ياقوتة حمراء ، لله فيه كل يوم ثلاثمائة وستون نظرة ، يثبت ما يشاء ويمحو ما يشاء . وروى أبو الدرداء عن النبي - صلى الله عليه وسلم - قال : إن الله سبحانه يفتح الذكر في ثلاث ساعات يبقين من الليل فينظر في الكتاب الذي لا ينظر فيه أحد غيره فيثبت ما يشاء ويمحو ما يشاء . والعقيدة أنه لا تبديل لقضاء الله ; وهذا المحو والإثبات مما سبق به القضاء ، وقد تقدم أن من القضاء ما يكون واقعا محتوما ، وهو الثابت ; ومنه ما يكون مصروفا بأسباب ، وهو الممحو ، والله أعلم . وقال الغزنوي : وعندي أن ما في اللوح خرج عن الغيب لإحاطة بعض الملائكة ; فيحتمل التبديل ; لأن إحاطة الخلق بجميع علم الله محال ; وما في علمه من تقدير الأشياء لا يبدل . وعنده أم الكتاب أي أصل ما كتب من الآجال وغيرها . وقيل : أم الكتاب اللوح المحفوظ الذي لا يبدل ولا يغير . وقد قيل : إنه يجري فيه التبديل . وقيل : إنما يجري في الجرائد الأخر . وسئل ابن عباس عن أم الكتاب فقال : علم الله ما هو خالق ، وما خلقه عاملون ; فقال لعلمه : كن كتابا ، ولا تبديل في علم الله ، وعنه أنه الذكر ; دليله قوله تعالى : ولقد كتبنا في الزبور من بعد الذكر وهذا يرجع معناه إلى الأول ; وهو معنى قول كعب . قال كعب الأحبار : أم الكتاب علم الله تعالى بما خلق وبما هو خالق .\n                                    ",
      "saadi": "يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ ٩٣\n                                        \n                                        \n                                        \n                                        { يَمْحُوا اللَّهُ مَا يَشَاءُ } من الأقدار { وَيُثْبِتُ } ما يشاء منها، وهذا المحو والتغيير في غير ما سبق به علمه وكتبه قلمه فإن هذا لا يقع فيه تبديل ولا تغيير لأن ذلك محال على الله، أن يقع في علمه نقص أو خلل ولهذا قال: { وَعِنْدَهُ أُمُّ الْكِتَابِ } أي: اللوح المحفوظ الذي ترجع إليه سائر الأشياء، فهو أصلها، وهي فروع له وشعب.\nفالتغيير والتبديل يقع في الفروع والشعب، كأعمال اليوم والليلة التي تكتبها الملائكة، ويجعل الله لثبوتها أسبابا ولمحوها أسبابا، لا تتعدى تلك الأسباب، ما رسم في اللوح المحفوظ، كما جعل الله البر والصلة والإحسان من أسباب طول العمر وسعة الرزق، وكما جعل المعاصي سببا لمحق بركة الرزق والعمر، وكما جعل أسباب النجاة من المهالك والمعاطب سببا للسلامة، وجعل التعرض لذلك سببا للعطب، فهو الذي يدبر الأمور بحسب قدرته وإرادته، وما يدبره منها لا يخالف ما قد علمه وكتبه في اللوح المحفوظ.\n                                    "
    }
  },
  {
    "id": 39,
    "versesNumber": 40,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَإِن مَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ وَعَلَيۡنَا ٱلۡحِسَابُ ٠٤",
    "tafsier": {
      "ibnkther": "وَإِن مَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ وَعَلَيۡنَا ٱلۡحِسَابُ ٠٤\n                                    \n                                    \n                                    يقول تعالى لرسوله : ( وإن ما نرينك ) يا محمد ( بعض الذي نعدهم ) أي : نعد أعداءك من الخزي والنكال في الدنيا ، ( أو نتوفينك ) [ أي ] قبل ذلك ، ( فإنما عليك البلاغ ) أي : إنما أرسلناك لتبلغهم رسالة الله وقد بلغت ما أمرت به ، ( وعلينا الحساب ) أي : حسابهم وجزاؤهم ، كما قال تعالى : ( فذكر إنما أنت مذكر لست عليهم بمصيطر إلا من تولى وكفر فيعذبه الله العذاب الأكبر إن إلينا إيابهم ثم إن علينا حسابهم ) [ الغاشية : 21 - 26 ] .\n                                    ",
      "qortoby": "وَإِن مَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ وَعَلَيۡنَا ٱلۡحِسَابُ ٠٤\n                                    \n                                    \n                                    قوله تعالى : ما نرينك بعض الذي نعدهم أو نتوفينك فإنما عليك البلاغ وعلينا الحساب\nقوله تعالى : وإما نرينك بعض الذي نعدهم \" ما \" زائدة ، والتقدير : وإن نرينك بعض الذي نعدهم ، أي من العذاب لقوله : لهم عذاب في الحياة الدنيا وقوله : ولا يزال الذين كفروا تصيبهم بما صنعوا قارعة أي إن أريناك بعض ما وعدناهم\nأو نتوفينك فإنما عليك البلاغ فليس عليك إلا البلاغ ; أي التبليغ ;\nوعلينا الحساب أي الجزاء والعقوبة .\n                                    ",
      "saadi": "وَإِن مَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ وَعَلَيۡنَا ٱلۡحِسَابُ ٠٤\n                                        \n                                        \n                                        \n                                        يقول تعالى لنبيه محمد صلى الله عليه وسلم: لا تعجل عليهم بإصابة ما يوعدون به من العذاب، فهم إن استمروا على طغيانهم وكفرهم فلا بد أن يصيبهم ما وعدوا به، { إمَا نُرِيَنَّكَ } إياه في الدنيا فتقر بذلك عينك، { أو نتوفينك } قبل إصابتهم فليس ذلك شغلا لك { فَإِنَّمَا عَلَيْكَ الْبَلَاغُ } والتبيين للخلق.\n{ وَعَلَيْنَا الْحِسَابُ } فنحاسب الخلق على ما قاموا به، مما عليهم، وضيعوه، ونثيبهم أو نعاقبهم.\n                                    "
    }
  },
  {
    "id": 40,
    "versesNumber": 41,
    "souraName": "Ar-Ra'd.html",
    "contnent": "أَوَ لَمۡ يَرَوۡاْ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِيعُ ٱلۡحِسَابِ ١٤",
    "tafsier": {
      "ibnkther": "أَوَ لَمۡ يَرَوۡاْ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِيعُ ٱلۡحِسَابِ ١٤\n                                    \n                                    \n                                    وقوله : ( أولم يروا أنا نأتي الأرض ننقصها من أطرافها ) قال ابن عباس : أو لم يروا أنا نفتح لمحمد الأرض بعد الأرض ؟\nوقال في رواية : أو لم يروا إلى القرية تخرب ، حتى يكون العمران في ناحية ؟\nوقال مجاهد وعكرمة : ( ننقصها من أطرافها ) قال : خرابها .\nوقال الحسن والضحاك : هو ظهور المسلمين على المشركين .\nوقال العوفي عن ابن عباس : نقصان أهلها وبركتها .\nوقال مجاهد : نقصان الأنفس والثمرات وخراب الأرض .\nوقال الشعبي : لو كانت الأرض تنقص لضاق عليك حشك ، ولكن تنقص الأنفس والثمرات . وكذا قال عكرمة : لو كانت الأرض تنقص لم تجد مكانا تقعد فيه ، ولكن هو الموت .\nوقال ابن عباس في رواية : خرابها بموت فقهائها وعلمائها وأهل الخير منها . وكذا قال مجاهد أيضا : هو موت العلماء .\nوفي هذا المعنى روى الحافظ ابن عساكر في ترجمة أحمد بن عبد العزيز أبي القاسم المصري الواعظ سكن أصبهان ، حدثنا أبو محمد طلحة بن أسد المرئي بدمشق ، أنشدنا أبو بكر الآجرى بمكة قال : أنشدنا أحمد بن غزال لنفسه :\nالأرض تحيا إذا ما عاش عالمها متى يمت عالم منها يمت طرف كالأرض تحيا إذا ما الغيث حل بها\nوإن أبى عاد في أكنافها التلف\nوالقول الأول أولى ، وهو ظهور الإسلام على الشرك قرية بعد قرية ، [ وكفرا بعد كفر ، كما قال تعالى : ( ولقد أهلكنا ما حولكم من القرى ) [ الأحقاف : 27 ] الآية ، وهذا اختيار ابن جرير ، رحمه الله ]\n                                    ",
      "qortoby": "أَوَ لَمۡ يَرَوۡاْ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِيعُ ٱلۡحِسَابِ ١٤\n                                    \n                                    \n                                    قوله تعالى : أولم يروا يعني ، أهل مكة ، أنا نأتي الأرض أي نقصدها . ننقصها من أطرافها اختلف فيه ; فقال ابن عباس ومجاهد : ننقصها من أطرافها موت علمائها وصلحائها قال القشيري : وعلى هذا فالأطراف الأشراف ; وقد قال ابن الأعرابي : الطرف والطرف الرجل الكريم ; ولكن هذا القول بعيد ، لأن مقصود الآية : أنا أريناهم النقصان في أمورهم ، ليعلموا أن تأخير العقاب عنهم ليس عن عجز ; إلا أن يحمل قول ابن عباس على موت أحبار اليهود والنصارى . وقال مجاهد أيضا وقتادة والحسن : هو ما يغلب عليه المسلمون مما في أيدي المشركين ; وروي ذلك عن ابن عباس ، وعنه أيضا هو خراب الأرض حتى يكون العمران في ناحية منها ; وعن مجاهد : نقصانها خرابها وموت أهلها . وذكر وكيع بن الجراح عن طلحة بن عمير عن عطاء بن أبي رباح في قول الله تعالى : أولم يروا أنا نأتي الأرض ننقصها من أطرافها قال : ذهاب فقهائها وخيار أهلها . قال أبو عمر بن عبد البر : قول عطاء في تأويل الآية حسن جدا ; تلقاه أهل العلم بالقبول . قلت : وحكاه المهدوي عن مجاهد وابن عمر ، وهذا نص القول الأول نفسه ، روى سفيان عن منصور عن مجاهد ، ننقصها من أطرافها قال : موت الفقهاء والعلماء ; ومعروف في اللغة أن الطرف الكريم من كل شيء ; وهذا خلاف ما ارتضاه أبو نصر عبد الرحيم بن عبد الكريم من قول ابن عباس . وقال عكرمة والشعبي : هو النقصان وقبض الأنفس . قال أحدهما : ولو كانت الأرض تنقص لضاق عليك حشك . وقال الآخر : لضاق عليك حش تتبرز فيه . قيل : المراد به هلاك من هلك من الأمم قبل قريش وهلاك أرضهم بعدهم ; والمعنى : أولم تر قريش هلاك من قبلهم ، وخراب أرضهم بعدهم ؟ ! أفلا يخافون أن يحل بهم مثل ذلك ; وروي ذلك أيضا عن ابن عباس ومجاهد وابن جريج . وعن ابن عباس أيضا أنه نقص بركات الأرض وثمارها وأهلها . وقيل : نقصها بجور ولاتها . قلت : وهذا صحيح معنى ; فإن الجور والظلم يخرب البلاد ، بقتل أهلها وانجلائهم عنها ، وترفع من الأرض البركة ، والله أعلم .\nقوله تعالى : والله يحكم لا معقب لحكمه أي ليس يتعقب حكمه أحد بنقص ولا تغيير .\nوهو سريع الحساب أي الانتقام من الكافرين ، سريع الثواب للمؤمن . وقيل : لا يحتاج في حسابه إلى روية قلب ، ولا عقد بنان ; حسب ما تقدم في \" البقرة \" بيانه .\n                                    ",
      "saadi": "أَوَ لَمۡ يَرَوۡاْ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِيعُ ٱلۡحِسَابِ ١٤\n                                        \n                                        \n                                        \n                                        ثم قال متوعدا للمكذبين { أَوَلَمْ يَرَوْا أَنَّا نَأْتِي الْأَرْضَ نَنْقُصُهَا مِنْ أَطْرَافِهَا } قيل بإهلاك المكذبين واستئصال الظالمين، وقيل: بفتح بلدان المشركين، ونقصهم في أموالهم وأبدانهم، وقيل غير ذلك من الأقوال.\nوالظاهر -والله أعلم- أن المراد بذلك أن أراضي هؤلاء المكذبين جعل الله يفتحها ويجتاحها، ويحل القوارع بأطرافها، تنبيها لهم قبل أن يجتاحهم النقص، ويوقع الله بهم من القوارع ما لا يرده أحد، ولهذا قال: { وَاللَّهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهِ } ويدخل في هذا حكمه الشرعي والقدري والجزائي.\nفهذه الأحكام التي يحكم الله فيها، توجد في غاية الحكمة والإتقان، لا خلل فيها ولا نقص، بل هي مبنية على القسط والعدل والحمد، فلا يتعقبها أحد ولا سبيل إلى القدح فيها، بخلاف حكم غيره فإنه قد يوافق الصواب وقد لا يوافقه، { وَهُوَ سَرِيعُ الْحِسَابِ } أي: فلا يستعجلوا بالعذاب فإن كل ما هو آت، فهو قريب.\n                                    "
    }
  },
  {
    "id": 41,
    "versesNumber": 42,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَقَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِيعٗاۖ يَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسٖۗ وَسَيَعۡلَمُ ٱلۡكُفَّٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ ٢٤",
    "tafsier": {
      "ibnkther": "وَقَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِيعٗاۖ يَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسٖۗ وَسَيَعۡلَمُ ٱلۡكُفَّٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ ٢٤\n                                    \n                                    \n                                    يقول : ( وقد مكر الذين من قبلهم ) برسلهم ، وأرادوا إخراجهم من بلادهم ، فمكر الله بهم ، وجعل العاقبة للمتقين ، كما قال تعالى : ( وإذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك ويمكرون ويمكر الله والله خير الماكرين ) [ الأنفال : 30 ] وقال تعالى : ( ومكروا مكرا ومكرنا مكرا وهم لا يشعرون فانظر كيف كان عاقبة مكرهم أنا دمرناهم وقومهم أجمعين فتلك بيوتهم خاوية بما ظلموا ) الآية [ النمل : 50 - 52 ] .\nوقوله : ( يعلم ما تكسب كل نفس ) أي : إنه تعالى عالم بجميع السرائر والضمائر ، وسيجزي كل عامل بعمله .\n( وسيعلم الكافر ) وقرئ : ( الكفار ) ( لمن عقبى الدار ) أي : لمن تكون الدائرة والعاقبة ، لهم أو لأتباع الرسل ؟ كلا بل هي لأتباع الرسل في الدنيا والآخرة ، ولله الحمد والمنة .\n                                    ",
      "qortoby": "وَقَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِيعٗاۖ يَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسٖۗ وَسَيَعۡلَمُ ٱلۡكُفَّٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ ٢٤\n                                    \n                                    \n                                    قوله : وقد مكر الذين من قبلهم فلله المكر جميعا يعلم ما تكسب كل نفس وسيعلم الكفار لمن عقبى الدار\nقوله تعالى : وقد مكر الذين من قبلهم أي من قبل مشركي مكة ، مكروا بالرسل وكادوا لهم وكفروا بهم .\nفلله المكر جميعا أي هو مخلوق له مكر الماكرين ، فلا يضر إلا بإذنه . وقيل : فلله خير المكر ; أي يجازيهم به .\nيعلم ما تكسب كل نفس من خير وشر ، فيجازي عليه .\nوسيعلم الكافر كذا قراءة نافع وابن كثير وأبي عمرو . الباقون : \" الكفار \" على الجمع . وقيل : عني به أبو جهل .\nلمن عقبى الدار أي عاقبة دار الدنيا ثوابا وعقابا ، أو لمن الثواب والعقاب في الدار الآخرة ; وهذا تهديد ووعيد .\n                                    ",
      "saadi": "وَقَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِيعٗاۖ يَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسٖۗ وَسَيَعۡلَمُ ٱلۡكُفَّٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ ٢٤\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وَقَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ } برسلهم وبالحق الذي جاءت به الرسل، فلم يغن عنهم مكرهم ولم يصنعوا شيئا فإنهم يحاربون الله ويبارزونه، { فَلِلَّهِ الْمَكْرُ جَمِيعًا } أي: لا يقدر أحد أن يمكر مكرا إلا بإذنه، وتحت قضائه وقدره،\nفإذا كانوا يمكرون بدينه فإن مكرهم سيعود عليهم بالخيبة والندم، فإن الله { يَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍ } أي: هومها وإراداتها وأعمالها الظاهرة والباطنة.\nوالمكر لا بد أن يكون من كسبها فلا يخفى على الله مكرهم، فيمتنع أن يمكروا مكرا يضر الحق وأهله ويفيدهم شيئا، { وَسَيَعْلَمُ الْكُفَّارُ لِمَنْ عُقْبَى الدَّارِ } أي: ألهم أو لرسله؟ ومن المعلوم أن العاقبة للمتقين لا للكفر وأعماله.\n                                    "
    }
  },
  {
    "id": 42,
    "versesNumber": 43,
    "souraName": "Ar-Ra'd.html",
    "contnent": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ ٣٤",
    "tafsier": {
      "ibnkther": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ ٣٤\n                                    \n                                    \n                                    يقول : ويكذبك هؤلاء الكفار ويقولون : ( لست مرسلا ) أي : ما أرسلك الله ، ( قل كفى بالله شهيدا بيني وبينكم ) أي : حسبي الله ، وهو الشاهد علي وعليكم ، شاهد علي فيما بلغت عنه من الرسالة ، وشاهد عليكم أيها المكذبون فيما تفترونه من البهتان .\nوقوله : ( ومن عنده علم الكتاب ) قيل : نزلت في عبد الله بن سلام . قاله مجاهد .\nوهذا القول غريب; لأن هذه الآية مكية ، وعبد الله بن سلام إنما أسلم في أول مقدم رسول الله - صلى الله عليه وسلم - المدينة . والأظهر في هذا ما قاله العوفي ، عن ابن عباس قال : هم من اليهود والنصارى .\nوقال قتادة : منهم ابن سلام ، وسلمان ، وتميم الداري .\nوقال مجاهد - في رواية - عنه : هو الله تعالى .\nوكان سعيد بن جبير ينكر أن يكون المراد بها عبد الله بن سلام ، ويقول : هي مكية ، وكان يقرؤها : \" ومن عنده علم الكتاب \" ، ويقول : من عند الله .\nوكذا قرأها مجاهد والحسن البصري .\nوقد روى ابن جرير من حديث ، هارون الأعور ، عن الزهري ، عن سالم ، عن ابن عمر; أن رسول الله - صلى الله عليه وسلم - قرأها : \" \" ومن عنده علم الكتاب \" ، ثم قال : لا أصل له من حديث الزهري عند الثقات .\nقلت : وقد رواه الحافظ أبو يعلى في مسنده ، من طريق هارون بن موسى هذا ، عن سليمان بن أرقم - وهو ضعيف - عن الزهري ، عن سالم ، عن أبيه مرفوعا كذلك . ولا يثبت . والله أعلم\nوالصحيح في هذا : أن ) ومن عنده ) اسم جنس يشمل علماء أهل الكتاب الذين يجدون صفة محمد - صلى الله عليه وسلم - ونعته في كتبهم المتقدمة ، من بشارات الأنبياء به ، كما قال تعالى : ( ورحمتي وسعت كل شيء فسأكتبها للذين يتقون ويؤتون الزكاة والذين هم بآياتنا يؤمنون الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل ) الآية [ الأعراف : 156 ، 157 ] وقال تعالى : ( أولم يكن لهم آية أن يعلمه علماء بني إسرائيل ) الآية : [ الشعراء : 197 ] . وأمثال ذلك مما فيه الإخبار عن علماء بني إسرائيل : أنهم يعلمون ذلك من كتبهم المنزلة . وقد ورد في حديث الأحبار ، عن عبد الله بن سلام بأنه أسلم بمكة قبل الهجرة . قال الحافظ أبو نعيم الأصبهاني في كتاب \" دلائل النبوة \" ، وهو كتاب جليل :\nحدثنا سليمان بن أحمد الطبراني ، حدثنا عبدان بن أحمد ، حدثنا محمد بن مصفى ، حدثنا الوليد بن مسلم ، عن محمد بن حمزة بن يوسف ، بن عبد الله بن سلام ، عن أبيه ، أن عبد الله بن سلام قال لأحبار اليهود : إني أردت أن أجدد بمسجد أبينا إبراهيم وإسماعيل عهدا فانطلق إلى رسول الله - صلى الله عليه وسلم - وهو بمكة ، فوافاهم وقد انصرفوا من الحج ، فوجد رسول الله ، بمنى ، والناس حوله ، فقام مع الناس ، فلما نظر إليه رسول الله - صلى الله عليه وسلم - قال : \" أنت عبد الله بن سلام ؟ \" قال : قلت : نعم . قال : \" ادن \" . فدنوت منه ، قال : \" أنشدك بالله يا عبد الله بن سلام ، أما تجدني في التوراة رسول الله ؟ \" فقلت له : انعت ربنا . قال : فجاء جبريل حتى وقف بين يدي رسول الله - صلى الله عليه وسلم - فقال له : ( قل هو الله أحد الله الصمد لم يلد ولم يولد ولم يكن له كفوا أحد ) [ سورة الإخلاص ] فقرأها علينا رسول الله - صلى الله عليه وسلم - فقال ابن سلام : أشهد أن لا إله إلا الله ، وأنك رسول الله . ثم انصرف ابن سلام إلى المدينة فكتم إسلامه . فلما هاجر رسول الله - صلى الله عليه وسلم - إلى المدينة وأنا فوق نخلة لي أجدها ، فألقيت نفسي ، فقالت أمي : [ لله ] أنت ، لو كان موسى بن عمران ما كان لك أن تلقي نفسك من رأس النخلة . فقلت : والله لأني أسر بقدوم رسول الله - صلى الله عليه وسلم - من موسى بن عمران إذ بعث .\nوهذا حديث غريب جدا .\nآخر تفسير سورة الرعد ولله الحمد والمنة.\n                                    ",
      "qortoby": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ ٣٤\n                                    \n                                    \n                                    قوله تعالى : ويقول الذين كفروا لست مرسلا قال قتادة : هم مشركو العرب ; أي لست بنبي ولا رسول ، وإنما أنت متقول ; أي لما لم يأتهم بما اقترحوا قالوا ذلك .\nقل كفى بالله أي قل لهم يا محمد : كفى بالله أي كفى بالله شهيدا بيني وبينكم بصدقي وكذبكم . ومن عنده علم الكتاب وهذا احتجاج على مشركي العرب لأنهم كانوا يرجعون إلى أهل الكتاب - من آمن منهم - في التفاسير . وقيل : كانت شهادتهم قاطعة لقول الخصوم ; وهم مؤمنو أهل الكتاب كعبد الله بن سلام وسلمان الفارسي وتميم الداري والنجاشي وأصحابه ، قاله قتادة وسعيد بن جبير . وروى الترمذي عن ابن أخي عبد الله بن سلام قال : لما أريد قتل عثمان جاء عبد الله بن سلام فقال له عثمان : ما جاء بك ؟ قال : جئت في نصرتك ; قال : اخرج إلى الناس فاطردهم عني ، فإنك خارجا خير لي من داخل ; قال فخرج عبد الله بن سلام إلى الناس فقال : أيها الناس ! إنه كان اسمي في الجاهلية فلان ، فسماني رسول الله - صلى الله عليه وسلم - عبد الله ، ونزلت في آيات من كتاب الله ; فنزلت في . وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين ونزلت في . قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب الحديث . وقد كتبناه بكماله في كتاب \" التذكرة \" . وقال فيه أبو عيسى : هذا حديث حسن غريب . وكان اسمه في الجاهلية حصين فسماه النبي - صلى الله عليه وسلم - عبد الله . وقال أبو بشر : قلت لسعيد بن جبير ومن عنده علم الكتاب ؟ قال : هو عبد الله بن سلام .\nقلت : وكيف يكون عبد الله بن سلام وهذه السورة مكية وابن سلام ما أسلم إلا بالمدينة ؟ ! ذكره الثعلبي . وقال القشيري : وقال ابن جبير السورة مكية وابن سلام أسلم بالمدينة بعد هذه السورة ; فلا يجوز أن تحمل هذه الآية على ابن سلام ; فمن عنده علم الكتاب جبريل ; وهو قول ابن عباس . وقال الحسن ومجاهد والضحاك : هو الله تعالى ; وكانوا يقرءون \" ومن عنده علم الكتاب \" وينكرون على من يقول : هو عبد الله بن سلام وسلمان ; لأنهم يرون أن السورة مكية ، وهؤلاء أسلموا بالمدينة . وروي عن النبي - صلى الله عليه وسلم - أنه قرأ ومن عنده علم الكتاب وإن كان في الرواية ضعف ، وروى ذلك سليمان بن أرقم عن الزهري عن سالم عن أبيه عن النبي - صلى الله عليه وسلم - ; وروى محبوب عن إسماعيل بن محمد اليماني أنه قرأ كذلك - ومن عنده بكسر الميم والعين والدال علم الكتاب بضم العين ورفع الكتاب . وقال عبد الله بن عطاء : قلت ، لأبي جعفر بن علي بن الحسين بن علي بن أبي طالب - رضي الله عنهم - زعموا أن الذي عنده علم الكتاب عبد الله بن سلام فقال : إنما ذلك علي بن أبي طالب - رضي الله عنه - ; وكذلك قال محمد ابن الحنفية . وقيل : جميع المؤمنين ، والله أعلم . قال القاضي أبو بكر بن العربي : أما من قال إنه علي فعول على أحد وجهين : إما لأنه عنده أعلم المؤمنين وليس كذلك ; بل أبو بكر وعمر وعثمان أعلم منه . ولقول النبي - صلى الله عليه وسلم - . ( أنا مدينة العلم وعلي بابها ) وهو حديث باطل ; النبي - صلى الله عليه وسلم - مدينة علم وأصحابه أبوابها ; فمنهم الباب المنفسح ، ومنهم المتوسط ، على قدر منازلهم في العلوم . وأما من قال إنهم جميع المؤمنين فصدق ; لأن كل مؤمن يعلم الكتاب ، ويدرك وجه إعجازه ، ويشهد للنبي - صلى الله عليه وسلم - بصدقه .\nقلت : فالكتاب على هذا هو القرآن . وأما من قال هو عبد الله بن سلام فعول على حديث الترمذي ; وليس يمتنع أن ينزل في عبد الله بن سلام شيئا ويتناول جميع المؤمنين لفظا ; ويعضده من النظام أن قوله تعالى : ويقول الذين كفروا يعني قريشا ; فالذين عندهم علم الكتاب هم المؤمنون من اليهود والنصارى ، الذين هم إلى معرفة النبوة والكتاب أقرب من عبدة الأوثان . قال النحاس : وقول من قال هو عبد الله بن سلام وغيره يحتمل أيضا ; لأن البراهين إذا صحت وعرفها من قرأ الكتب التي أنزلت قبل القرآن كان أمرا مؤكدا ; والله أعلم بحقيقة ذلك .\n                                    ",
      "saadi": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ ٣٤\n                                        \n                                        \n                                        \n                                        { وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا } أي: يكذبونك ويكذبون ما أرسلت به، { قُلْ } لهم -إن طلبوا على ذلك شهيدا: { كَفَى بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ } وشهادته بقوله وفعله وإقراره، أما قوله فبما أوحاه الله إلى أصدق خلقه مما يثبت به رسالته.\nوأما فعله فلأن الله تعالى أيد رسوله ونصره نصرا خارجا عن قدرته وقدرة أصحابه وأتباعه وهذا شهادة منه له بالفعل والتأييد.\nوأما إقراره، فإنه أخبر الرسول عنه أنه رسوله، وأنه أمر الناس باتباعه، فمن اتبعه فله رضوان الله وكرامته، ومن لم يتبعه فله النار والسخط وحل له ماله ودمه والله يقره على ذلك، فلو تقول عليه بعض الأقاويل لعاجله بالعقوبة.\n{ وَمَنْ عِنْدَهُ عِلْمُ الْكِتَابِ } وهذا شامل لكل علماء أهل الكتابين، فإنهم يشهدون للرسول من آمن واتبع الحق، صرح بتلك الشهادة التي عليه، ومن كتم ذلك فإخبار الله عنه أن عنده شهادة أبلغ من خبره، ولو لم يكن عنده شهادة لرد استشهاده بالبرهان، فسكوته يدل على أن عنده شهادة مكتومة.\nوإنما أمر الله باستشهاد أهل الكتاب لأنهم أهل هذا الشأن، وكل أمر إنما يستشهد فيه أهله ومن هم أعلم به من غيرهم، بخلاف من هو أجنبي عنه، كالأميين من مشركي العرب وغيرهم، فلا فائدة في استشهادهم لعدم خبرتهم ومعرفتهم والله أعلم.\nتم تفسير سورة الرعد ,\nوالحمد لله رب العالمين.\n                                    "
    }
  }
]