[
  {
    "id": 0,
    "versesNumber": 1,
    "souraName": "Fussilat.html",
    "contnent": "حمٓ ١",
    "tafsier": {
      "ibnkther": "حمٓ ١\n                                    \n                                    \n                                    سورة فصلت وهي مكية\nقد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن.\n                                    ",
      "qortoby": "حمٓ ١\n                                    \n                                    \n                                    اختلف في معناه ; فقال عكرمة : قال النبي صلى الله عليه وسلم : ( \" حم \" اسم من أسماء الله تعالى وهي مفاتيح خزائن ربك ) قال ابن عباس : \" حم \" اسم الله الأعظم .\nوعنه : \" الر \" و \" حم \" و \" ن \" حروف الرحمن مقطعة .\nوعنه أيضا : اسم من أسماء الله تعالى أقسم به .\nوقال قتادة : إنه اسم من أسماء القرآن .\nمجاهد : فواتح السور .\nوقال عطاء الخراساني : الحاء افتتاح اسمه حميد وحنان وحليم وحكيم , والميم افتتاح اسمه ملك ومجيد ومنان ومتكبر ومصور ; يدل عليه ما روى أنس أن أعرابيا سأل النبي صلى الله عليه وسلم : ما \" حم \" فإنا لا نعرفها في لساننا ؟ فقال النبي صلى الله عليه وسلم : ( بدء أسماء وفواتح سور ) وقال الضحاك والكسائي : معناه قضي ما هو كائن .\nكأنه أراد الإشارة إلى تهجي \" حم \" ; لأنها تصير حم بضم الحاء وتشديد الميم ; أي قضي ووقع .\nوقال كعب بن مالك : فلما تلاقيناهم ودارت بنا الرحى وليس لأمر حمه الله مدفع وعنه أيضا : إن المعنى حم أمر الله أي قرب ; كما قال الشاعر : قد حم يومي فسر قوم قوم بهم غفلة ونوم ومنه سميت الحمى ; لأنها تقرب من المنية .\nوالمعنى المراد قرب نصره لأوليائه , وانتقامه من أعدائه كيوم بدر .\nوقيل : حروف هجاء ; قال الجرمي : ولهذا تقرأ ساكنة الحروف فخرجت مخرج التهجي وإذا سميت سورة بشيء من هذه الحروف أعربت ; فتقول : قرأت \" حم \" فتنصب ; قال الشاعر : يذكرني حاميم والرمح شاجر فهلا تلا حاميم قبل التقدم وقرأ عيسى بن عمر الثقفي : \" حم \" بفتح الميم على معنى اقرأ حم أو لالتقاء الساكنين .\nابن أبي إسحاق وأبو السمال بكسرها .\nوالإمالة والكسر لالتقاء الساكنين , أو على وجه القسم .\nوقرأ أبو جعفر بقطع الحاء من الميم .\nالباقون بالوصل .\nوكذلك في \" حم .\nعسق \" .\nوقرأ أبو عمرو وأبو بكر وحمزة والكسائي وخلف وابن ذكوان بالإمالة في الحاء .\nوروي عن أبي عمرو بين اللفظين وهي قراءة نافع وأبي جعفر وشيبة .\nالباقون بالفتح مشبعا .\n                                    ",
      "saadi": "حمٓ ١\n                                        \n                                        \n                                        \n                                        تقدم تفسير الحروف المقطعة\n                                    "
    }
  },
  {
    "id": 1,
    "versesNumber": 2,
    "souraName": "Fussilat.html",
    "contnent": "تَنزِيلٞ مِّنَ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ ٢",
    "tafsier": {
      "ibnkther": "تَنزِيلٞ مِّنَ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ ٢\n                                    \n                                    \n                                    يقول تعالى : ( حم تنزيل من الرحمن الرحيم ) يعني : القرآن منزل من الرحمن الرحيم ، كقوله تعالى : ( قل نزله روح القدس من ربك بالحق ) [ النحل : 102 ] وقوله : ( وإنه لتنزيل رب العالمين نزل به الروح الأمين على قلبك لتكون من المنذرين ) [ الشعراء : 192 - 194 ] .\n                                    ",
      "qortoby": "تَنزِيلٞ مِّنَ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ ٢\n                                    \n                                    \n                                    قوله تعالى : حم تنزيل من الرحمن الرحيم قال الزجاج : تنزيل رفع بالابتداء وخبره كتاب فصلت آياته وهذا قول البصريين . وقال الفراء : يجوز أن يكون رفعه على إضمار هذا . ويجوز أن يقال : كتاب بدل من قوله : تنزيل . وقيل : نعت لقوله : تنزيل . وقيل : حم أي : هذه حم كما تقول باب كذا ، أي : هو باب كذا ف \" حم \" خبر ابتداء مضمر أي : هو حم ، وقوله : تنزيل مبتدأ آخر ، وقوله : \" كتاب \" خبره .\n                                    ",
      "saadi": "تَنزِيلٞ مِّنَ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ ٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عباده أن هذا الكتاب الجليل والقرآن الجميل { تَنْزِيلُ } صادر { مِنَ الرَّحْمَنِ الرَّحِيمِ } الذي وسعت رحمته كل شيء، الذي من أعظم رحمته وأجلها، إنزال هذا الكتاب، الذي حصل به، من العلم والهدى، والنور، والشفاء، والرحمة، والخير الكثير، ما هو من أجل نعمه على العباد، وهو الطريق للسعادة في الدارين.\n                                    "
    }
  },
  {
    "id": 2,
    "versesNumber": 3,
    "souraName": "Fussilat.html",
    "contnent": "كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ ٣",
    "tafsier": {
      "ibnkther": "كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ ٣\n                                    \n                                    \n                                    وقوله : ( كتاب فصلت آياته ) أي : بينت معانيه وأحكمت أحكامه ، ( قرآنا عربيا ) أي : في حال كونه لفظا عربيا ، بينا واضحا ، فمعانيه مفصلة ، وألفاظه واضحة غير مشكلة ، كقوله : ( كتاب أحكمت آياته ثم فصلت من لدن حكيم خبير ) [ هود : 1 ] أي : هو معجز من حيث لفظه ومعناه ، ( لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد ) [ فصلت : 42 ] . وقوله : ( لقوم يعلمون ) أي : إنما يعرف هذا البيان والوضوح العلماء الراسخون\n                                    ",
      "qortoby": "كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ ٣\n                                    \n                                    \n                                    فصلت آياته أي بينت وفسرت . قال قتادة : ببيان حلاله من حرامه ، وطاعته من معصيته . الحسن : بالوعد والوعيد . سفيان : بالثواب والعقاب . وقرئ فصلت أي : فرقت بين الحق والباطل ، أو فصل بعضها من بعض باختلاف معانيها ، من قولك : فصل أي : تباعد من البلد .\n                                    ",
      "saadi": "كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ ٣\n                                        \n                                        \n                                        \n                                        ثم أثنى على الكتاب بتمام البيان فقال: { فُصِّلَتْ آيَاتُهُ } أي: فصل كل شيء من أنواعه على حدته، وهذا يستلزم البيان التام، والتفريق بين كل شيء، وتمييز الحقائق. { قُرْآنًا عَرَبِيًّا } أي: باللغة الفصحى أكمل اللغات، فصلت آياته وجعل عربيًا. { لِقَوْمٍ يَعْلَمُونَ } أي: لأجل أن يتبين لهم معناه، كما تبين لفظه، ويتضح لهم الهدى من الضلال، والْغَيِّ من الرشاد.\nوأما الجاهلون، الذين لا يزيدهم الهدى إلا ضلالاً، ولا البيان إلا عَمًى فهؤلاء لم يُسَقِ الكلام لأجلهم، { سَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُونَ }\n                                    "
    }
  },
  {
    "id": 3,
    "versesNumber": 4,
    "souraName": "Fussilat.html",
    "contnent": "بَشِيرٗا وَنَذِيرٗا فَأَعۡرَضَ أَكۡثَرُهُمۡ فَهُمۡ لَا يَسۡمَعُونَ ٤",
    "tafsier": {
      "ibnkther": "بَشِيرٗا وَنَذِيرٗا فَأَعۡرَضَ أَكۡثَرُهُمۡ فَهُمۡ لَا يَسۡمَعُونَ ٤\n                                    \n                                    \n                                    ( بشيرا ونذيرا ) أي : تارة يبشر المؤمنين ، وتارة ينذر الكافرين ، ( فأعرض أكثرهم فهم لا يسمعون ) أي : أكثر قريش ، فهم لا يفهمون منه شيئا مع بيانه ووضوحه .\n                                    ",
      "qortoby": "بَشِيرٗا وَنَذِيرٗا فَأَعۡرَضَ أَكۡثَرُهُمۡ فَهُمۡ لَا يَسۡمَعُونَ ٤\n                                    \n                                    \n                                    بشيرا ونذيرا حالان من الآيات ، والعامل فيه فصلت . وقيل : هما نعتان للقرآن بشيرا لأولياء الله نذيرا لأعدائه . وقرئ \" بشير ونذير \" صفة للكتاب . أو خبر مبتدأ محذوف\nفأعرض أكثرهم يعني أهل مكة فهم لا يسمعون سماعا ينتفعون به . وروي أن الريان بن حرملة قال : قال الملأ من قريش وأبو جهل قد التبس علينا أمر محمد ، فلو التمستم رجلا عالما بالشعر والكهانة والسحر فكلمه ثم آتانا ببيان من أمره ، فقال عتبة بن ربيعة : والله لقد سمعت الكهانة والشعر والسحر ، وعلمت من ذلك علما لا يخفى علي إن كان كذلك . فقالوا : إيته فحدثه . فأتى النبي - صلى الله عليه وسلم - فقال له : يا محمد أنت خير أم قصي بن كلاب ؟ أنت خير أم هاشم ؟ أنت خير أم عبد المطلب ؟ أنت خير أم عبد الله ؟ فبم تشتم آلهتنا ، وتضلل آباءنا ، وتسفه أحلامنا ، وتذم ديننا ؟ فإن كنت إنما تريد الرياسة عقدنا إليك ألويتنا فكنت رئيسنا ما بقيت ، وإن كنت تريد الباءة زوجناك عشر نساء من أي بنات قريش شئت ، وإن كنت تريد المال جمعنا لك ما تستغني به أنت وعقبك من بعدك ، وإن كان هذا الذي يأتيك رئيا من الجن قد غلب عليك بذلنا لك أموالنا في طلب ما تتداوى به أو نغلب فيك . والنبي - صلى الله عليه وسلم - ساكت ، فلما فرغ قال : قد فرغت يا أبا الوليد ؟ قال : نعم . فقال : يا ابن أخي اسمع قال : أسمع . قال : \" بسم الله الرحمن الرحيم \" حم تنزيل من الرحمن الرحيم . كتاب فصلت آياته قرآنا عربيا لقوم يعلمون إلى قوله : فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود فوثب عتبة ووضع يده على فم النبي - صلى الله عليه وسلم - ، وناشده الله والرحم ليسكتن ، ورجع إلى أهله ولم يخرج إلى قريش فجاءه أبو جهل ، فقال : أصبوت إلى محمد ؟ أم أعجبك طعامه ؟ فغضب عتبة وأقسم ألا يكلم محمدا أبدا ، ثم قال : والله لقد تعلمون أني من أكثر قريش مالا ، ولكني لما قصصت عليه القصة أجابني بشيء والله ما هو بشعر ولا كهانة ولا سحر ، ثم تلا عليهم ما سمع منه إلى قوله : مثل صاعقة عاد وثمود وأمسكت بفيه وناشدته بالرحم أن يكف ، وقد علمتم أن محمدا إذا قال شيئا لم يكذب ، فوالله لقد خفت أن ينزل بكم العذاب ، يعني الصاعقة . وقد روى هذا الخبر أبو بكر الأنباري في كتاب الرد له عن محمد بن كعب القرظي ، وأن النبي - صلى الله عليه وسلم - قرأ حم فصلت حتى انتهى إلى السجدة فسجد وعتبة مصغ يستمع ، قد اعتمد على يديه من وراء ظهره . فلما قطع رسول الله - صلى الله عليه وسلم - القراءة قال له : يا أبا الوليد قد سمعت الذي قرأت عليك فأنت وذاك فانصرف عتبة إلى قريش في ناديها فقالوا : والله لقد جاءكم أبو الوليد بغير الوجه الذي مضى به من عندكم . ثم قالوا : ما وراءك أبا الوليد ؟ قال : والله لقد سمعت كلاما من محمد ما سمعت مثله قط ، والله ما هو بالشعر ولا بالكهانة ، فأطيعوني في هذه وأنزلوها بي ، خلوا محمدا وشأنه واعتزلوه ، فوالله ليكونن لما سمعت من كلامه نبأ ، فإن أصابته العرب كفيتموه بأيدي غيركم ، وإن كان ملكا أو نبيا كنتم أسعد الناس به ; لأن ملكه ملككم وشرفه شرفكم . فقالوا : هيهات! سحرك محمد يا أبا الوليد . وقال : هذا رأيي لكم فاصنعوا ما شئتم .\n                                    ",
      "saadi": "بَشِيرٗا وَنَذِيرٗا فَأَعۡرَضَ أَكۡثَرُهُمۡ فَهُمۡ لَا يَسۡمَعُونَ ٤\n                                        \n                                        \n                                        \n                                        { بَشِيرًا وَنَذِيرًا } أي: بشيرًا بالثواب العاجل والآجل، ونذيرًا بالعقاب العاجل والآجل، وذكر تفصيلهما، وذكر الأسباب والأوصاف التي تحصل بها البشارة والنذارة، وهذه الأوصاف للكتاب، مما يوجب أن يُتَلقَّى بالقبول، والإذعان، والإيمان، والعمل به، ولكن أعرض أكثر الخلق عنه إعراض المستكبرين، { فَهُمْ لَا يَسْمَعُونَ } له سماع قبول وإجابة، وإن كانوا قد سمعوه سماعًا، تقوم عليهم به الحجة الشرعية.\n                                    "
    }
  },
  {
    "id": 4,
    "versesNumber": 5,
    "souraName": "Fussilat.html",
    "contnent": "وَقَالُواْ قُلُوبُنَا فِيٓ أَكِنَّةٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ وَفِيٓ ءَاذَانِنَا وَقۡرٞ وَمِنۢ بَيۡنِنَا وَبَيۡنِكَ حِجَابٞ فَٱعۡمَلۡ إِنَّنَا عَٰمِلُونَ ٥",
    "tafsier": {
      "ibnkther": "وَقَالُواْ قُلُوبُنَا فِيٓ أَكِنَّةٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ وَفِيٓ ءَاذَانِنَا وَقۡرٞ وَمِنۢ بَيۡنِنَا وَبَيۡنِكَ حِجَابٞ فَٱعۡمَلۡ إِنَّنَا عَٰمِلُونَ ٥\n                                    \n                                    \n                                    ( وقالوا قلوبنا في أكنة ) أي : في غلف مغطاة ( مما تدعونا إليه وفي آذاننا وقر ) أي : صمم عما جئتنا به ، ( ومن بيننا وبينك حجاب ) فلا يصل إلينا شيء مما تقول ، ( فاعمل إننا عاملون ) أي : اعمل أنت على طريقتك ، ونحن على طريقتنا لا نتابعك .\nقال الإمام العلم عبد بن حميد في مسنده : حدثني ابن أبي شيبة ، حدثنا علي بن مسهر عن الأجلح ، عن الذيال بن حرملة الأسدي عن جابر بن عبد الله - رضي الله عنه - قال : اجتمعت قريش يوما فقالوا : انظروا أعلمكم بالسحر والكهانة والشعر ، فليأت هذا الرجل الذي قد فرق جماعتنا ، وشتت أمرنا ، وعاب ديننا ، فليكلمه ولننظر ماذا يرد عليه ؟ فقالوا : ما نعلم أحدا غير عتبة بن ربيعة . فقالوا : أنت يا أبا الوليد . فأتاه عتبة فقال : يا محمد ، أنت خير أم عبد الله ؟ فسكت رسول الله - صلى الله عليه وسلم - فقال : أنت خير أم عبد المطلب ؟ فسكت رسول الله - صلى الله عليه وسلم - فقال : فإن كنت تزعم أن هؤلاء خير منك ، فقد عبدوا الآلهة التي عبت ، وإن كنت تزعم أنك خير منهم فتكلم حتى نسمع قولك ، إنا والله ما رأينا سخلة قط أشأم على قومك منك ; فرقت جماعتنا ، وشتت أمرنا ، وعبت ديننا ، وفضحتنا في العرب ، حتى لقد طار فيهم أن في قريش ساحرا ، وأن في قريش كاهنا . والله ما ننظر إلا مثل صيحة الحبلى أن يقوم بعضنا إلى بعض بالسيوف ، حتى نتفانى - أيها الرجل - إن كان إنما بك الحاجة جمعنا لك حتى تكون أغنى قريش رجلا ، وإن كان إنما بك الباءة فاختر أي نساء قريش [ شئت ] فلنزوجك عشرا . فقال رسول الله - صلى الله عليه وسلم - : \" فرغت ؟ \" قال : نعم فقال رسول الله - صلى الله عليه وسلم - : ( بسم الله الرحمن الرحيم . حم تنزيل من الرحمن الرحيم ) حتى بلغ : ( فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود ) فقال عتبة : حسبك ! حسبك ! ما عندك غير هذا ؟ قال : \" لا \" فرجع إلى قريش فقالوا : ما وراءك ؟ قال : ما تركت شيئا أرى أنكم تكلمونه به إلا كلمته . قالوا : فهل أجابك ؟ [ قال : نعم ، قالوا : فما قال ؟ ] قال : لا والذي نصبها بنية ما فهمت شيئا مما قال ، غير أنه أنذركم صاعقة مثل صاعقة عاد وثمود . قالوا : ويلك ! يكلمك الرجل بالعربية ما تدري ما قال ؟ ! قال : لا والله ما فهمت شيئا مما قال غير ذكر الصاعقة .\nوهكذا رواه الحافظ أبو يعلى الموصلي في مسنده عن أبي بكر بن أبي شيبة بإسناده مثله سواء .\nوقد ساقه البغوي في تفسيره بسنده عن محمد بن فضيل ، عن الأجلح - وهو ابن عبد الله الكندي [ الكوفي ] وقد ضعف بعض الشيء - عن الذيال بن حرملة ، عن جابر ، فذكر الحديث إلى قوله : ( فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود ) فأمسك عتبة على فيه ، وناشده بالرحم ، ورجع إلى أهله ولم يخرج إلى قريش واحتبس عنهم . فقال أبو جهل : يا معشر قريش ، والله ما نرى عتبة إلا قد صبا إلى محمد ، وأعجبه طعامه ، وما ذاك إلا من حاجة [ قد ] أصابته ، فانطلقوا بنا إليه . فانطلقوا إليه فقال أبو جهل : يا عتبة ، ما حبسك عنا إلا أنك صبوت إلى محمد وأعجبك طعامه ، فإن كانت لك حاجة جمعنا لك من أموالنا ما يغنيك عن طعام محمد . فغضب عتبة ، وأقسم ألا يكلم محمدا أبدا ، وقال : والله لقد علمتم أني من أكثر قريش مالا ولكني أتيته وقصصت عليه [ القصة ] فأجابني بشيء والله ما هو بشعر ولا كهانة ولا سحر ، وقرأ السورة إلى قوله : ( فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود ) فأمسكت بفيه ، وناشدته بالرحم أن يكف ، وقد علمتم أن محمدا إذا قال شيئا لم يكذب ، فخشيت أن ينزل بكم العذاب .\nوهذا السياق أشبه من سياق البزار وأبي يعلى ، والله أعلم .\nوقد أورد هذه القصة الإمام محمد بن إسحاق بن يسار في كتاب السيرة على خلاف هذا النمط ، فقال :\nحدثني يزيد بن زياد ، عن محمد بن كعب القرظي قال : حدثت أن عتبة بن ربيعة - وكان سيدا - قال يوما وهو جالس في نادي قريش ، ورسول الله - صلى الله عليه وسلم - جالس في المسجد وحده : يا معشر قريش ألا أقوم إلى محمد فأكلمه وأعرض عليه أمورا لعله يقبل بعضها ، فنعطيه أيها شاء ويكف عنا ؟ وذلك حين أسلم حمزة ، ورأوا أصحاب رسول الله - صلى الله عليه وسلم - يزيدون ويكثرون ، فقالوا : بلى يا أبا الوليد ، فقم إليه فكلمه . فقام إليه عتبة حتى جلس إلى رسول الله - صلى الله عليه وسلم - فقال : يا ابن أخي ، إنك منا حيث قد علمت من السطة في العشيرة ، والمكان في النسب ، وإنك قد أتيت قومك بأمر عظيم ، فرقت به جماعتهم ، وسفهت به أحلامهم ، وعبت به آلهتهم ودينهم ، وكفرت به من مضى من آبائهم ، فاسمع مني أعرض عليك أمورا تنظر فيها لعلك تقبل منا بعضها . قال : فقال له رسول الله - صلى الله عليه وسلم - : \" قل يا أبا الوليد أسمع \" . قال : يا ابن أخي ، إن كنت إنما تريد بما جئت به من هذا الأمر مالا جمعنا لك من أموالنا حتى تكون من أكثرنا أموالا . وإن كنت تريد به شرفا سودناك علينا ، حتى لا نقطع أمرا دونك . وإن كنت تريد به ملكا ملكناك علينا . وإن كان هذا الذي يأتيك رئيا تراه لا تستطيع رده عن نفسك ، طلبنا لك الطب ، وبذلنا فيه أموالنا حتى نبرئك منه ، فإنه ربما غلب التابع على الرجل حتى يداوى منه - أو كما قال له - حتى إذا فرغ عتبة ورسول الله - صلى الله عليه وسلم - يستمع منه قال : \" أفرغت يا أبا الوليد ؟ \" قال : نعم . قال : \" فاستمع مني \" قال : أفعل . قال : ( بسم الله الرحمن الرحيم حم تنزيل من الرحمن الرحيم كتاب فصلت آياته قرآنا عربيا لقوم يعلمون بشيرا ونذيرا فأعرض أكثرهم فهم لا يسمعون ) ثم مضى رسول الله - صلى الله عليه وسلم - فيها يقرؤها عليه . فلما سمع عتبة أنصت لها وألقى يديه خلف ظهره معتمدا عليهما يسمع منه ، ثم انتهى رسول الله - صلى الله عليه وسلم - إلى السجدة منها ، فسجد ثم قال : \" قد سمعت يا أبا الوليد ما سمعت ، فأنت وذاك ، فقام عتبة إلى أصحابه ، فقال بعضهم لبعض : أقسم - يحلف بالله - لقد جاءكم أبو الوليد بغير الوجه الذي ذهب به . فلما جلس إليهم قالوا : ما وراءك يا أبا الوليد ؟ قال : ورائي أني قد سمعت قولا والله ما سمعت مثله قط ، والله ما هو بالسحر ولا بالشعر ولا بالكهانة . يا معشر قريش ، أطيعوني واجعلوها لي ، خلوا بين الرجل وبين ما هو فيه فاعتزلوه ، فوالله ليكونن لقوله الذي سمعت نبأ ، فإن تصبه العرب فقد كفيتموه بغيركم ، وإن يظهر على العرب فملكه ملككم ، وعزه عزكم ، وكنتم أسعد الناس به . قالوا : سحرك والله يا أبا الوليد بلسانه ! قال : هذا رأيي فيه ، فاصنعوا ما بدا لكم .\nوهذا السياق أشبه من الذي قبله ، والله أعلم .\n                                    ",
      "qortoby": "وَقَالُواْ قُلُوبُنَا فِيٓ أَكِنَّةٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ وَفِيٓ ءَاذَانِنَا وَقۡرٞ وَمِنۢ بَيۡنِنَا وَبَيۡنِكَ حِجَابٞ فَٱعۡمَلۡ إِنَّنَا عَٰمِلُونَ ٥\n                                    \n                                    \n                                    قوله تعالى : وقالوا قلوبنا في أكنة مما تدعونا إليه الأكنة جمع كنان وهو الغطاء . وقد مضى في \" البقرة \" . قال مجاهد : الكنان للقلب كالجنة للنبل . وفي آذاننا وقر أي صمم ، فكلامك لا يدخل أسماعنا ، وقلوبنا مستورة من فهمه . ومن بيننا وبينك حجاب أي خلاف في الدين ، لأنهم يعبدون الأصنام وهو يعبد الله عز وجل . قال معناه الفراء وغيره . وقيل : ستر مانع عن الإجابة . وقيل : إن أبا جهل استغشى على رأسه ثوبا وقال : يا محمد بيننا وبينك حجاب . استهزاء منه . حكاه النقاش وذكره القشيري . فالحجاب هنا الثوب . فاعمل إننا عاملون أي اعمل في هلاكنا فإنا عاملون في هلاكك ، قاله الكلبي . وقال مقاتل : اعمل لإلهك الذي أرسلك ، فإنا نعمل لآلهتنا التي نعبدها . وقيل : اعمل بما يقتضيه دينك ، فإنا عاملون بما يقتضيه ديننا . ويحتمل خامسا : فاعمل لآخرتك فإنا نعمل لدنيانا ، ذكره الماوردي .\n                                    ",
      "saadi": "وَقَالُواْ قُلُوبُنَا فِيٓ أَكِنَّةٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ وَفِيٓ ءَاذَانِنَا وَقۡرٞ وَمِنۢ بَيۡنِنَا وَبَيۡنِكَ حِجَابٞ فَٱعۡمَلۡ إِنَّنَا عَٰمِلُونَ ٥\n                                        \n                                        \n                                        \n                                        { وَقَالُوا } أي: هؤلاء المعرضون عنه، مبينين عدم انتفاعهم به، بسد الأبواب الموصلة إليه: { قُلُوبُنَا فِي أَكِنَّةٍ } أي: أغطية مغشاة { مِمَّا تَدْعُونَا إِلَيْهِ وَفِي آذَانِنَا وَقْرٌ } أي: صمم فلا نسمع لك { وَمِنْ بَيْنِنَا وَبَيْنِكَ حِجَابٌ } فلا نراك.\nالقصد من ذلك، أنهم أظهروا الإعراض عنه، من كل وجه، وأظهروا بغضه، والرضا بما هم عليه، ولهذا قالوا: { فَاعْمَلْ إِنَّنَا عَامِلُونَ } أي: كما رضيت بالعمل بدينك، فإننا راضون كل الرضا، بالعمل في ديننا، وهذا من أعظم الخذلان، حيث رضوا بالضلال عن الهدى، واستبدلوا الكفر بالإيمان، وباعوا الآخرة بالدنيا.\n                                    "
    }
  },
  {
    "id": 5,
    "versesNumber": 6,
    "souraName": "Fussilat.html",
    "contnent": "قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَٱسۡتَقِيمُوٓاْ إِلَيۡهِ وَٱسۡتَغۡفِرُوهُۗ وَوَيۡلٞ لِّلۡمُشۡرِكِينَ ٦",
    "tafsier": {
      "ibnkther": "قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَٱسۡتَقِيمُوٓاْ إِلَيۡهِ وَٱسۡتَغۡفِرُوهُۗ وَوَيۡلٞ لِّلۡمُشۡرِكِينَ ٦\n                                    \n                                    \n                                    يقول تعالى : ( قل ) يا محمد لهؤلاء المكذبين المشركين : ( إنما أنا بشر مثلكم يوحى إلي أنما إلهكم إله واحد ) لا كما تعبدونه من الأصنام والأنداد والأرباب المتفرقين ، إنما الله إله واحد ، ( فاستقيموا إليه ) أي : أخلصوا له العبادة على منوال ما أمركم به على ألسنة الرسل ، ( واستغفروه ) أي : لسالف الذنوب ، ( وويل للمشركين ) أي : دمار لهم وهلاك عليهم\n                                    ",
      "qortoby": "قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَٱسۡتَقِيمُوٓاْ إِلَيۡهِ وَٱسۡتَغۡفِرُوهُۗ وَوَيۡلٞ لِّلۡمُشۡرِكِينَ ٦\n                                    \n                                    \n                                    قوله تعالى : قل إنما أنا بشر مثلكم أي لست بملك بل أنا من بني آدم . قال الحسن : علمه الله تعالى التواضع . يوحى إلي أي من السماء على أيدي الملائكة أنما إلهكم إله واحد \" ف \" آمنوا به و استقيموا إليه أي وجهوا وجوهكم بالدعاء له والمسألة إليه ، كما يقول الرجل : استقم إلى منزلك ، أي : لا تعرج على شيء غير القصد إلى منزلك . واستغفروه أي من شرككم . وويل للمشركين\n                                    ",
      "saadi": "قُلۡ إِنَّمَآ أَنَا۠ بَشَرٞ مِّثۡلُكُمۡ يُوحَىٰٓ إِلَيَّ أَنَّمَآ إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَٱسۡتَقِيمُوٓاْ إِلَيۡهِ وَٱسۡتَغۡفِرُوهُۗ وَوَيۡلٞ لِّلۡمُشۡرِكِينَ ٦\n                                        \n                                        \n                                        \n                                        { قُلْ } لهم يا أيها النبي: { إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ يُوحَى إِلَيَّ } أي: هذه صفتي ووظيفتي، أني بشر مثلكم، ليس بيدي من الأمر شيء، ولا عندي ما تستعجلون به، وإنما فضلني اللّه عليكم، وميَّزني، وخصَّني، بالوحي الذي أوحاه إليَّ وأمرني باتباعه، ودعوتكم إليه.\n{ فَاسْتَقِيمُوا إِلَيْهِ } أي. اسلكوا الصراط الموصل إلى اللّه تعالى، بتصديق الخبر الذي أخبر به، واتباع الأمر، واجتناب النهي، هذه حقيقة الاستقامة، ثم الدوام على ذلك، وفي قوله: { إِلَيْهِ } تنبيه على الإخلاص، وأن العامل ينبغي له أن يجعل مقصوده وغايته، التي يعمل لأجلها، الوصول إلى اللّه، وإلى دار كرامته، فبذلك يكون عمله خالصًا صالحًا نافعًا، وبفواته، يكون عمله باطلاً.\nولما كان العبد، -ولو حرص على الاستقامة- لا بد أن يحصل منه خلل بتقصير بمأمور، أو ارتكاب منهي، أمره بدواء ذلك بالاستغفار المتضمن للتوبة فقال: { وَاسْتَغْفِرُوهُ } ثم توَّعد من ترك الاستقامة فقال: { وَوَيْلٌ لِلْمُشْرِكِينَ}\n                                    "
    }
  },
  {
    "id": 6,
    "versesNumber": 7,
    "souraName": "Fussilat.html",
    "contnent": "ٱلَّذِينَ لَا يُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ٧",
    "tafsier": {
      "ibnkther": "ٱلَّذِينَ لَا يُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ٧\n                                    \n                                    \n                                    ( الذين لا يؤتون الزكاة ) قال علي بن أبي طلحة ، عن ابن عباس : يعني : الذين لا يشهدون أن لا إله إلا الله . وكذا قال عكرمة .\nوهذا كقوله تعالى : ( قد أفلح من زكاها وقد خاب من دساها ) [ الشمس : 9 ، 10 ] ، وكقوله : ( قد أفلح من تزكى وذكر اسم ربه فصلى ) [ الأعلى : 14 ، 15 ] ، وقوله ( فقل هل لك إلى أن تزكى ) [ النازعات : 18 ] والمراد بالزكاة هاهنا : طهارة النفس من الأخلاق الرذيلة ، ومن أهم ذلك طهارة النفس من الشرك . وزكاة المال إنما سميت زكاة لأنها تطهره من الحرام ، وتكون سببا لزيادته وبركته وكثرة نفعه ، وتوفيقا إلى استعماله في الطاعات .\nوقال السدي : ( وويل للمشركين الذين لا يؤتون الزكاة ) أي : لا يدينون بالزكاة .\nوقال معاوية بن قرة : ليس هم من أهل الزكاة .\nوقال قتادة : يمنعون زكاة أموالهم .\nوهذا هو الظاهر عند كثير من المفسرين ، واختاره ابن جرير . وفيه نظر ; لأن إيجاب الزكاة إنما كان في السنة الثانية من الهجرة إلى المدينة ، على ما ذكره غير واحد وهذه الآية مكية ، اللهم إلا أن يقال : لا يبعد أن يكون أصل الزكاة الصدقة كان مأمورا به في ابتداء البعثة ، كقوله تعالى : ( وآتوا حقه يوم حصاده ) [ الأنعام : 141 ] ، فأما الزكاة ذات النصب والمقادير فإنما بين أمرها بالمدينة ، ويكون هذا جمعا بين القولين ، كما أن أصل الصلاة كان واجبا قبل طلوع الشمس وقبل غروبها في ابتداء البعثة ، فلما كان ليلة الإسراء قبل الهجرة بسنة ونصف ، فرض الله على رسوله [ - صلى الله عليه وسلم - ] الصلوات الخمس ، وفصل شروطها وأركانها وما يتعلق بها بعد ذلك ، شيئا فشيئا ، والله أعلم .\n                                    ",
      "qortoby": "ٱلَّذِينَ لَا يُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ٧\n                                    \n                                    \n                                    الذين لا يؤتون الزكاة قال ابن عباس : الذين لا يشهدون \" أن لا إله إلا الله \" وهي زكاة الأنفس . وقال قتادة : لا يقرون بالزكاة أنها واجبة . وقال الضحاك ومقاتل : لا يتصدقون ولا ينفقون في الطاعة . قرعهم بالشح الذي يأنف منه الفضلاء ، وفيه دلالة على أن الكافر يعذب بكفره مع منع وجوب الزكاة عليه . وقال الفراء وغيره : كان المشركون ينفقون النفقات ، ويسقون الحجيج ويطعمونهم ، فحرموا ذلك على من آمن بمحمد - صلى الله عليه وسلم - ، فنزلت فيهم هذه الآية .\nوهم بالآخرة هم كافرون فلهذا لا ينفقون في الطاعة ولا يستقيمون ولا يستغفرون . الزمخشري : فإن قلت : لم خص من بين أوصاف المشركين منع الزكاة مقرونا بالكفر بالآخرة ؟ قلت : لأن أحب شيء إلى الإنسان ماله ، وهو شقيق روحه ، فإذا بذله في سبيل الله فذلك أقوى دليل على ثباته واستقامته وصدق نيته ونصوع طويته . ألا ترى إلى قوله - عز وجل - : ومثل الذين ينفقون أموالهم ابتغاء مرضاة الله وتثبيتا من أنفسهم أي : يثبتون أنفسهم ، ويدلون على ثباتها بإنفاق الأموال ، وما خدع المؤلفة قلوبهم إلا بلمظة من الدنيا ، فقويت عصبتهم ولانت شكيمتهم ، وأهل الردة بعد رسول الله - صلى الله عليه وسلم - ما تظاهروا إلا بمنع الزكاة ، فنصبت لهم الحروب وجوهدوا . وفيه بعث للمؤمنين على أداء الزكاة ، وتخويف شديد من منعها ، حيث جعل المنع من أوصاف المشركين ، وقرن بالكفر بالآخرة .\n                                    ",
      "saadi": "ٱلَّذِينَ لَا يُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ٧\n                                        \n                                        \n                                        \n                                        { الذين لا يؤتون الزكاة } أي: الذين عبدوا من دونه من لا يملك نفعًا ولا ضرًا، ولا موتًا، ولا حياة، ولا نشورًا ودنسوا أنفسهم، فلم يزكوها بتوحيد ربهم والإخلاص له، ولم يصلوا ولا زكوا، فلا إخلاص للخالق بالتوحيد والصلاة، ولا نفع للخلق بالزكاة وغيرها. { وَهُمْ بِالْآخِرَةِ هم كَافِرُونَ } أى: لا يؤمنون بالبعث، ولا بالجنة والنار، فلذلك لما زال الخوف من قلوبهم، أقدموا على ما أقدموا عليه، مما يضرهم في الآخرة.\n                                    "
    }
  },
  {
    "id": 7,
    "versesNumber": 8,
    "souraName": "Fussilat.html",
    "contnent": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ أَجۡرٌ غَيۡرُ مَمۡنُونٖ ٨",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ أَجۡرٌ غَيۡرُ مَمۡنُونٖ ٨\n                                    \n                                    \n                                    ثم قال بعد ذلك : ( إن الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون ) قال مجاهد وغيره : لا مقطوع ولا مجبوب ، كقوله : ( ماكثين فيه أبدا ) [ الكهف : 3 ] ، وكقوله تعالى ( عطاء غير مجذوذ ) [ هود : 108 ] .\nوقال السدي : غير ممنون عليهم . وقد رد عليه بعض الأئمة هذا التفسير ، فإن المنة لله على أهل الجنة ; قال الله تعالى : ( بل الله يمن عليكم أن هداكم للإيمان ) [ الحجرات : 17 ] ، وقال أهل الجنة : ( فمن الله علينا ووقانا عذاب السموم ) [ الطور : 27 ] ، وقال رسول الله - صلى الله عليه وسلم - : \" إلا أن يتغمدني الله برحمة منه وفضل \" .\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ أَجۡرٌ غَيۡرُ مَمۡنُونٖ ٨\n                                    \n                                    \n                                    قوله تعالى : إن الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون قال ابن عباس : غير مقطوع ، مأخوذ من مننت الحبل إذا قطعته ، ومنه قول ذي الإصبع :\nإني لعمرك ما بابي بذي غلق على الصديق ولا خيري بممنون\nوقال آخر :\nفترى خلفها من الرجع والوق ع منينا كأنه أهباء\nيعني بالمنين الغبار المنقطع الضعيف . وعن ابن عباس أيضا ومقاتل : غير منقوص . ومنه المنون ; لأنها تنقص منة الإنسان أي : قوته ، وقاله قطرب ، وأنشد قول زهير :\nفضل الجياد على الخيل البطاء فلا يعطي بذلك ممنونا ولا نزقا\nقال الجوهري : والمن القطع ، ويقال النقص ، ومنه قوله تعالى : لهم أجر غير ممنون . وقال لبيد :\nعبس كواسب لا يمن طعامها\nوقال مجاهد : غير ممنون غير محسوب . وقيل : غير ممنون عليهم به . قال السدي : نزلت في الزمنى والمرضى والهرمى ، إذا ضعفوا عن الطاعة كتب لهم من الأجر كأصح ما كانوا يعملون فيه .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ أَجۡرٌ غَيۡرُ مَمۡنُونٖ ٨\n                                        \n                                        \n                                        \n                                        ولما ذكر الكافرين، ذكر المؤمنين، ووصفهم وجزاءهم، فقال: { إِنَّ الَّذِينَ آمَنُوا } بهذا الكتاب، وما اشتمل عليه مما دعا إليه من الإيمان، وصدقوا إيمانهم بالأعمال الصالحة الجامعة للإخلاص، والمتابعة. { لَهُمْ أَجْرٌ } أي: عظيم { غَيْرُ مَمْنُونٍ } أي: غير مقطوع ولا نافد، بل هو مستمر مدى الأوقات، متزايد على الساعات، مشتمل على جميع اللذات والمشتهيات.\n                                    "
    }
  },
  {
    "id": 8,
    "versesNumber": 9,
    "souraName": "Fussilat.html",
    "contnent": "۞ قُلۡ أَئِنَّكُمۡ لَتَكۡفُرُونَ بِٱلَّذِي خَلَقَ ٱلۡأَرۡضَ فِي يَوۡمَيۡنِ وَتَجۡعَلُونَ لَهُۥٓ أَندَادٗاۚ ذَٰلِكَ رَبُّ ٱلۡعَٰلَمِينَ ٩",
    "tafsier": {
      "ibnkther": "۞ قُلۡ أَئِنَّكُمۡ لَتَكۡفُرُونَ بِٱلَّذِي خَلَقَ ٱلۡأَرۡضَ فِي يَوۡمَيۡنِ وَتَجۡعَلُونَ لَهُۥٓ أَندَادٗاۚ ذَٰلِكَ رَبُّ ٱلۡعَٰلَمِينَ ٩\n                                    \n                                    \n                                    هذا إنكار من الله على المشركين الذين عبدوا معه غيره ، وهو الخالق لكل شيء ، القاهر لكل شيء ، المقدر لكل شيء ، فقال : ( قل أئنكم لتكفرون بالذي خلق الأرض في يومين وتجعلون له أندادا ) أي : نظراء وأمثالا تعبدونها معه ( ذلك رب العالمين ) أي : الخالق للأشياء هو رب العالمين كلهم .\nوهذا المكان فيه تفصيل لقوله تعالى : ( خلق السموات والأرض في ستة أيام ) [ الأعراف : 54 ] ، ففصل هاهنا ما يختص بالأرض مما اختص بالسماء ، فذكر أنه خلق الأرض أولا ؛ لأنها كالأساس ، والأصل أن يبدأ بالأساس ، ثم بعده بالسقف ، كما قال : ( هو الذي خلق لكم ما في الأرض جميعا ثم استوى إلى السماء فسواهن سبع سموات ) الآية [ البقرة : 29 ] ، .\nفأما قوله : ( أأنتم أشد خلقا أم السماء بناها رفع سمكها فسواها وأغطش ليلها وأخرج ضحاها والأرض بعد ذلك دحاها أخرج منها ماءها ومرعاها والجبال أرساها متاعا لكم ولأنعامكم ) [ النازعات : 27 - 33 ] ففي هذه الآية أن دحي الأرض كان بعد خلق السماء ، فالدحي هو مفسر بقوله : ( أخرج منها ماءها ومرعاها ) ، وكان هذا بعد خلق السماء ، فأما خلق الأرض فقبل خلق السماء بالنص ، وبهذا أجاب ابن عباس فيما ذكره البخاري عند تفسير هذه الآية من صحيحه ، فإنه قال :\nوقال المنهال ، عن سعيد بن جبير قال : قال رجل لابن عباس : إني أجد في القرآن أشياء تختلف علي قال : ( فلا أنساب بينهم يومئذ ولا يتساءلون ) [ المؤمنون : 101 ] ، ( وأقبل بعضهم على بعض يتساءلون ) [ الصافات : 27 ] ، ( ولا يكتمون الله حديثا ) [ النساء : 42 ] ، ( والله ربنا ما كنا مشركين ) [ الأنعام : 23 ] ، فقد كتموا في هذه الآية ؟ وقال : ( أم السماء بناها ) إلى قوله : ( دحاها ) [ النازعات : 27 - 30 ] ، فذكر خلق السماء قبل [ خلق ] الأرض ثم قال : ( قل أئنكم لتكفرون بالذي خلق الأرض في يومين ) إلى قوله : ( طائعين ) فذكر في هذه خلق الأرض قبل خلق السماء ؟ وقال : ( وكان الله غفورا رحيما ) [ النساء : 96 ] ، ( عزيزا حكيما ) [ النساء : 56 ] ، ( سميعا بصيرا ) [ النساء : 58 ] ، فكأنه كان ثم مضى .\nقال - يعني ابن عباس - : ( فلا أنساب بينهم يومئذ ولا يتساءلون ) في النفخة الأولى ، ثم ينفخ في الصور ، ( فصعق من في السموات ومن في الأرض إلا من شاء الله ) [ الزمر : 68 ] ، فلا أنساب بينهم عند ذلك ولا يتساءلون ، ثم في النفخة الأخرى ( وأقبل بعضهم على بعض يتساءلون )\nوأما قوله : ( ما كنا مشركين ) ( ولا يكتمون الله حديثا ) ، فإن الله يغفر لأهل الإخلاص ذنوبهم فقال المشركون : تعالوا نقول : \" لم نكن مشركين \" ، فيختم على أفواههم ، فتنطق أيديهم ، فعند ذلك يعرف أن الله لا يكتم حديثا ، وعنده ( يود الذين كفروا ) الآية [ الحجر : 2 ] .\nوخلق الأرض في يومين ، ثم خلق السماء ، ثم استوى إلى السماء ، فسواهن في يومين آخرين ، ثم دحى الأرض ، ودحيها : أن أخرج منها الماء والمرعى ، وخلق الجبال والجماد والآكام وما بينهما في يومين آخرين ، فذلك قوله : ( دحاها ) وقوله ( خلق الأرض في يومين ) فخلقت الأرض وما فيها من شيء في أربعة أيام ، وخلقت السماوات في يومين .\n( وكان الله غفورا رحيما ) [ النساء : 96 ] ، سمى نفسه بذلك ، وذلك قوله ، أي : لم يزل كذلك ; فإن الله لم يرد شيئا إلا أصاب به الذي أراد ، فلا يختلفن عليك القرآن ، فإن كلا من عند الله عز وجل .\nقال البخاري : حدثنيه يوسف بن عدي ، حدثنا عبيد الله بن عمرو ، عن زيد بن أبي أنيسة ، عن المنهال - هو ابن عمرو - بالحديث .\nفقوله : ( خلق الأرض في يومين ) يعني : يوم الأحد ويوم الاثنين .\n                                    ",
      "qortoby": "۞ قُلۡ أَئِنَّكُمۡ لَتَكۡفُرُونَ بِٱلَّذِي خَلَقَ ٱلۡأَرۡضَ فِي يَوۡمَيۡنِ وَتَجۡعَلُونَ لَهُۥٓ أَندَادٗاۚ ذَٰلِكَ رَبُّ ٱلۡعَٰلَمِينَ ٩\n                                    \n                                    \n                                    قوله تعالى : قل أإنكم لتكفرون بالذي خلق الأرض في يومين أإنكم بهمزتين ، الثانية بين بين و \" أاإنكم \" بألف بين همزتين وهو استفهام معناه التوبيخ . أمره بتوبيخهم والتعجب من فعلهم ، أي : لم تكفرون بالله وهو خالق السماوات والأرض ؟ ! \" في يومين \" الأحد والاثنين \" وتجعلون له أندادا \" أي أضدادا وشركاء ذلك رب العالمين\n                                    ",
      "saadi": "۞ قُلۡ أَئِنَّكُمۡ لَتَكۡفُرُونَ بِٱلَّذِي خَلَقَ ٱلۡأَرۡضَ فِي يَوۡمَيۡنِ وَتَجۡعَلُونَ لَهُۥٓ أَندَادٗاۚ ذَٰلِكَ رَبُّ ٱلۡعَٰلَمِينَ ٩\n                                        \n                                        \n                                        \n                                        ينكر تعالى ويعجِّب، من كفر الكافرين به، الذين جعلوا معه أندادا يشركونهم معه، ويبذلون لهم ما يشاؤون من عباداتهم، ويسوونهم بالرب العظيم، الملك الكريم، الذي خلق الأرض الكثيفة العظيمة، في يومين.\n                                    "
    }
  },
  {
    "id": 9,
    "versesNumber": 10,
    "souraName": "Fussilat.html",
    "contnent": "وَجَعَلَ فِيهَا رَوَٰسِيَ مِن فَوۡقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقۡوَٰتَهَا فِيٓ أَرۡبَعَةِ أَيَّامٖ سَوَآءٗ لِّلسَّآئِلِينَ ٠١",
    "tafsier": {
      "ibnkther": "وَجَعَلَ فِيهَا رَوَٰسِيَ مِن فَوۡقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقۡوَٰتَهَا فِيٓ أَرۡبَعَةِ أَيَّامٖ سَوَآءٗ لِّلسَّآئِلِينَ ٠١\n                                    \n                                    \n                                    ( وجعل فيها رواسي من فوقها وبارك فيها ) أي : جعلها مباركة قابلة للخير والبذر والغراس ، ( وقدر فيها أقواتها ) ، وهو : ما يحتاج أهلها إليه من الأرزاق والأماكن التي تزرع وتغرس ، يعني : يوم الثلاثاء والأربعاء ، فهما مع اليومين السابقين أربعة ; ولهذا قال تعالى : ( في أربعة أيام سواء للسائلين ) أي : لمن أراد السؤال عن ذلك ليعلمه .\nوقال مجاهد وعكرمة في قوله : ( وقدر فيها أقواتها ) جعل في كل أرض ما لا يصلح في غيرها ، ومنه : العصب باليمن ، والسابري بسابور والطيالسة بالري .\nوقال ابن عباس ، وقتادة ، والسدي في قوله تعالى : ( سواء للسائلين ) أي : لمن أراد السؤال عن ذلك .\nوقال ابن زيد : معناه ( وقدر فيها أقواتها في أربعة أيام سواء للسائلين ) أي : على وفق مراد من له حاجة إلى رزق أو حاجة ، فإن الله قدر له ما هو محتاج إليه .\nوهذا القول يشبه ما ذكروه في قوله تعالى : ( وآتاكم من كل ما سألتموه ) [ إبراهيم : 34 ] ، والله أعلم .\n                                    ",
      "qortoby": "وَجَعَلَ فِيهَا رَوَٰسِيَ مِن فَوۡقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقۡوَٰتَهَا فِيٓ أَرۡبَعَةِ أَيَّامٖ سَوَآءٗ لِّلسَّآئِلِينَ ٠١\n                                    \n                                    \n                                    وجعل فيها أي في الأرض رواسي من فوقها يعني الجبال . وقال وهب : لما خلق الله الأرض مادت على وجه الماء ، فقال لجبريل ثبتها يا جبريل . فنزل فأمسكها فغلبته الرياح ، قال : يا رب أنت أعلم ، لقد غلبت فيها . فثبتها بالجبال وأرساها وبارك فيها بما خلق فيها من المنافع . قال السدي : أنبت فيها شجرها . وقدر فيها أقواتها قال السدي والحسن : أرزاق أهلها ومصالحهم . وقال قتادة ومجاهد : خلق فيها أنهارها وأشجارها ودوابها في يوم الثلاثاء والأربعاء . وقال عكرمة والضحاك : معنى قدر فيها أقواتها أي : أرزاق أهلها وما يصلح لمعايشهم من التجارات والأشجار والمنافع في كل بلدة ما لم يجعله في الأخرى ليعيش بعضهم من بعض بالتجارة والأسفار من بلد إلى بلد . قال عكرمة : حتى إنه في بعض البلاد ليتبايعون الذهب بالملح مثلا بمثل . وقال مجاهد والضحاك : السابري من سابور ، والطيالسة من الري ، والحبر اليمانية من اليمن . في أربعة أيام يعني في تتمة أربعة أيام . ومثاله قول القائل : خرجت من البصرة إلى بغداد في عشرة أيام ، وإلى الكوفة في خمسة عشر يوما ، أي : في تتمة خمسة عشر يوما . قال معناه ابن الأنباري وغيره . سواء للسائلين قال الحسن : المعنى في أربعة أيام مستوية تامة . الفراء : في الكلام تقديم وتأخير ، والمعنى : وقدر فيها أقواتها سواء للمحتاجين . واختاره الطبري . وقرأ الحسن البصري ويعقوب الحضرمي \" سواء للسائلين \" بالجر ، وعن ابن القعقاع \" سواء \" بالرفع ، فالنصب على المصدر و \" سواء \" بمعنى استواء أي : استوت استواء . وقيل : على الحال والقطع ، والجر على النعت لأيام أو لأربعة أي : في أربعة أيام مستوية تامة . والرفع على الابتداء والخبر \" للسائلين \" أو على تقدير : هذه سواء للسائلين . وقال أهل المعاني : معنى \" سواء للسائلين \" ولغير السائلين ، أي : خلق الأرض وما فيها لمن سأل ولمن لم يسأل ، ويعطي من سأل ومن لا يسأل .\n                                    ",
      "saadi": "وَجَعَلَ فِيهَا رَوَٰسِيَ مِن فَوۡقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقۡوَٰتَهَا فِيٓ أَرۡبَعَةِ أَيَّامٖ سَوَآءٗ لِّلسَّآئِلِينَ ٠١\n                                        \n                                        \n                                        \n                                        ثم دحاها في يومين، بأن جعل فيها رواسي من فوقها، ترسيها عن الزوال والتزلزل وعدم الاستقرار.\nفكمل خلقها، ودحاها، وأخرج أقواتها، وتوابع ذلك { فِي أَرْبَعَةِ أَيَّامٍ سَوَاءً لِلسَّائِلِينَ } عن ذلك، فلا ينبئك مثل خبير، فهذا الخبر الصادق الذي لا زيادة فيه ولا نقص.\n                                    "
    }
  },
  {
    "id": 10,
    "versesNumber": 11,
    "souraName": "Fussilat.html",
    "contnent": "ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِيَ دُخَانٞ فَقَالَ لَهَا وَلِلۡأَرۡضِ ٱئۡتِيَا طَوۡعًا أَوۡ كَرۡهٗا قَالَتَآ أَتَيۡنَا طَآئِعِينَ ١١",
    "tafsier": {
      "ibnkther": "ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِيَ دُخَانٞ فَقَالَ لَهَا وَلِلۡأَرۡضِ ٱئۡتِيَا طَوۡعًا أَوۡ كَرۡهٗا قَالَتَآ أَتَيۡنَا طَآئِعِينَ ١١\n                                    \n                                    \n                                    وقوله : ( ثم استوى إلى السماء وهي دخان ) ، وهو : بخار الماء المتصاعد منه حين خلقت الأرض ، ( فقال لها وللأرض ائتيا طوعا أو كرها ) أي : استجيبا لأمري ، وانفعلا لفعلي طائعتين أو مكرهتين .\nقال الثوري ، عن ابن جريج ، عن سليمان بن موسى ، عن مجاهد ، عن ابن عباس في قوله [ تعالى ] ( فقال لها وللأرض ائتيا طوعا أو كرها ) قال : قال الله تعالى للسموات : أطلعي شمسي وقمري ونجومي . وقال للأرض : شققي أنهارك ، وأخرجي ثمارك . فقالتا : ( أتينا طائعين )\nواختاره ابن جرير - رحمه الله .\n( قالتا أتينا طائعين ) أي : بل نستجيب لك مطيعين بما فينا ، مما تريد خلقه من الملائكة والإنس والجن جميعا مطيعين لك . حكاه ابن جرير عن بعض أهل العربية قال : وقيل : تنزيلا لهن معاملة من يعقل بكلامهما .\nوقيل إن المتكلم من الأرض بذلك هو مكان الكعبة ، ومن السماء ما يسامته منها ، والله أعلم .\nوقال الحسن البصري : لو أبيا عليه أمره لعذبهما عذابا يجدان ألمه . رواه ابن أبي حاتم .\n                                    ",
      "qortoby": "ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِيَ دُخَانٞ فَقَالَ لَهَا وَلِلۡأَرۡضِ ٱئۡتِيَا طَوۡعًا أَوۡ كَرۡهٗا قَالَتَآ أَتَيۡنَا طَآئِعِينَ ١١\n                                    \n                                    \n                                    قوله تعالى : ثم استوى إلى السماء وهي دخان أي عمد إلى خلقها وقصد لتسويتها . والاستواء من صفة الأفعال على أكثر الأقوال ، يدل عليه قوله تعالى : ثم استوى إلى السماء فسواهن سبع سماوات وقد مضى القول هناك . وروى أبو صالح عن ابن عباس في قوله : ثم استوى إلى السماء يعني صعد أمره إلى السماء ، وقاله الحسن . ومن قال : إنه صفة ذاتية زائدة قال : استوى في الأزل بصفاته . و \" ثم \" ترجع إلى نقل السماء من صفة الدخان إلى حالة الكثافة . وكان ذلك الدخان من تنفس الماء حين تنفس ، على ما مضى في \" البقرة \" عن ابن مسعود وغيره . فقال لها وللأرض ائتيا طوعا أو كرها أي جيئا بما خلقت فيكما من المنافع والمصالح وأخرجاها لخلقي . قال ابن عباس : قال الله تعالى للسماء : أطلعي شمسك وقمرك وكواكبك ، وأجري رياحك وسحابك ، وقال للأرض : شقي أنهارك وأخرجي شجرك وثمارك طائعتين أو كارهتين ، قالتا أتينا طائعين في الكلام حذف أي : أتينا أمرك طائعين . وقيل : معنى هذا الأمر التسخير ، أي : كونا فكانتا كما قال تعالى : إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون فعلى هذا قال ذلك قبل خلقهما . وعلى القول الأول قال ذلك بعد خلقهما . وهو قول الجمهور . وفي قوله تعالى لهما وجهان : أحدهما : أنه قول تكلم به . الثاني : أنها قدرة منه ظهرت لهما فقام مقام الكلام في بلوغ المراد ، ذكره الماوردي .\nقالتا أتينا طائعين فيه أيضا وجهان : أحدهما : أنه ظهور الطاعة منهما حيث انقادا وأجابا فقام مقام قولهما ، ومنه قول الراجز :\nامتلأ الحوض وقال قطني مهلا رويدا قد ملأت بطني\nيعني ظهر ذلك فيه . وقال أكثر أهل العلم : بل خلق الله فيهما الكلام فتكلمتا كما أراد تعالى : قال أبو نصر السكسكي : فنطق من الأرض موضع الكعبة ، ونطق من السماء ما بحيالها ، فوضع الله تعالى فيه حرمه . وقال : طائعين ولم يقل طائعتين على اللفظ ولا طائعات على المعنى ، لأنهما سموات وأرضون ، لأنه أخبر عنهما وعمن فيهما ، وقيل : لما وصفهن بالقول والإجابة وذلك من صفات من يعقل أجراهما في الكناية مجرى من يعقل ، ومثله : رأيتهم لي ساجدين وقد تقدم . وفي حديث : إن موسى عليه الصلاة والسلام قال : يا رب لو أن السماوات والأرض حين قلت لهما ائتيا طوعا أو كرها عصياك ، ما كنت صانعا بهما ؟ قال : كنت آمر دابة من دوابي فتبتلعهما . قال : يا رب وأين تلك الدابة ؟ قال : في مرج من مروجي . قال : يا رب وأين ذلك المرج ؟ قال : علم من علمي . ذكره الثعلبي . وقرأ ابن عباس ومجاهد وسعيد بن جبير وعكرمة \" آتيا \" بالمد والفتح . وكذلك قوله : \" آتينا طائعين \" على معنى أعطيا الطاعة من أنفسكما \" قالتا \" أعطينا \" طائعين \" فحذف المفعولين جميعا . ويجوز وهو أحسن أن يكون \" آتينا \" فاعلنا فحذف مفعول واحد . ومن قرأ \" آتينا \" فالمعنى جئنا بما فينا ، على ما تقدم بيانه في غير ما موضع والحمد لله .\n                                    ",
      "saadi": "ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِيَ دُخَانٞ فَقَالَ لَهَا وَلِلۡأَرۡضِ ٱئۡتِيَا طَوۡعًا أَوۡ كَرۡهٗا قَالَتَآ أَتَيۡنَا طَآئِعِينَ ١١\n                                        \n                                        \n                                        \n                                        { ثُمَّ } بعد أن خلق الأرض { اسْتَوَى } أي: قصد { إِلَى } خلق { السَّمَاءِ وَهِيَ دُخَانٌ } قد ثار على وجه الماء، { فَقَالَ لَهَا } ولما كان هذا التخصيص يوهم الاختصاص، عطف عليه بقوله: { وَلِلْأَرْضِ اِئْتِيَا طَوْعًا أَوْ كَرْهًا } أي: انقادا لأمري، طائعتين أو مكرهتين، فلا بد من نفوذه. { قَالَتَا أَتَيْنَا طَائِعِينَ } ليس لنا إرادة تخالف إرادتك.\n                                    "
    }
  },
  {
    "id": 11,
    "versesNumber": 12,
    "souraName": "Fussilat.html",
    "contnent": "فَقَضَىٰهُنَّ سَبۡعَ سَمَٰوَاتٖ فِي يَوۡمَيۡنِ وَأَوۡحَىٰ فِي كُلِّ سَمَآءٍ أَمۡرَهَاۚ وَزَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَحِفۡظٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ ٢١",
    "tafsier": {
      "ibnkther": "فَقَضَىٰهُنَّ سَبۡعَ سَمَٰوَاتٖ فِي يَوۡمَيۡنِ وَأَوۡحَىٰ فِي كُلِّ سَمَآءٍ أَمۡرَهَاۚ وَزَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَحِفۡظٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ ٢١\n                                    \n                                    \n                                    ( فقضاهن سبع سموات في يومين ) أي : ففرغ من تسويتهن سبع سموات في يومين ، أي : آخرين ، وهما يوم الخميس ويوم الجمعة .\n( وأوحى في كل سماء أمرها ) أي : ورتب مقررا في كل سماء ما تحتاج إليه من الملائكة ، وما فيها من الأشياء التي لا يعلمها إلا هو ، ( وزينا السماء الدنيا بمصابيح ) وهن الكواكب المنيرة المشرقة على أهل الأرض ، ( وحفظا ) أي : حرسا من الشياطين أن تستمع إلى الملأ الأعلى .\n( ذلك تقدير العزيز العليم ) أي : العزيز الذي قد عز كل شيء فغلبه وقهره ، العليم بجميع حركات المخلوقات وسكناتهم .\nقال ابن جرير : حدثنا هناد بن السري ، حدثنا أبو بكر بن عياش ، عن أبي سعيد البقال ، عن عكرمة ، عن ابن عباس - قال هناد : قرأت سائر الحديث - أن اليهود أتت النبي - صلى الله عليه وسلم - فسألته عن خلق السماوات والأرض ، فقال : \" خلق الله الأرض يوم الأحد ويوم الاثنين ، وخلق الجبال يوم الثلاثاء وما فيهن من منافع ، وخلق يوم الأربعاء الشجر والماء والمدائن والعمران والخراب ، فهذه أربعة : ( قل أئنكم لتكفرون بالذي خلق الأرض في يومين وتجعلون له أندادا ذلك رب العالمين وجعل فيها رواسي من فوقها وبارك فيها وقدر فيها أقواتها في أربعة أيام سواء للسائلين ) لمن سأل ، قال : \" وخلق يوم الخميس السماء ، وخلق يوم الجمعة النجوم والشمس والقمر والملائكة إلى ثلاث ساعات بقيت منه ، فخلق في أول ساعة من هذه الثلاثة الآجال ، حين يموت من مات ، وفي الثانية ألقى الآفة على كل شيء مما ينتفع به الناس ، وفي الثالثة آدم ، وأسكنه الجنة ، وأمر إبليس بالسجود له ، وأخرجه منها في آخر ساعة \" . ثم قالت اليهود : ثم ماذا يا محمد ؟ قال : \" ثم استوى على العرش \" . قالوا : قد أصبت لو أتممت . قالوا : ثم استراح . فغضب النبي - صلى الله عليه وسلم - غضبا شديدا ، فنزل : ( ولقد خلقنا السموات والأرض وما بينهما في ستة أيام وما مسنا من لغوب فاصبر على ما يقولون ) [ ق : 38 ] .\nهذا الحديث فيه غرابة . فأما حديث ابن جريج ، عن إسماعيل بن أمية ، عن أيوب بن خالد ، عن عبد الله بن رافع ، عن أبي هريرة قال : أخذ رسول الله - صلى الله عليه وسلم - بيدي فقال : \" خلق الله التربة يوم السبت ، وخلق فيها الجبال يوم الأحد ، وخلق الشجر يوم الاثنين ، وخلق المكروه يوم الثلاثاء ، وخلق النور يوم الأربعاء ، وبث فيها الدواب يوم الخميس ، وخلق آدم بعد العصر يوم الجمعة آخر الخلق في آخر ساعة من ساعات الجمعة ، فيما بين العصر إلى الليل \" فقد رواه مسلم ، والنسائي في كتابيهما ، عن حديث ابن جريج به . وهو من غرائب الصحيح ، وقد علله البخاري في التاريخ فقال : رواه بعضهم عن أبي هريرة [ رضي الله عنه ] عن كعب الأحبار ، وهو الأصح .\n                                    ",
      "qortoby": "فَقَضَىٰهُنَّ سَبۡعَ سَمَٰوَاتٖ فِي يَوۡمَيۡنِ وَأَوۡحَىٰ فِي كُلِّ سَمَآءٍ أَمۡرَهَاۚ وَزَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَحِفۡظٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ ٢١\n                                    \n                                    \n                                    قوله تعالى : فقضاهن سبع سماوات في يومين أي أكملهن وفرغ منهن . وقيل . أحكمهن كما قال [ أبو ذؤيب الهذلي ] :\nوعليهما مسرودتان قضاهما داود أو صنع السوابغ تبع\nفي يومين سوى الأربعة الأيام التي خلق فيها الأرض ، فوقع خلق السماوات والأرض في ستة أيام ، كما قال تعالى : خلق السماوات والأرض في ستة أيام على ما تقدم في \" الأعراف \" بيانه . قال مجاهد : ويوم من الستة الأيام كألف سنة مما تعدون . وعن عبد الله بن سلام قال : خلق الله الأرض في يومين ، وقدر فيها أقواتها في يومين ، وخلق السماوات في يومين ، خلق الأرض في يوم الأحد والاثنين ، وقدر فيها أقواتها يوم الثلاثاء ويوم الأربعاء ، وخلق السماوات في يوم الخميس ويوم الجمعة ، وآخر ساعة في يوم الجمعة خلق الله آدم في عجل ، وهي التي تقوم فيها الساعة ، وما خلق الله من دابة إلا وهي تفزع من يوم الجمعة إلا الإنس والجن . على هذا أهل التفسير ، إلا ما رواه مسلم من حديث أبي هريرة قال : أخذ رسول الله - صلى الله عليه وسلم - بيدي ، فقال : خلق الله التربة يوم السبت . . . الحديث ، وقد تكلمنا على إسناده في أول سورة \" الأنعام \" .\n[ قوله تعالى : ] وأوحى في كل سماء أمرها قال قتادة والسدي : خلق فيها شمسها وقمرها ونجومها وأفلاكها ، وخلق في كل سماء خلقها من الملائكة والخلق الذي فيها من البحار وجبال البرد والثلوج . وهو قول ابن عباس ، قال : ولله في كل سماء بيت تحج إليه وتطوف به الملائكة بحذاء الكعبة ، والذي في السماء الدنيا هو البيت المعمور . وقيل : أوحى الله في كل سماء ، أي : أوحى فيها ما أراده وما أمر به فيها . والإيحاء قد يكون أمرا ، لقوله : بأن ربك أوحى لها وقوله : وإذ أوحيت إلى الحواريين أي : أمرتهم وهو أمر تكوين .\n[ قوله تعالى : ] وزينا السماء الدنيا بمصابيح أي بكواكب تضيء وقيل : إن في كل سماء كواكب تضيء . وقيل : بل الكواكب مختصة بالسماء الدنيا . وحفظا أي وحفظناها حفظا ، أي : من الشياطين الذين يسترقون السمع . وهذا الحفظ بالكواكب التي ترجم بها الشياطين على ما تقدم في \" الحجر \" بيانه . وظاهر هذه الآية يدل على أن الأرض خلقت قبل السماء . وقال في آية أخرى : أم السماء بناها ثم قال : والأرض بعد ذلك دحاها وهذا يدل على خلق السماء أولا . وقال قوم : خلقت الأرض قبل السماء ، فأما قوله : والأرض بعد ذلك دحاها فالدحو غير الخلق ، فالله خلق الأرض ثم خلق السموات ، ثم دحا الأرض أي : مدها وبسطها ، قاله ابن عباس . وقد مضى هذا المعنى مجودا في \" البقرة \" والحمد لله . ذلك تقدير العزيز العليم .\n                                    ",
      "saadi": "فَقَضَىٰهُنَّ سَبۡعَ سَمَٰوَاتٖ فِي يَوۡمَيۡنِ وَأَوۡحَىٰ فِي كُلِّ سَمَآءٍ أَمۡرَهَاۚ وَزَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَحِفۡظٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ ٢١\n                                        \n                                        \n                                        \n                                        { فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ } فَتَمَّ خلق السماوات والأرض في ستة أيام، أولها يوم الأحد، وآخرها يوم الجمعة، مع أن قدرة اللّه ومشيئته صالحة لخلق الجميع في لحظة واحدة، ولكن مع أنه قدير، فهو حكيم رفيق، فمن حكمته ورفقه، أن جعل خلقها في هذه المدة المقدرة.\nواعلم أن ظاهر هذه الآية، مع قوله تعالى في النازعات، لما ذكر خلق السماوات قال: { وَالْأَرْضَ بَعْدَ ذَلِكَ دَحَاهَا } يظهر منهما التعارض، مع أن كتاب اللّه، لا تعارض فيه ولا اختلاف.\nوالجواب عن ذلك، ما قاله كثير من السلف، أن خلق الأرض وصورتها متقدم على خلق السماوات كما هنا، ودحي الأرض بأن { أَخْرَجَ مِنْهَا مَاءَهَا وَمَرْعَاهَا وَالْجِبَالَ أَرْسَاهَا } متأخر عن خلق السماوات كما في سورة النازعات، ولهذا قال فيها: { وَالْأَرْضَ بَعْدَ ذَلِكَ دَحَاهَا أَخْرَجَ مِنْهَا } إلى آخره ولم يقل: \"والأرض بعد ذلك خلقها\"\nوقوله: { وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا } أي: الأمر والتدبير اللائق بها، الذي اقتضته حكمة أحكم الحاكمين.\n{ وَزَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ } هي: النجوم، يستنار، بها، ويهتدى، وتكون زينة وجمالاً للسماء ظاهرًا، وجمالاً لها، باطنًا، بجعلها رجومًا للشياطين، لئلا يسترق السمع فيها. { ذَلِكَ } المذكور، من الأرض وما فيها، والسماء وما فيها { تَقْدِيرُ الْعَزِيزِ } الذي عزته، قهر بها الأشياء ودبرها، وخلق بها المخلوقات. { الْعَلِيمِ } الذي أحاط علمه بالمخلوقات، الغائب والشاهد.\nفَتَرْكُ المشركين الإخلاص لهذا الرب العظيم الواحد القهار، الذي انقادت المخلوقات لأمره ونفذ فيها قدره، من أعجب الأشياء، واتخاذهم له أندادًا يسوونهم به، وهم ناقصون في أوصافهم وأفعالهم، أعجب، وأعجب، ولا دواء لهؤلاء، إن استمر إعراضهم، إلا العقوبات الدنيوية والأخروية.\n                                    "
    }
  },
  {
    "id": 12,
    "versesNumber": 13,
    "souraName": "Fussilat.html",
    "contnent": "فَإِنۡ أَعۡرَضُواْ فَقُلۡ أَنذَرۡتُكُمۡ صَٰعِقَةٗ مِّثۡلَ صَٰعِقَةِ عَادٖ وَثَمُودَ ٣١",
    "tafsier": {
      "ibnkther": "فَإِنۡ أَعۡرَضُواْ فَقُلۡ أَنذَرۡتُكُمۡ صَٰعِقَةٗ مِّثۡلَ صَٰعِقَةِ عَادٖ وَثَمُودَ ٣١\n                                    \n                                    \n                                    يقول تعالى : قل يا محمد لهؤلاء المشركين المكذبين بما جئتهم به من الحق : إن أعرضتم عما جئتكم به من عند الله فإني أنذركم حلول نقمة الله بكم ، كما حلت بالأمم الماضين من المكذبين بالمرسلين ( صاعقة مثل صاعقة عاد وثمود ) أي : ومن شاكلهما ممن فعل كفعلهما .\n                                    ",
      "qortoby": "فَإِنۡ أَعۡرَضُواْ فَقُلۡ أَنذَرۡتُكُمۡ صَٰعِقَةٗ مِّثۡلَ صَٰعِقَةِ عَادٖ وَثَمُودَ ٣١\n                                    \n                                    \n                                    قوله تعالى : فإن أعرضوا يعني كفار قريش عما تدعوهم إليه يا محمد من الإيمان . فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود أي خوفتكم هلاكا مثل هلاك عاد وثمود .\n                                    ",
      "saadi": "فَإِنۡ أَعۡرَضُواْ فَقُلۡ أَنذَرۡتُكُمۡ صَٰعِقَةٗ مِّثۡلَ صَٰعِقَةِ عَادٖ وَثَمُودَ ٣١\n                                        \n                                        \n                                        \n                                        أي: فإن أعرض هؤلاء المكذبون بعد ما بين لهم من أوصاف القرآن الحميدة، ومن صفات الإله العظيم { فَقُلْ أَنْذَرْتُكُمْ صَاعِقَةً } أي: عذابًا يستأصلكم ويجتاحكم، { مِثْلَ صَاعِقَةِ عَادٍ وَثَمُودَ } القبيلتين المعروفتين، حيث اجتاحهم العذاب، وحل عليهم، وبيل العقاب، وذلك بظلمهم وكفرهم.\n                                    "
    }
  },
  {
    "id": 13,
    "versesNumber": 14,
    "souraName": "Fussilat.html",
    "contnent": "إِذۡ جَآءَتۡهُمُ ٱلرُّسُلُ مِنۢ بَيۡنِ أَيۡدِيهِمۡ وَمِنۡ خَلۡفِهِمۡ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۖ قَالُواْ لَوۡ شَآءَ رَبُّنَا لَأَنزَلَ مَلَٰٓئِكَةٗ فَإِنَّا بِمَآ أُرۡسِلۡتُم بِهِۦ كَٰفِرُونَ ٤١",
    "tafsier": {
      "ibnkther": "إِذۡ جَآءَتۡهُمُ ٱلرُّسُلُ مِنۢ بَيۡنِ أَيۡدِيهِمۡ وَمِنۡ خَلۡفِهِمۡ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۖ قَالُواْ لَوۡ شَآءَ رَبُّنَا لَأَنزَلَ مَلَٰٓئِكَةٗ فَإِنَّا بِمَآ أُرۡسِلۡتُم بِهِۦ كَٰفِرُونَ ٤١\n                                    \n                                    \n                                    ( إذ جاءتهم الرسل من بين أيديهم ومن خلفهم ) [ الأحقاف : 21 ] ، كقوله تعالى : ( واذكر أخا عاد إذ أنذر قومه بالأحقاف وقد خلت النذر من بين يديه ومن خلفه ) [ الأحقاف : 21 ] أي : في القرى المجاورة لبلادهم ، بعث الله إليهم الرسل يأمرون بعبادة الله وحده لا شريك له ، ومبشرين ومنذرين ورأوا ما أحل الله بأعدائه من النقم ، وما ألبس أولياءه من النعم ، ومع هذا ما آمنوا ولا صدقوا ، بل كذبوا وجحدوا ، وقالوا : ( لو شاء ربنا لأنزل ملائكة ) أي : لو أرسل الله رسلا لكانوا ملائكة من عنده ، ( فإنا بما أرسلتم به ) أي : أيها البشر ) كافرون ) أي : لا نتبعكم وأنتم بشر مثلنا .\n                                    ",
      "qortoby": "إِذۡ جَآءَتۡهُمُ ٱلرُّسُلُ مِنۢ بَيۡنِ أَيۡدِيهِمۡ وَمِنۡ خَلۡفِهِمۡ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۖ قَالُواْ لَوۡ شَآءَ رَبُّنَا لَأَنزَلَ مَلَٰٓئِكَةٗ فَإِنَّا بِمَآ أُرۡسِلۡتُم بِهِۦ كَٰفِرُونَ ٤١\n                                    \n                                    \n                                    إذ جاءتهم الرسل من بين أيديهم ومن خلفهم يعني من أرسل إليهم وإلى من قبلهم ألا تعبدوا إلا الله موضع أن نصب بإسقاط الخافض أي : ب \" ألا تعبدوا \" قالوا لو شاء ربنا لأنزل ملائكة بدل الرسل فإنا بما أرسلتم به كافرون من الإنذار والتبشير . قيل : هذا استهزاء منهم . وقيل : إقرار منهم بإرسالهم ثم بعده جحود وعناد .\n                                    ",
      "saadi": "إِذۡ جَآءَتۡهُمُ ٱلرُّسُلُ مِنۢ بَيۡنِ أَيۡدِيهِمۡ وَمِنۡ خَلۡفِهِمۡ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۖ قَالُواْ لَوۡ شَآءَ رَبُّنَا لَأَنزَلَ مَلَٰٓئِكَةٗ فَإِنَّا بِمَآ أُرۡسِلۡتُم بِهِۦ كَٰفِرُونَ ٤١\n                                        \n                                        \n                                        \n                                        حيث { جَاءَتْهُمُ الرُّسُلُ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ } أي: يتبع بعضهم بعضا متوالين، ودعوتهم جميعا واحدة. { أَنْ لَا تَعْبُدُوا إِلَّا اللَّهَ } أي: يأمرونهم بالإخلاص للّه، وينهونهم عن الشرك، فردوا رسالتهم وكذبوهم، { قَالُوا لَوْ شَاءَ رَبُّنَا لَأَنْزَلَ مَلَائِكَةً } أي: وأما أنتم فبشر مثلنا { فَإِنَّا بِمَا أُرْسِلْتُمْ بِهِ كَافِرُونَ } وهذه الشبهة لم تزل متوارثة بين المكذبين، من الأمم وهي من أوهى الشُّبَهِ، فإنه ليس من شرط الإرسال، أن يكون المرسل مَلَكًا، وإنما شرط الرسالة، أن يأتي الرسول بما يدل على صدقه، فَلْيَقْدَحُوا، إن استطاعوا بصدقهم، بقادح عقلي أو شرعي، ولن يستطيعوا إلى ذلك سبيلا.\n                                    "
    }
  },
  {
    "id": 14,
    "versesNumber": 15,
    "souraName": "Fussilat.html",
    "contnent": "فَأَمَّا عَادٞ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَقَالُواْ مَنۡ أَشَدُّ مِنَّا قُوَّةًۖ أَوَ لَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَهُمۡ هُوَ أَشَدُّ مِنۡهُمۡ قُوَّةٗۖ وَكَانُواْ بِ‍َٔايَٰتِنَا يَجۡحَدُونَ ٥١",
    "tafsier": {
      "ibnkther": "فَأَمَّا عَادٞ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَقَالُواْ مَنۡ أَشَدُّ مِنَّا قُوَّةًۖ أَوَ لَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَهُمۡ هُوَ أَشَدُّ مِنۡهُمۡ قُوَّةٗۖ وَكَانُواْ بِ‍َٔايَٰتِنَا يَجۡحَدُونَ ٥١\n                                    \n                                    \n                                    قال الله تعالى : ( فأما عاد فاستكبروا في الأرض [ بغير الحق ] ) أي : بغوا وعتوا وعصوا ، ( وقالوا من أشد منا قوة ) أي : منوا بشدة تركيبهم وقواهم ، واعتقدوا أنهم يمتنعون به من بأس الله ! ( أولم يروا أن الله الذي خلقهم هو أشد منهم قوة ) أي : أفما يتفكرون فيمن يبارزون بالعداوة ؟ فإنه العظيم الذي خلق الأشياء وركب فيها قواها الحاملة لها ، وإن بطشه شديد ، كما قال تعالى : ( والسماء بنيناها بأيد وإنا لموسعون ) [ الذاريات : 47 ] .\n                                    ",
      "qortoby": "فَأَمَّا عَادٞ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَقَالُواْ مَنۡ أَشَدُّ مِنَّا قُوَّةًۖ أَوَ لَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَهُمۡ هُوَ أَشَدُّ مِنۡهُمۡ قُوَّةٗۖ وَكَانُواْ بِ‍َٔايَٰتِنَا يَجۡحَدُونَ ٥١\n                                    \n                                    \n                                    قوله تعالى : فأما عاد فاستكبروا في الأرض على عباد الله هود ومن آمن معه بغير الحق وقالوا من أشد منا قوة اغتروا بأجسامهم حين تهددهم بالعذاب ، وقالوا : نحن نقدر على دفع العذاب عن أنفسنا بفضل قوتنا . وذلك أنهم كانوا ذوي أجسام طوال وخلق عظيم .\nوقد مضى في \" الأعراف \" عن ابن عباس : أن أطولهم كان مائة ذراع وأقصرهم كان ستين ذراعا . فقال الله تعالى ردا عليهم : أولم يروا أن الله الذي خلقهم هو أشد منهم قوة وقدرة ، وإنما يقدر العبد بإقدار الله ، فالله أقدر إذا . وكانوا بآياتنا يجحدون أي بمعجزاتنا يكفرون .\n                                    ",
      "saadi": "فَأَمَّا عَادٞ فَٱسۡتَكۡبَرُواْ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَقَالُواْ مَنۡ أَشَدُّ مِنَّا قُوَّةًۖ أَوَ لَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ ٱلَّذِي خَلَقَهُمۡ هُوَ أَشَدُّ مِنۡهُمۡ قُوَّةٗۖ وَكَانُواْ بِ‍َٔايَٰتِنَا يَجۡحَدُونَ ٥١\n                                        \n                                        \n                                        \n                                        هذا تفصيل لقصة هاتين الأمتين، عاد، وثمود. { فَأَمَّا عَادٌ } فكانوا -مع كفرهم باللّه، وجحدهم بآيات اللّه، وكفرهم برسله- مستكبرين في الأرض، قاهرين لمن حولهم من العباد، ظالمين لهم، قد أعجبتهم قوتهم. { وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً } قال تعالى ردًا عليهم، بما يعرفه كل أحد: { أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً } فلولا خلقه إياهم، لم يوجدوا فلو نظروا إلى هذه الحال نظرًا صحيحًا، لم يغتروا بقوتهم، فعاقبهم اللّه عقوبة، تناسب قوتهم، التي اغتروا بها.\n                                    "
    }
  },
  {
    "id": 15,
    "versesNumber": 16,
    "souraName": "Fussilat.html",
    "contnent": "فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا صَرۡصَرٗا فِيٓ أَيَّامٖ نَّحِسَاتٖ لِّنُذِيقَهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَخۡزَىٰۖ وَهُمۡ لَا يُنصَرُونَ ٦١",
    "tafsier": {
      "ibnkther": "فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا صَرۡصَرٗا فِيٓ أَيَّامٖ نَّحِسَاتٖ لِّنُذِيقَهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَخۡزَىٰۖ وَهُمۡ لَا يُنصَرُونَ ٦١\n                                    \n                                    \n                                    فبارزوا الجبار بالعداوة ، وجحدوا بآياته وعصوا رسوله ، فلهذا قال : ( فأرسلنا عليهم ريحا صرصرا ) قال بعضهم : وهي الشديدة الهبوب . وقيل : الباردة . وقيل : هي التي لها صوت .\nوالحق أنها متصفة بجميع ذلك ، فإنها كانت ريحا شديدة قوية ; لتكون عقوبتهم من جنس ما اغتروا به من قواهم ، وكانت باردة شديدة البرد جدا ، كقوله تعالى : ( بريح صرصر عاتية ) [ الحاقة : 6 ] ، أي : باردة شديدة ، وكانت ذات صوت مزعج ، ومنه سمي النهر المشهور ببلاد المشرق \" صرصرا لقوة صوت جريه .\nوقوله : ( في أيام نحسات ) أي : متتابعات ، ( سبع ليال وثمانية أيام حسوما ) [ الحاقة : 7 ] ، كقوله ( في يوم نحس مستمر ) [ القمر : 19 ] ، أي : ابتدئوا بهذا العذاب في يوم نحس عليهم ، واستمر بهم هذا النحس سبع ليال وثمانية أيام حتى أبادهم عن آخرهم ، واتصل بهم خزي الدنيا بعذاب الآخرة ; ولهذا قال تعالى : ( لنذيقهم عذاب الخزي في الحياة الدنيا ولعذاب الآخرة أخزى ) [ أي ] أشد خزيا لهم ، ( وهم لا ينصرون ) أي : في الأخرى ، كما لم ينصروا في الدنيا ، وما كان لهم من الله من واق يقيهم العذاب ويدرأ عنهم النكال .\n                                    ",
      "qortoby": "فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا صَرۡصَرٗا فِيٓ أَيَّامٖ نَّحِسَاتٖ لِّنُذِيقَهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَخۡزَىٰۖ وَهُمۡ لَا يُنصَرُونَ ٦١\n                                    \n                                    \n                                    قوله تعالى : فأرسلنا عليهم ريحا صرصرا هذا تفسير الصاعقة التي أرسلها عليهم ، أي : ريحا باردة شديدة البرد وشديدة الصوت والهبوب . ويقال : أصلها صرر من الصر وهو البرد ، فأبدلوا مكان الراء الوسطى فاء الفعل ، كقولهم : كبكبوا أصله كببوا ، وتجفجف الثوب أصله تجفف . أبو عبيدة : معنى صرصر : شديدة عاصفة . عكرمة وسعيد بن جبير : شديد البرد . وأنشد قطرب قول الحطيئة :\nالمطعمون إذا هبت بصرصرة والحاملون إذا استودوا على الناس\nاستودوا : إذا سئلوا الدية . مجاهد : الشديدة السموم . وروى معمر عن قتادة قال : باردة . وقاله عطاء ; لأن صرصرا مأخوذ من صر ، والصر في كلام العرب البرد كما قال [ امرؤ القيس ] :\nلها عذر كقرون النساء ركبن في يوم ريح وصر\nوقال السدي : الشديدة الصوت . ومنه صر القلم والباب يصر صريرا أي : صوت . ويقال : درهم صري وصري للذي له صوت إذا نقد . قال ابن السكيت : صرصر يجوز أن يكون من الصر وهو البرد ، ويجوز أن يكون من صرير الباب ، ومن الصرة وهي الصيحة . ومنه فأقبلت امرأته في صرة . وصرصر اسم نهر بالعراق . في أيام نحسات أي مشئومات ، قاله مجاهد وقتادة . كن آخر شوال من يوم الأربعاء إلى يوم الأربعاء ، وذلك سبع ليال وثمانية أيام حسوما قال ابن عباس : ما عذب قوم إلا في يوم الأربعاء . وقيل : نحسات : باردات ، حكاه النقاش . وقيل : متتابعات ، عن ابن عباس وعطية . الضحاك : شداد . وقيل : ذات غبار ، حكاه ابن عيسى . ومنه قول الراجز :\nقد اغتدى قبل طلوع الشمس للصيد في يوم قليل النحس\nقال الضحاك وغيره : أمسك الله عنهم المطر ثلاث سنين ، ودرت الرياح عليهم في غير مطر ، وخرج منهم قوم إلى مكة يستسقون بها للعباد ، وكان الناس في ذلك الزمان إذا نزل بهم بلاء أو جهد طلبوا إلى الله تعالى الفرج منه ، وكانت طلبتهم ذلك من الله تعالى عند بيته الحرام مكة مسلمهم وكافرهم ، فيجتمع بمكة ناس كثير شتى ، مختلفة أديانهم ، وكلهم معظم لمكة ، عارف حرمتها ومكانها من الله تعالى . وقال جابر بن عبد الله والتيمي : إذا أراد الله بقوم خيرا أرسل عليهم المطر وحبس عنهم كثرة الرياح ، وإذا أراد الله بقوم شرا حبس عنهم المطر وسلط عليهم كثرة الرياح . وقرأ نافع وابن كثير وأبو عمرو \" نحسات \" بإسكان الحاء على أنه جمع نحس الذي هو مصدر وصف به . الباقون : نحسات بكسر الحاء أي : ذوات نحس . ومما يدل على أن النحس مصدر قوله : \" في يوم نحس مستمر \" ولو كان صفة لم يضف اليوم إليه ، وبهذا كان يحتج أبو عمرو على قراءته ، واختاره أبو حاتم . واختار أبو عبيد القراءة الثانية وقال : لا تصح حجة أبي عمرو ; لأنه أضاف اليوم إلى النحس فأسكن ، وإنما كان يكون حجة لو نون اليوم ونعت وأسكن ، فقال : في يوم نحس وهذا لم يقرأ به أحد نعلمه . وقال المهدوي : ولم يسمع في نحس إلا الإسكان . قال الجوهري : وقرئ في قوله في يوم نحس على الصفة ، والإضافة أكثر وأجود . وقد نحس الشيء بالكسر فهو نحس أيضا ، قال الشاعر :\nأبلغ جذاما ولخما أن إخوتهم طيا وبهراء قوم نصرهم نحس\nومنه قيل : أيام نحسات . لنذيقهم أي لكي نذيقهم عذاب الخزي في الحياة الدنيا بالريح العقيم . ولعذاب الآخرة أخزى أي أعظم وأشد وهم لا ينصرون .\n                                    ",
      "saadi": "فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا صَرۡصَرٗا فِيٓ أَيَّامٖ نَّحِسَاتٖ لِّنُذِيقَهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَخۡزَىٰۖ وَهُمۡ لَا يُنصَرُونَ ٦١\n                                        \n                                        \n                                        \n                                        { فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا } أي: ريحًا عظيمة، من قوتها وشدتها، لها صوت مزعج، كالرعد القاصف. فسخرها اللّه عليهم { سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُومًا فَتَرَى الْقَوْمَ فِيهَا صَرْعَى كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ } { نحسات } فدمرتهم وأهلكتهم، فأصبحوا لا يرى إلا مساكنهم. وقال هنا: { لِنُذِيقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا } الذي اختزوا به وافتضحوا بين الخليقة. { وَلَعَذَابُ الْآخِرَةِ أَخْزَى وَهُمْ لَا يُنْصَرُونَ } أي: لا يمنعون من عذاب اللّه، ولا ينفعون أنفسهم.\n                                    "
    }
  },
  {
    "id": 16,
    "versesNumber": 17,
    "souraName": "Fussilat.html",
    "contnent": "وَأَمَّا ثَمُودُ فَهَدَيۡنَٰهُمۡ فَٱسۡتَحَبُّواْ ٱلۡعَمَىٰ عَلَى ٱلۡهُدَىٰ فَأَخَذَتۡهُمۡ صَٰعِقَةُ ٱلۡعَذَابِ ٱلۡهُونِ بِمَا كَانُواْ يَكۡسِبُونَ ٧١",
    "tafsier": {
      "ibnkther": "وَأَمَّا ثَمُودُ فَهَدَيۡنَٰهُمۡ فَٱسۡتَحَبُّواْ ٱلۡعَمَىٰ عَلَى ٱلۡهُدَىٰ فَأَخَذَتۡهُمۡ صَٰعِقَةُ ٱلۡعَذَابِ ٱلۡهُونِ بِمَا كَانُواْ يَكۡسِبُونَ ٧١\n                                    \n                                    \n                                    وقوله : ( وأما ثمود فهديناهم ) قال ابن عباس ، وأبو العالية ، وسعيد بن جبير ، وقتادة ، والسدي ، وابن زيد : بينا لهم .\nوقال الثوري : دعوناهم .\n( فاستحبوا العمى على الهدى ) أي : بصرناهم ، وبينا لهم ، ووضحنا لهم الحق على لسان نبيهم صالح - صلى الله عليه وسلم - فخالفوه وكذبوه ، وعقروا ناقة الله التي جعلها آية وعلامة على صدق نبيهم ، ( فأخذتهم صاعقة العذاب الهون ) أي : بعث الله عليهم صيحة ورجفة وذلا وهوانا وعذابا ونكالا ( بما كانوا يكسبون ) أي : من التكذيب والجحود .\n                                    ",
      "qortoby": "وَأَمَّا ثَمُودُ فَهَدَيۡنَٰهُمۡ فَٱسۡتَحَبُّواْ ٱلۡعَمَىٰ عَلَى ٱلۡهُدَىٰ فَأَخَذَتۡهُمۡ صَٰعِقَةُ ٱلۡعَذَابِ ٱلۡهُونِ بِمَا كَانُواْ يَكۡسِبُونَ ٧١\n                                    \n                                    \n                                    قوله تعالى : وأما ثمود فهديناهم فاستحبوا العمى على الهدى فأخذتهم صاعقة العذاب الهون بما كانوا يكسبون\nقوله تعالى : وأما ثمود فهديناهم أي بينا لهم الهدى والضلال ، عن ابن عباس وغيره . وقرأ الحسن وابن أبي إسحاق وغيرهما \" وأما ثمود \" بالنصب وقد مضى الكلام فيه في \" الأعراف \" . فاستحبوا العمى على الهدى أي اختاروا الكفر على الإيمان . وقال أبو العالية : اختاروا العمى على البيان . السدي : اختاروا المعصية على الطاعة . فأخذتهم صاعقة العذاب الهون الهون بالضم الهوان . وهون بن خزيمة بن مدركة بن إلياس بن مضر أخو كنانة وأسد . وأهانه : استخف به . والاسم الهوان والمهانة . وأضيف الصاعقة إلى العذاب ، لأن الصاعقة اسم للمبيد المهلك ، فكأنه قال : مهلك العذاب ، أي : العذاب المهلك . والهون وإن كان مصدرا فمعناه الإهانة ، والإهانة عذاب ، فجاز أن يجعل أحدهما وصفا للآخر ، فكأنه قال : صاعقة الهون . وهو كقولك : عندي علم اليقين ، وعندي العلم اليقين . ويجوز أن يكون الهون اسما مثل الدون ، يقال : عذاب هون أي : مهين ، كما قال : ما لبثوا في العذاب المهين . وقيل : أي : صاعقة العذاب ذي الهون . بما كانوا يكسبون من تكذيبهم صالحا وعقرهم الناقة ، على ما تقدم .\n                                    ",
      "saadi": "وَأَمَّا ثَمُودُ فَهَدَيۡنَٰهُمۡ فَٱسۡتَحَبُّواْ ٱلۡعَمَىٰ عَلَى ٱلۡهُدَىٰ فَأَخَذَتۡهُمۡ صَٰعِقَةُ ٱلۡعَذَابِ ٱلۡهُونِ بِمَا كَانُواْ يَكۡسِبُونَ ٧١\n                                        \n                                        \n                                        \n                                        وأما ثمود وهم القبيلة المعروفة الذين سكنوا الحجر وحواليه، الذين أرسل اللّه إليهم صالحًا عليه السلام، يدعوهم إلى توحيد ربهم، وينهاهم عن الشرك وآتاهم اللّه الناقة، آية عظيمة، لها شرب ولهم شرب يوم معلوم، يشربون لبنها يومًا ويشربون من الماء يومًا، وليسوا ينفقون عليها، بل تأكل من أرض اللّه، ولهذا قال هنا: { وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ } أي: هداية بيان، وإنما نص عليهم، وإن كان جميع الأمم المهلكة، قد قامت عليهم الحجة، وحصل لهم البيان، لأن آية ثمود، آية باهرة، قد رآها صغيرهم وكبيرهم، وذكرهم وأنثاهم، وكانت آية مبصرة، فلهذا خصهم بزيادة البيان والهدى.\nولكنهم -من ظلمهم وشرهم- استحبوا العمى -الذي هو الكفر والضلال- على الهدى -الذي هو: العلم والإيمان- { فَأَخَذَتْهُمْ صَاعِقَةُ الْعَذَابِ الْهُونِ بِمَا كَانُوا يَكْسِبُونَ } لا ظلمًا من اللّه لهم.\n\n                                    "
    }
  },
  {
    "id": 17,
    "versesNumber": 18,
    "souraName": "Fussilat.html",
    "contnent": "وَنَجَّيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ ٨١",
    "tafsier": {
      "ibnkther": "وَنَجَّيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ ٨١\n                                    \n                                    \n                                    ( ونجينا الذين آمنوا [ وكانوا يتقون ] ) أي : من بين أظهرهم ، لم يمسهم سوء ، ولا نالهم من ذلك ضرر ، بل نجاهم الله مع نبيهم صالح [ عليه السلام ] بإيمانهم ، وتقواهم لله ، عز وجل .\n                                    ",
      "qortoby": "وَنَجَّيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ ٨١\n                                    \n                                    \n                                    ونجينا الذين آمنوا وكانوا يتقون يعني صالحا ومن آمن به ، أي : ميزناهم عن الكفار ، فلم يحل بهم ما حل بالكفار ، وهكذا يا محمد نفعل بمؤمني قومك وكفارهم .\n                                    ",
      "saadi": "وَنَجَّيۡنَا ٱلَّذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَ ٨١\n                                        \n                                        \n                                        \n                                        { وَنَجَّيْنَا الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ } أي نجى اللّه صالحًا عليه السلام ومن اتبعه من المؤمنين المتقين للشرك، والمعاصي.\n                                    "
    }
  },
  {
    "id": 18,
    "versesNumber": 19,
    "souraName": "Fussilat.html",
    "contnent": "وَيَوۡمَ يُحۡشَرُ أَعۡدَآءُ ٱللَّهِ إِلَى ٱلنَّارِ فَهُمۡ يُوزَعُونَ ٩١",
    "tafsier": {
      "ibnkther": "وَيَوۡمَ يُحۡشَرُ أَعۡدَآءُ ٱللَّهِ إِلَى ٱلنَّارِ فَهُمۡ يُوزَعُونَ ٩١\n                                    \n                                    \n                                    يقول تعالى : ( ويوم يحشر أعداء الله إلى النار فهم يوزعون ) أي : اذكر لهؤلاء المشركين يوم يحشرون إلى النار ) يوزعون ) ، أي : تجمع الزبانية أولهم على آخرهم ، كما قال تعالى : ( ونسوق المجرمين إلى جهنم وردا ) [ مريم : 86 ] ، أي : عطاشا .\n                                    ",
      "qortoby": "وَيَوۡمَ يُحۡشَرُ أَعۡدَآءُ ٱللَّهِ إِلَى ٱلنَّارِ فَهُمۡ يُوزَعُونَ ٩١\n                                    \n                                    \n                                    قوله تعالى : ويوم يحشر أعداء الله إلى النار فهم يوزعون قرأ نافع \" نحشر \" بالنون \" أعداء \" بالنصب . الباقون \" يحشر \" بياء مضمومة \" أعداء \" بالرفع ومعناهما بين . وأعداء الله : الذين كذبوا رسله وخالفوا أمره . فهم يوزعون يساقون ويدفعون إلى جهنم . قال قتادة والسدي : يحبس أولهم على آخرهم حتى يجتمعوا ، قال أبو الأحوص : فإذا تكاملت العدة بدئ بالأكابر فالأكابر جرما . وقد مضى في \" النمل \" الكلام في يوزعون مستوفى .\n                                    ",
      "saadi": "وَيَوۡمَ يُحۡشَرُ أَعۡدَآءُ ٱللَّهِ إِلَى ٱلنَّارِ فَهُمۡ يُوزَعُونَ ٩١\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن أعدائه، الذين بارزوه بالكفر به وبآياته، وتكذيب رسله ومعاداتهم ومحاربتهم، وحالهم الشنيعة حين يحشرون، أي: يجمعون. { إِلَى النَّارِ فَهُمْ يُوزَعُونَ } [أي]: يرد أولهم على آخرهم، ويتبع آخرهم أولهم، ويساقون إليها سوقا عنيفًا، لا يستطيعون امتناعًا، ولا ينصرون أنفسهم، ولا هم ينصرون.\n                                    "
    }
  },
  {
    "id": 19,
    "versesNumber": 20,
    "souraName": "Fussilat.html",
    "contnent": "حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيۡهِمۡ سَمۡعُهُمۡ وَأَبۡصَٰرُهُمۡ وَجُلُودُهُم بِمَا كَانُواْ يَعۡمَلُونَ ٠٢",
    "tafsier": {
      "ibnkther": "حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيۡهِمۡ سَمۡعُهُمۡ وَأَبۡصَٰرُهُمۡ وَجُلُودُهُم بِمَا كَانُواْ يَعۡمَلُونَ ٠٢\n                                    \n                                    \n                                    وقوله : ( حتى إذا ما جاءوها ) أي : وقفوا عليها ، ( شهد عليهم سمعهم وأبصارهم وجلودهم بما كانوا يعملون ) أي : بأعمالهم مما قدموه وأخروه ، لا يكتم منه حرف .\n                                    ",
      "qortoby": "حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيۡهِمۡ سَمۡعُهُمۡ وَأَبۡصَٰرُهُمۡ وَجُلُودُهُم بِمَا كَانُواْ يَعۡمَلُونَ ٠٢\n                                    \n                                    \n                                    قوله تعالى : حتى إذا ما جاءوها ما زائدة حتى إذا ما جاءوها شهد عليهم سمعهم وأبصارهم وجلودهم بما كانوا يعملون الجلود يعني بها الجلود أعيانها في قول أكثر المفسرين . وقال السدي وعبيد الله بن أبي جعفر والفراء : أراد بالجلود الفروج ، وأنشد بعض الأدباء لعامر بن جؤية :\nالمرء يسعى للسلا مة والسلامة حسبه أوسالم من قد تثنى\nجلده وابيض رأسه\nوقال : جلده كناية عن فرجه .\n                                    ",
      "saadi": "حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيۡهِمۡ سَمۡعُهُمۡ وَأَبۡصَٰرُهُمۡ وَجُلُودُهُم بِمَا كَانُواْ يَعۡمَلُونَ ٠٢\n                                        \n                                        \n                                        \n                                        { حَتَّى إِذَا مَا جَاءُوهَا } أي: حتى إذا وردوا على النار، وأرادوا الإنكار، أو أنكروا ما عملوه من المعاصي، { شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ وَجُلُودُهُمْ } عموم بعد خصوص. [ { بِمَا كَانُوا يَعْمَلُونَ } ] أي: شهد عليهم كل عضو من أعضائهم، فكل عضو يقول: أنا فعلت كذا وكذا، يوم كذا وكذا. وخص هذه الأعضاء الثلاثة، لأن أكثر الذنوب، إنما تقع بها، أو بسببها.\n                                    "
    }
  },
  {
    "id": 20,
    "versesNumber": 21,
    "souraName": "Fussilat.html",
    "contnent": "وَقَالُواْ لِجُلُودِهِمۡ لِمَ شَهِدتُّمۡ عَلَيۡنَاۖ قَالُوٓاْ أَنطَقَنَا ٱللَّهُ ٱلَّذِيٓ أَنطَقَ كُلَّ شَيۡءٖۚ وَهُوَ خَلَقَكُمۡ أَوَّلَ مَرَّةٖ وَإِلَيۡهِ تُرۡجَعُونَ ١٢",
    "tafsier": {
      "ibnkther": "وَقَالُواْ لِجُلُودِهِمۡ لِمَ شَهِدتُّمۡ عَلَيۡنَاۖ قَالُوٓاْ أَنطَقَنَا ٱللَّهُ ٱلَّذِيٓ أَنطَقَ كُلَّ شَيۡءٖۚ وَهُوَ خَلَقَكُمۡ أَوَّلَ مَرَّةٖ وَإِلَيۡهِ تُرۡجَعُونَ ١٢\n                                    \n                                    \n                                    ( وقالوا لجلودهم لم شهدتم علينا ) أي : لاموا أعضاءهم وجلودهم حين شهدوا عليهم ، فعند ذلك أجابتهم الأعضاء : ( قالوا أنطقنا الله الذي أنطق كل شيء وهو خلقكم أول مرة ) أي : فهو لا يخالف ولا يمانع ، وإليه ترجعون .\nقال الحافظ أبو بكر البزار : حدثنا محمد بن عبد الرحيم ، حدثنا علي بن قادم ، حدثنا شريك ، عن عبيد المكتب ، عن الشعبي ، عن أنس بن مالك - رضي الله عنه - قال : ضحك رسول الله - صلى الله عليه وسلم - ذات يوم وتبسم ، فقال : \" ألا تسألوني عن أي شيء ضحكت ؟ \" قالوا : يا رسول الله من أي شيء ضحكت ؟ قال : \" عجبت من مجادلة العبد ربه يوم القيامة ، يقول : أي ربي ، أليس وعدتني ألا تظلمني ؟ قال : بلى فيقول : فإني لا أقبل علي شاهدا إلا من نفسي . فيقول الله تبارك وتعالى : أو ليس كفى بي شهيدا ، وبالملائكة الكرام الكاتبين ؟ ! قال : فيردد هذا الكلام مرارا \" . قال : \" فيختم على فيه ، وتتكلم أركانه بما كان يعمل ، فيقول : بعدا لكن وسحقا ، عنكن كنت أجادل \" .\nثم رواه هو وابن أبي حاتم ، من حديث أبي عامر الأسدي ، عن الثوري ، عن عبيد المكتب ، عن فضيل بن عمرو ، عن الشعبي ثم قال : \" لا نعلم رواه عن أنس غير الشعبي \" . وقد أخرجه مسلم والنسائي جميعا عن أبي بكر بن أبي النضر ، عن أبي النضر ، عن عبيد الله بن عبد الرحمن الأشجعي ، عن الثوري به . ثم قال النسائي : \" لا أعلم أحدا رواه عن الثوري غير الأشجعي \" . وليس كما قال كما رأيت ، والله أعلم .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا أحمد بن إبراهيم ، حدثنا إسماعيل ابن علية ، عن يونس بن عبيد ، عن حميد بن هلال قال : قال أبو بردة : قال أبو موسى : ويدعى الكافر والمنافق للحساب ، فيعرض عليه ربه - عز وجل - عمله ، فيجحد ويقول : أي رب ، وعزتك لقد كتب علي هذا الملك ما لم أعمل ! فيقول له الملك : أما عملت كذا ، في يوم كذا ، في مكان كذا ؟ فيقول : لا وعزتك ، أي رب ما عملته . [ قال ] فإذا فعل ذلك ختم على فيه - قال الأشعري : فإني لأحسب أول ما ينطق منه فخذه اليمنى .\nوقال الحافظ أبو يعلى : حدثنا زهير حدثنا حسن ، عن ابن لهيعة : قال دراج عن أبي الهيثم عن أبى سعيد الخدري ، عن النبي - صلى الله عليه وسلم - قال : \" إذا كان يوم القيامة عرف الكافر بعمله ، فجحد وخاصم ، فيقال : هؤلاء جيرانك ، يشهدون عليك ؟ فيقول : كذبوا . فيقول : أهلك [ و ] عشيرتك ؟ فيقول : كذبوا . فيقول : احلفوا فيحلفون ، ثم يصمتهم الله وتشهد عليهم ألسنتهم ، ويدخلهم النار \" .\nوقال ابن أبي حاتم : وحدثنا أبي ، حدثنا أحمد بن إبراهيم ، حدثنا عبد الصمد بن عبد الوارث : سمعت أبي : حدثنا علي بن زيد ، عن مسلم بن صبيح أبي الضحى ، عن ابن عباس : أنه قال لابن الأزرق : إن يوم القيامة يأتي على الناس منه حين لا ينطقون ولا يعتذرون ولا يتكلمون حتى يؤذن لهم ، ثم يؤذن لهم فيختصمون ، فيجحد الجاحد بشركه بالله ، فيحلفون له كما يحلفون لكم ، فيبعث الله عليهم حين يجحدون شهداء من أنفسهم ، جلودهم وأبصارهم وأيديهم وأرجلهم ، ويختم على أفواههم ، ثم يفتح لهم الأفواه فتخاصم الجوارح ، فتقول : ( أنطقنا الله الذي أنطق كل شيء وهو خلقكم أول مرة وإليه ترجعون ) فتقر الألسنة بعد الجحود .\nوقال ابن أبي حاتم : حدثنا عبدة بن سليمان ، حدثنا ابن المبارك ، حدثنا صفوان بن عمرو ، عن عبد الرحمن بن جبير الحضرمي ، عن رافع أبي الحسن - وصف رجلا جحد - قال : فيشير الله إلى لسانه ، فيربو في فمه حتى يملأه ، فلا يستطيع أن ينطق بكلمة ، ثم يقول لآرابه كلها : تكلمي واشهدي عليه . فيشهد عليه سمعه وبصره وجلده ، وفرجه ويداه ورجلاه : صنعنا ، عملنا ، فعلنا .\nوقد تقدم أحاديث كثيرة ، وآثار عند قوله تعالى في سورة يس : ( اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون ) [ يس : 65 ] ، بما أغنى عن إعادته هاهنا .\nوقال ابن أبي حاتم - رحمه الله - : حدثنا أبي ، حدثنا سويد بن سعيد ، حدثنا يحيى بن سليم الطائفي ، عن ابن خثيم ، عن أبي الزبير ، عن جابر بن عبد الله قال : لما رجعت إلى النبي - صلى الله عليه وسلم - مهاجرة البحر قال : \" ألا تحدثون بأعاجيب ما رأيتم بأرض الحبشة ؟ \" فقال فتية منهم : بلى يا رسول الله ، بينا نحن جلوس إذ مرت علينا عجوز من عجائز رهابينهم ، تحمل على رأسها قلة من ماء ، فمرت بفتى منهم فجعل إحدى يديه بين كتفيها ، ثم دفعها فخرت على ركبتيها ، فانكسرت قلتها . فلما ارتفعت التفتت إليه فقالت : سوف تعلم يا غدر ، إذا وضع الله الكرسي ، وجمع الأولين والآخرين ، وتكلمت الأيدي والأرجل بما كانوا يكسبون ، فسوف تعلم كيف أمري وأمرك عنده غدا ؟ قال : يقول رسول الله - صلى الله عليه وسلم - : \" صدقت [ و ] صدقت ، كيف يقدس الله قوما لا يؤخذ لضعيفهم من شديدهم ؟ \" .\nهذا حديث غريب من هذا الوجه . ورواه ابن أبي الدنيا في كتاب الأهوال : أخبرنا إسحاق بن إبراهيم قال : أخبرنا يحيى بن سليم ، به\n                                    ",
      "qortoby": "وَقَالُواْ لِجُلُودِهِمۡ لِمَ شَهِدتُّمۡ عَلَيۡنَاۖ قَالُوٓاْ أَنطَقَنَا ٱللَّهُ ٱلَّذِيٓ أَنطَقَ كُلَّ شَيۡءٖۚ وَهُوَ خَلَقَكُمۡ أَوَّلَ مَرَّةٖ وَإِلَيۡهِ تُرۡجَعُونَ ١٢\n                                    \n                                    \n                                    وقالوا يعني الكفار لجلودهم لم شهدتم علينا وإنما كنا نجادل عنكم \" قالوا أنطقنا الله الذي أنطق كل شيء \" لما خاطبت وخوطبت أجريت مجرى من يعقل . وهو خلقكم أول مرة أي ركب الحياة فيكم بعد أن كنتم نطفا ، فمن قدر عليه قدر على أن ينطق الجلود وغيرها من الأعضاء . وقيل : وهو خلقكم أول مرة ابتداء كلام من الله . وإليه ترجعون . وفي صحيح مسلم عن أنس بن مالك قال : كنا عند رسول الله فضحك فقال : هل تدرون مم أضحك ؟ قلنا : الله ورسوله أعلم ، قال : من مخاطبة العبد ربه ، يقول : يا رب ألم تجرني من الظلم ؟ قال : يقول بلى ؟ قال : فيقول : فإني لا أجيز على نفسي إلا شاهدا مني . قال : يقول : كفى بنفسك اليوم عليك شهيدا ، وبالكرام الكاتبين شهودا . قال فيختم على فيه فيقال لأركانه : انطقي ، فتنطق بأعماله . قال : ثم يخلي بينه وبين الكلام . قال : فيقول : بعدا لكن وسحقا ، فعنكن كنت أناضل وفي حديث أبي هريرة ثم يقال : الآن نبعث شاهدنا عليك . ويتفكر في نفسه من ذا الذي يشهد علي ، فيختم على فيه ويقال لفخذه ولحمه وعظامه : انطقي ، فتنطق فخذه ولحمه وعظامه بعمله ، وذلك ليعذر من نفسه ، وذلك المنافق ، وذلك الذي سخط الله عليه خرجه أيضا مسلم .\n                                    ",
      "saadi": "وَقَالُواْ لِجُلُودِهِمۡ لِمَ شَهِدتُّمۡ عَلَيۡنَاۖ قَالُوٓاْ أَنطَقَنَا ٱللَّهُ ٱلَّذِيٓ أَنطَقَ كُلَّ شَيۡءٖۚ وَهُوَ خَلَقَكُمۡ أَوَّلَ مَرَّةٖ وَإِلَيۡهِ تُرۡجَعُونَ ١٢\n                                        \n                                        \n                                        \n                                        فإذا شهدت عليهم عاتبوها، { وَقَالُوا لِجُلُودِهِمْ } هذا دليل عل أن الشهادة تقع من كل عضو كما ذكرنا: { لِمَ شَهِدْتُمْ عَلَيْنَا } ونحن ندافع عنكن؟ { قَالُوا أَنْطَقَنَا اللَّهُ الَّذِي أَنْطَقَ كُلَّ شَيْءٍ } فليس في إمكاننا، الامتناع عن الشهادة حين أنطقنا الذي لا يستعصي عن مشيئته أحد.\n{ وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍ } فكما خلقكم بذواتكم، وأجسامكم، خلق أيضا صفاتكم، ومن ذلك، الإنطاق. { وَإِلَيْهِ تُرْجَعُونَ } في الآخرة، فيجزيكم بما عملتم، ويحتمل أن المراد بذلك، الاستدلال على البعث بالخلق الأول، كما هو طريقة القرآن.\n                                    "
    }
  },
  {
    "id": 21,
    "versesNumber": 22,
    "souraName": "Fussilat.html",
    "contnent": "وَمَا كُنتُمۡ تَسۡتَتِرُونَ أَن يَشۡهَدَ عَلَيۡكُمۡ سَمۡعُكُمۡ وَلَآ أَبۡصَٰرُكُمۡ وَلَا جُلُودُكُمۡ وَلَٰكِن ظَنَنتُمۡ أَنَّ ٱللَّهَ لَا يَعۡلَمُ كَثِيرٗا مِّمَّا تَعۡمَلُونَ ٢٢",
    "tafsier": {
      "ibnkther": "وَمَا كُنتُمۡ تَسۡتَتِرُونَ أَن يَشۡهَدَ عَلَيۡكُمۡ سَمۡعُكُمۡ وَلَآ أَبۡصَٰرُكُمۡ وَلَا جُلُودُكُمۡ وَلَٰكِن ظَنَنتُمۡ أَنَّ ٱللَّهَ لَا يَعۡلَمُ كَثِيرٗا مِّمَّا تَعۡمَلُونَ ٢٢\n                                    \n                                    \n                                    وقوله : ( وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم ) أي : تقول لهم الأعضاء والجلود حين يلومونها على الشهادة عليهم : ما كنتم تتكتمون منا الذي كنتم تفعلونه بل كنتم تجاهرون الله بالكفر والمعاصي ، ولا تبالون منه في زعمكم ; لأنكم كنتم لا تعتقدون أنه يعلم جميع أفعالكم ; ولهذا قال : ( ولكن ظننتم أن الله لا يعلم كثيرا مما تعملون وذلكم ظنكم الذي ظننتم بربكم أرداكم ) أي : هذا الظن الفاسد - وهو اعتقادكم أن الله لا يعلم كثيرا مما تعملون - هو الذي أتلفكم وأرداكم عند ربكم ، ( فأصبحتم من الخاسرين ) أي : في مواقف القيامة خسرتم أنفسكم وأهليكم .\nقال الإمام أحمد - رحمه الله - : حدثنا أبو معاوية ، حدثنا الأعمش ، عن عمارة ، عن عبد الرحمن بن يزيد ، عن عبد الله قال : كنت مستترا بأستار الكعبة فجاء ثلاثة نفر : قرشي ، وختناه ثقفيان - أو ثقفي وختناه قرشيان - كثير شحم بطونهم قليل فقه قلوبهم ، فتكلموا بكلام لم أسمعه ، فقال أحدهم : أترون أن الله يسمع كلامنا هذا ؟ فقال الآخر : إنا إذا رفعنا أصواتنا سمعه ، وإذا لم نرفعه لم يسمعه ، فقال الآخر : إن سمع منه شيئا سمعه كله . قال : فذكرت ذلك للنبي - صلى الله عليه وسلم - فأنزل الله عز وجل : ( وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم ) إلى قوله : ( من الخاسرين )\nوكذا رواه الترمذي عن هناد ، عن أبي معاوية ، بإسناده نحوه . وأخرجه أحمد ومسلم والترمذي أيضا ، من حديث سفيان الثوري ، عن الأعمش ، عن عمارة بن عمير ، عن وهب بن ربيعة ، عن عبد الله بن مسعود - رضي الله عنه - بنحوه . ورواه البخاري ومسلم أيضا ، من حديث السفيانين ، عن منصور ، عن مجاهد ، عن أبي معمر عبد الله بن سخبرة ، عن ابن مسعود به .\nوقال عبد الرزاق : أخبرنا معمر ، عن بهز بن حكيم ، عن أبيه ، عن جده ، عن النبي - صلى الله عليه وسلم - في قوله : ( أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم ) قال : \" إنكم تدعون مفدما على أفواهكم بالفدام ، فأول شيء يبين عن أحدكم فخذه وكفه \" .\n                                    ",
      "qortoby": "وَمَا كُنتُمۡ تَسۡتَتِرُونَ أَن يَشۡهَدَ عَلَيۡكُمۡ سَمۡعُكُمۡ وَلَآ أَبۡصَٰرُكُمۡ وَلَا جُلُودُكُمۡ وَلَٰكِن ظَنَنتُمۡ أَنَّ ٱللَّهَ لَا يَعۡلَمُ كَثِيرٗا مِّمَّا تَعۡمَلُونَ ٢٢\n                                    \n                                    \n                                    قوله تعالى : وما كنتم تستترون أن يشهد عليكم سمعكم يجوز أن يكون هذا من قول الجوارح لهم : ويجوز أن يكون من قول الله - عز وجل - أو الملائكة . وفي صحيح مسلم عن ابن مسعود قال : اجتمع عند البيت ثلاثة نفر ، قرشيان وثقفي أو ثقفيان وقرشي ، قليل فقه قلوبهم ، كثير شحم بطونهم : فقال أحدهم : أترون الله يسمع ما نقول ؟ فقال الآخر : يسمع إن جهرنا ولا يسمع إن أخفينا ، وقال الآخر : إن كان يسمع إذا جهرنا فهو يسمع إذا أخفينا ، فأنزل الله - عز وجل - : وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم الآية ، خرجه الترمذي فقال : اختصم عند البيت ثلاثة نفر . ثم ذكره بلفظه حرفا حرفا وقال : حديث حسن صحيح ، حدثنا هناد قال حدثنا أبو معاوية عن الأعمش عن عمارة بن عمير عن عبد الرحمن بن يزيد قال : قال عبد الله : كنت مستترا بأستار الكعبة فجاء ثلاثة نفر كثير شحم بطونهم قليل فقه قلوبهم ، قرشي وختناه ثقفيان ، أو ثقفي وختناه قرشيان ، فتكلموا بكلام لم أفهمه ، فقال أحدهم : أترون أن الله يسمع كلامنا هذا ، فقال الآخر : إنا إذا رفعنا أصواتنا سمعه ، وإذا لم نرفع أصواتنا لم يسمعه ، فقال الآخر : إن سمع منه شيئا سمعه كله . فقال عبد الله : فذكرت ذلك للنبي - صلى الله عليه وسلم - فأنزل الله تعالى : وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم إلى قوله : فأصبحتم من الخاسرين قال : هذا حديث حسن صحيح . قال الثعلبي : والثقفي عبد ياليل ، وختناه ربيعة وصفوان بن أمية . ومعنى تستترون تستخفون في قول أكثر العلماء ، أي : ما كنتم تستخفون من أنفسكم حذرا من شهادة الجوارح عليكم ; لأن الإنسان لا يمكنه أن يخفي من نفسه عمله ، فيكون الاستخفاء بمعنى ترك المعصية . وقيل : الاستتار بمعنى الاتقاء ، أي : ما كنتم تتقون في الدنيا أن تشهد عليكم جوارحكم في الآخرة فتتركوا المعاصي خوفا من هذه الشهادة . وقال معناه مجاهد . وقال قتادة : وما كنتم تستترون أي : تظنون أن يشهد عليكم سمعكم بأن يقول : سمعت الحق وما وعيت ، وسمعت ما لا يجوز من المعاصي ولا أبصاركم فتقول : رأيت آيات الله وما اعتبرت ، ونظرت فيما لا يجوز \" ولا جلودكم \" تقدم .\nولكن ظننتم أن الله لا يعلم كثيرا مما تعملون من أعمالكم فجادلتم على ذلك حتى شهدت عليكم جوارحكم بأعمالكم . روى بهز بن حكيم عن أبيه عن جده عن النبي - صلى الله عليه وسلم - في قوله : أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم قال : إنكم تدعون يوم القيامة مفدمة أفواهكم بفدام ، فأول ما يبين عن الإنسان فخذه وكفه قال عبد الله بن عبد الأعلى الشامي فأحسن :\nالعمر ينقص والذنوب تزيد وتقال عثرات الفتى فيعود هل يستطيع جحود ذنب واحد\nرجل جوارحه عليه شهود والمرء يسأل عن سنيه فيشتهي\nتقليلها وعن الممات يحيد\nوعن معقل بن يسار عن النبي - صلى الله عليه وسلم - قال : ليس من يوم يأتي على ابن آدم إلا ينادى فيه : يا ابن آدم ، أنا خلق جديد ، وأنا فيما تعمل غدا عليك شهيد ، فاعمل في خيرا أشهد لك به غدا ، فإني لو قد مضيت لم ترني أبدا . ويقول الليل مثل ذلك ذكره أبو نعيم الحافظ وقد ذكرناه في كتاب \" التذكرة \" في باب شهادة الأرض والليالي والأيام والمال . وقال محمد بن بشير فأحسن :\nمضى أمسك الأدنى شهيدا معدلا ويومك هذا بالفعال شهيد\nفإن تك بالأمس اقترفت إساءة فثن بإحسان وأنت حميد\nولا ترج فعل الخير منك إلى غد لعل غدا يأتي وأنت فقيد\n                                    ",
      "saadi": "وَمَا كُنتُمۡ تَسۡتَتِرُونَ أَن يَشۡهَدَ عَلَيۡكُمۡ سَمۡعُكُمۡ وَلَآ أَبۡصَٰرُكُمۡ وَلَا جُلُودُكُمۡ وَلَٰكِن ظَنَنتُمۡ أَنَّ ٱللَّهَ لَا يَعۡلَمُ كَثِيرٗا مِّمَّا تَعۡمَلُونَ ٢٢\n                                        \n                                        \n                                        \n                                        { وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ } أي: وما كنتم تختفون عن شهادة أعضائكم عليكم، ولا تحاذرون من ذلك. { وَلَكِنْ ظَنَنْتُمْ } بإقدامكم على المعاصي { أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ } فلذلك صدر منكم ما صدر، وهذا الظن، صار سبب هلاكهم وشقائهم .\n                                    "
    }
  },
  {
    "id": 22,
    "versesNumber": 23,
    "souraName": "Fussilat.html",
    "contnent": "وَذَٰلِكُمۡ ظَنُّكُمُ ٱلَّذِي ظَنَنتُم بِرَبِّكُمۡ أَرۡدَىٰكُمۡ فَأَصۡبَحۡتُم مِّنَ ٱلۡخَٰسِرِينَ ٣٢",
    "tafsier": {
      "ibnkther": "وَذَٰلِكُمۡ ظَنُّكُمُ ٱلَّذِي ظَنَنتُم بِرَبِّكُمۡ أَرۡدَىٰكُمۡ فَأَصۡبَحۡتُم مِّنَ ٱلۡخَٰسِرِينَ ٣٢s\n                                    \n                                    \n                                    قال معمر : وتلا الحسن : ( وذلكم ظنكم الذي ظننتم بربكم أرداكم ) ثم قال : قال رسول الله - صلى الله عليه وسلم - : \" قال الله أنا مع عبدي عند ظنه بي ، وأنا معه إذا دعاني \" ثم افتر الحسن ينظر في هذا فقال : ألا إنما عمل الناس على قدر ظنونهم بربهم ، فأما المؤمن فأحسن الظن بربه فأحسن العمل ، وأما الكافر والمنافق فأساءا الظن بالله فأساءا العمل . ثم قال : قال الله تعالى : ( وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ) إلى قوله : ( وذلكم ظنكم الذي ظننتم بربكم أرداكم فأصبحتم من الخاسرين )\nوقال الإمام أحمد : حدثنا النضر بن إسماعيل القاص - وهو أبو المغيرة - حدثنا ابن أبي ليلى ، عن أبي الزبير ، عن جابر قال : قال رسول الله - صلى الله عليه وسلم - : \" لا يموتن أحد منكم إلا وهو يحسن بالله الظن ، فإن قوما قد أرداهم سوء ظنهم بالله ، فقال الله تعالى : ( وذلكم ظنكم الذي ظننتم بربكم أرداكم فأصبحتم من الخاسرين ) .\n                                    ",
      "qortoby": "وَذَٰلِكُمۡ ظَنُّكُمُ ٱلَّذِي ظَنَنتُم بِرَبِّكُمۡ أَرۡدَىٰكُمۡ فَأَصۡبَحۡتُم مِّنَ ٱلۡخَٰسِرِينَ ٣٢s\n                                    \n                                    \n                                    قوله تعالى : وذلكم ظنكم الذي ظننتم بربكم أرداكم أي أهلككم فأوردكم النار . قال قتادة : الظن هنا بمعنى العلم . وقال النبي - صلى الله عليه وسلم - : لا يموتن أحدكم إلا وهو يحسن الظن بالله ، فإن قوما أساءوا الظن بربهم فأهلكهم ، فذلك قوله : وذلكم ظنكم الذي ظننتم بربكم أرداكم . وقال الحسن البصري : إن قوما ألهتهم الأماني حتى خرجوا من الدنيا وما لهم حسنة ، ويقول أحدهم : إني أحسن الظن بربي . وكذب ، ولو أحسن الظن لأحسن العمل ، وتلا قول الله تعالى : وذلكم ظنكم الذي ظننتم بربكم أرداكم فأصبحتم من الخاسرين . وقال قتادة : من استطاع منكم أن يموت وهو حسن الظن بربه فليفعل ، فإن الظن اثنان : ظن ينجي وظن يردي . وقال عمر بن الخطاب في هذه الآية : هؤلاء قوم كانوا يدمنون المعاصي ولا يتوبون منها ويتكلمون على المغفرة ، حتى خرجوا من الدنيا مفاليس ، ثم قرأ : وذلكم ظنكم الذي ظننتم بربكم أرداكم فأصبحتم من الخاسرين .\n                                    ",
      "saadi": "وَذَٰلِكُمۡ ظَنُّكُمُ ٱلَّذِي ظَنَنتُم بِرَبِّكُمۡ أَرۡدَىٰكُمۡ فَأَصۡبَحۡتُم مِّنَ ٱلۡخَٰسِرِينَ ٣٢s\n                                        \n                                        \n                                        \n                                        { وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ } الظن السيئ، حيث ظننتم به، ما لا يليق بجلاله. { أَرْدَاكُمْ } أي: أهلككم { فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ } لأنفسهم وأهليهم وأديانهم بسبب الأعمال التي أوجبها لكم ظنكم القبيح بربكم، فحقت عليكم كلمة العقاب والشقاء، ووجب عليكم الخلود الدائم، في العذاب، الذي لا يفتر عنهم ساعة:\n                                    "
    }
  },
  {
    "id": 23,
    "versesNumber": 24,
    "souraName": "Fussilat.html",
    "contnent": "فَإِن يَصۡبِرُواْ فَٱلنَّارُ مَثۡوٗى لَّهُمۡۖ وَإِن يَسۡتَعۡتِبُواْ فَمَا هُم مِّنَ ٱلۡمُعۡتَبِينَ ٤٢",
    "tafsier": {
      "ibnkther": "فَإِن يَصۡبِرُواْ فَٱلنَّارُ مَثۡوٗى لَّهُمۡۖ وَإِن يَسۡتَعۡتِبُواْ فَمَا هُم مِّنَ ٱلۡمُعۡتَبِينَ ٤٢\n                                    \n                                    \n                                    وقوله : ( فإن يصبروا فالنار مثوى لهم وإن يستعتبوا فما هم من المعتبين ) أي : سواء عليهم أصبروا أم لم يصبروا هم في النار ، لا محيد لهم عنها ، ولا خروج لهم منها . وإن طلبوا أن يستعتبوا ويبدوا أعذارا فما لهم أعذار ، ولا تقال لهم عثرات .\nقال ابن جرير : ومعنى قوله : ( وإن يستعتبوا ) أي : يسألوا الرجعة إلى الدنيا ، فلا جواب لهم - قال : وهذا كقوله تعالى إخبارا عنهم : ( قالوا ربنا غلبت علينا شقوتنا وكنا قوما ضالين ربنا أخرجنا منها فإن عدنا فإنا ظالمون قال اخسئوا فيها ولا تكلمون ) [ المؤمنون : 106 - 108 ] .\n                                    ",
      "qortoby": "فَإِن يَصۡبِرُواْ فَٱلنَّارُ مَثۡوٗى لَّهُمۡۖ وَإِن يَسۡتَعۡتِبُواْ فَمَا هُم مِّنَ ٱلۡمُعۡتَبِينَ ٤٢\n                                    \n                                    \n                                    قوله تعالى : فإن يصبروا فالنار مثوى لهم أي فإن يصبروا في الدنيا على أعمال أهل النار فالنار مثوى لهم . نظيره : فما أصبرهم على النار على ما تقدم . وإن يستعتبوا في الدنيا وهم مقيمون على كفرهم فما هم من المعتبين . وقيل : المعنى فإن يصبروا في النار أو يجزعوا فالنار مثوى لهم أي : لا محيص لهم عنها ، ودل على الجزع قوله : وإن يستعتبوا لأن المستعتب جزع ، والمعتب المقبول عتابه ، قال النابغة :\nفإن أك مظلوما فعبد ظلمته وإن تك ذا عتبى فمثلك يعتب\nأي : مثلك من قبل الصلح والمراجعة إذا سئل . قال الخليل : العتاب مخاطبة الإدلال ومذاكرة الموجدة . تقول : عاتبته معاتبة ، وبينهم أعتوبة يتعاتبون بها . يقال : إذا تعاتبوا أصلح ما بينهم العتاب . وأعتبني فلان : إذا عاد إلى مسرتي راجعا عن الإساءة ، والاسم منه العتبى ، وهو رجوع المعتوب عليه إلى ما يرضي العاتب . واستعتب وأعتب بمعنى ، واستعتب أيضا طلب أن يعتب ، تقول : استعتبته فأعتبني أي : استرضيته فأرضاني . فمعنى وإن يستعتبوا أي : طلبوا الرضا لم ينفعهم ذلك بل لا بد لهم من النار . وفي التفاسير : وإن يستقيلوا ربهم فما هم من المقالين . وقرأ عبيد بن عمير وأبو العالية \" وإن يستعتبوا \" بفتح التاء الثانية وضم الياء على الفعل المجهول فما هم من المعتبين بكسر التاء أي : إن أقالهم الله وردهم إلى الدنيا لم يعملوا بطاعته لما سبق لهم في علم الله من الشقاء ، قال الله تعالى : ولو ردوا لعادوا لما نهوا عنه ذكره الهروي . وقال ثعلب : يقال أعتب إذا غضب وأعتب إذا رضي .\n                                    ",
      "saadi": "فَإِن يَصۡبِرُواْ فَٱلنَّارُ مَثۡوٗى لَّهُمۡۖ وَإِن يَسۡتَعۡتِبُواْ فَمَا هُم مِّنَ ٱلۡمُعۡتَبِينَ ٤٢\n                                        \n                                        \n                                        \n                                        { فَإِنْ يَصْبِرُوا فَالنَّارُ مَثْوًى لَهُمْ } فلا جَلَدَ عليها، ولا صبر، وكل حالة قُدِّر إمكان الصبر عليها، فالنار لا يمكن الصبر عليها، وكيف الصبر على نار، قد اشتد حرها، وزادت على نار الدنيا، بسبعين ضعفًا، وعظم غليان حميمها، وزاد نتن صديدها، وتضاعف برد زمهريرها وعظمت سلاسلها وأغلالها، وكبرت مقامعها، وغلظ خُزَّانها، وزال ما في قلوبهم من رحمتهم، وختام ذلك سخط الجبار، وقوله لهم حين يدعونه ويستغيثون: { اخْسَئُوا فِيهَا وَلَا تُكَلِّمُونِ }\n{ وَإِنْ يَسْتَعْتِبُوا } أي: يطلبوا أن يزال عنهم العتب، ويرجعوا إلى الدنيا، ليستأنفوا العمل. { فَمَا هُمْ مِنَ الْمُعْتَبِينَ } لأنه ذهب وقته، وعمروا، ما يعمر فيه من تذكر وجاءهم النذير وانقطعت حجتهم، مع أن استعتابهم، كذب منهم { وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ وَإِنَّهُمْ لَكَاذِبُونَ }\n                                    "
    }
  },
  {
    "id": 24,
    "versesNumber": 25,
    "souraName": "Fussilat.html",
    "contnent": "۞ وَقَيَّضۡنَا لَهُمۡ قُرَنَآءَ فَزَيَّنُواْ لَهُم مَّا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡ وَحَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ ٥٢",
    "tafsier": {
      "ibnkther": "۞ وَقَيَّضۡنَا لَهُمۡ قُرَنَآءَ فَزَيَّنُواْ لَهُم مَّا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡ وَحَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ ٥٢\n                                    \n                                    \n                                    يذكر تعالى أنه هو الذي أضل المشركين ، وأن ذلك بمشيئته وكونه وقدرته ، وهو الحكيم في أفعاله ، بما قيض لهم من القرناء من شياطين الإنس والجن : ( فزينوا لهم ما بين أيديهم وما خلفهم ) أي : حسنوا لهم أعمالهم في الماضي ، وبالنسبة إلى المستقبل فلم يروا أنفسهم إلا محسنين ، كما قال تعالى : ( ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين وإنهم ليصدونهم عن السبيل ويحسبون أنهم مهتدون ) [ الزخرف : 36 ، 37 ] .\nوقوله تعالى : ( وحق عليهم القول ) أي : كلمة العذاب كما حق على أمم قد خلت من قبلهم ، ممن فعل كفعلهم ، من الجن والإنس ، ( إنهم كانوا خاسرين ) أي : استووا هم وإياهم في الخسار والدمار .\n                                    ",
      "qortoby": "۞ وَقَيَّضۡنَا لَهُمۡ قُرَنَآءَ فَزَيَّنُواْ لَهُم مَّا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡ وَحَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ ٥٢\n                                    \n                                    \n                                    قوله تعالى : وقيضنا لهم قرناء قال النقاش : أي : هيأنا لهم شياطين . وقيل : سلطنا عليهم قرناء يزينون عندهم المعاصي ، وهؤلاء القرناء من الجن والشياطين ومن الإنس أيضا ، أي : سببنا لهم قرناء ، يقال : قيض الله فلانا لفلان أي : جاءه به وأتاحه له ، ومنه قوله تعالى : وقيضنا لهم قرناء . القشيري : ويقال : قيض الله لي رزقا أي : أتاحه كما كنت أطلبه ، والتقييض الإبدال ، ومنه المقايضة ، قايضت الرجل مقايضة أي : عاوضته بمتاع ، وهما قيضان كما تقول : بيعان .\nفزينوا لهم ما بين أيديهم من أمر الدنيا فحسنوه لهم حتى آثروه على الآخرة \" وما خلفهم \" حسنوا لهم ما بعد مماتهم ودعوهم إلى التكذيب بأمور الآخرة ، عن مجاهد . وقيل : المعنى قيضنا لهم قرناء في النار فزينوا لهم أعمالهم في الدنيا ، والمعنى : قدرنا عليهم أن ذلك سيكون وحكمنا به عليهم . وقيل : المعنى : أحوجناهم إلى الأقران ، أي : أحوجنا الفقير إلى الغني لينال منه ، والغني إلى الفقير ليستعين به ، فزين بعضهم لبعض المعاصي . وليس قوله : \" وما خلفهم \" عطفا على \" ما بين أيديهم \" بل المعنى : وأنسوهم ما خلفهم ، ففيه هذا الإضمار . قال ابن عباس : ما بين أيديهم تكذيبهم بأمور الآخرة وما خلفهم التسويف والترغيب في الدنيا . الزجاج : ما بين أيديهم ما عملوه وما خلفهم ما عزموا على أن يعملوه . وقد تقدم قول مجاهد . وقيل : المعنى لهم مثل ما تقدم من المعاصي وما خلفهم ما يعمل بعدهم .\nوحق عليهم القول في أمم أي وجب عليهم من العذاب ما وجب على الأمم الذين من قبلهم الذين كفروا ككفرهم . وقيل : في بمعنى مع ، فالمعنى هم داخلون مع الأمم الكافرة قبلهم فيما دخلوا فيه . وقيل : في أمم في جملة أمم ، ومثله قول الشاعر [ عمرو بن أبنة ] :\nإن تك عن أحسن الصنيعة مأ فوكا ففي آخرين قد أفكوا\nيريد : فأنت في جملة آخرين لست في ذلك بأوحد . ومحل في أمم النصب على الحال من الضمير في عليهم أي : حق عليهم القول كائنين في جملة أمم . إنهم كانوا خاسرين أعمالهم في الدنيا وأنفسهم وأهليهم يوم القيامة .\n                                    ",
      "saadi": "۞ وَقَيَّضۡنَا لَهُمۡ قُرَنَآءَ فَزَيَّنُواْ لَهُم مَّا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡ وَحَقَّ عَلَيۡهِمُ ٱلۡقَوۡلُ فِيٓ أُمَمٖ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُواْ خَٰسِرِينَ ٥٢\n                                        \n                                        \n                                        \n                                        أي: وقضينا لهؤلاء الظالمين الجاحدين للحق { قُرَنَاءَ } من الشياطين، كما قال تعالى: { أَلَمْ تَرَ أَنَّا أَرْسَلْنَا الشَّيَاطِينَ عَلَى الْكَافِرِينَ تَؤُزُّهُمْ أَزًّا } أي تزعجهم إلى المعاصي وتحثهم عليها، بسبب ما زينوا { لَهُمْ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ } فالدنيا زخرفوها بأعينهم، ودعوهم إلى لذاتها وشهواتها المحرمة حتى افتتنوا، فأقدموا على معاصي اللّه، وسلكوا ما شاءوا من محاربة اللّه ورسله والآخرة بَعّدُوها عليهم وأنسوهم ذكرها، وربما أوقعوا عليهم الشُّبه، بعدم وقوعها، فترحَّل خوفها من قلوبهم، فقادوهم إلى الكفر، والبدع، والمعاصي.\nوهذا التسليط والتقييض من اللّه للمكذبين الشياطين، بسبب إعراضهم عن ذكر اللّه وآياته، وجحودهم الحق كما قال تعالى: { وَمَنْ يَعْشُ عَنْ ذِكْرِ الرَّحْمَنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ وَإِنَّهُمْ لَيَصُدُّونَهُمْ عَنِ السَّبِيلِ وَيَحْسَبُونَ أَنَّهُمْ مُهْتَدُونَ }\n{ وَحَقَّ عَلَيْهِمُ الْقَوْلُ } أي: وجب عليهم، ونزل القضاء والقدر بعذابهم { فِي } جملة { أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ الْجِنِّ وَالْإِنْسِ إِنَّهُمْ كَانُوا خَاسِرِينَ } لأديانهم وآخرتهم، ومن خسر، فلا بد أن يذل ويشقى ويعذب.\n                                    "
    }
  },
  {
    "id": 25,
    "versesNumber": 26,
    "souraName": "Fussilat.html",
    "contnent": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لَا تَسۡمَعُواْ لِهَٰذَا ٱلۡقُرۡءَانِ وَٱلۡغَوۡاْ فِيهِ لَعَلَّكُمۡ تَغۡلِبُونَ ٦٢",
    "tafsier": {
      "ibnkther": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لَا تَسۡمَعُواْ لِهَٰذَا ٱلۡقُرۡءَانِ وَٱلۡغَوۡاْ فِيهِ لَعَلَّكُمۡ تَغۡلِبُونَ ٦٢\n                                    \n                                    \n                                    وقوله تعالى : ( وقال الذين كفروا لا تسمعوا لهذا القرآن والغوا فيه ) أي : تواصوا فيما بينهم ألا يطيعوا للقرآن ، ولا ينقادوا لأوامره ، ( والغوا فيه ) أي : إذا تلي لا تسمعوا له . كما قال مجاهد : ( والغوا فيه ) يعني : بالمكاء والصفير والتخليط في المنطق على رسول الله - صلى الله عليه وسلم - إذا قرأ القرآن ، قريش تفعله .\nوقال الضحاك ، عن ابن عباس : ( والغوا فيه ) عيبوه .\nوقال قتادة : اجحدوا به ، وأنكروه وعادوه .\n( لعلكم تغلبون ) هذا حال هؤلاء الجهلة من الكفار ، ومن سلك مسلكهم عند سماع القرآن . وقد أمر الله - سبحانه - عباده المؤمنين بخلاف ذلك فقال : ( وإذا قرئ القرآن فاستمعوا له وأنصتوا لعلكم ترحمون ) [ الأعراف : 204 ] .\n                                    ",
      "qortoby": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لَا تَسۡمَعُواْ لِهَٰذَا ٱلۡقُرۡءَانِ وَٱلۡغَوۡاْ فِيهِ لَعَلَّكُمۡ تَغۡلِبُونَ ٦٢\n                                    \n                                    \n                                    قوله تعالى : وقال الذين كفروا لا تسمعوا لهذا القرآن والغوا فيه لما أخبر تعالى عن كفر قوم هود وصالح وغيرهم أخبر عن مشركي قريش وأنهم كذبوا القرآن فقالوا : لا تسمعوا . وقيل : معنى لا تسمعوا لا تطيعوا ، يقال : سمعت لك أي : أطعتك . والغوا فيه قال ابن عباس : قال أبو جهل : إذا قرأ محمد فصيحوا في وجهه حتى لا يدري ما يقول . وقيل : إنهم فعلوا ذلك لما أعجزهم القرآن . وقال مجاهد : المعنى والغوا فيه بالمكاء والتصفيق والتخليط في المنطق حتى يصير لغوا . وقال الضحاك : أكثروا الكلام ليختلط عليه ما يقول . وقال أبو العالية وابن عباس أيضا : قعوا فيه وعيبوه . لعلكم تغلبون محمدا على قراءته فلا يظهر ولا يستميل القلوب . وقرأ عيسى بن عمر والجحدري وابن أبي إسحاق وأبو حيوة وبكر بن حبيب السهمي \" والغوا \" بضم الغين وهي لغة من لغا يلغو . وقراءة الجماعة من لغي يلغى . قال الهروي : وقوله : والغوا فيه قيل : عارضوه بكلام لا يفهم . يقال : لغوت ألغو وألغى ، ولغي يلغى ثلاث لغات . وقد مضى معنى اللغو في \" البقرة \" وهو ما لا يعلم له حقيقة ولا تحصيل .\n                                    ",
      "saadi": "وَقَالَ ٱلَّذِينَ كَفَرُواْ لَا تَسۡمَعُواْ لِهَٰذَا ٱلۡقُرۡءَانِ وَٱلۡغَوۡاْ فِيهِ لَعَلَّكُمۡ تَغۡلِبُونَ ٦٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن إعراض الكفار عن القرآن، وتواصيهم بذلك، فقال: { وَقَالَ الَّذِينَ كَفَرُوا لَا تَسْمَعُوا لِهَذَا الْقُرْآنِ } أي: أعرضوا عنه بأسماعكم، وإياكم أن تلتفتوا، أو تصغوا إليه ولا إلى من جاء به، فإن اتفق أنكم سمعتموه، أو سمعتم الدعوة إلى أحكامه، فـ { الْغَوْا فِيهِ } أي: تكلموا بالكلام الذي لا فائدة فيه، بل فيه المضرة، ولا تمكنوا -مع قدرتكم- أحدًا يملك عليكم الكلام به، وتلاوة ألفاظه ومعانيه، هذا لسان حالهم، ولسان مقالهم، في الإعراض عن هذا القرآن، { لَعَلَّكُمْ } إن فعلتم ذلك { تَغْلِبُونَ } ]وهذه[ شهادة من الأعداء، وأوضح الحق، ما شهدت به الأعداء، فإنهم لم يحكموا بغلبتهم لمن جاء بالحق إلا في حال الإعراض عنه والتواصي بذلك، ومفهوم كلامهم، أنهم إن لم يلغوا فيه، بل استمعوا إليه، وألقوا أذهانهم، أنهم لا يغلبون، فإن الحق، غالب غير مغلوب، يعرف هذا، أصحاب الحق وأعداؤه.\n                                    "
    }
  },
  {
    "id": 26,
    "versesNumber": 27,
    "souraName": "Fussilat.html",
    "contnent": "فَلَنُذِيقَنَّ ٱلَّذِينَ كَفَرُواْ عَذَابٗا شَدِيدٗا وَلَنَجۡزِيَنَّهُمۡ أَسۡوَأَ ٱلَّذِي كَانُواْ يَعۡمَلُونَ ٧٢",
    "tafsier": {
      "ibnkther": "فَلَنُذِيقَنَّ ٱلَّذِينَ كَفَرُواْ عَذَابٗا شَدِيدٗا وَلَنَجۡزِيَنَّهُمۡ أَسۡوَأَ ٱلَّذِي كَانُواْ يَعۡمَلُونَ ٧٢\n                                    \n                                    \n                                    ثم قال تعالى : منتصرا للقرآن ، ومنتقما ممن عاداه من أهل الكفران : ( فلنذيقن الذين كفروا عذابا شديدا ) أي : في مقابلة ما اعتمدوه في القرآن وعند سماعه ، ( ولنجزينهم أسوأ الذي كانوا يعملون ) أي : بشر أعمالهم وسيئ أفعالهم\n                                    ",
      "qortoby": "فَلَنُذِيقَنَّ ٱلَّذِينَ كَفَرُواْ عَذَابٗا شَدِيدٗا وَلَنَجۡزِيَنَّهُمۡ أَسۡوَأَ ٱلَّذِي كَانُواْ يَعۡمَلُونَ ٧٢\n                                    \n                                    \n                                    قوله تعالى : فلنذيقن الذين كفروا عذابا شديدا قد تقدم أن الذوق يكون محسوسا ، ومعنى العذاب الشديد : ما يتوالى فلا ينقطع . وقيل : هو العذاب في جميع أجزائهم . ولنجزينهم أسوأ الذي كانوا يعملون أي ولنجزينهم في الآخرة جزاء قبح أعمالهم التي عملوها في الدنيا . وأسوأ الأعمال الشرك .\n                                    ",
      "saadi": "فَلَنُذِيقَنَّ ٱلَّذِينَ كَفَرُواْ عَذَابٗا شَدِيدٗا وَلَنَجۡزِيَنَّهُمۡ أَسۡوَأَ ٱلَّذِي كَانُواْ يَعۡمَلُونَ ٧٢\n                                        \n                                        \n                                        \n                                        ولما كان هذا ظلمًا منهم وعنادًا، لم يبق فيهم مطمع للهداية، فلم يبق إلا عذابهم ونكالهم، ولهذا قال: { فَلَنُذِيقَنَّ الَّذِينَ كَفَرُوا عَذَابًا شَدِيدًا وَلَنَجْزِيَنَّهُمْ أَسْوَأَ الَّذِي كَانُوا يَعْمَلُونَ } وهو الكفر والمعاصي، فإنها أسوأ ما كانوا يعملون، لكونهم يعملون المعاصي وغيرها، فالجزاء بالعقوبة، إنما هو على عمل الشرك { وَلَا يَظْلِمُ رَبُّكَ أَحَدًا }\n                                    "
    }
  },
  {
    "id": 27,
    "versesNumber": 28,
    "souraName": "Fussilat.html",
    "contnent": "ذَٰلِكَ جَزَآءُ أَعۡدَآءِ ٱللَّهِ ٱلنَّارُۖ لَهُمۡ فِيهَا دَارُ ٱلۡخُلۡدِ جَزَآءَۢ بِمَا كَانُواْ بِ‍َٔايَٰتِنَا يَجۡحَدُونَ ٨٢",
    "tafsier": {
      "ibnkther": "ذَٰلِكَ جَزَآءُ أَعۡدَآءِ ٱللَّهِ ٱلنَّارُۖ لَهُمۡ فِيهَا دَارُ ٱلۡخُلۡدِ جَزَآءَۢ بِمَا كَانُواْ بِ‍َٔايَٰتِنَا يَجۡحَدُونَ ٨٢\n                                    \n                                    \n                                    أي بشر أعمالهم وسيء أفعالهم.\n                                    ",
      "qortoby": "ذَٰلِكَ جَزَآءُ أَعۡدَآءِ ٱللَّهِ ٱلنَّارُۖ لَهُمۡ فِيهَا دَارُ ٱلۡخُلۡدِ جَزَآءَۢ بِمَا كَانُواْ بِ‍َٔايَٰتِنَا يَجۡحَدُونَ ٨٢\n                                    \n                                    \n                                    قوله تعالى : ذلك جزاء أعداء الله النار أي ذلك العذاب الشديد ، ثم بينه بقوله \" النار \" وقرأ ابن عباس \" ذلك جزاء أعداء الله النار دار الخلد \" فترجم بالدار عن النار وهو مجاز الآية . و \" ذلك \" ابتداء و \" جزاء \" الخبر و \" النار \" بدل من جزاء أو خبر مبتدأ مضمر ، والجملة في موضع بيان للجملة الأولى .\n                                    ",
      "saadi": "ذَٰلِكَ جَزَآءُ أَعۡدَآءِ ٱللَّهِ ٱلنَّارُۖ لَهُمۡ فِيهَا دَارُ ٱلۡخُلۡدِ جَزَآءَۢ بِمَا كَانُواْ بِ‍َٔايَٰتِنَا يَجۡحَدُونَ ٨٢\n                                        \n                                        \n                                        \n                                        { ذَلِكَ جَزَاءُ أَعْدَاءِ اللَّهِ } الذين حاربوه، وحاربوا أولياءه، بالكفر والتكذيب، والمجادلة والمجالدة. { النَّارُ لَهُمْ فِيهَا دَارُ الْخُلْدِ } أي: الخلود الدائم، الذي لا يفتر عنهم العذاب ساعة، ولا هم ينصرون، وذلك { جَزَاءً بِمَا كَانُوا بِآيَاتِنَا يَجْحَدُونَ } فإنها آيات واضحة، وأدلة قاطعة مفيدة لليقين، فأعظم الظلم وأكبر العناد، جحدها، والكفر بها.\n                                    "
    }
  },
  {
    "id": 28,
    "versesNumber": 29,
    "souraName": "Fussilat.html",
    "contnent": "وَقَالَ ٱلَّذِينَ كَفَرُواْ رَبَّنَآ أَرِنَا ٱلَّذَيۡنِ أَضَلَّانَا مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ نَجۡعَلۡهُمَا تَحۡتَ أَقۡدَامِنَا لِيَكُونَا مِنَ ٱلۡأَسۡفَلِينَ ٩٢",
    "tafsier": {
      "ibnkther": "وَقَالَ ٱلَّذِينَ كَفَرُواْ رَبَّنَآ أَرِنَا ٱلَّذَيۡنِ أَضَلَّانَا مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ نَجۡعَلۡهُمَا تَحۡتَ أَقۡدَامِنَا لِيَكُونَا مِنَ ٱلۡأَسۡفَلِينَ ٩٢\n                                    \n                                    \n                                    قال سفيان الثوري ، عن سلمة بن كهيل ، عن مالك بن الحصين الفزاري ، عن أبيه ، عن علي ، رضي الله عنه ، في قوله : ( الذين أضلانا ) قال : إبليس وابن آدم الذي قتل أخاه .\nوهكذا روى حبة العرني عن علي ، مثل ذلك .\nوقال السدي ، عن علي : فإبليس يدعو به كل صاحب شرك ، وابن آدم يدعو به كل صاحب كبيرة ، فإبليس - لعنه الله - هو الداعي إلى كل شر من شرك فما دونه ، وابن آدم الأول . كما ثبت في الحديث : \" ما قتلت نفس ظلما إلا كان على ابن آدم الأول كفل من دمها ; لأنه أول من سن القتل \" .\nوقوله ( نجعلهما تحت أقدامنا ) أي : أسفل منا في العذاب ليكونا أشد عذابا منا ; ولهذا قالوا : ( ليكونا من الأسفلين ) أي : في الدرك الأسفل من النار ، كما تقدم في \" الأعراف \" من سؤال الأتباع من الله أن يعذب قادتهم أضعاف عذابهم ، قال : ( لكل ضعف ولكن لا تعلمون ) [ الأعراف : 38 ] أي : إنه تعالى قد أعطى كلا منهم ما يستحقه من العذاب والنكال ، بحسب عمله وإفساده ، كما قال تعالى : ( الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون ) [ النحل : 88 ] .\n                                    ",
      "qortoby": "وَقَالَ ٱلَّذِينَ كَفَرُواْ رَبَّنَآ أَرِنَا ٱلَّذَيۡنِ أَضَلَّانَا مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ نَجۡعَلۡهُمَا تَحۡتَ أَقۡدَامِنَا لِيَكُونَا مِنَ ٱلۡأَسۡفَلِينَ ٩٢\n                                    \n                                    \n                                    قوله تعالى : وقال الذين كفروا يعني في النار فذكره بلفظ الماضي والمراد المستقبل ربنا أرنا الذين أضلانا من الجن والإنس يعني إبليس وابن آدم الذي قتل أخاه . عن ابن عباس وابن مسعود وغيرهما ، ويشهد لهذا القول الحديث المرفوع : ما من مسلم يقتل ظلما إلا كان على ابن آدم الأول كفل من ذنبه لأنه أول من سن القتل خرجه الترمذي ، وقيل : هو بمعنى الجنس ، وبني على التثنية لاختلاف الجنسين . نجعلهما تحت أقدامنا سألوا ذلك حتى يشتفوا منهم بأن يجعلوهم تحت أقدامهم ليكونا من الأسفلين في النار وهو الدرك الأسفل . سألوا أن يضعف الله عذاب من كان سبب ضلالتهم من الجن والإنس . وقرأ ابن محيصن والسوسي عن أبي عمرو وابن عامر وأبو بكر والمفضل \" أرنا \" بإسكان الراء ، وعن أبي عمرو أيضا باختلاسها . وأشبع الباقون كسرتها . وقد تقدم في \" الأعراف \" .\n                                    ",
      "saadi": "وَقَالَ ٱلَّذِينَ كَفَرُواْ رَبَّنَآ أَرِنَا ٱلَّذَيۡنِ أَضَلَّانَا مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ نَجۡعَلۡهُمَا تَحۡتَ أَقۡدَامِنَا لِيَكُونَا مِنَ ٱلۡأَسۡفَلِينَ ٩٢\n                                        \n                                        \n                                        \n                                        { وَقَالَ الَّذِينَ كَفَرُوا } أي: الأتباع منهم، بدليل ما بعده، على وجه الحنق، على من أضلهم: { رَبَّنَا أَرِنَا الَّذَيْنِ أَضَلَّانَا مِنَ الْجِنِّ وَالْإِنْسِ } أي: الصنفين اللذين، قادانا إلى الضلال والعذاب، من شياطين الجن، وشياطين الإنس، الدعاة إلى جهنم.\n{ نَجْعَلْهُمَا تَحْتَ أَقْدَامِنَا لِيَكُونَا مِنَ الْأَسْفَلِينَ } أي: الأذلين المهانين كما أضلونا، وفتنونا، وصاروا سببًا لنزولنا. ففي هذا، بيان حنق بعضهم على بعض، وتبرِّي بعضهم من بعض.\n                                    "
    }
  },
  {
    "id": 29,
    "versesNumber": 30,
    "souraName": "Fussilat.html",
    "contnent": "إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ تَتَنَزَّلُ عَلَيۡهِمُ ٱلۡمَلَٰٓئِكَةُ أَلَّا تَخَافُواْ وَلَا تَحۡزَنُواْ وَأَبۡشِرُواْ بِٱلۡجَنَّةِ ٱلَّتِي كُنتُمۡ تُوعَدُونَ ٠٣",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ تَتَنَزَّلُ عَلَيۡهِمُ ٱلۡمَلَٰٓئِكَةُ أَلَّا تَخَافُواْ وَلَا تَحۡزَنُواْ وَأَبۡشِرُواْ بِٱلۡجَنَّةِ ٱلَّتِي كُنتُمۡ تُوعَدُونَ ٠٣\n                                    \n                                    \n                                    قول تعالى : ( إن الذين قالوا ربنا الله ثم استقاموا ) أي : أخلصوا العمل لله ، وعملوا بطاعة الله تعالى على ما شرع الله لهم .\nقال الحافظ أبو يعلى الموصلي : حدثنا الجراح ، حدثنا سلم بن قتيبة أبو قتيبة الشعيري ، حدثنا سهيل بن أبي حزم ، حدثنا ثابت عن أنس بن مالك قال : قرأ علينا رسول الله - صلى الله عليه وسلم - هذه الآية : ( إن الذين قالوا ربنا الله ثم استقاموا ) قد قالها ناس ثم كفر أكثرهم ، فمن قالها حتى يموت فقد استقام عليها .\nوكذا رواه النسائي في تفسيره ، والبزار وابن جرير ، عن عمرو بن علي الفلاس ، عن سلم بن قتيبة ، به . وكذا رواه ابن أبي حاتم ، عن أبيه ، عن الفلاس ، به . ثم قال ابن جرير :\nحدثنا ابن بشار ، حدثنا عبد الرحمن ، حدثنا سفيان ، عن أبي إسحاق ، عن عامر بن سعد ، عن سعيد بن نمران قال : قرأت عند أبي بكر الصديق هذه الآية : ( إن الذين قالوا ربنا الله ثم استقاموا ) قال : هم الذين لم يشركوا بالله شيئا .\nثم روي من حديث الأسود بن هلال قال : قال أبو بكر ، رضي الله عنه : ما تقولون في هذه الآية : ( إن الذين قالوا ربنا الله ثم استقاموا ) ؟ قال : فقالوا : ( ربنا الله ثم استقاموا ) من ذنب . فقال : لقد حملتموها على غير المحمل ، ( قالوا ربنا الله ثم استقاموا ) فلم يلتفتوا إلى إله غيره .\nوكذا قال مجاهد ، وعكرمة ، والسدي ، وغير واحد .\nوقال ابن أبي حاتم : حدثنا أبو عبد الله الظهراني ، أخبرنا حفص بن عمر العدني ، عن الحكم بن أبان ، عن عكرمة قال : سئل ابن عباس ، رضي الله عنهما : أي آية في كتاب الله أرخص ؟ قال قوله : ( إن الذين قالوا ربنا الله ثم استقاموا ) على شهادة أن لا إله إلا الله .\nوقال الزهري : تلا عمر هذه الآية على المنبر ، ثم قال : استقاموا - والله - لله بطاعته ، ولم يروغوا روغان الثعالب .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( قالوا ربنا الله ثم استقاموا ) على أداء فرائضه . وكذا قال قتادة ، قال : وكان الحسن يقول : اللهم أنت ربنا ، فارزقنا الاستقامة .\nوقال أبو العالية : ( ثم استقاموا ) أخلصوا له العمل والدين .\nوقال الإمام أحمد : حدثنا هشيم ، حدثنا يعلى بن عطاء ، عن عبد الله بن سفيان الثقفي ، عن أبيه ; أن رجلا قال : يا رسول الله مرني بأمر في الإسلام لا أسأل عنه أحدا بعدك . قال : \" قل آمنت بالله ، ثم استقم \" قلت : فما أتقي ؟ فأومأ إلى لسانه .\nورواه النسائي من حديث شعبة ، عن يعلى بن عطاء ، به .\nثم قال الإمام أحمد : حدثنا يزيد بن هارون ، أخبرنا إبراهيم بن سعد ، حدثني ابن شهاب ، عن محمد بن عبد الرحمن بن ماعز الغامدي ، عن سفيان بن عبد الله الثقفي قال : قلت : يا رسول الله ، حدثني بأمر أعتصم به . قال : \" قل ربي الله ، ثم استقم \" قلت : يا رسول الله ما أكثر ما تخاف علي ؟ فأخذ رسول الله - صلى الله عليه وسلم - بطرف لسان نفسه ، ثم قال : \" هذا \" .\nوهكذا رواه الترمذي وابن ماجه ، من حديث الزهري ، به . وقال الترمذي : حسن صحيح .\nوقد أخرجه مسلم في صحيحه والنسائي ، من حديث هشام بن عروة ، عن أبيه ، عن سفيان بن عبد الله الثقفي قال : قلت : يا رسول الله ، قل لي في الإسلام قولا لا أسأل عنه أحدا بعدك . قال : \" قل آمنت بالله ، ثم استقم \" وذكر تمام الحديث .\nوقوله : ( تتنزل عليهم الملائكة ) قال مجاهد ، والسدي ، وزيد بن أسلم ، وابنه : يعني عند الموت قائلين : ( ألا تخافوا ) قال مجاهد ، وعكرمة ، وزيد بن أسلم : أي مما تقدمون عليه من أمر الآخرة ، ( ولا تحزنوا ) [ أي ] على ما خلفتموه من أمر الدنيا ، من ولد وأهل ، ومال أو دين ، فإنا نخلفكم فيه ، ( وأبشروا بالجنة التي كنتم توعدون ) فيبشرونهم بذهاب الشر وحصول الخير .\nوهذا كما في حديث البراء ، رضي الله عنه : \" إن الملائكة تقول لروح المؤمن : اخرجي أيتها الروح الطيبة في الجسد الطيب كنت تعمرينه ، اخرجي إلى روح وريحان ، ورب غير غضبان \" .\nوقيل : إن الملائكة تتنزل عليهم يوم خروجهم من قبورهم . حكاه ابن جرير عن ابن عباس ، والسدي .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا عبد السلام بن مطهر ، حدثنا جعفر بن سليمان : سمعت ثابتا قرأ سورة \" حم السجدة \" حتى بلغ : ( إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة ) فوقف فقال : بلغنا أن العبد المؤمن حين يبعثه الله من قبره ، يتلقاه الملكان اللذان كانا معه في الدنيا ، فيقولان له : لا تخف ولا تحزن ، ( وأبشروا بالجنة التي كنتم توعدون ) قال : فيؤمن الله خوفه ، ويقر عينه فما عظيمة يخشى الناس يوم القيامة إلا هي للمؤمن قرة عين ؛ لما هداه الله ، ولما كان يعمل له في الدنيا .\nوقال زيد بن أسلم : يبشرونه عند موته ، وفي قبره ، وحين يبعث . رواه ابن أبي حاتم .\nوهذا القول يجمع الأقوال كلها ، وهو حسن جدا ، وهو الواقع .\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ تَتَنَزَّلُ عَلَيۡهِمُ ٱلۡمَلَٰٓئِكَةُ أَلَّا تَخَافُواْ وَلَا تَحۡزَنُواْ وَأَبۡشِرُواْ بِٱلۡجَنَّةِ ٱلَّتِي كُنتُمۡ تُوعَدُونَ ٠٣\n                                    \n                                    \n                                    قوله تعالى : إن الذين قالوا ربنا الله ثم استقاموا قال عطاء عن ابن عباس : نزلت هذه الآية في أبي بكر الصديق - رضي الله عنه - ، وذلك أن المشركين قالوا ربنا الله ، والملائكة بناته ، وهؤلاء شفعاءنا عند الله ، فلم يستقيموا . وقال أبو بكر : ربنا الله وحده لا شريك له ، ومحمد - صلى الله عليه وسلم - عبده ورسوله ، فاستقام . وفي الترمذي عن أنس بن مالك أن رسول الله - صلى الله عليه وسلم - قرأ إن الذين قالوا ربنا الله ثم استقاموا قال : قد قال الناس ثم كفر أكثرهم ، فمن مات عليها فهو ممن استقام قال : حديث غريب . ويروى في هذه الآية عن النبي - صلى الله عليه وسلم - وأبي بكر وعمر وعثمان وعلي معنى استقاموا ، ففي صحيح مسلم عن سفيان بن عبد الله الثقفي قال : قلت : يا رسول الله قل لي في الإسلام قولا لا أسأل عنه أحدا بعدك - وفي رواية - غيرك . قال : قل آمنت بالله ثم استقم زاد الترمذي قلت : يا رسول الله ما أخوف ما تخاف علي ؟ فأخذ بلسان نفسه وقال : ( هذا ) . وروي عن أبي بكر الصديق - رضي الله عنه - أنه قال : ثم استقاموا لم يشركوا بالله شيئا . وروى عنه الأسود بن هلال أنه قال لأصحابه : ما تقولون في هاتين الآيتين إن الذين قالوا ربنا الله ثم استقاموا و الذين آمنوا ولم يلبسوا إيمانهم بظلم فقالوا : استقاموا فلم يذنبوا ولم يلبسوا إيمانهم بخطيئة ، فقال أبو بكر : لقد حملتموها على غير المحمل قالوا ربنا الله ثم استقاموا فلم يلتفتوا إلى إله غيره \" ولم يلبسوا إيمانهم بشرك أولئك لهم الأمن وهم مهتدون . وروي عن عمر - رضي الله عنه - أنه قال على المنبر وهو يخطب : إن الذين قالوا ربنا الله ثم استقاموا فقال : استقاموا والله على الطريقة لطاعته ثم لم يرغوا روغان الثعالب . وقال عثمان - رضي الله عنه - : ثم أخلصوا العمل لله . وقال علي - رضي الله عنه - : ثم أدوا الفرائض . وأقوال التابعين بمعناها . قال ابن زيد وقتادة : استقاموا على الطاعة لله . الحسن : استقاموا على أمر الله فعملوا بطاعته واجتنبوا معصيته . وقال مجاهد وعكرمة : استقاموا على شهادة أن لا إله إلا الله حتى ماتوا . وقال سفيان الثوري : عملوا على وفاق ما قالوا . وقال الربيع : أعرضوا عما سوى الله . وقال الفضيل بن عياض : زهدوا في الفانية ورغبوا في الباقية . وقيل : استقاموا إسرارا كما استقاموا إقرارا . وقيل : استقاموا فعلا كما استقاموا قولا . وقال أنس : لما نزلت هذه الآية قال النبي - صلى الله عليه وسلم - : هم أمتي ورب الكعبة . وقال الإمام ابن فورك : السين سين الطلب ، مثل استسقى أي : سألوا من الله أن يثبتهم على الدين . وكان الحسن إذا قرأ هذه الآية قال : اللهم أنت ربنا فارزقنا الاستقامة .\nقلت : وهذه الأقوال وإن تداخلت فتلخيصها : اعتدلوا على طاعة الله عقدا وقولا وفعلا ، وداموا على ذلك . تتنزل عليهم الملائكة قال ابن زيد ومجاهد : عند الموت . وقال مقاتل وقتادة : إذا قاموا من قبورهم للبعث . وقال ابن عباس : هي بشرى تكون لهم من الملائكة في الآخرة . وقال وكيع وابن زيد : البشرى في ثلاثة مواطن : عند الموت ، وفي القبر ، وعند البعث . ألا تخافوا أي ب \" ألا تخافوا \" فحذف الجار . وقال مجاهد : لا تخافوا الموت . وقال عطاء بن أبي رباح : لا تخافوا رد ثوابكم فإنه مقبول ، وقال عكرمة ولا تخافوا إمامكم ، ولا تحزنوا على ذنوبكم . ولا تحزنوا على أولادكم ، فإن الله خليفتكم عليهم . وقال عطاء بن أبي رباح : لا تحزنوا على ذنوبكم فإني أغفرها لكم . وقال عكرمة : لا تحزنوا على ذنوبكم . وأبشروا بالجنة التي كنتم توعدون .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ تَتَنَزَّلُ عَلَيۡهِمُ ٱلۡمَلَٰٓئِكَةُ أَلَّا تَخَافُواْ وَلَا تَحۡزَنُواْ وَأَبۡشِرُواْ بِٱلۡجَنَّةِ ٱلَّتِي كُنتُمۡ تُوعَدُونَ ٠٣\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن أوليائه، وفي ضمن ذلك، تنشيطهم، والحث على الاقتداء بهم، فقال: { إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا } أي: اعترفوا ونطقوا ورضوا بربوبية الله تعالى، واستسلموا لأمره، ثم استقاموا على الصراط المستقيم، علمًا وعملاً، فلهم البشرى في الحياة الدنيا وفي الآخرة.\n{ تَتَنَزَّلُ عَلَيْهِمُ الْمَلَائِكَةُ } الكرام، أي: يتكرر نزولهم عليهم، مبشرين لهم عند الاحتضار. { أَلَّا تَخَافُوا } على ما يستقبل من أمركم، { وَلَا تَحْزَنُوا } على ما مضى، فنفوا عنهم المكروه الماضي والمستقبل، { وَأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ } فإنها قد وجبت لكم وثبتت، وكان وعد الله مفعولاً.\n\n                                    "
    }
  },
  {
    "id": 30,
    "versesNumber": 31,
    "souraName": "Fussilat.html",
    "contnent": "نَحۡنُ أَوۡلِيَآؤُكُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۖ وَلَكُمۡ فِيهَا مَا تَشۡتَهِيٓ أَنفُسُكُمۡ وَلَكُمۡ فِيهَا مَا تَدَّعُونَ ١٣",
    "tafsier": {
      "ibnkther": "نَحۡنُ أَوۡلِيَآؤُكُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۖ وَلَكُمۡ فِيهَا مَا تَشۡتَهِيٓ أَنفُسُكُمۡ وَلَكُمۡ فِيهَا مَا تَدَّعُونَ ١٣\n                                    \n                                    \n                                    وقوله : ( نحن أولياؤكم في الحياة الدنيا وفي الآخرة ) أي : تقول الملائكة للمؤمنين عند الاحتضار : نحن كنا أولياءكم ، أي : قرناءكم في الحياة الدنيا ، نسددكم ونوفقكم ، ونحفظكم بأمر الله ، وكذلك نكون معكم في الآخرة نؤنس منكم الوحشة في القبور ، وعند النفخة في الصور ، ونؤمنكم يوم البعث والنشور ، ونجاوز بكم الصراط المستقيم ، ونوصلكم إلى جنات النعيم . ( ولكم فيها ما تشتهي أنفسكم ) أي : في الجنة من جميع ما تختارون مما تشتهيه النفوس ، وتقر به العيون ، ( ولكم فيها ما تدعون ) أي : مهما طلبتم وجدتم ، وحضر بين أيديكم ، [ أي ] كما اخترتم .\n                                    ",
      "qortoby": "نَحۡنُ أَوۡلِيَآؤُكُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۖ وَلَكُمۡ فِيهَا مَا تَشۡتَهِيٓ أَنفُسُكُمۡ وَلَكُمۡ فِيهَا مَا تَدَّعُونَ ١٣\n                                    \n                                    \n                                    قوله تعالى : نحن أولياؤكم في الحياة الدنيا وفي الآخرة أي تقول لهم الملائكة الذين تتنزل عليهم بالبشارة \" نحن أولياءكم \" قال مجاهد : أي : نحن قرناءكم الذين كنا معكم في الدنيا ، فإذا كان يوم القيامة قالوا لا نفارقكم حتى ندخلكم الجنة . وقال السدي : أي : نحن الحفظة لأعمالكم في الدنيا وأولياءكم في الآخرة . ويجوز أن يكون هذا من قول الله تعالى ، والله ولي المؤمنين ومولاهم . ولكم فيها ما تشتهي أنفسكم أي من الملاذ . ولكم فيها ما تدعون تسألون وتتمنون .\n                                    ",
      "saadi": "نَحۡنُ أَوۡلِيَآؤُكُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۖ وَلَكُمۡ فِيهَا مَا تَشۡتَهِيٓ أَنفُسُكُمۡ وَلَكُمۡ فِيهَا مَا تَدَّعُونَ ١٣\n                                        \n                                        \n                                        \n                                        ويقولون لهم أيضا - مثبتين لهم، ومبشرين: { نَحْنُ أَوْلِيَاؤُكُمْ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ } يحثونهم في الدنيا على الخير، ويزينونه لهم، ويرهبونهم عن الشر، ويقبحونه في قلوبهم، ويدعون الله لهم، ويثبتونهم عند المصائب والمخاوف، وخصوصًا عند الموت وشدته، والقبر وظلمته، وفي القيامة وأهوالها، وعلى الصراط، وفي الجنة يهنئونهم بكرامة ربهم، ويدخلون عليهم من كل باب { سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ } ويقولون لهم أيضا: { وَلَكُمْ فِيهَا } أي: في الجنة { مَا تَشْتَهِي أَنْفُسُكُمْ } قد أعد وهيئ. { وَلَكُمْ فِيهَا مَا تَدَّعُونَ } أي: تطلبون من كل ما تتعلق به إرادتكم وتطلبونه من أنواع اللذات والمشتهيات، مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.\n                                    "
    }
  },
  {
    "id": 31,
    "versesNumber": 32,
    "souraName": "Fussilat.html",
    "contnent": "نُزُلٗا مِّنۡ غَفُورٖ رَّحِيمٖ ٢٣",
    "tafsier": {
      "ibnkther": "نُزُلٗا مِّنۡ غَفُورٖ رَّحِيمٖ ٢٣\n                                    \n                                    \n                                    ( نزلا من غفور رحيم ) أي : ضيافة وعطاء وإنعاما من غفور لذنوبكم ، رحيم بكم رءوف ، حيث غفر ، وستر ، ورحم ، ولطف .\nوقد ذكر ابن أبي حاتم هاهنا حديث سوق الجنة عند قوله تعالى : ( ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون نزلا من غفور رحيم ) ، فقال :\nحدثنا أبي ، حدثنا هشام بن عمار ، حدثنا عبد الحميد بن حبيب بن أبي العشرين أبي سعيد ، حدثنا الأوزاعي ، حدثني حسان بن عطية ، عن سعيد بن المسيب : أنه لقي أبا هريرة [ رضي الله عنه ] فقال أبو هريرة : نسأل الله أن يجمع بيني وبينك في سوق الجنة . فقال سعيد : أوفيها سوق ؟ قال : نعم ، أخبرني رسول الله - صلى الله عليه وسلم - أن أهل الجنة إذا دخلوا فيها ، نزلوا بفضل أعمالهم ، فيؤذن لهم في مقدار يوم الجمعة في أيام الدنيا فيزورون الله ، عز وجل ، ويبرز لهم عرشه ، ويتبدى لهم في روضة من رياض الجنة ، وتوضع لهم منابر من نور ، ومنابر من لؤلؤ ، ومنابر من ياقوت ، ومنابر من زبرجد ، ومنابر من ذهب ، ومنابر من فضة ، ويجلس [ فيه ] أدناهم وما فيهم دنيء على كثبان المسك والكافور ، ما يرون بأن أصحاب الكراسي بأفضل منهم مجلسا .\nقال أبو هريرة : قلت : يا رسول الله ، وهل نرى ربنا [ يوم القيامة ] ؟ قال : \" نعم هل تتمارون في رؤية الشمس والقمر ليلة البدر ؟ \" قلنا : لا . قال - صلى الله عليه وسلم - : \" فكذلك لا تتمارون في رؤية ربكم تعالى ، ولا يبقى في ذلك المجلس أحد إلا حاضره الله محاضرة ، حتى إنه ليقول للرجل منهم : يا فلان بن فلان ، أتذكر يوم عملت كذا وكذا ؟ - يذكره ببعض غدراته في الدنيا - فيقول : أي رب ، أفلم تغفر لي ؟ فيقول : بلى فبسعة مغفرتي بلغت منزلتك هذه . قال : فبينما هم على ذلك غشيتهم سحابة من فوقهم ، فأمطرت عليهم طيبا لم يجدوا مثل ريحه شيئا قط \" . قال : ثم يقول ربنا - عز وجل - : قوموا إلى ما أعددت لكم من الكرامة ، وخذوا ما اشتهيتم \" . قال : \" فنأتي سوقا قد حفت به الملائكة ، فيها ما لم تنظر العيون إلى مثله ، ولم تسمع الآذان ، ولم يخطر على القلوب . قال : فيحمل لنا ما اشتهينا ، ليس يباع فيه شيء ولا يشترى ، وفي ذلك السوق يلقى أهل الجنة بعضهم بعضا \" . قال : \" فيقبل الرجل ذو المنزلة الرفيعة ، فيلقى من هو دونه - وما فيهم دنيء فيروعه ما يرى عليه من اللباس ، فما ينقضي آخر حديثه حتى يتمثل عليه أحسن منه ; وذلك لأنه لا ينبغي لأحد أن يحزن فيها .\nثم ننصرف إلى منازلنا ، فيتلقانا أزواجنا فيقلن : مرحبا وأهلا بحبنا ، لقد جئت وإن بك من الجمال والطيب أفضل مما فارقتنا عليه . فيقول : إنا جالسنا اليوم ربنا الجبار - عز وجل - وبحقنا أن ننقلب بمثل ما انقلبنا به \" .\nوقد رواه الترمذي في \" صفة الجنة \" من جامعه ، عن محمد بن إسماعيل ، عن هشام بن عمار ، ورواه ابن ماجه عن هشام بن عمار ، به نحوه . ثم قال الترمذي : هذا حديث غريب ، لا نعرفه إلا من هذا الوجه .\nوقال الإمام أحمد : حدثنا ابن أبي عدي ، عن حميد ، عن أنس قال : قال رسول الله - صلى الله عليه وسلم - : \" من أحب لقاء الله أحب الله لقاءه ، ومن كره لقاء الله كره الله لقاءه \" . قلنا يا رسول الله كلنا نكره الموت ؟ قال : \" ليس ذلك كراهية الموت ، ولكن المؤمن إذا حضر جاءه البشير من الله بما هو صائر إليه ، فليس شيء أحب إليه من أن يكون قد لقي الله فأحب الله لقاءه \" قال : \" وإن الفاجر - أو الكافر - إذا حضر جاءه بما هو صائر إليه من الشر - أو : ما يلقى من الشر - فكره لقاء الله فكره الله لقاءه \" .\nوهذا حديث صحيح ، وقد ورد في الصحيح من غير هذا الوجه .\n                                    ",
      "qortoby": "نُزُلٗا مِّنۡ غَفُورٖ رَّحِيمٖ ٢٣\n                                    \n                                    \n                                    نزلا أي رزقا وضيافة . وقد تقدم في \" آل عمران \" وهو منصوب على المصدر أي : أنزلناه نزلا . وقيل : على الحال . وقيل : هو جمع نازل ، أي : لكم ما تدعون نازلين ، فيكون حالا من الضمير المرفوع في \" تدعون \" أو من المجرور في \" لكم \" .\n                                    ",
      "saadi": "نُزُلٗا مِّنۡ غَفُورٖ رَّحِيمٖ ٢٣\n                                        \n                                        \n                                        \n                                        { نُزُلًا مِنْ غَفُورٍ رَحِيمٍ } أي: هذا الثواب الجزيل، والنعيم المقيم، نُزُلٌ وضيافة { مِنْ غَفُورٍ } غفر لكم السيئات، { رَحِيمٌ } حيث وفقكم لفعل الحسنات، ثم قبلها منكم. فبمغفرته أزال عنكم المحذور، وبرحمته، أنالكم المطلوب.\n                                    "
    }
  },
  {
    "id": 32,
    "versesNumber": 33,
    "souraName": "Fussilat.html",
    "contnent": "وَمَنۡ أَحۡسَنُ قَوۡلٗا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحٗا وَقَالَ إِنَّنِي مِنَ ٱلۡمُسۡلِمِينَ ٣٣",
    "tafsier": {
      "ibnkther": "وَمَنۡ أَحۡسَنُ قَوۡلٗا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحٗا وَقَالَ إِنَّنِي مِنَ ٱلۡمُسۡلِمِينَ ٣٣\n                                    \n                                    \n                                    يقول تعالى : ( ومن أحسن قولا ممن دعا إلى الله ) أي : دعا عباد الله إليه ، ( وعمل صالحا وقال إنني من المسلمين ) أي : وهو في نفسه مهتد بما يقوله ، فنفعه لنفسه ولغيره لازم ومتعد ، وليس هو من الذين يأمرون بالمعروف ولا يأتونه ، وينهون عن المنكر ويأتونه ، بل يأتمر بالخير ويترك الشر ، ويدعو الخلق إلى الخالق تبارك وتعالى . وهذه عامة في كل من دعا إلى خير ، وهو في نفسه مهتد ، ورسول الله - صلى الله عليه وسلم - أولى الناس بذلك ، كما قال محمد بن سيرين ، والسدي ، وعبد الرحمن بن زيد بن أسلم .\nوقيل : المراد بها المؤذنون الصلحاء ، كما ثبت في صحيح مسلم : \" المؤذنون أطول الناس أعناقا يوم القيامة \" وفي السنن مرفوعا : \" الإمام ضامن ، والمؤذن مؤتمن ، فأرشد الله الأئمة ، وغفر للمؤذنين \" .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا محمد بن عروبة الهروي ، حدثنا غسان قاضي هراة وقال أبو زرعة : حدثنا إبراهيم بن طهمان ، عن مطر ، عن الحسن ، عن سعد بن أبي وقاص أنه قال : \" سهام المؤذنين عند الله يوم القيامة كسهام المجاهدين ، وهو بين الأذان والإقامة كالمتشحط في سبيل الله في دمه \" .\nقال : وقال ابن مسعود : \" لو كنت مؤذنا ما باليت ألا أحج ولا أعتمر ولا أجاهد \" .\nقال : وقال عمر بن الخطاب : لو كنت مؤذنا لكمل أمري ، وما باليت ألا أنتصب لقيام الليل ولا لصيام النهار ، سمعت رسول الله - صلى الله عليه وسلم - يقول : \" اللهم اغفر للمؤذنين \" ثلاثا ، قال : فقلت : يا رسول الله ، تركتنا ، ونحن نجتلد على الأذان بالسيوف . قال : \" كلا يا عمر ، إنه يأتي على الناس زمان يتركون الأذان على ضعفائهم ، وتلك لحوم حرمها الله على النار ، لحوم المؤذنين \" .\nقال : وقالت عائشة : ولهم هذه الآية : ( ومن أحسن قولا ممن دعا إلى الله وعمل صالحا وقال إنني من المسلمين ) قالت : فهو المؤذن إذا قال : \" حي على الصلاة \" فقد دعا إلى الله .\nوهكذا قال ابن عمر ، وعكرمة : إنها نزلت في المؤذنين .\nوقد ذكر البغوي عن أبي أمامة الباهلي - رضي الله عنه - أنه قال في قوله : ( وعمل صالحا ) قال : يعني صلاة ركعتين بين الأذان والإقامة .\nثم أورد البغوي حديث \" عبد الله بن المغفل \" قال : قال رسول الله - صلى الله عليه وسلم - : \" بين كل أذانين صلاة \" . ثم قال في الثالثة : \" لمن شاء \" وقد أخرجه الجماعة في كتبهم ، من حديث عبد الله بن بريدة ، عنه وحديث الثوري ، عن زيد العمي ، عن أبي إياس معاوية بن قرة ، عن أنس بن مالك - رضي الله عنه - قال الثوري : لا أراه إلا وقد رفعه إلى النبي - صلى الله عليه وسلم - : \" الدعاء لا يرد بين الأذان والإقامة \" .\nورواه أبو داود والترمذي ، والنسائي في \" اليوم والليلة \" كلهم من حديث الثوري ، به . وقال الترمذي : هذا حديث حسن .\nورواه النسائي أيضا من حديث سليمان التيمي ، عن قتادة ، عن أنس ، به .\nوالصحيح أن الآية عامة في المؤذنين وفي غيرهم ، فأما حال نزول هذه الآية فإنه لم يكن الأذان مشروعا بالكلية ; لأنها مكية ، والأذان إنما شرع بالمدينة بعد الهجرة ، حين أريه عبد الله بن زيد بن عبد ربه الأنصاري في منامه ، فقصه على رسول الله - صلى الله عليه وسلم - فأمره أن يلقيه على بلال فإنه أندى صوتا ، كما هو مقرر في موضعه ، فالصحيح إذا أنها عامة ، كما قال عبد الرزاق ، عن معمر ، عن الحسن البصري : أنه تلا هذه الآية : ( ومن أحسن قولا ممن دعا إلى الله وعمل صالحا وقال إنني من المسلمين ) فقال : هذا حبيب الله ، هذا ولي الله ، هذا صفوة الله ، هذا خيرة الله ، هذا أحب أهل الأرض إلى الله ، أجاب الله في دعوته ، ودعا الناس إلى ما أجاب الله فيه من دعوته ، وعمل صالحا في إجابته ، وقال : إنني من المسلمين ، هذا خليفة الله .\n                                    ",
      "qortoby": "وَمَنۡ أَحۡسَنُ قَوۡلٗا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحٗا وَقَالَ إِنَّنِي مِنَ ٱلۡمُسۡلِمِينَ ٣٣\n                                    \n                                    \n                                    قوله تعالى : ومن أحسن قولا ممن دعا إلى الله وعمل صالحا هذا توبيخ للذين تواصوا باللغو في القرآن . والمعنى : أي كلام أحسن من القرآن ، ومن أحسن قولا من الداعي إلى الله وطاعته وهو محمد صلى الله عليه وسلم . قال ابن سيرين والسدي وابن زيد والحسن : هو رسول الله صلى الله عليه وسلم . وكان الحسن إذا تلا هذه الآية يقول : هذا رسول الله ، هذا حبيب الله ، هذا ولي الله ، هذا صفوة الله ، هذا خيرة الله ، هذا والله أحب أهل الأرض إلى الله ، أجاب الله في دعوته ، ودعا الناس إلى ما أجاب إليه . وقالت عائشة رضي الله عنها وعكرمة وقيس بن أبي حازم ومجاهد : نزلت في المؤذنين . قال فضيل بن رفيدة : كنت مؤذنا لأصحاب عبد الله بن مسعود ، فقال لي عاصم بن هبيرة : إذا أذنت فقلت : الله أكبر الله أكبر لا إله إلا الله ، فقل : وأنا من المسلمين ، ثم قرأ هذه الآية ، قال ابن العربي : الأول أصح ; لأن الآية مكية ، والأذان مدني ، وإنما يدخل فيها بالمعنى ، لا أنه كان المقصود وقت القول ، ويدخل فيها أبو بكر الصديق حين قال في النبي - صلى الله عليه وسلم - وقد خنقه الملعون : أتقتلون رجلا أن يقول \" ربي الله \" وتتضمن كل كلام حسن فيه ذكر التوحيد والإيمان .\nقلت : وقول ثالث وهو أحسنها ، قال الحسن : هذه الآية عامة في كل من دعا إلى الله . وكذا قال قيس بن أبي حازم قال : نزلت في كل مؤمن . قال : ومعنى \" وعمل صالحا \" الصلاة بين الأذان والإقامة . وقاله أبو أمامة ، قال : صلى ركعتين بين الأذان والإقامة . وقال عكرمة : وعمل صالحا صلى وصام . وقال الكلبي : أدى الفرائض .\nقلت : وهذا أحسنها مع اجتناب المحارم وكثرة المندوب . والله أعلم .\nوقال إنني من المسلمين قال ابن العربي : وما تقدم يدل على الإسلام ، لكن لما كان الدعاء بالقول والسيف يكون للاعتقاد ويكون للحجة ، وكان العمل يكون للرياء والإخلاص ، دل على أنه لا بد من التصريح بالاعتقاد لله في ذلك كله ، وأن العمل لوجهه .\nمسألة : لما قال الله تعالى : وقال إنني من المسلمين ولم يقل له اشترط إن شاء الله ، كان في ذلك رد على من يقول : أنا مسلم إن شاء الله .\n                                    ",
      "saadi": "وَمَنۡ أَحۡسَنُ قَوۡلٗا مِّمَّن دَعَآ إِلَى ٱللَّهِ وَعَمِلَ صَٰلِحٗا وَقَالَ إِنَّنِي مِنَ ٱلۡمُسۡلِمِينَ ٣٣\n                                        \n                                        \n                                        \n                                        هذا استفهام بمعنى النفي المتقرر أي: لا أحد أحسن قولا. أي: كلامًا وطريقة، وحالة { مِمَّنْ دَعَا إِلَى اللَّهِ } بتعليم الجاهلين، ووعظ الغافلين والمعرضين، ومجادلة المبطلين، بالأمر بعبادة الله، بجميع أنواعها،والحث عليها، وتحسينها مهما أمكن، والزجر عما نهى الله عنه، وتقبيحه بكل طريق يوجب تركه، خصوصًا من هذه الدعوة إلى أصل دين الإسلام وتحسينه، ومجادلة أعدائه بالتي هي أحسن، والنهي عما يضاده من الكفر والشرك، والأمر بالمعروف، والنهي عن المنكر.\nومن الدعوة إلى الله، تحبيبه إلى عباده، بذكر تفاصيل نعمه، وسعة جوده، وكمال رحمته، وذكر أوصاف كماله، ونعوت جلاله.\nومن الدعوة إلى الله، الترغيب في اقتباس العلم والهدى من كتاب الله وسنة رسوله، والحث على ذلك، بكل طريق موصل إليه، ومن ذلك، الحث على مكارم الأخلاق، والإحسان إلى عموم الخلق، ومقابلة المسيء بالإحسان، والأمر بصلة الأرحام، وبر الوالدين.\nومن ذلك، الوعظ لعموم الناس، في أوقات المواسم، والعوارض، والمصائب، بما يناسب ذلك الحال، إلى غير ذلك، مما لا تنحصر أفراده، مما تشمله الدعوة إلى الخير كله، والترهيب من جميع الشر.\nثم قال تعالى: { وَعَمِلَ صَالِحًا } أي: مع دعوته الخلق إلى الله، بادر هو بنفسه، إلى امتثال أمر الله، بالعمل الصالح، الذي يُرْضِي ربه. { وَقَالَ إِنَّنِي مِنَ الْمُسْلِمِينَ } أي: المنقادين لأمره، السالكين في طريقه، وهذه المرتبة، تمامها للصديقين، الذين عملوا على تكميل أنفسهم وتكميل غيرهم، وحصلت لهم الوراثة التامة من الرسل، كما أن من أشر الناس، قولاً، من كان من دعاة الضالين السالكين لسبله.\nوبين هاتين المرتبتين المتباينتين، اللتين ارتفعت إحداهما إلى أعلى عليين، ونزلت الأخرى، إلى أسفل سافلين، مراتب، لا يعلمها إلا الله، وكلها معمورة بالخلق { وَلِكُلٍّ دَرَجَاتٌ مِمَّا عَمِلُوا وَمَا رَبُّكَ بِغَافِلٍ عَمَّا يَعْمَلُونَ }\n                                    "
    }
  },
  {
    "id": 33,
    "versesNumber": 34,
    "souraName": "Fussilat.html",
    "contnent": "وَلَا تَسۡتَوِي ٱلۡحَسَنَةُ وَلَا ٱلسَّيِّئَةُۚ ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ فَإِذَا ٱلَّذِي بَيۡنَكَ وَبَيۡنَهُۥ عَدَٰوَةٞ كَأَنَّهُۥ وَلِيٌّ حَمِيمٞ ٤٣",
    "tafsier": {
      "ibnkther": "وَلَا تَسۡتَوِي ٱلۡحَسَنَةُ وَلَا ٱلسَّيِّئَةُۚ ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ فَإِذَا ٱلَّذِي بَيۡنَكَ وَبَيۡنَهُۥ عَدَٰوَةٞ كَأَنَّهُۥ وَلِيٌّ حَمِيمٞ ٤٣\n                                    \n                                    \n                                    وقوله : ( ولا تستوي الحسنة ولا السيئة ) أي : فرق عظيم بين هذه وهذه ، ( ادفع بالتي هي أحسن ) أي : من أساء إليك فادفعه عنك بالإحسان إليه ، كما قال عمر [ رضي الله عنه ] ما عاقبت من عصى الله فيك بمثل أن تطيع الله فيه .\nوقوله : ( فإذا الذي بينك وبينه عداوة كأنه ولي حميم ) وهو الصديق ، أي : إذا أحسنت إلى من أساء إليك قادته تلك الحسنة إليه إلى مصافاتك ومحبتك ، والحنو عليك ، حتى يصير كأنه ولي لك حميم أي : قريب إليك من الشفقة عليك والإحسان إليك .\n                                    ",
      "qortoby": "وَلَا تَسۡتَوِي ٱلۡحَسَنَةُ وَلَا ٱلسَّيِّئَةُۚ ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ فَإِذَا ٱلَّذِي بَيۡنَكَ وَبَيۡنَهُۥ عَدَٰوَةٞ كَأَنَّهُۥ وَلِيٌّ حَمِيمٞ ٤٣\n                                    \n                                    \n                                    قوله تعالى : ولا تستوي الحسنة ولا السيئة قال الفراء : \" لا \" صلة أي : ولا تستوي الحسنة والسيئة ، وأنشد :\nما كان يرضى رسول الله فعلهم والطيبان أبو بكر ولا عمر\nأراد أبو بكر وعمر ، أي : لا يستوي ما أنت عليه من التوحيد ، وما المشركون عليه من الشرك . قال ابن عباس : الحسنة لا إله إلا الله ، والسيئة الشرك . وقيل : الحسنة الطاعة ، والسيئة الشرك . وهو الأول بعينه . وقيل : الحسنة المداراة ، والسيئة الغلظة . وقيل : الحسنة العفو ، والسيئة الانتصار . وقال الضحاك : الحسنة العلم ، والسيئة الفحش . وقال علي بن أبي طالب - رضي الله عنه - : الحسنة حب آل الرسول ، والسيئة بغضهم .\nقوله تعالى : ادفع بالتي هي أحسن نسخت بآية السيف ، وبقي المستحب من ذلك : حسن العشرة والاحتمال والإغضاء . قال ابن عباس : أي : ادفع بحلمك جهل من يجهل عليك . وعنه أيضا : هو الرجل يسب الرجل فيقول الآخر : إن كنت صادقا فغفر الله لي ، وإن كنت كاذبا فغفر الله لك . وكذلك يروى في الأثر : أن أبا بكر الصديق - رضي الله عنه - قال ذلك لرجل نال منه . وقال مجاهد : بالتي هي أحسن يعني السلام إذا لقي من يعاديه ، وقاله عطاء . وقول ثالث ذكره القاضي أبو بكر بن العربي في الأحكام وهو المصافحة . وفي الأثر : ( تصافحوا يذهب الغل ) . ولم ير مالك المصافحة ، وقد اجتمع مع سفيان فتكلما فيها فقال سفيان : قد صافح رسول الله - صلى الله عليه وسلم - جعفرا حين قدم من أرض الحبشة ، فقال له مالك : ذلك خاص . فقال له سفيان : ما خص رسول الله - صلى الله عليه وسلم - يخصنا ، وما عمه يعمنا ، والمصافحة ثابتة فلا وجه لإنكارها . وقد روى قتادة قال قلت لأنس : هل كانت المصافحة في أصحاب رسول الله صلى الله عليه وسلم ؟ قال : نعم . وهو حديث صحيح . وفي الأثر : من تمام المحبة الأخذ باليد . ومن حديث محمد بن إسحاق وهو إمام مقدم ، عن الزهري عن عروة عن عائشة قالت : قدم زيد بن حارثة المدينة ورسول الله - صلى الله عليه وسلم - في بيتي ، فقرع الباب فقام إليه رسول الله - صلى الله عليه وسلم - عريانا يجر ثوبه - والله ما رأيته عريانا قبله ولا بعده - فاعتنقه وقبله .\nقلت : قد روي عن مالك جواز المصافحة وعليها جماعة من العلماء . وقد مضى ذلك في \" يوسف \" وذكرنا هناك حديث البراء بن عازب قال : قال رسول الله - صلى الله عليه وسلم - : ما من مسلمين يلتقيان فيأخذ أحدهما بيد صاحبه مودة بينهما ونصيحة إلا ألقيت ذنوبهما بينهما .\nقوله تعالى : فإذا الذي بينك وبينه عداوة كأنه ولي حميم أي قريب صديق . قال مقاتل : نزلت في أبي سفيان بن حرب ، كان مؤذيا للنبي - صلى الله عليه وسلم - ، فصار له وليا بعد أن كان عدوا بالمصاهرة التي وقعت بينه وبين النبي - صلى الله عليه وسلم - ، ثم أسلم فصار وليا في الإسلام حميما بالقرابة . وقيل : هذه الآية نزلت في أبي جهل بن هشام ، كان يؤذي النبي - صلى الله عليه وسلم - ، فأمره الله تعالى بالصبر عليه والصفح عنه ، ذكره الماوردي . والأول ذكره الثعلبي والقشيري وهو أظهر ، لقوله تعالى : فإذا الذي بينك وبينه عداوة كأنه ولي حميم . وقيل : كان هذا قبل الأمر بالقتال . قال ابن عباس : أمره الله تعالى في هذه الآية بالصبر عند الغضب ، والحلم عند الجهل ، والعفو عند الإساءة ، فإذا فعل الناس ذلك عصمهم الله من الشيطان ، وخضع لهم عدوهم . وروي أن رجلا شتم قنبرا مولى علي بن أبي طالب فناداه علي : يا قنبر ! دع شاتمك ، واله عنه ترضي الرحمن وتسخط الشيطان ، وتعاقب شاتمك ، فما عوقب الأحمق بمثل السكوت عنه . وأنشدوا :\nوللكف عن شتم اللئيم تكرما أضر له من شتمه حين يشتم\nوقال آخر :\nوما شيء أحب إلى سفيه إذا سب الكريم من الجواب\nمتاركة السفيه بلا جواب أشد على السفيه من السباب\nوقال محمود الوراق :\nسألزم نفسي الصفح عن كل مذنب وإن كثرت منه لدي الجرائم\nفما الناس إلا واحد من ثلاثة شريف ومشروف ومثل مقاوم\nفأما الذي فوقي فأعرف قدره وأتبع فيه الحق والحق لازم\nوأما الذي دوني فإن قال صنت عن إجابته عرضي وإن لام لائم\nوأما الذي مثلي فإن زل أو هفا تفضلت إن الفضل بالحلم حاكم\n                                    ",
      "saadi": "وَلَا تَسۡتَوِي ٱلۡحَسَنَةُ وَلَا ٱلسَّيِّئَةُۚ ٱدۡفَعۡ بِٱلَّتِي هِيَ أَحۡسَنُ فَإِذَا ٱلَّذِي بَيۡنَكَ وَبَيۡنَهُۥ عَدَٰوَةٞ كَأَنَّهُۥ وَلِيٌّ حَمِيمٞ ٤٣\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ } أي: لا يستوي فعل الحسنات والطاعات لأجل رضا الله تعالى، ولا فعل السيئات والمعاصي التي تسخطه ولا ترضيه، ولا يستوي الإحسان إلى الخلق، ولا الإساءة إليهم، لا في ذاتها، ولا في وصفها، ولا في جزائها { هَلْ جَزَاءُ الْإِحْسَانِ إِلَّا الْإِحْسَانُ }\nثم أمر بإحسان خاص، له موقع كبير، وهو الإحسان إلى من أساء إليك، فقال: { ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ } أي: فإذا أساء إليك مسيء من الخلق، خصوصًا من له حق كبير عليك، كالأقارب، والأصحاب، ونحوهم، إساءة بالقول أو بالفعل، فقابله بالإحسان إليه، فإن قطعك فَصلْهُ، وإن ظلمك، فاعف عنه، وإن تكلم فيك، غائبًا أو حاضرًا، فلا تقابله، بل اعف عنه، وعامله بالقول اللين. وإن هجرك، وترك خطابك، فَطيِّبْ له الكلام، وابذل له السلام، فإذا قابلت الإساءة بالإحسان، حصل فائدة عظيمة.\n{ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ } أي: كأنه قريب شفيق.\n                                    "
    }
  },
  {
    "id": 34,
    "versesNumber": 35,
    "souraName": "Fussilat.html",
    "contnent": "وَمَا يُلَقَّىٰهَآ إِلَّا ٱلَّذِينَ صَبَرُواْ وَمَا يُلَقَّىٰهَآ إِلَّا ذُو حَظٍّ عَظِيمٖ ٥٣",
    "tafsier": {
      "ibnkther": "وَمَا يُلَقَّىٰهَآ إِلَّا ٱلَّذِينَ صَبَرُواْ وَمَا يُلَقَّىٰهَآ إِلَّا ذُو حَظٍّ عَظِيمٖ ٥٣\n                                    \n                                    \n                                    ثم قال : ( وما يلقاها إلا الذين صبروا ) أي : وما يقبل هذه الوصية ويعمل بها إلا من صبر على ذلك ، فإنه يشق على النفوس ، ( وما يلقاها إلا ذو حظ عظيم ) أي : ذو نصيب وافر من السعادة في الدنيا والأخرى .\nقال علي بن أبي طلحة ، عن ابن عباس في تفسير هذه الآية : أمر الله المؤمنين بالصبر عند الغضب ، والحلم عند الجهل ، والعفو عند الإساءة ، فإذا فعلوا ذلك عصمهم الله من الشيطان ، وخضع لهم عدوهم كأنه ولي حميم .\n                                    ",
      "qortoby": "وَمَا يُلَقَّىٰهَآ إِلَّا ٱلَّذِينَ صَبَرُواْ وَمَا يُلَقَّىٰهَآ إِلَّا ذُو حَظٍّ عَظِيمٖ ٥٣\n                                    \n                                    \n                                    \" وما يلقاها \" يعني هذه الفعلة الكريمة والخصلة الشريفة إلا الذين صبروا بكظم الغيظ واحتمال الأذى . وما يلقاها إلا ذو حظ عظيم أي نصيب وافر من الخير ، قاله ابن عباس . وقال قتادة ومجاهد : الحظ العظيم الجنة . قال الحسن : والله ما عظم حظ قط دون الجنة . وقيل : الكناية في يلقاها عن الجنة ، أي : ما يلقاها إلا الصابرون ، والمعنى متقارب .\n                                    ",
      "saadi": "وَمَا يُلَقَّىٰهَآ إِلَّا ٱلَّذِينَ صَبَرُواْ وَمَا يُلَقَّىٰهَآ إِلَّا ذُو حَظٍّ عَظِيمٖ ٥٣\n                                        \n                                        \n                                        \n                                        { وَمَا يُلَقَّاهَا } أي: وما يوفق لهذه الخصلة الحميدة { إِلَّا الَّذِينَ صَبَرُوا } نفوسهم على ما تكره، وأجبروها على ما يحبه الله، فإن النفوس مجبولة على مقابلة المسيء بإساءته وعدم العفو عنه، فكيف بالإحسان؟\".\nفإذا صبر الإنسان نفسه، وامتثل أمر ربه، وعرف جزيل الثواب، وعلم أن مقابلته للمسيء بجنس عمله، لا يفيده شيئًا، ولا يزيد العداوة إلا شدة، وأن إحسانه إليه، ليس بواضع قدره، بل من تواضع للّه رفعه، هان عليه الأمر، وفعل ذلك، متلذذًا مستحليًا له.\n{ وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ } لكونها من خصال خواص الخلق، التي ينال بها العبد الرفعة في الدنيا والآخرة، التي هي من أكبر خصال مكارم الأخلاق.\n                                    "
    }
  },
  {
    "id": 35,
    "versesNumber": 36,
    "souraName": "Fussilat.html",
    "contnent": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٦٣",
    "tafsier": {
      "ibnkther": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٦٣\n                                    \n                                    \n                                    وقوله : ( وإما ينزغنك من الشيطان نزغ فاستعذ بالله ) أي : إن شيطان الإنس ربما ينخدع بالإحسان إليه ، فأما شيطان الجن فإنه لا حيلة فيه إذا وسوس إلا الاستعاذة بخالقه الذي سلطه عليك ، فإذا استعذت بالله ولجأت إليه ، كفه عنك ورد كيده . وقد كان رسول الله - صلى الله عليه وسلم - : إذا قام إلى الصلاة يقول : \" أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه \" .\nوقد قدمنا أن هذا المقام لا نظير له في القرآن إلا في \" سورة الأعراف \" عند قوله : ( خذ العفو وأمر بالعرف وأعرض عن الجاهلين وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه سميع عليم ) [ الأعراف : 199 ، 200 ] ، وفي سورة المؤمنين عند قوله : ( ادفع بالتي هي أحسن السيئة نحن أعلم بما يصفون وقل رب أعوذ بك من همزات الشياطين وأعوذ بك رب أن يحضرون ) [ المؤمنون : 96 - 98 ] .\n[ لكن الذي ذكر في الأعراف أخف على النفس مما ذكر في سورة السجدة ; لأن الإعراض عن الجاهل وتركه أخف على النفس من الإحسان إلى المسيء فتتلذذ النفس من ذلك ولا انتقاد له إلا بمعالجة ويساعدها الشيطان في هذه الحال ، فتنفعل له وتستعصي على صاحبها ، فتحتاج إلى مجاهدة وقوة إيمان ; فلهذا أكد ذلك هاهنا بضمير الفصل والتعريف باللام فقال : ( فاستعذ بالله إنه هو السميع العليم ) ] .\n                                    ",
      "qortoby": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٦٣\n                                    \n                                    \n                                    قوله تعالى : وإما ينزغنك من الشيطان نزغ تقدم في آخر الأعراف مستوفى . فاستعذ بالله من كيده وشره \" إنه هو السميع \" لاستعاذتك \" العليم \" بأفعالك وأقوالك .\n                                    ",
      "saadi": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٦٣\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى ما يقابل به العدو من الإنس، وهو مقابلة إساءته بالإحسان، ذكر ما يدفع به العدو الجني، وهو الاستعاذة بالله، والاحتماء من شره فقال:\n{ وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ } أي: أي وقت من الأوقات، أحسست بشيء من نزغات الشيطان، أي: من وساوسه وتزيينه للشر، وتكسيله عن الخير، وإصابة ببعض الذنوب، وإطاعة له ببعض ما يأمر به { فَاسْتَعِذْ بِاللَّهِ } أي: اسأله، مفتقرًا إليه، أن يعيذك ويعصمك منه، { إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ } فإنه يسمع قولك وتضرعك، ويعلم حالك واضطرارك إلى عصمته وحمايته.\n                                    "
    }
  },
  {
    "id": 36,
    "versesNumber": 37,
    "souraName": "Fussilat.html",
    "contnent": "وَمِنۡ ءَايَٰتِهِ ٱلَّيۡلُ وَٱلنَّهَارُ وَٱلشَّمۡسُ وَٱلۡقَمَرُۚ لَا تَسۡجُدُواْ لِلشَّمۡسِ وَلَا لِلۡقَمَرِ وَٱسۡجُدُواْۤ لِلَّهِۤ ٱلَّذِي خَلَقَهُنَّ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٧٣",
    "tafsier": {
      "ibnkther": "وَمِنۡ ءَايَٰتِهِ ٱلَّيۡلُ وَٱلنَّهَارُ وَٱلشَّمۡسُ وَٱلۡقَمَرُۚ لَا تَسۡجُدُواْ لِلشَّمۡسِ وَلَا لِلۡقَمَرِ وَٱسۡجُدُواْۤ لِلَّهِۤ ٱلَّذِي خَلَقَهُنَّ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٧٣\n                                    \n                                    \n                                    يقول تعالى منبها خلقه على قدرته العظيمة ، وأنه الذي لا نظير له وأنه على ما يشاء قادر ، ( ومن آياته الليل والنهار والشمس والقمر ) أي : أنه خلق الليل بظلامه ، والنهار بضيائه ، وهما متعاقبان لا يقران ، والشمس ونورها وإشراقها ، والقمر وضياءه وتقدير منازله في فلكه ، واختلاف سيره في سمائه ؛ ليعرف باختلاف سيره وسير الشمس مقادير الليل والنهار ، والجمع والشهور والأعوام ، ويتبين بذلك حلول الحقوق ، وأوقات العبادات والمعاملات .\nثم لما كان الشمس والقمر أحسن الأجرام المشاهدة في العالم العلوي والسفلي ، نبه تعالى على أنهما مخلوقان عبدان من عبيده ، تحت قهره وتسخيره ، فقال : ( لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون ) أي : ولا تشركوا به فما تنفعكم عبادتكم له مع عبادتكم لغيره ، فإنه لا يغفر أن يشرك به ; ولهذا قال :\n                                    ",
      "qortoby": "وَمِنۡ ءَايَٰتِهِ ٱلَّيۡلُ وَٱلنَّهَارُ وَٱلشَّمۡسُ وَٱلۡقَمَرُۚ لَا تَسۡجُدُواْ لِلشَّمۡسِ وَلَا لِلۡقَمَرِ وَٱسۡجُدُواْۤ لِلَّهِۤ ٱلَّذِي خَلَقَهُنَّ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٧٣\n                                    \n                                    \n                                    قوله تعالى : \" ومن آياته \" علاماته الدالة على وحدانيته وقدرته الليل والنهار والشمس والقمر وقد مضى في غير موضع . ثم نهى عن السجود لهما ، لأنهما وإن كانا خلقين فليس ذلك لفضيلة لهما في أنفسهما فيستحقان بها العبادة مع الله ; لأن خالقهما هو الله ، ولو شاء لأعدمهما أو طمس نورهما . واسجدوا لله الذي خلقهن وصورهن وسخرهن ، فالكناية ترجع إلى الشمس والقمر والليل والنهار . وقيل : للشمس والقمر خاصة ; لأن الاثنين جمع . وقيل : الضمير عائد على معنى الآيات إن كنتم إياه تعبدون وإنما أنث على جمع التكثير ولم يجر على طريق التغليب للمذكر والمؤنث لأنه فيما لا يعقل . فإن استكبروا يعني الكفار عن السجود لله فالذين عند ربك من الملائكة يسبحون له بالليل والنهار وهم لا يسأمون أي لا يملون عبادته . قال زهير :\nسئمت تكاليف الحياة ومن يعش ثمانين حولا لا أبا لك يسأم\nمسألة : هذه الآية آية سجدة بلا خلاف ، واختلفوا في موضع السجود منها . فقال مالك : موضعه إن كنتم إياه تعبدون ; لأنه متصل بالأمر . وكان علي وابن مسعود وغيرهم يسجدون عند قوله : تعبدون . وقال ابن وهب والشافعي : موضعه \" وهم لا يسأمون \" لأنه تمام الكلام وغاية العبادة والامتثال . وبه قال أبو حنيفة . وكان ابن عباس يسجد عند قوله : يسأمون . وقال ابن عمر : اسجدوا بالآخرة منهما . وكذلك يروى عن مسروق وأبي عبد الرحمن السلمي وإبراهيم النخعي وأبي صالح ويحيى بن وثاب وطلحة وزبيد الياميين والحسن وابن سيرين . وكان أبو وائل وقتادة وبكر بن عبد الله يسجدون عند قوله : يسأمون . قال ابن العربي : والأمر قريب .\nمسألة : ذكر ابن خويز منداد : أن هذه الآية تضمنت صلاة كسوف القمر والشمس ، وذلك أن العرب كانت تقول : إن الشمس والقمر لا يكسفان إلا لموت عظيم ، فصلى النبي - صلى الله عليه وسلم - صلاة الكسوف .\nقلت : صلاة الكسوف ثابتة في الصحاح البخاري ومسلم وغيرهما . واختلفوا في كيفيتها اختلافا كثيرا ، لاختلاف الآثار ، وحسبك ما في صحيح مسلم من ذلك ، وهو العمدة في الباب . والله الموفق للصواب .\n                                    ",
      "saadi": "وَمِنۡ ءَايَٰتِهِ ٱلَّيۡلُ وَٱلنَّهَارُ وَٱلشَّمۡسُ وَٱلۡقَمَرُۚ لَا تَسۡجُدُواْ لِلشَّمۡسِ وَلَا لِلۡقَمَرِ وَٱسۡجُدُواْۤ لِلَّهِۤ ٱلَّذِي خَلَقَهُنَّ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٧٣\n                                        \n                                        \n                                        \n                                        ثم ذكر تعالى أن { مِنْ آيَاتِهِ } الدالة على كمال قدرته، ونفوذ مشيئته، وسعة سلطانه، ورحمته بعباده، وأنه الله وحده لا شريك له { اللَّيْلُ وَالنَّهَارُ } هذا بمنفعة ضيائه، وتصرف العباد فيه، وهذا بمنفعه ظلمه، وسكون الخلق فيه. { وَالشَّمْسُ وَالْقَمَرُ } اللذان لا تستقيم معايش العباد، ولا أبدانهم، ولا أبدان حيواناتهم، إلا بهما، وبهما من المصالح ما لا يحصى عدده.\n{ لَا تَسْجُدُوا لِلشَّمْسِ وَلَا لِلْقَمَرِ } فإنهما مدبران مسخران مخلوقان. { وَاسْجُدُوا لِلَّهِ الذي خلقهن } أي: اعبدوه وحده، لأنه الخالق العظيم، ودعوا عبادة ما سواه، من المخلوقات، وإن كبر، جرمه وكثرت مصالحه، فإن ذلك ليس منه، وإنما هو من خالقه، تبارك وتعالى. { إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ } فخصوه بالعبادة وإخلاص الدين له.\n                                    "
    }
  },
  {
    "id": 37,
    "versesNumber": 38,
    "souraName": "Fussilat.html",
    "contnent": "فَإِنِ ٱسۡتَكۡبَرُواْ فَٱلَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِٱلَّيۡلِ وَٱلنَّهَارِ وَهُمۡ لَا يَسۡ‍َٔمُونَ ۩ ٨٣",
    "tafsier": {
      "ibnkther": "فَإِنِ ٱسۡتَكۡبَرُواْ فَٱلَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِٱلَّيۡلِ وَٱلنَّهَارِ وَهُمۡ لَا يَسۡ‍َٔمُونَ ۩ ٨٣\n                                    \n                                    \n                                    ( فإن استكبروا ) أي : عن إفراد العبادة له وأبوا إلا أن يشركوا معه غيره ، ( فالذين عند ربك ) يعني الملائكة ، ( يسبحون له بالليل والنهار وهم لا يسأمون ) ، كقوله ( فإن يكفر بها هؤلاء فقد وكلنا بها قوما ليسوا بها بكافرين ) [ الأنعام : 89 ] .\nوقال الحافظ أبو يعلى : حدثنا سفيان - يعني ابن وكيع - حدثنا أبي ، عن ابن أبي ليلى ، عن أبي الزبير ، عن جابر قال : قال رسول الله - صلى الله عليه وسلم - : \" لا تسبوا الليل ولا النهار ، ولا الشمس ولا القمر ، ولا الرياح فإنها ترسل رحمة لقوم ، وعذابا لقوم \" .\n                                    ",
      "qortoby": "فَإِنِ ٱسۡتَكۡبَرُواْ فَٱلَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِٱلَّيۡلِ وَٱلنَّهَارِ وَهُمۡ لَا يَسۡ‍َٔمُونَ ۩ ٨٣\n                                    \n                                    \n                                    فَإِنِ اسْتَكْبَرُوا\nيعني الكفار عن السجود للهفَالَّذِينَ عِنْدَ رَبِّكَ\nمن الملائكةيُسَبِّحُونَ لَهُ بِاللَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْأَمُونَ\nأي لا يملون عبادته .\nقال زهير : سئمت تكاليف الحياة ومن يعش ثمانين حولا لا أبا لك يسأم\n                                    ",
      "saadi": "فَإِنِ ٱسۡتَكۡبَرُواْ فَٱلَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِٱلَّيۡلِ وَٱلنَّهَارِ وَهُمۡ لَا يَسۡ‍َٔمُونَ ۩ ٨٣\n                                        \n                                        \n                                        \n                                        { فَإِنِ اسْتَكْبَرُوا } عن عبادة الله تعالى، ولم ينقادوا لها، فإنهم لن يضروا الله شيئًا، والله غني عنهم، وله عباد مكرمون، لا يعصون الله ما أمرهم، ويفعلون ما يؤمرون، ولهذا قال: { فَالَّذِينَ عِنْدَ رَبِّكَ } يعني: الملائكة المقربين { يُسَبِّحُونَ لَهُ بِاللَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْأَمُونَ } أي: لا يملون من عبادته، لقوتهم، وشدة الداعي القوي منهم إلى ذلك.\n                                    "
    }
  },
  {
    "id": 38,
    "versesNumber": 39,
    "souraName": "Fussilat.html",
    "contnent": "وَمِنۡ ءَايَٰتِهِۦٓ أَنَّكَ تَرَى ٱلۡأَرۡضَ خَٰشِعَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡۚ إِنَّ ٱلَّذِيٓ أَحۡيَاهَا لَمُحۡيِ ٱلۡمَوۡتَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٣",
    "tafsier": {
      "ibnkther": "وَمِنۡ ءَايَٰتِهِۦٓ أَنَّكَ تَرَى ٱلۡأَرۡضَ خَٰشِعَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡۚ إِنَّ ٱلَّذِيٓ أَحۡيَاهَا لَمُحۡيِ ٱلۡمَوۡتَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٣\n                                    \n                                    \n                                    وقوله : ( ومن آياته ) أي : على قدرته على إعادة الموتى ( أنك ترى الأرض خاشعة ) أي : هامدة لا نبات فيها ، بل هي ميتة ( فإذا أنزلنا عليها الماء اهتزت وربت ) أي : أخرجت من جميل ألوان الزروع والثمار ، ( إن الذي أحياها لمحيي الموتى إنه على كل شيء قدير )\n                                    ",
      "qortoby": "وَمِنۡ ءَايَٰتِهِۦٓ أَنَّكَ تَرَى ٱلۡأَرۡضَ خَٰشِعَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡۚ إِنَّ ٱلَّذِيٓ أَحۡيَاهَا لَمُحۡيِ ٱلۡمَوۡتَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٣\n                                    \n                                    \n                                    قوله تعالى : ومن آياته أنك ترى الأرض خاشعة الخطاب لكل عاقل أي : ومن آياته الدالة على أنه يحيي الموتى أنك ترى الأرض خاشعة أي : يابسة جدبة ، هذا وصف الأرض بالخشوع ، قال النابغة :\nرماد ككحل العين لأيا أبينه ونؤي كجذم الحوض أثلم خاشع\nوالأرض الخاشعة : الغبراء التي تنبت . وبلدة خاشعة : أي : مغبرة لا منزل بها . ومكان خاشع . فإذا أنزلنا عليها الماء اهتزت أي بالنبات ، قاله مجاهد . يقال : اهتز الإنسان أي : تحرك ، ومنه :\nتراه كنصل السيف يهتز للندى إذا لم تجد عند امرئ السوء مطمعا\nوربت أي انتفخت وعلت قبل أن تنبت ، قاله مجاهد . أي : تصعدت عن النبات بعد موتها . وعلى هذا التقدير يكون في الكلام تقديم وتأخير وتقديره : ربت واهتزت . والاهتزاز والربو قد يكونان قبل الخروج من الأرض ، وقد يكونان بعد خروج النبات إلى وجه الأرض ، فربوها ارتفاعها . ويقال للموضع المرتفع : ربوة ورابية ، فالنبات يتحرك للبروز ثم يزداد في جسمه بالكبر طولا وعرضا . وقرأ أبو جعفر وخالد \" وربأت \" ومعناه عظمت ، من الربيئة . وقيل : اهتزت أي : استبشرت بالمطر وربت أي : انتفخت بالنبات . والأرض إذا انشقت بالنبات : وصفت بالضحك ، فيجوز وصفها بالاستبشار أيضا . ويجوز أن يقال : الربو والاهتزاز واحد ، وهي حالة خروج النبات . وقد مضى هذا المعنى في \" الحج \"\nإن الذي أحياها لمحيي الموتى إنه على كل شيء قدير تقدم في غير موضع .\n                                    ",
      "saadi": "وَمِنۡ ءَايَٰتِهِۦٓ أَنَّكَ تَرَى ٱلۡأَرۡضَ خَٰشِعَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡۚ إِنَّ ٱلَّذِيٓ أَحۡيَاهَا لَمُحۡيِ ٱلۡمَوۡتَىٰٓۚ إِنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٣\n                                        \n                                        \n                                        \n                                        { وَمِنْ آيَاتِهِ } الدالة على كمال قدرته، وانفراده بالملك والتدبير والوحدانية، { أَنَّكَ تَرَى الْأَرْضَ خَاشِعَةً } أي: لا نبات فيها { فَإِذَا أَنْزَلْنَا عَلَيْهَا الْمَاءَ } أي: المطر { اهْتَزَّتْ } أي: تحركت بالنبات { وَرَبَتْ } ثم: أنبتت من كل زوج بهيج، فيحيي به العباد والبلاد.\n{ إِنَّ الَّذِي أَحْيَاهَا } بعد موتها وهمودها، { لَمُحْيِي الْمَوْتَى } من قبورهم إلى يوم بعثهم، ونشورهم { إِنَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ } فكما لم تعجز قدرته عن إحياء الأرض بعد موتها، لا تعجز عن إحياء الموتى.\n                                    "
    }
  },
  {
    "id": 39,
    "versesNumber": 40,
    "souraName": "Fussilat.html",
    "contnent": "إِنَّ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ ءَايَٰتِنَا لَا يَخۡفَوۡنَ عَلَيۡنَآۗ أَفَمَن يُلۡقَىٰ فِي ٱلنَّارِ خَيۡرٌ أَم مَّن يَأۡتِيٓ ءَامِنٗا يَوۡمَ ٱلۡقِيَٰمَةِۚ ٱعۡمَلُواْ مَا شِئۡتُمۡ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٌ ٠٤",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ ءَايَٰتِنَا لَا يَخۡفَوۡنَ عَلَيۡنَآۗ أَفَمَن يُلۡقَىٰ فِي ٱلنَّارِ خَيۡرٌ أَم مَّن يَأۡتِيٓ ءَامِنٗا يَوۡمَ ٱلۡقِيَٰمَةِۚ ٱعۡمَلُواْ مَا شِئۡتُمۡ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٌ ٠٤\n                                    \n                                    \n                                    قوله : ( إن الذين يلحدون في آياتنا ) ، قال ابن عباس : الإلحاد : وضع الكلام على غير مواضعه .\nوقال قتادة وغيره : هو الكفر والعناد .\nوقوله : ( لا يخفون علينا ) أي : فيه تهديد شديد ، ووعيد أكيد ، أي : إنه تعالى عالم بمن يلحد في آياته وأسمائه وصفاته ، وسيجزيه على ذلك بالعقوبة والنكال ; ولهذا قال : ( أفمن يلقى في النار خير أم من يأتي آمنا يوم القيامة ) ؟ أي : أيستوي هذا وهذا ؟ لا يستويان .\nثم قال - عز وجل - تهديدا للكفرة : ( اعملوا ما شئتم ) قال مجاهد ، والضحاك ، وعطاء الخراساني : ( اعملوا ما شئتم ) : وعيد ، أي : من خير أو شر ، إنه عليم بكم وبصير بأعمالكم ; ولهذا قال : ( إنه بما تعملون بصير )\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ ءَايَٰتِنَا لَا يَخۡفَوۡنَ عَلَيۡنَآۗ أَفَمَن يُلۡقَىٰ فِي ٱلنَّارِ خَيۡرٌ أَم مَّن يَأۡتِيٓ ءَامِنٗا يَوۡمَ ٱلۡقِيَٰمَةِۚ ٱعۡمَلُواْ مَا شِئۡتُمۡ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٌ ٠٤\n                                    \n                                    \n                                    قوله تعالى : إن الذين يلحدون في آياتنا أي يميلون عن الحق في أدلتنا . والإلحاد : الميل والعدول . ومنه اللحد في القبر ; لأنه أميل إلى ناحية منه . يقال : ألحد في دين الله أي : حاد عنه وعدل . ولحد لغة فيه . وهذا يرجع إلى الذين قالوا : لا تسمعوا لهذا القرآن والغوا فيه وهم الذين ألحدوا في آياته ومالوا عن الحق فقالوا : ليس القرآن من عند الله ، أو هو شعر أو سحر ، فالآيات آيات القرآن . قال مجاهد : يلحدون في آياتنا أي : عند تلاوة القرآن بالمكاء والتصدية واللغو والغناء . وقال ابن عباس : هو تبديل الكلام ووضعه في غير موضعه . وقال قتادة : يلحدون في آياتنا يكذبون في آياتنا . وقال السدي : يعاندون ويشاقون . وقال ابن زيد : يشركون ويكذبون . والمعنى متقارب . وقال مقاتل : نزلت في أبي جهل . وقيل : الآيات المعجزات ، وهو يرجع إلى الأول ؛ فإن القرآن معجز .\nأفمن يلقى في النار على وجهه وهو أبو جهل في قول ابن عباس وغيره . خير أم من يأتي آمنا يوم القيامة قيل : النبي صلى الله عليه وسلم ، قاله مقاتل . وقيل : عثمان وقيل : عمار بن ياسر . وقيل : حمزة . وقيل : عمر بن الخطاب . وقيل : أبو سلمة بن عبد الأسد المخزومي . وقيل : المؤمنون . وقيل : إنها على العموم ، فالذي يلقى في النار الكافر ، والذي يأتي آمنا يوم القيامة المؤمن ، قاله ابن بحر . اعملوا ما شئتم أمر تهديد ، أي : بعد ما علمتم أنهما لا يستويان فلا بد لكم من الجزاء . إنه بما تعملون بصير وعيد بتهديد وتوعد .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ ءَايَٰتِنَا لَا يَخۡفَوۡنَ عَلَيۡنَآۗ أَفَمَن يُلۡقَىٰ فِي ٱلنَّارِ خَيۡرٌ أَم مَّن يَأۡتِيٓ ءَامِنٗا يَوۡمَ ٱلۡقِيَٰمَةِۚ ٱعۡمَلُواْ مَا شِئۡتُمۡ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٌ ٠٤\n                                        \n                                        \n                                        \n                                        الإلحاد في آيات الله: الميل بها عن الصواب، بأي وجه كان: إما بإنكارها وجحودها، وتكذيب من جاء بها، وإما بتحريفها وتصريفها عن معناها الحقيقي، وإثبات معان لها، ما أرادها الله منها.\nفتوعَّد تعالى من ألحد فيها بأنه لا يخفى عليه، بل هو مطلع على ظاهره وباطنه، وسيجازيه على إلحاده بما كان يعمل، ولهذا قال: { أَفَمَنْ يُلْقَى فِي النَّارِ } مثل الملحد بآيات الله { خَيْرٌ أَمْ مَنْ يَأْتِي آمِنًا يَوْمَ الْقِيَامَةِ } من عذاب الله مستحقًا لثوابه؟ من المعلوم أن هذا خير.\nلما تبين الحق من الباطل، والطريق المنجي من عذابه من الطريق المهلك قال: { اعْمَلُوا مَا شِئْتُمْ } إن شئتم، فاسلكوا طريق الرشد الموصلة إلى رضا ربكم وجنته، وإن شئتم، فاسلكوا طريق الغيِّ المسخطة لربكم، الموصلة إلى دار الشقاء.\n{ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ } يجازيكم بحسب أحوالكم وأعمالكم، كقوله تعالى: { وَقُلِ الْحَقُّ مِنْ رَبِّكُمْ فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ }\n                                    "
    }
  },
  {
    "id": 40,
    "versesNumber": 41,
    "souraName": "Fussilat.html",
    "contnent": "إِنَّ ٱلَّذِينَ كَفَرُواْ بِٱلذِّكۡرِ لَمَّا جَآءَهُمۡۖ وَإِنَّهُۥ لَكِتَٰبٌ عَزِيزٞ ١٤",
    "tafsier": {
      "ibnkther": "إِنَّ ٱلَّذِينَ كَفَرُواْ بِٱلذِّكۡرِ لَمَّا جَآءَهُمۡۖ وَإِنَّهُۥ لَكِتَٰبٌ عَزِيزٞ ١٤\n                                    \n                                    \n                                    ثم قال : ( إن الذين كفروا بالذكر لما جاءهم ) قال الضحاك ، والسدي ، وقتادة : وهو القرآن ( وإنه لكتاب عزيز ) أي : منيع الجناب ، لا يرام أن يأتي أحد بمثله .\n                                    ",
      "qortoby": "إِنَّ ٱلَّذِينَ كَفَرُواْ بِٱلذِّكۡرِ لَمَّا جَآءَهُمۡۖ وَإِنَّهُۥ لَكِتَٰبٌ عَزِيزٞ ١٤\n                                    \n                                    \n                                        قوله تعالى : إن الذين كفروا بالذكر لما جاءهم الذكر هاهنا القرآن في قول الجميع ; لأن فيه ذكر ما يحتاج إليه من الأحكام . والخبر محذوف تقديره هالكون أومعذبون . وقيل : الخبر أولئك ينادون من مكان بعيد واعترض قوله : \" ما يقال لك \" ثم رجع إلى الذكر فقال : ولو جعلناه قرآنا أعجميا ثم قال : أولئك ينادون والأول الاختيار ، قال النحاس : عند النحويين جميعا فيما علمت .\nوإنه لكتاب عزيز أي عزيز على الله ، قاله ابن عباس ، وعنه : عزيز من عند الله . وقيل : كريم على الله . وقيل : عزيز أي : أعزه الله فلا يتطرق إليه باطل . وقيل : ينبغي أن يعز ويجل وألا يلغى فيه . وقيل : عزيز من الشيطان أن يبدله ، قاله السدي . مقاتل : منع من الشيطان والباطل . السدي : غير مخلوق فلا مثل له . وقال ابن عباس أيضا : عزيز أي : ممتنع عن الناس أن يقولوا مثله .\n                                    ",
      "saadi": "إِنَّ ٱلَّذِينَ كَفَرُواْ بِٱلذِّكۡرِ لَمَّا جَآءَهُمۡۖ وَإِنَّهُۥ لَكِتَٰبٌ عَزِيزٞ ١٤\n                                        \n                                        \n                                        \n                                        ثم قال تعالى: { إِنَّ الَّذِينَ كَفَرُوا بِالذِّكْرِ } أي: يجحدون القرآن الكريم المذكر للعباد جميع مصالحهم الدينية والدنيوية والأخروية، المُعلي لقدر من اتبعه، { لَمَّا جَاءَهُمْ } نعمة من ربهم على يد أفضل الخلق وأكملهم. { و } الحال { إِنَّهُ لَكِتَابٌ } جامع لأوصاف الكمال { عَزِيزٌ } أي: منيع من كل من أراده بتحريف أو سوء.\n                                    "
    }
  },
  {
    "id": 41,
    "versesNumber": 42,
    "souraName": "Fussilat.html",
    "contnent": "لَّا يَأۡتِيهِ ٱلۡبَٰطِلُ مِنۢ بَيۡنِ يَدَيۡهِ وَلَا مِنۡ خَلۡفِهِۦۖ تَنزِيلٞ مِّنۡ حَكِيمٍ حَمِيدٖ ٢٤",
    "tafsier": {
      "ibnkther": "لَّا يَأۡتِيهِ ٱلۡبَٰطِلُ مِنۢ بَيۡنِ يَدَيۡهِ وَلَا مِنۡ خَلۡفِهِۦۖ تَنزِيلٞ مِّنۡ حَكِيمٍ حَمِيدٖ ٢٤\n                                    \n                                    \n                                    ( لا يأتيه الباطل من بين يديه ولا من خلفه ) أي : ليس للبطلان إليه سبيل ; لأنه منزل من رب العالمين ; ولهذا قال : ( تنزيل من حكيم حميد ) أي : حكيم في أقواله وأفعاله ، حميد بمعنى محمود ، أي : في جميع ما يأمر به وينهى عنه ، الجميع محمودة عواقبه وغاياته .\n                                    ",
      "qortoby": "لَّا يَأۡتِيهِ ٱلۡبَٰطِلُ مِنۢ بَيۡنِ يَدَيۡهِ وَلَا مِنۡ خَلۡفِهِۦۖ تَنزِيلٞ مِّنۡ حَكِيمٍ حَمِيدٖ ٢٤\n                                    \n                                    \n                                    لا يأتيه الباطل من بين يديه ولا من خلفه أي لا يكذبه شيء مما أنزل الله من قبل ، ولا ينزل من بعده يبطله وينسخه ، قاله الكلبي . وقال السدي وقتادة : لا يأتيه الباطل يعني الشيطان من بين يديه ولا من خلفه لا يستطيع أن يغير ولا يزيد ولا ينقص . وقال سعيد بن جبير : لا يأتيه التكذيب من بين يديه ولا من خلفه ابن جريج : لا يأتيه الباطل فيما أخبر عما مضى ولا فيما أخبر عما يكون . وعن ابن عباس : من بين يديه من الله تعالى : ولا من خلفه يريد من جبريل - صلى الله عليه وسلم - ، ولا من محمد صلى الله عليه وسلم .\nتنزيل من حكيم حميد ابن عباس : حكيم في خلقه حميد إليهم . قتادة : حكيم في أمره حميد إلى خلقه .\n                                    ",
      "saadi": "لَّا يَأۡتِيهِ ٱلۡبَٰطِلُ مِنۢ بَيۡنِ يَدَيۡهِ وَلَا مِنۡ خَلۡفِهِۦۖ تَنزِيلٞ مِّنۡ حَكِيمٍ حَمِيدٖ ٢٤\n                                        \n                                        \n                                        \n                                        { لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ } أي: لا يقربه شيطان من شياطين الإنس والجن، لا بسرقة، ولا بإدخال ما ليس منه به، ولا بزيادة ولا نقص، فهو محفوظ في تنزيله، محفوظة ألفاظه ومعانيه، قد تكفل من أنزله بحفظه كما قال تعالى: { إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ }\n{ تَنْزِيلٌ مِنْ حَكِيمٍ } في خلقه وأمره، يضع كل شيء موضعه، وينزله منازله. { حَمِيدٌ } على ما له من صفات الكمال، ونعوت الجلال، وعلى ما له من العدل والإفضال، فلهذا كان كتابه، مشتملاً على تمام الحكمة، وعلى تحصيل المصالح والمنافع، ودفع المفاسد والمضار، التي يحمد عليها.\n                                    "
    }
  },
  {
    "id": 42,
    "versesNumber": 43,
    "souraName": "Fussilat.html",
    "contnent": "مَّا يُقَالُ لَكَ إِلَّا مَا قَدۡ قِيلَ لِلرُّسُلِ مِن قَبۡلِكَۚ إِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ وَذُو عِقَابٍ أَلِيمٖ ٣٤",
    "tafsier": {
      "ibnkther": "مَّا يُقَالُ لَكَ إِلَّا مَا قَدۡ قِيلَ لِلرُّسُلِ مِن قَبۡلِكَۚ إِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ وَذُو عِقَابٍ أَلِيمٖ ٣٤\n                                    \n                                    \n                                    ثم قال : ( ما يقال لك إلا ما قد قيل للرسل من قبلك ) قال قتادة ، والسدي ، وغيرهما : ما يقال لك من التكذيب إلا كما قد قيل للرسل من قبلك ، فكما قد كذبت فقد كذبوا ، وكما صبروا على أذى قومهم لهم ، فاصبر أنت على أذى قومك لك . وهذا اختيار ابن جرير ، ولم يحك هو ، ولا ابن أبي حاتم غيره .\nوقوله : ( إن ربك لذو مغفرة للناس ) أي : لمن تاب إليه ( وذو عقاب أليم ) أي : لمن استمر على كفره ، وطغيانه ، وعناده ، وشقاقه ومخالفته .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا موسى بن إسماعيل ، حدثنا حماد ، عن علي بن زيد عن سعيد بن المسيب قال : لما نزلت هذه الآية : ( إن ربك لذو مغفرة ) قال رسول الله - صلى الله عليه وسلم - : \" لولا غفر الله وتجاوزه ما هنأ أحدا العيش ، ولولا وعيده وعقابه لاتكل كل أحد \" .\n                                    ",
      "qortoby": "مَّا يُقَالُ لَكَ إِلَّا مَا قَدۡ قِيلَ لِلرُّسُلِ مِن قَبۡلِكَۚ إِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ وَذُو عِقَابٍ أَلِيمٖ ٣٤\n                                    \n                                    \n                                    قوله تعالى : ما يقال لك أي من الأذى والتكذيب إلا ما قد قيل للرسل من قبلك يعزي نبيه ويسليه \" إن ربك لذو مغفرة \" لك ولأصحابك \" وذو عقاب أليم \" يريد لأعدائك وجيعا . وقيل : أي : ما يقال لك من إخلاص العبادة لله إلا ما قد أوحي إلى من قبلك ، ولا خلاف بين الشرائع فيما يتعلق بالتوحيد ، وهو كقوله : ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك أي : لم تدعهم إلا ما تدعو إليه جميع الأنبياء ، فلا معنى لإنكارهم عليك . وقيل : هو استفهام ، أي : أي شيء يقال لك إلا ما قد قيل للرسل من قبلك\nوقيل : \" إن ربك \" كلام مبتدأ وما قبله كلام تام إذا كان الخبر مضمرا . وقيل : هو متصل ب \" ما يقال لك \" إن ربك لذو مغفرة وذو عقاب أليم أي : إنما أمرت بالإنذار والتبشير .\n                                    ",
      "saadi": "مَّا يُقَالُ لَكَ إِلَّا مَا قَدۡ قِيلَ لِلرُّسُلِ مِن قَبۡلِكَۚ إِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ وَذُو عِقَابٍ أَلِيمٖ ٣٤\n                                        \n                                        \n                                        \n                                        أي: { مَا يُقَالُ لَكَ } أيها الرسول من الأقوال الصادرة، ممن كذبك وعاندك { إِلَّا مَا قَدْ قِيلَ لِلرُّسُلِ مِنْ قَبْلِكَ } أي: من جنسها، بل ربما إنهم تكلموا بكلام واحد، كتعجب جميع الأمم المكذبة للرسل، من دعوتهم إلى الإخلاص للّه وعبادته وحده لا شريك له، وردهم هذا بكل طريق يقدرون عليه، وقولهم: { مَا أَنْتُمْ إِلَّا بَشَرٌ مِثْلُنَا }\nواقتراحهم على رسلهم الآيات، التي لا يلزمهم الإتيان بها، ونحو ذلك من أقوال أهل التكذيب، لما تشابهت قلوبهم في الكفر، تشابهت أقوالهم، وصبر الرسل عليهم السلام على أذاهم وتكذيبهم، فاصبر كما صبر من قبلك.\nثم دعاهم إلى التوبة والإتيان بأسباب المغفرة، وحذرهم من الاستمرار على الغيّ فقال: { إِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ } أي: عظيمة، يمحو بها كل ذنب لمن أقلع وتاب { وَذُو عِقَابٍ أَلِيمٍ } لمن: أصر واستكبر.\n                                    "
    }
  },
  {
    "id": 43,
    "versesNumber": 44,
    "souraName": "Fussilat.html",
    "contnent": "وَلَوۡ جَعَلۡنَٰهُ قُرۡءَانًا أَعۡجَمِيّٗا لَّقَالُواْ لَوۡلَا فُصِّلَتۡ ءَايَٰتُهُۥٓۖ ءَا۬عۡجَمِيّٞ وَعَرَبِيّٞۗ قُلۡ هُوَ لِلَّذِينَ ءَامَنُواْ هُدٗى وَشِفَآءٞۚ وَٱلَّذِينَ لَا يُؤۡمِنُونَ فِيٓ ءَاذَانِهِمۡ وَقۡرٞ وَهُوَ عَلَيۡهِمۡ عَمًىۚ أُوْلَٰٓئِكَ يُنَادَوۡنَ مِن مَّكَانِۢ بَعِيدٖ ٤٤",
    "tafsier": {
      "ibnkther": "وَلَوۡ جَعَلۡنَٰهُ قُرۡءَانًا أَعۡجَمِيّٗا لَّقَالُواْ لَوۡلَا فُصِّلَتۡ ءَايَٰتُهُۥٓۖ ءَا۬عۡجَمِيّٞ وَعَرَبِيّٞۗ قُلۡ هُوَ لِلَّذِينَ ءَامَنُواْ هُدٗى وَشِفَآءٞۚ وَٱلَّذِينَ لَا يُؤۡمِنُونَ فِيٓ ءَاذَانِهِمۡ وَقۡرٞ وَهُوَ عَلَيۡهِمۡ عَمًىۚ أُوْلَٰٓئِكَ يُنَادَوۡنَ مِن مَّكَانِۢ بَعِيدٖ ٤٤\n                                    \n                                    \n                                    لما ذكر تعالى القرآن وفصاحته وبلاغته ، وإحكامه في لفظه ومعناه ، ومع هذا لم يؤمن به المشركون ، نبه على أن كفرهم به كفر عناد وتعنت ، كما قال : ( ولو نزلناه على بعض الأعجمين فقرأه عليهم ما كانوا به مؤمنين ) [ الشعراء : 198 ، 199 ] . وكذلك لو أنزل القرآن كله بلغة العجم ، لقالوا على وجه التعنت والعناد : ( لولا فصلت آياته أأعجمي وعربي ) أي : لقالوا : هلا أنزل مفصلا بلغة العرب ، ولأنكروا ذلك وقالوا : أعجمي وعربي ؟ أي : كيف ينزل كلام أعجمي على مخاطب عربي لا يفهمه .\nهكذا روي هذا المعنى عن ابن عباس ، ومجاهد ، وعكرمة ، وسعيد بن جبير ، والسدي ، وغيرهم .\nوقيل : المراد بقولهم : ( لولا فصلت آياته أأعجمي وعربي ) أي : هلا أنزل بعضها بالأعجمي ، وبعضها بالعربي .\nهذا قول الحسن البصري ، وكان يقرؤها كذلك بلا استفهام في قوله ( أعجمي ) وهو رواية عن سعيد بن جبير وهو في [ التعنت و ] العناد أبلغ .\nثم قال تعالى : ( قل هو للذين آمنوا هدى وشفاء ) أي : قل يا محمد : هذا القرآن لمن آمن به هدى لقلبه وشفاء لما في الصدور من الشكوك والريب ، ( والذين لا يؤمنون في آذانهم وقر ) أي : لا يفهمون ما فيه ، ( وهو عليهم عمى ) أي : لا يهتدون إلى ما فيه من البيان كما قال تعالى : ( وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا ) [ الإسراء : 82 ] .\n( أولئك ينادون من مكان بعيد ) قال مجاهد : يعني بعيدا من قلوبهم .\nقال ابن جرير : معناه : كأن من يخاطبهم يناديهم من مكان بعيد ، لا يفهمون ما يقول .\nقلت : وهذا كقوله تعالى : ( ومثل الذين كفروا كمثل الذي ينعق بما لا يسمع إلا دعاء ونداء صم بكم عمي فهم لا يعقلون ) [ البقرة : 171 ] .\nوقال الضحاك : ينادون يوم القيامة بأشنع أسمائهم .\nوقال السدي : كان عمر بن الخطاب [ رضي الله عنه ] جالسا عند رجل من المسلمين يقضي ، إذ قال : يا لبيكاه . فقال عمر : لم تلبي ؟ هل رأيت أحدا ، أو دعاك أحد ؟ قال : دعاني داع من وراء البحر . فقال عمر : أولئك ينادون من مكان بعيد . رواه ابن أبي حاتم .\n\n                                    ",
      "qortoby": "وَلَوۡ جَعَلۡنَٰهُ قُرۡءَانًا أَعۡجَمِيّٗا لَّقَالُواْ لَوۡلَا فُصِّلَتۡ ءَايَٰتُهُۥٓۖ ءَا۬عۡجَمِيّٞ وَعَرَبِيّٞۗ قُلۡ هُوَ لِلَّذِينَ ءَامَنُواْ هُدٗى وَشِفَآءٞۚ وَٱلَّذِينَ لَا يُؤۡمِنُونَ فِيٓ ءَاذَانِهِمۡ وَقۡرٞ وَهُوَ عَلَيۡهِمۡ عَمًىۚ أُوْلَٰٓئِكَ يُنَادَوۡنَ مِن مَّكَانِۢ بَعِيدٖ ٤٤\n                                    \n                                    \n                                    قوله تعالى : ولو جعلناه قرآنا أعجميا لقالوا لولا فصلت آياته أأعجمي وعربي .\nفيه ثلاث مسائل : الأولى : قوله تعالى : ولو جعلناه قرآنا أعجميا أي بلغة غير العرب لقالوا لولا فصلت آياته أي بينت بلغتنا فإننا عرب لا نفهم الأعجمية . فبين أنه أنزله بلسانهم ليتقرر به معنى الإعجاز ، إذ هم أعلم الناس بأنواع الكلام نظما ونثرا . وإذا عجزوا عن معارضته كان من أدل الدليل على أنه من عند الله ، ولو كان بلسان العجم لقالوا لا علم لنا بهذا اللسان .\nالثانية : وإذا ثبت هذا ففيه دليل على أن القرآن عربي ، وأنه نزل بلغة العرب ، وأنه ليس أعجميا ، وأنه إذا نقل عنها إلى غيرها لم يكن قرآنا .\nالثالثة : أأعجمي وعربي وقرأ أبو بكر وحمزة والكسائي \" ااعجمي وعربي \" بهمزتين مخففتين ، والعجمي الذي ليس من العرب كان فصيحا أو غير فصيح ، والأعجمي الذي لا يفصح كان من العرب أو من العجم ، فالأعجم ضد الفصيح ، وهو الذي لا يبين كلامه . ويقال للحيوان غير الناطق أعجم ، ومنه ( صلاة النهار عجماء ) أي : لا يجهر فيها بالقراءة . فكانت النسبة إلى الأعجم آكد ، لأن الرجل العجمي الذي ليس من العرب قد يكون فصيحا بالعربية ، والعربي قد يكون غير فصيح ، فالنسبة إلى الأعجمي آكد في البيان . والمعنى أقرآن أعجمي ، ونبي عربي ؟ وهو استفهام إنكار . وقرأ الحسن وأبو العالية ونصر بن عاصم والمغيرة وهشام عن ابن عامر \" أعجمي \" بهمزة واحدة على الخبر . والمعنى : لولا فصلت آياته فكان منها عربي يفهمه العرب ، وأعجمي يفهمه العجم . وروى سعيد بن جبير قال : قالت قريش : لولا أنزل القرآن أعجميا وعربيا فيكون بعض آياته عجميا وبعض آياته عربيا . فنزلت الآية . وأنزل في القرآن من كل لغة ، فمنه السجيل وهي فارسية وأصلها سنك كيل ، أي : طين وحجر ، ومنه الفردوس رومية ، وكذلك القسطاس . وقرأ أهل الحجاز وأبو عمرو وابن ذكوان وحفص على الاستفهام ، إلا أنهم لينوا الهمزة على أصولهم . والقراءة الصحيحة قراءة الاستفهام . والله أعلم .\nقوله تعالى : قل هو للذين آمنوا هدى وشفاء أعلم الله أن القرآن هدى وشفاء لكل من آمن به من الشك والريب والأوجاع . والذين لا يؤمنون في آذانهم وقر أي صمم عن سماع القرآن . ولهذا تواصوا باللغو فيه . ونظير هذه الآية : وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا وقد مضى مستوفى . وقراءة العامة عمى على المصدر . وقرأ ابن عباس وعبد الله بن الزبير وعمرو بن العاص ومعاوية وسليمان بن قتة \" وهو عليهم عم \" بكسر الميم أي : لا يتبين لهم . واختار أبو عبيد القراءة الأولى ، لإجماع الناس فيها ، ولقوله أولا : هدى وشفاء ، ولو كان هاد وشاف لكان الكسر في عمى أجود ، ليكون نعتا مثلهما ، تقديره : والذين لا يؤمنون في ترك قبوله بمنزلة من في آذانهم وقر وهو يعني القرآن عليهم ذو عمى ، لأنهم لا يفقهون ، فحذف المضاف . وقيل : المعنى : والوقر عليهم عمى .\nأولئك ينادون من مكان بعيد يقال ذلك لمن لا يفهم من التمثيل . وحكى أهل اللغة أنه يقال للذي يفهم : أنت تسمع من قريب . ويقال للذي لا يفهم : أنت تنادى من بعيد . أي : كأنه ينادى من موضع بعيد منه فهو لا يسمع النداء ولا يفهمه . وقال الضحاك : ينادون يوم القيامة بأقبح أسمائهم من مكان بعيد فيكون ذلك أشد لتوبيخهم وفضيحتهم . وقيل : أي : من لم يتدبر القرآن صار كالأعمى الأصم ، فهو ينادى من مكان بعيد فينقطع صوت المنادي عنه وهو لم يسمع . وقال علي - رضي الله عنه - ومجاهد : أي : بعيد من قلوبهم . وفي التفسير : كأنما ينادون من السماء فلا يسمعون . وحكى معناه النقاش .\n                                    ",
      "saadi": "وَلَوۡ جَعَلۡنَٰهُ قُرۡءَانًا أَعۡجَمِيّٗا لَّقَالُواْ لَوۡلَا فُصِّلَتۡ ءَايَٰتُهُۥٓۖ ءَا۬عۡجَمِيّٞ وَعَرَبِيّٞۗ قُلۡ هُوَ لِلَّذِينَ ءَامَنُواْ هُدٗى وَشِفَآءٞۚ وَٱلَّذِينَ لَا يُؤۡمِنُونَ فِيٓ ءَاذَانِهِمۡ وَقۡرٞ وَهُوَ عَلَيۡهِمۡ عَمًىۚ أُوْلَٰٓئِكَ يُنَادَوۡنَ مِن مَّكَانِۢ بَعِيدٖ ٤٤\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن فضله وكرمه، حيث أنزل كتابا عربيًا، على الرسول العربي، بلسان قومه، ليبين لهم، وهذا مما يوجب لهم زيادة الاغتناء به، والتلقي له والتسليم، وأنه لو جعله قرآنا أعجميًا، بلغة غير العرب، لاعترض، المكذبون وقالوا: { لَوْلَا فُصِّلَتْ آيَاتُهُ } أي: هلا بينت آياته، ووضحت وفسرت. { أَأَعْجَمِيٌّ وَعَرَبِيٌّ } أي: كيف يكون محمد عربيًا، والكتاب أعجمي؟ هذا لا يكون فنفى الله تعالى كل أمر، يكون فيه شبهة لأهل الباطل، عن كتابه، ووصفه بكل وصف، يوجب لهم الانقياد، ولكن المؤمنون الموفقون، انتفعوا به، وارتفعوا، وغيرهم بالعكس من أحوالهم.\nولهذا قال: { قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ } أي: يهديهم لطريق الرشد والصراط المستقيم، ويعلمهم من العلوم النافعة، ما به تحصل الهداية التامة وشفاء لهم من الأسقام البدنية، والأسقام القلبية، لأنه يزجر عن مساوئ الأخلاق وأقبح الأعمال، ويحث على التوبة النصوح، التي تغسل الذنوب وتشفي القلب.\n{ وَالَّذِينَ لَا يُؤْمِنُونَ } بالقرآن { فِي آذَانِهِمْ وَقْرٌ } أي: صمم عن استماعه وإعراض، { وَهُوَ عَلَيْهِمْ عَمًى } أي: لا يبصرون به رشدًا، ولا يهتدون به، ولا يزيدهم إلا ضلالاً فإنهم إذا ردوا الحق، ازدادوا عمى إلى عماهم، وغيًّا إلى غيَّهم.\n{ أُولَئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ } أي: ينادون إلى الإيمان، ويدعون إليه، فلا يستجيبون، بمنزلة الذي ينادي، وهو في مكان بعيد، لا يسمع داعيًا ولا يجيب مناديًا. والمقصود: أن الذين لا يؤمنون بالقرآن، لا ينتفعون بهداه، ولا يبصرون بنوره، ولا يستفيدون منه خيرًا، لأنهم سدوا على أنفسهم أبواب الهدى، بإعراضهم وكفرهم.\n                                    "
    }
  },
  {
    "id": 44,
    "versesNumber": 45,
    "souraName": "Fussilat.html",
    "contnent": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ ٥٤",
    "tafsier": {
      "ibnkther": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ ٥٤\n                                    \n                                    \n                                    وقوله : ( ولقد آتينا موسى الكتاب فاختلف فيه ) أي : كذب وأوذي ، ( فاصبر كما صبر أولو العزم من الرسل ) [ الأحقاف : 35 ] . ( ولولا كلمة سبقت من ربك إلى أجل مسمى ) [ الشورى : 14 ] بتأخير الحساب إلى يوم المعاد ، ( لقضي بينهم ) أي : لعجل لهم العذاب ، بل لهم موعد لن يجدوا من دونه موئلا ( وإنهم لفي شك منه مريب ) أي : وما كان تكذيبهم له عن بصيرة منهم لما قالوا ، بل كانوا شاكين فيما قالوا ، غير محققين لشيء كانوا فيه . هكذا وجهه ابن جرير ، وهو محتمل ، والله أعلم .\n                                    ",
      "qortoby": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ ٥٤\n                                    \n                                    \n                                    قوله تعالى : ولقد آتينا موسى الكتاب يعني التوراة فاختلف فيه أي آمن به قوم وكذب به قوم . والكناية ترجع إلى الكتاب ، وهو تسلية للنبي صلى الله عليه وسلم ، أي : لا يحزنك اختلاف قومك في كتابك ، فقد اختلف من قبلهم في كتابهم . وقيل : الكناية ترجع إلى موسى .\nولولا كلمة سبقت من ربك أي في إمهالهم . لقضي بينهم أي بتعجيل العذاب . وإنهم لفي شك منه من القرآن مريب أي شديد الريبة . وقد تقدم . وقال الكلبي في هذه الآية : لولا أن الله أخر عذاب هذه الأمة إلى يوم القيامة لأتاهم العذاب كما فعل بغيرهم من الأمم . وقيل : تأخير العذاب لما يخرج من أصلابهم من المؤمنين .\n                                    ",
      "saadi": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ ٥٤\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ } كما آتيناك الكتاب، فصنع به الناس ما صنعوا معك، اختلفوا فيه: فمنهم من آمن به واهتدى وانتفع، ومنهم من كذبه ولم ينتفع به، وإن اللّه تعالى، لولا حلمه وكلمته السابقة، بتأخير العذاب إلى أجل مسمى لا يتقدم عليه ولا يتأخر { لَقُضِيَ بَيْنَهُمْ } بمجرد ما يتميز المؤمنون من الكافرين، بإهلاك الكافرين في الحال، لأن سبب الهلاك قد وجب وحق. { وَإِنَّهُمْ لَفِي شَكٍّ مِنْهُ مُرِيبٍ } أي: قد بلغ بهم إلى الريب الذي يقلقهم، فلذلك كذبوه وجحدوه.\n                                    "
    }
  },
  {
    "id": 45,
    "versesNumber": 46,
    "souraName": "Fussilat.html",
    "contnent": "مَّنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۗ وَمَا رَبُّكَ بِظَلَّٰمٖ لِّلۡعَبِيدِ ٦٤",
    "tafsier": {
      "ibnkther": "مَّنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۗ وَمَا رَبُّكَ بِظَلَّٰمٖ لِّلۡعَبِيدِ ٦٤\n                                    \n                                    \n                                    يقول تعالى : ( من عمل صالحا فلنفسه ) أي : إنما يعود نفع ذلك على نفسه ، ( ومن أساء فعليها ) أي : إنما يرجع وبال ذلك عليه ، ( وما ربك بظلام للعبيد ) أي : لا يعاقب أحدا إلا بذنب ، ولا يعذب أحدا إلا بعد قيام الحجة عليه ، وإرسال الرسول إليه .\n                                    ",
      "qortoby": "مَّنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۗ وَمَا رَبُّكَ بِظَلَّٰمٖ لِّلۡعَبِيدِ ٦٤\n                                    \n                                    \n                                    من عمل صالحا فلنفسه شرط وجوابه ومن أساء فعليها والله - جل وعز - مستغن عن طاعة العباد ، فمن أطاع فالثواب له ، ومن أساء فالعقاب عليه . وما ربك بظلام للعبيد نفى الظلم عن نفسه - جل وعز - قليله وكثيره ، وإذا انتفت المبالغة انتفى غيرها ، دليله قوله الحق : إن الله لا يظلم الناس شيئا وروى العدول الثقات ، والأئمة الأثبات ، عن الزاهد العدل ، عن أمين الأرض ، عن أمين السماء ، عن الرب جل جلاله : يا عبادي إني حرمت الظلم على نفسي وجعلته بينكم محرما فلا تظالموا . . . الحديث . وأيضا فهو الحكيم المالك ، وما يفعله المالك في ملكه لا اعتراض عليه ، إذ له التصرف في ملكه بما يريد .\n                                    ",
      "saadi": "مَّنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۗ وَمَا رَبُّكَ بِظَلَّٰمٖ لِّلۡعَبِيدِ ٦٤\n                                        \n                                        \n                                        \n                                        { مَنْ عَمِلَ صَالِحًا } وهو العمل الذي أمر اللّه به، ورسوله { فَلِنَفْسِهِ } نفعه وثوابه في الدنيا والآخرة { وَمَنْ أَسَاءَ فَعَلَيْهَا } ضرره وعقابه، في الدنيا والآخرة، وفي هذا، حثٌّ على فعل الخير، وترك الشر، وانتفاع العاملين، بأعمالهم الحسنة، وضررهم بأعمالهم السيئة، وأنه لا تزر وازرة وزر أخرى. { وَمَا رَبُّكَ بِظَلَّامٍ لِلْعَبِيدِ } فَيُحمِّل أحدًا فوق سيئاتهم.\n                                    "
    }
  },
  {
    "id": 46,
    "versesNumber": 47,
    "souraName": "Fussilat.html",
    "contnent": "۞ إِلَيۡهِ يُرَدُّ عِلۡمُ ٱلسَّاعَةِۚ وَمَا تَخۡرُجُ مِن ثَمَرَٰتٖ مِّنۡ أَكۡمَامِهَا وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَيَوۡمَ يُنَادِيهِمۡ أَيۡنَ شُرَكَآءِي قَالُوٓاْ ءَاذَنَّٰكَ مَامِنَّا مِن شَهِيدٖ ٧٤",
    "tafsier": {
      "ibnkther": "۞ إِلَيۡهِ يُرَدُّ عِلۡمُ ٱلسَّاعَةِۚ وَمَا تَخۡرُجُ مِن ثَمَرَٰتٖ مِّنۡ أَكۡمَامِهَا وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَيَوۡمَ يُنَادِيهِمۡ أَيۡنَ شُرَكَآءِي قَالُوٓاْ ءَاذَنَّٰكَ مَامِنَّا مِن شَهِيدٖ ٧٤\n                                    \n                                    \n                                    ثم قال : ( إليه يرد علم الساعة ) أي : لا يعلم ذلك أحد سواه ، كما قال - صلى الله عليه وسلم - وهو سيد البشر لجبريل وهو من سادات الملائكة - حين سأله عن الساعة ، فقال : \" ما المسئول عنها بأعلم من السائل \" ، وكما قال تعالى : ( إلى ربك منتهاها ) [ النازعات : 44 ] ، وقال ( لا يجليها لوقتها إلا هو ) [ الأعراف : 187 ] .\nوقوله : ( وما تخرج من ثمرات من أكمامها وما تحمل من أنثى ولا تضع إلا بعلمه ) أي : الجميع بعلمه ، لا يعزب عن علمه مثقال ذرة في الأرض ولا في السماء . وقد قال تعالى : ( وما تسقط من ورقة إلا يعلمها ) [ الأنعام : 59 ] ، وقال جلت عظمته : ( يعلم ما تحمل كل أنثى وما تغيض الأرحام وما تزداد وكل شيء عنده بمقدار ) [ الرعد : 8 ] ، وقال ( وما يعمر من معمر ولا ينقص من عمره إلا في كتاب إن ذلك على الله يسير ) [ فاطر : 11 ] .\nوقوله : ( ويوم يناديهم أين شركائي ) أي : يوم القيامة ينادي الله المشركين على رءوس الخلائق : أين شركائي الذين عبدتموهم معي ؟ ( قالوا آذناك ) أي : أعلمناك ، ( ما منا من شهيد ) أي : ليس أحد منا اليوم يشهد أن معك شريكا .\n                                    ",
      "qortoby": "۞ إِلَيۡهِ يُرَدُّ عِلۡمُ ٱلسَّاعَةِۚ وَمَا تَخۡرُجُ مِن ثَمَرَٰتٖ مِّنۡ أَكۡمَامِهَا وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَيَوۡمَ يُنَادِيهِمۡ أَيۡنَ شُرَكَآءِي قَالُوٓاْ ءَاذَنَّٰكَ مَامِنَّا مِن شَهِيدٖ ٧٤\n                                    \n                                    \n                                    قوله تعالى : إليه يرد علم الساعة أي : حين وقتها . وذلك أنهم قالوا : يا محمد إن كنت نبيا فخبرنا متى قيام الساعة ، فنزلت : وما تخرج من ثمرات \" من \" زائدة أي : وما تخرج ثمرة . من أكمامها أي : من أوعيتها ، فالأكمام أوعية الثمرة ، واحدها كمة وهي كل ظرف لمال أو غيره ، ولذلك سمي قشر الطلع أعني كفراه الذي ينشق عن الثمرة كمة ، قال ابن عباس : الكمة الكفرى قبل أن تنشق ، فإذا انشقت فليست بكمة . وسيأتي لهذا مزيد بيان في سورة \" الرحمن \" وقرأ نافع وابن عامر وحفص من ثمرات على الجمع . الباقون \" ثمرة \" على التوحيد ، والمراد الجمع ، لقوله : وما تحمل من أنثى ، والمراد الجمع ، يقول : إليه يرد علم الساعة كما يرد إليه علم الثمار والنتاج .\nويوم يناديهم أي ينادي الله المشركين أين شركائي الذين زعمتم في الدنيا أنها آلهة تشفع . قالوا يعني الأصنام . وقيل : المشركون . ويحتمل أن يريدهم جميعا العابد والمعبود \" آذناك \" : أسمعناك وأعلمناك . يقال : آذن يؤذن : إذا أعلم ، قال [ الشاعر الحارث بن حلزة ] :\nآذنتنا ببينها أسماء رب ثاو يمل منه الثواء\nما منا من شهيد أي نعلمك ما منا أحد يشهد بأن لك شريكا . لما عاينوا القيامة تبرءوا من الأصنام وتبرأت الأصنام منهم كما تقدم في غير موضع .\n                                    ",
      "saadi": "۞ إِلَيۡهِ يُرَدُّ عِلۡمُ ٱلسَّاعَةِۚ وَمَا تَخۡرُجُ مِن ثَمَرَٰتٖ مِّنۡ أَكۡمَامِهَا وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَيَوۡمَ يُنَادِيهِمۡ أَيۡنَ شُرَكَآءِي قَالُوٓاْ ءَاذَنَّٰكَ مَامِنَّا مِن شَهِيدٖ ٧٤\n                                        \n                                        \n                                        \n                                        هذا إخبار عن سعة علمه تعالى واختصاصه بالعلم الذي لا يطلع عليه سواه فقال: { إِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ } أي: جميع الخلق ترد علمهم إلى الله تعالى، ويقرون بالعجز عنه، الرسل، والملائكة، وغيرهم.\n{ وَمَا تَخْرُجُ مِنْ ثَمَرَاتٍ مِنْ أَكْمَامِهَا } أي: وعائها الذي تخرج منه، وهذا شامل لثمرات جميع الأشجار التي في البلدان والبراري، فلا تخرج ثمرة شجرة من الأشجار، إلا وهو يعلمها علما تفصيليًا.\n{ وَمَا تَحْمِلُ مِنْ أُنْثَى } من بني آدم وغيرهم، من أنواع الحيوانات، إلا بعلمه { وَلَا تَضَعُ } أنثى حملها { إِلَّا بِعِلْمِهِ } فكيف سوَّى المشركون به تعالى، من لا علم عنده ولا سمع ولا بصر؟.\n{ وَيَوْمَ يُنَادِيهِمْ } أي: المشركين به يوم القيامة توبيخًا وإظهارًا لكذبهم، فيقول لهم: { أَيْنَ شُرَكَائِيَ } الذين زعمتم أنهم شركائي، فعبدتموهم، وجادلتم على ذلك، وعاديتم الرسل لأجلهم؟ { قَالُوا } مقرين ببطلان إلهيتهم، وشركتهم مع الله: { آذَنَّاكَ مَا مِنَّا مِنْ شَهِيدٍ } أي: أعلمناك يا ربنا، واشهد علينا أنه ما منا أحد يشهد بصحة إلهيتهم وشركتهم، فكلنا الآن قد رجعنا إلى بطلان عبادتها، وتبرأنا منها.\n                                    "
    }
  },
  {
    "id": 47,
    "versesNumber": 48,
    "souraName": "Fussilat.html",
    "contnent": "وَضَلَّ عَنۡهُم مَّا كَانُواْ يَدۡعُونَ مِن قَبۡلُۖ وَظَنُّواْ مَا لَهُم مِّن مَّحِيصٖ ٨٤",
    "tafsier": {
      "ibnkther": "وَضَلَّ عَنۡهُم مَّا كَانُواْ يَدۡعُونَ مِن قَبۡلُۖ وَظَنُّواْ مَا لَهُم مِّن مَّحِيصٖ ٨٤\n                                    \n                                    \n                                    ( وضل عنهم ما كانوا يدعون من قبل ) أي : ذهبوا فلم ينفعوهم ، ( وظنوا ما لهم من محيص ) أي : وظن المشركون يوم القيامة ، وهذا بمعنى اليقين ، ( ما لهم من محيص ) أي : لا محيد لهم عن عذاب الله ، كقوله تعالى : ( ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا ) [ الكهف : 53 ] .\n                                    ",
      "qortoby": "وَضَلَّ عَنۡهُم مَّا كَانُواْ يَدۡعُونَ مِن قَبۡلُۖ وَظَنُّواْ مَا لَهُم مِّن مَّحِيصٖ ٨٤\n                                    \n                                    \n                                    \" وضل عنهم \" أي بطل عنهم \" ما كانوا يدعون من قبل \" في الدنيا \" وظنوا \" أي أيقنوا وعلموا \" ما لهم من محيص \" أي فرار عن النار . و \" ما \" هنا حرف وليس باسم ، فلذلك لم يعمل فيه الظن وجعل الفعل ملغى ، تقديره : وظنوا أنهم ما لهم محيص ولا مهرب . يقال : حاص يحيص . حيصا ومحيصا إذا هرب . وقيل : إن الظن هنا الذي هو أغلب الرأي ، لا يشكون في أنهم أصحاب النار ولكن يطمعون أن يخرجوا منها . وليس يبعد أن يكون لهم ظن ورجاء إلى أن يؤيسوا .\n                                    ",
      "saadi": "وَضَلَّ عَنۡهُم مَّا كَانُواْ يَدۡعُونَ مِن قَبۡلُۖ وَظَنُّواْ مَا لَهُم مِّن مَّحِيصٖ ٨٤\n                                        \n                                        \n                                        \n                                        { وَضَلَّ عَنْهُمْ مَا كَانُوا يَدْعُونَ } من دون الله، أي: ذهبت عقائدهم وأعمالهم، التي أفنوا فيها أعمارهم على عبادة غير الله، وظنوا أنها تفيدهم، وتدفع عنهم العذاب، وتشفع لهم عند الله، فخاب سعيهم، وانتقض ظنهم، ولم تغن عنهم شركاؤهم شيئًا { وَظَنُّوا } أي: أيقنوا في تلك الحال { مَا لَهُمْ مِنْ مَحِيصٍ } أي: منقذ ينقذهم، ولا مغيث، ولا ملجأ، فهذه عاقبة من أشرك بالله غيره، بينها الله لعباده، ليحذروا الشرك به.\n                                    "
    }
  },
  {
    "id": 48,
    "versesNumber": 49,
    "souraName": "Fussilat.html",
    "contnent": "لَّا يَسۡ‍َٔمُ ٱلۡإِنسَٰنُ مِن دُعَآءِ ٱلۡخَيۡرِ وَإِن مَّسَّهُ ٱلشَّرُّ فَيَ‍ُٔوسٞ قَنُوطٞ ٩٤",
    "tafsier": {
      "ibnkther": "لَّا يَسۡ‍َٔمُ ٱلۡإِنسَٰنُ مِن دُعَآءِ ٱلۡخَيۡرِ وَإِن مَّسَّهُ ٱلشَّرُّ فَيَ‍ُٔوسٞ قَنُوطٞ ٩٤\n                                    \n                                    \n                                    يقول تعالى لا يمل الإنسان من دعاء ربه بالخير وهو المال وصحة الجسم وغير ذلك وإن مسه الشر وهو البلاء أو الفقر \"فيئوس قنوط\" أي يقع في ذهنه أنه لا يتهيأ له بعد هذا خير.\n                                    ",
      "qortoby": "لَّا يَسۡ‍َٔمُ ٱلۡإِنسَٰنُ مِن دُعَآءِ ٱلۡخَيۡرِ وَإِن مَّسَّهُ ٱلشَّرُّ فَيَ‍ُٔوسٞ قَنُوطٞ ٩٤\n                                    \n                                    \n                                    قوله تعالى : لا يسأم الإنسان من دعاء الخير أي لا يمل من دعائه بالخير . والخير هنا المال والصحة والسلطان والعز . قال السدي : والإنسان هاهنا يراد به الكافر . وقيل : الوليد بن المغيرة . وقيل : عتبة وشيبة ابنا ربيعة وأمية بن خلف . وفي قراءة عبد الله \" لا يسأم الإنسان من دعاء المال \" وإن مسه الشر الفقر والمرض فيئوس من روح الله قنوط من رحمته . وقيل : يئوس من إجابة الدعاء قنوط بسوء الظن بربه . وقيل : يئوس أي : يئس من زوال ما به من المكروه \" قنوط \" أي : يظن أنه يدوم ، والمعنى متقارب .\n                                    ",
      "saadi": "لَّا يَسۡ‍َٔمُ ٱلۡإِنسَٰنُ مِن دُعَآءِ ٱلۡخَيۡرِ وَإِن مَّسَّهُ ٱلشَّرُّ فَيَ‍ُٔوسٞ قَنُوطٞ ٩٤\n                                        \n                                        \n                                        \n                                        هذا إخبار عن طبيعة الإنسان، من حيث هو، وعدم صبره وجلده، لا على الخير ولا على الشر، إلا من نقله الله من هذه الحال إلى حال الكمال، فقال: { لَا يَسْأَمُ الْإِنْسَانُ مِنْ دُعَاءِ الْخَيْرِ } أي: لا يمل دائمًا، من دعاء الله، في الغنى والمال والولد، وغير ذلك من مطالب الدنيا، ولا يزال يعمل على ذلك، ولا يقتنع بقليل، ولا كثير منها، فلو حصل له من الدنيا، ما حصل، لم يزل طالبًا للزيادة.\n{ وَإِنْ مَسَّهُ الشَّرُّ } أي: المكروه، كالمرض، والفقر، وأنواع البلايا { فَيَئُوسٌ قَنُوطٌ } أي: ييأس من رحمة الله تعالى، ويظن أن هذا البلاء هو القاضي عليه بالهلاك، ويتشوش من إتيان الأسباب، على غير ما يحب ويطلب.\nإلا الذين آمنوا وعملوا الصالحات، فإنهم إذا أصابهم الخير والنعمة والمحاب، شكروا الله تعالى، وخافوا أن تكون نعم الله عليهم، استدراجًا وإمهالاً، وإن أصابتهم مصيبة، في أنفسهم وأموالهم، وأولادهم، صبروا، ورجوا فضل ربهم، فلم ييأسوا.\n                                    "
    }
  },
  {
    "id": 49,
    "versesNumber": 50,
    "souraName": "Fussilat.html",
    "contnent": "وَلَئِنۡ أَذَقۡنَٰهُ رَحۡمَةٗ مِّنَّا مِنۢ بَعۡدِ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ هَٰذَا لِي وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّجِعۡتُ إِلَىٰ رَبِّيٓ إِنَّ لِي عِندَهُۥ لَلۡحُسۡنَىٰۚ فَلَنُنَبِّئَنَّ ٱلَّذِينَ كَفَرُواْ بِمَا عَمِلُواْ وَلَنُذِيقَنَّهُم مِّنۡ عَذَابٍ غَلِيظٖ ٠٥",
    "tafsier": {
      "ibnkther": "وَلَئِنۡ أَذَقۡنَٰهُ رَحۡمَةٗ مِّنَّا مِنۢ بَعۡدِ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ هَٰذَا لِي وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّجِعۡتُ إِلَىٰ رَبِّيٓ إِنَّ لِي عِندَهُۥ لَلۡحُسۡنَىٰۚ فَلَنُنَبِّئَنَّ ٱلَّذِينَ كَفَرُواْ بِمَا عَمِلُواْ وَلَنُذِيقَنَّهُم مِّنۡ عَذَابٍ غَلِيظٖ ٠٥\n                                    \n                                    \n                                    ( ولئن أذقناه رحمة منا من بعد ضراء مسته ليقولن هذا لي ) أي : إذا أصابه خير ورزق بعد ما كان في شدة ليقولن : هذا لي ، إني كنت أستحقه عند ربي ، ( وما أظن الساعة قائمة ) أي : يكفر بقيام الساعة ، أي : لأجل أنه خول نعمة يفخر ، ويبطر ، ويكفر ، كما قال تعالى : ( كلا إن الإنسان ليطغى أن رآه استغنى ) [ العلق : 6 ، 7 ] .\n( ولئن رجعت إلى ربي إن لي عنده للحسنى ) أي : ولئن كان ثم معاد فليحسنن إلي ربي ، كما أحسن إلي في هذه الدار ، يتمنى على الله ، عز وجل ، مع إساءته العمل وعدم اليقين . قال تعالى : ( فلننبئن الذين كفروا بما عملوا ولنذيقنهم من عذاب غليظ ) يتهدد تعالى من كان هذا عمله واعتقاده بالعقاب والنكال .\n                                    ",
      "qortoby": "وَلَئِنۡ أَذَقۡنَٰهُ رَحۡمَةٗ مِّنَّا مِنۢ بَعۡدِ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ هَٰذَا لِي وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّجِعۡتُ إِلَىٰ رَبِّيٓ إِنَّ لِي عِندَهُۥ لَلۡحُسۡنَىٰۚ فَلَنُنَبِّئَنَّ ٱلَّذِينَ كَفَرُواْ بِمَا عَمِلُواْ وَلَنُذِيقَنَّهُم مِّنۡ عَذَابٍ غَلِيظٖ ٠٥\n                                    \n                                    \n                                    قوله تعالى : ولئن أذقناه رحمة منا عاقبة ورخاء وغنى من بعد ضراء مسته ضر وسقم وشدة وفقر . ليقولن هذا لي أي هذا شيء أستحقه على الله لرضاه بعملي ، فيرى النعمة حتما واجبا على الله تعالى ، ولم يعلم أنه ابتلاه بالنعمة والمحنة ، ليتبين شكره وصبره . وقال ابن عباس : هذا لي أي : هذا من عندي . وما أظن الساعة قائمة ولإن رجعت إلى ربي إن لي عنده للحسنى أي الجنة ، واللام للتأكيد . يتمنى الأماني بلا عمل . قال الحسن بن محمد بن علي بن أبي طالب : للكافر أمنيتان ، أما في الدنيا فيقول : لإن رجعت إلى ربي إن لي عنده للحسنى ، وأما في الآخرة فيقول : يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين و \" يا ليتني كنت ترابا \" . فلننبئن الذين كفروا بما عملوا أي لنجزينهم . قسم أقسم الله عليه . ولنذيقنهم من عذاب غليظ شديد .\n                                    ",
      "saadi": "وَلَئِنۡ أَذَقۡنَٰهُ رَحۡمَةٗ مِّنَّا مِنۢ بَعۡدِ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ هَٰذَا لِي وَمَآ أَظُنُّ ٱلسَّاعَةَ قَآئِمَةٗ وَلَئِن رُّجِعۡتُ إِلَىٰ رَبِّيٓ إِنَّ لِي عِندَهُۥ لَلۡحُسۡنَىٰۚ فَلَنُنَبِّئَنَّ ٱلَّذِينَ كَفَرُواْ بِمَا عَمِلُواْ وَلَنُذِيقَنَّهُم مِّنۡ عَذَابٍ غَلِيظٖ ٠٥\n                                        \n                                        \n                                        \n                                        ثم قال تعالى: { وَلَئِنْ أَذَقْنَاهُ } أي: الإنسان الذي يسأم من دعاء الخير، وإن مسه الشر فيئوس قنوط { رَحْمَةً مِنَّا } أي: بعد ذلك الشر الذي أصابه، بأن عافاه الله من مرضه، أو أغناه من فقره، فإنه لا يشكر الله تعالى، بل يبغى، ويطغى، ويقول: { هَذَا لِي } أي: أتاني لأني له أهل، وأنا مستحق له { وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً } وهذا إنكار منه للبعث، وكفر للنعمة والرحمة، التي أذاقها الله له. { وَلَئِنْ رُجِعْتُ إِلَى رَبِّي إِنَّ لِي عِنْدَهُ لَلْحُسْنَى } أي: على تقدير إتيان الساعة، وأني سأرجع إلى ربي، إن لي عنده، للحسنى، فكما حصلت لي النعمة في الدنيا، فإنها ستحصل ]لي[ في الآخرة وهذا من أعظم الجراءة والقول على الله بلا علم، فلهذا توعده بقوله: { فَلَنُنَبِّئَنَّ الَّذِينَ كَفَرُوا بِمَا عَمِلُوا وَلَنُذِيقَنَّهُمْ مِنْ عَذَابٍ غَلِيظٍ } أي: شديد جدًا.\n                                    "
    }
  },
  {
    "id": 50,
    "versesNumber": 51,
    "souraName": "Fussilat.html",
    "contnent": "وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَ‍َٔابِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ فَذُو دُعَآءٍ عَرِيضٖ ١٥",
    "tafsier": {
      "ibnkther": "وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَ‍َٔابِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ فَذُو دُعَآءٍ عَرِيضٖ ١٥\n                                    \n                                    \n                                    ثم قال : ( وإذا أنعمنا على الإنسان أعرض ونأى بجانبه ) أي : أعرض عن الطاعة ، واستكبر عن الانقياد لأوامر الله ، عز وجل ، كقوله تعالى : ( فتولى بركنه ) [ الذاريات : 39 ] .\n( وإذا مسه الشر ) أي : الشدة ، ( فذو دعاء عريض ) أي : يطيل المسألة في الشيء الواحد فالكلام العريض : ما طال لفظه وقل معناه ، والوجيز : عكسه ، وهو : ما قل ودل . وقد قال تعالى : ( وإذا مس الإنسان الضر دعانا لجنبه أو قاعدا أو قائما فلما كشفنا عنه ضره مر كأن لم يدعنا إلى ضر مسه ) [ يونس : 12 ] .\n                                    ",
      "qortoby": "وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَ‍َٔابِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ فَذُو دُعَآءٍ عَرِيضٖ ١٥\n                                    \n                                    \n                                    قوله تعالى : وإذا أنعمنا على الإنسان يريد الكافر أعرض ونأى بجانبه . وقال ابن عباس : يريد عتبة بن ربيعة وشيبة بن ربيعة وأمية بن خلف أعرضوا عن الإسلام وتباعدوا عنه . ومعنى نأى بجانبه أي : ترفع عن الانقياد إلى الحق وتكبر على أنبياء الله . وقيل : نأى تباعد . يقال : نأيته ونأيت عنه نأيا بمعنى تباعدت عنه ، وأنأيته فانتأى : أبعدته فبعد ، وتناءوا تباعدوا ، والمنتأى الموضع البعيد ، قال النابغة :\nفإنك كالليل الذي هو مدركي وإن خلت أن المنتأى عنك واسع\nوقرأ يزيد بن القعقاع و \" ناء بجانبه \" بالألف قبل الهمزة . فيجوز أن يكون من \" ناء \" إذا نهض . ويجوز أن يكون على قلب الهمزة بمعنى الأول .\nوإذا مسه الشر أي أصابه المكروه فذو دعاء عريض أي كثير ، والعرب تستعمل الطول والعرض في الكثرة . يقال : أطال فلان في الكلام وأعرض في الدعاء إذا أكثر . وقال ابن عباس : فذو دعاء عريض فذو تضرع واستغاثة . والكافر يعرف ربه في البلاء ولا يعرفه في الرخاء .\n                                    ",
      "saadi": "وَإِذَآ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَٰنِ أَعۡرَضَ وَنَ‍َٔابِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ فَذُو دُعَآءٍ عَرِيضٖ ١٥\n                                        \n                                        \n                                        \n                                        { وَإِذَا أَنْعَمْنَا عَلَى الْإِنْسَانِ } بصحة، أو رزق، أو غيرهما { أَعْرَضَ } عن ربه وعن شكره { وَنَأَى } ترفع { بِجَانِبِهِ } عجبا وتكبرًا. { وَإِنْ مَسَّهُ الشَّرُّ } أي: المرض، أو الفقر، أو غيرهما { فَذُو دُعَاءٍ عَرِيضٍ } أي: كثير جدًا، لعدم صبره، فلا صبر في الضراء، ولا شكر في الرخاء، إلا من هداه الله ومنَّ عليه.\n                                    "
    }
  },
  {
    "id": 51,
    "versesNumber": 52,
    "souraName": "Fussilat.html",
    "contnent": "قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ ثُمَّ كَفَرۡتُم بِهِۦ مَنۡ أَضَلُّ مِمَّنۡ هُوَ فِي شِقَاقِۢ بَعِيدٖ ٢٥",
    "tafsier": {
      "ibnkther": "قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ ثُمَّ كَفَرۡتُم بِهِۦ مَنۡ أَضَلُّ مِمَّنۡ هُوَ فِي شِقَاقِۢ بَعِيدٖ ٢٥\n                                    \n                                    \n                                    يقول تعالى : قل يا محمد لهؤلاء المشركين المكذبين بالقرآن : ( أرأيتم إن كان ) هذا القرآن ( من عند الله ثم كفرتم به ) أي : كيف ترون حالكم عند الذي أنزله على رسوله ؟ ولهذا قال : ( من أضل ممن هو في شقاق بعيد ) ؟ أي : في كفر وعناد ومشاقة للحق ، ومسلك بعيد من الهدى .\n                                    ",
      "qortoby": "قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ ثُمَّ كَفَرۡتُم بِهِۦ مَنۡ أَضَلُّ مِمَّنۡ هُوَ فِي شِقَاقِۢ بَعِيدٖ ٢٥\n                                    \n                                    \n                                    قوله تعالى : قل أرأيتم أي قل لهم يا محمد أرأيتم يا معشر المشركين إن كان هذا القرآن من عند الله ثم كفرتم به من أضل أي فأي الناس أضل ، أي : لا أحد أضل منكم لفرط شقاقكم وعداوتكم . وقيل : قوله : إن كان من عند الله يرجع إلى الكتاب المذكور في قوله : آتينا موسى الكتاب والأول أظهر ، وهو قول ابن عباس .\n                                    ",
      "saadi": "قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ ثُمَّ كَفَرۡتُم بِهِۦ مَنۡ أَضَلُّ مِمَّنۡ هُوَ فِي شِقَاقِۢ بَعِيدٖ ٢٥\n                                        \n                                        \n                                        \n                                        أي { قُلْ } لهؤلاء المكذبين بالقرآن المسارعين إلى الكفران { أَرَأَيْتُمْ إِنْ كَانَ } هذا القرآن { مِنْ عِنْدِ اللَّهِ } من غير شك ولا ارتياب، { ثُمَّ كَفَرْتُمْ بِهِ مَنْ أَضَلُّ مِمَّنْ هُوَ فِي شِقَاقٍ بَعِيدٍ } أي: معاندة للّه ولرسوله، لأنه تبين لكم الحق والصواب، ثم عدلتم عنه، لا إلى حق، بل إلى باطل وجهل، فإذا تكونون أضل الناس وأظلمهم.\n                                    "
    }
  },
  {
    "id": 52,
    "versesNumber": 53,
    "souraName": "Fussilat.html",
    "contnent": "سَنُرِيهِمۡ ءَايَٰتِنَا فِي ٱلۡأٓفَاقِ وَفِيٓ أَنفُسِهِمۡ حَتَّىٰ يَتَبَيَّنَ لَهُمۡ أَنَّهُ ٱلۡحَقُّۗ أَوَ لَمۡ يَكۡفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ ٣٥",
    "tafsier": {
      "ibnkther": "سَنُرِيهِمۡ ءَايَٰتِنَا فِي ٱلۡأٓفَاقِ وَفِيٓ أَنفُسِهِمۡ حَتَّىٰ يَتَبَيَّنَ لَهُمۡ أَنَّهُ ٱلۡحَقُّۗ أَوَ لَمۡ يَكۡفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ ٣٥\n                                    \n                                    \n                                    ثم قال : ( سنريهم آياتنا في الآفاق وفي أنفسهم ) أي : سنظهر لهم دلالاتنا وحججنا على كون القرآن حقا منزلا من عند الله ، عز وجل ، على رسوله - صلى الله عليه وسلم - بدلائل خارجية ( في الآفاق ) ، من الفتوحات وظهور الإسلام على الأقاليم وسائر الأديان .\nقال مجاهد ، والحسن ، والسدي : ودلائل في أنفسهم ، قالوا : وقعة بدر ، وفتح مكة ، ونحو ذلك من الوقائع التي حلت بهم ، نصر الله فيها محمدا وصحبه ، وخذل فيها الباطل وحزبه .\nويحتمل أن يكون المراد من ذلك ما الإنسان مركب منه وفيه وعليه من المواد والأخلاط والهيئات العجيبة ، كما هو مبسوط في علم التشريح الدال على حكمة الصانع تبارك وتعالى . وكذلك ما هو مجبول عليه من الأخلاق المتباينة ، من حسن وقبيح وبين ذلك ، وما هو متصرف فيه تحت الأقدار التي لا يقدر بحوله ، وقوته ، وحيله ، وحذره أن يجوزها ، ولا يتعداها ، كما أنشده ابن أبي الدنيا في كتابه \" التفكر والاعتبار \" ، عن شيخه أبي جعفر القرشي :\nوإذا نظرت تريد معتبرا فانظر إليك ففيك معتبر أنت الذي يمسي ويصبح في\nالدنيا وكل أموره عبر أنت المصرف كان في صغر\nثم استقل بشخصك الكبر أنت الذي تنعاه خلقته\nينعاه منه الشعر والبشر أنت الذي تعطى وتسلب لا\nينجيه من أن يسلب الحذر أنت الذي لا شيء منه له\nوأحق منه بماله القدر\nوقوله تعالى : ( حتى يتبين لهم أنه الحق أولم يكف بربك أنه على كل شيء شهيد ) ؟ أي : كفى بالله شهيدا على أفعال عباده وأقوالهم ، وهو يشهد أن محمدا صادق فيما أخبر به عنه ، كما قال : ( لكن الله يشهد بما أنزل إليك أنزله بعلمه والملائكة يشهدون ) [ النساء : 166 ] .\n                                    ",
      "qortoby": "سَنُرِيهِمۡ ءَايَٰتِنَا فِي ٱلۡأٓفَاقِ وَفِيٓ أَنفُسِهِمۡ حَتَّىٰ يَتَبَيَّنَ لَهُمۡ أَنَّهُ ٱلۡحَقُّۗ أَوَ لَمۡ يَكۡفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ ٣٥\n                                    \n                                    \n                                    قوله تعالى : سنريهم آياتنا في الآفاق وفي أنفسهم أي علامات وحدانيتنا وقدرتنا في الآفاق يعني خراب منازل الأمم الخالية وفي أنفسهم بالبلايا والأمراض . وقال ابن زيد : \" في الآفاق \" آيات السماء \" وفي أنفسهم \" حوادث الأرض . وقال مجاهد : في الآفاق فتح القرى ، فيسر الله - عز وجل - لرسوله - صلى الله عليه وسلم - وللخلفاء من بعده وأنصار دينه في آفاق الدنيا وبلاد المشرق والمغرب عموما ، وفي ناحية المغرب خصوصا من الفتوح التي لم يتيسر أمثالها لأحد من خلفاء الأرض قبلهم ، ومن الإظهار على الجبابرة والأكاسرة وتغليب قليلهم على كثيرهم ، وتسليط ضعفائهم على أقويائهم ، وإجرائه على أيديهم أمورا خارجة عن المعهود خارقة للعادات \" وفي أنفسهم \" فتح مكة . وهذا اختيار الطبري . وقاله المنهال بن عمرو والسدي . وقال قتادة والضحاك : \" في الآفاق \" وقائع الله في الأمم \" وفي أنفسهم \" يوم بدر . وقال عطاء وابن زيد أيضا في الآفاق يعني أقطار السماوات والأرض من الشمس والقمر والنجوم والليل والنهار والرياح والأمطار والرعد والبرق والصواعق والنبات والأشجار والجبال والبحار وغيرها . وفي الصحاح : الآفاق النواحي ، واحدها أفق ، وأفق مثل عسر وعسر ، ورجل أفقي بفتح الهمزة والفاء : إذا كان من آفاق الأرض . حكاه أبو نصر . وبعضهم يقول : أفقي بضمها وهو القياس . وأنشد غير الجوهري :\nأخذنا بآفاق السماء عليكم لنا قمراها والنجوم الطوالع\nوفي أنفسهم من لطيف الصنعة وبديع الحكمة حتى سبيل الغائط والبول ، فإن الرجل يشرب ويأكل من مكان واحد ويتميز ذلك من مكانين ، وبديع صنعة الله وحكمته في عينيه اللتين هما قطرة ماء ينظر بهما من السماء إلى الأرض مسيرة خمسمائة عام ، وفي أذنيه اللتين يفرق بهما بين الأصوات المختلفة . وغير ذلك من بديع حكمة الله فيه . وقيل : وفي أنفسهم من كونهم نطفا إلى غير ذلك من انتقال أحوالهم كما تقدم في ( المؤمنون ) بيانه . وقيل : المعنى سيرون ما أخبرهم به النبي - صلى الله عليه وسلم - من الفتن وأخبار الغيوب\nحتى يتبين لهم أنه الحق فيه أربعة أوجه : [ أحدها ] أنه القرآن . [ الثاني ] الإسلام جاءهم به الرسول ودعاهم إليه . [ الثالث ] أن ما يريهم الله ويفعل من ذلك هو الحق . [ الرابع ] أن محمدا - صلى الله عليه وسلم - هو الرسول الحق .\nأولم يكف بربك في موضع رفع بأنه فاعل ب \" يكف \" و \" أنه \" بدل من ربك ، فهو رفع إن قدرته بدلا على الموضع ، وجر إن قدرته بدلا على اللفظ . ويجوز أن يكون نصبا بتقدير حذف اللام ، والمعنى أولم يكفهم ربك بما دلهم عليه من توحيده ; لأنه على كل شيء شهيد وإذا شهده جازى عليه . وقيل : المعنى أولم يكف بربك في معاقبته الكفار . وقيل : المعنى أولم يكف بربك يا محمد أنه شاهد على أعمال الكفار . وقيل : أولم يكف بربك شاهدا على أن القرآن من عند الله . وقيل : أولم يكف بربك أنه على كل شيء مما يفعله العبد شهيد ، والشهيد بمعنى العالم ، أو هو من الشهادة التي هي الحضور\n                                    ",
      "saadi": "سَنُرِيهِمۡ ءَايَٰتِنَا فِي ٱلۡأٓفَاقِ وَفِيٓ أَنفُسِهِمۡ حَتَّىٰ يَتَبَيَّنَ لَهُمۡ أَنَّهُ ٱلۡحَقُّۗ أَوَ لَمۡ يَكۡفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ ٣٥\n                                        \n                                        \n                                        \n                                        فإن قلتم، أو شككتم بصحته وحقيقته، فسيقيم اللّه لكم، ويريكم من آياته في الآفاق كالآيات التي في السماء وفي الأرض، وما يحدثه اللّه تعالى من الحوادث العظيمة، الدالة للمستبصر على الحق.\n{ وَفِي أَنْفُسِهِمْ } مما اشتملت عليه أبدانهم، من بديع آيات اللّه وعجائب صنعته، وباهر قدرته، وفي حلول العقوبات والمثلات في المكذبين، ونصر المؤمنين. { حَتَّى يَتَبَيَّنَ لَهُمْ } من تلك الآيات، بيانًا لا يقبل الشك { أَنَّهُ الْحَقُّ } وما اشتمل عليه حق.\nوقد فعل تعالى، فإنه أرى عباده من الآيات، ما به تبين لهم أنه الحق، ولكن اللّه هو الموفق للإيمان من شاء، والخاذل لمن يشاء.\n{ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَى كُلِّ شَيْءٍ شَهِيدٌ } أي: أولم يكفهم على أن القرآن حق، ومن جاء به صادق، بشهادة اللّه تعالى، فإنه قد شهد له بالتصديق، وهو أصدق الشاهدين، وأيده، ونصره نصرًا متضمنًا لشهادته القولية، عند من شك فيها.\n                                    "
    }
  },
  {
    "id": 53,
    "versesNumber": 54,
    "souraName": "Fussilat.html",
    "contnent": "أَلَآ إِنَّهُمۡ فِي مِرۡيَةٖ مِّن لِّقَآءِ رَبِّهِمۡۗ أَلَآ إِنَّهُۥ بِكُلِّ شَيۡءٖ مُّحِيطُۢ ٤٥",
    "tafsier": {
      "ibnkther": "أَلَآ إِنَّهُمۡ فِي مِرۡيَةٖ مِّن لِّقَآءِ رَبِّهِمۡۗ أَلَآ إِنَّهُۥ بِكُلِّ شَيۡءٖ مُّحِيطُۢ ٤٥\n                                    \n                                    \n                                    وقوله : ( ألا إنهم في مرية من لقاء ربهم ) أي : في شك من قيام الساعة ; ولهذا لا يتفكرون فيه ، ولا يعملون له ، ولا يحذرون منه ، بل هو عندهم هدر لا يعبئون به وهو واقع لا ريب فيه وكائن لا محالة .\nقال ابن أبي الدنيا : حدثنا أحمد بن إبراهيم ، حدثنا خلف بن تميم ، حدثنا عبد الله بن محمد بن سعيد الأنصاري أن عمر بن عبد العزيز صعد المنبر ، فحمد الله وأثنى عليه ، ثم قال : أما بعد ، أيها الناس ، فإني لم أجمعكم لأمر أحدثه فيكم ، ولكن فكرت في هذا الأمر الذي أنتم إليه صائرون ، فعلمت أن المصدق بهذا الأمر أحمق ، والمكذب به هالك ثم نزل .\nومعنى قوله ، رضي الله عنه : \" أن المصدق به أحمق \" أي : لأنه لا يعمل له عمل مثله ، ولا يحذر منه ولا يخاف من هوله ، وهو مع ذلك مصدق به موقن بوقوعه ، وهو مع ذلك يتمادى في لعبه وغفلته وشهواته وذنوبه ، فهو أحمق بهذا الاعتبار ، والأحمق في اللغة : ضعيف العقل .\nوقوله : \" والمكذب به هالك \" هذا واضح ، والله أعلم .\nثم قال تعالى - مقررا على أنه على كل شيء قدير ، وبكل شيء محيط ، وإقامة الساعة لديه يسير سهل عليه تبارك وتعالى - : ( ألا إنه بكل شيء محيط ) أي : المخلوقات كلها تحت قهره وفي قبضته ، وتحت طي علمه ، وهو المتصرف فيها كلها بحكمه ، فما شاء كان وما لم يشأ لم يكن .\n                                    [ آخر تفسير سورة فصلت ] .\n                                    ",
      "qortoby": "أَلَآ إِنَّهُمۡ فِي مِرۡيَةٖ مِّن لِّقَآءِ رَبِّهِمۡۗ أَلَآ إِنَّهُۥ بِكُلِّ شَيۡءٖ مُّحِيطُۢ ٤٥\n                                    \n                                    \n                                    ألا إنهم في مرية أي في شك من لقاء ربهم في الآخرة . وقال السدي : أي : من البعث . ألا إنه بكل شيء محيط أي أحاط علمه بكل شيء . قاله السدي . وقال الكلبي : أحاطت قدرته بكل شيء . وقال الخطابي : هو الذي أحاطت قدرته بجميع خلقه ، وهو الذي أحاط بكل شيء علما ، وأحصى كل شيء عددا . وهذا الاسم أكثر ما يجيء في معرض الوعيد ، وحقيقته الإحاطة بكل شيء ، واستئصال المحاط به ، وأصله محيط ، نقلت حركة الياء إلى الحاء فسكنت . يقال منه : أحاط يحيط إحاطة وحيطة ، ومن ذلك حائط الدار ، يحوطها أهلها . وأحاطت الخيل بفلان : إذا أخذ مأخذا حاصرا من كل جهة ، ومنه قوله تعالى : وأحيط بثمره والله أعلم بصواب ذلك .\n                                    ",
      "saadi": "أَلَآ إِنَّهُمۡ فِي مِرۡيَةٖ مِّن لِّقَآءِ رَبِّهِمۡۗ أَلَآ إِنَّهُۥ بِكُلِّ شَيۡءٖ مُّحِيطُۢ ٤٥\n                                        \n                                        \n                                        \n                                        { أَلَا إِنَّهُمْ فِي مِرْيَةٍ مِنْ لِقَاءِ رَبِّهِمْ } أي: في شك من البعث والقيامة، وليس عندهم دار سوى الدار الدنيا، فلذلك لم يعملوا للآخرة، ولم يلتفتوا لها. { أَلَا إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ } علما وقدرة وعزة.\nتم تفسير سورة فصلت\n-بمنه تعالى-\n                                    "
    }
  }
]