{
  "number": 100,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 628,
      "text": "۞ يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنْفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِنْ يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَنْ تَعْدِلُوا ۚ وَإِنْ تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 135,
      "juz": 5,
      "manzil": 1,
      "page": 100,
      "ruku": 81,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": " يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ بِٱلۡقِسۡطِ شُهَدَآءَ لِلَّهِ وَلَوۡ عَلَىٰٓ أَنفُسِكُمۡ أَوِ ٱلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَۚ إِن يَكُنۡ غَنِيًّا أَوۡ فَقِيرٗا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُواْ ٱلۡهَوَىٰٓ أَن تَعۡدِلُواْۚ وَإِن تَلۡوُۥٓاْ أَوۡ تُعۡرِضُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٥٣١\n                                    \n                                    \n                                    يأمر تعالى عباده المؤمنين أن يكونوا قوامين بالقسط ، أي بالعدل ، فلا يعدلوا عنه يمينا ولا شمالا ولا تأخذهم في الله لومة لائم ، ولا يصرفهم عنه صارف ، وأن يكونوا متعاونين متساعدين متعاضدين متناصرين فيه .\nوقوله : ( شهداء لله ) كما قال ( وأقيموا الشهادة لله ) أي : ليكن أداؤها ابتغاء وجه الله ، فحينئذ تكون صحيحة عادلة حقا ، خالية من التحريف والتبديل والكتمان ; ولهذا قال : ( ولو على أنفسكم ) أي : اشهد الحق ولو عاد ضررها عليك وإذا سئلت عن الأمر فقل الحق فيه ، وإن كان مضرة عليك ، فإن الله سيجعل لمن أطاعه فرجا ومخرجا من كل أمر يضيق عليه .\nوقوله : ( أو الوالدين والأقربين ) أي : وإن كانت الشهادة على والديك وقرابتك ، فلا تراعهم فيها ، بل اشهد بالحق وإن عاد ضررها عليهم ، فإن الحق حاكم على كل أحد ، وهو مقدم على كل أحد .\nوقوله : ( إن يكن غنيا أو فقيرا فالله أولى بهما ) أي : لا ترعاه لغناه ، ولا تشفق عليه لفقره ، الله يتولاهما ، بل هو أولى بهما منك ، وأعلم بما فيه صلاحهما .\nوقوله ( فلا تتبعوا الهوى أن تعدلوا ) أي : فلا يحملنكم الهوى والعصبية وبغضة الناس إليكم ، على ترك العدل في أموركم وشؤونكم ، بل الزموا العدل على أي حال كان ، كما قال تعالى : ( ولا يجرمنكم شنآن قوم على ألا تعدلوا اعدلوا هو أقرب للتقوى ) [ المائدة : 8 ]\nومن هذا القبيل قول عبد الله بن رواحة ، لما بعثه النبي صلى الله عليه وسلم يخرص على أهل خيبر ثمارهم وزرعهم ، فأرادوا أن يرشوه ليرفق بهم ، فقال : والله لقد جئتكم من عند أحب الخلق إلي ، ولأنتم أبغض إلي من أعدادكم من القردة والخنازير ، وما يحملني حبي إياه وبغضي لكم على ألا أعدل فيكم . فقالوا : \" بهذا قامت السماوات والأرض \" . وسيأتي الحديث مسندا في سورة المائدة ، إن شاء الله [ تعالى ] .\nوقوله : ( وإن تلووا أو تعرضوا ) قال مجاهد وغير واحد من السلف : ( تلووا ) أي : تحرفوا الشهادة وتغيروها ، \" واللي \" هو : التحريف وتعمد الكذب ، قال الله تعالى : ( وإن منهم لفريقا يلوون ألسنتهم بالكتاب [ لتحسبوه من الكتاب وما هو من الكتاب ويقولون هو من عند الله وما هو من عند الله ويقولون على الله الكذب وهم يعلمون ] ) [ آل عمران : 78 ] . و \" الإعراض \" هو : كتمان الشهادة وتركها ، قال الله تعالى : ( ومن يكتمها فإنه آثم قلبه ) [ البقرة : 283 ] وقال النبي صلى الله عليه وسلم : \" خير الشهداء الذي يأتي بشهادته قبل أن يسألها \" . ولهذا توعدهم الله بقوله : ( فإن الله كان بما تعملون خبيرا ) أي : وسيجازيكم بذلك .\n                                    ",
        "qortoby": " يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ بِٱلۡقِسۡطِ شُهَدَآءَ لِلَّهِ وَلَوۡ عَلَىٰٓ أَنفُسِكُمۡ أَوِ ٱلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَۚ إِن يَكُنۡ غَنِيًّا أَوۡ فَقِيرٗا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُواْ ٱلۡهَوَىٰٓ أَن تَعۡدِلُواْۚ وَإِن تَلۡوُۥٓاْ أَوۡ تُعۡرِضُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٥٣١\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا كونوا قوامين بالقسط شهداء لله ولو على أنفسكم أو الوالدين والأقربين إن يكن غنيا أو فقيرا فالله أولى بهما فلا تتبعوا الهوى أن تعدلوا وإن تلووا أو تعرضوا فإن الله كان بما تعملون خبيرا\nياأيها الذين آمنوا كونوا قوامين قوامين بناء مبالغة ، أي ليتكرر منكم القيام بالقسط ، وهو العدل في شهادتكم على أنفسكم ، وشهادة المرء على نفسه إقراره بالحقوق عليها . ثم ذكر الوالدين لوجوب برهما وعظم قدرهما ، ثم ثنى بالأقربين إذ هم مظنة المودة والتعصب ؛ فكان الأجنبي من الناس أحرى أن يقام عليه بالقسط ويشهد عليه ، فجاء الكلام في السورة في حفظ حقوق الخلق في الأموال .\nالثانية : لا خلاف بين أهل العلم في صحة أحكام هذه الآية ، وأن شهادة الولد على الوالدين الأب والأم ماضية ، ولا يمنع ذلك من برهما ، بل من برهما أن يشهد عليهما ويخلصهما من الباطل ، وهو معنى قوله تعالى : قوا أنفسكم وأهليكم نارا فإن شهد لهما أو شهدا له وهي :\nالثالثة : فقد اختلف فيها قديما وحديثا ؛ فقال ابن شهاب الزهري : كان من مضى من السلف الصالح يجيزون شهادة الوالدين والأخ ، ويتأولون في ذلك قول الله تعالى : كونوا قوامين بالقسط شهداء لله فلم يكن أحد يتهم في ذلك من السلف الصالح رضوان الله عليهم . ثم ظهرت من الناس أمور حملت الولاة على اتهامهم ، فتركت شهادة من يتهم ، وصار ذلك لا يجوز في الولد والوالد والأخ والزوج والزوجة ، وهو مذهب الحسن والنخعي والشعبي وشريح ومالك والثوري والشافعي وابن حنبل . وقد أجاز قوم شهادة بعضهم لبعض إذا كانوا عدولا . وروي عن عمر بن الخطاب أنه أجازه ؛ وكذلك روي عن عمر بن عبد العزيز ، وبه قال إسحاق والثوري والمزني . ومذهب مالك جواز شهادة الأخ لأخيه إذا كان عدلا إلا في النسب . وروى عنه ابن وهب أنها لا تجوز إذا كان في عياله أو في نصيب من مال يرثه . وقال مالك وأبو حنيفة : شهادة الزوج لزوجته لا تقبل ؛ لتواصل منافع الأملاك بينهما وهي محل الشهادة . وقال الشافعي : تجوز شهادة الزوجين بعضهما لبعض ؛ لأنهما أجنبيان ، وإنما بينهما عقد الزوجية وهو معرض للزوال . والأصل قبول الشهادة إلا حيث خص فيما عدا المخصوص فبقي على الأصل ؛ وهذا ضعيف ؛ فإن الزوجية توجب الحنان والمواصلة والألفة والمحبة ، فالتهمة قوية ظاهرة . وقد روى أبو داود من حديث سليمان بن موسى عن عمرو بن شعيب عن أبيه عن جده أن رسول الله صلى الله عليه وسلم رد شهادة الخائن والخائنة وذي الغمر على أخيه ، ورد شهادة القانع لأهل البيت وأجازها لغيرهم . قال الخطابي : ذو الغمر الذي بينه وبين المشهود عليه عداوة ظاهرة ، فترد شهادته عليه للتهمة . وقال أبو حنيفة : شهادته على العدو مقبولة إذا كان عدلا . والقانع السائل والمستطعم ، وأصل القنوع السؤال . ويقال في القانع : إنه المنقطع إلى القوم يخدمهم ويكون في حوائجهم ؛ وذلك مثل الأجير أو الوكيل ونحوه . ومعنى رد هذه الشهادة التهمة في جر المنفعة إلى نفسه ؛ لأن القانع لأهل البيت ينتفع بما يصير إليهم من نفع . وكل من جر إلى نفسه بشهادته نفعا فشهادته مردودة ؛ كمن شهد لرجل على شراء دار هو شفيعها ، أو كمن حكم له على رجل بدين وهو مفلس ، فشهد المفلس على رجل بدين ونحوه . قال الخطابي : ومن رد شهادة القانع لأهل البيت بسبب جر المنفعة فقياس قوله أن يرد شهادة الزوج لزوجته ؛ لأن ما بينهما من التهمة في جر المنفعة أكثر ؛ وإلى هذا ذهب أبو حنيفة . والحديث حجة على من أجاز شهادة الأب لابنه ؛ لأنه يجر به النفع لما جبل عليه من حبه والميل إليه ؛ ولأنه يمتلك ماله ، وقد قال صلى الله عليه وسلم : أنت ومالك لأبيك . وممن ترد شهادته عند مالك البدوي على القروي ؛ قال : إلا أن يكون في بادية أو قرية ، فأما الذي يشهد في الحضر بدويا ويدع جيرته من أهل الحضر عندي مريب . وقد روى أبو داود والدراقطني عن أبي هريرة أنه سمع رسول الله صلى الله عليه وسلم يقول : لا تجوز شهادة بدوي على صاحب قرية . قال محمد بن عبد الحكم : تأول مالك هذا الحديث على أن المراد به الشهادة في الحقوق والأموال ، ولا ترد الشهادة في الدماء وما في معناها مما يطلب به الخلق . وقال عامة أهل العلم : شهادة البدوي إذا كان عدلا يقيم الشهادة على وجهها جائزة ؛ والله أعلم . وقد مضى القول في هذا في \" البقرة \" ، ويأتي في \" براءة \" تمامها إن شاء الله تعالى .\nالرابعة : قوله تعالى : شهداء لله نصب على النعت ل ( قوامين ) ، وإن شئت كان خبرا بعد خبر . قال النحاس : وأجود من هذين أن يكون نصبا على الحال بما في قوامين من ذكر الذين آمنوا ؛ لأنه نفس المعنى ، أي كونوا قوامين بالعدل عند شهادتكم . قال ابن عطية : والحال فيه ضعيفة في المعنى ؛ لأنها تخصيص القيام بالقسط إلى معنى الشهادة فقط . ولم ينصرف شهداء لأن فيه ألف التأنيث .\nالخامسة : قوله تعالى : لله معناه لذات الله ولوجهه ولمرضاته وثوابه . ولو على أنفسكم متعلق ب شهداء ؛ هذا هو الظاهر الذي فسر عليه الناس ، وأن هذه الشهادة المذكورة هي في الحقوق فيقر بها لأهلها ، فذلك قيامه بالشهادة على نفسه ؛ كما تقدم . أدب الله جل وعز المؤمنين بهذا ؛ كما قال ابن عباس : أمروا أن يقولوا الحق ولو على أنفسهم . ويحتمل أن يكون قوله : شهداء لله معناه بالوحدانية لله ، ويتعلق قوله : ولو على أنفسكم ب قوامين والتأويل الأول أبين .\nالسادسة : قوله تعالى : إن يكن غنيا أو فقيرا فالله أولى بهما في الكلام إضمار وهو اسم كان ؛ أي إن يكن الطالب أو المشهود عليه غنيا فلا يراعى لغناه ولا يخاف منه ، وإن يكن فقيرا فلا يراعى إشفاقا عليه . فالله أولى بهما أي فيما اختار لهما من فقر وغنى . قال السدي : اختصم إلى النبي صلى الله عليه وسلم غني وفقير ، فكان ضلعه صلى الله عليه وسلم مع الفقير ، ورأى أن الفقير لا يظلم الغني ؛ فنزلت الآية .\nالسابعة : قوله تعالى : فالله أولى بهما إنما قال بهما ولم يقل \" به \" وإن كانت أو إنما تدل على الحصول الواحد ؛ لأن المعنى فالله أولى بكل واحد منهما . وقال الأخفش : تكون أو بمعنى الواو ؛ أي إن يكن غنيا وفقيرا فالله أولى بالخصمين كيفما كانا ؛ وفيه ضعف . وقيل : إنما قال : بهما لأنه قد تقدم ذكرهما ؛ كما قال تعالى : وله أخ أو أخت فلكل واحد منهما السدس .\nالثامنة : قوله تعالى : فلا تتبعوا الهوى نهي ، فإن اتباع الهوى مرد ، أي مهلك ؛ قال الله تعالى : فاحكم بين الناس بالحق ولا تتبع الهوى فيضلك عن سبيل الله فاتباع الهوى يحمل على الشهادة بغير الحق ، وعلى الجور في الحكم ، إلى غير ذلك . وقال الشعبي : أخذ الله عز وجل على الحكام ثلاثة أشياء : ألا يتبعوا الهوى ، وألا يخشوا الناس ويخشوه ، وألا يشتروا بآياته ثمنا قليلا . أن تعدلوا في موضع نصب .\nالتاسعة : قوله تعالى : وإن تلووا أو تعرضوا قرئ \" وإن تلووا \" من لويت فلانا حقه ليا إذا دفعته به ، والفعل منه \" لوى \" والأصل فيه \" لوى \" قلبت الياء ألفا لحركتها وحركة ما قبلها ، والمصدر \" ليا \" والأصل لويا ، وليانا والأصل لويانا ، ثم أدغمت الواو في الياء . وقال القتبي : \" تلووا \" من اللي في الشهادة والميل إلى أحد الخصمين . وقرأ ابن عامر والكوفيون \" تلوا \" أراد قمتم بالأمر وأعرضتم ، من قولك : وليت الأمر ، فيكون في الكلام . التوبيخ للإعراض عن القيام بالأمر وقيل : إن معنى \" تلوا \" الإعراض . فالقراءة بضم اللام تفيد معنيين : الولاية والإعراض ، والقراءة بواوين تفيد معنى واحدا وهو الإعراض . وزعم بعض النحويين أن من قرأ \" تلوا \" فقد لحن ؛ لأنه لا معنى للولاية هاهنا . قال النحاس وغيره : وليس يلزم هذا ولكن تكون \" تلوا \" بمعنى \" تلووا \" وذلك أن أصله \" تلووا \" فاستثقلت الضمة على الواو بعدها واو أخرى . فألقيت الحركة على اللام وحذفت إحدى الواوين لالتقاء الساكنين ؛ وهي كالقراءة بإسكان اللام وواوين ؛ ذكره مكي . وقال الزجاج : المعنى على قراءته \" وإن تلووا \" ثم همز الواو الأولى فصارت \" تلئوا \" ثم خففت الهمزة بإلقاء حركتها على اللام فصارت \" تلوا \" وأصلها \" تلووا \" . فتتفق القراءتان على هذا التقدير . وذكره النحاس ومكي وابن العربي وغيرهم . قال ابن عباس : هو في الخصمين يجلسان بين يدي القاضي فيكون لي القاضي وإعراضه لأحدهما على الآخر ؛ فاللي على هذا مطل الكلام وجره حتى يفوت فصل القضاء وإنفاذه للذي يميل القاضي إليه . قال ابن عطية : وقد شاهدت بعض القضاة يفعلون ذلك ، والله حسيب الكل . وقال ابن عباس أيضا والسدي وابن زيد والضحاك ومجاهد : هي في الشهود يلوي الشاهد الشهادة بلسانه ويحرفها فلا يقول الحق فيها ، أو يعرض عن أداء الحق فيها . ولفظ الآية يعم القضاء والشهادة ، وكل إنسان مأمور بأن يعدل . وفي الحديث : لي الواجد يحل عرضه وعقوبته . قال ابن الأعرابي : عقوبته حبسه ، وعرضه شكايته .\nالعاشرة : وقد استدل بعض العلماء في رد شهادة العبد بهذه الآية ؛ فقال : جعل الله تعالى الحاكم شاهدا في هذه الآية ، وذلك أدل دليل على أن العبد ليس من أهل الشهادة ؛ لأن المقصود منه الاستقلال بهذا المهم إذا دعت الحاجة إليه ، ولا يتأتى ذلك من العبد أصلا فلذلك ردت الشهادة .\n                                    ",
        "saadi": " يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ بِٱلۡقِسۡطِ شُهَدَآءَ لِلَّهِ وَلَوۡ عَلَىٰٓ أَنفُسِكُمۡ أَوِ ٱلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَۚ إِن يَكُنۡ غَنِيًّا أَوۡ فَقِيرٗا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُواْ ٱلۡهَوَىٰٓ أَن تَعۡدِلُواْۚ وَإِن تَلۡوُۥٓاْ أَوۡ تُعۡرِضُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٥٣١\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده المؤمنين أن يكونوا { قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ ْ} والقوَّام صيغة مبالغة، أي: كونوا في كل أحوالكم قائمين بالقسط الذي هو العدل في حقوق الله وحقوق عباده، فالقسط في حقوق الله أن لا يستعان بنعمه على معصيته، بل تصرف في طاعته. والقسط في حقوق الآدميين أن تؤدي جميع الحقوق التي عليك كما تطلب حقوقك. فتؤدي النفقات الواجبة، والديون، وتعامل الناس بما تحب أن يعاملوك به، من الأخلاق والمكافأة وغير ذلك. ومن أعظم أنواع القسط القسط في المقالات والقائلين، فلا يحكم لأحد القولين أو أحد المتنازعين لانتسابه أو ميله لأحدهما، بل يجعل وجهته العدل بينهما، ومن القسط أداء الشهادة التي عندك على أي وجه كان، حتى على الأحباب بل على النفس، ولهذا قال: { شُهَدَاءَ لِلَّهِ وَلَوْ عَلَى أَنْفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ إِنْ يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَى بِهِمَا ْ} أي: فلا تراعوا الغني لغناه، ولا الفقير بزعمكم رحمة له، بل اشهدوا بالحق على من كان. والقيام بالقسط من أعظم الأمور وأدل على دين القائم به، وورعه ومقامه في الإسلام، فيتعين على من نصح نفسه وأراد نجاتها أن يهتم له غاية الاهتمام، وأن يجعله نُصْب عينيه، ومحل إرادته، وأن يزيل عن نفسه كل مانع وعائق يعوقه عن إرادة القسط أو العمل به. وأعظم عائق لذلك اتباع الهوى، ولهذا نبه تعالى على إزالة هذا المانع بقوله: { فَلَا تَتَّبِعُوا الْهَوَى أَنْ تَعْدِلُوا ْ} أي: فلا تتبعوا شهوات أنفسكم المعارضة للحق، فإنكم إن اتبعتموها عدلتم عن الصواب، ولم توفقوا للعدل، فإن الهوى إما أن يعمي بصيرة صاحبه حتى يرى الحق باطلا والباطل حقا، وإما أن يعرف الحق ويتركه لأجل هواه، فمن سلم من هوى نفسه وفق للحق وهدي إلى الصراط المستقيم. ولما بيَّن أن الواجب القيام بالقسط نهى عن ما يضاد ذلك، وهو لي اللسان عن الحق في الشهادات وغيرها، وتحريف النطق عن الصواب المقصود من كل وجه، أو من بعض الوجوه، ويدخل في ذلك تحريف الشهادة وعدم تكميلها، أو تأويل الشاهد على أمر آخر، فإن هذا من اللي لأنه الانحراف عن الحق. { أَوْ تُعْرِضُوا ْ} أي: تتركوا القسط المنوط بكم، كترك الشاهد لشهادته، وترك الحاكم لحكمه الذي يجب عليه القيام به. { فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا ْ} أي: محيط بما فعلتم، يعلم أعمالكم خفيها وجليها، وفي هذا تهديد شديد للذي يلوي أو يعرض. ومن باب أولى وأحرى الذي يحكم بالباطل أو يشهد بالزور، لأنه أعظم جرما، لأن الأولين تركا الحق، وهذا ترك الحق وقام بالباطل.\n                                    "
      },
      "originalText": "۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ بِٱلۡقِسۡطِ شُهَدَآءَ لِلَّهِ وَلَوۡ عَلَىٰٓ أَنفُسِكُمۡ أَوِ ٱلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَۚ إِن يَكُنۡ غَنِيًّا أَوۡ فَقِيرٗا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُواْ ٱلۡهَوَىٰٓ أَن تَعۡدِلُواْۚ وَإِن تَلۡوُۥٓاْ أَوۡ تُعۡرِضُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٥٣١"
    },
    {
      "number": 629,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَىٰ رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ ۚ وَمَنْ يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 136,
      "juz": 5,
      "manzil": 1,
      "page": 100,
      "ruku": 81,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ ءَامِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَٱلۡكِتَٰبِ ٱلَّذِي نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلۡكِتَٰبِ ٱلَّذِيٓ أَنزَلَ مِن قَبۡلُۚ وَمَن يَكۡفُرۡ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ فَقَدۡ ضَلَّ ضَلَٰلَۢا بَعِيدًا ٦٣١\n                                    \n                                    \n                                    يأمر الله تعالى عباده المؤمنين بالدخول في جميع شرائع الإيمان وشعبه وأركانه ودعائمه ، وليس هذا من باب تحصيل الحاصل ، بل من باب تكميل الكامل وتقريره وتثبيته والاستمرار عليه . كما يقول المؤمن في كل صلاة : ( اهدنا الصراط المستقيم ) [ الفاتحة : 6 ] أي : بصرنا فيه ، وزدنا هدى ، وثبتنا عليه . فأمرهم بالإيمان به وبرسوله ، كما قال تعالى : ( يا أيها الذين آمنوا اتقوا الله وآمنوا برسوله ) [ الحديد : 28 ] .\nوقوله : ( والكتاب الذي نزل على رسوله ) يعني : القرآن ( والكتاب الذي أنزل من قبل ) وهذا جنس يشمل جميع الكتب المتقدمة ، وقال في القرآن : ( نزل ) ; لأنه نزل مفرقا منجما على الوقائع ، بحسب ما يحتاج إليه العباد إليه في معادهم ومعاشهم ، وأما الكتب المتقدمة فكانت تنزل جملة واحدة ; ولهذا قال : ( والكتاب الذي أنزل من قبل ) ثم قال ( ومن يكفر بالله وملائكته وكتبه ورسله واليوم الآخر فقد ضل ضلالا بعيدا ) أي : فقد خرج عن طريق الهدى ، وبعد عن القصد كل البعد .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ ءَامِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَٱلۡكِتَٰبِ ٱلَّذِي نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلۡكِتَٰبِ ٱلَّذِيٓ أَنزَلَ مِن قَبۡلُۚ وَمَن يَكۡفُرۡ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ فَقَدۡ ضَلَّ ضَلَٰلَۢا بَعِيدًا ٦٣١\n                                    \n                                    \n                                    يا أيها الذين آمنوا آمنوا بالله ورسوله والكتاب الذي نزل على رسوله والكتاب الذي أنزل من قبل ومن يكفر بالله وملائكته وكتبه ورسله واليوم الآخر فقد ضل ضلالا بعيدا\nقوله تعالى : يا أيها الذين آمنوا آمنوا الآية نزلت في جميع المؤمنين ؛ والمعنى : يا أيها الذين صدقوا أقيموا على تصديقكم واثبتوا عليه . والكتاب الذي نزل على رسوله أي القرآن . والكتاب الذي أنزل من قبل أي كل كتاب أنزل على النبيين . وقرأ ابن كثير وأبو عمرو وابن عامر \" نزل \" و \" أنزل \" بالضم . الباقون \" نزل \" و \" أنزل \" بالفتح . وقيل : نزلت فيمن آمن بمن تقدم محمدا صلى الله عليه وسلم من الأنبياء عليهم السلام . وقيل : إنه خطاب للمنافقين ؛ والمعنى على هذا يا أيها الذين آمنوا في الظاهر أخلصوا لله . وقيل : المراد المشركون ؛ والمعنى يا أيها الذين آمنوا باللات والعزى والطاغوت آمنوا بالله ؛ أي صدقوا بالله وبكتبه .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ ءَامِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَٱلۡكِتَٰبِ ٱلَّذِي نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلۡكِتَٰبِ ٱلَّذِيٓ أَنزَلَ مِن قَبۡلُۚ وَمَن يَكۡفُرۡ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ فَقَدۡ ضَلَّ ضَلَٰلَۢا بَعِيدًا ٦٣١\n                                        \n                                        \n                                        \n                                        اعلم أن الأمر إما أن يوجه إلى من لم يدخل في الشيء ولم يتصف بشيء منه، فهذا يكون أمرا له في الدخول فيه، وذلك كأمر من ليس بمؤمن بالإيمان، كقوله تعالى: { يَأَيُّهَا الَّذِينَ أُوتُوا الْكِتَابَ آمِنُوا بِمَا نَزَّلْنَا مُصَدِّقًا لِّمَا مَعَكُمْ ْ} الآية. وإما أن يوجه إلى من دخل في الشيء فهذا يكون أمره ليصحح ما وجد منه ويحصل ما لم يوجد، ومنه ما ذكره الله في هذه الآية من أمر المؤمنين بالإيمان، فإن ذلك يقتضي أمرهم بما يصحح إيمانهم من الإخلاص والصدق، وتجنب المفسدات والتوبة من جميع المنقصات. ويقتضي أيضا الأمر بما لم يوجد من المؤمن من علوم الإيمان وأعماله، فإنه كلما وصل إليه نص وفهم معناه واعتقده فإن ذلك من الإيمان المأمور به. وكذلك سائر الأعمال الظاهرة والباطنة، كلها من الإيمان كما دلت على ذلك النصوص الكثيرة، وأجمع عليه سلف الأمة. ثم الاستمرار على ذلك والثبات عليه إلى الممات كما قال تعالى: { يَأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ ْ} وأمر هنا بالإيمان به وبرسوله، وبالقرآن وبالكتب المتقدمة، فهذا كله من الإيمان الواجب الذي لا يكون العبد مؤمنا إلا به، إجمالا فيما لم يصل إليه تفصيله وتفصيلا فيما علم من ذلك بالتفصيل، فمن آمن هذا الإيمان المأمور به، فقد اهتدى وأنجح. { وَمَن يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا ْ} وأي ضلال أبعد من ضلال من ترك طريق الهدى المستقيم، وسلك الطريق الموصلة له إلى العذاب الأليم؟\" واعلم أن الكفر بشيء من هذه المذكورات كالكفر بجميعها، لتلازمها وامتناع وجود الإيمان ببعضها دون بعض\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ ءَامِنُواْ بِٱللَّهِ وَرَسُولِهِۦ وَٱلۡكِتَٰبِ ٱلَّذِي نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلۡكِتَٰبِ ٱلَّذِيٓ أَنزَلَ مِن قَبۡلُۚ وَمَن يَكۡفُرۡ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ فَقَدۡ ضَلَّ ضَلَٰلَۢا بَعِيدًا ٦٣١"
    },
    {
      "number": 630,
      "text": "إِنَّ الَّذِينَ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ آمَنُوا ثُمَّ كَفَرُوا ثُمَّ ازْدَادُوا كُفْرًا لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ سَبِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 137,
      "juz": 5,
      "manzil": 1,
      "page": 100,
      "ruku": 81,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ ءَامَنُواْ ثُمَّ كَفَرُواْ ثُمَّ ءَامَنُواْ ثُمَّ كَفَرُواْ ثُمَّ ٱزۡدَادُواْ كُفۡرٗا لَّمۡ يَكُنِ ٱللَّهُ لِيَغۡفِرَ لَهُمۡ وَلَا لِيَهۡدِيَهُمۡ سَبِيلَۢا ٧٣١\n                                    \n                                    \n                                    يخبر تعالى عمن دخل في الإيمان ثم رجع عنه ، ثم عاد فيه ثم رجع ، واستمر على ضلاله وازداد حتى مات ، فإنه لا توبة بعد موته ، ولا يغفر الله له ، ولا يجعل له مما هو فيه فرجا ولا مخرجا ، ولا طريقا إلى الهدى ; ولهذا قال : ( لم يكن الله ليغفر لهم ولا ليهديهم سبيلا )\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا أحمد بن عبدة ، حدثنا حفص بن جميع ، عن سماك ، عن عكرمة ، عن ابن عباس في قوله : ( ثم ازدادوا كفرا ) قال : تموا على كفرهم حتى ماتوا . وكذا قال مجاهد .\nوروى ابن أبي حاتم من طريق جابر المعلى ، عن عامر الشعبي ، عن علي ، رضي الله عنه ، أنه قال : يستتاب المرتد ، ثلاثا ، ثم تلا هذه الآية : ( إن الذين آمنوا ثم كفروا ثم آمنوا ثم كفروا ثم ازدادوا كفرا لم يكن الله ليغفر لهم ولا ليهديهم سبيلا )\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ ءَامَنُواْ ثُمَّ كَفَرُواْ ثُمَّ ءَامَنُواْ ثُمَّ كَفَرُواْ ثُمَّ ٱزۡدَادُواْ كُفۡرٗا لَّمۡ يَكُنِ ٱللَّهُ لِيَغۡفِرَ لَهُمۡ وَلَا لِيَهۡدِيَهُمۡ سَبِيلَۢا ٧٣١\n                                    \n                                    \n                                    قوله تعالى : إن الذين آمنوا ثم كفروا ثم آمنوا ثم كفروا ثم ازدادوا كفرا لم يكن الله ليغفر لهم ولا ليهديهم سبيلا\nقيل : المعنى آمنوا بموسى وكفروا بعزير ، ثم آمنوا بعزير ثم كفروا بعيسى ، ثم ازدادوا كفرا بمحمد صلى الله عليه وسلم . وقيل : إن الذين آمنوا بموسى ثم آمنوا بعزير ، ثم كفروا بعد عزير بالمسيح ، وكفرت النصارى بما جاء به موسى وآمنوا بعيسى ، ثم ازدادوا كفرا بمحمد صلى الله عليه وسلم وما جاء به من القرآن . فإن قيل : إن الله تعالى لا يغفر شيئا من الكفر فكيف قال : إن الذين آمنوا ثم كفروا ثم ازدادوا كفرا لم يكن الله ليغفر لهم فالجواب أن الكافر إذا آمن غفر له كفره ، فإذا رجع فكفر لم يغفر له الكفر الأول ؛ وهذا كما جاء في صحيح مسلم عن عبد الله قال : قال أناس لرسول الله صلى الله عليه وسلم : يا رسول الله أنؤاخذ بما عملنا في الجاهلية ؟ قال : أما من أحسن منكم في الإسلام فلا يؤاخذ بها ومن أساء أخذ بعمله في الجاهلية والإسلام . وفي رواية ومن أساء في الإسلام أخذ بالأول والآخر . الإساءة هنا بمعنى الكفر ؛ إذ لا يصح أن يراد بها هنا ارتكاب سيئة ، فإنه يلزم عليه ألا يهدم الإسلام ما سبق قبله إلا لمن يعصم من جميع السيئات إلا حين موته ، وذلك باطل بالإجماع . ومعنى : ثم ازدادوا كفرا أصروا على الكفر . لم يكن الله ليغفر لهم ولا ليهديهم يرشدهم . سبيلا طريقا إلى الجنة . وقيل : لا يخصهم بالتوفيق كما يخص أولياءه . وفي هذه الآية رد على أهل القدر ؛ فإن الله تعالى بين أنه لا يهدي الكافرين طريق خير ليعلم العبد أنه إنما ينال الهدى بالله تعالى ، ويحرم الهدى بإرادة الله تعالى أيضا . وتضمنت الآية أيضا حكم المرتدين ، وقد مضى القول فيهم في \" البقرة \" عند قوله تعالى : ومن يرتدد منكم عن دينه فيمت وهو كافر .\nقوله تعالى : بشر المنافقين بأن لهم عذابا أليما\nالتبشير الإخبار بما ظهر أثره على البشرة ، وقد تقدم بيانه في \" البقرة \" ومعنى النفاق .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ ءَامَنُواْ ثُمَّ كَفَرُواْ ثُمَّ ءَامَنُواْ ثُمَّ كَفَرُواْ ثُمَّ ٱزۡدَادُواْ كُفۡرٗا لَّمۡ يَكُنِ ٱللَّهُ لِيَغۡفِرَ لَهُمۡ وَلَا لِيَهۡدِيَهُمۡ سَبِيلَۢا ٧٣١\n                                        \n                                        \n                                        \n                                        أي: من تكرر منه الكفر بعد الإيمان فاهتدى ثم ضل، وأبصر ثم عمي، وآمن ثم كفر واستمر على كفره وازداد منه، فإنه بعيد من التوفيق والهداية لأقوم الطريق، وبعيد من المغفرة لكونه أتى بأعظم مانع يمنعه من حصولها. فإن كفره يكون عقوبة وطبعًا لا يزول كما قال تعالى: { فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ْ} { وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ ْ} ودلت الآية: أنهم إن لم يزدادوا كفرا بل رجعوا إلى الإيمان، وتركوا ما هم عليه من الكفران، فإن الله يغفر لهم، ولو تكررت منهم الردة. وإذا كان هذا الحكم في الكفر فغيره من المعاصي التي دونه من باب أولى أن العبد لو تكررت منه ثم عاد إلى التوبة، عاد الله له بالمغفرة.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ ءَامَنُواْ ثُمَّ كَفَرُواْ ثُمَّ ءَامَنُواْ ثُمَّ كَفَرُواْ ثُمَّ ٱزۡدَادُواْ كُفۡرٗا لَّمۡ يَكُنِ ٱللَّهُ لِيَغۡفِرَ لَهُمۡ وَلَا لِيَهۡدِيَهُمۡ سَبِيلَۢا ٧٣١"
    },
    {
      "number": 631,
      "text": "بَشِّرِ الْمُنَافِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 138,
      "juz": 5,
      "manzil": 1,
      "page": 100,
      "ruku": 81,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَشِّرِ ٱلۡمُنَٰفِقِينَ بِأَنَّ لَهُمۡ عَذَابًا أَلِيمًا ٨٣١\n                                    \n                                    \n                                    ثم قال : ( بشر المنافقين بأن لهم عذابا أليما ) يعني : أن المنافقين من هذه الصفة فإنهم آمنوا ثم كفروا ، فطبع على قلوبهم ،\n                                    ",
        "qortoby": "بَشِّرِ ٱلۡمُنَٰفِقِينَ بِأَنَّ لَهُمۡ عَذَابًا أَلِيمًا ٨٣١\n                                    \n                                    \n                                    التبشير الإخبار بما ظهر أثره على البشرة , وقد تقدم بيانه في \" البقرة \" ومعنى النفاق .\n                                    ",
        "saadi": "بَشِّرِ ٱلۡمُنَٰفِقِينَ بِأَنَّ لَهُمۡ عَذَابًا أَلِيمًا ٨٣١\n                                        \n                                        \n                                        \n                                        تفسير الايتين 138 و139 :ـ البشارة تستعمل في الخير، وتستعمل في الشر بقيد كما في هذه الآية. يقول تعالى: { بَشِّرِ الْمُنَافِقِينَ ْ} أي: الذين أظهروا الإسلام وأبطنوا الكفر، بأقبح بشارة وأسوئها، وهو العذاب الأليم، وذلك بسبب محبتهم الكفار وموالاتهم ونصرتهم، وتركهم لموالاة المؤمنين، فأي شيء حملهم على ذلك؟ أيبتغون عندهم العزة؟ وهذا هو الواقع من أحوال المنافقين، ساء ظنهم بالله وضعف يقينهم بنصر الله لعباده المؤمنين، ولحظوا بعض الأسباب التي عند الكافرين، وقصر نظرهم عمّا وراء ذلك، فاتخذوا الكافرين أولياء يتعززون بهم ويستنصرون. والحال أن العزة لله جميعا، فإن نواصي العباد بيده، ومشيئته نافذة فيهم. وقد تكفل بنصر دينه وعباده المؤمنين، ولو تخلل ذلك بعض الامتحان لعباده المؤمنين، وإدالة العدو عليهم إدالة غير مستمرة، فإن العاقبة والاستقرار للمؤمنين، وفي هذه الآية الترهيب العظيم من موالاة الكافرين؛ وترك موالاة المؤمنين، وأن ذلك من صفات المنافقين، وأن الإيمان يقتضي محبة المؤمنين وموالاتهم، وبغض الكافرين وعداوتهم.\n                                    "
      },
      "originalText": "بَشِّرِ ٱلۡمُنَٰفِقِينَ بِأَنَّ لَهُمۡ عَذَابًا أَلِيمًا ٨٣١"
    },
    {
      "number": 632,
      "text": "الَّذِينَ يَتَّخِذُونَ الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ ۚ أَيَبْتَغُونَ عِنْدَهُمُ الْعِزَّةَ فَإِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 139,
      "juz": 5,
      "manzil": 1,
      "page": 100,
      "ruku": 81,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَتَّخِذُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۚ أَيَبۡتَغُونَ عِندَهُمُ ٱلۡعِزَّةَ فَإِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِيعٗا ٩٣١\n                                    \n                                    \n                                    ثم وصفهم بأنهم يتخذون الكافرين أولياء من دون المؤمنين ، بمعنى أنهم معهم في الحقيقة ، يوالونهم ويسرون إليهم بالمودة ، ويقولون لهم إذا خلوا بهم : إنما نحن معكم ، إنما نحن مستهزئون . أي بالمؤمنين في إظهارنا لهم الموافقة . قال الله تعالى منكرا عليهم فيما سلكوه من موالاة الكافرين : ( أيبتغون عندهم العزة ) ؟\nثم أخبر تعالى بأن العزة كلها لله وحده لا شريك له ، ولمن جعلها له . كما قال في الآية الأخرى : ( من كان يريد العزة فلله العزة جميعا ) [ فاطر : 10 ] ، وقال تعالى : ( ولله العزة ولرسوله وللمؤمنين ولكن المنافقين لا يعلمون ) [ المنافقون : 8 ] .\nوالمقصود من هذا التهييج على طلب العزة من جناب الله ، والالتجاء إلى عبوديته ، والانتظام في جملة عباده المؤمنين الذين لهم النصرة في هذه الحياة الدنيا ، ويوم يقوم الأشهاد .\nويناسب أن يذكر هاهنا الحديث الذي رواه الإمام أحمد :\nحدثنا حسين بن محمد ، حدثنا أبو بكر بن عياش ، عن حميد الكندي ، عن عبادة بن نسي ، عن أبي ريحانة أن النبي صلى الله عليه وسلم قال : \" من انتسب إلى تسعة آباء كفار ، يريد بهم عزا وفخرا ، فهو عاشرهم في النار \" .\nتفرد به أحمد وأبو ريحانة هذا هو أزدي ، ويقال : أنصاري . اسمه شمعون بالمعجمة ، فيما قاله البخاري ، وقال غيره : بالمهملة ، والله أعلم .\n                                    ",
        "qortoby": "ٱلَّذِينَ يَتَّخِذُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۚ أَيَبۡتَغُونَ عِندَهُمُ ٱلۡعِزَّةَ فَإِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِيعٗا ٩٣١\n                                    \n                                    \n                                    قوله تعالى : الذين يتخذون الكافرين أولياء من دون المؤمنين أيبتغون عندهم العزة فإن العزة لله جميعا\nقوله تعالى : الذين يتخذون الكافرين أولياء من دون المؤمنين الذين نعت للمنافقين . وفي هذا دليل على أن من عمل معصية من الموحدين ليس بمنافق ؛ لأنه لا يتولى الكفار . وتضمنت المنع من موالاة الكافر ، وأن يتخذوا أعوانا على الأعمال المتعلقة بالدين . وفي الصحيح عن عائشة رضي الله عنها أن رجلا من المشركين لحق بالنبي صلى الله عليه وسلم يقاتل معه ، فقال له : ارجع فإنا لا نستعين بمشرك . العزة أي : الغلبة ، عزه يعزه عزا إذا غلبه . فإن العزة لله جميعا أي الغلبة والقوة لله . قال ابن عباس : \" يبتغون عندهم \" يريد بني قينقاع ، فإن ابن أبي كان يواليهم .\n                                    ",
        "saadi": "ٱلَّذِينَ يَتَّخِذُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۚ أَيَبۡتَغُونَ عِندَهُمُ ٱلۡعِزَّةَ فَإِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِيعٗا ٩٣١\n                                        \n                                        \n                                        \n                                        تفسير الايتين 138 و139 :ـ البشارة تستعمل في الخير، وتستعمل في الشر بقيد كما في هذه الآية. يقول تعالى: { بَشِّرِ الْمُنَافِقِينَ ْ} أي: الذين أظهروا الإسلام وأبطنوا الكفر، بأقبح بشارة وأسوئها، وهو العذاب الأليم، وذلك بسبب محبتهم الكفار وموالاتهم ونصرتهم، وتركهم لموالاة المؤمنين، فأي شيء حملهم على ذلك؟ أيبتغون عندهم العزة؟ وهذا هو الواقع من أحوال المنافقين، ساء ظنهم بالله وضعف يقينهم بنصر الله لعباده المؤمنين، ولحظوا بعض الأسباب التي عند الكافرين، وقصر نظرهم عمّا وراء ذلك، فاتخذوا الكافرين أولياء يتعززون بهم ويستنصرون. والحال أن العزة لله جميعا، فإن نواصي العباد بيده، ومشيئته نافذة فيهم. وقد تكفل بنصر دينه وعباده المؤمنين، ولو تخلل ذلك بعض الامتحان لعباده المؤمنين، وإدالة العدو عليهم إدالة غير مستمرة، فإن العاقبة والاستقرار للمؤمنين، وفي هذه الآية الترهيب العظيم من موالاة الكافرين؛ وترك موالاة المؤمنين، وأن ذلك من صفات المنافقين، وأن الإيمان يقتضي محبة المؤمنين وموالاتهم، وبغض الكافرين وعداوتهم.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَتَّخِذُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۚ أَيَبۡتَغُونَ عِندَهُمُ ٱلۡعِزَّةَ فَإِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِيعٗا ٩٣١"
    },
    {
      "number": 633,
      "text": "وَقَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتَابِ أَنْ إِذَا سَمِعْتُمْ آيَاتِ اللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا فَلَا تَقْعُدُوا مَعَهُمْ حَتَّىٰ يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ ۚ إِنَّكُمْ إِذًا مِثْلُهُمْ ۗ إِنَّ اللَّهَ جَامِعُ الْمُنَافِقِينَ وَالْكَافِرِينَ فِي جَهَنَّمَ جَمِيعًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 140,
      "juz": 5,
      "manzil": 1,
      "page": 100,
      "ruku": 81,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَدۡ نَزَّلَ عَلَيۡكُمۡ فِي ٱلۡكِتَٰبِ أَنۡ إِذَا سَمِعۡتُمۡ ءَايَٰتِ ٱللَّهِ يُكۡفَرُ بِهَا وَيُسۡتَهۡزَأُ بِهَا فَلَا تَقۡعُدُواْ مَعَهُمۡ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيۡرِهِۦٓ إِنَّكُمۡ إِذٗا مِّثۡلُهُمۡۗ إِنَّ ٱللَّهَ جَامِعُ ٱلۡمُنَٰفِقِينَ وَٱلۡكَٰفِرِينَ فِي جَهَنَّمَ جَمِيعًا ٠٤١\n                                    \n                                    \n                                    وقوله [ تعالى ] ( وقد نزل عليكم في الكتاب أن إذا سمعتم آيات الله يكفر بها ويستهزأ بها فلا تقعدوا معهم حتى يخوضوا في حديث غيره إنكم إذا مثلهم ) أي : إذا ارتكبتم النهي بعد وصوله إليكم ، ورضيتم بالجلوس معهم في المكان الذي يكفر فيه بآيات الله ويستهزأ وينتقص بها ، وأقررتموهم على ذلك ، فقد شاركتموهم في الذي هم فيه . فلهذا قال تعالى : ( إنكم إذا مثلهم ) [ أي ] في المأثم ، كما جاء في الحديث : \" من كان يؤمن بالله واليوم الآخر فلا يجلس على مائدة يدار عليها الخمر \" .\nوالذي أحيل عليه في هذه الآية من النهي في ذلك ، هو قوله تعالى في سورة الأنعام ، وهي مكية : ( وإذا رأيت الذين يخوضون في آياتنا فأعرض عنهم [ حتى يخوضوا في حديث غيره وإما ينسينك الشيطان فلا تقعد بعد الذكرى مع القوم الظالمين ] ) [ الأنعام : 68 ] قال مقاتل بن حيان : نسخت هذه الآية التي في الأنعام . يعني نسخ قوله : ( إنكم إذا مثلهم ) لقوله ( وما على الذين يتقون من حسابهم من شيء ولكن ذكرى لعلهم يتقون ) [ الأنعام : 69 ] .\nوقوله : ( إن الله جامع المنافقين والكافرين في جهنم جميعا ) أي : كما أشركوهم في الكفر ، كذلك شارك الله بينهم في الخلود في نار جهنم أبدا ، وجمع بينهم في دار العقوبة والنكال ، والقيود والأغلال . وشراب الحميم والغسلين لا الزلال .\n                                    ",
        "qortoby": "وَقَدۡ نَزَّلَ عَلَيۡكُمۡ فِي ٱلۡكِتَٰبِ أَنۡ إِذَا سَمِعۡتُمۡ ءَايَٰتِ ٱللَّهِ يُكۡفَرُ بِهَا وَيُسۡتَهۡزَأُ بِهَا فَلَا تَقۡعُدُواْ مَعَهُمۡ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيۡرِهِۦٓ إِنَّكُمۡ إِذٗا مِّثۡلُهُمۡۗ إِنَّ ٱللَّهَ جَامِعُ ٱلۡمُنَٰفِقِينَ وَٱلۡكَٰفِرِينَ فِي جَهَنَّمَ جَمِيعًا ٠٤١\n                                    \n                                    \n                                    وقد نزل عليكم في الكتاب أن إذا سمعتم آيات الله يكفر بها ويستهزأ بها فلا تقعدوا معهم حتى يخوضوا في حديث غيره إنكم إذا مثلهم إن الله جامع المنافقين والكافرين في جهنم جميعا\nقوله تعالى : وقد نزل عليكم في الكتاب أن إذا سمعتم آيات الله يكفر بها ويستهزأ بها الخطاب لجميع من أظهر الإيمان من محق ومنافق ؛ لأنه إذا أظهر الإيمان فقد لزمه أن يمتثل أوامر كتاب الله . فالمنزل قوله تعالى : وإذا رأيت الذين يخوضون في آياتنا فأعرض عنهم حتى يخوضوا في حديث غيره . وكان المنافقون يجلسون إلى أحبار اليهود فيسخرون من القرآن . وقرأ عاصم ويعقوب \" وقد نزل \" بفتح النون والزاي وشدها ؛ لتقدم اسم الله جل جلاله في قوله تعالى : فإن العزة لله جميعا . وقرأ حميد كذلك ، إلا أنه خفف الزاي . الباقون \" نزل \" غير مسمى الفاعل . أن إذا سمعتم آيات الله موضع أن إذا سمعتم على قراءة عاصم ويعقوب نصب بوقوع الفعل عليه . وفي قراءة الباقين رفع ؛ لكونه اسم ما لم يسم فاعله . يكفر بها أي إذا سمعتم الكفر والاستهزاء بآيات الله ؛ فأوقع السماع على الآيات ، والمراد سماع الكفر والاستهزاء ؛ كما تقول : سمعت عبد الله يلام ، أي سمعت اللوم في عبد الله .\nقوله تعالى : فلا تقعدوا معهم حتى يخوضوا في حديث غيره أي غير الكفر . إنكم إذا مثلهم فدل بهذا على وجوب اجتناب أصحاب المعاصي إذا ظهر منهم منكر ؛ لأن من لم يجتنبهم فقد رضي فعلهم ، والرضا بالكفر كفر ؛ قال الله عز وجل : إنكم إذا مثلهم . فكل من جلس في مجلس معصية ولم ينكر عليهم يكون معهم في الوزر سواء ، وينبغي أن ينكر عليهم إذا تكلموا بالمعصية وعملوا بها ؛ فإن لم يقدر على النكير عليهم فينبغي أن يقوم عنهم حتى لا يكون من أهل هذه الآية . وقد روي عن عمر بن عبد العزيز رضي الله عنه أنه أخذ قوما يشربون الخمر ، فقيل له عن أحد الحاضرين : إنه صائم ، فحمل عليه الأدب وقرأ هذه الآية إنكم إذا مثلهم أي إن الرضا بالمعصية معصية ؛ ولهذا يؤاخذ الفاعل والراضي بعقوبة المعاصي حتى يهلكوا بأجمعهم . وهذه المماثلة ليست في جميع الصفات ، ولكنه إلزام شبه بحكم الظاهر من المقارنة ؛ كما قال :\nفكل قرين بالمقارن يقتدي\nوقد تقدم . وإذا ثبت تجنب أصحاب المعاصي كما بينا فتجنب أهل البدع والأهواء أولى . وقال الكلبي : قوله تعالى : فلا تقعدوا معهم حتى يخوضوا في حديث غيره نسخ بقوله تعالى : وما على الذين يتقون من حسابهم من شيء . وقال عامة المفسرين : هي محكمة . وروى جويبر عن الضحاك قال : دخل في هذه الآية كل محدث في الدين مبتدع إلى يوم القيامة .\nقوله تعالى : إن الله جامع المنافقين الأصل \" جامع \" بالتنوين فحذف استخفافا ؛ فإنه بمعنى يجمع .\n                                    ",
        "saadi": "وَقَدۡ نَزَّلَ عَلَيۡكُمۡ فِي ٱلۡكِتَٰبِ أَنۡ إِذَا سَمِعۡتُمۡ ءَايَٰتِ ٱللَّهِ يُكۡفَرُ بِهَا وَيُسۡتَهۡزَأُ بِهَا فَلَا تَقۡعُدُواْ مَعَهُمۡ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيۡرِهِۦٓ إِنَّكُمۡ إِذٗا مِّثۡلُهُمۡۗ إِنَّ ٱللَّهَ جَامِعُ ٱلۡمُنَٰفِقِينَ وَٱلۡكَٰفِرِينَ فِي جَهَنَّمَ جَمِيعًا ٠٤١\n                                        \n                                        \n                                        \n                                        أي: وقد بيَّن الله لكم فيما أنزل عليكم حكمه الشرعي عند حضور مجالس الكفر والمعاصي { أَنْ إِذَا سَمِعْتُمْ آيَاتِ اللَّهِ يُكْفَرُ بِهَا وَيُسْتَهْزَأُ بِهَا } أي: يستهان بها. وذلك أن الواجب على كل مكلف في آيات الله الإيمان بها وتعظيمها وإجلالها وتفخيمها، وهذا المقصود بإنزالها، وهو الذي خَلَق الله الخَلْق لأجله، فضد الإيمان الكفر بها، وضد تعظيمها الاستهزاء بها واحتقارها، ويدخل في ذلك مجادلة الكفار والمنافقين لإبطال آيات الله ونصر كفرهم. وكذلك المبتدعون على اختلاف أنواعهم، فإن احتجاجهم على باطلهم يتضمن الاستهانة بآيات الله لأنها لا تدل إلا على حق، ولا تستلزم إلا صدقا، بل وكذلك يدخل فيه حضور مجالس المعاصي والفسوق التي يستهان فيها بأوامر الله ونواهيه، وتقتحم حدوده التي حدها لعباده ومنتهى هذا النهي عن القعود معهم { حَتَّى يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ } أي: غير الكفر بآيات الله والاستهزاء بها. { إِنَّكُمْ إِذًا } أي: إن قعدتم معهم في الحال المذكورة { مِثْلُهُمْ } لأنكم رضيتم بكفرهم واستهزائهم، والراضي بالمعصية كالفاعل لها، والحاصل أن من حضر مجلسا يعصى الله به، فإنه يتعين عليه الإنكار عليهم مع القدرة، أو القيام مع عدمها. { إِنَّ اللَّهَ جَامِعُ الْمُنَافِقِينَ وَالْكَافِرِينَ فِي جَهَنَّمَ جَمِيعًا } كما اجتمعوا على الكفر والموالاة ولا ينفع الكافرين مجرد كونهم في الظاهر مع المؤمنين كما قال تعالى: { يَوْمَ يَقُولُ الْمُنَافِقُونَ وَالْمُنَافِقَاتُ لِلَّذِينَ آمَنُوا انظُرُونَا نَقْتَبِسْ مِن نُّورِكُمْ } إلى آخر الآيات.\n                                    "
      },
      "originalText": "وَقَدۡ نَزَّلَ عَلَيۡكُمۡ فِي ٱلۡكِتَٰبِ أَنۡ إِذَا سَمِعۡتُمۡ ءَايَٰتِ ٱللَّهِ يُكۡفَرُ بِهَا وَيُسۡتَهۡزَأُ بِهَا فَلَا تَقۡعُدُواْ مَعَهُمۡ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيۡرِهِۦٓ إِنَّكُمۡ إِذٗا مِّثۡلُهُمۡۗ إِنَّ ٱللَّهَ جَامِعُ ٱلۡمُنَٰفِقِينَ وَٱلۡكَٰفِرِينَ فِي جَهَنَّمَ جَمِيعًا ٠٤١"
    }
  ]
}