{
  "number": 101,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 634,
      "text": "الَّذِينَ يَتَرَبَّصُونَ بِكُمْ فَإِنْ كَانَ لَكُمْ فَتْحٌ مِنَ اللَّهِ قَالُوا أَلَمْ نَكُنْ مَعَكُمْ وَإِنْ كَانَ لِلْكَافِرِينَ نَصِيبٌ قَالُوا أَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ وَنَمْنَعْكُمْ مِنَ الْمُؤْمِنِينَ ۚ فَاللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيَامَةِ ۗ وَلَنْ يَجْعَلَ اللَّهُ لِلْكَافِرِينَ عَلَى الْمُؤْمِنِينَ سَبِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 141,
      "juz": 5,
      "manzil": 1,
      "page": 101,
      "ruku": 81,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحٞ مِّنَ ٱللَّهِ قَالُوٓاْ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَٰفِرِينَ نَصِيبٞ قَالُوٓاْ أَلَمۡ نَسۡتَحۡوِذۡ عَلَيۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِينَۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ وَلَن يَجۡعَلَ ٱللَّهُ لِلۡكَٰفِرِينَ عَلَى ٱلۡمُؤۡمِنِينَ سَبِيلًا ١٤١\n                                    \n                                    \n                                    يخبر تعالى عن المنافقين أنهم يتربصون بالمؤمنين دوائر السوء ، بمعنى ينتظرون زوال دولتهم ، وظهور الكفر عليهم ، وذهاب ملتهم ( فإن كان لكم فتح من الله ) أي : نصر وتأييد وظفر وغنيمة ( قالوا ألم نكن معكم ) ؟ أي : يتوددون إلى المؤمنين بهذه المقالة ( وإن كان للكافرين نصيب ) أي : إدالة على المؤمنين في بعض الأحيان ، كما وقع يوم أحد ، فإن الرسل تبتلى ثم يكون لها العاقبة ( قالوا ألم نستحوذ عليكم ونمنعكم من المؤمنين ) ؟ أي : ساعدناكم في الباطن ، وما ألوناهم خبالا وتخذيلا حتى انتصرتم عليهم .\nوقال السدي : ( نستحوذ عليكم ) نغلب عليكم ، كقوله : ( استحوذ عليهم الشيطان ) [ المجادلة : 19 ] وهذا أيضا تودد منهم إليهم ، فإنهم كانوا يصانعون هؤلاء وهؤلاء ; ليحظوا عندهم ويأمنوا كيدهم ، وما ذاك إلا لضعف إيمانهم ، وقلة إيقانهم .\nقال الله تعالى : ( فالله يحكم بينكم يوم القيامة ) أي : بما يعلمه منكم - أيها المنافقون - من البواطن الرديئة ، فلا تغتروا بجريان الأحكام الشرعية عليكم ظاهرا في الحياة الدنيا ، لما له [ تعالى ] في ذلك من الحكمة ، فيوم القيامة لا تنفعكم ظواهركم ، بل هو يوم تبلى فيه السرائر ويحصل ما في الصدور .\nوقوله : ( ولن يجعل الله للكافرين على المؤمنين سبيلا ) قال عبد الرزاق : أنبأنا الثوري ، عن الأعمش ، عن ذر ، عن يسيع الكندي قال : جاء رجل إلى علي بن أبي طالب ، فقال : كيف هذه الآية : ( ولن يجعل الله للكافرين على المؤمنين سبيلا ) ؟ فقال علي ، رضي الله عنه : ادنه ادنه ، ثم قال : ( فالله يحكم بينكم يوم القيامة ولن يجعل الله للكافرين على المؤمنين سبيلا )\nوكذا روى ابن جريج عن عطاء الخراساني ، عن ابن عباس : ( ولن يجعل الله للكافرين على المؤمنين سبيلا ) قال : ذاك يوم القيامة . وكذا روى السدي عن أبي مالك الأشجعي : يعني يوم القيامة . وقال السدي : ( ولن يجعل الله للكافرين على المؤمنين سبيلا ) أي : حجة .\nويحتمل أن يكون المراد : ( ولن يجعل الله للكافرين على المؤمنين سبيلا ) أي : في الدنيا ، بأن يسلطوا عليهم استيلاء استئصال بالكلية ، وإن حصل لهم ظفر في بعض الأحيان على بعض الناس ، فإن العاقبة للمتقين في الدنيا والآخرة ، كما قال تعالى : ( إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا [ ويوم يقوم الأشهاد . يوم لا ينفع الظالمين معذرتهم ولهم اللعنة ولهم سوء الدار ] ) [ غافر : 51 ، 52 ] . وعلى هذا فيكون ردا على المنافقين فيما أملوه وتربصوه وانتظروه من زوال دولة المؤمنين ، وفيما سلكوه من مصانعتهم الكافرين ، خوفا على أنفسهم منهم إذا هم ظهروا على المؤمنين فاستأصلوهم ، كما قال تعالى : ( فترى الذين في قلوبهم مرض يسارعون فيهم [ يقولون نخشى أن تصيبنا دائرة فعسى الله أن يأتي بالفتح أو أمر من عنده فيصبحوا على ما أسروا في أنفسهم ] نادمين ) [ المائدة : 52 ] .\nوقد استدل كثير من العلماء بهذه الآية الكريمة على أصح قولي العلماء ، وهو المنع من بيع العبد المسلم من الكافر لما في صحة ابتياعه من التسليط له عليه والإذلال ، ومن قال منهم بالصحة يأمره بإزالة ملكه عنه في الحال ; لقوله تعالى : ( ولن يجعل الله للكافرين على المؤمنين سبيلا )\n                                    ",
        "qortoby": "ٱلَّذِينَ يَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحٞ مِّنَ ٱللَّهِ قَالُوٓاْ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَٰفِرِينَ نَصِيبٞ قَالُوٓاْ أَلَمۡ نَسۡتَحۡوِذۡ عَلَيۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِينَۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ وَلَن يَجۡعَلَ ٱللَّهُ لِلۡكَٰفِرِينَ عَلَى ٱلۡمُؤۡمِنِينَ سَبِيلًا ١٤١\n                                    \n                                    \n                                    الذين يتربصون بكم يعني المنافقين ، أي ينتظرون بكم الدوائر . فإن كان لكم فتح من الله أي غلبة على اليهود وغنيمة . قالوا ألم نكن معكم أي أعطونا من الغنيمة . وإن كان للكافرين نصيب أي ظفر . قالوا ألم نستحوذ عليكم أي ألم نغلب عليكم حتى هابكم المسلمون وخذلناهم عنكم . يقال : استحوذ على كذا أي غلب عليه ؛ ومنه قوله تعالى : استحوذ عليهم الشيطان . وقيل : أصل الاستحواذ الحوط ؛ حاذه يحوذه حوذا إذا حاطه . وهذا الفعل جاء على الأصل ، ولو أعل لكان ألم نستحذ ، والفعل على الإعلال استحاذ يستحيذ ، وعلى غير الإعلال استحوذ يستحوذ . ونمنعكم من المؤمنين أي بتخذيلنا إياهم عنكم ، وتفريقنا إياهم مما يريدونه منكم . والآية تدل على أن المنافقين كانوا يخرجون في الغزوات مع المسلمين ولهذا قالوا : ألم نكن معكم ؟ وتدل على أنهم كانوا لا يعطونهم الغنيمة ولهذا طلبوها وقالوا : ألم نكن معكم ! ويحتمل أن يريدوا بقولهم ألم نكن معكم الامتنان على المسلمين . أي كنا نعلمكم بأخبارهم وكنا أنصارا لكم .\nقوله تعالى : ولن يجعل الله للكافرين على المؤمنين سبيلا\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : ولن يجعل الله للكافرين على المؤمنين سبيلا للعلماء فيه تأويلات خمس :\nأحدها : ما روي عن يسيع الحضرمي قال : كنت عند علي بن أبي طالب رضي الله عنه فقال له رجل يا أمير المؤمنين ، أرأيت قول الله : ولن يجعل الله للكافرين على المؤمنين سبيلا كيف ذلك ، وهم يقاتلوننا ويظهرون علينا أحيانا ! فقال علي رضي الله عنه : معنى ذلك يوم القيامة يوم الحكم . وكذا قال ابن عباس : ذاك يوم القيامة . قال ابن عطية : وبهذا قال جميع أهل التأويل . قال ابن العربي : وهذا ضعيف : لعدم فائدة الخبر فيه ، وإن أوهم صدر الكلام معناه ؛ لقوله تعالى : فالله يحكم بينكم يوم القيامة فأخر الحكم إلى يوم القيامة . وجعل الأمر في الدنيا دولا تغلب الكفار تارة وتغلب أخرى ؛ بما رأى من الحكمة وسبق من الكلمة . ثم قال : ولن يجعل الله للكافرين على المؤمنين سبيلا فتوهم من توهم أن آخر الكلام يرجع إلى أوله ، وذلك يسقط فائدته ، إذ يكون تكرارا .\nالثاني : إن الله لا يجعل لهم سبيلا يمحو به دولة المؤمنين ، ويذهب آثارهم ويستبيح بيضتهم ؛ كما جاء في صحيح مسلم من حديث ثوبان عن النبي صلى الله عليه وسلم قال : وإني سألت ربي ألا يهلكها بسنة عامة وألا يسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم وإن ربي قال يا محمد إني إذا قضيت قضاء فإنه لا يرد وإني قد أعطيتك لأمتك ألا أهلكهم بسنة عامة وألا أسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم ولو اجتمع عليهم من بأقطارها حتى يكون بعضهم يهلك بعضا ويسبي بعضهم بعضا .\nالثالث : إن الله سبحانه لا يجعل للكافرين على المؤمنين سبيلا منه إلا أن يتواصوا بالباطل ولا يتناهوا عن المنكر ويتقاعدوا عن التوبة فيكون تسليط العدو من قبلهم ؛ كما قال تعالى : وما أصابكم من مصيبة فبما كسبت أيديكم . قال ابن العربي : وهذا نفيس جدا .\nقلت : ويدل عليه قوله عليه السلام في حديث ثوبان حتى يكون بعضهم يهلك بعضا ويسبي بعضهم بعضا وذلك أن \" حتى \" غاية ؛ فيقتضي ظاهر الكلام أنه لا يسلط عليهم عدوهم فيستبيحهم إلا إذا كان منهم إهلاك بعضهم لبعض ، وسبي بعضهم لبعض ، وقد وجد ذلك في هذه الأزمان بالفتن الواقعة بين المسلمين ؛ فغلظت شوكة الكافرين واستولوا على بلاد المسلمين حتى لم يبق من الإسلام إلا أقله ؛ فنسأل الله أن يتداركنا بعفوه ونصره ولطفه .\nالرابع : إن الله سبحانه لا يجعل للكافرين على المؤمنين سبيلا شرعا ؛ فإن وجد فبخلاف الشرع .\nالخامس : ولن يجعل الله للكافرين على المؤمنين سبيلا أي حجة عقلية ولا شرعية يستظهرون بها إلا أبطلها ودحضت .\nالثانية : ابن العربي : ونزع علماؤنا بهذه الآية في الاحتجاج على أن الكافر لا يملك العبد المسلم . وبه قال أشهب والشافعي : لأن الله سبحانه نفى السبيل للكافر عليه ، والملك بالشراء سبيل ، فلا يشرع له ولا ينعقد العقد بذلك . وقال ابن القاسم عن مالك ، وهو قول أبي حنيفة : إن معنى ولن يجعل الله للكافرين على المؤمنين سبيلا في دوام الملك ؛ لأنا نجد الابتداء يكون له عليه وذلك بالإرث . وصورته أن يسلم عبد كافر في يد كافر فيلزم القضاء عليه ببيعه ، فقبل الحكم عليه ببيعه مات ، فيرث العبد المسلم وارث الكافر . فهذه سبيل قد ثبت قهرا لا قصد فيه ، وإن ملك الشراء ثبت بقصد النية ، فقد أراد الكافر تملكه باختياره ، فإن حكم بعقد بيعه وثبوت ملكه فقد حقق فيه قصده ، وجعل له سبيل عليه . قال أبو عمر : وقد أجمع المسلمون على أن عتق النصراني أو اليهودي لعبده المسلم صحيح نافذ عليه . وأجمعوا أنه إذا أسلم عبد الكافر فبيع عليه أن ثمنه يدفع إليه . فدل على أنه على ملكه بيع وعلى ملكه ثبت العتق له ، إلا أنه ملك غير مستقر لوجوب بيعه عليه ؛ وذلك والله أعلم لقول الله عز وجل : ولن يجعل الله للكافرين على المؤمنين سبيلا يريد الاسترقاق والملك والعبودية ملكا مستقرا دائما .\nواختلف العلماء في شراء العبد الكافر العبد المسلم على قولين : أحدهما : البيع مفسوخ . والثاني : البيع صحيح ويباع على المشتري .\nالثالثة : واختلف العلماء أيضا من هذا الباب في رجل نصراني دبر عبدا له نصرانيا فأسلم العبد ؛ فقال مالك والشافعي في أحد قوليه : يحال بينه وبين العبد ، ويخارج على سيده النصراني ، ولا يباع عليه حتى يتبين أمره . فإن هلك النصراني وعليه دين قضي دينه من ثمن العبد المدبر ، إلا أن يكون في ماله ما يحمل المدبر فيعتق المدبر . وقال الشافعي في القول الآخر : إنه يباع عليه ساعة أسلم ؛ واختاره المزني ؛ لأن المدبر وصية ولا يجوز ترك مسلم في ملك مشرك يذله ويخارجه ، وقد صار بالإسلام عدوا له . وقال الليث بن سعد : يباع النصراني من مسلم فيعتقه ، ويكون ولاؤه للذي اشتراه وأعتقه ، ويدفع إلى النصراني ثمنه . وقالسفيان والكوفيون : إذا أسلم مدبر النصراني قوم قيمته فيسعى في قيمته ، فإن مات النصراني قبل أن يفرغ المدبر من سعايته عتق العبد وبطلت السعاية .\n                                    ",
        "saadi": "ٱلَّذِينَ يَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحٞ مِّنَ ٱللَّهِ قَالُوٓاْ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَٰفِرِينَ نَصِيبٞ قَالُوٓاْ أَلَمۡ نَسۡتَحۡوِذۡ عَلَيۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِينَۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ وَلَن يَجۡعَلَ ٱللَّهُ لِلۡكَٰفِرِينَ عَلَى ٱلۡمُؤۡمِنِينَ سَبِيلًا ١٤١\n                                        \n                                        \n                                        \n                                        ثم ذكر تحقيق موالاة المنافقين للكافرين ومعاداتهم للمؤمنين فقال: { الَّذِينَ يَتَرَبَّصُونَ بِكُمْ } أي: ينتظرون الحالة التي تصيرون عليها، وتنتهون إليها من خير أو شر، قد أعدوا لكل حالة جوابا بحسب نفاقهم. { فَإِن كَانَ لَكُمْ فَتْحٌ مِّنَ اللَّهِ قَالُوا أَلَمْ نَكُن مَّعَكُمْ } فيظهرون أنهم مع المؤمنين ظاهرا وباطنا ليسلموا من القدح والطعن عليهم، وليشركوهم في الغنيمة والفيء ولينتصروا بهم. { وَإِن كَانَ لِلْكَافِرِينَ نَصِيبٌ } ولم يقل فتح؛ لأنه لا يحصل لهم فتح، يكون مبدأ لنصرتهم المستمرة، بل غاية ما يكون أن يكون لهم نصيب غير مستقر، حكمة من الله. فإذا كان ذلك { قَالُوا أَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ } أي: نستولي عليكم { وَنَمْنَعْكُم مِّنَ الْمُؤْمِنِينَ } أي: يتصنعون عندهم بكف أيديهم عنهم مع القدرة، ومنعهم من المؤمنين بجميع وجوه المنع في تفنيدهم وتزهيدهم في القتال، ومظاهرة الأعداء عليهم، وغير ذلك مما هو معروف منهم. { فَاللَّهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيَامَةِ } فيجازي المؤمنين ظاهرا وباطنا بالجنة، ويعذب المنافقين والمنافقات والمشركين والمشركات. { وَلَن يَجْعَلَ اللَّهُ لِلْكَافِرِينَ عَلَى الْمُؤْمِنِينَ سَبِيلًا } أي: تسلطا واستيلاء عليهم، بل لا تزال طائفة من المؤمنين على الحق منصورة، لا يضرهم من خذلهم ولا من خالفهم، ولا يزال الله يحدث من أسباب النصر للمؤمنين، ودفعٍ لتسلط الكافرين، ما هو مشهود بالعيان. حتى إن [بعض] المسلمين الذين تحكمهم الطوائف الكافرة، قد بقوا محترمين لا يتعرضون لأديانهم ولا يكونون مستصغرين عندهم، بل لهم العز التام من الله، فله الحمد أوّلًا وآخرًا، وظاهرًا وباطنًا.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحٞ مِّنَ ٱللَّهِ قَالُوٓاْ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَٰفِرِينَ نَصِيبٞ قَالُوٓاْ أَلَمۡ نَسۡتَحۡوِذۡ عَلَيۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِينَۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ وَلَن يَجۡعَلَ ٱللَّهُ لِلۡكَٰفِرِينَ عَلَى ٱلۡمُؤۡمِنِينَ سَبِيلًا ١٤١"
    },
    {
      "number": 635,
      "text": "إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 142,
      "juz": 5,
      "manzil": 1,
      "page": 101,
      "ruku": 82,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلۡمُنَٰفِقِينَ يُخَٰدِعُونَ ٱللَّهَ وَهُوَ خَٰدِعُهُمۡ وَإِذَا قَامُوٓاْ إِلَى ٱلصَّلَوٰةِ قَامُواْ كُسَالَىٰ يُرَآءُونَ ٱلنَّاسَ وَلَا يَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِيلٗا ٢٤١\n                                    \n                                    \n                                    قد تقدم في أول سورة البقرة قوله تعالى : ( يخادعون الله والذين آمنوا ) [ البقرة : 9 ] وقال هاهنا : ( إن المنافقين يخادعون الله وهو خادعهم ) ولا شك أن الله تعالى لا يخادع ، فإنه العالم بالسرائر والضمائر ، ولكن المنافقين لجهلهم وقلة علمهم وعقلهم ، يعتقدون أن أمرهم كما راج عند الناس وجرت عليهم أحكام الشريعة ظاهرا ، فكذلك يكون حكمهم يوم القيامة عند الله ، وأن أمرهم يروج عنده ، كما أخبر عنهم تعالى أنهم يوم القيامة يحلفون له : أنهم كانوا على الاستقامة والسداد ، ويعتقدون أن ذلك نافع لهم عنده ، فقال تعالى : ( يوم يبعثهم الله جميعا فيحلفون له كما يحلفون لكم [ ويحسبون أنهم على شيء ألا إنهم هم الكاذبون ] ) [ المجادلة : 18 ] .\nوقوله : ( وهو خادعهم ) أي : هو الذي يستدرجهم في طغيانهم وضلالهم ، ويخذلهم عن الحق والوصول إليه في الدنيا وكذلك في يوم القيامة كما قال تعالى : ( يوم يقول المنافقون والمنافقات للذين آمنوا انظرونا نقتبس من نوركم قيل ارجعوا وراءكم فالتمسوا نورا فضرب بينهم بسور له باب باطنه فيه الرحمة وظاهره من قبله العذاب ينادونهم ألم نكن معكم قالوا بلى ولكنكم فتنتم أنفسكم وتربصتم وارتبتم وغرتكم الأماني حتى جاء أمر الله وغركم بالله الغرور فاليوم لا يؤخذ منكم فدية ولا من الذين كفروا مأواكم النار هي مولاكم وبئس المصير ألم يأن ) . [ الحديد : 13 - 15 ] وقد ورد في الحديث : \" من سمع سمع الله به ، ومن راءى راءى الله به \" وفي حديث آخر : \" إن الله يأمر بالعبد إلى الجنة فيما يبدو للناس ، ويعدل به إلى النار \" عياذا بالله من ذلك .\nوقوله : ( وإذا قاموا إلى الصلاة قاموا كسالى [ يراؤون الناس ولا يذكرون الله إلا قليلا ] ) هذه صفة المنافقين في أشرف الأعمال وأفضلها وخيرها ، وهي الصلاة . إذا قاموا إليها قاموا وهم كسالى عنها ; لأنهم لا نية لهم فيها ، ولا إيمان لهم بها ولا خشية ، ولا يعقلون معناها كما روى ابن مردويه ، من طريق عبيد الله بن زحر ، عن خالد بن أبي عمران ، عن عطاء بن أبي رباح ، عن ابن عباس قال : يكره أن يقوم الرجل إلى الصلاة وهو كسلان ، ولكن يقوم إليها طلق الوجه ، عظيم الرغبة ، شديد الفرح ، فإنه يناجي الله [ تعالى ] وإن الله أمامه يغفر له ويجيبه إذا دعاه ، ثم يتلو ابن عباس هذه الآية : ( وإذا قاموا إلى الصلاة قاموا كسالى ) وروي من غير هذا الوجه ، عن ابن عباس ، نحوه .\nفقوله تعالى : ( وإذا قاموا إلى الصلاة قاموا كسالى ) هذه صفة ظواهرهم ، كما قال : ( ولا يأتون الصلاة إلا وهم كسالى ) [ التوبة : 54 ] ثم ذكر تعالى صفة بواطنهم الفاسدة ، فقال : ( يراؤون الناس ) أي : لا إخلاص لهم [ ولا معاملة مع الله بل إنما يشهدون الصلاة تقية من الناس ومصانعة لهم ] ; ولهذا يتخلفون كثيرا عن الصلاة التي لا يرون غالبا فيها كصلاة العشاء وقت العتمة ، وصلاة الصبح في وقت الغلس ، كما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال : \" أثقل الصلاة على المنافقين صلاة العشاء وصلاة الفجر ، ولو يعلمون ما فيهما لأتوهما ولو حبوا ، ولقد هممت أن آمر بالصلاة فتقام ، ثم آمر رجلا فيصلي بالناس ، ثم أنطلق معي برجال ، معهم حزم من حطب إلى قوم لا يشهدون الصلاة ، فأحرق عليهم بيوتهم بالنار \" .\nوفي رواية : \" والذي نفسي بيده ، لو علم أحدهم أنه يجد عرقا سمينا أو مرماتين حسنتين ، لشهد الصلاة ، ولولا ما في البيوت من النساء والذرية لحرقت عليهم بيوتهم بالنار \" .\nوقال الحافظ أبو يعلى : حدثنا محمد - هو ابن أبي بكر المقدمي - حدثنا محمد بن دينار ، عن إبراهيم الهجري ، عن أبي الأحوص ، عن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" من أحسن الصلاة حيث يراه الناس ، وأساءها حيث يخلو ، فتلك استهانة ، استهان بها ربه عز وجل \" .\nوقوله : ( ولا يذكرون الله إلا قليلا ) أي : في صلاتهم لا يخشعون [ فيها ] ولا يدرون ما يقولون ، بل هم في صلاتهم ساهون لاهون ، وعما يراد بهم من الخير معرضون .\nوقد روى الإمام مالك ، عن العلاء بن عبد الرحمن ، عن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : \" تلك صلاة المنافق ، تلك صلاة المنافق ، تلك صلاة المنافق : يجلس يرقب الشمس ، حتى إذا كانت بين قرني الشيطان ، قام فنقر أربعا لا يذكر الله فيها إلا قليلا \" .\nوكذا رواه مسلم ، والترمذي ، والنسائي ، من حديث إسماعيل بن جعفر المدني ، عن العلاء بن عبد الرحمن ، به . وقال الترمذي : حسن صحيح .\n                                    ",
        "qortoby": "إِنَّ ٱلۡمُنَٰفِقِينَ يُخَٰدِعُونَ ٱللَّهَ وَهُوَ خَٰدِعُهُمۡ وَإِذَا قَامُوٓاْ إِلَى ٱلصَّلَوٰةِ قَامُواْ كُسَالَىٰ يُرَآءُونَ ٱلنَّاسَ وَلَا يَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِيلٗا ٢٤١\n                                    \n                                    \n                                    قوله : إن المنافقين يخادعون الله وهو خادعهم وإذا قاموا إلى الصلاة قاموا كسالى يراءون الناس ولا يذكرون الله إلا قليلا\nقوله تعالى : إن المنافقين يخادعون الله وهو خادعهم قد مضى في \" البقرة \" معنى الخدع . والخداع من الله مجازاتهم على خداعهم أولياءه ورسله . قال الحسن : يعطى كل إنسان من مؤمن ومنافق نور يوم القيامة فيفرح المنافقون ويظنون أنهم قد نجوا ؛ فإذا جاءوا إلى الصراط طفئ نور كل منافق ، فذلك قولهم : انظرونا نقتبس من نوركم .\nقوله تعالى : وإذا قاموا إلى الصلاة قاموا كسالى أي يصلون مراءاة وهم متكاسلون متثاقلون ، لا يرجون ثوابا ولا يعتقدون تركها عقابا . وفي صحيح الحديث : إن أثقل صلاة على المنافقين العتمة والصبح . فإن العتمة تأتي وقد أتعبهم عمل النهار فيثقل عليهم القيام إليها ، وصلاة الصبح تأتي والنوم أحب إليهم من مفروح به ، ولولا السيف ما قاموا .\nوالرياء : إظهار الجميل ليراه الناس ، لا لاتباع أمر الله ؛ وقد تقدم بيانه . ثم وصفهم بقلة الذكر عند المراءاة وعند الخوف . وقال صلى الله عليه وسلم ذاما لمن أخر الصلاة : تلك صلاة المنافقين - ثلاثا - يجلس أحدهم يرقب الشمس حتى إذا كانت بين قرني الشيطان - أو - على قرني الشيطان قام فنقر أربعا لا يذكر الله فيها إلا قليلا رواه مالك وغيره . فقيل : وصفهم بقلة الذكر لأنهم كانوا لا يذكرون الله بقراءة ولا تسبيح ، وإنما كانوا يذكرونه بالتكبير . وقيل : وصفه بالقلة لأن الله تعالى لا يقبله . وقيل : لعدم الإخلاص فيه . وهنا مسألتان :\nالأولى : بين الله تعالى في هذه الآية صلاة المنافقين ، وبينها رسوله محمد صلى الله عليه وسلم ؛ فمن صلى كصلاتهم وذكر كذكرهم لحق بهم في عدم القبول ، وخرج من مقتضى قوله تعالى : قد أفلح المؤمنون الذين هم في صلاتهم خاشعون . وسيأتي اللهم إلا أن يكون له عذر فيقتصر على الفرض حسب ما علمه النبي صلى الله عليه وسلم للأعرابي حين رآه أخل بالصلاة فقال له : إذا قمت إلى الصلاة فأسبغ الوضوء ثم استقبل القبلة ثم اقرأ ما تيسر معك من القرآن ثم اركع حتى تطمئن راكعا ثم ارفع حتى تعتدل قائما ثم اسجد حتى تطمئن ساجدا ثم ارفع حتى تطمئن جالسا ثم افعل ذلك في صلاتك كلها . رواه الأئمة . وقال صلى الله عليه وسلم : لا صلاة لمن لم يقرأ بأم القرآن . وقال : لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود . أخرجه الترمذي وقال : حديث حسن صحيح ، والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم ، يرون أن يقيم الرجل صلبه في الركوع والسجود . قال الشافعي وأحمد وإسحاق : من لا يقيم صلبه في الركوع والسجود فصلاته فاسدة ؛ لحديث النبي صلى الله عليه وسلم : لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود . قال ابن العربي : وذهب ابن القاسم وأبو حنيفة إلى أن الطمأنينة ليست بفرض . وهي رواية عراقية لا ينبغي لأحد من المالكيين أن يشتغل بها . وقد مضى في \" البقرة \" هذا المعنى .\nالثانية : قال ابن العربي : إن من صلى صلاة ليراها الناس ويرونه فيها فيشهدون له بالإيمان ، أو أراد طلب المنزلة والظهور لقبول الشهادة وجواز الإمامة فليس ذلك بالرياء المنهي عنه ، ولم يكن عليه حرج ؛ وإنما الرياء المعصية أن يظهرها صيدا للناس وطريقا إلى الأكل ، فهذه نية لا تجزئ وعليه الإعادة .\nقلت : قول \" وأراد طلب المنزلة والظهور لقبول الشهادة \" فيه نظر . وقد تقدم بيانه في \" النساء \" فتأمله هناك . ودلت هذه الآية على أن الرياء يدخل الفرض والنفل ؛ لقول الله تعالى : وإذا قاموا إلى الصلاة قاموا فعم . وقال قوم : إنما يدخل النفل خاصة ؛ لأن الفرض واجب على جميع الناس والنفل عرضة لذلك . وقيل بالعكس ؛ لأنه لو لم يأت بالنوافل لم يؤاخذ بها .\n                                    ",
        "saadi": "إِنَّ ٱلۡمُنَٰفِقِينَ يُخَٰدِعُونَ ٱللَّهَ وَهُوَ خَٰدِعُهُمۡ وَإِذَا قَامُوٓاْ إِلَى ٱلصَّلَوٰةِ قَامُواْ كُسَالَىٰ يُرَآءُونَ ٱلنَّاسَ وَلَا يَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِيلٗا ٢٤١\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن المنافقين بما كانوا عليه، من قبيح الصفات وشنائع السمات، وأن طريقتهم مخادعة الله تعالى، أي: بما أظهروه من الإيمان وأبطنوه من الكفران، ظنوا أنه يروج على الله ولا يعلمه ولا يبديه لعباده، والحال أن الله خادعهم، فمجرد وجود هذه الحال منهم ومشيهم عليها، خداع لأنفسهم. وأي: خداع أعظم ممن يسعى سعيًا يعود عليه بالهوان والذل والحرمان؟\" ويدل بمجرده على نقص عقل صاحبه، حيث جمع بين المعصية، ورآها حسنة، وظنها من العقل والمكر، فلله ما يصنع الجهل والخذلان بصاحبه\" ومن خداعه لهم يوم القيامة ما ذكره الله في قوله: { يَوْمَ يَقُولُ الْمُنَافِقُونَ وَالْمُنَافِقَاتُ لِلَّذِينَ آمَنُوا انظُرُونَا نَقْتَبِسْ مِن نُّورِكُمْ قِيلَ ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُـوا نُورًا فَضُرِبَ بَيْنَهُم بِسُـورٍ لَهُ بَابٌ بَاطِنُهُ فِيهِ الرَّحْمَـةُ وَظَاهـِرُهُ مِن قِبَلِهِ الْعَذَابُ يُنَادُونَهُمْ أَلَمْ نَكُنْ مَعَكُمْ } إلى آخر الآيات. \" وَ \" من صفاتهم أنهم { إِذَا قَامُوا إِلَى الصَّلَاةِ } -إن قاموا- التي هي أكبر الطاعات العملية { قَامُوا كُسَالَى } متثاقلين لها متبرمين من فعلها، والكسل لا يكون إلا من فقد الرغبة من قلوبهم، فلولا أن قلوبهم فارغة من الرغبة إلى الله وإلى ما عنده، عادمة للإيمان، لم يصدر منهم الكسل، { يُرَاءُونَ النَّاسَ } أي: هذا الذي انطوت عليه سرائرهم وهذا مصدر أعمالهم، مراءاة الناس، يقصدون رؤية الناس وتعظيمهم واحترامهم ولا يخلصون لله، فلهذا { لَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا } لامتلاء قلوبهم من الرياء، فإن ذكر الله تعالى وملازمته لا يكون إلا من مؤمن ممتلئ قلبه بمحبة الله وعظمته.\n                                    "
      },
      "originalText": "إِنَّ ٱلۡمُنَٰفِقِينَ يُخَٰدِعُونَ ٱللَّهَ وَهُوَ خَٰدِعُهُمۡ وَإِذَا قَامُوٓاْ إِلَى ٱلصَّلَوٰةِ قَامُواْ كُسَالَىٰ يُرَآءُونَ ٱلنَّاسَ وَلَا يَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِيلٗا ٢٤١"
    },
    {
      "number": 636,
      "text": "مُذَبْذَبِينَ بَيْنَ ذَٰلِكَ لَا إِلَىٰ هَٰؤُلَاءِ وَلَا إِلَىٰ هَٰؤُلَاءِ ۚ وَمَنْ يُضْلِلِ اللَّهُ فَلَنْ تَجِدَ لَهُ سَبِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 143,
      "juz": 5,
      "manzil": 1,
      "page": 101,
      "ruku": 82,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مُّذَبۡذَبِينَ بَيۡنَ ذَٰلِكَ لَآ إِلَىٰ هَٰٓؤُلَآءِ وَلَآ إِلَىٰ هَٰٓؤُلَآءِۚ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ٣٤١\n                                    \n                                    \n                                    وقوله : ( مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء ) يعني : المنافقين محيرين بين الإيمان والكفر ، فلا هم مع المؤمنين ظاهرا وباطنا ، ولا مع الكافرين ظاهرا وباطنا ، بل ظواهرهم مع المؤمنين ، وبواطنهم مع الكافرين . ومنهم من يعتريه الشك ، فتارة يميل إلى هؤلاء ، وتارة يميل إلى أولئك ( كلما أضاء لهم مشوا فيه وإذا أظلم عليهم قاموا ) الآية [ البقرة : 20 ] .\nقال مجاهد : ( مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء ) يعني : أصحاب محمد صلى الله عليه وسلم ( ولا إلى هؤلاء ) يعني : اليهود .\nوقال ابن جرير : حدثنا محمد بن المثنى ، حدثنا عبد الوهاب ، حدثنا عبيد الله ، عن نافع ، عن ابن عمر ، عن النبي صلى الله عليه وسلم قال : \" مثل المنافق كمثل الشاة العائرة بين الغنمين ، تعير إلى هذه مرة ، وإلى هذه مرة ، ولا تدري أيتهما تتبع \" .\nتفرد به مسلم . وقد رواه عن محمد بن المثنى مرة أخرى ، عن عبد الوهاب ، فوقف به على ابن عمر ، ولم يرفعه ، قال : حدثنا به عبد الوهاب مرتين كذلك .\nقلت : وقد رواه الإمام أحمد ، عن إسحاق بن يوسف بن عبيد الله ، به مرفوعا . وكذا رواه إسماعيل بن عياش وعلي بن عاصم ، عن عبيد الله ، عن نافع ، عن ابن عمر مرفوعا . وكذا رواه عثمان بن محمد بن أبي شيبة ، عن عبدة ، عن عبد الله ، به مرفوعا . ورواه حماد بن سلمة ، عن عبيد الله - أو عبد الله بن عمر - عن نافع ، عن ابن عمر مرفوعا . ورواه أيضا صخر بن جويرية ، عن نافع عن ابن عمر ، عن النبي صلى الله عليه وسلم ، بمثله .\nوقال الإمام أحمد : حدثنا خلف بن الوليد ، حدثنا الهذيل بن بلال ، عن ابن عبيد ، عن أبيه : أنه جلس ذات يوم بمكة وعبد الله بن عمر معه ، فقال أبي : قال رسول الله صلى الله عليه وسلم : \" إن مثل المنافق يوم القيامة كالشاة بين الربيضين من الغنم ، إن أتت هؤلاء نطحتها ، وإن أتت هؤلاء نطحتها \" فقال له ابن عمر : كذبت . فأثنى القوم على أبي خيرا - أو معروفا - فقال ابن عمر : لا أظن صاحبكم إلا كما تقولون ، ولكني شاهد نبي الله إذ قال : كالشاة بين الغنمين . فقال : هو سواء . فقال : هكذا سمعته .\nوقال أحمد : حدثنا يزيد ، حدثنا المسعودي ، عن أبي جعفر محمد بن علي قال : بينما عبيد بن عمير يقص ، وعنده عبد الله بن عمر ، فقال عبيد بن عمير : قال رسول الله صلى الله عليه وسلم : \" مثل المنافق كالشاة بين ربيضين ، إذا أتت هؤلاء نطحتها ، وإذا أتت هؤلاء نطحتها \" . فقال ابن عمر : ليس كذلك قال رسول الله صلى الله عليه وسلم إنما قال رسول الله صلى الله عليه وسلم : \" كشاة بين غنمين \" . قال : فاحتفظ الشيخ وغضب ، فلما رأى ذلك ابن عمر قال : أما إني لو لم أسمعه لم أردد ذلك عليك .\nطريق أخرى : عن ابن عمر ، قال الإمام أحمد : حدثنا عبد الرزاق ، أخبرنا معمر ، عن عثمان بن بودويه ، عن يعفر بن زوذى قال : سمعت عبيد بن عمير وهو يقص يقول : قال رسول الله صلى الله عليه وسلم : \" مثل المنافق كمثل الشاة الرابضة بين الغنمين \" . فقال ابن عمر : ويلكم . لا تكذبوا على رسول الله صلى الله عليه وسلم . إنما قال صلى الله عليه وسلم : \" مثل المنافق كمثل الشاة العائرة بين الغنمين \" .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا عبيد الله بن موسى ، أخبرنا إسرائيل ، عن أبي إسحاق ، عن أبي الأحوص ، عن عبد الله - هو ابن مسعود - قال : مثل المؤمن والمنافق والكافر مثل ثلاثة نفر انتهوا إلى واد ، فدفع أحدهم فعبر ، ثم وقع الآخر حتى إذا أتى على نصف الوادي ناداه الذي على شفير الوادي : ويلك . أين تذهب ؟ إلى الهلكة ؟ ارجع عودك على بدئك ، وناداه الذي عبر : هلم إلى النجاة . فجعل ينظر إلى هذا مرة وإلى هذا مرة ، قال : فجاءه سيل فأغرقه ، فالذي عبر المؤمن ، والذي غرق المنافق : ( مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء ) والذي مكث الكافر وقال ابن جرير : حدثنا بشر ، حدثنا يزيد ، حدثنا شعبة عن قتادة : ( مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء ) يقول : ليسوا بمؤمنين مخلصين ولا مشركين مصرحين بالشرك . قال : وذكر لنا أن نبي الله صلى الله عليه وسلم كان يضرب مثلا للمؤمن وللمنافق وللكافر ، كمثل رهط ثلاثة دفعوا إلى نهر ، فوقع المؤمن فقطع ، ثم وقع المنافق حتى إذا كاد يصل إلى المؤمن ناداه الكافر : أن هلم إلي ، فإني أخشى عليك . وناداه المؤمن : أن هلم إلي ، فإني عندي وعندي ; يحصى له ما عنده . فما زال المنافق يتردد بينهما حتى أتى أذى فغرقه . وإن المنافق لم يزل في شك وشبهة ، حتى أتى عليه الموت وهو كذلك . قال : وذكر لنا أن نبي الله صلى الله عليه وسلم كان يقول : \" مثل المنافق كمثل ثاغية بين غنمين ، رأت غنما على نشز فأتتها وشامتها فلم تعرف ، ثم رأت غنما على نشز فأتتها وشامتها فلم تعرف \" .\nولهذا قال تعالى : ( ومن يضلل الله فلن تجد له سبيلا ) أي : ومن صرفه عن طريق الهدى ( فلن تجد له وليا مرشدا ) فإنه : ( من يضلل الله فلا هادي له ) والمنافقون الذين أضلهم عن سبيل النجاة فلا هادي لهم ، ولا منقذ لهم مما هم فيه ، فإنه تعالى لا معقب لحكمه ، ولا يسأل عما يفعل وهم يسألون .\n                                    ",
        "qortoby": "مُّذَبۡذَبِينَ بَيۡنَ ذَٰلِكَ لَآ إِلَىٰ هَٰٓؤُلَآءِ وَلَآ إِلَىٰ هَٰٓؤُلَآءِۚ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ٣٤١\n                                    \n                                    \n                                    قوله تعالى : مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء ومن يضلل الله فلن تجد له سبيلا\nالمذبذب : المتردد بين أمرين ؛ والذبذبة الاضطراب . يقال : ذبذبته فتذبذب ؛ ومنه قول النابغة :\nألم تر أن الله أعطاك سورة ترى كل ملك دونها يتذبذب\nآخر :\nخيال لأم السلسبيل ودونها مسيرة شهر للبريد المذبذب\nكذا روي بكسر الذال الثانية .\nقال ابن جني : أي المهتز القلق الذي لا يثبت ولا يتمهل . فهؤلاء المنافقون مترددون بين المؤمنين والمشركين ، لا مخلصين الإيمان ولا مصرحين بالكفر . وفي صحيح مسلم من حديث ابن عمر عن النبي صلى الله عليه وسلم : مثل المنافق كمثل الشاة العائرة بين الغنمين تعير إلى هذه مرة وإلى هذه أخرى وفي رواية ( تكر ) بدل ( تعير ) . وقرأ الجمهور \" مذبذبين \" بضم الميم وفتح الذالين . وقرأ ابن عباس بكسر الذال الثانية . وفي حرف أبي \" متذبذبين \" . ويجوز الإدغام على هذه القراءة \" مذبذبين \" بتشديد الذال الأولى وكسر الثانية . وعن الحسن \" مذبذبين \" بفتح الميم والذالين .\n                                    ",
        "saadi": "مُّذَبۡذَبِينَ بَيۡنَ ذَٰلِكَ لَآ إِلَىٰ هَٰٓؤُلَآءِ وَلَآ إِلَىٰ هَٰٓؤُلَآءِۚ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ٣٤١\n                                        \n                                        \n                                        \n                                        { مُذَبْذَبِينَ بَيْنَ ذَلِكَ لَا إِلَى هَؤُلَاءِ وَلَا إِلَى هَؤُلَاءِ } أي: مترددين بين فريق المؤمنين وفريق الكافرين. فلا من المؤمنين ظاهرا وباطنا، ولا من الكافرين ظاهرا وباطنا. أعطوا باطنهم للكافرين وظاهرهم للمؤمنين، وهذا أعظم ضلال يقدر. ولهذا قـال: { وَمَن يُضْلِلِ اللَّهُ فَلَن تَجِدَ لَهُ سَبِيلًا } أي: لن تجد طريقا لهدايته ولا وسيلة لترك غوايته، لأنه انغلق عنه باب الرحمة، وصار بدله كل نقمة. فهذه الأوصاف المذمومة تدل بتنبيهها على أن المؤمنين متصفون بضدها، من الصدق ظاهرا وباطنا، والإخلاص، وأنهم لا يجهل ما عندهم، ونشاطهم في صلاتهم وعباداتهم، وكثرة ذكرهم لله تعالى. وأنهم قد هداهم الله ووفقهم للصراط المستقيم. فليعرض العاقل نفسه على هذين الأمرين وليختر أيهما أولى به، وبالله المستعان.\n                                    "
      },
      "originalText": "مُّذَبۡذَبِينَ بَيۡنَ ذَٰلِكَ لَآ إِلَىٰ هَٰٓؤُلَآءِ وَلَآ إِلَىٰ هَٰٓؤُلَآءِۚ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ٣٤١"
    },
    {
      "number": 637,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ ۚ أَتُرِيدُونَ أَنْ تَجْعَلُوا لِلَّهِ عَلَيْكُمْ سُلْطَانًا مُبِينًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 144,
      "juz": 5,
      "manzil": 1,
      "page": 101,
      "ruku": 82,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۚ أَتُرِيدُونَ أَن تَجۡعَلُواْ لِلَّهِ عَلَيۡكُمۡ سُلۡطَٰنٗا مُّبِينًا ٤٤١\n                                    \n                                    \n                                    ينهى تعالى عباده المؤمنين عن اتخاذ الكافرين أولياء من دون المؤمنين ، يعني مصاحبتهم ومصادقتهم ومناصحتهم وإسرار المودة إليهم ، وإفشاء أحوال المؤمنين الباطنة إليهم ، كما قال تعالى : ( لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه ) [ آل عمران : 28 ] أي : يحذركم عقوبته في ارتكابكم نهيه . ولهذا قال هاهنا : ( أتريدون أن تجعلوا لله عليكم سلطانا مبينا ) أي : حجة عليكم في عقوبته إياكم .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا مالك بن إسماعيل ، حدثنا سفيان بن عيينة ، عن عمرو بن دينار ، عن عكرمة عن ابن عباس قوله : ( سلطانا مبينا ) [ قال ] كل سلطان في القرآن حجة .\nوهذا إسناد صحيح . وكذا قال مجاهد ، وعكرمة ، وسعيد بن جبير ، ومحمد بن كعب القرظي ، والضحاك ، والسدي والنضر بن عربي .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۚ أَتُرِيدُونَ أَن تَجۡعَلُواْ لِلَّهِ عَلَيۡكُمۡ سُلۡطَٰنٗا مُّبِينًا ٤٤١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء من دون المؤمنين أتريدون أن تجعلوا لله عليكم سلطانا مبينا\nقوله تعالى : يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء مفعولان ؛ أي لا تجعلوا خاصتكم وبطانتكم منهم ؛ وقد تقدم هذا المعنى . أتريدون أن تجعلوا لله عليكم سلطانا مبينا أي في تعذيبه إياكم بإقامته حجته عليكم إذ قد نهاكم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۚ أَتُرِيدُونَ أَن تَجۡعَلُواْ لِلَّهِ عَلَيۡكُمۡ سُلۡطَٰنٗا مُّبِينًا ٤٤١\n                                        \n                                        \n                                        \n                                        لما ذكر أن من صفات المنافقين اتخاذ الكافرين أولياء من دون المؤمنين، نهى عباده المؤمنين أن يتصفوا بهذه الحالة القبيحة، وأن يشابهوا المنافقين، فإن ذلك موجب لأن { تَجْعَلُوا لِلَّهِ عَلَيْكُمْ سُلْطَانًا مُّبِينًا } أي: حجة واضحة على عقوبتكم، فإنه قد أنذرنا وحذرنا منها، وأخبرنا بما فيها من المفاسد، فسلوكها بعد هذا موجِب للعقاب. وفي هذه الآية دليل على كمال عدل الله، وأن الله لا يُعَذِّب أحدا قبل قيام الحجة عليه، وفيه التحذير من المعاصي؛ فإن فاعلها يجعل لله عليه سلطانا مبينا.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۚ أَتُرِيدُونَ أَن تَجۡعَلُواْ لِلَّهِ عَلَيۡكُمۡ سُلۡطَٰنٗا مُّبِينًا ٤٤١"
    },
    {
      "number": 638,
      "text": "إِنَّ الْمُنَافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَلَنْ تَجِدَ لَهُمْ نَصِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 145,
      "juz": 5,
      "manzil": 1,
      "page": 101,
      "ruku": 82,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلۡمُنَٰفِقِينَ فِي ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِيرًا ٥٤١\n                                    \n                                    \n                                    م أخبر تعالى : ( إن المنافقين في الدرك الأسفل من النار ) أي : يوم القيامة ، جزاء على كفرهم الغليظ . قال الوالبي عن ابن عباس : ( في الدرك الأسفل من النار ) أي : في أسفل النار . وقال غيره : النار دركات ، كما أن الجنة درجات . \" وقال سفيان الثوري ، عن عاصم ، عن ذكوان أبي صالح ، عن أبي هريرة : ( إن المنافقين في الدرك الأسفل من النار ) قال : في توابيت ترتج عليهم . كذا رواه ابن جرير ، عن ابن وكيع ، عن يحيى بن يمان ، عن سفيان ، به . ورواه ابن أبي حاتم ، عن المنذر بن شاذان ، عن عبيد الله بن موسى ، عن إسرائيل ، عن عاصم ، عن أبي صالح ، عن أبي هريرة : ( إن المنافقين في الدرك الأسفل من النار ) قال : الدرك الأسفل بيوت لها أبواب تطبق عليهم ، فتوقد من تحتهم ومن فوقهم .\nوقال ابن جرير : حدثنا ابن بشار ، حدثنا عبد الرحمن ، حدثنا سفيان ، عن سلمة بن كهيل ، عن خيثمة ، عن عبد الله - يعني ابن مسعود : ( إن المنافقين في الدرك الأسفل من النار ) قال : في توابيت من نار تطبق عليهم . ورواه ابن أبي حاتم ، عن أبي سعيد الأشج ، عن وكيع ، عن سفيان ، عن سلمة ، عن خيثمة ، عن ابن مسعود : ( إن المنافقين في الدرك الأسفل من النار ) قال : في توابيت من حديد مبهمة عليهم ، ومعنى قوله : ( مبهمة ) أي : مغلقة مقفلة لا يهتدى لمكان فتحها .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا أبو سلمة ، حدثنا حماد بن سلمة ، أخبرنا علي بن يزيد عن القاسم بن عبد الرحمن : أن ابن مسعود سئل عن المنافقين ، فقال : يجعلون في توابيت من نار ، فتطبق عليهم في أسفل درك من النار .\n( ولن تجد لهم نصيرا ) أي : ينقذهم مما هم فيه ، ويخرجهم من أليم العذاب .\n                                    ",
        "qortoby": "إِنَّ ٱلۡمُنَٰفِقِينَ فِي ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِيرًا ٥٤١\n                                    \n                                    \n                                    قوله تعالى : إن المنافقين في الدرك الأسفل من النار ولن تجد لهم نصيرا\nقوله تعالى : في الدرك . قرأ الكوفيون \" الدرك \" بإسكان الراء ، والأولى أفصح ؛ لأنه يقال في الجمع : أدراك مثل جمل وأجمال ؛ قاله النحاس . وقال أبو علي : هما لغتان كالشمع والشمع ونحوه ، والجمع أدراك . وقيل : جمع الدرك أدرك ؛ كفلس وأفلس . والنار دركات سبعة ؛ أي طبقات ومنازل ؛ إلا أن استعمال العرب لكل ما تسافل أدراك . يقال : للبئر أدراك ، ولما تعالى درج ؛ فللجنة درج ، وللنار أدراك . وقد تقدم هذا . فالمنافق في الدرك الأسفل وهي الهاوية ؛ لغلظ كفره وكثرة غوائله وتمكنه من أذى المؤمنين . وأعلى الدركات جهنم ثم لظى ثم الحطمة ثم السعير ثم سقر ثم الجحيم ثم الهاوية ؛ وقد يسمى جميعها باسم الطبقة الأولى ، أعاذنا الله من عذابها بمنه وكرمه . وعن ابن مسعود في تأويل قوله تعالى : في الدرك الأسفل من النار قال : توابيت من حديد مقفلة في النار تقفل عليهم . وقال ابن عمر : إن أشد الناس عذابا يوم القيامة ثلاثة : المنافقون ، ومن كفر من أصحاب المائدة ، وآل فرعون ؛ تصديق ذلك في كتاب الله تعالى ، قال الله تعالى : إن المنافقين في الدرك الأسفل من النار . وقال تعالى في أصحاب المائدة : فإني أعذبه عذابا لا أعذبه أحدا من العالمين . وقال في آل فرعون : أدخلوا آل فرعون أشد العذاب .\n                                    ",
        "saadi": "إِنَّ ٱلۡمُنَٰفِقِينَ فِي ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِيرًا ٥٤١\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن مآل المنافقين أنهم في أسفل الدركات من العذاب، وأشر الحالات من العقاب. فهم تحت سائر الكفار لأنهم شاركوهم بالكفر بالله ومعاداة رسله، وزادوا عليهم المكر والخديعة والتمكن من كثير من أنواع العداوة للمؤمنين، على وجه لا يشعر به ولا يحس. ورتبوا على ذلك جريان أحكام الإسلام عليهم، واستحقاق ما لا يستحقونه، فبذلك ونحوه استحقوا أشد العذاب، وليس لهم منقذ من عذابه ولا ناصر يدفع عنهم بعض عقابه، وهذا عام لكل منافق إلا مَنْ مَنَّ الله عليهم بالتوبة من السيئات. { وَأَصْلَحُوا } له الظواهر والبواطن { وَاعْتَصَمُوا بِاللَّهِ } والتجأوا إليه في جلب منافعهم ودفع المضار عنهم. { وَأَخْلَصُوا دِينَهُمْ } الذي هو الإسلام والإيمان والإحسان { لِلَّهِ } فقصدوا وجه الله بأعمالهم الظاهرة والباطنة وسلِمُوا من الرياء والنفاق، فمن اتصف بهذه الصفات { فَأُولَئِكَ مَعَ الْمُؤْمِنِينَ } أي: في الدنيا، والبرزخ، ويوم القيامة { وَسَوْفَ يُؤْتِ اللَّهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا } لا يعلم كنهه إلا الله، مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر. وتأمل كيف خص الاعتصام والإخلاص بالذكر، مع دخولهما في قوله: { وَأَصْلَحُوا } لأن الاعتصام والإخلاص من جملة الإصلاح، لشدة الحاجة إليهما خصوصا في هذا المقام الحرج الذي يمكن من القلوب النفاق، فلا يزيله إلا شدة الاعتصام بالله، ودوام اللجأ والافتقار إليه في دفعه، وكون الإخلاص منافيا كل المنافاة للنفاق، فذكرهما لفضلهما وتوقفِ الأعمال الظاهرة والباطنة عليهما، ولشدة الحاجة في هذا المقام إليهما. وتأمل كيف لما ذكر أن هؤلاء مع المؤمنين لم يقل: وسوف يؤتيهم أجرا عظيما، مع أن السياق فيهم. بل قال: { وَسَوْفَ يُؤْتِ اللَّهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا } لأن هذه القاعدة الشريفة -لم يزل الله يبدئ فيها ويعيد، إذا كان السياق في بعض الجزئيات، وأراد أن يرتب عليه ثوابًا أو عقابا وكان ذلك مشتركًا بينه وبين الجنس الداخل فيه، رتب الثواب في مقابلة الحكم العام الذي تندرج تحته تلك القضية وغيرها، ولئلا يتوهم اختصاص الحكم بالأمر الجزئي، فهذا من أسرار القرآن البديعة، فالتائب من المنافقين مع المؤمنين وله ثوابهم.\n                                    "
      },
      "originalText": "إِنَّ ٱلۡمُنَٰفِقِينَ فِي ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِيرًا ٥٤١"
    },
    {
      "number": 639,
      "text": "إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَاعْتَصَمُوا بِاللَّهِ وَأَخْلَصُوا دِينَهُمْ لِلَّهِ فَأُولَٰئِكَ مَعَ الْمُؤْمِنِينَ ۖ وَسَوْفَ يُؤْتِ اللَّهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 146,
      "juz": 5,
      "manzil": 1,
      "page": 101,
      "ruku": 82,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَٱعۡتَصَمُواْ بِٱللَّهِ وَأَخۡلَصُواْ دِينَهُمۡ لِلَّهِ فَأُوْلَٰٓئِكَ مَعَ ٱلۡمُؤۡمِنِينَۖ وَسَوۡفَ يُؤۡتِ ٱللَّهُ ٱلۡمُؤۡمِنِينَ أَجۡرًا عَظِيمٗا ٦٤١\n                                    \n                                    \n                                    ثم أخبر تعالى أن من تاب [ منهم ] في الدنيا تاب عليه وقبل ندمه إذا أخلص في توبته وأصلح عمله ، واعتصم بربه في جميع أمره ، فقال : ( إلا الذين تابوا وأصلحوا واعتصموا بالله وأخلصوا دينهم لله ) أي : بدلوا الرياء بالإخلاص ، فينفعهم العمل الصالح وإن قل .\nقال ابن أبي حاتم : أخبرنا يونس بن عبد الأعلى قراءة ، أنبأنا ابن وهب ، أخبرني يحيى بن أيوب ، عن عبيد الله بن زحر ، عن خالد بن أبي عمران ، عن عمرو بن مرة ، عن معاذ بن جبل : أن رسول الله صلى الله عليه وسلم قال : \" أخلص دينك ، يكفك القليل من العمل \" .\n( فأولئك مع المؤمنين ) أي : في زمرتهم يوم القيامة ( وسوف يؤت الله المؤمنين أجرا عظيما )\n                                    ",
        "qortoby": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَٱعۡتَصَمُواْ بِٱللَّهِ وَأَخۡلَصُواْ دِينَهُمۡ لِلَّهِ فَأُوْلَٰٓئِكَ مَعَ ٱلۡمُؤۡمِنِينَۖ وَسَوۡفَ يُؤۡتِ ٱللَّهُ ٱلۡمُؤۡمِنِينَ أَجۡرًا عَظِيمٗا ٦٤١\n                                    \n                                    \n                                    قوله تعالى : إلا الذين تابوا وأصلحوا واعتصموا بالله وأخلصوا دينهم لله فأولئك مع المؤمنين وسوف يؤت الله المؤمنين أجرا عظيما\nاستثناء ممن نافق . ومن شرط التائب من النفاق أن يصلح في قوله وفعله ، ويعتصم بالله أي يجعله ملجأ ومعاذا ، ويخلص دينه لله ؛ كما نصت عليه هذه الآية ؛ وإلا فليس بتائب ؛ ولهذا أوقع أجر المؤمنين في التسويف لانضمام المنافقين إليهم ، والله أعلم . روى البخاري عن الأسود قال : كنا في حلقة عبد الله فجاء حذيفة حتى قام علينا فسلم ثم قال : لقد نزل النفاق على قوم خير منكم ، قال الأسود : سبحان الله ! إن الله تعالى يقول : إن المنافقين في الدرك الأسفل من النار . فتبسم عبد الله وجلس حذيفة في ناحية المسجد ؛ فقام عبد الله فتفرق أصحابه فرماني بالحصى فأتيته . فقال حذيفة : عجبت من ضحكه وقد عرف ما قلت : لقد أنزل النفاق على قوم كانوا خيرا منكم ثم تابوا فتاب الله عليهم . وقال الفراء : معنى فأولئك مع المؤمنين أي من المؤمنين . وقال القتبي : حاد عن كلامهم غضبا عليهم فقال : فأولئك مع المؤمنين ولم يقل : هم المؤمنون . وحذفت الياء من يؤت في الخط كما حذفت في اللفظ ؛ لسكونها وسكون اللام بعدها ، ومثله يوم يناد المنادي و سندع الزبانية و يوم يدع الداعي حذفت الواوات لالتقاء الساكنين .\n                                    ",
        "saadi": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَٱعۡتَصَمُواْ بِٱللَّهِ وَأَخۡلَصُواْ دِينَهُمۡ لِلَّهِ فَأُوْلَٰٓئِكَ مَعَ ٱلۡمُؤۡمِنِينَۖ وَسَوۡفَ يُؤۡتِ ٱللَّهُ ٱلۡمُؤۡمِنِينَ أَجۡرًا عَظِيمٗا ٦٤١\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن مآل المنافقين أنهم في أسفل الدركات من العذاب، وأشر الحالات من العقاب. فهم تحت سائر الكفار لأنهم شاركوهم بالكفر بالله ومعاداة رسله، وزادوا عليهم المكر والخديعة والتمكن من كثير من أنواع العداوة للمؤمنين، على وجه لا يشعر به ولا يحس. ورتبوا على ذلك جريان أحكام الإسلام عليهم، واستحقاق ما لا يستحقونه، فبذلك ونحوه استحقوا أشد العذاب، وليس لهم منقذ من عذابه ولا ناصر يدفع عنهم بعض عقابه، وهذا عام لكل منافق إلا مَنْ مَنَّ الله عليهم بالتوبة من السيئات. { وَأَصْلَحُوا } له الظواهر والبواطن { وَاعْتَصَمُوا بِاللَّهِ } والتجأوا إليه في جلب منافعهم ودفع المضار عنهم. { وَأَخْلَصُوا دِينَهُمْ } الذي هو الإسلام والإيمان والإحسان { لِلَّهِ } فقصدوا وجه الله بأعمالهم الظاهرة والباطنة وسلِمُوا من الرياء والنفاق، فمن اتصف بهذه الصفات { فَأُولَئِكَ مَعَ الْمُؤْمِنِينَ } أي: في الدنيا، والبرزخ، ويوم القيامة { وَسَوْفَ يُؤْتِ اللَّهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا } لا يعلم كنهه إلا الله، مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر. وتأمل كيف خص الاعتصام والإخلاص بالذكر، مع دخولهما في قوله: { وَأَصْلَحُوا } لأن الاعتصام والإخلاص من جملة الإصلاح، لشدة الحاجة إليهما خصوصا في هذا المقام الحرج الذي يمكن من القلوب النفاق، فلا يزيله إلا شدة الاعتصام بالله، ودوام اللجأ والافتقار إليه في دفعه، وكون الإخلاص منافيا كل المنافاة للنفاق، فذكرهما لفضلهما وتوقفِ الأعمال الظاهرة والباطنة عليهما، ولشدة الحاجة في هذا المقام إليهما. وتأمل كيف لما ذكر أن هؤلاء مع المؤمنين لم يقل: وسوف يؤتيهم أجرا عظيما، مع أن السياق فيهم. بل قال: { وَسَوْفَ يُؤْتِ اللَّهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا } لأن هذه القاعدة الشريفة -لم يزل الله يبدئ فيها ويعيد، إذا كان السياق في بعض الجزئيات، وأراد أن يرتب عليه ثوابًا أو عقابا وكان ذلك مشتركًا بينه وبين الجنس الداخل فيه، رتب الثواب في مقابلة الحكم العام الذي تندرج تحته تلك القضية وغيرها، ولئلا يتوهم اختصاص الحكم بالأمر الجزئي، فهذا من أسرار القرآن البديعة، فالتائب من المنافقين مع المؤمنين وله ثوابهم.\n                                    "
      },
      "originalText": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَٱعۡتَصَمُواْ بِٱللَّهِ وَأَخۡلَصُواْ دِينَهُمۡ لِلَّهِ فَأُوْلَٰٓئِكَ مَعَ ٱلۡمُؤۡمِنِينَۖ وَسَوۡفَ يُؤۡتِ ٱللَّهُ ٱلۡمُؤۡمِنِينَ أَجۡرًا عَظِيمٗا ٦٤١"
    },
    {
      "number": 640,
      "text": "مَا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِنْ شَكَرْتُمْ وَآمَنْتُمْ ۚ وَكَانَ اللَّهُ شَاكِرًا عَلِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 147,
      "juz": 5,
      "manzil": 1,
      "page": 101,
      "ruku": 82,
      "hizbQuarter": 40,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَّا يَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِيمٗا ٧٤١\n                                    \n                                    \n                                   ثم قال مخبرا عن غناه عما سواه ، وأنه إنما يعذب العباد بذنوبهم ، فقال : ( ما يفعل الله بعذابكم إن شكرتم وآمنتم ) أي : أصلحتم العمل وآمنتم بالله ورسوله ، ( وكان الله شاكرا عليما ) أي : من شكر شكر له ومن آمن قلبه به علمه ، وجازاه على ذلك أوفر الجزاء .\n                                    ",
        "qortoby": "مَّا يَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِيمٗا ٧٤١\n                                    \n                                    \n                                    قوله تعالى : ما يفعل الله بعذابكم إن شكرتم وآمنتم وكان الله شاكرا عليما\nاستفهام بمعنى التقرير للمنافقين . التقدير : أي منفعة له في عذابكم إن شكرتم وآمنتم ؛ فنبه تعالى أنه لا يعذب الشاكر المؤمن ، وأن تعذيبه عباده لا يزيد في ملكه ، وتركه عقوبتهم على فعلهم لا ينقص من سلطانه . وقال مكحول : أربع من كن فيه كن له ، وثلاث من كن فيه كن عليه ؛ فالأربع اللاتي له : فالشكر والإيمان والدعاء والاستغفار ، قال الله تعالى : ما يفعل الله بعذابكم إن شكرتم وآمنتم وقال الله تعالى : وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون وقال تعالى : قل ما يعبأ بكم ربي لولا دعاؤكم . وأما الثلاث اللاتي عليه : فالمكر والبغي والنكث ؛ قال الله تعالى : فمن نكث فإنما ينكث على نفسه . وقال تعالى : ولا يحيق المكر السيئ إلا بأهله وقال تعالى : إنما بغيكم على أنفسكم . وكان الله شاكرا عليما أي يشكر عباده على طاعته . ومعنى \" يشكرهم \" يثيبهم ؛ فيتقبل العمل القليل ويعطي عليه الثواب الجزيل ، وذلك شكر منه على عبادته .والشكر في اللغة الظهور ، يقال : دابة شكور إذا أظهرت من السمن فوق ما تعطى من العلف ، وقد تقدم هذا المعنى مستوفى . والعرب تقول في المثل : \" أشكر من بروقة \" لأنها يقال : تخضر وتنضر بظل السحاب دون مطر . والله أعلم .\n                                    ",
        "saadi": "مَّا يَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِيمٗا ٧٤١\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى عن كمال غناه وسعة حلمه ورحمته وإحسانه فقال: { مَا يَفْعَلُ اللَّهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَآمَنتُمْ } والحال أن الله شاكر عليم. يعطي المتحملين لأجله الأثقال، الدائبين في الأعمال، جزيل الثواب وواسع الإحسان. ومن ترك شيئًا لله أعطاه الله خيرًا منه. ومع هذا يعلم ظاهركم وباطنكم، وأعمالكم وما تصدر عنه من إخلاص وصدق، وضد ذلك. وهو يريد منكم التوبة والإنابة والرجوع إليه، فإذا أنبتم إليه، فأي شيء يفعل بعذابكم؟ فإنه لا يتشفى بعذابكم، ولا ينتفع بعقابكم، بل العاصي لا يضر إلا نفسه، كما أن عمل المطيع لنفسه. والشكر هو خضوع القلب واعترافه بنعمة الله، وثناء اللسان على المشكور، وعمل الجوارح بطاعته وأن لا يستعين بنعمه على معاصيه.\n                                    "
      },
      "originalText": "مَّا يَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِيمٗا ٧٤١"
    }
  ]
}