{
  "number": 102,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 641,
      "text": "۞ لَا يُحِبُّ اللَّهُ الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ إِلَّا مَنْ ظُلِمَ ۚ وَكَانَ اللَّهُ سَمِيعًا عَلِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 148,
      "juz": 6,
      "manzil": 1,
      "page": 102,
      "ruku": 82,
      "hizbQuarter": 41,
      "sajda": false,
      "tafsier": {
        "ibnkther": " لَّا يُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوٓءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِيعًا عَلِيمًا ٨٤١\n                                    \n                                    \n                                    قال [ علي ] بن أبي طلحة عن ابن عباس : ( لا يحب الله الجهر بالسوء من القول ) يقول : لا يحب الله أن يدعو أحد على أحد ، إلا أن يكون مظلوما ، فإنه قد أرخص له أن يدعو على من ظلمه ، وذلك قوله : ( إلا من ظلم ) وإن صبر فهو خير له .\nوقال أبو داود : حدثنا عبيد الله بن معاذ ، حدثنا أبي ، حدثنا سفيان ، عن حبيب ، عن عطاء ، عن عائشة قالت : سرق لها شيء ، فجعلت تدعو عليه ، فقال النبي صلى الله عليه وسلم \" لا تسبخي عنه \" .\nوقال الحسن البصري : لا يدع عليه ، وليقل : اللهم أعني عليه ، واستخرج حقي منه . وفي رواية عنه قال : قد أرخص له أن يدعو على من ظلمه من غير أن يعتدي عليه .\nوقال عبد الكريم بن مالك الجزري في هذه الآية : هو الرجل يشتمك فتشتمه ، ولكن إن افترى عليك فلا تفتر عليه ; لقوله : ( ولمن انتصر بعد ظلمه فأولئك ما عليهم من سبيل ) [ الشورى : 41 ] .\nوقال أبو داود : حدثنا القعنبي ، حدثنا عبد العزيز بن محمد ، عن العلاء ، عن أبيه ، عن أبي هريرة ; أن رسول الله صلى الله عليه وسلم قال : \" المستبان ما قالا فعلى البادئ منهما ، ما لم يعتد المظلوم \" .\nوقال عبد الرزاق : أنبأنا المثنى بن الصباح ، عن مجاهد في قوله : ( لا يحب الله الجهر بالسوء من القول إلا من ظلم ) قال : ضاف رجل رجلا فلم يؤد إليه حق ضيافته ، فلما خرج أخبر الناس ، فقال : \" ضفت فلانا فلم يؤد إلي حق ضيافتي \" . فذلك الجهر بالسوء من القول إلا من ظلم ، حين لم يؤد الآخر إليه حق ضيافته .\nوقال محمد بن إسحاق ، عن ابن أبي نجيح ، عن مجاهد : ( لا يحب الله الجهر بالسوء من القول إلا من ظلم ) قال : قال هو الرجل ينزل بالرجل فلا يحسن ضيافته ، فيخرج فيقول : \" أساء ضيافتي ، ولم يحسن \" . وفي رواية هو الضيف المحول رحله ، فإنه يجهر لصاحبه بالسوء من القول .\nوكذا روي عن غير واحد ، عن مجاهد ، نحو هذا . وقد روى الجماعة سوى النسائي والترمذي ، من طريق الليث بن سعد - والترمذي من حديث ابن لهيعة - كلاهما عن يزيد بن أبي حبيب ، عن أبي الخير مرثد بن عبد الله ، عن عقبة بن عامر قال : قلنا يا رسول الله ، إنك تبعثنا فننزل بقوم فلا يقرونا ، فما ترى في ذلك ؟ قال : \" إذا نزلتم بقوم فأمروا لكم بما ينبغي للضيف ، فاقبلوا منهم ، وإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم \" .\nوقال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، سمعت أبا الجودي يحدث ، عن سعيد بن المهاجر ، عن المقدام أبي كريمة ، عن النبي صلى الله عليه وسلم أنه قال : \" أيما مسلم ضاف قوما ، فأصبح الضيف محروما ، فإن حقا على كل مسلم نصره حتى يأخذ بقرى ليلته من زرعه وماله \" .\nتفرد به أحمد من هذا الوجه وقال أحمد أيضا : حدثنا يحيى بن سعيد ، حدثنا شعبة ، حدثني منصور ، عن الشعبي عن المقدام أبي كريمة ، سمع رسول الله صلى الله عليه وسلم يقول : \" ليلة الضيف واجبة على كل مسلم ، فإن أصبح بفنائه محروما كان دينا له عليه ، إن شاء اقتضاه وإن شاء تركه \" .\nثم رواه أيضا عن غندر عن شعبة . وعن زياد بن عبد الله البكائي . عن وكيع ، وأبي نعيم ، عن سفيان الثوري - ثلاثتهم عن منصور ، به . وكذا رواه أبو داود من حديث أبي عوانة ، عن منصور ، به .\nومن هذه الأحاديث وأمثالها ذهب أحمد وغيره إلى وجوب الضيافة ، ومن هذا القبيل الحديث الذي رواه الحافظ أبو بكر البزار .\nحدثنا عمرو بن علي ، حدثنا صفوان بن عيسى ، حدثنا محمد بن عجلان ، عن أبيه ، عن أبي هريرة ; أن رجلا أتى النبي صلى الله عليه وسلم فقال : إن لي جارا يؤذيني ، فقال له : \" أخرج متاعك فضعه على الطريق \" . فأخذ الرجل متاعه فطرحه على الطريق ، فجعل كل من مر به قال : مالك ؟ قال : جاري يؤذيني . فيقول : اللهم العنه ، اللهم أخزه ! قال : فقال الرجل : ارجع إلى منزلك ، وقال لا أوذيك أبدا \" .\nوقد رواه أبو داود في كتاب الأدب ، عن أبي توبة الربيع بن نافع ، عن سليمان بن حيان أبي خالد الأحمر ، عن محمد بن عجلان به .\nثم قال البزار : لا نعلمه يروى عن أبي هريرة إلا بهذا الإسناد ، ورواه أبو جحيفة وهب بن عبد الله ، عن النبي صلى الله عليه وسلم ويوسف بن عبد الله بن سلام ، عن النبي صلى الله عليه وسلم .\n                                    ",
        "qortoby": " لَّا يُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوٓءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِيعًا عَلِيمًا ٨٤١\n                                    \n                                    \n                                    قوله تعالى : لا يحب الله الجهر بالسوء من القول إلا من ظلم وكان الله سميعا عليما\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : لا يحب الله الجهر بالسوء من القول وتم الكلام ، ثم قال : إلا من ظلم استثناء ليس من الأول في موضع نصب ؛ أي لكن من ظلم فله أن يقول ظلمني فلان . ويجوز أن يكون في موضع رفع ويكون التقدير : لا يحب الله أن يجهر أحد بالسوء إلا من ظلم . وقراءة الجمهور \" ظلم \" بضم الظاء وكسر اللام ؛ ويجوز إسكانها . ومن قرأ \" ظلم \" بفتح الظاء وفتح اللام وهو زيد بن أسلم وابن أبي إسحاق وغيرهما على ما يأتي ، فلا يجوز له أن يسكن اللام لخفة الفتحة . فعلى القراءة الأولى قالت طائفة : المعنى لا يحب الله أن يجهر أحد بالسوء من القول إلا من ظلم فلا يكره له الجهر به . ثم اختلفوا في كيفية الجهر بالسوء وما هو المباح من ذلك ؛ فقال الحسن : هو الرجل يظلم الرجل فلا يدع عليه ، ولكن ليقل : اللهم أعني عليه ، اللهم استخرج حقي ، اللهم حل بينه وبين ما يريد من ظلمي . فهذا دعاء في المدافعة وهي أقل منازل السوء . وقال ابن عباس وغيره : المباح لمن ظلم أن يدعو على من ظلمه ، وإن صبر فهو خير له ؛ فهذا إطلاق في نوع الدعاء على الظالم . وقال أيضا هو والسدي : لا بأس لمن ظلم أن ينتصر ممن ظلمه بمثل ظلمه ويجهر له بالسوء من القول . وقال ابن المستنير : إلا من ظلم معناه ؛ إلا من أكره على أن يجهر بسوء من القول كفر أو نحوه فذلك مباح . والآية على هذا في الإكراه ؛ وكذا قال قطرب : إلا من ظلم يريد المكره ؛ لأنه مظلوم فذلك موضوع عنه وإن كفر ؛ قال : ويجوز أن يكون المعنى إلا من ظلم على البدل ؛ كأنه قال : لا يحب الله إلا من ظلم ، أي لا يحب الله الظالم ؛ فكأنه يقول : يحب من ظلم أي يأجر من ظلم . والتقدير على هذا القول : لا يحب الله ذا الجهر بالسوء إلا من ظلم ، على البدل . وقال مجاهد : نزلت في الضيافة فرخص له أن يقول فيه . قال ابن جريج عن مجاهد : نزلت في رجل ضاف رجلا بفلاة من الأرض فلم يضفه فنزلت إلا من ظلم ورواه ابن أبي نجيح أيضا عن مجاهد ؛ قال : نزلت هذه الآية لا يحب الله الجهر بالسوء من القول إلا من ظلم في الرجل يمر بالرجل فلا يضيفه فرخص له أن يقول فيه : إنه لم يحسن ضيافته . وقد استدل من أوجب الضيافة بهذه الآية ؛ قالوا : لأن الظلم ممنوع منه فدل على وجوبها ؛ وهو قول الليث بن سعد . والجمهور على أنها من مكارم الأخلاق وسيأتي بيانها في \" هود \" والذي يقتضيه ظاهر الآية أن للمظلوم أن ينتصر من ظالمه - ولكن مع اقتصاد - وإن كان مؤمنا كما قال الحسن ؛ فأما أن يقابل القذف بالقذف ونحوه فلا ؛ وقد تقدم في \" البقرة \" . وإن كان كافرا فأرسل لسانك وادع بما شئت من الهلكة وبكل دعاء ؛ كما فعل النبي صلى الله عليه وسلم حيث قال : اللهم اشدد وطأتك على مضر واجعلها عليهم سنين كسني يوسف وقال : اللهم عليك بفلان وفلان سماهم . وإن كان مجاهرا بالظلم دعي عليه جهرا ، ولم يكن له عرض محترم ولا بدن محترم ولا مال محترم . وقد روى أبو داود عن عائشة قال : سرق لها شيء فجعلت تدعو عليه ؛ فقال رسول الله صلى الله عليه وسلم : لا تسبخي عنه أي لا تخففي عنه العقوبة بدعائك عليه . وروي ، أيضا عن عمرو بن الشريد عن أبيه عن رسول الله صلى الله عليه وسلم قال : لي الواجد ظلم يحل عرضه وعقوبته . قال ابن المبارك : يحل عرضه يغلظ له ، وعقوبته يحبس له . وفي صحيح مسلم مطل الغني ظلم . فالموسر المتمكن إذا طولب بالأداء ومطل ظلم ، وذلك يبيح من عرضه أن يقال فيه : فلان يمطل الناس ويحبس حقوقهم ويبيح للإمام أدبه وتعزيره حتى يرتدع عن ذلك ؛ حكي معناه عن سفيان ، وهو معنى قول ابن المبارك رضي الله عنهما .\nالثانية : وليس من هذا الباب ما وقع في صحيح مسلم من قول العباس في علي رضي الله عنهما بحضرة عمر وعثمان والزبير وعبد الرحمن بن عوف : يا أمير المؤمنين اقض بيني وبين هذا الكاذب الآثم الغادر الخائن . الحديث . ولم يرد عليه واحد منهم ؛ لأنها كانت حكومة ، كل واحد منهما يعتقدها لنفسه ، حتى أنفذ فيها عليهم عمر الواجب ؛ قاله ابن العربي . وقال علماؤنا : هذا إنما يكون فيما إذا استوت المنازل أو تقاربت ، وأما إذا تفاوتت ، فلا تمكن الغوغاء من أن تستطيل على الفضلاء ، وإنما تطلب حقها بمجرد الدعوى من غير تصريح بظلم ولا غضب ؛ وهذا صحيح وعليه تدل الآثار . ووجه آخر : وهو أن هذا القول أخرجه من العباس الغضب وصولة سلطة العمومة ! فإن العم صنو الأب ، ولا شك أن الأب إذا أطلق هذه الألفاظ على ولده إنما يحمل ذلك منه على أنه قصد الإغلاظ والردع مبالغة في تأديبه ، لا أنه موصوف بتلك الأمور ؛ ثم انضاف إلى هذا أنهم في محاجة ولاية دينية ؛ فكان العباس يعتقد أن مخالفته فيها لا تجوز ، وأن مخالفته فيها تؤدي إلى أن يتصف المخالف بتلك الأمور ؛ فأطلقها ببوادر الغضب على هذه الأوجه ؛ ولما علم الحاضرون ذلك لم ينكروا عليه ؛ أشار إلى هذا المازري والقاضي عياض وغيرهما .\nالثالثة : فأما من قرأ \" ظلم \" بالفتح في الظاء واللام - وهي ، قراءة زيد بن أسلم ، وكان من العلماء بالقرآن بالمدينة بعد محمد بن كعب القرظي ، وقراءة ابن أبي إسحاق والضحاك وابن عباس وابن جبير وعطاء بن السائب - فالمعنى : إلا من ظلم في فعل أو قول فاجهروا له بالسوء من القول ؛ في معنى النهي عن فعله والتوبيخ له والرد عليه ؛ المعنى لا يحب الله أن يقال لمن تاب من النفاق : ألست نافقت ؟ إلا من ظلم ، أي أقام على النفاق ؛ ودل على هذا قوله تعالى : إلا الذين تابوا . قال ابن زيد : وذلك أنه سبحانه لما أخبر عن المنافقين أنهم في الدرك الأسفل من النار كان ذلك جهرا بسوء من القول ، ثم قال لهم بعد ذلك : ما يفعل الله بعذابكم على معنى التأنيس والاستدعاء إلى الشكر والإيمان . ثم قال للمؤمنين : لا يحب الله الجهر بالسوء من القول إلا من ظلم في إقامته على النفاق ؛ فإنه يقال له : ألست المنافق الكافر الذي لك في الآخرة الدرك الأسفل من النار ؟ ونحو هذا من القول . وقال قوم : معنى الكلام : لا يحب الله أن يجهر أحد بالسوء من القول ، ثم استثنى استثناء منقطعا ؛ أي لكن من ظلم فإنه يجهر بالسوء ظلما وعدوانا وهو ظالم في ذلك .\nقلت : وهذا شأن كثير من الظلمة ودأبهم ؛ فإنهم مع ظلمهم يستطيلون بألسنتهم وينالون من عرض مظلومهم ما حرم عليهم . وقال أبو إسحاق الزجاج : يجوز أن يكون المعنى \" إلا من ظلم \" فقال سوءا ؛ فإنه ينبغي أن تأخذوا على يديه ؛ ويكون الاستثناء ليس من الأول .\nقلت : ويدل على هذا أحاديث منها قوله عليه السلام : خذوا على أيدي سفهائكم . وقوله : انصر أخاك ظالما أو مظلوما قالوا : هذا ننصره مظلوما فكيف ننصره ظالما ؟ قال : تكفه عن الظلم . وقال الفراء : \" إلا من ظلم \" يعني ولا من ظلم .\nقوله تعالى : وكان الله سميعا عليما تحذير للظالم حتى لا يظلم ، وللمظلوم حتى لا يتعدى الحد في الانتصار .\n                                    ",
        "saadi": " لَّا يُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوٓءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِيعًا عَلِيمًا ٨٤١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه لا يحب الجهر بالسوء من القول، أي: يبغض ذلك ويمقته ويعاقب عليه، ويشمل ذلك جميع الأقوال السيئة التي تسوء وتحزن، كالشتم والقذف والسب ونحو ذلك فإن ذلك كله من المنهي عنه الذي يبغضه الله. ويدل مفهومها أنه يحب الحسن من القول كالذكر والكلام الطيب اللين. وقوله: { إِلَّا مَن ظُلِمَ } أي: فإنه يجوز له أن يدعو على من ظلمه ويتشكى منه، ويجهر بالسوء لمن جهر له به، من غير أن يكذب عليه ولا يزيد على مظلمته، ولا يتعدى بشتمه غير ظالمه، ومع ذلك فعفوه وعـدم مقابلته أولى، كما قـال تعالى: { فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ } { وَكَانَ اللَّهُ سَمِيعًا عَلِيمًا } ولما كانت الآية قد اشتملت على الكلام السيئ والحسن والمباح، أخبر تعالى أنه { سميع } فيسمع أقوالكم، فاحذروا أن تتكلموا بما يغضب ربكم فيعاقبكم على ذلك. وفيه أيضا ترغيب على القول الحسن. { عَلِيمٌ } بنياتكم ومصدر أقوالكم.\n                                    "
      },
      "originalText": "۞ لَّا يُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوٓءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِيعًا عَلِيمًا ٨٤١"
    },
    {
      "number": 642,
      "text": "إِنْ تُبْدُوا خَيْرًا أَوْ تُخْفُوهُ أَوْ تَعْفُوا عَنْ سُوءٍ فَإِنَّ اللَّهَ كَانَ عَفُوًّا قَدِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 149,
      "juz": 6,
      "manzil": 1,
      "page": 102,
      "ruku": 82,
      "hizbQuarter": 41,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن تُبۡدُواْ خَيۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُواْ عَن سُوٓءٖ فَإِنَّ ٱللَّهَ كَانَ عَفُوّٗا قَدِيرًا ٩٤١\n                                    \n                                    \n                                    وقوله : ( إن تبدوا خيرا أو تخفوه أو تعفوا عن سوء فإن الله كان عفوا قديرا ) أي : إن تظهروا - أيها الناس - خيرا ، أو أخفيتموه ، أو عفوتم عمن أساء إليكم ، فإن ذلك مما يقربكم عند الله ويجزل ثوابكم لديه ، فإن من صفاته تعالى أن يعفو عن عباده مع قدرته على عقابهم . ولهذا قال : ( إن الله كان عفوا قديرا ) ; ولهذا ورد في الأثر : أن حملة العرش يسبحون الله ، فيقول بعضهم : سبحانك على حلمك بعد علمك . ويقول بعضهم : سبحانك على عفوك بعد قدرتك . وفي الحديث الصحيح : \" ما نقص مال من صدقة ، ولا زاد الله عبدا بعفو إلا عزا ، ومن تواضع لله رفعه الله \" .\n                                    ",
        "qortoby": "إِن تُبۡدُواْ خَيۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُواْ عَن سُوٓءٖ فَإِنَّ ٱللَّهَ كَانَ عَفُوّٗا قَدِيرًا ٩٤١\n                                    \n                                    \n                                    ثم أتبع هذا بقوله إن تبدوا خيرا أو تخفوه أو تعفوا عن سوء فندب إلى العفو ورغب فيه . والعفو من صفة الله تعالى مع القدرة على الانتقام ؛ وقد تقدم في \" آل عمران \" فضل العافين عن الناس . ففي هذه الألفاظ اليسيرة معان كثيرة لمن تأملها . وقيل : إن عفوت فإن الله يعفو عنك . روى ابن المبارك قال : حدثني من سمع الحسن يقول : إذا جثت الأمم بين يدي رب العالمين يوم القيامة نودي ليقم من أجره على الله فلا يقوم إلا من عفا في الدنيا ؛ يصدق هذا الحديث قوله تعالى : فمن عفا وأصلح فأجره على الله .\n                                    ",
        "saadi": "إِن تُبۡدُواْ خَيۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُواْ عَن سُوٓءٖ فَإِنَّ ٱللَّهَ كَانَ عَفُوّٗا قَدِيرًا ٩٤١\n                                        \n                                        \n                                        \n                                        ثم قال تعالى: { إِنْ تُبْدُوا خَيْرًا أَوْ تُخْفُوهُ } وهذا يشمل كل خير قوليّ وفعليّ، ظاهر وباطن، من واجب ومستحب. { أَوْ تَعْفُوا عَن سُوءٍ } أي: عمن ساءكم في أبدانكم وأموالكم وأعراضكم، فتسمحوا عنه، فإن الجزاء من جنس العمل. فمن عفا لله عفا الله عنه، ومن أحسن أحسن الله إليه، فلهذا قال: { فَإِنَّ اللَّهَ كَانَ عَفُوًّا قَدِيرًا } أي: يعفو عن زلات عباده وذنوبهم العظيمة فيسدل عليهم ستره، ثم يعاملهم بعفوه التام الصادر عن قدرته. وفي هذه الآية إرشاد إلى التفقه في معاني أسماء الله وصفاته، وأن الخلق والأمر صادر عنها، وهي مقتضية له، ولهذا يعلل الأحكام بالأسماء الحسنى، كما في هذه الآية. لما ذكر عمل الخير والعفو عن المسيء رتب على ذلك، بأن أحالنا على معرفة أسمائه وأن ذلك يغنينا عن ذكر ثوابها الخاص.\n                                    "
      },
      "originalText": "إِن تُبۡدُواْ خَيۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُواْ عَن سُوٓءٖ فَإِنَّ ٱللَّهَ كَانَ عَفُوّٗا قَدِيرًا ٩٤١"
    },
    {
      "number": 643,
      "text": "إِنَّ الَّذِينَ يَكْفُرُونَ بِاللَّهِ وَرُسُلِهِ وَيُرِيدُونَ أَنْ يُفَرِّقُوا بَيْنَ اللَّهِ وَرُسُلِهِ وَيَقُولُونَ نُؤْمِنُ بِبَعْضٍ وَنَكْفُرُ بِبَعْضٍ وَيُرِيدُونَ أَنْ يَتَّخِذُوا بَيْنَ ذَٰلِكَ سَبِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 150,
      "juz": 6,
      "manzil": 1,
      "page": 102,
      "ruku": 82,
      "hizbQuarter": 41,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِٱللَّهِ وَرُسُلِهِۦ وَيُرِيدُونَ أَن يُفَرِّقُواْ بَيۡنَ ٱللَّهِ وَرُسُلِهِۦ وَيَقُولُونَ نُؤۡمِنُ بِبَعۡضٖ وَنَكۡفُرُ بِبَعۡضٖ وَيُرِيدُونَ أَن يَتَّخِذُواْ بَيۡنَ ذَٰلِكَ سَبِيلًا ٠٥١\n                                    \n                                    \n                                    يتوعد [ تبارك و ] تعالى الكافرين به وبرسله من اليهود والنصارى ، حيث فرقوا بين الله ورسله في الإيمان ، فآمنوا ببعض الأنبياء وكفروا ببعض ، بمجرد التشهي والعادة ، وما ألفوا عليه آباءهم ، لا عن دليل قادهم إلى ذلك ، فإنه لا سبيل لهم إلى ذلك بل بمجرد الهوى والعصبية . فاليهود - عليهم لعائن الله - آمنوا بالأنبياء إلا عيسى ومحمدا عليهما الصلاة والسلام ، والنصارى آمنوا بالأنبياء وكفروا بخاتمهم وأشرفهم محمد صلى الله عليه وسلم ، والسامرة لا يؤمنون بنبي بعد يوشع خليفة موسى بن عمران ، والمجوس يقال : إنهم كانوا يؤمنون بنبي لهم يقال له زرادشت ، ثم كفروا بشرعه ، فرفع من بين أظهرهم ، والله أعلم .\nوالمقصود أن من كفر بنبي من الأنبياء ، فقد كفر بسائر الأنبياء ، فإن الإيمان واجب بكل نبي بعثه الله إلى أهل الأرض ، فمن رد نبوته للحسد أو العصبية أو التشهي تبين أن إيمانه بمن آمن به من الأنبياء ليس إيمانا شرعيا ، إنما هو عن غرض وهوى وعصبية ; ولهذا قال تعالى : ( إن الذين يكفرون بالله ورسله ) فوسمهم بأنهم كفار بالله ورسله ( ويريدون أن يفرقوا بين الله ورسله ) أي : في الإيمان ( ويقولون نؤمن ببعض ونكفر ببعض ويريدون أن يتخذوا بين ذلك سبيلا ) أي : طريقا ومسلكا .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِٱللَّهِ وَرُسُلِهِۦ وَيُرِيدُونَ أَن يُفَرِّقُواْ بَيۡنَ ٱللَّهِ وَرُسُلِهِۦ وَيَقُولُونَ نُؤۡمِنُ بِبَعۡضٖ وَنَكۡفُرُ بِبَعۡضٖ وَيُرِيدُونَ أَن يَتَّخِذُواْ بَيۡنَ ذَٰلِكَ سَبِيلًا ٠٥١\n                                    \n                                    \n                                    قوله تعالى : إن الذين يكفرون بالله ورسله ويريدون أن يفرقوا بين الله ورسله ويقولون نؤمن ببعض ونكفر ببعض ويريدون أن يتخذوا بين ذلك سبيلا\nفيه مسائل :\nالأولى : قوله تعالى : إن الذين يكفرون لما ذكر المشركين والمنافقين ذكر الكفار من أهل الكتاب ، اليهود والنصارى ؛ إذ كفروا بمحمد صلى الله عليه وسلم ، وبين أن الكفر به كفر بالكل ؛ لأنه ما من نبي إلا وقد أمر قومه بالإيمان بمحمد صلى الله عليه وسلم وبجميع الأنبياء عليهم الصلاة والسلام .\nومعنى يريدون أن يفرقوا بين الله ورسله أي بين الإيمان بالله ورسله ؛ فنص سبحانه على أن التفريق بين الله ورسله كفر ؛ وإنما كان كفرا لأن الله سبحانه فرض على الناس أن يعبدوه بما شرع لهم على ألسنة الرسل ، فإذا جحدوا الرسل ردوا عليهم شرائعهم ولم يقبلوها منهم ، فكانوا ممتنعين من التزام العبودية التي أمروا بالتزامها ؛ فكان كجحد الصانع سبحانه ، وجحد الصانع كفر لما فيه من ترك التزام الطاعة والعبودية . وكذلك التفريق بين رسله في الإيمان بهم كفر ، وهي :\nالثانية : قوله تعالى : ويقولون نؤمن ببعض ونكفر ببعض وهم اليهود آمنوا بموسى وكفروا بعيسى ومحمد ؛ وقد تقدم هذا من قولهم في \" البقرة \" . ويقولون لعوامهم : لم نجد ذكر محمد في كتبنا . ويريدون أن يتخذوا بين ذلك سبيلا أي يتخذوا بين الإيمان والجحد طريقا ، أي دينا مبتدعا بين الإسلام واليهودية . وقال : ذلك ولم يقل ذينك ؛ لأن ذلك تقع للاثنين ولو كان ذينك لجاز .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِٱللَّهِ وَرُسُلِهِۦ وَيُرِيدُونَ أَن يُفَرِّقُواْ بَيۡنَ ٱللَّهِ وَرُسُلِهِۦ وَيَقُولُونَ نُؤۡمِنُ بِبَعۡضٖ وَنَكۡفُرُ بِبَعۡضٖ وَيُرِيدُونَ أَن يَتَّخِذُواْ بَيۡنَ ذَٰلِكَ سَبِيلًا ٠٥١\n                                        \n                                        \n                                        \n                                        هنا قسمان قد وضحا لكل أحد: مؤمنٌ بالله وبرسله كلِّهم وكتبه، وكافرٌ بذلك كله.\nوبقي قسم ثالث: وهو الذي يزعم أنه يؤمن ببعض الرسل دون بعض، وأن هذا سبيل ينجيه من عذاب الله، إنْ هذا إلا مجرد أماني. فإن هؤلاء يريدون التفريق بين الله وبين رسله.\nفإن من تولى الله حقيقة تولى جميع رسله لأن ذلك من تمام توليه، ومن عادى أحدا من رسله فقد عادى الله وعادى جميع رسله، كما قال تعالى: مَنْ كَانَ عَدُوًّا لِلَّهِ الآيات.\nوكذلك مَنْ كفر برسول فقد كفر بجميع الرسل، بل بالرسول الذي يزعم أنه به مؤمن، ولهذا قال:\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِٱللَّهِ وَرُسُلِهِۦ وَيُرِيدُونَ أَن يُفَرِّقُواْ بَيۡنَ ٱللَّهِ وَرُسُلِهِۦ وَيَقُولُونَ نُؤۡمِنُ بِبَعۡضٖ وَنَكۡفُرُ بِبَعۡضٖ وَيُرِيدُونَ أَن يَتَّخِذُواْ بَيۡنَ ذَٰلِكَ سَبِيلًا ٠٥١"
    },
    {
      "number": 644,
      "text": "أُولَٰئِكَ هُمُ الْكَافِرُونَ حَقًّا ۚ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 151,
      "juz": 6,
      "manzil": 1,
      "page": 102,
      "ruku": 82,
      "hizbQuarter": 41,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ حَقّٗاۚ وَأَعۡتَدۡنَا لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ١٥١\n                                    \n                                    \n                                    ثم أخبر تعالى عنهم ، فقال : ( أولئك هم الكافرون حقا ) أي : كفرهم محقق لا محالة بمن ادعوا الإيمان به ; لأنه ليس شرعيا ، إذ لو كانوا مؤمنين به لكونه رسول الله لآمنوا بنظيره ، وبمن هو أوضح دليلا وأقوى برهانا منه ، لو نظروا حق النظر في نبوته .\nوقوله : ( وأعتدنا للكافرين عذابا مهينا ) أي : كما استهانوا بمن كفروا به إما لعدم نظرهم فيما جاءهم به من الله ، وإعراضهم عنه وإقبالهم على جمع حطام الدنيا مما لا ضرورة بهم إليه ، وإما بكفرهم به بعد علمهم بنبوته ، كما كان يفعله كثير من أحبار اليهود في زمان رسول الله صلى الله عليه وسلم حيث حسدوه على ما آتاه الله من النبوة العظيمة ، وخالفوه وكذبوه وعادوه وقاتلوه ، فسلط الله عليهم الذل الدنيوي الموصول بالذل الأخروي : ( وضربت عليهم الذلة والمسكنة وباؤوا بغضب من الله ) [ البقرة : 61 ] في الدنيا والآخرة .\n                                    ",
        "qortoby": "أُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ حَقّٗاۚ وَأَعۡتَدۡنَا لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ١٥١\n                                    \n                                    \n                                    قوله تعالى : أولئك هم الكافرون حقا تأكيد يزيل التوهم في إيمانهم حين وصفهم بأنهم يقولون نؤمن ببعض ، وأن ذلك لا ينفعهم إذا كفروا برسوله ؛ وإذا كفروا برسوله فقد كفروا به عز وجل ، وكفروا بكل رسول مبشر بذلك الرسول ؛ فلذلك صاروا الكافرين حقا . وللكافرين يقوم مقام المفعول الثاني ل \" أعتدنا \" ؛ أي أعتدنا لجميع أصنافهم عذابا مهينا أي مذلا .\n                                    ",
        "saadi": "أُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ حَقّٗاۚ وَأَعۡتَدۡنَا لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ١٥١\n                                        \n                                        \n                                        \n                                        ( أُولَئِكَ هُـمُ الْكَـافِرُونَ حَقًّا ) وذلك لئلا يتوهم أن مرتبتهم متوسطة بين الإيمان والكفر.\nووجه كونهم كافرين - حتى بما زعموا الإيمان به- أن كل دليل دلهم على الإيمان بمن آمنوا به موجود هو أو مثله أو ما فوقه للنبي الذي كفروا به، وكل شبهة يزعمون أنهم يقدحون بها في النبي الذي كفروا به موجود مثلها أو أعظم منها فيمن آمنوا به.\nفلم يبق بعد ذلك إلا التشهي والهوى ومجرد الدعوى التي يمكن كل أحد أن يقابلها بمثلها، ولما ذكر أن هؤلاء هم الكافرون حقا ذكر عقابا شاملا لهم ولكل كافر فقال: ( وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُّهِينًا ) كما تكبروا عن الإيمان بالله، أهانهم بالعذاب الأليم المخزي.\n                                    "
      },
      "originalText": "أُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ حَقّٗاۚ وَأَعۡتَدۡنَا لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ١٥١"
    },
    {
      "number": 645,
      "text": "وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ وَلَمْ يُفَرِّقُوا بَيْنَ أَحَدٍ مِنْهُمْ أُولَٰئِكَ سَوْفَ يُؤْتِيهِمْ أُجُورَهُمْ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 152,
      "juz": 6,
      "manzil": 1,
      "page": 102,
      "ruku": 82,
      "hizbQuarter": 41,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦ وَلَمۡ يُفَرِّقُواْ بَيۡنَ أَحَدٖ مِّنۡهُمۡ أُوْلَٰٓئِكَ سَوۡفَ يُؤۡتِيهِمۡ أُجُورَهُمۡۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٢٥١\n                                    \n                                    \n                                    وقوله : ( والذين آمنوا بالله ورسله ولم يفرقوا بين أحد منهم ) يعني بذلك : أمة محمد صلى الله عليه وسلم ، فإنهم يؤمنون بكل كتاب أنزله الله وبكل نبي بعثه الله ، كما قال تعالى : ( آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله [ وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ] ) [ البقرة : 285 ] .\nثم أخبر تعالى بأنه قد أعد لهم الجزاء الجزيل والثواب الجليل والعطاء الجميل ، فقال : ( أولئك سوف يؤتيهم أجورهم ) على ما آمنوا بالله ورسله ( وكان الله غفورا رحيما ) أي : لذنوبهم أي : إن كان لبعضهم ذنوب .\n                                    ",
        "qortoby": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦ وَلَمۡ يُفَرِّقُواْ بَيۡنَ أَحَدٖ مِّنۡهُمۡ أُوْلَٰٓئِكَ سَوۡفَ يُؤۡتِيهِمۡ أُجُورَهُمۡۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٢٥١\n                                    \n                                    \n                                    قوله تعالى : والذين آمنوا بالله ورسله ولم يفرقوا بين أحد منهم أولئك سوف يؤتيهم أجورهم وكان الله غفورا رحيما\nيعني به النبي صلى الله عليه وسلم وأمته .\n                                    ",
        "saadi": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦ وَلَمۡ يُفَرِّقُواْ بَيۡنَ أَحَدٖ مِّنۡهُمۡ أُوْلَٰٓئِكَ سَوۡفَ يُؤۡتِيهِمۡ أُجُورَهُمۡۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٢٥١\n                                        \n                                        \n                                        \n                                        { وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ } وهذا يتضمن الإيمان بكل ما أخبر الله به عن نفسه وبكل ما جاءت به الرسل من الأخبار والأحكام. { وَلَمْ يُفَرِّقُوا بَيْنَ أَحَدٍ } من رسله، بل آمنوا بهم كلهم، فهذا هو الإيمان الحقيقي، واليقين المبني على البرهان. { أُولَئِكَ سَوْفَ يُؤْتِيهِمْ أُجُورَهُمْ } أي: جزاء إيمانهم وما ترتب عليه من عمل صالح، وقول حسن، وخلق جميل، كُلٌّ على حسب حاله. ولعل هذا هو السر في إضافة الأجور إليهم، { وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا } يغفر السيئات ويتقبل الحسنات.\n                                    "
      },
      "originalText": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦ وَلَمۡ يُفَرِّقُواْ بَيۡنَ أَحَدٖ مِّنۡهُمۡ أُوْلَٰٓئِكَ سَوۡفَ يُؤۡتِيهِمۡ أُجُورَهُمۡۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٢٥١"
    },
    {
      "number": 646,
      "text": "يَسْأَلُكَ أَهْلُ الْكِتَابِ أَنْ تُنَزِّلَ عَلَيْهِمْ كِتَابًا مِنَ السَّمَاءِ ۚ فَقَدْ سَأَلُوا مُوسَىٰ أَكْبَرَ مِنْ ذَٰلِكَ فَقَالُوا أَرِنَا اللَّهَ جَهْرَةً فَأَخَذَتْهُمُ الصَّاعِقَةُ بِظُلْمِهِمْ ۚ ثُمَّ اتَّخَذُوا الْعِجْلَ مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ فَعَفَوْنَا عَنْ ذَٰلِكَ ۚ وَآتَيْنَا مُوسَىٰ سُلْطَانًا مُبِينًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 153,
      "juz": 6,
      "manzil": 1,
      "page": 102,
      "ruku": 83,
      "hizbQuarter": 41,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَسۡ‍َٔلُكَ أَهۡلُ ٱلۡكِتَٰبِ أَن تُنَزِّلَ عَلَيۡهِمۡ كِتَٰبٗا مِّنَ ٱلسَّمَآءِۚ فَقَدۡ سَأَلُواْ مُوسَىٰٓ أَكۡبَرَ مِن ذَٰلِكَ فَقَالُوٓاْ أَرِنَا ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡهُمُ ٱلصَّٰعِقَةُ بِظُلۡمِهِمۡۚ ثُمَّ ٱتَّخَذُواْ ٱلۡعِجۡلَ مِنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ فَعَفَوۡنَا عَن ذَٰلِكَۚ وَءَاتَيۡنَا مُوسَىٰ سُلۡطَٰنٗا مُّبِينٗا ٣٥١\n                                    \n                                    \n                                    قال محمد بن كعب القرظي ، والسدي ، وقتادة : سأل اليهود رسول الله صلى الله عليه وسلم أن ينزل عليهم كتابا من السماء . كما نزلت التوراة على موسى مكتوبة .\nقال ابن جريج : سألوه أن ينزل عليهم صحفا من الله مكتوبة إلى فلان وفلان وفلان ، بتصديقه فيما جاءهم به . وهذا إنما قالوه على سبيل التعنت والعناد والكفر والإلحاد ، كما سأل كفار قريش قبلهم نظير ذلك ، كما هو مذكور في سورة \" سبحان \" : ( وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا ) [ الإسراء : 90 ، 93 ] الآيات . ولهذا قال تعالى : ( فقد سألوا موسى أكبر من ذلك فقالوا أرنا الله جهرة فأخذتهم الصاعقة بظلمهم ) أي : بطغيانهم وبغيهم ، وعتوهم وعنادهم . وهذا مفسر في سورة \" البقرة \" حيث يقول تعالى : ( وإذ قلتم يا موسى لن نؤمن لك حتى نرى الله جهرة فأخذتكم الصاعقة وأنتم تنظرون . ثم بعثناكم من بعد موتكم لعلكم تشكرون ) [ البقرة : 55 ، 56 ] .\nوقوله تعالى : ( ثم اتخذوا العجل من بعد ما جاءتهم البينات ) أي : من بعد ما رأوا من الآيات الباهرة والأدلة القاهرة على يد موسى ، عليه السلام ، في بلاد مصر وما كان من إهلاك عدو الله فرعون وجميع جنوده في اليم ، فما جاوزوه إلا يسيرا حتى أتوا على قوم يعكفون على أصنام لهم ، فقالوا لموسى ( اجعل لنا إلها كما لهم آلهة [ قال إنكم قوم تجهلون . إن هؤلاء متبر ما هم فيه وباطل ما كانوا يعملون ] ) [ الأعراف : 138 ، 139 ] . ثم ذكر تعالى قصة اتخاذهم العجل مبسوطة في سورة \" الأعراف \" ، وفي سورة \" طه \" بعد ذهاب موسى إلى مناجاة الله ، عز وجل ، ثم لما رجع وكان ما كان ، جعل الله توبتهم من الذي صنعوه وابتدعوه : أن يقتل من لم يعبد العجل منهم من عبده ، فجعل يقتل بعضهم بعضا ثم أحياهم الله ، عز وجل ، فقال الله عز وجل ( فعفونا عن ذلك وآتينا موسى سلطانا مبينا )\n                                    ",
        "qortoby": "يَسۡ‍َٔلُكَ أَهۡلُ ٱلۡكِتَٰبِ أَن تُنَزِّلَ عَلَيۡهِمۡ كِتَٰبٗا مِّنَ ٱلسَّمَآءِۚ فَقَدۡ سَأَلُواْ مُوسَىٰٓ أَكۡبَرَ مِن ذَٰلِكَ فَقَالُوٓاْ أَرِنَا ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡهُمُ ٱلصَّٰعِقَةُ بِظُلۡمِهِمۡۚ ثُمَّ ٱتَّخَذُواْ ٱلۡعِجۡلَ مِنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ فَعَفَوۡنَا عَن ذَٰلِكَۚ وَءَاتَيۡنَا مُوسَىٰ سُلۡطَٰنٗا مُّبِينٗا ٣٥١\n                                    \n                                    \n                                    قوله تعالى : يسألك أهل الكتاب أن تنزل عليهم كتابا من السماء فقد سألوا موسى أكبر من ذلك فقالوا أرنا الله جهرة فأخذتهم الصاعقة بظلمهم ثم اتخذوا العجل من بعد ما جاءتهم البينات فعفونا عن ذلك وآتينا موسى سلطانا مبينا\nسألت اليهود محمدا صلى الله عليه وسلم أن يصعد إلى السماء وهم يرونه فينزل عليهم كتابا مكتوبا فيما يدعيه على صدقه دفعة واحدة ، كما أتى موسى بالتوراة ؛ تعنتا له صلى الله عليه وسلم ؛ فأعلم الله عز وجل أن آباءهم قد عنتوا موسى عليه السلام بأكبر من هذا فقالوا أرنا الله جهرة أي عيانا ؛ وقد تقدم في \" البقرة \" . وجهرة نعت لمصدر محذوف أي رؤية جهرة ؛ فعوقبوا بالصاعقة لعظم ما جاءوا به من السؤال والظلم من بعد ما رأوا من المعجزات .\nقوله تعالى : ثم اتخذوا العجل في الكلام حذف تقديره : فأحييناهم فلم يبرحوا فاتخذوا العجل ؛ وقد تقدم في \" البقرة \" ويأتي ذكره في \" طه \" إن شاء الله . من بعد ما جاءتهم البينات أي البراهين والدلالات والمعجزات الظاهرات من اليد والعصا وفلق البحر وغيرها بأنه لا معبود إلا الله عز وجل . فعفونا عن ذلك أي عما كان منهم من التعنت . وآتينا موسى سلطانا مبينا أي حجة بينة وهي الآيات التي جاء بها ؛ وسميت سلطانا لأن من جاء بها قاهر بالحجة ، وهي قاهرة للقلوب ، بأن تعلم أنه ليس في قوى البشر أن يأتوا بمثلها .\n                                    ",
        "saadi": "يَسۡ‍َٔلُكَ أَهۡلُ ٱلۡكِتَٰبِ أَن تُنَزِّلَ عَلَيۡهِمۡ كِتَٰبٗا مِّنَ ٱلسَّمَآءِۚ فَقَدۡ سَأَلُواْ مُوسَىٰٓ أَكۡبَرَ مِن ذَٰلِكَ فَقَالُوٓاْ أَرِنَا ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡهُمُ ٱلصَّٰعِقَةُ بِظُلۡمِهِمۡۚ ثُمَّ ٱتَّخَذُواْ ٱلۡعِجۡلَ مِنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ فَعَفَوۡنَا عَن ذَٰلِكَۚ وَءَاتَيۡنَا مُوسَىٰ سُلۡطَٰنٗا مُّبِينٗا ٣٥١\n                                        \n                                        \n                                        \n                                        هذا السؤال الصادر من أهل الكتاب للرسول محمد صلى الله عليه وسلم على وجه العناد والاقتراح، وجعلهم هذا السؤال يتوقف عليه تصديقهم أو تكذيبهم. وهو أنهم سألوه أن ينزل عليهم القرآن جملة واحدة كما نزلت التوراة والإنجيل، وهذا غاية الظلم منهم والجهل، فإن الرسول بشر عبد مدبر، ليس في يده من الأمر شيء، بل الأمر كله لله، وهو الذي يرسل وينزل ما يشاء على عباده كما قال تعالى عن الرسول، لما ذكر الآيات التي فيها اقتراح المشركين على محمد صلى الله عليه وسلم، { قُلْ سُبْحَانَ رَبِّي هَلْ كُنتُ إِلَّا بَشَرًا رَّسُولًا } وكذلك جعلهم الفارق بين الحق والباطل مجرد إنزال الكتاب جملة أو مفرقا، مجرد دعوى لا دليل عليها ولا مناسبة، بل ولا شبهة، فمن أين يوجد في نبوة أحد من الأنبياء أن الرسول الذي يأتيكم بكتاب نزل مفرقا فلا تؤمنوا به ولا تصدقوه؟ بل نزول هذا القرآن مفرقا بحسب الأحوال مما يدل على عظمته واعتناء الله بمن أنزل عليه، كما قال تعالى: { وَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآنُ جُمْلَةً وَاحِدَةً كَذَلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ وَرَتَّلْنَاهُ تَرْتِيلًا وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا } فلما ذكر اعتراضهم الفاسد أخبر أنه ليس بغريب من أمرهم، بل سبق لهم من المقدمات القبيحة ما هو أعظم مما سلكوه مع الرسول الذي يزعمون أنهم آمنوا به. من سؤالهم له رؤية الله عيانا، واتخاذهم العجل إلهًا يعبدونه، من بعد ما رأوا من الآيات بأبصارهم ما لم يره غيرهم. ومن امتناعهم من قبول أحكام كتابهم وهو التوراة، حتى رفع الطور من فوق رءوسهم وهددوا أنهم إن لم يؤمنوا أسقط عليهم، فقبلوا ذلك على وجه الإغماض والإيمان الشبيه بالإيمان الضروري. ومن امتناعهم من دخول أبواب القرية التي أمروا بدخولها سجدا مستغفرين، فخالفوا القول والفعل. ومن اعتداء من اعتدى منهم في السبت فعاقبهم الله تلك العقوبة الشنيعة. وبأخذ الميثاق الغليظ عليهم فنبذوه وراء ظهورهم وكفروا بآيات الله وقتلوا رسله بغير حق. ومن قولهم: إنهم قتلوا المسيح عيسى وصلبوه، والحال أنهم ما قتلوه وما صلبوه بل شُبِّه لهم غيره، فقتلوا غيره وصلبوه. وادعائهم أن قلوبهم غلف لا تفقه ما تقول لهم ولا تفهمه، وبصدهم الناس عن سبيل الله، فصدوهم عن الحق، ودعوهم إلى ما هم عليه من الضلال والغي. وبأخذهم السحت والربا مع نهي الله لهم عنه والتشديد فيه. فالذين فعلوا هذه الأفاعيل لا يستنكر عليهم أن يسألوا الرسول محمدا أن ينزل عليهم كتابا من السماء، وهذه الطريقة من أحسن الطرق لمحاجة الخصم المبطل، وهو أنه إذا صدر منه من الاعتراض الباطل ما جعله شبهة له ولغيره في رد الحق أن يبين من حاله الخبيثة وأفعاله الشنيعة ما هو من أقبح ما صدر منه، ليعلم كل أحد أن هذا الاعتراض من ذلك الوادي الخسيس، وأن له مقدمات يُجعل هذا معها. وكذلك كل اعتراض يعترضون به على نبوة محمد صلى الله عليه وسلم يمكن أن يقابل بمثله أو ما هو أقوى منه في نبوة من يدعون إيمانهم به ليكتفى بذلك شرهم وينقمع باطلهم، وكل حجة سلكوها في تقريرهم لنبوة من آمنوا به فإنها ونظيرها وما هو أقوى منها، دالة ومقررة لنبوة محمد صلى الله عليه وسلم. ولما كان المراد من تعديد ما عدد الله من قبائحهم هذه المقابلة لم يبسطها في هذا الموضع، بل أشار إليها، وأحال على مواضعها وقد بسطها في غير هذا الموضع في المحل اللائق ببسطها. وقوله: { وَإِن مِّنْ أَهْلِ الْكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ } يحتمل أن الضمير هنا في قوله: { قَبْلَ مَوْتِهِ } يعود إلى أهل الكتاب، فيكون على هذا كل كتابي يحضره الموت ويعاين الأمر حقيقة، فإنه يؤمن بعيسى عليه السلام ولكنه إيمان لا ينفع، إيمان اضطرار، فيكون مضمون هذا التهديد لهم والوعيد، وأن لا يستمروا على هذه الحال التي سيندمون عليها قبل مماتهم، فكيف يكون حالهم يوم حشرهم وقيامهم؟\" ويحتمل أن الضمير في قوله: { قَبْلَ مَوْتِهِ } راجع إلى عيسى عليه السلام، فيكون المعنى: وما من أحد من أهل الكتاب إلا ليؤمنن بالمسيح عليه السلام قبل موت المسيح، وذلك يكون عند اقتراب الساعة وظهور علاماتها الكبار. فإنه تكاثرت الأحاديث الصحيحة في نزوله عليه السلام في آخر هذه الأمة. يقتل الدجال، ويضع الجزية، ويؤمن به أهل الكتاب مع المؤمنين. ويوم القيامة يكون عيسى عليهم شهيدا، يشهد عليهم بأعمالهم، وهل هي موافقة لشرع الله أم لا؟ وحينئذ لا يشهد إلا ببطلان كل ما هم عليه، مما هو مخالف لشريعة القرآن وَلِمَا دعاهم إليه محمد صلى الله عليه وسلم، علمنا بذلك، لِعِلْمِنَا بكمال عدالة المسيح عليه السلام وصدقه، وأنه لا يشهد إلا بالحق، إلا أن ما جاء به محمد صلى الله عليه وسلم هو الحق وما عداه فهو ضلال وباطل.\n                                    "
      },
      "originalText": "يَسۡ‍َٔلُكَ أَهۡلُ ٱلۡكِتَٰبِ أَن تُنَزِّلَ عَلَيۡهِمۡ كِتَٰبٗا مِّنَ ٱلسَّمَآءِۚ فَقَدۡ سَأَلُواْ مُوسَىٰٓ أَكۡبَرَ مِن ذَٰلِكَ فَقَالُوٓاْ أَرِنَا ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡهُمُ ٱلصَّٰعِقَةُ بِظُلۡمِهِمۡۚ ثُمَّ ٱتَّخَذُواْ ٱلۡعِجۡلَ مِنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ فَعَفَوۡنَا عَن ذَٰلِكَۚ وَءَاتَيۡنَا مُوسَىٰ سُلۡطَٰنٗا مُّبِينٗا ٣٥١ "
    },
    {
      "number": 647,
      "text": "وَرَفَعْنَا فَوْقَهُمُ الطُّورَ بِمِيثَاقِهِمْ وَقُلْنَا لَهُمُ ادْخُلُوا الْبَابَ سُجَّدًا وَقُلْنَا لَهُمْ لَا تَعْدُوا فِي السَّبْتِ وَأَخَذْنَا مِنْهُمْ مِيثَاقًا غَلِيظًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 154,
      "juz": 6,
      "manzil": 1,
      "page": 102,
      "ruku": 83,
      "hizbQuarter": 41,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَرَفَعۡنَا فَوۡقَهُمُ ٱلطُّورَ بِمِيثَٰقِهِمۡ وَقُلۡنَا لَهُمُ ٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا وَقُلۡنَا لَهُمۡ لَا تَعۡدُواْ فِي ٱلسَّبۡتِ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا ٤٥١\n                                    \n                                    \n                                    ثم قال تعالى : ( ورفعنا فوقهم الطور بميثاقهم ) وذلك حين امتنعوا من الالتزام بأحكام التوراة ، وظهر منهم إباء عما جاءهم به موسى ، عليه السلام ، ورفع الله على رؤوسهم جبلا ثم ألزموا فالتزموا وسجدوا ، وجعلوا ينظرون إلى فوق رؤوسهم خشية أن يسقط عليهم ، كما قال تعالى : ( وإذ نتقنا الجبل فوقهم كأنه ظلة وظنوا أنه واقع بهم خذوا ما آتيناكم بقوة [ واذكروا ما فيه لعلكم تتقون ] ) [ الأعراف : 171 ] .\n( وقلنا لهم ادخلوا الباب سجدا ) أي : فخالفوا ما أمروا به من القول والفعل ، فإنهم أمروا أن يدخلوا باب بيت القدس سجدا ، وهم يقولون : حطة . أي : اللهم حط عنا ذنوبنا في تركنا الجهاد ونكولنا عنه ، حتى تهنا في التيه أربعين سنة . فدخلوا يزحفون على أستاههم ، وهم يقولون : حنطة في شعرة .\n( وقلنا لهم لا تعدوا في السبت ) أي : وصيناهم بحفظ السبت والتزام ما حرم الله عليهم ، ما دام مشروعا لهم ( وأخذنا منهم ميثاقا غليظا ) أي : شديدا ، فخالفوا وعصوا وتحيلوا على ارتكاب مناهي الله ، عز وجل ، كما هو مبسوط في سورة الأعراف عند قوله : ( واسألهم عن القرية التي كانت حاضرة البحر [ إذ يعدون في السبت ] ) [ الأعراف : 163 - 166 ] الآيات ، وسيأتي حديث صفوان بن عسال ، في سورة \" سبحان \" عند قوله : ( ولقد آتينا موسى تسع آيات بينات ) [ الإسراء : 101 ] ، وفيه : \" وعليكم - خاصة يهود - ألا تعدوا في السبت \" .\n                                    ",
        "qortoby": "وَرَفَعۡنَا فَوۡقَهُمُ ٱلطُّورَ بِمِيثَٰقِهِمۡ وَقُلۡنَا لَهُمُ ٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا وَقُلۡنَا لَهُمۡ لَا تَعۡدُواْ فِي ٱلسَّبۡتِ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا ٤٥١\n                                    \n                                    \n                                    قوله تعالى : ورفعنا فوقهم الطور بميثاقهم وقلنا لهم ادخلوا الباب سجدا وقلنا لهم لا تعدوا في السبت وأخذنا منهم ميثاقا غليظا\nقوله تعالى : ورفعنا فوقهم الطور بميثاقهم أي بسبب نقضهم الميثاق الذي أخذ منهم ، وهو العمل بما في التوراة ؛ وقد تقدم رفع الجبل ودخولهم الباب في \" البقرة \" . وسجدا نصب على الحال . وقرأ ورش وحده \" وقلنا لهم لا تعدوا في السبت \" بفتح العين من عدا يعدو عدوا وعدوانا وعدوا وعداء ، أي باقتناص الحيتان كما تقدم في \" البقرة \" . والأصل فيه تعتدوا أدغمت التاء في الدال ؛ قال النحاس : ولا يجوز إسكان العين ولا يوصل إلى الجمع بين ساكنين في هذا ، والذي يقرأ به إنما يروم الخطأ . وأخذنا منهم ميثاقا غليظا يعني العهد الذي أخذ عليهم في التوراة . وقيل : عهد مؤكد باليمين فسمي غليظا لذلك .\n                                    ",
        "saadi": "وَرَفَعۡنَا فَوۡقَهُمُ ٱلطُّورَ بِمِيثَٰقِهِمۡ وَقُلۡنَا لَهُمُ ٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا وَقُلۡنَا لَهُمۡ لَا تَعۡدُواْ فِي ٱلسَّبۡتِ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا ٤٥١\n                                        \n                                        \n                                        \n                                        تفسير الايات 152 حتى 159 :ـ هذا السؤال الصادر من أهل الكتاب للرسول محمد صلى الله عليه وسلم على وجه العناد والاقتراح، وجعلهم هذا السؤال يتوقف عليه تصديقهم أو تكذيبهم. وهو أنهم سألوه أن ينزل عليهم القرآن جملة واحدة كما نزلت التوراة والإنجيل، وهذا غاية الظلم منهم والجهل، فإن الرسول بشر عبد مدبر، ليس في يده من الأمر شيء، بل الأمر كله لله، وهو الذي يرسل وينزل ما يشاء على عباده كما قال تعالى عن الرسول، لما ذكر الآيات التي فيها اقتراح المشركين على محمد صلى الله عليه وسلم، { قُلْ سُبْحَانَ رَبِّي هَلْ كُنتُ إِلَّا بَشَرًا رَّسُولًا } وكذلك جعلهم الفارق بين الحق والباطل مجرد إنزال الكتاب جملة أو مفرقا، مجرد دعوى لا دليل عليها ولا مناسبة، بل ولا شبهة، فمن أين يوجد في نبوة أحد من الأنبياء أن الرسول الذي يأتيكم بكتاب نزل مفرقا فلا تؤمنوا به ولا تصدقوه؟ بل نزول هذا القرآن مفرقا بحسب الأحوال مما يدل على عظمته واعتناء الله بمن أنزل عليه، كما قال تعالى: { وَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآنُ جُمْلَةً وَاحِدَةً كَذَلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ وَرَتَّلْنَاهُ تَرْتِيلًا وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا } فلما ذكر اعتراضهم الفاسد أخبر أنه ليس بغريب من أمرهم، بل سبق لهم من المقدمات القبيحة ما هو أعظم مما سلكوه مع الرسول الذي يزعمون أنهم آمنوا به. من سؤالهم له رؤية الله عيانا، واتخاذهم العجل إلهًا يعبدونه، من بعد ما رأوا من الآيات بأبصارهم ما لم يره غيرهم. ومن امتناعهم من قبول أحكام كتابهم وهو التوراة، حتى رفع الطور من فوق رءوسهم وهددوا أنهم إن لم يؤمنوا أسقط عليهم، فقبلوا ذلك على وجه الإغماض والإيمان الشبيه بالإيمان الضروري. ومن امتناعهم من دخول أبواب القرية التي أمروا بدخولها سجدا مستغفرين، فخالفوا القول والفعل. ومن اعتداء من اعتدى منهم في السبت فعاقبهم الله تلك العقوبة الشنيعة. وبأخذ الميثاق الغليظ عليهم فنبذوه وراء ظهورهم وكفروا بآيات الله وقتلوا رسله بغير حق. ومن قولهم: إنهم قتلوا المسيح عيسى وصلبوه، والحال أنهم ما قتلوه وما صلبوه بل شُبِّه لهم غيره، فقتلوا غيره وصلبوه. وادعائهم أن قلوبهم غلف لا تفقه ما تقول لهم ولا تفهمه، وبصدهم الناس عن سبيل الله، فصدوهم عن الحق، ودعوهم إلى ما هم عليه من الضلال والغي. وبأخذهم السحت والربا مع نهي الله لهم عنه والتشديد فيه. فالذين فعلوا هذه الأفاعيل لا يستنكر عليهم أن يسألوا الرسول محمدا أن ينزل عليهم كتابا من السماء، وهذه الطريقة من أحسن الطرق لمحاجة الخصم المبطل، وهو أنه إذا صدر منه من الاعتراض الباطل ما جعله شبهة له ولغيره في رد الحق أن يبين من حاله الخبيثة وأفعاله الشنيعة ما هو من أقبح ما صدر منه، ليعلم كل أحد أن هذا الاعتراض من ذلك الوادي الخسيس، وأن له مقدمات يُجعل هذا معها. وكذلك كل اعتراض يعترضون به على نبوة محمد صلى الله عليه وسلم يمكن أن يقابل بمثله أو ما هو أقوى منه في نبوة من يدعون إيمانهم به ليكتفى بذلك شرهم وينقمع باطلهم، وكل حجة سلكوها في تقريرهم لنبوة من آمنوا به فإنها ونظيرها وما هو أقوى منها، دالة ومقررة لنبوة محمد صلى الله عليه وسلم. ولما كان المراد من تعديد ما عدد الله من قبائحهم هذه المقابلة لم يبسطها في هذا الموضع، بل أشار إليها، وأحال على مواضعها وقد بسطها في غير هذا الموضع في المحل اللائق ببسطها. وقوله: { وَإِن مِّنْ أَهْلِ الْكِتَابِ إِلَّا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ } يحتمل أن الضمير هنا في قوله: { قَبْلَ مَوْتِهِ } يعود إلى أهل الكتاب، فيكون على هذا كل كتابي يحضره الموت ويعاين الأمر حقيقة، فإنه يؤمن بعيسى عليه السلام ولكنه إيمان لا ينفع، إيمان اضطرار، فيكون مضمون هذا التهديد لهم والوعيد، وأن لا يستمروا على هذه الحال التي سيندمون عليها قبل مماتهم، فكيف يكون حالهم يوم حشرهم وقيامهم؟\" ويحتمل أن الضمير في قوله: { قَبْلَ مَوْتِهِ } راجع إلى عيسى عليه السلام، فيكون المعنى: وما من أحد من أهل الكتاب إلا ليؤمنن بالمسيح عليه السلام قبل موت المسيح، وذلك يكون عند اقتراب الساعة وظهور علاماتها الكبار. فإنه تكاثرت الأحاديث الصحيحة في نزوله عليه السلام في آخر هذه الأمة. يقتل الدجال، ويضع الجزية، ويؤمن به أهل الكتاب مع المؤمنين. ويوم القيامة يكون عيسى عليهم شهيدا، يشهد عليهم بأعمالهم، وهل هي موافقة لشرع الله أم لا؟ وحينئذ لا يشهد إلا ببطلان كل ما هم عليه، مما هو مخالف لشريعة القرآن وَلِمَا دعاهم إليه محمد صلى الله عليه وسلم، علمنا بذلك، لِعِلْمِنَا بكمال عدالة المسيح عليه السلام وصدقه، وأنه لا يشهد إلا بالحق، إلا أن ما جاء به محمد صلى الله عليه وسلم هو الحق وما عداه فهو ضلال وباطل.\n                                    "
      },
      "originalText": "وَرَفَعۡنَا فَوۡقَهُمُ ٱلطُّورَ بِمِيثَٰقِهِمۡ وَقُلۡنَا لَهُمُ ٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا وَقُلۡنَا لَهُمۡ لَا تَعۡدُواْ فِي ٱلسَّبۡتِ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا ٤٥١"
    }
  ]
}