{
  "number": 105,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 664,
      "text": "يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ ۚ إِنَّمَا الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَىٰ مَرْيَمَ وَرُوحٌ مِنْهُ ۖ فَآمِنُوا بِاللَّهِ وَرُسُلِهِ ۖ وَلَا تَقُولُوا ثَلَاثَةٌ ۚ انْتَهُوا خَيْرًا لَكُمْ ۚ إِنَّمَا اللَّهُ إِلَٰهٌ وَاحِدٌ ۖ سُبْحَانَهُ أَنْ يَكُونَ لَهُ وَلَدٌ ۘ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَكَفَىٰ بِاللَّهِ وَكِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 171,
      "juz": 6,
      "manzil": 1,
      "page": 105,
      "ruku": 84,
      "hizbQuarter": 42,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ وَلَا تَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥٓ أَلۡقَىٰهَآ إِلَىٰ مَرۡيَمَ وَرُوحٞ مِّنۡهُۖ فَ‍َٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُواْ ثَلَٰثَةٌۚ ٱنتَهُواْ خَيۡرٗا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَٰهٞ وَٰحِدٞۖ سُبۡحَٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٞۘ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا ١٧١\n                                    \n                                    \n                                    ينهى تعالى أهل الكتاب عن الغلو والإطراء ، وهذا كثير في النصارى ، فإنهم تجاوزوا حد التصديق بعيسى ، حتى رفعوه فوق المنزلة التي أعطاه الله إياها ، فنقلوه من حيز النبوة إلى أن اتخذوه إلها من دون الله يعبدونه كما يعبدونه ، بل قد غلوا في أتباعه وأشياعه ، ممن زعم أنه على دينه ، فادعوا فيهم العصمة واتبعوهم في كل ما قالوه ، سواء كان حقا أو باطلا أو ضلالا أو رشادا ، أو صحيحا أو كذبا ; ولهذا قال تعالى : ( اتخذوا أحبارهم ورهبانهم أربابا من دون الله والمسيح ابن مريم وما أمروا إلا ليعبدوا إلها واحدا لا إله إلا هو سبحانه عما يشركون ) [ التوبة : 31 ] .\nوقال الإمام أحمد : حدثنا هشيم قال : زعم الزهري ، عن عبيد الله بن عبد الله بن عتبة بن مسعود ، عن ابن عباس ، عن عمر : أن رسول الله صلى الله عليه وسلم قال : \" لا تطروني كما أطرت النصارى عيسى ابن مريم ، فإنما أنا عبد الله ورسوله \" .\nثم رواه هو وعلي بن المديني ، عن سفيان بن عيينة ، عن الزهري كذلك . وقال علي بن المديني : هذا حديث صحيح سنده وهكذا رواه البخاري ، عن الحميدي ، عن سفيان بن عيينة ، عن الزهري ، به . ولفظه : \" فإنما أنا عبد ، فقولوا : عبد الله ورسوله \" .\nوقال الإمام أحمد : حدثنا حسن بن موسى ، حدثنا حماد بن سلمة ، عن ثابت البناني ، عن أنس بن مالك : أن رجلا قال : محمد يا سيدنا وابن سيدنا ، وخيرنا وابن خيرنا . فقال رسول الله صلى الله عليه وسلم \" يا أيها الناس ، عليكم بقولكم ، ولا يستهوينكم الشيطان ، أنا محمد بن عبد الله ، عبد الله ورسوله ، والله ما أحب أن ترفعوني فوق منزلتي التي أنزلني الله عز وجل \" . تفرد به من هذا الوجه .\nوقوله : ( ولا تقولوا على الله إلا الحق ) أي : لا تفتروا عليه وتجعلوا له صاحبة وولدا - تعالى الله عن ذلك علوا كبيرا ، وتنزه وتقدس وتوحد في سؤدده وكبريائه وعظمته - فلا إله إلا هو ، ولا رب سواه ; ولهذا قال : ( إنما المسيح عيسى ابن مريم رسول الله وكلمته ألقاها إلى مريم وروح منه ) أي : إنما هو عبد من عباد الله وخلق من خلقه ، قال له : كن فكان ، ورسول من رسله ، وكلمته ألقاها إلى مريم ، أي : خلقه بالكلمة التي أرسل بها جبريل ، عليه السلام ، إلى مريم ، فنفخ فيها من روحه بإذن ربه ، عز وجل ، فكان عيسى بإذن الله ، عز وجل ، وصارت تلك النفخة التي نفخها في جيب درعها ، فنزلت حتى ولجت فرجها بمنزلة لقاح الأب الأم والجميع مخلوق لله ، عز وجل ; ولهذا قيل لعيسى : إنه كلمة الله وروح منه ; لأنه لم يكن له أب تولد منه ، وإنما هو ناشئ عن الكلمة التي قال له بها : كن ، فكان . والروح التي أرسل بها جبريل ، قال الله تعالى : ( ما المسيح ابن مريم إلا رسول قد خلت من قبله الرسل وأمه صديقة كانا يأكلان الطعام ) [ المائدة : 75 ] . وقال تعالى : ( إن مثل عيسى عند الله كمثل آدم خلقه من تراب ثم قال له كن فيكون ) [ آل عمران : 59 ] . وقال تعالى : ( والتي أحصنت فرجها فنفخنا فيها من روحنا وجعلناها وابنها آية للعالمين ) [ الأنبياء : 91 ] وقال تعالى : ( ومريم ابنت عمران التي أحصنت فرجها [ فنفخنا فيه من روحنا وصدقت بكلمات ربها وكتبه وكانت من القانتين ] ) [ التحريم : 12 ] . وقال تعالى إخبارا عن المسيح : ( إن هو إلا عبد أنعمنا عليه [ وجعلناه مثلا لبني إسرائيل ] ) [ الزخرف : 59 ] .\nوقال عبد الرزاق ، عن معمر ، عن قتادة : ( وكلمته ألقاها إلى مريم ) هو كقوله : ( كن ) [ آل عمران : 59 ] فكان وقال ابن أبي حاتم : حدثنا أحمد بن سنان الواسطي قال : سمعت شاذ بن يحيى يقول : في قول الله : ( وكلمته ألقاها إلى مريم وروح منه ) قال : ليس الكلمة صارت عيسى ، ولكن بالكلمة صار عيسى .\nوهذا أحسن مما ادعاه ابن جرير في قوله : ( ألقاها إلى مريم ) أي : أعلمها بها ، كما زعمه في قوله : ( إذ قالت الملائكة يا مريم إن الله يبشرك بكلمة منه ) [ آل عمران : 45 ] أي : يعلمك بكلمة منه ، ويجعل ذلك كما قال تعالى : ( وما كنت ترجو أن يلقى إليك الكتاب إلا رحمة من ربك ) [ القصص : 86 ] بل الصحيح أنها الكلمة التي جاء بها جبريل إلى مريم ، فنفخ فيها بإذن الله ، فكان عيسى ، عليه السلام .\nوقال البخاري : حدثنا صدقة بن الفضل ، حدثنا الوليد ، حدثنا الأوزاعي ، حدثني عمير بن هانئ ، حدثني جنادة بن أبي أمية ، عن عبادة بن الصامت ، عن النبي صلى الله عليه وسلم قال : \" من شهد أن لا إله إلا الله وحده لا شريك له ، وأن محمدا عبده ورسوله ، وأن عيسى عبد الله ورسوله ، وكلمته ألقاها إلى مريم وروح منه ، والجنة حق ، والنار حق ، أدخله الله الجنة على ما كان من العمل \" . قال الوليد : فحدثني عبد الرحمن بن يزيد بن جابر ، عن عمير بن هانئ ، عن جنادة زاد : \" من أبواب الجنة الثمانية من أيها شاء \" .\nوكذا رواه مسلم ، عن داود بن رشيد ، عن الوليد ، عن ابن جابر ، به ومن وجه آخر ، عن الأوزاعي ، به .\nفقوله في الآية والحديث : ( وروح منه ) كقوله ( وسخر لكم ما في السماوات وما في الأرض جميعا منه ) [ الجاثية : 13 ] أي : من خلقه ومن عنده ، وليست \" من \" للتبعيض ، كما تقوله النصارى - عليهم لعائن الله المتتابعة - بل هي لابتداء الغاية ، كما في الآية الأخرى .\nوقد قال مجاهد في قوله : ( وروح منه ) أي : ورسول منه . وقال غيره . ومحبة منه . والأظهر الأول أنه مخلوق من روح مخلوقة ، وأضيفت الروح إلى الله على وجه التشريف ، كما أضيفت الناقة والبيت إلى الله ، في قوله : ( هذه ناقة الله ) [ هود : 64 ] . وفي قوله : ( وطهر بيتي للطائفين ) [ الحج : 26 ] ، وكما ورد في الحديث الصحيح : \" فأدخل على ربي في داره \" أضافها إليه إضافة تشريف لها ، وهذا كله من قبيل واحد ونمط واحد .\nوقوله : ( فآمنوا بالله ورسله ) أي : فصدقوا بأن الله واحد أحد ، لا صاحبة له ولا ولد ، واعلموا وتيقنوا بأن عيسى عبد الله ورسوله ; ولهذا قال : ( ولا تقولوا ثلاثة ) أي : لا تجعلوا عيسى وأمه مع الله شريكين ، تعالى الله عن ذلك علوا كبيرا .\nوهذه الآية والتي تأتي في سورة المائدة حيث يقول تعالى : ( لقد كفر الذين قالوا إن الله ثالث ثلاثة وما من إله إلا إله واحد ) [ المائدة : 73 ] . وكما قال في آخر السورة المذكورة : ( وإذ قال الله يا عيسى ابن مريم أأنت قلت للناس اتخذوني [ وأمي إلهين من دون الله قال سبحانك ] ) الآية [ المائدة : 116 ] ، وقال في أولها : ( لقد كفر الذين قالوا إن الله هو المسيح ابن مريم ) الآية [ المائدة : 72 ] ، فالنصارى - عليهم لعنة الله - من جهلهم ليس لهم ضابط ، ولا لكفرهم حد ، بل أقوالهم وضلالهم منتشر ، فمنهم من يعتقده إلها ، ومنهم من يعتقده شريكا ، ومنهم من يعتقده ولدا . وهم طوائف كثيرة لهم آراء مختلفة ، وأقوال غير مؤتلفة ، ولقد أحسن بعض المتكلمين حيث قال : لو اجتمع عشرة من النصارى لافترقوا على أحد عشر قولا . ولقد ذكر بعض علمائهم المشاهير ، وهو سعيد بن بطريق - بترك الإسكندرية - في حدود سنة أربعمائة من الهجرة النبوية ، أنهم اجتمعوا المجمع الكبير الذي عقدوا فيه الأمانة الكبيرة التي لهم ، وإنما هي الخيانة الحقيرة الصغيرة ، وذلك في أيام قسطنطين باني المدينة المشهورة ، وأنهم اختلفوا عليه اختلافا لا ينضبط ولا ينحصر ، فكانوا أزيد من ألفين أسقفا ، فكانوا أحزابا كثيرة ، كل خمسين منهم على مقالة ، وعشرون على مقالة ، ومائة على مقالة ، وسبعون على مقالة ، وأزيد من ذلك وأنقص . فلما رأى عصابة منهم قد زادوا على الثلاثمائة بثمانية عشر نفرا ، وقد توافقوا على مقالة ، فأخذها الملك ونصرها وأيدها - وكان فيلسوفا ذا هيئة - ومحق ما عداها من الأقوال ، وانتظم دست أولئك الثلاثمائة والثمانية عشر ، وبنيت لهم الكنائس ، ووضعوا لهم كتبا وقوانين ، وأحدثوا الأمانة التي يلقنونها الولدان من الصغار - ليعتقدوها - ويعمدونهم عليها ، وأتباع هؤلاء هم الملكية . ثم إنهم اجتمعوا مجمعا ثانيا فحدث فيهم اليعقوبية ، ثم مجمعا ثالثا فحدث فيهم النسطورية . وكل هذه الفرق تثبت الأقانيم الثلاثة في المسيح ، ويختلفون في كيفية ذلك وفي اللاهوت والناسوت على زعمهم ! هل اتحدا ، أو ما اتحدا ، بل امتزجا أو حل فيه ؟ على ثلاث مقالات ، وكل منهم يكفر الفرقة الأخرى ، ونحن نكفر الثلاثة ; ولهذا قال تعالى : ( انتهوا خيرا لكم ) أي : يكن خيرا لكم ( إنما الله إله واحد سبحانه أن يكون له ولد ) أي : تعالى وتقدس عن ذلك علوا كبيرا ( له ما في السماوات وما في الأرض وكفى بالله وكيلا ) أي : الجميع ملكه وخلقه ، وجميع ما فيها عبيده ، وهم تحت تدبيره وتصريفه ، وهو وكيل على كل شيء ، فكيف يكون له منهم صاحبة أو ولد ؟ كما قال في الآية الأخرى : ( بديع السماوات والأرض أنى يكون له ولد ولم تكن له صاحبة وخلق كل شيء وهو بكل شيء عليم ) [ الأنعام : 101 ] ، وقال تعالى : ( وقالوا اتخذ الرحمن ولدا . لقد جئتم شيئا إدا . [ تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا . أن دعوا للرحمن ولدا . وما ينبغي للرحمن أن يتخذ ولدا . إن كل من في السماوات والأرض إلا آتي الرحمن عبدا . لقد أحصاهم وعدهم عدا . وكلهم آتيه يوم القيامة فردا ] ) [ مريم : 88 : 95 ] .\n                                    ",
        "qortoby": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ وَلَا تَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥٓ أَلۡقَىٰهَآ إِلَىٰ مَرۡيَمَ وَرُوحٞ مِّنۡهُۖ فَ‍َٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُواْ ثَلَٰثَةٌۚ ٱنتَهُواْ خَيۡرٗا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَٰهٞ وَٰحِدٞۖ سُبۡحَٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٞۘ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا ١٧١\n                                    \n                                    \n                                    قوله تعالى : ياأهل الكتاب لا تغلوا في دينكم ولا تقولوا على الله إلا الحق إنما المسيح عيسى ابن مريم رسول الله وكلمته ألقاها إلى مريم وروح منه فآمنوا بالله ورسله ولا تقولوا ثلاثة انتهوا خيرا لكم إنما الله إله واحد سبحانه أن يكون له ولد له ما في السماوات وما في الأرض وكفى بالله وكيلا\nقوله تعالى : يا أهل الكتاب لا تغلوا في دينكم نهي عن الغلو . والغلو التجاوز في الحد ؛ ومنه غلا السعر يغلو غلاء ؛ وغلا الرجل في الأمر غلوا ، وغلا بالجارية لحمها وعظمها إذا أسرعت الشباب فجاوزت لداتها ؛ ويعني بذلك فيما ذكره المفسرون غلو اليهود في عيسى حتى قذفوا مريم ، وغلو النصارى فيه حتى جعلوه ربا ؛ فالإفراط والتقصير كله سيئة وكفر ؛ ولذلك قال مطرف بن عبد الله : الحسنة بين سيئتين ؛ وقال الشاعر :\nوأوف ولا تستوف حقك كله وصافح فلم يستوف قط كريم ولا تغل في شيء من الأمر واقتصد\nكلا طرفي قصد الأمور ذميم\nوقال آخر :\nعليك بأوساط الأمور فإنها نجاة ولا تركب ذلولا ولا صعبا\nوفي صحيح البخاري عنه عليه السلام : لا تطروني كما أطرت النصارى عيسى وقولوا عبد الله ورسوله .\nقوله تعالى : ولا تقولوا على الله إلا الحق أي لا تقولوا إن له شريكا أو ابنا . ثم بين تعالى حال عيسى عليه السلام وصفته فقال : إنما المسيح عيسى ابن مريم رسول الله وكلمته وفيه ثلاث مسائل :\nالأولى : قوله تعالى : إنما المسيح المسيح رفع بالابتداء ؛ و عيسى بدل منه وكذا ابن مريم . ويجوز أن يكون خبر الابتداء ويكون المعنى : إنما المسيح ابن مريم . ودل بقوله : عيسى ابن مريم على أن من كان منسوبا بوالدته كيف يكون إلها ، وحق الإله أن يكون قديما لا محدثا . ويكون رسول الله خبرا بعد خبر .\nالثانية : لم يذكر الله عز وجل امرأة وسماها باسمها في كتابه إلا مريم ابنة عمران ؛ فإنه ذكر اسمها في نحو من ثلاثين موضعا لحكمة ذكرها بعض الأشياخ ؛ فإن الملوك والأشراف لا يذكرون حرائرهم في الملإ ، ولا يبتذلون أسماءهن ؛ بل يكنون عن الزوجة بالعرس والأهل والعيال ونحو ذلك ؛ فإن ذكروا الإماء لم يكنوا عنهن ولم يصونوا أسماءهن عن الذكر والتصريح بها ؛ فلما قالت النصارى في مريم ما قالت وفي ابنها صرح الله باسمها ، ولم يكن عنها بالأموة والعبودية التي هي صفة لها ؛ وأجرى الكلام على عادة العرب في ذكر إمائها .\nالثالثة : اعتقاد أن عيسى عليه السلام لا أب له واجب ، فإذا تكرر اسمه منسوبا للأم استشعرت القلوب ما يجب عليها اعتقاده من نفي الأب عنه ، وتنزيه الأم الطاهرة عن مقالة اليهود لعنهم الله ، والله أعلم .\nقوله تعالى : وكلمته ألقاها إلى مريم أي هو مكون بكلمة \" كن \" فكان بشرا من غير أب ؛ والعرب تسمي الشيء باسم الشيء إذا كان صادرا عنه . وقيل : كلمته بشارة الله تعالى مريم عليها السلام ، ورسالته إليها على لسان جبريل عليه السلام ؛ وذلك قوله : إذ قالت الملائكة يا مريم إن الله يبشرك بكلمة منه . وقيل : \" الكلمة \" هاهنا بمعنى الآية ؛ قال الله تعالى : وصدقت بكلمات ربها و ما نفدت كلمات الله . وكان لعيسى أربعة أسماء ؛ المسيح وعيسى وكلمة وروح ، وقيل غير هذا مما ليس في القرآن . ومعنى ألقاها إلى مريم أمر بها مريم .\nقوله تعالى : وروح منه هذا الذي أوقع النصارى في الإضلال ؛ فقالوا : عيسى جزء منه فجهلوا وضلوا ؛ وعنه أجوبة ثمانية : الأول : قال أبي بن كعب : خلق الله أرواح بني آدم لما أخذ عليهم الميثاق ؛ ثم ردها إلى صلب آدم وأمسك عنده روح عيسى عليه السلام ؛ فلما أراد خلقه أرسل ذلك الروح إلى مريم ، فكان منه عيسى عليه السلام ؛ فلهذا قال : وروح منه . وقيل : هذه الإضافة للتفضيل وإن كان جميع الأرواح من خلقه ؛ وهذا كقوله : وطهر بيتي للطائفين ، وقيل : قد يسمى من تظهر منه الأشياء العجيبة روحا ، وتضاف إلى الله تعالى فيقال : هذا روح من الله أي من خلقه ؛ كما يقال في النعمة إنها من الله . وكان عيسى يبرئ الأكمه والأبرص ويحيي الموتى فاستحق هذا الاسم . وقيل : يسمى روحا بسبب نفخة جبريل عليه السلام ، ويسمى النفخ روحا ؛ لأنه ريح يخرج من الروح . قال الشاعر - هو ذو الرمة :\nفقلت له ارفعها إليك وأحيها بروحك واقتته لها قيتة قدرا\nوقد ورد أن جبريل نفخ في درع مريم فحملت منه بإذن الله ؛ وعلى هذا يكون وروح منه معطوفا على المضمر الذي هو اسم الله في ألقاها التقدير : ألقى الله وجبريل الكلمة إلى مريم . وقيل : روح منه أي من خلقه ؛ كما قال : وسخر لكم ما في السماوات وما في الأرض جميعا منه أي من خلقه . وقيل : روح منه أي رحمة منه ؛ فكان عيسى رحمة من الله لمن اتبعه ؛ ومنه قوله تعالى : وأيدهم بروح منه أي برحمة ، وقرئ : \" فروح وريحان \" . وقيل : وروح منه وبرهان منه ؛ وكان عيسى برهانا وحجة على قومه صلى الله عليه وسلم .\nقوله تعالى : فآمنوا بالله ورسوله أي آمنوا بأن الله إله واحد خالق المسيح ومرسله ، وآمنوا برسله ومنهم عيسى فلا تجعلوه إلها . ولا تقولوا آلهتنا ثلاثة عن الزجاج . قال ابن عباس : يريد بالتثليث الله تعالى وصاحبته وابنه . وقال الفراء وأبو عبيد : أي لا تقولوا هم ثلاثة ؛ كقوله تعالى : سيقولون ثلاثة . قال أبو علي : التقدير ولا تقولوا هو ثالث ثلاثة ؛ فحذف المبتدأ والمضاف . والنصارى مع فرقهم مجمعون على التثليث ويقولون : إن الله جوهر واحد وله ثلاثة أقانيم ؛ فيجعلون كل أقنوم إلها ويعنون بالأقانيم الوجود والحياة والعلم ، وربما يعبرون عن الأقانيم بالأب والابن وروح القدس ؛ فيعنون بالأب الوجود ، وبالروح الحياة ، وبالابن المسيح ، في كلام لهم فيه تخبط بيانه في أصول الدين . ومحصول كلامهم يئول إلى التمسك بأن عيسى إله بما كان يجريه الله سبحانه وتعالى على يديه من خوارق العادات على حسب دواعيه وإرادته ؛ وقالوا : قد علمنا خروج هذه الأمور عن مقدور البشر ، فينبغي أن يكون المقتدر عليها موصوفا بالإلهية ؛ فيقال لهم : لو كان ذلك من مقدوراته وكان مستقلا به كان تخليص نفسه من أعدائه ودفع شرهم عنه من مقدوراته ، وليس كذلك ؛ فإن اعترفت النصارى بذلك فقد سقط قولهم ودعواهم أنه كان يفعلها مستقلا به ؛ وإن لم يسلموا ذلك فلا حجة لهم أيضا ؛ لأنهم معارضون بموسى عليه السلام ، وما كان يجري على يديه من الأمور العظام ، مثل قلب العصا ثعبانا ، وفلق البحر واليد البيضاء والمن والسلوى ، وغير ذلك ؛ وكذلك ما جرى على يد الأنبياء ؛ فإن أنكروا ذلك فننكر ما يدعونه هم أيضا من ظهوره على يد عيسى عليه السلام ، فلا يمكنهم إثبات شيء من ذلك لعيسى ؛ فإن طريق إثباته عندنا نصوص القرآن وهم ينكرون القرآن ، ويكذبون من أتى به ، فلا يمكنهم إثبات ذلك بأخبار التواتر . وقد قيل : إن النصارى كانوا على دين الإسلام إحدى وثمانين سنة بعدما رفع عيسى ؛ يصلون إلى القبلة ؛ ويصومون شهر رمضان ، حتى وقع فيما بينهم وبين اليهود حرب ، وكان في اليهود رجل شجاع يقال له بولس ، قتل جماعة من أصحاب عيسى فقال : إن كان الحق مع عيسى فقد كفرنا وجحدنا وإلى النار مصيرنا ، ونحن مغبونون إن دخلوا الجنة ودخلنا النار ؛ وإني أحتال فيهم فأضلهم فيدخلون النار ؛ وكان له فرس يقال لها العقاب ، فأظهر الندامة ووضع على رأسه التراب وقال للنصارى : أنا بولس عدوكم قد نوديت من السماء أن ليست لك توبة إلا أن تتنصر ، فأدخلوه في الكنيسة بيتا فأقام فيه سنة لا يخرج ليلا ولا نهارا حتى تعلم الإنجيل ؛ فخرج وقال : نوديت من السماء أن الله قد قبل توبتك فصدقوه وأحبوه ، ثم مضى إلى بيت المقدس واستخلف عليهم نسطورا وأعلمه أن عيسى ابن مريم إله ، ثم توجه إلى اللاهوت والناسوت وقال : لم يكن عيسى بإنس فتأنس ولا بجسم فتجسم ولكنه ابن الله . وعلم رجلا يقال له يعقوب ذلك ؛ ثم دعا رجلا يقال له الملك فقال له ؛ إن الإله لم يزل ولا يزال عيسى ؛ فلما استمكن منهم دعا هؤلاء الثلاثة واحدا واحدا وقال له : أنت خالصتي ولقد رأيت المسيح في النوم ورضي عني ، وقال لكل واحد منهم : إني غدا أذبح نفسي وأتقرب بها ، فادع الناس إلى نحلتك ، ثم دخل المذبح فذبح نفسه ؛ فلما كان يوم ثالثه دعا كل واحد منهم الناس إلى نحلته ، فتبع كل واحد منهم طائفة ، فاقتتلوا واختلفوا إلى يومنا هذا ، فجميع النصارى من الفرق الثلاث ؛ فهذا كان سبب شركهم فيما يقال ؛ والله أعلم . وقد رويت هذه القصة في معنى قوله تعالى : فأغرينا بينهم العداوة والبغضاء إلى يوم القيامة وسيأتي إن شاء الله تعالى .\nقوله تعالى : انتهوا خيرا لكم خيرا منصوب عند سيبويه بإضمار فعل ؛ كأنه قال : ائتوا خيرا لكم ، لأنه إذا نهاهم عن الشرك فقد أمرهم بإتيان ما هو خير لهم ؛ قال سيبويه : ومما ينتصب على إضمار الفعل المتروك إظهاره انتهوا خيرا لكم لأنك إذا قلت : ائته فأنت تخرجه من أمر وتدخله في آخر ؛ وأنشد :\nفواعديه سرحتي مالك أو الربا بينهما أسهلا\nومذهب أبي عبيدة : انتهوا يكن خيرا لكم ؛ قال محمد بن يزيد : هذا خطأ ؛ لأنه يضمر الشرط وجوابه ، وهذا لا يوجد في كلام العرب . ومذهب الفراء أنه نعت لمصدر محذوف ؛ قال علي بن سليمان : هذا خطأ فاحش ؛ لأنه يكون المعنى : انتهوا الانتهاء الذي هو خير لكم .\nقوله تعالى : إنما الله إله واحد هذا ابتداء وخبر ؛ وواحد نعت له . ويجوز أن يكون إله بدلا من اسم الله عز وجل وواحد خبره ؛ التقدير إنما المعبود واحد .\nسبحانه أن يكون له ولد أي تنزيها عن أن يكون له ولد ؛ فلما سقط \" عن \" كان أن في محل النصب بنزع الخافض ؛ أي كيف يكون له ولد ؟ وولد الرجل مشبه له ، ولا شبيه لله عز وجل . له ما في السماوات وما في الأرض فلا شريك له ، وعيسى ومريم من جملة ما في السماوات وما في الأرض ، وما فيهما مخلوق ، فكيف يكون عيسى إلها وهو مخلوق ! وإن جاز ولد فليجز أولاد حتى يكون كل من ظهرت عليه معجزة ولدا له . وكفى بالله وكيلا أي لأوليائه ؛ وقد تقدم .\n                                    ",
        "saadi": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ وَلَا تَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥٓ أَلۡقَىٰهَآ إِلَىٰ مَرۡيَمَ وَرُوحٞ مِّنۡهُۖ فَ‍َٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُواْ ثَلَٰثَةٌۚ ٱنتَهُواْ خَيۡرٗا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَٰهٞ وَٰحِدٞۖ سُبۡحَٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٞۘ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا ١٧١\n                                        \n                                        \n                                        \n                                        ينهى تعالى أهل الكتاب عن الغلو في الدين وهو مجاوزة الحد والقدر المشروع إلى ما ليس بمشروع. وذلك كقول النصارى في غلوهم بعيسى عليه السلام، ورفعه عن مقام النبوة والرسالة إلى مقام الربوبية الذي لا يليق بغير الله، فكما أن التقصير والتفريط من المنهيات، فالغلو كذلك، ولهذا قال: { وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ } وهذا الكلام يتضمن ثلاثة أشياء: أمرين منهي عنهما، وهما قول الكذب على الله، والقول بلا علم في أسمائه وصفاته وأفعاله وشرعه ورسله، والثالث: مأمور به وهو قول الحق في هذه الأمور. ولما كانت هذه قاعدة عامة كلية، وكان السياق في شأن عيسى عليه السلام نصَّ على قول الحق فيه، المخالف لطريقة اليهودية والنصرانية فقال: { إِنَّمَا الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ رَسُولُ اللَّهِ } أي: غاية المسيح عليه السلام ومنتهى ما يصل إليه من مراتب الكمال أعلى حالة تكون للمخلوقين، وهي درجة الرسالة التي هي أعلى الدرجات وأجلّ المثوبات. وأنه { كَلِمَتُهُ } التي { أَلْقَاهَا إِلَى مَرْيَمَ } أي: كلمة تكلم الله بها فكان بها عيسى، ولم يكن تلك الكلمة، وإنما كان بها، وهذا من باب إضافة التشريف والتكريم. وكذلك قوله: { وَرُوحٌ مّنْهُ } أي: من الأرواح التي خلقها وكملها بالصفات الفاضلة والأخلاق الكاملة، أرسل الله روحه جبريل عليه السلام فنفخ في فرج مريم عليها السلام، فحملت بإذن الله بعيسى عليه السلام. فلما بيّن حقيقة عيسى عليه السلام، أمر أهل الكتاب بالإيمان به وبرسله، ونهاهم أن يجعلوا الله ثالث ثلاثة أحدهم عيسى، والثاني مريم، فهذه مقالة النصارى قبحهم الله. فأمرهم أن ينتهوا، وأخبر أن ذلك خير لهم، لأنه الذي يتعين أنه سبيل النجاة، وما سواه فهو طريق الهلاك، ثم نزه نفسه عن الشريك والولد فقال: { إِنَّمَا اللَّهُ إِلَهٌ وَاحِدٌ } أي: هو المنفرد بالألوهية، الذي لا تنبغي العبادة إلا له. { سُبْحَانَهُ } أي: تنزه وتقدس { أَن يَكُونَ لَهُ وَلَدٌ } لأن { لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ } فالكل مملوكون له مفتقرون إليه، فمحال أن يكون له شريك منهم أو ولد. ولما أخبر أنه المالك للعالم العلوي والسفلي أخبر أنه قائم بمصالحهم الدنيوية والأخروية وحافظها، ومجازيهم عليها تعالى.s\n                                    "
      },
      "originalText": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ وَلَا تَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥٓ أَلۡقَىٰهَآ إِلَىٰ مَرۡيَمَ وَرُوحٞ مِّنۡهُۖ فَ‍َٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُواْ ثَلَٰثَةٌۚ ٱنتَهُواْ خَيۡرٗا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَٰهٞ وَٰحِدٞۖ سُبۡحَٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٞۘ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا ١٧١"
    },
    {
      "number": 665,
      "text": "لَنْ يَسْتَنْكِفَ الْمَسِيحُ أَنْ يَكُونَ عَبْدًا لِلَّهِ وَلَا الْمَلَائِكَةُ الْمُقَرَّبُونَ ۚ وَمَنْ يَسْتَنْكِفْ عَنْ عِبَادَتِهِ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 172,
      "juz": 6,
      "manzil": 1,
      "page": 105,
      "ruku": 85,
      "hizbQuarter": 42,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّن يَسۡتَنكِفَ ٱلۡمَسِيحُ أَن يَكُونَ عَبۡدٗا لِّلَّهِ وَلَا ٱلۡمَلَٰٓئِكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن يَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَيَسۡتَكۡبِرۡ فَسَيَحۡشُرُهُمۡ إِلَيۡهِ جَمِيعٗا ٢٧١\n                                    \n                                    \n                                    قال ابن أبي حاتم : حدثنا أبي ، حدثنا إبراهيم بن موسى ، حدثنا ، عن ابن جريج ، عن عطاء ، عن ابن عباس قوله : ( لن يستنكف المسيح أن يكون عبدا لله ) لن يستكبر .\nوقال قتادة : لن يحتشم ( المسيح أن يكون عبدا لله ولا الملائكة المقربون ) وقد استدل بعض من ذهب إلى تفضيل الملائكة على البشر بهذه الآية حيث قال : ( ولا الملائكة المقربون ) وليس له في ذلك دلالة ; لأنه إنما عطف الملائكة على المسيح ; لأن الاستنكاف هو الامتناع ، والملائكة أقدر على ذلك من المسيح ; فلهذا قال : ( ولا الملائكة المقربون ) ولا يلزم من كونهم أقوى وأقدر على الامتناع أن يكونوا أفضل .\nوقيل : إنما ذكروا ; لأنهم اتخذوا آلهة مع الله ، كما اتخذ المسيح ، فأخبر تعالى أنهم عبيد من عبيده وخلق من خلقه ، كما قال الله تعالى : ( وقالوا اتخذ الرحمن ولدا سبحانه بل عباد مكرمون [ لا يسبقونه بالقول وهم بأمره يعملون . يعلم ما بين أيديهم وما خلفهم ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون . ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين ] ) الأنبياء : [ 26 - 29 ] .\nثم قال : ( ومن يستنكف عن عبادته ويستكبر فسيحشرهم إليه جميعا ) أي : فيجمعهم إليه يوم القيامة ، ويفصل بينهم بحكمه العدل ، الذي لا يجور فيه ولا يحيف\n                                    ",
        "qortoby": "لَّن يَسۡتَنكِفَ ٱلۡمَسِيحُ أَن يَكُونَ عَبۡدٗا لِّلَّهِ وَلَا ٱلۡمَلَٰٓئِكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن يَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَيَسۡتَكۡبِرۡ فَسَيَحۡشُرُهُمۡ إِلَيۡهِ جَمِيعٗا ٢٧١\n                                    \n                                    \n                                    قوله تعالى : لن يستنكف المسيح أن يكون عبدا لله ولا الملائكة المقربون ومن يستنكف عن عبادته ويستكبر فسيحشرهم إليه جميعا\nقوله تعالى : لن يستنكف المسيح أي لن يأنف ولن يحتشم . أن يكون عبدا لله أي : من أن يكون ؛ فهو في موضع نصب . وقرأ الحسن : \" إن يكون \" بكسر الهمزة على أنها نفي هو بمعنى \" ما \" والمعنى : ما يكون له ولد ؛ وينبغي رفع يكون ولم يذكره الرواة . ولا الملائكة المقربون أي من رحمة الله ورضاه ؛ فدل بهذا على أن الملائكة أفضل من الأنبياء صلوات الله عليهم أجمعين . وكذا ولا أقول إني ملك وقد تقدمت الإشارة إلى هذا المعنى في \" البقرة \" . ومن يستنكف أي يأنف عن عبادته ويستكبر فلا يفعلها . فسيحشرهم إليه أي إلى المحشر . جميعا فيجازي كلا بما يستحق ، كما بينه في الآية بعد هذا\n                                    ",
        "saadi": "لَّن يَسۡتَنكِفَ ٱلۡمَسِيحُ أَن يَكُونَ عَبۡدٗا لِّلَّهِ وَلَا ٱلۡمَلَٰٓئِكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن يَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَيَسۡتَكۡبِرۡ فَسَيَحۡشُرُهُمۡ إِلَيۡهِ جَمِيعٗا ٢٧١\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى غلو النصارى في عيسى عليه السلام، وذكر أنه عبده ورسوله، ذكر هنا أنه لا يستنكف عن عبادة ربه، أي: لا يمتنع عنها رغبة عنها، لا هو { وَلَا الْمَلَائِكَةُ الْمُقَرَّبُونَ } فنزههم عن الاستنكاف وتنزيههم عن الاستكبار من باب أولى، ونفي الشيء فيه إثبات ضده. أي: فعيسى والملائكة المقربون قد رغبوا في عبادة ربهم، وأحبوها وسعوا فيها بما يليق بأحوالهم، فأوجب لهم ذلك الشرف العظيم والفوز العظيم، فلم يستنكفوا أن يكونوا عبيدا لربوبيته ولا لإلهيته، بل يرون افتقارهم لذلك فوق كل افتقار. ولا يظن أن رفع عيسى أو غيره من الخلق فوق مرتبته التي أنزله الله فيها وترفعه عن العبادة كمالا، بل هو النقص بعينه، وهو محل الذم والعقاب، ولهذا قال: { وَمَن يَسْتَنكِفْ عَنْ عِبَادَتِهِ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا } أي: فسيحشر الخلق كلهم إليه، المستنكفين والمستكبرين وعباده المؤمنين، فيحكم بينهم بحكمه العدل، وجزائه الفصل.\n                                    "
      },
      "originalText": "لَّن يَسۡتَنكِفَ ٱلۡمَسِيحُ أَن يَكُونَ عَبۡدٗا لِّلَّهِ وَلَا ٱلۡمَلَٰٓئِكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن يَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَيَسۡتَكۡبِرۡ فَسَيَحۡشُرُهُمۡ إِلَيۡهِ جَمِيعٗا ٢٧١"
    },
    {
      "number": 666,
      "text": "فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ وَيَزِيدُهُمْ مِنْ فَضْلِهِ ۖ وَأَمَّا الَّذِينَ اسْتَنْكَفُوا وَاسْتَكْبَرُوا فَيُعَذِّبُهُمْ عَذَابًا أَلِيمًا وَلَا يَجِدُونَ لَهُمْ مِنْ دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 173,
      "juz": 6,
      "manzil": 1,
      "page": 105,
      "ruku": 85,
      "hizbQuarter": 42,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡ وَيَزِيدُهُم مِّن فَضۡلِهِۦۖ وَأَمَّا ٱلَّذِينَ ٱسۡتَنكَفُواْ وَٱسۡتَكۡبَرُواْ فَيُعَذِّبُهُمۡ عَذَابًا أَلِيمٗا وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيّٗا وَلَا نَصِيرٗا ٣٧١\n                                    \n                                    \n                                    ولهذا قال : ( فأما الذين آمنوا وعملوا الصالحات فيوفيهم أجورهم ويزيدهم من فضله ) يعني : فيعطيهم من الثواب على قدر أعمالهم الصالحة ويزيدهم على ذلك من فضله وإحسانه وسعة رحمته وامتنانه .\nوقد روى ابن مردويه من طريق بقية ، عن إسماعيل بن عبد الله الكندي ، عن الأعمش ، عن سفيان عن عبد الله قال : قال رسول الله صلى الله عليه وسلم ( فيوفيهم أجورهم ويزيدهم من فضله ) قال : أجورهم : أدخلهم الجنة \" . ( ويزيدهم من فضله ) قال : \" الشفاعة فيمن وجبت له النار ممن صنع إليهم المعروف في دنياهم \" .\nوهذا إسناد لا يثبت ، وإذا روي عن ابن مسعود موقوفا فهو جيد .\n( وأما الذين استنكفوا واستكبروا ) أي : امتنعوا من طاعة الله وعبادته واستكبروا عن ذلك ( فيعذبهم عذابا أليما ولا يجدون لهم من دون الله وليا ولا نصيرا ) كما قال تعالى ( إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين ) [ غافر : 60 ] أي : صاغرين حقيرين ذليلين ، كما كانوا ممتنعين مستكبرين .\n                                    ",
        "qortoby": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡ وَيَزِيدُهُم مِّن فَضۡلِهِۦۖ وَأَمَّا ٱلَّذِينَ ٱسۡتَنكَفُواْ وَٱسۡتَكۡبَرُواْ فَيُعَذِّبُهُمۡ عَذَابًا أَلِيمٗا وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيّٗا وَلَا نَصِيرٗا ٣٧١\n                                    \n                                    \n                                    فأما الذين آمنوا وعملوا الصالحات فيوفيهم أجورهم ويزيدهم من فضله إلى قوله : نصيرا . وأصل يستنكف نكف ، فالياء والسين والتاء زوائد ؛ يقال : نكفت من الشيء واستنكفت منه وأنكفته أي نزهته عما يستنكف منه ؛ ومنه الحديث سئل عن \" سبحان الله \" فقال : إنكاف الله من كل سوء يعني تنزيهه وتقديسه عن الأنداد والأولاد . وقال الزجاج : استنكف أي أنف مأخوذ من نكفت الدمع إذا نحيته بإصبعك عن خدك ، ومنه الحديث ما ينكف العرق عن جبينه أي ما ينقطع ؛ ومنه الحديث جاء بجيش لا ينكف آخره أي لا ينقطع آخره . وقيل : هو من النكف وهو العيب ؛ يقال : ما عليه في هذا الأمر نكف ولا وكف أي عيب : أي لن يمتنع المسيح ولن يتنزه من العبودية ولن ينقطع عنها ولن يعيبها .\n\n                                    ",
        "saadi": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡ وَيَزِيدُهُم مِّن فَضۡلِهِۦۖ وَأَمَّا ٱلَّذِينَ ٱسۡتَنكَفُواْ وَٱسۡتَكۡبَرُواْ فَيُعَذِّبُهُمۡ عَذَابًا أَلِيمٗا وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيّٗا وَلَا نَصِيرٗا ٣٧١\n                                        \n                                        \n                                        \n                                        ثم فصل حكمه فيهم فقال: { فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ } أي: جمعوا بين الإيمان المأمور به، وعمل الصالحات من واجبات ومستحبات، من حقوق الله وحقوق عباده. { فَيُوَفِّيهِمْ أُجُورَهُمْ } أي: الأجور التي رتبها على الأعمال، كُلٌّ بحسب إيمانه وعمله. { وَيَزِيدُهُم مِن فَضْلِهِ } من الثواب الذي لم تنله أعمالهم ولم تصل إليه أفعالهم، ولم يخطر على قلوبهم. ودخل في ذلك كل ما في الجنة من المآكل والمشارب، والمناكح، والمناظر والسرور، ونعيم القلب والروح، ونعيم البدن، بل يدخل في ذلك كل خير ديني ودنيوي رتب على الإيمان والعمل الصالح. { وَأَمَّا الَّذِينَ اسْتَنكَفُوا وَاسْتَكْبَرُوا } أي: عن عبادة الله تعالى { فَيُعَذِّبُهُمْ عَذَابًا أَلِيمًا } وهو سخط الله وغضبه، والنار الموقدة التي تطلع على الأفئدة. { وَلَا يَجِدُونَ لَهُم مِّن دُونِ اللَّهِ وَلِيًّا وَلَا نَصِيرًا } أي: لا يجدون أحدا من الخلق يتولاهم فيحصل لهم المطلوب، ولا مَن ينصرهم فيدفع عنهم المرهوب، بل قد تخلى عنهم أرحم الراحمين، وتركهم في عذابهم خالدين، وما حكم به تعالى فلا رادّ لحكمه ولا مغيّر لقضائه.\n                                    "
      },
      "originalText": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡ وَيَزِيدُهُم مِّن فَضۡلِهِۦۖ وَأَمَّا ٱلَّذِينَ ٱسۡتَنكَفُواْ وَٱسۡتَكۡبَرُواْ فَيُعَذِّبُهُمۡ عَذَابًا أَلِيمٗا وَلَا يَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِيّٗا وَلَا نَصِيرٗا ٣٧١"
    },
    {
      "number": 667,
      "text": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمْ بُرْهَانٌ مِنْ رَبِّكُمْ وَأَنْزَلْنَا إِلَيْكُمْ نُورًا مُبِينًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 174,
      "juz": 6,
      "manzil": 1,
      "page": 105,
      "ruku": 85,
      "hizbQuarter": 42,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُم بُرۡهَٰنٞ مِّن رَّبِّكُمۡ وَأَنزَلۡنَآ إِلَيۡكُمۡ نُورٗا مُّبِينٗا ٤٧١\n                                    \n                                    \n                                    يقول تعالى مخاطبا جميع الناس ومخبرا بأنه قد جاءهم منه برهان عظيم ، وهو الدليل القاطع للعذر ، والحجة المزيلة للشبهة ; ولهذا قال : ( وأنزلنا إليكم نورا مبينا ) أي : ضياء واضحا على الحق ، قال ابن جريج وغيره : وهو القرآن .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُم بُرۡهَٰنٞ مِّن رَّبِّكُمۡ وَأَنزَلۡنَآ إِلَيۡكُمۡ نُورٗا مُّبِينٗا ٤٧١\n                                    \n                                    \n                                    قوله تعالى : ياأيها الناس قد جاءكم برهان من ربكم وأنزلنا إليكم نورا مبينا\nقوله تعالى : يا أيها الناس قد جاءكم برهان من ربكم يعني محمدا صلى الله عليه وسلم ؛ عن الثوري ؛ وسماه برهانا لأن معه البرهان وهو المعجزة . وقال مجاهد : البرهان هاهنا الحجة ؛ والمعنى متقارب ؛ فإن المعجزات حجته صلى الله عليه وسلم . والنور المنزل هو القرآن ؛ عن الحسن ؛ وسماه نورا لأن به تتبين الأحكام ويهتدى به من الضلالة ، فهو نور مبين ، أي واضح بين .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُم بُرۡهَٰنٞ مِّن رَّبِّكُمۡ وَأَنزَلۡنَآ إِلَيۡكُمۡ نُورٗا مُّبِينٗا ٤٧١\n                                        \n                                        \n                                        \n                                        يمتن تعالى على سائر الناس بما أوصل إليهم من البراهين القاطعة والأنوار الساطعة، ويقيم عليهم الحجة، ويوضح لهم المحجة، فقال: { يَأَيُّهَا النَّاسُ قَدْ جَاءَكُم بُرْهَانٌ مِن رَّبِّكُمْ } أي: حجج قاطعة على الحق تبينه وتوضحه، وتبين ضده. وهذا يشمل الأدلة العقلية والنقلية، الآيات الأفقية والنفسية { سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقّ } وفي قوله: { مِن رَّبِّكُمْ } ما يدل على شرف هذا البرهان وعظمته، حيث كان من ربكم الذي رباكم التربية الدينية والدنيوية، فمن تربيته لكم التي يحمد عليها ويشكر، أن أوصل إليكم البينات، ليهديكم بها إلى الصراط المستقيم، والوصول إلى جنات النعيم. { وَأَنزَلْنَا إِلَيْكُمْ نُورًا مُّبِينًا } وهو هذا القرآن العظيم، الذي قد اشتمل على علوم الأولين والآخرين والأخبار الصادقة النافعة، والأمر بكل عدل وإحسان وخير، والنهي عن كل ظلم وشر، فالناس في ظلمة إن لم يستضيئوا بأنواره، وفي شقاء عظيم إن لم يقتبسوا من خيره.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُم بُرۡهَٰنٞ مِّن رَّبِّكُمۡ وَأَنزَلۡنَآ إِلَيۡكُمۡ نُورٗا مُّبِينٗا ٤٧١"
    },
    {
      "number": 668,
      "text": "فَأَمَّا الَّذِينَ آمَنُوا بِاللَّهِ وَاعْتَصَمُوا بِهِ فَسَيُدْخِلُهُمْ فِي رَحْمَةٍ مِنْهُ وَفَضْلٍ وَيَهْدِيهِمْ إِلَيْهِ صِرَاطًا مُسْتَقِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 175,
      "juz": 6,
      "manzil": 1,
      "page": 105,
      "ruku": 85,
      "hizbQuarter": 42,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَٱعۡتَصَمُواْ بِهِۦ فَسَيُدۡخِلُهُمۡ فِي رَحۡمَةٖ مِّنۡهُ وَفَضۡلٖ وَيَهۡدِيهِمۡ إِلَيۡهِ صِرَٰطٗا مُّسۡتَقِيمٗا ٥٧١\n                                    \n                                    \n                                    ( فأما الذين آمنوا بالله واعتصموا به ) أي : جمعوا بين مقامي العبادة والتوكل على الله في جميع أمورهم . وقال ابن جريج : آمنوا بالله واعتصموا بالقرآن . رواه ابن جرير .\n( فسيدخلهم في رحمة منه وفضل ) أي : يرحمهم فيدخلهم الجنة ويزيدهم ثوابا ومضاعفة ورفعا في درجاتهم ، من فضله عليهم وإحسانه إليهم ، ( ويهديهم إليه صراطا مستقيما ) أي : طريقا واضحا قصدا قواما لا اعوجاج فيه ولا انحراف . وهذه صفة المؤمنين في الدنيا والآخرة ، فهم في الدنيا على منهاج الاستقامة وطريق السلامة في جميع الاعتقادات والعمليات ، وفي الآخرة على صراط الله المستقيم المفضي إلى روضات الجنات . وفي حديث الحارث الأعور عن علي بن أبي طالب رضي الله عنه ، عن النبي صلى الله عليه وسلم أنه قال : \" القرآن صراط الله المستقيم وحبل الله المتين \" . وقد تقدم الحديث بتمامه في أول التفسير ولله الحمد والمنة .\n                                    ",
        "qortoby": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَٱعۡتَصَمُواْ بِهِۦ فَسَيُدۡخِلُهُمۡ فِي رَحۡمَةٖ مِّنۡهُ وَفَضۡلٖ وَيَهۡدِيهِمۡ إِلَيۡهِ صِرَٰطٗا مُّسۡتَقِيمٗا ٥٧١\n                                    \n                                    \n                                    قوله تعالى : فأما الذين آمنوا بالله واعتصموا به فسيدخلهم في رحمة منه وفضل ويهديهم إليه صراطا مستقيما\nقوله تعالى : فأما الذين آمنوا بالله واعتصموا به أي بالقرآن عن معاصيه ، وإذا اعتصموا بكتابه فقد اعتصموا به وبنبيه . وقيل : اعتصموا به أي بالله . والعصمة الامتناع ، وقد تقدم . ويهديهم أي : وهو يهديهم فأضمر هو ليدل على أن الكلام مقطوع مما قبله . إليه أي إلى ثوابه . وقيل : إلى الحق ليعرفوه . صراطا مستقيما أي دينا مستقيما . و \" صراطا \" منصوب بإضمار فعل دل عليه \" ويهديهم \" التقدير ؛ ويعرفهم صراطا مستقيما . وقيل : هو مفعول ثان على تقدير ؛ ويهديهم إلى ثوابه صراطا مستقيما . وقيل : هو حال . والهاء في إليه قيل : هي للقرآن ، وقيل : للفضل ، وقيل للفضل والرحمة ؛ لأنهما بمعنى الثواب . وقيل : هي لله عز وجل على حذف المضاف كما تقدم من أن المعنى ويهديهم إلى ثوابه . أبو علي : الهاء راجعة إلى ما تقدم من اسم الله عز وجل ، والمعنى ويهديهم إلى صراطه ؛ فإذا جعلنا صراطا مستقيما نصبا على الحال كانت الحال من هذا المحذوف . وفي قوله : \" وفضل \" دليل على أنه تعالى يتفضل على عباده بثوابه ؛ إذ لو كان في مقابلة العمل لما كان فضلا . والله أعلم .\n                                    ",
        "saadi": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَٱعۡتَصَمُواْ بِهِۦ فَسَيُدۡخِلُهُمۡ فِي رَحۡمَةٖ مِّنۡهُ وَفَضۡلٖ وَيَهۡدِيهِمۡ إِلَيۡهِ صِرَٰطٗا مُّسۡتَقِيمٗا ٥٧١\n                                        \n                                        \n                                        \n                                        انقسم الناس -بحسب الإيمان بالقرآن والانتفاع به- قسمين: { فَأَمَّا الَّذِينَ آمَنُوا بِاللَّهِ } أي: اعترفوا بوجوده واتصافه بكل وصف كامل، وتنزيهه من كل نقص وعيب. { وَاعْتَصَمُــوا بِـهِ } أي: لجأوا إلى الله واعتمدوا عليه وتبرأوا من حولهم وقوتهم واستعانوا بربهم. { فَسَيُدْخِلُهُمْ فِي رَحْمَةٍ مِّنْهُ وَفَضْلٍ } أي: فسيتغمدهم بالرحمة الخاصة، فيوفقهم للخيرات ويجزل لهم المثوبات، ويدفع عنهم البليات والمكروهات. { وَيَهْدِيهِمْ إِلَيْهِ صِرَاطًا مُّسْتَقِيمًا } أي: يوفقهم للعلم والعمل، معرفة الحق والعمل به. أي: ومن لم يؤمن بالله ويعتصم به ويتمسك بكتابه، منعهم من رحمته، وحرمهم من فضله، وخلى بينهم وبين أنفسهم، فلم يهتدوا، بل ضلوا ضلالا مبينا، عقوبة لهم على تركهم الإيمان فحصلت لهم الخيبة والحرمان، نسأله تعالى العفو والعافية والمعافاة.\n                                    "
      },
      "originalText": "فَأَمَّا ٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَٱعۡتَصَمُواْ بِهِۦ فَسَيُدۡخِلُهُمۡ فِي رَحۡمَةٖ مِّنۡهُ وَفَضۡلٖ وَيَهۡدِيهِمۡ إِلَيۡهِ صِرَٰطٗا مُّسۡتَقِيمٗا ٥٧١"
    }
  ]
}