{
  "number": 107,
  "ayahsNumber": 3,
  "ayahs": [
    {
      "number": 672,
      "text": "حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ وَالْمُنْخَنِقَةُ وَالْمَوْقُوذَةُ وَالْمُتَرَدِّيَةُ وَالنَّطِيحَةُ وَمَا أَكَلَ السَّبُعُ إِلَّا مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى النُّصُبِ وَأَنْ تَسْتَقْسِمُوا بِالْأَزْلَامِ ۚ ذَٰلِكُمْ فِسْقٌ ۗ الْيَوْمَ يَئِسَ الَّذِينَ كَفَرُوا مِنْ دِينِكُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ ۚ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا ۚ فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِإِثْمٍ ۙ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 3,
      "juz": 6,
      "manzil": 2,
      "page": 107,
      "ruku": 86,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٣\n                                    \n                                    \n                                    يخبر تعالى عباده خبرا متضمنا النهي عن تعاطي هذه المحرمات من الميتة وهي : ما مات من الحيوان حتف أنفه ، من غير ذكاة ولا اصطياد ، وما ذاك إلا لما فيها من المضرة ، لما فيها من الدم المحتقن ، فهي ضارة للدين وللبدن فلهذا حرمها الله ، عز وجل ، ويستثني من الميتة السمك ، فإنه حلال سواء مات بتذكية أو غيرها ، لما رواه مالك في موطئه والشافعي وأحمد في مسنديهما وأبو داود والترمذي والنسائي وابن ماجه في سننهم وابن خزيمة وابن حبان في صحيحيهما ، عن أبي هريرة ، أن رسول الله صلى الله عليه وسلم سئل عن ماء البحر ، فقال : \" هو الطهور ماؤه الحل ميتته \" .\nوهكذا الجراد ، لما سيأتي من الحديث ، وقوله : ( والدم ) يعني [ به ] المسفوح ; لقوله : ( أو دما مسفوحا ) [ الأنعام : 145 ] قاله ابن عباس وسعيد بن جبير .\nقال ابن أبي حاتم : حدثنا كثير بن شهاب المذحجي ، حدثنا محمد بن سعيد بن سابق ، حدثنا عمرو - يعني ابن قيس - عن سماك عن عكرمة عن ابن عباس : أنه سئل عن الطحال فقال : كلوه . فقالوا : إنه دم . فقال : إنما حرم عليكم الدم المسفوح .\nوكذا رواه حماد بن سلمة ، عن يحيى بن سعيد ، عن القاسم عن عائشة ، قالت : إنما نهى عن الدم السافح .\nوقد قال أبو عبد الله محمد بن إدريس الشافعي : حدثنا عبد الرحمن بن زيد بن أسلم عن أبيه عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم \" أحل لنا ميتتان ودمان ، فأما الميتتان فالحوت والجراد ، وأما الدمان فالكبد والطحال \" .\nوكذا رواه أحمد بن حنبل وابن ماجه والدارقطني والبيهقي من حديث عبد الرحمن بن زيد بن أسلم وهو ضعيف . قال الحافظ البيهقي : ورواه إسماعيل بن أبي إدريس عن أسامة وعبد الله وعبد الرحمن بن زيد بن أسلم ، عن ابن عمر مرفوعا .\nقلت : وثلاثتهم ضعفاء ، ولكن بعضهم أصلح من بعض . وقد رواه سليمان بن بلال أحد الأثبات ، عن زيد بن أسلم ، عن ابن عمر ، فوقفه بعضهم عليه . قال الحافظ أبو زرعة الرازي : وهو أصح .\nوقال ابن أبي حاتم : حدثنا علي بن الحسن ، حدثنا محمد بن عبد الملك بن أبي الشوارب ، حدثنا بشير بن سريج ، عن أبي غالب ، عن أبي أمامة - وهو صدي بن عجلان - قال : بعثني رسول الله صلى الله عليه وسلم إلى قومي أدعوهم إلى الله ورسوله ، وأعرض عليهم شرائع الإسلام ، فأتيتهم ، فبينا نحن كذلك إذ جاؤوا بقصعة من دم ، فاجتمعوا عليها يأكلونها ، قالوا : هلم يا صدي فكل . قال : قلت : ويحكم! إنما أتيتكم من عند محرم هذا عليكم ، وأنزل الله عليه ، قالوا : وما ذاك؟ قال : فتلوت عليهم هذه الآية : ( حرمت عليكم الميتة والدم [ ولحم الخنزير ] ) الآية .\nورواه الحافظ أبو بكر بن مردويه من حديث ابن أبي الشوارب بإسناد مثله ، وزاد بعد هذا السياق : قال : فجعلت أدعوهم إلى الإسلام ، ويأبون علي ، فقلت لهم : ويحكم ، اسقوني شربة من ماء ، فإني شديد العطش - قال : وعلي عباءتي - فقالوا : لا ولكن ندعك حتى تموت عطشا . قال : فاغتممت وضربت برأسي في العباء ، ونمت على الرمضاء في حر شديد ، قال : فأتاني آت في منامي بقدح من زجاج لم ير الناس أحسن منه ، وفيه شراب لم ير الناس [ شرابا ] ألذ منه ، فأمكنني منها فشربتها ، فحيث فرغت من شرابي استيقظت ، فلا والله ما عطشت ولا عريت بعد تيك الشربة .\nورواه الحاكم في مستدركه ، عن علي بن حمشاذ عن عبد الله بن أحمد بن حنبل ، حدثني عبد الله بن سلمة بن عياش العامري ، حدثنا صدقة بن هرمز عن أبي غالب ، عن أبي أمامة ، قد ذكر نحوه وزاد بعد قوله : \" بعد تيك الشربة \" : فسمعتهم يقولون : أتاكم رجل من سراة قومكم ، فلم تمجعوه بمذقة ، فأتوني بمذقة ، فقلت : لا حاجة لي فيها ، إن الله أطعمني وسقاني ، وأريتهم بطني فأسلموا عن آخرهم .\nوما أحسن ما أنشد الأعشى في قصيدته التي ذكرها ابن إسحاق :\nوإياك والميتات لا تقربنها ولا تأخذن عظما حديدا فتفصدا\nأي : لا تفعل كما يفعل الجاهلية ، وذلك أن أحدهم كان إذا جاع أخذ شيئا محددا من عظم ونحوه ، فيفصد به بعيره أو حيوانا من أي صنف كان ، فيجمع ما يخرج منه من الدم فيشربه ; ولهذا حرم الله الدم على هذه الأمة ، ثم قال الأعشى :\nوذا النصب المنصوب لا تأتينه ولا تعبد الأصنام والله فاعبدا\nوقوله : ( ولحم الخنزير ) يعني : إنسيه ووحشيه ، واللحم يعم جميع أجزائه حتى الشحم ، ولا يحتاج إلى تحذلق الظاهرية في جمودهم هاهنا وتعسفهم في الاحتجاج بقوله : ( فإنه رجس أو فسقا ) يعنون قوله تعالى : ( إلا أن يكون ميتة أو دما مسفوحا أو لحم خنزير فإنه رجس ) [ الأنعام : 145 ] أعادوا الضمير فيما فهموه على الخنزير ، حتى يعم جميع أجزائه ، وهذا بعيد من حيث اللغة ، فإنه لا يعود الضمير إلا إلى المضاف دون المضاف إليه ، والأظهر أن اللحم يعم جميع الأجزاء كما هو المفهوم من لغة العرب ، ومن العرف المطرد ، وفي صحيح مسلم عن بريدة بن الخصيب الأسلمي ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" من لعب بالنردشير فكأنما صبغ يده في لحم الخنزير ودمه \" فإذا كان هذا التنفير لمجرد اللمس فكيف يكون التهديد والوعيد الأكيد على أكله والتغذي به ، وفيه دلالة على شمول اللحم لجميع الأجزاء من الشحم وغيره .\nوفي الصحيحين : أن رسول الله صلى الله عليه وسلم قال : \" إن الله حرم بيع الخمر والميتة والخنزير والأصنام \" . فقيل : يا رسول الله ، أرأيت شحوم الميتة ، فإنها تطلى بها السفن ، وتدهن بها الجلود ، ويستصبح بها الناس؟ فقال : \" لا هو حرام \" .\nوفي صحيح البخاري من حديث أبي سفيان : أنه قال لهرقل ملك الروم : \" نهانا عن الميتة والدم \" .\nوقوله : ( وما أهل لغير الله به ) أي : ما ذبح فذكر عليه اسم غير الله ، فهو حرام ; لأن الله أوجب أن تذبح مخلوقاته على اسمه العظيم ، فمتى عدل بها عن ذلك وذكر عليها اسم غيره من صنم أو طاغوت أو وثن أو غير ذلك ، من سائر المخلوقات ، فإنها حرام بالإجماع . وإنما اختلف العلماء في المتروك التسمية عليه ، إما عمدا أو نسيانا ، كما سيأتي تقريره في سورة الأنعام .\nوقد قال ابن أبي حاتم : حدثنا علي بن الحسن الهسنجاني ، حدثنا نعيم بن حماد ، حدثنا ابن فضيل ، عن الوليد بن جميع ، عن أبي الطفيل قال : نزل آدم بتحريم أربع : الميتة ، والدم ، ولحم الخنزير ، وما أهل لغير الله به ، وإن هذه الأربعة الأشياء لم تحل قط ، ولم تزل حراما منذ خلق الله السموات والأرض ، فلما كانت بنو إسرائيل حرم الله عليهم طيبات أحلت لهم بذنوبهم ، فلما بعث الله عيسى ابن مريم ، عليه السلام ، نزل بالأمر الأول الذي جاء به آدم [ عليه السلام ] وأحل لهم ما سوى ذلك فكذبوه وعصوه . وهذا أثر غريب .\nوقال ابن أبي حاتم أيضا : حدثنا أبي ، حدثنا أحمد بن يونس ، حدثنا ربعي بن عبد الله قال : سمعت الجارود بن أبي سبرة - قال : هو جدي - قال : كان رجل من بني رياح يقال له : ابن وثيل ، وكان شاعرا ، نافر - غالبا - أبا الفرزدق بماء بظهر الكوفة ، على أن يعقر هذا مائة من إبله ، وهذا مائة من إبله ، إذا وردت الماء ، فلما وردت الماء قاما إليها بالسيوف ، فجعلا يكسفان عراقيبها . قال : فخرج الناس على الحمرات والبغال يريدون اللحم - قال : وعلي بالكوفة - قال : فخرج علي على بغلة رسول الله صلى الله عليه وسلم البيضاء وهو ينادي : يا أيها الناس ، لا تأكلوا من لحومها فإنما أهل بها لغير الله .\nهذا أثر غريب ، ويشهد له بالصحة ما رواه أبو داود : حدثنا هارون بن عبد الله ، حدثنا حماد بن مسعدة ، عن عوف عن أبي ريحانة ، عن ابن عباس قال : نهى النبي صلى الله عليه وسلم عن معاقرة الأعراب .\nثم قال أبو داود : محمد بن جعفر - هو غندر - أوقفه على ابن عباس . تفرد به أبو داود\nوقال أبو داود أيضا : حدثنا هارون بن زيد بن أبي الزرقاء ، حدثنا أبي ، حدثنا جرير بن حازم ، عن الزبير بن خريت قال : سمعت عكرمة يقول : إن رسول الله صلى الله عليه وسلم نهى عن طعام المتباريين أن يؤكل .\nثم قال أبو داود : أكثر من رواه عن جرير لا يذكر فيه ابن عباس . تفرد به أيضا .\nوقوله : ( والمنخنقة ) وهي التي تموت بالخنق إما قصدا أو اتفاقا ، بأن تتخبل في وثاقتها فتموت به ، فهي حرام .\nوأما ) الموقوذة ) فهي التي تضرب بشيء ثقيل غير محدد حتى تموت ، كما قال ابن عباس وغير واحد : هي التي تضرب بالخشب حتى توقذ بها فتموت .\nوقال قتادة : كان أهل الجاهلية يضربونها بالعصى حتى إذا ماتت أكلوها .\nوفي الصحيح : أن عدي بن حاتم قال : قلت : يا رسول الله ، إني أرمي بالمعراض الصيد فأصيب . قال : \" إذا رميت بالمعراض فخزق فكله ، وإن أصابه بعرضه فإنما هو وقيذ فلا تأكله \" .\nففرق بين ما أصابه بالسهم ، أو بالمزراق ونحوه بحده فأحله ، وما أصابه بعرضه فجعله وقيذا فلم يحله ، وقد أجمع الفقهاء على هذا الحكم هاهنا ، واختلفوا فيما إذا صدم الجارحة الصيد فقتله بثقله ولم يجرحه ، على قولين ، هما قولان للشافعي رحمه الله :\nأحدهما : [ أنه ] لا يحل ، كما في السهم ، والجامع أن كلا منهما ميت بغير جرح فهو وقيذ .\nوالثاني : أنه يحل ; لأنه حكم بإباحة ما صاده الكلب ، ولم يستفصل ، فدل على إباحة ما ذكرناه ; لأنه قد دخل في العموم . وقد قررت لهذه المسألة فصلا فليكتب هاهنا . .\nفصل :\nاختلف العلماء رحمهم الله تعالى ، فيما إذا أرسل كلبا على صيد فقتله بثقله ولم يجرحه ، أو صدمه ، هل يحل أم لا ؟ على قولين :\nأحدهما : أن ذلك حلال ; لعموم قوله تعالى : ( فكلوا مما أمسكن عليكم ) [ المائدة : 4 ] وكذا عمومات حديث عدي بن حاتم . وهذا قول حكاه الأصحاب عن الشافعي رحمه الله ، وصححه بعض المتأخرين [ منهم ] كالنووي والرافعي .\nقلت : وليس ذلك بظاهر من كلام الشافعي في الأم والمختصر ، فإنه قال في كلا الموضعين : \" يحتمل معنيين \" . ثم وجه كلا منهما ، فحمل ذلك الأصحاب منه فأطلقوا في المسألة قولين عنه ، اللهم إلا أنه في بحثه حكايته للقول بالحل رشحه قليلا ولم يصرح بواحد منهما ولا جزم به . والقول بذلك - أعني الحل - نقله ابن الصباغ عن أبي حنيفة ، من رواية الحسن بن زياد ، عنه ، ولم يذكر غير ذلك ، وأما أبو جعفر بن جرير فحكاه في تفسيره عن سلمان الفارسي وأبي هريرة وسعد بن أبي وقاص وابن عمر . وهذا غريب جدا ، وليس يوجد ذلك مصرحا به عنهم ، إلا أنه من تصرفه ، رحمه الله ورضي عنه .\nوالقول الثاني : أن ذلك لا يحل ، وهو أحد القولين عن الشافعي رحمه الله ، واختاره المزني ويظهر من كلام ابن الصباغ ترجيحه أيضا ، والله أعلم . ورواه أبو يوسف ومحمد عن أبي حنيفة ، وهو المشهور عن الإمام أحمد بن حنبل ، رضي الله عنه وهذا القول أشبه بالصواب ، والله أعلم ، لأنه أجرى عن القواعد الأصولية ، وأمس بالأصول الشرعية . واحتج ابن الصباغ له بحديث رافع بن خديج ، قلت : يا رسول الله ، إنا لاقو العدو غدا وليس معنا مدى أفنذبح بالقصب ؟ قال : \" ما أنهر الدم وذكر اسم الله عليه فكلوه \" . الحديث بتمامه ، وهو في الصحيحين .\nوهذا وإن كان واردا على سبب خاص ، فالعبرة بعموم اللفظ عند جمهور من العلماء في الأصول والفروع ، كما سئل عليه السلام عن البتع - وهو نبيذ العسل - فقال : \" كل شراب أسكر فهو حرام \" أفيقول فقيه : إن هذا اللفظ مخصوص بشراب العسل؟ وهكذا هذا كما سألوه عن شيء من الذكاة ، فقال لهم كلاما عاما يشمل ذاك المسئول عنه وغيره ; لأنه عليه السلام قد أوتي جوامع الكلم .\nإذا تقرر هذا فما صدمه الكلب أو غمه بثقله ، ليس مما أنهر دمه ، فلا يحل لمفهوم هذا الحديث . فإن قيل : هذا الحديث ليس من هذا القبيل بشيء ; لأنهم إنما سألوا عن الآلة التي يذكى بها ، ولم يسألوا عن الشيء الذي يذكى ; ولهذا استثنى من ذلك السن والظفر ، حيث قال : \" ليس السن والظفر ، وسأحدثكم عن ذلك : أما السن فعظم ، وأما الظفر فمدى الحبشة \" . والمستثنى يدل على جنس المستثنى منه ، وإلا لم يكن متصلا فدل على أن المسئول عنه هو الآلة ، فلا يبقى فيه دلالة لما ذكرتم .\nفالجواب عن هذا : بأن في الكلام ما يشكل عليكم أيضا ، حيث يقول : \" ما أنهر الدم وذكر اسم الله عليه فكلوه \" . ولم يقل : \" فاذبحوا به \" فهذا يؤخذ منه الحكمان معا ، يؤخذ حكم الآلة التي يذكى بها ، وحكم المذكى ، وأنه لا بد من إنهار دمه بآلة ليست سنا ولا ظفرا . هذا مسلك .\nوالمسلك الثاني : طريقة المزني وهي أن السهم جاء التصريح فيه بأنه إن قتل بعرضه فلا تأكل ، وإن خزق فكل . والكلب جاء مطلقا فيحمل على ما قيد هناك من الخزق ; لأنهما اشتركا في الموجب ، وهو الصيد ، فيجب الحمل هنا وإن اختلف السبب ، كما وجب حمل مطلق الإعتاق في الظهار على تقييده بالإيمان في القتل ، بل هذا أولى . وهذا يتوجه له على من يسلم له أصل هذه القاعدة من حيث هي ، وليس فيها خلاف بين الأصحاب قاطبة ، فلا بد لهم من جواب عن هذا . وله أن يقول : هذا قتله الكلب بثقله ، فلم يحل قياسا على ما قتله السهم بعرضه والجامع أن كلا منهما آلة للصيد ، وقد مات بثقله فيهما . ولا يعارض ذلك بعموم الآية ; لأن القياس مقدم على العموم ، كما هو مذهب الأئمة الأربعة والجمهور ، وهذا مسلك حسن أيضا .\nمسلك آخر ، وهو : أن قوله تعالى : ( فكلوا مما أمسكن عليكم ) [ المائدة : 4 ] عام فيما قتلن بجرح أو غيره ، لكن هذا المقتول على هذه الصورة المتنازع فيها لا يخلو : إما أن يكون نطيحا أو في حكمه ، أو منخنقا أو في حكمه ، وأيا ما كان فيجب تقديم [ حكم ] هذه الآية على تلك لوجوه :\nأحدها : أن الشارع قد اعتبر حكم هذه الآية حالة الصيد ، حيث يقول لعدي بن حاتم : \" وإن أصابه بعرضه فإنما هو وقيذ فلا تأكله \" . ولم نعلم أحدا من العلماء فصل بين حكم وحكم من هذه الآية ، فقال : إن الوقيذ معتبر حالة الصيد ، والنطيح ليس معتبرا ، فيكون القول بحل المتنازع فيه خرقا للإجماع لا قائل به ، وهو محظور عند كثير من العلماء .\nالثاني : أن تلك الآية : ( فكلوا مما أمسكن عليكم ) [ المائدة : 4 ] ليست على عمومها بالإجماع ، بل مخصوصة بما صدن من الحيوان المأكول ، وخرج من عموم لفظها الحيوان غير المأكول بالاتفاق ، والعموم المحفوظ مقدم على غير المحفوظ . .\nالمسلك الآخر : أن هذا الصيد - والحالة هذه - في حكم الميتة سواء ; لأنه قد احتقن فيه الدماء وما يتبعها من الرطوبات ، فلا تحل قياسا على الميتة .\nالمسلك الآخر : أن آية التحريم ، أعني قوله : ( حرمت عليكم الميتة ) إلى آخرها محكمة لم يدخلها نسخ ولا تخصيص ، وكذا ينبغي أن تكون آية التحليل محكمة ، أعني قوله : ( يسألونك ماذا أحل لهم قل أحل لكم الطيبات [ وما علمتم من الجوارح مكلبين ] ) [ المائدة : 4 ] فينبغي ألا يكون بينهما تعارض أصلا وتكون السنة جاءت لبيان ذلك ، وشاهد ذلك قصة السهم ، فإنه ذكر حكم ما دخل في هذه الآية ، وهو ما إذا خزفه المعراض فيكون حلالا ; لأنه من الطيبات ، وما دخل في حكم تلك الآية ، آية التحريم ، وهو ما إذا أصابه بعرض فلا يؤكل ; لأنه وقيذ ، فيكون أحد أفراد آية التحريم ، وهكذا يجب أن يكون حكم هذا سواء ، إن كان قد جرحه الكلب فهو داخل في حكم آية التحليل . وإن لم يجرحه بل صدمه أو قتله بثقله فهو نطيح أو في حكمه فلا يكون حلالا .\nفإن قيل : فلم لا فصل في حكم الكلب ، فقال ما ذكرتم : إن جرحه فهو حلال ، وإن لم يجرحه فهو حرام ؟\nفالجواب : أن ذلك نادر ; لأن من شأن الكلب أن يقتل بظفره أو نابه أو بهما معا ، وأما اصطدامه هو والصيد فنادر ، وكذا قتله إياه بثقله ، فلم يحتج إلى الاحتراز من ذلك لندوره ، أو لظهور حكمه عند من علم تحريم الميتة والمنخنقة والموقوذة والمتردية والنطيحة . وأما السهم والمعراض فتارة يخطئ لسوء رمي راميه أو للهواء أو نحو ذلك ، بل خطؤه أكثر من إصابته ; فلهذا ذكر كلا من حكميه مفصلا ، والله أعلم ; ولهذا لما كان الكلب من شأنه أنه قد يأكل من الصيد ، ذكر حكم ما إذا أكل من الصيد ، فقال : \" إن أكل فلا تأكل ، فإني أخاف أن يكون أمسك على نفسه \" وهذا صحيح ثابت في الصحيحين وهو أيضا مخصوص من عموم آية التحليل عند كثيرين فقالوا : لا يحل ما أكل منه الكلب ، حكي ذلك عن أبي هريرة وابن عباس . وبه قال الحسن والشعبي والنخعي . وإليه ذهب أبو حنيفة وصاحباه وأحمد بن حنبل والشافعي في المشهور عنه . وروى ابن جرير في تفسيره عن علي وسعد وسلمان وأبي هريرة وابن عمر وابن عباس : أن الصيد يؤكل وإن أكل منه الكلب ، حتى قال سعد وسلمان وأبو هريرة وابن عمر ، وغيرهم : يؤكل ولو لم يبق منه إلا بضعة . وإلى ذلك ذهب مالك والشافعي في قوله القديم ، وأومأ في الجديد إلى قولين ، قال ذلك الإمام أبو نصر ابن الصباغ وغيره من الأصحاب عنه .\nوقد روى أبو داود بإسناد جيد قوي ، عن أبي ثعلبة الخشني ، عن رسول الله صلى الله عليه وسلم أنه قال في صيد الكلب : \" إذا أرسلت كلبك وذكرت اسم الله فكل وإن أكل منه ، وكل ما ردت عليك يدك \" .\nورواه أيضا النسائي من حديث عمرو بن شعيب ، عن أبيه ، عن جده ; أن أعرابيا يقال له : أبو ثعلبة قال : يا رسول الله ، فذكر نحوه .\nوقال محمد بن جرير في تفسيره : حدثنا عمران بن بكار الكلاعي ، حدثنا عبد العزيز بن موسى - هو اللاحوني - حدثنا محمد بن دينار - هو الطاحي - عن أبي إياس - وهو معاوية بن قرة - عن سعيد بن المسيب ، عن سلمان الفارسي ، عن رسول الله صلى الله عليه وسلم قال : \" إذا أرسل الرجل كلبه على الصيد فأدركه وقد أكل منه ، فليأكل ما بقي .\nثم إن ابن جرير علله بأنه قد رواه قتادة وغيره عن سعيد بن المسيب ، عن سلمان موقوفا وأما الجمهور فقدموا حديث \" عدي \" على ذلك ، وراموا تضعيف حديث أبي ثعلبة وغيره . وقد حمله بعض العلماء على أنه إن أكل بعد ما انتظر صاحبه وطال عليه الفصل ولم يجئ ، فأكل منه لجوعه ونحوه ، فإنه لا بأس بذلك ; لأنه - والحالة هذه ; لا يخشى أنه أمسك على نفسه ، بخلاف ما إذا أكل منه أول وهلة ، فإنه يظهر منه أنه أمسك على نفسه ، والله أعلم .\nفأما الجوارح من الطير فنص الشافعي على أنها كالكلاب ، فيحرم ما أكلت منه عند الجمهور ، ولا يحرم عند الآخرين . واختار المزني من أصحابنا أنه لا يحرم أكل ما أكلت منه الطيور والجوارح ، وهو مذهب أبي حنيفة وأحمد قالوا : لأنه لا يمكن تعليمها كما يعلم الكلب بالضرب ونحوه ، وأيضا فإنها لا تعلم إلا بأكلها من الصيد ، فيعفى عن ذلك ، وأيضا فالنص إنما ورد في الكلب لا في الطير . وقال الشيخ أبو علي في \" الإفصاح \" : إذا قلنا : يحرم ما أكل منه الكلب ، ففي تحريم ما أكل منه الطير وجهان ، وأنكر القاضي أبو الطيب هذا التفريع والترتيب ، لنص الشافعي رحمه الله على التسوية بينهما ، والله سبحانه وتعالى أعلم .\nوأما ) المتردية ) فهي التي تقع من شاهق أو موضع عال فتموت بذلك ، فلا تحل .\nقال علي بن أبي طلحة ، عن ابن عباس : ( المتردية ) التي تسقط من جبل . وقال قتادة : هي التي تتردى في بئر .\nوقال السدي : هي التي تقع من جبل أو تتردى في بئر .\nوأما ) النطيحة ) فهي التي ماتت بسبب نطح غيرها لها ، فهي حرام ، وإن جرحها القرن وخرج منها الدم ولو من مذبحها .\nوالنطيحة فعيلة بمعنى مفعولة ، أي : منطوحة . وأكثر ما ترد هذه البنية في كلام العرب بدون تاء التأنيث ، فيقولون : كف خضيب ، وعين كحيل ، ولا يقولون : كف خضيبة ، ولا عين كحيلة : وأما هذه فقال بعض النحاة : إنما استعمل فيها تاء التأنيث ; لأنها أجريت مجرى الأسماء ، كما في قولهم : طريقة طويلة . وقال بعضهم : إنما أتي بتاء التأنيث فيها لتدل على التأنيث من أول وهلة ، بخلاف : عين كحيل ، وكف خضيب ; لأن التأنيث مستفاد من أول الكلام .\nوقوله : ( وما أكل السبع ) أي : ما عدا عليها أسد ، أو فهد ، أو نمر ، أو ذئب ، أو كلب ، فأكل بعضها فماتت بذلك ، فهي حرام وإن كان قد سال منها الدماء ولو من مذبحها ، فلا تحل بالإجماع . وقد كان أهل الجاهلية يأكلون ما أفضل السبع من الشاة أو البعير أو البقرة ونحو ذلك فحرم الله ذلك على المؤمنين .\nوقوله : ( إلا ما ذكيتم ) عائد على ما يمكن عوده عليه ، مما انعقد سبب موته فأمكن تداركه بذكاة ، وفيه حياة مستقرة ، وذلك إنما يعود على قوله : ( والمنخنقة والموقوذة والمتردية والنطيحة وما أكل السبع )\nوقال علي بن أبي طلحة ، عن ابن عباس في قوله : ( إلا ما ذكيتم ) يقول : إلا ما ذبحتم من هؤلاء وفيه روح ، فكلوه ، فهو ذكي . وكذا روي عن سعيد بن جبير والحسن البصري والسدي .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا حفص بن غياث حدثنا جعفر بن محمد ، عن أبيه ، عن علي قال : ( وما أكل السبع إلا ما ذكيتم ) قال : إن مصعت بذنبها أو ركضت برجلها ، أو طرفت بعينها فكل .\nوقال ابن جرير : حدثنا القاسم حدثنا الحسين حدثنا هشيم وعباد قالا : حدثنا حجاج عن حصين عن الشعبي عن الحارث عن علي قال : إذا أدركت ذكاة الموقوذة والمتردية والنطيحة ، وهي تحرك يدا أو رجلا فكلها .\nوهكذا روي عن طاوس والحسن وقتادة وعبيد بن عمير والضحاك وغير واحد : أن المذكاة متى تحركت بحركة تدل على بقاء الحياة فيها بعد الذبح ، فهي حلال . وهذا مذهب جمهور الفقهاء ، وبه قال أبو حنيفة والشافعي وأحمد بن حنبل . وقال ابن وهب : سئل مالك عن الشاة التي يخرق جوفها السبع حتى تخرج أمعاؤها ؟ فقال مالك : لا أرى أن تذكي أي شيء يذكى منها .\nوقال أشهب : سئل مالك عن الضبع يعدو على الكبش ، فيدق ظهره أترى أن يذكى قبل أن يموت ، فيؤكل ؟ قال إن كان قد بلغ السحرة ، فلا أرى أن يؤكل وإن كان أصاب أطرافه ، فلا أرى بذلك بأسا . قيل له : وثب عليه فدق ظهره ؟ فقال : لا يعجبني ، هذا لا يعيش منه . قيل له : فالذئب يعدو على الشاة فيشق بطنها ولا يشق الأمعاء ؟ فقال : إذا شق بطنها فلا أرى أن تؤكل .\nهذا مذهب مالك رحمه الله ، وظاهر الآية عام فيما استثناه مالك رحمه الله من الصور التي بلغ الحيوان فيها إلى حالة لا يعيش بعدها ، فيحتاج إلى دليل مخصص للآية ، والله أعلم .\nوفي الصحيحين : عن رافع بن خديج أنه قال : قلت : يا رسول الله ، إنا لاقو العدو غدا ، وليس معنا مدى ، أفنذبح بالقصب ؟ فقال : \" ما أنهر الدم وذكر اسم الله عليه فكلوه ، ليس السن والظفر ، وسأحدثكم عن ذلك ، أما السن فعظم ، وأما الظفر فمدى الحبشة \" .\nوفي الحديث الذي رواه الدارقطني [ عن أبي هريرة‍ ] مرفوعا ، وفيه نظر ، وروي عن عمر موقوفا ، وهو أصح \" ألا إن الذكاة في الحلق واللبة ، ولا تعجلوا الأنفس أن تزهق \" .\nوفي الحديث الذي رواه الإمام أحمد وأهل السنن ، من رواية حماد بن سلمة ، عن أبي العشراء الدارمي ، عن أبيه قال : قلت : يا رسول الله ، أما تكون الذكاة إلا من اللبة والحلق ؟ فقال : \" لو طعنت في فخذها لأجزأ عنك .\nوهو حديث صحيح ولكنه محمول على ما [ لم ] يقدر على ذبحه في الحلق واللبة .\nوقوله : ( وما ذبح على النصب ) قال مجاهد وابن جريج كانت النصب حجارة حول الكعبة قال ابن جريج : وهي ثلاثمائة وستون نصبا ، كان العرب في جاهليتها يذبحون عندها ، وينضحون ما أقبل منها إلى البيت بدماء تلك الذبائح ، ويشرحون اللحم ويضعونه على النصب .\nوكذا ذكره غير واحد ، فنهى الله المؤمنين عن هذا الصنيع ، وحرم عليهم أكل هذه الذبائح التي فعلت عند النصب حتى ولو كان يذكر عليها اسم الله في الذبح عند النصب من الشرك الذي حرمه الله ورسوله . وينبغي أن يحمل هذا على هذا ; لأنه قد تقدم تحريم ما أهل به لغير الله .\nوقوله تعالى : ( وأن تستقسموا بالأزلام ) أي : حرم عليكم أيها المؤمنون الاستقسام بالأزلام : واحدها : زلم ، وقد تفتح الزاي ، فيقال : زلم ، وقد كانت العرب في جاهليتها يتعاطون ذلك ، وهي عبارة عن قداح ثلاثة ، على أحدها مكتوب : \" أفعل \" وعلى الآخر : \" لا تفعل \" والثالث \" غفل ليس عليه شيء . ومن الناس من قال : مكتوب على الواحد : \" أمرني ربي \" وعلى الآخر : \" نهاني ربي \" . والثالث غفل ليس عليه شيء ، فإذا أجالها فطلع السهم الآمر فعله ، أو الناهي تركه ، وإن طلع الفارغ أعاد [ الاستقسام ]\nوالاستقسام : مأخوذ من طلب القسم من هذه الأزلام . هكذا قرر ذلك أبو جعفر بن جرير .\nوقال ابن أبي حاتم : حدثنا الحسن بن محمد بن الصباح ، حدثنا الحجاج بن محمد ، أخبرنا ابن جريج وعثمان بن عطاء ، عن عطاء عن ابن عباس : ( وأن تستقسموا بالأزلام ) قال : والأزلام : قداح كانوا يستقسمون بها في الأمور .\nوكذا روي عن مجاهد وإبراهيم النخعي والحسن البصري ومقاتل بن حيان .\nوقال ابن عباس : هي القداح كانوا يستقسمون بها الأمور . وذكر محمد بن إسحاق وغيره : أن أعظم أصنام قريش صنم كان يقال له : هبل ، وكان داخل الكعبة ، منصوب على بئر فيها ، توضع الهدايا وأموال الكعبة فيه ، كان عنده سبعة أزلام مكتوب فيها ما يتحاكمون فيه ، مما أشكل عليهم ، فما خرج لهم منها رجعوا إليه ولم يعدلوا عنه .\nوثبت في الصحيح : أن النبي صلى الله عليه وسلم لما دخل الكعبة وجد إبراهيم وإسماعيل مصورين فيها ، وفي أيديهما الأزلام ، فقال : \" قاتلهم الله ، لقد علموا أنهما لم يستقسما بها أبدا \"\nوفي الصحيح : أن سراقة بن مالك بن جعشم لما خرج في طلب النبي صلى الله عليه وسلم وأبي بكر ، وهما ذاهبان إلى المدينة مهاجرين ، قال : فاستقسمت بالأزلام هل أضرهم أم لا؟ فخرج الذي أكره : لا تضرهم . قال : فعصيت الأزلام وأتبعتهم ، ثم إنه استقسم بها ثانية وثالثة ، كل ذلك يخرج الذي يكره : لا تضرهم وكان كذلك وكان سراقة لم يسلم إذ ذاك ، ثم أسلم بعد ذلك .\nوروى ابن مردويه من طريق إبراهيم بن يزيد ، عن رقبة عن عبد الملك بن عمير ، عن رجاء بن حيوة ، عن أبي الدرداء قال : قال رسول الله صلى الله عليه وسلم : \" لن يلج الدرجات من تكهن أو استقسم أو رجع من سفر طائرا \" .\nوقال مجاهد في قوله : ( وأن تستقسموا بالأزلام ) قال : هي سهام العرب ، وكعاب فارس والروم كانوا يتقامرون بها .\nوهذا الذي ذكر عن مجاهد في الأزلام أنها موضوعة للقمار فيه نظر ، اللهم إلا أن يقال : إنهم كانوا يستعملونها في الاستخارة تارة ، وفي القمار أخرى ، والله أعلم . فإن الله سبحانه [ وتعالى ] قد فرق بين هذه وبين القمار وهو الميسر ، فقال في آخر السورة : ( يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون . إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء [ في الخمر والميسر ويصدكم عن ذكر الله وعن الصلاة فهل أنتم ] منتهون ) [ الآيتان : 90 ، 91 ] وهكذا قال هاهنا : ( وأن تستقسموا بالأزلام ذلكم فسق ) أي : تعاطيه فسق وغي وضلال وجهالة وشرك ، وقد أمر الله المؤمنين إذا ترددوا في أمورهم أن يستخيروه بأن يعبدوه ، ثم يسألوه الخيرة في الأمر الذي يريدونه ، كما رواه الإمام أحمد والبخاري وأهل السنن ، من طرق عن عبد الرحمن بن أبي الموالي ، عن محمد بن المنكدر ، عن جابر بن عبد الله قال : كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة كما يعلمنا السورة من القرآن ، ويقول : \" إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ، ثم ليقل : اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك ، وأسألك من فضلك العظيم ; فإنك تقدر ولا أقدر ، وتعلم ولا أعلم ، وأنت علام الغيوب ، اللهم إن كنت تعلم هذا الأمر - ويسميه باسمه - خيرا لي في ديني ومعاشي وعاقبة أمري ، فاقدره لي ويسره لي وبارك لي فيه ، اللهم إن كنت تعلمه شرا لي في ديني ومعاشي وعاقبة أمري ، فاصرفني عنه ، واصرفه عني ، واقدر لي الخير حيث كان ، ثم رضني به \" . لفظ أحمد .\nوقال الترمذي : هذا حديث حسن صحيح غريب ، لا نعرفه إلا من حديث ابن أبي الموالي .\nقوله : ( اليوم يئس الذين كفروا من دينكم ) قال علي بن أبي طلحة ، عن ابن عباس : يعني : يئسوا أن يراجعوا دينهم . .\nوكذا روي عن عطاء بن أبي رباح والسدي ومقاتل بن حيان . وعلى هذا المعنى يرد الحديث الثابت في الصحيح ، أن رسول الله صلى الله عليه وسلم قال : \" إن الشيطان قد يئس أن يعبده المصلون في جزيرة العرب ، ولكن بالتحريش بينهم \" .\nويحتمل أن يكون المراد : أنهم يئسوا من مشابهة المسلمين ، بما تميز به المسلمون من هذه الصفات المخالفة للشرك وأهله ; ولهذا قال تعالى آمرا عباده المؤمنين أن يصبروا ويثبتوا في مخالفة الكفار ، ولا يخافوا أحدا إلا الله ، فقال : ( فلا تخشوهم واخشون ) أي : لا تخافوا منهم في مخالفتكم إياهم واخشوني أنصركم عليهم وأبيدهم وأظفركم بهم ، وأشف صدوركم منهم ، وأجعلكم فوقهم في الدنيا والآخرة .\nوقوله : ( اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا ) هذه أكبر نعم الله عز وجل ، على هذه الأمة حيث أكمل تعالى لهم دينهم ، فلا يحتاجون إلى دين غيره ، ولا إلى نبي غير نبيهم ، صلوات الله وسلامه عليه ; ولهذا جعله الله خاتم الأنبياء ، وبعثه إلى الإنس والجن ، فلا حلال إلا ما أحله ، ولا حرام إلا ما حرمه ، ولا دين إلا ما شرعه ، وكل شيء أخبر به فهو حق وصدق لا كذب فيه ولا خلف ، كما قال تعالى : ( وتمت كلمت ربك صدقا وعدلا ) [ الأنعام : 115 ] أي : صدقا في الأخبار ، وعدلا في الأوامر والنواهي ، فلما أكمل الدين لهم تمت النعمة عليهم ; ولهذا قال [ تعالى ] ( اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا ) أي : فارضوه أنتم لأنفسكم ، فإنه الدين الذي رضيه الله وأحبه وبعث به أفضل رسله الكرام ، وأنزل به أشرف كتبه .\nقال علي بن أبي طلحة ، عن ابن عباس قوله : ( اليوم أكملت لكم دينكم ) وهو الإسلام ، أخبر الله نبيه صلى الله عليه وسلم والمؤمنين أنه أكمل لهم الإيمان ، فلا يحتاجون إلى زيادة أبدا ، وقد أتمه الله فلا ينقصه أبدا ، وقد رضيه الله فلا يسخطه أبدا .\nوقال أسباط عن السدي : نزلت هذه الآية يوم عرفة ، فلم ينزل بعدها حلال ولا حرام ، ورجع رسول الله صلى الله عليه وسلم فمات . قالت أسماء بنت عميس : حججت مع رسول الله صلى الله عليه وسلم تلك الحجة ، فبينما نحن نسير إذ تجلى له جبريل ، فمال رسول الله صلى الله عليه وسلم على الراحلة ، فلم تطق الراحلة من ثقل ما عليها من القرآن ، فبركت فأتيته فسجيت عليه بردا كان علي .\nقال ابن جريج وغير واحد : مات رسول الله صلى الله عليه وسلم بعد يوم عرفة بأحد وثمانين يوما .\nرواهما ابن جرير ، ثم قال : حدثنا سفيان بن وكيع ، حدثنا ابن فضيل ، عن هارون بن عنترة ، عن أبيه قال : لما نزلت ( اليوم أكملت لكم دينكم ) وذلك يوم الحج الأكبر ، بكى عمر فقال له النبي صلى الله عليه وسلم : \" ما يبكيك؟ \" قال : أبكاني أنا كنا في زيادة من ديننا ، فأما إذ أكمل فإنه لم يكمل شيء إلا نقص . فقال : \" صدقت \" .\nويشهد لهذا المعنى الحديث الثابت : \" إن الإسلام بدأ غريبا ، وسيعود غريبا ، فطوبى للغرباء \" .\nوقال الإمام أحمد : حدثنا جعفر بن عون ، حدثنا أبو العميس ، عن قيس بن مسلم ، عن طارق بن شهاب قال : جاء رجل من اليهود إلى عمر بن الخطاب [ رضي الله عنه ] فقال : يا أمير المؤمنين ، إنكم تقرءون آية في كتابكم ، لو علينا معشر اليهود نزلت لاتخذنا ذلك اليوم عيدا . قال : وأي آية؟ قال قوله : ( اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ) فقال عمر : والله إني لأعلم اليوم الذي نزلت على رسول الله صلى الله عليه وسلم ، والساعة التي نزلت فيها على رسول الله صلى الله عليه وسلم ، نزلت عشية عرفة في يوم جمعة .\nورواه البخاري عن الحسن بن الصباح عن جعفر بن عون به . ورواه أيضا مسلم والترمذي والنسائي من طرق عن قيس بن مسلم ، به ولفظ البخاري عند تفسير هذه الآية من طريق سفيان الثوري ، عن قيس عن طارق قال : قالت اليهود لعمر : إنكم تقرؤون آية ، لو نزلت فينا لاتخذناها عيدا . فقال عمر : إني لأعلم حين أنزلت ، وأين أنزلت وأين رسول الله صلى الله عليه وسلم حيث أنزلت يوم عرفة ، وأنا والله بعرفة - قال سفيان : وأشك كان يوم الجمعة أم لا ( اليوم أكملت لكم دينكم ) الآية .\nوشك سفيان رحمه الله ، إن كان في الرواية فهو تورع ، حيث شك هل أخبره شيخه بذلك أم لا؟ وإن كان شكا في كون الوقوف في حجة الوداع كان يوم جمعة ، فهذا ما إخاله يصدر عن الثوري رحمه الله ، فإن هذا أمر معلوم مقطوع به ، لم يختلف فيه أحد من أصحاب المغازي والسير ولا من الفقهاء ، وقد وردت في ذلك أحاديث متواترة لا يشك في صحتها ، والله أعلم ، وقد روي هذا الحديث من غير وجه عن عمر .\nوقال ابن جرير : حدثني يعقوب بن إبراهيم ، حدثنا ابن علية ، أخبرنا رجاء بن أبي سلمة ، أخبرنا عبادة بن نسي ، أخبرنا أميرنا إسحاق - قال أبو جعفر بن جرير : هو إسحاق بن خرشة - عن قبيصة - يعني ابن ذؤيب - قال : قال كعب : لو أن غير هذه الأمة نزلت عليهم هذه الآية ، لنظروا اليوم الذي أنزلت فيه عليهم ، فاتخذوه عيدا يجتمعون فيه . فقال عمر : أي آية يا كعب ؟ فقال : ( اليوم أكملت لكم دينكم ) فقال عمر : قد علمت اليوم الذي أنزلت فيه ، والمكان الذي أنزلت فيه ، نزلت في يوم جمعة ويوم عرفة وكلاهما بحمد الله لنا عيد .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا قبيصة حدثنا حماد بن سلمة ، عن عمار - هو مولى بني هاشم - أن ابن عباس قرأ : ( اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا ) فقال يهودي : لو نزلت هذه الآية علينا لاتخذنا يومها عيدا . فقال ابن عباس : فإنها نزلت في يوم عيدين اثنين : يوم عيد ويوم جمعة .\nوقال ابن مردويه : حدثنا أحمد بن كامل ، حدثنا موسى بن هارون ، حدثنا يحيى بن الحماني ، حدثنا قيس بن الربيع ، عن إسماعيل بن سلمان ، عن أبي عمر البزار ، عن ابن الحنفية ، عن علي [ رضي الله عنه ] قال : نزلت هذه الآية على رسول الله صلى الله عليه وسلم ، وهو قائم عشية عرفة : ( اليوم أكملت لكم دينكم )\nوقال ابن جرير : حدثنا أبو عامر إسماعيل بن عمرو السكوني ، حدثنا هشام بن عمار ، حدثنا ابن عياش ، حدثنا عمرو بن قيس السكوني : أنه سمع معاوية بن أبي سفيان على المنبر ينتزع بهذه الآية : ( اليوم أكملت لكم دينكم ) حتى ختمها ، فقال : نزلت في يوم عرفة ، في يوم جمعة .\nوروى ابن مردويه ، من طريق محمد بن إسحاق ، عن عمر بن موسى بن وجيه ، عن قتادة عن الحسن عن سمرة قال : نزلت هذه الآية : ( اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا ) يوم عرفة ورسول الله صلى الله عليه وسلم واقف على الموقف .\nفأما ما رواه ابن جرير وابن مردويه والطبراني من طريق ابن لهيعة ، عن خالد بن أبي عمران ، عن حنش بن عبد الله الصنعاني ، عن ابن عباس قال : ولد نبيكم صلى الله عليه وسلم يوم الاثنين ، [ ونبئ يوم الاثنين ] وخرج من مكة يوم الاثنين ، ودخل المدينة يوم الاثنين ، وأنزلت سورة المائدة يوم الاثنين : ( اليوم أكملت لكم دينكم ) ورفع الذكر يوم الاثنين ، فإنه أثر غريب وإسناده ضعيف .\nوقد رواه الإمام أحمد : حدثنا موسى بن داود ، حدثنا ابن لهيعة ، عن خالد بن أبي عمران ، عن حنش الصنعاني ، عن ابن عباس قال : ولد النبي صلى الله عليه وسلم يوم الاثنين ، واستنبئ يوم الاثنين ، وخرج مهاجرا من مكة إلى المدينة يوم الاثنين ، وقدم المدينة يوم الاثنين ، وتوفي يوم الاثنين ، ووضع الحجر الأسود يوم الاثنين .\nهذا لفظ أحمد ولم يذكر نزول المائدة يوم الاثنين فالله أعلم . ولعل ابن عباس أراد أنها نزلت يوم عيدين اثنين كما تقدم ، فاشتبه على الراوي ، والله أعلم .\n[ و ] قال ابن جرير : وقد قيل : ليس ذلك بيوم معلوم عند الناس ، ثم روي من طريق العوفي عن ابن عباس في قوله : ( اليوم أكملت لكم دينكم ) يقول : ليس ذلك بيوم معلوم عند الناس قال : وقد قيل : إنها نزلت على رسول الله صلى الله عليه وسلم في مسيره إلى حجة الوداع . ثم رواه من طريق أبي جعفر الرازي ، عن الربيع بن أنس .\nقلت : وقد روى ابن مردويه من طريق أبي هارون العيدي ، عن أبي سعيد الخدري ; أنها أنزلت على رسول الله صلى الله عليه وسلم يوم غدير خم حين قال لعلي : \" من كنت مولاه فعلي مولاه \" . ثم رواه عن أبي هريرة وفيه : أنه اليوم الثامن عشر من ذي الحجة ، يعني مرجعه عليه السلام من حجة الوداع .\nولا يصح هذا ولا هذا ، بل الصواب الذي لا شك فيه ولا مرية : أنها أنزلت يوم عرفة ، وكان يوم جمعة ، كما روى ذلك أمير المؤمنين عمر بن الخطاب وعلي بن أبي طالب ، وأول ملوك الإسلام معاوية بن أبي سفيان ، وترجمان القرآن عبد الله بن عباس وسمرة بن جندب ، رضي الله عنهم ، وأرسله [ عامر ] الشعبي وقتادة بن دعامة وشهر بن حوشب ، وغير واحد من الأئمة والعلماء ، واختاره ابن جرير الطبري ، رحمه الله .\nوقوله : ( فمن اضطر في مخمصة غير متجانف لإثم فإن الله غفور رحيم ) أي : فمن احتاج إلى تناول شيء من هذه المحرمات التي ذكرها تعالى لضرورة ألجأته إلى ذلك ، فله تناول ذلك ، والله غفور رحيم له ; لأنه تعالى يعلم حاجة عبده المضطر ، وافتقاره إلى ذلك ، فيتجاوز عنه ويغفر له . وفي المسند وصحيح ابن حبان ، عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : \" إن الله يحب أن تؤتى رخصته كما يكره أن تؤتى معصيته \" لفظ ابن حبان . وفي لفظ لأحمد من لم يقبل رخصة الله كان عليه من الإثم مثل جبال عرفة \" .\nولهذا قال الفقهاء : قد يكون تناول الميتة واجبا في بعض الأحيان ، وهو ما إذا خاف على مهجته التلف ولم يجد غيرها ، وقد يكون مندوبا ، و [ قد ] يكون مباحا بحسب الأحوال . واختلفوا : هل يتناول منها قدر ما يسد به الرمق ، أو له أن يشبع ، أو يشبع ويتزود؟ على أقوال ، كما هو مقرر في كتاب الأحكام . وفيما إذا وجد ميتة وطعام الغير ، أو صيدا وهو محرم : هل يتناول الميتة ، أو ذلك الصيد ويلزمه الجزاء ، أو ذلك الطعام ويضمن بدله؟ على قولين ، هما قولان للشافعي رحمه الله . وليس من شرط جواز تناول الميتة أن يمضي عليه ثلاثة أيام لا يجد طعاما ، كما قد يتوهمه كثير من العوام وغيرهم ، بل متى اضطر إلى ذلك جاز له ، وقد قال الإمام أحمد : حدثنا الوليد بن مسلم ، حدثنا الأوزاعي حدثنا حسان بن عطية ، عن أبي واقد الليثي أنهم قالوا : يا رسول الله ، إنا بأرض تصيبنا بها المخمصة ، فمتى تحل لنا بها الميتة ؟ فقال : \" إذا لم تصطبحوا ، ولم تغتبقوا ، ولم تجتفئوا بقلا فشأنكم بها \" .\nتفرد به أحمد من هذا الوجه ، وهو إسناد صحيح على شرط الصحيحين . وكذا رواه ابن جرير ، عن عبد الأعلى بن واصل ، عن محمد بن القاسم الأسدي ، عن الأوزاعي به ، لكن رواه بعضهم عن الأوزاعي عن حسان بن عطية ، عن مسلم بن يزيد ، عن أبي واقد ، به ومنهم من رواه عن الأوزاعي عن حسان عن مرثد - أو أبي مرثد - عن أبي واقد ، به ورواه ابن جرير عن هناد بن السري ، عن عيسى بن يونس ، عن حسان عن رجل قد سمي له ، فذكره . ورواه أيضا عن هناد عن ابن المبارك ، عن الأوزاعي عن حسان مرسلا .\nوقال ابن جرير : حدثني يعقوب بن إبراهيم ، حدثنا ابن علية ، عن عون قال : وجدت عند الحسن كتاب سمرة فقرأته عليه ، فكان فيه : \" ويجزى من الاضطرار غبوق أو صبوح \" .\nحدثنا أبو كريب ، حدثنا هشيم عن الخصيب بن زيد التميمي حدثنا الحسن أن رجلا سأل النبي صلى الله عليه وسلم فقال : [ إلى ] متى يحل [ لي ] الحرام؟ قال : فقال : \" إلى متى يروى أهلك من اللبن ، أو تجيء ميرتهم \" .\nحدثنا ابن حميد ، حدثنا سلمة عن ابن إسحاق ، حدثنا عمر بن عبد الله بن عروة ، عن جده عروة بن الزبير ، عن جدته ; أن رجلا من الأعراب أتى النبي صلى الله عليه وسلم يستفتيه في الذي حرم الله عليه ، والذي أحل له ، فقال النبي صلى الله عليه وسلم : \" تحل لك الطيبات ، وتحرم عليك الخبائث إلا أن تفتقر إلى طعام لا يحل لك ، فتأكل منه حتى تستغني عنه \" . فقال الرجل : وما فقري الذي يحل لي؟ وما غناي الذي يغنيني عن ذلك؟ فقال النبي صلى الله عليه وسلم : \" إذا كنت ترجو نتاجا ، فتبلغ بلحوم ماشيتك إلى نتاجك ، أو كنت ترجو غنى ، تطلبه ، فتبلغ من ذلك شيئا ، فأطعم أهلك ما بدا لك حتى تستغني عنه \" . فقال الأعرابي : ما غناي الذي أدعه إذا وجدته؟ فقال [ النبي ] صلى الله عليه وسلم : \" إذا أرويت أهلك غبوقا من الليل ، فاجتنب ما حرم الله عليك من طعام ، وأما مالك فإنه ميسور كله ، ليس فيه حرام \" .\nومعنى قوله : \" ما لم تصطبحوا \" : يعني به : الغداء ، \" وما لم تغتبقوا \" : يعني به : العشاء ، \" أو تختفئوا بقلا فشأنكم بها \" [ أي ] فكلوا منها . وقال ابن جرير : يروى هذا الحرف - يعني قوله : \" أو تختفئوا [ بقلا ] على أربعة أوجه : \" تختفئوا \" بالهمزة ، \" وتحتفيوا \" بتخفيف الياء والحاء ، \" وتحتفوا \" بتشديد [ الفاء ] وتحتفوا \" بالحاء وبالتخفيف ، ويحتمل الهمز ، كذا ذكره في التفسير .\nحديث آخر : قال أبو داود : حدثنا هارون بن عبد الله ، حدثنا الفضل بن دكين ، حدثنا عقبة بن وهب بن عقبة العامري سمعت أبي يحدث عن الفجيع العامري ; أنه أتى رسول الله صلى الله عليه وسلم فقال :\nما يحل لنا من الميتة؟ قال : \" ما طعامكم؟ \" قلنا : نغتبق ونصطبح . قال أبو نعيم : فسره لي عقبة : قدح غدوة ، وقدح عشية . قال : \" ذاك - وأبي - الجوع \" . وأحل لهم الميتة على هذه الحال .\nتفرد به أبو داود وكأنهم كانوا يصطبحون ويغتبقون شيئا لا يكفيهم ، فأحل لهم الميتة لتمام كفايتهم ، وقد يحتج به من يرى جواز الأكل منها حتى يبلغ حد الشبع ، ولا يتقيد ذلك بسد الرمق ، والله أعلم .\nحديث آخر : قال أبو داود : حدثنا موسى بن إسماعيل ، حدثنا حماد حدثنا سماك عن جابر بن سمرة ، أن رجلا نزل الحرة ومعه أهله وولده ، فقال له رجل : إن ناقة لي ضلت ، فإن وجدتها فأمسكها ، فوجدها ولم يجد صاحبها ، فمرضت فقالت امرأته : انحرها ، فأبى ، فنفقت ، فقالت له امرأته : اسلخها حتى نقدد شحمها ولحمها فنأكله . فقال : حتى أسأل رسول الله صلى الله عليه وسلم ، فأتاه فسأله ، فقال : \" هل عندك غنى يغنيك ؟ \" قال : لا . قال : \" فكلوها \" . قال : فجاء صاحبها فأخبره الخبر ، فقال : هلا كنت نحرتها ؟ قال : استحييت منك .\nتفرد به وقد يحتج به من يجوز الأكل والشبع ، والتزود منها مدة يغلب على ظنه الاحتياج إليها ، والله أعلم .\nوقوله : ( غير متجانف لإثم ) أي : [ غير ] متعاط لمعصية الله ، فإن الله قد أباح ذلك له وسكت عن الآخر ، كما قال في سورة البقرة : ( فمن اضطر غير باغ ولا عاد فلا إثم عليه إن الله غفور رحيم ) [ الآية : 173 ] .\nوقد استدل بهذه الآية من يقول بأن العاصي بسفره لا يترخص بشيء من رخص السفر ; لأن الرخص لا تنال بالمعاصي ، والله أعلم .\n                                    ",
        "qortoby": "حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٣\n                                    \n                                    \n                                    قوله : حرمت عليكم الميتة والدم ولحم الخنزير وما أهل لغير الله به والمنخنقة والموقوذة والمتردية والنطيحة وما أكل السبع إلا ما ذكيتم وما ذبح على النصب وأن تستقسموا بالأزلام ذلكم فسق اليوم يئس الذين كفروا من دينكم فلا تخشوهم واخشون اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا فمن اضطر في مخمصة غير متجانف لإثم فإن الله غفور رحيم\nفيه ست وعشرون مسألة :\nالأولى : قوله تعالى : حرمت عليكم الميتة والدم ولحم الخنزير وما أهل لغير الله به تقدم القول فيه كاملا في البقرة .\nالثانية : قوله تعالى : والمنخنقة هي التي تموت خنقا ، وهو حبس النفس سواء فعل بها ذلك آدمي أو اتفق لها ذلك في حبل أو بين عودين أو نحوه ، وذكر قتادة : أن أهل الجاهلية كانوا يخنقون الشاة وغيرها فإذا ماتت أكلوها ; وذكر نحوه ابن عباس .\nالثالثة : قوله تعالى : والموقوذة الموقوذة هي التي ترمى أو تضرب بحجر أو عصا حتى تموت من غير تذكية ; عن ابن عباس والحسن وقتادة والضحاك والسدي ; يقال منه : وقذه يقذه وقذا وهو وقيذ ، والوقذ شدة الضرب ، وفلان وقيذ أي : مثخن ضربا . قال قتادة : كان أهل الجاهلية يفعلون ذلك ويأكلونه ، وقال الضحاك : كانوا يضربون الأنعام بالخشب لآلهتهم حتى يقتلوها فيأكلوها ، ومنه المقتولة بقوس البندق ، وقال الفرزدق :\nشغارة تقذ الفصيل برجلها فطارة لقوادم الأبكار\nوفي صحيح مسلم عن عدي بن حاتم قال : قلت يا رسول الله فإني أرمي بالمعراض الصيد فأصيب ; فقال : إذا رميت بالمعراض فخزق فكله وإن أصابه بعرضه فلا تأكله وفي رواية فإنه وقيذ . قال أبو عمر : اختلف العلماء قديما وحديثا في الصيد بالبندق والحجر والمعراض ; فمن ذهب إلى أنه وقيذ لم يجزه إلا ما أدرك ذكاته ; على ما روي عن ابن عمر ، وهو قول مالك وأبي حنيفة وأصحابه والثوري والشافعي ، وخالفهم الشاميون في ذلك ; قال الأوزاعي في المعراض : كله خزق أو لم يخزق ; فقد كان أبو الدرداء وفضالة بن عبيد وعبد الله بن عمر ومكحول لا يرون به بأسا ; قال أبو عمر : هكذا ذكر الأوزاعي عن عبد الله بن عمر ، والمعروف عن ابن عمر ما ذكره مالك عن نافع عنه ، والأصل في هذا الباب والذي عليه العمل وفيه الحجة لمن لجأ إليه حديث عدي بن حاتم وفيه ( وما أصاب بعرضه فلا تأكله فإنما هو وقيذ ) .\nالرابعة : قوله تعالى : والمتردية المتردية هي التي تتردى من العلو إلى السفل فتموت ; كان ذلك من جبل أو في بئر ونحوه ; وهي متفعلة من الردى وهو الهلاك ; وسواء تردت بنفسها أو رداها غيرها ، وإذا أصاب السهم الصيد فتردى من جبل إلى الأرض حرم أيضا ; لأنه ربما مات بالصدمة والتردي لا بالسهم ; ومنه الحديث وإن وجدته غريقا في الماء فلا تأكله فإنك لا تدري الماء قتله أو سهمك أخرجه مسلم ، وكانت الجاهلية تأكل المتردي ولم تكن تعتقد ميتة إلا ما مات بالوجع ونحوه دون سبب يعرف ; فأما هذه الأسباب فكانت عندها كالذكاة ; فحصر الشرع الذكاة في صفة مخصوصة على ما يأتي بيانها ، وبقيت هذه كلها ميتة ، وهذا كله من المحكم المتفق عليه . وكذلك النطيحة وأكيلة السبع التي فات نفسها بالنطح والأكل .\nالخامسة : قوله تعالى : والنطيحة النطيحة فعيلة بمعنى مفعولة ، وهي الشاة تنطحها أخرى أو غير ذلك فتموت قبل أن تذكى ، وتأول قوم النطيحة بمعنى الناطحة ; لأن الشاتين قد تتناطحان فتموتان ، وقيل : نطيحة ولم يقل نطيح ، وحق فعيل لا يذكر فيه الهاء كما يقال : كف خضيب ولحية دهين ; لكن ذكر الهاء هاهنا لأن الهاء إنما تحذف من الفعيلة إذا كانت صفة لموصوف منطوق به ; يقال : شاة نطيح وامرأة قتيل ، فإن لم تذكر الموصوف أثبت الهاء فتقول : رأيت قتيلة بني فلان وهذه نطيحة الغنم ; لأنك لو لم تذكر الهاء فقلت : رأيت قتيل بني فلان لم يعرف أرجل هو أم امرأة . وقرأ أبو ميسرة \" والمنطوحة \" .\nالسادسة : قوله تعالى : وما أكل السبع يريد كل ما افترسه ذو ناب وأظفار من الحيوان ، كالأسد والنمر والثعلب والذئب والضبع ونحوها ، هذه كلها سباع . يقال : سبع فلان فلانا أي : عضه بسنه ، وسبعه أي : عابه ووقع فيه ، وفي الكلام إضمار ، أي : وما أكل منه السبع ; لأن ما أكله السبع فقد فني ، ومن العرب من يوقف اسم السبع على الأسد ، وكانت العرب إذا أخذ السبع شاة ثم خلصت منه أكلوها ، وكذلك إن أكل بعضها ; قاله قتادة وغيره ، وقرأ الحسن وأبو حيوة \" السبع \" بسكون الباء ، وهي لغة لأهل نجد ، وقال حسان في عتبة بن أبي لهب :\nمن يرجع العام إلى أهله فما أكيل السبع بالراجع\nوقرأ ابن مسعود : \" وأكيلة السبع \" وقرأ عبد الله بن عباس : \" وأكيل السبع \" .\nالسابعة : قوله تعالى : إلا ما ذكيتم نصب على الاستثناء المتصل ، عند الجمهور من العلماء والفقهاء ، وهو راجع على كل ما أدرك ذكاته من المذكورات وفيه حياة ; فإن الذكاة عاملة فيه ; لأن حق الاستثناء أن يكون مصروفا إلى ما تقدم من الكلام ، ولا يجعل منقطعا إلا بدليل يجب التسليم له . روى ابن عيينة وشريك وجرير عن الركين بن الربيع عن أبي طلحة الأسدي قال : سألت ابن عباس عن ذئب عدا على شاة فشق بطنها حتى انتثر قصبها فأدركت ذكاتها فذكيتها فقال : كل وما انتثر من قصبها فلا تأكل . قال إسحاق بن راهويه : السنة في الشاة على ما وصف ابن عباس ، فإنها وإن خرجت مصارينها فإنها حية بعد ، وموضع الذكاة منها سالم ; وإنما ينظر عند الذبح أحية هي أم ميتة ، ولا ينظر إلى فعل هل يعيش مثلها ؟ فكذلك المريضة ; قال إسحاق : ومن خالف هذا فقد خالف السنة من جمهور الصحابة وعامة العلماء .\nقلت : وإليه ذهب ابن حبيب وذكر عن أصحاب مالك ; وهو قول ابن وهب والأشهر من مذهب الشافعي . قال المزني : وأحفظ للشافعي قولا آخر أنها لا تؤكل إذا بلغ منها السبع أو التردي إلى ما لا حياة معه ; وهو قول المدنيين ، والمشهور من قول مالك ، وهو الذي ذكره عبد الوهاب في تلقينه ، وروي عن زيد بن ثابت ، ذكره مالك في موطئه ، وإليه ذهب إسماعيل القاضي وجماعة المالكيين البغداديين ، والاستثناء على هذا القول منقطع ; أي : حرمت عليكم هذه الأشياء لكن ما ذكيتم فهو الذي لم يحرم . قال ابن العربي : اختلف قول مالك في هذه الأشياء ; فروي عنه أنه لا يؤكل إلا ما ذكي بذكاة صحيحة ; والذي في الموطأ أنه إن كان ذبحها ونفسها يجري ، وهي تضطرب فليأكل ; وهو الصحيح من قوله الذي كتبه بيده وقرأه على الناس من كل بلد طول عمره فهو أولى من الروايات النادرة ، وقد أطلق علماؤنا على المريضة أن المذهب جواز تذكيتها ولو أشرفت على الموت إذا كانت فيها بقية حياة ; وليت شعري أي فرق بين بقية حياة من مرض ، وبقية حياة من سبع لو اتسق النظر ، وسلمت من الشبهة الفكر ، وقال أبو عمرو : قد أجمعوا في المريضة التي لا ترجى حياتها أن ذبحها ذكاة لها إذا كانت فيها الحياة في حين ذبحها ، وعلم ذلك منها بما ذكروا من حركة يدها أو رجلها أو ذنبها أو نحو ذلك ; وأجمعوا أنها إذا صارت في حال النزع ولم تحرك يدا ولا رجلا أنه لا ذكاة فيها ; وكذلك ينبغي في القياس أن يكون حكم المتردية وما ذكر معها في الآية ، والله أعلم .\nالثامنة : قوله تعالى : ذكيتم الذكاة في كلام العرب الذبح ; قاله قطرب ، وقال ابن سيده في ( المحكم ) والعرب تقول ( ذكاة الجنين ذكاة أمه ) ; قال ابن عطية : وهذا إنما هو حديث ، وذكى الحيوان ذبحه ; ومنه قول الشاعر :\nيذكيها الأسل\nقلت : الحديث الذي أشار إليه أخرجه الدارقطني من حديث أبي سعيد وأبي هريرة وعلي وعبد الله عن النبي - صلى الله عليه وسلم - قال : ذكاة الجنين ذكاة أمه ، وبه يقول جماعة أهل العلم ، إلا ما روي عن أبي حنيفة أنه قال : إذا خرج الجنين من بطن أمه ميتا لم يحل أكله ; لأن ذكاة نفس لا تكون ذكاة نفسين . قال ابن المنذر : وفي قول النبي ، صلى الله عليه وسلم : ذكاة الجنين ذكاة أمه دليل على أن الجنين غير الأم ، وهو يقول : لو أعتقت أمة حامل إن عتقه عتق أمه ; وهذا يلزمه أن ذكاته ذكاة أمه ; لأنه إذا أجاز أن يكون عتق واحد عتق اثنين جاز أن يكون ذكاة واحد ذكاة اثنين ; على أن الخبر عن النبي - صلى الله عليه وسلم - وما جاء عن أصحابه ، وما عليه جل الناس مستغنى به عن قول كل قائل ، وأجمع أهل العلم على أن الجنين إذا خرج حيا أن ذكاة أمه ليست بذكاة له ، واختلفوا إذا ذكيت الأم وفي بطنها جنين ; فقال مالك وجميع أصحابه : ذكاته ذكاة أمه إذا كان قد تم خلقه ونبت شعره ، وذلك إذا خرج ميتا أو خرج به رمق من الحياة ، غير أنه يستحب أن يذبح إن خرج يتحرك ، فإن سبقهم بنفسه أكل ، وقال ابن القاسم : ضحيت بنعجة فلما ذبحتها جعل يركض ولدها في بطنها فأمرتهم أن يتركوها حتى يموت في بطنها ، ثم أمرتهم فشقوا جوفها فأخرج منه فذبحته فسال منه دم ; فأمرت أهلي أن يشووه ، وقال عبد الله بن كعب بن مالك . كان أصحاب رسول الله - صلى الله عليه وسلم - يقولون : إذا أشعر الجنين فذكاته ذكاة أمه . قال ابن المنذر : وممن قال ذكاته ذكاة أمه ولم يذكر أشعر أو لم يشعر علي بن أبي طالب رضي الله عنه وسعيد بن المسيب والشافعي وأحمد وإسحاق . قال القاضي أبو الوليد الباجي : وقد روي عن النبي - صلى الله عليه وسلم - أنه قال : ذكاة الجنين ذكاة أمه أشعر أو لم يشعر إلا أنه حديث ضعيف ; فمذهب مالك هو الصحيح من الأقوال الذي عليه عامة فقهاء الأمصار . وبالله التوفيق .\nالتاسعة : قوله تعالى : ذكيتم الذكاة في اللغة أصلها التمام ، ومنه تمام السن ، والفرس المذكى الذي يأتي بعد تمام القروح بسنة ، وذلك تمام استكمال القوة ، ويقال : ذكى يذكي ، والعرب تقول : جري المذكيات غلاب . والذكاء حدة القلب ; وقال الشاعر هو زهير :\nيفضله إذا اجتهدوا عليه تمام السن منه والذكاء\nوالذكاء سرعة الفطنة ، والفعل منه ذكي يذكى ذكا ، والذكوة ما تذكو به النار ، وأذكيت الحرب والنار أوقدتهما ، وذكاء اسم الشمس ; وذلك أنها تذكو كالنار ، والصبح ابن ذكاء لأنه من ضوئها . فمعنى ذكيتم أدركتم ذكاته على التمام . ذكيت الذبيحة أذكيها مشتقة من التطيب ; يقال : رائحة ذكية ; فالحيوان إذا أسيل دمه فقد طيب ، لأنه يتسارع إليه التجفيف ; وفي حديث محمد بن علي رضي الله عنهما \" ذكاة الأرض يبسها \" يريد طهارتها من النجاسة ; فالذكاة في الذبيحة تطهير لها ، وإباحة لأكلها فجعل يبس الأرض بعد النجاسة تطهيرا لها وإباحة الصلاة فيها بمنزلة الذكاة للذبيحة ; وهو قول أهل العراق ، وإذا تقرر هذا فاعلم أنها في الشرع عبارة عن إنهار الدم وفري الأوداج في المذبوح ، والنحر في المنحور والعقر في غير المقدور ، مقرونا بنية القصد لله وذكره عليه ; على ما يأتي بيانه .\nالعاشرة : واختلف العلماء فيما يقع به الذكاة ; فالذي عليه الجمهور من العلماء أن كل ما أفرى الأوداج وأنهر الدم فهو من آلات الذكاة ما خلا السن والعظم ; على هذا تواترت الآثار ، وقال به فقهاء الأمصار ، والسن والظفر المنهي عنهما في التذكية هما غير المنزوعين ; لأن ذلك يصير خنقا ; وكذلك قال ابن عباس : ذلك الخنق ; فأما المنزوعان فإذا فريا الأوداج فجائز الذكاة بهما عندهم ، وقد كره قوم السن والظفر والعظم على كل حال ; منزوعة أو غير منزوعة ; منهم إبراهيم والحسن والليث بن سعد ، وروي عن الشافعي ; وحجتهم ظاهر حديث رافع بن خديج قال : قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى - في رواية - فنذكي بالليط ؟ . وفي موطأ مالك عن نافع عن رجل من الأنصار عن معاذ بن سعد أو سعد بن معاذ : أن جارية لكعب بن مالك كانت ترعى غنما له بسلع فأصيبت شاة منها فأدركتها فذكتها بحجر ، فسئل رسول الله صلى الله عليه وسلم عن ذلك فقال : لا بأس بها وكلوها ، وفي مصنف أبي داود : أنذبح بالمروة وشقة العصا ؟ قال : أعجل وأرن ما أنهر الدم وذكر اسم الله عليه فكل ليس السن والظفر وسأحدثك أما السن فعظم وأما الظفر فمدى الحبشة الحديث أخرجه مسلم ، وروي عن سعيد بن المسيب أنه قال : ما ذبح بالليطة والشطير والظرر فحل ذكي . الليطة فلقة القصبة ويمكن بها الذبح والنحر . والشطير فلقة العود ، وقد يمكن بها الذبح لأن لها جانبا دقيقا ، والظرر فلقة الحجر يمكن الذكاة بها ولا يمكن النحر ; وعكسه الشظاظ ينحر به ، لأنه كطرف السنان ولا يمكن به الذبح .\nالحادية عشرة : قال مالك وجماعة : لا تصح الذكاة إلا بقطع الحلقوم والودجين ، وقال الشافعي : يصح بقطع الحلقوم والمريء ولا يحتاج إلى الودجين ; لأنهما مجرى الطعام والشراب الذي لا يكون معهما حياة ، وهو الغرض من الموت . ومالك وغيره اعتبروا الموت على وجه يطيب معه اللحم ، ويفترق فيه الحلال - وهو اللحم - من الحرام الذي يخرج بقطع الأوداج وهو مذهب أبي حنيفة ; وعليه يدل حديث رافع بن خديج في قوله : ما أنهر الدم ، وحكى البغداديون عن مالك أنه يشترط قطع أربع : الحلقوم والودجين والمريء ; وهو قول أبي ثور ، والمشهور ما تقدم وهو قول الليث . ثم اختلف أصحابنا في قطع أحد الودجين والحلقوم هل هو ذكاة أم لا ؟ على قولين .\nالثانية عشرة : وأجمع العلماء على أن الذبح مهما كان في الحلق تحت الغلصمة فقد تمت الذكاة ; واختلف فيما إذا ذبح فوقها وجازها إلى البدن هل ذلك ذكاة أم لا ، على قولين : وقد روي عن مالك أنها لا تؤكل ; وكذلك لو ذبحها من القفا واستوفى القطع وأنهر الدم وقطع الحلقوم والودجين لم تؤكل ، وقال الشافعي : تؤكل ; لأن المقصود قد حصل ، وهذا ينبني على أصل ، وهو أن الذكاة وإن كان المقصود منها إنهار الدم ففيها ضرب من التعبد ; وقد ذبح صلى الله عليه وسلم في الحلق ونحر في اللبة وقال : إنما الذكاة في الحلق واللبة فبين محلها وعين موضعها ، وقال مبينا لفائدتها : ما أنهر الدم وذكر اسم الله عليه فكل . فإذا أهمل ذلك ولم تقع بنية ولا بشرط ولا بصفة مخصوصة زال منها حظ التعبد ، فلم تؤكل لذلك ، والله أعلم .\nالثالثة عشرة : واختلفوا فيمن رفع يده قبل تمام الذكاة ثم رجع في الفور وأكمل الذكاة ; فقيل : يجزئه ، وقيل : لا يجزئه ; والأول أصح لأنه جرحها ثم ذكاها بعد وحياتها مستجمعة فيها .\nالرابعة عشرة : ويستحب ألا يذبح إلا من ترضى حاله ، وكل من أطاقه وجاء به على سنته من ذكر أو أنثى ، بالغ أو غير بالغ جاز ذبحه إذا كان مسلما أو كتابيا ، وذبح المسلم أفضل من ذبح الكتابي ، ولا يذبح نسكا إلا مسلم ; فإن ذبح النسك كتابي فقد اختلف فيه ; ولا يجوز في تحصيل المذهب ، وقد أجازه أشهب .\nالخامسة عشرة : وما استوحش من الإنسي لم يجز في ذكاته إلا ما يجوز في ذكاة الإنسي ، في قول مالك وأصحابه وربيعة والليث بن سعد ; وكذلك المتردي في البئر لا تكون الذكاة فيه إلا فيما بين الحلق واللبة على سنة الذكاة ، وقد خالف في هاتين المسألتين بعض أهل المدينة وغيرهم ; وفي الباب حديث رافع بن خديج وقد تقدم ، وتمامه بعد قوله : ( فمدى الحبشة ) قال : وأصبنا نهب إبل وغنم فند منها بعير فرماه رجل بسهم فحبسه ; فقال رسول الله صلى الله عليه وسلم : إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شيء فافعلوا به هكذا - وفي رواية - فكلوه ، وبه قال أبو حنيفة والشافعي ; قال الشافعي : تسليط النبي صلى الله عليه وسلم على هذا الفعل دليل على أنه ذكاة ; واحتج بما رواه أبو داود والترمذي عن أبي العشراء عن أبيه قال : قلت يا رسول الله أما تكون الذكاة إلا في الحلق واللبة ؟ قال : لو طعنت في فخذها لأجزأ عنك . قال يزيد بن هارون : وهو حديث صحيح أعجب أحمد بن حنبل ورواه عن أبي داود ، وأشار على من دخل عليه من الحفاظ أن يكتبه . قال أبو داود : لا يصلح هذا إلا في المتردية والمستوحش ، وقد حمل ابن حبيب هذا الحديث على ما سقط في مهواة فلا يوصل إلى ذكاته إلا بالطعن في غير موضع الذكاة ; وهو قول انفرد به عن مالك وأصحابه . قال أبو عمر : قول الشافعي أظهر في أهل العلم ، وأنه يؤكل بما يؤكل به الوحشي ; لحديث رافع بن خديج ; وهو قول ابن عباس وابن مسعود ; ومن جهة القياس لما كان الوحشي إذا قدر عليه لم يحل إلا بما يحل به الإنسي ; لأنه صار مقدورا عليه ; فكذلك ينبغي في القياس إذا توحش أو صار في معنى الوحشي من الامتناع أن يحل بما يحل به الوحشي .\nقلت : أجاب علماؤنا عن حديث رافع بن خديج بأن قالوا : تسليط النبي صلى الله عليه وسلم إنما هو على حبسه لا على ذكاته ، وهو مقتضى الحديث وظاهره ; لقوله : ( فحبسه ) ولم يقل إن السهم قتله ; وأيضا فإنه مقدور عليه في غالب الأحوال فلا يراعى النادر منه ، وإنما يكون ذلك في الصيد ، وقد صرح الحديث بأن السهم حبسه وبعد أن صار محبوسا صار مقدورا عليه ; فلا يؤكل إلا بالذبح والنحر ، والله أعلم ، وأما حديث أبي العشراء فقد قال فيه الترمذي : \" حديث غريب لا نعرفه إلا من حديث حماد بن سلمة ، ولا نعرف لأبي العشراء عن أبيه غير هذا الحديث ، واختلفوا في اسم أبي العشراء ; فقال بعضهم : اسمه أسامة بن قهطم ، ويقال : اسمه يسار بن برز - ويقال : بلز - ويقال : اسمه عطارد نسب إلى جده \" . فهذا سند مجهول لا حجة فيه ; ولو سلمت صحته كما قال يزيد بن هارون لما كان فيه حجة ; إذ مقتضاه جواز الذكاة في أي عضو كان مطلقا في المقدور وغيره ، ولا قائل به في المقدور ; فظاهره ليس بمراد قطعا . وتأويل أبي داود وابن حبيب له غير متفق عليه ; فلا يكون فيه حجة ، والله أعلم . قال أبو عمر : وحجة مالك أنهم قد أجمعوا أنه لو لم يند الإنسي أنه لا يذكى إلا بما يذكى به المقدور عليه ، ثم اختلفوا فهو على أصله حتى يتفقوا . وهذا لا حجة فيه ; لأن إجماعهم إنما انعقد على مقدور عليه ، وهذا غير مقدور عليه .\nالسادسة عشرة : ومن تمام هذا الباب قوله عليه السلام : إن الله كتب الإحسان على كل شيء فإذا قتلتم فأحسنوا القتلة وإذا ذبحتم فأحسنوا الذبح وليحد أحدكم شفرته وليرح ذبيحته رواه مسلم عن شداد بن أوس قال : ثنتان حفظتهما عن رسول الله صلى الله عليه وسلم قال : إن الله كتب فذكره . قال علماؤنا : إحسان الذبح في البهائم الرفق بها ; فلا يصرعها بعنف ولا يجرها من موضع إلى آخر ، وإحداد الآلة ، وإحضار نية الإباحة والقربة وتوجيهها إلى القبلة ، والإجهاز ، وقطع الودجين والحلقوم ، وإراحتها وتركها إلى أن تبرد ، والاعتراف لله بالمنة ، والشكر له بالنعمة ; بأنه سخر لنا ما لو شاء لسلطه علينا ، وأباح لنا ما لو شاء لحرمه علينا . وقال ربيعة : من إحسان الذبح ألا يذبح بهيمة وأخرى تنظر إليها ; وحكي جوازه عن مالك ; والأول أحسن ، وأما حسن القتلة فعام في كل شيء من التذكية والقصاص والحدود وغيرها ، وقد روى أبو داود عن ابن عباس وأبي هريرة قالا : نهى رسول الله صلى الله عليه وسلم عن شريطة الشيطان ، زاد ابن عيسى في حديثه ( وهي التي تذبح فتقطع ولا تفرى الأوداج ثم تترك فتموت ) .\nالسابعة عشرة : قوله تعالى : وما ذبح على النصب قال ابن فارس : النصب حجر كان ينصب فيعبد وتصب عليه دماء الذبائح ، وهو النصب أيضا ، والنصائب حجارة تنصب حوالي شفير البئر فتجعل عضائد ، وغبار منتصب مرتفع ، وقيل : النصب جمع ، واحده نصاب كحمار وحمر ، وقيل : هو اسم مفرد والجمع أنصاب ; وكانت ثلاثمائة وستين حجرا ، وقرأ طلحة \" النصب \" بجزم الصاد . وروي عن ابن عمر \" النصب \" بفتح النون وجزم الصاد . الجحدري : بفتح النون والصاد جعله اسما موحدا كالجبل والجمل ، والجمع أنصاب ; كالأجمال والأجبال . قال مجاهد : هي حجارة كانت حوالي مكة يذبحون عليها . قال ابن جريج : كانت العرب تذبح بمكة وتنضح بالدم ما أقبل من البيت ، ويشرحون اللحم ويضعونه على الحجارة ; فلما جاء الإسلام قال المسلمون للنبي صلى الله عليه وسلم : نحن أحق أن نعظم هذا البيت بهذه الأفعال ، فكأنه عليه الصلاة والسلام لم يكره ذلك ; فأنزل الله تعالى : لن ينال الله لحومها ولا دماؤها ونزلت وما ذبح على النصب المعنى : والنية فيها تعظيم النصب لا أن الذبح عليها غير جائز ، وقال الأعشى :\nوذا النصب المنصوب لا تنسكنه لعافية والله ربك فاعبدا\nوقيل : على بمعنى اللام ; أي : لأجلها ; قال قطرب قال ابن زيد : ما ذبح على النصب وما أهل به لغير الله شيء واحد . قال ابن عطية : ما ذبح على النصب جزء مما أهل به لغير الله ، ولكن خص بالذكر بعد جنسه لشهرة الأمر وشرف الموضع وتعظيم النفوس له .\nالثامنة عشرة : قوله تعالى : وأن تستقسموا بالأزلام معطوف على ما قبله ، وأن في محل رفع ، أي : وحرم عليكم الاستقسام . والأزلام قداح الميسر ، واحدها زلم وزلم ; قال :\nبات يقاسيها غلام كالزلم\nوقال آخر فجمع :\nفلئن جذيمة قتلت سرواتها فنساؤها يضربن بالأزلام\nوذكر محمد بن جرير : أن ابن وكيع حدثهم عن أبيه عن شريك عن أبي حصين عن سعيد بن جبير أن الأزلام حصى بيض كانوا يضربون بها . قال محمد بن جرير : قال لنا سفيان بن وكيع : هي الشطرنج . فأما قول لبيد :\nتزل عن الثرى أزلامها\nفقالوا : أراد أظلاف البقرة الوحشية ، والأزلام للعرب ثلاثة أنواع :\nمنها الثلاثة التي كان يتخذها كل إنسان لنفسه ، على أحدها افعل ، وعلى الثاني لا تفعل ، والثالث مهمل لا شيء عليه ، فيجعلها في خريطة معه ، فإذا أراد فعل شيء أدخل يده - وهي متشابهة - فإذا خرج أحدها ائتمر وانتهى بحسب ما يخرج له ، وإن خرج القدح الذي لا شيء عليه أعاد الضرب ; وهذه هي التي ضرب بها سراقة بن مالك بن جعشم حين اتبع النبي صلى الله عليه وسلم وأبا بكر وقت الهجرة ; وإنما قيل لهذا الفعل : استقسام لأنهم كانوا يستقسمون به الرزق وما يريدون ; كما يقال : الاستسقاء في الاستدعاء للسقي . ونظير هذا الذي حرمه الله تعالى قول المنجم : لا تخرج من أجل نجم كذا ، واخرج من أجل نجم كذا ، وقال جل وعز : وما تدري نفس ماذا تكسب غدا ، وسيأتي بيان هذا مستوفى إن شاء الله .\nوالنوع الثاني : سبعة قداح كانت عند هبل في جوف الكعبة مكتوب عليها ما يدور بين الناس من النوازل ، كل قدح منها فيه كتاب ; قدح فيه العقل من أمر الديات ، وفي آخر \" منكم \" وفي آخر \" من غيركم \" ، وفي آخر \" ملصق \" ، وفي سائرها أحكام المياه وغير ذلك ، وهي التي ضرب بها عبد المطلب على بنيه إذ كان نذر نحر أحدهم إذا كملوا عشرة ; الخبر المشهور ذكره ابن إسحاق . وهذه السبعة أيضا كانت عند كل كاهن من كهان العرب وحكامهم ; على نحو ما كانت في الكعبة عند هبل .\nوالنوع الثالث : هو قداح الميسر وهي عشرة ; سبعة منها فيها حظوظ ، وثلاثة أغفال ، وكانوا يضربون بها مقامرة لهوا ولعبا ، وكان عقلاؤهم يقصدون بها إطعام المساكين والمعدم في زمن الشتاء وكلب البرد وتعذر التحرف ، وقال مجاهد : الأزلام هي كعاب فارس والروم التي يتقامرون بها ، وقال سفيان ووكيع : هي الشطرنج ; فالاستقسام بهذا كله هو طلب القسم والنصيب كما بينا ; وهو من أكل المال بالباطل ، وهو حرام ، وكل مقامرة بحمام أو بنرد أو شطرنج أو بغير ذلك من هذه الألعاب فهو استقسام بما هو في معنى الأزلام حرام كله ; وهو ضرب من التكهن والتعرض لدعوى علم الغيب . قال ابن خويز منداد : ولهذا نهى أصحابنا عن الأمور التي يفعلها المنجمون على الطرقات من السهام التي معهم ، ورقاع الفأل في أشباه ذلك ، وقال إلكيا الطبري : وإنما نهى الله عنها فيما يتعلق بأمور الغيب ; فإنه لا تدري نفس ماذا يصيبها غدا ، فليس للأزلام في تعريف المغيبات أثر ; فاستنبط بعض الجاهلين من هذا الرد على الشافعي في الإقراع بين المماليك في العتق ، ولم يعلم هذا الجاهل أن الذي قاله الشافعي بني على الأخبار الصحيحة ، وليس مما يعترض عليه بالنهي عن الاستقسام بالأزلام ; فإن العتق حكم شرعي ، يجوز أن يجعل الشرع خروج القرعة علما على إثبات حكم العتق قطعا للخصومة ، أو لمصلحة يراها ، ولا يساوي ذلك قول القائل : إذا فعلت كذا أو قلت كذا فذلك يدلك في المستقبل على أمر من الأمور ، فلا يجوز أن يجعل خروج القداح علما على شيء يتجدد في المستقبل ، ويجوز أن يجعل خروج القرعة علما على العتق قطعا ; فظهر افتراق البابين .\nالتاسعة عشرة : وليس من هذا الباب طلب الفأل ، وكان عليه الصلاة والسلام يعجبه أن يسمع يا راشد يا نجيح ; أخرجه الترمذي وقال : حديث صحيح غريب ; وإنما كان يعجبه الفأل لأنه تنشرح له النفس وتستبشر بقضاء الحاجة وبلوغ الأمل ; فيحسن الظن بالله عز وجل ، وقد قال : ( أنا عند ظن عبدي بي ) ، وكان عليه السلام يكره الطيرة ; لأنها من أعمال أهل الشرك ; ولأنها تجلب ظن السوء بالله عز وجل . قال الخطابي : الفرق بين الفأل والطيرة أن الفأل إنما هو من طريق حسن الظن بالله ، والطيرة إنما هي من طريق الاتكال على شيء سواه ، وقال الأصمعي : سألت ابن عون عن الفأل فقال : هو أن يكون مريضا فيسمع يا سالم ، أو يكون باغيا فيسمع يا واجد ; وهذا معنى حديث الترمذي ، وفي صحيح مسلم عن أبي هريرة قال : سمعت النبي صلى الله عليه وسلم يقول : لا طيرة وخيرها الفأل ، قيل : يا رسول الله وما الفأل ؟ قال : الكلمة الصالحة يسمعها أحدكم ، وسيأتي لمعنى الطيرة مزيد بيان إن شاء الله تعالى . روي عن أبي الدرداء رضي الله عنه أنه قال : إنما العلم بالتعلم والحلم بالتحلم ، ومن يتحر الخير يعطه ، ومن يتوق الشر يوقه ، وثلاثة لا ينالون الدرجات العلا ; من تكهن أو استقسم أو رجع من سفر من طيرة .\nالموفية عشرين : قوله تعالى : ذلكم فسق إشارة إلى الاستقسام بالأزلام ، والفسق الخروج ، وقد تقدم ، وقيل يرجع إلى جميع ما ذكر من الاستحلال لجميع هذه المحرمات ، وكل شيء منها فسق وخروج من الحلال إلى الحرام ، والانكفاف عن هذه المحرمات من الوفاء بالعقود ، إذ قال : أوفوا بالعقود .\nالحادية والعشرون : قوله تعالى : اليوم يئس الذين كفروا من دينكم يعني أن ترجعوا إلى دينهم كفارا . قال الضحاك : نزلت هذه الآية حين فتح مكة ; وذلك أن رسول الله صلى الله عليه وسلم فتح مكة لثمان بقين من رمضان سنة تسع ، ويقال : سنة ثمان ، ودخلها ونادى منادي رسول الله صلى الله عليه وسلم \" ألا من قال لا إله إلا الله فهو آمن ، ومن وضع السلاح فهو آمن ، ومن أغلق بابه فهو آمن \" ، وفي يئس لغتان ، يئس ييأس يأسا ، وأيس يأيس إياسا وإياسة ; قاله النضر بن شميل . فلا تخشوهم واخشوني أي : لا تخافوهم وخافوني فإني أنا القادر على نصركم .\nالثانية والعشرون : قوله تعالى : اليوم أكملت لكم دينكم وذلك أن النبي صلى الله عليه وسلم حين كان بمكة لم تكن إلا فريضة الصلاة وحدها ، فلما قدم المدينة أنزل الله الحلال والحرام إلى أن حج ; فلما حج وكمل الدين نزلت هذه الآية : اليوم أكملت لكم دينكم الآية ; على ما نبينه . روى الأئمة عن طارق بن شهاب قال : جاء رجل من اليهود إلى عمر فقال : يا أمير المؤمنين آية في كتابكم تقرءونها لو علينا أنزلت معشر اليهود لاتخذنا ذلك اليوم عيدا ; قال : وأي آية ؟ قال : اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا فقال عمر : إني لأعلم اليوم الذي أنزلت فيه والمكان الذي أنزلت فيه ; نزلت على رسول الله صلى الله عليه وسلم بعرفة في يوم جمعة . لفظ مسلم ، وعند النسائي ليلة جمعة . وروي أنها لما نزلت في يوم الحج الأكبر وقرأها رسول الله صلى الله عليه وسلم بكى عمر ; فقال له رسول الله صلى الله عليه وسلم : ما يبكيك ؟ فقال : أبكاني أنا كنا في زيادة من ديننا فأما إذ كمل فإنه لم يكمل شيء إلا نقص . فقال له النبي صلى الله عليه وسلم : صدقت ، وروى مجاهد أن هذه الآية نزلت يوم فتح مكة .\nقلت : القول الأول أصح ، أنها نزلت في يوم جمعة وكان يوم عرفة بعد العصر في حجة الوداع سنة عشر ورسول الله صلى الله عليه وسلم واقف بعرفة على ناقته العضباء ، فكاد عضد الناقة ينقد من ثقلها فبركت . واليوم قد يعبر بجزء منه عن جميعه ، وكذلك عن الشهر ببعضه ; تقول : فعلنا في شهر كذا وكذا وفي سنة كذا كذا ، ومعلوم أنك لم تستوعب الشهر ولا السنة ; وذلك مستعمل في لسان العرب والعجم ، والدين عبارة عن الشرائع التي شرع وفتح لنا ; فإنها نزلت نجوما وآخر ما نزل منها هذه الآية ، ولم ينزل بعدها حكم ، قاله ابن عباس والسدي ، وقال الجمهور : المراد معظم الفرائض والتحليل والتحريم ، قالوا : وقد نزل بعد ذلك قرآن كثير ، ونزلت آية الربا ، ونزلت آية الكلالة إلى غير ذلك ، وإنما كمل معظم الدين وأمر الحج ، إذ لم يطف معهم في هذه السنة مشرك ، ولا طاف بالبيت عريان ، ووقف الناس كلهم بعرفة ، وقيل : أكملت لكم دينكم بأن أهلكت لكم عدوكم وأظهرت دينكم على الدين كله كما تقول : قد تم لنا ما نريد إذا كفيت عدوك .\nالثالثة والعشرون : قوله تعالى : وأتممت عليكم نعمتي أي : بإكمال الشرائع والأحكام وإظهار دين الإسلام كما وعدتكم ، إذ قلت : ولأتم نعمتي عليكم وهي دخول مكة . آمنين مطمئنين وغير ذلك مما انتظمته هذه الملة الحنيفية إلى دخول الجنة في رحمة الله تعالى .\nالرابعة والعشرون : لعل قائلا يقول : قوله تعالى : اليوم أكملت لكم دينكم يدل على أن الدين كان غير كامل في وقت من الأوقات ، وذلك يوجب أن يكون جميع من مات من المهاجرين والأنصار والذين شهدوا بدرا والحديبية وبايعوا رسول الله صلى الله عليه وسلم البيعتين جميعا ، وبذلوا أنفسهم لله مع عظيم ما حل بهم من أنواع المحن ماتوا على دين ناقص ، وأن رسول الله صلى الله عليه وسلم في ذلك كان يدعو الناس إلى دين ناقص ، ومعلوم أن النقص عيب ، ودين الله تعالى قيم ، كما قال تعالى : دينا قيما فالجواب أن يقال له : لم قلت إن كل نقص فهو عيب وما دليلك عليه ؟ ثم يقال له : أرأيت نقصان الشهر هل يكون عيبا ، ونقصان صلاة المسافر أهو عيب لها ، ونقصان العمر الذي أراده الله بقوله : وما يعمر من معمر ولا ينقص من عمره أهو عيب له ، ونقصان أيام الحيض عن المعهود ، ونقصان أيام الحمل ، ونقصان المال بسرقة أو حريق أو غرق إذا لم يفتقر صاحبه ، فما أنكرت أن نقصان أجزاء الدين في الشرع قبل أن تلحق به الأجزاء الباقية في علم الله تعالى هذه ليست بشين ولا عيب ، وما أنكرت أن معنى قول الله تعالى : اليوم أكملت لكم دينكم يخرج على وجهين :\nأحدهما : أن يكون المراد بلغته أقصى الحد الذي كان له عندي فيما قضيته وقدرته ، وذلك لا يوجب أن يكون ما قبل ذلك ناقصا نقصان عيب ، لكنه يوصف بنقصان مقيد فيقال له : إنه كان ناقصا عما كان عند الله تعالى أنه ملحقه به وضامه إليه ; كالرجل يبلغه الله مائة سنة فيقال : أكمل الله عمره ; ولا يجب عن ذلك أن يكون عمره حين كان ابن ستين كان ناقصا نقص قصور وخلل ; فإن النبي صلى الله عليه وسلم كان يقول : من عمره الله ستين سنة فقد أعذر إليه في العمر . ولكنه يجوز أن يوصف بنقصان مقيد فيقال : كان ناقصا عما كان عند الله تعالى أنه مبلغه إياه ومعمره إليه . وقد بلغ الله بالظهر والعصر والعشاء أربع ركعات ; فلو قيل عند ذلك أكملها لكان الكلام صحيحا ، ولا يجب عن ذلك أنها كانت حين كانت ركعتين ناقصة نقص قصور وخلل ; ولو قيل : كانت ناقصة عما عند الله أنه ضامه إليها وزائده عليها لكان ذلك صحيحا فهكذا ، هذا في شرائع الإسلام وما كان شرع منها شيئا فشيئا إلى أن أنهى الله الدين منتهاه الذي كان له عنده ، والله أعلم .\nوالوجه الآخر : أنه أراد بقوله : اليوم أكملت لكم دينكم أنه وفقهم للحج الذي لم يكن بقي عليهم من أركان الدين غيره ، فحجوا ; فاستجمع لهم الدين أداء لأركانه وقياما بفرائضه ; فإنه يقول عليه السلام : بني الإسلام على خمس . الحديث ، وقد كانوا تشهدوا وصلوا وزكوا وصاموا وجاهدوا واعتمروا ولم يكونوا حجوا ; فلما حجوا ذلك اليوم مع النبي صلى الله عليه وسلم أنزل الله تعالى وهم بالموقف عشية عرفة اليوم أكملت لكم دينكم وأتممت عليكم نعمتي فإنما أراد أكمل وضعه لهم ; وفي ذلك دلالة على أن الطاعات كلها دين وإيمان وإسلام .\nالخامسة والعشرون : قوله تعالى : ورضيت لكم الإسلام دينا أي : أعلمتكم برضاي به لكم دينا ; فإنه تعالى لم يزل راضيا بالإسلام لنا دينا ; فلا يكون لاختصاص الرضا بذلك اليوم فائدة إن حملناه على ظاهره . و ( دينا ) نصب على التمييز ، وإن شئت على مفعول ثان ، وقيل : المعنى ورضيت عنكم إذا انقدتم لي بالدين الذي شرعته لكم ، ويحتمل أن يريد ورضيت لكم الإسلام دينا أي : ورضيت إسلامكم الذي أنتم عليه اليوم دينا باقيا بكماله إلى آخر الآية لا أنسخ منه شيئا ، والله أعلم . والإسلام في هذه الآية هو الذي في قوله تعالى : إن الدين عند الله الإسلام وهو الذي يفسر في سؤال جبريل للنبي عليهما الصلاة والسلام ، وهو الإيمان والأعمال والشعب .\nالسادسة والعشرون : قوله تعالى : فمن اضطر في مخمصة يعني من دعته ضرورة إلى أكل الميتة وسائر المحرمات في هذه الآية . والمخمصة الجوع وخلاء البطن من الطعام . والخمص ضمور البطن ، ورجل خميص وخمصان وامرأة خميصة وخمصانة ; ومنه أخمص القدم ، ويستعمل كثيرا في الجوع والغرث ; قال الأعشى :\nتبيتون في المشتى ملاء بطونكم وجاراتكم غرثى يبتن خمائصا\nأي : منطويات على الجوع قد أضمر بطونهن . وقال النابغة في خمص البطن من جهة ضمره :\nوالبطن ذو عكن خميص لين والنحر تنفجه بثدي مقعد\nوفي الحديث : خماص البطون خفاف الظهور . الخماص جمع الخميص البطن ، وهو الضامر . أخبر أنهم أعفاء عن أموال الناس ; ومنه الحديث : إن الطير تغدو خماصا وتروح بطانا ، والخميصة أيضا ثوب ; قال الأصمعي : الخمائص ثياب خز أو صوف معلمة ، وهي سوداء ، كانت من لباس الناس ، وقد تقدم معنى الاضطرار وحكمه في البقرة .\nالسابعة والعشرون : قوله تعالى : غير متجانف لإثم أي : غير مائل لحرام ، وهو بمعنى غير باغ ولا عاد وقد تقدم . والجنف الميل ، والإثم الحرام ; ومنه قول عمر رضي الله عنه : ما تجانفنا فيه لإثم ; أي : ما ملنا ولا تعمدنا ونحن نعلمه : وكل مائل فهو متجانف وجنف . وقرأ النخعي ويحيى بن وثاب والسلمي \" متجنف \" دون ألف ، وهو أبلغ في المعنى ، لأن شد العين يقتضي مبالغة وتوغلا في المعنى وثبوتا لحكمه ; وتفاعل إنما هو محاكاة الشيء والتقرب منه ; ألا تراك أنك إذا قلت : تمايل الغصن فإن ذلك يقتضي تأودا ومقاربة ميل ، وإذا قلت : تميل فقد ثبت حكم الميل ، وكذلك تصاون الرجل وتصون ، وتعاقل وتعقل ; فالمعنى غير متعمد لمعصية في مقصده ; قاله قتادة والشافعي . فإن الله غفور رحيم أي : فإن الله له غفور رحيم فحذف ، وأنشد سيبويه [ الرجز لأبي النجم العجلي ] :\nقد أصبحت أم الخيار تدعي علي ذنبا كله لم أصنع\nأراد لم أصنعه فحذف ، والله أعلم .\n                                    ",
        "saadi": "حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٣\n                                        \n                                        \n                                        \nهذا الذي حولنا الله عليه في قوله: { إِلَّا مَا يُتْلَى عَلَيْكُمْ ْ} واعلم أن الله تبارك وتعالى لا يحرّم ما يحرّم إلا صيانة لعباده، وحماية لهم من الضرر الموجود في المحرمات، وقد يبين للعباد ذلك وقد لا يبين. فأخبر أنه حرم { الْمَيْتَة ْ} والمراد بالميتة: ما فُقِدَت حياتُهُ بغير ذكاة شرعية، فإنها تحرم لضررها، وهو احتقان الدم في جوفها ولحمها المضر بآكلها. وكثيرا ما تموت بعلة تكون سببا لهلاكها، فتضر بالآكل. ويستثنى من ذلك ميتة الجراد والسمك، فإنه حلال. { وَالدَّمَ ْ} أي: المسفوح، كما قيد في الآية الأخرى. { وَلَحْم الْخِنْزِيرِ ْ} وذلك شامل لجميع أجزائه، وإنما نص الله عليه من بين سائر الخبائث من السباع، لأن طائفة من أهل الكتاب من النصارى يزعمون أن الله أحله لهم. أي: فلا تغتروا بهم، بل هو محرم من جملة الخبائث. { وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ ْ} أي: ذُكر عليه اسم غير الله تعالى، من الأصنام والأولياء والكواكب وغير ذلك من المخلوقين. فكما أن ذكر الله تعالى يطيب الذبيحة، فذكر اسم غيره عليها، يفيدها خبثا معنويا، لأنه شرك بالله تعالى. { وَالْمُنْخَنِقَةُ ْ} أي: الميتة بخنق، بيد أو حبل، أو إدخالها رأسها بشيء ضيق، فتعجز عن إخراجه حتى تموت. { وَالْمَوْقُوذَةُ ْ} أي: الميتة بسبب الضرب بعصا أو حصى أو خشبة، أو هدم شيء عليها، بقصد أو بغير قصد. { وَالْمُتَرَدِّيَةُ ْ} أي: الساقطة من علو، كجبل أو جدار أو سطح ونحوه، فتموت بذلك. { وَالنَّطِيحَةُ ْ} وهي التي تنطحها غيرها فتموت. { وَمَا أَكَلَ السَّبُعُ ْ} من ذئب أو أسد أو نمر، أو من الطيور التي تفترس الصيود، فإنها إذا ماتت بسبب أكل السبع، فإنها لا تحل. وقوله: { إِلَّا مَا ذَكَّيْتُمْ ْ} راجع لهذه المسائل، من منخنقة، وموقوذة، ومتردية، ونطيحة، وأكيلة سبع، إذا ذكيت وفيها حياة مستقرة لتتحقق الذكاة فيها، ولهذا قال الفقهاء: { لو أبان السبع أو غيره حشوتها، أو قطع حلقومها، كان وجود حياتها كعدمه، لعدم فائدة الذكاة فيها ْ} [وبعضهم لم يعتبر فيها إلا وجود الحياة فإذا ذكاها وفيها حياة حلت ولو كانت مبانة الحشوة وهو ظاهر الآية الكريمة] { وَأَن تَسْتَقْسِمُوا بِالْأَزْلَامِ ْ} أي: وحرم عليكم الاستقسام بالأزلام. ومعنى الاستقسام: طلب ما يقسم لكم ويقدر بها، وهي قداح ثلاثة كانت تستعمل في الجاهلية، مكتوب على أحدها \"افعل\" وعلى الثاني \"لا تفعل\" والثالث غفل لا كتابة فيه. فإذا هَمَّ أحدهم بسفر أو عرس أو نحوهما، أجال تلك القداح المتساوية في الجرم، ثم أخرج واحدا منها، فإن خرج المكتوب عليه \"افعل\" مضى في أمره، وإن ظهر المكتوب عليه \"لا تفعل\" لم يفعل ولم يمض في شأنه، وإن ظهر الآخر الذي لا شيء عليه، أعادها حتى يخرج أحد القدحين فيعمل به. فحرمه الله عليهم، الذي في هذه الصورة وما يشبهه, وعوضهم عنه بالاستخارة لربهم في جميع أمورهم. { ذَلِكُمْ فِسْقٌ ْ} الإشارة لكل ما تقدم من المحرمات، التي حرمها الله صيانة لعباده، وأنها فسق، أي: خروج عن طاعته إلى طاعة الشيطان. ثم امتن على عباده بقوله: { الْيَوْمَ يَئِسَ الَّذِينَ كَفَرُوا مِن دِينِكُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا فَمَنِ اضْطُرَّ فِي مَخْمَصَة غَيْرَ مُتَجَانِفٍ لِّإِثْمٍ فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ْ} واليوم المشار إليه يوم عرفة، إذ أتم الله دينه، ونصر عبده ورسوله، وانخذل أهل الشرك انخذالا بليغا، بعد ما كانوا حريصين على رد المؤمنين عن دينهم، طامعين في ذلك. فلما رأوا عز الإسلام وانتصاره وظهوره، يئسوا كل اليأس من المؤمنين، أن يرجعوا إلى دينهم، وصاروا يخافون منهم ويخشون، ولهذا في هذه السنة التي حج فيها النبي صلى الله عليه وسلم سنة عشر حجة الوداع - لم يحج فيها مشرك، ولم يطف بالبيت عريان. ولهذا قال: { فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ ْ} أي: فلا تخشوا المشركين، واخشوا الله الذي نصركم عليهم وخذلهم، ورد كيدهم في نحورهم. { الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ ْ} بتمام النصر، وتكميل الشرائع الظاهرة والباطنة، الأصول والفروع، ولهذا كان الكتاب والسنة كافيين كل الكفاية، في أحكام الدين أصوله وفروعه. فكل متكلف يزعم أنه لا بد للناس في معرفة عقائدهم وأحكامهم إلى علوم غير علم الكتاب والسنة، من علم الكلام وغيره، فهو جاهل، مبطل في دعواه، قد زعم أن الدين لا يكمل إلا بما قاله ودعا إليه، وهذا من أعظم الظلم والتجهيل لله ولرسوله. { وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي ْ} الظاهرة والباطنة { وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا ْ} أي: اخترته واصطفيته لكم دينا، كما ارتضيتكم له، فقوموا به شكرا لربكم، واحمدوا الذي مَنَّ عليكم بأفضل الأديان وأشرفها وأكملها. { فَمَنِ اضْطُرَّ ْ} أي: ألجأته الضرورة إلى أكل شيء من المحرمات السابقة، في قوله: { حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ ْ} { فِي مَخْمَصَةٍ ْ} أي: مجاعة { غَيْرَ مُتَجَانِفٍ ْ} أي: مائل { لِإِثْمٍ ْ} بأن لا يأكل حتى يضطر، ولا يزيد في الأكل على كفايته { فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ْ} حيث أباح له الأكل في هذه الحال، ورحمه بما يقيم به بنيته من غير نقص يلحقه في دينه.\n                                    "
      },
      "originalText": "حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٣"
    },
    {
      "number": 673,
      "text": "يَسْأَلُونَكَ مَاذَا أُحِلَّ لَهُمْ ۖ قُلْ أُحِلَّ لَكُمُ الطَّيِّبَاتُ ۙ وَمَا عَلَّمْتُمْ مِنَ الْجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ اللَّهُ ۖ فَكُلُوا مِمَّا أَمْسَكْنَ عَلَيْكُمْ وَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهِ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 4,
      "juz": 6,
      "manzil": 2,
      "page": 107,
      "ruku": 86,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَسۡ‍َٔلُونَكَ مَاذَآ أُحِلَّ لَهُمۡۖ قُلۡ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُ وَمَا عَلَّمۡتُم مِّنَ ٱلۡجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُۖ فَكُلُواْ مِمَّآ أَمۡسَكۡنَ عَلَيۡكُمۡ وَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهِۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ٤\n                                    \n                                    \n                                    لما ذكر تعالى ما حرمه في الآية المتقدمة من الخبائث الضارة لمتناولها ، إما في بدنه ، أو في دينه ، أو فيهما ، واستثنى ما استثناه في حالة الضرورة ، كما قال : ( وقد فصل لكم ما حرم عليكم إلا ما اضطررتم إليه ) [ الأنعام : 119 ] قال بعدها : ( يسألونك ماذا أحل لهم قل أحل لكم الطيبات ) كما [ قال ] في سورة الأعراف في صفة محمد صلى الله عليه وسلم : أنه ( يحل لهم الطيبات ويحرم عليهم الخبائث ) [ الآية : 157 ] .\nقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا يحيى بن عبد الله بن بكير ، حدثني عبد الله بن لهيعة ، حدثني عطاء بن دينار ، عن سعيد بن جبير ، عن عدي بن حاتم وزيد بن المهلهل الطائيين سألا رسول الله صلى الله عليه وسلم ، فقالا : يا رسول الله ، قد حرم الله الميتة ، فماذا يحل لنا منها ؟ فنزلت : ( يسألونك ماذا أحل لهم قل أحل لكم الطيبات ) قال سعيد [ بن جبير ] يعني : الذبائح الحلال الطيبة لهم . وقال مقاتل [ بن حيان ] [ في قوله : ( قل أحل لكم الطيبات ) ] فالطيبات ما أحل لهم من كل شيء أن يصيبوه وهو الحلال من الرزق . وقد سئل الزهري عن شرب البول للتداوي فقال : ليس هو من الطيبات .\nرواه ابن أبي حاتم وقال ابن وهب : سئل مالك عن بيع الطين الذي يأكله الناس . فقال : ليس هو من الطيبات .\nوقوله تعالى : ( وما علمتم من الجوارح مكلبين ) أي : أحل لكم الذبائح التي ذكر اسم الله عليها والطيبات من الرزق ، وأحل لكم ما اصطدتموه بالجوارح ، وهي من الكلاب والفهود والصقور وأشباه ذلك ، كما هو مذهب الجمهور من الصحابة والتابعين والأئمة ، وممن قال ذلك : علي بن أبي طلحة ، عن ابن عباس في قوله : ( وما علمتم من الجوارح مكلبين ) وهن الكلاب المعلمة ، والبازي ، وكل طير يعلم للصيد . والجوارح : يعني الكلاب الضواري والفهود والصقور وأشباهها .\nرواه ابن أبى حاتم ، ثم قال : وروي عن خيثمة وطاوس ومجاهد ومكحول ويحيى بن أبي كثير ، نحو ذلك . وروي عن الحسن أنه قال : الباز والصقر من الجوارح . وروي عن علي بن الحسين مثله . ثم روي عن مجاهد أنه كره صيد الطير كله ، وقرأ قول الله [ عز وجل ] ( وما علمتم من الجوارح مكلبين ) قال : وروي عن سعيد بن جبير نحو ذلك .\nونقله ابن جرير عن الضحاك والسدي ، ثم قال : حدثنا هناد حدثنا ابن أبي زائدة ، أخبرنا ابن جريج ، عن نافع عن ابن عمر قال : أما ما صاد من الطير البزاة وغيرها من الطير ، فما أدركت فهو لك ، وإلا فلا تطعمه .\nقلت : والمحكي عن الجمهور أن صيد الطيور كصيد الكلاب ; لأنها تكلب الصيد بمخالبها كما تكلبه الكلاب ، فلا فرق . وهذا مذهب الأئمة الأربعة وغيرهم ، واختاره ابن جرير ، واحتج في ذلك بما رواه عن هناد حدثنا عيسى بن يونس ، عن مجالد عن الشعبي عن عدي بن حاتم قال : سألت رسول الله صلى الله عليه وسلم عن صيد البازي ، فقال : \" ما أمسك عليك فكل \" .\nواستثنى الإمام أحمد صيد الكلب الأسود ; لأنه عنده مما يجب قتله ولا يحل اقتناؤه ; لما ثبت في صحيح مسلم عن أبي ذر ; أن رسول الله صلى الله عليه وسلم قال : \" يقطع الصلاة الحمار والمرأة والكلب الأسود \" فقلت : ما بال الكلب الأسود من الأحمر ؟ فقال : \" الكلب الأسود شيطان \" وفي الحديث الآخر : أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ، ثم قال : \" ما بالهم وبال الكلاب ، اقتلوا منها كل أسود بهيم \" .\nوسميت هذه الحيوانات التي يصطاد بهن : جوارح ، من الجرح ، وهو : الكسب . كما تقول العرب : فلان جرح أهله خيرا ، أي : كسبهم خيرا . ويقولون : فلان لا جارح له ، أي : لا كاسب له ، وقال الله تعالى : ( وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار ) [ الأنعام : 60 ] أي : ما كسبتم من خير وشر .\nوقد ذكر في سبب نزول هذه الآية الكريمة الحديث الذي رواه ابن أبي حاتم : حدثنا حجاج بن حمزة ، حدثنا زيد بن الحباب ، حدثني موسى بن عبيدة ، حدثني أبان بن صالح ، عن القعقاع بن حكيم ، عن سلمى أم رافع ، عن أبي رافع مولى رسول الله صلى الله عليه وسلم ; أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ، فقتلت ، فجاء الناس فقالوا : يا رسول الله ، ما يحل لنا من هذه الأمة التي أمرت بقتلها؟ قال : فسكت ، فأنزل الله : ( يسألونك ماذا أحل لهم قل أحل لكم الطيبات وما علمتم من الجوارح مكلبين ) الآية . فقال رسول الله صلى الله عليه وسلم : \" إذا أرسل الرجل كلبه وسمى ، فأمسك عليه ، فليأكل ما لم يأكل \" .\nوهكذا رواه ابن جرير ، عن أبي كريب ، عن زيد بن الحباب بإسناده ، عن أبي رافع قال : جاء جبريل إلى النبي صلى الله عليه وسلم ليستأذن عليه ، فأذن له فقال : قد أذنا لك يا رسول الله . قال : أجل ، ولكنا لا ندخل بيتا فيه كلب ، قال أبو رافع : فأمرني أن أقتل كل كلب بالمدينة ، فقتلت ، حتى انتهيت إلى امرأة عندها كلب ينبح عليها ، فتركته رحمة لها ، ثم جئت إلى رسول الله صلى الله عليه وسلم فأخبرته فأمرني ، فرجعت إلى الكلب فقتلته ، فجاءوا فقالوا : يا رسول الله ، ما يحل لنا من هذه الأمة التي أمرت بقتلها؟ قال : فسكت رسول الله صلى الله عليه وسلم ، قال : فأنزل الله عز وجل : ( يسألونك ماذا أحل لهم قل أحل لكم الطيبات وما علمتم من الجوارح مكلبين )\nورواه الحاكم في مستدركه من طريق محمد بن إسحاق ، عن أبان بن صالح به . وقال : صحيح ولم يخرجاه .\nوقال ابن جرير : حدثنا القاسم حدثنا الحسين حدثنا حجاج عن ابن جريج ، عن عكرمة أن رسول الله صلى الله عليه وسلم بعث أبا رافع في قتل الكلاب ، حتى بلغ العوالي فدخل عاصم بن عدي وسعد بن خيثمة وعويم بن ساعدة ، فقالوا : ماذا أحل لنا يا رسول الله؟ فنزلت : ( يسألونك ماذا أحل لهم قل أحل لكم الطيبات وما علمتم من الجوارح مكلبين ) [ الآية ]\nورواه الحاكم من طريق سماك عن عكرمة وهكذا قال محمد بن كعب القرظي في سبب نزول هذه الآية : إنه في قتل الكلاب .\nوقوله تعالى : ( مكلبين ) يحتمل أن يكون حالا من الضمير في ( علمتم ) فيكون حالا من الفاعل ، ويحتمل أن يكون حالا من المفعول وهو ( الجوارح ) أي : وما علمتم من الجوارح في حال كونهن مكلبات للصيد ، وذلك أن تقتنصه [ الجوارح ] بمخالبها أو أظفارها ، فيستدل بذلك - والحالة هذه - على أن الجارحة إذا قتل الصيد بصدمته أو بمخلابه وظفره أنه لا يحل ، كما هو أحد قولي الشافعي وطائفة من العلماء ; ولهذا قال : ( تعلمونهن مما علمكم الله ) وهو أنه إذا أرسله استرسل ، وإذا أشلاه استشلى وإذا أخذ الصيد أمسكه على صاحبه حتى يجيء إليه ولا يمسكه لنفسه ; ولهذا قال تعالى : ( فكلوا مما أمسكن عليكم واذكروا اسم الله عليه ) فمتى كان الجارحة معلما وأمسك على صاحبه ، وكان قد ذكر اسم الله عند إرساله حل الصيد ، وإن قتله بالإجماع .\nوقد وردت السنة بمثل ما دلت عليه هذه الآية الكريمة ، كما ثبت في الصحيحين عن عدي بن حاتم قال : قلت : يا رسول الله ، إني أرسل الكلاب المعلمة وأذكر اسم الله . فقال : \" إذا أرسلت كلبك المعلم وذكرت اسم الله ، فكل ما أمسك عليك \" . قلت : وإن قتلن؟ قال : \" وإن قتلن ما لم يشركها كلب ليس منها ، فإنك إنما سميت على كلبك ولم تسم على غيره \" . قلت له : فإني أرمي بالمعراض الصيد فأصيب؟ فقال : \" إذا رميت بالمعراض فخزق فكله ، وإن أصابه بعرض فإنه وقيذ ، فلا تأكله \" . وفي لفظ لهما : \" إذا أرسلت كلبك فاذكر اسم الله ، فإن أمسك عليك فأدركته حيا فاذبحه ، وإن أدركته قد قتل ولم يأكل منه فكله ، فإن أخذ الكلب ذكاته \" . وفي رواية لهما : \" فإن أكل فلا تأكل ، فإني أخاف أن يكون أمسك على نفسه \" فهذا دليل للجمهور وهو الصحيح من مذهب الشافعي وهو أنه إذا أكل الكلب من الصيد يحرم مطلقا ، ولم يستفصلوا كما ورد بذلك الحديث . وحكي عن طائفة من السلف أنهم قالوا : لا يحرم مطلقا .\nذكر الآثار بذلك :\nقال ابن جرير : حدثنا هناد حدثنا وكيع عن شعبة عن قتادة عن سعيد بن المسيب قال : قال سلمان الفارسي : كل وإن أكل ثلثيه - يعني الصيد - إذا أكل منه الكلب . وكذا رواه سعيد بن أبي عروبة وعمر بن عامر ، عن قتادة . وكذا رواه محمد بن زيد ، عن سعيد بن المسيب ، عن سلمان .\nورواه ابن جرير أيضا عن مجاهد بن موسى ، عن يزيد عن بكر بن عبد الله المزني والقاسم أن سلمان قال : إذا أكل الكلب فكل ، وإن أكل ثلثيه .\nوقال ابن جرير : حدثنا يونس بن عبد الأعلى ، أخبرنا ابن وهب ، أخبرني مخرمة بن بكير عن أبيه ، عن حميد بن مالك بن خثيم الدؤلي ; أنه سأل سعد بن أبي وقاص عن الصيد يأكل منه الكلب ، فقال : كل ، وإن لم يبق منه إلا حذية - يعني : [ إلا ] بضعة .\nورواه شعبة عن عبد ربه بن سعيد عن بكير بن الأشج عن سعيد بن المسيب عن سعد بن أبي وقاص قال : كل وإن أكل ثلثيه .\nوقال ابن جرير : حدثنا ابن المثنى حدثنا عبد الأعلى ، حدثنا داود عن عامر عن أبي هريرة قال : لو أرسلت كلبك فأكل منه ، فإن أكل ثلثيه وبقي ثلثه فكل .\nوقال ابن جرير : حدثنا محمد بن عبد الأعلى ، حدثنا المعتمر قال : سمعت عبيد الله وحدثنا هناد حدثنا عبدة عن عبيد الله بن عمر - عن نافع عن عبد الله بن عمر قال : إذا أرسلت كلبك المعلم وذكرت اسم الله فكل ما أمسك عليك ، أكل أو لم يأكل .\nوكذا رواه عبيد الله بن عمر وابن أبي ذئب وغير واحد ، عن نافع .\nفهذه الآثار ثابتة عن سلمان وسعد بن أبي وقاص وأبي هريرة وابن عمر . وهو محكي عن علي وابن عباس . واختلف فيه عن عطاء والحسن البصري . وهو قول الزهري وربيعة ومالك . وإليه ذهب الشافعي في القديم ، وأومأ إليه في الجديد .\nوقد روي من طريق سلمان الفارسي مرفوعا ، فقال ابن جرير : حدثنا عمران بن بكار الكلاعي ، حدثنا عبد العزيز بن موسى اللاحوني ، حدثنا محمد بن دينار - هو الطاحي - عن أبي إياس معاوية بن قرة ، عن سعيد بن المسيب ، عن سلمان الفارسي ، عن رسول الله صلى الله عليه وسلم قال : \" إذا أرسل الرجل كلبه على الصيد فأدركه ، وقد أكل منه ، فليأكل ما بقي \" .\nثم قال ابن جرير : وفي إسناد هذا الحديث نظر وسعيد غير معلوم له سماع من سلمان والثقات يروونه من كلام سلمان غير مرفوع .\nوهذا الذي قاله ابن جرير صحيح ، لكن قد روي هذا المعنى مرفوعا من وجوه أخر ، فقال أبو داود : حدثنا محمد بن منهال الضرير ، حدثنا يزيد بن زريع ، حدثنا حبيب المعلم ، عن عمرو بن شعيب ، عن أبيه ، عن جده ; أن أعرابيا - يقال له : أبو ثعلبة - قال : يا رسول الله ، إن لي كلابا مكلبة ، فأفتني في صيدها . فقال النبي صلى الله عليه وسلم : \" إن كان لك كلاب مكلبة ، فكل مما أمسكن عليك \" . فقال : ذكيا وغير ذكي ؟ قال : \" نعم \" . قال : وإن أكل منه؟ قال : \" نعم ، وإن أكل منه \" . قال : يا رسول الله ، أفتني في قوسي . فقال : \" كل ما ردت عليك قوسك \" قال : ذكيا وغير ذكي؟ قال : \" وإن تغيب عنك ما لم يصل ، أو تجد فيه أثر غير سهمك \" . قال : أفتني في آنية المجوس إذا اضطررنا إليها . قال : \" اغسلها وكل فيها \" . .\nهكذا رواه أبو داود وقد أخرجه النسائي . وكذا رواه أبو داود من طريق بسر بن عبيد الله عن أبي إدريس الخولاني ، عن أبي ثعلبة قال : قال رسول الله صلى الله عليه وسلم : \" إذا أرسلت كلبك وذكرت اسم الله فكل ، وإن أكل منه ، وكل ما ردت عليك يدك \"\nوهذان إسنادان جيدان ، وقد روى الثوري عن سماك بن حرب ، عن عدي قال : قال رسول الله صلى الله عليه وسلم : \" ما كان من كلب ضار أمسك عليك ، فكل \" . قلت : وإن أكل؟ قال : \" نعم \" .\nوروى عبد الملك بن حبيب : حدثنا أسد بن موسى ، عن ابن أبي زائدة ، عن الشعبي عن عدي مثله .\nفهذه آثار دالة على أنه يغتفر إن أكل منه الكلب . وقد احتج بها من لم يحرم الصيد بأكل الكلب وما أشبهه ، كما تقدم عمن حكيناه عنهم ، وقد توسط آخرون فقالوا : إن أكل عقب ما أمسكه فإنه يحرم لحديث عدي بن حاتم . وللعلة التي أشار إليها النبي صلى الله عليه وسلم : \" فإن أكل فلا تأكل ، فإني أخاف أن يكون أمسك على نفسه \" وأما إن أمسكه ثم انتظر صاحبه فطال عليه وجاع فأكل من الصيد لجوعه ، فإنه لا يؤثر في التحريم . وحملوا على ذلك حديث أبي ثعلبة الخشني ، وهذا تفريق حسن ، وجمع بين الحديثين صحيح . وقد تمنى الأستاذ أبو المعالي الجويني في كتابه \" النهاية \" أن لو فصل مفصل هذا التفصيل ، وقد حقق الله أمنيته ، وقال بهذا القول والتفريق طائفة من الأصحاب منهم ، وقال آخرون قولا رابعا في المسألة ، وهو التفرقة بين أكل الكلب فيحرم لحديث عدي وبين أكل الصقور ونحوها فلا يحرم ; لأنه لا يقبل التعليم إلا بالأكل .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا أسباط بن محمد ، حدثنا أبو إسحاق الشيباني ، عن حماد عن إبراهيم عن ابن عباس ; أنه قال في الطير : إذا أرسلته فقتل فكل ، فإن الكلب إذا ضربته لم يعد ، وإن تعلم الطير أن يرجع إلى صاحبه وليس يضرب ، فإذا أكل من الصيد ونتف الريش فكل .\nوكذا قال إبراهيم النخعي والشعبي وحماد بن أبي سليمان .\nوقد يحتج لهؤلاء بما رواه ابن أبي حاتم : حدثنا أبو سعيد ، حدثنا المحاربي حدثنا مجالد عن الشعبي عن عدي بن حاتم قال : قلت : يا رسول الله ، إنا قوم نصيد بالكلاب والبزاة ، فما يحل لنا منها؟ قال : \" يحل لكم ما علمتم من الجوارح مكلبين تعلمونهن مما علمكم الله ، فكلوا مما أمسكن عليكم ، واذكروا اسم الله عليه \" ثم قال : \" ما أرسلت من كلب وذكرت اسم الله عليه ، فكل مما أمسك عليك \" . قلت : وإن قتل؟ قال : \" وإن قتل ، ما لم يأكل \" . قلت : يا رسول الله ، وإن خالطت كلابنا كلابا غيرها؟ قال : فلا تأكل حتى تعلم أن كلبك هو الذي أمسك \" . قال : قلت : إنا قوم نرمي ، فما يحل لنا؟ قال : \" ما ذكرت اسم الله عليه وخزقت فكل \" .\nفوجه الدلالة لهم أنه اشترط في الكلب ألا يأكل ، ولم يشترط ذلك في البزاة ، فدل على التفرقة بينهما في الحكم ، والله أعلم .\nوقوله : ( فكلوا مما أمسكن عليكم واذكروا اسم الله عليه ) أي : عند الإرسال ، كما قال النبي صلى الله عليه وسلم لعدي بن حاتم : \" إذا أرسلت كلبك المعلم وذكرت اسم الله ، فكل ما أمسك عليك \" . وفي حديث أبي ثعلبة المخرج في الصحيحين أيضا : \" إذا أرسلت كلبك ، فاذكر اسم الله ، وإذا رميت بسهمك فاذكر اسم الله \" ; ولهذا اشترط من اشترط من الأئمة كأحمد [ بن حنبل ] - في المشهور عنه - التسمية عند إرسال الكلب والرمي بالسهم لهذه الآية وهذا الحديث ، وهذا القول هو المشهور عن الجمهور ، أن المراد بهذه الآية الأمر بالتسمية عند الإرسال ، كما قال السدي وغير واحد .\nوقال علي بن أبي طلحة ، عن ابن عباس في قوله : ( واذكروا اسم الله عليه ) يقول : إذا أرسلت جارحك فقل : باسم الله ، وإن نسيت فلا حرج .\nوقال بعض الناس : المراد بهذه الآية الأمر بالتسمية عند الأكل كما ثبت في الصحيح : أن رسول الله صلى الله عليه وسلم علم ربيبه عمر بن أبي سلمة فقال : \" سم الله ، وكل بيمينك ، وكل مما يليك \" . وفي صحيح البخاري : عن عائشة أنهم قالوا : يا رسول الله ، إن قوما يأتوننا - حديث عهدهم بكفر - بلحمان لا ندري أذكر اسم الله عليها أم لا ؟ فقال : \" سموا الله أنتم وكلوا \"\nحديث آخر : وقال الإمام أحمد : حدثنا يزيد ، حدثنا هشام عن بديل عن عبد الله بن عبيد بن عمير ، عن عائشة أن رسول الله صلى الله عليه وسلم كان يأكل الطعام في ستة نفر من أصحابه ، فجاء أعرابي فأكله بلقمتين ، فقال النبي صلى الله عليه وسلم : \" أما إنه لو كان ذكر اسم الله لكفاكم ، فإذا أكل أحدكم فليذكر اسم الله ، فإن نسي أن يذكر اسم الله أوله فليقل : باسم الله أوله وآخره \" .\nوهكذا رواه ابن ماجه عن أبي بكر بن أبي شيبة ، عن يزيد بن هارون ، به وهذا منقطع بين عبد الله بن عبيد بن عمير وعائشة فإنه لم يسمع منها هذا الحديث ، بدليل ما رواه الإمام أحمد :\nحدثنا عبد الوهاب ، أخبرنا هشام - يعني ابن أبي عبد الله الدستوائي - عن بديل عن عبد الله بن عبيد بن عمير ; أن امرأة منهم - يقال لها : أم كلثوم - حدثته ، عن عائشة : أن رسول الله صلى الله عليه وسلم كان يأكل طعاما في ستة من أصحابه ، فجاء أعرابي جائع فأكله بلقمتين ، فقال : \" أما إنه لو ذكر اسم الله لكفاكم ، فإذا أكل أحدكم فليذكر اسم الله ، فإن نسي اسم الله في أوله فليقل : باسم الله أوله وآخره \" .\n[ و ] رواه أحمد أيضا وأبو داود والترمذي والنسائي من غير وجه ، عن هشام الدستوائي به ، وقال الترمذي : حسن صحيح .\nحديث آخر : وقال أحمد : حدثنا علي بن عبد الله ، حدثنا يحيى بن سعيد ، حدثنا جابر بن صبح حدثني المثنى بن عبد الرحمن الخزاعي ، وصحبته إلى واسط ، فكان يسمي في أول طعامه وفي آخر لقمة يقول : بسم الله أوله وآخره .\nفقلت له : إنك تسمي في أول ما تأكل ، أرأيت قولك في آخر ما تأكل : باسم الله أوله وآخره؟ فقال : أخبرك عن ذلك ، إن جدي أمية بن مخشى - وكان من أصحاب النبي صلى الله عليه وسلم - سمعته يقول : إن رجلا كان يأكل ، والنبي ينظر ، فلم يسم ، حتى كان في آخر طعامه لقمة ، فقال : باسم الله أوله وآخره . فقال النبي صلى الله عليه وسلم : \" والله ما زال الشيطان يأكل معه حتى سمى ، فلم يبق شيء في بطنه حتى قاءه \" .\nوهكذا رواه أبو داود والنسائي من حديث جابر بن صبح الراسبي أبي بشر البصري ووثقه ابن معين والنسائي وقال أبو الفتح الأزدي : لا تقوم به الحجة .\nحديث آخر : قال الإمام أحمد : حدثنا أبو معاوية ، حدثنا الأعمش عن خيثمة عن أبي حذيفة قال أبو عبد الرحمن عبد الله بن الإمام أحمد : واسمه سلمة بن الهيثم بن صهيب - من أصحاب ابن مسعود - عن حذيفة قال : كنا إذا حضرنا مع النبي [ صلى الله عليه وسلم ] على طعام ، لم نضع أيدينا حتى يبدأ رسول الله [ صلى الله عليه وسلم ] فيضع يده ، وإنا حضرنا معه طعاما فجاءت جارية ، كأنما تدفع ، فذهبت تضع يدها في الطعام ، فأخذ رسول الله صلى الله عليه وسلم بيدها ، وجاء أعرابي كأنما يدفع ، فذهب يضع يده في الطعام ، فأخذ رسول الله [ صلى الله عليه وسلم ] بيده ، فقال رسول الله صلى الله عليه وسلم : \" إن الشيطان يستحل الطعام إذا لم يذكر اسم الله عليه ، وإنه جاء بهذه الجارية ليستحل بها ، فأخذت بيدها ، وجاء بهذا الأعرابي ليستحل به ، فأخذت بيده ، والذي نفسي بيده ، إن يده في يدي مع يدهما ، يعني الشيطان . وكذا رواه مسلم وأبو داود والنسائي ، من حديث الأعمش به .\nحديث آخر : روى مسلم وأهل السنن إلا الترمذي من طريق ابن جريج ، عن أبي الزبير ، عن جابر بن عبد الله ، عن النبي صلى الله عليه وسلم قال : \" إذا دخل الرجل بيته ، فذكر الله عند دخوله وعند طعامه ، قال الشيطان : لا مبيت لكم ولا عشاء ، وإذا دخل فلم يذكر اسم الله عند دخوله قال الشيطان : أدركتم المبيت ، فإذا لم يذكر اسم الله عند طعامه قال : أدركتم المبيت والعشاء \" . لفظ أبي داود .\nحديث آخر : قال الإمام أحمد : حدثنا يزيد بن عبد ربه ، حدثنا الوليد بن مسلم ، عن وحشي بن حرب بن وحشي بن حرب عن أبيه ، عن جده ; أن رجلا قال للنبي صلى الله عليه وسلم : إنا نأكل وما نشبع؟ قال : \" فلعلكم تأكلون متفرقين ، اجتمعوا على طعامكم واذكروا اسم الله يبارك لكم فيه \" .\nورواه أبو داود ، وابن ماجه ، من طريق الوليد بن مسلم .\n                                    ",
        "qortoby": "يَسۡ‍َٔلُونَكَ مَاذَآ أُحِلَّ لَهُمۡۖ قُلۡ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُ وَمَا عَلَّمۡتُم مِّنَ ٱلۡجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُۖ فَكُلُواْ مِمَّآ أَمۡسَكۡنَ عَلَيۡكُمۡ وَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهِۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ٤\n                                    \n                                    \n                                    قوله تعالى : يسألونك ماذا أحل لهم قل أحل لكم الطيبات وما علمتم من الجوارح مكلبين تعلمونهن مما علمكم الله فكلوا مما أمسكن عليكم واذكروا اسم الله عليه واتقوا الله إن الله سريع الحساب .\nفيه تسع عشرة مسألة :\nالأولى : قوله تعالى : يسألونك . الآية نزلت بسبب عدي بن حاتم وزيد بن مهلهل وهو زيد الخيل الذي سماه رسول الله صلى الله عليه وسلم زيد الخير ; قالا : يا رسول الله إنا قوم نصيد بالكلاب والبزاة ، وإن الكلاب تأخذ البقر والحمر والظباء فمنه ما ندرك ذكاته ، ومنه ما تقتله فلا ندرك ذكاته ، وقد حرم الله الميتة فماذا يحل لنا ؟ فنزلت الآية .\nالثانية : قوله تعالى : ماذا أحل لهم قل أحل لكم الطيبات ما في موضع رفع بالابتداء ، والخبر أحل لهم وذا زائدة ، وإن شئت كانت بمعنى الذي ، ويكون الخبر قل أحل لكم الطيبات وهو الحلال ، وكل حرام فليس بطيب . وقيل : ما التذه آكله وشاربه ولم يكن عليه فيه ضرر في الدنيا ولا في الآخرة . وقيل : الطيبات الذبائح ، لأنها طابت بالتذكية .\nالثالثة : قوله تعالى : وما علمتم أي : وصيد ما علمتم ; ففي الكلام إضمار لا بد منه ، ولولاه لكان المعنى يقتضي أن يكون الحل المسئول عنه متناولا للمعلم من الجوارح المكلبين ، وذلك ليس مذهبا لأحد ; فإن الذي يبيح لحم الكلب فلا يخصص الإباحة بالمعلم ; وسيأتي ما للعلماء في أكل الكلب في \" الأنعام \" إن شاء الله تعالى . وقد ذكر بعض من صنف في أحكام القرآن أن الآية تدل على أن الإباحة تتناول ما علمناه من الجوارح ، وهو ينتظم الكلب وسائر جوارح الطير ، وذلك يوجب إباحة سائر وجوه الانتفاع ، فدل على جواز بيع الكلب والجوارح والانتفاع بها بسائر وجوه المنافع إلا ما خصه الدليل ، وهو الأكل من الجوارح أي الكواسب من الكلاب وسباع الطير ; وكان لعدي كلاب خمسة قد سماها بأسماء أعلام ، وكان أسماء أكلبه سلهب وغلاب والمختلس والمتناعس ، قال السهيلي : وخامس أشك ، قال فيه : أخطب ، أو قال فيه : وثاب .\nالرابعة : أجمعت الأمة على أن الكلب إذا لم يكن أسود وعلمه مسلم فينشلي إذا أشلي ويجيب إذا دعي ، وينزجر بعد ظفره بالصيد إذا زجر ، وأن يكون لا يأكل من صيده الذي صاده ، وأثر فيه بجرح أو تنييب ، وصاد به مسلم وذكر اسم الله عند إرساله أن صيده صحيح يؤكل بلا خلاف ; فإن انخرم شرط من هذه الشروط دخل الخلاف . فإن كان الذي يصاد به غير كلب كالفهد وما أشبهه وكالبازي والصقر ونحوهما من الطير فجمهور الأمة على أن كل ما صاد بعد التعليم فهو جارح كاسب . يقال : جرح فلان واجترح إذا اكتسب ; ومنه الجارحة لأنها يكتسب بها ، ومنه اجتراح السيئات ، وقال الأعشى :\nذا جبار منضجا ميسمه يذكر الجارح ما كان اجترح\nوفي التنزيل ويعلم ما جرحتم بالنهار وقال : أم حسب الذين اجترحوا السيئات .\nالخامسة : قوله تعالى : مكلبين معنى مكلبين أصحاب الكلاب وهو كالمؤدب صاحب التأديب ، وقيل : معناه مصرين على الصيد كما تصرى الكلاب ; قال الرماني : وكلا القولين محتمل . وليس في مكلبين دليل على أنه إنما أبيح صيد الكلاب خاصة ; لأنه بمنزلة قوله : مؤمنين وإن كان قد تمسك به من قصر الإباحة على الكلاب خاصة . روي عن ابن عمر فيما حكى ابن المنذر عنه قال : وأما ما يصاد به من البزاة وغيرها من الطير فما أدركت ذكاته فذكه فهو لك حلال ، وإلا فلا تطعمه . قال ابن المنذر : وسئل أبو جعفر عن البازي يحل صيده قال : لا ; إلا أن تدرك ذكاته ، وقال الضحاك والسدي : وما علمتم من الجوارح مكلبين هي الكلاب خاصة ; فإن كان الكلب أسود بهيما فكره صيده الحسن وقتادة والنخعي ، وقال أحمد : ما أعرف أحدا يرخص فيه إذا كان بهيما ; وبه قال إسحاق بن راهويه ; فأما عوام أهل العلم بالمدينة والكوفة فيرون جواز صيد كل كلب معلم ، أما من منع صيد الكلب الأسود فلقوله صلى الله عليه وسلم : الكلب الأسود شيطان ، أخرجه مسلم . احتج الجمهور بعموم الآية ، واحتجوا أيضا في جواز صيد البازي بما ذكر من سبب النزول ، وبما خرجه الترمذي عن عدي بن حاتم قال : سألت رسول الله صلى الله عليه وسلم عن صيد البازي فقال : ما أمسك عليك فكل . في إسناده مجالد ولا يعرف إلا من جهته وهو ضعيف ، وبالمعنى وهو أن كل ما يتأتى من الكلب يتأتى من الفهد مثلا فلا فارق إلا فيما لا مدخل له في التأثير ; وهذا هو القياس في معنى الأصل ، كقياس السيف على المدية والأمة على العبد ، وقد تقدم .\nالسادسة : وإذا تقرر هذا فاعلم أنه لابد للصائد أن يقصد عند الإرسال التذكية والإباحة ، وهذا لا يختلف فيه ; لقوله عليه السلام : إذا أرسلت كلبك وذكرت اسم الله عليه فكل وهذا يقتضي النية والتسمية ; فلو قصد مع ذلك اللهو فكرهه مالك وأجازه ابن عبد الحكم ، وهو ظاهر قول الليث : ما رأيت حقا أشبه بباطل منه ، يعني الصيد ; فأما لو فعله بغير نية التذكية فهو حرام ; لأنه من باب الفساد وإتلاف حيوان لغير منفعة ، وقد نهى رسول الله صلى الله عليه وسلم عن قتل الحيوان إلا لمأكلة ، وقد ذهب الجمهور من العلماء إلى أن التسمية لا بد منها بالقول عند الإرسال ; لقوله : وذكرت اسم الله فلو لم توجد على أي وجه كان لم يؤكل الصيد ; وهو مذهب أهل الظاهر وجماعة أهل الحديث ، وذهبت جماعة من أصحابنا وغيرهم إلى أنه يجوز أكل ما صاده المسلم وذبحه وإن ترك التسمية عمدا ; وحملوا الأمر بالتسمية على الندب ، وذهب مالك في المشهور إلى الفرق بين ترك التسمية عمدا أو سهوا فقال : لا تؤكل مع العمد وتؤكل مع السهو ; وهو قول فقهاء الأمصار ، وأحد قولي الشافعي ، وستأتي هذه المسألة في \" الأنعام \" إن شاء الله تعالى . ثم لا بد أن يكون انبعاث الكلب بإرسال من يد الصائد بحيث يكون زمامه بيده . فيخلي عنه ويغريه عليه فينبعث ، أو يكون الجارح ساكنا مع رؤيته الصيد فلا يتحرك له إلا بالإغراء من الصائد ، فهذا بمنزلة ما زمامه بيده فأطلقه مغريا له على أحد القولين ; فأما لو انبعث الجارح من تلقاء نفسه من غير إرسال ولا إغراء فلا يجوز صيده ولا يحل أكله عند الجمهور ومالك والشافعي وأبي ثور وأصحاب الرأي ; لأنه إنما صاد لنفسه من غير إرسال وأمسك عليها ، ولا صنع للصائد فيه ، فلا ينسب إرساله إليه ; لأنه لا يصدق عليه قوله عليه السلام : إذا أرسلت كلبك المعلم ، وقال عطاء بن أبي رباح والأوزاعي : يؤكل صيده إذا كان أخرجه للصيد .\nالسابعة : قرأ الجمهور \" علمتم \" بفتح العين واللام ، وابن عباس ومحمد بن الحنفية بضم العين وكسر اللام ، أي : من أمر الجوارح والصيد بها . والجوارح الكواسب ، وسميت أعضاء الإنسان جوارح لأنها تكسب وتتصرف . وقيل : سميت جوارح لأنها تجرح وتسيل الدم ، فهو مأخوذ من الجراح ، وهذا ضعيف ، وأهل اللغة على خلافه ، وحكاه ابن المنذر عن قوم . و \" مكلبين \" قراءة الجمهور بفتح الكاف وشد اللام ، والمكلب معلم الكلاب ومضريها ، ويقال لمن يعلم غير الكلب : مكلب ; لأنه يرد ذلك الحيوان كالكلب ; حكاه بعضهم ، ويقال للصائد : مكلب فعلى هذا معناه صائدين ، وقيل : المكلب صاحب الكلاب ، يقال : كلب فهو مكلب وكلاب ، وقرأ الحسن \" مكلبين \" بسكون الكاف وتخفيف اللام ، ومعناه أصحاب كلاب ، يقال : أمشى الرجل كثرت ماشيته ، وأكلب كثرت كلابه ، وأنشد الأصمعي :\nوكل فتى وإن أمشى فأثرى ستخلجه عن الدنيا منون\nالثامنة : قوله تعالى : تعلمونهن مما علمكم الله أنث الضمير مراعاة للفظ الجوارح ; إذ هو جمع جارحة ، ولا خلاف بين العلماء في شرطين في التعليم وهما : أن يأتمر إذا أمر وينزجر إذا زجر ; لا خلاف في هذين الشرطين في الكلاب وما في معناها من سباع الوحوش ، واختلف فيما يصاد به من الطير ; فالمشهور أن ذلك مشترط فيها عند الجمهور ، وذكر ابن حبيب أنه لا يشترط فيها أن تنزجر إذا زجرت ; فإنه لا يتأتى ذلك فيها غالبا ، فيكفي أنها إذا أمرت أطاعت . وقال ربيعة : ما أجاب منها إذا دعي فهو المعلم الضاري ; لأن أكثر الحيوان بطبعه ينشلي ، وقد شرط الشافعي وجمهور من العلماء في التعليم أن يمسك على صاحبه ، ولم يشترطه مالك في المشهور عنه ، وقال الشافعي : المعلم هو الذي إذا أشلاه صاحبه انشلى ; وإذا دعاه إلى الرجوع رجع إليه ، ويمسك الصيد على صاحبه ولا يأكل منه ; فإذا فعل هذا مرارا وقال أهل العرف : صار معلما فهو المعلم ، وعن الشافعي أيضا والكوفيين : إذا أشلي فانشلى وإذا أخذ حبس وفعل ذلك مرة بعد مرة أكل صيده في الثالثة . ومن العلماء من قال : يفعل ذلك ثلاث مرات ويؤكل صيده في الرابعة ، ومنهم من قال : إذا فعل ذلك مرة فهو معلم ويؤكل صيده في الثانية .\nالتاسعة : قوله تعالى : فكلوا مما أمسكن عليكم أي : حبسن لكم ، واختلف العلماء في تأويله ; فقال ابن عباس وأبو هريرة والنخعي وقتادة وابن جبير وعطاء بن أبي رباح وعكرمة والشافعي وأحمد وإسحاق وأبو ثور والنعمان وأصحابه : المعنى ولم يأكل ; فإن أكل لم يؤكل ما بقي ، لأنه أمسك على نفسه ولم يمسك على ربه ، والفهد عند أبي حنيفة وأصحابه كالكلب ولم يشترطوا ذلك في الطيور بل يؤكل ما أكلت منه ، وقال سعد بن أبي وقاص وعبد الله بن عمر وسلمان الفارسي وأبو هريرة أيضا : المعنى وإن أكل ; فإذا أكل الجارح كلبا كان أو فهدا أو طيرا أكل ما بقي من الصيد وإن لم يبق إلا بضعة ; وهذا قول مالك وجميع أصحابه ، وهو القول الثاني للشافعي ، وهو القياس ، وفي الباب حديثان بمعنى ما ذكرنا أحدهما : حديث عدي في الكلب المعلم ( وإذا أكل فلا تأكل فإنما أمسك على نفسه ) أخرجه مسلم . الثاني : حديث أبي ثعلبة الخشني قال : قال رسول الله صلى الله عليه وسلم في صيد الكلب : إذا أرسلت كلبك وذكرت اسم الله عليه فكل وإن أكل منه وكل ما ردت عليك يداك أخرجه أبو داود ، وروي عن عدي ولا يصح ; والصحيح عنه حديث مسلم ; ولما تعارضت الروايتان رام بعض أصحابنا وغيرهم الجمع بينهما فحملوا حديث النهي على التنزيه والورع ، وحديث الإباحة على الجواز ، وقالوا : إن عديا كان موسعا عليه فأفتاه النبي صلى الله عليه وسلم بالكف ورعا ، وأبا ثعلبة كان محتاجا فأفتاه بالجواز ; والله أعلم ، وقد دل على صحة هذا التأويل قوله عليه الصلاة والسلام في حديث عدي : فإني أخاف أن يكون إنما أمسك على نفسه هذا تأويل علمائنا . وقال أبو عمر في كتاب \" الاستذكار \" : وقد عارض حديث عدي هذا حديث أبي ثعلبة ، والظاهر أن حديث أبي ثعلبة ناسخ له ; فقوله : وإن أكل يا رسول الله ؟ قال : وإن أكل .\nقلت : هذا فيه نظر ; لأن التاريخ مجهول ; والجمع بين الحديثين أولى ما لم يعلم التاريخ ; والله أعلم . وأما أصحاب الشافعي فقالوا : إن كان الأكل عن فرط جوع من الكلب أكل وإلا لم يؤكل ; فإن ذلك من سوء تعليمه ، وقد روي عن قوم من السلف التفرقة بين ما أكل منه الكلب والفهد فمنعوه ، وبين ما أكل منه البازي فأجازوه ، قاله النخعي والثوري وأصحاب الرأي وحماد بن أبي سليمان ، وحكي عن ابن عباس وقالوا : الكلب والفهد يمكن ضربه وزجره ، والطير لا يمكن ذلك فيه ، وحد تعليمه أن يدعى فيجيب ، وأن يشلى فينشلي ; لا يمكن فيه أكثر من ذلك ، والضرب يؤذيه .\nالعاشرة : والجمهور من العلماء على أن الجارح إذا شرب من دم الصيد أن الصيد يؤكل ; قال عطاء : ليس شرب الدم بأكل ; وكره أكل ذلك الصيد الشعبي وسفيان الثوري ، ولا خلاف بينهم أن سبب إباحة الصيد الذي هو عقر الجارح له لا بد أن يكون متحققا غير مشكوك فيه ، ومع الشك لا يجوز الأكل ، وهي :\nالحادية عشرة : فإن وجد الصائد مع كلبه كلبا آخر فهو محمول على أنه غير مرسل من صائد آخر ، وأنه إنما انبعث في طلب الصيد بطبعه ونفسه ، ولا يختلف في هذا ; لقوله عليه الصلاة والسلام : وإن خالطها كلاب من غيرها فلا تأكل - في رواية - فإنما سميت على كلبك ولم تسم على غيره . فأما لو أرسله صائد آخر فاشترك الكلبان فيه فإنه للصائدين يكونان شريكين فيه . فلو أنفذ أحد الكلبين مقاتله ثم جاء الآخر فهو للذي أنفذ مقاتله ، وكذلك لا يؤكل ما رمي بسهم فتردى من جبل أو غرق في ماء ; لقوله عليه الصلاة والسلام لعدي : وإن رميت بسهمك فاذكر اسم الله فإن غاب عنك يوما فلم تجد فيه إلا أثر سهمك فكل وإن وجدته غريقا في الماء فلا تأكل فإنك لا تدري الماء قتله أو سهمك ، وهذا نص .\nالثانية عشرة : لو مات الصيد في أفواه الكلاب من غير بضع لم يؤكل ; لأنه مات خنقا فأشبه أن يذبح بسكين كالة فيموت في الذبح قبل أن يفرى حلقه . ولو أمكنه أخذه من الجوارح وذبحه فلم يفعل حتى مات لم يؤكل ، وكان مقصرا في الذكاة ; لأنه قد صار مقدورا على ذبحه ، وذكاة المقدور عليه تخالف ذكاة غير المقدور عليه ، ولو أخذه ثم مات قبل أن يخرج السكين ، أو تناولها وهي معه جاز أكله ; ولو لم تكن السكين معه فتشاغل بطلبها لم تؤكل ، وقال الشافعي : فيما نالته الجوارح ولم تدمه قولان : أحدهما : ألا يؤكل حتى يجرح ; لقوله تعالى : من الجوارح وهو قول بن القاسم ; والآخر : أنه حل وهو قول أشهب ، قال أشهب : إن مات من صدمة الكلب أكل .\nالثالثة عشرة : قوله : ( فإن غاب عنك يوما فلم تجد فيه إلا أثر سهمك فكل ) ونحوه في حديث أبي ثعلبة الذي خرجه أبو داود ، غير أنه زاد ( فكله بعد ثلاث ما لم ينتن ) يعارضه قوله عليه السلام : كل ما أصميت ودع ما أنميت . فالإصماء ما قتل مسرعا وأنت تراه ، والإنماء أن ترمي الصيد فيغيب عنك فيموت وأنت لا تراه ; يقال : قد أنميت الرمية فنمت تنمي إذا غابت ثم ماتت قال امرؤ القيس :\nفهو لا تنمي رميته ماله لا عد من نفره\nوقد اختلف العلماء في أكل الصيد الغائب على ثلاثة أقوال : يؤكل ، وسواء قتله السهم أو الكلب . الثاني : لا يؤكل شيء من ذلك إذا غاب ; لقوله : كل ما أصميت ودع ما أنميت ، وإنما لم يؤكل مخافة أن يكون قد أعان على قتله غير السهم من الهوام . الثالث : الفرق بين السهم فيؤكل وبين الكلب فلا يؤكل ، ووجهه أن السهم يقتل على جهة واحدة فلا يشكل ; والجارح على جهات متعددة فيشكل ، والثلاثة الأقوال لعلمائنا ، وقال مالك في غير الموطأ : إذا بات الصيد ثم أصابه ميتا لم ينفذ البازي أو الكلب أو السهم مقاتله لم يأكله ; قالأبو عمر : فهذا يدلك على أنه إذا بلغ مقاتله كان حلالا عنده أكله وإن بات ، إلا أنه يكرهه إذا بات ; لما جاء عن ابن عباس : \" وإن غاب عنك ليلة فلا تأكل \" ونحوه عن الثوري قال : إذا غاب عنك يوما كرهت أكله ، وقال الشافعي : القياس ألا يأكله إذا غاب عنه مصرعه ، وقال الأوزاعي : إن وجده من الغد ميتا ووجد فيه سهمه أو أثرا من كلبه فليأكله ; ونحوه قال أشهب وعبد الملك وأصبغ ; قالوا : جائز أكل الصيد وإن بات إذا نفذت مقاتله ، وقوله في الحديث : ما لم ينتن تعليل ; لأنه إذا أنتن لحق بالمستقذرات التي تمجها الطباع فيكره أكلها ; فلو أكلها لجاز ، كما أكل النبي صلى الله عليه وسلم الإهالة السنخة وهي المنتنة ، وقيل : هو معلل بما يخاف منه الضرر على آكله ، وعلى هذا التعليل يكون أكله محرما إن كان الخوف محققا ، والله أعلم .\nالرابعة عشرة : واختلف العلماء من هذا الباب في الصيد بكلب اليهودي والنصراني إذا كان معلما ، فكرهه الحسن البصري ; وأما كلب المجوسي وبازه وصقره فكره الصيد بها جابر بن عبد الله والحسن وعطاء ومجاهد والنخعي والثوري وإسحاق ، وأجاز الصيد بكلابهم مالك والشافعي وأبو حنيفة إذا كان الصائد مسلما ; قالوا : وذلك مثل شفرته ، وأما إن كان الصائد من أهل الكتاب فجمهور الأمة على جواز صيده غير مالك ، وفرق بين ذلك وبين ذبيحته ; وتلا : يا أيها الذين آمنوا ليبلونكم الله بشيء من الصيد تناله أيديكم ورماحكم ، قال : فلم يذكر الله في هذا اليهود ولا النصارى ، وقال ابن وهب وأشهب : صيد اليهودي والنصراني حلال كذبيحته ; وفي كتاب محمد لا يجوز صيد الصابئ ولا ذبحه ، وهم قوم بين اليهود والنصارى ولا دين لهم ، وأما إن كان الصائد مجوسيا فمنع من أكله مالك والشافعي وأبو حنيفة وأصحابهم وجمهور الناس ، وقال أبو ثور فيها قولان : أحدهما : كقول هؤلاء ، والآخر : أن المجوس من أهل الكتاب وأن صيدهم جائز ، ولو اصطاد السكران أو ذبح لم يؤكل صيده ولا ذبيحته ; لأن الذكاة تحتاج إلى قصد ، والسكران لا قصد له .\nالخامسة عشرة : واختلف النحاة في \" من \" في قوله تعالى : مما أمسكن عليكم فقال الأخفش : هي زائدة كقوله : كلوا من ثمره ، وخطأه البصريون وقالوا : \" من \" لا تزاد في الإثبات وإنما تزاد في النفي والاستفهام ، وقوله : من ثمره ، ويكفر عنكم من سيئاتكم و يغفر لكم من ذنوبكم للتبعيض ; أجاب فقال : قد قال : يغفر لكم ذنوبكم بإسقاط \" من \" فدل على زيادتها في الإيجاب ; أجيب بأن \" من \" هاهنا للتبعيض ; لأنه إنما يحل من الصيد اللحم دون الفرث والدم .\nقلت : هذا ليس بمراد ولا معهود في الأكل فيعكر على ما قال ، ويحتمل أن يريد مما أمسكن أي : مما أبقته الجوارح لكم ; وهذا على قول من قال : لو أكل الكلب الفريسة لم يضر وبسبب هذا الاحتمال اختلف العلماء في جواز أكل الصيد إذا أكل الجارح منه على ما تقدم .\nالسادسة عشرة : ودلت الآية على جواز اتخاذ الكلاب واقتنائها للصيد ، وثبت ذلك في صحيح السنة وزادت الحرث والماشية ; وقد كان أول الإسلام أمر بقتل الكلاب حتى كان يقتل كلب المرية من البادية يتبعها ; روى مسلم عن ابن عمر عن النبي صلى الله عليه وسلم قال : من اقتنى كلبا إلا كلب صيد أو ماشية نقص من أجره كل يوم قيراطان ، وروي أيضا عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : من اتخذ كلبا إلا كلب ماشية أو صيد أو زرع انتقص من أجره كل يوم قيراط . قال الزهري : وذكر لابن عمر قول أبي هريرة فقال : يرحم الله أبا هريرة ، كان صاحب زرع ; فقد دلت السنة على ما ذكرنا ، وجعل النقص من أجر من اقتناها على غير ذلك من المنفعة ; إما لترويع الكلب المسلمين وتشويشه عليهم بنباحه - كما قال بعض شعراء البصرة ، وقد نزل بعمار فسمع لكلابه نباحا فأنشأ يقول :\nنزلنا بعمار فأشلى كلابه علينا فكدنا بين بيتيه نؤكل\nفقلت لأصحابي أسر إليهم أذا اليوم أم يوم القيامة أطول\nأو لمنع دخول الملائكة البيت ، أو لنجاسته على ما يراه الشافعي ، أو لاقتحام النهي عن اتخاذ ما لا منفعة فيه ; والله أعلم ، وقال في إحدى الروايتين : ( قيراطان ) وفي الأخرى ( قيراط ) وذلك يحتمل أن يكون في نوعين من الكلاب أحدهما أشد أذى من الآخر ; كالأسود الذي أمر عليه الصلاة والسلام بقتله ، ولم يدخله في الاستثناء حين نهى عن قتلها فقال : عليكم بالأسود البهيم ذي النقطتين فإنه شيطان أخرجه مسلم ، ويحتمل أن يكون ذلك لاختلاف المواضع ، فيكون ممسكه بالمدينة مثلا أو بمكة ينقص قيراطان ، وبغيرهما قيراط ; والله أعلم ، وأما المباح اتخاذه فلا ينقص أجر متخذه كالفرس والهر ، ويجوز بيعه وشراؤه ، حتى قال سحنون : ويحج بثمنه ، وكلب الماشية المباح اتخاذه عند مالك هو الذي يسرح معها لا الذي يحفظها في الدار من السراق ، وكلب الزرع هو الذي يحفظه من الوحوش بالليل والنهار لا من السراق ، وقد أجاز غير مالك اتخاذها لسراق الماشية والزرع والدار في البادية .\nالسابعة عشرة : وفي هذه الآية دليل على أن العالم له من الفضيلة ما ليس للجاهل ; لأن الكلب إذا علم يكون له فضيلة على سائر الكلاب ، فالإنسان إذا كان له علم أولى أن يكون له فضل على سائر الناس ، لا سيما إذا عمل بما علم ; وهذا كما روي عن علي بن أبي طالب كرم الله وجهه أنه قال : لكل شيء قيمة وقيمة المرء ما يحسنه .\nالثامنة عشرة : قوله تعالى : واذكروا اسم الله عليه أمر بالتسمية ; قيل : عند الإرسال على الصيد ، وفقه الصيد والذبح في معنى التسمية واحد ، يأتي بيانه في \" الأنعام \" ، وقيل : المراد بالتسمية هنا التسمية عند الأكل ، وهو الأظهر ، وفي صحيح مسلم أن النبي صلى الله عليه وسلم قال لعمر بن أبي سلمة : يا غلام سم الله وكل بيمينك وكل مما يليك ، وروي من حديث حذيفة قال رسول الله صلى الله عليه وسلم : إن الشيطان ليستحل الطعام إلا يذكر اسم الله عليه الحديث . فإن نسي التسمية أول الأكل فليسم آخره ; وروى النسائي عن أمية بن مخشي - وكان من أصحاب رسول الله صلى الله عليه وسلم - أن رسول الله صلى الله عليه وسلم رأى رجلا يأكل ولم يسم الله ، فلما كان في آخر لقمة قال : بسم الله أوله وآخره ; فقال رسول الله صلى الله عليه وسلم : ما زال الشيطان يأكل معه فلما سمى قاء ما أكله .\nالتاسعة عشرة : قوله تعالى : واتقوا الله أمر بالتقوى على الجملة ، والإشارة القريبة هي ما تضمنته هذه الآيات من الأوامر ، وسرعة الحساب هي من حيث كونه تعالى قد أحاط بكل شيء علما وأحصى كل شيء عددا ; فلا يحتاج إلى محاولة عد ولا عقد كما يفعله الحساب ; ولهذا قال : وكفى بنا حاسبين فهو سبحانه يحاسب الخلائق دفعة واحدة . ويحتمل أن يكون وعيدا بيوم القيامة كأنه قال : إن حساب الله لكم سريع إتيانه ; إذ يوم القيامة قريب ، ويحتمل أن يريد بالحساب المجازاة ; فكأنه توعد في الدنيا بمجازاة سريعة قريبة إن لم يتقوا الله .\n                                    ",
        "saadi": "يَسۡ‍َٔلُونَكَ مَاذَآ أُحِلَّ لَهُمۡۖ قُلۡ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُ وَمَا عَلَّمۡتُم مِّنَ ٱلۡجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُۖ فَكُلُواْ مِمَّآ أَمۡسَكۡنَ عَلَيۡكُمۡ وَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهِۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ٤\n                                        \n                                        \n                                        \n                                        يقول تعالى لنبيه محمد صلى الله عليه وسلم: { يَسْأَلُونَكَ مَاذَا أُحِلَّ لَهُمْ ْ} من الأطعمة؟ { قُلْ أُحِلَّ لَكُمُ الطَّيِّبَاتُ ْ} وهي كل ما فيه نفع أو لذة, من غير ضرر بالبدن ولا بالعقل، فدخل في ذلك جميع الحبوب والثمار التي في القرى والبراري، ودخل في ذلك جميع حيوانات البحر وجميع حيوانات البر، إلا ما استثناه الشارع، كالسباع والخبائث منها. ولهذا دلت الآية بمفهومها على تحريم الخبائث، كما صرح به في قوله تعالى: { وَيُحِلُّ لَهُمُ الطَّيِّبَاتِ وَيُحَرِّمُ عَلَيْهِمُ الْخَبَائِثَ ْ} { وَمَا عَلَّمْتُمْ مِنَ الْجَوَارِحِ ْ} أي: أحل لكم ما علمتم من الجوارح إلى آخر الآية. دلت هذه الآية على أمور: أحدها: لطف الله بعباده ورحمته لهم، حيث وسع عليهم طرق الحلال، وأباح لهم ما لم يذكوه مما صادته الجوارح، والمراد بالجوارح: الكلاب، والفهود، والصقر، ونحو ذلك، مما يصيد بنابه أو بمخلبه. الثاني: أنه يشترط أن تكون معلمة، بما يعد في العرف تعليما، بأن يسترسل إذا أرسل، وينزجر إذا زجر، وإذا أمسك لم يأكل، ولهذا قال: { تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ اللَّهُ فَكُلُوا مِمَّا أَمْسَكْنَ عَلَيْكُمْ ْ} أي: أمسكن من الصيد لأجلكم. وما أكل منه الجارح فإنه لا يعلم أنه أمسكه على صاحبه، ولعله أن يكون أمسكه على نفسه. الثالث: اشتراط أن يجرحه الكلب أو الطير ونحوهما، لقوله: { مِنَ الْجَوَارِحِ ْ} مع ما تقدم من تحريم المنخنقة. فلو خنقه الكلب أو غيره، أو قتله بثقله لم يبح [هذا بناء على أن الجوارح اللاتي يجرحن الصيد بأنيابها أو مخالبها، والمشهور أن الجوارح بمعنى الكواسب أي: المحصلات للصيد والمدركات لها فلا يكون فيها على هذا دلالة - والله أعلم-] الرابع: جواز اقتناء كلب الصيد، كما ورد في الحديث الصحيح، مع أن اقتناء الكلب محرم، لأن من لازم إباحة صيده وتعليمه جواز اقتنائه. الخامس: طهارة ما أصابه فم الكلب من الصيد، لأن الله أباحه ولم يذكر له غسلا، فدل على طهارته. السادس: فيه فضيلة العلم، وأن الجارح المعلم -بسبب العلم- يباح صيده، والجاهل بالتعليم لا يباح صيده. السابع: أن الاشتغال بتعليم الكلب أو الطير أو نحوهما، ليس مذموما، وليس من العبث والباطل. بل هو أمر مقصود، لأنه وسيلة لحل صيده والانتفاع به. الثامن: فيه حجة لمن أباح بيع كلب الصيد، قال: لأنه قد لا يحصل له إلا بذلك. التاسع: فيه اشتراط التسمية عند إرسال الجارح، وأنه إن لم يسم الله متعمدا، لم يبح ما قتل الجارح. العاشر: أنه يجوز أكل ما صاده الجارح، سواء قتله الجارح أم لا. وأنه إن أدركه صاحبه، وفيه حياة مستقرة فإنه لا يباح إلا بها. ثم حث تعالى على تقواه، وحذر من إتيان الحساب في يوم القيامة، وأن ذلك أمر قد دنا واقترب، فقال: { وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ ْ}\n                                    "
      },
      "originalText": "يَسۡ‍َٔلُونَكَ مَاذَآ أُحِلَّ لَهُمۡۖ قُلۡ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُ وَمَا عَلَّمۡتُم مِّنَ ٱلۡجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُۖ فَكُلُواْ مِمَّآ أَمۡسَكۡنَ عَلَيۡكُمۡ وَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهِۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ٤"
    },
    {
      "number": 674,
      "text": "الْيَوْمَ أُحِلَّ لَكُمُ الطَّيِّبَاتُ ۖ وَطَعَامُ الَّذِينَ أُوتُوا الْكِتَابَ حِلٌّ لَكُمْ وَطَعَامُكُمْ حِلٌّ لَهُمْ ۖ وَالْمُحْصَنَاتُ مِنَ الْمُؤْمِنَاتِ وَالْمُحْصَنَاتُ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ إِذَا آتَيْتُمُوهُنَّ أُجُورَهُنَّ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ وَلَا مُتَّخِذِي أَخْدَانٍ ۗ وَمَنْ يَكْفُرْ بِالْإِيمَانِ فَقَدْ حَبِطَ عَمَلُهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 5,
      "juz": 6,
      "manzil": 2,
      "page": 107,
      "ruku": 86,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلۡيَوۡمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُۖ وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حِلّٞ لَّكُمۡ وَطَعَامُكُمۡ حِلّٞ لَّهُمۡۖ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلۡمُؤۡمِنَٰتِ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّ مُحۡصِنِينَ غَيۡرَ مُسَٰفِحِينَ وَلَا مُتَّخِذِيٓ أَخۡدَانٖۗ وَمَن يَكۡفُرۡ بِٱلۡإِيمَٰنِ فَقَدۡ حَبِطَ عَمَلُهُۥ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ ٥\n                                    \n                                    \n                                    لما ذكر تعالى ما حرمه على عباده المؤمنين من الخبائث ، وما أحله لهم من الطيبات ، قال بعده : ( اليوم أحل لكم الطيبات )\nثم ذكر حكم ذبائح أهل الكتابين من اليهود والنصارى فقال : ( وطعام الذين أوتوا الكتب حل لكم ) قال ابن عباس وأبو أمامة ومجاهد وسعيد بن جبير وعكرمة وعطاء والحسن ومكحول وإبراهيم النخعي والسدي ومقاتل بن حيان : يعني ذبائحهم .\nوهذا أمر مجمع عليه بين العلماء ؛ أن ذبائحهم حلال للمسلمين ; لأنهم يعتقدون تحريم الذبح لغير الله ، ولا يذكرون على ذبائحهم إلا اسم الله ، وإن اعتقدوا فيه تعالى ما هو منزه عن قولهم ، تعالى وتقدس . وقد ثبت في الصحيح عن عبد الله بن مغفل قال : دلي بجراب من شحم يوم خيبر . [ قال ] فاحتضنته وقلت : لا أعطي اليوم من هذا أحدا ، والتفت فإذا النبي صلى الله عليه وسلم يتبسم .\nفاستدل به الفقهاء على أنه يجوز تناول ما يحتاج إليه من الأطعمة ونحوها من الغنيمة قبل القسمة ، وهذا ظاهر . واستدل به الفقهاء الحنفية والشافعية والحنابلة على أصحاب مالك في منعهم أكل ما يعتقد اليهود تحريمه من ذبائحهم ، كالشحوم ونحوها مما حرم عليهم . فالمالكية لا يجوزون للمسلمين أكله ; لقوله تعالى : ( وطعام الذين أوتوا الكتاب حل لكم ) قالوا : وهذا ليس من طعامهم . واستدل عليهم الجمهور بهذا الحديث ، وفي ذلك نظر ; لأنه قضية عين ، ويحتمل أنه كان شحما يعتقدون حله ، كشحم الظهر والحوايا ونحوهما ، والله أعلم .\nوأجود منه في الدلالة ما ثبت في الصحيح : أن أهل خيبر أهدوا لرسول الله صلى الله عليه وسلم شاة مصلية ، وقد سموا ذراعها ، وكان يعجبه الذراع ، فتناوله فنهش منه نهشة ، فأخبره الذراع أنه مسموم ، فلفظه وأثر ذلك السم في ثنايا رسول الله صلى الله عليه وسلم وفي أبهره ، وأكل معه منها بشر بن البراء بن معرور ; فمات ، فقتل اليهودية التي سمتها ، وكان اسمها زينب فقتلت ببشر بن البراء .\nووجه الدلالة منه أنه عزم على أكلها ومن معه ، ولم يسألهم هل نزعوا منها ما يعتقدون تحريمه من شحمها أم لا .\nوفي الحديث الآخر : أن رسول الله صلى الله عليه وسلم أضافه يهودي على خبز شعير وإهالة سنخة ، يعني : ودكا زنخا\nوقال ابن أبي حاتم : قرئ على العباس بن الوليد بن مزيد ، أخبرنا محمد بن شعيب ، أخبرني النعمان بن المنذر ، عن مكحول قال : أنزل الله : ( ولا تأكلوا مما لم يذكر اسم الله عليه ) [ الأنعام : 121 ] ثم نسخها الرب ، عز وجل ، ورحم المسلمين ، فقال : ( اليوم أحل لكم الطيبات وطعام الذين أوتوا الكتاب حل لكم ) فنسخها بذلك ، وأحل طعام أهل الكتاب .\nوفي هذا الذي قاله مكحول - رحمه الله - نظر ، فإنه لا يلزم من إباحته طعام أهل الكتاب إباحة أكل ما لم يذكر اسم الله عليه ; لأنهم يذكرون اسم الله على ذبائحهم وقرابينهم ، وهم متعبدون بذلك ; ولهذا لم يبح ذبائح من عداهم من أهل الشرك ومن شابههم ، لأنهم لم يذكروا اسم الله على ذبائحهم ، بل ولا يتوقفون فيما يأكلونه من اللحم على ذكاة ، بل يأكلون الميتة ، بخلاف أهل الكتابين ومن شاكلهم من السامرة والصابئة ومن تمسك بدين إبراهيم وشيث وغيرهما من الأنبياء ، على أحد قولي العلماء ، ونصارى العرب كبني تغلب وتنوخ وبهراء وجذام ولخم وعاملة ومن أشبههم ، لا تؤكل ذبائحهم عند الجمهور .\n[ و ] قال أبو جعفر بن جرير : حدثنا يعقوب بن إبراهيم ، حدثنا ابن علية ، عن أيوب عن محمد بن عبيدة قال : قال علي : لا تأكلوا ذبائح بني تغلب ; لأنهم إنما يتمسكون من النصرانية بشرب الخمر .\nوكذا قال غير واحد من الخلف والسلف .\nوقال سعيد بن أبي عروبة ، عن قتادة عن سعيد بن المسيب والحسن أنهما كانا لا يريان بأسا بذبيحة نصارى بني تغلب .\nوأما المجوس فإنهم وإن أخذت منهم الجزية تبعا وإلحاقا لأهل الكتاب فإنهم لا تؤكل ذبائحهم ولا تنكح نساؤهم ، خلافا لأبي ثور إبراهيم بن خالد الكلبي ، أحد الفقهاء من أصحاب الشافعي وأحمد بن حنبل ، ولما قال ذلك واشتهر عنه أنكر عليه الفقهاء ذلك ، حتى قال عنه الإمام أحمد : أبو ثور كاسمه ! يعني في هذه المسألة ، وكأنه تمسك بعموم حديث روي مرسلا عن النبي صلى الله عليه وسلم أنه قال : \" سنوا بهم سنة أهل الكتاب \" ، ولكن لم يثبت بهذا اللفظ ، وإنما الذي في صحيح البخاري : عن عبد الرحمن بن عوف ; أن رسول الله صلى الله عليه وسلم أخذ الجزية من مجوس هجر ولو سلم صحة هذا الحديث ، فعمومه مخصوص بمفهوم هذه الآية : ( وطعام الذين أوتوا الكتاب حل لكم ) فدل بمفهومه - مفهوم المخالفة - على أن طعام من عداهم من أهل الأديان لا يحل\nوقوله : ( وطعامكم حل لهم ) أي : ويحل لكم أن تطعموهم من ذبائحكم ، وليس هذا إخبارا عن الحكم عندهم ، اللهم إلا أن يكون خبرا عما أمروا به من الأكل من كل طعام ذكر اسم الله عليه ، سواء كان من أهل ملتهم أو غيرها . والأول أظهر في المعنى ، أي : ولكم أن تطعموهم من ذبائحكم كما أكلتم من ذبائحهم . وهذا من باب المكافأة والمقابلة والمجازاة ، كما ألبس النبي صلى الله عليه وسلم ثوبه لعبد الله بن أبي ابن سلول حين مات ودفنه فيه ، قالوا : لأنه كان قد كسا العباس حين قدم المدينة ثوبه ، فجازاه النبي صلى الله عليه وسلم ذلك بذلك ، فأما الحديث الذي فيه : \" لا تصحب إلا مؤمنا ، ولا يأكل طعامك إلا تقي \" فمحمول على الندب والاستحباب ، والله أعلم .\nوقوله : ( والمحصنات من المؤمنات ) أي : وأحل لكم نكاح الحرائر العفائف من النساء المؤمنات ، وذكر هذا توطئة لما بعده ، وهو قوله : ( والمحصنات من الذين أوتوا الكتاب من قبلكم ) فقيل : أراد بالمحصنات : الحرائر دون الإماء ، حكاه ابن جرير عن مجاهد . وإنما قال مجاهد : المحصنات : الحرائر ، فيحتمل أن يكون أراد ما حكاه عنه ، ويحتمل أن يكون أراد بالحرة العفيفة ، كما قاله مجاهد في الرواية الأخرى عنه . وهو قول الجمهور هاهنا ، وهو الأشبه ; لئلا يجتمع فيها أن تكون ذمية وهي مع ذلك غير عفيفة ، فيفسد حالها بالكلية ، ويتحصل زوجها على ما قيل في المثل : \" حشفا وسوء كيلة \" . والظاهر من الآية أن المراد بالمحصنات : العفيفات عن الزنا ، كما قال في الآية الأخرى : ( محصنات غير مسافحات ولا متخذات أخدان ) [ النساء : 25 ] .\nثم اختلف المفسرون والعلماء في قوله : ( والمحصنات من الذين أوتوا الكتاب من قبلكم ) هل يعم كل كتابية عفيفة ، سواء كانت حرة أو أمة؟ حكاه ابن جرير عن طائفة من السلف ، ممن فسر المحصنة بالعفيفة . وقيل : المراد بأهل الكتاب هاهنا الإسرائيليات ، وهو مذهب الشافعي . وقيل : المراد بذلك : الذميات دون الحربيات ; لقوله : ( قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر [ ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون ] ) [ التوبة : 29 ]\nوقد كان عبد الله بن عمر لا يرى التزويج بالنصرانية ، ويقول : لا أعلم شركا أعظم من أن تقول : إن ربها عيسى وقد قال الله تعالى : ( ولا تنكحوا المشركات حتى يؤمن ) الآية [ البقرة : 221 ] .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا محمد بن حاتم بن سليمان المؤدب ، حدثنا القاسم بن مالك - يعني المزني - حدثنا إسماعيل بن سميع ، عن أبي مالك الغفاري ، عن ابن عباس قال : لما نزلت هذه الآية : ( ولا تنكحوا المشركات حتى يؤمن ) قال : فحجز الناس عنهن حتى نزلت التي بعدها : ( والمحصنات من الذين أوتوا الكتاب من قبلكم ) فنكح الناس [ من ] نساء أهل الكتاب .\nوقد تزوج جماعة من الصحابة من نساء النصارى ولم يروا بذلك بأسا ، أخذا بهذه الآية الكريمة : ( والمحصنات من الذين أوتوا الكتاب من قبلكم ) فجعلوا هذه مخصصة للآية التي في البقرة : ( ولا تنكحوا المشركات حتى يؤمن ) [ الآية : 221 ] إن قيل بدخول الكتابيات في عمومها ، وإلا فلا معارضة بينها وبينها ; لأن أهل الكتاب قد يفصل في ذكرهم عن المشركين في غير موضع ، كما قال تعالى : ( لم يكن الذين كفروا من أهل الكتاب والمشركين منفكين حتى تأتيهم البينة ) [ البينة : 1 ] وكقوله ( وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا ) الآية [ آل عمران : 20 ] ، وقوله : ( إذا آتيتموهن أجورهن ) أي : مهورهن ، أي : كما هن محصنات عفائف ، فابذلوا لهن المهور عن طيب نفس . وقد أفتى جابر بن عبد الله وإبراهيم النخعي وعامر الشعبي والحسن البصري بأن الرجل إذا نكح امرأة فزنت قبل دخوله بها أنه يفرق بينه وبينها ، وترد عليه ما بذل لها من المهر . رواه ابن جرير عنهم .\nوقوله : ( محصنين غير مسافحين ولا متخذي أخدان ) فكما شرط الإحصان في النساء ، وهي العفة عن الزنا ، كذلك شرطها في الرجال وهو أن يكون الرجل أيضا محصنا عفيفا ; ولهذا قال : ( غير مسافحين ) وهم : الزناة الذين لا يرتدعون عن معصية ، ولا يردون أنفسهم عمن جاءهم ، ( ولا متخذي أخدان ) أي : ذوي العشيقات الذين لا يفعلون إلا معهن ، كما تقدم في سورة النساء سواء ; ولهذا ذهب الإمام أحمد بن حنبل - رحمه الله - إلى أنه لا يصح نكاح المرأة البغي حتى تتوب ، وما دامت كذلك لا يصح تزويجها من رجل عفيف ، وكذلك لا يصح عنده عقد الرجل الفاجر على عفيفة حتى يتوب ويقلع عما هو فيه من الزنا ; لهذه الآية وللحديث الآخر : \" لا ينكح الزاني المجلود إلا مثله . \"\nوقال ابن جرير : حدثنا محمد بن بشار ، حدثنا سليمان بن حرب ، حدثنا أبو هلال ، عن قتادة ، عن الحسن قال : قال عمر بن الخطاب [ رضي الله عنه ] لقد هممت ألا أدع أحدا أصاب فاحشة في الإسلام أن يتزوج محصنة . فقال له أبي بن كعب : يا أمير المؤمنين ، الشرك أعظم من ذلك ، وقد يقبل منه إذا تاب .\nوسيأتي الكلام على هذه المسألة مستقصى [ إن شاء الله تعالى ] عند قوله : ( الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين ) [ النور : 3 ] ; ولهذا قال تعالى هاهنا : ( ومن يكفر بالإيمان فقد حبط عمله وهو في الآخرة من الخاسرين )\n                                    ",
        "qortoby": "ٱلۡيَوۡمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُۖ وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حِلّٞ لَّكُمۡ وَطَعَامُكُمۡ حِلّٞ لَّهُمۡۖ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلۡمُؤۡمِنَٰتِ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّ مُحۡصِنِينَ غَيۡرَ مُسَٰفِحِينَ وَلَا مُتَّخِذِيٓ أَخۡدَانٖۗ وَمَن يَكۡفُرۡ بِٱلۡإِيمَٰنِ فَقَدۡ حَبِطَ عَمَلُهُۥ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ ٥\n                                    \n                                    \n                                    قوله تعالى : اليوم أحل لكم الطيبات وطعام الذين أوتوا الكتاب حل لكم وطعامكم حل لهم والمحصنات من المؤمنات والمحصنات من الذين أوتوا الكتاب من قبلكم إذا آتيتموهن أجورهن محصنين غير مسافحين ولا متخذي أخدان ومن يكفر بالإيمان فقد حبط عمله وهو في الآخرة من الخاسرين\nفيه عشر مسائل :\nالأولى : قوله تعالى : اليوم أحل لكم الطيبات أي : اليوم أكملت لكم دينكم و اليوم أحل لكم الطيبات فأعاد تأكيدا أي : أحل لكم الطيبات التي سألتم عنها ; وكانت الطيبات أبيحت للمسلمين قبل نزول هذه الآية ; فهذا جواب سؤالهم إذ قالوا : ماذا أحل لنا ؟ وقيل : أشار بذكر اليوم إلى وقت محمد صلى الله عليه وسلم كما يقال : هذه أيام فلان ; أي : هذا أوان ظهوركم وشيوع الإسلام ; فقد أكملت بهذا دينكم ، وأحللت لكم الطيبات ، وقد تقدم ذكر الطيبات في الآية قبل هذا .\nالثانية : قوله تعالى : وطعام الذين أوتوا الكتاب حل لكم ابتداء وخبر ، والطعام اسم لما يؤكل والذبائح منه ، وهو هنا خاص بالذبائح عند كثير من أهل العلم بالتأويل ، وأما ما حرم علينا من طعامهم فليس بداخل تحت عموم الخطاب ; قال ابن عباس : قال الله تعالى : ولا تأكلوا مما لم يذكر اسم الله عليه ، ثم استثنى فقال : وطعام الذين أوتوا الكتاب حل لكم يعني ذبيحة اليهودي والنصراني ; وإن كان النصراني يقول عند الذبح : باسم المسيح واليهودي يقول : باسم عزير ; وذلك لأنهم يذبحون على الملة ، وقال عطاء : كل من ذبيحة النصراني وإن قال باسم المسيح ; لأن الله جل وعز قد أباح ذبائحهم ، وقد علم ما يقولون ، وقال القاسم بن مخيمرة : كل من ذبيحته وإن قال‌‌‌‌‌‌‌‌‌‌‌‌ باسم سرجس‌‌‌‌‌‌‌‌‌‌‌‌ - اسم كنيسة لهم - وهو قول الزهري وربيعة والشعبي ومكحول ; وروي عن صحابيين : عن أبي الدرداء وعبادة بن الصامت . وقالت طائفة : إذا سمعت الكتابي يسمي غير اسم الله عز وجل فلا تأكل ; وقال بهذا من الصحابة علي وعائشة وابن عمر ; وهو قول طاوس والحسن متمسكين بقوله تعالى : ولا تأكلوا مما لم يذكر اسم الله عليه وإنه لفسق ، وقال مالك : أكره ذلك ، ولم يحرمه .\nقلت : العجب من إلكيا الطبري الذي حكى الاتفاق على جواز ذبيحة أهل الكتاب ، ثم أخذ يستدل بذلك على أن التسمية على الذبيحة ليست بشرط فقال : ولا شك أنهم لا يسمون على الذبيحة إلا الإله الذي ليس معبودا حقيقة مثل المسيح وعزير ، ولو سموا الإله حقيقة لم تكن تسميتهم على طريق العبادة ، وإنما كان على طريق آخر ; واشتراط التسمية لا على وجه العبادة لا يعقل ، ووجود التسمية من الكافر وعدمها بمثابة واحدة ; إذا لم تتصور منه العبادة ، ولأن النصراني إنما يذبح على اسم المسيح ، وقد حكم الله بحل ذبائحهم مطلقا ، وفي ذلك دليل على أن التسمية لا تشترط أصلا كما يقول الشافعي ، وسيأتي ما في هذا للعلماء في \" الأنعام \" إن شاء الله تعالى .\nالثالثة : ولا خلاف بين العلماء أن ما لا يحتاج إلى ذكاة كالطعام الذي لا محاولة فيه كالفاكهة والبر جائز أكله ; إذ لا يضر فيه تملك أحد . والطعام الذي تقع فيه محاولة على ضربين : أحدهما : ما فيه محاولة صنعة لا تعلق للدين بها ; كخبز الدقيق ، وعصر الزيت ونحوه ; فهذا إن تجنب من الذمي فعلى وجه التقزز ، والضرب الثاني : هي التذكية التي ذكرنا أنها هي التي تحتاج إلى الدين والنية ; فلما كان القياس ألا تجوز ذبائحهم - كما نقول إنهم لا صلاة لهم ولا عبادة مقبولة - رخص الله تعالى في ذبائحهم على هذه الأمة ، وأخرجها النص عن القياس على ما ذكرناه من قول ابن عباس ; والله أعلم .\nالرابعة : واختلف العلماء أيضا فيما ذكوه هل تعمل الذكاة فيما حرم عليهم أو لا ؟ على قولين ; فالجمهور على أنها عاملة في كل الذبيحة ما حل له منها وما حرم عليه ، لأنه مذكى ، وقالت جماعة من أهل العلم : إنما حل لنا من ذبيحتهم ما حل لهم ; لأن ما لا يحل لهم لا تعمل فيه تذكيتهم ; فمنعت هذه الطائفة الطريف والشحوم المحضة من ذبائح أهل الكتاب ; وقصرت لفظ الطعام على البعض ، وحملته الأولى على العموم في جميع ما يؤكل ، وهذا الخلاف موجود في مذهب مالك . قال أبو عمر : وكره مالك شحوم اليهود وأكل ما نحروا من الإبل ، وأكثر أهل العلم لا يرون بذلك بأسا ; وسيأتي هذا في \" الأنعام \" إن شاء الله تعالى ; وكان مالك رحمه الله يكره ما ذبحوه إذا وجد ما ذبحه المسلم ، وكره أن يكون لهم أسواق يبيعون فيها ما يذبحون ; وهذا منه رحمه الله تنزه .\nالخامسة : وأما المجوس فالعلماء مجمعون - إلا من شذ منهم - على أن ذبائحهم لا تؤكل ، ولا يتزوج منهم ; لأنهم ليسوا أهل كتاب على المشهور عند العلماء ، ولا بأس بأكل طعام من لا كتاب له كالمشركين وعبدة الأوثان ما لم يكن من ذبائحهم ولم يحتج إلى ذكاة ; إلا الجبن ; لما فيه من إنفحة الميتة . فإن كان أبو الصبي مجوسيا وأمه كتابية فحكمه حكم أبيه عند مالك ، وعند غيره لا تؤكل ذبيحة الصبي إذا كان أحد أبويه ممن لا تؤكل ذبيحته .\nالسادسة : وأما ذبيحة نصارى بني تغلب وذبائح كل دخيل في اليهودية والنصرانية فكان علي رضي الله عنه ينهى عن ذبائح بني تغلب ; لأنهم عرب ، ويقول : إنهم لم يتمسكوا بشيء من النصرانية إلا بشرب الخمر ; وهو قول الشافعي ; وعلى هذا فليس ينهى عن ذبائح النصارى المحققين منهم ، وقال جمهور الأمة : إن ذبيحة كل نصراني حلال ; سواء كان من بني تغلب أو غيرهم ، وكذلك اليهودي ، واحتج ابن عباس بقوله تعالى : ومن يتولهم منكم فإنه منهم ، فلو لم تكن بنو تغلب من النصارى إلا بتوليهم إياهم لأكلت ذبائحهم .\nالسابعة : ولا بأس بالأكل والشرب والطبخ في آنية الكفار كلهم ، ما لم تكن ذهبا أو فضة أو جلد خنزير بعد أن تغسل وتغلى ; لأنهم لا يتوقون النجاسات ويأكلون الميتات ; فإذا طبخوا في تلك القدور تنجست ، وربما سرت النجاسات في أجزاء قدور الفخار ; فإذا طبخ فيها بعد ذلك توقع مخالطة تلك الأجزاء النجسة للمطبوخ في القدر ثانية ; فاقتضى الورع الكف عنها . وروي عن ابن عباس أنه قال : إن كان الإناء من نحاس أو حديد غسل ، وإن كان من فخار أغلي فيه الماء ثم غسل - هذا إذا احتيج إليه - وقاله مالك ; فأما ما يستعملونه لغير الطبخ فلا بأس باستعماله من غير غسل ; لما روى الدارقطني عن عمر أنه توضأ من بيت نصراني في حق نصرانية ; وهو صحيح وسيأتي في \" الفرقان \" بكماله ، وفي صحيح مسلم من حديث أبي ثعلبة الخشني قال أتيت رسول الله صلى الله عليه وسلم فقلت : يا رسول الله إنا بأرض قوم من أهل كتاب نأكل في آنيتهم ، وأرض صيد ، أصيد بقوسي وأصيد بكلبي المعلم ، وأصيد بكلبي الذي ليس بمعلم ; فأخبرني ما الذي يحل لنا من ذلك ؟ قال : أما ما ذكرت أنكم بأرض قوم من أهل كتاب تأكلون في آنيتهم فإن وجدتم غير آنيتهم فلا تأكلوا فيها وإن لم تجدوا فاغسلوها ثم كلوا فيها ثم ذكر الحديث .\nالثامنة : قوله تعالى : وطعامكم حل لهم دليل على أنهم مخاطبون بتفاصيل شرعنا ; أي : إذا اشتروا منا اللحم يحل لهم اللحم ويحل لنا الثمن المأخوذ منهم .\nالتاسعة : قوله تعالى : والمحصنات من المؤمنات والمحصنات من الذين أوتوا الكتاب من قبلكم الآية . وقد تقدم معناها في \" البقرة \" و \" النساء \" والحمد لله ، وروي عن ابن عباس في قوله تعالى : والمحصنات من الذين أوتوا الكتاب . هو على العهد دون دار الحرب فيكون خاصا ، وقال غيره : يجوز نكاح الذمية والحربية لعموم الآية . وروي عن ابن عباس أنه قال : المحصنات العفيفات العاقلات ، وقال الشعبي : هو أن تحصن فرجها فلا تزني ، وتغتسل من الجنابة ، وقرأ الشعبي \" والمحصنات \" بكسر الصاد ، وبه قرأ الكسائي ، وقال مجاهد : المحصنات الحرائر ; قال أبو عبيد : يذهب إلى أنه لا يحل نكاح إماء أهل الكتاب ; لقوله تعالى : فمن ما ملكت أيمانكم من فتياتكم المؤمنات وهذا القول الذي عليه جلة العلماء .\nالعاشرة : قوله تعالى : ومن يكفر بالإيمان قيل : لما قال تعالى : والمحصنات من الذين أوتوا الكتاب قال : نساء أهل الكتاب : لولا أن الله تعالى رضي ديننا لم يبح لكم نكاحنا ; فنزلت ومن يكفر بالإيمان أي : بما أنزل على محمد . وقال أبو الهيثم : الباء صلة ; أي : ومن يكفر الإيمان أي : يجحده فقد حبط عمله وقرأ ابن السميقع \" فقد حبط \" بفتح الباء ، وقيل : لما ذكرت فرائض وأحكام يلزم القيام بها ، ذكر الوعيد على مخالفتها ; لما في ذلك من تأكيد الزجر عن تضييعها ، وروي عن ابن عباس ومجاهد أن المعنى : ومن يكفر بالله ; قال الحسن بن الفضل : إن صحت هذه الرواية فمعناها برب الإيمان . وقال الشيخ أبو الحسن الأشعري : ولا يجوز أن يسمى الله إيمانا خلافا للحشوية والسالمية ; لأن الإيمان مصدر آمن يؤمن إيمانا ، واسم الفاعل منه مؤمن ; والإيمان التصديق ، والتصديق لا يكون إلا كلاما ، ولا يجوز أن يكون الباري تعالى كلاما .\n                                    ",
        "saadi": "ٱلۡيَوۡمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُۖ وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حِلّٞ لَّكُمۡ وَطَعَامُكُمۡ حِلّٞ لَّهُمۡۖ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلۡمُؤۡمِنَٰتِ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّ مُحۡصِنِينَ غَيۡرَ مُسَٰفِحِينَ وَلَا مُتَّخِذِيٓ أَخۡدَانٖۗ وَمَن يَكۡفُرۡ بِٱلۡإِيمَٰنِ فَقَدۡ حَبِطَ عَمَلُهُۥ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ ٥\n                                        \n                                        \n                                        \n                                        كرر تعالى إحلال الطيبات لبيان الامتنان، ودعوة للعباد إلى شكره والإكثار من ذكره، حيث أباح لهم ما تدعوهم الحاجة إليه، ويحصل لهم الانتفاع به من الطيبات. { وَطَعَامُ الَّذِينَ أُوتُوا الْكِتَابَ حِلٌّ لَّكُمْ ْ} أي: ذبائح اليهود والنصارى حلال لكم -يا معشر المسلمين- دون باقي الكفار، فإن ذبائحهم لا تحل للمسلمين، وذلك لأن أهل الكتاب ينتسبون إلى الأنبياء والكتب. وقد اتفق الرسل كلهم على تحريم الذبح لغير الله، لأنه شرك، فاليهود والنصارى يتدينون بتحريم الذبح لغير الله، فلذلك أبيحت ذبائحهم دون غيرهم. والدليل على أن المراد بطعامهم ذبائحهم، أن الطعام الذي ليس من الذبائح كالحبوب والثمار ليس لأهل الكتاب فيه خصوصية، بل يباح ذلك ولو كان من طعام غيرهم. وأيضا فإنه أضاف الطعام إليهم. فدل ذلك، على أنه كان طعاما، بسبب ذبحهم. ولا يقال: إن ذلك للتمليك، وأن المراد: الطعام الذي يملكون. لأن هذا، لا يباح على وجه الغصب، ولا من المسلمين. { وَطَعَامُكُمْ ْ} أيها المسلمون { حِلٌّ لَّهُمْ ْ} أي: يحل لكم أن تطعموهم إياه { وَ ْ} أحل لكم { الْمُحْصَنَاتِ ْ} أي: الحرائر العفيفات { مِنَ الْمُؤْمِنَاتِ ْ} والحرائر العفيفات { مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلِكُمْ ْ} أي: من اليهود والنصارى. وهذا مخصص لقوله تعالى { وَلَا تَنكِحُوا الْمُشْرِكَاتِ حَتَّى يُؤْمِنَّ ْ} ومفهوم الآية، أن الأرقاء من المؤمنات لا يباح نكاحهن للأحرار, وهو كذلك. وأما الكتابيات فعلى كل حال لا يبحن، ولا يجوز نكاحهن للأحرار مطلقا، لقوله تعالى: { مِن فَتَيَاتِكُمُ الْمُؤْمِنَاتِ ْ} وأما المسلمات إذا كن رقيقات فإنه لا يجوز للأحرار نكاحهن إلا بشرطين، عدم الطول وخوف العنت. وأما الفاجرات غير العفيفات عن الزنا فلا يباح نكاحهن، سواء كن مسلمات أو كتابيات، حتى يتبن لقوله تعالى: { الزَّانِي لَا يَنكِحُ إلَّا زَانِيَةً أَوْ مُشْرِكَةً ْ} الآية. وقوله: { إِذَا آتَيْتُمُوهُنَّ أُجُورَهُنَّ ْ} أي: أبحنا لكم نكاحهن، إذا أعطيتموهن مهورهن، فمن عزم على أن لا يؤتيها مهرها فإنها لا تحل له. وأمر بإيتائها إذا كانت رشيدة تصلح للإيتاء، وإلا أعطاه الزوج لوليها. وإضافة الأجور إليهن دليل على أن المرأة تملك جميع مهرها، وليس لأحد منه شيء، إلا ما سمحت به لزوجها أو وليها أو غيرهما. { مُحْصِنِينَ غَيْرَ مُسَافِحِينَ ْ} أي: حالة كونكم -أيها الأزواج- محصنين لنسائكم، بسبب حفظكم لفروجكم عن غيرهن. { غَيْرَ مُسَافِحِينَ ْ} أي: زانين مع كل أحد { وَلَا مُتَّخِذِي أَخْدَانٍ ْ} وهو: الزنا مع العشيقات، لأن الزناة في الجاهلية، منهم من يزني مع من كان، فهذا المسافح. ومنهم من يزني مع خدنه ومحبه. فأخبر الله تعالى أن ذلك كله ينافي العفة، وأن شرط التزوج أن يكون الرجل عفيفا عن الزنا. وقوله تعالى: { وَمَن يَكْفُرْ بِالْإِيمَانِ فَقَدْ حَبِطَ عَمَلُهُ ْ} أي: ومن كفر بالله تعالى، وما يجب الإيمان به من كتبه ورسله أو شيء من الشرائع، فقد حبط عمله، بشرط أن يموت على كفره، كما قال تعالى: { وَمَن يَرْتَدِدْ مِنكُمْ عَن دِينِهِ فَيَمُتْ وَهُوَ كَافِرٌ فَأُولَئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ ْ} { وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ ْ} أي: الذين خسروا أنفسهم وأموالهم وأهليهم يوم القيامة، وحصلوا على الشقاوة الأبدية.\n                                    "
      },
      "originalText": "ٱلۡيَوۡمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُۖ وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حِلّٞ لَّكُمۡ وَطَعَامُكُمۡ حِلّٞ لَّهُمۡۖ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلۡمُؤۡمِنَٰتِ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّ مُحۡصِنِينَ غَيۡرَ مُسَٰفِحِينَ وَلَا مُتَّخِذِيٓ أَخۡدَانٖۗ وَمَن يَكۡفُرۡ بِٱلۡإِيمَٰنِ فَقَدۡ حَبِطَ عَمَلُهُۥ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ ٥"
    }
  ]
}