{
  "number": 108,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 675,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ وَإِنْ كُنْتُمْ جُنُبًا فَاطَّهَّرُوا ۚ وَإِنْ كُنْتُمْ مَرْضَىٰ أَوْ عَلَىٰ سَفَرٍ أَوْ جَاءَ أَحَدٌ مِنْكُمْ مِنَ الْغَائِطِ أَوْ لَامَسْتُمُ النِّسَاءَ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُمْ مِنْهُ ۚ مَا يُرِيدُ اللَّهُ لِيَجْعَلَ عَلَيْكُمْ مِنْ حَرَجٍ وَلَٰكِنْ يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 6,
      "juz": 6,
      "manzil": 2,
      "page": 108,
      "ruku": 87,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قُمۡتُمۡ إِلَى ٱلصَّلَوٰةِ فَٱغۡسِلُواْ وُجُوهَكُمۡ وَأَيۡدِيَكُمۡ إِلَى ٱلۡمَرَافِقِ وَٱمۡسَحُواْ بِرُءُوسِكُمۡ وَأَرۡجُلَكُمۡ إِلَى ٱلۡكَعۡبَيۡنِۚ وَإِن كُنتُمۡ جُنُبٗا فَٱطَّهَّرُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُم مِّنۡهُۚ مَا يُرِيدُ ٱللَّهُ لِيَجۡعَلَ عَلَيۡكُم مِّنۡ حَرَجٖ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمۡ وَلِيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ ٦\n                                    \n                                    \n                                    قال كثيرون من السلف : قوله : ( إذا قمتم إلى الصلاة ) معناه وأنتم محدثون .\nوقال آخرون : إذا قمتم من النوم إلى الصلاة ، وكلاهما قريب .\nوقال آخرون : بل المعنى أعم من ذلك ، فالآية آمرة بالوضوء عند القيام إلى الصلاة ، ولكن هو في حق المحدث على سبيل الإيجاب ، وفي حق المتطهر على سبيل الندب والاستحباب . وقد قيل : إن الأمر بالوضوء لكل صلاة كان واجبا في ابتداء الإسلام ، ثم نسخ .\nقال الإمام أحمد بن حنبل : حدثنا عبد الرحمن ، حدثنا سفيان ، عن علقمة بن مرثد ، عن سليمان بن بريدة عن أبيه قال : كان النبي صلى الله عليه وسلم يتوضأ عند كل صلاة ، فلما كان يوم الفتح توضأ ومسح على خفيه ، وصلى الصلوات بوضوء واحد . فقال له عمر : يا رسول الله ، إنك فعلت شيئا لم تكن تفعله؟ قال : \" إني عمدا فعلته يا عمر .\nوهكذا رواه مسلم وأهل السنن من حديث سفيان الثوري ، عن علقمة بن مرثد ووقع في سنن ابن ماجه ، عن سفيان عن محارب بن دثار - بدل علقمة بن مرثد - كلاهما عن سليمان بن بريدة به وقال الترمذي : حسن صحيح .\nوقال ابن جرير : حدثنا محمد بن عباد بن موسى ، أخبرنا زياد بن عبد الله بن الطفيل البكائي ، حدثنا الفضل بن المبشر قال : رأيت جابر بن عبد الله يصلي الصلوات بوضوء واحد ، فإذا بال أو أحدث توضأ ومسح بفضل طهوره الخفين . فقلت : أبا عبد الله ، شيء تصنعه برأيك؟ قال : بل رأيت النبي صلى الله عليه وسلم يصنعه ، فأنا أصنعه ، كما رأيت رسول الله [ صلى الله عليه وسلم ] يصنع .\nوكذا رواه ابن ماجه عن إسماعيل بن توبة عن زياد البكائي به وقال أحمد : حدثنا يعقوب حدثنا أبي ، عن ابن إسحاق ، حدثني محمد بن يحيى بن حبان الأنصاري ، عن عبيد الله بن عبد الله بن عمر قال : قلت له : أرأيت وضوء عبد الله بن عمر لكل صلاة طاهرا كان أو غير طاهر ، عمن هو؟ قال : حدثته أسماء بنت زيد بن الخطاب ; أن عبد الله بن حنظلة بن أبي عامر بن الغسيل حدثها ، أن رسول الله صلى الله عليه وسلم كان أمر بالوضوء لكل صلاة طاهرا كان أو غير طاهر ، فلما شق ذلك على رسول الله صلى الله عليه وسلم أمر بالسواك عند كل صلاة ووضع عنه الوضوء ، إلا من حدث . فكان عبد الله يرى أن به قوة على ذلك ، كان يفعله حتى مات .\nوكذا رواه أبو داود ، عن محمد بن عوف الحمصي ، عن أحمد بن خالد الذهبي ، عن محمد بن إسحاق ، عن محمد بن يحيى بن حبان ، عن عبد الله بن عبد الله بن عمر ثم قال أبو داود : ورواه إبراهيم بن سعد ، عن محمد بن إسحاق فقال : عبيد الله بن عبد الله بن عمر ، يعني كما تقدم في رواية الإمام أحمد .\nوأيا ما كان فهو إسناد صحيح ، وقد صرح ابن إسحاق فيه بالتحديث والسماع من محمد بن يحيى بن حبان ، فزال محذور التدليس . لكن قال الحافظ ابن عساكر : رواه سلمة بن الفضل وعلي بن مجاهد ، عن ابن إسحاق ، عن محمد بن طلحة بن يزيد بن ركانة ، عن محمد بن يحيى بن حبان ، به ، والله أعلم . وفي فعل ابن عمر هذا ، ومداومته على إسباغ الوضوء لكل صلاة دلالة على استحباب ذلك ، كما هو مذهب الجمهور . .\nوقال ابن جرير : حدثنا زكريا بن يحيى بن أبي زائدة ، حدثنا أزهر عن ابن عون ، عن ابن سيرين : أن الخلفاء كانوا يتوضئون لكل صلاة .\nوقال ابن جرير : حدثنا محمد بن المثنى حدثنا محمد بن جعفر ، حدثنا شعبة سمعت مسعود بن علي الشيباني ، سمعت عكرمة يقول : كان علي رضي الله عنه ، يتوضأ عند كل صلاة ، ويقرأ هذه الآية : ( يا أيها الذين آمنوا إذا قمتم إلى الصلاة ) الآية .\nوحدثنا ابن المثنى ، حدثني وهب بن جرير ، أخبرنا شعبة عن عبد الملك بن ميسرة ، عن النزال بن سبرة قال : رأيت عليا صلى الظهر ، ثم قعد للناس في الرحبة ، ثم أتي بماء فغسل وجهه ويديه ، ثم مسح برأسه ورجليه ، وقال هذا وضوء من لم يحدث .\nوحدثني يعقوب بن إبراهيم ، حدثنا هشيم عن مغيرة عن إبراهيم ; أن عليا اكتال من حب ، فتوضأ وضوءا فيه تجوز فقال : هذا وضوء من لم يحدث \" . وهذه طرق جيدة عن علي [ رضي الله عنه ] يقوي بعضها بعضا .\nوقال ابن جرير أيضا : حدثنا ابن بشار ، حدثنا ابن أبي عدي ، عن حميد عن أنس قال : توضأ عمر بن الخطاب وضوءا فيه تجوز ، خفيفا ، فقال هذا وضوء من لم يحدث . وهذا إسناد صحيح .\nوقال محمد بن سيرين : كان الخلفاء يتوضئون لكل صلاة .\nوأما ما رواه أبو داود الطيالسي ، عن أبي هلال ، عن قتادة عن سعيد بن المسيب أنه قال : الوضوء من غير حدث اعتداء . فهو غريب عن سعيد بن المسيب ، ثم هو محمول على أن من اعتقد وجوبه فهو معتد ، وأما مشروعيته استحبابا فقد دلت السنة على ذلك .\nوقال الإمام أحمد : حدثنا عبد الرحمن بن مهدي ، حدثنا سفيان عن عمرو بن عامر الأنصاري ، سمعت أنس بن مالك يقول : كان النبي صلى الله عليه وسلم يتوضأ عند كل صلاة ، قال : قلت فأنتم كيف كنتم تصنعون؟ قال : كنا نصلي الصلوات بوضوء واحد ما لم نحدث .\nوقد رواه البخاري وأهل السنن من غير وجه عن عمرو بن عامر به .\nوقال ابن جرير : حدثني أبو سعيد البغدادي ، حدثنا إسحاق بن منصور ، عن هريم عن عبد الرحمن بن زياد - هو الإفريقي - عن أبي غطيف ، عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : \" من توضأ على طهر كتب له عشر حسنات \" .\nورواه أيضا من حديث عيسى بن يونس ، عن الإفريقي عن أبي غطيف ، عن ابن عمر ، فذكره ، وفيه قصة .\nوهكذا رواه أبو داود والترمذي وابن ماجه من حديث الإفريقي به نحوه وقال الترمذي : وهو إسناد ضعيف .\nقال ابن جرير : وقد قال قوم : إن هذه الآية نزلت إعلاما من الله أن الوضوء لا يجب إلا عند القيام إلى الصلاة ، دون غيرها من الأعمال ; وذلك لأنه عليه السلام كان إذا أحدث امتنع من الأعمال كلها حتى يتوضأ .\nحدثنا أبو كريب ، حدثنا معاوية بن هشام ، عن سفيان عن جابر ، عن عبد الله بن أبي بكر بن عمرو بن حزم ، عن عبد الله بن علقمة بن الفغواء ، عن أبيه ، قال : كان رسول الله صلى الله عليه وسلم إذا أراق البول نكلمه فلا يكلمنا ، ونسلم عليه فلا يرد علينا ، حتى نزلت آية الرخصة : ( يا أيها الذين آمنوا إذا قمتم إلى الصلاة ) الآية .\nورواه ابن أبي حاتم عن محمد بن مسلم عن أبي كريب ، به نحوه . وهو حديث غريب جدا وجابر هذا هو ابن يزيد الجعفي ، ضعفوه .\nوقال أبو داود : حدثنا مسدد حدثنا إسماعيل حدثنا أيوب عن عبد الله بن أبي مليكة ، عن عبد الله بن عباس ; أن رسول الله صلى الله عليه وسلم خرج من الخلاء ، فقدم إليه طعام ، فقالوا : ألا نأتيك بوضوء . فقال : \" إنما أمرت بالوضوء إذا قمت إلى الصلاة .\nوكذا رواه الترمذي عن أحمد بن منيع والنسائي عن زياد بن أيوب ، عن إسماعيل - وهو ابن علية - به وقال الترمذي : هذا حديث حسن .\nوروى مسلم عن أبي بكر بن أبي شيبة ، عن سفيان بن عيينة ، عن عمرو بن دينار ، عن سعيد بن الحويرث ، عن ابن عباس قال : كنا عند النبي صلى الله عليه وسلم فأتى الخلاء ، ثم إنه رجع فأتي بطعام ، فقيل : يا رسول الله ، ألا تتوضأ؟ فقال : \" لم؟ أأصلي فأتوضأ؟ \" .\nوقوله : ( فاغسلوا وجوهكم ) قد استدل طائفة من العلماء بقوله : ( إذا قمتم إلى الصلاة فاغسلوا وجوهكم ) على وجوب النية في الوضوء ; لأن تقدير الكلام : \" إذا قمتم إلى الصلاة فاغسلوا وجوهكم لها \" ، كما تقول العرب : \" إذا رأيت الأمير فقم \" أي : له . وقد ثبت في الصحيحين حديث : \" الأعمال بالنيات ، وإنما لكل امرئ ما نوى \" . ويستحب قبل غسل الوجه أن يذكر اسم الله تعالى على وضوئه ; لما ورد في الحديث من طرق جيدة ، عن جماعة من الصحابة ، عن النبي صلى الله عليه وسلم أنه قال : \" لا وضوء لمن لم يذكر اسم الله عليه \" .\nويستحب أن يغسل كفيه قبل إدخالهما في الإناء ويتأكد ذلك عند القيام من النوم ; لما ثبت في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : \" إذا استيقظ أحدكم من نومه ، فلا يدخل يده في الإناء قبل أن يغسلها ثلاثا ، فإن أحدكم لا يدري أين باتت يده \" .\nوحد الوجه عند الفقهاء : ما بين منابت شعر الرأس - ولا اعتبار بالصلع ولا بالغمم - إلى منتهى اللحيين والذقن طولا ومن الأذن إلى الأذن عرضا ، وفي النزعتين والتحذيف خلاف ، هل هما من الرأس أو الوجه ، وفي المسترسل من اللحية عن محل الفرض قولان ، أحدهما : أنه يجب إفاضة الماء عليه لأنه تقع به المواجهة . وروي في حديث : أن النبي صلى الله عليه وسلم رأى رجلا مغطيا لحيته ، فقال : \" اكشفها ، فإن اللحية من الوجه \" وقال مجاهد : هي من الوجه ، ألا تسمع إلى قول العرب في الغلام إذا نبتت لحيته : طلع وجهه .\nويستحب للمتوضئ أن يخلل لحيته إذا كانت كثة ، قال الإمام أحمد : حدثنا عبد الرزاق ، حدثنا إسرائيل عن عامر بن شقيق بن جمرة ، عن أبي وائل قال : رأيت عثمان توضأ - فذكر الحديث - قال : وخلل اللحية ثلاثا حين غسل وجهه ثم قال : رأيت رسول الله صلى الله عليه وسلم فعل الذي رأيتموني فعلت .\nرواه الترمذي وابن ماجه من حديث عبد الرزاق وقال الترمذي : حسن صحيح ، وحسنه البخاري .\nوقال أبو داود : حدثنا أبو توبة الربيع بن نافع ، حدثنا أبو المليح ، حدثنا الوليد بن زوران عن أنس بن مالك ; أن رسول الله صلى الله عليه وسلم كان إذا توضأ أخذ كفا من ماء فأدخله تحت حنكه ، يخلل به لحيته ، وقال : \" هكذا أمرني به ربي عز وجل .\nتفرد به أبو داود وقد روي هذا من غير وجه عن أنس . قال البيهقي : وروينا في تخليل اللحية عن عمار وعائشة وأم سلمة عن النبي صلى الله عليه وسلم ، ثم عن علي وغيره ، وروينا في الرخصة في تركه عن ابن عمر والحسن بن علي ، ثم عن النخعي وجماعة من التابعين .\nوقد ثبت عن النبي صلى الله عليه وسلم من غير وجه في الصحاح وغيرها : أنه كان إذا توضأ تمضمض واستنشق ، فاختلف الأئمة في ذلك : هل هما واجبان في الوضوء والغسل ، كما هو مذهب أحمد بن حنبل ، رحمه الله؟ أو مستحبان فيهما ، كما هو مذهب الشافعي ومالك؟ لما ثبت في الحديث الذي رواه أهل السنن وصححه ابن خزيمة ، عن رفاعة بن رافع الزرقي ; أن النبي صلى الله عليه وسلم قال للمسيء في صلاته : \" توضأ كما أمرك الله \" أو يجبان في الغسل دون الوضوء ، كما هو مذهب أبي حنيفة ؟ أو يجب الاستنشاق دون المضمضة كما هو رواية عن الإمام أحمد لما ثبت في الصحيحين ، أن رسول الله صلى الله عليه وسلم قال : \" من توضأ فليستنثر \" وفي رواية : \" إذا توضأ أحدكم فليجعل في منخريه من الماء ثم لينتثر \" والانتثار : هو المبالغة في الاستنشاق .\nوقال الإمام أحمد : حدثنا أبو سلمة الخزاعي ، حدثنا سليمان بن بلال ، عن زيد بن أسلم ، عن عطاء بن يسار ، عن ابن عباس ; أنه توضأ فغسل وجهه ، ثم أخذ غرفة من ماء فتمضمض بها واستنثر ، ثم أخذ غرفة فجعل بها هكذا ، يعني أضافها إلى يده الأخرى ، فغسل بهما وجهه . ثم أخذ غرفة من ماء ، فغسل بها يده اليمنى ، ثم أخذ غرفة من ماء فغسل بها يده اليسرى ، ثم مسح رأسه ، ثم أخذ غرفة من ماء ، ثم رش على رجله اليمنى حتى غسلها ، ثم أخذ غرفة أخرى فغسل بها رجله اليسرى ، ثم قال : هكذا رأيت رسول الله صلى الله عليه وسلم ، يعني يتوضأ .\nورواه البخاري عن محمد بن عبد الرحيم ، عن أبي سلمة منصور بن سلمة الخزاعي ، به .\nوقوله : ( وأيديكم إلى المرافق ) أي : مع المرافق ، كما قال تعالى : ( ولا تأكلوا أموالهم إلى أموالكم إنه كان حوبا كبيرا ) [ النساء : 2 ]\nوقد روى الحافظ الدارقطني وأبو بكر البيهقي ، من طريق القاسم بن محمد ، عن عبد الله بن محمد بن عقيل ، عن جده ، عن جابر بن عبد الله قال : كان رسول الله صلى الله عليه وسلم إذا توضأ أدار الماء على مرفقيه . ولكن القاسم هذا متروك الحديث ، وجده ضعيف ، والله أعلم .\nويستحب للمتوضئ أن يشرع في العضد ليغسله مع ذراعيه ; لما روى البخاري ومسلم من حديث نعيم المجمر ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" إن أمتي يدعون يوم القيامة غرا محجلين من آثار الوضوء ، فمن استطاع منكم أن يطيل غرته فليفعل \" .\nوفي صحيح مسلم : عن قتيبة عن خلف بن خليفة ، عن أبي مالك الأشجعي ، عن أبي حازم ، عن أبي هريرة قال : سمعت خليلي صلى الله عليه وسلم يقول : \" تبلغ الحلية من المؤمن حيث يبلغ الوضوء \" .\nوقوله : ( وامسحوا برءوسكم ) اختلفوا في هذه \" الباء \" هل هي للإلصاق ، وهو الأظهر أو للتبعيض؟ وفيه نظر على قولين . ومن الأصوليين من قال : هذا مجمل فليرجع في بيانه إلى السنة ، وقد ثبت في الصحيحين من طريق مالك عن عمرو بن يحيى المازني عن أبيه ، أن رجلا قال لعبد الله بن زيد بن عاصم - وهو جد عمرو بن يحيى ، وكان من أصحاب النبي صلى الله عليه وسلم - : هل تستطيع أن تريني كيف كان رسول الله صلى الله عليه وسلم يتوضأ؟ فقال عبد الله بن زيد : نعم ، فدعا بوضوء ، فأفرغ على يديه ، فغسل يديه مرتين مرتين ، ثم مضمض واستنشق ثلاثا ، وغسل وجهه ثلاثا ، ثم غسل يديه مرتين مرتين إلى المرفقين ، ثم مسح بيديه ، فأقبل بهما وأدبر ، بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ، ثم ردهما حتى رجع إلى المكان الذي بدأ منه ، ثم غسل رجليه .\nوفي حديث عبد خير ، عن علي في صفة وضوء رسول الله صلى الله عليه وسلم نحو هذا ، وروى أبو داود ، عن معاوية والمقدام بن معد يكرب ، في صفة وضوء رسول الله صلى الله عليه وسلم مثله .\nففي هذه الأحاديث دلالة لمن ذهب إلى وجوب تكميل مسح جميع الرأس ، كما هو مذهب الإمام مالك وأحمد بن حنبل ، لا سيما على قول من زعم أنها خرجت مخرج البيان لما أجمل في القرآن .\nوقد ذهب الحنفية إلى وجوب مسح ربع الرأس ، وهو مقدار الناصية .\nوذهب أصحابنا إلى أنه إنما يجب ما يطلق عليه اسم مسح ، لا يتقدر ذلك بحد ، بل لو مسح بعض شعره من رأسه أجزأه .\nواحتج الفريقان بحديث المغيرة بن شعبة ، قال : تخلف النبي صلى الله عليه وسلم فتخلفت معه ، فلما قضى حاجته قال : \" هل معك ماء؟ \" فأتيته بمطهرة فغسل كفيه ووجهه ، ثم ذهب يحسر عن ذراعيه فضاق كم الجبة ، فأخرج يديه من تحت الجبة وألقى الجبة على منكبيه فغسل ذراعيه ومسح بناصيته ، وعلى العمامة وعلى خفيه . . . وذكر باقي الحديث ، وهو في صحيح مسلم وغيره .\nفقال لهم أصحاب الإمام أحمد : إنما اقتصر على مسح الناصية لأنه كمل مسح بقية الرأس على العمامة ، ونحن نقول بذلك ، وأنه يقع عن الموقع كما وردت بذلك أحاديث كثيرة ، وأنه كان يمسح على العمامة وعلى الخفين ، فهذا أولى ، وليس لكم فيه دلالة على جواز الاقتصار على مسح الناصية أو بعض الرأس من غير تكميل على العمامة ، والله أعلم .\nثم اختلفوا في أنه : هل يستحب تكرار مسح الرأس ثلاثا ، كما هو المشهور من مذهب الشافعي أو إنما يستحب مسحة واحدة ، كما هو مذهب أحمد بن حنبل ومن تابعه ، على قولين . فقال عبد الرزاق : عن معمر عن الزهري عن عطاء بن يزيد الليثي ، عن حمران بن أبان قال : رأيت عثمان بن عفان توضأ فأفرغ على يديه ثلاثا فغسلهما ، ثم مضمض واستنشق ، ثم غسل وجهه ثلاثا ، ثم غسل يده اليمنى إلى المرفق ثلاثا ، ثم غسل اليسرى مثل ذلك ، ثم مسح برأسه ، ثم غسل قدمه اليمنى ثلاثا ، ثم اليسرى ثلاثا مثل ذلك ثم قال : رأيت رسول الله صلى الله عليه وسلم توضأ نحو وضوئي هذا ، ثم قال : \" من توضأ نحو وضوئي هذا ، ثم صلى ركعتين لا يحدث فيهما نفسه ، غفر له ما تقدم من ذنبه \" .\nأخرجه البخاري ومسلم في الصحيحين من طريق الزهري به نحو هذا وفي سنن أبي داود من رواية عبد الله بن عبيد الله بن أبي مليكة ، عن عثمان في صفة الوضوء : ومسح برأسه مرة واحدة ، وكذا من رواية عبد خير ، عن علي مثله .\nواحتج من استحب تكرار مسح الرأس بعموم الحديث الذي رواه مسلم في صحيحه ، عن عثمان رضي الله عنه ، أن رسول الله صلى الله عليه وسلم : توضأ ثلاثا ثلاثا .\nوقال أبو داود : حدثنا محمد بن المثنى ، حدثنا الضحاك بن مخلد ، حدثنا عبد الرحمن بن وردان ، حدثني أبو سلمة بن عبد الرحمن ، حدثني حمران قال : رأيت عثمان بن عفان توضأ . فذكر نحوه ، ولم يذكر المضمضة والاستنشاق ، قال فيه : ثم مسح رأسه ثلاثا ، ثم غسل رجليه ثلاثا ، ثم قال : رأيت رسول الله صلى الله عليه وسلم توضأ هكذا ، وقال : \" من توضأ دون هذا كفاه .\nتفرد به أبو داود ثم قال : وأحاديث عثمان الصحاح تدل على أنه مسح الرأس مرة واحدة .\nوقوله : ( وأرجلكم إلى الكعبين ) قرئ : ( وأرجلكم ) بالنصب عطفا على ( فاغسلوا وجوهكم وأيديكم )\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا أبو سلمة ، حدثنا وهيب عن خالد عن عكرمة عن ابن عباس ; أنه قرأها : ( وأرجلكم ) يقول : رجعت إلى الغسل .\nوروي عن عبد الله بن مسعود وعروة وعطاء وعكرمة والحسن ومجاهد وإبراهيم والضحاك والسدي ومقاتل بن حيان والزهري وإبراهيم التيمي ، نحو ذلك .\nوهذه قراءة ظاهرة في وجوب الغسل ، كما قاله السلف ، ومن هاهنا ذهب من ذهب إلى وجوب الترتيب كما هو مذهب الجمهور ، خلافا لأبي حنيفة حيث لم يشترط الترتيب ، بل لو غسل قدميه ثم مسح رأسه وغسل يديه ثم وجهه أجزأه ذلك ; لأن الآية أمرت بغسل هذه الأعضاء ، و \" الواو \" لا تدل على الترتيب . وقد سلك الجمهور في الجواب عن هذا البحث طرقا ، فمنهم من قال : الآية دلت على وجوب غسل الوجه ابتداء عند القيام إلى الصلاة ; لأنه مأمور به بفاء التعقيب ، وهي مقتضية للترتيب ، ولم يقل أحد من الناس بوجوب غسل الوجه أولا ثم لا يجب الترتيب بعده ، بل القائل اثنان ، أحدهما : يوجب الترتيب ، كما هو واقع في الآية . والآخر يقول : لا يجب الترتيب مطلقا ، والآية دلت على وجوب غسل الوجه ابتداء ، فوجب الترتيب فيما بعده بالإجماع ، حيث لا فارق . ومنهم من قال : لا نسلم أن \" الواو \" لا تدل على الترتيب ، بل هي دالة - كما هو مذهب طائفة من النحاة وأهل اللغة وبعض الفقهاء . ثم نقول - بتقدير تسليم كونها لا تدل على الترتيب اللغوي - : هي دالة على الترتيب شرعا فيما من شأنه أن يرتب ، والدليل على ذلك أنه صلى الله عليه وسلم لما طاف بالبيت ، خرج من باب الصفا وهو يتلو قوله تعالى : ( إن الصفا والمروة من شعائر الله ) [ البقرة : 158 ] ثم قال : \" ابدأ بما بدأ الله به \" لفظ مسلم ولفظ النسائي : \" ابدءوا بما بدأ الله به \" . وهذا لفظ أمر ، وإسناده صحيح ، فدل على وجوب البداءة بما بدأ الله به ، وهو معنى كونها تدل على الترتيب شرعا ، والله أعلم .\nومنهم من قال : لما ذكر تعالى هذه الصفة في هذه الآية على هذا الترتيب ، فقطع النظير عن النظير ، وأدخل الممسوح بين المغسولين ، دل ذلك على إرادة الترتيب .\nومنهم من قال : لا شك أنه قد روى أبو داود وغيره من طريق عمرو بن شعيب ، عن أبيه ، عن جده ; أن رسول الله صلى الله عليه وسلم توضأ مرة مرة ، ثم قال : \" هذا وضوء لا يقبل الله الصلاة إلا به \" قالوا : فلا يخلو إما أن يكون توضأ مرتبا فيجب الترتيب ، أو يكون توضأ غير مرتب فيجب عدم الترتيب ، ولا قائل به ، فوجب ما ذكره .\nوأما القراءة الأخرى ، وهي قراءة من قرأ : ( وأرجلكم ) بالخفض . فقد احتج بها الشيعة في قولهم بوجوب مسح الرجلين ; لأنها عندهم معطوفة على مسح الرأس . وقد روي عن طائفة من السلف ما يوهم القول بالمسح ، فقال ابن جرير :\nحدثني يعقوب بن إبراهيم ، حدثنا ابن علية ، حدثنا حميد قال : قال موسى بن أنس لأنس ونحن عنده : يا أبا حمزة ، إن الحجاج خطبنا بالأهواز ونحن معه ، فذكر الطهور ، فقال : اغسلوا وجوهكم وأيديكم ، وامسحوا برءوسكم وأرجلكم ، وأنه ليس شيء من ابن آدم أقرب من خبثه من قدميه ، فاغسلوا بطونهما ، وظهورهما عراقيبهما ، فقال أنس : صدق الله وكذب الحجاج ، قال الله [ تعالى ] ( وامسحوا برءوسكم وأرجلكم ) قال : وكان أنس إذا مسح قدميه بلهما إسناد صحيح إليه .\nوقال ابن جرير : حدثنا علي بن سهل ، حدثنا مؤمل حدثنا حماد حدثنا عاصم الأحول ، عن أنس قال : نزل القرآن بالمسح ، والسنة الغسل . وهذا أيضا إسناد صحيح .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا محمد بن قيس الخراساني ، عن ابن جريج ، عن عمرو بن دينار ، عن عكرمة عن ابن عباس قال : الوضوء غسلتان ومسحتان .\nوكذا روى سعيد بن أبي عروبة ، عن قتادة .\nوقال ابن أبي حاتم : حدثني أبي ، حدثنا أبو معمر المنقري ، حدثنا عبد الوهاب ، حدثنا علي بن زيد ، عن يوسف بن مهران ، عن ابن عباس : ( وامسحوا برءوسكم وأرجلكم إلى الكعبين ) قال : هو المسح . ثم قال : وروي عن ابن عمر وعلقمة وأبي جعفر ، [ و ] محمد بن علي والحسن - في إحدى الروايات - وجابر بن زيد ومجاهد - في إحدى الروايات - نحوه .\nوقال ابن جرير : حدثنا يعقوب حدثنا ابن علية ، حدثنا أيوب قال : رأيت عكرمة يمسح على رجليه ، قال : وكان يقوله .\nوقال ابن جرير : حدثني أبو السائب ، حدثنا ابن إدريس ، عن داود بن أبي هند ، عن الشعبي قال : نزل جبريل بالمسح . ثم قال الشعبي : ألا ترى أن \" التيمم \" أن يمسح ما كان غسلا ويلغي ما كان مسحا؟\nوحدثنا ابن أبي زياد ، حدثنا يزيد أخبرنا إسماعيل قلت لعامر : إن ناسا يقولون : إن جبريل نزل بغسل الرجلين؟ فقال : نزل جبريل بالمسح .\nفهذه آثار غريبة جدا ، وهي محمولة على أن المراد بالمسح هو الغسل الخفيف ، لما سنذكره من السنة الثابتة في وجوب غسل الرجلين . وإنما جاءت هذه القراءة بالخفض إما على المجاورة وتناسب الكلام ، كما في قول العرب : \" جحر ضب خرب \" ، وكقوله تعالى : ( عاليهم ثياب سندس خضر وإستبرق ) [ الإنسان : 21 ] وهذا سائغ ذائع ، في لغة العرب شائع . ومنهم من قال : هي محمولة على مسح القدمين إذا كان عليهما الخفان ، قاله أبو عبد الله الشافعي ، رحمه الله . ومنهم من قال : هي دالة على مسح الرجلين ، ولكن المراد بذلك الغسل الخفيف ، كما وردت به السنة . وعلى كل تقدير فالواجب غسل الرجلين فرضا ، لا بد منه للآية والأحاديث التي سنوردها .\nومن أحسن ما يستدل به على أن المسح يطلق على الغسل الخفيف ما رواه الحافظ البيهقي ، حيث قال : أخبرنا أبو علي الروذباري ، حدثنا أبو بكر محمد بن أحمد بن محمويه العسكري ، حدثنا جعفر بن محمد القلانسي ، حدثنا آدم حدثنا شعبة حدثنا عبد الملك بن ميسرة ، سمعت النزال بن سبرة يحدث عن علي بن أبي طالب ، أنه صلى الظهر ، ثم قعد في حوائج الناس في رحبة الكوفة حتى حضرت صلاة العصر ، ثم أتي بكوز من ماء ، فأخذ منه حفنة واحدة ، فمسح بها وجهه ويديه ورأسه ورجليه ، ثم قام فشرب فضله وهو قائم ، ثم قال : إن ناسا يكرهون الشرب قائما ، وإن رسول الله [ صلى الله عليه وسلم ] صنع ما صنعت . وقال : \" هذا وضوء من لم يحدث \" .\nرواه البخاري في الصحيح ، عن آدم ببعض معناه .\nومن أوجب من الشيعة مسحهما كما يمسح الخف ، فقد ضل وأضل . وكذا من جوز مسحهما وجوز غسلهما فقد أخطأ أيضا ، ومن نقل عن أبي جعفر بن جرير أنه أوجب غسلهما للأحاديث ، وأوجب مسحهما للآية ، فلم يحقق مذهبه في ذلك ، فإن كلامه في تفسيره إنما يدل على أنه أراد أنه يجب دلك الرجلين من دون سائر أعضاء الوضوء ; لأنهما يليان الأرض والطين وغير ذلك ، فأوجب دلكهما ليذهب ما عليهما ، ولكنه عبر عن الدلك بالمسح ، فاعتقد من لم يتأمل كلامه أنه أراد وجوب الجمع بين غسل الرجلين ومسحهما ، فحكاه من حكاه كذلك ; ولهذا يستشكله كثير من الفقهاء وهو معذور فإنه لا معنى للجمع بين المسح والغسل ، سواء تقدمه أو تأخر عليه ; لاندراجه فيه ، وإنما أراد الرجل ما ذكرته ، والله أعلم . ثم تأملت كلامه أيضا فإذا هو يحاول الجمع بين القراءتين ، في قوله : ( وأرجلكم ) خفضا على المسح وهو الدلك ونصبا على الغسل ، فأوجبهما أخذا بالجمع بين هذه وهذه .\nذكر الأحاديث الواردة في غسل الرجلين وأنه لا بد منه :\nقد تقدم في حديث أميري المؤمنين عثمان وعلي وابن عباس ومعاوية وعبد الله بن زيد بن عاصم والمقداد بن معد يكرب ; أن رسول الله صلى الله عليه وسلم غسل الرجلين في وضوئه ، إما مرة ، وإما مرتين ، أو ثلاثا ، على اختلاف رواياتهم .\nوفي حديث عمرو بن شعيب ، عن أبيه ، عن جده ، أن رسول الله صلى الله عليه وسلم توضأ فغسل قدميه ، ثم قال : \" هذا وضوء لا يقبل الله الصلاة إلا به \" .\nوفي الصحيحين ، من رواية أبي عوانة ، عن أبي بشر ، عن يوسف بن ماهك ، عن عبد الله بن عمرو قال : تخلف عنا رسول الله صلى الله عليه وسلم في سفرة سافرناها ، فأدركنا وقد أرهقتنا الصلاة ، صلاة العصر ونحن نتوضأ ، فجعلنا نمسح على أرجلنا ، فنادى بأعلى صوته : \" أسبغوا الوضوء ، ويل للأعقاب من النار \" .\nوكذلك هو في الصحيحين عن أبي هريرة وفي صحيح مسلم عن عائشة عن النبي صلى الله عليه وسلم أنه قال : \" أسبغوا الوضوء ، ويل للأعقاب من النار \" .\nوروى الليث بن سعد ، عن حيوة بن شريح ، عن عقبة بن مسلم ، عن عبد الله بن الحارث بن جزء أنه سمع رسول الله صلى الله عليه وسلم يقول : \" ويل للأعقاب وبطون الأقدام من النار \" . رواه البيهقي والحاكم وهذا إسناد صحيح .\nوقال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة عن أبي إسحاق : أنه سمع سعيد بن أبي كرب - أو شعيب بن أبي كرب - قال : سمعت جابر بن عبد الله - وهو على جمل - يقول : سمعت رسول الله صلى الله عليه وسلم يقول : \" ويل للعراقيب من النار \" .\nوحدثنا أسود بن عامر ، أخبرنا إسرائيل عن أبي إسحاق ، عن سعيد بن أبي كرب عن جابر بن عبد الله قال : رأى النبي صلى الله عليه وسلم في رجل رجل منا مثل الدرهم لم يغسله ، فقال : \" ويل للعقب من النار \" .\nورواه ابن ماجه ، عن أبي بكر بن أبي شيبة ، عن الأحوص عن أبي إسحاق ، عن سعيد به نحوه ، وكذا رواه ابن جرير من حديث سفيان الثوري وشعبة بن الحجاج وغير واحد ، عن أبي إسحاق السبيعي ، عن سعيد بن أبي كرب عن جابر عن النبي صلى الله عليه وسلم ، مثله . ثم قال :\nحدثنا علي بن مسلم ، حدثنا عبد الصمد بن عبد الوارث ، حدثنا حفص عن الأعمش عن أبي سفيان ، عن جابر ; أن رسول الله صلى الله عليه وسلم رأى قوما يتوضئون ، لم يصب أعقابهم الماء ، فقال : \" ويل للعراقيب من النار \" .\nوقال الإمام أحمد : حدثنا خلف بن الوليد ، حدثنا أيوب بن عتبة ، عن يحيى بن أبي كثير ، عن أبي سلمة ، عن معيقيب قال : قال رسول الله صلى الله عليه وسلم : \" ويل للأعقاب من النار \" . تفرد به أحمد .\nوقال ابن جرير : حدثني علي بن عبد الأعلى ، حدثنا المحاربي عن مطرح بن يزيد ، عن عبيد الله بن زحر ، عن علي بن يزيد ، عن القاسم عن أبي أمامة قال : قال رسول الله صلى الله عليه وسلم : \" ويل للأعقاب من النار ، ويل للأعقاب من النار \" . قال : فما بقي في المسجد شريف ولا وضيع ، إلا نظرت إليه يقلب عرقوبيه ينظر إليهما \" .\nوحدثنا أبو كريب ، حدثنا حسين عن زائدة عن ليث حدثني عبد الرحمن بن سابط ، عن أبي أمامة - أو عن أخي أبي أمامة - أن رسول الله صلى الله عليه وسلم أبصر قوما يتوضئون وفي عقب أحدهم - أو : كعب أحدهم - مثل موضع الدرهم - أو : موضع الظفر - لم يمسه الماء ، فقال : \" ويل للأعقاب من النار \" . قال : فجعل الرجل إذا رأى في عقبه شيئا لم يصبه الماء أعاد وضوءه \" .\nووجه الدلالة من هذه الأحاديث ظاهرة ، وذلك أنه لو كان فرض الرجلين مسحهما ، أو أنه يجوز ذلك فيهما لما توعد على تركه ; لأن المسح لا يستوعب جميع الرجل ، بل يجري فيه ما يجري في مسح الخف ، وهكذا وجه الدلالة على الشيعة الإمام أبو جعفر بن جرير ، رحمه الله .\nوقد روى مسلم في صحيحه ، من طريق أبي الزبير ، عن جابر عن عمر بن الخطاب ; أن رجلا توضأ فترك موضع ظفر على قدمه فأبصره النبي صلى الله عليه وسلم فقال : \" ارجع فأحسن وضوءك \" .\nوقال الحافظ أبو بكر البيهقي : أخبرنا أبو عبد الله الحافظ ، أخبرنا أبو العباس محمد بن يعقوب ، حدثنا محمد بن إسحاق الصاغاني حدثنا هارون بن معروف ، حدثنا ابن وهب ، حدثنا جرير بن حازم : أنه سمع قتادة بن دعامة قال : حدثنا أنس بن مالك ; أن رجلا جاء إلى النبي صلى الله عليه وسلم قد توضأ ، وترك على قدمه مثل موضع الظفر ، فقال له رسول الله صلى الله عليه وسلم : \" ارجع فأحسن وضوءك \" .\nوهكذا رواه أبو داود عن هارون بن معروف وابن ماجه ، عن حرملة بن يحيى ، كلاهما عن ابن وهب به وهذا إسناد جيد ، رجاله كلهم ثقات ، لكن قال أبو داود : [ و ] ليس هذا الحديث بمعروف ، لم يروه إلا ابن وهب .\nوحدثنا موسى بن إسماعيل ، حدثنا حماد أخبرنا يونس وحميد عن الحسن أن رسول الله صلى الله عليه وسلم . . . بمعنى حديث قتادة .\nوقال الإمام أحمد : حدثنا إبراهيم بن أبي العباس ، حدثنا بقية حدثني بحير بن سعد ، عن خالد بن معدان ، عن بعض أزواج النبي صلى الله عليه وسلم ; أن رسول الله صلى الله عليه وسلم رأى رجلا يصلي وفي ظهر قدمه لمعة قدر الدرهم لم يصبها الماء ، فأمره رسول الله صلى الله عليه وسلم أن يعيد الوضوء .\nورواه أبو داود من حديث بقية وزاد : \" والصلاة \" . وهذا إسناد جيد قوي صحيح ، والله أعلم .\nوفي حديث حمران عن عثمان في صفة وضوء النبي صلى الله عليه وسلم : أنه خلل بين أصابعه . وروى أهل السنن من حديث إسماعيل بن كثير ، عن عاصم بن لقيط بن صبرة ، عن أبيه قال : قلت : يا رسول الله ، أخبرني عن الوضوء : فقال : \" أسبغ الوضوء ، وخلل بين الأصابع ، وبالغ في الاستنشاق إلا أن تكون صائما \" .\nوقال الإمام أحمد : حدثنا عبد الله بن يزيد أبو عبد الرحمن المقري حدثنا عكرمة بن عمار ، حدثنا شداد بن عبد الله الدمشقي قال : قال أبو أمامة : حدثنا عمرو بن عبسة قال : قلت : يا نبي الله ، أخبرني عن الوضوء . قال : \" ما منكم من أحد يقرب وضوءه ، ثم يتمضمض ويستنشق وينتثر إلا خرت خطاياه من فمه وخياشيمه مع الماء حين ينتثر ، ثم يغسل وجهه كما أمره الله إلا خرت خطايا وجهه من أطراف لحيته مع الماء ، ثم يغسل يديه إلى المرفقين إلا خرت خطايا يديه من أطراف أنامله ، ثم يمسح رأسه إلا خرت خطايا رأسه من أطراف شعره مع الماء ، ثم يغسل قدميه إلى الكعبين كما أمره الله إلا خرت خطايا قدميه من أطراف أصابعه مع الماء ، ثم يقوم فيحمد الله ويثني عليه بالذي هو له أهل ، ثم يركع ركعتين إلا خرج من ذنوبه كيوم ولدته أمه \" . قال أبو أمامة : يا عمرو ، انظر ما تقول ، سمعت هذا من رسول الله صلى الله عليه وسلم ؟ أيعطى هذا الرجل كله في مقامه؟ فقال عمرو بن عبسة يا أبا أمامة ، لقد كبرت سني ، ورق عظمي ، واقترب أجلي ، وما بي حاجة أن أكذب على الله ، وعلى رسول الله صلى الله عليه وسلم [ و ] لو لم أسمعه من رسول الله صلى الله عليه وسلم إلا مرة أو مرتين أو ثلاثا ، لقد سمعته [ منه ] سبع مرات أو أكثر من ذلك .\nوهذا إسناد صحيح ، وهو في صحيح مسلم من وجه آخر ، وفيه : \" ثم يغسل قدميه كما أمره الله \" . فدل على أن القرآن يأمر بالغسل .\nوهكذا روى أبو إسحاق السبيعي ، عن الحارث عن علي بن أبي طالب ، رضي الله عنه ، أنه قال : اغسلوا القدمين إلى الكعبين كما أمرتم .\nومن هاهنا يتضح لك المراد من حديث عبد خير ، عن علي أن رسول الله صلى الله عليه وسلم رش على قدميه الماء وهما في النعلين فدلكهما . إنما أراد غسلا خفيفا وهما في النعلين ولا مانع من إيجاد الغسل والرجل في نعلها ، ولكن في هذا رد على المتعمقين والمتنطعين من الموسوسين . وهكذا الحديث الذي أورده ابن جرير على نفسه ، وهو من روايته ، عن الأعمش عن أبي وائل ، عن حذيفة قال : أتى رسول الله صلى الله عليه وسلم سباطة قوم فبال قائما ، ثم دعا بماء فتوضأ ، ومسح على نعليه وهو حديث صحيح . وقد أجاب ابن جرير عنه بأن الثقات الحفاظ رووه عن الأعمش عن أبي وائل ، عن حذيفة قال : فبال قائما ثم توضأ ومسح على خفيه .\nقلت : ويحتمل الجمع بينهما بأن يكون في رجليه خفان ، وعليهما نعلان .\nوهكذا الحديث الذي رواه الإمام أحمد بن حنبل : حدثنا يحيى عن شعبة ، حدثني يعلى عن أبيه ، عن أوس بن أبي أوس قال : رأيت رسول الله صلى الله عليه وسلم توضأ ومسح على نعليه ، ثم قام إلى الصلاة . وقد رواه أبو داود عن مسدد وعباد بن موسى كلاهما ، عن هشيم عن يعلى بن عطاء ، عن أبيه ، عن أوس بن أبي أوس قال : رأيت رسول الله صلى الله عليه وسلم أتى سباطة قوم فبال ، وتوضأ ومسح على نعليه وقدميه .\nوقد رواه ابن جرير من طريق شعبة ومن طريق هشيم ثم قال : وهذا محمول على أنه توضأ كذلك وهو غير محدث ; إذ كان غير جائز أن تكون فرائض الله وسنن رسوله متنافية متعارضة ، وقد صح عنه صلى الله عليه وسلم الأمر بعموم غسل القدمين في الوضوء بالماء بالنقل المستفيض القاطع عذر من انتهى إليه وبلغه .\nولما كان القرآن آمرا بغسل الرجلين - كما في قراءة النصب ، وكما هو الواجب في حمل قراءة الخفض عليها - توهم بعض السلف أن هذه الآية ناسخة لرخصة المسح على الخفين ، وقد روي ذلك عن علي بن أبي طالب ، ولكن لم يصح إسناده ، ثم الثابت عنه خلافه ، وليس كما زعموه ، فإنه قد ثبت أن النبي صلى الله عليه وسلم مسح على الخفين بعد نزول هذه الآية الكريمة .\nقال الإمام أحمد : حدثنا هاشم بن القاسم ، حدثنا زياد بن عبد الله بن علاثة ، عن عبد الكريم بن مالك الجزري ، عن مجاهد عن جرير بن عبد الله البجلي قال : أنا أسلمت بعد نزول المائدة ، وأنا رأيت رسول الله صلى الله عليه وسلم يمسح بعدما أسلمت . تفرد به أحمد .\nوفي الصحيحين ، من حديث الأعمش عن إبراهيم عن همام قال : بال جرير ثم توضأ ومسح على خفيه ، فقيل : تفعل هذا؟ فقال : نعم ، رأيت رسول الله صلى الله عليه وسلم بال ، ثم توضأ ومسح على خفيه . قال الأعمش : قال إبراهيم : فكان يعجبهم هذا الحديث ; لأن إسلام جرير كان بعد نزول المائدة . لفظ مسلم .\nوقد ثبت بالتواتر عن رسول الله صلى الله عليه وسلم مشروعية المسح على الخفين قولا منه وفعلا كما هو مقرر في كتاب \" الأحكام الكبير \" ، وما يحتاج إلى ذكره هناك ، من تأقيت المسح أو عدمه أو التفصيل فيه ، كما هو مبسوط في موضعه . وقد خالفت الروافض ذلك كله بلا مستند ، بل بجهل وضلال ، مع أنه ثابت في صحيح مسلم من رواية أمير المؤمنين علي بن أبي طالب ، رضي الله عنه . كما ثبت في الصحيحين عنه ، عن النبي صلى الله عليه وسلم النهي عن نكاح المتعة ، وهم يستبيحونها . وكذلك هذه الآية الكريمة دالة على وجوب غسل الرجلين ، مع ما ثبت بالتواتر من فعل رسول الله صلى الله عليه وسلم على وفق ما دلت عليه الآية الكريمة ، وهم مخالفون لذلك كله ، وليس لهم دليل صحيح في نفس الأمر ، ولله الحمد .\nوهكذا خالفوا الأئمة والسلف في الكعبين اللذين في القدمين ، فعندهم أنهما في ظهر القدم ، فعندهم في كل رجل كعب ، وعند الجمهور أن الكعبين هما العظمان الناتئان عند مفصل الساق والقدم . قال الربيع : قال الشافعي : لم أعلم مخالفا في أن الكعبين اللذين ذكرهما الله في كتابه في الوضوء هما الناتئان ، وهما مجمع مفصل الساق والقدم . هذا لفظه . فعند الأئمة ، رحمهم الله ، [ أن ] في كل قدم كعبين كما هو المعروف عند الناس ، وكما دلت عليه السنة ، ففي الصحيحين من طريق حمران عن عثمان ; أنه توضأ فغسل رجله اليمنى إلى الكعبين ، واليسرى مثل ذلك .\nوروى البخاري تعليقا مجزوما به وأبو داود وابن خزيمة في صحيحه ، من رواية أبي القاسم الحسيني بن الحارث الجدلي ، عن النعمان بن بشير قال : أقبل علينا رسول الله صلى الله عليه وسلم بوجهه فقال : \" أقيموا صفوفكم - ثلاثا - والله لتقيمن صفوفكم أو ليخالفن الله بين قلوبكم \" . قال : فرأيت الرجل يلزق كعبه بكعب صاحبه ، وركبته بركبة صاحبه ، ومنكبه بمنكبه . لفظ ابن خزيمة .\nفليس يمكن أن يلزق كعبه بكعب صاحبه إلا والمراد به العظم الناتئ في الساق ، حتى يحاذي كعب الآخر ، فدل ذلك على ما ذكرناه ، من أنهما العظمان الناتئان عند مفصل الساق والقدم كما هو مذهب أهل السنة .\nوقد قال ابن أبي حاتم : حدثنا أبي ، حدثنا إسماعيل بن موسى ، أخبرنا شريك عن يحيى بن عبد الله بن الحارث التيمي - يعني الجابر - قال : نظرت في قتلى أصحاب زيد فوجدت الكعب فوق ظهر القدم ، وهذه عقوبة عوقب بها الشيعة بعد قتلهم ، تنكيلا بهم في مخالفتهم الحق وإصرارهم عليه .\nوقوله : ( وإن كنتم مرضى أو على سفر أو جاء أحد منكم من الغائط أو لامستم النساء فلم تجدوا ماء فتيمموا صعيدا طيبا فامسحوا بوجوهكم وأيديكم منه ) كل ذلك قد تقدم الكلام عليه في تفسير آية النساء ، فلا حاجة بنا إلى إعادته ; لئلا يطول الكلام . وقد ذكرنا سبب نزول آية التيمم هناك ، لكن البخاري روى هاهنا حديثا خاصا بهذه الآية الكريمة ، فقال :\nحدثنا يحيى بن سليمان ، حدثنا ابن وهب ، أخبرني عمرو بن الحارث ، أن عبد الرحمن بن القاسم حدثه ، عن أبيه ، عن عائشة : سقطت قلادة لي بالبيداء ، ونحن داخلون المدينة فأناخ رسول الله صلى الله عليه وسلم ونزل ، فثنى رأسه في حجري راقدا ، أقبل أبو بكر فلكزني لكزة شديدة ، وقال : حبست الناس في قلادة ، فبي الموت لمكان رسول الله صلى الله عليه وسلم ، وقد أوجعني ، ثم إن النبي صلى الله عليه وسلم استيقظ وحضرت الصبح ، فالتمس الماء فلم يوجد ، فنزلت : ( يا أيها الذين آمنوا إذا قمتم إلى الصلاة فاغسلوا وجوهكم ) هذه الآية ، فقال أسيد بن الحضير لقد بارك الله للناس فيكم يا آل أبي بكر ، ما أنتم إلا بركة لهم .\nوقوله : ( ما يريد الله ليجعل عليكم من حرج ) أي : فلهذا سهل عليكم ويسر ولم يعسر ، بل أباح التيمم عند المرض ، وعند فقد الماء ، توسعة عليكم ورحمة بكم ، وجعله في حق من شرع الله يقوم مقام الماء إلا من بعض الوجوه ، كما تقدم بيانه ، وكما هو مقرر في كتاب \" الأحكام الكبير \" .\nوقوله : ( ولكن يريد ليطهركم وليتم نعمته عليكم لعلكم تشكرون ) أي : لعلكم تشكرون نعمه عليكم فيما شرعه لكم من التوسعة والرأفة والرحمة والتسهيل والسماحة ، وقد وردت السنة بالحث على الدعاء عقب الوضوء ، بأن يجعل فاعله من المتطهرين الداخلين في امتثال هذه الآية الكريمة ، كما رواه الإمام أحمد ومسلم وأهل السنن ، عن عقبة بن عامر قال : كانت علينا رعاية الإبل ، فجاءت نوبتي فروحتها بعشي ، فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس ، فأدركت من قوله : \" ما من مسلم يتوضأ فيحسن وضوءه ، ثم يقوم فيصلي ركعتين مقبلا عليهما بقلبه ووجهه ، إلا وجبت له الجنة \" . قال : قلت : ما أجود هذه! فإذا قائل بين يدي يقول : التي قبلها أجود منها . فنظرت فإذا عمر رضي الله عنه ، فقال : إني قد رأيتك جئت آنفا قال : \" ما منكم من أحد يتوضأ فيبلغ - أو : فيسبغ - الوضوء ، يقول : أشهد أن لا إله إلا الله وأن محمدا عبده ورسوله ، إلا فتحت له أبواب الجنة الثمانية ، يدخل من أيها شاء \" . لفظ مسلم .\nوقال مالك : عن سهيل بن أبي صالح ، عن أبيه ، عن أبي هريرة ; أن رسول الله صلى الله عليه وسلم قال : \" إذا توضأ العبد المسلم - أو : المؤمن - فغسل وجهه ، خرج من وجهه كل خطيئة نظر إليها بعينيه مع الماء - أو : مع آخر قطر الماء - فإذا غسل يديه خرج من يديه كل خطيئة بطشتها يداه مع الماء - أو : مع آخر قطر الماء - فإذا غسل رجليه خرجت كل خطيئة مشتها رجلاه مع الماء - أو : مع آخر قطر الماء - حتى يخرج نقيا من الذنوب \" .\nرواه مسلم عن أبي الطاهر ، عن ابن وهب ، عن مالك به .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا معاوية بن هشام ، عن سفيان عن منصور عن سالم بن أبي الجعد ، عن كعب بن مرة قال : قال رسول الله صلى الله عليه وسلم : \" ما من رجل يتوضأ فيغسل يديه - أو : ذراعيه - إلا خرجت خطاياه منهما ، فإذا غسل وجهه خرجت خطاياه من وجهه ، فإذا مسح رأسه خرجت خطاياه من رأسه ، فإذا غسل رجليه خرجت خطاياه من رجليه \" .\nهذا لفظه . وقد رواه الإمام أحمد ، عن محمد بن جعفر ، عن شعبة عن منصور عن سالم عن مرة بن كعب ، أو كعب بن مرة السلمي ، عن النبي صلى الله عليه وسلم قال : \" وإذا توضأ العبد فغسل يديه ، خرجت خطاياه من بين يديه ، وإذا غسل وجهه خرجت خطاياه من وجهه ، وإذا غسل ذراعيه خرجت خطاياه من ذراعيه ، وإذا غسل رجليه خرجت خطاياه من رجليه \" . قال شعبة : ولم يذكر مسح الرأس . وهذا إسناد صحيح .\nوروى ابن جرير من طريق شمر بن عطية ، عن شهر بن حوشب ، عن أبي أمامة قال : قال رسول الله صلى الله عليه وسلم : \" من توضأ فأحسن الوضوء ، ثم قام إلى الصلاة ، خرجت ذنوبه من سمعه وبصره ويديه ورجليه \" .\nوروى مسلم في صحيحه ، من حديث يحيى بن أبي كثير ، عن زيد بن سلام ، عن جده ممطور عن أبي مالك الأشعري ; أن رسول الله صلى الله عليه وسلم قال : \" الطهور شطر الإيمان ، والحمد لله تملأ الميزان ، وسبحان الله والحمد لله تملآن ما بين السماء والأرض ، والصلاة نور ، والصدقة برهان ، والصبر ضياء ، والقرآن حجة لك أو عليك ، كل الناس يغدو ، فبائع نفسه فمعتقها ، أو موبقها \" .\nوفي صحيح مسلم من رواية سماك بن حرب ، عن مصعب بن سعد ، عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : \" لا يقبل الله صدقة من غلول ، ولا صلاة بغير طهور \" .\nوقال أبو داود الطيالسي : حدثنا شعبة عن قتادة سمعت أبا المليح الهذلي يحدث عن أبيه ، قال : كنت مع رسول الله صلى الله عليه وسلم في بيت ، فسمعته يقول : \" إن الله لا يقبل صلاة من غير طهور ، ولا صدقة من غلول \" .\nوكذا رواه أحمد وأبو داود والنسائي وابن ماجه ، من حديث شعبة .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قُمۡتُمۡ إِلَى ٱلصَّلَوٰةِ فَٱغۡسِلُواْ وُجُوهَكُمۡ وَأَيۡدِيَكُمۡ إِلَى ٱلۡمَرَافِقِ وَٱمۡسَحُواْ بِرُءُوسِكُمۡ وَأَرۡجُلَكُمۡ إِلَى ٱلۡكَعۡبَيۡنِۚ وَإِن كُنتُمۡ جُنُبٗا فَٱطَّهَّرُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُم مِّنۡهُۚ مَا يُرِيدُ ٱللَّهُ لِيَجۡعَلَ عَلَيۡكُم مِّنۡ حَرَجٖ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمۡ وَلِيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ ٦\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا إذا قمتم إلى الصلاة فاغسلوا وجوهكم وأيديكم إلى المرافق وامسحوا برءوسكم وأرجلكم إلى الكعبين وإن كنتم جنبا فاطهروا وإن كنتم مرضى أو على سفر أو جاء أحد منكم من الغائط أو لامستم النساء فلم تجدوا ماء فتيمموا صعيدا طيبا فامسحوا بوجوهكم وأيديكم منه ما يريد الله ليجعل عليكم من حرج ولكن يريد ليطهركم وليتم نعمته عليكم لعلكم تشكرون\nفيه اثنتا وثلاثون مسألة :\nالأولى : ذكر القشيري وابن عطية أن هذه الآية نزلت في قصة عائشة حين فقدت العقد في غزوة المريسيع ، وهي آية الوضوء . قال ابن عطية : لكن من حيث كان الوضوء متقررا عندهم مستعملا ، فكان الآية لم تزدهم فيه إلا تلاوته ، وإنما أعطتهم الفائدة والرخصة في التيمم ، وقد ذكرنا في آية \" النساء \" خلاف هذا ، والله أعلم . ومضمون هذه الآية داخل فيما أمر به من الوفاء بالعقود وأحكام الشرع ، وفيما ذكر من إتمام النعمة ; فإن هذه الرخصة من إتمام النعم .\nالثانية : واختلف العلماء في المعنى المراد بقوله : إذا قمتم إلى الصلاة على أقوال ; فقالت طائفة : هذا لفظ عام في كل قيام إلى الصلاة ، سواء كان القائم متطهرا أو محدثا ; فإنه ينبغي له إذا قام إلى الصلاة أن يتوضأ ، وكان علي يفعله ويتلو هذه الآية ; ذكره أبو محمد الدارمي في مسنده ، وروي مثله عن عكرمة ، وقال ابن سيرين : كان الخلفاء يتوضئون لكل صلاة .\nقلت : فالآية على هذا محكمة لا نسخ فيها ، وقالت طائفة : الخطاب خاص بالنبي صلى الله عليه وسلم ; قال عبد الله بن حنظلة بن أبي عامر الغسيل : إن النبي صلى الله عليه وسلم أمر بالوضوء عند كل صلاة فشق ذلك عليه ; فأمر بالسواك ورفع عنه الوضوء إلا من حدث ، وقال علقمة بن الفغواء عن أبيه - وهو من الصحابة ، وكان دليل رسول الله صلى الله عليه وسلم إلى تبوك : نزلت هذه الآية رخصة لرسول الله صلى الله عليه وسلم ; لأنه كان لا يعمل عملا إلا وهو على وضوء ، ولا يكلم أحدا ولا يرد سلاما إلى غير ذلك ; فأعلمه الله بهذه الآية أن الوضوء إنما هو للقيام إلى الصلاة فقط دون سائر الأعمال ، وقالت طائفة : المراد بالآية الوضوء لكل صلاة طلبا للفضل ; وحملوا الأمر على الندب ، وكان كثير من الصحابة منهم ابن عمر يتوضئون لكل صلاة طلبا للفضل ، وكان عليه الصلاة والسلام يفعل ذلك إلى أن جمع يوم الفتح بين الصلوات الخمس بوضوء واحد ، إرادة البيان لأمته صلى الله عليه وسلم .\nقلت : وظاهر هذا القول أن الوضوء لكل صلاة قبل ورود الناسخ كان مستحبا لا إيجابا وليس كذلك ; فإن الأمر إذا ورد ، مقتضاه الوجوب ; لا سيما عند الصحابة رضوان الله عليهم ، على ما هو معروف من سيرتهم ، وقال آخرون : إن الفرض في كل وضوء كان لكل صلاة ثم نسخ في فتح مكة ; وهذا غلط لحديث أنس قال : كان النبي صلى الله عليه وسلم يتوضأ لكل صلاة ، وإن أمته كانت على خلاف ذلك ، وسيأتي ; ولحديث سويد بن النعمان أن النبي صلى الله عليه وسلم صلى وهو بالصهباء العصر والمغرب بوضوء واحد ; وذلك في غزوة خيبر ، وهي سنة ست ، وقيل : سنة سبع ، وفتح مكة كان في سنة ثمان ; وهو حديث صحيح رواه مالك في موطئه ، وأخرجه البخاري ومسلم ; فبان بهذين الحديثين أن الفرض لم يكن قبل الفتح لكل صلاة . فإن قيل : فقد روى مسلم عن بريدة بن الحصيب أن رسول الله صلى الله عليه وسلم كان يتوضأ لكل صلاة ، فلما كان يوم الفتح صلى الصلوات بوضوء واحد ، ومسح على خفيه ، فقال عمر رضي الله عنه : لقد صنعت اليوم شيئا لم تكن تصنعه ; فقال : ( عمدا صنعته يا عمر ) . فلم سأله عمر واستفهمه ؟ قيل له : إنما سأله لمخالفته عادته منذ صلاته بخيبر ; والله أعلم . وروى الترمذي عن أنس أن النبي صلى الله عليه وسلم كان يتوضأ لكل صلاة طاهرا وغير طاهر ; قال حميد : قلت لأنس : وكيف كنتم تصنعون أنتم ؟ قال : كنا نتوضأ وضوءا واحدا ; قال : حديث حسن صحيح ; وروي عن النبي صلى الله عليه وسلم أنه قال : الوضوء على الوضوء نور فكان عليه السلام يتوضأ مجددا لكل صلاة ، وقد سلم عليه رجل وهو يبول فلم يرد عليه حتى تيمم ثم رد السلام وقال : إني كرهت أن أذكر الله إلا على طهر رواه الدارقطني ، وقال السدي وزيد بن أسلم : معنى الآية إذا قمتم إلى الصلاة يريد من المضاجع يعني النوم ، والقصد بهذا التأويل أن يعم الأحداث بالذكر ، ولا سيما النوم الذي هو مختلف فيه هل هو حدث في نفسه أم لا ؟ وفي الآية على هذا التأويل تقديم وتأخير ; التقدير : يا أيها الذين آمنوا إذا قمتم إلى الصلاة من النوم ، أو جاء أحد منكم من الغائط أو لامستم النساء - يعني الملامسة الصغرى - فاغسلوا ; فتمت أحكام المحدث حدثا أصغر . ثم قال : وإن كنتم جنبا فاطهروا فهذا حكم نوع آخر ; ثم قال للنوعين جميعا : وإن كنتم مرضى أو على سفر أو جاء أحد منكم من الغائط أو لامستم النساء فلم تجدوا ماء فتيمموا صعيدا طيبا . وقال بهذا التأويل محمد بن مسلمة من أصحاب مالك - رحمه الله - وغيره ، وقال جمهور أهل العلم : معنى الآية إذا قمتم إلى الصلاة محدثين ; وليس في الآية على هذا تقديم وتأخير ، بل ترتب في الآية حكم واجد الماء إلى قوله : فاطهروا ودخلت الملامسة الصغرى في قوله \" محدثين \" . ثم ذكر بعد قوله : وإن كنتم جنبا فاطهروا حكم عادم الماء من النوعين جميعا ، وكانت الملامسة هي الجماع ، ولا بد أن يذكر الجنب العادم الماء كما ذكر الواجد ; وهذا تأويل الشافعي وغيره ; وعليه تجيء أقوال الصحابة كسعد بن أبي وقاص وابن عباس وأبي موسى الأشعري وغيرهم .\nقلت : وهذان التأويلان أحسن ما قيل في الآية ; والله أعلم ، ومعنى إذا قمتم إذا أردتم ، كما قال تعالى : فإذا قرأت القرآن فاستعذ ، أي : إذا أردت ; لأن الوضوء حالة القيام إلى الصلاة لا يمكن .\nالثالثة : قوله تعالى : الصلاة فاغسلوا وجوهكم ذكر تعالى أربعة أعضاء : الوجه وفرضه الغسل واليدين كذلك والرأس وفرضه المسح اتفاقا واختلف في الرجلين على ما يأتي ، لم يذكر سواها فدل ذلك على أن ما عداها آداب وسنن ، والله أعلم ، ولا بد في غسل الوجه من نقل الماء إليه ، وإمرار اليد عليه ; وهذه حقيقة الغسل عندنا ، وقد بيناه في \" النساء \" ، وقال غيرنا : إنما عليه إجراء الماء وليس عليه دلك بيده ; ولا شك أنه إذا انغمس الرجل في الماء وغمس وجهه أو يده ولم يدلك يقال : غسل وجهه ويده ، ومعلوم أنه لا يعتبر في ذلك غير حصول الاسم ، فإذا حصل كفى ، والوجه في اللغة مأخوذ من المواجهة ، وهو عضو مشتمل على أعضاء وله طول وعرض ; فحده في الطول من مبتدأ سطح الجبهة إلى منتهى اللحيين ، ومن الأذن إلى الأذن في العرض ، وهذا في الأمرد ; وأما الملتحي فإذا اكتسى الذقن بالشعر فلا يخلو أن يكون خفيفا أو كثيفا ; فإن كان الأول بحيث تبين منه البشرة فلا بد من إيصال الماء إليها ، وإن كان كثيفا فقد انتقل الفرض إليه كشعر الرأس ; ثم ما زاد على الذقن من الشعر واسترسل من اللحية ، فقال سحنون عن ابن القاسم : سمعت مالكا سئل : هل سمعت بعض أهل العلم يقول إن اللحية من الوجه فليمر عليها الماء ؟ قال : نعم ، وتخليلها في الوضوء ليس من أمر الناس ، وعاب ذلك على من فعله ، وذكر ابن القاسم أيضا عن مالك قال : يحرك المتوضئ ظاهر لحيته من غير أن يدخل يده فيها ; قال : وهي مثل أصابع الرجلين . قال ابن عبد الحكم : تخليل اللحية واجب في الوضوء والغسل . قال أبو عمر : روي عن النبي صلى الله عليه وسلم أنه خلل لحيته في الوضوء من وجوه كلها ضعيفة . وذكر ابن خويز منداد : أن الفقهاء اتفقوا على أن تخليل اللحية ليس بواجب في الوضوء ، إلا شيء روي عن سعيد بن جبير ; قوله : ما بال الرجل يغسل لحيته قبل أن تنبت فإذا نبتت لم يغسلها ، وما بال الأمرد يغسل ذقنه ولا يغسله ذو اللحية ؟ قال الطحاوي : التيمم واجب فيه مسح البشرة قبل نبات الشعر في الوجه ثم سقط بعده عند جميعهم . فكذلك الوضوء . قال أبو عمر : من جعل غسل اللحية كلها واجبا جعلها وجها ; لأن الوجه مأخوذ من المواجهة ، والله قد أمر بغسل الوجه أمرا مطلقا لم يخص صاحب لحية من أمرد ; فوجب غسلها بظاهر القرآن لأنها بدل من البشرة .\nقلت : واختار هذا القول ابن العربي وقال : وبه أقول ; لما روي أن النبي صلى الله عليه وسلم كان يغسل لحيته ، خرجه الترمذي وغيره ; فعين المحتمل بالفعل ، وحكى ابن المنذر عن إسحاق أن من ترك تخليل لحيته عامدا أعاد ، وروى الترمذي عن عثمان بن عفان أن النبي صلى الله عليه وسلم كان يخلل لحيته ; قال : هذا حديث حسن صحيح ; قال أبو عمر : ومن لم يوجب غسل ما انسدل من اللحية ذهب إلى أن الأصل المأمور بغسله البشرة ، فوجب غسل ما ظهر فوق البشرة ، وما انسدل من اللحية ليس تحته ما يلزم غسله ، فيكون غسل اللحية بدلا منه ، واختلفوا أيضا في غسل ما وراء العذار إلى الأذن ; فروى ابن وهب عن مالك قال : ليس ما خلف الصدغ الذي من وراء شعر اللحية إلى الذقن من الوجه . قال أبو عمر : لا أعلم أحدا من فقهاء الأمصار قال بما رواه ابن وهب عن مالك ، وقال أبو حنيفة وأصحابه : البياض بين العذار والأذن من الوجه ، وغسله واجب ; ونحوه قال الشافعي وأحمد ، وقيل : يغسل البياض استحبابا ; قال ابن العربي : والصحيح عندي أنه لا يلزم غسله إلا للأمرد لا للمعذر .\nقلت : وهو اختيار القاضي عبد الوهاب ; وسبب الخلاف هل تقع عليه المواجهة أم لا ؟ والله أعلم ، وبسبب هذا الاحتمال اختلفوا هل يتناول الأمر بغسل الوجه باطن الأنف والفم أم لا ؟ فذهب أحمد بن حنبل وإسحاق وغيرهما إلى وجوب ذلك في الوضوء والغسل ، إلا أن أحمد قال : يعيد من ترك الاستنشاق في وضوئه ولا يعيد من ترك المضمضة ، وقال عامة الفقهاء : هما سنتان في الوضوء والغسل ; لأن الأمر إنما يتناول الظاهر دون الباطن ، والعرب لا تسمي وجها إلا ما وقعت به المواجهة ، ثم إن الله تعالى لم يذكرهما في كتابه ، ولا أوجبهما المسلمون ، ولا اتفق الجميع عليه ; والفرائض لا تثبت إلا من هذه الوجوه ، وقد مضى هذا المعنى في \" النساء \" ، وأما العينان فالناس كلهم مجمعون على أن داخل العينين لا يلزم غسله ، إلا ما روي عن عبد الله بن عمر أنه كان ينضح الماء في عينيه ; وإنما سقط غسلهما للتأذي بذلك والحرج به ; قال ابن العربي : ولذلك كان عبد الله بن عمر لما عمي يغسل عينيه إذ كان لا يتأذى بذلك ; وإذا تقرر هذا من حكم الوجه فلا بد من غسل جزء من الرأس مع الوجه من غير تحديد ، كما لا بد على القول بوجوب عموم الرأس من مسح جزء معه من الوجه لا يتقدر ; وهذا ينبني على أصل من أصول الفقه وهو : \" أن ما لا يتم الواجب إلا به واجب مثله \" والله أعلم .\nالرابعة : وجمهور العلماء على أن الوضوء لا بد فيه من نية ; لقوله عليه السلام : إنما الأعمال بالنيات . قال البخاري : فدخل فيه الإيمان والوضوء والصلاة والزكاة والحج والصوم والأحكام ; وقال الله تعالى : قل كل يعمل على شاكلته ، يعني على نيته . وقال النبي صلى الله عليه وسلم : ولكن جهاد ونية ، وقال كثير من الشافعية : لا حاجة إلى نية ; وهو قول الحنفية ; قالوا : لا تجب النية إلا في الفروض التي هي مقصودة لأعيانها ولم تجعل سببا لغيرها ، فأما ما كان شرطا لصحة فعل آخر فليس يجب ذلك فيه بنفس ورود الأمر إلا بدلالة تقارنه ، والطهارة شرط ; فإن من لا صلاة عليه لا يجب عليه فرض الطهارة ، كالحائض والنفساء . احتج علماؤنا وبعض الشافعية بقوله تعالى : إذا قمتم إلى الصلاة فاغسلوا وجوهكم فلما وجب فعل الغسل كانت النية شرطا في صحة الفعل ; لأن الفرض من قبل الله تعالى فينبغي أن يجب فعل ما أمر الله به ; فإذا قلنا : إن النية لا تجب عليه لم يجب عليه القصد إلى فعل ما أمره الله تعالى ، ومعلوم أن الذي اغتسل تبردا أو لغرض ما ، قصد أداء الواجب ; وصح في الحديث أن الوضوء يكفر ; فلو صح بغير نية لما كفر ، وقال تعالى : وما أمروا إلا ليعبدوا الله مخلصين له الدين\nالخامسة : قال ابن العربي ، قال بعض علمائنا : إن من خرج إلى النهر بنية الغسل أجزأه ، وإن عزبت نيته في الطريق ، ولو خرج إلى الحمام فعزبت في أثناء الطريق بطلت النية . قال القاضي أبو بكر بن العربي رضي الله عنه : فركب على هذا سفاسفة المفتين أن نية الصلاة تتخرج على القولين ، وأوردوا فيها نصا عمن لا يفرق بين الظن واليقين بأنه قال : يجوز أن تتقدم فيها النية على التكبير ; ويا لله ويا للعالمين من أمة أرادت أن تكون مفتية مجتهدة فما وفقها الله ولا سددها! اعلموا رحمكم الله أن النية في الوضوء مختلف في وجوبها بين العلماء ، وقد اختلف فيها قول مالك ; فلما نزلت عن مرتبة الاتفاق سومح في تقديمها في بعض المواضع ، فأما الصلاة فلم يختلف أحد من الأئمة فيها ، وهي أصل مقصود ، فكيف يحمل الأصل المقصود المتفق عليه على الفرع التابع المختلف فيه ! هل هذا إلا غاية الغباوة ؟ وأما الصوم فإن الشرع رفع الحرج فيه لما كان ابتداؤه في وقت الغفلة بتقديم النية عليه .\nالسادسة : قوله تعالى : وأيديكم إلى المرافق واختلف الناس في دخول المرافق في التحديد ; فقال قوم : نعم ; لأن ما بعد ( إلى ) إذا كان من نوع ما قبلها دخل فيه ; قال سيبويه وغيره ، وقد مضى هذا في \" البقرة \" مبينا ، وقيل : لا يدخل المرفقان في الغسل ; والروايتان مرويتان عن مالك ; الثانية لأشهب ; والأولى عليها أكثر العلماء وهو الصحيح ; لما رواه الدارقطني عن جابر أن النبي صلى الله عليه وسلم كان إذا توضأ أدار الماء على مرفقيه ، وقد قال بعضهم : إن إلى بمعنى مع ، كقولهم : الذود إلى الذود إبل ، أي : مع الذود ، وهذا لا يحتاج إليه كما بيناه في \" النساء \" ; ولأن اليد عند العرب تقع على أطراف الأصابع إلى الكتف ، وكذلك الرجل تقع على الأصابع إلى أصل الفخذ ; فالمرفق داخل تحت اسم اليد ، فلو كان المعنى مع المرافق لم يفد ، فلما قال : إلى اقتطع من حد المرافق عن الغسل ، وبقيت المرافق مغسولة إلى الظفر ، وهذا كلام صحيح يجري على الأصول لغة ومعنى ; قال ابن العربي : وما فهم أحد مقطع المسألة إلا القاضي أبو محمد فإنه قال : إن قوله إلى المرافق حد للمتروك من اليدين لا للمغسول فيهما ; ولذلك تدخل المرافق في الغسل .\nقلت : ولما كان اليد والرجل تنطلق في اللغة على ما ذكرنا كان أبو هريرة يبلغ بالوضوء إبطه وساقه ويقول : سمعت خليلي صلى الله عليه وسلم يقول : تبلغ الحلية من المؤمن حيث يبلغ الوضوء . قال القاضي عياض : والناس مجمعون على خلاف هذا ، وألا يتعدى بالوضوء حدوده ; لقوله عليه السلام : فمن زاد فقد تعدى وظلم . وقال غيره : كان هذا الفعل مذهبا له ومما انفرد به ، ولم يحكه عن النبي صلى الله عليه وسلم وإنما استنبطه من قوله عليه السلام : أنتم الغر المحجلون ومن قوله : تبلغ الحلية كما ذكر .\nالسابعة : قوله تعالى : وامسحوا برءوسكم تقدم في \" النساء \" أن المسح لفظ مشترك ، وأما الرأس فهو عبارة عن الجملة التي يعلمها الناس ضرورة ومنها الوجه ، فلما ذكره الله عز وجل في الوضوء وعين الوجه للغسل بقي باقيه للمسح ، ولو لم يذكر الغسل للزم مسح جميعه ، ما عليه شعر من الرأس وما فيه العينان والأنف والفم ; وقد أشار مالك في وجوب مسح الرأس إلى ما ذكرناه ; فإنه سئل عن الذي يترك بعض رأسه في الوضوء فقال : أرأيت إن ترك غسل بعض وجهه أكان يجزئه ؟ ووضح بهذا الذي ذكرناه أن الأذنين من الرأس ، وأن حكمهما حكم الرأس خلافا للزهري ، حيث قال : هما من الوجه يغسلان معه ، وخلافا للشعبي ، حيث قال : ما أقبل منهما من الوجه وظاهرهما من الرأس ; وهو قول الحسن وإسحاق ، وحكاه ابن أبي هريرة عن الشافعي ، وسيأتي بيان حجتهما ; وإنما سمي الرأس رأسا لعلوه ونبات الشعر فيه ، ومنه رأس الجبل ; وإنما قلنا إن الرأس اسم لجملة أعضاء لقول الشاعر :\nإذا احتملوا رأسي وفي الرأس أكثري وغودر عند الملتقى ثم سائري\nالثامنة : واختلف العلماء في تقدير مسحه على أحد عشر قولا ; ثلاثة لأبي حنيفة ، وقولان للشافعي ، وستة أقوال لعلمائنا ; والصحيح منها واحد وهو وجوب التعميم لما ذكرناه . وأجمع العلماء على أن من مسح رأسه كله فقد أحسن وفعل ما يلزمه ; والباء مؤكدة زائدة ليست للتبعيض : والمعنى وامسحوا رءوسكم ، وقيل : دخولها هنا كدخولها في التيمم في قوله : فامسحوا بوجوهكم فلو كان معناها التبعيض لأفادته في ذلك الموضع ، وهذا قاطع . وقيل : إنما دخلت لتفيد معنى بديعا وهو أن الغسل لغة يقتضي مغسولا به ، والمسح لغة لا يقتضي ممسوحا به ; فلو قال : وامسحوا رءوسكم لأجزأ المسح باليد إمرارا من غير شيء على الرأس ; فدخلت الباء لتفيد ممسوحا به وهو الماء ، فكأنه قال : وامسحوا برءوسكم الماء ; وذلك فصيح في اللغة على وجهين ; إما على القلب كما أنشد سيبويه : ( وهو الشاعر الخفاف بن ندبة السلمي )\nكنواح ريش حمامة نجدية ومسحت باللثتين عصف الإثمد\nواللثة هي الممسوحة بعصف الإثمد فقلب ، وأما على الاشتراك في الفعل والتساوي في نسبته كقول الشاعر : ( هو الأخطل )\nمثل القنافذ هداجون قد بلغت نجران أو بلغت سوءاتهم هجر\nفهذا ما لعلمائنا في معنى الباء ، وقال الشافعي : احتمل قول الله تعالى : وامسحوا برءوسكم بعض الرأس ومسح جميعه فدلت السنة أن مسح بعضه يجزئ ، وهو أن النبي صلى الله عليه وسلم مسح بناصيته ; وقال في موضع آخر : فإن قيل قد قال الله عز وجل : فامسحوا بوجوهكم في التيمم أيجزئ بعض الوجه فيه ؟ قيل له : مسح الوجه في التيمم بدل من غسله ; فلا بد أن يأتي بالمسح على جميع موضع الغسل منه ، ومسح الرأس أصل ; فهذا فرق ما بينهما . أجاب علماؤنا عن الحديث بأن قالوا : لعل النبي صلى الله عليه وسلم فعل ذلك لعذر لا سيما وكان هذا الفعل منه صلى الله عليه وسلم في السفر وهو مظنة الأعذار ، وموضع الاستعجال والاختصار ، وحذف كثير من الفرائض لأجل المشقات والأخطار ; ثم هو لم يكتف بالناصية حتى مسح على العمامة ; أخرجه مسلم من حديث المغيرة بن شعبة ; فلو لم يكن مسح جميع الرأس واجبا لما مسح على العمامة ; والله أعلم .\nالتاسعة : وجمهور العلماء على أن مسحة واحدة موعبة كاملة تجزئ ، وقال الشافعي : يمسح رأسه ثلاثا ; وروي عن أنس وسعيد بن جبير وعطاء ، وكان ابن سيرين يمسح مرتين . قال أبو داود : وأحاديث عثمان الصحاح كلها تدل على أن مسح الرأس مرة ; فإنهم ذكروا الوضوء ثلاثا ، قالوا فيها : ومسح برأسه ولم يذكروا عددا .\nالعاشرة : واختلفوا من أين يبدأ بمسحه ; فقال مالك : يبدأ بمقدم رأسه ، ثم يذهب بيديه إلى مؤخره ، ثم يردهما إلى مقدمه ; على حديث عبد الله بن زيد أخرجه مسلم ; وبه يقول الشافعي وابن حنبل ، وكان الحسن بن حي يقول : يبدأ بمؤخر الرأس ; على حديث الربيع بنت معوذ بن عفراء ; وهو حديث يختلف في ألفاظه ، وهو يدور على عبد الله بن محمد بن عقيل وليس بالحافظ عندهم ; أخرجه أبو داود من رواية بشر بن المفضل عن عبد الله عن الربيع ، وروى ابن عجلان عنه عن الربيع : أن رسول الله صلى الله عليه وسلم توضأ عندنا فمسح الرأس كله من قرن الشعر كل ناحية بمنصب الشعر ، لا يحرك الشعر عن هيئته ; ورويت هذه الصفة عن ابن عمر ، وأنه كان يبدأ من وسط رأسه ، وأصح ما في هذا الباب حديث عبد الله بن زيد ; وكل من أجاز بعض الرأس فإنما يرى ذلك البعض في مقدم الرأس . وروي عن إبراهيم والشعبي أنهما قالا : أي نواحي رأسك مسحت أجزأ عنك ، ومسح عمر اليافوخ فقط ، والإجماع منعقد على استحسان المسح باليدين معا ، وعلى الإجزاء إن مسح بيد واحدة ، واختلف فيمن مسح بإصبع واحدة حتى عم ما يرى أنه يجزئه من الرأس ; فالمشهور أن ذلك يجزئ ، وهو قول سفيان الثوري ; قال سفيان : إن مسح رأسه بإصبع واحدة أجزأه ، وقيل : إن ذلك لا يجزئ ; لأنه خروج عن سنة المسح وكأنه لعب ، إلا أن يكون ذلك عن ضرورة مرض فينبغي ألا يختلف في الإجزاء . قال أبو حنيفة وأبو يوسف ومحمد : لا يجزئ مسح الرأس بأقل من ثلاثة أصابع ; واختلفوا في رد اليدين على شعر الرأس هل هو فرض أو سنة - بعد الإجماع على أن المسحة الأولى فرض بالقرآن - فالجمهور على أنه سنة ، وقيل : هو فرض .\nالحادية عشرة : فلو غسل متوضئ رأسه بدل المسح فقال ابن العربي : لا نعلم خلافا أن ذلك يجزئه ، إلا ما أخبرنا الإمام فخر الإسلام الشاشي في الدرس عن أبي العباس بن القاص من أصحابهم قال : لا يجزئه ، وهذا تولج في مذهب الداودية الفاسد من اتباع الظاهر المبطل للشريعة الذي ذمه الله في قوله : يعلمون ظاهرا من الحياة الدنيا ، وقال تعالى : أم بظاهر من القول وإلا فقد جاء هذا الغاسل بما أمر وزيادة . فإن قيل : هذه زيادة خرجت عن اللفظ المتعبد به ; قلنا : ولم يخرج عن معناه في إيصال الفعل إلى المحل ; وكذلك لو مسح رأسه ثم حلقه لم يكن عليه إعادة المسح .\nالثانية عشرة : وأما الأذنان فهما من الرأس عند مالك وأحمد والثوري وأبي حنيفة وغيرهم ، ثم اختلفوا في تجديد الماء ; فقال مالك وأحمد : يستأنف لهما ماء جديدا سوى الماء الذي مسح به الرأس ، على ما فعل ابن عمر ; وهكذا قال الشافعي في تجديد الماء ، وقال : هما سنة على حالهما لا من الوجه ولا من الرأس ; لاتفاق العلماء على أنه لا يحلق ما عليهما من الشعر في الحج ; وقول أبي ثور في هذا كقول الشافعي ، وقال الثوري وأبو حنيفة : يمسحان مع الرأس بماء واحد ; وروي عن جماعة من السلف مثل هذا القول من الصحابة والتابعين ، وقال داود : إن مسح أذنيه فحسن ، وإلا فلا شيء عليه ; إذ ليستا مذكورتين في القرآن . قيل له : اسم الرأس تضمنهما كما بيناه ، وقد جاءت الأحاديث الصحيحة في كتاب النسائي وأبي داود وغيرهما بأن النبي صلى الله عليه وسلم مسح ظاهرهما وباطنهما ، وأدخل أصابعه في صماخيه ، وإنما يدل عدم ذكرهما من الكتاب على أنهما ليستا بفرض كغسل الوجه واليدين ، وثبتت سنة مسحهما بالسنة ، وأهل العلم يكرهون للمتوضئ ترك مسح أذنيه ويجعلونه تارك سنة من سنن النبي صلى الله عليه وسلم ، ولا يوجبون عليه إعادة إلا إسحاق فإنه قال : إن ترك مسح أذنيه لم يجزه ، وقال أحمد : إن تركهما عمدا أحببت أن يعيد ، وروي عن علي بن زياد من أصحاب مالك أنه قال : من ترك سنة من سنن الوضوء أو الصلاة عامدا أعاد ; وهذا عند الفقهاء ضعيف ، وليس لقائله سلف ولا له حظ من النظر ، ولو كان كذلك لم يعرف الفرض الواجب من غيره ; والله أعلم . احتج من قال : هما من الوجه بما ثبت عن النبي صلى الله عليه وسلم أنه كان يقول في سجوده : سجد وجهي للذي خلقه وصوره وشق سمعه وبصره فأضاف السمع إلى الوجه فثبت أن يكون لهما حكم الوجه ، وفي مصنف أبي داود من حديث عثمان : فغسل بطونهما وظهورهما مرة واحدة ، ثم غسل رجليه ثم قال : أين السائلون عن الوضوء ؟ هكذا رأيت رسول الله صلى الله عليه وسلم يتوضأ . احتج من قال : يغسل ظاهرهما مع الوجه ، وباطنهما يمسح مع الرأس بأن الله عز وجل قد أمر بغسل الوجه وأمر بمسح الرأس ; فما واجهك من الأذنين وجب غسله ; لأنه من الوجه وما لم يواجهك وجب مسحه لأنه من الرأس ، وهذا ترده الآثار بأن النبي صلى الله عليه وسلم كان يمسح ظاهر أذنيه وباطنهما من حديث علي وعثمان وابن عباس والربيع وغيرهم . احتج من قال : هما من الرأس بقوله صلى الله عليه وسلم من حديث الصنابحي : ( فإذا مسح رأسه خرجت الخطايا من رأسه حتى تخرج من أذنيه ) الحديث أخرجه مالك .\nالثالثة عشرة : قوله تعالى : \" وأرجلكم \" قرأ نافع وابن عامر والكسائي \" وأرجلكم \" بالنصب ; وروى الوليد بن مسلم عن نافع أنه قرأ \" وأرجلكم \" بالرفع وهي قراءة الحسن والأعمش سليمان ; وقرأ ابن كثير وأبو عمرو وحمزة \" وأرجلكم \" بالخفض وبحسب هذه القراءات اختلف الصحابة والتابعون ; فمن قرأ بالنصب جعل العام \" اغسلوا \" وبنى على أن الفرض في الرجلين الغسل دون المسح ، وهذا مذهب الجمهور والكافة من العلماء ، وهو الثابت من فعل النبي صلى الله عليه وسلم ، واللازم من قوله في غير ما حديث ، وقد رأى قوما يتوضئون وأعقابهم تلوح فنادى بأعلى صوته ويل للأعقاب من النار أسبغوا الوضوء . ثم إن الله حدهما فقال : إلى الكعبين كما قال في اليدين إلى المرافق فدل على وجوب غسلهما ; والله أعلم .\nومن قرأ بالخفض جعل العامل الباء ، قال ابن العربي : اتفقت العلماء على وجوب غسلهما ، وما علمت من رد ذلك سوى الطبري من فقهاء المسلمين ، والرافضة من غيرهم ، وتعلق الطبري بقراءة الخفض .\nقلت : قد روي عن ابن عباس أنه قال : الوضوء غسلتان ومسحتان ، وروي أن الحجاج خطب بالأهواز فذكر الوضوء فقال : اغسلوا وجوهكم وأيديكم وامسحوا برءوسكم وأرجلكم ، فإنه ليس شيء من ابن آدم أقرب من خبثه من قدميه ، فاغسلوا بطونهما وظهورهما وعراقيبهما . فسمع ذلك أنس بن مالك فقال : صدق الله وكذب الحجاج ; قال الله تعالى : وامسحوا برءوسكم وأرجلكم . قال : وكان إذا مسح رجليه بلهما ، وروي عن أنس أيضا أنه قال : نزل القرآن بالمسح والسنة بالغسل ، وكان عكرمة يمسح رجليه وقال : ليس في الرجلين غسل إنما نزل فيهما المسح ، وقال عامر الشعبي : نزل جبريل بالمسح ; ألا ترى أن التيمم يمسح فيه ما كان غسلا ، ويلغى ما كان مسحا ، وقال قتادة : افترض الله غسلتين ومسحتين ، وذهب ابن جرير الطبري إلى أن فرضهما التخيير بين الغسل والمسح ، وجعل القراءتين كالروايتين ; قال النحاس : ومن أحسن ما قيل فيه أن المسح والغسل واجبان جميعا ، فالمسح واجب على قراءة من قرأ بالخفض ، والغسل واجب على قراءة من قرأ بالنصب ، والقراءتان بمنزلة آيتين . قال ابن عطية : وذهب قوم ممن يقرأ بالكسر إلى أن المسح في الرجلين هو الغسل .\nقلت : وهو الصحيح ; فإن لفظ المسح مشترك ، يطلق بمعنى المسح ويطلق بمعنى الغسل ; قال الهروي : أخبرنا الأزهري أخبرنا أبو بكر محمد بن عثمان بن سعيد الداري عن أبي حاتم عن أبي زيد الأنصاري قال : المسح في كلام العرب يكون غسلا ويكون مسحا ، ومنه يقال للرجل إذا توضأ فغسل أعضاءه : قد تمسح ; ويقال : مسح الله ما بك إذا غسلك وطهرك من الذنوب ، فإذا ثبت بالنقل عن العرب أن المسح يكون بمعنى الغسل فترجح قول من قال : إن المراد بقراءة الخفض الغسل ; بقراءة النصب التي لا احتمال فيها ، وبكثرة الأحاديث الثابتة بالغسل ، والتوعد على ترك غسلها في أخبار صحاح لا تحصى كثرة أخرجها الأئمة ; ثم إن المسح في الرأس إنما دخل بين ما يغسل لبيان الترتيب على أنه مفعول قبل الرجلين ، التقدير فاغسلوا وجوهكم وأيديكم إلى المرافق وأرجلكم إلى الكعبين وامسحوا برءوسكم ; فلما كان الرأس مفعولا قبل الرجلين قدم عليهما في التلاوة - والله أعلم - لا أنهما مشتركان مع الرأس لتقدمه عليهما في صفة التطهير ، وقد روى عاصم بن كليب عن أبي عبد الرحمن السلمي قال : قرأ الحسن والحسين - رحمة الله عليهما - علي ( وأرجلكم ) فسمع علي ذلك وكان يقضي بين الناس فقال : ( وأرجلكم ) هذا من المقدم والمؤخر من الكلام ، وروى أبو إسحاق عن الحارث عن علي رضي الله عنه قال : اغسلوا الأقدام إلى الكعبين ، وكذا روي عن ابن مسعود وابن عباس أنهما قرآ ( وأرجلكم ) بالنصب ، وقد قيل : إن الخفض في الرجلين إنما جاء مقيدا لمسحهما لكن إذا كان عليهما خفان ، وتلقينا هذا القيد من رسول الله صلى الله عليه وسلم ، إذ لم يصح عنه أنه مسح رجليه إلا وعليهما خفان ، فبين صلى الله عليه وسلم بفعله الحال التي تغسل فيه الرجل والحال التي تمسح فيه ، وهذا حسن . فإن قيل : إن المسح على الخفين منسوخ بسورة ( المائدة ) - وقد قاله ابن عباس ، ورد المسح أبو هريرة وعائشة ، وأنكره مالك في رواية عنه - فالجواب أن من نفى شيئا وأثبته غيره فلا حجة للنافي ، وقد أثبت المسح على الخفين عدد كثير من الصحابة وغيرهم ، وقد قال الحسن : حدثني سبعون رجلا من أصحاب النبي صلى الله عليه وسلم أنهم مسحوا على الخفين ; وقد ثبت بالنقل الصحيح عن همام قال : بال جرير ثم توضأ ومسح على خفيه ; قال إبراهيم النخعي : وأن رسول الله صلى الله عليه وسلم بال ثم توضأ ومسح على خفيه ، قال إبراهيم النخعي : كان يعجبهم هذا الحديث ; لأن إسلام جرير كان بعد نزول ( المائدة ) وهذا نص يرد ما ذكروه وما احتجوا به من رواية الواقدي عن عبد الحميد بن جعفر عن أبيه أن جريرا أسلم في ستة عشر من شهر رمضان ، وأن ( المائدة ) نزلت في ذي الحجة يوم عرفات ، وهذا حديث لا يثبت لوهاه ; وإنما نزل منها يوم عرفة اليوم أكملت لكم دينكم على ما تقدم ; قال أحمد بن حنبل : أنا أستحسن حديث جرير في المسح على الخفين ; لأن إسلامه كان بعد نزول ( المائدة ) وأما ما روي عن أبي هريرة وعائشة رضي الله عنهما فلا يصح ، أما عائشة فلم يكن عندها بذلك علم ; ولذلك ردت السائل إلى علي رضي الله عنه وأحالته عليه فقالت : سله فإنه كان يسافر مع رسول الله صلى الله عليه وسلم ; الحديث ، وأما مالك فما روي عنه من الإنكار فهو منكر لا يصح ، والصحيح ما قاله عند موته لابن نافع قال : إني كنت آخذ في خاصة نفسي بالطهور ولا أرى من مسح مقصرا فيما يجب عليه ، وعلى هذا حمل أحمد بن حنبل ما رواه ابن وهب عنه أنه قال : لا أمسح في حضر ولا سفر . قال أحمد : كما روي عن ابن عمر أنه أمرهم أن يمسحوا خفافهم وخلع هو وتوضأ وقال : حبب إلي الوضوء ; ونحوه عن أبي أيوب ، وقال أحمد رضي الله عنه : فمن ترك ذلك على نحو ما تركه ابن عمر وأبو أيوب ومالك لم أنكره عليه ، وصلينا خلفه ولم نعبه ، إلا أن يترك ذلك ولا يراه كما صنع أهل البدع ، فلا يصلى خلفه ، والله أعلم ، وقد قيل : إن قوله ( وأرجلكم ) معطوف على اللفظ دون المعنى ، وهذا أيضا يدل على الغسل فإن المراعى المعنى لا اللفظ ، وإنما خفض للجوار كما تفعل العرب ; وقد جاء هذا في القرآن وغيره قال الله تعالى : يرسل عليكما شواظ من نار ونحاس بالجر لأن النحاس الدخان ، وقال : بل هو قرآن مجيد في لوح محفوظ بالجر . قال امرؤ القيس :\nكأن أبانا في أفانين ودقه كبير أناس في بجاد مزمل\nفخفض مزمل بالجوار ، وإن المزمل الرجل وإعرابه الرفع ; قال زهير :\nلعب الزمان بها وغيرها بعدي سوافي المور والقطر\nقال أبو حاتم : كان الوجه ( القطر ) بالرفع ولكنه جره على جوار المور ; كما قالت العرب : هذا جحر ضب خرب ; فجروه وإنما هو رفع ، وهذا مذهب الأخفش وأبي عبيدة ورده النحاس وقال : هذا القول غلط عظيم ; لأن الجوار لا يكون في الكلام أن يقاس عليه ، وإنما هو غلط ونظيره الإقواء .\nقلت : والقاطع في الباب من أن فرض الرجلين الغسل ما قدمناه ، وما ثبت من قوله عليه الصلاة والسلام ويل للأعقاب وبطون الأقدام من النار فخوفنا بذكر النار على مخالفة مراد الله عز وجل ، ومعلوم أن النار لا يعذب بها إلا من ترك الواجب ، ومعلوم أن المسح ليس شأنه الاستيعاب ولا خلاف بين القائلين بالمسح على الرجلين أن ذلك على ظهورهما لا على بطونهما ، فتبين بهذا الحديث بطلان قول من قال بالمسح ، إذ لا مدخل لمسح بطونهما عندهم ، وإنما ذلك يدرك بالغسل لا بالمسح ، ودليل آخر من جهة الإجماع ; وذلك أنهم اتفقوا على أن من غسل قدميه فقد أدى الواجب عليه ، واختلفوا فيمن مسح قدميه ; فاليقين ما أجمعوا عليه دون ما اختلفوا فيه ، ونقل الجمهور كافة عن كافة عن نبيهم صلى الله عليه وسلم أنه كان يغسل رجليه في وضوئه مرة واثنتين وثلاثا حتى ينقيهما ; وحسبك بهذا حجة في الغسل مع ما بيناه ، فقد وضح وظهر أن قراءة الخفض المعني فيها الغسل لا المسح كما ذكرنا ، وأن العامل في قوله وأرجلكم قوله : فاغسلوا والعرب قد تعطف الشيء على الشيء بفعل ينفرد به أحدهما تقول : أكلت الخبز واللبن أي : وشربت اللبن ; ومنه قول الشاعر :\nعلفتها تبنا وماء باردا\nوقال آخر :\nورأيت زوجك في الوغى متقلدا سيفا ورمحا\nوقال آخر :\nوأطفلت بالجلهتين ظباؤها ونعامها\nوقال آخر :\nشراب ألبان وتمر وأقط\nالتقدير : علفتها تبنا وسقيتها ماء ، ومتقلدا سيفا وحاملا رمحا ، وأطفلت بالجلهتين ظباؤها وفرخت نعامها ; والنعام لا يطفل إنما يفرخ ، وأطفلت كان لها أطفال ، والجلهتان جنبتا الوادي ، وشراب ألبان وآكل تمر ; فيكون قوله : وامسحوا برءوسكم وأرجلكم عطف بالغسل على المسح حملا على المعنى والمراد الغسل ; والله أعلم .\nالرابعة عشرة : قوله تعالى : إلى الكعبين روى البخاري : حدثني موسى قال أنبأنا وهيب عن عمرو - هو ابن يحيى - عن أبيه قال شهدت عمرو بن أبي حسن سأل عبد الله بن زيد عن وضوء النبي صلى الله عليه وسلم فدعا بتور من ماء ، فتوضأ لهم وضوء النبي صلى الله عليه وسلم ; فأكفأ على يده من التور فغسل يديه ثلاثا ، ثم أدخل يده في التور فمضمض واستنشق واستنثر ثلاث غرفات ، ثم أدخل يده فغسل وجهه ثلاثا ، ثم أدخل يديه فغسل يديه إلى المرفقين ثلاثا ، ثم أدخل يده فمسح رأسه فأقبل بهما وأدبر مرة واحدة ، ثم غسل رجليه إلى الكعبين ; فهذا الحديث دليل على أن الباء في قوله وامسحوا برءوسكم زائدة لقوله : فمسح رأسه ولم يقل برأسه ، وأن مسح الرأس مرة ، وقد جاء مبينا في كتاب مسلم من حديث عبد الله بن زيد في تفسير قوله : فأقبل بهما وأدبر ، وبدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ، ثم ردهما حتى رجع إلى المكان الذي بدأ منه ، واختلف العلماء في الكعبين فالجمهور على أنهما العظمان الناتئان في جنبي الرجل ، وأنكر الأصمعي قول الناس : إن الكعب في ظهر القدم ; قاله في ( الصحاح ) وروي عن ابن القاسم ، وبه قال محمد بن الحسن ; قال ابن عطية : ولا أعلم أحدا جعل حد الوضوء إلى هذا ، ولكن عبد الوهاب في التلقين جاء في ذلك بلفظ فيه تخليط وإيهام ; وقال الشافعي رحمه الله : لم أعلم مخالفا في أن الكعبين هما العظمان في مجمع مفصل الساق ; وروى الطبري عن يونس عن أشهب عن مالك قال : الكعبان اللذان يجب الوضوء إليهما هما العظمان الملتصقان بالساق المحاذيان للعقب ، وليس الكعب بالظاهر في وجه القدم .\nقلت : هذا هو الصحيح لغة وسنة فإن الكعب في كلام العرب مأخوذ من العلو ومنه سميت الكعبة ; وكعبت المرأة إذا فلك ثديها ، وكعب القناة أنبوبها ، وأنبوب ما بين كل عقدتين كعب ، وقد يستعمل في الشرف والمجد تشبيها ، ومنه الحديث : والله لا يزال كعبك عاليا ، وأما السنة فقوله صلى الله عليه وسلم فيما رواه أبو دواد عن النعمان بن بشير والله لتقيمن صفوفكم أو ليخالفن الله بين قلوبكم ، قال : فرأيت الرجل يلصق منكبه بمنكب صاحبه ، وركبته بركبة صاحبه وكعبه بكعبه والعقب هو مؤخر الرجل تحت العرقوب ، والعرقوب هو مجمع مفصل الساق والقدم ، ومنه الحديث ويل للعراقيب من النار يعني إذا لم تغسل ; كما قال : ويل للأعقاب وبطون الأقدام من النار .\nالخامسة عشرة : قال ابن وهب عن مالك : ليس على أحد تخليل أصابع رجليه في الوضوء ولا في الغسل ، ولا خير في الجفاء والغلو ; قال ابن وهب : تخليل أصابع الرجلين مرغب فيه ولا بد من ذلك في أصابع اليدين ; وقال ابن القاسم عن مالك : من لم يخلل أصابع رجليه فلا شيء عليه ، وقال محمد بن خالد عن ابن القاسم عن مالك فيمن توضأ على نهر فحرك رجليه : إنه لا يجزئه حتى يغسلهما بيديه ; قال ابن القاسم : وإن قدر على غسل إحداهما بالأخرى أجزأه .\nقلت : الصحيح أنه لا يجزئه فيهما إلا غسل ما بينهما كسائر الرجل إذ ذلك من الرجل ، كما أن ما بين أصابع اليد من اليد ، ولا اعتبار بانفراج أصابع اليدين وانضمام أصابع الرجلين ، فإن الإنسان مأمور بغسل الرجل جميعها كما هو مأمور بغسل اليد جميعها ، وقد روي عن النبي صلى الله عليه وسلم أنه كان إذا توضأ يدلك أصابع رجليه بخنصره ، مع ما ثبت أنه عليه الصلاة والسلام كان يغسل رجليه ; وهذا يقتضي العموم . وقد كان مالك رحمه الله في آخر عمره يدلك أصابع رجليه بخنصره أو ببعض أصابعه لحديث حدثه به ابن وهب عن ابن لهيعة والليث بن سعد عن يزيد بن عمرو الغفاري عن أبي عبد الرحمن الحبلي عن المستورد بن شداد القرشي قال : رأيت رسول الله صلى الله عليه وسلم يتوضأ فيخلل بخنصره ما بين أصابع رجليه ; قال ابن وهب ، فقال لي مالك : إن هذا لحسن ، وما سمعته قط إلا الساعة ; قال ابن وهب : وسمعته سئل بعد ذلك عن تخليل الأصابع في الوضوء فأمر به ، وقد روى حذيفة أن النبي صلى الله عليه وسلم قال : خللوا بين الأصابع لا تخللها النار وهذا نص في الوعيد على ترك التخليل ; فثبت ما قلناه ، والله الموفق .\nالسادسة عشرة : ألفاظ الآية تقتضي الموالاة بين الأعضاء ، وهي إتباع المتوضئ الفعل الفعل إلى آخره من غير تراخ بين أبعاضه ، ولا فصل بفعل ليس منه ; واختلف العلماء في ذلك ; فقال ابن أبي سلمة وابن وهب : ذلك من فروض الوضوء في الذكر والنسيان ، فمن فرق بين أعضاء وضوئه متعمدا أو ناسيا لم يجزه ، وقال ابن عبد الحكم : يجزئه ناسيا ومتعمدا ، وقال مالك في \" المدونة \" وكتاب محمد : إن الموالاة ساقطة ; وبه قال الشافعي ، وقال مالك وابن القاسم : إن فرقه متعمدا لم يجزه ويجزئه ناسيا ; وقال مالك في رواية ابن حبيب : يجزئه في المغسول ولا يجزئه في الممسوح ; فهذه خمسة أقوال ابتنيت على أصلين :\nالأول : أن الله سبحانه وتعالى أمر أمرا مطلقا فوال أو فرق ، وإنما المقصود وجود الغسل في جميع الأعضاء عند القيام إلى الصلاة .\nوالثاني : أنها عبادات ذات أركان مختلفة فوجب فيها التوالي كالصلاة ; وهذا أصح ، والله أعلم .\nالسابعة عشرة : وتتضمن ألفاظ الآية أيضا الترتيب وقد اختلف فيه ; فقال الأبهري : الترتيب سنة ، وظاهر المذهب أن التنكيس للناسي يجزئ ، واختلف في العامد فقيل : يجزئ ويرتب في المستقبل ، وقال أبو بكر القاضي وغيره : لا يجزئ لأنه عابث ، وإلى هذا ذهب الشافعي وسائر أصحابه ، وبه يقول أحمد بن حنبل وأبو عبيد القاسم بن سلام وإسحاق وأبو ثور ، وإليه ذهب أبو مصعب صاحب مالك وذكره في مختصره ، وحكاه عن أهل المدينة ومالك معهم في أن من قدم في الوضوء يديه على وجهه ، ولم يتوضأ على ترتيب الآية فعليه الإعادة لما صلى بذلك الوضوء ، وذهب مالك في أكثر الروايات عنه وأشهرها أن \" الواو \" لا توجب التعقيب ولا تعطي رتبة ، وبذلك قال أصحابه وهو قول أبي حنيفة وأصحابه والثوري والأوزاعي والليث بن سعد والمزني وداود بن علي ; قال إلكيا الطبري ظاهر قوله تعالى : فاغسلوا وجوهكم وأيديكم يقتضي الإجزاء فرق أو جمع أو والى على ما هو الصحيح من مذهب الشافعي ، وهو مذهب الأكثرين من العلماء . قال أبو عمر : إلا أن مالكا يستحب له استئناف الوضوء على النسق لما يستقبل من الصلاة ، ولا يرى ذلك واجبا عليه ; هذا تحصيل مذهبه ، وقد روى علي بن زياد عن مالك قال : من غسل ذراعيه ثم وجهه ثم ذكر مكانه أعاد غسل ذراعيه ، وإن لم يذكر حتى صلى أعاد الوضوء والصلاة ; قال علي ثم قال بعد ذلك : لا يعيد الصلاة ويعيد الوضوء لما يستأنف . وسبب الخلاف ما قال بعضهم : إن \" الفاء \" توجب التعقيب في قوله : \" فاغسلوا \" فإنها لما كانت جوابا للشرط ربطت المشروط به ، فاقتضت الترتيب في الجميع ; وأجيب بأنه إنما اقتضت البداءة في الوجه إذ هو جزاء الشرط وجوابه ، وإنما كنت تقتضي الترتيب في الجميع لو كان جواب الشرط معنى واحدا ، فإذا كانت جملا كلها جوابا لم تبال بأيها بدأت ، إذ المطلوب تحصيلها . قيل : إن الترتيب إنما جاء من قبل الواو ; وليس كذلك لأنك تقول : تقاتل زيد وعمرو ، وتخاصم بكر وخالد ، فدخولها في باب المفاعلة يخرجها عن الترتيب ، والصحيح أن يقال : إن الترتيب متلقى من وجوه أربعة :\nالأول : أن يبدأ بما بدأ الله به كما قال عليه الصلاة والسلام حين حج : نبدأ بما بدأ الله به .\nالثاني : من إجماع السلف فإنهم كانوا يرتبون .\nالثالث : من تشبيه الوضوء بالصلاة .\nالرابع : من مواظبة رسول الله صلى الله عليه وسلم على ذلك .\nاحتج من أجاز ذلك بالإجماع على أن لا ترتيب في غسل أعضاء الجنابة ، فكذلك غسل أعضاء الوضوء ; لأن المعنى في ذلك الغسل لا التبدية ، وروي عن علي أنه قال : ما أبالي إذا أتممت وضوئي بأي أعضائي بدأت ، وعن عبد الله بن مسعود قال : لا بأس أن تبدأ برجليك قبل يديك ; قال الدارقطني : هذا مرسل ولا يثبت ، والأولى وجوب الترتيب ، والله أعلم .\nالثامنة عشرة : إذا كان في الاشتغال بالوضوء فوات الوقت لم يتيمم عند أكثر العلماء ، ومالك يجوز التيمم في مثل ذلك ; لأن التيمم إنما جاء في الأصل لحفظ وقت الصلاة ، ولولا ذلك لوجب تأخير الصلاة إلى حين وجود الماء . احتج الجمهور بقوله تعالى : فلم تجدوا ماء فتيمموا وهذا واجد ، فقد عدم شرط صحة التيمم فلا يتيمم .\nالتاسعة عشرة : وقد استدل بعض العلماء بهذه الآية على أن إزالة النجاسة ليست بواجبة ; لأنه قال : إذا قمتم إلى الصلاة ولم يذكر الاستنجاء وذكر الوضوء ، فلو كانت إزالتها واجبة لكانت أول مبدوء به ; وهو قول أصحاب أبي حنيفة ، وهي رواية أشهب عن مالك ، وقال ابن وهب عن مالك : إزالتها واجبة في الذكر والنسيان ; وهو قول الشافعي ، وقال ابن القاسم : تجب إزالتها مع الذكر ، وتسقط مع النسيان ، وقال أبو حنيفة : تجب إزالة النجاسة إذا زادت على قدر الدرهم البغلي - يريد الكبير الذي هو على هيئة المثقال - قياسا على فم المخرج المعتاد الذي عفي عنه ، والصحيح رواية ابن وهب ; لأن النبي صلى الله عليه وسلم قال في صاحبي القبرين : إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان يمشي بالنميمة وأما الآخر فكان لا يستبرئ من بوله ولا يعذب إلا على ترك الواجب ; ولا حجة في ظاهر القرآن ; لأن الله سبحانه وتعالى إنما بين من آية الوضوء صفة الوضوء خاصة ، ولم يتعرض لإزالة النجاسة ولا غيرها .\nالموفية عشرين : ودلت الآية أيضا على المسح على الخفين كما بينا ، ولمالك في ذلك ثلاث روايات :\nالأولى : الإنكار مطلقا كما يقوله الخوارج ، وهذه الرواية منكرة وليست بصحيحة ، وقد تقدم .\nالثانية : يمسح في السفر دون الحضر ; لأن أكثر الأحاديث بالمسح إنما هي في السفر ; وحديث السباطة يدل على جواز المسح في الحضر ، أخرجه مسلم من حديث حذيفة قال : فلقد رأيتني أنا ورسول الله صلى الله عليه وسلم نتماشى ; فأتى سباطة قوم خلف حائط ، فقام كما يقوم أحدكم فبال فانتبذت منه ، فأشار إلي فجئت فقمت عند عقبه حتى فرغ - زاد في رواية - فتوضأ ومسح على خفيه ، ومثله حديث شريح بن هانئ قال : أتيت عائشة أسألها عن المسح على الخفين فقالت : عليك بابن أبي طالب فسله ; فإنه كان يسافر مع رسول الله صلى الله عليه وسلم ; فسألناه فقال : جعل رسول الله صلى الله عليه وسلم للمسافر ثلاثة أيام ولياليهن وللمقيم يوما وليلة ; - وهي الرواية الثالثة - يمسح حضرا وسفرا ; وقد تقدم ذكرها .\nالحادية والعشرون : ويمسح المسافر عند مالك على الخفين بغير توقيت ، وهو قول الليث بن سعد ; قال ابن وهب سمعت مالكا يقول : ليس عند أهل بلدنا في ذلك وقت . وروى أبو داود من حديث أبي بن عمارة أنه قال : يا رسول الله أمسح على الخفين ؟ قال : نعم ، قال : يوما ؟ قال : يوما ، قال : ويومين ؟ قال : ويومين ، قال : وثلاثة أيام ؟ قال : نعم وما شئت ، وفي رواية ( نعم وما بدا لك ) . قال أبو داود : وقد اختلف في إسناده وليس بالقوي . وقال الشافعي وأحمد بن حنبل والنعمان والطبري : يمسح المقيم يوما وليلة ، والمسافر ثلاثة أيام على حديث شريح وما كان مثله ; وروي عن مالك في رسالته إلى هارون أو بعض الخلفاء ، وأنكرها أصحابه .\nالثانية والعشرون : والمسح عند جميعهم لمن لبس خفيه على وضوء ; لحديث المغيرة بن شعبة أنه قال : كنت مع النبي صلى الله عليه وسلم ذات ليلة في مسير - الحديث - وفيه ; فأهويت لأنزع خفيه فقال : دعهما فإني أدخلتهما طاهرتين ومسح عليهما . ورأى أصبغ أن هذه طهارة التيمم ، وهذا بناء منه على أن التيمم يرفع الحدث . وشذ داود فقال : المراد بالطهارة هاهنا هي الطهارة من النجس فقط ; فإذا كانت رجلاه طاهرتين من النجاسة جاز المسح على الخفين ، وسبب الخلاف الاشتراك في اسم الطهارة .\nالثالثة والعشرون : ويجوز عند مالك المسح على الخف وإن كان فيه خرق يسير : قال ابن خويز منداد : معناه أن يكون الخرق لا يمنع من الانتفاع به ومن لبسه ، ويكون مثله يمشى فيه ، وبمثل قول مالك هذا قال الليث والثوري والشافعي والطبري ; وقد روي عن الثوري والطبري إجازة المسح على الخف المخرق جملة ، وقال الأوزاعي : يمسح على الخف وعلى ما ظهر من القدم ; وهو قول الطبري ، وقال أبو حنيفة : إذا كان ما ظهر من الرجل أقل من ثلاث أصابع مسح ، ولا يمسح إذا ظهر ثلاث ; وهذا تحديد يحتاج إلى توقيف ، ومعلوم أن أخفاف الصحابة رضي الله عنهم وغيرهم من التابعين كانت لا تسلم من الخرق اليسير ، وذلك متجاوز عند الجمهور منهم ، وروي عن الشافعي إذا كان الخرق في مقدم الرجل أنه لا يجوز المسح عليه . وقال الحسن بن حي : يمسح على الخف إذا كان ما ظهر منه يغطيه الجورب ، فإن ظهر شيء من القدم لم يمسح ، قال أبو عمر : هذا على مذهبه في المسح على الجوربين إذا كانا ثخينين ; وهو قول الثوري وأبي يوسف ومحمد وهي :\nالرابعة والعشرون : ولا يجوز المسح على الجوربين عند أبي حنيفة والشافعي إلا أن يكونا مجلدين ، وهو أحد قولي مالك ، وله قول آخر أنه لا يجوز المسح على الجوربين وإن كانا مجلدين ، وفي كتاب أبي داود عن المغيرة بن شعبة أن رسول الله صلى الله عليه وسلم توضأ ومسح على الجوربين والنعلين ; قال أبو داود : وكان عبد الرحمن بن مهدي لا يحدث بهذا الحديث ; لأن المعروف عن المغيرة أن النبي صلى الله عليه وسلم مسح على الخفين ; وروي هذا الحديث عن أبي موسى الأشعري عن النبي صلى الله عليه وسلم وليس بالقوي ولا بالمتصل . قال أبو داود : ومسح على الجوربين علي بن أبي طالب وأبو مسعود والبراء بن عازب وأنس بن مالك وأبو أمامة وسهل بن سعد وعمرو بن حريث ; وروي ذلك عن عمر بن الخطاب وابن عباس ; رضي الله عنهم أجمعين .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قُمۡتُمۡ إِلَى ٱلصَّلَوٰةِ فَٱغۡسِلُواْ وُجُوهَكُمۡ وَأَيۡدِيَكُمۡ إِلَى ٱلۡمَرَافِقِ وَٱمۡسَحُواْ بِرُءُوسِكُمۡ وَأَرۡجُلَكُمۡ إِلَى ٱلۡكَعۡبَيۡنِۚ وَإِن كُنتُمۡ جُنُبٗا فَٱطَّهَّرُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُم مِّنۡهُۚ مَا يُرِيدُ ٱللَّهُ لِيَجۡعَلَ عَلَيۡكُم مِّنۡ حَرَجٖ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمۡ وَلِيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ ٦\n                                        \n                                        \n                                        \n                                        هذه آية عظيمة قد اشتملت على أحكام كثيرة، نذكر منها ما يسره الله وسهله. أحدها: أن هذه المذكورات فيها امتثالها والعمل بها من لوازم الإيمان الذي لا يتم إلا به، لأنه صدرها بقوله { يَأَيُّهَا الَّذِينَ آمَنُوا ْ} إلى آخرها. أي: يا أيها الذين آمنوا، اعملوا بمقتضى إيمانكم بما شرعناه لكم. الثاني: الأمر بالقيام بالصلاة لقوله: { إِذَا قُمْتُمْ إِلَى الصَّلَاةِ ْ} الثالث: الأمر بالنية للصلاة، لقوله: { إِذَا قُمْتُمْ إِلَى الصَّلَاةِ ْ} أي: بقصدها ونيتها. الرابع: اشتراط الطهارة لصحة الصلاة، لأن الله أمر بها عند القيام إليها، والأصل في الأمر الوجوب. الخامس: أن الطهارة لا تجب بدخول الوقت، وإنما تجب عند إرادة الصلاة. السادس: أن كل ما يطلق عليه اسم الصلاة، من الفرض والنفل، وفرض الكفاية، وصلاة الجنازة، تشترط له الطهارة، حتى السجود المجرد عند كثير من العلماء، كسجود التلاوة والشكر. السابع: الأمر بغسل الوجه، وهو: ما تحصل به المواجهة من منابت شعر الرأس المعتاد، إلى ما انحدر من اللحيين والذقن طولا. ومن الأذن إلى الأذن عرضا. ويدخل فيه المضمضة والاستنشاق، بالسنة، ويدخل فيه الشعور التي فيه. لكن إن كانت خفيفة فلا بد من إيصال الماء إلى البشرة، وإن كانت كثيفة اكتفي بظاهرها. الثامن: الأمر بغسل اليدين، وأن حدهما إلى المرفقين و \"إلى\" كما قال جمهور المفسرين بمعنى \"مع\" كقوله تعالى: { وَلَا تَأْكُلُوا أَمْوَالَهُمْ إِلَى أَمْوَالِكُمْ ْ} ولأن الواجب لا يتم إلا بغسل جميع المرفق. التاسع: الأمر بمسح الرأس. العاشر: أنه يجب مسح جميعه، لأن الباء ليست للتبعيض، وإنما هي للملاصقة، وأنه يعم المسح بجميع الرأس. الحادي عشر: أنه يكفي المسح كيفما كان، بيديه أو إحداهما، أو خرقة أو خشبة أو نحوهما، لأن الله أطلق المسح ولم يقيده بصفة، فدل ذلك على إطلاقه. الثاني عشر: أن الواجب المسح. فلو غسل رأسه ولم يمر يده عليه لم يكف، لأنه لم يأت بما أمر الله به. الثالث عشر: الأمر بغسل الرجلين إلى الكعبين، ويقال فيهما ما يقال في اليدين. الرابع عشر: فيها الرد على الرافضة، على قراءة الجمهور بالنصب، وأنه لا يجوز مسحهما ما دامتا مكشوفتين. الخامس عشر: فيه الإشارة إلى مسح الخفين، على قراءة الجر في { وأرجلكم ْ} وتكون كل من القراءتين، محمولة على معنى، فعلى قراءة النصب فيها، غسلهما إن كانتا مكشوفتين، وعلى قراءة الجر فيها، مسحهما إذا كانتا مستورتين بالخف. السادس عشر: الأمر بالترتيب في الوضوء، لأن الله تعالى ذكرها مرتبة. ولأنه أدخل ممسوحا -وهو الرأس- بين مغسولين، ولا يعلم لذلك فائدة غير الترتيب. السابع عشر: أن الترتيب مخصوص بالأعضاء الأربعة المسميات في هذه الآية. وأما الترتيب بين المضمضة والاستنشاق والوجه، أو بين اليمنى واليسرى من اليدين والرجلين، فإن ذلك غير واجب، بل يستحب تقديم المضمضة والاستنشاق على غسل الوجه، وتقديم اليمنى على اليسرى من اليدين والرجلين، وتقديم مسح الرأس على مسح الأذنين. الثامن عشر: الأمر بتجديد الوضوء عند كل صلاة، لتوجد صورة المأمور به. التاسع عشر: الأمر بالغسل من الجنابة. العشرون: أنه يجب تعميم الغسل للبدن، لأن الله أضاف التطهر للبدن، ولم يخصصه بشيء دون شيء. الحادي والعشرون: الأمر بغسل ظاهر الشعر وباطنه في الجنابة. الثاني والعشرون: أنه يندرج الحدث الأصغر في الحدث الأكبر، ويكفي من هما عليه أن ينوي، ثم يعمم بدنه، لأن الله لم يذكر إلا التطهر، ولم يذكر أنه يعيد الوضوء. الثالث والعشرون: أن الجنب يصدق على من أنزل المني يقظة أو مناما، أو جامع ولو لم ينزل. الرابع والعشرون: أن من ذكر أنه احتلم ولم يجد بللا، فإنه لا غسل عليه، لأنه لم تتحقق منه الجنابة. الخامس والعشرون: ذكر مِنَّة الله تعالى على العباد، بمشروعية التيمم. السادس والعشرون: أن من أسباب جواز التيمم وجود المرض الذي يضره غسله بالماء، فيجوز له التيمم. السابع والعشرون: أن من جملة أسباب جوازه، السفر والإتيان من البول والغائط إذا عدم الماء، فالمرض يجوز التيمم مع وجود الماء لحصول التضرر به، وباقيها يجوزه العدم للماء ولو كان في الحضر. الثامن والعشرون: أن الخارج من السبيلين من بول وغائط، ينقض الوضوء. التاسع والعشرون: استدل بها من قال: لا ينقض الوضوء إلا هذان الأمران، فلا ينتقض بلمس الفرج ولا بغيره. الثلاثون: استحباب التكنية عما يستقذر التلفظ به لقوله تعالى: { أَوْ جَاءَ أَحَدٌ مِنكُم مِّنَ الْغَائِطِ ْ} الحادي والثلاثون: أن لمس المرأة بلذة وشهوة ناقض للوضوء. الثاني والثلاثون: اشتراط عدم الماء لصحة التيمم. الثالث والثلاثون: أن مع وجود الماء ولو في الصلاة، يبطل التيمم لأن الله إنما أباحه مع عدم الماء. الرابع والثلاثون: أنه إذا دخل الوقت وليس معه ماء، فإنه يلزمه طلبه في رحله وفيما قرب منه، لأنه لا يقال \"لم يجد\" لمن لم يطلب. الخامس والثلاثون: أن من وجد ماء لا يكفي بعض طهارته، فإنه يلزمه استعماله، ثم يتيمم بعد ذلك. السادس والثلاثون: أن الماء المتغير بالطاهرات، مقدم على التيمم، أي: يكون طهورا، لأن الماء المتغير ماء، فيدخل في قوله: { فَلَمْ تَجِدُوا مَاءً ْ} السابع والثلاثون: أنه لا بد من نية التيمم لقوله: { فَتَيَمَّمُوا ْ} أي: اقصدوا. الثامن والثلاثون: أنه يكفي التيمم بكل ما تصاعد على وجه الأرض من تراب وغيره. فيكون على هذا، قوله: { فَامْسَحُوا بِوُجُوهِكُمْ وَأَيْدِيكُم مِّنْهُ ْ} إما من باب التغليب، وأن الغالب أن يكون له غبار يمسح منه ويعلق بالوجه واليدين، وإما أن يكون إرشادا للأفضل، وأنه إذا أمكن التراب الذي فيه غبار فهو أولى. التاسع والثلاثون: أنه لا يصح التيمم بالتراب النجس، لأنه لا يكون طيبا بل خبيثا. الأربعون: أنه يمسح في التيمم الوجه واليدان فقط، دون بقية الأعضاء. الحادي والأربعون: أن قوله: { بِوُجُوهِكُمْ ْ} شامل لجميع الوجه وأنه يعممه بالمسح، إلا أنه معفو عن إدخال التراب في الفم والأنف، وفيما تحت الشعور، ولو خفيفة. الثاني والأربعون: أن اليدين تمسحان إلى الكوعين فقط، لأن اليدين عند الإطلاق كذلك. فلو كان يشترط إيصال المسح إلى الذراعين لقيده الله بذلك، كما قيده في الوضوء. الثالث والأربعون: أن الآية عامة في جواز التيمم، لجميع الأحداث كلها، الحدث الأكبر والأصغر، بل ولنجاسة البدن، لأن الله جعلها بدلا عن طهارة الماء، وأطلق في الآية فلم يقيد [وقد يقال أن نجاسة البدن لا تدخل في حكم التيمم لأن السياق في الأحداث وهو قول جمهور العلماء] الرابع والأربعون: أن محل التيمم في الحدث الأصغر والأكبر واحد، وهو الوجه واليدان. الخامس والأربعون: أنه لو نوى مَنْ عليه حدثان التيمم عنهما، فإنه يجزئ أخذا من عموم الآية وإطلاقها. السادس والأربعون: أنه يكفي المسح بأي شيء كان، بيده أو غيرها، لأن الله قال { فامسحوا ْ} ولم يذكر الممسوح به، فدل على جوازه بكل شيء. السابع والأربعون: اشتراط الترتيب في طهارة التيمم، كما يشترط ذلك في الوضوء، ولأن الله بدأ بمسح الوجه قبل مسح اليدين. الثامن والأربعون: أن الله تعالى -فيما شرعه لنا من الأحكام- لم يجعل علينا في ذلك من حرج ولا مشقة ولا عسر، وإنما هو رحمة منه بعباده ليطهرهم، وليتم نعمته عليهم. وهذا هو التاسع والأربعون: أن طهارة الظاهر بالماء والتراب، تكميل لطهارة الباطن بالتوحيد، والتوبة النصوح. الخمسون: أن طهارة التيمم، وإن لم يكن فيها نظافة وطهارة تدرك بالحس والمشاهدة، فإن فيها طهارة معنوية ناشئة عن امتثال أمر الله تعالى. الحادي والخمسون: أنه ينبغي للعبد أن يتدبر الحِكَم والأسرار في شرائع الله، في الطهارة وغيرها ليزداد معرفة وعلما، ويزداد شكرا لله ومحبة له، على ما شرع من الأحكام التي توصل العبد إلى المنازل العالية الرفيعة.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قُمۡتُمۡ إِلَى ٱلصَّلَوٰةِ فَٱغۡسِلُواْ وُجُوهَكُمۡ وَأَيۡدِيَكُمۡ إِلَى ٱلۡمَرَافِقِ وَٱمۡسَحُواْ بِرُءُوسِكُمۡ وَأَرۡجُلَكُمۡ إِلَى ٱلۡكَعۡبَيۡنِۚ وَإِن كُنتُمۡ جُنُبٗا فَٱطَّهَّرُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُم مِّنۡهُۚ مَا يُرِيدُ ٱللَّهُ لِيَجۡعَلَ عَلَيۡكُم مِّنۡ حَرَجٖ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمۡ وَلِيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ ٦"
    },
    {
      "number": 676,
      "text": "وَاذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ وَمِيثَاقَهُ الَّذِي وَاثَقَكُمْ بِهِ إِذْ قُلْتُمْ سَمِعْنَا وَأَطَعْنَا ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 7,
      "juz": 6,
      "manzil": 2,
      "page": 108,
      "ruku": 87,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ وَمِيثَٰقَهُ ٱلَّذِي وَاثَقَكُم بِهِۦٓ إِذۡ قُلۡتُمۡ سَمِعۡنَا وَأَطَعۡنَاۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ ٧\n                                    \n                                    \n                                    يقول تعالى مذكرا عباده المؤمنين نعمته عليهم في شرعه لهم هذا الدين العظيم ، وإرساله إليهم هذا الرسول الكريم ، وما أخذ عليهم من العهد والميثاق في مبايعته على متابعته ومناصرته ومؤازرته ، والقيام بدينه وإبلاغه عنه وقبوله منه ، فقال [ تعالى ] ( واذكروا نعمة الله عليكم وميثاقه الذي واثقكم به إذ قلتم سمعنا وأطعنا ) وهذه هي البيعة التي كانوا يبايعون رسول الله صلى الله عليه وسلم عليها عند إسلامهم ، كما قالوا : \" بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في منشطنا ومكرهنا وأثرة علينا ، وألا ننازع الأمر أهله \" ، وقال تعالى : ( وما لكم لا تؤمنون بالله والرسول يدعوكم لتؤمنوا بربكم وقد أخذ ميثاقكم إن كنتم مؤمنين ) [ الحديد : 8 ] وقيل : هذا تذكار لليهود بما أخذ عليهم من المواثيق والعهود في متابعة محمد صلى الله عليه وسلم والانقياد لشرعه ، رواه علي بن أبي طلحة ، عن ابن عباس . وقيل : هو تذكار بما أخذ تعالى من العهد على ذرية آدم حين استخرجهم من صلبه وأشهدهم على أنفسهم : ( ألست بربكم قالوا بلى شهدنا ) [ الأعراف : 172 ] قاله مجاهد ومقاتل بن حيان . والقول الأول أظهر ، وهو المحكي عن ابن عباس والسدي . واختاره ابن جرير .\nثم قال تعالى : ( واتقوا الله ) تأكيد وتحريض على مواظبة التقوى في كل حال .\nثم أعلمهم أنه يعلم ما يتخالج في الضمائر والسرائر من الأسرار والخواطر ، فقال : ( إن الله عليم بذات الصدور )\n                                    ",
        "qortoby": "وَٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ وَمِيثَٰقَهُ ٱلَّذِي وَاثَقَكُم بِهِۦٓ إِذۡ قُلۡتُمۡ سَمِعۡنَا وَأَطَعۡنَاۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ ٧\n                                    \n                                    \n                                    قوله تعالى : واذكروا نعمة الله عليكم وميثاقه الذي واثقكم به إذ قلتم سمعنا وأطعنا واتقوا الله إن الله عليم بذات الصدور\nقوله تعالى : واذكروا نعمة الله عليكم وميثاقه الذي واثقكم به قيل : هو الميثاق الذي في قوله عز وجل : وإذ أخذ ربك من بني آدم ; قال مجاهد وغيره ، ونحن وإن لم نذكره فقد أخبرنا الصادق به ، فيجوز أن نؤمر بالوفاء به ، وقيل : هو خطاب لليهود بحفظ ما أخذ عليهم في التوراة ; والذي عليه الجمهور من المفسرين كابن عباس والسدي هو العهد والميثاق الذي جرى لهم مع النبي صلى الله عليه وسلم على السمع والطاعة في المنشط والمكره إذ قالوا : سمعنا وأطعنا ، كما جرى ليلة العقبة وتحت الشجرة ، وأضافه تعالى إلى نفسه كما قال : إنما يبايعون الله فبايعوا رسول الله صلى الله عليه وسلم عند العقبة على أن يمنعوه مما يمنعون منه أنفسهم ونساءهم وأبناءهم ، وأن يرحل إليهم هو وأصحابه ، وكان أول من بايعه البراء بن معرور ، وكان له في تلك الليلة المقام المحمود في التوثق لرسول الله صلى الله عليه وسلم ، والشد لعقد أمره ، وهو القائل : والذي بعثك بالحق لأمنعنك مما نمنع منه أزرنا ، فبايعنا يا رسول الله فنحن والله أبناء الحروب وأهل الحلقة ورثناها كابرا عن كابر . الخبر المشهور في سيرة ابن إسحاق ، ويأتي ذكر بيعة الرضوان في موضعها ، وقد اتصل هذا بقوله تعالى : أوفوا بالعقود فوفوا بما قالوا ; جزاهم الله تعالى عن نبيهم وعن الإسلام خيرا ، ورضي الله عنهم وأرضاهم . واتقوا الله أي : في مخالفته إنه عالم بكل شيء .\n                                    ",
        "saadi": "وَٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ وَمِيثَٰقَهُ ٱلَّذِي وَاثَقَكُم بِهِۦٓ إِذۡ قُلۡتُمۡ سَمِعۡنَا وَأَطَعۡنَاۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ ٧\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده بذكر نعمه الدينية والدنيوية، بقلوبهم وألسنتهم. فإن في استدامة ذكرها داعيا لشكر الله تعالى ومحبته، وامتلاء القلب من إحسانه. وفيه زوال للعجب من النفس بالنعم الدينية، وزيادة لفضل الله وإحسانه. و { مِيثَاقَهُْ} أي: واذكروا ميثاقه { الَّذِي وَاثَقَكُمْ بِهِ ْ} أي: عهده الذي أخذه عليكم. وليس المراد بذلك أنهم لفظوا ونطقوا بالعهد والميثاق، وإنما المراد بذلك أنهم بإيمانهم بالله ورسوله قد التزموا طاعتهما، ولهذا قال: { إِذْ قُلْتُمْ سَمِعْنَا وَأَطَعْنَا ْ} أي: سمعنا ما دعوتنا به من آياتك القرآنية والكونية، سمع فهم وإذعان وانقياد. وأطعنا ما أمرتنا به بالامتثال، وما نهيتنا عنه بالاجتناب. وهذا شامل لجميع شرائع الدين الظاهرة والباطنة. وأن المؤمنين يذكرون في ذلك عهد الله وميثاقه عليهم، وتكون منهم على بال، ويحرصون على أداء ما أُمِرُوا به كاملا غير ناقص. { وَاتَّقُوا اللَّهَ ْ} في جميع أحوالكم { إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ ْ} أي: بما تنطوي عليه من الأفكار والأسرار والخواطر. فاحذروا أن يطلع من قلوبكم على أمر لا يرضاه، أو يصدر منكم ما يكرهه، واعمروا قلوبكم بمعرفته ومحبته والنصح لعباده. فإنكم -إن كنتم كذلك- غفر لكم السيئات، وضاعف لكم الحسنات، لعلمه بصلاح قلوبكم.\n                                    "
      },
      "originalText": "وَٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ وَمِيثَٰقَهُ ٱلَّذِي وَاثَقَكُم بِهِۦٓ إِذۡ قُلۡتُمۡ سَمِعۡنَا وَأَطَعۡنَاۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ ٧"
    },
    {
      "number": 677,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ۖ وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَىٰ أَلَّا تَعْدِلُوا ۚ اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَىٰ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 8,
      "juz": 6,
      "manzil": 2,
      "page": 108,
      "ruku": 87,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلۡقِسۡطِۖ وَلَا يَجۡرِمَنَّكُمۡ شَنَ‍َٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْۚ ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ ٨\n                                    \n                                    \n                                    وقوله : ( يا أيها الذين آمنوا كونوا قوامين لله ) أي : كونوا قوامين بالحق لله ، عز وجل ، لا لأجل الناس والسمعة ، وكونوا ( شهداء بالقسط ) أي : بالعدل لا بالجور . وقد ثبت في الصحيحين ، عن النعمان بن بشير أنه قال : نحلني أبي نحلا فقالت أمي عمرة بنت رواحة : لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم . فجاءه ليشهده على صدقتي فقال : \" أكل ولدك نحلت مثله؟ \" قال : لا . قال : \" اتقوا الله ، واعدلوا في أولادكم \" . وقال : \" إني لا أشهد على جور \" . قال : فرجع أبي فرد تلك الصدقة .\nوقوله : ( ولا يجرمنكم شنآن قوم على ألا تعدلوا ) أي : لا يحملنكم بغض قوم على ترك العدل فيهم ، بل استعملوا العدل في كل أحد ، صديقا كان أو عدوا ; ولهذا قال : ( اعدلوا هو أقرب للتقوى ) أي : عدلكم أقرب إلى التقوى من تركه . ودل الفعل على المصدر الذي عاد الضمير عليه ، كما في نظائره من القرآن وغيره ، كما في قوله : ( وإن قيل لكم ارجعوا فارجعوا هو أزكى لكم ) [ النور : 28 ]\nوقوله : ( هو أقرب للتقوى ) من باب استعمال أفعل التفضيل في المحل الذي ليس في الجانب الآخر منه شيء ، كما في قوله [ تعالى ] ( أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا ) [ الفرقان : 24 ] وكقول بعض الصحابيات لعمر : أنت أفظ وأغلظ من رسول الله صلى الله عليه وسلم .\nثم قال تعالى : ( واتقوا الله إن الله خبير بما تعملون ) أي : وسيجزيكم على ما علم من أفعالكم التي عملتموها ، إن خيرا فخير ، وإن شرا فشر ; ولهذا قال بعده :\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلۡقِسۡطِۖ وَلَا يَجۡرِمَنَّكُمۡ شَنَ‍َٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْۚ ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ ٨\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا كونوا قوامين لله شهداء بالقسط ولا يجرمنكم شنآن قوم على ألا تعدلوا اعدلوا هو أقرب للتقوى واتقوا الله إن الله خبير بما تعملون\nقوله تعالى : ياأيها الذين آمنوا كونوا قوامين الآية تقدم معناها في \" النساء \" ، والمعنى : أتممت عليكم نعمتي فكونوا قوامين لله ، أي : لأجل ثواب الله ; فقوموا بحقه ، واشهدوا بالحق من غير ميل إلى أقاربكم ، وحيف على أعدائكم . ولا يجرمنكم شنآن قوم على ترك العدل وإيثار العدوان على الحق ، وفي هذا دليل على نفوذ حكم العدو على عدوه في الله تعالى ونفوذ شهادته عليه ; لأنه أمر بالعدل وإن أبغضه ، ولو كان حكمه عليه وشهادته لا تجوز فيه مع البغض له لما كان لأمره بالعدل فيه وجه ، ودلت الآية أيضا على أن كفر الكافر لا يمنع من العدل عليه ، وأن يقتصر بهم على المستحق من القتال والاسترقاق ، وأن المثلة بهم غير جائزة وإن قتلوا نساءنا وأطفالنا وغمونا بذلك ; فليس لنا أن نقتلهم بمثلة قصدا لإيصال الغم والحزن إليهم ; وإليه أشار عبد الله بن رواحة بقوله في القصة المشهورة : هذا معنى الآية . وتقدم في صدر هذه السورة معنى قوله : ولا يجرمنكم شنآن قوم ، وقرئ \" ولا يجرمنكم \" قال الكسائي : هما لغتان . وقال الزجاج : معنى \" لا يجرمنكم \" لا يدخلنكم في الجرم ; كما تقول : آثمني أي : أدخلني في الإثم . ومعنى : هو أقرب للتقوى أي : لأن تتقوا الله ، وقيل : لأن تتقوا النار .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلۡقِسۡطِۖ وَلَا يَجۡرِمَنَّكُمۡ شَنَ‍َٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْۚ ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ ٨\n                                        \n                                        \n                                        \n                                        أي { يَأَيُّهَا الَّذِينَ آمَنُوا ْ} بما أُمِرُوا بالإيمان به، قوموا بلازم إيمانكم، بأن تكونوا { قَوَّامِينَ لِلَّهِ شُهَدَاءَ بِالْقِسْطِ ْ} بأن تنشط للقيام بالقسط حركاتكم الظاهرة والباطنة. وأن يكون ذلك القيام لله وحده، لا لغرض من الأغراض الدنيوية، وأن تكونوا قاصدين للقسط، الذي هو العدل، لا الإفراط ولا التفريط، في أقوالكم ولا أفعالكم، وقوموا بذلك على القريب والبعيد، والصديق والعدو. { وَلَا يَجْرِمَنَّكُمْ ْ} أي: لا يحملنكم بغض { قَوْمٍ عَلَى أَلَّا تَعْدِلُوا ْ} كما يفعله من لا عدل عنده ولا قسط، بل كما تشهدون لوليكم، فاشهدوا عليه، وكما تشهدون على عدوكم فاشهدوا له، ولو كان كافرا أو مبتدعا، فإنه يجب العدل فيه، وقبول ما يأتي به من الحق، لأنه حق لا لأنه قاله، ولا يرد الحق لأجل قوله، فإن هذا ظلم للحق. { اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَى ْ} أي: كلما حرصتم على العدل واجتهدتم في العمل به، كان ذلك أقرب لتقوى قلوبكم، فإن تم العدل كملت التقوى. { إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ ْ} فمجازيكم بأعمالكم، خيرها وشرها، صغيرها وكبيرها، جزاء عاجلا، وآجلا.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُواْ قَوَّٰمِينَ لِلَّهِ شُهَدَآءَ بِٱلۡقِسۡطِۖ وَلَا يَجۡرِمَنَّكُمۡ شَنَ‍َٔانُ قَوۡمٍ عَلَىٰٓ أَلَّا تَعۡدِلُواْۚ ٱعۡدِلُواْ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ ٨"
    },
    {
      "number": 678,
      "text": "وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ ۙ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ عَظِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 9,
      "juz": 6,
      "manzil": 2,
      "page": 108,
      "ruku": 87,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٞ ٩\n                                    \n                                    \n                                    ( وعد الله الذين آمنوا وعملوا الصالحات لهم مغفرة ) أي : لذنوبهم ( وأجر عظيم ) وهو : الجنة التي هي من رحمته على عباده ، لا ينالونها بأعمالهم ، بل برحمة منه وفضل ، وإن كان سبب وصول الرحمة إليهم أعمالهم ، وهو تعالى الذي جعلها أسبابا إلى نيل رحمته وفضله وعفوه ورضوانه ، فالكل منه وله ، فله الحمد والمنة .\n                                    ",
        "qortoby": "وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٞ ٩\n                                    \n                                    \n                                    ومعنى لهم مغفرة وأجر عظيم أي : قال الله في حق المؤمنين : لهم مغفرة وأجر عظيم أي : لا تعرف كنهه أفهام الخلق ; كما قال : فلا تعلم نفس ما أخفي لهم من قرة أعين ، وإذا قال الله تعالى : أجر عظيم و أجر كريم و أجر كبير فمن ذا الذي يقدر قدره ؟ ، ولما كان الوعد من قبيل القول حسن إدخال اللام في قوله : لهم مغفرة وهو في موضع نصب ; لأنه وقع موقع الموعود به ، على معنى وعدهم أن لهم مغفرة أو وعدهم مغفرة إلا أن الجملة وقعت موقع المفرد ; كما قال الشاعر :\nوجدنا الصالحين لهم جزاء وجنات وعين سلسبيل\nوموضع الجملة نصب ; ولذلك عطف عليها بالنصب ، وقيل : هو في موضع رفع على أن يكون الموعود به محذوفا ; على تقدير لهم مغفرة وأجر عظيم فيما وعدهم به ، وهذا المعنى عن الحسن .\n                                    ",
        "saadi": "وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٞ ٩\n                                        \n                                        \n                                        \n                                        أي { وَعَدَ اللَّهُ ْ} الذي لا يخلف الميعاد وهو أصدق القائلين -المؤمنين به وبكتبه ورسله واليوم الآخر، { وَعَمِلُوا الصَّالِحَاتِ ْ} من واجبات ومستحبات- بالمغفرة لذنوبهم، بالعفو عنها وعن عواقبها، وبالأجر العظيم الذي لا يعلم عظمه إلا الله تعالى. { فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُم مِن قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ ْ}\n                                    "
      },
      "originalText": "وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٞ ٩"
    }
  ]
}