{
  "number": 109,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 679,
      "text": "وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 10,
      "juz": 6,
      "manzil": 2,
      "page": 109,
      "ruku": 87,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِ‍َٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ ٠١\n                                    \n                                    \n                                    ثم قال : ( والذين كفروا وكذبوا بآياتنا أولئك أصحاب الجحيم ) وهذا من عدله تعالى ، وحكمته وحكمه الذي لا يجور فيه ، بل هو الحكم العدل الحكيم القدير .\n                                    ",
        "qortoby": "وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِ‍َٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ ٠١\n                                    \n                                    \n                                    والذين كفروا نزلت في بني النضير ، وقيل في جميع الكفار .\n                                    ",
        "saadi": "وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِ‍َٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ ٠١\n                                        \n                                        \n                                        \n                                        { وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا ْ} الدالة على الحق المبين، فكذبوا بها بعد ما أبانت الحقائق. { أُولَئِكَ أَصْحَابُ الْجَحِيمِ ْ} الملازمون لها ملازمة الصاحب لصاحبه.\n                                    "
      },
      "originalText": "وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِ‍َٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ ٠١"
    },
    {
      "number": 680,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ هَمَّ قَوْمٌ أَنْ يَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ فَكَفَّ أَيْدِيَهُمْ عَنْكُمْ ۖ وَاتَّقُوا اللَّهَ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 11,
      "juz": 6,
      "manzil": 2,
      "page": 109,
      "ruku": 87,
      "hizbQuarter": 43,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ هَمَّ قَوۡمٌ أَن يَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ فَكَفَّ أَيۡدِيَهُمۡ عَنكُمۡۖ وَٱتَّقُواْ ٱللَّهَۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ١١\n                                    \n                                    \n                                    وقوله : ( يا أيها الذين آمنوا اذكروا نعمة الله عليكم إذ هم قوم أن يبسطوا إليكم أيديهم فكف أيديهم عنكم ) قال عبد الرزاق : أخبرنا معمر عن الزهري ذكره عن أبي سلمة ، عن جابر ; أن النبي صلى الله عليه وسلم نزل منزلا وتفرق الناس في العضاه يستظلون تحتها ، وعلق النبي صلى الله عليه وسلم سلاحه بشجرة ، فجاء أعرابي إلى سيف رسول الله صلى الله عليه وسلم فأخذه فسله ، ثم أقبل على النبي صلى الله عليه وسلم فقال : من يمنعك مني؟ قال : \" الله \" ! قال الأعرابي مرتين أو ثلاثا : من يمنعك مني؟ والنبي صلى الله عليه وسلم يقول : \" الله \" ! قال : فشام الأعرابي السيف ، فدعا النبي صلى الله عليه وسلم أصحابه فأخبرهم خبر الأعرابي ، وهو جالس إلى جنبه ولم يعاقبه - وقال معمر : وكان قتادة يذكر نحو هذا ، وذكر أن قوما من العرب أرادوا أن يفتكوا برسول الله صلى الله عليه وسلم فأرسلوا هذا الأعرابي ، وتأول : ( يا أيها الذين آمنوا اذكروا نعمة الله عليكم إذ هم قوم أن يبسطوا إليكم أيديهم ) الآية .\nوقصة هذا الأعرابي - وهو غورث بن الحارث - ثابتة في الصحيح .\nوقال العوفي عن ابن عباس في هذه الآية : ( يا أيها الذين آمنوا اذكروا نعمة الله عليكم إذ هم قوم أن يبسطوا إليكم أيديهم فكف أيديهم عنكم ) وذلك أن قوما من اليهود صنعوا لرسول الله صلى الله عليه وسلم ولأصحابه طعاما ليقتلوهم فأوحى الله تعالى إليه بشأنهم ، فلم يأت الطعام ، وأمر أصحابه فلم يأتوه رواه ابن أبي حاتم .\nوقال أبو مالك : نزلت في كعب بن الأشرف وأصحابه ، حين أرادوا أن يغدروا بمحمد [ صلى الله عليه وسلم ] وأصحابه في دار كعب بن الأشرف . رواه ابن أبي حاتم .\nوذكر محمد بن إسحاق بن يسار ومجاهد وعكرمة وغير واحد : أنها نزلت في شأن بني النضير ، حين أرادوا أن يلقوا على رأس رسول الله صلى الله عليه وسلم الرحى ، لما جاءهم يستعينهم في دية العامريين ، ووكلوا عمرو بن جحاش بن كعب بذلك ، وأمروه إن جلس النبي صلى الله عليه وسلم تحت الجدار واجتمعوا عنده أن يلقي تلك الرحى من فوقه ، فأطلع الله رسوله على ما تمالؤوا عليه ، فرجع إلى المدينة وتبعه أصحابه ، فأنزل الله [ تعالى ] في ذلك : ( يا أيها الذين آمنوا اذكروا نعمة الله عليكم إذ هم قوم أن يبسطوا إليكم أيديهم فكف أيديهم عنكم واتقوا الله وعلى الله فليتوكل المؤمنون ) ثم أمر رسول الله صلى الله عليه وسلم أن يغدو إليهم فحاصرهم ، حتى أنزلهم فأجلاهم .\nوقوله تعالى : ( وعلى الله فليتوكل المؤمنون ) يعني : من توكل على الله كفاه الله ما أهمه ، وحفظه من شر الناس وعصمه .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ هَمَّ قَوۡمٌ أَن يَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ فَكَفَّ أَيۡدِيَهُمۡ عَنكُمۡۖ وَٱتَّقُواْ ٱللَّهَۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا اذكروا نعمة الله عليكم إذ هم قوم أن يبسطوا إليكم أيديهم فكف أيديهم عنكم واتقوا الله وعلى الله فليتوكل المؤمنون\nقوله تعالى : يا أيها الذين آمنوا اذكروا نعمة الله عليكم إذ هم قوم أن يبسطوا إليكم أيديهم قال جماعة : نزلت بسبب فعل الأعرابي في غزوة ذات الرقاع حين اخترط سيف النبي صلى الله عليه وسلم وقال : من يعصمك مني يا محمد ؟ كما تقدم في \" النساء \" ، وفي البخاري : أن النبي صلى الله عليه وسلم دعا الناس فاجتمعوا وهو جالس عند النبي صلى الله عليه وسلم ولم يعاقبه ، وذكر الواقدي وابن أبي حاتم أنه أسلم ، وذكر قوم أنه ضرب برأسه في ساق شجرة حتى مات ، وفي البخاري في غزوة ذات الرقاع أن اسم الرجل غورث بن الحارث ( بالغين منقوطة مفتوحة وسكون الواو بعدها راء وثاء مثلثة ) وقد ضم بعضهم الغين ، والأول أصح ، وذكر أبو حاتم محمد بن إدريس الرازي ، وأبو عبد الله محمد بن عمر الواقدي أن اسمه دعثور بن الحارث ، وذكر أنه أسلم كما تقدم ، وذكر محمد بن إسحاق أن اسمه عمرو بن جحاش وهو أخو بني النضير ، وذكر بعضهم أن قصة عمرو بن جحاش في غير هذه القصة ، والله أعلم ، وقال قتادة ومجاهد وغيرهما : نزلت في قوم من اليهود جاءهم النبي صلى الله عليه وسلم يستعينهم في دية فهموا بقتله صلى الله عليه وسلم فمنعه الله منهم . قال القشيري : وقد تنزل الآية في قصة ثم ينزل ذكرها مرة أخرى لادكار ما سبق . أن يبسطوا إليكم أيديهم أي : بالسوء . فكف أيديهم عنكم أي : منعهم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ هَمَّ قَوۡمٌ أَن يَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ فَكَفَّ أَيۡدِيَهُمۡ عَنكُمۡۖ وَٱتَّقُواْ ٱللَّهَۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ١١\n                                        \n                                        \n                                        \n                                        يُذَكِّر تعالى عباده المؤمنين بنعمه العظيمة، ويحثهم على تذكرها بالقلب واللسان، وأنهم -كما أنهم يعدون قتلهم لأعدائهم، وأخذ أموالهم وبلادهم وسبيهم نعمةً - فليعدوا أيضا إنعامه عليهم بكف أيديهم عنهم، ورد كيدهم في نحورهم نعمة. فإنهم الأعداء، قد هموا بأمر، وظنوا أنهم قادرون عليه. فإذا لم يدركوا بالمؤمنين مقصودهم، فهو نصر من الله لعباده المؤمنين ينبغي لهم أن يشكروا الله على ذلك، ويعبدوه ويذكروه، وهذا يشمل كل من هَمَّ بالمؤمنين بشر، من كافر ومنافق وباغ، كف الله شره عن المسلمين، فإنه داخل في هذه الآية. ثم أمرهم بما يستعينون به على الانتصار على عدوهم، وعلى جميع أمورهم، فقال: { وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ْ} أي: يعتمدوا عليه في جلب مصالحهم الدينية والدنيوية، وتبرؤوا من حولهم وقوتهم، ويثقوا بالله تعالى في حصول ما يحبون. وعلى حسب إيمان العبد يكون توكله، وهو من واجبات القلب المتفق عليها.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ هَمَّ قَوۡمٌ أَن يَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ فَكَفَّ أَيۡدِيَهُمۡ عَنكُمۡۖ وَٱتَّقُواْ ٱللَّهَۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ١١"
    },
    {
      "number": 681,
      "text": "۞ وَلَقَدْ أَخَذَ اللَّهُ مِيثَاقَ بَنِي إِسْرَائِيلَ وَبَعَثْنَا مِنْهُمُ اثْنَيْ عَشَرَ نَقِيبًا ۖ وَقَالَ اللَّهُ إِنِّي مَعَكُمْ ۖ لَئِنْ أَقَمْتُمُ الصَّلَاةَ وَآتَيْتُمُ الزَّكَاةَ وَآمَنْتُمْ بِرُسُلِي وَعَزَّرْتُمُوهُمْ وَأَقْرَضْتُمُ اللَّهَ قَرْضًا حَسَنًا لَأُكَفِّرَنَّ عَنْكُمْ سَيِّئَاتِكُمْ وَلَأُدْخِلَنَّكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۚ فَمَنْ كَفَرَ بَعْدَ ذَٰلِكَ مِنْكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 12,
      "juz": 6,
      "manzil": 2,
      "page": 109,
      "ruku": 88,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": " وَلَقَدۡ أَخَذَ ٱللَّهُ مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ وَبَعَثۡنَا مِنۡهُمُ ٱثۡنَيۡ عَشَرَ نَقِيبٗاۖ وَقَالَ ٱللَّهُ إِنِّي مَعَكُمۡۖ لَئِنۡ أَقَمۡتُمُ ٱلصَّلَوٰةَ وَءَاتَيۡتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِي وَعَزَّرۡتُمُوهُمۡ وَأَقۡرَضۡتُمُ ٱللَّهَ قَرۡضًا حَسَنٗا لَّأُكَفِّرَنَّ عَنكُمۡ سَيِّ‍َٔاتِكُمۡ وَلَأُدۡخِلَنَّكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ فَمَن كَفَرَ بَعۡدَ ذَٰلِكَ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ٢١\n                                    \n                                    \n                                    لما أمر [ الله ] تعالى عباده المؤمنين بالوفاء بعهده وميثاقه ، الذي أخذه عليهم على لسان عبده ورسوله محمد صلى الله عليه وسلم ، وأمرهم بالقيام بالحق والشهادة بالعدل ، وذكرهم نعمه عليهم الظاهرة والباطنة ، فيما هداهم له من الحق والهدى ، شرع يبين لهم كيف أخذ العهود والمواثيق على من كان قبلهم من أهل الكتابين : اليهود والنصارى فلما نقضوا عهوده ومواثيقه أعقبهم ذلك لعنا منه لهم ، وطردا عن بابه وجنابه ، وحجابا لقلوبهم عن الوصول إلى الهدى ودين الحق ، وهو العلم النافع والعمل الصالح ، فقال تعالى : ( ولقد أخذ الله ميثاق بني إسرائيل وبعثنا منهم اثني عشر نقيبا ) يعني : عرفاء على قبائلهم بالمبايعة والسمع ، والطاعة لله ولرسوله ولكتابه .\nوقد ذكر ابن عباس ومحمد بن إسحاق وغير واحد أن هذا كان لما توجه موسى عليه السلام ، لقتال الجبابرة ، فأمر بأن يقيم النقباء من كل سبط نقيب - قال محمد بن إسحاق : فكان من سبط روبيل \" شامون بن زكور ، ومن سبط شمعون : \" شافاط بن حري \" ، ومن سبط يهوذا : \" كالب بن يوفنا \" ، ومن سبط أبين : \" فيخائيل بن يوسف \" ، ومن سبط يوسف وهو سبط أفرايم : \" يوشع بن نون \" ، ومن سبط بنيامين : \" فلطمى بن رفون \" ، ومن سبط زبلون جدي بن سودى \" ، ومن سبط يوسف وهو منشا بن يوسف : \" جدي بن سوسى \" ، ومن سبط دان : \" حملائيل بن جمل \" ، ومن سبط أسير : \" ساطور بن ملكيل \" ، ومن سبط نفتالي نحى بن وفسى \" ، ومن سبط جاد : \" جولايل بن ميكي \" .\nوقد رأيت في السفر الرابع من التوراة تعداد النقباء على أسباط بني إسرائيل وأسماء مخالفة لما ذكره ابن إسحاق ، والله أعلم ، قال فيها : فعلى بني روبيل : \" الصوني بن سادون \" ، وعلى بني شمعون : \" شموال بن صورشكي \" ، وعلى بني يهوذا : \" يحشون بن عمبياذاب وعلى بني يساخر : \" شال بن صاعون \" ، وعلى بني زبلون : \" الياب بن حالوب ، وعلى بني يوسف إفرايم : \" منشا بن عمنهود \" ، وعلى بني منشا : \" حمليائيل بن يرصون \" ، وعلى بني بنيامين : \" أبيدن بن جدعون \" ، وعلى بني دان : \" جعيذر بن عميشذي \" ، وعلى بني أسير : \" نحايل بن عجران \" ، وعلى بني حاز : \" السيف بن دعواييل \" ، وعلى بني نفتالي : \" أجزع بن عمينان \" .\nوهكذا لما بايع رسول الله صلى الله عليه وسلم الأنصار ليلة العقبة ، كان فيهم اثنا عشر نقيبا ، ثلاثة من الأوس وهم : أسيد بن الحضير وسعد بن خيثمة ورفاعة بن عبد المنذر - ويقال بدله : أبو الهيثم بن التيهان - رضي الله عنهم ، وتسعة من الخزرج وهم : أبو أمامة أسعد بن زرارة وسعد بن الربيع وعبد الله بن رواحة ورافع بن مالك بن العجلان والبراء بن معرور وعبادة بن الصامت وسعد بن عبادة وعبد الله بن عمرو بن حرام والمنذر بن عمرو بن خنيس ، رضي الله عنهم . وقد ذكرهم كعب بن مالك في شعر له ، كما أورده ابن إسحاق ، رحمه الله .\nوالمقصود أن هؤلاء كانوا عرفاء على قومهم ليلتئذ عن أمر النبي صلى الله عليه وسلم لهم بذلك ، وهم الذين ولوا المبايعة والمعاقدة عن قومهم للنبي صلى الله عليه وسلم على السمع والطاعة .\nوقال الإمام أحمد : حدثنا حسن بن موسى حدثنا حماد بن زيد عن مجالد عن الشعبي عن مسروق قال : كنا جلوسا عند عبد الله بن مسعود وهو يقرئنا القرآن ، فقال له رجل : يا أبا عبد الرحمن هل سألتم رسول الله صلى الله عليه وسلم : كم يملك هذه الأمة من خليفة ؟ فقال عبد الله : ما سألني عنها أحد منذ قدمت العراق قبلك ، ثم قال : نعم ، ولقد سألنا رسول الله صلى الله عليه وسلم فقال : \" اثنا عشر كعدة نقباء بني إسرائيل \" .\nهذا حديث غريب من هذا الوجه وأصل هذا الحديث ثابت في الصحيحين من حديث جابر بن سمرة قال : سمعت النبي صلى الله عليه وسلم يقول : \" لا يزال أمر الناس ماضيا ما وليهم اثنا عشر رجلا \" . ثم تكلم النبي صلى الله عليه وسلم بكلمة خفيت علي ، فسألت أبي : ماذا قال النبي صلى الله عليه وسلم؟ قال : \" كلهم من قريش \" .\nوهذا لفظ مسلم ومعنى هذا الحديث البشارة بوجود اثني عشر خليفة صالحا يقيم الحق ويعدل فيهم ، ولا يلزم من هذا تواليهم وتتابع أيامهم ، بل قد وجد منهم أربعة على نسق ، وهم الخلفاء الأربعة : أبو بكر وعمر وعثمان وعلي رضي الله عنهم ، ومنهم عمر بن عبد العزيز بلا شك عند الأئمة ، وبعض بني العباس . ولا تقوم الساعة حتى تكون ولايتهم لا محالة ، والظاهر أن منهم المهدي المبشر به في الأحاديث الواردة بذكره : أنه يواطئ اسمه اسم النبي صلى الله عليه وسلم ، واسم أبيه اسم أبيه ، فيملأ الأرض عدلا وقسطا ، كما ملئت جورا وظلما ، وليس هذا بالمنتظر الذي يتوهم الرافضة وجوده ثم ظهوره من سرداب \" سامراء \" . فإن ذلك ليس له حقيقة ولا وجود بالكلية ، بل هو من هوس العقول السخيفة ، وتوهم الخيالات الضعيفة ، وليس المراد بهؤلاء الخلفاء الاثني عشر الأئمة [ الاثني عشر ] الذين يعتقد فيهم الاثنا عشرية من الروافض لجهلهم وقلة عقلهم . وفي التوراة البشارة بإسماعيل عليه السلام ، وأن الله يقيم من صلبه اثني عشر عظيما ، وهم هؤلاء الخلفاء الاثنا عشر المذكورون في حديثابن مسعود وجابر بن سمرة وبعض الجهلة ممن أسلم من اليهود إذا اقترن بهم بعض الشيعة يوهمونهم أنهم الأئمة الاثنا عشر ، فيتشيع كثير منهم جهلا وسفها ، لقلة علمهم وعلم من لقنهم ذلك بالسنن الثابتة عن النبي صلى الله عليه وسلم .\nوقوله تعالى : ( وقال الله إني معكم ) أي : بحفظي وكلاءتي ونصري ( لئن أقمتم الصلاة وآتيتم الزكاة وآمنتم برسلي ) أي : صدقتموهم فيما يجيئونكم به من الوحي ( وعزرتموهم ) أي : نصرتموهم وآزرتموهم على الحق ( وأقرضتم الله قرضا حسنا ) وهو : الإنفاق في سبيله وابتغاء مرضاته ( لأكفرن عنكم سيئاتكم ) أي : ذنوبكم أمحوها وأسترها ، ولا أؤاخذكم بها ( ولأدخلنكم جنات تجري من تحتها الأنهار ) أي : أدفع عنكم المحذور ، وأحصل لكم المقصود .\nوقوله : ( فمن كفر بعد ذلك منكم فقد ضل سواء السبيل ) أي : فمن خالف هذا الميثاق بعد عقده وتوكيده وشده ، وجحده وعامله معاملة من لا يعرفه ، فقد أخطأ الطريق الحق ، وعدل عن الهدى إلى الضلال .\n                                    ",
        "qortoby": " وَلَقَدۡ أَخَذَ ٱللَّهُ مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ وَبَعَثۡنَا مِنۡهُمُ ٱثۡنَيۡ عَشَرَ نَقِيبٗاۖ وَقَالَ ٱللَّهُ إِنِّي مَعَكُمۡۖ لَئِنۡ أَقَمۡتُمُ ٱلصَّلَوٰةَ وَءَاتَيۡتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِي وَعَزَّرۡتُمُوهُمۡ وَأَقۡرَضۡتُمُ ٱللَّهَ قَرۡضًا حَسَنٗا لَّأُكَفِّرَنَّ عَنكُمۡ سَيِّ‍َٔاتِكُمۡ وَلَأُدۡخِلَنَّكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ فَمَن كَفَرَ بَعۡدَ ذَٰلِكَ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ٢١\n                                    \n                                    \n                                    قوله تعالى : ولقد أخذ الله ميثاق بني إسرائيل وبعثنا منهم اثني عشر نقيبا وقال الله إني معكم لئن أقمتم الصلاة وآتيتم الزكاة وآمنتم برسلي وعزرتموهم وأقرضتم الله قرضا حسنا لأكفرن عنكم سيئاتكم ولأدخلنكم جنات تجري من تحتها الأنهار فمن كفر بعد ذلك منكم فقد ضل سواء السبيل\nقوله تعالى : ولقد أخذ الله ميثاق بني إسرائيل وبعثنا منهم اثني عشر نقيبا فيه ثلاث مسائل :\nالأولى : قال ابن عطية : هذه الآيات المتضمنة الخبر عن نقضهم مواثيق الله تعالى تقوي أن الآية المتقدمة في كف الأيدي إنما كانت في بني النضير ، واختلف أهل التأويل في كيفية بعث هؤلاء النقباء بعد الإجماع على أن النقيب كبير القوم ، القائم بأمورهم الذي ينقب عنها وعن مصالحهم فيها ، والنقاب : الرجل العظيم الذي هو في الناس على هذه الطريقة ; ومنه قيل في عمر رضي الله عنه : إنه كان لنقابا . فالنقباء الضمان ، واحدهم نقيب ، وهو شاهد القوم وضمينهم ; يقال : نقب عليهم ، وهو حسن النقيبة أي : حسن الخليقة ، والنقب والنقب الطريق في الجبل ، وإنما قيل : نقيب لأنه يعلم دخيلة أمر القوم ، ويعرف مناقبهم وهو الطريق إلى معرفة أمورهم ، وقال قوم : النقباء الأمناء على قومهم ; وهذا كله قريب بعضه من بعض ، والنقيب أكبر مكانة من العريف . قال عطاء بن يسار : حملة القرآن عرفاء أهل الجنة ; ذكره الدارمي في مسنده . قال قتادة - رحمه الله - وغيره : هؤلاء النقباء قوم كبار من كل سبط ، تكفل كل واحد بسبطه بأن يؤمنوا ويتقوا الله ; ونحو هذا كان النقباء ليلة العقبة ; بايع فيها سبعون رجلا وامرأتان . فاختار رسول الله صلى الله عليه وسلم من السبعين اثني عشر رجلا ، وسماهم النقباء اقتداء بموسى صلى الله عليه وسلم ، وقال الربيع والسدي وغيرهما : إنما بعث النقباء من بني إسرائيل أمناء على الاطلاع على الجبارين والسبر لقوتهم ومنعتهم ; فساروا ليختبروا حال من بها ، ويعلموه بما اطلعوا عليه فيها حتى ينظر في الغزو إليهم ; فاطلعوا من الجبارين على قوة عظيمة - على ما يأتي - وظنوا أنهم لا قبل لهم بها ; فتعاقدوا بينهم على أن يخفوا ذلك عن بني إسرائيل ، وأن يعلموا به موسى عليه السلام ، فلما انصرفوا إلى بني إسرائيل خان منهم عشرة فعرفوا قراباتهم ، ومن وثقوه على سرهم ; ففشا الخبر حتى اعوج أمر بني إسرائيل فقالوا : فاذهب أنت وربك فقاتلا إنا ها هنا قاعدون .\nالثانية : ففي الآية دليل على قبول خبر الواحد فيما يفتقر إليه المرء ، ويحتاج إلى اطلاعه من حاجاته الدينية والدنيوية ; فتركب عليه الأحكام ، ويرتبط به الحلال والحرام ; وقد جاء أيضا مثله في الإسلام ; قال صلى الله عليه وسلم لهوازن : ارجعوا حتى يرفع إلينا عرفاؤكم أمركم . أخرجه البخاري .\nالثالثة : وفيها أيضا دليل على اتخاذ الجاسوس ، والتجسس : التبحث ، وقد بعث رسول الله صلى الله عليه وسلم بسبسة عينا ; أخرجه مسلم ، وسيأتي حكم الجاسوس في \" الممتحنة \" إن شاء الله تعالى ، وأما أسماء نقباء بني إسرائيل فقد ذكر أسماءهم محمد بن حبيب في \" المحبر \" فقال : من سبط روبيل شموع بن ركوب ، ومن سبط شمعون شوقوط بن حوري ، ومن سبط يهوذا كالب بن يوقنا ، ومن سبط الساحر يوغول بن يوسف ، ومن سبط أفراثيم بن يوسف يوشع بن النون ، ومن سبط بنيامين يلظى بن روقو ، ومن سبط ربالون كرابيل بن سودا ومن سبط منشا بن يوسف كدي بن سوشا ، ومن سبط دان عمائيل بن كسل ، ومن سبط شير ستور بن ميخائيل ، ومن سبط نفتال يوحنا بن وقوشا ، ومن سبط كاذاكوال بن موخي ; فالمؤمنون منهم يوشع وكالب ، ودعا موسى عليه السلام على الآخرين فهلكوا مسخوطا عليهم ; قاله الماوردي ، وأما نقباء ليلة العقبة فمذكورون في سيرة ابن إسحاق فلينظروا هناك .\nقوله تعالى : وقال الله إني معكم لئن أقمتم الصلاة قال الربيع بن أنس : قال ذلك للنقباء ، وقال غيره : قال ذلك لجميع بني إسرائيل ، وكسرت \" إن \" لأنها مبتدأة . معكم لأنه ظرف ، أي : بالنصر والعون . ثم ابتدأ فقال : لئن أقمتم الصلاة إلى أن قال لأكفرن عنكم سيئاتكم أي : إن فعلتم ذلك ولأدخلنكم جنات واللام في لئن لام توكيد ومعناها القسم ; وكذا لأكفرن عنكم ، ولأدخلنكم ، وقيل : المعنى لئن أقمتم الصلاة لأكفرن عنكم سيئاتكم ، وتضمن شرطا آخر لقوله : لأكفرن أي : إن فعلتم ذلك لأكفرن ، وقيل : قوله لئن أقمتم الصلاة جزاء لقوله : إني معكم وشرط لقوله : لأكفرن والتعزير : التعظيم والتوقير ; وأنشد أبو عبيدة :\nوكم من ماجد لهم كريم ومن ليث يعزر في الندي\nأي : يعظم ويوقر ، والتعزير : الضرب دون الحد ، والرد ; تقول : عزرت فلانا إذا أدبته ورددته عن القبيح . فقوله : عزرتموهم أي : رددتم عنهم أعداءهم . أي : رددتم عنهم أعداءهم . وأقرضتم الله قرضا حسنا يعني الصدقات ; ولم يقل إقراضا ، وهذا مما جاء من المصدر بخلاف المصدر كقوله : والله أنبتكم من الأرض نباتا ، فتقبلها ربها بقبول حسن وقد تقدم . ثم قيل : حسنا أي : طيبة بها نفوسكم ، وقيل : يبتغون بها وجه الله ، وقيل : حلالا ، وقيل : قرضا اسم لا مصدر . فمن كفر بعد ذلك منكم أي : بعد الميثاق . فقد ضل سواء السبيل أي : أخطأ قصد الطريق ، والله أعلم .\n                                    ",
        "saadi": " وَلَقَدۡ أَخَذَ ٱللَّهُ مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ وَبَعَثۡنَا مِنۡهُمُ ٱثۡنَيۡ عَشَرَ نَقِيبٗاۖ وَقَالَ ٱللَّهُ إِنِّي مَعَكُمۡۖ لَئِنۡ أَقَمۡتُمُ ٱلصَّلَوٰةَ وَءَاتَيۡتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِي وَعَزَّرۡتُمُوهُمۡ وَأَقۡرَضۡتُمُ ٱللَّهَ قَرۡضًا حَسَنٗا لَّأُكَفِّرَنَّ عَنكُمۡ سَيِّ‍َٔاتِكُمۡ وَلَأُدۡخِلَنَّكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ فَمَن كَفَرَ بَعۡدَ ذَٰلِكَ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ٢١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه أخذ على بني إسرائيل الميثاق الثقيل المؤكد، وذكر صفة الميثاق وأجرهم إن قاموا به، وإثمهم إن لم يقوموا به، ثم ذكر أنهم ما قاموا به، وذكر ما عاقبهم به، فقال: { وَلَقَدْ أَخَذَ اللَّهُ مِيثَاقَ بَنِي إِسْرَائِيلَ ْ} أي: عهدهم المؤكد الغليظ، { وَبَعَثْنَا مِنْهُمُ اثْنَيْ عَشَرَ نَقِيبًا ْ} أي: رئيسا وعريفا على من تحته، ليكون ناظرا عليهم، حاثا لهم على القيام بما أُمِرُوا به، مطالبا يدعوهم. { وَقَالَ اللَّهُ ْ} للنقباء الذين تحملوا من الأعباء ما تحملوا: { إِنِّي مَعَكُمْ ْ} أي: بالعون والنصر، فإن المعونة بقدر المؤنة. ثم ذكر ما واثقهم عليه فقال: { لَئِنْ أَقَمْتُمُ الصَّلَاةَ ْ} ظاهرا وباطنا، بالإتيان بما يلزم وينبغي فيها، والمداومة على ذلك { وَآتَيْتُمُ الزَّكَاةَ ْ} لمستحقيها { وَآمَنْتُمْ بِرُسُلِي ْ} جميعهم، الذين أفضلهم وأكملهم محمد صلى الله عليه وسلم، { وَعَزَّرْتُمُوهُمْ ْ} أي: عظمتموهم، وأديتم ما يجب لهم من الاحترام والطاعة { وَأَقْرَضْتُمُ اللَّهَ قَرْضًا حَسَنًا ْ} وهو الصدقة والإحسان، الصادر عن الصدق والإخلاص وطيب المكسب، فإذا قمتم بذلك { لَأُكَفِّرَنَّ عَنكُمْ سَيِّئَاتِكُمْ وَلَأُدْخِلَنَّكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ْ} فجمع لهم بين حصول المحبوب بالجنة وما فيها من النعيم، واندفاع المكروه بتكفير السيئات، ودفع ما يترتب عليها من العقوبات. { فَمَن كَفَرَ بَعْدَ ذَلِكَ ْ} العهد والميثاق المؤكد بالأيمان والالتزامات، المقرون بالترغيب بذكر ثوابه. { فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ ْ} أي: عن عمد وعلم، فيستحق ما يستحقه الضالون من حرمان الثواب، وحصول العقاب. فكأنه قيل: ليت شعري ماذا فعلوا؟ وهل وفوا بما عاهدوا الله عليه أم نكثوا؟\n                                    "
      },
      "originalText": "۞ وَلَقَدۡ أَخَذَ ٱللَّهُ مِيثَٰقَ بَنِيٓ إِسۡرَٰٓءِيلَ وَبَعَثۡنَا مِنۡهُمُ ٱثۡنَيۡ عَشَرَ نَقِيبٗاۖ وَقَالَ ٱللَّهُ إِنِّي مَعَكُمۡۖ لَئِنۡ أَقَمۡتُمُ ٱلصَّلَوٰةَ وَءَاتَيۡتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِي وَعَزَّرۡتُمُوهُمۡ وَأَقۡرَضۡتُمُ ٱللَّهَ قَرۡضًا حَسَنٗا لَّأُكَفِّرَنَّ عَنكُمۡ سَيِّ‍َٔاتِكُمۡ وَلَأُدۡخِلَنَّكُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۚ فَمَن كَفَرَ بَعۡدَ ذَٰلِكَ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ٢١"
    },
    {
      "number": 682,
      "text": "فَبِمَا نَقْضِهِمْ مِيثَاقَهُمْ لَعَنَّاهُمْ وَجَعَلْنَا قُلُوبَهُمْ قَاسِيَةً ۖ يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ ۙ وَنَسُوا حَظًّا مِمَّا ذُكِّرُوا بِهِ ۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَائِنَةٍ مِنْهُمْ إِلَّا قَلِيلًا مِنْهُمْ ۖ فَاعْفُ عَنْهُمْ وَاصْفَحْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 13,
      "juz": 6,
      "manzil": 2,
      "page": 109,
      "ruku": 88,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَبِمَا نَقۡضِهِم مِّيثَٰقَهُمۡ لَعَنَّٰهُمۡ وَجَعَلۡنَا قُلُوبَهُمۡ قَٰسِيَةٗۖ يُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَآئِنَةٖ مِّنۡهُمۡ إِلَّا قَلِيلٗا مِّنۡهُمۡۖ فَٱعۡفُ عَنۡهُمۡ وَٱصۡفَحۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ ٣١\n                                    \n                                    \n                                    ثم أخبر تعالى عما أحل بهم من العقوبة عند مخالفتهم ميثاقه ونقضهم عهده ، فقال : ( فبما نقضهم ميثاقهم لعناهم ) أي : فبسبب نقضهم الميثاق الذي أخذ عليهم لعناهم ، أي أبعدناهم عن الحق وطردناهم عن الهدى ، ( وجعلنا قلوبهم قاسية ) أي : فلا يتعظون بموعظة لغلظها وقساوتها ، ( يحرفون الكلم عن مواضعه ) أي : فسدت فهومهم ، وساء تصرفهم في آيات الله ، وتأولوا كتابه على غير ما أنزله ، وحملوه على غير مراده ، وقالوا عليه ما لم يقل ، عياذا بالله من ذلك ، ( ونسوا حظا مما ذكروا به ) أي : وتركوا العمل به رغبة عنه .\nقال الحسن : تركوا عرى دينهم ووظائف الله التي لا يقبل العمل إلا بها . وقال غيره : تركوا العمل فصاروا إلى حالة رديئة ، فلا قلوب سليمة ، ولا فطر مستقيمة ، ولا أعمال قويمة .\n( ولا تزال تطلع على خائنة منهم ) يعني : مكرهم وغدرهم لك ولأصحابك .\nوقال مجاهد وغيره : يعني بذلك تمالؤهم على الفتك بالنبي ، صلى الله عليه وسلم .\n( فاعف عنهم واصفح ) وهذا هو عين النصر والظفر ، كما قال بعض السلف : ما عاملت من عصى الله فيك بمثل أن تطيع الله فيه . وبهذا يحصل لهم تأليف وجمع على الحق ، ولعل الله أن يهديهم ; ولهذا قال تعالى : ( إن الله يحب المحسنين ) يعني به : الصفح عمن أساء إليك .\nوقال قتادة : هذه الآية ( فاعف عنهم واصفح ) منسوخة بقوله : ( قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر [ ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون ] ) [ التوبة : 29 ]\n                                    ",
        "qortoby": "فَبِمَا نَقۡضِهِم مِّيثَٰقَهُمۡ لَعَنَّٰهُمۡ وَجَعَلۡنَا قُلُوبَهُمۡ قَٰسِيَةٗۖ يُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَآئِنَةٖ مِّنۡهُمۡ إِلَّا قَلِيلٗا مِّنۡهُمۡۖ فَٱعۡفُ عَنۡهُمۡ وَٱصۡفَحۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ ٣١\n                                    \n                                    \n                                    قوله تعالى : فبما نقضهم ميثاقهم لعناهم وجعلنا قلوبهم قاسية يحرفون الكلم عن مواضعه ونسوا حظا مما ذكروا به ولا تزال تطلع على خائنة منهم إلا قليلا منهم فاعف عنهم واصفح إن الله يحب المحسنين\nقوله تعالى : فبما نقضهم ميثاقهم أي : فبنقضهم ميثاقهم ، \" ما \" زائدة للتوكيد ، عن قتادة وسائر أهل العلم ; وذلك أنها تؤكد الكلام بمعنى تمكنه في النفس من جهة حسن النظم ، ومن جهة تكثيره للتوكيد ; كما قال :\nلشيء ما يسود من يسود\nفالتأكيد بعلامة موضوعة كالتأكيد بالتكرير . لعناهم قال ابن عباس : عذبناهم بالجزية . وقال الحسن ومقاتل : بالمسخ . عطاء : أبعدناهم ; واللعن الإبعاد والطرد من الرحمة . وجعلنا قلوبهم قاسية أي : صلبة لا تعي خيرا ولا تفعله ; والقاسية والعاتية بمعنى واحد ، وقرأ الكسائي وحمزة : \" قسية \" بتشديد الياء من غير ألف ; وهي قراءة ابن مسعود والنخعي ويحيى بن وثاب ، والعام القسي الشديد الذي لا مطر فيه ، وقيل : هو من الدراهم القسيات أي : الفاسدة الرديئة ; فمعنى \" قسية \" على هذا ليست بخالصة الإيمان ، أي : فيها نفاق . قال النحاس : وهذا قول حسن ; لأنه يقال : درهم قسي إذا كان مغشوشا بنحاس أو غيره . يقال : درهم قسي ( مخفف السين مشدد الياء ) مثال شقي أي : زائف ; ذكر ذلك أبو عبيد وأنشد : ( الشاعر هو : أبو زيد الطائي )\nلها صواهل في صم السلام كما صاح القسيات في أيدي الصياريف\nيصف وقع المساحي في الحجارة ، وقال الأصمعي وأبو عبيد : درهم قسي كأنه معرب قاشي . قال القشيري : وهذا بعيد ; لأنه ليس في القرآن ما ليس من لغة العرب ، بل الدرهم القسي من القسوة والشدة أيضا ; لأن ما قلت نقرته يقسو ويصلب ، وقرأ الأعمش : \" قسية \" بتخفيف الياء على وزن فعلة نحو عمية وشجية ; من قسى يقسي لا من قسا يقسو ، وقرأ الباقون على وزن فاعلة ; وهو اختيار أبي عبيد ; وهما لغتان مثل العلية والعالية ، والزكية والزاكية . قال أبو جعفر النحاس : أولى ما فيه أن تكون قسية بمعنى قاسية ، إلا أن فعيلة أبلغ من فاعلة . فالمعنى : جعلنا قلوبهم غليظة نابية عن الإيمان والتوفيق لطاعتي ; لأن القوم لم يوصفوا بشيء من الإيمان فتكون قلوبهم موصوفة بأن إيمانها خالطه كفر ، كالدراهم القسية التي خالطها غش . قال الراجز :\nقد قسوت وقست لداتي\nيحرفون الكلم عن مواضعه أي : يتأولونه على غير تأويله ، ويلقون ذلك إلى العوام ، وقيل : معناه يبدلون حروفه . و ( يحرفون ) في موضع نصب ، أي : جعلنا قلوبهم قاسية محرفين ، وقرأ السلمي والنخعي \" الكلام \" بالألف وذلك أنهم غيروا صفة محمد صلى الله عليه وسلم وآية الرجم . ونسوا حظا مما ذكروا به أي : نسوا عهد الله الذي أخذه الأنبياء عليهم من الإيمان بمحمد صلى الله عليه وسلم ، وبيان نعته . ولا تزال تطلع أي : وأنت يا محمد لا تزال الآن تقف على خائنة منهم والخائنة الخيانة ; قال قتادة ، وهذا جائز في اللغة ، ويكون مثل قولهم : قائلة بمعنى قيلولة ، وقيل : هو نعت لمحذوف والتقدير فرقة خائنة ، وقد تقع خائنة للواحد كما يقال : رجل نسابة وعلامة ; فخائنة على هذا للمبالغة ; يقال : رجل خائنة إذا بالغت في وصفه بالخيانة . قال الشاعر :\nحدثت نفسك بالوفاء ولم تكن للغدر خائنة مغل الإصبع\nقال ابن عباس : على خائنة أي : معصية ، وقيل : كذب وفجور ، وكانت خيانتهم نقضهم العهد بينهم وبين رسول الله صلى الله عليه وسلم ، ومظاهرتهم المشركين على حرب رسول الله صلى الله عليه وسلم ; كيوم الأحزاب وغير ذلك من همهم بقتله وسبه . إلا قليلا منهم لم يخونوا فهو استثناء من الهاء والميم اللتين في خائنة منهم . فاعف عنهم واصفح في معناه قولان : فاعف عنهم واصفح ما دام بينك وبينهم عهد وهم أهل الذمة ، والقول الآخر أنه منسوخ بآية السيف ، وقيل : بقوله عز وجل وإما تخافن من قوم خيانة .\n                                    ",
        "saadi": "فَبِمَا نَقۡضِهِم مِّيثَٰقَهُمۡ لَعَنَّٰهُمۡ وَجَعَلۡنَا قُلُوبَهُمۡ قَٰسِيَةٗۖ يُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَآئِنَةٖ مِّنۡهُمۡ إِلَّا قَلِيلٗا مِّنۡهُمۡۖ فَٱعۡفُ عَنۡهُمۡ وَٱصۡفَحۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ ٣١\n                                        \n                                        \n                                        \n                                        { فَبِمَا نَقْضِهِم مِّيثَاقَهُمْ ْ} أي: بسببه عاقبناهم بعدة عقوبات: الأولى: أنا { لَعَنَّاهُمْ ْ} أي: طردناهم وأبعدناهم من رحمتنا، حيث أغلقوا على أنفسهم أبواب الرحمة، ولم يقوموا بالعهد الذي أخذ عليهم، الذي هو سببها الأعظم. الثانية: قوله: { وَجَعَلْنَا قُلُوبَهُمْ قَاسِيَةً ْ} أي: غليظة لا تجدي فيها المواعظ، ولا تنفعها الآيات والنذر، فلا يرغبهم تشويق، ولا يزعجهم تخويف، وهذا من أعظم العقوبات على العبد، أن يكون قلبه بهذه الصفة التي لا يفيده الهدى, والخير إلا شرا. الثالثة: أنهم { يُحَرِّفُونَ الْكَلِمَ عَن مَوَاضِعِهِ ْ} أي: ابتلوا بالتغيير والتبديل، فيجعلون للكلم الذي أراد الله معنى غير ما أراده الله ولا رسوله. الرابعة: أنهم { نسوا حَظًّا مِّمَّا ذُكِّرُوا بِهِ ْ} فإنهم ذكروا بالتوراة، وبما أنزل الله على موسى، فنسوا حظا منه، وهذا شامل لنسيان علمه، وأنهم نسوه وضاع عنهم، ولم يوجد كثير مما أنساهم الله إياه عقوبة منه لهم. وشامل لنسيان العمل الذي هو الترك، فلم يوفقوا للقيام بما أمروا به، ويستدل بهذا على أهل الكتاب بإنكارهم بعض الذي قد ذكر في كتابهم، أو وقع في زمانهم، أنه مما نسوه. الخامسة: الخيانة المستمرة التي { لا تَزَالُ تَطَّلِعُ عَلَى خَائِنَةٍ مِّنْهُمْ ْ} أي: خيانة لله ولعباده المؤمنين. ومن أعظم الخيانة منهم، كتمهم [عن] من يعظهم ويحسن فيهم الظن الحق، وإبقاؤهم على كفرهم، فهذه خيانة عظيمة. وهذه الخصال الذميمة، حاصلة لكل من اتصف بصفاتهم. فكل من لم يقم بما أمر الله به، وأخذ به عليه الالتزام، كان له نصيب من اللعنة وقسوة القلب، والابتلاء بتحريف الكلم، وأنه لا يوفق للصواب، ونسيان حظ مما ذُكِّر به، وأنه لا بد أن يبتلى بالخيانة، نسأل الله العافية. وسمى الله تعالى ما ذكروا به حظا، لأنه هو أعظم الحظوظ، وما عداه فإنما هي حظوظ دنيوية، كما قال تعالى: { فَخَرَجَ عَلَى قَوْمِهِ فِي زِينَتِهِ قَالَ الَّذِينَ يُرِيدُونَ الْحَيَاةَ الدُّنْيَا يَا لَيْتَ لَنَا مِثْلَ مَا أُوتِيَ قَارُونُ إِنَّهُ لَذُو حَظٍّ عَظِيمٍ ْ} وقال في الحظ النافع: { وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ ْ} وقوله: { إِلَّا قَلِيلًا مِنْهُمْ ْ} أي: فإنهم وفوا بما عاهدوا الله عليه فوفقهم وهداهم للصراط المستقيم. { فَاعْفُ عَنْهُمْ وَاصْفَحْ ْ} أي: لا تؤاخذهم بما يصدر منهم من الأذى، الذي يقتضي أن يعفى عنهم، واصفح، فإن ذلك من الإحسان { إن اللَّهُ يُحِبُّ الْمُحْسِنِينَ ْ} والإحسان: هو أن تعبد الله كأنك تراه فإن لم تكن تراه، فإنه يراك. وفي حق المخلوقين: بذل النفع الديني والدنيوي لهم.\n                                    "
      },
      "originalText": "فَبِمَا نَقۡضِهِم مِّيثَٰقَهُمۡ لَعَنَّٰهُمۡ وَجَعَلۡنَا قُلُوبَهُمۡ قَٰسِيَةٗۖ يُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَآئِنَةٖ مِّنۡهُمۡ إِلَّا قَلِيلٗا مِّنۡهُمۡۖ فَٱعۡفُ عَنۡهُمۡ وَٱصۡفَحۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ ٣١"
    }
  ]
}