{
  "number": 110,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 683,
      "text": "وَمِنَ الَّذِينَ قَالُوا إِنَّا نَصَارَىٰ أَخَذْنَا مِيثَاقَهُمْ فَنَسُوا حَظًّا مِمَّا ذُكِّرُوا بِهِ فَأَغْرَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ إِلَىٰ يَوْمِ الْقِيَامَةِ ۚ وَسَوْفَ يُنَبِّئُهُمُ اللَّهُ بِمَا كَانُوا يَصْنَعُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 14,
      "juz": 6,
      "manzil": 2,
      "page": 110,
      "ruku": 88,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِنَ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰٓ أَخَذۡنَا مِيثَٰقَهُمۡ فَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦ فَأَغۡرَيۡنَا بَيۡنَهُمُ ٱلۡعَدَاوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ وَسَوۡفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُواْ يَصۡنَعُونَ ٤١\n                                    \n                                    \n                                    وقوله : ( ومن الذين قالوا إنا نصارى أخذنا ميثاقهم ) أي : ومن الذين ادعوا لأنفسهم أنهم نصارى يتابعون المسيح ابن مريم عليه السلام ، وليسوا كذلك ، أخذنا عليهم العهود والمواثيق على متابعة الرسول ومناصرته ومؤازرته واقتفاء آثاره ، والإيمان بكل نبي يرسله الله إلى أهل الأرض ، أي : ففعلوا كما فعل اليهود خالفوا المواثيق ونقضوا العهود ; ولهذا قال : ( فنسوا حظا مما ذكروا به فأغرينا بينهم العداوة والبغضاء إلى يوم القيامة ) أي : فألقينا بينهم العداوة والتباغض لبعضهم بعضا ، ولا يزالون كذلك إلى قيام الساعة . وكذلك طوائف النصارى على اختلاف أجناسهم لا يزالون متباغضين متعادين ، يكفر بعضهم بعضا ، ويلعن بعضهم بعضا ; فكل فرقة تحرم الأخرى ولا تدعها تلج معبدها ، فالملكية تكفر اليعقوبية ، وكذلك الآخرون ، وكذلك النسطورية والأريوسية كل طائفة تكفر الأخرى في هذه الدنيا ويوم يقوم الأشهاد .\nثم قال تعالى : ( وسوف ينبئهم الله بما كانوا يصنعون ) وهذا تهديد ووعيد أكيد للنصارى على ما ارتكبوه من الكذب على الله وعلى رسوله ، وما نسبوه إلى الرب ، عز وجل ، وتعالى وتقدس عن قولهم علوا كبيرا ، من جعلهم له صاحبة وولدا ، تعالى الواحد الأحد ، الفرد الصمد ، الذي لم يلد ولم يولد ، ولم يكن له كفوا أحد .\n                                    ",
        "qortoby": "وَمِنَ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰٓ أَخَذۡنَا مِيثَٰقَهُمۡ فَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦ فَأَغۡرَيۡنَا بَيۡنَهُمُ ٱلۡعَدَاوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ وَسَوۡفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُواْ يَصۡنَعُونَ ٤١\n                                    \n                                    \n                                    قوله تعالى : ومن الذين قالوا إنا نصارى أخذنا ميثاقهم فنسوا حظا مما ذكروا به فأغرينا بينهم العداوة والبغضاء إلى يوم القيامة وسوف ينبئهم الله بما كانوا يصنعون\nقوله تعالى : ومن الذين قالوا إنا نصارى أخذنا ميثاقهم أي : في التوحيد والإيمان بمحمد صلى الله عليه وسلم ; إذ هو مكتوب في الإنجيل ، فنسوا حظا وهو الإيمان بمحمد عليه الصلاة والسلام ; أي : لم يعملوا بما أمروا به ، وجعلوا ذلك الهوى والتحريف سببا للكفر بمحمد صلى الله عليه وسلم . ومعنى أخذنا ميثاقهم هو كقولك : أخذت من زيد ثوبه ودرهمه ; قاله الأخفش ، ورتبة ( الذين ) أن تكون بعد ( أخذنا ) وقبل ( الميثاق ) ; فيكون التقدير : أخذنا من الذين قالوا إنا نصارى ميثاقهم ; لأنه في موضع المفعول الثاني لأخذنا ، وتقديره عند الكوفيين ومن الذين قالوا إنا نصارى من أخذنا ميثاقه ; فالهاء والميم تعودان على \" من \" المحذوفة ، وعلى القول الأول تعودان على الذين ، ولا يجيز النحويون أخذنا ميثاقهم من الذين قالوا إنا نصارى ، ولا ألينها لبست من الثياب ; لئلا يتقدم مضمر على ظاهر ، وفي قولهم : إنا نصارى ولم يقل من النصارى دليل على أنهم ابتدعوا النصرانية وتسموا بها ; روي معناه عن الحسن .\nقوله تعالى : فأغرينا بينهم العداوة والبغضاء أي : هيجنا ، وقيل : ألصقنا بهم ; مأخوذ من الغراء وهو ما يلصق الشيء بالشيء كالصمغ وشبهه . يقال : غري بالشيء يغرى غرا \" بفتح الغين \" مقصورا وغراء \" بكسر الغين \" ممدودا إذا أولع به كأنه التصق به ، وحكى الرماني : الإغراء تسليط بعضهم على بعض ، وقيل : الإغراء التحريش ، وأصله اللصوق ; يقال : غريت بالرجل غرا - مقصور وممدود مفتوح الأول - إذا لصقت به ، وقال كثير :\nإذا قيل مهلا قالت العين بالبكا غراء ومدتها حوافل نهل\nوأغريت زيدا بكذا حتى غري به ; ومنه الغراء الذي يغرى به للصوقه ; فالإغراء بالشيء الإلصاق به من جهة التسليط عليه ، وأغريت الكلب أي : أولعته بالصيد . بينهم ظرف للعداوة . والبغضاء البغض . أشار بهذا إلى اليهود والنصارى لتقدم ذكرهما . عن السدي وقتادة : بعضهم لبعض عدو ، وقيل : أشار إلى افتراق النصارى خاصة ; قاله الربيع بن أنس ، لأنهم أقرب مذكور ; وذلك أنهم افترقوا إلى اليعاقبة والنسطورية والملكانية ; أي : كفر بعضهم بعضا . قال النحاس : ومن أحسن ما قيل في معنى فأغرينا بينهم العداوة والبغضاء أن الله عز وجل أمر بعداوة الكفار وإبغاضهم ، فكل فرقة مأمورة بعداوة صاحبتها وإبغاضها لأنهم كفار . وقوله : وسوف ينبئهم الله تهديد لهم ; أي : سيلقون جزاء نقض الميثاق .\n                                    ",
        "saadi": "وَمِنَ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰٓ أَخَذۡنَا مِيثَٰقَهُمۡ فَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦ فَأَغۡرَيۡنَا بَيۡنَهُمُ ٱلۡعَدَاوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ وَسَوۡفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُواْ يَصۡنَعُونَ ٤١\n                                        \n                                        \n                                        \n                                        أي: وكما أخذنا على اليهود العهد والميثاق، فكذلك أخذنا على { الَّذِينَ قَالُوا إِنَّا نَصَارَى ْ} لعيسى ابن مريم، وزكوا أنفسهم بالإيمان بالله ورسله وما جاءوا به، فنقضوا العهد، { فَنَسُوا حَظًّا مِّمَّا ذُكِّرُوا بِهِ ْ} نسيانا علميا، ونسيانا عمليا. { فَأَغْرَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ إِلَى يَوْمِ الْقِيَامَةِ ْ} أي: سلطنا بعضهم على بعض، وصار بينهم من الشرور والإحن ما يقتضي بغض بعضهم بعضا ومعاداة بعضهم بعضا إلى يوم القيامة، وهذا أمر مشاهد، فإن النصارى لم يزالوا ولا يزالون في بغض وعداوة وشقاق. { وَسَوْفَ يُنَبِّئُهُمُ اللَّهُ بِمَا كَانُوا يَصْنَعُونَ ْ} فيعاقبهم عليه.\n                                    "
      },
      "originalText": "وَمِنَ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰٓ أَخَذۡنَا مِيثَٰقَهُمۡ فَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦ فَأَغۡرَيۡنَا بَيۡنَهُمُ ٱلۡعَدَاوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ وَسَوۡفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُواْ يَصۡنَعُونَ ٤١"
    },
    {
      "number": 684,
      "text": "يَا أَهْلَ الْكِتَابِ قَدْ جَاءَكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ كَثِيرًا مِمَّا كُنْتُمْ تُخْفُونَ مِنَ الْكِتَابِ وَيَعْفُو عَنْ كَثِيرٍ ۚ قَدْ جَاءَكُمْ مِنَ اللَّهِ نُورٌ وَكِتَابٌ مُبِينٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 15,
      "juz": 6,
      "manzil": 2,
      "page": 110,
      "ruku": 88,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ كَثِيرٗا مِّمَّا كُنتُمۡ تُخۡفُونَ مِنَ ٱلۡكِتَٰبِ وَيَعۡفُواْ عَن كَثِيرٖۚ قَدۡ جَآءَكُم مِّنَ ٱللَّهِ نُورٞ وَكِتَٰبٞ مُّبِينٞ ٥١\n                                    \n                                    \n                                    قول تعالى مخبرا عن نفسه الكريمة : أنه قد أرسل رسوله محمدا بالهدى ودين الحق إلى جميع أهل الأرض ، عربهم وعجمهم ، أميهم وكتابيهم ، وأنه بعثه بالبينات والفرق بين الحق والباطل ، فقال تعالى : ( يا أهل الكتاب قد جاءكم رسولنا يبين لكم كثيرا مما كنتم تخفون من الكتاب ) أي : يبين ما بدلوه وحرفوه وأولوه ، وافتروا على الله فيه ، ويسكت عن كثير مما غيروه ولا فائدة في بيانه .\nوقد روى الحاكم في مستدركه ، من حديث الحسين بن واقد عن يزيد النحوي عن عكرمة عن ابن عباس قال : من كفر بالرجم فقد كفر بالقرآن من حيث لا يحتسب ، قوله : ( يا أهل الكتاب قد جاءكم رسولنا يبين لكم كثيرا مما كنتم تخفون من الكتاب ) فكان الرجم مما أخفوه .\nثم قال : صحيح الإسناد ولم يخرجاه .\nثم أخبر تعالى عن القرآن العظيم الذي أنزله على نبيه الكريم فقال : ( قد جاءكم من الله نور وكتاب مبين )\n                                    ",
        "qortoby": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ كَثِيرٗا مِّمَّا كُنتُمۡ تُخۡفُونَ مِنَ ٱلۡكِتَٰبِ وَيَعۡفُواْ عَن كَثِيرٖۚ قَدۡ جَآءَكُم مِّنَ ٱللَّهِ نُورٞ وَكِتَٰبٞ مُّبِينٞ ٥١\n                                    \n                                    \n                                    قوله تعالى : يا أهل الكتاب الكتاب اسم جنس بمعنى الكتب ; فجميعهم مخاطبون . قد جاءكم رسولنا محمد صلى الله عليه وسلم . يبين لكم كثيرا مما كنتم تخفون من الكتاب أي : من كتبكم ; من الإيمان به ، ومن آية الرجم ، ومن قصة أصحاب السبت الذين مسخوا قردة ; فإنهم كانوا يخفونها . ويعفو عن كثير أي : يتركه ولا يبينه ، وإنما يبين ما فيه حجة على نبوته ، ودلالة على صدقه وشهادة برسالته ، ويترك ما لم يكن به حاجة إلى تبيينه ، وقيل ويعفو عن كثير يعني يتجاوز عن كثير فلا يخبركم به ، وذكر أن رجلا من أحبارهم جاء إلى النبي صلى الله عليه وسلم فسأله فقال : يا هذا عفوت عنا ؟ فأعرض عنه رسول الله عليه وسلم ولم يبين ; وإنما أراد اليهودي أن يظهر مناقضة كلامه ، فلما لم يبين له رسول الله صلى الله عليه وسلم قام من عنده فذهب وقال لأصحابه : أرى أنه صادق فيما يقول : لأنه كان وجد في كتابه أنه لا يبين له ما سأله عنه . قد جاءكم من الله نور أي : ضياء ; قيل : الإسلام ، وقيل : محمد عليه السلام ; عن الزجاج . وكتاب مبين أي القرآن ; فإنه يبين الأحكام ، وقد تقدم .\n                                    ",
        "saadi": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ كَثِيرٗا مِّمَّا كُنتُمۡ تُخۡفُونَ مِنَ ٱلۡكِتَٰبِ وَيَعۡفُواْ عَن كَثِيرٖۚ قَدۡ جَآءَكُم مِّنَ ٱللَّهِ نُورٞ وَكِتَٰبٞ مُّبِينٞ ٥١\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى ما أخذه الله على أهل الكتاب من اليهود والنصارى، وأنهم نقضوا ذلك إلا قليلا منهم، أمرهم جميعا أن يؤمنوا بمحمد صلى الله عليه وسلم، واحتج عليهم بآية قاطعة دالة على صحة نبوته، وهي: أنه بين لهم كثيرا مما يُخْفُون عن الناس، حتى عن العوام من أهل ملتهم، فإذا كانوا هم المشار إليهم في العلم ولا علم عند أحد في ذلك الوقت إلا ما عندهم، فالحريص على العلم لا سبيل له إلى إدراكه إلا منهم، فإتيان الرسول صلى الله عليه وسلم بهذا القرآن العظيم الذي بيَّن به ما كانوا يتكاتمونه بينهم، وهو أُمِّيّ لا يقرأ ولا يكتب - من أدل الدلائل على القطع برسالته، وذلك مثل صفة محمد في كتبهم، ووجود البشائر به في كتبهم، وبيان آية الرجم ونحو ذلك. { وَيَعْفُو عَن كَثِيرٍ ْ} أي: يترك بيان ما لا تقتضيه الحكمة. { قَدْ جَاءَكُم مِّنَ اللَّهِ نُورٌ ْ} وهو القرآن، يستضاء به في ظلمات الجهالة وعماية الضلالة. { وَكِتَابٌ مُّبِينٌ ْ} لكل ما يحتاج الخلق إليه من أمور دينهم ودنياهم. من العلم بالله وأسمائه وصفاته وأفعاله، ومن العلم بأحكامه الشرعية وأحكامه الجزائية.\n                                    "
      },
      "originalText": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ كَثِيرٗا مِّمَّا كُنتُمۡ تُخۡفُونَ مِنَ ٱلۡكِتَٰبِ وَيَعۡفُواْ عَن كَثِيرٖۚ قَدۡ جَآءَكُم مِّنَ ٱللَّهِ نُورٞ وَكِتَٰبٞ مُّبِينٞ ٥١"
    },
    {
      "number": 685,
      "text": "يَهْدِي بِهِ اللَّهُ مَنِ اتَّبَعَ رِضْوَانَهُ سُبُلَ السَّلَامِ وَيُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِهِ وَيَهْدِيهِمْ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 16,
      "juz": 6,
      "manzil": 2,
      "page": 110,
      "ruku": 88,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَهۡدِي بِهِ ٱللَّهُ مَنِ ٱتَّبَعَ رِضۡوَٰنَهُۥ سُبُلَ ٱلسَّلَٰمِ وَيُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِهِۦ وَيَهۡدِيهِمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٦١\n                                    \n                                    \n                                    فقال \" يهدي به الله من اتبع رضوانه سبل السلام \"أي : طرق النجاة والسلامة ومناهج الاستقامة ( ويخرجهم من الظلمات إلى النور بإذنه ويهديهم إلى صراط مستقيم ) أي : ينجيهم من المهالك ، ويوضح لهم أبين المسالك فيصرف عنهم المحذور ، ويحصل لهم أنجب الأمور ، وينفي عنهم الضلالة ، ويرشدهم إلى أقوم حالة .\n                                    ",
        "qortoby": "يَهۡدِي بِهِ ٱللَّهُ مَنِ ٱتَّبَعَ رِضۡوَٰنَهُۥ سُبُلَ ٱلسَّلَٰمِ وَيُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِهِۦ وَيَهۡدِيهِمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٦١\n                                    \n                                    \n                                    يهدي به الله من اتبع رضوانه أي : ما رضيه الله . سبل السلام طرق السلامة الموصلة إلى دار السلام المنزهة عن كل آفة ، والمؤمنة من كل مخافة ; وهي الجنة ، وقال الحسن والسدي : السلام الله عز وجل ; فالمعنى دين الله - وهو الإسلام - كما قال : إن الدين عند الله الإسلام . ويخرجهم من الظلمات إلى النور أي : من ظلمات الكفر والجهالات إلى نور الإسلام والهدايات . بإذنه أي : بتوفيقه وإرادته .\n                                    ",
        "saadi": "يَهۡدِي بِهِ ٱللَّهُ مَنِ ٱتَّبَعَ رِضۡوَٰنَهُۥ سُبُلَ ٱلسَّلَٰمِ وَيُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِهِۦ وَيَهۡدِيهِمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٦١\n                                        \n                                        \n                                        \n                                        { يَهْدِي بِهِ اللَّهُ مَنِ اتَّبَعَ رِضْوَانَهُ سُبُلَ السَّلَامِ ْ} أي: يهدي به من اجتهد وحرص على بلوغ مرضاة الله، وصار قصده حسنا -سبل السلام التي تسلم صاحبها من العذاب، وتوصله إلى دار السلام، وهو العلم بالحق والعمل به، إجمالا وتفصيلا. { وَيُخْرِجُهُم مِّن ْ} ظلمات الكفر والبدعة والمعصية، والجهل والغفلة، إلى نور الإيمان والسنة والطاعة والعلم، والذكر. وكل هذه الهداية بإذن الله، الذي ما شاء كان، وما لم يشأ لم يكن. { وَيَهْدِيهِمْ إِلَى صِرَاطٍ مُّسْتَقِيمٍ ْ}\n                                    "
      },
      "originalText": "يَهۡدِي بِهِ ٱللَّهُ مَنِ ٱتَّبَعَ رِضۡوَٰنَهُۥ سُبُلَ ٱلسَّلَٰمِ وَيُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِهِۦ وَيَهۡدِيهِمۡ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٦١"
    },
    {
      "number": 686,
      "text": "لَقَدْ كَفَرَ الَّذِينَ قَالُوا إِنَّ اللَّهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ ۚ قُلْ فَمَنْ يَمْلِكُ مِنَ اللَّهِ شَيْئًا إِنْ أَرَادَ أَنْ يُهْلِكَ الْمَسِيحَ ابْنَ مَرْيَمَ وَأُمَّهُ وَمَنْ فِي الْأَرْضِ جَمِيعًا ۗ وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۚ يَخْلُقُ مَا يَشَاءُ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 17,
      "juz": 6,
      "manzil": 2,
      "page": 110,
      "ruku": 88,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۚ قُلۡ فَمَن يَمۡلِكُ مِنَ ٱللَّهِ شَيۡ‍ًٔا إِنۡ أَرَادَ أَن يُهۡلِكَ ٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَأُمَّهُۥ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗاۗ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۚ يَخۡلُقُ مَا يَشَآءُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٧١\n                                    \n                                    \n                                    يقول تعالى مخبرا وحاكما بكفر النصارى في ادعائهم في المسيح ابن مريم - وهو عبد من عباد الله ، وخلق من خلقه - أنه هو الله الحكم بكفر النصارى ، تعالى الله عن قولهم علوا كبيرا .\nثم قال مخبرا عن قدرته على الأشياء وكونها تحت قهره وسلطانه : ( قل فمن يملك من الله شيئا إن أراد أن يهلك المسيح ابن مريم وأمه ومن في الأرض جميعا ) أي : لو أراد ذلك ، فمن ذا الذي كان يمنعه ؟ أو من ذا الذي يقدر على صرفه عن ذلك ؟\nثم قال : ( ولله ملك السماوات والأرض وما بينهما يخلق ما يشاء ) أي : جميع الموجودات ملكه وخلقه ، وهو القادر على ما يشاء ، لا يسأل عما يفعل ، لقدرته وسلطانه ، وعدله وعظمته ، وهذا رد على النصارى عليهم لعائن الله المتتابعة إلى يوم القيامة .\n                                    ",
        "qortoby": "لَّقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۚ قُلۡ فَمَن يَمۡلِكُ مِنَ ٱللَّهِ شَيۡ‍ًٔا إِنۡ أَرَادَ أَن يُهۡلِكَ ٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَأُمَّهُۥ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗاۗ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۚ يَخۡلُقُ مَا يَشَآءُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٧١\n                                    \n                                    \n                                    قوله : لقد كفر الذين قالوا إن الله هو المسيح ابن مريم قل فمن يملك من الله شيئا إن أراد أن يهلك المسيح ابن مريم وأمه ومن في الأرض جميعا ولله ملك السماوات والأرض وما بينهما يخلق ما يشاء والله على كل شيء قدير\nقوله تعالى : لقد كفر الذين قالوا إن الله هو المسيح ابن مريم تقدم في آخر \" النساء \" بيانه والقول فيه . وكفر النصارى في دلالة هذا الكلام إنما كان بقولهم : إن الله هو المسيح ابن مريم على جهة الدينونة به ; لأنهم لو قالوه على جهة الحكاية منكرين له لم يكفروا . قل فمن يملك من الله شيئا أي : من أمر الله . و ( يملك ) بمعنى يقدر ; من قولهم ملكت على فلان أمره أي اقتدرت عليه . أي : فمن يقدر أن يمنع من ذلك شيئا ؟ فأعلم الله تعالى أن المسيح لو كان إلها لقدر على دفع ما ينزل به أو بغيره ، وقد أمات أمه ولم يتمكن من دفع الموت عنها ; فلو أهلكه هو أيضا فمن يدفعه عن ذلك أو يرده . ولله ملك السماوات والأرض وما بينهما والمسيح وأمه بينهما مخلوقان محدودان محصوران ، وما أحاط به الحد والنهاية لا يصلح للإلهية ، وقال وما بينهما ولم يقل وما بينهن ; لأنه أراد النوعين والصنفين كما قال الراعي :\nطرقا فتلك هماهمي أقريهما قلصا لواقح كالقسي وحولا\nفقال : \" طرقا \" ثم قال : \" فتلك هماهمي \" . يخلق ما يشاء عيسى من أم بلا أب آية لعباده .\n                                    ",
        "saadi": "لَّقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۚ قُلۡ فَمَن يَمۡلِكُ مِنَ ٱللَّهِ شَيۡ‍ًٔا إِنۡ أَرَادَ أَن يُهۡلِكَ ٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَأُمَّهُۥ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗاۗ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۚ يَخۡلُقُ مَا يَشَآءُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٧١\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى أخذ الميثاق على أهل الكتابين، وأنهم لم يقوموا به بل نقضوه، ذكر أقوالهم الشنيعة. فذكر قول النصارى، القول الذي ما قاله أحد غيرهم، بأن الله هو المسيح ابن مريم، ووجه شبهتهم أنه ولد من غير أب، فاعتقدوا فيه هذا الاعتقاد الباطل مع أن حواء نظيره، خُلِقَت بلا أم، وآدم أولى منه، خلق بلا أب ولا أم، فهلا ادعوا فيهما الإلهية كما ادعوها في المسيح؟ فدل على أن قولهم اتباع هوى من غير برهان ولا شبهة. فرد الله عليهم بأدلة عقلية واضحة فقال: { قُلْ فَمَن يَمْلِكُ مِنَ اللَّهِ شَيْئًا إِنْ أَرَادَ أَن يُهْلِكَ الْمَسِيحَ ابْنَ مَرْيَمَ وَأُمَّهُ وَمَن فِي الْأَرْضِ جَمِيعًا } فإذا كان المذكورون لا امتناع عندهم يمنعهم لو أراد الله أن يهلكهم، ولا قدرة لهم على ذلك - دل على بطلان إلهية من لا يمتنع من الإهلاك، ولا في قوته شيء من الفكاك. ومن الأدلة أن { لِلَّهِ } وحده { مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ } يتصرف فيهم بحكمه الكوني والشرعي والجزائي، وهم مملوكون مدبرون، فهل يليق أن يكون المملوك العبد الفقير، إلها معبودا غنيا من كل وجه؟ هذا من أعظم المحال. ولا وجه لاستغرابهم لخلق المسيح عيسى ابن مريم من غير أب، فإن الله { يَخْلُقُ مَا يَشَاءُ } إن شاء من أب وأم، كسائر بني آدم، وإن شاء من أب بلا أم، كحواء. وإن شاء من أم بلا أب، كعيسى. وإن شاء من غير أب ولا أم [كآدم] فنوع خليقته تعالى بمشيئته النافذة، التي لا يستعصي عليها شيء، ولهذا قال: { وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ }\n                                    "
      },
      "originalText": "لَّقَدۡ كَفَرَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۚ قُلۡ فَمَن يَمۡلِكُ مِنَ ٱللَّهِ شَيۡ‍ًٔا إِنۡ أَرَادَ أَن يُهۡلِكَ ٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَأُمَّهُۥ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗاۗ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۚ يَخۡلُقُ مَا يَشَآءُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٧١"
    }
  ]
}