{
  "number": 111,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 687,
      "text": "وَقَالَتِ الْيَهُودُ وَالنَّصَارَىٰ نَحْنُ أَبْنَاءُ اللَّهِ وَأَحِبَّاؤُهُ ۚ قُلْ فَلِمَ يُعَذِّبُكُمْ بِذُنُوبِكُمْ ۖ بَلْ أَنْتُمْ بَشَرٌ مِمَّنْ خَلَقَ ۚ يَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ ۚ وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ وَإِلَيْهِ الْمَصِيرُ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 18,
      "juz": 6,
      "manzil": 2,
      "page": 111,
      "ruku": 88,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَتِ ٱلۡيَهُودُ وَٱلنَّصَٰرَىٰ نَحۡنُ أَبۡنَٰٓؤُاْ ٱللَّهِ وَأَحِبَّٰٓؤُهُۥۚ قُلۡ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُمۖ بَلۡ أَنتُم بَشَرٞ مِّمَّنۡ خَلَقَۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ ٨١\n                                    \n                                    \n                                    ثم قال تعالى رادا على اليهود والنصارى في كذبهم وافترائهم : ( وقالت اليهود والنصارى نحن أبناء الله وأحباؤه ) أي : نحن منتسبون إلى أنبيائه وهم بنوه وله بهم عناية ، وهو يحبنا . ونقلوا عن كتابهم أن الله [ تعالى ] قال لعبده إسرائيل : \" أنت ابني بكري \" . فحملوا هذا على غير تأويله ، وحرفوه . وقد رد عليهم غير واحد ممن أسلم من عقلائهم ، وقالوا : هذا يطلق عندهم على التشريف والإكرام ، كما نقل النصارى عن كتابهم أن عيسى قال لهم : إني ذاهب إلى أبي وأبيكم ، يعني : ربي وربكم . ومعلوم أنهم لم يدعوا لأنفسهم من البنوة ما ادعوها في عيسى عليه السلام ، وإنما أرادوا بذلك معزتهم لديه وحظوتهم عنده ، ولهذا قالوا : نحن أبناء الله وأحباؤه .\nقال الله تعالى رادا عليهم : ( قل فلم يعذبكم بذنوبكم ) أي : لو كنتم كما تدعون أبناءه وأحباءه ، فلم أعد لكم نار جهنم على كفركم وكذبكم وافترائكم؟ وقد قال بعض شيوخ الصوفية لبعض الفقهاء : أين تجد في القرآن أن الحبيب لا يعذب حبيبه؟ فلم يرد عليه ، فتلا الصوفي هذه الآية : ( قل فلم يعذبكم بذنوبكم )\nوهذا الذي قاله حسن ، وله شاهد في المسند للإمام أحمد حيث قال : حدثنا ابن أبي عدي عن حميد عن أنس قال : مر النبي صلى الله عليه وسلم في نفر من أصحابه ، وصبي في الطريق ، فلما رأت أمه القوم خشيت على ولدها أن يوطأ ، فأقبلت تسعى وتقول : ابني ابني! وسعت فأخذته ، فقال القوم : يا رسول الله ، ما كانت هذه لتلقي ابنها في النار . قال : فخفضهم النبي صلى الله عليه وسلم فقال : \" لا والله ما يلقي حبيبه في النار \" . تفرد به .\n[ وقوله ] ( بل أنتم بشر ممن خلق ) أي : لكم أسوة أمثالكم من بني آدم وهو تعالى هو الحاكم في جميع عباده ( يغفر لمن يشاء ويعذب من يشاء ) أي : هو فعال لما يريد ، لا معقب لحكمه وهو سريع الحساب . ( ولله ملك السماوات والأرض وما بينهما ) أي : الجميع ملكه وتحت قهره وسلطانه ، ( وإليه المصير ) أي : المرجع والمآب إليه ، فيحكم في عباده بما يشاء ، وهو العادل الذي لا يجور .\n[ و ] قال محمد بن إسحاق عن محمد بن أبي محمد عن عكرمة أو سعيد بن جبير عن ابن عباس قال : وأتى رسول الله صلى الله عليه وسلم نعمان بن أضاء وبحري بن عمرو وشاس بن عدي فكلموه وكلمهم رسول الله صلى الله عليه وسلم ودعاهم إلى الله وحذرهم نقمته ، فقالوا : ما تخوفنا يا محمد ! نحن والله أبناء الله وأحباؤه ، كقول النصارى فأنزل [ الله ] فيهم : ( وقالت اليهود والنصارى نحن أبناء الله وأحباؤه ) إلى آخر الآية . رواه ابن أبي حاتم وابن جرير .\nورويا أيضا من طريق أسباط عن السدي في قول الله [ تعالى ] ( وقالت اليهود والنصارى نحن أبناء الله وأحباؤه ) أما قولهم : ( نحن أبناء الله وأحباؤه ) فإنهم قالوا : إن الله أوحى إلى إسرائيل أن ولدك - بكرك من الولد - فيدخلهم النار فيكونون فيها أربعين ليلة حتى تطهرهم وتأكل خطاياهم ، ثم يناد مناد أن أخرجوا كل مختون من ولد إسرائيل . فأخرجوهم فذلك قولهم : ( لن تمسنا النار إلا أياما معدودات ) [ آل عمران : 24 ]\n                                    ",
        "qortoby": "وَقَالَتِ ٱلۡيَهُودُ وَٱلنَّصَٰرَىٰ نَحۡنُ أَبۡنَٰٓؤُاْ ٱللَّهِ وَأَحِبَّٰٓؤُهُۥۚ قُلۡ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُمۖ بَلۡ أَنتُم بَشَرٞ مِّمَّنۡ خَلَقَۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ ٨١\n                                    \n                                    \n                                    قوله : وقالت اليهود والنصارى نحن أبناء الله وأحباؤه قل فلم يعذبكم بذنوبكم بل أنتم بشر ممن خلق يغفر لمن يشاء ويعذب من يشاء ولله ملك السماوات والأرض وما بينهما وإليه المصير\nقوله تعالى : وقالت اليهود والنصارى نحن أبناء الله وأحباؤه قال ابن عباس : خوف رسول الله صلى الله عليه وسلم قوما من اليهود العقاب فقالوا : لا نخاف فإنا أبناء الله وأحباؤه ; فنزلت الآية . قال ابن إسحاق : أتى رسول الله صلى الله عليه وسلم نعمان بن أضا وبحري بن عمرو وشأس بن عدي فكلموه وكلمهم ، ودعاهم إلى الله عز وجل وحذرهم نقمته فقالوا : ما تخوفنا يا محمد ؟ ; نحن أبناء الله وأحباؤه ، كقول النصارى ; فأنزل الله عز وجل فيهم وقالت اليهود والنصارى نحن أبناء الله وأحباؤه قل فلم يعذبكم بذنوبكم إلى آخر الآية . قال لهم معاذ بن جبل وسعد بن عبادة وعقبة بن وهب : يا معشر يهود اتقوا الله ، فوالله إنكم لتعلمون أنه رسول الله ، ولقد كنتم تذكرونه لنا قبل مبعثه ، وتصفونه لنا بصفته ; فقال رافع بن حريملة ووهب بن يهوذا : ما قلنا هذا لكم ، ولا أنزل الله من كتاب بعد موسى ، ولا أرسل بشيرا ولا نذيرا من بعده ; فأنزل الله عز وجل : يا أهل الكتاب قد جاءكم رسولنا يبين لكم على فترة من الرسل إلى قوله : والله على كل شيء قدير . السدي : زعمت اليهود أن الله عز وجل أوحى إلى إسرائيل عليه السلام أن ولدك بكري من الولد . قال غيره : والنصارى قالت نحن أبناء الله ; لأن في الإنجيل حكاية عن عيسى \" أذهب إلى أبي وأبيكم \" ، وقيل : المعنى : نحن أبناء رسل الله ، فهو على حذف مضاف ، وبالجملة . فإنهم رأوا لأنفسهم فضلا ; فرد عليهم قولهم فقال : فلم يعذبكم بذنوبكم فلم يكونوا يخلون من أحد وجهين ; إما أن يقولوا هو يعذبنا . فيقال لهم : فلستم إذا أبناءه وأحباءه ; فإن الحبيب لا يعذب حبيبه ، وأنتم تقرون بعذابه ; فذلك دليل على كذبكم - وهذا هو المسمى عند الجدليين ببرهان الخلف - أو يقولوا : لا يعذبنا فيكذبوا ما في كتبهم ، وما جاءت به رسلهم ، ويبيحوا المعاصي وهم معترفون بعذاب العصاة منهم ; ولهذا يلتزمون أحكام كتبهم ، وقيل : معنى يعذبكم عذبكم ; فهو بمعنى المضي ; أي : فلم مسخكم قردة وخنازير ؟ ولم عذب من قبلكم من اليهود والنصارى بأنواع العذاب وهم أمثالكم ؟ لأن الله سبحانه لا يحتج عليهم بشيء لم يكن بعد ، لأنهم ربما يقولون لا نعذب غدا ، بل يحتج عليهم بما عرفوه . ثم قال : بل أنتم بشر ممن خلق أي : كسائر خلقه يحاسبكم على الطاعة والمعصية ، ويجازي كلا بما عمل . يغفر لمن يشاء أي : لمن تاب من اليهود . ويعذب من يشاء من مات عليها . ولله ملك السماوات والأرض فلا شريك له يعارضه . وإليه المصير أي : يئول أمر العباد إليه في الآخرة .\n                                    ",
        "saadi": "وَقَالَتِ ٱلۡيَهُودُ وَٱلنَّصَٰرَىٰ نَحۡنُ أَبۡنَٰٓؤُاْ ٱللَّهِ وَأَحِبَّٰٓؤُهُۥۚ قُلۡ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُمۖ بَلۡ أَنتُم بَشَرٞ مِّمَّنۡ خَلَقَۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ ٨١\n                                        \n                                        \n                                        \n                                        ومن مقالات اليهود والنصارى أن كلا منهما ادعى دعوى باطلة، يزكون بها أنفسهم، بأن قال كل منهما: { نَحْنُ أَبْنَاءُ اللَّهِ وَأَحِبَّاؤُهُ } والابن في لغتهم هو الحبيب، ولم يريدوا البنوة الحقيقية، فإن هذا ليس من مذهبهم إلا مذهب النصارى في المسيح. قال الله ردا عليهم حيث ادعوا بلا برهان: { قُلْ فَلِمَ يُعَذِّبُكُمْ بِذُنُوبِكُمْ } ؟ فلو كنتم أحبابه ما عذبكم [لكون الله لا يحب إلا من قام بمراضيه] { بَلْ أَنتُم بَشَرٌ مِّمَّنْ خَلَقَ } تجري عليكم أحكام العدل والفضل { يَغْفِرُ لِمَن يَشَاءُ وَيُعَذِّبُ مَن يَشَاءُ } إذا أتوا بأسباب المغفرة أو أسباب العذاب، { وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَإِلَيْهِ الْمَصِيرُ } أي: فأي شيء خصكم بهذه الفضيلة، وأنتم من جملة المماليك ومن جملة من يرجع إلى الله في الدار الآخرة، فيجازيكم بأعمالكم.\n                                    "
      },
      "originalText": "وَقَالَتِ ٱلۡيَهُودُ وَٱلنَّصَٰرَىٰ نَحۡنُ أَبۡنَٰٓؤُاْ ٱللَّهِ وَأَحِبَّٰٓؤُهُۥۚ قُلۡ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُمۖ بَلۡ أَنتُم بَشَرٞ مِّمَّنۡ خَلَقَۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ ٨١"
    },
    {
      "number": 688,
      "text": "يَا أَهْلَ الْكِتَابِ قَدْ جَاءَكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ عَلَىٰ فَتْرَةٍ مِنَ الرُّسُلِ أَنْ تَقُولُوا مَا جَاءَنَا مِنْ بَشِيرٍ وَلَا نَذِيرٍ ۖ فَقَدْ جَاءَكُمْ بَشِيرٌ وَنَذِيرٌ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 19,
      "juz": 6,
      "manzil": 2,
      "page": 111,
      "ruku": 88,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ عَلَىٰ فَتۡرَةٖ مِّنَ ٱلرُّسُلِ أَن تَقُولُواْ مَا جَآءَنَا مِنۢ بَشِيرٖ وَلَا نَذِيرٖۖ فَقَدۡ جَآءَكُم بَشِيرٞ وَنَذِيرٞۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩١\n                                    \n                                    \n                                    يقول تعالى مخاطبا أهل الكتاب من اليهود والنصارى : إنه قد أرسل إليهم رسوله محمدا خاتم النبيين ، الذي لا نبي بعده ولا رسول بل هو المعقب لجميعهم ; ولهذا قال : ( على فترة من الرسل ) أي : بعد مدة متطاولة ما بين إرساله وعيسى ابن مريم .\nوقد اختلفوا في مقدار هذه الفترة ، كم هي ؟ فقال أبو عثمان النهدي وقتادة - في رواية عنه - : كانت ستمائة سنة . ورواه البخاري عن سلمان الفارسي . وعن قتادة : خمسمائة وستون سنة ، وقال معمر عن بعض أصحابه : خمسمائة وأربعون سنة . وقال : الضحاك : أربعمائة وبضع وثلاثون سنة .\nوذكر ابن عساكر في ترجمة عيسى عليه السلام عن الشعبي أنه قال : ومن رفع المسيح إلى هجرة النبي صلى الله عليه وسلم تسعمائة وثلاث وثلاثون سنة .\nوالمشهور هو الأول ، وهو أنه ستمائة سنة . ومنهم من يقول : ستمائة وعشرون سنة . ولا منافاة بينهما ، فإن القائل الأول أراد ستمائة سنة شمسية ، والآخر أراد قمرية ، وبين كل مائة سنة شمسية وبين القمرية نحو من ثلاث سنين ; ولهذا قال تعالى في قصة أصحاب الكهف : ( ولبثوا في كهفهم ثلاث مائة سنين وازدادوا تسعا ) [ الكهف : 25 ] أي : قمرية ، لتكميل الثلاثمائة الشمسية التي كانت معلومة لأهل الكتاب . وكانت الفترة بين عيسى ابن مريم ، آخر أنبياء بني إسرائيل وبين محمد [ صلى الله عليه وسلم ] خاتم النبيين من بني آدم على الإطلاق ، كما ثبت في صحيح البخاري عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : \" إن أولى الناس بابن مريم لأنه لا نبي بيني وبينه هذا فيه رد على من زعم أنه بعث بعد عيسى [ عليه السلام ] نبي ، يقال له : خالد بن سنان كما حكاه القضاعي وغيره .\nوالمقصود أن الله [ تعالى ] بعث محمدا صلى الله عليه وسلم على فترة من الرسل ، وطموس من السبل ، وتغير الأديان ، وكثرة عبادة الأوثان والنيران والصلبان ، فكانت النعمة به أتم النعم ، والحاجة إليه أمر عمم ، فإن الفساد كان قد عم جميع البلاد ، والطغيان والجهل قد ظهر في سائر العباد ، إلا قليلا من المتمسكين ببقايا من دين الأنبياء الأقدمين ، من بعض أحبار اليهود وعباد النصارى والصابئين ، كما قال الإمام أحمد :\nحدثنا يحيى بن سعيد ، حدثنا هشام ، حدثنا قتادة عن مطرف عن عياض بن حمار المجاشعي رضي الله عنه ، أن النبي صلى الله عليه وسلم خطب ذات يوم فقال في خطبته : \" وإن ربي أمرني أن أعلمكم ما جهلتم مما علمني في يومي هذا : كل مال نحلته عبادي حلال ، وإني خلقت عبادي حنفاء كلهم ، وإنهم أتتهم الشياطين فأضلتهم عن دينهم ، وحرمت عليهم ما أحللت لهم ، وأمرتهم أن يشركوا بي ما لم أنزل به سلطانا ، ثم إن الله ، عز وجل ، نظر إلى أهل الأرض فمقتهم ، عجمهم وعربهم ، إلا بقايا من أهل الكتاب وقال : إنما بعثتك لأبتليك وأبتلي بك ، وأنزلت عليك كتابا لا يغسله الماء ، تقرؤه نائما ويقظان ، ثم إن الله أمرني أن أحرق قريشا فقلت : يا رب ، إذن يثلغوا رأسي فيدعوه خبزة ، فقال : استخرجهم كما استخرجوك ، واغزهم نغزك ، وأنفق عليهم فسننفق عليك ، وابعث جندا نبعث خمسة أمثاله وقاتل بمن أطاعك من عصاك ، وأهل الجنة ثلاثة : ذو سلطان مقسط متصدق موفق ورجل رحيم رقيق القلب بكل ذي قربى ومسلم ، ورجل عفيف فقير متصدق ، وأهل النار خمسة : الضعيف الذي لا زبر له ، الذين هم فيكم تبعا أو تبعاء - شك يحيى - لا يبتغون أهلا ولا مالا ، والخائن الذي لا يخفى له طمع وإن دق إلا خانه ، ورجل لا يصبح ولا يمسي إلا وهو يخادعك عن أهلك ومالك \" ، وذكر البخيل أو الكذب ، \" والشنظير : الفاحش \" .\nثم رواه الإمام أحمد ومسلم والنسائي من غير وجه ، عن قتادة عن مطرف بن عبد الله بن الشخير . وفي رواية سعيد عن قتادة التصريح بسماع قتادة هذا الحديث من مطرف . وقد ذكر الإمام أحمد في مسنده : أن قتادة لم يسمعه من مطرف وإنما سمعه من أربعة ، عنه . ثم رواه هو عن روح عن عوف عن حكيم الأثرم عن الحسن قال : حدثني مطرف عن عياض بن حمار فذكره . و [ كذا ] رواه النسائي من حديث غندر عن عوف الأعرابي به .\nوالمقصود من إيراد هذا الحديث قوله : \" وإن الله نظر إلى أهل الأرض فمقتهم ، عربهم وعجمهم إلا بقايا من بني إسرائيل \" . وفي لفظ مسلم : \" من أهل الكتاب \" . وكان الدين قد التبس على أهل الأرض كلهم ، حتى بعث الله محمدا صلى الله عليه وسلم ، فهدى الخلائق ، وأخرجهم الله به من الظلمات إلى النور ، وتركهم على المحجة البيضاء ، والشريعة الغراء ; ولهذا قال تعالى : ( أن تقولوا ما جاءنا من بشير ولا نذير ) أي : لئلا تحتجوا وتقولوا - : يا أيها الذين بدلوا دينهم وغيروه - ما جاءنا من رسول يبشر بالخير وينذر من الشر ، فقد جاءكم بشير ونذير ، يعني محمدا صلى الله عليه وسلم ( والله على كل شيء قدير )\nقال ابن جرير : معناه : إني قادر على عقاب من عصاني ، وثواب من أطاعني .\n                                    ",
        "qortoby": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ عَلَىٰ فَتۡرَةٖ مِّنَ ٱلرُّسُلِ أَن تَقُولُواْ مَا جَآءَنَا مِنۢ بَشِيرٖ وَلَا نَذِيرٖۖ فَقَدۡ جَآءَكُم بَشِيرٞ وَنَذِيرٞۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩١\n                                    \n                                    \n                                    قوله تعالى : يا أهل الكتاب قد جاءكم رسولنا يبين لكم على فترة من الرسل أن تقولوا ما جاءنا من بشير ولا نذير فقد جاءكم بشير ونذير والله على كل شيء قدير                                    \nقوله تعالى : يا أهل الكتاب قد جاءكم رسولنا يعني محمدا صلى الله عليه وسلم . يبين لكم انقطاع حجتهم حتى لا يقولوا غدا ما جاءنا رسول . على فترة من الرسل أي : سكون ; يقال فتر الشيء سكن ، وقيل : على فترة على انقطاع ما بين النبيين ; عن أبي علي وجماعة أهل العلم ، حكاه الرماني ; قال : والأصل فيها انقطاع العمل عما كان عليه من الجد فيه ، من قولهم : فتر عن عمله وفترته عنه ، ومنه فتر الماء إذا انقطع عما كان من السخونة إلى البرد . وامرأة فاترة الطرف أي : منقطعة عن حدة النظر ، وفتور البدن كفتور الماء ، والفتر ما بين السبابة والإبهام إذا فتحتهما ، والمعنى ; أي : مضت للرسل مدة قبله ، واختلف في قدر مدة تلك الفترة ; فذكر محمد بن سعد في كتاب \" الطبقات \" عن ابن عباس قال : كان بين موسى بن عمران وعيسى ابن مريم عليهما السلام ألف سنة وسبعمائة سنة ، ولم يكن بينهما فترة ، وأنه أرسل بينهما ألف نبي من بني إسرائيل سوى من أرسل من غيرهم . وكان بين ميلاد عيسى والنبي صلى الله عليه وسلم خمسمائة سنة وتسع وستون سنة ، بعث في أولها ثلاثة أنبياء ; وهو قوله تعالى : إذ أرسلنا إليهم اثنين فكذبوهما فعززنا بثالث والذي عزز به \" شمعون \" وكان من الحواريين ، وكانت الفترة التي لم يبعث الله فيها رسولا أربعمائة سنة وأربعا وثلاثين سنة ، وذكر الكلبي أن بين عيسى ومحمد عليهما السلام خمسمائة سنة وتسع وستون ، وبينهما أربعة أنبياء ; واحد من العرب من بني عبس وهو خالد بن سنان . قال القشيري : ومثل هذا مما لا يعلم إلا بخبر صدق . وقال قتادة : كان بين عيسى ومحمد عليهما السلام ستمائة سنة ; وقاله مقاتل والضحاك ووهب بن منبه ، إلا أن وهبا زاد عشرين سنة ، وعن الضحاك أيضا أربعمائة وبضع وثلاثون سنة ، وذكر ابن سعد عن عكرمة قال : بين آدم ونوح عشرة قرون ، كلهم على الإسلام . قال ابن سعد : أخبرنا محمد بن عمرو بن واقد الأسلمي عن غير واحد قالوا : كان بين آدم ونوح عشرة قرون ، والقرن مائة سنة ، وبين نوح وإبراهيم عشرة قرون ، والقرن مائة سنة ، وبين إبراهيم وموسى بن عمران عشرة قرون ، والقرن مائة سنة ; فهذا ما بين آدم ومحمد عليهما السلام من القرون والسنين . والله أعلم . أن تقولوا أي : لئلا أو كراهية أن تقولوا ; فهو في موضع نصب . ما جاءنا من بشير أي : مبشر . ولا نذير أي : منذر ، ويجوز من بشير ولا نذير على الموضع . قال ابن عباس : قال معاذ بن جبل وسعد بن عبادة وعقبة بن وهب لليهود ; يا معشر يهود اتقوا الله ، فوالله إنكم لتعلمون أن محمدا رسول الله ، ولقد كنتم تذكرونه لنا قبل مبعثه وتصفونه بصفته ; فقالوا : ما أنزل الله من كتاب بعد موسى ولا أرسل بعده من بشير ولا نذير ; فنزلت الآية . والله على كل شيء قدير على إرسال من شاء من خلقه . وقيل : قدير على إنجاز ما بشر به وأنذر منه .\n                                    ",
        "saadi": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ عَلَىٰ فَتۡرَةٖ مِّنَ ٱلرُّسُلِ أَن تَقُولُواْ مَا جَآءَنَا مِنۢ بَشِيرٖ وَلَا نَذِيرٖۖ فَقَدۡ جَآءَكُم بَشِيرٞ وَنَذِيرٞۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩١\n                                        \n                                        \n                                        \n                                        يدعو تبارك وتعالى أهل الكتاب -بسبب ما من عليهم من كتابه- أن يؤمنوا برسوله محمد صلى الله عليه وسلم، ويشكروا الله تعالى الذي أرسله إليهم على حين { فَتْرَةٍ مِّنَ الرُّسُلِ } وشدة حاجة إليه. وهذا مما يدعو إلى الإيمان به، وأنه يبين لهم جميع المطالب الإلهية والأحكام الشرعية. وقد قطع الله بذلك حجتهم، لئلا يقولوا: { مَا جَاءَنَا مِن بَشِيرٍ وَلَا نَذِيرٍ فَقَدْ جَاءَكُم بَشِيرٌ وَنَذِيرٌ } يبشر بالثواب العاجل والآجل، وبالأعمال الموجبة لذلك، وصفة العاملين بها. وينذر بالعقاب العاجل والآجل، وبالأعمال الموجبة لذلك، وصفة العاملين بها. { وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ } انقادت الأشياء طوعا وإذعانا لقدرته، فلا يستعصي عليه شيء منها، ومن قدرته أن أرسل الرسل، وأنزل الكتب، وأنه يثيب من أطاعهم ويعاقب من عصاهم.\n                                    "
      },
      "originalText": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ قَدۡ جَآءَكُمۡ رَسُولُنَا يُبَيِّنُ لَكُمۡ عَلَىٰ فَتۡرَةٖ مِّنَ ٱلرُّسُلِ أَن تَقُولُواْ مَا جَآءَنَا مِنۢ بَشِيرٖ وَلَا نَذِيرٖۖ فَقَدۡ جَآءَكُم بَشِيرٞ وَنَذِيرٞۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩١"
    },
    {
      "number": 689,
      "text": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَعَلَ فِيكُمْ أَنْبِيَاءَ وَجَعَلَكُمْ مُلُوكًا وَآتَاكُمْ مَا لَمْ يُؤْتِ أَحَدًا مِنَ الْعَالَمِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 20,
      "juz": 6,
      "manzil": 2,
      "page": 111,
      "ruku": 89,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَعَلَ فِيكُمۡ أَنۢبِيَآءَ وَجَعَلَكُم مُّلُوكٗا وَءَاتَىٰكُم مَّا لَمۡ يُؤۡتِ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ ٠٢\n                                    \n                                    \n                                    يقول تعالى مخبرا عن عبده ورسوله وكليمه موسى بن عمران عليه السلام ، فيما ذكر به قومه نعم الله عليهم وآلاءه لديهم ، في جمعه لهم خير الدنيا والآخرة لو استقاموا على طريقتهم المستقيمة ، فقال تعالى : ( وإذ قال موسى لقومه يا قوم اذكروا نعمة الله عليكم إذ جعل فيكم أنبياء ) أي : كلما هلك نبي قام فيكم نبي ، من لدن أبيكم إبراهيم وإلى من بعده . وكذلك كانوا ، لا يزال فيهم الأنبياء يدعون إلى الله ويحذرون نقمته ، حتى ختموا بعيسى عليه السلام ، ثم أوحى الله [ تعالى ] إلى خاتم الرسل والأنبياء على الإطلاق محمد بن عبد الله المنسوب إلى إسماعيل بن إبراهيم عليه السلام ، وهو أشرف من كل من تقدمه منهم صلى الله عليه وسلم .\nوقوله : ( وجعلكم ملوكا ) قال عبد الرزاق عن الثوري عن منصور عن الحكم أو غيره ، عن ابن عباس في قوله : ( وجعلكم ملوكا ) قال : الخادم والمرأة والبيت .\nوروى الحاكم في مستدركه ، من حديث الثوري أيضا ، عن الأعمش عن مجاهد عن ابن عباس قال : المرأة والخادم ( وآتاكم ما لم يؤت أحدا من العالمين ) قال : الذين هم بين ظهرانيهم يومئذ ، ثم قال الحاكم : صحيح على شرط الشيخين ولم يخرجاه .\nوقال ميمون بن مهران عن ابن عباس قال : كان الرجل من بني إسرائيل إذا كان له الزوجة والخادم والدار سمي ملكا .\nوقال ابن جرير : حدثنا يونس بن عبد الأعلى أنبأنا ابن وهب أنبأنا أبو هانئ ; أنه سمع أبا عبد الرحمن الحبلي يقول : سمعت عبد الله بن عمرو بن العاص وسأله رجل فقال : ألسنا من فقراء المهاجرين؟ فقال عبد الله : ألك امرأة تأوي إليها؟ قال : نعم . قال : ألك مسكن تسكنه؟ قال : نعم . قال : فأنت من الأغنياء . فقال : إن لي خادما . قال فأنت من الملوك .\nوقال الحسن البصري : هل الملك إلا مركب وخادم ودار ؟\nرواه ابن جرير . ثم روي عن منصور والحكم ومجاهد وسفيان الثوري نحوا من هذا . وحكاه ابن أبي حاتم عن ميمون بن مهران .\nوقال ابن شوذب : كان الرجل من بني إسرائيل إذا كان له منزل وخادم ، واستؤذن عليه ، فهو ملك .\nوقال قتادة : كانوا أول من ملك الخدم .\nوقال السدي في قوله : ( وجعلكم ملوكا ) قال : يملك الرجل منكم نفسه وأهله وماله . رواه ابن أبي حاتم .\nوقال ابن أبي حاتم : ذكر عن ابن لهيعة عن دراج عن أبي الهيثم عن أبي سعيد الخدري عن رسول الله صلى الله عليه وسلم قال : \" كان بنو إسرائيل إذا كان لأحدهم خادم ودابة وامرأة ، كتب ملكا \" .\nوهذا حديث غريب من هذا الوجه .\nوقال ابن جرير : حدثنا الزبير بن بكار حدثنا أبو ضمرة أنس بن عياض [ قال ] سمعت زيد بن أسلم يقول : ( وجعلكم ملوكا ) فلا أعلم إلا أنه قال : قال رسول الله صلى الله عليه وسلم : \" من كان له بيت وخادم فهو ملك \" .\nوهذا مرسل غريب . وقال مالك : بيت وخادم وزوجة .\nوقد ورد في الحديث : \" من أصبح منكم معافى في جسده ، آمنا في سربه ، عنده قوت يومه ، فكأنما حيزت له الدنيا بحذافيرها \" .\nوقوله : ( وآتاكم ما لم يؤت أحدا من العالمين ) يعني عالمي زمانكم ، فكأنهم كانوا أشرف الناس في زمانهم ، من اليونان والقبط وسائر أصناف بني آدم كما قال : ( ولقد آتينا بني إسرائيل الكتاب والحكم والنبوة ورزقناهم من الطيبات وفضلناهم على العالمين ) [ الجاثية : 16 ] وقال تعالى إخبارا عن موسى لما قالوا : ( اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون . إن هؤلاء متبر ما هم فيه وباطل ما كانوا يعملون . قال أغير الله أبغيكم إلها وهو فضلكم على العالمين ) [ الأعراف : 138 - 140 ]\nوالمقصود : أنهم كانوا أفضل أهل زمانهم ، وإلا فهذه الأمة أشرف منهم ، وأفضل عند الله ، وأكمل شريعة ، وأقوم منهاجا ، وأكرم نبيا ، وأعظم ملكا ، وأغزر أرزاقا ، وأكثر أموالا وأولادا ، وأوسع مملكة ، وأدوم عزا ، قال الله [ عز وجل ] ( كنتم خير أمة أخرجت للناس ) [ آل عمران : 110 ] وقال ( وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ) [ البقرة : 143 ] وقد ذكرنا الأحاديث المتواترة في فضل هذه الأمة وشرفها وكرمها عند الله ، عند قوله عز وجل : ( كنتم خير أمة أخرجت للناس ) من سورة آل عمران .\nوروى ابن جرير عن ابن عباس وأبي مالك وسعيد بن جبير أنهم قالوا في قوله : ( وآتاكم ما لم يؤت أحدا من العالمين ) يعني : أمة محمد صلى الله عليه وسلم ، وكأنهم أرادوا أن هذا الخطاب في قوله : ( وآتاكم ما لم يؤت أحدا من العالمين ) مع هذه الأمة . والجمهور على أنه خطاب من موسى لقومه وهو محمول على عالمي زمانهم كما قدمنا .\nوقيل : المراد : ( وآتاكم ما لم يؤت أحدا من العالمين ) يعني بذلك : ما كان تعالى نزله عليهم من المن والسلوى ، وتظللهم من الغمام وغير ذلك ، مما كان تعالى يخصهم به من خوارق العادات ، فالله أعلم .\n                                    ",
        "qortoby": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَعَلَ فِيكُمۡ أَنۢبِيَآءَ وَجَعَلَكُم مُّلُوكٗا وَءَاتَىٰكُم مَّا لَمۡ يُؤۡتِ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ ٠٢\n                                    \n                                    \n                                    قوله تعالى : وإذ قال موسى لقومه يا قوم اذكروا نعمة الله عليكم\nتبيين من الله تعالى أن أسلافهم تمردوا على موسى وعصوه ; فكذلك هؤلاء على محمد عليه السلام ، وهو تسلية له ; أي : يا أيها الذين آمنوا اذكروا نعمة الله عليكم ، واذكروا قصة موسى ، وروي عن عبد الله بن كثير أنه قرأ \" يا قوم اذكروا \" بضم الميم ، وكذلك ما أشبهه ; وتقديره يا أيها القوم . إذ جعل فيكم أنبياء لم ينصرف ; لأنه فيه ألف التأنيث . وجعلكم ملوكا أي : تملكون أمركم لا يغلبكم عليه غالب بعد أن كنتم مملوكين لفرعون مقهورين ، فأنقذكم منه بالغرق ; فهم ملوك بهذا الوجه ، وبنحوه فسر السدي والحسن وغيرهما . قال السدي : ملك كل واحد منه نفسه وأهله وماله ، وقال قتادة : إنما قال : وجعلكم ملوكا لأنا كنا نتحدث أنهم أول من خدم من بني آدم . قال ابن عطية : وهذا ضعيف ; لأن القبط قد كانوا يستخدمون بني إسرائيل ، وظاهر أمر بني آدم أن بعضهم كان يسخر بعضا مذ تناسلوا وكثروا ، وإنما اختلفت الأمم في معنى التمليك فقط ، وقيل : جعلكم ذوي منازل لا يدخل عليكم إلا بإذن ; روي معناه عن جماعة من أهل العلم . قال ابن عباس : إن الرجل إذا لم يدخل أحد بيته إلا بإذنه فهو ملك ، وعن الحسن أيضا وزيد بن أسلم من كانت له دار وزوجة وخادم فهو ملك ; وهو قول عبد الله بن عمرو كما في صحيح مسلم عن أبي عبد الرحمن الحبلي قال : سمعت عبد الله بن عمرو بن العاص وسأله رجل فقال : ألسنا من فقراء المهاجرين ؟ فقال له عبد الله : ألك امرأة تأوي إليها ؟ قال : نعم . قال : ألك منزل تسكنه ؟ قال : نعم . قال : فأنت من الأغنياء . قال : فإن لي خادما . قال : فأنت من الملوك . قال ابن العربي : وفائدة هذا أن الرجل إذا وجبت عليه كفارة وملك دارا وخادما باعهما في الكفارة ولم يجز له الصيام ، لأنه قادر على الرقبة والملوك لا يكفرون بالصيام ، ولا يوصفون بالعجز عن الإعتاق ، وقال ابن عباس ومجاهد : جعلهم ملوكا بالمن والسلوى والحجر والغمام ، أي : هم مخدومون كالملوك ، وعن ابن عباس أيضا يعني الخادم والمنزل ; وقاله مجاهد وعكرمة والحكم بن عيينة ، وزادوا الزوجة ; وكذا قال زيد بن أسلم إلا أنه قال فيما يعلم - عن النبي صلى الله عليه وسلم : من كان له بيت - أو قال منزل - يأوي إليه وزوجة وخادم يخدمه فهو ملك ; ذكره النحاس ، ويقال : من استغنى عن غيره فهو ملك ; وهذا كما قال صلى الله عليه وسلم : من أصبح آمنا في سربه معافى في بدنه وله قوت يومه فكأنما حيزت له الدنيا بحذافيرها .\nقوله تعالى : وآتاكم أي : أعطاكم ما لم يؤت أحدا من العالمين والخطاب من موسى لقومه في قول جمهور المفسرين ; وهو وجه الكلام . مجاهد : والمراد بالإيتاء المن والسلوى والحجر والغمام ، وقيل : كثرة الأنبياء فيهم ، والآيات التي جاءتهم ، وقيل : قلوبا سليمة من الغل والغش ، وقيل : إحلال الغنائم والانتفاع بها .\nقلت : وهذا القول مردود ; فإن الغنائم لم تحل لأحد إلا لهذه الأمة على ما ثبت في الصحيح ; وسيأتي بيانه إن شاء الله تعالى ، وهذه المقالة من موسى توطئة لنفوسهم حتى تعزز وتأخذ الأمر بدخول أرض الجبارين بقوة ، وتنفذ في ذلك نفوذ من أعزه الله ورفع من شأنه ، ومعنى من العالمين أي : عالمي زمانكم ; عن الحسن . وقال ابن جبير وأبو مالك : الخطاب لأمة محمد صلى الله عليه وسلم ; وهذا عدول عن ظاهر الكلام بما لا يحسن مثله . وتظاهرت الأخبار أن دمشق قاعدة الجبارين . والمقدسة معناه المطهرة . مجاهد : المباركة ; والبركة التطهير من القحوط والجوع ونحوه . قتادة : هي الشام . مجاهد : الطور وما حوله . ابن عباس والسدي وابن زيد : هي أريحاء . قال الزجاج : دمشق وفلسطين وبعض الأردن ، وقول قتادة يجمع هذا كله . التي كتب الله لكم أي : فرض دخولها عليكم ووعدكم دخولها وسكناها لكم . ولما خرجت بنو إسرائيل من مصر أمرهم بجهاد أهل أريحاء من بلاد فلسطين فقالوا : لا علم لنا بتلك الديار ; فبعث بأمر الله اثني عشر نقيبا ، من كل سبط رجل يتجسسون الأخبار على ما تقدم ، فرأوا سكانها الجبارين من العمالقة ، وهم ذوو أجسام هائلة ; حتى قيل : إن بعضهم رأى هؤلاء النقباء فأخذهم في كمه مع فاكهة كان قد حملها من بستانه وجاء بهم إلى الملك فنثرهم بين يده وقال : إن هؤلاء يريدون قتالنا ; فقال لهم الملك : ارجعوا إلى صاحبكم فأخبروه خبرنا ; على ما تقدم ، وقيل : إنهم لما رجعوا أخذوا من عنب تلك الأرض عنقودا فقيل : حمله رجل واحد ، وقيل : حمله النقباء الاثنا عشر .\nقلت : وهذا أشبه ; فإنه يقال : إنهم لما وصلوا إلى الجبارين وجدوهم يدخل في كم أحدهم رجلان منهم ، ولا يحمل عنقود أحدهم إلا خمسة منهم في خشبة ، ويدخل في شطر الرمانة إذا نزع حبه خمسة أنفس أو أربعة .\nقلت : ولا تعارض بين هذا والأول ; فإن ذلك الجبار الذي أخذهم في كمه - ويقال : في حجره - هو عوج بن عناق وكان أطولهم قامة وأعظمهم خلقا ; على ما يأتي من ذكره إن شاء الله تعالى ، وكان طول سائرهم ستة أذرع ونصفا في قول مقاتل . وقال الكلبي : كان طول كل رجل منهم ثمانين ذراعا ، والله أعلم . فلما أذاعوا الخبر ما عدا يوشع وكالب بن يوقنا ، وامتنعت بنو إسرائيل من الجهاد عوقبوا بالتيه أربعين سنة إلى أن مات أولئك العصاة ونشأ أولادهم ، فقاتلوا الجبارين وغلبوهم .\n                                    ",
        "saadi": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَعَلَ فِيكُمۡ أَنۢبِيَآءَ وَجَعَلَكُم مُّلُوكٗا وَءَاتَىٰكُم مَّا لَمۡ يُؤۡتِ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ ٠٢\n                                        \n                                        \n                                        \n                                        لما امتن الله على موسى وقومه بنجاتهم من فرعون وقومه وأسرهم واستبعادهم، ذهبوا قاصدين لأوطانهم ومساكنهم، وهي بيت المقدس وما حواليه، وقاربوا وصول بيت المقدس، وكان الله قد فرض عليهم جهاد عدوهم ليخرجوه من ديارهم. فوعظهم موسى عليه السلام؛ وذكرهم ليقدموا على الجهاد فقال لهم: { اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ } بقلوبكم وألسنتكم. فإن ذكرها داع إلى محبته تعالى ومنشط على العبادة، { إِذْ جَعَلَ فِيكُمْ أَنبِيَاءَ } يدعونكم إلى الهدى، ويحذرونكم من الردى، ويحثونكم على سعادتكم الأبدية، ويعلمونكم ما لم تكونوا تعلمون { وَجَعَلَكُم مُّلُوكًا } تملكون أمركم، بحيث إنه زال عنكم استعباد عدوكم لكم، فكنتم تملكون أمركم، وتتمكنون من إقامة دينكم. { وَآتَاكُمْ } من النعم الدينية والدنيوية { مَا لَمْ يُؤْتِ أَحَدًا مِّنَ الْعَالَمِينَ } فإنهم في ذلك الزمان خيرة الخلق، وأكرمهم على الله تعالى. وقد أنعم عليهم بنعم ما كانت لغيرهم. فذكرهم بالنعم الدينية والدنيوية، الداعي ذلك لإيمانهم وثباته، وثباتهم على الجهاد، وإقدامهم عليه، ولهذا قال:\n                                    "
      },
      "originalText": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَعَلَ فِيكُمۡ أَنۢبِيَآءَ وَجَعَلَكُم مُّلُوكٗا وَءَاتَىٰكُم مَّا لَمۡ يُؤۡتِ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ ٠٢"
    },
    {
      "number": 690,
      "text": "يَا قَوْمِ ادْخُلُوا الْأَرْضَ الْمُقَدَّسَةَ الَّتِي كَتَبَ اللَّهُ لَكُمْ وَلَا تَرْتَدُّوا عَلَىٰ أَدْبَارِكُمْ فَتَنْقَلِبُوا خَاسِرِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 21,
      "juz": 6,
      "manzil": 2,
      "page": 111,
      "ruku": 89,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ٱلۡمُقَدَّسَةَ ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ ١٢\n                                    \n                                    \n                                    ثم قال تعالى مخبرا عن تحريض موسى عليه السلام لبني إسرائيل على الجهاد والدخول إلى بيت المقدس الذي كان بأيديهم في زمان أبيهم يعقوب لما ارتحل هو وبنوه وأهله إلى بلاد مصر أيام يوسف عليه السلام ، ثم لم يزالوا بها حتى خرجوا مع موسى [ عليه السلام ] فوجدوا فيها قوما من العمالقة الجبارين قد استحوذوا عليها وتملكوها ، فأمرهم رسول الله موسى عليه السلام ، بالدخول إليها ، وبقتال أعدائهم ، وبشرهم بالنصرة والظفر عليهم ، فنكلوا وعصوا وخالفوا أمره ، فعوقبوا بالذهاب في التيه والتمادي في سيرهم حائرين ، لا يدرون كيف يتوجهون فيه إلى مقصد ، مدة أربعين سنة ، عقوبة لهم على تفريطهم في أمر الله [ تعالى ] فقال تعالى مخبرا عن موسى أنه قال : ( يا قوم ادخلوا الأرض المقدسة ) أي : المطهرة .\nقال سفيان الثوري عن الأعمش عن مجاهد عن ابن عباس في قوله : ( ادخلوا الأرض المقدسة ) قال : هي الطور وما حوله . وكذا قال مجاهد وغير واحد .\nوقال سفيان الثوري عن أبي سعيد البقال عن عكرمة عن ابن عباس قال : هي أريحا . وكذا ذكر غير واحد من المفسرين .\nوفي هذا نظر ; لأن أريحا ليست هي المقصود بالفتح ، ولا كانت في طريقهم إلى بيت المقدس وقد قدموا من بلاد مصر حين أهلك الله عدوهم فرعون [ اللهم ] إلا أن يكون المراد بأريحا أرض بيت المقدس كما قاله - السدي فيما رواه ابن جرير عنه - لا أن المراد بها هذه البلدة المعروفة في طرف الغور شرقي بيت المقدس .\nوقوله تعالى : ( التي كتب الله لكم ) أي : التي وعدكموها الله على لسان أبيكم إسرائيل : أنه وراثة من آمن منكم . ( ولا ترتدوا على أدباركم ) أي : ولا تنكلوا عن الجهاد ( فتنقلبوا خاسرين)\n                                    ",
        "qortoby": "يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ٱلۡمُقَدَّسَةَ ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ ١٢\n                                    \n                                    \n                                    قوله تعالى : ولا ترتدوا على أدباركم أي : لا ترجعوا عن طاعتي وما أمرتكم به من قتال الجبارين ، وقيل : لا ترجعوا عن طاعة الله إلى معصيته ، والمعنى واحد .\n                                    ",
        "saadi": "يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ٱلۡمُقَدَّسَةَ ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ ١٢\n                                        \n                                        \n                                        \n                                        { يَا قَوْمِ ادْخُلُوا الْأَرْضَ الْمُقَدَّسَةَ } أي: المطهرة { الَّتِي كَتَبَ اللَّهُ لَكُمْ } فأخبرهم خبرا تطمئن به أنفسهم، إن كانوا مؤمنين مصدقين بخبر الله، وأنه قد كتب الله لهم دخولها، وانتصارهم على عدوهم. { وَلَا تَرْتَدُّوا } أي: ترجعوا { عَلَى أَدْبَارِكُمْ فَتَنْقَلِبُوا خَاسِرِينَ } قد خسرتم دنياكم بما فاتكم من النصر على الأعداء وفتح بلادكم. وآخرتكم بما فاتكم من الثواب، وما استحققتم -بمعصيتكم- من العقاب.\n                                    "
      },
      "originalText": "يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ٱلۡمُقَدَّسَةَ ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ ١٢"
    },
    {
      "number": 691,
      "text": "قَالُوا يَا مُوسَىٰ إِنَّ فِيهَا قَوْمًا جَبَّارِينَ وَإِنَّا لَنْ نَدْخُلَهَا حَتَّىٰ يَخْرُجُوا مِنْهَا فَإِنْ يَخْرُجُوا مِنْهَا فَإِنَّا دَاخِلُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 22,
      "juz": 6,
      "manzil": 2,
      "page": 111,
      "ruku": 89,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالُواْ يَٰمُوسَىٰٓ إِنَّ فِيهَا قَوۡمٗا جَبَّارِينَ وَإِنَّا لَن نَّدۡخُلَهَا حَتَّىٰ يَخۡرُجُواْ مِنۡهَا فَإِن يَخۡرُجُواْ مِنۡهَا فَإِنَّا دَٰخِلُونَ ٢٢\n                                    \n                                    \n                                    أي : اعتذروا بأن في هذه البلدة - التي أمرتنا بدخولها وقتال أهلها - قوما جبارين ، أي : ذوي خلق هائلة ، وقوى شديدة ، وإنا لا نقدر على مقاومتهم ولا مصاولتهم ، ولا يمكننا الدخول إليها ما داموا فيها ، فإن يخرجوا منها دخلناها وإلا فلا طاقة لنا بهم .\nوقد قال ابن جرير : حدثني عبد الكريم بن الهيثم حدثنا إبراهيم بن بشار حدثنا سفيان قال : قال أبو سعيد قال عكرمة عن ابن عباس قال : أمر موسى أن يدخل مدينة الجبارين . قال : فسار موسى بمن معه حتى نزل قريبا من المدينة - وهي أريحا - فبعث إليهم اثني عشر عينا ، من كل سبط منهم عين ، ليأتوه بخبر القوم . قال : فدخلوا المدينة فرأوا أمرا عظيما من هيئتهم وجثثهم وعظمهم ، فدخلوا حائطا لبعضهم ، فجاء صاحب الحائط ليجتني الثمار من حائطه ، فجعل يجتني الثمار . وينظر إلى آثارهم ، فتتبعهم فكلما أصاب واحدا منهم أخذه فجعله في كمه مع الفاكهة ، حتى التقط الاثني عشر كلهم ، فجعلهم في كمه مع الفاكهة ، وذهب إلى ملكهم فنثرهم بين يديه فقال لهم الملك : قد رأيتم شأننا وأمرنا ، فاذهبوا فأخبروا صاحبكم . قال : فرجعوا إلى موسى فأخبروه بما عاينوا من أمرهم .\nوفي هذا الإسناد نظر .\nوقال علي بن أبي طلحة عن ابن عباس : لما نزل موسى وقومه ، بعث منهم اثني عشر رجلا - وهم النقباء الذين ذكر الله ، فبعثهم ليأتوه بخبرهم ، فساروا ، فلقيهم رجل من الجبارين ، فجعلهم في كسائه ، فحملهم حتى أتى بهم المدينة ، ونادى في قومه فاجتمعوا إليه ، فقالوا : من أنتم؟ قالوا : نحن قوم موسى ، بعثنا نأتيه بخبركم . فأعطوهم حبة من عنب تكفي الرجل ، فقالوا لهم : اذهبوا إلى موسى وقومه فقولوا لهم : اقدروا قدر فاكهتهم فلما أتوهم قالوا : يا موسى ( فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون )\nرواه ابن أبي حاتم ثم قال : حدثنا أبي ، حدثنا ابن أبي مريم حدثنا يحيى بن أيوب عن يزيد بن الهاد حدثني يحيى بن عبد الرحمن قال : رأيت أنس بن مالك أخذ عصا ، فذرع فيها بشيء ، لا أدري كم ذرع ، ثم قاس بها في الأرض خمسين أو خمسا وخمسين ، ثم قال : هكذا طول العماليق .\nوقد ذكر كثير من المفسرين هاهنا أخبارا من وضع بني إسرائيل في عظمة خلق هؤلاء الجبارين ، وأنه كان فيهم عوج بن عنق بنت آدم عليه السلام ، وأنه كان طوله ثلاثة آلاف ذراع وثلاثمائة وثلاثة وثلاثون ذراعا وثلث ذراع ، تحرير الحساب ! وهذا شيء يستحى من ذكره . ثم هو مخالف لما ثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال : \" إن الله [ تعالى ] خلق آدم وطوله ستون ذراعا ، ثم لم يزل الخلق ينقص حتى الآن \" .\nثم قد ذكروا أن هذا الرجل كان كافرا ، وأنه كان ولد زنية ، وأنه امتنع من ركوب السفينة ، وأن الطوفان لم يصل إلى ركبته وهذا كذب وافتراء ، فإن الله ذكر أن نوحا دعا على أهل الأرض من الكافرين ، فقال ( رب لا تذر على الأرض من الكافرين ديارا ) [ نوح : 26 ] وقال تعالى : ( فأنجيناه ومن معه في الفلك المشحون ثم أغرقنا بعد الباقين ) [ الشعراء : 119 - 120 ] وقال تعالى : [ قال ] ( لا عاصم اليوم من أمر الله إلا من رحم ) [ هود : 43 ] وإذا كان ابن نوح الكافر غرق ، فكيف يبقى عوج بن عنق وهو كافر وولد زنية؟! هذا لا يسوغ في عقل ولا شرع . ثم في وجود رجل يقال له : \" عوج بن عنق نظر والله أعلم.\n                                    ",
        "qortoby": "قَالُواْ يَٰمُوسَىٰٓ إِنَّ فِيهَا قَوۡمٗا جَبَّارِينَ وَإِنَّا لَن نَّدۡخُلَهَا حَتَّىٰ يَخۡرُجُواْ مِنۡهَا فَإِن يَخۡرُجُواْ مِنۡهَا فَإِنَّا دَٰخِلُونَ ٢٢\n                                    \n                                    \n                                    قوله تعالى : قالوا ياموسى إن فيها قوما جبارين أي : عظام الأجسام طوال ، وقد تقدم ; يقال : نخلة جبارة أي : طويلة ، والجبار المتعظم الممتنع من الذل والفقر . وقال الزجاج : الجبار من الآدميين العاتي ، وهو الذي يجبر الناس على ما يريد ; فأصله على هذا من الإجبار وهو الإكراه ; فإنه يجبر غيره على ما يريده ; وأجبره أي : أكرهه . وقيل : هو مأخوذ من جبر العظم ; فأصل الجبار على هذا المصلح أمر نفسه ، ثم استعمل في كل من جر لنفسه نفعا بحق أو باطل ، وقيل : إن جبر العظم راجع إلى معنى الإكراه . قال الفراء : لم أسمع فعالا من أفعل إلا في حرفين ; جبار من أجبر ودراك من أدرك . ثم قيل : كان هؤلاء من بقايا عاد ، وقيل : هم من ولد عيصوا بن إسحاق ، وكانوا من الروم ، وكان معهم عوج الأعنق ، وكان طوله ثلاثة آلاف ذراع وثلثمائة وثلاثة وثلاثين ذراعا ; قاله ابن عمر ، وكان يحتجن السحاب أي : يجذبه بمحجنه ويشرب منه ، ويتناول الحوت من قاع البحر فيشويه بعين الشمس يرفعه إليها ثم يأكله ، وحضر طوفان نوح عليه السلام ولم يجاوز ركبتيه وكان عمره ثلاثة آلاف وستمائة سنة ، وأنه قلع صخرة على قدر عسكر موسى ليرضخهم بها ، فبعث الله طائرا فنقرها ووقعت في عنقه فصرعته ، وأقبل موسى عليه السلام وطوله عشرة أذرع ; وعصاه عشرة أذرع وترقى في السماء عشرة أذرع فما أصاب إلا كعبه وهو مصروع فقتله ، وقيل : بل ضربه في العرق الذي تحت كعبه فصرعه فمات ووقع على نيل مصر فجسرهم سنة . ذكر هذا المعنى باختلاف ألفاظ محمد بن إسحاق والطبري ومكي وغيرهم ، وقال الكلبي : عوج من ولد هاروت وماروت حيث وقعا بالمرأة فحملت ، والله أعلم .\nقوله تعالى : إنا لن ندخلها يعني البلدة إيلياء ، ويقال : أريحاء حتى يخرجوا منها أي : حتى يسلموها لنا من غير قتال ، وقيل : قالوا ذلك خوفا من الجبارين ولم يقصدوا العصيان ; فإنهم قالوا :فإن يخرجوا منها فإنا داخلون\n                                    ",
        "saadi": "قَالُواْ يَٰمُوسَىٰٓ إِنَّ فِيهَا قَوۡمٗا جَبَّارِينَ وَإِنَّا لَن نَّدۡخُلَهَا حَتَّىٰ يَخۡرُجُواْ مِنۡهَا فَإِن يَخۡرُجُواْ مِنۡهَا فَإِنَّا دَٰخِلُونَ ٢٢\n                                        \n                                        \n                                        \n                                        فقالوا قولا يدل على ضعف قلوبهم، وخور نفوسهم، وعدم اهتمامهم بأمر الله ورسوله. { يَا مُوسَى إِنَّ فِيهَا قَوْمًا جَبَّارِينَ } شديدي القوة والشجاعة، أي: فهذا من الموانع لنا من دخولها. { وَإِنَّا لَن نَّدْخُلَهَا حَتَّى يَخْرُجُوا مِنْهَا فَإِن يَخْرُجُوا مِنْهَا فَإِنَّا دَاخِلُونَ } وهذا من الجبن وقلة اليقين، وإلا فلو كان معهم رشدهم، لعلموا أنهم كلهم من بني آدم، وأن القوي من أعانه الله بقوة من عنده، فإنه لا حول ولا قوة إلا بالله، ولعلموا أنهم سينصرون عليهم، إذ وعدهم الله بذلك، وعدا خاصا.\n                                    "
      },
      "originalText": "قَالُواْ يَٰمُوسَىٰٓ إِنَّ فِيهَا قَوۡمٗا جَبَّارِينَ وَإِنَّا لَن نَّدۡخُلَهَا حَتَّىٰ يَخۡرُجُواْ مِنۡهَا فَإِن يَخۡرُجُواْ مِنۡهَا فَإِنَّا دَٰخِلُونَ ٢٢"
    },
    {
      "number": 692,
      "text": "قَالَ رَجُلَانِ مِنَ الَّذِينَ يَخَافُونَ أَنْعَمَ اللَّهُ عَلَيْهِمَا ادْخُلُوا عَلَيْهِمُ الْبَابَ فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَالِبُونَ ۚ وَعَلَى اللَّهِ فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 23,
      "juz": 6,
      "manzil": 2,
      "page": 111,
      "ruku": 89,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ رَجُلَانِ مِنَ ٱلَّذِينَ يَخَافُونَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِمَا ٱدۡخُلُواْ عَلَيۡهِمُ ٱلۡبَابَ فَإِذَا دَخَلۡتُمُوهُ فَإِنَّكُمۡ غَٰلِبُونَۚ وَعَلَى ٱللَّهِ فَتَوَكَّلُوٓاْ إِن كُنتُم مُّؤۡمِنِينَ ٣٢\n                                    \n                                    \n                                    وقوله : ( قال رجلان من الذين يخافون أنعم الله عليهما ) أي : فلما نكل بنو إسرائيل عن طاعة الله ومتابعة رسول الله موسى عليه السلام ، حرضهم رجلان لله عليهما نعمة عظيمة ، وهما ممن يخاف أمر الله ويخشى عقابه .\nوقرأ بعضهم : ( قال رجلان من الذين يخافون ) أي : ممن لهم مهابة وموضع من الناس . ويقال : إنهما \" يوشع بن نون \" و \" كالب بن يوفنا \" ، قاله ابن عباس ومجاهد وعكرمة وعطية والسدي والربيع بن أنس وغير واحد من السلف ، والخلف ، رحمهم الله ، فقالا ( ادخلوا عليهم الباب فإذا دخلتموه فإنكم غالبون وعلى الله فتوكلوا إن كنتم مؤمنين ) أي : متى توكلتم على الله واتبعتم أمره ، ووافقتم رسوله ، نصركم الله على أعدائكم وأيدكم وظفركم بهم ، ودخلتم البلدة التي كتبها الله لكم . فلم ينفع ذاك فيهم شيئا .\n                                    ",
        "qortoby": "قَالَ رَجُلَانِ مِنَ ٱلَّذِينَ يَخَافُونَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِمَا ٱدۡخُلُواْ عَلَيۡهِمُ ٱلۡبَابَ فَإِذَا دَخَلۡتُمُوهُ فَإِنَّكُمۡ غَٰلِبُونَۚ وَعَلَى ٱللَّهِ فَتَوَكَّلُوٓاْ إِن كُنتُم مُّؤۡمِنِينَ ٣٢\n                                    \n                                    \n                                    قوله تعالى : قال رجلان من الذين يخافون قال ابن عباس وغيره : هما يوشع وكالب بن يوقنا ويقال ابن قانيا ، وكانا من الاثني عشر نقيبا . ويخافون أي : من الجبارين . قتادة : يخافون الله تعالى ، وقال الضحاك : هما رجلان كانا في مدينة الجبارين على دين موسى ; فمعنى يخافون على هذا أي : من العمالقة من حيث الطبع لئلا يطلعوا على إيمانهم فيفتنوهم ولكن وثقا بالله ، وقيل : يخافون ضعف بني إسرائيل وجبنهم ، وقرأ مجاهد وابن جبير \" يخافون \" بضم الياء ، وهذا يقوي أنهما من غير قوم موسى . أنعم الله عليهما أي : بالإسلام أو باليقين والصلاح . ادخلوا عليهم الباب فإذا دخلتموه فإنكم غالبون قالا لبني إسرائيل لا يهولنكم عظم أجسامهم فقلوبهم ملئت رعبا منكم ; فأجسامهم عظيمة وقلوبهم ضعيفة ، وكانوا قد علموا أنهم إذا دخلوا من ذلك الباب كان لهم الغلب ، ويحتمل أن يكونا قالا ذلك ثقة بوعد الله . ثم قالا : وعلى الله فتوكلوا إن كنتم مؤمنين مصدقين به ; فإنه ينصركم . ثم قيل على القول الأول : لما قالا هذا أراد بنو إسرائيل رجمهما بالحجارة ، وقالوا : نصدقكما وندع قول عشرة ! .\n                                    ",
        "saadi": "قَالَ رَجُلَانِ مِنَ ٱلَّذِينَ يَخَافُونَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِمَا ٱدۡخُلُواْ عَلَيۡهِمُ ٱلۡبَابَ فَإِذَا دَخَلۡتُمُوهُ فَإِنَّكُمۡ غَٰلِبُونَۚ وَعَلَى ٱللَّهِ فَتَوَكَّلُوٓاْ إِن كُنتُم مُّؤۡمِنِينَ ٣٢\n                                        \n                                        \n                                        \n                                        { قَالَ رَجُلَانِ مِنَ الَّذِينَ يَخَافُونَ } الله تعالى، مشجعين لقومهم، منهضين لهم على قتال عدوهم واحتلال بلادهم. { أَنْعَمَ اللَّهُ عَلَيْهِمَا } بالتوفيق، وكلمة الحق في هذا الموطن المحتاج إلى مثل كلامهم، وأنعم عليهم بالصبر واليقين. { ادْخُلُوا عَلَيْهِمُ الْبَابَ فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَالِبُونَ } أي: ليس بينكم وبين نصركم عليهم إلا أن تجزموا عليهم، وتدخلوا عليهم الباب، فإذا دخلتموه عليهم فإنهم سينهزمون، ثم أمَرَاهم بعدة هي أقوى العدد، فقالا: { وَعَلَى اللَّهِ فَتَوَكَّلُوا إِن كُنْتُم مُّؤْمِنِينَ } فإن في التوكل على الله -وخصوصا في هذا الموطن- تيسيرا للأمر، ونصرا على الأعداء. ودل هذا على وجوب التوكل، وعلى أنه بحسب إيمان العبد يكون توكله، فلم ينجع فيهم هذا الكلام، ولا نفع فيهم الملام، فقالوا قول الأذلين\n                                    "
      },
      "originalText": "قَالَ رَجُلَانِ مِنَ ٱلَّذِينَ يَخَافُونَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِمَا ٱدۡخُلُواْ عَلَيۡهِمُ ٱلۡبَابَ فَإِذَا دَخَلۡتُمُوهُ فَإِنَّكُمۡ غَٰلِبُونَۚ وَعَلَى ٱللَّهِ فَتَوَكَّلُوٓاْ إِن كُنتُم مُّؤۡمِنِينَ ٣٢"
    }
  ]
}