{
  "number": 112,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 693,
      "text": "قَالُوا يَا مُوسَىٰ إِنَّا لَنْ نَدْخُلَهَا أَبَدًا مَا دَامُوا فِيهَا ۖ فَاذْهَبْ أَنْتَ وَرَبُّكَ فَقَاتِلَا إِنَّا هَاهُنَا قَاعِدُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 24,
      "juz": 6,
      "manzil": 2,
      "page": 112,
      "ruku": 89,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالُواْ يَٰمُوسَىٰٓ إِنَّا لَن نَّدۡخُلَهَآ أَبَدٗا مَّا دَامُواْ فِيهَا فَٱذۡهَبۡ أَنتَ وَرَبُّكَ فَقَٰتِلَآ إِنَّا هَٰهُنَا قَٰعِدُونَ ٤٢\n                                    \n                                    \n                                    وهذا نكول منهم عن الجهاد ، ومخالفة لرسولهم وتخلف عن مقاتلة الأعداء .\nويقال : إنهم لما نكلوا على الجهاد وعزموا على الانصراف والرجوع إلى بلادهم ، سجد موسى وهارون ، عليهما السلام ، قدام ملأ من بني إسرائيل إعظاما لما هموا به ، وشق \" يوشع بن نون \" و \" كالب بن يوفنا \" ثيابهما ، ولاما قومهما على ذلك ، فيقال : إنهم رجموهما . وجرى أمر عظيم وخطر جليل .\nوما أحسن ما أجاب به الصحابة ، رضي الله عنهم يوم بدر رسول الله صلى الله عليه وسلم حين استشارهم في قتال النفير ، الذين جاءوا لمنع العير الذي كان مع أبي سفيان فلما فات اقتناص العير ، واقترب منهم النفير ، وهم في جمع ما بين التسعمائة إلى الألف ، في العدة والبيض واليلب ، فتكلم أبو بكر رضي الله عنه ، فأحسن ، ثم تكلم من تكلم من الصحابة من المهاجرين ورسول الله صلى الله عليه وسلم يقول : \" أشيروا علي أيها المسلمون \" . وما يقول ذلك إلا ليستعلم ما عند الأنصار لأنهم كانوا جمهور الناس يومئذ . فقال سعد بن معاذ [ رضي الله عنه ] كأنك تعرض بنا يا رسول الله ، فوالذي بعثك بالحق لو استعرضت بنا هذا البحر فخضته لخضناه معك ، وما تخلف منا رجل واحد ، وما نكره أن تلقى بنا عدونا غدا ، إنا لصبر في الحرب ، صدق في اللقاء ، لعل الله يريك منا ما تقر به عينك ، فسر بنا على بركة الله ، فسر رسول الله صلى الله عليه وسلم بقول سعد ونشطه ذلك .\nوقال أبو بكر بن مردويه : حدثنا علي بن الحسين حدثنا أبو حاتم الرازي حدثنا محمد بن عبد الله الأنصاري حدثنا حميد عن أنس أن رسول الله صلى الله عليه وسلم لما سار إلى بدر استشار المسلمين ، فأشار إليه عمر ثم استشارهم فقالت الأنصار : يا معشر الأنصار إياكم يريد رسول الله صلى الله عليه وسلم . قالوا : إذا لا نقول له كما قالت بنو إسرائيل لموسى : ( فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون ) والذي بعثك بالحق لو ضربت أكبادها إلى برك الغماد لاتبعناك .\nورواه الإمام أحمد عن عبيدة بن حميد الطويل عن أنس به . ورواه النسائي عن محمد بن المثنى عن خالد بن الحارث عن حميد به ، ورواه ابن حبان عن أبي يعلى عن عبد الأعلى بن حماد عن معمر بن سليمان عن حميد به .\nوقال ابن مردويه : أخبرنا عبد الله بن جعفر أخبرنا إسماعيل بن عبد الله حدثنا عبد الرحمن بن إبراهيم حدثنا محمد بن شعيب عن الحسن بن أيوب عن عبد الله بن ناسخ عن عتبة بن عبد السلمي قال : قال النبي صلى الله عليه وسلم لأصحابه : \" ألا تقاتلون؟ \" قالوا : نعم ، ولا نقول كما قالت بنو إسرائيل لموسى : ( فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون ) ولكن اذهب أنت وربك فقاتلا إنا معكما مقاتلون .\nوكان ممن أجاب يومئذ المقداد بن عمرو الكندي رضي الله عنه ، كما قال الإمام أحمد :\nحدثنا وكيع حدثنا سفيان عن مخارق بن عبد الله الأحمسي عن طارق - هو ابن شهاب - : أن المقداد قال لرسول الله صلى الله عليه وسلم يوم بدر : يا رسول الله ، إنا لا نقول لك كما قالت بنو إسرائيل لموسى : ( فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون ) ولكن اذهب أنت وربك فقاتلا إنا معكما مقاتلون .\nهكذا رواه أحمد من هذا الوجه ، وقد رواه من طريق أخرى فقال :\nحدثنا أسود بن عامر حدثنا إسرائيل عن مخارق عن طارق بن شهاب قال : قال عبد الله - هو ابن مسعود - رضي الله عنه : لقد شهدت من المقداد مشهدا لأن أكون أنا صاحبه أحب إلي مما عدل به : أتى رسول الله [ صلى الله عليه وسلم ] وهو يدعو على المشركين ، فقال : والله يا رسول الله ، لا نقول كما قالت بنو إسرائيل لموسى : ( فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون ) ولكنا نقاتل عن يمينك وعن يسارك ، ومن بين يديك ومن خلفك . فرأيت وجه رسول الله صلى الله عليه وسلم يشرق لذلك ، وسره بذلك .\nوهكذا رواه البخاري \" في المغازي \" وفي \" التفسير \" من طرق عن مخارق به . ولفظه في \" كتاب التفسير \" عن عبد الله قال : قال المقداد يوم بدر : يا رسول الله ، إنا لا نقول لك كما قالت بنو إسرائيل لموسى : ( فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون ) ولكن [ نقول ] امض ونحن معك فكأنه سرى عن رسول الله صلى الله عليه وسلم .\nثم قال البخاري : ورواه وكيع عن سفيان عن مخارق عن طارق أن المقداد قال للنبي صلى الله عليه وسلم .\nوقال ابن جرير : حدثنا بشر حدثنا يزيد حدثنا سعيد عن قتادة قال : ذكر لنا أن رسول الله صلى الله عليه وسلم قال لأصحابه يوم الحديبية حين صد المشركون الهدي وحيل بينهم وبين مناسكهم : \" إني ذاهب بالهدي فناحره عند البيت \" . فقال له المقداد بن الأسود : أما والله لا نكون كالملأ من بني إسرائيل إذ قالوا لنبيهم : ( فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون ) ولكن اذهب أنت وربك فقاتلا إنا معكم مقاتلون . فلما سمعها أصحاب رسول الله صلى الله عليه وسلم تتابعوا على ذلك .\nوهذا إن كان محفوظا يوم الحديبية ، فيحتمل أنه كرر هذه المقالة يومئذ كما قاله يوم بدر .\n                                    ",
        "qortoby": "قَالُواْ يَٰمُوسَىٰٓ إِنَّا لَن نَّدۡخُلَهَآ أَبَدٗا مَّا دَامُواْ فِيهَا فَٱذۡهَبۡ أَنتَ وَرَبُّكَ فَقَٰتِلَآ إِنَّا هَٰهُنَا قَٰعِدُونَ ٤٢\n                                    \n                                    \n                                    ثم قالوا لموسى : إنا لن ندخلها أبدا ما داموا فيها وهذا عناد وحيد عن القتال ، وإياس من النصر . ثم جهلوا صفة الرب تبارك وتعالى فقالوا فاذهب أنت وربك وصفوه بالذهاب والانتقال ، والله متعال عن ذلك ، وهذا يدل على أنهم كانوا مشبهة ; وهو معنى قول الحسن ; لأنه قال : هو كفر منهم بالله ، وهو الأظهر في معنى الكلام ، وقيل : أي : أن نصرة ربك لك أحق من نصرتنا ، وقتاله معك - إن كنت رسوله - أولى من قتالنا ; فعلى هذا يكون ذلك منهم كفر ; لأنهم شكوا في رسالته . وقيل المعنى : اذهب أنت فقاتل وليعنك ربك ، وقيل : أرادوا بالرب هارون ، وكان أكبر من موسى وكان موسى يطيعه . وبالجملة فقد فسقوا بقولهم ; لقوله تعالى : فلا تأس على القوم الفاسقين أي : لا تحزن عليهم . إنا هاهنا قاعدون أي : لا نبرح ولا نقاتل ، ويجوز \" قاعدين \" على الحال ; لأن الكلام قد تم قبله .\n                                    ",
        "saadi": "قَالُواْ يَٰمُوسَىٰٓ إِنَّا لَن نَّدۡخُلَهَآ أَبَدٗا مَّا دَامُواْ فِيهَا فَٱذۡهَبۡ أَنتَ وَرَبُّكَ فَقَٰتِلَآ إِنَّا هَٰهُنَا قَٰعِدُونَ ٤٢\n                                        \n                                        \n                                        \n                                        { يَا مُوسَى إِنَّا لَن نَدْخُلَهَا أَبَدًا مَّا دَامُوا فِيهَا فَاذْهَبْ أَنتَ وَرَبُّكَ فَقَاتِلَا إِنَّا هَاهُنَا قَاعِدُونَ } فما أشنع هذا الكلام منهم، ومواجهتهم لنبيهم في هذا المقام الحرج الضيق، الذي قد دعت الحاجة والضرورة إلى نصرة نبيهم، وإعزاز أنفسهم. وبهذا وأمثاله يظهر التفاوت بين سائر الأمم، وأمة محمد صلى الله عليه وسلم حيث قال الصحابة لرسول الله صلى الله عليه وسلم -حين شاورهم في القتال يوم \"بدر\" مع أنه لم يحتم عليهم: يا رسول الله، لو خضت بنا هذا البحر لخضناه معك، ولو بلغت بنا برك الغماد ما تخلف عنك أحد. ولا نقول كما قال قوم موسى لموسى: { اذْهَبْ أَنتَ وَرَبُّكَ فَقَاتِلَا إِنَّا هَاهُنَا قَاعِدُونَ } ولكن اذهب أنت وربك فقاتلا إنا معكما مقاتلون، من بين يديك ومن خلفك، وعن يمينك وعن يسارك.\n                                    "
      },
      "originalText": "قَالُواْ يَٰمُوسَىٰٓ إِنَّا لَن نَّدۡخُلَهَآ أَبَدٗا مَّا دَامُواْ فِيهَا فَٱذۡهَبۡ أَنتَ وَرَبُّكَ فَقَٰتِلَآ إِنَّا هَٰهُنَا قَٰعِدُونَ ٤٢"
    },
    {
      "number": 694,
      "text": "قَالَ رَبِّ إِنِّي لَا أَمْلِكُ إِلَّا نَفْسِي وَأَخِي ۖ فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفَاسِقِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 25,
      "juz": 6,
      "manzil": 2,
      "page": 112,
      "ruku": 89,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ رَبِّ إِنِّي لَآ أَمۡلِكُ إِلَّا نَفۡسِي وَأَخِيۖ فَٱفۡرُقۡ بَيۡنَنَا وَبَيۡنَ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ ٥٢\n                                    \n                                    \n                                    وقوله : ( قال رب إني لا أملك إلا نفسي وأخي فافرق بيننا وبين القوم الفاسقين ) يعني : لما نكل بنو إسرائيل عن القتال غضب عليهم موسى عليه السلام ، وقال داعيا عليهم : ( رب إني لا أملك إلا نفسي وأخي ) أي : ليس أحد يطيعني منهم فيمتثل أمر الله ، ويجيب إلى ما دعوت إليه إلا أنا وأخي هارون ( فافرق بيننا وبين القوم الفاسقين ) قال العوفي عن ابن عباس : يعني اقض بيني وبينهم . وكذا قال علي بن أبي طلحة عن ابن عباس .\nوكذا قال الضحاك : اقض بيننا وبينهم ، وافتح بيننا وبينهم ، وقال غيره : افرق : افصل بيننا وبينهم ، كما قال الشاعر :\nيا رب فافرق بينه وبيني أشد ما فرقت بين اثنين\n                                    ",
        "qortoby": "قَالَ رَبِّ إِنِّي لَآ أَمۡلِكُ إِلَّا نَفۡسِي وَأَخِيۖ فَٱفۡرُقۡ بَيۡنَنَا وَبَيۡنَ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ ٥٢\n                                    \n                                    \n                                    قوله تعالى : قال رب إني لا أملك إلا نفسي وأخي لأنه كان يطيعه ، وقيل المعنى : إني لا أملك إلا نفسي ، ثم ابتدأ فقال : وأخي . أي : وأخي أيضا لا يملك إلا نفسه ; فأخي على القول الأول في موضع نصب عطفا على نفسي ، وعلى الثاني في موضع رفع ، وإن شئت عطفت على اسم إن وهي الياء ; أي : إني وأخي لا نملك إلا أنفسنا ، وإن شئت عطفت على المضمر في أملك كأنه قال : لا أملك أنا وأخي إلا أنفسنا . فافرق بيننا وبين القوم الفاسقين يقال : بأي وجه سأله الفرق بينه وبين هؤلاء القوم ؟ ففيه أجوبة ; الأول : بما يدل على بعدهم عن الحق ، وذهابهم عن الصواب فيما ارتكبوا من العصيان ; ولذلك ألقوا في التيه . الثاني : بطلب التمييز أي : ميزنا عن جماعتهم وجملتهم ولا تلحقنا بهم في العقاب ، وقيل المعنى : فاقض بيننا وبينهم بعصمتك إيانا من العصيان الذي ابتليتهم به ; ومنه قوله تعالى : فيها يفرق كل أمر حكيم أي : يقضى . وقد فعل لما أماتهم في التيه ، وقيل : إنما أراد في الآخرة ، أي اجعلنا في الجنة ولا تجعلنا معهم في النار ; والشاهد على الفرق الذي يدل على المباعدة في الأحوال قول الشاعر :\nيا رب فافرق بينه وبيني أشد ما فرقت بين اثنين\nوروى ابن عيينة عن عمرو بن دينار عن عبيد بن عمير أنه قرأ : \" فافرق \" بكسر الراء .\n                                    ",
        "saadi": "قَالَ رَبِّ إِنِّي لَآ أَمۡلِكُ إِلَّا نَفۡسِي وَأَخِيۖ فَٱفۡرُقۡ بَيۡنَنَا وَبَيۡنَ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ ٥٢\n                                        \n                                        \n                                        \n                                        فلما رأى موسى عليه السلام عتوهم عليه { قَالَ رَبِّ إِنِّي لَا أَمْلِكُ إِلَّا نَفْسِي وَأَخِي } أي: فلا يدان لنا بقتالهم، ولست بجبار على هؤلاء. { فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفَاسِقِينَ } أي: احكم بيننا وبينهم، بأن تنزل فيهم من العقوبة ما اقتضته حكمتك، ودل ذلك على أن قولهم وفعلهم من الكبائر العظيمة الموجبة للفسق.\n                                    "
      },
      "originalText": "قَالَ رَبِّ إِنِّي لَآ أَمۡلِكُ إِلَّا نَفۡسِي وَأَخِيۖ فَٱفۡرُقۡ بَيۡنَنَا وَبَيۡنَ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ ٥٢"
    },
    {
      "number": 695,
      "text": "قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيْهِمْ ۛ أَرْبَعِينَ سَنَةً ۛ يَتِيهُونَ فِي الْأَرْضِ ۚ فَلَا تَأْسَ عَلَى الْقَوْمِ الْفَاسِقِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 26,
      "juz": 6,
      "manzil": 2,
      "page": 112,
      "ruku": 89,
      "hizbQuarter": 44,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيۡهِمۡۛ أَرۡبَعِينَ سَنَةٗۛ يَتِيهُونَ فِي ٱلۡأَرۡضِۚ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ ٦٢\n                                    \n                                    \n                                    وقوله تعالى : ( [ قال ] فإنها محرمة عليهم أربعين سنة يتيهون في الأرض [ فلا تأس على القوم الفاسقين ] ) لما دعا عليهم موسى عليه السلام ، حين نكلوا عن الجهاد حكم الله عليهم بتحريم دخولها قدرا مدة أربعين سنة ، فوقعوا في التيه يسيرون دائما لا يهتدون للخروج منه ، وفيه كانت أمور عجيبة ، وخوارق كثيرة ، من تظليلهم بالغمام وإنزال المن والسلوى عليهم ، ومن إخراج الماء الجاري من صخرة صماء تحمل معهم على دابة ، فإذا ضربها موسى بعصاه انفجرت من ذلك الحجر اثنتا عشرة عينا تجري لكل شعب عين ، وغير ذلك من المعجزات التي أيد الله بها موسى بن عمران . وهناك أنزلت التوراة ، وشرعت لهم الأحكام ، وعملت قبة العهد ، ويقال لها : قبة الزمان .\nقال يزيد بن هارون عن أصبغ بن زيد عن القاسم بن أبي أيوب عن سعيد بن جبير : سألت ابن عباس عن قوله : ( فإنها محرمة عليهم أربعين سنة يتيهون في الأرض ) الآية . قال : فتاهوا في الأرض أربعين سنة ، يصبحون كل يوم يسيرون ليس لهم قرار ، ثم ظلل عليهم الغمام في التيه وأنزل عليهم المن والسلوى وهذا قطعة من حديث \" الفتون \" ، ثم كانت وفاة هارون ، عليه السلام ، ثم بعده بمدة ثلاثة سنين مات موسى الكليم ، عليه السلام ، وأقام الله فيهم \" يوشع بن نون \" عليه السلام ، نبيا خليفة عن موسى بن عمران ، ومات أكثر بني إسرائيل هناك في تلك المدة ، ويقال : إنه لم يبق منهم أحد سوى \" يوشع \" و \" كالب \" ، ومن هاهنا قال بعض المفسرين في قوله : ( قال فإنها محرمة عليهم ) هذا وقف تام ، وقوله : ( أربعين سنة ) منصوب بقوله : ( يتيهون في الأرض ) فلما انقضت المدة خرج بهم \" يوشع بن نون \" عليه السلام ، أو بمن بقي منهم وبسائر بني إسرائيل من الجيل الثاني ، فقصد بهم بيت المقدس فحاصرها ، فكان فتحها يوم الجمعة بعد العصر ، فلما تضيفت الشمس للغروب ، وخشي دخول السبت عليهم قال \" إنك مأمورة وأنا مأمور ، اللهم احبسها علي \" ، فحبسها الله تعالى حتى فتحها ، وأمر الله \" يوشع بن نون \" أن يأمر بني إسرائيل حين يدخلون بيت المقدس أن يدخلوا بابها سجدا ، وهم يقولون : حطة ، أي : حط عنا ذنوبنا ، فبدلوا ما أمروا به ، فدخلوا يزحفون على أستاههم ، وهم يقولون : حبة في شعرة ، وقد تقدم هذا كله في سورة البقرة .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا محمد بن أبي عمر العدني حدثنا سفيان عن أبي سعيد عن عكرمة عن ابن عباس قوله : ( فإنها محرمة عليهم أربعين سنة يتيهون في الأرض ) قال : فتاهوا أربعين سنة ، فهلك موسى وهارون في التيه وكل من جاوز الأربعين سنة ، فلما مضت الأربعون سنة ناهضهم \" يوشع بن نون \" ، وهو الذي قام بالأمر بعد موسى وهو الذي افتتحها ، وهو الذي قيل له : \" اليوم يوم الجمعة \" فهموا بافتتاحها ، ودنت الشمس للغروب ، فخشي إن دخلت ليلة السبت أن يسبتوا ، فنادى الشمس : \" إني مأمور وإنك مأمورة \" فوقفت حتى افتتحها ، فوجد فيها من الأموال ما لم ير مثله قط ، فقربوه إلى النار فلم تأت فقال : فيكم الغلول ، فدعا رءوس الأسباط وهم اثنا عشر رجلا فبايعهم ، والتصقت يد رجل منهم بيده ، فقال : الغلول عندك ، فأخرجه فأخرج رأس بقرة من ذهب ، لها عينان من ياقوت ، وأسنان من لؤلؤ ، فوضعه مع القربان ، فأتت النار فأكلتها .\nوهذا السياق له شاهد في الصحيح . وقد اختار ابن جرير أن قوله : ( فإنها محرمة عليهم ) هو العامل في \" أربعين سنة \" ، وأنهم مكثوا لا يدخلونها أربعين سنة ، وهم تائهون في البرية لا يهتدون لمقصد . قال : ثم خرجوا مع موسى عليه السلام ، ففتح بهم بيت المقدس . ثم احتج على ذلك قال : بإجماع علماء أخبار الأولين أن عوج بن عنق \" قتله موسى عليه السلام ، قال : فلو كان قتله إياه قبل التيه لما رهبت بنو إسرائيل من العماليق فدل على أنه كان بعد التيه . قال : وأجمعوا على أن \" بلعام بن باعورا \" أعان الجبارين بالدعاء على موسى قال : وما ذاك إلا بعد التيه لأنهم كانوا قبل التيه لا يخافون من موسى وقومه ، هذا استدلاله ، ثم قال :\nحدثنا أبو كريب حدثنا ابن عطية حدثنا قيس عن أبي إسحاق عن سعيد بن جبير عن ابن عباس قال : كانت عصا موسى عشرة أذرع ، ووثبته عشرة أذرع ، وطوله عشرة أذرع ، فوثب فأصاب كعب \" عوج \" فقتله ، فكان جسرا لأهل النيل سنة .\nوروي أيضا عن محمد بن بشار حدثنا مؤمل حدثنا سفيان عن أبي إسحاق عن نوف البكالي قال : كان سرير \" عوج \" ثمانمائة ذراع ، وكان طول موسى عشرة أذرع ، وعصاه عشرة أذرع ، ووثب في السماء عشرة أذرع ، فضرب \" عوجا \" فأصاب كعبه ، فسقط ميتا ، وكان جسرا للناس يمرون عليه .\nوقوله تعالى : ( فلا تأس على القوم الفاسقين ) تسلية لموسى عليه السلام ، عنهم ، أي : لا تتأسف ولا تحزن عليهم فمهما حكمت عليهم به فإنهم يستحقون ذلك .\nوهذه القصة تضمنت تقريع اليهود وبيان فضائحهم ، ومخالفتهم لله ولرسوله ونكولهم عن طاعتهما ، فيما أمرهم به من الجهاد ، فضعفت أنفسهم عن مصابرة الأعداء ومجالدتهم ، ومقاتلتهم ، مع أن بين أظهرهم رسول الله صلى الله عليه وسلم وكليمه وصفيه من خلقه في ذلك الزمان ، وهو يعدهم بالنصر والظفر بأعدائهم ، هذا وقد شاهدوا ما أحل الله بعدوهم فرعون من العذاب والنكال والغرق له ولجنوده في اليم ، وهم ينظرون لتقر به أعينهم وما بالعهد من قدم ، ثم ينكلون عن مقاتلة أهل بلد هي بالنسبة إلى ديار مصر لا توازي عشر المعشار في عدة أهلها وعددهم ، فظهرت قبائح صنيعهم للخاص والعام ، وافتضحوا فضيحة لا يغطيها الليل ، ولا يسترها الذيل ، هذا وهم في جهلهم يعمهون ، وفي غيهم يترددون ، وهم البغضاء إلى الله وأعداؤه ، ويقولون مع ذلك : ( نحن أبناء الله وأحباؤه ) [ المائدة : 18 ] فقبح الله وجوههم التي مسخ منها الخنازير والقرود ، وألزمهم لعنة تصحبهم إلى النار ذات الوقود ، ويقضي لهم فيها بتأبيد الخلود ، وقد فعل وله الحمد من جميع الوجود .\n                                    ",
        "qortoby": "قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيۡهِمۡۛ أَرۡبَعِينَ سَنَةٗۛ يَتِيهُونَ فِي ٱلۡأَرۡضِۚ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ ٦٢\n                                    \n                                    \n                                    قوله تعالى : قال فإنها محرمة عليهم أربعين سنة يتيهون في الأرض استجاب الله دعاءه وعاقبهم في التيه أربعين سنة ، وأصل التيه في اللغة الحيرة ; يقال منه : تاه يتيه تيها وتوها إذا تحير . وتيهته وتوهته بالياء والواو ، والياء أكثر ، والأرض التيهاء التي لا يهتدى فيها ; وأرض تيه وتيهاء ومنها قال : ( هو العجاج )\nتيه أتاويه على السقاط\nوقال آخر :\nبتيهاء قفر والمطي كأنها قطا الحزن قد كانت فراخا بيوضها\nفكانوا يسيرون في فراسخ قليلة - قيل : في قدر ستة فراسخ - يومهم وليلتهم فيصبحون حيث أمسوا ويمسون حيث أصبحوا ; فكانوا سيارة لا قرار لهم . واختلف هل كان معهم موسى وهارون ؟ فقيل : لا ; لأن التيه عقوبة ، وكانت سنو التيه بعدد أيام العجل ، فقوبلوا على كل يوم سنة ; وقد قال : فافرق بيننا وبين القوم الفاسقين ، وقيل : كانا معهم لكن سهل الله الأمر عليهما كما جعل النار بردا وسلاما على إبراهيم ، ومعنى ( محرمة ) أي : أنهم ممنوعون من دخولها ; كما يقال : حرم الله وجهك على النار ، وحرمت عليك دخول الدار ; فهو تحريم منع لا تحريم شرع ، عن أكثر أهل التفسير ; قال الشاعر :\nجالت لتصرعني فقلت لها اقصري إني امرؤ صرعي عليك حرام\nأي : أنا فارس فلا يمكنك صرعي ، وقال أبو علي : يجوز أن يكون تحريم تعبد ، ويقال : كيف يجوز على جماعة كثيرة من العقلاء أن يسيروا في فراسخ يسيرة فلا يهتدوا للخروج منها ؟ فالجواب : قال أبو علي : قد يكون ذلك بأن يحول الله الأرض التي هي عليها إذا ناموا فيردهم إلى المكان الذي ابتدءوا منه ، وقد يكون بغير ذلك من الاشتباه والأسباب المانعة من الخروج عنها على طريق المعجزة الخارجة عن العادة . أربعين ظرف زمان للتيه ; في قول الحسن وقتادة ; قالا : ولم يدخلها أحد منهم ; فالوقف على هذا على عليهم ، وقال الربيع بن أنس وغيره : إن أربعين سنة ظرف للتحريم ، فالوقف على هذا على أربعين سنة ; فعلى الأول إنما دخلها أولادهم ; قاله ابن عباس . ولم يبق منهم إلا يوشع وكالب ، فخرج منهم يوشع بذرياتهم إلى تلك المدينة وفتحوها ، وعلى الثاني : فمن بقي منهم بعد أربعين سنة دخلوها . وروي عن ابن عباس أن موسى وهارون ماتا في التيه . قال غيره : ونبأ الله يوشع وأمره بقتال الجبارين ، وفيها حبست عليه الشمس حتى دخل المدينة ، وفيها أحرق الذي وجد الغلول عنده ، وكانت تنزل من السماء - إذا غنموا - نار بيضاء فتأكل الغنائم ; وكان ذلك دليلا على قبولها ، فإن كان فيها غلول لم تأكله ، وجاءت السباع والوحوش فأكلته ; فنزلت النار فلم تأكل ما غنموا فقال : إن فيكم الغلول فلتبايعني كل قبيلة فبايعته ، فلصقت يد رجل منهم بيده فقال : فيكم الغلول فليبايعني كل رجل منكم فبايعوه رجلا رجلا حتى لصقت يد رجل منهم بيده فقال : عندك الغلول فأخرج مثل رأس البقرة من ذهب ، فنزلت النار فأكلت الغنائم ، وكانت نارا بيضاء مثل الفضة لها حفيف أي : صوت مثل صوت الشجر وجناح الطائر فيما يذكرون ; فذكروا أنه أحرق الغال ومتاعه بغور يقال له الآن عاجز ، عرف باسم الغال ; وكان اسمه عاجزا .\nقلت : ويستفاد من هذا عقوبة الغال قبلنا ، وقد تقدم حكمه في ملتنا ، وبيان ما انبهم من اسم النبي والغال في الحديث الصحيح عن أبي هريرة عن رسول الله صلى الله عليه وسلم قال : غزا نبي من الأنبياء الحديث أخرجه مسلم وفيه قال : فغزا فأدنى للقرية حين صلاة العصر أو قريبا من ذلك فقال للشمس أنت مأمورة وأنا مأمور اللهم احبسها علي شيئا فحبست عليه حتى فتح الله عليه - قال : فجمعوا ما غنموا فأقبلت النار لتأكله فأبت أن تطعمه فقال : فيكم غلول فليبايعني من كل قبيلة رجل فبايعوه - قال - فلصقت يده بيد رجلين أو ثلاثة فقال فيكم الغلول وذكر نحو ما تقدم . قال علماؤنا : والحكمة في حبس الشمس على يوشع عند قتاله أهل أريحاء وإشرافه على فتحها عشي يوم الجمعة ، وإشفاقه من أن تغرب الشمس قبل الفتح أنه لو لم تحبس عليه حرم عليه القتال لأجل السبت ، ويعلم به عدوهم فيعمل فيهم السيف ويجتاحهم ; فكان ذلك آية له خص بها بعد أن كانت نبوته ثابتة بخبر موسى عليه الصلاة والسلام ، على ما يقال ، والله أعلم ، وفي هذا الحديث يقول عليه السلام : فلم تحل الغنائم لأحد من قبلنا ذلك بأن الله عز وجل رأى ضعفنا وعجزنا فطيبها لنا ، وهذا يرد قول من قال في تأويل قوله تعالى : وآتاكم ما لم يؤت أحدا من العالمين إنه تحليل الغنائم والانتفاع بها ، وممن قال إن موسى عليه الصلاة والسلام مات بالتيه عمرو بن ميمون الأودي ، وزاد : وهارون ; وكانا خرجا في التيه إلى بعض الكهوف فمات هارون فدفنه موسى وانصرف إلى بني إسرائيل ; فقالوا : ما فعل هارون ؟ فقال : مات ; قالوا : كذبت ولكنك قتلته لحبنا له ، وكان محبا في بني إسرائيل ; فأوحى الله تعالى إليه أن انطلق بهم إلى قبره فإني باعثه حتى يخبرهم أنه مات موتا ولم تقتله ; فانطلق بهم إلى قبره فنادى يا هارون فخرج من قبره ينفض رأسه فقال : أنا قاتلك ؟ قال : لا ; ولكني مت ; قال : فعد إلى مضجعك ; وانصرف ، وقال الحسن : إن موسى لم يمت بالتيه ، وقال غيره : إن موسى فتح أريحاء ، وكان يوشع على مقدمته فقاتل الجبابرة الذين كانوا بها ، ثم دخلها موسى ببني إسرائيل فأقام فيها ما شاء الله أن يقيم ، ثم قبضه الله تعالى إليه لا يعلم بقبره أحد من الخلائق . قال الثعلبي : وهو أصح الأقاويل .\nقلت : قد روى مسلم عن أبي هريرة قال : أرسل ملك الموت إلى موسى عليه الصلاة والسلام فلما جاءه صكه ففقأ عينه فرجع إلى ربه فقال : \" أرسلتني إلى عبد لا يريد الموت \" قال : فرد الله إليه عينه وقال : \" ارجع إليه فقل له يضع يده على متن ثور فله بما غطت يده بكل شعرة سنة \" قال : \" أي : رب ثم مه \" ، قال : \" ثم الموت \" قال : \" فالآن \" ; فسأل الله أن يدنيه من الأرض المقدسة رمية بحجر ; فقال رسول الله صلى الله عليه وسلم : فلو كنت ثم لأريتكم قبره إلى جانب الطريق تحت الكثيب الأحمر فهذا نبينا صلى الله عليه وسلم قد علم قبره ووصف موضعه ، ورآه فيه قائما يصلي كما في حديث الإسراء ، إلا أنه يحتمل أن يكون أخفاه الله عن الخلق سواه ولم يجعله مشهورا عندهم ; ولعل ذلك لئلا يعبد ، والله أعلم ، ويعني بالطريق طريق بيت المقدس ، ووقع في بعض الروايات إلى جانب الطور مكان الطريق ، واختلف العلماء في تأويل لطم موسى عين ملك الموت وفقئها على أقوال ; منها : أنها كانت عينا متخيلة لا حقيقة ، وهذا باطل ، لأنه يؤدي إلى أن ما يراه الأنبياء من صور الملائكة لا حقيقة له .\nومنها : أنها كانت عينا معنوية وإنما فقأها بالحجة ، وهذا مجاز لا حقيقة ، ومنها : أنه عليه السلام لم يعرف ملك الموت ، وأنه رأى رجلا دخل منزله بغير إذنه يريد نفسه فدافع عن نفسه فلطم عينه ففقأها ; وتجب المدافعة في هذا بكل ممكن ، وهذا وجه حسن ; لأنه حقيقة في العين والصك ; قاله الإمام أبو بكر بن خزيمة ، غير أنه اعترض عليه بما في الحديث ; وهو أن ملك الموت لما رجع إلى الله تعالى قال : \" يا رب أرسلتني إلى عبد لا يريد الموت \" فلو لم يعرفه موسى لما صدق القول من ملك الموت ; وأيضا قوله في الرواية الأخرى : \" أجب ربك \" يدل على تعريفه بنفسه ، والله أعلم .\nومنها : أن موسى عليه الصلاة والسلام كان سريع الغضب ، إذا غضب طلع الدخان من قلنسوته ورفع شعر بدنه جبته ; وسرعة غضبه كانت سببا لصكه ملك الموت . قال ابن العربي : وهذا كما ترى ، فإن الأنبياء معصومون أن يقع منهم ابتداء مثل هذا في الرضا والغضب ، ومنها وهو الصحيح من هذه الأقوال : أن موسى عليه الصلاة والسلام عرف ملك الموت ، وأنه جاء ليقبض روحه لكنه جاء مجيء الجزم بأنه قد أمر بقبض روحه من غير تخيير ، وعند موسى ما قد نص عليه نبينا محمد صلى الله عليه وسلم من أن الله لا يقبض روح نبي حتى يخيره فلما جاءه على غير الوجه الذي أعلم بادر بشهامته وقوة نفسه إلى أدبه ، فلطمه ففقأ عينه امتحانا لملك الموت ; إذ لم يصرح له بالتخيير ، ومما يدل على صحة هذا ، أنه لما رجع إليه ملك الموت فخيره بين الحياة والموت اختار الموت واستسلم ، والله بغيبه أحكم وأعلم . هذا أصح ما قيل في وفاة موسى عليه السلام ، وقد ذكر المفسرون في ذلك قصصا وأخبارا الله أعلم بصحتها ; وفي الصحيح غنية عنها . وكان عمر موسى مائة وعشرين سنة ; فيروى أن يوشع رآه بعد موته في المنام فقال له : كيف وجدت الموت ؟ فقال : \" كشاة تسلخ وهي حية \" ، وهذا صحيح معنى ; قال : صلى الله عليه وسلم في الحديث الصحيح : إن للموت سكرات على ما بيناه في كتاب \" التذكرة \" ، وقوله : فلا تأس على القوم الفاسقين أي : لا تحزن ، والأسى الحزن ; أسى يأسى أسى أي : حزن ، قال :\nيقولون لا تهلك أسى وتجمل\n                                    ",
        "saadi": "قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيۡهِمۡۛ أَرۡبَعِينَ سَنَةٗۛ يَتِيهُونَ فِي ٱلۡأَرۡضِۚ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ ٦٢\n                                        \n                                        \n                                        \n                                        { قَالَ } الله مجيبا لدعوة موسى: { فَإِنَّهَا مُحَرَّمَةٌ عَلَيْهِمْ أَرْبَعِينَ سَنَةً يَتِيهُونَ فِي الْأَرْضِ } أي: إن من عقوبتهم أن نحرم عليهم دخول هذه القرية التي كتبها الله لهم، مدة أربعين سنة، وتلك المدة أيضا يتيهون في الأرض، لا يهتدون إلى طريق ولا يبقون مطمئنين، وهذه عقوبة دنيوية، لعل الله تعالى كفر بها عنهم، ودفع عنهم عقوبة أعظم منها، وفي هذا دليل على أن العقوبة على الذنب قد تكون بزوال نعمة موجودة، أو دفع نقمة قد انعقد سبب وجودها أو تأخرها إلى وقت آخر. ولعل الحكمة في هذه المدة أن يموت أكثر هؤلاء الذين قالوا هذه المقالة، الصادرة عن قلوب لا صبر فيها ولا ثبات، بل قد ألفت الاستعباد لعدوها، ولم تكن لها همم ترقيها إلى ما فيه ارتقاؤها وعلوها، ولتظهر ناشئة جديدة تتربى عقولهم على طلب قهر الأعداء، وعدم الاستعباد، والذل المانع من السعادة. ولما علم الله تعالى أن عبده موسى في غاية الرحمة على الخلق، خصوصا قومه، وأنه ربما رق لهم، واحتملته الشفقة على الحزن عليهم في هذه العقوبة، أو الدعاء لهم بزوالها، مع أن الله قد حتمها، قال: { فَلَا تَأْسَ عَلَى الْقَوْمِ الْفَاسِقِينَ } أي: لا تأسف عليهم ولا تحزن، فإنهم قد فسقوا، وفسقهم اقتضى وقوع ما نزل بهم لا ظلما منا.\n                                    "
      },
      "originalText": "قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيۡهِمۡۛ أَرۡبَعِينَ سَنَةٗۛ يَتِيهُونَ فِي ٱلۡأَرۡضِۚ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ ٦٢"
    },
    {
      "number": 696,
      "text": "۞ وَاتْلُ عَلَيْهِمْ نَبَأَ ابْنَيْ آدَمَ بِالْحَقِّ إِذْ قَرَّبَا قُرْبَانًا فَتُقُبِّلَ مِنْ أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ الْآخَرِ قَالَ لَأَقْتُلَنَّكَ ۖ قَالَ إِنَّمَا يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 27,
      "juz": 6,
      "manzil": 2,
      "page": 112,
      "ruku": 90,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ءَادَمَ بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ ٧٢\n                                    \n                                    \n                                    قول تعالى مبينا وخيم عاقبة البغي والحسد والظلم في خبر ابني آدم لصلبه - في قول الجمهور - وهما هابيل وقابيل كيف عدا أحدهما على الآخر ، فقتله بغيا عليه وحسدا له ، فيما وهبه الله من النعمة وتقبل القربان الذي أخلص فيه لله عز وجل ، ففاز المقتول بوضع الآثام والدخول إلى الجنة ، وخاب القاتل ورجع بالصفقة الخاسرة في الدنيا والآخرة ، فقال تعالى : ( واتل عليهم نبأ ابني آدم بالحق ) أي : واقصص على هؤلاء البغاة الحسدة ، إخوان الخنازير والقردة من اليهود وأمثالهم وأشباههم - خبر ابني آدم وهما هابيل وقابيل فيما ذكره غير واحد من السلف والخلف .\nوقوله : ( بالحق ) أي : على الجلية والأمر الذي لا لبس فيه ولا كذب ، ولا وهم ولا تبديل ، ولا زيادة ولا نقصان ، كما قال تعالى : ( إن هذا لهو القصص الحق ) [ آل عمران : 62 ] وقال تعالى : ( نحن نقص عليك نبأهم بالحق ) [ الكهف : 13 ] وقال تعالى : ( ذلك عيسى ابن مريم قول الحق الذي فيه يمترون ] ) [ مريم : 34 ]\nوكان من خبرهما فيما ذكره غير واحد من السلف والخلف ، أن الله تعالى قد شرع لآدم عليه السلام ، أن يزوج بناته من بنيه لضرورة الحال ، ولكن قالوا : كان يولد له في كل بطن ذكر وأنثى ، فكان يزوج أنثى هذا البطن لذكر البطن الآخر ، وكانت أخت هابيل دميمة ، وأخت قابيل وضيئة ، فأراد أن يستأثر بها على أخيه ، فأبى آدم ذلك إلا أن يقربا قربانا ، فمن تقبل منه فهي له ، فقربا فتقبل من هابيل ولم يتقبل من قابيل فكان من أمرهما ما قص الله في كتابه .\nذكر أقوال المفسرين هاهنا :\nقال السدي - فيما ذكر - عن أبي مالك وعن أبي صالح عن ابن عباس - وعن مرة عن ابن مسعود - وعن ناس من أصحاب النبي صلى الله عليه وسلم ; أنه كان لا يولد لآدم مولود إلا ولد معه جارية ، فكان يزوج غلام هذا البطن جارية هذا البطن الآخر ، ويزوج جارية هذا البطن غلام هذا البطن الآخر ، حتى ولد له ابنان يقال لهما : قابيل وهابيل وكان قابيل صاحب زرع ، وكان هابيل صاحب ضرع ، وكان قابيل أكبرهما ، وكان له أخت أحسن من أخت هابيل وإن هابيل طلب أن ينكح أخت قابيل فأبى عليه وقال : هي أختي ، ولدت معي ، وهي أحسن من أختك ، وأنا أحق أن أتزوج بها . فأمره أبوه أن يزوجها هابيل فأبى ، وأنهما قربا قربانا إلى الله عز وجل أيهما أحق بالجارية ، وكان آدم عليه السلام قد غاب عنهما ، أتى مكة ينظر إليها ، قال الله عز وجل : هل تعلم أن لي بيتا في الأرض ؟ قال : اللهم لا . قال : إن لي بيتا في مكة فأته . فقال آدم للسماء : احفظي ولدي بالأمانة ، فأبت . وقال للأرض ، فأبت . وقال للجبال ، فأبت . فقال لقابيل فقال : نعم ، تذهب وترجع وتجد أهلك كما يسرك . فلما انطلق آدم قربا قربانا ، وكان قابيل يفخر عليه ، فقال : أنا أحق بها منك ، هي أختي ، وأنا أكبر منك ، وأنا وصي والدي . فلما قربا ، قرب هابيل جذعة سمنة ، وقرب قابيل حزمة سنبل ، فوجد فيها سنبلة عظيمة ، ففركها فأكلها . فنزلت النار فأكلت قربان هابيل وتركت قربان قابيل فغضب وقال : لأقتلنك حتى لا تنكح أختي . فقال هابيل : إنما يتقبل الله من المتقين . رواه ابن جرير .\nوقال ابن أبي حاتم : حدثنا الحسن بن محمد بن الصباح حدثنا حجاج عن ابن جريج أخبرني ابن خثيم قال : أقبلت مع سعيد بن جبير فحدثني عن ابن عباس قال : نهي أن تنكح المرأة أخاها توأمها ، وأمر أن ينكحها غيره من إخوتها ، وكان يولد له في كل بطن رجل وامرأة ، فبينما هم كذلك ولد له امرأة وضيئة ، وولد له أخرى قبيحة دميمة ، فقال أخو الدميمة : أنكحني أختك وأنكحك أختي . قال : لا ، أنا أحق بأختي ، فقربا قربانا ، فتقبل من صاحب الكبش ، ولم يتقبل من صاحب الزرع ، فقتله . إسناد جيد .\nوحدثنا أبي ، حدثنا أبو سلمة حدثنا حماد بن سلمة عن عبد الله بن عثمان بن خثيم عن سعيد بن جبير عن ابن عباس قوله : ( إذ قربا قربانا ) فقربا قربانهما ، فجاء صاحب الغنم بكبش أعين أقرن أبيض ، وصاحب الحرث بصبرة من طعام ، فقبل الله الكبش فخزنه في الجنة أربعين خريفا ، وهو الكبش الذي ذبحه إبراهيم صلى الله عليه وسلم إسناد جيد .\nوقال ابن جرير : حدثنا ابن بشار حدثنا محمد بن جعفر حدثنا عوف عن أبي المغيرة عن عبد الله بن عمرو قال : إن ابني آدم اللذين قربا قربانا فتقبل من أحدهما ولم يتقبل من الآخر ، كان أحدهما صاحب حرث والآخر صاحب غنم ، وإنهما أمرا أن يقربا قربانا ، وإن صاحب الغنم قرب أكرم غنمه وأسمنها وأحسنها ، طيبة بها نفسه ، وإن صاحب الحرث قرب أشر حرثه الكودن والزوان غير طيبة بها نفسه ، وإن الله ، عز وجل ، تقبل قربان صاحب الغنم ، ولم يتقبل قربان صاحب الحرث ، وكان من قصتهما ما قص الله في كتابه ، قال : وايم الله ، إن كان المقتول لأشد الرجلين ، ولكن منعه التحرج أن يبسط [ يده ] إلى أخيه .\nوقال إسماعيل بن رافع المدني القاص : بلغني أن ابني آدم لما أمرا بالقربان ، كان أحدهما صاحب غنم ، وكان أنتج له حمل في غنمه ، فأحبه حتى كان يؤثره بالليل ، وكان يحمله على ظهره من حبه ، حتى لم يكن له مال أحب إليه منه . فلما أمر بالقربان قربه لله ، عز وجل ، فقبله الله منه ، فما زال يرتع في الجنة حتى فدى به ابن إبراهيم عليه السلام . رواه ابن جرير .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا الأنصاري حدثنا القاسم بن عبد الرحمن حدثنا محمد بن علي بن الحسين قال : قال آدم عليه السلام لهابيل وقابيل : إن ربي عهد إلي أنه كائن من ذريتي من يقرب القربان ، فقربا قربانا حتى تقر عيني إذا تقبل قربانكما ، فقربا . وكان هابيل صاحب غنم فقرب أكولة غنمه ، خير ماله ، وكان قابيل صاحب زرع ، فقرب مشاقة من زرعه ، فانطلق آدم معهما ، ومعهما قربانهما ، فصعدا الجبل فوضعا قربانهما ، ثم جلسوا ثلاثتهم : آدم وهما ، ينظران إلى القربان ، فبعث الله نارا حتى إذا كانت فوقهما دنا منها عنق ، فاحتمل قربان هابيل وترك قربان قابيل فانصرفوا . وعلم آدم أن قابيل مسخوط عليه ، فقال : ويلك يا قابيل رد عليك قربانك . فقال قابيل : أحببته فصليت على قربانه ودعوت له فتقبل قربانه ، ورد علي قرباني . وقال قابيل لهابيل : لأقتلنك فأستريح منك ، دعا لك أبوك فصلى على قربانك ، فتقبل منك . وكان يتواعده بالقتل ، إلى أن احتبس هابيل ذات عشية في غنمه ، فقال آدم : يا قابيل أين أخوك؟ [ قال ] قال : وبعثتني له راعيا؟ لا أدري . فقال [ له ] آدم : ويلك يا قابيل . انطلق فاطلب أخاك . فقال قابيل في نفسه : الليلة أقتله . وأخذ معه حديدة فاستقبله وهو منقلب ، فقال : يا هابيل تقبل قربانك ورد علي قرباني ، لأقتلنك . فقال هابيل : قربت أطيب مالي ، وقربت أنت أخبث مالك ، وإن الله لا يقبل إلا الطيب ، إنما يتقبل الله من المتقين ، فلما قالها غضب قابيل فرفع الحديدة وضربه بها ، فقال : ويلك يا قابيل أين أنت من الله؟ كيف يجزيك بعملك؟ فقتله فطرحه في جوبة من الأرض ، وحثى عليه شيئا من التراب .\nوقال محمد بن إسحاق عن بعض أهل العلم بالكتاب الأول : إن آدم أمر ابنه قينا أن ينكح أخته توأمة هابيل ، وأمر هابيل أن ينكح أخته توأمة قين ، فسلم لذلك هابيل ورضي ، وأبى ذلك قين وكره ، تكرما عن أخت هابيل ورغب بأخته عن هابيل وقال : نحن ولادة الجنة ، وهما من ولادة الأرض ، وأنا أحق بأختي - ويقول بعض أهل العلم بالكتاب الأول : كانت أخت قين من أحسن الناس ، فضن بها عن أخيه وأرادها لنفسه ، فالله أعلم أي ذلك كان - فقال له أبوه : يا بني ، إنها لا تحل لك ، فأبى قابيل أن يقبل ذلك من قول أبيه . فقال له أبوه : يا بني ، قرب قربانا ، ويقرب أخوك هابيل قربانا ، فأيكما تقبل قربانه فهو أحق بها ، وكان قين على بذر الأرض ، وكان هابيل على رعاية الماشية ، فقرب قين قمحا ، وقرب هابيل أبكارا من أبكار غنمه - وبعضهم يقول : قرب بقرة - فأرسل الله نارا بيضاء ، فأكلت قربان هابيل وتركت قربان قين ، وبذلك كان يقبل القربان إذا قبله . رواه ابن جرير .\nوقال العوفي عن ابن عباس قال : كان من شأنهما أنه لم يكن مسكين يتصدق عليه ، وإنما كان القربان يقربه الرجل . فبينا ابنا آدم قاعدان إذ قالا لو قربنا قربانا ، وكان الرجل إذا قرب قربانا فرضيه الله أرسل إليه نارا فتأكله وإن لم يكن رضيه الله خبت النار ، فقربا قربانا ، وكان أحدهما راعيا ، وكان الآخر حراثا ، وإن صاحب الغنم قرب خير غنمه وأسمنها ، وقرب الآخر بعض زرعه ، فجاءت النار فنزلت بينهما ، فأكلت الشاة وتركت الزرع ، وإن ابن آدم قال لأخيه : أتمشي في الناس وقد علموا أنك قربت قربانا فتقبل منك ورد علي ؟ فلا والله لا ينظر الناس إليك وإلي وأنت خير مني . فقال : لأقتلنك . فقال له أخوه : ما ذنبي؟ إنما يتقبل الله من المتقين . رواه ابن جرير .\nفهذا الأثر يقتضي أن تقريب القربان كان لا عن سبب ولا عن تدارئ في امرأة ، كما تقدم عن جماعة من تقدم ذكرهم ، وهو ظاهر القرآن : ( إذ قربا قربانا فتقبل من أحدهما ولم يتقبل من الآخر قال لأقتلنك قال إنما يتقبل الله من المتقين ) فالسياق يقتضي أنه إنما غضب عليه وحسده لقبول قربانه دونه .\nثم المشهور عند الجمهور أن الذي قرب الشاة هو هابيل وأن الذي قرب الطعام هو قابيل وأنه تقبل من هابيل شاته ، حتى قال ابن عباس وغيره : إنه الكبش الذي فدي به الذبيح ، وهو مناسب ، والله أعلم ، ولم يتقبل من قابيل . كذلك نص عليه غير واحد من السلف والخلف ، وهو المشهور عن مجاهد أيضا ، ولكن روى ابن جرير عنه أنه قال : الذي قرب الزرع قابيل وهو المتقبل منه ، وهذا خلاف المشهور ، ولعله لم يحفظ عنه جيدا ، والله أعلم .\nومعنى قوله : ( إنما يتقبل الله من المتقين ) أي : ممن اتقى الله في فعله ذلك .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا إبراهيم بن العلاء بن زبريق حدثنا إسماعيل بن عياش حدثني صفوان بن عمرو عن تميم يعني ابن مالك المقري قال : سمعت أبا الدرداء يقول : لأن أستيقن أن الله قد تقبل مني صلاة واحدة أحب إلي من الدنيا وما فيها ، إن الله يقول : ( إنما يتقبل الله من المتقين )\nوحدثنا أبي ، حدثنا عبد الله بن عمران حدثنا إسحاق بن سليمان - يعني الرازي - عن المغيرة بن مسلم عن ميمون بن أبي حمزة قال : كنت جالسا عند أبي وائل فدخل علينا رجل - يقال له : أبو عفيف من أصحاب معاذ - فقال له شقيق بن سلمة : يا أبا عفيف ألا تحدثنا عن معاذ بن جبل؟ قال : بلى ، سمعته يقول : يحبس الناس في بقيع واحد ، فينادي مناد : أين المتقون؟ فيقومون في كنف من الرحمن ، لا يحتجب الله منهم ولا يستتر . قلت : من المتقون؟ قال : قوم اتقوا الشرك وعبادة الأوثان ، وأخلصوا العبادة ، فيمرون إلى الجنة .\n                                    ",
        "qortoby": "وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ءَادَمَ بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ ٧٢\n                                    \n                                    \n                                    قوله تعالى : واتل عليهم نبأ ابني آدم بالحق إذ قربا قربانا فتقبل من أحدهما ولم يتقبل من الآخر قال لأقتلنك قال إنما يتقبل الله من المتقين\nفيه مسألتان :\nالأولى : قوله تعالى : واتل عليهم نبأ ابني آدم بالحق الآية . وجه اتصال هذه الآية بما قبلها التنبيه من الله تعالى على أن ظلم اليهود ، ونقضهم المواثيق والعهود كظلم ابن آدم لأخيه . المعنى : إن هم هؤلاء اليهود بالفتك بك يا محمد فقد قتلوا قبلك الأنبياء ، وقتل قابيل هابيل ، والشر قديم . أي : ذكرهم هذه القصة فهي قصة صدق ، لا كالأحاديث الموضوعة ; وفي ذلك تبكيت لمن خالف الإسلام ، وتسلية للنبي صلى الله عليه وسلم ، واختلف في ابني آدم ; فقال الحسن البصري : ليسا لصلبه ، كانا رجلين من بني إسرائيل - ضرب الله بهما المثل في إبانة حسد اليهود - وكان بينهما خصومة ، فتقربا بقربانين ولم تكن القرابين إلا في بني إسرائيل . قال ابن عطية : وهذا وهم ، وكيف يجهل صورة الدفن أحد من بني إسرائيل حتى يقتدي بالغراب ؟ والصحيح أنهما ابناه لصلبه ; هذا قول الجمهور من المفسرين وقاله ابن عباس وابن عمر وغيرهما ; وهما قابيل وهابيل ، وكان قربان قابيل حزمة من سنبل - لأنه كان صاحب زرع - واختارها من أردأ زرعه ، ثم إنه وجد فيها سنبلة طيبة ففركها وأكلها ، وكان قربان هابيل كبشا - لأنه كان صاحب غنم - أخذه من أجود غنمه . فتقبل فرفع إلى الجنة ، فلم يزل يرعى فيها إلى أن فدي به الذبيح عليه السلام ; قاله سعيد بن جبير وغيره . فلما تقبل قربان هابيل لأنه كان مؤمنا - قال له قابيل حسدا : - لأنه كان كافرا - أتمشي على الأرض يراك الناس أفضل مني ! لأقتلنك وقيل : سبب هذا القربان أن حواء عليها السلام كانت تلد في كل بطن ذكرا وأنثى - إلا شيثا عليه السلام فإنها ولدته منفردا عوضا من هابيل على ما يأتي ، واسمه هبة الله ; لأن جبريل عليه السلام قال لحواء لما ولدته : هذا هبة الله لك بدل هابيل ، وكان آدم يوم ولد شيث ابن ثلاثين ومائة سنة - وكان يزوج الذكر من هذا البطن الأنثى من البطن الآخر ، ولا تحل له أخته توأمته ; فولدت مع قابيل أختا جميلة واسمها إقليمياء ، ومع هابيل أختا ليست كذلك واسمها ليوذا ; فلما أراد آدم تزويجهما قال قابيل : أنا أحق بأختي ، فأمره آدم فلم يأتمر ، وزجره فلم ينزجر ; فاتفقوا على التقريب ; قاله جماعة من المفسرين منهم ابن مسعود . وروي أن آدم حضر ذلك ، والله أعلم . وقد روي في هذا الباب عن جعفر الصادق : أن آدم لم يكن يزوج ابنته من ابنه ; ولو فعل ذلك آدم لما رغب عنه النبي صلى الله عليه وسلم ، ولا كان دين آدم إلا دين النبي صلى الله عليه وسلم ، وأن الله تعالى لما أهبط آدم وحواء إلى الأرض وجمع بينهما ولدت حواء بنتا فسماها عناقا فبغت ، وهي أول من بغى على وجه الأرض ; فسلط الله عليها من قتلها ، ثم ولدت لآدم قابيل ، ثم ولدت له هابيل ; فلما أدرك قابيل أظهر الله له جنية من ولد الجن ، يقال لها : جمالة في صورة إنسية ; وأوحى الله إلى آدم أن زوجها من قابيل فزوجها منه . فلما أدرك هابيل أهبط الله إلى آدم حورية في صفة إنسية وخلق لها رحما ، وكان اسمها بزلة ، فلما نظر إليها هابيل أحبها ; فأوحى الله إلى آدم أن زوج بزلة من هابيل ففعل . فقال قابيل : يا أبت ألست أكبر من أخي ؟ قال : نعم . قال : فكنت أحق بما فعلت به منه ! فقال له آدم : يا بني إن الله قد أمرني بذلك ، وإن الفضل بيد الله يؤتيه من يشاء ، فقال : لا والله ، ولكنك آثرته علي . فقال آدم : \" فقربا قربانا فأيكما يقبل قربانه فهو أحق بالفضل \" .\nقلت : هذه القصة عن جعفر ما أظنها تصح ، وأن القول ما ذكرناه من أنه كان يزوج غلام هذا البطن لجارية تلك البطن ، والدليل على هذا من الكتاب قوله تعالى : يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء ، وهذا كالنص ثم نسخ ذلك ، حسبما تقدم بيانه في سورة \" البقرة \" . وكان جميع ما ولدته حواء أربعين من ذكر وأنثى في عشرين بطنا ; أولهم قابيل وتوأمته إقليمياء ، وآخرهم عبد المغيث . ثم بارك الله في نسل آدم . قال ابن عباس : لم يمت آدم حتى بلغ ولده وولد ولده أربعين ألفا ، وما روي عن جعفر - من قوله : فولدت بنتا وأنها بغت - فيقال : مع من بغت ؟ أمع جني تسول لها ! ومثل هذا يحتاج إلى نقل صحيح يقطع العذر ، وذلك معدوم ، والله أعلم .\nالثانية : وفي قول هابيل قال إنما يتقبل الله من المتقين كلام قبله محذوف ; لأنه لما قال له قابيل : لأقتلنك قال له : ولم تقتلني وأنا لم أجن شيئا ؟ ، ولا ذنب لي في قبول الله قرباني ، أما إني اتقيته وكنت على لاحب الحق وإنما يتقبل الله من المتقين . قال ابن عطية : المراد بالتقوى هنا اتقاء الشرك بإجماع أهل السنة ; فمن اتقاه وهو موحد فأعماله التي تصدق فيها نيته مقبولة ; وأما المتقي الشرك والمعاصي فله الدرجة العليا من القبول والختم بالرحمة ; علم ذلك بإخبار الله تعالى لا أن ذلك يجب على الله تعالى عقلا ، وقال عدي بن ثابت وغيره : قربان متقي هذه الأمة الصلاة .\nقلت : وهذا خاص في نوع من العبادات ، وقد روى البخاري عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم : إن الله تبارك وتعالى قال من عادى لي وليا فقد آذنته بالحرب وما تقرب إلي عبدي بشيء أحب إلي مما افترضت عليه وما يزال عبدي يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت سمعه الذي يسمع به وبصره الذي يبصر به ويده التي يبطش بها ورجله التي يمشي بها ولئن سألني لأعطينه ولئن استعاذني لأعيذنه وما ترددت عن شيء أنا فاعله ترددي عن نفس المؤمن يكره الموت وأنا أكره مساءته .\n                                    ",
        "saadi": "وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ءَادَمَ بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ ٧٢\n                                        \n                                        \n                                        \n                                        أي قص على الناس وأخبرهم بالقضية التي جرت على ابني آدم بالحق، تلاوة يعتبر بها المعتبرون، صدقا لا كذبا، وجدا لا لعبا، والظاهر أن ابني آدم هما ابناه لصلبه، كما يدل عليه ظاهر الآية والسياق، وهو قول جمهور المفسرين. أي: اتل عليهم نبأهما في حال تقريبهما للقربان، الذي أداهما إلى الحال المذكورة. { إِذْ قَرَّبَا قُرْبَانًا } أي: أخرج كل منهما شيئا من ماله لقصد التقرب إلى الله، { فَتُقُبِّلَ مِنْ أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ الْآخَرِ } بأن علم ذلك بخبر من السماء، أو بالعادة السابقة في الأمم، أن علامة تقبل الله لقربان، أن تنزل نار من السماء فتحرقه. { قَالَ } الابن، الذي لم يتقبل منه للآخر حسدا وبغيا { لَأَقْتُلَنَّكَ } فقال له الآخر -مترفقا له في ذلك- { إِنَّمَا يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ } فأي ذنب لي وجناية توجب لك أن تقتلني؟ إلا أني اتقيت الله تعالى، الذي تقواه واجبة عليّ وعليك، وعلى كل أحد، وأصح الأقوال في تفسير المتقين هنا، أي: المتقين لله في ذلك العمل، بأن يكون عملهم خالصا لوجه الله، متبعين فيه لسنة رسول الله صلى الله عليه وسلم. ثم قال له مخبرا أنه لا يريد أن يتعرض لقتله، لا ابتداء ولا مدافعة فقال:\n                                    "
      },
      "originalText": "۞ وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ءَادَمَ بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ ٧٢"
    },
    {
      "number": 697,
      "text": "لَئِنْ بَسَطْتَ إِلَيَّ يَدَكَ لِتَقْتُلَنِي مَا أَنَا بِبَاسِطٍ يَدِيَ إِلَيْكَ لِأَقْتُلَكَ ۖ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 28,
      "juz": 6,
      "manzil": 2,
      "page": 112,
      "ruku": 90,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَئِنۢ بَسَطتَ إِلَيَّ يَدَكَ لِتَقۡتُلَنِي مَآ أَنَا۠ بِبَاسِطٖ يَدِيَ إِلَيۡكَ لِأَقۡتُلَكَۖ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ ٨٢\n                                    \n                                    \n                                    وقوله : ( لئن بسطت إلي يدك لتقتلني ما أنا بباسط يدي إليك لأقتلك إني أخاف الله رب العالمين ) يقول له أخوه الرجل الصالح ، الذي تقبل الله قربانه لتقواه حين تواعده أخوه بالقتل على غير ما ذنب منه إليه : ( لئن بسطت إلي يدك لتقتلني ما أنا بباسط يدي إليك لأقتلك ) أي : لا أقابلك على صنيعك الفاسد بمثله ، فأكون أنا وأنت سواء في الخطيئة ، ( إني أخاف الله رب العالمين ) أي : من أن أصنع كما تريد أن تصنع ، بل أصبر وأحتسب .\nقال عبد الله بن عمرو : وايم الله ، إن كان لأشد الرجلين ولكن منعه التحرج ، يعني الورع .\nولهذا ثبت في الصحيحين ، عن النبي صلى الله عليه وسلم أنه قال : \" إذا تواجه المسلمان بسيفيهما ، فالقاتل والمقتول في النار \" . قالوا : يا رسول الله ، هذا القاتل فما بال المقتول؟ قال : \" إنه كان حريصا على قتل صاحبه \" .\nوقال الإمام أحمد : حدثنا قتيبة بن سعيد حدثنا ليث بن سعد عن عياش بن عباس عن بكير بن عبد الله عن بسر بن سعيد ; أن سعد بن أبي وقاص قال عند فتنة عثمان : أشهد أن رسول الله صلى الله عليه وسلم قال : \" إنها ستكون فتنة ، القاعد فيها خير من القائم ، والقائم خير من الماشي ، والماشي خير من الساعي \" . قال : أفرأيت إن دخل علي بيتي فبسط يده إلي ليقتلني قال : \" كن كابن آدم \" .\nوكذا رواه الترمذي عن قتيبة بن سعيد وقال : هذا الحديث حسن ، وفي الباب عن أبي هريرة وخباب بن الأرت وأبي بكرة وابن مسعود وأبي واقد وأبي موسى وخرشة . ورواه بعضهم عن الليث بن سعد وزاد في الإسناد رجلا .\nقال الحافظ ابن عساكر : الرجل هو حسين الأشجعي .\nقلت : وقد رواه أبو داود من طريقه فقال : حدثنا يزيد بن خالد الرملي حدثنا المفضل عن عياش بن عباس عن بكير عن بسر بن سعيد عن حسين بن عبد الرحمن الأشجعي ; أنه سمع سعد بن أبي وقاص عن النبي صلى الله عليه وسلم في هذا الحديث قال : فقلت : يا رسول الله ، أرأيت إن دخل علي بيتي وبسط يده ليقتلني؟ قال : فقال رسول الله صلى الله عليه وسلم : \" كن كابن آدم \" وتلا يزيد : ( لئن بسطت إلي يدك لتقتلني ما أنا بباسط يدي إليك لأقتلك إني أخاف الله رب العالمين )\nقال أيوب السختياني : إن أول من أخذ بهذه الآية من هذه الأمة : ( لئن بسطت إلي يدك لتقتلني ما أنا بباسط يدي إليك لأقتلك إني أخاف الله رب العالمين ) لعثمان بن عفان رضي الله عنه . رواه ابن أبي حاتم .\nوقال الإمام أحمد : حدثنا مرحوم حدثني أبو عمران الجوني عن عبد الله بن الصامت عن أبي ذر قال : ركب النبي صلى الله عليه وسلم حمارا وأردفني خلفه ، وقال : \" يا أبا ذر أرأيت إن أصاب الناس جوع شديد لا تستطيع أن تقوم من فراشك إلى مسجدك ، كيف تصنع؟ \" . قال : قال الله ورسوله أعلم . قال : \" تعفف \" قال : \" يا أبا ذر أرأيت إن أصاب الناس موت شديد ، ويكون البيت فيه بالعبد ، يعني القبر ، كيف تصنع؟ \" قلت : الله ورسوله أعلم . قال : \" اصبر \" . قال : \" يا أبا ذر أرأيت إن قتل الناس بعضهم بعضا ، يعني حتى تغرق حجارة الزيت من الدماء ، كيف تصنع؟ \" . قال : الله ورسوله أعلم . قال : \" اقعد في بيتك وأغلق عليك بابك \" . قال : فإن لم أترك؟ قال : \" فأت من أنت منهم ، فكن فيهم قال : فآخذ سلاحي؟ قال : \" إذا تشاركهم فيما هم فيه ، ولكن إن خشيت أن يروعك شعاع السيف ، فألق طرف ردائك على وجهك حتى يبوء بإثمه وإثمك \" .\nرواه مسلم وأهل السنن سوى النسائي من طرق عن أبي عمران الجوني عن عبد الله بن الصامت به ورواه أبو داود وابن ماجه من طريق حماد بن زيد عن أبي عمران عن المشعث بن طريف عن عبد الله بن الصامت عن أبي ذر بنحوه .\nقال أبو داود : ولم يذكر المشعث في هذا الحديث غير حماد بن زيد .\nوقال ابن مردويه : حدثنا محمد بن علي بن دحيم حدثنا أحمد بن حازم حدثنا قبيصة بن عقبة حدثنا سفيان عن منصور عن ربعي قال : كنا في جنازة حذيفة فسمعت رجلا يقول : سمعت هذا يقول في ناس : مما سمعت من رسول الله صلى الله عليه وسلم : \" لئن اقتتلتم لأنظرن إلى أقصى بيت في داري ، فلألجنه ، فلئن دخل علي فلان لأقولن : ها بؤ بإثمي وإثمك ، فأكون كخير ابني آدم .\n                                    ",
        "qortoby": "لَئِنۢ بَسَطتَ إِلَيَّ يَدَكَ لِتَقۡتُلَنِي مَآ أَنَا۠ بِبَاسِطٖ يَدِيَ إِلَيۡكَ لِأَقۡتُلَكَۖ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ ٨٢\n                                    \n                                    \n                                    قوله تعالى : لئن بسطت إلي يدك لتقتلني ما أنا بباسط يدي إليك لأقتلك إني أخاف الله رب العالمين\nقوله تعالى : لئن بسطت إلي يدك الآية . أي : لئن قصدت قتلي فأنا لا أقصد قتلك ; فهذا استسلام منه . وفي الخبر : ( إذا كانت الفتنة فكن كخير ابني آدم ) ، وروى أبو داود عن سعد بن أبي وقاص قال قلت يا رسول الله : إن دخل علي بيتي وبسط يده إلي ليقتلني ؟ قال فقال رسول الله صلى الله عليه وسلم : كن كخير ابني آدم وتلا هذه الآية لئن بسطت إلي يدك لتقتلني . قال مجاهد : كان الفرض عليهم حينئذ ألا يستل أحد سيفا ، وألا يمتنع ممن يريد قتله . قال علماؤنا : وذلك مما يجوز ورود التعبد به ، إلا أن في شرعنا يجوز دفعه إجماعا ، وفي وجوب ذلك عليه خلاف ، والأصح وجوب ذلك ; لما فيه من النهي عن المنكر ، وفي الحشوية قوم لا يجوزون للمصول عليه الدفع ; واحتجوا بحديث أبي ذر ، وحمله العلماء على ترك القتال في الفتنة ، وكف اليد عند الشبهة ; على ما بيناه في كتاب \" التذكرة \" ، وقال عبد الله بن عمرو وجمهور الناس : كان هابيل أشد قوة من قابيل ولكنه تحرج . قال ابن عطية : وهذا هو الأظهر ، ومن هاهنا يقوى أن قابيل إنما هو عاص لا كافر ; لأنه لو كان كافرا لم يكن للتحرج هنا وجه ، وإنما وجه التحرج في هذا أن المتحرج يأبى أن يقاتل موحدا ، ويرضى بأن يظلم ليجازى في الآخرة ; ونحو هذا فعل عثمان رضي الله عنه ، وقيل : المعنى لا أقصد قتلك بل أقصد الدفع عن نفسي ، وعلى هذا قيل : كان نائما فجاء قابيل ورضخ رأسه بحجر على ما يأتي ، ومدافعة الإنسان عمن يريد ظلمه جائزة وإن أتى على نفس العادي ، وقيل : لئن بدأت بقتلي فلا أبدأ بالقتل . وقيل : أراد لئن بسطت إلي يدك ظلما فما أنا بظالم ; إني أخاف الله رب العالمين .\n                                    ",
        "saadi": "لَئِنۢ بَسَطتَ إِلَيَّ يَدَكَ لِتَقۡتُلَنِي مَآ أَنَا۠ بِبَاسِطٖ يَدِيَ إِلَيۡكَ لِأَقۡتُلَكَۖ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ ٨٢\n                                        \n                                        \n                                        \n                                        { لَئِن بَسَطْتَ إِلَيَّ يَدَكَ لِتَقْتُلَنِي مَا أَنَا بِبَاسِطٍ يَدِيَ إِلَيْكَ لِأَقْتُلَكَ } وليس ذلك جبنا مني ولا عجزا. وإنما ذلك لأني { أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ } والخائف لله لا يقدم على الذنوب، خصوصا الذنوب الكبار. وفي هذا تخويف لمن يريد القتل، وأنه ينبغي لك أن تتقي الله وتخافه.\n                                    "
      },
      "originalText": "لَئِنۢ بَسَطتَ إِلَيَّ يَدَكَ لِتَقۡتُلَنِي مَآ أَنَا۠ بِبَاسِطٖ يَدِيَ إِلَيۡكَ لِأَقۡتُلَكَۖ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ ٨٢"
    },
    {
      "number": 698,
      "text": "إِنِّي أُرِيدُ أَنْ تَبُوءَ بِإِثْمِي وَإِثْمِكَ فَتَكُونَ مِنْ أَصْحَابِ النَّارِ ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 29,
      "juz": 6,
      "manzil": 2,
      "page": 112,
      "ruku": 90,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنِّيٓ أُرِيدُ أَن تَبُوٓأَ بِإِثۡمِي وَإِثۡمِكَ فَتَكُونَ مِنۡ أَصۡحَٰبِ ٱلنَّارِۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ ٩٢\n                                    \n                                    \n                                    وقوله : ( إني أريد أن تبوء بإثمي وإثمك فتكون من أصحاب النار وذلك جزاء الظالمين ) قال ابن عباس ومجاهد والضحاك وقتادة والسدي في قوله : ( إني أريد أن تبوء بإثمي وإثمك ) أي : بإثم قتلي وإثمك الذي عليك قبل ذلك .\nقال ابن جرير : وقال آخرون : يعني ذلك أني أريد أن تبوء بخطيئتي ، فتتحمل وزرها ، وإثمك في قتلك إياي . وهذا قول وجدته عن مجاهد وأخشى أن يكون غلطا ; لأن الصحيح من الرواية عنه خلافه . يعني : ما رواه سفيان الثوري عن منصور عن مجاهد : ( إني أريد أن تبوء بإثمي ) قال : بقتلك إياي ، ( وإثمك ) قال : بما كان منك قبل ذلك .\nوكذا روى عيسى عن ابن أبي نجيح عن مجاهد مثله ، وروى شبل عن ابن أبي نجيح عن مجاهد : ( إني أريد أن تبوء بإثمي وإثمك ) يقول : إني أريد أن يكون عليك خطيئتي ودمي ، فتبوء بهما جميعا .\nقلت : وقد يتوهم كثير من الناس هذا القول ، ويذكرون في ذلك حديثا لا أصل له : ما ترك القاتل على المقتول من ذنب .\nوقد روى الحافظ أبو بكر البزار حديثا يشبه هذا ، ولكن ليس به ، فقال : حدثنا عمرو بن علي حدثنا عامر بن إبراهيم الأصبهاني حدثنا يعقوب بن عبد الله حدثنا عتبة بن سعيد عن هشام بن عروة عن أبيه ، عن عائشة قالت : قال رسول الله صلى الله عليه وسلم : \" قتل الصبر لا يمر بذنب إلا محاه \" .\nوهذا بهذا لا يصح ولو صح فمعناه أن الله يكفر عن المقتول بألم القتل ذنوبه ، فأما أن تحمل على القاتل فلا . ولكن قد يتفق هذا في بعض الأشخاص ، وهو الغالب ، فإن المقتول يطالب القاتل في العرصات فيؤخذ له من حسناته بقدر مظلمته ، فإن نفدت ولم يستوف حقه أخذ من سيئات المقتول فطرحت على القاتل ، فربما لا يبقى على المقتول خطيئة إلا وضعت على القاتل . وقد صح الحديث بذلك عن رسول الله صلى الله عليه وسلم في المظالم كلها ، والقتل من أعظمها وأشدها ، والله أعلم .\nوأما ابن جرير فقال والصواب من القول في ذلك أن يقال : إن تأويله : إني أريد أن تنصرف بخطيئتك في قتلك إياي - وذلك هو معنى قوله : ( إني أريد أن تبوء بإثمي ) وأما معنى ( وإثمك ) فهو إثمه بغير قتله ، وذلك معصيته الله ، عز وجل ، في أعمال سواه .\nوإنما قلنا هو الصواب ، لإجماع أهل التأويل عليه ، وأن الله ، عز وجل ، أخبرنا أن كل عامل فجزاء عمله له أو عليه وإذا كان هذا حكمه في خلقه ، فغير جائز أن تكون آثام المقتول مأخوذا بهذا القاتل ، وإنما يؤخذ القاتل بإثمه بالقتل المحرم وسائر آثام معاصيه التي ارتكبها بنفسه دون ما ركبه قتيله .\nهذا لفظه ثم أورد سؤالا حاصله : كيف أراد هابيل أن يكون على أخيه قابيل إثم قتله ، وإثم نفسه ، مع أن قتله له محرم ؟ وأجاب بما حاصله أن هابيل أخبر عن نفسه بأنه لا يقاتل أخاه إن قاتله ، بل يكف يده عنه ، طالبا - إن وقع قتل - أن يكون من أخيه لا منه .\nقلت : وهذا الكلام متضمن موعظة له لو اتعظ ، وزجرا له لو انزجر ; ولهذا قال : ( إني أريد أن تبوء بإثمي وإثمك ) أي : تتحمل إثمي وإثمك ( فتكون من أصحاب النار وذلك جزاء الظالمين )\nوقال ابن عباس : خوفه النار فلم ينته ولم ينزجر .\n                                    ",
        "qortoby": "إِنِّيٓ أُرِيدُ أَن تَبُوٓأَ بِإِثۡمِي وَإِثۡمِكَ فَتَكُونَ مِنۡ أَصۡحَٰبِ ٱلنَّارِۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ ٩٢\n                                    \n                                    \n                                    قوله تعالى : إني أريد أن تبوء بإثمي وإثمك قيل : معناه معنى قول النبي صلى الله عليه وسلم : إذا التقى المسلمان بسيفيهما فالقاتل والمقتول في النار قيل : يا رسول الله هذا القاتل فما بال المقتول ؟ قال : إنه كان حريصا على قتل صاحبه وكان هابيل أراد أني لست بحريص على قتلك ; فالإثم الذي كان يلحقني لو كنت حريصا على قتلك أريد أن تحمله أنت مع إثمك في قتلي ، وقيل : المعنى بإثمي الذي يختص بي فيما فرطت ; أي : يؤخذ من سيئاتي فتطرح عليك بسبب ظلمك لي ، وتبوء بإثمك في قتلك ; وهذا يعضده قوله عليه الصلاة والسلام : يؤتى يوم القيامة بالظالم والمظلوم فيؤخذ من حسنات الظالم فتزاد في حسنات المظلوم حتى ينتصف فإن لم تكن له حسنات أخذ من سيئات المظلوم فتطرح عليه . أخرجه مسلم بمعناه ، وقد تقدم ، ويعضده قوله تعالى : وليحملن أثقالهم وأثقالا مع أثقالهم وهذا بين لا إشكال فيه ، وقيل : المعنى إني أريد ألا تبوء بإثمي وإثمك كما قال تعالى : وألقى في الأرض رواسي أن تميد بكم أي : لئلا تميد بكم . وقوله تعالى : يبين الله لكم أن تضلوا أي : لئلا تضلوا فحذف \" لا \" .\nقلت : وهذا ضعيف ; لقوله عليه السلام : لا تقتل نفس ظلما إلا كان على ابن آدم الأول كفل من دمها لأنه أول من سن القتل ، فثبت بهذا أن إثم القتل حاصل ; ولهذا قال أكثر العلماء : إن المعنى ترجع بإثم قتلي وإثمك الذي عملته قبل قتلي . قال الثعلبي : هذا قول عامة أكثر المفسرين ، وقيل : هو استفهام ، أي : أو إني أريد ؟ على جهة الإنكار ; كقوله تعالى : وتلك نعمة أي : أو تلك نعمة ؟ وهذا لأن إرادة القتل معصية . حكاه القشيري وسئل أبو الحسن بن كيسان : كيف يريد المؤمن أن يأثم أخوه وأن يدخل النار ؟ فقال : إنما وقعت الإرادة بعدما بسط يده إليه بالقتل ; والمعنى : لئن بسطت إلي يدك لتقتلني لأمتنعن من ذلك مريدا للثواب ; فقيل له : فكيف قال : بإثمي وإثمك ; وأي إثم له إذا قتل ؟ فقال : فيه ثلاثة أجوبة :\nأحدها : أن تبوء بإثم قتلي وإثم ذنبك الذي من أجله لم يتقبل قربانك ، ويروى هذا القول عن مجاهد .\nوالوجه الآخر : أن تبوء بإثم قتلي وإثم اعتدائك علي ; لأنه قد يأثم بالاعتداء وإن لم يقتل .\nوالوجه الثالث : أنه لو بسط يده إليه أثم ; فرأى أنه إذا أمسك عن ذلك فإثمه يرجع على صاحبه . فصار هذا مثل قولك : المال بينه وبين زيد ; أي المال بينهما ، فالمعنى أن تبوء بإثمنا ، وأصل \" باء \" رجع إلى المباءة ، وهي المنزل . وباءوا بغضب من الله أي : رجعوا ، وقد مضى في \" البقرة \" مستوفى ، وقال الشاعر :\nألا تنتهي عنا ملوك وتتقي محارمنا لا يبوء الدم بالدم\nأي : لا يرجع الدم بالدم في القود .\nفتكون من أصحاب النار دليل على أنهم كانوا في ذلك الوقت مكلفين قد لحقهم الوعد والوعيد ، وقد استدل بقول هابيل لأخيه قابيل : فتكون من أصحاب النار على أنه كان كافرا ; لأن لفظ أصحاب النار إنما ورد في الكفار حيث وقع في القرآن ، وهذا مردود هنا بما ذكرناه عن أهل العلم في تأويل الآية ، ومعنى من أصحاب النار مدة كونك فيها ، والله أعلم .\n                                    ",
        "saadi": "إِنِّيٓ أُرِيدُ أَن تَبُوٓأَ بِإِثۡمِي وَإِثۡمِكَ فَتَكُونَ مِنۡ أَصۡحَٰبِ ٱلنَّارِۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ ٩٢\n                                        \n                                        \n                                        \n                                        { إِنِّي أُرِيدُ أَن تَبُوءَ } أي: ترجع { بِإِثْمِي وَإِثْمِكَ } أي: إنه إذا دار الأمر بين أن أكون قاتلا أو تقتلني فإني أوثر أن تقتلني، فتبوء بالوزرين { فَتَكُونَ مِنْ أَصْحَابِ النَّارِ وَذَلِكَ جَزَاءُ الظَّالِمِينَ } دل هذا على أن القتل من كبائر الذنوب، وأنه موجب لدخول النار.\n                                    "
      },
      "originalText": "إِنِّيٓ أُرِيدُ أَن تَبُوٓأَ بِإِثۡمِي وَإِثۡمِكَ فَتَكُونَ مِنۡ أَصۡحَٰبِ ٱلنَّارِۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ ٩٢"
    },
    {
      "number": 699,
      "text": "فَطَوَّعَتْ لَهُ نَفْسُهُ قَتْلَ أَخِيهِ فَقَتَلَهُ فَأَصْبَحَ مِنَ الْخَاسِرِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 30,
      "juz": 6,
      "manzil": 2,
      "page": 112,
      "ruku": 90,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَطَوَّعَتۡ لَهُۥ نَفۡسُهُۥ قَتۡلَ أَخِيهِ فَقَتَلَهُۥ فَأَصۡبَحَ مِنَ ٱلۡخَٰسِرِينَ ٠٣\n                                    \n                                    \n                                    وقوله تعالى : ( فطوعت له نفسه قتل أخيه فقتله فأصبح من الخاسرين ) أي : فحسنت وسولت له نفسه ، وشجعته على قتل أخيه فقتله ، أي : بعد هذه الموعظة وهذا الزجر .\nوقد تقدم في الرواية عن أبي جعفر الباقر وهو محمد بن علي بن الحسين : أنه قتله بحديدة في يده .\nوقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس - وعن مرة عن عبد الله وعن ناس من أصحاب النبي صلى الله عليه وسلم : ( فطوعت له نفسه قتل أخيه ) فطلبه ليقتله ، فراغ الغلام منه في رءوس الجبال ، فأتاه يوما من الأيام وهو يرعى غنما له ، وهو نائم فرفع صخرة ، فشدخ بها رأسه فمات ، فتركه بالعراء . رواه ابن جرير .\nوعن بعض أهل الكتاب : أنه قتله خنقا وعضا ، كما تقتل السباع ، وقال ابن جرير لما أراد أن يقتله جعل يلوي عنقه ، فأخذ إبليس دابة ووضع رأسها على حجر ، ثم أخذ حجرا آخر فضرب به رأسها حتى قتلها ، وابن آدم ينظر ، ففعل بأخيه مثل ذلك . رواه ابن أبي حاتم .\nوقال عبد الله بن وهب عن عبد الرحمن بن زيد بن أسلم عن أبيه قال : أخذ برأسه ليقتله ، فاضطجع له ، وجعل يغمز رأسه وعظامه ولا يدري كيف يقتله ، فجاءه إبليس فقال : أتريد أن تقتله ؟ قال : نعم . قال : فخذ هذه الصخرة فاطرحها على رأسه . قال : فأخذها ، فألقاها عليه ، فشدخ رأسه . ثم جاء إبليس إلى حواء مسرعا ، فقال : يا حواء ، إن قابيل قتل هابيل . فقالت له : ويحك ، أي شيء يكون القتل ؟ قال : لا يأكل ولا يشرب ولا يتحرك . قالت : ذلك الموت . قال : فهو الموت . فجعلت تصيح حتى دخل عليها آدم وهي تصيح ، فقال : ما لك ؟ فلم تكلمه ، فرجع إليها مرتين ، فلم تكلمه . فقال : عليك الصيحة وعلى بناتك ، وأنا وبني منها برآء . رواه ابن أبي حاتم .\nوقوله : ( فأصبح من الخاسرين ) أي : في الدنيا والآخرة ، وأي خسارة أعظم من هذه ؟ . وقد قال الإمام أحمد : حدثنا أبو معاوية ووكيع ، قالا : حدثنا الأعمش عن عبد الله بن مرة عن مسروق عن عبد الله بن مسعود قال : قال رسول الله صلى الله عليه وسلم : \" لا تقتل نفس ظلما ، إلا كان على ابن آدم الأول كفل من دمها ، لأنه كان أول من سن القتل \" .\nوقد أخرجه الجماعة سوى أبي داود من طرق ، عن الأعمش به .\nوقال ابن جرير : حدثنا القاسم ، حدثنا الحسين حدثني حجاج قال : قال ابن جريج : قال مجاهد : علقت إحدى رجلي القاتل بساقها إلى فخذها من يومئذ إلى يوم القيامة ، ووجهه في الشمس حيثما دارت دار ، عليه في الصيف حظيرة من نار ، وعليه في الشتاء حظيرة من ثلج - قال : وقال عبد الله بن عمرو : إنا لنجد ابن آدم القاتل يقاسم أهل النار قسمة صحيحة العذاب ، عليه شطر عذابهم .\nوقال ابن جرير : حدثنا ابن حميد حدثنا سلمة عن ابن إسحاق عن حكيم بن حكيم أنه حدث عن عبد الله بن عمرو أنه كان يقول : إن أشقى أهل النار رجلا ابن آدم الذي قتل أخاه ، ما سفك دم في الأرض منذ قتل أخاه إلى يوم القيامة ، إلا لحق به منه شر ، وذلك أنه أول من سن القتل .\nوقال إبراهيم النخعي : ما من مقتول يقتل ظلما ، إلا كان على ابن آدم الأول والشيطان كفل منه .\nرواه ابن جرير أيضا .\n                                    ",
        "qortoby": "فَطَوَّعَتۡ لَهُۥ نَفۡسُهُۥ قَتۡلَ أَخِيهِ فَقَتَلَهُۥ فَأَصۡبَحَ مِنَ ٱلۡخَٰسِرِينَ ٠٣\n                                    \n                                    \n                                    قوله تعالى : فطوعت له نفسه قتل أخيه فقتله فأصبح من الخاسرين\nفيه أربع مسائل :\nالأولى : قوله تعالى : فطوعت له نفسه . أي : سولت وسهلت نفسه عليه الأمر وشجعته وصورت له أن قتل أخيه طوع سهل له يقال : طاع الشيء يطوع أي : سهل وانقاد . وطوعه فلان له أي : سهله . قال الهروي : طوعت وأطاعت واحد ; يقال : طاع له كذا إذا أتاه طوعا . وقيل : طاوعته نفسه في قتل أخيه ; فنزع الخافض فانتصب . وروي أنه جهل كيف يقتله فجاء إبليس بطائر - أو حيوان غيره - فجعل يشدخ رأسه بين حجرين ليقتدي به قابيل ففعل ; قاله ابن جريج ومجاهد وغيرهما ، وقال ابن عباس وابن مسعود : وجده نائما فشدخ رأسه بحجر وكان ذلك في ثور - جبل بمكة - قاله ابن عباس ، وقيل : عند عقبة حراء ; حكاه محمد بن جرير الطبري ، وقال جعفر الصادق : بالبصرة في موضع المسجد الأعظم ، وكان لهابيل يوم قتله قابيل عشرون سنة ، ويقال : إن قابيل كان يعرف القتل بطبعه ; لأن الإنسان وإن لم ير القتل فإنه يعلم بطبعه أن النفس فانية ويمكن إتلافها ; فأخذ حجرا فقتله بأرض الهند ، والله أعلم . ولما قتله ندم فقعد يبكي عند رأسه إذ أقبل غرابان فاقتتلا فقتل أحدهما الآخر ثم حفر له حفرة فدفنه ; ففعل القاتل بأخيه كذا ، والسوءة يراد بها العورة ، وقيل : يراد بها جيفة المقتول ; ثم إنه هرب إلى أرض عدن من اليمن ، فأتاه إبليس وقال : إنما أكلت النار قربان أخيك لأنه كان يعبد النار ، فانصب أنت أيضا نارا تكون لك ولعقبك ، فبنى بيت نار ، فهو أول من عبد النار فيما قيل ، والله أعلم .\nوروي عن ابن عباس أنه لما قتله وآدم بمكة اشتاك الشجر ، وتغيرت الأطعمة ، وحمضت الفواكه ، وملحت المياه ، واغبرت الأرض ; فقال آدم عليه السلام : قد حدث في الأرض حدث ، فأتى الهند فإذا قابيل قد قتل هابيل . وقيل : إن قابيل هو الذي انصرف إلى آدم ، فلما وصل إليه قال له : أين هابيل ؟ فقال : لا أدري كأنك وكلتني بحفظه . فقال له آدم : أفعلتها ؟ ! والله إن دمه لينادي ، اللهم العن أرضا شربت دم هابيل . فروي أنه من حينئذ ما شربت أرض دما . ثم إن آدم بقي مائة سنة لم يضحك ، حتى جاءه ملك فقال له : حياك الله يا آدم وبياك . فقال : ما بياك ؟ قال : أضحكك ; قال مجاهد وسالم بن أبي الجعد . ولما مضى من عمر آدم مائة وثلاثون سنة - وذلك بعد قتل هابيل بخمس سنين ولدت له شيثا ، وتفسيره هبة الله ، أي : خلفا من هابيل ، وقال مقاتل : كان قبل قتل قابيل هابيل السباع والطيور تستأنس بآدم ، فلما قتل قابيل هابيل هربوا ، فلحقت الطيور بالهواء ، والوحوش بالبرية ، ولحقت السباع بالغياض . وروي أن آدم لما تغيرت الحال قال :\nتغيرت البلاد ومن عليها فوجه الأرض مغبر قبيح تغير كل ذي طعم ولون\nوقل بشاشة الوجه المليح\nفي أبيات كثيرة ذكرها الثعلبي وغيره . قال ابن عطية : هكذا هو الشعر بنصب \" بشاشة \" وكف التنوين . قال القشيري وغيره قال ابن عباس : ما قال آدم الشعر ، وإن محمدا والأنبياء كلهم في النهي عن الشعر سواء ; لكن لما قتل هابيل رثاه آدم وهو سرياني ، فهي مرثية بلسان السريانية أوصى بها إلى ابنه شيث وقال : إنك وصيي فاحفظ مني هذا الكلام ليتوارث ; فحفظت منه إلى زمان يعرب بن قحطان ، فترجم عنه يعرب بالعربية وجعله شعرا .\nالثانية : روي من حديث أنس قال : سئل النبي صلى الله عليه وسلم عن يوم الثلاثاء فقال : يوم الدم فيه حاضت حواء وفيه قتل ابن آدم أخاه ، وثبت في صحيح مسلم وغيره عن عبد الله قال قال رسول الله صلى الله عليه وسلم : لا تقتل نفس ظلما إلا كان على ابن آدم الأول كفل من دمها لأنه كان أول من سن القتل ، وهذا نص على التعليل ; وبهذا الاعتبار يكون على إبليس كفل من معصية كل من عصى بالسجود ; لأنه أول من عصى به ، وكذلك كل من أحدث في دين الله ما لا يجوز من البدع والأهواء ; قال صلى الله عليه وسلم : من سن في الإسلام سنة حسنة كان له أجرها وأجر من عمل بها إلى يوم القيامة ومن سن في الإسلام سنة سيئة كان عليه وزرها ووزر من عمل بها إلى يوم القيامة ، وهذا نص في الخير والشر ، وقال صلى الله عليه وسلم : إن أخوف ما أخاف على أمتي الأئمة المضلون ، وهذا كله صريح ، ونص صحيح في معنى الآية ، وهذا ما لم يتب الفاعل من تلك المعصية ، لأن آدم عليه السلام كان أول من خالف في أكل ما نهي عنه ، ولا يكون عليه شيء من أوزار من عصى بأكل ما نهي عنه ولا شربه من بعده بالإجماع ; لأن آدم تاب من ذلك وتاب الله عليه ، فصار كمن لم يجن .\nووجه آخر : فإنه أكل ناسيا على الصحيح من الأقوال ، كما بيناه في \" البقرة \" والناسي غير آثم ولا مؤاخذ .\nالثالثة : تضمنت هذه الآية البيان عن حال الحاسد ، حتى إنه قد يحمله حسده على إهلاك نفسه بقتل أقرب الناس إليه قرابة ، وأمسه به رحما ، وأولاهم بالحنو عليه ودفع الأذية عنه .\nالرابعة : قوله تعالى : فأصبح من الخاسرين أي : ممن خسر حسناته ، وقال ، مجاهد : علقت إحدى رجلي القاتل بساقها إلى فخذها من يومئذ إلى يوم القيامة ، ووجهه إلى الشمس حيثما دارت ، عليه في الصيف حظيرة من نار ، وعليه في الشتاء حظيرة من ثلج . قال ابن عطية : فإن صح هذا فهو من خسرانه الذي تضمنه قوله تعالى : فأصبح من الخاسرين وإلا فالخسران يعم خسران الدنيا والآخرة .\nقلت : ولعل هذا يكون عقوبته على القول بأنه عاص لا كافر ; فيكون المعنى فأصبح من الخاسرين أي : في الدنيا ، والله أعلم .\n                                    ",
        "saadi": "فَطَوَّعَتۡ لَهُۥ نَفۡسُهُۥ قَتۡلَ أَخِيهِ فَقَتَلَهُۥ فَأَصۡبَحَ مِنَ ٱلۡخَٰسِرِينَ ٠٣\n                                        \n                                        \n                                        \n                                        فلم يرتدع ذلك الجاني ولم ينزجر، ولم يزل يعزم نفسه ويجزمها، حتى طوعت له قتل أخيه الذي يقتضي الشرع والطبع احترامه. { فَقَتَلَهُ فَأَصْبَحَ مِنَ الْخَاسِرِينَ } دنياهم وآخرتهم، وأصبح قد سن هذه السنة لكل قاتل. \"ومن سن سنة سيئة، فعليه وزرها ووزر من عمل بها إلى يوم القيامة\". ولهذا ورد في الحديث الصحيح أنه \"ما من نفس تقتل إلا كان على ابن آدم الأول شطر من دمها، لأنه أول من سن القتل\". فلما قتل أخاه لم يدر كيف يصنع به؛ لأنه أول ميت مات من بني آدم\n                                    "
      },
      "originalText": "فَطَوَّعَتۡ لَهُۥ نَفۡسُهُۥ قَتۡلَ أَخِيهِ فَقَتَلَهُۥ فَأَصۡبَحَ مِنَ ٱلۡخَٰسِرِينَ ٠٣"
    },
    {
      "number": 700,
      "text": "فَبَعَثَ اللَّهُ غُرَابًا يَبْحَثُ فِي الْأَرْضِ لِيُرِيَهُ كَيْفَ يُوَارِي سَوْءَةَ أَخِيهِ ۚ قَالَ يَا وَيْلَتَا أَعَجَزْتُ أَنْ أَكُونَ مِثْلَ هَٰذَا الْغُرَابِ فَأُوَارِيَ سَوْءَةَ أَخِي ۖ فَأَصْبَحَ مِنَ النَّادِمِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 31,
      "juz": 6,
      "manzil": 2,
      "page": 112,
      "ruku": 90,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَبَعَثَ ٱللَّهُ غُرَابٗا يَبۡحَثُ فِي ٱلۡأَرۡضِ لِيُرِيَهُۥ كَيۡفَ يُوَٰرِي سَوۡءَةَ أَخِيهِۚ قَالَ يَٰوَيۡلَتَىٰٓ أَعَجَزۡتُ أَنۡ أَكُونَ مِثۡلَ هَٰذَا ٱلۡغُرَابِ فَأُوَٰرِيَ سَوۡءَةَ أَخِيۖ فَأَصۡبَحَ مِنَ ٱلنَّٰدِمِينَ ١٣\n                                    \n                                    \n                                    وقوله تعالى : ( فبعث الله غرابا يبحث في الأرض ليريه كيف يواري سوأة أخيه قال يا ويلتى أعجزت أن أكون مثل هذا الغراب فأواري سوأة أخي فأصبح من النادمين ) قال السدي بإسناده المتقدم إلى الصحابة : لما مات الغلام تركه بالعراء ، ولا يعلم كيف يدفن ، فبعث الله غرابين أخوين ، فاقتتلا فقتل أحدهما صاحبه ، فحفر له ثم حثى عليه . فلما رآه قال : ( قال يا ويلتى أعجزت أن أكون مثل هذا الغراب فأواري سوأة أخي ) .\nوقال علي بن أبي طلحة عن ابن عباس قال : جاء غراب إلى غراب ميت ، فبحث عليه من التراب حتى واراه ، فقال الذي قتل أخاه : ( قال يا ويلتى أعجزت أن أكون مثل هذا الغراب فأواري سوأة أخي )\nوقال الضحاك عن ابن عباس : مكث يحمل أخاه في جراب على عاتقه سنة ، حتى بعث الله الغرابين ، فرآهما يبحثان ، فقال : ( أعجزت أن أكون مثل هذا الغراب ) فدفن أخاه .\nوقال ليث بن أبي سليم عن مجاهد : وكان يحمله على عاتقه مائة سنة ميتا ، لا يدري ما يصنع به يحمله ، ويضعه إلى الأرض حتى رأى الغراب يدفن الغراب ، فقال : ( يا ويلتى أعجزت أن أكون مثل هذا الغراب فأواري سوأة أخي فأصبح من النادمين ) رواه ابن جرير وابن أبي حاتم .\nوقال عطية العوفي : لما قتله ندم . فضمه إليه حتى أروح ، وعكفت عليه الطيور والسباع تنتظر متى يرمي به فتأكله . رواه ابن جرير .\nوقال محمد بن إسحاق عن بعض أهل العلم بالكتاب الأول : لما قتله سقط في يديه ، ولم يدر كيف يواريه . وذلك أنه كان - فيما يزعمون - أول قتيل في بني آدم وأول ميت ( فبعث الله غرابا يبحث في الأرض ليريه كيف يواري سوأة أخيه قال يا ويلتى أعجزت أن أكون مثل هذا الغراب فأواري سوأة أخي فأصبح من النادمين ) قال : وزعم أهل التوراة أن قينا لما قتل أخاه هابيل قال له الله عز وجل : يا قين أين أخوك هابيل ؟ قال : قال : ما أدري ، ما كنت عليه رقيبا . فقال الله : إن صوت دم أخيك ليناديني من الأرض ، والآن أنت ملعون من الأرض التي فتحت فاها فبلعت دم أخيك من يدك ، فإن أنت عملت في الأرض ، فإنها لا تعود تعطيك حرثها حتى تكون فزعا تائها في الأرض .\nوقوله : ( فأصبح من النادمين ) قال الحسن البصري : علاه الله بندامة بعد خسران .\nفهذه أقوال المفسرين في هذه القصة ، وكلهم متفقون على أن هذين ابنا آدم لصلبه ، كما هو ظاهر القرآن ، وكما نطق به الحديث في قوله : \" إلا كان على ابن آدم الأول كفل من دمها ; لأنه أول من سن القتل \" . وهذا ظاهر جلي ، ولكن قال ابن جرير :\nحدثنا ابن وكيع حدثنا سهل بن يوسف عن عمرو عن الحسن - هو البصري - قال : كان الرجلان اللذان في القرآن ، اللذان قال الله : ( واتل عليهم نبأ ابني آدم بالحق ) من بني إسرائيل ولم يكونا ابني آدم لصلبه ، وإنما كان القربان في بني إسرائيل وكان آدم أول من مات . وهذا غريب جدا ، وفي إسناده نظر .\nوقد قال عبد الرزاق عن معمر ، عن الحسن قال : قال رسول الله صلى الله عليه وسلم : \" إن ابني آدم ، عليه السلام ، ضربا لهذه الأمة مثلا فخذوا بالخير منهما .\nورواه ابن المبارك عن عاصم الأحول عن الحسن قال : قال رسول الله صلى الله عليه وسلم : \" إن الله ضرب لكم ابني آدم مثلا فخذوا من خيرهم ودعوا الشر \" .\nوكذا أرسل هذا الحديث بكر بن عبد الله المزني روى ذلك كله ابن جرير .\nوقال سالم بن أبي الجعد : لما قتل ابن آدم أخاه ، مكث آدم مائة سنة حزينا لا يضحك ، ثم أتي فقيل له : حياك الله وبياك . أي : أضحكك .\nرواه ابن جرير ثم قال : حدثنا ابن حميد حدثنا سلمة عن غياث بن إبراهيم عن أبي إسحاق الهمداني قال : قال علي بن أبي طالب : لما قتل ابن آدم أخاه ، بكاه آدم فقال :\nتغيرت البلاد ومن عليها فلون الأرض مغبر قبيح تغير كل ذي لون وطعم\nوقل بشاشة الوجه المليح\nفأجيب آدم عليه السلام :\nأبا هابيل قد قتلا جميعا وصار الحي كالميت الذبيح\nوجاء بشرة قد كان منها على خوف فجاء بها يصيح\nوالظاهر أن قابيل عوجل بالعقوبة ، كما ذكره مجاهد بن جبر أنه علقت ساقه بفخذه يوم قتله ، وجعل الله وجهه إلى الشمس حيث دارت عقوبة له وتنكيلا به . وقد ورد في الحديث عن النبي صلى الله عليه وسلم [ أنه ] قال : \" ما من ذنب أجدر أن يعجل الله عقوبته في الدنيا مع ما يدخر لصاحبه في الآخرة ، من البغي وقطيعة الرحم \" . وقد اجتمع في فعل قابيل هذا وهذا ، فإنا لله وإنا إليه راجعون .\n                                    ",
        "qortoby": "فَبَعَثَ ٱللَّهُ غُرَابٗا يَبۡحَثُ فِي ٱلۡأَرۡضِ لِيُرِيَهُۥ كَيۡفَ يُوَٰرِي سَوۡءَةَ أَخِيهِۚ قَالَ يَٰوَيۡلَتَىٰٓ أَعَجَزۡتُ أَنۡ أَكُونَ مِثۡلَ هَٰذَا ٱلۡغُرَابِ فَأُوَٰرِيَ سَوۡءَةَ أَخِيۖ فَأَصۡبَحَ مِنَ ٱلنَّٰدِمِينَ ١٣\n                                    \n                                    \n                                    قوله تعالى : فبعث الله غرابا يبحث في الأرض ليريه كيف يواري سوأة أخيه قال يا ويلتا أعجزت أن أكون مثل هذا الغراب فأواري سوأة أخي فأصبح من النادمين\nفيه خمس مسائل :\nالأولى : قوله تعالى : فبعث الله غرابا يبحث في الأرض قال مجاهد : بعث الله غرابين فاقتتلا حتى قتل أحدهما صاحبه ثم حفر فدفنه ، وكان ابن آدم هذا أول من قتل ، وقيل : إن الغراب بحث الأرض على طعمه ليخفيه إلى وقت الحاجة إليه ; لأنه من عادة الغراب فعل ذلك ; فتنبه قابيل بذلك على مواراة أخيه . وروي أن قابيل لما قتل هابيل جعله في جراب ، ومشى به يحمله في عنقه مائة سنة ; قاله مجاهد ، وروى ابن القاسم عن مالك أنه حمله سنة واحدة ; وقاله ابن عباس ، وقيل : حتى أروح ولا يدري ما يصنع به إلى أن اقتدى بالغراب كما تقدم ، وفي الخبر عن أنس قال : سمعت النبي صلى الله عليه وسلم يقول : امتن الله على ابن آدم بثلاث بعد ثلاث بالريح بعد الروح فلولا أن الريح يقع بعد الروح ما دفن حميم حميما وبالدود في الجثة فلولا أن الدود يقع في الجثة لاكتنزتها الملوك وكانت خيرا لهم من الدراهم والدنانير وبالموت بعد الكبر وإن الرجل ليكبر حتى يمل نفسه ويمله أهله وولده وأقرباؤه فكان الموت أستر له ، وقال قوم : كان قابيل يعلم الدفن ، ولكن ترك أخاه بالعراء استخفافا به ، فبعث الله غرابا يبحث التراب على هابيل ليدفنه ، فقال عند ذلك : يا ويلتى أعجزت أن أكون مثل هذا الغراب فأواري سوءة أخي فأصبح من النادمين ، حيث رأى إكرام الله لهابيل بأن قيض له الغراب حتى واراه ، ولم يكن ذلك ندم توبة ، وقيل : إنما ندمه كان على فقده لا على قتله ، وإن كان فلم يكن موفيا شروطه . أو ندم ولم يستمر ندمه ; فقال ابن عباس : ولو كانت ندامته على قتله لكانت الندامة توبة منه ، ويقال : إن آدم وحواء أتيا قبره وبكيا أياما عليه . ثم إن قابيل كان على ذروة جبل فنطحه ثور فوقع إلى السفح وقد تفرقت عروقه . ويقال : دعا عليه آدم فانخسفت به الأرض ، ويقال : إن قابيل استوحش بعد قتل هابيل ولزم البرية ، وكان لا يقدر على ما يأكله إلا من الوحش ، فكان إذا ظفر به وقذه حتى يموت ثم يأكله . قال ابن عباس : فكانت الموقوذة حراما من لدن قابيل بن آدم ، وهو أول من يساق من الآدميين إلى النار ; وذلك قوله تعالى : ربنا أرنا الذين أضلانا من الجن والإنس الآية ، فإبليس رأس الكافرين من الجن ، وقابيل رأس الخطيئة من الإنس ; على ما يأتي بيانه في \" حم فصلت \" إن شاء الله تعالى ، وقد قيل : إن الندم في ذلك الوقت لم يكن توبة ، والله بكل ذلك أعلم وأحكم ، وظاهر الآية أن هابيل هو أول ميت من بني آدم ; ولذلك جهلت سنة المواراة ; وكذلك حكى الطبري عن ابن إسحاق عن بعض أهل العلم بما في كتب الأوائل ، وقوله يبحث معناه يفتش التراب بمنقاره ويثيره . ومن هذا سميت سورة \" براءة \" البحوث ; لأنها فتشت عن المنافقين ; ومن ذلك قول الشاعر :\nإن الناس غطوني تغطيت عنهم وإن بحثوني كان فيهم مباحث\nوفي المثل : لا تكن كالباحث على الشفرة ; قال الشاعر :\nفكانت كعنز السوء قامت برجلها إلى مدية مدفونة تستثيرها\nالثانية : بعث الله الغراب حكمة ; ليرى ابن آدم كيفية المواراة ، وهو معنى قوله تعالى : ثم أماته فأقبره ، فصار فعل الغراب في المواراة سنة باقية في الخلق ، فرضا على جميع الناس على الكفاية ، من فعله منهم سقط فرضه عن الباقين . وأخص الناس به الأقربون الذين يلونه ، ثم الجيرة ، ثم سائر المسلمين ، وأما الكفار فقد روى أبو داود عن علي قال : قلت للنبي صلى الله عليه وسلم إن عمك الشيخ الضال قد مات ; قال : اذهب فوار أباك التراب ثم لا تحدثن شيئا حتى تأتيني فذهبت فواريته وجئته فأمرني فاغتسلت ودعا لي .\nالثالثة : ويستحب في القبر سعته وإحسانه ; لما رواه ابن ماجه عن هشام بن عامر رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : احفروا وأوسعوا وأحسنوا ، وروي عن الأدرع السلمي قال : جئت ليلة أحرس النبي صلى الله عليه وسلم ; فإذا رجل قراءته عالية ، فخرج النبي صلى الله عليه وسلم فقلت : يا رسول الله : هذا مراء ; قال : فمات بالمدينة ففرغوا من جهازه فحملوا نعشه ، فقال رسول الله صلى الله عليه وسلم : ارفقوا به رفق الله به إنه كان يحب الله ورسوله . قال : وحضر حفرته فقال : أوسعوا له وسع الله عليه فقال بعض أصحابه : يا رسول الله لقد حزنت عليه ؟ فقال : أجل إنه كان يحب الله ورسوله ; أخرجه عن أبي بكر بن أبي شيبة عن زيد بن الحباب عن موسى بن عبيدة عن سعيد بن أبي سعيد . قال أبو عمر بن عبد البر : أدرع السلمي روى عن النبي صلى الله عليه وسلم حديثا واحدا ، وروى عنه سعيد بن أبي سعيد المقبري ; وأما هشام بن عامر بن أمية بن الحسحاس بن عامر بن غنم بن عدي بن النجار الأنصاري ، كان يسمى في الجاهلية شهابا فغير النبي صلى الله عليه وسلم اسمه فسماه هشاما ، واستشهد أبوه عامر يوم أحد . سكن هشام البصرة ومات بها ; ذكر هذا في كتاب الصحابة .\nالرابعة : ثم قيل : اللحد أفضل من الشق ; فإنه الذي اختاره الله لرسوله صلى الله عليه وسلم ; فإن النبي صلى الله عليه وسلم لما توفي كان بالمدينة رجلان أحدهما يلحد والآخر لا يلحد ; فقالوا : أيهما جاء أولا عمل عمله ، فجاء الذي يلحد فلحد لرسول الله صلى الله عليه وسلم ; ذكره مالك في الموطأ عن هشام بن عروة عن أبيه ، وأخرجه ابن ماجه عن أنس بن مالك وعائشة رضي الله عنهما ، والرجلان هما أبو طلحة وأبو عبيدة ; وكان أبو طلحة يلحد وأبو عبيدة يشق ، واللحد هو أن يحفر في جانب القبر إن كانت تربة صلبة ، يوضع فيه الميت ثم يوضع عليه اللبن ثم يهال التراب ; قال سعد بن أبي وقاص في مرضه الذي هلك فيه : ألحدوا لي لحدا وانصبوا علي اللبن نصبا كما صنع برسول الله صلى الله عليه وسلم . أخرجه مسلم . وروى ابن ماجه وغيره عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : اللحد لنا والشق لغيرنا .\nالخامسة : روى ابن ماجه عن سعيد بن المسيب قال : حضرت ابن عمر في جنازة فلما وضعها في اللحد قال : بسم الله وفي سبيل الله وعلى ملة رسول الله صلى الله عليه وسلم ، فلما أخذ في تسوية [ اللبن على ] اللحد قال : اللهم أجرها من الشيطان ومن عذاب القبر ، اللهم جاف الأرض عن جنبيها ، وصعد روحها ولقها منك رضوانا . قلت يا ابن عمر أشيء سمعته من رسول الله صلى الله عليه وسلم أم قلته برأيك ؟ قال : إني إذا لقادر على القول ! بل شيء سمعته من رسول الله صلى الله عليه وسلم ، وروي عن أبي هريرة أن رسول الله صلى الله عليه وسلم صلى على جنازة ثم أتى قبر الميت فحثا عليه من قبل رأسه ثلاثا .\nفهذا ما تعلق في معنى الآية من الأحكام ، والأصل في يا ويلتى يا ويلتي ثم أبدل من الياء ألف ، وقرأ الحسن على الأصل بالياء ، والأول أفصح ; لأن حذف الياء في النداء أكثر ، وهي كلمة تدعو بها العرب عند الهلاك ; قاله سيبويه ، وقال الأصمعي : \" ويل \" بعد ، وقرأ الحسن : \" أعجزت \" بكسر الجيم . قال النحاس : وهي لغة شاذة ; إنما يقال عجزت المرأة إذا عظمت عجيزتها ، وعجزت عن الشيء عجزا ومعجزة ومعجزة ، والله أعلم .\n                                    ",
        "saadi": "فَبَعَثَ ٱللَّهُ غُرَابٗا يَبۡحَثُ فِي ٱلۡأَرۡضِ لِيُرِيَهُۥ كَيۡفَ يُوَٰرِي سَوۡءَةَ أَخِيهِۚ قَالَ يَٰوَيۡلَتَىٰٓ أَعَجَزۡتُ أَنۡ أَكُونَ مِثۡلَ هَٰذَا ٱلۡغُرَابِ فَأُوَٰرِيَ سَوۡءَةَ أَخِيۖ فَأَصۡبَحَ مِنَ ٱلنَّٰدِمِينَ ١٣\n                                        \n                                        \n                                        \n                                        { فَبَعَثَ اللَّهُ غُرَابًا يَبْحَثُ فِي الْأَرْضِ } أي: يثيرها ليدفن غرابا آخر ميتا. { لِيُرِيَهُ } بذلك { كَيْفَ يُوَارِي سَوْأَةَ أَخِيهِ } أي: بدنه، لأن بدن الميت يكون عورة { فَأَصْبَحَ مِنَ النَّادِمِينَ } وهكذا عاقبة المعاصي الندامة والخسارة.\n                                    "
      },
      "originalText": "فَبَعَثَ ٱللَّهُ غُرَابٗا يَبۡحَثُ فِي ٱلۡأَرۡضِ لِيُرِيَهُۥ كَيۡفَ يُوَٰرِي سَوۡءَةَ أَخِيهِۚ قَالَ يَٰوَيۡلَتَىٰٓ أَعَجَزۡتُ أَنۡ أَكُونَ مِثۡلَ هَٰذَا ٱلۡغُرَابِ فَأُوَٰرِيَ سَوۡءَةَ أَخِيۖ فَأَصۡبَحَ مِنَ ٱلنَّٰدِمِينَ ١٣"
    }
  ]
}