{
  "number": 113,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 701,
      "text": "مِنْ أَجْلِ ذَٰلِكَ كَتَبْنَا عَلَىٰ بَنِي إِسْرَائِيلَ أَنَّهُ مَنْ قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ أَوْ فَسَادٍ فِي الْأَرْضِ فَكَأَنَّمَا قَتَلَ النَّاسَ جَمِيعًا وَمَنْ أَحْيَاهَا فَكَأَنَّمَا أَحْيَا النَّاسَ جَمِيعًا ۚ وَلَقَدْ جَاءَتْهُمْ رُسُلُنَا بِالْبَيِّنَاتِ ثُمَّ إِنَّ كَثِيرًا مِنْهُمْ بَعْدَ ذَٰلِكَ فِي الْأَرْضِ لَمُسْرِفُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 32,
      "juz": 6,
      "manzil": 2,
      "page": 113,
      "ruku": 90,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُنَا بِٱلۡبَيِّنَٰتِ ثُمَّ إِنَّ كَثِيرٗا مِّنۡهُم بَعۡدَ ذَٰلِكَ فِي ٱلۡأَرۡضِ لَمُسۡرِفُونَ ٢٣\n                                    \n                                    \n                                    قوله تعالى : ( من أجل ) قتل ابن آدم أخاه ظلما وعدوانا : ( كتبنا على بني إسرائيل ) أي : شرعنا لهم وأعلمناهم ( أنه من قتل نفسا بغير نفس أو فساد في الأرض فكأنما قتل الناس جميعا ومن أحياها فكأنما أحيا الناس جميعا ) أي : ومن قتل نفسا بغير سبب من قصاص ، أو فساد في الأرض ، واستحل قتلها بلا سبب ولا جناية ، فكأنما قتل الناس جميعا ; لأنه لا فرق عنده بين نفس ونفس ، ( ومن أحياها ) أي : حرم قتلها واعتقد ذلك ، فقد سلم الناس كلهم منه بهذا الاعتبار ; ولهذا قال : ( فكأنما أحيا الناس جميعا ) .\nوقال الأعمش وغيره ، عن أبي صالح عن أبي هريرة قال : دخلت على عثمان يوم الدار فقلت : جئت لأنصرك وقد طاب الضرب يا أمير المؤمنين . فقال : يا أبا هريرة ، أيسرك أن تقتل الناس جميعا وإياي معهم؟ قلت : لا . قال فإنك إن قتلت رجلا واحدا فكأنما قتلت الناس جميعا ، فانصرف مأذونا لك ، مأجورا غير مأزور . قال : فانصرفت ولم أقاتل .\nوقال علي بن أبي طلحة عن ابن عباس : هو كما قال الله تعالى : ( من قتل نفسا بغير نفس أو فساد في الأرض فكأنما قتل الناس جميعا ومن أحياها فكأنما أحيا الناس جميعا ) وإحياؤها : ألا يقتل نفسا حرمها الله ، فذلك الذي أحيا الناس جميعا ، يعني : أنه من حرم قتلها إلا بحق ، حيي الناس منه [ جميعا ]\nوهكذا قال مجاهد : ( ومن أحياها ) أي : كف عن قتلها .\nوقال العوفي عن ابن عباس في قوله : ( فكأنما قتل الناس جميعا ) يقول : من قتل نفسا واحدة حرمها الله ، فهو مثل من قتل الناس جميعا . وقال سعيد بن جبير : من استحل دم مسلم فكأنما استحل دماء الناس جميعا ، ومن حرم دم مسلم فكأنما حرم دماء الناس جميعا .\nهذا قول ، وهو الأظهر ، وقال عكرمة والعوفي عن ابن عباس [ في قوله : ( فكأنما قتل الناس جميعا ) يقول ] من قتل نبيا أو إمام عدل ، فكأنما قتل الناس جميعا ، ومن شد على عضد نبي أو إمام عدل ، فكأنما أحيا الناس جميعا . رواه ابن جرير .\nوقال مجاهد في رواية أخرى عنه : من قتل نفسا بغير نفس فكأنما قتل الناس جميعا ; وذلك لأنه من قتل النفس فله النار ، فهو كما لو قتل الناس كلهم .\nوقال ابن جريج عن الأعرج عن مجاهد في قوله : ( فكأنما قتل الناس جميعا ) من قتل النفس المؤمنة متعمدا ، جعل الله جزاءه جهنم ، وغضب الله عليه ولعنه ، وأعد له عذابا عظيما ، يقول : لو قتل الناس جميعا لم يزد على مثل ذلك العذاب .\nقال ابن جريج : قال مجاهد ( ومن أحياها فكأنما أحيا الناس جميعا ) قال : من لم يقتل أحدا فقد حيي الناس منه .\nوقال عبد الرحمن بن زيد بن أسلم : من قتل نفسا فكأنما قتل الناس [ جميعا ] يعني : فقد وجب عليه القصاص ، فلا فرق بين الواحد والجماعة ( ومن أحياها ) أي : عفا عن قاتل وليه ، فكأنما أحيا الناس جميعا . وحكي ذلك عن أبيه . رواه ابن جرير .\nوقال مجاهد - في رواية - : ( ومن أحياها ) أي : أنجاها من غرق أو حرق أو هلكة .\nوقال الحسن وقتادة في قوله : ( أنه من قتل نفسا بغير نفس أو فساد في الأرض فكأنما قتل الناس جميعا ) هذا تعظيم لتعاطي القتل - قال قتادة : عظم والله وزرها ، وعظم والله أجرها .\nوقال ابن المبارك عن سلام بن مسكين عن سليمان بن علي الربعي قال : قلت للحسن : هذه الآية لنا يا أبا سعيد كما كانت لبني إسرائيل؟ فقال : إي والذي لا إله غيره ، كما كانت لبني إسرائيل . وما جعل دماء بني إسرائيل أكرم على الله من دمائنا .\nوقال الحسن البصري : ( فكأنما قتل الناس جميعا ) قال : وزرا . ( ومن أحياها فكأنما أحيا الناس جميعا ) قال : أجرا .\nوقال الإمام أحمد : حدثنا حسن حدثنا ابن لهيعة حدثنا حيي بن عبد الله عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو قال : جاء حمزة بن عبد المطلب إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، اجعلني على شيء أعيش به . فقال رسول الله صلى الله عليه وسلم : \" يا حمزة ، نفس تحييها أحب إليك أم نفس تميتها؟ \" قال : بل نفس أحييها : قال : \" عليك بنفسك \" .\nوقوله : ( ولقد جاءتهم رسلنا بالبينات ) أي : بالحجج والبراهين والدلائل الواضحة ( ثم إن كثيرا منهم بعد ذلك في الأرض لمسرفون ) وهذا تقريع لهم وتوبيخ على ارتكابهم المحارم بعد علمهم بها ، كما كانت بنو قريظة والنضير وغيرهم من بني قينقاع ممن حول المدينة من اليهود الذين كانوا يقاتلون مع الأوس والخزرج إذا وقعت بينهم الحروب في الجاهلية ، ثم إذا وضعت الحروب أوزارها فدوا من أسروه ، وودوا من قتلوه ، وقد أنكر الله عليهم ذلك في سورة البقرة ، حيث يقول : ( وإذ أخذنا ميثاقكم لا تسفكون دماءكم ولا تخرجون أنفسكم من دياركم ثم أقررتم وأنتم تشهدون ثم أنتم هؤلاء تقتلون أنفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالإثم والعدوان وإن يأتوكم أسارى تفادوهم وهو محرم عليكم إخراجهم أفتؤمنون ببعض الكتاب وتكفرون ببعض فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا ويوم القيامة يردون إلى أشد العذاب وما الله بغافل عما تعملون ) [ البقرة : 84 ، 85 ] .\n                                    ",
        "qortoby": "مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُنَا بِٱلۡبَيِّنَٰتِ ثُمَّ إِنَّ كَثِيرٗا مِّنۡهُم بَعۡدَ ذَٰلِكَ فِي ٱلۡأَرۡضِ لَمُسۡرِفُونَ ٢٣\n                                    \n                                    \n                                    قوله : من أجل ذلك كتبنا على بني إسرائيل أنه من قتل نفسا بغير نفس أو فساد في الأرض فكأنما قتل الناس جميعا ومن أحياها فكأنما أحيا الناس جميعا ولقد جاءتهم رسلنا بالبينات ثم إن كثيرا منهم بعد ذلك في الأرض لمسرفون\nقوله تعالى : من أجل ذلك أي : من جراء ذلك القاتل وجريرته ، وقال الزجاج : أي : من جنايته ; يقال : أجل الرجل على أهله شرا يأجل أجلا إذا جنى ; مثل أخذ يأخذ أخذا . قال الخنوت :\nوأهل خباء صالح كنت بينهم قد احتربوا في عاجل أنا آجله\nأي : جانيه ، وقيل : أنا جاره عليهم ، وقال عدي بن زيد :\nأجل إن الله قد فضلكم فوق من أحكأ صلبا بإزار\nوأصله الجر ; ومنه الأجل لأنه وقت يجر إليه العقد الأول ، ومنه الآجل نقيض العاجل ، وهو بمعنى يجر إليه أمر متقدم ، ومنه أجل بمعنى نعم . لأنه انقياد إلى ما جر إليه ، ومنه الإجل للقطيع من بقر الوحش ; لأن بعضه ينجر إلى بعض ; قاله الرماني ، وقرأ يزيد بن القعقاع أبو جعفر : \" من أجل ذلك \" بكسر النون وحذف الهمزة وهي لغة ، والأصل \" من إجل ذلك \" فألقيت كسرة الهمزة على النون وحذفت الهمزة . ثم قيل : يجوز أن يكون قوله : من أجل ذلك متعلقا بقوله : من النادمين ، فالوقف على قوله : من أجل ذلك ، ويجوز أن يكون متعلقا بما بعده وهو كتبنا . ف ( من أجل ) ابتداء كلام والتمام ( من النادمين ) ; وعلى هذا أكثر الناس ; أي : من سبب هذه النازلة كتبنا ، وخص بني إسرائيل بالذكر - وقد تقدمتهم أمم قبلهم كان قتل النفس فيهم محظورا - لأنهم أول أمة نزل الوعيد عليهم في قتل الأنفس مكتوبا ، وكان قبل ذلك قولا مطلقا ; فغلظ الأمر على بني إسرائيل بالكتاب بحسب طغيانهم وسفكهم الدماء . ومعنى بغير نفس أي : بغير أن يقتل نفسا فيستحق القتل ، وقد حرم الله القتل في جميع الشرائع إلا بثلاث خصال : كفر بعد إيمان ، أو زنى بعد إحصان ، أو قتل نفس ظلما وتعديا . أو فساد في الأرض أي : شرك ، وقيل : قطع طريق .\nوقرأ الحسن : \" أو فسادا \" بالنصب على تقدير حذف فعل يدل عليه أول الكلام تقديره ; أو أحدث فسادا ; والدليل عليه قوله : من قتل نفسا بغير نفس لأنه من أعظم الفساد .\nوقرأ العامة : \" فساد \" بالجر على معنى أو بغير فساد . فكأنما قتل الناس جميعا اضطرب لفظ المفسرين في ترتيب هذا التشبيه لأجل أن عقاب من قتل الناس جميعا أكثر من عقاب من قتل واحدا ; فروي عن ابن عباس أنه قال : المعنى من قتل نبيا أو إمام عدل فكأنما قتل الناس جميعا ومن أحياه بأن شد عضده ونصره فكأنما أحيا الناس جميعا ، وعنه أيضا أنه قال : المعنى من قتل نفسا واحدة وانتهك حرمتها فهو مثل من قتل الناس جميعا ، ومن ترك قتل نفس واحدة وصان حرمتها واستحياها خوفا من الله فهو كمن أحيا الناس جميعا ، وعنه أيضا . المعنى فكأنما قتل الناس جميعا عند المقتول ، ومن أحياها واستنقذها من هلكة فكأنما أحيا الناس جميعا عند المستنقذ ، وقال مجاهد : المعنى أن الذي يقتل النفس المؤمنة متعمدا جعل الله جزاءه جهنم وغضب عليه ولعنه وأعد له عذابا عظيما ; يقول : لو قتل الناس جميعا لم يزد على ذلك ، ومن لم يقتل فقد حيي الناس منه ، وقال ابن زيد : المعنى أن من قتل نفسا فيلزمه من القود والقصاص ما يلزم من قتل الناس جميعا ، قال : ومن أحياها أي : من عفا عمن وجب له قتله ; وقاله الحسن أيضا ; أي : هو العفو بعد المقدرة ، وقيل : المعنى أن من قتل نفسا فالمؤمنون كلهم خصماؤه ; لأنه قد وتر الجميع ، ومن أحياها فكأنما أحيا الناس جميعا ، أي : يجب على الكل شكره ، وقيل : جعل إثم قاتل الواحد إثم قاتل الجميع ; وله أن يحكم بما يريد ، وقيل : كان هذا مختصا ببني إسرائيل تغليظا عليهم . قال ابن عطية : وعلى الجملة فالتشبيه على ما قيل واقع كله ، والمنتهك في واحد ملحوظ بعين منتهك الجميع ; ومثاله رجلان حلفا على شجرتين ألا يطعما من ثمرهما شيئا ، فطعم أحدهما واحدة من ثمر شجرته ، وطعم الآخر ثمر شجرته كلها ، فقد استويا في الحنث ، وقيل : المعنى أن من استحل واحدا فقد استحل الجميع ; لأنه أنكر الشرع ، وفي قوله تعالى : ومن أحياها تجوز ; فإنه عبارة عن الترك والإنقاذ من هلكة ، وإلا فالإحياء حقيقة - الذي هو الاختراع - إنما هو لله تعالى ، وإنما هذا الإحياء بمنزلة قول نمرود اللعين : أنا أحيي وأميت فسمى الترك إحياء . ثم أخبر الله عن بني إسرائيل أنهم جاءتهم الرسل بالبينات ، وأن أكثرهم مجاوزون الحد ، وتاركون أمر الله .\n                                    ",
        "saadi": "مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُنَا بِٱلۡبَيِّنَٰتِ ثُمَّ إِنَّ كَثِيرٗا مِّنۡهُم بَعۡدَ ذَٰلِكَ فِي ٱلۡأَرۡضِ لَمُسۡرِفُونَ ٢٣\n                                        \n                                        \n                                        \n                                        يقول تعالى { مِنْ أَجْلِ ذَلِكَ } الذي ذكرناه في قصة ابني آدم، وقتل أحدهما أخاه، وسنه القتل لمن بعده، وأن القتل عاقبته وخيمة وخسارة في الدنيا والآخرة. { كَتَبْنَا عَلَى بَنِي إِسْرَائِيلَ } أهل الكتب السماوية { أَنَّهُ مَنْ قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ أَوْ فَسَادٍ فِي الْأَرْضِ } أي: بغير حق { فَكَأَنَّمَا قَتَلَ النَّاسَ جَمِيعًا } ؛ لأنه ليس معه داع يدعوه إلى التبيين، وأنه لا يقدم على القتل إلا بحق، فلما تجرأ على قتل النفس التي لم تستحق القتل علم أنه لا فرق عنده بين هذا المقتول وبين غيره، وإنما ذلك بحسب ما تدعوه إليه نفسه الأمارة بالسوء. فتجرؤه على قتله، كأنه قتل الناس جميعا. وكذلك من أحيا نفسا أي: استبقى أحدا، فلم يقتله مع دعاء نفسه له إلى قتله، فمنعه خوف الله تعالى من قتله، فهذا كأنه أحيا الناس جميعا، لأن ما معه من الخوف يمنعه من قتل من لا يستحق القتل. ودلت الآية على أن القتل يجوز بأحد أمرين: إما أن يقتل نفسا بغير حق متعمدا في ذلك، فإنه يحل قتله، إن كان مكلفا مكافئا، ليس بوالد للمقتول. وإما أن يكون مفسدا في الأرض، بإفساده لأديان الناس أو أبدانهم أو أموالهم، كالكفار المرتدين والمحاربين، والدعاة إلى البدع الذين لا ينكف شرهم إلا بالقتل. وكذلك قطاع الطريق ونحوهم، ممن يصول على الناس لقتلهم، أو أخذ أموالهم. { وَلَقَدْ جَاءَتْهُمْ رُسُلُنَا بِالْبَيِّنَاتِ } التي لا يبقى معها حجة لأحد. { ثُمَّ إِنَّ كَثِيرًا مِنْهُمْ } أي: من الناس { بَعْدِ ذَلِكَ } البيان القاطع للحجة، الموجب للاستقامة في الأرض { لَمُسْرِفُونَ } في العمل بالمعاصي، ومخالفة الرسل الذين جاءوا بالبينات والحجج.\n                                    "
      },
      "originalText": "مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُنَا بِٱلۡبَيِّنَٰتِ ثُمَّ إِنَّ كَثِيرٗا مِّنۡهُم بَعۡدَ ذَٰلِكَ فِي ٱلۡأَرۡضِ لَمُسۡرِفُونَ ٢٣"
    },
    {
      "number": 702,
      "text": "إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُمْ مِنْ خِلَافٍ أَوْ يُنْفَوْا مِنَ الْأَرْضِ ۚ ذَٰلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 33,
      "juz": 6,
      "manzil": 2,
      "page": 113,
      "ruku": 90,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا جَزَٰٓؤُاْ ٱلَّذِينَ يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُۥ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادًا أَن يُقَتَّلُوٓاْ أَوۡ يُصَلَّبُوٓاْ أَوۡ تُقَطَّعَ أَيۡدِيهِمۡ وَأَرۡجُلُهُم مِّنۡ خِلَٰفٍ أَوۡ يُنفَوۡاْ مِنَ ٱلۡأَرۡضِۚ ذَٰلِكَ لَهُمۡ خِزۡيٞ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٌ ٣٣\n                                    \n                                    \n                                    وقوله تعالى : ( إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا أو تقطع أيديهم وأرجلهم من خلاف أو ينفوا من الأرض ) الآية . المحاربة : هي المضادة والمخالفة ، وهي صادقة على الكفر ، وعلى قطع الطريق وإخافة السبيل ، وكذا الإفساد في الأرض يطلق على أنواع من الشر ، حتى قال كثير من السلف ، منهم سعيد بن المسيب : إن قرض الدراهم والدنانير من الإفساد في الأرض ، وقد قال الله تعالى : ( وإذا تولى سعى في الأرض ليفسد فيها ويهلك الحرث والنسل والله لا يحب الفساد ) [ البقرة : 205 ] .\nثم قال بعضهم : نزلت هذه الآية الكريمة في المشركين ، كما قال ابن جرير :\nحدثنا ابن حميد حدثنا يحيى بن واضح حدثنا الحسين بن واقد عن يزيد عن عكرمة والحسن البصري قالا [ قال تعالى ] ( إنما جزاء الذين يحاربون الله ورسوله ) إلى ( أن الله غفور رحيم ) نزلت هذه الآية في المشركين ، فمن تاب منهم من قبل أن تقدروا عليه ، لم يكن عليه سبيل ، وليست تحرز هذه الآية الرجل المسلم من الحد ، إن قتل أو أفسد في الأرض أو حارب الله ورسوله ، ثم لحق بالكفار قبل أن يقدر عليه ، لم يمنعه ذلك أن يقام عليه الحد الذي أصاب .\nورواه أبو داود والنسائي من طريق عكرمة عن ابن عباس : ( إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا ) نزلت في المشركين ، فمن تاب منهم قبل أن يقدر عليه لم يمنعه ذلك أن يقام فيه الحد الذي أصابه .\nوقال علي بن أبي طلحة عن ابن عباس في قوله : ( إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا ) قال : كان قوم من أهل الكتاب بينهم وبين النبي صلى الله عليه وسلم عهد وميثاق ، فنقضوا العهد وأفسدوا في الأرض ، فخير الله رسوله : إن شاء أن يقتل ، وإن شاء أن تقطع أيديهم وأرجلهم من خلاف . رواه ابن جرير .\nوروى شعبة عن منصور عن هلال بن يساف عن مصعب بن سعد عن أبيه قال : نزلت في الحرورية : ( إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا ) رواه ابن مردويه .\nوالصحيح أن هذه الآية عامة في المشركين وغيرهم ممن ارتكب هذه الصفات ، كما رواه البخاري ومسلم من حديث أبي قلابة - واسمه عبد الله بن زيد الجرمي البصري - عن أنس بن مالك : أن نفرا من عكل ثمانية ، قدموا على رسول الله صلى الله عليه وسلم فبايعوه على الإسلام ، فاستوخموا الأرض وسقمت أجسامهم ، فشكوا ذلك إلى رسول الله صلى الله عليه وسلم فقال : \" ألا تخرجون مع راعينا في إبله فتصيبوا من أبوالها وألبانها؟ \" فقالوا : بلى . فخرجوا ، فشربوا من أبوالها وألبانها ، فصحوا فقتلوا الراعي وطردوا الإبل . فبلغ ذلك رسول الله صلى الله عليه وسلم فبعث في آثارهم ، فأدركوا ، فجيء بهم ، فأمر بهم فقطعت أيديهم وأرجلهم ، وسمرت أعينهم ، ثم نبذوا في الشمس حتى ماتوا .\nلفظ مسلم . وفي لفظ لهما : \" من عكل أو عرينة \" ، وفي لفظ : \" وألقوا في الحرة فجعلوا يستسقون فلا يسقون . وفي لفظ لمسلم : \" ولم يحسمهم \" . وعند البخاري : قال أبو قلابة : فهؤلاء سرقوا وقتلوا وكفروا بعد إيمانهم ، وحاربوا الله ورسوله . ورواه مسلم من طريق هشيم عن عبد العزيز بن صهيب وحميد عن أنس فذكر نحوه ، وعنده : \" وارتدوا \" . وقد أخرجاه من رواية قتادة عن أنس بنحوه . وقال سعيد عن قتادة : \" من عكل وعرينة \" . ورواه مسلم من طريق سليمان التيمي عن أنس قال : إنما سمل النبي صلى الله عليه وسلم أعين أولئك ; لأنهم سملوا أعين الرعاء . ورواه مسلم من حديث معاوية بن قرة عن أنس قال : أتى رسول الله صلى الله عليه وسلم نفر من عرينة فأسلموا وبايعوه ، وقد وقع بالمدينة الموم - وهو البرسام - ثم ذكر نحو حديثهم ، وزاد : وعنده شباب من الأنصار قريب من عشرين فارسا فأرسلهم ، وبعث معهم قائفا يقتص أثرهم . وهذه كلها ألفاظ مسلم رحمه الله .\nوقال حماد بن سلمة : حدثنا قتادة وثابت البناني وحميد الطويل عن أنس بن مالك : أن ناسا من عرينة قدموا المدينة فاجتووها ، فبعثهم رسول الله صلى الله عليه وسلم في إبل الصدقة ، وأمرهم أن يشربوا من أبوالها وألبانها ففعلوا ، فصحوا فارتدوا عن الإسلام ، وقتلوا الراعي ، وساقوا الإبل ، فأرسل رسول الله صلى الله عليه وسلم في آثارهم ، فجيء بهم ، فقطع أيديهم وأرجلهم من خلاف ، وسمر أعينهم وألقاهم في الحرة . قال أنس : فلقد رأيت أحدهم يكدم الأرض بفيه عطشا حتى ماتوا ، ونزلت : ( إنما جزاء الذين يحاربون الله ورسوله ) الآية .\nوقد رواه أبو داود والترمذي والنسائي وابن مردويه - وهذا لفظه - وقال الترمذي : \" حسن صحيح \" .\nوقد رواه ابن مردويه من طرق كثيرة ، عن أنس بن مالك منها ما رواه من طريقين ، عن سلام بن أبي الصهباء عن ثابت عن أنس بن مالك قال : ما ندمت على حديث ما ندمت على حديث سألني عنه الحجاج قال أخبرني عن أشد عقوبة عاقب بها رسول الله صلى الله عليه وسلم ؟ قال : قلت : قدم على رسول الله صلى الله عليه وسلم قوم من عرينة من البحرين فشكوا إلى رسول الله صلى الله عليه وسلم ما لقوا من بطونهم ، وقد اصفرت ألوانهم ، وضخمت بطونهم ، فأمرهم رسول الله صلى الله عليه وسلم أن يأتوا إبل الصدقة ، فيشربوا من أبوالها وألبانها ، حتى إذا رجعت إليهم ألوانهم وانخمصت بطونهم عدوا على الراعي فقتلوه ، واستاقوا الإبل ، فأرسل رسول الله صلى الله عليه وسلم في آثارهم ، فقطع أيديهم وأرجلهم وسمر أعينهم ، ثم ألقاهم في الرمضاء حتى ماتوا . فكان الحجاج إذا صعد المنبر يقول : إن رسول الله صلى الله عليه وسلم قد قطع أيدي قوم وأرجلهم ثم ألقاهم في الرمضاء حتى ماتوا لحال ذود [ من الإبل ] وكان يحتج بهذا الحديث على الناس .\nوقال ابن جرير : حدثنا علي بن سهل حدثنا الوليد - يعني ابن مسلم - حدثني سعيد عن قتادة عن أنس قال : كانوا أربعة نفر من عرينة وثلاثة نفر من عكل فلما أتي بهم قطع أيديهم وأرجلهم ، وسمل أعينهم ، ولم يحسمهم ، وتركهم يتلقمون الحجارة بالحرة ، فأنزل الله في ذلك : ( إنما جزاء الذين يحاربون الله ورسوله ) الآية .\nوقال ابن أبي حاتم : حدثنا علي بن حرب الموصلي حدثنا أبو مسعود - يعني عبد الرحمن بن الحسن الزجاج - حدثنا أبو سعد - يعني البقال - عن أنس بن مالك قال : كان رهط من عرينة أتوا رسول الله صلى الله عليه وسلم وبهم جهد ، مصفرة ألوانهم ، عظيمة بطونهم ، فأمرهم أن يلحقوا بالإبل فيشربوا من أبوالها وألبانها ، ففعلوا ، فصفت ألوانهم وخمصت بطونهم ، وسمنوا ، فقتلوا الراعي واستاقوا الإبل ، فبعث النبي صلى الله عليه وسلم في طلبهم ، فأتي بهم ، فقتل بعضهم ، وسمر أعين بعضهم ، وقطع أيدي بعضهم وأرجلهم ، ونزلت : ( إنما جزاء الذين يحاربون الله ورسوله ) إلى آخر الآية .\nوقال أبو جعفر بن جرير : حدثنا علي بن سهل حدثنا الوليد بن مسلم حدثنا ابن لهيعة عن يزيد بن أبي حبيب أن عبد الملك بن مروان كتب إلى أنس يسأله عن هذه الآية ، فكتب إليه أنس يخبره أن هذه الآية نزلت في أولئك النفر العرنيين وهم من بجيلة ، قال أنس : فارتدوا عن الإسلام ، وقتلوا الراعي ، واستاقوا الإبل ، وأخافوا السبيل ، وأصابوا الفرج الحرام .\nوقال : حدثني يونس أخبرنا ابن وهب أخبرني عمرو بن الحارث عن سعيد بن أبي هلال عن أبي الزناد عن عبد الله بن عبيد الله عن عبد الله بن عمر - أو : عمرو شك يونس - عن رسول الله صلى الله عليه وسلم بذلك - يعني بقصة العرنيين - ونزلت فيهم آية المحاربة . ورواه أبو داود والنسائي من طريق أبي الزناد وفيه : \" عن ابن عمر \" من غير شك .\nوقال ابن جرير : حدثنا محمد بن خلف حدثنا الحسن بن حماد عن عمرو بن هاشم عن موسى بن عبيدة عن محمد بن إبراهيم عن جرير قال : قدم على رسول الله صلى الله عليه وسلم قوم من عرينة حفاة مضرورين ، فأمر بهم رسول الله صلى الله عليه وسلم ، فلما صحوا واشتدوا قتلوا رعاء اللقاح ، ثم خرجوا باللقاح عامدين بها إلى أرض قومهم ، قال جرير : فبعثني رسول الله صلى الله عليه وسلم في نفر من المسلمين حتى أدركناهم بعدما أشرفوا على بلاد قومهم ، فقدمنا بهم على رسول الله صلى الله عليه وسلم فقطع أيديهم وأرجلهم من خلاف ، وسمل أعينهم ، فجعلوا يقولون : الماء . ورسول الله صلى الله عليه وسلم يقول : \" النار \" ! حتى هلكوا . قال : وكره الله - عز وجل - سمل الأعين ، فأنزل الله هذه الآية : ( إنما جزاء الذين يحاربون الله ورسوله ) إلى آخر الآية .\nهذا حديث غريب وفي إسناده الربذي وهو ضعيف ، وفيه فائدة ، وهو ذكر أمير هذه السرية ، وهو جرير بن عبد الله البجلي وتقدم في صحيح مسلم أن السرية كانوا عشرين فارسا من الأنصار . وأما قوله : \" فكره الله سمل الأعين ، فأنزل الله هذه الآية \" فإنه منكر ، وقد تقدم في صحيح مسلم أنهم سملوا أعين الرعاء ، فكان ما فعل بهم قصاصا ، والله أعلم .\nوقال عبد الرزاق عن إبراهيم بن محمد الأسلمي عن صالح مولى التوأمة عن أبي هريرة قال : قدم على رسول الله صلى الله عليه وسلم رجال من بني فزارة قد ماتوا هزلا . فأمرهم النبي صلى الله عليه وسلم إلى لقاحه ، فشربوا منها حتى صحوا ، ثم عمدوا إلى لقاحه فسرقوها ، فطلبوا ، فأتي بهم النبي صلى الله عليه وسلم ، فقطع أيديهم وأرجلهم ، وسمر أعينهم . قال أبو هريرة : ففيهم نزلت هذه الآية : ( إنما جزاء الذين يحاربون الله ورسوله ) فترك النبي صلى الله عليه وسلم سمر الأعين بعد .\nوروي من وجه آخر عن أبي هريرة .\nوقال أبو بكر بن مردويه : حدثنا أحمد بن إسحاق حدثنا الحسين بن إسحاق التستري حدثنا أبو القاسم محمد بن الوليد عن عمرو بن محمد المديني حدثنا محمد بن طلحة عن موسى بن محمد بن إبراهيم التيمي عن أبيه ، عن أبي سلمة بن عبد الرحمن عن سلمة بن الأكوع قال : كان للنبي صلى الله عليه وسلم غلام يقال له : \" يسار \" فنظر إليه يحسن الصلاة فأعتقه ، وبعثه في لقاح له بالحرة ، فكان بها ، قال : فأظهر قوم الإسلام من عرينة وجاءوا وهم مرضى موعوكون قد عظمت بطونهم ، قال : فبعث بهم النبي صلى الله عليه وسلم إلى \" يسار \" فكانوا يشربون من ألبان الإبل حتى انطوت بطونهم ، ثم عدوا على \" يسار \" فذبحوه ، وجعلوا الشوك في عينيه ، ثم أطردوا الإبل ، فبعث النبي صلى الله عليه وسلم في آثارهم خيلا من المسلمين ، أميرهم كرز بن جابر الفهري فلحقهم فجاء بهم إليه ، فقطع أيديهم وأرجلهم وسمل أعينهم . غريب جدا .\nوقد روى قصة العرنيين من حديث جماعة من الصحابة ، منهم جابر وعائشة وغير واحد . وقد اعتنى الحافظ الجليل أبو بكر بن مردويه بتطريق هذا الحديث من وجوه كثيرة جدا ، فرحمه الله وأثابه .\nوقال ابن جرير : حدثنا محمد بن علي بن الحسن بن شقيق سمعت أبي يقول : سمعت أبا حمزة عن عبد الكريم - وسئل عن أبوال الإبل - فقال : حدثني سعيد بن جبير عن المحاربين فقال : كان أناس أتوا رسول الله صلى الله عليه وسلم فقالوا : نبايعك على الإسلام . فبايعوه ، وهم كذبة ، وليس الإسلام يريدون . ثم قالوا : إنا نجتوي المدينة . فقال النبي صلى الله عليه وسلم : \" هذه اللقاح تغدو عليكم وتروح ، فاشربوا من أبوالها وألبانها \" قال : فبينا هم كذلك ، إذ جاءهم الصريخ ، فصرخ إلى رسول الله صلى الله عليه وسلم ، فقال : قتلوا الراعي ، واستاقوا النعم . فأمر النبي صلى الله عليه وسلم فنودي في الناس : أن \" يا خيل الله اركبي \" . قال : فركبوا لا ينتظر فارس فارسا ، قال : وركب رسول الله صلى الله عليه وسلم على أثرهم ، فلم يزالوا يطلبونهم حتى أدخلوهم مأمنهم ، فرجع صحابة رسول الله صلى الله عليه وسلم وقد أسروا منهم ، فأتوا بهم النبي صلى الله عليه وسلم ، فأنزل الله : ( إنما جزاء الذين يحاربون الله ورسوله ) الآية . قال : فكان نفيهم : أن نفوهم حتى أدخلوهم مأمنهم وأرضهم ، ونفوهم من أرض المسلمين . وقتل نبي الله صلى الله عليه وسلم منهم ، وصلب ، وقطع ، وسمر الأعين . قال : فما مثل رسول الله صلى الله عليه وسلم قبل ولا بعد . قال : ونهى عن المثلة ، قال : \" ولا تمثلوا بشيء \" قال : وكان أنس يقول ذلك ، غير أنه قال : أحرقهم بالنار بعد ما قتلهم .\nقال : وبعضهم يقول : هم ناس من بني سليم ومنهم عرينة ناس من بجيلة .\nوقد اختلف الأئمة في حكم هؤلاء العرنيين : هل هو منسوخ أو محكم؟ فقال بعضهم : هو منسوخ بهذه الآية ، وزعموا أن فيها عتابا للنبي صلى الله عليه وسلم كما في قوله [ تعالى ] ( عفا الله عنك لم أذنت لهم ) [ التوبة : 43 ] ومنهم من قال : هو منسوخ بنهي النبي صلى الله عليه وسلم عن المثلة . وهذا القول فيه نظر ، ثم صاحبه مطالب ببيان تأخر الناسخ الذي ادعاه عن المنسوخ . وقال بعضهم : كان هذا قبل أن تنزل الحدود ، قاله محمد بن سيرين وفي هذا نظر ، فإن قصتهم متأخرة ، وفي رواية جرير بن عبد الله لقصتهم ما يدل على تأخرها فإنه أسلم بعد نزول المائدة . ومنهم من قال : لم يسمل النبي صلى الله عليه وسلم أعينهم ، وإنما عزم على ذلك ، حتى نزل القرآن فبين حكم المحاربين . وهذا القول أيضا فيه نظر ; فإنه قد تقدم في الحديث المتفق عليه أنه سمل - وفي رواية : سمر - أعينهم .\nوقال ابن جرير : حدثنا علي بن سهل حدثنا الوليد بن مسلم قال : ذاكرت الليث بن سعد ما كان من سمل النبي صلى الله عليه وسلم أعينهم ، وتركه حسمهم حتى ماتوا ، قال : سمعت محمد بن عجلان يقول : أنزلت هذه الآية على رسول الله صلى الله عليه وسلم معاتبة في ذلك ، وعلمه عقوبة مثلهم : من القتل والقطع والنفي ، ولم يسمل بعدهم غيرهم . قال : وكان هذا القول ذكر لأبي عمرو - يعني الأوزاعي - فأنكر أن يكون نزلت معاتبة ، وقال : بل كانت عقوبة أولئك النفر بأعيانهم ، ثم نزلت هذه الآية في عقوبة غيرهم ممن حارب بعدهم ، ورفع عنهم السمل .\nثم قد احتج بعموم هذه الآية جمهور العلماء في ذهابهم إلى أن المحاربة في الأمصار وفي السبلان على السواء لقوله : ( ويسعون في الأرض فسادا ) وهذا مذهب مالك والأوزاعي والليث بن سعد والشافعي أحمد بن حنبل حتى قال مالك - في الذي يغتال الرجل فيخدعه حتى يدخله بيتا فيقتله ، ويأخذ ما معه - : إن هذا محاربة ، ودمه إلى السلطان لا [ إلى ] ولي المقتول ، ولا اعتبار بعفوه عنه في إنفاذ القتل .\nوقال أبو حنيفة وأصحابه : لا تكون المحاربة إلا في الطرقات ، فأما في الأمصار فلا ; لأنه يلحقه الغوث إذا استغاث ، بخلاف الطريق لبعده ممن يغيثه ويعينه . [ والله أعلم ]\nوأما قوله : ( أن يقتلوا أو يصلبوا أو تقطع أيديهم وأرجلهم من خلاف أو ينفوا من الأرض ) الآية : قال [ علي ] بن أبي طلحة عن ابن عباس في [ قوله : ( إنما جزاء الذين يحاربون الله ورسوله ) ] الآية [ قال ] من شهر السلاح في قبة الإسلام ، وأخاف السبيل ، ثم ظفر به وقدر عليه ، فإمام المسلمين فيه بالخيار : إن شاء قتله ، وإن شاء صلبه ، وإن شاء قطع يده ورجله .\nوكذا قال سعيد بن المسيب ومجاهد وعطاء والحسن البصري وإبراهيم النخعي والضحاك . وروى ذلك كله أبو جعفر بن جرير وحكي مثله عن مالك بن أنس رحمه الله . ومستند هذا القول أن ظاهر \" أو \" للتخيير ، كما في نظائر ذلك من القرآن ، كقوله في جزاء الصيد : ( فجزاء مثل ما قتل من النعم يحكم به ذوا عدل منكم هديا بالغ الكعبة أو كفارة طعام مساكين أو عدل ذلك صياما ) [ المائدة : 95 ] وقوله في كفارة الترفه : ( فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك ) [ البقرة : 196 ] وكقوله في كفارة اليمين : ( إطعام عشرة مساكين من أوسط ما تطعمون أهليكم أو كسوتهم أو تحرير رقبة ) [ المائدة : 89 ] . [ و ] هذه كلها على التخيير ، فكذلك فلتكن هذه الآية . وقال الجمهور : هذه الآية منزلة على أحوال كما قال أبو عبد الله الشافعي [ رحمه الله ] أنبأنا إبراهيم - هو ابن أبي يحيى - عن صالح مولى التوأمة عن ابن عباس في قطاع الطريق : إذا قتلوا وأخذوا المال قتلوا وصلبوا ، وإذا قتلوا ولم يأخذوا المال قتلوا ولم يصلبوا ، وإذا أخذوا المال ولم يقتلوا قطعت أيديهم وأرجلهم من خلاف ، وإذا أخافوا السبيل ولم يأخذوا مالا نفوا من الأرض .\nوقد رواه ابن أبي شيبة عن عبد الرحيم بن سليمان عن حجاج عن عطية عن ابن عباس بنحوه . وعن أبي مجلز وسعيد بن جبير وإبراهيم النخعي والحسن وقتادة والسدي وعطاء الخراساني نحو ذلك . وهكذا قال غير واحد من السلف والأئمة .\nواختلفوا : هل يصلب حيا ويترك حتى يموت بمنعه من الطعام والشراب ، أو بقتله برمح ونحوه ، أو يقتل أولا ثم يصلب تنكيلا وتشديدا لغيره من المفسدين ؟ وهل يصلب ثلاثة أيام ثم ينزل ، أو يترك حتى يسيل صديده؟ في ذلك كله خلاف محرر في موضعه ، وبالله الثقة وعليه التكلان .\nويشهد لهذا التفصيل الحديث الذي رواه ابن جرير في تفسيره - إن صح سنده - فقال :\nحدثنا علي بن سهل حدثنا الوليد بن مسلم عن ابن لهيعة عن يزيد بن أبي حبيب أن عبد الملك بن مروان كتب إلى أنس [ بن مالك ] يسأله عن هذه الآية ، فكتب إليه يخبره أن هذه الآية نزلت في أولئك النفر العرنيين - وهم من بجيلة - قال أنس : فارتدوا عن الإسلام ، وقتلوا الراعي ، واستاقوا الإبل ، وأخافوا السبيل ، وأصابوا الفرج الحرام . قال أنس : فسأل رسول الله صلى الله عليه وسلم جبريل - عليه السلام - عن القضاء فيمن حارب ، فقال : من سرق وأخاف السبيل فاقطع يده بسرقته ، ورجله بإخافته ، ومن قتل فاقتله ، ومن قتل وأخاف السبيل واستحل الفرج الحرام ، فاصلبه .\nوأما قوله تعالى : ( أو ينفوا من الأرض ) قال بعضهم : هو أن يطلب حتى يقدر عليه ، فيقام عليه الحد أو يهرب من دار الإسلام .\nرواه ابن جرير عن ابن عباس وأنس بن مالك وسعيد بن جبير والضحاك والربيع بن أنس والزهري والليث بن سعد ومالك بن أنس .\nوقال آخرون : هو أن ينفى من بلده إلى بلد آخر ، أو يخرجه السلطان أو نائبه من معاملته بالكلية ، وقال الشعبي : ينفيه - كما قال ابن هبيرة - من عمله كله . وقال عطاء الخراساني : ينفى من جند إلى جند سنين ، ولا يخرج من أرض الإسلام .\nوكذا قال سعيد بن جبير وأبو الشعثاء والحسن والزهري والضحاك ومقاتل بن حيان : إنه ينفى ولا يخرج من أرض الإسلام .\nوقال آخرون : المراد بالنفي هاهنا السجن ، وهو قول أبي حنيفة وأصحابه ، واختار ابن جرير : أن المراد بالنفي هاهنا : أن يخرج من بلده إلى بلد آخر فيسجن فيه .\nوقوله : ( ذلك لهم خزي في الدنيا ولهم في الآخرة عذاب عظيم ) أي : هذا الذي ذكرته من قتلهم ، ومن صلبهم ، وقطع أيديهم وأرجلهم من خلاف ، ونفيهم - خزي لهم بين الناس في هذه الحياة الدنيا ، مع ما ادخر الله لهم من العذاب العظيم يوم القيامة ، وهذا قد يتأيد به من ذهب إلى أن هذه الآية نزلت في المشركين ، فأما أهل الإسلام فقد ثبت في الصحيح عند مسلم عن عبادة بن الصامت قال : أخذ علينا رسول الله صلى الله عليه وسلم كما أخذ على النساء : ألا نشرك بالله شيئا : ولا نسرق ، ولا نزني ، ولا نقتل أولادنا ولا يعضه بعضنا بعضا ، فمن وفى منكم فأجره على الله ، ومن أصاب من ذلك شيئا فعوقب فهو كفارة له ، ومن ستره الله فأمره إلى الله ، إن شاء عذبه وإن شاء غفر له\nوعن علي [ رضي الله عنه ] قال : قال رسول الله صلى الله عليه وسلم : \" من أذنب ذنبا في الدنيا ، فعوقب به ، فالله أعدل من أن يثني عقوبته على عبده ، ومن أذنب ذنبا في الدنيا فستره الله عليه وعفا عنه ، فالله أكرم من أن يعود في شيء قد عفا عنه \" .\nرواه الإمام أحمد والترمذي وابن ماجه وقال الترمذي : \" حسن غريب \" . وقد سئل الحافظ الدارقطني عن هذا الحديث ، فقال : روي مرفوعا وموقوفا ، قال : ورفعه صحيح .\nوقال ابن جرير في قوله : ( ذلك لهم خزي في الدنيا ) يعني : شر وعار ونكال وذلة وعقوبة في عاجل الدنيا قبل الآخرة ، ( ولهم في الآخرة عذاب عظيم ) أي : إذا لم يتوبوا من فعلهم ذلك حتى هلكوا - في الآخرة مع الجزاء الذي جازيتهم به في الدنيا ، والعقوبة التي عاقبتهم بها فيها - ( عذاب عظيم ) يعني : عذاب جهنم .\n                                    ",
        "qortoby": "إِنَّمَا جَزَٰٓؤُاْ ٱلَّذِينَ يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُۥ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادًا أَن يُقَتَّلُوٓاْ أَوۡ يُصَلَّبُوٓاْ أَوۡ تُقَطَّعَ أَيۡدِيهِمۡ وَأَرۡجُلُهُم مِّنۡ خِلَٰفٍ أَوۡ يُنفَوۡاْ مِنَ ٱلۡأَرۡضِۚ ذَٰلِكَ لَهُمۡ خِزۡيٞ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٌ ٣٣\n                                    \n                                    \n                                    قوله : إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا أو تقطع أيديهم وأرجلهم من خلاف أو ينفوا من الأرض ذلك لهم خزي في الدنيا ولهم في الآخرة عذاب عظيم\nفيها أربعة عشرة مسألة :\nالأولى : اختلف الناس في سبب نزول هذه الآية ; فالذي عليه الجمهور أنها نزلت في العرنيين ; روى الأئمة واللفظ لأبي داود عن أنس بن مالك : أن قوما من عكل - أو قال من عرينة - قدموا على رسول الله صلى الله عليه وسلم فاجتووا المدينة ; فأمر لهم رسول الله صلى الله عليه وسلم بلقاح وأمرهم أن يشربوا من أبوالها وألبانها فانطلقوا ، فلما صحوا قتلوا راعي النبي صلى الله عليه وسلم واستاقوا النعم ; فبلغ النبي صلى الله عليه وسلم خبرهم من أول النهار فأرسل في آثارهم ; فما ارتفع النهار حتى جيء بهم ; فأمر بهم فقطعت أيديهم وأرجلهم وسمر أعينهم وألقوا في الحرة يستسقون فلا يسقون . قال أبو قلابة : فهؤلاء قوم سرقوا وقتلوا وكفروا بعد إيمانهم وحاربوا الله ورسوله ، وفي رواية : فأمر بمسامير فأحميت فكحلهم وقطع أيديهم وأرجلهم وما حسمهم ; وفي رواية : فبعث رسول الله صلى الله عليه وسلم في طلبهم قافة فأتي بهم قال : فأنزل الله تبارك وتعالى في ذلك : إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا الآية ، وفي رواية قال أنس : فلقد رأيت أحدهم يكدم الأرض بفيه عطشا حتى ماتوا ، وفي البخاري قال جرير بن عبد الله في حديث : فبعثني رسول الله صلى الله عليه وسلم في نفر من المسلمين حتى أدركناهم وقد أشرفوا على بلادهم ، فجئنا بهم إلى رسول الله صلى الله عليه وسلم . قال جرير : فكانوا يقولون الماء ، ويقول رسول الله صلى الله عليه وسلم : النار ، وقد حكى أهل التواريخ والسير : أنهم قطعوا يدي الراعي ورجليه ، وغرزوا الشوك في عينيه حتى مات ، وأدخل المدينة ميتا ، وكان اسمه يسار وكان نوبيا ، وكان هذا الفعل من المرتدين سنة ست من الهجرة ، وفي بعض الروايات عن أنس : أن رسول الله صلى الله عليه وسلم أحرقهم بالنار بعدما قتلهم . وروي عن ابن عباس والضحاك : أنها نزلت بسبب قوم من أهل الكتاب كان بينهم وبين رسول الله صلى الله عليه وسلم عهد فنقضوا العهد وقطعوا السبيل وأفسدوا في الأرض ، وفي مصنف أبي داود عن ابن عباس قال : إنما جزاء الذين يحاربون الله ورسوله إلى قوله : غفور رحيم نزلت هذه الآية في المشركين فمن أخذ منهم قبل أن يقدر عليه لم يمنعه ذلك أن يقام عليه الحد الذي أصابه ، وممن قال : إن الآية نزلت في المشركين عكرمة والحسن ، وهذا ضعيف يرده قوله تعالى : قل للذين كفروا إن ينتهوا يغفر لهم ما قد سلف ، وقوله عليه الصلاة والسلام : الإسلام يهدم ما قبله أخرجه مسلم ; والصحيح الأول لنصوص الأحاديث الثابتة في ذلك . وقال مالك والشافعي وأبو ثور وأصحاب الرأي : الآية نزلت فيمن خرج من المسلمين يقطع السبيل ويسعى في الأرض بالفساد . قال ابن المنذر : قول مالك صحيح ، وقال أبو ثور محتجا لهذا القول : وفي الآية دليل على أنها نزلت في غير أهل الشرك ; وهو قوله جل ثناؤه : إلا الذين تابوا من قبل أن تقدروا عليهم وقد أجمعوا على أن أهل الشرك إذا وقعوا في أيدينا فأسلموا أن دماءهم تحرم ; فدل ذلك على أن الآية نزلت في أهل الإسلام ، وحكى الطبري عن بعض أهل العلم : أن هذه الآية نسخت فعل النبي صلى الله عليه وسلم في العرنيين ، فوقف الأمر على هذه الحدود ، وروى محمد بن سيرين قال : كان هذا قبل أن تنزل الحدود ; يعني حديث أنس ; ذكره أبو داود ، وقال قوم منهم الليث بن سعد : ما فعله النبي صلى الله عليه وسلم بوفد عرينة نسخ ; إذ لا يجوز التمثيل بالمرتد . قال أبو الزناد : إن رسول الله صلى الله عليه وسلم لما قطع الذين سرقوا لقاحه وسمل أعينهم بالنار عاتبه الله عز وجل في ذلك ; فأنزل الله تعالى في ذلك إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا الآية . أخرجه أبو داود . قال أبو الزناد : فلما وعظ ونهي عن المثلة لم يعد . وحكي عن جماعة أن هذه الآية ليست بناسخة لذلك الفعل ; لأن ذلك وقع في مرتين ، لا سيما وقد ثبت في صحيح مسلم وكتاب النسائي وغيرهما قال : إنما سمل النبي صلى الله عليه وسلم أعين أولئك لأنهم سملوا أعين الرعاة ; فكان هذا قصاصا ، وهذه الآية في المحارب المؤمن .\nقلت : وهذا قول حسن ، وهو معنى ما ذهب إليه مالك والشافعي ; ولذلك قال الله تعالى : إلا الذين تابوا من قبل أن تقدروا عليهم ومعلوم أن الكفار لا تختلف أحكامهم في زوال العقوبة عنهم بالتوبة بعد القدرة كما تسقط قبل القدرة ، والمرتد يستحق القتل بنفس الردة - دون المحاربة - ولا ينفى ولا تقطع يده ولا رجله ولا يخلى سبيله بل يقتل إن لم يسلم ، ولا يصلب أيضا ; فدل أن ما اشتملت عليه الآية ما عني به المرتد ، وقال تعالى في حق الكفار : قل للذين كفروا إن ينتهوا يغفر لهم ما قد سلف . وقال في المحاربين : إلا الذين تابوا الآية ; وهذا بين ، وعلى ما قررناه في أول الباب لا إشكال ولا لوم ولا عتاب إذ هو مقتضى الكتاب ; قال الله تعالى : فمن اعتدى عليكم فاعتدوا عليه بمثل ما اعتدى عليكم فمثلوا فمثل بهم ، إلا أنه يحتمل أن يكون العتاب إن صح على الزيادة في القتل ، وذلك تكحيلهم بمسامير محماة وتركهم عطاشى حتى ماتوا ، والله أعلم ، وحكى الطبري عن السدي : أن النبي صلى الله عليه وسلم لم يسمل أعين العرنيين وإنما أراد ذلك ; فنزلت الآية ناهية عن ذلك ، وهذا ضعيف جدا ; فإن الأخبار الثابتة وردت بالسمل ; وفي صحيح البخاري : فأمر بمسامير فأحميت فكحلهم ، ولا خلاف بين أهل العلم أن حكم هذه الآية مترتب في المحاربين من أهل الإسلام وإن كانت نزلت في المرتدين أو اليهود ، وفي قوله تعالى : إنما جزاء الذين يحاربون الله ورسوله استعارة ومجاز ; إذ الله سبحانه وتعالى لا يحارب ولا يغالب لما هو عليه من صفات الكمال ، ولما وجب له من التنزيه عن الأضداد والأنداد ، والمعنى : يحاربون أولياء الله ; فعبر بنفسه العزيزة عن أوليائه إكبارا لإذايتهم ، كما عبر بنفسه عن الفقراء الضعفاء في قوله : من ذا الذي يقرض الله قرضا حسنا حثا على الاستعطاف عليهم ; ومثله في صحيح السنة استطعمتك فلم تطعمني . الحديث أخرجه مسلم ، وقد تقدم في \" البقرة \" .\nالثانية : واختلف العلماء فيمن يستحق اسم المحاربة ; فقال مالك : المحارب عندنا من حمل على الناس في مصر أو في برية وكابرهم عن أنفسهم وأموالهم دون نائرة ولا ذحل ولا عداوة ; قال ابن المنذر : اختلف عن مالك في هذه المسألة ، فأثبت المحاربة في المصر مرة ونفى ذلك مرة ; وقالت طائفة : حكم ذلك في المصر أو في المنازل والطرق وديار أهل البادية والقرى سواء وحدودهم واحدة ; وهذا قول الشافعي وأبي ثور ; قال ابن المنذر : كذلك هو لأن كلا يقع عليه اسم المحاربة ، والكتاب على العموم ، وليس لأحد أن يخرج من جملة الآية قوما بغير حجة ، وقالت طائفة : لا تكون المحاربة في المصر إنما تكون خارجا عن المصر ; هذا قول سفيان الثوري وإسحاق والنعمان ، والمغتال كالمحارب وهو الذي يحتال في قتل إنسان على أخذ ماله ، وإن لم يشهر السلاح لكن دخل عليه بيته أو صحبه في سفر فأطعمه سما فقتله فيقتل حدا لا قودا .\nالثالثة : واختلفوا في حكم المحارب ; فقالت طائفة : يقام عليه بقدر فعله ; فمن أخاف السبيل وأخذ المال قطعت يده ورجله من خلاف ، وإن أخذ المال وقتل قطعت يده ورجله ثم صلب ، فإذا قتل ولم يأخذ المال قتل ، وإن هو لم يأخذ المال ولم يقتل نفي ; قاله ابن عباس ، وروي عن أبي مجلز والنخعي وعطاء الخراساني وغيرهم ، وقال أبو يوسف : إذا أخذ المال وقتل صلب وقتل على الخشبة ; قال الليث : بالحربة مصلوبا . وقال أبو حنيفة : إذا قتل قتل ، وإذا أخذ المال ولم يقتل قطعت يده ورجله من خلاف ، وإذا أخذ المال وقتل فالسلطان مخير فيه ، إن شاء قطع يده ورجله وإن شاء لم يقطع وقتله وصلبه ; قال أبو يوسف : القتل يأتي على كل شيء ، ونحوه قول الأوزاعي ، وقال الشافعي : إذا أخذ المال قطعت يده اليمنى وحسمت ، ثم قطعت رجله اليسرى وحسمت وخلي ; لأن هذه الجناية زادت على السرقة بالحرابة ، وإذا قتل قتل ، وإذا أخذ المال وقتل قتل وصلب ; وروي عنه أنه قال : يصلب ثلاثة أيام ; قال : وإن حضر وكثر وهيب وكان ردءا للعدو حبس ، وقال أحمد : إن قتل قتل ، وإن أخذ المال قطعت يده ورجله كقول الشافعي ، وقال قوم : لا ينبغي أن يصلب قبل القتل فيحال بينه وبين الصلاة والأكل والشرب ; وحكي عن الشافعي : أكره أن يقتل مصلوبا لنهي رسول الله صلى الله عليه وسلم عن المثلة ، وقال أبو ثور : الإمام مخير على ظاهر الآية ، وكذلك قال مالك ، وهو مروي عن ابن عباس ، وهو قول سعيد بن المسيب وعمر بن عبد العزيز ومجاهد والضحاك والنخعي كلهم قال : الإمام مخير في الحكم على المحاربين ، يحكم عليهم بأي الأحكام التي أوجبها الله تعالى من القتل والصلب أو القطع أو النفي بظاهر الآية ; قال ابن عباس : ما كان في القرآن \" أو \" فصاحبه بالخيار ; وهذا القول أشعر بظاهر الآية ; فإن أهل القول الأول الذين قالوا إن \" أو \" للترتيب وإن اختلفوا - فإنك تجد أقوالهم أنهم يجمعون عليه حدين فيقولون : يقتل ويصلب ; ويقول بعضهم : يصلب ويقتل ; ويقول بعضهم : تقطع يده ورجله وينفى ; وليس كذلك الآية ولا معنى \" أو \" في اللغة ; قال النحاس ، واحتج الأولون بما ذكره الطبري عن أنس بن مالك أنه قال : سأل رسول الله صلى الله عليه وسلم جبريل عليه السلام عن الحكم في المحارب فقال : \" من أخاف السبيل وأخذ المال فاقطع يده للأخذ ورجله للإخافة ومن قتل فاقتله ومن جمع ذلك فاصلبه \" . قال ابن عطية : وبقي النفي للمخيف فقط ، والمخيف في حكم القاتل ، ومع ذلك فمالك يرى فيه الأخذ بأيسر العذاب والعقاب استحسانا .\nالرابعة : قوله تعالى : أو ينفوا من الأرض اختلف في معناه ; فقال السدي : هو أن يطلب أبدا بالخيل والرجل حتى يؤخذ فيقام عليه حد الله ، أو يخرج من دار الإسلام هربا ممن يطلبه ; عن ابن عباس وأنس بن مالك ومالك بن أنس والحسن والسدي والضحاك وقتادة وسعيد بن جبير والربيع بن أنس والزهري . حكاه الرماني في كتابه ; وحكي عن الشافعي أنهم يخرجون من بلد إلى بلد ، ويطلبون لتقام عليهم الحدود ; وقال الليث بن سعد والزهري أيضا ، وقال مالك أيضا : ينفى من البلد الذي أحدث فيه هذا إلى غيره ويحبس فيه كالزاني .\nوقال مالك أيضا والكوفيون : نفيهم سجنهم فينفى من سعة الدنيا إلى ضيقها ، فصار كأنه إذا سجن فقد نفي من الأرض إلا من موضع استقراره ; واحتجوا بقول بعض أهل السجون في ذلك :\nخرجنا من الدنيا ونحن من أهلها فلسنا من الأموات فيها ولا الأحيا إذا جاءنا السجان يوما لحاجة\nعجبنا وقلنا جاء هذا من الدنيا\nحكى مكحول أن عمر بن الخطاب رضي الله عنه أول من حبس في السجون وقال : أحبسه حتى أعلم منه التوبة ، ولا أنفيه من بلد إلى بلد فيؤذيهم ; والظاهر أن الأرض في الآية هي أرض النازلة وقد تجنب الناس قديما الأرض التي أصابوا فيها الذنوب ; ومنه الحديث الذي ناء بصدره نحو الأرض المقدسة ، وينبغي للإمام إن كان هذا المحارب مخوف الجانب يظن أنه يعود إلى حرابة أو إفساد أن يسجنه في البلد الذي يغرب إليه ، وإن كان غير مخوف الجانب فظن أنه لا يعود إلى جناية سرح ; قال ابن عطية : وهذا صريح مذهب مالك أن يغرب ويسجن حيث يغرب ، وهذا على الأغلب في أنه مخوف ، ورجحه الطبري وهو الواضح ; لأن نفيه من أرض النازلة هو نص الآية ، وسجنه بعد بحسب الخوف منه ، فإن تاب وفهمت حاله سرح .\nالخامسة : قوله تعالى : أو ينفوا من الأرض النفي أصله الإهلاك ; ومنه الإثبات والنفي ، فالنفي الإهلاك بالإعدام ; ومنه النفاية لردي المتاع ; ومنه النفي لما تطاير من الماء عن الدلو .\nقال الراجز :\nكأن متنيه من النفي مواقع الطير على الصفي\nالسادسة : قال ابن خويز منداد : ولا يراعى المال الذي يأخذه المحارب نصابا كما يراعى في السارق ، وقد قيل : يراعى في ذلك النصاب ربع دينار ; قال ابن العربي ، قال الشافعي وأصحاب الرأي : لا يقطع من قطاع الطريق إلا من أخذ قدر ما تقطع فيه يد السارق ; وقال مالك : يحكم عليه بحكم المحارب وهو الصحيح ; فإن الله تعالى وقت على لسان نبيه عليه الصلاة والسلام القطع في السرقة في ربع دينار ، ولم يوقت في الحرابة شيئا ، بل ذكر جزاء المحارب ، فاقتضى ذلك توفية الجزاء لهم على المحاربة عن حبة ; ثم إن هذا قياس أصل على أصل وهو مختلف فيه ، وقياس الأعلى بالأدنى والأدنى بالأسفل وذلك عكس القياس . وكيف يصح أن يقاس المحارب على السارق وهو يطلب خطف المال فإن شعر به فر ; حتى إن السارق إذا دخل بالسلاح يطلب المال فإن منع منه أو صيح عليه وحارب عليه فهو محارب حكم عليه بحكم المحارب . قال القاضي ابن العربي : كنت في أيام حكمي بين الناس إذا جاءني أحد بسارق ، وقد دخل الدار بسكين يحبسه على قلب صاحب الدار وهو نائم ، وأصحابه يأخذون مال الرجل ، حكمت فيهم بحكم المحاربين ، فافهموا هذا من أصل الدين ، وارتفعوا إلى يفاع العلم عن حضيض الجاهلين .\nقلت : اليفع أعلى الجبل ومنه غلام يفعة إذا ارتفع إلى البلوغ ; والحضيض الحفرة في أسفل الوادي ; كذا قال أهل اللغة .\nالسابعة : ولا خلاف في أن الحرابة يقتل فيها من قتل وإن لم يكن المقتول مكافئا للقاتل ; وللشافعي قولان :\nأحدهما : أنها تعتبر المكافأة لأنه قتل فاعتبر فيه المكافأة كالقصاص ; وهذا ضعيف ; لأن القتل هنا ليس على مجرد القتل وإنما هو على الفساد العام من التخويف وسلب المال ; قال الله تعالى : إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا فأمر تعالى بإقامة الحدود على المحارب إذا جمع شيئين محاربة وسعيا في الأرض بالفساد ، ولم يخص شريفا من وضيع ، ولا رفيعا من دنيء .\nالثامنة : وإذا خرج المحاربون فاقتتلوا مع القافلة فقتل بعض المحاربين ولم يقتل بعض قتل الجميع . وقال الشافعي : لا يقتل إلا من قتل ; وهذا أيضا ضعيف ; فإن من حضر الوقيعة شركاء في الغنيمة وإن لم يقتل جميعهم ; وقد اتفق معنا على قتل الردء وهو الطليعة ، فالمحارب أولى .\nالتاسعة : وإذا أخاف المحاربون السبيل وقطعوا الطريق وجب على الإمام قتالهم من غير أن يدعوهم ، ووجب على المسلمين التعاون على قتالهم وكفهم عن أذى المسلمين ، فإن انهزموا لم يتبع منهم مدبرا إلا أن يكون قد قتل وأخذ مالا ، فإن كان كذلك أتبع ليؤخذ ويقام عليه ما وجب لجنايته ; ولا يذفف منهم على جريح إلا أن يكون قد قتل ; فإن أخذوا ووجد في أيديهم مال لأحد بعينه رد إليه أو إلى ورثته ، وإن لم يوجد له صاحب جعل في بيت المال ; وما أتلفوه من مال لأحد غرموه ; ولا دية لمن قتلوا إذا قدر عليهم قبل التوبة ، فإن تابوا وجاءوا تائبين وهي :\nالعاشرة : لم يكن للإمام عليهم سبيل ، وسقط عنهم ما كان حدا لله وأخذوا بحقوق الآدميين ، فاقتص منهم من النفس والجراح ، وكان عليهم ما أتلفوه من مال ودم لأوليائه في ذلك ، ويجوز لهم العفو والهبة كسائر الجناة من غير المحاربين ; هذا مذهب مالك والشافعي وأبي ثور وأصحاب الرأي . وإنما أخذ ما بأيديهم من الأموال وضمنوا قيمة ما استهلكوا ; لأن ذلك غصب فلا يجوز ملكه لهم ، ويصرف إلى أربابه أو يوقفه الإمام عنده حتى يعلم صاحبه ، وقال قوم من الصحابة والتابعين : لا يطلب من المال إلا بما وجد عنده ، وأما ما استهلكه فلا يطالب به ; وذكر الطبري ذلك عن مالك من رواية الوليد بن مسلم عنه ، وهو الظاهر من فعل علي بن أبي طالب رضي الله عنه بحارثة بن بدر الغداني فإنه كان محاربا ثم تاب قبل القدرة عليه ، فكتب له بسقوط الأموال والدم عنه كتابا منشورا ; قال ابن خويز منداد : واختلفت الرواية عن مالك في المحارب إذا أقيم عليه الحد ولم يوجد له مال ; هل يتبع دينا بما أخذ ، أو يسقط عنه كما يسقط عن السارق ؟ والمسلم والذمي في ذلك سواء .\nالحادية عشرة : وأجمع أهل العلم على أن السلطان ولي من حارب ; فإن قتل محارب أخا امرئ أو أباه في حال المحاربة ، فليس إلى طالب الدم من أمر المحارب شيء ، ولا يجوز عفو ولي الدم ، والقائم بذلك الإمام ; جعلوا ذلك بمنزلة حد من حدود الله تعالى .\nقلت : فهذه جملة من أحكام المحاربين جمعنا غررها ، واجتلبنا دررها ; ومن أغرب ما قيل في تفسيرها وهي :\nالثانية عشرة : تفسير مجاهد لها ; المراد بالمحاربة في هذه الآية الزنى والسرقة ; وليس بصحيح ; فإن الله سبحانه بين في كتابه وعلى لسان نبيه أن السارق تقطع يده ، وأن الزاني يجلد ويغرب إن كان بكرا ، ويرجم إن كان ثيبا محصنا ، وأحكام المحارب في هذه الآية مخالف لذلك ، اللهم إلا أن يريد إخافة الطريق بإظهار السلاح قصدا للغلبة على الفروج ، فهذا أفحش المحاربة ، وأقبح من أخذ الأموال وقد دخل في معنى قوله تعالى : ويسعون في الأرض فسادا .\nالثالثة عشرة : قال علماؤنا : ويناشد اللص بالله تعالى ، فإن كف ترك وإن أبى قوتل ، فإن أنت قتلته فشر قتيل ودمه هدر . روى النسائي عن أبي هريرة أن رجلا جاء إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله أرأيت إن عدي على مالي ؟ قال : فانشد بالله قال : فإن أبوا علي . قال : فانشد بالله قال : فإن أبوا علي قال : فانشد بالله قال : فإن أبوا علي قال : فقاتل فإن قتلت ففي الجنة وإن قتلت ففي النار وأخرجه البخاري ومسلم - وليس فيه ذكر المناشدة - عن أبي هريرة قال : جاء رجل إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله أرأيت إن جاء رجل يريد أخذ مالي ؟ قال : فلا تعطه مالك قال : أرأيت إن قاتلني ؟ قال : فقاتله قال : أرأيت إن قتلني ؟ قال : فأنت شهيد قال : فإن قتلته ؟ قال : هو في النار . قال ابن المنذر : وروينا عن جماعة من أهل العلم أنهم رأوا قتال اللصوص ودفعهم عن أنفسهم وأموالهم ; هذا مذهب ابن عمر والحسن البصري وإبراهيم النخعي وقتادة ومالك والشافعي وأحمد وإسحاق والنعمان ، وبهذا يقول عوام أهل العلم : إن للرجل أن يقاتل عن نفسه وأهله وماله إذا أريد ظلما ; للأخبار التي جاءت عن النبي صلى الله عليه وسلم لم يخص وقتا دون وقت ، ولا حالا دون حال إلا السلطان ; فإن جماعة أهل الحديث كالمجتمعين على أن من لم يمكنه أن يمنع عن نفسه وماله إلا بالخروج على السلطان ومحاربته أنه لا يحاربه ولا يخرج عليه ; للأخبار الدالة عن رسول الله صلى الله عليه وسلم ، التي فيها الأمر بالصبر على ما يكون منهم ، من الجور والظلم ، وترك قتالهم والخروج عليهم ما أقاموا الصلاة .\nقلت : وقد اختلف مذهبنا إذا طلب الشيء الخفيف كالثوب والطعام هل يعطونه أو يقاتلون ؟ وهذا الخلاف مبني على أصل ، وهو هل الأمر بقتالهم لأنه تغيير منكر أو هو من باب دفع الضرر ؟ وعلى هذا أيضا ينبني الخلاف في دعوتهم قبل القتال ، والله أعلم .\nالرابعة عشرة : قوله تعالى : ذلك لهم خزي في الدنيا لشناعة المحاربة وعظم ضررها ، وإنما كانت المحاربة عظيمة الضرر ; لأن فيها سد سبيل الكسب على الناس ، لأن أكثر المكاسب وأعظمها التجارات ، وركنها وعمادها الضرب في الأرض ; كما قال عز وجل : وآخرون يضربون في الأرض يبتغون من فضل الله فإذا أخيف الطريق انقطع الناس عن السفر ، واحتاجوا إلى لزوم البيوت ، فانسد باب التجارة عليهم ، وانقطعت أكسابهم ; فشرع الله على قطاع الطريق الحدود المغلظة ، وذلك الخزي في الدنيا ردعا لهم عن سوء فعلهم ، وفتحا لباب التجارة التي أباحها لعباده لمن أرادها منهم ، ووعد فيها بالعذاب العظيم في الآخرة . وتكون هذه المعصية خارجة عن المعاصي ، ومستثناة من حديث عبادة في قول النبي صلى الله عليه وسلم : فمن أصاب من ذلك شيئا فعوقب به في الدنيا فهو له كفارة والله أعلم ، ويحتمل أن يكون الخزي لمن عوقب ، وعذاب الآخرة لمن سلم في الدنيا ، ويجري هذا الذنب مجرى غيره . ولا خلود لمؤمن في النار على ما تقدم ، ولكن يعظم عقابه لعظم الذنب ، ثم يخرج إما بالشفاعة وإما بالقبضة ، ثم إن هذا الوعيد مشروط الإنفاذ بالمشيئة كقوله تعالى : ويغفر ما دون ذلك لمن يشاء أما إن الخوف يغلب عليهم بحسب الوعيد وكبر المعصية .\n                                    ",
        "saadi": "إِنَّمَا جَزَٰٓؤُاْ ٱلَّذِينَ يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُۥ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادًا أَن يُقَتَّلُوٓاْ أَوۡ يُصَلَّبُوٓاْ أَوۡ تُقَطَّعَ أَيۡدِيهِمۡ وَأَرۡجُلُهُم مِّنۡ خِلَٰفٍ أَوۡ يُنفَوۡاْ مِنَ ٱلۡأَرۡضِۚ ذَٰلِكَ لَهُمۡ خِزۡيٞ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٌ ٣٣\n                                        \n                                        \n                                        \n                                        المحاربون لله ولرسوله، هم الذين بارزوه بالعداوة، وأفسدوا في الأرض بالكفر والقتل، وأخذ الأموال، وإخافة السبل. والمشهور أن هذه الآية الكريمة في أحكام قطاع الطريق، الذين يعرضون للناس في القرى والبوادي، فيغصبونهم أموالهم، ويقتلونهم، ويخيفونهم، فيمتنع الناس من سلوك الطريق التي هم بها، فتنقطع بذلك. فأخبر الله أن جزاءهم ونكالهم -عند إقامة الحد عليهم- أن يفعل بهم واحد من هذه الأمور. واختلف المفسرون: هل ذلك على التخيير، وأن كل قاطع طريق يفعل به الإمام أو نائبه ما رآه المصلحة من هذه الأمور المذكورة؟ وهذا ظاهر اللفظ، أو أن عقوبتهم تكون بحسب جرائمهم، فكل جريمة لها قسط يقابلها، كما تدل عليه الآية بحكمتها وموافقتها لحكمة الله تعالى. وأنهم إن قتلوا وأخذوا مالًا تحتم قتلُهم وصلبهم، حتى يشتهروا ويختزوا ويرتدع غيرهم. وإن قتلوا ولم يأخذوا مالا تحتم قتلهم فقط. وإن أخذوا مالا ولم يقتلوا تحتم أن تقطع أيديهم وأرجلهم من خلاف، اليد اليمنى والرجل اليسرى. وإن أخافوا الناس ولم يقتلوا، ولا أخذوا مالا، نفوا من الأرض، فلا يتركون يأوون في بلد حتى تظهر توبتهم. وهذا قول ابن عباس رضي الله عنه وكثير من الأئمة، على اختلاف في بعض التفاصيل. { ذَلِكَ } النكال { لَهُمْ خِزْيٌ فِي الدُّنْيَا } أي: فضيحة وعار { وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ } فدل هذا أن قطع الطريق من أعظم الذنوب، موجب لفضيحة الدنيا وعذاب الآخرة، وأن فاعله محارب لله ولرسوله. وإذا كان هذا شأن عظم هذه الجريمة، علم أن تطهير الأرض من المفسدين، وتأمين السبل والطرق، عن القتل، وأخذ الأموال، وإخافة الناس، من أعظم الحسنات وأجل الطاعات، وأنه إصلاح في الأرض، كما أن ضده إفساد في الأرض.\n                                    "
      },
      "originalText": "إِنَّمَا جَزَٰٓؤُاْ ٱلَّذِينَ يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُۥ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادًا أَن يُقَتَّلُوٓاْ أَوۡ يُصَلَّبُوٓاْ أَوۡ تُقَطَّعَ أَيۡدِيهِمۡ وَأَرۡجُلُهُم مِّنۡ خِلَٰفٍ أَوۡ يُنفَوۡاْ مِنَ ٱلۡأَرۡضِۚ ذَٰلِكَ لَهُمۡ خِزۡيٞ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٌ ٣٣"
    },
    {
      "number": 703,
      "text": "إِلَّا الَّذِينَ تَابُوا مِنْ قَبْلِ أَنْ تَقْدِرُوا عَلَيْهِمْ ۖ فَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 34,
      "juz": 6,
      "manzil": 2,
      "page": 113,
      "ruku": 90,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّا ٱلَّذِينَ تَابُواْ مِن قَبۡلِ أَن تَقۡدِرُواْ عَلَيۡهِمۡۖ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٤٣\n                                    \n                                    \n                                    وقوله : ( إلا الذين تابوا من قبل أن تقدروا عليهم فاعلموا أن الله غفور رحيم ) أما على قول من قال : هي في أهل الشرك فظاهر ، وأما المحاربون المسلمون فإذا تابوا قبل القدرة عليهم ، فإنه يسقط عنهم انحتام القتل والصلب وقطع الرجل ، وهل يسقط قطع اليد أم لا؟ فيه قولان للعلماء .\nوظاهر الآية يقتضي سقوط الجميع ، وعليه عمل الصحابة ، كما قال ابن أبي حاتم : حدثنا أبو سعيد الأشج حدثنا أبو أسامة عن مجاهد عن الشعبي قال : كان حارثة بن بدر التميمي من أهل البصرة وكان قد أفسد في الأرض وحارب ، فكلم رجالا من قريش منهم : الحسن بن علي وابن عباس وعبد الله بن جعفر فكلموا عليا فلم يؤمنه . فأتى سعيد بن قيس الهمداني فخلفه في داره ، ثم أتى عليا فقال : يا أمير المؤمنين ، أرأيت من حارب الله ورسوله وسعى في الأرض فسادا ، فقرأ حتى بلغ : ( إلا الذين تابوا من قبل أن تقدروا عليهم ) قال : فكتب له أمانا . قال سعيد بن قيس : فإنه حارثة بن بدر .\nوكذا رواه ابن جرير من غير وجه ، عن مجاهد عن الشعبي به . وزاد : فقال حارثة بن بدر :\nألا أبلغن همدان إما لقيتها على النأي لا يسلم عدو يعيبها لعمر أبيها إن همدان تتقي ال\nإله ويقضي بالكتاب خطيبها\nوروى ابن جرير من طريق سفيان الثوري عن السدي - ومن طريق أشعث كلاهما عن عامر الشعبي قال : جاء رجل من مراد إلى أبي موسى وهو على الكوفة في إمارة عثمان رضي الله عنه ، بعدما صلى المكتوبة فقال : يا أبا موسى هذا مقام العائذ بك ، أنا فلان بن فلان المرادي وإني كنت حاربت الله ورسوله وسعيت في الأرض فسادا ، وإني تبت من قبل أن يقدر علي . فقام أبو موسى فقال : إن هذا فلان بن فلان ، وإنه كان حارب الله ورسوله ، وسعى في الأرض فسادا ، وإنه تاب من قبل أن يقدر عليه ، فمن لقيه فلا يعرض له إلا بخير ، فإن يك صادقا فسبيل من صدق ، وإن يك كاذبا تدركه ذنوبه ، فأقام الرجل ما شاء الله ، ثم إنه خرج فأدركه الله تعالى بذنوبه فقتله .\nثم قال ابن جرير : حدثني علي حدثنا الوليد بن مسلم قال : قال الليث وكذلك حدثني موسى بن إسحاق المدني وهو الأمير عندنا : أن عليا الأسدي حارب وأخاف السبيل وأصاب الدم والمال ، فطلبه الأئمة والعامة ، فامتنع ولم يقدر عليه ، حتى جاء تائبا ، وذلك أنه سمع رجلا يقرأ هذه الآية : ( قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم ) [ الزمر : 53 ] ، فوقف عليه فقال : يا عبد الله ، أعد قراءتها . فأعادها عليه ، فغمد سيفه ، ثم جاء تائبا . حتى قدم المدينة من السحر ، فاغتسل ، ثم أتى مسجد رسول الله صلى الله عليه وسلم فصلى الصبح ، ثم قعد إلى أبي هريرة في غمار أصحابه ، فلما أسفروا عرفه الناس ، فقاموا إليه ، فقال : لا سبيل لكم علي جئت تائبا من قبل أن تقدروا علي . فقال أبو هريرة : صدق . وأخذ بيده أبو هريرة حتى أتى مروان بن الحكم - وهو أمير على المدينة في زمن معاوية - فقال : هذا علي جاء تائبا ، ولا سبيل لكم عليه ولا قتل . قال : فترك من ذلك كله ، قال : وخرج علي تائبا مجاهدا في سبيل الله في البحر ، فلقوا الروم فقربوا سفينته إلى سفينة من سفنهم فاقتحم على الروم في سفينتهم ، فهربوا منه إلى شقها الآخر ، فمالت به وبهم ، فغرقوا جميعا .\n                                    ",
        "qortoby": "إِلَّا ٱلَّذِينَ تَابُواْ مِن قَبۡلِ أَن تَقۡدِرُواْ عَلَيۡهِمۡۖ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٤٣\n                                    \n                                    \n                                    قوله تعالى : إلا الذين تابوا من قبل أن تقدروا عليهم استثنى جل وعز التائبين قبل أن يقدر عليهم ، وأخبر بسقوط حقه عنهم بقوله : فاعلموا أن الله غفور رحيم . أما القصاص وحقوق الآدميين فلا تسقط ، ومن تاب بعد القدرة فظاهر الآية أن التوبة لا تنفع ، وتقام الحدود عليه كما تقدم ، وللشافعي قول إنه يسقط كل حد بالتوبة ، والصحيح من مذهبه أن ما تعلق به حق الآدمي قصاصا كان أو غيره فإنه لا يسقط بالتوبة قبل القدرة عليه ، وقيل : أراد بالاستثناء المشرك إذا تاب وآمن قبل القدرة عليه فإنه تسقط عنه الحدود ; وهذا ضعيف ; لأنه إن آمن بعد القدرة عليه لم يقتل أيضا بالإجماع ، وقيل : إنما لا يسقط الحد عن المحاربين بعد القدرة عليهم - والله أعلم - لأنهم متهمون بالكذب في توبتهم والتصنع فيها إذا نالتهم يد الإمام ، أو لأنه لما قدر عليهم صاروا بمعرض أن ينكل بهم فلم تقبل توبتهم ; كالمتلبس بالعذاب من الأمم قبلنا ، أو من صار إلى حال الغرغرة فتاب ; فأما إذا تقدمت توبتهم القدرة عليهم ، فلا تهمة وهي نافعة على ما يأتي بيانه في سورة \" يونس \" ; فأما الشراب والزناة والسراق إذا تابوا وأصلحوا وعرف ذلك منهم ، ثم رفعوا إلى الإمام فلا ينبغي له أن يحدهم ، وإن رفعوا إليه فقالوا تبنا لم يتركوا ، وهم في هذه الحال كالمحاربين إذا غلبوا ، والله أعلم .\n                                    ",
        "saadi": "إِلَّا ٱلَّذِينَ تَابُواْ مِن قَبۡلِ أَن تَقۡدِرُواْ عَلَيۡهِمۡۖ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٤٣\n                                        \n                                        \n                                        \n                                        { إِلَّا الَّذِينَ تَابُوا مِن قَبْلِ أَن تَقْدِرُوا عَلَيْهِمْ } أي: من هؤلاء المحاربين، { فَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ رَّحِيمٌ } أي: فيسقط عنه ما كان لله، من تحتم القتل والصلب والقطع والنفي، ومن حق الآدمي أيضا، إن كان المحارب كافرا ثم أسلم، فإن كان المحارب مسلما فإن حق الآدمي، لا يسقط عنه من القتل وأخذ المال. ودل مفهوم الآية على أن توبة المحارب -بعد القدرة عليه- أنها لا تسقط عنه شيئا، والحكمة في ذلك ظاهرة. وإذا كانت التوبة قبل القدرة عليه، تمنع من إقامة الحد في الحرابة، فغيرها من الحدود -إذا تاب من فعلها، قبل القدرة عليه- من باب أولى.\n                                    "
      },
      "originalText": "إِلَّا ٱلَّذِينَ تَابُواْ مِن قَبۡلِ أَن تَقۡدِرُواْ عَلَيۡهِمۡۖ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٤٣"
    },
    {
      "number": 704,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَابْتَغُوا إِلَيْهِ الْوَسِيلَةَ وَجَاهِدُوا فِي سَبِيلِهِ لَعَلَّكُمْ تُفْلِحُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 35,
      "juz": 6,
      "manzil": 2,
      "page": 113,
      "ruku": 91,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَٱبۡتَغُوٓاْ إِلَيۡهِ ٱلۡوَسِيلَةَ وَجَٰهِدُواْ فِي سَبِيلِهِۦ لَعَلَّكُمۡ تُفۡلِحُونَ ٥٣\n                                    \n                                    \n                                    يقول تعالى آمرا عباده المؤمنين بتقواه ، وهي إذا قرنت بالطاعة كان المراد بها الانكفاف عن المحارم وترك المنهيات ، وقد قال بعدها : ( وابتغوا إليه الوسيلة ) قال سفيان الثوري حدثنا أبي ، عن طلحة عن عطاء عن ابن عباس : أي القربة . وكذا قال مجاهد [ وعطاء ] وأبو وائل والحسن وقتادة وعبد الله بن كثير والسدي وابن زيد .\nوقال قتادة : أي تقربوا إليه بطاعته والعمل بما يرضيه . وقرأ ابن زيد : ( أولئك الذين يدعون يبتغون إلى ربهم الوسيلة ) [ الإسراء : 57 ] وهذا الذي قاله هؤلاء الأئمة لا خلاف بين المفسرين فيه وأنشد ابن جرير عليه قول الشاعر :\nإذا غفل الواشون عدنا لوصلنا وعاد التصافي بيننا والوسائل\nوالوسيلة : هي التي يتوصل بها إلى تحصيل المقصود ، والوسيلة أيضا : علم على أعلى منزلة في الجنة ، وهي منزلة رسول الله صلى الله عليه وسلم وداره في الجنة ، وهي أقرب أمكنة الجنة إلى العرش ، وقد ثبت في صحيح البخاري من طريق محمد بن المنكدر عن جابر بن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" من قال حين يسمع النداء : اللهم رب هذه الدعوة التامة ، والصلاة القائمة ، آت محمدا الوسيلة والفضيلة ، وابعثه مقاما محمودا الذي وعدته ، إلا حلت له الشفاعة يوم القيامة \" .\nحديث آخر في صحيح مسلم : من حديث كعب عن علقمة عن عبد الرحمن بن جبير عن عبد الله بن عمرو بن العاص أنه سمع النبي صلى الله عليه وسلم يقول : \" إذا سمعتم المؤذن فقولوا مثل ما يقول ، ثم صلوا علي ، فإنه من صلى علي صلاة صلى الله عليه بها عشرا ، ثم سلوا الله لي الوسيلة ، فإنها منزلة في الجنة ، لا تنبغي إلا لعبد من عباد الله ، وأرجو أن أكون أنا هو ، فمن سأل لي الوسيلة حلت عليه الشفاعة \"\nحديث آخر : قال الإمام أحمد : حدثنا عبد الرزاق أخبرنا سفيان عن ليث عن كعب عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : \" إذا صليتم علي فسلوا لي الوسيلة \" . قيل : يا رسول الله ، وما الوسيلة؟ قال : \" أعلى درجة في الجنة ، لا ينالها إلا رجل واحد وأرجو أن أكون أنا هو \" .\nورواه الترمذي عن بندار عن أبي عاصم عن سفيان - هو الثوري - عن ليث بن أبي سليم عن كعب قال : حدثني أبو هريرة به . ثم قال : غريب وكعب ليس بمعروف ، لا نعرف أحدا روى عنه غير ليث بن أبي سليم .\nطريق أخرى : عن أبي هريرة رضي الله عنه ، قال أبو بكر بن مردويه : حدثنا عبد الباقي بن قانع حدثنا محمد بن نصر الترمذي حدثنا عبد الحميد بن صالح حدثنا أبو شهاب عن ليث عن المعلى عن محمد بن كعب عن أبي هريرة رفعه قال : \" صلوا علي صلاتكم ، وسلوا الله لي الوسيلة \" . فسألوه وأخبرهم : \" أن الوسيلة درجة في الجنة ، ليس ينالها إلا رجل واحد ، وأرجو أن أكونه \" .\nحديث آخر : قال الحافظ أبو القاسم الطبراني : أخبرنا أحمد بن علي الأبار حدثنا الوليد بن عبد الملك الحراني حدثنا موسى بن أعين عن ابن أبي ذئب عن محمد بن عمرو بن عطاء عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : \" سلوا الله لي الوسيلة ، فإنه لم يسألها لي عبد في الدنيا إلا كنت له شهيدا - أو : شفيعا - يوم القيامة \" .\nثم قال الطبراني : \" لم يروه عن ابن أبي ذئب إلا موسى بن أعين \" . كذا قال ، وقد رواه ابن مردويه : حدثنا محمد بن علي بن دحيم حدثنا أحمد بن حازم حدثنا عبيد الله بن موسى حدثنا موسى بن عبيدة عن محمد بن عمرو بن عطاء فذكر بإسناده نحوه .\nحديث آخر : روى ابن مردويه بإسناده عن عمارة بن غزية عن موسى بن وردان : أنه سمع أبا سعيد الخدري يقول : قال رسول الله صلى الله عليه وسلم : \" إن الوسيلة درجة عند الله ، ليس فوقها درجة ، فسلوا الله أن يؤتيني الوسيلة على خلقه \" .\nحديث آخر : روى ابن مردويه أيضا من طريقين ، عن عبد الحميد بن بحر : حدثنا شريك عن أبي إسحاق عن الحارث عن علي عن النبي صلى الله عليه وسلم قال : \" في الجنة درجة تدعى الوسيلة ، فإذا سألتم الله فسلوا لي الوسيلة \" . قالوا : يا رسول الله ، من يسكن معك؟ قال : \" علي وفاطمة والحسن والحسين \" .\nهذا حديث غريب منكر من هذا الوجه\nوقال ابن أبي حاتم : حدثنا علي بن الحسين حدثنا الحسن الدشتكي حدثنا أبو زهير حدثنا سعد بن طريف عن علي بن الحسين الأزدي - مولى سالم بن ثوبان - قال : سمعت علي بن أبي طالب ينادي على منبر الكوفة : يا أيها الناس ، إن في الجنة لؤلؤتين : إحداهما بيضاء ، والأخرى صفراء ، أما الصفراء فإنها إلى بطنان العرش ، والمقام المحمود من اللؤلؤة البيضاء سبعون ألف غرفة ، كل بيت منها ثلاثة أميال ، وغرفها وأبوابها وأسرتها وكأنها من عرق واحد ، واسمها الوسيلة ، هي لمحمد صلى الله عليه وسلم وأهل بيته ، والصفراء فيها مثل ذلك ، هي لإبراهيم ، عليه السلام ، وأهل بيته .\nوهذا أثر غريب أيضا\nوقوله : ( وجاهدوا في سبيله لعلكم تفلحون ) لما أمرهم بترك المحارم وفعل الطاعات ، أمرهم بقتال الأعداء من الكفار والمشركين الخارجين عن الطريق المستقيم ، التاركين للدين القويم ، ورغبهم في ذلك بالذي أعده للمجاهدين في سبيله يوم القيامة ، من الفلاح والسعادة العظيمة الخالدة المستمرة التي لا تبيد ولا تحول ولا تزول في الغرف العالية الرفيعة الآمنة ، الحسنة مناظرها ، الطيبة مساكنها ، التي من سكنها ينعم لا ييأس ، ويحيا لا يموت ، لا تبلى ثيابه ، ولا يفنى شبابه .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَٱبۡتَغُوٓاْ إِلَيۡهِ ٱلۡوَسِيلَةَ وَجَٰهِدُواْ فِي سَبِيلِهِۦ لَعَلَّكُمۡ تُفۡلِحُونَ ٥٣\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا اتقوا الله وابتغوا إليه الوسيلة وجاهدوا في سبيله لعلكم تفلحون\nالأولى : قوله تعالى : يا أيها الذين آمنوا اتقوا الله وابتغوا إليه الوسيلة الوسيلة هي القربة عن أبي وائل والحسن ومجاهد وقتادة وعطاء والسدي وابن زيد وعبد الله بن كثير ، وهي فعيلة من توسلت إليه أي : تقربت ; قال عنترة :\nإن الرجال لهم إليك وسيلة إن يأخذوك تكحلي وتخضبي\nوالجمع الوسائل ; قال :\nإذا غفل الواشون عدنا لوصلنا وعاد التصافي بيننا والوسائل\nويقال : منه سلت أسأل أي : طلبت ، وهما يتساولان أي : يطلب كل واحد من صاحبه ; فالأصل الطلب ; والوسيلة القربة التي ينبغي أن يطلب بها ، والوسيلة درجة في الجنة ، وهي التي جاء الحديث الصحيح بها في قوله عليه الصلاة والسلام : فمن سأل لي الوسيلة حلت له الشفاعة .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَٱبۡتَغُوٓاْ إِلَيۡهِ ٱلۡوَسِيلَةَ وَجَٰهِدُواْ فِي سَبِيلِهِۦ لَعَلَّكُمۡ تُفۡلِحُونَ ٥٣\n                                        \n                                        \n                                        \n                                        هذا أمر من الله لعباده المؤمنين، بما يقتضيه الإيمان من تقوى الله والحذر من سخطه وغضبه، وذلك بأن يجتهد العبد، ويبذل غاية ما يمكنه من المقدور في اجتناب ما يَسخطه الله، من معاصي القلب واللسان والجوارح، الظاهرة والباطنة. ويستعين بالله على تركها، لينجو بذلك من سخط الله وعذابه. { وَابْتَغُوا إِلَيْهِ الْوَسِيلَةَ } أي: القرب منه، والحظوة لديه، والحب له، وذلك بأداء فرائضه القلبية، كالحب له وفيه، والخوف والرجاء، والإنابة والتوكل. والبدنية: كالزكاة والحج. والمركبة من ذلك كالصلاة ونحوها، من أنواع القراءة والذكر، ومن أنواع الإحسان إلى الخلق بالمال والعلم والجاه، والبدن، والنصح لعباد الله، فكل هذه الأعمال تقرب إلى الله. ولا يزال العبد يتقرب بها إلى الله حتى يحبه الله، فإذا أحبه كان سمعه الذي يسمع به، وبصره الذي يبصر به، ويده التي يبطش بها، ورجله التي يمشي [بها] ويستجيب الله له الدعاء. ثم خص تبارك وتعالى من العبادات المقربة إليه، الجهاد في سبيله، وهو: بذل الجهد في قتال الكافرين بالمال، والنفس، والرأي، واللسان، والسعي في نصر دين الله بكل ما يقدر عليه العبد، لأن هذا النوع من أجل الطاعات وأفضل القربات. ولأن من قام به، فهو على القيام بغيره أحرى وأولى { لَعَلَّكُمْ تُفْلِحُونَ } إذا اتقيتم الله بترك المعاصي، وابتغيتم الوسيلة إلى الله، بفعل الطاعات، وجاهدتم في سبيله ابتغاء مرضاته. والفلاح هو الفوز والظفر بكل مطلوب مرغوب، والنجاة من كل مرهوب، فحقيقته السعادة الأبدية والنعيم المقيم.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَٱبۡتَغُوٓاْ إِلَيۡهِ ٱلۡوَسِيلَةَ وَجَٰهِدُواْ فِي سَبِيلِهِۦ لَعَلَّكُمۡ تُفۡلِحُونَ ٥٣"
    },
    {
      "number": 705,
      "text": "إِنَّ الَّذِينَ كَفَرُوا لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لِيَفْتَدُوا بِهِ مِنْ عَذَابِ يَوْمِ الْقِيَامَةِ مَا تُقُبِّلَ مِنْهُمْ ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 36,
      "juz": 6,
      "manzil": 2,
      "page": 113,
      "ruku": 91,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ كَفَرُواْ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لِيَفۡتَدُواْ بِهِۦ مِنۡ عَذَابِ يَوۡمِ ٱلۡقِيَٰمَةِ مَا تُقُبِّلَ مِنۡهُمۡۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٦٣\n                                    \n                                    \n                                    ثم أخبر تعالى بما أعد لأعدائه الكفار من العذاب والنكال يوم القيامة ، فقال : ( إن الذين كفروا لو أن لهم ما في الأرض جميعا ومثله معه ليفتدوا به من عذاب يوم القيامة ما تقبل منهم ولهم عذاب أليم ) أي : لو أن أحدهم جاء يوم القيامة بملء الأرض ذهبا ، وبمثله ليفتدي بذلك من عذاب الله الذي قد أحاط به وتيقن وصوله إليه ما تقبل ذلك منه بل لا مندوحة عنه ولا محيص له ولا مناص ; ولهذا قال : ( ولهم عذاب أليم ) أي : موجع\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ كَفَرُواْ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لِيَفۡتَدُواْ بِهِۦ مِنۡ عَذَابِ يَوۡمِ ٱلۡقِيَٰمَةِ مَا تُقُبِّلَ مِنۡهُمۡۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٦٣\n                                    \n                                    \n                                    إِنَّ الَّذِينَ كَفَرُوا لَوْ أَنَّ لَهُم مَّا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لِيَفْتَدُوا بِهِ مِنْ عَذَابِ يَوْمِ الْقِيَامَةِ مَا تُقُبِّلَ مِنْهُمْ ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ \n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ كَفَرُواْ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لِيَفۡتَدُواْ بِهِۦ مِنۡ عَذَابِ يَوۡمِ ٱلۡقِيَٰمَةِ مَا تُقُبِّلَ مِنۡهُمۡۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٦٣\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 36 و37 : يخبر تعالى عن شناعة حال الكافرين بالله يوم القيامة ومآلهم الفظيع، وأنهم لو افتدوا من عذاب الله بملء الأرض ذهبا ومثله معه ما تقبل منهم، ولا أفاد، لأن محل الافتداء قد فات، ولم يبق إلا العذاب الأليم، الموجع الدائم الذي لا يخرجون منه أبدا، بل هم ماكثون فيه سرمدا.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ كَفَرُواْ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لِيَفۡتَدُواْ بِهِۦ مِنۡ عَذَابِ يَوۡمِ ٱلۡقِيَٰمَةِ مَا تُقُبِّلَ مِنۡهُمۡۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٦٣"
    }
  ]
}