{
  "number": 114,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 706,
      "text": "يُرِيدُونَ أَنْ يَخْرُجُوا مِنَ النَّارِ وَمَا هُمْ بِخَارِجِينَ مِنْهَا ۖ وَلَهُمْ عَذَابٌ مُقِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 37,
      "juz": 6,
      "manzil": 2,
      "page": 114,
      "ruku": 91,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يُرِيدُونَ أَن يَخۡرُجُواْ مِنَ ٱلنَّارِ وَمَا هُم بِخَٰرِجِينَ مِنۡهَاۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ ٧٣\n                                    \n                                    \n                                    كما قال تعالى : ( كلما أرادوا أن يخرجوا منها من غم أعيدوا فيها ) الآية [ الحج : 22 ] ، فلا يزالون يريدون الخروج مما هم فيه من شدته وأليم مسه ، ولا سبيل لهم إلى ذلك ، كلما رفعهم اللهب فصاروا في أعالي جهنم ، ضربتهم الزبانية بالمقامع الحديد ، فيردونهم إلى أسفلها ، ( ولهم عذاب مقيم ) أي : دائم مستمر لا خروج لهم منها ، ولا محيد لهم عنها .\nوقد قال حماد بن سلمة عن ثابت عن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : \" يؤتى بالرجل من أهل النار ، فيقول : يا ابن آدم كيف وجدت مضجعك؟ فيقول : شر مضجع . فيقول : هل تفتدي بقراب الأرض ذهبا؟ \" قال : \" فيقول : نعم ، يا رب! فيقول : كذبت! قد سألتك أقل من ذلك فلم تفعل : فيؤمر به إلى النار \" .\nرواه مسلم والنسائي من طريق حماد بن سلمة بنحوه . وكذا رواه البخاري ومسلم من طريق معاذ بن هشام الدستوائي عن أبيه ، عن قتادة عن أنس به . وكذا أخرجاه من طريق أبي عمران الجوني واسمه عبد الملك بن حبيب عن أنس بن مالك به . ورواه مطر الوراق عن أنس بن مالك ورواه ابن مردويه من طريقه ، عنه .\nثم رواه ابن مردويه من طريق المسعودي عن يزيد بن صهيب الفقير ، عن جابر بن عبد الله أن رسول الله صلى الله عليه وسلم [ قال ] \" يخرج من النار قوم فيدخلون الجنة \" قال : فقلت لجابر بن عبد الله : يقول الله : ( يريدون أن يخرجوا من النار وما هم بخارجين منها ) قال : اتل أول الآية : ( إن الذين كفروا لو أن لهم ما في الأرض جميعا ومثله معه ليفتدوا به ) الآية ، ألا إنهم الذين كفروا .\nوقد روى الإمام أحمد ومسلم هذا الحديث من وجه آخر ، عن يزيد الفقير عن جابر وهذا أبسط سياقا .\nوقال ابن أبي حاتم : حدثنا الحسين بن محمد بن شنبة الواسطي حدثنا يزيد بن هارون أخبرنا مبارك بن فضالة حدثني يزيد الفقير قال : جلست إلى جابر بن عبد الله وهو يحدث ، فحدث أن أناسا يخرجون من النار - قال : وأنا يومئذ أنكر ذلك ، فغضبت وقلت : ما أعجب من الناس ، ولكن أعجب منكم يا أصحاب محمد ! تزعمون أن الله يخرج ناسا من النار ، والله يقول : ( يريدون أن يخرجوا من النار وما هم بخارجين منها [ ولهم عذاب مقيم ] ) فانتهرني أصحابه ، وكان أحلمهم فقال : دعوا الرجل ، إنما ذلك للكفار : ( إن الذين كفروا لو أن لهم ما في الأرض جميعا ومثله معه ليفتدوا به من عذاب يوم القيامة ) حتى بلغ : ( ولهم عذاب مقيم ) أما تقرأ القرآن؟ قلت : بلى قد جمعته قال : أليس الله يقول : ( ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا ) ؟ [ الإسراء : 79 ] فهو ذلك المقام ، فإن الله [ تعالى ] يحتبس أقواما بخطاياهم في النار ما شاء ، لا يكلمهم ، فإذا أراد أن يخرجهم أخرجهم . قال : فلم أعد بعد ذلك إلى أن أكذب به .\nثم قال ابن مردويه : حدثنا دعلج بن أحمد حدثنا عمرو بن حفص السدوسي حدثنا عاصم بن علي حدثنا العباس بن الفضل حدثنا سعيد بن المهلب حدثني طلق بن حبيب قال : كنت من أشد الناس تكذيبا بالشفاعة ، حتى لقيت جابر بن عبد الله فقرأت عليه كل آية أقدر عليها يذكر الله [ تعالى ] فيها خلود أهل النار ، فقال : يا طلق أتراك أقرأ لكتاب الله وأعلم بسنة رسول الله [ صلى الله عليه وسلم ] مني؟ إن الذين قرأت هم أهلها ، هم المشركون ، ولكن هؤلاء قوم أصابوا ذنوبا فعذبوا ، ثم أخرجوا منها ثم أهوى بيديه إلى أذنيه ، فقال صمتا إن لم أكن سمعت رسول الله صلى الله عليه وسلم يقول : \" يخرجون من النار بعدما دخلوا \" . ونحن نقرأ كما قرأت .\n                                    ",
        "qortoby": "يُرِيدُونَ أَن يَخۡرُجُواْ مِنَ ٱلنَّارِ وَمَا هُم بِخَٰرِجِينَ مِنۡهَاۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ ٧٣\n                                    \n                                    \n                                    قوله تعالى : يريدون أن يخرجوا من النار وما هم بخارجين منها ولهم عذاب مقيم\nقال يزيد الفقير : قيل لجابر بن عبد الله إنكم يا أصحاب محمد تقولون إن قوما يخرجون من النار والله تعالى يقول : وما هم بخارجين منها فقال جابر : إنكم تجعلون العام خاصا والخاص عاما ، إنما هذا في الكفار خاصة ; فقرأت الآية كلها من أولها إلى آخرها فإذا هي في الكفار خاصة . و ( مقيم ) معناه دائم ثابت لا يزول ولا يحول ; قال الشاعر :\nفإن لكم بيوم الشعب مني عذابا دائما لكم مقيما\n                                    ",
        "saadi": "يُرِيدُونَ أَن يَخۡرُجُواْ مِنَ ٱلنَّارِ وَمَا هُم بِخَٰرِجِينَ مِنۡهَاۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ ٧٣\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 36 و 37 : يخبر تعالى عن شناعة حال الكافرين بالله يوم القيامة ومآلهم الفظيع، وأنهم لو افتدوا من عذاب الله بملء الأرض ذهبا ومثله معه ما تقبل منهم، ولا أفاد، لأن محل الافتداء قد فات، ولم يبق إلا العذاب الأليم، الموجع الدائم الذي لا يخرجون منه أبدا، بل هم ماكثون فيه سرمدا.\n                                    "
      },
      "originalText": "يُرِيدُونَ أَن يَخۡرُجُواْ مِنَ ٱلنَّارِ وَمَا هُم بِخَٰرِجِينَ مِنۡهَاۖ وَلَهُمۡ عَذَابٞ مُّقِيمٞ ٧٣"
    },
    {
      "number": 707,
      "text": "وَالسَّارِقُ وَالسَّارِقَةُ فَاقْطَعُوا أَيْدِيَهُمَا جَزَاءً بِمَا كَسَبَا نَكَالًا مِنَ اللَّهِ ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 38,
      "juz": 6,
      "manzil": 2,
      "page": 114,
      "ruku": 91,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلسَّارِقُ وَٱلسَّارِقَةُ فَٱقۡطَعُوٓاْ أَيۡدِيَهُمَا جَزَآءَۢ بِمَا كَسَبَا نَكَٰلٗا مِّنَ ٱللَّهِۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ ٨٣\n                                    \n                                    \n                                    يقول تعالى حاكما وآمرا بقطع يد السارق والسارقة ، وروى الثوري عن جابر بن يزيد الجعفي عن عامر بن شراحيل الشعبي أن ابن مسعود كان يقرؤها : \" والسارق والسارقة فاقطعوا أيمانهما \" . وهذه قراءة شاذة ، وإن كان الحكم عند جميع العلماء موافقا لها ، لا بها ، بل هو مستفاد من دليل آخر . وقد كان القطع معمولا به في الجاهلية ، فقرر في الإسلام وزيدت شروط أخر ، كما سنذكره إن شاء الله تعالى ، كما كانت القسامة والدية والقراض وغير ذلك من الأشياء التي ورد الشرع بتقريرها على ما كانت عليه ، وزيادات هي من تمام المصالح . ويقال : إن أول من قطع الأيدي في الجاهلية قريش قطعوا رجلا يقال له : \" دويك \" مولى لبني مليح بن عمرو من خزاعة كان قد سرق كنز الكعبة ، ويقال : سرقه قوم فوضعوه عنده .\nوقد ذهب بعض الفقهاء من أهل الظاهر إلى أنه متى سرق السارق شيئا قطعت يده به ، سواء كان قليلا أو كثيرا ; لعموم هذه الآية : ( والسارق والسارقة فاقطعوا أيديهما ) فلم يعتبروا نصابا ولا حرزا ، بل أخذوا بمجرد السرقة .\nوقد روى ابن جرير وابن أبي حاتم من طريق عبد المؤمن عن نجدة الحنفي قال : سألت ابن عباس عن قوله : ( والسارق والسارقة فاقطعوا أيديهما ) أخاص أم عام ؟\nفقال : بل عام .\nوهذا يحتمل أن يكون موافقة من ابن عباس لما ذهب إليه هؤلاء ، ويحتمل غير ذلك ، فالله أعلم .\nوتمسكوا بما ثبت في الصحيحين ، عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : \" لعن الله السارق ، يسرق البيضة فتقطع يده ، ويسرق الحبل فتقطع يده \" . وأما الجمهور فاعتبروا النصاب في السرقة ، وإن كان قد وقع بينهم الخلاف في قدره ، فذهب كل من الأئمة الأربعة إلى قول على حدة ، فعند الإمام مالك بن أنس رحمه الله : النصاب ثلاثة دراهم مضروبة خالصة ، فمتى سرقها أو ما يبلغ ثمنها فما فوقها وجب القطع ، واحتج في ذلك بما رواه عن نافع عن ابن عمر أن رسول الله صلى الله عليه وسلم قطع في مجن ثمنه ثلاثة دراهم . أخرجاه في الصحيحين .\nقال مالك رحمه الله : وقطع عثمان رضي الله عنه ، في أترجة قومت بثلاثة دراهم ، وهو أحب ما سمعت في ذلك . وهذا الأثر عن عثمان رضي الله عنه ، قد رواه مالك عن عبد الله بن أبي بكر عن أبيه ، عن عمرة بنت عبد الرحمن : أن سارقا سرق في زمان عثمان أترجة ، فأمر بها عثمان أن تقوم ، فقومت بثلاثة دراهم من صرف اثني عشر درهما بدينار ، فقطع عثمان يده .\nقال أصحاب مالك : ومثل هذا الصنيع يشتهر ، ولم ينكر ، فمن مثله يحكى الإجماع السكوتي ، وفيه دلالة على القطع في الثمار خلافا للحنفية . وعلى اعتبار ثلاثة دراهم خلافا لهم في أنه لا بد من عشرة دراهم وللشافعية في اعتبار ربع دينار ، والله أعلم .\nوذهب الشافعي رحمه الله ، إلى أن الاعتبار في قطع يد السارق بربع دينار أو ما يساويه من الأثمان أو العروض فصاعدا . والحجة في ذلك ما أخرجه الشيخان : البخاري ومسلم من طريق الزهري عن عمرة عن عائشة رضي الله عنها ; أن رسول الله صلى الله عليه وسلم قال : \" تقطع يد السارق في ربع دينار فصاعدا \" .\nولمسلم من طريق أبي بكر بن محمد بن عمرو بن حزم عن عمرة ، عن عائشة ; أن رسول الله صلى الله عليه وسلم قال : \" لا تقطع يد السارق إلا في ربع دينار فصاعدا \" .\nقال أصحابنا : فهذا الحديث فاصل في المسألة ونص في اعتبار ربع الدينار لا ما ساواه . قالوا : وحديث ثمن المجن ، وأنه كان ثلاثة دراهم ، لا ينافي هذا ; لأنه إذ ذاك كان الدينار باثني عشر درهما ، فهي ثمن ربع دينار ، فأمكن الجمع بهذه الطريق .\nويروى هذا المذهب عن عمر بن الخطاب وعثمان بن عفان وعلي بن أبي طالب رضي الله عنهم . وبه يقول عمر بن عبد العزيز والليث بن سعد والأوزاعي والشافعي وأصحابه وإسحاق ابن راهويه - في رواية عنه - وأبو ثور وداود بن علي الظاهري رحمهم الله .\nوذهب الإمام أحمد بن حنبل وإسحاق ابن راهويه - في رواية عنه - إلى أن كل واحد من ربع الدينار والثلاثة دراهم مرد شرعي ، فمن سرق واحدا منهما ، أو ما يساويه قطع عملا بحديث ابن عمر وبحديث عائشة رضي الله عنهما ، ووقع في لفظ عند الإمام أحمد عن عائشة [ رضي الله عنها ] أن رسول الله صلى الله عليه وسلم قال : \" اقطعوا في ربع دينار ، ولا تقطعوا فيما هو أدنى من ذلك \" وكان ربع الدينار يومئذ ثلاثة دراهم ، والدينار اثني عشر درهما . وفي لفظ للنسائي : لا تقطع يد السارق فيما دون ثمن المجن . قيل لعائشة : ما ثمن المجن ؟ قالت : ربع دينار .\nفهذه كلها نصوص دالة على عدم اشتراط عشرة دراهم ، والله أعلم .\nوأما الإمام أبو حنيفة وأصحابه : أبو يوسف ومحمد وزفر وكذا سفيان الثوري رحمهم الله ، فإنهم ذهبوا إلى أن النصاب عشرة دراهم مضروبة غير مغشوشة . واحتجوا بأن ثمن المجن الذي قطع فيه السارق على عهد رسول الله صلى الله عليه وسلم ، كان ثمنه عشرة دراهم . وقد روى أبو بكر بن أبي شيبة : حدثنا ابن نمير وعبد الأعلى وعن محمد بن إسحاق عن أيوب بن موسى عن عطاء عن ابن عباس قال : كان ثمن المجن على عهد النبي صلى الله عليه وسلم عشرة دراهم .\nثم قال : حدثنا عبد الأعلى عن محمد بن إسحاق عن عمرو بن شعيب عن أبيه ، عن جده قال : قال رسول الله صلى الله عليه وسلم : لا تقطع يد السارق في دون ثمن المجن \" . وكان ثمن المجن عشرة دراهم .\nقالوا : فهذا ابن عباس وعبد الله بن عمرو قد خالفا ابن عمر في ثمن المجن ، فالاحتياط الأخذ بالأكثر ; لأن الحدود تدرأ بالشبهات .\nوذهب بعض السلف إلى أنه تقطع يد السارق في عشرة دراهم ، أو دينار ، أو ما يبلغ قيمته واحدا منهما ، يحكى هذا عن علي وابن مسعود وإبراهيم النخعي وأبي جعفر الباقر رحمهم الله تعالى .\nوقال بعض السلف : لا تقطع الخمس إلا في خمس ، أي : في خمسة دنانير ، أو خمسين درهما . وينقل هذا عن سعيد بن جبير رحمه الله .\nوقد أجاب الجمهور عما تمسك به الظاهرية من حديث أبي هريرة : \" يسرق البيضة فتقطع يده ، ويسرق الحبل فتقطع يده \" بأجوبة :\nأحدها : أنه منسوخ بحديث عائشة . وفي هذا نظر ; لأنه لا بد من بيان التاريخ .\nوالثاني : أنه مؤول ببيضة الحديد وحبل السفن ، قاله الأعمش فيما حكاه البخاري وغيره عنه .\nوالثالث : أن هذا وسيلة إلى التدرج في السرقة من القليل إلى الكثير الذي تقطع فيه يده ، ويحتمل أن يكون هذا خرج مخرج الإخبار عما كان الأمر عليه في الجاهلية ، حيث كانوا يقطعون في القليل والكثير ، فلعن السارق الذي يبذل يده الثمينة في الأشياء المهينة .\nوقد ذكروا أن أبا العلاء المعري لما قدم بغداد اشتهر عنه أنه أورد إشكالا على الفقهاء في جعلهم نصاب السرقة ربع دينار ، ونظم في ذلك شعرا دل على جهله ، وقلة عقله فقال :\nيد بخمس مئين عسجد وديت ما بالها قطعت في ربع دينار تناقض ما لنا إلا السكوت له\nوأن نعوذ بمولانا من النار\nولما قال ذلك واشتهر عنه تطلبه الفقهاء فهرب منهم . وقد أجابه الناس في ذلك ، فكان جواب القاضي عبد الوهاب المالكي رحمه الله ، أنه قال : لما كانت أمينة كانت ثمينة ، فلما خانت هانت . ومنهم من قال : هذا من تمام الحكمة والمصلحة وأسرار الشريعة العظيمة ، فإنه في باب الجنايات ناسب أن تعظم قيمة اليد بخمسمائة دينار لئلا يجنى عليها ، وفي باب السرقة ناسب أن يكون القدر الذي تقطع فيه ربع دينار لئلا يتسارع الناس في سرقة الأموال ، فهذا هو عين الحكمة عند ذوي الألباب ; ولهذا قال [ تعالى ] ( جزاء بما كسبا نكالا من الله والله عزيز حكيم ) أي : مجازاة على صنيعهما السيئ في أخذهما أموال الناس بأيديهم ، فناسب أن يقطع ما استعانا به في ذلك ( نكالا من الله ) أي : تنكيلا من الله بهما على ارتكاب ذلك ( والله عزيز ) أي : في انتقامه ( حكيم ) أي : في أمره ونهيه وشرعه وقدره .\n                                    ",
        "qortoby": "وَٱلسَّارِقُ وَٱلسَّارِقَةُ فَٱقۡطَعُوٓاْ أَيۡدِيَهُمَا جَزَآءَۢ بِمَا كَسَبَا نَكَٰلٗا مِّنَ ٱللَّهِۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ ٨٣\n                                    \n                                    \n                                    قوله تعالى : والسارق والسارقة فاقطعوا أيديهما جزاء بما كسبا نكالا من الله والله عزيز حكيم\nفيه خمس وعشرون مسألة :\nقوله تعالى : والسارق والسارقة فاقطعوا أيديهما الآية . لما ذكر تعالى أخذ الأموال بطريق السعي في الأرض والفساد ذكر حكم السارق من غير حراب على ما يأتي بيانه أثناء الباب ; وبدأ سبحانه بالسارق قبل السارقة عكس الزنى على ما نبينه آخر الباب ، وقد قطع السارق في الجاهلية ، وأول من حكم بقطعه في الجاهلية الوليد بن المغيرة ، فأمر الله بقطعه في الإسلام ، فكان أول سارق قطعه رسول الله صلى الله عليه وسلم في الإسلام من الرجال الخيار بن عدي بن نوفل بن عبد مناف ، ومن النساء مرة بنت سفيان بن عبد الأسد من بني مخزوم ، وقطع أبو بكر يد اليمني الذي سرق العقد ; وقطع عمر يد ابن سمرة أخي عبد الرحمن بن سمرة ولا خلاف فيه ، وظاهر الآية العموم في كل سارق وليس كذلك ; لقوله عليه السلام : لا تقطع يد السارق إلا في ربع دينار فصاعدا فبين أنه إنما أراد بقوله : والسارق والسارقة بعض السراق دون بعض ; فلا تقطع يد السارق إلا في ربع دينار ، أو فيما قيمته ربع دينار ; وهذا قول عمر بن الخطاب وعثمان بن عفان وعلي رضي الله عنهم ، وبه قال عمر بن عبد العزيز والليث والشافعي وأبو ثور ; وقال مالك : تقطع اليد في ربع دينار أو في ثلاثة دراهم ، فإن سرق درهمين وهو ربع دينار لانحطاط الصرف لم تقطع يده فيهما ، والعروض لا تقطع فيها إلا أن تبلغ ثلاثة دراهم قل الصرف أو كثر ; فجعل مالك الذهب والورق كل واحد منهما أصلا بنفسه ، وجعل تقويم العروض بالدراهم في المشهور ، وقال أحمد وإسحاق : إن سرق ذهبا فربع دينار ، وإن سرق غير الذهب والفضة كانت قيمته ربع دينار أو ثلاثة دراهم من الورق ، وهذا نحو ما صار إليه مالك في القول الآخر ; والحجة للأول حديث ابن عمر أن رجلا سرق حجفة ، فأتى به النبي صلى الله عليه وسلم فأمر بها فقومت بثلاثة دراهم ، وجعل الشافعي حديث عائشة رضي الله عنها في الربع دينار أصلا رد إليه تقويم العروض لا بالثلاثة دراهم على غلاء الذهب ورخصه ، وترك حديث ابن عمر لما رآه - والله أعلم - من اختلاف الصحابة في المجن الذي قطع فيه رسول الله صلى الله عليه وسلم ; فابن عمر يقول : ثلاثة دراهم ; وابن عباس يقول : عشرة دراهم ; وأنس يقول : خمسة دراهم ، وحديث عائشة في الربع دينار حديث صحيح ثابت لم يختلف فيه عن عائشة إلا أن بعضهم وقفه ، ورفعه من يجب العمل بقوله لحفظه وعدالته ; قاله أبو عمر وغيره ، وعلى هذا فإن بلغ العرض المسروق ربع دينار بالتقويم قطع سارقه ; وهو قول إسحاق ; فقف على هذين الأصلين فهما عمدة الباب ، وهما أصح ما قيل فيه . وقال أبو حنيفة وصاحباه والثوري : لا تقطع يد السارق إلا في عشرة دراهم كيلا ، أو دينارا ذهبا عينا أو وزنا ; ولا يقطع حتى يخرج بالمتاع من ملك الرجل ; وحجتهم حديث ابن عباس ; قال : قوم المجن الذي قطع فيه النبي صلى الله عليه وسلم بعشرة دراهم ، ورواه عمرو بن شعيب عن أبيه عن جده قال : كان ثمن المجن يومئذ عشرة دراهم ; أخرجهما الدارقطني وغيره ، وفي المسألة قول رابع ، وهو ما رواه الدارقطني عن عمر قال : لا تقطع الخمس إلا في خمس ; وبه قال سليمان بن يسار وابن أبي ليلى وابن شبرمة ; وقال أنس بن مالك : قطع أبو بكر - رحمه الله - في مجن قيمته خمسة دراهم ، وقول خامس : وهو أن اليد تقطع في أربعة دراهم فصاعدا ; روي عن أبي هريرة وأبي سعيد الخدري ، وقول سادس : وهو أن اليد تقطع في درهم فما فوقه ; قاله عثمان البتي . وذكر الطبري أن عبد الله بن الزبير قطع في درهم ، وقول سابع : وهو أن اليد تقطع في كل ما له قيمة على ظاهر الآية ; هذا قول الخوارج ، وروي عن الحسن البصري ، وهي إحدى الروايات الثلاث عنه ، والثانية كما روي عن عمر ، والثالثة حكاها قتادة عنه أنه قال : تذاكرنا القطع في كم يكون على عهد زياد ؟ فاتفق رأينا على درهمين ، وهذه أقوال متكافئة والصحيح منها ما قدمناه لك ; فإن قيل : قد روى البخاري ومسلم وغيرهما عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم : لعن الله السارق يسرق البيضة فتقطع يده ويسرق الحبل فتقطع يده وهذا موافق لظاهر الآية في القطع في القليل والكثير ; فالجواب أن هذا خرج مخرج التحذير بالقليل عن الكثير ، كما جاء في معرض الترغيب بالقليل مجرى الكثير في قوله عليه السلام : من بنى لله مسجدا ولو مثل مفحص قطاة بنى الله له بيتا في الجنة ، وقيل : إن ذلك مجاز من وجه آخر ; وذلك أنه إذا ضري بسرقة القليل سرق الكثير فقطعت يده ، وأحسن من هذا ما قاله الأعمش وذكره البخاري في آخر الحديث كالتفسير قال : كانوا يرون أنه بيض الحديد ، والحبل كانوا يرون أنه منها ما يساوي دراهم .\nقلت : كحبال السفينة وشبه ذلك ، والله أعلم .\nالثانية : اتفق جمهور الناس على أن القطع لا يكون إلا على من أخرج من حرز ما يجب فيه القطع ، وقال الحسن بن أبي الحسن : إذا جمع الثياب في البيت ، وقال الحسن بن أبي الحسن أيضا في قول آخر مثل قول سائر أهل العلم فصار اتفاقا صحيحا ، والحمد لله .\nالثالثة : الحرز هو ما نصب عادة لحفظ أموال الناس ، وهو يختلف في كل شيء بحسب حاله على ما يأتي بيانه . قال ابن المنذر : ليس في هذا الباب خبر ثابت لا مقال فيه لأهل العلم ، وإنما ذلك كالإجماع من أهل العلم ، وحكي عن الحسن وأهل الظاهر أنهم لم يشترطوا الحرز ، وفي الموطأ لمالك عن عبد الله بن عبد الرحمن بن أبي حسين المكي ; أن رسول الله صلى الله عليه وسلم قال : لا قطع في ثمر معلق ولا في حريسة جبل فإذا آواه المراح أو الجرين فالقطع فيما بلغ ثمن المجن قال أبو عمر : هذا حديث يتصل معناه من حديث عبد الله بن عمرو بن العاص وغيره ، وعبد الله هذا ثقة عند الجميع ، وكان أحمد يثني عليه ، وعن عبد الله بن عمرو عن رسول الله صلى الله عليه وسلم أنه سئل عن الثمر المعلق فقال : من أصاب منه من ذي حاجة غير متخذ خبنة فلا شيء عليه ومن خرج بشيء منه فعليه القطع ومن سرق دون ذلك فعليه غرامة مثليه والعقوبة وفي رواية . ( وجلدات نكال ) بدل ( والعقوبة ) . قال العلماء : ثم نسخ الجلد وجعل مكانه القطع . قال أبو عمر : قوله ( غرامة مثليه ) منسوخ لا أعلم أحدا من الفقهاء قال به إلا ما جاء عن عمر في دقيق حاطب بن أبي بلتعة ; خرجه مالك ; ورواية عن أحمد بن حنبل ، والذي عليه الناس في الغرم بالمثل ; لقوله تعالى : فمن اعتدى عليكم فاعتدوا عليه بمثل ما اعتدى عليكم ، وروى أبو داود عن صفوان بن أمية قال : كنت نائما في المسجد علي خميصة لي ثمن ثلاثين درهما ، فجاء رجل فاختلسها مني ، فأخذ الرجل فأتي به النبي صلى الله عليه وسلم فأمر به ليقطع ، قال : فأتيته فقلت أتقطعه من أجل ثلاثين درهما ؟ أنا أبيعه وأنسئه ثمنها ; قال : فهلا كان هذا قبل أن تأتيني به ؟ ، ومن جهة النظر أن الأموال خلقت مهيأة للانتفاع بها للخلق أجمعين ، ثم الحكمة الأولية حكمت فيها بالاختصاص الذي هو الملك شرعا ، وبقيت الأطماع متعلقة بها ، والآمال محومة عليها ; فتكفها المروءة والديانة في أقل الخلق ، ويكفها الصون والحرز عن أكثرهم ، فإذا أحرزها مالكها فقد اجتمع فيها الصون والحرز الذي هو غاية الإمكان للإنسان ; فإذا هتكا فحشت الجريمة فعظمت العقوبة ، وإذا هتك أحد الصونين وهو الملك وجب الضمان والأدب .\nالرابعة : فإذا اجتمع جماعة فاشتركوا في إخراج نصاب من حرزه ، فلا يخلو ، إما أن يكون بعضهم ممن يقدر على إخراجه أو لا ، إلا بتعاونهم ، فإذا كان الأول فاختلف فيه علماؤنا على قولين : أحدهما يقطع فيه ، والثاني لا يقطع فيه ; وبه قال أبو حنيفة والشافعي ; قالا : لا يقطع في السرقة المشتركون إلا بشرط أن يجب لكل واحد من حصته نصاب ; لقوله صلى الله عليه وسلم : لا تقطع يد السارق إلا في ربع دينار فصاعدا وكل واحد من هؤلاء لم يسرق نصابا فلا قطع عليهم ، ووجه القطع في إحدى الروايتين أن الاشتراك في الجناية لا يسقط عقوبتها كالاشتراك في القتل ; قال ابن العربي : وما أقرب ما بينهما فإنا إنما قتلنا الجماعة بالواحد صيانة للدماء ; لئلا يتعاون على سفكها الأعداء ، فكذلك في الأموال مثله ; لا سيما وقد ساعدنا الشافعي على أن الجماعة إذا اشتركوا في قطع يد رجل قطعوا ولا فرق بينهما ، وإن كان الثاني وهو مما لا يمكن إخراجه إلا بالتعاون فإنه يقطع جميعهم بالاتفاق من العلماء ; ذكره ابن العربي .\nالخامسة : فإن اشتركوا في السرقة بأن نقب واحد الحرز وأخرج آخر ، فإن كانا متعاونين قطعا ، وإن انفرد كل منهما بفعله دون اتفاق بينهما ، بأن يجيء آخر فيخرج فلا قطع على واحد منهما . وإن تعاونا في النقب وانفرد أحدهما بالإخراج فالقطع عليه خاصة ; وقال الشافعي : لا قطع ; لأن هذا نقب ولم يسرق ، والآخر سرق من حرز مهتوك الحرمة . وقال أبو حنيفة : إن شارك في النقب ودخل وأخذ قطع ، ولا يشترط في الاشتراك في النقب التحامل على آلة واحدة ، بل التعاقب في الضرب تحصل به الشركة .\nالسادسة : ولو دخل أحدهما فأخرج المتاع إلى باب الحرز فأدخل الآخر يده فأخذه فعليه القطع ، ويعاقب الأول ; وقال أشهب : يقطعان . وإن وضعه خارج الحرز فعليه القطع لا على الآخذ ، وإن وضعه في وسط النقب فأخذه الآخر والتقت أيديهما في النقب قطعا جميعا .\nالسابعة : والقبر والمسجد حرز ، فيقطع النباش عند الأكثر ; وقال أبو حنيفة : لا قطع عليه ; لأنه سرق من غير حرز مالا معرضا للتلف لا مالك له ; لأن الميت لا يملك ، ومنهم من ينكر السرقة ; لأنه ليس فيه ساكن ، وإنما تكون السرقة بحيث تتقى الأعين ، ويتحفظ من الناس ; وعلى نفي السرقة عول أهل ما وراء النهر ، وقال الجمهور : هو سارق لأنه تدرع الليل لباسا واتقى الأعين ، وقصد وقتا لا ناظر فيه ولا مار عليه ، فكان بمنزلة ما لو سرق في وقت بروز الناس للعيد ، وخلو البلد من جميعهم ، وأما قولهم : إن القبر غير حرز فباطل ; لأن حرز كل شيء بحسب حاله الممكنة فيه . وأما قولهم : إن الميت لا يملك فباطل أيضا ; لأنه لا يجوز ترك الميت عاريا فصارت هذه الحاجة قاضية بأن القبر حرز ، وقد نبه الله تعالى عليه بقوله : ألم نجعل الأرض كفاتا أحياء وأمواتا ليسكن فيها حيا ، ويدفن فيها ميتا ، وأما قولهم : إنه عرضة للتلف ; فكل ما يلبسه الحي أيضا معرض للتلف والإخلاق بلباسه ، إلا أن أحد الأمرين أعجل من الثاني ; وقد روى أبو داود عن أبي ذر قال : دعاني رسول الله صلى الله عليه وسلم فقال : كيف أنت إذا أصاب الناس موت يكون البيت فيه بالوصيف ، يعني القبر ; قلت : الله ورسوله أعلم قال : عليك بالصبر قال حماد : فبهذا قال من قال تقطع يد السارق ; لأنه دخل على الميت بيته ، وأما المسجد ، فمن سرق حصره قطع ; رواه عيسى عن ابن القاسم ، وإن لم يكن للمسجد باب ; ورآها محرزة ، وإن سرق الأبواب قطع أيضا ; وروي عن ابن القاسم أيضا إن كانت سرقته للحصر نهارا لم يقطع ، وإن كان تسور عليها ليلا قطع ; وذكر عن سحنون إن كانت حصره خيط بعضها إلى بعض قطع ، وإلا لم يقطع . قال أصبغ : يقطع سارق حصر المسجد وقناديله وبلاطه ، كما لو سرق بابه مستسرا أو خشبة من سقفه أو من جوائزه ، وقال أشهب في كتاب محمد : لا قطع في شيء من حصر المسجد وقناديله وبلاطه .\nالثامنة : واختلف العلماء هل يكون غرم مع القطع أم لا ؟ فقال أبو حنيفة : لا يجتمع الغرم مع القطع بحال ; لأن الله سبحانه قال : والسارق والسارقة فاقطعوا أيديهما جزاء بما كسبا نكالا من الله ولم يذكر غرما . وقال الشافعي : يغرم قيمة السرقة موسرا كان أو معسرا ، وتكون دينا عليه إذا أيسر أداه ; وهو قول أحمد وإسحاق ، وأما علماؤنا مالك وأصحابه فقالوا : إن كانت العين قائمة ردها ، وإن تلفت فإن كان موسرا غرم ، وإن كان معسرا لم يتبع دينا ولم يكن عليه شيء ; وروى مالك مثل ذلك عن الزهري ; قال الشيخ أبو إسحاق : وقد قيل إنه يتبع بها دينا مع القطع موسرا كان أو معسرا ; قال : وهو قول غير واحد من علمائنا من أهل المدينة ، واستدل على صحته بأنهما حقان لمستحقين فلا يسقط أحدهما الآخر كالدية والكفارة ، ثم قال : وبهذا أقول ، واستدل القاضي أبو الحسن للمشهور بقوله صلى الله عليه وسلم : إذا أقيم على السارق الحد فلا ضمان عليه وأسنده في كتابه . وقال بعضهم : إن الإتباع بالغرم عقوبة ، والقطع عقوبة ، ولا تجتمع عقوبتان ; وعليه عول القاضي عبد الوهاب ، والصحيح قول الشافعي ومن وافقه ; قال الشافعي : يغرم السارق ما سرق موسرا كان أو معسرا ; قطع أو لم يقطع ، وكذلك إذا قطع الطريق ; قال : ولا يسقط الحد لله ما أتلف للعباد ، وأما ما احتج به علماؤنا من الحديث ( إذا كان معسرا ) فبه احتج الكوفيون وهو قول الطبري ، ولا حجة فيه ; رواه النسائي والدارقطني عن عبد الرحمن بن عوف . قال أبو عمر : هذا حديث ليس بالقوي ولا تقوم به حجة ، وقال ابن العربي : وهذا حديث باطل ، وقال الطبري : القياس أن عليه غرم ما استهلك ، ولكن تركنا ذلك اتباعا للأثر في ذلك . قال أبو عمر : ترك القياس لضعيف الأثر غير جائز ; لأن الضعيف لا يوجب حكما .\nالتاسعة : واختلف في قطع يد من سرق المال من الذي سرقه ; فقال علماؤنا : يقطع ، وقال الشافعي : لا يقطع ; لأنه سرق من غير مالك ومن غير حرز ، وقال علماؤنا : حرمة المالك عليه باقية لم تنقطع عنه ، ويد السارق كلا يد ، كالغاصب لو سرق منه المال المغصوب قطع ، فإن قيل : اجعلوا حرزه كلا حرز ; قلنا : الحرز قائم والملك قائم ولم يبطل الملك فيه فيقولوا لنا أبطلوا الحرز .\nالعاشرة : واختلفوا إذا كرر السرقة بعد القطع في العين المسروقة ; فقال الأكثر : يقطع ، وقال أبو حنيفة : لا قطع عليه ، وعموم القرآن يوجب عليه القطع ، وهو يرد قوله ، وقال أبو حنيفة أيضا في السارق يملك الشيء المسروق بشراء أو هبة قبل القطع : فإنه لا يقطع ، والله تعالى يقول : والسارق والسارقة فاقطعوا أيديهما فإذا وجب القطع حقا لله تعالى لم يسقطه شيء .\nالحادية عشرة : قرأ الجمهور \" والسارق \" بالرفع . قال سيبويه : المعنى وفيما فرض عليكم السارق والسارقة ، وقيل : الرفع فيهما على الابتداء ، والخبر فاقطعوا أيديهما . وليس القصد إلى معين إذ لو قصد معينا لوجب النصب ; تقول : زيدا اضربه ; بل هو كقولك : من سرق فاقطع يده . قال الزجاج : وهذا القول هو المختار ، وقرئ \" والسارق \" بالنصب فيهما على تقدير اقطعوا السارق والسارقة ; وهو اختيار سيبويه ; لأن الفعل بالأمر أولى ; قال سيبويه رحمه الله تعالى : الوجه في كلام العرب النصب ; كما تقول : زيدا أخرجه ; ولكن العامة أبت إلا الرفع ; يعني عامة القراء وجلهم ، فأنزل سيبويه النوع السارق منزلة الشخص المعين ، وقرأ ابن مسعود \" والسارقون والسارقات فاقطعوا أيمانهم \" وهو يقوي قراءة الجماعة ، والسرق والسرقة بكسر الراء فيهما هو اسم الشيء المسروق ، والمصدر من سرق يسرق سرقا بفتح الراء . قاله الجوهري ، وأصل هذا اللفظ إنما هو أخذ الشيء في خفية من الأعين ، ومنه استرق السمع ، وسارقه النظر . قال ابن عرفة : السارق عند العرب هو من جاء مستترا إلى حرز فأخذ منه ما ليس له ، فإن أخذ من ظاهر فهو مختلس ومستلب ومنتهب ومحترس ، فإن تمنع بما في يده فهو غاصب .\nقلت : وفي الخبر عن رسول الله صلى الله عليه وسلم وأسوأ السرقة الذي يسرق صلاته ، قالوا : وكيف يسرق صلاته ؟ قال : لا يتم ركوعها ولا سجودها خرجه الموطأ وغيره ، فسماه سارقا وإن كان ليس سارقا من حيث هو موضع الاشتقاق ، فإنه ليس فيه مسارقة الأعين غالبا .\nالثانية عشرة : قوله تعالى : ( فاقطعوا ) القطع معناه الإبانة والإزالة ، ولا يجب إلا بجمع أوصاف تعتبر في السارق وفي الشيء المسروق ، وفي الموضع المسروق منه ، وفي صفته . فأما ما يعتبر في السارق فخمسة أوصاف ; وهي البلوغ والعقل ، وأن يكون غير مالك للمسروق منه ، وألا يكون له عليه ولاية ، فلا يقطع العبد إن سرق من مال سيده ، وكذلك السيد إن أخذ مال عبده لا قطع بحال ; لأن العبد وماله لسيده . ولم يقطع أحد بأخذ مال عبده لأنه آخذ لماله ، وسقط قطع العبد بإجماع الصحابة وبقول الخليفة : غلامكم سرق متاعكم . وذكر الدارقطني عن ابن عباس قال قال رسول الله صلى الله عليه وسلم : ليس على العبد الآبق إذا سرق قطع ولا على الذمي قال : لم يرفعه غير فهد بن سليمان ، والصواب أنه موقوف ، وذكر ابن ماجه عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم : إذا سرق العبد فبيعوه ولو بنش أخرجه عن أبي بكر بن أبي شيبة حدثنا أبو أسامة عن أبي عوانة عن عمر بن أبي سلمة عن أبيه عن أبي هريرة ; قال ابن ماجه : وحدثنا جبارة بن المغلس حدثنا حجاج بن تميم عن ميمون بن مهران عن ابن عباس ; أن عبدا من رقيق الخمس سرق من الخمس ، فرفع إلى النبي صلى الله عليه وسلم فلم يقطعه ، وقال : مال الله سرق بعضه بعضا وجبارة بن المغلس متروك ; قاله أبو زرعة الرازي ، ولا قطع على صبي ولا مجنون .\nالثالثة عشرة : ويجب على الذمي والمعاهد ، والحربي إذا دخل بأمان ، وأما ما يعتبر في الشيء المسروق فأربعة أوصاف ; وهي النصاب وقد مضى القول فيه ، وأن يكون مما يتمول ويتملك ويحل بيعه ، وإن كان مما لا يتمول ولا يحل بيعه كالخمر والخنزير فلا يقطع فيه باتفاق حاشا الحر الصغير عند مالك ، وابن القاسم ; وقيل : لا قطع عليه ; وبه قال الشافعي وأبو حنيفة ; لأنه ليس بمال ، وقال علماؤنا : هو من أعظم المال ; ولم يقطع السارق في المال لعينه ، وإنما قطع لتعلق النفوس به ، وتعلقها بالحر أكثر من تعلقها بالعبد ، وإن كان مما يجوز تملكه ولا يجوز بيعه كالكلب المأذون في اتخاذه ولحوم الضحايا ، ففي ذلك اختلاف بين ابن القاسم وأشهب . قال ابن القاسم : ولا يقطع سارق الكلب ; وقال أشهب : ذلك في المنهي عن اتخاذه ، فأما المأذون في اتخاذه فيقطع سارقه . قال : ومن سرق لحم أضحية أو جلدها قطع إذا كان قيمة ذلك ثلاثة دراهم ، وقال ابن حبيب قال أصبغ : إن سرق الأضحية قبل الذبح قطع ; وأما إن سرقها بعد الذبح فلا يقطع ، وإن كان مما يجوز اتخاذ أصله وبيعه ، فصنع منه ما لا يجوز استعماله كالطنبور والملاهي من المزمار والعود وشبهه من آلات اللهو فينظر ; فإن كان يبقى منها بعد فساد صورها وإذهاب المنفعة المقصودة بها ربع دينار فأكثر قطع ، وكذلك الحكم في أواني الذهب والفضة التي لا يجوز استعمالها ويؤمر بكسرها فإنما يقوم ما فيها من ذهب أو فضة دون صنعة ، وكذلك الصليب من ذهب أو فضة ، والزيت النجس إن كانت قيمته على نجاسته نصابا قطع فيه . الوصف الثالث ; ألا يكون للسارق فيه ملك ، كمن سرق ما رهنه أو ما استأجره ، ولا شبهة ملك ، على اختلاف بين علمائنا وغيرهم في مراعاة شبهة ملك كالذي يسرق من المغنم أو من بيت المال ; لأن له فيه نصيبا . وروي عن علي رضي الله عنه أنه أتي برجل سرق مغفرا من الخمس فلم ير عليه قطعا وقال : له فيه نصيب ، وعلى هذا مذهب الجماعة في بيت المال ، وقيل : يجب عليه القطع تعلقا بعموم لفظ آية السرقة ، وأن يكون مما تصح سرقته كالعبد الصغير والأعجمي الكبير ; لأن ما لا تصح سرقته كالعبد الفصيح فإنه . لا يقطع فيه ، وأما ما يعتبر في الموضع المسروق منه فوصف واحد وهو الحرز لمثل ذلك الشيء المسروق ، وجملة القول فيه أن كل شيء له مكان معروف فمكانه حرزه ، وكل شيء معه حافظ فحافظه حرزه ; فالدور والمنازل والحوانيت حرز لما فيها ، غاب عنها أهلها أو حضروا ، وكذلك بيت المال حرز لجماعة المسلمين ، والسارق لا يستحق فيه شيئا ، وإن كان قبل السرقة ممن يجوز أن يعطيه الإمام وإنما يتعين حق كل مسلم بالعطية ; ألا ترى أن الإمام قد يجوز أن يصرف جميع المال إلى وجه من وجوه المصالح ولا يفرقه في الناس ، أو يفرقه في بلد دون بلد آخر ويمنع منه قوما دون قوم ; ففي التقدير أن هذا السارق ممن لا حق له فيه . وكذلك المغانم لا تخلو : أن تتعين بالقسمة ; فهو ما ذكرناه في بيت المال ; وتتعين بنفس التناول لمن شهد الواقعة ; فيجب أن يراعى قدر ما سرق ، فإن كان فوق حقه قطع وإلا لم يقطع .\nالرابعة عشرة : وظهور الدواب حرز لما حملت ، وأفنية الحوانيت حرز لما وضع فيها في موقف البيع وإن لم يكن هناك حانوت ، كان معه أهله أم لا ; سرقت بليل أو نهار ، وكذلك موقف الشاة في السوق مربوطة أو غير مربوطة ، والدواب على مرابطها محرزة ، كان معها أهلها أم لا ; فإن كانت الدابة بباب المسجد أو في السوق لم تكن محرزة إلا أن يكون معها حافظ ; ومن ربطها بفنائه أو اتخذ موضعا مربطا لدوابه فإنه حرز لها . والسفينة حرز لما فيها وسواء كانت سائبة أو مربوطة ; فإن سرقت السفينة نفسها فهي كالدابة إن كانت سائبة فليست بمحرزة ، وإن كان صاحبها ربطها في موضع وأرساها فيه فربطها حرز ; وهكذا إن كان معها أحد حيثما كانت فهي محرزة ، كالدابة بباب المسجد معها حافظ ; إلا أن ينزلوا بالسفينة في سفرهم منزلا فيربطوها فهو حرز لها كان صاحبها معها أم لا .\nالخامسة عشرة : ولا خلاف أن الساكنين في دار واحدة كالفنادق التي يسكن فيها كل رجل بيته على حدة ، يقطع من سرق منهم من بيت صاحبه إذا أخذ - وقد خرج بسرقته إلى قاعة الدار - شيئا وإن لم يدخل بها بيته ولا خرج بها من الدار ، ولا خلاف في أنه لا يقطع من سرق منهم من قاعة الدار شيئا وإن أدخله بيته أو أخرجه من الدار ; لأن قاعتها مباحة للجميع للبيع والشراء ، إلا أن تكون دابة في مربطها أو ما يشبهها من المتاع .\nالسادسة عشرة : ولا يقطع الأبوان بسرقة مال ابنهما ; لقوله عليه السلام : أنت ومالك لأبيك . ويقطع في سرقة مالهما ; لأنه لا شبهة له فيه ، وقيل : لا يقطع ; وهو قول ابن وهب وأشهب ; لأن الابن ينبسط في مال أبيه في العادة ، ألا ترى أن العبد لا يقطع في مال سيده فلأن لا يقطع ابنه في ماله أولى . واختلفوا في الجد ; فقال مالك وابن القاسم : لا يقطع ، وقال أشهب : يقطع ، وقول مالك أصح أنه أب ; قال مالك : أحب إلي ألا يقطع الأجداد من قبل الأب والأم وإن لم تجب لهم نفقة . قال ابن القاسم وأشهب : ويقطع من سواهما من القرابات . قال ابن القاسم : ولا يقطع من سرق من جوع أصابه ، وقال أبو حنيفة : لا قطع على أحد من ذوي المحارم مثل العمة والخالة والأخت وغيرهم ; وهو قول الثوري ، وقال مالك والشافعي وأحمد وإسحاق : يقطع من سرق من هؤلاء ، وقال أبو ثور : يقطع كل سارق سرق ما تقطع فيه اليد ; إلا أن يجمعوا على شيء فيسلم للإجماع ، والله أعلم .\nالسابعة عشرة : واختلفوا في سارق المصحف ; فقال الشافعي وأبو يوسف وأبو ثور : يقطع إذا كانت قيمته ما تقطع فيه اليد ; وبه قال ابن القاسم ، وقال النعمان : لا يقطع من سرق مصحفا . قال ابن المنذر : يقطع سارق المصحف ، واختلفوا في الطرار يطر النفقة من الكم ، فقالت طائفة : يقطع من طر من داخل الكم أو من خارج ; وهو قول مالك والأوزاعي وأبي ثور ويعقوب . قال أبو حنيفة ومحمد بن الحسن وإسحاق : إن كانت الدراهم مصرورة في ظاهر كمه فطرها فسرقها لم يقطع ، وإن كانت مصرورة إلى داخل الكم فأدخل يده فسرقها قطع ، وقال الحسن : يقطع . قال ابن المنذر : يقطع على أي جهة طر .\nالثامنة عشرة : واختلفوا في قطع اليد في السفر ، وإقامة الحدود في أرض الحرب ; فقال مالك والليث بن سعد : تقام الحدود في أرض الحرب ولا فرق بين دار الحرب والإسلام ، وقال الأوزاعي : يقيم من غزا على جيش - وإن لم يكن أمير مصر من الأمصار - الحدود في عسكره غير القطع . وقال أبو حنيفة : إذا غزا الجند أرض الحرب وعليهم أمير فإنه لا يقيم الحدود في عسكره ، إلا أن يكون إمام مصر أو الشام أو العراق أو ما أشبهه فيقيم الحدود في عسكره . استدل الأوزاعي ومن قال بقوله بحديث جنادة بن أبي أمية قال : كنا مع بسر بن أرطاة في البحر ، فأتي بسارق يقال له مصدر قد سرق بختية ، فقال : سمعت رسول الله صلى الله عليه وسلم يقول : لا تقطع الأيدي في الغزو ولولا ذلك لقطعته . بسر هذا يقال ولد في زمن النبي صلى الله عليه وسلم ، وكانت له أخبار سوء في جانب علي وأصحابه ، وهو الذي ذبح طفلين لعبد الله بن العباس ففقدت أمهما عقلها فهامت على وجهها ، فدعا عليه علي رضي الله عنه أن يطيل الله عمره ويذهب عقله ، فكان كذلك . قال يحيى بن معين : كان بسر بن أرطاة رجل سوء . استدل من قال بالقطع بعموم القرآن ; وهو الصحيح إن شاء الله تعالى ، وأولى ما يحتج به لمن منع القطع في أرض الحرب والحدود : مخافة أن يلحق ذلك بالشرك ، والله أعلم .\nالتاسعة عشرة : فإذا قطعت اليد أو الرجل فإلى أين تقطع ؟ فقال الكافة : تقطع من الرسغ والرجل من المفصل ، ويحسم الساق إذا قطع ، وقال بعضهم : يقطع إلى المرفق ، وقيل : إلى المنكب ، لأن اسم اليد يتناول ذلك . وقال علي رضي الله عنه : تقطع الرجل من شطر القدم ويترك له العقب ; وبه قال أحمد وأبو ثور . قال ابن المنذر : وقد روينا عن النبي صلى الله عليه وسلم أنه أمر بقطع يد رجل فقال : احسموها وفي إسناده مقال ; واستحب ذلك جماعة منهم الشافعي وأبو ثور وغيرهما ، وهذا أحسن وهو أقرب إلى البرء وأبعد من التلف .\nالموفية عشرين : لا خلاف أن اليمنى هي التي تقطع أولا ، ثم اختلفوا إن سرق ثانية ; فقال مالك وأهل المدينة والشافعي وأبو ثور وغيرهم : تقطع رجله اليسرى ، ثم في الثالثة يده اليسرى ، ثم في الرابعة رجله اليمنى ، ثم إن سرق خامسة يعزر ويحبس ، وقال أبو مصعب من علمائنا : يقتل بعد الرابعة ; واحتج بحديث خرجه النسائي عن الحارث بن حاطب أن رسول الله صلى الله عليه وسلم أتي بلص فقال : اقتلوه فقالوا : يا رسول الله ، إنما سرق ، قال : اقتلوه ، قالوا : يا رسول الله إنما سرق ، قال : اقطعوا يده ، قال : ثم سرق فقطعت رجله ، ثم سرق على عهد أبي بكر رضي الله عنه حتى قطعت قوائمه كلها ، ثم سرق أيضا الخامسة ، فقال أبو بكر رضي الله عنه : كان رسول الله صلى الله عليه وسلم أعلم بهذا حين قال : اقتلوه ثم دفعه إلى فتية من قريش ليقتلوه ; منهم عبد الله بن الزبير وكان يحب الإمارة فقال : أمروني عليكم فأمروه عليهم ، فكان إذا ضرب ضربوه حتى قتلوه ، وبحديث جابر أن النبي صلى الله عليه وسلم أمر بسارق في الخامسة فقال : اقتلوه . قال جابر : فانطلقنا به فقتلناه ، ثم اجتررناه فرميناه في بئر ورمينا عليه الحجارة . رواه أبو داود وخرجه النسائي وقال : هذا حديث منكر وأحد رواته ليس بالقوي ، ولا أعلم في هذا الباب حديثا صحيحا . قال ابن المنذر : ثبت عن أبي بكر وعمر رضي الله عنهما أنهما قطعا اليد بعد اليد والرجل بعد الرجل . وقيل : تقطع في الثانية رجله اليسرى ثم لا قطع في غيرها ، ثم إذا عاد عزر وحبس ; وروي عن علي بن أبي طالب ، وبه قال الزهري وحماد بن أبي سليمان وأحمد بن حنبل . قال الزهري : لم يبلغنا في السنة إلا قطع اليد والرجل ، وقال عطاء : تقطع يده اليمنى خاصة ولا يعود عليه القطع : ذكره ابن العربي وقال : أما قول عطاء فإن الصحابة قالوا قبله خلافه .\nالحادية والعشرون : واختلفوا في الحاكم يأمر بقطع يد السارق اليمنى فتقطع يساره ، فقال قتادة : قد أقيم عليه الحد ولا يزاد عليه ; وبه قال مالك : إذا أخطأ القاطع فقطع شماله ، وبه قال أصحاب الرأي استحسانا ، وقال أبو ثور : على الحزاز الدية لأنه أخطأ وتقطع يمينه إلا أن يمنع بإجماع . قال ابن المنذر : ليس يخلو قطع يسار السارق من أحد معنيين ; إما أن يكون القاطع عمد ذلك فعليه القود ، أو يكون أخطأ فديته على عاقلة القاطع ; وقطع يمين السارق يجب ، ولا يجوز إزالة ما أوجب الله سبحانه بتعدي معتد أو خطأ مخطئ ، وقال الثوري في الذي يقتص منه في يمينه فيقدم شماله فتقطع ; قال : تقطع يمينه أيضا . قال ابن المنذر : وهذا صحيح . وقالت طائفة : تقطع يمينه إذا برئ ; وذلك أنه هو أتلف يساره ، ولا شيء على القاطع في قول أصحاب الرأي ، وقياس قول الشافعي ، وتقطع يمينه إذا برئت ، وقال قتادة والشعبي : لا شيء على القاطع وحسبه ما قطع منه .\nالثانية والعشرون : وتعلق يد السارق في عنقه ، قال عبد الله بن محيريز سألت فضالة عن تعليق يد السارق في عنقه أمن السنة هو ؟ فقال : جيء رسول الله صلى الله عليه وسلم بسارق فقطعت يده ، ثم أمر بها فعلقت في عنقه ; أخرجه الترمذي - وقال : حديث حسن غريب - وأبو داود والنسائي .\nالثالثة والعشرون : إذا وجب حد السرقة فقتل السارق رجلا ; فقال مالك : يقتل ويدخل القطع فيه ، وقال الشافعي : يقطع ويقتل ; لأنهما حقان لمستحقين فوجب أن يوفى لكل واحد منهما حقه ، وهذا هو الصحيح إن شاء الله تعالى ، وهو اختيار ابن العربي .\nالرابعة والعشرون : قوله تعالى : أيديهما لما قال أيديهما ولم يقل يديهما تكلم علماء اللسان في ذلك - قال ابن العربي : وتابعهم الفقهاء على ما ذكروه حسن ظن بهم - فقال الخليل بن أحمد والفراء : كل شيء يوجد من خلق الإنسان إذا أضيف إلى اثنين جمع تقول : هشمت رءوسهما وأشبعت بطونهما ، و إن تتوبا إلى الله فقد صغت قلوبكما ، ولهذا قال : اقطعوا أيديهما ولم يقل يديهما ، والمراد فاقطعوا يمينا من هذا ويمينا من هذا . ويجوز في اللغة ; فاقطعوا يديهما وهو الأصل ; وقد قال الشاعر فجمع بين اللغتين :\nومهمهين قذفين مرتين ظهراهما مثل ظهور الترسين\nوقيل : فعل هذا لأنه لا يشكل ، وقال سيبويه : إذا كان مفردا قد يجمع إذا أردت به التثنية ، وحكي عن العرب ; وضعا رحالهما ، ويريد به رحلي راحلتيهما ; قال ابن العربي : وهذا بناء على أن اليمين وحدها هي التي تقطع وليس كذلك ، بل تقطع الأيدي والأرجل ، فيعود قوله أيديهما إلى أربعة وهي جمع في الاثنين ، وهما تثنية فيأتي الكلام على فصاحته ، ولو قال : فاقطعوا أيديهم لكان وجها ; لأن السارق والسارقة لم يرد بهما شخصين خاصة ، وإنما هما اسما جنس يعمان ما لا يحصى .\nالخامسة والعشرون : قوله تعالى : جزاء بما كسبا مفعول من أجله ، وإن شئت كان مصدرا وكذا نكالا من الله يقال : نكلت به إذا فعلت به ما يوجب أن ينكل به عن ذلك الفعل والله عزيز لا يغالب حكيم فيما يفعله ; وقد تقدم .\n                                    ",
        "saadi": "وَٱلسَّارِقُ وَٱلسَّارِقَةُ فَٱقۡطَعُوٓاْ أَيۡدِيَهُمَا جَزَآءَۢ بِمَا كَسَبَا نَكَٰلٗا مِّنَ ٱللَّهِۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ ٨٣\n                                        \n                                        \n                                        \n                                        السارق: هو من أخذ مال غيره المحترم خفية، بغير رضاه. وهو من كبائر الذنوب الموجبة لترتب العقوبة الشنيعة، وهو قطع اليد اليمنى، كما هو في قراءة بعض الصحابة. وحد اليد عند الإطلاق من الكوع، فإذا سرق قطعت يده من الكوع، وحسمت في زيت لتنسد العروق فيقف الدم، ولكن السنة قيدت عموم هذه الآية من عدة أوجه: منها: الحرز، فإنه لابد أن تكون السرقة من حرز، وحرز كل مال: ما يحفظ به عادة. فلو سرق من غير حرز فلا قطع عليه. ومنها: أنه لابد أن يكون المسروق نصابا، وهو ربع دينار، أو ثلاثة دراهم، أو ما يساوي أحدهما، فلو سرق دون ذلك فلا قطع عليه. ولعل هذا يؤخذ من لفظ السرقة ومعناها، فإن لفظ \"السرقة\" أخذ الشيء على وجه لا يمكن الاحتراز منه، وذلك أن يكون المال محرزا، فلو كان غير محرز لم يكن ذلك سرقة شرعية. ومن الحكمة أيضا أن لا تقطع اليد في الشيء النزر التافه، فلما كان لابد من التقدير، كان التقدير الشرعي مخصصا للكتاب. والحكمة في قطع اليد في السرقة، أن ذلك حفظ للأموال، واحتياط لها، وليقطع العضو الذي صدرت منه الجناية، فإن عاد السارق قطعت رجله اليسرى، فإن عاد، فقيل: تقطع يده اليسرى، ثم رجله اليمنى، وقيل: يحبس حتى يموت. وقوله: { جَزَاءً بِمَا كَسَبَا } أي: ذلك القطع جزاء للسارق بما سرقه من أموال الناس. { نَكَالًا مِّنَ اللَّهِ } أي: تنكيلا وترهيبا للسارق ولغيره، ليرتدع السراق -إذا علموا- أنهم سيقطعون إذا سرقوا. { وَاللَّهُ عَزِيزٌ حَكِيمٌ } أي: عَزَّ وحكم فقطع السارق.\n                                    "
      },
      "originalText": "وَٱلسَّارِقُ وَٱلسَّارِقَةُ فَٱقۡطَعُوٓاْ أَيۡدِيَهُمَا جَزَآءَۢ بِمَا كَسَبَا نَكَٰلٗا مِّنَ ٱللَّهِۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ ٨٣"
    },
    {
      "number": 708,
      "text": "فَمَنْ تَابَ مِنْ بَعْدِ ظُلْمِهِ وَأَصْلَحَ فَإِنَّ اللَّهَ يَتُوبُ عَلَيْهِ ۗ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 39,
      "juz": 6,
      "manzil": 2,
      "page": 114,
      "ruku": 91,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَمَن تَابَ مِنۢ بَعۡدِ ظُلۡمِهِۦ وَأَصۡلَحَ فَإِنَّ ٱللَّهَ يَتُوبُ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٩٣\n                                    \n                                    \n                                    ثم قال تعالى : ( فمن تاب من بعد ظلمه وأصلح فإن الله يتوب عليه إن الله غفور رحيم ) أي : من تاب بعد سرقته وأناب إلى الله ، فإن الله يتوب عليه فيما بينه وبينه ، فأما أموال الناس فلا بد من ردها إليهم أو بدلها عند الجمهور .\nوقال أبو حنيفة : متى قطع وقد تلفت في يده فإنه لا يرد بدلها . وقد روى الحافظ أبو الحسن الدارقطني من حديث محمد بن عبد الرحمن بن ثوبان عن أبي هريرة أن رسول الله صلى الله عليه وسلم أتي بسارق قد سرق شملة فقال : \" ما إخاله سرق \" ! فقال السارق : بلى يا رسول الله . قال : \" اذهبوا به فاقطعوه ، ثم احسموه ، ثم ائتوني به \" . فقطع فأتي به ، فقال : \" تب إلى الله \" . فقال : تبت إلى الله . فقال : \" تاب الله عليك \" .\nوقد روي من وجه آخر مرسلا ورجح إرساله علي ابن المديني وابن خزيمة رحمهما الله ، روى ابن ماجه من حديث ابن لهيعة عن يزيد بن أبي حبيب عن عبد الرحمن بن ثعلبة الأنصاري عن أبيه ; أن عمرو بن سمرة بن حبيب بن عبد شمس جاء إلى النبي صلى الله عليه وسلم فقال : يا رسول الله ، إني سرقت جملا لبني فلان فطهرني! فأرسل إليهم النبي صلى الله عليه وسلم فقالوا : إنا افتقدنا جملا لنا . فأمر به فقطعت يده . قال ثعلبة : أنا أنظر إليه حين وقعت يده وهو يقول : الحمد لله الذي طهرني منك ، أردت أن تدخلي جسدي النار .\nوقال ابن جرير : حدثنا أبو كريب حدثنا موسى بن داود حدثنا ابن لهيعة عن حيي بن عبد الله عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو قال : سرقت امرأة حليا ، فجاء الذين سرقتهم فقالوا : يا رسول الله ، سرقتنا هذه المرأة ، فقال رسول الله صلى الله عليه وسلم : \" اقطعوا يدها اليمنى \" . فقالت المرأة : هل من توبة ؟ فقال رسول الله صلى الله عليه وسلم : \" أنت اليوم من خطيئتك كيوم ولدتك أمك \" ! قال : فأنزل الله عز وجل : ( فمن تاب من بعد ظلمه وأصلح فإن الله يتوب عليه إن الله غفور رحيم )\nوقد رواه الإمام أحمد بأبسط من هذا ، فقال : حدثنا حسن حدثنا ابن لهيعة حدثني حيي بن عبد الله عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو أن امرأة سرقت على عهد رسول الله صلى الله عليه وسلم ، فجاء بها الذين سرقتهم فقالوا : يا رسول الله ، إن هذه المرأة سرقتنا! قال قومها : فنحن نفديها ، فقال رسول الله : \" اقطعوا يدها \" فقالوا : نحن نفديها بخمسمائة دينار . قال : \" اقطعوا يدها \" . قال : فقطعت يدها اليمنى . فقالت المرأة : هل لي من توبة يا رسول الله؟ قال : \" نعم ، أنت اليوم من خطيئتك كيوم ولدتك أمك \" . فأنزل الله في سورة المائدة : ( فمن تاب من بعد ظلمه وأصلح فإن الله يتوب عليه إن الله غفور رحيم )\nوهذه المرأة هي المخزومية التي سرقت ، وحديثها ثابت في الصحيحين ، من رواية الزهري عن عروة عن عائشة أن قريشا أهمهم شأن المرأة التي سرقت في عهد النبي صلى الله عليه وسلم ، في غزوة الفتح ، فقالوا : من يكلم فيها رسول الله صلى الله عليه وسلم؟ فقالوا : ومن يجترئ عليه إلا أسامة بن زيد حب رسول الله صلى الله عليه وسلم؟ فأتى بها رسول الله صلى الله عليه وسلم ، فكلمه فيها أسامة بن زيد فتلون وجه رسول الله صلى الله عليه وسلم فقال : \" أتشفع في حد من حدود الله عز وجل؟ \" فقال له أسامة : استغفر لي يا رسول الله . فلما كان العشي قام رسول الله صلى الله عليه وسلم فاختطب ، فأثنى على الله بما هو أهله ، ثم قال : \" أما بعد ، فإنما أهلك الذين من قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه ، وإذا سرق فيهم الضعيف أقاموا عليه الحد ، وإني والذي نفسي بيده ، لو أن فاطمة بنت محمد سرقت لقطعت يدها \" . ثم أمر بتلك المرأة التي سرقت فقطعت يدها . قالت عائشة [ رضي الله عنها ] فحسنت توبتها بعد ، وتزوجت ، وكانت تأتي بعد ذلك فأرفع حاجتها إلى رسول الله صلى الله عليه وسلم .\nوهذا لفظ مسلم وفي لفظ له عن عائشة قالت : كانت امرأة مخزومية تستعير المتاع وتجحده ، فأمر نبي الله صلى الله عليه وسلم بقطع يدها .\nوعن ابن عمر قال : كانت امرأة مخزومية تستعير متاعا على ألسنة جاراتها وتجحده ، فأمر رسول الله صلى الله عليه وسلم بقطع يدها .\nرواه الإمام أحمد وأبو داود والنسائي - وهذا لفظه - وفي لفظ له : أن امرأة كانت تستعير الحلي للناس ثم تمسكه ، فقال رسول الله صلى الله عليه وسلم : \" لتتب هذه المرأة إلى الله ورسوله وترد ما تأخذ على القوم ، ثم قال رسول الله صلى الله عليه وسلم : \" قم يا بلال فخذ بيدها فاقطعها \"\nوقد ورد في أحكام السرقة أحاديث كثيرة مذكورة في كتاب \" الأحكام \" ، ولله الحمد والمنة .\n                                    ",
        "qortoby": "فَمَن تَابَ مِنۢ بَعۡدِ ظُلۡمِهِۦ وَأَصۡلَحَ فَإِنَّ ٱللَّهَ يَتُوبُ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٩٣\n                                    \n                                    \n                                    قوله تعالى : فمن تاب من بعد ظلمه وأصلح فإن الله يتوب عليه إن الله غفور رحيم\nالسادسة والعشرون : قوله تعالى : فمن تاب من بعد ظلمه وأصلح شرط وجوابه فإن الله يتوب عليه ومعنى من بعد ظلمه من بعد السرقة ; فإن الله يتجاوز عنه ، والقطع لا يسقط بالتوبة ، وقال عطاء وجماعة : يسقط بالتوبة قبل القدرة على السارق ، وقاله بعض الشافعية وعزاه إلى الشافعي قولا . وتعلقوا بقول الله تعالى : إلا الذين تابوا من قبل أن تقدروا عليهم وذلك استثناء من الوجوب ، فوجب حمل جميع الحدود عليه ، وقال علماؤنا : هذا بعينه دليلنا ; لأن الله سبحانه وتعالى لما ذكر حد المحارب قال : إلا الذين تابوا من قبل أن تقدروا عليهم وعطف عليه حد السارق وقال فيه : فمن تاب من بعد ظلمه وأصلح فإن الله يتوب عليه فلو كان مثله في الحكم ما غاير الحكم بينهما . قال ابن العربي : ويا معشر الشافعية سبحان الله ! أين الدقائق الفقهية ، والحكم الشرعية ، التي تستنبطونها من غوامض المسائل ؟ ! ألم تروا إلى المحارب المستبد بنفسه ، المعتدي بسلاح ، الذي يفتقر الإمام معه إلى الإيجاف بالخيل والركاب كيف أسقط جزاءه بالتوبة استنزالا عن تلك الحالة ، كما فعل بالكافر في مغفرة جميع ما سلف استئلافا على الإسلام ; فأما السارق والزاني وهما في قبضة المسلمين وتحت حكم الإمام ، فما الذي يسقط عنهم حكم ما وجب عليهم ؟ ! أو كيف يجوز أن يقال : يقاس على المحارب وقد فرقت بينهما الحكمة والحالة ! هذا ما لا يليق بمثلكم يا معشر المحققين ، وإذا ثبت أن الحد لا يسقط بالتوبة ، فالتوبة مقبولة والقطع كفارة له . وأصلح أي : كما تاب عن السرقة تاب عن كل ذنب ، وقيل : وأصلح أي : ترك المعصية بالكلية ، فأما من ترك السرقة بالزنى أو التهود بالتنصر فهذا ليس بتوبة ، وتوبة الله على العبد أن يوفقه للتوبة ، وقيل : أن تقبل منه التوبة .\nالسابعة والعشرون : يقال : بدأ الله بالسارق في هذه الآية قبل السارقة ، وفي الزنى بالزانية قبل الزاني ما الحكمة في ذلك ؟ فالجواب أن يقال : لما كان حب المال على الرجال أغلب ، وشهوة الاستمتاع على النساء أغلب بدأ بهما في الموضع ; هذا أحد الوجوه في المرأة على ما يأتي بيانه في سورة \" النور \" من البداية بها على الزاني إن شاء الله . ثم جعل الله حد السرقة قطع اليد لتناول المال ، ولم يجعل حد الزنى قطع الذكر مع مواقعة الفاحشة به لثلاثة معان :\nأحدها : أن للسارق مثل يده التي قطعت فإن انزجر بها اعتاض بالثانية ، وليس للزاني مثل ذكره إذا قطع فلم يعتض بغيره لو انزجر بقطعه . الثاني : أن الحد زجر للمحدود وغيره ، وقطع اليد في السرقة ظاهر : وقطع الذكر في الزنى باطن .\nالثالث : أن قطع الذكر فيه إبطال للنسل وليس في قطع اليد إبطاله ، والله أعلم .\n                                    ",
        "saadi": "فَمَن تَابَ مِنۢ بَعۡدِ ظُلۡمِهِۦ وَأَصۡلَحَ فَإِنَّ ٱللَّهَ يَتُوبُ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٩٣\n                                        \n                                        \n                                        \n                                        { فَمَن تَابَ مِن بَعْدِ ظُلْمِهِ وَأَصْلَحَ فَإِنَّ اللَّهَ يَتُوبُ عَلَيْهِ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } فيغفر لمن تاب فترك الذنوب، وأصلح الأعمال والعيوب.\n                                    "
      },
      "originalText": "فَمَن تَابَ مِنۢ بَعۡدِ ظُلۡمِهِۦ وَأَصۡلَحَ فَإِنَّ ٱللَّهَ يَتُوبُ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٩٣"
    },
    {
      "number": 709,
      "text": "أَلَمْ تَعْلَمْ أَنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ يُعَذِّبُ مَنْ يَشَاءُ وَيَغْفِرُ لِمَنْ يَشَاءُ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 40,
      "juz": 6,
      "manzil": 2,
      "page": 114,
      "ruku": 91,
      "hizbQuarter": 45,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ يُعَذِّبُ مَن يَشَآءُ وَيَغۡفِرُ لِمَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٠٤\n                                    \n                                    \n                                    ثم قال تعالى : ( ألم تعلم أن الله له ملك السماوات والأرض ) أي : هو المالك لجميع ذلك ، الحاكم فيه ، الذي لا معقب لحكمه ، وهو الفعال لما يريد ( يعذب من يشاء ويغفر لمن يشاء والله على كل شيء قدير )\n                                    ",
        "qortoby": "أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ يُعَذِّبُ مَن يَشَآءُ وَيَغۡفِرُ لِمَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٠٤\n                                    \n                                    \n                                    قوله تعالى : ألم تعلم أن الله له ملك السماوات والأرض يعذب من يشاء ويغفر لمن يشاء والله على كل شيء قدير\nقوله تعالى : ألم تعلم أن الله له ملك السماوات والأرض الآية . خطاب للنبي صلى الله عليه وسلم وغيره ; أي : لا قرابة بين الله تعالى وبين أحد توجب المحاباة حتى يقول القائل : نحن أبناء الله وأحباؤه ، والحدود تقام على كل من يقارف موجب الحد ، وقيل : أي : له أن يحكم بما يريد ; فلهذا فرق بين المحارب وبين السارق غير المحارب ، وقد تقدم نظائر هذه الآية والكلام فيها فلا معنى لإعادتها والله الموفق . هذا ما يتعلق بآية السرقة من بعض أحكام السرقة ، والله أعلم .\n                                    ",
        "saadi": "أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ يُعَذِّبُ مَن يَشَآءُ وَيَغۡفِرُ لِمَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٠٤\n                                        \n                                        \n                                        \n                                        وذلك أن لله ملك السماوات والأرض، يتصرف فيهما بما شاء من التصاريف القدرية والشرعية، والمغفرة والعقوبة، بحسب ما اقتضته حكمته ورحمته الواسعة ومغفرته.\n                                    "
      },
      "originalText": "أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ يُعَذِّبُ مَن يَشَآءُ وَيَغۡفِرُ لِمَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٠٤"
    },
    {
      "number": 710,
      "text": "۞ يَا أَيُّهَا الرَّسُولُ لَا يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ مِنَ الَّذِينَ قَالُوا آمَنَّا بِأَفْوَاهِهِمْ وَلَمْ تُؤْمِنْ قُلُوبُهُمْ ۛ وَمِنَ الَّذِينَ هَادُوا ۛ سَمَّاعُونَ لِلْكَذِبِ سَمَّاعُونَ لِقَوْمٍ آخَرِينَ لَمْ يَأْتُوكَ ۖ يُحَرِّفُونَ الْكَلِمَ مِنْ بَعْدِ مَوَاضِعِهِ ۖ يَقُولُونَ إِنْ أُوتِيتُمْ هَٰذَا فَخُذُوهُ وَإِنْ لَمْ تُؤْتَوْهُ فَاحْذَرُوا ۚ وَمَنْ يُرِدِ اللَّهُ فِتْنَتَهُ فَلَنْ تَمْلِكَ لَهُ مِنَ اللَّهِ شَيْئًا ۚ أُولَٰئِكَ الَّذِينَ لَمْ يُرِدِ اللَّهُ أَنْ يُطَهِّرَ قُلُوبَهُمْ ۚ لَهُمْ فِي الدُّنْيَا خِزْيٌ ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 41,
      "juz": 6,
      "manzil": 2,
      "page": 114,
      "ruku": 91,
      "hizbQuarter": 46,
      "sajda": false,
      "tafsier": {
        "ibnkther": " يَٰٓأَيُّهَا ٱلرَّسُولُ لَا يَحۡزُنكَ ٱلَّذِينَ يُسَٰرِعُونَ فِي ٱلۡكُفۡرِ مِنَ ٱلَّذِينَ قَالُوٓاْ ءَامَنَّا بِأَفۡوَٰهِهِمۡ وَلَمۡ تُؤۡمِن قُلُوبُهُمۡۛ وَمِنَ ٱلَّذِينَ هَادُواْۛ سَمَّٰعُونَ لِلۡكَذِبِ سَمَّٰعُونَ لِقَوۡمٍ ءَاخَرِينَ لَمۡ يَأۡتُوكَۖ يُحَرِّفُونَ ٱلۡكَلِمَ مِنۢ بَعۡدِ مَوَاضِعِهِۦۖ يَقُولُونَ إِنۡ أُوتِيتُمۡ هَٰذَا فَخُذُوهُ وَإِن لَّمۡ تُؤۡتَوۡهُ فَٱحۡذَرُواْۚ وَمَن يُرِدِ ٱللَّهُ فِتۡنَتَهُۥ فَلَن تَمۡلِكَ لَهُۥ مِنَ ٱللَّهِ شَيۡ‍ًٔاۚ أُوْلَٰٓئِكَ ٱلَّذِينَ لَمۡ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمۡۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ ١٤\n                                    \n                                    \n                                    نزلت هذه الآيات الكريمات في المسارعين في الكفر ، الخارجين عن طاعة الله ورسوله ، المقدمين آراءهم وأهواءهم على شرائع الله ، عز وجل ( من الذين قالوا آمنا بأفواههم ولم تؤمن قلوبهم ) أي : أظهروا الإيمان بألسنتهم ، وقلوبهم خراب خاوية منه ، وهؤلاء هم المنافقون . ( ومن الذين هادوا ) أعداء الإسلام وأهله . وهؤلاء كلهم ( سماعون للكذب ) أي : يستجيبون له ، منفعلون عنه ( سماعون لقوم آخرين لم يأتوك ) أي : يستجيبون لأقوام آخرين لا يأتون مجلسك يا محمد . وقيل : المراد أنهم يتسمعون الكلام ، وينهونه إلى أقوام آخرين ممن لا يحضر عندك ، من أعدائك ( يحرفون الكلم من بعد مواضعه ) أي : يتأولونه على غير تأويله ، ويبدلونه من بعد ما عقلوه وهم يعلمون ( يقولون إن أوتيتم هذا فخذوه وإن لم تؤتوه فاحذروا )\nقيل : نزلت في أقوام من اليهود قتلوا قتيلا وقالوا : تعالوا حتى نتحاكم إلى محمد فإن أفتانا بالدية فخذوا ما قال ، وإن حكم بالقصاص فلا تسمعوا منه .\nوالصحيح أنها نزلت في اليهوديين اللذين زنيا ، وكانوا قد بدلوا كتاب الله الذي بأيديهم ، من الأمر برجم من أحصن منهم ، فحرفوا واصطلحوا فيما بينهم على الجلد مائة جلدة ، والتحميم والإركاب على حمار مقلوبين . فلما وقعت تلك الكائنة بعد هجرة النبي صلى الله عليه وسلم ، قالوا فيما بينهم : تعالوا حتى نتحاكم إليه ، فإن حكم بالجلد والتحميم فخذوا عنه ، واجعلوه حجة بينكم وبين الله ، ويكون نبي من أنبياء الله قد حكم بينكم بذلك ، وإن حكم بالرجم فلا تتبعوه في ذلك .\nوقد وردت الأحاديث بذلك ، فقال مالك عن نافع عن عبد الله بن عمر أنه قال : إن اليهود جاءوا إلى رسول الله صلى الله عليه وسلم ، فذكروا له أن رجلا منهم وامرأة زنيا ، فقال لهم رسول الله صلى الله عليه وسلم : \" ما تجدون في التوراة في شأن الرجم؟ \" فقالوا : نفضحهم ويجلدون . قال عبد الله بن سلام : كذبتم ، إن فيها الرجم . فأتوا بالتوراة فنشروها ، فوضع أحدهم يده على آية الرجم ، فقرأ ما قبلها وما بعدها ، فقال له عبد الله بن سلام : ارفع يدك . فرفع يده فإذا فيها آية الرجم ، فقالوا صدق يا محمد ، فيها آية الرجم ! فأمر بهما رسول الله صلى الله عليه وسلم فرجما فرأيت الرجل يحني على المرأة يقيها الحجارة .\nوأخرجاه وهذا لفظ البخاري . وفي لفظ له : \" فقال لليهود : ما تصنعون بهما؟ \" قالوا : نسخم وجوههما ونخزيهما . قال : ( فأتوا بالتوراة فاتلوها إن كنتم صادقين ) [ آل عمران : 93 ] فجاءوا ، فقالوا لرجل منهم ممن يرضون أعور : اقرأ ، فقرأ حتى انتهى إلى موضع منها فوضع يده عليه ، قال : ارفع يدك . فرفع ، فإذا آية الرجم تلوح ، قال : يا محمد إن فيها آية الرجم ، ولكنا نتكاتمه بيننا . فأمر بهما فرجما .\nوعند مسلم : أن رسول الله صلى الله عليه وسلم أتي بيهودي ويهودية قد زنيا ، فانطلق رسول الله صلى الله عليه وسلم حتى جاء يهود فقال : \" ما تجدون في التوراة على من زنى؟ \" قالوا : نسود وجوههما ونحملهما ، ونخالف بين وجوههما ويطاف بهما ، قال : ( فأتوا بالتوراة فاتلوها إن كنتم صادقين ) قال : فجاءوا بها ، فقرأوها ، حتى إذا مر بآية الرجم وضع الفتى الذي يقرأ يده على آية الرجم ، وقرأ ما بين يديها وما وراءها . فقال له عبد الله بن سلام - وهو مع رسول الله صلى الله عليه وسلم - : مره فليرفع يده . فرفع يده ، فإذا تحتها آية الرجم . فأمر بهما رسول الله صلى الله عليه وسلم فرجما . قال عبد الله بن عمر : كنت فيمن رجمهما ، فلقد رأيته يقيها من الحجارة بنفسه .\nوقال أبو داود : حدثنا أحمد بن سعيد الهمداني حدثنا ابن وهب حدثنا هشام بن سعد أن زيد بن أسلم حدثه ، عن ابن عمر قال : أتى نفر من اليهود فدعوا رسول الله صلى الله عليه وسلم إلى القف فأتاهم في بيت المدارس ، فقالوا : يا أبا القاسم إن رجلا منا زنى بامرأة ، فاحكم قال : ووضعوا لرسول الله صلى الله عليه وسلم وسادة ، فجلس عليها ، ثم قال : \" ائتوني بالتوراة \" . فأتي بها ، فنزع الوسادة من تحته ، ووضع التوراة عليها ، وقال : \" آمنت بك وبمن أنزلك \" . ثم قال : \" ائتوني بأعلمكم \" . فأتي بفتى شاب ، ثم ذكر قصة الرجم نحو حديث مالك عن نافع .\nوقال الزهري : سمعت رجلا من مزينة ممن يتبع العلم ويعيه ، ونحن عند ابن المسيب عن أبي هريرة قال : زنى رجل من اليهود بامرأة ، فقال بعضهم لبعض : اذهبوا إلى هذا النبي ، فإنه بعث بالتخفيف ، فإن أفتانا بفتيا دون الرجم قبلناها ، واحتججنا بها عند الله ، قلنا : فتيا نبي من أنبيائك ، قال : فأتوا النبي صلى الله عليه وسلم وهو جالس في المسجد في أصحابه ، فقالوا : يا أبا القاسم ما تقول في رجل وامرأة منهم زنيا ؟ فلم يكلمهم كلمة حتى أتى بيت مدارسهم ، فقام على الباب فقال : \" أنشدكم بالله الذي أنزل التوراة على موسى ما تجدون في التوراة على من زنى إذا أحصن؟ قالوا : يحمم ، ويجبه ويجلد . والتجبية : أن يحمل الزانيان على حمار ، وتقابل أقفيتهما ، ويطاف بهما . قال : وسكت شاب منهم ، فلما رآه رسول الله صلى الله عليه وسلم سكت ، ألظ به رسول الله صلى الله عليه وسلم النشدة ، فقال : اللهم إذ نشدتنا ، فإنا نجد في التوراة الرجم . فقال النبي صلى الله عليه وسلم : \" فما أول ما ارتخصتم أمر الله؟ \" قال : زنى ذو قرابة من ملك من ملوكنا ، فأخر عنه الرجم ، ثم زنى رجل في أثره من الناس ، فأراد رجمه ، فحال قومه دونه وقالوا : لا يرجم صاحبنا حتى تجيء بصاحبك فترجمه! فاصطلحوا هذه العقوبة بينهم ، فقال النبي صلى الله عليه وسلم : \" فإني أحكم بما في التوراة \" فأمر بهما فرجما . قال الزهري : فبلغنا أن هذه الآية نزلت فيهم : ( إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا ) فكان النبي صلى الله عليه وسلم منهم .\nرواه أحمد وأبو داود - وهذا لفظه - وابن جرير\nوقال الإمام أحمد : حدثنا أبو معاوية حدثنا الأعمش عن عبد الله بن مرة عن البراء بن عازب قال : مر على رسول الله صلى الله عليه وسلم يهودي محمم مجلود ، فدعاهم فقال : \" أهكذا تجدون حد الزاني في كتابكم؟ \" فقالوا : نعم ، فدعا رجلا من علمائهم فقال : \" أنشدك بالذي أنزل التوراة على موسى أهكذا تجدون حد الزاني في كتابكم؟ \" فقال : لا والله ، ولولا أنك نشدتني بهذا لم أخبرك ، نجد حد الزاني في كتابنا الرجم ، ولكنه كثر في أشرافنا ، فكنا إذا أخذنا الشريف تركناه ، وإذا أخذنا الضعيف أقمنا عليه الحد ، فقلنا : تعالوا حتى نجعل شيئا نقيمه على الشريف والوضيع ، فاجتمعنا على التحميم والجلد . فقال النبي صلى الله عليه وسلم : \" اللهم إني أول من أحيا أمرك إذ أماتوه \" . قال : فأمر به فرجم ، قال : فأنزل الله عز وجل : ( يا أيها الرسول لا يحزنك الذين يسارعون في الكفر ) إلى قوله : ( يقولون إن أوتيتم هذا فخذوه ) يقولون : ائتوا محمدا ، فإن أفتاكم بالتحميم والجلد فخذوه ، وإن أفتاكم بالرجم فاحذروا ، إلى قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : في اليهود إلى قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الظالمون ) قال : في اليهود ( ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون ) قال : في الكفار كلها .\nانفرد بإخراجه مسلم دون البخاري وأبو داود والنسائي وابن ماجه من غير وجه ، عن الأعمش به .\nوقال الإمام أبو بكر عبد الله بن الزبير الحميدي في مسنده : حدثنا سفيان بن عيينة عن مجالد بن سعيد الهمداني عن الشعبي عن جابر بن عبد الله قال : زنى رجل من أهل فدك ، فكتب أهل فدك إلى ناس من اليهود بالمدينة أن سلوا محمدا عن ذلك ، فإن أمركم بالجلد فخذوه عنه ، وإن أمركم بالرجم فلا تأخذوه عنه ، تسألوه عن ذلك ، قال : \" أرسلوا إلي أعلم رجلين فيكم \" . فجاءوا برجل أعور - يقال له : ابن صوريا - وآخر ، فقال لهما النبي صلى الله عليه وسلم : \" أنتما أعلم من قبلكما؟ \" . فقالا قد دعانا قومنا لذلك ، فقال النبي صلى الله عليه وسلم لهما : \" أليس عندكما التوراة فيها حكم الله؟ \" قالا : بلى ، فقال النبي صلى الله عليه وسلم : \" فأنشدكم بالذي فلق البحر لبني إسرائيل وظلل عليكم الغمام ، وأنجاكم من آل فرعون وأنزل المن والسلوى على بني إسرائيل : ما تجدون في التوراة في شأن الرجم؟ \" فقال أحدهما للآخر : ما نشدت بمثله قط . قالا نجد ترداد النظر زنية والاعتناق زنية ، والقبل زنية ، فإذا شهد أربعة أنهم رأوه يبدئ ويعيد ، كما يدخل الميل في المكحلة ، فقد وجب الرجم . فقال النبي صلى الله عليه وسلم : \" هو ذاك \" . فأمر به فرجم ، فنزلت : ( فإن جاءوك فاحكم بينهم أو أعرض عنهم وإن تعرض عنهم فلن يضروك شيئا وإن حكمت فاحكم بينهم بالقسط إن الله يحب المقسطين )\nورواه أبو داود وابن ماجه من حديث مجالد به نحوه . ولفظ أبي داود عن جابر قال : جاءت اليهود برجل وامرأة منهم زنيا ، فقال : \" ائتوني بأعلم رجلين منكم \" . فأتوا بابني صوريا ، فنشدهما : \" كيف تجدان أمر هذين في التوراة؟ \" قالا نجد في التوراة إذا شهد أربعة أنهم رأوا ذكره في فرجها مثل الميل في المكحلة رجما ، قال : \" فما يمنعكم أن ترجموهما؟ \" قالا ذهب سلطاننا ، فكرهنا القتل . فدعا رسول الله صلى الله عليه وسلم بالشهود ، فجاءوا أربعة ، فشهدوا أنهم رأوا ذكره في فرجها مثل الميل في المكحلة ، فأمر رسول الله صلى الله عليه وسلم برجمهما .\nثم رواه أبو داود عن الشعبي وإبراهيم النخعي مرسلا ولم يذكر فيه : \" فدعا بالشهود فشهدوا \" .\nفهذه أحاديث دالة على أن رسول الله صلى الله عليه وسلم حكم بموافقة حكم التوراة ، وليس هذا من باب الإلزام لهم بما يعتقدون صحته ; لأنهم مأمورون باتباع الشرع المحمدي لا محالة ، ولكن هذا بوحي خاص من الله ، عز وجل إليه بذلك ، وسؤاله إياهم عن ذلك ليقررهم على ما بأيديهم ، مما تراضوا على كتمانه وجحده ، وعدم العمل به تلك الدهور الطويلة فلما اعترفوا به مع عملهم على خلافه ، بأن زيغهم وعنادهم وتكذيبهم لما يعتقدون صحته من الكتاب الذي بأيديهم ، وعدولهم إلى تحكيم الرسول صلى الله عليه وسلم إنما كان عن هوى منهم وشهوة لموافقة آرائهم ، لا لاعتقادهم صحة ما يحكم به ، لهذا قالوا ) إن ) أوتيتم هذا والتحميم ( فخذوه ) أي : اقبلوه ( وإن لم تؤتوه فاحذروا ) أي : من قبوله واتباعه .\nقال الله تعالى : ( ومن يرد الله فتنته فلن تملك له من الله شيئا أولئك الذين لم يرد الله أن يطهر قلوبهم لهم في الدنيا خزي ولهم في الآخرة عذاب عظيم سماعون للكذب ) أي : الباطل ( أكالون للسحت ) أي : الحرام ، وهو الرشوة كما قاله ابن مسعود وغير واحد أي : ومن كانت هذه صفته كيف يطهر الله قلبه؟ وأنى يستجيب له .\nثم قال لنبيه : ( فإن جاءوك ) أي : يتحاكمون إليك ( فاحكم بينهم أو أعرض عنهم وإن تعرض عنهم فلن يضروك شيئا ) أي : فلا عليك ألا تحكم بينهم ; لأنهم لا يقصدون بتحاكمهم إليك اتباع الحق ، بل ما وافق هواهم .\nقال ابن عباس ومجاهد وعكرمة والحسن وقتادة والسدي وزيد بن أسلم وعطاء الخراساني : هي منسوخة بقوله : ( وأن احكم بينهم بما أنزل الله ) [ المائدة : 49 ] ، ( وإن حكمت فاحكم بينهم بالقسط ) أي : بالحق والعدل وإن كانوا ظلمة خارجين عن طريق العدل ( إن الله يحب المقسطين )\nثم قال تعالى - منكرا عليهم في آرائهم الفاسدة ومقاصدهم الزائغة ، في تركهم ما يعتقدون صحته من الكتاب الذي بأيديهم ، الذي يزعمون أنهم مأمورون بالتمسك به أبدا ، ثم خرجوا عن حكمه وعدلوا إلى غيره ، مما يعتقدون في نفس الأمر بطلانه وعدم لزومه لهم - فقال : ( وكيف يحكمونك وعندهم التوراة فيها حكم الله ثم يتولون من بعد ذلك وما أولئك بالمؤمنين )\nثم مدح التوراة التي أنزلها على عبده ورسوله موسى بن عمران فقال : ( إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا للذين هادوا ) أي : لا يخرجون عن حكمها ولا يبدلونها ولا يحرفونها ( والربانيون والأحبار ) أي : وكذلك الربانيون منهم وهم العباد العلماء ، والأحبار وهم العلماء ( بما استحفظوا من كتاب الله ) أي : بما استودعوا من كتاب الله الذي أمروا أن يظهروه ويعملوا به ( وكانوا عليه شهداء فلا تخشوا الناس واخشون ) أي : لا تخافوا منهم وخافوني ( ولا تشتروا بآياتي ثمنا قليلا ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) فيه قولان سيأتي بيانهما . سبب آخر لنزول هذه الآيات الكريمة .\nقال الإمام أحمد : حدثنا إبراهيم بن العباس حدثنا عبد الرحمن بن أبي الزناد عن أبيه ، عن عبيد الله بن عبد الله عن ابن عباس قال : إن الله أنزل : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) و ( فأولئك هم الظالمون ) [ المائدة : 45 ] ( فأولئك هم الفاسقون ) [ المائدة : 47 ] قال : قال ابن عباس : أنزلها الله في الطائفتين من اليهود كانت إحداهما قد قهرت الأخرى في الجاهلية ، حتى ارتضوا أو اصطلحوا على أن كل قتيل قتلته العزيزة من الذليلة فديته خمسون وسقا ، وكل قتيل قتلته الذليلة من العزيزة فديته مائة وسق ، فكانوا على ذلك حتى قدم النبي صلى الله عليه وسلم المدينة ، فذلت الطائفتان كلتاهما ، لمقدم رسول الله صلى الله عليه وسلم ، ويومئذ لم يظهر ، ولم يوطئهما عليه ، وهو في الصلح ، فقتلت الذليلة من العزيزة قتيلا فأرسلت العزيزة إلى الذليلة : أن ابعثوا لنا بمائة وسق ، فقالت الذليلة : وهل كان هذا في حيين قط دينهما واحد ، ونسبهما واحد ، وبلدهما واحد : دية بعضهم نصف دية بعض . إنما أعطيناكم هذا ضيما منكم لنا ، وفرقا منكم ، فأما إذ قدم محمد فلا نعطيكم ذلك ، فكادت الحرب تهيج بينهما ، ثم ارتضوا على أن يجعلوا رسول الله صلى الله عليه وسلم بينهم ، ثم ذكرت العزيزة فقالت : والله ما محمد بمعطيكم منهم ضعف ما يعطيهم منكم ولقد صدقوا ، ما أعطونا هذا إلا ضيما منا وقهرا لهم ، فدسوا إلى محمد : من يخبر لكم رأيه ، إن أعطاكم ما تريدون حكمتموه وإن لم يعطكم حذرتم فلم تحكموه . فدسوا إلى رسول الله صلى الله عليه وسلم ناسا من المنافقين ليخبروا لهم رأي رسول الله صلى الله عليه وسلم فلما جاءوا رسول الله صلى الله عليه وسلم أخبر الله رسوله صلى الله عليه وسلم بأمرهم كله ، وما أرادوا ، فأنزل الله تعالى : ( يا أيها الرسول لا يحزنك الذين يسارعون في الكفر ) إلى قوله : ( الفاسقون ) ففيهم - والله - أنزل ، وإياهم عنى الله عز وجل .\nورواه أبو داود من حديث ابن أبي الزناد عن أبيه ، بنحوه .\nوقال أبو جعفر بن جرير : حدثنا هناد بن السري وأبو كريب قالا : حدثنا يونس بن بكير عن محمد بن إسحاق حدثني داود بن الحصين عن عكرمة عن ابن عباس أن الآيات في \" المائدة \" ، قوله : ( فاحكم بينهم أو أعرض عنهم ) إلى ( المقسطين ) إنما أنزلت في الدية في بني النضير وبني قريظة وذلك أن قتلى بني النضير كان لهم شرف ، تؤدى الدية كاملة ، وأن قريظة كانوا يودون نصف الدية فتحاكموا في ذلك إلى رسول الله صلى الله عليه وسلم ، فأنزل الله ذلك فيهم ، فحملهم رسول الله صلى الله عليه وسلم على الحق في ذلك ، فجعل الدية في ذلك سواء - والله أعلم ؛ أي ذلك كان .\nورواه أحمد وأبو داود والنسائي من حديث ابن إسحاق .\nثم قال ابن جرير : حدثنا أبو كريب حدثنا عبيد الله بن موسى عن علي بن صالح عن سماك عن عكرمة عن ابن عباس قال : كانت قريظة والنضير وكانت النضير أشرف من قريظة فكان إذا قتل رجل من قريظة رجلا من النضير قتل به ، وإذا قتل رجل من النضير رجلا من قريظة ودي مائة وسق تمر . فلما بعث رسول الله صلى الله عليه وسلم ، قتل رجل من النضير رجلا من قريظة فقالوا : ادفعوه إلينا فقالوا : بيننا وبينكم رسول الله صلى الله عليه وسلم . فنزلت : ( وإن حكمت فاحكم بينهم بالقسط )\nورواه أبو داود والنسائي وابن حبان والحاكم في المستدرك ، من حديث عبيد الله بن موسى بنحوه .\nوهكذا قال قتادة ومقاتل بن حيان وابن زيد وغير واحد .\nوقد روى العوفي وعلي بن أبي طلحة الوالبي عن ابن عباس : أن هذه الآيات نزلت في اليهوديين اللذين زنيا ، كما تقدمت الأحاديث بذلك . وقد يكون اجتمع هذان السببان في وقت واحد ، فنزلت هذه الآيات في ذلك كله ، والله أعلم .\nولهذا قال بعد ذلك : ( وكتبنا عليهم فيها أن النفس بالنفس والعين بالعين ) إلى آخرها ، وهذا يقوي أن سبب النزول قضية القصاص ، والله سبحانه وتعالى أعلم .\nوقوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال البراء بن عازب وحذيفة بن اليمان وابن عباس وأبو مجلز وأبو رجاء العطاردي وعكرمة وعبيد الله بن عبد الله والحسن البصري وغيرهم : نزلت في أهل الكتاب - زاد الحسن البصري : وهي علينا واجبة .\nوقال عبد الرزاق عن سفيان الثوري عن منصور عن إبراهيم قال : نزلت هذه الآيات في بني إسرائيل ورضي الله لهذه الأمة بها . رواه ابن جرير .\nوقال ابن جرير أيضا : حدثنا يعقوب حدثنا هشيم أخبرنا عبد الملك بن أبي سليمان عن سلمة بن كهيل عن علقمة ومسروق أنهما سألا ابن مسعود عن الرشوة فقال : من السحت : قال : فقالا وفي الحكم ؟ قال : ذاك الكفر ! ثم تلا ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون )\nوقال السدي : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) يقول : ومن لم يحكم بما أنزلت فتركه عمدا ، أو جار وهو يعلم ، فهو من الكافرين [ به ]\nوقال علي بن أبي طلحة عن ابن عباس قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : من جحد ما أنزل الله فقد كفر . ومن أقر به ولم يحكم فهو ظالم فاسق . رواه ابن جرير .\nثم اختار أن الآية المراد بها أهل الكتاب أو من جحد حكم الله المنزل في الكتاب .\nوقال عبد الرزاق عن الثوري عن زكريا عن الشعبي : ( ومن لم يحكم بما أنزل الله ) قال : للمسلمين .\nوقال ابن جرير : حدثنا ابن المثنى حدثنا عبد الصمد حدثنا شعبة عن ابن أبي السفر عن الشعبي : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : هذا في المسلمين ( ومن لم يحكم بما أنزل الله فأولئك هم الظالمون ) قال : هذا في اليهود ( ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون ) قال : هذا في النصارى .\nوكذا رواه هشيم والثوري عن زكريا بن أبي زائدة عن الشعبي .\nوقال عبد الرزاق أيضا : أخبرنا معمر عن ابن طاوس عن أبيه قال : سئل ابن عباس عن قوله : ( ومن لم يحكم [ بما أنزل الله فأولئك هم الكافرون ] ) قال : هي به كفر - قال ابن طاوس : وليس كمن كفر بالله وملائكته وكتبه ورسله .\nوقال الثوري عن ابن جريج عن عطاء أنه قال : كفر دون كفر ، وظلم دون ظلم ، وفسق دون فسق . رواه ابن جرير .\nوقال وكيع عن سفيان عن سعيد المكي عن طاوس : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : ليس بكفر ينقل عن الملة .\nوقال ابن أبي حاتم : حدثنا محمد بن عبد الله بن يزيد المقري حدثنا سفيان بن عيينة عن هشام بن حجير عن طاوس عن ابن عباس في قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : ليس بالكفر الذي يذهبون إليه .\nورواه الحاكم في مستدركه ، عن حديث سفيان بن عيينة وقال : صحيح على شرط الشيخين ولم يخرجاه .\n                                    ",
        "qortoby": " يَٰٓأَيُّهَا ٱلرَّسُولُ لَا يَحۡزُنكَ ٱلَّذِينَ يُسَٰرِعُونَ فِي ٱلۡكُفۡرِ مِنَ ٱلَّذِينَ قَالُوٓاْ ءَامَنَّا بِأَفۡوَٰهِهِمۡ وَلَمۡ تُؤۡمِن قُلُوبُهُمۡۛ وَمِنَ ٱلَّذِينَ هَادُواْۛ سَمَّٰعُونَ لِلۡكَذِبِ سَمَّٰعُونَ لِقَوۡمٍ ءَاخَرِينَ لَمۡ يَأۡتُوكَۖ يُحَرِّفُونَ ٱلۡكَلِمَ مِنۢ بَعۡدِ مَوَاضِعِهِۦۖ يَقُولُونَ إِنۡ أُوتِيتُمۡ هَٰذَا فَخُذُوهُ وَإِن لَّمۡ تُؤۡتَوۡهُ فَٱحۡذَرُواْۚ وَمَن يُرِدِ ٱللَّهُ فِتۡنَتَهُۥ فَلَن تَمۡلِكَ لَهُۥ مِنَ ٱللَّهِ شَيۡ‍ًٔاۚ أُوْلَٰٓئِكَ ٱلَّذِينَ لَمۡ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمۡۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ ١٤\n                                    \n                                    \n                                    يا أيها الرسول لا يحزنك الذين يسارعون في الكفر من الذين قالوا آمنا بأفواههم ولم تؤمن قلوبهم ومن الذين هادوا سماعون للكذب سماعون لقوم آخرين لم يأتوك يحرفون الكلم من بعد مواضعه يقولون إن أوتيتم هذا فخذوه وإن لم تؤتوه فاحذروا ومن يرد الله فتنته فلن تملك له من الله شيئا أولئك الذين لم يرد الله أن يطهر قلوبهم لهم في الدنيا خزي ولهم في الآخرة عذاب عظيم\nفيه ثمان مسائل : الأولى : قوله تعالى : يا أيها الرسول لا يحزنك الآية في سبب نزولها ثلاثة أقوال : قيل نزلت في بني قريظة والنضير ; قتل قرظي نضيريا وكان بنو النضير إذا قتلوا من بني قريظة لم يقيدوهم ، وإنما يعطونهم الدية على ما يأتي بيانه ، فتحاكموا إلى النبي صلى الله عليه وسلم فحكم بالتسوية بين القرظي والنضيري ، فساءهم ذلك ولم يقبلوا . وقيل ; إنها نزلت في شأن أبي لبابة حين أرسله النبي صلى الله عليه وسلم إلى بني قريظة فخانه حين أشار إليهم أنه الذبح ، وقيل : إنها نزلت في زنى اليهوديين وقصة الرجم ; وهذا أصح الأقوال ; رواه الأئمة مالك والبخاري ومسلم والترمذي وأبو داود . قال أبو داود عن جابر بن عبد الله أن النبي صلى الله عليه وسلم قال لهم : ائتوني بأعلم رجلين منكم فجاءوا بابني صوريا فنشدهما الله تعالى كيف تجدان أمر هذين في التوراة ؟ قالا : نجد في التوراة إذا شهد أربعة أنهم رأوا ذكره في فرجها كالمرود في المكحلة رجما . قال : فما يمنعكما أن ترجموهما ، قالا : ذهب سلطاننا فكرهنا القتل . فدعا النبي صلى الله عليه وسلم بالشهود ، فجاءوا فشهدوا أنهم رأوا ذكره في فرجها مثل الميل في المكحلة ، فأمر النبي صلى الله عليه وسلم برجمهما ، وفي غير الصحيحين عن الشعبي عن جابر بن عبد الله قال : زنى رجل من أهل فدك ، فكتب أهل فدك إلى ناس من اليهود بالمدينة أن سلوا محمدا عن ذلك ، فإن أمركم بالجلد فخذوه ، وإن أمركم بالرجم فلا تأخذوه ; فسألوه فدعا بابن صوريا وكان عالمهم وكان أعور ; فقال له رسول الله صلى الله عليه وسلم : أنشدك الله كيف تجدون حد الزاني في كتابكم ، فقال ابن صوريا : فأما إذ ناشدتني الله فإنا نجد في التوراة أن النظر زنية ، والاعتناق زنية ، والقبلة زنية ، فإن شهد أربعة بأنهم رأوا ذكره في فرجها مثل الميل في المكحلة فقد وجب الرجم . فقال النبي صلى الله عليه وسلم : هو ذاك ، وفي صحيح مسلم عن البراء بن عازب قال : مر على النبي صلى الله عليه وسلم بيهودي محمما مجلودا ، فدعاهم فقال : هكذا تجدون حد الزاني في كتابكم قالوا : نعم . فدعا رجلا من علمائهم فقال : أنشدك بالله الذي أنزل التوراة على موسى أهكذا تجدون حد الزاني في كتابكم قال : لا - ولولا أنك نشدتني بهذا لم أخبرك - نجده الرجم ، ولكنه كثر في أشرافنا فكنا إذا أخذنا الشريف تركناه ، وإذا أخذنا الضعيف أقمنا عليه الحد ، قلنا : تعالوا فلنجتمع على شيء نقيمه على الشريف والوضيع ، فجعلنا التحميم والجلد مكان الرجم ; فقال رسول الله صلى الله عليه وسلم : اللهم إني أول من أحيا أمرك إذ أماتوه فأمر به فرجم ; فأنزل الله تعالى : يا أيها الرسول لا يحزنك الذين يسارعون في الكفر إلى قوله : إن أوتيتم هذا فخذوه يقول : ائتوا محمدا ، فإن أمركم بالتحميم والجلد فخذوه وإن أفتاكم بالرجم فاحذروا ، فأنزل الله عز وجل : ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ، ومن لم يحكم بما أنزل الله فأولئك هم الظالمون ، ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون في الكفار كلها . هكذا في هذه الرواية ( مر على النبي صلى الله عليه وسلم ) ، وفي حديث ابن عمر : أتي بيهودي ويهودية قد زنيا فانطلق رسول الله صلى الله عليه وسلم حتى جاء يهود ، قال : ما تجدون في التوراة على من زنى الحديث ، وفي رواية ; أن اليهود جاءوا إلى رسول الله صلى الله عليه وسلم برجل وامرأة قد زنيا ، وفي كتاب أبي داود من حديث ابن عمر قال : أتى نفر من اليهود ، فدعوا رسول الله صلى الله عليه وسلم إلى القف فأتاهم في بيت المدراس فقالوا : يا أبا القاسم ، إن رجلا منا زنى بامرأة فاحكم بيننا ، ولا تعارض في شيء من هذا كله ، وهي كلها قصة واحدة ، وقد ساقها أبو داود من حديث أبي هريرة سياقة حسنة فقال : زنى رجل من اليهود وامرأة ، فقال بعضهم لبعض : اذهبوا بنا إلى هذا النبي ، فإنه نبي بعث بالتخفيفات ، فإن أفتى بفتيا دون الرجم قبلناها واحتججنا بها عند الله ، وقلنا فتيا نبي من أنبيائك ; قال : فأتوا النبي صلى الله عليه وسلم وهو جالس في المسجد في أصحابه ; فقالوا : يا أبا القاسم ، ما ترى في رجل وامرأة منهم زنيا ؟ فلم يكلمهم النبي صلى الله عليه وسلم حتى أتى بيت مدراسهم ، فقام على الباب ، فقال : أنشدكم بالله الذي أنزل التوراة على موسى ما تجدون في التوراة على من زنى إذا أحصن ، فقالوا : يحمم وجهه ويجبه ويجلد ، والتجبية أن يحمل الزانيان على حمار وتقابل أقفيتهما ويطاف بهما ; قال : وسكت شاب منهم ، فلما رآه النبي صلى الله عليه وسلم سكت ألظ به النشدة ; فقال : اللهم إذ نشدتنا فإنا نجد في التوراة الرجم . وساق الحديث إلى أن قال : قال النبي صلى الله عليه وسلم : فإني أحكم بما في التوراة فأمر بهما فرجما .\nالثانية : والحاصل من هذه الروايات أن اليهود حكمت النبي صلى الله عليه وسلم ، فحكم عليهم بمقتضى ما في التوراة . واستند في ذلك إلى قول ابني صوريا ، وأنه سمع شهادة اليهود وعمل بها ، وأن الإسلام ليس شرطا في الإحصان . فهذه مسائل أربع . فإذا ترافع أهل الذمة إلى الإمام ; فإن كان ما رفعوه ظلما كالقتل والعدوان والغصب حكم بينهم ، ومنعهم منه بلا خلاف ، وأما إذا لم يكن كذلك فالإمام مخير في الحكم بينهم وتركه عند مالك والشافعي ، غير أن مالكا رأى الإعراض عنهم أولى ، فإن حكم حكم بينهم بحكم الإسلام . وقال الشافعي : لا يحكم بينهم في الحدود ، وقال أبو حنيفة : يحكم بينهم على كل حال ، وهو قول الزهري وعمر بن عبد العزيز والحكم ، وروي عن ابن عباس وهو أحد قولي الشافعي ; لقوله تعالى : وأن احكم بينهم بما أنزل الله على ما يأتي بيانه بعد ، احتج مالك بقوله تعالى : فإن جاءوك فاحكم بينهم أو أعرض عنهم وهي نص في التخيير . قال ابن القاسم : إذا جاء الأساقفة والزانيان فالحاكم مخير ; لأن إنفاذ الحكم حق للأساقفة والمخالف يقول : لا يلتفت إلى الأساقفة . قال ابن العربي : وهو الأصح ; لأن المسلمين لو حكما بينهما رجلا لنفذ ، ولم يعتبر رضا الحاكم . فالكتابيون بذلك أولى ، وقال عيسى عن ابن القاسم : لم يكونوا أهل ذمة إنما كانوا أهل حرب . قال ابن العربي : وهذا الذي قاله عيسى عنه إنما نزع به لما رواه الطبري وغيره : أن الزانيين كانا من أهل خيبر أو فدك ، وكانوا حربا لرسول الله صلى الله عليه وسلم ، واسم المرأة الزانية بسرة ، وكانوا بعثوا إلى يهود المدينة يقولون لهم اسألوا محمدا عن هذا ، فإن أفتاكم بغير الرجم فخذوه منه واقبلوه ، وإن أفتاكم به فاحذروه ; الحديث . قال ابن العربي : وهذا لو كان صحيحا لكان مجيئهم بالزانيين وسؤالهم عهدا وأمانا ; وإن لم يكن عهد وذمة ودار لما كان له حكم الكف عنهم والعدل فيهم ; فلا حجة لرواية عيسى في هذا ; وعنهم أخبر الله تعالى بقوله : سماعون للكذب سماعون لقوم آخرين لم يأتوك ولما حكموا النبي صلى الله عليه وسلم نفذ الحكم عليهم ولم يكن لهم الرجوع ; فكل من حكم رجلا في الدين وهي :\nالثالثة : فأصله هذه الآية . قال مالك : إذا حكم رجل رجلا فحكمه ماض وإن رفع إلى قاض أمضاه ، إلا أن يكون جورا بينا ، وقال سحنون : يمضيه إن رآه صوابا . قال ابن العربي : وذلك في الأموال والحقوق التي تختص بالطالب ، فأما الحدود فلا يحكم فيها إلا السلطان ; والضابط أن كل حق اختص به الخصمان جاز التحكيم فيه ونفذ تحكيم المحكم فيه ، وتحقيقه أن التحكيم بين الناس إنما هو حقهم لا حق الحاكم بيد أن الاسترسال على التحكيم خرم لقاعدة الولاية ، ومؤد إلى تهارج الناس كتهارج الحمر ، فلا بد من فاصل ; فأمر الشرع بنصب الوالي ليحسم قاعدة الهرج ; وأذن في التحكيم تخفيفا عنه وعنهم في مشقة الترافع لتتم المصلحتان وتحصل الفائدة ، وقال الشافعي وغيره : التحكيم جائز وإنما هو فتوى . وقال بعض العلماء : إنما كان حكم النبي صلى الله عليه وسلم علىاليهود بالرجم إقامة لحكم كتابهم ، لما حرفوه وأخفوه وتركوا العمل به ; ألا ترى أنه قال : اللهم إني أول من أحيا أمرك إذ أماتوه وأن ذلك كان حين قدم المدينة ، ولذلك استثبت ابني صوريا عن حكم التوراة واستحلفهما على ذلك ، وأقوال الكفار في الحدود وفي شهادتهم عليها غير مقبولة بالإجماع ، لكن فعل ذلك على طريق إلزامهم ما التزموه وعملوا به ، وقد يحتمل أن يكون حصول طريق العلم بذلك الوحي ، أو ما ألقى الله في روعه من تصديق ابني صوريا فيما قالاه من ذلك لا قولهما مجردا ; فبين له النبي صلى الله عليه وسلم ، وأخبر بمشروعية الرجم ، ومبدؤه ذلك الوقت ، فيكون أفاد بما فعله إقامة حكم التوراة ، وبين أن ذلك حكم شريعته ، وأن التوراة حكم الله سبحانه ; لقوله تعالى : إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا وهو من الأنبياء ، وقد قال عنه أبو هريرة : ( فإني أحكم بما في التوراة ) والله أعلم .\nالرابعة : والجمهور على رد شهادة الذمي ; لأنه ليس من أهلها فلا تقبل على مسلم ولا على كافر ، وقد قبل شهادتهم جماعة من التابعين وغيرهم إذ لم يوجد مسلم على ما يأتي بيانه آخر السورة فإن قيل : فقد حكم بشهادتهم ورجم الزانيين : فالجواب ; أنه إنما نفذ عليهم ما علم أنه حكم التوراة وألزمهم العمل به ، على نحو ما عملت به بنو إسرائيل إلزاما للحجة عليهم ، وإظهارا لتحريفهم وتغييرهم ، فكان منفذا لا حاكما ، وهذا على التأويل الأول ، وعلى ما ذكر من الاحتمال فيكون ذلك خاصا بتلك الواقعة ، إذ لم يسمع في الصدر الأول من قبل شهادتهم في مثل ذلك ، والله أعلم .\nالخامسة : قوله تعالى : \" لا يحزنك \" قرأ نافع بضم الياء وكسر الزاي ، والباقون بفتح الياء وضم الزاي ، والحزن والحزن خلاف السرور ، وحزن الرجل بالكسر فهو حزن وحزين ، وأحزنه غيره وحزنه أيضا مثل أسلكه وسلكه ، ومحزون بني عليه . قال اليزيدي : حزنه لغة قريش ، وأحزنه لغة تميم ، وقد قرئ بهما ، واحتزن وتحزن بمعنى ، والمعنى في الآية تأنيس للنبي صلى الله عليه وسلم : أي : لا يحزنك مسارعتهم إلى الكفر ، فإن الله قد وعدك النصر عليهم .\nالسادسة : قوله تعالى : من الذين قالوا آمنا بأفواههم وهم المنافقون ولم تؤمن قلوبهم أي : لم يضمروا في قلوبهم الإيمان كما نطقت به ألسنتهم ومن الذين هادوا يعني يهود المدينة ويكون هذا تمام الكلام ، ثم ابتدأ فقال : سماعون للكذب أي : هم سماعون ، ومثله طوافون عليكم ، وقيل الابتداء من قوله : ومن الذين هادوا ومن الذين هادوا قوم سماعون للكذب ، أي : قابلون لكذب رؤسائهم من تحريف التوراة ، وقيل : أي : يسمعون كلامك يا محمد ليكذبوا عليك ، فكان فيهم من يحضر النبي صلى الله عليه وسلم ثم يكذب عليه عند عامتهم ، ويقبح صورته في أعينهم ; وهو معنى قوله : سماعون لقوم آخرين لم يأتوك وكان في المنافقين من يفعل هذا . قال الفراء ويجوز سماعين وطوافين ، كما قال : ملعونين أينما ثقفوا وكما قال : إن المتقين في جنات ونعيم . ثم قال : فاكهين آخذين ، وقال سفيان بن عيينة : إن الله سبحانه ذكر الجاسوس في القرآن بقوله : سماعون لقوم آخرين لم يأتوك ولم يعرض النبي صلى الله عليه وسلم لهم مع علمه بهم ; لأنه لم يكن حينئذ تقررت الأحكام ولا تمكن الإسلام ، وسيأتي حكم الجاسوس في \" الممتحنة \" إن شاء الله تعالى .\nالسابعة : قوله تعالى : يحرفون الكلم من بعد مواضعه أي : يتأولونه على غير تأويله بعد أن فهموه عنك وعرفوا مواضعه التي أرادها الله عز وجل ; وبين أحكامه ; فقالوا : شرعه ترك الرجم ; وجعلهم بدل رجم المحصن جلد أربعين تغييرا لحكم الله عز وجل . ويحرفون في موضع الصفة لقوله سماعون وليس بحال من الضمير الذي في يأتوك لأنهم إذا لم يأتوا لم يسمعوا ، والتحريف إنما هو ممن يشهد ويسمع فيحرف ، والمحرفون من اليهود بعضهم لا كلهم ، ولذلك كان حمل المعنى على من الذين هادوا فريق سماعون أشبه ( يقولون ) في موضع الحال من المضمر في ( يحرفون ) . إن أوتيتم هذا فخذوه أي : إن أتاكم محمد صلى الله عليه وسلم بالجلد فاقبلوا وإلا فلا .\nالثامنة : قوله تعالى : ومن يرد الله فتنته أي : ضلالته في الدنيا وعقوبته في الآخرة . فلن تملك له من الله شيئا أي : فلن تنفعه أولئك الذين لم يرد الله أن يطهر قلوبهم بيان منه عز وجل أنه قضى عليهم بالكفر ، ودلت الآية على أن الضلال بمشيئة الله تعالى ردا على من قال خلاف ذلك على ما تقدم ; أي : لم يرد الله أن يطهر قلوبهم من الطبع عليها والختم كما طهر قلوب المؤمنين ثوابا لهم . لهم في الدنيا خزي قيل : هو فضيحتهم حين أنكروا الرجم ، ثم أحضرت التوراة فوجد فيها الرجم وقيل : خزيهم في الدنيا أخذ الجزية والذل ، والله أعلم .\n                                    ",
        "saadi": " يَٰٓأَيُّهَا ٱلرَّسُولُ لَا يَحۡزُنكَ ٱلَّذِينَ يُسَٰرِعُونَ فِي ٱلۡكُفۡرِ مِنَ ٱلَّذِينَ قَالُوٓاْ ءَامَنَّا بِأَفۡوَٰهِهِمۡ وَلَمۡ تُؤۡمِن قُلُوبُهُمۡۛ وَمِنَ ٱلَّذِينَ هَادُواْۛ سَمَّٰعُونَ لِلۡكَذِبِ سَمَّٰعُونَ لِقَوۡمٍ ءَاخَرِينَ لَمۡ يَأۡتُوكَۖ يُحَرِّفُونَ ٱلۡكَلِمَ مِنۢ بَعۡدِ مَوَاضِعِهِۦۖ يَقُولُونَ إِنۡ أُوتِيتُمۡ هَٰذَا فَخُذُوهُ وَإِن لَّمۡ تُؤۡتَوۡهُ فَٱحۡذَرُواْۚ وَمَن يُرِدِ ٱللَّهُ فِتۡنَتَهُۥ فَلَن تَمۡلِكَ لَهُۥ مِنَ ٱللَّهِ شَيۡ‍ًٔاۚ أُوْلَٰٓئِكَ ٱلَّذِينَ لَمۡ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمۡۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ ١٤\n                                        \n                                        \n                                        \n                                        كان الرسول صلى الله عليه وسلم من شدة حرصه على الخلق يشتد حزنه لمن يظهر الإيمان، ثم يرجع إلى الكفر، فأرشده الله تعالى، إلى أنه لا يأسى ولا يحزن على أمثال هؤلاء. فإن هؤلاء لا في العير ولا في النفير. إن حضروا لم ينفعوا، وإن غابوا لم يفقدوا، ولهذا قال مبينا للسبب الموجب لعدم الحزن عليهم - فقال: { مِنَ الَّذِينَ قَالُوا آمَنَّا بِأَفْوَاهِهِمْ وَلَمْ تُؤْمِن قُلُوبُهُمْ } فإن الذين يؤسى ويحزن عليهم، من كان معدودا من المؤمنين، وهم المؤمنون ظاهرا وباطنا, وحاشا لله أن يرجع هؤلاء عن دينهم ويرتدوا، فإن الإيمان -إذا خالطت بشاشته القلوب- لم يعدل به صاحبه غيره، ولم يبغ به بدلا. { وَمِنَ الَّذِينَ هَادُوا } أي: اليهود { سَمَّاعُونَ لِلْكَذِبِ سَمَّاعُونَ لِقَوْمٍ آخَرِينَ لَمْ يَأْتُوكَ } أي: مستجيبون ومقلدون لرؤسائهم، المبني أمرهم على الكذب والضلال والغي. وهؤلاء الرؤساء المتبعون { لَمْ يَأْتُوكَ } بل أعرضوا عنك، وفرحوا بما عندهم من الباطل وهو تحريف الكلم عن مواضعه، أي: جلب معان للألفاظ ما أرادها الله ولا قصدها، لإضلال الخلق ولدفع الحق، فهؤلاء المنقادون للدعاة إلى الضلال، المتبعين للمحال، الذين يأتون بكل كذب، لا عقول لهم ولا همم. فلا تبال أيضا إذا لم يتبعوك، لأنهم في غاية النقص، والناقص لا يؤبه له ولا يبالى به. { يَقُولُونَ إِنْ أُوتِيتُمْ هَذَا فَخُذُوهُ وَإِن لَّمْ تُؤْتَوْهُ فَاحْذَرُوا } أي: هذا قولهم عند محاكمتهم إليك، لا قصد لهم إلا اتباع الهوى. يقول بعضهم لبعض: إن حكم لكم محمد بهذا الحكم الذي يوافق أهواءكم، فاقبلوا حكمه، وإن لم يحكم لكم به، فاحذروا أن تتابعوه على ذلك، وهذا فتنة واتباع ما تهوى الأنفس. { وَمَن يُرِدِ اللَّهُ فِتْنَتَهُ فَلَن تَمْلِكَ لَهُ مِنَ اللَّهِ شَيْئًا } كقوله تعالى: { إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ } { أُولَئِكَ الَّذِينَ لَمْ يُرِدِ اللَّهُ أَن يُطَهِّرَ قُلُوبَهُمْ } أي: فلذلك صدر منهم ما صدر. فدل ذلك على أن من كان مقصوده بالتحاكم إلى الحكم الشرعي اتباع هواه، وأنه إن حكم له رضي، وإن لم يحكم له سخط، فإن ذلك من عدم طهارة قلبه، كما أن من حاكم وتحاكم إلى الشرع ورضي به، وافق هواه أو خالفه، فإنه من طهارة القلب، ودل على أن طهارة القلب، سبب لكل خير، وهو أكبر داع إلى كل قول رشيد وعمل سديد. { لَهُم فِي الدُّنْيَا خِزْيٌ } أي: فضيحة وعار { وَلَهُم فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ } هو: النار وسخط الجبار.\n                                    "
      },
      "originalText": "۞ يَٰٓأَيُّهَا ٱلرَّسُولُ لَا يَحۡزُنكَ ٱلَّذِينَ يُسَٰرِعُونَ فِي ٱلۡكُفۡرِ مِنَ ٱلَّذِينَ قَالُوٓاْ ءَامَنَّا بِأَفۡوَٰهِهِمۡ وَلَمۡ تُؤۡمِن قُلُوبُهُمۡۛ وَمِنَ ٱلَّذِينَ هَادُواْۛ سَمَّٰعُونَ لِلۡكَذِبِ سَمَّٰعُونَ لِقَوۡمٍ ءَاخَرِينَ لَمۡ يَأۡتُوكَۖ يُحَرِّفُونَ ٱلۡكَلِمَ مِنۢ بَعۡدِ مَوَاضِعِهِۦۖ يَقُولُونَ إِنۡ أُوتِيتُمۡ هَٰذَا فَخُذُوهُ وَإِن لَّمۡ تُؤۡتَوۡهُ فَٱحۡذَرُواْۚ وَمَن يُرِدِ ٱللَّهُ فِتۡنَتَهُۥ فَلَن تَمۡلِكَ لَهُۥ مِنَ ٱللَّهِ شَيۡ‍ًٔاۚ أُوْلَٰٓئِكَ ٱلَّذِينَ لَمۡ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمۡۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ ١٤"
    }
  ]
}