{
  "number": 115,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 711,
      "text": "سَمَّاعُونَ لِلْكَذِبِ أَكَّالُونَ لِلسُّحْتِ ۚ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ ۖ وَإِنْ تُعْرِضْ عَنْهُمْ فَلَنْ يَضُرُّوكَ شَيْئًا ۖ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 42,
      "juz": 6,
      "manzil": 2,
      "page": 115,
      "ruku": 91,
      "hizbQuarter": 46,
      "sajda": false,
      "tafsier": {
        "ibnkther": "سَمَّٰعُونَ لِلۡكَذِبِ أَكَّٰلُونَ لِلسُّحۡتِۚ فَإِن جَآءُوكَ فَٱحۡكُم بَيۡنَهُمۡ أَوۡ أَعۡرِضۡ عَنۡهُمۡۖ وَإِن تُعۡرِضۡ عَنۡهُمۡ فَلَن يَضُرُّوكَ شَيۡ‍ٔٗاۖ وَإِنۡ حَكَمۡتَ فَٱحۡكُم بَيۡنَهُم بِٱلۡقِسۡطِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٢٤\n                                    \n                                    \n                                    نزلت هذه الآيات الكريمات في المسارعين في الكفر ، الخارجين عن طاعة الله ورسوله ، المقدمين آراءهم وأهواءهم على شرائع الله ، عز وجل ( من الذين قالوا آمنا بأفواههم ولم تؤمن قلوبهم ) أي : أظهروا الإيمان بألسنتهم ، وقلوبهم خراب خاوية منه ، وهؤلاء هم المنافقون . ( ومن الذين هادوا ) أعداء الإسلام وأهله . وهؤلاء كلهم ( سماعون للكذب ) أي : يستجيبون له ، منفعلون عنه ( سماعون لقوم آخرين لم يأتوك ) أي : يستجيبون لأقوام آخرين لا يأتون مجلسك يا محمد . وقيل : المراد أنهم يتسمعون الكلام ، وينهونه إلى أقوام آخرين ممن لا يحضر عندك ، من أعدائك ( يحرفون الكلم من بعد مواضعه ) أي : يتأولونه على غير تأويله ، ويبدلونه من بعد ما عقلوه وهم يعلمون ( يقولون إن أوتيتم هذا فخذوه وإن لم تؤتوه فاحذروا )\nقيل : نزلت في أقوام من اليهود قتلوا قتيلا وقالوا : تعالوا حتى نتحاكم إلى محمد فإن أفتانا بالدية فخذوا ما قال ، وإن حكم بالقصاص فلا تسمعوا منه .\nوالصحيح أنها نزلت في اليهوديين اللذين زنيا ، وكانوا قد بدلوا كتاب الله الذي بأيديهم ، من الأمر برجم من أحصن منهم ، فحرفوا واصطلحوا فيما بينهم على الجلد مائة جلدة ، والتحميم والإركاب على حمار مقلوبين . فلما وقعت تلك الكائنة بعد هجرة النبي صلى الله عليه وسلم ، قالوا فيما بينهم : تعالوا حتى نتحاكم إليه ، فإن حكم بالجلد والتحميم فخذوا عنه ، واجعلوه حجة بينكم وبين الله ، ويكون نبي من أنبياء الله قد حكم بينكم بذلك ، وإن حكم بالرجم فلا تتبعوه في ذلك .\nوقد وردت الأحاديث بذلك ، فقال مالك عن نافع عن عبد الله بن عمر أنه قال : إن اليهود جاءوا إلى رسول الله صلى الله عليه وسلم ، فذكروا له أن رجلا منهم وامرأة زنيا ، فقال لهم رسول الله صلى الله عليه وسلم : \" ما تجدون في التوراة في شأن الرجم؟ \" فقالوا : نفضحهم ويجلدون . قال عبد الله بن سلام : كذبتم ، إن فيها الرجم . فأتوا بالتوراة فنشروها ، فوضع أحدهم يده على آية الرجم ، فقرأ ما قبلها وما بعدها ، فقال له عبد الله بن سلام : ارفع يدك . فرفع يده فإذا فيها آية الرجم ، فقالوا صدق يا محمد ، فيها آية الرجم ! فأمر بهما رسول الله صلى الله عليه وسلم فرجما فرأيت الرجل يحني على المرأة يقيها الحجارة .\nوأخرجاه وهذا لفظ البخاري . وفي لفظ له : \" فقال لليهود : ما تصنعون بهما؟ \" قالوا : نسخم وجوههما ونخزيهما . قال : ( فأتوا بالتوراة فاتلوها إن كنتم صادقين ) [ آل عمران : 93 ] فجاءوا ، فقالوا لرجل منهم ممن يرضون أعور : اقرأ ، فقرأ حتى انتهى إلى موضع منها فوضع يده عليه ، قال : ارفع يدك . فرفع ، فإذا آية الرجم تلوح ، قال : يا محمد إن فيها آية الرجم ، ولكنا نتكاتمه بيننا . فأمر بهما فرجما .\nوعند مسلم : أن رسول الله صلى الله عليه وسلم أتي بيهودي ويهودية قد زنيا ، فانطلق رسول الله صلى الله عليه وسلم حتى جاء يهود فقال : \" ما تجدون في التوراة على من زنى؟ \" قالوا : نسود وجوههما ونحملهما ، ونخالف بين وجوههما ويطاف بهما ، قال : ( فأتوا بالتوراة فاتلوها إن كنتم صادقين ) قال : فجاءوا بها ، فقرأوها ، حتى إذا مر بآية الرجم وضع الفتى الذي يقرأ يده على آية الرجم ، وقرأ ما بين يديها وما وراءها . فقال له عبد الله بن سلام - وهو مع رسول الله صلى الله عليه وسلم - : مره فليرفع يده . فرفع يده ، فإذا تحتها آية الرجم . فأمر بهما رسول الله صلى الله عليه وسلم فرجما . قال عبد الله بن عمر : كنت فيمن رجمهما ، فلقد رأيته يقيها من الحجارة بنفسه .\nوقال أبو داود : حدثنا أحمد بن سعيد الهمداني حدثنا ابن وهب حدثنا هشام بن سعد أن زيد بن أسلم حدثه ، عن ابن عمر قال : أتى نفر من اليهود فدعوا رسول الله صلى الله عليه وسلم إلى القف فأتاهم في بيت المدارس ، فقالوا : يا أبا القاسم إن رجلا منا زنى بامرأة ، فاحكم قال : ووضعوا لرسول الله صلى الله عليه وسلم وسادة ، فجلس عليها ، ثم قال : \" ائتوني بالتوراة \" . فأتي بها ، فنزع الوسادة من تحته ، ووضع التوراة عليها ، وقال : \" آمنت بك وبمن أنزلك \" . ثم قال : \" ائتوني بأعلمكم \" . فأتي بفتى شاب ، ثم ذكر قصة الرجم نحو حديث مالك عن نافع .\nوقال الزهري : سمعت رجلا من مزينة ممن يتبع العلم ويعيه ، ونحن عند ابن المسيب عن أبي هريرة قال : زنى رجل من اليهود بامرأة ، فقال بعضهم لبعض : اذهبوا إلى هذا النبي ، فإنه بعث بالتخفيف ، فإن أفتانا بفتيا دون الرجم قبلناها ، واحتججنا بها عند الله ، قلنا : فتيا نبي من أنبيائك ، قال : فأتوا النبي صلى الله عليه وسلم وهو جالس في المسجد في أصحابه ، فقالوا : يا أبا القاسم ما تقول في رجل وامرأة منهم زنيا ؟ فلم يكلمهم كلمة حتى أتى بيت مدارسهم ، فقام على الباب فقال : \" أنشدكم بالله الذي أنزل التوراة على موسى ما تجدون في التوراة على من زنى إذا أحصن؟ قالوا : يحمم ، ويجبه ويجلد . والتجبية : أن يحمل الزانيان على حمار ، وتقابل أقفيتهما ، ويطاف بهما . قال : وسكت شاب منهم ، فلما رآه رسول الله صلى الله عليه وسلم سكت ، ألظ به رسول الله صلى الله عليه وسلم النشدة ، فقال : اللهم إذ نشدتنا ، فإنا نجد في التوراة الرجم . فقال النبي صلى الله عليه وسلم : \" فما أول ما ارتخصتم أمر الله؟ \" قال : زنى ذو قرابة من ملك من ملوكنا ، فأخر عنه الرجم ، ثم زنى رجل في أثره من الناس ، فأراد رجمه ، فحال قومه دونه وقالوا : لا يرجم صاحبنا حتى تجيء بصاحبك فترجمه! فاصطلحوا هذه العقوبة بينهم ، فقال النبي صلى الله عليه وسلم : \" فإني أحكم بما في التوراة \" فأمر بهما فرجما . قال الزهري : فبلغنا أن هذه الآية نزلت فيهم : ( إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا ) فكان النبي صلى الله عليه وسلم منهم .\nرواه أحمد وأبو داود - وهذا لفظه - وابن جرير\nوقال الإمام أحمد : حدثنا أبو معاوية حدثنا الأعمش عن عبد الله بن مرة عن البراء بن عازب قال : مر على رسول الله صلى الله عليه وسلم يهودي محمم مجلود ، فدعاهم فقال : \" أهكذا تجدون حد الزاني في كتابكم؟ \" فقالوا : نعم ، فدعا رجلا من علمائهم فقال : \" أنشدك بالذي أنزل التوراة على موسى أهكذا تجدون حد الزاني في كتابكم؟ \" فقال : لا والله ، ولولا أنك نشدتني بهذا لم أخبرك ، نجد حد الزاني في كتابنا الرجم ، ولكنه كثر في أشرافنا ، فكنا إذا أخذنا الشريف تركناه ، وإذا أخذنا الضعيف أقمنا عليه الحد ، فقلنا : تعالوا حتى نجعل شيئا نقيمه على الشريف والوضيع ، فاجتمعنا على التحميم والجلد . فقال النبي صلى الله عليه وسلم : \" اللهم إني أول من أحيا أمرك إذ أماتوه \" . قال : فأمر به فرجم ، قال : فأنزل الله عز وجل : ( يا أيها الرسول لا يحزنك الذين يسارعون في الكفر ) إلى قوله : ( يقولون إن أوتيتم هذا فخذوه ) يقولون : ائتوا محمدا ، فإن أفتاكم بالتحميم والجلد فخذوه ، وإن أفتاكم بالرجم فاحذروا ، إلى قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : في اليهود إلى قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الظالمون ) قال : في اليهود ( ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون ) قال : في الكفار كلها .\nانفرد بإخراجه مسلم دون البخاري وأبو داود والنسائي وابن ماجه من غير وجه ، عن الأعمش به .\nوقال الإمام أبو بكر عبد الله بن الزبير الحميدي في مسنده : حدثنا سفيان بن عيينة عن مجالد بن سعيد الهمداني عن الشعبي عن جابر بن عبد الله قال : زنى رجل من أهل فدك ، فكتب أهل فدك إلى ناس من اليهود بالمدينة أن سلوا محمدا عن ذلك ، فإن أمركم بالجلد فخذوه عنه ، وإن أمركم بالرجم فلا تأخذوه عنه ، تسألوه عن ذلك ، قال : \" أرسلوا إلي أعلم رجلين فيكم \" . فجاءوا برجل أعور - يقال له : ابن صوريا - وآخر ، فقال لهما النبي صلى الله عليه وسلم : \" أنتما أعلم من قبلكما؟ \" . فقالا قد دعانا قومنا لذلك ، فقال النبي صلى الله عليه وسلم لهما : \" أليس عندكما التوراة فيها حكم الله؟ \" قالا : بلى ، فقال النبي صلى الله عليه وسلم : \" فأنشدكم بالذي فلق البحر لبني إسرائيل وظلل عليكم الغمام ، وأنجاكم من آل فرعون وأنزل المن والسلوى على بني إسرائيل : ما تجدون في التوراة في شأن الرجم؟ \" فقال أحدهما للآخر : ما نشدت بمثله قط . قالا نجد ترداد النظر زنية والاعتناق زنية ، والقبل زنية ، فإذا شهد أربعة أنهم رأوه يبدئ ويعيد ، كما يدخل الميل في المكحلة ، فقد وجب الرجم . فقال النبي صلى الله عليه وسلم : \" هو ذاك \" . فأمر به فرجم ، فنزلت : ( فإن جاءوك فاحكم بينهم أو أعرض عنهم وإن تعرض عنهم فلن يضروك شيئا وإن حكمت فاحكم بينهم بالقسط إن الله يحب المقسطين )\nورواه أبو داود وابن ماجه من حديث مجالد به نحوه . ولفظ أبي داود عن جابر قال : جاءت اليهود برجل وامرأة منهم زنيا ، فقال : \" ائتوني بأعلم رجلين منكم \" . فأتوا بابني صوريا ، فنشدهما : \" كيف تجدان أمر هذين في التوراة؟ \" قالا نجد في التوراة إذا شهد أربعة أنهم رأوا ذكره في فرجها مثل الميل في المكحلة رجما ، قال : \" فما يمنعكم أن ترجموهما؟ \" قالا ذهب سلطاننا ، فكرهنا القتل . فدعا رسول الله صلى الله عليه وسلم بالشهود ، فجاءوا أربعة ، فشهدوا أنهم رأوا ذكره في فرجها مثل الميل في المكحلة ، فأمر رسول الله صلى الله عليه وسلم برجمهما .\nثم رواه أبو داود عن الشعبي وإبراهيم النخعي مرسلا ولم يذكر فيه : \" فدعا بالشهود فشهدوا \" .\nفهذه أحاديث دالة على أن رسول الله صلى الله عليه وسلم حكم بموافقة حكم التوراة ، وليس هذا من باب الإلزام لهم بما يعتقدون صحته ; لأنهم مأمورون باتباع الشرع المحمدي لا محالة ، ولكن هذا بوحي خاص من الله ، عز وجل إليه بذلك ، وسؤاله إياهم عن ذلك ليقررهم على ما بأيديهم ، مما تراضوا على كتمانه وجحده ، وعدم العمل به تلك الدهور الطويلة فلما اعترفوا به مع عملهم على خلافه ، بأن زيغهم وعنادهم وتكذيبهم لما يعتقدون صحته من الكتاب الذي بأيديهم ، وعدولهم إلى تحكيم الرسول صلى الله عليه وسلم إنما كان عن هوى منهم وشهوة لموافقة آرائهم ، لا لاعتقادهم صحة ما يحكم به ، لهذا قالوا ) إن ) أوتيتم هذا والتحميم ( فخذوه ) أي : اقبلوه ( وإن لم تؤتوه فاحذروا ) أي : من قبوله واتباعه .\nقال الله تعالى : ( ومن يرد الله فتنته فلن تملك له من الله شيئا أولئك الذين لم يرد الله أن يطهر قلوبهم لهم في الدنيا خزي ولهم في الآخرة عذاب عظيم سماعون للكذب ) أي : الباطل ( أكالون للسحت ) أي : الحرام ، وهو الرشوة كما قاله ابن مسعود وغير واحد أي : ومن كانت هذه صفته كيف يطهر الله قلبه؟ وأنى يستجيب له .\nثم قال لنبيه : ( فإن جاءوك ) أي : يتحاكمون إليك ( فاحكم بينهم أو أعرض عنهم وإن تعرض عنهم فلن يضروك شيئا ) أي : فلا عليك ألا تحكم بينهم ; لأنهم لا يقصدون بتحاكمهم إليك اتباع الحق ، بل ما وافق هواهم .\nقال ابن عباس ومجاهد وعكرمة والحسن وقتادة والسدي وزيد بن أسلم وعطاء الخراساني : هي منسوخة بقوله : ( وأن احكم بينهم بما أنزل الله ) [ المائدة : 49 ] ، ( وإن حكمت فاحكم بينهم بالقسط ) أي : بالحق والعدل وإن كانوا ظلمة خارجين عن طريق العدل ( إن الله يحب المقسطين )\nثم قال تعالى - منكرا عليهم في آرائهم الفاسدة ومقاصدهم الزائغة ، في تركهم ما يعتقدون صحته من الكتاب الذي بأيديهم ، الذي يزعمون أنهم مأمورون بالتمسك به أبدا ، ثم خرجوا عن حكمه وعدلوا إلى غيره ، مما يعتقدون في نفس الأمر بطلانه وعدم لزومه لهم - فقال : ( وكيف يحكمونك وعندهم التوراة فيها حكم الله ثم يتولون من بعد ذلك وما أولئك بالمؤمنين )\nثم مدح التوراة التي أنزلها على عبده ورسوله موسى بن عمران فقال : ( إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا للذين هادوا ) أي : لا يخرجون عن حكمها ولا يبدلونها ولا يحرفونها ( والربانيون والأحبار ) أي : وكذلك الربانيون منهم وهم العباد العلماء ، والأحبار وهم العلماء ( بما استحفظوا من كتاب الله ) أي : بما استودعوا من كتاب الله الذي أمروا أن يظهروه ويعملوا به ( وكانوا عليه شهداء فلا تخشوا الناس واخشون ) أي : لا تخافوا منهم وخافوني ( ولا تشتروا بآياتي ثمنا قليلا ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) فيه قولان سيأتي بيانهما . سبب آخر لنزول هذه الآيات الكريمة .\nقال الإمام أحمد : حدثنا إبراهيم بن العباس حدثنا عبد الرحمن بن أبي الزناد عن أبيه ، عن عبيد الله بن عبد الله عن ابن عباس قال : إن الله أنزل : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) و ( فأولئك هم الظالمون ) [ المائدة : 45 ] ( فأولئك هم الفاسقون ) [ المائدة : 47 ] قال : قال ابن عباس : أنزلها الله في الطائفتين من اليهود كانت إحداهما قد قهرت الأخرى في الجاهلية ، حتى ارتضوا أو اصطلحوا على أن كل قتيل قتلته العزيزة من الذليلة فديته خمسون وسقا ، وكل قتيل قتلته الذليلة من العزيزة فديته مائة وسق ، فكانوا على ذلك حتى قدم النبي صلى الله عليه وسلم المدينة ، فذلت الطائفتان كلتاهما ، لمقدم رسول الله صلى الله عليه وسلم ، ويومئذ لم يظهر ، ولم يوطئهما عليه ، وهو في الصلح ، فقتلت الذليلة من العزيزة قتيلا فأرسلت العزيزة إلى الذليلة : أن ابعثوا لنا بمائة وسق ، فقالت الذليلة : وهل كان هذا في حيين قط دينهما واحد ، ونسبهما واحد ، وبلدهما واحد : دية بعضهم نصف دية بعض . إنما أعطيناكم هذا ضيما منكم لنا ، وفرقا منكم ، فأما إذ قدم محمد فلا نعطيكم ذلك ، فكادت الحرب تهيج بينهما ، ثم ارتضوا على أن يجعلوا رسول الله صلى الله عليه وسلم بينهم ، ثم ذكرت العزيزة فقالت : والله ما محمد بمعطيكم منهم ضعف ما يعطيهم منكم ولقد صدقوا ، ما أعطونا هذا إلا ضيما منا وقهرا لهم ، فدسوا إلى محمد : من يخبر لكم رأيه ، إن أعطاكم ما تريدون حكمتموه وإن لم يعطكم حذرتم فلم تحكموه . فدسوا إلى رسول الله صلى الله عليه وسلم ناسا من المنافقين ليخبروا لهم رأي رسول الله صلى الله عليه وسلم فلما جاءوا رسول الله صلى الله عليه وسلم أخبر الله رسوله صلى الله عليه وسلم بأمرهم كله ، وما أرادوا ، فأنزل الله تعالى : ( يا أيها الرسول لا يحزنك الذين يسارعون في الكفر ) إلى قوله : ( الفاسقون ) ففيهم - والله - أنزل ، وإياهم عنى الله عز وجل .\nورواه أبو داود من حديث ابن أبي الزناد عن أبيه ، بنحوه .\nوقال أبو جعفر بن جرير : حدثنا هناد بن السري وأبو كريب قالا : حدثنا يونس بن بكير عن محمد بن إسحاق حدثني داود بن الحصين عن عكرمة عن ابن عباس أن الآيات في \" المائدة \" ، قوله : ( فاحكم بينهم أو أعرض عنهم ) إلى ( المقسطين ) إنما أنزلت في الدية في بني النضير وبني قريظة وذلك أن قتلى بني النضير كان لهم شرف ، تؤدى الدية كاملة ، وأن قريظة كانوا يودون نصف الدية فتحاكموا في ذلك إلى رسول الله صلى الله عليه وسلم ، فأنزل الله ذلك فيهم ، فحملهم رسول الله صلى الله عليه وسلم على الحق في ذلك ، فجعل الدية في ذلك سواء - والله أعلم ؛ أي ذلك كان .\nورواه أحمد وأبو داود والنسائي من حديث ابن إسحاق .\nثم قال ابن جرير : حدثنا أبو كريب حدثنا عبيد الله بن موسى عن علي بن صالح عن سماك عن عكرمة عن ابن عباس قال : كانت قريظة والنضير وكانت النضير أشرف من قريظة فكان إذا قتل رجل من قريظة رجلا من النضير قتل به ، وإذا قتل رجل من النضير رجلا من قريظة ودي مائة وسق تمر . فلما بعث رسول الله صلى الله عليه وسلم ، قتل رجل من النضير رجلا من قريظة فقالوا : ادفعوه إلينا فقالوا : بيننا وبينكم رسول الله صلى الله عليه وسلم . فنزلت : ( وإن حكمت فاحكم بينهم بالقسط )\nورواه أبو داود والنسائي وابن حبان والحاكم في المستدرك ، من حديث عبيد الله بن موسى بنحوه .\nوهكذا قال قتادة ومقاتل بن حيان وابن زيد وغير واحد .\nوقد روى العوفي وعلي بن أبي طلحة الوالبي عن ابن عباس : أن هذه الآيات نزلت في اليهوديين اللذين زنيا ، كما تقدمت الأحاديث بذلك . وقد يكون اجتمع هذان السببان في وقت واحد ، فنزلت هذه الآيات في ذلك كله ، والله أعلم .\nولهذا قال بعد ذلك : ( وكتبنا عليهم فيها أن النفس بالنفس والعين بالعين ) إلى آخرها ، وهذا يقوي أن سبب النزول قضية القصاص ، والله سبحانه وتعالى أعلم .\nوقوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال البراء بن عازب وحذيفة بن اليمان وابن عباس وأبو مجلز وأبو رجاء العطاردي وعكرمة وعبيد الله بن عبد الله والحسن البصري وغيرهم : نزلت في أهل الكتاب - زاد الحسن البصري : وهي علينا واجبة .\nوقال عبد الرزاق عن سفيان الثوري عن منصور عن إبراهيم قال : نزلت هذه الآيات في بني إسرائيل ورضي الله لهذه الأمة بها . رواه ابن جرير .\nوقال ابن جرير أيضا : حدثنا يعقوب حدثنا هشيم أخبرنا عبد الملك بن أبي سليمان عن سلمة بن كهيل عن علقمة ومسروق أنهما سألا ابن مسعود عن الرشوة فقال : من السحت : قال : فقالا وفي الحكم ؟ قال : ذاك الكفر ! ثم تلا ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون )\nوقال السدي : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) يقول : ومن لم يحكم بما أنزلت فتركه عمدا ، أو جار وهو يعلم ، فهو من الكافرين [ به ]\nوقال علي بن أبي طلحة عن ابن عباس قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : من جحد ما أنزل الله فقد كفر . ومن أقر به ولم يحكم فهو ظالم فاسق . رواه ابن جرير .\nثم اختار أن الآية المراد بها أهل الكتاب أو من جحد حكم الله المنزل في الكتاب .\nوقال عبد الرزاق عن الثوري عن زكريا عن الشعبي : ( ومن لم يحكم بما أنزل الله ) قال : للمسلمين .\nوقال ابن جرير : حدثنا ابن المثنى حدثنا عبد الصمد حدثنا شعبة عن ابن أبي السفر عن الشعبي : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : هذا في المسلمين ( ومن لم يحكم بما أنزل الله فأولئك هم الظالمون ) قال : هذا في اليهود ( ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون ) قال : هذا في النصارى .\nوكذا رواه هشيم والثوري عن زكريا بن أبي زائدة عن الشعبي .\nوقال عبد الرزاق أيضا : أخبرنا معمر عن ابن طاوس عن أبيه قال : سئل ابن عباس عن قوله : ( ومن لم يحكم [ بما أنزل الله فأولئك هم الكافرون ] ) قال : هي به كفر - قال ابن طاوس : وليس كمن كفر بالله وملائكته وكتبه ورسله .\nوقال الثوري عن ابن جريج عن عطاء أنه قال : كفر دون كفر ، وظلم دون ظلم ، وفسق دون فسق . رواه ابن جرير .\nوقال وكيع عن سفيان عن سعيد المكي عن طاوس : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : ليس بكفر ينقل عن الملة .\nوقال ابن أبي حاتم : حدثنا محمد بن عبد الله بن يزيد المقري حدثنا سفيان بن عيينة عن هشام بن حجير عن طاوس عن ابن عباس في قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : ليس بالكفر الذي يذهبون إليه .\nورواه الحاكم في مستدركه ، عن حديث سفيان بن عيينة وقال : صحيح على شرط الشيخين ولم يخرجاه .\n                                    ",
        "qortoby": "سَمَّٰعُونَ لِلۡكَذِبِ أَكَّٰلُونَ لِلسُّحۡتِۚ فَإِن جَآءُوكَ فَٱحۡكُم بَيۡنَهُمۡ أَوۡ أَعۡرِضۡ عَنۡهُمۡۖ وَإِن تُعۡرِضۡ عَنۡهُمۡ فَلَن يَضُرُّوكَ شَيۡ‍ٔٗاۖ وَإِنۡ حَكَمۡتَ فَٱحۡكُم بَيۡنَهُم بِٱلۡقِسۡطِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٢٤\n                                    \n                                    \n                                    قوله تعالى : سماعون للكذب أكالون للسحت فإن جاءوك فاحكم بينهم أو أعرض عنهم وإن تعرض عنهم فلن يضروك شيئا وإن حكمت فاحكم بينهم بالقسط إن الله يحب المقسطين\nفيه مسألتان :\nالأولى : قوله تعالى : سماعون للكذب كرره تأكيدا وتفخيما ، وقد تقدم\nالثانية : قوله تعالى : أكالون للسحت على التكثير ، والسحت في اللغة أصله الهلاك والشدة ; قال الله تعالى : فيسحتكم بعذاب ، وقال الفرزدق :\nوعض زمان يا ابن مروان لم يدع من المال إلا مسحتا أو مجلفا\nكذا الرواية . أو مجلف بالرفع عطفا على المعنى ; لأن معنى لم يدع لم يبق . ويقال للحالق : أسحت أي استأصل ، وسمي المال الحرام سحتا لأنه يسحت الطاعات أي : يذهبها ويستأصلها ، وقال الفراء : أصله كلب الجوع ، يقال رجل مسحوت المعدة أي : أكول ; فكأن بالمسترشي وآكل الحرام من الشره إلى ما يعطى مثل الذي بالمسحوت المعدة من النهم ، وقيل : سمي الحرام سحتا لأنه يسحت مروءة الإنسان .\nقلت : والقول الأول أولى ; لأن بذهاب الدين تذهب المروءة ، ولا مروءة لمن لا دين له .\nقال ابن مسعود وغيره : السحت الرشا ، وقال عمر بن الخطاب رضي الله عنه : رشوة الحاكم من السحت ، وعن النبي صلى الله عليه وسلم أنه قال : كل لحم نبت بالسحت فالنار أولى به قالوا : يا رسول الله ; وما السحت ؟ قال : الرشوة في الحكم ، وعن ابن مسعود أيضا أنه قال : السحت أن يقضي الرجل لأخيه حاجة فيهدي إليه هدية فيقبلها ، وقال ابن خويز منداد : من السحت أن يأكل الرجل بجاهه ، وذلك أن يكون له جاه عند السلطان فيسأله إنسان حاجة فلا يقضيها إلا برشوة يأخذها ، ولا خلاف بين السلف أن أخذ الرشوة على إبطال حق أو ما لا يجوز سحت حرام ، وقال أبو حنيفة : إذا ارتشى الحاكم انعزل في الوقت وإن لم يعزل ، وبطل كل حكم حكم به بعد ذلك .\nقلت : وهذا لا يجوز أن يختلف فيه إن شاء الله ; لأن أخذ الرشوة منه فسق ، والفاسق لا يجوز حكمه . والله أعلم ، وقال عليه الصلاة والسلام : لعن الله الراشي والمرتشي ، وعن علي رضي الله عنه أنه قال : السحت الرشوة وحلوان الكاهن والاستجعال في القضية ، وروي عن وهب بن منبه أنه قيل له : الرشوة حرام في كل شيء ؟ فقال : لا ; إنما يكره من الرشوة أن ترشي لتعطى ما ليس لك ، أو تدفع حقا قد لزمك ; فأما أن ترشي لتدفع عن دينك ودمك ومالك فليس بحرام . قال أبو الليث السمرقندي الفقيه : وبهذا نأخذ ; لا بأس بأن يدفع الرجل عن نفسه وماله بالرشوة . وهذا كما روي عن عبد الله بن مسعود أنه كان بالحبشة فرشا دينارين وقال : إنما الإثم على القابض دون الدافع ; قال المهدوي : ومن جعل كسب الحجام ومن ذكر معه سحتا فمعناه أنه يسحت مروءة آخذه .\nقلت : الصحيح في كسب الحجام أنه طيب ، ومن أخذ طيبا لا تسقط مروءته ولا تنحط مرتبته ، وقد روى مالك عن حميد الطويل عن أنس أنه قال : احتجم رسول الله صلى الله عليه وسلم ، حجمه أبو طيبة فأمر له رسول الله صلى الله عليه وسلم بصاع من تمر وأمر أهله أن يخففوا عنه من خراجه ; قال ابن عبد البر : هذا يدل على أن كسب الحجام طيب ; لأن رسول الله صلى الله عليه وسلم لا يجعل ثمنا ولا جعلا ولا عوضا لشيء من الباطل ، وحديث أنس هذا ناسخ لما حرمه النبي صلى الله عليه وسلم من ثمن الدم ، وناسخ لما كرهه من إجارة الحجام . وروى البخاري وأبو داود عن ابن عباس قال : احتجم رسول الله صلى الله عليه وسلم وأعطى الحجام أجره ، ولو كان سحتا لم يعطه ، والسحت والسحت لغتان قرئ بهما ; قرأ أبو عمرو وابن كثير والكسائي بضمتين ، والباقون بضم السين وحدها ، وروى العباس بن الفضل عن خارجة بن مصعب عن نافع \" أكالون للسحت \" بفتح السين وإسكان الحاء وهذا مصدر من سحته ; يقال : أسحت وسحت بمعنى واحد . وقال الزجاج : سحته ذهب به قليلا قليلا .\nقوله تعالى : فإن جاءوك فاحكم بينهم أو أعرض عنهم هذا تخيير من الله تعالى ; ذكره القشيري ; وتقدم معناه أنهم كانوا أهل موادعة لا أهل ذمة ; فإن النبي صلى الله عليه وسلم لما قدم المدينة وادع اليهود ، ولا يجب علينا الحكم بين الكفار إذا لم يكونوا أهل ذمة ، بل يجوز الحكم إن أردنا . فأما أهل الذمة فهل يجب علينا الحكم بينهم إذا ترافعوا إلينا ؟ قولان للشافعي ; وإن ارتبطت الخصومة بمسلم يجب الحكم . قال المهدوي : أجمع العلماء على أن على الحاكم أن يحكم بين المسلم والذمي ، واختلفوا في الذميين ; فذهب بعضهم إلى أن الآية محكمة وأن الحاكم مخير ; روي ذلك عن النخعي والشعبي وغيرهما ، وهو مذهب مالك والشافعي وغيرهما ، سوى ما روي عن مالك في ترك إقامة الحد على أهل الكتاب في الزنى ; فإنه إن زنى المسلم بالكتابية حد ولا حد عليها ، فإن كان الزانيان ذميين فلا حد عليهما ; وهو مذهب أبي حنيفة ومحمد بن الحسن وغيرهما ، وقد روي عن أبي حنيفة أيضا أنه قال : يجلدان ولا يرجمان ، وقال الشافعي وأبو يوسف وأبو ثور وغيرهم : عليهما الحد إن أتيا راضيين بحكمنا . قال ابن خويز منداد : ولا يرسل الإمام إليهم إذا استعدى بعضهم على بعض ، ولا يحضر الخصم مجلسه إلا أن يكون فيما يتعلق بالمظالم التي ينتشر منها الفساد كالقتل ونهب المنازل وأشباه ذلك ، فأما الديون والطلاق وسائر المعاملات فلا يحكم بينهم إلا بعد التراضي ، والاختيار له ألا يحكم ويردهم إلى حكامهم . فإن حكم بينهم حكم بحكم الإسلام ، وأما إجبارهم على حكم المسلمين فيما ينتشر منه الفساد فليس على الفساد عاهدناهم ، وواجب قطع الفساد عنهم ، منهم ومن غيرهم ; لأن في ذلك حفظ أموالهم ودمائهم ; ولعل في دينهم استباحة ذلك فينتشر منه الفساد بيننا ; ولذلك منعناهم أن يبيعوا الخمر جهارا وأن يظهروا الزنى وغير ذلك من القاذورات ; لئلا يفسد بهم سفهاء المسلمين ، وأما الحكم فيما يختص به دينهم من الطلاق والزنى وغيره فليس يلزمهم أن يتدينوا بديننا ، وفي الحكم بينهم بذلك إضرار بحكامهم وتغيير ملتهم ، وليس كذلك الديون والمعاملات ; لأن فيها وجها من المظالم وقطع الفساد . والله أعلم .\nوفي الآية قول ثان : وهو ما روي عن عمر بن عبد العزيز والنخعي أيضا أن التخيير المذكور في الآية منسوخ بقوله تعالى : وأن احكم بينهم بما أنزل الله وأن على الحاكم أن يحكم بينهم ; وهو مذهب عطاء الخراساني وأبي حنيفة وأصحابه وغيرهم ، وروي عن عكرمة أنه قال : فإن جاءوك فاحكم بينهم أو أعرض عنهم نسختها آية أخرى وأن احكم بينهم بما أنزل الله ، وقال مجاهد : لم ينسخ من \" المائدة \" إلا آيتان ; قوله : فاحكم بينهم أو أعرض عنهم نسختها وأن احكم بينهم بما أنزل الله ; وقوله : لا تحلوا شعائر الله نسختها فاقتلوا المشركين حيث وجدتموهم ، وقال الزهري : مضت السنة أن يرد أهل الكتاب في حقوقهم ومواريثهم إلى أهل دينهم ، إلا أن يأتوا راغبين في حكم الله فيحكم بينهم بكتاب الله . قال السمرقندي : وهذا القول يوافق قول أبي حنيفة إنه لا يحكم بينهم ما لم يتراضوا بحكمنا ، وقال النحاس في \" الناسخ والمنسوخ \" له : قوله تعالى : فإن جاءوك فاحكم بينهم أو أعرض عنهم منسوخ ; لأنه إنما نزل أول ما قدم النبي صلى الله عليه وسلم المدينة واليهود فيها يومئذ كثير ، وكان الأدعى لهم والأصلح أن يردوا إلى أحكامهم ، فلما قوي الإسلام أنزل الله عز وجل وأن احكم بينهم بما أنزل الله . وقاله ابن عباس ومجاهد وعكرمة والزهري وعمر بن عبد العزيز والسدي ; وهو الصحيح من قول الشافعي ; قال في كتاب الجزية : ولا خيار له إذا تحاكموا إليه ; لقوله عز وجل : حتى يعطوا الجزية عن يد وهم صاغرون . قال النحاس : وهذا من أصح الاحتجاجات ; لأنه إذا كان معنى قوله : وهم صاغرون أن تجري عليهم أحكام المسلمين وجب ألا يردوا إلى أحكامهم ; فإذا وجب هذا فالآية منسوخة ، وهو أيضا قول الكوفيين أبي حنيفة وزفر وأبي يوسف ومحمد ، لا اختلاف بينهم إذا تحاكم أهل الكتاب إلى الإمام أنه ليس له أن يعرض عنهم ، غير أن أبا حنيفة قال : إذا جاءت المرأة والزوج فعليه أن يحكم بينهما بالعدل ، وإن جاءت المرأة وحدها ولم يرض الزوج لم يحكم .\nوقال الباقون : يحكم فثبت أن قول أكثر العلماء إن الآية منسوخة مع ما ثبت فيها من توقيف ابن عباس ; ولو لم يأت الحديث عن ابن عباس لكان النظر يوجب أنها منسوخة ; لأنهم قد أجمعوا أن أهل الكتاب إذا تحاكموا إلى الإمام فله أن ينظر بينهم ، وأنه إذا نظر بينهم مصيب عند الجماعة ، وألا يعرض عنهم فيكون عند بعض العلماء تاركا فرضا ، فاعلا ما لا يحل ولا يسعه . قال النحاس : ولمن قال بأنها منسوخة من الكوفيين قول آخر ; منهم من يقول : على الإمام إذا علم من أهل الكتاب حدا من حدود الله عز وجل أن يقيمه وإن لم يتحاكموا إليه ويحتج بأن قول الله عز وجل : وأن احكم بينهم يحتمل أمرين :\nأحدهما : وأن احكم بينهم إذا تحاكموا إليك .\nوالآخر : وأن احكم بينهم وإن لم يتحاكموا إليك - إذا علمت ذلك منهم - قالوا : فوجدنا في كتاب الله تعالى وسنة رسوله صلى الله عليه وسلم ما يوجب إقامة الحق عليهم وإن لم يتحاكموا إلينا ; فأما ما في كتاب الله فقوله تعالى : يا أيها الذين آمنوا كونوا قوامين بالقسط شهداء لله ، وأما ما في السنة فحديث البراء بن عازب قال : مر على رسول الله صلى الله عليه وسلم بيهودي قد جلد وحمم فقال : أهكذا حد الزاني عندكم فقالوا : نعم . فدعا رجلا من علمائهم فقال : سألتك بالله أهكذا حد الزاني فيكم فقال : لا . الحديث ، وقد تقدم . قال النحاس : فاحتجوا بأن النبي صلى الله عليه وسلم حكم بينهم ولم يتحاكموا إليه في هذا الحديث . فإن قال قائل : ففي حديث مالك عن نافع عن ابن عمر أن اليهود أتوا النبي صلى الله عليه وسلم ; قيل له : ليس في حديث مالك أيضا أن اللذين زنيا رضيا بالحكم وقد رجمهما النبي صلى الله عليه وسلم . قال أبو عمر بن عبد البر : لو تدبر من احتج بحديث البراء لم يحتج ; لأن في درج الحديث تفسير قوله عز وجل : إن أوتيتم هذا فخذوه وإن لم تؤتوه فاحذروا يقول : إن أفتاكم بالجلد والتحميم فخذوه ، وإن أفتاكم بالرجم فاحذروا ، دليل على أنهم حكموه ، وذلك بين في حديث ابن عمر وغيره . فإن قال قائل : ليس في حديث ابن عمر أن الزانيين حكما رسول الله صلى الله عليه وسلم ولا رضيا بحكمه . قيل له : حد الزاني حق من حقوق الله تعالى على الحاكم إقامته . ومعلوم أن اليهود كان لهم حاكم يحكم بينهم ، ويقيم حدودهم عليهم ، وهو الذي حكم رسول الله صلى الله عليه وسلم . والله أعلم .\nقوله تعالى : وإن حكمت فاحكم بينهم بالقسط روى النسائي عن ابن عباس قال كان قريظة والنضير ، وكان النضير أشرف من قريظة ، وكان إذا قتل رجل من قريظة رجلا من النضير قتل به ، وإذا قتل رجل من النضير رجلا من قريظة ودى مائة وسق من تمر ; فلما بعث رسول الله صلى الله عليه وسلم قتل رجل من النضير رجلا من قريظة فقالوا : ادفعوه إلينا لنقتله ; فقالوا : بيننا وبينكم النبي صلى الله عليه وسلم فنزلت : وإن حكمت فاحكم بينهم بالقسط النفس بالنفس ، ونزلت:أفحكم الجاهلية يبغون\n                                    ",
        "saadi": "سَمَّٰعُونَ لِلۡكَذِبِ أَكَّٰلُونَ لِلسُّحۡتِۚ فَإِن جَآءُوكَ فَٱحۡكُم بَيۡنَهُمۡ أَوۡ أَعۡرِضۡ عَنۡهُمۡۖ وَإِن تُعۡرِضۡ عَنۡهُمۡ فَلَن يَضُرُّوكَ شَيۡ‍ٔٗاۖ وَإِنۡ حَكَمۡتَ فَٱحۡكُم بَيۡنَهُم بِٱلۡقِسۡطِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٢٤\n                                        \n                                        \n                                        \n                                        { سَمَّاعُونَ لِلْكَذِبِ } والسمع هاهنا سمع استجابة، أي: من قلة دينهم وعقلهم، أن استجابوا لمن دعاهم إلى القول الكذب. { أَكَّالُونَ لِلسُّحْتِ } أي: المال الحرام، بما يأخذونه على سفلتهم وعوامهم من المعلومات والرواتب، التي بغير الحق، فجمعوا بين اتباع الكذب وأكل الحرام. { فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ } فأنت مخير في ذلك. وليست هذه منسوخة، فإنه-عند تحاكم هذا الصنف إليه- يخير بين أن يحكم بينهم، أو يعرض عن الحكم بينهم، بسبب أنه لا قصد لهم في الحكم الشرعي إلا أن يكون موافقا لأهوائهم، وعلى هذا فكل مستفت ومتحاكم إلى عالم، يعلم من حاله أنه إن حكم عليه لم يرض، لم يجب الحكم ولا الإفتاء لهم، فإن حكم بينهم وجب أن يحكم بالقسط، ولهذا قال: { وَإِن تُعْرِضْ عَنْهُمْ فَلَن يَضُرُّوكَ شَيْئًا وَإِنْ حَكَمْتَ فَاحْكُم بَيْنَهُم بِالْقِسْطِ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ } حتى ولو كانوا ظلمة وأعداء، فلا يمنعك ذلك من العدل في الحكم بينهم. وفي هذا بيان فضيلة العدل والقسط في الحكم بين الناس، وأن الله تعالى يحبه.\n                                    "
      },
      "originalText": "سَمَّٰعُونَ لِلۡكَذِبِ أَكَّٰلُونَ لِلسُّحۡتِۚ فَإِن جَآءُوكَ فَٱحۡكُم بَيۡنَهُمۡ أَوۡ أَعۡرِضۡ عَنۡهُمۡۖ وَإِن تُعۡرِضۡ عَنۡهُمۡ فَلَن يَضُرُّوكَ شَيۡ‍ٔٗاۖ وَإِنۡ حَكَمۡتَ فَٱحۡكُم بَيۡنَهُم بِٱلۡقِسۡطِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٢٤"
    },
    {
      "number": 712,
      "text": "وَكَيْفَ يُحَكِّمُونَكَ وَعِنْدَهُمُ التَّوْرَاةُ فِيهَا حُكْمُ اللَّهِ ثُمَّ يَتَوَلَّوْنَ مِنْ بَعْدِ ذَٰلِكَ ۚ وَمَا أُولَٰئِكَ بِالْمُؤْمِنِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 43,
      "juz": 6,
      "manzil": 2,
      "page": 115,
      "ruku": 91,
      "hizbQuarter": 46,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَيۡفَ يُحَكِّمُونَكَ وَعِندَهُمُ ٱلتَّوۡرَىٰةُ فِيهَا حُكۡمُ ٱللَّهِ ثُمَّ يَتَوَلَّوۡنَ مِنۢ بَعۡدِ ذَٰلِكَۚ وَمَآ أُوْلَٰٓئِكَ بِٱلۡمُؤۡمِنِينَ ٣٤\n                                    \n                                    \n                                    ثم قال تعالى منكرا عليهم في آرائهم الفاسدة ومقاصدهم الذائغة في تركهم ما يعتقدون صحته من الكتاب الذي بأيديهم الذي يزعمون أنهم مأمورون بالتمسك به أبدا ثم خرجوا عن حكمه وعدلوا إلى غيره مما يعتقدون في نفس الأمر بطلانه وعدم لزومه لهم فقال\" وكيف يحكمونك وعندهم التوراة فيها حكم الله ثم يتولون من بعد ذلك وما أولئك بالمؤمنين \".\n                                    ",
        "qortoby": "وَكَيۡفَ يُحَكِّمُونَكَ وَعِندَهُمُ ٱلتَّوۡرَىٰةُ فِيهَا حُكۡمُ ٱللَّهِ ثُمَّ يَتَوَلَّوۡنَ مِنۢ بَعۡدِ ذَٰلِكَۚ وَمَآ أُوْلَٰٓئِكَ بِٱلۡمُؤۡمِنِينَ ٣٤\n                                    \n                                    \n                                    قوله تعالى : وكيف يحكمونك وعندهم التوراة فيها حكم الله ثم يتولون من بعد ذلك وما أولئك بالمؤمنين\nقوله تعالى : وكيف يحكمونك وعندهم التوراة فيها حكم الله قال الحسن : هو الرجم ، وقال قتادة : هو القود ، ويقال : هل يدل قوله تعالى : فيها حكم الله على أنه لم ينسخ ؟ الجواب : وقال أبو علي : نعم ; لأنه لو نسخ لم يطلق عليه بعد النسخ أنه حكم الله ، كما لا يطلق أن حكم الله تحليل الخمر أو تحريم السبت . وقوله : وما أولئك بالمؤمنين أي : بحكمك أنه من عند الله ، وقال أبو علي : إن من طلب غير حكم الله من حيث لم يرض به فهو كافر ; وهذه حالة اليهود .\n                                    ",
        "saadi": "وَكَيۡفَ يُحَكِّمُونَكَ وَعِندَهُمُ ٱلتَّوۡرَىٰةُ فِيهَا حُكۡمُ ٱللَّهِ ثُمَّ يَتَوَلَّوۡنَ مِنۢ بَعۡدِ ذَٰلِكَۚ وَمَآ أُوْلَٰٓئِكَ بِٱلۡمُؤۡمِنِينَ ٣٤\n                                        \n                                        \n                                        \n                                        ثم قال متعجبا لهم { وَكَيْفَ يُحَكِّمُونَكَ وَعِندَهُمُ التَّوْرَاةُ فِيهَا حُكْمُ اللَّهِ ثُمَّ يَتَوَلَّوْنَ مِن بَعْدِ ذَلِكَ وَمَا أُولَئِكَ بِالْمُؤْمِنِينَ } فإنهم -لو كانوا مؤمنين عاملين بما يقتضيه الإيمان ويوجبه- لم يصدفوا عن حكم الله الذي في التوراة التي بين أيديهم، لعلهم أن يجدوا عندك ما يوافق أهواءهم. وحين حكمت بينهم بحكم الله الموافق لما عندهم أيضا، لم يرضوا بذلك بل أعرضوا عنه، فلم يرتضوه أيضا. قال تعالى: { وَمَا أُولَئِكَ } الذين هذا صنيعهم { بِالْمُؤْمِنِينَ } أي: ليس هذا دأب المؤمنين، وليسوا حريين بالإيمان. لأنهم جعلوا آلهتهم أهواءهم، وجعلوا أحكام الإيمان تابعة لأهوائهم.\n                                    "
      },
      "originalText": "وَكَيۡفَ يُحَكِّمُونَكَ وَعِندَهُمُ ٱلتَّوۡرَىٰةُ فِيهَا حُكۡمُ ٱللَّهِ ثُمَّ يَتَوَلَّوۡنَ مِنۢ بَعۡدِ ذَٰلِكَۚ وَمَآ أُوْلَٰٓئِكَ بِٱلۡمُؤۡمِنِينَ ٣٤"
    },
    {
      "number": 713,
      "text": "إِنَّا أَنْزَلْنَا التَّوْرَاةَ فِيهَا هُدًى وَنُورٌ ۚ يَحْكُمُ بِهَا النَّبِيُّونَ الَّذِينَ أَسْلَمُوا لِلَّذِينَ هَادُوا وَالرَّبَّانِيُّونَ وَالْأَحْبَارُ بِمَا اسْتُحْفِظُوا مِنْ كِتَابِ اللَّهِ وَكَانُوا عَلَيْهِ شُهَدَاءَ ۚ فَلَا تَخْشَوُا النَّاسَ وَاخْشَوْنِ وَلَا تَشْتَرُوا بِآيَاتِي ثَمَنًا قَلِيلًا ۚ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَٰئِكَ هُمُ الْكَافِرُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 44,
      "juz": 6,
      "manzil": 2,
      "page": 115,
      "ruku": 92,
      "hizbQuarter": 46,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّآ أَنزَلۡنَا ٱلتَّوۡرَىٰةَ فِيهَا هُدٗى وَنُورٞۚ يَحۡكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسۡلَمُواْ لِلَّذِينَ هَادُواْ وَٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ بِمَا ٱسۡتُحۡفِظُواْ مِن كِتَٰبِ ٱللَّهِ وَكَانُواْ عَلَيۡهِ شُهَدَآءَۚ فَلَا تَخۡشَوُاْ ٱلنَّاسَ وَٱخۡشَوۡنِ وَلَا تَشۡتَرُواْ بِ‍َٔايَٰتِي ثَمَنٗا قَلِيلٗاۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ ٤٤\n                                    \n                                    \n                                    ثم مدح التوراة التي أنزلها على عبده ورسوله موسى بن عمران فقال : ( إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا للذين هادوا ) أي : لا يخرجون عن حكمها ولا يبدلونها ولا يحرفونها ( والربانيون والأحبار ) أي : وكذلك الربانيون منهم وهم العباد العلماء ، والأحبار وهم العلماء ( بما استحفظوا من كتاب الله ) أي : بما استودعوا من كتاب الله الذي أمروا أن يظهروه ويعملوا به ( وكانوا عليه شهداء فلا تخشوا الناس واخشون ) أي : لا تخافوا منهم وخافوني ( ولا تشتروا بآياتي ثمنا قليلا ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) فيه قولان سيأتي بيانهما .\nسبب آخر لنزول هذه الآيات الكريمة .\nقال الإمام أحمد : حدثنا إبراهيم بن العباس حدثنا عبد الرحمن بن أبي الزناد عن أبيه ، عن عبيد الله بن عبد الله عن ابن عباس قال : إن الله أنزل : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) و ( فأولئك هم الظالمون ) [ المائدة : 45 ] ( فأولئك هم الفاسقون ) [ المائدة : 47 ] قال : قال ابن عباس : أنزلها الله في الطائفتين من اليهود كانت إحداهما قد قهرت الأخرى في الجاهلية ، حتى ارتضوا أو اصطلحوا على أن كل قتيل قتلته العزيزة من الذليلة فديته خمسون وسقا ، وكل قتيل قتلته الذليلة من العزيزة فديته مائة وسق ، فكانوا على ذلك حتى قدم النبي صلى الله عليه وسلم المدينة ، فذلت الطائفتان كلتاهما ، لمقدم رسول الله صلى الله عليه وسلم ، ويومئذ لم يظهر ، ولم يوطئهما عليه ، وهو في الصلح ، فقتلت الذليلة من العزيزة قتيلا فأرسلت العزيزة إلى الذليلة : أن ابعثوا لنا بمائة وسق ، فقالت الذليلة : وهل كان هذا في حيين قط دينهما واحد ، ونسبهما واحد ، وبلدهما واحد : دية بعضهم نصف دية بعض . إنما أعطيناكم هذا ضيما منكم لنا ، وفرقا منكم ، فأما إذ قدم محمد فلا نعطيكم ذلك ، فكادت الحرب تهيج بينهما ، ثم ارتضوا على أن يجعلوا رسول الله صلى الله عليه وسلم بينهم ، ثم ذكرت العزيزة فقالت : والله ما محمد بمعطيكم منهم ضعف ما يعطيهم منكم ولقد صدقوا ، ما أعطونا هذا إلا ضيما منا وقهرا لهم ، فدسوا إلى محمد : من يخبر لكم رأيه ، إن أعطاكم ما تريدون حكمتموه وإن لم يعطكم حذرتم فلم تحكموه . فدسوا إلى رسول الله صلى الله عليه وسلم ناسا من المنافقين ليخبروا لهم رأي رسول الله صلى الله عليه وسلم فلما جاءوا رسول الله صلى الله عليه وسلم أخبر الله رسوله صلى الله عليه وسلم بأمرهم كله ، وما أرادوا ، فأنزل الله تعالى : ( يا أيها الرسول لا يحزنك الذين يسارعون في الكفر ) إلى قوله : ( الفاسقون ) ففيهم - والله - أنزل ، وإياهم عنى الله عز وجل .\nورواه أبو داود من حديث ابن أبي الزناد عن أبيه ، بنحوه .\nوقال أبو جعفر بن جرير : حدثنا هناد بن السري وأبو كريب قالا : حدثنا يونس بن بكير عن محمد بن إسحاق حدثني داود بن الحصين عن عكرمة عن ابن عباس أن الآيات في \" المائدة \" ، قوله : ( فاحكم بينهم أو أعرض عنهم ) إلى ( المقسطين ) إنما أنزلت في الدية في بني النضير وبني قريظة وذلك أن قتلى بني النضير كان لهم شرف ، تؤدى الدية كاملة ، وأن قريظة كانوا يودون نصف الدية فتحاكموا في ذلك إلى رسول الله صلى الله عليه وسلم ، فأنزل الله ذلك فيهم ، فحملهم رسول الله صلى الله عليه وسلم على الحق في ذلك ، فجعل الدية في ذلك سواء - والله أعلم ؛ أي ذلك كان .\nورواه أحمد وأبو داود والنسائي من حديث ابن إسحاق .\nثم قال ابن جرير : حدثنا أبو كريب حدثنا عبيد الله بن موسى عن علي بن صالح عن سماك عن عكرمة عن ابن عباس قال : كانت قريظة والنضير وكانت النضير أشرف من قريظة فكان إذا قتل رجل من قريظة رجلا من النضير قتل به ، وإذا قتل رجل من النضير رجلا من قريظة ودي مائة وسق تمر . فلما بعث رسول الله صلى الله عليه وسلم ، قتل رجل من النضير رجلا من قريظة فقالوا : ادفعوه إلينا فقالوا : بيننا وبينكم رسول الله صلى الله عليه وسلم . فنزلت : ( وإن حكمت فاحكم بينهم بالقسط )\nورواه أبو داود والنسائي وابن حبان والحاكم في المستدرك ، من حديث عبيد الله بن موسى بنحوه .\nوهكذا قال قتادة ومقاتل بن حيان وابن زيد وغير واحد .\nوقد روى العوفي وعلي بن أبي طلحة الوالبي عن ابن عباس : أن هذه الآيات نزلت في اليهوديين اللذين زنيا ، كما تقدمت الأحاديث بذلك . وقد يكون اجتمع هذان السببان في وقت واحد ، فنزلت هذه الآيات في ذلك كله ، والله أعلم .\nولهذا قال بعد ذلك : ( وكتبنا عليهم فيها أن النفس بالنفس والعين بالعين ) إلى آخرها ، وهذا يقوي أن سبب النزول قضية القصاص ، والله سبحانه وتعالى أعلم .\nوقوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال البراء بن عازب وحذيفة بن اليمان وابن عباس وأبو مجلز وأبو رجاء العطاردي وعكرمة وعبيد الله بن عبد الله والحسن البصري وغيرهم : نزلت في أهل الكتاب - زاد الحسن البصري : وهي علينا واجبة .\nوقال عبد الرزاق عن سفيان الثوري عن منصور عن إبراهيم قال : نزلت هذه الآيات في بني إسرائيل ورضي الله لهذه الأمة بها . رواه ابن جرير .\nوقال ابن جرير أيضا : حدثنا يعقوب حدثنا هشيم أخبرنا عبد الملك بن أبي سليمان عن سلمة بن كهيل عن علقمة ومسروق أنهما سألا ابن مسعود عن الرشوة فقال : من السحت : قال : فقالا وفي الحكم ؟ قال : ذاك الكفر ! ثم تلا ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون )\nوقال السدي : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) يقول : ومن لم يحكم بما أنزلت فتركه عمدا ، أو جار وهو يعلم ، فهو من الكافرين [ به ]\nوقال علي بن أبي طلحة عن ابن عباس قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : من جحد ما أنزل الله فقد كفر . ومن أقر به ولم يحكم فهو ظالم فاسق . رواه ابن جرير .\nثم اختار أن الآية المراد بها أهل الكتاب أو من جحد حكم الله المنزل في الكتاب .\nوقال عبد الرزاق عن الثوري عن زكريا عن الشعبي : ( ومن لم يحكم بما أنزل الله ) قال : للمسلمين .\nوقال ابن جرير : حدثنا ابن المثنى حدثنا عبد الصمد حدثنا شعبة عن ابن أبي السفر عن الشعبي : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : هذا في المسلمين ( ومن لم يحكم بما أنزل الله فأولئك هم الظالمون ) قال : هذا في اليهود ( ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون ) قال : هذا في النصارى .\nوكذا رواه هشيم والثوري عن زكريا بن أبي زائدة عن الشعبي .\nوقال عبد الرزاق أيضا : أخبرنا معمر عن ابن طاوس عن أبيه قال : سئل ابن عباس عن قوله : ( ومن لم يحكم [ بما أنزل الله فأولئك هم الكافرون ] ) قال : هي به كفر - قال ابن طاوس : وليس كمن كفر بالله وملائكته وكتبه ورسله .\nوقال الثوري عن ابن جريج عن عطاء أنه قال : كفر دون كفر ، وظلم دون ظلم ، وفسق دون فسق . رواه ابن جرير .\nوقال وكيع عن سفيان عن سعيد المكي عن طاوس : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : ليس بكفر ينقل عن الملة .\nوقال ابن أبي حاتم : حدثنا محمد بن عبد الله بن يزيد المقري حدثنا سفيان بن عيينة عن هشام بن حجير عن طاوس عن ابن عباس في قوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) قال : ليس بالكفر الذي يذهبون إليه .\nورواه الحاكم في مستدركه ، عن حديث سفيان بن عيينة وقال : صحيح على شرط الشيخين ولم يخرجاه .\n                                    ",
        "qortoby": "إِنَّآ أَنزَلۡنَا ٱلتَّوۡرَىٰةَ فِيهَا هُدٗى وَنُورٞۚ يَحۡكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسۡلَمُواْ لِلَّذِينَ هَادُواْ وَٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ بِمَا ٱسۡتُحۡفِظُواْ مِن كِتَٰبِ ٱللَّهِ وَكَانُواْ عَلَيۡهِ شُهَدَآءَۚ فَلَا تَخۡشَوُاْ ٱلنَّاسَ وَٱخۡشَوۡنِ وَلَا تَشۡتَرُواْ بِ‍َٔايَٰتِي ثَمَنٗا قَلِيلٗاۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ ٤٤\n                                    \n                                    \n                                    إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا للذين هادوا والربانيون والأحبار بما استحفظوا من كتاب الله وكانوا عليه شهداء فلا تخشوا الناس واخشون ولا تشتروا بآياتي ثمنا قليلا ومن لم يحكم بما أنزل الله فأولئلاك هم الكافرون\nقوله تعالى : أنزلنا التوراة فيها هدى ونور أي : بيان وضياء وتعريف أن محمدا صلى الله عليه وسلم حق . هدى في موضع رفع بالابتداء ونور عطف عليه يحكم بها النبيون الذين أسلموا للذين هادوا قيل : المراد بالنبيين محمد صلى الله عليه وسلم ، وعبر عنه بلفظ الجمع ، وقيل : كل من بعث من بعد موسى بإقامة التوراة ، وأن اليهود قالت : إن الأنبياء كانوا يهودا . وقالت النصارى : كانوا نصارى ; فبين الله عز وجل كذبهم . ومعنى أسلموا صدقوا بالتوراة من لدن موسى إلى زمان عيسى عليهما السلام وبينهما ألف نبي ; ويقال : أربعة آلاف ، ويقال : أكثر من ذلك ، كانوا يحكمون بما في التوراة ، وقيل : معنى أسلموا خضعوا وانقادوا لأمر الله فيما بعثوا به ، وقيل : أي : يحكم بها النبيون الذين هم على دين إبراهيم صلى الله عليه وسلم والمعنى واحد . ومعنى ( للذين هادوا ) على الذين هادوا فاللام بمعنى \" على \" ، وقيل : المعنى يحكم بها النبيون الذين أسلموا للذين هادوا وعليهم ، فحذف \" عليهم \" . الذين أسلموا هاهنا نعت فيه المدح مثل بسم الله الرحمن الرحيم . هادوا أي : تابوا من الكفر ، وقيل : فيه تقديم وتأخير ; أي : إنا أنزلنا التوراة فيها هدى ونور للذين هادوا يحكم بها النبيون والربانيون والأحبار ; أي : ويحكم بها الربانيون وهم الذين يسوسون الناس بالعلم ويربونهم بصغاره قبل كباره ; عن ابن عباس وغيره ، وقد تقدم في آل عمران ، وقال أبو رزين : الربانيون العلماء الحكماء والأحبار . قال ابن عباس : هم الفقهاء : والحبر والحبر الرجل العالم وهو مأخوذ من التحبير وهو التحسين ، فهم يحبرون العلم أي : يبينونه ويزينونه ، وهو محبر في صدورهم . قال مجاهد : الربانيون فوق العلماء ، والألف واللام للمبالغة . قال الجوهري : والحبر والحبر واحد أحبار اليهود ، وبالكسر أفصح : لأنه يجمع على أفعال دون الفعول ; قال الفراء : هو حبر بالكسر يقال ذلك للعالم ، وقال الثوري : سألت الفراء لم سمي الحبر حبرا ؟ فقال : يقال للعالم حبر وحبر فالمعنى مداد حبر ثم حذف كما قال : واسأل القرية أي : أهل القرية . قال : فسألت الأصمعي فقال : ليس هذا بشيء ; إنما سمي حبرا لتأثيره ، يقال : على أسنانه حبر أي : صفرة أو سواد ، وقال أبو العباس : سمي الحبر الذي يكتب به حبرا لأنه يحبر به أي : يحقق به ، وقال أبو عبيد : والذي عندي في واحد الأحبار الحبر بالفتح ومعناه العالم بتحبير الكلام والعلم وتحسينه . قال : وهكذا يرويه المحدثون كلهم بالفتح ، والحبر الذي يكتب به وموضعه المحبرة بالكسر . والحبر أيضا الأثر والجمع حبور . عن يعقوب . بما استحفظوا من كتاب الله أي استودعوا من علمه ، والباء متعلقة ب \" الربانيين والأحبار \" كأنه قال : والعلماء بما استحفظوا . أو تكون متعلقة ب ( يحكم ) أي : يحكمون بما استحفظوا . وكانوا عليه شهداء أي : على الكتاب أنه من عند الله . ابن عباس : شهداء على حكم النبي صلى الله عليه وسلم أنه في التوراة . فلا تخشوا الناس أي : في إظهار صفة محمد صلى الله عليه وسلم ، وإظهار الرجم . واخشون أي : في كتمان ذلك ; فالخطاب لعلماء اليهود ، وقد يدخل بالمعنى كل من كتم حقا وجب عليه ولم يظهره ، وتقدم معنى ولا تشتروا بآياتي ثمنا قليلا مستوفى .\nقوله تعالى : ومن لم يحكم بما أنزل الله فأولئك هم الكافرون والظالمون والفاسقون نزلت كلها في الكفار ; ثبت ذلك في صحيح مسلم من حديث البراء ، وقد تقدم ، وعلى هذا المعظم . فأما المسلم فلا يكفر وإن ارتكب كبيرة . وقيل : فيه إضمار ; أي : ومن لم يحكم بما أنزل الله ردا للقرآن ، وجحدا لقول الرسول عليه الصلاة والسلام فهو كافر ; قاله ابن عباس ومجاهد ، فالآية عامة على هذا . قال ابن مسعود والحسن : هي عامة في كل من لم يحكم بما أنزل الله من المسلمين واليهود والكفار أي : معتقدا ذلك ومستحلا له ; فأما من فعل ذلك وهو معتقد أنه راكب محرم فهو من فساق المسلمين ، وأمره إلى الله تعالى إن شاء عذبه ، وإن شاء غفر له ، وقال ابن عباس في رواية : ومن لم يحكم بما أنزل الله فقد فعل فعلا يضاهي أفعال الكفار ، وقيل : أي : ومن لم يحكم بجميع ما أنزل الله فهو كافر ; فأما من حكم بالتوحيد ولم يحكم ببعض الشرائع فلا يدخل في هذه الآية ، والصحيح الأول ، إلا أن الشعبي قال : هي في اليهود خاصة ، واختاره النحاس ; قال : ويدل على ذلك ثلاثة أشياء ; منها أن اليهود قد ذكروا قبل هذا في قوله : للذين هادوا ; فعاد الضمير عليهم ، ومنها أن سياق الكلام يدل على ذلك ; ألا ترى أن بعده وكتبنا عليهم فهذا الضمير لليهود بإجماع ; وأيضا فإن اليهود هم الذين أنكروا الرجم والقصاص . فإن قال قائل : \" من \" إذا كانت للمجازاة فهي عامة إلا أن يقع دليل على تخصيصها ؟ قيل له : \" من \" هنا بمعنى الذي مع ما ذكرناه من الأدلة ; والتقدير : واليهود الذين لم يحكموا بما أنزل الله فأولئك هم الكافرون ; فهذا من أحسن ما قيل في هذا ; ويروى أن حذيفة سئل عن هذه الآيات أهي في بني إسرائيل ؟ قال : نعم هي فيهم ، ولتسلكن سبيلهم حذو النعل بالنعل ، وقيل : الكافرون للمسلمين ، والظالمون لليهود ، والفاسقون للنصارى ; وهذا اختيار أبي بكر بن العربي ، قال : لأنه ظاهر الآيات ، وهو اختيار ابن عباس وجابر بن زيد وابن أبي زائدة وابن شبرمة والشعبي أيضا . قال طاوس وغيره : ليس بكفر ينقل عن الملة ، ولكنه كفر دون كفر ، وهذا يختلف إن حكم بما عنده على أنه من عند الله ، فهو تبديل له يوجب الكفر ; وإن حكم به هوى ومعصية فهو ذنب تدركه المغفرة على أصل أهل السنة في الغفران للمذنبين . قال القشيري : ومذهب الخوارج أن من ارتشى وحكم بغير حكم الله فهو كافر ، وعزي هذا إلى الحسن والسدي ، وقال الحسن أيضا : أخذ الله عز وجل على الحكام ثلاثة أشياء : ألا يتبعوا الهوى ، وألا يخشوا الناس ويخشوه ، وألا يشتروا بآياته ثمنا قليلا .\n                                    ",
        "saadi": "إِنَّآ أَنزَلۡنَا ٱلتَّوۡرَىٰةَ فِيهَا هُدٗى وَنُورٞۚ يَحۡكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسۡلَمُواْ لِلَّذِينَ هَادُواْ وَٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ بِمَا ٱسۡتُحۡفِظُواْ مِن كِتَٰبِ ٱللَّهِ وَكَانُواْ عَلَيۡهِ شُهَدَآءَۚ فَلَا تَخۡشَوُاْ ٱلنَّاسَ وَٱخۡشَوۡنِ وَلَا تَشۡتَرُواْ بِ‍َٔايَٰتِي ثَمَنٗا قَلِيلٗاۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ ٤٤\n                                        \n                                        \n                                        \n                                        { إِنَّا أَنْزَلْنَا التَّوْرَاةَ } على موسى بن عمران عليه الصلاة والسلام. { فِيهَا هُدًى } يهدي إلى الإيمان والحق، ويعصم من الضلالة { وَنُورٌ } يستضاء به في ظلم الجهل والحيرة والشكوك، والشبهات والشهوات، كما قال تعالى: { وَلَقَدْ آتَيْنَا مُوسَى وَهَارُونَ الْفُرْقَانَ وَضِيَاءً وَذِكْرًا لِلْمُتَّقِينَ } { يَحْكُمُ بِهَا } بيـن الذيـن هـادوا، أي: اليـهود فـي القضايـا والفتـاوى { النَّبِيُّونَ الَّذِينَ أَسْلَمُوا } لله وانقادوا لأوامره، الذين إسلامهم أعظم من إسلام غيرهم، وهم صفوة الله من العباد. فإذا كان هؤلاء النبيون الكرام والسادة للأنام قد اقتدوا بها وائتموا ومشوا خلفها، فما الذي منع هؤلاء الأراذل من اليهود من الاقتداء بها؟ وما الذي أوجب لهم أن ينبذوا أشرف ما فيها من الإيمان بمحمد صلى الله عليه وسلم، الذي لا يقبل عمل ظاهر وباطن، إلا بتلك العقيدة؟ هل لهم إمام في ذلك؟ نعم لهم أئمة دأبهم التحريف، وإقامة رياستهم ومناصبهم بين الناس، والتأكل بكتمان الحق، وإظهار الباطل، أولئك أئمة الضلال الذين يدعون إلى النار. وقوله: { وَالرَّبَّانِيُّونَ وَالْأَحْبَارُ } أي: وكذلك يحكم بالتوراة للذين هادواأئمة الدين من الربانيين، أي: العلماء العاملين المعلمين الذين يربون الناس بأحسن تربية، ويسلكون معهم مسلك الأنبياء المشفقين. والأحبار أي: العلماء الكبار الذين يقتدى بأقوالهم، وترمق آثارهم، ولهم لسان الصدق بين أممهم. وذلك الحكم الصادر منهم الموافق للحق { بِمَا اسْتُحْفِظُوا مِن كِتَابِ اللَّهِ وَكَانُوا عَلَيْهِ شُهَدَاءَ } أي: بسبب أن الله استحفظهم على كتابه، وجعلهم أمناء عليه، وهو أمانة عندهم، أوجب عليهم حفظه من الزيادة والنقصان والكتمان، وتعليمه لمن لا يعلمه. وهم شهداء عليه، بحيث أنهم المرجوع إليهم فيه، وفيما اشتبه على الناس منه، فالله تعالى قد حمل أهل العلم، ما لم يحمله الجهال، فيجب عليهم القيام بأعباء ما حملوا. وأن لا يقتدوا بالجهال، بالإخلاد إلى البطالة والكسل، وأن لا يقتصروا على مجرد العبادات القاصرة، من أنواع الذكر، والصلاة، والزكاة، والحج، والصوم، ونحو ذلك من الأمور، التي إذا قام بها غير أهل العلم سلموا ونجوا. وأما أهل العلم فكما أنهم مطالبون بالقيام بما عليهم أنفسهم، فإنهم مطالبون أن يعلموا الناس وينبهوهم على ما يحتاجون إليه من أمور دينهم، خصوصا الأمور الأصولية والتي يكثر وقوعها وأن لا يخشوا الناس بل يخشون ربهم، ولهذا قال: { فَلَا تَخْشَوُا النَّاسَ وَاخْشَوْنِ وَلَا تَشْتَرُوا بِآيَاتِي ثَمَنًا قَلِيلًا } فتكتمون الحق، وتظهرون الباطل، لأجل متاع الدنيا القليل، وهذه الآفات إذا سلم منها العالم فهو من توفيقه وسعادته، بأن يكون همه الاجتهاد في العلم والتعليم، ويعلم أن الله قد استحفظه ما أودعه من العلم واستشهده عليه، وأن يكون خائفا من ربه، ولا يمنعه خوف الناس وخشيتهم من القيام بما هو لازم له، وأن لا يؤثر الدنيا على الدين. كما أن علامة شقاوة العالم أن يكون مخلدا للبطالة، غير قائم بما أمر به، ولا مبال بما استحفظ عليه، قد أهمله وأضاعه، قد باع الدين بالدنيا، قد ارتشى في أحكامه، وأخذ المال على فتاويه، ولم يعلم عباد الله إلا بأجرة وجعالة. فهذا قد من الله عليه بمنة عظيمة، كفرها ودفع حظا جسيما، محروما منه غيره، فنسألك اللهم علما نافعا، وعملا متقبلا، وأن ترزقنا العفو والعافية من كل بلاء يا كريم. { وَمَن لَّمْ يَحْكُم بِمَا أَنْزَلَ اللَّهُ } من الحق المبين، وحكم بالباطل الذي يعلمه، لغرض من أغراضه الفاسدة { فَأُولَئِكَ هُمُ الْكَافِرُونَ } فالحكم بغير ما أنزل الله من أعمال أهل الكفر، وقد يكون كفرا ينقل عن الملة، وذلك إذا اعتقد حله وجوازه. وقد يكون كبيرة من كبائر الذنوب، ومن أعمال الكفر قد استحق من فعله العذاب الشديد.\n                                    "
      },
      "originalText": "إِنَّآ أَنزَلۡنَا ٱلتَّوۡرَىٰةَ فِيهَا هُدٗى وَنُورٞۚ يَحۡكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسۡلَمُواْ لِلَّذِينَ هَادُواْ وَٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ بِمَا ٱسۡتُحۡفِظُواْ مِن كِتَٰبِ ٱللَّهِ وَكَانُواْ عَلَيۡهِ شُهَدَآءَۚ فَلَا تَخۡشَوُاْ ٱلنَّاسَ وَٱخۡشَوۡنِ وَلَا تَشۡتَرُواْ بِ‍َٔايَٰتِي ثَمَنٗا قَلِيلٗاۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡكَٰفِرُونَ ٤٤"
    },
    {
      "number": 714,
      "text": "وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنَ بِالْعَيْنِ وَالْأَنْفَ بِالْأَنْفِ وَالْأُذُنَ بِالْأُذُنِ وَالسِّنَّ بِالسِّنِّ وَالْجُرُوحَ قِصَاصٌ ۚ فَمَنْ تَصَدَّقَ بِهِ فَهُوَ كَفَّارَةٌ لَهُ ۚ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 45,
      "juz": 6,
      "manzil": 2,
      "page": 115,
      "ruku": 92,
      "hizbQuarter": 46,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَتَبۡنَا عَلَيۡهِمۡ فِيهَآ أَنَّ ٱلنَّفۡسَ بِٱلنَّفۡسِ وَٱلۡعَيۡنَ بِٱلۡعَيۡنِ وَٱلۡأَنفَ بِٱلۡأَنفِ وَٱلۡأُذُنَ بِٱلۡأُذُنِ وَٱلسِّنَّ بِٱلسِّنِّ وَٱلۡجُرُوحَ قِصَاصٞۚ فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٞ لَّهُۥۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٥٤\n                                    \n                                    \n                                    وهذا أيضا مما وبخت به اليهود وقرعوا عليه ، فإن عندهم في نص التوراة : أن النفس بالنفس . وهم يخالفون ذلك عمدا وعنادا ، ويقيدون النضري من القرظي ، ولا يقيدون القرظي من النضري ، بل يعدلون إلى الدية ، كما خالفوا حكم التوراة المنصوص عندهم في رجم الزاني المحصن ، وعدلوا إلى ما اصطلحوا عليه من الجلد والتحميم والإشهار ; ولهذا قال هناك : ( ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ) لأنهم جحدوا حكم الله قصدا منهم وعنادا وعمدا ، وقال هاهنا : ( فأولئك هم الظالمون ) لأنهم لم ينصفوا المظلوم من الظالم في الأمر الذي أمر الله بالعدل والتسوية بين الجميع فيه ، فخالفوا وظلموا ، وتعدى بعضهم على بعض .\nوقال الإمام أحمد : حدثنا يحيى بن آدم حدثنا ابن المبارك عن يونس بن يزيد عن أبي علي بن يزيد - أخي يونس بن يزيد - عن الزهري عن أنس بن مالك أن رسول الله صلى الله عليه وسلم قرأها : ( وكتبنا عليهم فيها أن النفس بالنفس والعين بالعين ) نصب النفس ورفع العين .\nوكذا رواه أبو داود والترمذي والحاكم في مستدركه ، من حديث عبد الله بن المبارك وقال الترمذي : حسن غريب .\nوقال البخاري : تفرد ابن المبارك بهذا الحديث .\nوقد استدل كثير ممن ذهب من الأصوليين والفقهاء إلى أن شرع من قبلنا شرع لنا ، إذا حكي مقررا ولم ينسخ ، كما هو المشهور عن الجمهور ، وكما حكاه الشيخ أبو إسحاق الاسفراييني عن نص الشافعي وأكثر الأصحاب بهذه الآية ، حيث كان الحكم عندنا على وفقها في الجنايات عند جميع الأئمة .\nوقال الحسن البصري : هي عليهم وعلى الناس عامة . رواه ابن أبي حاتم .\nوقد حكى الشيخ أبو زكريا النووي في هذه المسألة ثلاثة أوجه ثالثها : أن شرع إبراهيم حجة دون غيره ، وصحح منها عدم الحجية ، ونقلها الشيخ أبو إسحاق الاسفراييني أقوالا عن الشافعي ورجح أنه حجة عند الجمهور من أصحابنا ، فالله أعلم .\nوقد حكى الإمام أبو نصر بن الصباغ رحمه الله ، في كتابه \" الشامل \" إجماع العلماء على الاحتجاج بهذه الآية على ما دلت عليه ، وقد احتج الأئمة كلهم على أن الرجل يقتل بالمرأة بعموم هذه الآية الكريمة ، وكذا ورد في الحديث الذي رواه النسائي وغيره : أن رسول الله صلى الله عليه وسلم كتب في كتاب عمرو بن حزم : \" أن الرجل يقتل بالمرأة \" وفي الحديث الآخر : \" المسلمون تتكافأ دماؤهم \" وهذا قول جمهور العلماء .\nوعن أمير المؤمنين علي بن أبي طالب أن الرجل إذا قتل المرأة لا يقتل بها ، إلا أن يدفع وليها إلى أوليائه نصف الدية ; لأن ديتها على النصف من دية الرجل ، وإليه ذهب أحمد في روايته [ عنه ] وحكي [ هذا ] عن الحسن [ البصري ] وعطاء وعثمان البتي ورواية عن أحمد [ به ] أن الرجل إذا قتل المرأة لا يقتل بها ، بل تجب ديتها .\nوهكذا احتج أبو حنيفة رحمه الله تعالى ، بعموم هذه الآية على أنه يقتل المسلم بالكافر الذمي ، وعلى قتل الحر بالعبد ، وقد خالفه الجمهور فيهما ، ففي الصحيحين عن أمير المؤمنين علي رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" لا يقتل مسلم بكافر \" وأما العبد فعن السلف في آثار متعددة : أنهم لم يكونوا يقيدون العبد من الحر ، ولا يقتلون حرا بعبد ، وجاء في ذلك أحاديث لا تصح ، وحكى الشافعي الإجماع على خلاف قول الحنفية في ذلك ، ولكن لا يلزم من ذلك بطلان قولهم إلا بدليل مخصص للآية الكريمة .\nويؤيد ما قاله ابن الصباغ من الاحتجاج بهذه الآية الكريمة الحديث الثابت في ذلك ، كما قال الإمام أحمد :\nحدثنا محمد بن أبي عدي حدثنا حميد عن أنس بن مالك : أن الربيع عمة أنس كسرت ثنية جارية ، فطلبوا إلى القوم العفو ، فأبوا ، فأتوا رسول الله صلى الله عليه وسلم فقال : \" القصاص \" . فقال أخوها أنس بن النضر : يا رسول الله ، تكسر ثنية فلانة ؟! فقال رسول الله صلى الله عليه وسلم : \" يا أنس ، كتاب الله القصاص \" . قال : فقال : لا والذي بعثك بالحق ، لا تكسر ثنية فلانة . قال : فرضي القوم ، فعفوا وتركوا القصاص ، فقال رسول الله صلى الله عليه وسلم : \" إن من عباد الله من لو أقسم على الله لأبره \" .\nأخرجاه في الصحيحين وقد رواه محمد بن عبد الله بن المثنى الأنصاري في الجزء المشهور من حديثه ، عن حميد عن أنس بن مالك أن الربيع بنت النضر عمته لطمت جارية فكسرت ثنيتها فعرضوا عليهم الأرش ، فأبوا فطلبوا الأرش والعفو فأبوا ، فأتوا رسول الله صلى الله عليه وسلم ، فأمرهم بالقصاص ، فجاء أخوها أنس بن النضر فقال : يا رسول الله أتكسر ثنية الربيع ؟ والذي بعثك بالحق لا تكسر ثنيتها . فقال النبي صلى الله عليه وسلم : \" يا أنس ، كتاب الله القصاص \" . فعفا القوم ، فقال رسول الله صلى الله عليه وسلم : \" إن من عباد الله من لو أقسم على الله لأبره \" . رواه البخاري عن الأنصاري . فأما الحديث الذي رواه أبو داود :\nحدثنا أحمد بن حنبل حدثنا معاذ بن هشام حدثنا أبي ، عن قتادة عن أبي نضرة عن عمران بن حصين أن غلاما لأناس فقراء قطع أذن غلام لأناس أغنياء ، فأتى أهله النبي صلى الله عليه وسلم فقالوا : يا رسول الله ، إنا أناس فقراء ، فلم يجعل عليه شيئا . وكذا رواه النسائي عن إسحاق ابن راهويه عن معاذ بن هشام الدستوائي عن أبيه عن قتادة به ، وهذا إسناد قوي رجاله كلهم ثقات فإنه حديث مشكل ، اللهم إلا أن يقال : إن الجاني كان قبل البلوغ ، فلا قصاص عليه ، ولعله تحمل أرش ما نقص من غلام الأغنياء عن الفقراء ، أو استعفاهم عنه .\nوقوله تعالى : ( والجروح قصاص ) قال علي بن أبي طلحة عن ابن عباس قال : تقتل النفس بالنفس ، وتفقأ العين بالعين ، ويقطع الأنف بالأنف ، وتنزع السن بالسن ، وتقتص الجراح بالجراح .\nفهذا يستوي فيه أحرار المسلمين [ به ] فيما بينهم ، رجالهم ونساؤهم ، إذا كان عمدا في النفس وما دون النفس ، ويستوي فيه العبيد رجالهم ونساؤهم فيما بينهم إذا كان عمدا ، في النفس وما دون النفس ، رواه ابن جرير وابن أبي حاتم .\nالجراح تارة تكون في مفصل ، فيجب فيه القصاص بالإجماع ، كقطع اليد والرجل والكف والقدم ونحو ذلك . وأما إذا لم تكن الجراح في مفصل بل في عظم ، فقال مالك رحمه الله : فيه القصاص إلا في الفخذ وشبهها ; لأنه مخوف خطر . وقال أبو حنيفة وصاحباه : لا يجب القصاص في شيء من العظام إلا في السن . وقال الشافعي : لا يجب القصاص في شيء من العظام مطلقا ، وهو مروي عن عمر بن الخطاب وابن عباس . وبه يقول عطاء والشعبي والحسن البصري والزهري وإبراهيم النخعي وعمر بن عبد العزيز . وإليه ذهب سفيان الثوري والليث بن سعد . وهو المشهور من مذهب الإمام أحمد .\nوقد احتج أبو حنيفة رحمه الله ، بحديث الربيع بنت النضر على مذهبه أنه لا قصاص في عظم إلا في السن . وحديث الربيع لا حجة فيه ; لأنه ورد بلفظ : \" كسرت ثنية جارية \" وجائز أن تكون سقطت من غير كسر ، فيجب القصاص - والحالة هذه - بالإجماع . وتمموا الدلالة . بما رواه ابن ماجه من طريق أبي بكر بن عياش عن دهثم بن قران عن نمران بن جارية عن أبيه جارية بن ظفر الحنفي أن رجلا ضرب رجلا على ساعده بالسيف من غير المفصل ، فقطعها ، فاستعدى النبي صلى الله عليه وسلم ، فأمر له بالدية ، فقال : يا رسول الله ، أريد القصاص . فقال : \" خذ الدية ، بارك الله لك فيها \" . ولم يقض له بالقصاص .\nوقال الشيخ أبو عمر بن عبد البر : ليس لهذا الحديث غير هذا الإسناد ودهثم بن قران العكلي ضعيف أعرابي ، ليس حديثه مما يحتج به ونمران بن جارية ضعيف أعرابي أيضا ، وأبوه جارية بن ظفر مذكور في الصحابة .\nثم قالوا : لا يجوز أن يقتص من الجراحة حتى تندمل جراحه المجني عليه ، فإن اقتص منه قبل الاندمال ثم زاد جرحه ، فلا شيء له ، والدليل على ذلك ما رواه الإمام أحمد : حدثنا يعقوب حدثنا أبي ، عن محمد بن إسحاق فذكر حديثا ، قال ابن إسحاق : وذكر عمرو بن شعيب عن أبيه ، عن جده ; أن رجلا طعن رجلا بقرن في ركبته ، فجاء إلى النبي صلى الله عليه وسلم فقال : أقدني . فقال صلى الله عليه وسلم : \" لا تعجل حتى يبرأ جرحك \" . قال : فأبى الرجل إلا أن يستقيد ، فأقاده رسول الله صلى الله عليه وسلم منه ، قال : فعرج المستقيد وبرأ المستقاد منه ، فأتى المستقيد إلى رسول الله صلى الله عليه وسلم فقال له : يا رسول الله ، عرجت وبرأ صاحبي . فقال : \" قد نهيتك فعصيتني ، فأبعدك الله وبطل عرجك \" . ثم نهى رسول الله صلى الله عليه وسلم أن يقتص من جرح حتى يبرأ صاحبه . تفرد به أحمد .\nفلو اقتص المجني عليه من الجاني ، فمات من القصاص ، فلا شيء عليه عند مالك والشافعي وأحمد بن حنبل وهو قول الجمهور من الصحابة والتابعين وغيرهم . وقال أبو حنيفة : تجب الدية في مال المقتص . وقال عامر الشعبي وعطاء وطاوس وعمرو بن دينار والحارث العكلي وابن أبي ليلى وحماد بن أبي سليمان والزهري والثوري : تجب الدية على عاقلة المقتص له . وقال ابن مسعود وإبراهيم النخعي والحكم بن عتيبة وعثمان البتي : يسقط عن المقتص له قدر تلك الجراحة ، ويجب الباقي في ماله .\nوقوله : ( فمن تصدق به فهو كفارة له ) قال علي بن أبي طلحة عن ابن عباس : ( فمن تصدق به فهو كفارة له ) يقول : فمن عفا عنه ، وتصدق عليه فهو كفارة للمطلوب ، وأجر للطالب .\nوقال سفيان الثوري عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس : ( فمن تصدق به فهو كفارة له ) قال : كفارة للجارح ، وأجر المجروح على الله عز وجل . رواه ابن أبي حاتم ثم قال : وروي عن خيثمة بن عبد الرحمن ومجاهد وإبراهيم - في أحد قوليه - وعامر الشعبي وجابر بن زيد - نحو ذلك الوجه الثاني ، ثم قال ابن أبي حاتم :\nحدثنا حماد بن زاذان حدثنا حرمي - يعني ابن عمارة - حدثنا شعبة عن عمارة - يعني ابن أبي حفصة - عن رجل ، عن جابر بن عبد الله في قول الله عز وجل ( فمن تصدق به فهو كفارة له ) قال : للمجروح . وروى عن الحسن البصري وإبراهيم النخعي - في أحد قوليه - وأبي إسحاق الهمداني نحو ذلك .\nوروى ابن جرير عن عامر الشعبي وقتادة مثله .\nوقال ابن أبي حاتم : حدثنا يونس بن حبيب حدثنا أبو داود الطيالسي حدثنا شعبة عن قيس - يعني بن مسلم - قال : سمعت طارق بن شهاب يحدث ، عن الهيثم أبي العريان النخعي قال : رأيت عبد الله بن عمرو عند معاوية أحمر شبيها بالموالي ، فسألته عن قول الله [ عز وجل ] ( فمن تصدق به فهو كفارة له ) قال : يهدم عنه من ذنوبه بقدر ما تصدق به .\nوهكذا رواه سفيان الثوري عن قيس بن مسلم . وكذا رواه ابن جرير من طريق سفيان وشعبة .\nوقال ابن مردويه : حدثني محمد بن علي ، حدثنا عبد الرحيم بن محمد المجاشعي حدثنا محمد بن أحمد بن الحجاج المهري حدثنا يحيى بن سليمان الجعفي حدثنا معلى - يعني ابن هلال - أنه سمع أبان بن تغلب عن أبي العريان الهيثم بن الأسود عن عبد الله بن عمرو - وعن أبان بن تغلب عن الشعبي عن رجل من الأنصار عن النبي صلى الله عليه وسلم في قوله : ( فمن تصدق به فهو كفارة له ) قال : هو الذي تكسر سنه ، أو تقطع يده ، أو يقطع الشيء منه ، أو يجرح في بدنه فيعفو عن ذلك ، وقال فيحط عنه قدر خطاياه ، فإن كان ربع الدية فربع خطاياه ، وإن كان الثلث فثلث خطاياه ، وإن كانت الدية حطت عنه خطاياه كذلك .\nثم قال ابن جرير : حدثنا زكريا بن يحيى بن أبي زائدة حدثنا ابن فضيل عن يونس بن أبي إسحاق عن أبي السفر قال : دفع رجل من قريش رجلا من الأنصار فاندقت ثنيته ، فرفعه الأنصاري إلى معاوية فلما ألح عليه الرجل قال : شأنك وصاحبك . قال : وأبو الدرداء عند معاوية فقال أبو الدرداء : سمعت رسول الله صلى الله عليه وسلم يقول : \" ما من مسلم يصاب بشيء من جسده ، فيهبه ، إلا رفعه الله به درجة ، وحط عنه به خطيئة \" . فقال الأنصاري : أنت سمعته من رسول الله صلى الله عليه وسلم؟ فقال : سمعته أذناي ووعاه قلبي ، فخلى سبيل القرشي ، فقال معاوية : مروا له بمال .\nهكذا رواه ابن جرير ورواه الإمام أحمد فقال : حدثنا وكيع حدثنا يونس بن أبي إسحاق عن أبي السفر قال : كسر رجل من قريش سن رجل من الأنصار فاستعدى عليه معاوية فقال القرشي : إن هذا دق سني ؟ قال معاوية : إنا سنرضيه . فألح الأنصاري ، فقال معاوية : شأنك بصاحبك وأبو الدرداء جالس ، فقال أبو الدرداء سمعت رسول الله صلى الله عليه وسلم يقول : \" ما من مسلم يصاب بشيء في جسده ، فيتصدق به ، إلا رفعه الله به درجة أو حط عنه بها خطيئة \" . فقال الأنصاري : فإني ، يعني : قد عفوت .\nوهكذا رواه الترمذي من حديث ابن المبارك وابن ماجه من حديث وكيع كلاهما عن يونس بن أبي إسحاق به ، ثم قال الترمذي : غريب لا نعرفه إلا من هذا الوجه ، ولا أعرف لأبي السفر سماعا من أبي الدرداء .\nوقال [ أبو بكر ] بن مردويه : حدثنا دعلج بن أحمد حدثنا محمد بن علي بن زيد حدثنا سعيد بن منصور حدثنا سفيان عن عمران بن ظبيان عن عدي بن ثابت ; أن رجلا هتم فمه رجل ، على عهد معاوية رضي الله عنه ، فأعطي دية ، فأبى إلا أن يقتص ، فأعطي ديتين ، فأبى ، فأعطي ثلاثا ، فأبى ، فحدث رجل من أصحاب رسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال : \" من تصدق بدم فما دونه ، فهو كفارة له من يوم ولد إلى يوم يموت \" .\nوقال الإمام أحمد : حدثنا سريج بن النعمان حدثنا هشيم عن المغيرة عن الشعبي أن عبادة بن الصامت قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" ما من رجل يجرح من جسده جراحة ، فيتصدق بها ، إلا كفر الله عنه مثل ما تصدق به .\nورواه النسائي عن علي بن حجر عن جرير بن عبد الحميد ورواه ابن جرير عن محمود بن خداش عن هشيم كلاهما عن المغيرة به .\nوقال الإمام أحمد : حدثنا يحيى بن سعيد القطان عن مجالد عن عامر عن المحرر بن أبي هريرة عن رجل من أصحاب النبي صلى الله عليه وسلم قال : \" من أصيب بشيء من جسده ، فتركه لله ، كان كفارة له \" .\nوقوله : ( ومن لم يحكم بما أنزل الله فأولئك هم الظالمون ) قد تقدم عن طاوس وعطاء أنهما قالا كفر دون كفر ، وظلم دون ظلم ، وفسق دون فسق .\n                                    ",
        "qortoby": "وَكَتَبۡنَا عَلَيۡهِمۡ فِيهَآ أَنَّ ٱلنَّفۡسَ بِٱلنَّفۡسِ وَٱلۡعَيۡنَ بِٱلۡعَيۡنِ وَٱلۡأَنفَ بِٱلۡأَنفِ وَٱلۡأُذُنَ بِٱلۡأُذُنِ وَٱلسِّنَّ بِٱلسِّنِّ وَٱلۡجُرُوحَ قِصَاصٞۚ فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٞ لَّهُۥۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٥٤\n                                    \n                                    \n                                    قوله تعالى : وكتبنا عليهم فيها أن النفس بالنفس والعين بالعين والأنف بالأنف والأذن بالأذن والسن بالسن والجروح قصاص فمن تصدق به فهو كفارة له ومن لم يحكم بما أنزل الله فأولئك هم الظالمون\nفيه ثلاثون مسألة :\nالأولى : قوله تعالى : وكتبنا عليهم فيها أن النفس بالنفس بين تعالى أنه سوى بين النفس والنفس في التوراة فخالفوا ذلك ، فضلوا ; فكانت دية النضيري أكثر ، وكان النضيري لا يقتل بالقرظي ، ويقتل به القرظي فلما جاء الإسلام راجع بنو قريظة رسول الله صلى الله عليه وسلم فيه ، فحكم بالاستواء ; فقالت بنو النضير : قد حططت منا ; فنزلت هذه الآية . وكتبنا بمعنى فرضنا ، وقد تقدم ، وكان شرعهم القصاص أو العفو ، وما كان فيهم الدية ; كما تقدم في \" البقرة \" بيانه .\nوتعلق أبو حنيفة وغيره بهذه الآية فقال : يقتل المسلم بالذمي ; لأنه نفس بنفس ، وقد تقدم في \" البقرة \" بيان هذا ، وقد روى أبو داود والترمذي والنسائي عن علي رضي الله عنه أنه سئل هل خصك رسول الله صلى الله عليه وسلم بشيء ؟ فقال : لا ، إلا ما في هذا ، وأخرج كتابا من قراب سيفه وإذا فيه ( المؤمنون تتكافأ دماؤهم وهم يد على من سواهم ولا يقتل مسلم بكافر ولا ذو عهد في عهده ) وأيضا فإن الآية إنما جاءت للرد على اليهود في المفاضلة بين القبائل ، وأخذهم من قبيلة رجلا برجل ، ومن قبيلة أخرى رجلا برجلين ، وقالت الشافعية : هذا خبر عن شرع من قبلنا ، وشرع من قبلنا ليس شرعا لنا ; وقد مضى في \" البقرة \" في الرد عليهم ما يكفي فتأمله هناك .\nووجه رابع : وهو أنه تعالى قال : وكتبنا عليهم فيها أن النفس بالنفس وكان ذلك مكتوبا على أهل التوراة وهم ملة واحدة ، ولم يكن لهم أهل ذمة كما للمسلمين أهل ذمة ; لأن الجزية فيء وغنيمة أفاءها الله على المؤمنين ، ولم يجعل الفيء لأحد قبل هذه الأمة ، ولم يكن نبي فيما مضى مبعوثا إلا إلى قومه ; فأوجبت الآية الحكم على بني إسرائيل إذ كانت دماؤهم تتكافأ ; فهو مثل قول الواحد منا في دماء سوى المسلمين النفس بالنفس ، إذ يشير إلى قوم معينين ، ويقول : إن الحكم في هؤلاء أن النفس منهم بالنفس ; فالذي يجب بحكم هذه الآية على أهل القرآن أن يقال لهم فيما بينهم - على هذا الوجه - : النفس بالنفس ، وليس في كتاب الله ما يدل على أن النفس بالنفس مع اختلاف الملة .\nالثانية : قال أصحاب الشافعي وأبو حنيفة : إذا جرح أو قطع الأذن أو اليد ثم قتل فعل ذلك به ; لأن الله تعالى قال : وكتبنا عليهم فيها أن النفس بالنفس والعين بالعين فيؤخذ منه ما أخذ ، ويفعل به كما فعل ، وقال علماؤنا : إن قصد به المثلة فعل به مثله ، وإن كان ذلك في أثناء مضاربته ومدافعته قتل بالسيف ; وإنما قالوا ذلك في المثلة يجب ; لأن النبي صلى الله عليه وسلم سمل أعين العرنيين ; حسبما تقدم بيانه في هذه السورة .\nالثالثة : قوله تعالى : والعين بالعين قرأ نافع وعاصم والأعمش وحمزة بالنصب في جميعها على العطف ، ويجوز تخفيف \" أن \" ورفع الكل بالابتداء والعطف ، وقرأ ابن كثير وابن عامر وأبو عمرو وأبو جعفر بنصب الكل إلا الجروح ، وكان الكسائي وأبو عبيد يقرآن \" والعين بالعين والأنف بالأنف والأذن بالأذن والسن بالسن والجروح \" بالرفع فيها كلها . قال أبو عبيد : حدثنا حجاج عن هارون عن عباد بن كثير عن عقيل عن الزهري عن أنس أن النبي صلى الله عليه وسلم قرأ \" وكتبنا عليهم فيها أن النفس بالنفس والعين بالعين والأنف بالأنف والأذن بالأذن والسن بالسن والجروح قصاص \" ، والرفع من ثلاث جهات ; بالابتداء والخبر ، وعلى المعنى على موضع ( أن النفس ) ; لأن المعنى قلنا لهم : النفس بالنفس .\nوالوجه الثالث : قاله الزجاج يكون عطفا على المضمر في النفس ; لأن الضمير في النفس في موضع رفع ; لأن التقدير أن النفس هي مأخوذة بالنفس ; فالأسماء معطوفة على هي .\nقال ابن المنذر : ومن قرأ بالرفع جعل ذلك ابتداء كلام ، حكم في المسلمين ; وهذا أصح القولين ، وذلك أنها قراءة رسول الله صلى الله عليه وسلم \" والعين بالعين \" وكذا ما بعده ، والخطاب للمسلمين أمروا بهذا . ومن خص الجروح بالرفع فعلى القطع مما قبلها والاستئناف بها ; كأن المسلمين أمروا بهذا خاصة ، وما قبله لم يواجهوا به .\nالرابعة : هذه الآية تدل على جريان القصاص فيما ذكر وقد تعلق ابن شبرمة بعموم قوله : والعين بالعين على أن اليمنى تفقأ باليسرى وكذلك على العكس ، وأجرى ذلك في اليد اليمنى واليسرى ، وقال : تؤخذ الثنية بالضرس والضرس بالثنية ; لعموم قوله تعالى : والسن بالسن . والذين خالفوه وهم علماء الأمة قالوا : العين اليمنى هي المأخوذة باليمنى عند وجودها ، ولا يتجاوز ذلك إلى اليسرى مع الرضا ; وذلك يبين لنا أن المراد بقوله : والعين بالعين استيفاء ما يماثله من الجاني ; فلا يجوز له أن يتعدى إلى غيره كما لا يتعدى من الرجل إلى اليد في الأحوال كلها ، وهذا لا ريب فيه .\nالخامسة : وأجمع العلماء على أن العينين إذا أصيبتا خطأ ففيهما الدية ، وفي العين الواحدة نصف الدية ، وفي عين الأعور إذا فقئت الدية كاملة ; روي ذلك عن عمر وعثمان ، وبه قال عبد الملك بن مروان والزهري وقتادة ومالك والليث بن سعد وأحمد وإسحاق ، وقيل : نصف الدية ; روي ذلك عن عبد الله بن المغفل ومسروق والنخعي ; وبه قال الثوري والشافعي والنعمان . قال ابن المنذر : وبه نقول ; لأن في الحديث في العينين الدية ومعقول إذ كان كذلك أن في إحداهما نصف الدية . قال ابن العربي : وهو القياس الظاهر ، ولكن علماؤنا قالوا : إن منفعة الأعور ببصره كمنفعة السالم أو قريب من ذلك ، فوجب عليه مثل ديته .\nالسادسة : واختلفوا في الأعور يفقأ عين صحيح ; فروي عن عمر وعثمان وعلي أنه لا قود عليه ، وعليه الدية كاملة ; وبه قال عطاء وسعيد بن المسيب وأحمد بن حنبل ، وقال مالك : إن شاء اقتص فتركه أعمى ، وإن شاء أخذ الدية كاملة ( دية عين الأعور ) ، وقال النخعي : إن شاء اقتص وإن شاء أخذ نصف الدية . وقال الشافعي وأبو حنيفة والثوري : عليه القصاص ، وروي ذلك عن علي أيضا ، وهو قول مسروق وابن سيرين وابن معقل ، واختاره ابن المنذر وابن العربي ; لأن الله تعالى قال : والعين بالعين وجعل النبي صلى الله عليه وسلم في العينين الدية ; ففي العين نصف الدية ، والقصاص بين صحيح العين والأعور كهيئته بين سائر الناس ، ومتعلق أحمد بن حنبل أن في القصاص منه أخذ جميع البصر ببعضه وذلك ليس بمساواة ، وبما روي عن عمر وعثمان وعلي في ذلك ، ومتمسك مالك أن الأدلة لما تعارضت خير المجني عليه . قال ابن العربي : والأخذ بعموم القرآن أولى ; فإنه أسلم عند الله تعالى .\nالسابعة : واختلفوا في عين الأعور التي لا يبصر بها ; فروي عن زيد بن ثابت أنه قال : فيها مائة دينار ، وعن عمر بن الخطاب أنه قال : فيها ثلث ديتها ; وبه قال إسحاق ، وقال مجاهد : فيها نصف ديتها ، وقال مسروق والزهري ومالك والشافعي وأبو ثور والنعمان : فيها حكومة ; قال ابن المنذر : وبه نقول لأنه الأقل مما قيل .\nالثامنة : وفي إبطال البصر من العينين مع بقاء الحدقتين كمال الدية ، ويستوي فيه الأعمش والأخفش ، وفي إبطاله من إحداهما مع بقائها النصف . قال ابن المنذر وأحسن ما قيل في ذلك ما قاله علي بن أبي طالب : أنه أمر بعينه الصحيحة فغطيت وأعطي رجل بيضة فانطلق بها وهو ينظر حتى انتهى نظره ، ثم أمر بخط عند ذلك ، ثم أمر بعينه الأخرى فغطيت وفتحت الصحيحة ، وأعطي رجل بيضة فانطلق بها وهو ينظر حتى انتهى نظره ثم خط عند ذلك ، ثم أمر به فحول إلى مكان آخر ففعل به مثل ذلك فوجده سواء ; فأعطى ما نقص من بصره من مال الآخر ، وهذا على مذهب الشافعي ; وهو قول علمائنا ، وهي :\nالتاسعة : ولا خلاف بين أهل العلم على أن لا قود في بعض البصر ، إذ غير ممكن الوصول إليه ، وكيفية القود في العين أن تحمى مرآة ثم توضع على العين الأخرى قطنة ، ثم تقرب المرآة من عينه حتى يسيل إنسانها ; روي عن علي رضي الله عنه ; ذكره المهدوي وابن العربي . واختلف في جفن العين ; فقال زيد بن ثابت : فيه ربع الدية ، وهو قول الشعبي والحسن وقتادة وأبي هاشم والثوري والشافعي وأصحاب الرأي ، وروي عن الشعبي أنه قال : في الجفن الأعلى ثلث الدية وفي الجفن الأسفل ثلثا الدية ، وبه قال مالك .\nالعاشرة : قوله تعالى : والأنف بالأنف جاء الحديث عن رسول الله صلى الله عليه وسلم أنه قال : وفي الأنف إذا أوعب جدعا الدية . قال ابن المنذر : وأجمع كل من يحفظ عنه من أهل العلم على القول به ; والقصاص من الأنف إذا كانت الجناية عمدا كالقصاص من سائر الأعضاء على كتاب الله تعالى ، واختلفوا في كسر الأنف . فكان مالك يرى في العمد منه القود ، وفي الخطأ الاجتهاد ، وروى ابن نافع أنه لا دية للأنف حتى يستأصله من أصله . قال أبو إسحاق التونسي : وهذا شاذ ، والمعروف الأول ، وإذا فرعنا على المعروف ففي بعض المارن من الدية بحسابه من المارن . قال ابن المنذر : وما قطع من الأنف فبحسابه ; روي ذلك عن عمر بن عبد العزيز والشعبي ، وبه قال الشافعي . قال أبو عمر : واختلفوا في المارن إذا قطع ولم يستأصل الأنف ; فذهب مالك والشافعي وأبو حنيفة وأصحابهم إلى أن في ذلك الدية كاملة ، ثم إن قطع منه شيء بعد ذلك ففيه حكومة . قال مالك : الذي فيه الدية من الأنف أن يقطع المارن ; وهو دون العظم . قال ابن القاسم : وسواء قطع المارن من العظم أو استؤصل الأنف من العظم من تحت العينين إنما فيه الدية ; كالحشفة فيها الدية : وفي استئصال الذكر الدية .\nالحادية عشرة : قال ابن القاسم : وإذا خرم الأنف أو كسر فبرئ على عثم ففيه الاجتهاد ، وليس فيه دية معلومة . وإن برئ على غير عثم فلا شيء فيه . قال : وليس الأنف إذا خرم فبرئ على غير عثم كالموضحة تبرأ على غير عثم فيكون فيها ديتها ; لأن تلك جاءت بها السنة ، وليس في خرم الأنف أثر . قال : والأنف عظم منفرد ليس فيه موضحة ، واتفق مالك والشافعي وأصحابهما على أن لا جائفة فيه ، ولا جائفة عندهم إلا فيما كان في الجوف ، والمارن ما لان من الأنف ; وكذلك قال الخليل وغيره . قال أبو عمر : وأظن روثته مارنه ، وأرنبته طرفه ، وقد قيل : الأرنبة والروثة والعرتمة طرف الأنف . والذي عليه الفقهاء مالك والشافعي والكوفيون ومن تبعهم ، في الشم إذا نقص أو فقد حكومة .\nالثانية عشرة : قوله تعالى : والأذن بالأذن قال علماؤنا رحمة الله عليهم في الذي يقطع أذني رجل : عليه حكومة ، وإنما تكون عليه الدية في السمع ، ويقاس في نقصانه كما يقاس في البصر ، وفي إبطاله من إحداهما نصف الدية ولو لم يكن يسمع إلا بها ، بخلاف العين العوراء فيها الدية كاملة ; على ما تقدم ، وقال أشهب : إن كان السمع إذا سئل عنه قيل إن أحد السمعين يسمع ما يسمع السمعان فهو عندي كالبصر ، وإذا شك في السمع جرب بأن يصاح به من مواضع عدة ، يقاس ذلك ; فإن تساوت أو تقاربت أعطي بقدر ما ذهب من سمعه ويحلف على ذلك . قال أشهب : ويحسب له ذلك على سمع وسط من الرجال مثله ; فإن اختبر فاختلف قوله لم يكن له شيء ، وقال عيسى بن دينار : إذا اختلف قوله عقل له الأقل مع يمينه .\nالثالثة عشرة : قوله تعالى : والسن بالسن قال ابن المنذر : وثبت عن رسول الله صلى الله عليه وسلم أنه أقاد من سن وقال : كتاب الله القصاص . وجاء الحديث عن رسول الله صلى الله عليه وسلم أنه قال : في السن خمس من الإبل . قال ابن المنذر : فبظاهر هذا الحديث نقول ; لا فضل للثنايا منها على الأنياب والأضراس والرباعيات ; لدخولها كلها في ظاهر الحديث ; وبه يقول الأكثر من أهل العلم ، وممن قال بظاهر الحديث ولم يفضل شيئا منها على شيء عروة بن الزبير وطاوس والزهري وقتادة ومالك والثوري والشافعي وأحمد وإسحاق والنعمان وابن الحسن ، وروي ذلك عن علي بن أبي طالب وابن عباس ومعاوية ، وفيه قول ثان - رويناه عن عمر بن الخطاب أنه قضى فيما أقبل من الفم بخمس فرائض خمس فرائض ، وذلك خمسون دينارا ، قيمة كل فريضة عشرة دنانير ، وفي الأضراس ببعير بعير ، وكان عطاء يقول : في السن والرباعيتين والنابين خمس خمس ، وفيما بقي بعيران بعيران ، أعلى الفم وأسفله سواء ، والأضراس سواء ; قال أبو عمر : أما ما رواه مالك في موطئه عن يحيى بن سعيد عن سعيد بن المسيب أن عمر قضى في الأضراس ببعير بعير فإن المعنى في ذلك أن الأضراس عشرون ضرسا ، والأسنان اثنا عشر سنا : أربع ثنايا وأربع رباعيات وأربع أنياب ; فعلى قول عمر تصير الدية ثمانين بعيرا ; في الأسنان خمسة خمسة ، وفي الأضراس بعير بعير ، وعلى قول معاوية في الأضراس والأسنان خمسة أبعرة خمسة أبعرة ; تصير الدية ستين ومائة بعير . وعلى قول سعيد بن المسيب ، بعيرين بعيرين في الأضراس وهي عشرون ضرسا . يجب لها أربعون ، وفي الأسنان خمسة أبعرة فذلك ستون ، وهي تتمة المائة بعير ، وهي الدية كاملة من الإبل ، والاختلاف بينهم إنما هو في الأضراس لا في الأسنان . قال أبو عمر : واختلاف العلماء من الصحابة والتابعين في ديات الأسنان وتفضيل بعضها على بعض كثير جدا ، والحجة قائمة لما ذهب إليه الفقهاء مالك وأبو حنيفة والثوري ; بظاهر قول رسول الله صلى الله عليه وسلم : وفي السن خمس من الإبل والضرس سن من الأسنان . روى ابن عباس أن رسول الله صلى الله عليه وسلم قال : الأصابع سواء والأسنان سواء الثنية والضرس سواء هذه وهذه سواء وهذا نص أخرجه أبو داود ، وروى أبو داود أيضا عن ابن عباس قال : جعل رسول الله صلى الله عليه وسلم أصابع اليدين والرجلين سواء . قال أبو عمر : على هذه الآثار جماعة فقهاء الأمصار وجمهور أهل العلم أن الأصابع في الدية كلها سواء ، وأن الأسنان في الدية كلها سواء ، الثنايا والأضراس والأنياب لا يفضل شيء منها على شيء ; على ما في كتاب عمرو بن حزم . ذكر الثوري عن أزهر بن محارب قال : اختصم إلى شريح رجلان ضرب أحدهما ثنية الآخر وأصاب الآخر ضرسه فقال شريح : الثنية وجمالها والضرس ومنفعته سن بسن قوما . قال أبو عمر : على هذا العمل اليوم في جميع الأمصار ، والله أعلم .\nالرابعة عشرة : فإن ضرب سنه فاسودت ففيها ديتها كاملة عند مالك والليث بن سعد ، وبه قال أبو حنيفة ، وروي عن زيد بن ثابت ; وهو قول سعيد بن المسيب والزهري والحسن وابن سيرين وشريح . وروي عن عمر بن الخطاب رضي الله تعالى عنه أن فيها ثلث ديتها ; وبه قال أحمد وإسحاق ، وقال الشافعي وأبو ثور : فيها حكومة . قال ابن العربي : وهذا عندي خلاف يئول إلى وفاق ; فإنه إن كان سوادها أذهب منفعتها وإنما بقيت صورتها كاليد الشلاء والعين العمياء ، فلا خلاف في وجوب الدية ; ثم إن كان بقي من منفعتها شيء أو جميعها لم يجب إلا بمقدار ما نقص من المنفعة حكومة ; وما روي عن عمر رضي الله عنه فيها ثلث ديتها لم يصح عنه سندا ولا فقها .\nالخامسة عشرة : واختلفوا في سن الصبي يقلع قبل أن يثغر ; فكان مالك والشافعي وأصحاب الرأي يقولون : إذا قلعت سن الصبي فنبتت فلا شيء على القالع ، إلا أن مالكا والشافعي قالا : إذا نبتت ناقصة الطول عن التي تقاربها أخذ له من أرشها بقدر نقصها ، وقالت طائفة : فيها حكومة ، وروي ذلك عن الشعبي ; وبه قال النعمان . قال ابن المنذر : يستأنى بها إلى الوقت الذي يقول أهل المعرفة إنها لا تنبت ، فإذا كان ذلك كان فيها قدرها تاما ; على ظاهر الحديث ، وإن نبتت رد الأرش ، وأكثر من يحفظ عنه من أهل العلم يقولون : يستأنى بها سنة ; روي ذلك عن علي وزيد وعمر بن عبد العزيز وشريح والنخعي وقتادة ومالك وأصحاب الرأي ، ولم يجعل الشافعي لهذا مدة معلومة .\nالسادسة عشرة : إذا قلع سن الكبير فأخذ ديتها ثم نبتت ; فقال مالك لا يرد ما أخذ ، وقال الكوفيون : يرد إذا نبتت ، وللشافعي قولان : يرد ولا يرد ; لأن هذا نبات لم تجر به عادة ، ولا يثبت الحكم بالنادر ; هذا قول علمائنا . تمسك الكوفيون بأن عوضها قد نبت فيرد ; أصله سن الصغير . قال الشافعي : ولو جنى عليها جان آخر وقد نبتت صحيحة كان فيها أرشها تاما . قال ابن المنذر : هذا أصح القولين ; لأن كل واحد منهما قالع سن ، وقد جعل النبي صلى الله عليه وسلم في السن خمسا من الإبل .\nالسابعة عشرة : فلو قلع رجل سن رجل فردها صاحبها فالتحمت فلا شيء فيها عندنا ، وقال الشافعي : ليس له أن يردها من قبل أنها نجسة ; وقاله ابن المسيب وعطاء ، ولو ردها أعاد كل صلاة صلاها لأنها ميتة ; وكذلك لو قطعت أذنه فردها بحرارة الدم فالتزقت مثله ، وقال عطاء : يجبره السلطان على قلعها لأنها ميتة ألصقها . قال ابن العربي : وهذا غلط ، وقد جهل من خفي عليه أن ردها وعودها بصورتها لا يوجب عودها بحكمها ; لأن النجاسة كانت فيها للانفصال ، وقد عادت متصلة ، وأحكام الشريعة ليست صفات للأعيان ، وإنما هي أحكام تعود إلى قول الله سبحانه فيها وإخباره عنها .\nقلت : ما حكاه ابن العربي عن عطاء خلاف ما حكاه ابن المنذر عنه ; قال ابن المنذر : واختلفوا في السن تقلع قودا ثم ترد مكانها فتنبت ; فقال عطاء الخراساني وعطاء بن أبي رباح : لا بأس بذلك . وقال الثوري وأحمد وإسحاق : تقلع ; لأن القصاص للشين ، وقال الشافعي : ليس له أن يردها من قبل أنها نجسة ، ويجبره السلطان على القلع .\nالثامنة عشرة : فلو كانت له سن زائدة فقلعت ففيها حكومة ; وبه قال فقهاء الأمصار ، وقال زيد بن ثابت : فيها ثلث الدية . قال ابن العربي : وليس في التقدير دليل ، فالحكومة أعدل . قال ابن المنذر : ولا يصح ما روي عن زيد ; وقد روي عن علي أنه قال : في السن إذا كسر بعضها أعطي صاحبها بحساب ما نقص منه ; وهذا قول مالك والشافعي وغيرهما .\nقلت : وهنا انتهى ما نص الله عز وجل عليه من الأعضاء ، ولم يذكر الشفتين واللسان وهي :\nالتاسعة عشرة : فقال الجمهور : وفي الشفتين الدية ، وفي كل واحدة منهما نصف الدية لا فضل للعليا منهما على السفلى ، وروي عن زيد بن ثابت وسعيد بن المسيب والزهري : في الشفة العليا ثلث الدية ، وفي الشفة السفلى ثلثا الدية . وقال ابن المنذر : وبالقول الأول أقول ; للحديث المرفوع عن رسول الله صلى الله عليه وسلم أنه قال : وفي الشفتين الدية ولأن في اليدين الدية ومنافعهما مختلفة ، وما قطع من الشفتين فبحساب ذلك ، وأما اللسان فجاء الحديثعن النبي صلى الله عليه وسلم أنه قال : في اللسان الدية . وأجمع أهل العلم من أهل المدينة وأهل الكوفة وأصحاب الحديث وأهل الرأي على القول به ; قاله ابن المنذر .\nالموفية عشرين : واختلفوا في الرجل يجني على لسان الرجل فيقطع من اللسان شيئا ، ويذهب من الكلام بعضه ; فقال أكثر أهل العلم : ينظر إلى مقدار ما ذهب من الكلام من ثمانية وعشرين حرفا فيكون عليه من الدية بقدر ما ذهب من كلامه ، وإن ذهب الكلام كله ففيه الدية ; هذا قول مالك والشافعي وأحمد وإسحاق وأصحاب الرأي ، وقال مالك : ليس في اللسان قود لعدم الإحاطة باستيفاء القود . فإن أمكن فالقود هو الأصل .\nالحادية والثلاثون : واختلفوا في لسان الأخرس يقطع ; فقال الشعبي ومالك وأهل المدينة والثوري وأهل العراق والشافعي وأبو ثور والنعمان وصاحباه : فيه حكومة . قال ابن المنذر : وفيه قولان شاذان : أحدهما : قول النخعي إن فيه الدية ، والآخر : قول قتادة إن فيه ثلث الدية . قال ابن المنذر : والقول الأول أصح ; لأنه الأقل مما قيل . قال ابن العربي : نص الله سبحانه على أمهات الأعضاء وترك باقيها للقياس عليها ; فكل عضو فيه القصاص إذا أمكن ولم يخش عليه الموت ، وكذلك كل عضو بطلت منفعته وبقيت صورته فلا قود فيه ، وفيه الدية لعدم إمكان القود فيه .\nالثانية والعشرون : قوله تعالى : والجروح قصاص أي : مقاصة ، وقد تقدم في \" البقرة \" ، ولا قصاص في كل مخوف ولا فيما لا يوصل إلى القصاص فيه إلا بأن يخطئ الضارب أو يزيد أو ينقص ، ويقاد من جراح العمد إذا كان مما يمكن القود منه ، وهذا كله في العمد ; فأما الخطأ فالدية ، وإذا كانت الدية في قتل الخطأ فكذلك في الجراح ، وفي صحيح مسلم عن أنس أن أخت الربيع - أم حارثة - جرحت إنسانا فاختصموا إلى النبي صلى الله عليه وسلم ، فقال رسول الله صلى الله عليه وسلم : القصاص القصاص ، فقالت أم الربيع : يا رسول الله أيقتص من فلانة ؟ ! والله لا يقتص منها . فقال النبي صلى الله عليه وسلم : سبحان الله يا أم الربيع القصاص كتاب الله قالت : لا والله لا يقتص منها أبدا ; قال فما زالت حتى قبلوا الدية ; فقال رسول الله صلى الله عليه وسلم : إن من عباد الله من لو أقسم على الله لأبره .\nقلت : المجروح في هذا الحديث جارية ، والجرح كسر ثنيتها ; أخرجه النسائي عن أنس أيضا أن عمته كسرت ثنية جارية فقضى نبي الله صلى الله عليه وسلم بالقصاص ; فقال أخوها أنس بن النضر : أتكسر ثنية فلانة ؟ لا والذي بعثك بالحق لا تكسر ثنيتها . قال : وكانوا قبل ذلك سألوا أهلها العفو والأرش ، فلما حلف أخوها وهو عم أنس - وهو الشهيد يوم أحد - رضي القوم بالعفو ; فقال النبي صلى الله عليه وسلم : إن من عباد الله من لو أقسم على الله لأبره . وخرجه أبو داود أيضا ، وقال : سمعت أحمد بن حنبل قيل له : كيف يقتص من السن ؟ قال : تبرد .\nقلت : ولا تعارض بين الحديثين ; فإنه يحتمل أن يكون كل واحد منهما حلف فبر الله قسمهما ، وفي هذا ما يدل على كرامات الأولياء على ما يأتي بيانه في قصة الخضر إن شاء الله تعالى . فنسأل الله التثبت على الإيمان بكراماتهم وأن ينظمنا في سلكهم من غير محنة ولا فتنة .\nالثالثة والعشرون : أجمع العلماء على أن قوله تعالى : والسن بالسن أنه في العمد ; فمن أصاب سن أحد عمدا ففيه القصاص على حديث أنس ، واختلفوا في سائر عظام الجسد إذا كسرت عمدا ; فقال مالك : عظام الجسد كلها فيها القود إلا ما كان مخوفا مثل الفخذ والصلب والمأمومة والمنقلة والهاشمة ، ففي ذلك الدية ، وقال الكوفيون : لا قصاص في عظم يكسر ما خلا السن ; لقوله تعالى : والسن بالسن وهو قول الليث والشافعي . قال الشافعي : لا يكون كسر ككسر أبدا ; فهو ممنوع . قال الطحاوي : اتفقوا على أنه لا قصاص في عظم الرأس ; فكذلك في سائر العظام ، والحجة لمالك حديث أنس في السن وهي عظم ; فكذلك سائر العظام إلا عظما أجمعوا على أنه لا قصاص فيه ; لخوف ذهاب النفس منه . قال ابن المنذر : ومن قال لا قصاص في عظم فهو مخالف للحديث ; والخروج إلى النظير غير جائز مع وجود الخبر .\nقلت : ويدل على هذا أيضا قوله تعالى : فمن اعتدى عليكم فاعتدوا عليه بمثل ما اعتدى عليكم ، وقوله : وإن عاقبتم فعاقبوا بمثل ما عوقبتم به وما أجمعوا عليه فغير داخل في الآية ، والله أعلم وبالله التوفيق .\nالرابعة والعشرون : قال أبو عبيد في حديث النبي صلى الله عليه وسلم في الموضحة ، وما جاء عن غيره في الشجاج . قال الأصمعي وغيره : دخل كلام بعضهم في بعض ; أول الشجاج - الحارصة وهي : التي تحرص الجلد - يعني التي تشقه قليلا - ومنه قيل : حرص القصار الثوب إذا شقه ; وقد يقال لها : الحرصة أيضا . ثم الباضعة - وهي : التي تشق اللحم تبضعه بعد الجلد . ثم المتلاحمة - وهي : التي أخذت في الجلد ولم تبلغ السمحاق ، والسمحاق : جلدة أو قشرة رقيقة بين اللحم والعظم ، وقال الواقدي : هي عندنا الملطى ، وقال غيره : هي الملطاة ، قال : وهي التي جاء فيها الحديث يقضى في الملطاة بدمها . ثم الموضحة - وهي : التي تكشط عنها ذلك القشر أو تشق حتى يبدو وضح العظم ، فتلك الموضحة . قال أبو عبيد : وليس في شيء من الشجاج قصاص إلا في الموضحة خاصة ; لأنه ليس منها شيء له حد ينتهى إليه سواها ، وأما غيرها من الشجاج ففيها ديتها . ثم الهاشمة - وهي التي تهشم العظم . ثم المنقلة - بكسر القاف حكاه الجوهري - وهي التي تنقل العظم - أي : تكسره - حتى يخرج منها فراش العظام مع الدواء . ثم الآمة - ويقال لها المأمومة - وهي التي تبلغ أم الرأس ، يعني الدماغ . قال أبو عبيد ويقال في قوله : ويقضى في الملطاة بدمها أنه إذا شج الشاج حكم عليه للمشجوج بمبلغ الشجة ساعة شج ولا يستأنى بها . قال : وسائر الشجاج عندنا يستأنى بها حتى ينظر إلى ما يصير أمرها ثم يحكم فيها حينئذ . قال أبو عبيد : والأمر عندنا في الشجاج كلها والجراحات كلها أنه يستأنى بها ; حدثنا هشيم عن حصين قال : قال عمر بن عبد العزيز : ما دون الموضحة خدوش وفيها صلح ، وقال الحسن البصري : ليس فيما دون الموضحة قصاص ، وقال مالك : القصاص فيما دون الموضحة الملطى والدامية والباضعة وما أشبه ذلك ; وكذلك قال الكوفيون وزادوا السمحاق ، حكاه ابن المنذر ، وقال أبو عبيد : الدامية التي تدمى من غير أن يسيل منها دم ، والدامعة : أن يسيل منها دم ، وليس فيما دون الموضحة قصاص ، وقال الجوهري : والدامية الشجة التي تدمى ولا تسيل . وقال علماؤنا : الدامية هي التي تسيل الدم ، ولا قصاص فيما بعد الموضحة ، من الهاشمة للعظم ، والمنقلة - على خلاف فيها خاصة - والآمة هي البالغة إلى أم الرأس ، والدامغة الخارقة لخريطة الدماغ ، وفي هاشمة الجسد القصاص ، إلا ما هو مخوف كالفخذ وشبهه ، وأما هاشمة الرأس فقال ابن القاسم : لا قود فيها ; لأنها لا بد تعود منقلة ، وقال أشهب : فيها القصاص ، إلا أن تنقل فتصير منقلة لا قود فيها ، وأما الأطراف فيجب القصاص في جميع المفاصل إلا المخوف منها ، وفي معنى المفاصل أبعاض المارن والأذنين والذكر والأجفان والشفتين ; لأنها تقبل التقدير ، وفي اللسان روايتان ، والقصاص في كسر العظام ، إلا ما كان متلفا كعظام الصدر والعنق والصلب والفخذ وشبهه ، وفي كسر عظام العضد القصاص ، وقضى أبو بكر بن محمد بن عمرو بن حزم في رجل كسر فخذ رجل أن يكسر فخذه ; وفعل ذلك عبد العزيز بن عبد الله بن خالد بن أسيد بمكة ، وروي عن عمر بن عبد العزيز أنه فعله ; وهذا مذهب مالك على ما ذكرنا ، وقال : إنه الأمر المجمع عليه عندهم ، والمعمول به في بلادنا في الرجل يضرب الرجل فيتقيه بيده فيكسرها يقاد منه .\nالخامسة والعشرون : قال العلماء : الشجاج في الرأس ، والجراح في البدن . وأجمع أهل العلم على أن فيما دون الموضحة أرش فيما ذكر ابن المنذر ; واختلفوا في ذلك الأرش وما دون الموضحة شجاج خمس : الدامية والدامعة والباضعة والمتلاحمة والسمحاق ; فقال مالك والشافعي وأحمد وإسحاق وأصحاب الرأي في الدامية حكومة ، وفي الباضعة حكومة ، وفي المتلاحمة حكومة ، وذكر عبد الرزاق عن زيد بن ثابت قال : في الدامية بعير ، وفي الباضعة بعيران ، وفي المتلاحمة ثلاثة أبعرة من الإبل ، وفي السمحاق أربع ، وفي الموضحة خمس ، وفي الهاشمة عشر ، وفي المنقلة خمس عشرة ، وفي المأمومة ثلث الدية ، وفي الرجل يضرب حتى يذهب عقله الدية كاملة ، أو يضرب حتى يغن ولا يفهم الدية كاملة ، أو حتى يبح ولا يفهم الدية كاملة ، وفي جفن العين ربع الدية ، وفي حلمة الثدي ربع الدية . قال ابن المنذر : وروي عن علي في السمحاق مثل قول زيد ، وروي عن عمر وعثمان أنهما قالا : فيها نصف الموضحة ، وقال الحسن البصري وعمر بن عبد العزيز والنخعي فيها حكومة ; وكذلك قال مالك والشافعي وأحمد ، ولا يختلف العلماء أن الموضحة فيها خمس من الإبل ; على ما في حديث عمرو بن حزم ، وفيه : وفي الموضحة خمس ، وأجمع أهل العلم على أن الموضحة تكون في الرأس والوجه ، واختلفوا في تفضيل موضحة الوجه على موضحة الرأس ; فروي عن أبي بكر وعمر أنهما سواء ، وقال بقولهما جماعة من التابعين ; وبه يقول الشافعي وإسحاق ، وروي عن سعيد بن المسيب تضعيف موضحة الوجه على موضحة الرأس ، وقال أحمد : موضحة الوجه أحرى أن يزاد فيها ، وقال مالك : المأمومة والمنقلة والموضحة لا تكون إلا في الرأس والوجه ، ولا تكون المأمومة إلا في الرأس خاصة إذا وصل إلى الدماغ ، قال : والموضحة ما تكون في جمجمة الرأس ، وما دونها فهو من العنق ليس فيه موضحة . قال مالك : والأنف ليس من الرأس وليس فيه موضحة ، وكذلك اللحي الأسفل ليس فيه موضحة ، وقد اختلفوا في الموضحة في غير الرأس والوجه ; فقال أشهب وابن القاسم : ليس في موضحة الجسد ومنقلته ومأمومته إلا الاجتهاد ، وليس فيها أرش معلوم . قال ابن المنذر : هذا قول مالك والثوري والشافعي وأحمد وإسحاق ، وبه نقول . وروي عن عطاء الخراساني أن الموضحة إذا كانت في جسد الإنسان فيها خمس وعشرون دينارا . قال أبو عمر : واتفق مالك والشافعي وأصحابهما أن من شج رجلا مأمومتين أو موضحتين أو ثلاث مأمومات أو موضحات أو أكثر في ضربة واحدة أن فيهن كلهن - وإن انخرقت فصارت واحدة - دية كاملة ، وأما الهاشمة فلا دية فيها عندنا بل حكومة . قال ابن المنذر : ولم أجد في كتب المدنيين ذكر الهاشمة ، بل قد قال مالك فيمن كسر أنف رجل إن كان خطأ ففيه الاجتهاد ، وكان الحسن البصري لا يوقت في الهاشمة شيئا . وقال أبو ثور : إن اختلفوا فيه ففيها حكومة . قال ابن المنذر : النظر يدل على هذا ; إذ لا سنة فيها ولا إجماع ، وقال القاضي أبو الوليد الباجي : فيها ما في الموضحة ; فإن صارت منقلة فخمسة عشر ، وإن صارت مأمومة فثلث الدية . قال ابن المنذر : ووجدنا أكثر من لقيناه وبلغنا عنه من أهل العلم يجعلون في الهاشمة عشرا من الإبل ، وروينا هذا القول عن زيد بن ثابت ; وبه قال قتادة وعبيد الله بن الحسن والشافعي ، وقال الثوري وأصحاب الرأي : فيها ألف درهم ، ومرادهم عشر الدية ، وأما المنقلة فقال ابن المنذر : جاء الحديث عن النبي صلى الله عليه وسلم أنه قال : في المنقلة خمس عشرة من الإبل وأجمع أهل العلم على القول به . قال ابن المنذر : وقال كل من يحفظ عنه من أهل العلم إن المنقلة هي التي تنقل منها العظام ، وقال مالك والشافعي وأحمد وأصحاب الرأي - وهو قول قتادة وابن شبرمة - إن المنقلة لا قود فيها ; وروينا عن ابن الزبير - وليس بثابت عنه - أنه أقاد من المنقلة . قال ابن المنذر : والأول أولى ; لأني لا أعلم أحدا خالف في ذلك وأما المأمومة فقال ابن المنذر : جاء الحديث عن النبي صلى الله عليه وسلم أنه قال : في المأمومة ثلث الدية ، وأجمع عوام أهل العلم على القول به ، ولا نعلم أحدا خالف ذلك إلا مكحولا فإنه قال : إذا كانت المأمومة عمدا ففيها ثلثا الدية ، وإذا كانت خطأ ففيها ثلث الدية ; وهذا قول شاذ ، وبالقول الأول أقول . واختلفوا في القود من المأمومة ; فقال كثير من أهل العلم : لا قود فيها ; وروي عن ابن الزبير أنه أقص من المأمومة ، فأنكر ذلك الناس ، وقال عطاء : ما علمنا أحدا أقاد منا قبل ابن الزبير ، وأما الجائفة ففيها ثلث الدية على حديث عمرو بن حزم ; ولا خلاف في ذلك إلا ما روي عن مكحول أنه قال : إذا كانت عمدا ففيها ثلثا الدية ، وإن كانت خطأ ففيها ثلث الدية ، والجائفة كل ما خرق إلى الجوف ولو مدخل إبرة ; فإن نفذت من جهتين فهي عندهم جائفتان ، وفيها من الدية الثلثان . قال أشهب : وقد قضى أبو بكر الصديق رضي الله عنه في جائفة نافذة من الجنب الآخر بدية جائفتين . وقال عطاء ومالك والشافعي وأصحاب الرأي كلهم يقولون : لا قصاص في الجائفة . قال ابن المنذر : وبه نقول .\nالسادسة والعشرون : واختلفوا في القود من اللطمة وشبهها ; فذكر البخاري عن أبي بكر وعلي وابن الزبير وسويد بن مقرن رضي الله عنهم أنهم أقادوا من اللطمة وشبهها ، وروي عن عثمان وخالد بن الوليد مثل ذلك ; وهو قول الشعبي وجماعة من أهل الحديث ، وقال الليث : إن كانت اللطمة في العين فلا قود فيها ; للخوف على العين ويعاقبه السلطان ، وإن كانت على الخد ففيها القود ، وقالت طائفة : لا قصاص في اللطمة ; روي هذا عن الحسن وقتادة ، وهو قول مالك والكوفيين والشافعي ; واحتج مالك في ذلك فقال : ليس لطمة المريض الضعيف مثل لطمة القوي ، وليس العبد الأسود يلطم مثل الرجل ذي الحالة والهيئة ; وإنما في ذلك كله الاجتهاد لجهلنا بمقدار اللطمة .\nالسابعة والعشرون : واختلفوا في القود من ضرب السوط ; فقال الليث والحسن : يقاد منه ، ويزاد عليه للتعدي . وقال ابن القاسم : يقاد منه . ولا يقاد منه عند الكوفيين والشافعي إلا أن يجرح ; قال الشافعي إن جرح السوط ففيه حكومة ، وقال ابن المنذر : وما أصيب به من سوط أو عصا أو حجر فكان دون النفس فهو عمد ، وفيه القود ; وهذا قول جماعة من أصحاب الحديث ، وفي البخاري وأقاد عمر من ضربة بالدرة ، وأقاد علي بن أبي طالب من ثلاثة أسواط ، واقتص شريح من سوط وخموش ، وقال ابن بطال : وحديث لد النبي صلى الله عليه وسلم لأهل البيت حجة لمن جعل القود في كل ألم وإن لم يكن جرح .\nالثامنة والعشرون : واختلفوا في عقل جراحات النساء ; ففي \" الموطأ \" عن مالك عن يحيى بن سعيد عن سعيد بن المسيب أنه كان يقول : تعاقل المرأة الرجل إلى ثلث دية الرجل ، إصبعها كإصبعه وسنها كسنه ، وموضحتها كموضحته ، ومنقلتها كمنقلته . قال ابن بكير : قال مالك : فإذا بلغت ثلث دية الرجل كانت على النصف من دية الرجل . قال ابن المنذر : روينا هذا القول عن عمر وزيد بن ثابت ، وبه قال سعيد بن المسيب وعمر بن عبد العزيز وعروة بن الزبير والزهري وقتادة وابن هرمز ومالك وأحمد بن حنبل وعبد الملك بن الماجشون ، وقالت طائفة : دية المرأة على النصف من دية الرجل فيما قل أو كثر ; روينا هذا القول عن علي بن أبي طالب ، به قال الثوري والشافعي وأبو ثور والنعمان وصاحباه ; واحتجوا بأنهم لما أجمعوا على الكثير وهو الدية كان القليل مثله ، وبه نقول .\nالتاسعة والعشرون : قال القاضي عبد الوهاب : وكل ما فيه جمال منفرد عن منفعة أصلا ففيه حكومة ; كالحاجبين وذهاب شعر اللحية وشعر الرأس وثديي الرجل وأليته ، وصفة الحكومة أن يقوم المجني عليه لو كان عبدا سليما ، ثم يقوم مع الجناية فما نقص من ثمنه جعل جزءا من ديته بالغا ما بلغ ، وحكاه ابن المنذر عن كل من يحفظ عنه من أهل العلم ; قال : ويقبل فيه قول رجلين ثقتين من أهل المعرفة ، وقيل : بل يقبل قول عدل واحد ، والله سبحانه أعلم . فهذه جمل من أحكام الجراحات والأعضاء تضمنها معنى هذه الآية ، فيها لمن اقتصر عليها كفاية ، والله الموفق للهداية بمنه وكرمه .\nالموفية ثلاثين : قوله تعالى : فمن تصدق به فهو كفارة له شرط وجوابه ; أي : تصدق بالقصاص فعفا فهو كفارة له ، أي : لذلك المتصدق ، وقيل : هو كفارة للجارح فلا يؤاخذ بجنايته في الآخرة ; لأنه يقوم مقام أخذ الحق منه ، وأجر المتصدق عليه . وقد ذكر ابن عباس القولين ; وعلى الأول أكثر الصحابة ومن بعدهم ، وروي الثاني عن ابن عباس ومجاهد ، وعن إبراهيم النخعي والشعبي بخلاف عنهما ; والأول أظهر لأن العائد فيه يرجع إلى مذكور ، وهو \" من \" ، وعن أبي الدرداء عن النبي صلى الله عليه وسلم : ما من مسلم يصاب بشيء من جسده فيهبه إلا رفعه الله به درجة وحط عنه به خطيئة . قال ابن العربي : والذي يقول إنه إذا عفا عنه المجروح عفا الله عنه لم يقم عليه دليل ; فلا معنى له .\n                                    ",
        "saadi": "وَكَتَبۡنَا عَلَيۡهِمۡ فِيهَآ أَنَّ ٱلنَّفۡسَ بِٱلنَّفۡسِ وَٱلۡعَيۡنَ بِٱلۡعَيۡنِ وَٱلۡأَنفَ بِٱلۡأَنفِ وَٱلۡأُذُنَ بِٱلۡأُذُنِ وَٱلسِّنَّ بِٱلسِّنِّ وَٱلۡجُرُوحَ قِصَاصٞۚ فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٞ لَّهُۥۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٥٤\n                                        \n                                        \n                                        \n                                        هذه الأحكام من جملة الأحكام التي في التوراة، يحكم بها النبيون الذين أسلموا للذين هادوا والربانيون والأحبار. إن الله أوجب عليهم فيها أن النفس -إذا قتلت- تقتل بالنفس بشرط العمد والمكافأة، والعين تقلع بالعين، والأذن تؤخذ بالأذن، والسن ينزع بالسن. ومثل هذه ما أشبهها من الأطراف التي يمكن الاقتصاص منها بدون حيف. { وَالْجُرُوحَ قِصَاصٌ } والاقتصاص: أن يفعل به كما فعل. فمن جرح غيره عمدا اقتص من الجارح جرحا مثل جرحه للمجروح، حدا، وموضعا، وطولا، وعرضا وعمقا، وليعلم أن شرع من قبلنا شرع لنا، ما لم يرد شرعنا بخلافه. { فَمَن تَصَدَّقَ بِهِ } أي: بالقصاص في النفس، وما دونها من الأطراف والجروح، بأن عفا عمن جنى، وثبت له الحق قبله. { فَهُوَ كَفَّارَةٌ لَّهُ } أي: كفارة للجاني، لأن الآدمي عفا عن حقه. والله تعالى أحق وأولى بالعفو عن حقه، وكفارة أيضا عن العافي، فإنه كما عفا عمن جنى عليه، أو على من يتعلق به، فإن الله يعفو عن زلاته وجناياته. { وَمَن لَّمْ يَحْكُم بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الظَّالِمُونَ } قال ابن عباس: كفر دون كفر، وظلم دون ظلم، وفسق دون فسق، فهو ظلم أكبر، عند استحلاله، وعظيمة كبيرة عند فعله غير مستحل له.\n                                    "
      },
      "originalText": "وَكَتَبۡنَا عَلَيۡهِمۡ فِيهَآ أَنَّ ٱلنَّفۡسَ بِٱلنَّفۡسِ وَٱلۡعَيۡنَ بِٱلۡعَيۡنِ وَٱلۡأَنفَ بِٱلۡأَنفِ وَٱلۡأُذُنَ بِٱلۡأُذُنِ وَٱلسِّنَّ بِٱلسِّنِّ وَٱلۡجُرُوحَ قِصَاصٞۚ فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٞ لَّهُۥۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٥٤"
    }
  ]
}