{
  "number": 117,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 720,
      "text": "۞ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْيَهُودَ وَالنَّصَارَىٰ أَوْلِيَاءَ ۘ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ وَمَنْ يَتَوَلَّهُمْ مِنْكُمْ فَإِنَّهُ مِنْهُمْ ۗ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 51,
      "juz": 6,
      "manzil": 2,
      "page": 117,
      "ruku": 93,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡيَهُودَ وَٱلنَّصَٰرَىٰٓ أَوۡلِيَآءَۘ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَإِنَّهُۥ مِنۡهُمۡۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ١٥\n                                    \n                                    \n                                    ينهى تعالى عباده المؤمنين عن موالاة اليهود والنصارى الذين هم أعداء الإسلام وأهله ، قاتلهم الله ، ثم أخبر أن بعضهم أولياء بعض ، ثم تهدد وتوعد من يتعاطى ذلك فقال : ( ومن يتولهم منكم فإنه منهم [ إن الله لا يهدي القوم الظالمين ] )\nقال ابن أبي حاتم : حدثنا كثير بن شهاب حدثنا محمد - يعني ابن سعيد بن سابق - حدثنا عمرو بن أبي قيس عن سماك بن حرب عن عياض : أن عمر أمر أبا موسى الأشعري أن يرفع إليه ما أخذ وما أعطى في أديم واحد ، وكان له كاتب نصراني ، فرفع إليه ذلك ، فعجب عمر [ رضي الله عنه ] وقال : إن هذا لحفيظ ، هل أنت قارئ لنا كتابا في المسجد جاء من الشام؟ فقال : إنه لا يستطيع [ أن يدخل المسجد ] فقال عمر : أجنب هو؟ قال : لا بل نصراني . قال : فانتهرني وضرب فخذي ، ثم قال : أخرجوه ، ثم قرأ : ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء [ بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم إن الله لا يهدي القوم الظالمين ] )\nثم قال الحسن بن محمد بن الصباح : حدثنا عثمان بن عمر أنبأنا ابن عون عن محمد بن سيرين قال : قال عبد الله بن عتبة : ليتق أحدكم أن يكون يهوديا أو نصرانيا ، وهو لا يشعر . قال : فظنناه يريد هذه الآية : ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء [ بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم ] ) الآية . وحدثنا أبو سعيد الأشج حدثنا ابن فضيل عن عاصم عن عكرمة عن ابن عباس : أنه سئل عن ذبائح نصارى العرب فقال : كل ، قال الله تعالى : ( ومن يتولهم منكم فإنه منهم )\nوروي عن أبي الزناد نحو ذلك .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡيَهُودَ وَٱلنَّصَٰرَىٰٓ أَوۡلِيَآءَۘ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَإِنَّهُۥ مِنۡهُمۡۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ١٥\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم إن الله لا يهدي القوم الظالمين\nفيه مسألتان :\nالأولى : قوله تعالى : اليهود والنصارى أولياء مفعولان ل تتخذوا ; وهذا يدل على قطع الموالاة شرعا ، وقد مضى في \" آل عمران \" بيان ذلك . ثم قيل : المراد به المنافقون ; المعنى يا أيها الذين آمنوا بظاهرهم ، وكانوا يوالون المشركين ويخبرونهم بأسرار المسلمين ، وقيل : نزلت في أبي لبابة ، عن عكرمة . قال السدي : نزلت في قصة يوم أحد حين خاف المسلمون حتى هم قوم منهم أن يوالوا اليهود والنصارى ، وقيل : نزلت في عبادة بن الصامت وعبد الله بن أبي بن سلول ; فتبرأ عبادة رضي الله عنه من موالاة اليهود ، وتمسك بها ابن أبي وقال : إني أخاف أن تدور الدوائر . بعضهم أولياء بعض مبتدأ وخبره ; وهو يدل على إثبات الشرع الموالاة فيما بينهم حتى يتوارث اليهود والنصارى بعضهم من بعض .\nالثانية : قوله تعالى : ومن يتولهم منكم أي : يعضدهم على المسلمين . فإنه منهم بين تعالى أن حكمه كحكمهم ; وهو يمنع إثبات الميراث للمسلم من المرتد ، وكان الذي تولاهم ابن أبي ثم هذا الحكم باق إلى يوم القيامة في قطع الموالاة ; وقد قال تعالى : ولا تركنوا إلى الذين ظلموا فتمسكم النار وقال تعالى في \" آل عمران \" : لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين وقال تعالى : لا تتخذوا بطانة من دونكم وقد مضى القول فيه ، وقيل : إن معنى بعضهم أولياء بعض أي : في النصر ومن يتولهم منكم فإنه منهم شرط وجوابه ; أي : لأنه قد خالف الله تعالى ورسوله كما خالفوا ، ووجبت معاداته كما وجبت معاداتهم ، ووجبت له النار كما وجبت لهم ; فصار منهم أي : من أصحابهم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡيَهُودَ وَٱلنَّصَٰرَىٰٓ أَوۡلِيَآءَۘ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَإِنَّهُۥ مِنۡهُمۡۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ١٥\n                                        \n                                        \n                                        \n                                        يرشد تعالى عباده المؤمنين حين بيَّن لهم أحوال اليهود والنصارى وصفاتهم غير الحسنة، أن لا يتخذوهم أولياء. فإن بَعْضهُمْ أَوْلِيَاءُ بَعْضٍ يتناصرون فيما بينهم ويكونون يدا على من سواهم، فأنتم لا تتخذوهم أولياء، فإنهم الأعداء على الحقيقة ولا يبالون بضركم، بل لا يدخرون من مجهودهم شيئا على إضلالكم، فلا يتولاهم إلا من هو مثلهم، ولهذا قال: { وَمَن يَتَوَلَّهُم مِّنْكُمْ فَإِنَّهُ مِنْهُمْ ْ} لأن التولي التام يوجب الانتقال إلى دينهم. والتولي القليل يدعو إلى الكثير، ثم يتدرج شيئا فشيئا، حتى يكون العبد منهم. { إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ ْ} أي: الذين وصْفُهم الظلم، وإليه يَرجعون، وعليه يعولون. فلو جئتهم بكل آية ما تبعوك، ولا انقادوا لك.\n                                    "
      },
      "originalText": "۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلۡيَهُودَ وَٱلنَّصَٰرَىٰٓ أَوۡلِيَآءَۘ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَإِنَّهُۥ مِنۡهُمۡۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ١٥"
    },
    {
      "number": 721,
      "text": "فَتَرَى الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يُسَارِعُونَ فِيهِمْ يَقُولُونَ نَخْشَىٰ أَنْ تُصِيبَنَا دَائِرَةٌ ۚ فَعَسَى اللَّهُ أَنْ يَأْتِيَ بِالْفَتْحِ أَوْ أَمْرٍ مِنْ عِنْدِهِ فَيُصْبِحُوا عَلَىٰ مَا أَسَرُّوا فِي أَنْفُسِهِمْ نَادِمِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 52,
      "juz": 6,
      "manzil": 2,
      "page": 117,
      "ruku": 93,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَتَرَى ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ يُسَٰرِعُونَ فِيهِمۡ يَقُولُونَ نَخۡشَىٰٓ أَن تُصِيبَنَا دَآئِرَةٞۚ فَعَسَى ٱللَّهُ أَن يَأۡتِيَ بِٱلۡفَتۡحِ أَوۡ أَمۡرٖ مِّنۡ عِندِهِۦ فَيُصۡبِحُواْ عَلَىٰ مَآ أَسَرُّواْ فِيٓ أَنفُسِهِمۡ نَٰدِمِينَ ٢٥\n                                    \n                                    \n                                    وقوله : ( فترى الذين في قلوبهم مرض ) أي : شك ، وريب ، ونفاق ( يسارعون فيهم ) أي : يبادرون إلى موالاتهم ومودتهم في الباطن والظاهر ، ( يقولون نخشى أن تصيبنا دائرة ) أي : يتأولون في مودتهم وموالاتهم أنهم يخشون أن يقع أمر من ظفر الكفار بالمسلمين ، فتكون لهم أياد عند اليهود والنصارى فينفعهم ذلك ، عند ذلك قال الله تعالى : ( فعسى الله أن يأتي بالفتح ) قال السدي : يعني فتح مكة . وقال غيره : يعني القضاء والفصل ( أو أمر من عنده ) قال السدي : يعني ضرب الجزية على اليهود والنصارى ( فيصبحوا ) يعني : الذين والوا اليهود والنصارى من المنافقين ( على ما أسروا في أنفسهم نادمين ) من الموالاة ( نادمين ) أي : على ما كان منهم ، مما لم يجد عنهم شيئا ، ولا دفع عنهم محذورا ، بل كان عين المفسدة ، فإنهم فضحوا ، وأظهر الله أمرهم في الدنيا لعباده المؤمنين ، بعد أن كانوا مستورين لا يدرى كيف حالهم . فلما انعقدت الأسباب الفاضحة لهم ، تبين أمرهم لعباد الله المؤمنين ، فتعجبوا منهم كيف كانوا يظهرون أنهم من المؤمنين ، ويحلفون على ذلك ويتأولون ، فبان كذبهم وافتراؤهم ; ولهذا قال تعالى :\n                                    ",
        "qortoby": "فَتَرَى ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ يُسَٰرِعُونَ فِيهِمۡ يَقُولُونَ نَخۡشَىٰٓ أَن تُصِيبَنَا دَآئِرَةٞۚ فَعَسَى ٱللَّهُ أَن يَأۡتِيَ بِٱلۡفَتۡحِ أَوۡ أَمۡرٖ مِّنۡ عِندِهِۦ فَيُصۡبِحُواْ عَلَىٰ مَآ أَسَرُّواْ فِيٓ أَنفُسِهِمۡ نَٰدِمِينَ ٢٥\n                                    \n                                    \n                                    قوله تعالى : فترى الذين في قلوبهم مرض يسارعون فيهم يقولون نخشى أن تصيبنا دائرة فعسى الله أن يأتي بالفتح أو أمر من عنده فيصبحوا على ما أسروا في أنفسهم نادمين\nقوله تعالى : فترى الذين في قلوبهم مرض شك ونفاق ، وقد تقدم في \" البقرة \" والمراد ابن أبي وأصحابه يسارعون فيهم أي : في موالاتهم ومعاونتهم . يقولون نخشى أن تصيبنا دائرة أي : يدور الدهر علينا إما بقحط فلا يميزوننا ولا يفضلوا علينا ، وإما أن يظفر اليهود بالمسلمين فلا يدوم الأمر لمحمد صلى الله عليه وسلم ، وهذا القول أشبه بالمعنى ; كأنه من دارت تدور ، أي : نخشى أن يدور الأمر ; ويدل عليه قوله عز وجل : فعسى الله أن يأتي بالفتح ; وقال الشاعر :\nيرد عنك القدر المقدورا ودائرات الدهر أن تدورا\nيعني دول الدهر الدائرة من قوم إلى قوم . واختلف في معنى الفتح ، فقيل : الفتح الفصل والحكم ، عن قتادة وغيره . قال ابن عباس : أتى الله بالفتح فقتلت مقاتلة بني قريظة وسبيت ذراريهم وأجلي بنو النضير . وقال أبو علي : هو فتح بلاد المشركين على المسلمين . وقال السدي : يعني بالفتح فتح مكة . أو أمر من عنده قال السدي : هو الجزية . الحسن : إظهار أمر المنافقين والإخبار بأسمائهم والأمر بقتلهم ، وقيل : الخصب والسعة للمسلمين . فيصبحوا على ما أسروا في أنفسهم نادمين أي : فيصبحوا نادمين على توليهم الكفار إذا رأوا نصر الله للمؤمنين ، وإذا عاينوا عند الموت فبشروا بالعذاب .\n                                    ",
        "saadi": "فَتَرَى ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ يُسَٰرِعُونَ فِيهِمۡ يَقُولُونَ نَخۡشَىٰٓ أَن تُصِيبَنَا دَآئِرَةٞۚ فَعَسَى ٱللَّهُ أَن يَأۡتِيَ بِٱلۡفَتۡحِ أَوۡ أَمۡرٖ مِّنۡ عِندِهِۦ فَيُصۡبِحُواْ عَلَىٰ مَآ أَسَرُّواْ فِيٓ أَنفُسِهِمۡ نَٰدِمِينَ ٢٥\n                                        \n                                        \n                                        \n                                        ولما نهى الله المؤمنين عن توليهم، أخبر أن ممن يدعي الإيمان طائفةً تواليهم، فقال: { فَتَرَى الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ ْ} أي: شك ونفاق، وضعف إيمان، يقولون: إن تولينا إياهم للحاجة، فإننا { نَخْشَى أَن تُصِيبَنَا دَائِرَةٌ ْ} أي: تكون الدائرة لليهود والنصارى، فإذا كانت الدائرة لهم، فإذا لنا معهم يد يكافؤننا عنها، وهذا سوء ظن منهم بالإسلام، قال تعالى -رادا لظنهم السيئ-: { فَعَسَى اللَّهُ أَن يَأْتِيَ بِالْفَتْحِ ْ} الذي يعز الله به الإسلام على اليهود والنصارى، ويقهرهم المسلمون { أَوْ أَمْرٍ مِنْ عِندِهِ ْ} ييأس به المنافقون من ظفر الكافرين من اليهود وغيرهم { فَيُصْبِحُوا عَلَى مَا أَسَرُّوا ْ} أي: أضمروا { فِي أَنفُسِهِمْ نَادِمِينَ ْ} على ما كان منهم وضرهم بلا نفع حصل لهم، فحصل الفتح الذي نصر الله به الإسلام والمسلمين، وأذل به الكفر والكافرين، فندموا وحصل لهم من الغم ما الله به عليم.\n                                    "
      },
      "originalText": "فَتَرَى ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ يُسَٰرِعُونَ فِيهِمۡ يَقُولُونَ نَخۡشَىٰٓ أَن تُصِيبَنَا دَآئِرَةٞۚ فَعَسَى ٱللَّهُ أَن يَأۡتِيَ بِٱلۡفَتۡحِ أَوۡ أَمۡرٖ مِّنۡ عِندِهِۦ فَيُصۡبِحُواْ عَلَىٰ مَآ أَسَرُّواْ فِيٓ أَنفُسِهِمۡ نَٰدِمِينَ ٢٥"
    },
    {
      "number": 722,
      "text": "وَيَقُولُ الَّذِينَ آمَنُوا أَهَٰؤُلَاءِ الَّذِينَ أَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ ۙ إِنَّهُمْ لَمَعَكُمْ ۚ حَبِطَتْ أَعْمَالُهُمْ فَأَصْبَحُوا خَاسِرِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 53,
      "juz": 6,
      "manzil": 2,
      "page": 117,
      "ruku": 93,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَقُولُ ٱلَّذِينَ ءَامَنُوٓاْ أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ إِنَّهُمۡ لَمَعَكُمۡۚ حَبِطَتۡ أَعۡمَٰلُهُمۡ فَأَصۡبَحُواْ خَٰسِرِينَ ٣٥\n                                    \n                                    \n                                    وقد اختلف القراء في هذا الحرف ، فقرأه الجمهور بإثبات الواو في قوله : ( ويقول الذين ) ثم منهم من رفع ( ويقول ) على الابتداء ، ومنهم من نصب عطفا على قوله : ( فعسى الله أن يأتي بالفتح أو أمر من عنده ) تقديره \" أن يأتي \" \" وأن يقول \" ، وقرأ أهل المدينة : ( يقول الذين آمنوا ) بغير واو ، وكذلك هو في مصاحفهم على ما ذكره ابن جرير قال ابن جريج عن مجاهد : ( فعسى الله أن يأتي بالفتح أو أمر من عنده ) حينئذ ( ويقول الذين آمنوا أهؤلاء الذين أقسموا بالله جهد أيمانهم إنهم لمعكم حبطت أعمالهم فأصبحوا خاسرين )\nواختلف المفسرون في سبب نزول هذه الآيات الكريمات ، فذكر السدي أنها نزلت في رجلين ، قال أحدهما لصاحبه بعد وقعة أحد : أما أنا فإني ذاهب إلى ذلك اليهودي ، فآوي إليه وأتهود معه ، لعله ينفعني إذا وقع أمر أو حدث حادث! وقال الآخر : وأما أنا فأذهب إلى فلان النصراني بالشام ، فآوي إليه وأتنصر معه ، فأنزل الله [ عز وجل ] ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء ) الآيات .\nوقال عكرمة : نزلت في أبي لبابة بن عبد المنذر حين بعثه رسول الله صلى الله عليه وسلم إلى بني قريظة فسألوه : ماذا هو صانع بنا؟ فأشار بيده إلى حلقه ، أي : إنه الذبح . رواه ابن جرير .\nوقيل : نزلت في عبد الله بن أبي ابن سلول كما قال ابن جرير :\nحدثنا أبو كريب حدثنا ابن إدريس قال : سمعت أبي عن عطية بن سعد قال : جاء عبادة بن الصامت من بني الخزرج إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، إن لي موالي من يهود كثير عددهم ، وإني أبرأ إلى الله ورسوله من ولاية يهود ، وأتولى الله ورسوله . فقال عبد الله بن أبي : إني رجل أخاف الدوائر ، لا أبرأ من ولاية موالي . فقال رسول الله صلى الله عليه وسلم لعبد الله بن أبي : \" يا أبا الحباب ، ما بخلت به من ولاية يهود على عبادة بن الصامت فهو لك دونه \" . قال : قد قبلت! فأنزل الله عز وجل : ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء [ بعضهم أولياء بعض ] ) إلى قوله : ( فترى الذين في قلوبهم مرض ) .\nثم قال ابن جرير : حدثنا هناد حدثنا يونس بن بكير حدثنا عثمان بن عبد الرحمن عن الزهري قال : لما انهزم أهل بدر قال المسلمون لأوليائهم من يهود : آمنوا قبل أن يصيبكم الله بيوم مثل يوم بدر ! فقال مالك بن الصيف : أغركم أن أصبتم رهطا من قريش لا علم لهم بالقتال!! أما لو أمررنا العزيمة أن نستجمع عليكم ، لم يكن لكم يد بقتالنا فقال عبادة : يا رسول الله ، إن أوليائي من اليهود كانت شديدة أنفسهم ، كثيرا سلاحهم ، شديدة شوكتهم ، وإني أبرأ إلى الله [ تعالى ] وإلى رسوله من ولاية يهود ولا مولى لي إلا الله ورسوله . فقال عبد الله بن أبي : لكني لا أبرأ من ولاء يهود أنا رجل لا بد لي منهم . فقال رسول الله صلى الله عليه وسلم : \" يا أبا الحباب أرأيت الذي نفست به من ولاء يهود على عبادة بن الصامت فهو لك دونه؟ \" فقال : إذا أقبل! قال : فأنزل الله : ( ياأيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ) إلى قوله : ( والله يعصمك من الناس ) [ المائدة : 67 ] .\nوقال محمد بن إسحاق : فكانت أول قبيلة من اليهود نقضت ما بينها وبين رسول الله صلى الله عليه وسلم بنو قينقاع . فحدثني عاصم بن عمر بن قتادة قال : فحاصرهم رسول الله صلى الله عليه وسلم حتى نزلوا على حكمه ، فقام إليه عبد الله بن أبي ابن سلول حين أمكنه الله منهم ، فقال : يا محمد أحسن في موالي . وكانوا حلفاء الخزرج قال : فأبطأ عليه رسول الله صلى الله عليه وسلم ، فقال : يا محمد أحسن في موالي . قال : فأعرض عنه . فأدخل يده في جيب درع رسول الله صلى الله عليه وسلم . فقال له رسول الله صلى الله عليه وسلم . \" أرسلني \" . وغضب رسول الله صلى الله عليه وسلم حتى رئي لوجهه ظللا ثم قال : \" ويحك أرسلني \" . قال : لا والله لا أرسلك حتى تحسن في موالي ، أربعمائة حاسر ، وثلاثمائة دارع ، قد منعوني من الأحمر والأسود ، تحصدهم في غداة واحدة؟! إني امرؤ أخشى الدوائر ، قال : فقال رسول الله صلى الله عليه وسلم : \" هم لك \"\nقال محمد بن إسحاق : فحدثني أبو إسحاق بن يسار عن عبادة بن الوليد بن عبادة بن الصامت قال : لما حاربت بنو قينقاع رسول الله صلى الله عليه وسلم تشبث بأمرهم عبد الله بن أبي وقام دونهم ، ومشى عبادة بن الصامت إلى رسول الله صلى الله عليه وسلم ، وكان أحد بني عوف بن الخزرج له من حلفهم مثل الذي لعبد الله بن أبي فجعلهم إلى رسول الله صلى الله عليه وسلم وتبرأ إلى الله ورسوله صلى الله عليه وسلم من حلفهم ، وقال : يا رسول الله ، أتبرأ إلى الله وإلى رسوله من حلفهم ، وأتولى الله ورسوله والمؤمنين ، وأبرأ من حلف الكفار وولايتهم . ففيه وفي عبد الله بن أبي نزلت الآيات في المائدة : ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ) إلى قوله : ( ومن يتول الله ورسوله والذين آمنوا فإن حزب الله هم الغالبون ) [ المائدة : 56 ] .\nوقال الإمام أحمد : حدثنا قتيبة بن سعيد حدثنا يحيى بن زكريا بن أبي زائدة عن محمد بن إسحاق عن الزهري عن عروة عن أسامة بن زيد قال : دخلت مع رسول الله صلى الله عليه وسلم على عبد الله بن أبي نعوده ، فقال له النبي صلى الله عليه وسلم : \" قد كنت أنهاك عن حب يهود \" . فقال عبد الله : فقد أبغضهم أسعد بن زرارة فمات .\nوكذا رواه أبو داود من حديث محمد بن إسحاق .\n                                    ",
        "qortoby": "وَيَقُولُ ٱلَّذِينَ ءَامَنُوٓاْ أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ إِنَّهُمۡ لَمَعَكُمۡۚ حَبِطَتۡ أَعۡمَٰلُهُمۡ فَأَصۡبَحُواْ خَٰسِرِينَ ٣٥\n                                    \n                                    \n                                    قوله تعالى : ويقول الذين آمنوا وقرأ أهل المدينة وأهل الشام : \" يقول \" بغير واو ، وقرأ أبو عمرو وابن أبي إسحاق : \" ويقول \" بالواو والنصب عطفا على \" أن يأتي \" عند أكثر النحويين ، التقدير : فعسى الله أن يأتي بالفتح وأن يقول ، وقيل : هو عطف على المعنى ; لأن معنى عسى الله أن يأتي بالفتح وعسى أن يأتي الله بالفتح ; إذ لا يجوز عسى زيد أن يأتي ويقوم عمرو ; لأنه لا يصح المعنى إذا قلت وعسى زيد أن يقوم عمرو ، ولكن لو قلت : عسى أن يقوم زيد ويأتي عمرو كان جيدا . فإذا قدرت التقديم في أن يأتي إلى جنب عسى حسن ; لأنه يصير التقدير : عسى أن يأتي وعسى أن يقوم ، ويكون من باب قوله :\nورأيت زوجك في الوغى متقلدا سيفا ورمحا\nوفيه قول ثالث : وهو أن تعطفه على الفتح ; كما قال الشاعر :\nللبس عباءة وتقر عيني أحب إلي من لبس الشفوف\nويجوز أن يجعل أن يأتي بدلا من اسم الله جل ذكره ; فيصير التقدير : عسى أن يأتي الله ويقول الذين آمنوا ، وقرأ الكوفيون ويقول الذين آمنوا بالرفع على القطع من الأول . ( أهؤلاء ) إشارة إلى المنافقين . ( أقسموا بالله ) حلفوا واجتهدوا في الأيمان ( إنهم لمعكم ) أي : قالوا إنهم ، ويجوز \" أنهم \" نصب ب أقسموا أي : قال المؤمنون لليهود على جهة التوبيخ : أهؤلاء الذين أقسموا بالله جهد أيمانهم أنهم يعينونكم على محمد ، ويحتمل أن يكون من المؤمنين بعضهم لبعض ; أي : هؤلاء الذين كانوا يحلفون أنهم مؤمنون فقد هتك الله اليوم سترهم . حبطت أعمالهم بطلت بنفاقهم . فأصبحوا خاسرين أي : خاسرين الثواب ، وقيل : خسروا في موالاة اليهود فلم تحصل لهم ثمرة بعد قتل اليهود وإجلائهم .\n                                    ",
        "saadi": "وَيَقُولُ ٱلَّذِينَ ءَامَنُوٓاْ أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ إِنَّهُمۡ لَمَعَكُمۡۚ حَبِطَتۡ أَعۡمَٰلُهُمۡ فَأَصۡبَحُواْ خَٰسِرِينَ ٣٥\n                                        \n                                        \n                                        \n                                        { وَيَقُولُ الَّذِينَ آمَنُوا ْ} متعجبين من حال هؤلاء الذين في قلوبهم مرض: { أَهَؤُلَاءِ الَّذِينَ أَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ إِنَّهُمْ لَمَعَكُمْ ْ} أي: حلفوا وأكدوا حلفهم، وغلظوه بأنواع التأكيدات: إنهم لمعكم في الإيمان، وما يلزمه من النصرة والمحبة والموالاة، ظهر ما أضمروه، وتبين ما أسروه، وصار كيدهم الذي كادوه، وظنهم الذي ظنوه بالإسلام وأهله -باطلا، فبطل كيدهم وبطلت { أَعْمَالُهُمْ ْ} في الدنيا { فَأَصْبَحُوا خَاسِرِينَ ْ} حيث فاتهم مقصودهم، وحضرهم الشقاء والعذاب.\n                                    "
      },
      "originalText": "وَيَقُولُ ٱلَّذِينَ ءَامَنُوٓاْ أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ إِنَّهُمۡ لَمَعَكُمۡۚ حَبِطَتۡ أَعۡمَٰلُهُمۡ فَأَصۡبَحُواْ خَٰسِرِينَ ٣٥"
    },
    {
      "number": 723,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دِينِهِ فَسَوْفَ يَأْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ عَلَى الْكَافِرِينَ يُجَاهِدُونَ فِي سَبِيلِ اللَّهِ وَلَا يَخَافُونَ لَوْمَةَ لَائِمٍ ۚ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ وَاسِعٌ عَلِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 54,
      "juz": 6,
      "manzil": 2,
      "page": 117,
      "ruku": 93,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَن يَرۡتَدَّ مِنكُمۡ عَن دِينِهِۦ فَسَوۡفَ يَأۡتِي ٱللَّهُ بِقَوۡمٖ يُحِبُّهُمۡ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلۡمُؤۡمِنِينَ أَعِزَّةٍ عَلَى ٱلۡكَٰفِرِينَ يُجَٰهِدُونَ فِي سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوۡمَةَ لَآئِمٖۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ ٤٥\n                                    \n                                    \n                                    يقول تعالى مخبرا عن قدرته العظيمة أن من تولى عن نصرة دينه وإقامة شريعته ، فإن الله يستبدل به من هو خير لها منه وأشد منعة وأقوم سبيلا كما قال تعالى : ( وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم ) [ محمد : 38 ] وقال تعالى : ( إن يشأ يذهبكم أيها الناس ويأت بآخرين ) [ النساء : 133 ] ، وقال تعالى : ( إن يشأ يذهبكم ويأت بخلق جديد وما ذلك على الله بعزيز ) [ إبراهيم : 19 ، 20 ] أي : بممتنع ولا صعب . وقال تعالى هاهنا : ( يا أيها الذين آمنوا من يرتد منكم عن دينه ) أي : يرجع عن الحق إلى الباطل .\nقال محمد بن كعب : نزلت في الولاة من قريش . وقال الحسن البصري : نزلت في أهل الردة أيام أبي بكر .\n( فسوف يأتي الله بقوم يحبهم ويحبونه ) قال الحسن : هو والله أبو بكر وأصحابه [ رضي الله عنهم ] رواه ابن أبي حاتم .\nوقال أبو بكر بن أبي شيبة : سمعت أبا بكر بن عياش يقول في قوله ( فسوف يأتي الله بقوم يحبهم ويحبونه ) هم أهل القادسية . وقال ليث بن أبي سليم عن مجاهد : هم قوم من سبأ .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج حدثنا عبد الله بن الأجلح عن محمد بن عمرو عن سالم عن سعيد بن جبير عن ابن عباس قوله : ( فسوف يأتي الله بقوم يحبهم ويحبونه ) قال : ناس من أهل اليمن ثم من كندة ثم من السكون .\nوحدثنا أبي حدثنا محمد بن المصفى حدثنا معاوية - يعني ابن حفص - عن أبي زياد الحلفاني عن محمد بن المنكدر عن جابر بن عبد الله قال : سئل رسول الله صلى الله عليه وسلم عن قوله : ( فسوف يأتي الله بقوم يحبهم ويحبونه ) قال : \" هؤلاء قوم من أهل اليمن ثم من كندة ثم من السكون ثم من تجيب \" . وهذا حديث غريب جدا .\nوقال ابن أبى حاتم : حدثنا عمر بن شبة حدثنا عبد الصمد - يعني ابن عبد الوارث - حدثنا شعبة عن سماك سمعت عياضا يحدث عن الأشعري قال : لما نزلت : ( فسوف يأتي الله بقوم يحبهم ويحبونه ) قال رسول الله صلى الله عليه وسلم : \" هم قوم هذا \" . ورواه ابن جرير من حديث شعبة بنحوه .\nوقوله تعالى : ( أذلة على المؤمنين أعزة على الكافرين ) هذه صفات المؤمنين الكمل أن يكون أحدهم متواضعا لأخيه ووليه ، متعززا على خصمه وعدوه ، كما قال تعالى : ( محمد رسول الله والذين معه أشداء على الكفار رحماء بينهم ) [ الفتح : 29 ] . وفي صفة النبي صلى الله عليه وسلم أنه : \" الضحوك القتال \" فهو ضحوك لأوليائه قتال لأعدائه .\nوقوله [ تعالى ] ( يجاهدون في سبيل الله ولا يخافون لومة لائم ) أي : لا يردهم عما هم فيه من طاعة الله ، وقتال أعدائه ، وإقامة الحدود ، والأمر بالمعروف والنهي عن المنكر ، لا يردهم عن ذلك راد ، ولا يصدهم عنه صاد ، ولا يحيك فيهم لوم لائم ولا عذل عاذل .\nقال الإمام أحمد : حدثنا عفان حدثنا سلام أبو المنذر عن محمد بن واسع ، عن عبد الله بن الصامت عن أبي ذر قال : أمرني خليلي صلى الله عليه وسلم بسبع ، أمرني بحب المساكين والدنو منهم ، وأمرني أن أنظر إلى من هو دوني ، ولا أنظر إلى من هو فوقي ، وأمرني أن أصل الرحم وإن أدبرت ، وأمرني أن لا أسأل أحدا شيئا ، وأمرني أن أقول الحق وإن كان مرا ، وأمرني ألا أخاف في الله لومة لائم ، وأمرني أن أكثر من قول : لا حول ولا قوة إلا بالله ، فإنهن من كنز تحت العرش .\nوقال الإمام أحمد أيضا : حدثنا أبو المغيرة حدثنا صفوان عن أبي المثنى أن أبا ذر قال : بايعني رسول الله صلى الله عليه وسلم خمسا وواثقني سبعا ، وأشهد الله علي تسعا ، أني لا أخاف في الله لومة لائم . قال أبو ذر : فدعاني رسول الله صلى الله عليه وسلم فقال : \" هل لك إلى بيعة ولك الجنة؟ \" قلت : نعم ، قال : وبسطت يدي ، فقال النبي صلى الله عليه وسلم وهو يشترط : على ألا تسأل الناس شيئا؟ قلت : نعم . قال : \" ولا سوطك وإن سقط منك يعني تنزل إليه فتأخذه . \"\nوقال الإمام أحمد : حدثنا محمد بن الحسن حدثنا جعفر عن المعلى القردوسي عن الحسن عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم : \" ألا لا يمنعن أحدكم رهبة الناس أن يقول بحق إذا رآه أو شهده ، فإنه لا يقرب من أجل ، ولا يباعد من رزق أن يقول بحق أو يذكر بعظيم \" . تفرد به أحمد .\nوقال أحمد : حدثنا عبد الرزاق أخبرنا سفيان عن زبيد عن عمرو بن مرة عن أبي البختري عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم : \" لا يحقرن أحدكم نفسه أن يرى أمرا لله فيه مقال ، فلا يقول فيه ، فيقال له يوم القيامة : ما منعك أن تكون قلت في كذا وكذا ؟ فيقول : مخافة الناس . فيقول : إياي أحق أن تخاف \" .\nورواه ابن ماجه من حديث الأعمش عن عمرو بن مرة به . وروى أحمد وابن ماجه من حديث عبد الله بن عبد الرحمن بن أبي طوالة عن نهار بن عبد الله العبدي المدني عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم قال : \" إن الله ليسأل العبد يوم القيامة ، حتى إنه ليسأله يقول له : أي عبدي ، رأيت منكرا فلم تنكره؟ فإذا لقن الله عبدا حجته ، قال : أي رب ، وثقت بك وخفت الناس \" .\nوثبت في الصحيح : \" ما ينبغي لمؤمن أن يذل نفسه \" ، قالوا : وكيف يذل نفسه يا رسول الله؟ قال : \" يتحمل من البلاء ما لا يطيق \" .\n( ذلك فضل الله يؤتيه من يشاء ) أي : من اتصف بهذه الصفات ، فإنما هو من فضل الله عليه ، وتوفيقه له ( والله واسع عليم ) أي : واسع الفضل ، عليم بمن يستحق ذلك ممن يحرمه إياه .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَن يَرۡتَدَّ مِنكُمۡ عَن دِينِهِۦ فَسَوۡفَ يَأۡتِي ٱللَّهُ بِقَوۡمٖ يُحِبُّهُمۡ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلۡمُؤۡمِنِينَ أَعِزَّةٍ عَلَى ٱلۡكَٰفِرِينَ يُجَٰهِدُونَ فِي سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوۡمَةَ لَآئِمٖۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ ٤٥\n                                    \n                                    \n                                    قوله : ياأيها الذين آمنوا من يرتد منكم عن دينه فسوف يأتي الله بقوم يحبهم ويحبونه أذلة على المؤمنين أعزة على الكافرين يجاهدون في سبيل الله ولا يخافون لومة لائم ذلك فضل الله يؤتيه من يشاء والله واسع عليم\nفيه أربع مسائل :\nالأولى : قوله تعالى : من يرتد منكم عن دينه شرط وجوابه فسوف ، وقراءة أهل المدينة والشام \" من يرتدد \" بدالين . الباقون \" من يرتد \" . وهذا من إعجاز القرآن والنبي صلى الله عليه وسلم : إذ أخبر عن ارتدادهم ولم يكن ذلك في عهده وكان ذلك غيبا ، فكان على ما أخبر بعد مدة ، وأهل الردة كانوا بعد موته صلى الله عليه وسلم . قال ابن إسحاق : لما قبض رسول الله صلى الله عليه وسلم ارتدت العرب إلا ثلاثة مساجد مسجد المدينة ، ومسجد مكة ، ومسجد جؤاثى ، وكانوا في ردتهم على قسمين : قسم نبذ الشريعة كلها وخرج عنها ، وقسم نبذ وجوب الزكاة واعترف بوجوب غيرها ; قالوا نصوم ونصلي ولا نزكي ; فقاتل الصديق جميعهم ; وبعث خالد بن الوليد إليهم بالجيوش فقاتلهم وسباهم ; على ما هو مشهور من أخبارهم .\nالثانية : قوله تعالى : فسوف يأتي الله بقوم يحبهم ويحبونه في موضع النعت . قال الحسن وقتادة وغيرهما : نزلت في أبي بكر الصديق وأصحابه ، وقال السدي : نزلت في الأنصار . وقيل : هي إشارة إلى قوم لم يكونوا موجودين في ذلك الوقت ، وأن أبا بكر قاتل أهل الردة بقوم لم يكونوا وقت نزول الآية ; وهم أحياء من اليمن من كندة وبجيلة ، ومن أشجع ، وقيل : إنها نزلت في الأشعريين ; ففي الخبر أنها لما نزلت قدم بعد ذلك بيسير سفائن الأشعريين ، وقبائل اليمن من طريق البحر ، فكان لهم بلاء في الإسلام في زمن رسول الله صلى الله عليه وسلم ، وكانت عامة فتوح العراق في زمن عمر رضي الله عنه على يدي قبائل اليمن ; هذا أصح ما قيل في نزولها ، والله أعلم ، وروى الحاكم أبو عبد الله في \" المستدرك \" بإسناده : أن النبي صلى الله عليه وسلم أشار إلى أبي موسى الأشعري لما نزلت هذه الآية فقال : ( هم قوم هذا ) قال القشيري : فأتباع أبي الحسن من قومه ; لأن كل موضع أضيف فيه قوم إلى نبي أريد به الأتباع .\nالثالثة : قوله تعالى : أذلة على المؤمنين ( أذلة ) نعت لقوم ، وكذلك ( أعزة ) أي : يرأفون بالمؤمنين ويرحمونهم ويلينون لهم ; من قولهم : دابة ذلول أي : تنقاد سهلة ، وليس من الذل في شيء ، ويغلظون على الكافرين ويعادونهم . قال ابن عباس : هم للمؤمنين كالوالد للولد والسيد للعبد ، وهم في الغلظة على الكفار كالسبع على فريسته ; قال الله تعالى : أشداء على الكفار رحماء بينهم ، ويجوز \" أذلة \" بالنصب على الحال ; أي : يحبهم ويحبونه في هذا الحال ، وقد تقدمت معنى محبة الله تعالى لعباده ومحبتهم له .\nالرابعة : يجاهدون في سبيل الله في موضع الصفة أيضا . ولا يخافون لومة لائم بخلاف المنافقين يخافون الدوائر ; فدل بهذا على تثبيت إمامة أبي بكر وعمر وعثمان وعلي رضي الله عنهم ; لأنهم جاهدوا في الله عز وجل في حياة رسول الله صلى الله عليه وسلم ، وقاتلوا المرتدين بعده ، ومعلوم أن من كانت فيه هذه الصفات فهو ولي لله تعالى ، وقيل : الآية عامة في كل من يجاهد الكفار إلى قيام الساعة ، والله أعلم . ذلك فضل الله يؤتيه من يشاء ابتداء وخبر ( واسع عليم ) أي : واسع الفضل ، عليم بمصالح خلقه .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَن يَرۡتَدَّ مِنكُمۡ عَن دِينِهِۦ فَسَوۡفَ يَأۡتِي ٱللَّهُ بِقَوۡمٖ يُحِبُّهُمۡ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلۡمُؤۡمِنِينَ أَعِزَّةٍ عَلَى ٱلۡكَٰفِرِينَ يُجَٰهِدُونَ فِي سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوۡمَةَ لَآئِمٖۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ ٤٥\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه الغني عن العالمين، وأنه من يرتد عن دينه فلن يضر الله شيئا، وإنما يضر نفسه. وأن لله عبادا مخلصين، ورجالا صادقين، قد تكفل الرحمن الرحيم بهدايتهم، ووعد بالإتيان بهم، وأنهم أكمل الخلق أوصافا، وأقواهم نفوسا، وأحسنهم أخلاقا، أجلُّ صفاتهم أن الله { يُحِبُّهُمْ وَيُحِبُّونَهُ ْ} فإن محبة الله للعبد هي أجل نعمة أنعم بها عليه، وأفضل فضيلة، تفضل الله بها عليه، وإذا أحب الله عبدا يسر له الأسباب، وهون عليه كل عسير، ووفقه لفعل الخيرات وترك المنكرات، وأقبل بقلوب عباده إليه بالمحبة والوداد. ومن لوازم محبة العبد لربه، أنه لابد أن يتصف بمتابعة الرسول صلى الله عليه وسلم ظاهرا وباطنا، في أقواله وأعماله وجميع أحواله، كما قال تعالى: { قُلْ إِن كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ ْ} كما أن من لازم محبة الله للعبد، أن يكثر العبد من التقرب إلى الله بالفرائض والنوافل، كما قال النبي صلى الله عليه وسلم في الحديث الصحيح عن الله: \"وما تقرب إليَّ عبدي بشيء أحب إليَّ مما افترضت عليه، ولا يزال [عبدي] يتقرب إليَّ بالنوافل حتى أُحبه، فإذا أحببتُه كنتُ سمعه الذي يسمع به، وبصره الذي يبصر به، ويده التي يبطش بها، ورجله التي يمشي بها، ولئن سألني لأعطينه، ولئن استعاذني لأعيذنه\". ومن لوازم محبة الله معرفته تعالى، والإكثار من ذكره، فإن المحبة بدون معرفة بالله ناقصة جدا، بل غير موجودة وإن وجدت دعواها، ومن أحب الله أكثر من ذكره، وإذا أحب الله عبدا قبل منه اليسير من العمل، وغفر له الكثير من الزلل. ومن صفاتهم أنهم { أَذِلَّةٍ عَلَى الْمُؤْمِنِينَ أَعِزَّةٍ عَلَى الْكَافِرِينَ ْ} فهم للمؤمنين أذلة من محبتهم لهم، ونصحهم لهم، ولينهم ورفقهم ورأفتهم، ورحمتهم بهم وسهولة جانبهم، وقرب الشيء الذي يطلب منهم وعلى الكافرين بالله، المعاندين لآياته، المكذبين لرسله - أعزة، قد اجتمعت هممهم وعزائمهم على معاداتهم، وبذلوا جهدهم في كل سبب يحصل به الانتصار عليهم، قال تعالى: { وَأَعِدُّوا لَهُم مَا اسْتَطَعْتُمْ مِن قُوَّةٍ وَمِن رِبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ ْ} وقال تعالى: { أَشِدَّاءُ عَلَى الْكُفَّارِ رُحَمَاءُ بَيْنَهُمْ ْ} فالغلظة والشدة على أعداء الله مما يقرب العبد إلى الله، ويوافق العبد ربه في سخطه عليهم، ولا تمنع الغلظة عليهم والشدة دعوتهم إلى الدين الإسلامي بالتي هي أحسن. فتجتمع الغلظة عليهم، واللين في دعوتهم، وكلا الأمرين من مصلحتهم ونفعه عائد إليهم. { يُجَاهِدُونَ فِي سَبِيلِ اللَّهِ ْ} بأموالهم وأنفسهم، بأقوالهم وأفعالهم. { وَلَا يَخَافُونَ لَوْمَةَ لَائِمٍ ْ} بل يقدمون رضا ربهم والخوف من لومه على لوم المخلوقين، وهذا يدل على قوة هممهم وعزائمهم، فإن ضعيف القلب ضعيف الهمة، تنتقض عزيمته عند لوم اللائمين، وتفتر قوته عند عذل العاذلين. وفي قلوبهم تعبد لغير الله، بحسب ما فيها من مراعاة الخلق وتقديم رضاهم ولومهم على أمر الله، فلا يسلم القلب من التعبد لغير الله، حتى لا يخاف في الله لومة لائم. ولما مدحهم تعالى بما من به عليهم منَّ الصفات الجليلة والمناقب العالية، المستلزمة لما لم يذكر من أفعال الخير -أخبر أن هذا من فضله عليهم وإحسانه لئلا يعجبوا بأنفسهم، وليشكروا الذي مَنَّ عليهم بذلك ليزيدهم من فضله، وليعلم غيرُهم أن فضل الله تعالى ليس عليه حجاب، فقال: { ذَلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَن يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ ْ} أي: واسع الفضل والإحسان، جزيل المنن، قد عمت رحمته كل شيء، ويوسع على أوليائه من فضله، ما لا يكون لغيرهم، ولكنه عليم بمن يستحق الفضل فيعطيه، فالله أعلم حيث يجعل رسالته أصلا وفرعا.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَن يَرۡتَدَّ مِنكُمۡ عَن دِينِهِۦ فَسَوۡفَ يَأۡتِي ٱللَّهُ بِقَوۡمٖ يُحِبُّهُمۡ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلۡمُؤۡمِنِينَ أَعِزَّةٍ عَلَى ٱلۡكَٰفِرِينَ يُجَٰهِدُونَ فِي سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوۡمَةَ لَآئِمٖۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ ٤٥"
    },
    {
      "number": 724,
      "text": "إِنَّمَا وَلِيُّكُمُ اللَّهُ وَرَسُولُهُ وَالَّذِينَ آمَنُوا الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ رَاكِعُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 55,
      "juz": 6,
      "manzil": 2,
      "page": 117,
      "ruku": 93,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُواْ ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُمۡ رَٰكِعُونَ ٥٥\n                                    \n                                    \n                                    وقوله : ( إنما وليكم الله ورسوله والذين آمنوا ) أي : ليس اليهود بأوليائكم ، بل ولايتكم راجعة إلى الله ورسوله والمؤمنين .\nوقوله : ( الذين يقيمون الصلاة ويؤتون الزكاة [ وهم راكعون ] ) أي : المؤمنون المتصفون بهذه الصفات ، من إقام الصلاة التي هي أكبر أركان الإسلام ، وهي له وحده لا شريك له ، وإيتاء الزكاة التي هي حق المخلوقين ومساعدة للمحتاجين من الضعفاء والمساكين .\nوأما قوله ( وهم راكعون ) فقد توهم بعضهم أن هذه الجملة في موضع الحال من قوله : ( ويؤتون الزكاة ) أي : في حال ركوعهم ، ولو كان هذا كذلك ، لكان دفع الزكاة في حال الركوع أفضل من غيره ; لأنه ممدوح ، وليس الأمر كذلك عند أحد من العلماء ممن نعلمه من أئمة الفتوى ، وحتى إن بعضهم ذكر في هذا أثرا عن علي بن أبي طالب : أن هذه الآية نزلت فيه : [ ذلك ] أنه مر به سائل في حال ركوعه ، فأعطاه خاتمه .\nوقال ابن أبي حاتم : حدثنا الربيع بن سليمان المرادي ، حدثنا أيوب بن سويد ، عن عتبة بن أبي حكيم في قوله : ( إنما وليكم الله ورسوله والذين آمنوا ) قال : هم المؤمنون وعلي بن أبي طالب .\nوحدثنا أبو سعيد الأشج ، حدثنا الفضل بن دكين أبو نعيم الأحول ، حدثنا موسى بن قيس الحضرمي عن سلمة بن كهيل قال : تصدق علي بخاتمه وهو راكع ، فنزلت : ( إنما وليكم الله ورسوله والذين آمنوا الذين يقيمون الصلاة ويؤتون الزكاة وهم راكعون ) .\nوقال ابن جرير : حدثني الحارث ، حدثنا عبد العزيز ، حدثنا غالب بن عبيد الله سمعت مجاهدا يقول في قوله : ( إنما وليكم الله ورسوله ) الآية : نزلت في علي بن أبي طالب تصدق وهو راكع\nوقال عبد الرزاق : حدثنا عبد الوهاب بن مجاهد عن أبيه ، عن ابن عباس في قوله : ( إنما وليكم الله ورسوله ) الآية : نزلت في علي بن أبي طالب .\nعبد الوهاب بن مجاهد لا يحتج به .\nورواه ابن مردويه من طريق سفيان الثوري ، عن أبي سنان ، عن الضحاك عن ابن عباس قال : كان علي بن أبي طالب قائما يصلي ، فمر سائل وهو راكع ، فأعطاه خاتمه ، فنزلت : ( إنما وليكم الله ورسوله ) الآية .\nالضحاك لم يلق ابن عباس .\nوروى ابن مردويه أيضا عن طريق محمد بن السائب الكلبي - وهو متروك - عن أبي صالح عن ابن عباس قال : خرج رسول الله صلى الله عليه وسلم إلى المسجد ، والناس يصلون ، بين راكع وساجد وقائم وقاعد ، وإذا مسكين يسأل ، فدخل رسول الله صلى الله عليه وسلم فقال : \" أعطاك أحد شيئا؟ \" قال : نعم . قال : \" من؟ \" قال : ذلك الرجل القائم . قال : \" على أي حال أعطاكه؟ \" قال : وهو راكع ، قال : \" وذلك علي بن أبي طالب \" . قال : فكبر رسول الله صلى الله عليه وسلم عند ذلك ، وهو يقول : ( ومن يتول الله ورسوله والذين آمنوا فإن حزب الله هم الغالبون )\nوهذا إسناد لا يفرح به .\nثم رواه ابن مردويه من حديث علي بن أبي طالب رضي الله عنه نفسه وعمار بن ياسر وأبي رافع . وليس يصح شيء منها بالكلية ، لضعف أسانيدها وجهالة رجالها . ثم روى بسنده ، عن ميمون بن مهران ، عن ابن عباس في قوله : ( إنما وليكم الله ورسوله ) نزلت في المؤمنين وعلي بن أبي طالب أولهم .\nوقال ابن جرير : حدثنا هناد ، حدثنا عبدة ، عن عبد الملك ، عن أبي جعفر قال : سألته عن هذه [ الآية ] ( إنما وليكم الله ورسوله والذين آمنوا الذين يقيمون الصلاة ويؤتون الزكاة وهم راكعون ) قلنا : من الذين آمنوا؟ قال : الذين آمنوا! قلنا : بلغنا أنها نزلت في علي بن أبي طالب ! قال : علي من الذين آمنوا .\nوقال أسباط ، عن السدي : نزلت هذه الآية في جميع المؤمنين ، ولكن علي بن أبي طالب مر به سائل وهو راكع في المسجد فأعطاه خاتمه .\nوقال علي بن أبي طلحة الوالبي عن ابن عباس : من أسلم فقد تولى الله ورسوله والذين آمنوا . رواه ابن جرير .\nوقد تقدم في الأحاديث التي أوردنا أن هذه الآيات كلها نزلت في عبادة بن الصامت رضي الله عنه ، حين تبرأ من حلف يهود ، ورضي بولاية الله ورسوله والمؤمنين ; ولهذا قال تعالى بعد هذا كله : ( ومن يتول الله ورسوله والذين آمنوا فإن حزب الله هم الغالبون ) كما قال تعالى : ( كتب الله لأغلبن أنا ورسلي إن الله قوي عزيز لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله ولو كانوا آباءهم أو أبناءهم أو إخوانهم أو عشيرتهم أولئك كتب في قلوبهم الإيمان وأيدهم بروح منه ويدخلهم جنات تجري من تحتها الأنهار خالدين فيها رضي الله عنهم ورضوا عنه أولئك حزب الله ألا إن حزب الله هم المفلحون ) [ المجادلة : 21 ، 22 ] .\n                                    ",
        "qortoby": "إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُواْ ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُمۡ رَٰكِعُونَ ٥٥\n                                    \n                                    \n                                    قوله تعالى : إنما وليكم الله ورسوله والذين آمنوا الذين يقيمون الصلاة ويؤتون الزكاة وهم راكعون\nفيه مسألتان :\nالأولى : قوله تعالى : إنما وليكم الله ورسوله قال جابر بن عبد الله قال عبد الله بن سلام للنبي صلى الله عليه وسلم : إن قومنا من قريظة والنضير قد هجرونا وأقسموا ألا يجالسونا ، ولا نستطيع مجالسة أصحابك لبعد المنازل ، فنزلت هذه الآية ، فقال : رضينا بالله وبرسوله وبالمؤمنين أولياء . و ( الذين ) عام في جميع المؤمنين ، وقد سئل أبو جعفر محمد بن علي بن الحسين بن علي بن أبي طالب رضي الله عنهم عن معنى إنما وليكم الله ورسوله والذين آمنوا هل هو علي بن أبي طالب ؟ فقال : علي من المؤمنين ; يذهب إلى أن هذا لجميع المؤمنين . قال النحاس : وهذا قول بين ; لأن الذين لجماعة ، وقال ابن عباس : نزلت في أبي بكر رضي الله عنه ، وقال في رواية أخرى : نزلت في علي بن أبي طالب رضي الله عنه ; وقاله مجاهد والسدي ، وحملهم على ذلك قوله تعالى : الذين يقيمون الصلاة ويؤتون الزكاة وهم راكعون وهي :\nالمسألة الثانية : وذلك أن سائلا سأل في مسجد رسول الله صلى الله عليه وسلم فلم يعطه أحد شيئا ، وكان علي في الصلاة في الركوع وفي يمينه خاتم ، فأشار إلى السائل بيده حتى أخذه . قال إلكيا الطبري : وهذا يدل على أن العمل القليل لا يبطل الصلاة ; فإن التصدق بالخاتم في الركوع عمل جاء به في الصلاة ولم تبطل به الصلاة ، وقوله : ويؤتون الزكاة وهم راكعون يدل على أن صدقة التطوع تسمى زكاة . ; فإن عليا تصدق بخاتمه في الركوع ، وهو نظير قوله تعالى : وما آتيتم من زكاة تريدون وجه الله فأولئك هم المضعفون وقد انتظم الفرض والنفل ، فصار اسم الزكاة شاملا للفرض والنفل ، كاسم الصدقة وكاسم الصلاة ينتظم الأمرين .\nقلت : فالمراد على هذا بالزكاة التصدق بالخاتم ، وحمل لفظ الزكاة على التصدق بالخاتم فيه بعد ; لأن الزكاة لا تأتي إلا بلفظها المختص بها وهو الزكاة المفروضة على ما تقدم بيانه في أول سورة \" البقرة \" . وأيضا فإن قبله يقيمون الصلاة ومعنى يقيمون الصلاة يأتون بها في أوقاتها بجميع حقوقها ، والمراد صلاة الفرض . ثم قال : وهم راكعون أي النفل ، وقيل : أفرد الركوع بالذكر تشريفا ، وقيل : المؤمنون وقت نزول الآية كانوا بين متمم للصلاة وبين راكع ، وقال ابن خويز منداد قوله تعالى : ويؤتون الزكاة وهم راكعون تضمنت جواز العمل اليسير في الصلاة ; وذلك أن هذا خرج مخرج المدح ، وأقل ما في باب المدح أن يكون مباحا ; وقد روي أن علي بن أبي طالب رضي الله عنه أعطى السائل شيئا وهو في الصلاة ، وقد يجوز أن يكون هذه صلاة تطوع ، وذلك أنه مكروه في الفرض ، ويحتمل أن يكون المدح متوجها على اجتماع حالتين ; كأنه وصف من يعتقد وجوب الصلاة والزكاة ; فعبر عن الصلاة بالركوع ، وعن الاعتقاد للوجوب بالفعل ; كما تقول : المسلمون هم المصلون ، ولا تريد أنهم في تلك الحال مصلون ولا يوجه المدح حال الصلاة ; فإنما يريد من يفعل هذا الفعل ويعتقده .\n                                    ",
        "saadi": "إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُواْ ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُمۡ رَٰكِعُونَ ٥٥\n                                        \n                                        \n                                        \n                                        لما نهى عن ولاية الكفار من اليهود والنصارى وغيرهم، وذكر مآل توليهم أنه الخسران المبين، أخبر تعالى مَن يجب ويتعين توليه، وذكر فائدة ذلك ومصلحته فقال: { إِنَّمَا وَلِيُّكُمُ اللَّهُ وَرَسُولُهُ ْ} فولاية الله تدرك بالإيمان والتقوى. فكل من كان مؤمنا تقيا كان لله وليا، ومن كان وليا لله فهو ولي لرسوله، ومن تولى الله ورسوله كان تمام ذلك تولي من تولاه، وهم المؤمنون الذين قاموا بالإيمان ظاهرا وباطنا، وأخلصوا للمعبود، بإقامتهم الصلاة بشروطها وفروضها ومكملاتها، وأحسنوا للخلق، وبذلوا الزكاة من أموالهم لمستحقيها منهم. وقوله: { وَهُمْ رَاكِعُونَ ْ} أي: خاضعون لله ذليلون. فأداة الحصر في قوله { إِنَّمَا وَلِيُّكُمُ اللَّهُ وَرَسُولُهُ وَالَّذِينَ آمَنُوا ْ} تدل على أنه يجب قصر الولاية على المذكورين، والتبري من ولاية غيرهم.\n                                    "
      },
      "originalText": "إِنَّمَا وَلِيُّكُمُ ٱللَّهُ وَرَسُولُهُۥ وَٱلَّذِينَ ءَامَنُواْ ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُمۡ رَٰكِعُونَ ٥٥"
    },
    {
      "number": 725,
      "text": "وَمَنْ يَتَوَلَّ اللَّهَ وَرَسُولَهُ وَالَّذِينَ آمَنُوا فَإِنَّ حِزْبَ اللَّهِ هُمُ الْغَالِبُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 56,
      "juz": 6,
      "manzil": 2,
      "page": 117,
      "ruku": 93,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَن يَتَوَلَّ ٱللَّهَ وَرَسُولَهُۥ وَٱلَّذِينَ ءَامَنُواْ فَإِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡغَٰلِبُونَ ٦٥\n                                    \n                                    \n                                    فكل من رضي بولاية الله ورسوله والمؤمنين فهو مفلح في الدنيا والآخرة [ ومنصور في الدنيا والآخرة ] ; ولهذا قال [ الله ] تعالى في هذه الآية الكريمة : ( ومن يتول الله ورسوله والذين آمنوا فإن حزب الله هم الغالبون )\n                                    ",
        "qortoby": "وَمَن يَتَوَلَّ ٱللَّهَ وَرَسُولَهُۥ وَٱلَّذِينَ ءَامَنُواْ فَإِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡغَٰلِبُونَ ٦٥\n                                    \n                                    \n                                    قوله تعالى : ومن يتول الله ورسوله والذين آمنوا فإن حزب الله هم الغالبون\nقوله تعالى : ومن يتول الله ورسوله والذين آمنوا أي : من فوض أمره إلى الله ، وامتثل أمر رسوله ، ووالى المسلمين ، فهو من حزب الله ، وقيل : أي : ومن يتول القيام بطاعة الله ونصرة رسوله والمؤمنين . فإن حزب الله هم الغالبون قال الحسن : حزب الله جند الله ، وقال غيره : أنصار الله قال الشاعر :\nوكيف أضوى وبلال حزبي\nأي : ناصري ، والمؤمنون حزب الله ; فلا جرم غلبوا اليهود بالسبي والقتل والإجلاء وضرب الجزية ، والحزب الصنف من الناس ، وأصله من النائبة من قولهم : حزبه كذا أي : نابه ; فكأن المحتزبين مجتمعون كاجتماع أهل النائبة عليها . وحزب الرجل أصحابه ، والحزب الورد ; ومنه الحديث فمن فاته حزبه من الليل ، وقد حزبت القرآن ، والحزب الطائفة ، وتحزبوا اجتمعوا ، والأحزاب : الطوائف التي تجتمع على محاربة الأنبياء ، وحزبه أمر أي : أصابه .\n                                    ",
        "saadi": "وَمَن يَتَوَلَّ ٱللَّهَ وَرَسُولَهُۥ وَٱلَّذِينَ ءَامَنُواْ فَإِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡغَٰلِبُونَ ٦٥\n                                        \n                                        \n                                        \n                                        { وَمَن يَتَوَلَّ اللَّهَ وَرَسُولَهُ وَالَّذِينَ آمَنُوا فَإِنَّ حِزْبَ اللَّهِ هُمُ الْغَالِبُونَ ْ} أي: فإنه من الحزب المضافين إلى الله إضافة عبودية وولاية، وحزبه هم الغالبون الذين لهم العاقبة في الدنيا والآخرة، كما قال تعالى: { وَإِنَّ جُنْدَنَا لَهُمُ الْغَالِبُونَ ْ} وهذه بشارة عظيمة، لمن قام بأمر الله وصار من حزبه وجنده، أن له الغلبة، وإن أديل عليه في بعض الأحيان لحكمة يريدها الله تعالى، فآخر أمره الغلبة والانتصار، ومن أصدق من الله قيلا.\n                                    "
      },
      "originalText": "وَمَن يَتَوَلَّ ٱللَّهَ وَرَسُولَهُۥ وَٱلَّذِينَ ءَامَنُواْ فَإِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡغَٰلِبُونَ ٦٥"
    },
    {
      "number": 726,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الَّذِينَ اتَّخَذُوا دِينَكُمْ هُزُوًا وَلَعِبًا مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ وَالْكُفَّارَ أَوْلِيَاءَ ۚ وَاتَّقُوا اللَّهَ إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 57,
      "juz": 6,
      "manzil": 2,
      "page": 117,
      "ruku": 94,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلَّذِينَ ٱتَّخَذُواْ دِينَكُمۡ هُزُوٗا وَلَعِبٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَٱلۡكُفَّارَ أَوۡلِيَآءَۚ وَٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ ٧٥\n                                    \n                                    \n                                    وهذا تنفير من موالاة أعداء الإسلام وأهله ، من الكتابيين والمشركين ، الذين يتخذون أفضل ما يعمله العاملون ، وهي شرائع الإسلام المطهرة المحكمة المشتملة على كل خير دنيوي وأخروي ، يتخذونها ( هزوا ولعبا ) يستهزئون بها ( ولعبا ) يعتقدون أنها نوع من اللعب في نظرهم الفاسد ، وفكرهم البارد كما قال القائل :\nوكم من عائب قولا صحيحا وآفته من الفهم السقيم\nوقوله : ( من الذين أوتوا الكتاب من قبلكم والكفار ) \" من \" ههنا لبيان الجنس ، كقوله : ( فاجتنبوا الرجس من الأوثان ) [ الحج : 30 ] ، وقرأ بعضهم ( والكفار ) بالخفض عطفا ، وقرأ آخرون بالنصب على أنه معمول ( يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم ) تقديره : ولا الكفار أولياء ، أي : لا تتخذوا هؤلاء ولا هؤلاء أولياء .\nوالمراد بالكفار ههنا المشركون ، وكذا وقع في قراءة ابن مسعود فيها ، رواه ابن جرير : ( يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم والكفار أولياء ) .\nوقوله : ( واتقوا الله إن كنتم مؤمنين ) أي : اتقوا الله أن تتخذوا هؤلاء الأعداء لكم ولدينكم أولياء ( إن كنتم مؤمنين ) بشرع الله الذي اتخذه هؤلاء هزوا ولعبا ، كما قال تعالى : ( لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه وإلى الله المصير ) [ آل عمران : 28 ] .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلَّذِينَ ٱتَّخَذُواْ دِينَكُمۡ هُزُوٗا وَلَعِبٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَٱلۡكُفَّارَ أَوۡلِيَآءَۚ وَٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ ٧٥\n                                    \n                                    \n                                    يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم والكفار أولياء واتقوا الله إن كنتم مؤمنين\nفيه مسألتان :\nالأولى : روي عن ابن عباس رضي الله عنه أن قوما من اليهود والمشركين ضحكوا من المسلمين وقت سجودهم فأنزل الله تعالى : يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا إلى آخر الآيات . وتقدم معنى الهزؤ في \" البقرة \" . من الذين أوتوا الكتاب من قبلكم والكفار أولياء قرأه أبو عمرو والكسائي بالخفض بمعنى ومن الكفار . قال الكسائي : وفي حرف أبي رحمه الله \" ومن الكفار \" ، ومن هاهنا لبيان الجنس ; والنصب أوضح وأبين . قاله النحاس ، وقيل : هو معطوف على أقرب العاملين منه وهو قوله : من الذين أوتوا الكتاب فنهاهم الله أن يتخذوا اليهود والمشركين أولياء ، وأعلمهم أن الفريقين اتخذوا دين المؤمنين هزوا ولعبا ، ومن نصب عطف على الذين الأول في قوله : لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم والكفار أولياء أي : لا تتخذوا هؤلاء وهؤلاء أولياء ; فالموصوف بالهزؤ واللعب في هذه القراءة اليهود لا غير ، والمنهي عن اتخاذهم أولياء اليهود والمشركون ، وكلاهما في القراءة بالخفض موصوف بالهزؤ واللعب . قال مكي : ولولا اتفاق الجماعة على النصب لاخترت الخفض ، لقوته في الإعراب وفي المعنى والتفسير والقرب من المعطوف عليه . وقيل : المعنى لا تتخذوا المشركين والمنافقين أولياء ; بدليل قولهم : إنما نحن مستهزئون والمشركون كلهم كفار ، لكن يطلق في الغالب لفظ الكفار على المشركين ; فلهذا فصل ذكر أهل الكتاب من الكافرين .\nالثانية : قال ابن خويز منداد : هذه الآية مثل قوله تعالى : لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ، و لا تتخذوا بطانة من دونكم تضمنت المنع من التأييد والانتصار بالمشركين ونحو ذلك ، وروى جابر : أن النبي صلى الله عليه وسلم لما أراد الخروج إلى أحد جاءه قوم من اليهود فقالوا : نسير معك ; فقال عليه الصلاة والسلام : إنا لا نستعين على أمرنا بالمشركين وهذا هو الصحيح من مذهب الشافعي ، وأبو حنيفة جوز الانتصار بهم على المشركين للمسلمين ; وكتاب الله تعالى يدل على خلاف ما قالوه مع ما جاء من السنة في ذلك ، والله أعلم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلَّذِينَ ٱتَّخَذُواْ دِينَكُمۡ هُزُوٗا وَلَعِبٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَٱلۡكُفَّارَ أَوۡلِيَآءَۚ وَٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ ٧٥\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 57 و58 : ينهى عباده المؤمنين عن اتخاذ أهل الكتاب من اليهود والنصارى ومن سائر الكفار أولياء يحبونهم ويتولونهم، ويبدون لهم أسرار المؤمنين، ويعاونونهم على بعض أمورهم التي تضر الإسلام والمسلمين، وأن ما معهم من الإيمان يوجب عليهم ترك موالاتهم، ويحثهم على معاداتهم، وكذلك التزامهم لتقوى الله التي هي امتثال أوامره واجتناب زواجره مما تدعوهم إلى معاداتهم، وكذلك ما كان عليه المشركون والكفار المخالفون للمسلمين، من قدحهم في دين المسلمين، واتخاذهم إياه هزوا ولعبا، واحتقاره واستصغاره، خصوصا الصلاة التي هي أظهر شعائر المسلمين، وأجلُّ عباداتهم، إنهم إذا نادوا إليها اتخذوها هزوا ولعبا، وذلك لعدم عقلهم ولجهلهم العظيم، وإلا فلو كان لهم عقول لخضعوا لها، ولعلموا أنها أكبر من جميع الفضائل التي تتصف بها النفوس. فإذا علمتم -أيها المؤمنون- حال الكفار وشدة معاداتهم لكم ولدينكم، فمن لم يعادهم بعد هذا دل على أن الإسلام عنده رخيص، وأنه لا يبالي بمن قدح فيه أو قدح بالكفر والضلال، وأنه ليس عنده من المروءة والإنسانية شيء. فكيف تدعي لنفسك دينا قيما، وأنه الدين الحق وما سواه باطل، وترضى بموالاة من اتخذه هزوا ولعبا، وسخر به وبأهله، من أهل الجهل والحمق؟! وهذا فيه من التهييج على عداوتهم ما هو معلوم لكل من له أدنى مفهوم.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ ٱلَّذِينَ ٱتَّخَذُواْ دِينَكُمۡ هُزُوٗا وَلَعِبٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَٱلۡكُفَّارَ أَوۡلِيَآءَۚ وَٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ ٧٥"
    }
  ]
}