{
  "number": 118,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 727,
      "text": "وَإِذَا نَادَيْتُمْ إِلَى الصَّلَاةِ اتَّخَذُوهَا هُزُوًا وَلَعِبًا ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 58,
      "juz": 6,
      "manzil": 2,
      "page": 118,
      "ruku": 94,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا نَادَيۡتُمۡ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوٗا وَلَعِبٗاۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ ٨٥\n                                    \n                                    \n                                    وقوله [ تعالى ] ( وإذا ناديتم إلى الصلاة اتخذوها هزوا ولعبا ) أي : وكذلك إذا أذنتم داعين إلى الصلاة التي هي أفضل الأعمال لمن يعقل ويعلم من ذوي الألباب ( اتخذوها ) أيضا ( هزوا ولعبا ذلك بأنهم قوم لا يعقلون ) معاني عبادة الله وشرائعه ، وهذه صفات أتباع الشيطان الذي \" إذا سمع الأذان أدبر وله حصاص ، أي : ضراط حتى لا يسمع التأذين ، فإذا قضي التأذين أقبل ، فإذا ثوب بالصلاة أدبر ، فإذا قضي التثويب أقبل حتى يخطر بين المرء وقلبه ، فيقول : اذكر كذا ، اذكر كذا ، لما لم يكن يذكر ، حتى يظل الرجل إن يدري كم صلى ، فإذا وجد أحدكم ذلك ، فليسجد سجدتين قبل السلام \" . متفق عليه .\nوقال الزهري : قد ذكر الله [ تعالى ] التأذين في كتابه فقال : ( وإذا ناديتم إلى الصلاة اتخذوها هزوا ولعبا ذلك بأنهم قوم لا يعقلون ) رواه ابن أبي حاتم .\nوقال أسباط عن السدي في قوله : ( وإذا ناديتم إلى الصلاة اتخذوها هزوا ولعبا ) قال : كان رجل من النصارى بالمدينة إذا سمع المنادي ينادي : \" أشهد أن محمدا رسول الله \" قال : حرق الكاذب! فدخلت خادمة ليلة من الليالي بنار وهو نائم وأهله نيام ، فسقطت شرارة فأحرقت البيت ، فاحترق هو وأهله . رواه ابن جرير وابن أبي حاتم .\nوذكر محمد بن إسحاق بن يسار في السيرة : أن رسول الله صلى الله عليه وسلم دخل الكعبة عام الفتح ، ومعه بلال فأمره أن يؤذن وأبو سفيان بن حرب وعتاب بن أسيد والحارث بن هشام جلوس بفناء الكعبة ، فقال عتاب بن أسيد : لقد أكرم الله أسيدا ألا يكون سمع هذا فيسمع منه ما يغيظه . وقال الحارث بن هشام : أما والله لو أعلم أنه محق لاتبعته . فقال أبو سفيان : لا أقول شيئا لو تكلمت لأخبرت عني هذه الحصى . فخرج عليهم النبي صلى الله عليه وسلم فقال : \" قد علمت الذي قلتم \" ثم ذكر ذلك لهم ، فقال الحارث وعتاب : نشهد أنك رسول الله ، [ والله ] ما اطلع على هذا أحد كان معنا ، فنقول أخبرك .\nوقال الإمام أحمد : حدثنا روح بن عبادة ، حدثنا ابن جريج أخبرنا عبد العزيز بن عبد الملك بن أبي محذورة أن عبد الله بن محيريز أخبره - وكان يتيما في حجر أبي محذورة - قال : قلت لأبي محذورة : يا عم ، إني خارج إلى الشام وأخشى أن أسأل عن تأذينك . فأخبرني أن أبا محذورة قال له : نعم خرجت في نفر ، وكنا ببعض طريق حنين ، مقفل رسول الله صلى الله عليه وسلم من حنين ، فلقينا رسول الله صلى الله عليه وسلم ببعض الطريق ، فأذن مؤذن رسول الله صلى الله عليه وسلم بالصلاة عند رسول الله صلى الله عليه وسلم ، فسمعنا صوت المؤذن ونحن متنكبون فصرخنا نحكيه ونستهزئ به ، فسمع رسول الله صلى الله عليه وسلم الصوت ، فأرسل إلينا إلى أن وقفنا بين يديه ، فقال رسول الله صلى الله عليه وسلم : \" أيكم الذي سمعت صوته قد ارتفع؟ \" فأشار القوم كلهم إلي ، وصدقوا ، فأرسل كلهم وحبسني . وقال \" قم فأذن بالصلاة \" . فقمت ولا شيء أكره إلي من رسول الله صلى الله عليه وسلم ، ولا مما يأمرني به فقمت بين يدي رسول الله صلى الله عليه وسلم ، فألقى علي رسول الله صلى الله عليه وسلم التأذين هو بنفسه ، قال : \" قل : الله أكبر ، الله أكبر ، أشهد أن لا إله إلا الله ، أشهد أن لا إله إلا الله ، أشهد أن محمدا رسول الله ، أشهد أن محمدا رسول الله ، \" ثم قال لي : \" ارجع فامدد من صوتك \" . ثم قال : أشهد أن لا إله إلا الله ، أشهد أن لا إله إلا الله ، أشهد أن محمدا رسول الله ، أشهد أن محمدا رسول الله ، حي على الصلاة ، حي على الصلاة ، حي على الفلاح ، حي على الفلاح ، الله أكبر ، الله أكبر ، لا إله إلا الله \" . ثم دعاني حين قضيت التأذين ، فأعطاني صرة فيها شيء من فضة ، ثم وضع يده على ناصية أبي محذورة ثم أمرها على وجهه ، ثم بين ثدييه ثم على كبده حتى بلغت يد رسول الله سرة أبي محذورة ثم قال رسول الله صلى الله عليه وسلم : \" بارك الله فيك وبارك عليك \" . فقلت : يا رسول الله ، مرني بالتأذين بمكة . فقال قد \" أمرتك به \" . وذهب كل شيء كان لرسول الله صلى الله عليه وسلم من كراهة ، وعاد ذلك كله محبة لرسول الله صلى الله عليه وسلم . فقدمت على عتاب بن أسيد عامل رسول الله صلى الله عليه وسلم بمكة فأذنت معه بالصلاة عن أمر رسول الله صلى الله عليه وسلم وأخبرني ذلك من أدركت من أهلي ممن أدرك أبا محذورة على نحو ما أخبرني عبد الله بن محيريز .\nهكذا رواه الإمام أحمد وقد أخرجه مسلم في صحيحه ، وأهل السنن الأربعة من طريق عن عبد الله بن محيريز ، عن أبي محذورة - واسمه سمرة بن معير بن لوذان - أحد مؤذني رسول الله صلى الله عليه وسلم الأربعة ، وهو مؤذن أهل مكة وامتدت أيامه ، رضي الله عنه وأرضاه .\n                                    ",
        "qortoby": "وَإِذَا نَادَيۡتُمۡ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوٗا وَلَعِبٗاۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ ٨٥\n                                    \n                                    \n                                    قوله تعالى : وإذا ناديتم إلى الصلاة اتخذوها هزوا ولعبا ذلك بأنهم قوم لا يعقلون\nفيه اثنتا عشرة مسألة :\nالأولى : قال الكلبي : كان إذا أذن المؤذن وقام المسلمون إلى الصلاة قالت اليهود : قد قاموا لا قاموا ; وكانوا يضحكون إذا ركع المسلمون وسجدوا وقالوا في حق الأذان : لقد ابتدعت شيئا لم نسمع به فيما مضى من الأمم ، فمن أين لك صياح مثل صياح العير ؟ فما أقبحه من صوت ، وما أسمجه من أمر . وقيل : إنهم كانوا إذا أذن المؤذن للصلاة تضاحكوا فيما بينهم وتغامزوا على طريق السخف والمجون ; تجهيلا لأهلها ، وتنفيرا للناس عنها وعن الداعي إليها . وقيل : إنهم كانوا يرون المنادي إليها بمنزلة اللاعب الهازئ بفعلها ، جهلا منهم بمنزلتها ; فنزلت هذه الآية ، ونزل قوله سبحانه : ومن أحسن قولا ممن دعا إلى الله وعمل صالحا والنداء الدعاء برفع الصوت ، وقد يضم مثل الدعاء والرغاء ، وناداه مناداة ونداء أي : صاح به . وتنادوا أي : نادى بعضهم بعضا ، وتنادوا أي : جلسوا في النادي ، وناداه جالسه في النادي ، وليس في كتاب الله تعالى ذكر الأذان إلا في هذه الآية ، أما إنه ذكر في الجمعة على الاختصاص .\nالثانية : قال العلماء : ولم يكن الأذان بمكة قبل الهجرة ، وإنما كانوا ينادون \" الصلاة جامعة \" فلما هاجر النبي صلى الله عليه وسلم وصرفت القبلة إلى الكعبة أمر بالأذان ، وبقي \" الصلاة جامعة \" للأمر يعرض ، وكان النبي صلى الله عليه وسلم قد أهمه أمر الأذان حتى أريه عبد الله بن زيد ، وعمر بن الخطاب ، وأبو بكر الصديق رضي الله عنهم ، وقد كان النبي صلى الله عليه وسلم سمع الأذان ليلة الإسراء في السماء ، وأما رؤيا عبد الله بن زيد الخزرجي الأنصاري وعمر بن الخطاب رضي الله عنهما فمشهورة ; وأن عبد الله بن زيد أخبر النبي صلى الله عليه وسلم بذلك ليلا طرقه به ، وأن عمر رضي الله عنه قال : إذا أصبحت أخبرت النبي صلى الله عليه وسلم ; فأمر النبي صلى الله عليه وسلم بلالا فأذن بالصلاة أذان الناس اليوم ، وزاد بلال في الصبح \" الصلاة خير من النوم \" فأقرها رسول الله صلى الله عليه وسلم وليست فيما أري الأنصاري ; ذكره ابن سعد عن ابن عمر ، وذكر الدارقطني رحمه الله أن الصديق رضي الله عنه أري الأذان ، وأنه أخبر النبي صلى الله عليه وسلم بذلك ، وأن النبي صلى الله عليه وسلم أمر بلالا قبل أن يخبره الأنصاري ; ذكره في كتاب \" المديح \" له في حديث النبي صلى الله عليه وسلم عن أبي بكر الصديق وحديث أبي بكر عنه .\nالثالثة : واختلف العلماء في وجوب الأذان والإقامة ; فأما مالك وأصحابه فإن الأذان عندهم إنما يجب في المساجد للجماعات حيث يجتمع الناس ، وقد نص على ذلك مالك في موطئه ، واختلف المتأخرون من أصحابه على قولين : أحدهما : سنة مؤكدة واجبة على الكفاية في المصر وما جرى مجرى المصر من القرى . وقال بعضهم : هو فرض على الكفاية . وكذلك اختلف أصحاب الشافعي ، وحكى الطبري عن مالك قال : إن ترك أهل مصر الأذان عامدين أعادوا الصلاة ; قال أبو عمر : ولا أعلم اختلافا في وجوب الأذان جملة على أهل المصر ; لأن الأذان هو العلامة الدالة المفرقة بين دار الإسلام ودار الكفر ; وكان رسول الله صلى الله عليه وسلم إذا بعث سرية قال لهم : إذ سمعتم الأذان فأمسكوا وكفوا وإن لم تسمعوا الأذان فأغيروا - أو قال - فشنوا الغارة ، وفي صحيح مسلم قال : كان رسول الله صلى الله عليه وسلم يغير إذا طلع الفجر ، فإن سمع أذانا أمسك وإلا أغار الحديث وقال عطاء ومجاهد والأوزاعي وداود : الأذان فرض ، ولم يقولوا على الكفاية ، وقال الطبري : الأذان سنة وليس بواجب ، وذكر عن أشهب عن مالك : إن ترك الأذان مسافر عمدا فعليه إعادة الصلاة ، وكره الكوفيون أن يصلي المسافر بغير أذان ولا إقامة ; قالوا : وأما ساكن المصر فيستحب له أن يؤذن ويقيم ; فإن استجزأ بأذان الناس وإقامتهم أجزأه ، وقال الثوري : تجزئه الإقامة عن الأذان في السفر ، وإن شئت أذنت وأقمت ، وقال أحمد بن حنبل : يؤذن المسافر على حديث مالك بن الحويرث . وقال داود : الأذان واجب على كل مسافر في خاصته والإقامة ; لقول رسول الله صلى الله عليه وسلم لمالك بن الحويرث ولصاحبه : إذا كنتما في سفر فأذنا وأقيما وليؤمكما أكبركما خرجه البخاري وهو قول أهل الظاهر . قال ابن المنذر : ثبت أن رسول الله صلى الله عليه وسلم قال لمالك بن الحويرث ولابن عم له : إذا سافرتما فأذنا وأقيما وليؤمكما أكبركما . قال ابن المنذر : فالأذان والإقامة واجبان على كل جماعة في الحضر والسفر ; لأن النبي صلى الله عليه وسلم أمر بالأذان وأمره على الوجوب . قال أبو عمر : واتفق الشافعي وأبو حنيفة وأصحابهما والثوري وأحمد وإسحاق وأبو ثور والطبري على أن المسافر إذا ترك الأذان عامدا أو ناسيا أجزأته صلاته ; وكذلك لو ترك الإقامة عندهم ، وهم أشد كراهة لتركه الإقامة ، واحتج الشافعي في أن الأذان غير واجب وليس فرضا من فروض الصلاة بسقوط الأذان للواحد عند الجمع بعرفة والمزدلفة ، وتحصيل مذهب مالك في الأذان في السفر كالشافعي سواء .\nالرابعة : واتفق مالك والشافعي وأصحابهما على أن الأذان مثنى والإقامة مرة مرة ، إلا أن الشافعي يربع التكبير الأول ; وذلك محفوظ من روايات الثقات في حديث أبي محذورة ، وفي حديث عبد الله بن زيد ; قال : وهي زيادة يجب قبولها ، وزعم الشافعي أن أذان أهل مكة لم يزل في آل أبي محذورة كذلك إلى وقته وعصره . قال أصحابه : وكذلك هو الآن عندهم ; وما ذهب إليه مالك موجود أيضا في أحاديث صحاح في أذان أبي محذورة ، وفي أذان عبد الله بن زيد ، والعمل عندهم بالمدينة على ذلك في آل سعد القرظي إلى زمانهم ، واتفق مالك والشافعي على الترجيع في الأذان ; وذلك رجوع المؤذن إذا قال : \" أشهد أن لا إله إلا الله مرتين أشهد أن محمدا رسول الله مرتين \" رجع فمد من صوته جهده . ولا خلاف بين مالك والشافعي في الإقامة إلا قوله : \" قد قامت الصلاة \" فإن مالكا يقولها مرة ، والشافعي مرتين ; وأكثر العلماء على ما قال الشافعي ، وبه جاءت الآثار ، وقال أبو حنيفة وأصحابه والثوري والحسن بن حي : الأذان والإقامة جميعا مثنى مثنى ، والتكبير عندهم في أول الأذان وأول الإقامة \" الله أكبر \" أربع مرات ، ولا ترجيع عندهم في الأذان ; وحجتهم في ذلك حديث عبد الرحمن بن أبي ليلى قال : حدثنا أصحاب محمد صلى الله عليه وسلم أن عبد الله بن زيد جاء إلى النبي صلى الله عليه وسلم فقال : يا رسول الله ، رأيت في المنام كان رجلا قام وعليه بردان أخضران على جذم حائط فأذن مثنى وأقام مثنى وقعد بينهما قعدة ، فسمع بلال بذلك فقام وأذن مثنى وقعد قعدة وأقام مثنى ; رواه الأعمش وغيره عن عمرو بن مرة عن ابن أبي ليلى ، وهو قول جماعة التابعين والفقهاء بالعراق . قال أبو إسحاق السبيعي : كان أصحاب علي وعبد الله يشفعون الأذان والإقامة ; فهذا أذان الكوفيين ، متوارث عندهم به العمل قرنا بعد قرن أيضا ، كما يتوارث الحجازيون ; فأذانهم تربيع التكبير مثل المكيين . ثم الشهادة بأن لا إله إلا الله مرة واحدة ، وأشهد أن محمدا رسول الله مرة واحدة ، ثم حي على الصلاة مرة ، ثم حي على الفلاح مرة ، ثم يرجع المؤذن فيمد صوته ويقول : أشهد أن لا إله إلا الله - الأذان كله - مرتين مرتين إلى آخره . قال أبو عمر : ذهب أحمد بن حنبل وإسحاق بن راهويه وداود بن علي ومحمد بن جرير الطبري إلى إجازة القول بكل ما روي عن رسول الله صلى الله عليه وسلم ، وحملوه على الإباحة والتخيير ، قالوا : كل ذلك جائز ; لأنه قد ثبت عن رسول الله صلى الله عليه وسلم جميع ذلك ، وعمل به أصحابه ، فمن شاء قال : الله أكبر مرتين في أول الأذان ، ومن شاء قال ذلك أربعا ، ومن شاء رجع في أذانه ، ومن شاء لم يرجع ، ومن شاء ثنى الإقامة ، ومن شاء أفردها ، إلا قوله : \" قد قامت الصلاة \" فإن ذلك مرتان مرتان على كل حال ! ! .\nالخامسة : واختلفوا في التثويب لصلاة الصبح - وهو قول المؤذن : الصلاة خير من النوم - فقال مالك والثوري والليث : يقول المؤذن في صلاة الصبح - بعد قوله : حي على الفلاح مرتين - الصلاة خير من النوم مرتين ; وهو قول الشافعي بالعراق ، وقال بمصر : لا يقول ذلك ، وقال أبو حنيفة وأصحابه : يقوله بعد الفراغ من الأذان إن شاء ، وقد روي عنهم أن ذلك في نفس الأذان ; وعليه الناس في صلاة الفجر . قال أبو عمر روي عن النبي صلى الله عليه وسلم من حديث أبي محذورة أنه أمره أن يقول في أذان الصبح : ( الصلاة خير من النوم ) . وروي عنه أيضا ذلك من حديث عبد الله بن زيد ، وروي عن أنس أنه قال : من السنة أن يقال في الفجر \" الصلاة خير من النوم \" ، وروي عن ابن عمر أنه كان يقوله ; وأما قول مالك في \" الموطأ \" أنه بلغه أن المؤذن جاء إلى عمر بن الخطاب يؤذنه بصلاة الصبح فوجده نائما فقال : الصلاة خير من النوم ; فأمره عمر أن يجعلها في نداء الصبح فلا أعلم أن هذا روي عن عمر من جهة يحتج بها وتعلم صحتها ; وإنما فيه حديث هشام بن عروة عن رجل يقال له \" إسماعيل \" فاعرفه ; ذكر ابن أبي شيبة حدثنا عبدة بن سليمان عن هشام بن عروة عن رجل يقال له \" إسماعيل \" قال : جاء المؤذن يؤذن عمر بصلاة الصبح فقال : الصلاة خير من النوم \" فأعجب به عمر وقال للمؤذن : \" أقرها في أذانك \" . قال أبو عمر : والمعنى فيه عندي أنه قال له : نداء الصبح موضع القول بها لا هاهنا ، كأنه كره أن يكون منه نداء آخر عند باب الأمير كما أحدثه الأمراء بعد . قال أبو عمر : وإنما حملني على هذا التأويل وإن كان الظاهر من الخبر خلافه ; لأن التثويب في صلاة الصبح أشهر عند العلماء والعامة من أن يظن بعمر رضي الله عنه أنه جهل شيئا سنه رسول الله صلى الله عليه وسلم وأمر به مؤذنيه ، بالمدينة بلالا ، وبمكة أبا محذورة ; فهو محفوظ معروف في تأذين بلال ، وأذان أبي محذورة في صلاة الصبح للنبي صلى الله عليه وسلم ; مشهور عند العلماء . روى وكيع عن سفيان عن عمران بن مسلم عن سويد بن غفلة أنه أرسل إلى مؤذنه إذا بلغت \" حي على الفلاح \" فقل : الصلاة خير من النوم ; فإنه أذان بلال ; ومعلوم أن بلالا لم يؤذن قط لعمر ، ولا سمعه بعد رسول الله صلى الله عليه وسلم إلا مرة بالشام إذ دخلها .\nالسادسة : وأجمع أهل العلم على أن من السنة ألا يؤذن للصلاة إلا بعد دخول وقتها إلا الفجر ، فإنه يؤذن لها قبل طلوع الفجر في قول مالك والشافعي وأحمد وإسحاق وأبي ثور ; وحجتهم قول رسول الله صلى الله عليه وسلم : إن بلالا يؤذن بليل فكلوا واشربوا حتى ينادي ابن أم مكتوم . وقال أبو حنيفة والثوري ومحمد بن الحسن : لا يؤذن لصلاة الصبح حتى يدخل وقتها لقول رسول الله صلى الله عليه وسلم لمالك بن الحويرث وصاحبه : إذا حضرت الصلاة فأذنا ثم أقيما وليؤمكما أكبركما وقياسا على سائر الصلوات ، وقالت طائفة من أهل الحديث : إذا كان للمسجد مؤذنان أذن أحدهما قبل طلوع الفجر ، والآخر بعد طلوع الفجر .\nالسابعة : واختلفوا في المؤذن يؤذن ويقيم غيره ; فذهب مالك وأبو حنيفة وأصحابهما إلى أنه لا بأس بذلك ; لحديث محمد بن عبد الله بن زيد عن أبيه أن رسول الله صلى الله عليه وسلم أمره إذ رأى النداء في النوم أن يلقيه على بلال ; ثم أمر عبد الله بن زيد فأقام . وقال الثوري والليث والشافعي : من أذن فهو يقيم ; لحديث عبد الرحمن بن زياد بن أنعم عن زياد بن نعيم عن زياد بن الحارث الصدائي قال : أتيت رسول الله صلى الله عليه وسلم فلما كان أول الصبح أمرني فأذنت ، ثم قام إلى الصلاة فجاء بلال ليقيم . فقال رسول الله صلى الله عليه وسلم : إن أخا صداء أذن ومن أذن فهو يقيم . قال أبو عمر : عبد الرحمن بن زياد هو الإفريقي ، وأكثرهم يضعفونه ، وليس يروي هذا الحديث غيره ; والأول أحسن إسنادا إن شاء الله تعالى . وإن صح حديث الإفريقي فإن من أهل العلم من يوثقه ويثني عليه ; فالقول به أولى لأنه نص في موضع الخلاف ، وهو متأخر عن قصة عبد الله بن زيد مع بلال ، والآخر ; فالآخر من أمر رسول الله صلى الله عليه وسلم أولى أن يتبع ، ومع هذا فإني أستحب إذا كان المؤذن واحدا راتبا أن يتولى الإقامة ; فإن أقامها غيره فالصلاة ماضية بإجماع ، والحمد لله .\nالثامنة : وحكم المؤذن أن يترسل في أذانه ، ولا يطرب به كما يفعله اليوم كثير من الجهال ، بل وقد أخرجه كثير من الطغام والعوام عن حد الإطراب ; فيرجعون فيه الترجيعات ، ويكثرون فيه التقطيعات حتى لا يفهم ما يقول ، ولا بما به يصول . روى الدارقطني من حديث ابن جريج عن عطاء عن ابن عباس قال : كان لرسول الله صلى الله عليه وسلم مؤذن يطرب فقال رسول الله صلى الله عليه وسلم : إن الأذان سهل سمح فإن كان أذانك سهلا سمحا وإلا فلا تؤذن ، ويستقبل في أذانه القبلة عند جماعة العلماء ، ويلوي رأسه يمينا وشمالا في \" حي على الصلاة حي على الفلاح \" عند كثير من أهل العلم . قال أحمد : لا يدور إلا أن يكون في منارة يريد أن يسمع الناس ; وبه قال إسحاق ، والأفضل أن يكون متطهرا .\nالتاسعة : ويستحب لسامع الأذان أن يحكيه إلى آخر التشهدين وإن أتمه جاز ; لحديث أبي سعيد ; وفي صحيح مسلم عن عمر بن الخطاب قال : قال رسول الله صلى الله عليه وسلم : إذا قال المؤذن : الله أكبر الله أكبر فقال أحدكم الله أكبر الله أكبر ، ثم قال : أشهد أن لا إله إلا الله ، قال : أشهد أن لا إله إلا الله ثم قال : أشهد أن محمدا رسول الله قال : أشهد أن محمدا رسول الله ، ثم قال : حي على الصلاة قال : لا حول ولا قوة إلا بالله ، ثم قال : حي على الفلاح قال : لا حول ولا قوة إلا بالله ، ثم قال : الله أكبر الله أكبر قال : الله أكبر الله أكبر ، ثم قال : لا إله إلا الله قال : لا إله إلا الله من قلبه دخل الجنة ، وفيه عن سعد بن أبي وقاص عن رسول الله صلى الله عليه وسلم أنه قال : من قال حين يسمع المؤذن : أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله رضيت بالله ربا وبمحمد رسولا وبالإسلام دينا غفر له ما تقدم من ذنبه .\nالعاشرة : وأما فضل الأذان والمؤذن فقد جاءت فيه أيضا آثار صحاح ; منها ما رواه مسلم عن أبي هريرة أن النبي صلى الله عليه وسلم قال : إذا نودي للصلاة أدبر الشيطان له ضراط حتى لا يسمع التأذين الحديث . وحسبك أنه شعار الإسلام ، وعلم على الإيمان كما تقدم ، وأما المؤذن فروى مسلم عن معاوية قال : سمعت رسول الله صلى الله عليه وسلم يقول : المؤذنون أطول الناس أعناقا يوم القيامة ، وهذه إشارة إلى الأمن من هول ذلك اليوم . والله أعلم ، والعرب تكني بطول العنق عن أشراف القوم وساداتهم ; كما قال قائلهم :\nيشبهون ملوكا في تجلتهم طوال أنضية الأعناق واللمم\nوفي الموطأ عن أبي سعيد الخدري سمع رسول الله صلى الله عليه وسلم يقول : لا يسمع مدى صوت المؤذن جن ولا إنس ولا شيء إلا شهد له يوم القيامة ، وفي سنن ابن ماجه عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : من أذن محتسبا سبع سنين كتبت له براءة من النار وفيه عن ابن عمر أن رسول الله صلى الله عليه وسلم قال : من أذن ثنتي عشرة سنة وجبت له الجنة وكتب له بتأذينه في كل يوم ستون حسنة ولكل إقامة ثلاثون حسنة . قال أبو حاتم : هذا الإسناد منكر والحديث صحيح . وعن عثمان بن أبي العاص قال : كان آخر ما عهد إلي النبي صلى الله عليه وسلم : ( ألا أتخذ مؤذنا يأخذ على أذانه أجرا ) حديث ثابت .\nالحادية عشرة : واختلفوا في أخذ الأجرة على الأذان ; فكره ذلك القاسم بن عبد الرحمن وأصحاب الرأي ، ورخص فيه مالك ، وقال : لا بأس به ، وقال الأوزاعي : ذلك مكروه ، ولا بأس بأخذ الرزق على ذلك من بيت المال ، وقال الشافعي : لا يرزق المؤذن إلا من خمس الخمس سهم النبي صلى الله عليه وسلم . قال ابن المنذر : لا يجوز أخذ الأجرة على الأذان . وقد استدل علماؤنا بأخذ الأجرة بحديث أبي محذورة ، وفيه نظر ; أخرجه النسائي وابن ماجه وغيرهما قال : خرجت في نفر فكنا ببعض الطريق فأذن مؤذن رسول الله صلى الله عليه وسلم بالصلاة عند رسول الله صلى الله عليه وسلم ، فسمعنا صوت المؤذن ونحن عنه متنكبون فصرخنا نحكيه نهزأ به ; فسمع رسول الله صلى الله عليه وسلم فأرسل إلينا قوما فأقعدونا بين يديه فقال : أيكم الذي سمعت صوته قد ارتفع فأشار إلي القوم كلهم وصدقوا فأرسل كلهم وحبسني وقال لي : قم فأذن فقمت ولا شيء أكره إلي من أمر رسول الله صلى الله عليه وسلم ولا مما يأمرني به ، فقمت بين يدي رسول الله صلى الله عليه وسلم ، فألقى علي رسول الله صلى الله عليه وسلم التأذين هو بنفسه فقال : قل الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله ، ثم قال لي : ارفع فمد صوتك أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حي على الصلاة حي على الصلاة حي على الفلاح حي على الفلاح الله أكبر الله أكبر لا إله إلا الله ، ثم دعاني حين قضيت التأذين فأعطاني صرة فيها شيء من فضة ، قد وضع يده على ناصية أبي محذورة ثم أمرها على وجهه ، ثم على ثدييه ، ثم على كبده حتى بلغت يد رسول الله صلى الله عليه وسلم سرة أبي محذورة ; ثم قال رسول الله صلى الله عليه وسلم : بارك الله لك وبارك عليك ، فقلت : يا رسول الله مرني بالتأذين بمكة ، قال : قد أمرتك . فذهب كل شيء كان لرسول الله صلى الله عليه وسلم من كراهية ، وعاد ذلك كله محبة لرسول الله صلى الله عليه وسلم ; فقدمت على عتاب بن أسيد عامل رسول الله صلى الله عليه وسلم بمكة فأذنت معه بالصلاة عن أمر رسول الله صلى الله عليه وسلم ; لفظ ابن ماجه .\nالثانية عشرة : ذلك بأنهم قوم لا يعقلون أي : أنهم بمنزلة من لا عقل له يمنعه من القبائح . روي أن رجلا من النصارى وكان بالمدينة إذا سمع المؤذن يقول : \" أشهد أن محمدا رسول الله \" قال : حرق الكاذب ; فسقطت في بيته شرارة من نار وهو نائم فتعلقت بالبيت فأحرقته وأحرقت ذلك الكافر معه ; فكانت عبرة للخلق \" والبلاء موكل بالمنطق \" وقد كانوا يمهلون مع النبي صلى الله عليه وسلم حتى يستفتحوا ، فلا يؤخروا بعد ذلك ; ذكره ابن العربي .\n                                    ",
        "saadi": "وَإِذَا نَادَيۡتُمۡ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوٗا وَلَعِبٗاۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ ٨٥\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 57 و58 : ينهى عباده المؤمنين عن اتخاذ أهل الكتاب من اليهود والنصارى ومن سائر الكفار أولياء يحبونهم ويتولونهم، ويبدون لهم أسرار المؤمنين، ويعاونونهم على بعض أمورهم التي تضر الإسلام والمسلمين، وأن ما معهم من الإيمان يوجب عليهم ترك موالاتهم، ويحثهم على معاداتهم، وكذلك التزامهم لتقوى الله التي هي امتثال أوامره واجتناب زواجره مما تدعوهم إلى معاداتهم، وكذلك ما كان عليه المشركون والكفار المخالفون للمسلمين، من قدحهم في دين المسلمين، واتخاذهم إياه هزوا ولعبا، واحتقاره واستصغاره، خصوصا الصلاة التي هي أظهر شعائر المسلمين، وأجلُّ عباداتهم، إنهم إذا نادوا إليها اتخذوها هزوا ولعبا، وذلك لعدم عقلهم ولجهلهم العظيم، وإلا فلو كان لهم عقول لخضعوا لها، ولعلموا أنها أكبر من جميع الفضائل التي تتصف بها النفوس. فإذا علمتم -أيها المؤمنون- حال الكفار وشدة معاداتهم لكم ولدينكم، فمن لم يعادهم بعد هذا دل على أن الإسلام عنده رخيص، وأنه لا يبالي بمن قدح فيه أو قدح بالكفر والضلال، وأنه ليس عنده من المروءة والإنسانية شيء. فكيف تدعي لنفسك دينا قيما، وأنه الدين الحق وما سواه باطل، وترضى بموالاة من اتخذه هزوا ولعبا، وسخر به وبأهله، من أهل الجهل والحمق؟! وهذا فيه من التهييج على عداوتهم ما هو معلوم لكل من له أدنى مفهوم.\n                                    "
      },
      "originalText": "وَإِذَا نَادَيۡتُمۡ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوٗا وَلَعِبٗاۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ ٨٥"
    },
    {
      "number": 728,
      "text": "قُلْ يَا أَهْلَ الْكِتَابِ هَلْ تَنْقِمُونَ مِنَّا إِلَّا أَنْ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا وَمَا أُنْزِلَ مِنْ قَبْلُ وَأَنَّ أَكْثَرَكُمْ فَاسِقُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 59,
      "juz": 6,
      "manzil": 2,
      "page": 118,
      "ruku": 94,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ هَلۡ تَنقِمُونَ مِنَّآ إِلَّآ أَنۡ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ مِن قَبۡلُ وَأَنَّ أَكۡثَرَكُمۡ فَٰسِقُونَ ٩٥\n                                    \n                                    \n                                    يقول تعالى : قل يا محمد لهؤلاء الذين اتخذوا دينكم هزوا ولعبا من أهل الكتاب : ( هل تنقمون منا إلا أن آمنا بالله وما أنزل إلينا وما أنزل من قبل ) أي : هل لكم علينا مطعن أو عيب إلا هذا؟ وهذا ليس بعيب ولا مذمة ، فيكون الاستثناء منقطعا كما في قوله : ( وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد ) [ البروج : 8 ] وكقوله : ( وما نقموا إلا أن أغناهم الله ورسوله من فضله ) [ التوبة : 74 ] وفي الحديث المتفق عليه : \" ما ينقم ابن جميل إلا أن كان فقيرا فأغناه الله \" .\nوقوله : ( وأن أكثركم فاسقون ) معطوف على ( أن آمنا بالله وما أنزل إلينا وما أنزل من قبل ) أي : وآمنا بأن أكثركم فاسقون ، أي : خارجون عن الطريق المستقيم .\n\n                                    ",
        "qortoby": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ هَلۡ تَنقِمُونَ مِنَّآ إِلَّآ أَنۡ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ مِن قَبۡلُ وَأَنَّ أَكۡثَرَكُمۡ فَٰسِقُونَ ٩٥\n                                    \n                                    \n                                    قوله تعالى : قل يا أهل الكتاب هل تنقمون منا إلا أن آمنا بالله وما أنزل إلينا وما أنزل من قبل وأن أكثركم فاسقون\nقوله تعالى : قل يا أهل الكتاب هل تنقمون منا قال ابن عباس رضي الله عنه : جاء نفر من اليهود فيهم أبو ياسر بن أخطب ورافع بن أبي رافع - إلى النبي صلى الله عليه وسلم فسألوه عمن يؤمن به من الرسل عليهم السلام ; فقال : نؤمن بالله وما أنزل إلينا وما أنزل إلى إبراهيم وإسماعيل إلى قوله ونحن له مسلمون ، فلما ذكر عيسى عليه السلام جحدوا نبوته وقالوا : والله ما نعلم أهل دين أقل حظا في الدنيا والآخرة منكم ولا دينا شرا من دينكم ; فنزلت هذه الآية وما بعدها ، وهي متصلة بما سبقها من إنكارهم الأذان ; فهو جامع للشهادة لله بالتوحيد ، ولمحمد بالنبوة ، والمتناقض دين من فرق بين أنبياء الله لا دين من يؤمن بالكل ، ويجوز إدغام اللام في التاء لقربها منها . وتنقمون معناه تسخطون ، وقيل : تكرهون وقيل : تنكرون ، والمعنى متقارب ; يقال : نقم من كذا ينقم ونقم ينقم ، والأول أكثر قال عبد الله بن قيس الرقيات :\nما نقموا من بني أمية إلا أنهم يحلمون إن غضبوا\nوفي التنزيل وما نقموا منهم ويقال : نقمت على الرجل بالكسر فأنا ناقم إذا عتبت عليه ; يقال : ما نقمت عليه الإحسان . قال الكسائي : نقمت بالكسر لغة ، ونقمت الأمر أيضا ونقمته إذا كرهته ، وانتقم الله منه أي : عاقبه ، والاسم منه النقمة ، والجمع نقمات ونقم مثل كلمة وكلمات وكلم ، وإن شئت سكنت القاف ونقلت حركتها إلى النون فقلت : نقمة والجمع نقم ; مثل نعمة ونعم ، إلا أن آمنا بالله في موضع نصب ب تنقمون و تنقمون بمعنى تعيبون ، أي : هل تنقمون منا إلا إيماننا بالله وقد علمتم أنا على الحق . وأن أكثركم فاسقون أي : في ترككم الإيمان ، وخروجكم عن امتثال أمر الله فقيل هو مثل قول القائل : هل تنقم مني إلا أني عفيف وأنك فاجر ، وقيل : أي : لأن أكثركم فاسقون تنقمون منا ذلك .\n                                    ",
        "saadi": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ هَلۡ تَنقِمُونَ مِنَّآ إِلَّآ أَنۡ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ مِن قَبۡلُ وَأَنَّ أَكۡثَرَكُمۡ فَٰسِقُونَ ٩٥\n                                        \n                                        \n                                        \n                                        { قُلْ ْ} يا أيها الرسول { يَا أَهْلَ الْكِتَابِ ْ} ملزما لهم، إن دين الإسلام هو الدين الحق، وإن قدحهم فيه قدح بأمر ينبغي المدح عليه: { هَلْ تَنقِمُونَ مِنَّا إِلَّا أَنْ آمَنَّا بِاللَّهِ وَمَا أُنزِلَ إِلَيْنَا وَمَا أُنزِلَ مِن قَبْلُ وَأَنَّ أَكْثَرَكُمْ فَاسِقُونَ ْ} أي: هل لنا عندكم من العيب إلا إيماننا بالله، وبكتبه السابقة واللاحقة، وبأنبيائه المتقدمين والمتأخرين، وبأننا نجزم أن من لم يؤمن كهذا الإيمان فإنه كافر فاسق؟ فهل تنقمون منا بهذا الذي هو أوجب الواجبات على جميع المكلفين؟\" ومع هذا فأكثركم فاسقون، أي: خارجون عن طاعة الله، متجرئون على معاصيه، فأولى لكم -أيها الفاسقون- السكوت، فلو كان عيبكم وأنتم سالمون من الفسق، وهيهات ذلك - لكان الشر أخف من قدحكم فينا مع فسقكم.\n                                    "
      },
      "originalText": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ هَلۡ تَنقِمُونَ مِنَّآ إِلَّآ أَنۡ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ مِن قَبۡلُ وَأَنَّ أَكۡثَرَكُمۡ فَٰسِقُونَ ٩٥"
    },
    {
      "number": 729,
      "text": "قُلْ هَلْ أُنَبِّئُكُمْ بِشَرٍّ مِنْ ذَٰلِكَ مَثُوبَةً عِنْدَ اللَّهِ ۚ مَنْ لَعَنَهُ اللَّهُ وَغَضِبَ عَلَيْهِ وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيرَ وَعَبَدَ الطَّاغُوتَ ۚ أُولَٰئِكَ شَرٌّ مَكَانًا وَأَضَلُّ عَنْ سَوَاءِ السَّبِيلِ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 60,
      "juz": 6,
      "manzil": 2,
      "page": 118,
      "ruku": 94,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ هَلۡ أُنَبِّئُكُم بِشَرّٖ مِّن ذَٰلِكَ مَثُوبَةً عِندَ ٱللَّهِۚ مَن لَّعَنَهُ ٱللَّهُ وَغَضِبَ عَلَيۡهِ وَجَعَلَ مِنۡهُمُ ٱلۡقِرَدَةَ وَٱلۡخَنَازِيرَ وَعَبَدَ ٱلطَّٰغُوتَۚ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ عَن سَوَآءِ ٱلسَّبِيلِ ٠٦\n                                    \n                                    \n                                    ثم قال : ( قل هل أنبئكم بشر من ذلك مثوبة عند الله ) أي : هل أخبركم بشر جزاء عند الله يوم القيامة مما تظنونه بنا؟ وهم أنتم الذين هم متصفون بهذه الصفات القصيرة ، فقوله : ( من لعنه الله ) أي : أبعده من رحمته ( وغضب عليه ) أي : غضبا لا يرضى بعده أبدا ( وجعل منهم القردة والخنازير ) كما تقدم بيانه في سورة البقرة . وكما سيأتي إيضاحه في سورة الأعراف [ إن شاء الله تعالى ]\nوقد قال سفيان الثوري : عن علقمة بن مرثد ، عن المغيرة بن عبد الله ، عن المعرور بن سويد عن ابن مسعود قال : سئل رسول الله صلى الله عليه وسلم عن القردة والخنازير ، أهي مما مسخ الله [ تعالى ] ؟ فقال : إن الله لم يهلك قوما - أو قال : لم يمسخ قوما - فيجعل لهم نسلا ولا عقبا وإن القردة والخنازير كانت قبل ذلك \" .\nوقد رواه مسلم من حديث سفيان الثوري ومسعر كلاهما ، عن مغيرة بن عبد الله اليشكري به .\nوقال أبو داود الطيالسي : حدثنا داود بن أبي الفرات ، عن محمد بن زيد ، عن أبي الأعين العبدي عن أبي الأحوص ، عن ابن مسعود قال : سألنا رسول الله صلى الله عليه وسلم عن القردة والخنازير ، أهي من نسل اليهود؟ فقال : \" لا ، إن الله لم يلعن قوما فيمسخهم فكان لهم نسل ، ولكن هذا خلق كان ، فلما غضب الله على اليهود فمسخهم ، جعلهم مثلهم \" .\nورواه أحمد من حديث داود بن أبي الفرات به .\nوقال ابن مردويه : حدثنا عبد الباقي ، حدثنا أحمد بن صالح ، حدثنا الحسن بن محبوب ، حدثنا عبد العزيز بن المختار ، عن داود بن أبي هند ، عن عكرمة ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : \" الحيات مسخ الجن ، كما مسخت القردة والخنازير \" . هذا حديث غريب جدا .\nوقوله : ( وعبد الطاغوت ) وقرئ ( وعبد الطاغوت ) على أنه فعل ماض ، \" والطاغوت \" منصوب به ، أي : وجعل منهم من عبد الطاغوت . وقرئ : ( وعبد الطاغوت ) بالإضافة على أن المعنى : وجعل منهم خدم الطاغوت ، أي : خدامه وعبيده . وقرئ ( وعبد الطاغوت ) على أنه جمع الجمع : عبد وعبيد وعبد ، مثل ثمار وثمر . حكاها ابن جرير ، عن الأعمش . وحكي عن بريدة الأسلمي أنه كان يقرؤها : \" وعابد الطاغوت \" ، وعن أبي وابن مسعود : \" وعبدوا \" ، وحكى ابن جرير ، عن أبي جعفر القارئ أنه كان يقرؤها : ( وعبد الطاغوت ) على أنه مفعول ما لم يسم فاعله ، ثم استبعد معناها . والظاهر أنه لا بعد في ذلك ; لأن هذا من باب التعريض بهم ، أي : وقد عبدت الطاغوت فيكم ، وكنتم أنتم الذين تعاطوا ذلك .\nوكل هذه القراءات يرجع معناها إلى أنكم يا أهل الكتاب الطاعنين في ديننا ، والذي هو توحيد الله وإفراده بالعبادات دون [ ما ] سواه ، كيف يصدر منكم هذا وأنتم قد وجد منكم جميع ما ذكر؟ ولهذا قال : ( أولئك شر مكانا ) أي : مما تظنون بنا ( وأضل عن سواء السبيل )\nوهذا من باب استعمال أفعل التفضيل فيما ليس في الطرف الآخر مشاركة ، كقوله : ( أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا ) [ الفرقان : 24 ]\n                                    ",
        "qortoby": "قُلۡ هَلۡ أُنَبِّئُكُم بِشَرّٖ مِّن ذَٰلِكَ مَثُوبَةً عِندَ ٱللَّهِۚ مَن لَّعَنَهُ ٱللَّهُ وَغَضِبَ عَلَيۡهِ وَجَعَلَ مِنۡهُمُ ٱلۡقِرَدَةَ وَٱلۡخَنَازِيرَ وَعَبَدَ ٱلطَّٰغُوتَۚ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ عَن سَوَآءِ ٱلسَّبِيلِ ٠٦\n                                    \n                                    \n                                    قوله تعالى : قل هل أنبئكم بشر من ذلك أي : بشر من نقمكم علينا ، وقيل : بشر ما تريدون لنا من المكروه ; وهذا جواب قولهم : ما نعرف دينا شرا من دينكم . مثوبة نصب على البيان وأصلها مفعولة فألقيت حركة الواو على الثاء فسكنت الواو وبعدها واو ساكنة فحذفت إحداهما لذلك ; ومثله مقولة ومجوزة ومضوفة على معنى المصدر ; كما قال الشاعر :\nوكنت إذا جاري دعا لمضوفة أشمر حتى ينصف الساق مئزري\nوقيل : مفعلة كقولك مكرمة ومعقلة . من لعنه الله من في موضع رفع ; كما قال : بشر من ذلكم النار والتقدير هو لعن من لعنه الله ، ويجوز أن يكون في موضع نصب بمعنى : قل هل أنبئكم بشر من ذلك من لعنه الله ، ويجوز أن يكون في موضع خفض على البدل من ( شر ) والتقدير : هل أنبئكم بمن لعنه الله ; والمراد اليهود ، وقد تقدم القول في الطاغوت ، أي : وجعل منهم من عبد الطاغوت ، والموصول محذوف عند الفراء ، وقال البصريون : لا يجوز حذف الموصول ; والمعنى من لعنه الله وعبد الطاغوت .\nوقرأ ابن وثاب النخعي \" وأنبئكم \" بالتخفيف ، وقرأ حمزة : \" عبد الطاغوت \" بضم الباء وكسر التاء ; جعله اسما على فعل كعضد فهو بناء للمبالغة والكثرة كيقظ وندس وحذر ، وأصله الصفة ; ومنه قول النابغة :\nمن وحش وجرة موشي أكارعه طاوي المصير كسيف الصيقل الفرد\nبضم الراء ونصبه ب جعل ; أي : جعل منهم عبدا للطاغوت ، وأضاف عبد إلى الطاغوت فخفضه ، وجعل بمعنى خلق ، والمعنى وجعل منهم من يبالغ في عبادة الطاغوت . وقرأ الباقون بفتح الباء والتاء ; وجعلوه فعلا ماضيا ، وعطفوه على فعل ماض وهو غضب ولعن ; والمعنى عندهم من لعنه الله ومن عبد الطاغوت ، أو منصوبا ب جعل ; أي : جعل منهم القردة والخنازير وعبدة الطاغوت ، ووحد الضمير في عبد حملا على لفظ من دون معناها . وقرأ أبي وابن مسعود \" وعبدوا الطاغوت \" على المعنى . ابن عباس : \" وعبد الطاغوت \" ، فيجوز أن يكون جمع عبد كما يقال : رهن ورهن ، وسقف وسقف ، ويجوز أن يكون جمع عباد كما يقال : مثال ومثل ، ويجوز أن يكون جمع عبيد كرغيف ورغف ، ويجوز أن يكون جمع عادل كبازل وبزل ; والمعنى : وخدم الطاغوت ، وعن ابن عباس أيضا \" وعبد الطاغوت \" جعله جمع عابد كما يقال شاهد وشهد وغايب وغيب ، وعن أبي واقد : وعباد الطاغوت للمبالغة ، جمع عابد أيضا ; كعامل وعمال ، وضارب وضراب ، وذكر محبوب أن البصريين قرءوا : ( وعباد الطاغوت ) جمع عابد أيضا ، كقائم وقيام ، ويجوز أن يكون جمع عبد . وقرأ أبو جعفر الرؤاسي ( وعبد الطاغوت ) على المفعول ، والتقدير : وعبد الطاغوت فيهم ، وقرأ عون العقيلي وابن بريدة : ( وعابد الطاغوت ) على التوحيد ، وهو يؤدي عن جماعة ، وقرأ ابن مسعود أيضا ( وعبد الطاغوت ) وعنه أيضا وأبي ( وعبدت الطاغوت ) على تأنيث الجماعة ; كما قال تعالى : قالت الأعراب وقرأ عبيد بن عمير : ( وأعبد الطاغوت ) مثل كلب وأكلب . فهذه اثنا عشر وجها .\nقوله تعالى : أولئك شر مكانا لأن مكانهم النار ; وأما المؤمنون فلا شر في مكانهم ، وقال الزجاج : أولئك شر مكانا على قولكم . النحاس : ومن أحسن ما قيل فيه : أولئك الذين لعنهم الله شر مكانا في الآخرة من مكانكم في الدنيا لما لحقكم من الشر ، وقيل : أولئك الذين لعنهم الله شر مكانا من الذين نقموا عليكم ، وقيل : أولئك الذين نقموا عليكم شر مكانا من الذين لعنهم الله ، ولما نزلت هذه الآية قال المسلمون لهم : يا إخوة القردة والخنازير فنكسوا رءوسهم افتضاحا ، وفيهم يقول الشاعر :\nفلعنة الله على اليهود إن اليهود إخوة القرود\n                                    ",
        "saadi": "قُلۡ هَلۡ أُنَبِّئُكُم بِشَرّٖ مِّن ذَٰلِكَ مَثُوبَةً عِندَ ٱللَّهِۚ مَن لَّعَنَهُ ٱللَّهُ وَغَضِبَ عَلَيۡهِ وَجَعَلَ مِنۡهُمُ ٱلۡقِرَدَةَ وَٱلۡخَنَازِيرَ وَعَبَدَ ٱلطَّٰغُوتَۚ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ عَن سَوَآءِ ٱلسَّبِيلِ ٠٦\n                                        \n                                        \n                                        \n                                        ولما كان قدحهم في المؤمنين يقتضي أنهم يعتقدون أنهم على شر، قال تعالى: { قُلْ ْ} لهم مخبرا عن شناعة ما كانوا عليه: { هَلْ أُنَبِّئُكُم بِشَرٍّ مِن ذَلِكَ ْ} الذي نقمتم فيه علينا، مع التنزل معكم. { مَن لَّعَنَهُ اللَّهُ ْ} أي: أبعده عن رحمته { وَغَضِبَ عَلَيْهِ ْ} وعاقبه في الدنيا والآخرة { وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيرَ وَعَبَدَ الطَّاغُوتَ ْ} وهو الشيطان، وكل ما عبد من دون الله فهو طاغوت. { أُولَئِكَ ْ} المذكورون بهذه الخصال القبيحة { شَرٌّ مَّكَانًا ْ} من المؤمنين الذين رحمة الله قريب منهم، ورضي الله عنهم وأثابهم في الدنيا والآخرة، لأنهم أخلصوا له الدين. وهذا النوع من باب استعمال أفعل التفضيل في غير بابه وكذلك قوله: { وَأَضَلُّ عَن سَوَاءِ السَّبِيلِ ْ} أي: وأبعد عن قصد السبيل.\n                                    "
      },
      "originalText": "قُلۡ هَلۡ أُنَبِّئُكُم بِشَرّٖ مِّن ذَٰلِكَ مَثُوبَةً عِندَ ٱللَّهِۚ مَن لَّعَنَهُ ٱللَّهُ وَغَضِبَ عَلَيۡهِ وَجَعَلَ مِنۡهُمُ ٱلۡقِرَدَةَ وَٱلۡخَنَازِيرَ وَعَبَدَ ٱلطَّٰغُوتَۚ أُوْلَٰٓئِكَ شَرّٞ مَّكَانٗا وَأَضَلُّ عَن سَوَآءِ ٱلسَّبِيلِ ٠٦"
    },
    {
      "number": 730,
      "text": "وَإِذَا جَاءُوكُمْ قَالُوا آمَنَّا وَقَدْ دَخَلُوا بِالْكُفْرِ وَهُمْ قَدْ خَرَجُوا بِهِ ۚ وَاللَّهُ أَعْلَمُ بِمَا كَانُوا يَكْتُمُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 61,
      "juz": 6,
      "manzil": 2,
      "page": 118,
      "ruku": 94,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا جَآءُوكُمۡ قَالُوٓاْ ءَامَنَّا وَقَد دَّخَلُواْ بِٱلۡكُفۡرِ وَهُمۡ قَدۡ خَرَجُواْ بِهِۦۚ وَٱللَّهُ أَعۡلَمُ بِمَا كَانُواْ يَكۡتُمُونَ ١٦\n                                    \n                                    \n                                    وقوله : ( وإذا جاءوكم قالوا آمنا وقد دخلوا بالكفر وهم قد خرجوا به ) وهذه صفة المنافقين منهم ، أنهم يصانعون المؤمنين في الظاهر وقلوبهم منطوية على الكفر ; ولهذا قال : ( وقد دخلوا [ بالكفر وهم قد خرجوا به ] ) أي عندك يا محمد ( بالكفر ) أي : مستصحبين الكفر في قلوبهم ، ثم خرجوا وهو كامن فيها ، لم ينتفعوا بما قد سمعوا منك من العلم ، ولا نجعت فيهم المواعظ ولا الزواجر ; ولهذا قال : ( وهم [ قد ] خرجوا به ) فخصهم به دون غيرهم .\nوقوله : ( والله أعلم بما كانوا يكتمون ) أي : والله عالم بسرائرهم وما تنطوي عليهم ضمائرهم وإن أظهروا لخلقه خلاف ذلك ، وتزينوا بما ليس فيهم ، فإن عالم الغيب والشهادة أعلم بهم منهم ، وسيجزيهم على ذلك أتم الجزاء .\n                                    ",
        "qortoby": "وَإِذَا جَآءُوكُمۡ قَالُوٓاْ ءَامَنَّا وَقَد دَّخَلُواْ بِٱلۡكُفۡرِ وَهُمۡ قَدۡ خَرَجُواْ بِهِۦۚ وَٱللَّهُ أَعۡلَمُ بِمَا كَانُواْ يَكۡتُمُونَ ١٦\n                                    \n                                    \n                                    قوله تعالى : وإذا جاءوكم قالوا آمنا وقد دخلوا بالكفر وهم قد خرجوا به والله أعلم بما كانوا يكتمون\nقوله تعالى : وإذا جاءوكم قالوا آمنا هذه صفة المنافقين ، والمعنى أنهم لم ينتفعوا بشيء مما سمعوه ، بل دخلوا كافرين وخرجوا كافرين . والله أعلم بما كانوا يكتمون أي : من نفاقهم ، وقيل : المراد اليهود الذين قالوا : آمنوا بالذي أنزل على الذين آمنوا وجه النهار إذا دخلتم المدينة ، واكفروا آخره إذا رجعتم إلى بيوتكم ، يدل عليه ما قبله من ذكرهم وما يأتي .\n                                    ",
        "saadi": "وَإِذَا جَآءُوكُمۡ قَالُوٓاْ ءَامَنَّا وَقَد دَّخَلُواْ بِٱلۡكُفۡرِ وَهُمۡ قَدۡ خَرَجُواْ بِهِۦۚ وَٱللَّهُ أَعۡلَمُ بِمَا كَانُواْ يَكۡتُمُونَ ١٦\n                                        \n                                        \n                                        \n                                        { وَإِذَا جَاءُوكُمْ قَالُوا آمَنَّا ْ} نفاقا ومكرا { و ْ} هم { قد دَّخَلُوا ْ} مشتملين على الكفر { وَهُمْ قَدْ خَرَجُوا بِهِ ْ} فمدخلهم ومخرجهم بالكفر -وهم يزعمون أنهم مؤمنون، فهل أشر من هؤلاء وأقبح حالا منهم؟\" { وَاللَّهُ أَعْلَمُ بِمَا كَانُوا يَكْتُمُونَ ْ} فيجازيهم بأعمالهم خيرها وشرها.\n                                    "
      },
      "originalText": "وَإِذَا جَآءُوكُمۡ قَالُوٓاْ ءَامَنَّا وَقَد دَّخَلُواْ بِٱلۡكُفۡرِ وَهُمۡ قَدۡ خَرَجُواْ بِهِۦۚ وَٱللَّهُ أَعۡلَمُ بِمَا كَانُواْ يَكۡتُمُونَ ١٦"
    },
    {
      "number": 731,
      "text": "وَتَرَىٰ كَثِيرًا مِنْهُمْ يُسَارِعُونَ فِي الْإِثْمِ وَالْعُدْوَانِ وَأَكْلِهِمُ السُّحْتَ ۚ لَبِئْسَ مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 62,
      "juz": 6,
      "manzil": 2,
      "page": 118,
      "ruku": 94,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَتَرَىٰ كَثِيرٗا مِّنۡهُمۡ يُسَٰرِعُونَ فِي ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَعۡمَلُونَ ٢٦\n                                    \n                                    \n                                    وقوله : ( وترى كثيرا منهم يسارعون في الإثم والعدوان وأكلهم السحت ) أي : يبادرون إلى ذلك من تعاطي المآثم والمحارم والاعتداء على الناس ، وأكلهم أموالهم بالباطل ( لبئس ما كانوا يعملون ) أي : لبئس العمل كان عملهم وبئس الاعتداء اعتداؤهم .\n                                    ",
        "qortoby": "وَتَرَىٰ كَثِيرٗا مِّنۡهُمۡ يُسَٰرِعُونَ فِي ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَعۡمَلُونَ ٢٦\n                                    \n                                    \n                                    قوله تعالى : وترى كثيرا منهم يعني من اليهود . يسارعون في الإثم والعدوان أي : يسابقون في المعاصي والظلم وأكلهم السحت لبئس ما كانوا يعملون\n                                    ",
        "saadi": "وَتَرَىٰ كَثِيرٗا مِّنۡهُمۡ يُسَٰرِعُونَ فِي ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَعۡمَلُونَ ٢٦\n                                        \n                                        \n                                        \n                                        ثم استمر تعالى يعدد معايبهم، انتصارا لقدحهم في عباده المؤمنين، فقال: { وَتَرَى كَثِيرًا مِّنْهُمْ ْ} أي: من اليهود { يُسَارِعُونَ فِي الْإِثْمِ وَالْعُدْوَانِ ْ} أي: يحرصون، ويبادرون المعاصي المتعلقة في حق الخالق والعدوان على المخلوقين. { وَأَكْلِهِمُ السُّحْتَ ْ} الذي هو الحرام. فلم يكتف بمجرد الإخبار أنهم يفعلون ذلك، حتى أخبر أنهم يسارعون فيه، وهذا يدل على خبثهم وشرهم، وأن أنفسهم مجبولة على حب المعاصي والظلم. هذا وهم يدعون لأنفسهم المقامات العالية. { لَبِئْسَ مَا كَانُوا يَعْمَلُونَ ْ} وهذا في غاية الذم لهم والقدح فيهم.\n                                    "
      },
      "originalText": "وَتَرَىٰ كَثِيرٗا مِّنۡهُمۡ يُسَٰرِعُونَ فِي ٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَعۡمَلُونَ ٢٦"
    },
    {
      "number": 732,
      "text": "لَوْلَا يَنْهَاهُمُ الرَّبَّانِيُّونَ وَالْأَحْبَارُ عَنْ قَوْلِهِمُ الْإِثْمَ وَأَكْلِهِمُ السُّحْتَ ۚ لَبِئْسَ مَا كَانُوا يَصْنَعُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 63,
      "juz": 6,
      "manzil": 2,
      "page": 118,
      "ruku": 94,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَوۡلَا يَنۡهَىٰهُمُ ٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ عَن قَوۡلِهِمُ ٱلۡإِثۡمَ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَصۡنَعُونَ ٣٦\n                                    \n                                    \n                                    قوله : ( لولا ينهاهم الربانيون والأحبار عن قولهم الإثم وأكلهم السحت لبئس ما كانوا يصنعون ) يعني : هلا كان ينهاهم الربانيون والأحبار عن تعاطي ذلك . والربانيون وهم : العلماء العمال أرباب الولايات عليهم ، والأحبار : وهم العلماء فقط .\n( لبئس ما كانوا يصنعون ) وقال علي بن أبي طلحة ، عن ابن عباس : يعني الربانيين ، أنهم : بئس ما كانوا يصنعون . يعني : في تركهم ذلك .\nوقال عبد الرحمن بن زيد بن أسلم : قال لهؤلاء حين لم ينهوا ، ولهؤلاء حين علموا . قال : وذلك الأركان . قال : \" ويعملون \" و \" يصنعون \" واحد . رواه ابن أبي حاتم .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا ابن عطية ، حدثنا قيس ، عن العلاء بن المسيب ، عن خالد بن دينار عن ابن عباس قال : ما في القرآن آية أشد توبيخا من هذه الآية : ( لولا ينهاهم الربانيون والأحبار عن قولهم الإثم وأكلهم السحت لبئس ما كانوا يصنعون ) قال : كذا قرأ .\nوكذا قال الضحاك : ما في القرآن آية أخوف عندي منها : إنا لا ننهى . رواه ابن جرير .\nوقال ابن أبي حاتم : ذكره يونس بن حبيب ، حدثنا أبو داود ، حدثنا محمد بن مسلم ، عن أبي الوضاح ، حدثنا ثابت بن سعيد الهمداني قال : رأيته بالري فحدث عن يحيى بن يعمر قال : خطب علي بن أبي طالب فحمد الله وأثنى عليه ، ثم قال : أيها الناس ، إنما هلك من كان قبلكم بركوبهم المعاصي ، ولم ينههم الربانيون والأحبار ، فلما تمادوا في المعاصي ولم ينههم الربانيون والأحبار أخذتهم العقوبات . فمروا بالمعروف وانهوا عن المنكر ، قبل أن ينزل بكم مثل الذي نزل بهم ، واعلموا أن الأمر بالمعروف والنهي عن المنكر لا يقطع رزقا ولا يقرب أجلا .\nوقال الإمام أحمد : حدثنا يزيد بن هارون أنبأنا شريك ، عن أبي إسحاق ، عن المنذر بن جرير عن أبيه قال : قال رسول الله صلى الله عليه وسلم : \" ما من قوم يكون بين أظهرهم من يعمل بالمعاصي هم أعز منه وأمنع ، لم يغيروا ، إلا أصابهم الله منه بعذاب \" .\nتفرد به أحمد من هذا الوجه .\nورواه أبو داود ، عن مسدد ، عن أبي الأحوص ، عن أبي إسحاق ، عن المنذر بن جرير ، عن جرير قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" ما من رجل يكون في قوم يعمل فيهم بالمعاصي ، يقدرون أن يغيروا عليه ، فلا يغيرون إلا أصابهم الله بعقاب قبل أن يموتوا \" .\nوقد رواه ابن ماجه ، عن علي بن محمد ، عن وكيع ، عن إسرائيل ، عن أبي إسحاق ، عن عبيد الله بن جرير عن أبيه ، به .\nقال الحافظ المزي : وهكذا رواه شعبة ، عن إسحاق به .\n                                    ",
        "qortoby": "لَوۡلَا يَنۡهَىٰهُمُ ٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ عَن قَوۡلِهِمُ ٱلۡإِثۡمَ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَصۡنَعُونَ ٣٦\n                                    \n                                    \n                                    قوله تعالى : لولا ينهاهم الربانيون والأحبار لولا بمعنى فلا . ينهاهم يزجرهم . الربانيون علماء النصارى . والأحبار ) علماء اليهود قاله الحسن ، وقيل الكل في اليهود ; لأن هذه الآيات فيهم . ثم وبخ علماءهم في تركهم نهيهم فقال : لبئس ما كانوا يصنعون كما وبخ من يسارع في الإثم بقوله : لبئس ما كانوا يعملون ودلت الآية على أن تارك النهي عن المنكر كمرتكب المنكر ; فالآية توبيخ للعلماء في ترك الأمر بالمعروف والنهي عن المنكر ، وقد مضى القول في هذا المعنى في ( البقرة ) و ( آل عمران ) ، وروى سفيان بن عيينة قال : حدثني سفيان بن سعيد عن مسعر قال : بلغني أن ملكا أمر أن يخسف بقرية فقال : يا رب فيها فلان العابد فأوحى الله تعالى إليه : ( أن به فابدأ فإنه لم يتمعر وجهه في ساعة قط ) ، وفي صحيح الترمذي : ( إن الناس إذا رأوا الظالم ولم يأخذوا على يديه أوشك أن يعمهم الله بعقاب من عنده ) ، وسيأتي . والصنع بمعنى العمل إلا أنه يقتضي الجودة ; يقال : سيف صنيع إذا جود عمله .\n                                    ",
        "saadi": "لَوۡلَا يَنۡهَىٰهُمُ ٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ عَن قَوۡلِهِمُ ٱلۡإِثۡمَ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَصۡنَعُونَ ٣٦\n                                        \n                                        \n                                        \n                                        { لَوْلَا يَنْهَاهُمُ الرَّبَّانِيُّونَ وَالْأَحْبَارُ عَن قَوْلِهِمُ الْإِثْمَ وَأَكْلِهِمُ السُّحْتَ ْ} أي: هلا ينهاهم العلماء المتصدون لنفع الناس، الذين من الله عليهم بالعلم والحكمة -عن المعاصي التي تصدر منهم، ليزول ما عندهم من الجهل، وتقوم حجة الله عليهم، فإن العلماء عليهم أمر الناس ونهيهم، وأن يبينوا لهم الطريق الشرعي، ويرغبونهم في الخير ويرهبونهم من الشر { لَبِئْسَ مَا كَانُوا يَصْنَعُونَ ْ}\n                                    "
      },
      "originalText": "لَوۡلَا يَنۡهَىٰهُمُ ٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ عَن قَوۡلِهِمُ ٱلۡإِثۡمَ وَأَكۡلِهِمُ ٱلسُّحۡتَۚ لَبِئۡسَ مَا كَانُواْ يَصۡنَعُونَ ٣٦"
    },
    {
      "number": 733,
      "text": "وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَةٌ ۚ غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا ۘ بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنْفِقُ كَيْفَ يَشَاءُ ۚ وَلَيَزِيدَنَّ كَثِيرًا مِنْهُمْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ طُغْيَانًا وَكُفْرًا ۚ وَأَلْقَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ إِلَىٰ يَوْمِ الْقِيَامَةِ ۚ كُلَّمَا أَوْقَدُوا نَارًا لِلْحَرْبِ أَطْفَأَهَا اللَّهُ ۚ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا ۚ وَاللَّهُ لَا يُحِبُّ الْمُفْسِدِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 64,
      "juz": 6,
      "manzil": 2,
      "page": 118,
      "ruku": 94,
      "hizbQuarter": 47,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَتِ ٱلۡيَهُودُ يَدُ ٱللَّهِ مَغۡلُولَةٌۚ غُلَّتۡ أَيۡدِيهِمۡ وَلُعِنُواْ بِمَا قَالُواْۘ بَلۡ يَدَاهُ مَبۡسُوطَتَانِ يُنفِقُ كَيۡفَ يَشَآءُۚ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۚ وَأَلۡقَيۡنَا بَيۡنَهُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ كُلَّمَآ أَوۡقَدُواْ نَارٗا لِّلۡحَرۡبِ أَطۡفَأَهَا ٱللَّهُۚ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادٗاۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ ٤٦\n                                    \n                                    \n                                    يخبر تعالى عن اليهود - عليهم لعائن الله المتتابعة إلى يوم القيامة - بأنهم وصفوا الله عز وجل وتعالى عن قولهم علوا كبيرا ، بأنه بخيل . كما وصفوه بأنه فقير وهم أغنياء ، وعبروا عن البخل بقولهم : ( يد الله مغلولة )\nقال ابن أبي حاتم : حدثنا أبو عبد الله الطهراني ، حدثنا حفص بن عمر العدني ، حدثنا الحكم بن أبان ، عن عكرمة قال : قال ابن عباس : ( مغلولة ) أي : بخيلة .\nوقال علي بن أبي طلحة ، عن ابن عباس قوله : ( وقالت اليهود يد الله مغلولة ) قال : لا يعنون بذلك أن يد الله موثقة ولكن يقولون : بخيل أمسك ما عنده ، تعالى الله عما يقولون علوا كبيرا .\nوكذا روي عن عكرمة وقتادة والسدي ومجاهد والضحاك وقرأ : ( ولا تجعل يدك مغلولة إلى عنقك ولا تبسطها كل البسط فتقعد ملوما محسورا ) [ الإسراء : 29 ] . يعني : أنه ينهى عن البخل وعن التبذير ، وهو الزيادة في الإنفاق في غير محله ، وعبر عن البخل بقوله : ( ولا تجعل يدك مغلولة إلى عنقك ) .\nوهذا هو الذي أراد هؤلاء اليهود عليهم لعائن الله . وقد قال عكرمة : إنها نزلت في فنحاص اليهودي عليه لعنة الله . وقد تقدم أنه الذي قال : ( إن الله فقير ونحن أغنياء ) [ آل عمران : 181 ] فضربه أبو بكر الصديق رضي الله عنه .\nوقال محمد بن إسحاق : حدثني محمد بن أبي محمد ، عن سعيد أو عكرمة عن ابن عباس قال : قال رجل من اليهود يقال له : شاس بن قيس : إن ربك بخيل لا ينفق ، فأنزل الله : ( وقالت اليهود يد الله مغلولة غلت أيديهم ولعنوا بما قالوا بل يداه مبسوطتان ينفق كيف يشاء )\nوقد رد الله عز وجل عليهم ما قالوه ، وقابلهم فيما اختلقوه وافتروه وائتفكوه ، فقال : ( غلت أيديهم ولعنوا بما قالوا ) وهكذا وقع لهم ، فإن عندهم من البخل والحسد والجبن والذلة أمر عظيم ، كما قال تعالى : ( أم لهم نصيب من الملك فإذا لا يؤتون الناس نقيرا أم يحسدون الناس على ما آتاهم الله من فضله [ فقد آتينا آل إبراهيم الكتاب والحكمة وآتيناهم ملكا عظيما فمنهم من آمن به ومنهم من صد عنه وكفى بجهنم سعيرا ] ) [ النساء : 53 - 55 ] وقال تعالى : ( ضربت عليهم الذلة [ أين ما ثقفوا إلا بحبل من الله وحبل من الناس ] ) الآية [ آل عمران : 112 ] .\nثم قال تعالى : ( بل يداه مبسوطتان ينفق كيف يشاء ) أي : بل هو الواسع الفضل ، الجزيل العطاء ، الذي ما من شيء إلا عنده خزائنه ، وهو الذي ما بخلقه من نعمة فمنه وحده لا شريك له ، الذي خلق لنا كل شيء مما نحتاج إليه ، في ليلنا ونهارنا ، وحضرنا وسفرنا ، وفي جميع أحوالنا ، كما قال [ تعالى ] ( وآتاكم من كل ما سألتموه وإن تعدوا نعمة الله لا تحصوها إن الإنسان لظلوم كفار ) الآية [ إبراهيم : 34 ] . والآيات في هذا كثيرة ، وقد قال الإمام أحمد بن حنبل :\nحدثنا عبد الرزاق ، حدثنا معمر ، عن همام بن منبه قال : هذا ما حدثنا أبو هريرة قال : قال رسول الله صلى الله عليه وسلم : \" إن يمين الله ملأى لا يغيضها نفقة ، سحاء الليل والنهار ، أرأيتم ما أنفق منذ خلق السماوات والأرض ، فإنه لم يغض ما في يمينه \" قال : \" وعرشه على الماء ، وفي يده الأخرى القبض ، يرفع ويخفض \" : قال : قال الله تعالى : \" أنفق أنفق عليك \" أخرجاه في الصحيحين ، البخاري في \" التوحيد \" عن علي ابن المديني ، ومسلم فيه عن محمد بن رافع وكلاهما عن عبد الرزاق به .\nوقوله : ( وليزيدن كثيرا منهم ما أنزل إليك من ربك طغيانا وكفرا ) أي : يكون ما أتاك الله يا محمد من النعمة نقمة في حق أعدائك من اليهود وأشباههم ، فكما يزداد به المؤمنون تصديقا وعملا صالحا وعلما نافعا ، يزداد به الكفرة الحاسدون لك ولأمتك ) طغيانا ) وهو : المبالغة والمجاوزة للحد في الأشياء ) وكفرا ) أي : تكذيبا ، كما قال تعالى : ( قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى أولئك ينادون من مكان بعيد ) [ فصلت : 44 ] وقال تعالى : ( وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا ) [ الإسراء : 82 ] .\nوقوله : ( وألقينا بينهم العداوة والبغضاء إلى يوم القيامة ) يعني : أنه لا تجتمع قلوبهم ، بل العداوة واقعة بين فرقهم بعضهم في بعض دائما لأنهم لا يجتمعون على حق ، وقد خالفوك وكذبوك .\nوقال إبراهيم النخعي : ( وألقينا بينهم العداوة والبغضاء ) قال : الخصومات والجدال في الدين . رواه ابن أبي حاتم .\nوقوله : ( كلما أوقدوا نارا للحرب أطفأها الله ) أي : كلما عقدوا أسبابا يكيدونك بها ، وكلما أبرموا أمورا يحاربونك بها يبطلها الله ويرد كيدهم عليهم ، ويحيق مكرهم السيئ بهم .\n( ويسعون في الأرض فسادا والله لا يحب المفسدين ) أي : من سجيتهم أنهم دائما يسعون في الإفساد في الأرض ، والله لا يحب من هذه صفته .\n                                    ",
        "qortoby": "وَقَالَتِ ٱلۡيَهُودُ يَدُ ٱللَّهِ مَغۡلُولَةٌۚ غُلَّتۡ أَيۡدِيهِمۡ وَلُعِنُواْ بِمَا قَالُواْۘ بَلۡ يَدَاهُ مَبۡسُوطَتَانِ يُنفِقُ كَيۡفَ يَشَآءُۚ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۚ وَأَلۡقَيۡنَا بَيۡنَهُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ كُلَّمَآ أَوۡقَدُواْ نَارٗا لِّلۡحَرۡبِ أَطۡفَأَهَا ٱللَّهُۚ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادٗاۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ ٤٦\n                                    \n                                    \n                                    قوله : وقالت اليهود يد الله مغلولة غلت أيديهم ولعنوا بما قالوا بل يداه مبسوطتان ينفق كيف يشاء وليزيدن كثيرا منهم ما أنزل إليك من ربك طغيانا وكفرا وألقينا بينهم العداوة والبغضاء إلى يوم القيامة كلما أوقدوا نارا للحرب أطفأها الله ويسعون في الأرض فسادا والله لا يحب المفسدين\nقوله تعالى : وقالت اليهود يد الله مغلولة قال عكرمة : إنما قال هذا فنحاص بن عازوراء ، لعنه الله ، وأصحابه ، وكان لهم أموال فلما كفروا بمحمد صلى الله عليه وسلم قل مالهم ; فقالوا : إن الله بخيل ، ويد الله مقبوضة عنا في العطاء ; فالآية خاصة في بعضهم ، وقيل : لما قال قوم هذا ولم ينكر الباقون صاروا كأنهم بأجمعهم قالوا هذا ، وقال الحسن : المعنى يد الله مقبوضة عن عذابنا ، وقيل : إنهم لما رأوا النبي صلى الله عليه وسلم في فقر وقلة مال وسمعوا من ذا الذي يقرض الله قرضا حسنا ورأوا النبي صلى الله عليه وسلم قد كان يستعين بهم في الديات قالوا : إن إله محمد فقير ، وربما قالوا : بخيل ; وهذا معنى قولهم : يد الله مغلولة فهذا على التمثيل كقوله : ولا تجعل يدك مغلولة إلى عنقك ، ويقال للبخيل : جعد الأنامل ، ومقبوض الكف ، وكز الأصابع ، ومغلول اليد ; قال الشاعر :\nكانت خراسان أرضا إذ يزيد بها وكل باب من الخيرات مفتوح فاستبدلت بعده جعدا أنامله\nكأنما وجهه بالخل منضوح\nواليد في كلام العرب تكون للجارحة كقوله تعالى : وخذ بيدك ضغثا وهذا محال على الله تعالى ، وتكون للنعمة ; تقول العرب : كم يد لي عند فلان ، أي : كم من نعمة لي قد أسديتها له ، وتكون للقوة ; قال الله عز وجل : واذكر عبدنا داود ذا الأيد ، أي : ذا القوة وتكون للملك والقدرة ; قال الله تعالى : قل إن الفضل بيد الله يؤتيه من يشاء . وتكون بمعنى الصلة ، قال الله تعالى : مما عملت أيدينا أنعاما أي : مما عملنا نحن ، وقال : أو يعفو الذي بيده عقدة النكاح البقرة : 2 أي الذي له عقدة النكاح ، وتكون بمعنى التأييد والنصرة ، ومن قوله عليه السلام : يد الله مع القاضي حتى يقضي والقاسم حتى يقسم ، وتكون لإضافة الفعل إلى المخبر عنه تشريفا له وتكريما ; قال الله تعالى : يا إبليس ما منعك أن تسجد لما خلقت بيدي فلا يجوز أن يحمل على الجارحة ; لأن الباري جل وتعالى واحد لا يجوز عليه التبعيض ، ولا على القوة والملك والنعمة والصلة ، لأن الاشتراك يقع حينئذ . بين وليه آدم وعدوه إبليس ، ويبطل ما ذكر من تفضيله عليه ; لبطلان معنى التخصيص ، فلم يبق إلا أن تحمل على صفتين تعلقتا بخلق آدم تشريفا له دون خلق إبليس تعلق القدرة بالمقدور ، لا من طريق المباشرة ولا من حيث المماسة ; ومثله ما روي أنه عز اسمه وتعالى علاه وجده أنه كتب التوراة بيده ، وغرس دار الكرامة بيده لأهل الجنة ، وغير ذلك تعلق الصفة بمقتضاها .\nقوله تعالى : غلت أيديهم ولعنوا بما قالوا حذفت الضمة من الياء لثقلها ; أي : غلت في الآخرة ، ويجوز أن يكون دعاء عليهم ، وكذا ولعنوا بما قالوا والمقصود تعليمنا كما قال : لتدخلن المسجد الحرام إن شاء الله ; علمنا الاستثناء كما علمنا الدعاء على أبي لهب بقوله : تبت يدا أبي لهب وقيل : المراد أنهم أبخل الخلق ; فلا ترى يهوديا غير لئيم ، وفي الكلام على هذا القول إضمار الواو ; أي : قالوا : يد الله مغلولة وغلت أيديهم . واللعن الإبعاد ، وقد تقدم .\nقوله تعالى : بل يداه مبسوطتان ابتداء وخبر ; أي : بل نعمته مبسوطة ; فاليد بمعنى النعمة . قال بعضهم : هذا غلط ; لقوله : بل يداه مبسوطتان فنعم الله تعالى أكثر من أن تحصى فكيف تكون بل نعمتاه مبسوطتان ؟ وأجيب بأنه يجوز أن يكون هذا تثنية جنس لا تثنية واحد مفرد ; فيكون مثل قوله عليه السلام : مثل المنافق كالشاة العائرة بين الغنمين . فأحد الجنسين نعمة الدنيا ، والثاني نعمة الآخرة . وقيل : نعمتا الدنيا النعمة الظاهرة والنعمة الباطنة ; كما قال : وأسبغ عليكم نعمه ظاهرة وباطنة . وروى ابن عباس عن النبي صلى الله عليه وسلم ، أنه قال فيه : النعمة الظاهرة ما حسن من خلقك ، والباطنة ما ستر عليك من سيئ عملك ، وقيل : نعمتاه المطر والنبات اللتان النعمة بهما ومنهما . وقيل : إن النعمة للمبالغة ; كقول العرب : ( لبيك وسعديك ) وليس يريد الاقتصار على مرتين ; وقد يقول القائل : ما لي بهذا الأمر يد أي : قوة . قال السدي ; معنى قوله يداه قوتاه بالثواب والعقاب ، بخلاف ما قالت اليهود : إن يده مقبوضة عن عذابهم ، وفي صحيح مسلم عن أبي هريرة عن النبي صلى الله عليه وسلم قال : إن الله تعالى قال لي أنفق أنفق عليك ، وقال رسول الله صلى الله عليه وسلم : يمين الله ملأى لا يغيضها سحاء الليل والنهار أرأيتم ما أنفق مذ خلق السماوات والأرض فإنه لم يغض ما في يمينه - قال - وعرشه على الماء وبيده الأخرى القبض يرفع ويخفض . السح الصب الكثير ، ويغيض ينقص ; ونظير هذا الحديث قوله جل ذكره : والله يقبض ويبسط . وأما هذه الآية ففي قراءة ابن مسعود \" بل يداه بسطان \" حكاه الأخفش ، وقال يقال : يد بسطة ، أي : منطلقة منبسطة . ينفق كيف يشاء أي : يرزق كما يريد ، ويجوز أن تكون اليد في هذه الآية بمعنى القدرة ; أي : قدرته شاملة ، فإن شاء وسع وإن شاء قتر . وليزيدن كثيرا منهم لام قسم . ما أنزل إليك من ربك أي : بالذي أنزل إليك . طغيانا وكفرا أي : إذا نزل شيء من القرآن فكفروا ازداد كفرهم . وألقينا بينهم قال مجاهد : أي : بين اليهود والنصارى ; لأنه قال قبل هذا لا تتخذوا اليهود والنصارى أولياء ، وقيل : أي : ألقينا بين طوائف اليهود ، كما قال : تحسبهم جميعا وقلوبهم شتى فهم متباغضون غير متفقين ; فهم أبغض خلق الله إلى الناس . كلما أوقدوا نارا للحرب يريد اليهود . وكلما ظرف أي : كلما جمعوا وأعدوا شتت الله جمعهم ، وقيل : إن اليهود لما أفسدوا وخالفوا كتاب الله - التوراة - أرسل الله عليهم بختنصر ، ثم أفسدوا فأرسل عليهم بطرس الرومي ، ثم أفسدوا فأرسل عليهم المجوس ، ثم أفسدوا فبعث الله عليهم المسلمين ; فكانوا كلما استقام أمرهم شتتهم الله فكلما أوقدوا نارا أي : أهاجوا شرا ، وأجمعوا أمرهم على حرب النبي صلى الله عليه وسلم أطفأها الله وقهرهم ووهن أمرهم فذكر النار مستعار . قال قتادة : أذلهم الله عز وجل ; فلقد بعث الله النبي صلى الله عليه وسلم وهم تحت أيدي المجوس ، ثم قال جل وعز : ويسعون في الأرض فسادا أي : يسعون في إبطال الإسلام ، وذلك من أعظم الفساد ، والله أعلم وقيل : المراد بالنار هنا نار الغضب ، أي : كلما أوقدوا نار الغضب في أنفسهم وتجمعوا بأبدانهم وقوة النفوس منهم باحتدام نار الغضب أطفأها الله حتى يضعفوا ; وذلك بما جعله من الرعب نصرة بين يدي نبيه صلى الله عليه وسلم .\n                                    ",
        "saadi": "وَقَالَتِ ٱلۡيَهُودُ يَدُ ٱللَّهِ مَغۡلُولَةٌۚ غُلَّتۡ أَيۡدِيهِمۡ وَلُعِنُواْ بِمَا قَالُواْۘ بَلۡ يَدَاهُ مَبۡسُوطَتَانِ يُنفِقُ كَيۡفَ يَشَآءُۚ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۚ وَأَلۡقَيۡنَا بَيۡنَهُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ كُلَّمَآ أَوۡقَدُواْ نَارٗا لِّلۡحَرۡبِ أَطۡفَأَهَا ٱللَّهُۚ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادٗاۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ ٤٦\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن مقالة اليهود الشنيعة، وعقيدتهم الفظيعة، فقال: { وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَةٌ ْ} أي: عن الخير والإحسان والبر. { غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا ْ} وهذا دعاء عليهم بجنس مقالتهم. فإن كلامهم متضمن لوصف الله الكريم، بالبخل وعدم الإحسان. فجازاهم بأن كان هذا الوصف منطبقا عليهم. فكانوا أبخل الناس وأقلهم إحسانا، وأسوأهم ظنا بالله، وأبعدهم الله عن رحمته التي وسعت كل شيء، وملأت أقطار العالم العلوي والسفلي. ولهذا قال: { بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنْفِقُ كَيْفَ يَشَاءُ ْ} لا حجر عليه، ولا مانع يمنعه مما أراد، فإنه تعالى قد بسط فضله وإحسانه الديني والدنيوي، وأمر العباد أن يتعرضوا لنفحات جوده، وأن لا يسدوا على أنفسهم أبواب إحسانه بمعاصيهم. فيداه سحاء الليل والنهار، وخيره في جميع الأوقات مدرارا، يفرج كربا، ويزيل غما، ويغني فقيرا، ويفك أسيرا ويجبر كسيرا, ويجيب سائلا، ويعطي فقيرا عائلا، ويجيب المضطرين، ويستجيب للسائلين. وينعم على من لم يسأله، ويعافي من طلب العافية، ولا يحرم من خيره عاصيا، بل خيره يرتع فيه البر والفاجر، ويجود على أوليائه بالتوفيق لصالح الأعمال ثم يحمدهم عليها، ويضيفها إليهم، وهي من جوده ويثيبهم عليها من الثواب العاجل والآجل ما لا يدركه الوصف، ولا يخطر على بال العبد، ويلطف بهم في جميع أمورهم، ويوصل إليهم من الإحسان، ويدفع عنهم من النقم ما لا يشعرون بكثير منه، فسبحان من كل النعم التي بالعباد فمنه، وإليه يجأرون في دفع المكاره، وتبارك من لا يحصي أحد ثناء عليه, بل هو كما أثنى على نفسه، وتعالى من لا يخلو العباد من كرمه طرفة عين، بل لا وجود لهم ولا بقاء إلا بجوده. وقبَّح الله من استغنى بجهله عن ربه، ونسبه إلى ما لا يليق بجلاله، بل لو عامل الله اليهود القائلين تلك المقالة، ونحوهم ممن حاله كحالهم ببعض قولهم، لهلكوا، وشقوا في دنياهم، ولكنهم يقولون تلك الأقوال، وهو تعالى, يحلم عنهم، ويصفح، ويمهلهم ولا يهملهم. وقوله { وَلَيَزِيدَنَّ كَثِيرًا مِّنْهُم مَّا أُنْزِلَ إِلَيْكَ مِن رَّبِّكَ طُغْيَانًا وَكُفْرًا ْ} وهذا أعظم العقوبات على العبد، أن يكون الذكر الذي أنزله الله على رسوله، الذي فيه حياة القلب والروح، وسعادة الدنيا والآخرة, وفلاح الدارين، الذي هو أكبر منة امتن الله بها على عباده, توجب عليهم المبادرة إلى قبولها, والاستسلام لله بها, وشكرا لله عليها, أن تكون لمثل هذا زيادة غي إلى غيه، وطغيان إلى طغيانه، وكفر إلى كفره، وذلك بسبب إعراضه عنها، ورده لها، ومعاندته إياها، ومعارضته لها بالشبه الباطلة. { وَأَلْقَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ إِلَى يَوْمِ الْقِيَامَةِ ْ} فلا يتآلفون، ولا يتناصرون, ولا يتفقون على حالة فيها مصلحتهم، بل لم يزالوا متباغضين في قلوبهم, متعادين بأفعالهم, إلى يوم القيامة { كُلَّمَا أَوْقَدُوا نَارًا لِلْحَرْبِ ْ} ليكيدوا بها الإسلام وأهله، وأبدوا وأعادوا، وأجلبوا بخيلهم ورجلهم { أَطْفَأَهَا اللَّهُ ْ} بخذلانهم وتفرق جنودهم, وانتصار المسلمين عليهم. { وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا ْ} أي: يجتهدون ويجدون، ولكن بالفساد في الأرض، بعمل المعاصي، والدعوة إلى دينهم الباطل، والتعويق عن الدخول في الإسلام. { وَاللَّهُ لَا يُحِبُّ الْمُفْسِدِينَ ْ} بل يبغضهم أشد البغض، وسيجازيهم على ذلك.\n                                    "
      },
      "originalText": "وَقَالَتِ ٱلۡيَهُودُ يَدُ ٱللَّهِ مَغۡلُولَةٌۚ غُلَّتۡ أَيۡدِيهِمۡ وَلُعِنُواْ بِمَا قَالُواْۘ بَلۡ يَدَاهُ مَبۡسُوطَتَانِ يُنفِقُ كَيۡفَ يَشَآءُۚ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۚ وَأَلۡقَيۡنَا بَيۡنَهُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ كُلَّمَآ أَوۡقَدُواْ نَارٗا لِّلۡحَرۡبِ أَطۡفَأَهَا ٱللَّهُۚ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادٗاۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ ٤٦ "
    }
  ]
}