{
  "number": 123,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 759,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالْأَنْصَابُ وَالْأَزْلَامُ رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ فَاجْتَنِبُوهُ لَعَلَّكُمْ تُفْلِحُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 90,
      "juz": 7,
      "manzil": 2,
      "page": 123,
      "ruku": 97,
      "hizbQuarter": 49,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ فَٱجۡتَنِبُوهُ لَعَلَّكُمۡ تُفۡلِحُونَ ٠٩\n                                    \n                                    \n                                    يقول تعالى ناهيا عباده المؤمنين عن تعاطي الخمر والميسر ، وهو القمار .\nوقد ورد عن أمير المؤمنين علي بن أبي طالب أنه قال : الشطرنج من الميسر . رواه ابن أبي حاتم ، عن أبيه ، عن عبيس بن مرحوم ، عن حاتم ، عن جعفر بن محمد ، عن أبيه ، عن علي ، به .\nوقال ابن أبي حاتم : حدثنا محمد بن إسماعيل الأحمسي ، حدثنا وكيع ، عن سفيان ، عن ليث عن عطاء ومجاهد وطاوس - قال سفيان : أو اثنين منهم - قالوا : كل شيء من القمار فهو من الميسر ، حتى لعب الصبيان بالجوز .\nوروي عن راشد بن سعد وحمزة بن حبيب وقالا حتى الكعاب ، والجوز ، والبيض التي تلعب بها الصبيان ، وقال موسى بن عقبة ، عن نافع عن ابن عمر قال : الميسر هو القمار .\nوقال الضحاك عن ابن عباس قال : الميسر هو القمار ، كانوا يتقامرون في الجاهلية إلى مجيء الإسلام ، فنهاهم الله عن هذه الأخلاق القبيحة .\nوقال مالك عن داود بن الحصين : أنه سمع سعيد بن المسيب يقول : كان ميسر أهل الجاهلية بيع اللحم بالشاة والشاتين .\nوقال الزهري عن الأعرج قال : الميسر والضرب بالقداح على الأموال والثمار .\nوقال القاسم بن محمد : كل ما ألهى عن ذكر الله وعن الصلاة ، فهو من الميسر .\nرواهن ابن أبي حاتم .\nوقال ابن أبي حاتم : حدثنا أحمد بن منصور الرمادي ، حدثنا هشام بن عمار ، حدثنا صدقة ، حدثنا عثمان بن أبي العاتكة ، عن علي بن يزيد ، عن القاسم ، عن أبي أمامة ، عن أبي موسى الأشعري ، عن النبي صلى الله عليه وسلم قال : \" اجتنبوا هذه الكعاب الموسومة التي يزجر بها زجرا فإنها من الميسر \" . حديث غريب .\nوكأن المراد بهذا هو النرد ، الذي ورد في الحديث به في صحيح مسلم ، عن بريدة بن الحصيب الأسلمي قال : قال رسول الله صلى الله عليه وسلم : \" من لعب بالنردشير فكأنما صبغ يده في لحم خنزير ودمه \" . وفي موطأ مالك ومسند أحمد ، وسنن أبي داود وابن ماجه ، عن أبي موسى الأشعري قال : قال رسول الله صلى الله عليه وسلم : \" من لعب بالنرد فقد عصى الله ورسوله \" . وروي موقوفا عن أبي موسى من قوله ، فالله أعلم .\nوقال الإمام أحمد : حدثنا مكي بن إبراهيم ، حدثنا الجعيد ، عن موسى بن عبد الرحمن الخطمي ، أنه سمع محمد بن كعب وهو يسأل عبد الرحمن يقول : أخبرني ، ما سمعت أباك يقول عن رسول الله صلى الله عليه وسلم؟ فقال عبد الرحمن : سمعت أبي يقول : سمعت رسول الله صلى الله عليه وسلم يقول : \" مثل الذي يلعب بالنرد ، ثم يقوم فيصلي ، مثل الذي يتوضأ بالقيح ودم الخنزير ثم يقوم فيصلي \" .\nوأما الشطرنج فقد قال عبد الله بن عمر : إنه شر من النرد . وتقدم عن علي أنه قال : هو من الميسر ، ونص على تحريمه مالك وأبو حنيفة وأحمد ، وكرهه الشافعي ، رحمهم الله تعالى .\nوأما الأنصاب ، فقال ابن عباس ومجاهد وعطاء وسعيد بن جبير والحسن ، وغير واحد : هي حجارة كانوا يذبحون قرابينهم عندها .\nوأما الأزلام فقالوا أيضا : هي قداح كانوا يستقسمون بها .\nوقوله : ( رجس من عمل الشيطان ) قال علي بن أبي طلحة ، عن ابن عباس : أي سخط من عمل الشيطان . وقال سعيد بن جبير : إثم . وقال زيد بن أسلم : أي شر من عمل الشيطان .\n( فاجتنبوه ) الضمير عائد على الرجس ، أي اتركوه ( لعلكم تفلحون ) وهذا ترغيب .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ فَٱجۡتَنِبُوهُ لَعَلَّكُمۡ تُفۡلِحُونَ ٠٩\n                                    \n                                    \n                                    قوله : يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون\nفيه ثلاثة عشرة مسألة :\nالأولى : قوله تعالى : يا أيها الذين آمنوا خطاب لجميع المؤمنين بترك هذه الأشياء ; إذا كانت شهوات وعادات تلبسوا بها في الجاهلية وغلبت على النفوس ، فكان نفي منها في نفوس كثير من المؤمنين . قال ابن عطية : ومن هذا القبيل هوى الزجر بالطير ، وأخذ الفأل في الكتب ونحوه مما يصنعه الناس اليوم ، وأما الخمر فكانت لم تحرم بعد ، وإنما نزل تحريمها في سنة ثلاث بعد وقعة أحد ، وكانت وقعة أحد في شوال سنة ثلاث من الهجرة ، وتقدم اشتقاقها . وأما الميسر فقد مضى في \" البقرة \" القول فيه ، وأما الأنصاب فقيل : هي الأصنام . وقيل : هي النرد والشطرنج ; ويأتي بيانهما في سورة \" يونس \" عند قوله تعالى : فماذا بعد الحق إلا الضلال ، وأما الأزلام فهي القداح ، وقد مضى في أول السورة القول فيها . ويقال كانت في البيت عند سدنة البيت وخدام الأصنام ; يأتي الرجل إذا أراد حاجة فيقبض منها شيئا ; فإن كان عليه أمرني ربي خرج إلى حاجته على ما أحب أو كره .\nالثانية : تحريم الخمر كان بتدريج ونوازل كثيرة ; فإنهم كانوا مولعين بشربها ، وأول ما نزل في شأنها يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس أي : في تجارتهم ; فلما نزلت هذه الآية تركها بعض الناس وقالوا : لا حاجة لنا فيما فيه إثم كبير ، ولم يتركها بعض الناس وقالوا : نأخذ منفعتها ونترك إثمها فنزلت هذه الآية لا تقربوا الصلاة وأنتم سكارى فتركها بعض الناس وقالوا : لا حاجة لنا فيما يشغلنا عن الصلاة ، وشربها بعض الناس في غير أوقات الصلاة حتى نزلت : يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس الآية - فصارت حراما عليهم حتى صار يقول بعضهم : ما حرم الله شيئا أشد من الخمر ، وقال أبو ميسرة : نزلت بسبب عمر بن الخطاب ; فإنه ذكر للنبي صلى الله عليه وسلم عيوب الخمر ، وما ينزل بالناس من أجلها ، ودعا الله في تحريمها وقال : اللهم بين لنا في الخمر بيانا شافيا فنزلت هذه الآيات ، فقال عمر : انتهينا انتهينا ، وقد مضى في \" البقرة \" و \" النساء \" ، وروى أبو داود عن ابن عباس قال : يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى ، و يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس نسختها التي في المائدة . إنما الخمر والميسر والأنصاب ، وفي صحيح مسلم عن سعد بن أبي وقاص أنه قال : نزلت في آيات من القرآن ; وفيه قال : وأتيت على نفر من الأنصار ; فقالوا : تعال نطعمك ونسقيك خمرا ، وذلك قبل أن تحرم الخمر ; قال : فأتيتهم في حش - والحش البستان - فإذا رأس جزور مشوي عندهم وزق من خمر ; قال : فأكلت وشربت معهم ; قال : فذكرت الأنصار والمهاجرين عندهم فقلت : المهاجرون خير من الأنصار ; قال : فأخذ رجل لحيي جمل فضربني به فجرح أنفي - وفى رواية ففزره وكان أنف سعد مفزورا فأتيت رسول الله صلى الله عليه وسلم فأخبرته ; فأنزل الله تعالى في - يعني نفسه شأن الخمر - إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه .\nالثالثة : هذه الأحاديث تدل على أن شرب الخمر كان إذ ذاك مباحا معمولا به معروفا عندهم بحيث لا ينكر ولا يغير ، وأن النبي صلى الله عليه وسلم أقر عليه ، وهذا ما لا خلاف فيه ; يدل عليه آية النساء لا تقربوا الصلاة وأنتم سكارى على ما تقدم ، وهل كان يباح لهم شرب القدر الذي يسكر ؟ حديث حمزة ظاهر فيه حين بقر خواصر ناقتي علي رضي الله عنهما وجب أسنمتهما ، فأخبر علي بذلك النبي صلى الله عليه وسلم ، فجاء إلى حمزة فصدر عن حمزة للنبي صلى الله عليه وسلم من القول الجافي المخالف لما يجب عليه من احترام النبي صلى الله عليه وسلم وتوقيره وتعزيره ، ما يدل على أن حمزة كان قد ذهب عقله بما يسكر ; ولذلك قال الراوي : فعرف رسول الله صلى الله عليه وسلم أنه ثمل ; ثم إن النبي صلى الله عليه وسلم لم ينكر على حمزة ولا عنفه ، لا في حال سكره ولا بعد ذلك ، بل رجع لما قال حمزة : وهل أنتم إلا عبيد لأبي على عقبيه القهقرى وخرج عنه ، وهذا خلاف ما قاله الأصوليون وحكوه فإنهم قالوا : إن السكر حرام في كل شريعة ; لأن الشرائع مصالح العباد لا مفاسدهم ، وأصل المصالح العقل ، كما أن أصل المفاسد ذهابه ، فيجب المنع من كل ما يذهبه أو يشوشه ، إلا أنه يحتمل حديث حمزة أنه لم يقصد بشربه السكر لكنه أسرع فيه فغلبه ، والله أعلم .\nالرابعة : قوله تعالى : رجس قال ابن عباس في هذه الآية : رجس سخط ، وقد يقال للنتن والعذرة والأقذار رجس ، والرجز بالزاي العذاب لا غير ، والركس العذرة لا غير . والرجس يقال للأمرين ، ومعنى من عمل الشيطان أي : بحمله عليه وتزيينه . وقيل : هو الذي كان عمل مبادئ هذه الأمور بنفسه حتى اقتدي به فيها .\nالخامسة : قوله تعالى : فاجتنبوه يريد أبعدوه واجعلوه ناحية ; فأمر الله تعالى باجتناب هذه الأمور ، واقترنت بصيغة الأمر مع نصوص الأحاديث وإجماع الأمة ، فحصل الاجتناب في جهة التحريم ; فبهذا حرمت الخمر ، ولا خلاف بين علماء المسلمين أن سورة \" المائدة \" نزلت بتحريم الخمر ، وهي مدنية من آخر ما نزل ، وورد التحريم في الميتة والدم ولحم الخنزير في قوله تعالى : ( قل لا أجد ) وغيرها من الآي خبرا ، وفي الخمر نهيا وزجرا ، وهو أقوى التحريم وأوكده . روى ابن عباس قال : لما نزل تحريم الخمر ، مشى أصحاب رسول الله صلى الله عليه وسلم بعضهم إلى بعض ، وقالوا حرمت الخمر ، وجعلت عدلا للشرك ; يعني أنه قرنها بالذبح للأنصاب وذلك شرك . ثم علق لعلكم تفلحون فعلق الفلاح بالأمر ، وذلك يدل على تأكيد الوجوب . والله أعلم .\nالسادسة : فهم الجمهور من تحريم الخمر ، واستخباث الشرع لها ، وإطلاق الرجس عليها ، والأمر باجتنابها ، الحكم بنجاستها ، وخالفهم في ذلك ربيعة والليث بن سعد والمزني صاحب الشافعي ، وبعض المتأخرين من البغداديين والقرويين فرأوا أنها طاهرة ، وأن المحرم إنما هو شربها . وقد استدل سعيد بن الحداد القروي على طهارتها بسفكها في طرق المدينة ; قال : ولو كانت نجسة لما فعل ذلك الصحابة رضوان الله عليهم ، ولنهى رسول الله صلى الله عليه وسلم عنه كما نهى عن التخلي في الطرق ، والجواب ; أن الصحابة فعلت ذلك ; لأنه لم يكن لهم سروب ولا آبار يريقونها فيها ، إذ الغالب من أحوالهم أنهم لم يكن لهم كنف في بيوتهم ، وقالت عائشة رضي الله عنها إنهم كانوا يتقذرون من اتخاذ الكنف في البيوت ، ونقلها إلى خارج المدينة فيه كلفة ومشقة ، ويلزم منه تأخير ما وجب على الفور ، وأيضا فإنه يمكن التحرز منها ; فإن طرق المدينة كانت واسعة ، ولم تكن الخمر من الكثرة بحيث تصير نهرا يعم الطريق كلها ، بل إنما جرت في مواضع يسيرة يمكن التحرز عنها - هذا - مع ما يحصل في ذلك من فائدة شهرة إراقتها في طرق المدينة ، ليشيع العمل على مقتضى تحريمها من إتلافها ، وأنه لا ينتفع بها ، وتتابع الناس وتوافقوا على ذلك ، والله أعلم . فإن قيل : التنجيس حكم شرعي ولا نص فيه ، ولا يلزم من كون الشيء محرما أن يكون نجسا ; فكم من محرم في الشرع ليس بنجس ; قلنا : قوله تعالى : رجس يدل على نجاستها ; فإن الرجس في اللسان النجاسة ، ثم لو التزمنا ألا نحكم بحكم إلا حتى نجد فيه نصا لتعطلت الشريعة ; فإن النصوص فيها قليلة ; فأي نص يوجد على تنجيس البول والعذرة والدم والميتة وغير ذلك ؟ وإنما هي الظواهر والعمومات والأقيسة ، وسيأتي في سورة \" الحج \" ما يوضح هذا المعنى إن شاء الله تعالى .\nالسابعة : قوله : فاجتنبوه يقتضي الاجتناب المطلق الذي لا ينتفع معه بشيء بوجه من الوجوه ; لا بشرب ولا بيع ولا تخليل ولا مداواة ولا غير ذلك ، وعلى هذا تدل الأحاديث الواردة في الباب ، وروى مسلم عن ابن عباس أن رجلا أهدى لرسول الله صلى الله عليه وسلم راوية خمر ، فقال له رسول الله صلى الله عليه وسلم : هل علمت أن الله حرمها قال : لا ، قال : فسار رجلا فقال له رسول الله صلى الله عليه وسلم : بم ساررته ؟ قال : أمرته ببيعها ; فقال : إن الذي حرم شربها حرم بيعها ، قال : ففتح المزادة حتى ذهب ما فيها ; فهذا حديث يدل على ما ذكرناه ; إذ لو كان فيها منفعة من المنافع الجائزة لبينه رسول الله صلى الله عليه وسلم ، كما قال في الشاة الميتة . هلا أخذتم إهابها فدبغتموه فانتفعتم به الحديث .\nالثامنة : أجمع المسلمون على تحريم بيع الخمر والدم ، وفي ذلك دليل على تحريم بيع العذرات وسائر النجاسات وما لا يحل أكله ; ولذلك - والله أعلم - كره مالك بيع زبل الدواب ، ورخص فيه ابن القاسم لما فيه من المنفعة ; والقياس ما قاله مالك ، وهو مذهب الشافعي ، وهذا الحديث شاهد بصحة ذلك .\nالتاسعة : ذهب جمهور الفقهاء إلى أن الخمر لا يجوز تخليلها لأحد ، ولو جاز تخليلها ما كان رسول الله صلى الله عليه وسلم ليدع الرجل أن يفتح المزادة حتى يذهب ما فيها ; لأن الخل مال وقد نهي عن إضاعة المال ، ولا يقول أحد فيمن أراق خمرا على مسلم أنه أتلف له مالا ، وقد أراق عثمان بن أبي العاص خمرا ليتيم ، واستؤذن صلى الله عليه وسلم في تخليلها فقال : لا ونهى عن ذلك . ذهب إلى هذا طائفة من العلماء من أهل الحديث والرأي ، وإليه مال سحنون بن سعيد ، وقال آخرون : لا بأس بتخليل الخمر ولا بأس بأكل ما تخلل منها بمعالجة آدمي أو غيرها ; وهو قول الثوري والأوزاعي والليث بن سعد والكوفيين ، وقال أبو حنيفة : إن طرح فيها المسك والملح فصارت مربى وتحولت عن حال الخمر جاز ، وخالفه محمد بن الحسن في المربى وقال : لا تعالج الخمر بغير تحويلها إلى الخل وحده . قال أبو عمر : احتج العراقيون في تخليل الخمر بأبي الدرداء ; وهو يروي عن أبي إدريس الخولاني عن أبي الدرداء من وجه ليس بالقوي أنه كان يأكل المربى منه ، ويقول : دبغته الشمس والملح ، وخالفه عمر بن الخطاب وعثمان بن أبي العاص في تخليل الخمر ; وليس في رأي أحد حجة مع السنة ، وبالله التوفيق ، وقد يحتمل أن يكون المنع من تخليلها كان في بدء الإسلام عند نزول تحريمها ; لئلا يستدام حبسها لقرب العهد بشربها ، إرادة لقطع العادة في ذلك ، وإذا كان كذلك لم يكن في النهي عن تخليلها حينئذ ، والأمر بإراقتها ما يمنع من أكلها إذا خللت . وروى أشهب عن مالك قال : إذا خلل النصراني خمرا فلا بأس بأكله ، وكذلك إن خللها مسلم واستغفر الله ; وهذه الرواية ذكرها ابن عبد الحكم في كتابه . والصحيح ما قاله مالك في رواية ابن القاسم وابن وهب أنه لا يحل لمسلم أن يعالج الخمر حتى يجعلها خلا ولا يبيعها ، ولكن ليهريقها .\nالعاشرة : لم يختلف قول مالك وأصحابه أن الخمر إذا تخللت بذاتها أن أكل ذلك الخل حلال ، وهو قول عمر بن الخطاب وقبيصة وابن شهاب ، وربيعة وأحد قولي الشافعي ، وهو تحصيل مذهبه عند أكثر أصحابه .\nالحادية عشرة : ذكر ابن خويز منداد أنها تملك ، ونزع إلى ذلك بأنه يمكن أن يزال بها الغصص ، ويطفأ بها حريق ; وهذا نقل لا يعرف لمالك ، بل يخرج هذا على قول من يرى أنها طاهرة ، ولو جاز ملكها لما أمر النبي صلى الله عليه وسلم بإراقتها ، وأيضا فإن الملك نوع نفع وقد بطل بإراقتها . والحمد لله .\nالثانية عشرة : هذه الآية تدل على تحريم اللعب بالنرد والشطرنج قمارا أو غير قمار ; لأن الله تعالى لما حرم الخمر أخبر بالمعنى الذي فيها فقال : يا أيها الذين آمنوا إنما الخمر والميسر الآية . ثم قال : إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء الآية . فكل لهو دعا قليله إلى كثير ، وأوقع العداوة والبغضاء بين العاكفين عليه ، وصد عن ذكر الله وعن الصلاة فهو كشرب الخمر ، وأوجب أن يكون حراما مثله . فإن قيل : إن شرب الخمر يورث السكر فلا يقدر معه على الصلاة وليس في اللعب بالنرد والشطرنج هذا المعنى ; قيل له : قد جمع الله تعالى بين الخمر والميسر في التحريم ، ووصفهما جميعا بأنهما يوقعان العداوة والبغضاء بين الناس ، ويصدان عن ذكر الله وعن الصلاة ; ومعلوم أن الخمر إن أسكرت فالميسر لا يسكر ، ثم لم يكن عند الله افتراقهما في ذلك يمنع من التسوية بينهما في التحريم لأجل ما اشتركا فيه من المعاني ، وأيضا فإن قليل الخمر لا يسكر كما أن اللعب بالنرد والشطرنج لا يسكر ، ثم كان حراما مثل الكثير ، فلا ينكر أن يكون اللعب بالنرد والشطرنج حراما مثل الخمر وإن كان لا يسكر . وأيضا فإن ابتداء اللعب يورث الغفلة ، فتقوم تلك الغفلة المستولية على القلب مكان السكر ; فإن كانت الخمر إنما حرمت لأنها تسكر فتصد بالإسكار عن الصلاة ، فليحرم اللعب بالنرد والشطرنج لأنه يغفل ويلهي فيصد بذلك عن الصلاة ، والله أعلم .\nالثالثة عشرة : مهدي الراوية يدل على أنه كان لم يبلغه الناسخ ، وكان متمسكا بالإباحة المتقدمة ، فكان ذلك دليلا على أن الحكم لا يرتفع بوجود الناسخ - كما يقول بعض الأصوليين - بل ببلوغه كما دل عليه هذا الحديث ، وهو الصحيح ; لأن النبي صلى الله عليه وسلم لم يوبخه ، بل بين له الحكم ; ولأنه مخاطب بالعمل بالأول بحيث لو تركه عصى بلا خلاف ، وإن كان الناسخ قد حصل في الوجود ، وذلك كما وقع لأهل قباء ; إذ كانوا يصلون إلى بيت المقدس إلى أن أتاهم الآتي فأخبرهم بالناسخ ، فمالوا نحو الكعبة ، وقد تقدم في سورة \" البقرة \" والحمد لله ; وتقدم فيها ذكر الخمر واشتقاقها والميسر ، وقد مضى في صدر هذه السورة القول في الأنصاب والأزلام . والحمد لله .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ فَٱجۡتَنِبُوهُ لَعَلَّكُمۡ تُفۡلِحُونَ ٠٩\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 90 و 91 : يذم تعالى هذه الأشياء القبيحة، ويخبر أنها من عمل الشيطان، وأنها رجس. { فَاجْتَنِبُوهُ } أي: اتركوه { لَعَلَّكُمْ تُفْلِحُونَ } فإن الفلاح لا يتم إلا بترك ما حرم الله، خصوصا هذه الفواحش المذكورة، وهي الخمر وهي: كل ما خامر العقل أي: غطاه بسكره، والميسر، وهو: جميع المغالبات التي فيها عوض من الجانبين، كالمراهنة ونحوها، والأنصاب التي هي: الأصنام والأنداد ونحوها، مما يُنصب ويُعبد من دون الله، والأزلام التي يستقسمون بها، فهذه الأربعة نهى الله عنها وزجر، وأخبر عن مفاسدها الداعية إلى تركها واجتنابها. فمنها: أنها رجس، أي: خبث، نجس معنى، وإن لم تكن نجسة حسا. والأمور الخبيثة مما ينبغي اجتنابها وعدم التدنس بأوضارها. ومنها: أنها من عمل الشيطان، الذي هو أعدى الأعداء للإنسان. ومن المعلوم أن العدو يحذر منه، وتحذر مصايده وأعماله، خصوصا الأعمال التي يعملها ليوقع فيها عدوه، فإنها فيها هلاكه، فالحزم كل الحزم البعد عن عمل العدو المبين، والحذر منهـا، والخوف من الوقوع فيها. ومنها: أنه لا يمكن الفلاح للعبد إلا باجتنابها، فإن الفلاح هو: الفوز بالمطلوب المحبوب، والنجاة من المرهوب، وهذه الأمور مانعة من الفلاح ومعوقة له. ومنها: أن هذه موجبة للعداوة والبغضاء بين الناس، والشيطان حريص على بثها، خصوصا الخمر والميسر، ليوقع بين المؤمنين العداوة والبغضاء. فإن في الخمر من انغلاب العقل وذهاب حجاه، ما يدعو إلى البغضاء بينه وبين إخوانه المؤمنين، خصوصا إذا اقترن بذلك من السباب ما هو من لوازم شارب الخمر، فإنه ربما أوصل إلى القتل. وما في الميسر من غلبة أحدهما للآخر، وأخذ ماله الكثير في غير مقابلة، ما هو من أكبر الأسباب للعداوة والبغضاء. ومنها: أن هذه الأشياء تصد القلب، ويتبعه البدن عن ذكر الله وعن الصلاة، اللذين خلق لهما العبد، وبهما سعادته، فالخمر والميسر، يصدانه عن ذلك أعظم صد، ويشتغل قلبه، ويذهل لبه في الاشتغال بهما، حتى يمضي عليه مدة طويلة وهو لا يدري أين هو. فأي معصية أعظم وأقبح من معصية تدنس صاحبها، وتجعله من أهل الخبث، وتوقعه في أعمال الشيطان وشباكه، فينقاد له كما تنقاد البهيمة الذليلة لراعيها، وتحول بين العبد وبين فلاحه، وتوقع العداوة والبغضاء بين المؤمنين، وتصد عن ذكر الله وعن الصلاة؟\" فهل فوق هذه المفاسد شيء أكبر منها؟\" ولهذا عرض تعالى على العقول السليمة النهي عنها، عرضا بقوله: { فَهَلْ أَنْتُمْ مُنْتَهُونَ } لأن العاقل -إذا نظر إلى بعض تلك المفاسد- انزجر عنها وكفت نفسه، ولم يحتج إلى وعظ كثير ولا زجر بليغ.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ فَٱجۡتَنِبُوهُ لَعَلَّكُمۡ تُفۡلِحُونَ ٠٩"
    },
    {
      "number": 760,
      "text": "إِنَّمَا يُرِيدُ الشَّيْطَانُ أَنْ يُوقِعَ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ فِي الْخَمْرِ وَالْمَيْسِرِ وَيَصُدَّكُمْ عَنْ ذِكْرِ اللَّهِ وَعَنِ الصَّلَاةِ ۖ فَهَلْ أَنْتُمْ مُنْتَهُونَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 91,
      "juz": 7,
      "manzil": 2,
      "page": 123,
      "ruku": 97,
      "hizbQuarter": 49,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا يُرِيدُ ٱلشَّيۡطَٰنُ أَن يُوقِعَ بَيۡنَكُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ فِي ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِ وَيَصُدَّكُمۡ عَن ذِكۡرِ ٱللَّهِ وَعَنِ ٱلصَّلَوٰةِۖ فَهَلۡ أَنتُم مُّنتَهُونَ ١٩\n                                    \n                                    \n                                    ثم قال تعالى : ( إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر ويصدكم عن ذكر الله وعن الصلاة فهل أنتم منتهون ) وهذا تهديد وترهيب .\nذكر الأحاديث الواردة في [ بيان ] تحريم الخمر :\nقال الإمام أحمد : حدثنا سريج ، حدثنا أبو معشر ، عن أبي وهب مولى أبي هريرة ، عن أبي هريرة قال : حرمت الخمر ثلاث مرات ، قدم رسول الله صلى الله عليه وسلم المدينة ، وهم يشربون الخمر ويأكلون الميسر ، فسألوا رسول الله صلى الله عليه وسلم عنهما ، فأنزل الله : ( يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس ) إلى آخر الآية [ البقرة : 219 ] . فقال الناس : ما حرم علينا ، إنما قال : ( فيهما إثم كبير ) وكانوا يشربون الخمر ، حتى كان يوما من الأيام صلى رجل من المهاجرين ، أم أصحابه في المغرب ، خلط في قراءته ، فأنزل الله [ عز وجل ] آية أغلظ منها : ( يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى حتى تعلموا ما تقولون ) [ النساء : 43 ] وكان الناس يشربون ، حتى يأتي أحدهم الصلاة وهو مفيق . ثم أنزلت آية أغلظ من ذلك : ( يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون ) قالوا : انتهينا ربنا . وقال الناس : يا رسول الله ، ناس قتلوا في سبيل الله ، [ وناس ] ماتوا على سرفهم كانوا يشربون الخمر ويأكلون الميسر ، وقد جعله الله رجسا من عمل الشيطان؟ فأنزل الله تعالى : ( ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا ) إلى آخر الآية ، وقال النبي صلى الله عليه وسلم : \" لو حرم عليهم لتركوه كما تركتم \" . انفرد به أحمد .\nوقال الإمام أحمد : حدثنا خلف بن الوليد ، حدثنا إسرائيل ، عن أبي إسحاق ، عن أبي ميسرة عن عمر بن الخطاب [ رضي الله عنه ] أنه قال : لما نزل تحريم الخمر قال : اللهم بين لنا في الخمر بيانا شافيا . فنزلت هذه الآية التي في البقرة : ( يسألونك عن الخمر والميسر قل فيهما إثم كبير ) فدعي عمر فقرئت عليه ، فقال : اللهم بين لنا في الخمر بيانا شافيا . فنزلت الآية التي في سورة النساء : ( يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى ) فكان منادي رسول الله صلى الله عليه وسلم إذا أقام الصلاة نادى : ألا يقربن الصلاة سكران . فدعي عمر فقرئت عليه ، فقال : اللهم بين لنا في الخمر بيانا شافيا . فنزلت الآية التي في المائدة ، فدعي عمر فقرئت عليه فلما بلغ : ( فهل أنتم منتهون ) قال عمر : انتهينا .\nوهكذا رواه أبو داود والترمذي والنسائي من طرق ، عن إسرائيل ، عن أبي إسحاق عمرو بن عبد الله السبيعي وعن أبي ميسرة - واسمه عمرو بن شرحبيل الهمداني - عن عمر ، به . وليس له عنه سواه ، قال أبو زرعة : ولم يسمع منه . وصحح هذا الحديث علي بن المديني والترمذي .\nوقد ثبت في الصحيحين عن عمر بن الخطاب أنه قال في خطبته على منبر رسول الله صلى الله عليه وسلم : أيها الناس ، إنه نزل تحريم الخمر وهي من خمسة : من العنب ، والتمر ، والعسل ، والحنطة ، والشعير ، والخمر ما خامر العقل .\nوقال البخاري : حدثنا إسحاق بن إبراهيم ، حدثنا محمد بن بشر ، حدثنا عبد العزيز بن عمر بن عبد العزيز ، حدثني نافع عن ابن عمر قال : نزل تحريم الخمر وإن بالمدينة يومئذ لخمسة أشربة ما فيها شراب العنب .\nحديث آخر : قال أبو داود الطيالسي : حدثنا محمد بن أبي حميد ، عن المصري - يعني أبا طعمة قارئ مصر - قال : سمعت ابن عمر يقول : نزلت في الخمر ثلاث آيات ، فأول شيء نزل : ( يسألونك عن الخمر والميسر ) الآية [ البقرة : 219 ] فقيل : حرمت الخمر . فقالوا : يا رسول الله ، ننتفع بها كما قال الله تعالى . قال : فسكت عنهم ثم نزلت هذه الآية : ( لا تقربوا الصلاة وأنتم سكارى ) [ النساء : 43 ] . فقيل : حرمت الخمر ، فقالوا : يا رسول الله ، إنا لا نشربها قرب الصلاة ، فسكت عنهم ثم نزلت : ( يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون ) فقال رسول الله صلى الله عليه وسلم : \" حرمت الخمر \" .\nحديث آخر : قال الإمام أحمد : ، حدثنا يعلى ، حدثنا محمد بن إسحاق ، عن القعقاع بن حكيم ; أن عبد الرحمن بن وعلة قال : سألت ابن عباس عن بيع الخمر ، فقال : كان لرسول الله صلى الله عليه وسلم صديق من ثقيف - أو : من دوس - فلقيه يوم الفتح براوية خمر يهديها إليه ، فقال رسول الله صلى الله عليه وسلم : \" يا فلان ، أما علمت أن الله حرمها؟ \" فأقبل الرجل على غلامه فقال : اذهب فبعها . فقال رسول الله صلى الله عليه وسلم : \" يا فلان ، بماذا أمرته؟ \" فقال : أمرته أن يبيعها . قال : \" إن الذي حرم شربها حرم بيعها \" . فأمر بها فأفرغت في البطحاء .\nرواه مسلم من طريق ابن وهب ، عن مالك ، عن زيد بن أسلم . ومن طريق ابن وهب أيضا ، عن سليمان بن بلال ، عن يحيى بن سعيد كلاهما - عن عبد الرحمن بن وعلة ، عن ابن عباس ، به . ورواه النسائي ، عن قتيبة ، عن مالك ، به .\nحديث آخر : قال الحافظ أبو يعلى الموصلي : حدثنا محمد بن أبي بكر المقدمي ، حدثنا أبو بكر الحنفي ، حدثنا عبد الحميد بن جعفر ، عن شهر بن حوشب عن تميم الداري أنه كان يهدي لرسول الله صلى الله عليه وسلم راوية من خمر ، فلما أنزل الله تحريم الخمر جاء بها ، فلما رآها رسول الله صلى الله عليه وسلم ضحك وقال : \" إنها قد حرمت بعدك \" . قال : يا رسول الله ، فأبيعها وأنتفع بثمنها؟ فقال رسول الله صلى الله عليه وسلم : \" لعن الله اليهود ، حرم عليهم شحوم البقر والغنم ، فأذابوه ، وباعوه ، والله حرم الخمر وثمنها \" .\nوقد رواه أيضا الإمام أحمد فقال : حدثنا روح ، حدثنا عبد الحميد بن بهرام قال : سمعت شهر بن حوشب قال : حدثني عبد الرحمن بن غنم : أن الداري كان يهدي لرسول الله صلى الله عليه وسلم كل عام راوية من خمر ، فلما كان عام حرمت جاء براوية ، فلما نظر إليه ضحك ، فقال : أشعرت أنها حرمت بعدك؟ \" فقال : يا رسول الله ، ألا أبيعها وأنتفع بثمنها؟ فقال رسول الله صلى الله عليه وسلم : \" لعن الله اليهود ، انطلقوا إلى ما حرم عليهم من شحم البقر والغنم فأذابوه ، فباعوا به ما يأكلون ، وإن الخمر حرام وثمنها حرام ، وإن الخمر حرام وثمنها حرام ، وإن الخمر حرام وثمنها حرام \" .\nحديث آخر : قال الإمام أحمد : حدثنا قتيبة بن سعيد ، حدثنا ابن لهيعة ، عن سليمان بن عبد الرحمن عن نافع بن كيسان أن أباه أخبره أنه كان يتجر في الخمر في زمن رسول الله صلى الله عليه وسلم ، وأنه أقبل من الشام ومعه خمر في الزقاق ، يريد بها التجارة ، فأتى بها رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، إني جئتك بشراب طيب فقال رسول الله صلى الله عليه وسلم : \" يا كيسان ، إنها قد حرمت بعدك \" . قال : فأبيعها يا رسول الله؟ فقال رسول الله صلى الله عليه وسلم : \" إنها قد حرمت وحرم ثمنها \" . فانطلق كيسان إلى الزقاق ، فأخذ بأرجلها ثم هراقها .\nحديث آخر : قال الإمام أحمد : حدثنا يحيي بن سعيد ، عن حميد عن أنس قال : كنت أسقي أبا عبيدة بن الجراح وأبي بن كعب وسهيل بن بيضاء ، ونفرا من أصحابه عند أبي طلحة وأنا أسقيهم ، حتى كاد الشراب يأخذ منهم ، فأتى آت من المسلمين فقال : أما شعرتم أن الخمر قد حرمت؟ فما قالوا : حتى ننظر ونسأل ، فقالوا : يا أنس ، اكف ما بقي في إنائك ، فوالله ما عادوا فيها ، وما هي إلا التمر والبسر ، وهي خمرهم يومئذ .\nأخرجاه في الصحيحين - من غير وجه - عن أنس وفي رواية حماد بن زيد ، عن ثابت عن أنس قال : كنت ساقي القوم يوم حرمت الخمر في بيت أبي طلحة ، وما شرابهم إلا الفضيخ البسر والتمر ، فإذا مناد ينادي ، قال : اخرج فانظر . فإذا مناد ينادي : ألا إن الخمر قد حرمت ، فجرت في سكك المدينة ، قال : فقال لي أبو طلحة : اخرج فأهرقها . فهرقتها ، فقالوا - أو : قال بعضهم : قتل فلان وفلان وهي في بطونهم . قال : فأنزل الله : ( ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا ) الآية .\nوقال ابن جرير : حدثنا محمد بن بشار ، حدثني عبد الكبير بن عبد المجيد ، حدثنا عباد بن راشد ، عن قتادة عن أنس بن مالك قال : بينما أنا أدير الكأس على أبي طلحة وأبي عبيدة بن الجراح ومعاذ بن جبل وسهيل بن بيضاء وأبي دجانة ، حتى مالت رؤوسهم من خليط بسر وتمر . فسمعت مناديا ينادي : ألا إن الخمر قد حرمت! قال : فما دخل علينا داخل ولا خرج منا خارج ، حتى أهرقنا الشراب ، وكسرنا القلال ، وتوضأ بعضنا واغتسل بعضنا ، وأصبنا من طيب أم سليم ، ثم خرجنا إلى المسجد ، فإذا رسول الله صلى الله عليه وسلم يقرأ : ( يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون ) إلى قوله : ( فهل أنتم منتهون ) فقال رجل : يا رسول الله ، فما منزلة من مات وهو يشربها؟ فأنزل الله : ( ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا [ إذا ما اتقوا وآمنوا وعملوا الصالحات ] ) الآية ، فقال رجل لقتادة : أنت سمعته من أنس بن مالك ؟ قال : نعم . وقال رجل لأنس بن مالك : أنت سمعته من رسول الله صلى الله عليه وسلم؟ قال : نعم - أو : حدثني من لم يكذب ، ما كنا نكذب ، ولا ندري ما الكذب .\nحديث آخر : قال الإمام أحمد : حدثنا يحيى بن إسحاق ، أخبرني يحيى بن أيوب ، عن عبيد الله بن زحر ، عن بكر بن سوادة ، عن قيس بن سعد بن عبادة ; أن رسول الله صلى الله عليه وسلم قال : \" إن ربي تبارك وتعالى حرم علي الخمر ، والكوبة ، والقنين . وإياكم والغبيراء ، فإنها ثلث خمر العالم \" .\nحديث آخر : قال الإمام أحمد : حدثنا يزيد ، حدثنا فرج بن فضالة ، عن إبراهيم بن عبد الرحمن بن رافع عن أبيه ، عن عبد الله بن عمرو قال : قال رسول الله صلى الله عليه وسلم : \" إن الله حرم على أمتي الخمر والميسر والمزر ، والكوبة والقنين . وزادني صلاة الوتر \" . قال يزيد : القنين : البرابط . تفرد به أحمد .\nوقال أحمد أيضا : حدثنا أبو عاصم - وهو النبيل - أخبرنا عبد الحميد بن جعفر ، حدثنا يزيد بن أبي حبيب ، عن عمرو بن الوليد ، عن عبد الله بن عمرو ; أن رسول الله صلى الله عليه وسلم قال : \" من قال علي ما لم أقل فليتبوأ مقعده من جهنم \" . قال : وسمعت رسول الله صلى الله عليه وسلم يقول : \" إن الله حرم الخمر والميسر والكوبة والغبيراء ، وكل مسكر حرام \" . تفرد به أحمد أيضا .\nحديث آخر : قال الإمام أحمد : حدثنا وكيع ، حدثنا عبد العزيز بن عمر بن عبد العزيز ، عن أبي طعمة - مولاهم - وعن عبد الرحمن بن عبد الله الغافقي أنهما سمعا ابن عمر يقول : قال رسول الله صلى الله عليه وسلم : \" لعنت الخمر على عشرة وجوه : لعنت الخمر بعينها وشاربها ، وساقيها ، وبائعها ، ومبتاعها ، وعاصرها ، ومعتصرها ، وحاملها ، والمحمولة إليه ، وآكل ثمنها \" .\nورواه أبو داود وابن ماجه ، من حديث وكيع ، به .\nوقال أحمد : حدثنا حسن ، حدثنا ابن لهيعة ، حدثنا أبو طعمة ، سمعت ابن عمر يقول : خرج رسول الله صلى الله عليه وسلم إلى المربد ، فخرجت معه فكنت عن يمينه ، وأقبل أبو بكر فتأخرت عنه ، فكان عن يمينه وكنت عن يساره . ثم أقبل عمر فتنحيت له ، فكان عن يساره . فأتى رسول الله صلى الله عليه وسلم المربد ، فإذا بزقاق على المربد فيها خمر - قال ابن عمر - : فدعاني رسول الله صلى الله عليه وسلم بالمدية - قال ابن عمر : وما عرفت المدية إلا يومئذ - فأمر بالزقاق فشقت ، ثم قال : \" لعنت الخمر وشاربها ، وساقيها ، وبائعها ، ومبتاعها وحاملها ، والمحمولة إليه ، وعاصرها ، ومعتصرها ، وآكل ثمنها \" .\nوقال أحمد : حدثنا الحكم بن نافع ، حدثنا أبو بكر بن أبي مريم ، عن ضمرة بن حبيب قال : قال عبد الله بن عمر : أمرني رسول الله صلى الله عليه وسلم أن آتيه بمدية وهي الشفرة ، فأتيته بها فأرسل بها فأرهفت ثم أعطانيها ، وقال : \" اغد علي بها \" . ففعلت فخرج بأصحابه إلى أسواق المدينة ، وفيها زقاق الخمر قد جلبت من الشام ، فأخذ المدية مني فشق ما كان من تلك الزقاق بحضرته ، ثم أعطانيها وأمر أصحابه الذين كانوا معه أن يمضوا معي وأن يعاونوني ، وأمرني أن آتي الأسواق كلها فلا أجد فيها زق خمر إلا شققته ، ففعلت ، فلم أترك في أسواقها زقا إلا شققته .\nحديث آخر : قال عبد الله بن وهب : أخبرني عبد الرحمن بن شريح وابن لهيعة والليث بن سعد عن خالد بن يزيد ، عن ثابت بن يزيد الخولاني أخبره : أنه كان له عم يبيع الخمر ، وكان يتصدق ، فنهيته عنها فلم ينته ، فقدمت المدينة فتلقيت ابن عباس ، فسألته عن الخمر وثمنها ، فقال : هي حرام وثمنها حرام . ثم قال ابن عباس ، رضي الله عنه : يا معشر أمة محمد ، إنه لو كان كتاب بعد كتابكم ، ونبي بعد نبيكم ، لأنزل فيكم كما أنزل فيمن قبلكم ، ولكن أخر ذلك من أمركم إلى يوم القيامة ، ولعمري لهو أشد عليكم ، قال ثابت : فلقيت عبد الله بن عمر فسألته عن ثمن الخمر ، فقال : سأخبرك عن الخمر ، إني كنت عند رسول الله صلى الله عليه وسلم في المسجد ، فبينما هو محتب حل حبوته ثم قال : \" من كان عنده من هذه الخمر فليأتنا بها \" . فجعلوا يأتونه ، فيقول أحدهم : عندي راوية . ويقول الآخر : عندي زق أو : ما شاء الله أن يكون عنده ، فقال رسول الله صلى الله عليه وسلم : \" اجمعوه ببقيع كذا وكذا ثم آذنوني \" . ففعلوا ، ثم آذنوه فقام وقمت معه ، فمشيت عن يمينه وهو متكئ علي ، فألحقنا أبو بكر ، رضي الله عنه ، فأخرني رسول الله صلى الله عليه وسلم ، فجعلني عن شماله ، وجعل أبا بكر في مكاني . ثم لحقنا عمر بن الخطاب ، رضي الله عنه فأخرني ، وجعله عن يساره ، فمشى بينهما . حتى إذا وقف على الخمر قال للناس : \" أتعرفون هذه ؟ قالوا : نعم يا رسول الله ، هذه الخمر . قال : \" صدقتم \" . قال : \" فإن الله لعن الخمر وعاصرها ومعتصرها ، وشاربها وساقيها ، وحاملها والمحمولة إليه ، وبائعها ومشتريها وآكل ثمنها \" . ثم دعا بسكين ، فقال : \" اشحذوها \" . ففعلوا ، ثم أخذها رسول الله صلى الله عليه وسلم يخرق بها الزقاق ، قال : فقال الناس : في هذه الزقاق منفعة ، قال : \" أجل ، ولكني إنما أفعل ذلك غضبا لله ، عز وجل ، لما فيها من سخطه \" . فقال عمر : أنا أكفيك يا رسول الله؟ قال : \" لا \" .\nقال ابن وهب : وبعضهم يزيد على بعض في قصة الحديث . رواه البيهقي .\nحديث آخر : قال الحافظ أبو بكر البيهقي : أنبأنا أبو الحسين بن بشران ، أنبأنا إسماعيل بن محمد الصفار ، حدثنا محمد بن عبيد الله المنادي ، حدثنا وهب بن جرير ، حدثنا شعبة ، عن سماك ، عن مصعب بن سعد ، عن سعد ، قال : أنزلت في الخمر أربع آيات ، فذكر الحديث . قال : وضع رجل من الأنصار طعاما ، فدعانا فشربنا الخمر قبل أن تحرم حتى انتشينا ، فتفاخرنا ، فقالت الأنصار : نحن أفضل . وقالت قريش : نحن أفضل . فأخذ رجل من الأنصار لحي جزور ، فضرب به أنف سعد ففزره ، وكان أنف سعد مفزورا . فنزلت آية الخمر : ( إنما الخمر والميسر [ والأنصاب والأزلام ] ) إلى قوله تعالى : ( فهل أنتم منتهون ) أخرجه مسلم من حديث شعبة .\nحديث آخر : قال البيهقي : وأخبرنا أبو نصر بن قتادة ، أنبأنا أبو علي الرفاء ، حدثنا علي بن عبد العزيز ، حدثنا حجاج بن منهال ، حدثنا ربيعة بن كلثوم ، حدثني أبي ، عن سعيد بن جبير عن ابن عباس قال : إنما نزل تحريم الخمر في قبيلتين من قبائل الأنصار ، شربوا فلما أن ثمل القوم عبث بعضهم ببعض ، فلما أن صحوا جعل الرجل يرى الأثر بوجهه ورأسه ولحيته ، فيقول : صنع هذا بي ، أخي فلان - وكانوا إخوة ليس في قلوبهم ضغائن - والله لو كان بي رؤوفا رحيما ما صنع هذا بي ، حتى وقعت الضغائن في قلوبهم فأنزل الله هذه الآية : ( يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان [ فاجتنبوه لعلكم تفلحون إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر ويصدكم عن ذكر الله وعن الصلاة ] فهل أنتم منتهون ) فقال ناس من المتكلفين : هي رجس ، وهي في بطن فلان ، وقد قتل يوم أحد ، فأنزل الله : ( ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا [ إذا ما اتقوا وآمنوا وعملوا الصالحات ثم اتقوا وآمنوا ثم اتقوا وأحسنوا والله يحب المحسنين ] )\nورواه النسائي في التفسير عن محمد بن عبد الرحيم صاعقة ، عن حجاج بن منهال .\nحديث آخر : قال ابن جرير : حدثني محمد بن خلف ، حدثنا سعيد بن محمد الجرمي ، عن أبي تميلة ، عن سلام مولى حفص أبي القاسم ، عن أبي بريدة ، عن أبيه قال : بينا نحن قعود على شراب لنا ، ونحن رملة ، ونحن ثلاثة أو أربعة ، وعندنا باطية لنا ، ونحن نشرب الخمر حلا إذ قمت حتى آتي رسول الله صلى الله عليه وسلم فأسلم عليه ، إذ نزل تحريم الخمر : ( يا أيها الذين آمنوا إنما الخمر والميسر ) إلى آخر الآيتين ( فهل أنتم منتهون ) ؟ فجئت إلى أصحابي فقرأتها إلى قوله : ( فهل أنتم منتهون ) ؟ قال : وبعض القوم شربته في يده ، قد شرب بعضها وبقي بعض في الإناء ، فقال بالإناء تحت شفته العليا ، كما يفعل الحجام ، ثم صبوا ما في باطيتهم ، فقالوا : انتهينا ربنا .\nحديث آخر : قال البخاري : حدثنا صدقة بن الفضل أخبرنا ابن عيينة ، عن عمرو عن جابر قال : صبح ناس غداة أحد الخمر ، فقتلوا من يومهم جميعا شهداء ، وذلك قبل تحريمها .\nهكذا رواه البخاري في تفسيره من صحيحه وقد رواه الحافظ أبو بكر البزار في مسنده : حدثنا أحمد بن عبدة ، حدثنا سفيان عن عمرو بن دينار سمع جابر بن عبد الله يقول : اصطبح ناس الخمر من أصحاب النبي صلى الله عليه وسلم ثم قتلوا شهداء يوم أحد ، فقالت اليهود : فقد مات بعض الذين قتلوا وهي في بطونهم .\nفأنزل الله : ( ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا ) ثم قال : وهذا إسناد صحيح . وهو كما قال ، ولكن في سياقته غرابة .\nحديث آخر : قال أبو داود الطيالسي : حدثنا شعبة ، عن أبي إسحاق عن البراء بن عازب قال : لما نزل تحريم الخمر قالوا : كيف بمن كان يشربها قبل أن تحرم؟ فنزلت : ( ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا ) الآية .\nورواه الترمذي ، عن بندار غندر ، عن شعبة ، به نحو . وقال : حسن صحيح .\nحديث آخر : قال الحافظ أبو يعلى الموصلي : حدثنا جعفر بن حميد الكوفي ، حدثنا يعقوب القمي ، عن عيسى بن جارية ، عن جابر بن عبد الله قال : كان رجل يحمل الخمر من خيبر إلى المدينة فيبيعها من المسلمين ، فحمل منها بمال ، فقدم بها المدينة ، فلقيه رجل من المسلمين فقال : يا فلان ، إن الخمر قد حرمت فوضعها حيث انتهى على تل ، وسجى عليها بأكسية ، ثم أتى النبي صلى الله عليه وسلم فقال : يا رسول الله ، بلغني أن الخمر قد حرمت؟ قال : \" أجل \" قال : لي أن أردها على من ابتعتها منه؟ قال : \" لا يصلح ردها \" . قال : لي أن أهديها إلى من يكافئني منها؟ قال : \" لا \" . قال : فإن فيها مالا ليتامى في حجري؟ قال : \" إذا أتانا مال البحرين فأتنا نعوض أيتامك من مالهم \" . ثم نادى بالمدينة ، فقال رجل : يا رسول الله ، الأوعية ننتفع بها؟ . قال : \" فحلوا أوكيتها \" . فانصبت حتى استقرت في بطن الوادي هذا حديث غريب .\nحديث آخر : قال الإمام أحمد : حدثنا وكيع ، حدثنا سفيان ، عن السدي ، عن أبي هبيرة - وهو يحيى بن عباد الأنصاري - عن أنس بن مالك أن أبا طلحة سأل النبي صلى الله عليه وسلم عن أيتام في حجره ورثوا خمرا فقال : \" أهرقها \" . قال : أفلا نجعلها خلا؟ قال : \" لا \" .\nورواه مسلم وأبو داود والترمذي ، من حديث الثوري ، به نحوه .\nحديث آخر : قال ابن أبي حاتم : حدثنا أبي ، حدثنا عبد الله بن رجاء ، حدثنا عبد العزيز بن أبي سلمة ، حدثنا هلال بن أبي هلال ، عن عطاء بن يسار عن عبد الله بن عمرو قال : إن هذه الآية التي في القرآن : ( يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون ) قال : هي في التوراة : \" إن الله أنزل الحق ليذهب به الباطل ، ويبطل به اللعب ، والمزامير ، والزفن ، والكبارات - يعني البرابط - والزمارات - يعني به الدف - والطنابير ، والشعر ، والخمر مرة لمن طعمها . أقسم الله بيمينه وعزة حيله من شربها بعد ما حرمتها لأعطشنه يوم القيامة ، ومن تركها بعد ما حرمتها لأسقينه إياها في حظيرة القدس \" .\nوهذا إسناد صحيح .\nحديث آخر : قال عبد الله بن وهب : أخبرني عمرو بن الحارث ; أن عمرو بن شعيب حدثهم ، عن أبيه ، عن عبد الله بن عمرو بن العاص ، عن رسول الله صلى الله عليه وسلم قال : \" من ترك الصلاة سكرا مرة واحدة ، فكأنما كانت له الدنيا وما عليها فسلبها ، ومن ترك الصلاة سكرا أربع مرات ، كان حقا على الله أن يسقيه من طينة الخبال \" . قيل : وما طينة الخبال؟ قال : \" عصارة أهل جهنم \" .\nورواه أحمد ، من طريق عمرو بن شعيب .\nحديث آخر : قال أبو داود : حدثنا محمد بن رافع ، حدثنا إبراهيم بن عمر الصنعاني ، قال : سمعت النعمان - هو ابن أبي شيبة الجندي - يقول عن طاوس ، عن ابن عباس ، عن النبي صلى الله عليه وسلم قال : \" كل مخمر خمر ، وكل مسكر حرام ، ومن شرب مسكرا بخست صلاته أربعين صباحا ، فإن تاب تاب الله عليه ، فإن عاد الرابعة كان حقا على الله أن يسقيه من طينة الخبال \" . قيل : وما طينة الخبال يا رسول الله ؟ قال : \" صديد أهل النار ، ومن سقاه صغيرا لا يعرف حلاله من حرامه ، كان حقا على الله أن يسقيه من طينة الخبال \"\nتفرد به أبو داود .\nحديث آخر : قال الشافعي ، رحمه الله : أنبأنا مالك ، عن نافع ، عن ابن عمر ، أن رسول الله صلى الله عليه وسلم قال : \" من شرب الخمر في الدنيا ، ثم لم يتب منها حرمها في الآخرة \" .\nأخرجه البخاري ومسلم ، من حديث مالك ، به .\nوروى مسلم ، عن أبي الربيع ، عن حماد بن زيد ، عن أيوب ، عن نافع ، عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : \" كل مسكر خمر ، وكل مسكر حرام ، ومن شرب الخمر فمات وهو يدمنها ولم يتب منها لم يشربها في الآخرة \" .\nحديث آخر : قال ابن وهب : أخبرني عمر بن محمد ، عن عبد الله بن يسار ; أنه سمع سالم بن عبد الله يقول : قال عبد الله بن عمر : قال رسول الله صلى الله عليه وسلم : \" ثلاثة لا ينظر الله إليهم يوم القيامة العاق لوالديه ، والمدمن الخمر ، والمنان بما أعطى \" .\nورواه النسائي ، عن عمر بن علي ، عن يزيد بن زريع ، عن عمر بن محمد العمري ، به .\nوروى أحمد ، عن غندر ، عن شعبة ، عن يزيد بن أبي زياد ، عن مجاهد ، عن أبي سعيد ، عن النبي صلى الله عليه وسلم قال : \" لا يدخل الجنة منان ولا عاق ، ولا مدمن خمر \" .\nورواه أحمد أيضا ، عن عبد الصمد ، عن عبد العزيز بن مسلم ، عن يزيد بن أبي زياد ، عن مجاهد ، به . وعن مروان بن شجاع ، عن خصيف ، عن مجاهد ، به ورواه النسائي ، عن القاسم بن زكريا ، عن الحسين الجعفي ، عن زائدة ، عن ابن أبي زياد ، عن سالم بن أبي الجعد ومجاهد ، كلاهما عن أبي سعيد ، به .\nحديث آخر : قال أحمد : حدثنا عبد الرزاق ، حدثنا سفيان ، عن منصور ، عن سالم بن أبي الجعد ، عن جابان ، عن عبد الله بن عمرو ، عن النبي صلى الله عليه وسلم قال : \" لا يدخل الجنة عاق ، ولا مدمن خمر ، ولا منان ، ولا ولد زنية \" .\nوكذا رواه عن يزيد ، عن همام ، عن منصور ، عن سالم ، عن جابان ، عن عبد الله بن عمرو به ، وقد رواه أيضا عن غندر وغيره ، عن شعبة ، عن منصور ، عن سالم ، عن نبيط بن شريط ، عن جابان ، عن عبد الله بن عمرو ، عن النبي صلى الله عليه وسلم قال : \" لا يدخل الجنة منان ، ولا عاق والديه ، ولا مدمن خمر \" .\nورواه النسائي ، من حديث شعبة كذلك ، ثم قال : ولا نعلم أحدا تابع شعبة ، عن نبيط بن شريط .\nوقال البخاري : لا يعرف لجابان سماع من عبد الله ولا لسالم من جابان ولا نبيط .\nوقد روي هذا الحديث من طريق مجاهد ، عن ابن عباس - ومن طريقه أيضا ، عن أبي هريرة ، فالله أعلم .\nوقال الزهري : حدثني أبو بكر بن عبد الرحمن بن الحارث بن هشام ، أن أباه قال : سمعت عثمان بن عفان يقول : اجتنبوا الخمر ، فإنها أم الخبائث ، إنه كان رجل فيمن خلا قبلكم يتعبد ويعتزل الناس ، فعلقته امرأة غوية ، فأرسلت إليه جاريتها فقالت : إنا ندعوك لشهادة . فدخل معها ، فطفقت كلما دخل بابا أغلقته دونه ، حتى أفضى إلى امرأة وضيئة عندها غلام وباطية خمر ، فقالت : إني والله ما دعوتك لشهادة ولكن دعوتك لتقع علي أو تقتل هذا الغلام ، أو تشرب هذا الخمر . فسقته كأسا ، فقال : زيدوني ، فلم يرم حتى وقع عليها ، وقتل النفس ، فاجتنبوا الخمر فإنها لا تجتمع هي والإيمان أبدا إلا أوشك أحدهما أن يخرج صاحبه .\nرواه البيهقي وهذا إسناد صحيح . وقد رواه أبو بكر بن أبي الدنيا في كتابه \" ذم المسكر \" عن محمد بن عبد الله بن بزيع ، عن الفضيل بن سليمان النميري ، عن عمر بن سعيد ، عن الزهري ، به مرفوعا والموقوف أصح ، والله أعلم .\nوله شاهد في الصحيحين ، عن رسول الله صلى الله عليه وسلم أنه قال : \" لا يزني الزاني حين يزني وهو مؤمن ، ولا يسرق سرقة حين يسرقها وهو مؤمن ، ولا يشرب الخمر حين يشربها وهو مؤمن \" .\nوقال أحمد بن حنبل : حدثنا أسود بن عامر ، أخبرنا إسرائيل ، عن سماك ، عن عكرمة ، عن ابن عباس قال : لما حرمت الخمر قال أناس : يا رسول الله ، أصحابنا الذين ماتوا وهم يشربونها؟ فأنزل الله : ( ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا ) الآية . قال : ولما حولت القبلة قال أناس : يا رسول الله ، أصحابنا الذين ماتوا وهم يصلون إلى بيت المقدس؟ فأنزل الله : ( وما كان الله ليضيع إيمانكم ) [ البقرة : 143 ] .\nوقال الإمام أحمد : حدثنا داود بن مهران الدباغ ، حدثنا داود - يعني العطار - ، عن ابن خثيم ، عن شهر بن حوشب ، عن أسماء بنت يزيد ، أنها سمعت النبي صلى الله عليه وسلم يقول : \" من شرب الخمر لم يرض الله عنه أربعين ليلة ، إن مات مات كافرا ، وإن تاب تاب الله عليه . وإن عاد كان حقا على الله أن يسقيه من طينة الخبال \" . قالت : قلت : يا رسول الله ، وما طينة الخبال؟ قال : \" صديد أهل النار \" .\nوقال الأعمش ، عن إبراهيم ، عن علقمة عن عبد الله بن مسعود أن النبي صلى الله عليه وسلم قال لما نزلت : ( ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا ) فقال النبي صلى الله عليه وسلم : \" قيل لي : أنت منهم \" .\nوهكذا رواه مسلم والترمذي والنسائي ، من طريقه .\nوقال عبد الله بن الإمام أحمد : قرأت على أبي ، حدثنا علي بن عاصم ، حدثنا إبراهيم الهجري ، عن أبي الأحوص ، عن عبد الله بن مسعود قال : قال رسول الله صلى الله عليه وسلم : \" إياكم وهاتان الكعبتان الموسمتان اللتان تزجران زجرا ، فإنهما ميسر العجم \" .\n                                    ",
        "qortoby": "إِنَّمَا يُرِيدُ ٱلشَّيۡطَٰنُ أَن يُوقِعَ بَيۡنَكُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ فِي ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِ وَيَصُدَّكُمۡ عَن ذِكۡرِ ٱللَّهِ وَعَنِ ٱلصَّلَوٰةِۖ فَهَلۡ أَنتُم مُّنتَهُونَ ١٩\n                                    \n                                    \n                                    قوله تعالى : إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر الآية . أعلم الله تعالى عباده أن الشيطان إنما يريد أن يوقع العداوة والبغضاء بيننا بسبب الخمر وغيره ، فحذرنا منها ، ونهانا عنها . روي أن قبيلتين من الأنصار شربوا الخمر وانتشوا ، فعبث بعضهم ببعض ، فلما صحوا رأى بعضهم في وجه بعض آثار ما فعلوا ، وكانوا إخوة ليس في قلوبهم ضغائن ، فجعل بعضهم يقول : لو كان أخي بي رحيما ما فعل بي هذا ، فحدثت بينهم الضغائن ; فأنزل الله : إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء الآية .\nقوله تعالى : ويصدكم عن ذكر الله وعن الصلاة يقول : إذا سكرتم لم تذكروا الله ولم تصلوا ، وإن صليتم خلط عليكم كما فعل بعلي ، وروي : بعبد الرحمن كما تقدم في \" النساء \" ، وقال عبيد الله بن عمر : سئل القاسم بن محمد عن الشطرنج أهي ميسر ؟ وعن النرد أهو ميسر ؟ فقال : كل ما صد عن ذكر الله وعن الصلاة فهو ميسر . قال أبو عبيد : تأول قوله تعالى : ويصدكم عن ذكر الله وعن الصلاة .\nقوله تعالى : فهل أنتم منتهون لما علم عمر رضي الله عنه أن هذا وعيد شديد زائد على معنى انتهوا قال : انتهينا ، وأمر النبي صلى الله عليه وسلم مناديه أن ينادي في سكك المدينة ، ألا إن الخمر قد حرمت ; فكسرت الدنان ، وأريقت الخمر حتى جرت في سكك المدينة .\n                                    ",
        "saadi": "إِنَّمَا يُرِيدُ ٱلشَّيۡطَٰنُ أَن يُوقِعَ بَيۡنَكُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ فِي ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِ وَيَصُدَّكُمۡ عَن ذِكۡرِ ٱللَّهِ وَعَنِ ٱلصَّلَوٰةِۖ فَهَلۡ أَنتُم مُّنتَهُونَ ١٩\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 90 و 91 : يذم تعالى هذه الأشياء القبيحة، ويخبر أنها من عمل الشيطان، وأنها رجس. { فَاجْتَنِبُوهُ } أي: اتركوه { لَعَلَّكُمْ تُفْلِحُونَ } فإن الفلاح لا يتم إلا بترك ما حرم الله، خصوصا هذه الفواحش المذكورة، وهي الخمر وهي: كل ما خامر العقل أي: غطاه بسكره، والميسر، وهو: جميع المغالبات التي فيها عوض من الجانبين، كالمراهنة ونحوها، والأنصاب التي هي: الأصنام والأنداد ونحوها، مما يُنصب ويُعبد من دون الله، والأزلام التي يستقسمون بها، فهذه الأربعة نهى الله عنها وزجر، وأخبر عن مفاسدها الداعية إلى تركها واجتنابها. فمنها: أنها رجس، أي: خبث، نجس معنى، وإن لم تكن نجسة حسا. والأمور الخبيثة مما ينبغي اجتنابها وعدم التدنس بأوضارها. ومنها: أنها من عمل الشيطان، الذي هو أعدى الأعداء للإنسان. ومن المعلوم أن العدو يحذر منه، وتحذر مصايده وأعماله، خصوصا الأعمال التي يعملها ليوقع فيها عدوه، فإنها فيها هلاكه، فالحزم كل الحزم البعد عن عمل العدو المبين، والحذر منهـا، والخوف من الوقوع فيها. ومنها: أنه لا يمكن الفلاح للعبد إلا باجتنابها، فإن الفلاح هو: الفوز بالمطلوب المحبوب، والنجاة من المرهوب، وهذه الأمور مانعة من الفلاح ومعوقة له. ومنها: أن هذه موجبة للعداوة والبغضاء بين الناس، والشيطان حريص على بثها، خصوصا الخمر والميسر، ليوقع بين المؤمنين العداوة والبغضاء. فإن في الخمر من انغلاب العقل وذهاب حجاه، ما يدعو إلى البغضاء بينه وبين إخوانه المؤمنين، خصوصا إذا اقترن بذلك من السباب ما هو من لوازم شارب الخمر، فإنه ربما أوصل إلى القتل. وما في الميسر من غلبة أحدهما للآخر، وأخذ ماله الكثير في غير مقابلة، ما هو من أكبر الأسباب للعداوة والبغضاء. ومنها: أن هذه الأشياء تصد القلب، ويتبعه البدن عن ذكر الله وعن الصلاة، اللذين خلق لهما العبد، وبهما سعادته، فالخمر والميسر، يصدانه عن ذلك أعظم صد، ويشتغل قلبه، ويذهل لبه في الاشتغال بهما، حتى يمضي عليه مدة طويلة وهو لا يدري أين هو. فأي معصية أعظم وأقبح من معصية تدنس صاحبها، وتجعله من أهل الخبث، وتوقعه في أعمال الشيطان وشباكه، فينقاد له كما تنقاد البهيمة الذليلة لراعيها، وتحول بين العبد وبين فلاحه، وتوقع العداوة والبغضاء بين المؤمنين، وتصد عن ذكر الله وعن الصلاة؟\" فهل فوق هذه المفاسد شيء أكبر منها؟\" ولهذا عرض تعالى على العقول السليمة النهي عنها، عرضا بقوله: { فَهَلْ أَنْتُمْ مُنْتَهُونَ } لأن العاقل -إذا نظر إلى بعض تلك المفاسد- انزجر عنها وكفت نفسه، ولم يحتج إلى وعظ كثير ولا زجر بليغ.\n                                    "
      },
      "originalText": "إِنَّمَا يُرِيدُ ٱلشَّيۡطَٰنُ أَن يُوقِعَ بَيۡنَكُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ فِي ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِ وَيَصُدَّكُمۡ عَن ذِكۡرِ ٱللَّهِ وَعَنِ ٱلصَّلَوٰةِۖ فَهَلۡ أَنتُم مُّنتَهُونَ ١٩"
    },
    {
      "number": 761,
      "text": "وَأَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَاحْذَرُوا ۚ فَإِنْ تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّمَا عَلَىٰ رَسُولِنَا الْبَلَاغُ الْمُبِينُ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 92,
      "juz": 7,
      "manzil": 2,
      "page": 123,
      "ruku": 97,
      "hizbQuarter": 49,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَطِيعُواْ ٱللَّهَ وَأَطِيعُواْ ٱلرَّسُولَ وَٱحۡذَرُواْۚ فَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّمَا عَلَىٰ رَسُولِنَا ٱلۡبَلَٰغُ ٱلۡمُبِينُ ٢٩\n                                    \n                                    \n                                    يقول تعالى ناهيا عباده المؤمنين عن تعاطي الخمر والميسر وهو القمار وقد ورد عن أمير المؤمنين علي بن أبي طالب رضى الله عنه أنه قال الشطرنج من الميسر رواه ابن أبي حاتم عن أبيه عن عيسى بن مرحوم عن حاتم عن جعفر بن محمد عن أبيه عن علي به وقال ابن أبي حاتم حدثنا محمد بن إسماعيل الأحمسي حدثنا وكيع عن سفيان عن ليث عن عطاء ومجاهد وطاوس قال سفيان أو اثنين منهم قالوا: كل شيء من القمار فهو من الميسر حتى لعب الصبيان بالجوز وروى عن راشد بن سعد وضمرة بن حبيب مثله وقالا حتى الكعاب والجوز والبيض التي تلعب بها الصبيان وقال موسى بن عقبة عن نافع عن ابن عمر قال الميسر هو القمار وقال الضحاك عن ابن عباس قال الميسر هو القمار كانوا يتقامرون في الجاهلية إلى مجيءالإ سلام فنهـاهم الله عن هذه الأخلاق القبيحة وقال مالك عن داود بن الحصين أنه سمع سعيد بن المسيب يقول كان ميسر أهل الجاهلية يبيع اللحم بالشاة والشاتين وقال الزهري عن الأعرج قال الميسر الضرب بالقداح على الأموال والثمار وقال القاسم بن محمد ما ألهى عن ذكر الله وعن الصلاة فهو من الميسر رواهن ابن أبي حاتم وقال ابن أبي حاتم حدثا أحمد بن منصور الزيادي حدثنا هشام بن عمار حدثنا صدقة حدثنا عثمان بن أبي العاتكة عن على بن يزيد عن القاسم عن أبي أمامة عن أبي موسى الأشعري عن النبي صلى الله عليه وسلم قال اجتنبوا هذه الكعاب الموسومة التي يزجر بها زجرا فإنها من الميسر حديث غريب وكأن المراد بهذا هو النرد الذي ورد الحديث به صحيح مسلم عن بريدة عن الحصيب الأسلمي قال: قال رسول الله صلى الله عليه وسلم من لعب بالنردشير فكأنما صبغ يده في لحم خنزير ودمه وفي موطأ مالك ومسند أحمد وسنني أبي داود وابن ماجه عن أبي موسى الأثمري قال: قال رسول الله من لعب بالنرد فقد عصى الله ورسوله وروى موقوفا على أبي موسى من قوله فالله أعلم وقاله الإمام أحمد حدثنا علي بن إبراهيم حدثنا الجعفر عن موسى بن عبد الرحمن الخطمي أنه سمع محمد بن كعب وهو يسأل عبد الرحمن يقول أخبرني ماسمعت أباك يقول عن رسول الله صلى الله عليه وسلم فقال عبد الرحمن سمعت أبي يقول سمعت رسول الله صلى الله عليه وسلم يقول مثل الذي يلعب بالنرد ثم يقوم فيصلي مثل الذي يتوضأ بالقيح ودم الخنزير ثم يقوم فيصلي وأما الشطرنج لقد قال عبد الله بن عمر أنه شر من النرد وتقدم عن علي أنه قال هو من الميسر ونعى على تحريمه مالك وأبو حنيفة وأحمد وكرهه الشافعي رحمهم الله تعالى وأما الأنصاب فقال ابن عباس ومجاهد وعطاء وسعيد بن جبير والحسن وغير واحد هي حجارة كانوا يذبحون قرابينهم عندها وأما الأزلام فقالوا أيضا هي قداح كانوا يستقسمون بها رواه ابن أبي حاتم وقوله تعالى رجس من عمل الشيطان قال علي بن أبي طلحة عن ابن عباس أي سخط من عمل الشيطان وقال سعيد بن جبير إثم وقال زيد بن أسلم أي سر من عمل الشيطان فاجتنبوه الضمير عائد على الرجس أي اتركوه لعلكم تفلحون وهذا أثر غريب ثم قال تعالى إنما يريد الشيطان أن يرفع بينكم العداوة والبغضاء في الخمر والميسر ومصدكم عن ذكر الله وعن الصلاة فهل أنتم منتهون وهذا تهديد وترهيب \"ذكر الأحاديث الواردة في بيان تحريم الخمر\" قال الإمام أحمد حدثنا شريح حدثنا أبو معشر عن أبي وهب مولى أبي هريرة عن أبي هريرة قال حرمت الخمر ثلاث مرات قدم رسول الله صلى الله عليه وسلم المدينة وهم يشربون الخمر ويأكلون الميسر فسألوا رسول الله صلى الله عليه وسلم عنهما فأنزل الله يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس إلى آخر الآية فقال الناس ما حرما علينا إنما قال فيهما إثم كبير ومنافع للناس وكانوا يشربون الخمر حتى كان يوما من الأيام صلى رجل من المهاجرين أمام الصحابة في المغرب فخلط في قراءته فأنزل الله آية أغلظ منها يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى حتى تعلموا ما تقولون فكان الناس يشربون حتى يأتي أحدهم الصلاة وهو مغبق ثم أنزلت آية أغلظ من ذلك يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون قالوا انتهينا ربنا وقال الناس يا رسول الله ناس قتلوا في سبيل الله وماتوا على فرسهم كانوا يشربون الخمر ويأكلون الميسر وقد جعله الله رجسا من عمل الشيطان فأنزل الله تعالى ليس على الذين امنوا وعملوا الصالحات جناح فيما طعموا إلى آخر الآية فقال النبي صلى الله عليه وسلم لو حرم عليهم لتركوه كما تركتم انفرد به أحمد وقال الإمام أحمد حدثنا خلف بن الوليد حدثنا إسرائيل عن أبي إسحاق عن أبي ميسرة عن عمر بن الخطاب أنه قال لما نزل تحريم الخمر قال اللهم بين لنا في الأمر بيانا شافيا فنزلت الآية التي في سورة البقرة يسألونك عن الخمر والميسر قل فيها إثم كبير فدعي عمر فقرئت عليه فقال اللهم بين لنا في الخمر بيانا شافيا فنزلت الآية التي في سورة النساء يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى فكان منادي رسول الله صلى الله عليه وسلم إذا قال حي على الصلاة نادى: لا يقربن الصلاة سكران فدعى عمر فقرئت عليه فقال: اللهم بين لنا في الخمر بيانا شافيا فنزلت الآية التي في المائدة فدعي عمر فقرئت عليه فلما بلغ قول الله تعالى فهل أنتم منتهون قال عمر انتهينا وهكذا رواه أبو داود والترمذي والنسائي من طرق عن إسرائيل عن أبي إسحاق عمرو بن عبد الله السبيعي وعن أبي ميسرة واسمه عمرو بن شرحبيل الهمداني عن عمر به وليس له عنه سواه قال أبو زرعة ولم يسمع منه وصحح هذا الحديث علي بن المديني والترمذي وقد ثبت في الصحيحين عن عمر بن الخطاب أنه قال في خطبته على منبر رسول الله صلى الله عليه وسلم أيها الناس إنه نزل تحريم الخمر وهي من خمسة العنب والتمر والعسل الحنطة والشعير والخمر ما خامر العقل وقال البخاري حدثنا إسحاق بن إبراهيم حدثنا محمد بن بشر حدثنا عبد العزيز بن عمر بن عبد العزيز حدثني نافع عن ابن عمر قال نزل تحريم الخمر وإن بالمدينة يومئذ لخمسة أشربة ما فيها شراب العنب \" حديث آخر \"قال أبو داود الطيالسي حدثنا محمد بن أبي حميد عن المصري يعني أبا طعمة قارىء مصر قال سمعت ابن عمر يقول نزلت في الخمر ثلاث آيات فأول شئ نزل يسألونك عن الخمر والميسر الآية فقيل حرمت الخمر فقالوا يا رسول الله دعنا ننتفع بها كما قال الله تعالى قال فسكت عنهم ثم نزلت هذه الآية لا تقربوا الصلاة وأنتم سكارى فقيل حرمت الخمر فقالوا يا رسول الله إنا لا نشربها قرب الصلاة فسكت عنهم ثم نزلت يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه الآيتين فقال رسول الله صلى الله عليه وسلم حرمت الخمر \" حديث آخر \"قال الإمام أحمد حدثنا يعلى حدثنا محمد بن إسحاق عن القعقاع بن حكيم أن عبد الرحمن بن وعلة قال سألت ابن عباس عن بيع الخمر فقال كان لرسول الله صلى الله عليه وسلم صديق من ثقيف أو من دوس فلقيه يوم الفتح براوية خمر يهديها إليه فقال رسول الله يا فلان أما علمت أن الله حرمها فأقبل الرجل على غلامه فقال اذهب فبعها فقال رسول الله صلى الله عليه وسلم يا فلان بماذا أمرته فقال أمرته أن يبيعها قال إن الذي حرم شربها حرم بيعها فأمر بها فأفرغت في البطحاء رواه مسلم من طريق ابن وهب عن مالك عن زيد بن أسلم ومن طريق ابن وهب أيضا عن سليمان بن بلال عن يحيى بن سعيد كلاهما عن عبد الرحمن بن وعله عن ابن عباس به ورواه النسائي عن قتيبة عن مالك به \"حديث آخر\" قال الحافظ أبو يعلى الموصلي حدثنا محمد بن أبي بكر المقدمي حدثنا أبو بكر الحنفي حدثنا عبد الحميد بن جعفر عن شهر بن حوشب عن تميم الداري أنه كان يهدي لرسول الله صلى الله عليه وسلم كل عام رواية من خمر فلما أنزل الله تحريم الخمر جاء بها فلما رآها رسول الله صلى الله عليه وسلم ضحك وقال إنها قد حرمت بعدك قال يا رسول الله فأبيعها وأنتفع بثمنها فقال رسول الله صلى الله عليه وسلم لعن الله اليهود حرمت عليهم شحوم البقر والغنم فأذابوه وباعوه والله حرم الخمر وثمنها وقد رواه أيضا الإمام أحمد فقال حدثنا روح حدثنا عبد الحميد بن بهرام قال سمعت شهر بن حوشب قال حدثني عبد الرحمن بن غنم أن الداري كان يهدي لرسول الله صلى الله عليه وسلم كل عام راوية من خمر فلما كان عام حرمت جاء براوية فلما نظر إليه ضحك فقال أشعرت أنها حرمت بعدك فقال يا رسول الله ألا أبيعها وأنتفع بثمنها ؟ فقال رسول الله صلى الله عليه وآله وسلم لعن الله اليهود انطلقوا إلى ما حرم عليهم من شحم البقر والغنم فأذابوه فباعوه إنه ما يأكلون وإن الخمر حرام وثمنها حرام وإن الخمر حرام وثمنها حرام وإن الخمر حرام وثمنها حرام \"حديث آخر\" قال الإمام أحمد حدثنا قتيبة بن سعيد حدثنا ابن لهيعة عن سليمان بن عبد الرحمن عن نافع بن كيسان أن أباه أخبره أنه كان يتجر فى الخمر في زمن رسول الله صلى الله عليه وسلم وأنه أقبل من الشام ومعه خمر في الزقاق يريد بها التجارة فأتى بها رسول الله صلى الله عليه وسلم فقال يا رسول الله إني جئتك بشراب طيب فقال رسول الله صلى الله عليه وسلم يا كيسان إنها قد حرمت بعدك قال فأبيعها يا رسول الله؟ فقال رسول الله صلى الله عليه وسلم إنها قد حرمت وحرم ثمنها فانطلق كيسان إلى الزقاق فأخذ بأرجلها ثم هراقها \"حديث آخر\" قال الامام أحمد حدثنا محيى بن سعيد عن حميد عن أنه قال كنت أسقي أبا عبيدة بن الجراح وأبي بن كعب وسهيل بن بيضاء ونقرأ من أصحابه عند أبي طلحة حتى كاد الشراب يأخذ منهم فأتى آت من المسلمين فقال أما شعرتم أن الخمر قد حرمت ؟ فقالوا حتى فنظر ونسأل فقالوا يا أنس اسكب ما بقى في إنائك فوالله ما عادوا فيها وما هي إلا التمر والبسر وهي خمرهم يومئذ أخرجاه في الصحيحين من غير وجه عن أنس وفي رواية حماد بن زيد عن ثابت عن أنس قال كنت ساقي القوم يوم حرمت الخمر في بيت أبي طلحة وما شرابهم إلا الفضيخ البسر والتمر فإذا مناد ينادي قال اخرج فانظر فإذا مناد ينادي ألا إن الخمر قد حرمت فجرت في سكك المدينة قال: فقال لي أبو طلحة اخرح فأهرقها فهرقتها فقالوا أو قال بعضهم قل فلان وفلان وهي في بطونهم قال فأنزل الله ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا الآية وقال ابن جرير حدثنا محمد بن بشار حدثني عبد الكبير بن عبد المجيد حدثنا عباد بن راشد عن قتادة عن أنس بن مالك قال بينما أنا أدير الكأس على أبي طلحة وأبي عبيدة بن الجراج وأبي دجانة ومعاذ بن جبل وسهيل بن بيضاء حتى مالت رءوسهم من خليط بسر وتمر فسمعت مناديا ينادي ألا إن الخمر قد حرمت قال فما دخل علينا داخل ولا خرج منا خارج حتى أهرقنا الشراب وكسرنا القلال وتوضأ به بعضنا واغتسل بعضنا وأصبنا من طيب أم سليم ثم خرجنا إلى المسجد فإذا رسول الله صلى الله عليه وآله وسلم يقرأ يا أيها الذين أمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه إلى قوله فهل أنتم منتهون فقال رجل يا رسول الله فما ترى فيمن مات وهو يشربها فأنزل الله تعالى ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا الآية فقال رجل لقتادة أنت سمعته من أنس بن مالك ؟ قال نعم وقال رجل لأنس بن مالك أنت سمعته من رسول الله صلى الله عليه وسلم ؟ قال نعم أو حدثني من لم يكذب ما كنا نكذب ولا ندري ما الكذب.\n\"حديث آخر\" قال الإمام أحمد حدثنا يحيى بن إسحق أخبرني يحى بن أيوب عن عبيد الله بن زحر عن بكر بن سوادة عن قيس بن سعد بن عبادة أن رسول الله صلى الله عليه وسلم قال إن ربي تبارك وتعالى حرم الخمر والكوبة والقنين وإياكم والغبيراء فإنها ثلث خمر العالم \" حديث آخر \"قال الإمام أحمد حدثنا يزيد حدثنا فرج بن فضالة عن إبراهيم بن عبد الرحمن بن رافع عن أبيه عن عبد الله بن عمرو قال: قال رسول الله صلى الله عليه وسلم إن الله حرم على أمتي الخمر والميسر والمزر والكوبة والقنين وزادني صلاة الوتر قال يزيد القنين البرابط تفرد به أحمد وقال أحمد أيضا حدثنا أبو عاصم وهو النبيل أخبرنا عبد الحميد بن جعفر حدثنا يزيد بن أبي حبيب عن عمرو بن الوليد عن عبد الله بن عمرو أن رسول الله صلى الله عليه وسلم قال من قال علي ما لم أقل فليتبوأ مقعده من جهنم قال وسمعت رسول الله صلى الله عليه وسلم يقول إن الله حرم الخمر والميسر والكوبة والغبيراء وكل مسكر حرام تفرد به أحمد أيضا \" حديث آخر \"قال الإمام أحمد حدثنا وكيع حدثنا عبد العزيز بن عمر بن عبد العزيز عن أبي طعمة مولاهم وعن عبد الرحمن بن عبد الله الغافقي أنهما سمعا ابن عمر يقول: قال رسول الله صلى الله عليه وسلم لعنت الخمر على عشرة وجوه لعنت الخمر بعينها وشاربها وساقيها وبائعها ومبتاعها وعاصرها ومعتصرها وحاملها والمحمولة إليه وآكل ثمنها ورواه أبو داود وابن ماجه من حديث وكيع به وقال أحمد حدثنا حسن حدثنا ابن لهيعة حدثنا أبو طعمة سمعت ابن عمر يقول خرج رسول الله صلى الله عليه وسلم إلى المربد فخرج معه فكنت عن يمينه وأقبل أبو بكر فتأخرت عنه فكان عن يمينه وكنت عن يساره ثم أقبل عمر فتنحيت له فكان عن يساره فأتى رسول الله صلى الله عليه وسلم المربد فإذا بزقاق على المربد فيها خمر قال ابن عمر فدعاني رسول الله صلى الله عليه وسلم بالمدية قال ابن عمر وما عرفت المدية إلا يومئذ فأمر بالزقاق فشقت ثم قال لعنت الخمر وشاربها وساقيها وبائعها ومبتاعها وحاملها والمحمولة إليه وعاصرها ومعتصرها واكل ثمنها وقال أحمد حدثنا الحكم بن نافع حدثنا أبو بكر بن أبي مريم عن ضمرة بن حبيب قال: قال عبد الله بن عمر أمرني رسول الله صلى الله عليه وسلم أن آتيه بمدية وهي الشفرة فأتيته بها فأرسل بها فأرهفت ثم أعطانيها وقال اغد علي بها ففعلت فخرج بأصحابه إلى أسواق المدينة وفيها زقاق الخمر قد جلبت من الشام فأخذ المدية مني فشق ما كان من تلك الزقاق بحضرته ثم أعطانيها وأمر أصحابه الذين كانوا معه أن يمضوا معي وأن يعاونوني وأمرني أن آتي الأسواق كلها فلا أجد فيها زق خمر إلا شققته ففعلت فلم أترك في أسواقها زقا إلا شققته \"حديث آخر\" قال عبد الله بن وهب أخبرني عبد الرحمن بن شريح وابن لهيعة والليث بن سعد عن خالد بن زيد عن ثابت أن يزيد الخولاني أخبره أنه كان له عم يبيع الخمر وكان يتصدق قال فنهيته عنها فلم ينته فقدمت المدينة فلقيت ابن عباس فسألته عن الخمر وثمنها فقال هي حرام وثمنها حرام ثم قال ابن عباس رضي الله عنه يا معشر أمة محمد إنه لو كان كتاب بعد كتابكم ونبي بعد نبيكم لأنزل فيكم كما أنزل فيمن قبلكم ولكن أخر ذلك من أمركم إلى يوم القيامة ولعمري لهو أشد عليكم قال ثابت فلقيت عبد الله بن عمر فسألته عن ثمن الخمر فقال سأخبرك عن الخمر إني كنت مع رسول الله صلى الله عليه وسلم في المسجد فبينما هو محتب على حبوته ثم قال من كان عنده من هذه الخمر فليأتنا بها فجعلوا يأتونه فيقول أحدهم عندي راوية ويقول الآخر عندي زق أو ما شاء الله أن يكون عنده فقال رسول الله صلى الله عليه وسلم اجمعوه ببقيع كذا وكذا ثم آذنوني ففعلوا ثم آذنوه فقام وقمت معه ومشيت عن يمينه وهو متكىء علي فلحقنا أبو بكر رضي الله عنه فأخبرني رسول الله صلى الله عليه وسلم فجعلني عن شماله وجعل أبا بكر في مكاني ثم لحقنا عمر بن الخطاب رضي الله عنه فأخبرني وجعله عن يساره فمشى بينهما حتى إذا وقف على الخمر قال للناس أتعرفون هذه؟ قالوا نعم يا رسول الله هذه الخمر قال صدقتم ثم قال فإن الله لعن الخمر وعاصرها ومعتصرها وشاربها وساقيها وحاملها والمحمولة إليه وبائعها ومشتريها وآكل ثمنها ثم دعا بسكين فقال اشحذوها ففعلوا ثم أخذها رسول الله صلى الله عليه وسلم يخرق بها الزقاق قال: فقال الناس في هذه الزقاق منفعة فقال أجل ولكني إنما أفعل ذلك غضبا لله عز وجل لما فيها من سخطه فقال عمر أنا أكفيك يا رسول الله قال لا قال ابن وهب وبعضهم يزيد على بعض في قصة الحديث رواه البيهقي \"حديث آخر\" قال الحافظ أبو بكر البيهقي أنبأنا أبو الحصين بن بشر أنبأنا إسماعيل بن محمد الصفار حدثنا محمد بن عبيد الله المنادي حدثنا وهب بن جرير حدثنا شعبة عن سماك عن مصعب بن سعد عن سعد قال أنزلت في الخمر أربع آيات فذكر الحديث قال وضع رجل من الأنصار طعاما فدعانا فشربنا الخمر قبل أن تحرم حتى انتشينا فتفاخرنا فقالت الأنصار نحن أفضل وقالت فريش نحن أفضل فأخذ رجل من الأنصار لحى جزور فضرب به أنف سعد ففزره وكانت أنف سعد مفزورة فنزلت إنما الخمر والميسر إلى قوله تعالى فهل أنتم منتهون أخرجه مسلم من حديث شعبة \"حديث آخر\" قال البيهقي وأخبرنا أبو نصر بن قتادة أنبأنا أبو علي الرفا حدثنا علي بن عبد العزيز حدثنا حجاج بن منهال حدثنا ربيعة بن كلثوم حدثني أبي عن سعيد بن جبير عن ابن عباس قال إنما نزل تحريم الخمر في قبيلتين من قبائل الأنصار شربوا فلما أن حل عبد بعضهم ببعض فلما أن صحوا جعل الرجل يرى الأثر بوجهه ورأسه ولحيته فيقول صنع بي هذا أخي فلان وكانوا إخوة ليس في قلوبهم ضغائن فيقول والله لو كان بوجهه رءوفا رحيما ما صنع بي هذا حتى وقعت الضغائن في قلوبهم فأنزل الله تعالى هذه الآية يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان إلى قوله تعالى فهل أنتم منتهون فقال أناس من المتكلفين هي رجس وهي في بطن فلان وقد قتل يوم أحد فأنزل الله تعالى ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إلى آخر الآية ورواه النسائي في التفسير عن محمد بن عبد الرحيم صاعقة عن حجاج بن منهال \"حديث آخر\" قال ابن جرير حدثني محمد بن خلف حدثنا سعيد بن محمد الحرمي عن أبي نميلة عن سلام مولى حفص أبي القاسم عن أبي بريدة عن أبيه قال بينا نحن قعود على شراب لنا ونحن على رملة ونحن ثلاثه أو أربعة وعندنا باطية لنا ونحن نشرب الخمر حلا إذ قمت حتى آتي رسول الله صلى الله عليه وسلم فأسلم عليه إذ نزل تحريم الخمر يا أيها الذين آمنوا إنما الخمر والميسر إلى آخر الآيتين فهل أنتم منتهون فجئت إلى أصحابي فقرأتها عليهم إلى قوله فهل أنتم منتهون قال وبعض القوم شربته في يده قد ضرب بعضها وبقي بعض في الإناء فقال بالإناء تحت شفته العليا كما يفعل الحجام ثم صبوا ما في باطيتهم فقالوا انتهينا ربنا \"حديث آخر\" قال البخاري حدثا صدقة بن الفضل أخبرنا ابن عيينة عن عمرو عن جابر قال صبح أناس غداة أحد الخمر فقتلوا من يومهم جميعا شهداء وذلك قبل تحريمها هكذا رواه البخاري في تفسيره من صحيحه وقد رواه الحافظ أبو بكر البزار في مسنده حدثنا أحمد بن عبدة حدثنا سفيان عن عمرو بن دينار سمع جابر بن عبد الله يقول اصطبح ناس الخمر من أصحاب النبي صلى الله عليه وسلم ثم قتلوا شهداء يوم أحد فقالت اليهود فقد مات بعض الذين قتلوا وهي في بطونهم فأنزل الله ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا ثم قال هذا إسناد صحيح وهو كما قال ولكن في سياقه غرابة \"حديث آخر\" قال أبو داود الطيالسي حدثنا شعبة عن أبي إسحق عن البراء بن عازب قال لما نزل تحريم الخمر قالوا كيف بمن كان يشربها قبل أن تحرم؟ فنزلت ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا الآية ورواه الترمذي عن بندار عن غندر عن شعبة به نحوه وقال حسن صحيح \"حديث آخر قال الحافظ أبو يعلي الموصلي حدثنا جعفر بن حميد الكوفي حدثنا يعقوب القمي عن عيسى بن جارية عن جابر بن عبد الله قال كان رجل يحمل الخمر خيبر إلى المدينة فيبيعها من المسلمين فحمل منها بمال فقدم بها المدينة فلقيه رجل من المسلمين فقال يا فلان إن الخمر قد حرمت فوضعها حيث انتهى على تل وسجى عليها بأكسية ثم أتي النبي صلى الله عليه وسلم فقال يا رسول الله بلغني أن الخمر قد حرمت قال أجل قال لي أن أردها على من ابتعتها منه قال لا يصح ردها فقال لي أن أهديها إلى من يكافئني منها؟ قال لا قال فإن فيها مالا ليتامى في حجري قال إذ أتانا مال البحرين فأتنا نعوض أيتامك من مالهم ثم نادى بالمدينة فقال رجل يا رسول الله الأوعية تنتفع بها قال فحلوا أوكيتها فانصبت حتى استقرت في بطن الوادي هذا حديث غريب \" حديث آخر \"قال الإمام أحمد حدثنا وكيع حدثنا سفيان عن السدي عن أبي هبيرة وهو يحيى بن عباد الأنصاري عن أنس بن مالك أن أبا طلحة سأل رسول الله صلى الله عليه وسلم عن أيتام في حجره ورثوا خمرا فقال أهرقها قال أفلا نجعلها خلا ؟ قال لا ورواه مسلم وأبو داود والترمذي من حديث الثوري به نحوه \" حديث آخر \"قال ابن أبي حاتم حدثنا أبي حدثنا عبد الله بن رجاء حدثنا عبد العزيز بن سلمة حدثنا هلال بن أبي هلال عن عطاء بن يسار عن عبد الله بن عمرو قال إن هذه الآية التي في القرآن\" يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون\" قال هي في التوراة: إن الله أنزل الحق ليذهب به الباطل ويبطل به اللعب والمزامير والزفن والكبارات يعني البرابط والزمارات يعني به الدف والطنابير والشعر والخمر مرة لمن طعمها أقسم الله بيمينه وعزمه من شربها بعدما حرمتها لأعطشه يوم القيامة ومن تركها بعد ما حرمتها لأسقينه إياها في حظيرة القدس وهذا إسناد صحيح.\n\" حديث آخر \"قال عبد الله بن وهب أخبرني عمرو بن الحرث أن عمرو بن شعيب حدثهم عن أبيه عن عبد الله بن عمرو بن العاص عن رسول الله صلى الله عليه وسلم قال:\" من ترك الصلاة سكرا مرة واحدة فكأنما كانت له الدنيا وما عليها فسلبها ومن ترك الصلاة سكرا أربع مرات كان حقا على الله أن يسقيه من طينة الخبال\" قيل وما طينة الخبال؟ قال عصارة جهنم ورواه أحمد من طريق عمرو بن شعيب.\n\" حديث آخر \"قال أبو داود حدثنا محمد بن رافع حدثنا إبراهيم بن عمر الصنعاني قال سمعت النعمان هو ابن أبي شيبة الجندي يقول عن طاوس عن ابن عباس عن النبي صلى الله عليه وسلم قال كل مخمر خمر وكل مسكر حرام ومن شرب مسكرا بخست صلاته أربعين صباحا فإن تاب تاب الله عليه فإن عاد الرابعة كان حقا على الله أن يسقيه من طينة الخبال\" قيل وما طينة الخبال يا رسول الله؟ قال:\" صديد أهل النار ومن سقاه صغيرا لا يعرف حلاله من حرامه كان حقا على الله أن يسقيه من طينة الخبال\" تفرد أبو داود \" حديث آخر \"قال الشافعي- رحمه الله- أنبأنا مالك عن نافع عن ابن عمر أن رسول الله صلى الله عليه وسلم قال:\" من شرب الخمر فى الدنيا ثم لم يتب منها حرمها في الآخرة\" أخرجه البخاري ومسلم من حديث مالك به وروى مسلم عن أبي الربيع عن حماد بن زيد عن أيوب عن نافع عن ابن عمر قال: قال رسول الله صلى الله عليه وسلم:\" كل مسكر خمر وكل مسكر حرام ومن شرب الخمر فمات وهو يدمنها ولم يتب منها لم يشربها في الآخرة.\n\" حديث آخر \"قال ابن وهب اخبرني عمر بن محمد عن عبد الله بن يسار أنه سمع سالم بن عبد الله يقول قال عبد الله بن عمر قال رسول الله صلى الله عليه وسلم:\" ثلاثة لا ينظر الله إليهم يوم القيامة: العاق لوالديه والمدمن الخمر والمنان بما أعطى\" ورواه النسائي عن عمر بن علي عن يزيد بن زريع عن عمر بن محمد العمري به وروى أحمد عن غندر عن شعبة عن يزيد بن أبي زياد عن مجاهد عن أبي سعيد عن النبي صلى الله عليه وسلم قال:\" لا يدخل الجنة منان ولا عاق ولا مدمن خمر\" ورواه أحمد أيضا عن عبد الصمد عن عبد العزيز بن أسلم عن يزيد بن أبي زياد عن مجاهد به وعن مروان بن شجاع عن خصيف عن مجاهد به ورواه النسائي عن القاسم بن زكريا عن حصين الجعفي عن زائدة عن يزيد بن أبي زياد عن سالم بن أبي الجعد ومجاهد كلاهما عن أبي سعيد به \" حديث آخر \"قال الإمام أحمد حدثنا عبد الرزاق حدثنا سفيان عن منصور عن سالم بن أبي الجعد عن جابان عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال:\" لا يدخل الجنة عاق ولا مدمن خمر ولا منان ولا ولد زانية\" وكذا رواه عن يزيد عن همام عن منصور عن سالم عن جابان عن عبد الله بن عمرو به وقد رواه أيضا عن غندر وغيره عن شعبة عن منصور عن سالم عن نبيط بن شريط عن جابان عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال:\" لا يدخل الجنة منان ولا عاق والدية ولا مدمن خمر\" ورواه النسائي من حديث شعبة كذلك ثم قال: ولا نعلم أحدا تابع شعبة عن نبيط بن شريط وقال البخاري لا يعرف لجابان سماع من عبد الله ولا لسالم من جابان ولا نبيط وقد روى هذا الحديث من طريق مجاهد عن ابن عباس وعن طريقه أيضا عن أبي هريرة فالله أعلم.\nوقال الزهري حدثني أبو بكر بن عبد الرحمن بن الحارث بن هشام أن أباه قال سمعت عثمان بن عفان يقول اجتنبوا الخمر فإنها أم الخبائث إنه كان رجل فيمن خلا قبلكم يتعبد ويعتزل الناس فعلقته امرأة غوية فأرسلت إليه جاريتها أن تدعوه لشهادة فدخل معها فطفقت كلما دخل بابا أغلقته دونه حتى أفضى إلى امرأة وضيئة عندها غلام وباطية خمر فقالت إني والله ما دعوتك لشهادة ولكن دعوتك لتقع علي أو تقتل هذا الغلام أو تشرب هذا الخمر فسقته كأسا فقال زيدوني فلم يرم حتى وقع عليها وقتل النفس فاجتنبوا الخمر فإنها لا تجتمع هي والإيمان أبدا إلا أوشك أحدهما أن يخرج صاحبه\" رواه البيهقي وهذا إسناد صحيح وقد رواه أبو بكر بن أبي الدنيا في كتابه ذم المسكر عن محمد بن عبد الله بن بزيع عن الفضيل ابن سليمان النميري عن عمر بن سعيد عن الزهري به مرفوعا والموقوف أصح والله أعلم.\nوله شاهد في الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال:\" لا يزني الزاني حين يزني وهو مؤمن ولا يسرق سرقة حين يسرقها وهو مؤمن ولا يشرب الخمر حين يشربها وهو مؤمن\".\n                                    ",
        "qortoby": "وَأَطِيعُواْ ٱللَّهَ وَأَطِيعُواْ ٱلرَّسُولَ وَٱحۡذَرُواْۚ فَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّمَا عَلَىٰ رَسُولِنَا ٱلۡبَلَٰغُ ٱلۡمُبِينُ ٢٩\n                                    \n                                    \n                                    قوله تعالى : وأطيعوا الله وأطيعوا الرسول واحذروا تأكيد للتحريم ، وتشديد في الوعيد ، وامتثال للأمر ، وكف عن المنهي عنه ، وحسن عطف وأطيعوا الله لما كان في الكلام المتقدم معنى انتهوا ، وكرر وأطيعوا في ذكر الرسول تأكيدا . فإن توليتم أي : خالفتم . ثم حذر في مخالفة الأمر ، وتوعد من تولى بعذاب الآخرة ; فقال : فإن توليتم أي : خالفتم فإنما على رسولنا البلاغ المبين البلاغ في تحريم ما أمر بتحريمه وعلى المرسل أن يعاقب أو يثيب بحسب ما يعصى أو يطاع .\n                                    ",
        "saadi": "وَأَطِيعُواْ ٱللَّهَ وَأَطِيعُواْ ٱلرَّسُولَ وَٱحۡذَرُواْۚ فَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّمَا عَلَىٰ رَسُولِنَا ٱلۡبَلَٰغُ ٱلۡمُبِينُ ٢٩\n                                        \n                                        \n                                        \n                                        طاعة الله وطاعة رسوله واحدة، فمن أطاع الله، فقد أطاع الرسول، ومن أطاع الرسول فقد أطاع الله. وذلك شامل للقيام بما أمر الله به ورسوله من الأعمال، والأقوال الظاهرة والباطنة، الواجبة والمستحبة، المتعلقة بحقوق الله وحقوق خلقه والانتهاء عما نهى الله ورسوله عنه كذلك. وهذا الأمر أعم الأوامر، فإنه كما ترى يدخل فيه كل أمر ونهي، ظاهر وباطن، وقوله: { وَاحْذَرُوا } أي: من معصية الله ومعصية رسوله، فإن في ذلك الشر والخسران المبين. { فَإِنْ تَوَلَّيْتُمْ } عما أمرتم به ونهيتم عنه. { فَاعْلَمُوا أَنَّمَا عَلَى رَسُولِنَا الْبَلَاغُ الْمُبِينُ } وقد أدى ذلك. فإن اهتديتم فلأنفسكم، وإن أسأتم فعليها، والله هو الذي يحاسبكم، والرسول قد أدى ما عليه وما حمل به.\n                                    "
      },
      "originalText": "وَأَطِيعُواْ ٱللَّهَ وَأَطِيعُواْ ٱلرَّسُولَ وَٱحۡذَرُواْۚ فَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّمَا عَلَىٰ رَسُولِنَا ٱلۡبَلَٰغُ ٱلۡمُبِينُ ٢٩"
    },
    {
      "number": 762,
      "text": "لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوْا وَآمَنُوا وَعَمِلُوا الصَّالِحَاتِ ثُمَّ اتَّقَوْا وَآمَنُوا ثُمَّ اتَّقَوْا وَأَحْسَنُوا ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 93,
      "juz": 7,
      "manzil": 2,
      "page": 123,
      "ruku": 97,
      "hizbQuarter": 49,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَيۡسَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جُنَاحٞ فِيمَا طَعِمُوٓاْ إِذَا مَا ٱتَّقَواْ وَّءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ ثُمَّ ٱتَّقَواْ وَّءَامَنُواْ ثُمَّ ٱتَّقَواْ وَّأَحۡسَنُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ ٣٩\n                                    \n                                    \n                                    قال أحمد بن حنبل حدثنا أسود بن عامر حدثنا إسرائيل عن سماك عن عكرمة عن ابن عياش قال لما حرمت الخمر قال ناس يا رسول الله أصحابنا الذين ماتوا وهم يشربونها فأنزل الله\" ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا\" إلى آخر الآية ولما حولت القبلة قال ناس: يا رسول الله إخواننا الذين ما توا وهم يصلون إلى بيت المقدس فأنزل الله\" وما كان الله ليضيع إيمانكم\" وقال الإمام أحمد حدثنا داود بن مهران الدباغ حدثنا داود يعني العطار عن أبي خيثم عن شهر بن حوشب عن أسماء بنت يزيد أنها سمعت النبي صلى الله عليه وسلم يقول:\" من شرب الخمر لم يرض الله عنه أربعين ليلة إن مات مات كافرا وإن تاب تاب الله عليه وإن عاد كان حقا على الله أن يسقيه من طينة الخبال\" قالت: قلت يا رسول الله وما طينة الخبال ؟ قال:\" صديد أهل النار \" وقال الأعمش عن إبراهيم عن علقمة عن عبد الله بن مسعود أن النبي صلى الله عليه وسلم قال: لما نزلت\" ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا\" فقال النبي صلى الله عليه وسلم قيل لي أنت منهم وهكذا رواه مسلم والترمذي والنسائي من طريقه وقال عبد الله ابن الإمام أحمد قرأت على أبي حدثنا علي بن عاصم حدثنا إبراهيم الهجري عن أبي الأحوص عن عبد الله بن مسعود قال: قال رسول الله صلى الله عليه وسلم:\" إياكم وهاتان الكعبتان الموسومتان اللتان تزجران زجرا فإنهما ميسر العجم.\n                                    ",
        "qortoby": "لَيۡسَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جُنَاحٞ فِيمَا طَعِمُوٓاْ إِذَا مَا ٱتَّقَواْ وَّءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ ثُمَّ ٱتَّقَواْ وَّءَامَنُواْ ثُمَّ ٱتَّقَواْ وَّأَحۡسَنُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ ٣٩\n                                    \n                                    \n                                    قوله تعالى : ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا وعملوا الصالحات ثم اتقوا وآمنوا ثم اتقوا وأحسنوا والله يحب المحسنين\nفيه تسع مسائل :\nالأولى : قال ابن عباس والبراء بن عازب وأنس بن مالك إنه لما نزل تحريم الخمر قال قوم من الصحابة : كيف بمن مات منا وهو يشربها ويأكل الميسر ؟ - ونحو هذا - فنزلت الآية . روى البخاري عن أنس قال : كنت ساقي القوم في منزل أبي طلحة فنزل تحريم الخمر ، فأمر مناديا ينادي ، فقال أبو طلحة : اخرج فانظر ما هذا الصوت ! قال : فخرجت فقلت : هذا مناد ينادي ألا إن الخمر قد حرمت ; فقال : اذهب فأهرقها - وكان الخمر من الفضيخ - قال : فجرت في سكك المدينة ; فقال بعض القوم : قتل قوم وهي في بطونهم فأنزل الله عز وجل : ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا الآية .\nالثانية : هذه الآية وهذا الحديث نظير سؤالهم عمن مات إلى القبلة الأولى فنزلت وما كان الله ليضيع إيمانكم ومن فعل ما أبيح له حتى مات على فعله لم يكن له ولا عليه شيء ; لا إثم ولا مؤاخذة ولا ذم ولا أجر ولا مدح ; لأن المباح مستوي الطرفين بالنسبة إلى الشرع ; وعلى هذا فما كان ينبغي أن يتخوف ولا يسأل عن حال من مات والخمر في بطنه وقت إباحتها ، فإما أن يكون ذلك القائل غفل عن دليل الإباحة فلم يخطر له ، أو يكون لغلبة خوفه من الله تعالى ، وشفقته على إخوانه المؤمنين توهم مؤاخذة ومعاقبة لأجل شرب الخمر المتقدم ; فرفع الله ذلك التوهم بقوله : ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا الآية .\nالثالثة : هذا الحديث في نزول الآية فيه دليل واضح على أن نبيذ التمر إذا أسكر خمر ; وهو نص ولا يجوز الاعتراض عليه ; لأن الصحابة رحمهم الله هم أهل اللسان ، وقد عقلوا أن شرابهم ذلك خمر إذ لم يكن لهم شراب ذلك الوقت بالمدينة غيره ; وقد قال الحكمي :\nلنا خمر وليست خمر كرم ولكن من نتاج الباسقات كرام في السماء ذهبن طولا\nوفات ثمارها أيدي الجناة\nومن الدليل الواضح على ذلك ما رواه النسائي : أخبرنا القاسم بن زكريا ، أخبرنا عبيد الله عن شيبان عن الأعمش عن محارب بن دثار عن جابر عن النبي صلى الله عليه وسلم قال : الزبيب والتمر هو الخمر ، وثبت بالنقل الصحيح أن عمر بن الخطاب رضي الله عنه - وحسبك به عالما باللسان والشرع - خطب على منبر النبي صلى الله عليه وسلم فقال : يا أيها الناس ; ألا إنه قد نزل تحريم الخمر يوم نزل ، وهي من خمسة : من العنب والتمر والعسل والحنطة والشعير ; والخمر ما خامر العقل ، وهذا أبين ما يكون في معنى الخمر ; يخطب به عمر بالمدينة على المنبر بمحضر جماعة الصحابة ، وهم أهل اللسان ولم يفهموا من الخمر إلا ما ذكرناه . وإذا ثبت هذا بطل مذهب أبي حنيفة والكوفيين القائلين بأن الخمر لا تكون إلا من العنب ، وما كان من غيره لا يسمى خمرا ولا يتناوله اسم الخمر ، وإنما يسمى نبيذا ; وقال الشاعر :\nتركت النبيذ لأهل النبيذ وصرت حليفا لمن عابه\nشراب يدنس عرض الفتى ويفتح للشر أبوابه\nالرابعة : قال الإمام أبو عبد الله المازري : ذهب جمهور العلماء من السلف وغيرهم إلى أن كل ما يسكر نوعه حرم شربه ، قليلا كان أو كثيرا ، نيئا كان أو مطبوخا ، ولا فرق بين المستخرج من العنب أو غيره ، وأن من شرب شيئا من ذلك حد ; فأما المستخرج من العنب المسكر النيء فهو الذي انعقد الإجماع على تحريم قليله وكثيره ولو نقطة منه ، وأما ما عدا ذلك فالجمهور على تحريمه ، وخالف الكوفيون في القليل مما عدا ما ذكر ، وهو الذي لا يبلغ الإسكار ; وفي المطبوخ المستخرج من العنب ; فذهب قوم من أهل البصرة إلى قصر التحريم على عصير العنب ، ونقيع الزبيب النيء ; فأما المطبوخ منهما ، والنيء والمطبوخ مما سواهما فحلال ما لم يقع الإسكار ، وذهب أبو حنيفة إلى قصر التحريم على المعتصر من ثمرات النخيل والأعناب على تفصيل ; فيرى أن سلافة العنب يحرم قليلها وكثيرها إلا أن تطبخ حتى ينقص ثلثاها ، وأما نقيع الزبيب والتمر فيحل مطبوخهما وإن مسته النار مسا قليلا من غير اعتبار بحد ; وأما النيء منه فحرام ، ولكنه مع تحريمه إياه لا يوجب الحد فيه ; وهذا كله ما لم يقع الإسكار ، فإن وقع الإسكار استوى الجميع . قال شيخنا الفقيه الإمام أبو العباس أحمد رضي الله عنه : العجب من المخالفين في هذه المسألة ; فإنهم قالوا : إن القليل من الخمر المعتصر من العنب حرام ككثيره ، وهو مجمع عليه ; فإذا قيل لهم : فلم حرم القليل من الخمر وليس مذهبا للعقل ؟ فلا بد أن يقال : لأنه داعية إلى الكثير ، أو للتعبد ; فحينئذ يقال لهم : كل ما قدرتموه في قليل الخمر هو بعينه موجود في قليل النبيذ فيحرم أيضا ، إذ لا فارق بينهما إلا مجرد الاسم إذا سلم ذلك . وهذا القياس هو أرفع أنواع القياس ; لأن الفرع فيه مساو للأصل في جميع أوصافه ; وهذا كما يقول في قياس الأمة على العبد في سراية العتق . ثم العجب من أبي حنيفة وأصحابه رحمهم الله ! فإنهم يتوغلون في القياس ويرجحونه على أخبار الآحاد ، ومع ذلك فقد تركوا هذا القياس الجلي المعضود بالكتاب والسنة وإجماع صدور الأمة ، لأحاديث لا يصح شيء منها على ما قد بين عللها المحدثون في كتبهم ، وليس في الصحاح شيء منها . وسيأتي في سورة \" النحل \" تمام هذه المسألة إن شاء الله تعالى .\nالخامسة : قوله تعالى : طعموا أصل هذه اللفظة في الأكل ; يقال : طعم الطعام وشرب الشراب ، لكن قد تجوز في ذلك فيقال : لم أطعم خبزا ولا ماء ولا نوما ; قال الشاعر :\nنعاما بوجرة صعر الخدو د لا تطعم النوم إلا صياما\nوقد تقدم القول في \" البقرة \" في قوله تعالى : ومن لم يطعمه بما فيه الكفاية . السادسة : قال ابن خويز منداد : تضمنت هذه الآية تناول المباح والشهوات ، والانتفاع بكل لذيذ من مطعم ومشرب ومنكح وإن بولغ فيه وتنوهي في ثمنه . وهذه الآية نظير قوله تعالى : لا تحرموا طيبات ما أحل الله لكم ونظير قوله : قل من حرم زينة الله التي أخرج لعباده والطيبات من الرزق\nالسابعة : قوله تعالى : إذا ما اتقوا وآمنوا وعملوا الصالحات ثم اتقوا وآمنوا ثم اتقوا وأحسنوا والله يحب المحسنين فيه أربعة أقوال : الأول : أنه ليس في ذكر التقوى تكرار ; والمعنى اتقوا شربها ، وآمنوا بتحريمها ; والمعنى الثاني دام اتقاؤهم وإيمانهم ; والثالث على معنى الإحسان إلى الاتقاء ، والثاني : اتقوا قبل التحريم في غيرها من المحرمات ، ثم اتقوا بعد تحريمها شربها ، ثم اتقوا فيما بقي من أعمالهم ، وأحسنوا العمل . الثالث : اتقوا الشرك وآمنوا بالله ورسوله ، والمعنى الثاني ثم اتقوا الكبائر ، وازدادوا إيمانا ، والمعنى الثالث ثم اتقوا الصغائر وأحسنوا أي : تنفلوا ، وقال محمد بن جرير : الاتقاء الأول هو الاتقاء بتلقي أمر الله بالقبول ، والتصديق والدينونة به والعمل ، والاتقاء الثاني الاتقاء بالثبات على التصديق ، والثالث الاتقاء بالإحسان ، والتقرب بالنوافل .\nالثامنة : قوله تعالى : ثم اتقوا وأحسنوا والله يحب المحسنين دليل على أن المتقي المحسن أفضل من المتقي المؤمن الذي عمل الصالحات ; فضله بأجر الإحسان .\nالتاسعة : قد تأول هذه الآية قدامة بن مظعون الجمحي من الصحابة رضي الله عنهم ، وهو ممن هاجر إلى أرض الحبشة مع أخويه عثمان وعبد الله ، ثم هاجر إلى المدينة وشهد بدرا وعمر ، وكان ختن عمر بن الخطاب ، خال عبد الله وحفصة ، وولاه عمر بن الخطاب على البحرين ، ثم عزله بشهادة الجارود - سيد عبد القيس - عليه بشرب الخمر . روى الدارقطني قال : حدثنا أبو الحسن علي بن محمد المصري ، حدثنا يحيى بن أيوب العلاف ، حدثني سعيد بن عفير ، حدثني يحيى بن فليح بن سليمان ، قال : حدثني ثور بن زيد عن عكرمة عن ابن عباس : أن الشراب كانوا يضربون في عهد رسول الله صلى الله عليه وسلم بالأيدي والنعال والعصي حتى توفي رسول الله صلى الله عليه وسلم ، فكانوا في خلافة أبي بكر أكثر منهم في عهد رسول الله صلى الله عليه وسلم ، فكان أبو بكر يجلدهم أربعين حتى توفي ، ثم كان عمر من بعده يجلدهم كذلك أربعين حتى أتي برجل من المهاجرين الأولين وقد شرب فأمر به أن يجلد ; قال : لم تجلدني ؟ بيني وبينك كتاب الله ! فقال عمر : وفي أي كتاب الله تجد ألا أجلدك ؟ فقال له : إن الله تعالى يقول في كتابه : ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا الآية . فأنا من الذين آمنوا وعملوا الصالحات ، ثم اتقوا وآمنوا ، ثم اتقوا وأحسنوا ; شهدت مع رسول الله صلى الله عليه وسلم بدرا وأحدا والخندق والمشاهد كلها ; فقال عمر : ألا تردون عليه ما يقول ; فقال ابن عباس : إن هؤلاء الآيات أنزلت عذرا لمن غبر ، وحجة على الناس ; لأن الله تعالى يقول : يا أيها الذين آمنوا إنما الخمر والميسر الآية ; ثم قرأ حتى أنفذ الآية الأخرى ; فإن كان من الذين آمنوا وعملوا الصالحات ، الآية ; فإن الله قد نهاه أن يشرب الخمر ; فقال عمر : صدقت ماذا ترون ؟ فقال علي رضي الله عنه : إنه إذا شرب سكر وإذا سكر هذى ، وإذا هذى افترى ، وعلى المفتري ثمانون جلدة ; فأمر به عمر فجلد ثمانين جلدة ، وذكر الحميدي عن أبي بكر البرقاني عن ابن عباس قال : لما قدم الجارود من البحرين قال : يا أمير المؤمنين إن قدامة بن مظعون قد شرب مسكرا ، وإني إذا رأيت حقا من حقوق الله حق علي أن أرفعه إليك ; فقال عمر : من يشهد على ما تقول ؟ فقال : أبو هريرة ; فدعا عمر أبا هريرة فقال : علام تشهد يا أبا هريرة ؟ فقال : لم أره حين شرب ، ورأيته سكران يقيء ، فقال عمر : لقد تنطعت في الشهادة ; ثم كتب عمر إلى قدامة وهو بالبحرين يأمره بالقدوم عليه ، فلما قدم قدامة والجارود بالمدينة كلم الجارود عمر ; فقال : أقم على هذا كتاب الله ; فقال عمر للجارود : أشهيد أنت أم خصم ؟ فقال الجارود : أنا شهيد ; قال : قد كنت أديت الشهادة ; ثم قال لعمر : إني أنشدك الله ! فقال عمر : أما والله لتملكن لسانك أو لأسوءنك ; فقال الجارود : أما والله ما ذلك بالحق ، أن يشرب ابن عمك وتسوءني ! فأوعده عمر ; فقال أبو هريرة وهو جالس : يا أمير المؤمنين إن كنت في شك من شهادتنا فسل بنت الوليد امرأة ابن مظعون ، فأرسل عمر إلى هند ينشدها بالله ، فأقامت هند على زوجها الشهادة ; فقال عمر : يا قدامة إني جالدك ; فقال قدامة : والله لو شربت - كما يقولون - ما كان لك أن تجلدني يا عمر . قال : ولم يا قدامة ؟ قال : لأن الله سبحانه يقول : ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا . الآية ، إلى المحسنين . فقال عمر : أخطأت التأويل يا قدامة ; إذا اتقيت الله اجتنبت ما حرم الله ، ثم أقبل عمر على القوم فقال : ما ترون في جلد قدامة ؟ فقال القوم : لا نرى أن تجلده ما دام وجعا ; فسكت عمر عن جلده ثم أصبح يوما فقال لأصحابه : ما ترون في جلد قدامة ؟ فقال القوم : لا نرى أن تجلده ما دام وجعا ، فقال عمر : إنه والله لأن يلقى الله تحت السوط ، أحب إلي أن ألقى الله وهو في عنقي ! والله لأجلدنه ; ائتوني بسوط ، فجاءه مولاه أسلم بسوط رقيق صغير ، فأخذه عمر فمسحه بيده ثم قال لأسلم : أخذتك دقرارة أهلك ; ائتوني بسوط غير هذا . قال : فجاءه أسلم بسوط تام ; فأمر عمر بقدامة فجلد ; فغاضب قدامة عمر وهجره ; فحجا وقدامة مهاجر لعمر حتى قفلوا عن حجهم ونزل عمر بالسقيا ونام بها فلما استيقظ عمر قال : عجلوا علي بقدامة ، انطلقوا فأتوني به ، فوالله لأرى في النوم أنه جاءني آت فقال : سالم قدامة فإنه أخوك ، فلما جاءوا قدامة أبى أن يأتيه ، فأمر عمر بقدامة أن يجر إليه جرا حتى كلمه عمر واستغفر له ، فكان أول صلحهما . قال أيوب بن أبي تميمة : لم يحد أحد من أهل بدر في الخمر غيره . قال ابن العربي : فهذا يدلك على تأويل الآية ، وما ذكر فيه عن ابن عباس من حديث الدارقطني ، وعمر في حديث البرقاني وهو صحيح ; وبسطه أنه لو كان من شرب الخمر واتقى الله في غيره ما حد على الخمر أحد ، فكان هذا من أفسد تأويل ; وقد خفي على قدامة ; وعرفه من وفقه الله كعمر وابن عباس رضي الله عنهما ; قال الشاعر :\nوإن حراما لا أرى الدهر باكيا على شجوه إلا بكيت على عمر\nوروي عن علي رضي الله عنه أن قوما شربوا بالشام وقالوا : هي لنا حلال وتأولوا هذه الآية ، فأجمع علي وعمر على أن يستتابوا ، فإن تابوا وإلا قتلوا ; ذكره إلكيا الطبري .\n                                    ",
        "saadi": "لَيۡسَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جُنَاحٞ فِيمَا طَعِمُوٓاْ إِذَا مَا ٱتَّقَواْ وَّءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ ثُمَّ ٱتَّقَواْ وَّءَامَنُواْ ثُمَّ ٱتَّقَواْ وَّأَحۡسَنُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ ٣٩\n                                        \n                                        \n                                        \n                                        لما نزل تحريم الخمر والنهي الأكيد والتشديد فيه، تمنى أناس من المؤمنين أن يعلموا حال إخوانهم الذين ماتوا على الإسلام قبل تحريم الخمر وهم يشربونها. فأنزل الله هذه الآية، وأخبر تعالى أنه { لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ } أي: حرج وإثم { فِيمَا طَعِمُوا } من الخمر والميسر قبل تحريمهما. ولما كان نفي الجناح يشمل المذكورات وغيرها، قيد ذلك بقوله: { إِذَا مَا اتَّقَوْا وَآمَنُوا وَعَمِلُوا الصَّالِحَاتِ } أي: بشرط أنهم تاركون للمعاصي، مؤمنون بالله إيمانا صحيحا، موجبا لهم عمل الصالحات، ثم استمروا على ذلك. وإلا فقد يتصف العبد بذلك في وقت دون آخر. فلا يكفي حتى يكون كذلك حتى يأتيه أجله، ويدوم على إحسانه، فإن الله يحب المحسنين في عبادة الخالق، المحسنين في نفع العبيد، ويدخل في هذه الآية الكريمة، من طعم المحرم، أو فعل غيره بعد التحريم، ثم اعترف بذنبه وتاب إلى الله، واتقى وآمن وعمل صالحا، فإن الله يغفر له، ويرتفع عنه الإثم في ذلك.\n                                    "
      },
      "originalText": "لَيۡسَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جُنَاحٞ فِيمَا طَعِمُوٓاْ إِذَا مَا ٱتَّقَواْ وَّءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ ثُمَّ ٱتَّقَواْ وَّءَامَنُواْ ثُمَّ ٱتَّقَواْ وَّأَحۡسَنُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ ٣٩"
    },
    {
      "number": 763,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَيَبْلُوَنَّكُمُ اللَّهُ بِشَيْءٍ مِنَ الصَّيْدِ تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ لِيَعْلَمَ اللَّهُ مَنْ يَخَافُهُ بِالْغَيْبِ ۚ فَمَنِ اعْتَدَىٰ بَعْدَ ذَٰلِكَ فَلَهُ عَذَابٌ أَلِيمٌ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 94,
      "juz": 7,
      "manzil": 2,
      "page": 123,
      "ruku": 98,
      "hizbQuarter": 49,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَيَبۡلُوَنَّكُمُ ٱللَّهُ بِشَيۡءٖ مِّنَ ٱلصَّيۡدِ تَنَالُهُۥٓ أَيۡدِيكُمۡ وَرِمَاحُكُمۡ لِيَعۡلَمَ ٱللَّهُ مَن يَخَافُهُۥ بِٱلۡغَيۡبِۚ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ ٤٩\n                                    \n                                    \n                                    قال الوالبي ، عن ابن عباس قوله : ( ليبلونكم الله بشيء من الصيد تناله أيديكم ورماحكم ) قال : هو الضعيف من الصيد وصغيره ، يبتلي الله به عباده في إحرامهم ، حتى لو شاءوا يتناولونه بأيديهم . فنهاهم الله أن يقربوه .\nوقال مجاهد : ( تناله أيديكم ) يعني : صغار الصيد وفراخه ) ورماحكم ) يعني : كباره .\nوقال مقاتل بن حيان : أنزلت هذه الآية في عمرة الحديبية ، فكانت الوحش والطير والصيد تغشاهم في رحالهم ، لم يروا مثله قط فيما خلا فنهاهم الله عن قتله وهم محرمون .\n( ليعلم الله من يخافه بالغيب ) يعني : أنه تعالى يبتليهم بالصيد يغشاهم في رحالهم ، يتمكنون من أخذه بالأيدي والرماح سرا وجهرا ليظهر طاعة من يطيع منهم في سره وجهره ، كما قال تعالى : ( إن الذين يخشون ربهم بالغيب لهم مغفرة وأجر كبير ) [ الملك : 12 ] .\nوقوله هاهنا : ( فمن اعتدى بعد ذلك ) قال السدي وغيره : يعني بعد هذا الإعلام والإنذار والتقدم ( فله عذاب أليم ) أي : لمخالفته أمر الله وشرعه .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَيَبۡلُوَنَّكُمُ ٱللَّهُ بِشَيۡءٖ مِّنَ ٱلصَّيۡدِ تَنَالُهُۥٓ أَيۡدِيكُمۡ وَرِمَاحُكُمۡ لِيَعۡلَمَ ٱللَّهُ مَن يَخَافُهُۥ بِٱلۡغَيۡبِۚ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ ٤٩\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا ليبلونكم الله بشيء من الصيد تناله أيديكم ورماحكم ليعلم الله من يخافه بالغيب فمن اعتدى بعد ذلك فله عذاب أليم .\nفيه ثمان مسائل :\nالأولى : قوله تعالى : ليبلونكم الله أي : ليختبرنكم ، والابتلاء الاختبار ، وكان الصيد أحد معايش العرب العاربة ، وشائعا عند الجميع منهم ، مستعملا جدا ، فابتلاهم الله فيه مع الإحرام والحرم ، كما ابتلى بني إسرائيل في ألا يعتدوا في السبت ، وقيل : إنها نزلت عام الحديبية ; أحرم بعض الناس مع النبي صلى الله عليه وسلم ولم يحرم بعضهم ، فكان إذا عرض صيد اختلف فيه أحوالهم وأفعالهم ، واشتبهت أحكامه عليهم ، فأنزل الله هذه الآية بيانا لأحكام أحوالهم وأفعالهم ، ومحظورات حجهم وعمرتهم .\nالثانية : اختلف العلماء من المخاطب بهذه الآية على قولين : أحدهما : أنهم المحلون ; قاله مالك . الثاني : أنهم المحرمون قاله ابن عباس ; وتعلق بقوله تعالى : ليبلونكم فإن تكليف الامتناع الذي يتحقق به الابتلاء هو مع الإحرام . قال ابن العربي : وهذا لا يلزم ; فإن التكليف يتحقق في المحل بما شرط له من أمور الصيد ، وما شرع له من وصفه في كيفية الاصطياد ، والصحيح أن الخطاب في الآية لجميع الناس محلهم ومحرمهم ; لقوله تعالى : ليبلونكم الله أي : : ليكلفنكم ، والتكليف كله ابتلاء وإن تفاضل في الكثرة والقلة ، وتباين في الضعف والشدة .\nالثالثة : قوله تعالى : بشيء من الصيد يريد ببعض الصيد ، فمن للتبعيض ، وهو صيد البر خاصة ; ولم يعم الصيد كله لأن للبحر صيدا ، قاله الطبري وغيره ، وأراد بالصيد المصيد ; لقوله : تناله أيديكم .\nالرابعة : قوله تعالى : تناله أيديكم ورماحكم بيان لحكم صغار الصيد وكباره .\nوقرأ ابن وثاب والنخعي : \" يناله \" بالياء منقوطة من تحت . قال مجاهد : الأيدي تنال الفراخ والبيض وما لا يستطيع أن يفر ، والرماح تنال كبار الصيد ، وقال ابن وهب قال مالك قال الله تعالى : يا أيها الذين آمنوا ليبلونكم الله بشيء من الصيد تناله أيديكم ورماحكم وكل شيء يناله الإنسان بيده أو برمحه أو بشيء من سلاحه فقتله فهو صيد كما قال الله تعالى .\nالخامسة : خص الله تعالى الأيدي بالذكر لأنها عظم التصرف في الاصطياد ; وفيها تدخل الجوارح والحبالات ، وما عمل باليد من فخاخ وشباك ; وخص الرماح بالذكر لأنها عظم ما يجرح به الصيد ، وفيها يدخل السهم ونحوه ; وقد مضى القول فيما يصاد به من الجوارح والسهام في أول السورة بما فيه الكفاية والحمد لله .\nالسادسة : ما وقع في الفخ والحبالة فلربها ، فإن ألجأ الصيد إليها أحد ولولاها لم يتهيأ له أخذه فربها فيه شريكه ، وما وقع في الجبح المنصوب في الجبل من ذباب النحل فهو كالحبالة والفخ ، وحمام الأبرجة ترد على أربابها إن استطيع ذلك ، وكذلك نحل الجباح ; وقد روي عن مالك ، وقال بعض أصحابه : إنه ليس على من حصل الحمام أو النحل عنده أن يرده ، ولو ألجأت الكلاب صيدا فدخل في بيت أحد أو داره فهو للصائد مرسل الكلاب دون صاحب البيت ، ولو دخل في البيت من غير اضطرار الكلاب له فهو لرب البيت .\nالسابعة : احتج بعض الناس على أن الصيد للآخذ لا للمثير بهذه الآية ; لأن المثير لم تنل يده ولا رمحه بعد شيئا ، وهو قول أبي حنيفة .\nالثامنة : كره مالك صيد أهل الكتاب ولم يحرمه ، لقوله تعالى : تناله أيديكم ورماحكم يعني أهل الإيمان ، لقوله تعالى في صدر الآية : يا أيها الذين آمنوا فخرج عنهم أهل الكتاب ، وخالفه جمهور أهل العلم ، لقوله تعالى : يا أيها الذين آمنوا وهو عندهم مثل ذبائحهم ، وأجاب علماؤنا بأن الآية إنما تضمنت أكل طعامهم ، والصيد باب آخر فلا يدخل في عموم الطعام ، ولا يتناوله مطلق لفظه .\nقلت : هذا بناء على أن الصيد ليس مشروعا عندهم فلا يكون من طعامهم ، فيسقط عنا هذا الإلزام ; فأما إن كان مشروعا عندهم في دينهم فيلزمنا أكله لتناول اللفظ له ، فإنه من طعامهم ، والله أعلم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَيَبۡلُوَنَّكُمُ ٱللَّهُ بِشَيۡءٖ مِّنَ ٱلصَّيۡدِ تَنَالُهُۥٓ أَيۡدِيكُمۡ وَرِمَاحُكُمۡ لِيَعۡلَمَ ٱللَّهُ مَن يَخَافُهُۥ بِٱلۡغَيۡبِۚ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ ٤٩\n                                        \n                                        \n                                        \n                                        هذا من منن الله على عباده، أن أخبرهم بما سيفعل قضاء وقدرا، ليطيعوه ويقدموا على بصيرة، ويهلك من هلك عن بينة، ويحيا من حي عن بينة، فقال تعالى: { يَا أَيُّهَا الَّذِينَ آمَنُوا } لابد أن يختبر الله إيمانكم. { لَيَبْلُوَنَّكُمُ اللَّهُ بِشَيْءٍ مِنَ الصَّيْدِ } أي: بشيء غير كثير، فتكون محنة يسيرة، تخفيفا منه تعالى ولطفا، وذلك الصيد الذي يبتليكم الله به { تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ } أي: تتمكنون من صيده، ليتم بذلك الابتلاء، لا غير مقدور عليه بيد ولا رمح، فلا يبقى للابتلاء فائدة. ثم ذكر الحكمة في ذلك الابتلاء، فقال: { لِيَعْلَمَ اللَّهُ } علما ظاهرا للخلق يترتب عليه الثواب والعقاب { مَنْ يَخَافُهُ بِالْغَيْبِ } فيكف عما نهى الله عنه مع قدرته عليه وتمكنه، فيثيبه الثواب الجزيل، ممن لا يخافه بالغيب، فلا يرتدع عن معصية تعرض له فيصطاد ما تمكن منه { فَمَنِ اعْتَدَى } منكم { بَعْدِ ذَلِكَ } البيان، الذي قطع الحجج، وأوضح السبيل. { فَلَهُ عَذَابٌ أَلِيمٌ } أي: مؤلم موجع، لا يقدر على وصفه إلا الله، لأنه لا عذر لذلك المعتدي، والاعتبار بمن يخافه بالغيب، وعدم حضور الناس عنده. وأما إظهار مخافة الله عند الناس، فقد يكون ذلك لأجل مخافة الناس، فلا يثاب على ذلك.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَيَبۡلُوَنَّكُمُ ٱللَّهُ بِشَيۡءٖ مِّنَ ٱلصَّيۡدِ تَنَالُهُۥٓ أَيۡدِيكُمۡ وَرِمَاحُكُمۡ لِيَعۡلَمَ ٱللَّهُ مَن يَخَافُهُۥ بِٱلۡغَيۡبِۚ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ ٤٩"
    },
    {
      "number": 764,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْتُلُوا الصَّيْدَ وَأَنْتُمْ حُرُمٌ ۚ وَمَنْ قَتَلَهُ مِنْكُمْ مُتَعَمِّدًا فَجَزَاءٌ مِثْلُ مَا قَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِنْكُمْ هَدْيًا بَالِغَ الْكَعْبَةِ أَوْ كَفَّارَةٌ طَعَامُ مَسَاكِينَ أَوْ عَدْلُ ذَٰلِكَ صِيَامًا لِيَذُوقَ وَبَالَ أَمْرِهِ ۗ عَفَا اللَّهُ عَمَّا سَلَفَ ۚ وَمَنْ عَادَ فَيَنْتَقِمُ اللَّهُ مِنْهُ ۗ وَاللَّهُ عَزِيزٌ ذُو انْتِقَامٍ",
      "surah": {
        "number": 5,
        "name": "سورة المائدة",
        "englishName": "Al-Maaida",
        "englishNameTranslation": "The Table",
        "revelationType": "Medinan",
        "numberOfAyahs": 120
      },
      "numberInSurah": 95,
      "juz": 7,
      "manzil": 2,
      "page": 123,
      "ruku": 98,
      "hizbQuarter": 49,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡتُلُواْ ٱلصَّيۡدَ وَأَنتُمۡ حُرُمٞۚ وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدٗا فَجَزَآءٞ مِّثۡلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ يَحۡكُمُ بِهِۦ ذَوَا عَدۡلٖ مِّنكُمۡ هَدۡيَۢا بَٰلِغَ ٱلۡكَعۡبَةِ أَوۡ كَفَّٰرَةٞ طَعَامُ مَسَٰكِينَ أَوۡ عَدۡلُ ذَٰلِكَ صِيَامٗا لِّيَذُوقَ وَبَالَ أَمۡرِهِۦۗ عَفَا ٱللَّهُ عَمَّا سَلَفَۚ وَمَنۡ عَادَ فَيَنتَقِمُ ٱللَّهُ مِنۡهُۚ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ ٥٩\n                                    \n                                    \n                                    ثم قال تعالى : ( يا أيها الذين آمنوا لا تقتلوا الصيد وأنتم حرم ) وهذا تحريم منه تعالى لقتل الصيد في حال الإحرام ، ونهي عن تعاطيه فيه . وهذا إنما يتناول من حيث المعنى المأكول وما يتولد منه ومن غيره ، فأما غير المأكول من حيوانات البر ، فعند الشافعي يجوز للمحرم قتلها . والجمهور على تحريم قتلها أيضا ، ولا يستثنى من ذلك إلا ما ثبت في الصحيحين من طريق الزهري ، عن عروة ، عن عائشة أم المؤمنين ; أن رسول الله صلى الله عليه وسلم قال : \" خمس فواسق يقتلن في الحل والحرم : الغراب ، والحدأة ، والعقرب ، والفأرة ، والكلب العقور \" .\nوقال مالك ، عن نافع ، عن ابن عمر ; أن رسول الله صلى الله عليه وسلم قال : \" خمس من الدواب ليس على المحرم في قتلهن جناح : الغراب ، والحدأة ، والعقرب ، والفأرة ، والكلب العقور \" . أخرجاه .\nورواه أيوب ، عن نافع ، عن ابن عمر ، مثله . قال أيوب ، قلت لنافع : فالحية؟ قال : الحية لا شك فيها ، ولا يختلف في قتلها .\nومن العلماء - كمالك وأحمد - من ألحق بالكلب العقور الذئب ، والسبع ، والنمر ، والفهد ; لأنها أشد ضررا منه ، فالله أعلم . وقال سفيان بن عيينة وزيد بن أسلم : الكلب العقور يشمل هذه السباع العادية كلها . واستأنس من قال بهذا بما روي أن رسول الله صلى الله عليه وسلم لما دعا على عتبة بن أبي لهب قال : \" اللهم سلط عليه كلبك بالشام \" فأكله السبع بالزرقاء ، قالوا : فإن قتل ما عداهن فداها كالضبع والثعلب وهر البر ونحو ذلك .\nقال مالك : وكذا يستثنى من ذلك صغار هذه الخمس المنصوص عليها ، وصغار الملحق بها من السباع العوادي .\nوقال الشافعي [ رحمه الله ] يجوز للمحرم قتل كل ما لا يؤكل لحمه ، ولا فرق بين صغاره وكباره . وجعل العلة الجامعة كونها لا تؤكل .\nوقال أبو حنيفة : يقتل المحرم الكلب العقور والذئب ; لأنه كلب بري ، فإن قتل غيرهما فداه ، إلا أن يصول عليه سبع غيرهما فيقتله فلا فداء عليه . وهذا قول الأوزاعي والحسن بن صالح بن حيي .\nوقال زفر بن الهذيل : يفدي ما سوى ذلك وإن صال عليه .\nوقال بعض الناس : المراد بالغراب هاهنا الأبقع وهو الذي في بطنه وظهره بياض ، دون الأدرع وهو الأسود ، والأعصم وهو الأبيض ; لما رواه النسائي ، عن عمرو بن علي الفلاس ، عن يحيى القطان ، عن شعبة ، عن قتادة ، عن سعيد بن المسيب ، عن عائشة ، عن النبي صلى الله عليه وسلم قال : \" خمس يقتلهن المحرم : الحية ، والفأرة ، والحدأة ، والغراب الأبقع ، والكلب العقور \" .\nوالجمهور على أن المراد به أعم من ذلك ; لما ثبت في الصحيحين من إطلاق لفظه .\nوقال مالك ، رحمه الله : لا يقتل المحرم الغراب إلا إذا صال عليه وآذاه .\nوقال مجاهد بن جبر وطائفة : لا يقتله بل يرميه . ويروى مثله عن علي .\nوقد روى هشيم : حدثنا يزيد بن أبي زياد ، عن عبد الرحمن بن أبي نعم ، عن أبي سعيد عن النبي صلى الله عليه وسلم ; أنه سئل عما يقتل المحرم ، فقال : \" الحية ، والعقرب ، والفويسقة ، ويرمي الغراب ولا يقتله ، والكلب العقور ، والحدأة ، والسبع العادي \" .\nرواه أبو داود ، عن أحمد بن حنبل والترمذي ، عن أحمد بن منيع ، كلاهما عن هشيم . وابن ماجه ، عن أبي كريب ، عن محمد بن فضيل ، كلاهما عن يزيد بن أبي زياد ، وهو ضعيف ، به . وقال الترمذي : هذا حديث حسن .\nوقوله تعالى : ( ومن قتله منكم متعمدا فجزاء مثل ما قتل من النعم ) قال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا ابن علية ، عن أيوب قال : نبئت عن طاوس قال : لا يحكم على من أصاب صيدا خطأ ، إنما يحكم على من أصابه متعمدا .\nوهذا مذهب غريب عن طاوس ، وهو متمسك بظاهر الآية .\nوقال مجاهد بن جبير : المراد بالمتعمد هنا القاصد إلى قتل الصيد ، الناسي لإحرامه . فأما المتعمد لقتل الصيد مع ذكره لإحرامه ، فذاك أمره أعظم من أن يكفر ، وقد بطل إحرامه .\nرواه ابن جرير عنه من طريق ابن أبي نجيح وليث بن أبي سليم وغيرهما ، عنه . وهو قول غريب أيضا . والذي عليه الجمهور أن العامد والناسي سواء في وجوب الجزاء عليه . قال الزهري : دل الكتاب على العامد ، وجرت السنة على الناسي ، ومعنى هذا أن القرآن دل على وجوب الجزاء على المتعمد وعلى تأثيمه بقوله : ( ليذوق وبال أمره عفا الله عما سلف ومن عاد فينتقم الله منه ) وجاءت السنة من أحكام النبي صلى الله عليه وسلم وأحكام أصحابه بوجوب الجزاء في الخطأ ، كما دل الكتاب عليه في العمد ، وأيضا فإن قتل الصيد إتلاف ، والإتلاف مضمون في العمد وفي النسيان ، لكن المتعمد مأثوم والمخطئ غير ملوم .\nوقوله : ( فجزاء مثل ما قتل من النعم ) وحكى ابن جرير أن ابن مسعود قرأها : \" فجزاؤه مثل ما قتل من النعم \" .\nوفي قوله : ( فجزاء مثل ما قتل من النعم ) على كل من القراءتين دليل لما ذهب إليه مالك والشافعي وأحمد ، والجمهور من وجوب الجزاء من مثل ما قتله المحرم ، إذا كان له مثل من الحيوان الإنسي ، خلافا لأبي حنيفة - رحمه الله - حيث أوجب القيمة سواء كان الصيد المقتول مثليا أو غير مثلي ، قال : وهو مخير إن شاء تصدق بثمنه ، وإن شاء اشترى به هديا . والذي حكم به الصحابة في المثل أولى بالاتباع ، فإنهم حكموا في النعامة ببدنة ، وفي بقرة الوحش ببقرة ، وفي الغزال بعنز ، وذكر قضايا الصحابة ، وأسانيدها مقرر في كتاب \" الأحكام \" ، وأما إذا لم يكن الصيد مثليا فقد حكم ابن عباس فيه بثمنه ، يحمل إلى مكة . رواه البيهقي . وقوله : ( يحكم به ذوا عدل منكم ) يعني أنه يحكم بالجزاء في المثل ، أو بالقيمة في غير المثل ، عدلان من المسلمين ، واختلف العلماء في القاتل : هل يجوز أن يكون أحد الحكمين ؟ على قولين : أحدهما : \" لا ; لأنه قد يتهم في حكمه على نفسه ، وهذا مذهب مالك .\nوالثاني : نعم ; لعموم الآية . وهو مذهب الشافعي وأحمد .\nواحتج الأولون بأن الحاكم لا يكون محكوما عليه في صورة واحدة .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا أبو نعيم الفضل بن دكين ، حدثنا جعفر - هو ابن برقان - عن ميمون بن مهران أن أعرابيا أتى أبا بكر قال : قتلت صيدا وأنا محرم ، فما ترى علي من الجزاء؟ فقال أبو بكر ، رضي الله عنه ، لأبي بن كعب وهو جالس عنده : ما ترى فيما قال؟ فقال الأعرابي : أتيتك وأنت خليفة رسول الله صلى الله عليه وسلم أسألك ، فإذا أنت تسأل غيرك؟ فقال أبو بكر : وما تنكر؟ يقول الله تعالى : ( فجزاء مثل ما قتل من النعم يحكم به ذوا عدل منكم ) فشاورت صاحبي حتى إذا اتفقنا على أمر أمرناك به .\nوهذا إسناد جيد ، لكنه منقطع بين ميمون وبين الصديق ، ومثله يحتمل هاهنا . فبين له الصديق الحكم برفق وتؤدة ، لما رآه أعرابيا جاهلا وإنما دواء الجهل التعليم ، فأما إذا كان المعترض منسوبا إلى العلم ، فقد قال ابن جرير :\nحدثنا هناد وأبو هشام الرفاعي قالا حدثنا وكيع بن الجراح ، عن المسعودي ، عن عبد الملك بن عمير عن قبيصة بن جابر قال : خرجنا حجاجا ، فكنا إذا صلينا الغداة اقتدنا رواحلنا نتماشى نتحدث ، قال : فبينما نحن ذات غداة إذ سنح لنا ظبي - أو : برح - فرماه رجل كان معنا بحجر فما أخطأ خشاءه فركب ردعه ميتا ، قال : فعظمنا عليه ، فلما قدمنا مكة خرجت معه حتى أتينا عمر رضي الله عنه ، قال : فقص عليه القصة قال : وإلى جنبه رجل كأن وجهه قلب فضة - يعني عبد الرحمن بن عوف - فالتفت عمر إلى صاحبه فكلمه قال : ثم أقبل على الرجل فقال : أعمدا قتلته أم خطأ؟ قال الرجل : لقد تعمدت رميه ، وما أردت قتله . فقال عمر : ما أراك إلا قد أشركت بين العمد والخطأ ، اعمد إلى شاة فاذبحها وتصدق بلحمها واستبق إهابها . قال : فقمنا من عنده ، فقلت لصاحبي : أيها الرجل ، عظم شعائر الله ، فما درى أمير المؤمنين ما يفتيك حتى سأل صاحبه : اعمد إلى ناقتك فانحرها ، ففعل ذاك . قال قبيصة : ولا أذكر الآية من سورة المائدة : ( يحكم به ذوا عدل منكم ) قال : فبلغ عمر مقالتي ، فلم يفجأنا منه إلا ومعه الدرة . قال : فعلا صاحبي ضربا بالدرة ، وجعل يقول : أقتلت في الحرم وسفهت الحكم؟ قال : ثم أقبل علي فقلت : يا أمير المؤمنين ، لا أحل لك اليوم شيئا يحرم عليك مني ، قال : يا قبيصة بن جابر ، إني أراك شاب السن ، فسيح الصدر ، بين اللسان ، وإن الشاب يكون فيه تسعة أخلاق حسنة وخلق سيئ ، فيفسد الخلق السيئ الأخلاق الحسنة ، فإياك وعثرات الشباب .\nوقد روى هشيم هذه القصة ، عن عبد الملك بن عمير ، عن قبيصة ، بنحوه . ورواها أيضا عن حصين ، عن الشعبي ، عن قبيصة ، بنحوه . وذكرها مرسلة عن عمر : بكر بن عبد الله المزني ومحمد بن سيرين .\nوقال ابن جرير : حدثنا ابن بشار ، حدثنا عبد الرحمن ، حدثنا شعبة ، عن منصور ، عن أبي وائل ، أخبرني أبو جرير البجلي قال : أصبت ظبيا وأنا محرم ، فذكرت ذلك لعمر ، فقال : ائت رجلين من إخوانك فليحكما عليك . فأتيت عبد الرحمن وسعدا ، فحكما علي بتيس أعفر .\nوقال ابن جرير : حدثنا ابن وكيع ، حدثنا ابن عيينة ، عن مخارق عن طارق قال : أوطأ أربد ظبيا فقتلته وهو محرم فأتى عمر ; ليحكم عليه ، فقال له عمر : احكم معي ، فحكما فيه جديا ، قد جمع الماء والشجر . ثم قال عمر : ( يحكم به ذوا عدل منكم )\nوفي هذا دلالة على جواز كون القاتل أحد الحكمين ، كما قاله الشافعي وأحمد ، رحمهما الله .\nواختلفوا : هل تستأنف الحكومة في كل ما يصيبه المحرم ، فيجب أن يحكم فيه ذوا عدل ، وإن كان قد حكم من قبله الصحابة ، أو يكتفي بأحكام الصحابة المتقدمة؟ على قولين ، فقال الشافعي وأحمد : يتبع في ذلك ما حكمت به الصحابة وجعلاه شرعا مقررا لا يعدل عنه ، وما لم يحكم فيه الصحابة يرجع فيه إلى عدلين . وقال مالك وأبو حنيفة : بل يجب الحكم في كل فرد فرد ، سواء وجد للصحابة في مثله حكم أم لا ; لقوله تعالى : ( يحكم به ذوا عدل منكم )\nوقوله تعالى : ( هديا بالغ الكعبة ) أي : واصلا إلى الكعبة ، والمراد وصوله إلى الحرم ، بأن يذبح هناك ، ويفرق لحمه على مساكين الحرم . وهذا أمر متفق عليه في هذه الصورة .\nوقوله : ( أو كفارة طعام مساكين أو عدل ذلك صياما ) أي : إذا لم يجد المحرم مثل ما قتل من النعم أو لم يكن الصيد المقتول من ذوات الأمثال ، أو قلنا بالتخيير في هذا المقام من الجزاء والإطعام والصيام ، كما هو قول مالك وأبي حنيفة وأبي يوسف ومحمد بن الحسن ، وأحد قولي الشافعي ، والمشهور عن أحمد رحمهم الله ، لظاهر الآية \" أو \" فإنها للتخيير . والقول الآخر : أنها على الترتيب .\nفصورة ذلك أن يعدل إلى القيمة ، فيقوم الصيد المقتول عند مالك وأبي حنيفة وأصحابه وحماد وإبراهيم . وقال الشافعي : يقوم مثله من النعم لو كان موجودا ، ثم يشترى به طعام ويتصدق به ، فيصرف لكل مسكين مد منه عند الشافعي ومالك وفقهاء الحجاز ، واختاره ابن جرير .\nوقال أبو حنيفة وأصحابه : يطعم كل مسكين مدين ، وهو قول مجاهد .\nوقال أحمد : مد من حنطة ، أو مدان من غيره . فإن لم يجد ، أو قلنا بالتخيير صام عن إطعام كل مسكين يوما .\nوقال ابن جرير : وقال آخرون : يصوم مكان كل صاع يوما . كما في جزاء المترفه بالحلق ونحوه ، فإن الشارع أمر كعب بن عجرة أن يطعم فرقا بين ستة ، أو يصوم ثلاثة أيام ، والفرق ثلاثة آصع .\nواختلفوا في مكان هذا الإطعام ، فقال الشافعي : محله الحرم ، وهو قول عطاء . وقال مالك : يطعم في المكان الذي أصاب فيه الصيد ، أو أقرب الأماكن إليه . وقال أبو حنيفة : إن شاء أطعم في الحرم ، وإن شاء أطعم في غيره .\nذكر أقوال السلف في هذا المقام :\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا يحيى بن المغيرة ، حدثنا جرير ، عن منصور ، عن الحكم ، عن مقسم ، عن ابن عباس في قوله : ( فجزاء مثل ما قتل من النعم يحكم به ذوا عدل منكم هديا بالغ الكعبة أو كفارة طعام مساكين أو عدل ذلك صياما ) قال : إذا أصاب المحرم الصيد حكم عليه جزاؤه من النعم ، فإن وجد جزاءه ذبحه فتصدق به . وإن لم يجد نظر كم ثمنه ، ثم قوم ثمنه طعاما ، فصام مكان كل نصف صاع يوما ، قال : ( أو كفارة طعام مساكين أو عدل ذلك صياما ) قال : إنما أريد بالطعام الصيام ، أنه إذ وجد الطعام وجد جزاؤه .\nورواه ابن جرير ، من طريق جرير .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( هديا بالغ الكعبة أو كفارة طعام مساكين أو عدل ذلك صياما ) إذا قتل المحرم شيئا من الصيد ، حكم عليه فيه . فإن قتل ظبيا أو نحوه ، فعليه شاة تذبح بمكة . فإن لم يجد فإطعام ستة مساكين فإن لم يجد فصيام ثلاثة أيام . فإن قتل إبلا أو نحوه ، فعليه بقرة . فإن لم يجد أطعم عشرين مسكينا . فإن لم يجد صام عشرين يوما . وإن قتل نعامة أو حمار وحش أو نحوه ، فعليه بدنة من الإبل . فإن لم يجد أطعم ثلاثين مسكينا . فإن لم يجد صام ثلاثين يوما .\nرواه ابن أبي حاتم وابن جرير ، وزاد : والطعام مد ؛ مد تشبعهم .\nوقال جابر الجعفي ، عن عامر الشعبي وعطاء ومجاهد : ( أو عدل ذلك صياما ) قالوا : إنما الطعام لمن لا يبلغ الهدي . رواه ابن جرير .\nوكذا روى ابن جريج ، عن مجاهد وأسباط ، عن السدي أنها على الترتيب .\nوقال عطاء وعكرمة ومجاهد - في رواية الضحاك - وإبراهيم النخعي : هي على الخيار . وهو رواية الليث ، عن مجاهد ، عن ابن عباس . واختار ذلك ابن جرير ، رحمه الله تعالى .\nوقوله : ( ليذوق وبال أمره ) أي : أوجبنا عليه الكفارة ليذوق عقوبة فعله الذي ارتكب فيه المخالفة ( عفا الله عما سلف ) أي : في زمان الجاهلية ، لمن أحسن في الإسلام واتبع شرع الله ، ولم يرتكب المعصية .\nثم قال : ( ومن عاد فينتقم الله منه ) أي : ومن فعل ذلك بعد تحريمه في الإسلام وبلوغ الحكم الشرعي إليه فينتقم الله منه والله عزيز ذو انتقام\nقال ابن جريج ، قلت لعطاء : ما ( عفا الله عما سلف ) قال : عما كان في الجاهلية . قال : قلت : وما ( ومن عاد فينتقم الله منه ) ؟ قال : ومن عاد في الإسلام ، فينتقم الله منه ، وعليه مع ذلك الكفارة قال : قلت : فهل في العود حد تعلمه؟ قال : لا . قال : قلت : فترى حقا على الإمام أن يعاقبه؟ قال : لا هو ذنب أذنبه فيما بينه وبين الله ، عز وجل ، ولكن يفتدي . رواه ابن جرير .\nوقيل معناه : فينتقم الله منه بالكفارة . قاله سعيد بن جبير وعطاء .\nثم الجمهور من السلف والخلف ، على أنه متى قتل المحرم الصيد وجب الجزاء ، ولا فرق بين الأولى والثانية وإن تكرر ما تكرر ، سواء الخطأ في ذلك والعمد .\nوقال علي بن أبي طلحة عن ابن عباس قال : من قتل شيئا من الصيد خطأ ، وهو محرم ، يحكم عليه فيه كلما قتله ، وإن قتله عمدا يحكم عليه فيه مرة واحدة ، فإن عاد يقال له : ينتقم الله منك كما قال الله عز وجل .\nوقال ابن جرير : حدثنا عمرو بن علي ، حدثنا يحيى بن سعيد وابن أبي عدي جميعا ، عن هشام - هو ابن حسان - عن عكرمة عن ابن عباس فيمن أصاب صيدا فحكم عليه ثم عاد ، قال : لا يحكم عليه ، ينتقم الله منه .\nوهكذا قال شريح ومجاهد وسعيد بن جبير والحسن البصري وإبراهيم النخعي . رواهن ابن جرير ، ثم اختار القول الأول .\nوقال ابن أبي حاتم : حدثنا العباس بن يزيد العبدي ، حدثنا المعتمر بن سليمان ، عن زيد أبي المعلى ، عن الحسن البصري ; أن رجلا أصاب صيدا ، فتجوز عنه ، ثم عاد فأصاب صيدا آخر ، فنزلت نار من السماء فأحرقته فهو قوله : ( ومن عاد فينتقم الله منه )\nوقال ابن جرير في قوله : ( والله عزيز ذو انتقام ) يقول عز ذكره : والله منيع في سلطانه لا يقهره قاهر ، ولا يمنعه من الانتقام ممن انتقم منه ، ولا من عقوبة من أراد عقوبته مانع ; لأن الخلق خلقه ، والأمر أمره ، له العزة والمنعة .\nوقوله : ( ذو انتقام ) يعني : أنه ذو معاقبة لمن عصاه على معصيته إياه .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡتُلُواْ ٱلصَّيۡدَ وَأَنتُمۡ حُرُمٞۚ وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدٗا فَجَزَآءٞ مِّثۡلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ يَحۡكُمُ بِهِۦ ذَوَا عَدۡلٖ مِّنكُمۡ هَدۡيَۢا بَٰلِغَ ٱلۡكَعۡبَةِ أَوۡ كَفَّٰرَةٞ طَعَامُ مَسَٰكِينَ أَوۡ عَدۡلُ ذَٰلِكَ صِيَامٗا لِّيَذُوقَ وَبَالَ أَمۡرِهِۦۗ عَفَا ٱللَّهُ عَمَّا سَلَفَۚ وَمَنۡ عَادَ فَيَنتَقِمُ ٱللَّهُ مِنۡهُۚ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ ٥٩\n                                    \n                                    \n                                    قوله : يا أيها الذين آمنوا لا تقتلوا الصيد وأنتم حرم ومن قتله منكم متعمدا فجزاء مثل ما قتل من النعم يحكم به ذوا عدل منكم هديا بالغ الكعبة أو كفارة طعام مساكين أو عدل ذلك صياما ليذوق وبال أمره عفا الله عما سلف ومن عاد فينتقم الله منه والله عزيز ذو انتقام .\nفيه ثلاثون مسألة :\nالأولى : قوله تعالى : يا أيها الذين هذا خطاب عام لكل مسلم ذكر وأنثى ، وهذا النهي هو الابتلاء المذكور في قوله تعالى : يا أيها الذين آمنوا ليبلونكم الله بشيء من الصيد الآية ، وروي أن أبا اليسر واسمه عمرو بن مالك الأنصاري كان محرما عام الحديبية بعمرة فقتل حمار وحش فنزلت فيه لا تقتلوا الصيد وأنتم حرم .\nالثانية : قوله تعالى : ( لا تقتلوا الصيد ) القتل هو كل فعل يفيت الروح ، وهو أنواع : منها النحر والذبح والخنق والرضخ وشبهه ; فحرم الله تعالى على المحرم في الصيد كل فعل يكون مفيتا للروح .\nالثالثة : من قتل صيدا أو ذبحه فأكل منه فعليه جزاء واحد لقتله دون أكله ; وبه قال الشافعي ، وقال أبو حنيفة : عليه جزاء ما أكل ; يعني قيمته ، وخالفه صاحباه فقالا : لا شيء عليه سوى الاستغفار ; لأنه تناول الميتة كما لو تناول ميتة أخرى ; ولهذا لو أكلها محرم آخر لا يلزمه إلا الاستغفار ، وحجة أبي حنيفة أنه تناول محظور إحرامه ; لأن قتله كان من محظورات الإحرام ، ومعلوم أن المقصود من القتل هو التناول ، فإذا كان ما يتوصل به إلى المقصود - محظور إحرامه - موجبا عليه الجزاء فما هو المقصود كان أولى .\nالرابعة : لا يجوز عندنا ذبح المحرم للصيد ، لنهي الله سبحانه المحرم عن قتله ; وبه قال أبو حنيفة . وقال الشافعي : ذبح المحرم للصيد ذكاة ; وتعلق بأنه ذبح صدر من أهله وهو المسلم ، مضاف إلى محله وهو الأنعام ; فأفاد مقصوده من حل الأكل ; أصله ذبح الحلال . قلنا : قولكم ذبح صدر من أهله فالمحرم ليس بأهل لذبح الصيد ; إذ الأهلية لا تستفاد عقلا ، وإنما يفيدها الشرع ; وذلك بإذنه في الذبح ، أو بنفيها وذلك بنهيه عن الذبح ، والمحرم منهي عن ذبح الصيد ; لقوله : لا تقتلوا الصيد فقد انتفت الأهلية بالنهي ، وقولكم أفاد مقصوده فقد اتفقنا على أن المحرم إذا ذبح الصيد لا يحل له أكله ، وإنما يأكل منه غيره عندكم ; فإذا كان الذبح لا يفيد الحل للذابح فأولى وأحرى ألا يفيده لغيره ، لأن الفرع تبع للأصل في أحكامه ; فلا يصح أن يثبت له ما لا يثبت لأصله .\nالخامسة : قوله تعالى : الصيد مصدر عومل معاملة الأسماء ، فأوقع على الحيوان المصيد ; ولفظ الصيد هنا عام في كل صيد بري وبحري حتى جاء قوله تعالى : وحرم عليكم صيد البر ما دمتم حرما فأباح صيد البحر إباحة مطلقة ; على ما يأتي بيانه في الآية بعد هذا إن شاء الله تعالى .\nالسادسة : اختلف العلماء في خروج السباع من صيد البر وتخصيصها منه ; فقال مالك : كل شيء لا يعدو من السباع مثل الهر والثعلب والضبع وما أشبهها فلا يقتله المحرم ، وإن قتله فداه . قال : وصغار الذئاب لا أرى أن يقتلها المحرم ، فإن قتلها فداها ; وهي مثل فراخ الغربان ، ولا بأس بقتل كل ما عدا على الناس في الأغلب ; مثل الأسد والذئب والنمر والفهد ; وكذلك لا بأس عليه بقتل الحيات والعقارب والفأرة والغراب والحدأة . قال إسماعيل : إنما ذلك لقوله عليه السلام : خمس فواسق يقتلن في الحل والحرم الحديث ; فسماهن فساقا ; ووصفهن بأفعالهن ; لأن الفاسق فاعل للفسق ، والصغار لا فعل لهن ، ووصف الكلب بالعقور وأولاده لا تعقر ; فلا تدخل في هذا النعت . قال القاضي إسماعيل : الكلب العقور مما يعظم ضرره على الناس . قال : ومن ذلك الحية والعقرب ; لأنه يخاف منهما ، وكذلك الحدأة والغراب ; لأنهما يخطفان اللحم من أيدي الناس . قال ابن بكير : إنما أذن في قتل العقرب لأنها ذات حمة ; وفي الفأرة لقرضها السقاء والحذاء اللذين بهما قوام المسافر ، وفي الغراب لوقوعه على الظهر ونقبه عن لحومها ; وقد روي يطعم قاتله شيئا ; وكذلك قال مالك فيمن قتل البرغوث والذباب والنمل ونحوه ، وقال أصحاب الرأي : لا شيء على قاتل هذه كلها . وقال أبو حنيفة : لا يقتل المحرم من السباع إلا الكلب العقور والذئب خاصة ، سواء ابتدآه أو ابتدأهما ; وإن قتل غيره من السباع فداه . قال : فإن ابتدأه غيرهما من السباع فقتله فلا شيء عليه ; قال : ولا شيء عليه في قتل الحية والعقرب والغراب والحدأة ، هذه جملة قول أبي حنيفة وأصحابه إلا زفر ; وبه قال الأوزاعي والثوري والحسن ; واحتجوا بأن النبي صلى الله عليه وسلم خص دوابا بأعيانها وأرخص للمحرم في قتلها من أجل ضررها ; فلا وجه أن يزاد عليها إلا أن يجمعوا على شيء فيدخل في معناها .\nقلت : العجب من أبي حنيفة رحمه الله يحمل التراب على البر بعلة الكيل ، ولا يحمل السباع العادية على الكلب بعلة الفسق والعقر ، كما فعل مالك والشافعي رحمهما الله ! وقال زفر بن الهذيل : لا يقتل إلا الذئب وحده ، ومن قتل غيره وهو محرم فعليه الفدية ، سواء ابتدأه أو لم يبتدئه ; لأنه عجماء فكان فعله هدرا ; وهذا رد للحديث ومخالفة له ، وقال الشافعي : كل ما لا يؤكل لحمه فللمحرم أن يقتله ; وصغار ذلك وكباره سواء ، إلا السمع وهو المتولد بين الذئب والضبع ، قال : وليس في الرخمة والخنافس والقردان والحلم وما لا يؤكل لحمه شيء ; لأن هذا ليس من الصيد ، لقوله تعالى : وحرم عليكم صيد البر ما دمتم حرما فدل أن الصيد الذي حرم عليهم ما كان لهم قبل الإحرام حلالا ; حكى عنه هذه الجملة المزني والربيع ; فإن قيل : فلم تفدى القملة وهي تؤذي ولا تؤكل ؟ قيل له : ليس تفدى إلا على ما يفدى به الشعر والظفر ولبس ما ليس له لبسه ; لأن في طرح القملة إماطة الأذى عن نفسه إذا كانت في رأسه ولحيته ، فكأنه أماط بعض شعره ; فأما إذا ظهرت فقتلت فإنها لا تؤذي ، وقول أبي ثور في هذا الباب كقول الشافعي ; قاله أبو عمر .\nالسابعة : روى الأئمة عن ابن عمر أن رسول الله صلى الله عليه وسلم قال : خمس من الدواب ليس على المحرم في قتلهن جناح : الغراب والحدأة والعقرب والفأرة والكلب العقور . اللفظ للبخاري ; وبه قال أحمد وإسحاق ، وفي كتاب مسلم عن عائشة عن النبي صلى الله عليه وسلم أنه قال : خمس فواسق يقتلن في الحل والحرم الحية والغراب الأبقع والفأرة والكلب العقور والحديا ، وبه قالت طائفة من أهل العلم قالوا : لا يقتل من الغربان إلا الأبقع خاصة ; لأنه تقييد مطلق . وفي كتاب أبي داود عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم : ويرمي الغراب ولا يقتله ، وبه قال مجاهد ، وجمهور العلماء على القول بحديث ابن عمر ، والله أعلم ، وعند أبي داود والترمذي : والسبع العادي ; وهذا تنبيه على العلة .\nالثامنة : قوله تعالى : وأنتم حرم عام في النوعين من الرجال والنساء ، الأحرار والعبيد ; يقال : رجل حرام وامرأة حرام ، وجمع ذلك حرم ; كقولهم : قذال وقذل . وأحرم الرجل دخل في الحرم ; كما يقال : أسهل دخل في السهل ، وهذا اللفظ يتناول الزمان والمكان وحالة الإحرام بالاشتراك لا بالعموم . يقال : رجل حرام إذا دخل في الأشهر الحرم أو في الحرم ، أو تلبس بالإحرام ; إلا أن تحريم الزمان خرج بالإجماع عن أن يكون معتبرا ، وبقي تحريم المكان وحالة الإحرام على أصل التكليف ; قاله ابن العربي .\nالتاسعة : حرم المكان حرمان ، حرم المدينة وحرم مكة وزاد الشافعي الطائف ، فلا يجوز عنده قطع شجره ، ولا صيد صيده ، ومن فعل ذلك فلا جزاء عليه فأما حرم المدينة فلا يجوز فيه الاصطياد لأحد ولا قطع الشجر كحرم مكة ، فإن فعل أثم ولا جزاء عليه عند مالك والشافعي وأصحابهما ، وقال ابن أبي ذئب : عليه الجزاء ، وقال سعد : جزاؤه أخذ سلبه ، وروي عن الشافعي . وقال أبو حنيفة : صيد المدينة غير محرم ، وكذلك قطع شجرها ، واحتج له بعض من ذهب مذهبه بحديث سعد بن أبي وقاص عن النبي صلى الله عليه وسلم أنه قال : من وجدتموه يصيد في حدود المدينة أو يقطع شجرها فخذوا سلبه ، وأخذ سعد سلب من فعل ذلك . قال : وقد اتفق الفقهاء على أنه لا يؤخذ سلب من صاد في المدينة ، فدل ذلك على أنه منسوخ ، واحتج لهم الطحاوي أيضا بحديث أنس - ما فعل النغير ; فلم ينكر صيده وإمساكه - وهذا كله لا حجة فيه . أما الحديث الأول فليس بالقوي ، ولو صح لم يكن في نسخ أخذ السلب ما يسقط ما صح من تحريم المدينة ، فكم من محرم ليس عليه عقوبة في الدنيا ، وأما الحديث الثاني فيجوز أن يكون صيد في غير الحرم ، وكذلك حديث عائشة ; أنه كان لرسول الله صلى الله عليه وسلم وحش فإذا خرج لعب واشتد وأقبل وأدبر ، فإذا أحس برسول الله صلى الله عليه وسلم ربض ، فلم يترمرم كراهية أن يؤذيه ، ودليلنا عليهم ما رواه مالك عن ابن شهاب عن سعيد بن المسيب أن أبا هريرة قال : لو رأيت الظباء ترتع بالمدينة ما ذعرتها ، قال رسول الله صلى الله عليه وسلم : ما بين لابتيها حرام فقول أبي هريرة ما ذعرتها دليل على أنه لا يجوز ترويع الصيد في حرم المدينة ، كما لا يجوز ترويعه في حرم مكة ، وكذلك نزع زيد بن ثابت النهس - وهو طائر - من يد شرحبيل بن سعد كان صاده بالمدينة ; دليل على أن الصحابة فهموا مراد رسول الله صلى الله عليه وسلم في تحريم صيد المدينة ، فلم يجيزوا فيها الاصطياد ولا تملك ما يصطاد . ومتعلق ابن أبي ذئب قوله صلى الله عليه وسلم في الصحيح : اللهم إن إبراهيم حرم مكة وإني أحرم المدينة مثل ما حرم به مكة ومثله معه لا يختلى خلاها ولا يعضد شجرها ولا ينفر صيدها ولأنه حرم منع الاصطياد فيه فتعلق الجزاء به كحرم مكة . قال القاضي عبد الوهاب : وهذا قول أقيس عندي على أصولنا ، لا سيما أن المدينة عند أصحابنا أفضل من مكة ، وأن الصلاة فيها أفضل من الصلاة في المسجد الحرام ، ومن حجة مالك والشافعي في ألا يحكم عليه بجزاء ولا أخذ سلب - في المشهور من قول الشافعي - عموم قوله صلى الله عليه وسلم في الصحيح : المدينة حرم ما بين عير إلى ثور فمن أحدث فيها حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه يوم القيامة صرفا ولا عدلا فأرسل صلى الله عليه وسلم الوعيد الشديد ولم يذكر كفارة . وأما ما ذكر عن سعد فذلك مذهب له مخصوص به ; لما روي عنه في الصحيح أنه ركب إلى قصره بالعقيق ، فوجد عبدا يقطع شجرا - أو يخبطه - فسلبه ، فلما رجع سعد جاءه أهل العبد فكلموه أن يرد على غلامهم أو عليهم ما أخذ من غلامهم ; فقال : معاذ الله أن أرد شيئا نفلنيه رسول الله صلى الله عليه وسلم ، وأبى أن يرد عليهم ; فقوله : ( نفلنيه ) ظاهره الخصوص ، والله أعلم .\nالعاشرة : قوله تعالى : ومن قتله منكم متعمدا ذكر الله سبحانه المتعمد ولم يذكر المخطئ والناسي ; والمتعمد هنا هو القاصد للشيء مع العلم بالإحرام ، والمخطئ هو الذي يقصد شيئا فيصيب صيدا ، والناسي هو الذي يتعمد الصيد ولا يذكر إحرامه ، واختلف العلماء في ذلك على خمسة أقوال : الأول : ما أسنده الدارقطني عن ابن عباس قال : إنما التكفير في العمد ، وإنما غلظوا في الخطأ لئلا يعودوا . الثاني : أن قوله : \" متعمدا \" خرج على الغالب ، فألحق به النادر كأصول الشريعة . الثالث : أنه لا شيء على المخطئ والناسي ; وبه قال الطبري وأحمد بن حنبل في إحدى روايتيه ، وروي عن ابن عباس وسعيد بن جبير ، وبه قال طاوس وأبو ثور ، وهو قول داود ، وتعلق أحمد بأن قال : لما خص الله سبحانه المتعمد بالذكر ، دل على أن غيره بخلافه ، وزاد بأن قال : الأصل براءة الذمة فمن ادعى شغلها فعليه الدليل . الرابع : أنه يحكم عليه في العمد والخطأ والنسيان ; قاله ابن عباس ، وروي عن عمر وطاوس والحسن وإبراهيم والزهري ، وبه قال مالك والشافعي وأبو حنيفة وأصحابهم . قال الزهري : وجب الجزاء في العمد بالقرآن ، وفي الخطأ والنسيان بالسنة ; قال ابن العربي : إن كان يريد بالسنة الآثار التي وردت عن ابن عباس وعمر فنعما هي ، وما أحسنها أسوة . الخامس : أن يقتله متعمدا لقتله ناسيا لإحرامه - وهو قول مجاهد - لقوله تعالى بعد ذلك : ومن عاد فينتقم الله منه . قال : ولو كان ذاكرا لإحرامه لوجبت عليه العقوبة لأول مرة ، قال : فدل على أنه أراد متعمدا لقتله ناسيا لإحرامه ; قال مجاهد : فإن كان ذاكرا لإحرامه فقد حل ولا حج له لارتكابه محظور إحرامه ، فبطل عليه كما لو تكلم في الصلاة ، أو أحدث فيها ; قال : ومن أخطأ فذلك الذي يجزئه ، ودليلنا على مجاهد أن الله سبحانه أوجب الجزاء ولم يذكر الفساد ، ولا فرق بين أن يكون ذاكرا للإحرام أو ناسيا له ، ولا يصح اعتبار الحج بالصلاة فإنهما مختلفان ; وقد روي عنه أنه لا حكم عليه في قتله متعمدا ، ويستغفر الله ، وحجه تام ; وبه قال ابن زيد ، ودليلنا على داود أن النبي صلى الله عليه وسلم سئل عن الضبع فقال : هي صيد وجعل فيها إذا أصابها المحرم كبشا ، ولم يقل عمدا ولا خطأ . وقال ابن بكير من علمائنا : قوله سبحانه : متعمدا لم يرد به التجاوز عن الخطأ ، وإنما أراد متعمدا ليبين أنه ليس كابن آدم الذي لم يجعل في قتله متعمدا كفارة ، وأن الصيد فيه كفارة ، ولم يرد به إسقاط الجزاء في قتل الخطأ ، والله أعلم .\nالحادية عشرة : فإن قتله في إحرامه مرة بعد مرة حكم عليه كلما قتله في قول مالك والشافعي وأبي حنيفة وغيرهم ; لقول الله تعالى : يا أيها الذين آمنوا لا تقتلوا الصيد وأنتم حرم ومن قتله منكم متعمدا فجزاء مثل ما قتل من النعم فالنهي دائم مستمر عليه ما دام محرما فمتى قتله فالجزاء لأجل ذلك لازم له ، وروي عن ابن عباس قال : لا يحكم عليه مرتين في الإسلام ، ولا يحكم عليه إلا مرة واحدة ، فإن عاد ثانية فلا يحكم عليه ، ويقال له : ينتقم الله منك ; لقوله تعالى : ومن عاد فينتقم الله منه ، وبه قال الحسن وإبراهيم ومجاهد وشريح ، ودليلنا عليهم ما ذكرناه من تمادي التحريم في الإحرام ، وتوجه الخطاب عليه في دين الإسلام .\nالثانية عشرة : قوله تعالى : متعمدا فجزاء مثل ما قتل من النعم فيه أربع قراءات ; \" فجزاء مثل \" برفع ( جزاء ) وتنوينه ، و \" مثل \" على الصفة ، والخبر مضمر ، التقدير فعليه جزاء مماثل واجب أو لازم من النعم ، وهذه القراءة تقتضي أن يكون المثل هو الجزاء بعينه . و \" جزاء \" بالرفع غير منون و \" مثل \" بالإضافة أي : فعليه جزاء مثل ما قتل ، و \" مثل \" مقحمة كقولك أنا أكرم مثلك ، وأنت تقصد أنا أكرمك ، ونظير هذا قوله تعالى : أومن كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات التقدير كمن هو في الظلمات ; وقوله : ليس كمثله شيء أي : ليس كهو شيء ، وهذه القراءة تقتضي أن يكون الجزاء غير المثل ; إذ الشيء لا يضاف إلى نفسه ، وقال أبو علي : إنما يجب عليه جزاء المقتول ، لا جزاء مثل المقتول ، والإضافة توجب جزاء المثل لا جزاء المقتول . وهو قول الشافعي على ما يأتي ، وقوله : من النعم صفة لجزاء على القراءتين جميعا ، وقرأ الحسن \" من النعم \" بإسكان العين وهي لغة ، وقرأ عبد الرحمن \" فجزاء \" بالرفع والتنوين \" مثل \" بالنصب ; قال أبو الفتح : \" مثل \" منصوبة بنفس الجزاء ; والمعنى أن يجزى مثل ما قتل ، وقرأ ابن مسعود والأعمش \" فجزاؤه مثل \" بإظهار ( هاء ) ; ويحتمل أن يعود على الصيد أو على الصائد القاتل .\nالثالثة عشرة : الجزاء إنما يجب بقتل الصيد لا بنفس أخذه كما قال تعالى ، وفي ( المدونة ) : من اصطاد طائرا فنتف ريشه ثم حبسه حتى نسل ريشه فطار ، قال : لا جزاء عليه . قال وكذلك لو قطع يد صيد أو رجله أو شيئا من أعضائه وسلمت نفسه وصح ولحق بالصيد فلا شيء عليه ، وقيل : عليه من الجزاء بقدر ما نقصه . ولو ذهب ولم يدر ما فعل فعليه جزاؤه ، ولو زمن الصيد ولم يلحق الصيد ، أو تركه مخوفا عليه فعليه جزاؤه كاملا .\nالرابعة عشرة : ما يجزى من الصيد شيئان : دواب وطير ; فيجزى ما كان من الدواب بنظيره في الخلقة والصورة ، ففي النعامة بدنة ، وفي حمار الوحش وبقرة الوحش بقرة ، وفي الظبي شاة ; وبه قال الشافعي ، وأقل ما يجزي عند مالك ما استيسر من الهدي وكان أضحية ; وذلك كالجذع من الضأن والثني مما سواه ، وما لم يبلغ جزاؤه ذلك ففيه إطعام أو صيام ، وفي الحمام كله قيمته إلا حمام مكة ; فإن في الحمامة منه شاة اتباعا للسلف في ذلك ، والدبسي والفواخت والقمري وذوات الأطواق كله حمام ، وحكى ابن عبد الحكم عن مالك أن في حمام مكة وفراخها شاة ; قال : وكذلك حمام الحرم ; قال : وفي حمام الحل حكومة ، وقال أبو حنيفة : إنما يعتبر المثل في القيمة دون الخلقة ، فيقوم الصيد دراهم في المكان الذي قتله فيه ، أو في أقرب موضع إليه إن كان لا يباع الصيد في موضع قتله ; فيشتري بتلك القيمة هديا إن شاء ، أو يشتري بها طعاما ويطعم المساكين كل مسكين نصف صاع من بر ، أو صاعا من شعير ، أو صاعا من تمر ، وأما الشافعي فإنه يرى المثل من النعم ثم يقوم المثل كما في المتلفات يقوم المثل ، وتؤخذ قيمة المثل كقيمة الشيء ; فإن المثل هو الأصل في الوجوب ; وهذا بين وعليه تخرج قراءة الإضافة \" فجزاء مثل \" . احتج أبو حنيفة فقال : لو كان الشبه من طريق الخلقة معتبرا ، في النعامة بدنة ، وفي الحمار بقرة ، وفي الظبي شاة ، لما أوقفه على عدلين يحكمان به ; لأن ذلك قد علم فلا يحتاج إلى الارتياء والنظر ; وإنما يفتقر إلى العدول والنظر ما تشكل الحال فيه ، ويضطرب وجه النظر عليه . ودليلنا عليه قول الله تعالى : فجزاء مثل ما قتل من النعم الآية . فالمثل يقتضي بظاهرة المثل الخلقي الصوري دون المعنى ، ثم قال : من النعم فبين جنس المثل ; ثم قال : يحكم به ذوا عدل منكم وهذا ضمير راجع إلى مثل من النعم ; لأنه لم يتقدم ذكر لسواه يرجع الضمير عليه ; ثم قال : هديا بالغ الكعبة والذي يتصور فيه الهدي مثل المقتول من النعم ، فأما القيمة فلا يتصور أن تكون هديا ، ولا جرى لها ذكر في نفس الآية ; فصح ما ذكرناه ، والحمد لله ، وقولهم : لو كان الشبه معتبرا لما أوقفه على عدلين ; فالجواب أن اعتبار العدلين إنما وجب للنظر في حال الصيد من صغر وكبر ، وما لا جنس له مما له جنس ، وإلحاق ما لم يقع عليه نص بما وقع عليه النص .\nالخامسة عشرة : من أحرم من مكة فأغلق باب بيته على فراخ حمام فماتت فعليه في كل فرخ شاة . قال مالك : وفي صغار الصيد مثل ما في كباره ; وهو قول عطاء ، ولا يفدى عند مالك شيء بعناق ولا جفرة ; قال مالك : وذلك مثل الدية ; الصغير والكبير فيها سواء ، وفي الضب عنده واليربوع قيمتهما طعاما ، ومن أهل المدينة من يخالفه في صغار الصيد ، وفي اعتبار الجذع والثني ، ويقول بقول عمر : في الأرنب عناق وفي اليربوع جفرة ; رواه مالك موقوفا ، وروى أبو الزبير عن جابر عن النبي صلى الله عليه وسلم قال : في الضبع إذا أصابه المحرم كبش وفي الظبي شاة وفي الأرنب عناق وفي اليربوع جفرة قال : والجفرة التي قد ارتعت ، وفي طريق آخر قلت لأبي الزبير : وما الجفرة ؟ قال : التي قد فطمت ورعت . خرجه الدارقطني ، وقال الشافعي : في النعامة بدنة ، وفي فرخها فصيل ، وفي حمار الوحش بقرة ، وفي سخله عجل ; لأن الله تعالى حكم بالمثلية في الخلقة ، والصغر والكبر متفاوتان فيجب اعتبار الصغير فيه والكبير كسائر المتلفات . قال ابن العربي : وهذا صحيح وهو اختيار علمائنا ; قالوا : ولو كان الصيد أعورا أو أعرجا أو كسيرا لكان المثل على صفته لتتحقق المثلية ، فلا يلزم المتلف فوق ما أتلف ، ودليلنا قوله تعالى : فجزاء مثل ما قتل من النعم ولم يفصل بين صغير وكبير ، وقوله : هديا يقتضي ما يتناوله اسم الهدي لحق الإطلاق ، وذلك يقتضي الهدي التام ، والله أعلم .\nالسادسة عشرة : في بيض النعامة عشر ثمن البدنة عند مالك ، وفي بيض الحمامة المكية عنده عشر ثمن الشاة . قال ابن القاسم : وسواء كان فيها فرخ أو لم يكن ما لم يستهل الفرخ بعد الكسر ; فإن استهل فعليه الجزاء كاملا كجزاء الكبير من ذلك الطير . قال ابن المواز : بحكومة عدلين ، وأكثر العلماء يرون في بيض كل طائر القيمة . روى عكرمة عن ابن عباس عن كعب بن عجرة أن النبي صلى الله عليه وسلم قضى في بيض نعام أصابه محرم بقدر ثمنه ; خرجه الدارقطني ، وروي عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم : في كل بيضة نعام صيام يوم أو إطعام مسكين .\nالسابعة عشرة : وأما ما لا مثل له كالعصافير والفيلة فقيمة لحمه أو عدله من الطعام ، دون ما يراد له من الأغراض ; لأن المراعى فيما له مثل وجوب مثله ، فإن عدم المثل فالقيمة قائمة مقامه كالغصب وغيره ، ولأن الناس قائلان - أي : على مذهبين - معتبر للقيمة في جميع الصيد ; ومقتصر بها على ما لا مثل له من النعم ; فقد تضمن ذلك الإجماع على اعتبار القيمة فيما لا مثل له ، وأما الفيل فقيل : فيه بدنة من الهجان العظام التي لها سنامان ; وهي بيض خراسانية ، فإذا لم يوجد شيء من هذه الإبل فينظر إلى قيمته طعاما ، فيكون عليه ذلك ، والعمل فيه أن يجعل الفيل في مركب ، وينظر إلى منتهى ما ينزل المركب في الماء ، ثم يخرج الفيل ويجعل في المركب طعام حتى ينزل إلى الحد الذي نزل والفيل فيه ، وهذا عدله من الطعام ، وأما أن ينظر إلى قيمته فهو يكون له ثمن عظيم لأجل عظامه وأنيابه فيكثر الطعام وذلك ضرر .\nالثامنة عشرة : قوله تعالى : يحكم به ذوا عدل منكم روى مالك عن عبد الملك بن قريب عن محمد بن سيرين أن رجلا جاء إلى عمر بن الخطاب فقال : إني أجريت أنا وصاحب لي فرسين نستبق إلى ثغرة ثنية ، فأصبنا ظبيا ونحن محرمان فماذا ترى ؟ فقال عمر لرجل إلى جنبه : تعال حتى أحكم أنا وأنت ; فحكما عليه بعنز ; فولى الرجل وهو يقول : هذا أمير المؤمنين لا يستطيع أن يحكم في ظبي حتى دعا رجلا يحكم معه ، فسمع عمر بن الخطاب قول الرجل فدعاه فسأله ، هل تقرأ سورة \" المائدة \" ؟ فقال : لا ; قال : هل تعرف الرجل الذي حكم معي ؟ فقال : لا ، فقال عمر رضي الله عنه : لو أخبرتني أنك تقرأ سورة \" المائدة \" لأوجعتك ضربا ، ثم قال : إن الله سبحانه يقول في كتابه : يحكم به ذوا عدل منكم هديا بالغ الكعبة وهذا عبد الرحمن بن عوف .\nالتاسعة عشرة : إذا اتفق الحكمان لزم الحكم ; وبه قال الحسن والشافعي ، وإن اختلفا نظر في غيرهما ، وقال محمد بن المواز : لا يأخذ بأرفع من قوليهما ; لأنه عمل بغير تحكيم ، وكذلك لا ينتقل عن المثل الخلقي إذا حكما به إلى الطعام ; لأنه أمر قد لزم ; قاله ابن شعبان ، وقال ابن القاسم : إن أمرهما أن يحكما بالجزاء من المثل ففعلا ، فأراد أن ينتقل إلى الطعام جاز ، وقال ابن وهب رحمه الله في ( العتبية ) : من السنة أن يخير الحكمان من أصاب الصيد ، كما خيره الله في أن يخرج هديا بالغ الكعبة أو كفارة طعام مساكين أو عدل ذلك صياما فإن اختار الهدي حكما عليه بما يريانه نظيرا لما أصاب ما بينهما وبين أن يكون عدل ذلك شاة لأنها أدنى الهدي ; وما لم يبلغ شاة حكما فيه بالطعام ثم خير في أن يطعمه ، أو يصوم مكان كل مد يوما ; وكذلك قال مالك في ( المدونة ) .\nالموفية عشرين : ويستأنف الحكم في كل ما مضت فيه حكومة أو لم تمض ، ولو اجتزأ بحكومة الصحابة رضي الله عنهم فيما حكموا به من جزاء الصيد كان حسنا ، وقد روي عن مالك أنه ما عدا حمام مكة وحمار الوحش والظبي والنعامة لا بد فيه من الحكومة ، ويجتزأ في هذه الأربعة بحكومة من مضى من السلف رضي الله عنهم .\nالحادية والعشرون : لا يجوز أن يكون الجاني أحد الحكمين ، وبه قال أبو حنيفة ، وقال الشافعي في أحد قوليه : يكون الجاني أحد الحكمين ; وهذا تسامح منه ; فإن ظاهر الآية يقتضي جانيا وحكمين فحذف بعض العدد إسقاط للظاهر ، وإفساد للمعنى ; لأن حكم المرء لنفسه لا يجوز ، ولو كان ذلك جائزا لاستغنى بنفسه عن غيره ; لأنه حكم بينه وبين الله تعالى فزيادة ثان إليه دليل على استئناف الحكم برجلين .\nالثانية والعشرون : إذا اشترك جماعة محرمون في قتل صيد فقال مالك وأبو حنيفة : على كل واحد جزاء كامل . وقال الشافعي : عليهم كلهم كفارة واحدة لقضاء عمر وعبد الرحمن ، وروى الدارقطني أن موالي لابن الزبير أحرموا إذ مرت بهم ضبع فحذفوها بعصيهم فأصابوها ، فوقع في أنفسهم ، فأتوا ابن عمر فذكروا له فقال : عليكم كلكم كبش ; قالوا : أو على كل واحد منا كبش ; قال : إنكم لمعزز بكم ، عليكم كلكم كبش . قال اللغويون : لمعزز بكم أي : لمشدد عليكم ، وروي عن ابن عباس في قوم أصابوا ضبعا قال : عليهم كبش يتخارجونه بينهم ، ودليلنا قول الله سبحانه : ومن قتله منكم متعمدا فجزاء مثل ما قتل من النعم وهذا خطاب لكل قاتل ، وكل واحد من القاتلين للصيد قاتل نفسا على التمام والكمال ، بدليل قتل الجماعة بالواحد ، ولولا ذلك ما وجب عليهم القصاص ، وقد قلنا بوجوبه إجماعا منا ومنهم ; فثبت ما قلناه .\nالثالثة والعشرون : قال أبو حنيفة : إذا قتل جماعة صيدا في الحرم وكلهم محلون ، عليهم جزاء واحد ، بخلاف ما لو قتله المحرمون في الحل والحرم ; فإن ذلك لا يختلف ، وقال مالك : على كل واحد منهم جزاء كامل ، بناء على أن الرجل يكون محرما بدخوله الحرم ، كما يكون محرما بتلبيته بالإحرام ، وكل واحد من الفعلين قد أكسبه صفة تعلق بها نهي ، فهو هاتك لها في الحالتين . السابعة : وحجة أبي حنيفة ما ذكره القاضي أبو زيد الدبوسي قال : السر فيه أن الجناية في الإحرام على العبادة ، وقد ارتكب كل واحد منهم محظور إحرامه ، وإذا قتل المحلون صيدا في الحرم فإنما أتلفوا دابة محرمة بمنزلة ما لو أتلف جماعة دابة ; فإن كل واحد منهم قاتل دابة ، ويشتركون في القيمة . قال ابن العربي : وأبو حنيفة أقوى منا ، وهذا الدليل يستهين به علماؤنا وهو عسير الانفصال علينا .\nالرابعة والعشرون : قوله تعالى : هديا بالغ الكعبة المعنى أنهما إذا حكما بالهدي فإنه يفعل به ما يفعل بالهدي من الإشعار والتقليد ، ويرسل من الحل إلى مكة ، وينحر ويتصدق به فيها ; لقوله : هديا بالغ الكعبة ولم يرد الكعبة بعينها فإن الهدي لا يبلغها ، إذ هي في المسجد ، وإنما أراد الحرم ولا خلاف في هذا ، وقال الشافعي : لا يحتاج الهدي إلى الحل بناء على أن الصغير من الهدي يجب في الصغير من الصيد ، فإنه يبتاع في الحرم ويهدى فيه .\nالخامسة والعشرون : قوله تعالى : أو كفارة طعام مساكين الكفارة إنما هي عن الصيد لا عن الهدي . قال ابن وهب قال مالك : أحسن ما سمعت في الذي يقتل الصيد فيحكم عليه فيه ، أنه يقوم الصيد الذي أصاب ، فينظر كم ثمنه من الطعام ، فيطعم لكل مسكين مدا ، أو يصوم مكان كل مد يوما ، وقال ابن القاسم عنه : إن قوم الصيد دراهم ثم قومها طعاما أجزأه ; والصواب الأول ، وقال عبد الله بن عبد الحكم مثله قال عنه : وهو في هذه الثلاثة بالخيار ; أي ذلك فعل أجزأه موسرا كان أو معسرا ، وبه قال عطاء وجمهور الفقهاء ; لأن أو للتخيير قال مالك : كل شيء في كتاب الله في الكفارات كذا أو كذا فصاحبه مخير في ذلك أي ذلك أحب أن يفعل فعل ، وروي عن ابن عباس أنه قال : إذا قتل المحرم ظبيا أو نحوه فعليه شاة تذبح بمكة ; فإن لم يجد فإطعام ستة مساكين ، فإن لم يجد فعليه صيام ثلاثة أيام ; وإن قتل إيلا أو نحوه فعليه بقرة ، فإن لم يجد أطعم عشرين مسكينا ، فإن لم يجد صام عشرين يوما ; وإن قتل نعامة أو حمارا فعليه بدنة ، فإن لم يجد فإطعام ثلاثين مسكينا ، فإن لم يجد فصيام ثلاثين يوما ، والطعام مد مد لشبعهم . وقال إبراهيم النخعي وحماد بن سلمة ، قالوا : والمعنى أو كفارة طعام إن لم يجد الهدي ، وحكى الطبري عن ابن عباس أنه قال : إذا أصاب المحرم الصيد حكم عليه بجزائه ، فإن وجد جزاءه ذبحه وتصدق به ، وإن لم يكن عنده جزاؤه قوم جزاؤه بدراهم ، ثم قومت الدراهم حنطة ، ثم صام مكان كل نصف صاع يوما ; وقال : إنما أريد بالطعام تبيين أمر الصيام ، فمن لم يجد طعاما ، فإنه يجد جزاءه ، وأسنده أيضا عن السدي ، ويعترض هذا القول بظاهر الآية فإنه ينافره .\nالسادسة والعشرون : اختلف العلماء في الوقت الذي يعتبر فيه المتلف ; فقال قوم : يوم الإتلاف ، وقال آخرون : يوم القضاء ، وقال آخرون : يلزم المتلف أكثر القيمتين ، من يوم الإتلاف إلى يوم الحكم . قال ابن العربي : واختلف علماؤنا كاختلافهم ، والصحيح أنه تلزمه القيمة يوم الإتلاف ; والدليل على ذلك أن الوجود كان حقا للمتلف عليه ، فإذا أعدمه المتلف لزمه إيجاده بمثله ، وذلك في وقت العدم .\nالسابعة والعشرون : أما الهدي فلا خلاف أنه لا بد له من مكة ; لقوله تعالى : هديا بالغ الكعبة ، وأما الإطعام فاختلف فيه قول مالك هل يكون بمكة أو بموضع الإصابة ; وإلى كونه بمكة ذهب الشافعي ، وقال عطاء : ما كان من دم أو طعام فبمكة ويصوم حيث يشاء ; وهو قول مالك في الصوم ، ولا خلاف فيه . قال القاضي أبو محمد عبد الوهاب : ولا يجوز إخراج شيء من جزاء الصيد بغير الحرم إلا الصيام ، وقال حماد وأبو حنيفة : يكفر بموضع الإصابة مطلقا ، وقال الطبري : يكفر حيث شاء مطلقا ، فأما قول أبي حنيفة فلا وجه له في النظر ، ولا أثر فيه . وأما من قال يصوم حيث شاء ; فلأن الصوم عبادة تختص بالصائم فتكون في كل موضع كصيام سائر الكفارات وغيرها . وأما وجه القول بأن الطعام يكون بمكة ; فلأنه بدل عن الهدي أو نظير له ، والهدي حق لمساكين مكة ، فلذلك يكون بمكة بدله أو نظيره ، وأما من قال إنه يكون بكل موضع ; فاعتبار بكل طعام وفدية ، فإنها تجوز بكل موضع ، والله أعلم .\nالثامنة والعشرون : قوله تعالى : أو عدل ذلك صياما العدل والعدل بفتح العين وكسرها لغتان وهما المثل ; قاله الكسائي ، وقال الفراء : عدل الشيء بكسر العين مثله من جنسه ، وبفتح العين مثله من غير جنسه ، ويؤثر هذا القول عن الكسائي ، تقول : عندي عدل دراهمك من الدراهم ، وعندي عدل دراهمك من الثياب ; والصحيح عن الكسائي أنهما لغتان ، وهو قول البصريين ، ولا يصح أن يماثل الصيام الطعام في وجه أقرب من العدد قال مالك : يصوم عن كل مد يوما ، وإن زاد على شهرين أو ثلاثة ; وبه قال الشافعي ، وقال يحيى بن عمر من أصحابنا : إنما يقال كم من رجل يشبع من هذا الصيد فعرف العدد ، ثم يقال : كم من الطعام يشبع هذا العدد ; فإن شاء أخرج ذلك الطعام ، وإن شاء صام عدد أمداده ، وهذا قول حسن احتاط فيه لأنه قد تكون قيمة الصيد من الطعام قليلة ; فبهذا النظر يكثر الإطعام ، ومن أهل العلم من لا يرى أن يتجاوز في صيام الجزاء شهرين ; قالوا : لأنها أعلى الكفارات ، واختاره ابن العربي ، وقاله أبو حنيفة رحمه الله : يصوم عن كل مدين يوما اعتبارا بفدية الأذى .\nالتاسعة والعشرون : قوله تعالى : ليذوق وبال أمره الذوق هنا مستعار كقوله تعالى : ذق إنك أنت العزيز الكريم وقال : فأذاقها الله لباس الجوع والخوف ، وحقيقة الذوق إنما هي في حاسة اللسان ، وهي في هذا كله مستعارة ومنه الحديث ذاق طعم الإيمان من رضي بالله ربا . الحديث . والوبال سوء العاقبة ، والمرعى الوبيل هو الذي يتأذى به بعد أكله ، وطعام وبيل إذا كان ثقيلا ; ومنه قوله :\nفمرت كهاة ذات خيف جلالة عقيلة شيخ كالوبيل يلندد\nوعبر بأمره عن جميع حاله .\nالموفية ثلاثين : قوله تعالى : عفا الله عما سلف يعني في جاهليتكم من قتلكم الصيد ; قاله عطاء بن أبي رباح وجماعة معه ، وقيل : قبل نزول الكفارة . ومن عاد يعني للمنهي فينتقم الله منه أي : بالكفارة ، وقيل : المعنى فينتقم الله منه يعني في الآخرة إن كان مستحلا ; ويكفر في ظاهر الحكم ، وقال شريح وسعيد بن جبير : يحكم عليه في أول مرة ، فإذا عاد لم يحكم عليه ، وقيل له : اذهب ينتقم الله منك ، أي : ذنبك أعظم من أن يكفر ، كما أن اليمين الفاجرة لا كفارة لها عند أكثر أهل العلم لعظم إثمها ، والمتورعون يتقون النقمة بالتكفير ، وقد روي عن ابن عباس : يملأ ظهره سوطا حتى يموت ، وروي عن زيد بن أبي المعلى : أن رجلا أصاب صيدا وهو محرم فتجوز عنه ، ثم عاد فأنزل الله عز وجل نارا من السماء فأحرقته ; وهذه عبرة للأمة وكف للمعتدين عن المعصية .\nقوله تعالى : والله عزيز ذو انتقام عزيز أي : منيع في ملكه ، ولا يمتنع عليه ما يريده . ذو انتقام ممن عصاه إن شاء .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡتُلُواْ ٱلصَّيۡدَ وَأَنتُمۡ حُرُمٞۚ وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدٗا فَجَزَآءٞ مِّثۡلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ يَحۡكُمُ بِهِۦ ذَوَا عَدۡلٖ مِّنكُمۡ هَدۡيَۢا بَٰلِغَ ٱلۡكَعۡبَةِ أَوۡ كَفَّٰرَةٞ طَعَامُ مَسَٰكِينَ أَوۡ عَدۡلُ ذَٰلِكَ صِيَامٗا لِّيَذُوقَ وَبَالَ أَمۡرِهِۦۗ عَفَا ٱللَّهُ عَمَّا سَلَفَۚ وَمَنۡ عَادَ فَيَنتَقِمُ ٱللَّهُ مِنۡهُۚ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ ٥٩\n                                        \n                                        \n                                        \n                                        ثم صرح بالنهي عن قتل الصيد في حال الإحرام، فقال: { يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقْتُلُوا الصَّيْدَ وَأَنْتُمْ حُرُمٌ } أي: محرمون في الحج والعمرة، والنهي عن قتله يشمل النهي عن مقدمات القتل، وعن المشاركة في القتل، والدلالة عليه، والإعانة على قتله، حتى إن من تمام ذلك أنه ينهى المحرم عن أكل ما قُتل أو صيد لأجله، وهذا كله تعظيم لهذا النسك العظيم، أنه يحرم على المحرم قتل وصيد ما كان حلالا له قبل الإحرام. وقوله: { وَمَنْ قَتَلَهُ مِنْكُمْ مُتَعَمِّدًا } أي: قتل صيدا عمدا { فـ } عليه { جزاء مِثْلُ مَا قَتَلَ مِنَ النَّعَمِ } أي: الإبل، أو البقر، أو الغنم، فينظر ما يشبه شيئا من ذلك، فيجب عليه مثله، يذبحه ويتصدق به. والاعتبار بالمماثلة أن { يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِنْكُمْ } أي: عدلان يعرفان الحكم، ووجه الشبه، كما فعل الصحابة رضي الله عنهم، حيث قضوا بالحمامة شاة، وفي النعامة بدنة، وفي بقر الوحش -على اختلاف أنواعه- بقرة، وهكذا كل ما يشبه شيئا من النعم، ففيه مثله، فإن لم يشبه شيئا ففيه قيمته، كما هو القاعدة في المتلفات، وذلك الهدي لا بد أن يكون { هَدْيًا بَالِغَ الْكَعْبَةِ } أي: يذبح في الحرم. { أَوْ كَفَّارَةٌ طَعَامُ مَسَاكِينَ } أي: كفارة ذلك الجزاء طعام مساكين، أي: يجعل مقابلة المثل من النعم، طعام يطعم المساكين. قال كثير من العلماء: يقوم الجزاء، فيشترى بقيمته طعام، فيطعم كل مسكين مُدَّ بُرٍّ أو نصفَ صاع من غيره. { أَوْ عَدْلُ ذَلِكَ } الطعام { صِيَامًا } أي: يصوم عن إطعام كل مسكين يوما. { لِيَذُوقَ } بإيجاب الجزاء المذكور عليه { وَبَالَ أَمْرِهِ } { وَمَنْ عَادَ } بعد ذلك { فَيَنْتَقِمُ اللَّهُ مِنْهُ وَاللَّهُ عَزِيزٌ ذُو انْتِقَامٍ } وإنما نص الله على المتعمد لقتل الصيد، مع أن الجزاء يلزم المتعمد والمخطيء، كما هو القاعدة الشرعية -أن المتلف للنفوس والأموال المحترمة، فإنه يضمنها على أي حال كان، إذا كان إتلافه بغير حق، لأن الله رتب عليه الجزاء والعقوبة والانتقام، وهذا للمتعمد. وأما المخطئ فليس عليه عقوبة، إنما عليه الجزاء، [هذا جواب الجمهور من هذا القيد الذي ذكره الله. وطائفة من أهل العلم يرون تخصيص الجزاء بالمتعمد وهو ظاهر الآية. والفرق بين هذا وبين التضمين في الخطأ في النفوس والأموال في هذا الموضع الحق فيه لله، فكما لا إثم لا جزاء لإتلافه نفوس الآدميين وأموالهم]\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡتُلُواْ ٱلصَّيۡدَ وَأَنتُمۡ حُرُمٞۚ وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدٗا فَجَزَآءٞ مِّثۡلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ يَحۡكُمُ بِهِۦ ذَوَا عَدۡلٖ مِّنكُمۡ هَدۡيَۢا بَٰلِغَ ٱلۡكَعۡبَةِ أَوۡ كَفَّٰرَةٞ طَعَامُ مَسَٰكِينَ أَوۡ عَدۡلُ ذَٰلِكَ صِيَامٗا لِّيَذُوقَ وَبَالَ أَمۡرِهِۦۗ عَفَا ٱللَّهُ عَمَّا سَلَفَۚ وَمَنۡ عَادَ فَيَنتَقِمُ ٱللَّهُ مِنۡهُۚ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ ٥٩"
    }
  ]
}