{
  "number": 128,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 790,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَجَعَلَ الظُّلُمَاتِ وَالنُّورَ ۖ ثُمَّ الَّذِينَ كَفَرُوا بِرَبِّهِمْ يَعْدِلُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 1,
      "juz": 7,
      "manzil": 2,
      "page": 128,
      "ruku": 102,
      "hizbQuarter": 51,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَۖ ثُمَّ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ يَعۡدِلُونَ ١\n                                    \n                                    \n                                    [ بسم الله الرحمن الرحيم وبه الثقة وما توفيقي إلا بالله ] تفسير سورة الأنعام [ وهي مكية ] قال العوفي وعكرمة وعطاء ، عن ابن عباس : أنزلت سورة الأنعام بمكة سبب نزولها . وقال الطبراني : حدثنا علي بن عبد العزيز ، حدثنا حجاج بن منهال ، حدثنا حماد بن سلمة ، عن علي بن زيد ، عن يوسف بن مهران ، عن ابن عباس ، قال : نزلت سورة الأنعام بمكة ليلا جملة ، حولها سبعون ألف ملك يجأرون حولها بالتسبيح\nوقال سفيان الثوري ، عن ليث ، عن شهر بن حوشب عن أسماء بنت يزيد قالت : نزلت سورة الأنعام على النبي - صلى الله عليه وسلم - جملة [ واحدة ] وأنا آخذة بزمام ناقة النبي - صلى الله عليه وسلم - ، إن كادت من ثقلها لتكسر عظام الناقة\nوقال شريك ، عن ليث ، عن شهر ، عن أسماء قالت : نزلت سورة الأنعام على رسول الله - صلى الله عليه وسلم - وهو في مسير في زجل من الملائكة وقد نظموا ما بين السماء والأرض\nوقال السدي ، عن مرة ، عن عبد الله قال : نزلت سورة الأنعام يشيعها سبعون ألفا من الملائكة .\nوروي نحوه من وجه آخر ، عن ابن مسعود .\nوقال الحاكم في مستدركه : حدثنا أبو عبد الله محمد بن يعقوب الحافظ وأبو الفضل الحسن بن يعقوب العدل قالا حدثنا محمد بن عبد الوهاب العبدي ، أخبرنا جعفر بن عون ، حدثنا إسماعيل بن عبد الرحمن السدي ، حدثنا محمد بن المنكدر عن جابر قال : لما نزلت سورة الأنعام سبح رسول الله - صلى الله عليه وسلم - ، ثم قال : \" لقد شيع هذه السورة من الملائكة ما سد الأفق \" . ثم قال : صحيح على شرط مسلم\nوقال أبو بكر بن مردويه : حدثنا محمد بن معمر ، حدثنا إبراهيم بن درستويه الفارسي ، حدثنا أبو بكر بن أحمد بن محمد بن سالم ، حدثنا ابن أبي فديك ، حدثني عمر بن طلحة الرقاشي ، عن نافع بن مالك أبي سهيل ، عن أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - : \" نزلت سورة الأنعام معها موكب من الملائكة ، سد ما بين الخافقين لهم زجل بالتسبيح والأرض بهم ترتج \" ، ورسول الله [ صلى الله عليه وسلم ] يقول : \" سبحان الله العظيم ، سبحان الله العظيم \"\nثم روى ابن مردويه ، عن الطبراني ، عن إبراهيم بن نائلة ، عن إسماعيل بن عمرو ، عن يوسف بن عطية ، عن ابن عون ، عن نافع ، عن ابن عمر قال : قال رسول الله : \" نزلت علي سورة الأنعام جملة واحدة ، وشيعها سبعون ألفا من الملائكة ، لهم زجل بالتسبيح والتحميد \"\nيقول الله تعالى مادحا نفسه الكريمة ، وحامدا لها على خلقه السموات والأرض قرارا لعباده وجعل الظلمات والنور منفعة لعباده في ليلهم ونهارهم ، فجمع لفظ \" الظلمات \" ووحد لفظ \" النور \" ; لكونه أشرف ، كما قال ( عن اليمين والشمائل ) [ النحل : 48 ] ، وكما قال في آخر هذه السورة ( وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله ) [ الأنعام : 153 ] .\nوقوله : ( ثم الذين كفروا بربهم يعدلون ) أي : ومع هذا كله كفر به بعض عباده ، وجعلوا معه شريكا وعدلا واتخذوا له صاحبة وولدا ، تعالى عن ذلك علوا كبيرا .\n                                    ",
        "qortoby": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَۖ ثُمَّ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ يَعۡدِلُونَ ١\n                                    \n                                    \n                                    سورة الأنعام\nوهي مكية في قول الأكثرين قال ابن عباس وقتادة : هي مكية كلها إلا آيتين منها نزلتا بالمدينة ، قوله تعالى : وما قدروا الله حق قدره نزلت في مالك بن الصيف وكعب بن الأشرف اليهوديين والأخرى قوله : وهو الذي أنشأ جنات معروشات وغير معروشات نزلت في ثابت بن قيس بن شماس الأنصاري ، وقال ابن جريج : نزلت في معاذ بن جبل ، وقال الماوردي . وقال الثعلبي سورة \" الأنعام \" مكية إلا ست آيات نزلت بالمدينة وما قدروا الله حق قدره إلى آخر ثلاث آيات و قل تعالوا أتل ما حرم ربكم عليكم إلى آخر ثلاث آيات قال ابن عطية : وهي الآيات المحكمات وذكر ابن العربي : أن قوله تعالى : قل لا أجد نزل بمكة يوم عرفة وسيأتي القول في جميع ذلك إن شاء الله وفي الخبر أنها نزلت جملة واحدة غير الست الآيات وشيعها سبعون ألف ملك مع آية واحدة منها اثنا عشر ألف ملك وهي وعنده مفاتح الغيب لا يعلمها إلا هو نزلوا بها ليلا لهم زجل بالتسبيح والتحميد فدعا رسول الله صلى الله عليه وسلم الكتاب فكتبوها من ليلتهم وأسند أبو جعفر النحاس قال : حدثنا محمد بن يحيى ، حدثنا أبو حاتم روح بن الفرج مولى الحضارمة ، قال حدثنا أحمد بن محمد أبو بكر العمري ، حدثنا ابن أبي فديك ، حدثني عمر بن طلحة بن علقمة بن وقاص ، عن نافع أبي سهل بن مالك ، عن أنس بن مالك ، قال : قال رسول الله ، صلى الله عليه وسلم : نزلت سورة الأنعام معها موكب من الملائكة سد ما بين الخافقين لهم زجل بالتسبيح والأرض لهم ترتج ورسول الله - صلى الله عليه وسلم - يقول : سبحان ربي العظيم ثلاث مرات وذكر الدارمي أبو محمد في مسنده ، عن عمر بن الخطاب رضي الله عنه ، قال : الأنعام من نجائب القرآن . وفيه عن كعب ، قال : فاتحة \" التوراة \" فاتحة الأنعام وخاتمتها خاتمة \" هود \" . وقاله وهب بن منبه أيضا وذكر المهدوي قال المفسرون إن \" التوراة \" افتتحت بقوله : الحمد لله الذي خلق السماوات والأرض الآية . وختمت بقوله الحمد لله الذي لم يتخذ ولدا ولم يكن له شريك في الملك إلى آخر الآية . وذكر الثعلبي عن جابر عن النبي - صلى الله عليه وسلم - قال من قرأ ثلاث آيات من أول سورة \" الأنعام \" إلى قوله : ويعلم ما تكسبون وكل الله به أربعين ألف ملك يكتبون له مثل عبادتهم إلى يوم القيامة وينزل ملك من السماء السابعة ومعه مرزبة من حديد ، فإذا أراد الشيطان أن يوسوس له أو يوحي في قلبه شيئا ضربه ضربة فيكون بينه وبينه سبعون حجابا فإذا كان يوم القيامة قال الله تعالى : امش في ظلي يوم لا ظل إلا ظلي وكل من ثمار جنتي واشرب من ماء الكوثر واغتسل من ماء السلسبيل فأنت عبدي وأنا ربك . وفي البخاري عن ابن عباس قال : إذا سرك أن تعلم جهل العرب فاقرأ ما فوق الثلاثين ومائة من سورة \" الأنعام \" قد خسر الذين قتلوا أولادهم سفها بغير علم إلى قوله : وما كانوا مهتدين\nتنبيه : قال العلماء : هذه السورة أصل في محاجة المشركين وغيرهم من المبتدعين ومن كذب بالبعث والنشور وهذا يقتضي إنزالها جملة واحدة لأنها في معنى واحد من الحجة وإن تصرف ذلك بوجوه كثيرة وعليها بنى المتكلمون أصول الدين لأن فيها آيات بينات ترد على القدرية دون السور التي تذكر والمذكورات ، وسنزيد ذلك بيانا إن شاء الله بحول الله تعالى .\nبسم الله الرحمن الرحيم\nالحمد لله الذي خلق السماوات والأرض وجعل الظلمات والنور ثم الذين كفروا بربهم يعدلون\nفيه خمس مسائل :\nالأولى : قوله تعالى : الحمد لله بدأ سبحانه فاتحتها بالحمد على نفسه ، وإثبات الألوهية ، أي : إن الحمد كله له فلا شريك له ، فإن قيل : فقد افتتح غيرها بالحمد لله فكان الاجتزاء بواحدة يغني عن سائره ، فيقال : لأن لكل واحدة منه معنى في موضعه لا يؤدي عنه غيره من أجل عقده بالنعم المختلفة ، وأيضا فلما فيه من الحجة في هذا الموضع على الذين هم بربهم يعدلون ، وقد تقدم معنى الحمد في الفاتحة .\nالثانية : قوله تعالى : الذي خلق السماوات والأرض أخبر عن قدرته وعلمه وإرادته فقال : الذي خلق ، أي : اخترع وأوجد وأنشأ وابتدع والخلق يكون بمعنى الاختراع ويكون بمعنى التقدير ، وقد تقدم وكلاهما مراد هنا وذلك دليل على حدوثهما فرفع السماء بغير عمد وجعلها مستوية من غير أود ، وجعل فيها الشمس والقمر آيتين وزينها بالنجوم وأودعها السحاب والغيوم علامتين ، وبسط الأرض وأودعها الأرزاق والنبات ، وبث فيها من كل دابة آيات جعل فيها الجبال أوتادا ، وسبلا فجاجا ، وأجرى فيها الأنهار والبحار ، وفجر فيها العيون من الأحجار ، دلالات على وحدانيته ، وعظيم قدرته وأنه هو الله الواحد القهار ، وبين بخلقه السماوات والأرض أنه خالق كل شيء .\nالثالثة : خرج مسلم قال : حدثني سريج بن يونس ، وهارون بن عبد الله ، قالا : حدثنا حجاج بن محمد ، قال : قال ابن جريج : أخبرني إسماعيل بن أمية ، عن أيوب بن خالد ، عن عبد الله بن رافع مولى أم سلمة ، عن أبي هريرة ، قال : أخذ رسول الله صلى الله عليه وسلم بيدي فقال : خلق الله عز وجل التربة يوم السبت وخلق فيها الجبال يوم الأحد وخلق الشجر يوم الاثنين وخلق المكروه يوم الثلاثاء وخلق النور يوم الأربعاء وبث فيها الدواب يوم الخميس وخلق آدم عليه السلام بعد العصر من يوم الجمعة في آخر الخلق في آخر ساعة من ساعات الجمعة فيما بين العصر إلى الليل .\nقلت : أدخل العلماء هذا الحديث تفسيرا لفاتحة هذه السورة ; قال البيهقي : وزعم أهل العلم بالحديث أنه غير محفوظ لمخالفة ما عليه أهل التفسير وأهل التواريخ . وزعم بعضهم أن إسماعيل بن أمية إنما أخذه عن إبراهيم بن أبي يحيى ، عن أيوب بن خالد ، وإبراهيم غير محتج به ، وذكر محمد بن يحيى ، قال : سألت علي بن المديني عن حديث أبى هريرة خلق الله التربة يوم السبت . فقال علي : هذا حديث مدني رواه هشام بن يوسف ، عن ابن جريج ، عن إسماعيل بن أمية ، عن أيوب بن خالد ، عن أبي رافع مولى أم سلمة ، عن أبي هريرة ، قال : أخذ رسول الله - صلى الله عليه وسلم - بيدي . قال علي : وشبك بيدي إبراهيم بن أبي يحيى ، فقال لي : شبك بيدي أيوب بن خالد ، وقال لي شبك بيدي عبد الله بن رافع ، وقال لي : شبك بيدي أبو هريرة ، وقال لي : شبك بيدي أبو القاسم رسول الله - صلى الله عليه وسلم - فقال : خلق الله الأرض يوم السبت فذكر الحديث بنحوه . قال علي بن المديني : وما أرى إسماعيل بن أمية أخذ هذا الأمر إلا من إبراهيم بن أبي يحيى ، قال البيهقي : وقد تابعه على ذلك موسى بن عبيدة الربذي ، عن أيوب بن خالد إلا أن موسى بن عبيدة ضعيف . وروي عن بكر بن الشرود ، عن إبراهيم بن أبي يحيى ، عن صفوان بن سليم ، عن أيوب بن خالد ، وإسناده ضعيف ، عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - قال : إن في الجمعة ساعة لا يوافقها أحد يسأل الله عز وجل فيها شيئا إلا أعطاه إياه قال : فقال عبد الله بن سلام : إن الله عز وجل ابتدأ الخلق فخلق الأرض يوم الأحد ويوم الاثنين ، وخلق السماوات يوم الثلاثاء ويوم الأربعاء ، وخلق الأقوات وما في الأرض يوم الخميس ويوم الجمعة إلى صلاة العصر ، وما بين صلاة العصر إلى أن تغرب الشمس خلق آدم . خرجه البيهقي .\nقلت : وفيه أن الله تعالى بدأ الخلق يوم الأحد لا يوم السبت . وكذلك تقدم في البقرة عن ابن مسعود وغيره من أصحاب النبي صلى الله عليه وسلم وتقدم فيها الاختلاف أيما خلق أولا الأرض أو السماء مستوفى والحمد لله .\nالرابعة : قوله تعالى : وجعل الظلمات والنور ذكر بعد خلق الجواهر خلق الأعراض لكون الجوهر لا يستغني عنه وما لا يستغني عن الحوادث فهو حادث . والجوهر في اصطلاح المتكلمين هو الجزء الذي لا يتجزأ الحامل للعرض ، وقد أتينا على ذكره في الكتاب الأسنى في شرح أسماء الله الحسنى في اسمه \" الواحد \" ، وسمي العرض عرضا ، لأنه يعرض في الجسم والجوهر فيتغير به من حال إلى حال ، والجسم هو المجتمع ، وأقل ما يقع عليه اسم الجسم جوهران مجتمعان ، وهذه الاصطلاحات وإن لم تكن موجودة في الصدر الأول فقد دل عليها معنى الكتاب والسنة ، فلا معنى لإنكارها ، وقد استعملها العلماء واصطلحوا عليها وبنوا عليها كلامهم ، وقتلوا بها خصومهم ، كما تقدم في البقرة . واختلف العلماء في المعنى المراد بالظلمات والنور ، فقال السدي وقتادة وجمهور المفسرين : المراد سواد الليل وضياء النهار ، وقال الحسن : الكفر والإيمان ، قال ابن عطية : وهذا خروج عن الظاهر .\nقلت : اللفظ يعمه ، وفي التنزيل : أومن كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات ، والأرض هنا اسم للجنس فإفرادها في اللفظ بمنزلة جمعها ، وكذلك والنور ومثله ثم يخرجكم طفلا وقال الشاعر :\nكلوا في بعض بطنكم تعفوا فإن زمانكم زمن خميص\nوقد تقدم وجعل هنا بمعنى خلق لا يجوز غيره قاله ابن عطية .\nقلت : وعليه يتفق اللفظ والمعنى في النسق ، فيكون الجمع معطوفا على الجمع ، والمفرد معطوفا على المفرد ، فيتجانس اللفظ وتظهر الفصاحة ، والله أعلم ، وقيل : جمع الظلمات ووحد النور لأن الظلمات لا تتعدى والنور يتعدى ، وحكى الثعلبي أن بعض أهل المعاني قال : جعل هنا زائدة والعرب تزيد \" جعل \" في الكلام كقول الشاعر :\nوقد جعلت أرى الاثنين أربعة والواحد اثنين لما هدني الكبر\nقال النحاس : جعل بمعنى خلق وإذا كانت بمعنى خلق لم تتعد إلا إلى مفعول واحد . وقد تقدم هذا المعنى ، ومحامل ( جعل ) في \" البقرة \" مستوفى .\nالخامسة : قوله تعالى : ثم الذين كفروا بربهم يعدلون ابتداء وخبر ، والمعنى : ثم الذين كفروا يجعلون لله عدلا وشريكا ، وهو الذي خلق هذه الأشياء وحده ، قالابن عطية : ف ( ثم ) دالة على قبح فعل الكافرين لأن المعنى : أن خلقه السماوات والأرض قد تقرر وآياته قد سطعت ، وإنعامه بذلك قد تبين ، ثم بعد ذلك كله عدلوا بربهم ، فهذا كما تقول : يا فلان ، أعطيتك وأكرمتك وأحسنت إليك ثم تشتمني ، ولو وقع العطف بالواو في هذا ونحوه لم يلزم التوبيخ كلزومه بثم ، والله أعلم .\n                                    ",
        "saadi": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَۖ ثُمَّ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ يَعۡدِلُونَ ١\n                                        \n                                        \n                                        \n                                        هذا إخبار عن حمده والثناء عليه بصفات الكمال، ونعوت العظمة والجلال عموما، وعلى هذه المذكورات خصوصا. فحمد نفسه على خلقه السماوات والأرض، الدالة على كمال قدرته، وسعة علمه ورحمته، وعموم حكمته، وانفراده بالخلق والتدبير، وعلى جعله الظلمات والنور، وذلك شامل للحسي من ذلك، كالليل والنهار، والشمس والقمر. والمعنوي، كظلمات الجهل، والشك، والشرك، والمعصية، والغفلة، ونور العلم والإيمان، واليقين، والطاعة، وهذا كله، يدل دلالة قاطعة أنه تعالى، هو المستحق للعبادة، وإخلاص الدين له، ومع هذا الدليل ووضوح البرهان { ثُمَّ الَّذِينَ كَفَرُوا بِرَبِّهِمْ يَعْدِلُونَ } أي يعدلون به سواه، يسوونهم به في العبادة والتعظيم، مع أنهم لم يساووا الله في شيء من الكمال، وهم فقراء عاجزون ناقصون من كل وجه.\n                                    "
      },
      "originalText": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَۖ ثُمَّ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ يَعۡدِلُونَ ١"
    },
    {
      "number": 791,
      "text": "هُوَ الَّذِي خَلَقَكُمْ مِنْ طِينٍ ثُمَّ قَضَىٰ أَجَلًا ۖ وَأَجَلٌ مُسَمًّى عِنْدَهُ ۖ ثُمَّ أَنْتُمْ تَمْتَرُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 2,
      "juz": 7,
      "manzil": 2,
      "page": 128,
      "ruku": 102,
      "hizbQuarter": 51,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱلَّذِي خَلَقَكُم مِّن طِينٖ ثُمَّ قَضَىٰٓ أَجَلٗاۖ وَأَجَلٞ مُّسَمًّى عِندَهُۥۖ ثُمَّ أَنتُمۡ تَمۡتَرُونَ ٢\n                                    \n                                    \n                                    وقوله : ( هو الذي خلقكم من طين ) يعني : أباهم آدم الذي هو أصلهم ومنه خرجوا ، فانتشروا في المشارق والمغارب .\nوقوله : ( ثم قضى أجلا وأجل مسمى عنده ) قال سعيد بن جبير ، عن ابن عباس : ( ثم قضى أجلا ) يعني : الموت ( وأجل مسمى عنده ) يعني : الآخرة .\nوهكذا روي عن مجاهد وعكرمة وسعيد بن جبير والحسن وقتادة والضحاك وزيد بن أسلم وعطية والسدي ومقاتل بن حيان ، وغيرهم .\nوقول الحسن - في رواية عنه : ( ثم قضى أجلا ) قال : ما بين أن يخلق إلى أن يموت ( وأجل مسمى عنده ) ما بين أن يموت إلى أن يبعث - هو يرجع إلى ما تقدم ، وهو تقدير الأجل الخاص ، وهو عمر كل إنسان ، وتقدير الأجل العام ، وهو عمر الدنيا بكمالها ثم انتهائها وانقضائها وزوالها ، [ وانتقالها ] والمصير إلى الدار الآخرة .\nوعن ابن عباس ومجاهد : ( ثم قضى أجلا ) يعني : مدة الدنيا ( وأجل مسمى عنده ) يعني : عمر الإنسان إلى حين موته ، وكأنه مأخوذ من قوله تعالى بعد هذا : ( وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار ثم [ يبعثكم فيه ليقضى أجل مسمى ثم إليه مرجعكم ] ) الآية [ الأنعام : 60 ] .\nوقال عطية ، عن ابن عباس ( ثم قضى أجلا ) يعني : النوم ، يقبض فيه الروح ، ثم يرجع إلى صاحبه عند اليقظة ( وأجل مسمى عنده ) يعني : أجل موت الإنسان ، وهذا قول غريب .\nومعنى قوله : ( عنده ) أي : لا يعلمه إلا هو ، كقوله تعالى : ( إنما علمها عند ربي لا يجليها لوقتها إلا هو ) [ الأعراف : 187 ] ، وكقوله ( يسألونك عن الساعة أيان مرساها فيم أنت من ذكراها إلى ربك منتهاها ) [ النازعات : 42 - 44 ] .\nوقوله : ( ثم أنتم تمترون ) قال السدي وغيره : يعني تشكون في أمر الساعة .\n                                    ",
        "qortoby": "هُوَ ٱلَّذِي خَلَقَكُم مِّن طِينٖ ثُمَّ قَضَىٰٓ أَجَلٗاۖ وَأَجَلٞ مُّسَمًّى عِندَهُۥۖ ثُمَّ أَنتُمۡ تَمۡتَرُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : هو الذي خلقكم من طين ثم قضى أجلا وأجل مسمى عنده ثم أنتم تمترون\nقوله تعالى : هو الذي خلقكم من طين الآية خبر وفي معناه قولان : أحدهما : وهو الأشهر ، وعليه من الخلق الأكثر ، أن المراد آدم عليه السلام والخلق نسله ، والفرع يضاف إلى أصله ، فلذلك قال : خلقكم بالجمع فأخرجه مخرج الخطاب لهم إذ كانوا ولده ; هذا قول الحسن ، وقتادة ، وابن أبي نجيح ، والسدي ، والضحاك ، وابن زيد وغيرهم ، الثاني : أن تكون النطفة خلقها الله من طين على الحقيقة ثم قلبها حتى كان الإنسان منها ، ذكره النحاس .\nقلت : وبالجملة فلما ذكر جل وعز خلق العالم الكبير ذكر بعده خلق العالم الصغير وهو الإنسان ، وجعل فيه ما في العالم الكبير ، على ما بيناه في \" البقرة \" في آية التوحيد ، والله أعلم ، والحمد لله وقد روى أبو نعيم الحافظ في كتابه عن مرة ، عن ابن مسعود ، أن الملك الموكل بالرحم يأخذ النطفة فيضعها على كفه ، ثم يقول : يا رب ، مخلقة أو غير مخلقة ؟ فإن قال مخلقة ، قال : يا رب ، ما الرزق ، ما الأثر ، ما الأجل ؟ فيقول : انظر في أم الكتاب ، فينظر في اللوح المحفوظ فيجد فيه رزقه وأثره وأجله وعمله ، ويأخذ التراب الذي يدفن في بقعته ويعجن به نطفته ، فذلك قوله تعالى : منها خلقناكم وفيها نعيدكم . وخرج عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : ما من مولود إلا وقد ذر عليه من تراب حفرته .\nقلت : وعلى هذا يكون كل إنسان مخلوقا من طين وماء مهين ، كما أخبر جل وعز في سورة \" المؤمنون \" فتنتظم الآيات والأحاديث ، ويرتفع الإشكال والتعارض ، والله أعلم ، وأما الإخبار عن خلق آدم عليه السلام فقد تقدم في ( البقرة ) ذكره واشتقاقه ، ونزيد هنا طرفا من ذلك ونعته وسنه ووفاته ، ذكر ابن سعد في \" الطبقات \" عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم : الناس ولد آدم وآدم من التراب وعن سعيد بن جبير قال : خلق الله آدم عليه السلام من أرض يقال لها دجناء ، قال الحسن : وخلق جؤجؤه من ضرية ، قال الجوهري : ضرية قرية لبني كلاب على طريق البصرة وهي إلى مكة أقرب ، وعن ابن مسعود ، قال : إن الله تعالى بعث إبليس فأخذ من أديم الأرض من عذبها ومالحها فخلق منه آدم عليه السلام فكل شيء خلقه من عذبها فهو صائر إلى الجنة وإن كان ابن كافر ، وكل شيء خلقه من مالحها فهو صائر إلى النار ، وإن كان ابن تقي فمن ثم قال إبليس أأسجد لمن خلقت طينا لأنه جاء بالطينة فسمي آدم ; لأنه خلق من أديم الأرض ، وعن عبد الله بن سلام قال : خلق الله آدم في آخر يوم الجمعة ، وعن ابن عباس قال : لما خلق الله آدم كان رأسه يمس السماء ، قال فوطده إلى الأرض حتى صار ستين ذراعا في سبعة أذرع عرضا ، وعن أبي بن كعب ، قال : كان آدم عليه السلام طوالا جعدا كأنه نخلة سحوق ، وعن ابن عباس في حديث فيه طول وحج آدم عليه السلام من الهند إلى مكة أربعين حجة على رجليه ، وكان آدم حين أهبط تمسح رأسه السماء ، فمن ثم صلع وأورث ولده الصلع ونفرت من طوله دواب البر فصارت وحشا من يومئذ ، ولم يمت حتى بلغ ولده وولد ولده أربعين ألفا ، وتوفي على ذروة الجبل الذي أنزل عليه ، فقال شيث لجبريل عليهما السلام : \" صل على آدم \" فقال له جبريل عليه السلام : تقدم أنت فصل على أبيك وكبر عليه ثلاثين تكبيرة ، فأما خمس فهي الصلاة ، وخمس وعشرون تفضيلا لآدم . وقيل : كبر عليه أربعا ، فجعل بنو شيث آدم في مغارة وجعلوا عليها حافظا لا يقربه أحد من بني قابيل وكان الذين يأتونه ويستغفرون له بنو شيث ، وكان عمر آدم تسعمائة سنة وستا وثلاثين سنة . ويقال : هل في الآية دليل على أن الجواهر من جنس واحد ؟ الجواب : نعم لأنه إذا جاز أن ينقلب الطين إنسانا حيا قادرا عليما ، جاز أن ينقلب إلى كل حال من أحوال الجواهر ، لتسوية العقل بين ذلك في الحكم ، وقد صح انقلاب الجماد إلى الحيوان بدلالة هذه الآية .\nقوله تعالى : ثم قضى أجلا مفعول . وأجل مسمى عنده ابتداء وخبر ، قال الضحاك : أجلا في الموت وأجل مسمى عنده أجل القيامة فالمعنى على هذا : حكم أجلا ، وأعلمكم أنكم تقيمون إلى الموت ، ولم يعلمكم بأجل القيامة . وقال الحسن ومجاهد وعكرمة وخصيف وقتادة ، وهذا لفظ الحسن : قضى أجل الدنيا من يوم خلقك إلى أن تموت وأجل مسمى عنده يعني الآخرة . وقيل : قضى أجلا ما أعلمناه من أنه لا نبي بعد محمد صلى الله عليه وسلم ، وأجل مسمى من الآخرة ، وقيل : قضى أجلا مما نعرفه من أوقات الأهلة والزرع وما أشبههما ، وأجل مسمى أجل الموت ، لا يعلم الإنسان متى يموت ، وقال ابن عباس ومجاهد : معنى الآية قضى أجلا بقضاء الدنيا ، وأجل مسمى عنده لابتداء الآخرة . وقيل : الأول قبض الأرواح في النوم ، والثاني قبض الروح عند الموت ، عن ابن عباس أيضا .\nقوله تعالى : ثم أنتم تمترون ابتداء وخبر : أي : تشكون في أنه إله واحد ، وقيل : تمارون في ذلك أي : تجادلون جدال الشاكين ، والتماري المجادلة على مذهب الشك ، ومنه قوله تعالى : أفتمارونه على ما يرى .\n                                    ",
        "saadi": "هُوَ ٱلَّذِي خَلَقَكُم مِّن طِينٖ ثُمَّ قَضَىٰٓ أَجَلٗاۖ وَأَجَلٞ مُّسَمًّى عِندَهُۥۖ ثُمَّ أَنتُمۡ تَمۡتَرُونَ ٢\n                                        \n                                        \n                                        \n                                        { هُوَ الَّذِي خَلَقَكُمْ مِنْ طِينٍ } وذلك بخلق مادتكم وأبيكم آدم عليه السلام. { ثُمَّ قَضَى أَجَلًا } أي: ضرب لمدة إقامتكم في هذه الدار أجلا، تتمتعون به وتمتحنون، وتبتلون بما يرسل إليكم به رسله. { لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا } ويعمركم ما يتذكر فيه من تذكر. { وَأَجَلٌ مُسَمًّى عِنْدَهُ } وهي: الدار الآخرة، التي ينتقل العباد إليها من هذه الدار، فيجازيهم بأعمالهم من خير وشر. { ثُمَّ } مع هذا البيان التام وقطع الحجة { أَنْتُمْ تَمْتَرُونَ } أي: تشكون في وعد الله ووعيده، ووقوع الجزاء يوم القيامة. وذكر الله الظلمات بالجمع، لكثرة موادها وتنوع طرقها. ووحد النور لكون الصراط الموصلة إلى الله واحدة لا تعدد فيها،، وهي: الصراط المتضمنة للعلم بالحق والعمل به، كما قال تعالى: { وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ }\n                                    "
      },
      "originalText": "هُوَ ٱلَّذِي خَلَقَكُم مِّن طِينٖ ثُمَّ قَضَىٰٓ أَجَلٗاۖ وَأَجَلٞ مُّسَمًّى عِندَهُۥۖ ثُمَّ أَنتُمۡ تَمۡتَرُونَ ٢"
    },
    {
      "number": 792,
      "text": "وَهُوَ اللَّهُ فِي السَّمَاوَاتِ وَفِي الْأَرْضِ ۖ يَعْلَمُ سِرَّكُمْ وَجَهْرَكُمْ وَيَعْلَمُ مَا تَكْسِبُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 3,
      "juz": 7,
      "manzil": 2,
      "page": 128,
      "ruku": 102,
      "hizbQuarter": 51,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَهُوَ ٱللَّهُ فِي ٱلسَّمَٰوَٰتِ وَفِي ٱلۡأَرۡضِ يَعۡلَمُ سِرَّكُمۡ وَجَهۡرَكُمۡ وَيَعۡلَمُ مَا تَكۡسِبُونَ ٣\n                                    \n                                    \n                                    وقوله : ( وهو الله في السماوات وفي الأرض يعلم سركم وجهركم ويعلم ما تكسبون ) اختلف مفسرو هذه الآية على أقوال ، بعد الاتفاق على تخطئة قول الجهمية الأول القائلين بأنه - تعالى عن قولهم علوا كبيرا - في كل مكان ; حيث حملوا الآية على ذلك ، فأصح الأقوال أنه المدعو الله في السموات وفي الأرض ، أي : يعبده ويوحده ويقر له بالإلهية من في السموات ومن في الأرض ، ويسمونه الله ، ويدعونه رغبا ورهبا ، إلا من كفر من الجن والإنس ، وهذه الآية على هذا القول كقوله تعالى : ( وهو الذي في السماء إله وفي الأرض إله ) [ الزخرف : 84 ] ، أي : هو إله من في السماء وإله من في الأرض ، وعلى هذا فيكون قوله : ( يعلم سركم وجهركم ) خبرا أو حالا .\nوالقول الثاني : أن المراد أن الله الذي يعلم ما في السموات وما في الأرض ، من سر وجهر . فيكون قوله : ( يعلم ) متعلقا بقوله : ( في السماوات وفي الأرض ) تقديره : وهو الله يعلم سركم وجهركم في السموات وفي الأرض ويعلم ما تكسبون .\nوالقول الثالث أن قوله ( وهو الله في السماوات ) وقف تام ، ثم استأنف الخبر فقال : ( وفي الأرض يعلم سركم وجهركم ويعلم ما تكسبون ) وهذا اختيار ابن جرير .\nوقوله : ( ويعلم ما تكسبون ) أي : جميع أعمالهم خيرها وشرها .\n                                    ",
        "qortoby": "وَهُوَ ٱللَّهُ فِي ٱلسَّمَٰوَٰتِ وَفِي ٱلۡأَرۡضِ يَعۡلَمُ سِرَّكُمۡ وَجَهۡرَكُمۡ وَيَعۡلَمُ مَا تَكۡسِبُونَ ٣\n                                    \n                                    \n                                    قوله تعالى : وهو الله في السماوات وفي الأرض يعلم سركم وجهركم ويعلم ما تكسبون وما تأتيهم من آية من آيات ربهم إلا كانوا عنها معرضين فقد كذبوا بالحق لما جاءهم فسوف يأتيهم أنباء ما كانوا به يستهزئون\nقوله تعالى : وهو الله في السماوات وفي الأرض يقال ما عامل الإعراب في الظرف من في السماوات وفي الأرض ؟ ففيه أجوبة : أحدها : أي : وهو الله المعظم أو المعبود في السماوات وفي الأرض ; كما تقول : زيد الخليفة في الشرق والغرب أي : حكمه ، ويجوز أن يكون المعنى وهو الله المنفرد بالتدبير في السماوات وفي الأرض ; كما تقول : هو في حاجات الناس وفي الصلاة ، ويجوز أن يكون خبرا بعد خبر ويكون المعنى : وهو الله في السماوات وهو الله في الأرض . وقيل : المعنى وهو الله يعلم سركم وجهركم في السماوات وفي الأرض فلا يخفى عليه شيء ; قالالنحاس : وهذا من أحسن ما قيل فيه ، وقال محمد بن جرير : وهو الله في السماوات ويعلم سركم وجهركم في الأرض ، ( فيعلم ) مقدم في الوجهين ، والأول أسلم وأبعد من الإشكال ، وقيل غير هذا ، والقاعدة تنزيهه جل وعز عن الحركة والانتقال وشغل الأمكنة . ويعلم ما تكسبون أي : من خير وشر ، والكسب الفعل لاجتلاب نفع أو دفع ضرر ، ولهذا لا يقال لفعل الله كسب .\n                                    ",
        "saadi": "وَهُوَ ٱللَّهُ فِي ٱلسَّمَٰوَٰتِ وَفِي ٱلۡأَرۡضِ يَعۡلَمُ سِرَّكُمۡ وَجَهۡرَكُمۡ وَيَعۡلَمُ مَا تَكۡسِبُونَ ٣\n                                        \n                                        \n                                        \n                                        أي: وهو المألوه المعبود في السماوات وفي الأرض، فأهل السماء والأرض، متعبدون لربهم، خاضعون لعظمته، مستكينون لعزه وجلاله، الملائكة المقربون، والأنبياء والمرسلون، والصديقون، والشهداء والصالحون. وهو تعالى يعلم سركم وجهركم ويعلم ما تكسبون، فاحذروا معاصيه وارغبوا في الأعمال التي تقربكم منه، وتدنيكم من رحمته، واحذروا من كل عمل يبعدكم منه ومن رحمته.\n                                    "
      },
      "originalText": "وَهُوَ ٱللَّهُ فِي ٱلسَّمَٰوَٰتِ وَفِي ٱلۡأَرۡضِ يَعۡلَمُ سِرَّكُمۡ وَجَهۡرَكُمۡ وَيَعۡلَمُ مَا تَكۡسِبُونَ ٣"
    },
    {
      "number": 793,
      "text": "وَمَا تَأْتِيهِمْ مِنْ آيَةٍ مِنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 4,
      "juz": 7,
      "manzil": 2,
      "page": 128,
      "ruku": 102,
      "hizbQuarter": 51,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ ٤\n                                    \n                                    \n                                    يقول تعالى مخبرا عن المشركين المكذبين المعاندين : إنهم مهما أتتهم ) من آية ) أي : دلالة ومعجزة وحجة ، من الدلالات على وحدانية الرب ، عز وجل ، وصدق رسله الكرام ، فإنهم يعرضون عنها ، فلا ينظرون فيها ولا يبالون بها .\n                                    ",
        "qortoby": "وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ ٤\n                                    \n                                    \n                                    قوله تعالى : وما تأتيهم من آية أي : علامة كانشقاق القمر ونحوها . و ( من ) لاستغراق الجنس ; تقول : ما في الدار من أحد . من آيات ربهم من الثانية للتبعيض . إلا كانوا عنها معرضين خبر كانوا . والإعراض ترك النظر في الآيات التي يجب أن يستدلوا بها على توحيد الله جل وعز من خلق السماوات والأرض وما بينهما ، وأنه يرجع إلى قديم حي غني عن جميع الأشياء قادر لا يعجزه شيء عالم لا يخفى عليه شيء من المعجزات التي أقامها لنبيه صلى الله عليه وسلم ; ليستدل بها على صدقه في جميع ما أتى به .\n                                    ",
        "saadi": "وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ ٤\n                                        \n                                        \n                                        \n                                        هذا إخبار منه تعالى عن إعراض المشركين، وشدة تكذيبهم وعداوتهم، وأنهم لا تنفع فيهم الآيات حتى تحل بهم المثلات، فقال: { وَمَا تَأْتِيهِمْ مِنْ آيَةٍ مِنْ آيَاتِ رَبِّهِم } الدالة على الحق دلالة قاطعة، الداعية لهم إلى اتباعه وقبوله { إِلَّا كَانُوا عَنْهَا مُعْرِضِين } لا يلقون لها بالا، ولا يصغون لها سمعا، قد انصرفت قلوبهم إلى غيرها، وولوها أدبارَهم.\n                                    "
      },
      "originalText": "وَمَا تَأۡتِيهِم مِّنۡ ءَايَةٖ مِّنۡ ءَايَٰتِ رَبِّهِمۡ إِلَّا كَانُواْ عَنۡهَا مُعۡرِضِينَ ٤"
    },
    {
      "number": 794,
      "text": "فَقَدْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ ۖ فَسَوْفَ يَأْتِيهِمْ أَنْبَاءُ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 5,
      "juz": 7,
      "manzil": 2,
      "page": 128,
      "ruku": 102,
      "hizbQuarter": 51,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَقَدۡ كَذَّبُواْ بِٱلۡحَقِّ لَمَّا جَآءَهُمۡ فَسَوۡفَ يَأۡتِيهِمۡ أَنۢبَٰٓؤُاْ مَا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ٥\n                                    \n                                    \n                                    قال الله تعالى : ( فقد كذبوا بالحق لما جاءهم فسوف يأتيهم أنباء ما كانوا به يستهزئون ) وهذا تهديد لهم ووعيد شديد على تكذيبهم بالحق ، بأنه لا بد أن يأتيهم خبر ما هم فيه من التكذيب ، وليجدن غبه ، وليذوقن وباله .\n                                    ",
        "qortoby": "فَقَدۡ كَذَّبُواْ بِٱلۡحَقِّ لَمَّا جَآءَهُمۡ فَسَوۡفَ يَأۡتِيهِمۡ أَنۢبَٰٓؤُاْ مَا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ٥\n                                    \n                                    \n                                    قوله تعالى : فقد كذبوا يعني مشركي مكة . بالحق يعني القرآن ، وقيل : بمحمد صلى الله عليه وسلم . فسوف يأتيهم أي : يحل بهم العقاب ; وأراد الأنباء - وهي الأخبار - العذاب ; كقولك : اصبر وسوف يأتيك الخبر أي العذاب ; والمراد ما نالهم يوم بدر ونحوه . وقيل : يوم القيامة .\n                                    ",
        "saadi": "فَقَدۡ كَذَّبُواْ بِٱلۡحَقِّ لَمَّا جَآءَهُمۡ فَسَوۡفَ يَأۡتِيهِمۡ أَنۢبَٰٓؤُاْ مَا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ٥\n                                        \n                                        \n                                        \n                                        { فَقَدْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ } والحق حقه أن يتبع، ويشكر الله على تيسيره لهم، وإتيانهم به، فقابلوه بضد ما يجب مقابلته به فاستحقوا العقاب الشديد. { فَسَوْفَ يَأْتِيهِمْ أَنْبَاءُ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ } أي: فسوف يرون ما استهزأوا به، أنه الحق والصدق، ويبين الله للمكذبين كذبهم وافتراءهم، وكانوا يستهزئون بالبعث والجنة والنار، فإذا كان يوم القيامة قيل للمكذبين: { هَذِهِ النَّارُ الَّتِي كُنتُم بِهَا تُكَذِّبُونَ } وقال تعالى: { وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَا يَبْعَثُ اللَّهُ مَنْ يَمُوتُ بَلَى وَعْدًا عَلَيْهِ حَقًّا وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ لِيُبَيِّنَ لَهُمُ الَّذِي يَخْتَلِفُونَ فِيهِ وَلِيَعْلَمَ الَّذِينَ كَفَرُوا أَنَّهُمْ كَانُوا كَاذِبِينَ }\n                                    "
      },
      "originalText": "فَقَدۡ كَذَّبُواْ بِٱلۡحَقِّ لَمَّا جَآءَهُمۡ فَسَوۡفَ يَأۡتِيهِمۡ أَنۢبَٰٓؤُاْ مَا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ٥"
    },
    {
      "number": 795,
      "text": "أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ مَكَّنَّاهُمْ فِي الْأَرْضِ مَا لَمْ نُمَكِّنْ لَكُمْ وَأَرْسَلْنَا السَّمَاءَ عَلَيْهِمْ مِدْرَارًا وَجَعَلْنَا الْأَنْهَارَ تَجْرِي مِنْ تَحْتِهِمْ فَأَهْلَكْنَاهُمْ بِذُنُوبِهِمْ وَأَنْشَأْنَا مِنْ بَعْدِهِمْ قَرْنًا آخَرِينَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 6,
      "juz": 7,
      "manzil": 2,
      "page": 128,
      "ruku": 102,
      "hizbQuarter": 51,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ مَّكَّنَّٰهُمۡ فِي ٱلۡأَرۡضِ مَا لَمۡ نُمَكِّن لَّكُمۡ وَأَرۡسَلۡنَا ٱلسَّمَآءَ عَلَيۡهِم مِّدۡرَارٗا وَجَعَلۡنَا ٱلۡأَنۡهَٰرَ تَجۡرِي مِن تَحۡتِهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِينَ ٦\n                                    \n                                    \n                                    ثم قال تعالى واعظا ومحذرا لهم أن يصيبهم من العذاب والنكال الدنيوي ما حل بأشباههم ونظرائهم من القرون السالفة الذين كانوا أشد منهم قوة ، وأكثر جمعا ، وأكثر أموالا وأولادا واستغلالا للأرض وعمارة لها ، فقال ( ألم يروا كم أهلكنا من قبلهم من قرن مكناهم في الأرض ما لم نمكن لكم ) أي : من الأموال والأولاد والأعمار ، والجاه العريض ، والسعة والجنود ( وأرسلنا السماء عليهم مدرارا ) أي : شيئا بعد شيء ( وجعلنا الأنهار تجري من تحتهم ) أي : أكثرنا عليهم أمطار السماء وينابيع الأرض ، أي : استدراجا وإملاء لهم ( فأهلكناهم بذنوبهم ) أي : بخطاياهم وسيئاتهم التي اجترموها ( وأنشأنا من بعدهم قرنا آخرين ) أي : فذهب الأولون كأمس الذاهب وجعلناهم أحاديث ( وأنشأنا من بعدهم قرنا آخرين ) أي : جيلا آخر لنختبرهم ، فعملوا مثل أعمالهم فهلكوا كهلاكهم . فاحذروا أيها المخاطبون أن يصيبكم [ مثل ] ما أصابهم ، فما أنتم بأعز على الله منهم ، والرسول الذي كذبتموه أكرم على الله من رسولهم ، فأنتم أولى بالعذاب ومعاجلة العقوبة منهم ، لولا لطفه وإحسانه .\n                                    ",
        "qortoby": "أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ مَّكَّنَّٰهُمۡ فِي ٱلۡأَرۡضِ مَا لَمۡ نُمَكِّن لَّكُمۡ وَأَرۡسَلۡنَا ٱلسَّمَآءَ عَلَيۡهِم مِّدۡرَارٗا وَجَعَلۡنَا ٱلۡأَنۡهَٰرَ تَجۡرِي مِن تَحۡتِهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِينَ ٦\n                                    \n                                    \n                                    قوله تعالى : ألم يروا كم أهلكنا من قبلهم من قرن مكناهم في الأرض ما لم نمكن لكم وأرسلنا السماء عليهم مدرارا وجعلنا الأنهار تجري من تحتهم فأهلكناهم بذنوبهم وأنشأنا من بعدهم قرنا آخرين\nقوله تعالى : ألم يروا كم أهلكنا من قبلهم من قرن كم في موضع نصب بأهلكنا لا بقوله ألم يروا لأن لفظ الاستفهام لا يعمل فيه ما قبله ، وإنما يعمل فيه ما بعده ، من أجل أن له صدر الكلام . والمعنى : ألا يعتبرون بمن أهلكنا من الأمم قبلهم لتكذيبهم أنبياءهم ، أي ألم يعرفوا ذلك ، والقرن الأمة من الناس . والجمع القرون ; قال الشاعر :\nإذا ذهب القرن الذي كنت فيهم وخلفت في قرن فأنت غريب\nفالقرن كله عالم في عصره مأخوذ من الاقتران ، أي : عالم مقترن به بعضهم إلى بعض ; وفي الحديث عن النبي صلى الله عليه وسلم قال : خير الناس قرني - يعني أصحابي - ثم الذين يلونهم ثم الذين يلونهم هذا أصح ما قيل فيه . وقيل : المعنى من أهل قرن فحذف كقوله : واسأل القرية . فالقرن على هذا مدة من الزمان ; قيل : ستون عاما وقيل سبعون ، وقيل : ثمانون ; وقيل : مائة ; وعليه أكثر أصحاب الحديث أن القرن مائة سنة ; واحتجوا بأن النبي صلى الله عليه وسلم قال لعبد الله بن بسر : تعيش قرنا فعاش مائة سنة ; ذكره النحاس . وأصل القرن الشيء الطالع كقرن ما له قرن من الحيوان . مكناهم في الأرض ما لم نمكن لكم خروج من الغيبة إلى الخطاب ; عكسه حتى إذا كنتم في الفلك وجرين بهم بريح طيبة . وقال أهل البصرة أخبر عنهم بقوله ألم يروا وفيهم محمد عليه السلام وأصحابه ; ثم خاطبهم معهم ; والعرب تقول : قلت لعبد الله ما أكرمه : وقلت لعبد الله ما أكرمك ; ولو جاء على ما تقدم من الغيبة لقال : ما لم نمكن لهم . ويجوز مكنه ومكن له ; فجاء باللغتين جميعا ; أي : أعطيناهم ما لم نعطكم من الدنيا . وأرسلنا السماء عليهم مدرارا يريد المطر الكثير ; عبر عنه بالسماء لأنه من السماء ينزل ; ومنه قول الشاعر : ( وهو معاوية بن مالك )\nإذا سقط السماء بأرض قوم رعيناه وإن كانوا غضابا\nمدرارا بناء دال على التكثير ; كمذكار للمرأة التي كثرت ولادتها للذكور ; ومئناث للمرأة التي تلد الإناث ; يقال : در اللبن يدر إذا أقبل على الحالب بكثرة . وانتصب مدرارا على الحال . وجعلنا الأنهار تجري من تحتهم أي : من تحت أشجارهم ومنازلهم ; ومنه قول فرعون : وهذه الأنهار تجري من تحتي والمعنى : وسعنا عليهم النعم فكفروها . فأهلكناهم بذنوبهم أي : بكفرهم فالذنوب سبب الانتقام وزوال النعم . وأنشأنا من بعدهم قرنا آخرين أي : أوجدنا ; فليحذر هؤلاء من الإهلاك أيضا .\n                                    ",
        "saadi": "أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ مَّكَّنَّٰهُمۡ فِي ٱلۡأَرۡضِ مَا لَمۡ نُمَكِّن لَّكُمۡ وَأَرۡسَلۡنَا ٱلسَّمَآءَ عَلَيۡهِم مِّدۡرَارٗا وَجَعَلۡنَا ٱلۡأَنۡهَٰرَ تَجۡرِي مِن تَحۡتِهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِينَ ٦\n                                        \n                                        \n                                        \n                                        أمرهم أن يعتبروا بالأمم السالفة فقال: { أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ } أي: كم تتابع إهلاكنا للأمم المكذبين، وأمهلناهم قبل ذلك الإهلاك، بأن { مَكَّنَّاهُمْ فِي الْأَرْضِ مَا لَمْ نُمَكِّنْ } لهؤلاء من الأموال والبنين والرفاهية. { وَأَرْسَلْنَا السَّمَاءَ عَلَيْهِمْ مِدْرَارًا وَجَعَلْنَا الْأَنْهَارَ تَجْرِي مِنْ تَحْتِهِمْ } فينبت لهم بذلك ما شاء الله، من زروع وثمار، يتمتعون بها، ويتناولون منها ما يشتهون، فلم يشكروا الله على نعمه، بل أقبلوا على الشهوات، وألهتهم أنواع اللذات، فجاءتهم رسلهم بالبينات، فلم يصدقوها، بل ردوها وكذبوها فأهلكهم الله بذنوبهم وأنشأ { مِنْ بَعْدِهِمْ قَرْنًا آخَرِينَ } فهذه سنة الله ودأبه، في الأمم السابقين واللاحقين، فاعتبروا بمن قص الله عليكم نبأهم.\n                                    "
      },
      "originalText": "أَلَمۡ يَرَوۡاْ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ مَّكَّنَّٰهُمۡ فِي ٱلۡأَرۡضِ مَا لَمۡ نُمَكِّن لَّكُمۡ وَأَرۡسَلۡنَا ٱلسَّمَآءَ عَلَيۡهِم مِّدۡرَارٗا وَجَعَلۡنَا ٱلۡأَنۡهَٰرَ تَجۡرِي مِن تَحۡتِهِمۡ فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِينَ ٦"
    },
    {
      "number": 796,
      "text": "وَلَوْ نَزَّلْنَا عَلَيْكَ كِتَابًا فِي قِرْطَاسٍ فَلَمَسُوهُ بِأَيْدِيهِمْ لَقَالَ الَّذِينَ كَفَرُوا إِنْ هَٰذَا إِلَّا سِحْرٌ مُبِينٌ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 7,
      "juz": 7,
      "manzil": 2,
      "page": 128,
      "ruku": 102,
      "hizbQuarter": 51,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ نَزَّلۡنَا عَلَيۡكَ كِتَٰبٗا فِي قِرۡطَاسٖ فَلَمَسُوهُ بِأَيۡدِيهِمۡ لَقَالَ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ ٧\n                                    \n                                    \n                                    يقول تعالى مخبرا عن كفر المشركين وعنادهم ومكابرتهم للحق ومباهتتهم ومنازعتهم فيه : ( ولو نزلنا عليك كتابا في قرطاس فلمسوه بأيديهم ) أي : عاينوه ، ورأوا نزوله ، وباشروا ذلك ( لقال الذين كفروا إن هذا إلا سحر مبين ) وهذا كما قال تعالى مخبرا عن مكابرتهم للمحسوسات : ( ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون لقالوا إنما سكرت أبصارنا بل نحن قوم مسحورون ) [ الحجر : 14 ، 15 ] وقال تعالى : ( وإن يروا كسفا من السماء ساقطا يقولوا سحاب مركوم ) [ الطور : 44 ] .\n                                    ",
        "qortoby": "وَلَوۡ نَزَّلۡنَا عَلَيۡكَ كِتَٰبٗا فِي قِرۡطَاسٖ فَلَمَسُوهُ بِأَيۡدِيهِمۡ لَقَالَ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ ٧\n                                    \n                                    \n                                    قوله تعالى : ولو نزلنا عليك كتابا في قرطاس فلمسوه بأيديهم لقال الذين كفروا إن هذا إلا سحر مبين\nقوله تعالى : ولو نزلنا عليك كتابا في قرطاس الآية . المعنى : ولو نزلنا يا محمد بمرأى منهم كما زعموا وطلبوا كلاما مكتوبا في قرطاس وعن ابن عباس : كتابا معلقا بين السماء والأرض ، وهذا يبين لك أن التنزيل على وجهين ; أحدهما : على معنى نزل عليك الكتاب بمعنى نزول الملك به . والآخر : ولو نزلنا كتابا في قرطاس يمسكه الله بين السماء والأرض ; وقال : نزلنا على المبالغة بطول مكث الكتاب بين السماء والأرض ، والكتاب مصدر بمعنى الكتابة ، فبين أن الكتابة في قرطاس ; لأنه غير معقول كتابة إلا في قرطاس ، أي : في صحيفة والقرطاس الصحيفة ; ويقال : قرطاس بالضم ; وقرطس فلان إذا رمى فأصاب الصحيفة الملزقة بالهدف . فلمسوه بأيديهم أي : فعاينوا ذلك ومسوه باليد كما اقترحوا وبالغوا في ميزه وتقليبه جسا بأيديهم ، ليرتفع كل ارتياب ، ويزول عنهم كل إشكال ، لعاندوا فيه وتابعوا كفرهم ، وقالوا : سحر مبين إنما سكرت أبصارنا وسحرنا ; وهذه الآية جواب لقولهم : حتى تنزل علينا كتابا نقرؤه فأعلم الله بما سبق في علمه من أنه لو نزل لكذبوا به . قال الكلبي : نزلت في النضر بن الحارث ، وعبد الله بن أبي أمية ، ونوفل بن خويلد ، قالوا : لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا الآية .\n                                    ",
        "saadi": "وَلَوۡ نَزَّلۡنَا عَلَيۡكَ كِتَٰبٗا فِي قِرۡطَاسٖ فَلَمَسُوهُ بِأَيۡدِيهِمۡ لَقَالَ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ ٧\n                                        \n                                        \n                                        \n                                        هذا إخبار من الله لرسوله عن شدة عناد الكافرين، وأنه ليس تكذيبهم لقصور فيما جئتهم به، ولا لجهل منهم بذلك، وإنما ذلك ظلم وبغي، لا حيلة لكم فيه، فقال: { وَلَوْ نَزَّلْنَا عَلَيْكَ كِتَابًا فِي قِرْطَاسٍ فَلَمَسُوهُ بِأَيْدِيهِمْ } وتيقنوه { لَقَالَ الَّذِينَ كَفَرُوا } ظلما وعلوا { إِنْ هَذَا إِلَّا سِحْرٌ مُبِينٌ } فأي بينة أعظم من هذه البينة، وهذا قولهم الشنيع فيها، حيث كابروا المحسوس الذي لا يمكن مَن له أدنى مسكة مِن عقل دفعه ؟\"\n                                    "
      },
      "originalText": "وَلَوۡ نَزَّلۡنَا عَلَيۡكَ كِتَٰبٗا فِي قِرۡطَاسٖ فَلَمَسُوهُ بِأَيۡدِيهِمۡ لَقَالَ ٱلَّذِينَ كَفَرُوٓاْ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ ٧"
    },
    {
      "number": 797,
      "text": "وَقَالُوا لَوْلَا أُنْزِلَ عَلَيْهِ مَلَكٌ ۖ وَلَوْ أَنْزَلْنَا مَلَكًا لَقُضِيَ الْأَمْرُ ثُمَّ لَا يُنْظَرُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 8,
      "juz": 7,
      "manzil": 2,
      "page": 128,
      "ruku": 102,
      "hizbQuarter": 51,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ مَلَكٞۖ وَلَوۡ أَنزَلۡنَا مَلَكٗا لَّقُضِيَ ٱلۡأَمۡرُ ثُمَّ لَا يُنظَرُونَ ٨\n                                    \n                                    \n                                    ( وقالوا لولا أنزل عليه ملك ) [ أي : فيكون معه نذيرا ] قال الله : ( ولو أنزلنا ملكا لقضي الأمر ثم لا ينظرون ) أي : لو نزلت الملائكة على ما هم عليه لجاءهم من الله العذاب ، كما قال تعالى : ( ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين ) [ الحجر : 8 ] ، [ و ] قال تعالى : ( يوم يرون الملائكة لا بشرى يومئذ للمجرمين [ ويقولون حجرا محجورا ] ) [ الفرقان : 22 ] .\n                                    ",
        "qortoby": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ مَلَكٞۖ وَلَوۡ أَنزَلۡنَا مَلَكٗا لَّقُضِيَ ٱلۡأَمۡرُ ثُمَّ لَا يُنظَرُونَ ٨\n                                    \n                                    \n                                    قوله تعالى : وقالوا لولا أنزل عليه ملك ولو أنزلنا ملكا لقضي الأمر ثم لا ينظرون\nقوله تعالى : وقالوا لولا أنزل عليه ملك اقترحوا هذا أيضا و ( لولا ) بمعنى هلا . ولو أنزلنا ملكا لقضي الأمر قال ابن عباس : لو رأوا الملك على صورته لماتوا إذ لا يطيقون رؤيته . مجاهد وعكرمة : لقامت الساعة . قال الحسن وقتادة : لأهلكوا بعذاب الاستئصال ; لأن الله أجرى سنته بأن من طلب آية فأظهرت له فلم يؤمن أهلكه الله في الحال . ثم لا ينظرون أي : لا يمهلون ولا يؤخرون .\n                                    ",
        "saadi": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ مَلَكٞۖ وَلَوۡ أَنزَلۡنَا مَلَكٗا لَّقُضِيَ ٱلۡأَمۡرُ ثُمَّ لَا يُنظَرُونَ ٨\n                                        \n                                        \n                                        \n                                        { وَقَالُوا } أيضا تعنتا مبنيا على الجهل، وعدم العلم بالمعقول. { لَوْلَا أُنْزِلَ عَلَيْهِ مَلَكٌ } أي: هلا أنزل مع محمد ملك، يعاونه ويساعده على ما هو عليه بزعمهم أنه بشر، وأن رسالة الله، لا تكون إلا على أيدي الملائكة. قال الله في بيان رحمته ولطفه بعباده، حيث أرسل إليهم بشرا منهم يكون الإيمان بما جاء به، عن علم وبصيرة، وغيب. { وَلَوْ أَنْزَلْنَا مَلَكًا } برسالتنا، لكان الإيمان لا يصدر عن معرفة بالحق، ولكان إيمانا بالشهادة، الذي لا ينفع شيئا وحده، هذا إن آمنوا، والغالب أنهم لا يؤمنون بهذه الحالة، فإذا لم يؤمنوا قضي الأمر بتعجيل الهلاك عليهم وعدم إنظارهم، لأن هذه سنة الله، فيمن طلب الآيات المقترحة فلم يؤمن بها، فإرسال الرسول البشري إليهم بالآيات البينات، التي يعلم الله أنها أصلح للعباد، وأرفق بهم، مع إمهال الله للكافرين والمكذبين خير لهم وأنفع، فطلبُهم لإنزال الملك شر لهم لو كانوا يعلمون، ومع ذلك، فالملك لو أنزل عليهم، وأرسل، لم يطيقوا التلقي عنه، ولا احتملوا ذلك، ولا أطاقته قواهم الفانية.\n                                    "
      },
      "originalText": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ مَلَكٞۖ وَلَوۡ أَنزَلۡنَا مَلَكٗا لَّقُضِيَ ٱلۡأَمۡرُ ثُمَّ لَا يُنظَرُونَ ٨"
    }
  ]
}