{
  "number": 132,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 825,
      "text": "۞ إِنَّمَا يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ ۘ وَالْمَوْتَىٰ يَبْعَثُهُمُ اللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 36,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 105,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ إِنَّمَا يَسۡتَجِيبُ ٱلَّذِينَ يَسۡمَعُونَۘ وَٱلۡمَوۡتَىٰ يَبۡعَثُهُمُ ٱللَّهُ ثُمَّ إِلَيۡهِ يُرۡجَعُونَ ٦٣\n                                    \n                                    \n                                    وقوله : ( إنما يستجيب الذين يسمعون ) أي : إنما يستجيب لدعائك يا محمد من يسمع الكلام ويعيه ويفهمه ، كقوله : ( لينذر من كان حيا ويحق القول على الكافرين ) [ يس : 70 ] ، وقوله ( والموتى يبعثهم الله ) يعني : بذلك الكفار ; لأنهم موتى القلوب ، فشبههم الله بأموات الأجساد فقال : ( والموتى يبعثهم الله ثم إليه يرجعون ) وهذا من باب التهكم بهم ، والازدراء عليهم .\n                                    ",
        "qortoby": "۞ إِنَّمَا يَسۡتَجِيبُ ٱلَّذِينَ يَسۡمَعُونَۘ وَٱلۡمَوۡتَىٰ يَبۡعَثُهُمُ ٱللَّهُ ثُمَّ إِلَيۡهِ يُرۡجَعُونَ ٦٣\n                                    \n                                    \n                                    قوله تعالى : إنما يستجيب الذين يسمعون والموتى يبعثهم الله ثم إليه يرجعون\nقوله تعالى : إنما يستجيب الذين يسمعون أي : سماع إصغاء وتفهم وإرادة الحق ، وهم المؤمنون الذين يقبلون ما يسمعون فينتفعون به ويعملون ; قال معناه الحسن ومجاهد ، وتم الكلام . ثم قال : والموتى يبعثهم الله وهم الكفار ; عن الحسن ومجاهد ; أي : هم بمنزلة الموتى في أنهم لا يقبلون ولا يصغون إلى حجة . وقيل : الموتى كل من مات . يبعثهم الله أي : للحساب ; وعلى الأول بعثهم هدايتهم إلى الإيمان بالله وبرسوله صلى الله عليه وسلم . وعن الحسن : هو بعثهم من شركهم حتى يؤمنوا بك يا محمد - يعني عند حضور الموت - في حال الإلجاء في الدنيا .\n                                    ",
        "saadi": "۞ إِنَّمَا يَسۡتَجِيبُ ٱلَّذِينَ يَسۡمَعُونَۘ وَٱلۡمَوۡتَىٰ يَبۡعَثُهُمُ ٱللَّهُ ثُمَّ إِلَيۡهِ يُرۡجَعُونَ ٦٣\n                                        \n                                        \n                                        \n                                        \nيقول تعالى لنبيه صلى الله عليه وسلم: { إِنَّمَا يَسْتَجِيبُ } لدعوتك، ويلبي رسالتك، وينقاد لأمرك ونهيك { الَّذِينَ يَسْمَعُونَ } بقلوبهم ما ينفعهم، وهم أولو الألباب والأسماع. والمراد بالسماع هنا: سماع القلب والاستجابة، وإلا فمجرد سماع الأذن، يشترك فيه البر والفاجر. فكل المكلفين قد قامت عليهم حجة الله تعالى، باستماع آياته، فلم يبق لهم عذر، في عدم القبول. { وَالْمَوْتَى يَبْعَثُهُمُ اللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ } يحتمل أن المعنى، مقابل للمعنى المذكور. أي: إنما يستجيب لك أحياء القلوب، وأما أموات القلوب، الذين لا يشعرون بسعادتهم، ولا يحسون بما ينجيهم، فإنهم لا يستجيبون لك، ولا ينقادون، وموعدهم القيامة، يبعثهم الله ثم إليه يرجعون، ويحتمل أن المراد بالآية، على ظاهرها، وأن الله تعالى يقرر المعاد، وأنه سيبعث الأموات يوم القيامة ثم ينبئهم بما كانوا يعملون. ويكون هذا، متضمنا للترغيب في الاستجابة لله ورسوله، والترهيب من عدم ذلك.\n                                    "
      },
      "originalText": "۞ إِنَّمَا يَسۡتَجِيبُ ٱلَّذِينَ يَسۡمَعُونَۘ وَٱلۡمَوۡتَىٰ يَبۡعَثُهُمُ ٱللَّهُ ثُمَّ إِلَيۡهِ يُرۡجَعُونَ ٦٣"
    },
    {
      "number": 826,
      "text": "وَقَالُوا لَوْلَا نُزِّلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ ۚ قُلْ إِنَّ اللَّهَ قَادِرٌ عَلَىٰ أَنْ يُنَزِّلَ آيَةً وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 37,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 105,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ قَادِرٌ عَلَىٰٓ أَن يُنَزِّلَ ءَايَةٗ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ ٧٣\n                                    \n                                    \n                                    يقول تعالى مخبرا عن المشركين أنهم كانوا يقولون : ( لولا نزل عليه آية من ربه ) أي : خارق على مقتضى ما كانوا يريدون ، ومما يتعنتون كما قالوا : ( لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا ) الآيات [ الإسراء : 90 ] .\n( قل إن الله قادر على أن ينزل آية ولكن أكثرهم لا يعلمون ) أي : هو تعالى قادر على ذلك ، ولكن حكمته تعالى تقتضي تأخير ذلك ; لأنه لو أنزلها وفق ما طلبوا ثم لم يؤمنوا ، لعاجلهم بالعقوبة ، كما فعل بالأمم السالفة ، كما قال تعالى : ( وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا ) [ الإسراء : 59 ] ، وقال تعالى : ( إن نشأ ننزل عليهم من السماء آية فظلت أعناقهم لها خاضعين ) [ الشعراء : 4 ] .\n                                    ",
        "qortoby": "وَقَالُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ قَادِرٌ عَلَىٰٓ أَن يُنَزِّلَ ءَايَةٗ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ ٧٣\n                                    \n                                    \n                                    قوله تعالى : وقالوا لولا نزل عليه آية من ربه قال الحسن : لولا هاهنا بمعنى هلا ; وقال الشاعر ( هو الفرزدق ) :\nتعدون عقر النيب أفضل مجدكم بني ضوطرى لولا الكمي المقنعا\nوكان هذا منهم تعنتا بعد ظهور البراهين ; وإقامة الحجة بالقرآن الذي عجزوا أن يأتوا بسورة مثله ، لما فيه من الوصف وعلم الغيوب ولكن أكثرهم لا يعلمون أي : لا يعلمون أن الله عز وجل إنما ينزل من الآيات ما فيه مصلحة لعباده ; وكان في علم الله أن يخرج من أصلابهم أقواما يؤمنون به ولم يرد استئصالهم . وقيل : ولكن أكثرهم لا يعلمون أن الله قادر على إنزالها . الزجاج : طلبوا أن يجمعهم على الهدى أي : جمع إلجاء .\n                                    ",
        "saadi": "وَقَالُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ قَادِرٌ عَلَىٰٓ أَن يُنَزِّلَ ءَايَةٗ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ ٧٣\n                                        \n                                        \n                                        \n                                        { وَقَالُوا } أي: المكذبون بالرسول، تعنتا وعنادا: { لَوْلَا نُزِّلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ } يعنون بذلك آيات الاقتراح، التي يقترحونها بعقولهم الفاسدة وآرائهم الكاسدة. كقولهم: { وَقَالُوا لَنْ نُؤْمِنَ لَكَ حَتَّى تَفْجُرَ لَنَا مِنَ الْأَرْضِ يَنْبُوعًا * أَوْ تَكُونَ لَكَ جَنَّةٌ مِنْ نَخِيلٍ وَعِنَبٍ فَتُفَجِّرَ الْأَنْهَارَ خِلَالَهَا تَفْجِيرًا *أَوْ تُسْقِطَ السَّمَاءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا أَوْ تَأْتِيَ بِاللَّهِ وَالْمَلَائِكَةِ قَبِيلًا } الآيات. { قُلْ } مجيبا لقولهم: { إِنَّ اللَّهَ قَادِرٌ عَلَى أَنْ يُنَزِّلَ آيَةً } فليس في قدرته قصور عن ذلك، كيف، وجميع الأشياء منقادة لعزته، مذعنة لسلطانه؟! ولكن أكثر الناس لا يعلمون فهم لجهلهم وعدم علمهم يطلبون ما هو شر لهم من الآيات، التي لو جاءتهم، فلم يؤمنوا بها لعوجلوا بالعقاب، كما هي سنة الله، التي لا تبديل لها، ومع هذا، فإن كان قصدهم الآيات التي تبين لهم الحق، وتوضح السبيل، فقد أتى محمد صلى الله عليه وسلم، بكل آية قاطعة، وحجة ساطعة، دالة على ما جاء به من الحق، بحيث يتمكن العبد في كل مسألة من مسائل الدين، أن يجد فيما جاء به عدة أدلة عقلية ونقلية، بحيث لا تبقي في القلوب أدنى شك وارتياب، فتبارك الذي أرسل رسوله بالهدى ودين الحق، وأيده بالآيات البينات ليهلك من هلك عن بينة، ويحيا من حي عن بينة، وإن الله لسميع عليم.\n                                    "
      },
      "originalText": "وَقَالُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ قَادِرٌ عَلَىٰٓ أَن يُنَزِّلَ ءَايَةٗ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ ٧٣"
    },
    {
      "number": 827,
      "text": "وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ وَلَا طَائِرٍ يَطِيرُ بِجَنَاحَيْهِ إِلَّا أُمَمٌ أَمْثَالُكُمْ ۚ مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ ۚ ثُمَّ إِلَىٰ رَبِّهِمْ يُحْشَرُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 38,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 105,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ وَلَا طَٰٓئِرٖ يَطِيرُ بِجَنَاحَيۡهِ إِلَّآ أُمَمٌ أَمۡثَالُكُمۚ مَّا فَرَّطۡنَا فِي ٱلۡكِتَٰبِ مِن شَيۡءٖۚ ثُمَّ إِلَىٰ رَبِّهِمۡ يُحۡشَرُونَ ٨٣\n                                    \n                                    \n                                    وقوله : ( وما من دابة في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم ) قال مجاهد : أي أصناف مصنفة تعرف بأسمائها . وقال قتادة : الطير أمة ، والإنس أمة ، والجن أمة . وقال السدي : ( إلا أمم أمثالكم ) أي : خلق أمثالكم .\nوقوله : ( ما فرطنا في الكتاب من شيء ) أي : الجميع علمهم عند الله ، ولا ينسى واحدا من جميعها من رزقه وتدبيره ، سواء كان بريا أو بحريا ، كما قال : ( وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين ) [ هود : 6 ] أي : مفصح بأسمائها وأعدادها ومظانها ، وحاصر لحركاتها وسكناتها ، وقال [ الله ] تعالى : ( وكأين من دابة لا تحمل رزقها الله يرزقها وإياكم وهو السميع العليم ) [ العنكبوت : 60 ]\nوقد قال الحافظ أبو يعلى : حدثنا محمد بن المثنى ، حدثنا عبيد بن واقد القيسي أبو عباد ، حدثني محمد بن عيسى بن كيسان ، حدثنا محمد بن المنكدر ، عن جابر بن عبد الله قال : قل الجراد في سنة من سني عمر ، - رضي الله عنه - ، التي ولي فيها ، فسأل عنه فلم يخبر بشيء ، فاغتم لذلك . فأرسل راكبا إلى كذا ، وآخر إلى الشام ، وآخر إلى العراق يسأل : هل رؤي من الجراد شيء أم لا؟ فأتاه الراكب الذي من قبل اليمن بقبضة جراد فألقاها بين يديه ، فلما رآها كبر ثلاثا ، ثم قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" خلق الله ، عز وجل ، ألف أمة ، منها ستمائة في البحر ، وأربعمائة في البر . وأول شيء يهلك من هذه الأمم الجراد ، فإذا هلكت تتابعت مثل النظام إذا قطع سلكه .\nوقوله ( ثم إلى ربهم يحشرون ) قال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا أبو نعيم ، حدثنا سفيان ، عن أبيه ، عن عكرمة ، عن ابن عباس في قوله : ( ثم إلى ربهم يحشرون ) قال : حشرها الموت .\nوكذا رواه ابن جرير من طريق إسرائيل ، عن سعيد ، عن مسروق ، عن عكرمة عن ابن عباس قال : موت البهائم حشرها . وكذا رواه العوفي ، عنه .\nقال ابن أبي حاتم : وروي عن مجاهد والضحاك ، مثله .\nوالقول الثاني : إن حشرها هو بعثها يوم القيامة كما قال تعالى : ( وإذا الوحوش حشرت ) [ التكوير : 5 ]\nوقال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن سليمان ، عن منذر الثوري ، عن أشياخ لهم ، عن أبي ذر أن رسول الله - صلى الله عليه وسلم - رأى شاتين تنتطحان ، فقال : \" يا أبا ذر ، هل تدر فيم تنتطحان؟ \" قال : لا . قال \" لكن الله يدري ، وسيقضي بينهما \"\nورواه عبد الرزاق ، عن معمر ، عن الأعمش ، عمن ذكره عن أبي ذر قال : بينا أنا عند رسول الله - صلى الله عليه وسلم - إذ انتطحت عنزان ، فقال رسول الله - صلى الله عليه وسلم - : \" أتدرون فيم انتطحتا؟ \" قالوا : لا ندري . قال : \" لكن الله يدري ، وسيقضي بينهما \" . رواه ابن جرير ، ثم رواه من طريق منذر الثوري ، عن أبي ذر ، فذكره وزاد : قال أبو ذر : ولقد تركنا رسول الله - صلى الله عليه وسلم - وما يقلب طائر بجناحيه في السماء إلا ذكرنا منه علما\nوقال عبد الله ابن الإمام أحمد في مسند أبيه : حدثني عباس بن محمد وأبو يحيى البزار قالا حدثنا حجاج بن نصير ، حدثنا شعبة ، عن العوام بن مراجم - من بني قيس بن ثعلبة - عن أبي عثمان النهدي ، عن عثمان ، - رضي الله عنه - ، أن رسول الله - صلى الله عليه وسلم - قال : \" إن الجماء لتقتص من القرناء يوم القيامة \"\nوقال عبد الرزاق : أخبرنا معمر ، عن جعفر بن برقان ، عن يزيد بن الأصم ، عن أبي هريرة في قوله : ( إلا أمم أمثالكم ما فرطنا في الكتاب من شيء ثم إلى ربهم يحشرون ) قال : يحشر الخلق كلهم يوم القيامة ، البهائم والدواب والطير وكل شيء ، فيبلغ من عدل الله يومئذ أن يأخذ للجماء من القرناء . قال : ثم يقول : كوني ترابا . فلذلك يقول الكافر : ( يا ليتني كنت ترابا ) [ النبأ : 40 ] ، وقد روي هذا مرفوعا في حديث الصورس\n                                    ",
        "qortoby": "وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ وَلَا طَٰٓئِرٖ يَطِيرُ بِجَنَاحَيۡهِ إِلَّآ أُمَمٌ أَمۡثَالُكُمۚ مَّا فَرَّطۡنَا فِي ٱلۡكِتَٰبِ مِن شَيۡءٖۚ ثُمَّ إِلَىٰ رَبِّهِمۡ يُحۡشَرُونَ ٨٣\n                                    \n                                    \n                                    قوله تعالى : وما من دابة في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم ما فرطنا في الكتاب من شيء ثم إلى ربهم يحشرون\nقوله تعالى : وما من دابة في الأرض تقدم معنى الدابة والقول فيه في \" البقرة \" وأصله الصفة ; من دب يدب فهو داب إذا مشى مشيا فيه تقارب خطو . ولا طائر يطير بجناحيه بخفض طائر عطفا على اللفظ .\nوقرأ الحسن وعبد الله بن أبي إسحاق ( ولا طائر ) بالرفع عطفا على الموضع ، و ( من ) زائدة ، التقدير : وما من دابة . ( بجناحيه ) تأكيد وإزالة للإبهام ; فإن العرب تستعمل الطيران لغير الطائر ; تقول للرجل : طر في حاجتي ; أي : أسرع ; فذكر بجناحيه ليتمحض القول في الطير ، وهو في غيره مجاز . وقيل : إن اعتدال جسد الطائر بين الجناحين يعينه على الطيران ، ولو كان غير معتدل لكان يميل ; فأعلمنا أن الطيران بالجناحين و ما يمسكهن إلا الله . والجناح أحد ناحيتي الطير الذي يتمكن به من الطيران في الهواء ، وأصله الميل إلى ناحية من النواحي ; ومنه جنحت السفينة إذا مالت إلى ناحية الأرض لاصقة بها فوقفت . وطائر الإنسان عمله ; وفي التنزيل وكل إنسان ألزمناه طائره في عنقه . إلا أمم أمثالكم أي : هم جماعات مثلكم في أن الله عز وجل خلقهم ، وتكفل بأرزاقهم ، وعدل عليهم ، فلا ينبغي أن تظلموهم ، ولا تجاوزوا فيهم ما أمرتم به . و ( دابة ) تقع على جميع ما دب ; وخص بالذكر ما في الأرض دون السماء لأنه الذي يعرفونه ويعاينونه . وقيل : هي أمثال لنا في التسبيح والدلالة ; والمعنى : وما من دابة ولا طائر إلا وهو يسبح الله تعالى ، ويدل على وحدانيته لو تأمل الكفار . وقال أبو هريرة : هي أمثال لنا على معنى أنه يحشر البهائم غدا ويقتص للجماء من القرناء ، ثم يقول الله لها : كوني ترابا . وهذا اختيار الزجاج فإنه قال : إلا أمم أمثالكم في الخلق والرزق والموت والبعث والاقتصاص ، وقد دخل فيه معنى القول الأول أيضا . وقال سفيان بن عيينة : أي : ما من صنف من الدواب والطير إلا في الناس شبه منه ; فمنهم من يعدو كالأسد ، ومنهم من يشره كالخنزير ، ومنهم من يعوي كالكلب ، ومنهم من يزهو كالطاوس ; فهذا معنى المماثلة . واستحسن الخطابي هذا وقال : فإنك تعاشر البهائم والسباع فخذ حذرك . وقال مجاهد في قوله عز وجل : إلا أمم أمثالكم قال أصناف لهن أسماء تعرف بها كما تعرفون . وقيل غير هذا مما لا يصح من أنها مثلنا في المعرفة ، وأنها تحشر وتنعم في الجنة ، وتعوض من الآلام التي حلت بها في الدنيا وأن أهل الجنة يستأنسون بصورهم ; والصحيح إلا أمم أمثالكم في كونها مخلوقة دالة على الصانع محتاجة إليه مرزوقة من جهته ، كما أن رزقكم على الله . وقول سفيان أيضا حسن ; فإنه تشبيه واقع في الوجود .\nقوله تعالى : ما فرطنا في الكتاب من شيء أي : في اللوح المحفوظ فإنه أثبت فيه ما يقع من الحوادث . وقيل : أي : في القرآن أي : ما تركنا شيئا من أمر الدين إلا وقد دللنا عليه في القرآن ; إما دلالة مبينة مشروحة ، وإما مجملة يتلقى بيانها من الرسول عليه الصلاة والسلام ، أو من الإجماع ، أو من القياس الذي ثبت بنص الكتاب ; قال الله تعالى : ونزلنا عليك الكتاب تبيانا لكل شيء وقال : وأنزلنا إليك الذكر لتبين للناس ما نزل إليهم وقال : وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا فأجمل في هذه الآية وآية ( النحل ) ما لم ينص عليه مما لم يذكره ، فصدق خبر الله بأنه ما فرط في الكتاب من شيء إلا ذكره ، إما تفصيلا وإما تأصيلا ; وقال : اليوم أكملت لكم دينكم .\nقوله تعالى : ثم إلى ربهم يحشرون أي : للجزاء ، كما سبق في خبر أبي هريرة ، وفي صحيح مسلم عنه أن رسول الله صلى الله عليه وسلم قال : لتؤدن الحقوق إلى أهلها يوم القيامة حتى يقاد للشاة الجلحاء من الشاة القرناء . ودل بهذا على أن البهائم تحشر يوم القيامة ; وهذا قول أبي ذر ، وأبي هريرة ، والحسن وغيرهم ; وروي عن ابن عباس ; قال ابن عباس في رواية : حشر الدواب والطير موتها ; وقال الضحاك ; والأول أصح لظاهر الآية والخبر الصحيح ; وفي التنزيل وإذا الوحوش حشرت وقول أبي هريرة فيما روى جعفر بن برقان ، عن يزيد بن الأصم ، عنه : يحشر الله الخلق كلهم يوم القيامة ، البهائم والدواب والطير وكل شيء ; فيبلغ من عدل الله تعالى يومئذ أن يأخذ للجماء من القرناء ثم يقول : ( كوني ترابا ) فذلك قوله تعالى : ويقول الكافر ياليتني كنت ترابا . وقال عطاء : فإذا رأوا بني آدم وما هم عليه من الجزع قلن : الحمد لله الذي لم يجعلنا مثلكم ، فلا جنة نرجو ولا نار نخاف ; فيقول الله تعالى لهن : ( كن ترابا ) فحينئذ يتمنى الكافر أن يكون ترابا . وقالت جماعة : هذا الحشر الذي في الآية يرجع إلى الكفار وما تخلل كلام معترض وإقامة حجج ; وأما الحديث فالمقصود منه التمثيل على جهة تعظيم أمر الحساب والقصاص والاعتناء فيه حتى يفهم منه أنه لا بد لكل أحد منه ، وأنه لا محيص له عنه ; وعضدوا هذا بما في الحديث في غير الصحيح عن بعض رواته من الزيادة فقال : حتى يقاد للشاة الجلحاء من القرناء ، وللحجر لما ركب على الحجر ، وللعود لما خدش العود ; قالوا : فظهر من هذا أن المقصود منه التمثيل المفيد للاعتبار والتهويل ، لأن الجمادات لا يعقل خطابها ولا ثوابها ولا عقابها ، ولم يصر إليه أحد من العقلاء ، ومتخيله من جملة المعتوهين الأغبياء ; قالوا : ولأن القلم لا يجري عليهم فلا يجوز أن يؤاخذوا .\nقلت : الصحيح القول الأول لما ذكرناه من حديث أبي هريرة ، وإن كان القلم لا يجري عليهم في الأحكام ولكن فيما بينهم يؤاخذون به ; وروي عن أبي ذر قال : انتطحت شاتان عند النبي صلى الله عليه وسلم فقال : يا أبا ذر ، هل تدري فيما انتطحتا ؟ قلت : لا . قال : لكن الله تعالى يدري وسيقضي بينهما وهذا نص ، وقد زدناه بيانا في كتاب ( التذكرة بأحوال الموتى وأمور الآخرة ) . والله أعلم .\n                                    ",
        "saadi": "وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ وَلَا طَٰٓئِرٖ يَطِيرُ بِجَنَاحَيۡهِ إِلَّآ أُمَمٌ أَمۡثَالُكُمۚ مَّا فَرَّطۡنَا فِي ٱلۡكِتَٰبِ مِن شَيۡءٖۚ ثُمَّ إِلَىٰ رَبِّهِمۡ يُحۡشَرُونَ ٨٣\n                                        \n                                        \n                                        \n                                        أي: جميع الحيوانات، الأرضية والهوائية، من البهائم والوحوش والطيور، كلها أمم أمثالكم خلقناها. كما خلقناكم، ورزقناها كما رزقناكم، ونفذت فيها مشيئتنا وقدرتنا، كما كانت نافذة فيكم. { مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ } أي: ما أهملنا ولا أغفلنا، في اللوح المحفوظ شيئا من الأشياء، بل جميع الأشياء، صغيرها وكبيرها، مثبتة في اللوح المحفوظ، على ما هي عليه، فتقع جميع الحوادث طبق ما جرى به القلم. وفي هذه الآية، دليل على أن الكتاب الأول، قد حوى جميع الكائنات، وهذا أحد مراتب القضاء والقدر، فإنها أربع مراتب: علم الله الشامل لجميع الأشياء، وكتابه المحيط بجميع الموجودات، ومشيئته وقدرته النافذة العامة لكل شيء، وخلقه لجميع المخلوقات، حتى أفعال العباد. ويحتمل أن المراد بالكتاب، هذا القرآن، وأن المعنى كالمعنى في قوله تعالى { وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِكُلِّ شَيْءٍ } وقوله { ثُمَّ إِلَى رَبِّهِمْ يُحْشَرُونَ } أي: جميع الأمم تحشر وتجمع إلى الله في موقف القيامة، في ذلك الموقف العظيم الهائل، فيجازيهم بعدله وإحسانه، ويمضي عليهم حكمه الذي يحمده عليه الأولون والآخرون، أهل السماء وأهل الأرض.\n                                    "
      },
      "originalText": "وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ وَلَا طَٰٓئِرٖ يَطِيرُ بِجَنَاحَيۡهِ إِلَّآ أُمَمٌ أَمۡثَالُكُمۚ مَّا فَرَّطۡنَا فِي ٱلۡكِتَٰبِ مِن شَيۡءٖۚ ثُمَّ إِلَىٰ رَبِّهِمۡ يُحۡشَرُونَ ٨٣"
    },
    {
      "number": 828,
      "text": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا صُمٌّ وَبُكْمٌ فِي الظُّلُمَاتِ ۗ مَنْ يَشَإِ اللَّهُ يُضْلِلْهُ وَمَنْ يَشَأْ يَجْعَلْهُ عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 39,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 105,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ كَذَّبُواْ بِ‍َٔايَٰتِنَا صُمّٞ وَبُكۡمٞ فِي ٱلظُّلُمَٰتِۗ مَن يَشَإِ ٱللَّهُ يُضۡلِلۡهُ وَمَن يَشَأۡ يَجۡعَلۡهُ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٩٣\n                                    \n                                    \n                                    وقوله ( والذين كذبوا بآياتنا صم وبكم في الظلمات ) أي : مثلهم في جهلهم وقلة علمهم وعدم فهمهم كمثل أصم - وهو الذي لا يسمع - أبكم - وهو الذي لا يتكلم - وهو مع هذا في ظلام لا يبصر ، فكيف يهتدي مثل هذا إلى الطريق ، أو يخرج مما هو فيه؟ كما قال تعالى ( مثلهم كمثل الذي استوقد نارا فلما أضاءت ما حوله ذهب الله بنورهم وتركهم في ظلمات لا يبصرون صم بكم عمي فهم لا يرجعون [ البقرة : 17 ، 18 ] ) وكما قال [ تعالى ] ( أو كظلمات في بحر لجي يغشاه موج من فوقه موج من فوقه سحاب ظلمات بعضها فوق بعض إذا أخرج يده لم يكد يراها ومن لم يجعل الله له نورا فما له من نور ) [ النور : 40 ] ; ولهذا قال تعالى : ( من يشأ الله يضلله ومن يشأ يجعله على صراط مستقيم ) أي : هو المتصرف في خلقه بما يشاء .\n                                    ",
        "qortoby": "وَٱلَّذِينَ كَذَّبُواْ بِ‍َٔايَٰتِنَا صُمّٞ وَبُكۡمٞ فِي ٱلظُّلُمَٰتِۗ مَن يَشَإِ ٱللَّهُ يُضۡلِلۡهُ وَمَن يَشَأۡ يَجۡعَلۡهُ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٩٣\n                                    \n                                    \n                                    قوله تعالى : والذين كذبوا بآياتنا صم وبكم في الظلمات من يشأ الله يضلله ومن يشأ يجعله على صراط مستقيم\nقوله تعالى : والذين كذبوا بآياتنا صم وبكم ابتداء وخبر ، أي : عدموا الانتفاع بأسماعهم وأبصارهم ; فكل أمة من الدواب وغيرها تهتدي لمصالحها والكفار لا يهتدون . وقد تقدم في البقرة . في الظلمات أي : ظلمات الكفر . وقال أبو علي : يجوز أن يكون المعنى صم وبكم في الآخرة ; فيكون حقيقة دون مجاز اللغة . من يشأ الله يضلله دل على أنه شاء ضلال الكافر وأراده لينفذ فيه عدله . ومن يشأ يجعله على صراط مستقيم أي : على دين الإسلام لينفذ فيه فضله . وفيه إبطال لمذهب القدرية . والمشيئة راجعة إلى الذين كذبوا ، فمنهم من يضله ومنهم من يهديه .\n                                    ",
        "saadi": "وَٱلَّذِينَ كَذَّبُواْ بِ‍َٔايَٰتِنَا صُمّٞ وَبُكۡمٞ فِي ٱلظُّلُمَٰتِۗ مَن يَشَإِ ٱللَّهُ يُضۡلِلۡهُ وَمَن يَشَأۡ يَجۡعَلۡهُ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٩٣\n                                        \n                                        \n                                        \n                                        هذا بيان لحال المكذبين بآيات الله، المكذبين لرسله، أنهم قد سدوا على أنفسهم باب الهدى، وفتحوا باب الردى، وأنهم { صُمٌّ } عن سماع الحق { وَبُكْمٌ } عن النطق به، فلا ينطقون إلا بباطل . { فِي الظُّلُمَاتِ } أي: منغمسون في ظلمات الجهل، والكفر، والظلم، والعناد، والمعاصي. وهذا من إضلال الله إياهم، فـ { مَنْ يَشَأِ اللَّهُ يُضْلِلْهُ وَمَنْ يَشَأْ يَجْعَلْهُ عَلَى صِرَاطٍ مُسْتَقِيمٍ } لأنه المنفرد بالهداية والإضلال، بحسب ما اقتضاه فضله وحكمته.\n                                    "
      },
      "originalText": "وَٱلَّذِينَ كَذَّبُواْ بِ‍َٔايَٰتِنَا صُمّٞ وَبُكۡمٞ فِي ٱلظُّلُمَٰتِۗ مَن يَشَإِ ٱللَّهُ يُضۡلِلۡهُ وَمَن يَشَأۡ يَجۡعَلۡهُ عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ  ٩٣"
    },
    {
      "number": 829,
      "text": "قُلْ أَرَأَيْتَكُمْ إِنْ أَتَاكُمْ عَذَابُ اللَّهِ أَوْ أَتَتْكُمُ السَّاعَةُ أَغَيْرَ اللَّهِ تَدْعُونَ إِنْ كُنْتُمْ صَادِقِينَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 40,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 105,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ أَرَءَيۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ أَوۡ أَتَتۡكُمُ ٱلسَّاعَةُ أَغَيۡرَ ٱللَّهِ تَدۡعُونَ إِن كُنتُمۡ صَٰدِقِينَ ٠٤\n                                    \n                                    \n                                    يخبر تعالى أنه الفعال لما يريد ، المتصرف في خلقه بما يشاء ، وأنه لا معقب لحكمه ، ولا يقدر أحد على صرف حكمه عن خلقه ، بل هو وحده لا شريك له ، الذي إذا سئل يجيب لمن يشاء ; ولهذا قال : ( قل أرأيتكم إن أتاكم عذاب الله أو أتتكم الساعة ) أي : أتاكم هذا أو هذا ( أغير الله تدعون إن كنتم صادقين؟ ) أي : لا تدعون غيره لعلمكم أنه لا يقدر أحد على دفع ذلك سواه ; ولهذا قال : ( إن كنتم صادقين ) أي : في اتخاذكم آلهة معه .\n                                    ",
        "qortoby": "قُلۡ أَرَءَيۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ أَوۡ أَتَتۡكُمُ ٱلسَّاعَةُ أَغَيۡرَ ٱللَّهِ تَدۡعُونَ إِن كُنتُمۡ صَٰدِقِينَ ٠٤\n                                    \n                                    \n                                    قوله تعالى : قل أرأيتكم وقرأ نافع بتخفيف الهمزتين ، يلقي حركة الأولى على ما قبلها ، ويأتي بالثانية بين بين . وحكى أبو عبيد عنه أنه يسقط الهمزة ويعوض منها ألفا . قال النحاس : وهذا عند أهل العربية غلط عليه ; لأن الياء ساكنة والألف ساكنة ولا يجتمع ساكنان . قال مكي : وقد روي عن ورش أنه أبدل من الهمزة ألفا ; لأن الرواية عنه أنه يمد الثانية ، والمد لا يتمكن إلا مع البدل ، والبدل فرع من الأصول ، والأصل أن تجعل الهمزة بين الهمزة المفتوحة والألف ; وعليه كل من خفف الثانية غير ورش ; وحسن جواز البدل في الهمزة وبعدها ساكن لأن الأول حرف مد ولين ، فالمد الذي يحدث مع الساكن يقوم مقام حركة يوصل بها إلى النطق بالساكن الثاني .\nوقرأ أبو عمرو وعاصم وحمزة ( أرأيتكم ) بتحقيق الهمزتين وأتوا بالكلمة على أصلها ، والأصل الهمز ; لأن همزة الاستفهام دخلت على ( رأيت ) فالهمزة عين الفعل ، والياء ساكنة لاتصال المضمر المرفوع بها .\nوقرأ عيسى بن عمر والكسائي ( أريتكم ) بحذف الهمزة الثانية . قال النحاس : وهذا بعيد في العربية ، وإنما يجوز في الشعر ; والعرب تقول : أرأيتك زيدا ما شأنه . ومذهب البصريين أن الكاف والميم للخطاب ، لا حظ لهما في الإعراب ; وهو اختيار الزجاج . ومذهب الكسائي والفراء وغيرهما أن الكاف والميم نصب بوقوع الرؤية عليهما ، والمعنى أرأيتم أنفسكم ; فإذا كانت للخطاب - زائدة للتأكيد - كان ( إن ) من قوله إن أتاكم في موضع نصب على المفعول لرأيت ، وإذا كان اسما في موضع نصب ف إن في موضع المفعول الثاني ; فالأول من رؤية العين لتعديها لمفعول واحد ، وبمعنى العلم تتعدى إلى مفعولين . وقوله : أو أتتكم الساعة المعنى : أو أتتكم الساعة التي تبعثون فيها . ثم قال : أغير الله تدعون إن كنتم صادقين والآية في محاجة المشركين ممن اعترف أن له صانعا ; أي : أنتم عند الشدائد ترجعون إلى الله ، وسترجعون إليه يوم القيامة أيضا فلم تصرون على الشرك في حال الرفاهية ؟ ! وكانوا يعبدون الأصنام ويدعون الله في صرف العذاب .\n                                    ",
        "saadi": "قُلۡ أَرَءَيۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ أَوۡ أَتَتۡكُمُ ٱلسَّاعَةُ أَغَيۡرَ ٱللَّهِ تَدۡعُونَ إِن كُنتُمۡ صَٰدِقِينَ ٠٤\n                                        \n                                        \n                                        \n                                        يقول تعالى لرسوله: { قُلْ } للمشركين بالله، العادلين به غيره: { أَرَأَيْتَكُمْ إِنْ أَتَاكُمْ عَذَابُ اللَّهِ أَوْ أَتَتْكُمُ السَّاعَةُ أَغَيْرَ اللَّهِ تَدْعُونَ إِنْ كُنْتُمْ صَادِقِينَ } أي: إذا حصلت هذه المشقات، وهذه الكروب، التي يضطر إلى دفعها، هل تدعون آلهتكم وأصنامكم، أم تدعون ربكم الملك الحق المبين.\n                                    "
      },
      "originalText": "قُلۡ أَرَءَيۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ أَوۡ أَتَتۡكُمُ ٱلسَّاعَةُ أَغَيۡرَ ٱللَّهِ تَدۡعُونَ إِن كُنتُمۡ صَٰدِقِينَ ٠٤"
    },
    {
      "number": 830,
      "text": "بَلْ إِيَّاهُ تَدْعُونَ فَيَكْشِفُ مَا تَدْعُونَ إِلَيْهِ إِنْ شَاءَ وَتَنْسَوْنَ مَا تُشْرِكُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 41,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 105,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَلۡ إِيَّاهُ تَدۡعُونَ فَيَكۡشِفُ مَا تَدۡعُونَ إِلَيۡهِ إِن شَآءَ وَتَنسَوۡنَ مَا تُشۡرِكُونَ ١٤\n                                    \n                                    \n                                    ( بل إياه تدعون فيكشف ما تدعون إليه إن شاء وتنسون ما تشركون ) أي : في وقت الضرورة لا تدعون أحدا سواه وتذهب عنكم أصنامكم وأندادكم كما قال : ( وإذا مسكم الضر في البحر ضل من تدعون إلا إياه ) الآية [ الإسراء : 67 ] .\n                                    ",
        "qortoby": "بَلۡ إِيَّاهُ تَدۡعُونَ فَيَكۡشِفُ مَا تَدۡعُونَ إِلَيۡهِ إِن شَآءَ وَتَنسَوۡنَ مَا تُشۡرِكُونَ ١٤\n                                    \n                                    \n                                    قوله تعالى : بل إياه تدعون بل إضراب عن الأول وإيجاب للثاني . ( إياه ) نصب . ب تدعون فيكشف ما تدعون إليه إن شاء أي : يكشف الضر الذي تدعون إلى كشفه إن شاء كشفه . وتنسون ما تشركون قيل : عند نزول العذاب . وقال الحسن : أي : تعرضون عنه إعراض الناسي ، وذلك لليأس من النجاة من قبله إذ لا ضرر فيه ولا نفع . وقال الزجاج : يجوز أن يكون المعنى وتتركون . قال النحاس : مثل قوله : ولقد عهدنا إلى آدم من قبل فنسي .\n\n                                    ",
        "saadi": "بَلۡ إِيَّاهُ تَدۡعُونَ فَيَكۡشِفُ مَا تَدۡعُونَ إِلَيۡهِ إِن شَآءَ وَتَنسَوۡنَ مَا تُشۡرِكُونَ ١٤\n                                        \n                                        \n                                        \n                                        { بَلْ إِيَّاهُ تَدْعُونَ فَيَكْشِفُ مَا تَدْعُونَ إِلَيْهِ إِنْ شَاءَ وَتَنْسَوْنَ مَا تُشْرِكُونَ } فإذا كانت هذه حالكم مع أندادكم عند الشدائد، تنسونهم، لعلمكم أنهم لا يملكون لكم ضرا ولا نفعا، ولا موتا، ولا حياة، ولا نشورا. وتخلصون لله الدعاء، لعلمكم أنه هو النافع الضار، المجيب لدعوة المضطر، فما بالكم في الرخاء تشركون به، وتجعلون له شركاء؟. هل دلكم على ذلك، عقل أو نقل، أم عندكم من سلطان بهذا؟ بل تفترون على الله الكذب ؟\n                                    "
      },
      "originalText": "بَلۡ إِيَّاهُ تَدۡعُونَ فَيَكۡشِفُ مَا تَدۡعُونَ إِلَيۡهِ إِن شَآءَ وَتَنسَوۡنَ مَا تُشۡرِكُونَ ١٤"
    },
    {
      "number": 831,
      "text": "وَلَقَدْ أَرْسَلْنَا إِلَىٰ أُمَمٍ مِنْ قَبْلِكَ فَأَخَذْنَاهُمْ بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَتَضَرَّعُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 42,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 106,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَأَخَذۡنَٰهُم بِٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ لَعَلَّهُمۡ يَتَضَرَّعُونَ ٢٤\n                                    \n                                    \n                                    وقوله : ( ولقد أرسلنا إلى أمم من قبلك فأخذناهم بالبأساء ) يعني : الفقر والضيق في العيش ) والضراء ) وهي الأمراض والأسقام والآلام ( لعلهم يتضرعون ) أي : يدعون الله ويتضرعون إليه ويخشعون .\n                                    ",
        "qortoby": "وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَأَخَذۡنَٰهُم بِٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ لَعَلَّهُمۡ يَتَضَرَّعُونَ ٢٤\n                                    \n                                    \n                                    قوله تعالى : ولقد أرسلنا إلى أمم من قبلك فأخذناهم بالبأساء والضراء لعلهم يتضرعون .\nقوله تعالى : ولقد أرسلنا إلى أمم من قبلك الآية تسلية للنبي صلى الله عليه وسلم ، وفيه إضمار ; أي : أرسلنا إلى أمم من قبلك رسلا وفيه إضمار آخر يدل عليه الظاهر ; تقديره : فكذبوا فأخذناهم وهذه الآية متصلة بما قبل اتصال الحال بحال قريبة منها ; وذلك أن هؤلاء سلكوا في مخالفة نبيهم مسلك من كان قبلهم في مخالفة أنبيائهم ، فكانوا بعرض أن ينزل بهم من البلاء ما نزل بمن كان قبلهم . بالبأساء بالمصائب في الأموال والضراء في الأبدان ; هذا قول الأكثر ، وقد يوضع كل واحد منهما موضع الآخر ; ويؤدب الله عباده بالبأساء والضراء وبما شاء لا يسأل عما يفعل . قال ابن عطية : استدل العباد في تأديب أنفسهم بالبأساء في تفريق الأموال ، والضراء في الحمل على الأبدان بالجوع والعري بهذه الآية .\nقلت : هذه جهالة ممن فعلها وجعل هذه الآية أصلا لها ; هذه عقوبة من الله لمن شاء من عباده يمتحنهم بها ، ولا يجوز لنا أن نمتحن أنفسنا ونكافئها قياسا عليها ; فإنها المطية التي نبلغ عليها دار الكرامة ، ونفوز بها من أهوال يوم القيامة ; وفي التنزيل : يا أيها الرسل كلوا من الطيبات واعملوا صالحا وقال : يا أيها الذين آمنوا أنفقوا من طيبات ما كسبتم يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم فأمر المؤمنين بما خاطب به المرسلين ; وكان رسول الله صلى الله عليه وسلم وأصحابه يأكلون الطيبات ويلبسون أحسن الثياب ويتجملون بها ; وكذلك التابعون بعدهم إلى هلم جرا ، على ما تقدم بيانه في \" المائدة \" وسيأتي في \" الأعراف \" من حكم اللباس وغيره ، ولو كان كما زعموا واستدلوا لما كان في امتنان الله تعالى بالزروع والجنات وجميع الثمار والنبات والأنعام التي سخرها وأباح لنا أكلها وشرب ألبانها والدفء بأصوافها - إلى غير ذلك مما امتن به - كبير فائدة ، فلو كان ما ذهبوا إليه فيه الفضل لكان أولى به رسول الله صلى الله عليه وسلم وأصحابه ومن بعدهم من التابعين والعلماء ، وقد تقدم في آخر \" البقرة \" بيان فضل المال ومنفعته ، والرد على من أبى من جمعه ، وقد نهى النبي صلى الله عليه وسلم عن الوصال مخافة الضعف على الأبدان ، ونهى عن إضاعة المال ردا على الأغنياء الجهال .\nقوله تعالى : لعلهم يتضرعون أي : يدعون ويذلون ، مأخوذ من الضراعة وهي الذلة ; يقال : ضرع فهو ضارع .\n                                    ",
        "saadi": "وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَأَخَذۡنَٰهُم بِٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ لَعَلَّهُمۡ يَتَضَرَّعُونَ ٢٤\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وَلَقَدْ أَرْسَلْنَا إِلَى أُمَمٍ مِنْ قَبْلِكَ } من الأمم السالفين، والقرون المتقدمين، فكذبوا رسلنا، وجحدوا بآياتنا. { فَأَخَذْنَاهُمْ بِالْبَأْسَاءِ وَالضَّرَّاءِ } أي: بالفقر والمرض والآفات، والمصائب، رحمة منا بهم. { لَعَلَّهُمْ يَتَضَرَّعُونَ } إلينا، ويلجأون عند الشدة إلينا.\n                                    "
      },
      "originalText": "وَلَقَدۡ أَرۡسَلۡنَآ إِلَىٰٓ أُمَمٖ مِّن قَبۡلِكَ فَأَخَذۡنَٰهُم بِٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ لَعَلَّهُمۡ يَتَضَرَّعُونَ ٢٤"
    },
    {
      "number": 832,
      "text": "فَلَوْلَا إِذْ جَاءَهُمْ بَأْسُنَا تَضَرَّعُوا وَلَٰكِنْ قَسَتْ قُلُوبُهُمْ وَزَيَّنَ لَهُمُ الشَّيْطَانُ مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 43,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 106,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَلَوۡلَآ إِذۡ جَآءَهُم بَأۡسُنَا تَضَرَّعُواْ وَلَٰكِن قَسَتۡ قُلُوبُهُمۡ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ مَا كَانُواْ يَعۡمَلُونَ ٣٤\n                                    \n                                    \n                                    قال الله تعالى : ( فلولا إذ جاءهم بأسنا تضرعوا ) أي : فهلا إذ ابتليناهم بذلك تضرعوا إلينا وتمسكنوا إلينا ( ولكن قست قلوبهم ) أي : ما رقت ولا خشعت ( وزين لهم الشيطان ما كانوا يعملون ) أي : من الشرك والمعاصي .\n                                    ",
        "qortoby": "فَلَوۡلَآ إِذۡ جَآءَهُم بَأۡسُنَا تَضَرَّعُواْ وَلَٰكِن قَسَتۡ قُلُوبُهُمۡ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ مَا كَانُواْ يَعۡمَلُونَ ٣٤\n                                    \n                                    \n                                    قوله : فلولا إذ جاءهم بأسنا تضرعوا ولكن قست قلوبهم وزين لهم الشيطان ما كانوا يعملون\nقوله تعالى : فلولا إذ جاءهم بأسنا تضرعوا لولا تحضيض ، وهي التي تلي الفعل بمعنى هلا ; وهذا عتاب على ترك الدعاء ، وإخبار عنهم أنهم لم يتضرعوا حين نزول العذاب . ويجوز أن يكونوا تضرعوا تضرع من لم يخلص ، أو تضرعوا حين لابسهم العذاب ، والتضرع على هذه الوجوه غير نافع . والدعاء مأمور به حال الرخاء والشدة ; قال الله تعالى : ادعوني أستجب لكم وقال : إن الذين يستكبرون عن عبادتي أي : دعائي سيدخلون جهنم داخرين وهذا وعيد شديد . ولكن قست قلوبهم أي : صلبت وغلظت ، وهي عبارة عن الكفر والإصرار على المعصية ، نسأل الله العافية . وزين لهم الشيطان ما كانوا يعملون أي : أغواهم بالمعاصي وحملهم عليها .\n \n                                    ",
        "saadi": "فَلَوۡلَآ إِذۡ جَآءَهُم بَأۡسُنَا تَضَرَّعُواْ وَلَٰكِن قَسَتۡ قُلُوبُهُمۡ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ مَا كَانُواْ يَعۡمَلُونَ ٣٤\n                                        \n                                        \n                                        \n                                        { فَلَوْلَا إِذْ جَاءَهُمْ بَأْسُنَا تَضَرَّعُوا وَلَكِنْ قَسَتْ قُلُوبُهُمْ } أي: استحجرت فلا تلين للحق. { وَزَيَّنَ لَهُمُ الشَّيْطَانُ مَا كَانُوا يَعْمَلُونَ } فظنوا أن ما هم عليه دين الحق، فتمتعوا في باطلهم برهة من الزمان، ولعب بعقولهم الشيطان.\n \n                                    "
      },
      "originalText": "فَلَوۡلَآ إِذۡ جَآءَهُم بَأۡسُنَا تَضَرَّعُواْ وَلَٰكِن قَسَتۡ قُلُوبُهُمۡ وَزَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ مَا كَانُواْ يَعۡمَلُونَ ٣٤"
    },
    {
      "number": 833,
      "text": "فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ حَتَّىٰ إِذَا فَرِحُوا بِمَا أُوتُوا أَخَذْنَاهُمْ بَغْتَةً فَإِذَا هُمْ مُبْلِسُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 44,
      "juz": 7,
      "manzil": 2,
      "page": 132,
      "ruku": 106,
      "hizbQuarter": 53,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَلَمَّا نَسُواْ مَا ذُكِّرُواْ بِهِۦ فَتَحۡنَا عَلَيۡهِمۡ أَبۡوَٰبَ كُلِّ شَيۡءٍ حَتَّىٰٓ إِذَا فَرِحُواْ بِمَآ أُوتُوٓاْ أَخَذۡنَٰهُم بَغۡتَةٗ فَإِذَا هُم مُّبۡلِسُونَ ٤٤\n                                    \n                                    \n                                    ( فلما نسوا ما ذكروا به ) أي : أعرضوا عنه وتناسوه وجعلوه وراء ظهورهم ( فتحنا عليهم أبواب كل شيء ) أي : فتحنا عليهم أبواب الرزق من كل ما يختارون ، وهذا استدراج منه تعالى وإملاء لهم ، عياذا بالله من مكره ; ولهذا قال : ( حتى إذا فرحوا بما أوتوا ) أي : من الأموال والأولاد والأرزاق ( أخذناهم بغتة ) أي : على غفلة ( فإذا هم مبلسون ) أي : آيسون من كل خير .\nقال الوالبي ، عن ابن عباس : المبلس : الآيس .\nوقال الحسن البصري : من وسع الله عليه فلم ير أنه يمكر به ، فلا رأي له . ومن قتر عليه فلم ير أنه ينظر له ، فلا رأي له ، ثم قرأ : ( فلما نسوا ما ذكروا به فتحنا عليهم أبواب كل شيء حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون ) قال الحسن : مكر بالقوم ورب الكعبة ; أعطوا حاجتهم ثم أخذوا . رواه ابن أبي حاتم .\nوقال قتادة : بغت القوم أمر الله ، وما أخذ الله قوما قط إلا عند سكرتهم وغرتهم ونعيمهم فلا تغتروا بالله ، إنه لا يغتر بالله إلا القوم الفاسقون . رواه ابن أبي حاتم أيضا .\nوقال مالك ، عن الزهري : ( فتحنا عليهم أبواب كل شيء ) قال : إرخاء الدنيا وسترها .\nوقد قال الإمام أحمد : حدثنا يحيى بن غيلان ، حدثنا رشدين - يعني ابن سعد أبا الحجاج المهري - عن حرملة بن عمران التجيبي ، عن عقبة بن مسلم ، عن عقبة بن عامر ، عن النبي - صلى الله عليه وسلم - قال : \" إذا رأيت الله يعطي العبد من الدنيا على معاصيه ما يحب ، فإنما هو استدراج \" . ثم تلا رسول الله - صلى الله عليه وسلم - ( فلما نسوا ما ذكروا به فتحنا عليهم أبواب كل شيء حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون )\nورواه ابن جرير وابن أبي حاتم ، من حديث حرملة وابن لهيعة ، عن عقبة بن مسلم ، عن عقبة بن عامر ، به\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا هشام بن عمار ، حدثنا عراك بن خالد بن يزيد ، حدثني أبي ، عن إبراهيم بن أبي عبلة ، عن عبادة بن الصامت [ رضي الله عنه ] أن رسول الله - صلى الله عليه وسلم - كان يقول : \" إن الله [ تبارك وتعالى ] إذا أراد بقوم بقاء - أو : نماء - رزقهم القصد والعفاف ، وإذا أراد الله بقوم اقتطاعا فتح لهم - أو فتح عليهم - باب خيانة \"\n( حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون ) كما قال : ( فقطع دابر القوم الذين ظلموا والحمد لله رب العالمين )\n                                    ",
        "qortoby": "فَلَمَّا نَسُواْ مَا ذُكِّرُواْ بِهِۦ فَتَحۡنَا عَلَيۡهِمۡ أَبۡوَٰبَ كُلِّ شَيۡءٍ حَتَّىٰٓ إِذَا فَرِحُواْ بِمَآ أُوتُوٓاْ أَخَذۡنَٰهُم بَغۡتَةٗ فَإِذَا هُم مُّبۡلِسُونَ ٤٤\n                                    \n                                    \n                                    قوله تعالى : فلما نسوا ما ذكروا به يقال : لم ذموا على النسيان وليس من فعلهم ؟ فالجواب : أن نسوا بمعنى تركوا ما ذكروا به ، عن ابن عباس وابن جريج ، وهو قول أبي علي ; وذلك لأن التارك للشيء إعراضا عنه قد صيره بمنزلة ما قد نسي ، كما يقال : تركه . في النسي .\nجواب آخر : وهو أنهم تعرضوا للنسيان فجاز الذم لذلك ; كما جاز الذم على التعرض لسخط الله عز وجل وعقابه . فتحنا عليهم أبواب كل شيء أي : من النعم والخيرات ، أي : كثرنا لهم ذلك . والتقدير عند أهل العربية : فتحنا عليهم أبواب كل شيء كان مغلقا عنهم . حتى إذا فرحوا بما أوتوا معناه بطروا وأشروا وأعجبوا وظنوا أن ذلك العطاء لا يبيد ، وأنه دال على رضاء الله عز وجل عنهم أخذناهم بغتة أي استأصلناهم وسطونا بهم . و ( بغتة ) معناه فجأة ، وهي الأخذ على غرة ومن غير تقدم أمارة ; فإذا أخذ الإنسان وهو غار غافل فقد أخذ بغتة ، وأنكى شيء ما يفجأ من البغت . وقد قيل : إن التذكير الذي سلف - فأعرضوا عنه - قام مقام الإمارة . والله أعلم . و ( بغتة ) مصدر في موضع الحال لا يقاس عليه عند سيبويه كما تقدم ; فكان ذلك استدراجا من الله تعالى كما قال : وأملي لهم إن كيدي متين نعوذ بالله من سخطه ومكره . قال بعض العلماء : رحم الله عبدا تدبر هذه الآية حتى إذا فرحوا بما أوتوا أخذناهم بغتة . وقال محمد بن النضر الحارثي : أمهل هؤلاء القوم عشرين سنة . وروى عقبة بن عامر أن النبي صلى الله عليه وسلم قال : إذا رأيتم الله تعالى يعطي العباد ما يشاءون على معاصيهم فإنما ذلك استدراج منه لهم ثم تلا ( فلما نسوا ما ذكروا به ) الآية كلها . وقال الحسن : والله ما أحد من الناس بسط الله له في الدنيا فلم يخف أن يكون قد مكر له فيها إلا كان قد نقص عمله ، وعجز رأيه . وما أمسكها الله عن عبد فلم يظن أنه خير له فيها إلا كان قد نقص عمله ، وعجز رأيه . وفي الخبر أن الله تعالى أوحى إلى موسى صلى الله عليه وسلم : إذا رأيت الفقر مقبلا إليك فقل مرحبا بشعار الصالحين وإذا رأيت الغنى مقبلا إليك فقل : ذنب عجلت عقوبته .\nقوله تعالى : فإذا هم مبلسون المبلس الباهت الحزين الآيس من الخير الذي لا يحير جوابا لشدة ما نزل به من سوء الحال ; قال العجاج :\nيا صاح هل تعرف رسما مكرسا قال نعم أعرفه وأبلسا\nأي : تحير لهول ما رأى ، ومن ذلك اشتق اسم إبليس ; أبلس الرجل سكت ، وأبلست الناقة وهي مبلاس إذا لم ترغ من شدة الضبعة ; ضبعت الناقة تضبع ضبعة وضبعا إذا أرادت الفحل .\n                                    ",
        "saadi": "فَلَمَّا نَسُواْ مَا ذُكِّرُواْ بِهِۦ فَتَحۡنَا عَلَيۡهِمۡ أَبۡوَٰبَ كُلِّ شَيۡءٍ حَتَّىٰٓ إِذَا فَرِحُواْ بِمَآ أُوتُوٓاْ أَخَذۡنَٰهُم بَغۡتَةٗ فَإِذَا هُم مُّبۡلِسُونَ ٤٤\n                                        \n                                        \n                                        \n                                        { فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ } من الدنيا ولذاتها وغفلاتها. { حَتَّى إِذَا فَرِحُوا بِمَا أُوتُوا أَخَذْنَاهُمْ بَغْتَةً فَإِذَا هُمْ مُبْلِسُونَ } أي: آيسون من كل خير، وهذا أشد ما يكون من العذاب، أن يؤخذوا على غرة، وغفلة وطمأنينة، ليكون أشد لعقوبتهم، وأعظم لمصيبتهم.\n                                    "
      },
      "originalText": "فَلَمَّا نَسُواْ مَا ذُكِّرُواْ بِهِۦ فَتَحۡنَا عَلَيۡهِمۡ أَبۡوَٰبَ كُلِّ شَيۡءٍ حَتَّىٰٓ إِذَا فَرِحُواْ بِمَآ أُوتُوٓاْ أَخَذۡنَٰهُم بَغۡتَةٗ فَإِذَا هُم مُّبۡلِسُونَ ٤٤"
    }
  ]
}