{
  "number": 139,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 880,
      "text": "وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ إِذْ قَالُوا مَا أَنْزَلَ اللَّهُ عَلَىٰ بَشَرٍ مِنْ شَيْءٍ ۗ قُلْ مَنْ أَنْزَلَ الْكِتَابَ الَّذِي جَاءَ بِهِ مُوسَىٰ نُورًا وَهُدًى لِلنَّاسِ ۖ تَجْعَلُونَهُ قَرَاطِيسَ تُبْدُونَهَا وَتُخْفُونَ كَثِيرًا ۖ وَعُلِّمْتُمْ مَا لَمْ تَعْلَمُوا أَنْتُمْ وَلَا آبَاؤُكُمْ ۖ قُلِ اللَّهُ ۖ ثُمَّ ذَرْهُمْ فِي خَوْضِهِمْ يَلْعَبُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 91,
      "juz": 7,
      "manzil": 2,
      "page": 139,
      "ruku": 112,
      "hizbQuarter": 55,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓ إِذۡ قَالُواْ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرٖ مِّن شَيۡءٖۗ قُلۡ مَنۡ أَنزَلَ ٱلۡكِتَٰبَ ٱلَّذِي جَآءَ بِهِۦ مُوسَىٰ نُورٗا وَهُدٗى لِّلنَّاسِۖ تَجۡعَلُونَهُۥ قَرَاطِيسَ تُبۡدُونَهَا وَتُخۡفُونَ كَثِيرٗاۖ وَعُلِّمۡتُم مَّا لَمۡ تَعۡلَمُوٓاْ أَنتُمۡ وَلَآ ءَابَآؤُكُمۡۖ قُلِ ٱللَّهُۖ ثُمَّ ذَرۡهُمۡ فِي خَوۡضِهِمۡ يَلۡعَبُونَ ١٩\n                                    \n                                    \n                                    يقول تعالى : وما عظموا الله حق تعظيمه ، إذ كذبوا رسله إليهم ، قال ابن عباس ومجاهد وعبد الله بن كثير : نزلت في قريش . واختاره ابن جرير ، وقيل : نزلت في طائفة من اليهود ; وقيل : في فنحاص رجل منهم ، وقيل : في مالك بن الصيف .\n( قالوا ما أنزل الله على بشر من شيء ) والأول هو الأظهر ; لأن الآية مكية ، واليهود لا ينكرون إنزال الكتب من السماء وقريش - والعرب قاطبة - كانوا يبعدون إرسال رسول من البشر ، كما قال [ تعالى ] ( أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس [ وبشر الذين آمنوا أن لهم قدم صدق عند ربهم ] ) [ يونس : 2 ] ، وقال تعالى : ( وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث الله بشرا رسولا قل لو كان في الأرض ملائكة يمشون مطمئنين لنزلنا عليهم من السماء ملكا رسولا ) [ الإسراء : 94 ، 95 ] ، وقال هاهنا : ( وما قدروا الله حق قدره إذ قالوا ما أنزل الله على بشر من شيء ) قال الله تعالى : ( قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس ) ؟ أي : قل يا محمد لهؤلاء المنكرين لإنزال شيء من الكتب من عند الله ، في جواب سلبهم العام بإثبات قضية جزئية موجبة : ( من أنزل الكتاب الذي جاء به موسى ) يعني : التوراة التي قد علمتم - وكل أحد - أن الله قد أنزلها على موسى بن عمران نورا وهدى للناس ، أي : ليستضاء بها في كشف المشكلات ، ويهتدى بها من ظلم الشبهات .\nوقوله : ( تجعلونه قراطيس تبدونها وتخفون كثيرا ) أي : يجعلها حملتها قراطيس ، أي : قطعا يكتبونها من الكتاب الأصلي الذي بأيديهم ويحرفون فيها ما يحرفون ويبدلون ويتأولون ، ويقولون : ( هذا من عند الله ) [ البقرة : 79 ] ، أي : في كتابه المنزل ، وما هو من عند الله ; ولهذا قال : ( تجعلونه قراطيس تبدونها وتخفون كثيرا )\nوقوله : ( وعلمتم ما لم تعلموا أنتم ولا آباؤكم ) أي : ومن أنزل القرآن الذي علمكم الله فيه من خبر ما سبق ، ونبأ ما يأتي ما لم تكونوا تعلمون ذلك أنتم ولا آباؤكم .\nقال قتادة : هؤلاء مشركو العرب . وقال مجاهد : هذه للمسلمين .\nوقوله : ( قل الله ) قال علي بن أبي طلحة ، عن ابن عباس : أي : قل : الله أنزله . وهذا الذي قاله ابن عباس هو المتعين في تفسير هذه الكلمة ، لا ما قاله بعض المتأخرين ، من أن معنى ) قل الله ) أي : لا يكون خطاب لهم إلا هذه الكلمة ، كلمة : \" الله \"\nوهذا الذي قاله هذا القائل يكون أمرا بكلمة مفردة من غير تركيب ، والإتيان بكلمة مفردة لا يفيد في لغة العرب فائدة يحسن السكوت عليها .\nوقوله : ( ثم ذرهم في خوضهم يلعبون ) أي : ثم دعهم في جهلهم وضلالهم يلعبون ، حتى يأتيهم من الله اليقين فسوف يعلمون ألهم العاقبة ، أم لعباد الله المتقين؟\n                                    ",
        "qortoby": "وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓ إِذۡ قَالُواْ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرٖ مِّن شَيۡءٖۗ قُلۡ مَنۡ أَنزَلَ ٱلۡكِتَٰبَ ٱلَّذِي جَآءَ بِهِۦ مُوسَىٰ نُورٗا وَهُدٗى لِّلنَّاسِۖ تَجۡعَلُونَهُۥ قَرَاطِيسَ تُبۡدُونَهَا وَتُخۡفُونَ كَثِيرٗاۖ وَعُلِّمۡتُم مَّا لَمۡ تَعۡلَمُوٓاْ أَنتُمۡ وَلَآ ءَابَآؤُكُمۡۖ قُلِ ٱللَّهُۖ ثُمَّ ذَرۡهُمۡ فِي خَوۡضِهِمۡ يَلۡعَبُونَ ١٩\n                                    \n                                    \n                                    وما قدروا الله حق قدره إذ قالوا ما أنزل الله على بشر من شيء قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس تجعلونه قراطيس تبدونها وتخفون كثيرا وعلمتم ما لم تعلموا أنتم ولا آباؤكم قل الله ثم ذرهم في خوضهم يلعبون\nقوله تعالى وما قدروا الله حق قدره أي فيما وجب له واستحال عليه وجاز . قال ابن عباس : ما آمنوا أنه على كل شيء قدير . وقال الحسن : ما عظموه حق عظمته . وهذا يكون من قولهم : لفلان قدر . وشرح هذا أنهم لما قالوا : ما أنزل الله على بشر من شيء نسبوا الله عز وجل إلى أنه لا يقيم الحجة على عباده ، ولا يأمرهم بما لهم فيه الصلاح ; فلم يعظموه حق عظمته ولا عرفوه حق معرفته . وقال أبو عبيدة : أي ما عرفوا الله حق معرفته . قال النحاس : وهذا معنى حسن ; لأن معنى قدرت الشيء وقدرته عرفت مقداره . ويدل عليه قوله تعالى : إذ قالوا ما أنزل الله على بشر من شيء أي لم يعرفوه حق معرفته ; إذ أنكروا أن يرسل رسولا . والمعنيان متقاربان . وقد قيل : وما قدروا نعم الله حق تقديرها . وقرأ أبو حيوة \" وما قدروا الله حق قدره \" بفتح الدال ، وهي لغة .\nإذ قالوا ما أنزل الله على بشر من شيء قال ابن عباس وغيره : يعني مشركي قريش . وقال الحسن وسعيد بن جبير : الذي قاله أحد اليهود ، قال : لم ينزل الله كتابا من السماء . قال السدي : اسمه فنحاص . وعن سعيد بن جبير أيضا قال : هو مالك بن الصيف ، جاء يخاصم النبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم : أنشدك بالذي أنزل التوراة على موسى أما تجد في التوراة أن الله يبغض الحبر السمين ؟ - وكان حبرا سمينا - فغضب وقال : والله ما أنزل الله على بشر من شيء . فقال له أصحابه الذين معه : ويحك ! ولا على موسى ؟ فقال : والله ما أنزل الله على بشر من شيء فنزلت الآية . ثم قال نقضا لقولهم وردا عليهم : \" قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس يجعلونه قراطيس \" أي في قراطيس يبدونها ويخفون كثيرا هذا لليهود الذين أخفوا صفة النبي صلى الله عليه وسلم وغيرها من الأحكام .\nقل من أنزل الكتاب الذي جاء به موسى خطاب للمشركين .\nوقوله : \" يجعلونه قراطيس \" لليهود .\nوقوله وعلمتم ما لم تعلموا أنتم ولا آباؤكم للمسلمين وهذا يصح على قراءة من قرأ \" يجعلونه قراطيس يبدونها ويخفون \" بالياء . والوجه على قراءة التاء أن يكون كله لليهود ، ويكون معنى وعلمتم ما لم تعلموا أي وعلمتم ما لم تكونوا تعلمونه أنتم ولا آباؤكم على وجه المن عليهم بإنزال التوراة . وجعلت التوراة صحفا فلذلك قال قراطيس تبدونها أي تبدون القراطيس . وهذا ذم لهم ; ولذلك كره العلماء كتب القرآن أجزاء .\n\" قل الله \" أي قل يا محمد الله الذي أنزل ذلك الكتاب على موسى وهذا الكتاب علي . أو قل : الله علمكم الكتاب .\nثم ذرهم في خوضهم يلعبون أي لاعبين ، ولو كان جوابا للأمر لقال يلعبوا . ومعنى الكلام التهديد . وقيل : هو من المنسوخ بالقتال ; ثم قيل : \" يجعلونه \" في موضع الصفة لقوله \" نورا وهدى \" فيكون في الصلة . ويحتمل أن يكون مستأنفا ، والتقدير : يجعلونه ذا قراطيس . وقوله : \" يبدونها ويخفون كثيرا \" يحتمل أن يكون صفة لقراطيس ; لأن النكرة توصف بالجمل . ويحتمل أن يكون مستأنفا حسبما تقدم .\n                                    ",
        "saadi": "وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓ إِذۡ قَالُواْ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرٖ مِّن شَيۡءٖۗ قُلۡ مَنۡ أَنزَلَ ٱلۡكِتَٰبَ ٱلَّذِي جَآءَ بِهِۦ مُوسَىٰ نُورٗا وَهُدٗى لِّلنَّاسِۖ تَجۡعَلُونَهُۥ قَرَاطِيسَ تُبۡدُونَهَا وَتُخۡفُونَ كَثِيرٗاۖ وَعُلِّمۡتُم مَّا لَمۡ تَعۡلَمُوٓاْ أَنتُمۡ وَلَآ ءَابَآؤُكُمۡۖ قُلِ ٱللَّهُۖ ثُمَّ ذَرۡهُمۡ فِي خَوۡضِهِمۡ يَلۡعَبُونَ ١٩\n                                        \n                                        \n                                        \n                                        هذا تشنيع على من نفى الرسالة، [من اليهود والمشركين] وزعم أن الله ما أنزل على بشر من شيء، فمن قال هذا، فما قدر الله حق قدره، ولا عظمه حق عظمته، إذ هذا قدح في حكمته، وزعم أنه يترك عباده هملا، لا يأمرهم ولا ينهاهم، ونفي لأعظم منة، امتن الله بها على عباده، وهي الرسالة، التي لا طريق للعباد إلى نيل السعادة، والكرامة، والفلاح، إلا بها، فأي قدح في الله أعظم من هذا؟\" { قُلْ ْ} لهم –ملزما بفساد قولهم، وقرِّرْهم، بما به يقرون-: { مَنْ أَنْزَلَ الْكِتَابَ الَّذِي جَاءَ بِهِ مُوسَى ْ} وهو التوراة العظيمة { نُورًا ْ} في ظلمات الجهل { وَهُدًى ْ} من الضلالة، وهاديا إلى الصراط المستقيم علما وعملا، وهو الكتاب الذي شاع وذاع، وملأ ذكره القلوب والأسماع. حتى أنهم جعلوا يتناسخونه في القراطيس، ويتصرفون فيه بما شاءوا، فما وافق أهواءهم منه، أبدوه وأظهروه، وما خالف ذلك، أخفوه وكتموه، وذلك كثير. { وَعُلِّمْتُمْ ْ} من العلوم التي بسبب ذلك الكتاب الجليل { مَا لَمْ تَعْلَمُوا أَنْتُمْ وَلَا آبَاؤُكُمْ ْ} فإذا سألتهم عمن أنزل هذا الكتاب الموصوف بتلك الصفات، فأجب عن هذا السؤال. و { قل الله ْ} الذي أنزله، فحينئذ يتضح الحق وينجلي مثل الشمس، وتقوم عليهم الحجة، ثم إذا ألزمتهم بهذا الإلزام { ذَرْهُمْ فِي خَوْضِهِمْ يَلْعَبُونَ ْ} أي: اتركهم يخوضوا في الباطل، ويلعبوا بما لا فائدة فيه، حتى يلاقوا يومهم الذي يوعدون.\n                                    "
      },
      "originalText": "وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓ إِذۡ قَالُواْ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرٖ مِّن شَيۡءٖۗ قُلۡ مَنۡ أَنزَلَ ٱلۡكِتَٰبَ ٱلَّذِي جَآءَ بِهِۦ مُوسَىٰ نُورٗا وَهُدٗى لِّلنَّاسِۖ تَجۡعَلُونَهُۥ قَرَاطِيسَ تُبۡدُونَهَا وَتُخۡفُونَ كَثِيرٗاۖ وَعُلِّمۡتُم مَّا لَمۡ تَعۡلَمُوٓاْ أَنتُمۡ وَلَآ ءَابَآؤُكُمۡۖ قُلِ ٱللَّهُۖ ثُمَّ ذَرۡهُمۡ فِي خَوۡضِهِمۡ يَلۡعَبُونَ ١٩"
    },
    {
      "number": 881,
      "text": "وَهَٰذَا كِتَابٌ أَنْزَلْنَاهُ مُبَارَكٌ مُصَدِّقُ الَّذِي بَيْنَ يَدَيْهِ وَلِتُنْذِرَ أُمَّ الْقُرَىٰ وَمَنْ حَوْلَهَا ۚ وَالَّذِينَ يُؤْمِنُونَ بِالْآخِرَةِ يُؤْمِنُونَ بِهِ ۖ وَهُمْ عَلَىٰ صَلَاتِهِمْ يُحَافِظُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 92,
      "juz": 7,
      "manzil": 2,
      "page": 139,
      "ruku": 112,
      "hizbQuarter": 55,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَهَٰذَا كِتَٰبٌ أَنزَلۡنَٰهُ مُبَارَكٞ مُّصَدِّقُ ٱلَّذِي بَيۡنَ يَدَيۡهِ وَلِتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَاۚ وَٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ يُؤۡمِنُونَ بِهِۦۖ وَهُمۡ عَلَىٰ صَلَاتِهِمۡ يُحَافِظُونَ ٢٩\n                                    \n                                    \n                                    وقوله : ( وهذا كتاب ) يعني : القرآن ( أنزلناه مبارك مصدق الذي بين يديه ولتنذر أم القرى ) يعني : مكة ( ومن حولها ) من أحياء العرب ، ومن سائر طوائف بني آدم من عرب وعجم ، كما قال في الآية الأخرى : ( قل يا أيها الناس إني رسول الله إليكم جميعا ) [ الأعراف : 158 ] ، وقال ( لأنذركم به ومن بلغ ) [ الأنعام : 19 ] ، وقال ( ومن يكفر به من الأحزاب فالنار موعده ) [ هود : 17 ] ، وقال ( تبارك الذي نزل الفرقان على عبده ليكون للعالمين نذيرا ) [ الفرقان : 1 ] ، وقال ( وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ والله بصير بالعباد ) [ آل عمران : 20 ] ، وثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال : \" أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي \" وذكر منهن : \" وكان النبي يبعث إلى قومه ، وبعثت إلى الناس عامة \" ; ولهذا قال : ( والذين يؤمنون بالآخرة يؤمنون به ) أي : كل من آمن بالله واليوم الآخر آمن بهذا الكتاب المبارك الذي أنزلناه إليك يا محمد ، وهو القرآن ، ( وهم على صلاتهم يحافظون ) أي : يقومون بما افترض عليهم ، من أداء الصلوات في أوقاتها .\n                                    ",
        "qortoby": "وَهَٰذَا كِتَٰبٌ أَنزَلۡنَٰهُ مُبَارَكٞ مُّصَدِّقُ ٱلَّذِي بَيۡنَ يَدَيۡهِ وَلِتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَاۚ وَٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ يُؤۡمِنُونَ بِهِۦۖ وَهُمۡ عَلَىٰ صَلَاتِهِمۡ يُحَافِظُونَ ٢٩\n                                    \n                                    \n                                    قوله تعالى وهذا كتاب أنزلناه مبارك مصدق الذي بين يديه ولتنذر أم القرى ومن حولها والذين يؤمنون بالآخرة يؤمنون به وهم على صلاتهم يحافظون\nقوله تعالى وهذا كتاب يعني القرآن\n\" أنزلناه \" صفة\n\" مبارك \" أي بورك فيه ، والبركة الزيادة . ويجوز نصبه في غير القرآن على الحال .\nوكذا \" مصدق الذي بين يديه \" أي من الكتب المنزلة قبله ، فإنه يوافقها في نفي الشرك وإثبات التوحيد .\nولتنذر أم القرى ومن حولها يريد مكة والمراد أهلها ، فحذف المضاف ; أي أنزلناه للبركة والإنذار . \" ومن حولها \" يعني جميع الآفاق .\nوالذين يؤمنون بالآخرة يريد أتباع محمد صلى الله عليه وسلم ; بدليل قوله : وهم على صلاتهم يحافظون .\nوإيمان من آمن بالآخرة ولم يؤمن بالنبي عليه السلام ولا بكتابه غير معتد به .\n                                    ",
        "saadi": "وَهَٰذَا كِتَٰبٌ أَنزَلۡنَٰهُ مُبَارَكٞ مُّصَدِّقُ ٱلَّذِي بَيۡنَ يَدَيۡهِ وَلِتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَاۚ وَٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ يُؤۡمِنُونَ بِهِۦۖ وَهُمۡ عَلَىٰ صَلَاتِهِمۡ يُحَافِظُونَ ٢٩\n                                        \n                                        \n                                        \n                                        أي: { وَهَذَا ْ} القرآن الذي { أَنْزَلْنَاهُ ْ} إليك { مُبَارَكٌ ْ} أي: وَصْفُه البركة، وذلك لكثرة خيراته، وسعة مبراته. { مُصَدِّقُ الَّذِي بَيْنَ يَدَيْهِ ْ} أي: موافق للكتب السابقة، وشاهد لها بالصدق. { وَلِتُنْذِرَ أُمَّ الْقُرَى وَمَنْ حَوْلَهَا ْ} أي: وأنزلناه أيضا لتنذر أم القرى، وهي: مكة المكرمة، ومن حولها، من ديار العرب، بل، ومن سائر البلدان. فتحذر الناس عقوبة الله، وأخذه الأمم، وتحذرهم مما يوجب ذلك. { وَالَّذِينَ يُؤْمِنُونَ بِالْآخِرَةِ يُؤْمِنُونَ بِهِ ْ} لأن الخوف إذا كان في القلب عمرت أركانه، وانقاد لمراضي الله. { وَهُمْ عَلَى صَلَاتِهِمْ يُحَافِظُونَ ْ} أي: يداومون عليها، ويحفظون أركانها وحدودها وشروطها وآدابها، ومكملاتها. جعلنا الله منهم.\n                                    "
      },
      "originalText": "وَهَٰذَا كِتَٰبٌ أَنزَلۡنَٰهُ مُبَارَكٞ مُّصَدِّقُ ٱلَّذِي بَيۡنَ يَدَيۡهِ وَلِتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَاۚ وَٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ يُؤۡمِنُونَ بِهِۦۖ وَهُمۡ عَلَىٰ صَلَاتِهِمۡ يُحَافِظُونَ ٢٩"
    },
    {
      "number": 882,
      "text": "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ قَالَ أُوحِيَ إِلَيَّ وَلَمْ يُوحَ إِلَيْهِ شَيْءٌ وَمَنْ قَالَ سَأُنْزِلُ مِثْلَ مَا أَنْزَلَ اللَّهُ ۗ وَلَوْ تَرَىٰ إِذِ الظَّالِمُونَ فِي غَمَرَاتِ الْمَوْتِ وَالْمَلَائِكَةُ بَاسِطُو أَيْدِيهِمْ أَخْرِجُوا أَنْفُسَكُمُ ۖ الْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ بِمَا كُنْتُمْ تَقُولُونَ عَلَى اللَّهِ غَيْرَ الْحَقِّ وَكُنْتُمْ عَنْ آيَاتِهِ تَسْتَكْبِرُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 93,
      "juz": 7,
      "manzil": 2,
      "page": 139,
      "ruku": 112,
      "hizbQuarter": 55,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِيَ إِلَيَّ وَلَمۡ يُوحَ إِلَيۡهِ شَيۡءٞ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَآ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰٓ إِذِ ٱلظَّٰلِمُونَ فِي غَمَرَٰتِ ٱلۡمَوۡتِ وَٱلۡمَلَٰٓئِكَةُ بَاسِطُوٓاْ أَيۡدِيهِمۡ أَخۡرِجُوٓاْ أَنفُسَكُمُۖ ٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَيۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَايَٰتِهِۦ تَسۡتَكۡبِرُونَ ٣٩\n                                    \n                                    \n                                    يقول تعالى : ( ومن أظلم ممن افترى على الله كذبا ) أي : لا أحد أظلم ممن كذب على الله ، فجعل له شريكا أو ولدا ، أو ادعى أن الله أرسله إلى الناس ولم يكن أرسله; ولهذا قال تعالى : ( أو قال أوحي إلي ولم يوح إليه شيء )\nقال عكرمة وقتادة : نزلت في مسيلمة الكذاب لعنه الله .\n( ومن قال سأنزل مثل ما أنزل الله ) يعني : ومن ادعى أنه يعارض ما جاء من عند الله من الوحي مما يفتريه من القول ، كما قال تعالى : ( وإذا تتلى عليهم آياتنا قالوا قد سمعنا لو نشاء لقلنا مثل هذا إن هذا إلا أساطير الأولين ) [ الأنفال : 31 ] ، قال الله : ( ولو ترى إذ الظالمون في غمرات الموت ) أي : في سكراته وغمراته وكرباته ، ( والملائكة باسطو أيديهم ) أي : بالضرب كما قال : ( لئن بسطت إلي يدك لتقتلني ما أنا بباسط يدي إليك لأقتلك ) الآية [ المائدة : 28 ] ، وقال : ( ويبسطوا إليكم أيديهم وألسنتهم بالسوء ) الآية [ الممتحنة : 2 ] .\nوقال الضحاك ، وأبو صالح : ( باسطو أيديهم ) أي : بالعذاب . وكما قال تعالى ( ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم ) [ الأنفال : 50 ] ; ولهذا قال : ( والملائكة باسطو أيديهم ) أي : بالضرب لهم حتى تخرج أنفسهم من أجسادهم; ولهذا يقولون لهم : ( أخرجوا أنفسكم ) وذلك أن الكافر إذا احتضر بشرته الملائكة بالعذاب والنكال ، والأغلال والسلاسل ، والجحيم والحميم ، وغضب الرحمن الرحيم ، فتتفرق روحه في جسده ، وتعصى وتأبى الخروج ، فتضربهم الملائكة حتى تخرج أرواحهم من أجسادهم ، قائلين لهم : ( أخرجوا أنفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق وكنتم عن آياته تستكبرون ) أي : اليوم تهانون غاية الإهانة ، كما كنتم تكذبون على الله ، وتستكبرون عن اتباع آياته ، والانقياد لرسله .\nوقد وردت أحاديث متواترة في كيفية احتضار المؤمن والكافر ، وهي مقررة عند قوله تعالى : ( يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة ) [ إبراهيم : 27 ] .\nوقد ذكر ابن مردويه هاهنا حديثا مطولا جدا من طريق غريبة ، عن الضحاك ، عن ابن عباس مرفوعا ، فالله أعلم .\n                                    ",
        "qortoby": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِيَ إِلَيَّ وَلَمۡ يُوحَ إِلَيۡهِ شَيۡءٞ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَآ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰٓ إِذِ ٱلظَّٰلِمُونَ فِي غَمَرَٰتِ ٱلۡمَوۡتِ وَٱلۡمَلَٰٓئِكَةُ بَاسِطُوٓاْ أَيۡدِيهِمۡ أَخۡرِجُوٓاْ أَنفُسَكُمُۖ ٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَيۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَايَٰتِهِۦ تَسۡتَكۡبِرُونَ ٣٩\n                                    \n                                    \n                                    قوله : ومن أظلم ممن افترى على الله كذبا أو قال أوحي إلي ولم يوح إليه شيء ومن قال سأنزل مثل ما أنزل الله ولو ترى إذ الظالمون في غمرات الموت والملائكة باسطو أيديهم أخرجوا أنفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق وكنتم عن آياته تستكبرون\nقوله تعالى ومن أظلم ابتداء وخبر ; أي لا أحد أظلم ممن افترى أي اختلق .\nأو قال أوحي إلي فزعم أنه نبي\nولم يوح إليه شيء نزلت في رحمان اليمامة والأسود العنسي وسجاح زوج مسيلمة ; كلهم تنبأ وزعم أن الله قد أوحى إليه . قال قتادة : بلغنا أن الله أنزل هذا في مسيلمة ; وقاله ابن عباس . قلت : ومن هذا النمط من أعرض عن الفقه والسنن وما كان عليه السلف من السنن فيقول : وقع في خاطري كذا ، أو أخبرني قلبي بكذا ; فيحكمون بما يقع في قلوبهم ويغلب عليهم من خواطرهم ، ويزعمون أن ذلك لصفائها من الأكدار وخلوها من الأغيار ، فتتجلى لهم العلوم الإلهية والحقائق الربانية ، فيقفون على أسرار الكليات ويعلمون أحكام الجزئيات فيستغنون بها عن أحكام الشرائع الكليات ، ويقولون : هذه الأحكام الشرعية العامة ، إنما يحكم بها على الأغبياء والعامة ، وأما الأولياء وأهل الخصوص ، فلا يحتاجون لتلك النصوص . وقد جاء فيما ينقلون : استفت قلبك وإن أفتاك المفتون ; ويستدلون على هذا بالخضر ; وأنه استغنى بما تجلى له من تلك العلوم ، عما كان عند موسى من تلك الفهوم . وهذا القول زندقة وكفر ، يقتل قائله ولا يستتاب ، ولا يحتاج معه إلى سؤال ولا جواب ; فإنه يلزم منه هد الأحكام وإثبات أنبياء بعد نبينا صلى الله عليه وسلم . وسيأتي لهذا المعنى في \" الكهف \" مزيد بيان إن شاء الله تعالى .\nقوله تعالى : ومن قال سأنزل مثل ما أنزل الله \" من \" في موضع خفض ; أي ومن أظلم ممن قال سأنزل ، والمراد عبد الله بن أبي سرح الذي كان يكتب الوحي لرسول الله صلى الله عليه وسلم ، ثم ارتد ولحق بالمشركين . وسبب ذلك فيما ذكر المفسرون أنه لما نزلت الآية التي في \" المؤمنون \" : ولقد خلقنا الإنسان من سلالة من طين دعاه النبي صلى الله عليه وسلم فأملاها عليه ; فلما انتهى إلى قوله ثم أنشأناه خلقا آخر عجب عبد الله في تفصيل خلق الإنسان فقال : فتبارك الله أحسن الخالقين . فقال رسول الله صلى الله عليه وسلم : وهكذا أنزلت علي فشك عبد الله حينئذ وقال : لئن كان محمد صادقا لقد أوحي إلي كما أوحي إليه ، ولئن كان كاذبا لقد قلت كما قال . فارتد عن الإسلام ولحق بالمشركين ، فذلك قوله : ومن قال سأنزل مثل ما أنزل الله رواه الكلبي عن ابن عباس . وذكره محمد بن إسحاق قال حدثني شرحبيل قال : نزلت في عبد الله بن سعد بن أبي سرح ومن قال سأنزل مثل ما أنزل الله ارتد عن الإسلام ، فلما دخل رسول الله صلى الله عليه وسلم مكة أمر بقتله وقتل عبد الله بن خطل ومقيس بن صبابة ولو وجدوا تحت أستار الكعبة ، ففر عبد الله بن أبي سرح إلى عثمان رضي الله عنه ، وكان أخاه من الرضاعة ، أرضعت أمه عثمان ، فغيبه عثمان حتى أتى به رسول الله صلى الله عليه وسلم بعد ما اطمأن أهل مكة فاستأمنه له ; فصمت رسول الله صلى الله عليه وسلم طويلا ثم قال : نعم . فلما انصرف عثمان قال رسول الله صلى الله عليه وسلم : ما صمت إلا ليقوم إليه بعضكم فيضرب عنقه . فقال رجل من الأنصار : فهلا أومأت إلي يا رسول الله ؟ فقال : إن النبي لا ينبغي أن تكون له خائنة الأعين . قال أبو عمر : وأسلم عبد الله بن سعد بن أبي سرح أيام الفتح فحسن إسلامه ، ولم يظهر منه ما ينكر عليه بعد ذلك . وهو أحد النجباء العقلاء الكرماء منقريش ، وفارس بني عامر بن لؤي المعدود فيهم ، ثم ولاه عثمان بعد ذلك مصر سنة خمس وعشرين . وفتح على يديه إفريقية سنة سبع وعشرين ، وغزا منها الأساود من أرض النوبة سنة إحدى وثلاثين ، وهو هادنهم الهدنة الباقية إلى اليوم . وغزا الصواري من أرض الروم سنة أربع وثلاثين ; فلما رجع من وفاداته منعه ابن أبي حذيفة من دخول الفسطاط ، فمضى إلى عسقلان ، فأقام فيها حتى قتل عثمان رضي الله عنه . وقيل : بل أقام بالرملة حتى مات فارا من الفتنة . ودعا ربه فقال : اللهم اجعل خاتمة عملي صلاة الصبح ; فتوضأ ثم صلى فقرأ في الركعة الأولى بأم القرآن والعاديات ، وفي الثانية بأم القرآن وسورة ، ثم سلم عن يمينه ، ثم ذهب يسلم عن يساره فقبض الله روحه . ذكر ذلك كله يزيد بن أبي حبيب وغيره . ولم يبايع لعلي ولا لمعاوية رضي الله عنهما . وكانت وفاته قبل اجتماع الناس على معاوية . وقيل : إنه توفي بإفريقية . والصحيح أنه توفي بعسقلان سنة ست أو سبع وثلاثين . وقيل : سنة ست وثلاثين . وروى حفص بن عمر عن الحكم بن أبان عن عكرمة أن هذه الآية نزلت في النضر بن الحارث ; لأنه عارض القرآن فقال : والطاحنات طحنا . والعاجنات عجنا . فالخابزات خبزا . فاللاقمات لقما .\nقوله تعالى ولو ترى إذ الظالمون في غمرات الموت أي شدائده وسكراته . والغمرة الشدة ; وأصلها الشيء الذي يغمر الأشياء فيغطيها . ومنه غمره الماء . ثم وضعت في معنى الشدائد والمكاره . ومنه غمرات الحرب . قال الجوهري : والغمرة الشدة ، والجمع غمر مثل نوبة ونوب . قال القطامي يصف سفينة نوح عليه السلام :\nوحان لتالك الغمر انحسار\nوغمرات الموت شدائده .\nوالملائكة باسطو أيديهم ابتداء وخبر . والأصل باسطون . قيل : بالعذاب ومطارق الحديد ; عن الحسن والضحاك . وقيل : لقبض أرواحهم ; وفي التنزيل : ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم فجمعت هذه الآية القولين . يقال : بسط إليه يده بالمكروه .\nأخرجوا أنفسكم أي خلصوها من العذاب إن أمكنكم ، وهو توبيخ . وقيل : أخرجوها كرها ; لأن روح المؤمن تنشط للخروج للقاء ربه ، وروح الكافر تنتزع انتزاعا شديدا ، ويقال : أيتها النفس الخبيثة اخرجي ساخطة مسخوطا عليك إلى عذاب الله وهوانه ; كذا جاء في حديث أبي هريرة وغيره . وقد أتينا عليه في كتاب \" التذكرة \" والحمد لله . وقيل : هو بمنزلة قول القائل لمن يعذبه : لأذيقنك العذاب ولأخرجن نفسك ; وذلك لأنهم لا يخرجون أنفسهم بل يقبضها ملك الموت وأعوانه . وقيل : يقال هذا للكفار وهم في النار . والجواب محذوف لعظم الأمر ; أي ولو رأيت الظالمين في هذه الحال لرأيت عذابا عظيما . والهون والهوان سواء .\nتستكبرون أي تتعظمون وتأنفون عن قبول آياته .\n                                    ",
        "saadi": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِيَ إِلَيَّ وَلَمۡ يُوحَ إِلَيۡهِ شَيۡءٞ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَآ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰٓ إِذِ ٱلظَّٰلِمُونَ فِي غَمَرَٰتِ ٱلۡمَوۡتِ وَٱلۡمَلَٰٓئِكَةُ بَاسِطُوٓاْ أَيۡدِيهِمۡ أَخۡرِجُوٓاْ أَنفُسَكُمُۖ ٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَيۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَايَٰتِهِۦ تَسۡتَكۡبِرُونَ ٣٩\n                                        \n                                        \n                                        \n                                        يقول تعالى: لا أحد أعظم ظلما، ولا أكبر جرما، ممن كذب [على] الله.بأن نسب إلى الله قولا أو حكما وهو تعالى بريء منه، وإنما كان هذا أظلم الخلق، لأن فيه من الكذب، وتغيير الأديان أصولها، وفروعها، ونسبة ذلك إلى الله -ما هو من أكبر المفاسد. ويدخل في ذلك، ادعاء النبوة، وأن الله يوحي إليه، وهو كاذب في ذلك، فإنه - مع كذبه على الله، وجرأته على عظمته وسلطانه- يوجب على الخلق أن يتبعوه، ويجاهدهم على ذلك، ويستحل دماء من خالفه وأموالهم. ويدخل في هذه الآية، كل من ادعى النبوة، كمسيلمة الكذاب والأسود العنسي والمختار، وغيرهم ممن اتصف بهذا الوصف. { وَمَنْ قَالَ سَأُنْزِلُ مِثْلَ مَا أَنْزَلَ اللَّهُ ْ} أي: ومن أظلم ممن زعم. أنه يقدر على ما يقدر الله عليه ويجاري الله في أحكامه، ويشرع من الشرائع، كما شرعه الله. ويدخل في هذا، كل من يزعم أنه يقدر على معارضة القرآن، وأنه في إمكانه أن يأتي بمثله. وأي: ظلم أعظم من دعوى الفقير العاجز بالذات، الناقص من كل وجه، مشاركةَ القوي الغني، الذي له الكمال المطلق، من جميع الوجوه، في ذاته وأسمائه وصفاته؟\" ولما ذم الظالمين، ذكر ما أعد لهم من العقوبة في حال الاحتضار، ويوم القيامة فقال: { وَلَوْ تَرَى إِذِ الظَّالِمُونَ فِي غَمَرَاتِ الْمَوْتِ ْ} أي: شدائده وأهواله الفظيعة، وكُرَبه الشنيعة –لرأيت أمرا هائلا، وحالة لا يقدر الواصف أن يصفها. { وَالْمَلَائِكَةُ بَاسِطُو أَيْدِيهِمْ ْ} إلى أولئك الظالمين المحتضرين بالضرب والعذاب، يقولون لهم عند منازعة أرواحهم وقلقها، وتعصيها للخروج من الأبدان: { أَخْرِجُوا أَنْفُسَكُمُ الْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُونِ ْ} أي: العذاب الشديد، الذي يهينكم ويذلكم والجزاء من جنس العمل، فإن هذا العذاب { بِمَا كُنْتُمْ تَقُولُونَ عَلَى اللَّهِ غَيْرَ الْحَقِّ ْ} من كذبكم عليه، وردكم للحق، الذي جاءت به الرسل. { وَكُنْتُمْ عَنْ آيَاتِهِ تَسْتَكْبِرُونَ ْ} أي: تَرَفَّعون عن الانقياد لها، والاستسلام لأحكامها. وفي هذا دليل على عذاب البرزخ ونعيمه، فإن هذا الخطاب، والعذاب الموجه إليهم، إنما هو عند الاحتضار وقبيل الموت وبعده. وفيه دليل، على أن الروح جسم، يدخل ويخرج، ويخاطب، ويساكن الجسد، ويفارقه، فهذه حالهم في البرزخ. وأما يوم القيامة، فإنهم إذا وردوها، وردوها مفلسين فرادى بلا أهل ولا مال، ولا أولاد ولا جنود، ولا أنصار، كما خلقهم الله أول مرة، عارين من كل شيء. فإن الأشياء، إنما تتمول وتحصل بعد ذلك، بأسبابها، التي هي أسبابها، وفي ذلك اليوم تنقطع جميع الأمور، التي كانت مع العبد في الدنيا، سوى العمل الصالح والعمل السيء، الذي هو مادة الدار الآخرة، الذي تنشأ عنه، ويكون حسنها وقبحها، وسرورها وغمومها، وعذابها ونعيمها، بحسب الأعمال. فهي التي تنفع أو تضر، وتسوء أو تسر، وما سواها من الأهل والولد، والمال والأنصار، فعواري خارجية، وأوصاف زائلة، وأحوال حائلة\n                                    "
      },
      "originalText": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِيَ إِلَيَّ وَلَمۡ يُوحَ إِلَيۡهِ شَيۡءٞ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَآ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰٓ إِذِ ٱلظَّٰلِمُونَ فِي غَمَرَٰتِ ٱلۡمَوۡتِ وَٱلۡمَلَٰٓئِكَةُ بَاسِطُوٓاْ أَيۡدِيهِمۡ أَخۡرِجُوٓاْ أَنفُسَكُمُۖ ٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَيۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَايَٰتِهِۦ تَسۡتَكۡبِرُونَ ٣٩"
    },
    {
      "number": 883,
      "text": "وَلَقَدْ جِئْتُمُونَا فُرَادَىٰ كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ وَتَرَكْتُمْ مَا خَوَّلْنَاكُمْ وَرَاءَ ظُهُورِكُمْ ۖ وَمَا نَرَىٰ مَعَكُمْ شُفَعَاءَكُمُ الَّذِينَ زَعَمْتُمْ أَنَّهُمْ فِيكُمْ شُرَكَاءُ ۚ لَقَدْ تَقَطَّعَ بَيْنَكُمْ وَضَلَّ عَنْكُمْ مَا كُنْتُمْ تَزْعُمُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 94,
      "juz": 7,
      "manzil": 2,
      "page": 139,
      "ruku": 112,
      "hizbQuarter": 55,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ جِئۡتُمُونَا فُرَٰدَىٰ كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةٖ وَتَرَكۡتُم مَّا خَوَّلۡنَٰكُمۡ وَرَآءَ ظُهُورِكُمۡۖ وَمَا نَرَىٰ مَعَكُمۡ شُفَعَآءَكُمُ ٱلَّذِينَ زَعَمۡتُمۡ أَنَّهُمۡ فِيكُمۡ شُرَكَٰٓؤُاْۚ لَقَد تَّقَطَّعَ بَيۡنَكُمۡ وَضَلَّ عَنكُم مَّا كُنتُمۡ تَزۡعُمُونَ ٤٩\n                                    \n                                    \n                                    وقوله : ( ولقد جئتمونا فرادى كما خلقناكم أول مرة ) أي : يقال لهم يوم معادهم هذا ، كما قال ( وعرضوا على ربك صفا لقد جئتمونا كما خلقناكم أول مرة ) [ الكهف : 48 ] ، أي : كما بدأناكم أعدناكم ، وقد كنتم تنكرون ذلك وتستبعدونه ، فهذا يوم البعث .\nوقوله : ( وتركتم ما خولناكم ) أي : من النعم والأموال التي اقتنيتموها في الدار الدنيا ( وراء ظهوركم ) وثبت في الصحيح أن رسول الله صلى الله عليه وسلم قال : \" يقول ابن آدم : مالي مالي ، وهل لك من مالك إلا ما أكلت فأفنيت ، أو لبست فأبليت ، أو تصدقت فأمضيت ، وما سوى ذلك فذاهب وتاركه للناس \"\nوقال الحسن البصري : يؤتى بابن آدم يوم القيامة كأنه بذج فيقول الله - عز وجل - له أين ما جمعت؟ فيقول يا رب ، جمعته وتركته أوفر ما كان ، فيقول : فأين ما قدمت لنفسك؟ فلا يراه قدم شيئا ، وتلا هذه الآية : ( ولقد جئتمونا فرادى كما خلقناكم أول مرة وتركتم ما خولناكم وراء ظهوركم ) رواه ابن أبي حاتم .\nوقوله : ( وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء ) تقريع لهم وتوبيخ على ما كانوا اتخذوا في الدار الدنيا من الأنداد والأصنام والأوثان ، ظانين أن تلك تنفعهم في معاشهم ومعادهم إن كان ثم معاد ، فإذا كان يوم القيامة تقطعت الأسباب ، وانزاح الضلال ، وضل عنهم ما كانوا يفترون ، ويناديهم الرب ، عز وجل ، على رءوس الخلائق : ( أين شركاؤكم الذين كنتم تزعمون ) [ الأنعام : 22 ] وقيل لهم ( أين ما كنتم تعبدون من دون الله هل ينصرونكم أو ينتصرون ) [ الشعراء : 92 ، 93 ] ; ولهذا قال هاهنا : ( وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء ) أي : في العبادة ، لهم فيكم قسط في استحقاق العبادة لهم .\nثم قال تعالى : ( لقد تقطع بينكم ) قرئ بالرفع ، أي شملكم ، وقرئ بالنصب ، أي : لقد انقطع ما بينكم من الوصلات والأسباب والوسائل ( وضل عنكم ) أي : وذهب عنكم ( ما كنتم تزعمون ) من رجاء الأصنام ، كما قال : ( إذ تبرأ الذين اتبعوا من الذين اتبعوا ورأوا العذاب وتقطعت بهم الأسباب وقال الذين اتبعوا لو أن لنا كرة فنتبرأ منهم كما تبرءوا منا كذلك يريهم الله أعمالهم حسرات عليهم وما هم بخارجين من النار ) [ البقرة : 166 ، 167 ] ، وقال تعالى : ( فإذا نفخ في الصور فلا أنساب بينهم يومئذ ولا يتساءلون ) [ المؤمنون : 101 ] ، وقال ( إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين ) [ العنكبوت : 25 ] ، وقال ( وقيل ادعوا شركاءكم فدعوهم فلم يستجيبوا لهم ) الآية [ القصص : 64 ] ، وقال تعالى : ( ويوم نحشرهم جميعا ثم نقول للذين أشركوا ) إلى قوله : ( وضل عنهم ما كانوا يفترون ) [ الأنعام : 22 - 24 ] ، والآيات في هذا كثيرة جدا .\n                                    ",
        "qortoby": "وَلَقَدۡ جِئۡتُمُونَا فُرَٰدَىٰ كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةٖ وَتَرَكۡتُم مَّا خَوَّلۡنَٰكُمۡ وَرَآءَ ظُهُورِكُمۡۖ وَمَا نَرَىٰ مَعَكُمۡ شُفَعَآءَكُمُ ٱلَّذِينَ زَعَمۡتُمۡ أَنَّهُمۡ فِيكُمۡ شُرَكَٰٓؤُاْۚ لَقَد تَّقَطَّعَ بَيۡنَكُمۡ وَضَلَّ عَنكُم مَّا كُنتُمۡ تَزۡعُمُونَ ٤٩\n                                    \n                                    \n                                    قوله تعالى ولقد جئتمونا فرادى كما خلقناكم أول مرة وتركتم ما خولناكم وراء ظهوركم وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء لقد تقطع بينكم وضل عنكم ما كنتم تزعمون\nقوله تعالى ولقد جئتمونا فرادى هذه عبارة عن الحشر وفرادى في موضع نصب على الحال ، ولم ينصرف لأن فيه ألف تأنيث . وقرأ أبو حيوة \" فرادا \" بالتنوين وهي لغة تميم ، ولا يقولون في موضع الرفع فراد . وحكى أحمد بن يحيى \" فراد \" بلا تنوين ، قال : مثل ثلاث ورباع . وفرادى جمع فردان كسكارى جمع سكران ، وكسالى جمع كسلان . وقيل : واحده \" فرد \" بجزم الراء ، و \" فرد \" بكسرها ، و \" فرد \" بفتحها ، و \" فريد \" . والمعنى : جئتمونا واحدا واحدا ، كل واحد منكم منفردا بلا أهل ولا مال ولا ولد ولا ناصر ممن كان يصاحبكم في الغي ، ولم ينفعكم ما عبدتم من دون الله . وقرأ الأعرج \" فردى \" مثل سكرى وكسلى بغير ألف .\nكما خلقناكم أول مرة أي منفردين كما خلقتم . وقيل : عراة كما خرجتم من بطون أمهاتكم حفاة غرلا بهما ليس معهم شيء . وقال العلماء : يحشر العبد غدا وله من الأعضاء ما كان له يوم ولد ; فمن قطع منه عضو يرد في القيامة عليه . وهذا معنى قوله : \" غرلا \" أي غير مختونين ، أي يرد عليهم ما قطع منهم عند الختان .\nقوله تعالى : وتركتم ما خولناكم أي أعطيناكم وملكناكم . والخول : ما أعطاه الله للإنسان من العبيد والنعم .\nوراء ظهوركم أي خلفكم .\nوما نرى معكم شفعاءكم أي الذين عبدتموهم وجعلتموهم شركاء يريد الأصنام أي شركائي . وكان المشركون يقولون : الأصنام شركاء الله وشفعاؤنا عنده .\nلقد تقطع بينكم قرأ نافع والكسائي وحفص بالنصب على الظرف ، على معنى لقد تقطع وصلكم بينكم . ودل على حذف الوصل قوله وما نرى معكم شفعاءكم الذين زعمتم . فدل هذا على التقاطع والتهاجر بينهم وبين شركائهم : إذ تبرءوا منهم ولم يكونوا معهم . ومقاطعتهم لهم هو تركهم وصلهم لهم ; فحسن إضمار الوصل بعد تقطع لدلالة الكلام عليه . وفي حرف ابن مسعود ما يدل على النصب فيه \" لقد تقطع ما بينكم \" وهذا لا يجوز فيه إلا النصب ، لأنك ذكرت المتقطع وهو \" ما \" . كأنه قال : لقد تقطع الوصل بينكم . وقيل : المعنى لقد تقطع الأمر بينكم . والمعنى متقارب . وقرأ الباقون \" بينكم \" بالرفع على أنه اسم غير ظرف ، فأسند الفعل إليه فرفع . ويقوي جعل \" بين \" اسما من جهة دخول حرف الجر عليه في قوله تعالى : ومن بيننا وبينك حجاب و هذا فراق بيني وبينك . ويجوز أن تكون قراءة النصب على معنى الرفع ، وإنما نصب لكثرة استعماله ظرفا منصوبا وهو في موضع رفع ، وهو مذهب الأخفش ; فالقراءتان على هذا بمعنى واحد ، فاقرأ بأيهما شئت .\nوضل عنكم أي ذهب .\nما كنتم تزعمون أي تكذبون به في الدنيا . روي أن الآية نزلت في النضر بن الحارث . وروي أن عائشة رضي الله عنها قرأت قول الله تعالى : ولقد جئتمونا فرادى كما خلقناكم أول مرة فقالت : يا رسول الله ، واسوءتاه ! إن الرجال والنساء يحشرون جميعا ، ينظر بعضهم إلى سوءة بعض ؟ فقال رسول الله صلى الله عليه وسلم : لكل امرئ منهم يومئذ شأن يغنيه لا ينظر الرجال إلى النساء ولا النساء إلى الرجال شغل بعضهم عن بعض . وهذا حديث ثابت في الصحيح أخرجه مسلم بمعناه .\n                                    ",
        "saadi": "وَلَقَدۡ جِئۡتُمُونَا فُرَٰدَىٰ كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةٖ وَتَرَكۡتُم مَّا خَوَّلۡنَٰكُمۡ وَرَآءَ ظُهُورِكُمۡۖ وَمَا نَرَىٰ مَعَكُمۡ شُفَعَآءَكُمُ ٱلَّذِينَ زَعَمۡتُمۡ أَنَّهُمۡ فِيكُمۡ شُرَكَٰٓؤُاْۚ لَقَد تَّقَطَّعَ بَيۡنَكُمۡ وَضَلَّ عَنكُم مَّا كُنتُمۡ تَزۡعُمُونَ ٤٩\n                                        \n                                        \n                                        \n                                        { وَلَقَدْ جِئْتُمُونَا فُرَادَى كَمَا خَلَقْنَاكُمْ أَوَّلَ مَرَّةٍ وَتَرَكْتُمْ مَا خَوَّلْنَاكُمْ ْ} أي: أعطيناكم، وأنعمنا به عليكم { وَرَاءَ ظُهُورِكُمْ ْ} لا يغنون عنكم شيئا { وَمَا نَرَى مَعَكُمْ شُفَعَاءَكُمُ الَّذِينَ زَعَمْتُمْ أَنَّهُمْ فِيكُمْ شُرَكَاءُ ْ} فإن المشركين يشركون بالله، ويعبدون معه الملائكة، والأنبياء، والصالحين، وغيرهم، وهم كلهم لله، ولكنهم يجعلون لهذه المخلوقات نصيبا من أنفسهم، وشركة في عبادتهم، وهذا زعم منهم وظلم، فإن الجميع عبيد لله، والله مالكهم، والمستحق لعبادتهم. فشركهم في العبادة، وصرفها لبعض العبيد، تنزيل لهم منزلة الخالق المالك، فيوبخون يوم القيامة ويقال لهم هذه المقالة. { وَمَا نَرَى مَعَكُمْ شُفَعَاءَكُمُ الَّذِينَ زَعَمْتُمْ أَنَّهُمْ فِيكُمْ شُرَكَاءُ لَقَدْ تَقَطَّعَ بَيْنَكُمْ ْ} أي: تقطعت الوصل والأسباب بينكم وبين شركائكم، من الشفاعة وغيرها فلم تنفع ولم تُجْد شيئا. { وَضَلَّ عَنْكُمْ مَا كُنْتُمْ تَزْعُمُونَ ْ} من الربح، والأمن والسعادة، والنجاة، التي زينها لكم الشيطان، وحسنها في قلوبكم، فنطقت بها ألسنتكم. واغتررتم بهذا الزعم الباطل، الذي لا حقيقة له، حين تبين لكم نقيض ما كنتم تزعمون، وظهر أنكم الخاسرون لأنفسكم وأهليكم وأموالكم.\n                                    "
      },
      "originalText": "وَلَقَدۡ جِئۡتُمُونَا فُرَٰدَىٰ كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةٖ وَتَرَكۡتُم مَّا خَوَّلۡنَٰكُمۡ وَرَآءَ ظُهُورِكُمۡۖ وَمَا نَرَىٰ مَعَكُمۡ شُفَعَآءَكُمُ ٱلَّذِينَ زَعَمۡتُمۡ أَنَّهُمۡ فِيكُمۡ شُرَكَٰٓؤُاْۚ لَقَد تَّقَطَّعَ بَيۡنَكُمۡ وَضَلَّ عَنكُم مَّا كُنتُمۡ تَزۡعُمُونَ ٤٩"
    }
  ]
}