{
  "number": 140,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 884,
      "text": "۞ إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَىٰ ۖ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَمُخْرِجُ الْمَيِّتِ مِنَ الْحَيِّ ۚ ذَٰلِكُمُ اللَّهُ ۖ فَأَنَّىٰ تُؤْفَكُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 95,
      "juz": 7,
      "manzil": 2,
      "page": 140,
      "ruku": 113,
      "hizbQuarter": 56,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَمُخۡرِجُ ٱلۡمَيِّتِ مِنَ ٱلۡحَيِّۚ ذَٰلِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ ٥٩\n                                    \n                                    \n                                    يخبر تعالى أنه فالق الحب والنوى ، أي : يشقه في الثرى فتنبت الزروع على اختلاف أصنافها من الحبوب ، والثمار على اختلاف أشكالها وألوانها وطعومها من النوى; ولهذا فسر قوله ( فالق الحب والنوى ) بقوله ( يخرج الحي من الميت ) أي : يخرج النبات الحي من الحب والنوى ، الذي هو كالجماد الميت ، كما قال : ( وآية لهم الأرض الميتة أحييناها وأخرجنا منها حبا فمنه يأكلون وجعلنا فيها جنات من نخيل وأعناب وفجرنا فيها من العيون ليأكلوا من ثمره وما عملته أيديهم أفلا يشكرون سبحان الذي خلق الأزواج كلها مما تنبت الأرض ومن أنفسهم ومما لا يعلمون ) [ يس : 33 - 36 ] .\nوقوله : ( ومخرج الميت من الحي ) معطوف على ( فالق الحب والنوى ) ثم فسره ثم عطف عليه قوله : ( ومخرج الميت من الحي ) .\nوقد عبروا عن هذا وهذا بعبارات ، كلها متقاربة مؤدية للمعنى ، فمن قائل : يخرج الدجاجة من البيضة ، والبيضة من الدجاجة ، ومن قائل : يخرج الولد الصالح من الكافر ، والكافر من الصالح ، وغير ذلك من العبارات التي تنتظمها الآية وتشملها .\nثم قال : ( ذلكم الله ) أي : فاعل هذه الأشياء هو الله وحده لا شريك له ( فأنى تؤفكون ) أي : فكيف تصرفون من الحق وتعدلون عنه إلى الباطل فتعبدون مع الله غيره .\n                                    ",
        "qortoby": "۞ إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَمُخۡرِجُ ٱلۡمَيِّتِ مِنَ ٱلۡحَيِّۚ ذَٰلِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ ٥٩\n                                    \n                                    \n                                    قوله تعالى إن الله فالق الحب والنوى يخرج الحي من الميت ومخرج الميت من الحي ذلكم الله فأنى تؤفكون\nقوله تعالى إن الله فالق الحب والنوى عد من عجائب صنعه ما يعجز عن أدنى شيء منه آلهتهم . والفلق : الشق ; أي يشق النواة الميتة فيخرج منها ورقا أخضر ، وكذلك الحبة . ويخرج من الورق الأخضر نواة ميتة وحبة ; وهذا معنى يخرج الحي من الميت ومخرج الميت من الحي عن الحسن وقتادة . وقال ابن عباس والضحاك : معنى فالق : خالق . وقال مجاهد : عني بالفلق الشق الذي في الحب وفي النوى . والنوى جمع نواة . ويجري في كل ما له عجم كالمشمش والخوخ .\nيخرج الحي من الميت ومخرج الميت من الحي يخرج البشر الحي من النطفة الميتة ، والنطفة الميتة من البشر الحي ; عن ابن عباس . وقد تقدم قول قتادة والحسن . وقد مضى ذلك في \" آل عمران \" . وفي صحيح مسلم عن علي : والذي فلق الحبة وبرأ النسمة إنه لعهد النبي الأمي صلى الله عليه وسلم إلي أن لا يحبني إلا مؤمن ولا يبغضني إلا منافق .\nذلكم الله ابتداء وخبر .\nفأنى تؤفكون فمن أين تصرفون عن الحق مع ما ترون من قدرة الله جل وعز .\n                                    ",
        "saadi": "۞ إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَمُخۡرِجُ ٱلۡمَيِّتِ مِنَ ٱلۡحَيِّۚ ذَٰلِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ ٥٩\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن كماله، وعظمة سلطانه، وقوة اقتداره، وسعة رحمته، وعموم كرمه، وشدة عنايته بخلقه، فقال: { إِنَّ اللَّهَ فَالِقُ الْحَبِّ } شامل لسائر الحبوب، التى يباشر الناس زرعها، والتي لا يباشرونها، كالحبوب التي يبثها الله في البراري والقفار، فيفلق الحبوب عن الزروع والنوابت، على اختلاف أنواعها، وأشكالها، ومنافعها، ويفلق النوى عن الأشجار، من النخيل والفواكه، وغير ذلك. فينتفع الخلق، من الآدميين والأنعام، والدواب.ويرتعون فيما فلق الله من الحب والنوى، ويقتاتون، وينتفعون بجميع أنواع المنافع التي جعلها الله في ذلك.ويريهم الله من بره وإحسانه ما يبهر العقول، ويذهل الفحول، ويريهم من بدائع صنعته، وكمال حكمته، ما به يعرفونه ويوحدونه، ويعلمون أنه هو الحق، وأن عبادة ما سواه باطلة. { يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ } كما يخرج من المني حيوانا، ومن البيضة فرخا، ومن الحب والنوى زرعا وشجرا. { وَمُخْرِجُ الْمَيِّتِ } وهو الذي لا نمو فيه، أو لا روح { مِنَ الْحَيِّ } كما يخرج من الأشجار والزروع النوى والحب، ويخرج من الطائر بيضا ونحو ذلك. { ذَلِكُمْ } الذي فعل ما فعل، وانفرد بخلق هذه الأشياء وتدبيرها { اللَّهُ } رَبُّكُمْ أي: الذي له الألوهية والعبادة على خلقه أجمعين، وهو الذي ربى جميع العالمين بنعمه، وغذاهم بكرمه. { فَأَنَّى تُؤْفَكُونَ } أي: فأنى تصرفون، وتصدون عن عبادة من هذا شأنه، إلى عبادة من لا يملك لنفسه نفعا ولا ضرا، ولا موتا، ولا حياة، ولا نشورا؟\"\n                                    "
      },
      "originalText": "۞ إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَمُخۡرِجُ ٱلۡمَيِّتِ مِنَ ٱلۡحَيِّۚ ذَٰلِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ ٥٩"
    },
    {
      "number": 885,
      "text": "فَالِقُ الْإِصْبَاحِ وَجَعَلَ اللَّيْلَ سَكَنًا وَالشَّمْسَ وَالْقَمَرَ حُسْبَانًا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 96,
      "juz": 7,
      "manzil": 2,
      "page": 140,
      "ruku": 113,
      "hizbQuarter": 56,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَالِقُ ٱلۡإِصۡبَاحِ وَجَعَلَ ٱلَّيۡلَ سَكَنٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ حُسۡبَانٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ ٦٩\n                                    \n                                    \n                                    وقوله : ( فالق الإصباح وجاعل الليل سكنا ) أي : خالق الضياء والظلام ، كما قال في أول السورة : ( وجعل الظلمات والنور ) فهو سبحانه يفلق ظلام الليل عن غرة الصباح فيضيء الوجود ، ويستنير الأفق ، ويضمحل الظلام ، ويذهب الليل بدآدئه وظلام رواقه ، ويجيء النهار بضيائه وإشراقه ، كما قال تعالى ( يغشي الليل النهار يطلبه حثيثا ) [ الأعراف : 54 ] ، فبين تعالى قدرته على خلق الأشياء المتضادة المختلفة الدالة على كمال عظمته وعظيم سلطانه ، فذكر أنه فالق الإصباح وقابل ذلك بقوله : ( وجاعل الليل سكنا ) أي : ساجيا مظلما تسكن فيه الأشياء ، كما قال : ( والضحى والليل إذا سجى ) [ الضحى : 1 ، 2 ] ، وقال ( والليل إذا يغشى والنهار إذا تجلى ) [ الليل : 1 ، 2 ] ، وقال ( والنهار إذا جلاها والليل إذا يغشاها ) [ الشمس : 3 ، 4 ] .\nوقال صهيب الرومي رضي الله عنه لامرأته وقد عاتبته في كثرة سهره : إن الله جعل الليل سكنا إلا لصهيب ، إن صهيبا إذا ذكر الجنة طال شوقه ، وإذا ذكر النار طار نومه ، رواه ابن أبي حاتم .\nوقوله : ( والشمس والقمر حسبانا ) أي : يجريان بحساب مقنن مقدر ، لا يتغير ولا يضطرب ، بل كل منهما له منازل يسلكها في الصيف والشتاء ، فيترتب على ذلك اختلاف الليل والنهار طولا وقصرا ، كما قال تعالى ( هو الذي جعل الشمس ضياء والقمر نورا وقدره منازل لتعلموا عدد السنين والحساب ) الآية [ يونس : 5 ] ، وكما قال : ( لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل في فلك يسبحون ) [ يس : 40 ] ، وقال ( والشمس والقمر والنجوم مسخرات بأمره ) [ الأعراف : 54 ] .\nوقوله : ( ذلك تقدير العزيز العليم ) أي : الجميع جار بتقدير العزيز الذي لا يمانع ولا يخالف ، العليم بكل شيء ، فلا يعزب عن علمه مثقال ذرة في الأرض ولا في السماء ، وكثيرا ما إذا ذكر الله تعالى خلق الليل والنهار والشمس والقمر ، يختم الكلام بالعزة والعلم ، كما ذكر في هذه الآية ، وكما في قوله : ( وآية لهم الليل نسلخ منه النهار فإذا هم مظلمون والشمس تجري لمستقر لها ذلك تقدير العزيز العليم ) [ يس : 37 ، 38 ] .\nولما ذكر خلق السماوات والأرض وما فيهن في أول سورة ( حم ) السجدة ، قال : ( وزينا السماء الدنيا بمصابيح وحفظا ذلك تقدير العزيز العليم ) [ فصلت : 12 ] .\n                                    ",
        "qortoby": "فَالِقُ ٱلۡإِصۡبَاحِ وَجَعَلَ ٱلَّيۡلَ سَكَنٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ حُسۡبَانٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ ٦٩\n                                    \n                                    \n                                    قوله تعالى فالق الإصباح وجعل الليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم\nقوله تعالى : فالق الإصباح نعت لاسم الله تعالى ، أي ذلكم الله ربكم فالق الإصباح . وقيل : المعنى أن الله فالق الإصباح . والصبح والصباح أول النهار ، وكذلك الإصباح ; أي فالق الصبح كل يوم ، يريد الفجر . والإصباح مصدر أصبح . والمعنى : شاق الضياء عن الظلام وكاشفه . وقال الضحاك : فالق الإصباح : خالق النهار . وهو معرفة لا يجوز فيه التنوين عند أحد من النحويين . وقرأ الحسن وعيسى بن عمر \" فالق الأصباح \" بفتح الهمزة ، وهو جمع صبح . وروى الأعمش عن إبراهيم النخعي أنه قرأ \" فلق الإصباح \" على فعل ، والهمزة مكسورة والحاء منصوبة . وقرأ الحسن وعيسى بن عمر وحمزة والكسائي وجعل الليل سكنا بغير ألف . ونصب الليل حملا على معنى فالق في الموضعين ; لأنه بمعنى فلق ، لأنه أمر قد كان فحمل على المعنى . وأيضا فإن بعده أفعالا ماضية وهو قوله : جعل لكم النجوم . أنزل من السماء ماء . فحمل أول الكلام على آخره . يقوي ذلك إجماعهم على نصب الشمس والقمر على إضمار فعل ، ولم يحملوه على فاعل فيخفضوه ; قاله مكي رحمه الله . وقال النحاس : وقد قرأ يزيد بن قطيب السكوني \" جاعل الليل سكنا والشمس والقمر حسبانا \" بالخفض عطفا على اللفظ . قلت : فيريد مكي والمهدوي وغيرهما إجماع القراء السبعة . والله أعلم . وقرأ يعقوب في رواية رويس عنه \" وجاعل الليل ساكنا \" . وأهل المدينة \" وجاعل الليل سكنا \" أي محلا للسكون . وفي الموطإ عن يحيى بن سعيد أنه بلغه أن رسول الله صلى الله عليه وسلم كان يدعو فيقول : اللهم فالق الإصباح وجاعل الليل سكنا والشمس والقمر حسبانا اقض عني الدين واغنني من الفقر وأمتعني بسمعي وبصري وقوتي في سبيلك . فإن قيل : كيف قال وأمتعني بسمعي وبصري وفي كتاب النسائي والترمذي وغيرهما واجعله الوارث مني وذلك يفنى مع البدن ؟ قيل له : في الكلام تجوز ، والمعنى اللهم لا تعدمه قبلي . وقد قيل : إن المراد بالسمع والبصر هنا أبو بكر وعمر ; لقوله عليه السلام فيهما : هما السمع والبصر . وهذا تأويل بعيد ، إنما المراد بهما الجارحتان .\nومعنى حسبانا أي بحساب يتعلق به مصالح العباد . وقال ابن عباس في قوله جل وعز : والشمس والقمر حسبانا أي بحساب . قال الأخفش : حسبان جمع حساب ; مثل شهاب وشهبان . وقال يعقوب : حسبان مصدر حسبت الشيء أحسبه حسبانا وحسابا وحسبة ، والحساب الاسم . وقال غيره : جعل الله تعالى سير الشمس والقمر بحساب لا يزيد ولا ينقص ; فدلهم الله عز وجل بذلك على قدرته ووحدانيته . وقيل : حسبانا أي ضياء . والحسبان : النار في لغة ; وقد قال الله تعالى : ويرسل عليها حسبانا من السماء . قال ابن عباس : نارا . والحسبانة : الوسادة الصغيرة .\n                                    ",
        "saadi": "فَالِقُ ٱلۡإِصۡبَاحِ وَجَعَلَ ٱلَّيۡلَ سَكَنٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ حُسۡبَانٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ ٦٩\n                                        \n                                        \n                                        \n                                        ولما ذكر تعالى مادة خلق الأقوات، ذكر منته بتهيئة المساكن، وخلقه كل ما يحتاج إليه العباد، من الضياء والظلمة، وما يترتب على ذلك من أنواع المنافع والمصالح فقال: { فَالِقُ الْإِصْبَاحِ } أي: كما أنه فالق الحب والنوى، كذلك هو فالق ظلمة الليل الداجي، الشامل لما على وجه الأرض، بضياء الصبح الذي يفلقه شيئا فشيئا، حتى تذهب ظلمة الليل كلها، ويخلفها الضياء والنور العام، الذي يتصرف به الخلق في مصالحهم، ومعايشهم، ومنافع دينهم ودنياهم. ولما كان الخلق محتاجين إلى السكون والاستقرار والراحة، التي لا تتم بوجود النهار والنور { جَعَلَ } الله { اللَّيْلَ سَكَنًا } يسكن فيه الآدميون إلى دورهم ومنامهم، والأنعام إلى مأواها، والطيور إلى أوكارها، فتأخذ نصيبها من الراحة، ثم يزيل الله ذلك بالضياء، وهكذا أبدا إلى يوم القيامة { و } جعل تعالى { الشمس وَالْقَمَرَ حُسْبَانًا } بهما تعرف الأزمنة والأوقات، فتنضبط بذلك أوقات العبادات، وآجال المعاملات، ويعرف بها مدة ما مضى من الأوقات التي لولا وجود الشمس والقمر، وتناوبهما واختلافهما - لما عرف ذلك عامة الناس، واشتركوا في علمه، بل كان لا يعرفه إلا أفراد من الناس، بعد الاجتهاد، وبذلك يفوت من المصالح الضرورية ما يفوت. { ذَلِكَ } التقدير المذكور { تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ } الذي من عزته انقادت له هذه المخلوقات العظيمة، فجرت مذللة مسخرة بأمره، بحيث لا تتعدى ما حده الله لها، ولا تتقدم عنه ولا تتأخر { الْعَلِيمُ } الذي أحاط علمه، بالظواهر والبواطن، والأوائل والأواخر. ومن الأدلة العقلية على إحاطة علمه، تسخير هذه المخلوقات العظيمة، على تقدير، ونظام بديع، تحيُّرُ العقول في حسنه وكماله، وموافقته للمصالح والحكم.\n                                    "
      },
      "originalText": "فَالِقُ ٱلۡإِصۡبَاحِ وَجَعَلَ ٱلَّيۡلَ سَكَنٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ حُسۡبَانٗاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ ٦٩"
    },
    {
      "number": 886,
      "text": "وَهُوَ الَّذِي جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ ۗ قَدْ فَصَّلْنَا الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 97,
      "juz": 7,
      "manzil": 2,
      "page": 140,
      "ruku": 113,
      "hizbQuarter": 56,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلنُّجُومَ لِتَهۡتَدُواْ بِهَا فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ ٧٩\n                                    \n                                    \n                                    وقوله : ( وهو الذي جعل لكم النجوم لتهتدوا بها في ظلمات البر والبحر ) قال بعض السلف : من اعتقد في هذه النجوم غير ثلاث فقد أخطأ وكذب على الله : أن الله جعلها زينة للسماء ، ورجوما للشياطين ، ويهتدى بها في ظلمات البر والبحر .\nوقوله : ( قد فصلنا الآيات ) أي : قد بيناها ووضحناها ( لقوم يعلمون ) أي : يعقلون ويعرفون الحق ويجتنبون الباطل .\n                                    ",
        "qortoby": "وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلنُّجُومَ لِتَهۡتَدُواْ بِهَا فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ ٧٩\n                                    \n                                    \n                                    قوله تعالى وهو الذي جعل لكم النجوم لتهتدوا بها في ظلمات البر والبحر قد فصلنا الآيات لقوم يعلمون قوله تعالى وهو الذي جعل لكم النجوم بين كمال قدرته ، وفي النجوم منافع جمة . ذكر في هذه الآية بعض منافعها ، وهي التي ندب الشرع إلى معرفتها ; وفي التنزيل : وحفظا من كل شيطان مارد . وجعلناها رجوما للشياطين . وجعل هنا بمعنى خلق .\nقد فصلنا الآيات أي بيناها مفصلة لتكون أبلغ في الاعتبار .\nلقوم يعلمون خصهم لأنهم المنتفعون بها .\n                                    ",
        "saadi": "وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلنُّجُومَ لِتَهۡتَدُواْ بِهَا فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ ٧٩\n                                        \n                                        \n                                        \n                                        { وَهُوَ الَّذِي جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِهَا فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ } حين تشتبه عليكم المسالك، ويتحير في سيره السالك، فجعل الله النجوم هداية للخلق إلى السبل، التي يحتاجون إلى سلوكها لمصالحهم، وتجاراتهم، وأسفارهم. منها: نجوم لا تزال ترى، ولا تسير عن محلها، ومنها: ما هو مستمر السير، يعرف سيرَه أهل المعرفة بذلك، ويعرفون به الجهات والأوقات. ودلت هذه الآية ونحوها، على مشروعية تعلم سير الكواكب ومحالّها الذي يسمى علم التسيير، فإنه لا تتم الهداية ولا تمكن إلا بذلك. { قَدْ فَصَّلْنَا الْآيَاتِ } أي بيناها، ووضحناها، وميزنا كل جنس ونوع منها عن الآخر، بحيث صارت آيات الله بادية ظاهرة { لِقَوْمٍ يَعْلَمُونَ } أي: لأهل العلم والمعرفة، فإنهم الذين يوجه إليهم الخطاب، ويطلب منهم الجواب، بخلاف أهل الجهل والجفاء، المعرضين عن آيات الله، وعن العلم الذي جاءت به الرسل، فإن البيان لا يفيدهم شيئا، والتفصيل لا يزيل عنهم ملتبسا، والإيضاح لا يكشف لهم مشكلا.\n                                    "
      },
      "originalText": "وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلنُّجُومَ لِتَهۡتَدُواْ بِهَا فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ ٧٩"
    },
    {
      "number": 887,
      "text": "وَهُوَ الَّذِي أَنْشَأَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ فَمُسْتَقَرٌّ وَمُسْتَوْدَعٌ ۗ قَدْ فَصَّلْنَا الْآيَاتِ لِقَوْمٍ يَفْقَهُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 98,
      "juz": 7,
      "manzil": 2,
      "page": 140,
      "ruku": 113,
      "hizbQuarter": 56,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَهُوَ ٱلَّذِيٓ أَنشَأَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ فَمُسۡتَقَرّٞ وَمُسۡتَوۡدَعٞۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَفۡقَهُونَ ٨٩\n                                    \n                                    \n                                    قول تعالى : ( وهو الذي أنشأكم من نفس واحدة ) يعني : آدم عليه السلام ، كما قال : ( يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء ) [ النساء : 1 ] .\nوقوله : ( فمستقر ) اختلفوا في معنى ذلك ، فعن ابن مسعود ، وابن عباس ، وأبي عبد الرحمن السلمي ، وقيس بن أبي حازم ومجاهد ، وعطاء ، وإبراهيم النخعي ، والضحاك وقتادة والسدي ، وعطاء الخراساني : ( فمستقر ) أي : في الأرحام قالوا - أو : أكثرهم - : ( ومستودع ) أي : في الأصلاب .\nوعن ابن مسعود وطائفة عكس ذلك . وعن ابن مسعود أيضا وطائفة : فمستقر في الدنيا ، ومستودع حيث يموت . وقال سعيد بن جبير : ( فمستقر ) في الأرحام وعلى ظهر الأرض ، وحيث يموت . وقال الحسن البصري : المستقر الذي قد مات فاستقر به عمله . وعن ابن مسعود : ومستودع في الدار الآخرة .\nوالقول الأول هو الأظهر ، والله أعلم .\nوقوله : ( قد فصلنا الآيات لقوم يفقهون ) أي : يفهمون ويعون كلام الله ومعناه .\n                                    ",
        "qortoby": "وَهُوَ ٱلَّذِيٓ أَنشَأَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ فَمُسۡتَقَرّٞ وَمُسۡتَوۡدَعٞۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَفۡقَهُونَ ٨٩\n                                    \n                                    \n                                    قوله تعالى وهو الذي أنشأكم من نفس واحدة فمستقر ومستودع قد فصلنا الآيات لقوم يفقهون قوله تعالى وهو الذي أنشأكم من نفس واحدة يريد آدم عليه السلام . وقد تقدم في أول السورة .\nفمستقر قرأ ابن عباس وسعيد بن جبير والحسن وأبو عمرو وعيسى والأعرج وشيبة والنخعي بكسر القاف ، والباقون بفتحها . وهي في موضع رفع بالابتداء ، إلا أن التقدير في من كسر القاف فمنها \" مستقر \" والفتح بمعنى لها مستقر . قال عبد الله بن مسعود : فلها مستقر في الرحم ومستودع في الأرض التي تموت فيها ; وهذا التفسير يدل على الفتح . وقال الحسن : فمستقر في القبر . وأكثر أهل التفسير يقولون : المستقر ما كان في الرحم ، والمستودع ما كان في الصلب ; رواه سعيد بن جبير عن ابن عباس ، وقاله النخعي . وعن ابن عباس أيضا : مستقر في الأرض ، ومستودع في الأصلاب . قال سعيد بن جبير : قال لي ابن عباس هل تزوجت ؟ قلت : لا ; فقال : إن الله عز وجل يستخرج من ظهرك ما استودعه فيه . وروي عن ابن عباس أيضا أن المستقر من خلق ، والمستودع من لم يخلق ; ذكره الماوردي . وعن ابن عباس أيضا : ومستودع عند الله .\nقلت : وفي التنزيل ولكم في الأرض مستقر ومتاع إلى حين والاستيداع إشارة إلى كونهم في القبر إلى أن يبعثوا للحساب . وقد تقدم في البقرة .\nقد فصلنا الآيات لقوم يفقهون قال قتادة : فصلنا بينا وقررنا . والله أعلم .\n                                    ",
        "saadi": "وَهُوَ ٱلَّذِيٓ أَنشَأَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ فَمُسۡتَقَرّٞ وَمُسۡتَوۡدَعٞۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَفۡقَهُونَ ٨٩\n                                        \n                                        \n                                        \n                                        { وَهُوَ الَّذِي أَنْشَأَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ } وهو آدم عليه السلام. أنشأ الله منه هذا العنصر الآدمي؛ الذي قد ملأ الأرض ولم يزل في زيادة ونمو، الذي قد تفاوت في أخلاقه وخلقه، وأوصافه تفاوتا لا يمكن ضبطه، ولا يدرك وصفه، وجعل الله لهم مستقرا، أي منتهى ينتهون إليه، وغاية يساقون إليها، وهي دار القرار، التي لا مستقر وراءها، ولا نهاية فوقها، فهذه الدار، هي التي خلق الخلق لسكناها، وأوجدوا في الدنيا ليسعوا في أسبابها، التي تنشأ عليها وتعمر بها، وأودعهم الله في أصلاب آبائهم وأرحام أمهاتهم، ثم في دار الدنيا، ثم في البرزخ، كل ذلك، على وجه الوديعة، التي لا تستقر ولا تثبت، بل ينتقل منها حتى يوصل إلى الدار التي هي المستقر، وأما هذه الدار، فإنها مستودع وممر { قَدْ فَصَّلْنَا الْآيَاتِ لِقَوْمٍ يَفْقَهُونَ } عن الله آياته، ويفهمون عنه حججه، وبيناته.\n                                    "
      },
      "originalText": "وَهُوَ ٱلَّذِيٓ أَنشَأَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ فَمُسۡتَقَرّٞ وَمُسۡتَوۡدَعٞۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَفۡقَهُونَ ٨٩"
    },
    {
      "number": 888,
      "text": "وَهُوَ الَّذِي أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ نَبَاتَ كُلِّ شَيْءٍ فَأَخْرَجْنَا مِنْهُ خَضِرًا نُخْرِجُ مِنْهُ حَبًّا مُتَرَاكِبًا وَمِنَ النَّخْلِ مِنْ طَلْعِهَا قِنْوَانٌ دَانِيَةٌ وَجَنَّاتٍ مِنْ أَعْنَابٍ وَالزَّيْتُونَ وَالرُّمَّانَ مُشْتَبِهًا وَغَيْرَ مُتَشَابِهٍ ۗ انْظُرُوا إِلَىٰ ثَمَرِهِ إِذَا أَثْمَرَ وَيَنْعِهِ ۚ إِنَّ فِي ذَٰلِكُمْ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 99,
      "juz": 7,
      "manzil": 2,
      "page": 140,
      "ruku": 113,
      "hizbQuarter": 56,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَهُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦ نَبَاتَ كُلِّ شَيۡءٖ فَأَخۡرَجۡنَا مِنۡهُ خَضِرٗا نُّخۡرِجُ مِنۡهُ حَبّٗا مُّتَرَاكِبٗا وَمِنَ ٱلنَّخۡلِ مِن طَلۡعِهَا قِنۡوَانٞ دَانِيَةٞ وَجَنَّٰتٖ مِّنۡ أَعۡنَابٖ وَٱلزَّيۡتُونَ وَٱلرُّمَّانَ مُشۡتَبِهٗا وَغَيۡرَ مُتَشَٰبِهٍۗ ٱنظُرُوٓاْ إِلَىٰ ثَمَرِهِۦٓ إِذَآ أَثۡمَرَ وَيَنۡعِهِۦٓۚ إِنَّ فِي ذَٰلِكُمۡ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ ٩٩\n                                    \n                                    \n                                    وقوله : ( وهو الذي أنزل من السماء ماء ) أي بقدر مباركا ، رزقا للعباد وغياثا للخلائق ، رحمة من الله لخلقه ( فأخرجنا به نبات كل شيء ) كما قال ( وجعلنا من الماء كل شيء حي ) [ الأنبياء : 30 ] ( فأخرجنا منه خضرا ) أي : زرعا وشجرا أخضر ، ثم بعد ذلك يخلق فيه الحب والثمر; ولهذا قال : ( نخرج منه حبا متراكبا ) أي : يركب بعضه بعضا ، كالسنابل ونحوها ( ومن النخل من طلعها قنوان ) أي : جمع قنو وهي عذوق الرطب ) دانية ) أي : قريبة من المتناول ، كما قال علي بن أبي طلحة الوالبي ، عن ابن عباس : ( قنوان دانية ) يعني بالقنوان الدانية : قصار النخل اللاصقة عذوقها بالأرض . رواه ابن جرير .\nقال ابن جرير : وأهل الحجاز يقولون : قنوان ، وقيس يقولون : قنوان ، وقال امرؤ القيس :\nفأثت أعاليه وآدت أصوله ومال بقنوان من البسر أحمرا\nقال : وتميم يقولون قنيان بالياء - قال : وهي جمع قنو ، كما أن ( صنوان ) جمع صنو .\nوقوله : ( وجنات من أعناب ) أي : ونخرج منه جنات من أعناب ، وهذان النوعان هما أشرف عند أهل الحجاز ، وربما كانا خيار الثمار في الدنيا ، كما امتن تعالى بهما على عباده ، في قوله : ( ومن ثمرات النخيل والأعناب تتخذون منه سكرا ورزقا حسنا ) [ النحل : 67 ] ، وكان ذلك قبل تحريم الخمر .\nوقال : ( وجعلنا فيها جنات من نخيل وأعناب ) [ يس : 34 ] .\nوقوله : ( والزيتون والرمان مشتبها وغير متشابه ) قال قتادة وغيره : يتشابه في الورق ، قريب الشكل بعضه من بعض ، ويتخالف في الثمار شكلا وطعما وطبعا .\nوقوله : ( انظروا إلى ثمره إذا أثمر وينعه ) أي : نضجه ، قاله البراء بن عازب ، وابن عباس ، والضحاك ، وعطاء الخراساني ، والسدي ، وقتادة ، وغيرهم . أي : فكروا في قدرة خالقه من العدم إلى الوجود ، بعد أن كان حطبا صار عنبا ورطبا وغير ذلك ، مما خلق تعالى من الألوان والأشكال والطعوم والروائح ، كما قال تعالى : ( وفي الأرض قطع متجاورات وجنات من أعناب وزرع ونخيل صنوان وغير صنوان يسقى بماء واحد ونفضل بعضها على بعض في الأكل إن في ذلك لآيات لقوم يعقلون ) [ الرعد : 4 ] ولهذا قال هاهنا ( إن في ذلكم لآيات ) أي : دلالات على كمال قدرة خالق هذه الأشياء وحكمته ورحمته ( لقوم يؤمنون ) أي : يصدقون به ، ويتبعون رسله .\n                                    ",
        "qortoby": "وَهُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦ نَبَاتَ كُلِّ شَيۡءٖ فَأَخۡرَجۡنَا مِنۡهُ خَضِرٗا نُّخۡرِجُ مِنۡهُ حَبّٗا مُّتَرَاكِبٗا وَمِنَ ٱلنَّخۡلِ مِن طَلۡعِهَا قِنۡوَانٞ دَانِيَةٞ وَجَنَّٰتٖ مِّنۡ أَعۡنَابٖ وَٱلزَّيۡتُونَ وَٱلرُّمَّانَ مُشۡتَبِهٗا وَغَيۡرَ مُتَشَٰبِهٍۗ ٱنظُرُوٓاْ إِلَىٰ ثَمَرِهِۦٓ إِذَآ أَثۡمَرَ وَيَنۡعِهِۦٓۚ إِنَّ فِي ذَٰلِكُمۡ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ ٩٩\n                                    \n                                    \n                                    وهو الذي أنزل من السماء ماء فأخرجنا به نبات كل شيء فأخرجنا منه خضرا نخرج منه حبا متراكبا ومن النخل من طلعها قنوان دانية وجنات من أعناب والزيتون والرمان مشتبها وغير متشابه انظروا إلى ثمره إذا أثمر وينعه إن في ذلكم لآيات لقوم يؤمنون\nفيه سبع مسائل :\nالأولى قوله تعالى وهو الذي أنزل من السماء ماء أي المطر .\nفأخرجنا به نبات كل شيء أي كل صنف من النبات . وقيل : رزق كل حيوان .\nفأخرجنا منه خضرا قال الأخفش : أي أخضر ; كما تقول العرب : أرنيها نمرة أركها مطرة . والخضر رطب البقول . وقال ابن عباس : يريد القمح والشعير والسلت والذرة والأرز وسائر الحبوب .\nنخرج منه حبا متراكبا أي يركب بعضه على بعض كالسنبلة .\nالثانية قوله تعالى ومن النخل من طلعها قنوان دانية ابتداء وخبر . وأجاز الفراء في غير القرآن \" قنوانا دانية \" على العطف على ما قبله . قال سيبويه : ومن العرب من يقول : قنوان . قال الفراء : هذه لغة قيس ، وأهل الحجاز يقولون : قنوان ، وتميم يقولون : قنيان ; ثم يجتمعون في الواحد فيقولون : قنو وقنو . والطلع : الكفرى قبل أن ينشق عن الإغريض . والإغريض يسمى طلعا أيضا . والطلع ما يرى من عذق النخلة . والقنوان : جمع قنو ، وتثنيته قنوان كصنو وصنوان \" بكسر النون \" . وجاء الجمع على لفظ الاثنين . قال الجوهري وغيره : الاثنان صنوان والجمع صنوان \" برفع النون \" . والقنو : العذق والجمع القنوان والأقناء ; قال :\nطويلة الأقناء والأثاكل\nغيره : \" أقناء \" جمع القلة . قال المهدوي : قرأ ابن هرمز \" قنوان \" بفتح القاف ، وروي عنه ضمها . فعلى الفتح هو اسم للجمع غير مكسر ، بمنزلة ركب عند سيبويه ، وبمنزلة الباقر والجامل ; لأن فعلان ليس من أمثلة الجمع ، وضم القاف على أنه جمع قنو وهو العذق \" بكسر العين \" وهي الكباسة ، وهي عنقود النخلة . والعذق \" بفتح العين \" النخلة نفسها . وقيل : القنوان الجمار .\nدانية : قريبة ، ينالها القائم والقاعد . عن ابن عباس والبراء بن عازب وغيرهما . وقال الزجاج : منها دانية ومنها بعيدة ; فحذف ; ومثله : سرابيل تقيكم الحر . وخص الدانية بالذكر ، لأن من الغرض في الآية ذكر القدرة والامتنان بالنعمة ، والامتنان فيما يقرب متناوله أكثر .\nالثالثة : قوله تعالى : وجنات من أعناب أي وأخرجنا جنات . وقرأ محمد بن عبد الرحمن بن أبي ليلى والأعمش ، وهو الصحيح من قراءة عاصم \" وجنات \" بالرفع . وأنكر هذه القراءة أبو عبيد وأبو حاتم ، حتى قال أبو حاتم : هي محال ; لأن الجنات لا تكون من النخل . قال النحاس : والقراءة جائزة ، وليس التأويل على هذا ، ولكنه رفع بالابتداء والخبر محذوف ; أي ولهم جنات . كما قرأ جماعة من القراء \" وحور عين \" . وأجاز مثل هذا سيبويه والكسائي والفراء ; ومثله كثير . وعلى هذا أيضا \" وحورا عينا \" حكاه سيبويه ، وأنشد :\nجئني بمثل بني بدر لقومهم أو مثل أسرة منظور بن سيار\nوقيل : التقدير وجنات من أعناب أخرجناها ; كقولك : أكرمت عبد الله وأخوه ، أي وأخوه أكرمت أيضا . فأما الزيتون والرمان فليس فيه إلا النصب للإجماع على ذلك . وقيل : \" وجنات \" بالرفع عطف على قنوان لفظا ، وإن لم تكن في المعنى من جنسها .\nوالزيتون والرمان مشتبها وغير متشابه أي متشابها في الأوراق ; أي ورق الزيتون يشبه ورق الرمان في اشتماله على جميع الغصن وفي حجم الورق ، وغير متشابه في الذواق ; عن قتادة وغيره . قال ابن جريج : متشابها في النظر وغير متشابه في الطعم ; مثل الرمانتين لونهما واحد وطعمهما مختلف . وخص الرمان والزيتون بالذكر لقربهما منهم ومكانهما عندهم . وهو كقوله : أفلا ينظرون إلى الإبل كيف خلقت . ردهم إلى الإبل لأنها أغلب ما يعرفونه .\nالرابعة : قوله تعالى انظروا إلى ثمره إذا أثمر أي نظر الاعتبار لا نظر الإبصار المجرد عن التفكر . والثمر في اللغة جنى الشجر . وقرأ حمزة والكسائي \" ثمره \" بضم الثاء والميم . والباقون بالفتح فيهما جمع ثمرة ، مثل بقرة وبقر وشجرة وشجر . قال مجاهد الثمر أصناف المال ، والثمر ثمر النخل . وكأن المعنى على قول مجاهد : انظروا إلى الأموال التي يتحصل منه الثمر ; فالثمر بضمتين جمع ثمار وهو المال المثمر . وروي عن الأعمش \" ثمره \" بضم الثاء وسكون الميم ; حذفت الضمة لثقلها طلبا للخفة . ويجوز أن يكون ثمر جمع ثمرة مثل بدنة وبدن . ويجوز أن يكون ثمر جمع جمع ، فتقول : ثمرة وثمار وثمر مثل حمار وحمر . ويجوز أن يكون جمع ثمرة كخشبة وخشب لا جمع الجمع .\nالخامسة : قوله تعالى وينعه قرأ محمد بن السميقع \" ويانعه \" . وابن محيصن وابن أبي إسحاق \" وينعه \" بضم الياء . قال الفراء : هي لغة بعض أهل نجد ; يقال : ينع الثمر يينع ، والثمر يانع . وأينع يونع والثمر مونع . والمعنى : ونضجه . ينع وأينع إذا نضج وأدرك . قال الحجاج في خطبته : أرى رءوسا قد أينعت وحان قطافها . قال ابن الأنباري : الينع جمع يانع ، كراكب وركب ، وتاجر وتجر ، وهو المدرك البالغ . وقال الفراء : أينع أكثر من ينع ، ومعناه أحمر ; ومنه ما روي في حديث الملاعنة إن ولدته أحمر مثل الينعة وهي خرزة حمراء ، يقال : إنه العقيق أو نوع منه . فدلت الآية لمن تدبر ونظر ببصره وقلبه ، نظر من تفكر ، أن المتغيرات لا بد لها من مغير ; وذلك أنه تعالى قال : انظروا إلى ثمره إذا أثمر وينعه . فتراه أولا طلعا ثم إغريضا إذا انشق عنه الطلع . والإغريض يسمى ضحكا أيضا ، ثم بلحا ، ثم سيابا ، ثم جدالا إذ اخضر واستدار قبل أن يشتد ، ثم بسرا إذا عظم ، ثم زهوا إذا احمر ; يقال : أزهى يزهي ، ثم موكتا إذا بدت فيه نقط من الإرطاب . فإن كان ذلك من قبل الذنب فهي مذنبة ، وهو التذنوب ، فإذا لانت فهي ثعدة ، فإذا بلغ الإرطاب نصفها فهي مجزعة ، فإذا بلغ ثلثيها فهي حلقانة ، فإذا عمها الإرطاب فهي منسبتة ; يقال : رطب منسبت ، ثم ييبس فيصير تمرا . فنبه الله تعالى بانتقالها من حال إلى حال وتغيرها ووجودها بعد أن لم تكن بعد على وحدانيته وكمال قدرته ، وأن لها صانعا قادرا عالما . ودل على جواز البعث ; لإيجاد النبات بعد الجفاف . قال الجوهري : ينع الثمر يينع ويينع ينعا وينوعا ، أي نضج .\nالسادسة : قال ابن العربي قال مالك : الإيناع الطيب بغير فساد ولا نقش . قال مالك : والنقش أن ينقش أهل البصيرة الثمر حتى يرطب ; يريد يثقب فيه بحيث يسرع دخول الهواء إليه فيرطب معجلا . فليس ذلك الينع المراد في القرآن ، ولا هو الذي ربط به رسول الله صلى الله عليه وسلم البيع ، وإنما هو ما يكون من ذاته بغير محاولة . وفي بعض بلاد التين ، وهي البلاد الباردة ، لا ينضج حتى يدخل في فمه عود قد دهن زيتا ، فإذا طاب حل بيعه ; لأن ذلك ضرورة الهواء وعادة البلاد ، ولولا ذلك ما طاب في وقت الطيب . قلت : وهذا الينع الذي يقف عليه جواز بيع التمر وبه يطيب أكلها ويأمن من العاهة ، هو عند طلوع الثريا بما أجرى الله سبحانه من العادة وأحكمه من العلم والقدرة . ذكر المعلى بن أسد عن وهيب عن عسل بن سفيان عن عطاء عن أبي هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم إذا طلعت الثريا صباحا رفعت العاهة عن أهل البلد . والثريا النجم ، لا خلاف في ذلك . وطلوعها صباحا لاثنتي عشرة ليلة تمضي من شهر أيار ، وهو شهر مايو . وفي البخاري : وأخبرني خارجة بن زيد بن ثابت أن زيد بن ثابت لم يكن يبيع ثمار أرضه حتى تطلع الثريا فيتبين الأصفر من الأحمر .\nالسابعة : وقد استدل من أسقط الجوائح في الثمار بهذه الآثار ، وما كان مثلها من نهيه عليه السلام عن بيع الثمرة حتى يبدو صلاحها ، وعن بيع الثمار حتى تذهب العاهة . قال عثمان بن سراقة : فسألت ابن عمر متى هذا ؟ فقال : طلوع الثريا . قال الشافعي : لم يثبت عندي أن رسول الله صلى الله عليه وسلم أمر بوضع الجوائح ، ولو ثبت عندي لم أعده ، والأصل المجتمع عليه أن كل من ابتاع ما يجوز بيعه وقبضه كانت المصيبة منه ، قال : ولو كنت قائلا بوضع الجوائح لوضعتها في القليل والكثير . وهو قول الثوري والكوفيين . وذهب مالك وأكثر أهل المدينة إلى وضعها ; لحديث جابر أن رسول الله صلى الله عليه وسلم أمر بوضع الجوائح . أخرجه مسلم . وبه كان يقضي عمر بن عبد العزيز ، وهو قول أحمد بن حنبل وسائر أصحاب الحديث . وأهل الظاهر وضعوها عن المبتاع في القليل والكثير على عموم الحديث ; إلا أن مالكا وأصحابه اعتبروا أن تبلغ الجائحة ثلث الثمرة فصاعدا ، وما كان دون الثلث ألغوه وجعلوه تبعا ، إذ لا تخلو ثمرة من أن يتعذر القليل من طيبها وأن يلحقها في اليسير منها فساد . وكان أصبغ وأشهب لا ينظران إلى الثمرة ولكن إلى القيمة ، فإذا كانت القيمة الثلث فصاعدا وضع عنه . والجائحة ما لا يمكن دفعه عند ابن القاسم . وعليه فلا تكون السرقة جائحة ، وكذا في كتاب محمد . وفي الكتاب أنه جائحة ، وروي عن ابن القاسم ، وخالفه أصحابه والناس . وقال مطرف وابن الماجشون : ما أصاب الثمرة من السماء من عفن أو برد ، أو عطش أو حر أو كسر الشجر بما ليس بصنع آدمي فهو جائحة . واختلف في العطش ; ففي رواية ابن القاسم هو جائحة . والصحيح في البقول أنها فيها جائحة كالثمرة . ومن باع ثمرا قبل بدو صلاحه بشرط التبقية فسخ بيعه ورد ; للنهي عنه ; ولأنه من أكل المال بالباطل ; لقوله عليه السلام : أرأيت إن منع الله الثمرة فبم يأخذ أحدكم مال أخيه بغير حق ؟ هذا قول الجمهور ، وصححه أبو حنيفة وأصحابه وحملوا النهي على الكراهة . وذهب الجمهور إلى جواز بيعها قبل بدو الصلاح بشرط القطع . ومنعه الثوري وابن أبي ليلى تمسكا بالنهي الوارد في ذلك . وخصصه الجمهور بالقياس الجلي ; لأنه مبيع معلوم يصح قبضه حالة العقد فصح بيعه كسائر المبيعات .\n                                    ",
        "saadi": "وَهُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦ نَبَاتَ كُلِّ شَيۡءٖ فَأَخۡرَجۡنَا مِنۡهُ خَضِرٗا نُّخۡرِجُ مِنۡهُ حَبّٗا مُّتَرَاكِبٗا وَمِنَ ٱلنَّخۡلِ مِن طَلۡعِهَا قِنۡوَانٞ دَانِيَةٞ وَجَنَّٰتٖ مِّنۡ أَعۡنَابٖ وَٱلزَّيۡتُونَ وَٱلرُّمَّانَ مُشۡتَبِهٗا وَغَيۡرَ مُتَشَٰبِهٍۗ ٱنظُرُوٓاْ إِلَىٰ ثَمَرِهِۦٓ إِذَآ أَثۡمَرَ وَيَنۡعِهِۦٓۚ إِنَّ فِي ذَٰلِكُمۡ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ ٩٩\n                                        \n                                        \n                                        \n                                        وهذا من أعظم مننه العظيمة، التي يضطر إليها الخلق، من الآدميين وغيرهم، وهو أنه أنزل من السماء ماء متتابعا وقت حاجة الناس إليه، فأنبت الله به كل شيء، مما يأكل الناس والأنعام، فرتع الخلق بفضل الله، وانبسطوا برزقه، وفرحوا بإحسانه، وزال عنهم الجدب واليأس والقحط، ففرحت القلوب، وأسفرت الوجوه، وحصل للعباد من رحمة الرحمن الرحيم، ما به يتمتعون وبه يرتعون، مما يوجب لهم، أن يبذلوا جهدهم في شكر من أسدى النعم، وعبادته والإنابة إليه، والمحبة له. ولما ذكر عموم ما ينبت بالماء، من أنواع الأشجار والنبات، ذكر الزرع والنخل، لكثرة نفعهما وكونهما قوتا لأكثر الناس فقال: { فَأَخْرَجْنَا مِنْهُ خَضِرًا نُخْرِجُ مِنْهُ } أي: من ذلك النبات الخضر، { حَبًّا مُتَرَاكِبًا } بعضه فوق بعض، من بر، وشعير، وذرة، وأرز، وغير ذلك، من أصناف الزروع، وفي وصفه بأنه متراكب، إشارة إلى أن حبوبه متعددة، وجميعها تستمد من مادة واحدة، وهي لا تختلط، بل هي متفرقة الحبوب، مجتمعة الأصول، وإشارة أيضا إلى كثرتها، وشمول ريعها وغلتها، ليبقى أصل البذر، ويبقى بقية كثيرة للأكل والادخار. { وَمِنَ النَّخْلِ } أخرج الله { مِنْ طَلْعِهَا } وهو الكفرى، والوعاء قبل ظهور القنو منه، فيخرج من ذلك الوعاء { قِنْوَانٌ دَانِيَةٌ } أي: قريبة سهلة التناول، متدلية على من أرادها، بحيث لا يعسر التناول من النخل وإن طالت، فإنه يوجد فيها كرب ومراقي، يسهل صعودها. { و } أخرج تعالى بالماء { جنات مِنْ أَعْنَابٍ وَالزَّيْتُونَ وَالرُّمَّانَ } فهذه من الأشجار الكثيرة النفع، العظيمة الوقع، فلذلك خصصها الله بالذكر بعد أن عم جميع الأشجار والنوابت. وقوله { مُشْتَبِهًا وَغَيْرَ مُتَشَابِهٍ } يحتمل أن يرجع إلى الرمان والزيتون، أي: مشتبها في شجره وورقه، غير متشابه في ثمره. ويحتمل أن يرجع ذلك، إلى سائر الأشجار والفواكه، وأن بعضها مشتبه، يشبه بعضه بعضا، ويتقارب في بعض أوصافه، وبعضها لا مشابهة بينه وبين غيره، والكل ينتفع به العباد، ويتفكهون، ويقتاتون، ويعتبرون، ولهذا أمر تعالى بالاعتبار به، فقال: { انْظُرُوا } نظر فكر واعتبار { إِلَى ثَمَرِهِ } أي: الأشجار كلها، خصوصا: النخل { إذا أثمر } { وَيَنْعِهِ } أي: انظروا إليه، وقت إطلاعه، ووقت نضجه وإيناعه، فإن في ذلك عبرا وآيات، يستدل بها على رحمة الله، وسعة إحسانه وجوده، وكمال اقتداره وعنايته بعباده. ولكن ليس كل أحد يعتبر ويتفكر وليس كل من تفكر، أدرك المعنى المقصود، ولهذا قيد تعالى الانتفاع بالآيات بالمؤمنين فقال: { إِنَّ فِي ذَلِكَم لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ } فإن المؤمنين يحملهم ما معهم من الإيمان، على العمل بمقتضياته ولوازمه، التي منها التفكر في آيات الله، والاستنتاج منها ما يراد منها، وما تدل عليه، عقلا، وفطرة، وشرعا.\n                                    "
      },
      "originalText": "وَهُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦ نَبَاتَ كُلِّ شَيۡءٖ فَأَخۡرَجۡنَا مِنۡهُ خَضِرٗا نُّخۡرِجُ مِنۡهُ حَبّٗا مُّتَرَاكِبٗا وَمِنَ ٱلنَّخۡلِ مِن طَلۡعِهَا قِنۡوَانٞ دَانِيَةٞ وَجَنَّٰتٖ مِّنۡ أَعۡنَابٖ وَٱلزَّيۡتُونَ وَٱلرُّمَّانَ مُشۡتَبِهٗا وَغَيۡرَ مُتَشَٰبِهٍۗ ٱنظُرُوٓاْ إِلَىٰ ثَمَرِهِۦٓ إِذَآ أَثۡمَرَ وَيَنۡعِهِۦٓۚ إِنَّ فِي ذَٰلِكُمۡ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ ٩٩"
    },
    {
      "number": 889,
      "text": "وَجَعَلُوا لِلَّهِ شُرَكَاءَ الْجِنَّ وَخَلَقَهُمْ ۖ وَخَرَقُوا لَهُ بَنِينَ وَبَنَاتٍ بِغَيْرِ عِلْمٍ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يَصِفُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 100,
      "juz": 7,
      "manzil": 2,
      "page": 140,
      "ruku": 113,
      "hizbQuarter": 56,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَجَعَلُواْ لِلَّهِ شُرَكَآءَ ٱلۡجِنَّ وَخَلَقَهُمۡۖ وَخَرَقُواْ لَهُۥ بَنِينَ وَبَنَٰتِۢ بِغَيۡرِ عِلۡمٖۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَصِفُونَ ٠٠١\n                                    \n                                    \n                                    ( وجعلوا لله شركاء الجن وخلقهم وخرقوا له بنين وبنات بغير علم سبحانه وتعالى عما يصفون ( 100 ) ) .\nهذا رد على المشركين الذين عبدوا مع الله غيره ، وأشركوا في عبادة الله أن عبدوا الجن ، فجعلوهم شركاء الله في العبادة ، تعالى الله عن شركهم وكفرهم .\nفإن قيل : فكيف عبدت الجن وإنما كانوا يعبدون الأصنام؟ فالجواب : أنهم إنما عبدوا الأصنام عن طاعة الجن وأمرهم إياهم بذلك ، كما قال تعالى : ( إن يدعون من دونه إلا إناثا وإن يدعون إلا شيطانا مريدا لعنه الله وقال لأتخذن من عبادك نصيبا مفروضا ولأضلنهم ولأمنينهم ولآمرنهم فليبتكن آذان الأنعام ولآمرنهم فليغيرن خلق الله ومن يتخذ الشيطان وليا من دون الله فقد خسر خسرانا مبينا يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا ) [ النساء : 117 - 120 ] ، وقال تعالى : ( أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا ) [ الكهف : 50 ] ، وقال إبراهيم لأبيه : ( يا أبت لا تعبد الشيطان إن الشيطان كان للرحمن عصيا ) [ مريم : 44 ] ، وقال تعالى : ( ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين وأن اعبدوني هذا صراط مستقيم ) [ يس : 60 ، 61 ] ، وتقول الملائكة يوم القيامة : ( سبحانك أنت ولينا من دونهم بل كانوا يعبدون الجن أكثرهم بهم مؤمنون ) [ سبأ : 41 ] ، ولهذا قال تعالى : ( وجعلوا لله شركاء الجن وخلقهم ) أي : وقد خلقهم ، فهو الخالق وحده لا شريك له ، فكيف يعبد معه غيره ، كما قال إبراهيم عليه السلام ( أتعبدون ما تنحتون والله خلقكم وما تعملون ) [ الصافات : 95 ، 96 ] .\nومعنى الآية : أنه سبحانه وتعالى هو المستقل بالخلق وحده; فلهذا يجب أن يفرد بالعبادة وحده لا شريك له .\nوقوله تعالى : ( وخرقوا له بنين وبنات بغير علم ) ينبه به تعالى على ضلال من ضل في وصفه تعالى بأن له ولدا ، كما يزعم من قاله من اليهود في العزير ، ومن قال من النصارى في المسيح وكما قال المشركون من العرب في الملائكة : إنها بنات الله ، تعالى الله عما يقولون علوا كبيرا .\nومعنى قوله تعالى ( وخرقوا ) أي : واختلقوا وائتفكوا ، وتخرصوا وكذبوا ، كما قاله علماء السلف . قال علي بن أبي طلحة عن ابن عباس : ( وخرقوا ) يعني : أنهم تخرصوا .\nوقال العوفي عنه : ( وخرقوا له بنين وبنات بغير علم ) قال : جعلوا له بنين وبنات . وقال مجاهد : ( وخرقوا له بنين وبنات ) قال : كذبوا . وكذا قال الحسن . وقال الضحاك : وضعوا ، وقال السدي : قطعوا .\nقال ابن جرير : فتأويل الكلام إذا : وجعلوا لله الجن شركاء في عبادتهم إياه ، وهو المنفرد بخلقهم بغير شريك ولا ظهير ( وخرقوا له بنين وبنات ) يقول : وتخرصوا لله كذبا ، فافتعلوا له بنين وبنات بغير علم بحقيقة ما يقولون ، ولكن جهلا بالله وبعظمته ، وأنه لا ينبغي إن كان إلها أن يكون له بنون وبنات ولا صاحبة ، ولا أن يشركه في خلقه شريك .\nولهذا قال تعالى : ( سبحانه وتعالى عما يصفون ) أي : تقدس وتنزه وتعاظم عما يصفه هؤلاء الجهلة الضالون من الأولاد والأنداد ، والنظراء والشركاء .\n                                    ",
        "qortoby": "وَجَعَلُواْ لِلَّهِ شُرَكَآءَ ٱلۡجِنَّ وَخَلَقَهُمۡۖ وَخَرَقُواْ لَهُۥ بَنِينَ وَبَنَٰتِۢ بِغَيۡرِ عِلۡمٖۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَصِفُونَ ٠٠١\n                                    \n                                    \n                                    قوله تعالى وجعلوا لله شركاء الجن وخلقهم وخرقوا له بنين وبنات بغير علم سبحانه وتعالى عما يصفون\nقوله تعالى : وجعلوا لله شركاء الجن هذا ذكر نوع آخر من جهالاتهم ، أي فيهم من اعتقد لله شركاء من الجن . قال النحاس : الجن مفعول أول ، وشركاء مفعول ثان ; مثل وجعلكم ملوكا . وجعلت له مالا ممدودا . وهو في القرآن كثير . والتقدير وجعلوا لله الجن شركاء . ويجوز أن يكون الجن بدلا من شركاء ، والمفعول الثاني لله . وأجاز الكسائي رفع الجن بمعنى هم الجن . وخلقهم كذا قراءة الجماعة ، أي خلق الجاعلين له شركاء . وقيل : خلق الجن الشركاء . وقرأ ابن مسعود \" وهو خلقهم \" بزيادة هو . وقرأ يحيى بن يعمر \" وخلقهم \" بسكون اللام ، وقال : أي وجعلوا خلقهم لله شركاء ; لأنهم كانوا يخلقون الشيء ثم يعبدونه . والآية نزلت في مشركي العرب . ومعنى إشراكهم بالجن أنهم أطاعوهم كطاعة الله عز وجل ; روي ذلك عن الحسن وغيره . قال قتادة والسدي : هم الذين قالوا الملائكة بنات الله . وقال الكلبي : نزلت في الزنادقة ، قالوا : إن الله وإبليس أخوان ; فالله خالق الناس والدواب ، وإبليس خالق الجان والسباع والعقارب . ويقرب من هذا قول المجوس ، فإنهم قالوا : للعالم صانعان : إله قديم ، والثاني شيطان حادث من فكرة الإله القديم ; وزعموا أن صانع الشر حادث . وكذا الحائطية من المعتزلة من أصحاب أحمد بن حائط ، زعموا أن للعالم صانعين : الإله القديم ، والآخر محدث ، خلقه الله عز وجل أولا ثم فوض إليه تدبير العالم ; وهو الذي يحاسب الخلق في الآخرة . تعالى الله عما يقول الظالمون والجاحدون علوا كبيرا .\nوخرقوا قراءة نافع بالتشديد على التكثير ; لأن المشركين ادعوا أن لله بنات وهم الملائكة ، وسموهم جنا لاجتنانهم . والنصارى ادعت المسيح ابن الله . واليهود قالت : عزير ابن الله ، فكثر ذلك من كفرهم ; فشدد الفعل لمطابقة المعنى . تعالى الله عما يقولون . وقرأ الباقون بالتخفيف على التقليل . وسئل الحسن البصري عن معنى \" وخرقوا له \" بالتشديد فقال : إنما هو \" وخرقوا \" بالتخفيف ، كلمة عربية ، كان الرجل إذا كذب في النادي قيل : خرقها ورب الكعبة . وقال أهل اللغة : معنى خرقوا اختلقوا وافتعلوا \" وخرقوا \" على التكثير . قال مجاهد وقتادة وابن زيد وابن جريج : خرقوا كذبوا . يقال : إن معنى خرق واخترق واختلق سواء ; أي أحدث :\n                                    ",
        "saadi": "وَجَعَلُواْ لِلَّهِ شُرَكَآءَ ٱلۡجِنَّ وَخَلَقَهُمۡۖ وَخَرَقُواْ لَهُۥ بَنِينَ وَبَنَٰتِۢ بِغَيۡرِ عِلۡمٖۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَصِفُونَ ٠٠١\n                                        \n                                        \n                                        \n                                        يخبر تعالى: أنه مع إحسانه لعباده وتعرفه إليهم، بآياته البينات، وحججه الواضحات -أن المشركين به، من قريش وغيرهم، جعلوا له شركاء، يدعونهم، ويعبدونهم، من الجن والملائكة، الذين هم خلق من خلق الله، ليس فيهم من خصائص الربوبية والألوهية شيء، فجعلوها شركاء لمن له الخلق والأمر، وهو المنعم بسائر أصناف النعم، الدافع لجميع النقم، وكذلك \"خرق المشركون\" أي: ائتفكوا، وافتروا من تلقاء أنفسهم لله، بنين وبنات بغير علم منهم، ومن أظلم ممن قال على الله بلا علم، وافترى عليه أشنع النقص، الذي يجب تنزيه الله عنه؟!!. ولهذا نزه نفسه عما افتراه عليه المشركون فقال: { سُبْحَانَهُ وَتَعَالَى عَمَّا يَصِفُونَ } فإنه تعالى، الموصوف بكل كمال، المنزه عن كل نقص، وآفة وعيب.\n                                    "
      },
      "originalText": "وَجَعَلُواْ لِلَّهِ شُرَكَآءَ ٱلۡجِنَّ وَخَلَقَهُمۡۖ وَخَرَقُواْ لَهُۥ بَنِينَ وَبَنَٰتِۢ بِغَيۡرِ عِلۡمٖۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَصِفُونَ ٠٠١"
    },
    {
      "number": 890,
      "text": "بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ ۖ أَنَّىٰ يَكُونُ لَهُ وَلَدٌ وَلَمْ تَكُنْ لَهُ صَاحِبَةٌ ۖ وَخَلَقَ كُلَّ شَيْءٍ ۖ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 101,
      "juz": 7,
      "manzil": 2,
      "page": 140,
      "ruku": 114,
      "hizbQuarter": 56,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَنَّىٰ يَكُونُ لَهُۥ وَلَدٞ وَلَمۡ تَكُن لَّهُۥ صَٰحِبَةٞۖ وَخَلَقَ كُلَّ شَيۡءٖۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ ١٠١\n                                    \n                                    \n                                    ( بديع السماوات والأرض ) أي : مبدع السماوات والآرض وخالقهما ومنشئهما ومحدثها على غير مثال سبق ، كما قال مجاهد والسدي . ومنه سميت البدعة بدعة; لأنه لا نظير لها فيما سلف .\n( أنى يكون له ولد ) أي : كيف يكون له ولد ، ولم تكن له صاحبة؟ أي : والولد إنما يكون متولدا عن شيئين متناسبين ، والله لا يناسبه ولا يشابهه شيء من خلقه; لأنه خالق كل شيء ، فلا صاحبة له ولا ولد ، كما قال تعالى : ( وقالوا اتخذ الرحمن ولدا لقد جئتم شيئا إدا تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا أن دعوا للرحمن ولدا وما ينبغي للرحمن أن يتخذ ولدا إن كل من في السماوات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا ) [ مريم : 88 - 95 ] .\n( وخلق كل شيء وهو بكل شيء عليم ) فبين تعالى أنه الذي خلق كل شيء ، وأنه بكل شيء عليم ، فكيف يكون له صاحبة من خلقه تناسبه؟ وهو الذي لا نظير له فأنى يكون له ولد؟ تعالى الله عن ذلك علوا كبيرا .s\n                                    ",
        "qortoby": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَنَّىٰ يَكُونُ لَهُۥ وَلَدٞ وَلَمۡ تَكُن لَّهُۥ صَٰحِبَةٞۖ وَخَلَقَ كُلَّ شَيۡءٖۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ ١٠١\n                                    \n                                    \n                                    قوله تعالى بديع السماوات والأرض أنى يكون له ولد ولم تكن له صاحبة وخلق كل شيء وهو بكل شيء عليم\nقوله تعالى بديع السماوات والأرض أي مبدعهما ; فكيف يجوز أن يكون له ولد . وبديع خبر ابتداء مضمر أي هو بديع . وأجاز الكسائي خفضه على النعت لله عز وجل ، ونصبه بمعنى بديعا السماوات والأرض . وذا خطأ عند البصريين لأنه لما مضى أنى يكون له ولد أي من أين يكون له ولد . وولد كل شيء شبيهه ، ولا شبيه له .\nولم تكن له صاحبة أي زوجة .\nوخلق كل شيء وهو بكل شيء عليم عموم معناه الخصوص ; أي خلق العالم . ولا يدخل في ذلك كلامه ولا غيره من صفات ذاته . ومثله ورحمتي وسعت كل شيء ولم تسع إبليس ولا من مات كافرا . ومثله تدمر كل شيء ولم تدمر السماوات والأرض .\n                                    ",
        "saadi": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَنَّىٰ يَكُونُ لَهُۥ وَلَدٞ وَلَمۡ تَكُن لَّهُۥ صَٰحِبَةٞۖ وَخَلَقَ كُلَّ شَيۡءٖۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ ١٠١\n                                        \n                                        \n                                        \n                                        { بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ } أي: خالقهما، ومتقن صنعتهما، على غير مثال سبق، بأحسن خلق، ونظام وبهاء، لا تقترح عقول أولي الألباب مثله، وليس له في خلقهما مشارك. { أَنَّى يَكُونُ لَهُ وَلَدٌ وَلَمْ تَكُنْ لَهُ صَاحِبَةٌ } أي: كيف يكون لله الولد، وهو الإله السيد الصمد، الذي لا صاحبة له أي: لا زوجة له، وهو الغني عن مخلوقاته، وكلها فقيرة إليه، مضطرة في جميع أحوالها إليه، والولد لا بد أن يكون من جنس والده؛ والله خالق كل شيء وليس شيء من المخلوقات مشابها لله بوجه من الوجوه. ولما ذكر عموم خلقه للأشياء، ذكر إحاطة علمه بها فقال: { وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ } وفي ذكر العلم بعد الخلق، إشارة إلى الدليل العقلي إلى ثبوت علمه، وهو هذه المخلوقات، وما اشتملت عليه من النظام التام، والخلق الباهر، فإن في ذلك دلالة على سعة علم الخالق، وكمال حكمته، كما قال تعالى: { أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ } وكما قال تعالى: { وَهُوَ الْخَلَّاقُ الْعَلِيمُ }\n                                    "
      },
      "originalText": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَنَّىٰ يَكُونُ لَهُۥ وَلَدٞ وَلَمۡ تَكُن لَّهُۥ صَٰحِبَةٞۖ وَخَلَقَ كُلَّ شَيۡءٖۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ ١٠١"
    }
  ]
}