{
  "number": 150,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 947,
      "text": "هَلْ يَنْظُرُونَ إِلَّا أَنْ تَأْتِيَهُمُ الْمَلَائِكَةُ أَوْ يَأْتِيَ رَبُّكَ أَوْ يَأْتِيَ بَعْضُ آيَاتِ رَبِّكَ ۗ يَوْمَ يَأْتِي بَعْضُ آيَاتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا ۗ قُلِ انْتَظِرُوا إِنَّا مُنْتَظِرُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 158,
      "juz": 8,
      "manzil": 2,
      "page": 150,
      "ruku": 121,
      "hizbQuarter": 60,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ رَبُّكَ أَوۡ يَأۡتِيَ بَعۡضُ ءَايَٰتِ رَبِّكَۗ يَوۡمَ يَأۡتِي بَعۡضُ ءَايَٰتِ رَبِّكَ لَا يَنفَعُ نَفۡسًا إِيمَٰنُهَا لَمۡ تَكُنۡ ءَامَنَتۡ مِن قَبۡلُ أَوۡ كَسَبَتۡ فِيٓ إِيمَٰنِهَا خَيۡرٗاۗ قُلِ ٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ ٨٥١\n                                    \n                                    \n                                    يقول تعالى متوعدا للكافرين به ، والمخالفين رسله والمكذبين بآياته ، والصادين عن سبيله : ( هل ينظرون إلا أن تأتيهم الملائكة أو يأتي ربك ) وذلك كائن يوم القيامة . ( أو يأتي بعض آيات ربك يوم يأتي بعض آيات ربك ) الآية ، وذلك قبل يوم القيامة كائن من أمارات الساعة وأشراطها كما قال البخاري في تفسير هذه الآية :\nحدثنا موسى بن إسماعيل ، حدثنا عبد الواحد ، حدثنا عمارة ، حدثنا أبو زرعة ، حدثنا أبو هريرة ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" لا تقوم الساعة حتى تطلع الشمس من مغربها ، فإذا رآها الناس آمن من عليها . فذلك حين ( لا ينفع نفسا إيمانها لم تكن آمنت من قبل ) .\nحدثنا إسحاق ، حدثنا عبد الرزاق ، حدثنا معمر ، عن همام بن منبه ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" لا تقوم الساعة حتى تطلع الشمس من مغربها ، فإذا طلعت ورآها الناس آمنوا أجمعون ، وذلك حين لا ينفع نفسا إيمانها \" ثم قرأ هذه الآية .\nهكذا روي هذا الحديث من هذين الوجهين . ومن الوجه الأول أخرجه بقية الجماعة في كتبهم إلا الترمذي ، من طرق ، عن عمارة بن القعقاع بن شبرمة ، عن أبي زرعة بن عمرو بن جرير ، عن أبي هريرة ، به .\nوأما الطريق الثاني : فرواه عن إسحاق غير منسوب ، فقيل : هو ابن منصور الكوسج ، وقيل : إسحاق بن نصر والله أعلم .\nوقد رواه مسلم عن محمد بن رافع النيسابوري ، كلاهما عن عبد الرزاق ، به .\nوقد ورد هذا الحديث من طرق أخر عن أبي هريرة ، كما انفرد مسلم بروايته من حديث العلاء بن عبد الرحمن بن يعقوب مولى الحرقة ، عن أبيه ، عن أبي هريرة ، به .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا ابن فضيل ، عن أبيه ، عن أبي حازم ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" ثلاث إذا خرجن ( لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ) طلوع الشمس من مغربها ، والدجال ، ودابة الأرض \"\nورواه أحمد ، عن وكيع ، عن فضيل بن غزوان ، عن أبي حازم سلمان ، عن أبي هريرة به ، وعنده : \" والدخان \"\nورواه مسلم ، عن أبي بكر بن أبي شيبة ، وزهير بن حرب ، عن وكيع .\nورواه هو أيضا والترمذي ، من غير وجه ، عن فضيل بن غزوان ، به .\nورواه إسحاق بن عبد الله الفروي ، عن مالك ، عن أبي الزناد ، عن الأعرج ، عن أبي هريرة . ولكن لم يخرجه أحد من أصحاب الكتب من هذا الوجه ، لضعف الفروي ، والله أعلم .\nوقال ابن جرير : حدثنا الربيع بن سليمان ، حدثنا شعيب بن الليث ، عن أبيه ، عن جعفر بن ربيعة ، عن عبد الرحمن بن هرمز الأعرج ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" لا تقوم الساعة حتى تطلع الشمس من مغربها ، فإذا طلعت آمن الناس كلهم ، وذلك حين ( لا ينفع نفسا إيمانها لم تكن آمنت من قبل ) الآية .\nورواه ابن لهيعة ، عن الأعرج ، عن أبي هريرة ، به . ورواه وكيع ، عن فضيل بن غزوان ، عن أبي حازم ، عن أبي هريرة ، به .\nأخرج هذه الطرق كلها الحافظ أبو بكر بن مردويه في تفسيره .\nوقال ابن جرير : حدثنا الحسن بن يحيى ، أخبرنا عبد الرزاق ، أخبرنا معمر ، عن أيوب ، عن ابن سيرين ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" من تاب قبل أن تطلع الشمس من مغربها ، قبل منه \"\nلم يخرجه أحد من أصحاب الكتب الستة .\nحديث آخر عن أبي ذر الغفاري : في الصحيحين وغيرهما ، من طرق ، عن إبراهيم بن يزيد بن شريك التيمي ، عن أبيه ، عن أبي ذر جندب بن جنادة ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" تدري أين تذهب الشمس إذا غربت؟ \" قلت : لا أدري ، قال : \" إنها تنتهي دون العرش ، ثم تخر ساجدة ، ثم تقوم حتى يقال لها : ارجعي فيوشك يا أبا ذر أن يقال لها : ارجعي من حيث جئت ، وذلك حين : ( لا ينفع نفسا إيمانها لم تكن آمنت من قبل ) .\nحديث آخر عن حذيفة بن أسيد أبي سريحة الغفاري ، رضي الله عنه :\nقال الإمام أحمد بن حنبل : حدثنا سفيان ، عن فرات ، عن أبي الطفيل ، عن حذيفة بن أسيد الغفاري قال : أشرف علينا رسول الله صلى الله عليه وسلم من غرفة ، ونحن نتذاكر الساعة ، فقال : \" لا تقوم الساعة حتى تروا عشر آيات : طلوع الشمس من مغربها ، والدخان ، والدابة ، وخروج يأجوج ومأجوج ، وخروج عيسى ابن مريم ، والدجال ، وثلاثة خسوف : خسف بالمغرب ، وخسف بالمشرق ، وخسف بجزيرة العرب ، ونار تخرج من قعر عدن تسوق - أو : تحشر - الناس ، تبيت معهم حيث باتوا ، وتقيل معهم حيث قالوا \"\nوهكذا رواه مسلم وأهل السنن الأربعة من حديث فرات القزاز ، عن أبي الطفيل عامر بن واثلة ، عن حذيفة بن أسيد ، به . وقال الترمذي : حسن صحيح .\nحديث آخر عن حذيفة بن اليمان ، رضي الله عنه :\nقال الثوري ، عن منصور ، عن ربعي ، عن حذيفة قال : سألت النبي صلى الله عليه وسلم فقلت : يا رسول الله ، ما آية طلوع الشمس من مغربها؟ فقال النبي صلى الله عليه وسلم : \" تطول تلك الليلة حتى تكون قدر ليلتين ، فبينما الذين كانوا يصلون فيها ، يعملون كما كانوا يعملون قبلها والنجوم لا تسري ، قد قامت مكانها ، ثم يرقدون ، ثم يقومون فيصلون ، ثم يرقدون ، ثم يقومون فيطل عليهم جنوبهم حتى يتطاول عليهم الليل ، فيفزع الناس ولا يصبحون ، فبينما هم ينتظرون طلوع الشمس من مشرقها إذ طلعت من مغربها ، فإذا رآها الناس آمنوا ، ولا ينفعهم إيمانهم \" .\nرواه ابن مردويه ، وليس في الكتب الستة من هذا الوجه والله أعلم .\nحديث آخر عن أبي سعيد الخدري - واسمه : سعد بن مالك بن سنان - رضي الله عنه وأرضاه :\nقال الإمام أحمد : حدثنا وكيع ، حدثنا ابن أبي ليلى ، عن عطية العوفي ، عن أبي سعيد الخدري ، عن النبي صلى الله عليه وسلم : ( يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها ) قال : \" طلوع الشمس من مغربها \" .\nورواه الترمذي ، عن سفيان بن وكيع ، عن أبيه ، به . وقال : غريب ، ورواه بعضهم ولم يرفعه .\nوفي حديث طالوت بن عباد ، عن فضال بن جبير ، عن أبي أمامة صدي بن عجلان قال : قال رسول الله صلى الله عليه وسلم : \" إن أول الآيات طلوع الشمس من مغربها \"\nوفي حديث عاصم بن أبي النجود ، عن زر بن حبيش ، عن صفوان بن عسال قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" إن الله فتح بابا قبل المغرب عرضه سبعون عاما للتوبة \" ، قال : \" لا يغلق حتى تطلع الشمس منه \" رواه الترمذي وصححه النسائي ، وابن ماجه في حديث طويل .\nحديث آخر عن عبد الله بن أبي أوفى :\nقال ابن مردويه : حدثنا محمد بن علي بن دحيم ، حدثنا أحمد بن حازم ، حدثنا ضرار بن صرد ، حدثنا ابن فضيل ، عن سليمان بن زيد ، عن عبد الله بن أبي أوفى قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" ليأتين على الناس ليلة تعدل ثلاث ليال من لياليكم هذه ، فإذا كان ذلك يعرفها المتنفلون ، يقوم أحدهم فيقرأ حزبه ، ثم ينام ، ثم يقوم فيقرأ حزبه ، ثم ينام . فبينما هم كذلك إذ صاح الناس بعضهم في بعض فقالوا : ما هذا؟ فيفزعون إلى المساجد ، فإذا هم بالشمس قد طلعت من مغربها ، فضج الناس ضجة واحدة ، حتى إذا صارت في وسط السماء رجعت وطلعت من مطلعها \" قال : \" حينئذ لا ينفع نفسا إيمانها \"\nهذا حديث غريب من هذا الوجه وليس هو في شيء من الكتب الستة .\nحديث آخر عن عبد الله بن عمرو .\nقال الإمام أحمد : حدثنا إسماعيل بن إبراهيم ، حدثنا أبو حيان ، عن أبي زرعة بن عمرو بن جرير قال : جلس ثلاثة نفر من المسلمين إلى مروان بالمدينة فسمعوه يقول - وهو يحدث في الآيات - : إن أولها خروج الدجال . قال : فانصرف النفر إلى عبد الله بن عمرو ، فحدثوه بالذي سمعوه من مروان في الآيات ، فقال لم يقل مروان شيئا قد حفظت من رسول الله صلى الله عليه وسلم في مثل ذلك حديثا لم أنسه بعد ، سمعت رسول الله صلى الله عليه وسلم يقول : \" إن أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة ضحى ، فأيتهما كانت قبل صاحبتها فالأخرى على أثرها \" ثم قال عبد الله - وكان يقرأ الكتب - : وأظن أولها خروجا طلوع الشمس من مغربها ، وذلك أنها كلما غربت أتت تحت العرش فسجدت واستأذنت في الرجوع فأذن لها في الرجوع ، حتى إذا بدا الله أن تطلع من مغربها فعلت كما كانت تفعل : أتت تحت العرش فسجدت واستأذنت في الرجوع ، فلم يرد عليها شيء ، ثم تستأذن في الرجوع فلا يرد عليها شيء ، ثم تستأذن فلا يرد عليها شيء ، حتى إذا ذهب من الليل ما شاء الله أن يذهب ، وعرفت أنه إذا أذن لها في الرجوع لم تدرك المشرق ، قالت : ربي ، ما أبعد المشرق . من لي بالناس . حتى إذا صار الأفق كأنه طوق استأذنت في الرجوع ، فيقال لها : من مكانك فاطلعي . فطلعت على الناس من مغربها \" ، ثم تلا عبد الله هذه الآية : ( لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ) الآية .\nوأخرجه مسلم في صحيحه ، وأبو داود وابن ماجه ، في سننيهما ، من حديث أبي حيان التيمي - واسمه يحيى بن سعيد بن حيان - عن أبي زرعة بن عمرو بن جرير ، به .\nحديث آخر عنه :\nقال الطبراني : حدثنا أحمد بن يحيى بن خالد بن حبان الرقي ، حدثنا إسحاق بن إبراهيم - بن زبريق الحمصي - حدثنا عثمان بن سعيد بن كثير بن دينار ، حدثنا ابن لهيعة ، عن حيي بن عبد الله ، عن أبي عبد الرحمن الحبلي عن عبد الله بن عمرو بن العاص قال : قال النبي صلى الله عليه وسلم : \" إذا طلعت الشمس من مغربها خر إبليس ساجدا ينادي ويجهر : إلهي ، مرني أن أسجد لمن شئت \" قال : \" فيجتمع إليه زبانيته فيقولون : يا سيدهم ، ما هذا التضرع؟ فيقول : إنما سألت ربي أن ينظر إلى الوقت المعلوم ، وهذا الوقت المعلوم \" قال \" ثم تخرج دابة الأرض من صدع في الصفا \" قال : \" فأول خطوة تضعها بأنطاكية فتأتي إبليس فتخطمه .\nهذا حديث غريب جدا وسنده ضعيف ولعله من الزاملتين اللتين أصابهما عبد الله بن عمرو يوم اليرموك ، فأما رفعه فمنكر ، والله أعلم .\nحديث آخر عن عبد الله بن عمرو ، وعبد الرحمن بن عوف ، ومعاوية بن أبي سفيان ، رضي الله عنهم أجمعين :\nقال الإمام أحمد : حدثنا الحكم بن نافع ، حدثنا إسماعيل بن عياش ، عن ضمضم بن زرعة ، عن شريح بن عبيد يرده إلى مالك بن يخامر ، عن ابن السعدي ; أن رسول الله صلى الله عليه وسلم قال : \" لا تنقطع الهجرة ما دام العدو يقاتل \" فقال معاوية ، وعبد الرحمن بن عوف ، وعبد الله بن عمرو بن العاص : إن النبي صلى الله عليه وسلم قال : \" إن الهجرة خصلتان : إحداهما تهجر السيئات ، والأخرى تهاجر إلى الله ورسوله ، ولا تنقطع ما تقبلت التوبة ، ولا تزال التوبة مقبولة حتى تطلع الشمس من المغرب فإذا طلعت طبع على كل قلب بما فيه ، وكفي الناس العمل \" هذا الحديث حسن الإسناد ولم يخرجه أحد من أصحاب الكتب الستة ، والله أعلم .\nحديث آخر عن ابن مسعود ، رضي الله عنه :\nقال عوف الأعرابي ، عن محمد بن سيرين ، حدثني أبو عبيدة ، عن ابن مسعود ; أنه كان يقول : ما ذكر من الآيات فقد مضى غير أربع : طلوع الشمس من مغربها ، والدجال ، ودابة الأرض ، وخروج يأجوج ومأجوج . قال : وكان يقول : الآية التي تختم بها الأعمال طلوع الشمس من مغربها ، ألم تر أن الله يقول : ( يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها ) الآية كلها ، يعني طلوع الشمس من مغربها .\nحديث ابن عباس ، رضي الله عنهما :\nرواه الحافظ أبو بكر بن مردويه في تفسيره من حديث عبد المنعم بن إدريس ، عن أبيه ، عن وهب بن منبه ، عن ابن عباس رضي الله عنه مرفوعا - فذكر حديثا طويلا غريبا منكرا رفعه ، وفيه : \" أن الشمس والقمر يطلعان يومئذ مقرونين وإذا نصفا السماء رجعا ثم عادا إلى ما كانا عليه \" وهو حديث غريب جدا بل منكر ، بل موضوع ، والله أعلم إن ادعى أنه مرفوع ، فأما وقفه على ابن عباس أو وهب بن منبه - وهو الأشبه - فغير مدفوع والله أعلم .\nوقال سفيان ، عن منصور ، عن عامر ، عن عائشة رضي الله عنها قالت : إذا خرج أول الآيات ، طرحت الأقلام ، وحبست الحفظة ، وشهدت الأجساد على الأعمال . رواه ابن جرير .\nفقوله عز وجل ( لا ينفع نفسا إيمانها لم تكن آمنت من قبل ) أي : إذا أنشأ الكافر إيمانا يومئذ لا يقبل منه ، فأما من كان مؤمنا قبل ذلك ، فإن كان مصلحا في عمله فهو بخير عظيم ، وإن كان مخلطا فأحدث توبة حينئذ لم تقبل منه توبته ، كما دلت عليه الأحاديث المتقدمة ، وعليه يحمل قوله تعالى : ( أو كسبت في إيمانها خيرا ) أي : ولا يقبل منها كسب عمل صالح إذا لم يكن عاملا به قبل ذلك .\nوقوله : ( قل انتظروا إنا منتظرون ) تهديد شديد للكافرين ، ووعيد أكيد لمن سوف بإيمانه وتوبته إلى وقت لا ينفعه ذلك . وإنما كان الحكم هذا عند طلوع الشمس من مغربها ، لاقتراب وقت القيامة ، وظهور أشراطها كما قال : ( فهل ينظرون إلا الساعة أن تأتيهم بغتة فقد جاء أشراطها فأنى لهم إذا جاءتهم ذكراهم ) [ محمد : 18 ] ، وقال تعالى : ( فلما رأوا بأسنا قالوا آمنا بالله وحده وكفرنا بما كنا به مشركين فلم يك ينفعهم إيمانهم لما رأوا بأسنا سنة الله التي قد خلت في عباده وخسر هنالك الكافرون ) [ غافر : 84 ، 85 ] .\n                                    ",
        "qortoby": "هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ رَبُّكَ أَوۡ يَأۡتِيَ بَعۡضُ ءَايَٰتِ رَبِّكَۗ يَوۡمَ يَأۡتِي بَعۡضُ ءَايَٰتِ رَبِّكَ لَا يَنفَعُ نَفۡسًا إِيمَٰنُهَا لَمۡ تَكُنۡ ءَامَنَتۡ مِن قَبۡلُ أَوۡ كَسَبَتۡ فِيٓ إِيمَٰنِهَا خَيۡرٗاۗ قُلِ ٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ ٨٥١\n                                    \n                                    \n                                    قوله تعالى هل ينظرون إلا أن تأتيهم الملائكة أو يأتي ربك أو يأتي بعض آيات ربك يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا قل انتظروا إنا منتظرون\nقوله تعالى هل ينظرون معناه أقمت عليهم الحجة وأنزلت عليهم الكتاب فلم يؤمنوا ، فماذا ينتظرون .\nهل ينظرون إلا أن تأتيهم الملائكة أي عند الموت لقبض أرواحهم .\nأو يأتي ربك قال ابن عباس والضحاك : أمر ربك فيهم بالقتل أو غيره ، وقد يذكر المضاف إليه والمراد به المضاف ; كقوله تعالى : واسأل القرية يعني أهل القرية . وقوله : وأشربوا في قلوبهم العجل أي حب العجل . كذلك هنا : يأتي أمر ربك أي عقوبة ربك وعذاب ربك . ويقال : هذا من المتشابه الذي لا يعلم تأويله إلا الله . وقد تقدم القول في مثله في \" البقرة \" وغيرها .\nأو يأتي بعض آيات ربك قيل : هو طلوع الشمس من مغربها . بين بهذا أنهم يمهلون في الدنيا فإذا ظهرت الساعة فلا إمهال .\nوقيل : إتيان الله تعالى مجيئه لفصل القضاء بين خلقه في موقف القيامة ; كما قال تعالى : وجاء ربك والملك صفا صفا . وليس مجيئه تعالى حركة ولا انتقالا ولا زوالا ; لأن ذلك إنما يكون إذا كان الجائي جسما أو جوهرا . والذي عليه جمهور أئمة أهل السنة أنهم يقولون : يجيء وينزل ويأتي . ولا يكيفون ; لأنه ليس كمثله شيء وهو السميع البصير\nوفي صحيح مسلم عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : ثلاث إذا خرجن لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا : طلوع الشمس من مغربها والدجال ودابة الأرض . وعن صفوان بن عسال المرادي قال سمعت رسول الله صلى الله عليه وسلم يقول : إن بالمغرب بابا مفتوحا للتوبة مسيرة سبعين سنة لا يغلق حتى تطلع الشمس من نحوه . أخرجه الدارقطني والدارمي والترمذي وقال : هذا حديث حسن صحيح . وقال سفيان : قبل الشام ، خلقه الله يوم خلق السماوات والأرض . \" مفتوحا \" يعني للتوبة لا يغلق حتى تطلع الشمس منه . قال : حديث حسن صحيح .\nقلت : وكذب بهذا كله الخوارج والمعتزلة كما تقدم . وروى ابن عباس قال : سمعت عمر بن الخطاب فقال : أيها الناس ، إن الرجم حق فلا تخدعن عنه ، وإن آية ذلك أن رسول الله صلى الله عليه وسلم قد رجم ، وأن أبا بكر قد رجم ، وأنا قد رجمنا بعدهما ، وسيكون قوم من هذه الأمة يكذبون بالرجم ، ويكذبون بالدجال ، ويكذبون بطلوع الشمس من مغربها ، ويكذبون بعذاب القبر ، ويكذبون بالشفاعة ، ويكذبون بقوم يخرجون من النار بعد ما امتحشوا . ذكره أبو عمر . وذكر الثعلبي في حديث فيه طول عن أبي هريرة عن النبي صلى الله عليه وسلم ما معناه : أن الشمس تحبس عن الناس - حين تكثر المعاصي في الأرض ويذهب المعروف فلا يأمر به أحد ، ويفشو المنكر فلا ينهى عنه - مقدار ليلة تحت العرش ، كلما سجدت واستأذنت ربها تعالى من أين تطلع لم يجئ لها جواب حتى يوافيها القمر فيسجد معها ، ويستأذن من أين يطلع فلا يجاء إليهما جواب حتى يحبسا مقدار ثلاث ليال للشمس وليلتين للقمر ; فلا يعرف طول تلك الليلة إلا المتهجدون في الأرض وهم يومئذ عصابة قليلة في كل بلدة من بلاد المسلمين فإذا تم لهما مقدار ثلاث ليال أرسل الله تعالى إليهما جبريل عليه السلام فيقول : إن الرب سبحانه وتعالى يأمركما أن ترجعا إلى مغاربكما فتطلعا منه ، وأنه لا ضوء لكما عندنا ولا نور . فيطلعان من مغاربهما أسودين ، لا ضوء للشمس ولا نور للقمر ، مثلهما في كسوفهما قبل ذلك . فذلك قوله تعالى : وجمع الشمس والقمر وقوله : إذا الشمس كورت فيرتفعان كذلك مثل البعيرين المقرونين ; فإذا ما بلغ الشمس والقمر سرة السماء وهي منتصفها جاءهما جبريل عليه السلام فأخذ بقرونهما وردهما إلى المغرب ، فلا يغربهما من مغاربهما ولكن يغربهما من باب التوبة ثم يرد المصراعين ، ثم يلتئم ما بينهما فيصير كأنه لم يكن بينهما صدع . فإذا أغلق باب التوبة لم تقبل لعبد بعد ذلك توبة ، ولم تنفعه بعد ذلك حسنة يعملها ; إلا من كان قبل ذلك محسنا فإنه يجري عليه ما كان عليه قبل ذلك اليوم ; فذلك قوله تعالى : يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا .\nثم إن الشمس والقمر يكسيان بعد ذلك الضوء والنور ، ثم يطلعان على الناس ويغربان كما كانا قبل ذلك يطلعان ويغربان . قال العلماء : وإنما لا ينفع نفسا إيمانها عند طلوعها من مغربها ; لأنه خلص إلى قلوبهم من الفزع ما تخمد معه كل شهوة من شهوات النفس ، وتفتر كل قوة من قوى البدن ; فيصير الناس كلهم لإيقانهم بدنو القيامة في حال من حضره الموت في انقطاع الدواعي إلى أنواع المعاصي عنهم ، وبطلانها من أبدانهم ; فمن تاب في مثل هذه الحال لم تقبل توبته ، كما لا تقبل توبة من حضره الموت . قال صلى الله عليه وسلم : إن الله يقبل توبة العبد ما لم يغرغر أي تبلغ روحه رأس حلقه ، وذلك وقت المعاينة الذي يرى فيه مقعده من الجنة أو مقعده من النار ; فالمشاهد لطلوع الشمس من مغربها مثله . وعلى هذا ينبغي أن تكون توبة كل من شاهد ذلك أو كان كالمشاهد له مردودة ما عاش ; لأن علمه بالله تعالى وبنبيه صلى الله عليه وسلم وبوعده قد صار ضرورة . فإن امتدت أيام الدنيا إلى أن ينسى الناس من هذا الأمر العظيم ما كان ، ولا يتحدثوا عنه إلا قليلا ، فيصير الخبر عنه خاصا وينقطع التواتر عنه ; فمن أسلم في ذلك الوقت أو تاب قبل منه . والله أعلم .\nوفي صحيح مسلم عن عبد الله قال : حفظت من رسول الله صلى الله عليه وسلم حديثا لم أنسه بعد ، سمعت رسول الله صلى الله عليه وسلم يقول : إن أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة على الناس ضحى وأيهما ما كانت قبل صاحبتها فالأخرى على إثرها قريبا . وفيه عن حذيفة قال كان رسول الله صلى الله عليه وسلم في غرفة ونحن أسفل منه ، فاطلع إلينا فقال : ما تذاكرون ؟ قلنا : الساعة . قال : إن الساعة لا تكون حتى تكون عشر آيات : خسف بالمشرق وخسف بالمغرب وخسف في جزيرة العرب والدخان والدجال ودابة الأرض ويأجوج ومأجوج وطلوع الشمس من مغربها ونار تخرج من قعر عدن ترحل الناس .\nقال شعبة : وحدثني عبد العزيز بن رفيع عن أبي الطفيل عن أبي سريحة مثل ذلك ، لا يذكر النبي صلى الله عليه وسلم . وقال أحدهما في العاشرة : ونزول عيسى ابن مريم صلى الله عليه وسلم . وقال الآخر : وريح تلقي الناس في البحر . قلت : وهذا حديث متقن في ترتيب العلامات . وقد وقع بعضها وهي الخسوفات على ما ذكر أبو الفرج الجوزي من وقوعها بعراق العجم والمغرب . وهلك بسببها خلق كثير ; ذكره في كتاب فهوم الآثار وغيره . ويأتي ذكر الدابة في \" النمل \" . ويأجوج ومأجوج في \" الكهف \" . ويقال : إن الآيات تتابع كالنظم في الخيط عاما فعاما . وقيل : إن الحكمة في طلوع الشمس من مغربها أن إبراهيم عليه السلام قال لنمروذ : فإن الله يأتي بالشمس من المشرق فأت بها من المغرب فبهت الذي كفر وأن الملحدة والمنجمة عن آخرهم ينكرون ذلك ويقولون : هو غير كائن ; فيطلعها الله تعالى يوما من المغرب ليري المنكرين قدرته أن الشمس في ملكه ، إن شاء أطلعها من المشرق وإن شاء أطلعها من المغرب . وعلى هذا يحتمل أن يكون رد التوبة والإيمان على من آمن وتاب من المنكرين لذلك المكذبين لخبر النبي صلى الله عليه وسلم بطلوعها ، فأما المصدقون لذلك فإنه تقبل توبتهم وينفعهم إيمانهم قبل ذلك . وروي عن عبد الله بن عباس أنه قال : لا يقبل من كافر عمل ولا توبة إذا أسلم حين يراها ، إلا من كان صغيرا يومئذ ; فإنه لو أسلم بعد ذلك قبل ذلك منه . ومن كان مؤمنا مذنبا فتاب من الذنب قبل منه . وروي عن عمران بن حصين أنه قال : إنما لم تقبل توبته وقت طلوع الشمس حين تكون صيحة فيهلك فيها كثير من الناس ; فمن أسلم أو تاب في ذلك الوقت وهلك لم تقبل توبته ، ومن تاب بعد ذلك قبلت توبته ; ذكره أبو الليث السمرقندي في تفسيره . وقال عبد الله بن عمر : يبقى الناس بعد طلوع الشمس من مغربها مائة وعشرين سنة حتى يغرسوا النخل . والله بغيبه أعلم .\nوقرأ ابن عمر وابن الزبير ( يوم تأتي ) بالتاء ; مثل ( تلتقطه بعض السيارة ) . وذهبت بعض أصابعه . وقال جرير :\nلما أتى خبر الزبير تواضعت سور المدينة والجبال الخشع\nقال المبرد : التأنيث على المجاورة لمؤنث لا على الأصل . وقرأ ابن سيرين ( لا تنفع ) بالتاء . قال أبو حاتم : يذكرون أن هذا غلط من ابن سيرين . قال النحاس : في هذا شيء دقيق من النحو ذكره سيبويه ، وذلك أن الإيمان والنفس كل واحد منهما مشتمل على الآخر فأنث الإيمان إذ هو من النفس وبها ; وأنشد سيبويه :\nمشين كما اهتزت رماح تسفهت أعاليها مر الرياح النواسم\nقال المهدوي : وكثيرا ما يؤنثون فعل المضاف المذكر إذا كانت إضافته إلى مؤنث ، وكان المضاف بعض المضاف إليه منه أو به ; وعليه قول ذي الرمة : مشين . . . البيت فأنث المر لإضافته إلى الرياح وهي مؤنثة ، إذ كان المر من الرياح . قال النحاس : وفيه قول آخر وهو أن يؤنث الإيمان لأنه مصدر كما يذكر المصدر المؤنث ; مثل فمن جاءه موعظة من ربه وكما قال :\nفقد عذرتنا في صحابته العذر\nففي أحد الأقوال أنث العذر لأنه بمعنى المعذرة .\nقل انتظروا إنا منتظرون بكم العذاب .\n                                    ",
        "saadi": "هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ رَبُّكَ أَوۡ يَأۡتِيَ بَعۡضُ ءَايَٰتِ رَبِّكَۗ يَوۡمَ يَأۡتِي بَعۡضُ ءَايَٰتِ رَبِّكَ لَا يَنفَعُ نَفۡسًا إِيمَٰنُهَا لَمۡ تَكُنۡ ءَامَنَتۡ مِن قَبۡلُ أَوۡ كَسَبَتۡ فِيٓ إِيمَٰنِهَا خَيۡرٗاۗ قُلِ ٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ ٨٥١\n                                        \n                                        \n                                        \n                                        يقول تعالى: هل ينظر هؤلاء الذين استمر ظلمهم وعنادهم، { إِلَّا أَنْ يَأْتِيَهُمُ } مقدمات العذاب، ومقدمات الآخرة بأن تأتيهم { الْمَلَائِكَةِ } لقبض أرواحهم، فإنهم إذا وصلوا إلى تلك الحال، لم ينفعهم الإيمان ولا صالح الأعمال. { أَوْ يَأْتِيَ رَبُّكَ } لفصل القضاء بين العباد، ومجازاة المحسنين والمسيئين. { أَوْ يَأْتِيَ بَعْضُ آيَاتِ رَبِّكَ } الدالة على قرب الساعة. { يَوْمَ يَأْتِي بَعْضُ آيَاتِ رَبِّكَ } الخارقة للعادة، التي يعلم بها أن الساعة قد دنت، وأن القيامة قد اقتربت. { لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا } أي: إذا وجد بعض آيات الله لم ينفع الكافر إيمانه أن آمن، ولا المؤمنَ المقصر أن يزداد خيرُه بعد ذلك، بل ينفعه ما كان معه من الإيمان قبل ذلك، وما كان له من الخير المرجوِّ قبل أن يأتي بعض الآيات. والحكمة في هذا ظاهرة، فإنه إنما كان الإيمان ينفع إذا كان إيمانا بالغيب، وكان اختيارا من العبد، فأما إذا وجدت الآيات صار الأمر شهادة، ولم يبق للإيمان فائدة، لأنه يشبه الإيمان الضروري، كإيمان الغريق والحريق ونحوهما، ممن إذا رأى الموت، أقلع عما هو فيه كما قال تعالى: { فَلَمَّا رَأَوْا بَأْسَنَا قَالُوا آمَنَّا بِاللَّهِ وَحْدَهُ وَكَفَرْنَا بِمَا كُنَّا بِهِ مُشْرِكِينَ فَلَمْ يَكُ يَنْفَعُهُمْ إِيمَانُهُمْ لَمَّا رَأَوْا بَأْسَنَا سُنَّةَ اللَّهِ الَّتِي قَدْ خَلَتْ فِي عِبَادِهِ } وقد تكاثرت الأحاديث الصحيحة عن النبي صلى الله عليه وسلم أن المراد ببعض آيات الله، طلوع الشمس من مغربها، وأن الناس إذا رأوها، آمنوا، فلم ينفعهم إيمانهم، ويُغلق حينئذ بابُ التوبة. ولما كان هذا وعيدا للمكذبين بالرسول صلى الله عليه وسلم، منتظرا، وهم ينتظرون بالنبي صلى الله عليه وسلم وأتباعه قوارع الدهر ومصائب الأمور، قال: { قُلِ انْتَظِرُوا إِنَّا مُنْتَظِرُونَ } فستعلمون أينا أحق بالأمن. وفي هذه الآية دليل لمذهب أهل السنة والجماعة في إثبات الأفعال الاختيارية لله تعالى، كالاستواء والنزول، والإتيان لله تبارك وتعالى، من غير تشبيه له بصفات المخلوقين. وفي الكتاب والسنة من هذا شيء كثير، وفيه أن من جملة أشراط الساعة طلوع الشمس من مغربها. وأن الله تعالى حكيم قد جرت عادته وسنته، أن الإيمان إنما ينفع إذا كان اختياريا لا اضطراريا، كما تقدم. وأن الإنسان يكتسب الخير بإيمانه. فالطاعة والبر والتقوى إنما تنفع وتنمو إذا كان مع العبد الإيمان. فإذا خلا القلب من الإيمان لم ينفعه شيء من ذلك.\n                                    "
      },
      "originalText": "هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ رَبُّكَ أَوۡ يَأۡتِيَ بَعۡضُ ءَايَٰتِ رَبِّكَۗ يَوۡمَ يَأۡتِي بَعۡضُ ءَايَٰتِ رَبِّكَ لَا يَنفَعُ نَفۡسًا إِيمَٰنُهَا لَمۡ تَكُنۡ ءَامَنَتۡ مِن قَبۡلُ أَوۡ كَسَبَتۡ فِيٓ إِيمَٰنِهَا خَيۡرٗاۗ قُلِ ٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ ٨٥١"
    },
    {
      "number": 948,
      "text": "إِنَّ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا لَسْتَ مِنْهُمْ فِي شَيْءٍ ۚ إِنَّمَا أَمْرُهُمْ إِلَى اللَّهِ ثُمَّ يُنَبِّئُهُمْ بِمَا كَانُوا يَفْعَلُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 159,
      "juz": 8,
      "manzil": 2,
      "page": 150,
      "ruku": 121,
      "hizbQuarter": 60,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗا لَّسۡتَ مِنۡهُمۡ فِي شَيۡءٍۚ إِنَّمَآ أَمۡرُهُمۡ إِلَى ٱللَّهِ ثُمَّ يُنَبِّئُهُم بِمَا كَانُواْ يَفۡعَلُونَ ٩٥١\n                                    \n                                    \n                                    قال مجاهد ، وقتادة ، والضحاك ، والسدي : نزلت هذه الآية في اليهود والنصارى .\nوقال العوفي ، عن ابن عباس في قوله : ( إن الذين فرقوا دينهم وكانوا شيعا ) وذلك أن اليهود والنصارى اختلفوا قبل أن يبعث محمد صلى الله عليه وسلم ، فتفرقوا . فلما بعث الله محمدا صلى الله عليه وسلم أنزل : ( إن الذين فرقوا دينهم وكانوا شيعا لست منهم في شيء ) الآية .\nوقال ابن جرير : حدثني سعد بن عمرو السكوني ، حدثنا بقية بن الوليد : كتب إلي عباد بن كثير ، حدثني ليث ، عن طاوس ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" إن في هذه الأمة ( الذين فرقوا دينهم وكانوا شيعا لست منهم في شيء ) وليسوا منك ، هم أهل البدع ، وأهل الشبهات ، وأهل الضلالة ، من هذه الأمة \"\nلكن هذا الإسناد لا يصح ، فإن عباد بن كثير متروك الحديث ، ولم يختلق هذا الحديث ، ولكنه وهم في رفعه . فإنه رواه سفيان الثوري ، عن ليث - وهو ابن أبي سليم - عن طاوس ، عن أبي هريرة ، في قوله : ( إن الذين فرقوا دينهم وكانوا شيعا ) قال : نزلت في هذه الأمة .\nوقال أبو غالب ، عن أبي أمامة ، في قوله : ( إن الذين فرقوا دينهم وكانوا شيعا ) قال : هم الخوارج . وروي عنه مرفوعا ، ولا يصح .\nوقال شعبة ، عن مجالد ، عن الشعبي ، عن شريح ، عن عمر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال لعائشة : ( إن الذين فرقوا دينهم وكانوا شيعا ) قال : \" هم أصحاب البدع \" .\nوهذا رواه ابن مردويه ، وهو غريب أيضا ولا يصح رفعه .\nوالظاهر أن الآية عامة في كل من فارق دين الله وكان مخالفا له ، فإن الله بعث رسوله بالهدى ودين الحق ليظهره على الدين كله ، وشرعه واحد لا اختلاف فيه ولا افتراق ، فمن اختلف فيه ( وكانوا شيعا ) أي : فرقا كأهل الملل والنحل - وهي الأهواء والضلالات - فالله قد برأ رسوله مما هم فيه . وهذه الآية كقوله تعالى : ( شرع لكم من الدين ما وصى به نوحا والذي أوحينا إليك وما وصينا به إبراهيم وموسى وعيسى أن أقيموا الدين ولا تتفرقوا فيه ) الآية [ الشورى : 13 ] ، وفي الحديث : \" نحن معاشر الأنبياء أولاد علات ، ديننا واحد \"\nفهذا هو الصراط المستقيم ، وهو ما جاءت به الرسل ، من عبادة الله وحده لا شريك له ، والتمسك بشريعة الرسول المتأخر ، وما خالف ذلك فضلالات وجهالات وآراء وأهواء ، الرسل برآء منها ، كما قال : ( لست منهم في شيء ) .\nوقوله : ( إنما أمرهم إلى الله ثم ينبئهم بما كانوا يفعلون ) كقوله ( إن الذين آمنوا والذين هادوا والصابئين والنصارى والمجوس والذين أشركوا إن الله يفصل بينهم يوم القيامة إن الله على كل شيء شهيد ) [ الحج : 17 ] ، ثم بين فضله يوم القيامة في حكمه وعدله فقال :\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗا لَّسۡتَ مِنۡهُمۡ فِي شَيۡءٍۚ إِنَّمَآ أَمۡرُهُمۡ إِلَى ٱللَّهِ ثُمَّ يُنَبِّئُهُم بِمَا كَانُواْ يَفۡعَلُونَ ٩٥١\n                                    \n                                    \n                                    قوله تعالى إن الذين فرقوا دينهم وكانوا شيعا لست منهم في شيء إنما أمرهم إلى الله ثم ينبئهم بما كانوا يفعلون\nقوله تعالى إن الذين فرقوا دينهم قرأه حمزة والكسائي ( فارقوا ) بالألف ، وهي قراءة علي بن أبي طالب كرم الله وجهه ; من المفارقة والفراق . على معنى أنهم تركوا دينهم وخرجوا عنه . وكان علي يقول : والله ما فرقوه ولكن فارقوه . وقرأ الباقون بالتشديد ; إلا النخعي فإنه قرأ ( فرقوا ) مخففا ; أي آمنوا ببعض وكفروا ببعض . والمراد اليهود والنصارى في قول مجاهد وقتادة والسدي والضحاك . وقد وصفوا بالتفرق ; قال الله تعالى : وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة . وقال : ويريدون أن يفرقوا بين الله ورسله . وقيل : عنى المشركين ، عبد بعضهم الصنم وبعضهم الملائكة . وقيل : الآية عامة في جميع الكفار . وكل من ابتدع وجاء بما لم يأمر الله عز وجل به فقد فرق دينه . وروى أبو هريرة عن النبي صلى الله عليه وسلم في هذه الآية إن الذين فرقوا دينهم هم أهل البدع والشبهات ، وأهل الضلالة من هذه الأمة . وروى بقية بن الوليد حدثنا شعبة بن الحجاج حدثنا مجالد عن الشعبي عن شريح عن عمر بن الخطاب رضي الله عنه أن رسول الله صلى الله عليه وسلم قال لعائشة : إن الذين فرقوا دينهم وكانوا شيعا إنما هم أصحاب البدع وأصحاب الأهواء وأصحاب الضلالة من هذه الأمة ، يا عائشة إن لكل صاحب ذنب توبة غير أصحاب البدع وأصحاب الأهواء ليس لهم توبة وأنا بريء منهم وهم منا برآء . وروى ليث بن أبي سليم عن طاوس عن أبي هريرة أن النبي صلى الله عليه وسلم قرأ ( إن الذين فارقوا دينهم ) .\nومعنى شيعا فرقا وأحزابا . وكل قوم أمرهم واحد يتبع بعضهم رأي بعض فهم شيع .\nلست منهم في شيء فأوجب براءته منهم ; وهو كقوله عليه السلام : من غشنا فليس منا أي نحن برآء منه . وقال الشاعر :\nإذا حاولت في أسد فجورا فإني لست منك ولست مني\nأي أنا أبرأ منك . وموضع في شيء نصب على الحال من المضمر الذي في الخبر ; قاله أبو علي . وقال الفراء هو على حذف مضاف . المعنى : لست من عقابهم في شيء ، وإنما عليك الإنذار .\nإنما أمرهم إلى الله تعزية للنبي صلى الله عليه وسلم .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗا لَّسۡتَ مِنۡهُمۡ فِي شَيۡءٍۚ إِنَّمَآ أَمۡرُهُمۡ إِلَى ٱللَّهِ ثُمَّ يُنَبِّئُهُم بِمَا كَانُواْ يَفۡعَلُونَ ٩٥١\n                                        \n                                        \n                                        \n                                        يتوعد تعالى الذين فرقوا دينهم، أي: شتتوه وتفرقوا فيه، وكلٌّ أخذ لنفسه نصيبا من الأسماء التي لا تفيد الإنسان في دينه شيئا، كاليهودية والنصرانية والمجوسية. أو لا يكمل بها إيمانه، بأن يأخذ من الشريعة شيئا ويجعله دينه، ويدع مثله، أو ما هو أولى منه، كما هو حال أهل الفرقة من أهل البدع والضلال والمفرقين للأُمة. ودلت الآية الكريمة أن الدين يأمر بالاجتماع والائتلاف، وينهى عن التفرق والاختلاف في أهل الدين، وفي سائر مسائله الأصولية والفروعية. وأمره أن يتبرأ ممن فرقوا دينهم فقال: { لَسْتَ مِنْهُمْ فِي شَيْءٍ } أي لست منهم وليسوا منك، لأنهم خالفوك وعاندوك. { إِنَّمَا أَمْرُهُمْ إِلَى اللَّهِ } يردون إليه فيجازيهم بأعمالهم { ثُمَّ يُنَبِّئُهُمْ بِمَا كَانُوا يَفْعَلُونَ }\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗا لَّسۡتَ مِنۡهُمۡ فِي شَيۡءٍۚ إِنَّمَآ أَمۡرُهُمۡ إِلَى ٱللَّهِ ثُمَّ يُنَبِّئُهُم بِمَا كَانُواْ يَفۡعَلُونَ ٩٥١"
    },
    {
      "number": 949,
      "text": "مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا ۖ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَىٰ إِلَّا مِثْلَهَا وَهُمْ لَا يُظْلَمُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 160,
      "juz": 8,
      "manzil": 2,
      "page": 150,
      "ruku": 121,
      "hizbQuarter": 60,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ عَشۡرُ أَمۡثَالِهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَا وَهُمۡ لَا يُظۡلَمُونَ ٠٦١\n                                    \n                                    \n                                    وهذه الآية الكريمة مفصلة لما أجمل في الآية الأخرى ، وهي قوله : ( من جاء بالحسنة فله خير منها ) [ النمل : 89 ] ، وقد وردت الأحاديث مطابقة لهذه الآية ، كما قال الإمام أحمد بن حنبل ، رحمه الله :\nحدثنا عفان ، حدثنا جعفر بن سليمان ، حدثنا الجعد أبو عثمان ، عن أبي رجاء العطاردي ، عن ابن عباس ، رضي الله عنهما ، عن رسول الله صلى الله عليه وسلم ، فيما يروي عن ربه ، عز وجل قال : قال رسول الله صلى الله عليه وسلم : \" إن ربكم عز وجل رحيم ، من هم بحسنة فلم يعملها كتبت له حسنة ، فإن عملها كتبت له عشرا إلى سبعمائة ، إلى أضعاف كثيرة . ومن هم بسيئة فلم يعملها كتبت له حسنة ، فإن عملها كتبت له واحدة ، أو يمحوها الله ، عز وجل ، ولا يهلك على الله إلا هالك \"\nورواه البخاري ، ومسلم ، والنسائي ، من حديث الجعد بن أبي عثمان ، به .\nوقال الإمام أحمد أيضا : حدثنا معاوية ، حدثنا الأعمش ، عن المعرور بن سويد ، عن أبي ذر ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" يقول الله ، عز وجل : من عمل حسنة فله عشر أمثالها وأزيد . ومن عمل سيئة فجزاؤها مثلها أو أغفر . ومن عمل قراب الأرض خطيئة ثم لقيني لا يشرك بي شيئا جعلت له مثلها مغفرة . ومن اقترب إلي شبرا اقتربت إليه ذراعا ، ومن اقترب إلي ذراعا اقتربت إليه باعا ، ومن أتاني يمشي أتيته هرولة \"\nورواه مسلم عن أبي كريب ، عن أبي معاوية ، به . وعن أبي بكر بن أبي شيبة ، عن وكيع ، عن الأعمش ، به . ورواه ابن ماجه ، عن علي بن محمد الطنافسي ، عن وكيع ، به .\nوقال الحافظ أبو يعلى الموصلي : حدثنا شيبان ، حدثنا حماد ، حدثنا ثابت ، عن أنس بن مالك ، رضي الله عنه ، أن رسول الله صلى الله عليه وسلم قال : \" من هم بحسنة فلم يعملها كتبت له حسنة ، فإن عملها كتبت له عشرا . ومن هم بسيئة فلم يعملها لم يكتب عليه شيء ، فإن عملها كتبت عليه سيئة واحدة \"\nواعلم أن تارك السيئة الذي لا يعملها على ثلاثة أقسام : تارة يتركها لله عز وجل فهذا تكتب له حسنة على كفه عنها لله تعالى ، وهذا عمل ونية; ولهذا جاء أنه يكتب له حسنة ، كما جاء في بعض ألفاظ الصحيح : \" فإنما تركها من جرائي \" أي : من أجلي . وتارة يتركها نسيانا وذهولا عنها ، فهذا لا له ولا عليه; لأنه لم ينو خيرا ولا فعل شرا . وتارة يتركها عجزا وكسلا بعد السعي في أسبابها والتلبس بما يقرب منها ، فهذا يتنزل منزلة فاعلها ، كما جاء في الحديث ، في الصحيحين : \" إذا تواجه المسلمان بسيفيهما فالقاتل والمقتول في النار \" قالوا : يا رسول الله ، هذا القاتل ، فما بال المقتول؟ قال : \" إنه كان حريصا على قتل صاحبه \"\nقال الإمام أبو يعلى الموصلي : حدثنا مجاهد بن موسى ، حدثنا علي - وحدثنا الحسن بن الصباح وأبو خيثمة - قالا حدثنا إسحاق بن سليمان ، كلاهما عن موسى بن عبيدة ، عن أبي بكر بن عبيد الله بن أنس ، عن جده أنس قال : قال رسول الله صلى الله عليه وسلم : \" من هم بحسنة كتب الله له حسنة ، فإن عملها كتبت له عشرا . ومن هم بسيئة لم تكتب عليه حتى يعملها ، فإن عملها كتبت عليه سيئة ، فإن تركها كتبت له حسنة . يقول الله تعالى : إنما تركها من مخافتي \"\nهذا لفظ حديث مجاهد - يعني ابن موسى .\nوقال الإمام أحمد : حدثنا عبد الرحمن بن مهدي ، حدثنا شيبان بن عبد الرحمن ، عن الركين بن الربيع ، عن أبيه ، عن عمه فلان بن عميلة ، عن خريم بن فاتك الأسدي ; أن النبي صلى الله عليه وسلم قال : \" الناس أربعة ، والأعمال ستة . فالناس موسع له في الدنيا والآخرة ، وموسع له في الدنيا مقتور عليه في الآخرة ، ومقتور عليه في الدنيا موسع له في الآخرة ، وشقي في الدنيا والآخرة . والأعمال موجبتان ، ومثل بمثل ، وعشرة أضعاف ، وسبعمائة ضعف; فالموجبتان من مات مسلما مؤمنا لا يشرك بالله شيئا وجبت له الجنة ، ومن مات كافرا وجبت له النار . ومن هم بحسنة فلم يعملها ، فعلم الله أنه قد أشعرها قلبه وحرص عليها ، كتبت له حسنة . ومن هم بسيئة لم تكتب عليه ، ومن عملها كتبت واحدة ولم تضاعف عليه . ومن عمل حسنة كانت عليه بعشرة أمثالها . ومن أنفق نفقة في سبيل الله ، عز وجل ، كانت له بسبعمائة ضعف \"\nورواه الترمذي والنسائي ، من حديث الركين بن الربيع ، عن أبيه ، عن بشير بن عميلة ، عن خريم بن فاتك ، به ببعضه . والله أعلم .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا عبيد الله بن عمر القواريري ، حدثنا يزيد بن زريع ، حدثنا حبيب المعلم ، عن عمرو بن شعيب ، عن أبيه ، عن جده ، عن النبي صلى الله عليه وسلم قال : \" يحضر الجمعة ثلاثة نفر : رجل حضرها بلغو فهو حظه منها ، ورجل حضرها بدعاء ، فهو رجل دعا الله ، فإن شاء أعطاه ، وإن شاء منعه ، ورجل حضرها بإنصات وسكوت ولم يتخط رقبة مسلم ولم يؤذ أحدا ، فهي كفارة له إلى الجمعة التي تليها وزيادة ثلاثة أيام; وذلك لأن الله يقول : ( من جاء بالحسنة فله عشر أمثالها ) .\nوقال الحافظ أبو القاسم الطبراني : حدثنا هاشم بن مرثد ، حدثنا محمد بن إسماعيل ، حدثني أبي ، حدثني ضمضم بن زرعة ، عن شريح بن عبيد ، عن أبي مالك الأشعري قال : قال رسول الله صلى الله عليه وسلم : \" الجمعة كفارة لما بينها وبين الجمعة التي تليها وزيادة ثلاثة أيام; وذلك لأن الله تعالى قال : ( من جاء بالحسنة فله عشر أمثالها ) .\nوعن أبي ذر ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" من صام ثلاثة أيام من كل شهر فقد صام الدهر كله \"\nرواه الإمام أحمد - وهذا لفظه - والنسائي ، وابن ماجه ، والترمذي وزاد : \" فأنزل الله تصديق ذلك في كتابه : ( من جاء بالحسنة فله عشر أمثالها ) اليوم بعشرة أيام \" ، ثم قال : هذا حديث حسن .\nوقال ابن مسعود : ( من جاء بالحسنة فله عشر أمثالها ) من جاء ب \" لا إله إلا الله \" ، ( ومن جاء بالسيئة ) يقول : بالشرك .\nوهكذا ورد عن جماعة من السلف .\nوقد ورد فيه حديث مرفوع - الله أعلم بصحته ، لكني لم أره من وجه يثبت - والأحاديث والآثار في هذا كثيرة جدا ، وفيما ذكر كفاية ، إن شاء الله ، وبه الثقة .\n                                    ",
        "qortoby": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ عَشۡرُ أَمۡثَالِهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَا وَهُمۡ لَا يُظۡلَمُونَ ٠٦١\n                                    \n                                    \n                                    قوله تعالى من جاء بالحسنة فله عشر أمثالها ومن جاء بالسيئة فلا يجزى إلا مثلها وهم لا يظلمون\nقوله تعالى من جاء بالحسنة ابتداء ، وهو شرط ، والجواب فله عشر أمثالها أي فله عشر حسنات أمثالها فحذفت الحسنات وأقيمت الأمثال التي هي صفتها مقامها ; جمع مثل وحكى سيبويه : عندي عشرة نسابات ، أي عندي عشرة رجال نسابات . وقال أبو علي : حسن التأنيث في عشر أمثالها لما كان الأمثال مضافا إلى مؤنث ، والإضافة إلى المؤنث إذا كان إياه في المعنى يحسن فيه ذلك ; نحو \" تلتقطه بعض السيارة \" . وذهبت بعض أصابعه . وقرأ الحسن وسعيد بن جبير والأعمش ( فله عشر أمثالها ) والتقدير : فله عشر حسنات أمثالها ، أي له من الجزاء عشرة أضعاف مما يجب له . ويجوز أن يكون له مثل ، ويضاعف المثل فيصير عشرة . والحسنة هنا : الإيمان . أي من جاء بشهادة أن لا إله إلا الله فله بكل عمل عمله في الدنيا من الخير عشرة أمثاله من الثواب .\nومن جاء بالسيئة يعني الشرك فلا يجزى إلا مثلها وهو الخلود في النار ; لأن الشرك أعظم الذنوب ، والنار أعظم العقوبة ; فذلك قوله تعالى : جزاء وفاقا يعني جزاء وافق العمل . وأما الحسنة فبخلاف ذلك ; لنص الله تعالى على ذلك . وفي الخبر الحسنة بعشر أمثالها وأزيد والسيئة واحدة وأغفر فالويل لمن غلبت آحاده أعشاره . وروى الأعمش عن أبي صالح قال : الحسنة لا إله إلا الله والسيئة الشرك .\nوهم لا يظلمون أي لا ينقص ثواب أعمالهم . وقد مضى في \" البقرة \" بيان هذه الآية ، وأنها مخالفة للإنفاق في سبيل الله ; ولهذا قال بعض العلماء : العشر لسائر الحسنات ; والسبعمائة للنفقة في سبيل الله ، والخاص والعام فيه سواء . وقال بعضهم : يكون للعوام عشرة وللخواص سبعمائة وأكثر إلى ما لا يحصى ; وهذا يحتاج إلى توقيف . والأول أصح ; لحديث خريم بن فاتك عن النبي صلى الله عليه وسلم ، وفيه : وأما حسنة بعشر فمن عمل حسنة فله عشر أمثالها وأما حسنة بسبعمائة فالنفقة في سبيل الله .\n                                    ",
        "saadi": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ عَشۡرُ أَمۡثَالِهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَا وَهُمۡ لَا يُظۡلَمُونَ ٠٦١\n                                        \n                                        \n                                        \n                                        ثم ذكر صفة الجزاء فقال: { مَنْ جَاءَ بِالْحَسَنَةِ } القولية والفعلية، الظاهرة والباطنة، المتعلقة بحق الله أو حق خلقه { فَلَهُ عَشْرُ أَمْثَالِهَا } هذا أقل ما يكون من التضعيف. { وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى إِلَّا مِثْلَهَا } وهذا من تمام عدله تعالى وإحسانه، وأنه لا يظلم مثقال ذرة، ولهذا قال: { وَهُمْ لَا يُظْلَمُونَ }\n                                    "
      },
      "originalText": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ عَشۡرُ أَمۡثَالِهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَا وَهُمۡ لَا يُظۡلَمُونَ ٠٦١"
    },
    {
      "number": 950,
      "text": "قُلْ إِنَّنِي هَدَانِي رَبِّي إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ دِينًا قِيَمًا مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۚ وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 161,
      "juz": 8,
      "manzil": 2,
      "page": 150,
      "ruku": 121,
      "hizbQuarter": 60,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ إِنَّنِي هَدَىٰنِي رَبِّيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ دِينٗا قِيَمٗا مِّلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۚ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ١٦١\n                                    \n                                    \n                                    يقول الله تعالى آمرا نبيه صلى الله عليه وسلم سيد المرسلين أن يخبر بما أنعم الله به عليه من الهداية إلى صراطه المستقيم ، الذي لا اعوجاج فيه ولا انحراف : ( دينا قيما ) أي : قائما ثابتا ، ( ملة إبراهيم حنيفا وما كان من المشركين ) كقوله ( ومن يرغب عن ملة إبراهيم إلا من سفه نفسه ) [ البقرة : 130 ] ، وقوله ( وجاهدوا في الله حق جهاده هو اجتباكم وما جعل عليكم في الدين من حرج ملة أبيكم إبراهيم ) [ الحج : 78 ] ، وقوله : ( إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين شاكرا لأنعمه اجتباه وهداه إلى صراط مستقيم وآتيناه في الدنيا حسنة وإنه في الآخرة لمن الصالحين ثم أوحينا إليك أن اتبع ملة إبراهيم حنيفا وما كان من المشركين ) [ النحل : 120 123 ] .\nوليس يلزم من كونه عليه السلام أمر باتباع ملة إبراهيم الحنيفية أن يكون إبراهيم أكمل منه فيها; لأنه عليه السلام قام بها قياما عظيما ، وأكملت له إكمالا تاما لم يسبقه أحد إلى هذا الكمال; ولهذا كان خاتم الأنبياء ، وسيد ولد آدم على الإطلاق ، وصاحب المقام المحمود الذي يرهب إليه الخلق حتى إبراهيم الخليل ، عليه السلام .\nوقد قال ابن مردويه : حدثنا محمد بن عبد الله بن حفص ، حدثنا أحمد بن عصام ، حدثنا أبو داود الطيالسي ، حدثنا شعبة ، أنبأنا سلمة بن كهيل ، سمعت ذر بن عبد الله الهمداني ، يحدث عن ابن أبزى ، عن أبيه قال : كان رسول الله صلى الله عليه وسلم إذا أصبح قال : \" أصبحنا على ملة الإسلام ، وكلمة الإخلاص ، ودين نبينا محمد ، وملة أبينا إبراهيم حنيفا وما كان من المشركين \" .\nوقال الإمام أحمد : حدثنا يزيد ، أخبرنا محمد بن إسحاق ، عن داود بن الحصين ، عن عكرمة ، عن ابن عباس قال : قيل لرسول الله صلى الله عليه وسلم : أي الأديان أحب إلى الله؟ قال : \" الحنيفية السمحة \" .\nوقال الإمام أحمد أيضا : حدثنا سليمان بن داود ، حدثنا عبد الرحمن بن أبي الزناد ، عن هشام بن عروة ، عن أبيه ، عن عائشة ، رضي الله عنها ، قالت : وضع رسول الله صلى الله عليه وسلم ذقني على منكبه ، لأنظر إلى زفن الحبشة ، حتى كنت التي مللت فانصرفت عنه .\nقال عبد الرحمن ، عن أبيه قال : قال لي عروة : إن عائشة قالت : قال رسول الله صلى الله عليه وسلم يومئذ : \" لتعلم يهود أن في ديننا فسحة ، إني أرسلت بحنيفية سمحة .\nأصل الحديث مخرج في الصحيحين ، والزيادة لها شواهد من طرق عدة ، وقد استقصيت طرقها في شرح البخاري ، ولله الحمد والمنة .\n                                    ",
        "qortoby": "قُلۡ إِنَّنِي هَدَىٰنِي رَبِّيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ دِينٗا قِيَمٗا مِّلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۚ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ١٦١\n                                    \n                                    \n                                    قوله تعالى قل إنني هداني ربي إلى صراط مستقيم دينا قيما ملة إبراهيم حنيفا وما كان من المشركين\nقوله تعالى قل إنني هداني ربي إلى صراط مستقيم لما بين تعالى أن الكفار تفرقوا بين أن الله هداه إلى الدين المستقيم وهو دين إبراهيم\nدينا نصب على الحال ; عن قطرب . وقيل : نصب ب هداني عن الأخفش . قال غيره : انتصب حملا على المعنى لأن معنى هداني عرفني دينا . ويجوز أن يكون بدلا من الصراط ، أي هداني صراطا مستقيما دينا . وقيل : منصوب بإضمار فعل ; فكأنه قال : اتبعوا دينا ، واعرفوا دينا .\nقيما قرأه الكوفيون وابن عامر بكسر القاف والتخفيف وفتح الياء ، مصدر كالشبع فوصف به . والباقون بفتح القاف وكسر الياء وشدها ، وهما لغتان . وأصل الياء الواو \" قيوم \" ثم أدغمت الواو في الياء كميت .\nومعناه دينا مستقيما لا عوج فيه .\nملة إبراهيم بدل حنيفا قال الزجاج : هو حال من إبراهيم . وقال علي بن سليمان : هو نصب بإضمار : أعني .\n                                    ",
        "saadi": "قُلۡ إِنَّنِي هَدَىٰنِي رَبِّيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ دِينٗا قِيَمٗا مِّلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۚ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ١٦١\n                                        \n                                        \n                                        \n                                        يأمر تعالى نبيه صلى الله عليه وسلم، أن يقول ويعلن بما هو عليه من الهداية إلى الصراط المستقيم: الدين المعتدل المتضمن للعقائد النافعة، والأعمال الصالحة، والأمر بكل حسن، والنهي عن كل قبيح، الذي عليه الأنبياء والمرسلون، خصوصا إمام الحنفاء، ووالد من بعث من بعد موته من الأنبياء، خليل الرحمن إبراهيم عليه الصلاة والسلام، وهو الدين الحنيف المائل عن كل دين غير مستقيم، من أديان أهل الانحراف، كاليهود والنصارى والمشركين.\n                                    "
      },
      "originalText": "قُلۡ إِنَّنِي هَدَىٰنِي رَبِّيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ دِينٗا قِيَمٗا مِّلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۚ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ١٦١"
    },
    {
      "number": 951,
      "text": "قُلْ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 162,
      "juz": 8,
      "manzil": 2,
      "page": 150,
      "ruku": 121,
      "hizbQuarter": 60,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ إِنَّ صَلَاتِي وَنُسُكِي وَمَحۡيَايَ وَمَمَاتِي لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ ٢٦١\n                                    \n                                    \n                                    قوله تعالى : ( قل إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين ) يأمره تعالى أن يخبر المشركين الذين يعبدون غير الله ويذبحون لغير اسمه ، أنه مخالف لهم في ذلك ، فإن صلاته لله ونسكه على اسمه وحده لا شريك له ، وهذا كقوله تعالى : ( فصل لربك وانحر ) [ الكوثر : 2 ] أي : أخلص له صلاتك وذبيحتك ، فإن المشركين كانوا يعبدون الأصنام ويذبحون لها ، فأمره الله تعالى بمخالفتهم والانحراف عما هم فيه ، والإقبال بالقصد والنية والعزم على الإخلاص لله تعالى .\nقال مجاهد في قوله : ( إن صلاتي ونسكي ) قال : النسك الذبح في الحج والعمرة .\nوقال الثوري ، عن السدي عن سعيد بن جبير : ( ونسكي ) قال : ذبحي . وكذا قال السدي والضحاك .\nوقال ابن أبي حاتم : حدثنا محمد بن عوف ، حدثنا أحمد بن خالد الوهبي ، حدثنا محمد بن إسحاق ، عن زيد بن أبي حبيب ، عن ابن عباس ، عن جابر بن عبد الله قال : ضحى رسول الله صلى الله عليه وسلم في يوم عيد بكبشين وقال حين ذبحهما : \" وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين ، ( إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين ) .\n                                    ",
        "qortoby": "قُلۡ إِنَّ صَلَاتِي وَنُسُكِي وَمَحۡيَايَ وَمَمَاتِي لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ ٢٦١\n                                    \n                                    \n                                    قوله تعالى قل إن صلاتي ونسكي قد تقدم اشتقاق لفظ الصلاة . وقيل : المراد بها هنا صلاة الليل . وقيل : صلاة العيد . والنسك جمع نسيكة ، وهي الذبيحة ، وكذلك قال مجاهد والضحاك وسعيد بن جبير وغيرهم . والمعنى : ذبحي في الحج والعمرة . وقال الحسن : نسكي ديني . وقال الزجاج : عبادتي ; ومنه الناسك الذي يتقرب إلى الله بالعبادة . وقال قوم : النسك في هذه الآية جميع أعمال البر والطاعات ; من قولك نسك فلان فهو ناسك ، إذا تعبد .\nومحياي أي ما أعمله في حياتي ومماتي أي ما أوصي به بعد وفاتي .\nلله رب العالمين أي أفرده بالتقرب بها إليه . وقيل : ومحياي ومماتي لله أي حياتي وموتي له . وقرأ الحسن : ( نسكي ) بإسكان السين . وأهل المدينة ( ومحياي ) بسكون الياء في الإدراج . والعامة بفتحها ; لأنه لا يجتمع ساكنان . قال النحاس : لم يجزه أحد من النحويين إلا يونس ، وإنما أجازه لأن قبله ألفا ، والألف المدة التي فيها تقوم مقام الحركة . وأجاز يونس اضربان زيدا ، وإنما منع النحويون هذا لأنه جمع بين ساكنين وليس في الثاني إدغام ، ومن قرأ بقراءة أهل المدينة وأراد أن يسلم من اللحن وقف على محياي فيكون غير لاحن عند جميع النحويين . وقرأ ابن أبي إسحاق وعيسى بن عمر وعاصم الجحدري ( ومحيي ) بتشديد الياء الثانية من غير ألف ; وهي لغة عليا مضر يقولون : قفي وعصي . وأنشد أهل اللغة :\nسبقوا هوي وأعنقوا لهواهم\nوقد تقدم .\nقال إلكيا الطبري : قوله تعالى : قل إنني هداني ربي إلى صراط مستقيم إلى قوله : قل إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين استدل به الشافعي على افتتاح الصلاة بهذا الذكر ; فإن الله أمر نبيه صلى الله عليه وسلم وأنزله في كتابه ، ثم ذكر حديث علي رضي الله عنه أن النبي صلى الله عليه وسلم كان إذا افتتح الصلاة قال : وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين . إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين . إلى قوله : وأنا من المسلمين . قلت : روى مسلم في صحيحه عن علي بن أبي طالب عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة قال : وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين . إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين . اللهم أنت الملك لا إله إلا أنت ، أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك والخير كله في يديك والشر ليس إليك . تباركت وتعاليت . أستغفرك وأتوب إليك الحديث . وأخرجه الدارقطني وقال في آخره : بلغنا عن النضر بن شميل وكان من العلماء باللغة وغيرها قال : معنى قول رسول الله صلى الله عليه وسلم والشر ليس إليك الشر ليس مما يتقرب به إليك . قال مالك : ليس التوجيه في الصلاة بواجب على الناس ، والواجب عليهم التكبير ثم القراءة . قال ابن القاسم : لم ير مالك هذا الذي يقوله الناس قبل القراءة : سبحانك اللهم وبحمدك . وفي مختصر ما ليس في المختصر : أن مالكا كان يقوله في خاصة نفسه ; لصحة الحديث به ، وكان لا يراه للناس مخافة أن يعتقدوا وجوبه . قال أبو الفرج الجوزي : وكنت أصلي وراء شيخنا أبي بكر الدينوري الفقيه في زمان الصبا ، فرآني مرة أفعل هذا فقال : يا بني ، إن الفقهاء قد اختلفوا في وجوب قراءة الفاتحة خلف الإمام ، ولم يختلفوا أن الافتتاح سنة ، فاشتغل بالواجب ودع السنن . والحجة لمالك قوله صلى الله عليه وسلم للأعرابي الذي علمه الصلاة : إذا قمت إلى الصلاة فكبر ثم اقرأ ولم يقل له سبح كما يقول أبو حنيفة ، ولا قل وجهت وجهي ، كما يقول الشافعي . وقال لأبي : كيف تقرأ إذا افتتحت الصلاة ؟ قال : قلت الله أكبر ، الحمد لله رب العالمين فلم يذكر توجيها ولا تسبيحا . فإن قيل : فإن عليا قد أخبر أن النبي صلى الله عليه وسلم كان يقوله . قلنا : يحتمل أن يكون قاله قبل التكبير ثم كبر ، وذلك حسن عندنا . فإن قيل : فقد روى النسائي والدارقطني أن النبي صلى الله عليه وسلم كان إذا افتتح الصلاة كبر ثم يقول : إن صلاتي ونسكي الحديث قلنا : هذا نحمله على النافلة في صلاة الليل ; كما جاء في كتاب النسائي عن أبي سعيد قال كان رسول الله صلى الله عليه وسلم إذا افتتح الصلاة بالليل قال : سبحانك اللهم وبحمدك تبارك اسمك وتعالى جدك ولا إله غيرك . أو في النافلة مطلقا ; فإن النافلة أخف من الفرض ; لأنه يجوز أن يصليها قائما وقاعدا وراكبا ، وإلى القبلة وغيرها في السفر ، فأمرها أيسر .\n                                    ",
        "saadi": "قُلۡ إِنَّ صَلَاتِي وَنُسُكِي وَمَحۡيَايَ وَمَمَاتِي لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ ٢٦١\n                                        \n                                        \n                                        \n                                        { قُلْ إِنَّ صَلَاتِي وَنُسُكِي } أي: ذبحي، وذلك لشرف هاتين العبادتين وفضلهما، ودلالتهما على محبة الله تعالى، وإخلاص الدين له، والتقرب إليه بالقلب واللسان، والجوارح وبالذبح الذي هو بذل ما تحبه النفس من المال، لما هو أحب إليها وهو الله تعالى. ومن أخلص في صلاته ونسكه، استلزم ذلك إخلاصه لله في سائر أعماله. وقوله: { وَمَحْيَايَ وَمَمَاتِي } أي: ما آتيه في حياتي، وما يجريه الله عليَّ، وما يقدر عليَّ في مماتي، الجميع { لِلَّهِ رَبِّ الْعَالَمِينَ }\n\n                                    "
      },
      "originalText": "قُلۡ إِنَّ صَلَاتِي وَنُسُكِي وَمَحۡيَايَ وَمَمَاتِي لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ ٢٦١"
    },
    {
      "number": 952,
      "text": "لَا شَرِيكَ لَهُ ۖ وَبِذَٰلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 163,
      "juz": 8,
      "manzil": 2,
      "page": 150,
      "ruku": 121,
      "hizbQuarter": 60,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَا شَرِيكَ لَهُۥۖ وَبِذَٰلِكَ أُمِرۡتُ وَأَنَا۠ أَوَّلُ ٱلۡمُسۡلِمِينَ ٣٦١\n                                    \n                                    \n                                    وقوله : ( وأنا أول المسلمين ) قال قتادة : أي من هذه الأمة .\nوهو كما قال ، فإن جميع الأنبياء قبله كلهم كانت دعوتهم إلى الإسلام ، وأصله عبادة الله وحده لا شريك له ، كما قال : ( وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون ) [ الأنبياء : 25 ] ، وقد أخبر تعالى عن نوح أنه قال لقومه : ( فإن توليتم فما سألتكم من أجر إن أجري إلا على الله وأمرت أن أكون من المسلمين ) [ يونس : 72 ] ، وقال تعالى : ( ومن يرغب عن ملة إبراهيم إلا من سفه نفسه ولقد اصطفيناه في الدنيا وإنه في الآخرة لمن الصالحين إذ قال له ربه أسلم قال أسلمت لرب العالمين ووصى بها إبراهيم بنيه ويعقوب يا بني إن الله اصطفى لكم الدين فلا تموتن إلا وأنتم مسلمون ) [ البقرة : 130 - 132 ] ، وقال يوسف ، عليه السلام : ( رب قد آتيتني من الملك وعلمتني من تأويل الأحاديث فاطر السماوات والأرض أنت وليي في الدنيا والآخرة توفني مسلما وألحقني بالصالحين ) [ يوسف : 101 ] ، وقال موسى ( يا قوم إن كنتم آمنتم بالله فعليه توكلوا إن كنتم مسلمين فقالوا على الله توكلنا ربنا لا تجعلنا فتنة للقوم الظالمين ونجنا برحمتك من القوم الكافرين ) [ يونس : 84 - 86 ] ، وقال تعالى : ( إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا للذين هادوا والربانيون والأحبار بما استحفظوا من كتاب الله ) الآية [ المائدة : 44 ] ، وقال تعالى : ( وإذ أوحيت إلى الحواريين أن آمنوا بي وبرسولي قالوا آمنا واشهد بأننا مسلمون ) [ المائدة : 111 ] .\nفأخبر الله تعالى أنه بعث رسله بالإسلام ، ولكنهم متفاوتون فيه بحسب شرائعهم الخاصة التي ينسخ بعضها بعضا ، إلى أن نسخت بشريعة محمد صلى الله عليه وسلم التي لا تنسخ أبد الآبدين ، ولا تزال قائمة منصورة ، وأعلامها مشهورة إلى قيام الساعة; ولهذا قال عليه الصلاة والسلام : \" نحن معاشر الأنبياء أولاد علات ديننا واحد \" فإن أولاد العلات هم الإخوة من أب واحد وأمهات شتى ، فالدين واحد وهو عبادة الله وحده لا شريك له ، وإن تنوعت الشرائع التي هي بمنزلة الأمهات ، كما أن إخوة الأخياف عكس هذا ، بنو الأم الواحدة من آباء شتى ، والإخوة الأعيان الأشقاء من أب واحد وأم واحدة ، والله أعلم .\nوقد قال الإمام أحمد : حدثنا أبو سعيد ، حدثنا عبد العزيز بن عبد الله الماجشون ، حدثنا عبد الله بن الفضل الهاشمي ، عن الأعرج ، عن عبيد الله بن أبي رافع ، عن علي رضي الله عنه; أن رسول الله صلى الله عليه وسلم كان إذا كبر استفتح ، ثم قال : \" ( وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين ) [ الأنعام : 79 ] ، ( إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين ) اللهم أنت الملك ، لا إله إلا أنت ، أنت ربي وأنا عبدك ، ظلمت نفسي واعترفت بذنبي ، فاغفر لي ذنوبي جميعا ، لا يغفر الذنوب إلا أنت . واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت . واصرف عني سيئها لا يصرف عني سيئها إلا أنت . تباركت وتعاليت ، أستغفرك وأتوب إليك \" .\nثم ذكر تمام الحديث فيما يقوله في الركوع والسجود والتشهد . وقد رواه مسلم في صحيحه .\n                                    ",
        "qortoby": "لَا شَرِيكَ لَهُۥۖ وَبِذَٰلِكَ أُمِرۡتُ وَأَنَا۠ أَوَّلُ ٱلۡمُسۡلِمِينَ ٣٦١\n                                    \n                                    \n                                    وقد روى النسائي عن محمد بن مسلمة أن رسول الله صلى الله عليه وسلم كان إذا قام يصلي تطوعا قال : الله أكبر . وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين . إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين . لا شريك له وبذلك أمرت وأنا أول المسلمين . اللهم أنت الملك لا إله إلا أنت سبحانك وبحمدك ثم يقرأ . وهذا نص في التطوع لا في الواجب . وإن صح أن ذلك كان في الفريضة بعد التكبير ، فيحمل على الجواز والاستحباب ، وأما المسنون فالقراءة بعد التكبير ، والله بحقائق الأمور عليم . ثم إذا قاله فلا يقل : وأنا أول المسلمين وهي :\nالرابعة : إذ ليس أحدهم بأولهم إلا محمدا صلى الله عليه وسلم . فإن قيل : أوليس إبراهيم والنبيون قبله ؟ قلنا عنه ثلاثة أجوبة : الأول : أنه أول الخلق أجمع معنى ; كما في حديث أبي هريرة من قوله عليه السلام : نحن الآخرون الأولون يوم القيامة ونحن أول من يدخل الجنة . وفي حديث حذيفة نحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق . الثاني : أنه أولهم لكونه مقدما في الخلق عليهم ; قال الله تعالى : وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح . قال قتادة : إن النبي صلى الله عليه وسلم قال : كنت أول الأنبياء في الخلق وآخرهم في البعث . فلذلك وقع ذكره هنا مقدما قبل نوح وغيره . الثالث : أول المسلمين من أهل ملته ; قاله ابن العربي ، وهو قول قتادة وغيره .\nواختلفت الروايات في \" أول \" ففي بعضها ثبوتها وفي بعضها لا ، على ما ذكرنا . وروى عمران بن حصين قال قال رسول الله صلى الله عليه وسلم : يا فاطمة قومي فاشهدي أضحيتك فإنه يغفر لك في أول قطرة من دمها كل ذنب عملتيه ثم قولي : إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين . لا شريك له وبذلك أمرت وأنا أول المسلمين . قال عمران : يا رسول الله ، هذا لك ولأهل بيتك خاصة أم للمسلمين عامة ؟ قال : بل للمسلمين عامة .\n                                    ",
        "saadi": "لَا شَرِيكَ لَهُۥۖ وَبِذَٰلِكَ أُمِرۡتُ وَأَنَا۠ أَوَّلُ ٱلۡمُسۡلِمِينَ ٣٦١\n                                        \n                                        \n                                        \n                                        { لَا شَرِيكَ لَهُ } في العبادة، كما أنه ليس له شريك في الملك والتدبير، وليس هذا الإخلاص لله ابتداعا مني، وبدعا أتيته من تلقاء نفسي، بل { بِذَلِكَ أُمِرْتُ } أمرا حتما، لا أخرج من التبعة إلا بامتثاله { وَأَنَا أَوَّلُ الْمُسْلِمِينَ } من هذه الأمة.\n                                    "
      },
      "originalText": "لَا شَرِيكَ لَهُۥۖ وَبِذَٰلِكَ أُمِرۡتُ وَأَنَا۠ أَوَّلُ ٱلۡمُسۡلِمِينَ ٣٦١"
    },
    {
      "number": 953,
      "text": "قُلْ أَغَيْرَ اللَّهِ أَبْغِي رَبًّا وَهُوَ رَبُّ كُلِّ شَيْءٍ ۚ وَلَا تَكْسِبُ كُلُّ نَفْسٍ إِلَّا عَلَيْهَا ۚ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۚ ثُمَّ إِلَىٰ رَبِّكُمْ مَرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 164,
      "juz": 8,
      "manzil": 2,
      "page": 150,
      "ruku": 121,
      "hizbQuarter": 60,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ أَغَيۡرَ ٱللَّهِ أَبۡغِي رَبّٗا وَهُوَ رَبُّ كُلِّ شَيۡءٖۚ وَلَا تَكۡسِبُ كُلُّ نَفۡسٍ إِلَّا عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَيُنَبِّئُكُم بِمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٤٦١\n                                    \n                                    \n                                    يقول تعالى : ( قل ) يا محمد لهؤلاء المشركين بالله في إخلاص العبادة له والتوكل عليه : ( أغير الله أبغي ربا ) أي : أطلب ربا سواه ، وهو رب كل شيء ، يربني ويحفظني ويكلؤني ويدبر أمري ، أي : لا أتوكل إلا عليه ، ولا أنيب إلا إليه; لأنه رب كل شيء ومليكه ، وله الخلق والأمر .\nهذه الآية فيها الأمر بإخلاص التوكل ، كما تضمنت الآية التي قبلها إخلاص العبادة له لا شريك له . وهذا المعنى يقرن بالآخر كثيرا في القرآن كما قال تعالى مرشدا لعباده أن يقولوا : ( إياك نعبد وإياك نستعين ) [ الفاتحة : 5 ] ، وقوله ( فاعبده وتوكل عليه ) [ هود : 123 ] ، وقوله ( قل هو الرحمن آمنا به وعليه توكلنا ) [ الملك : 29 ] ، وقوله ( رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا ) [ المزمل : 9 ] ، وأشباه ذلك من الآيات .\nوقوله : ( ولا تكسب كل نفس إلا عليها ولا تزر وازرة وزر أخرى ) إخبار عن الواقع يوم القيامة في جزاء الله تعالى وحكمه وعدله ، أن النفوس إنما تجازى بأعمالها إن خيرا فخير ، وإن شرا فشر ، وأنه لا يحمل من خطيئة أحد على أحد . وهذا من عدله تعالى ، كما قال : ( وإن تدع مثقلة إلى حملها لا يحمل منه شيء ولو كان ذا قربى ) [ فاطر : 18 ] ، وقوله ( فلا يخاف ظلما ولا هضما ) [ طه : 112 ] ، قال علماء التفسير : فلا يظلم بأن يحمل عليه سيئات غيره ، ولا يهضم بأن ينقص من حسناته . وقال تعالى : ( كل نفس بما كسبت رهينة إلا أصحاب اليمين ) [ المدثر : 38 ، 39 ] ، معناه : كل نفس مرتهنة بعملها السيئ إلا أصحاب اليمين ، فإنه قد تعود بركات أعمالهم الصالحة على ذراريهم ، كما قال في سورة الطور : ( والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء ) [ الآية : 21 ] ، أي : ألحقنا بهم ذرياتهم في المنزلة الرفيعة في الجنة ، وإن لم يكونوا قد شاركوهم في الأعمال ، بل في أصل الإيمان ، ( وما ألتناهم ) أي : أنقصنا أولئك السادة الرفعاء من أعمالهم شيئا حتى ساويناهم وهؤلاء الذين هم أنقص منهم منزلة ، بل رفعهم تعالى إلى منازل الآباء ببركة أعمالهم ، بفضله ومنته ثم قال : ( كل امرئ بما كسب رهين ) [ الطور : 21 ] ، أي : من شر .\nوقوله : ( ثم إلى ربكم مرجعكم فينبئكم بما كنتم فيه تختلفون ) أي : اعملوا على مكانتكم إنا عاملون على ما نحن عليه ، فستعرضون ونعرض عليه ، وينبئنا وإياكم بأعمالنا وأعمالكم ، وما كنا نختلف فيه في الدار الدنيا ، كما قال تعالى : ( قل لا تسألون عما أجرمنا ولا نسأل عما تعملون قل يجمع بيننا ربنا ثم يفتح بيننا بالحق وهو الفتاح العليم ) [ سبأ : 25 ، 26 ] .\n                                    ",
        "qortoby": "قُلۡ أَغَيۡرَ ٱللَّهِ أَبۡغِي رَبّٗا وَهُوَ رَبُّ كُلِّ شَيۡءٖۚ وَلَا تَكۡسِبُ كُلُّ نَفۡسٍ إِلَّا عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَيُنَبِّئُكُم بِمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٤٦١\n                                    \n                                    \n                                    قوله تعالى قل أغير الله أبغي ربا وهو رب كل شيء ولا تكسب كل نفس إلا عليها ولا تزر وازرة وزر أخرى ثم إلى ربكم مرجعكم فينبئكم بما كنتم فيه تختلفون\nقوله تعالى قل أغير الله أبغي ربا وهو رب كل شيء أي مالكه . روي أن الكفار قالوا للنبي صلى الله عليه وسلم : ارجع يا محمد إلى ديننا ، واعبد آلهتنا ، واترك ما أنت عليه ، ونحن نتكفل لك بكل تباعة تتوقعها في دنياك وآخرتك ; فنزلت الآية . وهي استفهام يقتضي التقرير والتوبيخ . و غير نصب ب أبغي و ربا تمييز .\nقوله تعالى ولا تكسب كل نفس إلا عليها فيه مسألتان :\nالأولى : قوله تعالى : ولا تكسب كل نفس إلا عليها أي لا ينفعني في ابتغاء رب غير الله كونكم على ذلك ; إذ لا تكسب كل نفس إلا عليها ; أي لا يؤخذ بما أتت من المعصية ، وركبت من الخطيئة سواها .\nالثانية : وقد استدل بعض العلماء من المخالفين بهذه الآية على أن بيع الفضولي لا يصح ، وهو قول الشافعي . وقال علماؤنا : المراد من الآية تحمل الثواب والعقاب دون أحكام الدنيا ، بدليل قوله تعالى : ولا تزر وازرة وزر أخرى على ما يأتي . وبيع الفضولي عندنا موقوف على إجازة المالك ، فإن أجازه جاز . هذا عروة البارقي قد باع للنبي صلى الله عليه وسلم واشترى وتصرف بغير أمره ، فأجازه النبي صلى الله عليه وسلم ; وبه قال أبو حنيفة . وروى البخاري والدارقطني عن عروة بن أبي الجعد قال عرض للنبي صلى الله عليه وسلم جلب فأعطاني دينارا وقال : أي عروة ايت الجلب فاشتر لنا شاة بهذا الدينار فأتيت الجلب فساومت فاشتريت شاتين بدينار ، فجئت أسوقهما - أو قال أقودهما - فلقيني رجل في الطريق فساومني فبعته إحدى الشاتين بدينار ، وجئت بالشاة الأخرى وبدينار ، فقلت : يا رسول الله ، هذه الشاة وهذا ديناركم . قال : كيف صنعت ؟ فحدثته الحديث . قال : اللهم بارك له في صفقة يمينه . قال : فلقد رأيتني أقف في كناسة الكوفة فأربح أربعين ألفا قبل أن أصل إلى أهلي لفظ الدارقطني . قال أبو عمر : وهو حديث جيد ، وفيه صحة ثبوت النبي صلى الله عليه وسلم للشاتين ، ولولا ذلك ما أخذ منه الدينار ولا أمضى له البيع . وفيه دليل على جواز الوكالة ، ولا خلاف فيها بين العلماء . فإذا قال الموكل لوكيله : اشتر كذا ; فاشترى زيادة على ما وكل به فهل يلزم ذلك الأمر أم لا ؟ . كرجل قال لرجل : اشتر بهذا الدرهم رطل لحم ، صفته كذا ; فاشترى له أربعة أرطال من تلك الصفة بذلك الدرهم . فالذي عليه مالك وأصحابه أن الجميع يلزمه إذا وافق الصفة ومن جنسها ; لأنه محسن . وهو قول أبي يوسف ومحمد بن الحسن . وقال أبو حنيفة : الزيادة للمشتري . وهذا الحديث حجة عليه .\nقوله تعالى ولا تزر وازرة وزر أخرى أي لا تحمل حاملة ثقل أخرى ، أي لا تؤخذ نفس بذنب غيرها ، بل كل نفس مأخوذة بجرمها ومعاقبة بإثمها . وأصل الوزر الثقل ; ومنه قوله تعالى : ووضعنا عنك وزرك . وهو هنا الذنب ; كما قال تعالى : وهم يحملون أوزارهم على ظهورهم . وقد تقدم . قال الأخفش : يقال وزر يوزر ، ووزر يزر ، ووزر يوزر وزرا . ويجوز إزرا ، كما يقال : إسادة . والآية نزلت في الوليد بن المغيرة ، كان يقول : اتبعوا سبيلي أحمل أوزاركم ; ذكره ابن عباس . وقيل : إنها نزلت ردا على العرب في الجاهلية من مؤاخذة الرجل بأبيه وبابنه وبجريرة حليفه .\nقلت : ويحتمل أن يكون المراد بهذه الآية في الآخرة ، وكذلك التي قبلها ; فأما التي في الدنيا فقد يؤاخذ فيها بعضهم بجرم بعض ، لا سيما إذا لم ينه الطائعون العاصين ، كما تقدم في حديث أبي بكر في قوله تعالى : عليكم أنفسكم . وقوله تعالى : واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة . إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم .\nوقالت زينب بنت جحش يا رسول الله ، أنهلك وفينا الصالحون ؟ قال : نعم إذا كثر الخبث . قال العلماء : معناه أولاد الزنى . والخبث \" بفتح الباء \" اسم للزنى . فأوجب الله تعالى على لسان رسوله صلى الله عليه وسلم دية الخطأ على العاقلة حتى لا يطل دم الحر المسلم تعظيما للدماء . وأجمع أهل العلم على ذلك من غير خلاف بينهم في ذلك ; فدل على ما قلناه . وقد يحتمل أن يكون هذا في الدنيا ، في ألا يؤاخذ زيد بفعل عمرو ، وأن كل مباشر لجريمة فعليه مغبتها . وروى أبو داود عن أبي رمثة قال انطلقت مع أبي نحو النبي صلى الله عليه وسلم ، ثم إن النبي صلى الله عليه وسلم قال لأبي : ابنك هذا ؟ قال : أي ورب الكعبة . قال : حقا . قال : أشهد به . قال : فتبسم النبي صلى الله عليه وسلم ضاحكا من ثبت شبهي في أبي ، ومن حلف أبي علي . ثم قال : أما إنه لا يجني عليك ولا تجني عليه . وقرأ رسول الله صلى الله عليه وسلم ولا تزر وازرة وزر أخرى . ولا يعارض ما قلناه أولا بقوله : وليحملن أثقالهم وأثقالا مع أثقالهم ; فإن هذا مبين في الآية الأخرى ، قوله : ليحملوا أوزارهم كاملة يوم القيامة ومن أوزار الذين يضلونهم بغير علم . فمن كان إماما في الضلالة ودعا إليها واتبع عليها فإنه يحمل وزر من أضله من غير أن ينقص من وزر المضل شيء ، على ما يأتي بيانه إن شاء الله تعالى .\n                                    ",
        "saadi": "قُلۡ أَغَيۡرَ ٱللَّهِ أَبۡغِي رَبّٗا وَهُوَ رَبُّ كُلِّ شَيۡءٖۚ وَلَا تَكۡسِبُ كُلُّ نَفۡسٍ إِلَّا عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَيُنَبِّئُكُم بِمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٤٦١\n                                        \n                                        \n                                        \n                                        { قُلْ أَغَيْرَ اللَّهِ } من المخلوقين { أَبْغِي رَبًّا } أي: يحسن ذلك ويليق بي، أن أتخذ غيره، مربيا ومدبرا والله رب كل شيء، فالخلق كلهم داخلون تحت ربوبيته، منقادون لأمره؟\". فتعين علي وعلى غيري، أن يتخذ الله ربا، ويرضى به، وألا يتعلق بأحد من المربوبين الفقراء العاجزين. ثم رغب ورهب بذكر الجزاء فقال: { وَلَا تَكْسِبُ كُلُّ نَفْسٍ } من خير وشر { إِلَّا عَلَيْهَا } كما قال تعالى: { مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ وَمَنْ أَسَاءَ فَعَلَيْهَا } { وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى } بل كل عليه وزر نفسه، وإن كان أحد قد تسبب في ضلال غيره ووزره، فإن عليه وزر التسبب من غير أن ينقص من وزر المباشر شيء. { ثُمَّ إِلَى رَبِّكُمْ مَرْجِعُكُمْ } يوم القيامة { فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ } من خير وشر، ويجازيكم على ذلك، أوفى الجزاء.\n                                    "
      },
      "originalText": "قُلۡ أَغَيۡرَ ٱللَّهِ أَبۡغِي رَبّٗا وَهُوَ رَبُّ كُلِّ شَيۡءٖۚ وَلَا تَكۡسِبُ كُلُّ نَفۡسٍ إِلَّا عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَيُنَبِّئُكُم بِمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٤٦١"
    },
    {
      "number": 954,
      "text": "وَهُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ الْأَرْضِ وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَبْلُوَكُمْ فِي مَا آتَاكُمْ ۗ إِنَّ رَبَّكَ سَرِيعُ الْعِقَابِ وَإِنَّهُ لَغَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 6,
        "name": "سورة الأنعام",
        "englishName": "Al-An'aam",
        "englishNameTranslation": "The Cattle",
        "revelationType": "Meccan",
        "numberOfAyahs": 165
      },
      "numberInSurah": 165,
      "juz": 8,
      "manzil": 2,
      "page": 150,
      "ruku": 121,
      "hizbQuarter": 60,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَهُوَ ٱلَّذِي جَعَلَكُمۡ خَلَٰٓئِفَ ٱلۡأَرۡضِ وَرَفَعَ بَعۡضَكُمۡ فَوۡقَ بَعۡضٖ دَرَجَٰتٖ لِّيَبۡلُوَكُمۡ فِي مَآ ءَاتَىٰكُمۡۗ إِنَّ رَبَّكَ سَرِيعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورٞ رَّحِيمُۢ ٥٦١\n                                    \n                                    \n                                    يقول تعالى : ( وهو الذي جعلكم خلائف الأرض ) أي : جعلكم تعمرون الأرض جيلا بعد جيل ، وقرنا بعد قرن ، وخلفا بعد سلف . قاله ابن زيد وغيره ، كما قال : ( ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون ) [ الزخرف : 60 ] ، وكقوله تعالى : ( ويجعلكم خلفاء الأرض ) [ النمل : 62 ] ، وقوله ( إني جاعل في الأرض خليفة ) [ البقرة : 30 ] ، وقوله ( عسى ربكم أن يهلك عدوكم ويستخلفكم في الأرض فينظر كيف تعملون ) [ الأعراف : 129 ] .\nوقوله : ( ورفع بعضكم فوق بعض درجات ) أي : فاوت بينكم في الأرزاق والأخلاق ، والمحاسن والمساوئ ، والمناظر والأشكال والألوان ، وله الحكمة في ذلك ، كقوله : ( نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات ليتخذ بعضهم بعضا سخريا ) [ الزخرف : 32 ] ، وقوله تعالى : ( انظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا ) [ الإسراء : 21 ] .\nوقوله : ( ليبلوكم في ما آتاكم ) أي ليختبركم في الذي أنعم به عليكم وامتحنكم به ، ليختبر الغني في غناه ويسأله عن شكره ، والفقير في فقره ويسأله عن صبره .\nوقد روى مسلم في صحيحه ، من حديث أبي نضرة ، عن أبي سعيد الخدري ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها لينظر كيف تعملون ، فاتقوا الدنيا ، واتقوا النساء ، فإن أول فتنة بني إسرائيل كانت في النساء \"\nوقوله : ( إن ربك سريع العقاب وإنه لغفور رحيم ) ترهيب وترغيب ، أن حسابه وعقابه سريع ممن عصاه وخالف رسله ( وإنه لغفور رحيم ) لمن والاه واتبع رسله فيما جاءوا به من خير وطلب .\nوقال محمد بن إسحاق : يرحم العباد على ما فيهم . رواه ابن أبي حاتم .\nوكثيرا ما يقرن تعالى في القرآن بين هاتين الصفتين ، كما قال تعالى : وقوله : ( نبئ عبادي أني أنا الغفور الرحيم وأن عذابي هو العذاب الأليم ) [ الحجر : 49 ، 50 ] ، وقوله : ( وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب ) [ الرعد : 6 ] وغير ذلك من الآيات المشتملة على الترغيب والترهيب ، فتارة يدعو عباده إليه بالرغبة وصفة الجنة والترغيب فيما لديه ، وتارة يدعوهم إليه بالرهبة وذكر النار وأنكالها وعذابها والقيامة وأهوالها ، وتارة بهذا وبهذا لينجع في كل بحسبه . جعلنا الله ممن أطاعه فيما أمر ، وترك ما عنه نهى وزجر ، وصدقه فيما أخبر ، إنه قريب مجيب سميع الدعاء ، جواد كريم وهاب .\nوقد قال الإمام أحمد : حدثنا عبد الرحمن ، حدثنا زهير ، عن العلاء ، عن أبيه ، عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال : \" لو يعلم المؤمن ما عند الله من العقوبة ما طمع بالجنة أحد ، ولو يعلم الكافر ما عند الله من الرحمة ما قنط من الجنة أحد ، خلق الله مائة رحمة فوضع واحدة بين خلقه يتراحمون بها ، وعند الله تسعة وتسعون \"\nورواه الترمذي ، عن قتيبة ، عن عبد العزيز الدراوردي ، عن العلاء به . وقال : حسن صحيح . ورواه مسلم عن يحيى بن يحيى وقتيبة وعلي بن حجر ، ثلاثتهم عن إسماعيل بن جعفر ، عن العلاء .\nآخر تفسير سورة الأنعام ولله الحمد والمنة.\n                                    ",
        "qortoby": "وَهُوَ ٱلَّذِي جَعَلَكُمۡ خَلَٰٓئِفَ ٱلۡأَرۡضِ وَرَفَعَ بَعۡضَكُمۡ فَوۡقَ بَعۡضٖ دَرَجَٰتٖ لِّيَبۡلُوَكُمۡ فِي مَآ ءَاتَىٰكُمۡۗ إِنَّ رَبَّكَ سَرِيعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورٞ رَّحِيمُۢ ٥٦١\n                                    \n                                    \n                                    قوله تعالى وهو الذي جعلكم خلائف الأرض ورفع بعضكم فوق بعض درجات ليبلوكم في ما آتاكم إن ربك سريع العقاب وإنه لغفور رحيم\nقوله تعالى وهو الذي جعلكم خلائف الأرض خلائف جمع خليفة ، ككرائم جمع كريمة . وكل من جاء بعد من مضى فهو خليفة . أي جعلكم خلفا للأمم الماضية والقرون السالفة . قال الشماخ : تصيبهم وتخطئني المنايا وأخلف في ربوع عن ربوع\nورفع بعضكم فوق بعض في الخلق والرزق والقوة والبسطة والفضل والعلم .\nدرجات نصب بإسقاط الخافض ، أي إلى درجات .\nليبلوكم في ما آتاكم نصب بلام كي . والابتلاء الاختبار ; أي ليظهر منكم ما يكون غايته الثواب والعقاب . ولم يزل بعلمه غنيا ; فابتلى الموسر بالغنى وطلب منه الشكر ، وابتلى المعسر بالفقر وطلب منه الصبر . ويقال : ليبلوكم أي بعضكم ببعض . كما قال : وجعلنا بعضكم لبعض فتنة على ما يأتي بيانه . ثم خوفهم فقال : إن ربك سريع العقاب لمن عصاه .\nوإنه لغفور رحيم لمن أطاعه . وقال : سريع العقاب مع وصفه سبحانه بالإمهال ، ومع أن عقاب النار في الآخرة ; لأن كل آت قريب ; فهو سريع على هذا . كما قال تعالى : وما أمر الساعة إلا كلمح البصر أو هو أقرب . وقال يرونه بعيدا ونراه قريبا . ويكون أيضا سريع العقاب لمن استحقه في دار الدنيا ; فيكون تحذيرا لمواقع الخطيئة على هذه الجهة . والله أعلم .\nتمت سورة الأنعام بحمد الله تعالى وصلواته على محمد وعلى آله وصحبه وسلم تسليما كثيرا\n                                    ",
        "saadi": "وَهُوَ ٱلَّذِي جَعَلَكُمۡ خَلَٰٓئِفَ ٱلۡأَرۡضِ وَرَفَعَ بَعۡضَكُمۡ فَوۡقَ بَعۡضٖ دَرَجَٰتٖ لِّيَبۡلُوَكُمۡ فِي مَآ ءَاتَىٰكُمۡۗ إِنَّ رَبَّكَ سَرِيعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورٞ رَّحِيمُۢ ٥٦١\n                                        \n                                        \n                                        \n                                        { وَهُوَ الَّذِي جَعَلَكُمْ خَلَائِفَ الْأَرْضِ } أي: يخلف بعضكم بعضا، واستخلفكم الله في الأرض، وسخَّر لكم جميع ما فيها، وابتلاكم، لينظر كيف تعملون. { وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ } في القوة والعافية، والرزق والخَلْق والخُلُق. { لِيَبْلُوَكُمْ فِيمَا آتَاكُمْ } فتفاوتت أعمالكم. { إِنَّ رَبَّكَ سَرِيعُ الْعِقَابِ } لمن عصاه وكذّب بآياته { وَإِنَّهُ لَغَفُورٌ رَحِيمٌ } لمن آمن به وعمل صالحا، وتاب من الموبقات. آخر تفسير سورة الأنعام، فلله الحمد والثناء وصلى الله وسلم على نبينا محمد [وعلى آله وصحبه وسلم تسليما كثيرا إلى يوم الدين] .\n                                    "
      },
      "originalText": "وَهُوَ ٱلَّذِي جَعَلَكُمۡ خَلَٰٓئِفَ ٱلۡأَرۡضِ وَرَفَعَ بَعۡضَكُمۡ فَوۡقَ بَعۡضٖ دَرَجَٰتٖ لِّيَبۡلُوَكُمۡ فِي مَآ ءَاتَىٰكُمۡۗ إِنَّ رَبَّكَ سَرِيعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورٞ رَّحِيمُۢ ٥٦١"
    }
  ]
}