{
  "number": 163,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 1050,
      "text": "وَلَوْ أَنَّ أَهْلَ الْقُرَىٰ آمَنُوا وَاتَّقَوْا لَفَتَحْنَا عَلَيْهِمْ بَرَكَاتٍ مِنَ السَّمَاءِ وَالْأَرْضِ وَلَٰكِنْ كَذَّبُوا فَأَخَذْنَاهُمْ بِمَا كَانُوا يَكْسِبُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 96,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 133,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰٓ ءَامَنُواْ وَٱتَّقَوۡاْ لَفَتَحۡنَا عَلَيۡهِم بَرَكَٰتٖ مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ وَلَٰكِن كَذَّبُواْ فَأَخَذۡنَٰهُم بِمَا كَانُواْ يَكۡسِبُونَ ٦٩\n                                    \n                                    \n                                    يقول تعالى مخبرا عن قلة إيمان أهل القرى الذين أرسل فيهم الرسل ، كقوله تعالى ( فلولا كانت قرية آمنت فنفعها إيمانها إلا قوم يونس لما آمنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين ) [ يونس : 98 ] أي : ما آمنت قرية بتمامها إلا قوم يونس ، فإنهم آمنوا ، وذلك بعد ما عاينوا العذاب ، كما قال تعالى : ( وأرسلناه إلى مائة ألف أو يزيدون فآمنوا فمتعناهم إلى حين ) [ الصافات : 147 ، 148 ] وقال تعالى : ( وما أرسلنا في قرية من نذير إلا قال مترفوها إنا بما أرسلتم به كافرون ) [ سبأ : 34 ]\nوقوله تعالى : ( ولو أن أهل القرى آمنوا واتقوا ) أي : آمنت قلوبهم بما جاءتهم به الرسل ، وصدقت به واتبعته ، واتقوا بفعل الطاعات وترك المحرمات ، ( لفتحنا عليهم بركات من السماء والأرض ) أي : قطر السماء ونبات الأرض . قال تعالى : ( ولكن كذبوا فأخذناهم بما كانوا يكسبون ) أي : ولكن كذبوا رسلهم ، فعاقبناهم بالهلاك على ما كسبوا من المآثم والمحارم .\n                                    ",
        "qortoby": "وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰٓ ءَامَنُواْ وَٱتَّقَوۡاْ لَفَتَحۡنَا عَلَيۡهِم بَرَكَٰتٖ مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ وَلَٰكِن كَذَّبُواْ فَأَخَذۡنَٰهُم بِمَا كَانُواْ يَكۡسِبُونَ ٦٩\n                                    \n                                    \n                                    قوله تعالى ولو أن أهل القرى آمنوا واتقوا لفتحنا عليهم بركات من السماء والأرض ولكن كذبوا فأخذناهم بما كانوا يكسبون\nقوله تعالى ولو أن أهل القرى يقال للمدينة قرية لاجتماع الناس فيها . من قريت الماء إذا جمعته . وقد مضى في \" البقرة \" مستوفى .\nآمنوا أي صدقوا واتقوا أي الشرك لفتحنا عليهم بركات من السماء والأرض يعني المطر والنبات . وهذا في أقوام على الخصوص جرى ذكرهم . إذ قد يمتحن المؤمنون بضيق العيش ويكون تكفيرا لذنوبهم . ألا ترى أنه أخبر عن نوح إذ قال لقومه استغفروا ربكم إنه كان غفارا يرسل السماء عليكم مدرارا وعن هود ثم توبوا إليه يرسل السماء عليكم مدرارا فوعدهم المطر والخصب على التخصيص .\nيدل عليه ولكن كذبوا فأخذناهم بما كانوا يكسبون أي كذبوا الرسل . والمؤمنون صدقوا ولم يكذبوا .\n                                    ",
        "saadi": "وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰٓ ءَامَنُواْ وَٱتَّقَوۡاْ لَفَتَحۡنَا عَلَيۡهِم بَرَكَٰتٖ مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ وَلَٰكِن كَذَّبُواْ فَأَخَذۡنَٰهُم بِمَا كَانُواْ يَكۡسِبُونَ ٦٩\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى أن المكذبين للرسل يبتلون بالضراء موعظة وإنذارا، وبالسراء استدراجا ومكرا، ذكر أن أهل القرى، لو آمنوا بقلوبهم إيمانا صادقا صدقته الأعمال، واستعملوا تقوى اللّه تعالى ظاهرا وباطنا بترك جميع ما حرم اللّه، لفتح عليهم بركات السماء والأرض، فأرسل السماء عليهم مدرارا، وأنبت لهم من الأرض ما به يعيشون وتعيش بهائمهم، في أخصب عيش وأغزر رزق، من غير عناء ولا تعب، ولا كد ولا نصب، ولكنهم لم يؤمنوا ويتقوا { فَأَخَذْنَاهُمْ بِمَا كَانُوا يَكْسِبُونَ ْ} بالعقوبات والبلايا ونزع البركات، وكثرة الآفات، وهي بعض جزاء أعمالهم، وإلا فلو آخذهم بجميع ما كسبوا، ما ترك عليها من دابة. { ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ ْ}\n                                    "
      },
      "originalText": "وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰٓ ءَامَنُواْ وَٱتَّقَوۡاْ لَفَتَحۡنَا عَلَيۡهِم بَرَكَٰتٖ مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ وَلَٰكِن كَذَّبُواْ فَأَخَذۡنَٰهُم بِمَا كَانُواْ يَكۡسِبُونَ ٦٩"
    },
    {
      "number": 1051,
      "text": "أَفَأَمِنَ أَهْلُ الْقُرَىٰ أَنْ يَأْتِيَهُمْ بَأْسُنَا بَيَاتًا وَهُمْ نَائِمُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 97,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 133,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَفَأَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا بَيَٰتٗا وَهُمۡ نَآئِمُونَ ٧٩\n                                    \n                                    \n                                    م قال تعالى مخوفا ومحذرا من مخالفة أوامره ، والتجرؤ على زواجره : ( أفأمن أهل القرى ) أي : الكافرة ( أن يأتيهم بأسنا ) أي : عذابنا ونكالنا ، ( بياتا ) أي : ليلا ( وهم نائمون)\n                                    ",
        "qortoby": "أَفَأَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا بَيَٰتٗا وَهُمۡ نَآئِمُونَ ٧٩\n                                    \n                                    \n                                    قوله تعالى أفأمن أهل القرى أن يأتيهم بأسنا بياتا وهم نائمون\nقوله تعالى أفأمن أهل القرى الاستفهام للإنكار ، والفاء للعطف . نظيره : أفحكم الجاهلية والمراد بالقرى مكة وما حولها ; لأنهم كذبوا محمدا صلى الله عليه وسلم وقيل : هو عام في جميع القرى .\nأن يأتيهم بأسنا أي عذابنا . بياتا أي ليلا وهم نائمون\n                                    ",
        "saadi": "أَفَأَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا بَيَٰتٗا وَهُمۡ نَآئِمُونَ ٧٩\n                                        \n                                        \n                                        \n                                        { أَفَأَمِنَ أَهْلُ الْقُرَى ْ} أي: المكذبة، بقرينة السياق { أَنْ يَأْتِيَهُمْ بَأْسُنَا ْ} أي: عذابنا الشديد { بَيَاتًا وَهُمْ نَائِمُونَ ْ} أي: في غفلتهم، وغرتهم وراحتهم.\n                                    "
      },
      "originalText": "أَفَأَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا بَيَٰتٗا وَهُمۡ نَآئِمُونَ ٧٩"
    },
    {
      "number": 1052,
      "text": "أَوَأَمِنَ أَهْلُ الْقُرَىٰ أَنْ يَأْتِيَهُمْ بَأْسُنَا ضُحًى وَهُمْ يَلْعَبُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 98,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 133,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوَ أَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا ضُحٗى وَهُمۡ يَلۡعَبُونَ ٨٩\n                                    \n                                    \n                                    أي : في حال شغلهم وغفلتهم ، ( أفأمنوا مكر الله ) أي : بأسه ونقمته وقدرته عليهم وأخذه إياهم في حال سهوهم وغفلتهم\n                                    ",
        "qortoby": "أَوَ أَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا ضُحٗى وَهُمۡ يَلۡعَبُونَ ٨٩\n                                    \n                                    \n                                    \" أوأمن أهل القرى أن يأتيهم بأسنا ضحى \" قرأه الحرميان وابن عامر بإسكان الواو للعطف ، على معنى الإباحة ; مثل ولا تطع منهم آثما أو كفورا . جالس الحسن أو ابن سيرين . والمعنى : أو أمنوا هذه الضروب من العقوبات . أي إن أمنتم ضربا منها لم تأمنوا الآخر . ويجوز أن يكون \" أو \" لأحد الشيئين ، كقولك : ضربت زيدا أو عمرا . وقرأ الباقون بفتحها بهمزة بعدها . جعلها واو العطف دخلت عليها ألف الاستفهام ; نظيره أوكلما عاهدوا عهدا\nوهم يلعبون أي وهم فيما لا يجدي عليهم ; يقال لكل من كان فيما يضره ولا يجدي عليه لاعب ، ذكره النحاس . وفي الصحاح : اللعب معروف ، واللعب مثله . وقد لعب يلعب . وتلعب : لعب مرة بعد أخرى . ورجل تلعابة : كثير اللعب ، والتلعاب بالفتح المصدر . وجارية لعوب .\n                                    ",
        "saadi": "أَوَ أَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا ضُحٗى وَهُمۡ يَلۡعَبُونَ ٨٩\n                                        \n                                        \n                                        \n                                        { أَوَ أَمِنَ أَهْلُ الْقُرَى أَنْ يَأْتِيَهُمْ بَأْسُنَا ضُحًى وَهُمْ يَلْعَبُونَ ْ} أي: أي شيء يؤمنهم من ذلك، وهم قد فعلوا أسبابه، وارتكبوا من الجرائم العظيمة، ما يوجب بعضه الهلاك؟!\n                                    "
      },
      "originalText": "أَوَ أَمِنَ أَهۡلُ ٱلۡقُرَىٰٓ أَن يَأۡتِيَهُم بَأۡسُنَا ضُحٗى وَهُمۡ يَلۡعَبُونَ ٨٩"
    },
    {
      "number": 1053,
      "text": "أَفَأَمِنُوا مَكْرَ اللَّهِ ۚ فَلَا يَأْمَنُ مَكْرَ اللَّهِ إِلَّا الْقَوْمُ الْخَاسِرُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 99,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 133,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَفَأَمِنُواْ مَكۡرَ ٱللَّهِۚ فَلَا يَأۡمَنُ مَكۡرَ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡخَٰسِرُونَ ٩٩\n                                    \n                                    \n                                    ( فلا يأمن مكر الله إلا القوم الخاسرون ) ; ولهذا قال الحسن البصري ، رحمه الله : المؤمن يعمل بالطاعات وهو مشفق وجل خائف ، والفاجر يعمل بالمعاصي وهو آمن .\n                                    ",
        "qortoby": "أَفَأَمِنُواْ مَكۡرَ ٱللَّهِۚ فَلَا يَأۡمَنُ مَكۡرَ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡخَٰسِرُونَ ٩٩\n                                    \n                                    \n                                    قوله تعالى أفأمنوا مكر الله فلا يأمن مكر الله إلا القوم الخاسرون قوله تعالى أفأمنوا مكر الله أي عذابه وجزاءه على مكرهم . وقيل : مكره استدراجه بالنعمة والصحة .\n                                    ",
        "saadi": "أَفَأَمِنُواْ مَكۡرَ ٱللَّهِۚ فَلَا يَأۡمَنُ مَكۡرَ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡخَٰسِرُونَ ٩٩\n                                        \n                                        \n                                        \n                                        { أَفَأَمِنُوا مَكْرَ اللَّهِ ْ} حيث يستدرجهم من حيث لا يعلمون، ويملي لهم، إن كيده متين، { فَلَا يَأْمَنُ مَكْرَ اللَّهِ إِلَّا الْقَوْمُ الْخَاسِرُونَ ْ} فإن من أمن من عذاب اللّه، فهو لم يصدق بالجزاء على الأعمال، ولا آمن بالرسل حقيقة الإيمان. وهذه الآية الكريمة فيها من التخويف البليغ، على أن العبد لا ينبغي له أن يكون آمنا على ما معه من الإيمان. بل لا يزال خائفا وجلا أن يبتلى ببلية تسلب ما معه من الإيمان، وأن لا يزال داعيا بقوله: { يا مقلب القلوب ثبت قلبي على دينك ْ} وأن يعمل ويسعى، في كل سبب يخلصه من الشر، عند وقوع الفتن، فإن العبد - ولو بلغت به الحال ما بلغت - فليس على يقين من السلامة.\n                                    "
      },
      "originalText": "أَفَأَمِنُواْ مَكۡرَ ٱللَّهِۚ فَلَا يَأۡمَنُ مَكۡرَ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡخَٰسِرُونَ ٩٩"
    },
    {
      "number": 1054,
      "text": "أَوَلَمْ يَهْدِ لِلَّذِينَ يَرِثُونَ الْأَرْضَ مِنْ بَعْدِ أَهْلِهَا أَنْ لَوْ نَشَاءُ أَصَبْنَاهُمْ بِذُنُوبِهِمْ ۚ وَنَطْبَعُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَسْمَعُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 100,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 134,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوَ لَمۡ يَهۡدِ لِلَّذِينَ يَرِثُونَ ٱلۡأَرۡضَ مِنۢ بَعۡدِ أَهۡلِهَآ أَن لَّوۡ نَشَآءُ أَصَبۡنَٰهُم بِذُنُوبِهِمۡۚ وَنَطۡبَعُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَسۡمَعُونَ ٠٠١\n                                    \n                                    \n                                    قال ابن عباس ، رضي الله عنهما ، في قوله : ( أولم يهد للذين يرثون الأرض من بعد أهلها ) أو لم نبين ، [ وكذا قال مجاهد والسدي ، وقال عبد الرحمن بن زيد بن أسلم : أو لم نبين ] لهم أن لو نشاء أصبناهم بذنوبهم .\nوقال أبو جعفر بن جرير في تفسيرها : يقول تعالى : أولم نبين للذين يستخلفون في الأرض من بعد إهلاك آخرين قبلهم كانوا أهلها ، فساروا سيرتهم ، وعملوا أعمالهم ، وعتوا على ربهم : ( أن لو نشاء أصبناهم بذنوبهم ) يقول : أن لو نشاء فعلنا بهم كما فعلنا بمن قبلهم ، ( ونطبع على قلوبهم ) يقول : ونختم على قلوبهم ( فهم لا يسمعون ) موعظة ولا تذكيرا .\nقلت : وهكذا قال تعالى : ( أفلم يهد لهم كم أهلكنا قبلهم من القرون يمشون في مساكنهم إن في ذلك لآيات لأولي النهى ) [ طه : 128 ] وقال تعالى : ( أولم يهد لهم كم أهلكنا من قبلهم من القرون يمشون في مساكنهم إن في ذلك لآيات أفلا يسمعون ) [ السجدة : 29 ] وقال ( أولم تكونوا أقسمتم من قبل ما لكم من زوال وسكنتم في مساكن الذين ظلموا أنفسهم وتبين لكم كيف فعلنا بهم وضربنا لكم الأمثال ) [ إبراهيم : 44 ، 45 ] وقال تعالى : ( وكم أهلكنا قبلهم من قرن هل تحس منهم من أحد أو تسمع لهم ركزا ) [ مريم : 98 ] أي : هل ترى لهم شخصا أو تسمع لهم صوتا ؟ وقال تعالى : ( ألم يروا كم أهلكنا من قبلهم من قرن مكناهم في الأرض ما لم نمكن لكم وأرسلنا السماء عليهم مدرارا وجعلنا الأنهار تجري من تحتهم فأهلكناهم بذنوبهم وأنشأنا من بعدهم قرنا آخرين ) [ الأنعام : 6 ] وقال تعالى بعد ذكره إهلاك عاد : ( فأصبحوا لا يرى إلا مساكنهم كذلك نجزي القوم المجرمين ولقد مكناهم فيما إن مكناكم فيه وجعلنا لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء إذ كانوا يجحدون بآيات الله وحاق بهم ما كانوا به يستهزئون ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون ) [ الأحقاف : 25 - 27 ] وقال تعالى : ( وكذب الذين من قبلهم وما بلغوا معشار ما آتيناهم فكذبوا رسلي فكيف كان نكير ) [ سبأ : 45 ] وقال تعالى : ( ولقد كذب الذين من قبلهم فكيف كان نكير ) [ الملك : 18 ] وقال تعالى : ( فكأين من قرية أهلكناها وهي ظالمة فهي خاوية على عروشها وبئر معطلة وقصر مشيد أفلم يسيروا في الأرض فتكون لهم قلوب يعقلون بها أو آذان يسمعون بها فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور ) [ الحج : 45 ، 46 ] وقال تعالى : ( ولقد استهزئ برسل من قبلك فحاق بالذين سخروا منهم ما كانوا به يستهزئون ) [ الأنعام : 10 ] إلى غير ذلك من الآيات الدالة على حلول نقمه بأعدائه ، وحصول نعمه لأوليائه ; ولهذا عقب ذلك بقوله ، وهو أصدق القائلين ورب العالمين :\n                                    ",
        "qortoby": "أَوَ لَمۡ يَهۡدِ لِلَّذِينَ يَرِثُونَ ٱلۡأَرۡضَ مِنۢ بَعۡدِ أَهۡلِهَآ أَن لَّوۡ نَشَآءُ أَصَبۡنَٰهُم بِذُنُوبِهِمۡۚ وَنَطۡبَعُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَسۡمَعُونَ ٠٠١\n                                    \n                                    \n                                    قوله تعالى أولم يهد للذين يرثون الأرض من بعد أهلها أن لو نشاء أصبناهم بذنوبهم ونطبع على قلوبهم فهم لا يسمعون\nقوله تعالى أولم يهد أي يبين . للذين يرثون الأرض من بعد أهلها يريد كفار مكة ومن حولهم .\nأن لو نشاء أصبناهم أي أخذناهم بذنوبهم أي بكفرهم وتكذيبهم .\nونطبع أي ونحن نطبع ; فهو مستأنف . وقيل : هو معطوف على \" أصبنا \" أي نصيبهم ونطبع ، فوقع الماضي موقع المستقبل .\n                                    ",
        "saadi": "أَوَ لَمۡ يَهۡدِ لِلَّذِينَ يَرِثُونَ ٱلۡأَرۡضَ مِنۢ بَعۡدِ أَهۡلِهَآ أَن لَّوۡ نَشَآءُ أَصَبۡنَٰهُم بِذُنُوبِهِمۡۚ وَنَطۡبَعُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَسۡمَعُونَ ٠٠١\n                                        \n                                        \n                                        \n                                        يقول تعالى منبها للأمم الغابرين بعد هلاك الأمم الغابرين { أَوَ لَمْ يَهْدِ لِلَّذِينَ يَرِثُونَ الْأَرْضَ مِنْ بَعْدِ أَهْلِهَا أَنْ لَوْ نَشَاءُ أَصَبْنَاهُمْ بِذُنُوبِهِمْ ْ} أي: أو لم يتبين ويتضح للأمم الذين ورثوا الأرض، بعد إهلاك من قبلهم بذنوبهم، ثم عملوا كأعمال أولئك المهلكين؟. أو لم يهتدوا أن اللّه، لو شاء لأصابهم بذنوبهم، فإن هذه سنته في الأولين والآخرين. وقوله: { وَنَطْبَعُ عَلَى قُلُوبِهِمْ فَهُمْ لَا يَسْمَعُونَ ْ} أي: إذا نبههم اللّه فلم ينتبهوا، وذكرهم فلم يتذكروا، وهداهم بالآيات والعبر فلم يهتدوا، فإن اللّه تعالى يعاقبهم ويطبع على قلوبهم، فيعلوها الران والدنس، حتى يختم عليها، فلا يدخلها حق، ولا يصل إليها خير، ولا يسمعون ما ينفعهم، وإنما يسمعون ما به تقوم الحجة عليهم.\n                                    "
      },
      "originalText": "أَوَ لَمۡ يَهۡدِ لِلَّذِينَ يَرِثُونَ ٱلۡأَرۡضَ مِنۢ بَعۡدِ أَهۡلِهَآ أَن لَّوۡ نَشَآءُ أَصَبۡنَٰهُم بِذُنُوبِهِمۡۚ وَنَطۡبَعُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَسۡمَعُونَ ٠٠١"
    },
    {
      "number": 1055,
      "text": "تِلْكَ الْقُرَىٰ نَقُصُّ عَلَيْكَ مِنْ أَنْبَائِهَا ۚ وَلَقَدْ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَمَا كَانُوا لِيُؤْمِنُوا بِمَا كَذَّبُوا مِنْ قَبْلُ ۚ كَذَٰلِكَ يَطْبَعُ اللَّهُ عَلَىٰ قُلُوبِ الْكَافِرِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 101,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 134,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تِلۡكَ ٱلۡقُرَىٰ نَقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآئِهَاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَمَا كَانُواْ لِيُؤۡمِنُواْ بِمَا كَذَّبُواْ مِن قَبۡلُۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلۡكَٰفِرِينَ ١٠١\n                                    \n                                    \n                                    لما قص تعالى على نبيه صلى الله عليه وسلم خبر قوم نوح ، وهود ، وصالح ، ولوط ، وشعيب [ عليهم الصلاة والسلام ] وما كان من إهلاكه الكافرين وإنجائه المؤمنين ، وأنه تعالى أعذر إليهم بأن بين لهم الحق بالحجج على ألسنة الرسل ، صلوات الله عليهم أجمعين ، قال تعالى : ( تلك القرى نقص عليك ) أي : يا محمد ( من أنبائها ) أي : من أخبارها ، ( ولقد جاءتهم رسلهم بالبينات ) أي : بالحجج على صدقهم فيما أخبروهم به ، كما قال تعالى : ( وما كنا معذبين حتى نبعث رسولا ) [ الإسراء : 15 ] وقال تعالى : ( ذلك من أنباء القرى نقصه عليك منها قائم وحصيد وما ظلمناهم ولكن ظلموا أنفسهم ) [ هود : 101 ، 102 ]\nوقوله تعالى : ( فما كانوا ليؤمنوا بما كذبوا من قبل ) الباء سببية ، أي : فما كانوا ليؤمنوا بما جاءتهم به الرسل بسبب تكذيبهم بالحق أول ما ورد عليهم . حكاه ابن عطية ، رحمه الله ، وهو متجه حسن ، كقوله : ( وما يشعركم أنها إذا جاءت لا يؤمنون ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة ونذرهم في طغيانهم يعمهون ) [ الأنعام : 110 ، 111 ] ; ولهذا قال هنا : ( كذلك يطبع الله على قلوب الكافرين)\n                                    ",
        "qortoby": "تِلۡكَ ٱلۡقُرَىٰ نَقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآئِهَاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَمَا كَانُواْ لِيُؤۡمِنُواْ بِمَا كَذَّبُواْ مِن قَبۡلُۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلۡكَٰفِرِينَ ١٠١\n                                    \n                                    \n                                    قوله تعالى تلك القرى نقص عليك من أنبائها ولقد جاءتهم رسلهم بالبينات فما كانوا ليؤمنوا بما كذبوا من قبل كذلك يطبع الله على قلوب الكافرين\nقوله تعالى تلك القرى أي هذه القرى التي أهلكناها ; وهي قرى نوح وعاد ولوط وهود وشعيب المتقدمة الذكر .\nنقص أي نتلو عليك من أنبائها أي من أخبارها . وهي تسلية للنبي عليه السلام والمسلمين .\nفما كانوا ليؤمنوا أي فما كان أولئك الكفار ليؤمنوا بعد هلاكهم لو أحييناهم ; قاله مجاهد . نظيره ولو ردوا لعادوا . وقال ابن عباس والربيع : كان في علم الله تعالى يوم أخذ عليهم الميثاق أنهم لا يؤمنون بالرسل .\nبما كذبوا من قبل يريد يوم الميثاق حين أخرجهم من ظهر آدم فآمنوا كرها لا طوعا . قال السدي : آمنوا يوم أخذ عليهم الميثاق كرها فلم يكونوا ليؤمنوا الآن حقيقة . وقيل : سألوا المعجزات ، فلما رأوها ما كانوا ليؤمنوا بما كذبوا به من قبل رؤية المعجزة . نظيره كما لم يؤمنوا به أول مرة .\nكذلك يطبع الله على قلوب الكافرين أي مثل طبعه على قلوب هؤلاء المذكورين كذلك يطبع الله على قلوب الكافرين بمحمد صلى الله عليه وسلم .\n                                    ",
        "saadi": "تِلۡكَ ٱلۡقُرَىٰ نَقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآئِهَاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَمَا كَانُواْ لِيُؤۡمِنُواْ بِمَا كَذَّبُواْ مِن قَبۡلُۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلۡكَٰفِرِينَ ١٠١\n                                        \n                                        \n                                        \n                                        { تِلْكَ الْقُرَى ْ} الذين تقدم ذكرهم { نَقُصُّ عَلَيْكَ مِنْ أَنْبَائِهَا ْ} ما يحصل به عبرة للمعتبرين، وازدجار للظالمين، وموعظة للمتقين. { وَلَقَدْ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ ْ} أي: ولقد جاءت هؤلاء المكذبين رسلهم تدعوهم إلى ما فيه سعادتهم، وأيدهم اللّه بالمعجزات الظاهرة، والبينات المبينات للحق بيانا كاملا، ولكنهم لم يفدهم هذا، ولا أغنى عنهم شيئا، { فَمَا كَانُوا لِيُؤْمِنُوا بِمَا كَذَّبُوا مِنْ قَبْلُ ْ} أي: بسبب تكذيبهم وردهم الحق أول مرة، ما كان ليهديهم للإيمان، جزاء لهم على ردهم الحق، كما قال تعالى: { وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ ْ} { كَذَلِكَ يَطْبَعُ اللَّهُ عَلَى قُلُوبِ الْكَافِرِينَ ْ} عقوبة منه. وما ظلمهم اللّه ولكنهم ظلموا أنفسهم.\n                                    "
      },
      "originalText": "تِلۡكَ ٱلۡقُرَىٰ نَقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآئِهَاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَمَا كَانُواْ لِيُؤۡمِنُواْ بِمَا كَذَّبُواْ مِن قَبۡلُۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلۡكَٰفِرِينَ ١٠١"
    },
    {
      "number": 1056,
      "text": "وَمَا وَجَدْنَا لِأَكْثَرِهِمْ مِنْ عَهْدٍ ۖ وَإِنْ وَجَدْنَا أَكْثَرَهُمْ لَفَاسِقِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 102,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 134,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا وَجَدۡنَا لِأَكۡثَرِهِم مِّنۡ عَهۡدٖۖ وَإِن وَجَدۡنَآ أَكۡثَرَهُمۡ لَفَٰسِقِينَ ٢٠١\n                                    \n                                    \n                                    ( وما وجدنا لأكثرهم ) أي : لأكثر الأمم الماضية ( من عهد وإن وجدنا أكثرهم لفاسقين ) أي : ولقد وجدنا أكثرهم فاسقين خارجين عن الطاعة والامتثال . والعهد الذي أخذه عليهم هو ما جبلهم عليه وفطرهم عليه ، وأخذ عليهم في الأصلاب أنه ربهم ومليكهم ، وأنه لا إله إلا هو ، فأقروا بذلك ، وشهدوا على أنفسهم به ، فخالفوه وتركوه وراء ظهورهم ، وعبدوا مع الله غيره بلا دليل ولا حجة ، لا من عقل ولا شرع ، وفي الفطر السليمة خلاف ذلك ، وجاءت الرسل الكرام من أولهم إلى آخرهم بالنهي عن ذلك ، كما جاء في صحيح مسلم يقول الله تعالى : \" إني خلقت عبادي حنفاء ، فجاءتهم الشياطين فاجتالتهم عن دينهم ، وحرمت عليهم ما أحللت لهم \" . وفي الصحيحين : \" كل مولود يولد على الفطرة ، فأبواه يهودانه وينصرانه ويمجسانه \" الحديث . وقال تعالى في كتابه العزيز : ( وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون ) [ الأنبياء : 25 ] وقال تعالى : ( واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون ) [ الزخرف : 45 ] وقال تعالى : ( ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت ) [ النحل : 36 ] إلى غير ذلك من الآيات .\nوقد قيل في تفسير قوله تعالى : ( فما كانوا ليؤمنوا بما كذبوا من قبل ) ما روى أبو جعفر الرازي ، عن الربيع بن أنس ، عن أبي العالية ، عن أبي بن كعب في قوله : ( فما كانوا ليؤمنوا بما كذبوا من قبل ) قال : كان في علمه تعالى يوم أقروا له بالميثاق ، أي : فما كانوا ليؤمنوا لعلم الله منهم ذلك ، وكذا قال الربيع بن أنس ، واختاره ابن جرير .\nوقال السدي : ( فما كانوا ليؤمنوا بما كذبوا من قبل ) قال : ذلك يوم أخذ منهم الميثاق فآمنوا كرها .\nوقال مجاهد في قوله : ( فما كانوا ليؤمنوا بما كذبوا من قبل ) هذا كقوله : ( ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون ) [ الأنعام : 28 ]\n                                    ",
        "qortoby": "وَمَا وَجَدۡنَا لِأَكۡثَرِهِم مِّنۡ عَهۡدٖۖ وَإِن وَجَدۡنَآ أَكۡثَرَهُمۡ لَفَٰسِقِينَ ٢٠١\n                                    \n                                    \n                                    قوله تعالى وما وجدنا لأكثرهم من عهد وإن وجدنا أكثرهم لفاسقين\nقوله تعالى وما وجدنا لأكثرهم من عهد \" من \" زائدة ، وهي تدل على معنى الجنس ; ولولا \" من \" لجاز أن يتوهم أنه واحد في المعنى . قال ابن عباس : يريد العهد المأخوذ عليهم وقت الذر ، ومن نقض العهد قيل له إنه لا عهد له ، أي كأنه لم يعهد . وقال الحسن : العهد الذي عهد إليهم مع الأنبياء أن يعبدوه ولا يشركوا به شيئا . وقيل : أراد أن الكفار منقسمون ; فالأكثرون منهم من لا أمانة له ولا وفاء ، ومنهم من له أمانة مع كفره وإن قلوا ; روي عن أبي عبيدة .\n                                    ",
        "saadi": "وَمَا وَجَدۡنَا لِأَكۡثَرِهِم مِّنۡ عَهۡدٖۖ وَإِن وَجَدۡنَآ أَكۡثَرَهُمۡ لَفَٰسِقِينَ ٢٠١\n                                        \n                                        \n                                        \n                                        { وَمَا وَجَدْنَا لِأَكْثَرِهِمْ مِنْ عَهْدٍ ْ} أي: وما وجدنا لأكثر الأمم الذين أرسل اللّه إليهم الرسل من عهد، أي: من ثبات والتزام لوصية اللّه التي أوصى بها جميع العالمين، ولا انقادوا لأوامره التي ساقها إليهم على ألسنة رسله. { وَإِنْ وَجَدْنَا أَكْثَرَهُمْ لَفَاسِقِينَ ْ} أي: خارجين عن طاعة اللّه، متبعين لأهوائهم بغير هدى من اللّه، فاللّه تعالى امتحن العباد بإرسال الرسل وإنزال الكتب، وأمرهم باتباع عهده وهداه، فلم يمتثل لأمره إلا القليل من الناس، الذين سبقت لهم من اللّه، سابقة السعادة. وأما أكثر الخلق فأعرضوا عن الهدى، واستكبروا عما جاءت به الرسل، فأحل اللّه بهم من عقوباته المتنوعة ما أحل.\n                                    "
      },
      "originalText": "وَمَا وَجَدۡنَا لِأَكۡثَرِهِم مِّنۡ عَهۡدٖۖ وَإِن وَجَدۡنَآ أَكۡثَرَهُمۡ لَفَٰسِقِينَ ٢٠١"
    },
    {
      "number": 1057,
      "text": "ثُمَّ بَعَثْنَا مِنْ بَعْدِهِمْ مُوسَىٰ بِآيَاتِنَا إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَظَلَمُوا بِهَا ۖ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 103,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 134,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ بِ‍َٔايَٰتِنَآ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَظَلَمُواْ بِهَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ ٣٠١\n                                    \n                                    \n                                    يقول تعالى : ( ثم بعثنا من بعدهم ) أي : الرسل المتقدم ذكرهم ، كنوح ، وهود ، وصالح ، ولوط ، وشعيب ، صلوات الله وسلامه عليهم وعلى سائر أنبياء الله أجمعين . ( موسى بآياتنا ) أي : بحججنا ودلائلنا البينة إلى ) فرعون ) وهو ملك مصر في زمن موسى ، ) وملئه ) أي : قومه ، ( فظلموا بها ) أي : جحدوا وكفروا بها ظلما منهم وعنادا ، كقوله تعالى ( وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا فانظر كيف كان عاقبة المفسدين ) [ النمل : 14 ] أي : الذين صدوا عن سبيل الله وكذبوا رسله ، أي : انظر - يا محمد - كيف فعلنا بهم ، وأغرقناهم عن آخرهم ، بمرأى من موسى وقومه . وهذا أبلغ في النكال بفرعون وقومه ، وأشفى لقلوب أولياء الله - موسى وقومه - من المؤمنين به .\n                                    ",
        "qortoby": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ بِ‍َٔايَٰتِنَآ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَظَلَمُواْ بِهَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ ٣٠١\n                                    \n                                    \n                                    قوله تعالى ثم بعثنا من بعدهم موسى بآياتنا إلى فرعون وملئه فظلموا بها فانظر كيف كان عاقبة المفسدين\nقوله تعالى ثم بعثنا من بعدهم أي من بعد نوح وهود وصالح ولوط وشعيب .\nموسى أي موسى بن عمران بمعجزاتنا .\nفظلموا بها أي كفروا ولم يصدقوا بالآيات . والظلم : وضع الشيء في غير موضعه .\nفانظر كيف كان عاقبة المفسدين أي آخر أمرهم .\n                                    ",
        "saadi": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ بِ‍َٔايَٰتِنَآ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَظَلَمُواْ بِهَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ ٣٠١\n                                        \n                                        \n                                        \n                                        أي: ثم بعثنا من بعد أولئك الرسل موسى الكليم، الإمام العظيم، والرسول الكريم، إلى قوم عتاة جبابرة، وهم فرعون وملؤه، من أشرافهم وكبرائهم، فأراهم من آيات اللّه العظيمة ما لم يشاهد له نظير فَظَلَمُوا بِهَا بأن لم ينقادوا لحقها الذي من لم ينقد له فهو ظالم، بل استكبروا عنها. فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ كيف أهلكهم اللّه، وأتبعهم الذم واللعنة في الدنيا ويوم القيامة، بئس الرفد المرفود،\n                                    "
      },
      "originalText": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ بِ‍َٔايَٰتِنَآ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَظَلَمُواْ بِهَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ ٣٠١"
    },
    {
      "number": 1058,
      "text": "وَقَالَ مُوسَىٰ يَا فِرْعَوْنُ إِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 104,
      "juz": 9,
      "manzil": 2,
      "page": 163,
      "ruku": 134,
      "hizbQuarter": 65,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ مُوسَىٰ يَٰفِرۡعَوۡنُ إِنِّي رَسُولٞ مِّن رَّبِّ ٱلۡعَٰلَمِينَ ٤٠١\n                                    \n                                    \n                                    يخبر تعالى عن مناظرة موسى لفرعون ، وإلجامه إياه بالحجة ، وإظهاره الآيات البينات بحضرة فرعون وقومه من قبط مصر ، فقال تعالى : ( وقال موسى يا فرعون إني رسول من رب العالمين ) أي : أرسلني الذي هو خالق كل شيء وربه ومليكه .\n                                    ",
        "qortoby": "وَقَالَ مُوسَىٰ يَٰفِرۡعَوۡنُ إِنِّي رَسُولٞ مِّن رَّبِّ ٱلۡعَٰلَمِينَ ٤٠١\n                                    \n                                    \n                                    وَقَالَ مُوسَىٰ يَا فِرْعَوْنُ إِنِّي رَسُولٌ مِّن رَّبِّ الْعَالَمِينَ\n                                    ",
        "saadi": "وَقَالَ مُوسَىٰ يَٰفِرۡعَوۡنُ إِنِّي رَسُولٞ مِّن رَّبِّ ٱلۡعَٰلَمِينَ ٤٠١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 104 و105 :ـ وَقَالَ مُوسَى حين جاء إلى فرعون يدعوه إلى الإيمان. يَا فِرْعَوْنُ إِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ أي: إني رسول من مرسل عظيم، وهو رب العالمين، الشامل للعالم العلوي والسفلي، مربي جميع خلقه بأنواع التدابير الإلهية، التي من جملتها أنه لا يتركهم سدى، بل يرسل إليهم الرسل مبشرين ومنذرين، وهو الذي لا يقدر أحد أن يتجرأ عليه، ويدعي أنه أرسله ولم يرسله. فإذا كان هذا شأنه، وأنا قد اختارني واصطفاني لرسالته، فحقيق علي أن لا أكذب عليه، ولا أقول عليه إلا الحق. فإني لو قلت غير ذلك لعاجلني بالعقوبة، وأخذني أخذ عزيز مقتدر. فهذا موجب لأن ينقادوا له ويتبعوه، خصوصا وقد جاءهم ببينة من اللّه واضحة على صحة ما جاء به من الحق، فوجب عليهم أن يعملوا بمقصود رسالته، ولها مقصودان عظيمان. إيمانهم به، واتباعهم له، وإرسال بني إسرائيل الشعب الذي فضله اللّه على العالمين، أولاد الأنبياء، وسلسلة يعقوب عليه السلام، الذي موسى عليه الصلاة والسلام واحد منهم.\n                                    "
      },
      "originalText": "وَقَالَ مُوسَىٰ يَٰفِرۡعَوۡنُ إِنِّي رَسُولٞ مِّن رَّبِّ ٱلۡعَٰلَمِينَ ٤٠١"
    }
  ]
}