{
  "number": 167,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 1092,
      "text": "وَجَاوَزْنَا بِبَنِي إِسْرَائِيلَ الْبَحْرَ فَأَتَوْا عَلَىٰ قَوْمٍ يَعْكُفُونَ عَلَىٰ أَصْنَامٍ لَهُمْ ۚ قَالُوا يَا مُوسَى اجْعَلْ لَنَا إِلَٰهًا كَمَا لَهُمْ آلِهَةٌ ۚ قَالَ إِنَّكُمْ قَوْمٌ تَجْهَلُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 138,
      "juz": 9,
      "manzil": 2,
      "page": 167,
      "ruku": 137,
      "hizbQuarter": 66,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتَوۡاْ عَلَىٰ قَوۡمٖ يَعۡكُفُونَ عَلَىٰٓ أَصۡنَامٖ لَّهُمۡۚ قَالُواْ يَٰمُوسَى ٱجۡعَل لَّنَآ إِلَٰهٗا كَمَا لَهُمۡ ءَالِهَةٞۚ قَالَ إِنَّكُمۡ قَوۡمٞ تَجۡهَلُونَ ٨٣١\n                                    \n                                    \n                                    يخبر تعالى عما قاله جهلة بني إسرائيل لموسى ، عليه السلام ، حين جاوزوا البحر ، وقد رأوا من آيات الله وعظيم سلطانه ما رأوا ، ( فأتوا ) أي : فمروا ( على قوم يعكفون على أصنام لهم ) قال بعض المفسرين : كانوا من الكنعانيين . وقيل : كانوا من لخم .\nقال ابن جريج : وكانوا يعبدون أصناما على صور البقر ، فلهذا أثار ذلك شبهة لهم في عبادتهم العجل بعد ذلك ، فقالوا : ( يا موسى اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون ) أي : تجهلون عظمة الله وجلاله ، وما يجب أن ينزه عنه من الشريك والمثيل .\n                                    ",
        "qortoby": "وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتَوۡاْ عَلَىٰ قَوۡمٖ يَعۡكُفُونَ عَلَىٰٓ أَصۡنَامٖ لَّهُمۡۚ قَالُواْ يَٰمُوسَى ٱجۡعَل لَّنَآ إِلَٰهٗا كَمَا لَهُمۡ ءَالِهَةٞۚ قَالَ إِنَّكُمۡ قَوۡمٞ تَجۡهَلُونَ ٨٣١\n                                    \n                                    \n                                    قوله تعالى وجاوزنا ببني إسرائيل البحر فأتوا على قوم يعكفون على أصنام لهم قالوا يا موسى اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون\nقوله تعالى وجاوزنا ببني إسرائيل البحر فأتوا على قوم يعكفون على أصنام لهم قرأ حمزة والكسائي بكسر الكاف ، والباقون بضمها . يقال : عكف يعكف ويعكف بمعنى أقام على الشيء ولزمه . والمصدر منهما على فعول . قال قتادة : كان أولئك القوم من لخم ، وكانوا نزولا بالرقة وقيل : كانت أصنامهم تماثيل بقر ; ولهذا أخرج لهم السامري عجلا .\nقالوا ياموسى اجعل لنا إلها كما لهم آلهة نظيره قول جهال الأعراب وقد رأوا شجرة خضراء للكفار تسمى ذات أنواط يعظمونها في كل سنة يوما : يا رسول الله ، اجعل لنا ذات أنواط كما لهم ذات أنواط . فقال عليه الصلاة والسلام : الله أكبر . قلتم والذي نفسي بيده كما قال قوم موسى اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون لتركبن سنن من قبلكم حذو القذة بالقذة حتى إنهم لو دخلوا جحر ضب لدخلتموه . وكان هذا في مخرجه إلى حنين ، على ما يأتي بيانه في \" براءة \" إن شاء الله تعالى .\n                                    ",
        "saadi": "وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتَوۡاْ عَلَىٰ قَوۡمٖ يَعۡكُفُونَ عَلَىٰٓ أَصۡنَامٖ لَّهُمۡۚ قَالُواْ يَٰمُوسَى ٱجۡعَل لَّنَآ إِلَٰهٗا كَمَا لَهُمۡ ءَالِهَةٞۚ قَالَ إِنَّكُمۡ قَوۡمٞ تَجۡهَلُونَ ٨٣١\n                                        \n                                        \n                                        \n                                        جَاوَزْنَا بِبَنِي إِسْرَائِيلَ الْبَحْرَ بعد ما أنجاهم اللّه من عدوهم فرعون وقومه، وأهلكهم اللّه، وبنو إسرائيل ينظرون.\nفَأَتَوْا أي: مروا عَلَى قَوْمٍ يَعْكُفُونَ عَلَى أَصْنَامٍ لَهُمْ أي: يقيمون عندها ويتبركون بها، ويعبدونها.\nفـ قَالُوا من جهلهم وسفههم لنبيهم موسى بعدما أراهم الله من الآيات ما أراهم يَا مُوسَى اجْعَلْ لَنَا إِلَهًا كَمَا لَهُمْ آلِهَةٌ أي: اشرع لنا أن نتخذ أصناما آلهة كما اتخذها هؤلاء.\nفـ قَالَ لهم موسى: إِنَّكُمْ قَوْمٌ تَجْهَلُونَ وأي جهل أعظم من جهل من جهل ربه وخالقه وأراد أن يسوي به غيره، ممن لا يملك نفعا ولا ضرا، ولا موتا ولا حياة ولا نشورا؟\n                                    "
      },
      "originalText": "وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتَوۡاْ عَلَىٰ قَوۡمٖ يَعۡكُفُونَ عَلَىٰٓ أَصۡنَامٖ لَّهُمۡۚ قَالُواْ يَٰمُوسَى ٱجۡعَل لَّنَآ إِلَٰهٗا كَمَا لَهُمۡ ءَالِهَةٞۚ قَالَ إِنَّكُمۡ قَوۡمٞ تَجۡهَلُونَ ٨٣١"
    },
    {
      "number": 1093,
      "text": "إِنَّ هَٰؤُلَاءِ مُتَبَّرٌ مَا هُمْ فِيهِ وَبَاطِلٌ مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 139,
      "juz": 9,
      "manzil": 2,
      "page": 167,
      "ruku": 137,
      "hizbQuarter": 66,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ هَٰٓؤُلَآءِ مُتَبَّرٞ مَّا هُمۡ فِيهِ وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ٩٣١\n                                    \n                                    \n                                    ( إن هؤلاء متبر ما هم فيه ) أي : هالك ( وباطل ما كانوا يعملون )\nوروى الإمام أبو جعفر بن جرير رحمه الله تفسير هذه الآية من حديث محمد بن إسحاق وعقيل ، ومعمر كلهم ، عن الزهري ، عن سنان بن أبي سنان ، عن أبي واقد الليثي : أنهم خرجوا من مكة مع رسول الله صلى الله عليه وسلم إلى حنين ، قال : وكان للكفار سدرة يعكفون عندها ، ويعلقون بها أسلحتهم ، يقال لها : \" ذات أنواط \" ، قال : فمررنا بسدرة خضراء عظيمة ، قال : فقلنا : يا رسول الله ، اجعل لنا ذات أنواط كما لهم ذات أنواط . فقال : \" قلتم والذي نفسي بيده ، كما قال قوم موسى لموسى : ( اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون إن هؤلاء متبر ما هم فيه وباطل ما كانوا يعملون )\nوقال الإمام أحمد : حدثنا عبد الرزاق ، حدثنا معمر ، عن الزهري ، عن سنان بن أبي سنان الديلي ، عن أبي واقد الليثي قال : خرجنا مع رسول الله صلى الله عليه وسلم قبل حنين ، فمررنا بسدرة ، فقلت : يا نبي الله اجعل لنا هذه \" ذات أنواط \" ، كما للكفار ذات أنواط ، وكان الكفار ينوطون سلاحهم بسدرة ، ويعكفون حولها . فقال النبي صلى الله عليه وسلم : \" الله أكبر ، هذا كما قالت بنو إسرائيل لموسى : ( اجعل لنا إلها كما لهم آلهة [ قال إنكم قوم تجهلون ] ) إنكم تركبون سنن من قبلكم \"\nورواه ابن أبي حاتم ، من حديث كثير بن عبد الله بن عمرو بن عوف المزني ، عن أبيه عن جده مرفوعا\n                                    ",
        "qortoby": "إِنَّ هَٰٓؤُلَآءِ مُتَبَّرٞ مَّا هُمۡ فِيهِ وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ٩٣١\n                                    \n                                    \n                                    قوله تعالى إن هؤلاء متبر ما هم فيه وباطل ما كانوا يعملون\nقوله تعالى إن هؤلاء متبر ما هم فيه أي مهلك ، والتبار : الهلاك . وكل إناء مكسر متبر . وأمر متبر . أي إن العابد والمعبود مهلكان .\nوباطل أي ذاهب مضمحل ما كانوا يعملون كانوا صلة زائدة .\n                                    ",
        "saadi": "إِنَّ هَٰٓؤُلَآءِ مُتَبَّرٞ مَّا هُمۡ فِيهِ وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ٩٣١\n                                        \n                                        \n                                        \n                                        ولهذا قال لهم موسى إِنَّ هَؤُلاءِ مُتَبَّرٌ مَا هُمْ فِيهِ وَبَاطِلٌ مَا كَانُوا يَعْمَلُونَ لأن دعاءهم إياها باطل، وهي باطلة بنفسها، فالعمل باطل وغايته باطلة.\n                                    "
      },
      "originalText": "إِنَّ هَٰٓؤُلَآءِ مُتَبَّرٞ مَّا هُمۡ فِيهِ وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ٩٣١"
    },
    {
      "number": 1094,
      "text": "قَالَ أَغَيْرَ اللَّهِ أَبْغِيكُمْ إِلَٰهًا وَهُوَ فَضَّلَكُمْ عَلَى الْعَالَمِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 140,
      "juz": 9,
      "manzil": 2,
      "page": 167,
      "ruku": 137,
      "hizbQuarter": 66,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ أَغَيۡرَ ٱللَّهِ أَبۡغِيكُمۡ إِلَٰهٗا وَهُوَ فَضَّلَكُمۡ عَلَى ٱلۡعَٰلَمِينَ ٠٤١\n                                    \n                                    \n                                    يذكرهم موسى ، عليه السلام ، بنعمة الله عليهم ، من إنقاذهم من أسر فرعون وقهره ، وما كانوا فيه من الهوان والذلة ، وما صاروا إليه من العزة والاشتفاء من عدوهم ، والنظر إليه في حال هوانه وهلاكه ، وغرقه ودماره . وقد تقدم تفسيرها في [ سورة ] البقرة .\n                                    ",
        "qortoby": "قَالَ أَغَيۡرَ ٱللَّهِ أَبۡغِيكُمۡ إِلَٰهٗا وَهُوَ فَضَّلَكُمۡ عَلَى ٱلۡعَٰلَمِينَ ٠٤١\n                                    \n                                    \n                                    قال أغير الله أبغيكم إلها أي أطلب لكم إلها غير الله تعالى . يقال : بغيته وبغيت له .\nوهو فضلكم على العالمين أي على عالمي زمانكم . وقيل : فضلهم بإهلاك عدوهم ، وبما خصهم به من الآيات .\n                                    ",
        "saadi": "قَالَ أَغَيۡرَ ٱللَّهِ أَبۡغِيكُمۡ إِلَٰهٗا وَهُوَ فَضَّلَكُمۡ عَلَى ٱلۡعَٰلَمِينَ ٠٤١\n                                        \n                                        \n                                        \n                                        قَالَ أَغَيْرَ اللَّهِ أَبْغِيكُمْ إِلَهًا أي: أأطلب لكم إلها غير اللّه المألوه، الكامل في ذاته، وصفاته وأفعاله. وَهُوَ فَضَّلَكُمْ عَلَى الْعَالَمِينَ فيقتضي أن تقابلوا فضله، وتفضيله بالشكر، وذلك بإفراده وحده بالعبادة، والكفر بما يدعي من دونه.\n                                    "
      },
      "originalText": "قَالَ أَغَيۡرَ ٱللَّهِ أَبۡغِيكُمۡ إِلَٰهٗا وَهُوَ فَضَّلَكُمۡ عَلَى ٱلۡعَٰلَمِينَ ٠٤١"
    },
    {
      "number": 1095,
      "text": "وَإِذْ أَنْجَيْنَاكُمْ مِنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ ۖ يُقَتِّلُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ ۚ وَفِي ذَٰلِكُمْ بَلَاءٌ مِنْ رَبِّكُمْ عَظِيمٌ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 141,
      "juz": 9,
      "manzil": 2,
      "page": 167,
      "ruku": 137,
      "hizbQuarter": 66,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ أَنجَيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُقَتِّلُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ ١٤١\n                                    \n                                    \n                                    يذكرهم موسى عليه السلام نعم الله عليهم من إنقاذهم من أسر فرعون وقهره وما كانوا فيه من الهوان والذلة وما صاروا إليه من العزة والاشتفاء من عدوهم والنظر إليه في حال هوانه وهلاكه وغرقة ودماره وقد تقدم تفسيرها في البقرة.\n                                    ",
        "qortoby": "وَإِذۡ أَنجَيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُقَتِّلُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ ١٤١\n                                    \n                                    \n                                    قوله تعالى وإذ أنجيناكم من آل فرعون يسومونكم سوء العذاب يقتلون أبناءكم ويستحيون نساءكم وفي ذلكم بلاء من ربكم عظيم ذكرهم منته . وقيل : هو خطاب ليهود عصر النبي صلى الله عليه وسلم . أي واذكروا إذ أنجينا أسلافكم . حسب ما تقدم بيانه في سورة \" البقرة \"\n                                    ",
        "saadi": "وَإِذۡ أَنجَيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُقَتِّلُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ ١٤١\n                                        \n                                        \n                                        \n                                        ثم ذكرهم بما امتن اللّه به عليهم فقال: وَإِذْ أَنْجَيْنَاكُمْ مِنْ آلِ فِرْعَوْنَ أي: من فرعون وآله يَسُومُونَكُمْ سُوءَ الْعَذَابِ أي: يوجهون إليكم من العذاب أسوأه، وهو أنهم كانوا يُقَتِّلُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ وَفِي ذَلِكُمْ النجاة من عذابهم بَلاءٌ مِنْ رَبِّكُمْ عَظِيمٌ أي: نعمة جليلة، ومنحة جزيلة، أو: وفي ذلك العذاب الصادر منهم لكم بلاء من ربكم عليكم عظيم، فلما ذكرهم موسى ووعظهم انتهوا عن ذلك.\n                                    "
      },
      "originalText": "وَإِذۡ أَنجَيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُقَتِّلُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ ١٤١"
    },
    {
      "number": 1096,
      "text": "۞ وَوَاعَدْنَا مُوسَىٰ ثَلَاثِينَ لَيْلَةً وَأَتْمَمْنَاهَا بِعَشْرٍ فَتَمَّ مِيقَاتُ رَبِّهِ أَرْبَعِينَ لَيْلَةً ۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَارُونَ اخْلُفْنِي فِي قَوْمِي وَأَصْلِحْ وَلَا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 142,
      "juz": 9,
      "manzil": 2,
      "page": 167,
      "ruku": 138,
      "hizbQuarter": 67,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَوَٰعَدۡنَا مُوسَىٰ ثَلَٰثِينَ لَيۡلَةٗ وَأَتۡمَمۡنَٰهَا بِعَشۡرٖ فَتَمَّ مِيقَٰتُ رَبِّهِۦٓ أَرۡبَعِينَ لَيۡلَةٗۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَٰرُونَ ٱخۡلُفۡنِي فِي قَوۡمِي وَأَصۡلِحۡ وَلَا تَتَّبِعۡ سَبِيلَ ٱلۡمُفۡسِدِينَ ٢٤١\n                                    \n                                    \n                                    يقول تعالى ممتنا على بني إسرائيل ، بما حصل لهم من الهداية ، بتكليمه موسى ، عليه السلام ، وإعطائه التوراة ، وفيها أحكامهم وتفاصيل شرعهم ، فذكر تعالى أنه واعد موسى ثلاثين ليلة .\nقال المفسرون : فصامها موسى ، عليه السلام ، فلما تم الميقات استاك بلحاء شجرة ، فأمره الله تعالى أن يكمل بعشر أربعين .\nوقد اختلف المفسرون في هذه العشر ما هي ؟ فالأكثرون على أن الثلاثين هي ذو القعدة ، والعشر عشر ذي الحجة . قاله مجاهد ، ومسروق ، وابن جريج . وروي عن ابن عباس . فعلى هذا يكون قد كمل الميقات يوم النحر ، وحصل فيه التكليم لموسى ، عليه السلام ، وفيه أكمل الله الدين لمحمد صلى الله عليه وسلم ، كما قال تعالى : ( ( 142 ) اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا ) [ المائدة : 3 ]\nفلما تم الميقات عزم موسى على الذهاب إلى الطور ، كما قال تعالى : ( يا بني إسرائيل قد أنجيناكم من عدوكم وواعدناكم جانب الطور الأيمن ) الآية [ طه : 80 ] ، فحينئذ استخلف موسى على بني إسرائيل أخاه هارون ، وأوصاه بالإصلاح وعدم الإفساد . وهذا تنبيه وتذكير ، وإلا فهارون ، عليه السلام ، نبي شريف كريم على الله ، له وجاهة وجلالة ، صلوات الله وسلامه عليه ، وعلى سائر الأنبياء .\n                                    ",
        "qortoby": "۞ وَوَٰعَدۡنَا مُوسَىٰ ثَلَٰثِينَ لَيۡلَةٗ وَأَتۡمَمۡنَٰهَا بِعَشۡرٖ فَتَمَّ مِيقَٰتُ رَبِّهِۦٓ أَرۡبَعِينَ لَيۡلَةٗۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَٰرُونَ ٱخۡلُفۡنِي فِي قَوۡمِي وَأَصۡلِحۡ وَلَا تَتَّبِعۡ سَبِيلَ ٱلۡمُفۡسِدِينَ ٢٤١\n                                    \n                                    \n                                    قوله تعالى وواعدنا موسى ثلاثين ليلة وأتممناها بعشر فتم ميقات ربه أربعين ليلة وقال موسى لأخيه هارون اخلفني في قومي وأصلح ولا تتبع سبيل المفسدين\nقوله تعالى وواعدنا موسى ثلاثين ليلة وأتممناها بعشر فتم ميقات ربه أربعين ليلة فيه ثلاث مسائل :\nالأولى قوله تعالى وواعدنا موسى ثلاثين ليلة ذكر أن مما كرم الله به موسى صلى الله عليه وسلم هذا فكان وعده المناجاة إكراما له . وأتممناها بعشر قال ابن عباس ومجاهد ومسروق رضي الله عنهم : هي ذو القعدة وعشر من ذي الحجة . أمره أن يصوم الشهر وينفرد فيه بالعبادة ; فلما صامه أنكر خلوف فمه فاستاك . قيل : بعود خرنوب ; فقالت الملائكة : إنا كنا نستنشق من فيك رائحة المسك فأفسدته بالسواك . فزيد عليه عشر ليال من ذي الحجة . وقيل : إن الله تعالى أوحى إليه لما استاك : يا موسى لا أكلمك حتى يعود فوك إلى ما كان عليه قبل ، أما علمت أن رائحة الصائم أحب إلي من ريح المسك . وأمره بصيام عشرة أيام . وكان كلام الله تعالى لموسى صلى الله عليه وسلم غداة النحر حين فدى إسماعيل من الذبح ، وأكمل لمحمد صلى الله عليه وسلم الحج . وحذفت الهاء من عشر لأن المعدود مؤنث . والفائدة في قوله : فتم ميقات ربه أربعين ليلة وقد علم أن ثلاثين وعشرة أربعون ، لئلا يتوهم أن المراد أتممنا الثلاثين بعشر منها ; فبين أن العشر سوى الثلاثين . فإن قيل : فقد قال في البقرة أربعين وقال هنا ثلاثين ; فيكون ذلك من البداء . قيل : ليس كذلك ; فقد قال : وأتممناها بعشر والأربعون ، والثلاثون والعشرة قول واحد ليس بمختلف . وإنما قال القولين على تفصيل وتأليف ; قال أربعين في قول مؤلف ، وقال ثلاثين ، يعني شهرا متتابعا وعشرا . وكل ذلك أربعون ; كما قال الشاعر :\nعشر وأربع\n. . . يعني أربع عشرة ، ليلة البدر . وهذا جائز في كلام العرب .\nالثانية : قال علماؤنا : دلت هذه الآية على أن ضرب الأجل للمواعدة سنة ماضية ، ومعنى قديما أسسه الله تعالى في القضايا ، وحكم به للأمم ، وعرفهم به مقادير التأني في الأعمال . وأول أجل ضربه الله تعالى الأيام الستة التي خلق فيها جميع المخلوقات ولقد خلقنا السماوات والأرض وما بينهما في ستة أيام وما مسنا من لغوب . وقد بينا معناه فيما تقدم في هذه السورة من قوله : إن ربكم الله الذي خلق السماوات والأرض في ستة أيام . قال ابن العربي : فإذا ضرب الأجل لمعنى يحاول فيه تحصيل المؤجل فجاء الأجل ولم يتيسر زيد فيه تبصرة ومعذرة . وقد بين الله تعالى ذلك لموسى عليه السلام فضرب له أجلا ثلاثين ثم زاده عشرا تتمة أربعين . وأبطأ موسى عليه السلام في هذه العشر على قومه ; فما عقلوا جواز التأني والتأخر حتى قالوا : إن موسى ضل أو نسي ، ونكثوا عهده وبدلوا بعده ، وعبدوا إلها غير الله . قال ابن عباس : إن موسى قال لقومه : إن ربي وعدني ثلاثين ليلة أن ألقاه ، وأخلف فيكم هارون ، فلما فصل موسى إلى ربه زاده الله عشرا ; فكانت فتنتهم في العشر التي زاده الله بما فعلوه من عبادة العجل ; على ما يأتي بيانه . ثم الزيادة التي تكون على الأجل تكون مقدرة ; كما أن الأجل مقدر . ولا يكون إلا باجتهاد من الحاكم بعد النظر إلى المعاني المتعلقة بالأمر : من وقت وحال وعمل ، فيكون مثل ثلث المدة السالفة ; كما أجل الله لموسى . فإن رأى الحاكم أن يجمع له الأصل في الأجل والزيادة في مدة واحدة جاز ، ولكن لا بد من التربص بعدها لما يطرأ من العذر على البشر ، قال ابن العربي . روى البخاري عن أبي هريرة عن النبي صلى الله عليه وسلم قال : أعذر الله إلى امرئ أخر أجله حتى بلغ ستين سنة .\nقلت : وهذا أيضا أصل لإعذار الحكام إلى المحكوم عليه مرة بعد أخرى . وكان هذا لطفا بالخلق ، ولينفذ القيام عليهم بالحق . يقال : أعذر في الأمر أي بالغ فيه ; أي أعذر غاية الإعذار الذي لا إعذار بعده . وأكبر الإعذار إلى بني آدم بعثة الرسل إليهم لتتم حجته عليهم ، وما كنا معذبين حتى نبعث رسولا . وقال وجاءكم النذير قيل : هم الرسل . ابن عباس : هو الشيب . فإنه يأتي في سن الاكتهال ، فهو علامة لمفارقة سن الصبا . وجعل الستين غاية الإعذار لأن الستين قريب من معترك العباد ، وهو سن الإنابة والخشوع والاستسلام لله ، وترقب المنية ولقاء الله ; ففيه إعذار بعد إعذار . الأول بالنبي عليه السلام ، والثاني بالشيب ; وذلك عند كمال الأربعين ; قال الله تعالى : وبلغ أربعين سنة قال رب أوزعني أن أشكر نعمتك . فذكر عز وجل أن من بلغ أربعين فقد آن له أن يعلم مقدار نعم الله عليه وعلى والديه ويشكرها . قال مالك : أدركت أهل العلم ببلدنا ، وهم يطلبون الدنيا ويخالطون الناس حتى يأتي لأحدهم أربعون سنة ; فإذا أتت عليهم اعتزلوا الناس .\nالثالثة : ودلت الآية أيضا على أن التاريخ يكون بالليالي دون الأيام ; لقوله تعالى : ثلاثين ليلة لأن الليالي أوائل الشهور . وبها كانت الصحابة رضي الله عنهم تخبر عن الأيام ; حتى روي عنها أنها كانت تقول : صمنا خمسا مع رسول الله صلى الله عليه وسلم . والعجم تخالف في ذلك ، فتحسب بالأيام ; لأن معولها على الشمس . ابن العربي : وحساب الشمس للمنافع ، وحساب القمر للمناسك ; ولهذا قال : وواعدنا موسى ثلاثين ليلة . فيقال : أرخت تاريخا ، وورخت توريخا ; لغتان .\nوقال موسى لأخيه هارون اخلفني في قومي وأصلح المعنى : وقال موسى حين أراد المضي للمناجاة والمغيب فيها لأخيه هارون : كن خليفتي ; فدل على النيابة . وفي صحيح مسلم عن سعد بن أبي وقاص قال : سمعت رسول الله صلى الله عليه وسلم يقول لعلي حين خلفه في بعض مغازيه : أما ترضى أن تكون مني بمنزلة هارون من موسى إلا أنه لا نبي بعدي . فاستدل بهذا الروافض والإمامية وسائر فرق الشيعة على أن النبي صلى الله عليه وسلم استخلف عليا على جميع الأمة ; حتى كفر الصحابة الإمامية - قبحهم الله - لأنهم عندهم تركوا العمل الذي هو النص على استخلاف علي واستخلفوا غيره بالاجتهاد منهم . ومنهم من كفر عليا إذ لم يقم بطلب حقه . وهؤلاء لا شك في كفرهم وكفر من تبعهم على مقالتهم ، ولم يعلموا أن هذا استخلاف في حياة كالوكالة التي تنقضي بعزل الموكل أو بموته ، لا يقتضي أنه متماد بعد وفاته ; فينحل على هذا ما تعلق به الإمامية وغيرهم . وقد استخلف النبي صلى الله عليه وسلم على المدينة ابن أم مكتوم وغيره ، ولم يلزم من ذلك استخلافه دائما بالاتفاق . على أنه قد كان هارون شرك مع موسى في أصل الرسالة ، فلا يكون لهم فيه على ما راموه دلالة . والله الموفق للهداية .\nقوله تعالى : وأصلح أمر بالإصلاح . قال ابن جريج : كان من الإصلاح أن يزجر السامري ويغير عليه . وقيل : أي ارفق بهم ، وأصلح أمرهم ، وأصلح نفسك ; أي كن مصلحا .\nولا تتبع سبيل المفسدين أي لا تسلك سبيل العاصين ، ولا تكن عونا للظالمين .\n                                    ",
        "saadi": "۞ وَوَٰعَدۡنَا مُوسَىٰ ثَلَٰثِينَ لَيۡلَةٗ وَأَتۡمَمۡنَٰهَا بِعَشۡرٖ فَتَمَّ مِيقَٰتُ رَبِّهِۦٓ أَرۡبَعِينَ لَيۡلَةٗۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَٰرُونَ ٱخۡلُفۡنِي فِي قَوۡمِي وَأَصۡلِحۡ وَلَا تَتَّبِعۡ سَبِيلَ ٱلۡمُفۡسِدِينَ ٢٤١\n                                        \n                                        \n                                        \n                                        ولما أتم اللّه نعمته عليهم بالنجاة من عدوهم، وتمكينهم في الأرض، أراد تبارك وتعالى أن يتم نعمته عليهم، بإنزال الكتاب الذي فيه الأحكام الشرعية، والعقائد المرضية، فواعد موسى ثلاثين ليلة، وأتمها بعشر، فصارت أربعين ليلة، ليستعد موسى، ويتهيأ لوعد اللّه، ويكون لنزولها موقع كبير لديهم، وتشوق إلى إنزالها.\nولما ذهب موسى إلى ميقات ربه قال لهارون موصيا له على بني إسرائيل من حرصه عليهم وشفقته: اخْلُفْنِي فِي قَوْمِي أي: كن خليفتي فيهم، واعمل فيهم بما كنت أعمل، وَأَصْلِحْ أي: اتبع طريق الصلاح وَلا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ وهم الذين يعملون بالمعاصي.\n                                    "
      },
      "originalText": "۞ وَوَٰعَدۡنَا مُوسَىٰ ثَلَٰثِينَ لَيۡلَةٗ وَأَتۡمَمۡنَٰهَا بِعَشۡرٖ فَتَمَّ مِيقَٰتُ رَبِّهِۦٓ أَرۡبَعِينَ لَيۡلَةٗۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَٰرُونَ ٱخۡلُفۡنِي فِي قَوۡمِي وَأَصۡلِحۡ وَلَا تَتَّبِعۡ سَبِيلَ ٱلۡمُفۡسِدِينَ ٢٤١"
    },
    {
      "number": 1097,
      "text": "وَلَمَّا جَاءَ مُوسَىٰ لِمِيقَاتِنَا وَكَلَّمَهُ رَبُّهُ قَالَ رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ ۚ قَالَ لَنْ تَرَانِي وَلَٰكِنِ انْظُرْ إِلَى الْجَبَلِ فَإِنِ اسْتَقَرَّ مَكَانَهُ فَسَوْفَ تَرَانِي ۚ فَلَمَّا تَجَلَّىٰ رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وَخَرَّ مُوسَىٰ صَعِقًا ۚ فَلَمَّا أَفَاقَ قَالَ سُبْحَانَكَ تُبْتُ إِلَيْكَ وَأَنَا أَوَّلُ الْمُؤْمِنِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 143,
      "juz": 9,
      "manzil": 2,
      "page": 167,
      "ruku": 138,
      "hizbQuarter": 67,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَمَّا جَآءَ مُوسَىٰ لِمِيقَٰتِنَا وَكَلَّمَهُۥ رَبُّهُۥ قَالَ رَبِّ أَرِنِيٓ أَنظُرۡ إِلَيۡكَۚ قَالَ لَن تَرَىٰنِي وَلَٰكِنِ ٱنظُرۡ إِلَى ٱلۡجَبَلِ فَإِنِ ٱسۡتَقَرَّ مَكَانَهُۥ فَسَوۡفَ تَرَىٰنِيۚ فَلَمَّا تَجَلَّىٰ رَبُّهُۥ لِلۡجَبَلِ جَعَلَهُۥ دَكّٗا وَخَرَّ مُوسَىٰ صَعِقٗاۚ فَلَمَّآ أَفَاقَ قَالَ سُبۡحَٰنَكَ تُبۡتُ إِلَيۡكَ وَأَنَا۠ أَوَّلُ ٱلۡمُؤۡمِنِينَ ٣٤١\n                                    \n                                    \n                                    يخبر تعالى عن موسى ، عليه السلام ، أنه لما جاء لميقات الله تعالى ، وحصل له التكليم من الله [ تعالى ] سأل الله تعالى أن ينظر إليه فقال : ( ( 143 ) رب أرني أنظر إليك قال لن تراني )\nوقد أشكل حرف \" لن \" هاهنا على كثير من العلماء ; لأنها موضوعة لنفي التأبيد ، فاستدل به المعتزلة على نفي الرؤية في الدنيا والآخرة . وهذا أضعف الأقوال ; لأنه قد تواترت الأحاديث عن رسول الله صلى الله عليه وسلم بأن المؤمنين يرون الله في الدار الآخرة ، كما سنوردها عند قوله تعالى : ( وجوه يومئذ ناضرة إلى ربها ناظرة ووجوه يومئذ باسرة ) [ القيامة : 22 ، 23 ] .\nوقوله تعالى إخبارا عن الكفار : ( كلا إنهم عن ربهم يومئذ لمحجوبون ) [ المطففين : 15 ]\nوقيل : إنها لنفي التأبيد في الدنيا ، جمعا بين هذه الآية ، وبين الدليل القاطع على صحة الرؤية في الدار الآخرة .\nوقيل : إن هذا الكلام في هذا المقام كالكلام في قوله تعالى : ( لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير ) وقد تقدم ذلك في الأنعام [ الآية : 103 ] .\nوفي الكتب المتقدمة أن الله تعالى قال لموسى ، عليه السلام : \" يا موسى ، إنه لا يراني حي إلا مات ، ولا يابس إلا تدهده \" ; ولهذا قال تعالى : ( فلما تجلى ربه للجبل جعله دكا وخر موسى صعقا )\nقال أبو جعفر بن جرير الطبري في تفسير هذه الآية : حدثنا أحمد بن سهيل الواسطي ، حدثنا قرة بن عيسى ، حدثنا الأعمش ، عن رجل ، عن أنس ، عن النبي صلى الله عليه وسلم قال : \" لما تجلى ربه للجبل ، أشار بإصبعه فجعله دكا \" وأرانا أبو إسماعيل بإصبعه السبابة\nهذا الإسناد فيه رجل مبهم لم يسم ، ثم قال\nحدثني المثنى ، حدثنا حجاج بن منهال ، حدثنا حماد ، عن ليث ، عن أنس ; أن النبي صلى الله عليه وسلم قرأ هذه الآية : ( فلما تجلى ربه للجبل جعله دكا ) قال : \" هكذا بإصبعه - ووضع النبي صلى الله عليه وسلم إصبعه الإبهام على المفصل الأعلى من الخنصر - فساخ الجبل \"\nهكذا وقع في هذه الرواية \" حماد بن سلمة ، عن ليث ، عن أنس \" . والمشهور : \" حماد بن سلمة ، عن ثابت ، عن أنس \" ، كما قال ابن جرير :\nحدثني المثنى ، حدثنا هدبة بن خالد ، حدثنا حماد بن سلمة ، عن ثابت ، عن أنس قال : قرأ رسول الله صلى الله عليه وسلم : قال ( فلما تجلى ربه للجبل جعله دكا ) قال : وضع الإبهام قريبا من طرف خنصره ، قال : فساخ الجبل - قال حميد لثابت : تقول هذا ؟ فرفع ثابت يده فضرب صدر حميد ، وقال : يقوله رسول الله صلى الله عليه وسلم ، ويقوله أنس وأنا أكتمه ؟\nوهكذا رواه الإمام أحمد في مسنده : حدثنا أبو المثنى ، معاذ بن معاذ العنبري ، حدثنا حماد بن سلمة ، حدثنا ثابت البناني ، عن أنس بن مالك ، عن النبي صلى الله عليه وسلم في قوله : ( فلما تجلى ربه للجبل جعله دكا ) قال : قال هكذا - يعني أنه أخرج طرف الخنصر - قال أحمد : أرانا معاذ ، فقال له حميد الطويل : ما تريد إلى هذا يا أبا محمد ؟ قال : فضرب صدره ضربة شديدة وقال : من أنت يا حميد ؟ ! وما أنت يا حميد ؟ ! يحدثني به أنس بن مالك عن النبي صلى الله عليه وسلم ، فتقول أنت : ما تريد إليه ؟ !\nوهكذا رواه الترمذي في تفسير هذه الآية عن عبد الوهاب بن الحكم الوراق ، عن معاذ بن معاذ به . وعن عبد الله بن عبد الرحمن الدارمي ، عن سليمان بن حرب ، عن حماد بن سلمة به ثم قال : هذا حديث حسن صحيح غريب ، لا نعرفه إلا من حديث حماد .\nوهكذا رواه الحاكم في مستدركه من طرق ، عن حماد بن سلمة ، به . وقال : هذا حديث صحيح على شرط مسلم ، ولم يخرجاه\nورواه أبو محمد الحسن بن محمد الخلال ، عن محمد بن علي بن سويد ، عن أبي القاسم البغوي ، عن هدبة بن خالد ، عن حماد بن سلمة ، فذكره وقال : هذا إسناد صحيح لا علة فيه .\nوقد رواه داود بن المحبر ، عن شعبة ، عن ثابت ، عن أنس مرفوعا وهذا ليس بشيء ، لأن داود بن المحبر كذاب ورواه الحافظان أبو القاسم الطبراني وأبو بكر بنحوه\nوأسنده ابن مردويه من طريقين ، عن سعيد بن أبي عروبة ، عن قتادة ، عن أنس مرفوعا بنحوه ، وأسنده ابن مردويه من طريق ابن البيلماني ، عن أبيه ، عن ابن عمر مرفوعا ، ولا يصح أيضا .\nوقال السدي ، عن عكرمة ، عن ابن عباس في قول الله تعالى : ( فلما تجلى ربه للجبل ) قال : ما تجلى منه إلا قدر الخنصر ( جعله دكا ) قال : ترابا ( وخر موسى صعقا ) قال : مغشيا عليه . رواه ابن جرير .\nوقال قتادة : ( وخر موسى صعقا ) قال : ميتا .\nوقال سفيان الثوري : ساخ الجبل في الأرض ، حتى وقع في البحر فهو يذهب معه\nوقال سنيد ، عن حجاج بن محمد الأعور ، عن أبي بكر الهذلي : ( فلما تجلى ربه للجبل جعله دكا ) انقعر فدخل تحت الأرض ، فلا يظهر إلى يوم القيامة .\nوجاء في بعض الأخبار أنه ساخ في الأرض ، فهو يهوي فيها إلى يوم القيامة ، رواه ابن مردويه .\nوقال ابن أبي حاتم : حدثنا عمر بن شبة ، حدثنا محمد بن يحيى أبو غسان الكناني ، حدثنا عبد العزيز بن عمران ، عن معاوية بن عبد الله ، عن الجلد بن أيوب ، عن معاوية بن قرة ، عن أنس بن مالك ; أن النبي صلى الله عليه وسلم قال : \" لما تجلى الله للجبال طارت لعظمته ستة أجبل ، فوقعت ثلاثة بالمدينة وثلاثة بمكة ، بالمدينة : أحد ، وورقان ، ورضوى . ووقع بمكة : حراء ، وثبير ، وثور \" .\nوهذا حديث غريب ، بل منكر\nوقال ابن أبي حاتم : ذكر عن محمد بن عبد الله بن أبي الثلج ، حدثنا الهيثم بن خارجة ، حدثنا عثمان بن حصين بن علاق ، عن عروة بن رويم قال : كانت الجبال قبل أن يتجلى الله لموسى على الطور صما ملسا ، فلما تجلى الله لموسى على الطور دك وتفطرت الجبال فصارت الشقوق والكهوف .\nوقال الربيع بن أنس : ( فلما تجلى ربه للجبل جعله دكا وخر موسى صعقا ) وذلك أن الجبل حين كشف الغطاء ورأى النور ، صار مثل دك من الدكاك . وقال بعضهم : ( جعله دكا ) أي : فتته .\nوقال مجاهد في قوله : ( ولكن انظر إلى الجبل فإن استقر مكانه فسوف تراني ) فإنه أكبر منك وأشد خلقا ، ( فلما تجلى ربه للجبل ) فنظر إلى الجبل لا يتمالك ، وأقبل الجبل فدك على أوله ، ورأى موسى ما يصنع الجبل ، فخر صعقا .\nوقال عكرمة : ( جعله دكا ) قال : نظر الله إلى الجبل ، فصار صحراء ترابا .\nوقد قرأ بهذه القراءة بعض القراء ، واختارها ابن جرير ، وقد ورد فيها حديث مرفوع ، رواه ابن مردويه .\nوالمعروف أن \" الصعق \" هو الغشي هاهنا ، كما فسره ابن عباس وغيره ، لا كما فسره قتادة بالموت ، وإن كان ذلك صحيحا في اللغة ، كقوله تعالى : ( ونفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله ثم نفخ فيه أخرى فإذا هم قيام ينظرون ) [ الزمر : 68 ] فإن هناك قرينة تدل على الموت كما أن هنا قرينة تدل على الغشي ، وهي قوله : ( فلما أفاق ) والإفاقة إنما تكون من غشي .\n( قال سبحانك ) تنزيها وتعظيما وإجلالا أن يراه أحد من الدنيا إلا مات .\nوقوله : ( تبت إليك ) قال مجاهد : أن أسألك الرؤية .\n( وأنا أول المؤمنين ) قال ابن عباس ومجاهد : من بني إسرائيل . واختاره ابن جرير . وفي رواية أخرى عن ابن عباس : ( وأنا أول المؤمنين ) أنه لا يراك أحد . وكذا قال أبو العالية : قد كان قبله مؤمنون ، ولكن يقول : أنا أول من آمن بك أنه لا يراك أحد من خلقك إلى يوم القيامة .\nوهذا قول حسن له اتجاه . وقد ذكر محمد بن جرير في تفسيره هاهنا أثرا طويلا فيه غرائب وعجائب ، عن محمد بن إسحاق بن يسار رحمه الله وكأنه تلقاه من الإسرائيليات والله تعالى أعلم .\nوقوله : ( وخر موسى صعقا ) فيه أبو سعيد وأبو هريرة ، عن النبي صلى الله عليه وسلم فأما حديث أبي سعيد ، فأسنده البخاري في صحيحه هاهنا ، فقال :\nحدثنا محمد بن يوسف ، حدثنا سفيان ، عن عمرو بن يحيى المازني ، عن أبيه ، عن أبي سعيد الخدري ، رضي الله عنه ، قال : جاء رجل من اليهود إلى النبي صلى الله عليه وسلم قد لطم وجهه ، فقال : يا محمد ، إن رجلا من أصحابك من الأنصار لطم وجهي . قال : \" ادعوه \" فدعوه ، قال : \" لم لطمت وجهه ؟ \" قال : يا رسول الله ، إني مررت باليهودي فسمعته يقول : والذي اصطفى موسى على البشر .\nقال : قلت : وعلى محمد ؟ فأخذتني غضبة فلطمته ، قال : \" لا تخيروني من بين الأنبياء ، فإن الناس يصعقون يوم القيامة ، فأكون أول من يفيق ، فإذا أنا بموسى آخذ بقائمة من قوائم العرش ، فلا أدري أفاق قبلي أم جوزي بصعقة الطور \" .\nوقد رواه البخاري في أماكن كثيرة من صحيحه ، ومسلم في أحاديث الأنبياء من صحيحه ، وأبو داود في كتاب \" السنة \" من سننه من طرق ، عن عمرو بن يحيى بن عمارة بن أبي الحسن المازني الأنصاري المدني ، عن أبيه ، عن أبي سعيد سعد بن مالك بن سنان الخدري ، به\nوأما حديث أبي هريرة فقال الإمام أحمد في مسنده :\nحدثنا أبو كامل ، حدثنا إبراهيم بن سعد ، حدثنا ابن شهاب ، عن أبي سلمة بن عبد الرحمن وعبد الرحمن الأعرج ، عن أبي هريرة ، رضي الله عنه ، قال : استب رجلان : رجل من المسلمين ، ورجل من اليهود ، فقال المسلم : والذي اصطفى محمدا على العالمين . وقال اليهودي : والذي اصطفى موسى على العالمين ، فغضب المسلم على اليهودي فلطمه ، فأتى اليهودي رسول الله صلى الله عليه وسلم ، فسأله فأخبره ، فدعاه رسول الله صلى الله عليه وسلم ، فاعترف بذلك ، فقال رسول الله صلى الله عليه وسلم : \" لا تخيروني على موسى ; فإن الناس يصعقون يوم القيامة ، فأكون أول من يفيق ، فأجد موسى ممسكا بجانب العرش ، فلا أدري أكان ممن صعق فأفاق قبلي ، أم كان ممن استثناه الله ، عز وجل \" . أخرجاه في الصحيحين ، من حديث الزهري ، به\nوقد روى الحافظ أبو بكر بن أبي الدنيا ، رحمه الله : أن الذي لطم اليهودي في هذه القضية هو أبو بكر الصديق ، رضي الله عنه ولكن تقدم في الصحيحين أنه رجل من الأنصار ، وهذا هو أصح وأصرح ، والله أعلم .\nوالكلام في قوله ، عليه السلام : \" لا تخيروني على موسى \" ، كالكلام على قوله : \" لا تفضلوني على الأنبياء ولا على يونس بن متى \" ، قيل : من باب التواضع . وقيل : قبل أن يعلم بذلك . وقيل : نهى أن يفضل بينهم على وجه الغضب والتعصب . وقيل : على وجه القول بمجرد الرأي والتشهي ، والله أعلم .\nوقوله : \" فإن الناس يصعقون يوم القيامة \" ، الظاهر أن هذا الصعق يكون في عرصات القيامة ، يحصل أمر يصعقون منه ، والله أعلم به . وقد يكون ذلك إذا جاء الرب تبارك وتعالى لفصل القضاء ، وتجلى للخلائق الملك الديان ، كما صعق موسى من تجلي الرب ، عز وجل ، ولهذا قال ، عليه السلام : \" فلا أدري أفاق قبلي أم جوزي بصعقة الطور \" ؟\nوقد روى القاضي عياض في أوائل كتابه \" الشفاء \" بسنده عن محمد بن محمد بن مرزوق : حدثنا قتادة ، حدثنا الحسن ، عن قتادة ، عن يحيى بن وثاب ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم قال : \" لما تجلى الله لموسى ، عليه السلام ، كان يبصر النملة على الصفا في الليلة الظلماء ، مسيرة عشرة فراسخ \" ثم قال : \" ولا يبعد على هذا أن يختص نبيا بما ذكرناه من هذا الباب ، بعد الإسراء والحظوة بما رأى من آيات ربه الكبرى .\nانتهى ما قاله ، وكأنه صحح هذا الحديث ، وفي صحته نظر ، ولا يخلو رجال إسناده من مجاهيل لا يعرفون ، ومثل هذا إنما يقبل من رواية العدل الضابط عن مثله ، حتى ينتهي إلى منتهاه ، والله أعلم .\n                                    ",
        "qortoby": "وَلَمَّا جَآءَ مُوسَىٰ لِمِيقَٰتِنَا وَكَلَّمَهُۥ رَبُّهُۥ قَالَ رَبِّ أَرِنِيٓ أَنظُرۡ إِلَيۡكَۚ قَالَ لَن تَرَىٰنِي وَلَٰكِنِ ٱنظُرۡ إِلَى ٱلۡجَبَلِ فَإِنِ ٱسۡتَقَرَّ مَكَانَهُۥ فَسَوۡفَ تَرَىٰنِيۚ فَلَمَّا تَجَلَّىٰ رَبُّهُۥ لِلۡجَبَلِ جَعَلَهُۥ دَكّٗا وَخَرَّ مُوسَىٰ صَعِقٗاۚ فَلَمَّآ أَفَاقَ قَالَ سُبۡحَٰنَكَ تُبۡتُ إِلَيۡكَ وَأَنَا۠ أَوَّلُ ٱلۡمُؤۡمِنِينَ ٣٤١\n                                    \n                                    \n                                    قوله تعالى ولما جاء موسى لميقاتنا وكلمه ربه قال رب أرني أنظر إليك قال لن تراني ولكن انظر إلى الجبل فإن استقر مكانه فسوف تراني فلما تجلى ربه للجبل جعله دكا وخر موسى صعقا فلما أفاق قال سبحانك تبت إليك وأنا أول المؤمنين\nقوله تعالى ولما جاء موسى لميقاتنا أي في الوقت الموعود وكلمه ربه أي أسمعه كلامه من غير واسطة .\nقال رب أرني أنظر إليك سأل النظر إليه ; واشتاق إلى رؤيته لما أسمعه كلامه .\nقال لن تراني أي في الدنيا . ولا يجوز الحمل على أنه أراد : أرني آية عظيمة لأنظر إلى قدرتك ; لأنه قال إليك و قال لن تراني ولو سأل آية لأعطاه الله ما سأل ، كما أعطاه سائر الآيات . وقد كان لموسى عليه السلام فيها مقنع عن طلب آية أخرى ; فبطل هذا التأويل .\nولكن انظر إلى الجبل فإن استقر مكانه فسوف تراني ضرب له مثالا مما هو أقوى من بنيته وأثبت . أي فإن ثبت الجبل وسكن فسوف تراني ، وإن لم يسكن فإنك لا تطيق رؤيتي ، كما أن الجبل لا يطيق رؤيتي . وذكر القاضي عياض عن القاضي أبي بكر بن الطيب ما معناه : أن موسى عليه السلام رأى الله فلذلك خر صعقا ، وأن الجبل رأى ربه فصار دكا بإدراك خلقه الله له . واستنبط ذلك من قوله : ولكن انظر إلى الجبل فإن استقر مكانه فسوف تراني . ثم قال فلما تجلى ربه للجبل جعله دكا وخر موسى صعقا وتجلى معناه ظهر ; من قولك : جلوت العروس أي أبرزتها . وجلوت السيف أبرزته من الصدأ ; جلاء فيهما . وتجلى الشيء انكشف . وقيل : تجلى أمره وقدرته ; قاله قطرب وغيره . وقراءة أهل المدينة وأهل البصرة دكا ; يدل على صحتها دكت الأرض دكا وأن الجبل مذكر . وقرأ أهل الكوفة دكاء أي جعله مثل أرض دكاء ، وهي الناتئة لا تبلغ أن تكون جبلا . والمذكر أدك ، وجمع دكاء دكاوات ودك ; مثل حمراوات وحمر . قال الكسائي : الدك من الجبال : العراض ، واحدها أدك . غيره : والدكاوات جمع دكاء : رواب من طين ليست بالغلاظ . والدكداك كذلك من الرمل : ما التبد بالأرض فلم يرتفع . وناقة دكاء لا سنام لها . وفي التفسير : فساخ الجبل في الأرض ; فهو يذهب فيها حتى الآن . وقال ابن عباس : جعله ترابا . عطية العوفي : رملا هائلا .\nوخر موسى صعقا أي مغشيا عليه ; عن ابن عباس والحسن وقتادة . وقيل : ميتا ; يقال : صعق الرجل فهو صعق . وصعق فهو مصعوق . وقال قتادة والكلبي : خر موسى صعقا يوم الخميس يوم عرفة ، وأعطي التوراة يوم الجمعة يوم النحر .\nفلما أفاق قال سبحانك تبت إليك قال مجاهد : من مسألة الرؤية في الدنيا . وقيل : سأل من غير استئذان ; فلذلك تاب . وقيل : قاله على جهة الإنابة إلى الله والخشوع له عند ظهور الآيات . وأجمعت الأمة على أن هذه التوبة ما كانت عن معصية ; فإن الأنبياء معصومون . وأيضا عند أهل السنة والجماعة الرؤية جائزة . وعند المبتدعة سأل لأجل القوم ليبين لهم أنها غير جائزة ، وهذا لا يقتضي التوبة . فقيل : أي تبت إليك من قتل القبطي ; ذكره القشيري . وقد مضى في \" الأنعام \" بيان أن الرؤية جائزة . قال علي بن مهدي الطبري : لو كان سؤال موسى مستحيلا ما أقدم عليه مع معرفته بالله ; كما لم يجز أن يقول له يا رب ألك صاحبة وولد . وسيأتي في \" القيامة \" مذهب المعتزلة والرد عليهم ، إن شاء الله تعالى .\nقوله تعالى وأنا أول المؤمنين قيل : من قومي . وقيل : من بني إسرائيل في هذا العصر . وقيل : بأنك لا ترى في الدنيا لوعدك السابق ، في ذلك . وفي الحديث الصحيح من حديث أبي هريرة وغيره أن رسول الله صلى الله عليه وسلم قال : لا تخيروا بين الأنبياء فإن الناس يصعقون يوم القيامة فأرفع رأسي فإذا أنا بموسى آخذ بقائمة من قوائم العرش فلا أدري أصعق فيمن صعق فأفاق قبلي أو حوسب بصعقته الأولى . أو قال كفته صعقته الأولى . وذكر أبو بكر بن أبي شيبة عن كعب قال : إن الله تبارك وتعالى قسم كلامه ورؤيته بين محمد وموسى صلى الله وسلم عليهما ; فكلمه موسى مرتين ، ورآه محمد صلى الله عليه وسلم مرتين .\n                                    ",
        "saadi": "وَلَمَّا جَآءَ مُوسَىٰ لِمِيقَٰتِنَا وَكَلَّمَهُۥ رَبُّهُۥ قَالَ رَبِّ أَرِنِيٓ أَنظُرۡ إِلَيۡكَۚ قَالَ لَن تَرَىٰنِي وَلَٰكِنِ ٱنظُرۡ إِلَى ٱلۡجَبَلِ فَإِنِ ٱسۡتَقَرَّ مَكَانَهُۥ فَسَوۡفَ تَرَىٰنِيۚ فَلَمَّا تَجَلَّىٰ رَبُّهُۥ لِلۡجَبَلِ جَعَلَهُۥ دَكّٗا وَخَرَّ مُوسَىٰ صَعِقٗاۚ فَلَمَّآ أَفَاقَ قَالَ سُبۡحَٰنَكَ تُبۡتُ إِلَيۡكَ وَأَنَا۠ أَوَّلُ ٱلۡمُؤۡمِنِينَ ٣٤١\n                                        \n                                        \n                                        \n                                        وَلَمَّا جَاءَ مُوسَى لِمِيقَاتِنَا الذي وقتناه له لإنزال الكتاب وَكَلَّمَهُ رَبُّهُ بما كلمه من وحيه وأمره ونهيه، تشوق إلى رؤية اللّه، ونزعت نفسه لذلك، حبا لربه ومودة لرؤيته.\nفـ قَالَ رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ قَالَ اللَّهِ لَنْ تَرَانِي أي: لن تقدر الآن على رؤيتي، فإن اللّه تبارك وتعالى أنشأ الخلق في هذه الدار على نشأة لا يقدرون بها، ولا يثبتون لرؤية اللّه، وليس في هذا دليل على أنهم لا يرونه في الجنة، فإنه قد دلت النصوص القرآنية والأحاديث النبوية على أن أهل الجنة يرون ربهم تبارك وتعالى ويتمتعون بالنظر إلى وجهه الكريم، وأنه ينشئهم نشأة كاملة، يقدرون معها على رؤية اللّه تعالى، ولهذا رتب اللّه الرؤية في هذه الآية على ثبوت الجبل، فقال - مقنعا لموسى في عدم إجابته للرؤية - وَلَكِنِ انْظُرْ إِلَى الْجَبَلِ فَإِنِ اسْتَقَرَّ مَكَانَهُ إذا تجلى اللّه له فَسَوْفَ تَرَانِي .\nفَلَمَّا تَجَلَّى رَبُّهُ لِلْجَبَلِ الأصم الغليظ جَعَلَهُ دَكًّا أي: انهال مثل الرمل، انزعاجا من رؤية اللّه وعدم ثبوته لها وَخَرَّ مُوسَى حين رأى ما رأى صَعِقًا فتبين له حينئذ أنه إذا لم يثبت الجبل لرؤية اللّه، فموسى أولى أن لا يثبت لذلك، واستغفر ربه لما صدر منه من السؤال، الذي لم يوافق موضعا و [ لذلك ] قَالَ سُبْحَانَكَ أي: تنزيها لك، وتعظيما عما لا يليق بجلالك تُبْتُ إِلَيْكَ من جميع الذنوب، وسوء الأدب معك وَأَنَا أَوَّلُ الْمُؤْمِنِينَ أي: جدد عليه الصلاة والسلام إيمانه، بما كمل اللّه له مما كان يجهله قبل ذلك، فلما منعه اللّه من رؤيته - بعدما ما كان متشوقا إليها - أعطاه خيرا كثيرا فقال:\n                                    "
      },
      "originalText": "وَلَمَّا جَآءَ مُوسَىٰ لِمِيقَٰتِنَا وَكَلَّمَهُۥ رَبُّهُۥ قَالَ رَبِّ أَرِنِيٓ أَنظُرۡ إِلَيۡكَۚ قَالَ لَن تَرَىٰنِي وَلَٰكِنِ ٱنظُرۡ إِلَى ٱلۡجَبَلِ فَإِنِ ٱسۡتَقَرَّ مَكَانَهُۥ فَسَوۡفَ تَرَىٰنِيۚ فَلَمَّا تَجَلَّىٰ رَبُّهُۥ لِلۡجَبَلِ جَعَلَهُۥ دَكّٗا وَخَرَّ مُوسَىٰ صَعِقٗاۚ فَلَمَّآ أَفَاقَ قَالَ سُبۡحَٰنَكَ تُبۡتُ إِلَيۡكَ وَأَنَا۠ أَوَّلُ ٱلۡمُؤۡمِنِينَ ٣٤١"
    }
  ]
}