{
  "number": 169,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 1104,
      "text": "وَلَمَّا رَجَعَ مُوسَىٰ إِلَىٰ قَوْمِهِ غَضْبَانَ أَسِفًا قَالَ بِئْسَمَا خَلَفْتُمُونِي مِنْ بَعْدِي ۖ أَعَجِلْتُمْ أَمْرَ رَبِّكُمْ ۖ وَأَلْقَى الْأَلْوَاحَ وَأَخَذَ بِرَأْسِ أَخِيهِ يَجُرُّهُ إِلَيْهِ ۚ قَالَ ابْنَ أُمَّ إِنَّ الْقَوْمَ اسْتَضْعَفُونِي وَكَادُوا يَقْتُلُونَنِي فَلَا تُشْمِتْ بِيَ الْأَعْدَاءَ وَلَا تَجْعَلْنِي مَعَ الْقَوْمِ الظَّالِمِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 150,
      "juz": 9,
      "manzil": 2,
      "page": 169,
      "ruku": 139,
      "hizbQuarter": 67,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَمَّا رَجَعَ مُوسَىٰٓ إِلَىٰ قَوۡمِهِۦ غَضۡبَٰنَ أَسِفٗا قَالَ بِئۡسَمَا خَلَفۡتُمُونِي مِنۢ بَعۡدِيٓۖ أَعَجِلۡتُمۡ أَمۡرَ رَبِّكُمۡۖ وَأَلۡقَى ٱلۡأَلۡوَاحَ وَأَخَذَ بِرَأۡسِ أَخِيهِ يَجُرُّهُۥٓ إِلَيۡهِۚ قَالَ ٱبۡنَ أُمَّ إِنَّ ٱلۡقَوۡمَ ٱسۡتَضۡعَفُونِي وَكَادُواْ يَقۡتُلُونَنِي فَلَا تُشۡمِتۡ بِيَ ٱلۡأَعۡدَآءَ وَلَا تَجۡعَلۡنِي مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ ٠٥١\n                                    \n                                    \n                                    يخبر تعالى أن موسى ، عليه السلام ، رجع إلى قومه من مناجاة ربه تعالى وهو غضبان أسف .\nقال أبو الدرداء \" الأسف \" : أشد الغضب .\n( 151 ) ( قال بئسما خلفتموني من بعدي ) يقول : بئس ما صنعتم في عبادتكم العجل بعد أن ذهبت وتركتكم .\nوقوله : ( أعجلتم أمر ربكم ) ؟ يقول : استعجلتم مجيئي إليكم ، وهو مقدر من الله تعالى .\nوقوله : ( وألقى الألواح وأخذ برأس أخيه يجره إليه ) قيل : كانت الألواح من زمرد . وقيل : من ياقوت . وقيل : من برد وفي هذا دلالة على ما جاء في الحديث : \" ليس الخبر كالمعاينة \"\nثم ظاهر السياق أنه إنما ألقى الألواح غضبا على قومه ، وهذا قول جمهور العلماء سلفا وخلفا . وروى ابن جرير عن قتادة في هذا قولا غريبا ، لا يصح إسناده إلى حكاية قتادة ، وقد رده ابن عطية وغير واحد من العلماء ، وهو جدير بالرد ، وكأنه تلقاه قتادة عن بعض أهل الكتاب ، وفيهم كذابون ووضاعون وأفاكون وزنادقة .\nوقوله : ( وأخذ برأس أخيه يجره إليه ) خوفا أن يكون قد قصر في نهيهم ، كما قال في الآية الأخرى : ( قال يا هارون ما منعك إذ رأيتهم ضلوا ألا تتبعن أفعصيت أمري . قال يا ابن أم لا تأخذ بلحيتي ولا برأسي إني خشيت أن تقول فرقت بين بني إسرائيل ولم ترقب قولي ) [ طه : 92 - 94 ] وقال هاهنا : ( ابن أم إن القوم استضعفوني وكادوا يقتلونني فلا تشمت بي الأعداء ولا تجعلني مع القوم الظالمين ) أي : لا تسقني مساقهم ، ولا تخلطني معهم . وإنما قال : ( ابن أم ) ; لتكون أرأف وأنجع عنده ، وإلا فهو شقيقه لأبيه وأمه . فلما تحقق موسى ، عليه السلام ، براءة ساحة هارون عليه السلام كما قال تعالى : ( ولقد قال لهم هارون من قبل يا قوم إنما فتنتم به وإن ربكم الرحمن فاتبعوني وأطيعوا أمري ) [ طه : 90 ]\n                                    ",
        "qortoby": "وَلَمَّا رَجَعَ مُوسَىٰٓ إِلَىٰ قَوۡمِهِۦ غَضۡبَٰنَ أَسِفٗا قَالَ بِئۡسَمَا خَلَفۡتُمُونِي مِنۢ بَعۡدِيٓۖ أَعَجِلۡتُمۡ أَمۡرَ رَبِّكُمۡۖ وَأَلۡقَى ٱلۡأَلۡوَاحَ وَأَخَذَ بِرَأۡسِ أَخِيهِ يَجُرُّهُۥٓ إِلَيۡهِۚ قَالَ ٱبۡنَ أُمَّ إِنَّ ٱلۡقَوۡمَ ٱسۡتَضۡعَفُونِي وَكَادُواْ يَقۡتُلُونَنِي فَلَا تُشۡمِتۡ بِيَ ٱلۡأَعۡدَآءَ وَلَا تَجۡعَلۡنِي مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ ٠٥١\n                                    \n                                    \n                                    قوله تعالى ولما رجع موسى إلى قومه غضبان أسفا لم ينصرف غضبان لأن مؤنثه غضبى ، ولأن الألف والنون فيه بمنزلة ألفي التأنيث في قولك حمراء . وهو نصب على الحال . و أسفا شديد الغضب . قال أبو الدرداء : الأسف منزلة وراء الغضب أشد من ذلك . وهو أسف وأسيف وأسفان وأسوف . والأسيف أيضا الحزين . ابن عباس والسدي : رجع حزينا من صنيع قومه . وقال الطبري : أخبره الله عز وجل قبل رجوعه أنهم قد فتنوا بالعجل ; فلذلك رجع وهو غضبان . ابن العربي : وكان موسى عليه السلام من أعظم الناس غضبا ، لكنه كان سريع الفيئة ; فتلك بتلك . قال ابن القاسم : سمعت مالكا يقول : كان موسى عليه السلام إذا غضب طلع الدخان من قلنسوته ، ورفع شعر بدنه جبته . وذلك أن الغضب جمرة تتوقد في القلب . ولأجله أمر النبي صلى الله عليه وسلم من غضب أن يضطجع . فإن لم يذهب غضبه اغتسل ; فيخمدها اضطجاعه ويطفئها اغتساله . وسرعة غضبه كان سببا لصكه ملك الموت ففقأ عينه . وقال الترمذي وقد تقدم في \" المائدة \" ما للعلماء في هذا . وقال الترمذي الحكيم : وإنما استجاز موسى عليه السلام ذلك لأنه كليم الله ; كأنه رأى أن من اجترأ عليه أو مد إليه يدا بأذى فقد عظم الخطب فيه . ألا ترى أنه احتج عليه فقال : من أين تنزع روحي ؟ أمن فمي وقد ناجيت به ربي ! أم من سمعي وقد سمعت به كلام ربي ! أم من يدي وقد قبضت منه الألواح ! أم من قدمي وقد قمت بين يديه أكلمه بالطور ! أم من عيني وقد أشرق وجهي لنوره . فرجع إلى ربه مفحما . وفي مصنف أبي داود عن أبي ذر قال : إن رسول الله صلى الله عليه وسلم قال لنا : إذا غضب أحدكم وهو قائم فليجلس فإن ذهب عنه الغضب وإلا فليضطجع . وروي أيضا عن أبي وائل القاص قال : دخلنا على عروة بن محمد السعدي فكلمه رجل فأغضبه ; فقام ثم رجع وقد توضأ ، فقال : حدثني أبي عن جدي عطية قال قال رسول الله صلى الله عليه وسلم : إن الغضب من الشيطان وإن الشيطان خلق من النار وإنما تطفأ النار بالماء فإذا غضب أحدكم فليتوضأ .\nقوله تعالى قال بئسما خلفتموني من بعدي ذم منه لهم ; أي بئس العمل عملتم بعدي . يقال : خلفه ; بما يكره . ويقال في الخير أيضا . يقال منه : خلفه بخير أو بشر في أهله وقومه بعد شخوصه .\nأعجلتم أمر ربكم أي سبقتموه . والعجلة : التقدم بالشيء قبل وقته ، وهي مذمومة . والسرعة : عمل الشيء في أول أوقاته ، وهي محمودة . قال يعقوب : يقال عجلت الشيء سبقته . وأعجلت الرجل استعجلته ، أي حملته على العجلة . ومعنى أمر ربكم أي ميعاد ربكم ، أي وعد أربعين ليلة . وقيل : أي تعجلتم سخط ربكم . وقيل : أعجلتم بعبادة العجل قبل أن يأتيكم أمر من ربكم .\nقوله تعالى وألقى الألواح فيه مسألتان الأولى : قوله تعالى : وألقى الألواح أي مما اعتراه من الغضب والأسف حين أشرف على قومه وهم عاكفون على عبادة العجل ، وعلى أخيه في إهمال أمرهم ; قاله سعيد بن جبير . ولهذا قيل : ليس الخبر كالمعاينة . ولا التفات لما روي عن قتادة إن صح عنه ، ولا يصح أن إلقاءه الألواح إنما كان لما رأى فيها من فضيلة أمة محمد صلى الله عليه وسلم ولم يكن ذلك لأمته . وهذا قول رديء لا ينبغي أن يضاف إلى موسى صلى الله عليه وسلم . وقد تقدم عن ابن عباس رضي الله عنه أن الألواح تكسرت ، وأنه رفع منها التفصيل وبقي فيها الهدى والرحمة . الثانية : وقد استدل بعض جهال المتصوفة بهذا على جواز رمي الثياب إذا اشتد طربهم على المغنى . ثم منهم من يرمي بها صحاحا ، ومنهم من يخرقها ثم يرمي بها . قال : هؤلاء في غيبة فلا يلامون ; فإن موسى عليه السلام لما غلب عليه الغم بعبادة قومه العجل ، رمى الألواح فكسرها ، ولم يدر ما صنع . قال أبو الفرج الجوزي : من يصحح عن موسى عليه السلام أنه رماها رمي كاسر ؟ والذي ذكر في القرآن ألقاها ، فمن أين لنا أنها تكسرت ؟ ثم لو قيل : تكسرت فمن أين لنا أنه قصد كسرها ؟ ثم لو صححنا ذلك عنه قلنا كان في غيبة ، حتى لو كان بين يديه بحر من نار لخاضه . ومن يصحح لهؤلاء غيبتهم وهم يعرفون المغني من غيره ، ويحذرون من بئر لو كانت عندهم . ثم كيف تقاس أحوال الأنبياء على أحوال هؤلاء السفهاء . وقد سئل ابن عقيل عن تواجدهم وتخريق ثيابهم فقال : خطأ وحرام ; وقد نهى رسول الله صلى الله عليه وسلم عن إضاعة المال . فقال له قائل : فإنهم لا يعقلون ما يفعلون . فقال : إن حضروا هذه الأمكنة مع علمهم أن الطرب يغلب عليهم فيزيل عقولهم أثموا بما أدخلوه على أنفسهم من التخريق وغيره مما أفسدوا ، ولا يسقط عنهم خطاب الشرع ; لأنهم مخاطبون قبل الحضور بتجنب هذا الموضع الذي يفضي إلى ذلك . كما هم منهيون عن شرب المسكر ، كذلك هذا الطرب الذي يسميه أهل التصوف وجدا إن صدقوا أن فيه سكر طبع ، وإن كذبوا أفسدوا مع الصحو ، فلا سلامة فيه مع الحالين ، وتجنب مواضع الريب واجب .\nقوله تعالى وأخذ برأس أخيه يجره إليه أي بلحيته وذؤابته . وكان هارون أكبر من موسى - صلوات الله وسلامه عليهما - بثلاث سنين ، وأحب إلى بني إسرائيل من موسى ; لأنه كان لين الغضب . وللعلماء في أخذ موسى برأس أخيه أربع تأويلات :\nالأول : أن ذلك كان متعارفا عندهم ; كما كانت العرب تفعله من قبض الرجل على لحية أخيه وصاحبه إكراما وتعظيما ، فلم يكن ذلك على طريق الإذلال .\nالثاني : أن ذلك إنما كان ليسر إليه نزول الألواح عليه ; لأنها نزلت عليه في هذه المناجاة وأراد أن يخفيها عن بني إسرائيل قبل التوراة . فقال له هارون : لا تأخذ بلحيتي ولا برأسي ; لئلا يشتبه سراره على بني إسرائيل بإذلاله .\nالثالث : إنما فعل ذلك به ; لأنه وقع في نفسه أن هارون مائل مع بني إسرائيل فيما فعلوه من أمر العجل . ومثل هذا لا يجوز على الأنبياء .\nالرابع : ضم إليه أخاه ليعلم ما لديه ; فكره ذلك هارون لئلا يظن بنو إسرائيل أنه أهانه ; فبين له أخوه أنهم استضعفوه ، يعني عبدة العجل ، وكادوا يقتلونه أي قاربوا . فلما سمع عذره قال : رب اغفر لي ولأخي ; أي اغفر لي ما كان من الغضب الذي ألقيت من أجله الألواح ، ولأخي لأنه ظنه مقصرا في الإنكار عليهم وإن لم يقع منه تقصير ; أي اغفر لأخي إن قصر . قال الحسن : عبد كلهم العجل غير هارون ، إذ لو كان ثم مؤمن غير موسى وهارون لما اقتصر على قوله : رب اغفر لي ولأخي ، ولدعا لذلك المؤمن أيضا . وقيل : استغفر لنفسه من فعله بأخيه ، فعل ذلك لموجدته عليه ; إذ لم يلحق به فيعرفه ما جرى ليرجع فيتلافاهم ; ولهذا قال : ياهارون ما منعك إذ رأيتهم ضلوا الآية . فبين هارون أنه إنما أقام خوفا على نفسه من القتل . فدلت الآية على أن لمن خشي القتل على نفسه عند تغيير المنكر أن يسكت . ابن العربي : وقد تقدم بيان هذا في \" آل عمران \" ابن العربي وفيها دليل على أن الغضب لا يغير الأحكام كما زعم بعض الناس ; فإن موسى عليه السلام لم يغير غضبه شيئا من أفعاله ، بل اطردت على مجراها من إلقاء لوح وعتاب أخ وصك ملك . المهدوي : لأن غضبه كان لله عز وجل ، وسكوته عن بني إسرائيل خوفا أن يتحاربوا أو يتفرقوا .\nقوله تعالى قال ابن أم وكان ابن أمه وأبيه . ولكنها كلمة لين وعطف . قال الزجاج : قيل كان هارون أخا موسى لأمه لا لأبيه . وقرئ بفتح الميم وكسرها ; فمن فتح جعل ابن أم اسما واحدا كخمسة عشر ; فصار كقولك : يا خمسة عشر أقبلوا . ومن كسر الميم جعله مضافا إلى ضمير المتكلم ثم حذف ياء الإضافة ; لأن مبنى النداء على الحذف ، وأبقى الكسرة في الميم لتدل على الإضافة ; كقوله : يا عباد . يدل عليه قراءة ابن السميقع \" يا ابن أمي \" بإثبات الياء على الأصل . وقال الكسائي والفراء وأبو عبيد : \" يا ابن أم \" بالفتح ، تقديره يا ابن أماه . وقال البصريون : هذا القول خطأ ; لأن الألف خفيفة لا تحذف ، ولكن جعل الاسمين اسما واحدا . وقال الأخفش وأبو حاتم : \" يا ابن أم \" بالكسر كما تقول : يا غلام غلام أقبل ، وهي لغة شاذة والقراءة بها بعيدة . وإنما هذا فيما يكون مضافا إليك ; فأما المضاف إلى مضاف إليك فالوجه أن تقول : يا غلام غلامي ، ويا ابن أخي . وجوزوا يا ابن أم ، يا بن عم ، لكثرتها في الكلام . قال الزجاج والنحاس : ولكن لها وجه حسن جيد ، يجعل الابن مع الأم ومع العم اسما واحدا ; بمنزلة قولك : يا خمسة عشر أقبلوا ، فحذفت الياء كما حذفت من يا غلام\nإن القوم استضعفوني استذلوني وعدوني ضعيفا وكادوا أي قاربوا يقتلونني بنونين ; لأنه فعل مستقبل . ويجوز الإدغام في غير القرآن .\nفلا تشمت بي الأعداء أي لا تسرهم . والشماتة : السرور بما يصيب أخاك من المصائب في الدين والدنيا . وهي محرمة منهي عنها . وفي الحديث عن النبي صلى الله عليه وسلم : لا تظهر الشماتة بأخيك فيعافيه الله ويبتليك . وكان رسول الله صلى الله عليه وسلم يتعوذ منها ويقول : اللهم إني أعوذ بك من سوء القضاء ودرك الشقاء وشماتة الأعداء . أخرجه البخاري وغيره . وقال الشاعر :\nإذا ما الدهر جر على أناس كلاكله أناخ بآخرينا فقل للشامتين بنا أفيقو\nسيلقى الشامتون كما لقينا\nوقرأ مجاهد ومالك بن دينار ( تشمت ) بالنصب في التاء وفتح الميم ، ( الأعداء ) بالرفع . والمعنى : لا تفعل بي ما تشمت من أجله الأعداء ، أي لا يكون ذلك منهم لفعل تفعله أنت بي . وعن مجاهد أيضا ( تشمت ) بالفتح فيهما ( الأعداء ) بالنصب . قال ابن جني : المعنى فلا تشمت بي أنت يا رب . وجاز هذا كما قال : الله يستهزئ بهم ونحوه . ثم عاد إلى المراد فأضمر فعلا نصب به الأعداء ; كأنه قال : ولا تشمت بي الأعداء . قال أبو عبيد : وحكيت عن حميد : \" فلا تشمت \" بكسر الميم . قال النحاس : ولا وجه لهذه القراءة ; لأنه إن كان من شمت وجب أن يقول تشمت . وإن كان من أشمت وجب أن يقول تشمت . وقوله ولا تجعلني مع القوم الظالمين قال مجاهد : يعني الذين عبدوا العجل .\n                                    ",
        "saadi": "وَلَمَّا رَجَعَ مُوسَىٰٓ إِلَىٰ قَوۡمِهِۦ غَضۡبَٰنَ أَسِفٗا قَالَ بِئۡسَمَا خَلَفۡتُمُونِي مِنۢ بَعۡدِيٓۖ أَعَجِلۡتُمۡ أَمۡرَ رَبِّكُمۡۖ وَأَلۡقَى ٱلۡأَلۡوَاحَ وَأَخَذَ بِرَأۡسِ أَخِيهِ يَجُرُّهُۥٓ إِلَيۡهِۚ قَالَ ٱبۡنَ أُمَّ إِنَّ ٱلۡقَوۡمَ ٱسۡتَضۡعَفُونِي وَكَادُواْ يَقۡتُلُونَنِي فَلَا تُشۡمِتۡ بِيَ ٱلۡأَعۡدَآءَ وَلَا تَجۡعَلۡنِي مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ ٠٥١\n                                        \n                                        \n                                        \n                                        وَلَمَّا رَجَعَ مُوسَى إِلَى قَوْمِهِ غَضْبَانَ أَسِفًا أي: ممتلئا غضبا وغيظا عليهم، لتمام غيرته عليه الصلاة السلام، وكمال نصحه وشفقته، قَالَ بِئْسَمَا خَلَفْتُمُونِي مِنْ بَعْدِي أي: بئس الحالة التي خلفتموني بها من بعد ذهابي عنكم، فإنها حالة تفضي إلى الهلاك الأبدي، والشقاء السرمدي. أَعَجِلْتُمْ أَمْرَ رَبِّكُمْ حيث وعدكم بإنـزال الكتاب. فبادرتم - برأيكم الفاسد - إلى هذه الخصلة القبيحة وَأَلْقَى الألْوَاحَ أي: رماها من الغضب وَأَخَذَ بِرَأْسِ أَخِيهِ هارون ولحيته يَجُرُّهُ إِلَيْهِ وقال له: مَا مَنَعَكَ إِذْ رَأَيْتَهُمْ ضَلُّوا * أن لا تَتَّبِعَن أَفَعَصَيْتَ أَمْرِي لك بقولي: اخْلُفْنِي فِي قَوْمِي وَأَصْلِحْ وَلا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ فـ قَالَ يَا ابْنَ أُمَّ لا تَأْخُذْ بِلِحْيَتِي وَلا بِرَأْسِي إِنِّي خَشِيتُ أَنْ تَقُولَ فَرَّقْتَ بَيْنَ بَنِي إِسْرَائِيلَ وَلَمْ تَرْقُبْ قَوْلِي و قَالَ هنا ابْنَ أُمَّ هذا ترقيق لأخيه، بذكر الأم وحدها، وإلا فهو شقيقه لأمه وأبيه: إِنَّ الْقَوْمَ اسْتَضْعَفُونِي أي: احتقروني حين قلت لهم: يَا قَوْمِ إِنَّمَا فُتِنْتُمْ بِهِ وَإِنَّ رَبَّكُمُ الرَّحْمَنُ فَاتَّبِعُونِي وَأَطِيعُوا أَمْرِي وَكَادُوا يَقْتُلُونَنِي أي: فلا تظن بي تقصيرا فَلا تُشْمِتْ بِيَ الأعْدَاءَ بنهرك لي، ومسك إياي بسوء، فإن الأعداء حريصون على أن يجدوا عليَّ عثرة، أو يطلعوا لي على زلة وَلا تَجْعَلْنِي مَعَ الْقَوْمِ الظَّالِمِينَ فتعاملني معاملتهم.\n                                    "
      },
      "originalText": "وَلَمَّا رَجَعَ مُوسَىٰٓ إِلَىٰ قَوۡمِهِۦ غَضۡبَٰنَ أَسِفٗا قَالَ بِئۡسَمَا خَلَفۡتُمُونِي مِنۢ بَعۡدِيٓۖ أَعَجِلۡتُمۡ أَمۡرَ رَبِّكُمۡۖ وَأَلۡقَى ٱلۡأَلۡوَاحَ وَأَخَذَ بِرَأۡسِ أَخِيهِ يَجُرُّهُۥٓ إِلَيۡهِۚ قَالَ ٱبۡنَ أُمَّ إِنَّ ٱلۡقَوۡمَ ٱسۡتَضۡعَفُونِي وَكَادُواْ يَقۡتُلُونَنِي فَلَا تُشۡمِتۡ بِيَ ٱلۡأَعۡدَآءَ وَلَا تَجۡعَلۡنِي مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ ٠٥١"
    },
    {
      "number": 1105,
      "text": "قَالَ رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ ۖ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 151,
      "juz": 9,
      "manzil": 2,
      "page": 169,
      "ruku": 139,
      "hizbQuarter": 67,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَلِأَخِي وَأَدۡخِلۡنَا فِي رَحۡمَتِكَۖ وَأَنتَ أَرۡحَمُ ٱلرَّٰحِمِينَ ١٥١\n                                    \n                                    \n                                    فعند ذلك قال موسى : ( رب اغفر لي ولأخي وأدخلنا في رحمتك وأنت أرحم الراحمين )\nقال ابن أبي حاتم : حدثنا الحسن بن محمد بن الصباح ، حدثنا عفان ، حدثنا أبو عوانة ، عن أبي بشر ، عن سعيد بن جبير ، عن ابن عباس قال : قال النبي صلى الله عليه وسلم \" يرحم الله موسى ، ليس المعاين كالمخبر ; أخبره ربه ، عز وجل ، أن قومه فتنوا بعده ، فلم يلق الألواح ، فلما رآهم وعاينهم ألقى الألواح \"\n                                    ",
        "qortoby": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَلِأَخِي وَأَدۡخِلۡنَا فِي رَحۡمَتِكَۖ وَأَنتَ أَرۡحَمُ ٱلرَّٰحِمِينَ ١٥١\n                                    \n                                    \n                                    قَالَ رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ ۖ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ \n                                    ",
        "saadi": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَلِأَخِي وَأَدۡخِلۡنَا فِي رَحۡمَتِكَۖ وَأَنتَ أَرۡحَمُ ٱلرَّٰحِمِينَ ١٥١\n                                        \n                                        \n                                        \n                                        فندم موسى عليه السلام على ما استعجل من صنعه بأخيه قبل أن يعلم براءته، مما ظنه فيه من التقصير. و قَالَ رَبِّ اغْفِرْ لِي وَلأخِي هارون وَأَدْخِلْنَا فِي رَحْمَتِكَ أي: في وسطها، واجعل رحمتك تحيط بنا من كل جانب، فإنها حصن حصين، من جميع الشرور، وثم كل الخير وسرور. وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ أي: أرحم بنا من كل راحم، أرحم بنا من آبائنا، وأمهاتنا وأولادنا وأنفسنا.\n                                    "
      },
      "originalText": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَلِأَخِي وَأَدۡخِلۡنَا فِي رَحۡمَتِكَۖ وَأَنتَ أَرۡحَمُ ٱلرَّٰحِمِينَ ١٥١"
    },
    {
      "number": 1106,
      "text": "إِنَّ الَّذِينَ اتَّخَذُوا الْعِجْلَ سَيَنَالُهُمْ غَضَبٌ مِنْ رَبِّهِمْ وَذِلَّةٌ فِي الْحَيَاةِ الدُّنْيَا ۚ وَكَذَٰلِكَ نَجْزِي الْمُفْتَرِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 152,
      "juz": 9,
      "manzil": 2,
      "page": 169,
      "ruku": 140,
      "hizbQuarter": 67,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ ٱتَّخَذُواْ ٱلۡعِجۡلَ سَيَنَالُهُمۡ غَضَبٞ مِّن رَّبِّهِمۡ وَذِلَّةٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُفۡتَرِينَ ٢٥١\n                                    \n                                    \n                                    ما الغضب الذي نال بني إسرائيل في عبادة العجل ، فهو أن الله تعالى لم يقبل لهم توبة ، حتى قتل بعضهم بعضا ، كما تقدم في سورة البقرة : ( فتوبوا إلى بارئكم فاقتلوا أنفسكم ذلكم خير لكم عند بارئكم فتاب عليكم إنه هو التواب الرحيم ) [ البقرة : 54 ]\nوأما الذلة فأعقبهم ذلك ذلا وصغارا في الحياة الدنيا ، وقوله : ( وكذلك نجزي المفترين ) نائلة لكل من افترى بدعة ، فإن ذل البدعة ومخالفة الرسالة متصلة من قلبه على كتفيه ، كما قال الحسن البصري : إن ذل البدعة على أكتافهم ، وإن هملجت بهم البغلات ، وطقطقت بهم البراذين .\nوهكذا روى أيوب السختياني ، عن أبي قلابة الجرمي ، أنه قرأ هذه الآية : ( وكذلك نجزي المفترين ) قال : هي والله لكل مفتر إلى يوم القيامة .\nوقال سفيان بن عيينة : كل صاحب بدعة ذليل .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ ٱتَّخَذُواْ ٱلۡعِجۡلَ سَيَنَالُهُمۡ غَضَبٞ مِّن رَّبِّهِمۡ وَذِلَّةٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُفۡتَرِينَ ٢٥١\n                                    \n                                    \n                                    قوله تعالى إن الذين اتخذوا العجل سينالهم غضب من ربهم وذلة في الحياة الدنيا وكذلك نجزي المفترين\nقوله تعالى إن الذين تخذوا العجل سينالهم غضب من ربهم الغضب من الله العقوبة وذلة في الحياة الدنيا لأنهم أمروا بقتل بعضهم بعضا . وقيل : الذلة الجزية . وفيه بعد ; لأن الجزية لم تؤخذ منهم وإنما أخذت من ذرياتهم . ثم قيل : هذا من تمام كلام موسى عليه السلام ; أخبر الله عز وجل به عنه ، وتم الكلام .\nوكذلك نجزي المفترين وكان هذا القول من موسى عليه السلام قبل أن يتوب القوم بقتلهم أنفسهم ، فإنهم لما تابوا وعفا الله عنهم بعد أن جرى القتل العظيم كما تقدم بيانه في \" البقرة \" أخبرهم أن من مات منهم قتيلا فهو شهيد ، ومن بقي حيا فهو مغفور له . وقيل : كان ثم طائفة أشربوا في قلوبهم العجل ، أي حبه ، فلم يتوبوا ; فهم المعنيون . وقيل : أراد من مات منهم قبل رجوع موسى من الميقات . وقيل : أراد أولادهم . وهو ما جرى على قريظة والنضير ; أي سينال أولادهم . والله أعلم . وكذلك نجزي المفترين أي مثل ما فعلنا بهؤلاء نفعل بالمفترين . وقال مالك بن أنس رحمة الله عليه : ما من مبتدع إلا وتجد فوق رأسه ذلة ، ثم قرأ إن الذين اتخذوا العجل سينالهم غضب من ربهم حتى قال وكذلك نجزي المفترين أي المبتدعين . وقيل : إن موسى أمر بذبح العجل ، فجرى منه دم وبرده بالمبرد وألقاه مع الدم في اليم وأمرهم بالشرب من ذلك الماء ; فمن عبد ذلك العجل وأشربه ظهر ذلك على أطراف فمه ; فبذلك عرف عبدة العجل . وقد مضى هذا في \" البقرة \" ثم أخبر الله تعالى أن الله يقبل توبة التائب من الشرك وغيره .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ ٱتَّخَذُواْ ٱلۡعِجۡلَ سَيَنَالُهُمۡ غَضَبٞ مِّن رَّبِّهِمۡ وَذِلَّةٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُفۡتَرِينَ ٢٥١\n                                        \n                                        \n                                        \n                                        قال اللّه تعالى مبينا حال أهل العجل الذين عبدوه: إِنَّ الَّذِينَ اتَّخَذُوا الْعِجْلَ أي: إلها سَيَنَالُهُمْ غَضَبٌ مِنْ رَبِّهِمْ وَذِلَّةٌ فِي الْحَيَاةِ الدُّنْيَا كما أغضبوا ربهم واستهانوا بأمره. وَكَذَلِكَ نَجْزِي الْمُفْتَرِينَ فكل مفتر على اللّه، كاذب على شرعه، متقول عليه ما لم يقل، فإن له نصيبا من الغضب من اللّه، والذل في الحياة الدنيا، وقد نالهم غضب اللّه، حيث أمرهم أن يقتلوا أنفسهم، وأنه لا يرضى اللّه عنهم إلا بذلك، فقتل بعضهم بعضا، وانجلت المعركة عن كثير من القتلى ثم تاب اللّه عليهم بعد ذلك.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ ٱتَّخَذُواْ ٱلۡعِجۡلَ سَيَنَالُهُمۡ غَضَبٞ مِّن رَّبِّهِمۡ وَذِلَّةٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُفۡتَرِينَ ٢٥١"
    },
    {
      "number": 1107,
      "text": "وَالَّذِينَ عَمِلُوا السَّيِّئَاتِ ثُمَّ تَابُوا مِنْ بَعْدِهَا وَآمَنُوا إِنَّ رَبَّكَ مِنْ بَعْدِهَا لَغَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 153,
      "juz": 9,
      "manzil": 2,
      "page": 169,
      "ruku": 140,
      "hizbQuarter": 67,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ عَمِلُواْ ٱلسَّيِّ‍َٔاتِ ثُمَّ تَابُواْ مِنۢ بَعۡدِهَا وَءَامَنُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ ٣٥١\n                                    \n                                    \n                                    ثم نبه تعالى عباده وأرشدهم إلى أنه يقبل توبة عباده من أي ذنب كان ، حتى ولو كان من كفر أو شرك أو نفاق أو شقاق ; ولهذا عقب هذه القصة بقوله : ( والذين عملوا السيئات ثم تابوا من بعدها وآمنوا إن ربك ) أي : يا محمد ، يا رسول الرحمة ونبي النور ( من بعدها ) أي : من بعد تلك الفعلة ) لغفور رحيم )\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا مسلم بن إبراهيم ، حدثنا أبان ، حدثنا قتادة ، عن عزرة عن الحسن العرفي ، عن علقمة ، عن عبد الله بن مسعود ; أنه سئل عن ذلك - يعني عن الرجل يزني بالمرأة ، ثم يتزوجها - فتلا هذه الآية : ( والذين عملوا السيئات ثم تابوا من بعدها وآمنوا إن ربك من بعدها لغفور رحيم ) فتلاها عبد الله عشر مرات ، فلم يأمرهم بها ولم ينههم عنها .\n                                    ",
        "qortoby": "وَٱلَّذِينَ عَمِلُواْ ٱلسَّيِّ‍َٔاتِ ثُمَّ تَابُواْ مِنۢ بَعۡدِهَا وَءَامَنُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ ٣٥١\n                                    \n                                    \n                                    والذين عملوا السيئات أي الكفر والمعاصي ثم تابوا من بعدها أي من بعد فعلها وآمنوا إن ربك من بعدها لغفور رحيم أي من بعد التوبة لغفور رحيم\n                                    ",
        "saadi": "وَٱلَّذِينَ عَمِلُواْ ٱلسَّيِّ‍َٔاتِ ثُمَّ تَابُواْ مِنۢ بَعۡدِهَا وَءَامَنُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ ٣٥١\n                                        \n                                        \n                                        \n                                        وَالَّذِينَ عَمِلُوا السَّيِّئَاتِ من شرك وكبائر، وصغائر ثُمَّ تَابُوا مِنْ بَعْدِهَا بأن ندموا على ما مضى، وأقلعوا عنها، وعزموا على أن لا يعودوا وَآمنُوا باللّه وبما أوجب اللّه من الإيمان به، ولا يتم الإيمان إلا بأعمال القلوب، وأعمال الجوارح المترتبة على الإيمان إِنَّ رَبَّكَ مِنْ بَعْدِهَا أي: بعد هذه الحالة، حالة التوبة من السيئات والرجوع إلى الطاعات، لَغَفُورٌ يغفر السيئات ويمحوها، ولو كانت قراب الأرض رَحِيمٌ بقبول التوبة، والتوفيق لأفعال الخير وقبولها.\n                                    "
      },
      "originalText": "وَٱلَّذِينَ عَمِلُواْ ٱلسَّيِّ‍َٔاتِ ثُمَّ تَابُواْ مِنۢ بَعۡدِهَا وَءَامَنُوٓاْ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورٞ رَّحِيمٞ ٣٥١"
    },
    {
      "number": 1108,
      "text": "وَلَمَّا سَكَتَ عَنْ مُوسَى الْغَضَبُ أَخَذَ الْأَلْوَاحَ ۖ وَفِي نُسْخَتِهَا هُدًى وَرَحْمَةٌ لِلَّذِينَ هُمْ لِرَبِّهِمْ يَرْهَبُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 154,
      "juz": 9,
      "manzil": 2,
      "page": 169,
      "ruku": 140,
      "hizbQuarter": 67,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَمَّا سَكَتَ عَن مُّوسَى ٱلۡغَضَبُ أَخَذَ ٱلۡأَلۡوَاحَۖ وَفِي نُسۡخَتِهَا هُدٗى وَرَحۡمَةٞ لِّلَّذِينَ هُمۡ لِرَبِّهِمۡ يَرۡهَبُونَ ٤٥١\n                                    \n                                    \n                                    يقول تعالى : ( ولما سكت ) أي : سكن ( عن موسى الغضب ) أي : غضبه على قومه ( أخذ الألواح ) أي : التي كان ألقاها من شدة الغضب على عبادتهم العجل ، غيرة لله وغضبا له ( وفي نسختها هدى ورحمة )\nيقول كثير من المفسرين : إنها لما ألقاها تكسرت ، ثم جمعها بعد ذلك ; ولهذا قال بعض السلف : فوجد فيها هدى ورحمة . وأما التفصيل فذهب ، وزعموا أن رضاضها لم يزل موجودا في خزائن الملوك لبني إسرائيل إلى الدولة الإسلامية ، والله أعلم بصحة هذا . وأما الدليل القاطع على أنها تكسرت حين ألقاها ، وهي من جوهر الجنة فقد أخبر الله تعالى أنه لما أخذها بعد ما ألقاها وجد فيها هدى ورحمة .\n( للذين هم لربهم يرهبون ) ضمن الرهبة معنى الخضوع ; ولهذا عداها باللام . وقال قتادة : في قوله تعالى : ( أخذ الألواح ) قال : رب ، إني أجد في الألواح أمة خير أمة أخرجت للناس ، يأمرون بالمعروف وينهون عن المنكر ، فاجعلهم أمتي . قال : تلك أمة أحمد . قال : رب ، إني أجد في الألواح أمة هم الآخرون - أي آخرون في الخلق - السابقون في دخول الجنة ، رب اجعلهم أمتي . قال : تلك أمة أحمد . قال : رب ، إني أجد في الألواح أمة أناجيلهم في صدورهم يقرءونها - كتابهم - وكان من قبلهم يقرءون كتابهم نظرا ، حتى إذا رفعوها لم يحفظوا منها شيئا ، ولم يعرفوه . قال قتادة : وإن الله أعطاهم أيتها الأمة من الحفظ شيئا لم يعطه أحدا من الأمم . قال : رب ، اجعلهم أمتي . قال : تلك أمة أحمد . قال : رب ، إني أجد في الألواح أمة يؤمنون بالكتاب الأول ، وبالكتاب الآخر ، ويقاتلون فصول الضلالة ، حتى يقاتلوا الأعور الكذاب ، فاجعلهم أمتي . قال : تلك أمة أحمد . قال : رب ، إني أجد في الألواح أمة صدقاتهم يأكلونها في بطونهم ، ويؤجرون عليها - وكان من قبلهم من الأمم إذا تصدق بصدقة فقبلت منه ، بعث الله عليها نارا فأكلتها ، وإن ردت عليه تركت ، فتأكلها السباع والطير ، وإن الله أخذ صدقاتكم من غنيكم لفقيركم - قال : رب ، اجعلهم أمتي . قال : تلك أمة أحمد . قال رب ، إني أجد في الألواح أمة إذا هم أحدهم بحسنة ثم لم يعملها ، كتبت له حسنة ، فإن عملها ، كتبت له عشر أمثالها إلى سبعمائة ضعف رب اجعلهم أمتي . قال : تلك أمة أحمد . قال : رب ، إني أجد في الألواح أمة إذا هم أحدهم بسيئة لم تكتب عليه حتى يعملها ، فإذا عملها كتبت عليه سيئة واحدة ، فاجعلهم أمتي : قال : تلك أمة أحمد . قال : رب ، إني أجد في الألواح أمة هم المستجيبون والمستجاب لهم ، فاجعلهم أمتي . قال : تلك أمة أحمد . قال : رب ، إني أجد في الألواح أمة هم المشفعون والمشفوع لهم ، فاجعلهم أمتي . قال : تلك أمة أحمد . قال : قتادة فذكر لنا أن نبي الله موسى عليه السلام نبذ الألواح ، وقال اللهم اجعلني من أمة أحمد\n                                    ",
        "qortoby": "وَلَمَّا سَكَتَ عَن مُّوسَى ٱلۡغَضَبُ أَخَذَ ٱلۡأَلۡوَاحَۖ وَفِي نُسۡخَتِهَا هُدٗى وَرَحۡمَةٞ لِّلَّذِينَ هُمۡ لِرَبِّهِمۡ يَرۡهَبُونَ ٤٥١\n                                    \n                                    \n                                    قوله تعالى ولما سكت عن موسى الغضب أخذ الألواح وفي نسختها هدى ورحمة للذين هم لربهم يرهبون\nقوله تعالى ولما سكت عن موسى الغضب أي سكن . وكذلك قرأها معاوية بن قرة \" سكن \" بالنون . وأصل السكوت السكون والإمساك ; يقال : جرى الوادي ثلاثا ثم سكن ، أي أمسك عن الجري . وقال عكرمة : سكت موسى عن الغضب ; فهو من المقلوب . كقولك : أدخلت الأصبع في الخاتم وأدخلت الخاتم في الأصبع . وأدخلت القلنسوة في رأسي ، وأدخلت رأسي في القلنسوة .\nأخذ الألواح التي ألقاها وفي نسختها هدى ورحمة أي هدى من الضلالة ; ورحمة أي من العذاب . والنسخ : نقل ما في كتاب إلى كتاب آخر . ويقال للأصل الذي كتبت منه : نسخة ، وللفرع نسخة . فقيل : لما تكسرت الألواح صام موسى أربعين يوما ; فردت عليه وأعيدت له تلك الألواح في لوحين ، ولم يفقد منها شيئا ; ذكره ابن عباس . قال القشيري : فعلى هذا وفي نسختها أي وفيما نسخ من الألواح المتكسرة ونقل إلى الألواح الجديدة هدى ورحمة . وقال عطاء : وفيما بقي منها . وذلك أنه لم يبق منها إلا سبعها ، وذهب ستة أسباعها . ولكن لم يذهب من الحدود والأحكام شيء . وقيل : المعنى وفي نسختها أي وفيما نسخ له منها من اللوح المحفوظ هدى . وقيل : المعنى وفيما كتب له فيها هدى ورحمة ، فلا يحتاج إلى أصل ينقل عنه . وهذا كما يقال : انسخ ما يقول فلان ، أي أثبته في كتابك .\nللذين هم لربهم يرهبون أي يخافون . وفي اللام ثلاثة أقوال : قول الكوفيين هي زائدة . قال الكسائي : حدثني من سمع الفرزدق يقول : نقدت لها مائة درهم ، بمعنى نقدتها . وقيل : هي لام أجل ; المعنى : والذين هم من أجل ربهم يرهبون لا رياء ولا سمعة ; عن الأخفش . وقال محمد بن يزيد : هي متعلقة بمصدر ; المعنى : للذين هم رهبتهم لربهم . وقيل : لما تقدم المفعول حسن دخول اللام ; كقوله : إن كنتم للرؤيا تعبرون . فلما تقدم المعمول وهو المفعول ضعف عمل الفعل فصار بمنزلة ما لا يتعدى .\n                                    ",
        "saadi": "وَلَمَّا سَكَتَ عَن مُّوسَى ٱلۡغَضَبُ أَخَذَ ٱلۡأَلۡوَاحَۖ وَفِي نُسۡخَتِهَا هُدٗى وَرَحۡمَةٞ لِّلَّذِينَ هُمۡ لِرَبِّهِمۡ يَرۡهَبُونَ ٤٥١\n                                        \n                                        \n                                        \n                                        وَلَمَّا سَكَتَ عَنْ مُوسَى الْغَضَبُ أي: سكن غضبه، وتراجعت نفسه، وعرف ما هو فيه، اشتغل بأهم الأشياء عنده، فـ أَخَذَ الألْوَاحَ التي ألقاها، وهي ألواح عظيمة المقدار، جليلة وَفِي نُسْخَتِهَا أي: مشتملة ومتضمنة هُدًى وَرَحْمَةٌ أي: فيها الهدى من الضلالة، وبيان الحق من الباطل، وأعمال الخير وأعمال الشر، والهدى لأحسن الأعمال، والأخلاق، والآداب، ورحمة وسعادة لمن عمل بها، وعلم أحكامها ومعانيها، ولكن ليس كل أحد يقبل هدى اللّه ورحمته، وإنما يقبل ذلك وينقاد له، ويتلقاه بالقبول الذين [هم] لِرَبِّهِمْ يَرْهَبُونَ أي: يخافون منه ويخشونه، وأما من لم يخف اللّه ولا المقام بين يديه، فإنه لا يزداد بها إلا عتوا ونفورا وتقوم عليه حجة اللّه فيها.\n                                    "
      },
      "originalText": "وَلَمَّا سَكَتَ عَن مُّوسَى ٱلۡغَضَبُ أَخَذَ ٱلۡأَلۡوَاحَۖ وَفِي نُسۡخَتِهَا هُدٗى وَرَحۡمَةٞ لِّلَّذِينَ هُمۡ لِرَبِّهِمۡ يَرۡهَبُونَ ٤٥١"
    },
    {
      "number": 1109,
      "text": "وَاخْتَارَ مُوسَىٰ قَوْمَهُ سَبْعِينَ رَجُلًا لِمِيقَاتِنَا ۖ فَلَمَّا أَخَذَتْهُمُ الرَّجْفَةُ قَالَ رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُمْ مِنْ قَبْلُ وَإِيَّايَ ۖ أَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَاءُ مِنَّا ۖ إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَاءُ وَتَهْدِي مَنْ تَشَاءُ ۖ أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا ۖ وَأَنْتَ خَيْرُ الْغَافِرِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 155,
      "juz": 9,
      "manzil": 2,
      "page": 169,
      "ruku": 140,
      "hizbQuarter": 67,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱخۡتَارَ مُوسَىٰ قَوۡمَهُۥ سَبۡعِينَ رَجُلٗا لِّمِيقَٰتِنَاۖ فَلَمَّآ أَخَذَتۡهُمُ ٱلرَّجۡفَةُ قَالَ رَبِّ لَوۡ شِئۡتَ أَهۡلَكۡتَهُم مِّن قَبۡلُ وَإِيَّٰيَۖ أَتُهۡلِكُنَا بِمَا فَعَلَ ٱلسُّفَهَآءُ مِنَّآۖ إِنۡ هِيَ إِلَّا فِتۡنَتُكَ تُضِلُّ بِهَا مَن تَشَآءُ وَتَهۡدِي مَن تَشَآءُۖ أَنتَ وَلِيُّنَا فَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۖ وَأَنتَ خَيۡرُ ٱلۡغَٰفِرِينَ ٥٥١\n                                    \n                                    \n                                    قال علي بن أبي طلحة ، عن ابن عباس في تفسير هذه الآية : كان الله أمره أن يختار من قومه سبعين رجلا فاختار سبعين رجلا فبرز بهم ليدعوا ربهم ، فكان فيما دعوا الله قالوا : اللهم أعطنا ما لم تعطه أحدا قبلنا ولا تعطه أحدا بعدنا فكره الله ذلك من دعائهم ، ( رب لو شئت أهلكتهم من قبل وإياي ) الآية .\nوقال السدي : إن الله أمر موسى أن يأتيه في ناس من بني إسرائيل ، يعتذرون إليه من عبادة العجل ، ووعدهم موعدا ، فاختار موسى قومه سبعين رجلا على عينه ، ثم ذهب بهم ليعتذروا . فلما أتوا ذلك المكان قالوا : لن نؤمن لك يا موسى حتى نرى الله جهرة ، فإنك قد كلمته ، فأرناه . فأخذتهم الصاعقة فماتوا ، فقام موسى يبكي ويدعو الله ويقول : رب ، ماذا أقول لبني إسرائيل إذا لقيتهم وقد أهلكت خيارهم ؟ ( رب لو شئت أهلكتهم من قبل وإياي )\nوقال محمد بن إسحاق : اختار موسى من بني إسرائيل سبعين رجلا الخير فالخير ، وقال : انطلقوا إلى الله فتوبوا إليه مما صنعتم ، وسلوه التوبة على من تركتم وراءكم من قومكم ، صوموا وتطهروا ، وطهروا ثيابكم . فخرج بهم إلى طور سيناء ، لميقات وقته له ربه ، وكان لا يأتيه إلا بإذن منه وعلم - فقال له السبعون - فيما ذكر لي - حين صنعوا ما أمرهم به ، وخرجوا معه للقاء ربه ، فقالوا لموسى : اطلب لنا نسمع كلام ربنا . فقال : أفعل . فلما دنا موسى من الجبل ، وقع عليه عمود الغمام ، حتى تغشى الجبل كله . ودنا موسى فدخل فيه ، وقال للقوم : ادنوا . وكان موسى إذا كلمه الله وقع على جبهة موسى نور ساطع ، لا يستطيع أحد من بني آدم أن ينظر إليه . فضرب دونه بالحجاب . ودنا القوم ، حتى إذا دخلوا وقعوا سجودا فسمعوه وهو يكلم موسى ، يأمره وينهاه : افعل ، ولا تفعل . فلما فرغ إليه من أمره ، انكشف عن موسى الغمام ، فأقبل إليهم ، فقالوا لموسى : لن نؤمن لك حتى نرى الله جهرة . فأخذتهم الرجفة - وهي الصاعقة - فافتلتت أرواحهم ، فماتوا جميعا . فقام موسى يناشد ربه ويدعوه ويرغب إليه ، ويقول : ( رب لو شئت أهلكتهم من قبل وإياي ) قد سفهوا ، أفنهلك من ورائي من بني إسرائيل .\nوقال سفيان الثوري : حدثني أبو إسحاق ، عن عمارة بن عبد السلولي ، عن علي بن أبي طالب ، رضي الله عنه ، قال : انطلق موسى وهارون وشبر وشبير ، فانطلقوا إلى سفح جبل ، فنام هارون على سرير ، فتوفاه الله ، عز وجل . فلما رجع موسى إلى بني إسرائيل قالوا له : أين هارون ؟ قال : توفاه الله ، عز وجل . قالوا له أنت قتلته ، حسدتنا على خلقه ولينه - أو كلمة نحوها - قال : فاختاروا من شئتم . قال : فاختاروا سبعين رجلا . قال : فذلك قوله تعالى : ( واختار موسى قومه سبعين رجلا ) فلما انتهوا إليه قالوا : يا هارون ، من قتلك ؟ قال : ما قتلني أحد ، ولكن توفاني الله . قالوا : يا موسى ، لن تعصى بعد اليوم . قال : فأخذتهم الرجفة . قال : فجعل موسى ، عليه السلام ، يرجع يمينا وشمالا وقال : يا ( رب لو شئت أهلكتهم من قبل وإياي أتهلكنا بما فعل السفهاء منا إن هي إلا فتنتك تضل بها من تشاء وتهدي من تشاء ) قال : فأحياهم الله وجعلهم أنبياء كلهم .\nهذا أثر غريب جدا ، وعمارة بن عبد هذا لا أعرفه . وقد رواه شعبة ، عن أبي إسحاق عن رجل من بني سلول عن علي ، فذكره\nوقال ابن عباس ومجاهد وقتادة وابن جريج : إنما أخذتهم الرجفة لأنهم لم يزايلوا قومهم في عبادتهم العجل ، ولا نهوهم ، ويتوجه هذا القول بقول موسى : ( أتهلكنا بما فعل السفهاء منا )\nوقوله : ( إن هي إلا فتنتك ) أي : ابتلاؤك واختبارك وامتحانك . قاله ابن عباس ، وسعيد بن جبير ، وأبو العالية ، وربيع بن أنس ، وغير واحد من علماء السلف والخلف . ولا معنى له غير ذلك ; يقول : إن الأمر إلا أمرك ، وإن الحكم إلا لك ، فما شئت كان ، تضل من تشاء ، وتهدي من تشاء ، ولا هادي لمن أضللت ، ولا مضل لمن هديت ، ولا معطي لما منعت ، ولا مانع لما أعطيت ، فالملك كله لك ، والحكم كله لك ، لك الخلق والأمر .\nوقوله : ( أنت ولينا فاغفر لنا وارحمنا وأنت خير الغافرين ) الغفر هو : الستر ، وترك المؤاخذة بالذنب ، والرحمة إذا قرنت مع الغفر ، يراد بها ألا يوقعه في مثله في المستقبل ، ( وأنت خير الغافرين ) أي : لا يغفر الذنوب إلا أنت\n                                    ",
        "qortoby": "وَٱخۡتَارَ مُوسَىٰ قَوۡمَهُۥ سَبۡعِينَ رَجُلٗا لِّمِيقَٰتِنَاۖ فَلَمَّآ أَخَذَتۡهُمُ ٱلرَّجۡفَةُ قَالَ رَبِّ لَوۡ شِئۡتَ أَهۡلَكۡتَهُم مِّن قَبۡلُ وَإِيَّٰيَۖ أَتُهۡلِكُنَا بِمَا فَعَلَ ٱلسُّفَهَآءُ مِنَّآۖ إِنۡ هِيَ إِلَّا فِتۡنَتُكَ تُضِلُّ بِهَا مَن تَشَآءُ وَتَهۡدِي مَن تَشَآءُۖ أَنتَ وَلِيُّنَا فَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۖ وَأَنتَ خَيۡرُ ٱلۡغَٰفِرِينَ ٥٥١\n                                    \n                                    \n                                    قوله تعالى واختار موسى قومه سبعين رجلا لميقاتنا فلما أخذتهم الرجفة قال رب لو شئت أهلكتهم من قبل وإياي أتهلكنا بما فعل السفهاء منا إن هي إلا فتنتك تضل بها من تشاء وتهدي من تشاء أنت ولينا فاغفر لنا وارحمنا وأنت خير الغافرين\nقوله تعالى واختار موسى قومه سبعين رجلا لميقاتنا مفعولان ، أحدهما حذفت منه \" من \" وأنشد سيبويه :\nمنا الذي اختير الرجال سماحة وبرا إذا هب الرياح الزعازع\nوقال الراعي يمدح رجلا :\nاخترتك الناس إذ رثت خلائقهم واختل من كان يرجى عنده السول\nيريد : اخترتك من الناس . وأصل اختار اختير ; فلما تحركت الياء وقبلها فتحة قلبت ألفا ، نحو قال وباع .\nقوله تعالى فلما أخذتهم الرجفة أي ماتوا . والرجفة في اللغة الزلزلة الشديدة . ويروى أنهم زلزلوا حتى ماتوا .\nقوله تعالى قال رب لو شئت أهلكتهم من قبل وإياي أي أمتهم ; كما قال عز وجل : إن امرؤ هلك . وإياي عطف . والمعنى : لو شئت أمتنا من قبل أن نخرج إلى الميقات بمحضر بني إسرائيل حتى لا يتهموني . أبو بكر بن أبي شيبة : حدثنا يحيى بن سعيد القطان عن سفيان عن أبي إسحاق عن عمارة بن عبد عن علي رضي الله عنه قال : انطلق موسى وهارون صلى الله عليهما وانطلق شبر وشبير - هما ابنا هارون - فانتهوا إلى جبل فيه سرير ، فقام عليه هارون فقبض روحه . فرجع موسى إلى قومه ، فقالوا : أنت قتلته ، حسدتنا على لينه وعلى خلقه ، أو كلمة نحوها ، الشك من سفيان ، فقال : كيف أقتله ومعي ابناه ! قال : فاختاروا من شئتم ; فاختاروا من كل سبط عشرة . قال : فذلك قوله : واختار موسى قومه سبعين رجلا لميقاتنا فانتهوا إليه ; فقالوا : من قتلك يا هارون ؟ قال : ما قتلني أحد ولكن الله توفاني . قالوا : يا موسى ، ما تعصى .\nفأخذتهم الرجفة ، فجعلوا يترددون يمينا وشمالا ، ويقول : لو شئت أهلكتهم من قبل وإياي أتهلكنا بما فعل السفهاء منا إن هي إلا فتنتك قال : فدعا الله فأحياهم وجعلهم أنبياء كلهم . وقيل : أخذتهم الرجفة لقولهم : أرنا الله جهرة كما قال الله تعالى : وإذ قلتم يا موسى لن نؤمن لك حتى نرى الله جهرة فأخذتكم الصاعقة على ما تقدم بيانه في \" البقرة \" وقال ابن عباس : إنما أخذتهم الرجفة ; لأنهم لم ينهوا من عبد العجل ولم يرضوا عبادته . وقيل : هؤلاء السبعون غير من قالوا أرنا الله جهرة . وقال وهب : ما ماتوا ، ولكن أخذتهم الرجفة من الهيبة حتى كادت أن تبين مفاصلهم ، وخاف موسى عليهم الموت . وقد تقدم في \" البقرة \" عن وهب أنهم ماتوا يوما وليلة . وقيل غير هذا في معنى سبب أخذهم بالرجفة . والله أعلم بصحة ذلك .\nومقصود الاستفهام في قوله : أتهلكنا الجحد ; أي لست تفعل ذلك . وهو كثير في كلام العرب . وإذا كان نفيا كان بمعنى الإيجاب ; كما قال :\nألستم خير من ركب المطايا وأندى العالمين بطون راح\nوقيل : معناه الدعاء والطلب ، أي لا تهلكنا ; وأضاف إلى نفسه . والمراد القوم الذين ماتوا من الرجفة . وقال المبرد : المراد بالاستفهام استفهام استعظام ; كأنه يقول : لا تهلكنا ، وقد علم موسى أن الله لا يهلك أحدا بذنب غيره ; ولكنه كقول عيسى : إن تعذبهم فإنهم عبادك . وقيل : المراد بالسفهاء السبعون . والمعنى : أتهلك بني إسرائيل بما فعل هؤلاء السفهاء في قولهم أرنا الله جهرة .\nإن هي إلا فتنتك أي ما هذا إلا اختبارك وامتحانك . وأضاف الفتنة إلى الله عز وجل ولم يضفها إلى نفسه ; كما قال إبراهيم :وإذا مرضت فهو يشفين فأضاف المرض إلى نفسه والشفاء إلى الله تعالى : وقال يوشع : وما أنسانيه إلا الشيطان . وإنما استفاد ذلك موسى عليه السلام من قوله تعالى له : فإنا قد فتنا قومك من بعدك . فلما رجع إلى قومه ورأى العجل منصوبا للعبادة وله خوار قال إن هي إلا فتنتك تضل بها أي بالفتنة .\nمن تشاء وتهدي من تشاء وهذا رد على القدرية .\n                                    ",
        "saadi": "وَٱخۡتَارَ مُوسَىٰ قَوۡمَهُۥ سَبۡعِينَ رَجُلٗا لِّمِيقَٰتِنَاۖ فَلَمَّآ أَخَذَتۡهُمُ ٱلرَّجۡفَةُ قَالَ رَبِّ لَوۡ شِئۡتَ أَهۡلَكۡتَهُم مِّن قَبۡلُ وَإِيَّٰيَۖ أَتُهۡلِكُنَا بِمَا فَعَلَ ٱلسُّفَهَآءُ مِنَّآۖ إِنۡ هِيَ إِلَّا فِتۡنَتُكَ تُضِلُّ بِهَا مَن تَشَآءُ وَتَهۡدِي مَن تَشَآءُۖ أَنتَ وَلِيُّنَا فَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۖ وَأَنتَ خَيۡرُ ٱلۡغَٰفِرِينَ ٥٥١\n                                        \n                                        \n                                        \n                                        و لما تاب بنو إسرائيل وتراجعوا إلى رشدهم اخْتَارَ مُوسَى منهم سَبْعِينَ رَجُلا من خيارهم، ليعتذروا لقومهم عند ربهم، ووعدهم اللّه ميقاتا يحضرون فيه، فلما حضروه، قالوا: يا موسى، أَرِنَا اللَّهَ جَهْرَةً فتجرأوا على اللّه جراءة كبيرة، وأساءوا الأدب معه، فـ أَخَذَتْهُمُ الرَّجْفَةُ فصعقوا وهلكوا. فلم يزل موسى عليه الصلاة والسلام، يتضرع إلى اللّه ويتبتل ويقول رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُمْ مِنْ قَبْلُ أن يحضروا ويكونون في حالة يعتذرون فيها لقومهم، فصاروا هم الظالمين أَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَاءُ مِنَّا أي: ضعفاء العقول، سفهاء الأحلام، فتضرع إلى اللّه واعتذر بأن المتجرئين على اللّه ليس لهم عقول كاملة، تردعهم عما قالوا وفعلوا، وبأنهم حصل لهم فتنة يخطر بها الإنسان، ويخاف من ذهاب دينه فقال: إِنْ هِيَ إِلا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَاءُ وَتَهْدِي مَنْ تَشَاءُ أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الْغَافِرِينَ أي: أنت خير من غفر، وأولى من رحم، وأكرم من أعطى وتفضل، فكأن موسى عليه الصلاة والسلام، قال: المقصود يا رب بالقصد الأول لنا كلنا، هو التزام طاعتك والإيمان بك، وأن من حضره عقله ورشده، وتم على ما وهبته من التوفيق، فإنه لم يزل مستقيما، وأما من ضعف عقله، وسفه رأيه، وصرفته الفتنة، فهو الذي فعل ما فعل، لذينك السببين، ومع هذا فأنت أرحم الراحمين، وخير الغافرين، فاغفر لنا وارحمنا. فأجاب اللّه سؤاله، وأحياهم من بعد موتهم، وغفر لهم ذنوبهم.\n\n                                    "
      },
      "originalText": "وَٱخۡتَارَ مُوسَىٰ قَوۡمَهُۥ سَبۡعِينَ رَجُلٗا لِّمِيقَٰتِنَاۖ فَلَمَّآ أَخَذَتۡهُمُ ٱلرَّجۡفَةُ قَالَ رَبِّ لَوۡ شِئۡتَ أَهۡلَكۡتَهُم مِّن قَبۡلُ وَإِيَّٰيَۖ أَتُهۡلِكُنَا بِمَا فَعَلَ ٱلسُّفَهَآءُ مِنَّآۖ إِنۡ هِيَ إِلَّا فِتۡنَتُكَ تُضِلُّ بِهَا مَن تَشَآءُ وَتَهۡدِي مَن تَشَآءُۖ أَنتَ وَلِيُّنَا فَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۖ وَأَنتَ خَيۡرُ ٱلۡغَٰفِرِينَ ٥٥١"
    }
  ]
}