{
  "number": 171,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 1114,
      "text": "وَقَطَّعْنَاهُمُ اثْنَتَيْ عَشْرَةَ أَسْبَاطًا أُمَمًا ۚ وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ إِذِ اسْتَسْقَاهُ قَوْمُهُ أَنِ اضْرِبْ بِعَصَاكَ الْحَجَرَ ۖ فَانْبَجَسَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍ مَشْرَبَهُمْ ۚ وَظَلَّلْنَا عَلَيْهِمُ الْغَمَامَ وَأَنْزَلْنَا عَلَيْهِمُ الْمَنَّ وَالسَّلْوَىٰ ۖ كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ ۚ وَمَا ظَلَمُونَا وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 160,
      "juz": 9,
      "manzil": 2,
      "page": 171,
      "ruku": 141,
      "hizbQuarter": 68,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَطَّعۡنَٰهُمُ ٱثۡنَتَيۡ عَشۡرَةَ أَسۡبَاطًا أُمَمٗاۚ وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰٓ إِذِ ٱسۡتَسۡقَىٰهُ قَوۡمُهُۥٓ أَنِ ٱضۡرِب بِّعَصَاكَ ٱلۡحَجَرَۖ فَٱنۢبَجَسَتۡ مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡنٗاۖ قَدۡ عَلِمَ كُلُّ أُنَاسٖ مَّشۡرَبَهُمۡۚ وَظَلَّلۡنَا عَلَيۡهِمُ ٱلۡغَمَٰمَ وَأَنزَلۡنَا عَلَيۡهِمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٠٦١\n                                    \n                                    \n                                    يقول تعالى واذكروا نعمتي عليكم في إجابتي لنبيكم موسى عليه السلام حين استسقاني لكم وتيسيري لكم الماء وإخراجه لكم من حجر يحمل معكم وتفجيري الماء لكم منه من ثنتي عشرة عينا كل سبط من أسباطكم عين قد عرفوها فكلو من المن والسلوى واشربوا من هذا الماء الذي أنبعته لكم بلا سعي منكم ولا كد واعبدوا الذي سخر لكم ذلك \"ولا تعثوا في الأرض مفسدين\" ولا تقابلوا النعم بالعصيان فتسلبوها.\nوقد بسطه المفسرون في كلامهم كما قال: ابن عباس رضي الله عنه وجعل بين ظهرانيهم حجر مربع وأمر موسى عليه السلام فضربه بعصاه فانفجرت منه اثنتا عشرة عينا في كل ناحية منه ثلاث عيون وأعلم كل سبط عينهم يشربون منها لا يرتحلون من منقلة إلا وجدوا ذلك معهم بالمكان الذي كان منهم بالمنزل الأول وهذا قطعة من الحديث الذي رواه النسائي وابن جرير وابن أبي حاتم وهو حديث الفتون الطويل.\nوقال: عطية العوفي وجعل لهم حجرا مثل رأس الثور يحمل على ثور فإذا نزلوا منزلا وضعوه فضربه موسى عليه السلام بعصاه فانفجرت منه اثنتا عشرة عينا فإذا ساروا حملوه على ثور فاستمسك الماء وقال: عثمان ابن عطاء الخراساني عن أبيه كان لبني إسرائيل حجر فكان يضعه هارون ويضربه موسى بالعصا وقال قتادة كان حجرا طوريا من الطور يحملونه معهم حتى إذا نزلوا ضربه موسى بعصاه وقال: الزمخشري وقيل كان من رخام وكان ذراعا في ذراع وقيل مثل رأس الإنسان وقيل كان من الجنة طوله عشرة أذرع على طول موسى وله شعبتان يتقدان في الظلمة وكان يحمل على حمار قال وقيل أهبطه آدم من الجنة فتوارثوه حتى وقع إلى شعيب فدفعه إليه مع العصا وقيل هو الحجر الذي وضع عليه ثوبه حين اغتسل فقال: له جبريل ارفع هذا الحجر فإن فيه قدرة ولك فيه معجزة فحمله في مخلاته قال الزمخشري محتمل أن تكون اللام للجنس لا للعهد أي اضرب الشيء الذي يقال له الحجر وعن الحسن لم يأمره أن يضرب حجرا بعينه قال وهذا أظهر في المعجزة وأبين في القدرة فكان يضرب الحجر بعصاه فينفجر ثم يضربه فييبس فقالوا إن فقد موسى هذا الحجر عطشنا فأوحى الله إليه أن يكلم الحجارة فتنفجر ولا يمسها بالعصا لعلهم يقرون والله أعلم وقال يحيى بن النضر: قلت لجويبر كيف علم كل أناس مشربهم؟ قال: كان موسى يضع الحجر ويقوم من كل سبط رجل ويضرب موسى الحجر فينفجر منه اثنتا عشرة عينا فينضح من كل عين على رجل فيدعو ذلك الرجل سبطه إلى تلك العين وقال الضحاك: قال ابن عباس لما كان بنو إسرائيل في التيه شق لهم من الحجر أنهارا وقال الثوري عن أبي سعيد عن عكرمة عن ابن عباس: قال ذلك في التيه ضرب لهم موسى الحجر فصار منه اثنتي عشرة عينا من ماء لكل سبط منهم عين يشربون منها وقال مجاهد نحو قول ابن عباس وأخبر هنا بقوله \"فانبجست منه اثنتا عشرة عينا\" وهو أول الانفجار وأخبر ههنا بما آل إليه الحال آخرا وهو الانفجار فناسب ذكر الانفجار ههنا والله أعلم.\nلما ذكر تعالى ما دفعه عنهم من النقم شرع يذكرهم أيضا بما أسبغ عليهم من النعم فقال وظللنا عليكم الغمام وهو جمع غمامة سمي بذلك لأنه يغم السماء أي يواريها ويسترها وهو السحاب الأبيض ظللوا به في التيه ليقيهم حر الشمس كما رواه النسائي وغيره عن ابن عباس في حديث الفتون قال: ثم ظلل عليهم في التيه بالغمام قال ابن أبي حاتم وروى عن ابن عمر والربيع بن أنس وأبي مجلز والضحاك والسدي نحو قول ابن عباس وقال الحسن وقتادة \"وظللنا عليكم الغمام\" كان هذا في البرية ظلل عليهم الغمام من الشمس وقال: ابن جرير قال: آخرون وهو غمام أبرد من هذا وأطيب.\nوقال ابن أبي حاتم حدثنا أبي حدثنا أبو حذيفة حدثنا شبل عن ابن أبي نجيح عن مجاهد \"وظللنا عليكم الغمام\" قال ليس بالسحاب هو الغمام الذي يأتي الله فيه يوم القيامة ولم يكن إلا لهم.\nوهكذا رواه ابن جرير عن المثنى بن إبراهيم عن أبي حذيفة وكذا رواه الثوري وغيره عن ابن أبي نجيح عن مجاهد وكأنه يريد والله أعلم أنه ليس من زي هذا السحاب بل أحسن منه وأطيب وأبهى منظرا كما قال سنيد في تفسيره عن حجاج بن محمد عن ابن جريج قال: قال ابن عباس \"وظللنا عليكم الغمام\" قال غمام أبرد من هذا وأطيب وهو الذي يأتي الله فيه في قوله \"هل ينظرون إلا أن يأتيهم الله في ظلل من الغمام والملائكة\" وهو الذي جاءت فيه الملائكة يوم بدر.\nقال ابن عباس وكان معهم في التيه: وقوله تعالى \"وأنزلنا عليكم المن\" اختلفت عبارات المفسرين في المن ما هو؟ فقال علي بن أبي طلحة عن ابن عباس كان المن ينزل عليهم على الأشجار فيغدون إليه فيأكلون منه ما شاءوا.\nوقال مجاهد المن صمغة وقال: عكرمة المن شيء أنزله الله عليهم مثل الظل شبه الرب الغليظ وقال: السدي قالوا يا موسى كيف لنا بما ههنا أين الطعام فأنزل الله عليهم المن فكان يسقط على شجرة الزنجبيل وقال: قتادة كان المن ينزل عليهم في محلهم سقوط الثلج أشد بياضا من اللبن وأحلى من العسل يسقط عليهم من طلوع الفجر إلى طلوع الشمس يأخذ الرجل منهم قدر ما يكفيه يومه ذلك فإذا تعدى ذلك فسد ولم يبق حتى إذا كان يوم سادسه يوم جمعته أخذ ما يكفيه ليوم سادسه ويوم سابعه لأنه كان يوم عيد لا يشخص فيه لأمر معيشته ولا يطلبه لشيء وهذا كله في البرية وقال: الربيع بن أنس المن شراب كان ينزل عليهم مثل العسل فيمزجونه بالماء ثم يشربونه.\nوقال وهب بن منبه وسئل عن المن فقال خبز رقاق مثل الذرة أو مثل النقي وقال أبو جعفر بن جرير حدثني محمد بن إسحاق حدثنا أبو أحمد حدثنا إسرائيل عن جابر عن عامر وهو الشعبي قال: عسلكم هذا جزء من سبعين جزءا من المن وكذا قال عبدالرحمن بن زيد بن أسلم أنه العسل وقع في شعر أمية بن أبي الصلت حيث قال: فرأى الله أنهم بمضيع لا بذي مزرع ولا مثمورا فسناها عليهم غاديات ويرى مزنهم خلايا وخورا عسلا ناطفا وماء فراتا وحليبا ذا بهجة مزمورا فالناطف هو السائل والحليب المزمور الصافي منه والغرض أن عبارات المفسرين متقاربة في شرح المن فمنهم من فسره بالطعام ومنهم من فسره بالشراب والظاهر والله أعلم أنه كل ما امتن الله به عليهم من طعام وشراب وغير ذلك مما ليس لهم فيه عمل ولا كذا فالمن المشهور أن أكل وحده كان طعاما وحلاوة وإن مزج مع الماء صار شرابا طيبا وإن ركب مع غيره صار نوع آخر ولكن ليس هو المراد من الآية وحده والدليل على ذلك قول البخاري حدثنا أبو نعيم حدثنا سفيان عن عبدالملك بن عمير بن حريث عن سعيد بن زيد رضي الله عنه قال: قال النبي \" الكمأة من المن وماؤها شفاء للعين \" وهذا الحديث رواه الإمام أحمد عن سفيان بن عيينة عن عبدالملك وهو ابن عمير به وأخرجه الجماعة في كتبهم إلا أبا داود من طرق عن عبدالملك وهو ابن عمير به وقال الترمذي حسن صحيح ورواه البخاري ومسلم من رواية الحسن العرني عن عمرو بن حريث به وقال: الترمذي حدثنا أبو عبيدة بن أبي السفر ومحمود بن عيلان قالا: حدثنا سعيد بن عامر عن محمد بن عمرو عن أبي سلمة عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" العجوة من الجنة وفيها شفاء من السم والكمأة من المن وماؤها شفاء للعين \" تفرد بإخراجه الترمذي ثم قال: هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن محمد بن عمرو ولا من حديث سعيد بن عامر عنه وفي الباب عن سعيد بن زيد وأبي سعيد وجابر كذا قال- وقد رواه الحافظ أبو بكر بن مردويه في تفسيره من طريق آخر عن أبي هريرة فقال: حدثنا أحمد بن الحسن بن أحمد البصري حدثنا أسلم بن سهل حدثنا القاسم بن عيسى حدثنا طلحة بن عبدالرحمن عن قتادة عن سعيد بن المسيب عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" الكمأة من المن وماؤها شفاء للعين \" وهذا حديث غريب من هذا الوجه وطلحة بن عبدالرحمن هذا السلمي الواسطي يكنى بأبي محمد وقيل أبو سليمان المؤدب قال فيه الحافظ أبو أحمد بن عدي: روى عن قتادة أشياء لا يتابع عليها.\nثم قال الترمذي حدثنا محمد بن بشار حدثنا معاذ بن هشام حدثنا أبي عن قتادة عن شهر بن حوشب عن أبي هريرة أن ناسا من أصحاب النبي صلى الله عليه وسلم قالوا الكمأة جدري الأرض فقال نبي الله صلى الله عليه وسلم \" الكمأة من المن وماؤها شفاء للعين والعجوة من الجنة وهي شفاء من السم \" وهذا الحديث قد رواه النسائي عن محمد بن بشار به وعنه عن غندر عن شعبة عن أبي بشر جعفر بن إياس عن شهر بن حوشب عن أبي هريرة به وعن محمد بن بشار عن عبدالأعلى عن خالد الحذاء عن شهر بن حوشب بقصة الكمأة فقط.\nوروى النسائي أيضا وابن ماجه من حديث محمد بن بشار عن أبي عبدالصمد بن عبدالعزيز بن عبدالصمد عن مطر الوراق عن شهر بقصة العجوة عند النسائي وبالقصتين عند ابن ماجه وهذه الطريق منقطعة بين شهر بن حوشب وأبي هريرة فإنه لم يسمع منه بدليل ما رواه النسائي في الوليمة من سننه عن علي بن الحسين الدرهمي عن عبدالأعلى عن سعيد بن أبي عروبة عن قتادة عن شهر بن حوشب عن عبدالرحمن بن غنم عن أبي هريرة قال: خرج رسول الله صلى الله عليه وسلم وهم يذكرون الكمأة وبعضهم يقول جدري الأرض فقال \" الكمأة من المن وماؤها شفاء للعين \" وروى عن شهر بن حوشب عن أبي سعيد وجابر كما قال الإمام أحمد حدثنا أسباط بن محمد حدثنا الأعمش عن جعفر بن إياس عن شهر بن حوشب عن جابر بن عبدالله وأبي سعيد الخدري قالا قال: رسول الله صلى الله عليه وسلم \" الكمأة من المن وماؤها شفاء للعين والعجوة من الجنة وهي شفاء من السم \" وقال النسائي في الوليمة أيضا حدثنا محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة عن أبي بشـر جعفر بن إياس عن شهر بن حوشب عن أبي سعيد وجابر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال \" الكمأة من المن وماؤها شفاء للعين \" ثم رواه أيضا ابن ماجه من طرق عن الأعمش عن أبي بشر عن شهر عنهما به وقد رويا - أعني النسائي من حديث جرير وابن ماجه من حديث سعيد بن أبي سلمة - كلاهما عن الأعمش عن جعفر بن إياس عن أبي نضرة عن أبي سعيد رواه النسائي وحديث جابر عن النبي صلى الله عليه وسلم قال \" الكمأة من المن وماؤها شفاء للعين \" ورواه ابن مردويه عن أحمد بن عثمان عن عباس الدوري عن لاحق بن صواب عن عمار بن رزيق عن الأعمش كابن ماجه وقال: ابن مردويه أيضا حدثنا أحمد بن عثمان حدثنا عباس الدوري حدثنا الحسن بن الربيع حدثنا أبو الأعمش عن الأعمش عن المنهال بن عمرو عن عبدالرحمن بن أبي ليلى عن أبي سعيد الخدري قال: خرج علينا رسول الله صلى الله عليه وسلم وفي يده كمآت فقال \" الكمأة من المن وماؤها شفاء للعين \" وأخرجه النسائي عن عمرو بن منصور عن الحسن بن الربيع به ثم ابن مردويه رواه أيضا عن عبدالله بن إسحاق عن الحسن بن سلام عن عبيد الله بن موسى عن شيبان عن الأعمش به وكذا رواه النسائي عن أحمد بن عثمان بن حكيم عن عبيد الله بن موسى وقد روى من حديث أنس بن مالك رضي الله عنه كما قال ابن مردويه حدثنا محمد بن عبدالله بن إبراهيم حدثنا حمدون بن أحمد حدثنا جويرة بن أشرس حدثنا حماد عن شعيب بن الحجاب عن أنس أن أصحاب رسول الله صلى الله عليه وسلم تداروا في الشجرة التي اجتثت من فوق الأرض مالها من قرار فقال بعضهم نحسبه الكمأة فقال: رسول الله صلى الله عليه وسلم \" الكمأة من المن وماؤها شفاء العين والعجوة من الجنة وفيها شفاء من السم \" وهذا الحديث محفوظ أصله من رواية حماد بن سلمة وقد روى الترمذي والنسائي من طريقه شيئا من هذا والله أعلم: وروى عن شهر عن ابن عباس كما رواه النسائي أيضا في الوليمة عن أبي بكر أحمد بن علي بن سعيد عن عبدالله بن عون الخراز عن أبي عبيدة الحداد عن عبد الجليل بن عطية عن عبدالله بن عباس عن النبي صلى الله عليه وسلم قال \" الكمأة من المن وماؤها شفاء للعين \" فقد اختلف كما ترى فيه على شهر بن حوشب ويحتمل عندي أنه حفظه ورواه من هذه الطرق كلها وقد سمعه من بعض الصحابة وبلغه عن بعضهم فإن الأسانيد إليه جيدة وهو لا يتعمد الكذب وأصل الحديث محفوظ عن رسول الله صلى الله عليه وسلم كما تقدم من رواية سعيد بن زيد رضي الله عنه.\nوأما السلوى فقال علي بن أبي طلحة عن ابن عباس السلوى طائر يشبه بالسمانى كانوا يأكلون منه.\nوقال السدي في خبره ذكره عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة عن ابن مسعود وعن ناس من الصحابة السلوى طائر يشبه السمانى وقال ابن أبي حاتم حدثنا الحسن بن محمد بن الصباح حدثنا عبدالصمد بن عبد الوارث حدثنا قوة بن خالد عن جهضم عن ابن عباس قال السلوى هو السمانى وكذا قال: مجاهد والشعبي والضحاك والحسن وعكرمة والربيع بن أنس رحمهم الله تعالى وعن عكرمة أما السلوى فطير كطير يكون بالجنة أكبر من العصفور أو نحو ذلك.\nوقال قتادة: السلوى كان من طير إلى الحمرة تحشرها عليهم الريح الجنوب وكان الرجل يذبح منها قدر ما يكفيه يومه ذلك فإذا تغذى فسد ولم يبق عنده حتى إذا كان يوم سادسه ليوم جمعته أخذ ما يكفيه ليوم سادسه ويوم سابعه لأنه كان يوم عبادة لا يشخص فيه لشيء ولا يطلبه وقال: وهب بن منبه: السلوى طير سمين مثل الحمامة كان يأتيهم فيأخذون منه من سبت إلى سبت وفي رواية عن وهب وقال: سألت بنو إسرائيل موسى عليه السلام لحما فقال الله لأطعمنهم من أقل لحم يعلم في الأرض فأرسل عليهم ريح فأذرت عند مساكنهم السلوى وهو السماني مثل ميل في ميل قيد رمح في السماء فخباءوا للغد فنتن اللحم وخنز الخبر وقال السدي لما دخل بنو إسرائيل التيه قالوا لموسى عليه السلام كيف لنا بما ههنا أين الطعام فأنزل الله عليهم المن فكان ينزل على شجر الزنجبيل والسلوى وهو طائر يشبه السماني أكبر منه فكان يأتي أحدهم فينظر إلى الطير فإن كان سمينا ذبحه وإلا أرسله فإذا سمن أتاه فقالوا هذا الطعام فأين الشراب؟ فأمر موسى فضرب بعصاه الحجر فانفجرت منه اثنتا عشرة عين فشرب كل سبط من عين فقالوا هذا الشراب فأين الظل؟ فظلل عليهم الغمام فقالوا هذا الظل فأين اللباس؟ فكانت ثيابهم تطول معهم كما يطول الصبيان ولا يتخرق لهم ثوب فذلك قوله تعالى \"وظللنا عليهم الغمام وأنزلنا عليهم المن والسلوى\" وقوله \"وإذا ستسقى موسى لقومه فقلنا اضرب بعصاك الحجر فانفجرت منه اثنتا عشرة عينا قد علم كل أناس مشربهم كلوا واشربوا من رزق الله ولا تعثوا في الأرض مفسدين\" وروي عن وهب بن منبه وعبدالرحمن بن زيد بن أسلم نحو ما قاله السدي وقال: سنيد عن حجاج عن ابن جريج قال: قال ابن عباس خلق لهم في التيه ثياب لا تخرق ولا تدرن قال ابن جريج: فكان الرجل إذا أخذ من المن والسلوى فوق طعام يوم فسد إلا أنهم كانوا يأخذون في يوم الجمعة طعام يوم السبت فلا يصبح فاسدا قال: ابن عطية السلوى طير بإجماع المفسرين وقد غلط الهذلي في قوله إنه العسل وأنشد في ذلك مستشهدا: وقاسمها بالله جهدا لأنتم ألذ من السلوى إذا ما أشورها قال فظن أن السلوى عسلا قال القرطبي: دعوى الإجماع لا يصح لأن المؤرخ أحد علماء اللغة والتفسير قال إنه العسل واستدل ببيت الهذلي هذا وذكر أنه كذلك فى لغة كنانة لأنه يسلي به ومنه عين سلوان وقال الجوهري: السلوى العسل واستشهد ببيت الهذلي أيضا والسلوانة بالضم خرزة كانوا يقولون إذا صب عليها ماء المطر فشربها العاشق سلا قال الشاعر: شربت على سلوانة ماء مزنة فلا وجديد العيش يامي ما أسلو واسم ذلك الماء السلوان وقال بعضهم السلوان دواء يشفي الحزين فيسلو والأطباء يسمونه مفرج قالوا والسلوى جمع بلفظ الواحد أيضا كما يقال سماني للمفرد والجمع وويلي كذلك وقال الخليل واحده سلواة وأنشد: وإني لتعروني لذكـراك هزة كما انتفض السلواة من بلل القطر وقال الكسائي: السلوى واحدة وجمعه سلاوى نقله كله القرطبي وقوله تعالى \"كلوا من طيبات ما رزقناكم\" أمر إباحة وإرشاد وامتنان وقوله تعالى \"وما ظلمونا ولكن كانوا أنفسهم يظلمون\" أي أمرناهم بالأكل مما رزقناهم وأن يعبدوا كما قال \"كلوا من رزق ربكم واشكروا له\" فخالفوا وكفروا فظلموا أنفسهم هذا مع ما شاهدوه من الآيات البينات والمعجزات القاطعات وخوارق العادات ومن ههنا متبين فضيلة أصحاب محمد صلى الله عليه وسلم و رضى عنهم على سائر أصحاب الأنبياء في صبرهم وثباتهم وعدم تعنتهم مع ما كانوا معه في أسفاره وغزواته منها عام تبوك في ذلك القيظ والحر الشديد والجهد لم يسألوا خرق عادة ولا إيجاد أمر مع أن ذلك كان سهلا على النبي ولكن لما أجهدهم الجوع سألوه في تكثير طعامهم فجمعوا ما معهم فجاء قدر مبرك الشاة فدعا الله فيه وأمرهم فملؤا كل وعاء معهم وكذا لما احتاجوا إلى الماء سأل الله تعالى فجاءتهم سحابة فأمطرتهم فشربوا وسقوا الإبل وملؤا أسقيتهم ثم نظروا فإذا هي لم تجاوز العسكر.\nفهذا هو الأكمل في اتباع الشيء مع قدر الله مع متابعة الرسول صلى الله عليه وسلم.\n                                    ",
        "qortoby": "وَقَطَّعۡنَٰهُمُ ٱثۡنَتَيۡ عَشۡرَةَ أَسۡبَاطًا أُمَمٗاۚ وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰٓ إِذِ ٱسۡتَسۡقَىٰهُ قَوۡمُهُۥٓ أَنِ ٱضۡرِب بِّعَصَاكَ ٱلۡحَجَرَۖ فَٱنۢبَجَسَتۡ مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡنٗاۖ قَدۡ عَلِمَ كُلُّ أُنَاسٖ مَّشۡرَبَهُمۡۚ وَظَلَّلۡنَا عَلَيۡهِمُ ٱلۡغَمَٰمَ وَأَنزَلۡنَا عَلَيۡهِمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٠٦١\n                                    \n                                    \n                                    قوله تعالى وقطعناهم اثنتي عشرة أسباطا أمما عدد نعمه على بني إسرائيل ، وجعلهم أسباطا ليكون أمر كل سبط معروفا من جهة رئيسهم ; فيخف الأمر على موسى . وفي التنزيل : وبعثنا منهم اثني عشر نقيبا وقد تقدم .\nوقوله : اثنتي عشرة والسبط مذكر لأن بعده أمما فذهب التأنيث إلى الأمم . ولو قال : اثني عشر لتذكير السبط جاز ; عن الفراء . وقيل : أراد بالأسباط القبائل والفرق ; فلذلك أنث العدد . قال الشاعر :\nوإن قريشا كلها عشر أبطن وأنت بريء من قبائلها العشر\nفذهب بالبطن إلى القبيلة والفصيلة ; فلذلك أنثها . والبطن مذكر ; كما أن الأسباط جمع مذكر . الزجاج : المعنى قطعناهم اثنتي عشرة فرقة .\nأسباطا بدل من اثنتي عشرة أمما نعت للأسباط . وروى المفضل عن عاصم ( وقطعناهم ) مخففا .\nأسباطا الأسباط في ولد إسحاق بمنزلة القبائل في ولد إسماعيل عليهما السلام . والأسباط مأخوذ من السبط وهو شجر تعلفه الإبل .\n                                    ",
        "saadi": "وَقَطَّعۡنَٰهُمُ ٱثۡنَتَيۡ عَشۡرَةَ أَسۡبَاطًا أُمَمٗاۚ وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰٓ إِذِ ٱسۡتَسۡقَىٰهُ قَوۡمُهُۥٓ أَنِ ٱضۡرِب بِّعَصَاكَ ٱلۡحَجَرَۖ فَٱنۢبَجَسَتۡ مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡنٗاۖ قَدۡ عَلِمَ كُلُّ أُنَاسٖ مَّشۡرَبَهُمۡۚ وَظَلَّلۡنَا عَلَيۡهِمُ ٱلۡغَمَٰمَ وَأَنزَلۡنَا عَلَيۡهِمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٠٦١\n                                        \n                                        \n                                        \n                                        وَقَطَّعْنَاهُمُ أي: قسمناهم اثْنَتَيْ عَشْرَةَ أَسْبَاطًا أُمَمًا أي: اثنتي عشرة قبيلة متعارفة متوالفة، كل بني رجل من أولاد يعقوب قبيلة. وَأَوْحَيْنَا إِلَى مُوسَى إِذِ اسْتَسْقَاهُ قَوْمُهُ أي: طلبوا منه أن يدعو اللّه تعالى، أن يسقيهم ماء يشربون منه وتشرب منه مواشيهم، وذلك لأنهم - واللّه أعلم - في محل قليل الماء. فأوحى اللّه لموسى إجابة لطلبتهم أَنِ اضْرِبْ بِعَصَاكَ الْحَجَرَ يحتمل أنه حجر معين، ويحتمل أنه اسم جنس، يشمل أي حجر كان، فضربه فَانْبَجَسَتْ أي: انفجرت من ذلك الحجر اثْنَتَا عَشْرَةَ عَيْنًا جارية سارحة. قَدْ عَلِمَ كُلُّ أُنَاسٍ مَشْرَبَهُمْ أي: قد قسم على كل قبيلة من تلك القبائل الاثنتي عشرة، وجعل لكل منهم عينا، فعلموها، واطمأنوا، واستراحوا من التعب والمزاحمة، والمخاصمة، وهذا من تمام نعمة اللّه عليهم. وَظَلَّلْنَا عَلَيْهِمُ الْغَمَامَ فكان يسترهم من حر الشمس وَأَنـزلْنَا عَلَيْهِمُ الْمَنَّ وهو الحلوى، وَالسَّلْوَى وهو لحم طير من أنواع الطيور وألذها، فجمع اللّه لهم بين الظلال، والشراب، والطعام الطيب، من الحلوى واللحوم، على وجه الراحة والطمأنينة. وقيل لهم: كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَمَا ظَلَمُونَا حين لم يشكروا اللّه، ولم يقوموا بما أوجب اللّه عليهم. وَلَكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ حيث فوتوها كل خير، وعرضوها للشر والنقمة، وهذا كان مدة لبثهم في التيه.\n                                    "
      },
      "originalText": "وَقَطَّعۡنَٰهُمُ ٱثۡنَتَيۡ عَشۡرَةَ أَسۡبَاطًا أُمَمٗاۚ وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰٓ إِذِ ٱسۡتَسۡقَىٰهُ قَوۡمُهُۥٓ أَنِ ٱضۡرِب بِّعَصَاكَ ٱلۡحَجَرَۖ فَٱنۢبَجَسَتۡ مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡنٗاۖ قَدۡ عَلِمَ كُلُّ أُنَاسٖ مَّشۡرَبَهُمۡۚ وَظَلَّلۡنَا عَلَيۡهِمُ ٱلۡغَمَٰمَ وَأَنزَلۡنَا عَلَيۡهِمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٠٦١"
    },
    {
      "number": 1115,
      "text": "وَإِذْ قِيلَ لَهُمُ اسْكُنُوا هَٰذِهِ الْقَرْيَةَ وَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ وَقُولُوا حِطَّةٌ وَادْخُلُوا الْبَابَ سُجَّدًا نَغْفِرْ لَكُمْ خَطِيئَاتِكُمْ ۚ سَنَزِيدُ الْمُحْسِنِينَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 161,
      "juz": 9,
      "manzil": 2,
      "page": 171,
      "ruku": 141,
      "hizbQuarter": 68,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ قِيلَ لَهُمُ ٱسۡكُنُواْ هَٰذِهِ ٱلۡقَرۡيَةَ وَكُلُواْ مِنۡهَا حَيۡثُ شِئۡتُمۡ وَقُولُواْ حِطَّةٞ وَٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا نَّغۡفِرۡ لَكُمۡ خَطِيٓـَٰٔتِكُمۡۚ سَنَزِيدُ ٱلۡمُحۡسِنِينَ ١٦١\n                                    \n                                    \n                                    يقول تعالى لائما لهم على نكولهم عن الجهاد ودخولهم الأرض المقدسة لما قدموا من برد مصر صحبة موسى عليه السلام فأمروا بدخول الأرض المقدسة التي هي ميراث لهم عن أبيهم إسرائيل وقتال من فيها من العماليق الكفرة فنكلوا عن قتالهم وضعفوا واستحسروا فرماهم الله في التيه عقوبة لهم كما ذكره تعالى في سورة المائدة ولهذا كان أصح القولين أن هذه البلدة هي بيت المقدس كما نص على ذلك السدي والربيع بن أنس وقتادة وأبو مسلم الأصفهاني وغير واحد وقد قال الله تعالى حاكيا عن موسى \"يا قوم ادخلوا الأرض المقدسة التي كتب الله لكم ولا ترتدوا\" الآيات.\nوقال: آخرون هي أريحا ويحكى عن ابن عباس وعبدالرحمن بن زيد وهذا بعيد لأنها ليست على طريقهم وهم قاصدون بيت المقدس لا أريحا وأبعد من ذلك قول من ذهب إلى أنها مصر حكاه الرازي في تفسيره والصحيح الأول أن بيت المقدس وهذا كان لما خرجوا من التيه بعد أربعين سنة مع يوشع بن نون عليه السلام وفتحها الله عليهم عشية جمعة وقد حبست لهم الشمس يومئذ قليلا حتى أمكن الفتح ولما فتحوها أقروا أن يدخلوا الباب باب البلد \"سجدا\" أي شكر الله تعالى على ما أنعم به عليهم من الفتح والنصر ورد بلدهم عليهم وإنقاذهم من التيه والضلال قال العوفي في تفسيره عن ابن عباس إنه كان يقول في قوله تعالى \"وادخلوا الباب سجدا\" أي ركعا وقال ابن جرير: حدثنا محمد بن بشار حدثنا أبو أحمد الزبيري حدثنا سفيان عن الأعمش عن المنهال بن عمرو وعن سعيد بن جبير عن ابن عباس في قوله \"وادخلوا الباب سجدا\" قال ركعا من باب صغير رواه الحاكم من حديث سفيان به ورواه ابن أبي حاتم من حديث سفيان وهو الثوري به وزاد فدخلوا من قبل استاهم وقال الحسن البصري أمروا أن يسجدوا على وجوههم حال دخولهم واستبعده الرازي وحكى عن بعضهم أن المراد ههنا في السجود الخضوع لتعذر حمله على حقيقته وقال الخصيف: قال عكرمة قال ابن عباس كان الباب قبل القبلة وقال ابن عباس ومجاهد والسدي وقتادة والضحاك هو باب الحطة من باب إيلياء ببيت المقدس وحكى الرازي عن بعضهم أنه عنى بالباب جهة من جهات القبلة وقال خصيف قال عكرمة قال: ابن عباس فدخلوا على شق وقال السدي عن أبي سعيد الأزدي عن أبي الكنود عن عبدالله بن مسعود قيل لهم ادخلوا الباب سجدا فدخلوا مقنعي رؤسهم أي رافعي رؤسهم خلاف ما أمروا وقوله تعالى \"وقولوا حطة\" قال الثوري عن الأعمش عن المنهال عن سعيد بن جبير عن ابن عباس \"وقولوا حطة\" قال مغفرة استغفروا وروى عن عطاء والحسن وقتادة والربيع بن أنس نحوه وقال الضحاك عن ابن عباس \"وقولوا حطة\" قال قولوا هذا الأمر حق كما قيل لكم وقال عكرمة قولوا \"لا إله إلا الله\" وقال الأوزاعي.\nكتب ابن عباس إلى رجل قد سماه فسأله عن قوله تعالى \"وقولوا حطة\" فكتب إليه أن أقروا بالذنب وقال: الحسن وقتادة أي احطط عنا خطايانا \"نغفر لكم خطاياكم وسنزيد المحسنين\" وقال هذا جواب الأمر أي إذا فعلتم ما أمرناكم غفرنا لكم الخطيئات وضعفنا لكم الحسنات وحاصل الأمر أنهم أمروا أن يخضعوا لله تعالى عند الفتح بالفعل والقول وأن يعترفوا بذنوبهم ويستغفروا منها والشكر على النعمة عندها والمبادرة إلى ذلك من المحبوب عند الله تعالى \"إذا جاء نصر الله والفتح ورأيت الناس يدخلون في دين الله أفواجا فسبح بحمد ربك واستغفره إنه كان توابا\" فسره بعض الصحابة بكثرة الذكر والاستغفار عند الفتح والنصر وفسره ابن عباس بأنه نعي إلى رسول الله صلى الله عليه وسلم أجله فيها وأقره على ذلك عمر رضي الله عنه ولا منافاة بين أن يكون قد أمر بذلك عند ذلك ونعي إليه روحه الكريمة أيضا ولهذا كان عليه الصلاة والسلام يظهر عليه الخضوع جدا عند النصر كما روي أنه كان يوم الفتح فتح مكة داخلا إليها من الثنية العليا وإنه لخاضع لربه حتى أن عثنونه ليمس مورك رحله شكرا لله على ذلك ثم لما دخل البلد اغتسل وصلى ثماني ركعات وذلك ضحى وقال: بعضهم هذه صلاة الضحى وقال: آخرون بل هي صلاة الفتح فاستحبوا للإمام وللأمير إذا فتح بلدا أن يصلي فيه ثماني ركعات عند أول دخوله كما فعل سعد بن أبي وقاص رضي الله عنه لما دخل إيوان كسرى صلى فيه ثماني ركعات والصحيح أنه يفصل بين كل ركعتي بتسليم وقيل يصليها كلها بتسليم واحد والله أعلم.\n                                    ",
        "qortoby": "وَإِذۡ قِيلَ لَهُمُ ٱسۡكُنُواْ هَٰذِهِ ٱلۡقَرۡيَةَ وَكُلُواْ مِنۡهَا حَيۡثُ شِئۡتُمۡ وَقُولُواْ حِطَّةٞ وَٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا نَّغۡفِرۡ لَكُمۡ خَطِيٓـَٰٔتِكُمۡۚ سَنَزِيدُ ٱلۡمُحۡسِنِينَ ١٦١\n                                    \n                                    \n                                    وقد مضى في \" البقرة \" مستوفى .\n                                    ",
        "saadi": "وَإِذۡ قِيلَ لَهُمُ ٱسۡكُنُواْ هَٰذِهِ ٱلۡقَرۡيَةَ وَكُلُواْ مِنۡهَا حَيۡثُ شِئۡتُمۡ وَقُولُواْ حِطَّةٞ وَٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا نَّغۡفِرۡ لَكُمۡ خَطِيٓـَٰٔتِكُمۡۚ سَنَزِيدُ ٱلۡمُحۡسِنِينَ ١٦١\n                                        \n                                        \n                                        \n                                        وَإِذْ قِيلَ لَهُمُ اسْكُنُوا هَذِهِ الْقَرْيَةَ أي: ادخلوها لتكون وطنا لكم ومسكنا، وهي (إيلياء) وَكُلُوا مِنْهَا حَيْثُ شِئْتُمْ أي: قرية كانت كثيرة الأشجار، غزيرة الثمار، رغيدة العيش، فلذلك أمرهم اللّه أن يأكلوا منها حيث شاءوا. وَقُولُوا حين تدخلون الباب: حِطَّةٌ أي: احطط عنا خطايانا، واعف عنا. وَادْخُلُوا الْبَابَ سُجَّدًا أي: خاضعين لربكم مستكينين لعزته، شاكرين لنعمته، فأمرهم بالخضوع، وسؤال المغفرة، ووعدهم على ذلك مغفرة ذنوبهم والثواب العاجل والآجل فقال: نَغْفِرْ لَكُمْ خَطِيئَاتِكُمْ سَنـزيدُ الْمُحْسِنِينَ من خير الدنيا والآخرة\n                                    "
      },
      "originalText": "وَإِذۡ قِيلَ لَهُمُ ٱسۡكُنُواْ هَٰذِهِ ٱلۡقَرۡيَةَ وَكُلُواْ مِنۡهَا حَيۡثُ شِئۡتُمۡ وَقُولُواْ حِطَّةٞ وَٱدۡخُلُواْ ٱلۡبَابَ سُجَّدٗا نَّغۡفِرۡ لَكُمۡ خَطِيٓـَٰٔتِكُمۡۚ سَنَزِيدُ ٱلۡمُحۡسِنِينَ ١٦١"
    },
    {
      "number": 1116,
      "text": "فَبَدَّلَ الَّذِينَ ظَلَمُوا مِنْهُمْ قَوْلًا غَيْرَ الَّذِي قِيلَ لَهُمْ فَأَرْسَلْنَا عَلَيْهِمْ رِجْزًا مِنَ السَّمَاءِ بِمَا كَانُوا يَظْلِمُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 162,
      "juz": 9,
      "manzil": 2,
      "page": 171,
      "ruku": 141,
      "hizbQuarter": 68,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَبَدَّلَ ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ قَوۡلًا غَيۡرَ ٱلَّذِي قِيلَ لَهُمۡ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَظۡلِمُونَ ٢٦١\n                                    \n                                    \n                                    وقوله تعالى فبدل الذين ظلموا قولا غير الذي قيل لهم قال: البخاري حدثني محمد حدثنا عبدالرحمن بن مهدي عن ابن المبارك عن معمر عن همام بن منبه عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال \"قيل لبني إسرائيل: ادخلوا الباب سجدا وقولوا حطة - فدخلوا يزحفون على استاهم فبدلوا وقالوا حبة في شعرة\" ورواه النسائي عن محمد بن إسماعيل بن إبراهيم عن عبدالرحمن به موقوفا وعن محمد بن عبيد بن محمد عن ابن المبارك ببعضه مسندا في قوله تعالى \"حطة\" قال فبدلوا وقالوا حبة وقال عبدالرزاق أنبأنا معمر عن همام بن منبه أنه سمع أبا هريرة يقول قال رسول الله صلى الله عليه وسلم قال الله لبني إسرائيل \"ادخلوا الباب سجدا وقولوا حطة نغفر لكم خطاياكم\" فبدلوا ودخلوا الباب يزحفون على استاهم فقالوا حبة في شعرة\" وهذا حديث صحيح رواه البخاري عن إسحاق بن نصر ومسلم عن محمد بن رافع والترمذي عن عبدالرحمن بن حميد كلهم عن عبدالرزاق به وقال الترمذي حسن صحيح وقال محمد بن إسحاق كان تبديلهم كما حدثني صالح بن كيسان عن صالح مولى التوأمة عن أبي هريرة وعمن لا أتهم عن ابن عباس أن رسول الله صلى الله عليه وسلم قال \"دخلوا الباب - الذي أمروا أن يدخلوا فيه سجدا - يزحفون على استاهم وهم يقولون حنطة في شعيرة\" وقال أبو داود حدثنا أحمد بن صالح وحدثنا سليمان بن داود حدثنا عبدالله بن وهب حدثنا هشام بن سعد عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم\" قال الله لبني إسرائيل \"ادخلوا الباب سجدا وقولوا حطة نغفر لكم خطاياكم\" ثم قال أبو داود حدثنا أحمد بن مسافر حدثنا ابن أبي فديك عن هشام بمثله هكذا رواه منفردا به في كتاب الحروف مختصرا وقال: ابن مردويه حدثنا عبدالله بن جعفر حدثنا إبراهيم بن مهدي حدثنا أحمد بن محمد بن المنذر القزاز حدثنا محمد بن إسماعيل ابن أبي فديك عن هشام بن سعد عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري قال سرنا مع رسول الله صلى الله عليه وسلم حتى إذا كان من آخر الليل أجزنا فى ثنية يقال لها ذات الحنظل فقال رسول الله صلى الله عليه وسلم \"ما مثل هذه الثنية الليلة إلا كمثل الباب الذي قال الله لبني إسرائيل \"ادخلوا الباب سجدا وقولوا حطة نغفر لكم خطاياكم\" وقال: سفيان الثوري عن أبي إسحاق عن البراء \"سيقول السفهاء من الناس\" قال: اليهود قيل لهم ادخلوا الباب سجدا قال: ركعا وقولوا حطة أي مغفرة فدخلوا على أستاههم وجعلوا يقولون حنطة حمراء فيها شعيرة فذلك قول الله تعالى \"فبدل الذين ظلموا قولا غير الذي قيل لهم\" وقال الثوري عن السدي عن أبي سعد الأزدي عن أبي الكنود عن ابن مسعود وقولوا حطة فقالوا حنطة حبة حمراء فيها شعيرة فأنزل الله \"فبدل الذين ظلموا قولا غير الذي قيل لهم\" وقال أسباط عن السدي عن مرة عن ابن مسعود أنه قال إنهم قالوا هطا سمعانا أزبة مزبا فهي بالعربية حبة حنطة حمراء مثقوبة فيها شعرة سوداء فذلك قوله تعالى\" فبدل الذين ظلموا قولا غير الذي قيل لهم\" وقال الثورى عن الأعمش عن المنهال عن سعيد عن ابن عباس في قوله تعالى\" ادخلوا الباب سجدا\" قال ركعا من باب صغير فدخلوا من قبل استاهم وقالوا حنطة فذلك قوله تعالى \"فبدل الذين ظلموا قولا غير الذي قيل لهم\" وهكذا روى عن عطاء ومجاهد وعكرمة والضحاك والحسن وقتادة والربيع بن أنس ويحيى بن رافع.\nوحاصل ما ذكره المفسرون وما دل عليه السياق أنهم بدلوا أمر الله لهم من الخضوع بالقول والفعل فأمروا أن يدخلوا سجدا فدخلوا يزحفون على استاهم من قبل استاهم رافعي رؤسهم وأمروا أن يقولوا حطة أي احطط عنا ذنوبنا وخطايانا فاستهزءوا فقالوا حنطة في شعيرة وهذا في غاية ما يكون من المخالفة والمعاندة ولهذا أنزل الله بهم بأسه وعذابه بفسقهم وهو خروجهم عن طاعته.\nولهذا قال \"فأنزلنا على الذين ظلموا رجزا من السماء بما كانوا يفسقون\" وقال الضحاك عن ابن عباس كل شيء في كتاب الله من الرجز يعني به العذاب وهكذا روى عن مجاهد وأبي مالك والسدي والحسن وقتادة أنه العذاب وقال أبو العالية الرجز الغضب وقال الشعبي الرجز إما الطاعون وإما البرد وقال سعيد بن جبير هو الطاعون وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا وكيع عن سفيان عن حبيب بن أبي ثابت عن إبراهيم بن سعد يعني ابن أبي وقاص عن سعد بن مالك وأسامة بن زيد وخزيمة بن ثابت رضي الله عنهم قالوا: قال رسول الله صلى الله عليه وسلم \"الطاعون رجز عذاب عذب به من كان قبلكم\" وهكذا رواه النسائي من حديث سفيان الثوري به وأصل الحديث في الصحيحين من حديث حبيب بن أبي ثابت \"إذا سمعتم الطاعون بأرض فلا تدخولها\" الحديث قال ابن جرير أخبرني يونس بن عبدالأعلى عن ابن وهب عن يونس عن الزهري قال: أخبرني عامر بن سعد بن أبي وقاص عن أسامة بن زيد عن رسول الله صلى الله عليه وسلم قال \"إن هذا الوجع والسقم رجز عذب به بعض الأمم قبلكم\" وهذا الحديث أصله مخرج في الصحيحين من حديث الزهري ومن حديث مالك عن محمد ابن المنكدر وسالم بن أبي النضر عن عامر بن سعد بنحوه.\n                                    ",
        "qortoby": "فَبَدَّلَ ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ قَوۡلًا غَيۡرَ ٱلَّذِي قِيلَ لَهُمۡ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَظۡلِمُونَ ٢٦١\n                                    \n                                    \n                                    وقد روى معمر عن همام بن منبه عن أبي هريرة عن النبي صلى الله عليه وسلم في قوله عز وجل : فبدل الذين ظلموا منهم قولا غير الذي قيل لهم قالوا : حبة في شعرة . وقيل لهم : ادخلوا الباب سجدا فدخلوا متوركين على أستاههم .\nبما كانوا يظلمون مرفوع ; لأنه فعل مستقبل وموضعه نصب . و ما بمعنى المصدر ، أي بظلمهم وقد مضى في \" البقرة \" ما في هذه الآية من المعاني والأحكام . والحمد لله .\n                                    ",
        "saadi": "فَبَدَّلَ ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ قَوۡلًا غَيۡرَ ٱلَّذِي قِيلَ لَهُمۡ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَظۡلِمُونَ ٢٦١\n                                        \n                                        \n                                        \n                                        فَبَدَّلَ الَّذِينَ ظَلَمُوا مِنْهُمْ أي: عصوا اللّه واستهانوا بأمره قَوْلا غَيْرَ الَّذِي قِيلَ لَهُمْ فقالوا بدل طلب المغفرة، وقولهم: حِطَّة (حبة في شعيرة)، وإذا بدلوا القول - مع يسره وسهولته - فتبديلهم للفعل من باب أولى، ولهذا دخلوا وهم يزحفون على أستاههم. فَأَرْسَلْنَا عَلَيْهِمُ حين خالفوا أمر اللّه وعصوه رِجْزًا مِنَ السَّمَاءِ أي: عذابا شديدا، إما الطاعون وإما غيره من العقوبات السماوية. وما ظلمهم اللّه بعقابه وإنما كان ذلك بِمَا كَانُوا يَظْلِمُونَ أي: يخرجون من طاعة الله إلى معصيته، من غير ضرورة ألجأتهم ولا داع دعاهم سوى الخبث والشر الذي كان كامنا في نفوسهم.\n                                    "
      },
      "originalText": "فَبَدَّلَ ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ قَوۡلًا غَيۡرَ ٱلَّذِي قِيلَ لَهُمۡ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَظۡلِمُونَ ٢٦١"
    },
    {
      "number": 1117,
      "text": "وَاسْأَلْهُمْ عَنِ الْقَرْيَةِ الَّتِي كَانَتْ حَاضِرَةَ الْبَحْرِ إِذْ يَعْدُونَ فِي السَّبْتِ إِذْ تَأْتِيهِمْ حِيتَانُهُمْ يَوْمَ سَبْتِهِمْ شُرَّعًا وَيَوْمَ لَا يَسْبِتُونَ ۙ لَا تَأْتِيهِمْ ۚ كَذَٰلِكَ نَبْلُوهُمْ بِمَا كَانُوا يَفْسُقُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 163,
      "juz": 9,
      "manzil": 2,
      "page": 171,
      "ruku": 142,
      "hizbQuarter": 68,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَسۡ‍َٔلۡهُمۡ عَنِ ٱلۡقَرۡيَةِ ٱلَّتِي كَانَتۡ حَاضِرَةَ ٱلۡبَحۡرِ إِذۡ يَعۡدُونَ فِي ٱلسَّبۡتِ إِذۡ تَأۡتِيهِمۡ حِيتَانُهُمۡ يَوۡمَ سَبۡتِهِمۡ شُرَّعٗا وَيَوۡمَ لَا يَسۡبِتُونَ لَا تَأۡتِيهِمۡۚ كَذَٰلِكَ نَبۡلُوهُم بِمَا كَانُواْ يَفۡسُقُونَ ٣٦١\n                                    \n                                    \n                                    هذا السياق هو بسط لقوله تعالى : ( ولقد علمتم الذين اعتدوا منكم في السبت فقلنا لهم كونوا قردة خاسئين ) [ البقرة : 65 ] يقول [ الله ] تعالى ، لنبيه صلوات الله وسلامه عليه : ( واسألهم ) أي : واسأل هؤلاء اليهود الذين بحضرتك عن قصة أصحابهم الذين خالفوا أمر الله ، ففاجأتهم نقمته على صنيعهم واعتدائهم واحتيالهم في المخالفة ، وحذر هؤلاء من كتمان صفتك التي يجدونها في كتبهم ; لئلا يحل بهم ما حل بإخوانهم وسلفهم . وهذه القرية هي \" أيلة \" وهي على شاطئ بحر القلزم .\nقال محمد بن إسحاق : عن داود بن الحصين ، عن عكرمة عن ابن عباس في قوله : ( واسألهم عن القرية التي كانت حاضرة البحر ) قال : هي قرية يقال لها \" أيلة \" بين مدين والطور . وكذا قال عكرمة ، ومجاهد ، وقتادة ، والسدي .\nوقال عبد الله بن كثير القارئ ، سمعنا أنها أيلة . وقيل : هي مدين ، وهو رواية عن ابن عباس وقال ابن زيد : هي قرية يقال لها . \" مقنا \" بين مدين وعيدوني .\nوقوله : ( إذ يعدون في السبت ) أي : يعتدون فيه ويخالفون أمر الله فيه لهم بالوصاة به إذ ذاك . ( إذ تأتيهم حيتانهم يوم سبتهم شرعا ) قال الضحاك ، عن ابن عباس : أي ظاهرة على الماء .\nوقال العوفي ، عن ابن عباس : ( شرعا ) من كل مكان .\nقال ابن جرير : وقوله : ( ويوم لا يسبتون لا تأتيهم كذلك نبلوهم ) أي : نختبرهم بإظهار السمك لهم على ظهر الماء في اليوم المحرم عليهم صيده ، وإخفائه عنهم في اليوم المحلل لهم صيده ( كذلك نبلوهم ) نختبرهم ( بما كانوا يفسقون ) يقول : بفسقهم عن طاعة الله وخروجهم عنها .\nوهؤلاء قوم احتالوا على انتهاك محارم الله ، بما تعاطوا من الأسباب الظاهرة التي معناها في الباطن تعاطي الحرام .\nوقد قال الفقيه الإمام أبو عبد الله بن بطة ، رحمه الله : حدثنا أحمد بن محمد بن مسلم ، حدثنا الحسن بن محمد بن الصباح الزعفراني ، حدثنا يزيد بن هارون ، حدثنا محمد بن عمرو ، عن أبي سلمة ، عن أبي هريرة ; أن رسول الله صلى الله عليه وسلم قال : \" لا ترتكبوا ما ارتكبت اليهود ، فتستحلوا محارم الله بأدنى الحيل \"\nوهذا إسناد جيد ، فإن أحمد بن محمد بن مسلم هذا ذكره الخطيب في تاريخه ووثقه ، وباقي رجاله مشهورون ثقات ، ويصحح الترمذي بمثل هذا الإسناد كثيرا .\n                                    ",
        "qortoby": "وَسۡ‍َٔلۡهُمۡ عَنِ ٱلۡقَرۡيَةِ ٱلَّتِي كَانَتۡ حَاضِرَةَ ٱلۡبَحۡرِ إِذۡ يَعۡدُونَ فِي ٱلسَّبۡتِ إِذۡ تَأۡتِيهِمۡ حِيتَانُهُمۡ يَوۡمَ سَبۡتِهِمۡ شُرَّعٗا وَيَوۡمَ لَا يَسۡبِتُونَ لَا تَأۡتِيهِمۡۚ كَذَٰلِكَ نَبۡلُوهُم بِمَا كَانُواْ يَفۡسُقُونَ ٣٦١\n                                    \n                                    \n                                    قوله تعالى واسألهم عن القرية التي كانت حاضرة البحر إذ يعدون في السبت إذ تأتيهم حيتانهم يوم سبتهم شرعا ويوم لا يسبتون لا تأتيهم كذلك نبلوهم بما كانوا يفسقون وإذ قالت أمة منهم لم تعظون قوما الله مهلكهم أو معذبهم عذابا شديدا قالوا معذرة إلى ربكم ولعلهم يتقون قوله تعالى واسألهم عن القرية أي عن أهل القرية ; فعبر عنهم بها لما كانت مستقرا لهم أو سبب اجتماعهم . نظيره واسأل القرية التي كنا فيها وقوله عليه السلام : اهتز العرش لموت سعد بن معاذ يعني أهل العرش من الملائكة ، فرحا واستبشارا بقدومه ، رضي الله عنه . أي واسأل اليهود الذين هم جيرانك عن أخبار أسلافهم وما مسخ الله منهم قردة وخنازير . وهذا سؤال تقرير وتوبيخ . وكان ذلك علامة لصدق النبي صلى الله عليه وسلم ; إذ أطلعه الله على تلك الأمور من غير تعلم . وكانوا يقولون : نحن أبناء الله وأحباؤه ، لأنا من سبط خليله إبراهيم ، ومن سبط إسرائيل وهم بكر الله ، ومن سبط موسى كليم الله ; ومن سبط ولده عزير ، فنحن من أولادهم . فقال الله عز وجل لنبيه : سلهم يا محمد عن القرية ، أما عذبتهم بذنوبهم ; وذلك بتغيير فرع من فروع الشريعة . واختلف في تعيين هذه القرية ; فقال ابن عباس وعكرمة والسدي : هي أيلة . وعن ابن عباس أيضا أنها مدين بين أيلة والطور . الزهري : طبرية . قتادة وزيد بن أسلم : هي ساحل من سواحل الشأم ، بين مدين وعينون ، يقال لها : مقناة . وكان اليهود يكتمون هذه القصة لما فيها من السبة عليهم .\nالتي كانت حاضرة البحر أي كانت بقرب البحر ; تقول : كنت بحضرة الدار أي بقربها .\nإذ يعدون في السبت أي يصيدون الحيتان ، وقد نهوا عنه ; يقال : سبت اليهود ; تركوا العمل في سبتهم . وسبت الرجل للمفعول سباتا أخذه ذلك ، مثل الخرس . وأسبت سكن فلم يتحرك . والقوم صاروا في السبت . واليهود دخلوا في السبت ، وهو اليوم المعروف . وهو من الراحة والقطع . ويجمع أسبت وسبوت وأسبات . وفي الخبر عن رسول الله صلى الله عليه وسلم من احتجم يوم السبت فأصابه برص فلا يلومن إلا نفسه . قال علماؤنا : وذلك لأن الدم يجمد يوم السبت ، فإذا مددته لتستخرجه لم يجر وعاد برصا . وقراءة الجماعة يعدون وقرأ أبو نهيك ( يعدون ) بضم الياء وكسر العين وشد الدال . الأولى من الاعتداء والثانية من الإعداد ; أي يهيئون الآلة لأخذها . وقرأ ابن السميقع ( في الأسبات ) على جمع السبت .\nإذ تأتيهم حيتانهم يوم سبتهم وقرئ ( أسباتهم ) .\nشرعا أي شوارع ظاهرة على الماء كثيرة . وقال الليث : حيتان شرع رافعة رءوسها . وقيل : معناه أن حيتان البحر كانت ترد يوم السبت عنقا من البحر فتزاحم أيلة . ألهمها الله تعالى أنها لا تصاد يوم السبت ; لنهيه تعالى اليهود عن صيدها . وقيل : إنها كانت تشرع على أبوابهم ; كالكباش البيض رافعة رءوسها . حكاه بعض المتأخرين ; فتعدو فأخذوها في السبت ; قاله الحسن . وقيل : يوم الأحد ، وهو الأصح على ما يأتي بيانه .\nويوم لا يسبتون أي لا يفعلون السبت ; يقال : سبت يسبت إذا عظم السبت . وقرأ الحسن ( يسبتون ) بضم الياء ، أي يدخلون في السبت ; كما يقال : أجمعنا وأظهرنا وأشهرنا ، أي دخلنا في الجمعة والظهر والشهر .\nلا تأتيهم أي حيتانهم .\nكذلك نبلوهم أي نشدد عليهم في العبادة ونختبرهم . والكاف في موضع نصب .\nبما كانوا يفسقون أي بفسقهم . وسئل الحسين بن الفضل : هل تجد في كتاب الله الحلال لا يأتيك إلا قوتا ، والحرام يأتيك جزفا جزفا ؟ قال : نعم ، في قصة داود وأيلة إذ تأتيهم حيتانهم يوم سبتهم شرعا ويوم لا يسبتون لا تأتيهم . وروي في قصص هذه الآية أنها كانت في زمن داود عليه السلام ، وأن إبليس أوحى إليهم فقال : إنما نهيتم عن أخذها يوم السبت ، فاتخذوا الحياض ; فكانوا يسوقون الحيتان إليها يوم الجمعة فتبقى فيها ، فلا يمكنها الخروج منها لقلة الماء ، فيأخذونها يوم الأحد . وروى أشهب عن مالك قال : زعم ابن رومان أنهم كانوا يأخذ الرجل خيطا ويضع فيه وهقة ، وألقاها في ذنب الحوت ، وفي الطرف الآخر من الخيط وتد وتركه كذلك إلى الأحد ، ثم تطرق الناس حين رأوا من صنع هذا لا يبتلى حتى كثر صيد الحوت ، ومشي به في الأسواق ، وأعلن الفسقة بصيده ; فقامت فرقة من بني إسرائيل ونهت ، وجاهرت بالنهي واعتزلت . وقيل : إن الناهين قالوا : لا نساكنكم ; فقسموا القرية بجدار . فأصبح الناهون ذات يوم في مجالسهم ولم يخرج من المعتدين أحد ، فقالوا : إن للناس لشأنا ; فعلوا على الجدار فنظروا فإذا هم قردة ; ففتحوا الباب ودخلوا عليهم ، فعرفت القردة أنسابها من الإنس ، ولم تعرف الإنس أنسابهم من القردة ; فجعلت القردة تأتي نسيبها من الإنس فتشم ثيابه وتبكي ; فيقول : ألم ننهكم ! فتقول برأسها نعم . قال قتادة : صار الشبان قردة والشيوخ خنازير ، فما نجا إلا الذين نهوا وهلك سائرهم . فعلى هذا القول إن بني إسرائيل لم تفترق إلا فرقتين .\n                                    ",
        "saadi": "وَسۡ‍َٔلۡهُمۡ عَنِ ٱلۡقَرۡيَةِ ٱلَّتِي كَانَتۡ حَاضِرَةَ ٱلۡبَحۡرِ إِذۡ يَعۡدُونَ فِي ٱلسَّبۡتِ إِذۡ تَأۡتِيهِمۡ حِيتَانُهُمۡ يَوۡمَ سَبۡتِهِمۡ شُرَّعٗا وَيَوۡمَ لَا يَسۡبِتُونَ لَا تَأۡتِيهِمۡۚ كَذَٰلِكَ نَبۡلُوهُم بِمَا كَانُواْ يَفۡسُقُونَ ٣٦١\n                                        \n                                        \n                                        \n                                        وَاسْأَلْهُمْ أي: اسأل بني إسرائيل عَنِ الْقَرْيَةِ الَّتِي كَانَتْ حَاضِرَةَ الْبَحْرِ أي: على ساحله في حال تعديهم وعقاب اللّه إياهم. إِذْ يَعْدُونَ فِي السَّبْتِ وكان اللّه تعالى قد أمرهم أن يعظموه ويحترموه ولا يصيدوا فيه صيدا، فابتلاهم اللّه وامتحنهم، فكانت الحيتان تأتيهم يَوْمَ سَبْتِهِمْ شُرَّعًا أي: كثيرة طافية على وجه البحر. وَيَوْمَ لا يَسْبِتُونَ أي: إذا ذهب يوم السبت لا تَأْتِيهِمْ أي: تذهب في البحر فلا يرون منها شيئا كَذَلِكَ نَبْلُوهُمْ بِمَا كَانُوا يَفْسُقُونَ ففسقهم هو الذي أوجب أن يبتليهم اللّه، وأن تكون لهم هذه المحنة، وإلا فلو لم يفسقوا، لعافاهم اللّه، ولما عرضهم للبلاء والشر، فتحيلوا على الصيد، فكانوا يحفرون لها حفرا، وينصبون لها الشباك، فإذا جاء يوم السبت ووقعت في تلك الحفر والشباك، لم يأخذوها في ذلك اليوم، فإذا جاء يوم الأحد أخذوها، وكثر فيهم ذلك، وانقسموا ثلاث فرق\n                                    "
      },
      "originalText": "وَسۡ‍َٔلۡهُمۡ عَنِ ٱلۡقَرۡيَةِ ٱلَّتِي كَانَتۡ حَاضِرَةَ ٱلۡبَحۡرِ إِذۡ يَعۡدُونَ فِي ٱلسَّبۡتِ إِذۡ تَأۡتِيهِمۡ حِيتَانُهُمۡ يَوۡمَ سَبۡتِهِمۡ شُرَّعٗا وَيَوۡمَ لَا يَسۡبِتُونَ لَا تَأۡتِيهِمۡۚ كَذَٰلِكَ نَبۡلُوهُم بِمَا كَانُواْ يَفۡسُقُونَ ٣٦١"
    }
  ]
}