{
  "number": 174,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 1133,
      "text": "وَلَقَدْ ذَرَأْنَا لِجَهَنَّمَ كَثِيرًا مِنَ الْجِنِّ وَالْإِنْسِ ۖ لَهُمْ قُلُوبٌ لَا يَفْقَهُونَ بِهَا وَلَهُمْ أَعْيُنٌ لَا يُبْصِرُونَ بِهَا وَلَهُمْ آذَانٌ لَا يَسْمَعُونَ بِهَا ۚ أُولَٰئِكَ كَالْأَنْعَامِ بَلْ هُمْ أَضَلُّ ۚ أُولَٰئِكَ هُمُ الْغَافِلُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 179,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 143,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ ذَرَأۡنَا لِجَهَنَّمَ كَثِيرٗا مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ لَهُمۡ قُلُوبٞ لَّا يَفۡقَهُونَ بِهَا وَلَهُمۡ أَعۡيُنٞ لَّا يُبۡصِرُونَ بِهَا وَلَهُمۡ ءَاذَانٞ لَّا يَسۡمَعُونَ بِهَآۚ أُوْلَٰٓئِكَ كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّۚ أُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ ٩٧١\n                                    \n                                    \n                                    يقول تعالى : ( ولقد ذرأنا ) أي : خلقنا وجعلنا ( لجهنم كثيرا من الجن والإنس ) أي : هيأناهم لها ، وبعمل أهلها يعملون ، فإنه تعالى لما أراد أن يخلق الخلائق ، علم ما هم عاملون قبل كونهم ، فكتب ذلك عنده في كتاب قبل أن يخلق السماوات والأرض بخمسين ألف سنة ، كما ورد في صحيح مسلم ، عن عبد الله بن عمرو أن رسول الله صلى الله عليه وسلم قال : \" إن الله قدر مقادير الخلق قبل أن يخلق السماوات والأرض بخمسين ألف سنة ، وكان عرشه على الماء \"\nوفي صحيح مسلم أيضا ، من حديث عائشة بنت طلحة ، عن خالتها عائشة أم المؤمنين ، رضي الله عنها ، أنها قالت : دعي رسول الله صلى الله عليه وسلم إلى جنازة صبي من الأنصار ، فقلت : يا رسول الله طوبى له ، عصفور من عصافير الجنة ، لم يعمل السوء ولم يدركه . فقال [ رسول الله صلى الله عليه وسلم ] أو غير ذلك يا عائشة ؟ إن الله خلق الجنة ، وخلق لها أهلا وهم في أصلاب آبائهم ، وخلق النار ، وخلق لها أهلا وهم في أصلاب آبائهم \"\nوفي الصحيحين من حديث ابن مسعود [ رضي الله عنه ] ثم يبعث إليه الملك ، فيؤمر بأربع كلمات ، فيكتب : رزقه ، وأجله ، وعمله ، وشقي أم سعيد \" .\nوتقدم أن الله [ تعالى ] لما استخرج ذرية آدم من صلبه وجعلهم فريقين : أصحاب اليمين وأصحاب الشمال ، قال : \" هؤلاء للجنة ولا أبالي ، وهؤلاء للنار ولا أبالي \" .\nوالأحاديث في هذا كثيرة ، ومسألة القدر كبيرة ليس هذا موضع بسطها .\nوقوله تعالى : ( لهم قلوب لا يفقهون بها ولهم أعين لا يبصرون بها ولهم آذان لا يسمعون بها ) يعني : ليس ينتفعون بشيء من هذه الجوارح التي جعلها الله [ سببا للهداية ] كما قال تعالى : ( وجعلنا لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء إذ كانوا يجحدون بآيات الله [ وحاق بهم ما كانوا به يستهزئون ] ) [ الأحقاف : 26 ] وقال تعالى : ( صم بكم عمي فهم لا يرجعون ) [ البقرة : 18 ] هذا في حق المنافقين ، وقال في حق الكافرين : ( صم بكم عمي فهم لا يعقلون ) [ البقرة : 171 ] ولم يكونوا صما بكما عميا إلا عن الهدى ، كما قال تعالى : ( ولو علم الله فيهم خيرا لأسمعهم ولو أسمعهم لتولوا وهم معرضون ) [ الأنفال : 23 ] ، وقال : ( فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور ) [ الحج : 46 ] ، وقال ( ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين وإنهم ليصدونهم عن السبيل ويحسبون أنهم مهتدون ) [ الزخرف : 36 ، 37 ] .\nوقوله تعالى : ( أولئك كالأنعام ) أي : هؤلاء الذين لا يسمعون الحق ولا يعونه ولا يبصرون الهدى ، كالأنعام السارحة التي لا تنتفع بهذه الحواس منها إلا في الذي يعيشها من ظاهر الحياة الدنيا كما قال تعالى : ( ومثل الذين كفروا كمثل الذي ينعق بما لا يسمع إلا دعاء ونداء [ صم بكم عمي ] ) [ البقرة : 171 ] أي : ومثلهم - في حال دعائهم إلى الإيمان - كمثل الأنعام إذا دعاها راعيها لا تسمع إلا صوته ، ولا تفقه ما يقول ; ولهذا قال في هؤلاء : ( بل هم أضل ) أي : من الدواب ; لأن الدواب قد تستجيب مع ذلك لراعيها إذا أبس بها ، وإن لم تفقه كلامه ، بخلاف هؤلاء ; ولأن الدواب تفقه ما خلقت له إما بطبعها وإما بتسخيرها ، بخلاف الكافر فإنه إنما خلق ليعبد الله ويوحده ، فكفر بالله وأشرك به ; ولهذا من أطاع الله من البشر كان أشرف من مثله من الملائكة في معاده ، ومن كفر به من البشر ، كانت الدواب أتم منه ; ولهذا قال تعالى : ( أولئك كالأنعام بل هم أضل أولئك هم الغافلون )\n                                    ",
        "qortoby": "وَلَقَدۡ ذَرَأۡنَا لِجَهَنَّمَ كَثِيرٗا مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ لَهُمۡ قُلُوبٞ لَّا يَفۡقَهُونَ بِهَا وَلَهُمۡ أَعۡيُنٞ لَّا يُبۡصِرُونَ بِهَا وَلَهُمۡ ءَاذَانٞ لَّا يَسۡمَعُونَ بِهَآۚ أُوْلَٰٓئِكَ كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّۚ أُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ ٩٧١\n                                    \n                                    \n                                    قوله تعالى ولقد ذرأنا لجهنم كثيرا من الجن والإنس لهم قلوب لا يفقهون بها ولهم أعين لا يبصرون بها ولهم آذان لا يسمعون بها أولئك كالأنعام بل هم أضل أولئك هم الغافلون قوله تعالى ولقد ذرأنا لجهنم كثيرا من الجن والإنس أخبر تعالى أنه خلق للنار أهلا بعدله ثم وصفهم فقال لهم قلوب لا يفقهون بها بمنزلة من لا يفقه ; لأنهم لا ينتفعون بها ، ولا يعقلون ثوابا ولا يخافون عقابا .\nوأعين لا يبصرون بها الهدى . وآذان لا يسمعون بها المواعظ . وليس الغرض نفي الإدراكات عن حواسهم جملة كما بيناه في البقرة .\nأولئك كالأنعام بل هم أضل لأنهم لا يهتدون إلى ثواب ، فهم كالأنعام ; أي همتهم الأكل والشرب ، وهم أضل ; لأن الأنعام تبصر منافعها ومضارها وتتبع مالكها ، وهم بخلاف ذلك . وقال عطاء : الأنعام تعرف الله ، والكافر لا يعرفه . وقيل : الأنعام مطيعة لله تعالى ، والكافر غير مطيع .\nأولئك هم الغافلون أي تركوا التدبر وأعرضوا عن الجنة والنار .\n                                    ",
        "saadi": "وَلَقَدۡ ذَرَأۡنَا لِجَهَنَّمَ كَثِيرٗا مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ لَهُمۡ قُلُوبٞ لَّا يَفۡقَهُونَ بِهَا وَلَهُمۡ أَعۡيُنٞ لَّا يُبۡصِرُونَ بِهَا وَلَهُمۡ ءَاذَانٞ لَّا يَسۡمَعُونَ بِهَآۚ أُوْلَٰٓئِكَ كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّۚ أُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ ٩٧١\n                                        \n                                        \n                                        \n                                        يقول تعالى مبينا كثرة الغاوين الضالين، المتبعين إبليس اللعين: وَلَقَدْ ذَرَأْنَا أي: أنشأنا وبثثنا لِجَهَنَّمَ كَثِيرًا مِنَ الْجِنِّ وَالإنْسِ صارت البهائم أحسن حالة منهم. لَهُمْ قُلُوبٌ لا يَفْقَهُونَ بِهَا أي: لا يصل إليها فقه ولا علم، إلا مجرد قيام الحجة. وَلَهُمْ أَعْيُنٌ لا يُبْصِرُونَ بِهَا ما ينفعهم، بل فقدوا منفعتها وفائدتها. وَلَهُمْ آذَانٌ لا يَسْمَعُونَ بِهَا سماعا يصل معناه إلى قلوبهم. أُولَئِكَ الذين بهذه الأوصاف القبيحة كَالأنْعَامِ أي: البهائم، التي فقدت العقول، وهؤلاء آثروا ما يفنى على ما يبقى، فسلبوا خاصية العقل. بَلْ هُمْ أَضَلُّ من البهائم، فإن الأنعام مستعملة فيما خلقت له، ولها أذهان، تدرك بها، مضرتها من منفعتها، فلذلك كانت أحسن حالا منهم. أُولَئِكَ هُمُ الْغَافِلُونَ الذين غفلوا عن أنفع الأشياء، غفلوا عن الإيمان باللّه وطاعته وذكره. خلقت لهم الأفئدة والأسماع والأبصار، لتكون عونا لهم على القيام بأوامر اللّه وحقوقه، فاستعانوا بها على ضد هذا المقصود. فهؤلاء حقيقون بأن يكونوا ممن ذرأ اللّه لجهنم وخلقهم لها، فخلقهم للنار، وبأعمال أهلها يعملون. وأما من استعمل هذه الجوارح في عبادة اللّه، وانصبغ قلبه بالإيمان باللّه ومحبته، ولم يغفل عن اللّه، فهؤلاء، أهل الجنة، وبأعمال أهل الجنة يعملون.\n                                    "
      },
      "originalText": "وَلَقَدۡ ذَرَأۡنَا لِجَهَنَّمَ كَثِيرٗا مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ لَهُمۡ قُلُوبٞ لَّا يَفۡقَهُونَ بِهَا وَلَهُمۡ أَعۡيُنٞ لَّا يُبۡصِرُونَ بِهَا وَلَهُمۡ ءَاذَانٞ لَّا يَسۡمَعُونَ بِهَآۚ أُوْلَٰٓئِكَ كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّۚ أُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ ٩٧١"
    },
    {
      "number": 1134,
      "text": "وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَىٰ فَادْعُوهُ بِهَا ۖ وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمَائِهِ ۚ سَيُجْزَوْنَ مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 180,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 143,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِلَّهِ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰ فَٱدۡعُوهُ بِهَاۖ وَذَرُواْ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ أَسۡمَٰٓئِهِۦۚ سَيُجۡزَوۡنَ مَا كَانُواْ يَعۡمَلُونَ ٠٨١\n                                    \n                                    \n                                    عن أبي هريرة ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" إن لله تسعا وتسعين اسما مائة إلا واحدا ، من أحصاها دخل الجنة ، وهو وتر يحب الوتر \" .\nأخرجاه في الصحيحين من حديث سفيان بن عيينة ، عن أبي الزناد ، عن الأعرج ، عنه رواه البخاري ، عن أبي اليمان ، عن شعيب بن أبي حمزة ، عن أبي الزناد به وأخرجه الترمذي ، عن الجوزجاني ، عن صفوان بن صالح ، عن الوليد بن مسلم ، عن شعيب فذكر بسنده مثله ، وزاد بعد قوله : \" يحب الوتر \" : هو الله الذي لا إله إلا هو الرحمن الرحيم ، الملك ، القدوس ، السلام ، المؤمن ، المهيمن ، العزيز ، الجبار ، المتكبر ، الخالق ، البارئ ، المصور ، الغفار ، القهار ، الوهاب ، الرزاق ، الفتاح ، العليم ، القابض ، الباسط ، الخافض ، الرافع ، المعز ، المذل ، السميع ، البصير ، الحكم ، العدل ، اللطيف ، الخبير ، الحليم ، العظيم ، الغفور ، الشكور ، العلي ، الكبير ، الحفيظ ، المقيت ، الحسيب ، الجليل ، الكريم ، الرقيب ، المجيب ، الواسع ، الحكيم ، الودود ، المجيد ، الباعث ، الشهيد ، الحق ، الوكيل ، القوي ، المتين ، الولي ، الحميد ، المحصي ، المبدئ ، المعيد ، المحيي ، المميت ، الحي ، القيوم ، الواجد ، الماجد ، الواحد ، الأحد ، الفرد ، الصمد ، القادر ، المقتدر ، المقدم ، المؤخر ، الأول ، الآخر ، الظاهر ، الباطن ، الوالي ، المتعالي ، البر ، التواب ، المنتقم ، العفو ، الرءوف ، مالك الملك ، ذو الجلال والإكرام ، المقسط ، الجامع ، الغني ، المغني ، المانع ، الضار ، النافع ، النور ، الهادي ، البديع ، الباقي ، الوارث ، الرشيد ، الصبور\nثم قال الترمذي : هذا حديث غريب وقد روي من غير وجه عن أبي هريرة [ رضي الله عنه ] ولا نعلم في كثير من الروايات ذكر الأسماء إلا في هذا الحديث .\nورواه ابن حبان في صحيحه ، من طريق صفوان ، به وقد رواه ابن ماجه في سننه ، من طريق آخر عن موسى بن عقبة ، عن الأعرج ، عن أبي هريرة مرفوعا فسرد الأسماء كنحو ما تقدم بزيادة ونقصان .\nوالذي عول عليه جماعة من الحفاظ أن سرد الأسماء في هذا الحديث مدرج فيه ، وإنما ذلك كما رواه الوليد بن مسلم وعبد الملك بن محمد الصنعاني ، عن زهير بن محمد : أنه بلغه عن غير واحد من أهل العلم أنهم قالوا ذلك ، أي : أنهم جمعوها من القرآن كما ورد عن جعفر بن محمد وسفيان بن عيينة وأبي زيد اللغوي ، والله أعلم .\nثم ليعلم أن الأسماء الحسنى ليست منحصرة في التسعة والتسعين بدليل ما رواه الإمام أحمد في مسنده ، عن يزيد بن هارون ، عن فضيل بن مرزوق ، عن أبي سلمة الجهني ، عن القاسم بن عبد الرحمن ، عن أبيه ، عن عبد الله بن مسعود ، رضي الله عنه ، عن رسول الله صلى الله عليه وسلم أنه قال : \" ما أصاب أحدا قط هم ولا حزن فقال : اللهم إني عبدك ، ابن عبدك ، ابن أمتك ، ناصيتي بيدك ، ماض في حكمك ، عدل في قضاؤك ، أسألك بكل اسم هو لك سميت به نفسك ، أو أعلمته أحدا من خلقك ، أو أنزلته في كتابك ، أو استأثرت به في علم الغيب عندك ، أن تجعل القرآن ربيع قلبي ، ونور صدري ، وجلاء حزني ، وذهاب همي ، إلا أذهب الله همه وحزنه وأبدله مكانه فرحا \" . فقيل : يا رسول الله ، أفلا نتعلمها ؟ فقال : \" بلى ، ينبغي لكل من سمعها أن يتعلمها \" .\nوقد أخرجه الإمام أبو حاتم بن حبان البستي في صحيحه بمثله\nوذكر الفقيه الإمام أبو بكر بن العربي أحد أئمة المالكية في كتابه : \" الأحوذي في شرح الترمذي \" ; أن بعضهم جمع من الكتاب والسنة من أسماء الله ألف اسم ، فالله أعلم .\nوقال العوفي عن ابن عباس في قوله تعالى : ( وذروا الذين يلحدون في أسمائه ) قال : إلحاد الملحدين : أن دعوا \" اللات في أسماء الله .\nوقال ابن جريج ، عن مجاهد : ( وذروا الذين يلحدون في أسمائه ) قال : اشتقوا \" اللات \" من الله ، واشتقوا \" العزى \" من العزيز .\nوقال قتادة : ( يلحدون ) يشركون . وقال علي بن أبي طلحة ، عن ابن عباس : الإلحاد : التكذيب . وأصل الإلحاد في كلام العرب : العدل عن القصد ، والميل والجور والانحراف ، ومنه اللحد في القبر ، لانحرافه إلى جهة القبلة عن سمت الحفر .\n                                    ",
        "qortoby": "وَلِلَّهِ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰ فَٱدۡعُوهُ بِهَاۖ وَذَرُواْ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ أَسۡمَٰٓئِهِۦۚ سَيُجۡزَوۡنَ مَا كَانُواْ يَعۡمَلُونَ ٠٨١\n                                    \n                                    \n                                    قوله تعالى ولله الأسماء الحسنى فادعوه بها وذروا الذين يلحدون في أسمائه سيجزون ما كانوا يعملون\nقوله تعالى ولله الأسماء الحسنى فادعوه بها فيه ست مسائل :\nالأولى : أمر بإخلاص العبادة لله ، ومجانبة المشركين والملحدين . قال مقاتل وغيره من المفسرين : نزلت الآية في رجل من المسلمين ، كان يقول في صلاته : يا رحمن يا رحيم . فقال رجل من مشركي مكة : أليس يزعم محمد وأصحابه أنهم يعبدون ربا واحدا ، فما بال هذا يدعو ربين اثنين ؟ فأنزل الله سبحانه وتعالى : ولله الأسماء الحسنى فادعوه بها .\nالثانية : جاء في كتاب الترمذي وسنن ابن ماجه وغيرهما حديث عن أبي هريرة عن النبي صلى الله عليه وسلم نص فيه إن لله تسعة وتسعين اسما الحديث ; في أحدهما ما ليس في الآخر . وقد بينا ذلك في \" الكتاب الأسنى في شرح أسماء الله الحسنى \" . قال ابن عطية - وذكر حديث الترمذي - وذلك الحديث ليس بالمتواتر ، وإن كان قد قال فيه أبو عيسى : هذا حديث غريب لا نعرفه إلا من حديث صفوان بن صالح ، وهو ثقة عند أهل الحديث . وإنما المتواتر منه قوله صلى الله عليه وسلم : إن لله تسعة وتسعين اسما مائة إلا واحدا من أحصاها دخل الجنة . ومعنى \" أحصاها \" عدها وحفظها . وقيل غير هذا مما بيناه في كتابنا . وذكرنا هناك تصحيح حديث الترمذي ، وذكرنا من الأسماء ما اجتمع عليه وما اختلف فيه مما وقفنا عليه في كتب أئمتنا ما ينيف على مائتي اسم . وذكرنا قبل تعيينها في مقدمة الكتاب اثنين وثلاثين فصلا فيما يتعلق بأحكامها ، فمن أراده وقف عليه هناك وفي غيره من الكتب الموضوعة في هذا الباب . والله الموفق للصواب ، لا رب سواه .\nالثالثة : واختلف العلماء من هذا الباب في الاسم والمسمى ، وقد ذكرنا ما للعلماء من ذلك في \" الكتاب الأسنى \" . قال ابن الحصار : وفي هذه الآية وقوع الاسم على المسمى ووقوعه على التسمية . فقوله : ولله وقع على المسمى ، وقوله : الأسماء وهو جمع اسم واقع على التسميات . يدل على صحة ما قلناه قوله : فادعوه بها ، والهاء في قوله : فادعوه تعود على المسمى سبحانه وتعالى ، فهو المدعو . والهاء في قوله بها تعود على الأسماء ، وهي التسميات التي يدعى بها لا بغيرها . هذا الذي يقتضيه لسان العرب . ومثل ذلك قول رسول الله صلى الله عليه وسلم : لي خمسة أسماء أنا محمد وأحمد الحديث . وقد تقدم في \" البقرة \" شيء من هذا والذي يذهب إليه أهل الحق أن الاسم هو المسمى ، أو صفة له تتعلق به ، وأنه غير التسمية . قال ابن العربي عند كلامه على قوله تعالى : ولله الأسماء الحسنى : فيه ثلاثة أقوال . قال بعض علمائنا : في ذلك دليل على أن الاسم المسمى ; لأنه لو كان غيره لوجب أن تكون الأسماء لغير الله تعالى . الثاني : قال آخرون : المراد به التسميات ; لأنه سبحانه واحد والأسماء جمع . قلت : ذكر ابن عطية في تفسيره أن الأسماء في الآية بمعنى التسميات إجماعا من المتأولين لا يجوز غيره . وقال القاضي أبو بكر في كتاب التمهيد : وتأويل قول النبي صلى الله عليه وسلم : لله تسعة وتسعون اسما من أحصاها دخل الجنة أي أن له تسعة وتسعين تسمية بلا خلاف ، وهي عبارات عن كون الله تعالى على أوصاف شتى ، منها ما يستحقه لنفسه ومنها ما يستحقه لصفة تتعلق به ، وأسماؤه العائدة إلى نفسه هي هو ، وما تعلق بصفة له فهي أسماء له . ومنها صفات لذاته . ومنها صفات أفعال . وهذا هو تأويل قوله تعالى : ولله الأسماء الحسنى فادعوه بها أي التسميات الحسنى . الثالث : قال آخرون منهم : ولله الصفات .\nالرابعة : سمى الله سبحانه أسماءه بالحسنى ; لأنها حسنة في الأسماع والقلوب ; فإنها تدل على توحيده وكرمه وجوده ورحمته وإفضاله . والحسنى مصدر وصف به . ويجوز أن يقدر الحسنى فعلى ، مؤنث الأحسن ; كالكبرى تأنيث الأكبر ، والجمع الكبر والحسن . وعلى الأول أفرد كما أفرد وصف ما لا يعقل ; كما قال تعالى : مآرب أخرى و يا جبال أوبي معه\nالخامسة : قوله تعالى : فادعوه بها أي اطلبوا منه بأسمائه ; فيطلب بكل اسم ما يليق به ، تقول : يا رحيم ارحمني ، يا حكيم احكم لي ، يا رازق ارزقني ، يا هاد اهدني ، يا فتاح افتح لي ، يا تواب تب علي ; هكذا . فإن دعوت باسم عام قلت : يا مالك ارحمني ، يا عزيز احكم لي ، يا لطيف ارزقني . وإن دعوت بالأعم الأعظم فقلت : يا ألله ; فهو متضمن لكل اسم . ولا تقول : يا رزاق اهدني ; إلا أن تريد يا رزاق ارزقني الخير . قال ابن العربي : وهكذا ، رتب دعاءك تكن من المخلصين . وقد تقدم في \" البقرة \" شرائط الدعاء ، وفي هذه السورة أيضا . والحمد لله .\nالسادسة : أدخل القاضي أبو بكر بن العربي عدة من الأسماء في أسمائه سبحانه ، مثل : متم نوره ، وخير الوارثين ، وخير الماكرين ، ورابع ثلاثة ، وسادس خمسة ، والطيب ، والمعلم ; وأمثال ذلك . قال ابن الحصار : واقتدى في ذلك بابن برجان ، إذ ذكر في الأسماء \" النظيف \" وغير ذلك مما لم يرد في كتاب ولا سنة .\nقلت : أما ما ذكر من قوله : \" مما لم يرد في كتاب ولا سنة \" فقد جاء في صحيح مسلم \" الطيب \" . وخرج الترمذي \" النظيف \" . وخرج عن ابن عباس أن النبي صلى الله عليه وسلم كان يقول في دعائه رب أعني ولا تعن علي وانصرني ولا تنصر علي وامكر لي ولا تمكر علي الحديث . وقال فيه : حديث حسن صحيح . فعلى هذا جائز أن يقال : يا خير الماكرين امكر لي ولا تمكر علي . والله أعلم .\nوقد ذكرنا \" الطيب والنظيف \" في كتابنا وغيره مما جاء ذكره في الأخبار ، وعن السلف الأخيار ، وما يجوز أن يسمى به ويدعى ، وما يجوز أن يسمى به ولا يدعى ، وما لا يجوز أن يسمى به ولا يدعى . حسب ما ذكره الشيخ أبو الحسن الأشعري . وهناك يتبين لك ذلك إن شاء الله تعالى .\nقوله تعالى وذروا الذين يلحدون في أسمائه سيجزون ما كانوا يعملون فيه مسألتان :\nالأولى قوله تعالى : يلحدون الإلحاد : الميل وترك القصد ; يقال : ألحد الرجل في الدين . وألحد إذا مال . ومنه اللحد في القبر ; لأنه في ناحيته . وقرئ ( يلحدون ) لغتان والإلحاد يكون بثلاثة أوجه أحدها : بالتغيير فيها كما فعله المشركون ، وذلك أنهم عدلوا بها عما هي عليه فسموا بها أوثانهم ; فاشتقوا اللات من الله ، والعزى من العزيز ، ومناة من المنان قاله ابن عباس وقتادة . الثاني : بالزيادة فيها . الثالث : بالنقصان منها ; كما يفعله الجهال الذين يخترعون أدعية يسمون فيها الله تعالى بغير أسمائه ، ويذكرون بغير ما يذكر من أفعاله ; إلى غير ذلك مما لا يليق به . قال ابن العربي : فحذار منها ، ولا يدعون أحدكم إلا بما في كتاب الله والكتب الخمسة ; وهي البخاري ومسلم والترمذي وأبو داود والنسائي . فهذه الكتب التي يدور الإسلام عليها ، وقد دخل فيها ما في الموطأ الذي هو أصل التصانيف ، وذروا ما سواها ، ولا يقولن أحدكم أختار دعاء كذا وكذا ; فإن الله قد اختار له وأرسل بذلك إلى الخلق رسوله صلى الله عليه وسلم .\nالثانية : معنى الزيادة في الأسماء التشبيه ، والنقصان التعطيل . فإن المشبهة وصفوه بما لم يأذن فيه ، والمعطلة سلبوه ما اتصف به ، ولذلك قال أهل الحق : إن ديننا طريق بين طريقين ، لا بتشبيه ولا بتعطيل . وسئل الشيخ أبو الحسن البوشنجي عن التوحيد فقال : إثبات ذات غير مشبهة بالذوات ، ولا معطلة من الصفات . وقد قيل في قوله تعالى : وذروا الذين يلحدون معناه اتركوهم ولا تحاجوهم ولا تعرضوا لهم . فالآية على هذا منسوخة بالقتال ; قاله ابن زيد . وقيل : معناه الوعيد ; كقوله تعالى : ذرني ومن خلقت وحيدا وقوله : ذرهم يأكلوا ويتمتعوا . وهو الظاهر من الآية ; لقوله تعالى : سيجزون ما كانوا يعملون . والله أعلم .\n                                    ",
        "saadi": "وَلِلَّهِ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰ فَٱدۡعُوهُ بِهَاۖ وَذَرُواْ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ أَسۡمَٰٓئِهِۦۚ سَيُجۡزَوۡنَ مَا كَانُواْ يَعۡمَلُونَ ٠٨١\n                                        \n                                        \n                                        \n                                        هذا بيان لعظيم جلاله وسعة أوصافه، بأن له الأسماء الحسنى، أي: له كل اسم حسن، وضابطه: أنه كل اسم دال على صفة كمال عظيمة، وبذلك كانت حسنى، فإنها لو دلت على غير صفة، بل كانت علما محضا لم تكن حسنى، وكذلك لو دلت على صفة ليست بصفة كمال، بل إما صفة نقص أو صفة منقسمة إلى المدح والقدح، لم تكن حسنى، فكل اسم من أسمائه دال على جميع الصفة التي اشتق منها، مستغرق لجميع معناها. وذلك نحو العليم الدال على أن له علما محيطا عاما لجميع الأشياء، فلا يخرج عن علمه مثقال ذرة في الأرض ولا في السماء. و كالرحيم الدال على أن له رحمة عظيمة، واسعة لكل شيء. و كالقدير الدال على أن له قدرة عامة، لا يعجزها شيء، ونحو ذلك. ومن تمام كونها \"حسنى\" أنه لا يدعى إلا بها، ولذلك قال: فَادْعُوهُ بِهَا وهذا شامل لدعاء العبادة، ودعاء المسألة، فيدعى في كل مطلوب بما يناسب ذلك المطلوب، فيقول الداعي مثلا اللّهم اغفر لي وارحمني، إنك أنت الغفور الرحيم، وتب عَلَيَّ يا تواب، وارزقني يا رزاق، والطف بي يا لطيف ونحو ذلك. وقوله: وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمَائِهِ سَيُجْزَوْنَ مَا كَانُوا يَعْمَلُونَ أي: عقوبة وعذابا على إلحادهم في أسمائه، وحقيقة الإلحاد الميل بها عما جعلت له، إما بأن يسمى بها من لا يستحقها، كتسمية المشركين بها لآلهتهم، وإما بنفي معانيها وتحريفها، وأن يجعل لها معنى ما أراده اللّه ولا رسوله، وإما أن يشبه بها غيرها، فالواجب أن يحذر الإلحاد فيها، ويحذر الملحدون فيها، وقد ثبت في الصحيح عن النبي صلى الله عليه صلى الله عليه وسلم ( أن للّه تسعة وتسعين اسما، من أحصاها دخل الجنة )\n                                    "
      },
      "originalText": "وَلِلَّهِ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰ فَٱدۡعُوهُ بِهَاۖ وَذَرُواْ ٱلَّذِينَ يُلۡحِدُونَ فِيٓ أَسۡمَٰٓئِهِۦۚ سَيُجۡزَوۡنَ مَا كَانُواْ يَعۡمَلُونَ ٠٨١"
    },
    {
      "number": 1135,
      "text": "وَمِمَّنْ خَلَقْنَا أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَبِهِ يَعْدِلُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 181,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 143,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِمَّنۡ خَلَقۡنَآ أُمَّةٞ يَهۡدُونَ بِٱلۡحَقِّ وَبِهِۦ يَعۡدِلُونَ ١٨١\n                                    \n                                    \n                                    يقول تعالى : ( وممن خلقنا ) أي : ومن الأمم ) أمة ) قائمة بالحق ، قولا وعملا ( يهدون بالحق ) يقولونه ويدعون إليه ، ( وبه يعدلون ) يعملون ويقضون .\nوقد جاء في الآثار : أن المراد بهذه الأمة المذكورة في الآية ، هي هذه الأمة المحمدية .\nقال سعيد ، عن قتادة في تفسير هذه الآية : بلغنا أن نبي الله صلى الله عليه وسلم كان يقول إذا قرأ هذه الآية : \" هذه لكم ، وقد أعطي القوم بين أيديكم مثلها : ( ومن قوم موسى أمة يهدون بالحق وبه يعدلون ) [ الأعراف : 159 ]\nوقال أبو جعفر الرازي ، عن الربيع بن أنس في قوله تعالى : ( وممن خلقنا أمة يهدون بالحق وبه يعدلون ) قال : قال رسول الله صلى الله عليه وسلم : \" إن من أمتي قوما على الحق ، حتى ينزل عيسى ابن مريم متى ما نزل \" .\nوفي الصحيحين ، عن معاوية بن أبي سفيان قال : قال رسول الله صلى الله عليه وسلم : \" لا تزال طائفة من أمتي ظاهرين على الحق ، لا يضرهم من خذلهم ، ولا من خالفهم ، حتى تقوم الساعة - وفي رواية - : حتى يأتي أمر الله وهم على ذلك - وفي رواية - : وهم بالشام \"\n                                    ",
        "qortoby": "وَمِمَّنۡ خَلَقۡنَآ أُمَّةٞ يَهۡدُونَ بِٱلۡحَقِّ وَبِهِۦ يَعۡدِلُونَ ١٨١\n                                    \n                                    \n                                    قوله تعالى وممن خلقنا أمة يهدون بالحق وبه يعدلون في الخبر أن النبي صلى الله عليه وسلم قال : هم هذه الأمة وروي أنه قال : هذه لكم وقد أعطى الله قوم موسى مثلها وقرأ هذه الآية وقال : إن من أمتي قوما على الحق حتى ينزل عيسىابن مريم . فدلت الآية على أن الله عز وجل لا يخلي الدنيا في وقت من الأوقات من داع يدعو إلى الحق .\n                                    ",
        "saadi": "وَمِمَّنۡ خَلَقۡنَآ أُمَّةٞ يَهۡدُونَ بِٱلۡحَقِّ وَبِهِۦ يَعۡدِلُونَ ١٨١\n                                        \n                                        \n                                        \n                                        أي: ومن جملة من خلقنا أمة فاضلة كاملة في نفسها، مكملة لغيرها، يهدون أنفسهم وغيرهم بالحق، فيعلمون الحق ويعملون به، ويعلِّمونه، ويدعون إليه وإلى العمل به. وَبِهِ يَعْدِلُونَ بين الناس في أحكامهم إذا حكموا في الأموال والدماء والحقوق والمقالات، وغير ذلك، وهؤلاء هم أئمة الهدى، ومصابيح الدجى، وهم الذين أنعم اللّه عليهم بالإيمان والعمل الصالح، والتواصي بالحق والتواصي بالصبر، وهم الصديقون الذين مرتبتهم تلي مرتبة الرسالة، وهم في أنفسهم مراتب متفاوتة كل بحسب حاله وعلو منـزلته، فسبحان من يختص برحمته من يشاء، واللّه ذو الفضل العظيم.\n                                    "
      },
      "originalText": "وَمِمَّنۡ خَلَقۡنَآ أُمَّةٞ يَهۡدُونَ بِٱلۡحَقِّ وَبِهِۦ يَعۡدِلُونَ ١٨١"
    },
    {
      "number": 1136,
      "text": "وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 182,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 144,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ كَذَّبُواْ بِ‍َٔايَٰتِنَا سَنَسۡتَدۡرِجُهُم مِّنۡ حَيۡثُ لَا يَعۡلَمُونَ ٢٨١\n                                    \n                                    \n                                    يقول تعالى : ( والذين كذبوا بآياتنا سنستدرجهم من حيث لا يعلمون ) ومعناه : أنه يفتح لهم أبواب الرزق ووجوه المعاش في الدنيا ، حتى يغتروا بما هم فيه ويعتقدوا أنهم على شيء ، كما قال تعالى : ( فلما نسوا ما ذكروا به فتحنا عليهم أبواب كل شيء حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون فقطع دابر القوم الذين ظلموا والحمد لله رب العالمين ) [ الأنعام : 44 ، 45 ]\n                                    ",
        "qortoby": "وَٱلَّذِينَ كَذَّبُواْ بِ‍َٔايَٰتِنَا سَنَسۡتَدۡرِجُهُم مِّنۡ حَيۡثُ لَا يَعۡلَمُونَ ٢٨١\n                                    \n                                    \n                                    قوله تعالى والذين كذبوا بآياتنا سنستدرجهم من حيث لا يعلمون أخبر تعالى عمن كذب بآياته أنه سيستدرجهم . قال ابن عباس : هم أهل مكة . والاستدراج هو الأخذ بالتدريج ، منزلة بعد منزلة . والدرج : لف الشيء ; يقال : أدرجته ودرجته . ومنه أدرج الميت في أكفانه . وقيل : هو من الدرجة ; فالاستدراج أن يحط درجة بعد درجة إلى المقصود . قال الضحاك : كلما جددوا لنا معصية جددنا لهم نعمة . وقيل لذي النون : ونزغ الشيطان : وساوسه ؟ قال : بالألطاف والكرامات ; لذلك قال سبحانه وتعالى : سنستدرجهم من حيث لا يعلمون نسبغ عليهم النعم وننسيهم الشكر ; وأنشدوا :\nأحسنت ظنك بالأيام إذ حسنت ولم تخف سوء ما يأتي به القدر\nوسالمتك الليالي فاغتررت بها وعند صفو الليالي يحدث الكدر\n                                    ",
        "saadi": "وَٱلَّذِينَ كَذَّبُواْ بِ‍َٔايَٰتِنَا سَنَسۡتَدۡرِجُهُم مِّنۡ حَيۡثُ لَا يَعۡلَمُونَ ٢٨١\n                                        \n                                        \n                                        \n                                        أي: والذين كذبوا بآيات اللّه الدالة على صحة ما جاء به محمد صلى الله عليه وسلم، من الهدى فردوها ولم يقبلوها. سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لا يَعْلَمُونَ بأن يدر لهم الأرزاق.\n                                    "
      },
      "originalText": "وَٱلَّذِينَ كَذَّبُواْ بِ‍َٔايَٰتِنَا سَنَسۡتَدۡرِجُهُم مِّنۡ حَيۡثُ لَا يَعۡلَمُونَ ٢٨١"
    },
    {
      "number": 1137,
      "text": "وَأُمْلِي لَهُمْ ۚ إِنَّ كَيْدِي مَتِينٌ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 183,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 144,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأُمۡلِي لَهُمۡۚ إِنَّ كَيۡدِي مَتِينٌ ٣٨١\n                                    \n                                    \n                                    ولهذا قال تعالى : ( وأملي لهم ) أي : وسأملي لهم ، أطول لهم ما هم فيه ) إن كيدي متين ) أي : قوي شديد .\n                                    ",
        "qortoby": "وَأُمۡلِي لَهُمۡۚ إِنَّ كَيۡدِي مَتِينٌ ٣٨١\n                                    \n                                    \n                                    قوله تعالى وأملي لهم إن كيدي متين قوله تعالى وأملي لهم أي أطيل لهم المدة وأمهلهم وأؤخر عقوبتهم . إن كيدي أي مكري . متين أي شديد قوي . وأصله من المتن ، وهو اللحم الغليظ الذي عن جانب الصلب . قيل : نزلت في المستهزئين من قريش ، قتلهم الله في ليلة واحدة بعد أن أمهلهم مدة . نظيره حتى إذا فرحوا بما أوتوا أخذناهم بغتة .\n                                    ",
        "saadi": "وَأُمۡلِي لَهُمۡۚ إِنَّ كَيۡدِي مَتِينٌ ٣٨١\n                                        \n                                        \n                                        \n                                        وَأُمْلِي لَهُمْ أي: أُمْهِلُهُم حتى يظنوا أنهم لا يؤخذون ولا يعاقبون، فيزدادون كفرا وطغيانا، وشرا إلى شرهم، وبذلك تزيد عقوبتهم، ويتضاعف عذابهم، فيضرون أنفسهم من حيث لا يشعرون، ولهذا قال: إِنَّ كَيْدِي مَتِينٌ أي: قوي بليغ.\n                                    "
      },
      "originalText": "وَأُمۡلِي لَهُمۡۚ إِنَّ كَيۡدِي مَتِينٌ ٣٨١"
    },
    {
      "number": 1138,
      "text": "أَوَلَمْ يَتَفَكَّرُوا ۗ مَا بِصَاحِبِهِمْ مِنْ جِنَّةٍ ۚ إِنْ هُوَ إِلَّا نَذِيرٌ مُبِينٌ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 184,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 144,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوَلَمۡ يَتَفَكَّرُواْۗ مَا بِصَاحِبِهِم مِّن جِنَّةٍۚ إِنۡ هُوَ إِلَّا نَذِيرٞ مُّبِينٌ ٤٨١\n                                    \n                                    \n                                    يقول تعالى : ( أولم يتفكروا ) هؤلاء المكذبون بآياتنا ( ما بصاحبهم ) يعني محمدا - صلوات الله وسلامه عليه ( من جنة ) أي : ليس به جنون ، بل هو رسول الله حقا دعا إلى حق ، ( إن هو إلا نذير مبين ) أي : ظاهر لمن كان له قلب ولب يعقل به ويعي به ، كما قال تعالى : ( وما صاحبكم بمجنون ) [ التكوير : 22 ] ، وقال تعالى : ( قل إنما أعظكم بواحدة أن تقوموا لله مثنى وفرادى ثم تتفكروا ما بصاحبكم من جنة إن هو إلا نذير لكم بين يدي عذاب شديد ) [ سبأ : 46 ] يقول إنما أطلب منكم أن تقوموا لله قياما خالصا لله ، ليس فيه تعصب ولا عناد ، ( مثنى وفرادى ) أي : مجتمعين ومتفرقين ، ( ثم تتفكروا ) في هذا الذي جاءكم بالرسالة من الله : أبه جنون أم لا ؟ فإنكم إذا فعلتم ذلك ، بان لكم وظهر أنه رسول [ الله ] حقا وصدقا .\nوقال قتادة بن دعامة : ذكر لنا أن نبي الله صلى الله عليه وسلم كان على الصفا ، فدعا قريشا فجعل يفخذهم فخذا فخذا : \" يا بني فلان ، يا بني فلان \" ، فحذرهم بأس الله ووقائع الله ، فقال قائلهم : إن صاحبكم هذا لمجنون . بات يصوت إلى الصباح - أو : حتى أصبح ، فأنزل الله تعالى : ( أولم يتفكروا ما بصاحبهم من جنة إن هو إلا نذير مبين )\n                                    ",
        "qortoby": "أَوَلَمۡ يَتَفَكَّرُواْۗ مَا بِصَاحِبِهِم مِّن جِنَّةٍۚ إِنۡ هُوَ إِلَّا نَذِيرٞ مُّبِينٌ ٤٨١\n                                    \n                                    \n                                    قوله تعالى أولم يتفكروا ما بصاحبهم من جنة إن هو إلا نذير مبين أي فيما جاءهم به محمد صلى الله عليه وسلم . والوقف على يتفكروا حسن . ثم قال : ما بصاحبهم من جنة رد لقولهم : ياأيها الذي نزل عليه الذكر إنك لمجنون . وقيل : نزلت بسبب أن رسول الله صلى الله عليه وسلم قام ليلة على الصفا يدعو قريشا ، فخذا فخذا ; فيقول : \" يا بني فلان \" . يحذرهم بأس الله وعقابه . فقال قائلهم : إن صاحبهم هذا لمجنون ، بات يصوت حتى الصباح .\n                                    ",
        "saadi": "أَوَلَمۡ يَتَفَكَّرُواْۗ مَا بِصَاحِبِهِم مِّن جِنَّةٍۚ إِنۡ هُوَ إِلَّا نَذِيرٞ مُّبِينٌ ٤٨١\n                                        \n                                        \n                                        \n                                        أَوَلَمْ يَتَفَكَّرُوا مَا بِصَاحِبِهِمْ محمد صلى الله عليه وسلم مِنْ جِنَّةٍ أي: أَوَ لَمْ يُعْمِلُوا أفكارهم، وينظروا: هل في صاحبهم الذي يعرفونه ولا يخفى عليهم من حاله شيء، هل هو مجنون؟ فلينظروا في أخلاقه وهديه، ودله وصفاته، وينظروا في ما دعا إليه، فلا يجدون فيه من الصفات إلا أكملها، ولا من الأخلاق إلا أتمها، ولا من العقل والرأي إلا ما فاق به العالمين، ولا يدعو إلا لكل خير، ولا ينهى إلا عن كل شر. أفبهذا يا أولي الألباب من جنة؟ أم هو الإمام العظيم والناصح المبين، والماجد الكريم، والرءوف الرحيم؟ ولهذا قال: إِنْ هُوَ إِلا نَذِيرٌ مُبِينٌ أي: يدعو الخلق إلى ما ينجيهم من العذاب، ويحصل لهم الثواب.\n                                    "
      },
      "originalText": "أَوَلَمۡ يَتَفَكَّرُواْۗ مَا بِصَاحِبِهِم مِّن جِنَّةٍۚ إِنۡ هُوَ إِلَّا نَذِيرٞ مُّبِينٌ ٤٨١"
    },
    {
      "number": 1139,
      "text": "أَوَلَمْ يَنْظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ وَمَا خَلَقَ اللَّهُ مِنْ شَيْءٍ وَأَنْ عَسَىٰ أَنْ يَكُونَ قَدِ اقْتَرَبَ أَجَلُهُمْ ۖ فَبِأَيِّ حَدِيثٍ بَعْدَهُ يُؤْمِنُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 185,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 144,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَمۡ يَنظُرُواْ فِي مَلَكُوتِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ وَأَنۡ عَسَىٰٓ أَن يَكُونَ قَدِ ٱقۡتَرَبَ أَجَلُهُمۡۖ فَبِأَيِّ حَدِيثِۢ بَعۡدَهُۥ يُؤۡمِنُونَ ٥٨١\n                                    \n                                    \n                                    قول تعالى : ( أولم ينظروا ) - هؤلاء المكذبون بآياتنا - في ملك الله وسلطانه في السماوات والأرض ، وفيما خلق [ الله ] من شيء فيهما ، فيتدبروا ذلك ويعتبروا به ، ويعلموا أن ذلك لمن لا نظير له ولا شبيه ، ومن فعل من لا ينبغي أن تكون العبادة والدين الخالص إلا له فيؤمنوا به ويصدقوا رسوله ، وينيبوا إلى طاعته ، ويخلعوا الأنداد والأوثان ، ويحذروا أن تكون آجالهم قد اقتربت ، فيهلكوا على كفرهم ، ويصيروا إلى عذاب الله وأليم عقابه .\nوقوله : ( فبأي حديث بعده يؤمنون ) ؟ يقول : فبأي تخويف وتحذير وترهيب - بعد تحذير محمد وترهيبه ، الذي أتاهم به من عند الله في آي كتابه - يصدقون ، إن لم يصدقوا بهذا الحديث الذي جاءهم به محمد من عند الله ، عز وجل ؟ ! .\nوقد روى الإمام أحمد عن حسن بن موسى وعفان بن مسلم وعبد الصمد بن عبد الوارث ، عن حماد بن سلمة ، عن علي بن زيد بن جدعان ، عن أبي الصلت ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" رأيت ليلة أسري بي ، لما انتهينا إلى السماء السابعة ، فنظرت فوقي ، فإذا أنا برعد وبرق وصواعق \" ، قال : \" وأتيت على قوم بطونهم كالبيوت فيها الحيات ترى من خارج بطونهم ، قلت : من هؤلاء يا جبريل ؟ قال : هؤلاء أكلة الربا . فلما نزلت إلى السماء الدنيا فنظرت إلى أسفل مني ، فإذا أنا برهج ودخان وأصوات فقلت : ما هذا يا جبريل ؟ قال : هذه الشياطين يحرفون على أعين بني آدم أن لا يتفكروا في ملكوت السماوات والأرض ، ولولا ذلك لرأوا العجائب \" .\nعلي بن زيد بن جدعان له منكرات .\nثم قال تعالى :\n                                    ",
        "qortoby": "وَلَمۡ يَنظُرُواْ فِي مَلَكُوتِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ وَأَنۡ عَسَىٰٓ أَن يَكُونَ قَدِ ٱقۡتَرَبَ أَجَلُهُمۡۖ فَبِأَيِّ حَدِيثِۢ بَعۡدَهُۥ يُؤۡمِنُونَ ٥٨١\n                                    \n                                    \n                                    قوله تعالى أولم ينظروا في ملكوت السماوات والأرض فيه أربع مسائل :\nالأولى : قوله تعالى : أولم ينظروا عجب من إعراضهم عن النظر في آياته ; ليعرفوا كمال قدرته ، حسب ما بيناه في سورة \" البقرة \" . والملكوت من أبنية المبالغة ومعناه الملك العظيم .\nالثانية : استدل بهذه الآية - وما كان مثلها من قوله تعالى : قل انظروا ماذا في السماوات والأرض وقوله تعالى : أفلم ينظروا إلى السماء فوقهم كيف بنيناها وقوله : أفلا ينظرون إلى الإبل كيف خلقت الآية . وقوله : وفي أنفسكم أفلا تبصرون - من قال بوجوب النظر في آياته والاعتبار بمخلوقاته . قالوا : وقد ذم الله تعالى من لم ينظر ، وسلبهم الانتفاع بحواسهم فقال : لهم قلوب لا يفقهون بها الآية .\nوقد اختلف العلماء في أول الواجبات ، هل هو النظر والاستدلال ، أو الإيمان الذي هو التصديق الحاصل في القلب الذي ليس من شرط صحته المعرفة . فذهب القاضي وغيره إلى أن أول الواجبات النظر والاستدلال ; لأن الله تبارك وتعالى لا يعلم ضرورة ، وإنما يعلم بالنظر والاستدلال بالأدلة التي نصبها لمعرفته . وإلى هذا ذهب البخاري رحمه الله حيث بوب في كتابه باب العلم قبل القول والعمل لقول الله عز وجل : فاعلم أنه لا إله إلا الله . قال القاضي : من لم يكن عالما بالله فهو جاهل ، والجاهل به كافر . قال ابن رشد في مقدماته : وليس هذا بالبين ; لأن الإيمان يصح باليقين الذي قد يحصل لمن هداه الله بالتقليد ، وبأول وهلة من الاعتبار بما أرشد الله إلى الاعتبار به في غير ما آية . قال : وقد استدل الباجي على من قال إن النظر والاستدلال أول الواجبات بإجماع المسلمين في جميع الأعصار على تسمية العامة والمقلد مؤمنين . قال : فلو كان ما ذهبوا إليه صحيحا لما صح أن يسمى مؤمنا إلا من عنده علم بالنظر والاستدلال . قال : وأيضا فلو كان الإيمان لا يصح إلا بعد النظر والاستدلال لجاز للكفار إذا غلب عليهم المسلمون أن يقولوا لهم : لا يحل لكم قتلنا ; لأن من دينكم أن الإيمان لا يصح إلا بعد النظر والاستدلال فأخرونا حتى ننظر ونستدل . قال : وهذا يؤدي إلى تركهم على كفرهم ، وألا يقتلوا حتى ينظروا ويستدلوا .\nقلت : هذا هو الصحيح في الباب ، قال رسول الله صلى الله عليه وسلم : أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله ويؤمنوا بي وبما جئت به فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله . وترجم ابن المنذر في كتاب الأشراف \" ذكر صفة كمال الإيمان \" أجمع كل من يحفظ عنه من أهل العلم على أن الكافر إذا قال : أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ، وأن كل ما جاء به محمد حق ، وأبرأ من كل دين يخالف دين الإسلام - وهو بالغ صحيح العقل - أنه مسلم . وإن رجع بعد ذلك وأظهر الكفر كان مرتدا يجب عليه ما يجب على المرتد . وقال أبو حفص الزنجاني وكان شيخنا القاضي أبو جعفر أحمد بن محمد السمناني يقول : أول الواجبات الإيمان بالله وبرسوله وبجميع ما جاء به ، ثم النظر والاستدلال المؤديان إلى معرفة الله تعالى ; فيتقدم وجوب الإيمان بالله تعالى عنده على المعرفة بالله . قال : وهذا أقرب إلى الصواب وأرفق بالخلق ; لأن أكثرهم لا يعرفون حقيقة المعرفة والنظر والاستدلال . فلو قلنا : إن أول الواجبات المعرفة بالله لأدى إلى تكفير الجم الغفير والعدد الكثير ، وألا يدخل الجنة إلا آحاد الناس ، وذلك بعيد ; لأن الرسول صلى الله عليه وسلم قطع بأن أكثر أهل الجنة أمته ، وأن أمم الأنبياء كلهم صف واحد وأمته ثمانون صفا . وهذا بين لا إشكال فيه . والحمد لله .\nالثالثة : ذهب بعض المتأخرين والمتقدمين من المتكلمين إلى أن من لم يعرف الله تعالى بالطرق التي طرقوها والأبحاث التي حرروها لم يصح إيمانه وهو كافر ; فيلزم على هذا تكفير أكثر المسلمين ، وأول من يبدأ بتكفيره آباؤه وأسلافه وجيرانه . وقد أورد على بعضهم هذا فقال : لا تشنع علي بكثرة أهل النار . أو كما قال . قلت : وهذا القول لا يصدر إلا من جاهل بكتاب الله وسنة نبيه ; لأنه ضيق رحمة الله الواسعة على شرذمة يسيرة من المتكلمين ، واقتحموا في تكفير عامة المسلمين . أين هذا من قول الأعرابي الذي كشف عن فرجه ليبول ، وانتهره أصحاب النبي صلى الله عليه وسلم : اللهم ارحمني ومحمدا ولا ترحم معنا أحدا . فقال النبي صلى الله عليه وسلم : لقد حجرت واسعا . خرجه البخاري والترمذي وغيرهما من الأئمة . أترى هذا الأعرابي عرف الله بالدليل والبرهان والحجة والبيان ؟ وأن رحمته وسعت كل شيء ، وكم من مثله محكوم له بالإيمان . بل اكتفى صلى الله عليه وسلم من كثير ممن أسلم بالنطق بالشهادتين ، وحتى إنه اكتفى بالإشارة في ذلك . ألا تراه لما قال للسوداء : أين الله ؟ قالت : في السماء . قال : من أنا ؟ قالت : أنت رسول الله . قال : أعتقها فإنها مؤمنة . ولم يكن هناك نظر ولا استدلال ، بل حكم بإيمانهم من أول وهلة ، وإن كان هناك عن النظر والمعرفة غفلة . والله أعلم .\nالرابعة : ولا يكون النظر أيضا والاعتبار في الوجوه الحسان من المرد والنسوان . قال أبو الفرج الجوزي : قال أبو الطيب طاهر بن عبد الله الطبري بلغني عن هذه الطائفة التي تسمع السماع أنها تضيف إليه النظر إلى وجه الأمرد ، وربما زينته بالحلي والمصبغات من الثياب ، وتزعم أنها تقصد به الازدياد في الإيمان بالنظر والاعتبار والاستدلال بالصنعة على الصانع . وهذه النهاية في متابعة الهوى ومخادعة العقل ومخالفة العلم . قال أبو الفرج : وقال الإمام أبو الوفاء بن عقيل لم يحل الله النظر إلا على صورة لا ميل للنفس إليها ، ولا حظ للهوى فيها ; بل عبرة لا يمازجها شهوة ، ولا يقارنها لذة . ولذلك ما بعث الله سبحانه امرأة بالرسالة ، ولا جعلها قاضيا ولا إماما ولا مؤذنا ; كل ذلك لأنها محل شهوة وفتنة . فمن قال : أنا أجد من الصور المستحسنة عبرا كذبناه . وكل من ميز نفسه بطبيعة تخرجه عن طباعنا كذبناه ، وإنما هذه خدع الشيطان للمدعين . وقال بعض الحكماء : كل شيء في العالم الكبير له نظير في العالم الصغير ، ولذلك قال تعالى : لقد خلقنا الإنسان في أحسن تقويم وقال : وفي أنفسكم أفلا تبصرون . وقد بينا وجه التمثيل في أول الأنعام . فعلى العاقل أن ينظر إلى نفسه ويتفكر في خلقه من حين كونه ماء دافقا إلى كونه خلقا سويا ، يعان بالأغذية ويربى بالرفق ، ويحفظ باللين حتى يكتسب القوى ، ويبلغ الأشد . وإذا هو قد قال : أنا ، وأنا ، ونسي حين أتى عليه حين من الدهر لم يكن شيئا مذكورا ، وسيعود مقبورا ; فيا ويحه إن كان محسورا . قال الله تعالى : ولقد خلقنا الإنسان من سلالة من طين ثم جعلناه نطفة في قرار مكين إلى قوله : تبعثون فينظر أنه عبد مربوب مكلف ، مخوف بالعذاب إن قصر ، مرتجيا بالثواب إن ائتمر ، فيقبل على عبادة مولاه فإنه وإن كان لا يراه يراه ولا يخشى الناس والله أحق أن يخشاه ، ولا يتكبر على أحد من عباد الله ; فإنه مؤلف من أقذار ، مشحون من أوضار ، صائر إلى جنة إن أطاع أو إلى نار . وقال ابن العربي : وكان شيوخنا يستحبون أن ينظر المرء في الأبيات الحكمية التي جمعت هذه الأوصاف العملية :\nكيف يزهو من رجيعه أبد الدهر ضجيعه\nفهو منه وإليه وأخوه ورضيعه\nوهو يدعوه إلى الحش بصغر فيطيعه\nقوله تعالى وما خلق الله من شيء معطوف على ما قبله ; أي وفيما خلق الله من الأشياء .\nوأن عسى أن يكون قد اقترب أجلهم أي وفي آجالهم التي عسى أن تكون قد قربت ; فهو في موضع خفض معطوف على ما قبله . وقال ابن عباس : أراد باقتراب الأجل يوم بدر ويوم أحد .\nفبأي حديث بعده يؤمنون أي بأي قرآن غير ما جاء به محمد صلى الله عليه وسلم يصدقون . وقيل : الهاء للأجل ، على معنى بأي حديث بعد الأجل يؤمنون حين لا ينفع الإيمان ; لأن الآخرة ليست بدار تكليف .\n                                    ",
        "saadi": "وَلَمۡ يَنظُرُواْ فِي مَلَكُوتِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ وَأَنۡ عَسَىٰٓ أَن يَكُونَ قَدِ ٱقۡتَرَبَ أَجَلُهُمۡۖ فَبِأَيِّ حَدِيثِۢ بَعۡدَهُۥ يُؤۡمِنُونَ ٥٨١\n                                        \n                                        \n                                        \n                                        أَوَلَمْ يَنْظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالأرْضِ فإنهم إذا نظروا إليها، وجدوها أدلة دالة على توحيد ربها، وعلى ما له من صفات الكمال. و كذلك لينظروا إلى جميع مَا خَلَقَ اللَّهُ مِنْ شَيْءٍ فإن جميع أجزاء العالم، يدل أعظم دلالة على اللّه وقدرته وحكمته وسعة رحمته، وإحسانه، ونفوذ مشيئته، وغير ذلك من صفاته العظيمة، الدالة على تفرده بالخلق والتدبير، الموجبة لأن يكون هو المعبود المحمود، المسبح الموحد المحبوب. وقوله: وَأَنْ عَسَى أَنْ يَكُونَ قَدِ اقْتَرَبَ أَجَلُهُمْ أي: لينظروا في خصوص حالهم، وينظروا لأنفسهم قبل أن يقترب أجلهم، ويفجأهم الموت وهم في غفلة معرضون، فلا يتمكنون حينئذ، من استدراك الفارط. فَبِأَيِّ حَدِيثٍ بَعْدَهُ يُؤْمِنُونَ أي: إذا لم يؤمنوا بهذا الكتاب الجليل، فبأي حديث يؤمنون به؟\" أبكتب الكذب والضلال؟ أم بحديث كل مفتر دجال؟ ولكن الضال لا حيلة فيه، ولا سبيل إلى هدايته.\n                                    "
      },
      "originalText": "وَلَمۡ يَنظُرُواْ فِي مَلَكُوتِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ وَأَنۡ عَسَىٰٓ أَن يَكُونَ قَدِ ٱقۡتَرَبَ أَجَلُهُمۡۖ فَبِأَيِّ حَدِيثِۢ بَعۡدَهُۥ يُؤۡمِنُونَ ٥٨١"
    },
    {
      "number": 1140,
      "text": "مَنْ يُضْلِلِ اللَّهُ فَلَا هَادِيَ لَهُ ۚ وَيَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 186,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 144,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَن يُضۡلِلِ ٱللَّهُ فَلَا هَادِيَ لَهُۥۚ وَيَذَرُهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ ٦٨١\n                                    \n                                    \n                                    يقول تعالى : من كتب عليه الضلالة فإنه لا يهديه أحد ، ولو نظر لنفسه فيما نظر ، فإنه لا يجزى عنه شيئا ، ( ومن يرد الله فتنته فلن تملك له من الله شيئا ) [ المائدة : 41 ] قال تعالى : ( قل انظروا ماذا في السماوات والأرض وما تغني الآيات والنذر عن قوم لا يؤمنون ) [ يونس : 101 ]\n                                    ",
        "qortoby": "مَن يُضۡلِلِ ٱللَّهُ فَلَا هَادِيَ لَهُۥۚ وَيَذَرُهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ ٦٨١\n                                    \n                                    \n                                    من يضلل الله فلا هادي له ويذرهم في طغيانهم يعمهون\nبين أن إعراضهم لأن الله أضلهم . وهذا رد على القدرية .\nويذرهم في طغيانهم بالرفع على الاستئناف . وقرئ بالجزم حملا على موضع الفاء وما بعدها .\nيعمهون أي يتحيرون . وقيل : يترددون . وقد مضى في أول \" البقرة \" مستوفى .\n                                    ",
        "saadi": "مَن يُضۡلِلِ ٱللَّهُ فَلَا هَادِيَ لَهُۥۚ وَيَذَرُهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ ٦٨١\n                                        \n                                        \n                                        \n                                        مَنْ يُضْلِلِ اللَّهُ فَلا هَادِيَ لَهُ وَيَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ أي: متحيرين يترددون، لا يخرجون منه ولا يهتدون إلى حق.\n                                    "
      },
      "originalText": "مَن يُضۡلِلِ ٱللَّهُ فَلَا هَادِيَ لَهُۥۚ وَيَذَرُهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ ٦٨١"
    },
    {
      "number": 1141,
      "text": "يَسْأَلُونَكَ عَنِ السَّاعَةِ أَيَّانَ مُرْسَاهَا ۖ قُلْ إِنَّمَا عِلْمُهَا عِنْدَ رَبِّي ۖ لَا يُجَلِّيهَا لِوَقْتِهَا إِلَّا هُوَ ۚ ثَقُلَتْ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ لَا تَأْتِيكُمْ إِلَّا بَغْتَةً ۗ يَسْأَلُونَكَ كَأَنَّكَ حَفِيٌّ عَنْهَا ۖ قُلْ إِنَّمَا عِلْمُهَا عِنْدَ اللَّهِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ",
      "surah": {
        "number": 7,
        "name": "سورة الأعراف",
        "englishName": "Al-A'raaf",
        "englishNameTranslation": "The Heights",
        "revelationType": "Meccan",
        "numberOfAyahs": 206
      },
      "numberInSurah": 187,
      "juz": 9,
      "manzil": 2,
      "page": 174,
      "ruku": 144,
      "hizbQuarter": 69,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَسۡ‍َٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرۡسَىٰهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ رَبِّيۖ لَا يُجَلِّيهَا لِوَقۡتِهَآ إِلَّا هُوَۚ ثَقُلَتۡ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا تَأۡتِيكُمۡ إِلَّا بَغۡتَةٗۗ يَسۡ‍َٔلُونَكَ كَأَنَّكَ حَفِيٌّ عَنۡهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ ٱللَّهِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ ٧٨١\n                                    \n                                    \n                                    يقول تعالى : ( يسألونك عن الساعة ) كما قال تعالى : ( يسألك الناس عن الساعة ) [ الأحزاب : 63 ] قيل : نزلت في قريش . وقيل : في نفر من اليهود . والأول أشبه ; لأن الآية مكية ، وكانوا يسألون عن وقت الساعة ، استبعادا لوقوعها ، وتكذيبا بوجودها ; كما قال تعالى : ( ويقولون متى هذا الوعد إن كنتم صادقين ) [ الأنبياء : 38 ] ، وقال تعالى : ( يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق ألا إن الذين يمارون في الساعة لفي ضلال بعيد ) [ الشورى : 18 ]\nوقوله : ( أيان مرساها ) قال علي بن أبي طلحة ، عن ابن عباس : \" منتهاها \" أي : متى محطها ؟ وأيان آخر مدة الدنيا الذي هو أول وقت الساعة ؟\n( قل إنما علمها عند ربي لا يجليها لوقتها إلا هو ) أمر تعالى نبيه صلى الله عليه وسلم إذا سئل عن وقت الساعة ، أن يرد علمها إلى الله تعالى ; فإنه هو الذي يجليها لوقتها ، أي : يعلم جلية أمرها ، ومتى يكون على التحديد ، [ أي ] لا يعلم ذلك [ أحد ] إلا هو تعالى ; ولهذا قال : ( ثقلت في السماوات والأرض )\nقال عبد الرزاق ، عن معمر ، عن قتادة في قوله : ( ثقلت في السماوات والأرض ) قال : ثقل علمها على أهل السماوات والأرض أنهم لا يعلمون . قال معمر : قال الحسن : إذا جاءت ، ثقلت على أهل السماوات والأرض ، يقول : كبرت عليهم .\nوقال الضحاك ، عن ابن عباس في قوله : ( ثقلت في السماوات والأرض ) قال : ليس شيء من الخلق إلا يصيبه من ضرر يوم القيامة .\nوقال ابن جريج : ( ثقلت في السماوات والأرض ) قال : إذا جاءت انشقت السماء وانتثرت النجوم ، وكورت الشمس ، وسيرت الجبال ، وكان ما قاله الله ، عز وجل فذلك ثقلها .\nواختار ابن جرير ، رحمه الله : أن المراد : ثقل علم وقتها على أهل السماوات والأرض ، كما قال قتادة .\nوهو كما قالاه ، كقوله تعالى : ( لا تأتيكم إلا بغتة ) ولا ينفي ذلك ثقل مجيئها على أهل السماوات والأرض ، والله أعلم .\nوقال السدي [ في قوله تعالى ] ( ثقلت في السماوات والأرض ) يقول : خفيت في السماوات والأرض ، فلا يعلم قيامها حين تقوم ملك مقرب ، ولا نبي مرسل .\n( لا تأتيكم إلا بغتة ) [ قال ] يبغتهم قيامها ، تأتيهم على غفلة .\nوقال قتادة في قوله تعالى : ( لا تأتيكم إلا بغتة ) قضى الله أنها ( لا تأتيكم إلا بغتة ) قال : وذكر لنا أن نبي الله صلى الله عليه وسلم قال \" إن الساعة تهيج بالناس ، والرجل يصلح حوضه ، والرجل يسقي ماشيته ، والرجل يقيم سلعته في السوق ويخفض ميزانه ويرفعه \"\nوقال البخاري : حدثنا أبو اليمان ، أنبأنا شعيب ، حدثنا أبو الزناد عن عبد الرحمن ، عن أبي هريرة ; أن رسول الله صلى الله عليه وسلم قال : \" لا تقوم الساعة حتى تطلع الشمس من مغربها ، فإذا طلعت فرآها الناس آمنوا أجمعون ، فذلك حين لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ، ولتقومن الساعة وقد نشر الرجلان ثوبهما بينهما ، فلا يتبايعانه ولا يطويانه . ولتقومن الساعة وقد انصرف الرجل بلبن لقحته فلا يطعمه . ولتقومن الساعة وهو يليط حوضه فلا يسقي فيه . ولتقومن الساعة والرجل قد رفع أكلته إلى فيه فلا يطعمها \"\nوقال مسلم في صحيحه : حدثني زهير بن حرب ، حدثنا سفيان بن عيينة ، عن أبي الزناد ، عن الأعرج ، عن أبي هريرة يبلغ به النبي صلى الله عليه وسلم قال : \" تقوم الساعة والرجل يحلب اللقحة ، فما يصل الإناء إلى فيه حتى تقوم الساعة . والرجلان يتبايعان الثوب فما يتبايعانه حتى تقوم . والرجل يلوط حوضه فما يصدر حتى تقوم \"\nوقوله [ تعالى ] ( يسألونك كأنك حفي عنها ) اختلف المفسرون في معناه ، فقيل : معناه : كما قال العوفي عن ابن عباس : ( يسألونك كأنك حفي عنها ) يقول : كأن بينك وبينهم مودة ، كأنك صديق لهم . قال ابن عباس : لما سأل الناس محمدا صلى الله عليه وسلم عن الساعة ، سألوه سؤال قوم كأنهم يرون أن محمدا حفي بهم ، فأوحى الله إليه : إنما علمها عنده ، استأثر بعلمها ، فلم يطلع الله عليها ملكا مقربا ولا رسولا .\nوقال قتادة : قالت قريش لمحمد صلى الله عليه وسلم : إن بيننا وبينك قرابة ، فأسر إلينا متى الساعة . فقال الله ، عز وجل : ( يسألونك كأنك حفي عنها )\nوكذا روي عن مجاهد ، وعكرمة ، وأبي مالك ، والسدي ، وهذا قول . والصحيح عن مجاهد - من رواية ابن أبي نجيح وغيره - : ( يسألونك كأنك حفي عنها ) قال : استحفيت عنها السؤال ، حتى علمت وقتها .\nوكذا قال الضحاك ، عن ابن عباس : ( يسألونك كأنك حفي عنها ) يقول : كأنك عالم بها ، لست تعلمها ، ( قل إنما علمها عند الله )\nوقال معمر ، عن بعضهم : ( كأنك حفي عنها ) كأنك عالم بها .\nوقال عبد الرحمن بن زيد بن أسلم : ( كأنك حفي عنها ) كأنك عالم بها ، وقد أخفى الله علمها على خلقه ، وقرأ : ( إن الله عنده علم الساعة ) الآية [ لقمان : 34 ] .\nولهذا القول أرجح في المعنى من الأول ، والله أعلم ; ولهذا قال : ( قل إنما علمها عند الله ولكن أكثر الناس لا يعلمون )\nولهذا لما جاء جبريل ، عليه السلام ، في صورة أعرابي ، يعلم الناس أمر دينهم ، فجلس من رسول الله صلى الله عليه وسلم مجلس السائل المسترشد ، وسأله عن الإسلام ، ثم عن الإيمان ، ثم عن الإحسان ، ثم قال : فمتى الساعة ؟ قال له رسول الله صلى الله عليه وسلم : \" ما المسئول عنها بأعلم من السائل \" أي : لست أعلم بها منك ولا أحد أعلم بها من أحد ، ثم قرأ النبي صلى الله عليه وسلم : ( إن الله عنده علم الساعة ) الآية\nوفي رواية : فسأله عن أشراط الساعة ، ثم قال : \" في خمس لا يعلمهن إلا الله \" . وقرأ هذه الآية ، وفي هذا كله يقول له بعد كل جواب : \" صدقت \" ; ولهذا عجب الصحابة من هذا السائل يسأله ويصدقه ، ثم لما انصرف قال رسول الله صلى الله عليه وسلم : \" هذا جبريل أتاكم يعلمكم دينكم \"\nوفي رواية قال : \" وما أتاني في صورة إلا عرفته فيها ، إلا صورته هذه \" .\nوقد ذكرت هذا الحديث بطرقه وألفاظه من الصحاح والحسان والمسانيد ، في أول شرح صحيح البخاري ، ولله الحمد والمنة\nولما سأله ذلك الأعرابي وناداه بصوت جهوري فقال : يا محمد ، قال له رسول الله صلى الله عليه وسلم : هاء - على نحو من صوته - قال : يا محمد ، متى الساعة ؟ قال له رسول الله صلى الله عليه وسلم : \" ويحك إن الساعة آتية ، فما أعددت لها ؟ \" قال : ما أعددت لها كبير صلاة ولا صيام ، ولكني أحب الله ورسوله . فقال له رسول الله صلى الله عليه وسلم : \" المرء مع من أحب \" . فما فرح المسلمون بشيء فرحهم بهذا الحديث\nوهذا له طرق متعددة في الصحيحين وغيرهما عن جماعة من الصحابة ، عن رسول الله صلى الله عليه وسلم ; أنه قال : \" المرء مع من أحب \" وهي متواترة عند كثير من الحفاظ المتقنين .\nففيه أنه ، عليه السلام ، كان إذا سئل عن هذا الذي لا يحتاجون إلى علمه ، أرشدهم إلى ما هو الأهم في حقهم ، وهو الاستعداد لوقوع ذلك ، والتهيؤ له قبل نزوله ، وإن لم يعرفوا تعيين وقته .\nولهذا قال مسلم في صحيحه : حدثنا أبو بكر بن أبي شيبة وأبو كريب قالا حدثنا أبو أسامة ، عن هشام ، عن أبيه ، عن عائشة ، رضي الله عنها ، قالت : كانت الأعراب إذا قدموا على رسول الله صلى الله عليه وسلم ، سألوه عن الساعة : متى الساعة ؟ فنظر إلى أحدث إنسان منهم فقال : \" إن يعش هذا لم يدركه الهرم حتى قامت عليكم ساعتكم \" يعني بذلك موتهم الذي يفضي بهم إلى الحصول في برزخ الدار الآخرة .\nثم قال مسلم : وحدثنا أبو بكر بن أبي شيبة ، حدثنا يونس بن محمد ، عن حماد بن سلمة ، عن ثابت ، عن أنس ; أن رجلا سأل رسول الله صلى الله عليه وسلم عن الساعة ، وعنده غلام من الأنصار يقال له محمد ، فقال رسول الله صلى الله عليه وسلم : \" إن يعش هذا الغلام فعسى ألا يدركه الهرم حتى تقوم الساعة \" . انفرد به مسلم\nوحدثنا حجاج بن الشاعر ، حدثنا سليمان بن حرب ، حدثنا حماد بن زيد ، حدثنا معبد بن هلال العنزي عن أنس بن مالك ، رضي الله عنه ; أن رجلا سأل النبي صلى الله عليه وسلم قال : متى الساعة ؟ فسكت رسول الله صلى الله عليه وسلم هنيهة ، ثم نظر إلى غلام بين يديه من أزد شنوءة ، فقال : \" إن عمر هذا لم يدركه الهرم حتى تقوم الساعة \" - قال أنس : ذلك الغلام من أترابي\nوقال : حدثنا هارون بن عبد الله ، حدثنا عفان بن مسلم ، حدثنا همام ، حدثنا قتادة ، عن أنس قال : مر غلام للمغيرة بن شعبة - وكان من أقراني - فقال النبي صلى الله عليه وسلم : \" إن يؤخر هذا لم يدركه الهرم حتى تقوم الساعة \"\nورواه البخاري في كتاب \" الأدب \" من صحيحه ، عن عمرو بن عاصم ، عن همام بن يحيى ، عن قتادة ، عن أنس ; أن رجلا من أهل البادية قال : يا رسول الله ، متى الساعة ؟ فذكر الحديث ، وفي آخره : \" فمر غلام للمغيرة بن شعبة \" ، وذكره\nوهذا الإطلاق في هذه الروايات محمول على التقييد ب \" ساعتكم \" في حديث عائشة ، رضي الله عنها .\nوقال ابن جريج : أخبرني أبو الزبير : أنه سمع جابر بن عبد الله يقول : سمعت رسول الله صلى الله عليه وسلم قبل أن يموت بشهر ، قال : \" تسألوني عن الساعة ، وإنما علمها عند الله . وأقسم بالله ما على ظهر الأرض اليوم من نفس منفوسة ، تأتي عليها مائة سنة \" رواه مسلم\nوفي الصحيحين ، عن ابن عمر مثله ، قال ابن عمر : وإنما أراد رسول الله صلى الله عليه وسلم انخرام ذلك القرن .\nوقال الإمام أحمد : حدثنا هشيم ، أنبأنا العوام ، عن جبلة بن سحيم ، عن مؤثر بن عفازة عن ابن مسعود ، رضي الله عنه ، عن رسول الله صلى الله عليه وسلم قال : \" لقيت ليلة أسري بي إبراهيم وموسى وعيسى \" ، قال : \" فتذاكروا أمر الساعة \" ، قال : \" فردوا أمرهم إلى إبراهيم ، عليه السلام ، فقال : لا علم لي بها . فردوا أمرهم إلى موسى ، فقال : لا علم لي بها . فردوا أمرهم إلى عيسى ، فقال عيسى : أما وجبتها فلا يعلم بها أحد إلا الله ، عز وجل ، وفيما عهد إلي ربي ، عز وجل ، أن الدجال خارج \" ، قال : \" ومعي قضيبان ، فإذا رآني ذاب كما يذوب الرصاص \" ، قال : \" فيهلكه الله ، عز وجل ، إذا رآني ، حتى إن الحجر والشجر يقول : يا مسلم ، إن تحتي كافرا تعالى فاقتله \" . قال : \" فيهلكهم الله ، عز وجل ، ثم يرجع الناس إلى بلادهم وأوطانهم \" ، قال : \" فعند ذلك يخرج يأجوج ومأجوج ، وهم من كل حدب ينسلون ، فيطئون بلادهم ، لا يأتون على شيء إلا أهلكوه ، ولا يمرون على ماء إلا شربوه \" ، قال : \" ثم يرجع الناس إلي فيشكونهم ، فأدعو الله ، عز وجل ، عليهم فيهلكهم ويميتهم ، حتى تجوى الأرض من نتن ريحهم - أي : تنتن - \" قال : \" فينزل الله المطر ، فيجترف أجسادهم حتى يقذفهم في البحر \" .\nقال أحمد : قال يزيد بن هارون : ثم تنسف الجبال ، وتمد الأرض مد الأديم - ثم رجع إلى حديث هشيم قال : ففيما عهد إلي ربي ، عز وجل ، أن ذلك إذا كان كذلك ، فإن الساعة كالحامل المتم لا يدري أهلها متى تفاجئهم بولادها ليلا أو نهارا\nورواه ابن ماجه ، عن بندار عن يزيد بن هارون ، عن العوام بن حوشب بسنده ، نحوه\nفهؤلاء أكابر أولي العزم من المرسلين ، ليس عندهم علم بوقت الساعة على التعيين ، وإنما ردوا الأمر إلى عيسى عليه السلام ، فتكلم على أشراطها ; لأنه ينزل في آخر هذه الأمة منفذا لأحكام رسول الله صلى الله عليه وسلم ، ويقتل المسيح الدجال ، ويجعل الله هلاك يأجوج ومأجوج ببركة دعائه ، فأخبر بما أعلمه الله تعالى به .\nوقال الإمام أحمد : حدثنا يحيى بن أبي بكير حدثنا عبيد الله بن إياد بن لقيط قال : سمعت أبي يذكر عن حذيفة قال : سئل رسول الله صلى الله عليه وسلم عن الساعة فقال : \" علمها عند ربي لا يجليها لوقتها إلا هو ، ولكن سأخبركم بمشاريطها ، وما يكون بين يديها : إن بين يديها فتنة وهرجا \" ، قالوا : يا رسول الله ، الفتنة قد عرفناها ، فالهرج ما هو ؟ قال بلسان الحبشة : \" القتل \" . قال ويلقى بين الناس التناكر ، فلا يكاد أحد يعرف أحدا \" لم يروه أحد من أصحاب الكتب الستة من هذا الوجه .\nوقال وكيع : حدثنا ابن أبي خالد ، عن طارق بن شهاب ، قال : كان رسول الله صلى الله عليه وسلم لا يزال يذكر من شأن الساعة حتى نزلت : ( يسألونك عن الساعة أيان مرساها ) الآية [ النازعات : 42 ] .\nورواه النسائي من حديث عيسى بن يونس ، عن إسماعيل بن أبي خالد ، به وهذا إسناد جيد قوي .\nفهذا النبي الأمي سيد الرسل وخاتمهم [ محمد ] صلوات الله عليه وسلامه نبي الرحمة ، ونبي التوبة ، ونبي الملحمة ، والعاقب والمقفى ، والحاشر الذي تحشر الناس على قدميه ، مع قوله فيما ثبت عنه في الصحيح من حديث أنس وسهل بن سعد ، رضي الله عنهما : \" بعثت أنا والساعة كهاتين \" وقرن بين إصبعيه السبابة والتي تليها . ومع هذا كله ، قد أمره الله تعالى أن يرد علم وقت الساعة إليه إذا سئل عنها ، فقال : ( قل إنما علمها عند الله ولكن أكثر الناس لا يعلمون )\n                                    ",
        "qortoby": "يَسۡ‍َٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرۡسَىٰهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ رَبِّيۖ لَا يُجَلِّيهَا لِوَقۡتِهَآ إِلَّا هُوَۚ ثَقُلَتۡ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا تَأۡتِيكُمۡ إِلَّا بَغۡتَةٗۗ يَسۡ‍َٔلُونَكَ كَأَنَّكَ حَفِيٌّ عَنۡهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ ٱللَّهِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ ٧٨١\n                                    \n                                    \n                                    قوله تعالى يسألونك عن الساعة أيان مرساها قل إنما علمها عند ربي لا يجليها لوقتها إلا هو ثقلت في السماوات والأرض لا تأتيكم إلا بغتة يسألونك كأنك حفي عنها قل إنما علمها عند الله ولكن أكثر الناس لا يعلمون\nقوله تعالى يسألونك عن الساعة أيان مرساها أيان سؤال عن الزمان ; مثل متى . قال الراجز :\nأيان تقضي حاجتي أيانا أما ترى لنجحها أوانا\nوكانت اليهود تقول للنبي صلى الله عليه وسلم : إن كنت نبيا فأخبرنا عن الساعة متى تقوم . وروي أن المشركين قالوا ذلك لفرط الإنكار .\nومرساها في موضع رفع بالابتداء عند سيبويه ، والخبر : أيان . وهو ظرف مبني على الفتح ، بني لأن فيه معنى الاستفهام . ومرساها بضم الميم ، من أرساها الله ، أي أثبتها ، أي متى مثبتها ، أي متى وقوعها . وبفتح الميم من رست ، أي ثبتت ووقفت ; ومنه وقدور راسيات . قال قتادة : أي ثابتات .\nقل إنما علمها عند ربي ابتداء وخبر ، أي لم يبينها لأحد ; حتى يكون العبد أبدا على حذر\nلا يجليها أي لا يظهرها . لوقتها أي في وقتها إلا هو والتجلية : إظهار الشيء ; يقال : جلا لي فلان الخبر إذا أظهره وأوضحه .\nثقلت في السماوات والأرض خفي علمها على أهل السماوات والأرض . وكل ما خفي علمه فهو ثقيل على الفؤاد . وقيل : كبر مجيئها على أهل السماوات والأرض ; عن الحسن وغيره . ابن جريج والسدي : عظم وصفها على أهل السماوات والأرض . وقال قتادة : وغيره : المعنى لا تطيقها السماوات والأرض لعظمها : لأن السماء تنشق والنجوم تتناثر والبحار تنضب . وقيل : المعنى ثقلت المسألة عنها .\nلا تأتيكم إلا بغتة أي فجأة ، مصدر في موضع الحال\nيسألونك كأنك حفي عنها أي عالم بها كثير السؤال عنها . قال ابن فارس : الحفي العالم بالشيء . والحفي : المستقصي في السؤال . قال الأعشى :\nفإن تسألي عني فيا رب سائل حفي عن الأعشى به حيث أصعدا\nيقال : أحفى في المسألة وفي الطلب ، فهو محف وحفي على التكثير ، مثل مخصب وخصيب . قال محمد بن يزيد : المعنى يسألونك كأنك حفي بالمسألة عنها ، أي ملح . يذهب إلى أنه ليس في الكلام تقديم وتأخير . وقال ابن عباس وغيره : هو على التقديم والتأخير ، والمعنى : يسألونك عنها كأنك حفي بهم أي حفي ببرهم وفرح بسؤالهم . وذلك لأنهم قالوا : بيننا وبينك قرابة فأسر إلينا بوقت الساعة .\nقل إنما علمها عند الله ولكن أكثر الناس لا يعلمون ليس هذا تكريرا ، ولكن أحد العلمين لوقوعها والآخر لكنهها .\n                                    ",
        "saadi": "يَسۡ‍َٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرۡسَىٰهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ رَبِّيۖ لَا يُجَلِّيهَا لِوَقۡتِهَآ إِلَّا هُوَۚ ثَقُلَتۡ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا تَأۡتِيكُمۡ إِلَّا بَغۡتَةٗۗ يَسۡ‍َٔلُونَكَ كَأَنَّكَ حَفِيٌّ عَنۡهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ ٱللَّهِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ ٧٨١\n                                        \n                                        \n                                        \n                                        يقول تعالى لرسوله محمد صلى الله عليه وسلم: يَسْأَلُونَكَ أي: المكذبون لك، المتعنتون عَنِ السَّاعَةِ أَيَّانَ مُرْسَاهَا أي: متى وقتها الذي تجيء به، ومتى تحل بالخلق؟ قُلْ إِنَّمَا عِلْمُهَا عِنْدَ رَبِّي أي: إنه تعالى مختص بعلمها، لا يُجَلِّيهَا لِوَقْتِهَا إِلا هُوَ أي: لا يظهرها لوقتها الذي قدر أن تقوم فيه إلا هو. ثَقُلَتْ فِي السَّمَاوَاتِ وَالأرْضِ أي: خفي علمها على أهل السماوات والأرض، واشتد أمرها أيضا عليهم، فهم من الساعة مشفقون. لا تَأْتِيكُمْ إِلا بَغْتَةً أي: فجأة من حيث لا تشعرون، لم يستعدوا لها، ولم يتهيأوا لقيامها. يَسْأَلُونَكَ كَأَنَّكَ حَفِيٌّ عَنْهَا أي: هم حريصون على سؤالك عن الساعة، كأنك مستحف عن السؤال عنها، ولم يعلموا أنك - لكمال علمك بربك، وما ينفع السؤال عنه - غير مبال بالسؤال عنها، ولا حريص على ذلك، فلم لا يقتدون بك، ويكفون عن الاستحفاء عن هذا السؤال الخالي من المصلحة المتعذر علمه، فإنه لا يعلمها نبي مرسل، ولا ملك مقرب. وهي من الأمور التي أخفاها الله عن الخلق، لكمال حكمته وسعة علمه. قُلْ إِنَّمَا عِلْمُهَا عِنْدَ اللَّهِ وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ فلذلك حرصوا على ما لا ينبغي الحرص عليه، وخصوصا مثل حال هؤلاء الذين يتركون السؤال عن الأهم، ويدعون ما يجب عليهم من العلم، ثم يذهبون إلى ما لا سبيل لأحد أن يدركه، ولا هم مطالبون بعلمه.\n                                    "
      },
      "originalText": "يَسۡ‍َٔلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرۡسَىٰهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ رَبِّيۖ لَا يُجَلِّيهَا لِوَقۡتِهَآ إِلَّا هُوَۚ ثَقُلَتۡ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا تَأۡتِيكُمۡ إِلَّا بَغۡتَةٗۗ يَسۡ‍َٔلُونَكَ كَأَنَّكَ حَفِيٌّ عَنۡهَاۖ قُلۡ إِنَّمَا عِلۡمُهَا عِندَ ٱللَّهِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ ٧٨١"
    }
  ]
}