{
  "number": 18,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 120,
      "text": "وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَىٰ عَلَىٰ شَيْءٍ وَقَالَتِ النَّصَارَىٰ لَيْسَتِ الْيَهُودُ عَلَىٰ شَيْءٍ وَهُمْ يَتْلُونَ الْكِتَابَ ۗ كَذَٰلِكَ قَالَ الَّذِينَ لَا يَعْلَمُونَ مِثْلَ قَوْلِهِمْ ۚ فَاللَّهُ يَحْكُمُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 113,
      "juz": 1,
      "manzil": 1,
      "page": 18,
      "ruku": 15,
      "hizbQuarter": 7,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَتِ ٱلۡيَهُودُ لَيۡسَتِ ٱلنَّصَٰرَىٰ عَلَىٰ شَيۡءٖ وَقَالَتِ ٱلنَّصَٰرَىٰ لَيۡسَتِ ٱلۡيَهُودُ عَلَىٰ شَيۡءٖ وَهُمۡ يَتۡلُونَ ٱلۡكِتَٰبَۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ مِثۡلَ قَوۡلِهِمۡۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ ٣١١\n                                    \n                                    \n                                    وقوله تعالى : ( وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب ) يبين به تعالى تناقضهم وتباغضهم وتعاديهم وتعاندهم . كما قال محمد بن إسحاق : حدثني محمد بن أبي محمد ، عن عكرمة أو سعيد بن جبير ، عن ابن عباس ، قال : لما قدم أهل نجران من النصارى على رسول الله صلى الله عليه وسلم ، أتتهم أحبار يهود ، فتنازعوا عند رسول الله صلى الله عليه وسلم ، فقال رافع بن حريملة ما أنتم على شيء ، وكفر بعيسى وبالإنجيل . وقال رجل من أهل نجران من النصارى لليهود : ما أنتم على شيء . وجحد نبوة موسى وكفر بالتوراة . فأنزل الله في ذلك من قولهما ( وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب ) قال : إن كلا يتلو في كتابه تصديق من كفر به ، أي : يكفر اليهود بعيسى وعندهم التوراة ، فيها ما أخذ الله عليهم على لسان موسى بالتصديق بعيسى ، وفي الإنجيل ما جاء به عيسى بتصديق موسى ، وما جاء من التوراة من عند الله ، وكل يكفر بما في يد صاحبه .\nوقال مجاهد في تفسير هذه الآية : قد كانت أوائل اليهود والنصارى على شيء .\nوقال قتادة : ( وقالت اليهود ليست النصارى على شيء ) قال : بلى ، قد كانت أوائل النصارى على شيء ، ولكنهم ابتدعوا وتفرقوا . ( وقالت النصارى ليست اليهود على شيء ) قال : بلى قد كانت أوائل اليهود على شيء ، ولكنهم ابتدعوا وتفرقوا .\nوعنه رواية أخرى كقول أبي العالية ، والربيع بن أنس في تفسير هذه الآية : ( وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء ) هؤلاء أهل الكتاب الذين كانوا على عهد رسول الله صلى الله عليه وسلم .\nوهذا القول يقتضي أن كلا من الطائفتين صدقت فيما رمت به الطائفة الأخرى . ولكن ظاهر سياق الآية يقتضي ذمهم فيما قالوه ، مع علمهم بخلاف ذلك ; ولهذا قال تعالى : ( وهم يتلون الكتاب ) أي : وهم يعلمون شريعة التوراة والإنجيل ، كل منهما قد كانت مشروعة في وقت ، ولكن تجاحدوا فيما بينهم عنادا وكفرا ومقابلة للفاسد بالفاسد ، كما تقدم عن ابن عباس ، ومجاهد ، وقتادة في الرواية الأولى عنه في تفسيرها ، والله أعلم .\nوقوله تعالى : ( كذلك قال الذين لا يعلمون مثل قولهم ) يبين بهذا جهل اليهود والنصارى فيما تقابلوا من القول ، وهذا من باب الإيماء والإشارة . وقد اختلف فيما عنى بقوله تعالى : ( الذين لا يعلمون )\nفقال الربيع بن أنس وقتادة : ( كذلك قال الذين لا يعلمون ) قالا وقالت النصارى مثل قول اليهود وقيلهم . وقال ابن جريج : قلت لعطاء : من هؤلاء الذين لا يعلمون ؟ قال : أمم كانت قبل اليهود والنصارى وقبل التوراة والإنجيل . وقال السدي : ( كذلك قال الذين لا يعلمون ) فهم : العرب ، قالوا : ليس محمد على شيء .\nواختار أبو جعفر بن جرير أنها عامة تصلح للجميع ، وليس ثم دليل قاطع يعين واحدا من هذه الأقوال ، فالحمل على الجميع أولى ، والله أعلم .\nوقوله تعالى : ( فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون ) أي : أنه تعالى يجمع بينهم يوم المعاد ، ويفصل بينهم بقضائه العدل الذي لا يجور فيه ولا يظلم مثقال ذرة . وهذا كقوله تعالى في سورة الحج : ( إن الذين آمنوا والذين هادوا والصابئين والنصارى والمجوس والذين أشركوا إن الله يفصل بينهم يوم القيامة إن الله على كل شيء شهيد ) [ الحج : 17 ] ، وكما قال تعالى : ( قل يجمع بيننا ربنا ثم يفتح بيننا بالحق وهو الفتاح العليم ) [ سبأ : 26 ] .\n                                    ",
        "qortoby": "وَقَالَتِ ٱلۡيَهُودُ لَيۡسَتِ ٱلنَّصَٰرَىٰ عَلَىٰ شَيۡءٖ وَقَالَتِ ٱلنَّصَٰرَىٰ لَيۡسَتِ ٱلۡيَهُودُ عَلَىٰ شَيۡءٖ وَهُمۡ يَتۡلُونَ ٱلۡكِتَٰبَۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ مِثۡلَ قَوۡلِهِمۡۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ ٣١١\n                                    \n                                    \n                                    قوله تعالى : وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون معناه ادعى كل فريق منهم أن صاحبه ليس على شيء ، وأنه أحق برحمة الله منه . وهم يتلون الكتاب يعني التوراة والإنجيل ، والجملة في موضع الحال .\nكذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون والمراد ب الذين لا يعلمون في قول الجمهور : كفار العرب ; لأنهم لا كتاب لهم . وقال عطاء : المراد أمم كانت قبل اليهود والنصارى . الربيع بن أنس : المعنى كذلك قالت اليهود قبل النصارى . ابن عباس : قدم أهل نجران على النبي صلى الله عليه وسلم فأتتهم أحبار يهود ، فتنازعوا عند النبي صلى الله عليه وسلم ، وقالت كل فرقة منهم للأخرى لستم على شيء ، فنزلت الآية .\n                                    ",
        "saadi": "وَقَالَتِ ٱلۡيَهُودُ لَيۡسَتِ ٱلنَّصَٰرَىٰ عَلَىٰ شَيۡءٖ وَقَالَتِ ٱلنَّصَٰرَىٰ لَيۡسَتِ ٱلۡيَهُودُ عَلَىٰ شَيۡءٖ وَهُمۡ يَتۡلُونَ ٱلۡكِتَٰبَۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ مِثۡلَ قَوۡلِهِمۡۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ ٣١١\n                                        \n                                        \n                                        \n                                        وذلك أنه بلغ بأهل الكتاب الهوى والحسد, إلى أن بعضهم ضلل بعضا, وكفر بعضهم بعضا, كما فعل الأميون من مشركي العرب وغيرهم. فكل فرقة تضلل الفرقة الأخرى, ويحكم الله في الآخرة بين المختلفين بحكمه العدل, الذي أخبر به عباده, فإنه لا فوز ولا نجاة إلا لمن صدق جميع الأنبياء والمرسلين, وامتثل أوامر ربه, واجتنب نواهيه, ومن عداهم, فهو هالك.\n                                    "
      },
      "originalText": "وَقَالَتِ ٱلۡيَهُودُ لَيۡسَتِ ٱلنَّصَٰرَىٰ عَلَىٰ شَيۡءٖ وَقَالَتِ ٱلنَّصَٰرَىٰ لَيۡسَتِ ٱلۡيَهُودُ عَلَىٰ شَيۡءٖ وَهُمۡ يَتۡلُونَ ٱلۡكِتَٰبَۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ مِثۡلَ قَوۡلِهِمۡۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ ٣١١"
    },
    {
      "number": 121,
      "text": "وَمَنْ أَظْلَمُ مِمَّنْ مَنَعَ مَسَاجِدَ اللَّهِ أَنْ يُذْكَرَ فِيهَا اسْمُهُ وَسَعَىٰ فِي خَرَابِهَا ۚ أُولَٰئِكَ مَا كَانَ لَهُمْ أَنْ يَدْخُلُوهَا إِلَّا خَائِفِينَ ۚ لَهُمْ فِي الدُّنْيَا خِزْيٌ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 114,
      "juz": 1,
      "manzil": 1,
      "page": 18,
      "ruku": 15,
      "hizbQuarter": 7,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَنۡ أَظۡلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ أُوْلَٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ ٤١١\n                                    \n                                    \n                                    اختلف المفسرون في المراد من الذين منعوا مساجد الله وسعوا في خرابها على قولين :\nأحدهما : ما رواه العوفي في تفسيره ، عن ابن عباس في قوله : ( ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه ) قال : هم النصارى . وقال مجاهد : هم النصارى ، كانوا يطرحون في بيت المقدس الأذى ، ويمنعون الناس أن يصلوا فيه .\nوقال عبد الرزاق : أخبرنا معمر ، عن قتادة في قوله : ( وسعى في خرابها ) هو بختنصر وأصحابه ، خرب بيت المقدس ، وأعانه على ذلك النصارى .\nوقال سعيد ، عن قتادة : قال : أولئك أعداء الله النصارى ، حملهم بغض اليهود على أن أعانوا بختنصر البابلي المجوسي على تخريب بيت المقدس .\nوقال السدي : كانوا ظاهروا بختنصر على خراب بيت المقدس حتى خربه ، وأمر به أن تطرح فيه الجيف ، وإنما أعانه الروم على خرابه من أجل أن بني إسرائيل قتلوا يحيى بن زكريا . وروي نحوه عن الحسن البصري .\nالقول الثاني : ما رواه ابن جرير : حدثني يونس بن عبد الأعلى ، حدثنا ابن وهب قال : قال ابن زيد في قوله : ( ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه وسعى في خرابها ) قال : هؤلاء المشركون الذين حالوا بين رسول الله صلى الله عليه وسلم يوم الحديبية ، وبين أن يدخلوا مكة حتى نحر هديه بذي طوى وهادنهم ، وقال لهم : ما كان أحد يصد عن هذا البيت ، وقد كان الرجل يلقى قاتل أبيه وأخيه فلا يصده . فقالوا : لا يدخل علينا من قتل آباءنا يوم بدر وفينا باق .\nوفي قوله : ( وسعى في خرابها ) قال : إذ قطعوا من يعمرها بذكره ويأتيها للحج والعمرة .\nوقال ابن أبي حاتم : ذكر عن سلمة قال : قال محمد بن إسحاق : حدثني محمد بن أبي محمد ، عن عكرمة أو سعيد بن جبير ، عن ابن عباس : أن قريشا منعوا النبي صلى الله عليه وسلم الصلاة عند الكعبة في المسجد الحرام ، فأنزل الله : ( ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه )\nثم اختار ابن جرير القول الأول ، واحتج بأن قريشا لم تسع في خراب الكعبة . وأما الروم فسعوا في تخريب بيت المقدس .\nقلت : الذي يظهر والله أعلم القول الثاني ، كما قاله ابن زيد ، وروي عن ابن عباس ; لأن النصارى إذا منعت اليهود الصلاة في البيت المقدس ، كأن دينهم أقوم من دين اليهود ، وكانوا أقرب منهم ، ولم يكن ذكر الله من اليهود مقبولا إذ ذاك ; لأنهم لعنوا من قبل على لسان داود وعيسى ابن مريم ، ذلك بما عصوا وكانوا يعتدون . وأيضا فإنه تعالى لما وجه الذم في حق اليهود والنصارى ، شرع في ذم المشركين الذين أخرجوا الرسول صلى الله عليه وسلم وأصحابه من مكة ، ومنعوهم من الصلاة في المسجد الحرام ، وأما اعتماده على أن قريشا لم تسع في خراب الكعبة ، فأي خراب أعظم مما فعلوا ؟ أخرجوا عنها رسول الله صلى الله عليه وسلم وأصحابه ، واستحوذوا عليها بأصنامهم وأندادهم وشركهم ، كما قال تعالى : ( وما لهم ألا يعذبهم الله وهم يصدون عن المسجد الحرام وما كانوا أولياءه إن أولياؤه إلا المتقون ولكن أكثرهم لا يعلمون ) [ الأنفال : 34 ] ، وقال تعالى : ( ما كان للمشركين أن يعمروا مساجد الله شاهدين على أنفسهم بالكفر أولئك حبطت أعمالهم وفي النار هم خالدون إنما يعمر مساجد الله من آمن بالله واليوم الآخر وأقام الصلاة وآتى الزكاة ولم يخش إلا الله فعسى أولئك أن يكونوا من المهتدين ) [ التوبة : 17 ، 18 ] ، وقال تعالى : ( هم الذين كفروا وصدوكم عن المسجد الحرام والهدي معكوفا أن يبلغ محله ولولا رجال مؤمنون ونساء مؤمنات لم تعلموهم أن تطئوهم فتصيبكم منهم معرة بغير علم ليدخل الله في رحمته من يشاء لو تزيلوا لعذبنا الذين كفروا منهم عذابا أليما ) [ الفتح : 25 ] ، فقال تعالى : ( إنما يعمر مساجد الله من آمن بالله واليوم الآخر وأقام الصلاة وآتى الزكاة ولم يخش إلا الله ) [ التوبة : 18 ] ، فإذا كان من هو كذلك مطرودا منها مصدودا عنها ، فأي خراب لها أعظم من ذلك ؟ وليس المراد من عمارتها زخرفتها وإقامة صورتها فقط ، إنما عمارتها بذكر الله فيها وإقامة شرعه فيها ، ورفعها عن الدنس والشرك .\nوقوله تعالى : ( أولئك ما كان لهم أن يدخلوها إلا خائفين ) هذا خبر معناه الطلب ، أي لا تمكنوا هؤلاء إذا قدرتم عليهم من دخولها إلا تحت الهدنة والجزية . ولهذا لما فتح رسول الله صلى الله عليه وسلم مكة أمر من العام القابل في سنة تسع أن ينادى برحاب منى : \" ألا لا يحجن بعد العام مشرك ، ولا يطوفن بالبيت عريان ، ومن كان له أجل فأجله إلى مدته \" . وهذا كان تصديقا وعملا بقوله تعالى : ( يا أيها الذين آمنوا إنما المشركون نجس فلا يقربوا المسجد الحرام بعد عامهم هذا ) الآية [ التوبة : 28 ] ، وقال بعضهم : ما كان ينبغي لهم أن يدخلوا مساجد الله إلا خائفين على حال التهيب ، وارتعاد الفرائص من المؤمنين أن يبطشوا بهم ، فضلا أن يستولوا عليها ويمنعوا المؤمنين منها . والمعنى : ما كان الحق والواجب إلا ذلك ، لولا ظلم الكفرة وغيرهم .\nوقيل : إن هذا بشارة من الله للمسلمين أنه سيظهرهم على المسجد الحرام وعلى سائر المساجد ، وأنه يذل المشركين لهم حتى لا يدخل المسجد الحرام أحد منهم إلا خائفا ، يخاف أن يؤخذ فيعاقب أو يقتل إن لم يسلم . وقد أنجز الله هذا الوعد كما تقدم من منع المشركين من دخول المسجد الحرام ، وأوصى رسول الله صلى الله عليه وسلم أن لا يبقى بجزيرة العرب دينان ، وأن تجلى اليهود والنصارى منها ، ولله الحمد والمنة . وما ذاك إلا تشريف أكناف المسجد الحرام وتطهير البقعة [ المباركة ] التي بعث [ الله ] فيها رسوله إلى الناس كافة بشيرا ونذيرا صلوات الله وسلامه عليه . وهذا هو الخزي لهم في الدنيا ; لأن الجزاء من جنس العمل . فكما صدوا المؤمنين عن المسجد الحرام ، صدوا عنه ، وكما أجلوهم من مكة أجلوا منها ( ولهم في الآخرة عذاب عظيم ) على ما انتهكوا من حرمة البيت ، وامتهنوه من نصب الأصنام حوله ، والدعاء إلى غير الله عنده والطواف به عريا ، وغير ذلك من أفاعيلهم التي يكرهها الله ورسوله .\nوأما من فسر بيت المقدس ، فقال كعب الأحبار : إن النصارى لما ظهروا على بيت المقدس خربوه فلما بعث الله محمدا صلى الله عليه وسلم أنزل عليه : ( ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه وسعى في خرابها أولئك ما كان لهم أن يدخلوها إلا خائفين ) الآية ، فليس في الأرض نصراني يدخل بيت المقدس إلا خائفا .\nوقال السدي : فليس في الأرض رومي يدخله اليوم إلا وهو خائف أن يضرب عنقه ، أو قد أخيف بأداء الجزية فهو يؤديها .\nوقال قتادة : لا يدخلون المساجد إلا مسارقة .\nقلت : وهذا لا ينفي أن يكون داخلا في معنى عموم الآية فإن النصارى لما ظلموا بيت المقدس ، بامتهان الصخرة التي كانت يصلي إليها اليهود ، عوقبوا شرعا وقدرا بالذلة فيه ، إلا في أحيان من الدهر امتحن بهم بيت المقدس وكذلك اليهود لما عصوا الله فيه أيضا أعظم من عصيان النصارى كانت عقوبتهم أعظم والله أعلم .\nوفسر هؤلاء الخزي من الدنيا ، بخروج المهدي عند السدي ، وعكرمة ، ووائل بن داود . وفسره قتادة بأداء الجزية عن يد وهم صاغرون .\nوالصحيح أن الخزي في الدنيا أعم من ذلك كله ، وقد ورد الحديث بالاستعاذة من خزي الدنيا وعذاب الآخرة كما قال الإمام أحمد : حدثنا الهيثم بن خارجة ، حدثنا محمد بن أيوب بن ميسرة بن حلبس سمعت أبي يحدث ، عن بسر بن أرطاة ، قال : كان رسول الله صلى الله عليه وسلم يدعو : \" اللهم أحسن عاقبتنا في الأمور كلها ، وأجرنا من خزي الدنيا وعذاب الآخرة \" .\nوهذا حديث حسن ، وليس في شيء من الكتب الستة ، وليس لصحابيه وهو بسر بن أرطاة ويقال : ابن أبي أرطاة حديث سواه ، وسوى [ حديث ] \" لا تقطع الأيدي في الغزو \" .\n                                    ",
        "qortoby": "وَمَنۡ أَظۡلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ أُوْلَٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ ٤١١\n                                    \n                                    \n                                    قوله تعالى : ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه وسعى في خرابها أولئك ما كان لهم أن يدخلوها إلا خائفين لهم في الدنيا خزي ولهم في الآخرة عذاب عظيم فيه سبع مسائل :\n                                    الأولى : قوله تعالى : قوله تعالى : ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه من رفع بالابتداء ، وأظلم خبره ، والمعنى لا أحد أظلم . وأن في موضع نصب على البدل من مساجد ، ويجوز أن يكون التقدير : كراهية أن يذكر ، ثم حذف . ويجوز أن يكون التقدير : من أن يذكر فيها ، وحرف الخفض يحذف مع أن لطول الكلام . وأراد بالمساجد هنا بيت المقدس ومحاريبه . وقيل الكعبة ، وجمعت لأنها قبلة المساجد أو للتعظيم . وقيل : المراد سائر المساجد ، والواحد مسجد ( بكسر الجيم ) ، ومن العرب من يقول : مسجد ( بفتحها ) . قال الفراء : \" كل ما كان على فعل يفعل ، مثل دخل يدخل ، فالمفعل منه بالفتح اسما كان أو مصدرا ، ولا يقع فيه الفرق ، مثل دخل يدخل مدخلا ، وهذا مدخله ، إلا أحرفا من الأسماء ألزموها كسر العين ، من ذلك : المسجد والمطلع والمغرب والمشرق والمسقط والمفرق والمجزر والمسكن والمرفق ( من رفق يرفق ) والمنبت والمنسك ( من نسك ينسك ) ، فجعلوا الكسر علامة للاسم ، وربما فتحه بعض العرب في الاسم \" . والمسجد ( بالفتح ) : جبهة الرجل حيث يصيبه ندب السجود . والآراب السبعة مساجد ، قاله الجوهري .\nالثانية : واختلف الناس في المراد بهذه الآية وفيمن نزلت ، فذكر المفسرون أنها نزلت في بخت نصر ; لأنه كان أخرب بيت المقدس . وقال ابن عباس وغيره : نزلت في النصارى ، والمعنى كيف تدعون أيها النصارى أنكم من أهل الجنة ! وقد خربتم بيت المقدس ومنعتم المصلين من الصلاة فيه . ومعنى الآية على هذا : التعجب من فعل النصارى ببيت المقدس مع تعظيمهم له ، وإنما فعلوا ما فعلوا عداوة لليهود . روى سعيد عن قتادة قال : أولئك أعداء الله النصارى . حملهم إبغاض اليهود على أن أعانوا بخت نصر البابلي المجوسي على تخريب بيت المقدس . وروي أن هذا التخريب بقي إلى زمن عمر رضي الله عنه . وقيل : نزلت في المشركين إذ منعوا المصلين والنبي صلى الله عليه وسلم ، وصدوهم عن المسجد الحرام عام الحديبية .\nوقيل : المراد من منع من كل مسجد إلى يوم القيامة ، وهو الصحيح ; لأن اللفظ عام ورد بصيغة الجمع ، فتخصيصها ببعض المساجد وبعض الأشخاص ضعيف ، والله تعالى أعلم .\nالثالثة : خراب المساجد قد يكون حقيقيا كتخريب بخت نصر والنصارى بيت المقدس على ما ذكر أنهم غزوا بني إسرائيل مع بعض ملوكهم - قيل : اسمه نطوس بن اسبيسانوس الرومي فيما ذكر الغزنوي - فقتلوا وسبوا ، وحرقوا التوراة ، وقذفوا في بيت المقدس العذرة وخربوه .\nويكون مجازا كمنع المشركين المسلمين حين صدوا رسول الله صلى الله عليه وسلم عن المسجد الحرام ، وعلى الجملة فتعطيل المساجد عن الصلاة وإظهار شعائر الإسلام فيها خراب لها .\nالرابعة : قال علماؤنا : ولهذا قلنا لا يجوز منع المرأة من الحج إذا كانت صرورة ، سواء كان لها محرم أو لم يكن ، ولا تمنع أيضا من الصلاة في المساجد ما لم يخف عليها الفتنة وكذلك قال النبي صلى الله عليه وسلم : لا تمنعوا إماء الله مساجد الله ولذلك قلنا : لا يجوز نقض المسجد ولا بيعه ولا تعطيله وإن خربت المحلة ، ولا يمنع بناء المساجد إلا أن يقصدوا الشقاق والخلاف ، بأن يبنوا مسجدا إلى جنب مسجد أو قربه ، يريدون بذلك تفريق أهل المسجد الأول وخرابه واختلاف الكلمة ، فإن المسجد الثاني ينقض ويمنع من بنيانه ، ولذلك قلنا : لا يجوز أن يكون في المصر جامعان ، ولا لمسجد واحد إمامان ، ولا يصلي في مسجد جماعتان . وسيأتي لهذا كله مزيد بيان في سورة \" براءة \" إن شاء الله تعالى ، وفي \" النور \" حكم المساجد وبنائها بحول الله تعالى . ودلت الآية أيضا على تعظيم أمر الصلاة ، وأنها لما كانت أفضل الأعمال وأعظمها أجرا كان منعها أعظم إثما .\nالخامسة : كل موضع يمكن أن يعبد الله فيه ويسجد له يسمى مسجدا ، قال صلى الله عليه وسلم : جعلت لي الأرض مسجدا وطهورا ، أخرجه الأئمة . وأجمعت الأمة على أن البقعة إذا عينت للصلاة بالقول خرجت عن جملة الأملاك المختصة بربها وصارت عامة لجميع المسلمين ، فلو بنى رجل في داره مسجدا وحجزه على الناس واختص به لنفسه لبقي على ملكه ولم يخرج إلى حد المسجدية ، ولو أباحه للناس كلهم كان حكمه حكم سائر المساجد العامة ، وخرج عن اختصاص الأملاك .\nالسادسة : قوله تعالى : أولئك ما كان لهم أن يدخلوها إلا خائفين أولئك مبتدأ وما بعده خبره . خائفين حال ، يعني إذا استولى عليها المسلمون وحصلت تحت سلطانهم فلا يتمكن الكافر حينئذ من دخولها . فإن دخلوها ، فعلى خوف من إخراج المسلمين لهم ، وتأديبهم على دخولها . وفي هذا دليل على أن الكافر ليس له دخول المسجد بحال ، على ما يأتي في \" براءة \" إن شاء الله تعالى . ومن جعل الآية في النصارى روى أنه مر زمان بعد بناء عمر بيت المقدس في الإسلام لا يدخله نصراني إلا أوجع ضربا بعد أن كان متعبدهم . ومن جعلها في قريش قال : كذلك نودي بأمر النبي صلى الله عليه وسلم : ألا لا يحج بعد العام مشرك ، ولا يطوف بالبيت عريان . وقيل : هو خبر ومقصوده الأمر ، أي جاهدوهم واستأصلوهم حتى لا يدخل أحد منهم المسجد الحرام إلا خائفا ، كقوله : وما كان لكم أن تؤذوا رسول الله فإنه نهي ورد بلفظ الخبر .\nالسابعة : قوله تعالى : لهم في الدنيا خزي قيل القتل للحربي ، والجزية للذمي ، عن قتادة . السدي : الخزي لهم في الدنيا قيام المهدي ، وفتح عمورية ورومية وقسطنطينية ، وغير ذلك من مدنهم ، على ما ذكرناه في كتاب التذكرة . ومن جعلها في قريش جعل الخزي عليهم في الفتح ، والعذاب في الآخرة لمن مات منهم كافرا .\n                                    ",
        "saadi": "وَمَنۡ أَظۡلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ أُوْلَٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ ٤١١\n                                        \n                                        \n                                        \n                                        أي: لا أحد أظلم وأشد جرما, ممن منع مساجد الله, عن ذكر الله فيها, وإقامة الصلاة وغيرها من الطاعات. { وَسَعَى } أي: اجتهد وبذل وسعه { فِي خَرَابِهَا } الحسي والمعنوي، فالخراب الحسي: هدمها وتخريبها, وتقذيرها، والخراب المعنوي: منع الذاكرين لاسم الله فيها، وهذا عام, لكل من اتصف بهذه الصفة, فيدخل في ذلك أصحاب الفيل, وقريش, حين صدوا رسول الله عنها عام الحديبية, والنصارى حين أخربوا بيت المقدس, وغيرهم من أنواع الظلمة, الساعين في خرابها, محادة لله, ومشاقة، فجازاهم الله, بأن منعهم دخولها شرعا وقدرا, إلا خائفين ذليلين, فلما أخافوا عباد الله, أخافهم الله، فالمشركون الذين صدوا رسوله, لم يلبث رسول الله صلى الله عليه وسلم إلا يسيرا, حتى أذن الله له في فتح مكة، ومنع المشركين من قربان بيته, فقال تعالى: { يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْمُشْرِكُونَ نَجَسٌ فَلَا يَقْرَبُوا الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَذَا } وأصحاب الفيل, قد ذكر الله ما جرى عليهم، والنصارى, سلط الله عليهم المؤمنين, فأجلوهم عنه. وهكذا كل من اتصف بوصفهم, فلا بد أن يناله قسطه, وهذا من الآيات العظيمة, أخبر بها الباري قبل وقوعها, فوقعت كما أخبر. واستدل العلماء بالآية الكريمة, على أنه لا يجوز تمكين الكفار من دخول المساجد. { لَهُمْ فِي الدُّنْيَا خِزْيٌ } أي: فضيحة كما تقدم { وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ } وإذا كان لا أظلم ممن منع مساجد الله أن يذكر فيها اسمه, فلا أعظم إيمانا ممن سعى في عمارة المساجد بالعمارة الحسية والمعنوية, كما قال تعالى: { إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ } بل قد أمر الله تعالى برفع بيوته وتعظيمها وتكريمها, فقال تعالى: { فِي بُيُوتٍ أَذِنَ اللَّهُ أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ } وللمساجد أحكام كثيرة, يرجع حاصلها إلى مضون هذه الآيات الكريمة.\n                                    "
      },
      "originalText": "وَمَنۡ أَظۡلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ أُوْلَٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ ٤١١"
    },
    {
      "number": 122,
      "text": "وَلِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ ۚ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ ۚ إِنَّ اللَّهَ وَاسِعٌ عَلِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 115,
      "juz": 1,
      "manzil": 1,
      "page": 18,
      "ruku": 15,
      "hizbQuarter": 7,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ ٥١١\n                                    \n                                    \n                                    وهذا والله أعلم فيه تسلية للرسول صلى الله عليه وسلم وأصحابه الذين أخرجوا من مكة وفارقوا مسجدهم ومصلاهم ، وقد كان رسول الله صلى الله عليه وسلم يصلي بمكة إلى بيت المقدس والكعبة بين يديه . فلما قدم المدينة وجه إلى بيت المقدس ستة عشر شهرا ، أو سبعة عشر شهرا ، ثم صرفه الله إلى الكعبة بعد ، ولهذا يقول تعالى : ( ولله المشرق والمغرب فأينما تولوا فثم وجه الله )\nقال أبو عبيد القاسم بن سلام ، في كتاب الناسخ والمنسوخ : أخبرنا حجاج بن محمد ، أخبرنا ابن جريج وعثمان بن عطاء ، عن عطاء ، عن ابن عباس ، قال : أول ما نسخ من القرآن فيما ذكر لنا والله أعلم شأن القبلة : قال تعالى : ( ولله المشرق والمغرب فأينما تولوا فثم وجه الله ) فاستقبل رسول الله صلى الله عليه وسلم فصلى نحو بيت المقدس ، وترك البيت العتيق ، ثم صرفه إلى بيته العتيق ونسخها ، فقال : ( ومن حيث خرجت فول وجهك شطر المسجد الحرام وحيثما كنتم فولوا وجوهكم شطره ) .\nوقال علي بن أبي طلحة ، عن ابن عباس قال : كان أول ما نسخ من القرآن القبلة . وذلك أن رسول صلى الله عليه وسلم لما هاجر إلى المدينة وكان أهلها اليهود أمره الله أن يستقبل بيت المقدس . ففرحت اليهود فاستقبلها رسول الله صلى الله عليه وسلم بضعة عشر شهرا ، وكان رسول الله صلى الله عليه وسلم يحب قبلة إبراهيم ، فكان يدعو وينظر إلى السماء ، فأنزل الله : ( قد نرى تقلب وجهك في السماء [ فلنولينك قبلة ترضاها ] ) إلى قوله : ( فولوا وجوهكم شطره ) فارتاب من ذلك اليهود ، وقالوا : ما ولاهم عن قبلتهم التي كانوا عليها ، فأنزل الله : ( قل لله المشرق والمغرب [ يهدي من يشاء إلى صراط مستقيم ] ) وقال : ( فأينما تولوا فثم وجه الله )\nوقال عكرمة عن ابن عباس : ( فأينما تولوا فثم وجه الله ) قال : قبلة الله أينما توجهت شرقا أو غربا . وقال مجاهد : ( فأينما تولوا فثم وجه الله ) [ قال : قبلة الله ] حيثما كنتم فلكم قبلة تستقبلونها : الكعبة .\nوقال ابن أبي حاتم بعد روايته الأثر المتقدم ، عن ابن عباس ، في نسخ القبلة ، عن عطاء ، عنه : وروي عن أبي العالية ، والحسن ، وعطاء الخراساني ، وعكرمة ، وقتادة ، والسدي ، وزيد بن أسلم ، نحو ذلك .\nوقال ابن جرير : وقال آخرون : بل أنزل الله هذه الآية قبل أن يفرض التوجه إلى الكعبة ، وإنما أنزلها تعالى ليعلم نبيه صلى الله عليه وسلم وأصحابه أن لهم التوجه بوجوههم للصلاة ، حيث شاءوا من نواحي المشرق والمغرب ; لأنهم لا يوجهون وجوههم وجها من ذلك وناحية إلا كان جل ثناؤه في ذلك الوجه وتلك الناحية ; لأن له تعالى المشارق والمغارب ، وأنه لا يخلو منه مكان ، كما قال تعالى : ( ولا أدنى من ذلك ولا أكثر إلا هو معهم أين ما كانوا ) [ المجادلة : 7 ] قالوا : ثم نسخ ذلك بالفرض الذي فرض عليهم التوجه إلى المسجد الحرام .\nهكذا قال ، وفي قوله : \" وإنه تعالى لا يخلو منه مكان \" : إن أراد علمه تعالى فصحيح ; فإن علمه تعالى محيط بجميع المعلومات ، وأما ذاته تعالى فلا تكون محصورة في شيء من خلقه ، تعالى الله عن ذلك علوا كبيرا .\nقال ابن جرير : وقال آخرون : بل نزلت هذه الآية على رسول الله صلى الله عليه وسلم إذنا من الله أن يصلي التطوع حيث توجه من شرق أو غرب ، في مسيره في سفره ، وفي حال المسايفة وشدة الخوف .\nحدثنا أبو كريب ، حدثنا ابن إدريس ، حدثنا عبد الملك هو ابن أبي سليمان عن سعيد بن جبير ، عن ابن عمر : أنه كان يصلي حيث توجهت به راحلته . ويذكر أن رسول الله صلى الله عليه وسلم كان يفعل ذلك ، ويتأول هذه الآية : ( فأينما تولوا فثم وجه الله )\nورواه مسلم والترمذي والنسائي وابن أبي حاتم وابن مردويه ، من طرق ، عن عبد الملك بن أبي سليمان ، به . وأصله في الصحيحين من حديث ابن عمر وعامر بن ربيعة ، من غير ذكر الآية .\nوفي صحيح البخاري من حديث نافع ، عن ابن عمر : أنه كان إذا سئل عن صلاة الخوف وصفها . ثم قال : فإن كان خوف أشد من ذلك صلوا رجالا قياما على أقدامهم ، وركبانا مستقبلي القبلة وغير مستقبليها .\nقال نافع : ولا أرى ابن عمر ذكر ذلك إلا عن النبي صلى الله عليه وسلم .\nمسألة : ولم يفرق الشافعي في المشهور عنه ، بين سفر المسافة وسفر العدوى ، فالجميع عنه يجوز التطوع فيه على الراحلة ، وهو قول أبي حنيفة خلافا لمالك وجماعته ، واختار أبو يوسف وأبو سعيد الإصطخري ، التطوع على الدابة في المصر ، وحكاه أبو يوسف عن أنس بن مالك ، رضي الله عنه ، واختاره أبو جعفر الطبري ، حتى للماشي أيضا .\nقال ابن جرير : وقال آخرون : بل نزلت هذه الآية في قوم عميت عليهم القبلة ، فلم يعرفوا شطرها ، فصلوا على أنحاء مختلفة ، فقال الله لي المشارق والمغارب فأين وليتم وجوهكم فهنالك وجهي ، وهو قبلتكم ، فيعلمكم بذلك أن صلاتكم ماضية .\nحدثنا أحمد بن إسحاق الأهوازي ، حدثنا أبو أحمد الزبيري ، حدثنا أبو الربيع السمان ، عن عاصم بن عبيد الله ، عن عبد الله بن عامر بن ربيعة ، عن أبيه ، قال : كنا مع رسول الله صلى الله عليه وسلم في ليلة سوداء مظلمة ، فنزلنا منزلا فجعل الرجل يأخذ الأحجار فيعمل مسجدا يصلي فيه . فلما [ أن ] أصبحنا إذا نحن قد صلينا على غير القبلة . فقلنا : يا رسول الله ، لقد صلينا ليلتنا هذه لغير القبلة ؟ فأنزل الله تعالى : ( ولله المشرق والمغرب فأينما تولوا فثم وجه الله إن الله واسع عليم ) الآية .\nثم رواه عن سفيان بن وكيع ، عن أبيه ، عن أبي الربيع السمان ، بنحوه .\nورواه الترمذي ، عن محمود بن غيلان ، عن وكيع . وابن ماجه ، عن يحيى بن حكيم ، عن أبي داود ، عن أبي الربيع السمان .\nورواه ابن أبي حاتم ، عن الحسن بن محمد بن الصباح ، عن سعيد بن سليمان ، عن أبي الربيع السمان واسمه أشعث بن سعيد البصري وهو ضعيف الحديث .\nوقال الترمذي : هذا حديث حسن . ليس إسناده بذاك ، ولا نعرفه إلا من حديث أشعث السمان ، وأشعث يضعف في الحديث .\nقلت : وشيخه عاصم أيضا ضعيف .\nقال البخاري : منكر الحديث . وقال ابن معين : ضعيف لا يحتج به . وقال ابن حبان : متروك ، والله أعلم .\nوقد روي من طرق أخرى ، عن جابر .\nوقال الحافظ أبو بكر بن مردويه في تفسير هذه الآية : حدثنا إسماعيل بن علي بن إسماعيل ، حدثنا الحسن بن علي بن شبيب ، حدثني أحمد بن عبيد الله بن الحسن ، قال : وجدت في كتاب أبي : حدثنا عبد الملك العرزمي ، عن عطاء ، عن جابر ، قال : بعث رسول الله صلى الله عليه وسلم سرية كنت فيها ، فأصابتنا ظلمة فلم نعرف القبلة ، فقالت طائفة منا : قد عرفنا القبلة ، هي هاهنا قبل السماك . فصلوا وخطوا خطوطا ، فلما أصبحوا وطلعت الشمس أصبحت تلك الخطوط لغير القبلة . فلما قفلنا من سفرنا سألنا النبي صلى الله عليه وسلم ، فسكت ، وأنزل الله تعالى : ( ولله المشرق والمغرب فأينما تولوا فثم وجه الله )\nثم رواه من حديث محمد بن عبيد الله العرزمي ، عن عطاء ، عن جابر ، به .\nوقال الدارقطني : قرئ على عبد الله بن عبد العزيز وأنا أسمع حدثكم داود بن عمرو ، حدثنا محمد بن يزيد الواسطي ، عن محمد بن سالم ، عن عطاء ، عن جابر ، قال : كنا مع رسول الله صلى الله عليه وسلم في مسير فأصابنا غيم ، فتحيرنا فاختلفنا في القبلة ، فصلى كل منا على حدة ، وجعل أحدنا يخط بين يديه لنعلم أمكنتنا ، فذكرنا ذلك للنبي صلى الله عليه وسلم فلم يأمرنا بالإعادة ، وقال : \" قد أجزأت صلاتكم \" .\nثم قال الدارقطني : كذا قال : عن محمد بن سالم ، وقال غيره : عن محمد بن عبد الله العرزمي ، عن عطاء ، وهما ضعيفان .\nثم رواه ابن مردويه أيضا من حديث الكلبي ، عن أبي صالح ، عن ابن عباس : أن رسول الله صلى الله عليه وسلم بعث سرية فأخذتهم ضبابة ، فلم يهتدوا إلى القبلة ، فصلوا لغير القبلة . ثم استبان لهم بعد طلوع الشمس أنهم صلوا لغير القبلة . فلما جاءوا إلى رسول الله صلى الله عليه وسلم حدثوه ، فأنزل الله عز وجل ، هذه الآية : ( ولله المشرق والمغرب فأينما تولوا فثم وجه الله )\nوهذه الأسانيد فيها ضعف ، ولعله يشد بعضها بعضا . وأما إعادة الصلاة لمن تبين له خطؤه ففيها قولان للعلماء ، وهذه دلائل على عدم القضاء ، والله أعلم .\nقال ابن جرير : وقال آخرون : بل نزلت هذه الآية في سبب النجاشي ، كما حدثنا محمد بن بشار ، حدثنا هشام بن معاذ حدثني أبي ، عن قتادة : أن النبي صلى الله عليه وسلم قال : \" إن أخا لكم قد مات فصلوا عليه \" . قالوا : نصلي على رجل ليس بمسلم ؟ قال : فنزلت : ( وإن من أهل الكتاب لمن يؤمن بالله وما أنزل إليكم وما أنزل إليهم خاشعين لله ) [ آل عمران : 199 ] قال قتادة : فقالوا : فإنه كان لا يصلي إلى القبلة . فأنزل الله : ( ولله المشرق والمغرب فأينما تولوا فثم وجه الله ) .\nوهذا غريب والله أعلم .\nوقد قيل : إنه كان يصلي إلى بيت المقدس قبل أن يبلغه الناسخ إلى الكعبة ، كما حكاه القرطبي عن قتادة ، وذكر القرطبي أنه لما مات صلى عليه رسول الله صلى الله عليه وسلم فأخذ بذلك من ذهب إلى الصلاة على الغائب ، قال : وهذا خاص عند أصحابنا من ثلاثة أوجه : أحدها : أنه عليه السلام ، شاهده حين صلى عليه طويت له الأرض . الثاني : أنه لما لم يكن عنده من يصلي عليه صلى عليه ، واختاره ابن العربي ، قال القرطبي : ويبعد أن يكون ملك مسلم ليس عنده أحد من قومه على دينه ، وقد أجاب ابن العربي عن هذا لعلهم لم يكن عندهم شرعية الصلاة على الميت . وهذا جواب جيد . الثالث : أنه عليه الصلاة والسلام إنما صلى عليه ليكون ذلك كالتأليف لبقية الملوك ، والله أعلم .\nوقد أورد الحافظ أبو بكر بن مردويه في تفسير هذه الآية من حديث أبي معشر ، عن محمد بن عمرو بن علقمة ، عن أبي سلمة ، عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم : \" ما بين المشرق والمغرب قبلة لأهل المدينة وأهل الشام وأهل العراق \" .\nوله مناسبة هاهنا ، وقد أخرجه الترمذي وابن ماجه من حديث أبي معشر ، واسمه نجيح بن عبد الرحمن السندي المدني ، به \" ما بين المشرق والمغرب قبلة \" .\nوقال الترمذي : وقد روي من غير وجه عن أبي هريرة . وتكلم بعض أهل العلم في أبي معشر من قبل حفظه ، ثم قال الترمذي : حدثني الحسن بن [ أبي ] بكر المروزي ، حدثنا المعلى بن منصور ، حدثنا عبد الله بن جعفر المخزومي ، عن عثمان بن محمد الأخنسي ، عن سعيد المقبري ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم قال : \" ما بين المشرق والمغرب قبلة \" .\nثم قال الترمذي : هذا حديث حسن صحيح .\nوحكى عن البخاري أنه قال : هذا أقوى من حديث أبي معشر وأصح . قال الترمذي : وقد روي عن غير واحد من الصحابة : ما بين المشرق والمغرب قبلة منهم عمر بن الخطاب ، وعلي ، وابن عباس .\nوقال ابن عمر : إذا جعلت المغرب عن يمينك والمشرق عن يسارك ، فما بينهما قبلة ، إذا استقبلت القبلة .\nثم قال ابن مردويه : حدثنا علي بن أحمد بن عبد الرحمن ، حدثنا يعقوب بن يونس مولى بني هاشم ، حدثنا شعيب بن أيوب ، حدثنا ابن نمير ، عن عبيد الله بن عمر ، عن نافع ، عن ابن عمر ، عن النبي صلى الله عليه وسلم ، قال : \" ما بين المشرق والمغرب قبلة \" .\nوقد رواه الدارقطني والبيهقي وقال المشهور : عن ابن عمر ، عن عمر ، قوله .\nقال ابن جرير : ويحتمل : فأينما تولوا وجوهكم في دعائكم لي فهنالك وجهي أستجيب لكم دعاءكم ، كما حدثنا القاسم ، حدثنا الحسين ، حدثني حجاج ، قال : قال ابن جريج : قال مجاهد : لما نزلت : ( ادعوني أستجب لكم ) [ غافر : 60 ] قالوا : إلى أين ؟ فنزلت : ( فأينما تولوا فثم وجه الله )\nقال ابن جرير : ويعني قوله : ( إن الله واسع عليم ) يسع خلقه كلهم بالكفاية ، والإفضال والجود .\nوأما قوله : ( عليم ) فإنه يعني : عليم بأعمالهم ، ما يغيب عنه منها شيء ، ولا يعزب عن علمه ، بل هو بجميعها عليم .\n                                    ",
        "qortoby": "وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ ٥١١\n                                    \n                                    \n                                    قوله تعالى : ولله المشرق والمغرب فأينما تولوا فثم وجه الله إن الله واسع عليم فيه خمس مسائل :\n                                     الأولى : قوله تعالى : ولله المشرق والمغرب المشرق موضع الشروق . والمغرب موضع الغروب ، أي هما له ملك وما بينهما من الجهات والمخلوقات بالإيجاد والاختراع ، كما تقدم . وخصهما بالذكر والإضافة إليه تشريفا ، نحو بيت الله ، وناقة الله ، ولأن سبب الآية اقتضى ذلك ، على ما يأتي\nالثانية : قوله تعالى : فأينما تولوا شرط ، ولذلك حذفت النون ، و \" أين \" العاملة ، و \" ما \" زائدة ، والجواب فثم وجه الله . وقرأ الحسن تولوا بفتح التاء واللام ، والأصل تتولوا . وثم في موضع نصب على الظرف ، ومعناها البعد ، إلا أنها مبنية على الفتح غير معربة لأنها مبهمة ، تكون بمنزلة هناك للبعد ، فإن أردت القرب قلت هنا .\nالثالثة : اختلف العلماء في المعنى الذي نزلت فيه فأينما تولوا على خمسة أقوال : فقال عبد الله بن عامر بن ربيعة : نزلت فيمن صلى إلى غير القبلة في ليلة مظلمة ، أخرجه الترمذي عنه عن أبيه قال : كنا مع النبي صلى الله عليه وسلم في سفر في ليلة مظلمة فلم ندر أين القبلة ، فصلى كل رجل منا على حياله ، فلما أصبحنا ذكرنا ذلك للنبي صلى الله عليه وسلم فنزلت : فأينما تولوا فثم وجه الله . قال أبو عيسى : هذا حديث ليس إسناده بذاك ، لا نعرفه إلا من حديث أشعث السمان ، وأشعث بن سعيد أبو الربيع يضعف في الحديث . وقد ذهب أكثر أهل العلم إلى هذا ، قالوا : إذا صلى في الغيم لغير القبلة ثم استبان له بعد ذلك أنه صلى لغير القبلة فإن صلاته جائزة ، وبه يقول سفيان وابن المبارك وأحمد وإسحاق .\nقلت : وهو قول أبي حنيفة ومالك ، غير أن مالكا قال : تستحب له الإعادة في الوقت ، وليس ذلك بواجب عليه ; لأنه قد أدى فرضه على ما أمر ، والكمال يستدرك في الوقت ، استدلالا بالسنة فيمن صلى وحده ثم أدرك تلك الصلاة في وقتها في جماعة أنه يعيد معهم ، ولا يعيد في الوقت استحبابا إلا من استدبر القبلة أو شرق أو غرب جدا مجتهدا ، وأما من تيامن أو تياسر قليلا مجتهدا فلا إعادة عليه في وقت ولا غيره . وقال المغيرة والشافعي : لا يجزيه ; لأن القبلة شرط من شروط الصلاة . وما قاله مالك أصح ; لأن جهة القبلة تبيح الضرورة تركها في المسايفة ، وتبيحها أيضا الرخصة حالة السفر . وقال ابن عمر : نزلت في المسافر يتنفل حيثما توجهت به راحلته . أخرجه مسلم عنه ، قال : كان رسول الله صلى الله عليه وسلم يصلي وهو مقبل من مكة إلى المدينة على راحلته حيث كان وجهه ، قال : وفيه نزلت فأينما تولوا فثم وجه الله . ولا خلاف بين العلماء في جواز النافلة على الراحلة لهذا الحديث وما كان مثله . ولا يجوز لأحد أن يدع القبلة عامدا بوجه من الوجوه إلا في شدة الخوف ، على ما يأتي .\nواختلف قول مالك في المريض يصلي على محمله ، فمرة قال : لا يصلي على ظهر البعير فريضة وإن اشتد مرضه . قال سحنون : فإن فعل أعاد ، حكاه الباجي . ومرة قال : إن كان ممن لا يصلي بالأرض إلا إيماء فليصل على البعير بعد أن يوقف له ويستقبل القبلة وأجمعوا على أنه لا يجوز لأحد صحيح أن يصلي فريضة إلا بالأرض إلا في الخوف الشديد خاصة ، على ما يأتي بيانه .\nواختلف الفقهاء في المسافر سفرا لا تقصر في مثله الصلاة ، فقال مالك وأصحابه والثوري : لا يتطوع على الراحلة إلا في سفر تقصر في مثله الصلاة ، قالوا : لأن الأسفار التي حكي عن رسول الله صلى الله عليه وسلم أنه كان يتطوع فيها كانت مما تقصر فيه الصلاة . وقال الشافعي وأبو حنيفة وأصحابهما والحسن بن حي والليث بن سعد وداود بن علي : يجوز التطوع على الراحلة خارج المصر في كل سفر ، وسواء كان مما تقصر فيه الصلاة أو لا ; لأن الآثار ليس فيها تخصيص سفر من سفر ، فكل سفر جائز ذلك فيه ، إلا أن يخص شيء من الأسفار بما يجب التسليم له . وقال أبو يوسف : يصلي في المصر على الدابة بالإيماء ، لحديث يحيى بن سعيد عن أنس بن مالك أنه صلى على حمار في أزقة المدينة يومئ إيماء . وقال الطبري : يجوز لكل راكب وماش حاضرا كان أو مسافرا أن يتنفل على دابته وراحلته وعلى رجليه [ بالإيماء ] . وحكي عن بعض أصحاب الشافعي أن مذهبهم جواز التنفل على الدابة في الحضر والسفر . وقال الأثرم : قيل لأحمد بن حنبل الصلاة على الدابة في الحضر ، فقال : أما في السفر فقد سمعت ، وما سمعت في الحضر . قال ابن القاسم : من تنفل في محمله تنفل جالسا ، قيامه تربع ، يركع واضعا يديه على ركبتيه ثم يرفع رأسه . وقال قتادة : نزلت في النجاشي ، وذلك أنه لما مات دعا النبي صلى الله عليه وسلم المسلمين إلى الصلاة عليه خارج المدينة ، فقالوا : كيف نصلي على رجل مات ؟ وهو يصلي لغير قبلتنا ، وكان النجاشي ملك الحبشة - واسمه أصحمة وهو بالعربية عطية - يصلي إلى بيت المقدس حتى مات ، وقد صرفت القبلة إلى الكعبة فنزلت الآية ، ونزل فيه : وإن من أهل الكتاب لمن يؤمن بالله فكان هذا عذرا للنجاشي ، وكانت صلاة النبي صلى الله عليه وسلم بأصحابه سنة تسع من الهجرة . وقد استدل بهذا من أجاز الصلاة على الغائب ، وهو الشافعي . قال ابن العربي : ومن أغرب مسائل الصلاة على الميت ما قال الشافعي : يصلى على الغائب ، وقد كنت ببغداد في مجلس الإمام فخر الإسلام فيدخل عليه الرجل من خراسان فيقول له : كيف حال فلان ؟ فيقول له : مات ، فيقول : إنا لله وإنا إليه راجعون\nثم يقول لنا : قوموا فلأصل لكم ، فيقوم فيصلي عليه بنا ، وذلك بعد ستة أشهر من المدة ، وبينه وبين بلده ستة أشهر .\nوالأصل عندهم في ذلك صلاة النبي صلى الله عليه وسلم على النجاشي . وقال علماؤنا رحمة الله عليهم : النبي صلى الله عليه وسلم بذلك مخصوص لثلاثة أوجه :\nأحدها : أن الأرض دحيت له جنوبا وشمالا حتى رأى نعش النجاشي كما دحيت له شمالا وجنوبا حتى رأى المسجد الأقصى . وقال المخالف : وأي فائدة في رؤيته ، وإنما الفائدة في لحوق بركته .\nالثاني : أن النجاشي لم يكن له هناك ولي من المؤمنين يقوم بالصلاة عليه . قال المخالف : هذا محال عادة ! ملك على دين لا يكون له أتباع ، والتأويل بالمحال محال .\nالثالث : أن النبي صلى الله عليه وسلم إنما أراد بالصلاة على النجاشي إدخال الرحمة عليه واستئلاف بقية الملوك بعده إذا رأوا الاهتمام به حيا وميتا . قال المخالف : بركة الدعاء من النبي صلى الله عليه وسلم ومن سواه تلحق الميت باتفاق . قال ابن العربي : والذي عندي في صلاة النبي صلى الله عليه وسلم على النجاشي أنه علم أن النجاشي ومن آمن معه ليس عندهم من سنة الصلاة على الميت أثر ، فعلم أنهم سيدفنونه بغير صلاة فبادر إلى الصلاة عليه .\nقلت : والتأويل الأول أحسن ; لأنه إذا رآه فما صلى على غائب وإنما صلى على مرئي حاضر ، والغائب ما لا يرى . والله تعالى أعلم .\nالقول الرابع : قال ابن زيد : كانت اليهود قد استحسنت صلاة النبي صلى الله عليه وسلم إلى بيت المقدس وقالوا : ما اهتدى إلا بنا ، فلما حول إلى الكعبة قالت اليهود : ما ولاهم عن قبلتهم التي كانوا عليها ، فنزلت : ولله المشرق والمغرب فوجه النظم على هذا القول : أن اليهود لما أنكروا أمر القبلة بين الله تعالى أن له أن يتعبد عباده بما شاء ، فإن شاء أمرهم بالتوجه إلى بيت المقدس ، وإن شاء أمرهم بالتوجه إلى الكعبة ، فعل لا حجة عليه ولا يسأل عما يفعل وهم يسألون .\nالقول الخامس : أن الآية منسوخة بقوله : وحيثما كنتم فولوا وجوهكم شطره ذكره ابن عباس ، فكأنه كان يجوز في الابتداء أن يصلي المرء كيف شاء ثم نسخ ذلك . وقال قتادة : الناسخ قوله تعالى : فول وجهك شطر المسجد الحرام أي تلقاءه ، حكاه أبو عيسى الترمذي .\nالقول السادس : روي عن مجاهد والضحاك أنها محكمة ، المعنى : أينما كنتم من شرق وغرب فثم وجه الله الذي أمرنا باستقباله وهو الكعبة . وعن مجاهد أيضا وابن جبير لما نزلت : ادعوني أستجب لكم قالوا : إلى أين ؟ فنزلت : فأينما تولوا فثم وجه الله . وعن ابن عمر والنخعي : أينما تولوا في أسفاركم ومنصرفاتكم فثم وجه الله . وقيل : هي متصلة بقوله تعالى : ومن أظلم ممن منع مساجد الله أن يذكر فيها اسمه الآية ، فالمعنى أن بلاد الله أيها المؤمنون تسعكم ، فلا يمنعكم تخريب من خرب مساجد الله أن تولوا وجوهكم نحو قبلة الله أينما كنتم من أرضه . وقيل : نزلت حين صد النبي صلى الله عليه وسلم عن البيت عام الحديبية فاغتم المسلمون لذلك . فهذه عشرة أقوال .\nومن جعلها منسوخة فلا اعتراض عليه من جهة كونها خبرا ; لأنها محتملة لمعنى الأمر . يحتمل أن يكون معنى فأينما تولوا فثم وجه الله : ولوا وجوهكم نحو وجه الله ، وهذه الآية هي التي تلا سعيد بن جبير رحمه الله لما أمر الحجاج بذبحه إلى الأرض .\nالرابعة : اختلف الناس في تأويل الوجه المضاف إلى الله تعالى في القرآن والسنة ، فقال الحذاق : ذلك راجع إلى الوجود ، والعبارة عنه بالوجه من مجاز الكلام ، إذ كان الوجه أظهر الأعضاء في الشاهد وأجلها قدرا . وقال ابن فورك : قد تذكر صفة الشيء والمراد بها الموصوف توسعا ، كما يقول القائل : رأيت علم فلان اليوم ، ونظرت إلى علمه ، وإنما يريد بذلك رأيت العالم ونظرت إلى العالم ، كذلك إذا ذكر الوجه هنا ، والمراد من له الوجه ، أي الوجود . وعلى هذا يتأول قوله تعالى : إنما نطعمكم لوجه الله لأن المراد به : لله الذي له الوجه ، وكذلك قوله : إلا ابتغاء وجه ربه الأعلى أي الذي له الوجه . قال ابن عباس : الوجه عبارة عنه عز وجل ، كما قال : ويبقى وجه ربك ذو الجلال والإكرام . وقال بعض الأئمة : تلك صفة ثابتة بالسمع زائدة على ما توجبه العقول من صفات القديم تعالى . قال ابن عطية : وضعف أبو المعالي هذا القول ، وهو كذلك ضعيف ، وإنما المراد وجوده . وقيل : المراد بالوجه هنا الجهة التي وجهنا إليها أي القبلة . وقيل : الوجه القصد ، كما قال الشاعر :\nأستغفر الله ذنبا لست محصيه رب العباد إليه الوجه والعمل\nوقيل : المعنى فثم رضا الله وثوابه ، كما قال : إنما نطعمكم لوجه الله أي لرضائه وطلب ثوابه ، ومنه قوله صلى الله عليه وسلم : من بنى مسجدا يبتغي به وجه الله بنى الله له مثله في الجنة .\nوقوله : يجاء يوم القيامة بصحف مختمة فتنصب بين يدي الله تعالى فيقول عز وجل لملائكته ألقوا هذا واقبلوا هذا فتقول الملائكة وعزتك يا ربنا ما رأينا إلا خيرا وهو أعلم فيقول إن هذا كان لغير وجهي ولا أقبل من العمل إلا ما ابتغي به وجهي أي خالصا لي ، خرجه الدارقطني . وقيل : المراد فثم الله ، والوجه صلة ، وهو كقوله : وهو معكم . قاله الكلبي والقتبي ، ونحوه قول المعتزلة .\nالخامسة : قوله تعالى : إن الله واسع عليم أي يوسع على عباده في دينهم ، ولا يكلفهم ما ليس في وسعهم . وقيل : واسع بمعنى أنه يسع علمه كل شيء ، كما قال : وسع كل شيء علما . وقال الفراء : الواسع هو الجواد الذي يسع عطاؤه كل شيء ، دليله قوله تعالى : ورحمتي وسعت كل شيء . وقيل : واسع المغفرة أي لا يتعاظمه ذنب . وقيل : متفضل على العباد وغني عن أعمالهم ، يقال : فلان يسع ما يسأل ، أي لا يبخل ، قال الله تعالى : لينفق ذو سعة من سعته أي لينفق الغني مما أعطاه الله . وقد أتينا عليه في الكتاب \" الأسنى \" والحمد لله .\n                                    ",
        "saadi": "وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ ٥١١\n                                        \n                                        \n                                        \n                                        أي: { وَلِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ } خصهما بالذكر, لأنهما محل الآيات العظيمة, فهما مطالع الأنوار ومغاربها، فإذا كان مالكا لها, كان مالكا لكل الجهات. { فَأَيْنَمَا تُوَلُّوا } وجوهكم من الجهات, إذا كان توليكم إياها بأمره, إما أن يأمركم باستقبال الكعبة بعد أن كنتم مأمورين باستقبال بيت المقدس, أو تؤمرون بالصلاة في السفر على الراحلة ونحوها, فإن القبلة حيثما توجه العبد أو تشتبه القبلة, فيتحرى الصلاة إليها, ثم يتبين له الخطأ, أو يكون معذورا بصلب أو مرض ونحو ذلك، فهذه الأمور, إما أن يكون العبد فيها معذورا أو مأمورا. وبكل حال, فما استقبل جهة من الجهات, خارجة عن ملك ربه. { فَثَمَّ وَجْهُ اللَّهِ إِنَّ اللَّهَ وَاسِعٌ عَلِيمٌ } فيه إثبات الوجه لله تعالى, على الوجه اللائق به تعالى, وأن لله وجها لا تشبهه الوجوه, وهو - تعالى - واسع الفضل والصفات عظيمها, عليم بسرائركم ونياتكم. فمن سعته وعلمه, وسع لكم الأمر, وقبل منكم المأمور, فله الحمد والشكر.\n                                    "
      },
      "originalText": "وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ ٥١١"
    },
    {
      "number": 123,
      "text": "وَقَالُوا اتَّخَذَ اللَّهُ وَلَدًا ۗ سُبْحَانَهُ ۖ بَلْ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ كُلٌّ لَهُ قَانِتُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 116,
      "juz": 1,
      "manzil": 1,
      "page": 18,
      "ruku": 15,
      "hizbQuarter": 7,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗاۗ سُبۡحَٰنَهُۥۖ بَل لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ ٦١١\n                                    \n                                    \n                                    اشتملت هذه الآية الكريمة ، والتي تليها على الرد على النصارى عليهم لعائن الله وكذا من أشبههم من اليهود ومن مشركي العرب ، ممن جعل الملائكة بنات الله ، فأكذب الله جميعهم في دعواهم وقولهم : إن لله ولدا . فقال تعالى : ( سبحانه ) أي : تعالى وتقدس وتنزه عن ذلك علوا كبيرا ( بل له ما في السماوات والأرض ) أي : ليس الأمر كما افتروا ، وإنما له ملك السماوات والأرض ، وهو المتصرف فيهم ، وهو خالقهم ورازقهم ، ومقدرهم ومسخرهم ، ومسيرهم ومصرفهم ، كما يشاء ، والجميع عبيد له وملك له ، فكيف يكون له ولد منهم ، والولد إنما يكون متولدا من شيئين متناسبين ، وهو تبارك وتعالى ليس له نظير ، ولا مشارك في عظمته وكبريائه ولا صاحبة له ، فكيف يكون له ولد ! كما قال تعالى : ( بديع السماوات والأرض أنى يكون له ولد ولم تكن له صاحبة وخلق كل شيء وهو بكل شيء عليم ) [ الأنعام : 101 ] وقال تعالى : ( وقالوا اتخذ الرحمن ولدا لقد جئتم شيئا إدا تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا أن دعوا للرحمن ولدا وما ينبغي للرحمن أن يتخذ ولدا إن كل من في السماوات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا ) [ مريم : 88 - 95 ] وقال تعالى : ( قل هو الله أحد الله الصمد لم يلد ولم يولد ولم يكن له كفوا أحد ) [ سورة الإخلاص ] .\nفقرر تعالى في هذه الآيات الكريمة أنه السيد العظيم ، الذي لا نظير له ولا شبيه له ، وأن جميع الأشياء غيره مخلوقة له مربوبة ، فكيف يكون له منها ولد ! ولهذا قال البخاري في تفسير هذه الآية من البقرة : أخبرنا أبو اليمان ، أخبرنا شعيب ، عن عبد الله بن أبي حسين ، حدثنا نافع بن جبير هو ابن مطعم عن ابن عباس ، عن النبي صلى الله عليه وسلم قال : \" قال الله تعالى : كذبني ابن آدم ولم يكن له ذلك ، وشتمني ولم يكن له ذلك ، فأما تكذيبه إياي فيزعم أني لا أقدر أن أعيده كما كان ، وأما شتمه إياي فقوله : لي ولد . فسبحاني أن أتخذ صاحبة أو ولدا \" .\nانفرد به البخاري من هذا الوجه .\nوقال ابن مردويه : حدثنا أحمد بن كامل ، حدثنا محمد بن إسماعيل الترمذي ، حدثنا إسحاق بن محمد الفروي ، حدثنا مالك ، عن أبي الزناد ، عن الأعرج ، عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم : \" يقول الله عز وجل : كذبني ابن آدم ولم ينبغ له أن يكذبني ، وشتمني ولم ينبغ له أن يشتمني ، أما تكذيبه إياي فقوله : لن يعيدني كما بدأني . وليس أول الخلق بأهون علي من إعادته . وأما شتمه إياي فقوله : اتخذ الله ولدا . وأنا الله الأحد الصمد ، لم يلد ولم يولد ، ولم يكن له كفوا أحد \" .\nوفي الصحيحين عن رسول الله صلى الله عليه وسلم أنه قال : \" لا أحد أصبر على أذى سمعه من الله ; إنهم يجعلون له ولدا ، وهو يرزقهم ويعافيهم \" .\nوقوله : ( كل له قانتون ) قال ابن أبي حاتم : أخبرنا أبو سعيد الأشج ، حدثنا أسباط ، عن مطرف ، عن عطية ، عن ابن عباس ، قال : ( قانتين ) مصلين .\nوقال عكرمة وأبو مالك : ( كل له قانتون ) مقرون له بالعبودية . وقال سعيد بن جبير : ( كل له قانتون ) يقول : الإخلاص . وقال الربيع بن أنس : يقول كل له قائم يوم القيامة . وقال السدي : ( كل له قانتون ) يقول : له مطيعون يوم القيامة .\nوقال خصيف ، عن مجاهد : ( كل له قانتون ) قال : مطيعون ، كن إنسانا فكان ، وقال : كن حمارا فكان .\nوقال ابن أبي نجيح ، عن مجاهد : ( كل له قانتون ) مطيعون ، يقول : طاعة الكافر في سجود ظله وهو كاره .\nوهذا القول عن مجاهد وهو اختيار ابن جرير يجمع الأقوال كلها ، وهو أن القنوت : هو الطاعة والاستكانة إلى الله ، وذلك شرعي وقدري ، كما قال تعالى : ( ولله يسجد من في السماوات والأرض طوعا وكرها وظلالهم بالغدو والآصال ) [ الرعد : 15 ] .\nوقد ورد حديث فيه بيان القنوت في القرآن ما هو المراد به ، كما قال ابن أبي حاتم : حدثنا يونس بن عبد الأعلى ، حدثنا ابن وهب ، أخبرني عمرو بن الحارث : أن دراجا أبا السمح حدثه ، عن أبي الهيثم ، عن أبي سعيد الخدري ، عن رسول الله صلى الله عليه وسلم قال : \" كل حرف من القرآن يذكر فيه القنوت فهو الطاعة \" .\nوكذا رواه الإمام أحمد ، عن حسن بن موسى ، عن ابن لهيعة ، عن دراج بإسناده ، مثله .\nولكن هذا الإسناد ضعيف لا يعتمد عليه . ورفع هذا الحديث منكر ، وقد يكون من كلام الصحابي أو من دونه ، والله أعلم . وكثيرا ما يأتي بهذا الإسناد تفاسير فيها نكارة ، فلا يغتر بها ، فإن السند ضعيف ، والله أعلم .\n                                    ",
        "qortoby": "وَقَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗاۗ سُبۡحَٰنَهُۥۖ بَل لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ ٦١١\n                                    \n                                    \n                                    قوله تعالى : وقالوا اتخذ الله ولدا سبحانه بل له ما في السماوات والأرض كل له قانتون\nفيه خمس مسائل :\nالأولى : قوله تعالى : وقالوا اتخذ الله ولدا هذا إخبار عن النصارى في قولهم : المسيح ابن الله . وقيل عن اليهود في قولهم : عزير ابن الله . وقيل عن كفرة العرب في قولهم : الملائكة بنات الله . وقد جاء مثل هذه الأخبار عن الجهلة الكفار في [ مريم ] و [ الأنبياء ] .\nالثانية : قوله تعالى : سبحانه بل له الآية . خرج البخاري عن ابن عباس عن النبي صلى الله عليه وسلم قال : قال الله تعالى كذبني ابن آدم ولم يكن له ذلك وشتمني ولم يكن له ذلك فأما تكذيبه إياي فزعم أني لا أقدر أن أعيده كما كان ، وأما شتمه إياي فقوله لي ولد فسبحاني أن أتخذ صاحبة أو ولدا .\nالثالثة : سبحان منصوب على المصدر ، ومعناه التبرئة والتنزيه والمحاشاة ، من قولهم : اتخذ الله ولدا ، بل هو الله تعالى واحد في ذاته ، أحد في صفاته ، لم يلد فيحتاج إلى صاحبة ، أنى يكون له ولد ولم تكن له صاحبة وخلق كل شيء ولم يولد فيكون مسبوقا ، جل وتعالى عما يقول الظالمون والجاحدون علوا كبيرا ! بل له ما في السماوات والأرض ما رفع بالابتداء والخبر في المجرور ، أي كل ذلك له ملك بالإيجاد والاختراع . والقائل بأنه اتخذ ولدا داخل في جملة السماوات والأرض . وقد تقدم أن معنى سبحان الله : براءة الله من السوء .\nالرابعة : لا يكون الولد إلا من جنس الوالد ، فكيف يكون للحق سبحانه أن يتخذ ولدا من مخلوقاته وهو لا يشبهه شيء ، وقد قال : إن كل من في السماوات والأرض إلا آتي الرحمن عبدا ، كما قال هنا : بل له ما في السماوات والأرض فالولدية تقتضي الجنسية والحدوث ، والقدم يقتضي الوحدانية والثبوت ، فهو سبحانه القديم الأزلي الواحد الأحد ، الفرد الصمد ، الذي لم يلد ولم يولد ولم يكن له كفوا أحد . ثم إن البنوة تنافي الرق والعبودية . - على ما يأتي بيانه في سورة \" مريم \" إن شاء الله تعالى - فكيف يكون ولد عبدا هذا محال ، وما أدى إلى المحال محال .\nالخامسة : قوله تعالى : كل له قانتون ابتداء وخبر ، والتقدير كلهم ، ثم حذف الهاء والميم . قانتون أي مطيعون وخاضعون ، فالمخلوقات كلها تقنت لله ، أي تخضع وتطيع . والجمادات قنوتهم في ظهور الصنعة عليهم وفيهم . فالقنوت الطاعة ، والقنوت السكوت ، ومنه قول زيد بن أرقم : كنا نتكلم في الصلاة ، يكلم الرجل صاحبه إلى جنبه حتى نزلت : وقوموا لله قانتين فأمرنا بالسكوت ونهينا عن الكلام . والقنوت : الصلاة ، قال الشاعر :\nقانتا لله يتلو كتبه وعلى عمد من الناس اعتزل\nوقال السدي وغيره في قوله : كل له قانتون أي يوم القيامة . الحسن : كل قائم بالشهادة أنه عبده . والقنوت في اللغة أصله القيام ، ومنه الحديث : أفضل الصلاة طول القنوت قاله الزجاج . فالخلق قانتون ، أي قائمون بالعبودية إما إقرارا وإما أن يكونوا على خلاف ذلك ، فأثر الصنعة بين عليهم . وقيل : أصله الطاعة ، ومنه قوله تعالى : والقانتين والقانتات . وسيأتي لهذا مزيد بيان عند قوله تعالى : وقوموا لله قانتين .\n                                    ",
        "saadi": "وَقَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗاۗ سُبۡحَٰنَهُۥۖ بَل لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ ٦١١\n                                        \n                                        \n                                        \n                                        { وَقَالُوا } أي: اليهود والنصارى والمشركون, وكل من قال ذلك: { اتَّخَذَ اللَّهُ وَلَدًا } فنسبوه إلى ما لا يليق بجلاله, وأساءوا كل الإساءة, وظلموا أنفسهم. وهو - تعالى - صابر على ذلك منهم, قد حلم عليهم, وعافاهم, ورزقهم مع تنقصهم إياه. { سُبْحَانَهُ } أي: تنزه وتقدس عن كل ما وصفه به المشركون والظالمون مما لا يليق بجلاله، فسبحان من له الكمال المطلق, من جميع الوجوه, الذي لا يعتريه نقص بوجه من الوجوه. ومع رده لقولهم, أقام الحجة والبرهان على تنزيهه عن ذلك فقال: { بَلْ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ } أي: جميعهم ملكه وعبيده, يتصرف فيهم تصرف المالك بالمماليك, وهم قانتون له مسخرون تحت تدبيره، فإذا كانوا كلهم عبيده, مفتقرين إليه, وهو غني عنهم, فكيف يكون منهم أحد, يكون له ولدا, والولد لا بد أن يكون من جنس والده, لأنه جزء منه. والله تعالى المالك القاهر, وأنتم المملوكون المقهورون, وهو الغني وأنتم الفقراء، فكيف مع هذا, يكون له ولد؟ هذا من أبطل الباطل وأسمجه. والقنوت نوعان: قنوت عام: وهو قنوت الخلق كلهم, تحت تدبير الخالق، وخاص: وهو قنوت العبادة. فالنوع الأول كما في هذه الآية، والنوع الثاني: كما في قوله تعالى: { وَقُومُوا لِلَّهِ قَانِتِينَ }\n                                    "
      },
      "originalText": "وَقَالُواْ ٱتَّخَذَ ٱللَّهُ وَلَدٗاۗ سُبۡحَٰنَهُۥۖ بَل لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ ٦١١"
    },
    {
      "number": 124,
      "text": "بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ ۖ وَإِذَا قَضَىٰ أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 117,
      "juz": 1,
      "manzil": 1,
      "page": 18,
      "ruku": 15,
      "hizbQuarter": 7,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ ٧١١\n                                    \n                                    \n                                    وقوله تعالى : ( بديع السماوات والأرض ) أي : خالقهما على غير مثال سبق ، قال مجاهد والسدي : وهو مقتضى اللغة ، ومنه يقال للشيء المحدث : بدعة . كما جاء في الصحيح لمسلم : \" فإن كل محدثة بدعة [ وكل بدعة ضلالة ] \" . والبدعة على قسمين : تارة تكون بدعة شرعية ، كقوله : فإن كل محدثة بدعة ، وكل بدعة ضلالة . وتارة تكون بدعة لغوية ، كقول أمير المؤمنين عمر بن الخطاب رضي الله عنه عن جمعه إياهم على صلاة التراويح واستمرارهم : نعمت البدعة هذه .\nوقال ابن جرير : وبديع السماوات والأرض : مبدعهما . وإنما هو مفعل فصرف إلى فعيل ، كما صرف المؤلم إلى الأليم ، والمسمع إلى السميع . ومعنى المبدع : المنشئ والمحدث ما لم يسبقه إلى إنشاء مثله وإحداثه أحد .\nقال : ولذلك سمي المبتدع في الدين مبتدعا ; لإحداثه فيه ما لم يسبق إليه غيره ، وكذلك كل محدث فعلا أو قولا لم يتقدمه فيه متقدم ، فإن العرب تسميه مبتدعا . ومن ذلك قول أعشى ثعلبة ، في مدح هوذة بن علي الحنفي :\nيدعى إلى قول سادات الرجال إذا أبدوا له الحزم أو ما شاءه ابتدعا\nأي : يحدث ما شاء .\nقال ابن جرير : فمعنى الكلام : فسبحان الله أنى يكون لله ولد ، وهو مالك ما في السماوات والأرض ، تشهد له جميعها بدلالتها عليه بالوحدانية ، وتقر له بالطاعة ، وهو بارئها وخالقها وموجدها من غير أصل ولا مثال احتذاها عليه . وهذا إعلام من الله عباده أن ممن يشهد له بذلك المسيح ، الذي أضافوا إلى الله بنوته ، وإخبار منه لهم أن الذي ابتدع السماوات والأرض من غير أصل وعلى غير مثال ، هو الذي ابتدع المسيح عيسى من غير والد بقدرته .\nوهذا من ابن جرير ، رحمه الله ، كلام جيد وعبارة صحيحة .\nوقوله تعالى : ( وإذا قضى أمرا فإنما يقول له كن فيكون ) يبين بذلك تعالى كمال قدرته وعظيم سلطانه ، وأنه إذا قدر أمرا وأراد كونه ، فإنما يقول له : كن . أي : مرة واحدة ، فيكون ، أي : فيوجد على وفق ما أراد ، كما قال تعالى : ( إنما أمره إذا أراد شيئا أن يقول له كن فيكون ) [ يس : 82 ] وقال تعالى : ( إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون ) [ النحل : 40 ] وقال تعالى : ( وما أمرنا إلا واحدة كلمح بالبصر ) [ القمر : 50 ] ، وقال الشاعر :\nإذا ما أراد الله أمرا فإنما يقول له كن قولة فيكون\nونبه تعالى بذلك أيضا على أن خلق عيسى بكلمة : كن ، فكان كما أمره الله ، قال [ الله ] تعالى : ( إن مثل عيسى عند الله كمثل آدم خلقه من تراب ثم قال له كن فيكون ) [ آل عمران : 59 ] .\n                                    ",
        "qortoby": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ ٧١١\n                                    \n                                    \n                                    قوله تعالى : بديع السماوات والأرض وإذا قضى أمرا فإنما يقول له كن فيكون فيه ست مسائل : الأولى : قوله تعالى : بديع السماوات والأرض فعيل للمبالغة ، وارتفع على خبر ابتداء محذوف ، واسم الفاعل مبدع ، كبصير من مبصر . أبدعت الشيء لا عن مثال ، فالله عز وجل بديع السماوات والأرض ، أي منشئها وموجدها ومبدعها ومخترعها على غير حد ولا مثال . وكل من أنشأ ما لم يسبق إليه قيل له مبدع ، ومنه أصحاب البدع . وسميت البدعة بدعة لأن قائلها ابتدعها من غير فعل أو مقال إمام ، وفي البخاري ( ونعمت البدعة هذه ) يعني قيام رمضان .\nالثانية : كل بدعة صدرت من مخلوق فلا يجوز أن يكون لها أصل في الشرع أولا ، فإن كان لها أصل كانت واقعة تحت عموم ما ندب الله إليه وخص رسوله عليه ، فهي في حيز المدح . وإن لم يكن مثاله موجودا كنوع من الجود والسخاء وفعل المعروف ، فهذا فعله من الأفعال المحمودة ، وإن لم يكن الفاعل قد سبق إليه . ويعضد هذا قول عمر رضي الله عنه : نعمت البدعة هذه ، لما كانت من أفعال الخير وداخلة في حيز المدح ، وهي وإن كان النبي صلى الله عليه وسلم قد صلاها إلا أنه تركها ولم يحافظ عليها ، ولا جمع الناس عليها ، فمحافظة عمر رضي الله عنه عليها ، وجمع الناس لها ، وندبهم إليها ، بدعة لكنها بدعة محمودة ممدوحة . وإن كانت في خلاف ما أمر الله به ورسوله فهي في حيز الذم والإنكار ، قال معناه الخطابي وغيره .\nقلت : وهو معنى قوله صلى الله عليه وسلم في خطبته : وشر الأمور محدثاتها وكل بدعة ضلالة يريد ما لم يوافق كتابا أو سنة ، أو عمل الصحابة رضي الله عنهم ، وقد بين هذا بقوله : من سن في الإسلام سنة حسنة كان له أجرها وأجر من عمل بها من بعده من غير أن ينقص من أجورهم شيء ومن سن في الإسلام سنة سيئة كان عليه وزرها ووزر من عمل بها من بعده من غير أن ينقص من أوزارهم شيء . وهذا إشارة إلى ما ابتدع من قبيح وحسن ، وهو أصل هذا الباب ، وبالله العصمة والتوفيق ، لا رب غيره .\nالثالثة : قوله تعالى : وإذا قضى أمرا فإنما يقول له كن فيكون أي إذا أراد إحكامه وإتقانه - كما سبق في علمه - قال له كن . قال ابن عرفة : قضاء الشيء إحكامه وإمضاؤه والفراغ منه ، ومنه سمي القاضي ، لإنه إذا حكم فقد فرغ مما بين الخصمين . وقال الأزهري : قضى في اللغة على وجوه ، مرجعها إلى انقطاع الشيء وتمامه ، قال أبو ذؤيب :\nوعليهما مسرودتان قضاهما داود أو صنع السوابغ تبع\nوقال الشماخ في عمر بن الخطاب رضي الله عنه :\nقضيت أمورا ثم غادرت بعدها بوائق في أكمامها لم تفتق\nقال علماؤنا : \" قضى \" لفظ مشترك ، يكون بمعنى الخلق ، قال الله تعالى : فقضاهن سبع سماوات في يومين أي خلقهن . ويكون بمعنى الإعلام ، قال الله تعالى : وقضينا إلى بني إسرائيل في الكتاب أي أعلمنا . ويكون بمعنى الأمر ، كقوله تعالى : وقضى ربك ألا تعبدوا إلا إياه . ويكون بمعنى الإلزام وإمضاء الأحكام ، ومنه سمي الحاكم قاضيا . ويكون بمعنى توفية الحق ، قال الله تعالى : فلما قضى موسى الأجل . ويكون بمعنى الإرادة ، كقوله تعالى : فإذا قضى أمرا فإنما يقول له كن فيكون أي إذا أراد خلق شيء . قال ابن عطية : قضى معناه قدر ، وقد يجيء بمعنى أمضى ، ويتجه في هذه الآية المعنيان على مذهب أهل السنة قدر في الأزل وأمضى فيه . وعلى مذهب المعتزلة أمضى عند الخلق والإيجاد .\nالرابعة : قوله تعالى : أمرا الأمر واحد الأمور ، وليس بمصدر أمر يأمر . قال علماؤنا : والأمر في القرآن يتصرف على أربعة عشر وجها :\nالأول : الدين ، قال الله تعالى : حتى جاء الحق وظهر أمر الله يعني دين الله الإسلام .\nالثاني : القول ، ومنه قوله تعالى : \" فإذا جاء أمرنا \" يعني قولنا ، وقوله : فتنازعوا أمرهم بينهم يعني قولهم .\nالثالث : العذاب ، ومنه قوله تعالى : لما قضي الأمر يعني لما وجب العذاب بأهل النار .\nالرابع : عيسى عليه السلام ، قال الله تعالى : إذا قضى أمرا يعني عيسى ، وكان في علمه أن يكون من غير أب .\nالخامس : القتل ببدر ، قال الله تعالى : فإذا جاء أمر الله يعني القتل ببدر ، وقوله تعالى : ليقضي الله أمرا كان مفعولا يعني قتل كفار مكة .\nالسادس : فتح مكة ، قال الله تعالى : فتربصوا حتى يأتي الله بأمره يعني فتح مكة .\nالسابع : قتل قريظة وجلاء بني النضير ، قال الله تعالى : فاعفوا واصفحوا حتى يأتي الله بأمره .\nالثامن : القيامة ، قال الله تعالى : أتى أمر الله .\nالتاسع : القضاء ، قال الله تعالى : يدبر الأمر يعني القضاء .\nالعاشر : الوحي ، قال الله تعالى : يدبر الأمر من السماء إلى الأرض يقول : ينزل الوحي من السماء إلى الأرض ، وقوله : يتنزل الأمر بينهن يعني الوحي .\nالحادي عشر : أمر الخلق ، قال الله تعالى : ألا إلى الله تصير الأمور يعني أمور الخلائق .\nالثاني عشر : النصر ، قال الله تعالى : يقولون هل لنا من الأمر من شيء يعنون النصر ، قل إن الأمر كله لله يعني النصر .\nالثالث عشر : الذنب ، قال الله تعالى : فذاقت وبال أمرها يعني جزاء ذنبها .\nالرابع عشر : الشأن والفعل ، قال الله تعالى : وما أمر فرعون برشيد أي فعله وشأنه ، وقال : فليحذر الذين يخالفون عن أمره أي فعله .\nالخامسة : قوله تعالى : كن قيل : الكاف من كينونه ، والنون من نوره ، وهي المراد بقوله عليه السلام : أعوذ بكلمات الله التامات من شر ما خلق . ويروى : ( بكلمة الله التامة ) على الإفراد . فالجمع لما كانت هذه الكلمة في الأمور كلها ، فإذا قال لكل أمر كن ، ولكل شيء كن ، فهن كلمات . يدل على هذا ما روي عن أبي ذر عن النبي صلى الله عليه وسلم فيما يحكى عن الله تعالى : عطائي كلام وعذابي كلام . خرجه الترمذي في حديث فيه طول . والكلمة على الإفراد بمعنى الكلمات أيضا ، لكن لما تفرقت الكلمة الواحدة في الأمور في الأوقات صارت كلمات ومرجعهن إلى كلمة واحدة . وإنما قيل \" تامة \" لأن أقل الكلام عند أهل اللغة على ثلاثة أحرف : حرف مبتدأ ، وحرف تحشى به الكلمة ، وحرف يسكت عليه . وإذا كان على حرفين فهو عندهم منقوص ، كيد ودم وفم ، وإنما نقص لعلة . فهي من الآدميين من المنقوصات لأنها على حرفين ، ولأنها كلمة ملفوظة بالأدوات . ومن ربنا تبارك وتعالى تامة ; لأنها بغير الأدوات ، تعالى عن شبه المخلوقين .\nالسادسة : قوله تعالى : فيكون قرئ برفع النون على الاستئناف . قال سيبويه . فهو يكون ، أو فإنه يكون . وقال غيره : هو معطوف على يقول ، فعلى الأول كائنا بعد الأمر ، وإن كان معدوما فإنه بمنزلة الموجود إذا هو عنده معلوم ، على ما يأتي بيانه . وعلى الثاني كائنا مع الأمر ، واختاره الطبري وقال : أمره للشيء ب كن لا يتقدم الوجود ولا يتأخر عنه ، فلا يكون الشيء مأمورا بالوجود إلا وهو موجود بالأمر ، ولا موجودا إلا وهو مأمور بالوجود ، على ما يأتي بيانه . قال : ونظيره قيام الناس من قبورهم لا يتقدم دعاء الله ولا يتأخر عنه ، كما قال ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون . وضعف ابن عطية هذا القول وقال : هو خطأ من جهة المعنى ; لأنه يقتضي أن القول مع التكوين والوجود .\nوتلخيص المعتقد في هذه الآية : أن الله عز وجل لم يزل آمرا للمعدومات بشرط وجودها ، قادرا مع تأخر المقدورات ، عالما مع تأخر المعلومات . فكل ما في الآية يقتضي الاستقبال فهو بحسب المأمورات ، إذ المحدثات تجيء بعد أن لم تكن . وكل ما يسند إلى الله تعالى من قدرة وعلم فهو قديم ولم يزل . والمعنى الذي تقتضيه عبارة كن : هو قديم قائم بالذات .\nوقال أبو الحسن الماوردي فإن قيل : ففي أي حال يقول له كن فيكون ؟ أفي حال عدمه ، أم في حال وجوده ؟ فإن كان في حال عدمه استحال أن يأمر إلا مأمورا ، كما يستحيل أن يكون الأمر إلا من آمر ، وإن كان في حال وجوده فتلك حال لا يجوز أن يأمر فيها بالوجود والحدوث ; لأنه موجود حادث ؟ قيل عن هذا السؤال أجوبة ثلاثة :\nأحدها : أنه خبر من الله تعالى عن نفوذ أوامره في خلقه الموجود ، كما أمر في بني إسرائيل أن يكونوا قردة خاسئين ، ولا يكون هذا واردا في إيجاد المعدومات .\nالثاني : أن الله عز وجل عالم هو كائن قبل كونه ، فكانت الأشياء التي لم تكن وهي كائنة بعلمه قبل كونها مشابهة للتي هي موجودة ، فجاز أن يقول لها : كوني . ويأمرها بالخروج من حال العدم إلى حال الوجود ، لتصور جميعها له ولعلمه بها في حال العدم .\nالثالث : أن ذلك خبر من الله تعالى عام عن جميع ما يحدثه ويكونه إذا أراد خلقه وإنشاءه كان ، ووجد من غير أن يكون هناك قول يقوله ، وإنما هو قضاء يريده ، فعبر عنه بالقول وإن لم يكن قولا ، كقول أبي النجم :\nقد قالت الأنساع للبطن الحق\nولا قول هناك ، وإنما أراد أن الظهر قد لحق بالبطن ، وكقول عمرو بن حممة الدوسي :\nفأصبحت مثل النسر طارت فراخه إذا رام تطيارا يقال له قع\nوكما قال الآخر :\nقالت جناحاه لساقيه الحقا ونجيا لحمكما أن يمزقا\n                                    ",
        "saadi": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ ٧١١\n                                        \n                                        \n                                        \n                                        ثم قال: { بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ } أي: خالقهما على وجه قد أتقنهما وأحسنهما على غير مثال سبق. { وَإِذَا قَضَى أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُ } فلا يستعصى عليه, ولا يمتنع منه.\n                                    "
      },
      "originalText": "بَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَإِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ ٧١١"
    },
    {
      "number": 125,
      "text": "وَقَالَ الَّذِينَ لَا يَعْلَمُونَ لَوْلَا يُكَلِّمُنَا اللَّهُ أَوْ تَأْتِينَا آيَةٌ ۗ كَذَٰلِكَ قَالَ الَّذِينَ مِنْ قَبْلِهِمْ مِثْلَ قَوْلِهِمْ ۘ تَشَابَهَتْ قُلُوبُهُمْ ۗ قَدْ بَيَّنَّا الْآيَاتِ لِقَوْمٍ يُوقِنُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 118,
      "juz": 1,
      "manzil": 1,
      "page": 18,
      "ruku": 15,
      "hizbQuarter": 7,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ لَوۡلَا يُكَلِّمُنَا ٱللَّهُ أَوۡ تَأۡتِينَآ ءَايَةٞۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبۡلِهِم مِّثۡلَ قَوۡلِهِمۡۘ تَشَٰبَهَتۡ قُلُوبُهُمۡۗ قَدۡ بَيَّنَّا ٱلۡأٓيَٰتِ لِقَوۡمٖ يُوقِنُونَ ٨١١\n                                    \n                                    \n                                    قال محمد بن إسحاق : حدثني محمد بن أبي محمد ، عن عكرمة أو سعيد بن جبير ، عن ابن عباس ، قال : قال رافع بن حريملة لرسول الله صلى الله عليه وسلم : يا محمد ، إن كنت رسولا من الله كما تقول ، فقل لله فليكلمنا حتى نسمع كلامه . فأنزل الله في ذلك من قوله : ( وقال الذين لا يعلمون لولا يكلمنا الله أو تأتينا آية )\nوقال مجاهد [ في قوله ] ) وقال الذين لا يعلمون لولا يكلمنا الله أو تأتينا آية ) قال : النصارى تقوله .\nوهو اختيار ابن جرير ، قال : لأن السياق فيهم . وفي ذلك نظر .\n[ وحكى القرطبي ( لولا يكلمنا الله ) أي : لو يخاطبنا بنبوتك يا محمد ، قلت : وظاهر السياق أعم ، والله أعلم ] .\nوقال أبو العالية ، والربيع بن أنس ، وقتادة ، والسدي في تفسير هذه الآية : هذا قول كفار العرب ( كذلك قال الذين من قبلهم [ مثل قولهم ] ) قالوا : هم اليهود والنصارى . ويؤيد هذا القول ، وأن القائلين ذلك هم مشركو العرب ، قوله تعالى : ( وإذا جاءتهم آية قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله الله أعلم حيث يجعل رسالته سيصيب الذين أجرموا صغار عند الله وعذاب شديد بما كانوا يمكرون ) [ الأنعام : 123 ] .\nوقوله تعالى : ( وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا أو تكون لك جنة من نخيل وعنب فتفجر الأنهار خلالها تفجيرا أو تسقط السماء كما زعمت علينا كسفا أو تأتي بالله والملائكة قبيلا أو يكون لك بيت من زخرف أو ترقى في السماء ولن نؤمن لرقيك حتى تنزل علينا كتابا نقرؤه قل سبحان ربي هل كنت إلا بشرا رسولا ) [ الإسراء : 90 ، 93 ] ، وقوله تعالى : ( وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا لقد استكبروا في أنفسهم وعتوا عتوا كبيرا ) [ الفرقان : 21 ] ، وقوله : ( بل يريد كل امرئ منهم أن يؤتى صحفا منشرة ) [ المدثر : 52 ] إلى غير ذلك من الآيات الدالة على كفر مشركي العرب وعتوهم وعنادهم وسؤالهم ما لا حاجة لهم به ، إنما هو الكفر والمعاندة ، كما قال من قبلهم من الأمم الخالية من أهل الكتابين وغيرهم ، كما قال تعالى : ( يسألك أهل الكتاب أن تنزل عليهم كتابا من السماء فقد سألوا موسى أكبر من ذلك فقالوا أرنا الله جهرة ) [ النساء : 153 ] وقال تعالى : ( وإذ قلتم ياموسى لن نؤمن لك حتى نرى الله جهرة ) [ البقرة : 55 ] .\nوقوله : ( تشابهت قلوبهم ) أي : أشبهت قلوب مشركي العرب قلوب من تقدمهم في الكفر والعناد والعتو ، كما قال تعالى : ( كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون أتواصوا به بل هم قوم طاغون ) [ الذاريات : 52 ، 53 ] .\nوقوله : ( قد بينا الآيات لقوم يوقنون ) أي : قد وضحنا الدلالات على صدق الرسل بما لا يحتاج معها إلى سؤال آخر وزيادة أخرى ، لمن أيقن وصدق واتبع الرسل ، وفهم ما جاءوا به عن الله تبارك وتعالى . وأما من ختم الله على قلبه وجعل على بصره غشاوة فأولئك الذين قال الله تعالى فيهم : ( إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم ) [ يونس : 96 ، 97 ] .\n                                    ",
        "qortoby": "وَقَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ لَوۡلَا يُكَلِّمُنَا ٱللَّهُ أَوۡ تَأۡتِينَآ ءَايَةٞۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبۡلِهِم مِّثۡلَ قَوۡلِهِمۡۘ تَشَٰبَهَتۡ قُلُوبُهُمۡۗ قَدۡ بَيَّنَّا ٱلۡأٓيَٰتِ لِقَوۡمٖ يُوقِنُونَ ٨١١\n                                    \n                                    \n                                    قوله تعالى : وقال الذين لا يعلمون لولا يكلمنا الله أو تأتينا آية كذلك قال الذين من قبلهم مثل قولهم تشابهت قلوبهم قد بينا الآيات لقوم يوقنون\nقوله تعالى : وقال الذين لا يعلمون قال ابن عباس : هم اليهود . مجاهد : النصارى ، ورجحه الطبري ، لأنهم المذكورون في الآية أولا . وقال الربيع والسدي وقتادة : مشركو العرب . ولولا بمعنى \" هلا \" تحضيض ، كما قال الأشهب بن رميلة :\nتعدون عقر النيب أفضل مجدكم بني ضوطرى لولا الكمي المقنعا\nوليست هذه \" لولا \" التي تعطي منع الشيء لوجود غيره ، والفرق بينهما عند علماء اللسان أن \" لولا \" بمعنى التحضيض لا يليها إلا الفعل مظهرا أو مقدرا ، والتي للامتناع يليها الابتداء ، وجرت العادة بحذف الخبر . ومعنى الكلام هلا يكلمنا الله بنبوة محمد صلى الله عليه وسلم فنعلم أنه نبي فنؤمن به ، أو يأتينا بآية تكون علامة على نبوته . والآية : الدلالة والعلامة ، وقد تقدم والذين من قبلهم اليهود والنصارى في قول من جعل الذين لا يعلمون كفار العرب ، أو الأمم السالفة في قول من جعل الذين لا يعلمون اليهود والنصارى ، أو اليهود في قول من جعل الذين لا يعلمون النصارى .\nتشابهت قلوبهم\nقيل : في التعنيت والاقتراح وترك الإيمان . وقال الفراء . تشابهت قلوبهم في اتفاقهم على الكفر . قد بينا الآيات لقوم يوقنون تقدم .\n                                    ",
        "saadi": "وَقَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ لَوۡلَا يُكَلِّمُنَا ٱللَّهُ أَوۡ تَأۡتِينَآ ءَايَةٞۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبۡلِهِم مِّثۡلَ قَوۡلِهِمۡۘ تَشَٰبَهَتۡ قُلُوبُهُمۡۗ قَدۡ بَيَّنَّا ٱلۡأٓيَٰتِ لِقَوۡمٖ يُوقِنُونَ ٨١١\n                                        \n                                        \n                                        \n                                        أي: قال الجهلة من أهل الكتاب وغيرهم: هلا يكلمنا, كما كلم الرسل، { أَوْ تَأْتِينَا آيَةٌ } يعنون آيات الاقتراح, التي يقترحونها بعقولهم الفاسدة, وآرائهم الكاسدة, التي تجرأوا بها على الخالق, واستكبروا على رسله كقولهم: { لَنْ نُؤْمِنَ لَكَ حَتَّى نَرَى اللَّهَ جَهْرَةً } { يَسْأَلُكَ أَهْلُ الْكِتَابِ أَنْ تُنَزِّلَ عَلَيْهِمْ كِتَابًا مِنَ السَّمَاءِ فَقَدْ سَأَلُوا مُوسَى أَكْبَرَ مِنْ ذَلِكَ } الآية، وقالوا: { لَوْلَا أُنْزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُ نَذِيرًا أَوْ يُلْقَى إِلَيْهِ كَنْزٌ أَوْ تَكُونُ لَهُ جَنَّةٌ } الآيات وقوله: { وَقَالُوا لَنْ نُؤْمِنَ لَكَ حَتَّى تَفْجُرَ لَنَا مِنَ الْأَرْضِ يَنْبُوعًا } الآيات. فهذا دأبهم مع رسلهم, يطلبون آيات التعنت, لا آيات الاسترشاد, ولم يكن قصدهم تبين الحق، فإن الرسل, قد جاءوا من الآيات, بما يؤمن بمثله البشر, ولهذا قال تعالى: { قَدْ بَيَّنَّا الْآيَاتِ لِقَوْمٍ يُوقِنُونَ } فكل موقن, فقد عرف من آيات الله الباهرة, وبراهينه الظاهرة, ما حصل له به اليقين, واندفع عنه كل شك وريب.\n                                    "
      },
      "originalText": "وَقَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ لَوۡلَا يُكَلِّمُنَا ٱللَّهُ أَوۡ تَأۡتِينَآ ءَايَةٞۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبۡلِهِم مِّثۡلَ قَوۡلِهِمۡۘ تَشَٰبَهَتۡ قُلُوبُهُمۡۗ قَدۡ بَيَّنَّا ٱلۡأٓيَٰتِ لِقَوۡمٖ يُوقِنُونَ ٨١١"
    },
    {
      "number": 126,
      "text": "إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا ۖ وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 119,
      "juz": 1,
      "manzil": 1,
      "page": 18,
      "ruku": 15,
      "hizbQuarter": 7,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّآ أَرۡسَلۡنَٰكَ بِٱلۡحَقِّ بَشِيرٗا وَنَذِيرٗاۖ وَلَا تُسۡ‍َٔلُ عَنۡ أَصۡحَٰبِ ٱلۡجَحِيمِ ٩١١\n                                    \n                                    \n                                    قال ابن أبي حاتم : حدثنا أبي ، حدثنا عبد الرحمن بن صالح ، حدثنا عبد الرحمن بن محمد بن عبيد الله الفزاري عن شيبان النحوي ، أخبرني قتادة ، عن عكرمة ، عن ابن عباس ، عن النبي صلى الله عليه وسلم قال : \" أنزلت علي : ( إنا أرسلناك بالحق بشيرا ونذيرا ) قال : \" بشيرا بالجنة ، ونذيرا من النار \" .\nوقوله : ( ولا تسأل عن أصحاب الجحيم ) قراءة أكثرهم ) ولا تسأل ) بضم التاء على الخبر . وفي قراءة أبي بن كعب : \" وما تسأل \" وفي قراءة ابن مسعود : \" ولن تسأل عن أصحاب الجحيم \"\nنقلهما ابن جرير ، أي : لا نسألك عن كفر من كفر بك ، ( فإنما عليك البلاغ وعلينا الحساب ) [ الرعد : 40 ] وكقوله تعالى : ( فذكر إنما أنت مذكر لست عليهم بمصيطر ) الآية [ الغاشية : 21 ، 22 ] وكقوله تعالى : ( نحن أعلم بما يقولون وما أنت عليهم بجبار فذكر بالقرآن من يخاف وعيد ) [ ق : 45 ] وأشباه ذلك من الآيات .\nوقرأ آخرون \" ولا تسأل عن أصحاب الجحيم \" بفتح التاء على النهي ، أي : لا تسأل عن حالهم ، كما قال عبد الرزاق :\nأخبرنا الثوري ، عن موسى بن عبيدة ، عن محمد بن كعب القرظي ، قال : قال رسول الله صلى الله عليه وسلم : \" ليت شعري ما فعل أبواي ، ليت شعري ما فعل أبواي ، ليت شعري ما فعل أبواي ؟ \" . فنزلت : ( ولا تسأل عن أصحاب الجحيم ) فما ذكرهما حتى توفاه الله ، عز وجل .\nورواه ابن جرير ، عن أبي كريب ، عن وكيع ، عن موسى بن عبيدة ، [ وقد تكلموا فيه عن محمد بن كعب ] بمثله . وقد حكاه القرطبي عن ابن عباس ومحمد بن كعب قال القرطبي : وهذا كما يقال : لا تسأل عن فلان ; أي : قد بلغ فوق ما تحسب ، وقد ذكرنا في التذكرة أن الله أحيا له أبويه حتى آمنا ، وأجبنا عن قوله : ( إن أبي وأباك في النار ) . ( قلت ) : والحديث المروي في حياة أبويه عليه السلام ليس في شيء من الكتب الستة ولا غيرها ، وإسناده ضعيف والله أعلم .\nثم قال [ ابن جرير ] وحدثني القاسم ، حدثنا الحسين ، حدثني حجاج ، عن ابن جريج ، أخبرني داود بن أبي عاصم : أن النبي صلى الله عليه وسلم قال ذات يوم : \" أين أبواي ؟ \" . فنزلت : ( إنا أرسلناك بالحق بشيرا ونذيرا ولا تسأل عن أصحاب الجحيم ) .\nوهذا مرسل كالذي قبله . وقد رد ابن جرير هذا القول المروي عن محمد بن كعب [ القرظي ] وغيره في ذلك ، لاستحالة الشك من الرسول صلى الله عليه وسلم في أمر أبويه . واختار القراءة الأولى . وهذا الذي سلكه هاهنا فيه نظر ، لاحتمال أن هذا كان في حال استغفاره لأبويه قبل أن يعلم أمرهما ، فلما علم ذلك تبرأ منهما ، وأخبر عنهما أنهما من أهل النار [ كما ثبت ذلك في الصحيح ] ولهذا أشباه كثيرة ونظائر ، ولا يلزم ما ذكر ابن جرير . والله أعلم .\nوقال الإمام أحمد : حدثنا موسى بن داود ، حدثنا فليح بن سليمان ، عن هلال بن علي ، عن عطاء بن يسار ، قال : لقيت عبد الله بن عمرو بن العاص ، فقلت : أخبرني عن صفة رسول الله صلى الله عليه وسلم في التوراة . فقال : أجل ، والله إنه لموصوف في التوراة بصفته في القرآن : يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا ، وحرزا للأميين ، وأنت عبدي ورسولي ، سميتك المتوكل ، لا فظ ولا غليظ ولا سخاب في الأسواق ، ولا يدفع بالسيئة السيئة ولكن يعفو ويغفر ، ولن يقبضه حتى يقيم به الملة العوجاء ، بأن يقولوا : لا إله إلا الله . فيفتح به أعينا عميا ، وآذانا صما ، وقلوبا غلفا .\nانفرد بإخراجه البخاري ، فرواه في البيوع عن محمد بن سنان ، عن فليح ، به . وقال : تابعه عبد العزيز بن أبي سلمة ، عن هلال . وقال سعيد : عن هلال ، عن عطاء ، عن عبد الله بن سلام . ورواه في التفسير عن عبد الله ، عن عبد العزيز بن أبي سلمة ، عن هلال ، عن عطاء ، عن عبد الله بن عمرو بن العاص ، به . فذكر نحوه ، فعبد الله هذا هو ابن صالح ، كما صرح به في كتاب الأدب . وزعم أبو مسعود الدمشقي أنه عبد الله بن رجاء .\nوقد رواه الحافظ أبو بكر بن مردويه في تفسير هذه الآية من البقرة ، عن أحمد بن الحسن بن أيوب ، عن محمد بن أحمد بن البراء ، عن المعافى بن سليمان ، عن فليح ، به . وزاد : قال عطاء : ثم لقيت كعب الأحبار ، فسألته فما اختلفا في حرف ، إلا أن كعبا قال بلغته : أعينا عمومى ، وآذانا صمومى ، وقلوبا غلوفا\n                                    ",
        "qortoby": "إِنَّآ أَرۡسَلۡنَٰكَ بِٱلۡحَقِّ بَشِيرٗا وَنَذِيرٗاۖ وَلَا تُسۡ‍َٔلُ عَنۡ أَصۡحَٰبِ ٱلۡجَحِيمِ ٩١١\n                                    \n                                    \n                                    قوله تعالى : إنا أرسلناك بالحق بشيرا ونذيرا ولا تسأل عن أصحاب الجحيم\nقوله تعالى : إنا أرسلناك بالحق بشيرا نصب على الحال ، ونذيرا عطف عليه ، قد تقدم معناهما . ولا تسأل عن أصحاب الجحيم قال مقاتل : إن النبي صلى الله عليه وسلم قال : لو أنزل الله بأسه باليهود لآمنوا ، فأنزل الله تعالى : ولا تسأل عن أصحاب الجحيم برفع تسأل ، وهي قراءة الجمهور ، ويكون في موضع الحال بعطفه على بشيرا ونذيرا . والمعنى إنا أرسلناك بالحق بشيرا ونذيرا غير مسئول . وقال سعيد الأخفش : ولا تسأل ( بفتح التاء وضم اللام ) ، ويكون في موضع الحال عطفا على بشيرا ونذيرا . والمعنى : إنا أرسلناك بالحق بشيرا ونذيرا غير سائل عنهم ، لأن علم الله بكفرهم بعد إنذارهم يغني عن سؤاله عنهم . هذا معنى غير سائل . ومعنى غير مسئول لا يكون مؤاخذا بكفر من كفر بعد التبشير والإنذار . وقال ابن عباس ومحمد بن كعب : إن رسول الله صلى الله عليه وسلم قال ذات يوم : ليت شعري ما فعل أبواي . فنزلت هذه الآية ، وهذا على قراءة من قرأ \" ولا تسأل \" جزما على النهي ، وهي قراءة نافع وحده ، وفيه وجهان :\nأحدهما : أنه نهي عن السؤال عمن عصى وكفر من الأحياء ; لأنه قد يتغير حاله فينتقل عن الكفر إلى الإيمان ، وعن المعصية إلى الطاعة .\nوالثاني : وهو الأظهر ، أنه نهي عن السؤال عمن مات على كفره ومعصيته ، تعظيما لحاله وتغليظا لشأنه ، وهذا كما يقال : لا تسأل عن فلان ! أي قد بلغ فوق ما تحسب . وقرأ ابن مسعود \" ولن تسأل \" . وقرأ أبي \" وما تسأل \" ، ومعناهما موافق لقراءة الجمهور ، نفى أن يكون مسئولا عنهم . وقيل : إنما سأل أي أبويه أحدث موتا ، فنزلت . وقد ذكرنا في كتاب \" التذكرة \" أن الله تعالى أحيا له أباه وأمه وآمنا به ، وذكرنا قوله عليه السلام للرجل : ( إن أبي وأباك في النار ) وبينا ذلك ، والحمد لله .\n                                    ",
        "saadi": "إِنَّآ أَرۡسَلۡنَٰكَ بِٱلۡحَقِّ بَشِيرٗا وَنَذِيرٗاۖ وَلَا تُسۡ‍َٔلُ عَنۡ أَصۡحَٰبِ ٱلۡجَحِيمِ ٩١١\n                                        \n                                        \n                                        \n                                        ثم ذكر تعالى بعض آية موجزة مختصرة جامعة للآيات الدالة على صدقه صلى الله عليه وسلم وصحة ما جاء به فقال: { إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا } فهذا مشتمل على الآيات التي جاء بها, وهي ترجع إلى ثلاثة أمور: الأول: في نفس إرساله, والثاني: في سيرته وهديه ودله، والثالث: في معرفة ما جاء به من القرآن والسنة. فالأول والثاني, قد دخلا في قوله: { إِنَّا أَرْسَلْنَاكَ } والثالث دخل في قوله: { بِالْحَقِّ } وبيان الأمر الأول وهو - نفس إرساله - أنه قد علم حالة أهل الأرض قبل بعثته صلى الله عليه وسلم وما كانوا عليه من عبادة الأوثان والنيران, والصلبان, وتبديلهم للأديان, حتى كانوا في ظلمة من الكفر, قد عمتهم وشملتهم, إلا بقايا من أهل الكتاب, قد انقرضوا قبيل البعثة. وقد علم أن الله تعالى لم يخلق خلقه سدى, ولم يتركهم هملا, لأنه حكيم عليم, قدير رحيم، فمن حكمته ورحمته بعباده, أن أرسل إليهم هذا الرسول العظيم, يأمرهم بعبادة الرحمن وحده لا شريك له, فبمجرد رسالته يعرف العاقل صدقه, وهو آية كبيرة على أنه رسول الله، وأما الثاني: فمن عرف النبي صلى الله عليه وسلم معرفة تامة, وعرف سيرته وهديه قبل البعثة, ونشوءه على أكمل الخصال, ثم من بعد ذلك, قد ازدادت مكارمه وأخلاقه العظيمة الباهرة للناظرين, فمن عرفها, وسبر أحواله, عرف أنها لا تكون إلا أخلاق الأنبياء الكاملين, لأن الله تعالى جعل الأوصاف أكبر دليل على معرفة أصحابها وصدقهم وكذبهم. وأما الثالث: فهو معرفة ما جاء به صلى الله عليه وسلم من الشرع العظيم, والقرآن الكريم, المشتمل على الإخبارات الصادقة, والأوامر الحسنة, والنهي عن كل قبيح, والمعجزات الباهرة, فجميع الآيات تدخل في هذه الثلاثة. قوله: { بَشِيرًا } أي لمن أطاعك بالسعادة الدنيوية والأخروية، { نَذِيرًا } لمن عصاك بالشقاوة والهلاك الدنيوي والأخروي. { وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ } أي: لست مسئولا عنهم, إنما عليك البلاغ, وعلينا الحساب.\n                                    "
      },
      "originalText": "إِنَّآ أَرۡسَلۡنَٰكَ بِٱلۡحَقِّ بَشِيرٗا وَنَذِيرٗاۖ وَلَا تُسۡ‍َٔلُ عَنۡ أَصۡحَٰبِ ٱلۡجَحِيمِ ٩١١"
    }
  ]
}