{
  "number": 183,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 1206,
      "text": "وَأَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ ۖ وَاصْبِرُوا ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 46,
      "juz": 10,
      "manzil": 2,
      "page": 183,
      "ruku": 151,
      "hizbQuarter": 73,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ ٦٤\n                                    \n                                    \n                                    أمرهم أن يطيعوا الله ورسوله في حالهم ذلك فما أمرهم الله تعالى به ائتمروا.\nوما نهاهم عنه انزجروا ولا يتنازعوا فيما بينهم أيضا فيختلفوا فيكون سببا لتخاذلهم وفشلهم \"وتذهب ريحكم\" أي قوتكم وحدتكم وما كنتم فيه من الإقبال \"واصبروا إن الله مع الصابرين\" وقد كان للصحابة رضي الله عنهم في باب الشجاعة والإئتمار بما أمرهم الله ورسوله به وامتثال ما أرشدهم إليه ما لم يكن لأحد من الأمم والقرون قبلهم ولا يكون لأحد ممن بعدهم فإنهم ببركة الرسول صلى الله عليه وآله وسلم وطاعته فيما أمرهم فتحوا القلوب والأقاليم شرقا وغربا في المدة اليسيرة مع قلة عددهم بالنسبة إلى جيوش سائر الأقاليم من الروم والفرس والترك والصقالية والبربر والحبوش وأصناف السودان والقبط وطوائف بني آدم.\nقهروا الجميع حتى علت كلمة الله وظهر دينه على سائر الأديان وامتدت الممالك الإسلامية في مشارق الأرض ومغاربها في أقل من ثلاثين سنة فرضي الله عنهم وأرضاهم أجمعين وحشرنا في زمرتهم إنه كريم وهاب.\n                                    ",
        "qortoby": "وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ ٦٤\n                                    \n                                    \n                                    قوله تعالى وأطيعوا الله ورسوله ولا تنازعوا فتفشلوا وتذهب ريحكم واصبروا إن الله مع الصابرين\nقوله تعالى وأطيعوا الله ورسوله ولا تنازعوا هذا استمرار على الوصية لهم ، والأخذ على أيديهم في اختلافهم في أمر بدر وتنازعهم .\nفتفشلوا نصب بالفاء في جواب النهي . ولا يجيز سيبويه حذف الفاء والجزم وأجازه الكسائي . وقرئ ( تفشلوا ) بكسر الشين . وهو غير معروف .\nوتذهب ريحكم أي قوتكم ونصركم ، كما تقول : الريح لفلان ، إذا كان غالبا في الأمر قال الشاعر :\nإذا هبت رياحك فاغتنمها فإن لكل خافقة سكونا\nوقال قتادة وابن زيد : إنه لم يكن نصر قط إلا بريح تهب فتضرب في وجوه الكفار . ومنه قوله عليه السلام : نصرت بالصبا وأهلكت عاد بالدبور . قال الحكم : وتذهب ريحكم يعني الصبا ، إذ بها نصر محمد عليه الصلاة والسلام وأمته . وقال مجاهد : وذهبت ريح أصحاب محمد صلى الله عليه وسلم حين نازعوه يوم أحد .\nقوله تعالى واصبروا إن الله مع الصابرين أمر بالصبر ، وهو محمود في كل المواطن وخاصة موطن الحرب ، كما قال : إذا لقيتم فئة فاثبتوا .\n                                    ",
        "saadi": "وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ ٦٤\n                                        \n                                        \n                                        \n                                        ‏{‏وَأَطِيعُوا اللَّهَ وَرَسُولَهُ‏}‏ في استعمال ما أمرا به، والمشي خلف ذلك في جميع الأحوال‏.‏ ‏{‏وَلَا تَنَازَعُوا‏}‏ تنازعا يوجب تشتت القلوب وتفرقها، ‏{‏فَتَفْشَلُوا‏}‏ أي‏:‏ تجبنوا ‏{‏وَتَذْهَبَ رِيحُكُمْ‏}‏ أي‏:‏ تنحل عزائمكم، وتفرق قوتكم، ويرفع ما وعدتم به من النصر على طاعة اللّه ورسوله‏.‏ ‏{‏وَاصْبِرُوا‏}‏ نفوسكم على طاعة اللّه ‏{‏إِنَّ اللَّهَ مَعَ الصَّابِرِينَ‏}‏ بالعون والنصر والتأييد، واخشعوا لربكم واخضعوا له‏.‏\n                                    "
      },
      "originalText": "وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥ وَلَا تَنَٰزَعُواْ فَتَفۡشَلُواْ وَتَذۡهَبَ رِيحُكُمۡۖ وَٱصۡبِرُوٓاْۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ ٦٤"
    },
    {
      "number": 1207,
      "text": "وَلَا تَكُونُوا كَالَّذِينَ خَرَجُوا مِنْ دِيَارِهِمْ بَطَرًا وَرِئَاءَ النَّاسِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ ۚ وَاللَّهُ بِمَا يَعْمَلُونَ مُحِيطٌ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 47,
      "juz": 10,
      "manzil": 2,
      "page": 183,
      "ruku": 151,
      "hizbQuarter": 73,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ ٧٤\n                                    \n                                    \n                                    ل تعالى بعد أمره المؤمنين بالإخلاص في القتال في سبيله وكثرة ذكره ، ناهيا لهم عن التشبه بالمشركين في خروجهم من ديارهم ) بطرا ) أي : دفعا للحق ، ( ورئاء الناس ) وهو : المفاخرة والتكبر عليهم ، كما قال أبو جهل - لما قيل له : إن العير قد نجا فارجعوا - فقال : لا والله لا نرجع حتى نرد ماء بدر ، وننحر الجزر ، ونشرب الخمر ، وتعزف علينا القيان ، وتتحدث العرب بمكاننا فيها يومنا أبدا ، فانعكس ذلك عليه أجمع ؛ لأنهم لما وردوا ماء بدر وردوا به الحمام ، ورموا في أطواء بدر مهانين أذلاء ، صغرة أشقياء في عذاب سرمدي أبدي ؛ ولهذا قال : ( والله بما يعملون محيط ) أي : عالم بما جاءوا به وله ، ولهذا جازاهم على ذلك شر الجزاء لهم .\nقال ابن عباس ، ومجاهد ، وقتادة ، والضحاك ، والسدي في قوله تعالى : ( ولا تكونوا كالذين خرجوا من ديارهم بطرا ورئاء الناس ) قالوا : هم المشركون ، الذين قاتلوا رسول الله - صلى الله عليه وسلم - يوم بدر .\nوقال محمد بن كعب : لما خرجت قريش من مكة إلى بدر ، خرجوا بالقيان والدفوف ، فأنزل الله ( ولا تكونوا كالذين خرجوا من ديارهم بطرا ورئاء الناس ويصدون عن سبيل الله والله بما يعملون محيط )\n                                    ",
        "qortoby": "وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ ٧٤\n                                    \n                                    \n                                    قوله تعالى ولا تكونوا كالذين خرجوا من ديارهم بطرا ورئاء الناس ويصدون عن سبيل الله والله بما يعملون محيط\nيعني أبا جهل وأصحابه الخارجين يوم بدر لنصرة العير . خرجوا بالقيان والمغنيات والمعازف ، فلما وردوا الجحفة بعث خفاف الكناني - وكان صديقا لأبي جهل - بهدايا إليه مع ابن له ، وقال : إن شئت أمددتك بالرجال ، وإن شئت أمددتك بنفسي مع من خف من قومي . فقالأبو جهل : إن كنا نقاتل الله كما يزعم محمد ، فوالله ما لنا بالله من طاقة . وإن كنا نقاتل الناس فوالله إن بنا على الناس لقوة ، والله لا نرجع عن قتال محمد حتى نرد بدرا فنشرب فيها الخمور ، وتعزف علينا القيان ، فإن بدرا موسم من مواسم العرب ، وسوق من أسواقهم ، حتى تسمع العرب بمخرجنا فتهابنا آخر الأبد . فوردوا بدرا ولكن جرى ما جرى من هلاكهم . والبطر في اللغة : التقوية بنعم الله عز وجل وما ألبسه من العافية على المعاصي . وهو مصدر في موضع الحال . أي خرجوا بطرين مرائين صادين . وصدهم إضلال الناس .\n                                    ",
        "saadi": "وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ ٧٤\n                                        \n                                        \n                                        \n                                        ‏{‏وَلَا تَكُونُوا كَالَّذِينَ خَرَجُوا مِنْ دِيَارِهِمْ بَطَرًا وَرِئَاءَ النَّاسِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ‏}‏ أي‏:‏ هذا مقصدهم الذي خرجوا إليه، وهذا الذي أبرزهم من ديارهم لقصد الأشر والبطر في الأرض، وليراهم الناس ويفخروا لديهم‏.‏ والمقصود الأعظم أنهم خرجوا ليصدوا عن سبيل اللّه من أراد سلوكه، ‏{‏وَاللَّهُ بِمَا يَعْمَلُونَ مُحِيطٌ‏}‏ فلذلك أخبركم بمقاصدهم، وحذركم أن تشبهوا بهم، فإنه سيعاقبهم على ذلك أشد العقوبة‏.‏ فليكن قصدكم في خروجكم وجه اللّه تعالى وإعلاء دين اللّه، والصد عن الطرق الموصلة إلى سخط اللّه وعقابه، وجذب الناس إلى سبيل اللّه القويم الموصل لجنات النعيم‏.‏\n                                    "
      },
      "originalText": "وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِم بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ ٧٤"
    },
    {
      "number": 1208,
      "text": "وَإِذْ زَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ وَقَالَ لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَإِنِّي جَارٌ لَكُمْ ۖ فَلَمَّا تَرَاءَتِ الْفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيْهِ وَقَالَ إِنِّي بَرِيءٌ مِنْكُمْ إِنِّي أَرَىٰ مَا لَا تَرَوْنَ إِنِّي أَخَافُ اللَّهَ ۚ وَاللَّهُ شَدِيدُ الْعِقَابِ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 48,
      "juz": 10,
      "manzil": 2,
      "page": 183,
      "ruku": 151,
      "hizbQuarter": 73,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ ٨٤\n                                    \n                                    \n                                    وقوله : ( وإذ زين لهم الشيطان أعمالهم وقال لا غالب لكم اليوم من الناس وإني جار لكم ) الآية ، حسن لهم - لعنه الله - ما جاءوا له وما هموا به ، وأطمعهم أنه لا غالب لهم اليوم من الناس ، ونفى عنهم الخشية من أن يؤتوا في ديارهم من عدوهم بني بكر فقال : أنا جار لكم ، وذلك أنه تبدى لهم في صورة سراقة بن مالك بن جعشم ، سيد بني مدلج ، كبير تلك الناحية ، وكل ذلك منه ، كما قال [ الله ] تعالى عنه : ( يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا ) [ النساء : 120 ] .\nقال ابن جريج قال ابن عباس في هذه الآية : لما كان يوم بدر سار إبليس برايته وجنوده مع المشركين ، وألقى في قلوب المشركين أن أحدا لن يغلبكم ، وإني جار لكم . فلما التقوا ، ونظر الشيطان إلى إمداد الملائكة ، ( نكص على عقبيه ) قال : رجع مدبرا ، وقال : ( إني أرى ما لا ترون ) الآية .\nوقال علي بن أبي طلحة ، عن ابن عباس قال : جاء إبليس يوم بدر في جند من الشياطين ، معه رايته ، في صورة رجل من بني مدلج ، والشيطان في صورة سراقة بن مالك بن جعشم ، فقال الشيطان للمشركين : ( لا غالب لكم اليوم من الناس وإني جار لكم ) فلما اصطف الناس أخذ رسول الله - صلى الله عليه وسلم - قبضة من التراب فرمى بها في وجوه المشركين ، فولوا مدبرين وأقبل جبريل ، عليه السلام ، إلى إبليس ، فلما رآه - وكانت يده في يد رجل من المشركين - انتزع يده ثم ولى مدبرا هو وشيعته ، فقال الرجل : يا سراقة ، أتزعم أنك لنا جار ؟ فقال : ( إني أرى ما لا ترون إني أخاف الله والله شديد العقاب ) وذلك حين رأى الملائكة .\nوقال محمد بن إسحاق : حدثني الكلبي ، عن أبي صالح ، عن ابن عباس ؛ أن إبليس خرج مع قريش في صورة سراقة بن مالك بن جعشم ، فلما حضر القتال ورأى الملائكة ، نكص على عقبيه ، وقال : ( إني بريء منكم ) فتشبث الحارث بن هشام فنخر في وجهه ، فخر صعقا ، فقيل له : ويلك يا سراقة ، على هذه الحال تخذلنا وتبرأ منا . فقال : ( إني بريء منكم إني أرى ما لا ترون إني أخاف الله والله شديد العقاب )\nوقال محمد بن عمر الواقدي : أخبرني عمر بن عقبة ، عن شعبة - مولى ابن عباس - عن ابن عباس قال : لما تواقف الناس أغمي على رسول الله - صلى الله عليه وسلم - ساعة ثم كشف عنه ، فبشر الناس بجبريل في جند من الملائكة ميمنة الناس ، وميكائيل في جند آخر ميسرة الناس ، وإسرافيل في جند آخر ألف . وإبليس قد تصور في صورة سراقة بن مالك بن جعشم المدلجي ، يدبر المشركين ويخبرهم أنه لا غالب لهم اليوم من الناس . فلما أبصر عدو الله الملائكة ، نكص على عقبيه ، وقال : ( إني بريء منكم إني أرى ما لا ترون ) فتشبث به الحارث بن هشام ، وهو يرى أنه سراقة لما سمع من كلامه ، فضرب في صدر الحارث ، فسقط الحارث ، وانطلق إبليس لا يرى حتى سقط في البحر ، ورفع ثوبه وقال : يا رب ، موعدك الذي وعدتني .\nوفي الطبراني عن رفاعة بن رافع قريب من هذا السياق وأبسط منه ذكرناه في السيرة .\nوقال محمد بن إسحاق : حدثني يزيد بن رومان ، عن عروة بن الزبير قال : لما أجمعت قريش المسير ذكرت الذي بينها وبين بني بكر من الحرب ، فكاد ذلك أن يثنيهم ، فتبدى لهم إبليس في صورة سراقة بن مالك بن جعشم المدلجي - وكان من أشراف بني كنانة - فقال : أنا جار لكم أن تأتيكم كنانة بشيء تكرهونه ، فخرجوا سراعا .\nقال محمد بن إسحاق : فذكر لي أنهم كانوا يرونه في كل منزل في صورة سراقة بن مالك لا ينكرونه ، حتى إذا كان يوم بدر والتقى الجمعان ، كان الذي رآه حين نكص الحارث بن هشام - أو : عمير بن وهب - فقال : أين ، أي سراق ؟ ومثل عدو الله فذهب - قال : فأوردهم ثم أسلمهم - قال : ونظر عدو الله إلى جنود الله ، قد أيد الله بهم رسوله والمؤمنين فانتكص على عقبيه ، وقال : ( إني بريء منكم إني أرى ما لا ترون ) وصدق عدو الله ، وقال : ( إني أخاف الله والله شديد العقاب ) وهكذا روي عن السدي ، والضحاك ، والحسن البصري ، ومحمد بن كعب القرظي ، وغيرهم ، رحمهم الله .\nوقال قتادة : وذكر لنا أنه رأى جبريل ، عليه السلام ، تنزل معه الملائكة ، فعلم عدو الله أنه لا يدان له بالملائكة فقال : ( إني أرى ما لا ترون إني أخاف الله ) وكذب عدو الله ، والله ما به مخافة الله ، ولكن علم أنه لا قوة له ولا منعة ، وتلك عادة عدو الله لمن أطاعه واستقاد له ، حتى إذا التقى الحق والباطل أسلمهم شر مسلم ، وتبرأ منهم عند ذلك .\nقلت : يعني بعادته لمن أطاعه قوله تعالى : ( كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله ) [ الحشر : 16 ] ، وقوله تعالى : ( وقال الشيطان لما قضي الأمر إن الله وعدكم 4 75 وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ما أنا بمصرخكم وما أنتم بمصرخي إني كفرت بما أشركتمون من قبل إن الظالمين لهم عذاب أليم ) [ إبراهيم : 22 ] .\nوقال يونس بن بكير ، عن محمد بن إسحاق : حدثني عبد الله بن أبي بكر بن عمرو بن حزم ، عن بعض بني ساعدة قال : سمعت أبا أسيد مالك بن ربيعة بعدما أصيب بصره يقول : لو كنت معكم الآن ببدر ومعي بصري ، لأخبرتكم بالشعب الذي خرجت منه الملائكة لا أشك ولا أتمارى .\nفلما نزلت الملائكة ورآها إبليس ، وأوحى الله إليهم : أني معكم فثبتوا الذين آمنوا ، وتثبيتهم أن الملائكة كانت تأتي الرجل في صورة الرجل يعرفه ، فيقول له : أبشر فإنهم ليسوا بشيء ، والله معكم ، كروا عليهم . فلما رأى إبليس الملائكة نكص على عقبيه ، وقال : ( إني بريء منكم إني أرى ما لا ترون ) وهو في صورة سراقة ، وأقبل أبو جهل يحضض أصحابه ويقول : لا يهولنكم خذلان سراقة إياكم ، فإنه كان على موعد من محمد وأصحابه . ثم قال : واللات والعزى لا نرجع حتى نقرن محمدا وأصحابه في الحبال ، فلا تقتلوهم وخذوهم أخذا . وهذا من أبي جهل لعنه الله كقول فرعون للسحرة لما أسلموا : ( إن هذا لمكر مكرتموه في المدينة لتخرجوا منها أهلها ) [ الأعراف : 123 ] ، وكقوله ( إنه لكبيركم الذي علمكم السحر ) [ طه : 71 ] ، وهو من باب البهت والافتراء ، ولهذا كان أبو جهل فرعون هذه الأمة .\nوقال مالك بن أنس ، عن إبراهيم بن أبي عبلة عن طلحة بن عبيد الله بن كريز ؛ أن رسول الله - صلى الله عليه وسلم - قال : ما رئي إبليس في يوم هو فيه أصغر ولا أحقر ولا أدحر ولا أغيظ منه في يوم عرفة وذلك مما يرى من تنزل الرحمة والعفو عن الذنوب إلا ما رأى يوم بدر . قالوا : يا رسول الله ، وما رأى يوم بدر ؟ قال : أما إنه رأى جبريل ، عليه السلام ، يزع الملائكة .\nهذا مرسل من هذا الوجه .\n                                    ",
        "qortoby": "وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ ٨٤\n                                    \n                                    \n                                    قوله تعالى وإذ زين لهم الشيطان أعمالهم وقال لا غالب لكم اليوم من الناس وإني جار لكم فلما تراءت الفئتان نكص على عقبيه وقال إني بريء منكم إني أرى ما لا ترون إني أخاف الله والله شديد العقاب روي أن الشيطان تمثل لهم يومئذ في صورة سراقة بن مالك بن جعشم ، وهو من بني بكر بن كنانة ، وكانت قريش تخاف من بني بكر أن يأتوهم من ورائهم ، لأنهم قتلوا رجلا منهم . فلما تمثل لهم قال ما أخبر الله به عنه . وقال الضحاك : جاءهم إبليس يوم بدر برايته وجنوده ، وألقى في قلوبهم أنهم لن يهزموا وهم يقاتلون على دين آبائهم . وعن ابن عباس قال : أمد الله نبيه محمدا صلى الله عليه وسلم والمؤمنين بألف من الملائكة ، فكان جبريل عليه السلام في خمسمائة من الملائكة مجنبة ، وميكائيل في خمسمائة من الملائكة مجنبة . وجاء إبليس في جند من الشياطين ومعه راية في صورة رجال من بني مدلج ، والشيطان في صورة سراقة بن مالك بن جعشم . فقال الشيطان للمشركين : لا غالب لكم اليوم من الناس وإني جار لكم ، فلما اصطف القوم قال أبو جهل : اللهم أولانا بالحق فانصره . ورفع رسول الله صلى الله عليه وسلم يده فقال : يا رب إنك إن تهلك هذه العصابة فلن تعبد في الأرض أبدا . فقال جبريل : خذ قبضة من التراب فأخذ قبضة من التراب فرمى بها وجوههم ، فما من المشركين من أحد إلا أصاب عينيه ومنخريه وفمه . فولوا مدبرين ، وأقبل جبريل عليه السلام إلى إبليس فلما رآه كانت يده في يد رجل من المشركين انتزع إبليس يده ثم ولى مدبرا وشيعته ، فقال له الرجل : يا سراقة ، ألم تزعم أنك لنا جار ، قال : إني بريء منكم إني أرى ما لا ترون . ذكره البيهقي وغيره . وفي موطأ مالك عن إبراهيم بن أبي عبلة عن طلحة بن عبيد الله بن كريز أن رسول الله صلى الله عليه وسلم قال : ما رأى الشيطان نفسه يوما هو فيه أصغر ولا أحقر ولا أدحر ولا أغيظ منه في يوم عرفة وما ذاك إلا لما رأى من تنزل الرحمة وتجاوز الله عن الذنوب العظام إلا ما رأى يوم بدر . قيل : وما رأى يوم بدر يا رسول الله ؟ قال : أما إنه رأى جبريل يزع الملائكة . ومعنى نكص : رجع بلغة سليم ، عن مؤرج وغيره . وقال الشاعر :\nليس النكوص على الأدبار مكرمة إن المكارم إقدام على الأسل\nوقال آخر :\nوما ينفع المستأخرين نكوصهم ولا ضر أهل السابقات التقدم\nوليس هاهنا قهقرى بل هو فرار ، كما قال : إذا سمع الأذان أدبر وله ضراط .\nإني أخاف الله قيل : خاف إبليس أن يكون يوم بدر اليوم الذي أنظر إليه . وقيل : كذب إبليس في قوله : إني أخاف الله ولكن علم أنه لا قوة له .\nويجمع جار على أجوار وجيران ، وفي القليل جيرة .\n                                    ",
        "saadi": "وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ ٨٤\n                                        \n                                        \n                                        \n                                        ‏{‏وَإِذْ زَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ‏}‏ حسَّنها في قلوبهم وخدعهم‏.‏ ‏{‏وَقَالَ لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ‏}‏ فإنكم في عَدَدٍ وعُدَدٍ وهيئة لا يقاومكم فيها محمد ومن معه‏.‏ ‏{‏وَإِنِّي جَارٌ لَكُمْ‏}‏ من أن يأتيكم أحد ممن تخشون غائلته، لأن إبليس قد تبدَّى لقريش في صورة سراقة بن مالك بن جعشم المدلجي، وكانوا يخافون من بني مدلج لعداوة كانت بينهم‏.‏ فقال لهم الشيطان‏:‏ أنا جار لكم، فاطمأنت نفوسهم وأتوا على حرد قادرين‏.‏ ‏{‏فَلَمَّا تَرَاءَتِ الْفِئَتَانِ‏}‏ المسلمون والكافرون، فرأى الشيطان جبريل عليه السلام يزع الملائكة خاف خوفا شديدا و ‏{‏نَكَصَ عَلَى عَقِبَيْهِ‏}‏ أي‏:‏ ولى مدبرا‏.‏ ‏{‏وَقَالَ‏}‏ لمن خدعهم وغرهم‏:‏ ‏{‏إِنِّي بَرِيءٌ مِنْكُمْ إِنِّي أَرَى مَا لَا تَرَوْنَ‏}‏ أي‏:‏ أرى الملائكة الذين لا يدان لأحد بقتالهم‏.‏ ‏{‏إِنِّي أَخَافُ اللَّهَ‏}‏ أي‏:‏ أخاف أن يعاجلني بالعقوبة في الدنيا ‏{‏وَاللَّهُ شَدِيدُ الْعِقَابِ‏}‏ ومن المحتمل أن يكون الشيطان، قد سول لهم، ووسوس في صدورهم أنه لا غالب لهم اليوم من الناس، وأنه جار لهم، فلما أوردهم مواردهم، نكص عنهم، وتبرأ منهم، كما قال تعالى‏:‏ ‏{‏كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا وَذَلِكَ جَزَاءُ الظَّالِمِينَ‏}‏\n                                    "
      },
      "originalText": "وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ ٨٤"
    },
    {
      "number": 1209,
      "text": "إِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ غَرَّ هَٰؤُلَاءِ دِينُهُمْ ۗ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَإِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 49,
      "juz": 10,
      "manzil": 2,
      "page": 183,
      "ruku": 152,
      "hizbQuarter": 73,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ ٩٤\n                                    \n                                    \n                                    وقوله : ( إذ يقول المنافقون والذين في قلوبهم مرض غر هؤلاء دينهم ) قال علي بن أبي طلحة ، عن ابن عباس في هذه الآية قال : لما دنا القوم بعضهم من بعض قلل الله المسلمين في أعين المشركين ، وقلل المشركين في أعين المسلمين فقال المشركون : ( غر هؤلاء دينهم ) وإنما قالوا ذلك من قلتهم في أعينهم ، فظنوا أنهم سيهزمونهم ، لا يشكون في ذلك ، فقال الله : ( ومن يتوكل على الله فإن الله عزيز حكيم )\nوقال قتادة : رأوا عصابة من المؤمنين تشددت لأمر الله ، وذكر لنا أن أبا جهل عدو الله لما أشرف على محمد - صلى الله عليه وسلم - وأصحابه قال : والله لا يعبدوا الله بعد اليوم ، قسوة وعتوا .\nوقال ابن جريج في قوله : ( إذ يقول المنافقون والذين في قلوبهم مرض ) هم قوم كانوا من المنافقين بمكة ، قالوه يوم بدر .\nوقال عامر الشعبي : كان ناس من أهل مكة قد تكلموا بالإسلام ، فخرجوا مع المشركين يوم بدر ، فلما رأوا قلة المسلمين قالوا : ( غر هؤلاء دينهم )\nوقال مجاهد في قوله - عز وجل - : ( إذ يقول المنافقون والذين في قلوبهم مرض غر هؤلاء دينهم ) قال : فئة من قريش : [ أبو ] قيس بن الوليد بن المغيرة ، وأبو قيس بن الفاكه بن المغيرة ، والحارث بن زمعة بن الأسود بن المطلب ، وعلي بن أمية بن خلف ، والعاص بن منبه بن الحجاج ، خرجوا مع قريش من مكة وهم على الارتياب فحبسهم ارتيابهم ، فلما رأوا قلة أصحاب رسول الله - صلى الله عليه وسلم - قالوا : ( غر هؤلاء دينهم ) حتى قدموا على ما قدموا عليه ، مع قلة عددهم وكثرة عدوهم .\nوهكذا قال محمد بن إسحاق بن يسار ، سواء .\nوقال ابن جرير : حدثنا محمد بن عبد الأعلى ، حدثنا محمد بن ثور ، عن معمر ، عن الحسن في هذه الآية ، قال : هم قوم لم يشهدوا القتال يوم بدر ، فسموا منافقين - قال معمر : وقال بعضهم : هم قوم كانوا أقروا بالإسلام ، وهم بمكة فخرجوا مع المشركين يوم بدر ، فلما رأوا قلة المسلمين قالوا : ( غر هؤلاء دينهم )\nوقوله : ( ومن يتوكل على الله ) أي : يعتمد على جنابه ، ( فإن الله عزيز ) أي : لا يضام من التجأ إليه ، فإن الله عزيز منيع الجناب ، عظيم السلطان ، حكيم في أفعاله ، لا يضعها إلا في مواضعها ، فينصر من يستحق النصر ، ويخذل من هو أهل لذلك .\n                                    ",
        "qortoby": "إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ ٩٤\n                                    \n                                    \n                                    قوله تعالى إذ يقول المنافقون والذين في قلوبهم مرض غر هؤلاء دينهم ومن يتوكل على الله فإن الله عزيز حكيم قيل : المنافقون : الذين أظهروا الإيمان وأبطنوا الكفر . والذين في قلوبهم مرض : الشاكون ، وهم دون المنافقين ، لأنهم حديثو عهد بالإسلام ، وفيهم بعض ضعف نية . قالوا عند الخروج إلى القتال وعند التقاء الصفين : غر هؤلاء دينهم . وقيل : هما واحد ، وهو أولى . ألا ترى إلى قوله عز وجل : الذين يؤمنون بالغيب ثم قال والذين يؤمنون بما أنزل إليك وهما لواحد .\n                                    ",
        "saadi": "إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ ٩٤\n                                        \n                                        \n                                        \n                                        ‏{‏إِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ‏}‏ أي‏:‏ شك وشبهة، من ضعفاء الإيمان، للمؤمنين حين أقدموا ـ مع قِلَّتهم ـ على قتال المشركين مع كثرتهم‏.‏ ‏{‏غَرَّ هَؤُلَاءِ دِينُهُمْ‏}‏ أي‏:‏ أوردهم الدين الذي هم عليه هذه الموارد التي لا يدان لهم بها، ولا استطاعة لهم بها،يقولونه احتقارا لهم واستخفافا لعقولهم، وهم ـ واللّه ـ الأخِفَّاءُ عقولا، الضعفاء أحلاما‏.‏ فإن الإيمان يوجب لصاحبه الإقدام على الأمور الهائلة التي لا يقدم عليها الجيوش العظام،فإن المؤمن المتوكل على اللّه، الذي يعلم أنه ما من حول ولا قوة ولا استطاعة لأحد إلا باللّه تعالى،وأن الخلق لو اجتمعوا كلهم على نفع شخص بمثقال ذرة لم ينفعوه، ولو اجتمعوا على أن يضروه لم يضروه إلا بشيء قد كتبه اللّه عليه، وعلم أنه على الحق، وأن اللّه تعالى حكيم رحيم في كل ما قدره وقضاه، فإنه لا يبالي بما أقدم عليه من قوة وكثرة، وكان واثقا بربه، مطمئن القلب لا فزعا ولا جبانا، ولهذا قال ‏{‏وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَإِنَّ اللَّهَ عَزِيزٌ‏}‏ لا يغالب قوته قوة‏.‏ ‏{‏حَكِيمٌ‏}‏ فيما قضاه وأجراه‏.‏\n                                    "
      },
      "originalText": "إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ ٩٤"
    },
    {
      "number": 1210,
      "text": "وَلَوْ تَرَىٰ إِذْ يَتَوَفَّى الَّذِينَ كَفَرُوا ۙ الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ وَذُوقُوا عَذَابَ الْحَرِيقِ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 50,
      "juz": 10,
      "manzil": 2,
      "page": 183,
      "ruku": 152,
      "hizbQuarter": 73,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ ٠٥\n                                    \n                                    \n                                    يقول تعالى : ولو عاينت يا محمد حال توفي الملائكة أرواح الكفار ، لرأيت أمرا عظيما هائلا فظيعا منكرا ؛ إذ يضربون وجوههم وأدبارهم ، ويقولون لهم : ( ذوقوا عذاب الحريق ) .\nقال ابن جريج ، عن مجاهد : ( وأدبارهم ) أستاههم ، قال : يوم بدر .\nقال ابن جريج ، قال ابن عباس : إذا أقبل المشركون بوجوههم إلى المسلمين ضربوا وجوههم بالسيوف ، وإذا ولوا أدركتهم الملائكة فضربوا أدبارهم .\nقال ابن أبي نجيح ، عن مجاهد قوله : ( إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم ) يوم بدر .\nوقال وكيع ، عن سفيان الثوري ، عن أبي هاشم إسماعيل بن كثير ، عن مجاهد ، عن شعبة ، عن يعلى بن مسلم ، عن سعيد بن جبير : ( يضربون وجوههم وأدبارهم ) قال : وأستاههم ولكن الله يكني .\nوكذا قال عمر مولى غفرة .\nوعن الحسن البصري قال : قال رجل : يا رسول الله ، إني رأيت بظهر أبي جهل مثل الشراك قال ما ذاك ؟ قال : ضرب الملائكة .\nرواه ابن جرير وهو مرسل .\nوهذا السياق - وإن كان سببه وقعة بدر - ولكنه عام في حق كل كافر ؛ ولهذا لم يخصصه تعالى بأهل بدر ، بل قال تعالى : ( ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم ) وفي سورة القتال مثلها وتقدم في سورة الأنعام [ عند ] قوله : ( ولو ترى إذ الظالمون في غمرات الموت والملائكة باسطو أيديهم أخرجوا أنفسكم ) [ الأنعام : 93 ] أي : باسطو أيديهم بالضرب فيهم ، يأمرونهم إذا استصعبت أنفسهم وامتنعت من الخروج من الأجساد أن تخرج قهرا . وذلك إذ بشروهم بالعذاب والغضب من الله ، كما [ جاء ] في حديث البراء : إن ملك الموت - إذا جاء الكافر عند احتضاره في تلك الصورة المنكرة - يقول : اخرجي أيتها النفس الخبيثة إلى سموم وحميم ، وظل من يحموم ، فتتفرق في بدنه ، فيستخرجونها من جسده ، كما يخرج السفود من الصوف المبلول فتخرج معها العروق والعصب ؛ ولهذا أخبر تعالى أن الملائكة تقول لهم : ( وذوقوا عذاب الحريق )\n                                    ",
        "qortoby": "وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ ٠٥\n                                    \n                                    \n                                    قوله تعالى ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم وذوقوا عذاب الحريق\nقيل : أراد من بقي ولم يقتل يوم بدر . وقيل : هي فيمن قتل ببدر . وجواب لو محذوف ، تقديره : لرأيت أمرا عظيما .\nيضربون في موضع الحال وجوههم وأدبارهم أي أستاههم ، كنى عنها بالأدبار ، قاله مجاهد وسعيد بن جبير . الحسن : ظهورهم ، وقال : إن رجلا قال لرسول الله صلى الله عليه وسلم : يا رسول الله ، إني رأيت بظهر أبي جهل مثل الشراك ؟ قال : ذلك ضرب الملائكة . وقيل : هذا الضرب يكون عند الموت . وقد يكون يوم القيامة حين يصيرون بهم إلى النار .\nوذوقوا عذاب الحريق قال الفراء : المعنى ويقولون ذوقوا ، فحذف . وقال الحسن : هذا يوم القيامة ، تقول لهم خزنة جهنم : ذوقوا عذاب الحريق . وروي أن في بعض التفاسير أنه كان مع الملائكة مقامع من حديد ، كلما ضربوا التهبت النار في الجراحات ، فذلك قوله : وذوقوا عذاب الحريق . والذوق يكون محسوسا ومعنى . وقد يوضع موضع الابتلاء والاختبار ، تقول : اركب هذا الفرس فذقه . وانظر فلانا فذق ما عنده . قال الشماخ يصف فرسا :\nفذاق فأعطته من اللين جانبا كفى ولها أن يغرق السهم حاجز\nوأصله من الذوق بالفم .\n                                    ",
        "saadi": "وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ ٠٥\n                                        \n                                        \n                                        \n                                        يقول تعالى‏:‏ ولو ترى الذين كفروا بآيات اللّه حين توفاهم الملائكة الموكلون بقبض أرواحهم وقد اشتد بهم القلق وعظم كربهم، و‏{‏الْمَلَائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ‏}‏ يقولون لهم‏:‏ أخرجوا أنفسكم، ونفوسهم متمنعة مستعصية على الخروج، لعلمها ما أمامها من العذاب الأليم‏.‏ ولهذا قال‏:‏ ‏{‏وَذُوقُوا عَذَابَ الْحَرِيق أي‏:‏ العذاب الشديد المحرق\n                                    "
      },
      "originalText": "وَلَوۡ تَرَىٰٓ إِذۡ يَتَوَفَّى ٱلَّذِينَ كَفَرُواْ ٱلۡمَلَٰٓئِكَةُ يَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَٰرَهُمۡ وَذُوقُواْ عَذَابَ ٱلۡحَرِيقِ ٠٥"
    },
    {
      "number": 1211,
      "text": "ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 51,
      "juz": 10,
      "manzil": 2,
      "page": 183,
      "ruku": 152,
      "hizbQuarter": 73,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ ١٥\n                                    \n                                    \n                                    وقوله تعالى : ( ذلك بما قدمت أيديكم ) أي : هذا الجزاء بسبب ما عملتم من الأعمال السيئة في حياتكم الدنيا ، جازاكم الله بها هذا الجزاء ، ( وأن الله ليس بظلام للعبيد ) أي : لا يظلم أحدا من خلقه ، بل هو الحكم العدل ، الذي لا يجور ، تبارك وتعالى وتقدس وتنزه ، الغني الحميد ؛ ولهذا جاء في الحديث الصحيح عند مسلم - رحمه الله - من رواية أبي ذر - رضي الله عنه - عن رسول الله - صلى الله عليه وسلم - : إن الله تعالى يقول : يا عبادي إني حرمت الظلم على نفسي ، وجعلته بينكم محرما فلا تظالموا . يا عبادي ، إنما هي أعمالكم أحصيها لكم ، فمن وجد خيرا فليحمد الله ، ومن وجد غير ذلك فلا يلومن إلا نفسه ؛ ولهذا قال تعالى :\n                                    ",
        "qortoby": "ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ ١٥\n                                    \n                                    \n                                    ذلك في موضع رفع ; أي الأمر ذلك . أو ذلك جزاؤكم بما قدمت أيديكم أي اكتسبتم من الآثام .\nوأن الله ليس بظلام للعبيد إذ قد أوضح السبيل وبعث الرسل ، فلم خالفتم ؟ . وأن في موضع خفض ، عطف على \" ما \" وإن شئت نصبت ، بمعنى وبأن ، وحذفت الباء . أو بمعنى : وذلك أن الله . ويجوز أن يكون في موضع رفع نسقا على ذلك .\n                                    ",
        "saadi": "ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ ١٥\n                                        \n                                        \n                                        \n                                        ذلك العذاب حصل لكم، غير ظلم ولا جور من ربكم، وإنما هو بما قدمت أيديكم من المعاصي التي أثرت لكم ما أثرت، وهذه سنة اللّه في الأولين والآخرين، فإن دأب هؤلاء المكذبين أي‏:‏ سنتهم وما أجرى اللّه عليهم من الهلاك بذنوبهم‏}‏‏.‏\n                                    "
      },
      "originalText": "ذَٰلِكَ بِمَا قَدَّمَتۡ أَيۡدِيكُمۡ وَأَنَّ ٱللَّهَ لَيۡسَ بِظَلَّٰمٖ لِّلۡعَبِيدِ ١٥"
    },
    {
      "number": 1212,
      "text": "كَدَأْبِ آلِ فِرْعَوْنَ ۙ وَالَّذِينَ مِنْ قَبْلِهِمْ ۚ كَفَرُوا بِآيَاتِ اللَّهِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ ۗ إِنَّ اللَّهَ قَوِيٌّ شَدِيدُ الْعِقَابِ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 52,
      "juz": 10,
      "manzil": 2,
      "page": 183,
      "ruku": 152,
      "hizbQuarter": 73,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِ‍َٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ ٢٥\n                                    \n                                    \n                                    يقول تعالى : فعل هؤلاء المشركون المكذبون بما أرسلت به يا محمد كما فعل الأمم المكذبة قبلهم ، ففعلنا بهم ما هو دأبنا ، أي عادتنا وسنتنا في أمثالهم من المكذبين من آل فرعون ومن قبلهم من الأمم المكذبة بالرسل ، الكافرين بآيات الله . ( فأخذهم الله بذنوبهم ) [ أي : بسبب ذنوبهم أهلكهم ، فأخذهم أخذ عزيز مقتدر ] ( إن الله قوي شديد العقاب ) أي : لا يغلبه غالب ، ولا يفوته هارب .\n                                    ",
        "qortoby": "كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِ‍َٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ ٢٥\n                                    \n                                    \n                                    قوله تعالى كدأب آل فرعون والذين من قبلهم كفروا بآيات الله فأخذهم الله بذنوبهم إن الله قوي شديد العقاب الدأب العادة . وقد تقدم في \" آل عمران \" . أي العادة في تعذيبهم عند قبض الأرواح وفي القبور كعادة آل فرعون . وقيل : المعنى جوزي هؤلاء بالقتل والسبي كما جوزي آل فرعون بالغرق . أي دأبهم كدأب آل فرعون .\n                                    ",
        "saadi": "كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِ‍َٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ ٢٥\n                                        \n                                        \n                                        \n                                        كَدَأْبِ آلِ فِرْعَوْنَ وَالَّذِينَ مِنْ قَبْلِهِمْ ‏{‏من الأمم المكذبة‏}‏ كَفَرُوا بِآيَاتِ اللَّهِ فَأَخَذَهُمُ اللَّهُ ‏{‏بالعقاب‏}‏ بِذُنُوبِهِمْ إِنَّ اللَّهَ قَوِيٌّ شَدِيدُ الْعِقَابِ ‏{‏لا يعجزه أحد يريد أخذه‏}‏ مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَاs\n                                    "
      },
      "originalText": "كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَفَرُواْ بِ‍َٔايَٰتِ ٱللَّهِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ ٢٥"
    }
  ]
}