{
  "number": 186,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 1230,
      "text": "يَا أَيُّهَا النَّبِيُّ قُلْ لِمَنْ فِي أَيْدِيكُمْ مِنَ الْأَسْرَىٰ إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْرًا يُؤْتِكُمْ خَيْرًا مِمَّا أُخِذَ مِنْكُمْ وَيَغْفِرْ لَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 70,
      "juz": 10,
      "manzil": 2,
      "page": 186,
      "ruku": 155,
      "hizbQuarter": 74,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٠٧\n                                    \n                                    \n                                    ال محمد بن إسحاق : حدثني العباس بن عبد الله بن مغفل ، عن بعض أهله ، عن عبد الله بن عباس - رضي الله عنهما - أن رسول الله - صلى الله عليه وسلم - قال يوم بدر : إني قد عرفت أن أناسا من بني هاشم وغيرهم ، قد أخرجوا كرها ، لا حاجة لهم بقتالنا ، فمن لقي منكم أحدا منهم - أي : من بني هاشم - فلا يقتله ، ومن لقي أبا البختري بن هشام فلا يقتله ، ومن لقي العباس بن عبد المطلب فلا يقتله ، فإنه إنما أخرج مستكرها . فقال أبو حذيفة بن عتبة : أنقتل آباءنا وأبناءنا وإخواننا وعشائرنا ونترك العباس ! والله لئن لقيته لألجمنه بالسيف ؟ فبلغت رسول الله - صلى الله عليه وسلم - فقال لعمر بن الخطاب : يا أبا حفص - قال عمر : والله إنه لأول يوم كناني فيه رسول الله - صلى الله عليه وسلم - أيضرب وجه عم رسول الله - صلى الله عليه وسلم - بالسيف ؟ فقال عمر : يا رسول الله ، ائذن لي فأضرب عنقه ، فوالله لقد نافق . فكان أبو حذيفة يقول بعد ذلك : والله ما آمن من تلك الكلمة التي قلت ، ولا أزال منها خائفا ، إلا أن يكفرها الله عني بشهادة . فقتل يوم اليمامة شهيدا ، رضي الله عنه .\nوبه ، عن ابن عباس قال : لما أمسى رسول الله - صلى الله عليه وسلم - يوم بدر ، والأسارى محبوسون بالوثاق ، بات رسول الله - صلى الله عليه وسلم - ساهرا أول الليل ، فقال له أصحابه : يا رسول الله ، ما لك لا تنام ؟ - وقد أسر العباس رجل من الأنصار - فقال رسول الله - صلى الله عليه وسلم - : سمعت أنين عمي العباس في وثاقه ، فأطلقوه فسكت ، فنام رسول الله - صلى الله عليه وسلم - .\nقال محمد بن إسحاق : وكان أكثر الأسارى يوم بدر فداء العباس بن عبد المطلب ، وذلك أنه كان رجلا موسرا فافتدى نفسه بمائة أوقية ذهبا .\nوفي صحيح البخاري ، من حديث موسى بن عقبة ، قال ابن شهاب : حدثني أنس بن مالك أن رجالا من الأنصار استأذنوا رسول الله - صلى الله عليه وسلم - فقالوا : ائذن لنا فلنترك لابن أختنا عباس فداءه . قال : لا والله ، لا تذرون منه درهما .\nوقال يونس بن بكير ، عن محمد بن إسحاق ، عن يزيد بن رومان ، عن عروة - وعن الزهري ، عن جماعة سماهم قالوا : بعثت قريش إلى رسول الله - صلى الله عليه وسلم - في فداء أسراهم ، ففدى كل قوم أسيرهم بما رضوا ، وقال العباس : يا رسول الله ، قد كنت مسلما ! فقال رسول الله - صلى الله عليه وسلم - : الله أعلم بإسلامك ، فإن يكن كما تقول فإن الله يجزيك ، وأما ظاهرك فقد كان علينا ، فافتد نفسك وابني أخيك : نوفل بن الحارث بن عبد المطلب ، وعقيل بن أبي طالب بن عبد المطلب ، وحليفك عتبة بن عمرو أخي بني الحارث بن فهر قال : ما ذاك عندي يا رسول الله ! قال : فأين المال الذي دفنته أنت وأم الفضل ؟ فقلت لها : إن أصبت في سفري هذا ، فهذا المال الذي دفنته لبني : الفضل ، وعبد الله ، وقثم . قال : والله يا رسول الله ، إني لأعلم أنك رسول الله ، إن هذا لشيء ما علمه أحد غيري وغير أم الفضل ، فاحسب لي يا رسول الله ما أصبتم مني : عشرين أوقية من مال كان معي ، فقال رسول الله - صلى الله عليه وسلم - : لا ، ذاك شيء أعطانا الله تعالى منك . ففدى نفسه وابني أخويه وحليفه ، وأنزل الله - عز وجل - فيه : ( يا أيها النبي قل لمن في أيديكم من الأسرى إن يعلم الله في قلوبكم خيرا يؤتكم خيرا مما أخذ منكم ويغفر لكم والله غفور رحيم ) قال العباس : فأعطاني الله مكان العشرين الأوقية في الإسلام عشرين عبدا ، كلهم في يده مال يضرب به ، مع ما أرجو من مغفرة الله - عز وجل - .\nوقد روى ابن إسحاق أيضا ، عن ابن أبي نجيح ، عن عطاء ، عن ابن عباس في هذه الآية بنحو مما تقدم .\nوقال أبو جعفر بن جرير : حدثنا ابن وكيع ، حدثنا ابن إدريس [ عن ابن إسحاق ] عن ابن أبي نجيح ، عن مجاهد ، عن ابن عباس قال : قال العباس : في نزلت : ( ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض ) فأخبرت النبي - صلى الله عليه وسلم - بإسلامي ، وسألته أن يحاسبني بالعشرين الأوقية التي أخذ مني ، فأبى ، فأبدلني الله بها عشرين عبدا ، كلهم تاجر ، مالي في يده .\nوقال ابن إسحاق أيضا : حدثني الكلبي ، عن أبي صالح ، عن ابن عباس ، عن جابر بن عبد الله بن رئاب قال : كان العباس بن عبد المطلب يقول : في نزلت - والله - حين ذكرت لرسول الله - صلى الله عليه وسلم - إسلامي - ثم ذكر نحو الحديث الذي قبله .\nوقال ابن جريج ، عن عطاء الخراساني ، عن ابن عباس : ( يا أيها النبي قل لمن في أيديكم من الأسرى ) عباس وأصحابه . قال : قالوا للنبي - صلى الله عليه وسلم - : آمنا بما جئت به ، ونشهد أنك رسول الله ، لننصحن لك على قومنا . فأنزل الله : ( إن يعلم الله في قلوبكم خيرا يؤتكم خيرا مما أخذ منكم ) إيمانا وتصديقا ، يخلف لكم خيرا مما أخذ منكم ) ويغفر لكم ) الشرك الذي كنتم عليه . قال : فكان العباس يقول : ما أحب أن هذه الآية لم تنزل فينا وأن لي الدنيا ، لقد قال : ( يؤتكم خيرا مما أخذ منكم ) فقد أعطاني خيرا مما أخذ مني مائة ضعف ، وقال : ( ويغفر لكم ) وأرجو أن يكون غفر لي .\nوقال علي بن أبي طلحة ، عن ابن عباس في هذه الآية : كان العباس أسر يوم بدر ، فافتدى نفسه بأربعين أوقية من ذهب ، فقال العباس حين قرئت هذه الآية : لقد أعطانا الله - عز وجل - خصلتين ، ما أحب أن لي بهما الدنيا : إني أسرت يوم بدر ففديت نفسي بأربعين أوقية . فآتاني أربعين عبدا ، وأنا أرجو المغفرة التي وعدنا الله جل ثناؤه .\nوقال قتادة في تفسير هذه الآية : ذكر لنا أن رسول الله - صلى الله عليه وسلم - لما قدم عليه مال البحرين ثمانون ألفا ، وقد توضأ لصلاة الظهر ، فما أعطى يومئذ شاكيا ، ولا حرم سائلا ، وما صلى يومئذ حتى فرقه ، فأمر العباس أن يأخذ منه ويحتثي ، فأخذ . قال : فكان العباس يقول : هذا خير مما أخذ منا ، وأرجو المغفرة .\nوقال يعقوب بن سفيان : حدثنا عمرو بن عاصم ، حدثنا سليمان بن المغيرة ، عن حميد بن هلال قال : بعث ابن الحضرمي إلى رسول الله - صلى الله عليه وسلم - من البحرين ثمانين ألفا ، ما أتاه مال أكثر منه لا قبل ولا بعد . قال : فنثرت على حصير ونودي بالصلاة . قال : وجاء رسول الله - صلى الله عليه وسلم - فمثل قائما على المال ، وجاء أهل المسجد فما كان يومئذ عدد ولا وزن ، ما كان إلا قبضا ، [ قال ] وجاء العباس بن عبد المطلب يحثي في خميصة عليه ، وذهب يقوم فلم يستطع ، قال : فرفع رأسه إلى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله ، ارفع علي . قال : فتبسم رسول الله - صلى الله عليه وسلم - حتى خرج ضاحكه - أو : نابه - وقال له : أعد من المال طائفة ، وقم بما تطيق . قال : ففعل ، وجعل العباس يقول - وهو منطلق - : أما إحدى اللتين وعدنا الله فقد أنجزنا ، وما ندري ما يصنع في الأخرى : ( يا أيها النبي قل لمن في أيديكم من الأسرى ) الآية ، ثم قال : هذا خير مما أخذ منا ، ولا أدري ما يصنع الله في الأخرى فما زال رسول الله - صلى الله عليه وسلم - مائلا على ذلك المال ، حتى ما بقي منه درهم ، وما بعث إلى أهله بدرهم ، ثم أتى الصلاة فصلى .\nحديث آخر في ذلك : قال الحافظ أبو بكر البيهقي : أنبأنا أبو عبد الله الحافظ ، أخبرني أبو الطيب محمد بن محمد بن عبد الله السعيدي ، حدثنا محمش بن عصام ، حدثنا حفص بن عبد الله ، حدثنا إبراهيم بن طهمان ، عن عبد العزيز بن صهيب عن أنس بن مالك قال : أتي رسول الله - صلى الله عليه وسلم - بمال من البحرين ، فقال : انثروه في المسجد .\nقال : وكان أكثر مال أتي به رسول الله - صلى الله عليه وسلم - فخرج إلى الصلاة ولم يلتفت إليه ، فلما قضى الصلاة جاء فجلس إليه . فما كان يرى أحدا إلا أعطاه ، إذ جاء العباس فقال : يا رسول الله ، أعطني فإني فاديت نفسي ، وفاديت عقيلا . فقال له رسول الله - صلى الله عليه وسلم - : خذ . فحثا في ثوبه ، ثم ذهب يقله فلم يستطع ، فقال : مر بعضهم يرفعه إلي . قال : لا . قال : فارفعه أنت علي . قال : لا ، فنثر منه ثم احتمله على كاهله ، ثم انطلق ، فما زال رسول الله - صلى الله عليه وسلم - يتبعه بصره حتى خفي عنه ، عجبا من حرصه ، فما قام رسول الله - صلى الله عليه وسلم - وثم منها درهم .\nوقد رواه البخاري في مواضع من صحيحه تعليقا بصيغة الجزم ، يقول : \" وقال إبراهيم بن طهمان \" ويسوقه ، وفي بعض السياقات أتم من هذا .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٠٧\n                                    \n                                    \n                                    قوله تعالى يا أيها النبي قل لمن في أيديكم من الأسرى إن يعلم الله في قلوبكم خيرا يؤتكم خيرا مما أخذ منكم ويغفر لكم والله غفور رحيم\nفيه ثلاث مسائل :\nالأولى : قوله تعالى ياأيها النبي قل لمن في أيديكم من الأسرى قيل : الخطاب للنبي صلى الله عليه وسلم وأصحابه . وقيل : له وحده . وقال ابن عباس رضي الله عنه : الأسرى في هذه الآية عباس وأصحابه . قالوا للنبي صلى الله عليه وسلم : آمنا بما جئت به ، ونشهد أنك رسول الله ، لننصحن لك على قومك ، فنزلت هذه الآية . وقد تقدم بطلان هذا من قول مالك . وفي مصنف أبي داود عن ابن عباس رضي الله عنه أن النبي صلى الله عليه وسلم جعل فداء أهل الجاهلية يوم بدر أربعمائة . وعن ابن إسحاق : بعثت قريش إلى رسول الله صلى الله عليه وسلم في فداء أسراهم ، ففدى كل قوم أسيرهم بما رضوا . وقال العباس : يا رسول الله ، إني قد كنت مسلما . فقال رسول الله صلى الله عليه وسلم : الله أعلم بإسلامك فإن يكن كما تقول فالله يجزيك بذلك فأما ظاهر أمرك فكان علينا فافد نفسك وابني أخويك نوفل بن الحارث بن عبد المطلب وعقيل بن أبي طالب وحليفك عتبة بن عمرو أخا بني الحارث بن فهر . وقال : ما ذاك عندي يا رسول الله . قال : فأين المال الذي دفنته أنت وأم الفضل فقلت لها إن أصبت في سفري هذا فهذا المال لبني الفضل وعبد الله وقثم ؟ فقال : يا رسول الله ، إني لأعلم أنك رسول الله ، إن هذا لشيء ما علمه غيري وغير أم الفضل ، فاحسب لي يا رسول الله ما أصبتم مني عشرين أوقية من مال كان معي . فقال رسول الله صلى الله عليه وسلم : لا ، ذاك شيء أعطانا الله منك . ففدى نفسه وابني أخويه وحليفه ، وأنزل الله فيه : ياأيها النبي قل لمن في أيديكم من الأسرى الآية . قال ابن إسحاق : وكان أكثر الأسارى فداء العباس بن عبد المطلب ، لأنه كان رجلا موسرا ، فافتدى نفسه بمائة أوقية من ذهب . وفي البخاري : وقال موسى بن عقبة قال ابن شهاب : حدثني أنس بن مالك أن رجالا من الأنصار استأذنوا رسول الله صلى الله عليه وسلم فقالوا : يا رسول الله ، ائذن لنا فلنترك لابن أختنا عباس فداءه . فقال : لا والله لا تذرون درهما . وذكر النقاش وغيره أن فداء كل واحد من الأسارى كان أربعين أوقية ، إلا العباس فإن النبي صلى الله عليه وسلم قال : أضعفوا الفداء على العباس وكلفه أن يفدي ابني أخويه عقيل بن أبي طالب ونوفل بن الحارث فأدى عنهما ثمانين أوقية ، وعن نفسه ثمانين أوقية وأخذ منه عشرون أوقية وقت الحرب . وذلك أنه كان أحد العشرة الذين ضمنوا الإطعام لأهل بدر ، فبلغت النوبة إليه يوم بدر فاقتتلوا قبل أن يطعم ، وبقيت العشرون معه فأخذت منه وقت الحرب ، فأخذ منه يومئذ مائة أوقية وثمانون أوقية . فقال العباس للنبي صلى الله عليه وسلم : لقد تركتني ما حييت أسأل قريشا بكفي . فقال النبي صلى الله عليه وسلم : أين الذهب الذي تركته عند امرأتك أم الفضل ؟ فقال العباس : أي ذهب ؟ فقال له رسول الله صلى الله عليه وسلم : إنك قلت لها لا أدري ما يصيبني في وجهي هذا فإن حدث بي حدث فهو لك ولولدك . فقال : يا بن أخي ، من أخبرك بهذا ؟ قال : الله أخبرني . قال العباس : أشهد أنك صادق ، وما علمت أنك رسول الله قط إلا اليوم ، وقد علمت أنه لم يطلعك عليه إلا عالم السرائر ، أشهد أن لا إله إلا الله وأنك عبده ورسوله ، وكفرت بما سواه . وأمر ابني أخويه فأسلما ، ففيهما نزلت ياأيها النبي قل لمن في أيديكم من الأسرى . وكان الذي أسر العباس أبا اليسر كعب بن عمرو أخا بني سلمة ، وكان رجلا قصيرا ، وكان العباس ضخما طويلا ، فلما جاء به إلى النبي صلى الله عليه وسلم قال له : لقد أعانك عليه ملك .\nالثانية قوله تعالى إن يعلم الله في قلوبكم خيرا أي إسلاما يؤتكم خيرا مما أخذ منكم أي من الفدية . قيل في الدنيا . وقيل في الآخرة . وفي صحيح مسلم أنه لما قدم على النبي صلى الله عليه وسلم مال من البحرين قال له العباس إني فاديت نفسي وفاديت عقيلا . فقال له رسول الله صلى الله عليه وسلم : خذ . فبسط ثوبه وأخذ ما استطاع أن يحمله مختصر . في غير الصحيح : فقال له العباس هذا خير مما أخذ مني ، وأنا بعد أرجو أن يغفر الله لي . قال العباس : وأعطاني زمزم ، وما أحب أن لي بها جميع أموال أهل مكة . وأسند الطبري إلى العباس أنه قال : في نزلت حين أعلمت رسول الله صلى الله عليه وسلم بإسلامي ، وسألته أن يحاسبني بالعشرين أوقية التي أخذت مني قبل المفاداة فأبى . وقال : ذلك فيء فأبدلني الله من ذلك عشرين عبدا كلهم تاجر بمالي . وفي مصنف أبي داود عن عائشة رضي الله عنها قالت : لما بعث أهل مكة في فداء أسراهم بعثت زينب في فداء أبي العاص بمال ، وبعثت فيه بقلادة لها كانت عند خديجة أدخلتها بها على أبي العاص . قالت : فلما رآها رسول الله صلى الله عليه وسلم رق لها رقة شديدة وقال : إن رأيتم أن تطلقوا لها أسيرها وتردوا عليها الذي لها ؟ فقالوا : نعم . وكان النبي صلى الله عليه وسلم أخذ عليه أو وعده أن يخلي سبيل زينب إليه . وبعث رسول الله صلى الله عليه وسلم زيد بن حارثة ورجلا من الأنصار فقال : كونا ببطن يأجج حتى تمر بكما زينب فتصحباها حتى تأتيا بها . قال ابن إسحاق : وذلك بعد بدر بشهر . قال عبد الله بن أبي بكر : حدثت عن زينب بنت رسول الله صلى الله عليه وسلم أنها قالت : لما قدم أبو العاص مكة قال لي : تجهزي ، فالحقي بأبيك . قالت : فخرجت أتجهز فلقيتني هند بنت عتبة فقالت : يا بنت محمد ، ألم يبلغني أنك تريدين اللحوق بأبيك ؟ فقلت لها : ما أردت ذلك . فقالت ، أي بنت عم ، لا تفعلي ، إني امرأة موسرة وعندي سلع من حاجتك ، فإن أردت سلعة بعتكها ، أو قرضا من نفقة أقرضتك ، فإنه لا يدخل بين النساء ما بين الرجال . قالت : فوالله ما أراها قالت ذلك إلا لتفعل ، فخفتها فكتمتها وقلت : ما أريد ذلك . فلما فرغت زينب من جهازها ارتحلت وخرج بها حموها يقود بها نهارا كنانة بن الربيع . وتسامع بذلك أهل مكة ، وخرج في طلبها هبار بن الأسود ونافع بن عبد القيس الفهري ، وكان أول من سبق إليها هبار فروعها بالرمح وهي في هودجها . وبرك كنانة ونثر نبله ، ثم أخذ قوسه وقال : والله لا يدنو مني رجل إلا وضعت فيه سهما . وأقبل أبو سفيان في أشراف قريش فقال : يا هذا ، أمسك عنا نبلك حتى نكلمك ، فوقف عليه أبو سفيان وقال : إنك لم تصنع شيئا ، خرجت بالمرأة على رءوس الناس ، وقد عرفت مصيبتنا التي أصابتنا ببدر فتظن العرب وتتحدث أن هذا وهن منا وضعف خروجك إليه بابنته على رءوس الناس من بين أظهرنا . ارجع بالمرأة فأقم بها أياما ، ثم سلها سلا رفيقا في الليل فألحقها بأبيها ، فلعمري ما لنا بحبسها عن أبيها من حاجة ، وما لنا في ذلك الآن من ثؤرة فيما أصاب منا ، ففعل فلما مر به يومان أو ثلاثة سلها ، فانطلقت حتى قدمت على رسول الله صلى الله عليه وسلم فذكروا أنها قد كانت ألقت - للروعة التي أصابتها حين روعها هبار بن أم درهم - ما في بطنها .\nالثالثة : قال ابن العربي : لما أسر من أسر من المشركين تكلم قوم منهم بالإسلام ولم يمضوا فيه عزيمة ولا اعترفوا به اعترافا جازما . ويشبه أنهم أرادوا أن يقربوا من المسلمين ولا يبعدوا من المشركين .\nقال علماؤنا : إن تكلم الكافر بالإيمان في قلبه وبلسانه ولم يمض فيه عزيمة لم يكن مؤمنا . وإذا وجد مثل ذلك من المؤمن كان كافرا ، إلا ما كان من الوسوسة التي لا يقدر على دفعها فإن الله قد عفا عنها وأسقطها . وقد بين الله لرسوله صلى الله عليه وسلم الحقيقة\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٠٧\n                                        \n                                        \n                                        \n                                        وهذه نزلت في أسارى يوم بدر، وكان في جملتهم العباس عم رسول اللّه ـ صلى الله عليه وسلم ـ فلما طلب منه الفداء، ادَّعى أنه مسلم قبل ذلك، فلم يسقطوا عنه الفداء، فأنزل اللّه تعالى جبرا لخاطره ومن كان على مثل حاله‏.‏ ‏{‏يَا أَيُّهَا النَّبِيُّ قُلْ لِمَنْ فِي أَيْدِيكُمْ مِنَ الْأَسْرَى إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْرًا يُؤْتِكُمْ خَيْرًا مِمَّا أُخِذَ مِنْكُمْ‏}‏ أي‏:‏ من المال، بأن ييسر لكم من فضله، خيرا وأكثر مما أخذ منكم‏.‏ ‏{‏وَيَغْفِرْ لَكُمْ‏}‏ ذنوبكم، ويدخلكم الجنة وقد أنجز اللّه وعده للعباس وغيره، فحصل له ـ بعد ذلك ـ من المال شيء كثير، حتى إنه مرة لما قدم على النبي ـ صلى الله عليه وسلم ـ مال كثير، أتاه العباس فأمره أن يأخذ منه بثوبه ما يطيق حمله، فأخذ منه ما كاد أن يعجز عن حمله‏.‏\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّمَن فِيٓ أَيۡدِيكُم مِّنَ ٱلۡأَسۡرَىٰٓ إِن يَعۡلَمِ ٱللَّهُ فِي قُلُوبِكُمۡ خَيۡرٗا يُؤۡتِكُمۡ خَيۡرٗا مِّمَّآ أُخِذَ مِنكُمۡ وَيَغۡفِرۡ لَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٠٧"
    },
    {
      "number": 1231,
      "text": "وَإِنْ يُرِيدُوا خِيَانَتَكَ فَقَدْ خَانُوا اللَّهَ مِنْ قَبْلُ فَأَمْكَنَ مِنْهُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 71,
      "juz": 10,
      "manzil": 2,
      "page": 186,
      "ruku": 155,
      "hizbQuarter": 74,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ ١٧\n                                    \n                                    \n                                    وقوله : ( وإن يريدوا خيانتك ) أي : فيما أظهروا لك من الأقوال ، ( فقد خانوا الله من قبل ) أي : من قبل بدر بالكفر به ، ( فأمكن منهم ) أي : بالإسار يوم بدر ، ( والله عليم حكيم ) أي : عليم بما يفعله ، حكيم فيه .\nقال قتادة : نزلت في عبد الله بن سعد بن أبي سرح الكاتب حين ارتد ، ولحق بالمشركين .\nوقال ابن جريج ، عن عطاء الخراساني ، عن ابن عباس : نزلت في عباس وأصحابه ، حين قالوا : لننصحن لك على قومنا .\nوفسرها السدي على العموم ، وهو أشمل وأظهر ، والله أعلم .\n                                    ",
        "qortoby": "وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ ١٧\n                                    \n                                    \n                                    وإن يريدوا خيانتك فقد خانوا الله من قبل فأمكن منهم أي إن كان هذا القول منهم خيانة ومكرا فقد خانوا الله من قبل بكفرهم ومكرهم بك وقتالهم لك . وإن كان هذا القول منهم خيرا ويعلمه الله فيقبل منهم ذلك ويعوضهم خيرا مما خرج عنهم ويغفر لهم ما تقدم من كفرهم وخيانتهم ومكرهم . وجمع خيانة خيائن ، وكان يجب أن يقال : خوائن لأنه من ذوات الواو ، إلا أنهم فرقوا بينه وبين جمع خائنة . ويقال : خائن وخوان وخونة وخانة .\n                                    ",
        "saadi": "وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ ١٧\n                                        \n                                        \n                                        \n                                        ‏{‏وَإِنْ يُرِيدُوا خِيَانَتَكَ‏}‏ في السعي لحربك ومنابذتك، ‏{‏فَقَدْ خَانُوا اللَّهَ مِنْ قَبْلُ فَأَمْكَنَ مِنْهُمْ‏}‏ فليحذروا خيانتك، فإنه تعالى قادر عليهم وهم تحت قبضته، ‏{‏وَاللَّهُ عَلِيمٌ حَكِيمٌ‏}‏ أي‏:‏ عليم بكل شيء، حكيم يضع الأشياء مواضعها، ومن علمه وحكمته أن شرع لكم هذه الأحكام الجليلة الجميلة، وأن تكفل بكفايتكم شأن الأسرى وشرهم إن أرادوا خيانة‏.‏\n                                    "
      },
      "originalText": "وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدۡ خَانُواْ ٱللَّهَ مِن قَبۡلُ فَأَمۡكَنَ مِنۡهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ ١٧"
    },
    {
      "number": 1232,
      "text": "إِنَّ الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَٰئِكَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ وَالَّذِينَ آمَنُوا وَلَمْ يُهَاجِرُوا مَا لَكُمْ مِنْ وَلَايَتِهِمْ مِنْ شَيْءٍ حَتَّىٰ يُهَاجِرُوا ۚ وَإِنِ اسْتَنْصَرُوكُمْ فِي الدِّينِ فَعَلَيْكُمُ النَّصْرُ إِلَّا عَلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 72,
      "juz": 10,
      "manzil": 2,
      "page": 186,
      "ruku": 155,
      "hizbQuarter": 74,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٢٧\n                                    \n                                    \n                                    ذكر تعالى أصناف المؤمنين ، وقسمهم إلى مهاجرين خرجوا من ديارهم وأموالهم ، وجاءوا لنصر الله ورسوله ، وإقامة دينه ، وبذلوا أموالهم وأنفسهم في ذلك . وإلى أنصار ، وهم المسلمون من أهل المدينة إذ ذاك ، آووا إخوانهم المهاجرين في منازلهم ، وواسوهم في أموالهم ، ونصروا الله ورسوله بالقتال معهم ، فهؤلاء بعضهم أولى ببعض أي : كل منهم أحق بالآخر من كل أحد ؛ ولهذا آخى رسول الله - صلى الله عليه وسلم - بين المهاجرين والأنصار ، كل اثنين أخوان ، فكانوا يتوارثون بذلك إرثا مقدما على القرابة ، حتى نسخ الله تعالى ذلك بالمواريث ، ثبت ذلك في صحيح البخاري ، عن ابن عباس ورواه العوفي ، وعلي بن أبي طلحة ، عنه . وقال مجاهد ، وعكرمة ، والحسن ، وقتادة ، وغيرهم .\nقال الإمام أحمد : حدثنا وكيع ، عن شريك ، عن عاصم ، عن أبي وائل ، عن جرير - هو ابن عبد الله البجلي - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : المهاجرون والأنصار أولياء بعضهم لبعض ، والطلقاء من قريش والعتقاء من ثقيف بعضهم أولياء بعض إلى يوم القيامة تفرد به أحمد .\nوقال الحافظ أبو يعلى : حدثنا شيبان حدثنا عكرمة - يعني ابن إبراهيم الأزدي - حدثنا عاصم ، عن شقيق ، عن ابن مسعود قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : المهاجرون والأنصار ، والطلقاء من قريش والعتقاء من ثقيف ، بعضهم أولياء بعض في الدنيا والآخرة . هكذا رواه في مسند عبد الله بن مسعود .\nوقد أثنى الله ورسوله على المهاجرين والأنصار في غير ما آية في كتابه ، فقال : ( والسابقون الأولون من المهاجرين والأنصار والذين اتبعوهم بإحسان رضي الله عنهم ورضوا عنه وأعد لهم جنات تجري تحتها الأنهار ) الآية [ التوبة : 100 ] ، وقال : ( لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة ) الآية . [ التوبة : 117 ] ، وقال تعالى : ( للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم يبتغون فضلا من الله ورضوانا وينصرون الله ورسوله أولئك هم الصادقون والذين تبوءوا الدار والإيمان من قبلهم يحبون من هاجر إليهم ولا يجدون في صدورهم حاجة مما أوتوا ويؤثرون على أنفسهم ولو كان بهم خصاصة ) الآية [ الحشر : 8 ، 9 ] .\nوأحسن ما قيل في قوله : ( ولا يجدون في صدورهم حاجة مما أوتوا ) أي : لا يحسدونهم على فضل ما أعطاهم الله على هجرتهم ، فإن ظاهر الآيات تقديم المهاجرين على الأنصار ، وهذا أمر مجمع عليه بين العلماء ، لا يختلفون في ذلك ، ولهذا قال الإمام أبو بكر أحمد بن عمرو بن عبد الخالق البزار في مسنده : حدثنا محمد بن معمر ، حدثنا مسلم بن إبراهيم ، حدثنا حماد بن سلمة ، عن علي بن زيد ، عن سعيد بن المسيب ، عن حذيفة قال : خيرني رسول الله - صلى الله عليه وسلم - بين الهجرة والنصرة ، فاخترت الهجرة .\nثم قال : لا نعرفه إلا من هذا الوجه .\nوقوله : ( والذين آمنوا ولم يهاجروا ما لكم من ولايتهم ) [ قرأ حمزة : \" ولايتهم \" بالكسر ، والباقون بالفتح ، وهما واحد كالدلالة والدلالة ] ( من شيء حتى يهاجروا ) هذا هو الصنف الثالث من المؤمنين ، وهم الذين آمنوا ولم يهاجروا ، بل أقاموا في بواديهم ، فهؤلاء ليس لهم في المغانم نصيب ، ولا في خمسها إلا ما حضروا فيه القتال ، كما قال الإمام أحمد :\nحدثنا وكيع ، حدثنا سفيان ، عن علقمة بن مرثد ، عن سليمان بن بريدة ، عن أبيه بريدة بن الحصيب الأسلمي - رضي الله عنه - قال : كان رسول الله - صلى الله عليه وسلم - إذا بعث أميرا على سرية أو جيش ، أوصاه في خاصة نفسه بتقوى الله ومن معه من المسلمين خيرا ، وقال : اغزوا باسم الله في سبيل الله ، قاتلوا من كفر بالله ، إذا لقيت عدوك من المشركين فادعهم إلى إحدى ثلاث خصال - أو : خلال - فأيتهن ما أجابوك إليها فاقبل منهم ، وكف عنهم : ادعهم إلى الإسلام ، فإن أجابوك فاقبل منهم ، وكف عنهم ، ثم ادعهم إلى التحول من دارهم إلى دار المهاجرين ، وأعلمهم إن فعلوا ذلك أن لهم ما للمهاجرين ، وأن عليهم ما على المهاجرين . فإن أبوا واختاروا دارهم فأعلمهم أنهم يكونون كأعراب المسلمين ، يجري عليهم حكم الله الذي يجري على المؤمنين ، ولا يكون لهم في الفيء والغنيمة نصيب ، إلا أن يجاهدوا مع المسلمين ، فإن هم أبوا فادعهم إلى إعطاء الجزية . فإن أجابوا فاقبل منهم وكف عنهم ، فإن أبوا فاستعن بالله ثم قاتلهم .\nانفرد به مسلم ، وعنده زيادات أخر .\nوقوله : ( وإن استنصروكم في الدين فعليكم النصر إلا على قوم بينكم وبينهم ميثاق والله بما تعملون بصير ) يقول تعالى : وإن استنصروكم هؤلاء الأعراب الذين لم يهاجروا في قتال ديني ، على عدو لهم فانصروهم ، فإنه واجب عليكم نصرهم ؛ لأنهم إخوانكم في الدين ، إلا أن يستنصروكم على قوم من الكفار ( بينكم وبينهم ميثاق ) أي : مهادنة إلى مدة ، فلا تخفروا ذمتكم ، ولا تنقضوا أيمانكم مع الذين عاهدتم . وهذا مروي عن ابن عباس ، رضي الله عنه .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٢٧\n                                    \n                                    \n                                    قوله تعالى إن الذين آمنوا ختم السورة بذكر الموالاة ليعلم كل فريق وليه الذي يستعين به . وقد تقدم معنى الهجرة والجهاد لغة ومعنى .\nوالذين آووا ونصروا معطوف عليه . وهم الأنصار الذين تبوءوا الدار والإيمان من قبلهم ، وانضوى إليهم النبي صلى الله عليه وسلم والمهاجرون .\nأولئك رفع بالابتداء بعضهم ابتداء ثان أولياء بعض خبره ، والجميع خبر إن . قال ابن عباس : أولياء بعض في الميراث ، فكانوا يتوارثون بالهجرة ، وكان لا يرث من آمن ولم يهاجر من هاجر فنسخ الله ذلك بقوله : وأولو الأرحام الآية . أخرجه أبو داود . وصار الميراث لذوي الأرحام من المؤمنين . ولا يتوارث أهل ملتين شيئا . ثم جاء قوله عليه السلام : ألحقوا الفرائض بأهلها على ما تقدم بيانه في آية المواريث . وقيل : ليس هنا نسخ ، وإنما معناه في النصرة والمعونة ، كما تقدم في \" النساء \" .\nوالذين آمنوا ابتداء والخبر ما لكم من ولايتهم من شيء\nوقرأ يحيى بن وثاب والأعمش وحمزة ( من ولايتهم ) بكسر الواو . وقيل هي لغة . وقيل : هي من وليت الشيء ، يقال : ولي بين الولاية . ووال بين الولاية . والفتح في هذا أبين وأحسن ، لأنه بمعنى النصرة والنسب . وقد تطلق الولاية والولاية بمعنى الإمارة .\nقوله تعالى وإن استنصروكم في الدين يريد إن دعوا هؤلاء المؤمنون الذين لم يهاجروا من أرض الحرب عونكم بنفير أو مال لاستنقاذهم فأعينوهم ، فذلك فرض عليكم فلا تخذلوهم . إلا أن يستنصروكم على قوم كفار بينكم وبينهم ميثاق فلا تنصروهم عليهم ، ولا تنقضوا العهد حتى تتم مدته . ابن العربي : إلا أن يكونوا أسراء مستضعفين فإن الولاية معهم قائمة والنصرة لهم واجبة ، حتى لا تبقى منا عين تطرف حتى نخرج إلى استنقاذهم إن كان عددنا يحتمل ذلك ، أو نبذل جميع أموالنا في استخراجهم حتى لا يبقى لأحد درهم . كذلك قال مالك وجميع العلماء ، فإنا لله وإنا إليه راجعون ، على ما حل بالخلق في تركهم إخوانهم في أسر العدو وبأيديهم خزائن الأموال ، وفضول الأحوال والقدرة والعدد والقوة والجلد . الزجاج : ويجوز \" فعليكم النصر \" بالنصب على الإغراء .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٢٧\n                                        \n                                        \n                                        \n                                        هذا عقد موالاة ومحبة، عقدها اللّه بين المهاجرين الذين آمنوا وهاجروا في سبيل اللّه، وتركوا أوطانهم للّه لأجل الجهاد في سبيل اللّه، وبين الأنصار الذين آووا رسول اللّه ـ صلى الله عليه وسلم ـ وأصحابه وأعانوهم في ديارهم وأموالهم وأنفسهم، فهؤلاء بعضهم أولياء بعض، لكمال إيمانهم وتمام اتصال بعضهم ببعض‏.‏ ‏{‏وَالَّذِينَ آمَنُوا وَلَمْ يُهَاجِرُوا مَا لَكُمْ مِنْ وَلَايَتِهِمْ مِنْ شَيْءٍ حَتَّى يُهَاجِرُوا‏}‏ فإنهم قطعوا ولايتكم بانفصالهم عنكم في وقت شدة الحاجة إلى الرجال،فلما لم يهاجروا لم يكن لهم من ولاية المؤمنين شيء‏.‏ لكنهم ‏{‏وَإِنِ اسْتَنْصَرُوكُمْ فِي الدِّينِ‏}‏ أي‏:‏ لأجل قتال من قاتلهم لأجل دينهم ‏{‏فَعَلَيْكُمُ النَّصْرُ‏}‏ والقتال معهم،وأما من قاتلوهم لغير ذلك من المقاصد فليس عليكم نصرهم‏.‏ وقوله تعالى‏:‏ ‏{‏إِلَّا عَلَى قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ‏}‏ أي‏:‏ عهد بترك القتال، فإنهم إذا أراد المؤمنون المتميزون الذين لم يهاجروا قتالهم، فلا تعينوهم عليهم، لأجل ما بينكم وبينهم من الميثاق‏.‏ ‏{‏وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ‏}‏ يعلم ما أنتم عليه من الأحوال، فيشرع لكم من الأحكام ما يليق بكم‏.‏\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ وَٱلَّذِينَ ءَامَنُواْ وَلَمۡ يُهَاجِرُواْ مَا لَكُم مِّن وَلَٰيَتِهِم مِّن شَيۡءٍ حَتَّىٰ يُهَاجِرُواْۚ وَإِنِ ٱسۡتَنصَرُوكُمۡ فِي ٱلدِّينِ فَعَلَيۡكُمُ ٱلنَّصۡرُ إِلَّا عَلَىٰ قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٢٧"
    },
    {
      "number": 1233,
      "text": "وَالَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ إِلَّا تَفْعَلُوهُ تَكُنْ فِتْنَةٌ فِي الْأَرْضِ وَفَسَادٌ كَبِيرٌ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 73,
      "juz": 10,
      "manzil": 2,
      "page": 186,
      "ruku": 155,
      "hizbQuarter": 74,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ ٣٧\n                                    \n                                    \n                                    لما ذكر تعالى أن المؤمنين بعضهم أولياء بعض ، قطع الموالاة بينهم وبين الكفار ، كما قال الحاكم في مستدركه :\nحدثنا محمد بن صالح بن هانئ ، حدثنا أبو سعد يحيى بن منصور الهروي ، حدثنا محمد بن أبان ، حدثنا محمد بن يزيد وسفيان بن حسين ، عن الزهري ، عن علي بن الحسين ، عن عمرو بن عثمان ، عن أسامة ، عن النبي - صلى الله عليه وسلم - قال : لا يتوارث أهل ملتين ، ولا يرث مسلم كافرا ، ولا كافر مسلما ، ثم قرأ : ( والذين كفروا بعضهم أولياء بعض إلا تفعلوه تكن فتنة في الأرض وفساد كبير ) ثم قال الحاكم : صحيح الإسناد ولم يخرجاه .\nقلت : الحديث في الصحيحين من رواية أسامة بن زيد قال : قال رسول الله - صلى الله عليه وسلم - : لا يرث المسلم الكافر ولا الكافر المسلم وفي المسند والسنن ، من حديث عمرو بن شعيب ، عن أبيه ، عن جده قال : قال رسول الله - صلى الله عليه وسلم - : لا يتوارث أهل ملتين شتى وقال الترمذي : حسن صحيح .\nوقال أبو جعفر بن جرير : حدثنا محمد ، [ عن محمد بن ثور ] عن معمر ، عن الزهري : أن رسول الله - صلى الله عليه وسلم - أخذ على رجل دخل في الإسلام فقال : تقيم الصلاة ، وتؤتي الزكاة ، وتحج البيت ، وتصوم رمضان ، وأنك لا ترى نار مشرك إلا وأنت له حرب .\nوهذا مرسل من هذا الوجه ، وقد روي متصلا من وجه آخر ، عن رسول الله - صلى الله عليه وسلم - : أنه قال : أنا بريء من كل مسلم بين ظهراني المشركين ، ثم قال : لا يتراءى ناراهما .\nوقال أبو داود في آخر كتاب الجهاد : حدثنا محمد بن داود بن سفيان ، أخبرني يحيى بن حسان ، أنبأنا سليمان بن موسى أبو داود ، حدثنا جعفر بن سعد بن سمرة بن جندب [ حدثني خبيب بن سليمان ، عن أبيه سليمان بن سمرة ] عن سمرة بن جندب : أما بعد ، قال رسول الله - صلى الله عليه وسلم - : من جامع المشرك وسكن معه فإنه مثله .\nوقد ذكر الحافظ أبو بكر بن مردويه ، من حديث حاتم بن إسماعيل ، عن عبد الله بن هرمز ، عن محمد وسعيد ابني عبيد ، عن أبي حاتم المزني قال : قال رسول الله - صلى الله عليه وسلم - : إذا أتاكم من ترضون دينه وخلقه فأنكحوه إلا تفعلوا تكن فتنة في الأرض وفساد عريض . قالوا : يا رسول الله ، وإن كان ؟ قال : إذا أتاكم من ترضون دينه وخلقه فأنكحوه - ثلاث مرات .\nوأخرجه أبو داود والترمذي ، من حديث حاتم بن إسماعيل ، به بنحوه .\nثم روي من حديث عبد الحميد بن سليمان ، عن ابن عجلان ، عن ابن وثيمة النصري عن أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : إذا أتاكم من ترضون خلقه ودينه فزوجوه ، إلا تفعلوا تكن فتنة في الأرض وفساد عريض .\nومعنى قوله تعالى : ( إلا تفعلوه تكن فتنة في الأرض وفساد كبير ) أي : إن لم تجانبوا المشركين وتوالوا المؤمنين ، وإلا وقعت الفتنة في الناس ، وهو التباس الأمر ، واختلاط المؤمن بالكافر ، فيقع بين الناس فساد منتشر طويل عريض .\n                                    ",
        "qortoby": "وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ ٣٧\n                                    \n                                    \n                                    قوله تعالى والذين كفروا بعضهم أولياء بعض قطع الله الولاية بين الكفار والمؤمنين ، فجعل المؤمنين بعضهم أولياء بعض ، والكفار بعضهم أولياء بعض ، يتناصرون بدينهم ويتعاملون باعتقادهم . قال علماؤنا في الكافرة يكون لها الأخ المسلم : لا يزوجها ، إذ لا ولاية بينهما ، ويزوجها أهل ملتها . فكما لا يزوج المسلمة إلا مسلم فكذلك الكافرة لا يزوجها إلا كافر قريب لها ، أو أسقف ، ولو من مسلم ، إلا أن تكون معتقة ، فإن عقد على غير المعتقة فسخ إن كان لمسلم ، ولا يعرض للنصراني . وقال أصبغ : لا يفسخ ، عقد المسلم أولى وأفضل .\nقوله تعالى إلا تفعلوه الضمير عائد على الموارثة والتزامها . المعنى : إلا تتركوهم يتوارثون كما كانوا يتوارثون ، قاله ابن زيد . وقيل : هي عائدة على التناصر والمؤازرة والمعاونة واتصال الأيدي . ابن جريج وغيره : وهذا إن لم يفعل تقع الفتنة عنه عن قريب ، فهو آكد من الأول . وذكر الترمذي عن عبد الله بن مسلم بن هرمز عن محمد وسعد ابني عبيد عن أبي حاتم المزني قال قال رسول الله صلى الله عليه وسلم : إذا جاءكم من ترضون دينه وخلقه فأنكحوه إلا تفعلوه تكن فتنة في الأرض وفساد كبير . قالوا : يا رسول الله ، وإن كان فيه ؟ قال : إذا جاءكم من ترضون دينه وخلقه فأنكحوه ثلاث مرات . قال : حديث غريب . وقيل : يعود على حفظ العهد والميثاق الذي تضمنه قوله : إلا على قوم بينكم وبينهم ميثاق . وهذا وإن لم يفعل فهو الفتنة نفسها . وقيل : يعود على النصر للمسلمين في الدين . وهو معنى القول الثاني . قال ابن إسحاق : جعل الله المهاجرين والأنصار أهل ولايته في الدين دون من سواهم ، وجعل الكافرين بعضهم أولياء بعض . ثم قال : إلا تفعلوه وهو أن يتولى المؤمن الكافر دون المؤمنين . تكن فتنة أي محنة بالحرب ، وما انجر معها من الغارات والجلاء والأسر . والفساد الكبير : ظهور الشرك . قال الكسائي : ويجوز النصب في قوله : تكن فتنة على معنى تكن فعلتكم فتنة وفسادا كبيرا .\n                                    ",
        "saadi": "وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ ٣٧\n                                        \n                                        \n                                        \n                                        لما عقد الولاية بين المؤمنين، أخبر أن الكفار حيث جمعهم الكفر فبعضهم أولياء لبعض فلا يواليهم إلا كافر مثلهم‏.‏ وقوله‏:‏ ‏{‏إِلَّا تَفْعَلُوهُ‏}‏ أي‏:‏ موالاة المؤمنين ومعاداة الكافرين، بأن واليتموهم كلهم أو عاديتموهم كلهم، أو واليتم الكافرين وعاديتم المؤمنين‏.‏ ‏{‏تَكُنْ فِتْنَةٌ فِي الْأَرْضِ وَفَسَادٌ كَبِيرٌ‏}‏ فإنه يحصل بذلك من الشر ما لا ينحصر من اختلاط الحق بالباطل، والمؤمن بالكافر، وعدم كثير من العبادات الكبار، كالجهاد والهجرة، وغير ذلك من مقاصد الشرع والدين التي تفوت إذا لم يتخذ المؤمنون وحدهم أولياء بعضهم لبعض‏.‏\n                                    "
      },
      "originalText": "وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ ٣٧"
    },
    {
      "number": 1234,
      "text": "وَالَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَٰئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا ۚ لَهُمْ مَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 74,
      "juz": 10,
      "manzil": 2,
      "page": 186,
      "ruku": 155,
      "hizbQuarter": 74,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ ٤٧\n                                    \n                                    \n                                    لما ذكر تعالى حكم المؤمنين في الدنيا ، عطف بذكر ما لهم في الآخرة ، فأخبر عنهم بحقيقة الإيمان ، كما تقدم في أول السورة ، وأنه سيجازيهم بالمغفرة والصفح عن ذنوب إن كانت ، وبالرزق الكريم وهو الحسن الكثير الطيب الشريف ، دائم مستمر أبدا لا ينقطع ولا ينقضي ، ولا يسأم ولا يمل لحسنه وتنوعه .\nثم ذكر أن الأتباع لهم في الدنيا على ما كانوا عليه من الإيمان والعمل الصالح فهم معهم في الآخرة كما قال : ( والسابقون الأولون من المهاجرين والأنصار والذين اتبعوهم بإحسان رضي الله عنهم ورضوا عنه وأعد لهم جنات تجري تحتها الأنهار ) الآية [ التوبة : 100 ] ، وقال : ( والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رءوف رحيم ) [ الحشر : 10 ] وفي الحديث المتفق عليه ، بل المتواتر من طرق صحيحة ، عن رسول الله - صلى الله عليه وسلم - أنه قال : المرء مع من أحب ، وفي الحديث الآخر : من أحب قوما حشر معهم .\nوقال الإمام أحمد : حدثنا وكيع ، عن شريك ، عن عاصم ، عن أبي وائل ، عن جرير قال : قال رسول الله - صلى الله عليه وسلم - : المهاجرون والأنصار أولياء بعضهم لبعض ، والطلقاء من قريش والعتقاء من ثقيف بعضهم أولياء بعض إلى يوم القيامة . قال شريك : فحدثنا الأعمش ، عن تميم بن سلمة ، عن عبد الرحمن بن هلال ، عن جرير ، عن النبي - صلى الله عليه وسلم - مثله .\nتفرد به أحمد من هذين الوجهين .\n                                    ",
        "qortoby": "وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ ٤٧\n                                    \n                                    \n                                    حقا مصدر ، أي حققوا إيمانهم بالهجرة والنصرة . وحقق الله إيمانهم بالبشارة في قوله : لهم مغفرة ورزق كريم أي ثواب عظيم في الجنة .\n                                    ",
        "saadi": "وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ ٤٧\n                                        \n                                        \n                                        \n                                        الآيات السابقات في ذكر عقد الموالاة بين المؤمنين من المهاجرين والأنصار‏.‏ وهذه الآيات في بيان مدحهم وثوابهم، فقال‏:‏ ‏{‏وَالَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَوْا وَنَصَرُوا أُولَئِكَ‏}‏ أي‏:‏ المؤمنون من المهاجرين والأنصار ‏{‏هُمُ الْمُؤْمِنُونَ حَقًّا‏}‏ لأنهم صدقوا إيمانهم بما قاموا به من الهجرة والنصرة والموالاة بعضهم لبعض، وجهادهم لأعدائهم من الكفار والمنافقين‏.‏ ‏{‏لَهُمْ مَغْفِرَةٌ‏}‏ من اللّه تمحى بها سيئاتهم، وتضمحل بها زلاتهم، ‏{‏و‏}‏ لهم ‏{‏رِزْقٌ كَرِيمٌ‏}‏ أي‏:‏ خير كثير من الرب الكريم في جنات النعيم‏.‏ وربما حصل لهم من الثواب المعجل ما تقر به أعينهم، وتطمئن به قلوبهم ،\n                                    "
      },
      "originalText": "وَٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ وَٱلَّذِينَ ءَاوَواْ وَّنَصَرُوٓاْ أُوْلَٰٓئِكَ هُمُ ٱلۡمُؤۡمِنُونَ حَقّٗاۚ لَّهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ ٤٧"
    },
    {
      "number": 1235,
      "text": "وَالَّذِينَ آمَنُوا مِنْ بَعْدُ وَهَاجَرُوا وَجَاهَدُوا مَعَكُمْ فَأُولَٰئِكَ مِنْكُمْ ۚ وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِي كِتَابِ اللَّهِ ۗ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "surah": {
        "number": 8,
        "name": "سورة الأنفال",
        "englishName": "Al-Anfaal",
        "englishNameTranslation": "The Spoils of War",
        "revelationType": "Medinan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 75,
      "juz": 10,
      "manzil": 2,
      "page": 186,
      "ruku": 155,
      "hizbQuarter": 74,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ ٥٧\n                                    \n                                    \n                                    وأما قوله تعالى : ( وأولوا الأرحام بعضهم أولى ببعض في كتاب الله ) أي : في حكم الله ، وليس المراد بقوله : ( وأولوا الأرحام ) خصوصية ما يطلقه علماء الفرائض على القرابة الذين لا فرض لهم ولا هم عصبة ، بل يدلون بوارث ، كالخالة ، والخال ، والعمة ، وأولاد البنات ، وأولاد الأخوات ، ونحوهم ، كما قد يزعمه بعضهم ويحتج بالآية ، ويعتقد ذلك صريحا في المسألة ، بل الحق أن الآية عامة تشمل جميع القرابات . كما نص ابن عباس ، ومجاهد ، وعكرمة ، والحسن ، وقتادة وغير واحد : على أنها ناسخة للإرث بالحلف والإخاء اللذين كانوا يتوارثون بهما أو لا وعلى هذا فتشمل ذوي الأرحام بالاسم الخاص . ومن لم يورثهم يحتج بأدلة من أقواها حديث : إن الله قد أعطى كل ذي حق حقه ، فلا وصية لوارث ، قالوا : فلو كان ذا حق لكان له فرض في كتاب الله مسمى ، فلما لم يكن كذلك لم يكن وارثا ، والله أعلم .\nآخر [ تفسير ] سورة \" الأنفال \" ، ولله الحمد والمنة ، وعليه [ الثقة و ] التكلان وهو حسبنا ونعم الوكيل .\n                                    ",
        "qortoby": "وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ ٥٧\n                                    \n                                    \n                                    قوله تعالى والذين آمنوا من بعد وهاجروا يريد من بعد الحديبية وبيعة الرضوان . وذلك أن الهجرة من بعد ذلك كانت أقل رتبة من الهجرة الأولى . والهجرة الثانية هي التي وقع فيها الصلح ، ووضعت الحرب أوزارها نحو عامين ثم كان فتح مكة . ولهذا قال عليه السلام : لا هجرة بعد الفتح . فبين أن من آمن وهاجر من بعد يلتحق بهم . ومعنى منكم أي مثلكم في النصر والموالاة .\nقوله تعالى وأولو الأرحام ابتداء . والواحد ذو ، والرحم مؤنثة ، والجمع أرحام . والمراد بها هاهنا العصبات دون المولود بالرحم . ومما يبين أن المراد بالرحم العصبات قول العرب : وصلتك رحم . لا يريدون قرابة الأم . قالت قتيلة بنت الحارث - أخت النضر بن الحارث - كذا قال ابن هشام . قال السهيلي : الصحيح أنها بنت النضر لا أخته ، كذا وقع في كتاب الدلائل - ترثي أباها حين قتله النبي صلى الله عليه وسلم صبرا بالصفراء :\nيا راكبا إن الأثيل مظنة من صبح خامسة وأنت موفق أبلغ بها ميتا بأن تحية ما إن تزال بها النجائب تخفق مني إليك وعبرة مسفوحة جادت بواكفها وأخرى تخنق هل يسمعني النضر إن ناديته أم كيف يسمع ميت لا ينطق أمحمد يا خير ضنء كريمة في قومها والفحل فحل معرق ما كان ضرك لو مننت وربما من الفتى وهو المغيظ المحنق لو كنت قابل فدية لفديته بأعز ما يفدى به ما ينفق فالنضر أقرب من أسرت قرابة وأحقهم إن كان عتق يعتق ظلت سيوف بني أبيه تنوشه لله أرحام هناك تشقق صبرا يقاد إلى المنية متعبا رسف المقيد وهو عان موثق السابعة : واختلف السلف ومن بعدهم في توريث ذوي الأرحام - وهو من لا سهم له في الكتاب - من قرابة الميت وليس بعصبة ، كأولاد البنات ، وأولاد الأخوات وبنات الأخ ، والعمة والخالة ، والعم أخ الأب للأم ، والجد أبي الأم ، والجدة أم الأم ، ومن أدلى بهم . فقال قوم : لا يرث من لا فرض له من ذوي الأرحام . وروي عن أبي بكر الصديق وزيد بن ثابت وابن عمر ، ورواية عن علي ، وهو قول أهل المدينة ، وروي عن مكحول والأوزاعي ، وبه قال الشافعي رضي الله عنه . وقال بتوريثهم : عمر بن الخطاب وابن مسعود ومعاذ وأبو الدرداء وعائشة وعلي في رواية عنه ، وهو قول الكوفيين وأحمد وإسحاق . واحتجوا بالآية ، وقالوا : وقد اجتمع في ذوي الأرحام سببان : القرابة والإسلام ، فهم أولى ممن له سبب واحد وهو الإسلام . أجاب الأولون فقالوا : هذه آية مجملة جامعة ، والظاهر بكل رحم قرب أو بعد ، وآيات المواريث مفسرة والمفسر قاض على المجمل ومبين . قالوا : وقد جعل النبي صلى الله عليه وسلم الولاء سببا ثابتا ، أقام المولى فيه مقام العصبة فقال : الولاء لمن أعتق . ونهى عن بيع الولاء وعن هبته . احتج الآخرون بما روى أبو داود والدارقطني عن المقدام قال قال رسول الله صلى الله عليه وسلم : من ترك كلا فإلي - وربما قال فإلى الله وإلى رسوله - ومن ترك مالا فلورثته فأنا وارث من لا وارث له أعقل عنه وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه . وروى الدارقطني عن طاوس قال قالت عائشة رضي الله عنها : الله مولى من لا مولى له ، والخال وارث من لا وارث له . موقوف . وروي عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال : الخال وارث . وروي عن أبي هريرة قال : سئل رسول الله صلى الله عليه وسلم عن ميراث العمة والخالة فقال : لا أدري حتى يأتيني جبريل . ثم قال : أين السائل عن ميراث العمة والخالة ؟ قال : فأتى الرجل فقال : سارني جبريل أنه لا شيء لهما . قال الدارقطني : لم يسنده غير مسعدة عن محمد بن عمرو وهو ضعيف ، والصواب مرسل . وروي عن الشعبي قال قال زياد بن أبي سفيان لجليسه : هل تدري كيف قضى عمر في العمة والخالة ؟ قال لا . قال : إني لأعلم خلق الله كيف قضى فيهما عمر ، جعل الخالة بمنزلة الأم ، والعمة بمنزلة الأب .\nبعونه تعالى تم الجزء السابع من الجامع لأحكام القرآن ويليه الجزء الثامن ، وأوله تفسير سورة \" براءة \" .\n                                    ",
        "saadi": "وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ ٥٧\n                                        \n                                        \n                                        \n                                        وكذلك من جاء بعد هؤلاء المهاجرين والأنصار، ممن اتبعهم بإحسان فآمن وهاجر وجاهد في سبيل اللّه‏.‏ ‏{‏فَأُولَئِكَ مِنْكُمْ‏}‏ لهم ما لكم وعليهم ما عليكم فهذه الموالاة الإيمانية ـ وقد كانت في أول الإسلام ـ لها وقع كبير وشأن عظيم، حتى إن النبي ـ صلى الله عليه وسلم ـ آخى بين المهاجرين والأنصارأخوة خاصة، غير الأخوة الإيمانية العامة، وحتى كانوا يتوارثون بها، فأنزل اللّه ‏{‏وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ‏}‏ فلا يرثه إلا أقاربه من العصبات وأصحاب الفروض،فإن لم يكونوا، فأقرب قراباته من ذوي الأرحام، كما دل عليه عموم هذه الآية الكريمة، وقوله‏:‏ ‏{‏فِي كِتَابِ اللَّهِ‏}‏ أي‏:‏ في حكمه وشرعه‏.‏ ‏{‏إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ‏}‏ ومنه ما يعلمه من أحوالكم التي يجري من شرائعه الدينية عليكم ما يناسبها‏.‏\n                                    "
      },
      "originalText": "وَٱلَّذِينَ ءَامَنُواْ مِنۢ بَعۡدُ وَهَاجَرُواْ وَجَٰهَدُواْ مَعَكُمۡ فَأُوْلَٰٓئِكَ مِنكُمۡۚ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمُۢ ٥٧"
    }
  ]
}