{
  "number": 187,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 1236,
      "text": "بَرَاءَةٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 1,
      "juz": 10,
      "manzil": 2,
      "page": 187,
      "ruku": 156,
      "hizbQuarter": 75,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ١\n                                    \n                                    \n                                    [ بسم الله الرحمن الرحيم ، وبه أستعين وهو حسبي ونعم الوكيل ] تفسير سورة التوبة ، مدنية .\nهذه السورة الكريمة من أواخر ما نزل على رسول الله - صلى الله عليه وسلم - كما قال البخاري .\nحدثنا [ أبو ] الوليد ، حدثنا شعبة ، عن أبي إسحاق قال : سمعت البراء يقول : آخر آية نزلت : ( يستفتونك قل الله يفتيكم في الكلالة ) [ النساء : 176 ] وآخر سورة نزلت براءة .\nوإنما لا يبسمل في أولها لأن الصحابة لم يكتبوا البسملة في أولها في المصحف الإمام ، والاقتداء في ذلك بأمير المؤمنين عثمان بن عفان - رضي الله عنه وأرضاه - كما قال الترمذي :\nحدثنا محمد بن بشار ، حدثنا يحيى بن سعد ، ومحمد بن جعفر وابن أبي عدي ، وسهل بن يوسف قالوا : حدثنا عوف بن أبي جميلة أخبرني يزيد الفارسي ، أخبرني ابن عباس قال : قلت لعثمان بن عفان : ما حملكم أن عمدتم إلى الأنفال ، وهي من المثاني ، وإلى براءة وهي من المئين ، فقرنتم بينهما ، ولم تكتبوا بينهما سطر ) بسم الله الرحمن الرحيم ) ووضعتموها في السبع الطول ، ما حملكم على ذلك ؟ فقال عثمان : كان رسول الله - صلى الله عليه وسلم - مما يأتي عليه الزمان وهو ينزل عليه السور ذوات العدد ، فكان إذا نزل عليه الشيء دعا بعض من كان يكتب ، فيقول : ضعوا هذه الآيات في السورة التي يذكر فيها كذا وكذا ، فإذا نزلت عليه الآية فيقول : ضعوا هذه في السورة التي يذكر فيها كذا وكذا ، وكانت الأنفال من أول ما نزل بالمدينة ، وكانت براءة من آخر القرآن ، وكانت قصتها شبيهة بقصتها وحسبت أنها منها ، وقبض رسول الله - صلى الله عليه وسلم - ولم يبين لنا أنها منها ، فمن أجل ذلك قرنت بينهما ، ولم أكتب بينهما سطر ) بسم الله الرحمن الرحيم ) فوضعتها في السبع الطول .\nوكذا رواه أحمد ، وأبو داود ، والنسائي ، وابن حبان في صحيحه ، والحاكم في مستدركه ، من طرق أخر ، عن عوف الأعرابي ، به ، وقال الحاكم : صحيح الإسناد ولم يخرجاه .\nوأول هذه السورة الكريمة نزل على رسول الله - صلى الله عليه وسلم - لما رجع من غزوة تبوك وهم بالحج ، ثم ذكر أن المشركين يحضرون عامهم هذا الموسم على عادتهم في ذلك ، وأنهم يطوفون بالبيت عراة فكره مخالطتهم ، فبعث أبا بكر الصديق - رضي الله عنه - أميرا على الحج هذه السنة ، ليقيم للناس مناسكهم ، ويعلم المشركين ألا يحجوا بعد عامهم هذا ، وأن ينادي في الناس ببراءة ، فلما قفل أتبعه بعلي بن أبي طالب ليكون مبلغا عن رسول الله - صلى الله عليه وسلم - لكونه عصبة له ، كما سيأتي بيانه .\nفقوله : ( براءة من الله ورسوله ) أي : هذه براءة ، أي : تبرؤ من الله ورسوله ( إلى الذين عاهدتم من المشركين\n                                    ",
        "qortoby": "بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ١\n                                    \n                                    \n                                    سورة ( براءة ) مدنية باتفاق .\nبراءة من الله ورسوله إلى الذين عاهدتم من المشركين\nفيه خمس مسائل :\nالأولى : في أسمائها\nقال سعيد بن جبير : سألت ابن عباس رضي الله عنه عن سورة ( براءة ) فقال : تلك الفاضحة ما زال ينزل : ومنهم ومنهم ، حتى خفنا ألا تدع أحدا . قال القشيري أبو نصر عبد الحميد : هذه السورة نزلت في غزوة تبوك ونزلت بعدها . وفي أولها نبذ عهود الكفار إليهم . وفي السورة كشف أسرار المنافقين . وتسمى الفاضحة والبحوث ؛ لأنها تبحث عن أسرار المنافقين وتسمى المبعثرة ، والبعثرة : البحث .\nالثانية : واختلف العلماء في سبب سقوط البسملة من أول هذه السورة على أقوال خمسة :\nالأول : أنه قيل : كان من شأن العرب في زمانها في الجاهلية ، إذا كان بينهم وبين قوم عهد فإذا أرادوا نقضه كتبوا إليهم كتابا ولم يكتبوا فيه بسملة ؛ فلما نزلت سورة ( براءة ) بنقض العهد الذي كان بين النبي صلى الله عليه وسلم والمشركين بعث بها النبي صلى الله عليه وسلم علي بن أبي طالب رضي الله عنه فقرأها عليهم في الموسم ، ولم يبسمل في ذلك على ما جرت به عادتهم في نقض العهد من ترك البسملة .\nوقول ثان : روى النسائي قال : حدثنا أحمد قال : حدثنا محمد بن المثنى عن يحيى بن سعيد قال : حدثنا عوف قال : حدثنا يزيد الرقاشي قال : قال لنا ابن عباس : قلت لعثمان ما حملكم إلى أن عمدتم إلى ( الأنفال ) وهي من المثاني وإلى ( براءة ) وهي من المئين فقرنتم بينهما ، ولم تكتبوا سطر \" بسم الله الرحمن الرحيم \" ، ووضعتموها في السبع الطول فما حملكم على ذلك ؟ قال عثمان : إن رسول الله صلى الله عليه وسلم كان إذا نزل عليه الشيء يدعو بعض من يكتب عنده فيقول : ضعوا هذا في السورة التي فيها كذا وكذا . وتنزل عليه الآيات فيقول : ضعوا هذه الآيات في السورة التي يذكر فيها كذا وكذا . وكانت ( الأنفال ) من أوائل ما أنزل ، و ( براءة ) من آخر القرآن ، وكانت قصتها شبيهة بقصتها ، وقبض رسول الله صلى الله عليه وسلم ولم يبين لنا أنها منها ؛ فظننت أنها منها ؛ فمن ثم قرنت بينهما ولم أكتب بينهما سطر \" بسم الله الرحمن الرحيم \" . وخرجه أبو عيسى الترمذي وقال : هذا حديث حسن .\nوقول ثالث : روي عن عثمان أيضا . وقال مالك فيما رواه ابن وهب وابن القاسم وابن عبد الحكم : إنه لما سقط أولها سقط \" بسم الله الرحمن الرحيم \" معه . وروي ذلك عن ابن عجلان أنه بلغه أن سورة ( براءة ) كانت تعدل البقرة أو قربها فذهب منها ؛ فلذلك لم يكتب بينهما \" بسم الله الرحمن الرحيم \" . وقال سعيد بن جبير : كانت مثل سورة البقرة .\nوقول رابع : قاله خارجة وأبو عصمة وغيرهما . قالوا : لما كتبوا المصحف في خلافة عثمان اختلف أصحاب رسول الله صلى الله عليه وسلم ، فقال بعضهم : ( براءة ) والأنفال سورة واحدة . وقال بعضهم : هما سورتان . فتركت بينهما فرجة لقول من قال : إنهما سورتان وتركت \" بسم الله الرحمن الرحيم \" لقول من قال : هما سورة واحدة فرضي الفريقان معا وثبتت حجتهما في المصحف .\nوقول خامس قال عبد الله بن عباس : سألت علي بن أبي طالب : لم لم يكتب في ( براءة ) \" بسم الله الرحمن الرحيم \" ؟ قال : لأن \" بسم الله الرحمن الرحيم \" أمان و ( براءة ) نزلت بالسيف ليس فيها أمان . وروي معناه عن المبرد قال : ولذلك لم يجمع بينهما فإن \" بسم الله الرحمن الرحيم \" رحمة و ( براءة ) نزلت سخطة . ومثله عن سفيان . قال سفيان بن عيينة : إنما لم تكتب في صدر هذه السورة \" بسم الله الرحمن الرحيم \" لأن التسمية رحمة ، والرحمة أمان ، وهذه السورة نزلت في المنافقين وبالسيف ؛ ولا أمان للمنافقين . والصحيح أن التسمية لم تكتب لأن جبريل عليه السلام ما نزل بها في هذه السورة ، قاله القشيري . وفي قول عثمان : قبض رسول الله صلى الله عليه وسلم ولم يبين لنا أنها منها دليل على أن السور كلها انتظمت بقوله وتبيينه وأن ( براءة ) وحدها ضمت إلى الأنفال من غير عهد من النبي صلى الله عليه وسلم لما عاجله من الحمام قبل تبيينه ذلك . وكانتا تدعيان القرينتين فوجب أن تجمعا وتضم إحداهما إلى الأخرى للوصف الذي لزمهما من الاقتران ، ورسول الله صلى الله عليه وسلم حي .\nالثالثة : قال ابن العربي : هذا دليل على أن القياس أصل في الدين ؛ ألا ترى إلى عثمان وأعيان الصحابة كيف لجئوا إلى قياس الشبه عند عدم النص ، ورأوا أن قصة ( براءة ) شبيهة بقصة ( الأنفال ) فألحقوها بها ؟ فإذا كان الله تعالى قد بين دخول القياس في تأليف القرآن ، فما ظنك بسائر الأحكام ؟ .\nالرابعة : قوله تعالى براءة تقول : برئت من الشيء أبرأ براءة فأنا منه بريء إذا أزلته عن نفسك وقطعت سبب ما بينك وبينه . و براءة رفع على خبر ابتداء مضمر تقديره هذه براءة . ويصح أن ترفع بالابتداء . والخبر في قوله : إلى الذين . وجاز الابتداء بالنكرة لأنها موصوفة فتعرفت تعريفا ما وجاز الإخبار عنها . وقرأ عيسى بن عمر \" براءة \" بالنصب على تقدير التزموا براءة ، ففيها معنى الإغراء . وهي مصدر على فعالة كالشناءة والدناءة .\nالخامسة : قوله تعالى إلى الذين عاهدتم من المشركين ، يعني إلى الذين عاهدهم رسول الله صلى الله عليه وسلم لأنه كان المتولي للعقود ، وأصحابه بذلك كلهم راضون فكأنهم عاقدوا وعاهدوا ؛ فنسب العقد إليهم . وكذلك ما عقده أئمة الكفر على قومهم ؛ منسوب إليهم ، محسوب عليهم ، يؤاخذون به إذ لا يمكن غير ذلك ؛ فإن تحصيل الرضا من الجميع متعذر ، فإذا عقد الإمام لما يراه من المصلحة أمرا لزم جميع الرعايا .\n                                    ",
        "saadi": "بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 1و2 :ـ أي‏:‏ هذه براءة من اللّه ومن رسوله إلى جميع المشركين المعاهدين، أن لهم أربعة أشهر يسيحون في الأرض على اختيارهم، آمنين من المؤمنين، وبعد الأربعة الأشهر فلا عهد لهم، ولا ميثاق‏.‏ وهذا لمن كان له عهد مطلق غير مقدر، أو مقدر بأربعة أشهر فأقل، أما من كان له عهد مقدر بزيادة على أربعة أشهر، فإن الله يتعين أن يتمم له عهده إذا لم يخف منه خيانة، ولم يبدأ بنقض العهد‏.‏ ثم أنذر المعاهدين في مدة عهدهم، أنهم وإن كانوا آمنين، فإنهم لن يعجزوا اللّه ولن يفوتوه، وأنه من استمر منهم على شركه فإنه لا بد أن يخزيه، فكان هذا مما يجلبهم إلى الدخول في الإسلام، إلا من عاند وأصر ولم يبال بوعيد اللّه له‏.‏\n                                    "
      },
      "originalText": "بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ١"
    },
    {
      "number": 1237,
      "text": "فَسِيحُوا فِي الْأَرْضِ أَرْبَعَةَ أَشْهُرٍ وَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ ۙ وَأَنَّ اللَّهَ مُخْزِي الْكَافِرِينَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 2,
      "juz": 10,
      "manzil": 2,
      "page": 187,
      "ruku": 156,
      "hizbQuarter": 75,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ ٢\n                                    \n                                    \n                                    اختلف المفسرون هاهنا اختلافا كثيرا ، فقال قائلون : هذه الآية لذوي العهود المطلقة غير المؤقتة ، أو من له عهد دون أربعة أشهر ، فيكمل له أربعة أشهر ، فأما من كان له عهد مؤقت فأجله إلى مدته ، مهما كان ؛ لقوله تعالى : ( فأتموا إليهم عهدهم إلى مدتهم إن الله يحب المتقين ) [ التوبة : 4 ] ولما سيأتي في الحديث : ومن كان بينه وبين رسول الله - صلى الله عليه وسلم - عهد فعهده إلى مدته . وهذا أحسن الأقوال وأقواها ، وقد اختاره ابن جرير - رحمه الله - وروي عن الكلبي ومحمد بن كعب القرظي ، وغير واحد .\nوقال علي بن أبي طلحة ، عن ابن عباس في قوله : ( براءة من الله ورسوله إلى الذين عاهدتم من المشركين فسيحوا في الأرض أربعة أشهر ) قال : حد الله للذين عاهدوا رسوله أربعة أشهر يسيحون في الأرض حيثما شاءوا ، وأجل أجل من ليس له عهد انسلاخ الأشهر الحرم ، [ من يوم النحر إلى انسلاخ المحرم ، فذلك خمسون ليلة ، فإذا انسلخ الأشهر الحرم ] أمره بأن يضع السيف فيمن لا عهد له .\nوكذا رواه العوفي ، عن ابن عباس .\nوقال [ الضحاك ] بعد قوله : فذلك خمسون ليلة : فأمر الله نبيه إذا انسلخ المحرم أن يضع السيف فيمن لم يكن بينه وبينه عهد ، يقتلهم حتى يدخلوا في الإسلام . وأمر ممن كان له عهد إذا انسلخ أربعة أشهر من يوم النحر إلى عشر خلون من ربيع الآخر ، أن يضع فيهم السيف حتى يدخلوا في الإسلام .\nوقال أبو معشر المدني : حدثنا محمد بن كعب القرظي وغيره قالوا : بعث رسول الله - صلى الله عليه وسلم - أبا بكر أميرا على الموسم سنة تسع ، وبعث علي بن أبي طالب بثلاثين آية أو أربعين آية من \" براءة \" فقرأها على الناس ، يؤجل المشركين أربعة أشهر يسيحون في الأرض ، فقرأها عليهم يوم عرفة ، أجل المشركين عشرين من ذي الحجة ، والمحرم ، وصفر ، وشهر ربيع الأول ، وعشرا من ربيع الآخر ، وقرأها عليهم في منازلهم ، وقال : لا يحجن بعد عامنا هذا مشرك ، ولا يطوفن بالبيت عريان .\nوقال ابن أبي نجيح ، عن مجاهد : ( براءة من الله ورسوله ) إلى أهل العهد : خزاعة ، ومدلج ، ومن كان له عهد أو غيرهم . أقبل رسول الله - صلى الله عليه وسلم - من تبوك حين فرغ ، فأراد رسول الله - صلى الله عليه وسلم - الحج ، ثم قال : إنما يحضر المشركون فيطوفون عراة ، فلا أحب أن أحج حتى لا يكون ذلك . فأرسل أبا بكر وعليا - رضي الله عنهما - فطافا بالناس في ذي المجاز وبأمكنتهم التي كانوا يتبايعون بها بالمواسم كلها ، فآذنوا أصحاب العهد بأن يأمنوا أربعة أشهر ، فهي الأشهر المتواليات : عشرون من ذي الحجة إلى عشر يخلون من ربيع الآخر ، ثم لا عهد لهم ، وآذن الناس كلهم بالقتال إلا أن يؤمنوا .\nوهكذا روي عن السدي : وقتادة .\nوقال الزهري : كان ابتداء التأجيل من شوال وآخره سلخ المحرم .\nوهذا القول غريب ، وكيف يحاسبون بمدة لم يبلغهم حكمها ، وإنما ظهر لهم أمرها يوم النحر ، حين نادى أصحاب رسول الله - صلى الله عليه وسلم - بذلك ، ولهذا قال تعالى :\n                                    ",
        "qortoby": "فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ ٢\n                                    \n                                    \n                                    قوله تعالى فسيحوا في الأرض أربعة أشهر واعلموا أنكم غير معجزي الله وأن الله مخزي الكافرين فيه ثلاث مسائل :\nالأولى : قوله تعالى : فسيحوا رجع من الخبر إلى الخطاب ، أي قل لهم : سيحوا ، أي سيروا في الأرض مقبلين ومدبرين ، آمنين غير خائفين أحدا من المسلمين ؛ بحرب ولا سلب ولا قتل ولا أسر . يقال ساح فلان في الأرض يسيح سياحة وسيوحا وسيحانا ، ومنه السيح في الماء الجاري المنبسط ، ومنه قول طرفة بن العبد :\nلو خفت هذا منك ما نلتني حتى ترى خيلا أمامي تسيح\nالثانية : واختلف العلماء في كيفية هذا التأجيل ، وفي هؤلاء الذين برئ الله منهم ورسوله . فقال محمد بن إسحاق وغيره : هما صنفان من المشركين : أحدهما كانت مدة عهده أقل من أربعة أشهر ؛ فأمهل تمام أربعة أشهر ، والآخر كانت مدة عهده بغير أجل محدود فقصر به على أربعة أشهر ليرتاد لنفسه . ثم هو حرب بعد ذلك لله ولرسوله وللمؤمنين ، يقتل حيث ما أدرك ، ويؤسر إلا أن يتوب . وابتداء هذا الأجل يوم الحج الأكبر ، وانقضاؤه إلى عشر من شهر ربيع الآخر . فأما من لم يكن له عهد فإنما أجله انسلاخ الأربعة الأشهر الحرم ، وذلك خمسون يوما : عشرون من ذي الحجة ، والمحرم . وقال الكلبي : إنما كانت الأربعة الأشهر لمن كان بينه وبين رسول الله صلى الله عليه وسلم عهد دون أربعة أشهر ، ومن كان عهده أكثر من أربعة أشهر فهو الذي أمر الله أن يتم له عهده بقوله : فأتموا إليهم عهدهم إلى مدتهم وهذا اختيار الطبري وغيره . وذكر محمد بن إسحاق ومجاهد وغيرهما : أن هذه الآية نزلت في أهل مكة . وذلك أن رسول الله صلى الله عليه وسلم صالح قريشا عام الحديبية ، على أن يضعوا الحرب عشر سنين ، يأمن فيها الناس ويكف بعضهم عن بعض ، فدخلت خزاعة في عهد رسول الله صلى الله عليه وسلم ، ودخل بنو بكر في عهد قريش ، فعدت بنو بكر على خزاعة ونقضوا عهدهم . وكان سبب ذلك دما كان لبني بكر عند خزاعة قبل الإسلام بمدة ، فلما كانت الهدنة المنعقدة يوم الحديبية ، أمن الناس بعضهم بعضا ، فاغتنم بنو الديل من بني بكر - وهم الذين كان الدم لهم - تلك الفرصة وغفلة خزاعة ، وأرادوا إدراك ثأر بني الأسود بن رزن ، الذين قتلهم خزاعة ، فخرج نوفل بن معاوية الديلي فيمن أطاعه من بني بكر بن عبد مناة ، حتى بيتوا خزاعة واقتتلوا ، وأعانت قريش بني بكر بالسلاح ، وقوم من قريش أعانوهم بأنفسهم ؛ فانهزمت خزاعة إلى الحرم على ما هو مشهور مسطور ؛ فكان ذلك نقضا للصلح الواقع يوم الحديبية ؛ فخرج عمرو بن سالم الخزاعي ، وبديل بن ورقاء الخزاعي ، وقوم من خزاعة ، فقدموا على رسول الله صلى الله عليه وسلم مستغيثين فيما أصابهم به بنو بكر وقريش ، وأنشد عمرو بن سالم فقال :\nيا رب إني ناشد محمدا حلف أبينا وأبيه الأتلدا\nكنت لنا أبا وكنا ولدا ثمت أسلمنا ولم ننزع يدا\nفانصر هداك الله نصرا عتدا وادع عباد الله يأتوا مددا\nفيهم رسول الله قد تجردا أبيض مثل الشمس ينمو صعدا\nإن سيم خسفا وجهه تربدا في فيلق كالبحر يجري مزبدا\nإن قريشا أخلفوك الموعدا ونقضوا ميثاقك المؤكدا\nوزعموا أن لست تدعو أحدا وهم أذل وأقل عددا\nهم بيتونا بالوتير هجدا وقتلونا ركعا وسجدا\nفقال رسول الله صلى الله عليه وسلم : لا نصرت إن لم أنصر بني كعب . ثم نظر إلى سحابة فقال : إنها لتستهل لنصر بني كعب ، يعني خزاعة . وقال رسول الله صلى الله عليه وسلم لبديل بن ورقاء ومن معه : إن أبا سفيان سيأتي ليشد العقد ويزيد في الصلح ، وسينصرف بغير حاجة . فندمت قريش على ما فعلت ، فخرج أبو سفيان إلى المدينة ؛ ليستديم العقد ويزيد في الصلح ، فرجع بغير حاجة كما أخبر رسول الله صلى الله عليه وسلم ، على ما هو معروف من خبره . وتجهز رسول الله صلى الله عليه وسلم إلى مكة ففتحها الله ، وذلك في سنة ثمان من الهجرة . فلما بلغ هوازن فتح مكة جمعهم مالك بن عوف النصري ، على ما هو معروف مشهور من غزاة حنين . وسيأتي بعضها . وكان الظفر والنصر للمسلمين على الكافرين . وكانت وقعة هوازن يوم حنين في أول شوال من السنة الثامنة من الهجرة . وترك رسول الله صلى الله عليه وسلم قسم الغنائم من الأموال والنساء ، فلم يقسمها حتى أتى الطائف ، فحاصرهم رسول الله صلى الله عليه وسلم بضعا وعشرين ليلة . وقيل غير ذلك . ونصب عليهم المنجنيق ورماهم به ، على ما هو معروف من تلك الغزاة . ثم انصرف رسول الله صلى الله عليه وسلم إلى الجعرانة ، وقسم غنائم حنين ، على ما هو مشهور من أمرها وخبرها . ثم انصرف رسول الله صلى الله عليه وسلم وتفرقوا ، وأقام الحج للناس عتاب بن أسيد في تلك السنة . وهو أول أمير أقام الحج في الإسلام . وحج المشركون على مشاعرهم . وكان عتاب بن أسيد خيرا فاضلا ورعا . وقدم كعب بن زهير بن أبي سلمى إلى رسول الله صلى الله عليه وسلم وامتدحه ، وأقام على رأسه بقصيدته التي أولها : بانت سعاد فقلبي اليوم متبول وأنشدها إلى آخرها ، وذكر فيها المهاجرين فأثنى عليهم - وكان قبل ذلك قد حفظ له هجاء في النبي صلى الله عليه وسلم - فعاب عليه الأنصار إذ لم يذكرهم ، فغدا على النبي صلى الله عليه وسلم بقصيدة يمتدح فيها الأنصار فقال :\nمن سره كرم الحياة فلا يزل\nفي مقنب من صالحي الأنصار ورثوا المكارم كابرا عن كابر\nإن الخيار هم بنو الأخيار المكرهين السمهري بأذرع\nكسوافل الهندي غير قصار والناظرين بأعين محمرة\nكالجمر غير كليلة الأبصار والبائعين نفوسهم لنبيهم\nللموت يوم تعانق وكرار يتطهرون يرونه نسكا لهم\nبدماء من علقوا من الكفار دربوا كما دربت ببطن خفية\nغلب الرقاب من الأسود ضوار وإذا حللت ليمنعوك إليهم\nأصبحت عند معاقل الأغفار ضربوا عليا يوم بدر ضربة\nدانت لوقعتها جميع نزار لو يعلم الأقوام علمي كله\nفيهم لصدقني الذين أماري قوم إذا خوت النجوم فإنهم\nللطارقين النازلين مقاري\nثم أقام رسول الله صلى الله عليه وسلم بالمدينة بعد انصرافه من الطائف ذا الحجة والمحرم وصفرا وربيعا الأول وربيعا الآخر وجمادى الأولى وجمادى الآخرة ، وخرج في رجب من سنة تسع بالمسلمين إلى غزوة الروم غزوة تبوك . وهي آخر غزوة غزاها . قال ابن جريج عن مجاهد : لما انصرف رسول الله صلى الله عليه وسلم من تبوك أراد الحج ثم قال : إنه يحضر البيت عراة مشركون يطوفون بالبيت ، فلا أحب أن أحج حتى لا يكون ذلك . فأرسل أبا بكر أميرا على الحج ، وبعث معه بأربعين آية من صدر ( براءة ) ليقرأها على أهل الموسم . فلما خرج دعا النبي صلى الله عليه وسلم عليا وقال : اخرج بهذه القصة من صدر ( براءة ) فأذن بذلك في الناس إذا اجتمعوا . فخرج علي على ناقة النبي صلى الله عليه وسلم العضباء حتى أدرك أبا بكر الصديق رضي الله عنهما بذي الحليفة . فقال له أبو بكر لما رآه : أمير أو مأمور ؟ فقال : بل مأمور ثم نهضا ، فأقام أبو بكر للناس الحج على منازلهم التي كانوا عليها في الجاهلية .\nفي كتاب النسائي عن جابر وأن عليا قرأ على الناس ( براءة ) حتى ختمها قبل يوم التروية بيوم . وفي يوم عرفة وفي يوم النحر عند انقضاء خطبة أبي بكر في الثلاثة أيام . فلما كان يوم النفر الأول قام أبو بكر فخطب الناس ، فحدثهم كيف ينفرون وكيف يرمون ، يعلمهم مناسكهم . فلما فرغ قام علي فقرأ على الناس ( براءة ) حتى ختمها . وقال سليمان بن موسى : لما خطب أبو بكر بعرفة قال قم يا علي فأد رسالة رسول الله صلى الله عليه وسلم ، فقام علي ففعل . قال : ثم وقع في نفسي أن جميع الناس لم يشاهدوا خطبة أبي بكر ، فجعلت أتتبع الفساطيط يوم النحر . وروى الترمذي عن زيد بن يثيع قال : سألت عليا بأي شيء بعثت في الحج ؟ قال : بعثت بأربع : ألا يطوف بالبيت عريان ، ومن كان بينه وبين النبي صلى الله عليه وسلم عهد فهو إلى مدته ، ومن لم يكن له عهد فأجله أربعة أشهر ، ولا يدخل الجنة إلا نفس مؤمنة ، ولا يجتمع المسلمون والمشركون بعد عامهم هذا . قال : هذا حديث حسن صحيح . وأخرجه النسائي وقال : فكنت أنادي حتى صحل صوتي . قال أبو عمر : بعث علي لينبذ إلى كل ذي عهد عهده ، ويعهد إليهم ألا يحج بعد العام مشرك ، ولا يطوف بالبيت عريان . وأقام الحج في ذلك العام سنة تسع أبو بكر . ثم حج رسول الله صلى الله عليه وسلم من قابل حجته التي لم يحج غيرها من المدينة ، فوقعت حجته في ذي الحجة فقال : إن الزمان قد استدار . . . الحديث ، على ما يأتي في آية النسيء بيانه . وثبت الحج في ذي الحجة إلى يوم القيامة . وذكر مجاهد : أن أبا بكر حج في ذي القعدة من سنة تسع . ابن العربي : وكانت الحكمة في إعطاء ( براءة ) لعلي أن ( براءة ) تضمنت نقض العهد الذي كان عقده النبي صلى الله عليه وسلم ، وكانت سيرة العرب ألا يحل العقد إلا الذي عقده أو رجل من أهل بيته ، فأراد النبي صلى الله عليه وسلم أن يقطع ألسنة العرب بالحجة ، ويرسل ابن عمه الهاشمي من بيته ينقض العهد ، حتى لا يبقى لهم متكلم . قال معناه الزجاج .\nالثانية : قال العلماء : وتضمنت الآية جواز قطع العهد بيننا وبين المشركين . ولذلك حالتان : حالة تنقضي المدة بيننا وبينهم فنؤذنهم بالحرب . والإيذان اختيار . والثالثة : أن نخاف منهم غدرا ، فننبذ إليهم عهدهم كما سبق . ابن عباس : والآية منسوخة فإن النبي صلى الله عليه وسلم عاهد ثم نبذ العهد لما أمر بالقتال .\n                                    ",
        "saadi": "فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ ٢\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 1و2 :ـ أي‏:‏ هذه براءة من اللّه ومن رسوله إلى جميع المشركين المعاهدين، أن لهم أربعة أشهر يسيحون في الأرض على اختيارهم، آمنين من المؤمنين، وبعد الأربعة الأشهر فلا عهد لهم، ولا ميثاق‏.‏ وهذا لمن كان له عهد مطلق غير مقدر، أو مقدر بأربعة أشهر فأقل، أما من كان له عهد مقدر بزيادة على أربعة أشهر، فإن الله يتعين أن يتمم له عهده إذا لم يخف منه خيانة، ولم يبدأ بنقض العهد‏.‏ ثم أنذر المعاهدين في مدة عهدهم، أنهم وإن كانوا آمنين، فإنهم لن يعجزوا اللّه ولن يفوتوه، وأنه من استمر منهم على شركه فإنه لا بد أن يخزيه، فكان هذا مما يجلبهم إلى الدخول في الإسلام، إلا من عاند وأصر ولم يبال بوعيد اللّه له‏.‏\n                                    "
      },
      "originalText": "فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ ٢"
    },
    {
      "number": 1238,
      "text": "وَأَذَانٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى النَّاسِ يَوْمَ الْحَجِّ الْأَكْبَرِ أَنَّ اللَّهَ بَرِيءٌ مِنَ الْمُشْرِكِينَ ۙ وَرَسُولُهُ ۚ فَإِنْ تُبْتُمْ فَهُوَ خَيْرٌ لَكُمْ ۖ وَإِنْ تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ ۗ وَبَشِّرِ الَّذِينَ كَفَرُوا بِعَذَابٍ أَلِيمٍ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 3,
      "juz": 10,
      "manzil": 2,
      "page": 187,
      "ruku": 156,
      "hizbQuarter": 75,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَذَٰنٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوۡمَ ٱلۡحَجِّ ٱلۡأَكۡبَرِ أَنَّ ٱللَّهَ بَرِيٓءٞ مِّنَ ٱلۡمُشۡرِكِينَ وَرَسُولُهُۥۚ فَإِن تُبۡتُمۡ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ ٣\n                                    \n                                    \n                                    يقول تعالى : وإعلام ) من الله ورسوله ) وتقدم وإنذار إلى الناس ، ( يوم الحج الأكبر ) وهو يوم النحر الذي هو أفضل أيام المناسك وأظهرها وأكثرها جمعا ( أن الله بريء من المشركين ورسوله ) أي : بريء منهم أيضا .\nثم دعاهم إلى التوبة إليه فقال : ( فإن تبتم ) أي : مما أنتم فيه من الشرك والضلال ( فهو خير لكم وإن توليتم ) أي : استمررتم على ما أنتم عليه ( فاعلموا أنكم غير معجزي الله ) بل هو قادر ، وأنتم في قبضته ، وتحت قهره ومشيئته ، ( وبشر الذين كفروا بعذاب أليم ) أي : في الدنيا بالخزي والنكال ، وفي الآخرة بالمقامع والأغلال .\nقال البخاري - رحمه الله - : حدثنا عبد الله بن يوسف ، حدثنا الليث ، حدثني عقيل ، عن ابن شهاب قال : أخبرني حميد بن عبد الرحمن أن أبا هريرة قال : بعثني أبو بكر - رضي الله عنه - في تلك الحجة في المؤذنين ، بعثهم يوم النحر يؤذنون بمنى : ألا يحج بعد العام مشرك ، ولا يطوف بالبيت عريان . قال حميد : ثم أردف النبي - صلى الله عليه وسلم - بعلي بن أبي طالب ، فأمره أن يؤذن ببراءة . قال أبو هريرة : فأذن معنا علي في أهل منى يوم النحر ببراءة وألا يحج بعد العام مشرك ، ولا يطوف بالبيت عريان .\nورواه البخاري أيضا : حدثنا أبو اليمان ، أخبرنا شعيب ، عن الزهري ، أخبرني حميد بن عبد الرحمن أن أبا هريرة قال : بعثني أبو بكر فيمن يؤذن يوم النحر بمنى : لا يحج بعد العام مشرك ، ولا يطوف بالبيت عريان ، ويوم الحج الأكبر يوم النحر ، وإنما قيل : \" الأكبر \" ، من أجل قول الناس : \" الحج الأصغر \" ، فنبذ أبو بكر إلى الناس في ذلك العام ، فلم يحج عام حجة الوداع الذي حج فيه رسول الله - صلى الله عليه وسلم - مشرك .\nوهذا لفظ البخاري في كتاب \" الجهاد \" .\nوقال عبد الرزاق ، عن معمر ، عن الزهري ، عن ابن المسيب ، عن أبي هريرة - رضي الله عنه - في قوله : ( براءة من الله ورسوله ) قال : لما كان النبي - صلى الله عليه وسلم - زمن حنين ، اعتمر من الجعرانة ، ثم أمر أبا بكر على تلك الحجة - قال معمر : قال الزهري : وكان أبو هريرة يحدث أن أبا بكر أمر أبا هريرة أن يؤذن ببراءة في حجة أبي بكر قال أبو هريرة : ثم أتبعنا النبي - صلى الله عليه وسلم - عليا ، وأمره أن يؤذن ببراءة ، وأبو بكر على الموسم كما هو ، أو قال : على هيئته .\nوهذا السياق فيه غرابة ، من جهة أن أمير الحج كان سنة عمرة الجعرانة إنما هو عتاب بن أسيد ، فأما أبو بكر إنما كان أميرا سنة تسع .\nوقال أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن مغيرة ، عن الشعبي ، عن محرر بن أبي هريرة ، عن أبيه قال : كنت مع علي بن أبي طالب ، حين بعثه رسول الله - صلى الله عليه وسلم - إلى أهل مكة \" ببراءة \" ، فقال : ما كنتم تنادون ؟ قال : كنا ننادي : ألا يدخل الجنة إلا مؤمن ، ولا يطوف بالبيت عريان ، ومن كان بينه وبين رسول الله - صلى الله عليه وسلم - عهد فإن أجله - أو أمده - إلى أربعة أشهر ، فإذا مضت الأربعة الأشهر فإن الله بريء من المشركين ورسوله ، ولا يحج هذا البيت بعد العام مشرك . قال : فكنت أنادي حتى صحل صوتي .\nوقال الشعبي : حدثني محرر بن أبي هريرة ، عن أبيه قال : كنت مع ابن أبي طالب - رضي الله عنه - حين بعثه رسول الله - صلى الله عليه وسلم - ينادي ، فكان إذا صحل ناديت . قلت : بأي شيء كنتم تنادون ؟ قال : بأربع : لا يطوف بالكعبة عريان ، ومن كان له عهد مع رسول الله - صلى الله عليه وسلم - فعهده إلى مدته ، ولا يدخل الجنة إلا نفس مؤمنة ، ولا يحج بعد عامنا مشرك .\nرواه ابن جرير من غير ما وجه ، عن الشعبي . ورواه شعبة ، عن مغيرة ، عن الشعبي ، به إلا أنه قال : ومن كان بينه وبين رسول الله - صلى الله عليه وسلم - عهد ، فعهده إلى أربعة أشهر . وذكر تمام الحديث .\nقال ابن جرير : وأخشى أن يكون وهما من بعض نقلته ؛ لأن الأخبار متظاهرة في الأجل بخلافه .\nوقال الإمام أحمد : حدثنا عفان ، حدثنا حماد ، عن سماك ، عن أنس بن مالك - رضي الله عنه - أن رسول الله - صلى الله عليه وسلم - بعث ب \" براءة \" مع أبي بكر ، فلما بلغ ذا الحليفة قال : لا يبلغها إلا أنا أو رجل من أهل بيتي . فبعث بها مع علي بن أبي طالب ، رضي الله عنه .\nورواه الترمذي في التفسير ، عن بندار ، عن عفان وعبد الصمد ، كلاهما عن حماد بن سلمة به ، ثم قال : حسن غريب من حديث أنس ، رضي الله عنه .\nوقال عبد الله بن أحمد بن حنبل : حدثنا محمد بن سليمان - لوين - حدثنا محمد بن جابر ، عن سماك ، عن حنش ، عن علي - رضي الله عنه - قال : لما نزلت عشر آيات من \" براءة \" على النبي - صلى الله عليه وسلم - دعا النبي - صلى الله عليه وسلم - أبا بكر ، فبعثه بها ليقرأها على أهل مكة ، ثم دعاني فقال : أدرك أبا بكر ، فحيثما لحقته فخذ الكتاب منه ، فاذهب إلى أهل مكة فاقرأه عليهم . فلحقته بالجحفة ، فأخذت الكتاب منه ، ورجع أبو بكر إلى النبي - صلى الله عليه وسلم - فقال : يا رسول الله ، نزل في شيء ؟ فقال : لا ولكن جبريل جاءني فقال : لن يؤدي عنك إلا أنت أو رجل منك .\nهذا إسناد فيه ضعف .\nوليس المراد أن أبا بكر - رضي الله عنه - رجع من فوره ، بل بعد قضائه للمناسك التي أمره عليها رسول الله - صلى الله عليه وسلم - كما جاء مبينا في الرواية الأخرى .\nوقال عبد الله أيضا : حدثني أبو بكر ، حدثنا عمرو بن حماد ، عن أسباط بن نصر ، عن سماك ، عن حنش ، عن علي - رضي الله عنه - أن رسول الله - صلى الله عليه وسلم - حين بعثه ب \" براءة \" قال : يا نبي الله ، إني لست باللسن ولا بالخطيب ، قال : ما بد لي أن أذهب بها أنا أو تذهب بها أنت . قال : فإن كان ولا بد فسأذهب أنا . قال : انطلق ، فإن الله يثبت لسانك ويهدي قلبك . قال : ثم وضع يده على فيه .\nوقال الإمام أحمد : حدثنا سفيان ، عن أبي إسحاق ، عن زيد بن يثيع - رجل من همدان - : سألنا عليا : بأي شيء بعثت ؟ يعني : يوم بعثه النبي - صلى الله عليه وسلم - مع أبي بكر في الحجة ، قال : بعثت بأربع : لا يدخل الجنة إلا نفس مؤمنة ، ولا يطوف بالبيت عريان ، ومن كان بينه وبين النبي - صلى الله عليه وسلم - عهد فعهده إلى مدته ، ولا يحج المشركون والمسلمون بعد عامهم هذا .\nورواه الترمذي عن قلابة ، عن سفيان بن عيينة ، به ، وقال : حسن صحيح .\nكذا قال ، ورواه شعبة ، عن أبي إسحاق فقال : عن زيد بن يثيع وهم فيه . ورواه الثوري ، عن أبي إسحاق ، عن بعض أصحابه ، عن علي ، رضي الله عنه .\nوقال ابن جرير : حدثنا ابن وكيع ، حدثنا أبو أسامة ، عن زكريا ، عن أبي إسحاق ، عن زيد بن يثيع ، عن علي قال : بعثني رسول الله - صلى الله عليه وسلم - حين أنزلت \" براءة \" بأربع : ألا يطوف بالبيت عريان ، ولا يقرب المسجد الحرام مشرك بعد عامهم هذا ، ومن كان بينه وبين رسول الله - صلى الله عليه وسلم - عهد فهو إلى مدته ، ولا يدخل الجنة إلا نفس مؤمنة .\nثم رواه ابن جرير ، عن محمد بن عبد الأعلى ، عن ابن ثور ، عن معمر ، عن أبي إسحاق ، عن الحارث ، عن علي قال : أمرت بأربع . فذكره .\nوقال إسرائيل ، عن أبي إسحاق ، عن زيد بن يثيع قال : نزلت براءة فبعث رسول الله - صلى الله عليه وسلم - أبا بكر ، ثم أرسل عليا ، فأخذها منه ، فلما رجع أبو بكر قال : نزل في شيء ؟ قال : لا ولكن أمرت أن أبلغها أنا أو رجل من أهل بيتي . فانطلق إلى أهل مكة ، فقام فيهم بأربع : لا يدخل مكة مشرك بعد عامه هذا ، ولا يطوف بالبيت عريان ، ولا يدخل الجنة إلا نفس مسلمة ، ومن كان بينه وبين رسول الله - صلى الله عليه وسلم - عهد ، فعهده إلى مدته .\nوقال محمد بن إسحاق ، عن حكيم بن حكيم بن عباد بن حنيف ، عن أبي جعفر محمد بن علي بن الحسين بن علي قال : لما نزلت \" براءة \" على رسول الله - صلى الله عليه وسلم - وقد كان بعث أبا بكر ليقيم الحج للناس ، فقيل : يا رسول الله ، لو بعثت إلى أبي بكر . فقال : لا يؤدي عني إلا رجل من أهل بيتي . ثم دعا عليا فقال : اخرج بهذه القصة من صدر براءة ، وأذن في الناس يوم النحر إذا اجتمعوا بمنى : أنه لا يدخل الجنة كافر ، ولا يحج بعد العام مشرك ، ولا يطف بالبيت عريان ، ومن كان له عند رسول الله - صلى الله عليه وسلم - عهد فعهده إلى مدته .\nفخرج علي - رضي الله عنه - على ناقة رسول الله - صلى الله عليه وسلم - العضباء ، حتى أدرك أبا بكر في الطريق فلما رآه أبو بكر قال : أمير أو مأمور ؟ قال : بل مأمور ، ثم مضيا فأقام أبو بكر للناس الحج ، [ والعرب ] إذ ذاك في تلك السنة على منازلهم من الحج التي كانوا عليها في الجاهلية حتى إذا كان يوم النحر ، قام علي بن أبي طالب فأذن في الناس بالذي أمره رسول الله - صلى الله عليه وسلم - فقال : يا أيها الناس ، إنه لا يدخل الجنة كافر ، ولا يحج بعد العام ، ولا يطف بالبيت عريان ، ومن كان له عهد عند رسول الله - صلى الله عليه وسلم - فهو إلى مدته . فلم يحج بعد ذلك العام مشرك ، ولم يطف بالبيت عريان ، ثم قدما على رسول الله - صلى الله عليه وسلم - . فكان هذا من \" براءة \" فيمن كان من أهل الشرك من أهل العهد العام ، وأهل المدة إلى الأجل المسمى .\nوقال ابن جرير : حدثنا محمد بن عبد الله بن عبد الحكم ، أخبرنا أبو زرعة وهب الله بن راشد ، أخبرنا حيوة بن شريح : أخبرنا أبو صخر : أنه سمع أبا معاوية البجلي من أهل الكوفة يقول : سمعت أبا الصهباء البكري وهو يقول : سألت علي بن أبي طالب عن \" يوم الحج الأكبر \" فقال : إن رسول الله - صلى الله عليه وسلم - بعث أبا بكر بن أبي قحافة يقيم للناس الحج ، وبعثني معه بأربعين آية من \" براءة \" ، حتى أتى عرفة فخطب الناس يوم عرفة ، فلما قضى خطبته التفت إلي فقال : قم يا علي ، فأد رسالة رسول الله - صلى الله عليه وسلم - فقمت فقرأت عليهم أربعين آية من \" براءة \" ، ثم صدرنا فأتينا منى ، فرميت الجمرة ونحرت البدنة ، ثم حلقت رأسي ، وعلمت أن أهل الجمع لم يكونوا حضروا كلهم خطبة أبي بكر يوم عرفة ، فطفت أتتبع بها الفساطيط أقرؤها عليهم ، فمن ثم إخال حسبتم أنه يوم النحر [ ألا وهو يوم النحر ] ألا وهو يوم عرفة .\nوقال عبد الرزاق ، عن معمر ، عن أبي إسحاق : سألت أبا جحيفة عن يوم الحج الأكبر ، قال : يوم عرفة . فقلت : أمن عندك أم من أصحاب محمد - صلى الله عليه وسلم - ؟ قال : كل في ذلك .\nوقال عبد الرزاق أيضا ، عن جريج ، عن عطاء قال : يوم الحج الأكبر ، يوم عرفة .\nوقال عمر بن الوليد الشني : حدثنا شهاب بن عباد العصري ، عن أبيه قال : سمعت عمر بن الخطاب يقول : هذا يوم عرفة ، هذا يوم الحج الأكبر ، فلا يصومنه أحد . قال : فحججت بعد أبي ، فأتيت المدينة ، فسألت عن أفضل أهلها ، فقالوا : سعيد بن المسيب ، فأتيته فقلت : إني سألت عن أفضل أهل المدينة فقالوا : سعيد بن المسيب ، فأخبرني عن صوم يوم عرفة ؟ فقال : أخبرك عمن هو أفضل مني مائة ضعف ، عمر - أو : ابن عمر - كان ينهى عن صومه ، ويقول هو يوم الحج الأكبر .\nرواه ابن جرير وابن أبي حاتم وهكذا روي عن ابن عباس ، وعبد الله بن الزبير ، ومجاهد ، وعكرمة ، وطاوس : أنهم قالوا : يوم عرفة هو يوم الحج الأكبر .\nوقد ورد فيه حديث مرسل رواه ابن جريج : أخبرت عن محمد بن قيس بن مخرمة أن رسول الله - صلى الله عليه وسلم - خطب يوم عرفة ، فقال : \" هذا يوم الحج الأكبر \" .\nوروي من وجه آخر عن ابن جريج ، عن محمد بن قيس ، عن المسور بن مخرمة عن رسول الله - صلى الله عليه وسلم - أنه خطبهم بعرفات فحمد الله وأثنى عليه ، ثم قال : أما بعد ، فإن هذا يوم الحج الأكبر .\nوالقول الثاني : أنه يوم النحر .\nقال هشيم ، عن إسماعيل بن أبي خالد ، عن الشعبي ، عن علي - رضي الله عنه - قال : يوم الحج الأكبر يوم النحر .\nوقال أبو إسحاق السبيعي ، عن الحارث الأعور ، سألت عليا - رضي الله عنه - عن يوم الحج الأكبر ، فقال : [ هو ] يوم النحر .\nوقال شعبة ، عن الحكم : سمعت يحيى بن الجزار يحدث عن علي - رضي الله عنه - أنه خرج يوم النحر على بغلة بيضاء يريد الجبانة ، فجاء رجل فأخذ بلجام دابته ، فسأله عن الحج الأكبر ، فقال : هو يومك هذا ، خل سبيلها .\nوقال عبد الرزاق ، عن سفيان عن شعبة عن عبد الملك بن عمير ، عن عبد الله بن أبي أوفى أنه قال : يوم الحج الأكبر يوم النحر .\nوروى شعبة وغيره ، عن عبد الملك بن عمير ، به نحوه . وهكذا رواه هشيم وغيره ، عن الشيباني عن عبد الله بن أبي أوفى .\nوقال الأعمش ، عن عبد الله بن سنان قال : خطبنا المغيرة بن شعبة يوم الأضحى على بعير فقال : هذا يوم الأضحى ، وهذا يوم النحر ، وهذا يوم الحج الأكبر .\nوقال حماد بن سلمة ، عن سماك ، عن عكرمة ، عن ابن عباس أنه قال : الحج الأكبر ، يوم النحر .\nوكذا روي عن أبي جحيفة ، وسعيد بن جبير ، وعبد الله بن شداد بن الهاد ، ونافع بن جبير بن مطعم ، والشعبي ، وإبراهيم النخعي ، ومجاهد ، وعكرمة ، وأبي جعفر الباقر ، والزهري ، وعبد الرحمن بن زيد بن أسلم أنهم قالوا : يوم الحج الأكبر هو يوم النحر . واختاره ابن جرير . وقد تقدم الحديث عن أبي هريرة في صحيح البخاري : أن أبا بكر بعثهم يوم النحر يؤذنون بمنى ، وقد ورد في ذلك أحاديث أخر ، كما قال الإمام أبو جعفر بن جرير : حدثني سهل بن محمد السجستاني ، حدثنا أبو جابر الحرمي ، حدثنا هشام بن الغاز الجرشي عن نافع ، عن ابن عمر قال : وقف رسول الله - صلى الله عليه وسلم - يوم النحر عند الجمرات في حجة الوداع ، فقال : \" هذا يوم الحج الأكبر \" .\nوهكذا رواه ابن أبي حاتم ، وابن مردويه من حديث أبي جابر - واسمه محمد بن عبد الملك ، به ، ورواه ابن مردويه أيضا من حديث الوليد بن مسلم ، عن هشام بن الغاز ، به . ثم رواه من حديث سعيد بن عبد العزيز ، عن نافع ، به .\nوقال شعبة ، عن عمرو بن مرة عن مرة الهمداني ، عن رجل من أصحاب النبي - صلى الله عليه وسلم - قال : قام فينا رسول الله - صلى الله عليه وسلم - على ناقة حمراء مخضرمة ، فقال : أتدرون أي يوم يومكم هذا ؟ قالوا : يوم النحر . قال : صدقتم ، يوم الحج الأكبر .\nوقال ابن جرير : حدثنا أحمد بن المقدام ، حدثنا يزيد بن زريع ، حدثنا ابن عون ، عن محمد بن سيرين ، عن عبد الرحمن بن أبي بكرة ، عن أبيه قال : لما كان ذلك اليوم ، قعد رسول الله - صلى الله عليه وسلم - على بعير له ، وأخذ الناس بخطامه - أو : زمامه - فقال : أي يوم هذا ؟ قال : فسكتنا حتى ظننا أنه سيسميه سوى اسمه ، فقال : أليس هذا يوم الحج الأكبر .\nوهذا إسناد صحيح ، وأصله مخرج في الصحيح .\nوقال أبو الأحوص ، عن شبيب بن غرقدة ، عن سليمان بن عمرو بن الأحوص ، عن أبيه قال : سمعت رسول الله - صلى الله عليه وسلم - في حجة الوداع ، فقال : أي يوم هذا ؟ فقالوا : اليوم الحج الأكبر .\nوعن سعيد بن المسيب أنه قال : يوم الحج الأكبر اليوم الثاني من يوم النحر . رواه ابن أبي حاتم . وقال مجاهد أيضا : يوم الحج الأكبر أيام الحج كلها .\nوكذا قال أبو عبيد ، قال سفيان : \" يوم الحج \" ، و \" يوم الجمل \" ، و \" يوم صفين \" أي : أيامه كلها .\nوقال سهل السراج : سئل الحسن البصري عن يوم الحج الأكبر ، فقال : ما لكم وللحج الأكبر ، ذاك عام حج فيه أبو بكر الذي استخلفه رسول الله - صلى الله عليه وسلم - فحج بالناس . رواه ابن أبي حاتم .\nوقال ابن جرير : حدثنا ابن وكيع ، حدثنا أبو أسامة ، عن ابن عون : سألت محمدا - يعني ابن سيرين - عن يوم الحج الأكبر فقال : كان يوما وافق فيه حج رسول الله - صلى الله عليه وسلم - حج أهل الوبر .\n                                    ",
        "qortoby": "وَأَذَٰنٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوۡمَ ٱلۡحَجِّ ٱلۡأَكۡبَرِ أَنَّ ٱللَّهَ بَرِيٓءٞ مِّنَ ٱلۡمُشۡرِكِينَ وَرَسُولُهُۥۚ فَإِن تُبۡتُمۡ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ ٣\n                                    \n                                    \n                                    قوله تعالى : وأذان من الله ورسوله إلى الناس يوم الحج الأكبر أن الله بريء من المشركين ورسوله فإن تبتم فهو خير لكم وإن توليتم فاعلموا أنكم غير معجزي الله وبشر الذين كفروا بعذاب أليم\nفيه ثلاث مسائل :\nالأولى : قوله تعالى وأذان الأذان : الإعلام لغة من غير خلاف . وهو عطف على براءة . إلى الناس الناس هنا جميع الخلق . يوم الحج الأكبر ظرف ، والعامل فيه أذان . وإن كان قد وصف بقوله : من الله ، فإن رائحة الفعل فيه باقية ، وهي عاملة في الظروف . وقيل : العامل فيه مخزي ولا يصح عمل أذان ؛ لأنه قد وصف فخرج عن حكم الفعل .\nالثانية : واختلف العلماء في الحج الأكبر ، فقيل : يوم عرفة . روي عن عمر وعثمان وابن عباس وطاوس ومجاهد . وهو مذهب أبي حنيفة ، وبه قال الشافعي . وعن علي وابن عباس أيضا وابن مسعود وابن أبي أوفى والمغيرة بن شعبة أنه يوم النحر . واختاره الطبري . وروى ابن عمر أن رسول الله صلى الله عليه وسلم وقف يوم النحر في الحجة التي حج فيها فقال : أي يوم هذا فقالوا : يوم النحر ، فقال : هذا يوم الحج الأكبر . أخرجه أبو داود . وخرج البخاري عن أبي هريرة قال : بعثني أبو بكر الصديق رضي الله عنه فيمن يؤذن يوم النحر بمنى : لا يحج بعد العام مشرك ولا يطوف بالبيت عريان . ويوم الحج الأكبر يوم النحر . وإنما قيل ( الأكبر ) من أجل قول الناس : الحج الأصغر . فنبذ أبو بكر إلى الناس في ذلك العام ، فلم يحج عام حجة الوداع الذي حج فيه النبي صلى الله عليه وسلم مشرك . وقال ابن أبي أوفى : يوم النحر يوم الحج الأكبر ، يهراق فيه الدم ، ويوضع فيه الشعر ، ويلقى فيه التفث ، وتحل فيه الحرم . وهذا مذهب مالك ؛ لأن يوم النحر فيه كالحج كله ؛ لأن الوقوف إنما هو ليلته ، والرمي والنحر والحلق والطواف في صبيحته . احتج الأولون بحديث مخرمة أن النبي صلى الله عليه وسلم قال : يوم الحج الأكبر يوم عرفة . رواه إسماعيل القاضي . وقال الثوري وابن جريج : الحج الأكبر أيام منى كلها . وهذا كما يقال : يوم صفين ويوم الجمل ويوم بعاث ، فيراد به الحين والزمان لا نفس اليوم . وروي عن مجاهد : الحج الأكبر القران ، والأصغر الإفراد . وهذا ليس من الآية في شيء . وعنه وعن عطاء : الحج الأكبر الذي فيه الوقوف بعرفة ، والأصغر العمرة . وعن مجاهد أيضا : أيام الحج كلها . وقال الحسن وعبد الله بن الحارث بن نوفل : إنما سمي يوم الحج الأكبر لأنه حج ذلك العام المسلمون والمشركون ، واتفقت فيه يومئذ أعياد الملل : اليهود والنصارى والمجوس . قال ابن عطية : وهذا ضعيف أن يصفه الله عز وجل في كتابه بالأكبر لهذا . وعن الحسن أيضا : إنما سمي الأكبر لأنه حج فيه أبو بكر ونبذت فيه العهود . وهذا الذي يشبه نظر الحسن . وقال ابن سيرين : يوم الحج الأكبر العام الذي حج فيه النبي صلى الله عليه وسلم حجة الوداع ، وحجت معه فيه الأمم .\nالثالثة : قوله تعالى أن الله بريء من المشركين ورسوله ( أن ) بالفتح في موضع نصب . والتقدير بأن الله . ومن قرأ بالكسر قدره بمعنى قال إن الله . ( بريء ) خبر إن . ( ورسوله ) عطف على الموضع ، وإن شئت على المضمر المرفوع في ( بريء ) . كلاهما حسن ; لأنه قد طال الكلام . وإن شئت على الابتداء والخبر محذوف ; التقدير : ورسوله بريء منهم . ومن قرأ ( ورسوله ) بالنصب - وهو الحسن وغيره - عطفه على اسم الله عز وجل على اللفظ . وفي الشواذ ( ورسوله ) بالخفض على القسم ، أي وحق رسوله ; ورويت عن الحسن . وقد تقدمت قصة عمر فيها أول الكتاب .\nفإن تبتم أي عن الشرك فهو خير لكم أي أنفع لكم وإن توليتم أي عن الإيمان فاعلموا أنكم غير معجزي الله أي فائتيه ; فإنه محيط بكم ومنزل عقابه عليكم .\n                                    ",
        "saadi": "وَأَذَٰنٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوۡمَ ٱلۡحَجِّ ٱلۡأَكۡبَرِ أَنَّ ٱللَّهَ بَرِيٓءٞ مِّنَ ٱلۡمُشۡرِكِينَ وَرَسُولُهُۥۚ فَإِن تُبۡتُمۡ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ ٣\n                                        \n                                        \n                                        \n                                        هذا ما وعد اللّه به المؤمنين، من نصر دينه وإعلاء كلمته، وخذلان أعدائهم من المشركين الذين أخرجوا الرسول ومن معه من مكة، من بيت اللّه الحرام، وأجلوهم، مما لهم التسلط عليه من أرض الحجاز‏.‏ نصر اللّه رسوله والمؤمنين حتى افتتح مكة، وأذل المشركين، وصار للمؤمنين الحكم والغلبة على تلك الديار‏.‏ فأمر النبي مؤذنه أن يؤذن يوم الحج الأكبر، وهو يوم النحر، وقت اجتماع الناس مسلمهم وكافرهم، من جميع جزيرة العرب، أن يؤذن بأن اللّه بريء ورسوله من المشركين، فليس لهم عنده عهد وميثاق، فأينما وجدوا قتلوا، وقيل لهم‏:‏ لا تقربوا المسجد الحرام بعد عامكم هذا، وكان ذلك سنة تسع من الهجرة‏.‏ وحج بالناس أبو بكر الصديق رضي اللّه عنه، وأذن ببراءة ـ يوم النحر ـ ابن عم رسول اللّه ـ صلى الله عليه وسلم ـ علي بن أبي طالب رضي اللّه عنه‏.‏ ثم رغب تعالى المشركين بالتوبة، ورهبهم من الاستمرار على الشرك فقال‏:‏ ‏{‏فَإِنْ تُبْتُمْ فَهُوَ خَيْرٌ لَكُمْ وَإِنْ تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ‏}‏ أي‏:‏ فائتيه، بل أنتم في قبضته، قادر أن يسلط عليكم عباده المؤمنين‏.‏ ‏{‏وَبَشِّرِ الَّذِينَ كَفَرُوا بِعَذَابٍ أَلِيمٍ‏}‏ أي‏:‏ مؤلم مفظع في الدنيا بالقتل والأسر، والجلاء، وفي الآخرة، بالنار، وبئس القرار‏.‏\n                                    "
      },
      "originalText": "وَأَذَٰنٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوۡمَ ٱلۡحَجِّ ٱلۡأَكۡبَرِ أَنَّ ٱللَّهَ بَرِيٓءٞ مِّنَ ٱلۡمُشۡرِكِينَ وَرَسُولُهُۥۚ فَإِن تُبۡتُمۡ فَهُوَ خَيۡرٞ لَّكُمۡۖ وَإِن تَوَلَّيۡتُمۡ فَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ ٣"
    },
    {
      "number": 1239,
      "text": "إِلَّا الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ ثُمَّ لَمْ يَنْقُصُوكُمْ شَيْئًا وَلَمْ يُظَاهِرُوا عَلَيْكُمْ أَحَدًا فَأَتِمُّوا إِلَيْهِمْ عَهْدَهُمْ إِلَىٰ مُدَّتِهِمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 4,
      "juz": 10,
      "manzil": 2,
      "page": 187,
      "ruku": 156,
      "hizbQuarter": 75,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّا ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ثُمَّ لَمۡ يَنقُصُوكُمۡ شَيۡ‍ٔٗا وَلَمۡ يُظَٰهِرُواْ عَلَيۡكُمۡ أَحَدٗا فَأَتِمُّوٓاْ إِلَيۡهِمۡ عَهۡدَهُمۡ إِلَىٰ مُدَّتِهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ ٤\n                                    \n                                    \n                                    هذا استثناء من ضرب مدة التأجيل بأربعة أشهر ، لمن له عهد مطلق ليس بمؤقت ، فأجله ، أربعة أشهر يسيح في الأرض ، يذهب فيها لينجو بنفسه حيث شاء ، إلا من له عهد مؤقت ، فأجله إلى مدته المضروبة التي عوهد عليها ، وقد تقدمت الأحاديث : ومن كان له عهد مع رسول الله - صلى الله عليه وسلم - فعهده إلى مدته وذلك بشرط ألا ينقض المعاهد عهده ، ولم يظاهر على المسلمين أحدا ، أي : يمالئ عليهم من سواهم ، فهذا الذي يوفى له بذمته وعهده إلى مدته ؛ ولهذا حرض الله تعالى على الوفاء بذلك فقال : ( إن الله يحب المتقين ) أي : الموفين بعهدهم .\n                                    ",
        "qortoby": "إِلَّا ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ثُمَّ لَمۡ يَنقُصُوكُمۡ شَيۡ‍ٔٗا وَلَمۡ يُظَٰهِرُواْ عَلَيۡكُمۡ أَحَدٗا فَأَتِمُّوٓاْ إِلَيۡهِمۡ عَهۡدَهُمۡ إِلَىٰ مُدَّتِهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ ٤\n                                    \n                                    \n                                    قوله تعالى إلا الذين عاهدتم من المشركين ثم لم ينقصوكم شيئا ولم يظاهروا عليكم أحدا فأتموا إليهم عهدهم إلى مدتهم إن الله يحب المتقين\nقوله تعالى إلا الذين عاهدتم من المشركين في موضع نصب بالاستثناء المتصل ، المعنى : أن الله بريء من المشركين إلا من المعاهدين في مدة عهدهم . وقيل : الاستثناء منقطع ، أي أن الله بريء منهم ولكن الذين عاهدتم فثبتوا على العهد فأتموا إليهم عهدهم .\nوقوله لم ينقصوكم يدل على أنه كان من أهل العهد من خاس بعهده ومنهم من ثبت على الوفاء ، فأذن الله سبحانه لنبيه صلى الله عليه وسلم في نقض عهد من خاس ، وأمر بالوفاء لمن بقي على عهده إلى مدته . ومعنى لم ينقصوكم أي من شروط العهد شيئا .\nولم يظاهروا عليكم أحدا لم يعاونوا . وقرأ عكرمة وعطاء بن يسار \" ثم لم ينقضوكم \" بالضاد معجمة على حذف مضاف ، التقدير ثم لم ينقضوا عهدهم . يقال : إن هذا مخصوص يراد به بنو ضمرة خاصة .\nفأتموا إليهم عهدهم إلى مدتهم أي وإن كانت أكثر من أربعة أشهر .\n                                    ",
        "saadi": "إِلَّا ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ثُمَّ لَمۡ يَنقُصُوكُمۡ شَيۡ‍ٔٗا وَلَمۡ يُظَٰهِرُواْ عَلَيۡكُمۡ أَحَدٗا فَأَتِمُّوٓاْ إِلَيۡهِمۡ عَهۡدَهُمۡ إِلَىٰ مُدَّتِهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ ٤\n                                        \n                                        \n                                        \n                                        أي هذه البراءة التامة المطلقة من جميع المشركين‏.‏ ‏{‏إِلَّا الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ‏}‏ واستمروا على عهدهم، ولم يجر منهم ما يوجب النقض، فلا نقصوكم شيئًا، ولا عاونوا عليكم أحدا، فهؤلاء أتموا لهم عهدهم إلى مدتهم، قَلَّتْ، أو كثرت، لأن الإسلام لا يأمر بالخيانة وإنما يأمر بالوفاء‏.‏ ‏{‏إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ‏}‏ الذين أدوا ما أمروا به، واتقوا الشرك والخيانة، وغير ذلك من المعاصي‏.‏\n                                    "
      },
      "originalText": "إِلَّا ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ ثُمَّ لَمۡ يَنقُصُوكُمۡ شَيۡ‍ٔٗا وَلَمۡ يُظَٰهِرُواْ عَلَيۡكُمۡ أَحَدٗا فَأَتِمُّوٓاْ إِلَيۡهِمۡ عَهۡدَهُمۡ إِلَىٰ مُدَّتِهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ ٤"
    },
    {
      "number": 1240,
      "text": "فَإِذَا انْسَلَخَ الْأَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدْتُمُوهُمْ وَخُذُوهُمْ وَاحْصُرُوهُمْ وَاقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ ۚ فَإِنْ تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَخَلُّوا سَبِيلَهُمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 5,
      "juz": 10,
      "manzil": 2,
      "page": 187,
      "ruku": 156,
      "hizbQuarter": 75,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٥\n                                    \n                                    \n                                    اختلف المفسرون في المراد بالأشهر الحرم هاهنا ، ما هي ؟ فذهب ابن جرير إلى أنها [ الأربعة ] المذكورة في قوله تعالى : ( منها أربعة حرم ذلك الدين القيم فلا تظلموا فيهن أنفسكم ) الآية [ التوبة : 36 ] قاله أبو جعفر الباقر ، لكن قال ابن جرير : آخر الأشهر الحرم في حقهم المحرم وهذا الذي ذهب إليه حكاه علي بن أبي طلحة عن ابن عباس ، وإليه ذهب الضحاك أيضا ، وفيه نظر ، والذي يظهر من حيث السياق ما ذهب إليه ابن عباس في رواية العوفي عنه ، وبه قال مجاهد ، وعمرو بن شعيب ، ومحمد بن إسحاق ، وقتادة ، والسدي ، وعبد الرحمن بن زيد بن أسلم : أن المراد بها أشهر التسيير الأربعة المنصوص عليها في قوله : ( فسيحوا في الأرض أربعة أشهر ) [ التوبة : 2 ] ثم قال ( فإذا انسلخ الأشهر الحرم ) أي : إذا انقضت الأشهر الأربعة التي حرمنا عليكم فيها قتالهم ، وأجلناهم فيها ، فحيثما وجدتموهم فاقتلوهم ؛ لأن عود العهد على مذكور أولى من مقدر ؛ ثم إن الأشهر الأربعة المحرمة سيأتي بيان حكمها في آية أخرى بعد في هذه السورة الكريمة .\nوقوله : ( فاقتلوا المشركين حيث وجدتموهم ) أي : من الأرض . وهذا عام ، والمشهور تخصيصه بتحريم القتال في الحرم بقوله : ( ولا تقاتلوهم عند المسجد الحرام حتى يقاتلوكم فيه فإن قاتلوكم فاقتلوهم ) [ البقرة : 191 ] .\nوقوله : ( وخذوهم ) أي : وأسروهم ، إن شئتم قتلا وإن شئتم أسرا .\nوقوله : ( واحصروهم واقعدوا لهم كل مرصد ) أي : لا تكتفوا بمجرد وجدانكم لهم ، بل اقصدوهم بالحصار في معاقلهم وحصونهم ، والرصد في طرقهم ومسالكهم حتى تضيقوا عليهم الواسع ، وتضطروهم إلى القتل أو الإسلام ؛ ولهذا قال : ( فإن تابوا وأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم إن الله غفور رحيم )\nولهذا اعتمد الصديق - رضي الله عنه - في قتال مانعي الزكاة على هذه الآية الكريمة وأمثالها ، حيث حرمت قتالهم بشرط هذه الأفعال ، وهي الدخول في الإسلام ، والقيام بأداء واجباته . ونبه بأعلاها على أدناها ، فإن أشرف الأركان بعد الشهادة الصلاة التي هي حق الله - عز وجل - وبعدها أداء الزكاة التي هي نفع متعد إلى الفقراء والمحاويج ، وهي أشرف الأفعال المتعلقة بالمخلوقين ؛ ولهذا كثيرا ما يقرن الله بين الصلاة والزكاة ، وقد جاء في الصحيحين عن ابن عمر - رضي الله عنهما - عن رسول الله - صلى الله عليه وسلم - أنه قال : أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله ، ويقيموا الصلاة ، ويؤتوا الزكاة الحديث .\nوقال أبو إسحاق ، عن أبي عبيدة ، عن عبد الله بن مسعود - رضي الله عنه - قال : أمرتم بإقام الصلاة وإيتاء الزكاة ، ومن لم يزك فلا صلاة له .\nوقال عبد الرحمن بن زيد بن أسلم : أبى الله أن يقبل الصلاة إلا بالزكاة ، وقال : يرحم الله أبا بكر ، ما كان أفقهه .\nوقال الإمام أحمد : حدثنا علي بن إسحاق ، أنبأنا عبد الله بن المبارك ، أنبأنا حميد الطويل ، عن أنس ؛ أن رسول الله - صلى الله عليه وسلم - قال : أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله ، فإذا شهدوا أن لا إله إلا الله وأن محمدا رسول الله ، واستقبلوا قبلتنا ، وأكلوا ذبيحتنا ، وصلوا صلاتنا ، فقد حرمت علينا دماؤهم وأموالهم إلا بحقها ، لهم ما للمسلمين ، وعليهم ما عليهم .\nورواه البخاري في صحيحه وأهل السنن إلا ابن ماجه ، من حديث عبد الله بن المبارك ، به .\nوقال الإمام أبو جعفر بن جرير : حدثنا عبد الأعلى بن واصل الأسدي ، حدثنا عبيد الله بن موسى ، أخبرنا أبو جعفر الرازي ، عن الربيع بن أنس [ عن أنس ] قال : قال رسول الله - صلى الله عليه وسلم - : من فارق الدنيا على الإخلاص لله وحده ، وعبادته لا يشرك به شيئا ، فارقها والله عنه راض - قال : وقال أنس : هو دين الله الذي جاءت به الرسل وبلغوه عن ربهم ، قبل هرج الأحاديث ، واختلاف الأهواء ، وتصديق ذلك في كتاب الله في آخر ما أنزل ، قال الله تعالى : ( فإن تابوا وأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم ) - قال : توبتهم خلع الأوثان ، وعبادة ربهم ، وإقام الصلاة ، وإيتاء الزكاة ، ثم قال في آية أخرى : ( فإن تابوا وأقاموا الصلاة وآتوا الزكاة فإخوانكم في الدين ) [ التوبة : 11 ] .\nورواه ابن مردويه .\nورواه محمد بن نصر المروزي في كتاب \" الصلاة \" له : حدثنا إسحاق بن إبراهيم ، أنبأنا حكام بن سلم حدثنا أبو جعفر الرازي ، به سواء .\nوهذه الآية الكريمة هي آية السيف التي قال فيها الضحاك بن مزاحم : إنها نسخت كل عهد بين النبي - صلى الله عليه وسلم - وبين أحد من المشركين ، وكل عهد ، وكل مدة .\nوقال العوفي ، عن ابن عباس في هذه الآية : لم يبق لأحد من المشركين عهد ولا ذمة ، منذ نزلت براءة وانسلاخ الأشهر الحرم ، ومدة من كان له عهد من المشركين قبل أن تنزل أربعة أشهر ، من يوم أذن ببراءة إلى عشر من أول شهر ربيع الآخر .\nوقال علي بن أبي طلحة ، عن ابن عباس في هذه الآية ، قال : أمره الله تعالى أن يضع السيف فيمن عاهد إن لم يدخلوا في الإسلام ، ونقض ما كان سمى لهم من العقد والميثاق ، وأذهب الشرط الأول .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا إسحاق بن موسى الأنصاري قال : قال سفيان قال علي بن أبي طالب : بعث النبي - صلى الله عليه وسلم - بأربعة أسياف : سيف في المشركين من العرب قال الله : ( فاقتلوا المشركين حيث وجدتموهم [ وخذوهم ] )\nهكذا رواه مختصرا ، وأظن أن السيف الثاني هو قتال أهل الكتاب في قوله : ( قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون ) [ التوبة : 29 ] والسيف الثالث : قتال المنافقين في قوله : ( ياأيها النبي جاهد الكفار والمنافقين ) [ واغلظ عليهم ] ) [ التوبة : 73 ، والتحريم : 9 ] والرابع : قتال الباغين في قوله : ( وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله ) [ الحجرات : 9 ] .\nثم اختلف المفسرون في آية السيف هذه ، فقال الضحاك والسدي : هي منسوخة بقوله تعالى : ( فإما منا بعد وإما فداء ) [ محمد : 4 ] وقال قتادة بالعكس .\n                                    ",
        "qortoby": "فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٥\n                                    \n                                    \n                                    قوله تعالى فإذا انسلخ الأشهر الحرم فاقتلوا المشركين حيث وجدتموهم وخذوهم واحصروهم واقعدوا لهم كل مرصد فإن تابوا وأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم إن الله غفور رحيم\nفيه ست مسائل :\nالأولى : قوله تعالى فإذا انسلخ الأشهر الحرم أي خرج ، وسلخت الشهر إذا صرت في أواخر أيامه ، تسلخه سلخا وسلوخا بمعنى خرجت منه . وقال الشاعر :\nإذا ما سلخت الشهر أهللت قبله كفى قاتلا سلخي الشهور وإهلالي\nوانسلخ الشهر وانسلخ النهار من الليل المقبل . وسلخت المرأة درعها نزعته وفي التنزيل : وآية لهم الليل نسلخ منه النهار . ونخلة مسلاخ ، وهي التي ينتثر بسرها أخضر .\nوالأشهر الحرم فيها للعلماء قولان : قيل هي الأشهر المعروفة ، ثلاثة سرد وواحد فرد . قال الأصم : أريد به من لا عقد له من المشركين ، فأوجب أن يمسك عن قتالهم حتى ينسلخ الحرم ، وهو مدة خمسين يوما على ما ذكره ابن عباس ؛ لأن النداء كان بذلك يوم النحر . وقد تقدم هذا . وقيل : شهور العهد أربعة ، قاله مجاهد وابن إسحاق وابن زيد وعمرو بن شعيب . وقيل لها حرم لأن الله حرم على المؤمنين فيها دماء المشركين والتعرض لهم إلا على سبيل الخير .\nالثانية : قوله تعالى فاقتلوا المشركين عام في كل مشرك ، لكن السنة خصت منه ما تقدم بيانه في سورة ( البقرة ) من امرأة وراهب وصبي وغيرهم . وقال الله تعالى في أهل الكتاب : حتى يعطوا الجزية . إلا أنه يجوز أن يكون لفظ المشركين لا يتناول أهل الكتاب ، ويقتضي ذلك منع أخذ الجزية من عبدة الأوثان وغيرهم ، على ما يأتي بيانه . واعلم أن مطلق قوله : اقتلوا المشركين يقتضي جواز قتلهم بأي وجه كان ، إلا أن الأخبار وردت بالنهي عن المثلة . ومع هذا فيجوز أن يكون الصديق رضي الله عنه حين قتل أهل الردة بالإحراق بالنار ، وبالحجارة وبالرمي من رءوس الجبال ، والتنكيس في الآبار ، تعلق بعموم الآية . وكذلك إحراق علي رضي الله عنه قوما من أهل الردة يجوز أن يكون ميلا إلى هذا المذهب ، واعتمادا على عموم اللفظ . والله أعلم .\nالثالثة : قوله تعالى حيث وجدتموهم عام في كل موضع . وخص أبو حنيفة رضي الله عنه المسجد الحرام ، كما سبق في سورة \" البقرة \" ثم اختلفوا ، فقال الحسين بن الفضل : نسخت هذه كل آية في القرآن فيها ذكر الإعراض والصبر على أذى الأعداء . وقال الضحاك والسدي وعطاء : هي منسوخة بقوله : فإما منا بعد وإما فداء . وأنه لا يقتل أسير صبرا ، إما أن يمن عليه وإما أن يفادى . وقال مجاهد وقتادة : بل هي ناسخة لقوله تعالى : فإما منا بعد وإما فداء وأنه لا يجوز في الأسارى من المشركين إلا القتل . وقال ابن زيد : الآيتان محكمتان . وهو الصحيح ؛ لأن المن والقتل والفداء لم يزل من حكم رسول الله صلى الله عليه وسلم فيهم من أول حرب حاربهم ، وهو يوم بدر كما سبق .\nوقوله وخذوهم والأخذ هو الأسر . والأسر إنما يكون للقتل أو الفداء أو المن على ما يراه الإمام .\nومعنى واحصروهم يريد عن التصرف إلى بلادكم والدخول إليكم ، إلا أن تأذنوا لهم فيدخلوا إليكم بأمان .\nالرابعة : قوله تعالى واقعدوا لهم كل مرصد المرصد : الموضع الذي يرقب فيه العدو ، يقال : رصدت فلانا أرصده ، أي رقبته . أي اقعدوا لهم في مواضع الغرة حيث يرصدون . قال عامر بن الطفيل :\nولقد علمت وما إخالك ناسيا أن المنية للفتى بالمرصد\nوقال عدي :\nأعاذل إن الجهل من لذة الفتى وإن المنايا للنفوس بمرصد\nوفي هذا دليل على جواز اغتيالهم قبل الدعوة . ونصب ( كل ) على الظرف ، وهو اختيار الزجاج ، ويقال : ذهبت طريقا وذهبت كل طريق . أو بإسقاط الخافض ، التقدير : في كل مرصد وعلى كل مرصد ، فيجعل المرصد اسما للطريق . وخطأ أبو علي الزجاج في جعله الطريق ظرفا وقال : الطريق مكان مخصوص كالبيت والمسجد ، فلا يجوز حذف حرف الجر منه إلا فيما ورد فيه الحذف سماعا ، كما حكى سيبويه : دخلت الشام ودخلت البيت ، وكما قيل :\nكما عسل الطريق الثعلب\nالخامسة : قوله تعالى فإن تابوا أي من الشرك .\nوأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم هذه الآية فيها تأمل ، وذلك أن الله تعالى علق القتل على الشرك ، ثم قال : فإن تابوا . والأصل أن القتل متى كان للشرك يزول بزواله ، وذلك يقتضي زوال القتل بمجرد التوبة ، من غير اعتبار إقامة الصلاة وإيتاء الزكاة ، ولذلك سقط القتل بمجرد التوبة قبل وقت الصلاة والزكاة . وهذا بين في هذا المعنى ، غير أن الله تعالى ذكر التوبة وذكر معها شرطين آخرين ، فلا سبيل إلى إلغائهما . نظيره قوله صلى الله عليه وسلم : أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله ويقيموا الصلاة ويؤتوا الزكاة ، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحقها ، وحسابهم على الله . وقال أبو بكر الصديق رضي الله عنه : والله لأقاتلن من فرق بين الصلاة والزكاة ، فإن الزكاة حق المال وقال ابن عباس : رحم الله أبا بكر ما كان أفقهه . وقال ابن العربي : فانتظم القرآن والسنة واطردا . ولا خلاف بين المسلمين أن من ترك الصلاة وسائر الفرائض مستحلا كفر ، ومن ترك السنن متهاونا فسق ، ومن ترك النوافل لم يحرج ، إلا أن يجحد فضلها ؛ فيكفر ؛ لأنه يصير رادا على الرسول عليه السلام ما جاء به وأخبر عنه . واختلفوا فيمن ترك الصلاة من غير جحد لها ولا استحلال ، فروى يونس بن عبد الأعلى قال : سمعت ابن وهب يقول قال مالك : من آمن بالله وصدق المرسلين وأبى أن يصلي قتل ، وبه قال أبو ثور وجميع أصحاب الشافعي . وهو قول حماد بن زيد ومكحول ووكيع . وقال أبو حنيفة : يسجن ويضرب ولا يقتل ، وهو قول ابن شهاب وبه يقول داود بن علي . ومن حجتهم قوله صلى الله عليه وسلم : أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوا ذلك عصموا مني دماءهم وأموالهم إلا بحقها . وقالوا : حقها الثلاث التي قال النبي صلى الله عليه وسلم : لا يحل دم امرئ مسلم إلا بإحدى ثلاث كفر بعد إيمان ، أو زنى بعد إحصان ، أو قتل نفس بغير نفس . وذهبت جماعة من الصحابة والتابعين إلى أن من ترك صلاة واحدة متعمدا حتى يخرج وقتها لغير عذر ، وأبى من أدائها وقضائها وقال لا أصلي فإنه كافر ، ودمه وماله حلالان ، ولا يرثه ورثته من المسلمين ، ويستتاب ، فإن تاب وإلا قتل ، وحكم ماله كحكم مال المرتد ، وهو قول إسحاق . قال إسحاق : وكذلك كان رأي أهل العلم من لدن النبي صلى الله عليه وسلم إلى زماننا هذا .\nوقال ابن خويزمنداد : واختلف أصحابنا متى يقتل تارك الصلاة ، فقال بعضهم في آخر الوقت المختار ، وقال بعضهم : آخر وقت الضرورة ، وهو الصحيح من ذلك . وذلك أن يبقى من وقت العصر أربع ركعات إلى مغيب الشمس ، ومن الليل أربع ركعات لوقت العشاء ، ومن الصبح ركعتان قبل طلوع الشمس . وقال إسحاق : وذهاب الوقت أن يؤخر الظهر إلى غروب الشمس والمغرب إلى طلوع الفجر .\nالسادسة : هذه الآية دالة على أن من قال : قد تبت أنه لا يجتزأ بقوله حتى ينضاف إلى ذلك أفعاله المحققة للتوبة ؛ لأن الله عز وجل شرط هنا مع التوبة إقام الصلاة ، وإيتاء الزكاة ؛ ليحقق بهما التوبة . وقال في آية الربا وإن تبتم فلكم رءوس أموالكم . وقال : إلا الذين تابوا وأصلحوا وبينوا وقد تقدم معنى هذا في سورة البقرة .\n                                    ",
        "saadi": "فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٥\n                                        \n                                        \n                                        \n                                        يقول تعالى ‏{‏فَإِذَا انْسَلَخَ الْأَشْهُرُ الْحُرُمُ‏}‏ أي‏:‏ التي حرم فيها قتال المشركين المعاهدين، وهي أشهر التسيير الأربعة، وتمام المدة لمن له مدة أكثر منها، فقد برئت منهم الذمة‏.‏ ‏{‏فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدْتُمُوهُمْ‏}‏ في أي مكان وزمان، ‏{‏وَخُذُوهُمْ‏}‏ أسرى ‏{‏وَاحْصُرُوهُمْ‏}‏ أي‏:‏ ضيقوا عليهم، فلا تدعوهم يتوسعون في بلاد اللّه وأرضه، التي جعلها ‏[‏الله‏]‏ معبدا لعباده‏.‏ فهؤلاء ليسوا أهلا لسكناها، ولا يستحقون منها شبرا، لأن الأرض أرض اللّه، وهم أعداؤه المنابذون له ولرسله، المحاربون الذين يريدون أن يخلو الأرض من دينه، ويأبى اللّه إلا أن يتم نوره ولو كره الكافرون‏.‏ ‏{‏وَاقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ‏}‏ أي‏:‏ كل ثنية وموضع يمرون عليه، ورابطوا في جهادهم وابذلوا غاية مجهودكم في ذلك، ولا تزالوا على هذا الأمر حتى يتوبوا من شركهم‏.‏ ولهذا قال‏:‏ ‏{‏فَإِنْ تَابُوا‏}‏ من شركهم ‏{‏وَأَقَامُوا الصَّلَاةَ‏}‏ أي‏:‏ أدوها بحقوقها ‏{‏وَآتُوا الزَّكَاةَ‏}‏ لمستحقيها ‏{‏فَخَلُّوا سَبِيلَهُمْ‏}‏ أي‏:‏ اتركوهم، وليكونوا مثلكم، لهم ما لكم، وعليهم ما عليكم‏.‏ ‏{‏إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ‏}‏ يغفر الشرك فما دونه، للتائبين، ويرحمهم بتوفيقهم للتوبة، ثم قبولها منهم‏.‏ وفي هذه الآية، دليل على أن من امتنع من أداء الصلاة أو الزكاة، فإنه يقاتل حتى يؤديهما، كما استدل بذلك أبو بكر الصديق رضي اللّه عنه‏.‏\n                                    "
      },
      "originalText": "فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٥"
    },
    {
      "number": 1241,
      "text": "وَإِنْ أَحَدٌ مِنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْلَمُونَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 6,
      "juz": 10,
      "manzil": 2,
      "page": 187,
      "ruku": 156,
      "hizbQuarter": 75,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ ٦\n                                    \n                                    \n                                    يقول تعالى لنبيه ، صلوات الله وسلامه عليه : ( وإن أحد من المشركين ) الذين أمرتك بقتالهم ، وأحللت لك استباحة نفوسهم وأموالهم ، ( استجارك ) أي : استأمنك ، فأجبه إلى طلبته ( حتى يسمع كلام الله ) أي : [ القرآن ] تقرؤه عليه وتذكر له شيئا من [ أمر ] الدين تقيم عليه به حجة الله ، ( ثم أبلغه مأمنه ) أي : وهو آمن مستمر الأمان حتى يرجع إلى بلاده وداره ومأمنه ، ( ذلك بأنهم قوم لا يعلمون ) أي : إنما شرعنا أمان مثل هؤلاء ليعلموا دين الله ، وتنتشر دعوة الله في عباده .\nوقال ابن أبي نجيح ، عن مجاهد ، في تفسير هذه الآية ، قال : إنسان يأتيك يسمع ما تقول وما أنزل عليك ، فهو آمن حتى يأتيك فيسمع كلام الله ، وحتى يبلغ مأمنه ، حيث جاء .\nومن هذا كان رسول الله - صلى الله عليه وسلم - يعطي الأمان لمن جاءه ، مسترشدا أو في رسالة ، كما جاءه يوم الحديبية جماعة من الرسل من قريش ، منهم : عروة بن مسعود ، ومكرز بن حفص ، وسهيل بن عمرو ، وغيرهم واحدا بعد واحد ، يترددون في القضية بينه وبين المشركين ، فرأوا من إعظام المسلمين رسول الله - صلى الله عليه وسلم - ما بهرهم وما لم يشاهدوه عند ملك ولا قيصر ، فرجعوا إلى قومهم فأخبروهم بذلك ، وكان ذلك وأمثاله من أكبر أسباب هداية أكثرهم .\nولهذا أيضا لما قدم رسول مسيلمة الكذاب على رسول الله - صلى الله عليه وسلم - قال له : أتشهد أن مسيلمة رسول الله ؟ قال : نعم . فقال رسول الله - صلى الله عليه وسلم - : لولا أن الرسل لا تقتل لضربت عنقك وقد قيض الله له ضرب العنق في إمارة ابن مسعود على الكوفة ، وكان يقال له : ابن النواحة ، ظهر عنه في زمان ابن مسعود أنه يشهد لمسيلمة بالرسالة ، فأرسل إليه ابن مسعود فقال له : إنك الآن لست في رسالة ، وأمر به فضربت عنقه ، لا رحمه الله ، ولعنه .\nوالغرض أن من قدم من دار الحرب إلى دار الإسلام في أداء رسالة أو تجارة ، أو طلب صلح أو مهادنة أو حمل جزية ، أو نحو ذلك من الأسباب ، فطلب من الإمام أو نائبه أمانا ، أعطي أمانا ما دام مترددا في دار الإسلام ، وحتى يرجع إلى مأمنه ووطنه . لكن قال العلماء : لا يجوز أن يمكن من الإقامة في دار الإسلام سنة ، ويجوز أن يمكن من إقامة أربعة أشهر ، وفيما بين ذلك فيما زاد على أربعة أشهر ونقص عن سنة قولان ، عن الإمام الشافعي وغيره من العلماء رحمهم الله.\n                                    ",
        "qortoby": "وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ ٦\n                                    \n                                    \n                                    قوله تعالى وإن أحد من المشركين استجارك فأجره حتى يسمع كلام الله ثم أبلغه مأمنه ذلك بأنهم قوم لا يعلمون\nفيه أربع مسائل :\nالأولى : قوله تعالى : وإن أحد من المشركين أي من الذين أمرتك بقتالهم . استجارك أي سأل جوارك ، أي أمانك وذمامك ، فأعطه إياه ليسمع القرآن ، أي يفهم أحكامه وأوامره ونواهيه . فإن قبل أمرا فحسن ، وإن أبى فرده إلى مأمنه . وهذا ما لا خلاف فيه . والله أعلم .\nقال مالك : إذا وجد الحربي في طريق بلاد المسلمين فقال : جئت أطلب الأمان . قال مالك : هذه أمور مشتبهة ، وأرى أن يرد إلى مأمنه . وقال ابن قاسم : وكذلك الذي يوجد وقد نزل تاجرا بساحلنا فيقول : ظننت ألا تعرضوا لمن جاء تاجرا حتى يبيع . وظاهر الآية إنما هي في من يريد سماع القرآن والنظر في الإسلام ، فأما الإجارة لغير ذلك فإنما هي لمصلحة المسلمين والنظر فيما تعود عليهم به منفعته .\nالثانية : ولا خلاف بين كافة العلماء أن أمان السلطان جائز ؛ لأنه مقدم للنظر والمصلحة ، نائب عن الجميع في جلب المنافع ودفع المضار . واختلفوا في أمان غير الخليفة ، فالحر يمضي أمانه عند كافة العلماء . إلا أن ابن حبيب قال : ينظر الإمام فيه . وأما العبد فله الأمان في مشهور المذهب ، وبه قال الشافعي وأصحابه وأحمد وإسحاق والأوزاعي والثوري وأبو ثور وداود ومحمد بن الحسن . وقال أبو حنيفة : لا أمان له ، وهو القول الثاني لعلمائنا . والأول أصح ، لقوله صلى الله عليه وسلم : المسلمون تتكافأ دماؤهم ويسعى بذمتهم أدناهم . قالوا : فلما قال أدناهم جاز أمان العبد ، وكانت المرأة الحرة أحرى بذلك ، ولا اعتبار بعلة \" لا يسهم \" له . وقال عبد الملك بن الماجشون : لا يجوز أمان المرأة إلا أن يجيزه الإمام ، فشذ بقوله عن الجمهور . وأما الصبي فإذا أطاق القتال جاز أمانه ؛ لأنه من جملة المقاتلة ، ودخل في الفئة الحامية . وقد ذهب الضحاك والسدي إلى أن هذه الآية منسوخة بقوله : فاقتلوا المشركين . وقال الحسن : هي محكمة ، سنة إلى يوم القيامة ، وقاله مجاهد . وقيل : هذه الآية إنما كان حكمها باقيا مدة الأربعة الأشهر التي ضربت لهم أجلا ، وليس بشيء . وقال سعيد بن جبير : جاء رجل من المشركين إلى علي بن أبي طالب فقال : إن أراد الرجل منا أن يأتي محمدا بعد انقضاء الأربعة الأشهر فيسمع كلام الله أو يأتيه بحاجة قتل ؟ فقال علي بن أبي طالب : لا ؛ لأن الله تبارك وتعالى يقول : وإن أحد من المشركين استجارك فأجره حتى يسمع كلام الله . وهذا هو الصحيح . والآية محكمة .\nالثالثة : قوله تعالى : وإن أحد أحد مرفوع بإضمار فعل كالذي بعده . وهذا حسن في \" إن \" وقبيح في أخواتها . ومذهب سيبويه في الفرق بين \" إن \" وأخواتها ، أنها لما كانت أم حروف الشرط خصت بهذا ، ولأنها لا تكون في غيره . وقال محمد بن يزيد : أما قوله - لأنها لا تكون في غيره - فغلط ؛ لأنها تكون بمعنى - ما - ومخففة من الثقيلة ولكنها مبهمة ، وليس كذا غيرها . وأنشد سيبويه :\nلا تجزعي إن منفسا أهلكته وإذا هلكت فعند ذلك فاجزعي\nالرابعة : قال العلماء : في قوله تعالى : حتى يسمع كلام الله دليل على أن كلام الله عز وجل مسموع عند قراءة القارئ ، قاله الشيخ أبو الحسن والقاضي أبو بكر وأبو العباس القلانسي وابن مجاهد وأبو إسحاق الإسفراييني وغيرهم ، لقوله تعالى : حتى يسمع كلام الله فنص على أن كلامه مسموع عند قراءة القارئ لكلامه . ويدل عليه إجماع المسلمين على أن القارئ إذا قرأ فاتحة الكتاب أو سورة قالوا : سمعنا كلام الله . وفرقوا بين أن يقرأ كلام الله تعالى وبين أن يقرأ شعر امرئ القيس . وقد مضى في سورة ( البقرة ) معنى كلام الله تعالى ، وأنه ليس بحرف ولا صوت ، والحمد لله .\n                                    ",
        "saadi": "وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ ٦\n                                        \n                                        \n                                        \n                                        لما كان ما تقدم من قوله ‏{‏فَإِذَا انْسَلَخَ الْأَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدْتُمُوهُمْ وَخُذُوهُمْ وَاحْصُرُوهُمْ وَاقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ‏}‏ أمرا عاما في جميع الأحوال، وفي كل الأشخاص منهم، ذكر تعالى، أن المصلحة إذا اقتضت تقريب بعضهم جاز، بل وجب ذلك فقال‏:‏ ‏{‏وَإِنْ أَحَدٌ مِنَ الْمُشْرِكِينَ اسْتَجَارَكَ‏}‏ أي‏:‏ طلب منك أن تجيره، وتمنعه من الضرر، لأجل أن يسمع كلام اللّه، وينظر حالة الإسلام‏.‏ ‏{‏فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ‏}‏ ثم إن أسلم، فذاك، وإلا فأبلغه مأمنه، أي‏:‏ المحل الذي يأمن فيه، والسبب في ذلك أن الكفار قوم لا يعلمون، فربما كان استمرارهم على كفرهم لجهل منهم، إذا زال اختاروا عليه الإسلام، فلذلك أمر اللّه رسوله، وأمته أسوته في الأحكام، أن يجيروا من طلب أن يسمع كلام اللّه‏.‏ وفي هذا حجة صريحة لمذهب أهل السنة والجماعة، القائلين بأن القرآن كلام اللّه غير مخلوق، لأنه تعالى هو المتكلم به، وأضافه إلى نفسه إضافة الصفة إلى موصوفها، وبطلان مذهب المعتزلة ومن أخذ بقولهم‏:‏ أن القرآن مخلوق‏.‏ وكم من الأدلة الدالة على بطلان هذا القول، ليس هذا محل ذكرها‏.‏\n                                    "
      },
      "originalText": "وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ ٦"
    }
  ]
}