{
  "number": 191,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 1262,
      "text": "ثُمَّ يَتُوبُ اللَّهُ مِنْ بَعْدِ ذَٰلِكَ عَلَىٰ مَنْ يَشَاءُ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 27,
      "juz": 10,
      "manzil": 2,
      "page": 191,
      "ruku": 159,
      "hizbQuarter": 76,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٧٢\n                                    \n                                    \n                                    وقوله : ( ثم يتوب الله من بعد ذلك على من يشاء والله غفور رحيم ) قد تاب الله على بقية هوازن ، وأسلموا وقدموا عليه مسلمين ، ولحقوه وقد قارب مكة عند الجعرانة ، وذلك بعد الوقعة بقريب من عشرين يوما ، فعند ذلك خيرهم بين سبيهم وبين أموالهم ، فاختاروا سبيهم ، وكانوا ستة آلاف أسير ما بين صبي وامرأة ، فرده عليهم ، وقسم أموالهم بين الغانمين ، ونفل أناسا من الطلقاء ليتألف قلوبهم على الإسلام ، فأعطاهم مائة مائة من الإبل ، وكان من جملة من أعطي مائة مالك بن عوف النضري ، واستعمله على قومه كما كان ، فامتدحه بقصيدته التي يقول فيها :\nما إن رأيت ولا سمعت بمثله في الناس كلهم بمثل محمد\nأوفى وأعطى للجزيل إذا اجتدي ومتى تشأ يخبرك عما في غد\nوإذا الكتيبة عردت أنيابها بالسمهري وضرب كل مهند\nفكأنه ليث على أشباله وسط الهباءة خادر في مرصد\n                                    ",
        "qortoby": "ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٧٢\n                                    \n                                    \n                                    ثم يتوب الله من بعد ذلك على من يشاء\nأي على من انهزم فيهديه إلى الإسلام . كمالك بن عوف النصري رئيس حنين ومن أسلم معه من قومه .\nالثامنة : ولما قسم رسول الله صلى الله عليه وسلم غنائم حنين بالجعرانة ، أتاه وفد هوازن مسلمين راغبين في العطف عليهم والإحسان إليهم ، وقالوا : يا رسول الله ، إنك خير الناس وأبر الناس ، وقد أخذت أبناءنا ونساءنا وأموالنا . فقال لهم : إني قد كنت استأنيت بكم وقد وقعت المقاسم وعندي من ترون وإن خير القول أصدقه فاختاروا إما ذراريكم وإما أموالكم . فقالوا : لا نعدل بالأنساب شيئا . فقام خطيبا وقال : هؤلاء جاءونا مسلمين وقد خيرناهم فلم يعدلوا بالأنساب فرضوا برد الذرية وما كان لي ولبني عبد المطلب وبني هاشم فهو لهم . وقال المهاجرون والأنصار : أما ما كان لنا فهو لرسول الله صلى الله عليه وسلم . وامتنع الأقرع بن حابس وعيينة بن حصن في قومهما من أن يردوا عليهم شيئا مما وقع لهم في سهامهم . وامتنع العباس بن مرداس السلمي كذلك ، وطمع أن يساعده قومه كما ساعد الأقرع وعيينة قومهما . فأبت بنو سليم وقالوا : بل ما كان لنا فهو لرسول الله صلى الله عليه وسلم . فقال رسول الله صلى الله عليه وسلم : من ضن منكم بما في يديه فإنا نعوضه منه . فرد عليهم رسول الله صلى الله عليه وسلم نساءهم وأولادهم ، وعوض من لم تطب نفسه بترك نصيبه أعواضا رضوا بها . وقال قتادة : ذكر لنا أن ظئر النبي صلى الله عليه وسلم التي أرضعته من بني سعد أتته يوم حنين فسألته سبايا حنين فقال صلى الله عليه وسلم : إني لا أملك إلا ما يصيبني منهم ولكن ايتيني غدا فاسأليني والناس عندي فإذا أعطيتك حصتي أعطاك الناس . فجاءت الغد فبسط لها ثوبه فأقعدها عليه . ثم سألته فأعطاها نصيبه فلما رأى ذلك الناس أعطوها أنصباءهم . وكان عدد سبي هوازن في قول سعيد بن المسيب ستة آلاف رأس . وقيل : أربعة آلاف . قال أبو عمر : فيهن الشيماء أخت النبي صلى الله عليه وسلم من الرضاعة ، وهي بنت الحارث بن عبد العزى من بني سعد بن بكر وبنت حليمة السعدية ، فأكرمها رسول الله صلى الله عليه وسلم وأعطاها وأحسن إليها ، ورجعت مسرورة إلى بلادها بدينها وبما أفاء الله عليها . قال ابن عباس : رأى رسول الله صلى الله عليه وسلم يوم أوطاس امرأة تعدو وتصيح ولا تستقر ، فسأل عنها فقيل : فقدت بنيا لها . ثم رآها وقد وجدت ابنها وهي تقبله وتدنيه ، فدعاها وقال لأصحابه : أطارحة هذه ولدها في النار ؟ قالوا : لا . قال : لم ؟ قالوا : لشفقتها . قال : الله أرحم بكم منها . وخرجه مسلم بمعناه والحمد لله .\n                                    ",
        "saadi": "ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٧٢\n                                        \n                                        \n                                        \n                                        ‏{‏ثُمَّ يَتُوبُ اللَّهُ مِنْ بَعْدِ ذَلِكَ عَلَى مَنْ يَشَاءُ‏}‏ فتاب اللّه على كثير ممن كانت الوقعة عليهم، وأتوا إلى النبي ـ صلى الله عليه وسلم ـ مسلمين تائبين، فرد عليهم نساءهم، وأولادهم‏.‏\n‏{‏وَاللَّهُ غَفُورٌ رَحِيمٌ‏}‏ أي‏:‏ ذو مغفرة واسعة، ورحمة عامة، يعفو عن الذنوب العظيمة للتائبين، ويرحمهم بتوفيقهم للتوبة والطاعة، والصفح عن جرائمهم، وقبول توباتهم، فلا ييأسنَّ أحد من مغفرته ورحمته، ولو فعل من الذنوب والإجرام ما فعل‏.\n                                    "
      },
      "originalText": "ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٧٢"
    },
    {
      "number": 1263,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْمُشْرِكُونَ نَجَسٌ فَلَا يَقْرَبُوا الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَٰذَا ۚ وَإِنْ خِفْتُمْ عَيْلَةً فَسَوْفَ يُغْنِيكُمُ اللَّهُ مِنْ فَضْلِهِ إِنْ شَاءَ ۚ إِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 28,
      "juz": 10,
      "manzil": 2,
      "page": 191,
      "ruku": 159,
      "hizbQuarter": 76,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ ٨٢\n                                    \n                                    \n                                    أمر تعالى عباده المؤمنين الطاهرين دينا وذاتا بنفي المشركين الذين هم نجس دينا ، عن المسجد الحرام ، وألا يقربوه بعد نزول هذه الآية . وكان نزولها في سنة تسع ؛ ولهذا بعث رسول الله - صلى الله عليه وسلم - عليا صحبة أبي بكر - رضي الله عنهما - عامئذ ، وأمره أن ينادي في المشركين : ألا يحج بعد العام مشرك ، ولا يطوف بالبيت عريان . فأتم الله ذلك ، وحكم به شرعا وقدرا .\nوقال عبد الرزاق : أخبرنا ابن جريج ، أخبرني أبو الزبير ، أنه سمع جابر بن عبد الله يقول في قوله تعالى : ( إنما المشركون نجس فلا يقربوا المسجد الحرام بعد عامهم هذا ) إلا أن يكون عبدا ، أو أحدا من أهل الذمة .\nوقد روي مرفوعا من وجه آخر ، فقال الإمام أحمد : حدثنا حسين حدثنا شريك ، عن الأشعث - يعني : ابن سوار - عن الحسن ، عن جابر قال : قال النبي - صلى الله عليه وسلم - : لا يدخل مسجدنا بعد عامنا هذا مشرك ، إلا أهل العهد وخدمهم .\nتفرد به أحمد مرفوعا ، والموقوف أصح إسنادا .\nوقال الإمام أبو عمرو الأوزاعي : كتب عمر بن عبد العزيز - رضي الله عنه - : أن امنعوا اليهود والنصارى من دخول مساجد المسلمين ، وأتبع نهيه قول الله : ( إنما المشركون نجس )\nوقال عطاء : الحرم كله مسجد ، لقوله تعالى : ( فلا يقربوا المسجد الحرام بعد عامهم هذا ) .\nودلت هذه الآية الكريمة على نجاسة المشرك كما دلت [ على طهارة المؤمن ، ولما ] ورد في [ الحديث ] الصحيح : المؤمن لا ينجس وأما نجاسة بدنه فالجمهور على أنه ليس بنجس البدن والذات ؛ لأن الله تعالى أحل طعام أهل الكتاب ، وذهب بعض الظاهرية إلى نجاسة أبدانهم .\nوقال أشعث ، عن الحسن : من صافحهم فليتوضأ . رواه ابن جرير .\nوقوله : ( وإن خفتم عيلة فسوف يغنيكم الله من فضله ) قال ابن إسحاق : وذلك أن الناس قالوا : لتنقطعن عنا الأسواق ، ولتهلكن التجارة وليذهبن ما كنا نصيب فيها من المرافق ، فنزلت ( وإن خفتم عيلة فسوف يغنيكم الله من فضله ) من وجه غير ذلك - ( إن شاء ) إلى قوله : ( وهم صاغرون ) أي : إن هذا عوض ما تخوفتم من قطع تلك الأسواق ، فعوضهم الله بما قطع عنهم من أمر الشرك ، ما أعطاهم من أعناق أهل الكتاب ، من الجزية .\nوهكذا روي عن ابن عباس ، ومجاهد ، وعكرمة ، وسعيد بن جبير ، وقتادة والضحاك ، وغيرهم .\n( إن الله عليم ) أي : بما يصلحكم ، ( حكيم ) أي : فيما يأمر به وينهى عنه ؛ لأنه الكامل في أفعاله وأقواله ، العادل في خلقه وأمره ، تبارك وتعالى ؛ ولهذا عوضهم عن تلك المكاسب بأموال الجزية التي يأخذونها من أهل الذمة\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ ٨٢\n                                    \n                                    \n                                    قوله تعالى يا أيها الذين آمنوا إنما المشركون نجس فلا يقربوا المسجد الحرام بعد عامهم هذا وإن خفتم عيلة فسوف يغنيكم الله من فضله إن شاء إن الله عليم حكيم\nفيه سبع مسائل :\nالأولى : قوله تعالى يا أيها الذين آمنوا إنما المشركون نجس ابتداء وخبر . واختلف العلماء في معنى وصف المشرك بالنجس ، فقال قتادة ومعمر بن راشد وغيرهما : لأنه جنب إذ غسله من الجنابة ليس بغسل . وقال ابن عباس وغيره : بل معنى الشرك هو الذي نجسه . قال الحسن البصري من صافح مشركا فليتوضأ . والمذهب كله على إيجاب الغسل على الكافر إذا أسلم إلا ابن عبد الحكم فإنه قال : ليس بواجب ؛ لأن الإسلام يهدم ما كان قبله . وبوجوب الغسل عليه قال أبو ثور وأحمد . وأسقطه الشافعي وقال : أحب إلي أن يغتسل . ونحوه لابن القاسم . ولمالك قول : إنه لا يعرف الغسل ، رواه عنه ابن وهب وابن أبي أويس . وحديث ثمامة وقيس بن عاصم يرد هذه الأقوال . رواهما أبو حاتم البستي في صحيح مسنده . وأن النبي صلى الله عليه وسلم مر بثمامة يوما فأسلم فبعث به إلى حائط أبي طلحة فأمره أن يغتسل ، فاغتسل وصلى ركعتين . فقال رسول الله صلى الله عليه وسلم : لقد حسن إسلام صاحبكم وأخرجه مسلم بمعناه . وفيه : أن ثمامة لما من عليه النبي صلى الله عليه وسلم انطلق إلى نخل قريب من المسجد فاغتسل . وأمر قيس بن عاصم أن يغتسل بماء وسدر .\nفإن كان إسلامه قبيل احتلامه فغسله مستحب . ومتى أسلم بعد بلوغه لزمه أن ينوي بغسله الجنابة . هذا قول علمائنا ، وهو تحصيل المذهب . وقد أجاز ابن القاسم للكافر أن يغتسل قبل إظهاره للشهادة بلسانه إذا اعتقد الإسلام بقلبه وهو قول ضعيف في النظر مخالف للأثر . وذلك أن أحدا لا يكون بالنية مسلما دون القول . هذا قول جماعة أهل السنة في الإيمان : إنه قول باللسان وتصديق بالقلب ، ويزكو بالعمل . قال الله تعالى : إليه يصعد الكلم الطيب والعمل الصالح يرفعه .\nالثانية : قوله تعالى فلا يقربوا المسجد الحرام ( فلا يقربوا ) نهي ، ولذلك حذفت منه النون . ( المسجد الحرام ) هذا اللفظ يطلق على جميع الحرم ، وهو مذهب عطاء فإذا يحرم تمكين المشرك من دخول الحرم أجمع . فإذا جاءنا رسول منهم خرج الإمام إلى الحل ليسمع ما يقول . ولو دخل مشرك الحرم مستورا ومات نبش قبره وأخرجت عظامه . فليس لهم الاستيطان ولا الاجتياز . وأما جزيرة العرب ، وهي مكة والمدينة واليمامة واليمن ومخاليفها ، فقال مالك : يخرج من هذه المواضع كل من كان على غير الإسلام ، ولا يمنعون من التردد بها مسافرين . وكذلك قال الشافعي رحمه الله ، غير أنه استثنى من ذلك اليمن . ويضرب لهم أجل ثلاثة أيام كما ضربه لهم عمر رضي الله عنه حين أجلاهم . ولا يدفنون فيها ويلجئون إلى الحل .\nالثالثة : واختلف العلماء في دخول الكفار المساجد والمسجد الحرام على خمسة أقوال ، فقال أهل المدينة : الآية عامة في سائر المشركين وسائر المساجد . وبذلك كتب عمر بن عبد العزيز إلى عماله ونزع في كتابه بهذه الآية . ويؤيد ذلك قوله تعالى : في بيوت أذن الله أن ترفع ويذكر فيها اسمه . ودخول الكفار فيها مناقض لترفيعها . وفي صحيح مسلم وغيره : إن هذه المساجد لا تصلح لشيء من البول والقذر . . . الحديث . والكافر لا يخلو عن ذلك . وقال صلى الله عليه وسلم : لا أحل المسجد لحائض ولا لجنب والكافر جنب . وقوله تعالى : إنما المشركون نجس فسماه الله تعالى نجسا . فلا يخلو أن يكون نجس العين أو مبعدا من طريق الحكم . وأي ذلك كان فمنعه من المسجد واجب لأن العلة وهي النجاسة موجودة فيهم ، والحرمة موجودة في المسجد . يقال : رجل نجس ، وامرأة نجس ، ورجلان نجس ، وامرأتان نجس ، ورجال نجس ، ونساء نجس ، لا يثنى ولا يجمع لأنه مصدر . فأما النجس - بكسر النون وجزم الجيم - فلا يقال إلا إذا قيل معه رجس . فإذا أفرد قيل نجس - بفتح النون وكسر الجيم - ونجس - بضم الجيم - . وقال الشافعي رحمه الله : الآية عامة في سائر المشركين ، خاصة في المسجد الحرام ، ولا يمنعون من دخول غيره ، فأباح دخول اليهودي والنصراني في سائر المساجد . قال ابن العربي : وهذا جمود منه على الظاهر ؛ لأن قوله عز وجل : إنما المشركون نجس تنبيه على العلة بالشرك والنجاسة . فإن قيل : فقد ربط النبي صلى الله عليه وسلم ثمامة في المسجد وهو مشرك . قيل له : أجاب علماؤنا عن هذا الحديث - وإن كان صحيحا - بأجوبة : أحدها : أنه كان متقدما على نزول الآية . الثاني : أن النبي صلى الله عليه وسلم كان قد علم بإسلامه فلذلك ربطه . الثالث : أن ذلك قضية في عين فلا ينبغي أن تدفع بها الأدلة التي ذكرناها ، لكونها مقيدة حكم القاعدة الكلية . وقد يمكن أن يقال : إنما ربطه في المسجد لينظر حسن صلاة المسلمين واجتماعهم عليها ، وحسن آدابهم في جلوسهم في المسجد ، فيستأنس بذلك ويسلم ، وكذلك كان . ويمكن أن يقال : إنهم لم يكن لهم موضع يربطونه فيه إلا في المسجد ، والله أعلم . وقال أبو حنيفة وأصحابه : لا يمنع اليهود والنصارى من دخول المسجد الحرام ولا غيره ، ولا يمنع دخول المسجد الحرام إلا المشركون وأهل الأوثان . وهذا قول يرده كل ما ذكرناه من الآية وغيرها . قال الكيا الطبري : ويجوز للذمي دخول سائر المساجد عند أبي حنيفة من غير حاجة . وقال الشافعي : تعتبر الحاجة ، ومع عدم الحاجة لا يجوز دخول المسجد الحرام . وقال عطاء بن أبي رباح : الحرم كله قبلة ومسجد ، فينبغي أن يمنعوا من دخول الحرم ، لقوله تعالى : سبحان الذي أسرى بعبده ليلا من المسجد الحرام . وإنما رفع من بيت أم هانئ . وقال قتادة : لا يقرب المسجد الحرام مشرك إلا أن يكون صاحب جزية أو عبدا كافرا لمسلم . وروى إسماعيل بن إسحاق حدثنا يحيى بن عبد الحميد قال حدثنا شريك عن أشعث عن الحسن عن جابر عن النبي صلى الله عليه وسلم قال : لا يقرب المسجد مشرك إلا أن يكون عبدا أو أمة فيدخله لحاجة . وبهذا قال جابر بن عبد الله فإنه قال : العموم يمنع المشرك عن قربان المسجد الحرام ، وهو مخصوص في العبد والأمة .\nالرابعة : قوله تعالى بعد عامهم هذا فيه قولان : أحدهما - أنه سنة تسع التي حج فيها أبو بكر . الثاني سنة عشر قاله قتادة . ابن العربي : وهو الصحيح الذي يعطيه مقتضى اللفظ وإن من العجب أن يقال : إنه سنة تسع وهو العام الذي وقع فيه الأذان . ولو دخل غلام رجل داره يوما فقال له مولاه : لا تدخل هذه الدار بعد يومك لم يكن المراد اليوم الذي دخل فيه .\nالخامسة : وإن خفتم عيلة قال عمرو بن فائد : المعنى وإذ خفتم . وهذه عجمة والمعنى بارع ب ( إن ) . وكان المسلمون لما منعوا المشركين من الموسم وهم كانوا يجلبون الأطعمة والتجارات ، قذف الشيطان في قلوبهم الخوف من الفقر وقالوا : من أين نعيش . فوعدهم الله أن يغنيهم من فضله . قال الضحاك : ففتح الله عليهم باب الجزية من أهل الذمة بقوله عز وجل : قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر الآية . وقال عكرمة : أغناهم الله بإدرار المطر والنبات وخصب الأرض فأخصبت تبالة وجرش وحملوا إلى مكة الطعام والودك وكثر الخير وأسلمت العرب : أهل نجد وصنعاء وغيرهم فتمادى حجهم وتجرهم وأغنى الله من فضله بالجهاد والظهور على الأمم . والعيلة : الفقر . يقال : عال الرجل يعيل إذا افتقر . قال الشاعر :\nوما يدري الفقير متى غناه وما يدري الغني متى يعيل\nوقرأ علقمة وغيره من أصحاب ابن مسعود \" عائلة \" وهو مصدر كالقائلة من قال يقيل . وكالعافية . ويحتمل أن يكون نعتا لمحذوف تقديره : حالا عائلة ، ومعناه : خصلة شاقة . يقال منه : عالني الأمر يعولني : أي شق علي واشتد . وحكى الطبري أنه يقال : عال يعول إذا افتقر .\nالسادسة : في هذه الآية دليل على أن تعلق القلب بالأسباب في الرزق جائز وليس ذلك بمناف للتوكل وإن كان الرزق مقدرا وأمر الله وقسمه مفعولا ولكنه علقه بالأسباب حكمة ليعلم القلوب التي تتعلق بالأسباب من القلوب التي تتوكل على رب الأرباب . وقد تقدم أن السبب لا ينافي التوكل قال صلى الله عليه وسلم : لو توكلتم على الله حق توكله لرزقكم كما يرزق الطير تغدو خماصا وتروح بطانا . أخرجه البخاري . فأخبر أن التوكل الحقيقي لا يضاده الغدو والرواح في طلب الرزق . ابن العربي : ولكن شيوخ الصوفية قالوا : إنما يغدو ويروح في الطاعات فهو السبب الذي يجلب الرزق . قالوا : والدليل عليه أمران : أحدهما : قوله تعالى : وأمر أهلك بالصلاة واصطبر عليها لا نسألك رزقا نحن نرزقك الثاني : قوله تعالى : إليه يصعد الكلم الطيب والعمل الصالح يرفعه فليس ينزل الرزق من محله ، وهو السماء ، إلا ما يصعد وهو الذكر الطيب والعمل الصالح وليس بالسعي في الأرض فإنه ليس فيها رزق . والصحيح ما أحكمته السنة عند فقهاء الظاهر وهو العمل بالأسباب الدنيوية من الحرث والتجارة في الأسواق والعمارة للأموال وغرس الثمار . وقد كانت الصحابة تفعل ذلك والنبي صلى الله عليه وسلم بين أظهرهم . قال أبو الحسن بن بطال : أمر الله سبحانه عباده بالإنفاق من طيبات ما كسبوا إلى غير ذلك من الآي . وقال : فمن اضطر غير باغ ولا عاد فلا إثم عليه . فأحل للمضطر ما كان حرم عليه عند عدمه للغذاء الذي أمره باكتسابه والاغتذاء به ، ولم يأمره بانتظار طعام ينزل عليه من السماء ، ولو ترك السعي في ترك ما يتغذى به لكان لنفسه قاتلا . وقد كان رسول الله صلى الله عليه وسلم يتلوى من الجوع ما يجد ما يأكله ، ولم ينزل عليه طعام من السماء ، وكان يدخر لأهله قوت سنته حتى فتح الله عليه الفتوح . وقد روى أنس بن مالك أن رجلا أتى النبي صلى الله عليه وسلم ببعير فقال : يا رسول الله ، أعقله وأتوكل أو أطلقه وأتوكل ؟ قال : اعقله وتوكل .\nقلت : ولا حجة لهم في أهل الصفة ، فإنهم كانوا فقراء يقعدون في المسجد ما يحرثون ولا يتجرون ، ليس لهم كسب ولا مال ، إنما هم أضياف الإسلام عند ضيق البلدان ، ومع ذلك فإنهم كانوا يحتطبون بالنهار ويسوقون الماء إلى بيت رسول الله صلى الله عليه وسلم ، ويقرءون القرآن بالليل ويصلون . هكذا وصفهم البخاري وغيره . فكانوا يتسببون . وكان صلى الله عليه وسلم إذا جاءته هدية أكلها معهم ، وإن كانت صدقة خصهم بها ، فلما كثر الفتح وانتشر الإسلام خرجوا وتأمروا - كأبي هريرة وغيره - وما قعدوا . ثم قيل : الأسباب التي يطلب بها الرزق ستة أنواع : أعلاها كسب نبينا محمد صلى الله عليه وسلم ؛ قال : جعل رزقي تحت ظل رمحي وجعل الذلة والصغار على من خالف أمري . خرجه الترمذي وصححه . فجعل الله رزق نبيه صلى الله عليه وسلم في كسبه لفضله ، وخصه بأفضل أنواع الكسب ، وهو أخذ الغلبة والقهر لشرفه . الثاني : أكل الرجل من عمل يده ، قال صلى الله عليه وسلم : إن أطيب ما أكل الرجل من عمل يده وإن نبي الله داود كان يأكل من عمل يده خرجه البخاري . وفي التنزيل وعلمناه صنعة لبوس لكم وروي أن عيسى عليه السلام كان يأكل من غزل أمه . الثالث : التجارة ، وهي كانت عمل جل الصحابة رضوان الله عليهم ، وخاصة المهاجرين ، وقد دل عليها التنزيل في غير موضع . الرابع : الحرث والغرس . وقد بيناه في سورة \" البقرة \" الخامس : إقراء القرآن وتعليمه والرقية ، وقد مضى في \" الفاتحة \" السادس : يأخذ بنية الأداء إذا احتاج ، قال صلى الله عليه وسلم : من أخذ أموال الناس يريد أداءها أدى الله عنه ومن أخذها يريد إتلافها أتلفه الله . خرجه البخاري . رواه أبو هريرة رضي الله عنه .\nالسابعة : قوله تعالى إن شاء دليل على أن الرزق ليس بالاجتهاد ، وإنما هو من فضل الله تولى قسمته بين عباده وذلك بين في قوله تعالى : نحن قسمنا بينهم معيشتهم في الحياة الدنيا الآية .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ ٨٢\n                                        \n                                        \n                                        \n                                        يقول تعالى‏:‏ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْمُشْرِكُونَ‏}‏ باللّه الذين عبدوا معه غيره ‏{‏نَجَسٌ‏}‏ أي‏:‏ خبثاء في عقائدهم وأعمالهم، وأي نجاسة أبلغ ممن كان يعبد مع اللّه آلهة لا تنفع ولا تضر، ولا تغني عنه شيئا‏؟‏‏\"‏‏.‏\nوأعمالهم ما بين محاربة للّه، وصد عن سبيل اللّه ونصر للباطل، ورد للحق، وعمل بالفساد في الأرض لا في الصلاح، فعليكم أن تطهروا أشرف البيوت وأطهرها عنهم‏.‏\n‏{‏فَلَا يَقْرَبُوا الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَذَا‏}‏ وهو سنة تسع من الهجرة، حين حج بالناس أبو بكر الصديق، وبعث النبي ـ صلى الله عليه وسلم ـ ابن عمه عليا، أن يؤذن يوم الحج الأكبر ب ـ ‏{‏براءة‏}‏ فنادى أن لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏\nوليس المراد هنا، نجاسة البدن، فإن الكافر كغيره طاهر البدن، بدليل أن اللّه تعالى أباح وطء الكتابية ومباشرتها، ولم يأمر بغسل ما أصاب منها‏.‏\nوالمسلمون ما زالوا يباشرون أبدان الكفار، ولم ينقل عنهم أنهم تقذروا منها، تَقَذُّرَهْم من النجاسات، وإنما المراد كما تقدم نجاستهم المعنوية، بالشرك، فكما أن التوحيد والإيمان، طهارة، فالشرك نجاسة‏.‏\nوقوله‏:‏ ‏{‏وَإِنْ خِفْتُمْ‏}‏ أيها المسلمون ‏{‏عَيْلَةً‏}‏ أي‏:‏ فقرا وحاجة، من منع المشركين من قربان المسجد الحرام، بأن تنقطع الأسباب التي بينكم وبينهم من الأمور الدنيوية، ‏{‏فَسَوْفَ يُغْنِيكُمُ اللَّهُ مِنْ فَضْلِهِ‏}‏ فليس الرزق مقصورا على باب واحد، ومحل واحد، بل لا ينغلق باب إلا وفتح غيره أبواب كثيرة، فإن فضل اللّه واسع، وجوده عظيم، خصوصا لمن ترك شيئا لوجهه الكريم، فإن اللّه أكرم الأكرمين‏.‏\nوقد أنجز اللّه وعده، فإن اللّه قد أغنى المسلمين من فضله، وبسط لهم من الأرزاق ما كانوا به من أكبر الأغنياء والملوك‏.‏\nوقوله‏:‏ ‏{‏إِنْ شَاءَ‏}‏ تعليق للإغناء بالمشيئة، لأن الغنى في الدنيا، ليس من لوازم الإيمان، ولا يدل على محبة اللّه، فلهذا علقه اللّه بالمشيئة‏.‏\nفإن اللّه يعطي الدنيا، من يحب، ومن لا يحب، ولا يعطي الإيمان والدين، إلا من يحب‏.‏\n{‏إِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ‏}‏ أي‏:‏ علمه\nواسع، يعلم من يليق به الغنى، ومن لا يليق، ويضع الأشياء مواضعها وينزلها منازلها‏.‏\nوتدل الآية الكريمة، وهي قوله ‏{‏فَلَا يَقْرَبُوا الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَذَا‏}‏ أن المشركين بعد ما كانوا، هم الملوك والرؤساء بالبيت، ثم صار بعد الفتح الحكم لرسول اللّه والمؤمنين، مع إقامتهم في البيت، ومكة المكرمة، ثم نزلت هذه الآية‏.‏\nولما مات النبي ـ صلى الله عليه وسلم ـ أمر أن يجلوا من الحجاز، فلا يبقى فيها دينان، وكل هذا لأجل بُعْدِ كل كافر عن المسجد الحرام، فيدخل في قوله ‏{‏فَلَا يَقْرَبُوا الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَذَا‏}‏\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ ٨٢"
    },
    {
      "number": 1264,
      "text": "قَاتِلُوا الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ وَلَا يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ حَتَّىٰ يُعْطُوا الْجِزْيَةَ عَنْ يَدٍ وَهُمْ صَاغِرُونَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 29,
      "juz": 10,
      "manzil": 2,
      "page": 191,
      "ruku": 159,
      "hizbQuarter": 76,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ ٩٢\n                                    \n                                    \n                                    فقال : ( قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون ) فهم في نفس الأمر لما كفروا بمحمد - صلى الله عليه وسلم - لم يبق لهم إيمان صحيح بأحد من الرسل ، ولا بما جاءوا به ، وإنما يتبعون آراءهم وأهواءهم وآباءهم فيما هم فيه ، لا لأنه شرع الله ودينه ؛ لأنهم لو كانوا مؤمنين بما بأيديهم إيمانا صحيحا لقادهم ذلك إلى الإيمان بمحمد ، صلوات الله عليه ، لأن جميع الأنبياء [ الأقدمين ] بشروا به ، وأمروا باتباعه ، فلما جاء وكفروا به - وهو أشرف الرسل - علم أنهم ليسوا متمسكين بشرع الأنبياء الأقدمين لأنه من عند الله ، بل لحظوظهم وأهوائهم ، فلهذا لا ينفعهم إيمانهم ببقية الأنبياء ، وقد كفروا بسيدهم وأفضلهم وخاتمهم وأكملهم ؛ ولهذا قال : ( قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب ) وهذه الآية الكريمة [ نزلت ] أول الأمر بقتال أهل الكتاب ، بعد ما تمهدت أمور المشركين ودخل الناس في دين الله أفواجا ، فلما استقامت جزيرة العرب أمر الله ورسوله بقتال أهل الكتابين اليهود والنصارى ، وكان ذلك في سنة تسع ؛ ولهذا تجهز رسول الله - صلى الله عليه وسلم - لقتال الروم ودعا الناس إلى ذلك ، وأظهره لهم ، وبعث إلى أحياء العرب حول المدينة فندبهم ، فأوعبوا معه ، واجتمع من المقاتلة نحو [ من ] ثلاثين ألفا ، وتخلف بعض الناس من أهل المدينة ومن حولها من المنافقين وغيرهم ، وكان ذلك في عام جدب ، ووقت قيظ وحر ، وخرج - عليه السلام - يريد الشام لقتال الروم ، فبلغ تبوك ، فنزل بها وأقام على مائها قريبا من عشرين يوما ، ثم استخار الله في الرجوع ، فرجع عامه ذلك لضيق الحال وضعف الناس ، كما سيأتي بيانه بعد إن شاء الله .\nوقد استدل بهذه الآية الكريمة من يرى أنه لا تؤخذ الجزية إلا من أهل الكتاب ، أو من أشباههم كالمجوس ، لما صح فيهم الحديث أن رسول الله - صلى الله عليه وسلم - أخذها من مجوس هجر ، وهذا مذهب الشافعي ، وأحمد - في المشهور عنه - وقال أبو حنيفة - رحمه الله - : بل تؤخذ من جميع الأعاجم ، سواء كانوا من أهل الكتاب أو من المشركين ، ولا تؤخذ من العرب إلا من أهل الكتاب .\nوقال الإمام مالك : بل يجوز أن تضرب الجزية على جميع الكفار من كتابي ، ومجوسي ، ووثني ، وغير ذلك ، ولمأخذ هذه المذاهب وذكر أدلتها مكان غير هذا ، والله أعلم .\nوقوله : ( حتى يعطوا الجزية ) أي : إن لم يسلموا ، ( عن يد ) أي : عن قهر لهم وغلبة ، ( وهم صاغرون ) أي : ذليلون حقيرون مهانون . فلهذا لا يجوز إعزاز أهل الذمة ولا رفعهم على المسلمين ، بل هم أذلاء صغرة أشقياء ، كما جاء في صحيح مسلم ، عن أبي هريرة - رضي الله عنه - أن النبي - صلى الله عليه وسلم - قال : لا تبدءوا اليهود والنصارى بالسلام ، وإذا لقيتم أحدهم في طريق فاضطروه إلى أضيقه .\nولهذا اشترط عليهم أمير المؤمنين عمر بن الخطاب - رضي الله عنه - تلك الشروط المعروفة في إذلالهم وتصغيرهم وتحقيرهم ، وذلك مما رواه الأئمة الحفاظ ، من رواية عبد الرحمن بن غنم الأشعري قال : كتبت لعمر بن الخطاب - رضي الله عنه - حين صالح نصارى من أهل الشام :\nبسم الله الرحمن الرحيم ، هذا كتاب لعبد الله عمر أمير المؤمنين من نصارى مدينة كذا وكذا ، إنكم لما قدمتم علينا سألناكم الأمان لأنفسنا وذرارينا وأموالنا وأهل ملتنا وشرطنا لكم على أنفسنا ألا نحدث في مدينتنا ولا فيما حولها ديرا ولا كنيسة ، ولا قلاية ولا صومعة راهب ، ولا نجدد ما خرب منها ، ولا نحيي منها ما كان خطط المسلمين ، وألا نمنع كنائسنا أن ينزلها أحد من المسلمين في ليل ولا نهار ، وأن نوسع أبوابها للمارة وابن السبيل ، وأن ينزل من مر بنا من المسلمين ثلاثة أيام نطعمهم ، ولا نئوي في كنائسنا ولا منازلنا جاسوسا ، ولا نكتم غشا للمسلمين ، ولا نعلم أولادنا القرآن ، ولا نظهر شركا ، ولا ندعو إليه أحدا ؛ ولا نمنع أحدا من ذوي قرابتنا الدخول في الإسلام إن أرادوه ، وأن نوقر المسلمين ، وأن نقوم لهم من مجالسنا إن أرادوا الجلوس ، ولا نتشبه بهم في شيء من ملابسهم ، في قلنسوة ، ولا عمامة ، ولا نعلين ، ولا فرق شعر ، ولا نتكلم بكلامهم ، ولا نكتني بكناهم ، ولا نركب السروج ، ولا نتقلد السيوف ، ولا نتخذ شيئا من السلاح ، ولا نحمله معنا ، ولا ننقش خواتيمنا بالعربية ، ولا نبيع الخمور ، وأن نجز مقاديم رءوسنا ، وأن نلزم زينا حيثما كنا ، وأن نشد الزنانير على أوساطنا ، وألا نظهر الصليب على كنائسنا ، وألا نظهر صلبنا ولا كتبنا في شيء من طرق المسلمين ولا أسواقهم ، ولا نضرب نواقيسنا في كنائسنا إلا ضربا خفيا ، وألا نرفع أصواتنا بالقراءة في كنائسنا في شيء من حضرة المسلمين ، ولا نخرج شعانين ولا باعوثا ، ولا نرفع أصواتنا مع موتانا ، ولا نظهر النيران معهم في شيء من طرق المسلمين ولا أسواقهم ، ولا نجاورهم بموتانا ، ولا نتخذ من الرقيق ما جرى عليه سهام المسلمين ، وأن نرشد المسلمين ، ولا نطلع عليهم في منازلهم .\nقال : فلما أتيت عمر بالكتاب ، زاد فيه : ولا نضرب أحدا من المسلمين ، شرطنا لكم ذلك على أنفسنا وأهل ملتنا ، وقبلنا عليه الأمان ، فإن نحن خالفنا في شيء مما شرطناه لكم ووظفنا على أنفسنا ، فلا ذمة لنا ، وقد حل لكم منا ما يحل من أهل المعاندة والشقاق .\n                                    ",
        "qortoby": "قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ ٩٢\n                                    \n                                    \n                                    قوله تعالى قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون\nفيه خمس عشرة مسألة :\nالأولى : قوله تعالى : قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر لما حرم الله تعالى على الكفار أن يقربوا المسجد الحرام ، وجد المسلمون في أنفسهم بما قطع عنهم من التجارة التي كان المشركون يوافون بها ، قال الله عز وجل : ( وإن خفتم عيلة ) الآية . على ما تقدم . ثم أحل في هذه الآية الجزية وكانت لم تؤخذ قبل ذلك ، فجعلها عوضا مما منعهم من موافاة المشركين بتجارتهم . فقال الله عز وجل : قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر الآية . فأمر سبحانه وتعالى بمقاتلة جميع الكفار لإصفاقهم على هذا الوصف ، وخص أهل الكتاب بالذكر إكراما لكتابهم ، ولكونهم عالمين بالتوحيد والرسل والشرائع والملل ، وخصوصا ذكر محمد صلى الله عليه وسلم وملته وأمته . فلما أنكروه تأكدت عليهم الحجة وعظمت منهم الجريمة ، فنبه على محلهم ثم جعل للقتال غاية وهي إعطاء الجزية بدلا عن القتل . وهو الصحيح . قال ابن العربي : سمعت أبا الوفاء علي بن عقيل في مجلس النظر يتلوها ويحتج بها . فقال : قاتلوا وذلك أمر بالعقوبة . ثم قال : الذين لا يؤمنون وذلك بيان للذنب الذي أوجب العقوبة . وقوله : ولا باليوم الآخر تأكيد للذنب في جانب الاعتقاد . ثم قال : ولا يحرمون ما حرم الله ورسوله زيادة للذنب في مخالفة الأعمال . ثم قال : ولا يدينون دين الحق إشارة إلى تأكيد المعصية بالانحراف والمعاندة والأنفة عن الاستسلام . ثم قال : من الذين أوتوا الكتاب تأكيد للحجة ؛ لأنهم كانوا يجدونه مكتوبا عندهم في التوراة والإنجيل . ثم قال : حتى يعطوا الجزية عن يد فبين الغاية التي تمتد إليها العقوبة وعين البدل الذي ترتفع به .\nالثانية : وقد اختلف العلماء فيمن تؤخذ منه الجزية ، قال الشافعي رحمه الله : لا تقبل الجزية إلا من أهل الكتاب خاصة عربا كانوا أو عجما لهذه الآية ، فإنهم هم الذين خصوا بالذكر فتوجه الحكم إليهم دون من سواهم لقوله عز وجل : فاقتلوا المشركين حيث وجدتموهم . ولم يقل : حتى يعطوا الجزية كما قال في أهل الكتاب . وقال : وتقبل من المجوس بالسنة ؛ وبه قال أحمد وأبو ثور . وهو مذهب الثوري وأبي حنيفة وأصحابه . وقال الأوزاعي : تؤخذ الجزية من كل عابد وثن أو نار أو جاحد أو مكذب . وكذلك مذهب مالك ، فإنه رأى الجزية تؤخذ من جميع أجناس الشرك والجحد ، عربيا أو عجميا ، تغلبيا أو قرشيا ، كائنا من كان ، إلا المرتد . وقال ابن القاسم وأشهب وسحنون : تؤخذ الجزية من مجوس العرب والأمم كلها . وأما عبدة الأوثان من العرب فلم يستن الله فيهم جزية ، ولا يبقى على الأرض منهم أحد ، وإنما لهم القتال أو الإسلام . ويوجد لابن القاسم : أن الجزية تؤخذ منهم ، كما يقول مالك . وذلك في التفريع لابن الجلاب وهو احتمال لا نص . وقال ابن وهب : لا تقبل الجزية من مجوس العرب وتقبل من غيرهم . قال : لأنه ليس في العرب مجوسي إلا وجميعهم أسلم ، فمن وجد منهم بخلاف الإسلام فهو مرتد يقتل بكل حال إن لم يسلم ولا تقبل منهم جزية . وقال ابن الجهم : تقبل الجزية من كل من دان بغير الإسلام إلا ما أجمع عليه من كفار قريش . وذكر في تعليل ذلك أنه إكرام لهم عن الذلة والصغار ، لمكانهم من رسول الله صلى الله عليه وسلم . وقال غيره : إنما ذلك لأن جميعهم أسلم يوم فتح مكة . والله أعلم .\nالثالثة : وأما المجوس فقال ابن المنذر : لا أعلم خلافا أن الجزية تؤخذ منهم . وفي الموطإ : مالك عن جعفر بن محمد عن أبيه أن عمر بن الخطاب ذكر أمر المجوس فقال : ما أدري كيف أصنع في أمرهم . فقال عبد الرحمن بن عوف : أشهد لسمعت رسول الله صلى الله عليه وسلم يقول : سنوا بهم سنة أهل الكتاب . قال أبو عمر : يعني في الجزية خاصة . وفي قول رسول الله صلى الله عليه وسلم : سنوا بهم سنة أهل الكتاب دليل على أنهم ليسوا أهل كتاب . وعلى هذا جمهور الفقهاء . وقد روي عن الشافعي أنهم كانوا أهل كتاب فبدلوا . وأظنه ذهب في ذلك إلى شيء روي عن علي بن أبي طالب رضي الله عنه من وجه فيه ضعف ، يدور على أبي سعيد البقال ، ذكره عبد الرزاق وغيره . قال ابن عطية : وروي أنه قد كان بعث في المجوس نبي اسمه زرادشت . والله أعلم .\nالرابعة : لم يذكر الله سبحانه وتعالى في كتابه مقدارا للجزية المأخوذة منهم . وقد اختلف العلماء في مقدار الجزية المأخوذة منهم ، فقال عطاء بن أبي رباح : لا توقيت فيها ، وإنما هو على ما صولحوا عليه . وكذلك قال يحيى بن آدم وأبو عبيد والطبري ، إلا أن الطبري قال : أقله دينار وأكثره لا حد له . واحتجوا بما رواه أهل الصحيح عن عمرو بن عوف : أن رسول الله صلى الله عليه وسلم صالح أهل البحرين على الجزية . وقال الشافعي : دينار على الغني والفقير من الأحرار البالغين لا ينقص منه شيء واحتج بما رواه أبو داود وغيره عن معاذ : أن رسول الله صلى الله عليه وسلم بعثه إلى اليمن وأمره أن يأخذ من كل حالم دينارا في الجزية . قال الشافعي : وهو المبين عن الله تعالى مراده . وهو قول أبي ثور . قال الشافعي : وإن صولحوا على أكثر من دينار جاز ، وإن زادوا وطابت بذلك أنفسهم قبل منهم . وإن صولحوا على ضيافة ثلاثة أيام جاز ، إذا كانت الضيافة معلومة في الخبز والشعير والتبن والإدام ، وذكر ما على الوسط من ذلك وما على الموسر وذكر موضع النزول والكن من البرد والحر . وقال مالك فيما رواه عنه ابن القاسم وأشهب ومحمد بن الحارث بن زنجويه : إنها أربعة دنانير على أهل الذهب وأربعون درهما على أهل الورق ، الغني والفقير سواء ولو كان مجوسيا . لا يزاد ولا ينقص على ما فرض عمر لا يؤخذ منهم غيره . وقد قيل : إن الضعيف يخفف عنه بقدر ما يراه الإمام . وقال ابن القاسم : لا ينقص من فرض عمر لعسر ولا يزاد عليه لغنى . قال أبو عمر : ويؤخذ من فقرائهم بقدر ما يحتملون ولو درهما . وإلى هذا رجع مالك . وقال أبو حنيفة وأصحابه ومحمد بن الحسن وأحمد بن حنبل : اثنا عشر ، وأربعة وعشرون ، وأربعون . قال الثوري : جاء عن عمر بن الخطاب في ذلك ضرائب مختلفة ، فللوالي أن يأخذ بأيها شاء ، إذا كانوا أهل ذمة . وأما أهل الصلح فما صولحوا عليه لا غير .\nالخامسة : قال علماؤنا رحمة الله عليهم : والذي دل عليه القرآن أن الجزية تؤخذ من الرجال المقاتلين ؛ لأنه تعالى قال : قاتلوا الذين إلى قوله : حتى يعطوا الجزية فيقتضي ذلك وجوبها على من يقاتل . ويدل على أنه ليس على العبد وإن كان مقاتلا ؛ لأنه لا مال له ، ولأنه تعالى قال : حتى يعطوا . ولا يقال لمن لا يملك حتى يعطي . وهذا إجماع من العلماء على أن الجزية إنما توضع على جماجم الرجال الأحرار البالغين ، وهم الذين يقاتلون دون النساء والذرية والعبيد والمجانين المغلوبين على عقولهم والشيخ الفاني . واختلف في الرهبان ، فروى ابن وهب عن مالك أنها لا تؤخذ منهم . قال مطرف وابن الماجشون : هذا إذا لم يترهب بعد فرضها فإن فرضت ثم ترهب لم يسقطها ترهبه .\nالسادسة : إذا أعطى أهل الجزية الجزية لم يؤخذ منهم شيء من ثمارهم ولا تجارتهم ولا زروعهم إلا أن يتجروا في بلاد غير بلادهم التي أقروا فيها وصولحوا عليها . فإن خرجوا تجارا عن بلادهم التي أقروا فيها إلى غيرها أخذ منهم العشر إذا باعوا ونض ثمن ذلك بأيديهم ولو كان ذلك في السنة مرارا إلا في حملهم الطعام : الحنطة والزيت إلى المدينة ومكة خاصة ، فإنه يؤخذ منهم نصف العشر على ما فعل عمر . ومن أهل المدينة من لا يرى أن يؤخذ من أهل الذمة العشر في تجارتهم إلا مرة في الحول ، مثل ما يؤخذ من المسلمين . وهو مذهب عمر بن عبد العزيز وجماعة من أئمة الفقهاء . والأول قول مالك وأصحابه .\nالسابعة : إذا أدى أهل الجزية جزيتهم التي ضربت عليهم أو صولحوا عليها خلي بينهم وبين أموالهم كلها ، وبين كرومهم وعصرها ما ستروا خمورهم ولم يعلنوا بيعها من مسلم ، ومنعوا من إظهار الخمر والخنزير في أسواق المسلمين ، فإن أظهروا شيئا من ذلك أريقت الخمر عليهم ، وأدب من أظهر الخنزير . وإن أراقها مسلم من غير إظهارها فقد تعدى ، ويجب عليه الضمان . وقيل : لا يجب ولو غصبها وجب عليه ردها . ولا يعترض لهم في أحكامهم ولا متاجرتهم فيما بينهم بالربا . فإن تحاكموا إلينا فالحاكم مخير ، إن شاء حكم بينهم بما أنزل الله وإن شاء أعرض . وقيل : يحكم بينهم في المظالم على كل حال ، ويؤخذ من قويهم لضعيفهم ؛ لأنه من باب الدفع عنهم . وعلى الإمام أن يقاتل عنهم عدوهم ويستعين بهم في قتالهم . ولا حظ لهم في الفيء ، وما صولحوا عليه من الكنائس لم يزيدوا عليها ، ولم يمنعوا من إصلاح ما وهى منها ، ولا سبيل لهم إلى إحداث غيرها . ويأخذون من اللباس والهيئة بما يبينون به من المسلمين ، ويمنعون من التشبه بأهل الإسلام . ولا بأس باشتراء أولاد العدو منهم إذا لم تكن لهم ذمة . ومن لد في أداء جزيته أدب على لدده وأخذت منه صاغرا .\nالثامنة : اختلف العلماء فيما وجبت الجزية عنه ، فقال علماء المالكية : وجبت بدلا عن القتل بسبب الكفر . وقال الشافعي : وجبت بدلا عن الدم وسكنى الدار . وفائدة الخلاف أنا إذا قلنا وجبت بدلا عن القتل فأسلم سقطت عنه الجزية لما مضى ، ولو أسلم قبل تمام الحول بيوم أو بعده عند مالك . وعند الشافعي أنها دين مستقر في الذمة فلا يسقطه الإسلام كأجرة الدار . وقال بعض الحنفية بقولنا . وقال بعضهم : إنما وجبت بدلا عن النصر والجهاد . واختاره القاضي أبو زيد وزعم أنه سر الله في المسألة . وقول مالك أصح ، لقوله صلى الله عليه وسلم : ليس على مسلم جزية . قال سفيان : معناه إذا أسلم الذمي بعد ما وجبت الجزية عليه بطلت عنه . أخرجه الترمذي وأبو داود . قال علماؤنا : وعليه يدل قوله تعالى : حتى يعطوا الجزية عن يد وهم صاغرون لأن بالإسلام يزول هذا المعنى . ولا خلاف أنهم إذا أسلموا فلا يؤدون الجزية عن يد وهم صاغرون . والشافعي لا يأخذ بعد الإسلام على الوجه الذي قاله الله تعالى . وإنما يقول : إن الجزية دين ، وجبت عليه بسبب سابق وهو السكنى أو توقي شر القتل ، فصارت كالديون كلها .\nالتاسعة : لو عاهد الإمام أهل بلد أو حصن ثم نقضوا عهدهم وامتنعوا من أداء ما يلزمهم من الجزية وغيرها وامتنعوا من حكم الإسلام من غير أن يظلموا وكان الإمام غير جائر عليهم ؛ وجب على المسلمين غزوهم وقتالهم مع إمامهم . فإن قاتلوا وغلبوا حكم فيهم بالحكم في دار الحرب سواء . وقد قيل : هم ونساؤهم فيء ولا خمس فيهم ، وهو مذهب .\nالعاشرة : فإن خرجوا متلصصين قاطعين الطريق فهم بمنزلة المحاربين المسلمين إذا لم يمنعوا الجزية . ولو خرجوا متظلمين نظر في أمرهم وردوا إلى الذمة وأنصفوا من ظالمهم ولا يسترق منهم أحد وهم أحرار . فإن نقض بعضهم دون بعض فمن لم ينقض على عهده ، ولا يؤخذ بنقض غيره وتعرف إقامتهم على العهد بإنكارهم على الناقضين .\nالحادية عشرة : الجزية وزنها فعلة ، من جزى يجزي إذا كافأ عما أسدي إليه ، فكأنهم أعطوها جزاء ما منحوا من الأمن ، وهي كالقعدة والجلسة . ومن هذا المعنى قول الشاعر :\nيجزيك أو يثني عليك وإن من أثنى عليك بما فعلت كمن جزى\nالثانية عشرة : روى مسلم عن هشام بن حكيم بن حزام ومر على ناس من الأنباط بالشام قد أقيموا في الشمس - في رواية : وصب على رءوسهم الزيت - فقال : ما شأنهم ؟ فقال يحبسون في الجزية . فقال هشام : أشهد لسمعت رسول الله صلى الله عليه وسلم يقول : إن الله يعذب الذين يعذبون الناس في الدنيا . في رواية : وأميرهم يومئذ عمير بن سعد على فلسطين ، فدخل عليه فحدثه فأمر بهم فخلوا . قال علماؤنا : أما عقوبتهم إذا امتنعوا من أدائها مع التمكين فجائز ، فأما مع تبين عجزهم فلا تحل عقوبتهم ؛ لأن من عجز عن الجزية سقطت عنه . ولا يكلف الأغنياء أداءها عن الفقراء . وروى أبو داود عن صفوان بن سليم عن عدة من أبناء أصحاب رسول الله صلى الله عليه وسلم عن آبائهم أن رسول الله صلى الله عليه وسلم قال : من ظلم معاهدا أو انتقصه أو كلفه فوق طاقته أو أخذ شيئا منه بغير طيب نفس فأنا حجيجه يوم القيامة .\nالثالثة عشرة : قوله تعالى : عن يد قال ابن عباس : يدفعها بنفسه غير مستنيب فيها أحدا روى أبو البختري عن سلمان قال : مذمومين . وروى معمر عن قتادة قال : عن قهر . وقيل : عن يد عن إنعام منكم عليهم ؛ لأنهم إذا أخذت منهم الجزية فقد أنعم عليهم بذلك . عكرمة : يدفعها وهو قائم والآخذ جالس وقاله سعيد بن جبير . ابن العربي : وهذا ليس من قوله : عن يد وإنما هو من قوله : وهم صاغرون .\nالرابعة عشرة : روى الأئمة عن عبد الله بن عمر أن رسول الله صلى الله عليه وسلم قال : اليد العليا خير من اليد السفلى واليد العليا : المنفقة ، والسفلى : السائلة . وروي : \" واليد العليا هي المعطية \" . فجعل يد المعطي في الصدقة عليا ، وجعل يد المعطي في الجزية سفلى . ويد الآخذ عليا ; ذلك بأنه الرافع الخافض ، يرفع من يشاء ويخفض من يشاء ، لا إله غيره .\nالخامسة عشرة : عن حبيب بن أبي ثابت قال : جاء رجل إلى ابن عباس فقال : إن أرض الخراج يعجز عنها أهلها أفأعمرها وأزرعها وأؤدي خراجها ؟ فقال : لا . وجاءه آخر فقال له ذلك فقال : لا وتلا قوله تعالى : قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر إلى قوله : وهم صاغرون أيعمد أحدكم إلى الصغار في عنق أحدهم فينتزعه فيجعله في عنقه وقال كليب بن وائل : قلت لابن عمر اشتريت أرضا قال الشراء حسن . قلت : فإني أعطي عن كل جريب أرض درهما وقفيز طعام . قال : لا تجعل في عنقك صغارا . وروى ميمون بن مهران عن ابن عمر رضي الله عنهما قال : ما يسرني أن لي الأرض كلها بجزية خمسة دراهم أقر فيها بالصغار على نفسي .\n                                    ",
        "saadi": "قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ ٩٢\n                                        \n                                        \n                                        \n                                        هذه الآية أمر بقتال الكفار من اليهود والنصارى من ‏{‏الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ‏}‏ إيمانا صحيحا يصدقونه بأفعالهم وأعمالهم‏.‏ ولا يحرمون ما حرم الله، فلا يتبعون شرعه في تحريم المحرمات، ‏{‏وَلَا يَدِينُونَ دِينَ الْحَقِّ‏}‏ أي‏:‏ لا يدينون بالدين الصحيح، وإن زعموا أنهم على دين، فإنه دين غير الحق، لأنه إما بين دين مبدل، وهو الذي لم يشرعه اللّه أصلا، وإما دين منسوخ قد شرعه اللّه، ثم غيره بشريعة محمد ـ صلى الله عليه وسلم ـ فيبقى التمسك به بعد النسخ غير جائز‏.‏\nفأمره بقتال هؤلاء وحث على ذلك، لأنهم يدعون إلى ما هم عليه، ويحصل الضرر الكثير منهم للناس، بسبب أنهم أهل كتاب‏.‏\nوغيَّى ذلك القتال ‏{‏حَتَّى يُعْطُوا الْجِزْيَةَ‏}‏ أي‏:‏ المال الذي يكون جزاء لترك المسلمين قتالهم، وإقامتهم آمنين على أنفسهم وأموالهم، بين أظهر المسلمين، يؤخذ منهم كل عام، كلٌّ على حسب حاله، من غني وفقير ومتوسط، كما فعل ذلك أمير المؤمنين عمر بن الخطاب وغيره، من أمراء المؤمنين‏.‏\nوقوله‏:‏ ‏{‏عَنْ يَدٍ‏}‏ أي‏:‏ حتى يبذلوها في حال ذلهم، وعدم اقتدارهم، ويعطونها بأيديهم، فلا يرسلون بها خادما ولا غيره، بل لا تقبل إلا من أيديهم، ‏{‏وَهُمْ صَاغِرُونَ‏}‏\nفإذا كانوا بهذه الحال، وسألوا المسلمين أن يقروهم بالجزية، وهم تحت أحكام المسلمين وقهرهم، وحال الأمن من شرهم وفتنتهم، واستسلموا للشروط التي أجراها عليهم المسلمون مما ينفي عزهم وتكبرهم، ويوجب ذلهم وصغارهم، وجب على الإمام أو نائبه أن يعقدها لهم‏.‏\nوإلا بأن لم يفوا، ولم يعطوا الجزية عن يد وهم صاغرون، لم يجز إقرارهم بالجزية، بل يقاتلون حتى يسلموا‏.‏\nواستدل بهذه الآية الجمهور الذين يقولون‏:‏ لا تؤخذ الجزية إلا من أهل الكتاب، لأن اللّه لم يذكر أخذ الجزية إلا منهم‏.‏\nوأما غيرهم فلم يذكر إلا قتالهم حتى يسلموا، وألحق بأهل الكتاب في أخد الجزية وإقرارهم في ديار المسلمين، المجوس، فإن النبي ـ صلى الله عليه وسلم ـ أخذ الجزية من مجوس هجر، ثم أخذها أمير المؤمنين عمر من الفرس المجوس‏.‏\nوقيل‏:‏ إن الجزية تؤخذ من سائر الكفار من أهل الكتاب وغيرهم، لأن هذه الآية نزلت بعد الفراغ من قتال العرب المشركين، والشروع في قتال أهل الكتاب ونحوهم، فيكون هذا القيد إخبارا بالواقع، لا مفهوما له‏.‏\nويدل على هذا أن المجوس أخذت منهم الجزية وليسوا أهل كتاب، ولأنه قد تواتر عن المسلمين من الصحابة ومن بعدهم أنهم يدعون من يقاتلونهم إلى إحدى ثلاث‏:‏ إما الإسلام، أو أداء الجزية، أو السيف، من غير فرق بين كِتَابِيٍّ وغيره‏.‏\n                                    "
      },
      "originalText": "قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ ٩٢"
    },
    {
      "number": 1265,
      "text": "وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللَّهِ وَقَالَتِ النَّصَارَى الْمَسِيحُ ابْنُ اللَّهِ ۖ ذَٰلِكَ قَوْلُهُمْ بِأَفْوَاهِهِمْ ۖ يُضَاهِئُونَ قَوْلَ الَّذِينَ كَفَرُوا مِنْ قَبْلُ ۚ قَاتَلَهُمُ اللَّهُ ۚ أَنَّىٰ يُؤْفَكُونَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 30,
      "juz": 10,
      "manzil": 2,
      "page": 191,
      "ruku": 160,
      "hizbQuarter": 76,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَتِ ٱلۡيَهُودُ عُزَيۡرٌ ٱبۡنُ ٱللَّهِ وَقَالَتِ ٱلنَّصَٰرَى ٱلۡمَسِيحُ ٱبۡنُ ٱللَّهِۖ ذَٰلِكَ قَوۡلُهُم بِأَفۡوَٰهِهِمۡۖ يُضَٰهِ‍ُٔونَ قَوۡلَ ٱلَّذِينَ كَفَرُواْ مِن قَبۡلُۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ ٠٣\n                                    \n                                    \n                                    وهذا إغراء من الله تعالى للمؤمنين على قتال المشركين الكفار من اليهود والنصارى ؛ لمقالتهم هذه المقالة الشنيعة ، والفرية على الله تعالى ، فأما اليهود فقالوا في العزير : \" إنه ابن الله \" ، تعالى [ الله ] عن ذلك علوا كبيرا . وذكر السدي وغيره أن الشبهة التي حصلت لهم في ذلك ، أن العمالقة لما غلبت على بني إسرائيل ، فقتلوا علماءهم وسبوا كبارهم ، بقي العزير يبكي على بني إسرائيل وذهاب العلم منهم ، حتى سقطت جفون عينيه ، فبينا هو ذات يوم إذ مر على جبانة ، وإذ امرأة تبكي عند قبر وهي تقول : وامطعماه ! واكاسياه ! [ فقال لها ويحك ] من كان يطعمك قبل هذا ؟ قالت : الله . قال : فإن الله حي لا يموت ! قالت : يا عزير فمن كان يعلم العلماء قبل بني إسرائيل ؟ قال : الله . قالت : فلم تبكي عليهم ؟ فعرف أنه شيء قد وعظ به . ثم قيل له : اذهب إلى نهر كذا فاغتسل منه ، وصل هناك ركعتين ، فإنك ستلقى هناك شيخا ، فما أطعمك فكله . فذهب ففعل ما أمر به ، فإذا شيخ فقال له : افتح فمك . ففتح فمه . فألقى فيه شيئا كهيئة الجمرة العظيمة ، ثلاث مرات ، فرجع عزير وهو من أعلم الناس بالتوراة ، فقال : يا بني إسرائيل ، قد جئتكم بالتوراة . فقالوا : يا عزير ، ما كنت كذابا . فعمد فربط على إصبع من أصابعه قلما ، وكتب التوراة بإصبعه كلها ، فلما تراجع الناس من عدوهم ورجع العلماء ، وأخبروا بشأن عزير ، فاستخرجوا النسخ التي كانوا أودعوها في الجبال ، وقابلوها بها ، فوجدوا ما جاء به صحيحا ، فقال بعض جهلتهم : إنما صنع هذا لأنه ابن الله .\nوأما ضلال النصارى في المسيح فظاهر ؛ ولهذا كذب الله سبحانه الطائفتين فقال : ( ذلك قولهم بأفواههم ) أي : لا مستند لهم فيما ادعوه سوى افترائهم واختلاقهم ، ( يضاهئون ) أي : يشابهون ( قول الذين كفروا من قبل ) أي : من قبلهم من الأمم ، ضلوا كما ضل هؤلاء ، ( قاتلهم الله ) وقال ابن عباس : لعنهم الله ، ( أنى يؤفكون ) ؟ أي : كيف يضلون عن الحق ، وهو ظاهر ، ويعدلون إلى الباطل ؟ .\n                                    ",
        "qortoby": "وَقَالَتِ ٱلۡيَهُودُ عُزَيۡرٌ ٱبۡنُ ٱللَّهِ وَقَالَتِ ٱلنَّصَٰرَى ٱلۡمَسِيحُ ٱبۡنُ ٱللَّهِۖ ذَٰلِكَ قَوۡلُهُم بِأَفۡوَٰهِهِمۡۖ يُضَٰهِ‍ُٔونَ قَوۡلَ ٱلَّذِينَ كَفَرُواْ مِن قَبۡلُۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ ٠٣\n                                    \n                                    \n                                    قوله تعالى وقالت اليهود عزير ابن الله وقالت النصارى المسيح ابن الله ذلك قولهم بأفواههم يضاهئون قول الذين كفروا من قبل قاتلهم الله أنى يؤفكون\nفيه سبع مسائل :\nقرأ عاصم والكسائي عزير ابن الله بتنوين عزير . والمعنى أن \" ابنا \" على هذا خبر ابتداء عن ( عزير ) ، و \" عزير \" ينصرف عجميا كان أو عربيا . وقرأ ابن كثير ونافع وأبو عمرو وابن عامر ( عزير ابن ) بترك التنوين لاجتماع الساكنين ، ومنه قراءة من قرأ \" قل هو الله أحد الله الصمد \" . قال أبو علي : وهو كثير في الشعر . وأنشد الطبري في ذلك :\nلتجدني بالأمير برا وبالقناة مدعسا مكرا\nإذا غطيف السلمي فرا\nالثانية : قوله تعالى وقالت اليهود هذا لفظ خرج على العموم ومعناه الخصوص ؛ لأن ليس كل اليهود قالوا ذلك . وهذا مثل قوله تعالى : الذين قال لهم الناس ولم يقل ذلك كل الناس . وقيل : إن قائل ما حكي عن اليهود سلام بن مشكم ونعمان بن أبي أوفى وشاس بن قيس ومالك بن الصيف ، قالوه للنبي صلى الله عليه وسلم . قال النقاش : لم يبق يهودي يقولها بل انقرضوا فإذا قالها واحد فيتوجه أن تلزم الجماعة شنعة المقالة ، لأجل نباهة القائل فيهم . وأقوال النبهاء أبدا مشهورة في الناس يحتج بها . فمن هاهنا صح أن تقول الجماعة قول نبيهها . والله أعلم .\nوقد روي أن سبب ذلك القول أن اليهود قتلوا الأنبياء بعد موسى عليه السلام فرفع الله عنهم التوراة ومحاها من قلوبهم ، فخرج عزير يسيح في الأرض ، فأتاه جبريل فقال : أين تذهب ؟ قال : أطلب العلم ، فعلمه التوراة كلها فجاء عزير بالتوراة إلى بني إسرائيل فعلمهم . وقيل : بل حفظها الله عزيرا كرامة منه له ، فقال لبني إسرائيل : إن الله قد حفظني التوراة ، فجعلوا يدرسونها من عنده . وكانت التوراة مدفونة ، كان دفنها علماؤهم حين أصابهم من الفتن والجلاء والمرض ما أصاب وقتل بختنصر إياهم . ثم إن التوراة المدفونة وجدت فإذا هي متساوية لما كان عزير يدرس فضلوا عند ذلك وقالوا : إن هذا لم يتهيأ لعزير إلا وهو ابن الله حكاه الطبري . وظاهر قول النصارى أن المسيح ابن الله ، إنما أرادوا بنوة النسل كما قالت العرب في الملائكة . وكذلك يقتضي قول الضحاك والطبري وغيرهما . وهذا أشنع الكفر . قال أبو المعالي : أطبقت النصارى على أن المسيح إله وأنه ابن إله . قال ابن عطية : ويقال إن بعضهم يعتقدها بنوة حنو ورحمة . وهذا المعنى أيضا لا يحل أن تطلق البنوة عليه وهو كفر .\nالثالثة : قال ابن العربي : في هذا دليل من قول ربنا تبارك وتعالى على أن من أخبر عن كفر غيره الذي لا يجوز لأحد أن يبتدئ به لا حرج عليه ؛ لأنه إنما ينطق به على معنى الاستعظام له والرد عليه ولو شاء ربنا ما تكلم به أحد ، فإذا مكن من إطلاق الألسن به فقد أذن بالإخبار عنه على معنى إنكاره بالقلب واللسان والرد عليه بالحجة والبرهان .\nالرابعة : قوله تعالى ذلك قولهم بأفواههم قيل : معناه التأكيد ، كما قال تعالى : يكتبون الكتاب بأيديهم وقوله : ولا طائر يطير بجناحيه وقوله : فإذا نفخ في الصور نفخة واحدة ومثله كثير . وقيل : المعنى أنه لما كان قول ساذج ليس فيه بيان ولا برهان ، وإنما هو قول بالفم مجرد نفس دعوى لا معنى تحته صحيح لأنهم معترفون بأن الله سبحانه لم يتخذ صاحبة فكيف يزعمون أن له ولدا ، فهو كذب وقول لساني فقط ، بخلاف الأقوال الصحيحة التي تعضدها الأدلة ويقوم عليها البرهان . قال أهل المعاني : إن الله سبحانه لم يذكر قولا مقرونا بذكر الأفواه والألسن إلا وكان قولا زورا ، كقوله : يقولون بأفواههم ما ليس في قلوبهم و كبرت كلمة تخرج من أفواههم إن يقولون إلا كذبا و يقولون بألسنتهم ما ليس في قلوبهم .\nالخامسة : قوله تعالى يضاهئون قول الذين كفروا من قبل ( يضاهئون ) يشابهون ، ومنه قول العرب : امرأة ضهيأ للتي لا تحيض أو التي لا ثدي لها ، كأنها أشبهت الرجال . وللعلماء في ( قول الذين كفروا ) ثلاثة أقوال : الأول : قول عبدة الأوثان : اللات والعزى ومناة الثالثة الأخرى . الثاني : قول الكفرة : الملائكة بنات الله . الثالث : قول أسلافهم ، فقلدوهم في الباطل واتبعوهم على الكفر ، كما أخبر عنهم بقوله تعالى : إنا وجدنا آباءنا على أمة .\nالسادسة : اختلف العلماء في \" ضهيأ \" هل يمد أو لا ، فقال ابن ولاد : امرأة ضهيأ ، وهي التي لا تحيض ، مهموز غير ممدود . ومنهم من يمد وهو سيبويه فيجعلها على فعلاء بالمد ، والهمزة فيها زائدة لأنهم يقولون نساء ضهي فيحذفون الهمزة . قال أبو الحسن قال لي النجيرمي : ضهيأة بالمد والهاء . جمع بين علامتي تأنيث ، حكاه عن أبي عمرو الشيباني في النوادر . وأنشد :\nضهيأة أو عاقر جماد\nابن عطية : من قال يضاهئون مأخوذ من قولهم : امرأة ضهياء ، فقوله خطأ ، قاله أبو علي ؛ لأن الهمزة في \" ضاهأ \" أصلية ، وفي \" ضهياء \" زائدة كحمراء .\nالسابعة : قوله تعالى قاتلهم الله أنى يؤفكون أي لعنهم الله ، يعني اليهود والنصارى ؛ لأن الملعون كالمقتول . قال ابن جريج : قاتلهم الله هو بمعنى التعجب . وقال ابن عباس : كل شيء في القرآن قتل فهو لعن ، ومنه قول أبان بن تغلب :\nقاتلها الله تلحاني وقد علمت أني لنفسي إفسادي وإصلاحي\nوحكى النقاش أن أصل \" قاتل الله \" الدعاء ، ثم كثر في استعمالهم حتى قالوه على التعجب في الخير والشر ، وهم لا يريدون الدعاء . وأنشد الأصمعي :\nيا قاتل الله ليلى كيف تعجبني وأخبر الناس أني لا أباليها\n                                    ",
        "saadi": "وَقَالَتِ ٱلۡيَهُودُ عُزَيۡرٌ ٱبۡنُ ٱللَّهِ وَقَالَتِ ٱلنَّصَٰرَى ٱلۡمَسِيحُ ٱبۡنُ ٱللَّهِۖ ذَٰلِكَ قَوۡلُهُم بِأَفۡوَٰهِهِمۡۖ يُضَٰهِ‍ُٔونَ قَوۡلَ ٱلَّذِينَ كَفَرُواْ مِن قَبۡلُۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ ٠٣\n                                        \n                                        \n                                        \n                                        لما أمر تعالى بقتال أهل الكتاب، ذكر من أقوالهم الخبيثة، ما يهيج المؤمنين الذين يغارون لربهم ولدينه على قتالهم، والاجتهاد وبذل الوسع فيه فقال‏:‏ ‏{‏وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللَّهِ‏}‏ وهذه المقالة وإن لم تكن مقالة لعامتهم فقد قالها فرقة منهم، فيدل ذلك على أن في اليهود من الخبث والشر ما أوصلهم إلى أن قالوا هذه المقالة التي تجرأوا فيها على اللّه، وتنقصوا عظمته وجلاله‏.‏\nوقد قيل‏:‏ إن سبب ادعائهم في ‏{‏عزير‏}‏ أنه ابن اللّه، أنه لما سلط الله الملوك على بني إسرائيل، ومزقوهم كل ممزق، وقتلوا حَمَلَةَ التوراة، وجدوا\nعزيرا بعد ذلك حافظا لها أو لأكثرها، فأملاها عليهم من حفظه، واستنسخوها، فادعوا فيه هذه الدعوى الشنيعة‏.‏\n‏{‏وَقَالَتِ النَّصَارَى الْمَسِيحُ‏}‏ عيسى ابن مريم ‏{‏ابْنُ اللَّهِ‏}‏ قال اللّه تعالى ‏{‏ذَلِكَ‏}‏ القول الذي قالوه ‏{‏قَوْلُهُمْ بِأَفْوَاهِهِمْ‏}‏ لم يقيموا عليه حجة ولا برهانا‏.‏\nومن كان لا يبالي بما يقول، لا يستغرب عليه أي قول يقوله، فإنه لا دين ولا عقل، يحجزه، عما يريد من الكلام‏.‏\nولهذا قال‏:‏ ‏{‏يُضَاهِئُونَ‏}‏ أي‏:‏ يشابهون في قولهم هذا ‏{‏قَوْلَ الَّذِينَ كَفَرُوا مِنْ قَبْلُ‏}‏ أي‏:‏ قول المشركين الذين يقولون‏:‏ ‏{‏الملائكة بنات اللّه‏}‏ تشابهت قلوبهم، فتشابهت أقوالهم في البطلان‏.‏\n‏{‏قَاتَلَهُمُ اللَّهُ أَنَّى يُؤْفَكُونَ‏}‏ أي‏:‏ كيف يصرفون على الحق، الصرف الواضح المبين، إلى القول الباطل المبين‏.\n                                    "
      },
      "originalText": "وَقَالَتِ ٱلۡيَهُودُ عُزَيۡرٌ ٱبۡنُ ٱللَّهِ وَقَالَتِ ٱلنَّصَٰرَى ٱلۡمَسِيحُ ٱبۡنُ ٱللَّهِۖ ذَٰلِكَ قَوۡلُهُم بِأَفۡوَٰهِهِمۡۖ يُضَٰهِ‍ُٔونَ قَوۡلَ ٱلَّذِينَ كَفَرُواْ مِن قَبۡلُۚ قَٰتَلَهُمُ ٱللَّهُۖ أَنَّىٰ يُؤۡفَكُونَ ٠٣"
    },
    {
      "number": 1266,
      "text": "اتَّخَذُوا أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِنْ دُونِ اللَّهِ وَالْمَسِيحَ ابْنَ مَرْيَمَ وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا إِلَٰهًا وَاحِدًا ۖ لَا إِلَٰهَ إِلَّا هُوَ ۚ سُبْحَانَهُ عَمَّا يُشْرِكُونَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 31,
      "juz": 10,
      "manzil": 2,
      "page": 191,
      "ruku": 160,
      "hizbQuarter": 76,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ ١٣\n                                    \n                                    \n                                    [ وقوله ] ( اتخذوا أحبارهم ورهبانهم أربابا من دون الله والمسيح ابن مريم ) روى الإمام أحمد ، والترمذي ، وابن جرير من طرق ، عن عدي بن حاتم - رضي الله عنه - أنه لما بلغته دعوة رسول الله - صلى الله عليه وسلم - فر إلى الشام ، وكان قد تنصر في الجاهلية ، فأسرت أخته وجماعة من قومه ، ثم من رسول الله - صلى الله عليه وسلم - على أخته وأعطاها ، فرجعت إلى أخيها ، ورغبته في الإسلام وفي القدوم على رسول الله - صلى الله عليه وسلم - فقدم عدي المدينة ، وكان رئيسا في قومه طيئ ، وأبوه حاتم الطائي المشهور بالكرم ، فتحدث الناس بقدومه ، فدخل على رسول الله - صلى الله عليه وسلم - وفي عنق عدي صليب من فضة ، فقرأ رسول الله - صلى الله عليه وسلم - هذه الآية : ( اتخذوا أحبارهم ورهبانهم أربابا من دون الله ) قال : فقلت : إنهم لم يعبدوهم . فقال : بلى ، إنهم حرموا عليهم الحلال ، وأحلوا لهم الحرام ، فاتبعوهم ، فذلك عبادتهم إياهم . وقال رسول الله - صلى الله عليه وسلم - : يا عدي ، ما تقول ؟ أيفرك أن يقال : الله أكبر ؟ فهل تعلم شيئا أكبر من الله ؟ ما يفرك ؟ أيفرك أن يقال : لا إله إلا الله ؟ فهل تعلم من إله إلا الله ؟ ثم دعاه إلى الإسلام فأسلم ، وشهد شهادة الحق ، قال : فلقد رأيت وجهه استبشر ثم قال : إن اليهود مغضوب عليهم ، والنصارى ضالون .\nوهكذا قال حذيفة بن اليمان ، وعبد الله بن عباس ، وغيرهما في تفسير : ( اتخذوا أحبارهم ورهبانهم أربابا من دون الله ) إنهم اتبعوهم فيما حللوا وحرموا .\nوقال السدي : استنصحوا الرجال ، وتركوا كتاب الله وراء ظهورهم .\nولهذا قال تعالى : ( وما أمروا إلا ليعبدوا إلها واحدا ) أي : الذي إذا حرم الشيء فهو الحرام ، وما حلله حل ، وما شرعه اتبع ، وما حكم به نفذ .\n( لا إله إلا هو سبحانه عما يشركون ) أي : تعالى وتقدس وتنزه عن الشركاء والنظراء والأعوان والأضداد والأولاد ، لا إله إلا هو ، ولا رب سواه .\n                                    ",
        "qortoby": "ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ ١٣\n                                    \n                                    \n                                    قوله تعالى اتخذوا أحبارهم ورهبانهم أربابا من دون الله والمسيح ابن مريم وما أمروا إلا ليعبدوا إلها واحدا لا إله إلا هو سبحانه عما يشركون\nقوله تعالى اتخذوا أحبارهم ورهبانهم أربابا من دون الله والمسيح ابن مريم الأحبار جمع حبر ، وهو الذي يحسن القول وينظمه ويتقنه بحسن البيان عنه . ومنه ثوب محبر أي : جمع الزينة . وقد قيل في واحد الأحبار : حبر بكسر الحاء ، والدليل على ذلك أنهم قالوا : مداد حبر يريدون مداد عالم ، ثم كثر الاستعمال حتى قالوا للمداد حبر . قال الفراء : الكسر والفتح لغتان . وقال ابن السكيت : الحبر بالكسر المداد ، والحبر بالفتح العالم . والرهبان جمع راهب مأخوذ من الرهبة ، وهو الذي حمله خوف الله تعالى على أن يخلص له النية دون الناس ، ويجعل زمانه له وعمله معه وأنسه به .\nقوله تعالى أربابا من دون الله قال أهل المعاني : جعلوا أحبارهم ورهبانهم كالأرباب حيث أطاعوهم في كل شيء ، ومنه قوله تعالى : قال انفخوا حتى إذا جعله نارا أي كالنار . قال عبد الله بن المبارك :\nوهل أفسد الدين إلا الملوك وأحبار سوء ورهبانها\nروى الأعمش وسفيان عن حبيب بن أبي ثابت عن أبى البختري قال : سئل حذيفة عن قول الله عز وجل : اتخذوا أحبارهم ورهبانهم أربابا من دون الله هل عبدوهم ؟ فقال لا ، ولكن أحلوا لهم الحرام فاستحلوه ، وحرموا عليهم الحلال فحرموه . وروى الترمذي عن عدي بن حاتم قال : أتيت النبي صلى الله عليه وسلم وفي عنقي صليب من ذهب . فقال : ما هذا يا عدي اطرح عنك هذا الوثن . وسمعته يقرأ في سورة ( براءة ) اتخذوا أحبارهم ورهبانهم أربابا من دون الله والمسيح ابن مريم ثم قال : أما إنهم لم يكونوا يعبدونهم ولكنهم كانوا إذا أحلوا لهم شيئا استحلوه وإذا حرموا عليهم شيئا حرموه . قال : هذا حديث غريب لا يعرف إلا من حديث عبد السلام بن حرب . وغطيف بن أعين ليس بمعروف في الحديث .\nقوله تعالى والمسيح ابن مريم مضى الكلام في اشتقاقه في ( آل عمران ) والمسيح : العرق يسيل من الجبين . ولقد أحسن بعض المتأخرين فقال :\nافرح فسوف تألف الأحزانا إذا شهدت الحشر والميزانا\nوسال من جبينك المسيح كأنه جداول تسيح\nومضى في ( النساء ) معنى إضافته إلى مريم أمه .\n                                    ",
        "saadi": "ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ ١٣\n                                        \n                                        \n                                        \n                                        وهذا ـ وإن كان يستغرب على أمة كبيرة كثيرة، أن تتفق على قول ـ يدل على بطلانه أدنى تفكر وتسليط للعقل عليه، فإن لذلك سببا وهو أنهم‏:‏ ‏{‏اتَّخَذُوا أَحْبَارَهُمْ‏}‏ وهم علماؤهم ‏{‏وَرُهْبَانَهُمْ‏}‏ أي‏:‏ العُبَّاد المتجردين للعبادة‏.‏\n‏{‏أَرْبَابًا مِنْ دُونِ اللَّهِ‏}‏ يُحِلُّون لهم ما حرم اللّه فيحلونه، ويحرمون لهم ما أحل اللّه فيحرمونه، ويشرعون لهم من الشرائع والأقوال المنافية لدين الرسل فيتبعونهم عليها‏.‏\nوكانوا أيضًا يغلون في مشايخهم وعبادهم ويعظمونهم، ويتخذون قبورهم أوثانا تعبد من دون اللّه، وتقصد بالذبائح، والدعاء والاستغاثة‏.‏\n‏{‏وَالْمَسِيحَ ابْنَ مَرْيَمَ‏}‏ اتخذوه إلها من دون اللّه، والحال أنهم خالفوا في ذلك أمر اللّه لهم على ألسنة رسله فما ‏{‏أُمِرُوا إِلَّا لِيَعْبُدُوا إِلَهًا وَاحِدًا لَا إِلَهَ إِلَّا هُوَ‏}‏ فيخلصون له العبادة والطاعة، ويخصونه بالمحبة والدعاء، فنبذوا أمر اللّه وأشركوا به ما لم ينزل به سلطانًا‏.‏\n‏{‏سُبْحَانَهُ‏}‏ وتعالى ‏{‏عَمَّا يُشْرِكُونَ‏}‏ أي‏:‏ تنزه وتقدس، وتعالت عظمته عن شركهم وافترائهم، فإنهم ينتقصونه في ذلك، ويصفونه بما لا يليق بجلاله، واللّه تعالى العالي في أوصافه وأفعاله عن كل ما نسب إليه، مما ينافي كماله المقدس‏.‏\n                                    "
      },
      "originalText": "ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ ١٣"
    }
  ]
}