{
  "number": 193,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 1272,
      "text": "إِنَّمَا النَّسِيءُ زِيَادَةٌ فِي الْكُفْرِ ۖ يُضَلُّ بِهِ الَّذِينَ كَفَرُوا يُحِلُّونَهُ عَامًا وَيُحَرِّمُونَهُ عَامًا لِيُوَاطِئُوا عِدَّةَ مَا حَرَّمَ اللَّهُ فَيُحِلُّوا مَا حَرَّمَ اللَّهُ ۚ زُيِّنَ لَهُمْ سُوءُ أَعْمَالِهِمْ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 37,
      "juz": 10,
      "manzil": 2,
      "page": 193,
      "ruku": 160,
      "hizbQuarter": 77,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِ‍ُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ ٧٣\n                                    \n                                    \n                                    هذا مما ذم الله تعالى به المشركين من تصرفهم في شرع الله بآرائهم الفاسدة ، وتغييرهم أحكام الله بأهوائهم الباردة ، وتحليلهم ما حرم الله وتحريمهم ما أحل الله ، فإنهم كان فيهم من القوة الغضبية والشهامة والحمية ما استطالوا به مدة الأشهر الثلاثة في التحريم المانع لهم من قضاء أوطارهم من قتال أعدائهم ، فكانوا قد أحدثوا قبل الإسلام بمدة تحليل المحرم وتأخيره إلى صفر ، فيحلون الشهر الحرام ، ويحرمون الشهر الحلال ، ليواطئوا عدة الأشهر الأربعة كما قال شاعرهم - وهو عمير بن قيس المعروف - بجذل الطعان :\nلقد علمت معد أن قومي كرام الناس أن لهم كراما ألسنا الناسئين على معد\nشهور الحل نجعلها حراما فأي الناس لم ندرك بوتر\nوأي الناس لم نعلك لجاما\nقال علي بن أبي طلحة عن ابن عباس في قوله : ( إنما النسيء زيادة في الكفر ) قال : النسيء أن جنادة بن عوف بن أمية الكناني كان يوافي الموسم في كل عام ، وكان يكنى \" أبا ثمامة \" ، فينادي : ألا إن أبا ثمامة لا يحاب ولا يعاب ، ألا وإن صفر العام الأول حلال . فيحله للناس ، فيحرم صفرا عاما ، ويحرم المحرم عاما ، فذلك قول الله : ( إنما النسيء زيادة في الكفر ) [ إلى قوله : ( الكافرين ) وقوله ( إنما النسيء زيادة في الكفر ) ] يقول : يتركون المحرم عاما ، وعاما يحرمونه .\nوروى العوفي عن ابن عباس نحوه .\nوقال ليث بن أبي سليم ، عن مجاهد ، كان رجل من بني كنانة يأتي كل عام إلى الموسم على حمار له ، فيقول : يا أيها الناس ، إني لا أعاب ولا أحاب ، ولا مرد لما أقول ، إنا قد حرمنا المحرم ، وأخرنا صفرا . ثم يجيء العام المقبل بعده فيقول مثل مقالته ، ويقول : إنا قد حرمنا صفرا ، وأخرنا المحرم . فهو قوله : ( ليواطئوا عدة ما حرم الله ) قال : يعني الأربعة ( فيحلوا ما حرم الله ) لتأخير هذا الشهر الحرام .\nوروي عن أبي وائل ، والضحاك ، وقتادة نحو هذا .\nوقال عبد الرحمن بن زيد بن أسلم في قوله : ( إنما النسيء زيادة في الكفر ) الآية ، قال : هذا رجل من بني كنانة يقال له : \" القلمس \" ، وكان في الجاهلية ، وكانوا في الجاهلية لا يغير بعضهم على بعض في الشهر الحرام ، يلقى الرجل قاتل أبيه ولا يمد إليه يده ، فلما كان هو قال : اخرجوا بنا ، قالوا له : هذا المحرم ! قال : ننسئه العام ، هما العام صفران ، فإذا كان العام القابل قضينا جعلناهما محرمين . قال : ففعل ذلك ، فلما كان عام قابل قال : لا تغزوا في صفر ، حرموه مع المحرم ، هما محرمان .\nفهذه صفة غريبة في النسيء ، وفيها نظر ؛ لأنهم في عام إنما يحرمون على هذا ثلاثة أشهر فقط ، وفي العام الذي يليه يحرمون خمسة أشهر ، فأين هذا من قوله تعالى : ( يحلونه عاما ويحرمونه عاما ليواطئوا عدة ما حرم الله ) .\nوقد روي عن مجاهد صفة أخرى غريبة أيضا ، فقال عبد الرزاق ، أخبرنا معمر ، عن ابن أبي نجيح ، عن مجاهد في قوله : ( إنما النسيء زيادة في الكفر ) الآية ، قال : فرض الله - عز وجل - الحج في ذي الحجة . قال : وكان المشركون يسمون الأشهر ذا الحجة ، والمحرم ، وصفرا ، وربيع ، وربيع ، وجمادى ، وجمادى ، ورجبا ، وشعبان ، ورمضان ، وشوالا وذا القعدة . وذا الحجة يحجون فيه مرة أخرى ثم يسكتون عن المحرم ولا يذكرونه ، ثم يعودون فيسمون صفرا صفرا ، ثم يسمون رجبا جمادى الآخرة ، ثم يسمون شعبان رمضان ، ثم يسمون شوالا رمضان ، ثم يسمون ذا القعدة شوالا ثم يسمون ذا الحجة ذا القعدة ، ثم يسمون المحرم ذا الحجة ، فيحجون فيه ، واسمه عندهم ذو الحجة ، ثم عادوا بمثل هذه القصة فكانوا يحجون في كل شهر عامين ، حتى وافق حجة أبي بكر الآخر من العامين في القعدة ثم حج النبي - صلى الله عليه وسلم - حجته التي حج ، فوافق ذا الحجة ، فذلك حين يقول النبي - صلى الله عليه وسلم - في خطبته : إن الزمان قد استدار كهيئته يوم خلق الله السماوات والأرض .\nوهذا الذي قاله مجاهد فيه نظر أيضا ، وكيف تصح حجة أبي بكر وقد وقعت في ذي القعدة ، وأنى هذا ؟ وقد قال الله تعالى : ( وأذان من الله ورسوله إلى الناس يوم الحج الأكبر أن الله بريء من المشركين ورسوله ) الآية [ التوبة : 3 ] ، وإنما نودي بذلك في حجة أبي بكر ، فلو لم تكن في ذي الحجة لما قال تعالى : ( يوم الحج الأكبر ) ولا يلزم من فعلهم النسيء هذا الذي ذكره - من دوران السنة عليهم وحجهم في كل شهر عامين - فإن النسيء حاصل بدون هذا ، فإنهم لما كانوا يحلون شهر المحرم عاما يحرمون عوضه صفر ، وبعده ربيع وربيع إلى آخر [ السنة والسنة بحالها على نظامها وعدتها وأسماء شهورها ثم في العام القابل يحرمون المحرم ويتركونه على تحريمه ، وبعده صفر ، وربيع وربيع إلى آخرها ] فيحلونه عاما ويحرمونه عاما ؛ ليواطئوا عدة ما حرم الله ، فيحلوا ما حرم الله ، أي : في تحريم أربعة أشهر من السنة ، إلا أنهم تارة يقدمون تحريم الشهر الثالث من الثلاثة المتوالية وهو المحرم ، وتارة ينسئونه إلى صفر ، أي : يؤخرونه . وقد قدمنا الكلام على قوله - صلى الله عليه وسلم - : إن الزمان قد استدار كهيئته يوم خلق الله السماوات والأرض ، السنة اثنا عشر شهرا منها أربعة حرم ، ثلاثة متوالية : ذو القعدة ، وذو الحجة ، والمحرم ، ورجب مضر ، أي أن الأمر في عدة الشهور وتحريم ما هو محرم منها ، على ما سبق في كتاب الله من العدد والتوالي ، لا كما يعتمده جهلة العرب ، من فصلهم تحريم بعضها بالنسيء عن بعض ، والله أعلم .\nوقال ابن أبي حاتم : حدثنا صالح بن بشر بن سلمة الطبراني ، حدثنا مكي بن إبراهيم ، حدثنا موسى بن عبيدة ، عن عبد الله بن دينار ، عن ابن عمر أنه قال : وقف رسول الله - صلى الله عليه وسلم - بالعقبة ، فاجتمع إليه من شاء الله من المسلمين ، فحمد الله وأثنى عليه بما هو له أهل ثم قال : \" وإنما النسيء من الشيطان ، زيادة في الكفر ، يضل به الذين كفروا ، يحلونه عاما ويحرمونه عاما \" . فكانوا يحرمون المحرم عاما ، ويستحلون صفرا ويستحلون المحرم ، وهو النسيء .\nوقد تكلم الإمام محمد بن إسحاق على هذا في كتاب \" السيرة \" كلاما جيدا ومفيدا حسنا ، فقال : كان أول من نسأ الشهور على العرب ، فأحل منها ما حرم الله ، وحرم منها ما أحل الله - عز وجل - \" القلمس \" ، وهو : حذيفة بن عبد مدركة فقيم بن عدي بن عامر بن ثعلبة بن الحارث بن مالك بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر بن نزار بن معد بن عدنان ، ثم قام بعده على ذلك ابنه عباد ثم من بعد عباد ابنه قلع بن عباد ، ثم ابنه أمية بن قلع ، ثم ابنه عوف بن أمية ، ثم ابنه أبو ثمامة جنادة بن عوف ، وكان آخرهم ، وعليه قام الإسلام . فكانت العرب إذا فرغت من حجها اجتمعت إليه ، فقام فيهم خطيبا ، فحرم رجبا ، وذا القعدة ، وذا الحجة ، ويحل المحرم عاما ، ويجعل مكانه صفرا ، ويحرمه عاما ليواطئ عدة ما حرم الله ، فيحل ما حرم الله ، يعني : ويحرم ما أحل الله .\n                                    ",
        "qortoby": "إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِ‍ُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ ٧٣\n                                    \n                                    \n                                    قوله تعالى إنما النسيء زيادة في الكفر يضل به الذين كفروا يحلونه عاما ويحرمونه عاما ليواطئوا عدة ما حرم الله فيحلوا ما حرم الله زين لهم سوء أعمالهم والله لا يهدي القوم الكافرين\nقوله تعالى إنما النسيء زيادة في الكفر هكذا يقرأ أكثر الأئمة . قال النحاس : ولم يرو أحد عن نافع فيما علمناه \" إنما النسي \" بلا همز إلا ورش وحده . وهو مشتق من نسأه وأنسأه إذا أخره ، حكى اللغتين الكسائي . الجوهري : \" النسيء \" : فعيل بمعنى مفعول ، من قولك : نسأت الشيء فهو منسوء إذا أخرته . ثم يحول منسوء إلى نسيء كما يحول مقتول إلى قتيل . ورجل ناسئ وقوم نسأة ، مثل فاسق وفسقة . قال الطبري : النسيء بالهمزة معناه الزيادة نسأ ينسأ إذا زاد . قال : ولا يكون بترك الهمز إلا من النسيان ، كما قال تعالى : نسوا الله فنسيهم ، ورد على نافع قراءته ، واحتج بأن قال : إنه يتعدى بحرف الجر يقال : نسأ الله في أجلك كما تقول زاد الله في أجلك ، ومنه قوله عليه الصلاة والسلام : من سره أن يبسط له في رزقه وينسأ له في أثره فليصل رحمه . قال الأزهري : أنسأت الشيء إنساء ، ونسيئا اسم وضع موضع المصدر الحقيقي . وكانوا يحرمون القتال في المحرم فإذا احتاجوا إلى ذلك حرموا صفرا بدله وقاتلوا في المحرم . وسبب ذلك أن العرب كانت أصحاب حروب وغارات فكان يشق عليهم أن يمكثوا ثلاثة أشهر متوالية لا يغيرون فيها ، وقالوا : لئن توالت علينا ثلاثة أشهر لا نصيب فيها شيئا لنهلكن . فكانوا إذا صدروا عن منى يقوم من بني كنانة ، ثم من بني فقيم منهم رجل يقال له القلمس ، فيقول أنا الذي لا يرد لي قضاء . فيقولون : أنسئنا شهرا ، أي أخر عنا حرمة المحرم واجعلها في صفر ، فيحل لهم المحرم . فكانوا كذلك شهرا فشهرا حتى استدار التحريم على السنة كلها . فقام الإسلام وقد رجع المحرم إلى موضعه الذي وضعه الله فيه . وهذا معنى قوله عليه السلام : إن الزمان قد استدار كهيئته يوم خلق الله السماوات والأرض . وقال مجاهد : كان المشركون يحجون في كل شهر عامين ، فحجوا في ذي الحجة عامين ، ثم حجوا في المحرم عامين ، ثم حجوا في صفر عامين ، وكذلك في الشهور كلها حتى وافقت حجة أبي بكر التي حجها قبل حجة الوداع ذا القعدة من السنة التاسعة . ثم حج النبي صلى الله عليه وسلم في العام المقبل حجة الوداع فوافقت ذا الحجة ، فذلك قوله في خطبته : إن الزمان قد استدار . . . الحديث . أراد بذلك أن أشهر الحج رجعت إلى مواضعها ، وعاد الحج إلى ذي الحجة وبطل النسيء . وقول ثالث . قال إياس بن معاوية : كان المشركون يحسبون السنة اثني عشر شهرا وخمسة عشر يوما ، فكان الحج يكون في رمضان وفي ذي القعدة ، وفي كل شهر من السنة بحكم استدارة الشهر بزيادة الخمسة عشر يوما فحج أبو بكر سنة تسع في ذي القعدة بحكم الاستدارة ، ولم يحج النبي صلى الله عليه وسلم فلما كان في العام المقبل وافق الحج ذا الحجة في العشر ، ووافق ذلك الأهلة . وهذا القول أشبه بقول النبي صلى الله عليه وسلم : إن الزمان قد استدار . . . أي زمان الحج عاد إلى وقته الأصلي الذي عينه الله يوم خلق السماوات والأرض بأصل المشروعية التي سبق بها علمه ، ونفذ بها حكمه . ثم قال : السنة اثنا عشر شهرا . ينفي بذلك الزيادة التي زادوها في السنة - وهي الخمسة عشر يوما - بتحكمهم ، فتعين الوقت الأصلي وبطل التحكم الجهلي . وحكى الإمام المازري عن الخوارزمي أنه قال : أول ما خلق الله الشمس أجراها في برج الحمل ، وكان الزمان الذي أشار به النبي صلى الله عليه وسلم صادف حلول الشمس برج الحمل . وهذا يحتاج إلى توقيف ، فإنه لا يتوصل إليه إلا بالنقل عن الأنبياء ، ولا نقل صحيحا عنهم بذلك ، ومن ادعاه فليسنده . ثم إن العقل يجوز خلاف ما قال ، وهو أن يخلق الله الشمس قبل البروج ، ويجوز أن يخلق ذلك كله دفعة واحدة . ثم إن علماء التعديل قد اختبروا ذلك فوجدوا الشمس في برج الحوت وقت قوله عليه السلام : إن الزمان قد استدار . . . بينها وبين الحمل عشرون درجة . ومنهم من قال عشر درجات . والله أعلم . واختلف أهل التأويل في أول من نسأ ، فقال ابن عباس وقتادة والضحاك : بنو مالك بن كنانة ، وكانوا ثلاثة . وروى جويبر عن الضحاك عن ابن عباس أن أول من فعل ذلك عمرو بن لحي بن قمعة بن خندف . وقال الكلبي : أول من فعل ذلك رجل من بني كنانة يقال له نعيم بن ثعلبة ، ثم كان بعده رجل يقال له : جنادة بن عوف ، وهو الذي أدركه رسول الله صلى الله عليه وسلم . وقال الزهري : حي من بني كنانة ثم من بني فقيم منهم رجل يقال له القلمس واسمه حذيفة بن عبيد . وفي رواية : مالك بن كنانة . وكان الذي يلي النسيء يظفر بالرياسة لتريس العرب إياه . وفي ذلك يقول شاعرهم :\nومنا ناسئ الشهر القلمس\nوقال الكميت :\nألسنا الناسئين على معد شهور الحل نجعلها حراما\nقوله تعالى زيادة في الكفر بيان لما فعلته العرب من جمعها من أنواع الكفر فإنها أنكرت وجود البارئ تعالى فقالت : وما الرحمن في أصح الوجوه . وأنكرت البعث فقالت : من يحيي العظام وهي رميم . وأنكرت بعثة الرسل فقالوا : أبشرا منا واحدا نتبعه . وزعمت أن التحليل والتحريم إليها ، فابتدعته من ذاتها مقتفية لشهواتها فأحلت ما حرم الله . ولا مبدل لكلماته ولو كره المشركون .\nقوله تعالى يضل به الذين كفروا يحلونه عاما ويحرمونه عاما ليواطئوا عدة ما حرم الله فيحلوا ما حرم الله زين لهم سوء أعمالهم والله لا يهدي القوم الكافرين فيه ثلاث قراءات . قرأ أهل الحرمين وأبو عمرو \" يضل \" وقرأ الكوفيون \" يضل \" على الفعل المجهول . وقرأ الحسن وأبو رجاء \" يضل \" والقراءات الثلاث كل واحدة منها تؤدي عن معنى ، إلا أن القراءة الثالثة حذف منها المفعول . والتقدير : ويضل به الذين كفروا من يقبل منهم .\nو ( الذين ) في محل رفع . ويجوز أن يكون الضمير راجعا إلى الله عز وجل . التقدير : يضل الله به الذين كفروا ، كقوله تعالى : يضل من يشاء ، وكقوله في آخر الآية : والله لا يهدي القوم الكافرين . والقراءة الثانية : ( يضل به الذين كفروا ) يعني المحسوب لهم ، واختار هذه القراءة أبو عبيد ، لقوله تعالى : زين لهم سوء أعمالهم والقراءة الأولى اختارها أبو حاتم ; لأنهم كانوا ضالين به أي بالنسيء لأنهم كانوا يحسبونه فيضلون به . والهاء في \" يحلونه \" ترجع إلى النسيء . وروي عن أبي رجاء \" يضل \" بفتح الياء والضاد . وهي لغة ، يقال : ضللت أضل ، وضللت أضل .\n( ليواطئوا ) نصب بلام كي أي ليوافقوا . تواطأ القوم على كذا : أي اجتمعوا عليه ، أي لم يحلوا شهرا إلا حرموا شهرا لتبقى الأشهر الحرم أربعة . وهذا هو الصحيح ، لا ما يذكر أنهم جعلوا الأشهر خمسة . قال قتادة : إنهم عمدوا إلى صفر فزادوه في الأشهر الحرم ، وقرنوه بالمحرم في التحريم ، وقاله عنه قطرب والطبري . وعليه يكون النسيء بمعنى الزيادة . والله أعلم .\n                                    ",
        "saadi": "إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِ‍ُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ ٧٣\n                                        \n                                        \n                                        \n                                        النسيء‏:‏ هو ما كان أهل الجاهلية يستعملونه في الأشهر الحرم، وكان من جملة بدعهم الباطلة، أنهم لما رأوا احتياجهم للقتال، في بعض أوقات الأشهر الحرم، رأوا ـ بآرائهم الفاسدة ـ أن يحافظوا على عدة الأشهر الحرم، التي حرم اللّه القتال فيها، وأن يؤخروا بعض الأشهر الحرم، أو يقدموه، ويجعلوا مكانه من أشهر الحل ما أرادوا، فإذا جعلوه مكانه أحلوا القتال فيه، وجعلوا الشهر الحلال حرامًا، فهذا ـ كما أخبر اللّه عنهم ـ أنه زيادة في كفرهم وضلالهم، لما فيه من المحاذير‏.‏\nمنها‏:‏ أنهم ابتدعوه من تلقاء أنفسهم، وجعلوه بمنزلة شرع اللّه ودينه، واللّه ورسوله بريئان منه‏.‏\nومنها‏:‏ أنهم قلبوا الدين، فجعلوا الحلال حراما، والحرام حلالا‏.‏\nومنها‏:‏ أنهم مَوَّهوا على اللّه بزعمهم وعلى عباده، ولبسوا عليهم دينهم، واستعملوا الخداع والحيلة في دين اللّه‏.‏\nومنها‏:‏ أن العوائد المخالفة للشرع مع الاستمرار عليها، يزول قبحها عن النفوس، وربما ظن أنها عوائد حسنة، فحصل من الغلط والضلال ما حصل، ولهذا قال‏:‏ ‏{‏يُضَلُّ بِهِ الَّذِينَ كَفَرُوا يُحِلُّونَهُ عَامًا وَيُحَرِّمُونَهُ عَامًا لِيُوَاطِئُوا عِدَّةَ مَا حَرَّمَ اللَّهُ‏}‏ أي‏:‏ ليوافقوها في العدد، فيحلوا ما حرم اللّه‏.‏\n‏{‏زُيِّنَ لَهُمْ سُوءُ أَعْمَالِهِمْ‏}‏ أي‏:‏ زينت لهم الشياطين الأعمال السيئة، فرأوها حسنة، بسبب العقيدة المزينة في قلوبهم‏.‏\n‏{‏وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ‏}‏ أي‏:‏ الذين انصبغ الكفر والتكذيب في قلوبهم، فلو جاءتهم كل آية، لم يؤمنوا‏.‏\n                                    "
      },
      "originalText": "إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِ‍ُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ ٧٣"
    },
    {
      "number": 1273,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا مَا لَكُمْ إِذَا قِيلَ لَكُمُ انْفِرُوا فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الْأَرْضِ ۚ أَرَضِيتُمْ بِالْحَيَاةِ الدُّنْيَا مِنَ الْآخِرَةِ ۚ فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا فِي الْآخِرَةِ إِلَّا قَلِيلٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 38,
      "juz": 10,
      "manzil": 2,
      "page": 193,
      "ruku": 161,
      "hizbQuarter": 77,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ ٨٣\n                                    \n                                    \n                                    هذا شروع في عتاب من تخلف عن رسول الله - صلى الله عليه وسلم - في غزوة تبوك ، حين طابت الثمار والظلال في شدة الحر وحمارة القيظ ، فقال تعالى : ( يا أيها الذين آمنوا ما لكم إذا قيل لكم انفروا في سبيل الله ) أي : إذا دعيتم إلى الجهاد في سبيل الله ( اثاقلتم إلى الأرض ) أي : تكاسلتم وملتم إلى المقام في الدعة والخفض وطيب الثمار ، ( أرضيتم بالحياة الدنيا من الآخرة ) أي : ما لكم فعلتم هكذا ؟ أرضا منكم بالدنيا بدلا من الآخرة .\nثم زهد تبارك وتعالى في الدنيا ، ورغب في الآخرة ، فقال : ( فما متاع الحياة الدنيا في الآخرة إلا قليل ) كما قال الإمام أحمد .\nحدثنا وكيع ويحيى بن سعيد قالا حدثنا إسماعيل بن أبي خالد ، عن قيس ، عن المستورد أخي بني فهر قال : قال رسول الله - صلى الله عليه وسلم - : ما الدنيا في الآخرة إلا كما يجعل إصبعه هذه في اليم ، فلينظر بم ترجع ؟ وأشار بالسبابة .\nانفرد بإخراجه مسلم .\nوقال ابن أبي حاتم : حدثنا بشر بن مسلم بن عبد الحميد الحمصي ، حدثنا الربيع بن روح ، حدثنا محمد بن خالد الوهبي ، حدثنا زياد - يعني الجصاص - عن أبي عثمان قال : قلت : يا أبا هريرة ، سمعت من إخواني بالبصرة أنك تقول : سمعت نبي الله يقول : إن الله يجزي بالحسنة ألف ألف حسنة ، قال أبو هريرة : بل سمعت رسول الله - صلى الله عليه وسلم - يقول : إن الله يجزي بالحسنة ألفي ألف حسنة ، ثم تلا هذه الآية : ( فما متاع الحياة الدنيا في الآخرة إلا قليل )\nفالدنيا ما مضى منها وما بقي منها عند الله قليل .\nوقال [ سفيان ] الثوري ، عن الأعمش في الآية : ( فما متاع الحياة الدنيا في الآخرة إلا قليل ) قال : كزاد الراكب .\nوقال عبد العزيز بن أبي حازم عن أبيه : لما حضرت عبد العزيز بن مروان الوفاة قال : ائتوني بكفني الذي أكفن فيه أنظر إليه ، فلما وضع بين يديه نظر إليه فقال : أما لي من كبير ما أخلف من الدنيا إلا هذا ؟ ثم ولى ظهره فبكى وهو يقول أف لك من دار ، إن كان كثيرك لقليل ، وإن كان قليلك لقصير ، وإن كنا منك لفي غرور .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ ٨٣\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا ما لكم إذا قيل لكم انفروا في سبيل الله اثاقلتم إلى الأرض أرضيتم بالحياة الدنيا من الآخرة فما متاع الحياة الدنيا في الآخرة إلا قليل\nفيه مسألتان :\nالأولى : قوله تعالى ما لكم \" ما \" حرف استفهام معناه التقرير والتوبيخ . التقدير : أي شيء يمنعكم عن كذا كما تقول : ما لك عن فلان معرضا . ولا خلاف أن هذه الآية نزلت عتابا على تخلف من تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك ، وكانت سنة تسع من الهجرة بعد الفتح بعام ، وسيأتي ذكرها في آخر السورة إن شاء الله . والنفر : هو التنقل بسرعة من مكان إلى مكان لأمر يحدث ، يقال في ابن آدم : نفر إلى الأمر ينفر نفورا . وقوم نفور ، ومنه قوله تعالى : ولوا على أدبارهم نفورا . ويقال في الدابة : نفرت تنفر - بضم الفاء وكسرها - نفارا ونفورا . يقال : في الدابة نفار ، وهو اسم مثل الحران . ونفر الحاج من منى نفرا .\nالثانية : قوله تعالى اثاقلتم إلى قال المفسرون : معناه اثاقلتم إلى نعيم الأرض ، أو إلى الإقامة بالأرض . وهو توبيخ على ترك الجهاد وعتاب على التقاعد عن المبادرة إلى الخروج ، وهو نحو من أخلد إلى الأرض . وأصله تثاقلتم ، أدغمت التاء في الثاء لقربها منها ، واحتاجت إلى ألف الوصل لتصل إلى النطق بالساكن ، ومثله اداركوا ، وادارأتم ، واطيرنا ، وازينت . وأنشد الكسائي :\nتولي الضجيع إذا ما استافها خصرا عذب المذاق إذا ما اتابع القبل\nوقرأ الأعمش \" تثاقلتم \" على الأصل . حكاه المهدوي .\nوكانت تبوك - ودعا الناس إليها - في حرارة القيظ وطيب الثمار وبرد الظلال - كما جاء في الحديث الصحيح على ما يأتي - فاستولى على الناس الكسل فتقاعدوا وتثاقلوا فوبخهم الله بقوله هذا وعاب عليهم الإيثار للدنيا على الآخرة .\nومعنى أرضيتم بالحياة الدنيا من الآخرة أي بدلا ، التقدير : أرضيتم بنعيم الدنيا بدلا من نعيم الآخرة ف ( من ) تتضمن معنى البدل ، كقوله تعالى : ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون أي بدلا منكم .\nوقال الشاعر :\nفليت لنا من ماء زمزم شربة مبردة باتت على طهيان\nويروى من ماء حمنان . أراد : ليت لنا بدلا من ماء زمزم شربة مبردة . والطهيان : عود ينصب في ناحية الدار للهواء ، يعلق عليه الماء حتى يبرد . عاتبهم الله على إيثار الراحة في الدنيا على الراحة في الآخرة ، إذ لا تنال راحة الآخرة إلا بنصب الدنيا . قال صلى الله عليه وسلم لعائشة وقد طافت راكبة : أجرك على قدر نصبك . خرجه البخاري .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ ٨٣\n                                        \n                                        \n                                        \n                                        اعلم أن كثيرا من هذه السورة الكريمة، نزلت في غزوة تبوك، إذ ندب النبي ـ صلى الله عليه وسلم ـ المسلمين إلى غزو الروم، وكان الوقت حارًا، والزاد قليلا، والمعيشة عسرة، فحصل من بعض المسلمين من التثاقل ما أوجب أن يعاتبهم اللّه تعالى عليه ويستنهضهم، فقال تعالى‏:‏\n‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا‏}‏ ألا تعملون بمقتضى الإيمان، وداعي اليقين من المبادرة لأمر اللّه، والمسارعة إلى رضاه، وجهاد أعدائه والنصرة لدينكم، فـ ‏{‏مَا لَكُمْ إِذَا قِيلَ لَكُمُ انْفِرُوا فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الْأَرْضِ‏}‏ أي‏:‏ تكاسلتم، وملتم إلى الأرض والدعة والسكون فيها‏.‏\n‏{‏أَرَضِيتُمْ بِالْحَيَاةِ الدُّنْيَا مِنَ الْآخِرَةِ‏}‏ أي‏:‏ ما حالكم إلا حال من رضي بالدنيا وسعى لها ولم يبال بالآخرة، فكأنه ما آمن بها‏.‏\n‏{‏فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا‏}‏ التي مالت بكم، وقدمتموها على الآخرة ‏{‏إِلَّا قَلِيلٌ‏}‏ أفليس قد جعل اللّه لكم عقولا تَزِنُون بها الأمور، وأيها أحق بالإيثار‏؟‏‏.‏\nأفليست الدنيا ـ من أولها إلى آخرها ـ لا نسبة لها في الآخرة‏.‏ فما مقدار عمر الإنسان القصير جدا من الدنيا حتى يجعله الغاية التي لا غاية وراءها، فيجعل سعيه وكده وهمه وإرادته لا يتعدى حياته الدنيا القصيرة المملوءة بالأكدار، المشحونة بالأخطار‏.‏\nفبأي رَأْيٍ رأيتم إيثارها على الدار الآخرة الجامعة لكل نعيم، التي فيها ما تشتهيه الأنفس وتلذ الأعين، وأنتم فيها خالدون، فواللّه ما آثر الدنيا على الآخرة من وقر الإيمان في قلبه، ولا من جزل رأيه، ولا من عُدَّ من أولي الألباب،\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ ٨٣"
    },
    {
      "number": 1274,
      "text": "إِلَّا تَنْفِرُوا يُعَذِّبْكُمْ عَذَابًا أَلِيمًا وَيَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ وَلَا تَضُرُّوهُ شَيْئًا ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 39,
      "juz": 10,
      "manzil": 2,
      "page": 193,
      "ruku": 161,
      "hizbQuarter": 77,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّا تَنفِرُواْ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا وَيَسۡتَبۡدِلۡ قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّوهُ شَيۡ‍ٔٗاۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٣\n                                    \n                                    \n                                    ثم توعد تعالى على ترك الجهاد فقال : ( إلا تنفروا يعذبكم عذابا أليما ) قال ابن عباس : استنفر رسول الله - صلى الله عليه وسلم - حيا من العرب ، فتثاقلوا عنه ، فأمسك الله عنهم القطر فكان عذابهم .\n( ويستبدل قوما غيركم ) أي : لنصرة نبيه وإقامة دينه ، كما قال تعالى : ( إن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم ) [ محمد : 38 ] .\n( ولا تضروه شيئا ) أي : ولا تضروا الله شيئا بتوليكم عن الجهاد ، ونكولكم وتثاقلكم عنه ، ( والله على كل شيء قدير ) أي : قادر على الانتصار من الأعداء بدونكم .\nوقد قيل : إن هذه الآية ، وقوله : ( انفروا خفافا وثقالا ) وقوله ( ما كان لأهل المدينة ومن حولهم من الأعراب أن يتخلفوا عن رسول الله ) [ التوبة : 120 ] إنهن منسوخات بقوله تعالى : ( وما كان المؤمنون لينفروا كافة فلولا نفر من كل فرقة منهم طائفة ) [ التوبة : 122 ] روي هذا عن ابن عباس ، وعكرمة ، والحسن ، وزيد بن أسلم . ورده ابن جرير وقال : إنما هذا فيمن دعاهم رسول الله - صلى الله عليه وسلم - إلى الجهاد ، فتعين عليهم ذلك ، فلو تركوه لعوقبوا عليه .\nوهذا له اتجاه ، والله [ سبحانه و ] تعالى أعلم [ بالصواب ] .\n                                    ",
        "qortoby": "إِلَّا تَنفِرُواْ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا وَيَسۡتَبۡدِلۡ قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّوهُ شَيۡ‍ٔٗاۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٣\n                                    \n                                    \n                                    قوله تعالى إلا تنفروا يعذبكم عذابا أليما ويستبدل قوما غيركم ولا تضروه شيئا والله على كل شيء قدير\nفيه مسألة واحدة : وهو أن قوله تعالى إلا تنفروا شرط ، فلذلك حذفت منه النون . والجواب ( يعذبكم ) ، ( ويستبدل قوما غيركم ) وهذا تهديد شديد ووعيد مؤكد في ترك النفير . قال ابن العربي : ومن محققات الأصول أن الأمر إذا ورد فليس في وروده أكثر من اقتضاء الفعل . فأما العقاب عند الترك فلا يؤخذ من نفس الأمر ولا يقتضيه الاقتضاء ، وإنما يكون العقاب بالخبر عنه ، كقوله : إن لم تفعل كذا عذبتك بكذا ، كما ورد في هذه الآية . فوجب بمقتضاها النفير للجهاد والخروج إلى الكفار لمقاتلتهم على أن تكون كلمة الله هي العليا . روى أبو داود عن ابن عباس قال : إلا تنفروا يعذبكم عذابا أليما و ما كان لأهل المدينة - إلى قوله - \" يعملون \" نسختها الآية التي تليها : وما كان المؤمنون لينفروا كافة . وهو قول الضحاك والحسن وعكرمة . \" يعذبكم \" قال ابن عباس : هو حبس المطر عنهم . قال ابن العربي : فإن صح ذلك عنه فهو أعلم من أين قاله ، وإلا فالعذاب الأليم هو في الدنيا باستيلاء العدو وبالنار في الآخرة .\nقلت : قول ابن عباس خرجه الإمام أبو داود في سننه عن ابن نفيع قال : سألت ابن عباس عن هذه الآية إلا تنفروا يعذبكم عذابا أليما قال : فأمسك عنهم المطر فكان عذابهم . وذكره الإمام أبو محمد بن عطية مرفوعا عن ابن عباس قال : استنفر رسول الله صلى الله عليه وسلم قبيلة من القبائل فقعدت ، فأمسك الله عنهم المطر وعذبها به .\nو ( أليما ) بمعنى مؤلم ، أي موجع . وقد تقدم .\nويستبدل قوما غيركم توعد بأن يبدل لرسوله قوما لا يقعدون عند استنفاره إياهم . قيل : أبناء فارس . وقيل : أهل اليمن .\nولا تضروه شيئا والله على كل شيء قدير عطف . والهاء قيل لله تعالى ، وقيل للنبي صلى الله عليه وسلم . والتثاقل عن الجهاد مع إظهار الكراهة حرام على كل أحد . فأما من غير كراهة فمن عينه النبي صلى الله عليه وسلم حرم عليه التثاقل وإن أمن منهما فالفرض فرض كفاية ، ذكره القشيري . وقد قيل : إن المراد بهذه الآية وجوب النفير عند الحاجة وظهور الكفرة واشتداد شوكتهم . وظاهر الآية يدل على أن ذلك على وجه الاستدعاء فعلى هذا لا يتجه الحمل على وقت ظهور المشركين فإن وجوب ذلك لا يختص بالاستدعاء ؛ لأنه متعين . وإذا ثبت ذلك فالاستدعاء والاستنفار يبعد أن يكون موجبا شيئا لم يجب من قبل إلا أن الإمام إذا عين قوما وندبهم إلى الجهاد لم يكن لهم أن يتثاقلوا عند التعيين ويصير بتعيينه فرضا على من عينه لا لمكان الجهاد ولكن لطاعة الإمام . والله أعلم .\n                                    ",
        "saadi": "إِلَّا تَنفِرُواْ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا وَيَسۡتَبۡدِلۡ قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّوهُ شَيۡ‍ٔٗاۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٣\n                                        \n                                        \n                                        \n                                        ‏{‏إِلَّا تَنْفِرُوا يُعَذِّبْكُمْ عَذَابًا أَلِيمًا‏}‏ في الدنيا والآخرة، فإن عدم النفير في حال الاستنفار من كبائر الذنوب الموجبة لأشد العقاب، لما فيها من المضار الشديدة، فإن المتخلف، قد عصى اللّه تعالى وارتكب لنهيه، ولم يساعد على نصر دين اللّه، ولا ذب عن كتاب اللّه وشرعه، ولا أعان إخوانه المسلمين على عدوهم الذي يريد أن يستأصلهم ويمحق دينهم، وربما اقتدى به غيره من ضعفاء الإيمان، بل ربما فَتَّ في أعضاد من قاموا بجهاد أعداء اللّه، فحقيق بمن هذا حاله أن يتوعده اللّه بالوعيد الشديد، فقال‏:‏ ‏{‏إِلَّا تَنْفِرُوا يُعَذِّبْكُمْ عَذَابًا أَلِيمًا وَيَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ‏}‏ ثم لا يكونوا أمثالكم ‏{‏وَلَا تَضُرُّوهُ شَيْئًا‏}‏ فإنه تعالى متكفل بنصر دينه وإعلاء كلمته، فسواء امتثلتم لأمر اللّه، أو ألقيتموه، وراءكم ظهريا‏.‏\n‏{‏وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ‏}‏ لا يعجزه شيء أراده، ولا يغالبه أحد‏.‏\n                                    "
      },
      "originalText": "إِلَّا تَنفِرُواْ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا وَيَسۡتَبۡدِلۡ قَوۡمًا غَيۡرَكُمۡ وَلَا تَضُرُّوهُ شَيۡ‍ٔٗاۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٣"
    },
    {
      "number": 1275,
      "text": "إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 40,
      "juz": 10,
      "manzil": 2,
      "page": 193,
      "ruku": 161,
      "hizbQuarter": 77,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَٰحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ ٠٤\n                                    \n                                    \n                                    يقول تعالى : ( إلا تنصروه ) أي : تنصروا رسوله ، فإن الله ناصره ومؤيده وكافيه وحافظه ، كما تولى نصره ( إذ أخرجه الذين كفروا ثاني اثنين ) [ إذ هما في الغار ] ) أي : عام الهجرة ، لما هم المشركون بقتله أو حبسه أو نفيه ، فخرج منهم هاربا صحبة صديقه وصاحبه أبي بكر بن أبي قحافة ، فلجأ إلى غار ثور ثلاثة أيام ليرجع الطلب الذين خرجوا في آثارهم ، ثم يسيرا نحو المدينة ، فجعل أبو بكر - رضي الله عنه - يجزع أن يطلع عليهم أحد ، فيخلص إلى الرسول - عليه السلام - منهم أذى ، فجعل النبي - صلى الله عليه وسلم - يسكنه ويثبته ويقول : يا أبا بكر ، ما ظنك باثنين الله ثالثهما ، كما قال الإمام أحمد :\nحدثنا عفان ، حدثنا همام ، أنبأنا ثابت ، عن أنس أن أبا بكر حدثه قال : قلت للنبي - صلى الله عليه وسلم - ونحن في الغار : لو أن أحدهم نظر إلى قدميه لأبصرنا تحت قدميه . قال : فقال : يا أبا بكر ، ما ظنك باثنين الله ثالثهما .\nأخرجاه في الصحيحين .\nولهذا قال تعالى : ( فأنزل الله سكينته عليه ) أي : تأييده ونصره عليه ، أي : على الرسول في أشهر القولين : وقيل : على أبي بكر ، وروي عن ابن عباس وغيره ، قالوا : لأن الرسول لم تزل معه سكينة ، وهذا لا ينافي تجدد سكينة خاصة بتلك الحال ؛ ولهذا قال : ( وأيده بجنود لم تروها ) أي الملائكة ، ( وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا )\nقال ابن عباس : يعني ( كلمة الذين كفروا ) الشرك و ( كلمة الله ) هي : لا إله إلا الله .\nوفي الصحيحين عن أبي موسى الأشعري - رضي الله عنه - قال : سئل رسول الله - صلى الله عليه وسلم - عن الرجل يقاتل شجاعة ، ويقاتل حمية ، ويقاتل رياء ، أي ذلك في سبيل الله ؟ فقال : من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله .\nوقوله : ( والله عزيز ) أي : في انتقامه وانتصاره ، منيع الجناب ، لا يضام من لاذ ببابه ، واحتمى بالتمسك بخطابه ، ( حكيم ) في أقواله وأفعاله .\n                                    ",
        "qortoby": "إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَٰحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ ٠٤\n                                    \n                                    \n                                    قوله تعالى إلا تنصروه فقد نصره الله إذ أخرجه الذين كفروا ثاني اثنين إذ هما في الغار إذ يقول لصاحبه لا تحزن إن الله معنا فأنزل الله سكينته عليه وأيده بجنود لم تروها وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا والله عزيز حكيم\nفيه إحدى عشرة مسألة :\nالأولى : قوله تعالى إلا تنصروه يقول : تعينوه بالنفر معه في غزوة تبوك . عاتبهم الله بعد انصراف نبيه عليه السلام من تبوك . قال النقاش : هذه أول آية نزلت من سورة ( براءة ) والمعنى : إن تركتم نصره فالله يتكفل به ، إذ قد نصره الله في مواطن القلة وأظهره على عدوه بالغلبة والعزة . وقيل : فقد نصره الله بصاحبه في الغار بتأنيسه له وحمله على عنقه ، وبوفائه ووقايته له بنفسه ومواساته له بماله . قال الليث بن سعد : ما صحب الأنبياء عليهم السلام مثل أبي بكر الصديق . وقال سفيان بن عيينة . خرج أبو بكر بهذه الآية من المعاتبة التي في قوله : إلا تنصروه\nالثانية : قوله تعالى إذ أخرجه الذين كفروا وهو خرج بنفسه فارا ، لكن بإلجائهم إلى ذلك حتى فعله ، فنسب الفعل إليهم ورتب الحكم فيه عليهم ، فلهذا يقتل المكره على القتل ويضمن المال المتلف بالإكراه ، لإلجائه القاتل والمتلف إلى القتل والإتلاف .\nالثالثة : قوله تعالى ثاني اثنين أي أحد اثنين . وهذا كثالث ثلاثة ورابع أربعة . فإذا اختلف اللفظ فقلت : رابع ثلاثة وخامس أربعة ، فالمعنى صير الثلاثة أربعة بنفسه والأربعة خمسة . وهو منصوب على الحال ، أي أخرجوه منفردا من جميع الناس إلا من أبي بكر . والعامل فيها نصره الله أي نصره منفردا ونصره أحد اثنين . وقال علي بن سليمان : التقدير فخرج ثاني اثنين ، مثل والله أنبتكم من الأرض نباتا . وقرأ جمهور الناس ثاني بنصب الياء . قال أبو حاتم : لا يعرف غير هذا . وقرأت فرقة \" ثاني \" بسكون الياء . قال ابن جني : حكاها أبو عمرو بن العلاء ووجهه أنه سكن الياء تشبيها لها بالألف . قال ابن عطية : فهي كقراءة الحسن ما بقي من الربا وكقول جرير :\nهو الخليفة فارضوا ما رضي لكم ماضي العزيمة ما في حكمه جنف\nالرابعة : قوله تعالى إذ هما في الغار الغار : ثقب في الجبل ، يعني غار ثور . ولما رأت قريش أن المسلمين قد صاروا إلى المدينة قالوا : هذا شر شاغل لا يطاق ، فأجمعوا أمرهم على قتل رسول الله صلى الله عليه وسلم ، فبيتوه ورصدوه على باب منزله طول ليلتهم ليقتلوه إذا خرج ، فأمر النبي صلى الله عليه وسلم علي بن أبي طالب أن ينام على فراشه ، ودعا الله أن يعمي عليهم أثره ، فطمس الله على أبصارهم فخرج وقد غشيهم النوم ، فوضع على رءوسهم ترابا ونهض فلما أصبحوا خرج عليهم علي رضي الله عنه وأخبرهم أن ليس في الدار أحد فعلموا أن رسول الله صلى الله عليه وسلم قد فات ونجا وتواعد رسول الله صلى الله عليه وسلم مع أبي بكر الصديق للهجرة ، فدفعا راحلتيهما إلى عبد الله بن أرقط . ويقال ابن أريقط ، وكان كافرا لكنهما وثقا به ، وكان دليلا بالطرق فاستأجراه ليدل بهما إلى المدينة ، وخرج رسول الله صلى الله عليه وسلم من خوخة في ظهر دار أبي بكر التي في بني جمح ونهضا نحو الغار في جبل ثور ، وأمر أبو بكر ابنه عبد الله أن يستمع ما يقول الناس ، وأمر مولاه عامر بن فهيرة أن يرعى غنمه ويريحها عليهما ليلا فيأخذ منها حاجتهما . ثم نهضا فدخلا الغار . وكانت أسماء بنت أبي بكر الصديق تأتيهما بالطعام ويأتيهما عبد الله بن أبي بكر بالأخبار ، ثم يتلوهما عامر بن فهيرة بالغنم فيعفي آثارهما . فلما فقدته قريش جعلت تطلبه بقائف معروف بقفاء الأثر ، حتى وقف على الغار فقال : هنا انقطع الأثر . فنظروا فإذا بالعنكبوت قد نسج على فم الغار من ساعته ، ولهذا نهى النبي صلى الله عليه وسلم عن قتله ، فلما رأوا نسج العنكبوت أيقنوا أن لا أحد فيه فرجعوا وجعلوا في النبي صلى الله عليه وسلم مائة ناقة لمن رده عليهم ، الخبر مشهور ، وقصة سراقة بن مالك بن جعشم في ذلك مذكورة . وقد روي من حديث أبي الدرداء وثوبان رضي الله عنهما : أن الله عز وجل أمر حمامة فباضت على نسج العنكبوت ، وجعلت ترقد على بيضها ، فلما نظر الكفار إليها ردهم ذلك عن الغار .\nالخامسة : روى البخاري عن عائشة قالت : استأجر رسول الله صلى الله عليه وسلم وأبو بكر رجلا من بني الديل هاديا خريتا وهو على دين كفار قريش فدفعا إليه راحلتيهما وواعداه غار ثور بعد ثلاث ليال فأتاهما براحلتيهما صبيحة ثلاث فارتحلا وارتحل معهما عامر بن فهيرة والدليل الديلي فأخذ بهم طريق الساحل .\n‌‌‌‌ قال المهلب : فيه من الفقه ائتمان أهل الشرك على السر والمال إذا علم منهم وفاء ومروءة كما ائتمن النبي صلى الله عليه وسلم هذا المشرك على سره في الخروج من مكة وعلى الناقتين . وقال ابن المنذر : فيه استئجار المسلمين الكفار على هداية الطريق . وقال البخاري في ترجمته : [ باب استئجار المشركين عند الضرورة أو إذا لم يوجد أهل الإسلام ] قال ابن بطال : إنما قال البخاري في ترجمته [ أو إذا لم يوجد أهل الإسلام ] من أجل أن النبي صلى الله عليه وسلم إنما عامل أهل خيبر على العمل في أرضها إذ لم يوجد من المسلمين من ينوب منابهم في عمل الأرض ، حتى قوي الإسلام واستغني عنهم أجلاهم عمر . وعامة الفقهاء يجيزون استئجارهم عند الضرورة وغيرها . وفيه : استئجار الرجلين الرجل الواحد على عمل واحد لهما . وفيه : دليل على جواز الفرار بالدين خوفا من العدو ، والاستخفاء في الغيران وغيرها ألا يلقي الإنسان بيده إلى العدو توكلا على الله واستسلاما له . ولو شاء ربكم لعصمه مع كونه معهم ولكنها سنة الله في الأنبياء وغيرهم ، ولن تجد لسنة الله تبديلا . وهذا أدل دليل على فساد من منع ذلك وقال : من خاف مع الله سواه كان ذلك نقصا في توكله ، ولم يؤمن بالقدر . وهذا كله في معنى الآية ، ولله الحمد والهداية\nالسادسة : قوله تعالى إذ يقول لصاحبه لا تحزن إن الله معنا هذه الآية تضمنت فضائل الصديق رضي الله عنه . روى أصبغ وأبو زيد عن ابن القاسم عن مالك ثاني اثنين إذ هما في الغار إذ يقول لصاحبه لا تحزن إن الله معنا هو الصديق . فحقق الله تعالى قوله له بكلامه ووصف الصحبة في كتابه . قال بعض العلماء : من أنكر أن يكون عمر وعثمان أو أحد من الصحابة صاحب رسول الله صلى الله عليه وسلم فهو كذاب مبتدع . ومن أنكر أن يكون أبو بكر رضي الله عنه صاحب رسول الله صلى الله عليه وسلم فهو كافر ؛ لأنه رد نص القرآن . ومعنى إن الله معنا أي بالنصر والرعاية والحفظ والكلاءة . روى الترمذي والحارث بن أبي أسامة قالا : حدثنا عفان قال حدثنا همام قال أخبرنا ثابت عن أنس أن أبا بكر حدثه قال : قلت للنبي صلى الله عليه وسلم ونحن في الغار : لو أن أحدهم نظر إلى قدميه لأبصرنا تحت قدميه ، فقال : يا أبا بكر ما ظنك باثنين الله ثالثهما . قال المحاسبي : يعني معهما بالنصر والدفاع ، لا على معنى ما عم به الخلائق فقال : ما يكون من نجوى ثلاثة إلا هو رابعهم . فمعناه العموم أنه يسمع ويرى من الكفار والمؤمنين .\nالسابعة : قال ابن العربي : قالت الإمامية قبحها الله : حزن أبي بكر في الغار دليل على جهله ونقصه وضعف قلبه وخرقه . وأجاب علماؤنا عن ذلك بأن إضافة الحزن إليه ليس بنقص ، كما لم ينقص إبراهيم حين قال عنه : نكرهم وأوجس منهم خيفة قالوا لا تخف . ولم ينقص موسى قوله : فأوجس في نفسه خيفة موسى . قلنا لا تخف . وفي لوط : ولا تحزن إنا منجوك وأهلك . فهؤلاء العظماء صلوات الله عليهم قد وجدت عندهم التقية نصا ولم يكن ذلك طعنا عليهم ووصفا لهم بالنقص ، وكذلك في أبي بكر . ثم هي عند الصديق احتمال ، فإنه قال : لو أن أحدهم نظر تحت قدميه لأبصرنا .\nجواب ثان : إن حزن الصديق إنما كان خوفا على النبي صلى الله عليه وسلم أن يصل إليه ضرر ، ولم يكن النبي صلى الله عليه وسلم في ذلك الوقت معصوما وإنما نزل عليه والله يعصمك من الناس بالمدينة .\nالثامنة : قال ابن العربي : قال لنا أبو الفضائل العدل قال لنا جمال الإسلام أبو القاسم قال موسى صلى الله عليه وسلم : كلا إن معي ربي سيهدين وقال في محمد صلى الله عليه وسلم : لا تحزن إن الله معنا لا جرم لما كان الله مع موسى وحده ارتد أصحابه بعده ، فرجع من عند ربه ووجدهم يعبدون العجل . ولما قال في محمد صلى الله عليه وسلم لا تحزن إن الله معنا بقي أبو بكر مهتديا موحدا عالما جازما قائما بالأمر ولم يتطرق إليه اختلال .\nالتاسعة : خرج الترمذي من حديث نبيط بن شريط عن سالم بن عبيد - له صحبة - قال : أغمي على رسول الله صلى الله عليه وسلم . . . ، الحديث . وفيه : واجتمع المهاجرون يتشاورون فقالوا : انطلقوا بنا إلى إخواننا من الأنصار ندخلهم معنا في هذا الأمر . فقالت الأنصار : منا أمير ومنكم أمير . فقال عمر رضي الله عنه : من له مثل هذه الثلاث ثاني اثنين إذ هما في الغار إذ يقول لصاحبه لا تحزن إن الله معنا من هما ؟ قال : ثم بسط يده فبايعه وبايعه الناس بيعة حسنة جميلة .\nقلت : ولهذا قال بعض العلماء : في قوله تعالى : ثاني اثنين إذ هما في الغار ما يدل على أن الخليفة بعد النبي صلى الله عليه وسلم أبو بكر الصديق رضي الله عنه ؛ لأن الخليفة لا يكون أبدا إلا ثانيا . وسمعت شيخنا الإمام أبا العباس أحمد بن عمر يقول : إنما استحق الصديق أن يقال له ثاني اثنين لقيامه بعد النبي صلى الله عليه وسلم بالأمر ، كقيام النبي صلى الله عليه وسلم به أولا . وذلك أن النبي صلى الله عليه وسلم لما مات ارتدت العرب كلها ، ولم يبق الإسلام إلا بالمدينة ومكة وجواثا ، فقام أبو بكر يدعو الناس إلى الإسلام ويقاتلهم على الدخول في الدين كما فعل النبي صلى الله عليه وسلم ، فاستحق من هذه الجهة أن يقال في حقه \" ثاني اثنين \" .\nقلت : وقد جاء في السنة أحاديث صحيحة ، يدل ظاهرها على أنه الخليفة بعده ، وقد انعقد الإجماع على ذلك ولم يبق منهم مخالف . والقادح في خلافته مقطوع بخطئه وتفسيقه . وهل يكفر أم لا ، يختلف فيه ، والأظهر تكفيره . وسيأتي لهذا المعنى مزيد بيان في سورة ( الفتح ) إن شاء الله . والذي يقطع به من الكتاب والسنة وأقوال علماء الأمة ويجب أن تؤمن به القلوب والأفئدة فضل الصديق على جميع الصحابة . ولا مبالاة بأقوال أهل الشيع ولا أهل البدع ، فإنهم بين مكفر تضرب رقبته ، وبين مبتدع مفسق لا تقبل كلمته . ثم بعد الصديق ، عمر الفاروق ، ثم بعده عثمان . روى البخاري عن ابن عمر قال : كنا نخير بين الناس في زمن رسول الله صلى الله عليه وسلم فنخير أبا بكر ثم عمر ثم عثمان . واختلف أئمة أهل السلف في عثمان وعلي ، فالجمهور منهم على تقديم عثمان . وروي عن مالك أنه توقف في ذلك . وروي عنه أيضا أنه رجع إلى ما عليه الجمهور . وهو الأصح إن شاء الله .\nالعاشرة : قوله تعالى فأنزل الله سكينته عليه فيه قولان : أحدهما : على النبي صلى الله عليه وسلم . والثاني : على أبي بكر . ابن العربي : قال علماؤنا : وهو الأقوى ؛ لأنه خاف على النبي صلى الله عليه وسلم من القوم فأنزل الله سكينته عليه بتأمين النبي صلى الله عليه وسلم ، فسكن جأشه وذهب روعه وحصل الأمن وأنبت الله سبحانه ثمامة ، وألهم الوكر هناك حمامة وأرسل العنكبوت فنسجت بيتا عليه . فما أضعف هذه الجنود في ظاهر الحس وما أقواها في باطن المعنى ولهذا المعنى قال النبي صلى الله عليه وسلم لعمر حين تغامر مع الصديق : هل أنتم تاركو لي صاحبي إن الناس كلهم قالوا كذبت وقال أبو بكر صدقت رواه أبو الدرداء .\nالحادية عشرة : قوله تعالى وأيده بجنود لم تروها أي من الملائكة . والكناية في قوله وأيده ترجع إلى النبي صلى الله عليه وسلم . والضميران يختلفان ، وهذا كثير في القرآن وفي كلام العرب .\nوجعل كلمة الذين كفروا السفلى أي كلمة الشرك . وكلمة الله هي العليا قيل : لا إله إلا الله . وقيل : وعد النصر . وقرأ الأعمش ويعقوب \" وكلمة الله \" بالنصب حملا على ( جعل ) والباقون بالرفع على الاستئناف . وزعم الفراء أن قراءة النصب بعيدة ، قال : لأنك تقول أعتق فلان غلام أبيه ، ولا تقول غلام أبي فلان . وقال أبو حاتم نحوا من هذا . قال : كان يجب أن يقال وكلمته هي العليا . قال النحاس : الذي ذكره الفراء لا يشبه الآية ، ولكن يشبهها ما أنشد سيبويه :\nلا أرى الموت يسبق الموت شيء نغص الموت ذا الغنى والفقيرا\nفهذا حسن جيد لا إشكال فيه ، بل يقول النحويون الحذاق : في إعادة الذكر في مثل هذا فائدة وهي أن فيه معنى التعظيم ، قال الله تعالى : إذا زلزلت الأرض زلزالها . وأخرجت الأرض أثقالها فهذا لا إشكال فيه . وجمع الكلمة كلم . وتميم تقول : هي كلمة بكسر الكاف . وحكى الفراء فيها ثلاث لغات : كلمة وكلمة وكلمة مثل كبد وكبد وكبد ، وورق وورق وورق . والكلمة أيضا القصيدة بطولها ، قاله الجوهري .\n                                    ",
        "saadi": "إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَٰحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ ٠٤\n                                        \n                                        \n                                        \n                                        أي‏:‏ إلا تنصروا رسوله محمدًا ـ صلى الله عليه وسلم ـ فاللّه غني عنكم، لا تضرونه شيئا، فقد نصره في أقل ما يكون وأذلة ‏{‏إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا‏}‏ من مكة لما هموا بقتله، وسعوا في ذلك، وحرصوا أشد الحرص، فألجؤوه إلى أن يخرج‏.‏\n‏{‏ثَانِيَ اثْنَيْنِ‏}‏ أي‏:‏ هو وأبو بكر الصديق رضي اللّه عنه‏.‏ ‏{‏إِذْ هُمَا فِي الْغَارِ‏}‏ أي‏:‏ لما هربا من مكة، لجآ إلى غار ثور في أسفل مكة، فمكثا فيه ليبرد عنهما الطلب‏.‏\nفهما في تلك الحالة الحرجة الشديدة المشقة، حين انتشر الأعداء من كل جانب يطلبونهما ليقتلوهما، فأنزل اللّه عليهما من نصره ما لا يخطر على البال‏.‏\n‏{‏إِذْ يَقُولُ‏}‏ النبي ـ صلى الله عليه وسلم ـ ‏{‏لِصَاحِبِهِ‏}‏ أبي بكر لما حزن واشتد قلقه، ‏{‏لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا‏}‏ بعونه ونصره وتأييده‏.‏\n‏{‏فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ‏}‏ أي‏:‏ الثبات والطمأنينة، والسكون المثبتة للفؤاد، ولهذا لما قلق صاحبه سكنه وقال ‏{‏لا تحزن إن اللّه معنا‏}‏\n‏{‏وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا‏}‏ وهي الملائكة الكرام، الذين جعلهم اللّه حرسا له، ‏{‏وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَى‏}‏ أي‏:‏ الساقطة المخذولة، فإن الذين كفروا قد كانوا على حرد قادرين، في ظنهم على قتل الرسول ـ صلى الله عليه وسلم ـ ، وأخذه، حنقين عليه، فعملوا غاية مجهودهم في ذلك، فخذلهم اللّه ولم يتم لهم مقصودهم، بل ولا أدركوا شيئا منه‏.‏\nونصر اللّه رسوله بدفعه عنه، وهذا هو النصر المذكور في هذا الموضع، فإن النصر على قسمين‏:‏ نصر المسلمين إذا طمعوا في عدوهم بأن يتم اللّه لهم ما طلبوا، وقصدوا، ويستولوا على عدوهم ويظهروا عليهم‏.‏\nوالثاني نصر المستضعف الذي طمع فيه عدوه القادر، فنصر اللّه إياه، أن يرد عنه عدوه، ويدافع عنه، ولعل هذا النصر أنفع النصرين، ونصر اللّه رسوله إذ أخرجه الذين كفروا ثاني اثنين من هذا النوع‏.‏\nوقوله ‏{‏وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا‏}‏ أي كلماته القدرية وكلماته الدينية، هي العالية على كلمة غيره، التي من جملتها قوله‏:‏ ‏{‏وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ‏}‏ ‏{‏إِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِينَ آمَنُوا فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ يَقُومُ الْأَشْهَادُ‏}‏ ‏{‏وَإِنَّ جُنْدَنَا لَهُمُ الْغَالِبُونَ‏}‏ فدين اللّه هو الظاهر العالي على سائر الأديان، بالحجج الواضحة، والآيات الباهرة والسلطان الناصر‏.‏\n‏{‏وَاللَّهُ عَزِيزٌ‏}‏ لا يغالبه مغالب، ولا يفوته هارب، ‏{‏حَكِيمٌ‏}‏ يضع الأشياء مواضعها، وقد يؤخر نصر حزبه إلى وقت آخر، اقتضته الحكمة الإلهية‏.‏\nوفي هذه الآية الكريمة فضيلة أبي بكر الصديق بخصيصة لم تكن لغيره من هذه الأمة، وهي الفوز بهذه المنقبة الجليلة، والصحبة الجميلة، وقد أجمع المسلمون على أنه هو المراد بهذه الآية الكريمة، ولهذا عدوا من أنكر صحبة أبي بكر للنبي ـ صلى الله عليه وسلم ـ كافرًا، لأنه منكر للقرآن الذي صرح بها‏.‏\nوفيها فضيلة السكينة، وأنها من تمام نعمة اللّه على العبد في أوقات الشدائد والمخاوف التي تطيش بها الأفئدة، وأنها تكون على حسب معرفة العبد بربه، وثقته بوعده الصادق، وبحسب إيمانه وشجاعته‏.‏\nوفيها‏:‏ أن الحزن قد يعرض لخواص عباد الله الصديقين، مع أن الأولى ـ إذا نزل بالعبد ـ أن يسعى في ذهابه عنه، فإنه مضعف للقلب، موهن للعزيمة‏.‏\n                                    "
      },
      "originalText": "إِلَّا تَنصُرُوهُ فَقَدۡ نَصَرَهُ ٱللَّهُ إِذۡ أَخۡرَجَهُ ٱلَّذِينَ كَفَرُواْ ثَانِيَ ٱثۡنَيۡنِ إِذۡ هُمَا فِي ٱلۡغَارِ إِذۡ يَقُولُ لِصَٰحِبِهِۦ لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيۡهِ وَأَيَّدَهُۥ بِجُنُودٖ لَّمۡ تَرَوۡهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُواْ ٱلسُّفۡلَىٰۗ وَكَلِمَةُ ٱللَّهِ هِيَ ٱلۡعُلۡيَاۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ ٠٤"
    }
  ]
}