{
  "number": 203,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 1335,
      "text": "وَالسَّابِقُونَ الْأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالْأَنْصَارِ وَالَّذِينَ اتَّبَعُوهُمْ بِإِحْسَانٍ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 100,
      "juz": 11,
      "manzil": 2,
      "page": 203,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٠٠١\n                                    \n                                    \n                                    يخبر تعالى عن رضاه عن السابقين من المهاجرين والأنصار والتابعين لهم بإحسان ، ورضاهم عنه بما أعد لهم من جنات النعيم ، والنعيم المقيم .\nقال الشعبي : السابقون الأولون من المهاجرين والأنصار من أدرك بيعة الرضوان عام الحديبية .\nوقال أبو موسى الأشعري ، وسعيد بن المسيب ، ومحمد بن سيرين ، والحسن ، وقتادة : هم الذين صلوا إلى القبلتين مع رسول الله صلى الله عليه وسلم .\nوقال محمد بن كعب القرظي : مر عمر بن الخطاب برجل يقرأ : ( والسابقون الأولون من المهاجرين والأنصار ) فأخذ عمر بيده فقال : من أقرأك هذا ؟ فقال : أبي بن كعب . فقال : لا تفارقني حتى أذهب بك إليه . فلما جاءه قال عمر : أنت أقرأت هذا هذه الآية هكذا ؟ قال : نعم . قال : وسمعتها من رسول الله صلى الله عليه وسلم ؟ قال : نعم . لقد كنت أرى أنا رفعنا رفعة لا يبلغها أحد بعدنا ، فقال أبي : تصديق هذه الآية في أول سورة الجمعة : ( وآخرين منهم لما يلحقوا بهم وهو العزيز الحكيم ) [ الجمعة : 3 ] وفي سورة الحشر : ( والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ) [ الحشر : 10 ] وفي الأنفال : ( والذين آمنوا من بعد وهاجروا وجاهدوا معكم فأولئك منكم ) [ الأنفال : 75 ] إلى آخر الآية ، رواه ابن جرير\nقال : وذكر عن الحسن البصري أنه كان يقرؤها برفع \" الأنصار \" عطفا على ( والسابقون الأولون )\nفقد أخبر الله العظيم أنه قد رضي عن السابقين الأولين من المهاجرين والأنصار والذين اتبعوهم بإحسان : فيا ويل من أبغضهم أو سبهم أو أبغض أو سب بعضهم ، ولا سيما سيد الصحابة بعد الرسول وخيرهم وأفضلهم ، أعني الصديق الأكبر والخليفة الأعظم أبا بكر بن أبي قحافة ، رضي الله عنه ، فإن الطائفة المخذولة من الرافضة يعادون أفضل الصحابة ويبغضونهم ويسبونهم ، عياذا بالله من ذلك . وهذا يدل على أن عقولهم معكوسة ، وقلوبهم منكوسة ، فأين هؤلاء من الإيمان بالقرآن ، إذ يسبون من رضي الله عنهم ؟ وأما أهل السنة فإنهم يترضون عمن رضي الله عنه ، ويسبون من سبه الله ورسوله ، ويوالون من يوالي الله ، ويعادون من يعادي الله ، وهم متبعون لا مبتدعون ، ويقتدون ولا يبتدون ولهذا هم حزب الله المفلحون وعباده المؤمنون .\n                                    ",
        "qortoby": "وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٠٠١\n                                    \n                                    \n                                    قوله تعالى : والسابقون الأولون من المهاجرين والأنصار والذين اتبعوهم بإحسان رضي الله عنهم ورضوا عنه وأعد لهم جنات تجري تحتها الأنهار خالدين فيها أبدا ذلك الفوز العظيم\nفيه سبع مسائل :\nالأولى : لما ذكر جل وعز أصناف الأعراب ذكر المهاجرين والأنصار ، وبين أن منهم السابقين إلى الهجرة وأن منهم التابعين ، وأثنى عليهم . وقد اختلف في عدد طبقاتهم وأصنافهم . ونحن نذكر من ذلك طرفا نبين الغرض فيه إن شاء الله تعالى . وروى عمر بن الخطاب أنه قرأ والأنصار رفعا عطفا على السابقين . قال الأخفش : الخفض في الأنصار الوجه ; لأن السابقين منهما . والأنصار اسم إسلامي . قيل لأنس بن مالك : أرأيت قول الناس لكم : الأنصار ، اسم سماكم الله به أم كنتم تدعون به في الجاهلية ؟ قال : بل اسم سمانا الله به في القرآن ; ذكره أبو عمر في الاستذكار .\nالثانية : نص القرآن على تفضيل السابقين الأولين من المهاجرين والأنصار وهم الذين صلوا إلى القبلتين ; في قول سعيد بن المسيب وطائفة . وفي قول أصحاب الشافعي هم الذين شهدوا بيعة الرضوان ، وهي بيعة الحديبية ، وقاله الشعبي . وعن محمد بن كعب وعطاء بن يسار : هم أهل بدر . واتفقوا على أن من هاجر قبل تحويل القبلة فهو من المهاجرين الأولين من غير خلاف بينهم . أما أفضلهم ، وهي :\nالثالثة : فقال أبو منصور البغدادي التميمي : أصحابنا مجمعون على أن أفضلهم الخلفاء الأربعة ، ثم الستة الباقون إلى تمام العشرة ، ثم البدريون ثم أصحاب أحد ثم أهل بيعة الرضوان بالحديبية .\nالرابعة : وأما أولهم إسلاما فروى مجالد عن الشعبي قال : سألت ابن عباس من أول الناس إسلاما ؟ قال أبو بكر ، أوما سمعت قول حسان :\nإذا تذكرت شجوا من أخي ثقة فاذكر أخاك أبا بكر بما فعلا خير البرية أتقاها وأعدلها\nبعد النبي وأوفاها بما حملا الثاني التالي المحمود مشهده\nوأول الناس منهم صدق الرسلا\nوذكر أبو الفرج الجوزي عن يوسف بن يعقوب بن الماجشون أنه قال : أدركت أبي وشيخنا محمد بن المنكدر وربيعة بن أبي عبد الرحمن وصالح بن كيسان وسعد بن إبراهيم وعثمان بن محمد الأخنسي وهم لا يشكون أن أول القوم إسلاما أبو بكر ; وهو قول ابن عباس وحسان وأسماء بنت أبي بكر ، وبه قال إبراهيم النخعي . وقيل : أول من أسلم علي ; روي ذلك عن زيد بن أرقم وأبي ذر والمقداد وغيرهم . قال الحاكم أبو عبد الله : لا أعلم خلافا بين أصحاب التواريخ أن عليا أولهم إسلاما . وقيل : أول من أسلم زيد بن حارثة . وذكر معمر نحو ذلك عن الزهري . وهو قول سليمان بن يسار وعروة بن الزبير وعمران بن أبي أنس . وقيل : أول من أسلم خديجة أم المؤمنين ; روي ذلك من وجوه عن الزهري ، وهو قول قتادة ومحمد بن إسحاق بن يسار وجماعة ، وروي أيضا عن ابن عباس . وادعى الثعلبي المفسر اتفاق العلماء على أن أول من أسلم خديجة ، وأن اختلافهم إنما هو فيمن أسلم بعدها . وكان إسحاق بن إبراهيم بن راهويه الحنظلي يجمع بين هذه الأخبار ، فكان يقول : أول من أسلم من الرجال أبو بكر ، ومن النساء خديجة ، ومن الصبيان علي ، ومن الموالي زيد بن حارثة ، ومن العبيد بلال . والله أعلم . وذكر محمد بن سعد قال : أخبرني مصعب بن ثابت قال حدثني أبو الأسود محمد بن عبد الرحمن بن نوفل قال : كان إسلام الزبير بعد أبي بكر وكان رابعا أو خامسا . قال الليث بن سعد وحدثني أبو الأسود قال : أسلم الزبير وهو ابن ثمان سنين . وروي أن عليا أسلم ابن سبع سنين . وقيل : ابن عشر .\nالخامسة : والمعروف عن طريقة أهل الحديث أن كل مسلم رأى رسول الله صلى الله عليه وسلم فهو من أصحابه . قال البخاري في صحيحه : من صحب النبي صلى الله عليه وسلم أو رآه من المسلمين فهو من أصحابه . وروي عن سعيد بن المسيب أنه كان لا يعد الصحابي إلا من أقام مع رسول الله صلى الله عليه وسلم سنة أو سنتين ، وغزا معه غزوة أو غزوتين . وهذا القول إن صح عن سعيد بن المسيب يوجب ألا يعد من الصحابة جرير بن عبد الله البجلي أو من شاركه في فقد ظاهر ما اشترطه فيهم ممن لا نعرف خلافا في عده من الصحابة .\nالسادسة : لا خلاف أن أول السابقين من المهاجرين أبو بكر الصديق . وقال ابن العربي : السبق يكون بثلاثة أشياء : الصفة وهو الإيمان ، والزمان ، والمكان . وأفضل هذه الوجوه سبق الصفات ; والدليل عليه قوله صلى الله عليه وسلم في الصحيح : نحن الآخرون الأولون بيد أنهم أوتوا الكتاب من قبلنا وأوتيناه من بعدهم فهذا يومهم الذي اختلفوا فيه فهدانا الله له فاليهود غدا والنصارى بعد غد . فأخبر النبي صلى الله عليه وسلم أن من سبقنا من الأمم بالزمان سبقناهم بالإيمان والامتثال لأمر الله تعالى والانقياد إليه ، والاستسلام لأمره والرضا بتكليفه والاحتمال لوظائفه ، لا نعترض عليه ولا نختار معه ، ولا نبدل بالرأي شريعته كما فعل أهل الكتاب ; وذلك بتوفيق الله لما قضاه ، وبتيسيره لما يرضاه ; وما كنا لنهتدي لولا أن هدانا الله .\nالسابعة : قال ابن خويزمنداد : تضمنت هذه الآية تفضيل السابقين إلى كل منقبة من مناقب الشريعة ، في علم أو دين أو شجاعة أو غير ذلك ، من العطاء في المال والرتبة في الإكرام . وفي هذه المسألة خلاف بين أبي بكر وعمر رضي الله عنهما . واختلف العلماء في تفضيل السابقين بالعطاء على غيرهم ; فروي عن أبي بكر الصديق رضي الله عنه أنه كان لا يفضل بين الناس في العطاء بعضهم على بعض بحسب السابقة . وكان عمر يقول له : أتجعل ذا السابقة كمن لا سابقة له ؟ فقال أبو بكر : إنما عملوا لله وأجرهم عليه . وكان عمر يفضل في خلافته ; ثم قال عند وفاته : لئن عشت إلى غد لألحقن أسفل الناس بأعلاهم ; فمات من ليلته . والخلافة إلى يومنا هذا على هذا الخلاف .\nقوله تعالى والذين اتبعوهم بإحسان فيه مسألتان : الأولى : قرأ عمر \" والأنصار \" رفعا . ( الذين ) بإسقاط الواو نعتا للأنصار ; فراجعه زيد بن ثابت ، فسأل عمر أبي بن كعب فصدق زيدا ; فرجع إليه عمر وقال : ما كنا نرى إلا أنا رفعنا رفعة لا ينالها معنا أحد . فقال أبي : إني أجد مصداق ذلك في كتاب الله في أول سورة الجمعة : وآخرين منهم لما يلحقوا بهم وفي سورة الحشر : والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان . وفي سورة الأنفال بقوله : والذين آمنوا من بعد وهاجروا وجاهدوا معكم فأولئك منكم . فثبتت القراءة بالواو . وبين تعالى بقوله : ( بإحسان ) ما يتبعون فيه من أفعالهم وأقوالهم ، لا فيما صدر عنهم من الهفوات والزلات ; إذ لم يكونوا معصومين رضي الله عنهم .\nالثانية : واختلف العلماء في التابعين ومراتبهم ; فقال الخطيب الحافظ : التابعي من صحب الصحابي ; ويقال للواحد منهم : تابع وتابعي . وكلام الحاكم أبي عبد الله وغيره مشعر بأنه يكفي فيه أن يسمع من الصحابي أو يلقاه وإن لم توجد الصحبة العرفية . وقد قيل : إن اسم التابعين ينطلق على من أسلم بعد الحديبية ; كخالد بن الوليد وعمرو بن العاص ومن داناهم من مسلمة الفتح ; لما ثبت أن عبد الرحمن بن عوف شكا إلى النبي صلى الله عليه وسلم خالد بن الوليد ; فقال النبي صلى الله عليه وسلم لخالد : دعوا لي أصحابي فوالذي نفسي بيده لو أنفق أحدكم كل يوم مثل أحد ذهبا ما بلغ مد أحدهم ولا نصيفه . ومن العجب عد الحاكم أبو عبد الله النعمان وسويدا ابني مقرن المزني في التابعين عندما ذكر الإخوة من التابعين ، وهما صحابيان معروفان مذكوران في الصحابة ، وقد شهدا الخندق كما تقدم . والله أعلم . وأكبر التابعين الفقهاء السبعة من أهل المدينة ، وهم سعيد بن المسيب ، والقاسم بن محمد ; وعروة بن الزبير ، وخارجة بن زيد ، وأبو سلمة بن عبد الرحمن ، وعبد الله بن عتبة بن مسعود ، وسليمان بن يسار . وقد نظمهم بعض الأجلة في بيت واحد فقال :\nفخذهم عبيد الله عروة قاسم سعيد أبو بكر سليمان خارجه\nوقال أحمد بن حنبل : أفضل التابعين سعيد بن المسيب ; فقيل له : فعلقمة والأسود . فقال : سعيد بن المسيب وعلقمة والأسود . وعنه أيضا أنه قال : أفضل التابعين قيس وأبو عثمان وعلقمة ومسروق ; هؤلاء كانوا فاضلين ومن علية التابعين . وقال أيضا : كان عطاء مفتي مكة والحسن مفتي البصرة فهذان أثر الناس عنهم ; وأبهم . وروي عن أبي بكر بن أبي داود قال : سيدتا التابعين من النساء حفصة بنت سيرين وعمرة بنت عبد الرحمن ، وثالثتهما - وليست كهما - أم الدرداء . وروي عن الحاكم أبي عبد الله قال : طبقة تعد في التابعين ولم يصح سماع أحد منهم من الصحابة ; منهم إبراهيم بن سويد النخعي وليس بإبراهيم بن يزيد النخعي الفقيه . وبكير بن أبي السميط ، وبكير بن عبد الله الأشج . وذكر غيرهم قال : وطبقة عدادهم عند الناس في أتباع التابعين . وقد لقوا الصحابة منهم أبو الزناد عبد الله بن ذكوان ، لقي عبد الله بن عمر وأنسا . وهشام بن عروة ، وقد أدخل على عبد الله بن عمر ، وجابر بن عبد الله وموسى بن عقبة ، وقد أدرك أنس بن مالك . وأم خالد بنت خالد بن سعيد . وفي التابعين طبقة تسمى بالمخضرمين ، وهم الذين أدركوا الجاهلية وحياة رسول الله صلى الله عليه وسلم وأسلموا ولا صحبة لهم . واحدهم مخضرم بفتح الراء كأنه خضرم ، أي قطع عن نظرائه الذين أدركوا الصحبة وغيرها . وذكرهم مسلم فبلغ بهم عشرين نفسا ، منهم أبو عمرو الشيباني ، وسويد بن غفلة الكندي ، وعمرو بن ميمون الأودي وأبو عثمان النهدي وعبد خير بن يزيد الخيراني بفتح الخاء ، بطن من همدان ، وعبد الرحمن بن مل . وأبو الحلال العتكي ربيعة بن زرارة . وممن لم يذكره مسلم منهم أبو مسلم الخولاني عبد الله بن ثوب ، والأحنف بن قيس . فهذه نبذة من معرفة الصحابة والتابعين الذين نطق بفضلهم القرآن الكريم ، رضوان الله عليهم أجمعين . وكفانا نحن قوله جل وعز : كنتم خير أمة أخرجت للناس على ما تقدم ، وقوله عز وجل : وكذلك جعلناكم أمة وسطا الآية . وقال رسول الله صلى الله عليه وسلم : وددت أنا لو رأينا إخواننا . . . . الحديث . فجعلنا إخوانه ; إن اتقينا الله واقتفينا آثاره ، حشرنا الله في زمرته ولا حاد بنا عن طريقته وملته بحق محمد وآله .\n                                    ",
        "saadi": "وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٠٠١\n                                        \n                                        \n                                        \n                                        السابقون هم الذين سبقوا هذة الأمة وبدروها إلى الإيمان والهجرة، والجهاد، وإقامة دين اللّه‏.‏\n‏{‏مِنَ الْمُهَاجِرِينَ‏}‏ ‏{‏الذين أخرجوا من ديارهم وأموالهم يبتغون فضلا من اللّه ورضوانا، وينصرون اللّه ورسوله أولئك هم الصادقون‏}‏\nومن ‏{‏الْأَنْصَارِ‏}‏ ‏{‏الذين تبوأوا الدار والإيمان من قبلهم يحبون من هاجر إليهم، ولا يجدون في صدورهم حاجة مما أوتوا، ويؤثرون على أنفسهم ولو كان بهم خصاصة‏}‏\n‏{‏وَالَّذِينَ اتَّبَعُوهُمْ بِإِحْسَانٍ‏}‏ بالاعتقادات والأقوال والأعمال، فهؤلاء، هم الذين سلموا من الذم، وحصل لهم نهاية المدح، وأفضل الكرامات من اللّه‏.‏\n‏{‏رَضِيَ اللَّهُ عَنْهُمْ‏}‏ ورضاه تعالى أكبر من نعيم الجنة، ‏{‏وَرَضُوا عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الْأَنْهَارُ‏}‏ الجارية التي تساق إلى سَقْيِ الجنان، والحدائق الزاهية الزاهرة، والرياض الناضرة‏.‏\n‏{‏خَالِدِينَ فِيهَا أَبَدًا‏}‏ لا يبغون عنها حولا، ولا يطلبون منها بدلا، لأنهم مهما تمنوه، أدركوه، ومهما أرادوه، وجدوه‏.‏\n‏{‏ذَلِكَ الْفَوْزُ الْعَظِيمُ‏}‏ الذي حصل لهم فيه، كل محبوب للنفوس، ولذة للأرواح، ونعيم للقلوب، وشهوة للأبدان، واندفع عنهم كل محذور‏.‏\n                                    "
      },
      "originalText": "وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٠٠١"
    },
    {
      "number": 1336,
      "text": "وَمِمَّنْ حَوْلَكُمْ مِنَ الْأَعْرَابِ مُنَافِقُونَ ۖ وَمِنْ أَهْلِ الْمَدِينَةِ ۖ مَرَدُوا عَلَى النِّفَاقِ لَا تَعْلَمُهُمْ ۖ نَحْنُ نَعْلَمُهُمْ ۚ سَنُعَذِّبُهُمْ مَرَّتَيْنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٍ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 101,
      "juz": 11,
      "manzil": 2,
      "page": 203,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِمَّنۡ حَوۡلَكُم مِّنَ ٱلۡأَعۡرَابِ مُنَٰفِقُونَۖ وَمِنۡ أَهۡلِ ٱلۡمَدِينَةِ مَرَدُواْ عَلَى ٱلنِّفَاقِ لَا تَعۡلَمُهُمۡۖ نَحۡنُ نَعۡلَمُهُمۡۚ سَنُعَذِّبُهُم مَّرَّتَيۡنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٖ ١٠١\n                                    \n                                    \n                                    يخبر تعالى رسوله ، صلوات الله وسلامه عليه ، أن في أحياء العرب ممن حول المدينة منافقين ، وفي أهل المدينة أيضا منافقون ( مردوا على النفاق ) أي : مرنوا واستمروا عليه : ومنه يقال : شيطان مريد ومارد ، ويقال : تمرد فلان على الله ، أي : عتا وتجبر .\nوقوله : ( لا تعلمهم نحن نعلمهم ) لا ينافي قوله تعالى : ( ولو نشاء لأريناكهم فلعرفتهم بسيماهم ولتعرفنهم في لحن القول ) الآية [ محمد : 30 ] ؛ لأن هذا من باب التوسم فيهم بصفات يعرفون بها ، لا أنه يعرف جميع من عنده من أهل النفاق والريب على التعيين . وقد كان يعلم أن في بعض من يخالطه من أهل المدينة نفاقا ، وإن كان يراه صباحا ومساء ، وشاهد هذا بالصحة ما رواه الإمام أحمد في مسنده حيث قال :\nحدثنا محمد بن جعفر ، حدثنا شعبة ، عن النعمان بن سالم ، عن رجل ، عن جبير بن مطعم ، رضي الله عنه ، قال : قلت : يا رسول الله ، إنهم يزعمون أنه ليس لنا أجر بمكة ، فقال : لتأتينكم أجوركم ولو كنتم في جحر ثعلب \" وأصغى إلي رسول الله صلى الله عليه وسلم برأسه فقال : \" إن في أصحابي منافقين \"\nومعناه : أنه قد يبوح بعض المنافقين والمرجفين من الكلام بما لا صحة له ، ومن مثلهم صدر هذا الكلام الذي سمعه جبير بن مطعم . وتقدم في تفسير قوله : ( وهموا بما لم ينالوا ) [ التوبة : 74 ] أنه عليه السلام أعلم حذيفة بأعيان أربعة عشر أو خمسة عشر منافقا ، وهذا تخصيص لا يقتضي أنه اطلع على أسمائهم وأعيانهم كلهم ، والله أعلم .\nوروى الحافظ ابن عساكر في ترجمة \" أبي عمر البيروتي \" من طريق هشام بن عمار : حدثنا صدقة بن خالد ، حدثنا بن جابر ، حدثني شيخ بيروت يكنى أبا عمر ، أظنه حدثني عن أبي الدرداء ؛ أن رجلا يقال له \" حرملة \" أتى النبي صلى الله عليه وسلم فقال : الإيمان هاهنا - وأشار بيده إلى لسانه - والنفاق هاهنا - وأشار بيده إلى قلبه ولم يذكر الله إلا قليلا . فقال رسول الله صلى الله عليه وسلم : \" اللهم اجعل له لسانا ذاكرا ، وقلبا شاكرا ، وارزقه حبي ، وحب من يحبني ، وصير أمره إلى خير \" . فقال : يا رسول الله ، إنه كان لي أصحاب من المنافقين وكنت رأسا فيهم ، أفلا آتيك بهم ؟ قال : \" من أتانا استغفرنا له ، ومن أصر على دينه فالله أولى به ، ولا تخرقن على أحد سترا \" قال : وكذا رواه أبو أحمد الحاكم ، عن أبي بكر الباغندي ، عن هشام بن عمار ، به .\nوقال عبد الرزاق : أخبرنا معمر ، عن قتادة في هذه الآية أنه قال : ما بال أقوام يتكلفون علم الناس ؟ فلان في الجنة وفلان في النار . فإذا سألت أحدهم عن نفسه قال : لا أدري ! لعمري أنت بنفسك أعلم منك بأحوال الناس ، ولقد تكلفت شيئا ما تكلفه الأنبياء قبلك . قال نبي الله نوح : ( قال وما علمي بما كانوا يعملون ) [ الشعراء : 112 ] وقال نبي الله شعيب : ( بقية الله خير لكم إن كنتم مؤمنين وما أنا عليكم بحفيظ ) [ هود : 86 ] وقال الله لنبيه صلى الله عليه وسلم : ( لا تعلمهم نحن نعلمهم ) .\nوقال السدي ، عن أبي مالك ، عن ابن عباس في هذه الآية قال : قام رسول الله صلى الله عليه وسلم خطيبا يوم الجمعة فقال : \" اخرج يا فلان ، فإنك منافق ، واخرج يا فلان فإنك منافق \" . فأخرج من المسجد ناسا منهم ، فضحهم . فجاء عمر وهم يخرجون من المسجد فاختبأ منهم حياء أنه لم يشهد الجمعة وظن أن الناس قد انصرفوا ، واختبئوا هم من عمر ، ظنوا أنه قد علم بأمرهم . فجاء عمر فدخل المسجد فإذا الناس لم يصلوا ، فقال له رجل من المسلمين : أبشر يا عمر ، قد فضح الله المنافقين اليوم . قال ابن عباس : فهذا العذاب الأول حين أخرجهم من المسجد ، والعذاب الثاني عذاب القبر\nوكذا قال الثوري ، عن السدي ، عن أبي مالك نحو هذا .\nوقال مجاهد في قوله : ( سنعذبهم مرتين ) يعني : القتل والسباء وقال - في رواية - بالجوع ، وعذاب القبر ، ( ثم يردون إلى عذاب عظيم )\nوقال ابن جريج : عذاب الدنيا ، وعذاب القبر ، ثم يردون إلى عذاب النار .\nوقال الحسن البصري : عذاب في الدنيا ، وعذاب في القبر\nوقال عبد الرحمن بن زيد : أما عذاب في الدنيا فالأموال والأولاد ، وقرأ قول الله ( فلا تعجبك أموالهم وأولادهم إنما يريد الله أن يعذبهم بها في الدنيا ) [ التوبة : 85 ] فهذه المصائب لهم عذاب ، وهي للمؤمنين أجر ، وعذاب في الآخرة في النار ( ثم يردون إلى عذاب عظيم ) قال : النار .\nوقال محمد بن إسحاق : ( سنعذبهم مرتين ) قال : هو - فيما بلغني - ما هم فيه من أمر الإسلام ، وما يدخل عليهم من غيظ ذلك على غير حسبة ، ثم عذابهم في القبور إذا صاروا إليها ، ثم العذاب العظيم الذي يردون إليه ، عذاب الآخرة والخلد فيه .\nوقال سعيد ، عن قتادة في قوله : ( سنعذبهم مرتين ) عذاب الدنيا ، وعذاب القبر ، ( ثم يردون إلى عذاب عظيم ) ذكر لنا أن نبي الله صلى الله عليه وسلم أسر إلى حذيفة باثني عشر رجلا من المنافقين ، فقال : \" ستة منهم تكفيكهم الدبيلة : سراج من نار جهنم ، يأخذ في كتف أحدهم حتى يفضي إلى صدره ، وستة يموتون موتا \" . وذكر لنا أن عمر بن الخطاب ، رضي الله عنه ، كان إذا مات رجل ممن يرى أنه منهم ، نظر إلى حذيفة ، فإن صلى عليه وإلا تركه . وذكر لنا أن عمر قال لحذيفة : أنشدك بالله ، أمنهم أنا ؟ قال : لا . ولا أومن منها أحدا بعدك .\n                                    ",
        "qortoby": "وَمِمَّنۡ حَوۡلَكُم مِّنَ ٱلۡأَعۡرَابِ مُنَٰفِقُونَۖ وَمِنۡ أَهۡلِ ٱلۡمَدِينَةِ مَرَدُواْ عَلَى ٱلنِّفَاقِ لَا تَعۡلَمُهُمۡۖ نَحۡنُ نَعۡلَمُهُمۡۚ سَنُعَذِّبُهُم مَّرَّتَيۡنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٖ ١٠١\n                                    \n                                    \n                                    قوله تعالى وممن حولكم من الأعراب منافقون ومن أهل المدينة مردوا على النفاق لا تعلمهم نحن نعلمهم سنعذبهم مرتين ثم يردون إلى عذاب عظيم\nقوله تعالى وممن حولكم من الأعراب منافقون ابتداء وخبر . أي قوم منافقون ; يعني مزينة وجهينة وأسلم وغفارا وأشجع .\nومن أهل المدينة مردوا على النفاق أي قوم مردوا على النفاق . وقيل : ( مردوا ) من نعت المنافقين ; فيكون في الكلام تقديم وتأخير ، المعنى . ومن حولكم من الأعراب منافقون مردوا على النفاق ، ومن أهل المدينة مثل ذلك . ومعنى : \" مردوا \" أقاموا ولم يتوبوا ; عن ابن زيد . وقال غيره : لجوا فيه وأبوا غيره ; والمعنى متقارب . وأصل الكلمة من اللين والملامسة والتجرد . فكأنهم تجردوا للنفاق . ومنه رملة مرداء لا نبت فيها . وغصن أمرد لا ورق عليه . وفرس أمرد لا شعر على ثنته . وغلام أمرد بين المرد ; ولا يقال : جارية مرداء . وتمريد البناء تمليسه ; ومنه قوله : صرح ممرد . وتمريد الغصن تجريده من الورق ; يقال : مرد يمرد مرودا ومرادة .\nقوله تعالى لا تعلمهم نحن نعلمهم هو مثل قوله : لا تعلمونهم الله يعلمهم على ما تقدم . وقيل : المعنى لا تعلم يا محمد عاقبة أمورهم وإنما نختص نحن بعلمها ; وهذا يمنع أن يحكم على أحد بجنة أو نار .\nقوله تعالى سنعذبهم مرتين ثم يردون إلى عذاب عظيم قال ابن عباس : بالأمراض في الدنيا وعذاب الآخرة . فمرض المؤمن كفارة ، ومرض الكافر عقوبة . وقيل : العذاب الأول الفضيحة باطلاع النبي صلى الله عليه وسلم عليهم ; على ما يأتي بيانه في المنافقين . والعذاب الثاني عذاب القبر . الحسن وقتادة : عذاب الدنيا وعذاب القبر . ابن زيد : الأول بالمصائب في أموالهم وأولادهم ، والثاني عذاب القبر . مجاهد : الجوع والقتل . الفراء : القتل وعذاب القبر . وقيل : السباء والقتل . وقيل : الأول أخذ الزكاة من أموالهم وإجراء الحدود عليهم ، والثاني عذاب القبر . وقيل : أحد العذابين ما قال تعالى : فلا تعجبك أموالهم إلى قوله إنما يريد الله ليعذبهم بها في الحياة الدنيا . والغرض من الآية اتباع العذاب ، أو تضعيف العذاب عليهم .\n                                    ",
        "saadi": "وَمِمَّنۡ حَوۡلَكُم مِّنَ ٱلۡأَعۡرَابِ مُنَٰفِقُونَۖ وَمِنۡ أَهۡلِ ٱلۡمَدِينَةِ مَرَدُواْ عَلَى ٱلنِّفَاقِ لَا تَعۡلَمُهُمۡۖ نَحۡنُ نَعۡلَمُهُمۡۚ سَنُعَذِّبُهُم مَّرَّتَيۡنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٖ ١٠١\n                                        \n                                        \n                                        \n                                        يقول تعالى‏:‏ ‏{‏وَمِمَّنْ حَوْلَكُمْ مِنَ الْأَعْرَابِ مُنَافِقُونَ وَمِنْ أَهْلِ الْمَدِينَةِ‏}‏ أيضًا منافقون ‏{‏مَرَدُوا عَلَى النِّفَاقِ‏}‏ أي‏:‏ تمرنوا عليه، واستمروا وازدادوا فيه طغيانا‏.‏\n‏{‏لَا تَعْلَمُهُمْ‏}‏ بأعيانهم فتعاقبهم، أو تعاملهم بمقتضى نفاقهم، لما للّه في ذلك من الحكمة الباهرة‏.‏\n‏{‏نَحْنُ نَعْلَمُهُمْ سَنُعَذِّبُهُمْ مَرَّتَيْنِ‏}‏ يحتمل أن التثنية على بابها، وأن عذابهم عذاب في الدنيا، وعذاب في الآخرة‏.‏\nففي الدنيا ما ينالهم من الهم والحزن ، والكراهة لما يصيب المؤمنين من الفتح والنصر، وفي الآخرة عذاب النار وبئس القرار‏.‏\nويحتمل أن المراد سنغلظ عليهم العذاب، ونضاعفه عليهم ونكرره‏.‏\n                                    "
      },
      "originalText": "وَمِمَّنۡ حَوۡلَكُم مِّنَ ٱلۡأَعۡرَابِ مُنَٰفِقُونَۖ وَمِنۡ أَهۡلِ ٱلۡمَدِينَةِ مَرَدُواْ عَلَى ٱلنِّفَاقِ لَا تَعۡلَمُهُمۡۖ نَحۡنُ نَعۡلَمُهُمۡۚ سَنُعَذِّبُهُم مَّرَّتَيۡنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٖ ١٠١"
    },
    {
      "number": 1337,
      "text": "وَآخَرُونَ اعْتَرَفُوا بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 102,
      "juz": 11,
      "manzil": 2,
      "page": 203,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَءَاخَرُونَ ٱعۡتَرَفُواْ بِذُنُوبِهِمۡ خَلَطُواْ عَمَلٗا صَٰلِحٗا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٢٠١\n                                    \n                                    \n                                    لما بين تعالى حال المنافقين المتخلفين عن الغزاة رغبة عنها وتكذيبا وشكا ، شرع في بيان حال المذنبين الذين تأخروا عن الجهاد كسلا وميلا إلى الراحة ، مع إيمانهم وتصديقهم بالحق ، فقال : ( وآخرون اعترفوا بذنوبهم ) أي : أقروا بها واعترفوا فيما بينهم وبين ربهم ، ولهم أعمال أخر صالحة ، خلطوا هذه بتلك ، فهؤلاء تحت عفو الله وغفرانه .\nوهذه الآية - وإن كانت نزلت في أناس معينين - إلا أنها عامة في كل المذنبين الخاطئين المخلطين المتلوثين .\nوقد قال مجاهد : إنها نزلت في أبي لبابة لما قال لبني قريظة : إنه الذبح ، وأشار بيده إلى حلقه .\nوقال ابن عباس : ( وآخرون ) نزلت في أبي لبابة وجماعة من أصحابه ، تخلفوا عن غزوة تبوك ، فقال بعضهم : أبو لبابة وخمسة معه ، وقيل : وسبعة معه ، وقيل : وتسعة معه ، فلما رجع النبي صلى الله عليه وسلم من غزوته ربطوا أنفسهم بسواري المسجد ، وحلفوا لا يحلهم إلا رسول الله صلى الله عليه وسلم ، فلما أنزل الله هذه الآية : ( وآخرون اعترفوا بذنوبهم ) أطلقهم النبي صلى الله عليه وسلم ، وعفا عنهم .\nوقال البخاري : حدثنا مؤمل بن هشام ، حدثنا إسماعيل بن إبراهيم ، حدثنا عوف ، حدثنا أبو رجاء ، حدثنا سمرة بن جندب قال : قال رسول الله صلى الله عليه وسلم لنا : \" أتاني الليلة آتيان فابتعثاني فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة ، فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء ، وشطر كأقبح ما أنت راء ، قالا لهم : اذهبوا فقعوا في ذلك النهر . فوقعوا فيه ، ثم رجعوا إلينا قد ذهب ذلك السوء عنهم ، فصاروا في أحسن صورة ، قالا لي : هذه جنة عدن ، وهذا منزلك . قالا أما القوم الذين كانوا شطر منهم حسن وشطر منهم قبيح ، فإنهم خلطوا عملا صالحا وآخر سيئا ، فتجاوز الله عنهم \" .\nهكذا رواه مختصرا ، في تفسير هذه الآية .\n                                    ",
        "qortoby": "وَءَاخَرُونَ ٱعۡتَرَفُواْ بِذُنُوبِهِمۡ خَلَطُواْ عَمَلٗا صَٰلِحٗا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٢٠١\n                                    \n                                    \n                                    قوله تعالى وآخرون اعترفوا بذنوبهم خلطوا عملا صالحا وآخر سيئا عسى الله أن يتوب عليهم إن الله غفور رحيم أي ومن أهل المدينة وممن حولكم قوم أقروا بذنوبهم ، وآخرون مرجون لأمر الله يحكم فيهم بما يريد . فالصنف الأول يحتمل أنهم كانوا منافقين وما مردوا على النفاق ، ويحتمل أنهم كانوا مؤمنين . وقال ابن عباس : نزلت في عشرة تخلفوا عن غزوة تبوك فأوثق سبعة منهم أنفسهم في سواري المسجد . وقال بنحوه قتادة وقال : وفيهم نزل خذ من أموالهم صدقة ; ذكره المهدوي . وقال زيد بن أسلم : كانوا ثمانية . وقيل : كانوا ستة . وقيل : خمسة . وقال مجاهد : نزلت الآية في أبي لبابة الأنصاري خاصة في شأنه مع بني قريظة ; وذلك أنهم كلموه في النزول على حكم الله ورسوله صلى الله عليه وسلم فأشار لهم إلى حلقه . يريد أن النبي صلى الله عليه وسلم يذبحهم إن نزلوا ، فلما افتضح تاب وندم وربط نفسه في سارية من سواري المسجد ، وأقسم ألا يطعم ولا يشرب حتى يعفو الله عنه أو يموت ; فمكث كذلك حتى عفا الله عنه ، ونزلت هذه الآية ، وأمر رسول الله صلى الله عليه وسلم بحله ; ذكره الطبري عن مجاهد ، وذكره ابن إسحاق في السيرة أوعب من هذا . وقال أشهب عن مالك : نزلت \" وآخرون \" في شأن أبي لبابة وأصحابه ، وقال حين أصاب الذنب : يا رسول الله ، أجاورك وأنخلع من مالي ؟ فقال : يجزيك من ذلك الثلث وقد قال تعالى خذ من أموالهم صدقة تطهرهم وتزكيهم بها ورواه ابن القاسم وابن وهب عن مالك . والجمهور أن الآية نزلت في شأن المتخلفين عن غزوة تبوك ، وكانوا ربطوا أنفسهم كما فعل أبو لبابة ، وعاهدوا الله ألا يطلقوا أنفسهم حتى يكون رسول الله صلى الله عليه وسلم هو الذي يطلقهم ويرضى عنهم ، فقال النبي صلى الله عليه وسلم : وأنا أقسم بالله لا أطلقهم ولا أعذرهم حتى أومر بإطلاقهم رغبوا عني وتخلفوا عن الغزو مع المسلمين فأنزل الله هذه الآية ; فلما نزلت أرسل إليهم النبي صلى الله عليه وسلم فأطلقهم وعذرهم . فلما أطلقوا قالوا : يا رسول الله ، هذه أموالنا التي خلفتنا عنك ، فتصدق بها عنا وطهرنا واستغفر لنا . فقال : ما أمرت أن آخذ من أموالكم شيئا فأنزل الله تعالى : خذ من أموالهم صدقة الآية . قال ابن عباس : كانوا عشرة أنفس منهم أبو لبابة ; فأخذ ثلث أموالهم وكانت كفارة الذنوب التي أصابوها . فكان عملهم السيئ التخلف بإجماع من أهل هذه المقالة . واختلفوا في الصالح ; فقال الطبري وغيره : الاعتراف والتوبة والندم . وقيل : عملهم الصالح الذي عملوه أنهم لحقوا برسول الله صلى الله عليه وسلم ، وربطوا أنفسهم بسواري المسجد وقالوا : لا نقرب أهلا ولا ولدا حتى ينزل الله عذرنا . وقالت فرقة : بل العمل الصالح غزوهم فيما سلف من غزو النبي صلى الله عليه وسلم . وهذه الآية وإن كانت نزلت في أعراب فهي عامة إلى يوم القيامة فيمن له أعمال صالحة وسيئة ; فهي ترجى . ذكر الطبري عن حجاج بن أبي زينب قال : سمعت أبا عثمان يقول : ما في القرآن آية أرجى عندي لهذه الأمة من قوله تعالى : وآخرون اعترفوا بذنوبهم خلطوا عملا صالحا وآخر سيئا . وفي البخاري عن سمرة بن جندب قال قال رسول الله صلى الله عليه وسلم لنا : أتاني الليلة آتيان فابتعثاني فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء وشطر كأقبح ما أنت راء قالا لهم : اذهبوا فقعوا في ذلك النهر فوقعوا فيه ثم رجعوا إلينا قد ذهب ذلك السوء عنهم فصاروا في أحسن صورة قالا لي هذه جنة عدن وهذاك منزلك قالا : أما القوم الذي كانوا شطر منهم حسن وشطر منهم قبيح فإنهم خلطوا عملا صالحا وآخر سيئا تجاوز الله عنهم . وذكر البيهقي من حديث الربيع بن أنس عن أبي هريرة عن النبي صلى الله عليه وسلم حديث الإسراء وفيه قال : ثم صعد بي إلى السماء . . . ثم ذكر الحديث إلى أن ذكر صعوده إلى السماء السابعة فقالوا : حياه الله من أخ وخليفة ، فنعم الأخ ونعم الخليفة ونعم المجيء جاء فإذا برجل أشمط جالس على كرسي عند باب الجنة وعنده قوم بيض الوجوه وقوم سود الوجوه وفي ألوانهم شيء فأتوا نهرا فاغتسلوا فيه فخرجوا منه وقد خلص من ألوانهم شيء ثم إنهم أتوا نهرا آخر فاغتسلوا فيه فخرجوا منه وقد خلص من ألوانهم شيء ثم دخلوا النهر الثالث فخرجوا منه وقد خلصت ألوانهم مثل ألوان أصحابهم فجلسوا إلى أصحابهم فقال يا جبريل من هؤلاء بيض الوجوه وهؤلاء الذين في ألوانهم شيء فدخلوا النهر وقد خلصت ألوانهم فقال هذا أبوك إبراهيم هو أول رجل شمط على وجه الأرض وهؤلاء بيض الوجوه قوم لم يلبسوا إيمانهم بظلم - قال - وأما هؤلاء الذين في ألوانهم شيء خلطوا عملا صالحا وآخر سيئا فتابوا فتاب الله عليهم . فأما النهر الأول فرحمة الله وأما النهر الثاني فنعمة الله . وأما النهر الثالث فسقاهم ربهم شرابا طهورا وذكر الحديث .\nوالواو في قوله : ( وآخر سيئا ) قيل : هي بمعنى الباء ، وقيل : بمعنى مع ; كقولك استوى الماء والخشبة . وأنكر ذلك الكوفيون وقالوا : لأن الخشبة لا يجوز تقديمها على الماء ، و ( آخر ) في الآية يجوز تقديمه على الأول ; فهو بمنزلة خلطت الماء باللبن .\n                                    ",
        "saadi": "وَءَاخَرُونَ ٱعۡتَرَفُواْ بِذُنُوبِهِمۡ خَلَطُواْ عَمَلٗا صَٰلِحٗا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٢٠١\n                                        \n                                        \n                                        \n                                        يقول تعالى‏:‏ ‏{‏وَآخَرُونَ‏}‏ ممن بالمدينة ومن حولها، بل ومن سائر البلاد الإسلامية، ‏{‏اعْتَرَفُوا بِذُنُوبِهِمْ‏}‏ أي‏:‏ أقروا بها، وندموا عليها، وسعوا في التوبة منها، والتطهر من أدرانها‏.‏\n‏{‏خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا‏}‏ ولا يكون العمل صالحا إلا إذا كان مع العبد أصل التوحيد والإيمان، المخرج عن الكفر والشرك، الذي هو شرط لكل عمل صالح، فهؤلاء خلطوا الأعمال الصالحة، بالأعمال السيئة، من التجرؤ على بعض المحرمات، والتقصير في بعض الواجبات، مع الاعتراف بذلك والرجاء، بأن يغفر اللّه لهم، فهؤلاء ‏{‏عَسَى اللَّهُ أَنْ يَتُوبَ عَلَيْهِمْ‏}‏ وتوبته على عبده نوعان‏:‏\nالأول‏:‏ التوفيق للتوبة‏.‏ والثاني‏:‏ قبولها بعد وقوعها منهم‏.‏\n‏{‏إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ‏}‏ أي‏:‏ وصفه المغفرة والرحمة اللتان لا يخلو مخلوق منهما، بل لا بقاء للعالم العلوي والسفلي إلا بهما، فلو يؤاخذ اللّه الناس بظلمهم ما ترك على ظهرها من دابة‏.‏\n‏{‏إن اللّه يمسك السماوات والأرض أن تزولا ولئن زالتا إن أمسكهما من أحد من بعده إنه كان حليما غفورا‏}‏ ‏.‏\nومن مغفرته أن المسرفين على أنفسهم الذين قطعوا أعمارهم بالأعمال السيئة، إذا تابوا إليه وأنابوا ولو قبيل موتهم بأقل القليل، فإنه يعفو عنهم، ويتجاوز عن سيئاتهم، فهذه الآية، دلت على أن المخلط المعترف النادم، الذي لم يتب توبة نصوحا، أنه تحت الخوف والرجاء، وهو إلى السلامة أقرب‏.‏\nوأما المخلط الذي لم يعترف ويندم على ما مضى منه، بل لا يزال مصرًا على الذنوب، فإنه يخاف عليه أشد الخوف‏.‏\n                                    "
      },
      "originalText": "وَءَاخَرُونَ ٱعۡتَرَفُواْ بِذُنُوبِهِمۡ خَلَطُواْ عَمَلٗا صَٰلِحٗا وَءَاخَرَ سَيِّئًا عَسَى ٱللَّهُ أَن يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٢٠١"
    },
    {
      "number": 1338,
      "text": "خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِمْ بِهَا وَصَلِّ عَلَيْهِمْ ۖ إِنَّ صَلَاتَكَ سَكَنٌ لَهُمْ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 103,
      "juz": 11,
      "manzil": 2,
      "page": 203,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "خُذۡ مِنۡ أَمۡوَٰلِهِمۡ صَدَقَةٗ تُطَهِّرُهُمۡ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيۡهِمۡۖ إِنَّ صَلَوٰتَكَ سَكَنٞ لَّهُمۡۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٣٠١\n                                    \n                                    \n                                    أمر الله تعالى رسوله صلى الله عليه وسلم بأن يأخذ من أموالهم صدقة يطهرهم ويزكيهم بها ، وهذا عام وإن أعاد بعضهم الضمير في \" أموالهم \" إلى الذين اعترفوا بذنوبهم وخلطوا عملا صالحا وآخر سيئا ؛ ولهذا اعتقد بعض مانعي الزكاة من أحياء العرب أن دفع الزكاة إلى الإمام لا يكون ، وإنما كان هذا خاصا برسول الله صلى الله عليه وسلم ؛ ولهذا احتجوا بقوله تعالى : ( خذ من أموالهم صدقة تطهرهم وتزكيهم بها وصل عليهم إن صلاتك سكن لهم ) وقد رد عليهم هذا التأويل والفهم الفاسد الصديق أبو بكر وسائر الصحابة ، وقاتلوهم حتى أدوا الزكاة إلى الخليفة ، كما كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم ، حتى قال الصديق : والله لو منعوني عقالا - وفي رواية : عناقا - يؤدونه إلى رسول الله صلى الله عليه وسلم لأقاتلنهم على منعه .\nوقوله : ( وصل عليهم ) أي : ادع لهم واستغفر لهم ، كما رواه مسلم في صحيحه ، عن عبد الله بن أبي أوفى قال : كان رسول الله صلى الله عليه وسلم إذا أتي بصدقة قوم صلى عليهم ، فأتاه أبي بصدقته فقال : \" اللهم صل على آل أبي أوفى \" وفي الحديث الآخر : أن امرأة قالت : يا رسول الله ، صل علي وعلى زوجي . فقال : \" صلى الله عليك ، وعلى زوجك \" .\nوقوله : ( إن صلاتك ) : قرأ بعضهم : \" صلواتك \" على الجمع ، وآخرون قرءوا : ( إن صلاتك ) على الإفراد .\n( سكن لهم ) قال ابن عباس : رحمة لهم . وقال قتادة : وقار .\nوقوله : ( والله سميع ) أي : لدعائك ( عليم ) أي : بمن يستحق ذلك منك ومن هو أهل له .\nقال الإمام أحمد : حدثنا وكيع ، حدثنا أبو العميس ، عن أبي بكر بن عمرو بن عتبة ، عن ابن لحذيفة ، عن أبيه ؛ أن النبي صلى الله عليه وسلم كان إذا دعا لرجل أصابته ، وأصابت ولده ، وولد ولده .\nثم رواه عن أبي نعيم ، عن مسعر ، عن أبي بكر بن عمرو بن عتبة ، عن ابن لحذيفة - قال مسعر : وقد ذكره مرة عن حذيفة - : إن صلاة النبي صلى الله عليه وسلم لتدرك الرجل وولده وولد ولده .\n                                    ",
        "qortoby": "خُذۡ مِنۡ أَمۡوَٰلِهِمۡ صَدَقَةٗ تُطَهِّرُهُمۡ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيۡهِمۡۖ إِنَّ صَلَوٰتَكَ سَكَنٞ لَّهُمۡۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٣٠١\n                                    \n                                    \n                                    قوله تعالى خذ من أموالهم صدقة تطهرهم وتزكيهم بها وصل عليهم إن صلاتك سكن لهم والله سميع عليم فيه ثمان مسائل :\nالأولى : قوله تعالى خذ من أموالهم صدقة اختلف في هذه الصدقة المأمور بها ; فقيل : هي صدقة الفرض ; قاله جويبر عن ابن عباس ، وهو قول عكرمة فيما ذكر القشيري . وقيل : هو مخصوص بمن نزلت فيه ; فإن النبي صلى الله عليه وسلم أخذ منهم ثلث أموالهم ، وليس هذا من الزكاة المفروضة في شيء ; ولهذا قال مالك : إذا تصدق الرجل بجميع ماله أجزأه إخراج الثلث ; متمسكا بحديث أبي لبابة . وعلى القول الأول فهو خطاب للنبي صلى الله عليه وسلم يقتضي بظاهره اقتصاره عليه فلا يأخذ الصدقة سواه ، ويلزم على هذا سقوطها بسقوطه وزوالها بموته . وبهذا تعلق مانعو الزكاة على أبي بكر الصديق رضي الله عنه وقالوا : إنه كان يعطينا عوضا منها التطهير والتزكية والصلاة علينا وقد عدمناها من غيره . ونظم في ذلك شاعرهم فقال :\nأطعنا رسول الله ما كان بيننا فيا عجبا ما بال ملك أبي بكر وإن الذي سألوكم فمنعتم\nلكالتمر أو أحلى لديهم من التمر سنمنعهم ما دام فينا بقية\nكرام على الضراء في العسر واليسر\nوهذا صنف من القائمين على أبي بكر أمثلهم طريقة ، وفي حقهم قال أبو بكر : والله لأقاتلن من فرق بين الصلاة والزكاة . ابن العربي : أما قولهم إن هذا خطاب للنبي صلى الله عليه وسلم فلا يلتحق به غيره فهو كلام جاهل بالقرآن غافل عن مأخذ الشريعة متلاعب بالدين ; فإن الخطاب في القرآن لم يرد بابا واحدا ولكن اختلفت موارده على وجوه ، فمنها خطاب توجه إلى جميع الأمة كقوله : يا أيها الذين آمنوا إذا قمتم إلى الصلاة وقوله : يا أيها الذين آمنوا كتب عليكم الصيام ونحوه . ومنها خطاب خص به ولم يشركه فيه غيره لفظا ولا معنى كقوله ومن الليل فتهجد به نافلة لك وقوله : ( خالصة لك ) . ومنها خطاب خص به لفظا وشركه جميع الأمة معنى وفعلا ; كقوله أقم الصلاة لدلوك الشمس الآية . وقوله : فإذا قرأت القرآن فاستعذ بالله وقوله : وإذا كنت فيهم فأقمت لهم الصلاة فكل من دلكت عليه الشمس مخاطب بالصلاة . وكذلك كل من قرأ القرآن مخاطب بالاستعاذة . وكذلك كل من خاف يقيم الصلاة بتلك الصفة . ومن هذا القبيل قوله تعالى : خذ من أموالهم صدقة تطهرهم وتزكيهم بها . وعلى هذا المعنى جاء قوله تعالى : يا أيها النبي اتق الله و يا أيها النبي إذا طلقتم النساء .\nالثانية : قوله تعالى من أموالهم ذهب بعض العرب وهم دوس : إلى أن المال الثياب والمتاع والعروض . ولا تسمي العين مالا . وقد جاء هذا المعنى في السنة الثابتة من رواية مالك عن ثور بن زيد الديلي عن أبي الغيث سالم مولى ابن مطيع عن أبي هريرة قال : خرجنا مع رسول الله صلى الله عليه وسلم عام خيبر فلم نغنم ذهبا ولا ورقا إلا الأموال الثياب والمتاع . الحديث . وذهب غيرهم إلى أن المال الصامت من الذهب والورق . وقيل : الإبل خاصة ; ومنه قولهم : المال الإبل . وقيل : جميع الماشية . وذكر ابن الأنباري عن أحمد بن يحيى ثعلب النحوي قال : ما قصر عن بلوغ ما تجب فيه الزكاة من الذهب والورق فليس بمال ; وأنشد :\nوالله ما بلغت لي قط ماشية حد الزكاة ولا إبل ولا مال\nقال أبو عمر : والمعروف من كلام العرب أن كل ما تمول وتملك هو مال ; لقوله صلى الله عليه وسلم : يقول ابن آدم مالي مالي وإنما له من ماله ما أكل فأفنى أو لبس فأبلى أو تصدق فأمضى . وقال أبو قتادة : فأعطاني الدرع فابتعت به مخرفا في بني سلمة ; فإنه لأول مال تأثلته في الإسلام . فمن حلف بصدقة ماله كله فذلك على كل نوع من ماله ، سواء كان مما تجب فيه الزكاة أو لم يكن ; إلا أن ينوي شيئا بعينه فيكون على ما نواه . وقد قيل : إن ذلك على أموال الزكاة . والعلم محيط واللسان شاهد بأن ما تملك يسمى مالا . والله أعلم .\nالثالثة : قوله تعالى خذ من أموالهم صدقة مطلق غير مقيد بشرط في المأخوذ والمأخوذ منه ، ولا تبيين مقدار المأخوذ ولا المأخوذ منه . وإنما بيان ذلك في السنة والإجماع . حسب ما نذكره فتؤخذ الزكاة من جميع الأموال . وقد أوجب النبي صلى الله عليه وسلم الزكاة في المواشي والحبوب والعين ، وهذا ما لا خلاف فيه . واختلفوا فيما سوى ذلك كالخيل وسائر العروض . وسيأتي ذكر الخيل والعسل في ( النحل ) إن شاء الله . روى الأئمة عن أبي سعيد عن النبي صلى الله عليه وسلم أنه قال : ليس فيما دون خمسة أوسق من التمر صدقة وليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس ذود من الإبل صدقة . وقد مضى الكلام في ( الأنعام ) في زكاة الحبوب وما تنبته الأرض مستوفى . وفي المعادن في ( البقرة ) وفي الحلي في هذه السورة . وأجمع العلماء على أن الأوقية أربعون درهما ; فإذا ملك الحر المسلم مائتي درهم من فضة مضروبة - وهي الخمس أواق المنصوصة في الحديث - حولا كاملا فقد وجبت عليه صدقتها ، وذلك ربع عشرها خمسة دراهم . وإنما اشترط الحول لقوله عليه السلام : ليس في مال زكاة حتى يحول عليه الحول . أخرجه الترمذي . وما زاد على المائتي درهم من الورق فبحساب ذلك من كل شيء منه ربع عشره قل أو كثر ; هذا قول مالك والليث والشافعي وأكثر أصحاب أبي حنيفة وابن أبي ليلى والثوري والأوزاعي وأحمد بن حنبل وأبي ثور وإسحاق وأبي عبيد . وروي ذلك عن علي وابن عمر . وقالت طائفة : لا شيء فيما زاد على مائتي درهم حتى تبلغ الزيادة أربعين درهما ; فإذا بلغتها كان فيها درهم وذلك ربع عشرها . هذا قول سعيد بن المسيب والحسن وعطاء وطاوس والشعبي والزهري ومكحول وعمرو بن دينار وأبي حنيفة .\nالرابعة : وأما زكاة الذهب فالجمهور من العلماء على أن الذهب إذا كان عشرين دينارا قيمتها مائتا درهم فما زاد أن الزكاة فيها واجبة ; على حديث علي ، أخرجه الترمذي عن ضمرة والحارث عن علي . قال الترمذي : سألت محمد بن إسماعيل عن هذا الحديث فقال كلاهما عندي صحيح عن أبي إسحاق ، يحتمل أن يكون عنهما جميعا . وقال الباجي في المنتقى : وهذا الحديث ليس إسناده هناك ، غير أن اتفاق العلماء على الأخذ به دليل على صحة حكمه ، والله أعلم . وروي عن الحسن والثوري ، وإليه مال بعض أصحاب داود بن علي على أن الذهب لا زكاة فيه حتى يبلغ أربعين دينارا . وهذا يرده حديث علي وحديث ابن عمر وعائشة أن النبي صلى الله عليه وسلم كان يأخذ من كل عشرين دينارا نصف دينار ، ومن الأربعين دينارا دينارا ; على هذا جماعة أهل العلم إلا من ذكر .\nالخامسة : اتفقت الأمة على أن ما كان دون خمس ذود من الإبل فلا زكاة فيه . فإذا بلغت خمسا ففيها شاة . والشاة تقع على واحدة من الغنم ، والغنم الضأن والمعز جميعا . وهذا أيضا اتفاق من العلماء أنه ليس في خمس إلا شاة واحدة ; وهي فريضتها . وصدقة المواشي مبينة في الكتاب الذي كتبه الصديق لأنس لما وجهه إلى البحرين ; أخرجه البخاري وأبو داود والدارقطني والنسائي وابن ماجه وغيرهم ، وكله متفق عليه . والخلاف فيه في موضعين أحدهما في زكاة الإبل ، وهي إذا بلغت إحدى وعشرين ومائة فقال مالك : المصدق بالخيار إن شاء أخذ ثلاث بنات لبون ، وإن شاء أخذ حقتين . وقال ابن القاسم : وقال ابن شهاب : فيها ثلاث بنات لبون إلى أن تبلغ ثلاثين ومائة فتكون فيها حقة وابنتا لبون . قال ابن القاسم : ورأيي على قول ابن شهاب . وذكر ابن حبيب أن عبد العزيز بن أبي سلمة وعبد العزيز بن أبي حازم وابن دينار يقولون بقول مالك . وأما الموضع الثاني فهو في صدقة الغنم وهي إذا زادت على ثلاثمائة شاة وشاة ; فإن الحسن بن صالح بن حي قال : فيها أربع شياه . وإذا كانت أربعمائة شاة وشاة ففيها خمس شياه ; وهكذا كلما زادت ، في كل مائة شاة . وروي عن إبراهيم النخعي مثله . وقال الجمهور : في مائتي شاة وشاة ثلاث شياه ، ثم لا شيء فيها إلى أربعمائة فيكون فيها أربع شياه ; ثم كلما زادت مائة ففيها شاة ; إجماعا واتفاقا . قال ابن عبد البر : وهذه مسألة وهم فيها ابن المنذر ، وحكى فيها عن العلماء الخطأ ، وخلط وأكثر الغلط .\nالسادسة : لم يذكر البخاري ولا مسلم في صحيحيهما تفصيل زكاة البقر . وخرجه أبو داود والترمذي والنسائي والدارقطني ومالك في موطئه وهي مرسلة ومقطوعة وموقوفة . قال أبو عمر : وقد رواه قوم عن طاوس عن معاذ ، إلا أن الذين أرسلوه أثبت من الذين أسندوه . وممن أسنده بقية عن المسعودي عن الحكم عن طاوس . وقد اختلفوا فيما ينفرد به بقية عن الثقات . ورواه الحسن بن عمارة عن الحكم كما رواه بقية عن المسعودي عن الحكم ، والحسن مجتمع على ضعفه . وقد روي هذا الخبر بإسناد متصل صحيح ثابت من غير رواية طاوس ; ذكره عبد الرزاق قال : أخبرنا معمر والثوري عن الأعمش عن أبي وائل عن مسروق عن معاذ بن جبل قال : بعثني رسول الله عليه وسلم إلى اليمن فأمره أن يأخذ من كل ثلاثين بقرة تبيعا أو تبيعة ، ومن أربعين مسنة ، ومن كل حالم دينارا أو عدله معافر ; ذكره الدارقطني وأبو عيسى الترمذي وصححه . قال أبو عمر . ولا خلاف بين العلماء أن الزكاة في زكاة البقر عن النبي صلى الله عليه وسلم وأصحابه ما قال معاذ بن جبل : في ثلاثين بقرة تبيع ، وفي أربعين مسنة إلا شيء روي عن سعيد بن المسيب وأبي قلابة والزهري وقتادة ; فإنهم يوجبون في كل خمس من البقر شاة إلى ثلاثين . فهذه جملة من تفصيل الزكاة بأصولها وفروعها في كتب الفقه . ويأتي ذكر الخلطة في سورة ( ص ) إن شاء الله تعالى .\nالسابعة : قوله تعالى ( صدقة ) مأخوذ من الصدق ; إذ هي دليل على صحة إيمانه ، وصدق باطنه مع ظاهره ، وأنه ليس من المنافقين الذين يلمزون المطوعين من المؤمنين في الصدقات . ( تطهرهم وتزكيهم بها ) حالين للمخاطب ; التقدير : خذها مطهرا لهم ومزكيا لهم بها . ويجوز أن يجعلهما صفتين للصدقة ; أي صدقة مطهرة لهم مزكية ، ويكون فاعل ( تزكيهم ) المخاطب ، ويعود الضمير الذي في ( بها ) على الموصوف المنكر . وحكى النحاس ومكي أن ( تطهرهم ) من صفة الصدقة ( وتزكيهم بها ) حال من الضمير في ( خذ ) وهو النبي صلى الله عليه وسلم . ويحتمل أن تكون حالا من الصدقة ، وذلك ضعيف لأنها حال من نكرة . وقال الزجاج : والأجود أن تكون المخاطبة للنبي صلى الله عليه وسلم ; أي فإنك ( تطهرهم وتزكيهم بها ) ، على القطع والاستئناف . ويجوز الجزم على جواب الأمر ، والمعنى : إن تأخذ من أموالهم صدقة تطهرهم وتزكيهم ; ومنه قول امرئ القيس :\nقفا نبك من ذكرى حبيب ومنزل\nوقرأ الحسن \" تطهرهم \" بسكون الطاء وهو منقول بالهمزة من طهر وأطهرته ، مثل ظهر وأظهرته .\nالثامنة : قوله تعالى وصل عليهم أصل في فعل كل إمام يأخذ الصدقة أن يدعو للمتصدق بالبركة . روى مسلم عن عبد الله بن أبي أوفى قال : كان رسول الله صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال : اللهم صل عليهم . فأتاه ابن أبي أوفى بصدقته فقال : اللهم صل على آل أبي أوفى . ذهب قوم إلى هذا ، وذهب آخرون إلى أن هذا منسوخ بقوله تعالى : ولا تصل على أحد منهم مات أبدا . قالوا : فلا يجوز أن يصلى على أحد إلا على النبي صلى الله عليه وسلم وحده خاصة ; لأنه خص بذلك . واستدلوا بقوله تعالى : لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا الآية . وبأن عبد الله بن عباس كان يقول : لا يصلى على أحد إلا على النبي صلى الله عليه وسلم . والأول أصح ; فإن الخطاب ليس مقصورا عليه كما تقدم ; ويأتي في الآية بعد هذا . فيجب الاقتداء برسول الله صلى الله عليه وسلم ، والتأسي به ; لأنه كان يمتثل قوله : وصل عليهم إن صلاتك سكن لهم أي إذا دعوت لهم حين يأتون بصدقاتهم سكن ذلك قلوبهم وفرحوا به . وقد روى جابر بن عبد الله قال : أتاني النبي صلى الله عليه وسلم فقلت لامرأتي : لا تسألي رسول الله صلى الله عليه وسلم شيئا ; فقالت : يخرج رسول الله صلى الله عليه وسلم من عندنا ولا نسأله شيئا! فقالت : يا رسول الله ; صل على زوجي . فقال رسول الله صلى الله عليه وسلم : صلى الله عليك وعلى زوجك . والصلاة هنا الرحمة والترحم . قال النحاس : وحكى أهل اللغة جميعا فيما علمناه أن الصلاة في كلام العرب الدعاء ; ومنه الصلاة على الجنائز . وقرأ حفص وحمزة والكسائي : إن صلاتك بالتوحيد . وجمع الباقون . وكذلك الاختلاف في أصلاتك تأمرك وقرئ ( سكن ) بسكون الكاف . قال قتادة : معناه وقار لهم . والسكن : ما تسكن به النفوس وتطمئن به القلوب .\n                                    ",
        "saadi": "خُذۡ مِنۡ أَمۡوَٰلِهِمۡ صَدَقَةٗ تُطَهِّرُهُمۡ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيۡهِمۡۖ إِنَّ صَلَوٰتَكَ سَكَنٞ لَّهُمۡۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٣٠١\n                                        \n                                        \n                                        \n                                        قال تعالى لرسوله ومن قام مقامه، آمرا له بما يطهر المؤمنين، ويتمم إيمانهم‏:‏ ‏{‏خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً‏}‏ وهي الزكاة المفروضة، ‏{‏تُطَهِّرُهُمْ وَتُزَكِّيهِمْ بِهَا‏}‏ أي‏:‏ تطهرهم من الذنوب والأخلاق الرذيلة‏.‏\n‏{‏وَتُزَكِّيهِمْ‏}‏ أي‏:‏ تنميهم، وتزيد في أخلاقهم الحسنة، وأعمالهم الصالحة، وتزيد في ثوابهم الدنيوي والأخروي، وتنمي أموالهم‏.‏\n‏{‏وَصَلِّ عَلَيْهِمْ‏}‏ أي‏:‏ ادع لهم، أي‏:‏ للمؤمنين عموما وخصوصا عندما يدفعون إليك زكاة أموالهم‏.‏\n‏{‏إِنَّ صَلَاتَكَ سَكَنٌ لَهُمْ‏}‏ أي‏:‏ طمأنينة لقلوبهم، واستبشار لهم، ‏{‏وَاللَّهُ سَمِيعٌ‏}‏ لدعائك، سمع إجابة وقبول‏.‏\n‏{‏عَلِيمٌ‏}‏ بأحوال العباد ونياتهم، فيجازي كل عامل بعمله، وعلى قدر نيته، فكان النبي ـ صلى الله عليه وسلم ـ يمتثل لأمر اللّه، ويأمرهم بالصدقة، ويبعث عماله لجبايتها، فإذا أتاه أحد بصدقته دعا له وبرَّك‏.‏\nففي هذه الآية، دلالة على وجوب الزكاة، في جميع الأموال، وهذا إذا كانت للتجارة ظاهرة، فإنها أموال تنمى ويكتسب بها، فمن العدل أن يواسى منها الفقراء، بأداء ما أوجب اللّه فيها من الزكاة‏.‏\nوما عدا أموال التجارة، فإن كان المال ينمى، كالحبوب، والثمار، والماشية المتخذة للنماء والدر والنسل، فإنها تجب فيها الزكاة، وإلا لم تجب فيها، لأنها إذا كانت للقنية، لم تكن بمنزلة الأموال التي يتخذها الإنسان في العادة، مالا يتمول، ويطلب منه المقاصد المالية، وإنما صرف عن المالية بالقنية ونحوها‏.‏\nوفيها‏:‏ أن العبد لا يمكنه أن يتطهر ويتزكى حتى يخرج زكاة ماله، وأنه لا يكفرها شيء سوى أدائها، لأن الزكاة والتطهير متوقف على إخراجها‏.‏\nوفيها‏:‏ استحباب الدعاء من الإمام أو نائبه لمن أدى زكاته بالبركة، وأن ذلك ينبغي، أن يكون جهرا، بحيث يسمعه المتصدق فيسكن إليه‏.‏\nويؤخذ من المعنى، أنه ينبغي إدخال السرور على المؤمن بالكلام اللين، والدعاء له، ونحو ذلك مما يكون فيه طمأنينة، وسكون لقلبه‏.‏ وأنه ينبغي تنشيط من أنفق نفقة وعمل عملا صالحا بالدعاء له والثناء، ونحو ذلك‏.‏\n                                    "
      },
      "originalText": "خُذۡ مِنۡ أَمۡوَٰلِهِمۡ صَدَقَةٗ تُطَهِّرُهُمۡ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيۡهِمۡۖ إِنَّ صَلَوٰتَكَ سَكَنٞ لَّهُمۡۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٣٠١"
    },
    {
      "number": 1339,
      "text": "أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَأْخُذُ الصَّدَقَاتِ وَأَنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 104,
      "juz": 11,
      "manzil": 2,
      "page": 203,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٤٠١\n                                    \n                                    \n                                    وقوله : ( ألم يعلموا أن الله هو يقبل التوبة عن عباده ويأخذ الصدقات ) هذا تهييج إلى التوبة والصدقة اللتين كل منها يحط الذنوب ويمحصها ويمحقها .\nوأخبر تعالى أن كل من تاب إليه تاب عليه ، ومن تصدق بصدقة من كسب حلال فإن الله تعالى يتقبلها بيمينه فيربيها لصاحبها ، حتى تصير التمرة مثل أحد . كما جاء بذلك الحديث ، عن رسول الله صلى الله عليه وسلم - كما قال الثوري ووكيع ، كلاهما عن عباد بن منصور ، عن القاسم بن محمد أنه سمع أبا هريرة يقول : قال رسول الله صلى الله عليه وسلم : \" إن الله يقبل الصدقة ويأخذها بيمينه فيربيها لأحدكم ، كما يربي أحدكم مهره ، حتى إن اللقمة لتصير مثل أحد \" ، وتصديق ذلك في كتاب الله ، عز وجل : ( [ ألم يعلموا أن الله ] هو يقبل التوبة عن عباده ويأخذ الصدقات ) و [ قوله ] ( يمحق الله الربا ويربي الصدقات ) [ البقرة : 276 ] .\nوقال الثوري والأعمش كلاهما ، عن عبد الله بن السائب ، عن عبد الله بن أبي قتادة قال : قال عبد الله بن مسعود ، رضي الله عنه : إن الصدقة تقع في يد الله عز وجل قبل أن تقع في يد السائل . ثم قرأ هذه الآية : ( ألم يعلموا أن الله هو يقبل التوبة عن عباده ويأخذ الصدقات ) .\nوقد روى ابن عساكر في تاريخه ، في ترجمة عبد الله بن الشاعر السكسكي الدمشقي - وأصله حمصي ، وكان أحد الفقهاء ، روى عن معاوية وغيره ، وحكى عنه حوشب بن سيف السكسكي الحمصي - قال : غزا الناس في زمان معاوية ، رضي الله عنه ، وعليهم عبد الرحمن بن خالد بن الوليد ، فغل رجل من المسلمين مائة دينار رومية . فلما قفل الجيش ندم وأتى الأمير ، فأبى أن يقبلها منه ، وقال : قد تفرق الناس ولن أقبلها منك ، حتى تأتي الله بها يوم القيامة فجعل الرجل يستقرئ الصحابة ، فيقولون له مثل ذلك ، فلما قدم دمشق ذهب إلى معاوية ليقبلها منه ، فأبى عليه . فخرج من عنده وهو يبكي ويسترجع ، فمر بعبد الله بن الشاعر السكسكي ، فقال له : ما يبكيك ؟ فذكر له أمره ، فقال أمطيعني أنت ؟ فقال : نعم ، فقال : اذهب إلى معاوية فقل له : اقبل مني خمسك ، فادفع إليه عشرين دينارا ، وانظر الثمانين الباقية فتصدق بها عن ذلك الجيش ، فإن الله يقبل التوبة عن عباده ، وهو أعلم بأسمائهم ومكانهم ففعل الرجل ، فقال معاوية ، رضي الله عنه : لأن أكون أفتيته بها أحب إلي من كل شيء أملكه ، أحسن الرجل \" .\n                                    ",
        "qortoby": "أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٤٠١\n                                    \n                                    \n                                    قوله تعالى ألم يعلموا أن الله هو يقبل التوبة عن عباده ويأخذ الصدقات وأن الله هو التواب الرحيم فيه مسألتان :\nقيل : قال الذين لم يتوبوا من المتخلفين : هؤلاء كانوا معنا بالأمس ، لا يكلمون ولا يجالسون ، فما لهم الآن ؟ وما هذه الخاصة التي خصوا بها دوننا ; فنزلت : ألم يعلموا فالضمير في ( يعلموا ) عائد إلى الذين لم يتوبوا من المتخلفين . قال معناه ابن زيد . ويحتمل أن يعود إلى الذين تابوا وربطوا أنفسهم . وقوله تعالى : ( هو ) تأكيد لانفراد الله سبحانه وتعالى بهذه الأمور . وتحقيق ذلك أنه لو قال : إن الله يقبل التوبة لاحتمل أن يكون قبول رسوله قبولا منه ; فبينت الآية أن ذلك مما لا يصل إليه نبي ولا ملك .\nالثانية : قوله تعالى ويأخذ الصدقات ويأخذ الصدقات هذا نص صريح في أن الله تعالى هو الآخذ لها والمثيب عليها وأن الحق له جل وعز ، والنبي صلى الله عليه وسلم واسطة ، فإن توفي فعامله هو الواسطة بعده ، والله عز وجل حي لا يموت . وهذا يبين أن قوله سبحانه وتعالى : خذ من أموالهم صدقة ليس مقصورا على النبي صلى الله عليه وسلم : روى الترمذي عن أبي هريرة قال ، قال رسول الله صلى الله عليه وسلم : إن الله يقبل الصدقة ويأخذها بيمينه فيربيها لأحدكم كما يربي أحدكم مهره حتى أن اللقمة لتصير مثل أحد وتصديق ذلك في كتاب الله وهو الذي يقبل التوبة عن عباده ويأخذ الصدقات و يمحق الله الربا ويربي الصدقات . قال : هذا حديث حسن صحيح . وفي صحيح مسلم : لا يتصدق أحد بتمرة من كسب طيب إلا أخذها الله بيمينه - في رواية : فتربو في كف الرحمن - حتى تكون أعظم من الجبل الحديث . وروي إن الصدقة لتقع في كف الرحمن قبل أن تقع في كف السائل فيربيها كما يربي أحدكم فلوه أو فصيله والله يضاعف لمن يشاء قال علماؤنا رحمة الله عليهم في تأويل هذه الأحاديث : إن هذا كناية عن القبول والجزاء عليها ; كما كنى بنفسه الكريمة المقدسة عن المريض تعطفا عليه بقوله : يا ابن آدم مرضت فلم تعدني . . . الحديث . وقد تقدم هذا المعنى في ( البقرة ) . وخص اليمين والكف بالذكر إذ كل قابل لشيء إنما يأخذه بكفه وبيمينه أو يوضع له فيه ; فخرج على ما يعرفونه ، والله جل وعز منزه عن الجارحة . وقد جاءت اليمين في كلام العرب بغير معنى الجارحة ; كما قال الشاعر :\nإذا ما راية رفعت لمجد تلقاها عرابة باليمين\nأي هو مؤهل للمجد والشرف ، ولم يرد بها يمين الجارحة ؛ لأن المجد معنى فاليمين التي تتلقى به رايته معنى . وكذلك اليمين في حق الله تعالى . وقد قيل : إن معنى تربو في كف الرحمن عبارة عن كفة الميزان التي توزن فيها الأعمال ، فيكون من باب حذف المضاف ; كأنه قال . فتربو كفة ميزان الرحمن . وروي عن مالك والثوري وابن المبارك أنهم قالوا في تأويل هذه الأحاديث وما شابهها : أمروها بلا كيف ; قاله الترمذي وغيره . وهكذا قول أهل العلم من أهل السنة والجماعة .\n                                    ",
        "saadi": "أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٤٠١\n                                        \n                                        \n                                        \n                                        أي‏:‏ أما علموا سعة رحمة اللّه وعموم كرمه وأنه ‏{‏يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ‏}‏ التائبين من أي ذنب كان، بل يفرح تعالى بتوبة عبده، إذا تاب أعظم فرح يقدر‏.‏\n‏{‏وَيَأْخُذُ الصَّدَقَاتِ‏}‏ منهم أي‏:‏ يقبلها، ويأخذها بيمينه، فيربيها لأحدهم كما يربي الرجل فلوه، حتى تكون التمرة الواحدة كالجبل العظيم، فكيف بما هو أكبر وأكثر من ذلك‏.‏\n‏{‏وَأَنَّ اللَّهَ هُوَ التَّوَّابُ‏}‏ أي‏:‏ كثير التوبة على التائبين، فمن تاب إليه تاب عليه، ولو تكررت منه ‏[‏المعصية‏]‏ مرارا‏.‏ ولا يمل اللّه من التوبة على عباده، حتى يملوا هم، ويأبوا إلا النفار والشرود عن بابه، وموالاتهم عدوهم‏.‏\n‏{‏الرَّحِيمِ‏}‏ الذي وسعت رحمته كل شيء، وكتبها للذين يتقون، ويؤتون الزكاة، ويؤمنون بآياته، ويتبعون رسوله‏.‏\n                                    "
      },
      "originalText": "أَلَمۡ يَعۡلَمُوٓاْ أَنَّ ٱللَّهَ هُوَ يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَأۡخُذُ ٱلصَّدَقَٰتِ وَأَنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٤٠١"
    },
    {
      "number": 1340,
      "text": "وَقُلِ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ وَالْمُؤْمِنُونَ ۖ وَسَتُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 105,
      "juz": 11,
      "manzil": 2,
      "page": 203,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقُلِ ٱعۡمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ وَٱلۡمُؤۡمِنُونَۖ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ ٥٠١\n                                    \n                                    \n                                    قال مجاهد : هذا وعيد ، يعني من الله تعالى للمخالفين أوامره بأن أعمالهم ستعرض عليه تبارك وتعالى ، وعلى الرسول ، وعلى المؤمنين . وهذا كائن لا محالة يوم القيامة ، كما قال : ( يومئذ تعرضون لا تخفى منكم خافية ) [ الحاقة : 18 ] ، وقال تعالى : ( يوم تبلى السرائر ) [ الطارق : 9 ] ، وقال ( وحصل ما في الصدور ) [ العاديات : 10 ] وقد يظهر ذلك للناس في الدنيا ، كما قال الإمام أحمد :\nحدثنا حسن بن موسى ، حدثنا ابن لهيعة ، حدثنا دراج ، عن أبي الهيثم ، عن أبي سعيد ، عن رسول الله صلى الله عليه وسلم أنه قال : \" لو أن أحدكم يعمل في صخرة صماء ليس لها باب ولا كوة ، لأخرج الله عمله للناس كائنا ما كان \" . .\nوقد ورد : أن أعمال الأحياء تعرض على الأموات من الأقرباء والعشائر في البرزخ ، كما قال أبو داود الطيالسي : حدثنا الصلت بن دينار ، عن الحسن ، عن جابر بن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" إن أعمالكم تعرض على أقربائكم وعشائركم في قبورهم ، فإن كان خيرا استبشروا به ، وإن كان غير ذلك قالوا : \" اللهم ، ألهمهم أن يعملوا بطاعتك \" .\nوقال الإمام أحمد : أخبرنا عبد الرزاق ، عن سفيان ، عمن سمع أنسا يقول : قال النبي صلى الله عليه وسلم : \" إن أعمالكم تعرض على أقاربكم وعشائركم من الأموات ، فإن كان خيرا استبشروا به ، وإن كان غير ذلك قالوا : اللهم ، لا تمتهم حتى تهديهم كما هديتنا \" .\nوقال البخاري : قالت عائشة ، رضي الله عنها : إذا أعجبك حسن عمل امرئ ، فقل : ( اعملوا فسيرى الله عملكم ورسوله والمؤمنون ) .\nوقد ورد في الحديث شبيه بهذا ، قال الإمام أحمد :\nحدثنا يزيد ، حدثنا حميد ، عن أنس ، أن رسول الله صلى الله عليه وسلم قال : \" لا عليكم أن تعجبوا بأحد حتى تنظروا بم يختم له ؟ فإن العامل يعمل زمانا من عمره - أو : برهة من دهره - بعمل صالح لو مات عليه لدخل الجنة ، ثم يتحول فيعمل عملا سيئا ، وإن العبد ليعمل البرهة من دهره بعمل سيئ ، لو مات عليه دخل النار ، ثم يتحول فيعمل عملا صالحا ، وإذا أراد الله بعبد خيرا استعمله قبل موته \" . قالوا : يا رسول الله وكيف يستعمله : قال : \" يوفقه لعمل صالح ثم يقبضه عليه \" تفرد به أحمد من هذا الوجه .\n                                    ",
        "qortoby": "وَقُلِ ٱعۡمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ وَٱلۡمُؤۡمِنُونَۖ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ ٥٠١\n                                    \n                                    \n                                    قوله تعالى وقل اعملوا فسيرى الله عملكم ورسوله والمؤمنون وستردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون\nقوله تعالى وقل اعملوا خطاب للجميع . فسيرى الله عملكم ورسوله والمؤمنون أي بإطلاعه إياهم على أعمالكم . وفي الخبر : لو أن رجلا عمل في صخرة لا باب لها ولا كوة لخرج عمله إلى الناس كائنا ما كان .\n                                    ",
        "saadi": "وَقُلِ ٱعۡمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ وَٱلۡمُؤۡمِنُونَۖ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ ٥٠١\n                                        \n                                        \n                                        \n                                        يقول تعالى‏:‏ ‏{‏وَقُلْ‏}‏ لهؤلاء المنافقين‏:‏ ‏{‏اعْمَلُوا‏}‏ ما ترون من الأعمال، واستمروا على باطلكم، فلا تحسبوا أن ذلك، سيخفى‏.‏\n‏{‏فَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ وَالْمُؤْمِنُونَ‏}‏ أي‏:‏ لا بد أن يتبين عملكم ويتضح، ‏{‏وَسَتُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ‏}‏ من خير وشر، ففي هذا التهديد والوعيد الشديد على من استمر على باطله وطغيانه وغيه وعصيانه‏.‏\nويحتمل أن المعنى‏:‏ أنكم مهما عملتم من خير أوشر، فإن اللّه مطلع عليكم، وسيطلع رسوله وعباده المؤمنين على أعمالكم ولو كانت باطنة‏.‏\n                                    "
      },
      "originalText": "وَقُلِ ٱعۡمَلُواْ فَسَيَرَى ٱللَّهُ عَمَلَكُمۡ وَرَسُولُهُۥ وَٱلۡمُؤۡمِنُونَۖ وَسَتُرَدُّونَ إِلَىٰ عَٰلِمِ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ ٥٠١"
    },
    {
      "number": 1341,
      "text": "وَآخَرُونَ مُرْجَوْنَ لِأَمْرِ اللَّهِ إِمَّا يُعَذِّبُهُمْ وَإِمَّا يَتُوبُ عَلَيْهِمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 106,
      "juz": 11,
      "manzil": 2,
      "page": 203,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَءَاخَرُونَ مُرۡجَوۡنَ لِأَمۡرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمۡ وَإِمَّا يَتُوبُ عَلَيۡهِمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٦٠١\n                                    \n                                    \n                                    قال ابن عباس ومجاهد وعكرمة ، والضحاك وغير واحد : هم الثلاثة الذين خلفوا ، أي : عن التوبة ، وهم : مرارة بن الربيع ، وكعب بن مالك ، وهلال بن أمية ، قعدوا عن غزوة تبوك في جملة من قعد ، كسلا وميلا إلى الدعة والحفظ وطيب الثمار والظلال ، لا شكا ونفاقا ، فكانت منهم طائفة ربطوا أنفسهم بالسواري ، كما فعل أبو لبابة وأصحابه ، وطائفة لم يفعلوا ذلك وهم هؤلاء الثلاثة المذكورون ، فنزلت توبة أولئك قبل هؤلاء ، وأرجى هؤلاء عن التوبة حتى نزلت الآية الآتية ، وهي قوله : ( لقد تاب الله على النبي والمهاجرين والأنصار ) الآية [ التوبة : 117 ] ، ( وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت [ وضاقت عليهم أنفسهم ] ) الآية [ التوبة : 118 ] ، كما سيأتي بيانه في حديث كعب بن مالك .\nوقوله : ( إما يعذبهم وإما يتوب عليهم ) أي : هم تحت عفو الله ، إن شاء فعل بهم هذا ، وإن شاء فعل بهم ذاك ، ولكن رحمته تغلب غضبه ، وهو ( عليم حكيم ) أي : عليم بمن يستحق العقوبة ممن يستحق العفو ، حكيم في أفعاله وأقواله ، لا إله إلا هو ، ولا رب سواه .\n                                    ",
        "qortoby": "وَءَاخَرُونَ مُرۡجَوۡنَ لِأَمۡرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمۡ وَإِمَّا يَتُوبُ عَلَيۡهِمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٦٠١\n                                    \n                                    \n                                    قوله تعالى وآخرون مرجون لأمر الله إما يعذبهم وإما يتوب عليهم والله عليم حكيم\nنزلت في الثلاثة الذين تيب عليهم : كعب بن مالك وهلال بن أمية من بني واقف ومرارة بن الربيع ; وقيل : ابن ربعي العمري ; ذكره المهدوي . كانوا قد تخلفوا عن تبوك وكانوا مياسر ; على ما يأتي من ذكرهم .\nوالتقدير : ومنهم آخرون مرجون ; من أرجأته أي أخرته . ومنه قيل : مرجئة ; لأنهم أخروا العمل . وقرأ حمزة والكسائي ( مرجون ) بغير همز ; فقيل : هو من أرجيته أي أخرته . وقال المبرد : لا يقال أرجيته بمعنى أخرته ، ولكن يكون من الرجاء .\nإما يعذبهم وإما يتوب عليهم ( إما ) في العربية لأحد أمرين ، والله عز وجل عالم بمصير الأشياء ، ولكن المخاطبة للعباد على ما يعرفون ; أي ليكن أمرهم عندكم على الرجاء لأنه ليس للعباد أكثر من هذا .\n                                    ",
        "saadi": "وَءَاخَرُونَ مُرۡجَوۡنَ لِأَمۡرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمۡ وَإِمَّا يَتُوبُ عَلَيۡهِمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٦٠١\n                                        \n                                        \n                                        \n                                        أي‏:‏ ‏{‏وَآخَرُونَ‏}‏ من المخلفين مؤخرون ‏{‏لِأَمْرِ اللَّهِ إِمَّا يُعَذِّبُهُمْ وَإِمَّا يَتُوبُ عَلَيْهِمْ‏}‏ ففي هذا التخويف الشديد للمتخلفين، والحث لهم على التوبة والندم‏.‏\n‏{‏وَاللَّهُ عَلِيمٌ‏}‏ بأحوال العباد ونياتهم ‏{‏حَكِيمٌ‏}‏ يضع الأشياء مواضعها، وينزلها منازلها، فإن اقتضت حكمته أن يغفر لهم ويتوب عليهم غفر لهم وتاب عليهم، وإن اقتضت حكمته أن يخذلهم ولا يوفقهم للتوبة، فعل ذلك‏.‏\n                                    "
      },
      "originalText": "وَءَاخَرُونَ مُرۡجَوۡنَ لِأَمۡرِ ٱللَّهِ إِمَّا يُعَذِّبُهُمۡ وَإِمَّا يَتُوبُ عَلَيۡهِمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٦٠١"
    }
  ]
}