{
  "number": 204,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 1342,
      "text": "وَالَّذِينَ اتَّخَذُوا مَسْجِدًا ضِرَارًا وَكُفْرًا وَتَفْرِيقًا بَيْنَ الْمُؤْمِنِينَ وَإِرْصَادًا لِمَنْ حَارَبَ اللَّهَ وَرَسُولَهُ مِنْ قَبْلُ ۚ وَلَيَحْلِفُنَّ إِنْ أَرَدْنَا إِلَّا الْحُسْنَىٰ ۖ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 107,
      "juz": 11,
      "manzil": 2,
      "page": 204,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ ٧٠١\n                                    \n                                    \n                                    سبب نزول هذه الآيات الكريمات : أنه كان بالمدينة قبل مقدم رسول الله صلى الله عليه وسلم إليها رجل من الخزرج يقال له : \" أبو عامر الراهب \" ، وكان قد تنصر في الجاهلية وقرأ علم أهل الكتاب ، وكان فيه عبادة في الجاهلية ، وله شرف في الخزرج كبير . فلما قدم رسول الله صلى الله عليه وسلم مهاجرا إلى المدينة ، واجتمع المسلمون عليه ، وصارت للإسلام كلمة عالية ، وأظهرهم الله يوم بدر ، شرق اللعين أبو عامر بريقه ، وبارز بالعداوة ، وظاهر بها ، وخرج فارا إلى كفار مكة من مشركي قريش فألبهم على حرب رسول الله صلى الله عليه وسلم ، فاجتمعوا بمن وافقهم من أحياء العرب ، وقدموا عام أحد ، فكان من أمر المسلمين ما كان ، وامتحنهم الله ، وكانت العاقبة للمتقين .\nوكان هذا الفاسق قد حفر حفائر فيما بين الصفين ، فوقع في إحداهن رسول الله صلى الله عليه وسلم ، وأصيب ذلك اليوم ، فجرح في وجهه وكسرت رباعيته اليمنى السفلى ، وشج رأسه ، صلوات الله وسلامه عليه .\nوتقدم أبو عامر في أول المبارزة إلى قومه من الأنصار ، فخاطبهم واستمالهم إلى نصره وموافقته ، فلما عرفوا كلامه قالوا : لا أنعم الله بك عينا يا فاسق يا عدو الله ، ونالوا منه وسبوه . فرجع وهو يقول : والله لقد أصاب قومي بعدي شر . وكان رسول الله صلى الله عليه وسلم قد دعاه إلى الله قبل فراره ، وقرأ عليه من القرآن ، فأبى أن يسلم وتمرد ، فدعا عليه رسول الله صلى الله عليه وسلم أن يموت بعيدا طريدا ، فنالته هذه الدعوة .\nوذلك أنه لما فرغ الناس من أحد ، ورأى أمر الرسول ، صلوات الله وسلامه عليه في ارتفاع وظهور ، ذهب إلىهرقل ، ملك الروم ، يستنصره على النبي صلى الله عليه وسلم ، فوعده ومناه ، وأقام عنده ، وكتب إلى جماعة من قومه من الأنصار من أهل النفاق والريب يعدهم ويمنيهم أنه سيقدم بجيش يقاتل به رسول الله صلى الله عليه وسلم ويغلبه ويرده عما هو فيه ، وأمرهم أن يتخذوا له معقلا يقدم عليهم فيه من يقدم من عنده لأداء كتبه ويكون مرصدا له إذا قدم عليهم بعد ذلك ، فشرعوا في بناء مسجد مجاور لمسجد قباء ، فبنوه وأحكموه ، وفرغوا منه قبل خروج النبي صلى الله عليه وسلم إلى تبوك ، وجاءوا فسألوا رسول الله صلى الله عليه وسلم أن يأتي إليهم فيصلي في مسجدهم ، ليحتجوا بصلاته ، عليه السلام ، فيه على تقريره وإثباته ، وذكروا أنهم إنما بنوه للضعفاء منهم وأهل العلة في الليلة الشاتية ، فعصمه الله من الصلاة فيه فقال : \" إنا على سفر ، ولكن إذا رجعنا إن شاء الله \" .\nفلما قفل ، عليه السلام راجعا إلى المدينة من تبوك ، ولم يبق بينه وبينها إلا يوم أو بعض يوم ، نزل عليه الوحي بخبر مسجد الضرار ، وما اعتمده بانوه من الكفر والتفريق بين جماعة المؤمنين في مسجدهم مسجد قباء ، الذي أسس من أول يوم على التقوى . فبعث رسول الله صلى الله عليه وسلم إلى ذلك المسجد من هدمه قبل مقدمه المدينة ، كما قال علي بن أبي طلحة ، عن ابن عباس في قوله : ( والذين اتخذوا مسجدا ضرارا [ وكفرا وتفريقا بين المؤمنين ] ) وهم أناس من الأنصار ، ابتنوا مسجدا ، فقال لهم أبو عامر ، ابنوا مسجدا واستعدوا بما استطعتم من قوة ومن سلاح ، فإني ذاهب إلى قيصر ملك الروم ، فآتي بجند من الروم وأخرج محمدا وأصحابه . فلما فرغوا من مسجدهم أتوا النبي صلى الله عليه وسلم فقالوا : قد فرغنا من بناء مسجدنا ، فنحب أن تصلي فيه وتدعو لنا بالبركة . فأنزل الله ، عز وجل : ( لا تقم فيه أبدا لمسجد أسس على التقوى من أول يوم ) إلى ( والله لا يهدي القوم الظالمين ) .\nوكذا روي عن سعيد بن جبير ، ومجاهد ، وعروة بن الزبير ، وقتادة وغير واحد من العلماء .\nوقال محمد بن إسحاق بن يسار ، عن الزهري ، ويزيد بن رومان ، وعبد الله بن أبي بكر ، وعاصم بن عمر بن قتادة وغيرهم ، قالوا : أقبل رسول الله صلى الله عليه وسلم - يعني : من تبوك - حتى نزل بذي أوان - بلد بينه وبين المدينة ساعة من نهار - وكان أصحاب مسجد الضرار قد كانوا أتوه وهو يتجهز إلى تبوك ، فقالوا : يا رسول الله ، إنا قد بنينا مسجدا لذي العلة والحاجة ، والليلة المطيرة ، والليلة الشاتية ، وإنا نحب أن تأتينا فتصلي لنا فيه . فقال : \" إني على جناح سفر وحال شغل - أو كما قال رسول الله صلى الله عليه وسلم - ولو قد قدمنا إن شاء الله تعالى أتيناكم فصلينا لكم فيه \" . فلما نزل بذي أوان أتاه خبر المسجد ، فدعا رسول الله صلى الله عليه وسلم مالك بن الدخشم أخا بني سالم بن عوف ، ومعن بن عدي - أو : أخاه عامر بن عدي - أخا بلعجلان فقال : \" انطلقا إلى هذا المسجد الظالم أهله ، فاهدماه وحرقاه \" . فخرجا سريعين حتى أتيا بني سالم بن عوف ، وهم رهط مالك بن الدخشم ، فقال مالك لمعن : أنظرني حتى أخرج إليك بنار من أهلي . فدخل أهله فأخذ سعفا من النخل ، فأشعل فيه نارا ، ثم خرجا يشتدان حتى دخلا المسجد وفيه أهله ، فحرقاه وهدماه وتفرقوا عنه . ونزل فيهم من القرآن ما نزل : ( والذين اتخذوا مسجدا ضرارا وكفرا ) إلى آخر القصة . وكان الذين بنوه اثني عشر رجلا خذام بن خالد ، من بني عبيد بن زيد ، أحد بني عمرو بن عوف ، ومن داره أخرج مسجد الشقاق ، وثعلبة بن حاطب من بني عبيد وهو إلى بني أمية بن زيد ، ومعتب بن قشير ، من [ بني ] ضبيعة بن زيد ، وأبو حبيبة بن الأذعر ، من بني ضبيعة بن زيد ، وعباد بن حنيف ، أخو سهل بن حنيف ، من بني عمرو بن عوف ، وجارية بن عامر ، وابناه : مجمع بن جارية ، وزيد بن جارية ونبتل [ بن ] الحارث ، وهم من بني ضبيعة ، وبحزج وهو من بني ضبيعة ، وبجاد بن عثمان وهو من بني ضبيعة ، [ ووديعة بن ثابت ، وهو إلى بني أمية ] رهط أبي لبابة بن عبد المنذر .\nوقوله : ( وليحلفن ) أي : الذين بنوه ( إن أردنا إلا الحسنى ) أي : ما أردناه ببنيانه إلا خيرا ورفقا بالناس ، قال الله تعالى : ( والله يشهد إنهم لكاذبون ) أي : فيما قصدوا وفيما نووا ، وإنما بنوه ضرارا لمسجد قباء ، وكفرا بالله ، وتفريقا بين المؤمنين ، وإرصادا لمن حارب الله ورسوله ، وهو أبو عامر الفاسق ، الذي يقال له : \" الراهب \" لعنه الله .\n                                    ",
        "qortoby": "وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ ٧٠١\n                                    \n                                    \n                                    قوله تعالى والذين اتخذوا مسجدا ضرارا وكفرا وتفريقا بين المؤمنين وإرصادا لمن حارب الله ورسوله من قبل وليحلفن إن أردنا إلا الحسنى والله يشهد إنهم لكاذبون فيه عشر مسائل :\nالأولى والذين اتخذوا مسجدا معطوف ، أي ومنهم الذين اتخذوا مسجدا ، عطف جملة على جملة . ويجوز أن يكون رفعا بالابتداء والخبر محذوف ك \" إنهم يعذبون \" أو نحوه . ومن قرأ \" الذين \" بغير واو وهي قراءة المدنيين فهي عنده رفع بالابتداء ، والخبر ( لا تقم ) التقدير : الذين اتخذوا مسجدا لا تقم فيه أبدا ; أي لا تقم في مسجدهم ; قاله الكسائي . وقال النحاس : يكون خبر الابتداء لا يزال بنيانهم الذي بنوا ريبة في قلوبهم . وقيل : الخبر ( يعذبون ) كما تقدم . ونزلت الآية فيما روي في أبي عامر الراهب ; لأنه كان خرج إلى قيصر وتنصر ووعدهم قيصر أنه سيأتيهم ، فبنوا مسجد الضرار يرصدون مجيئه فيه ; قاله ابن عباس ومجاهد وقتادة وغيرهم ، وقد تقدمت قصته في الأعراف وقال أهل التفسير : إن بني عمرو بن عوف اتخذوا مسجد قباء وبعثوا للنبي صلى الله عليه وسلم أن يأتيهم فأتاهم فصلى فيه ; فحسدهم إخوانهم بنو غنم بن عوف وقالوا : نبني مسجدا ونبعث إلى النبي صلى الله عليه وسلم يأتينا فيصلي لنا كما صلى في مسجد إخواننا ، ويصلي فيه أبو عامر إذا قدم من الشام ; فأتوا النبي صلى الله عليه وسلم وهو يتجهز إلى تبوك فقالوا : يا رسول الله ، قد بنينا مسجدا لذي الحاجة ، والعلة والليلة المطيرة ، ونحب أن تصلي لنا فيه وتدعو بالبركة ; فقال النبي صلى الله عليه وسلم إني على سفر وحال شغل فلو قدمنا لأتيناكم وصلينا لكم فيه فلما انصرف النبي صلى الله عليه وسلم من تبوك أتوه وقد فرغوا منه وصلوا فيه الجمعة والسبت والأحد ، فدعا بقميصه ليلبسه ويأتيهم فنزل عليه القرآن بخبر مسجد الضرار ; فدعا النبي صلى الله عليه وسلم مالك بن الدخشم ومعن بن عدي وعامر بن السكن ووحشيا قاتل حمزة ، فقال : انطلقوا إلى هذا المسجد الظالم أهله فاهدموه وأحرقوه فخرجوا مسرعين ، وأخرج مالك بن الدخشم من منزله شعلة نار ، ونهضوا فأحرقوا المسجد وهدموه ، وكان الذين بنوه اثني عشر رجلا : خذام بن خالد من بني عبيد بن زيد أحد بني عمرو بن عوف ومن داره أخرج مسجد الضرار ، ومعتب بن قشير ، وأبو حبيبة بن الأزعر ، وعباد بن الأزعر ، وعبادة بن حنيف أخو سهل بن حنيف من بني عمرو بن عوف . وجارية بن عامر ، وابناه مجمع وزيد ابنا جارية ، ونبتل بن الحارث ، وبحزج ، وبجاد بن عثمان ، ووديعة بن ثابت ، وثعلبة بن حاطب مذكور فيهم . قال أبو عمر بن عبد البر : وفيه نظر ; لأنه شهد بدرا . وقال عكرمة : سأل عمر بن الخطاب رجلا منهم بماذا أعنت في هذا المسجد ؟ فقال : أعنت فيه بسارية . فقال : أبشر بها سارية في عنقك من نار جهنم .\nالثانية : قوله تعالى ( ضرارا ) مصدر مفعول من أجله . وكفرا وتفريقا بين المؤمنين وإرصادا عطف كله . وقال أهل التأويل : ضرارا بالمسجد ، وليس للمسجد ضرار ، إنما هو لأهله . وروى الدارقطني عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم لا ضرر ولا ضرار ، من ضار ضار الله به ، ومن شاق شاق الله عليه . قال بعض العلماء : الضرر : الذي لك به منفعة وعلى جارك فيه مضرة . والضرار : الذي ليس لك فيه منفعة وعلى جارك فيه المضرة . وقد قيل : هما بمعنى واحد ، تكلم بهما جميعا على جهة التأكيد .\nالثالثة : قال علماؤنا : لا يجوز أن يبنى مسجد إلى جنب مسجد ، ويجب هدمه ; والمنع من بنائه لئلا ينصرف أهل المسجد الأول فيبقى شاغرا ، إلا أن تكون المحلة كبيرة فلا يكفي أهلها مسجد واحد فيبنى حينئذ . وكذلك قالوا . لا ينبغي أن يبنى في المصر الواحد جامعان وثلاثة ، ويجب منع الثاني ، ومن صلى فيه الجمعة لم تجزه . وقد أحرق النبي صلى الله عليه وسلم مسجد الضرار وهدمه . وأسند الطبري عن شقيق أنه جاء ليصلي في مسجد بني غاضرة فوجد الصلاة قد فاتته ، فقيل له : إن مسجد بني فلان لم يصل فيه بعد ; فقال : لا أحب أن أصلي فيه ; لأنه بني على ضرار . قال علماؤنا : وكل مسجد بني على ضرار أو رياء وسمعة فهو في حكم مسجد الضرار لا تجوز الصلاة فيه . وقال النقاش : يلزم من هذا ألا يصلى في كنيسة ونحوها ; لأنها بنيت على شر .\nقلت : هذا لا يلزم ; لأن الكنيسة لم يقصد ببنائها الضرر بالغير ، وإن كان أصل بنائها على شر ، وإنما اتخذ النصارى الكنيسة واليهود البيعة موضعا يتعبدون فيه بزعمهم كالمسجد لنا فافترقا . وقد أجمع العلماء على أن من صلى في كنيسة أو بيعة على موضع طاهر أن صلاته ماضية جائزة . وقد ذكر البخاري أن ابن عباس كان يصلي في البيعة إذا لم يكن فيها تماثيل . وذكر أبو داود عن عثمان بن أبي العاص أن النبي صلى الله عليه وسلم أمره أن يجعل مسجد الطائف حيث كانت طواغيتهم .\nالرابعة : قال العلماء : إن من كان إماما لظالم لا يصلى وراءه إلا أن يظهر عذره أو يتوب فإن بني عمرو بن عوف الذين بنوا مسجد قباء سألوا عمر بن الخطاب في خلافته ليأذن لمجمع بن جارية أن يصلي بهم في مسجدهم ; فقال : لا ولا نعمة عين‍‍‍‍‍‍‍!‍‍‍‍‍‍‍ أليس بإمام مسجد الضرار!فقال له مجمع : يا أمير المؤمنين ، لا تعجل علي فوالله لقد صليت فيه وأنا لا أعلم ما قد أضمروا عليه ولو علمت ما صليت بهم فيه ، كنت غلاما قارئا للقرآن وكانوا شيوخا قد عاشوا على جاهليتهم وكانوا لا يقرءون من القرآن شيئا فصليت ولا أحسب ما صنعت إثما ولا أعلم بما في أنفسهم . فعذره عمر رضي الله عنهما وصدقه وأمره بالصلاة في مسجد قباء .\nالخامسة : قال علماؤنا رحمة الله عليهم : وإذا كان المسجد الذي يتخذ للعبادة وحض الشرع على بنائه فقال : من بنى لله مسجدا ولو كمفحص قطاة بنى الله له بيتا في الجنة يهدم وينزع إذا كان فيه ضرر بغيره ، فما ظنك بسواه ، بل هو أحرى أن يزال ويهدم حتى لا يدخل ضرر على الأقدم . وذلك كمن بنى فرنا أو رحى أو حفر بئرا أو غير ذلك مما يدخل به الضرر على الغير . وضابط هذا الباب : أن من أدخل على أخيه ضررا منع . فإن أدخل على أخيه ضررا بفعل ما كان له فعله في ماله فأضر ذلك بجاره أو غير جاره نظر إلى ذلك الفعل ; فإن كان تركه أكبر ضررا من الضرر الداخل على الفاعل قطع أكبر الضررين وأعظمهما حرمة في الأصول . مثال ذلك : رجل فتح كوة في منزله يطلع منها على دار أخيه وفيها العيال والأهل ، ومن شأن النساء في بيوتهن إلقاء بعض ثيابهن والانتشار في حوائجهن ، ومعلوم أن الاطلاع على العورات محرم وقد ورد النهي فيه ، فلحرمة الاطلاع على العورات رأى العلماء أن يغلقوا على فاتح الباب والكوة ما فتح مما له فيه منفعة وراحة وفي غلقه عليه ضرر لأنهم قصدوا إلى قطع أعظم الضررين ، إذ لم يكن بد من قطع أحدهما ، وهكذا الحكم في هذا الباب ، خلافا للشافعي ومن قال بقوله . قال أصحاب الشافعي : لو حفر رجل في ملكه بئرا وحفر آخر في ملكه بئرا يسرق منها ماء البئر الأولة جاز ; لأن كل واحد منهما حفر في ملكه فلا يمنع من ذلك . ومثله عندهم : لو حفر إلى جنب بئر جاره كنيفا يفسده عليه لم يكن له منعه ; لأنه تصرف في ملكه . والقرآن والسنة يردان هذا القول . وبالله التوفيق .\nومن هذا الباب وجه آخر من الضرر منع العلماء منه ، كدخان الفرن والحمام وغبار الأندر والدود المتولد من الزبل المبسوط في الرحاب ، وما كان مثل هذا فإنه يقطع منه ما بان ضرره وخشي تماديه . وأما ما كان ساعة خفيفة مثل نفض الثياب والحصر عند الأبواب ; فإن هذا مما لا غنى بالناس عنه ، وليس مما يستحق به شيء ; فنفي الضرر في منع مثل هذا أعظم وأكبر من الصبر على ذلك ساعة خفيفة . وللجار على جاره في أدب السنة أن يصبر على أذاه على ما يقدر كما عليه ألا يؤذيه وأن يحسن إليه .\nالسادسة : ومما يدخل في هذا الباب مسألة ذكرها إسماعيل بن أبي أويس عن مالك أنه سئل عن امرأة عرض لها ، يعني مسا من الجن ، فكانت إذا أصابها زوجها وأجنبت أو دنا منها يشتد ذلك بها . فقال مالك : لا أرى أن يقربها ، وأرى للسلطان أن يحول بينه وبينها .\nالسابعة : قوله تعالى ( وكفرا ) لما كان اعتقادهم أنه لا حرمة لمسجد قباء ولا لمسجد النبي صلى الله عليه وسلم كفروا بهذا الاعتقاد ; قاله ابن العربي . وقيل : ( وكفرا ) أي بالنبي صلى الله عليه وسلم وبما جاء به ; قاله القشيري وغيره .\nالثامنة : قوله تعالى وتفريقا بين المؤمنين أي يفرقون به جماعتهم ليتخلف أقوام عن النبي صلى الله عليه وسلم . وهذا يدلك على أن المقصد الأكبر والغرض الأظهر من وضع الجماعة تأليف القلوب والكلمة على الطاعة ، وعقد الذمام والحرمة بفعل الديانة حتى يقع الأنس بالمخالطة ، وتصفو القلوب من وضر الأحقاد .\nالتاسعة : تفطن مالك رحمه الله من هذه الآية فقال : لا تصلى جماعتان في مسجد واحد بإمامين ; خلافا لسائر العلماء . وقد روي عن الشافعي المنع ; حيث كان تشتيتا للكلمة وإبطالا لهذه الحكمة وذريعة إلى أن نقول : من يريد الانفراد عن الجماعة كان له عذر فيقيم جماعته ويقدم إمامته فيقع الخلاف ويبطل النظام ، وخفي ذلك عليهم . قال ابن العربي : وهذا كان شأنه معهم ، وهو أثبت قدما منهم في الحكمة وأعلم بمقاطع الشريعة .\nالعاشرة : قوله تعالى وإرصادا لمن حارب الله ورسوله يعني أبا عامر الراهب ; وسمي بذلك لأنه كان يتعبد ويلتمس العلم فمات كافرا بقنسرين بدعوة النبي صلى الله عليه وسلم ; فإنه كان قال للنبي صلى الله عليه وسلم : لا أجد قوما يقاتلونك إلا قاتلتك معهم ; فلم يزل يقاتله إلى يوم حنين . فلما انهزمت هوازن خرج إلى الروم يستنصر ، وأرسل إلى المنافقين وقال : استعدوا بما استطعتم من قوة وسلاح ، وابنوا مسجدا فإني ذاهب إلى قيصر فآت بجند من الروم لأخرج محمدا من المدينة ; فبنوا مسجد الضرار . وأبو عامر هذا هو والد حنظلة غسيل الملائكة . والإرصاد : الانتظار ; تقول : أرصدت كذا إذا أعددته مرتقبا له به . قال أبو زيد : يقال رصدته وأرصدته في الخير ، وأرصدت له في الشر . وقال ابن الأعرابي : لا يقال إلا أرصدت ، ومعناه ارتقبت .\nوقوله تعالى ( من قبل ) أي من قبل بناء مسجد الضرار .\nوليحلفن إن أردنا إلا الحسنى أي ما أردنا ببنائه إلا الفعلة الحسنى ، وهي الرفق بالمسلمين كما ذكروا لذي العلة والحاجة . وهذا يدل على أن الأفعال تختلف بالمقصود والإرادات ; ولذلك قال : وليحلفن إن أردنا إلا الحسنى . والله يشهد إنهم لكاذبون أي يعلم خبث ضمائرهم وكذبهم فيما يحلفون عليه .\n                                    ",
        "saadi": "وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ ٧٠١\n                                        \n                                        \n                                        \n                                        كان أناس من المنافقين من أهل قباء اتخذوا مسجدا إلى جنب مسجد قباء، يريدون به المضارة والمشاقة بين المؤمنين، ويعدونه لمن يرجونه من المحاربين للّه ورسوله، يكون لهم حصنا عند الاحتياج إليه، فبين تعالى خزيهم، وأظهر سرهم فقال‏:‏ ‏{‏وَالَّذِينَ اتَّخَذُوا مَسْجِدًا ضِرَارًا‏}‏ أي‏:‏ مضارة للمؤمنين ولمسجدهم الذي يجتمعون فيه ‏{‏وَكُفْرًا‏}‏ أي‏:‏ قصدهم فيه الكفر، إذا قصد غيرهم الإيمان‏.‏\n‏{‏وَتَفْرِيقًا بَيْنَ الْمُؤْمِنِينَ‏}‏ أي‏:‏ ليتشعبوا ويتفرقوا ويختلفوا، ‏{‏وَإِرْصَادًا‏}‏ أي‏:‏ إعدادا ‏{‏لِمَنْ حَارَبَ اللَّهَ وَرَسُولَهُ مِنْ قَبْلُ‏}‏ أي‏:‏ إعانة للمحاربين للّه ورسوله، الذين تقدم حرابهم واشتدت عداوتهم، وذلك كأبي عامر الراهب، الذي كان من أهل المدينة، فلما قدم النبي ـ صلى الله عليه وسلم ـ وهاجر إلى المدينة، كفر به، وكان متعبدا في الجاهلية، فذهب إلى المشركين يستعين بهم على حرب رسول اللّه ـ صلى الله عليه وسلم ـ ‏.‏\nفلما لم يدرك مطلوبه عندهم ذهب إلى قيصر بزعمه أنه ينصره، فهلك اللعين في الطريق، وكان على وعد وممالأة، هو والمنافقون‏.‏ فكان مما أعدوا له مسجد الضرار، فنزل الوحي بذلك، فبعث إليه النبي ـ صلى الله عليه وسلم ـ من يهدمه ويحرقه، فهدم وحرق، وصار بعد ذلك مزبلة‏.‏\nقال تعالى بعدما بين من مقاصدهم الفاسدة في ذلك المسجد ‏{‏وَلَيَحْلِفُنَّ إِنْ أَرَدْنَا‏}‏ في بنائنا إياه ‏{‏إِلَّا الْحُسْنَى‏}‏ أي‏:‏ الإحسان إلى الضعيف، والعاجز والضرير‏.‏\n‏{‏وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ‏}‏ فشهادة اللّه عليهم أصدق من حلفهم‏.‏\n                                    "
      },
      "originalText": "وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ ٧٠١"
    },
    {
      "number": 1343,
      "text": "لَا تَقُمْ فِيهِ أَبَدًا ۚ لَمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَىٰ مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَنْ تَقُومَ فِيهِ ۚ فِيهِ رِجَالٌ يُحِبُّونَ أَنْ يَتَطَهَّرُوا ۚ وَاللَّهُ يُحِبُّ الْمُطَّهِّرِينَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 108,
      "juz": 11,
      "manzil": 2,
      "page": 204,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ ٨٠١\n                                    \n                                    \n                                    وقوله : ( لا تقم فيه أبدا ) نهي من الله لرسوله ، صلوات الله وسلامه عليه ، والأمة تبع له في ذلك ، عن أن يقوم فيه ، أي : يصلي فيه أبدا .\nثم حثه على الصلاة في مسجد قباء الذي أسس من أول يوم بنائه على التقوى ، وهي طاعة الله ، وطاعة رسوله ، وجمعا لكلمة المؤمنين ومعقلا وموئلا للإسلام وأهله ؛ ولهذا قال تعالى : ( لمسجد أسس على التقوى من أول يوم أحق أن تقوم فيه ) والسياق إنما هو في معرض مسجد قباء ؛ ولهذا جاء في الحديث الصحيح أن رسول الله صلى الله عليه وسلم قال : \" صلاة في مسجد قباء كعمرة \" . وفي الصحيح : أن رسول الله صلى الله عليه وسلم كان يزور مسجد قباء راكبا وماشيا وفي الحديث : أن رسول الله صلى الله عليه وسلم لما بناه وأسسه أول قدومه ونزوله على بني عمرو بن عوف ، كان جبريل هو الذي عين له جهة القبلة فالله أعلم .\nوقال أبو داود : حدثنا محمد بن العلاء ، حدثنا معاوية بن هشام ، عن يونس بن الحارث ، عن إبراهيم بن أبي ميمونة ، عن أبي صالح ، عن أبي هريرة ، رضي الله عنه ، عن النبي صلى الله عليه وسلم قال : \" نزلت هذه الآية في أهل قباء : ( فيه رجال يحبون أن يتطهروا ) قال : كانوا يستنجون بالماء ، فنزلت فيهم الآية .\nورواه الترمذي وابن ماجه ، من حديث يونس بن الحارث ، وهو ضعيف ، وقال الترمذي : غريب من هذا الوجه .\nوقال الطبراني : حدثنا الحسن بن علي المعمري ، حدثنا محمد بن حميد الرازي ، حدثنا سلمة بن الفضل ، عن محمد بن إسحاق ، عن الأعمش ، عن مجاهد ، عن ابن عباس قال : لما نزلت هذه الآية : ( فيه رجال يحبون أن يتطهروا ) بعث رسول الله صلى الله عليه وسلم إلى عويم بن ساعدة فقال : \" ما هذا الطهور الذي أثنى الله عليكم ؟ \" . فقال : يا رسول الله ، ما خرج منا رجل ولا امرأة من الغائط إلا غسل فرجه - أو قال : مقعدته - فقال النبي صلى الله عليه وسلم . \" هو هذا \" .\nوقال الإمام أحمد : حدثنا حسين بن محمد ، حدثنا أبو أويس ، حدثنا شرحبيل ، عن عويم بن ساعدة الأنصاري : أنه حدثه أن النبي صلى الله عليه وسلم أتاهم في مسجد قباء ، فقال : \" إن الله تعالى قد أحسن [ عليكم الثناء ] في الطهور في قصة مسجدكم ، فما هذا الطهور الذي تطهرون به ؟ \" فقالوا : والله - يا رسول الله - ما نعلم شيئا إلا أنه كان لنا جيران من اليهود ، فكانوا يغسلون أدبارهم من الغائط ، فغسلنا كما غسلوا .\nورواه ابن خزيمة في صحيحه .\nوقال هشيم ، عن عبد الحميد المدني ، عن إبراهيم بن إسماعيل الأنصاري : أن رسول الله صلى الله عليه وسلم قال لعويم بن ساعدة . \" ما هذا الذي أثنى الله عليكم : ( فيه رجال يحبون أن يتطهروا والله يحب المطهرين ) قالوا : يا رسول الله ، إنا نغسل الأدبار بالماء .\nوقال ابن جرير : حدثني محمد بن عمارة الأسدي ، حدثنا محمد بن سعد ، حدثنا إبراهيم بن محمد ، عن شرحبيل بن سعد قال : سمعت خزيمة بن ثابت يقول : نزلت هذه الآية : ( فيه رجال يحبون أن يتطهروا والله يحب المطهرين ) قال : كانوا يغسلون أدبارهم من الغائط .\nحديث آخر : قال الإمام أحمد بن حنبل : حدثنا يحيى بن آدم ، حدثنا مالك - يعني : ابن مغول - سمعت سيارا أبا الحكم ، عن شهر بن حوشب ، عن محمد بن عبد الله بن سلام قال : لما قدم رسول الله صلى الله عليه وسلم ، يعني : قباء ، فقال : \" إن الله ، عز وجل ، قد أثنى عليكم في الطهور خيرا ، أفلا تخبروني ؟ \" . يعني : قوله تعالى : ( فيه رجال يحبون أن يتطهروا والله يحب المطهرين ) فقالوا : يا رسول الله ، إنا نجده مكتوبا علينا في التوراة : الاستنجاء بالماء .\nوقد صرح بأنه مسجد قباء جماعة من السلف ، رواه علي بن أبي طلحة ، عن ابن عباس . ورواه عبد الرزاق ، عن معمر ، عن الزهري ، عن عروة بن الزبير . وقاله عطية العوفي ، وعبد الرحمن بن زيد بن أسلم ، والشعبي ، والحسن البصري ، ونقله البغوي عن سعيد بن جبير ، وقتادة .\nوقد ورد في الحديث الصحيح : أن مسجد رسول الله صلى الله عليه وسلم الذي هو في جوف المدينة ، هو المسجد الذي أسس على التقوى . وهذا صحيح . ولا منافاة بين الآية وبين هذا ؛ لأنه إذا كان مسجد قباء قد أسس على التقوى من أول يوم ، فمسجد رسول الله صلى الله عليه وسلم بطريق الأولى والأحرى ؛ ولهذا قال الإمام أحمد بن حنبل في مسنده :\nحدثنا أبو نعيم ، حدثنا عبد الله بن عامر الأسلمي ، عن عمران بن أبي أنس ، عن سهل بن سعد ، عن أبي بن كعب : أن النبي صلى الله عليه وسلم قال : \" المسجد الذي أسس على التقوى مسجدي هذا \" . تفرد به أحمد .\nحديث آخر : قال الإمام أحمد : حدثنا وكيع ، حدثنا ربيعة بن عثمان التيمي ، عن عمران بن أبي أنس ، عن سهل بن سعد الساعدي قال : اختلف رجلان على عهد رسول الله صلى الله عليه وسلم في المسجد الذي أسس على التقوى ، فقال أحدهما : هو مسجد رسول الله صلى الله عليه وسلم . وقال الآخر : هو مسجد قباء .\nفأتيا النبي صلى الله عليه وسلم فسألاه ، فقال : \" هو مسجدي هذا \" تفرد به أحمد أيضا .\nحديث آخر : قال أحمد : حدثنا موسى بن داود ، حدثنا ليث ، عن عمران بن أبي أنس ، عن سعيد بن أبي سعيد الخدري ، رضي الله عنه ، قال : تمارى رجلان في المسجد الذي أسس على التقوى ، فقال أحدهما : هو مسجد قباء ، وقال الآخر : هو مسجد النبي صلى الله عليه وسلم ، فقال النبي صلى الله عليه وسلم : \" هو مسجدي هذا \" تفرد به أحمد .\nطريق أخرى : قال الإمام أحمد : حدثنا إسحاق بن عيسى ، حدثنا ليث ، حدثني عمران بن أبي أنس ، عن ابن أبي سعيد ، عن أبيه أنه قال : تمارى رجلان في المسجد الذي أسس على التقوى من أول يوم ، فقال رجل : هو مسجد قباء ، وقال الآخر : هو مسجد رسول الله صلى الله عليه وسلم ، فقال رسول الله صلى الله عليه وسلم : \" هو مسجدي \" .\nوكذا رواه الترمذي والنسائي عن قتيبة ، عن الليث وصححه الترمذي ، ورواه مسلم كما سيأتي .\nطريق أخرى : قال أحمد : حدثنا يحيى ، عن أنيس بن أبي يحيى ، حدثني أبي قال : سمعت أبا سعيد الخدري قال : اختلف رجلان : رجل من بني خدرة ، ورجل من بني عمرو بن عوف في المسجد الذي أسس على التقوى ، فقال الخدري : هو مسجد رسول الله صلى الله عليه وسلم ، وقال العمري : هو مسجد قباء ، فأتيا رسول الله صلى الله عليه وسلم فسألاه عن ذلك ، فقال : \" هو هذا المسجد \" لمسجد رسول الله صلى الله عليه وسلم ، وقال : \" في ذاك [ خير كثير ] يعني : مسجد قباء .\nطريق أخرى : قال أبو جعفر بن جرير : حدثنا ابن بشار ، حدثنا يحيى بن سعيد - حدثنا حميد الخراط المدني ، سألت أبا سلمة بن عبد الرحمن بن أبي سعيد فقلت : كيف سمعت أباك يقول في المسجد الذي أسس على التقوى ؟ فقال أبي : أتيت رسول الله صلى الله عليه وسلم فدخلت عليه في بيت لبعض نسائه ، فقلت : يا رسول الله ، أين المسجد الذي أسس على التقوى ؟ قال : فأخذ كفا من حصباء فضرب به الأرض ، ثم قال : \" هو مسجدكم هذا \" . ثم قال : [ فقلت له : هكذا ] سمعت أباك يذكره ؟ .\nرواه مسلم منفردا به عن محمد بن حاتم ، عن يحيى بن سعيد ، به ورواه عن أبي بكر بن أبي شيبة وغيره ، عن حاتم بن إسماعيل ، عن حميد الخراط ، به .\nوقد قال بأنه مسجد النبي صلى الله عليه وسلم جماعة من السلف والخلف ، وهو مروي عن عمر بن الخطاب ، وابنه عبد الله ، وزيد بن ثابت ، وسعيد بن المسيب . واختاره ابن جرير .\nوقوله : ( لمسجد أسس على التقوى من أول يوم أحق أن تقوم فيه فيه رجال يحبون أن يتطهروا والله يحب المطهرين ) دليل على استحباب الصلاة في المساجد القديمة المؤسسة من أول بنائها على عبادة الله وحده لا شريك له ، وعلى استحباب الصلاة مع جماعة الصالحين ، والعباد العاملين المحافظين على إسباغ الوضوء ، والتنزه عن ملابسة القاذورات .\nوقد قال الإمام أحمد : حدثنا محمد بن جعفر ، عن شعبة ، عن عبد الملك بن عمير ، سمعت شبيبا أبا روح يحدث عن رجل من أصحاب النبي صلى الله عليه وسلم ؛ أن رسول الله صلى الله عليه وسلم صلى بهم الصبح فقرأ بهم الروم فأوهم ، فلما انصرف قال : \" إنه يلبس علينا القرآن ، إن أقواما منكم يصلون معنا لا يحسنون الوضوء ، فمن شهد الصلاة معنا فليحسن الوضوء \" .\nثم رواه من طريقين آخرين ، عن عبد الملك بن عمير ، عن شبيب أبي روح من ذي الكلاع : أنه صلى مع النبي صلى الله عليه وسلم ، فذكره فدل هذا على أن إكمال الطهارة يسهل القيام في العبادة ، ويعين على إتمامها وإكمالها والقيام بمشروعاتها .\nوقال أبو العالية في قوله تعالى : ( والله يحب المطهرين ) إن الطهور بالماء لحسن ، ولكنهم المطهرون من الذنوب .\nوقال الأعمش : التوبة من الذنب ، والتطهير من الشرك .\nوقد ورد في الحديث المروي من طرق ، في السنن وغيرها ، أن رسول الله صلى الله عليه وسلم قال لأهل قباء : \" قد أثنى الله عليكم في الطهور ، فماذا تصنعون ؟ \" فقالوا : نستنجي بالماء .\nوقد قال الحافظ أبو بكر البزار : حدثنا عبد الله بن شبيب ، حدثنا أحمد بن محمد بن عبد العزيز قال : وجدته في كتاب أبي ، عن الزهري ، عن عبيد الله بن عبد الله ، عن ابن عباس قال : نزلت هذه الآية في أهل قباء . ( فيه رجال يحبون أن يتطهروا والله يحب المطهرين ) فسألهم رسول الله صلى الله عليه وسلم فقالوا : إنا نتبع الحجارة الماء .\nثم قال : تفرد به محمد بن عبد العزيز ، عن الزهري ، ولم يرو عنه سوى ابنه .\nقلت : وإنما ذكرته بهذا اللفظ لأنه مشهور بين الفقهاء ولم يعرفه كثير من المحدثين المتأخرين ، أو كلهم ، والله أعلم .\n                                    ",
        "qortoby": "لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ ٨٠١\n                                    \n                                    \n                                    قوله تعالى لا تقم فيه أبدا لمسجد أسس على التقوى من أول يوم أحق أن تقوم فيه فيه رجال يحبون أن يتطهروا والله يحب المطهرين\nفيه إحدى عشرة مسألة :\nالأولى : قوله تعالى لا تقم فيه أبدا يعني مسجد الضرار ; أي لا تقم فيه للصلاة . وقد يعبر عن الصلاة بالقيام ; يقال : فلان يقوم الليل أي يصلي ; ومنه الحديث الصحيح : من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه . أخرجه البخاري عن أبي هريرة عن النبي صلى الله عليه وسلم قال . . . ، فذكره . وقد روي أن رسول الله صلى الله عليه وسلم لما نزلت هذه الآية كان لا يمر بالطريق التي فيها المسجد ، وأمر بموضعه أن يتخذ كناسة تلقى فيها الجيف والأقذار والقمامات .\nالثانية : قوله تعالى ( أبدا ) أبدا : ظرف زمان . وظرف الزمان على قسمين : ظرف مقدر كاليوم ، وظرف مبهم كالحين والوقت ; والأبد من هذا القسم ، وكذلك الدهر . وتنشأ هنا مسألة أصولية ، وهي أن ( أبدا ) وإن كانت ظرفا مبهما لا عموم فيه ولكنه إذا اتصل بلا النافية أفاد العموم ، فلو قال : لا تقم ، لكفى في الانكفاف المطلق . فإذا قال : ( أبدا ) فكأنه قال في وقت من الأوقات ولا في حين من الأحيان . فأما النكرة في الإثبات إذا كانت خبرا عن واقع لم تعم ، وقد فهم ذلك أهل اللسان وقضى به فقهاء الإسلام فقالوا : لو قال رجل لامرأته أنت طالق أبدا طلقت طلقة واحدة .\nالثالثة : قوله تعالى لمسجد أسس على التقوى أي بنيت جدره ورفعت قواعده . والأس أصل البناء ; وكذلك الأساس . والأسس مقصور منه . وجمع الأس إساس ; مثل عس وعساس . وجمع الأساس أسس ; مثل قذال وقذل . وجمع الأسس آساس ; مثل سبب وأسباب . وقد أسست البناء تأسيسا . وقولهم : كان ذلك على أس الدهر ، وأس الدهر ، وإس الدهر ; ثلاث لغات ; أي على قدم الدهر ووجه الدهر . واللام في قوله ( لمسجد ) لام قسم . وقيل لام الابتداء ; كما تقول : لزيد أحسن الناس فعلا ; وهي مقتضية تأكيدا . أسس على التقوى نعت لمسجد . ( أحق ) خبر الابتداء الذي هو \" لمسجد \" ومعنى \" التقوى \" هنا الخصال التي تتقى بها العقوبة ، وهي فعلى من وقيت ، وقد تقدم .\nالرابعة : واختلف العلماء في المسجد الذي أسس على التقوى ; فقالت طائفة : هو مسجد قباء ; يروى عن ابن عباس والضحاك والحسن . وتعلقوا بقوله : من أول يوم ، ومسجد قباء كان أسس بالمدينة أول يوم ; فإنه بني قبل مسجد النبي صلى الله عليه وسلم ; قاله ابن عمر وابن المسيب ، ومالك فيما رواه عنه ابن وهب وأشهب وابن القاسم . وروى الترمذي عن أبي سعيد الخدري : قال تمارى رجلان في المسجد الذي أسس على التقوى من أول يوم ; فقال رجل هو مسجد قباء ، وقال آخر هو مسجد النبي صلى الله عليه وسلم . فقال رسول الله صلى الله عليه وسلم : هو مسجدي هذا . قال حديث صحيح . والقول الأول أليق بالقصة ; لقوله : ( فيه ) وضمير الظرف يقتضي الرجال المتطهرين ; فهو مسجد قباء . والدليل على ذلك حديث أبي هريرة قال : نزلت هذه الآية في أهل قباء فيه رجال يحبون أن يتطهروا والله يحب المطهرين قال : كانوا يستنجون بالماء فنزلت فيهم هذه الآية . قال الشعبي : هم أهل مسجد قباء ، أنزل الله فيهم هذا . وقال قتادة : لما نزلت هذه الآية قال رسول الله صلى الله عليه وسلم لأهل قباء : إن الله سبحانه قد أحسن عليكم الثناء في التطهر فما تصنعون ؟ قالوا : إنا نغسل أثر الغائط والبول بالماء رواه أبو داود . وروى الدارقطني عن طلحة بن نافع قال : حدثني أبو أيوب وجابر بن عبد الله وأنس بن مالك الأنصاريون عن رسول الله صلى الله عليه وسلم في هذه الآية فيه رجال يحبون أن يتطهروا والله يحب المطهرين فقال : يا معشر الأنصار إن الله قد أثنى عليكم خيرا في الطهور فما طهوركم هذا ؟ قالوا : يا رسول الله ، نتوضأ للصلاة ونغتسل من الجنابة . فقال رسول الله صلى الله عليه وسلم : فهل مع ذلك من غيره ؟ فقالوا : لا غير ، إن أحدنا إذا خرج من الغائط أحب أن يستنجي بالماء . قال : هو ذاك فعليكموه وهذا الحديث يقتضي أن المسجد المذكور في الآية هو مسجد قباء ، إلا أن حديث أبي سعيد الخدري نص فيه النبي صلى الله عليه وسلم على أنه مسجده فلا نظر معه . وقد روى أبو كريب قال : حدثنا أبو أسامة قال حدثنا صالح بن حيان قال حدثنا عبد الله بن بريدة في قوله عز وجل : في بيوت أذن الله أن ترفع ويذكر فيها اسمه قال : إنما هي أربعة مساجد لم يبنهن إلا نبي : الكعبة بناها إبراهيم وإسماعيل عليهما السلام ، وبيت أريحا بيت المقدس بناه داود وسليمان عليهما السلام ، ومسجد المدينة ومسجد قباء اللذين أسسا على التقوى ، بناهما رسول الله صلى الله عليه وسلم .\nالخامسة : قوله تعالى من أول يوم ( من ) عند النحويين مقابلة \" منذ \" ; ف \" منذ \" في الزمان بمنزلة ( من ) في المكان . فقيل : إن معناها هنا معنى \" منذ \" ; والتقدير : منذ أول يوم ابتدئ بنيانه . وقيل : المعنى من تأسيس أول الأيام ، فدخلت على مصدر الفعل الذي هو أسس ; كما قال :\nلمن الديار بقنة الحجر أقوين من حجج ومن دهر\nأي من مر حجج ومن مر دهر . وإنما دعا إلى هذا أن من أصول النحويين أن \" من \" لا يجر بها الأزمان ، وإنما تجر الأزمان بمنذ ، تقول ما رأيته منذ شهر أو سنة أو يوم ، ولا تقول : من شهر ولا من سنة ولا من يوم . فإذا وقعت في الكلام وهي يليها زمن فيقدر مضمر يليق أن يجر بمن ; كما ذكرنا في تقدير البيت . ابن عطية . ويحسن عندي أن يستغنى في هذه الآية عن تقدير ، وأن تكون \" من \" تجر لفظة ( أول ) لأنها بمعنى البداءة ; كأنه قال : من مبتدأ الأيام .\nالسادسة : قوله تعالى أحق أن تقوم فيه أي بأن تقوم ; فهو في موضع نصب . و ( أحق ) هو أفعل من الحق ، وأفعل لا يدخل إلا بين شيئين مشتركين ، لأحدهما في المعنى الذي اشتركا فيه مزية على الآخر ; فمسجد الضرار وإن كان باطلا لا حق فيه ، فقد اشتركا في الحق من جهة اعتقاد بانيه ، أو من جهة اعتقاد من كان يظن أن القيام فيه جائز للمسجدية ; لكن أحد الاعتقادين باطل باطنا عند الله ، والآخر حق باطنا وظاهرا ; ومثل هذا قوله تعالى : أصحاب الجنة يومئذ خير مستقرا وأحسن مقيلا ومعلوم أن الخيرية من النار مبعودة ، ولكنه جرى على اعتقاد كل فرقة أنها على خير وأن مصيرها إليه خير ; إذ كل حزب بما لديهم فرحون . وليس هذا من قبيل : العسل أحلى من الخل ; فإن العسل وإن كان حلوا فكل شيء ملائم فهو حلو ; ألا ترى أن من الناس من يقدم الخل على العسل مفردا بمفرد ومضافا إلى غيره بمضاف .\nالسابعة : قوله تعالى ( فيه ) من قال : إن المسجد يراد به مسجد النبي صلى الله عليه وسلم فالهاء في أحق أن تقوم فيه عائد إليه . و فيه رجال له أيضا . ومن قال : إنه مسجد قباء ، فالضمير في ( فيه ) عائد إليه على الخلاف المتقدم .\nالثامنة : أثنى الله سبحانه وتعالى في هذه الآية على من أحب الطهارة وآثر النظافة ، وهي مروءة آدمية ووظيفة شرعية ; وفي الترمذي عن عائشة رضوان الله عليها أنها قالت : مرن أزواجكن أن يستطيبوا بالماء فإني أستحييهم . قال : حديث صحيح . وثبت أن النبي صلى الله عليه وسلم كان يحمل الماء معه في الاستنجاء ; فكان يستعمل الحجارة تخفيفا والماء تطهيرا . ابن العربي : وقد كان علماء القيروان يتخذون في متوضآتهم أحجارا في تراب ينقون بها ثم يستنجون بالماء .\nالتاسعة : اللازم من نجاسة المخرج التخفيف ، وفي نجاسة سائر البدن والثوب التطهير . وذلك رخصة من الله لعباده في حالتي وجود الماء وعدمه ; وبه قال عامة العلماء . وشذ ابن حبيب فقال : لا يستجمر بالأحجار إلا عند عدم الماء . والأخبار الثابتة في الاستجمار بالأحجار مع وجود الماء ترده .\nالعاشرة : واختلف العلماء من هذا الباب في إزالة النجاسة من الأبدان والثياب ، بعد إجماعهم على التجاوز والعفو عن دم البراغيث ما لم يتفاحش على ثلاثة أقوال : الأول : أنه واجب فرض ، ولا تجوز صلاة من صلى بثوب نجس عالما كان بذلك أو ساهيا ; روي عن ابن عباس والحسن وابن سيرين ، وهو قول الشافعي وأحمد وأبي ثور ، ورواه ابن وهب عن مالك ، وهو قول أبي الفرج المالكي والطبري ; إلا أن الطبري قال : إن كانت النجاسة قدر الدرهم أعاد الصلاة . وهو قول أبي حنيفة وأبي يوسف في مراعاة قدر الدرهم قياسا على حلقة الدبر . وقالت طائفة : إزالة النجاسة واجبة بالسنة من الثياب والأبدان ، وجوب سنة وليس بفرض . قالوا : ومن صلى بثوب نجس أعاد الصلاة في الوقت فإن خرج الوقت فلا شيء عليه ; هذا قول مالك وأصحابه إلا أبا الفرج ، ورواية ابن وهب عنه . وقال مالك في يسير الدم : لا تعاد منه الصلاة في الوقت ولا بعده ، وتعاد من يسير البول والغائط ; ونحو هذا كله من مذهب مالك قول الليث . وقال ابن القاسم عنه : تجب إزالتها في حالة الذكر دون النسيان ; وهي من مفرداته . والقول الأول أصح إن شاء الله ; لأن النبي صلى الله عليه وسلم مر على قبرين فقال : إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان يمشي بالنميمة وأما الآخر فكان لا يستتر من بوله . . . . الحديث ، خرجه البخاري ومسلم ، وحسبك . وسيأتي في سورة ( سبحان ) . قالوا : ولا يعذب الإنسان إلا على ترك واجب ; وهذا ظاهر . وروى أبو بكر بن أبي شيبة عن أبي هريرة عن النبي صلى الله عليه وسلم قال : أكثر عذاب القبر من البول . احتج الآخرون بخلع النبي صلى الله عليه وسلم نعليه في الصلاة لما أعلمه جبريل عليه السلام أن فيهما قذرا وأذى . . . الحديث . خرجه أبو داود وغيره من حديث أبي سعيد الخدري ، وسيأتي في سورة ( طه ) إن شاء الله تعالى . قالوا : ولما لم يعد ما صلى دل على أن إزالتها سنة وصلاته صحيحة ، ويعيد ما دام في الوقت طلبا للكمال . والله أعلم .\nالحادية عشرة : قال القاضي أبو بكر بن العربي : وأما الفرق بين القليل والكثير بقدر الدرهم البغلي ; يعني كبار الدراهم التي هي على قدر استدارة الدينار قياسا على المسربة - ففاسد من وجهين ; أحدهما : أن المقدرات لا تثبت قياسا فلا يقبل هذا التقدير . الثاني : أن هذا الذي خفف عنه في المسربة رخصة للضرورة ، والحاجة والرخص لا يقاس عليها ; لأنها خارجة عن القياس فلا ترد إليه .\n                                    ",
        "saadi": "لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ ٨٠١\n                                        \n                                        \n                                        \n                                        ‏{‏لَا تَقُمْ فِيهِ أَبَدًا‏}‏ أي‏:‏ لا تصل في ذلك المسجد الذي بني ضرارا أبدا‏.‏ فاللّه يغنيك عنه، ولست بمضطر إليه‏.‏\n‏{‏لَمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ‏}‏ ظهر فيه الإسلام في ‏\"‏قباء‏\"‏ وهو مسجد ‏\"‏قباء‏\"‏ أسس على إخلاص الدين للّه، وإقامة ذكره وشعائر دينه، وكان قديما في هذا عريقا فيه، فهذا المسجد الفاضل ‏{‏أَحَقُّ أَنْ تَقُومَ فِيهِ‏}‏ وتتعبد، وتذكر اللّه تعالى فهو فاضل، وأهله فضلاء، ولهذا مدحهم اللّه بقوله‏:‏ ‏{‏فِيهِ رِجَالٌ يُحِبُّونَ أَنْ يَتَطَهَّرُوا‏}‏ من الذنوب، ويتطهروا من الأوساخ، والنجاسات والأحداث‏.‏\nومن المعلوم أن من أحب شيئا لا بد أن يسعى له ويجتهد فيما يحب، فلا بد أنهم كانوا حريصين على التطهر من الذنوب والأوساخ والأحداث، ولهذا كانوا ممن سبق إسلامه، وكانوا مقيمين للصلاة، محافظين على الجهاد، مع رسول اللّه ـ صلى الله عليه وسلم ـ وإقامة شرائع الدين، وممن كانوا يتحرزون من مخالفة اللّه ورسوله‏.‏\nوسألهم النبي ـ صلى الله عليه وسلم ـ بعد ما نزلت هذه الآية في مدحهم عن طهارتهم، فأخبروه أنهم يتبعون الحجارة الماء، فحمدهم على صنيعهم‏.‏\n‏{‏وَاللَّهُ يُحِبُّ الْمُطَّهِّرِينَ‏}‏ الطهارة المعنوية، كالتنزه من الشرك والأخلاق الرذيلة، والطهارة الحسية كإزالة الأنجاس ورفع الأحداث‏\n                                    "
      },
      "originalText": "لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ ٨٠١"
    },
    {
      "number": 1344,
      "text": "أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ تَقْوَىٰ مِنَ اللَّهِ وَرِضْوَانٍ خَيْرٌ أَمْ مَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 109,
      "juz": 11,
      "manzil": 2,
      "page": 204,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ خَيۡرٌ أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٩٠١\n                                    \n                                    \n                                    يقول تعالى : لا يستوي من أسس بنيانه على تقوى الله ورضوان ، ومن بنى مسجدا ضرارا وكفرا وتفريقا بين المؤمنين ، وإرصادا لمن حارب الله ورسوله من قبل ، فإنما بنى هؤلاء بنيانهم ( على شفا جرف هار ) أي : طرف حفيرة مثاله ( في نار جهنم والله لا يهدي القوم الظالمين ) أي : لا يصلح عمل المفسدين .\nقال جابر بن عبد الله : رأيت المسجد الذي بني ضرارا يخرج منه الدخان على عهد النبي صلى الله عليه وسلم .\nوقال ابن جريج ذكر لنا أن رجالا حفروا فوجدوا الدخان يخرج منه . وكذا قال قتادة .\nوقال خلف بن ياسين الكوفي : رأيت مسجد المنافقين الذي ذكره الله تعالى في القرآن ، وفيه جحر يخرج منه الدخان ، وهو اليوم مزبلة . رواه ابن جرير رحمه الله .\nوقوله : ( لا يزال بنيانهم الذي بنوا ريبة في قلوبهم ) أي : شكا ونفاقا بسبب إقدامهم على هذا الصنيع الشنيع ، أورثهم نفاقا في قلوبهم ، كما أشرب عابدو العجل حبه .\n                                    ",
        "qortoby": "أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ خَيۡرٌ أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٩٠١\n                                    \n                                    \n                                    قوله تعالى أفمن أسس بنيانه على تقوى من الله ورضوان خير أم من أسس بنيانه على شفا جرف هار فانهار به في نار جهنم والله لا يهدي القوم الظالمين\nفيه خمس مسائل : الأولى : قوله تعالى أفمن أسس أي أصل ، وهو استفهام معناه التقرير . و ( من ) بمعنى الذي ، وهي في موضع رفع بالابتداء ، وخبره ( خير ) . وقرأ نافع وابن عامر وجماعة ( أسس بنيانه ) على بناء ( أسس ) للمفعول ورفع ( بنيان ) فيهما . وقرأ ابن كثير وأبو عمرو وحمزة والكسائي وجماعة أسس بنيانه على بناء الفعل للفاعل ونصب ( بنيانه ) فيهما . وهي اختيار أبي عبيد لكثرة من قرأ به ، وأن الفاعل سمي فيه . وقرأ نصر بن عاصم بن علي \" أفمن أسس \" بالرفع ( بنيانه ) بالخفض . وعنه أيضا ( أساس بنيانه ) وعنه أيضا ( أس بنيانه ) بالخفض . والمراد أصول البناء كما تقدم . وحكى أبو حاتم قراءة سادسة وهي ( أفمن آساس بنيانه ) قال النحاس : وهذا جمع أس ; كما يقال : خف وأخفاف ، والكثير \" إساس \" مثل خفاف . قال الشاعر :\nأصبح الملك ثابت الأساس في البهاليل من بني العباس\nالثانية : قوله تعالى على تقوى من الله قراءة عيسى بن عمر - فيما حكى سيبويه - بالتنوين ، والألف ألف إلحاق كألف تترى فيما نون ، وقال الشاعر :\nيستن في علقى وفي مكور\nوأنكر سيبويه التنوين ، وقال : لا أدري ما وجهه . على شفا الشفا : الحرف والحد ، وقد مضى في ( آل عمران ) مستوفى . و جرف قرئ برفع الراء ، وأبو بكر وحمزة بإسكانها ; مثل الشغل والشغل ، والرسل والرسل ، يعني جرفا ليس له أصل . والجرف : ما يتجرف بالسيول من الأودية ، وهو جوانبه التي تنحفر بالماء ، وأصله من الجرف والاجتراف ; وهو اقتلاع الشيء من أصله . هار ساقط ; يقال . تهور البناء إذا سقط ، وأصله هائر ، فهو من المقلوب يقلب وتؤخر ياؤها ، فيقال : هار وهائر ، قاله الزجاج . ومثله لاث الشيء به إذا دار ; فهو لاث أي لائث . وكما قالوا : شاكي السلاح وشائك السلاح . قال العجاج :\nلاث به الأشاء والعبري\nالأشاء النخل ، والعبري السدر الذي على شاطئ الأنهار . ومعنى لاث به مطيف به . وزعم أبو حاتم أن الأصل فيه هاور ، ثم يقال هائر مثل صائم ، ثم يقلب فيقال هار . وزعم الكسائي أنه من ذوات الواو ومن ذوات الياء ، وأنه يقال : تهور وتهير .\nقلت : ولهذا يمال ويفتح .\nالثالثة : قوله تعالى فانهار به في نار جهنم فاعل ( انهار ) الجرف ; كأنه قال : فانهار الجرف بالبنيان في النار ; لأن الجرف مذكر . ويجوز أن يكون الضمير في ( به ) يعود على ( من ) وهو الباني ; والتقدير : فانهار من أسس بنيانه على غير تقوى . وهذه الآية ضرب مثل لهم ، أي من أسس بنيانه على الإسلام خير أم من أسس بنيانه على الشرك والنفاق . وبين أن بناء الكافر كبناء على جرف جهنم يتهور بأهله فيها . والشفا : الشفير . وأشفى على كذا أي دنا منه .\nالرابعة : في هذه الآية دليل على أن كل شيء ابتدئ بنية تقوى الله تعالى والقصد لوجهه الكريم فهو الذي يبقى ويسعد به صاحبه ويصعد إلى الله ويرفع إليه ، ويخبر عنه بقوله : ويبقى وجه ربك ذو الجلال والإكرام على أحد الوجهين . ويخبر عنه أيضا بقوله : والباقيات الصالحات على ما يأتي بيانه إن شاء الله تعالى .\nالخامسة : واختلف العلماء في قوله تعالى : فانهار به في نار جهنم هل ذلك حقيقة أو مجاز على ؛ قولين ; الأول : أن ذلك حقيقة وأن النبي صلى الله عليه وسلم إذ أرسل إليه فهدم رئي الدخان يخرج منه ; من رواية سعيد بن جبير . وقال بعضهم : كان الرجل يدخل فيه سعفة من سعف النخل فيخرجها سوداء محترقة . وذكر أهل التفسير أنه كان يحفر ذلك الموضع الذي انهار فيخرج منه دخان . وروى عاصم بن أبي النجود عن زر بن حبيش عن ابن مسعود أنه قال : جهنم في الأرض ، ثم تلا فانهار به في نار جهنم . وقال جابر بن عبد الله : أنا رأيت الدخان يخرج منه على عهد رسول الله صلى الله عليه وسلم . ( والثاني ) أن ذلك مجاز ، والمعنى : صار البناء في نار جهنم ، فكأنه انهار إليه وهوى فيه ; وهذا كقوله تعالى : فأمه هاوية . والظاهر الأول ، إذ لا إحالة في ذلك . والله أعلم .\n                                    ",
        "saadi": "أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ خَيۡرٌ أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٩٠١\n                                        \n                                        \n                                        \n                                        ثم فاضل بين المساجد بحسب مقاصد أهلها وموافقتها لرضاه فقال‏:‏ ‏{‏أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَى تَقْوَى مِنَ اللَّهِ‏}‏ أي‏:‏ على نية صالحة وإخلاص ‏{‏وَرِضْوَانٌ‏}‏ بأن كان موافقا لأمره، فجمع في عمله بين الإخلاص والمتابعة، ‏{‏خَيْرٌ أَمْ مَنْ أَسَّسَ بُنْيَانَهُ عَلَى شَفَا‏}‏ أي‏:‏ على طرف ‏{‏جُرُفٍ هَارٍ‏}‏ أي‏:‏ بال، قد تداعى للانهدام، ‏{‏فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ‏}‏ لما فيه مصالح دينهم ودنياهم‏.‏\n                                    "
      },
      "originalText": "أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ خَيۡرٌ أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٩٠١"
    },
    {
      "number": 1345,
      "text": "لَا يَزَالُ بُنْيَانُهُمُ الَّذِي بَنَوْا رِيبَةً فِي قُلُوبِهِمْ إِلَّا أَنْ تَقَطَّعَ قُلُوبُهُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 110,
      "juz": 11,
      "manzil": 2,
      "page": 204,
      "ruku": 168,
      "hizbQuarter": 81,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَا يَزَالُ بُنۡيَٰنُهُمُ ٱلَّذِي بَنَوۡاْ رِيبَةٗ فِي قُلُوبِهِمۡ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ ٠١١\n                                    \n                                    \n                                    وقوله : ( إلا أن تقطع قلوبهم ) أي : بموتهم . قاله ابن عباس ، ومجاهد ، وقتادة ، وزيد بن أسلم ، والسدي ، وحبيب بن أبي ثابت ، والضحاك ، وعبد الرحمن بن زيد بن أسلم ، وغير واحد من علماء السلف .\n( والله عليم ) أي : بأعمال خلقه ، ( حكيم ) في مجازاتهم عنها ، من خير وشر .\n                                    ",
        "qortoby": "لَا يَزَالُ بُنۡيَٰنُهُمُ ٱلَّذِي بَنَوۡاْ رِيبَةٗ فِي قُلُوبِهِمۡ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ ٠١١\n                                    \n                                    \n                                    قوله تعالى لا يزال بنيانهم الذي بنوا ريبة في قلوبهم إلا أن تقطع قلوبهم والله عليم حكيم\nقوله تعالى لا يزال بنيانهم الذي بنوا يعني مسجد الضرار ريبة في قلوبهم أي شكا في قلوبهم ونفاقا ; قاله ابن عباس وقتادة والضحاك . وقال النابغة :\nحلفت فلم أترك لنفسك ريبة وليس وراء الله للمرء مذهب\nوقال الكلبي : حسرة وندامة ; لأنهم ندموا على بنيانه . وقال السدي وحبيب والمبرد : ريبة أي حزازة وغيظا .\nإلا أن تقطع قلوبهم قال ابن عباس : أي تنصدع قلوبهم فيموتوا ; كقوله : لقطعنا منه الوتين لأن الحياة تنقطع بانقطاع الوتين ; وقاله قتادة والضحاك ومجاهد . وقال سفيان : إلا أن يتوبوا . عكرمة : إلا أن تقطع قلوبهم في قبورهم ، وكان أصحاب عبد الله بن مسعود يقرءونها : \" ريبة في قلوبهم ولو تقطعت قلوبهم \" . وقرأ الحسن ويعقوب وأبو حاتم \" إلى أن تقطع \" على الغاية ، أي لا يزالون في شك منه إلى أن يموتوا فيستيقنوا ويتبينوا . واختلف القراء في قوله ( تقطع ) فالجمهور \" تقطع \" بضم التاء وفتح القاف وشد الطاء على الفعل المجهول . وقرأ ابن عامر وحمزة وحفص ويعقوب كذلك إلا أنهم فتحوا التاء . وروي عن يعقوب وأبي عبد الرحمن \" تقطع \" على الفعل المجهول مخفف القاف . وروي عن شبل وابن كثير \" تقطع \" خفيفة القاف \" قلوبهم \" نصبا ، أي أنت تفعل ذلك بهم . وقد ذكرنا قراءة أصحاب عبد الله .\nوالله عليم حكيم تقدم .\n                                    ",
        "saadi": "لَا يَزَالُ بُنۡيَٰنُهُمُ ٱلَّذِي بَنَوۡاْ رِيبَةٗ فِي قُلُوبِهِمۡ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ ٠١١\n                                        \n                                        \n                                        \n                                        ‏{‏لَا يَزَالُ بُنْيَانُهُمُ الَّذِي بَنَوْا رِيبَةً فِي قُلُوبِهِمْ‏}‏ أي‏:‏ شكا، وريبا ماكثا في قلوبهم، ‏{‏إِلَّا أَنْ تَقَطَّعَ قُلُوبُهُمْ‏}‏ بأن يندموا غاية الندم ويتوبوا إلى ربهم، ويخافوه غاية الخوف، فبذلك يعفو اللّه عنهم، وإلا فبنيانهم لا يزيدهم إلا ريبا إلى ريبهم، ونفاقا إلى نفاقهم‏.‏\n‏{‏وَاللَّهُ عَلِيمٌ‏}‏ بجميع الأشياء، ظاهرها، وباطنها، خفيها وجليها، وبما أسره العباد، وأعلنوه‏.‏\n‏{‏حَكِيمٌ‏}‏ لا يفعل ولا يخلق ولا يأمر ولا ينهى إلا ما اقتضته الحكمة وأمر به فللّه الحمد ‏.‏\nوفي هذه الآيات فوائد عدة‏:‏\nمنها‏:‏ أن اتخاذ المسجد الذي يقصد به الضرار لمسجد آخر بقربه، أنه محرم، وأنه يجب هدم مسجد الضرار، الذي اطلع على مقصود أصحابه‏.‏\nومنها‏:‏ أن العمل وإن كان فاضلا تغيره النية، فينقلب منهيا عنه، كما قلبت نية أصحاب مسجد الضرار عملهم إلى ما ترى‏.‏\nومنها‏:‏ أن كل حالة يحصل بها التفريق بين المؤمنين، فإنها من المعاصي التي يتعين تركها وإزالتها‏.‏\nكما أن كل حالة يحصل بها جمع المؤمنين وائتلافهم، يتعين اتباعها والأمر بها والحث عليها، لأن اللّه علل اتخاذهم لمسجد الضرار بهذا المقصد الموجب للنهي عنه، كما يوجب ذلك الكفر والمحاربة للّه ورسوله‏.‏\nومنها‏:‏ النهي عن الصلاة في أماكن المعصية، والبعد عنها، وعن قربها‏.‏\nومنها‏:‏ أن المعصية تؤثر في البقاع، كما أثرت معصية المنافقين في مسجد الضرار، ونهي عن القيام فيه، وكذلك الطاعة تؤثر في الأماكن كما أثرت في مسجد ‏\"‏ قباء‏\"‏ حتى قال اللّه فيه‏:‏\n‏{‏لَمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَنْ تَقُومَ فِيهِ‏}‏ ‏.‏\nولهذا كان لمسجد قباء من الفضل ما ليس لغيره، حتى كان ـ صلى الله عليه وسلم ـ يزور قباء كل سبت يصلي فيه، وحث على الصلاة فيه‏.‏\nومنها‏:‏ أنه يستفاد من هذه التعاليل المذكورة في الآية، أربع قواعد مهمة، وهي‏:‏\nكل عمل فيه مضارة لمسلم، أو فيه معصية للّه، فإن المعاصي من فروع الكفر، أو فيه تفريق بين المؤمنين، أو فيه معاونة لمن عادى اللّه ورسوله، فإنه محرم ممنوع منه، وعكسه بعكسه‏.‏\nومنها‏:‏ أن الأعمال الحسية الناشئة عن معصية الله لا تزال مبعدة لفاعلها عن الله بمنزلة الإصرار على المعصية حتى يزيلها ويتوب منها توبة تامة بحيث يتقطع قلبه من الندم والحسرات‏.‏\nومنها‏:‏ أنه إذا كان مسجد قباء مسجدا أسس على التقوى، فمسجد النبي ـ صلى الله عليه وسلم ـ الذي أسسه بيده المباركة وعمل فيه واختاره اللّه له من باب أولى وأحرى‏.‏\nومنها‏:‏ أن العمل المبني على الإخلاص والمتابعة، هو العمل المؤسس على التقوى، الموصل لعامله إلى جنات النعيم‏.‏\nوالعمل المبني على سوء القصد وعلى البدع والضلال، هو العمل المؤسس على شفا جرف هار، فانهار به في نار جهنم، واللّه لا يهدي القوم الظالمين‏.‏\n                                    "
      },
      "originalText": "لَا يَزَالُ بُنۡيَٰنُهُمُ ٱلَّذِي بَنَوۡاْ رِيبَةٗ فِي قُلُوبِهِمۡ إِلَّآ أَن تَقَطَّعَ قُلُوبُهُمۡۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ ٠١١"
    },
    {
      "number": 1346,
      "text": "۞ إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوَالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ ۚ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ ۖ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرَاةِ وَالْإِنْجِيلِ وَالْقُرْآنِ ۚ وَمَنْ أَوْفَىٰ بِعَهْدِهِ مِنَ اللَّهِ ۚ فَاسْتَبْشِرُوا بِبَيْعِكُمُ الَّذِي بَايَعْتُمْ بِهِ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 111,
      "juz": 11,
      "manzil": 2,
      "page": 204,
      "ruku": 169,
      "hizbQuarter": 82,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ إِنَّ ٱللَّهَ ٱشۡتَرَىٰ مِنَ ٱلۡمُؤۡمِنِينَ أَنفُسَهُمۡ وَأَمۡوَٰلَهُم بِأَنَّ لَهُمُ ٱلۡجَنَّةَۚ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ فَيَقۡتُلُونَ وَيُقۡتَلُونَۖ وَعۡدًا عَلَيۡهِ حَقّٗا فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ وَٱلۡقُرۡءَانِۚ وَمَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ مِنَ ٱللَّهِۚ فَٱسۡتَبۡشِرُواْ بِبَيۡعِكُمُ ٱلَّذِي بَايَعۡتُم بِهِۦۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ١١١\n                                    \n                                    \n                                    خبر تعالى أنه عاوض عباده المؤمنين عن أنفسهم وأموالهم إذ بذلوها في سبيله بالجنة ، وهذا من فضله وكرمه وإحسانه ، فإنه قبل العوض عما يملكه بما تفضل به على عباده المطيعين له ؛ ولهذا قال الحسن البصري وقتادة : بايعهم والله فأغلى ثمنهم .\nوقال شمر بن عطية : ما من مسلم إلا ولله ، عز وجل ، في عنقه بيعة ، وفى بها أو مات عليها ، ثم تلا هذه الآية .\nولهذا يقال : من حمل في سبيل الله بايع الله ، أي : قبل هذا العقد ووفى به .\nوقال محمد بن كعب القرظي وغيره : قال عبد الله بن رواحة ، رضي الله عنه ، لرسول الله صلى الله عليه وسلم - يعني ليلة العقبة - : اشترط لربك ولنفسك ما شئت ! فقال : \" أشترط لربي أن تعبدوه ولا تشركوا به شيئا ، وأشترط لنفسي أن تمنعوني مما تمنعون منه أنفسكم وأموالكم \" . قالوا : فما لنا إذا فعلنا ذلك ؟ قال : \" الجنة \" . قالوا : ربح البيع ، لا نقيل ولا نستقيل ، فنزلت : ( إن الله اشترى من المؤمنين أنفسهم وأموالهم ) الآية .\nوقوله : ( يقاتلون في سبيل الله فيقتلون ويقتلون ) أي : سواء قتلوا أو قتلوا ، أو اجتمع لهم هذا وهذا ، فقد وجبت لهم الجنة ؛ ولهذا جاء في الصحيحين : \" وتكفل الله لمن خرج في سبيله ، لا يخرجه إلا جهاد في سبيلي ، وتصديق برسلي ، بأن توفاه أن يدخله الجنة ، أو يرجعه إلى مسكنه الذي خرج منه ، نائلا ما نال من أجر أو غنيمة \" .\nوقوله : ( وعدا عليه حقا في التوراة والإنجيل والقرآن ) تأكيد لهذا الوعد ، وإخبار بأنه قد كتبه على نفسه الكريمة ، وأنزله على رسله في كتبه الكبار ، وهي التوراة المنزلة على موسى ، والإنجيل المنزل على عيسى ، والقرآن المنزل على محمد ، صلوات الله وسلامه عليهم أجمعين .\nوقوله : ( ومن أوفى بعهده من الله ) [ أي : ولا واحد أعظم وفاء بما عاهد عليه من الله ] فإنه لا يخلف الميعاد ، وهذا كقوله تعالى : ( ومن أصدق من الله حديثا ) [ النساء : 87 ] ( ومن أصدق من الله قيلا ) [ النساء : 122 ] ؛ ولهذا قال : ( فاستبشروا ببيعكم الذي بايعتم به وذلك هو الفوز العظيم ) أي : فليستبشر من قام بمقتضى هذا العقد ووفى بهذا العهد ، بالفوز العظيم ، والنعيم المقيم .\n                                    ",
        "qortoby": "۞ إِنَّ ٱللَّهَ ٱشۡتَرَىٰ مِنَ ٱلۡمُؤۡمِنِينَ أَنفُسَهُمۡ وَأَمۡوَٰلَهُم بِأَنَّ لَهُمُ ٱلۡجَنَّةَۚ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ فَيَقۡتُلُونَ وَيُقۡتَلُونَۖ وَعۡدًا عَلَيۡهِ حَقّٗا فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ وَٱلۡقُرۡءَانِۚ وَمَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ مِنَ ٱللَّهِۚ فَٱسۡتَبۡشِرُواْ بِبَيۡعِكُمُ ٱلَّذِي بَايَعۡتُم بِهِۦۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ١١١\n                                    \n                                    \n                                    قوله تعالى إن الله اشترى من المؤمنين أنفسهم وأموالهم بأن لهم الجنة يقاتلون في سبيل الله فيقتلون ويقتلون وعدا عليه حقا في التوراة والإنجيل والقرآن ومن أوفى بعهده من الله فاستبشروا ببيعكم الذي بايعتم به وذلك هو الفوز العظيم\nفيه ثمان مسائل :\nالأولى : قوله تعالى إن الله اشترى من المؤمنين أنفسهم قيل : هذا تمثيل ; مثل قوله تعالى : أولئك الذين اشتروا الضلالة بالهدى . ونزلت الآية في البيعة الثانية ، وهي بيعة العقبة الكبرى ، وهي التي أناف فيها رجال الأنصار على السبعين ، وكان أصغرهم سنا عقبة بن عمرو ; وذلك أنهم اجتمعوا إلى رسول الله صلى الله عليه وسلم عند العقبة ، فقال عبد الله بن رواحة للنبي صلى الله عليه وسلم : اشترط لربك ولنفسك ما شئت ; فقال النبي صلى الله عليه وسلم : أشترط لربي أن تعبدوه ولا تشركوا به شيئا وأشترط لنفسي أن تمنعوني مما تمنعون منه أنفسكم وأموالكم . قالوا : فإذا فعلنا ذلك فما لنا ؟ قال : الجنة . قالوا : ربح البيع ، لا نقيل ولا نستقيل ; فنزلت : إن الله اشترى من المؤمنين أنفسهم وأموالهم بأن لهم الجنة الآية . ثم هي بعد ذلك عامة في كل مجاهد في سبيل الله من أمة محمد صلى الله عليه وسلم إلى يوم القيامة .\nالثانية : هذه الآية دليل على جواز معاملة السيد مع عبده ، وإن كان الكل للسيد لكن إذا ملكه عامله فيما جعل إليه . وجائز بين السيد وعبده ما لا يجوز بينه وبين غيره ; لأن ماله له وله انتزاعه .\nالثالثة : أصل الشراء بين الخلق أن يعوضوا عما خرج من أيديهم ما كان أنفع لهم أو مثل ما خرج عنهم في النفع ; فاشترى الله سبحانه من العباد إتلاف أنفسهم وأموالهم في طاعته ، وإهلاكها في مرضاته ، وأعطاهم سبحانه الجنة عوضا عنها إذا فعلوا ذلك . وهو عوض عظيم لا يدانيه المعوض ولا يقاس به ، فأجرى ذلك على مجاز ما يتعارفونه في البيع والشراء فمن العبد تسليم النفس والمال ، ومن الله الثواب والنوال فسمي هذا شراء . وروى الحسن قال : قال رسول الله صلى الله عليه وسلم : إن فوق كل بر بر حتى يبذل العبد دمه فإذا فعل ذلك فلا بر فوق ذلك . وقال الشاعر في معنى البر :\nالجود بالماء جود فيه مكرمة والجود بالنفس أقصى غاية الجود\nوأنشد الأصمعي لجعفر الصادق رضي الله عنه :\nأثامن بالنفس النفيسة ربها وليس لها في الخلق كلهم ثمن\nبها تشترى الجنات إن أنا بعتها بشيء سواها إن ذلكم غبن\nلئن ذهبت نفسي بدنيا أصبتها لقد ذهبت نفسي وقد ذهب الثمن\nقال الحسن : ومر أعرابي على النبي صلى الله عليه وسلم وهو يقرأ هذه الآية : إن الله اشترى من المؤمنين أنفسهم فقال : كلام من هذا ؟ قال : كلام الله . قال : بيع والله مربح لا نقيله ولا نستقيله . فخرج إلى الغزو واستشهد .\nالرابعة : قال العلماء : كما اشترى من المؤمنين البالغين المكلفين كذلك اشترى من الأطفال فآلمهم وأسقمهم ; لما في ذلك من المصلحة وما فيه من الاعتبار للبالغين ، فإنهم لا يكونون عند شيء أكثر صلاحا وأقل فسادا منهم عند ألم الأطفال ، وما يحصل للوالدين الكافلين من الثواب فيما ينالهم من الهم ويتعلق بهم من التربية والكفالة . ثم هو عز وجل يعوض هؤلاء الأطفال عوضا إذا صاروا إليه . ونظير هذا في الشاهد أنك تكتري الأجير ليبني وينقل التراب وفي كل ذلك له ألم وأذى ، ولكن ذلك جائز لما في عمله من المصلحة ولما يصل إليه من الأجر .\nالخامسة : قوله تعالى يقاتلون في سبيل الله بيان لما يقاتل له وعليه ; وقد تقدم .\nفيقتلون ويقتلون قرأ النخعي والأعمش وحمزة والكسائي وخلف بتقديم المفعول على الفاعل ; ومنه قول امرئ القيس :\nفإن تقتلونا نقتلكم . . . وإن تقصدوا لدم نقصد\nأي إن تقتلوا بعضنا يقتلكم بعضنا . وقرأ الباقون بتقديم الفاعل على المفعول .\nالسادسة : قوله تعالى وعدا عليه حقا في التوراة والإنجيل والقرآن إخبار من الله تعالى أن هذا كان في هذه الكتب ، وأن الجهاد ومقاومة الأعداء أصله من عهد موسى عليه السلام . و ( وعدا ) و ( حقا ) مصدران موكدان .\nالسابعة : قوله تعالى ومن أوفى بعهده من الله أي لا أحد أوفى بعهده من الله . وهو يتضمن الوفاء بالوعد والوعيد ، ولا يتضمن وفاء البارئ بالكل ; فأما وعده فللجميع ، وأما وعيده فمخصوص ببعض المذنبين وببعض الذنوب وفي بعض الأحوال . وقد تقدم هذا المعنى مستوفى .\nالثامنة : قوله تعالى فاستبشروا ببيعكم الذي بايعتم به أي أظهروا السرور بذلك . والبشارة إظهار السرور في البشرة . وقد تقدم . وقال الحسن : والله ما على الأرض مؤمن إلا يدخل في هذه البيعة .\nوذلك هو الفوز العظيم أي الظفر بالجنة والخلود فيها .\n                                    ",
        "saadi": "۞ إِنَّ ٱللَّهَ ٱشۡتَرَىٰ مِنَ ٱلۡمُؤۡمِنِينَ أَنفُسَهُمۡ وَأَمۡوَٰلَهُم بِأَنَّ لَهُمُ ٱلۡجَنَّةَۚ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ فَيَقۡتُلُونَ وَيُقۡتَلُونَۖ وَعۡدًا عَلَيۡهِ حَقّٗا فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ وَٱلۡقُرۡءَانِۚ وَمَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ مِنَ ٱللَّهِۚ فَٱسۡتَبۡشِرُواْ بِبَيۡعِكُمُ ٱلَّذِي بَايَعۡتُم بِهِۦۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ١١١\n                                        \n                                        \n                                        \n                                        يخبر تعالى خبرا صدقا، ويعد وعدا حقا بمبايعة عظيمة، ومعاوضة جسيمة، وهو أنه ‏{‏اشْتَرَى‏}‏ بنفسه الكريمة ‏{‏مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوَالَهُمْ‏}‏ فهي المثمن والسلعة المبيعة‏.‏\n‏{‏بِأَنَّ لَهُمُ الْجَنَّةَ‏}‏ التي فيها ما تشتهيه الأنفس، وتلذ الأعين من أنواع اللذات والأفراح، والمسرات، والحور الحسان، والمنازل الأنيقات‏.‏\nوصفة العقد والمبايعة، بأن يبذلوا للّه نفوسهم وأموالهم في جهاد أعدائه، لإعلاء كلمته وإظهار دينه فـ ‏{‏يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ‏}‏ فهذا العقد والمبايعة، قد صدرت من اللّه مؤكدة بأنواع التأكيدات‏.‏\n‏{‏وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرَاةِ وَالْإِنْجِيلِ وَالْقُرْآنِ‏}‏ التي هي أشرف الكتب التي طرقت العالم، وأعلاها، وأكملها، وجاء بها أكمل الرسل أولو العزم، وكلها اتفقت على هذا الوعد الصادق‏.‏\n‏{‏وَمَنْ أَوْفَى بِعَهْدِهِ مِنَ اللَّهِ فَاسْتَبْشِرُوا‏}‏ أيها المؤمنون القائمون بما وعدكم اللّه، ‏{‏بِبَيْعِكُمُ الَّذِي بَايَعْتُمْ بِهِ‏}‏ أي‏:‏ لتفرحوا بذلك، وليبشر بعضكم بعضًا، ويحث بعضكم بعضًا‏.‏\n‏{‏وَذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ‏}‏ الذي لا فوز أكبر منه، ولا أجل، لأنه يتضمن السعادة الأبدية، والنعيم المقيم، والرضا من اللّه الذي هو أكبر من نعيم الجنات، وإذا أردت أن تعرف مقدار الصفقة، فانظر إلى المشتري من هو‏؟‏ وهو اللّه جل جلاله، وإلى العوض، وهو أكبر الأعواض وأجلها، جنات النعيم، وإلى الثمن المبذول فيها، وهو النفس، والمال، الذي هو أحب الأشياء للإنسان‏.‏\nوإلى من جرى على يديه عقد هذا التبايع، وهو أشرف الرسل، وبأي كتاب رقم، وهي كتب اللّه الكبار المنزلة على أفضل الخلق‏.‏\n                                    "
      },
      "originalText": "۞ إِنَّ ٱللَّهَ ٱشۡتَرَىٰ مِنَ ٱلۡمُؤۡمِنِينَ أَنفُسَهُمۡ وَأَمۡوَٰلَهُم بِأَنَّ لَهُمُ ٱلۡجَنَّةَۚ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ فَيَقۡتُلُونَ وَيُقۡتَلُونَۖ وَعۡدًا عَلَيۡهِ حَقّٗا فِي ٱلتَّوۡرَىٰةِ وَٱلۡإِنجِيلِ وَٱلۡقُرۡءَانِۚ وَمَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ مِنَ ٱللَّهِۚ فَٱسۡتَبۡشِرُواْ بِبَيۡعِكُمُ ٱلَّذِي بَايَعۡتُم بِهِۦۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ١١١"
    }
  ]
}