{
  "number": 206,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 1353,
      "text": "وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّىٰ إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ وَظَنُّوا أَنْ لَا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا ۚ إِنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 118,
      "juz": 11,
      "manzil": 2,
      "page": 206,
      "ruku": 169,
      "hizbQuarter": 82,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٨١١\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا يعقوب بن إبراهيم ، حدثنا ابن أخي الزهري محمد بن عبد الله ، عن عمه محمد بن مسلم الزهري ، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك ، أن عبد الله بن كعب بن مالك - وكان قائد كعب من بنيه حين عمي - قال : سمعت كعب بن مالك يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك ، فقال كعب بن مالك : لم أتخلف عن رسول الله صلى الله عليه وسلم في غزاة غيرها قط إلا في غزوة تبوك ، غير أني كنت تخلفت في غزاة بدر ، ولم يعاتب أحد تخلف عنها ، وإنما خرج رسول الله صلى الله عليه وسلم يريد عير قريش ، حتى جمع الله بينهم وبين عدوهم على غير ميعاد ، ولقد شهدت مع رسول الله صلى الله عليه وسلم ليلة العقبة حين توافقنا على الإسلام ، وما أحب أن لي بها مشهد بدر ، وإن كانت بدر أذكر في الناس منها وأشهر ، وكان من خبري حين تخلفت عن رسول الله صلى الله عليه وسلم في غزوة تبوك أني لم أكن قط أقوى ولا أيسر مني حين تخلفت عنه في تلك الغزاة ، والله ما جمعت قبلها راحلتين قط حتى جمعتهما في تلك الغزاة ، وكان رسول الله صلى الله عليه وسلم قلما يريد غزوة يغزوها إلا ورى بغيرها ، حتى كانت تلك الغزوة فغزاها رسول الله صلى الله عليه وسلم في حر شديد ، واستقبل سفرا بعيدا ومفازا ، واستقبل عدوا كثيرا فجلى للمسلمين أمرهم ليتأهبوا أهبة عدوهم ، فأخبرهم وجهه الذي يريد ، والمسلمون مع رسول الله صلى الله عليه وسلم كثير ، لا يجمعهم كتاب حافظ - يريد الديوان - فقال كعب : فقل رجل يريد أن يتغيب إلا ظن أن ذلك سيخفى له ما لم ينزل فيه وحي من الله ، عز وجل ، وغزا رسول الله صلى الله عليه وسلم تلك الغزاة حين طابت الثمار والظل ، وأنا إليها أصعر . فتجهز إليها رسول الله صلى الله عليه وسلم والمؤمنون معه ، وطفقت أغدو لكي أتجهز معهم ، فأرجع ولم أقض من جهازي شيئا ، فأقول لنفسي : أنا قادر على ذلك إذا أردت ، فلم يزل ذلك يتمادى بي حتى شمر بالناس الجد ، فأصبح رسول الله صلى الله عليه وسلم غاديا والمسلمون معه ، ولم أقض من جهازي شيئا ، وقلت : الجهاز بعد يوم أو يومين ثم ألحقه فغدوت بعدما فصلوا لأتجهز ، فرجعت ولم أقض شيئا من جهازي . ثم غدوت فرجعت ولم أقض شيئا ، فلم يزل [ ذلك ] يتمادى بي حتى أسرعوا وتفارط الغزو ، فهممت أن أرتحل فأدركهم - وليت أني فعلت - ثم لم يقدر ذلك لي ، فطفقت إذا خرجت في الناس بعد [ خروج ] رسول الله صلى الله عليه وسلم [ فطفت فيهم ] يحزنني ألا أرى إلا رجلا مغموصا عليه في النفاق ، أو رجلا ممن عذره الله ، عز وجل ، ولم يذكرني رسول الله صلى الله عليه وسلم حتى بلغ تبوك ، فقال وهو جالس في القوم بتبوك : \" ما فعل كعب بن مالك ؟ \" قال رجل من بني سلمة : حبسه يا رسول الله برداه ، والنظر في عطفيه فقال له معاذ بن جبل : بئسما قلت ! والله يا رسول الله ما علمنا عليه إلا خيرا ! فسكت رسول الله صلى الله عليه وسلم ، قال كعب بن مالك : فلما بلغني أن رسول الله صلى الله عليه وسلم قد توجه قافلا من تبوك حضرني بثي فطفقت أتذكر الكذب ، وأقول : بماذا أخرج من سخطه غدا ؟ أستعين على ذلك كل ذي رأي من أهلي . فلما قيل : إن رسول الله صلى الله عليه وسلم قد أظل قادما ، زاح عني الباطل وعرفت أني لم أنج منه بشيء أبدا . فأجمعت صدقه ، وصبح رسول الله صلى الله عليه وسلم ، وكان إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ، ثم جلس للناس . فلما فعل ذلك جاءه المتخلفون فطفقوا يعتذرون إليه ويحلفون له - وكانوا بضعة وثمانين رجلا - فقبل منهم رسول الله صلى الله عليه وسلم علانيتهم ويستغفر لهم ، ويكل سرائرهم إلى الله تعالى ، حتى جئت ، فلما سلمت عليه تبسم تبسم المغضب ، ثم قال لي : \" تعال \" ، فجئت أمشي حتى جلست بين يديه ، فقال لي : \" ما خلفك ، ألم تك قد اشتريت ظهرك \" ؟ قال : فقلت : يا رسول الله ، إني لو جلست عند غيرك من أهل الدنيا لرأيت أن أخرج من سخطه بعذر ، لقد أعطيت جدلا ولكنه والله لقد علمت لئن حدثتك اليوم حديث كذب ترضى به عني ، ليوشكن الله يسخطك علي ، ولئن حدثتك بصدق تجد علي فيه ، إني لأرجو أقرب عقبى ذلك [ عفوا ] من الله ، عز وجل والله ما كان لي عذر ، والله ما كنت قط أفرغ ولا أيسر مني حين تخلفت عنك قال : فقال رسول الله صلى الله عليه وسلم : \" أما هذا فقد صدق ، فقم حتى يقضي الله فيك \" . فقمت وبادرني رجال من بني سلمة واتبعوني ، فقالوا لي : والله ما علمناك كنت أذنبت ذنبا قبل هذا ، ولقد عجزت ألا تكون اعتذرت إلى رسول الله صلى الله عليه وسلم بما اعتذر به المتخلفون فقد كان كافيك [ من ذنبك ] استغفار رسول الله صلى الله عليه وسلم لك . قال : فوالله ما زالوا يؤنبوني حتى أردت أن أرجع فأكذب نفسي : قال : ثم قلت لهم : هل لقي هذا معي أحد ؟ قالوا : نعم ، [ لقيه معك ] رجلان ، قالا ما قلت ، وقيل لهما مثل ما قيل لك . قلت : فمن هما ؟ قالوا : مرارة بن الربيع العامري ، وهلال بن أمية الواقفي . فذكروا لي رجلين صالحين قد شهدا بدرا لي فيهما أسوة . قال : فمضيت حين ذكروهما لي - قال : ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا - أيها الثلاثة - من بين من تخلف عنه ، فاجتنبنا الناس وتغيروا لنا ، حتى تنكرت لي في نفسي الأرض ، فما هي بالأرض التي كنت أعرف ، فلبثنا على ذلك خمسين ليلة . فأما صاحباي فاستكانا وقعدا في بيوتهما يبكيان ، وأما أنا فكنت أشب القوم وأجلدهم ، فكنت أشهد الصلاة مع المسلمين ، وأطوف بالأسواق فلا يكلمني أحد ، وآتي رسول الله صلى الله عليه وسلم وهو في مجلسه بعد الصلاة فأسلم ، وأقول في نفسي : حرك شفتيه برد السلام علي أم لا ؟ ثم أصلي قريبا منه ، وأسارقه النظر ، فإذا أقبلت على صلاتي نظر إلي ، فإذا التفت نحوه أعرض ، حتى إذا طال علي ذلك من هجر المسلمين مشيت حتى تسورت حائط أبي قتادة - وهو ابن عمي ، وأحب الناس إلي - فسلمت عليه ، فوالله ما رد علي السلام ، فقلت له : يا أبا قتادة ، أنشدك الله : هل تعلم أني أحب الله ورسوله ؟ قال : فسكت . قال : فعدت فنشدته [ فسكت ، فعدت فنشدته ] فقال : الله ورسوله أعلم . قال : ففاضت عيناي وتوليت حتى تسورت الجدار . فبينا أنا أمشي بسوق المدينة إذا نبطي من أنباط الشام ، ممن قدم بطعام يبيعه بالمدينة يقول : من يدل على كعب بن مالك ؟ قال : فطفق الناس يشيرون له إلي ، حتى جاء فدفع إلي كتابا من ملك غسان ، وكنت كاتبا فإذا فيه : أما بعد ، فقد بلغنا أن صاحبك قد جفاك ولم يجعلك الله بدار هوان ولا مضيعة ، فالحق بنا نواسك . قال : فقلت حين قرأتها : وهذا أيضا من البلاء . قال : فتيممت به التنور فسجرته حتى إذا مضت أربعون ليلة من الخمسين ، إذا برسول رسول الله صلى الله عليه وسلم يأتيني ، فقال : إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك . قال : فقلت : أطلقها أم ماذا أفعل ؟ قال : بل اعتزلها ولا تقربها . قال : وأرسل إلى صاحبي بمثل ذلك قال : فقلت لامرأتي : الحقي بأهلك ، فكوني عندهم حتى يقضي الله في هذا الأمر . قال : فجاءت امرأة هلال بن أمية رسول الله صلى الله عليه وسلم فقالت له : يا رسول الله ، إن هلالا شيخ ضائع ليس له خادم ، فهل تكره أن أخدمه ؟ قال : \" لا ولكن لا يقربنك \" قالت : وإنه والله ما به حركة إلى شيء ، والله ما يزال يبكي من لدن أن كان من أمرك ما كان إلى يومه هذا . قال : فقال لي بعض أهلي : لو استأذنت رسول الله صلى الله عليه وسلم في امرأتك ، فقد أذن لامرأة هلال بن أمية أن تخدمه . قال : فقلت : والله لا أستأذن فيها رسول الله صلى الله عليه وسلم ، وما أدري ما يقول رسول الله صلى الله عليه وسلم إذا استأذنته وأنا رجل شاب ؟ قال : فلبثنا [ بعد ذلك ] عشر ليال ، فكمل لنا خمسون ليلة من حين نهى عن كلامنا قال : ثم صليت صلاة الفجر صباح خمسين ليلة على ظهر بيت من بيوتنا ، فبينا أنا جالس على الحال التي ذكر الله تعالى منا : قد ضاقت علي نفسي ، وضاقت علي الأرض بما رحبت سمعت صارخا أوفى على جبل سلع يقول بأعلى صوته : يا كعب بن مالك ، أبشر . قال : فخررت ساجدا ، وعرفت أن قد جاء فرج ، فآذن رسول الله صلى الله عليه وسلم بتوبة الله علينا حين صلى الفجر ، فذهب الناس يبشروننا ، وذهب قبل صاحبي مبشرون ، وركض إلي رجل فرسا ، وسعى ساع من أسلم وأوفى على الجبل ، فكان الصوت أسرع من الفرس . فلما جاءني الذي سمعت صوته يبشرني ، فنزعت ثوبي ، فكسوتهما إياه ببشارته ، والله ما أملك غيرهما يومئذ ، واستعرت ثوبين فلبستهما ، وانطلقت أؤم رسول الله صلى الله عليه وسلم ، يلقاني الناس فوجا فوجا يهنئوني بالتوبة ، يقولون : ليهنك توبة الله عليك . حتى دخلت المسجد ، فإذا رسول الله صلى الله عليه وسلم جالس في المسجد حوله الناس ، فقام إلي طلحة بن عبيد الله يهرول ، حتى صافحني وهنأني ، والله ما قام إلي رجل من المهاجرين غيره قال : فكان كعب لا ينساها لطلحة . قال كعب : فلما سلمت على رسول الله صلى الله عليه وسلم قال وهو يبرق وجهه من السرور : \" أبشر بخير يوم مر عليك منذ ولدتك أمك \" . قال : قلت : أمن عندك يا رسول الله أم من عند الله ؟ قال : \" لا بل من عند الله \" . قال : وكان رسول الله صلى الله عليه وسلم إذا سر استنار وجهه حتى كأنه قطعة قمر ، حتى يعرف ذلك منه . فلما جلست بين يديه قلت : يا رسول الله ، إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله . قال : \" أمسك عليك بعض مالك ، فهو خير لك \" . قال : فقلت : فإني أمسك سهمي الذي بخيبر . وقلت : يا رسول الله ، إنما نجاني الله بالصدق ، وإن من توبتي ألا أحدث إلا صدقا ما بقيت . قال : فوالله ما أعلم أحدا من المسلمين أبلاه الله من الصدق في الحديث منذ ذكرت ذلك لرسول الله صلى الله عليه وسلم أحسن مما أبلاني الله تعالى ، والله ما تعمدت كذبة منذ قلت ذلك لرسول الله صلى الله عليه وسلم إلى يومي هذا ، وإني لأرجو أن يحفظني الله فيما بقي . قال : وأنزل الله تعالى : ( لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة من بعد ما كاد يزيغ قلوب فريق منهم ثم تاب عليهم إنه بهم رءوف رحيم . وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت وضاقت عليهم أنفسهم وظنوا أن لا ملجأ من الله إلا إليه ثم تاب عليهم ليتوبوا إن الله هو التواب الرحيم . يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين ) قال كعب : فوالله ما أنعم الله علي من نعمة قط بعد أن هداني للإسلام أعظم في نفسي من صدقي رسول الله صلى الله عليه وسلم يومئذ ألا أكون كذبته فأهلك كما هلك الذين كذبوه [ حين كذبوه ] ؛ فإن الله تعالى قال للذين كذبوه حين أنزل الوحي شر ما قال لأحد ، قال الله تعالى : ( سيحلفون بالله لكم إذا انقلبتم إليهم لتعرضوا عنهم فأعرضوا عنهم إنهم رجس ومأواهم جهنم جزاء بما كانوا يكسبون . يحلفون لكم لترضوا عنهم فإن ترضوا عنهم فإن الله لا يرضى عن القوم الفاسقين ) [ التوبة : 95 ، 96 ] . قال : وكنا خلفنا - أيها الثلاثة - عن أمر أولئك الذين قبل منهم رسول الله صلى الله عليه وسلم حين حلفوا ، فبايعهم واستغفر لهم ، وأرجأ رسول الله أمرنا ، حتى قضى الله فيه ، فبذلك قال الله تعالى : ( وعلى الثلاثة الذين خلفوا ) وليس تخليفه إيانا وإرجاؤه أمرنا الذي ذكر مما خلفنا بتخلفنا عن الغزو ، وإنما هو عمن حلف له واعتذر إليه ، فقبل منه .\nهذا حديث صحيح ثابت متفق على صحته ، رواه صاحبا الصحيح : البخاري ومسلم من حديث الزهري ، بنحوه .\nفقد تضمن هذا الحديث تفسير هذه الآية الكريمة بأحسن الوجوه وأبسطها . وكذا روي عن غير واحد من السلف في تفسيرها ، كما رواه الأعمش ، عن أبي سفيان ، عن جابر بن عبد الله في قوله تعالى : ( وعلى الثلاثة الذين خلفوا ) قال : هم كعب بن مالك ، وهلال بن أمية ، ومرارة بن ربيعة وكلهم من الأنصار .\nوكذا قال مجاهد ، والضحاك ، وقتادة ، والسدي وغير واحد - وكلهم قال : مرارة بن ربيعة .\n[ وكذا في مسلم : مرارة بن ربيعة في بعض نسخه ، وفي بعضها : مرارة بن الربيع ] .\nوفي رواية عن سعيد بن جبير : ربيع بن مرارة .\nوقال الحسن البصري : ربيع بن مرارة أو مرارة بن ربيع .\nوفي رواية عن الضحاك : مرارة بن الربيع ، كما وقع في الصحيحين ، وهو الصواب .\nوقوله : \" فسموا رجلين شهدا بدرا \" ، قيل : إنه خطأ من الزهري ، فإنه لا يعرف شهود واحد من هؤلاء الثلاثة بدرا ، والله أعلم .\nولما ذكر تعالى ما فرج به عن هؤلاء الثلاثة من الضيق والكرب ، من هجر المسلمين إياهم نحوا من خمسين ليلة بأيامها ، وضاقت عليهم أنفسهم ، وضاقت عليهم الأرض بما رحبت ، أي : مع سعتها ، فسددت عليهم المسالك والمذاهب ، فلا يهتدون ما يصنعون ، فصبروا لأمر الله ، واستكانوا لأمر الله ، وثبتوا حتى فرج الله عنهم بسبب صدقهم رسول الله صلى الله عليه وسلم في تخلفهم ، وأنه كان عن غير عذر ، فعوقبوا على ذلك هذه المدة ، ثم تاب الله عليهم ، فكان عاقبة صدقهم خيرا لهم وتوبة عليهم\n                                    ",
        "qortoby": "وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٨١١\n                                    \n                                    \n                                    قوله تعالى وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت وضاقت عليهم أنفسهم وظنوا أن لا ملجأ من الله إلا إليه ثم تاب عليهم ليتوبوا إن الله هو التواب الرحيم\nقوله تعالى وعلى الثلاثة الذين خلفوا قيل : عن التوبة عن مجاهد وأبي مالك . وقال قتادة : عن غزوة تبوك . وحكي عن محمد بن زيد معنى ( خلفوا ) تركوا ; لأن معنى خلفت فلانا تركته وفارقته قاعدا عما نهضت فيه . وقرأ عكرمة بن خالد \" خلفوا \" أي أقاموا بعقب رسول الله صلى الله عليه وسلم . وروي عن جعفر بن محمد أنه قرأ \" خالفوا \" . وقيل : ( خلفوا ) أي أرجئوا وأخروا عن المنافقين فلم يقض فيهم بشيء . وذلك أن المنافقين لم تقبل توبتهم ، واعتذر أقوام فقبل عذرهم ، وأخر النبي صلى الله عليه وسلم هؤلاء الثلاثة حتى نزل فيهم القرآن . وهذا هو الصحيح لما رواه مسلم والبخاري وغيرهما . واللفظ لمسلم قال كعب : كنا خلفنا أيها الثلاثة عن أمر أولئك الذين قبل منهم رسول الله صلى الله عليه وسلم حين حلفوا له فبايعهم واستغفر لهم ، وأرجأ رسول الله صلى الله عليه وسلم أمرنا حتى قضى الله فيه ; فبذلك قال الله عز وجل : وعلى الثلاثة الذين خلفوا وليس الذي ذكر الله مما خلفنا تخلفنا عن الغزو ، وإنما هو تخليفه إيانا وإرجاؤه أمرنا عمن حلف له واعتذر إليه فقبل منه . وهذا الحديث فيه طول ، هذا آخره .\nوالثلاثة الذين خلفوا هم : كعب بن مالك ومرارة بن ربيعة العامري وهلال بن أمية الواقفي وكلهم من الأنصار . وقد خرج البخاري ومسلم حديثهم ، فقال مسلم عن كعب بن مالك قال : لم أتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها قط إلا في غزوة تبوك غير أني قد تخلفت في غزوة بدر ولم يعاتب أحدا تخلف عنه إنما خرج رسول الله صلى الله عليه وسلم والمسلمون يريدون عير قريش حتى جمع الله بينهم وبين عدوهم على غير ميعاد ، ولقد شهدت مع رسول الله صلى الله عليه وسلم ليلة العقبة حين تواثقنا على الإسلام وما أحب أن لي بها مشهد بدر وإن كانت بدر أذكر في الناس منها وكان من خبري حين تخلفت عن رسول الله صلى الله عليه وسلم في غزوة تبوك : أني لم أكن قط أقوى ولا أيسر مني حين تخلفت عنه في تلك الغزوة ، والله ما جمعت قبلها راحلتين قط حتى جمعتهما في تلك الغزوة ، فغزاها رسول الله صلى الله عليه وسلم في حر شديد واستقبل سفرا بعيدا ومفازا واستقبل عدوا كثيرا فجلا للمسلمين أمرهم ليتأهبوا أهبة غزوهم فأخبرهم بوجهه الذي يريد والمسلمون مع رسول الله صلى الله عليه وسلم كثير ولا يجمعهم كتاب حافظ - يريد بذلك الديوان - قال كعب : فقل رجل يريد أن يتغيب يظن أن ذلك سيخفى له ما لم ينزل فيه وحي من الله تعالى وغزا رسول الله صلى الله عليه وسلم تلك الغزوة حين طابت الثمار والظلال فأنا إليها أصعر ، فتجهز إليها رسول الله صلى الله عليه وسلم والمسلمون معه وطفقت أغدو لكي أتجهز معهم فأرجع ولم أقض شيئا وأقول في نفسي : أنا قادر على ذلك إذا أردت فلم يزل ذلك يتمادى بي حتى استمر بالناس الجد فأصبح رسول الله صلى الله عليه وسلم غازيا والمسلمون معه ولم أقض من جهازي شيئا ثم غدوت فرجعت ولم أقض شيئا فلم يزل كذلك يتمادى بي حتى أسرعوا وتفارط الغزو فهممت أن أترحل فأدركهم فيا ليتني فعلت ثم لم يقدر ذلك لي فطفقت إذ خرجت في الناس بعد خروج رسول الله صلى الله عليه وسلم يحزنني أني لا أرى لي أسوة إلا رجلا مغموصا عليه في النفاق أو رجلا ممن عذر الله من الضعفاء ولم يذكرني رسول الله صلى الله عليه وسلم حتى بلغ تبوك فقال وهو جالس في القوم بتبوك : ما فعل كعب بن مالك ؟ فقال رجل من بني سلمة : يا رسول الله ، حبسه برداه والنظر في عطفيه . فقال له معاذ بن جبل : بئس ما قلت ، والله يا رسول الله ما علمنا عليه إلا خيرا . فسكت رسول الله صلى الله عليه وسلم فبينما هو على ذلك رأى رجلا مبيضا يزول به السراب فقال رسول الله صلى الله عليه وسلم : كن أبا خيثمة فإذا هو أبو خيثمة الأنصاري وهو الذي تصدق بصاع التمر حتى لمزه المنافقون . فقال كعب بن مالك : فلما بلغني أن رسول الله صلى الله عليه وسلم قد توجه قافلا من تبوك حضرني بثي فطفقت أتذكر الكذب وأقول : بم أخرج من سخطه غدا وأستعين على ذلك كل ذي رأي من أهلي فلما قيل لي : إن رسول الله صلى الله عليه وسلم قد أظل قادما زاح عني الباطل حتى عرفت أني لن أنجو منه بشيء أبدا ، فأجمعت صدقه ، وصبح رسول الله صلى الله عليه وسلم قادما ، وكان إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ثم جلس للناس فلما فعل ذلك جاءه المتخلفون فطفقوا يعتذرون إليه ويحلفون له ، وكانوا بضعة وثمانين رجلا فقبل منهم رسول الله صلى الله عليه وسلم علانيتهم وبايعهم واستغفر لهم ووكل سرائرهم إلى الله حتى جئت فلما سلمت تبسم تبسم المغضب ثم قال : تعال فجئت أمشي حتى جلست بين يديه ، فقال لي : ما خلفك ألم تكن قد ابتعت ظهرك ؟ قال : قلت : يا رسول الله ، إني والله لو جلست عند غيرك من أهل الدنيا لرأيت أني سأخرج من سخطه بعذر ولقد أعطيت جدلا ولكني والله لقد علمت لئن حدثتك اليوم حديث كذب ترضى به عني ليوشكن الله أن يسخطك علي ، ولئن حدثتك حديث صدق تجد علي فيه أني لأرجو فيه عقبى الله ، والله ما كان لي عذر ، والله ما كنت قط أقوى ولا أيسر مني حين تخلفت عنك . قال رسول الله صلى الله عليه وسلم : أما هذا فقد صدق فقم حتى يقضي الله فيك . فقمت وثار رجال من بني سلمة فاتبعوني فقالوا لي : والله ما علمناك أذنبت ذنبا قبل هذا لقد عجزت في ألا تكون اعتذرت إلى رسول الله صلى الله عليه وسلم بما اعتذر به إليه المتخلفون ، فقد كان كافيك ذنبك استغفار رسول الله صلى الله عليه وسلم لك قال : فوالله ما زالوا يؤنبوني حتى أردت أن أرجع إلى رسول الله صلى الله عليه وسلم فأكذب نفسي . قال : ثم قلت لهم هل لقي هذا معي من أحد ؟ قالوا : نعم لقيه معك رجلان قالا مثل ما قلت ، فقيل لهما مثل ما قيل لك . قال قلت : من هما ؟ قالوا : مرارة بن ربيعة العامري وهلال بن أمية الواقفي . قال : فذكروا لي رجلين صالحين قد شهدا بدرا فيهما أسوة ; قال : فمضيت حين ذكروهما لي . قال : ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا أيها الثلاثة من بين من تخلف عنه . قال : فاجتنبنا الناس . وقال : وتغيروا لنا ، حتى تنكرت لي في نفسي الأرض ، فما هي بالأرض التي أعرف ، فلبثنا على ذلك خمسين ليلة ; فأما صاحباي فاستكانا وقعدا في بيوتهما يبكيان ، وأما أنا فكنت أشب القوم وأجلدهم ، فكنت أخرج فأشهد الصلاة وأطوف في الأسواق ولا يكلمني أحد ، وآتي رسول الله صلى الله عليه وسلم فأسلم عليه وهو في مجلسه بعد الصلاة ، فأقول في نفسي : هل حرك شفتيه برد السلام أم لا! ثم أصلي قريبا منه وأسارقه النظر ، فإذا أقبلت على صلاتي نظر إلي وإذا التفت نحوه أعرض عني حتى إذا طال ذلك علي من جفوة المسلمين مشيت حتى تسورت جدار حائط أبي قتادة ، وهو ابن عمي وأحب الناس إلي فسلمت عليه ، فوالله ما رد علي السلام ، فقلت له : يا أبا قتادة أنشدك بالله هل تعلمن أني أحب الله ورسوله ؟ قال : فسكت فعدت فناشدته فسكت ، فعدت فناشدته فقال : الله ورسوله أعلم ففاضت عيناي وتوليت حتى تسورت الجدار ، فبينا أنا أمشي في سوق المدينة إذا نبطي من نبط أهل الشام ممن قدم بالطعام يبيعه بالمدينة يقول : من يدل على كعب بن مالك ؟ قال : فطفق الناس يشيرون له إلي حتى جاءني فدفع إلي كتابا من ملك غسان ، وكنت كاتبا فقرأته فإذا فيه : أما بعد فإنه قد بلغنا أن صاحبك قد جفاك ، ولم يجعلك الله بدار هوان ولا مضيعة ، فالحق بنا نواسك . قال : فقلت حين قرأتها : وهذه أيضا من البلاء فتيممت بها التنور فسجرته بها حتى إذا مضت أربعون من الخمسين واستلبث الوحي إذا رسول رسول الله صلى الله عليه وسلم يأتيني فقال : إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك . قال فقلت : أطلقها أم ماذا أفعل ؟ قال : لا ، بل اعتزلها فلا تقربنها . قال : فأرسل إلى صاحبي بمثل ذلك . قال : فقلت لامرأتي : الحقي بأهلك فكوني عندهم حتى يقضي الله في هذا الأمر . قال : فجاءت امرأة هلال بن أمية رسول الله صلى الله عليه وسلم فقالت له : يا رسول الله ، إن هلال بن أمية شيخ ضائع ليس له خادم ، فهل تكره أن أخدمه ؟ قال : لا ، ولكن لا يقربنك ، فقالت : إنه والله ما به حركة إلى شيء ، ووالله ما زال يبكي منذ كان من أمره ما كان إلى يومه هذا . قال : فقال بعض أهلي لو استأذنت رسول الله صلى الله عليه وسلم في امرأتك فقد أذن لامرأة هلال بن أمية أن تخدمه . قال فقلت : لا أستأذن فيها رسول الله صلى الله عليه وسلم وما يدريني ماذا يقول رسول الله صلى الله عليه وسلم إذا استأذنته فيها وأنا رجل شاب ، قال : فلبثت بذلك عشر ليال فكمل لنا خمسون ليلة من حين نهي عن كلامنا . قال : ثم صليت صلاة الفجر صباح خمسين ليلة على ظهر بيت من بيوتنا فبينا أنا جالس على الحال التي ذكر الله منا قد ضاقت علي نفسي وضاقت علي الأرض بما رحبت سمعت صوت صارخ أوفى على سلع يقول بأعلى صوته : يا كعب بن مالك أبشر . قال : فخررت ساجدا وعرفت أن قد جاء فرج . قال : فآذن رسول الله صلى الله عليه وسلم الناس بتوبة الله علينا حين صلى صلاة الفجر ، فذهب الناس يبشروننا ، فذهب قبل صاحبي مبشرون ، وركض رجل إلي فرسا وسعى ساع من أسلم قبلي وأوفى الجبل فكان الصوت أسرع من الفرس فلما جاءني الذي سمعت صوته يبشرني نزعت له ثوبي فكسوته إياهما ببشارته ، والله ما أملك غيرهما يومئذ ، واستعرت ثوبين فلبستهما فانطلقت أتأمم رسول الله صلى الله عليه وسلم ; فتلقاني الناس فوجا فوجا يهنئونني بالتوبة ويقولون : لتهنئك توبة الله عليك حتى دخلت المسجد فإذا رسول الله صلى الله عليه وسلم جالس في المسجد وحوله الناس فقام طلحة بن عبيد الله يهرول حتى صافحني وهنأني والله ما قام رجل من المهاجرين غيره . قال : فكان كعب لا ينساها لطلحة . قال كعب : فلما سلمت على رسول الله صلى الله عليه وسلم قال وهو يبرق وجهه من السرور ويقول : أبشر بخير يوم مر عليك منذ ولدتك أمك . قال : فقلت أمن عند الله يا رسول الله أم من عندك ؟ قال : لا بل من عند الله . وكان رسول الله صلى الله عليه وسلم إذا سر استنار وجهه حتى كأن وجهه قطعة قمر . قال : وكنا نعرف ذلك . قال : فلما جلست بين يديه قلت : يا رسول الله ، إن من توبة الله علي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ; فقال رسول الله صلى الله عليه وسلم : أمسك عليك بعض مالك فهو خير لك . قال : فقلت : فإني أمسك سهمي الذي بخيبر . قال : وقلت : يا رسول الله ، إن الله إنما أنجاني بالصدق ، وإن من توبتي ألا أحدث إلا صدقا ما بقيت . قال : فوالله ما علمت أحدا من المسلمين أبلاه الله في صدق الحديث منذ ذكرت ذلك لرسول الله صلى الله عليه وسلم إلى يومي هذا أحسن مما أبلاني الله به ، والله ما تعمدت كذبة منذ قلت ذلك لرسول الله صلى الله عليه وسلم إلى يومي هذا وإني لأرجو الله أن يحفظني فيما بقي ، فأنزل الله عز وجل : لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة حتى بلغ \" إنه بهم رءوف رحيم \" . وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت وضاقت عليهم أنفسهم حتى بلغ اتقوا الله وكونوا مع الصادقين . قال كعب : والله ما أنعم الله علي من نعمة قط بعد إذ هداني الله للإسلام أعظم في نفسي من صدقي رسول الله صلى الله عليه وسلم ألا أكون كذبته فأهلك كما هلك الذين كذبوا ، إن الله قال للذين كذبوا حين أنزل الوحي شر ما قال لأحد ، وقال الله تعالى : سيحلفون بالله لكم إذا انقلبتم إليهم لتعرضوا عنهم فأعرضوا عنهم إنهم رجس ومأواهم جهنم جزاء بما كانوا يكسبون . يحلفون لكم لترضوا عنهم فإن ترضوا عنهم فإن الله لا يرضى عن القوم الفاسقين . قال كعب : كنا خلفنا أيها الثلاثة عن أمر أولئك الذين قبل منهم رسول الله صلى الله عليه وسلم حين حلفوا له فبايعهم واستغفر لهم ، وأرجأ رسول الله صلى الله عليه وسلم أمرنا حتى قضى الله فيه ، فبذلك قال الله عز وجل : وعلى الثلاثة وليس الذي ذكر الله مما خلفنا تخلفنا عن الغزو ، وإنما هو تخليفه إيانا وإرجاؤه أمرنا عمن حلف له واعتذر إليه فقبل منه .\nقوله تعالى ضاقت عليهم الأرض بما رحبت أي بما اتسعت يقال : منزل رحب ورحيب ورحاب . و ( ما ) : مصدرية ; أي ضاقت عليهم الأرض برحبها ؛ لأنهم كانوا مهجورين لا يعاملون ولا يكلمون . وفي هذا دليل على هجران أهل المعاصي حتى يتوبوا .\nقوله تعالى وضاقت عليهم أنفسهم أي ضاقت صدورهم بالهم والوحشة ، وبما لقوه من الصحابة من الجفوة .\nوظنوا أن لا ملجأ من الله إلا إليه أي تيقنوا أن لا ملجأ يلجأون إليه في الصفح عنهم وقبول التوبة منهم إلا إليه . قال أبو بكر الوراق . التوبة النصوح أن تضيق على التائب الأرض بما رحبت ، وتضيق عليه نفسه ; كتوبة كعب وصاحبيه .\nقوله تعالى ثم تاب عليهم ليتوبوا إن الله هو التواب الرحيم فبدأ بالتوبة منه . قال أبو زيد : غلطت في أربعة أشياء : في الابتداء مع الله تعالى ، ظننت أني أحبه فإذا هو أحبني ; قال الله تعالى : يحبهم ويحبونه . وظننت أني أرضى عنه فإذا هو قد رضي عني ; قال الله تعالى : رضي الله عنهم ورضوا عنه . وظننت أني أذكره فإذا هو يذكرني ; قال الله تعالى : ولذكر الله أكبر . وظننت أني أتوب فإذا هو قد تاب علي ; قال الله تعالى : ثم تاب عليهم ليتوبوا . وقيل : المعنى ثم تاب عليهم ليثبتوا على التوبة ; كما قال تعالى : يا أيها الذين آمنوا آمنوا وقيل : أي فسح لهم ولم يعجل عقابهم كما فعل بغيرهم ; قال جل وعز : فبظلم من الذين هادوا حرمنا عليهم طيبات أحلت لهم .\n                                    ",
        "saadi": "وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٨١١\n                                        \n                                        \n                                        \n                                        {‏و‏}‏ كذلك لقد تاب الله ‏{‏عَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا‏}‏ عن الخروج مع المسلمين، في تلك الغزوة، وهم‏:‏ ‏\"‏كعب بن مالك‏\"‏ وصاحباه، وقصتهم مشهورة معروفة، في الصحاح والسنن‏.‏\n‏{‏حَتَّى إِذَا‏}‏ حزنوا حزنًا عظيمًا، و‏{‏ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ‏}‏ أي‏:‏ على سعتها ورحبها ‏{‏وَضَاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ‏}‏ التي هي أحب إليهم من كل شيء، فضاق عليهم الفضاء الواسع، والمحبوب الذي لم تجر العادة بالضيق منه، وذلك لا يكون إلا من أمر مزعج، بلغ من الشدة والمشقة ما لا يمكن التعبير عنه، وذلك لأنهم قدموا رضا اللّه ورضا رسوله على كل شيء‏.‏\n‏{‏وَظَنُّوا أَنْ لَا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ‏}‏ أي‏:‏ تيقنوا وعرفوا بحالهم، أنه لا ينجي من الشدائد، ويلجأ إليه، إلا اللّه وحده لا شريك له، فانقطع تعلقهم بالمخلوقين، وتعلقوا باللّه ربهم، وفروا منه إليه، فمكثوا بهذه الشدة نحو خمسين ليلة‏.‏\n‏{‏ثُمَّ تَابَ عَلَيْهِمْ‏}‏ أي‏:‏ أذن في توبتهم ووفقهم لها ‏{‏لِيَتُوبُوا‏}‏ أي‏:‏ لتقع منهم، فيتوب اللّه عليهم، ‏{‏إِنَّ اللَّهَ هُوَ التَّوَّابُ‏}‏ أي‏:‏ كثير التوبة والعفو، والغفران عن الزلات والعصيان، ‏{‏الرَّحِيمِ‏}‏ وصفه الرحمة العظيمة التي لا تزال تنزل على العباد في كل وقت وحين، في جميع اللحظات، ما تقوم به أمورهم الدينية والدنيوية‏.‏\nوفي هذه الآيات دليل على أن توبة اللّه على العبد أجل الغايات، وأعلى النهايات، فإن اللّه جعلها نهاية خواص عباده، وامتن عليهم بها، حين عملوا الأعمال التي يحبها ويرضاها‏.‏\nومنها‏:‏ لطف الله بهم وتثبيتهم في إيمانهم عند الشدائد والنوازل المزعجة‏.‏\nومنها‏:‏ أن العبادة الشاقة على النفس، لها فضل ومزية ليست لغيرها، وكلما عظمت المشقة عظم الأجر‏.‏\nومنها‏:‏ أن توبة اللّه على عبده بحسب ندمه وأسفه الشديد، وأن من لا يبالي بالذنب ولا يحرج إذا فعله، فإن توبته مدخولة، وإن زعم أنها مقبولة‏.‏\nومنها‏:‏ أن علامة الخير وزوال الشدة، إذا تعلق القلب بالله تعالى تعلقا تاما، وانقطع عن المخلوقين‏.‏\nومنها‏:‏ أن من لطف اللّه بالثلاثة، أن وسمهم بوسم، ليس بعار عليهم فقال‏:‏ ‏{‏خُلِّفُوا‏}‏ إشارة إلى أن المؤمنين خلفوهم، ‏[‏أو خلفوا عن من بُتّ في قبول عذرهم، أو في رده‏]‏ وأنهم لم يكن تخلفهم رغبة عن الخير، ولهذا لم يقل‏:‏ ‏\"‏تخلفوا‏\"‏‏.‏\nومنها‏:‏ أن اللّه تعالى من عليهم بالصدق.‏\n                                    "
      },
      "originalText": "وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٨١١"
    },
    {
      "number": 1354,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 119,
      "juz": 11,
      "manzil": 2,
      "page": 206,
      "ruku": 170,
      "hizbQuarter": 82,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ ٩١١\n                                    \n                                    \n                                    ؛ ولهذا قال : ( يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين ) أي : اصدقوا والزموا الصدق تكونوا مع أهله وتنجوا من المهالك ويجعل لكم فرجا من أموركم ، ومخرجا ، وقد قال الإمام أحمد : حدثنا أبو معاوية ، حدثنا الأعمش عن شقيق ؛ عن عبد الله ، هو ابن مسعود ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" عليكم بالصدق ؛ فإن الصدق يهدي إلى البر وإن البر يهدي إلى الجنة ، وما يزال الرجل يصدق ويتحرى الصدق حتى يكتب عند الله صديقا ، وإياكم والكذب ، فإن الكذب يهدي إلى الفجور ، وإن الفجور يهدي إلى النار ، وما يزال الرجل يكذب ويتحرى الكذب ، حتى يكتب عند الله كذابا \" .\nأخرجاه في الصحيحين .\nوقال شعبة ، عن عمرو بن مرة ، سمع أبا عبيدة يحدث عن عبد الله بن مسعود ، رضي الله عنه ، أنه قال : [ إن ] الكذب لا يصلح منه جد ولا هزل ، اقرءوا إن شئتم : ( يا أيها الذين آمنوا اتقوا الله وكونوا من الصادقين ) - هكذا قرأها - ثم قال : فهل تجدون لأحد فيه رخصة .\nوعن عبد الله بن عمر : ( اتقوا الله وكونوا مع الصادقين ) مع محمد صلى الله عليه وسلم وأصحابه .\nوقال الضحاك : مع أبي بكر وعمر وأصحابهما .\nوقال الحسن البصري : إن أردت أن تكون مع الصادقين ، فعليك بالزهد في الدنيا ، والكف عن أهل الملة .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ ٩١١\n                                    \n                                    \n                                    قوله تعالى يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين\nفيه مسألتان : الأولى : قوله تعالى : وكونوا مع الصادقين هذا الأمر بالكون مع أهل الصدق حسن بعد قصة الثلاثة حين نفعهم الصدق وذهب بهم عن منازل المنافقين . قال مطرف : سمعت مالك بن أنس يقول : قلما كان رجل صادقا لا يكذب إلا متع بعقله ولم يصبه ما يصيب غيره من الهرم والخرف .\nواختلف في المراد هنا بالمؤمنين والصادقين على أقوال ; فقيل : هو خطاب لمن آمن من أهل الكتاب . وقيل : هو خطاب لجميع المؤمنين ; أي اتقوا مخالفة أمر الله . وكونوا مع الصادقين أي مع الذين خرجوا مع النبي صلى الله عليه وسلم لا مع المنافقين . أي كونوا على مذهب الصادقين وسبيلهم . وقيل : هم الأنبياء ; أي كونوا معهم بالأعمال الصالحة في الجنة . وقيل : هم المراد بقوله : ليس البر أن تولوا وجوهكم - الآية إلى قوله - أولئك الذين صدقوا . وقيل : هم الموفون بما عاهدوا ; وذلك لقوله تعالى : رجال صدقوا ما عاهدوا الله عليه وقيل : هم المهاجرون ; لقول أبي بكر يوم السقيفة إن الله سمانا الصادقين فقال : للفقراء المهاجرين الآية ، ثم سماكم بالمفلحين فقال : والذين تبوءوا الدار والإيمان الآية . وقيل : هم الذين استوت ظواهرهم وبواطنهم . قال ابن العربي : وهذا القول هو الحقيقة والغاية التي إليها المنتهى فإن هذه الصفة يرتفع بها النفاق في العقيدة والمخالفة في الفعل ، وصاحبها يقال له الصديق كأبي بكر وعمر وعثمان ومن دونهم على منازلهم وأزمانهم . وأما من قال : إنهم المراد بآية البقرة فهو معظم الصدق ويتبعه الأقل وهو معنى آية الأحزاب . وأما تفسير أبي بكر الصديق فهو الذي يعم الأقوال كلها فإن جميع الصفات فيهم موجودة .\nالثانية : حق من فهم عن الله وعقل عنه أن يلازم الصدق في الأقوال ، والإخلاص في الأعمال ، والصفاء في الأحوال ، فمن كان كذلك لحق بالأبرار ووصل إلى رضا الغفار ; قال صلى الله عليه وسلم : عليكم بالصدق فإن الصدق يهدي إلى البر وإن البر يهدي إلى الجنة وما يزال الرجل يصدق ويتحرى الصدق حتى يكتب عند الله صديقا . والكذب على الضد من ذلك ; قال صلى الله عليه وسلم : إياكم والكذب فإن الكذب يهدي إلى الفجور وإن الفجور يهدي إلى النار وما يزال الرجل يكذب ويتحرى الكذب حتى يكتب عند الله كذابا خرجه مسلم . فالكذب عار وأهله مسلوبو الشهادة ، وقد رد صلى الله عليه وسلم شهادة رجل في كذبة كذبها . قال معمر : لا أدري أكذب على الله أو كذب على رسوله أو كذب على أحد من الناس . وسئل شريك بن عبد الله فقيل له : يا أبا عبد الله ، رجل سمعته يكذب متعمدا أأصلي خلفه ؟ قال لا . وعن ابن مسعود قال : إن الكذب لا يصلح منه جد ولا هزل ، ولا أن يعد أحدكم شيئا ثم لا ينجزه ، اقرءوا إن شئتم يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين هل ترون في الكذب رخصة ؟ وقال مالك : لا يقبل خبر الكاذب في حديث الناس وإن صدق في حديث رسول الله صلى الله عليه وسلم . وقال غيره : يقبل حديثه . والصحيح أن الكاذب لا تقبل شهادته ولا خبره لما ذكرناه ; فإن القبول مرتبة عظيمة وولاية شريفة لا تكون إلا لمن كملت خصاله ولا خصلة هي أشر من الكذب فهي تعزل الولايات وتبطل الشهادات .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ ٩١١\n                                        \n                                        \n                                        \n                                        أي‏:‏ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا‏}‏ باللّه، وبما أمر اللّه بالإيمان به، قوموا بما يقتضيه الإيمان، وهو القيام بتقوى اللّه تعالى، باجتناب ما نهى اللّه عنه والبعد عنه‏.‏\n‏{‏وَكُونُوا مَعَ الصَّادِقِينَ‏}‏ في أقوالهم وأفعالهم وأحوالهم، الذين أقوالهم صدق، وأعمالهم، وأحوالهم لا تكون إلا صدقا خلية من الكسل والفتور، سالمة من المقاصد السيئة، مشتملة على الإخلاص والنية الصالحة، فإن الصدق يهدي إلى البر، وإن البر يهدي إلى الجنة‏.‏\nقال الله تعالى‏:‏ ‏{‏هَذَا يَوْمُ يَنْفَعُ الصَّادِقِينَ صِدْقُهُمْ‏}‏ الآية‏.‏\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ ٩١١"
    },
    {
      "number": 1355,
      "text": "مَا كَانَ لِأَهْلِ الْمَدِينَةِ وَمَنْ حَوْلَهُمْ مِنَ الْأَعْرَابِ أَنْ يَتَخَلَّفُوا عَنْ رَسُولِ اللَّهِ وَلَا يَرْغَبُوا بِأَنْفُسِهِمْ عَنْ نَفْسِهِ ۚ ذَٰلِكَ بِأَنَّهُمْ لَا يُصِيبُهُمْ ظَمَأٌ وَلَا نَصَبٌ وَلَا مَخْمَصَةٌ فِي سَبِيلِ اللَّهِ وَلَا يَطَئُونَ مَوْطِئًا يَغِيظُ الْكُفَّارَ وَلَا يَنَالُونَ مِنْ عَدُوٍّ نَيْلًا إِلَّا كُتِبَ لَهُمْ بِهِ عَمَلٌ صَالِحٌ ۚ إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 120,
      "juz": 11,
      "manzil": 2,
      "page": 206,
      "ruku": 170,
      "hizbQuarter": 82,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَا كَانَ لِأَهۡلِ ٱلۡمَدِينَةِ وَمَنۡ حَوۡلَهُم مِّنَ ٱلۡأَعۡرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ ٱللَّهِ وَلَا يَرۡغَبُواْ بِأَنفُسِهِمۡ عَن نَّفۡسِهِۦۚ ذَٰلِكَ بِأَنَّهُمۡ لَا يُصِيبُهُمۡ ظَمَأٞ وَلَا نَصَبٞ وَلَا مَخۡمَصَةٞ فِي سَبِيلِ ٱللَّهِ وَلَا يَطَ‍ُٔونَ مَوۡطِئٗا يَغِيظُ ٱلۡكُفَّارَ وَلَا يَنَالُونَ مِنۡ عَدُوّٖ نَّيۡلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٞ صَٰلِحٌۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ ٠٢١\n                                    \n                                    \n                                    يعاتب تعالى المتخلفين عن رسول الله صلى الله عليه وسلم في غزوة تبوك ، من أهل المدينة ومن حولها من أحياء العرب ، ورغبتهم بأنفسهم عن مواساته فيما حصل من المشقة ، فإنهم نقصوا أنفسهم من الأجر ؛ لأنهم ( لا يصيبهم ظمأ ) وهو : العطش ( ولا نصب ) وهو : التعب ( ولا مخمصة ) وهي : المجاعة ( ولا يطئون موطئا يغيظ الكفار ) أي : ينزلون منزلا يرهب عدوهم ( ولا ينالون ) منه ظفرا وغلبة عليه إلا كتب الله لهم بهذه الأعمال التي ليست داخلة تحت قدرتهم ، وإنما هي ناشئة عن أفعالهم ، أعمالا صالحة وثوابا جزيلا ( إن الله لا يضيع أجر المحسنين ) كما قال تعالى : ( إنا لا نضيع أجر من أحسن عملا ) [ الكهف : 30 ] .\n                                    ",
        "qortoby": "مَا كَانَ لِأَهۡلِ ٱلۡمَدِينَةِ وَمَنۡ حَوۡلَهُم مِّنَ ٱلۡأَعۡرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ ٱللَّهِ وَلَا يَرۡغَبُواْ بِأَنفُسِهِمۡ عَن نَّفۡسِهِۦۚ ذَٰلِكَ بِأَنَّهُمۡ لَا يُصِيبُهُمۡ ظَمَأٞ وَلَا نَصَبٞ وَلَا مَخۡمَصَةٞ فِي سَبِيلِ ٱللَّهِ وَلَا يَطَ‍ُٔونَ مَوۡطِئٗا يَغِيظُ ٱلۡكُفَّارَ وَلَا يَنَالُونَ مِنۡ عَدُوّٖ نَّيۡلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٞ صَٰلِحٌۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ ٠٢١\n                                    \n                                    \n                                    قوله تعالى ما كان لأهل المدينة ومن حولهم من الأعراب أن يتخلفوا عن رسول الله ولا يرغبوا بأنفسهم عن نفسه ذلك بأنهم لا يصيبهم ظمأ ولا نصب ولا مخمصة في سبيل الله ولا يطئون موطئا يغيظ الكفار ولا ينالون من عدو نيلا إلا كتب لهم به عمل صالح إن الله لا يضيع أجر المحسنين\nفيه خمس مسائل :\nالأولى : قوله تعالى ما كان لأهل المدينة ومن حولهم من الأعراب أن يتخلفوا عن رسول الله ظاهره خبر ومعناه أمر ; كقوله : وما كان لكم أن تؤذوا رسول الله وقد تقدم . أن يتخلفوا في موضع رفع اسم كان . وهذه معاتبة للمؤمنين من أهل يثرب وقبائل العرب المجاورة لها ; كمزينة وجهينة وأشجع وغفار وأسلم على التخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك . والمعنى : ما كان لهؤلاء المذكورين أن يتخلفوا ; فإن النفير كان فيهم ، بخلاف غيرهم فإنهم لم يستنفروا ; في قول بعضهم . ويحتمل أن يكون الاستنفار في كل مسلم ، وخص هؤلاء بالعتاب لقربهم وجوارهم ، وأنهم أحق بذلك من غيرهم .\nالثانية : قوله تعالى ولا يرغبوا بأنفسهم عن نفسه أي لا يرضوا لأنفسهم بالخفض والدعة ورسول الله صلى الله عليه وسلم في المشقة . يقال : رغبت عن كذا أي ترفعت عنه .\nالثالثة : قوله تعالى ذلك بأنهم لا يصيبهم ظمأ أي عطش . وقرأ عبيد بن عمير ظماء بالمد . وهما لغتان مثل خطأ وخطاء . ( ولا نصب ) عطف ، أي تعب ، و \" لا \" زائدة للتوكيد . وكذا ( ولا مخمصة ) أي مجاعة . وأصله ضمور البطن ; ومنه رجل خميص و امرأة خمصانة . وقد تقدم . في سبيل الله أي في طاعته . ولا يطئون موطئا أي أرضا . يغيظ الكفار أي بوطئهم إياها ، وهو في موضع نصب لأنه نعت للموطئ ، أي غائظا . ولا ينالون من عدو نيلا أي قتلا وهزيمة . وأصله من نلت الشيء أنال أي أصبت . قال الكسائي : هو من قولهم أمر منيل منه ; وليس هو من التناول ، إنما التناول من نلته العطية . قال غيره : نلت أنول من العطية ، من الواو والنيل من الياء ، تقول : نلته فأنا نائل ، أي أدركته . ولا يقطعون واديا العرب تقول : واد وأودية ، على غير قياس . قال النحاس : ولا يعرف فيما علمت فاعل وأفعلة سواه ، والقياس أن يجمع ووادي ; فاستثقلوا الجمع بين واوين وهم قد يستثقلون واحدة ، حتى قالوا : أقتت في وقتت . وحكى الخليل وسيبويه في تصغير واصل اسم رجل أويصل فلا يقولون غيره . وحكى الفراء في جمع واد أوداء .\nقلت : وقد جمع أوداه ; قال جرير :\nعرفت ببرقة الأوداه رسما محيلا طال عهدك من رسوم\nإلا كتب لهم به عمل صالح قال ابن عباس : بكل روعة تنالهم في سبيل الله سبعون ألف حسنة . وفي الصحيح : الخيل ثلاثة . . . وفيه : وأما التي هي له أجر فرجل ربطها في سبيل الله لأهل الإسلام في مرج أو روضة فما أكلت من ذلك المرج أو الروضة إلا كتب له عدد ما أكلت حسنات وكتب له عدد أرواثها وأبوالها حسنات . . . . الحديث . هذا وهي في مواضعها فكيف إذا أدرب بها .\nالرابعة : استدل بعض العلماء بهذه الآية على أن الغنيمة تستحق بالإدراب والكون في بلاد العدو ، فإن مات بعد ذلك فله سهمه ; وهو قول أشهب وعبد الملك ، وأحد قولي الشافعي . وقال مالك وابن القاسم : لا شيء له ; لأن الله عز وجل إنما ذكر في هذه الآية الأجر ولم يذكر السهم .\nقلت : الأول أصح لأن الله تعالى : جعل وطء ديار الكفار بمثابة النيل من أموالهم وإخراجهم من ديارهم ، وهو الذي يغيظهم ويدخل الذل عليهم ، فهو بمنزلة نيل الغنيمة والقتل والأسر ; وإذا كان كذلك فالغنيمة تستحق بالإدراب لا بالحيازة ، ولذلك قال علي رضي الله عنه : ما وطئ قوم في عقر دارهم إلا ذلوا . والله أعلم .\nالخامسة : هذه الآية منسوخة بقوله تعالى : وما كان المؤمنون لينفروا كافة وأن حكمها كان حين كان المسلمون في قلة ، فلما كثروا نسخت وأباح الله التخلف لمن شاء ; قاله ابن زيد . وقال مجاهد : بعث صلى الله عليه وسلم قوما إلى البوادي ليعلموا الناس فلما نزلت هذه الآية خافوا ورجعوا ; فأنزل الله : وما كان المؤمنون لينفروا كافة . وقال قتادة : كان هذا خاصا بالنبي صلى الله عليه وسلم ، إذا غزا بنفسه فليس لأحد أن يتخلف عنه إلا بعذر ; فأما غيره من الأئمة الولاة فلمن شاء أن يتخلف خلفه من المسلمين إذا لم يكن بالناس حاجة إليه ولا ضرورة . وقول ثالث : أنها محكمة ; قال الوليد بن مسلم : سمعت الأوزاعي وابن المبارك والفزاري والسبيعي وسعيد بن عبد العزيز يقولون في هذه الآية إنها لأول هذه الأمة وآخرها . قلت : قول قتادة حسن ; بدليل غزاة تبوك ، والله أعلم .\n                                    ",
        "saadi": "مَا كَانَ لِأَهۡلِ ٱلۡمَدِينَةِ وَمَنۡ حَوۡلَهُم مِّنَ ٱلۡأَعۡرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ ٱللَّهِ وَلَا يَرۡغَبُواْ بِأَنفُسِهِمۡ عَن نَّفۡسِهِۦۚ ذَٰلِكَ بِأَنَّهُمۡ لَا يُصِيبُهُمۡ ظَمَأٞ وَلَا نَصَبٞ وَلَا مَخۡمَصَةٞ فِي سَبِيلِ ٱللَّهِ وَلَا يَطَ‍ُٔونَ مَوۡطِئٗا يَغِيظُ ٱلۡكُفَّارَ وَلَا يَنَالُونَ مِنۡ عَدُوّٖ نَّيۡلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٞ صَٰلِحٌۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ ٠٢١\n                                        \n                                        \n                                        \n                                        يقول تعالى ـ حاثا لأهل المدينة المنورة من المهاجرين، والأنصار، ومن حولهم من الأعراب، الذين أسلموا فحسن إسلامهم ـ ‏:‏ ‏{‏مَا كَانَ لِأَهْلِ الْمَدِينَةِ وَمَنْ حَوْلَهُمْ مِنَ الْأَعْرَابِ أَنْ يَتَخَلَّفُوا عَنْ رَسُولِ اللَّهِ‏}‏ أي‏:‏ ما ينبغي لهم ذلك، ولا يليق بأحوالهم‏.‏\n‏{‏وَلَا يَرْغَبُوا بِأَنْفُسِهِمْ‏}‏ في بقائها وراحتها، وسكونه ‏{‏عَنْ نَفْسِهِ‏}‏ الكريمة الزكية، بل النبي ـ صلى الله عليه وسلم ـ أولى بالمؤمنين من أنفسهم، فعلى كل مسلم أن يفدي النبي ـ صلى الله عليه وسلم ـ ، بنفسه ويقدمه عليها، فعلامة تعظيم الرسول ـ صلى الله عليه وسلم ـ ومحبته والإيمان التام به، أن لا يتخلفوا عنه، ثم ذكر الثواب الحامل على الخروج فقال‏:‏ ‏{‏ذَلِكَ بِأَنَّهُمْ‏}‏ أي‏:‏ المجاهدين في سبيل اللّه ‏{‏لَا يُصِيبُهُمْ ظَمَأٌ وَلَا نَصَبٌ‏}‏ أي‏:‏ تعب ومشقة ‏{‏وَلَا مَخْمَصَةٌ فِي سَبِيلِ اللَّهِ‏}‏ أي‏:‏ مجاعة‏.‏\n‏{‏وَلَا يَطَئُونَ مَوْطِئًا يَغِيظُ الْكُفَّار‏}‏ من الخوض لديارهم، والاستيلاء على أوطانهم، ‏{‏وَلَا يَنَالُونَ مِنْ عَدُوٍّ نَيْلًا‏}‏ كالظفر بجيش أو سرية أو الغنيمة لمال ‏{‏إِلَّا كُتِبَ لَهُمْ بِهِ عَمَلٌ صَالِحٌ‏}‏ لأن هذه آثار ناشئة عن أعمالهم‏.‏\n‏{‏إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ‏}‏ الذين أحسنوا في مبادرتهم إلى أمر الله، وقيامهم بما عليهم من حقه وحق خلقه، فهذه الأعمال آثار من آثار عملهم‏.‏\n                                    "
      },
      "originalText": "مَا كَانَ لِأَهۡلِ ٱلۡمَدِينَةِ وَمَنۡ حَوۡلَهُم مِّنَ ٱلۡأَعۡرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ ٱللَّهِ وَلَا يَرۡغَبُواْ بِأَنفُسِهِمۡ عَن نَّفۡسِهِۦۚ ذَٰلِكَ بِأَنَّهُمۡ لَا يُصِيبُهُمۡ ظَمَأٞ وَلَا نَصَبٞ وَلَا مَخۡمَصَةٞ فِي سَبِيلِ ٱللَّهِ وَلَا يَطَ‍ُٔونَ مَوۡطِئٗا يَغِيظُ ٱلۡكُفَّارَ وَلَا يَنَالُونَ مِنۡ عَدُوّٖ نَّيۡلًا إِلَّا كُتِبَ لَهُم بِهِۦ عَمَلٞ صَٰلِحٌۚ إِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ ٠٢١"
    },
    {
      "number": 1356,
      "text": "وَلَا يُنْفِقُونَ نَفَقَةً صَغِيرَةً وَلَا كَبِيرَةً وَلَا يَقْطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمْ لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 121,
      "juz": 11,
      "manzil": 2,
      "page": 206,
      "ruku": 170,
      "hizbQuarter": 82,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ ١٢١\n                                    \n                                    \n                                    يقول تعالى : ولا ينفق هؤلاء الغزاة في سبيل الله ( نفقة صغيرة ولا كبيرة ) أي : قليلا ولا كثيرا ( ولا يقطعون واديا ) أي : في السير إلى الأعداء ( إلا كتب لهم ) ولم يقل هاهنا \" به \" لأن هذه أفعال صادرة عنهم ؛ ولهذا قال : ( ليجزيهم الله أحسن ما كانوا يعملون ) .\nوقد حصل لأمير المؤمنين عثمان بن عفان ، رضي الله عنه ، من هذه الآية الكريمة حظ وافر ، ونصيب عظيم ، وذلك أنه أنفق في هذه الغزوة النفقات الجليلة ، والأموال الجزيلة ، كما قال عبد الله بن الإمام أحمد :\nحدثنا أبو موسى العنزي ، حدثنا عبد الصمد بن عبد الوارث ، حدثني سكن بن المغيرة ، حدثني الوليد بن أبي هاشم ، عن فرقد أبي طلحة ، عن عبد الرحمن بن خباب السلمي قال : خطب رسول الله صلى الله عليه وسلم فحث على جيش العسرة ، فقال عثمان بن عفان ، رضي الله عنه : علي مائة بعير بأحلاسها وأقتابها . قال : ثم حث ، فقال عثمان : علي مائة أخرى بأحلاسها وأقتابها . قال : ثم نزل مرقاة من المنبر ثم حث ، فقال عثمان بن عفان : علي مائة أخرى بأحلاسها وأقتابها . قال : فرأيت رسول الله صلى الله عليه وسلم يقول بيده هكذا - يحركها . وأخرج عبد الصمد يده كالمتعجب : \" ما على عثمان ما عمل بعد هذا \" .\nوقال عبد الله أيضا : حدثنا هارون بن معروف ، حدثنا ضمرة ، حدثنا عبد الله بن شوذب ، عن عبد الله بن القاسم ، عن كثير مولى عبد الرحمن بن سمرة ، عن عبد الرحمن بن سمرة قال : جاء عثمان إلى النبي صلى الله عليه وسلم بألف دينار في ثوبه حين جهز النبي صلى الله عليه وسلم جيش العسرة قال : فصبها في حجر النبي صلى الله عليه وسلم ، فجعل النبي صلى الله عليه وسلم يقلبها بيده ويقول : \" ما ضر ابن عفان ما عمل بعد اليوم \" . يرددها مرارا .\nوقال قتادة في قوله تعالى : ( ولا يقطعون واديا إلا كتب لهم ) الآية : ما ازداد قوم من أهليهم في سبيل الله بعدا إلا ازدادوا من الله قربا .\n                                    ",
        "qortoby": "وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ ١٢١\n                                    \n                                    \n                                    روى أبو داود عن أنس بن مالك أن رسول الله صلى الله عليه وسلم قال : لقد تركتم بالمدينة أقواما ما سرتم مسيرا ولا أنفقتم من نفقة ولا قطعتم من واد إلا وهم معكم فيه . قالوا : يا رسول الله ، وكيف يكونون معنا وهم بالمدينة . ؟ قال : حبسهم العذر . خرجه مسلم من حديث جابر قال : كنا مع رسول الله صلى الله عليه وسلم في غزاة فقال : إن بالمدينة لرجالا ما سرتم مسيرا ولا قطعتم واديا إلا كانوا معكم حبسهم المرض . فأعطى صلى الله عليه وسلم للمعذور من الأجر مثل ما أعطى للقوي العامل . وقد قال بعض الناس : إنما يكون الأجر للمعذور غير مضاعف ، ويضاعف للعامل المباشر . قال ابن العربي : وهذا تحكم على الله تعالى وتضييق لسعة رحمته ، وقد عاب بعض الناس فقال : إنهم يعطون الثواب مضاعفا قطعا ، ونحن لا نقطع بالتضعيف في موضع فإنه مبني على مقدار النيات ، وهذا أمر مغيب ، والذي يقطع به أن هناك تضعيفا وربك أعلم بمن يستحقه .\nقلت : الظاهر من الأحاديث والآي المساواة في الأجر ; منها قوله عليه السلام : من دل على خير فله مثل أجر فاعله وقوله : من توضأ وخرج إلى الصلاة فوجد الناس قد صلوا أعطاه الله مثل أجر من صلاها وحضرها . وهو ظاهر قوله تعالى : ومن يخرج من بيته مهاجرا إلى الله ورسوله ثم يدركه الموت فقد وقع أجره على الله وبدليل أن النية الصادقة هي أصل الأعمال ، فإذا صحت في فعل طاعة فعجز عنها صاحبها لمانع منع منها فلا بعد في مساواة أجر ذلك العاجز لأجر القادر الفاعل ويزيد عليه ; لقوله عليه السلام : نية المؤمن خير من عمله . والله أعلم .\n                                    ",
        "saadi": "وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ ١٢١\n                                        \n                                        \n                                        \n                                        ‏{‏وَلَا يُنْفِقُونَ نَفَقَةً صَغِيرَةً وَلَا كَبِيرَةً وَلَا يَقْطَعُونَ وَادِيًا‏}‏ في ذهابهم إلى عدوهم ‏{‏إِلَّا كُتِبَ لَهُمْ لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا كَانُوا يَعْمَلُونَ‏}‏\nومن ذلك هذه الأعمال، إذا أخلصوا فيها للّه، ونصحوا فيها، ففي هذه الآيات أشد ترغيب وتشويق للنفوس إلى الخروج إلى الجهاد في سبيل اللّه، والاحتساب لما يصيبهم فيه من المشقات، وأن ذلك لهم رفعة درجات، وأن الآثار المترتبة على عمل العبد له فيها أجر كبير‏\n                                    "
      },
      "originalText": "وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ ١٢١"
    },
    {
      "number": 1357,
      "text": "۞ وَمَا كَانَ الْمُؤْمِنُونَ لِيَنْفِرُوا كَافَّةً ۚ فَلَوْلَا نَفَرَ مِنْ كُلِّ فِرْقَةٍ مِنْهُمْ طَائِفَةٌ لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ",
      "surah": {
        "number": 9,
        "name": "سورة التوبة",
        "englishName": "At-Tawba",
        "englishNameTranslation": "The Repentance",
        "revelationType": "Medinan",
        "numberOfAyahs": 129
      },
      "numberInSurah": 122,
      "juz": 11,
      "manzil": 2,
      "page": 206,
      "ruku": 170,
      "hizbQuarter": 83,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ ٢٢١\n                                    \n                                    \n                                    هذا بيان من الله تعالى لما أراد من نفير الأحياء مع الرسول في غزوة تبوك ، فإنه قد ذهب طائفة من السلف إلى أنه كان يجب النفير على كل مسلم إذا خرج رسول الله صلى الله عليه وسلم ؛ ولهذا قال تعالى : ( انفروا خفافا وثقالا ) [ التوبة : 41 ] ، وقال : ( ما كان لأهل المدينة ومن حولهم من الأعراب أن يتخلفوا عن رسول الله ) [ التوبة : 120 ] ، قالوا : فنسخ ذلك بهذه الآية .\nوقد يقال : إن هذا بيان لمراده تعالى من نفير الأحياء كلها ، وشرذمة من كل قبيلة إن لم يخرجوا كلهم ، ليتفقه الخارجون مع الرسول بما ينزل من الوحي عليه ، وينذروا قومهم إذا رجعوا إليهم بما كان من أمر العدو ، فيجتمع لهم الأمران في هذا : النفير المعين وبعده ، صلوات الله وسلامه عليه ، تكون الطائفة النافرة من الحي إما للتفقه وإما للجهاد ؛ فإنه فرض كفاية على الأحياء .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( وما كان المؤمنون لينفروا كافة ) يقول : ما كان المؤمنون لينفروا جميعا ويتركوا النبي صلى الله عليه وسلم وحده ، ( فلولا نفر من كل فرقة منهم طائفة ) يعني : عصبة ، يعني : السرايا ، ولا يتسروا إلا بإذنه ، فإذا رجعت السرايا وقد نزل بعدهم قرآن تعلمه القاعدون من النبي صلى الله عليه وسلم ، وقالوا : إن الله قد أنزل على نبيكم قرآنا ، وقد تعلمناه . فتمكث السرايا يتعلمون ما أنزل الله على نبيهم بعدهم ، ويبعث سرايا أخرى ، فذلك قوله : ( ليتفقهوا في الدين ) يقول : ليتعلموا ما أنزل الله على نبيهم ، وليعلموا السرايا إذا رجعت إليهم ( لعلهم يحذرون ) .\nوقال مجاهد : نزلت هذه الآية في أناس من أصحاب محمد صلى الله عليه وسلم ، خرجوا في البوادي ، فأصابوا من الناس معروفا ، ومن الخصب ما ينتفعون به ، ودعوا من وجدوا من الناس إلى الهدى ، فقال الناس لهم : ما نراكم إلا وقد تركتم أصحابكم وجئتمونا . فوجدوا في أنفسهم من ذلك تحرجا ، وأقبلوا من البادية كلهم حتى دخلوا على النبي صلى الله عليه وسلم ، فقال الله ، عز وجل : ( فلولا نفر من كل فرقة منهم طائفة ) يبتغون الخير ، ( ليتفقهوا [ في الدين ] ) وليستمعوا ما في الناس ، وما أنزل الله بعدهم ، ( ولينذروا قومهم ) الناس كلهم ( إذا رجعوا إليهم لعلهم يحذرون ) .\nوقال قتادة في هذه الآية : هذا إذا بعث رسول الله صلى الله عليه وسلم الجيوش ، أمرهم الله ألا يعروا نبيه صلى الله عليه وسلم ، وتقيم طائفة مع رسول الله تتفقه في الدين ، وتنطلق طائفة تدعو قومها ، وتحذرهم وقائع الله فيمن خلا قبلهم .\nوقال الضحاك : كان رسول الله صلى الله عليه وسلم إذا غزا بنفسه لم يحل لأحد من المسلمين أن يتخلف عنه ، إلا أهل الأعذار . وكان إذا أقام فاسترت السرايا لم يحل لهم أن ينطلقوا إلا بإذنه ، فكان الرجل إذا استرى فنزل بعده قرآن ، تلاه رسول الله صلى الله عليه وسلم على أصحابه القاعدين معه ، فإذا رجعت السرية قال لهم الذين أقاموا مع رسول الله صلى الله عليه وسلم : إن الله أنزل بعدكم على نبيه قرآنا . فيقرئونهم ويفقهونهم في الدين ، وهو قوله : ( وما كان المؤمنون لينفروا كافة ) يقول إذا أقام رسول الله ( فلولا نفر من كل فرقة منهم طائفة ) يعني بذلك : أنه لا ينبغي للمسلمين أن ينفروا جميعا ونبي الله صلى الله عليه وسلم قاعد ، ولكن إذا قعد نبي الله تسرت السرايا ، وقعد معه عظم الناس .\nوقال [ علي ] بن أبي طلحة أيضا عن ابن عباس : قوله : ( وما كان المؤمنون لينفروا كافة ) فإنها ليست في الجهاد ، ولكن لما دعا رسول الله صلى الله عليه وسلم على مضر بالسنين أجدبت بلادهم ، وكانت القبيلة منهم تقبل بأسرها حتى يحلوا بالمدينة من الجهد ، ويعتلوا بالإسلام وهم كاذبون . فضيقوا على أصحاب النبي صلى الله عليه وسلم وأجهدوهم . فأنزل الله يخبر رسوله أنهم ليسوا مؤمنين ، فردهم رسول الله إلى عشائرهم ، وحذر قومهم أن يفعلوا فعلهم ، فذلك قوله : ( ولينذروا قومهم إذا رجعوا إليهم لعلهم يحذرون ) .\nوقال العوفي ، عن ابن عباس في هذه الآية : كان ينطلق من كل حي من العرب عصابة ، فيأتون النبي صلى الله عليه وسلم . فيسألونه عما يريدون من أمر دينهم ، ويتفقهون في دينهم ، ويقولون لنبي الله : ما تأمرنا أن نفعله ؟ وأخبرنا [ ما نقول ] لعشائرنا إذا قدمنا انطلقنا إليهم . قال : فيأمرهم نبي الله بطاعة الله وطاعة رسوله ، ويبعثهم إلى قومهم بالصلاة والزكاة . وكانوا إذا أتوا قومهم نادوا : إن من أسلم فهو منا ، وينذرونهم ، حتى إن الرجل ليفارق أباه وأمه ، وكان رسول الله صلى الله عليه وسلم يخبرهم وينذرهم قومهم ، فإذا رجعوا إليهم يدعونهم إلى الإسلام وينذرونهم النار ويبشرونهم بالجنة .\nوقال عكرمة : لما نزلت هذه الآية : [ الشريفة ] ( إلا تنفروا يعذبكم عذابا أليما ) [ التوبة : 39 ] ، و ( ما كان لأهل المدينة ومن حولهم من الأعراب أن يتخلفوا [ عن رسول الله ] ) [ التوبة : 120 ] ، قال المنافقون : هلك أصحاب البدو الذين تخلفوا عن محمد ولم ينفروا معه . وقد كان ناس من أصحاب النبي صلى الله عليه وسلم خرجوا إلى البدو إلى قومهم يفقهونهم ، فأنزل الله ، عز وجل : ( وما كان المؤمنون لينفروا كافة فلولا نفر من كل فرقة منهم طائفة ) الآية ، ونزلت : ( والذين يحاجون في الله من بعد ما استجيب له ) الآية [ الشورى : 16 ] .\nوقال الحسن البصري : ( فلولا نفر من كل فرقة منهم طائفة ليتفقهوا في الدين ) قال : ليتفقه الذين خرجوا ، بما يردهم الله من الظهور على المشركين ، والنصرة ، وينذروا قومهم إذا رجعوا إليهم .\n                                    ",
        "qortoby": "۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ ٢٢١\n                                    \n                                    \n                                    قوله تعالى وما كان المؤمنون لينفروا كافة فلولا نفر من كل فرقة منهم طائفة ليتفقهوا في الدين ولينذروا قومهم إذا رجعوا إليهم لعلهم يحذرون\nفيه ست مسائل :\nقوله تعالى وما كان المؤمنون وهي أن الجهاد ليس على الأعيان وأنه فرض كفاية كما تقدم ; إذ لو نفر الكل لضاع من وراءهم من العيال ، فليخرج فريق منهم للجهاد وليقم فريق يتفقهون في الدين ويحفظون الحريم ، حتى إذا عاد النافرون أعلمهم المقيمون ما تعلموه من أحكام الشرع ، وما تجدد نزوله على النبي صلى الله عليه وسلم . وهذه الآية ناسخة لقوله تعالى : ( إلا تنفروا ) وللآية التي قبلها ; على قول مجاهد وابن زيد .\nالثانية : هذه الآية أصل في وجوب طلب العلم ; لأن المعنى : وما كان المؤمنون لينفروا كافة والنبي صلى الله عليه وسلم مقيم لا ينفر فيتركوه وحده . ( فلولا نفر ) بعدما علموا أن النفير لا يسع جميعهم . ( من كل فرقة منهم طائفة ) وتبقى بقيتها مع النبي صلى الله عليه وسلم ليتحملوا عنه الدين ويتفقهوا ; فإذا رجع النافرون إليهم أخبروهم بما سمعوا وعلموه . وفي هذا إيجاب التفقه في الكتاب والسنة ، وأنه على الكفاية دون الأعيان . ويدل عليه أيضا قوله تعالى : فاسألوا أهل الذكر إن كنتم لا تعلمون . فدخل في هذا من لا يعلم الكتاب والسنن .\nالثالثة : قوله تعالى ( فلولا نفر ) قال الأخفش : أي فهلا نفر . من كل فرقة منهم طائفة الطائفة في اللغة الجماعة ، وقد تقع على أقل من ذلك حتى تبلغ الرجلين ، وللواحد على معنى نفس طائفة . وقد تقدم أن المراد بقوله تعالى : إن نعف عن طائفة منكم نعذب طائفة رجل واحد . ولا شك أن المراد هنا جماعة لوجهين ; أحدهما عقلا ، والآخر لغة . أما العقل فلأن العلم لا يتحصل بواحد في الغالب ، وأما اللغة فقوله : ليتفقهوا في الدين ولينذروا قومهم فجاء بضمير الجماعة . قال ابن العربي : والقاضي أبو بكر والشيخ أبو الحسن قبله يرون أن الطائفة هاهنا واحد ، ويعتضدون فيه بالدليل على وجوب العمل بخبر الواحد ، وهو صحيح لا من جهة أن الطائفة تنطلق على الواحد ولكن من جهة أن خبر الشخص الواحد أو الأشخاص خبر واحد ، وأن مقابله وهو التواتر لا ينحصر .\nقلت : أنص ما يستدل به على أن الواحد يقال له طائفة قوله تعالى : وإن طائفتان من المؤمنين اقتتلوا يعني نفسين . دليله قوله تعالى : فأصلحوا بين أخويكم فجاء بلفظ التثنية ، والضمير في ( اقتتلوا ) وإن كان ضمير جماعة فأقل الجماعة اثنان في أحد القولين للعلماء .\nالرابعة : قوله تعالى ( ليتفقهوا ) الضمير في \" ليتفقهوا ، ولينذروا \" للمقيمين مع النبي صلى الله عليه وسلم ; قاله قتادة ومجاهد . وقال الحسن : هما للفرقة النافرة ; واختاره الطبري . ومعنى ليتفقهوا في الدين أي يتبصروا ويتيقنوا بما يريهم الله من الظهور على المشركين ونصرة الدين .\nقلت : قول مجاهد وقتادة أبين ، أي لتتفقه الطائفة المتأخرة مع رسول الله صلى الله عليه وسلم عن النفور في السرايا . وهذا يقتضي الحث على طلب العلم والندب إليه دون الوجوب والإلزام ; إذ ليس ذلك في قوة الكلام ، وإنما لزم طلب العلم بأدلته ; قاله أبو بكر بن العربي .\nالخامسة : طلب العلم ينقسم قسمين : فرض على الأعيان ; كالصلاة والزكاة والصيام .\nقلت : وفي هذا المعنى جاء الحديث المروي إن طلب العلم فريضة . روى عبد القدوس بن حبيب : أبو سعيد الوحاظي عن حماد بن أبي سليمان عن إبراهيم النخعي قال سمعت أنس بن مالك يقول : سمعت رسول الله صلى الله عليه وسلم يقول : طلب العلم فريضة على كل مسلم . قال إبراهيم : لم أسمع من أنس بن مالك إلا هذا الحديث .\nوفرض على الكفاية ; كتحصيل الحقوق وإقامة الحدود والفصل بين الخصوم ونحوه ; إذ لا يصلح أن يتعلمه جميع الناس فتضيع أحوالهم وأحوال سراياهم وتنقص أو تبطل معايشهم ; فتعين بين الحالين أن يقوم به البعض من غير تعيين ، وذلك بحسب ما يسره الله لعباده وقسمه بينهم من رحمته وحكمته بسابق قدرته وكلمته .\nالسادسة : طلب العلم فضيلة عظيمة ومرتبة شريفة لا يوازيها عمل ; روى الترمذي من حديث أبي الدرداء قال : سمعت رسول الله صلى الله عليه وسلم يقول : من سلك طريقا يلتمس فيه علما سلك الله به طريقا إلى الجنة وإن الملائكة لتضع أجنحتها رضا لطالب العلم وإن العالم ليستغفر له من في السماوات ومن في الأرض والحيتان في جوف الماء ، وإن فضل العالم على العابد كفضل القمر ليلة البدر على سائر الكواكب ، وإن العلماء ورثة الأنبياء وإن الأنبياء لم يورثوا دينارا ولا درهما إنما ورثوا العلم فمن أخذ به أخذ بحظ وافر . وروى الدارمي أبو محمد في مسنده قال : حدثنا أبو المغيرة حدثنا الأوزاعي عن الحسن قال سئل رسول الله صلى الله عليه وسلم عن رجلين كانا في بني إسرائيل ، أحدهما كان عالما يصلي المكتوبة ثم يجلس فيعلم الناس الخير . والآخر يصوم النهار ويقوم الليل ، أيهما أفضل ؟ قال رسول الله صلى الله عليه وسلم : فضل هذا العالم الذي يصلي المكتوبة ثم يجلس فيعلم الناس الخير على العابد الذي يصوم النهار ويقوم الليل كفضلي على أدناكم . أسنده أبو عمر في كتاب \" بيان العلم \" عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم : فضل العالم على العابد كفضلي على أمتي . وقال ابن عباس : أفضل الجهاد من بنى مسجدا يعلم فيه القرآن والفقه والسنة . رواه شريك عن ليث بن أبي سليم عن يحيى بن أبي كثير عن علي الأزدي قال : أردت الجهاد فقال لي ابن عباس ألا أدلك على ما هو خير لك من الجهاد ، تأتي مسجدا فتقرأ فيه القرآن وتعلم فيه الفقه . وقال الربيع سمعت الشافعي يقول : طلب العلم أوجب من الصلاة النافلة . وقوله عليه السلام : إن الملائكة لتضع أجنحتها . . . الحديث ، يحتمل وجهين : أحدهما : أنها تعطف عليه وترحمه ; كما قال الله تعالى فيما وصى به الأولاد من الإحسان إلى الوالدين بقوله : واخفض لهما جناح الذل من الرحمة أي تواضع لهما . والوجه الآخر : أن يكون المراد بوضع الأجنحة فرشها ; لأن في بعض الروايات وإن الملائكة تفرش أجنحتها ، أي إن الملائكة إذا رأت طالب العلم يطلبه من وجهه ابتغاء مرضاة الله وكانت سائر أحواله مشاكلة لطلب العلم فرشت له أجنحتها في رحلته وحملته عليها ; فمن هناك يسلم فلا يحفى إن كان ماشيا ولا يعيا ، وتقرب عليه الطريق البعيدة ، ولا يصيبه ما يصيب المسافر من أنواع الضرر كالمرض وذهاب المال وضلال الطريق . وقد مضى شيء من هذا المعنى في ( آل عمران ) عند قوله تعالى : شهد الله الآية . روى عمران بن حصين قال : قال رسول الله صلى الله عليه وسلم لا تزال طائفة من أمتي ظاهرين على الحق حتى تقوم الساعة . قال يزيد بن هارون : إن لم يكونوا أصحاب الحديث فلا أدري من هم ؟ .\nقلت : وهذا قول عبد الرزاق في تأويل الآية ، إنهم أصحاب الحديث ; ذكره الثعلبي . سمعت شيخنا الأستاذ المقرئ النحوي المحدث أبا جعفر أحمد بن محمد بن محمد القيسي القرطبي المعروف بابن أبي حجة رحمه الله يقول في تأويل قوله عليه السلام : لا يزال أهل الغرب ظاهرين على الحق حتى تقوم الساعة إنهم العلماء ; قال : وذلك أن الغرب لفظ مشترك يطلق على الدلو الكبيرة وعلى مغرب الشمس ، ويطلق على فيضة من الدمع . فمعنى لا يزال أهل الغرب أي لا يزال أهل فيض الدمع من خشية الله عن علم به وبأحكامه ظاهرين ; الحديث . قال الله تعالى : إنما يخشى الله من عباده العلماء .\nقلت : وهذا التأويل يعضده قوله عليه السلام في صحيح مسلم : من يرد الله به خيرا يفقهه في الدين ولا تزال عصابة من المسلمين يقاتلون على الحق ظاهرين على من ناوأهم إلى يوم القيامة . وظاهر هذا المساق أن أوله مرتبط بآخره . والله أعلم .\n                                    ",
        "saadi": "۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ ٢٢١\n                                        \n                                        \n                                        \n                                        يقول تعالى‏:‏ ـ منبها لعباده المؤمنين على ما ينبغي لهم ـ ‏{‏وَمَا كَانَ الْمُؤْمِنُونَ لِيَنْفِرُوا كَافَّةً‏}‏ أي‏:‏ جميعا لقتال عدوهم، فإنه يحصل عليهم المشقة بذلك، وتفوت به كثير من المصالح الأخرى، ‏{‏فَلَوْلَا نَفَرَ مِنْ كُلِّ فِرْقَةٍ مِنْهُمْ‏}‏ أي‏:‏ من البلدان، والقبائل، والأفخاذ ‏{‏طَائِفَةٌ‏}‏ تحصل بها الكفاية والمقصود لكان أولى‏.‏\nثم نبه على أن في إقامة المقيمين منهم وعدم خروجهم مصالح لو خرجوا لفاتتهم، فقال‏:‏ ‏{‏لِيَتَفَقَّهُوا‏}‏ أي‏:‏ القاعدون ‏{‏فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ‏}‏ أي‏.‏ ليتعلموا العلم الشرعي، ويعلموا معانيه، ويفقهوا أسراره، وليعلموا غيرهم، ولينذروا قومهم إذا رجعوا إليهم‏.‏\nففي هذا فضيلة العلم، وخصوصا الفقه في الدين، وأنه أهم الأمور، وأن من تعلم علما، فعليه نشره وبثه في العباد، ونصيحتهم فيه فإن انتشار العلم عن العالم، من بركته وأجره، الذي ينمى له‏.‏\nوأما اقتصار العالم على نفسه، وعدم دعوته إلى سبيل اللّه بالحكمة والموعظة الحسنة، وترك تعليم الجهال ما لا يعلمون، فأي منفعة حصلت للمسلمين منه‏؟‏ وأي نتيجة نتجت من علمه‏؟‏ وغايته أن يموت، فيموت علمه وثمرته، وهذا غاية الحرمان، لمن آتاه اللّه علما ومنحه فهما‏.‏\nوفي هذه الآية أيضًا دليل وإرشاد وتنبيه لطيف، لفائدة مهمة، وهي‏:‏ أن المسلمين ينبغي لهم أن يعدوا لكل مصلحة من مصالحهم العامة من يقوم بها، ويوفر وقته عليها، ويجتهد فيها، ولا يلتفت إلى غيرها، لتقوم مصالحهم، وتتم منافعهم، ولتكون وجهة جميعهم، ونهاية ما يقصدون قصدا واحدا، وهو قيام مصلحة دينهم ودنياهم، ولو تفرقت الطرق وتعددت المشارب، فالأعمال متباينة، والقصد واحد، وهذه من الحكمة العامة النافعة في جميع الأمور‏.‏\n                                    "
      },
      "originalText": "۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ ٢٢١"
    }
  ]
}