{
  "number": 21,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 142,
      "text": "وَقَالُوا كُونُوا هُودًا أَوْ نَصَارَىٰ تَهْتَدُوا ۗ قُلْ بَلْ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۖ وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 135,
      "juz": 1,
      "manzil": 1,
      "page": 21,
      "ruku": 17,
      "hizbQuarter": 8,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالُواْ كُونُواْ هُودًا أَوۡ نَصَٰرَىٰ تَهۡتَدُواْۗ قُلۡ بَلۡ مِلَّةَ إِبۡرَٰهِ‍ۧمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٥٣١\n                                    \n                                    \n                                    قال محمد بن إسحاق : حدثني محمد بن أبي محمد ، حدثني سعيد بن جبير أو عكرمة ، عن ابن عباس ، قال : قال عبد الله بن صوريا الأعور لرسول الله صلى الله عليه وسلم : ما الهدى إلا ما نحن عليه ، فاتبعنا يا محمد تهتد . وقالت النصارى مثل ذلك . فأنزل الله عز وجل : ( وقالوا كونوا هودا أو نصارى تهتدوا )\nوقوله ( بل ملة إبراهيم حنيفا ) \" أي : لا نريد ما دعوتم إليه من اليهودية والنصرانية ، بل نتبع ( ملة إبراهيم حنيفا ) أي : مستقيما . قاله محمد بن كعب القرظي ، وعيسى بن جارية .\nوقال خصيف عن مجاهد : مخلصا . وروى علي بن أبي طلحة عن ابن عباس : حاجا . وكذا روي عن الحسن والضحاك وعطية ، والسدي .\nوقال أبو العالية : الحنيف الذي يستقبل البيت بصلاته ، ويرى أن حجه عليه إن استطاع إليه سبيلا .\nوقال مجاهد ، والربيع بن أنس : حنيفا ، أي : متبعا . وقال أبو قلابة : الحنيف الذي يؤمن بالرسل كلهم من أولهم إلى آخرهم .\nوقال قتادة : الحنيفية : شهادة أن لا إله إلا الله . يدخل فيها تحريم الأمهات والبنات والخالات والعمات وما حرم الله ، عز وجل والختان .\n                                    ",
        "qortoby": "قَالُواْ كُونُواْ هُودًا أَوۡ نَصَٰرَىٰ تَهۡتَدُواْۗ قُلۡ بَلۡ مِلَّةَ إِبۡرَٰهِ‍ۧمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٥٣١\n                                    \n                                    \n                                    قوله تعالى : وقالوا كونوا هودا أو نصارى تهتدوا قل بل ملة إبراهيم حنيفا وما كان من المشركين\nقوله تعالى : وقالوا كونوا هودا أو نصارى تهتدوا دعت كل فرقة إلى ما هي عليه ، فرد الله تعالى ذلك عليهم فقال : بل ملة أي قل يا محمد : بل نتبع ملة ، فلهذا نصب الملة . وقيل : المعنى بل نهتدي بملة إبراهيم ، فلما حذف حرف الجر صار منصوبا . وقرأ الأعرج وابن أبي عبلة : بل ملة بالرفع ، والتقدير بل الهدى ملة ، أو ملتنا دين إبراهيم . وحنيفا مائلا عن الأديان المكروهة إلى الحق دين إبراهيم ، وهو في موضع نصب على الحال ، قاله الزجاج . أي بل نتبع ملة إبراهيم في هذه الحالة . وقال علي بن سليمان : هو منصوب على أعني ، والحال خطأ ، لا يجوز جاءني غلام هند مسرعة . وسمي إبراهيم حنيفا لأنه حنف إلى دين الله وهو الإسلام . والحنف : الميل ، ومنه رجل حنفاء ، ورجل أحنف ، وهو الذي تميل قدماه كل واحدة منهما إلى أختها بأصابعها . قالت أم الأحنف :\nوالله لولا حنف برجله ما كان في فتيانكم من مثله\nوقال الشاعر :\nإذا حول الظل العشي رأيته حنيفا وفي قرن الضحى يتنصر\nأي الحرباء تستقبل القبلة بالعشي ، والمشرق بالغداة ، وهو قبلة النصارى . وقال قوم : الحنف الاستقامة ، فسمي دين إبراهيم حنيفا لاستقامته . وسمي المعوج الرجلين أحنف تفاؤلا بالاستقامة ، كما قيل للديغ سليم ، وللمهلكة مفازة ، في قول أكثرهم .\n                                    ",
        "saadi": "قَالُواْ كُونُواْ هُودًا أَوۡ نَصَٰرَىٰ تَهۡتَدُواْۗ قُلۡ بَلۡ مِلَّةَ إِبۡرَٰهِ‍ۧمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٥٣١\n                                        \n                                        \n                                        \n                                        أي: دعا كل من اليهود والنصارى المسلمين إلى الدخول في دينهم, زاعمين أنهم هم المهتدون وغيرهم ضال. قل له مجيبا جوابا شافيا: { بَلْ } نتبع { مِلَّةَ إِبْرَاهِيمَ حَنِيفًا } أي: مقبلا على الله, معرضا عما سواه, قائما بالتوحيد, تاركا للشرك والتنديد. فهذا الذي في اتباعه الهداية, وفي الإعراض عن ملته الكفر والغواية.\n                                    "
      },
      "originalText": "قَالُواْ كُونُواْ هُودًا أَوۡ نَصَٰرَىٰ تَهۡتَدُواْۗ قُلۡ بَلۡ مِلَّةَ إِبۡرَٰهِ‍ۧمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٥٣١"
    },
    {
      "number": 143,
      "text": "قُولُوا آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا وَمَا أُنْزِلَ إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَمَا أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَا أُوتِيَ النَّبِيُّونَ مِنْ رَبِّهِمْ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْهُمْ وَنَحْنُ لَهُ مُسْلِمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 136,
      "juz": 1,
      "manzil": 1,
      "page": 21,
      "ruku": 17,
      "hizbQuarter": 8,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُولُوٓاْ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ إِلَىٰٓ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَمَآ أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَآ أُوتِيَ ٱلنَّبِيُّونَ مِن رَّبِّهِمۡ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّنۡهُمۡ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ٦٣١\n                                    \n                                    \n                                    أرشد الله تعالى عباده المؤمنين إلى الإيمان بما أنزل إليهم بواسطة رسوله محمد صلى الله عليه وسلم مفصلا وبما أنزل على الأنبياء المتقدمين مجملا ونص على أعيان من الرسل ، وأجمل ذكر بقية الأنبياء ، وأن لا يفرقوا بين أحد منهم ، بل يؤمنوا بهم كلهم ، ولا يكونوا كمن قال الله فيهم : ( ويريدون أن يفرقوا بين الله ورسله ويقولون نؤمن ببعض ونكفر ببعض ويريدون أن يتخذوا بين ذلك سبيلا أولئك هم الكافرون حقا ) [ النساء : 150 ، 151 ] .\nوقال البخاري : حدثنا محمد بن بشار ، حدثنا عثمان بن عمر ، أخبرنا علي بن المبارك ، عن يحيى بن أبي كثير ، عن أبي سلمة بن عبد الرحمن ، عن أبي هريرة ، قال : كان أهل الكتاب يقرءون التوراة بالعبرانية ويفسرونها بالعربية لأهل الإسلام ، فقال رسول الله صلى الله عليه وسلم : \" لا تصدقوا أهل الكتاب ولا تكذبوهم ، وقولوا : آمنا بالله وما أنزل إلينا \" .\nوقد روى مسلم وأبو داود والنسائي من حديث عثمان بن حكيم ، عن سعيد بن يسار عن ابن عباس ، قال ، كان رسول الله صلى الله عليه وسلم أكثر ما يصلي الركعتين اللتين قبل الفجر ب ( آمنا بالله وما أنزل إلينا ) الآية ، والأخرى ب ( آمنا بالله واشهد بأنا مسلمون ) [ آل عمران : 52 ] . وقال أبو العالية والربيع وقتادة : الأسباط : بنو يعقوب اثنا عشر رجلا ; ولد كل رجل منهم أمة من الناس ، فسموا الأسباط .\nوقال الخليل بن أحمد وغيره : الأسباط في بني إسرائيل ، كالقبائل في بني إسماعيل ; وقال الزمخشري في الكشاف : الأسباط : حفدة يعقوب وذراري أبنائه الاثنى عشر ، وقد نقله الرازي عنه ، وقرره ولم يعارضه . وقال البخاري : الأسباط : قبائل بني إسرائيل ، وهذا يقتضي أن المراد بالأسباط هاهنا شعوب بني إسرائيل ، وما أنزل الله تعالى من الوحي على الأنبياء الموجودين منهم ، كما قال موسى لهم : ( اذكروا نعمة الله عليكم إذ جعل فيكم أنبياء وجعلكم ملوكا وآتاكم ما لم يؤت أحدا من العالمين ) [ المائدة : 20 ] وقال تعالى : ( وقطعناهم اثنتي عشرة أسباطا أمما ) [ الأعراف : 160 ] وقال القرطبي : وسموا الأسباط من السبط ، وهو التتابع ، فهم جماعة متتابعون . وقيل : أصله من السبط ، بالتحريك ، وهو الشجر ، أي : هم في الكثرة بمنزلة الشجر ، الواحدة سبطة . قال الزجاج : ويبين لك هذا : ما حدثنا محمد بن جعفر الأنباري ، حدثنا أبو نجيد الدقاق ، حدثنا الأسود بن عامر ، حدثنا إسرائيل عن سماك ، عن عكرمة ، عن ابن عباس ، قال : كل الأنبياء من بني إسرائيل إلا عشرة : نوح وهود وصالح وشعيب وإبراهيم ولوط وإسحاق ويعقوب وإسماعيل ومحمد عليهم الصلاة والسلام . قال القرطبي : والسبط : الجماعة والقبيلة ، الراجعون إلى أصل واحد .\nوقال قتادة : أمر الله المؤمنين أن يؤمنوا به ، ويصدقوا بكتبه كلها وبرسله .\nوقال سليمان بن حبيب : إنما أمرنا أن نؤمن بالتوراة والإنجيل ، ولا نعمل بما فيهما .\nوقال ابن أبي حاتم : حدثنا محمد بن محمد بن مصعب الصوري ، حدثنا مؤمل ، حدثنا عبيد الله بن أبي حميد ، عن أبي المليح ، عن معقل بن يسار قال : قال رسول الله صلى الله عليه وسلم : \" آمنوا بالتوراة والزبور والإنجيل ، وليسعكم القرآن \" .\n                                    ",
        "qortoby": "قُولُوٓاْ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ إِلَىٰٓ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَمَآ أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَآ أُوتِيَ ٱلنَّبِيُّونَ مِن رَّبِّهِمۡ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّنۡهُمۡ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ٦٣١\n                                    \n                                    \n                                    قوله تعالى : قولوا آمنا بالله وما أنزل إلينا وما أنزل إلى إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط وما أوتي موسى وعيسى وما أوتي النبيون من ربهم لا نفرق بين أحد منهم ونحن له مسلمون\nقوله تعالى : قولوا آمنا بالله خرج البخاري عن أبي هريرة رضي الله عنه قال : كان أهل الكتاب يقرءون التوراة بالعبرانية ويفسرونها بالعربية لأهل الإسلام ، فقال رسول الله صلى الله عليه وسلم : ( لا تصدقوا أهل الكتاب ولا تكذبوهم وقولوا آمنا بالله وما أنزل ) الآية . وقال محمد بن سيرين : إذا قيل لك أنت مؤمن ؟ فقل : آمنا بالله وما أنزل إلينا وما أنزل إلى إبراهيم وإسماعيل وإسحاق الآية . وكره أكثر السلف أن يقول الرجل : أنا مؤمن حقا ، وسيأتي بيانه في \" الأنفال \" إن شاء الله تعالى . وسئل بعض المتقدمين عن رجل قيل له : أتؤمن بفلان النبي ، فسماه باسم لم يعرفه ، فلو قال نعم ، فلعله لم يكن نبيا ، فقد شهد بالنبوة لغير نبي ، ولو قال لا ، فلعله نبي ، فقد جحد نبيا من الأنبياء ، فكيف يصنع ؟ فقال : ينبغي أن يقول : إن كان نبيا فقد آمنت به . والخطاب في هذه الآية لهذه الأمة ، علمهم الإيمان . قال ابن عباس : جاء نفر من اليهود إلى النبي صلى الله عليه وسلم فسألوه عمن يؤمن به من الأنبياء ، فنزلت الآية . فلما جاء ذكر عيسى قالوا : لا نؤمن بعيسى ولا من آمن به .\nقوله تعالى : وما أنزل إلينا وما أنزل إلى إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط جمع إبراهيم براهيم وإسماعيل سماعيل ، قاله الخليل وسيبويه ، وقاله الكوفيون ، وحكوا براهمة وسماعلة ، وحكوا براهم وسماعل . قال محمد بن يزيد : هذا غلط ; لأن الهمزة ليس هذا موضع زيادتها ، ولكن أقول : أباره وأسامع ، ويجوز أباريه وأساميع . وأجاز أحمد بن يحيى براه ، كما يقال في التصغير بريه . وجمع إسحاق أساحيق ، وحكى الكوفيون أساحقة وأساحق ، وكذا يعقوب ويعاقيب ، ويعاقبة ويعاقب . قال النحاس : فأما إسرائيل فلا نعلم أحدا يجيز حذف الهمزة من أوله ، وإنما يقال أساريل ، وحكى الكوفيون أسارلة وأسارل . والباب في هذا كله أن يجمع مسلما فيقال : إبراهيمون وإسحاقون ويعقوبون ، والمسلم لا عمل فيه .\nوالأسباط : ولد يعقوب عليه السلام ، وهم اثنا عشر ولدا ، ولد لكل واحد منهم أمة من الناس ، واحدهم سبط . والسبط في بني إسرائيل بمنزلة القبيلة في ولد إسماعيل . وسموا الأسباط من السبط وهو التتابع ، فهم جماعة متتابعون . وقيل : أصله من السبط ( بالتحريك ) وهو الشجر ، أي هم في الكثرة بمنزلة الشجر ، الواحدة سبطة . قال أبو إسحاق الزجاج : ويبين لك هذا ما حدثنا به محمد بن جعفر الأنباري قال حدثنا أبو نجيد الدقاق قال حدثنا الأسود بن عامر قال حدثنا إسرائيل عن سماك عن عكرمة عن ابن عباس قال : كل الأنبياء من بني إسرائيل إلا عشرة : نوحا وشعيبا وهودا وصالحا ولوطا وإبراهيم وإسحاق ويعقوب وإسماعيل ومحمدا صلى الله عليه وسلم . ولم يكن أحد له اسمان إلا عيسى ويعقوب . والسبط : الجماعة والقبيلة الراجعون إلى أصل واحد . وشعر سبط وسبط : غير جعد . لا نفرق بين أحد منهم ونحن له مسلمون قال الفراء : أي لا نؤمن ببعضهم ونكفر ببعضهم كما فعلت اليهود والنصارى .\n                                    ",
        "saadi": "قُولُوٓاْ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ إِلَىٰٓ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَمَآ أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَآ أُوتِيَ ٱلنَّبِيُّونَ مِن رَّبِّهِمۡ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّنۡهُمۡ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ٦٣١\n                                        \n                                        \n                                        \n                                        هذه الآية الكريمة, قد اشتملت على جميع ما يجب الإيمان به. واعلم أن الإيمان الذي هو تصديق القلب التام, بهذه الأصول, وإقراره المتضمن لأعمال القلوب والجوارح، وهو بهذا الاعتبار يدخل فيه الإسلام, وتدخل فيه الأعمال الصالحة كلها، فهي من الإيمان, وأثر من آثاره، فحيث أطلق الإيمان, دخل فيه ما ذكر، وكذلك الإسلام, إذا أطلق دخل فيه الإيمان، فإذا قرن بينهما, كان الإيمان اسما لما في القلب من الإقرار والتصديق، والإسلام, اسما للأعمال الظاهرة وكذلك إذا جمع بين الإيمان والأعمال الصالحة، فقوله تعالى: { قُولُوا } أي: بألسنتكم, متواطئة عليها قلوبكم، وهذا هو القول التام, المترتب عليه الثواب والجزاء، فكما أن النطق باللسان, بدون اعتقاد القلب, نفاق وكفر، فالقول الخالي من العمل عمل القلب, عديم التأثير, قليل الفائدة, وإن كان العبد يؤجر عليه, إذا كان خيرا ومعه أصل الإيمان، لكن فرق بين القول المجرد, والمقترن به عمل القلب. وفي قوله: { قُولُوا } إشارة إلى الإعلان بالعقيدة, والصدع بها, والدعوة لها, إذ هي أصل الدين وأساسه. وفي قوله: { آمَنَّا } ونحوه مما فيه صدور الفعل, منسوبا إلى جميع الأمة, إشارة إلى أنه يجب على الأمة, الاعتصام بحبل الله جميعا, والحث على الائتلاف حتى يكون داعيهم واحدا, وعملهم متحدا, وفي ضمنه النهي عن الافتراق، وفيه: أن المؤمنين كالجسد الواحد. وفي قوله: { قُولُوا آمَنَّا بِاللَّهِ } إلخ دلالة على جواز إضافة الإنسان إلى نفسه الإيمان, على وجه التقييد, بل على وجوب ذلك، بخلاف قوله: \"أنا مؤمن\" ونحوه, فإنه لا يقال إلا مقرونا بالاستثناء بالمشيئة, لما فيه من تزكية النفس, والشهادة على نفسه بالإيمان. فقوله: { آمَنَّا بِاللَّهِ } أي: بأنه موجود, واحد أحد, متصف بكل صفة كمال, منزه عن كل نقص وعيب, مستحق لإفراده بالعبادة كلها, وعدم الإشراك به في شيء منها, بوجه من الوجوه. { وَمَا أُنْزِلَ إِلَيْنَا } يشمل القرآن والسنة لقوله تعالى: { وَأَنْزَلَ اللَّهُ عَلَيْكَ الْكِتَابَ وَالْحِكْمَةَ } فيدخل فيه الإيمان بما تضمنه كتاب الله وسنة رسوله, من صفات الباري, وصفات رسله, واليوم الآخر, والغيوب الماضية والمستقبلة, والإيمان بما تضمنه ذلك من الأحكام الشرعية الأمرية, وأحكام الجزاء وغير ذلك. { وَمَا أُنْزِلَ إِلَى إِبْرَاهِيمَ } إلى آخر الآية، فيه الإيمان بجميع الكتب المنزلة على جميع الأنبياء، والإيمان بالأنبياء عموما وخصوصا, ما نص عليه في الآية, لشرفهم ولإتيانهم بالشرائع الكبار. فالواجب في الإيمان بالأنبياء والكتب, أن يؤمن بهم على وجه العموم والشمول، ثم ما عرف منهم بالتفصيل, وجب الإيمان به مفصلا. وقوله: { لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْهُمْ } أي: بل نؤمن بهم كلهم، هذه خاصية المسلمين, التي انفردوا بها عن كل من يدعي أنه على دين. فاليهود والنصارى والصابئون وغيرهم - وإن زعموا أنهم يؤمنون بما يؤمنون به من الرسل والكتب - فإنهم يكفرون بغيره، فيفرقون بين الرسل والكتب, بعضها يؤمنون به وبعضها يكفرون به، وينقض تكذيبهم تصديقهم، فإن الرسول الذي زعموا, أنهم قد آمنوا به, قد صدق سائر الرسل وخصوصا محمد صلى الله عليه وسلم، فإذا كذبوا محمدا, فقد كذبوا رسولهم فيما أخبرهم به, فيكون كفرا برسولهم. وفي قوله: { وَمَا أُوتِيَ النَّبِيُّونَ مِنْ رَبِّهِمْ } دلالة على أن عطية الدين, هي العطية الحقيقية المتصلة بالسعادة الدنيوية والأخروية. لم يأمرنا أن نؤمن بما أوتي الأنبياء من الملك والمال ونحو ذلك، بل أمرنا أن نؤمن بما أعطوا من الكتب والشرائع. وفيه أن الأنبياء مبلغون عن الله, ووسائط بين الله وبين خلقه في تبليغ دينه, ليس لهم من الأمر شيء. وفي قوله: { مِنْ رَبِّهِمْ } إشارة إلى أنه من كمال ربوبيته لعباده, أن ينزل عليهم الكتب, ويرسل إليهم الرسل, فلا تقتضي ربوبيته, تركهم سدى ولا هملا. وإذا كان ما أوتي النبيون, إنما هو من ربهم, ففيه الفرق بين الأنبياء وبين من يدعي النبوة, وأنه يحصل الفرق بينهم بمجرد معرفة ما يدعون إليه، فالرسل لا يدعون إلا إلى لخير, ولا ينهون إلا عن كل شر، وكل واحد منهم, يصدق الآخر, ويشهد له بالحق, من غير تخالف ولا تناقض لكونه من عند ربهم { وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا } وهذا بخلاف من ادعى النبوة, فلا بد أن يتناقضوا في أخبارهم وأوامرهم ونواهيهم, كما يعلم ذلك من سبر أحوال الجميع, وعرف ما يدعون إليه. فلما بيَّن تعالى جميع ما يؤمن به, عموما وخصوصا, وكان القول لا يغني عن العمل قال: { وَنَحْنُ لَهُ مُسْلِمُونَ } أي: خاضعون لعظمته, منقادون لعبادته, بباطننا وظاهرنا, مخلصون له العبادة بدليل تقديم المعمول, وهو { لَهُ } على العامل وهو { مُسْلِمُونَ } فقد اشتملت هذه الآية الكريمة - على إيجازها واختصارها - على أنواع التوحيد الثلاثة: توحيد الربوبية, وتوحيد الألوهية, وتوحيد الأسماء والصفات، واشتملت على الإيمان بجميع الرسل, وجميع الكتب، وعلى التخصيص الدال على الفضل بعد التعميم، وعلى التصديق بالقلب واللسان والجوارح والإخلاص لله في ذلك، وعلى الفرق بين الرسل الصادقين, ومن ادعى النبوة من الكاذبين، وعلى تعليم الباري عباده, كيف يقولون, ورحمته وإحسانه عليهم بالنعم الدينية المتصلة بسعادة الدنيا والآخرة، فسبحان من جعل كتابه تبيانا لكل شيء, وهدى ورحمة لقوم يؤمنون.\n                                    "
      },
      "originalText": "قُولُوٓاْ ءَامَنَّا بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡنَا وَمَآ أُنزِلَ إِلَىٰٓ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَمَآ أُوتِيَ مُوسَىٰ وَعِيسَىٰ وَمَآ أُوتِيَ ٱلنَّبِيُّونَ مِن رَّبِّهِمۡ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّنۡهُمۡ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ٦٣١"
    },
    {
      "number": 144,
      "text": "فَإِنْ آمَنُوا بِمِثْلِ مَا آمَنْتُمْ بِهِ فَقَدِ اهْتَدَوْا ۖ وَإِنْ تَوَلَّوْا فَإِنَّمَا هُمْ فِي شِقَاقٍ ۖ فَسَيَكْفِيكَهُمُ اللَّهُ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 137,
      "juz": 1,
      "manzil": 1,
      "page": 21,
      "ruku": 17,
      "hizbQuarter": 8,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِنۡ ءَامَنُواْ بِمِثۡلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا هُمۡ فِي شِقَاقٖۖ فَسَيَكۡفِيكَهُمُ ٱللَّهُۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٧٣١\n                                    \n                                    \n                                    قول تعالى : ( فإن آمنوا ) أي : الكفار من أهل الكتاب وغيرهم ( بمثل ما آمنتم به ) أيها المؤمنون ، من الإيمان بجميع كتب الله ورسله ، ولم يفرقوا بين أحد منهم ( فقد اهتدوا ) أي : فقد أصابوا الحق ، وأرشدوا إليه ( وإن تولوا ) أي : عن الحق إلى الباطل ، بعد قيام الحجة عليهم ( فإنما هم في شقاق فسيكفيكهم الله ) أي : فسينصرك عليهم ويظفرك بهم ( وهو السميع العليم )\nوقال ابن أبي حاتم : قرئ على يونس بن عبد الأعلى حدثنا ابن وهب ، حدثنا زياد بن يونس ، حدثنا نافع بن أبي نعيم ، قال : أرسل إلي بعض الخلفاء مصحف عثمان بن عفان ليصلحه . قال زياد : فقلت له : إن الناس يقولون : إن مصحفه كان في حجره حين قتل ، فوقع الدم على ( فسيكفيكهم الله وهو السميع العليم ) فقال نافع : بصرت عيني بالدم على هذه الآية وقد قدم .\n                                    ",
        "qortoby": "فَإِنۡ ءَامَنُواْ بِمِثۡلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا هُمۡ فِي شِقَاقٖۖ فَسَيَكۡفِيكَهُمُ ٱللَّهُۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٧٣١\n                                    \n                                    \n                                    قوله تعالى : فإن آمنوا بمثل ما آمنتم به فقد اهتدوا وإن تولوا فإنما هم في شقاق فسيكفيكهم الله وهو السميع العليم قوله تعالى : فإن آمنوا بمثل ما آمنتم به فقد اهتدوا الخطاب لمحمد صلى الله عليه وسلم وأمته . المعنى : فإن آمنوا مثل إيمانكم ، وصدقوا مثل تصديقكم فقد اهتدوا ، فالمماثلة وقعت بين الإيمانين ، وقيل : إن الباء زائدة مؤكدة . وكان ابن عباس يقرأ فيما حكى الطبري : فإن آمنوا بالذي آمنتم به فقد اهتدوا وهذا هو معنى القراءة وإن خالف المصحف ، ف مثل زائدة كما هي في قوله : ليس كمثله شيء أي ليس كهو شيء . وقال الشاعر [ هو حميد الأرقط ] :\nفصيروا مثل كعصف مأكول\nوروى بقية حدثنا شعبة عن أبي حمزة عن ابن عباس قال : لا تقولوا فإن آمنوا بمثل ما آمنتم به فإن الله ليس له مثل ، ولكن قولوا : بالذي آمنتم به . تابعه علي بن نصر الجهضمي عن شعبة ، ذكره البيهقي . والمعنى : أي فإن آمنوا بنبيكم وبعامة الأنبياء ولم يفرقوا بينهم كما لم تفرقوا فقد اهتدوا ، وإن أبوا إلا التفريق فهم الناكبون عن الدين إلى الشقاق فسيكفيكهم الله . وحكي عن جماعة من أهل النظر قالوا : ويحتمل أن تكون الكاف في قوله : ليس كمثله شيء زائدة . قال : والذي روي عن ابن عباس من نهيه عن القراءة العامة شيء ذهب إليه للمبالغة في نفي التشبيه عن الله عز وجل . وقال ابن عطية : هذا من ابن عباس على جهة التفسير ، أي هكذا فليتأول . وقد قيل : إن الباء بمعنى على ، والمعنى : فإن آمنوا على مثل إيمانكم . وقيل : مثل على بابها أي بمثل المنزل ، دليله قوله : وقل آمنت بما أنزل الله من كتاب ، وقوله : وقولوا آمنا بالذي أنزل إلينا وأنزل إليكم .\nقوله تعالى : وإن تولوا أي عن الإيمان فإنما هم في شقاق قال زيد بن أسلم : الشقاق المنازعة . وقيل : الشقاق المجادلة والمخالفة والتعادي . وأصله من الشق وهو الجانب ، فكأن كل واحد من الفريقين في شق غير شق صاحبه . قال الشاعر :\nإلى كم تقتل العلماء قسرا وتفجر بالشقاق وبالنفاق\nوقال آخر :\nوإلا فاعلموا أنا وأنتم بغاة ما بقينا في شقاق\nوقيل : إن الشقاق مأخوذ من فعل ما يشق ويصعب ، فكأن كل واحد من الفريقين يحرص على ما يشق على صاحبه .\nقوله تعالى : فسيكفيكهم الله أي فسيكفي الله رسوله عدوه . فكان هذا وعدا من الله تعالى لنبيه عليه السلام أنه سيكفيه من عانده ومن خالفه من المتولين بمن يهديه من المؤمنين ، فأنجز له الوعد ، وكان ذلك في قتل بني قينقاع وبني قريظة وإجلاء بني النضير . والكاف والهاء والميم في موضع نصب مفعولان . ويجوز في غير القرآن : فسيكفيك إياهم . وهذا الحرف فسيكفيكهم الله هو الذي وقع عليه دم عثمان حين قتل بإخبار النبي صلى الله عليه وسلم إياه بذلك . والسميع لقول كل قائل العليم بما ينفذه في عباده ويجريه عليهم . وحكي أن أبا دلامة دخل على المنصور وعليه قلنسوة طويلة ، ودراعة مكتوب بين كتفيها فسيكفيكهم الله وهو السميع العليم ، وسيف معلق في وسطه ، وكان المنصور قد أمر الجند بهذا الزي ، فقال له : كيف حالك يا أبا دلامة ؟ قال : بشر يا أمير المؤمنين قال : وكيف ذاك ؟ قال : ما ظنك برجل وجهه في وسطه ، وسيفه في استه ، وقد نبذ كتاب الله وراء ظهره فضحك المنصور منه ، وأمر بتغيير ذلك الزي من وقته .\n                                    ",
        "saadi": "فَإِنۡ ءَامَنُواْ بِمِثۡلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا هُمۡ فِي شِقَاقٖۖ فَسَيَكۡفِيكَهُمُ ٱللَّهُۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٧٣١\n                                        \n                                        \n                                        \n                                        أي: فإن آمن أهل الكتاب { بمثل ما آمنتم به } - يا معشر المؤمنين - من جميع الرسل, وجميع الكتب, الذين أول من دخل فيهم, وأولى خاتمهم وأفضلهم محمد صلى الله عليه وسلم والقرآن, وأسلموا لله وحده, ولم يفرقوا بين أحد من رسل الله { فَقَدِ اهْتَدَوْا } للصراط المستقيم, الموصل لجنات النعيم، أي: فلا سبيل لهم إلى الهداية, إلا بهذا الإيمان، لا كما زعموا بقولهم: \" كونوا هودا أو نصارى تهتدوا \" فزعموا أن الهداية خاصة بما كانوا عليه، و \" الهدى \" هو العلم بالحق, والعمل به, وضده الضلال عن العلم والضلال عن العمل بعد العلم, وهو الشقاق الذي كانوا عليه, لما تولوا وأعرضوا، فالمشاق: هو الذي يكون في شق والله ورسوله في شق، ويلزم من المشاقة المحادة, والعداوة البليغة, التي من لوازمها, بذل ما يقدرون عليه من أذية الرسول، فلهذا وعد الله رسوله, أن يكفيه إياهم, لأنه السميع لجميع الأصوات, باختلاف اللغات, على تفنن الحاجات, العليم بما بين أيديهم وما خلفهم, بالغيب والشهادة, بالظواهر والبواطن، فإذا كان كذلك, كفاك الله شرهم. وقد أنجز الله لرسوله وعده, وسلطه عليهم حتى قتل بعضهم, وسبى بعضهم, وأجلى بعضهم, وشردهم كل مشرد. ففيه معجزة من معجزات القرآن, وهو الإخبار بالشيء قبل وقوعه, فوقع طبق ما أخبر.\n                                    "
      },
      "originalText": "فَإِنۡ ءَامَنُواْ بِمِثۡلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا هُمۡ فِي شِقَاقٖۖ فَسَيَكۡفِيكَهُمُ ٱللَّهُۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٧٣١"
    },
    {
      "number": 145,
      "text": "صِبْغَةَ اللَّهِ ۖ وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً ۖ وَنَحْنُ لَهُ عَابِدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 138,
      "juz": 1,
      "manzil": 1,
      "page": 21,
      "ruku": 17,
      "hizbQuarter": 8,
      "sajda": false,
      "tafsier": {
        "ibnkther": "صِبۡغَةَ ٱللَّهِ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ صِبۡغَةٗۖ وَنَحۡنُ لَهُۥ عَٰبِدُونَ ٨٣١\n                                    \n                                    \n                                    وقوله : ( صبغة الله ) قال الضحاك ، عن ابن عباس : دين الله . وكذا روي عن مجاهد ، وأبي العالية ، وعكرمة ، وإبراهيم ، والحسن ، وقتادة ، والضحاك ، وعبد الله بن كثير ، وعطية العوفي ، والربيع بن أنس ، والسدي ، نحو ذلك .\nوانتصاب ( صبغة الله ) إما على الإغراء كقوله ( فطرة الله ) [ الروم : 30 ] أي : الزموا ذلك عليكموه . وقال بعضهم : بدل من قوله : ( ملة إبراهيم ) وقال سيبويه : هو مصدر مؤكد انتصب عن قوله : ( آمنا بالله ) كقوله ) واعبدوا الله ) [ النساء : 36 ] .\nوقد ورد في حديث رواه ابن أبي حاتم وابن مردويه ، من رواية أشعث بن إسحاق عن جعفر بن أبي المغيرة عن سعيد بن جبير ، عن ابن عباس أن نبي الله قال : \" إن بني إسرائيل قالوا : يا موسى ، هل يصبغ ربك ؟ فقال : اتقوا الله . فناداه ربه : يا موسى ، سألوك هل يصبغ ربك ؟ فقل : نعم ، أنا أصبغ الألوان : الأحمر والأبيض والأسود ، والألوان كلها من صبغي \" . وأنزل الله على نبيه صلى الله عليه وسلم : ( صبغة الله ومن أحسن من الله صبغة ) .\nكذا وقع في رواية ابن مردويه مرفوعا ، وهو في رواية ابن أبي حاتم موقوف ، وهو أشبه ، إن صح إسناده ، والله أعلم .\n                                    ",
        "qortoby": "صِبۡغَةَ ٱللَّهِ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ صِبۡغَةٗۖ وَنَحۡنُ لَهُۥ عَٰبِدُونَ ٨٣١\n                                    \n                                    \n                                    قوله تعالى : صبغة الله ومن أحسن من الله صبغة ونحن له عابدون فيه مسالتان : الأولى : قوله تعالى : صبغة الله قال الأخفش وغيره : دين الله ، وهو بدل من ( ملة ) وقال الكسائي : وهي منصوبة على تقدير اتبعوا . أو على الإغراء أي الزموا . ولو قرئت بالرفع لجاز ، أي هي صبغة الله . وروىشيبان عن قتادة قال : إن اليهود تصبغ أبناءهم يهودا ، وإن النصارى تصبغ أبناءهم نصارى ، وإن صبغة الله الإسلام . قال الزجاج : ويدلك على هذا أن صبغة بدل من ملة . وقال مجاهد : أي فطرة الله التي فطر الناس عليها . قال أبو إسحاق الزجاج : وقول مجاهد هذا يرجع إلى الإسلام ; لأن الفطرة ابتداء الخلق ، وابتداء ما خلقوا عليه الإسلام . وروي عن مجاهد والحسن وأبي العالية وقتادة : الصبغة الدين . وأصل ذلك أن النصارى كانوا يصبغون أولادهم في الماء ، وهو الذي يسمونه المعمودية ، ويقولون : هذا تطهير لهم . وقال ابن عباس : هو أن النصارى كانوا إذا ولد لهم ولد فأتى عليه سبعة أيام غمسوه في ماء لهم يقال له ماء المعمودية ، فصبغوه بذلك ليطهروا به مكان الختان ; لأن الختان تطهير ، فإذا فعلوا ذلك قالوا : الآن صار نصرانيا حقا ، فرد الله تعالى ذلك عليهم بأن قال : صبغة الله أي صبغة الله أحسن صبغة وهي الإسلام ، فسمي الدين صبغة استعارة ومجازا من حيث تظهر أعماله وسمته على المتدين ، كما يظهر أثر الصبغ في الثوب . وقال بعض شعراء ملوك همدان :\nوكل أناس لهم صبغة وصبغة همدان خير الصبغ صبغنا على ذاك أبناءنا\nفأكرم بصبغتنا في الصبغ\nوقيل : إن الصبغة الاغتسال لمن أراد الدخول في الإسلام ، بدلا من معمودية النصارى ، ذكره الماوردي .\nقلت : وعلى هذا التأويل يكون غسل الكافر واجبا تعبدا ; وهي المسألة :\nالثانية لأن معنى صبغة الله غسل الله ، أي اغتسلوا عند إسلامكم الغسل الذي أوجبه الله عليكم . وبهذا المعنى جاءت السنة الثابتة في قيس بن عاصم وثمامة بن أثال حين أسلما . روى أبو حاتم البستي في صحيح مسنده عن أبي هريرة رضي الله عنه : أن ثمامة الحنفي أسر فمر به النبي صلى الله عليه وسلم يوما فأسلم ، فبعث به إلى حائط أبي طلحة فأمره أن يغتسل فاغتسل وصلى ركعتين ، فقال رسول الله صلى الله عليه وسلم : حسن إسلام صاحبكم . وخرج أيضا عن قيس بن عاصم أنه أسلم ، فأمره النبي صلى الله عليه وسلم أن يغتسل بماء وسدر . ذكره النسائي وصححه أبو محمد عبد الحق . وقيل : إن القربة إلى الله تعالى يقال لها صبغة ، حكاه ابن فارس في المجمل . وقال الجوهري : صبغة الله دينه . وقيل : إن الصبغة الختان ، اختتن إبراهيم فجرت الصبغة على الختان لصبغهم الغلمان في الماء ، قاله الفراء . ونحن له عابدون ابتداء وخبر .\n                                    ",
        "saadi": "صِبۡغَةَ ٱللَّهِ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ صِبۡغَةٗۖ وَنَحۡنُ لَهُۥ عَٰبِدُونَ ٨٣١\n                                        \n                                        \n                                        \n                                        : الزموا صبغة الله, وهو دينه, وقوموا به قياما تاما, بجميع أعماله الظاهرة والباطنة, وجميع عقائده في جميع الأوقات, حتى يكون لكم صبغة, وصفة من صفاتكم، فإذا كان صفة من صفاتكم, أوجب ذلك لكم الانقياد لأوامره, طوعا واختيارا ومحبة, وصار الدين طبيعة لكم بمنزلة الصبغ التام للثوب الذي صار له صفة, فحصلت لكم السعادة الدنيوية والأخروية, لحث الدين على مكارم الأخلاق, ومحاسن الأعمال, ومعالي الأمور، فلهذا قال - على سبيل التعجب المتقرر للعقول الزكية-: { وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً } أي: لا أحسن صبغة من صبغته وإذا أردت أن تعرف نموذجا يبين لك الفرق بين صبغة الله وبين غيرها من الصبغ, فقس الشيء بضده، فكيف ترى في عبد آمن بربه إيمانا صحيحا, أثر معه خضوع القلب وانقياد الجوارح، فلم يزل يتحلى بكل وصف حسن, وفعل جميل, وخلق كامل, ونعت جليل، ويتخلى من كل وصف قبيح, ورذيلة وعيب، فوصفه: الصدق في قوله وفعله, والصبر والحلم, والعفة, والشجاعة, والإحسان القولي والفعلي, ومحبة الله وخشيته, وخوفه, ورجاؤه، فحاله الإخلاص للمعبود, والإحسان لعبيده، فقسه بعبد كفر بربه, وشرد عنه, وأقبل على غيره من المخلوقين فاتصف بالصفات القبيحة, من الكفر, والشرك والكذب, والخيانة, والمكر, والخداع, وعدم العفة, والإساءة إلى الخلق, في أقواله, وأفعاله، فلا إخلاص للمعبود, ولا إحسان إلى عبيده. فإنه يظهر لك الفرق العظيم بينهما, ويتبين لك أنه لا أحسن صبغة من صبغة الله, وفي ضمنه أنه لا أقبح صبغة ممن انصبغ بغير دينه. وفي قوله: { وَنَحْنُ لَهُ عَابِدُونَ } بيان لهذه الصبغة, وهي القيام بهذين الأصلين: الإخلاص والمتابعة, لأن \" العبادة \" اسم جامع لكل ما يحبه الله ويرضاه من الأعمال, والأقوال الظاهرة والباطنة، ولا تكون كذلك, حتى يشرعها الله على لسان رسوله، والإخلاص: أن يقصد العبد وجه الله وحده, في تلك الأعمال، فتقديم المعمول, يؤذن بالحصر. وقال: { وَنَحْنُ لَهُ عَابِدُونَ } فوصفهم باسم الفاعل الدال على الثبوت والاستقرار, ليدل على اتصافهم بذلك وكونه صار صبغة لهم ملازما.\n                                    "
      },
      "originalText": "صِبۡغَةَ ٱللَّهِ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ صِبۡغَةٗۖ وَنَحۡنُ لَهُۥ عَٰبِدُونَ ٨٣١"
    },
    {
      "number": 146,
      "text": "قُلْ أَتُحَاجُّونَنَا فِي اللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ وَنَحْنُ لَهُ مُخْلِصُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 139,
      "juz": 1,
      "manzil": 1,
      "page": 21,
      "ruku": 17,
      "hizbQuarter": 8,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ أَتُحَآجُّونَنَا فِي ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمۡ وَلَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ وَنَحۡنُ لَهُۥ مُخۡلِصُونَ ٩٣١\n                                    \n                                    \n                                    يقول الله تعالى مرشدا نبيه صلوات الله وسلامه عليه إلى درء مجادلة المشركين : ( قل أتحاجوننا في الله ) أي : أتناظروننا في توحيد الله والإخلاص له والانقياد ، واتباع أوامره وترك زواجره ( وهو ربنا وربكم ) المتصرف فينا وفيكم ، المستحق لإخلاص الإلهية له وحده لا شريك له ! ( ولنا أعمالنا ولكم أعمالكم ) أي : نحن برآء منكم ، وأنتم برآء منا ، كما قال في الآية الأخرى : ( وإن كذبوك فقل لي عملي ولكم عملكم أنتم بريئون مما أعمل وأنا بريء مما تعملون ) [ يونس : 41 ] وقال تعالى : ( فإن حاجوك فقل أسلمت وجهي لله ومن اتبعن وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ والله بصير بالعباد ) [ آل عمران : 20 ] وقال تعالى إخبارا عن إبراهيم ( وحاجه قومه قال أتحاجوني في الله وقد هدان ولا أخاف ما تشركون به إلا أن يشاء ربي شيئا وسع ربي كل شيء علما أفلا تتذكرون ) [ الأنعام : 80 ] وقال ( ألم تر إلى الذي حاج إبراهيم في ربه ) الآية [ البقرة : 258 ] .\nوقال في هذه الآية الكريمة : ( [ ولنا أعمالنا ولكم أعمالكم ] ونحن له مخلصون ) أي : نحن برآء منكم كما أنتم برآء منا ، ونحن له مخلصون ، أي في العبادة والتوجه .\n\n                                    ",
        "qortoby": "قُلۡ أَتُحَآجُّونَنَا فِي ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمۡ وَلَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ وَنَحۡنُ لَهُۥ مُخۡلِصُونَ ٩٣١\n                                    \n                                    \n                                    قوله تعالى : قل أتحاجوننا في الله وهو ربنا وربكم ولنا أعمالنا ولكم أعمالكم ونحن له مخلصون\nقال الحسن : كانت المحاجة أن قالوا : نحن أولى بالله منكم ; لأنا أبناء الله وأحباؤه . وقيل : لتقدم آبائنا وكتبنا ; ولأنا لم نعبد الأوثان . فمعنى الآية : قل لهم يا محمد ، أي قل لهؤلاء اليهود والنصارى الذين زعموا أنهم أبناء الله وأحباؤه وادعوا أنهم أولى بالله منكم لقدم آبائهم وكتبهم : أتحاجوننا أي أتجاذبوننا الحجة على دعواكم والرب واحد ، وكل مجازى بعمله ، فأي تأثير لقدم الدين . ومعنى في الله أي في دينه والقرب منه والحظوة له . وقراءة الجماعة : أتحاجوننا . وجاز اجتماع حرفين مثلين من جنس واحد متحركين ; لأن الثاني كالمنفصل . وقرأ ابن محيصن \" أتحاجونا \" بالإدغام لاجتماع المثلين . قال النحاس : وهذا جائز إلا أنه مخالف للسواد . ويجوز \" أتحاجون \" بحذف النون الثانية ، كما قرأ نافع فبم تبشرون\nقوله تعالى : ونحن له مخلصون أي مخلصون العبادة ، وفيه معنى التوبيخ ، أي ولم تخلصوا أنتم فكيف تدعون ما نحن أولى به منكم ، والإخلاص حقيقته تصفية الفعل عن ملاحظة المخلوقين ، قال صلى الله عليه وسلم : إن الله تعالى يقول أنا خير شريك فمن أشرك معي شريكا فهو لشريكي يا أيها الناس أخلصوا أعمالكم لله تعالى فإن الله تعالى لا يقبل إلا ما خلص له ولا تقولوا هذا لله وللرحم فإنها للرحم وليس لله منها شيء ولا تقولوا هذا لله ولوجوهكم فإنها لوجوهكم وليس لله تعالى منها شيء . رواه الضحاك بن قيس الفهري قال : قال رسول الله صلى الله عليه وسلم . فذكره ، خرجه الدارقطني . وقال رويم : الإخلاص من العمل هو ألا يريد صاحبه عليه عوضا في الدارين ولا حظا من الملكين . وقال الجنيد : الإخلاص سر بين العبد وبين الله ، لا يعلمه ملك فيكتبه ، ولا شيطان فيفسده ، ولا هوى فيميله . وذكر أبو القاسم القشيري وغيره عن النبي صلى الله عليه وسلم أنه قال : سألت جبريل عن الإخلاص ما هو فقال : سألت رب العزة عن الإخلاص ما هو قال سر من سري استودعته قلب من أحببته من عبادي .\n                                    ",
        "saadi": "قُلۡ أَتُحَآجُّونَنَا فِي ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمۡ وَلَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ وَنَحۡنُ لَهُۥ مُخۡلِصُونَ ٩٣١\n                                        \n                                        \n                                        \n                                        المحاجة هي: المجادلة بين اثنين فأكثر, تتعلق بالمسائل الخلافية, حتى يكون كل من الخصمين يريد نصرة قوله, وإبطال قول خصمه، فكل واحد منهما, يجتهد في إقامة الحجة على ذلك، والمطلوب منها, أن تكون بالتي هي أحسن, بأقرب طريق يرد الضال إلى الحق, ويقيم الحجة على المعاند, ويوضح الحق, ويبين الباطل، فإن خرجت عن هذه الأمور, كانت مماراة, ومخاصمة لا خير فيها, وأحدثت من الشر ما أحدثت، فكان أهل الكتاب, يزعمون أنهم أولى بالله من المسلمين, وهذا مجرد دعوى, تفتقر إلى برهان ودليل. فإذا كان رب الجميع واحدا, ليس ربا لكم دوننا, وكل منا ومنكم له عمله, فاستوينا نحن وإياكم بذلك. فهذا لا يوجب أن يكون أحد الفريقين أولى بالله من غيره؛ لأن التفريق مع الاشتراك في الشيء, من غير فرق مؤثر, دعوى باطلة, وتفريق بين متماثلين, ومكابرة ظاهرة. وإنما يحصل التفضيل, بإخلاص الأعمال الصالحة لله وحده، وهذه الحالة, وصف المؤمنين وحدهم, فتعين أنهم أولى بالله من غيرهم؛ لأن الإخلاص, هو الطريق إلى الخلاص، فهذا هو الفرق بين أولياء الرحمن وأولياء الشيطان, بالأوصاف الحقيقية التي يسلمها أهل العقول, ولا ينازع فيها إلا كل مكابر جهول، ففي هذه الآية, إرشاد لطيف لطريق المحاجة, وأن الأمور مبنية على الجمع بين المتماثلين, والفرق بين المختلفين.\n                                    "
      },
      "originalText": "قُلۡ أَتُحَآجُّونَنَا فِي ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمۡ وَلَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ وَنَحۡنُ لَهُۥ مُخۡلِصُونَ ٩٣١"
    },
    {
      "number": 147,
      "text": "أَمْ تَقُولُونَ إِنَّ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطَ كَانُوا هُودًا أَوْ نَصَارَىٰ ۗ قُلْ أَأَنْتُمْ أَعْلَمُ أَمِ اللَّهُ ۗ وَمَنْ أَظْلَمُ مِمَّنْ كَتَمَ شَهَادَةً عِنْدَهُ مِنَ اللَّهِ ۗ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 140,
      "juz": 1,
      "manzil": 1,
      "page": 21,
      "ruku": 17,
      "hizbQuarter": 8,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَمۡ تَقُولُونَ إِنَّ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطَ كَانُواْ هُودًا أَوۡ نَصَٰرَىٰۗ قُلۡ ءَأَنتُمۡ أَعۡلَمُ أَمِ ٱللَّهُۗ وَمَنۡ أَظۡلَمُ مِمَّن كَتَمَ شَهَٰدَةً عِندَهُۥ مِنَ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٠٤١\n                                    \n                                    \n                                    ثم أنكر تعالى عليهم ، في دعواهم أن إبراهيم ومن ذكر بعده من الأنبياء والأسباط كانوا على ملتهم ، إما اليهودية وإما النصرانية فقال : ( قل أأنتم أعلم أم الله ) يعني : بل الله أعلم ، وقد أخبر أنهم لم يكونوا هودا ولا نصارى ، كما قال تعالى : ( ما كان إبراهيم يهوديا ولا نصرانيا ولكن كان حنيفا مسلما وما كان من المشركين ) الآية والتي بعدها [ آل عمران : 67 ، 68 ] .\nوقوله : ( ومن أظلم ممن كتم شهادة عنده من الله ) قال الحسن البصري : كانوا يقرؤون في كتاب الله الذي أتاهم : إن الدين [ عند الله ] الإسلام ، وإن محمدا رسول الله ، وإن إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط كانوا برآء من اليهودية والنصرانية ، فشهد الله بذلك ، وأقروا به على أنفسهم لله ، فكتموا شهادة الله عندهم من ذلك .\nوقوله : ( وما الله بغافل عما تعملون ) [ فيه ] تهديد ووعيد شديد ، أي : [ أن ] علمه محيط بعملكم ، وسيجزيكم عليه .\n                                    ",
        "qortoby": "أَمۡ تَقُولُونَ إِنَّ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطَ كَانُواْ هُودًا أَوۡ نَصَٰرَىٰۗ قُلۡ ءَأَنتُمۡ أَعۡلَمُ أَمِ ٱللَّهُۗ وَمَنۡ أَظۡلَمُ مِمَّن كَتَمَ شَهَٰدَةً عِندَهُۥ مِنَ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٠٤١\n                                    \n                                    \n                                    قوله تعالى : أم تقولون إن إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط كانوا هودا أو نصارى قل أأنتم أعلم أم الله ومن أظلم ممن كتم شهادة عنده من الله وما الله بغافل عما تعملون\nقوله تعالى : أم تقولون بمعنى قالوا . وقرأ حمزة والكسائي وعاصم في رواية حفص تقولون بالتاء وهي قراءة حسنة ; لأن الكلام متسق ، كأن المعنى : أتحاجوننا في الله أم تقولون إن الأنبياء كانوا على دينكم ، فهي أم المتصلة ، وهي على قراءة من قرأ بالياء منقطعة ، فيكون كلامين وتكون أم بمعنى بل . هودا خبر كان ، وخبر إن في الجملة . ويجوز في غير القرآن رفع ( هودا ) على خبر إن وتكون كان ملغاة ، ذكره النحاس .\nقوله تعالى : قل أأنتم أعلم أم الله تقرير وتوبيخ في ادعائهم بأنهم كانوا هودا أو نصارى . فرد الله عليهم بأنه أعلم بهم منكم ، أي لم يكونوا هودا ولا نصارى .\nقوله تعالى : ومن أظلم لفظه الاستفهام ، والمعنى : لا أحد أظلم . ممن كتم شهادة عنده من الله يريد علمهم بأن الأنبياء كانوا على الإسلام . وقيل : ما كتموه من صفة محمد صلى الله عليه وسلم ، قاله قتادة ، والأول أشبه بسياق الآية . وما الله بغافل عما تعملون وعيد وإعلام بأنه لم يترك أمرهم سدى وأنه يجازيهم على أعمالهم . والغافل : الذي لا يفطن للأمور إهمالا منه ، مأخوذ من الأرض الغفل وهي التي لا علم بها ولا أثر عمارة . وناقة غفل : لا سمة بها . ورجل غفل : لم يجرب الأمور . وقال الكسائي : أرض غفل لم تمطر . غفلت عن الشيء غفلة وغفولا ، وأغفلت الشيء : تركته على ذكر منك .\n                                    ",
        "saadi": "أَمۡ تَقُولُونَ إِنَّ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطَ كَانُواْ هُودًا أَوۡ نَصَٰرَىٰۗ قُلۡ ءَأَنتُمۡ أَعۡلَمُ أَمِ ٱللَّهُۗ وَمَنۡ أَظۡلَمُ مِمَّن كَتَمَ شَهَٰدَةً عِندَهُۥ مِنَ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٠٤١\n                                        \n                                        \n                                        \n                                        وهذه دعوى أخرى منهم, ومحاجة في رسل الله, زعموا أنهم أولى بهؤلاء الرسل المذكورين من المسلمين. فرد الله عليهم بقوله: { أَأَنْتُمْ أَعْلَمُ أَمِ اللَّهُ } فالله يقول: { مَا كَانَ إِبْرَاهِيمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلَكِنْ كَانَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ } وهم يقولون: بل كان يهوديا أو نصرانيا. فإما أن يكونوا, هم الصادقين العالمين, أو يكون الله تعالى هو الصادق العالم بذلك, فأحد الأمرين متعين لا محالة، وصورة الجواب مبهم, وهو في غاية الوضوح والبيان، حتى إنه - من وضوحه - لم يحتج أن يقول بل الله أعلم وهو أصدق, ونحو ذلك, لانجلائه لكل أحد، كما إذا قيل: الليل أنور, أم النهار؟ والنار أحر أم الماء؟ والشرك أحسن أم التوحيد؟ ونحو ذلك. وهذا يعرفه كل من له أدنى عقل حتى إنهم بأنفسهم يعرفون ذلك, ويعرفون أن إبراهيم وغيره من الأنبياء, لم يكونوا هودا ولا نصارى, فكتموا هذا العلم وهذه الشهادة, فلهذا كان ظلمهم أعظم الظلم. ولهذا قال تعالى: { وَمَنْ أَظْلَمُ مِمَّنْ كَتَمَ شَهَادَةً عِنْدَهُ مِنَ اللَّهِ } فهي شهادة عندهم, مودعة من الله, لا من الخلق, فيقتضي الاهتمام بإقامتها, فكتموها, وأظهروا ضدها، جمعوا بين كتم الحق, وعدم النطق به, وإظهار الباطل, والدعوة إليه، أليس هذا أعظم الظلم؟ بلى والله, وسيعاقبهم عليه أشد العقوبة، فلهذا قال: { وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ } بل قد أحصى أعمالهم, وعدها وادخر لهم جزاءها, فبئس الجزاء جزاؤهم, وبئست النار, مثوى للظالمين، وهذه طريقة القرآن في ذكر العلم والقدرة, عقب الآيات المتضمنة للأعمال التي يجازى عليها. فيفيد ذلك الوعد والوعيد, والترغيب والترهيب، ويفيد أيضا ذكر الأسماء الحسنى بعد الأحكام, أن الأمر الديني والجزائي, أثر من آثارها, وموجب من موجباتها, وهي مقتضية له.\n                                    "
      },
      "originalText": "أَمۡ تَقُولُونَ إِنَّ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ وَيَعۡقُوبَ وَٱلۡأَسۡبَاطَ كَانُواْ هُودًا أَوۡ نَصَٰرَىٰۗ قُلۡ ءَأَنتُمۡ أَعۡلَمُ أَمِ ٱللَّهُۗ وَمَنۡ أَظۡلَمُ مِمَّن كَتَمَ شَهَٰدَةً عِندَهُۥ مِنَ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٠٤١"
    },
    {
      "number": 148,
      "text": "تِلْكَ أُمَّةٌ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُمْ مَا كَسَبْتُمْ ۖ وَلَا تُسْأَلُونَ عَمَّا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 141,
      "juz": 1,
      "manzil": 1,
      "page": 21,
      "ruku": 17,
      "hizbQuarter": 8,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ لَهَا مَا كَسَبَتۡ وَلَكُم مَّا كَسَبۡتُمۡۖ وَلَا تُسۡ‍َٔلُونَ عَمَّا كَانُواْ يَعۡمَلُونَ ١٤١\n                                    \n                                    \n                                    ثم قال تعالى : ( تلك أمة قد خلت ) أي : قد مضت ( لها ما كسبت ولكم ما كسبتم ) أي : لهم أعمالهم ولكم أعمالكم ( ولا تسألون عما كانوا يعملون ) وليس يغني عنكم انتسابكم إليهم ، من غير متابعة منكم لهم ، ولا تغتروا بمجرد النسبة إليهم حتى تكونوا مثلهم منقادين لأوامر الله واتباع رسله ، الذين بعثوا مبشرين ومنذرين ، فإنه من كفر بنبي واحد فقد كفر بسائر الرسل ، ولا سيما من كفر بسيد الأنبياء ، وخاتم المرسلين ورسول رب العالمين إلى جميع الإنس والجن من سائر المكلفين ، صلوات الله وسلامه عليه وعلى سائر أنبياء الله أجمعين .\n                                    ",
        "qortoby": "تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ لَهَا مَا كَسَبَتۡ وَلَكُم مَّا كَسَبۡتُمۡۖ وَلَا تُسۡ‍َٔلُونَ عَمَّا كَانُواْ يَعۡمَلُونَ ١٤١\n                                    \n                                    \n                                    قوله تعالى : تلك أمة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسألون عما كانوا يعملون\nكررها لأنها تضمنت معنى التهديد والتخويف ، أي إذا كان أولئك الأنبياء على إمامتهم وفضلهم يجازون بكسبهم فأنتم أحرى ، فوجب التأكيد ، فلذلك كررها .\n                                    ",
        "saadi": "تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ لَهَا مَا كَسَبَتۡ وَلَكُم مَّا كَسَبۡتُمۡۖ وَلَا تُسۡ‍َٔلُونَ عَمَّا كَانُواْ يَعۡمَلُونَ ١٤١\n                                        \n                                        \n                                        \n                                        تقدم تفسيرها, وكررها, لقطع التعلق بالمخلوقين, وأن المعول عليه ما اتصف به الإنسان, لا عمل أسلافه وآبائه، فالنفع الحقيقي بالأعمال, لا بالانتساب المجرد للرجال.\n                                    "
      },
      "originalText": "تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ لَهَا مَا كَسَبَتۡ وَلَكُم مَّا كَسَبۡتُمۡۖ وَلَا تُسۡ‍َٔلُونَ عَمَّا كَانُواْ يَعۡمَلُونَ ١٤١"
    }
  ]
}