{
  "number": 210,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 1379,
      "text": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ ۙ قَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا ائْتِ بِقُرْآنٍ غَيْرِ هَٰذَا أَوْ بَدِّلْهُ ۚ قُلْ مَا يَكُونُ لِي أَنْ أُبَدِّلَهُ مِنْ تِلْقَاءِ نَفْسِي ۖ إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ ۖ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ",
      "surah": {
        "number": 10,
        "name": "سورة يونس",
        "englishName": "Yunus",
        "englishNameTranslation": "Jonas",
        "revelationType": "Meccan",
        "numberOfAyahs": 109
      },
      "numberInSurah": 15,
      "juz": 11,
      "manzil": 3,
      "page": 210,
      "ruku": 173,
      "hizbQuarter": 84,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَاتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا ٱئۡتِ بِقُرۡءَانٍ غَيۡرِ هَٰذَآ أَوۡ بَدِّلۡهُۚ قُلۡ مَا يَكُونُ لِيٓ أَنۡ أُبَدِّلَهُۥ مِن تِلۡقَآيِٕ نَفۡسِيٓۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّۖ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ ٥١\n                                    \n                                    \n                                    يخبر تعالى عن تعنت الكفار من مشركي قريش الجاحدين الحق المعرضين عنه ، أنهم إذا قرأ عليهم الرسول صلى الله عليه وسلم كتاب الله وحججه الواضحة قالوا له : ( ائت بقرآن غير هذا ) أي : رد هذا وجئنا بغيره من نمط آخر ، أو بدله إلى وضع آخر ، قال الله لنبيه ، صلوات الله وسلامه عليه ، ( قل ما يكون لي أن أبدله من تلقاء نفسي ) أي : ليس هذا إلي ، إنما أنا عبد مأمور ، ورسول مبلغ عن الله ، ( إن أتبع إلا ما يوحى إلي إني أخاف إن عصيت ربي عذاب يوم عظيم )\n                                    ",
        "qortoby": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَاتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا ٱئۡتِ بِقُرۡءَانٍ غَيۡرِ هَٰذَآ أَوۡ بَدِّلۡهُۚ قُلۡ مَا يَكُونُ لِيٓ أَنۡ أُبَدِّلَهُۥ مِن تِلۡقَآيِٕ نَفۡسِيٓۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّۖ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ ٥١\n                                    \n                                    \n                                    قوله تعالى وإذا تتلى عليهم آياتنا بينات قال الذين لا يرجون لقاءنا ائت بقرآن غير هذا أو بدله قل ما يكون لي أن أبدله من تلقاء نفسي إن أتبع إلا ما يوحى إلي إني أخاف إن عصيت ربي عذاب يوم عظيم\nقوله تعالى وإذا تتلى عليهم آياتنا تتلى تقرأ ، وبينات نصب على الحال ; أي واضحات لا لبس فيها ولا إشكال .\nقال الذين لا يرجون لقاءنا يعني لا يخافون يوم البعث والحساب ولا يرجون الثواب . قال قتادة : يعني مشركي أهل مكة .\nائت بقرآن غير هذا أو بدله والفرق بين تبديله والإتيان بغيره أن تبديله لا يجوز أن يكون معه ، والإتيان بغيره قد يجوز أن يكون معه ; وفي قولهم ذلك ثلاثة أوجه :\nأحدها : أنهم سألوه أن يحول الوعد وعيدا والوعيد وعدا ، والحلال حراما والحرام حلالا ; قاله ابن جرير الطبري .\nالثاني : سألوه أن يسقط ما في القرآن من عيب آلهتهم وتسفيه أحلامهم ; قاله ابن عيسى .\nالثالث : أنهم سألوه إسقاط ما فيه من ذكر البعث والنشور ; قاله الزجاج .\nالثانية : قوله تعالى قل ما يكون لي أي قل يا محمد ما كان لي أن أبدله من تلقاء نفسي ومن عندي ، كما ليس لي أن ألقاه بالرد والتكذيب .\nإن أتبع إلا ما يوحى إلي أي لا أتبع إلا ما أتلوه عليكم من وعد ووعيد ، وتحريم وتحليل ، وأمر ونهي . وقد يستدل بهذا من يمنعنسخ الكتاب بالسنة ; لأنه تعالى قال : قل ما يكون لي أن أبدله من تلقاء نفسي وهذا فيه بعد ; فإن الآية وردت في طلب المشركين مثل القرآن نظما ، ولم يكن الرسول صلى الله عليه وسلم قادرا على ذلك ، ولم يسألوه تبديل الحكم دون اللفظ ; ولأن الذي يقوله الرسول صلى الله عليه وسلم إذا كان وحيا لم يكن من تلقاء نفسه ، بل كان من عند الله تعالى .\nالثالثة : قوله تعالى إني أخاف إن عصيت ربي أي إن خالفت في تبديله وتغييره أو في ترك العمل به .\nعذاب يوم عظيم يعني يوم القيامة .\n                                    ",
        "saadi": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَاتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا ٱئۡتِ بِقُرۡءَانٍ غَيۡرِ هَٰذَآ أَوۡ بَدِّلۡهُۚ قُلۡ مَا يَكُونُ لِيٓ أَنۡ أُبَدِّلَهُۥ مِن تِلۡقَآيِٕ نَفۡسِيٓۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّۖ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ ٥١\n                                        \n                                        \n                                        \n                                        يذكر تعالى تعنت المكذبين لرسوله محمد ـ صلى الله عليه وسلم ـ وأنهم إذا تتلى عليهم آيات الله القرآنية المبينة للحق، أعرضوا عنها، وطلبوا وجوه التعنت فقالوا، جراءة منهم وظلما‏:‏ ‏{‏ائْتِ بِقُرْآنٍ غَيْرِ هَذَا أَوْ بَدِّلْهُ‏}‏ فقبحهم الله، ما أجرأهم على الله، وأشدهم ظلما وردا لآياته‏.‏\nفإذا كان الرسول العظيم يأمره الله، أن يقول لهم‏:‏ ‏{‏قُلْ مَا يَكُونُ لِي‏}‏ أي‏:‏ ما ينبغي ولا يليق ‏{‏أَنْ أُبَدِّلَهُ مِنْ تِلْقَاءِ نَفْسِي‏}‏ فإني رسول محض، ليس لي من الأمر شيء، ‏{‏إِنْ أَتَّبِعُ إِلَّا مَا يُوحَى إِلَيَّ‏}‏ أي‏:‏ ليس لي غير ذلك، فإني عبد مأمور، ‏{‏إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ‏}‏ فهذا قول خير الخلق وأدبه مع أوامر ربه ووحيه، فكيف بهؤلاء السفهاء الضالين، الذين جمعوا بين الجهل والضلال، والظلم والعناد، والتعنت والتعجيز لرب العالمين، أفلا يخافون عذاب يوم عظيم‏؟‏‏\"‏‏.‏\n                                    "
      },
      "originalText": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَاتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا ٱئۡتِ بِقُرۡءَانٍ غَيۡرِ هَٰذَآ أَوۡ بَدِّلۡهُۚ قُلۡ مَا يَكُونُ لِيٓ أَنۡ أُبَدِّلَهُۥ مِن تِلۡقَآيِٕ نَفۡسِيٓۖ إِنۡ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَيَّۖ إِنِّيٓ أَخَافُ إِنۡ عَصَيۡتُ رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ ٥١"
    },
    {
      "number": 1380,
      "text": "قُلْ لَوْ شَاءَ اللَّهُ مَا تَلَوْتُهُ عَلَيْكُمْ وَلَا أَدْرَاكُمْ بِهِ ۖ فَقَدْ لَبِثْتُ فِيكُمْ عُمُرًا مِنْ قَبْلِهِ ۚ أَفَلَا تَعْقِلُونَ",
      "surah": {
        "number": 10,
        "name": "سورة يونس",
        "englishName": "Yunus",
        "englishNameTranslation": "Jonas",
        "revelationType": "Meccan",
        "numberOfAyahs": 109
      },
      "numberInSurah": 16,
      "juz": 11,
      "manzil": 3,
      "page": 210,
      "ruku": 173,
      "hizbQuarter": 84,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُل لَّوۡ شَآءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَيۡكُمۡ وَلَآ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِيكُمۡ عُمُرٗا مِّن قَبۡلِهِۦٓۚ أَفَلَا تَعۡقِلُونَ ٦١\n                                    \n                                    \n                                    ثم قال محتجا عليهم في صحة ما جاءهم به : ( قل لو شاء الله ما تلوته عليكم ولا أدراكم به ) أي : هذا إنما جئتكم به عن إذن الله لي في ذلك ومشيئته وإرادته ، والدليل على أني لست أتقوله من عندي ولا افتريته أنكم عاجزون عن معارضته ، وأنكم تعلمون صدقي وأمانتي منذ نشأت بينكم إلى حين بعثني الله عز وجل ، لا تنتقدون علي شيئا تغمصوني به ؛ ولهذا قال : ( فقد لبثت فيكم عمرا من قبله أفلا تعقلون ) أي : أفليس لكم عقول تعرفون بها الحق من الباطل ؛ ولهذا لما سأل هرقل ملك الروم أبا سفيان ومن معه ، فيما سأله من صفة النبي صلى الله عليه وسلم ، قال : هل كنتم تتهمونه بالكذب قبل أن يقول ما قال ؟ قال أبو سفيان : فقلت : لا - وقد كان أبو سفيان إذ ذاك رأس الكفرة وزعيم المشركين ، ومع هذا اعترف بالحق :\nوالفضل ما شهدت به الأعداء\nفقال له هرقل : فقد أعرف أنه لم يكن ليدع الكذب على الناس ثم يذهب فيكذب على الله . !\nوقال جعفر بن أبي طالب للنجاشي ملك الحبشة : بعث الله فينا رسولا نعرف نسبه وصدقه وأمانته ، وقد كانت مدة مقامه ، عليه السلام ، بين أظهرنا قبل النبوة أربعين سنة . وعن سعيد بن المسيب : ثلاثا وأربعين سنة . والصحيح المشهور الأول .\n                                    ",
        "qortoby": "قُل لَّوۡ شَآءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَيۡكُمۡ وَلَآ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِيكُمۡ عُمُرٗا مِّن قَبۡلِهِۦٓۚ أَفَلَا تَعۡقِلُونَ ٦١\n                                    \n                                    \n                                    قوله تعالى قل لو شاء الله ما تلوته عليكم ولا أدراكم به فقد لبثت فيكم عمرا من قبله أفلا تعقلون\nقوله تعالى قل لو شاء الله ما تلوته عليكم ولا أدراكم به أي لو شاء الله ما أرسلني إليكم فتلوت عليكم القرآن ، ولا أعلمكم الله ولا أخبركم به ; يقال : دريت الشيء وأدراني الله به ، ودريته ودريت به . وفي الدراية معنى الختل ; ومنه دريت الرجل أي ختلته ، ولهذا لا يطلق الداري في حق الله تعالى وأيضا عدم فيه التوقيف . وقرأ ابن كثير : \" ولأدراكم به \" بغير ألف بين اللام والهمزة ; والمعنى : لو شاء الله لأعلمكم به من غير أن أتلوه عليكم ; فهي لام التأكيد دخلت على ألف أفعل . وقرأ ابن عباس والحسن \" ولا أدراتكم به \" بتحويل الياء ألفا ، على لغة بني عقيل ; قال الشاعر :\nلعمرك ما أخشى التصعلك ما بقى على الأرض قيسي يسوق الأباعرا\nوقال آخر :\nألا آذنت أهل اليمامة طيئ بحرب كناصات الأغر المشهر\nقال أبو حاتم : سمعت الأصمعي يقول سألت أبا عمرو بن العلاء : هل لقراءة الحسن \" ولا أدراتكم به \" وجه ؟ فقال لا . وقال أبو عبيد : لا وجه لقراءة الحسن \" ولا أدراتكم به \" إلا الغلط . قال النحاس : معنى قول أبي عبيد : لا وجه ، إن شاء الله على الغلط ; لأنه يقال : دريت أي علمت ، وأدريت غيري ، ويقال : درأت أي دفعت ; فيقع الغلط بين دريت ودرأت . قال أبو حاتم : يريد الحسن فيما أحسب \" ولا أدريتكم به \" فأبدل من الياء ألفا على لغة بني الحارث بن كعب ، يبدلون من الياء ألفا إذا انفتح ما قبلها ; مثل : إن هذان لساحران . قال المهدوي : ومن قرأ \" أدرأتكم \" فوجهه أن أصل الهمزة ياء ، فأصله \" أدريتكم \" فقلبت الياء ألفا وإن كانت ساكنة ; كما قال : يايس في ييس وطايئ في طيئ ، ثم قلبت الألف همزة على لغة من قال في العالم العألم وفي الخاتم الخأتم . قال النحاس : وهذا غلط ، والرواية عن الحسن \" ولا أدرأتكم \" بالهمزة ، وأبو حاتم وغيره تكلم أنه بغير همز ، ويجوز أن يكون من درأت أي دفعت ; أي ولا أمرتكم أن تدفعوا فتتركوا الكفر بالقرآن .\nقوله تعالى فقد لبثت فيكم عمرا ظرف ، أي مقدارا من الزمان وهو أربعون سنة . من قبله أي من قبل القرآن ، تعرفونني بالصدق والأمانة ، لا أقرأ ولا أكتب ، ثم جئتكم بالمعجزات .\nأفلا تعقلون أن هذا لا يكون إلا من عند الله لا من قبلي .\nوقيل : معنى لبثت فيكم عمرا أي لبثت فيكم مدة شبابي لم أعص الله ، أفتريدون مني الآن وقد بلغت أربعين سنة أن أخالف أمر الله ، وأغير ما ينزله علي . قال قتادة : لبث فيهم أربعين سنة ، وأقام سنتين يرى رؤيا الأنبياء ، وتوفي صلى الله عليه وسلم وهو ابن اثنتين وستين سنة .\n                                    ",
        "saadi": "قُل لَّوۡ شَآءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَيۡكُمۡ وَلَآ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِيكُمۡ عُمُرٗا مِّن قَبۡلِهِۦٓۚ أَفَلَا تَعۡقِلُونَ ٦١\n                                        \n                                        \n                                        \n                                        فإن زعموا أن قصدهم أن يتبين لهم الحق بالآيات التي طلبوا فهم كذبة في ذلك، فإن الله قد بين من الآيات ما يؤمن على مثله البشر، وهو الذي يصرفها كيف يشاء، تابعا لحكمته الربانية، ورحمته بعباده‏.‏\n‏{‏قُلْ لَوْ شَاءَ اللَّهُ مَا تَلَوْتُهُ عَلَيْكُمْ وَلَا أَدْرَاكُمْ بِهِ فَقَدْ لَبِثْتُ فِيكُمْ عُمُرًا‏}‏ طويلا ‏{‏مِنْ قَبْلِهِ‏}‏ أي‏:‏ قبل تلاوته، وقبل درايتكم به، وأنا ما خطر على بالي، ولا وقع في ظني‏.‏\n‏{‏أَفَلَا تَعْقِلُونَ‏}‏ أني حيث لم أتقوله في مدة عمري، ولا صدر مني ما يدل على ذلك، فكيف أتقوله بعد ذلك، وقد لبثت فيكم عمرا طويلا تعرفون حقيقة حالي، بأني أمي لا أقرأ ولا أكتب، ولا أدرس ولا أتعلم من أحد‏؟‏‏\"‏\nفأتيتكم بكتاب عظيم أعجز الفصحاء، وأعيا العلماء، فهل يمكن ـ مع هذا ـ أن يكون من تلقاء نفسي، أم هذا دليل قاطع أنه تنزيل من حكيم حميد‏؟‏\nفلو أعملتم أفكاركم وعقولكم، وتدبرتم حالي وحال هذا الكتاب، لجزمتم جزما لا يقبل الريب بصدقه، وأنه الحق الذي ليس بعده إلا الضلال، ولكن إذ أبيتم إلا التكذيب والعناد، فأنتم لا شك أنكم ظالمون‏.‏\n‏{‏فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ‏}‏ ‏؟‏‏!‏‏!‏\n                                    "
      },
      "originalText": "قُل لَّوۡ شَآءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَيۡكُمۡ وَلَآ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِيكُمۡ عُمُرٗا مِّن قَبۡلِهِۦٓۚ أَفَلَا تَعۡقِلُونَ ٦١"
    },
    {
      "number": 1381,
      "text": "فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ ۚ إِنَّهُ لَا يُفْلِحُ الْمُجْرِمُونَ",
      "surah": {
        "number": 10,
        "name": "سورة يونس",
        "englishName": "Yunus",
        "englishNameTranslation": "Jonas",
        "revelationType": "Meccan",
        "numberOfAyahs": 109
      },
      "numberInSurah": 17,
      "juz": 11,
      "manzil": 3,
      "page": 210,
      "ruku": 173,
      "hizbQuarter": 84,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِ‍َٔايَٰتِهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلۡمُجۡرِمُونَ ٧١\n                                    \n                                    \n                                    يقول تعالى : لا أحد أظلم ولا أعتى ولا أشد إجراما ( ممن افترى على الله كذبا ) وتقول على الله ، وزعم أن الله أرسله ، ولم يكن كذلك ، فليس أحد أكبر جرما ولا أعظم ظلما من هذا ، ومثل هذا لا يخفى أمره على الأغبياء ، فكيف يشتبه حال هذا بالأنبياء ! فإن من قال هذه المقالة صادقا أو كاذبا ، فلا بد أن الله ينصب عليه من الأدلة على بره أو فجوره ما وأظهر من الشمس ، فإن الفرق بين محمد صلى الله عليه وسلم وبين مسيلمة الكذاب [ لعنه الله ] لمن شاهدهما أظهر من الفرق بين وقت الضحى ووقت نصف الليل في حندس الظلماء ، فمن سيما كل منهما وكلامه وفعاله يستدل من له بصيرة على صدق محمد صلى الله عليه وسلم وكذب مسيلمة الكذاب ، وسجاح ، والأسود العنسي .\nقال عبد الله بن سلام : لما قدم رسول الله صلى الله عليه وسلم المدينة انجفل الناس ، فكنت فيمن انجفل ، فلما رأيته عرفت أن وجهه ليس بوجه رجل كذاب ، فكان أول ما سمعته يقول : \" يا أيها الناس أفشوا السلام ، وأطعموا الطعام ، [ وصلوا الأرحام ] وصلوا بالليل والناس نيام ، تدخلون الجنة بسلام \" .\nولما قدم ضمام بن ثعلبة على رسول الله صلى الله عليه وسلم في قومه بني سعد بن بكر قال لرسول الله فيما قال له من رفع هذه السماء ؟ قال : \" الله \" . قال : ومن نصب هذه الجبال ؟ قال : \" الله \" . قال : ومن سطح هذه الأرض ؟ قال : \" الله \" . قال : فبالذي رفع هذه السماء ، ونصب هذه الجبال ، وسطح هذه الأرض : الله أرسلك إلى الناس كلهم ؟ قال : \" اللهم نعم \" ثم سأله عن الصلاة ، والزكاة ، والحج ، والصيام ، ويحلف عند كل واحدة هذه اليمين ، ويحلف رسول الله صلى الله عليه وسلم ، فقال له : صدقت ، والذي بعثك بالحق لا أزيد على ذلك ولا أنقص .\nفاكتفى هذا الرجل بمجرد هذا ، وقد أيقن بصدقه ، صلوات الله وسلامه عليه ، بما رأى وشاهد من الدلائل الدالة عليه ، كما قال حسان بن ثابت :\nلو لم تكن فيه آيات مبينة كانت بديهته تأتيك بالخبر\nوأما مسيلمة فمن شاهده من ذوي البصائر ، علم أمره لا محالة ، بأقواله الركيكة التي ليست بفصيحة ، وأفعاله غير الحسنة بل القبيحة ، وقرآنه الذي يخلد به في النار يوم الحسرة والفضيحة ، وكم من فرق بين قوله تعالى : ( الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يئوده حفظهما وهو العلي العظيم ) [ البقرة : 255 ] . وبين علاك مسيلمة قبحه الله ولعنه : \" يا ضفدع بنت الضفدعين ، نقي كما تنقين لا الماء تكدرين ، ولا الشارب تمنعين \" . وقوله - قبح ولعن - : \" لقد أنعم الله على الحبلى ، إذ أخرج منها نسمة تسعى ، من بين صفاق وحشى \" . وقوله - خدره الله في نار جهنم ، وقد فعل - : \" الفيل وما أدراك ما الفيل ؟ له زلقوم طويل \" وقوله - أبعده الله من رحمته : \" والعاجنات عجنا ، والخابزات خبزا ، واللاقمات لقما ، إهالة وسمنا ، إن قريشا قوم يعتدون \" إلى غير ذلك من الهذيانات والخرافات التي يأنف الصبيان أن يتلفظوا بها ، إلا على وجه السخرية والاستهزاء ؛ ولهذا أرغم الله أنفه ، وشرب يوم \" حديقة الموت \" حتفه . ومزق شمله . ولعنه صحبه وأهله . وقدموا على الصديق تائبين ، وجاءوا في دين الله راغبين ، فسألهم الصديق خليفة الرسول ، صلوات الله وسلامه عليه ، ورضي [ الله ] عنه - أن يقرءوا عليه شيئا من قرآن مسيلمة لعنه الله ، فسألوه أن يعفيهم من ذلك ، فأبى عليهم إلا أن يقرءوا شيئا منه ليسمعه من لم يسمعه من الناس ، فيعرفوا فضل ما هم عليه من الهدى والعلم . فقرءوا عليه من هذا الذي ذكرناه وأشباهه ، فلما فرغوا قال لهم الصديق ، رضي الله عنه : ويحكم ! أين كان يذهب بعقولكم ؟ والله إن هذا لم يخرج من إل .\nوذكروا أن وفد عمرو بن العاص على مسيلمة ، وكان صديقا له في الجاهلية ، وكان عمرو لم يسلم بعد ، فقال له مسيلمة : ويحك يا عمرو ، ماذا أنزل على صاحبكم - يعني : رسول الله صلى الله عليه وسلم - في هذه المدة ؟ فقال : لقد سمعت أصحابه يقرءون سورة عظيمة قصيرة فقال : وما هي ؟ فقال : ( والعصر إن الإنسان لفي خسر إلا الذين آمنوا وعملوا الصالحات وتواصوا بالحق وتواصوا بالصبر ) [ سورة العصر ] ، ففكر مسيلمة ساعة ، ثم قال : وقد أنزل علي مثله . فقال : وما هو ؟ فقال : \" يا وبر إنما أنت أذنان وصدر ، وسائرك حقر نقر ، كيف ترى يا عمرو ؟ \" فقال له عمرو : والله إنك لتعلم أني أعلم أنك لتكذب \" ، فإذا كان هذا من مشرك في حال شركه ، لم يشتبه عليه حال محمد صلى الله عليه وسلم وصدقه ، وحال مسيلمة - لعنه الله - وكذبه ، فكيف بأولي البصائر والنهى ، وأصحاب العقول السليمة المستقيمة والحجى ! ولهذا قال الله تعالى : ( ومن أظلم ممن افترى على الله كذبا أو قال أوحي إلي ولم يوح إليه شيء ومن قال سأنزل مثل ما أنزل الله ) [ الأنعام : 93 ] ، وقال في هذه الآية الكريمة : ( ومن أظلم ممن افترى على الله كذبا أو كذب بآياته إنه لا يفلح الظالمون ) [ الأنعام : 21 ] ، وكذلك من كذب بالحق الذي جاءت به الرسل ، وقامت عليه الحجج ، لا أحد أظلم منه كما جاء في الحديث : \" أعتى الناس على الله رجل قتل نبيا ، أو قتله نبي \" .\n                                    ",
        "qortoby": "فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِ‍َٔايَٰتِهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلۡمُجۡرِمُونَ ٧١\n                                    \n                                    \n                                    قوله تعالى فمن أظلم ممن افترى على الله كذبا أو كذب بآياته إنه لا يفلح المجرمون\nهذا استفهام بمعنى الجحد ; أي لا أحد أظلم ممن افترى على الله الكذب ، وبدل كلامه وأضاف شيئا إليه مما لم ينزله . وكذلك لا أحد أظلم منكم إذا أنكرتم القرآن وافتريتم على الله الكذب ، وقلتم ليس هذا كلامه . وهذا مما أمر به الرسول صلى الله عليه وسلم أن يقول لهم . وقيل : هو من قول الله ابتداء . وقيل : المفتري المشرك ، والمكذب بالآيات أهل الكتاب . إنه لا يفلح المجرمون .\n                                    ",
        "saadi": "فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِ‍َٔايَٰتِهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلۡمُجۡرِمُونَ ٧١\n                                        \n                                        \n                                        \n                                        فلو كنت متقولا لكنت أظلم الناس، وفاتني الفلاح، ولم تخف عليكم حالي، ولكني جئتكم بآيات الله، فكذبتم بها، فتعين فيكم الظلم، ولا بد أن أمركم سيضمحل، ولن تنالوا الفلاح، ما دمتم كذلك‏.‏\nودل قوله‏:‏ ‏{‏قَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا‏}‏ الآية، أن الذي حملهم على هذا التعنت الذي صدر منهم هو عدم إيمانهم بلقاء الله وعدم رجائه، وأن من آمن بلقاء الله فلا بد أن ينقاد لهذا الكتاب ويؤمن به، لأنه حسن القصد‏.‏\n                                    "
      },
      "originalText": "فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِ‍َٔايَٰتِهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلۡمُجۡرِمُونَ ٧١"
    },
    {
      "number": 1382,
      "text": "وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنْفَعُهُمْ وَيَقُولُونَ هَٰؤُلَاءِ شُفَعَاؤُنَا عِنْدَ اللَّهِ ۚ قُلْ أَتُنَبِّئُونَ اللَّهَ بِمَا لَا يَعْلَمُ فِي السَّمَاوَاتِ وَلَا فِي الْأَرْضِ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ",
      "surah": {
        "number": 10,
        "name": "سورة يونس",
        "englishName": "Yunus",
        "englishNameTranslation": "Jonas",
        "revelationType": "Meccan",
        "numberOfAyahs": 109
      },
      "numberInSurah": 18,
      "juz": 11,
      "manzil": 3,
      "page": 210,
      "ruku": 173,
      "hizbQuarter": 84,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡ وَيَقُولُونَ هَٰٓؤُلَآءِ شُفَعَٰٓؤُنَا عِندَ ٱللَّهِۚ قُلۡ أَتُنَبِّ‍ُٔونَ ٱللَّهَ بِمَا لَا يَعۡلَمُ فِي ٱلسَّمَٰوَٰتِ وَلَا فِي ٱلۡأَرۡضِۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ ٨١\n                                    \n                                    \n                                    ينكر تعالى على المشركين الذين عبدوا مع الله غيره ، ظانين أن تلك الآلهة تنفعهم شفاعتها عند الله ، فأخبر تعالى أنها لا تنفع ولا تضر ولا تملك شيئا ، ولا يقع شيء مما يزعمون فيها ، ولا يكون هذا أبدا ؛ ولهذا قال تعالى : ( قل أتنبئون الله بما لا يعلم في السماوات ولا في الأرض ) .\nوقال ابن جرير : معناه أتخبرون الله بما لا يكون في السماوات ولا في الأرض ؟ ثم نزه نفسه عن شركهم وكفرهم ، فقال : ( سبحانه وتعالى عما يشركون ) .\n                                    ",
        "qortoby": "وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡ وَيَقُولُونَ هَٰٓؤُلَآءِ شُفَعَٰٓؤُنَا عِندَ ٱللَّهِۚ قُلۡ أَتُنَبِّ‍ُٔونَ ٱللَّهَ بِمَا لَا يَعۡلَمُ فِي ٱلسَّمَٰوَٰتِ وَلَا فِي ٱلۡأَرۡضِۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ ٨١\n                                    \n                                    \n                                    قوله تعالى ويعبدون من دون الله ما لا يضرهم ولا ينفعهم ويقولون هؤلاء شفعاؤنا عند الله قل أتنبئون الله بما لا يعلم في السماوات ولا في الأرض سبحانه وتعالى عما يشركون\nقوله تعالى ويعبدون من دون الله ما لا يضرهم ولا ينفعهم يريد الأصنام .\nويقولون هؤلاء شفعاؤنا عند الله وهذه غاية الجهالة منهم ; حيث ينتظرون الشفاعة في المآل ممن لا يوجد منه نفع ولا ضر في الحال . وقيل : شفعاؤنا أي تشفع لنا عند الله في إصلاح معائشنا في الدنيا .\nقل أتنبئون الله بما لا يعلم في السماوات ولا في الأرض قراءة العامة \" تنبئون \" بالتشديد . وقرأ أبو السمال العدوي \" أتنبئون الله \" مخففا ، من أنبأ ينبئ . وقراءة العامة من نبأ ينبئ تنبئة ; وهما بمعنى واحد ، جمعهما قوله تعالى : من أنبأك هذا قال نبأني العليم الخبير أي أتخبرون الله أن له شريكا في ملكه أو شفيعا بغير إذنه ، والله لا يعلم لنفسه شريكا في السماوات ولا في الأرض ; لأنه لا شريك له فلذلك لا يعلمه . نظيره قوله : أم تنبئونه بما لا يعلم في الأرض\nثم نزه نفسه وقدسها عن الشرك فقال : سبحانه وتعالى عما يشركون أي هو أعظم من أن يكون له شريك وقيل : المعنى أي يعبدون ما لا يسمع ولا يبصر ولا يميز ويقولون هؤلاء شفعاؤنا عند الله فيكذبون ; وهل يتهيأ لكم أن تنبئوه بما لا يعلم ، سبحانه وتعالى عما يشركون! . وقرأ حمزة والكسائي تشركون بالتاء ، وهو اختيار أبي عبيد . الباقون بالياء .\n                                    ",
        "saadi": "وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡ وَيَقُولُونَ هَٰٓؤُلَآءِ شُفَعَٰٓؤُنَا عِندَ ٱللَّهِۚ قُلۡ أَتُنَبِّ‍ُٔونَ ٱللَّهَ بِمَا لَا يَعۡلَمُ فِي ٱلسَّمَٰوَٰتِ وَلَا فِي ٱلۡأَرۡضِۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ ٨١\n                                        \n                                        \n                                        \n                                        يقول تعالى‏:‏ ‏{‏وَيَعْبُدُونَ‏}‏ أي‏:‏ المشركون المكذبون لرسول الله ـ صلى الله عليه وسلم ـ ‏.‏\n‏{‏مِنْ دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنْفَعُهُمْ‏}‏ أي‏:‏ لا تملك لهم مثقال ذرة من النفع ولا تدفع عنهم شيئا‏.‏\n‏{‏وَيَقُولُونَ‏}‏ قولا خاليا من البرهان‏:‏ ‏{‏هَؤُلَاءِ شُفَعَاؤُنَا عِنْدَ اللَّهِ‏}‏ أي‏:‏ يعبدونهم ليقربوهم إلى الله، ويشفعوا لهم عنده، وهذا قول من تلقاء أنفسهم، وكلام ابتكروه هم، ولهذا قال تعالى ـ مبطلا لهذا القول ـ ‏:‏ ‏{‏قُلْ أَتُنَبِّئُونَ اللَّهَ بِمَا لَا يَعْلَمُ فِي السموات وَلَا فِي الْأَرْضِ‏}‏ أي‏:‏ الله تعالى هو العالم، الذي أحاط علما بجميع ما في السماوات والأرض، وقد أخبركم بأنه ليس له شريك ولا إله معه، أفأنتم ـ يا معشر المشركين ـ تزعمون أنه يوجد له فيها شركاء‏؟‏ أفتخبرونه بأمر خفي عليه، وعلمتوه‏؟‏ أأنتم أعلم أم الله‏؟‏ فهل يوجد قول أبطل من هذا القول، المتضمن أن هؤلاء الضلال الجهال السفهاء أعلم من رب العالمين‏؟‏ فليكتف العاقل بمجرد تصور هذا القول، فإنه يجزم بفساده وبطلانه‏:‏ ‏{‏سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ‏}‏ أي‏:‏ تقدس وتنزه أن يكون له شريك أو نظير، بل هو الله الأحد الفرد الصمد الذي لا إله في السماوات والأرض إلا هو، وكل معبود في العالم العلوي والسفلي سواه، فإنه باطل عقلا وشرعا وفطرة‏.‏\n‏{‏ذَلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ هُوَ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ‏}‏\n                                    "
      },
      "originalText": "وَيَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡ وَيَقُولُونَ هَٰٓؤُلَآءِ شُفَعَٰٓؤُنَا عِندَ ٱللَّهِۚ قُلۡ أَتُنَبِّ‍ُٔونَ ٱللَّهَ بِمَا لَا يَعۡلَمُ فِي ٱلسَّمَٰوَٰتِ وَلَا فِي ٱلۡأَرۡضِۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ ٨١"
    },
    {
      "number": 1383,
      "text": "وَمَا كَانَ النَّاسُ إِلَّا أُمَّةً وَاحِدَةً فَاخْتَلَفُوا ۚ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ لَقُضِيَ بَيْنَهُمْ فِيمَا فِيهِ يَخْتَلِفُونَ",
      "surah": {
        "number": 10,
        "name": "سورة يونس",
        "englishName": "Yunus",
        "englishNameTranslation": "Jonas",
        "revelationType": "Meccan",
        "numberOfAyahs": 109
      },
      "numberInSurah": 19,
      "juz": 11,
      "manzil": 3,
      "page": 210,
      "ruku": 173,
      "hizbQuarter": 84,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كَانَ ٱلنَّاسُ إِلَّآ أُمَّةٗ وَٰحِدَةٗ فَٱخۡتَلَفُواْۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡ فِيمَا فِيهِ يَخۡتَلِفُونَ ٩١\n                                    \n                                    \n                                    ثم أخبر تعالى أن هذا الشرك حادث في الناس ، كائن بعد أن لم يكن ، وأن الناس كلهم كانوا على دين واحد ، وهو الإسلام ؛ قال ابن عباس : كان بين آدم ونوح عشرة قرون ، كلهم على الإسلام ، ثم وقع الاختلاف بين الناس ، وعبدت الأصنام والأنداد والأوثان ، فبعث الله الرسل بآياته وبيناته وحججه البالغة وبراهينه الدامغة ، ( ليهلك من هلك عن بينة ويحيا من حي عن بينة ) [ الأنفال : 42 ] .\nوقوله : ( ولولا كلمة سبقت من ربك لقضي بينهم فيما فيه يختلفون ) أي : لولا ما تقدم من الله تعالى أنه لا يعذب أحدا إلا بعد قيام الحجة عليه ؛ وأنه قد أجل الخلق إلى أجل معدود لقضى بينهم فيما فيه اختلفوا ، فأسعد المؤمنين ، وأعنت الكافرين .\n                                    ",
        "qortoby": "وَمَا كَانَ ٱلنَّاسُ إِلَّآ أُمَّةٗ وَٰحِدَةٗ فَٱخۡتَلَفُواْۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡ فِيمَا فِيهِ يَخۡتَلِفُونَ ٩١\n                                    \n                                    \n                                    قوله تعالى وما كان الناس إلا أمة واحدة فاختلفوا ولولا كلمة سبقت من ربك لقضي بينهم فيما فيه يختلفون تقدم في \" البقرة \" معناه فلا معنى للإعادة . وقال الزجاج : هم العرب كانوا على الشرك . وقيل : كل مولود يولد على الفطرة ، فاختلفوا عند البلوغ . ولولا كلمة سبقت من ربك لقضي بينهم فيما فيه يختلفون إشارة إلى القضاء والقدر ; أي لولا ما سبق في حكمه أنه لا يقضي بينهم فيما اختلفوا فيه بالثواب والعقاب دون القيامة لقضي بينهم في الدنيا ، فأدخل المؤمنين الجنة بأعمالهم والكافرين النار بكفرهم ، ولكنه سبق من الله الأجل مع علمه بصنيعهم فجعل موعدهم القيامة ; قاله الحسن . وقال أبو روق : لقضي بينهم لأقام عليهم الساعة . وقيل : لفرغ من هلاكهم . وقال الكلبي : \" الكلمة \" أن الله أخر هذه الأمة فلا يهلكهم بالعذاب في الدنيا إلى يوم القيامة ، فلولا هذا التأخير لقضي بينهم بنزول العذاب أو بإقامة الساعة . والآية تسلية للنبي صلى الله عليه وسلم في تأخير العذاب عمن كفر به . وقيل : الكلمة السابقة أنه لا يأخذ أحدا إلا بحجة وهو إرسال الرسل ; كما قال : وما كنا معذبين حتى نبعث رسولا وقيل : الكلمة قوله : سبقت رحمتي غضبي ولولا ذلك لما أخر العصاة إلى التوبة . وقرأ عيسى \" لقضى \" بالفتح .\n                                    ",
        "saadi": "وَمَا كَانَ ٱلنَّاسُ إِلَّآ أُمَّةٗ وَٰحِدَةٗ فَٱخۡتَلَفُواْۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡ فِيمَا فِيهِ يَخۡتَلِفُونَ ٩١\n                                        \n                                        \n                                        \n                                        أي‏:‏ ‏{‏وَمَا كَانَ النَّاسُ إِلَّا أُمَّةً وَاحِدَةً‏}‏ متفقين على الدين الصحيح، ولكنهم اختلفوا، فبعث الله الرسل مبشرين ومنذرين، وأنزل معهم الكتاب ليحكم بين الناس فيما اختلفوا فيه‏.‏\n‏{‏وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ‏}‏ بإمهال العاصين وعدم معاجلتهم بذنوبهم، ‏{‏لَقُضِيَ بَيْنَهُمْ‏}‏ بأن ننجي المؤمنين، ونهلك الكافرين المكذبين، وصار هذا فارقا بينهم ‏{‏فِيمَا فِيهِ يَخْتَلِفُونَ‏}‏ ولكنه أراد امتحانهم وابتلاء بعضهم ببعض، ليتبين الصادق من الكاذب‏.‏\n                                    "
      },
      "originalText": "وَمَا كَانَ ٱلنَّاسُ إِلَّآ أُمَّةٗ وَٰحِدَةٗ فَٱخۡتَلَفُواْۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡ فِيمَا فِيهِ يَخۡتَلِفُونَ ٩١"
    },
    {
      "number": 1384,
      "text": "وَيَقُولُونَ لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ ۖ فَقُلْ إِنَّمَا الْغَيْبُ لِلَّهِ فَانْتَظِرُوا إِنِّي مَعَكُمْ مِنَ الْمُنْتَظِرِينَ",
      "surah": {
        "number": 10,
        "name": "سورة يونس",
        "englishName": "Yunus",
        "englishNameTranslation": "Jonas",
        "revelationType": "Meccan",
        "numberOfAyahs": 109
      },
      "numberInSurah": 20,
      "juz": 11,
      "manzil": 3,
      "page": 210,
      "ruku": 173,
      "hizbQuarter": 84,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَقُولُونَ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَيۡبُ لِلَّهِ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ ٠٢\n                                    \n                                    \n                                    أي : ويقول هؤلاء الكفرة [ الملحدون ] المكذبون المعاندون : \" لولا أنزل على محمد آية من ربه \" ، يعنون كما أعطى الله ثمود الناقة ، أو أن يحول لهم الصفا ذهبا ، أو يزيح عنهم جبال مكة ويجعل مكانها بساتين وأنهارا ، ونحو ذلك مما الله عليه قادر ولكنه حكيم في أفعاله وأقواله ، كما قال تعالى : ( تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا ) [ الفرقان : 10 ، 11 ] وقال تعالى : ( وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا ) [ الإسراء : 59 ] ، يقول تعالى : إن سنتي في خلقي أني إذا آتيتهم ما سألوا ، فإن آمنوا وإلا عاجلتهم بالعقوبة . ولهذا لما خير رسول الله ، عليه الصلاة والسلام ، بين أن يعطى ما سألوا ، فإن أجابوا وإلا عوجلوا ، وبين أن يتركهم وينظرهم ، اختار إنظارهم ، كما حلم عنهم غير مرة ، صلوات الله عليه ؛ ولهذا قال تعالى إرشادا لنبيه إلى الجواب عما سألوا : ( فقل إنما الغيب لله ) أي : الأمر كله لله ، وهو يعلم العواقب في الأمور ، ( فانتظروا إني معكم من المنتظرين ) أي : إن كنتم لا تؤمنون حتى تشاهدوا ما سألتم فانتظروا حكم الله في وفيكم . هذا مع أنهم قد شاهدوا من معجزاته ، عليه السلام أعظم مما سألوا حين أشار بحضرتهم إلى القمر ليلة إبداره ، فانشق باثنتين فرقة من وراء الجبل ، وفرقة من دونه . وهذا أعظم من سائر الآيات الأرضية مما سألوا وما لم يسألوا ، ولو علم الله منهم أنهم سألوا ذلك استرشادا وتثبتا لأجابهم ، ولكن علم أنهم إنما يسألون عنادا وتعنتا ، فتركهم فيما رابهم ، وعلم أنهم لا يؤمن منهم أحد ، كما قال تعالى : ( إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم ) [ يونس : 96 ، 97 ] ، وقال تعالى : ( ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون ) [ الأنعام : 111 ] ، ولما فيهم من المكابرة ، كما قال تعالى : ( ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون لقالوا إنما سكرت أبصارنا بل نحن قوم مسحورون ) [ الحجر : 14 ، 15 ] ، وقال تعالى : ( وإن يروا كسفا من السماء ساقطا يقولوا سحاب مركوم ) [ الطور : 44 ] ، وقال تعالى : ( ولو نزلنا عليك كتابا في قرطاس فلمسوه بأيديهم لقال الذين كفروا إن هذا إلا سحر مبين ) [ الأنعام : 7 ] ، فمثل هؤلاء أقل من أن يجابوا إلى ما سألوه ؛ لأنه لا فائدة في جواب هؤلاء ؛ لأنه دائر على تعنتهم وعنادهم ، لكثرة فجورهم وفسادهم ؛ ولهذا قال : ( فانتظروا إني معكم من المنتظرين )\n                                    ",
        "qortoby": "وَيَقُولُونَ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَيۡبُ لِلَّهِ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ ٠٢\n                                    \n                                    \n                                    قوله تعالى ويقولون لولا أنزل عليه آية من ربه فقل إنما الغيب لله فانتظروا إني معكم من المنتظرين يريد أهل مكة ; أي هلا أنزل عليه آية ، أي معجزة غير هذه المعجزة ، فيجعل لنا الجبال ذهبا ويكون له بيت من زخرف ، ويحيي لنا من مات من آبائنا . وقال الضحاك : عصا كعصا موسى .\nفقل إنما الغيب لله أي قل يا محمد إن نزول الآية غيب . فانتظروا أي تربصوا . إني معكم من المنتظرين لنزولها . وقيل : انتظروا قضاء الله بيننا بإظهار المحق على المبطل .\n                                    ",
        "saadi": "وَيَقُولُونَ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَيۡبُ لِلَّهِ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ ٠٢\n                                        \n                                        \n                                        \n                                        {‏وَيَقُولُونَ‏}‏ أي‏:‏ المكذبون المتعنتون، ‏{‏لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ‏}‏ يعنون‏:‏ آيات الاقتراح التي يعينونها كقولهم‏:‏ ‏{‏لَوْلَا أُنْزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُ نَذِيرًا‏}‏ الآيات‏.‏\nوكقولهم‏:‏ ‏{‏وَقَالُوا لَنْ نُؤْمِنَ لَكَ حَتَّى تَفْجُرَ لَنَا مِنَ الْأَرْضِ يَنْبُوعًا‏}‏ الآيات‏.‏\n‏{‏فَقُلْ‏}‏ لهم إذا طلبوا منك آية ‏{‏إِنَّمَا الْغَيْبُ لِلَّهِ‏}‏ أي‏:‏ هو المحيط علما بأحوال العباد، فيدبرهم بما يقتضيه علمه فيهم وحكمته البديعة، وليس لأحد تدبير في حكم ولا دليل، ولا غاية ولا تعليل‏.‏\n‏{‏فَانْتَظِرُوا إِنِّي مَعَكُمْ مِنَ الْمُنْتَظِرِينَ‏}‏ أي‏:‏ كل ينتظر بصاحبه ما هو أهل له، فانظروا لمن تكون العاقبة‏.‏\n                                    "
      },
      "originalText": "وَيَقُولُونَ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَيۡبُ لِلَّهِ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ ٠٢"
    }
  ]
}