{
  "number": 22,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 149,
      "text": "۞ سَيَقُولُ السُّفَهَاءُ مِنَ النَّاسِ مَا وَلَّاهُمْ عَنْ قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا ۚ قُلْ لِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ ۚ يَهْدِي مَنْ يَشَاءُ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 142,
      "juz": 2,
      "manzil": 1,
      "page": 22,
      "ruku": 18,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمۡ عَن قِبۡلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيۡهَاۚ قُل لِّلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ يَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٢٤١\n                                    \n                                    \n                                    [ قيل المراد بالسفهاء هاهنا : المشركون ; مشركو العرب ، قاله الزجاج . وقيل : أحبار يهود ، قاله مجاهد . وقيل : المنافقون ، قاله السدي . والآية عامة في هؤلاء كلهم ، والله أعلم ] .\nقال البخاري : حدثنا أبو نعيم ، سمع زهيرا ، عن أبي إسحاق ، عن البراء ، رضي الله عنه ; أن النبي صلى الله عليه وسلم صلى إلى بيت المقدس ستة عشر شهرا أو سبعة عشر شهرا ، وكان يعجبه أن تكون قبلته قبل البيت ، وأنه صلى أول صلاة صلاها ، صلاة العصر ، وصلى معه قوم . فخرج رجل ممن كان صلى معه ، فمر على أهل المسجد وهم راكعون ، فقال : أشهد بالله لقد صليت مع النبي صلى الله عليه وسلم قبل مكة ، فداروا كما هم قبل البيت . وكان الذي مات على القبلة قبل أن تحول قبل البيت رجالا قتلوا لم ندر ما نقول فيهم ، فأنزل الله عز وجل ( وما كان الله ليضيع إيمانكم إن الله بالناس لرءوف رحيم )\nانفرد به البخاري من هذا الوجه . ورواه مسلم من وجه آخر .\nوقال محمد بن إسحاق : حدثني إسماعيل بن أبي خالد ، عن أبي إسحاق ، عن البراء ، قال : كان رسول الله صلى الله عليه وسلم يصلي نحو بيت المقدس ، ويكثر النظر إلى السماء ينتظر أمر الله ، فأنزل الله : ( قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام ) فقال رجال من المسلمين : وددنا لو علمنا علم من مات منا قبل أن نصرف إلى القبلة ، وكيف بصلاتنا نحو بيت المقدس ؟ فأنزل الله : ( وما كان الله ليضيع إيمانكم ) وقال السفهاء من الناس ، وهم أهل الكتاب : ما ولاهم عن قبلتهم التي كانوا عليها ؟ فأنزل الله : ( سيقول السفهاء من الناس ) إلى آخر الآية .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا الحسن بن عطية ، حدثنا إسرائيل ، عن أبي إسحاق ، عن البراء قال : كان رسول الله صلى الله عليه وسلم قد صلى نحو بيت المقدس ستة عشر أو سبعة عشر شهرا ، وكان يحب أن يوجه نحو الكعبة ، فأنزل الله : ( قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام ) قال : فوجه نحو الكعبة . وقال السفهاء من الناس ، وهم اليهود : ( ما ولاهم عن قبلتهم التي كانوا عليها ) فأنزل الله ( قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم )\nوقال علي بن أبي طلحة ، عن ابن عباس : إن رسول الله صلى الله عليه وسلم لما هاجر إلى المدينة ، أمره الله أن يستقبل بيت المقدس ، ففرحت اليهود ، فاستقبلها رسول الله صلى الله عليه وسلم بضعة عشر شهرا ، وكان رسول الله صلى الله عليه وسلم يحب قبلة إبراهيم ، فكان يدعو الله وينظر إلى السماء ، فأنزل الله عز وجل : ( فولوا وجوهكم شطره ) أي : نحوه . فارتاب من ذلك اليهود ، وقالوا : ما ولاهم عن قبلتهم التي كانوا عليها ؟ فأنزل الله : ( قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم ) .\nوقد جاء في هذا الباب أحاديث كثيرة ، وحاصل الأمر أنه قد كان رسول الله صلى الله عليه وسلم أمر باستقبال الصخرة من بيت المقدس ، فكان بمكة يصلي بين الركنين ، فتكون بين يديه الكعبة وهو مستقبل صخرة بيت المقدس ، فلما هاجر إلى المدينة تعذر الجمع بينهما ، فأمره الله بالتوجه إلى بيت المقدس ، قاله ابن عباس والجمهور ، ثم اختلف هؤلاء هل كان الأمر به بالقرآن أو بغيره ; على قولين ، وحكى القرطبي في تفسيره عن عكرمة وأبي العالية والحسن البصري أن التوجه إلى بيت المقدس كان باجتهاده عليه الصلاة والسلام . والمقصود أن التوجه إلى بيت المقدس بعد مقدمه صلى الله عليه وسلم المدينة ، فاستمر الأمر على ذلك بضعة عشر شهرا ، وكان يكثر الدعاء والابتهال أن يوجه إلى الكعبة ، التي هي قبلة إبراهيم ، عليه السلام ، فأجيب إلى ذلك ، وأمر بالتوجه إلى البيت العتيق ، فخطب رسول الله صلى الله عليه وسلم الناس ، وأعلمهم بذلك . وكان أول صلاة صلاها إليها صلاة العصر ، كما تقدم في الصحيحين من رواية البراء . ووقع عند النسائي من رواية أبي سعيد بن المعلى : أنها الظهر . وأما أهل قباء ، فلم يبلغهم الخبر إلى صلاة الفجر من اليوم الثاني ، كما جاء في الصحيحين ، عن ابن عمر أنه قال : بينما الناس بقباء في صلاة الصبح ، إذ جاءهم آت فقال : إن رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة قرآن وقد أمر أن يستقبل الكعبة ، فاستقبلوها . وكانت وجوههم إلى الشام فاستداروا إلى الكعبة .\nوفي هذا دليل على أن الناسخ لا يلزم حكمه إلا بعد العلم به ، وإن تقدم نزوله وإبلاغه ; لأنهم لم يؤمروا بإعادة العصر والمغرب والعشاء ، والله أعلم .\nولما وقع هذا حصل لبعض الناس من أهل النفاق والريب والكفرة من اليهود ارتياب وزيغ عن الهدى وتخبيط وشك ، وقالوا : ( ما ولاهم عن قبلتهم التي كانوا عليها ) أي : ما لهؤلاء تارة يستقبلون كذا ، وتارة يستقبلون كذا ؟ فأنزل الله جوابهم في قوله : ( قل لله المشرق والمغرب ) أي : الحكم والتصرف والأمر كله لله ، وحيثما تولوا فثم وجه الله ، و ( ليس البر أن تولوا وجوهكم قبل المشرق والمغرب ولكن البر من آمن بالله ) [ البقرة : 177 ] أي : الشأن كله في امتثال أوامر الله ، فحيثما وجهنا توجهنا ، فالطاعة في امتثال أمره ، ولو وجهنا في كل يوم مرات إلى جهات متعددة ، فنحن عبيده وفي تصريفه وخدامه ، حيثما وجهنا توجهنا ، وهو تعالى له بعبده ورسوله محمد صلوات الله وسلامه عليه وأمته عناية عظيمة ; إذ هداهم إلى قبلة إبراهيم ، خليل الرحمن ، وجعل توجههم إلى الكعبة المبنية على اسمه تعالى وحده لا شريك له ، أشرف بيوت الله في الأرض ، إذ هي بناء إبراهيم الخليل ، عليه السلام ، ولهذا قال : ( قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم ) .\nوقد روى الإمام أحمد ، عن علي بن عاصم ، عن حصين بن عبد الرحمن ، عن عمر بن قيس ، عن محمد بن الأشعث ، عن عائشة قالت : قال رسول الله صلى الله عليه وسلم يعني في أهل الكتاب : \" إنهم لا يحسدوننا على شيء كما يحسدوننا على يوم الجمعة ، التي هدانا الله لها وضلوا عنها ، وعلى القبلة التي هدانا الله لها وضلوا عنها ، وعلى قولنا خلف الإمام : آمين \" .\n                                    ",
        "qortoby": "سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمۡ عَن قِبۡلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيۡهَاۚ قُل لِّلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ يَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٢٤١\n                                    \n                                    \n                                    قوله تعالى : سيقول السفهاء من الناس ما ولاهم عن قبلتهم التي كانوا عليها قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم\nفيه إحدى عشرة مسألة\n الأولى : قوله تعالى : سيقول السفهاء من الناس أعلم الله تعالى أنهم سيقولون في تحويل المؤمنين من الشام إلى الكعبة ما ولاهم . وسيقول بمعنى قال ، جعل المستقبل موضع الماضي ، دلالة على استدامة ذلك وأنهم يستمرون على ذلك القول . وخص بقوله : من الناس لأن السفه يكون في جمادات وحيوانات . والمراد من السفهاء جميع من قال : ما ولاهم . والسفهاء جمع ، واحده سفيه ، وهو الخفيف العقل ، من قولهم : ثوب سفيه إذا كان خفيف النسج ، وقد تقدم . والنساء سفائه . وقال المؤرج : السفيه البهات الكذاب المتعمد خلاف ما يعلم . قطرب : الظلوم الجهول ، والمراد بالسفهاء هنا اليهود الذين بالمدينة ، قاله مجاهد . السدي : المنافقون . الزجاج : كفار قريش لما أنكروا تحويل القبلة قالوا : قد اشتاق محمد إلى مولده وعن قريب يرجع إلى دينكم ، وقالت اليهود : قد التبس عليه أمره وتحير . وقال المنافقون : ما ولاهم عن قبلتهم ، واستهزءوا بالمسلمين . وولاهم يعني عدلهم وصرفهم .\nالثانية : روى الأئمة واللفظ لمالك عن ابن عمر قال : بينما الناس بقباء في صلاة الصبح إذ جاءهم آت فقال : رسول الله صلى الله عليه وسلم قد أنزل عليه الليلة قرآن ، وقد أمر أن يستقبل الكعبة فاستقبلوها ، وكانت وجوههم إلى الشام فاستداروا إلى الكعبة . وخرج البخاري عن البراء أن النبي صلى الله عليه وسلم صلى إلى بيت المقدس ستة عشر شهرا أو سبعة عشر شهرا ، وكان يعجبه أن تكون قبلته قبل البيت ، وإنه صلى أول صلاة صلاها العصر وصلى معه قوم ، فخرج رجل ممن كان صلى مع النبي صلى الله عليه وسلم فمر على أهل المسجد وهم راكعون فقال : أشهد بالله ، لقد صليت مع النبي صلى الله عليه وسلم قبل مكة ، فداروا كما هم قبل البيت . وكان الذي مات على القبلة قبل أن تحول قبل البيت رجال قتلوا لم ندر ما نقول فيهم ، فأنزل الله عز وجل : وما كان الله ليضيع إيمانكم ، ففي هذه الرواية صلاة العصر ، وفي رواية مالك صلاة الصبح . وقيل : نزل ذلك على النبي صلى الله عليه وسلم في مسجد بني سلمة وهو في صلاة الظهر بعد ركعتين منها فتحول في الصلاة ، فسمي ذلك المسجد مسجد القبلتين . وذكر أبو الفرج أن عباد بن نهيك كان مع النبي صلى الله عليه وسلم في هذه الصلاة . وذكر أبو عمر في التمهيد عن نويلة بنت أسلم وكانت من المبايعات ، قالت : كنا في صلاة الظهر فأقبل عباد بن بشر بن قيظي فقال : إن رسول الله صلى الله عليه وسلم قد استقبل القبلة - أو قال : البيت الحرام - فتحول الرجال مكان النساء ، وتحول النساء مكان الرجال . وقيل : إن الآية نزلت في غير صلاة ، وهو الأكثر . وكان أول صلاة إلى الكعبة العصر ، والله أعلم .\nوروي أن أول من صلى إلى الكعبة حين صرفت القبلة عن بيت المقدس أبو سعيد بن المعلى وذلك أنه كان مجتازا على المسجد فسمع رسول الله صلى الله عليه وسلم يخطب الناس بتحويل القبلة على المنبر وهو يقرأ هذه الآية : قد نرى تقلب وجهك في السماء حتى فرغ من الآية ، فقلت لصاحبي : تعال نركع ركعتين قبل أن ينزل رسول الله صلى الله عليه وسلم فنكون أول من صلى فتوارينا نعما فصليناهما ، ثم نزل رسول الله صلى الله عليه وسلم فصلى بالناس الظهر يومئذ . قال أبو عمر : ليس لأبي سعيد بن المعلى غير هذا الحديث ، وحديث : \" كنت أصلي \" في فضل الفاتحة ، خرجه البخاري ، وقد تقدم .\nالثالثة : واختلف في وقت تحويل القبلة بعد قدومه المدينة ، فقيل : حولت بعد ستة عشر شهرا أو سبعة عشر شهرا ، كما في البخاري . وخرجه الدارقطني عن البراء أيضا . قال : صلينا مع رسول الله صلى الله عليه وسلم بعد قدومه المدينة ستة عشر شهرا نحو بيت المقدس ، ثم علم الله هوى نبيه فنزلت : قد نرى تقلب وجهك في السماء الآية . ففي هذه الرواية ستة عشر شهرا من غير شك . وروى مالك عن يحيى بن سعيد عن سعيد بن المسيب أن تحويلها كان قبل غزوة بدر بشهرين . قال إبراهيم بن إسحاق : وذلك في رجب من سنة اثنتين . وقال أبو حاتم البستي : صلى المسلمون إلى بيت المقدس سبعة عشر شهرا وثلاثة أيام سواء ، وذلك أن قدومه المدينة كان يوم الاثنين لاثنتي عشرة ليلة خلت من شهر ربيع الأول ، وأمره الله عز وجل باستقبال الكعبة يوم الثلاثاء للنصف من شعبان .\nالرابعة : واختلف العلماء أيضا في كيفية استقباله بيت المقدس على ثلاثة أقوال ، فقال الحسن : كان ذلك منه عن رأي واجتهاد ، وقاله عكرمة وأبو العالية . الثاني : أنه كان مخيرا بينه وبين الكعبة ، فاختار القدس طمعا في إيمان اليهود واستمالتهم ، قاله الطبري ، وقال الزجاج : امتحانا للمشركين لأنهم ألفوا الكعبة . الثالث : وهو الذي عليه الجمهور : ابن عباس وغيره ، وجب عليه استقباله بأمر الله تعالى ووحيه لا محالة ، ثم نسخ الله ذلك وأمره الله أن يستقبل بصلاته الكعبة ، واستدلوا بقوله تعالى : وما جعلنا القبلة التي كنت عليها إلا لنعلم من يتبع الرسول ممن ينقلب على عقبيه الآية .\nالخامسة : واختلفوا أيضا حين فرضت عليه الصلاة أولا بمكة ، هل كانت إلى بيت المقدس أو إلى مكة ، على قولين ، فقالت طائفة : إلى بيت المقدس وبالمدينة سبعة عشر شهرا ، ثم صرفه الله تعالى إلى الكعبة ، قاله ابن عباس . وقال آخرون : أول ما افترضت الصلاة عليه إلى الكعبة ، ولم يزل يصلي إليها طول مقامه بمكة على ما كانت عليه صلاة إبراهيم وإسماعيل ، فلما قدم المدينة صلى إلى بيت المقدس ستة عشر شهرا أو سبعة عشر شهرا ، على الخلاف ، ثم صرفه الله إلى الكعبة . قال أبو عمر : وهذا أصح القولين عندي . قال غيره : وذلك أن النبي صلى الله عليه وسلم لما قدم المدينة أراد أن يستألف اليهود فتوجه [ إلى ] قبلتهم ليكون ذلك أدعى لهم ، فلما تبين عنادهم وأيس منهم أحب أن يحول إلى الكعبة فكان ينظر إلى السماء ، وكانت محبته إلى الكعبة لأنها قبلة إبراهيم ، عن ابن عباس . وقيل : لأنها كانت أدعى للعرب إلى الإسلام ، وقيل : مخالفة لليهود ، عن مجاهد . وروي عن أبي العالية الرياحي أنه قال : كانت مسجد صالح عليه السلام وقبلته إلى الكعبة ، قال : وكان موسى عليه السلام يصلي إلى الصخرة نحو الكعبة ، وهي قبلة الأنبياء كلهم ، صلوات الله عليهم أجمعين .\nالسادسة : في هذه الآية دليل واضح على أن في أحكام الله تعالى وكتابه ناسخا ومنسوخا ، وأجمعت عليه الأمة إلا من شذ ، كما تقدم . وأجمع العلماء على أن القبلة أول ما نسخ من القرآن ، وأنها نسخت مرتين ، على أحد القولين المذكورين في المسألة قبل .\nالسابعة : ودلت أيضا على جواز نسخ السنة بالقرآن ، وذلك أن النبي صلى الله عليه وسلم صلى نحو بيت المقدس ، وليس في ذلك قرآن ، فلم يكن الحكم إلا من جهة السنة ثم نسخ ذلك بالقرآن ، وعلى هذا يكون : \" كنت عليها \" بمعنى أنت عليها .\nالثامنة : وفيها دليل على جواز القطع بخبر الواحد ، وذلك أن استقبال بيت المقدس كان مقطوعا به من الشريعة عندهم ، ثم إن أهل قباء لما أتاهم الآتي وأخبرهم أن القبلة قد حولت إلى المسجد الحرام قبلوا قوله واستداروا نحو الكعبة ، فتركوا المتواتر بخبر الواحد وهو مظنون .\nوقد اختلف العلماء في جوازه عقلا ووقوعه ، فقال أبو حاتم : والمختار جواز ذلك عقلا لو تعبد الشرع به ، ووقوعا في زمن رسول الله صلى الله عليه وسلم بدليل قصة قباء ، وبدليل أنه كان عليه السلام ينفذ آحاد الولاة إلى الأطراف وكانوا يبلغون الناسخ والمنسوخ جميعا . ولكن ذلك ممنوع بعد وفاته صلى الله عليه وسلم ، بدليل الإجماع من الصحابة على أن القرآن والمتواتر المعلوم لا يرفع بخبر الواحد ، فلا ذاهب إلى تجويزه من السلف والخلف . احتج من منع ذلك بأنه يفضي إلى المحال وهو رفع المقطوع بالمظنون . وأما قصة أهل قباء وولاة النبي صلى الله عليه وسلم فمحمول على قرائن إفادة العلم إما نقلا وتحقيقا ، وإما احتمالا وتقديرا . وتتميم هذا سؤالا وجوابا في أصول الفقه .\nالتاسعة : وفيها دليل على أن من لم يبلغه الناسخ إنه متعبد بالحكم الأول ، . خلافا لمن قال : إن الحكم الأول يرتفع بوجود الناسخ لا بالعلم به ، والأول أصح ; لأن أهل قباء لم يزالوا يصلون إلى بيت المقدس إلى أن أتاهم الآتي فأخبرهم بالناسخ فمالوا نحو الكعبة . فالناسخ إذا حصل في الوجود فهو رافع لا محالة لكن بشرط العلم به ; لأن الناسخ خطاب ، ولا يكون خطابا في حق من لم يبلغه . وفائدة هذا الخلاف في عبادات فعلت بعد النسخ وقبل البلاغ هل تعاد أم لا ، وعليه تنبني مسألة الوكيل في تصرفه بعد عزل موكله أو موته وقبل علمه بذلك على قولين . وكذلك المقارض والحاكم إذا مات من ولاه أو عزل . والصحيح أن ما فعله كل واحد من هؤلاء ينفذ فعله ولا يرد حكمه . قال القاضي عياض : ولم يختلف المذهب في أحكام من أعتق ولم يعلم بعتقه أنها أحكام حر فيما بينه وبين الناس ، وأما بينه وبين الله تعالى فجائزة . ولم يختلفوا في المعتقة أنها لا تعيد ما صلت بعد عتقها وقبل علمها بغير ستر ، وإنما اختلفوا فيمن يطرأ عليه موجب يغير حكم عبادته وهو فيها ، قياسا على مسألة قباء ، فمن صلى على حال ثم تغيرت به حاله تلك قبل أن يتم صلاته إنه يتمها ولا يقطعها ويجزيه ما مضى . وكذلك كمن صلى عريانا ثم وجد ثوبا في الصلاة ، أو ابتدأ صلاته صحيحا فمرض ، أو مريضا فصح ، أو قاعدا ثم قدر على القيام ، أو أمة عتقت وهي في الصلاة إنها تأخذ قناعها وتبني .\nقلت : وكمن دخل في الصلاة بالتيمم فطرأ عليه الماء إنه لا يقطع ، كما يقوله مالك والشافعي - رحمهما الله - وغيرهما . وقيل : يقطع ، وهو قول أبي حنيفة رحمه الله تعالى وسيأتي .\nالعاشرة : وفيها دليل على قبول خبر الواحد ، وهو مجمع عليه من السلف معلوم بالتواتر من عادة النبي صلى الله عليه وسلم في توجيهه ولاته ورسله آحادا للآفاق ، ليعلموا الناس دينهم فيبلغوهم سنة رسولهم صلى الله عليه وسلم من الأوامر والنواهي .\nالحادية عشرة : وفيها دليل على أن القرآن كان ينزل على رسول الله صلى الله عليه وسلم شيئا بعد شيء وفي حال بعد حال على حسب الحاجة إليه ، حتى أكمل الله دينه ، كما قال : اليوم أكملت لكم دينكم .\nقوله تعالى : قل لله المشرق والمغرب أقامه حجة ، أي له ملك المشارق والمغارب وما بينهما ، فله أن يأمر بالتوجه إلى أي جهة شاء ، وقد تقدم .\nقوله تعالى : يهدي من يشاء إشارة إلى هداية الله تعالى هذه الأمة إلى قبلة إبراهيم ، والله تعالى أعلم . والصراط الطريق . والمستقيم : الذي لا اعوجاج فيه ، وقد تقدم .\n                                    ",
        "saadi": "سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمۡ عَن قِبۡلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيۡهَاۚ قُل لِّلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ يَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٢٤١\n                                        \n                                        \n                                        \n                                        قد اشتملت الآية على معجزة, وتسلية, وتطمين قلوب المؤمنين, واعتراض وجوابه, من ثلاثة أوجه, وصفة المعترض, وصفة المسلم لحكم الله دينه. فأخبر تعالى أنه سيعترض السفهاء من الناس, وهم الذين لا يعرفون مصالح أنفسهم, بل يضيعونها ويبيعونها بأبخس ثمن, وهم اليهود والنصارى, ومن أشبههم من المعترضين على أحكام الله وشرائعه، وذلك أن المسلمين كانوا مأمورين باستقبال بيت المقدس, مدة مقامهم بمكة، ثم بعد الهجرة إلى المدينة, نحو سنة ونصف - لما لله تعالى في ذلك من الحكم التي سيشير إلى بعضها, وكانت حكمته تقتضي أمرهم باستقبال الكعبة، فأخبرهم أنه لا بد أن يقول السفهاء من الناس: { مَا وَلَّاهُمْ عَنْ قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا } وهي استقبال بيت المقدس، أي: أيُّ شيء صرفهم عنه؟ وفي ذلك الاعتراض على حكم الله وشرعه, وفضله وإحسانه، فسلاهم, وأخبر بوقوعه, وأنه إنما يقع ممن اتصف بالسفه, قليل العقل, والحلم, والديانة، فلا تبالوا بهم, إذ قد علم مصدر هذا الكلام، فالعاقل لا يبالي باعتراض السفيه, ولا يلقي له ذهنه. ودلت الآية على أنه لا يعترض على أحكام الله, إلا سفيه جاهل معاند، وأما الرشيد المؤمن العاقل, فيتلقى أحكام ربه بالقبول, والانقياد, والتسليم كما قال تعالى: { وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ } { فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ } الآية، { إِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِينَ إِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ أَنْ يَقُولُوا سَمِعْنَا وَأَطَعْنَا } وقد كان في قوله { السفهاء } ما يغني عن رد قولهم, وعدم المبالاة به. ولكنه تعالى مع هذا لم يترك هذه الشبهة, حتى أزالها وكشفها مما سيعرض لبعض القلوب من الاعتراض, فقال تعالى: { قُلْ } لهم مجيبا: { لِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ } أي: فإذا كان المشرق والمغرب ملكا لله, ليس جهة من الجهات خارجة عن ملكه, ومع هذا يهدي من يشاء إلى صراط مستقيم, ومنه هدايتكم إلى هذه القبلة التي هي من ملة أبيكم إبراهيم، فلأي شيء يعترض المعترض بتوليتكم قبلة داخلة تحت ملك الله, لم تستقبلوا جهة ليست ملكا له؟ فهذا يوجب التسليم لأمره, بمجرد ذلك، فكيف وهو من فضل الله عليكم, وهدايته وإحسانه, أن هداكم لذلك فالمعترض عليكم, معترض على فضل الله, حسدا لكم وبغيا. ولما كان قوله: { يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ } والمطلق يحمل على المقيد, فإن الهداية والضلال, لهما أسباب أوجبتها حكمة الله وعدله, وقد أخبر في غير موضع من كتابه بأسباب الهداية, التي إذا أتى بها العبد حصل له الهدى كما قال تعالى: { يَهْدِي بِهِ اللَّهُ مَنِ اتَّبَعَ رِضْوَانَهُ سُبُلَ السَّلَامِ }\n                                    "
      },
      "originalText": "۞ سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمۡ عَن قِبۡلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيۡهَاۚ قُل لِّلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ يَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ ٢٤١"
    },
    {
      "number": 150,
      "text": "وَكَذَٰلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا ۗ وَمَا جَعَلْنَا الْقِبْلَةَ الَّتِي كُنْتَ عَلَيْهَا إِلَّا لِنَعْلَمَ مَنْ يَتَّبِعُ الرَّسُولَ مِمَّنْ يَنْقَلِبُ عَلَىٰ عَقِبَيْهِ ۚ وَإِنْ كَانَتْ لَكَبِيرَةً إِلَّا عَلَى الَّذِينَ هَدَى اللَّهُ ۗ وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ ۚ إِنَّ اللَّهَ بِالنَّاسِ لَرَءُوفٌ رَحِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 143,
      "juz": 2,
      "manzil": 1,
      "page": 22,
      "ruku": 18,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَذَٰلِكَ جَعَلۡنَٰكُمۡ أُمَّةٗ وَسَطٗا لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيۡكُمۡ شَهِيدٗاۗ وَمَا جَعَلۡنَا ٱلۡقِبۡلَةَ ٱلَّتِي كُنتَ عَلَيۡهَآ إِلَّا لِنَعۡلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ وَإِن كَانَتۡ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَٰنَكُمۡۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ ٣٤١\n                                    \n                                    \n                                    وقوله تعالى : ( وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا ) يقول تعالى : إنما حولناكم إلى قبلة إبراهيم ، عليه السلام ، واخترناها لكم لنجعلكم خيار الأمم ، لتكونوا يوم القيامة شهداء على الأمم ; لأن الجميع معترفون لكم بالفضل . والوسط هاهنا : الخيار والأجود ، كما يقال : قريش أوسط العرب نسبا ودارا ، أي : خيرها . وكان رسول الله صلى الله عليه وسلم وسطا في قومه ، أي : أشرفهم نسبا ، ومنه الصلاة الوسطى ، التي هي أفضل الصلوات ، وهي العصر ، كما ثبت في الصحاح وغيرها ، ولما جعل الله هذه الأمة وسطا خصها بأكمل الشرائع وأقوم المناهج وأوضح المذاهب ، كما قال تعالى : ( هو اجتباكم وما جعل عليكم في الدين من حرج ملة أبيكم إبراهيم هو سماكم المسلمين من قبل وفي هذا ليكون الرسول شهيدا عليكم وتكونوا شهداء على الناس ) [ الحج : 78 ]\nوقال الإمام أحمد : حدثنا وكيع ، عن الأعمش ، عن أبي صالح ، عن أبي سعيد قال : قال رسول الله صلى الله عليه وسلم : \" يدعى نوح يوم القيامة فيقال له : هل بلغت ؟ فيقول : نعم . فيدعى قومه فيقال لهم : هل بلغكم ؟ فيقولون : ما أتانا من نذير وما أتانا من أحد ، فيقال لنوح : من يشهد لك ؟ فيقول : محمد وأمته \" قال : فذلك قوله : ( وكذلك جعلناكم أمة وسطا ) .\nقال : الوسط : العدل ، فتدعون ، فتشهدون له بالبلاغ ، ثم أشهد عليكم .\nرواه البخاري والترمذي والنسائي وابن ماجه من طرق عن الأعمش ، [ به ] .\nوقال الإمام أحمد أيضا : حدثنا أبو معاوية ، حدثنا الأعمش ، عن أبي صالح ، عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم : \" يجيء النبي يوم القيامة [ ومعه الرجل والنبي ] ومعه الرجلان وأكثر من ذلك فيدعى قومه ، فيقال [ لهم ] هل بلغكم هذا ؟ فيقولون : لا . فيقال له : هل بلغت قومك ؟ فيقول : نعم . فيقال [ له ] من يشهد لك ؟ فيقول : محمد وأمته . فيدعى بمحمد وأمته ، فيقال لهم : هل بلغ هذا قومه ؟ فيقولون : نعم . فيقال : وما علمكم ؟ فيقولون : جاءنا نبينا صلى الله عليه وسلم فأخبرنا أن الرسل قد بلغوا \" فذلك قوله عز وجل : ( وكذلك جعلناكم أمة وسطا ) قال : \" عدلا ( لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا ) \" .\nوقال الإمام أحمد أيضا : حدثنا أبو معاوية ، حدثنا الأعمش ، عن أبي صالح ، عن أبي سعيد الخدري ، عن النبي صلى الله عليه وسلم في قوله تعالى : ( وكذلك جعلناكم أمة وسطا ) قال : \" عدلا \" .\nوروى الحافظ أبو بكر بن مردويه وابن أبي حاتم من حديث عبد الواحد بن زياد ، عن أبي مالك الأشجعي ، عن المغيرة بن عتيبة بن نهاس : حدثني مكتب لنا عن جابر بن عبد الله ، عن النبي صلى الله عليه وسلم ، قال : \" أنا وأمتي يوم القيامة على كوم مشرفين على الخلائق . ما من الناس أحد إلا ود أنه منا . وما من نبي كذبه قومه إلا ونحن نشهد أنه قد بلغ رسالة ربه ، عز وجل \" .\nوروى الحاكم ، في مستدركه وابن مردويه أيضا ، واللفظ له ، من حديث مصعب بن ثابت ، عن محمد بن كعب القرظي ، عن جابر بن عبد الله ، قال : شهد رسول الله صلى الله عليه وسلم جنازة ، في بني سلمة ، وكنت إلى جانب رسول الله صلى الله عليه وسلم ، فقال بعضهم : والله يا رسول الله لنعم المرء كان ، لقد كان عفيفا مسلما وكان . . . وأثنوا عليه خيرا . فقال رسول الله صلى الله عليه وسلم : \" أنت بما تقول \" . فقال الرجل : الله أعلم بالسرائر ، فأما الذي بدا لنا منه فذاك . فقال النبي صلى الله عليه وسلم : \" وجبت \" . ثم شهد جنازة في بني حارثة ، وكنت إلى جانب رسول الله صلى الله عليه وسلم ، فقال بعضهم : يا رسول الله ، بئس المرء كان ، إن كان لفظا غليظا ، فأثنوا عليه شرا فقال رسول الله صلى الله عليه وسلم لبعضهم : \" أنت بالذي تقول \" . فقال الرجل : الله أعلم بالسرائر ، فأما الذي بدا لنا منه فذاك . فقال رسول الله صلى الله عليه وسلم : \" وجبت \" .\nقال مصعب بن ثابت : فقال لنا عند ذلك محمد بن كعب : صدق رسول الله صلى الله عليه وسلم ، ثم قرأ : ( وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا )\nثم قال الحاكم : هذا حديث صحيح الإسناد ، ولم يخرجاه .\nوقال الإمام أحمد : حدثنا يونس بن محمد ، حدثنا داود بن أبي الفرات ، عن عبد الله بن بريدة ، عن أبي الأسود أنه قال : أتيت المدينة فوافقتها ، وقد وقع بها مرض ، فهم يموتون موتا ذريعا . فجلست إلى عمر بن الخطاب ، فمرت به جنازة ، فأثني على صاحبها خير . فقال : وجبت وجبت . ثم مر بأخرى فأثني عليها شر ، فقال عمر : وجبت [ وجبت ] . فقال أبو الأسود : ما وجبت يا أمير المؤمنين ؟ قال : قلت : كما قال رسول الله صلى الله عليه وسلم : \" أيما مسلم شهد له أربعة بخير أدخله الله الجنة \" . قال : فقلنا . وثلاثة ؟ قال : \" وثلاثة \" . قال ، فقلنا : واثنان ؟ قال : \" واثنان \" ثم لم نسأله عن الواحد .\nوكذا رواه البخاري ، والترمذي ، والنسائي من حديث داود بن أبي الفرات ، به .\nقال ابن مردويه : حدثنا أحمد بن عثمان بن يحيى ، حدثنا أبو قلابة الرقاشي ، حدثني أبو الوليد ، حدثنا نافع بن عمر ، حدثني أمية بن صفوان ، عن أبي بكر بن أبي زهير الثقفي ، عن أبيه ، قال : سمعت رسول الله صلى الله عليه وسلم بالنباوة يقول : \" يوشك أن تعلموا خياركم من شراركم \" قالوا : بم يا رسول الله ؟ قال : \" بالثناء الحسن والثناء السيئ ، أنتم شهداء الله في الأرض \" . ورواه ابن ماجه عن أبي بكر بن أبي شيبة ، عن يزيد بن هارون . ورواه الإمام أحمد ، عن يزيد بن هارون ، وعبد الملك بن عمر وشريح ، عن نافع عن ابن عمر ، به .\nوقوله تعالى : ( وما جعلنا القبلة التي كنت عليها إلا لنعلم من يتبع الرسول ممن ينقلب على عقبيه وإن كانت لكبيرة إلا على الذين هدى الله ) يقول تعالى : إنما شرعنا لك يا محمد التوجه أولا إلى بيت المقدس ، ثم صرفناك عنها إلى الكعبة ، ليظهر حال من يتبعك ويطيعك ويستقبل معك حيثما توجهت ممن ينقلب على عقبيه ، أي : مرتدا عن دينه ( وإن كانت لكبيرة ) أي : هذه الفعلة ، وهو صرف التوجه عن بيت المقدس إلى الكعبة ، أي : وإن كان هذا الأمر عظيما في النفوس ، إلا على الذين هدى الله قلوبهم ، وأيقنوا بتصديق الرسول ، وأن كل ما جاء به فهو الحق الذي لا مرية فيه ، وأن الله يفعل ما يشاء ويحكم ما يريد ، فله أن يكلف عباده بما شاء ، وينسخ ما يشاء ، وله الحكمة التامة والحجة البالغة في جميع ذلك ، بخلاف الذين في قلوبهم مرض ، فإنه كلما حدث أمر أحدث لهم شكا ، كما يحصل للذين آمنوا إيقان وتصديق ، كما قال الله تعالى : ( وإذا ما أنزلت سورة فمنهم من يقول أيكم زادته هذه إيمانا فأما الذين آمنوا فزادتهم إيمانا وهم يستبشرون وأما الذين في قلوبهم مرض فزادتهم رجسا إلى رجسهم ) [ التوبة : 124 ، 125 ] وقال تعالى : ( قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى ) [ فصلت : 44 ] وقال تعالى : ( وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا ) [ الإسراء : 82 ] . ولهذا كان من ثبت على تصديق الرسول صلى الله عليه وسلم واتباعه في ذلك ، وتوجه حيث أمره الله من غير شك ولا ريب ، من سادات الصحابة . وقد ذهب بعضهم إلى أن السابقين الأولين من المهاجرين والأنصار هم الذين صلوا القبلتين .\nوقال البخاري في تفسير هذه الآية :\nحدثنا مسدد ، حدثنا يحيى ، عن سفيان ، عن عبد الله بن دينار ، عن ابن عمر قال : بينا الناس يصلون الصبح في مسجد قباء إذ جاء رجل فقال : قد أنزل على النبي صلى الله عليه وسلم قرآن ، وقد أمر أن يستقبل الكعبة فاستقبلوها . فتوجهوا إلى الكعبة .\nوقد رواه مسلم من وجه آخر ، عن ابن عمر . ورواه الترمذي من حديث سفيان الثوري وعنده : أنهم كانوا ركوعا ، فاستداروا كما هم إلى الكعبة ، وهم ركوع . وكذا رواه مسلم من حديث حماد بن سلمة ، عن ثابت ، عن أنس ، مثله ، وهذا يدل على كمال طاعتهم لله ورسوله ، وانقيادهم لأوامر الله عز وجل ، رضي الله عنهم أجمعين .\nوقوله : ( وما كان الله ليضيع إيمانكم ) أي : صلاتكم إلى بيت المقدس قبل ذلك لا يضيع ثوابها عند الله ، وفي الصحيح من حديث أبي إسحاق السبيعي ، عن البراء ، قال : مات قوم كانوا يصلون نحو بيت المقدس فقال الناس : ما حالهم في ذلك ؟ فأنزل الله تعالى : ( وما كان الله ليضيع إيمانكم ) .\n[ ورواه الترمذي عن ابن عباس وصححه ] .\nوقال ابن إسحاق : حدثني محمد بن أبي محمد ، عن عكرمة أو سعيد بن جبير ، عن ابن عباس : ( وما كان الله ليضيع إيمانكم ) أي : بالقبلة الأولى ، وتصديقكم نبيكم ، واتباعه إلى القبلة الأخرى . أي : ليعطيكم أجرهما جميعا . ( إن الله بالناس لرءوف رحيم )\nوقال الحسن البصري : ( وما كان الله ليضيع إيمانكم ) أي : ما كان الله ليضيع محمدا صلى الله عليه وسلم وانصرافكم معه حيث انصرف ( إن الله بالناس لرءوف رحيم )\nوفي الصحيح أن رسول الله صلى الله عليه وسلم رأى امرأة من السبي قد فرق بينها وبين ولدها ، فجعلت كلما وجدت صبيا من السبي أخذته فألصقته بصدرها ، وهي تدور على ولدها ، فلما وجدته ضمته إليها وألقمته ثديها . فقال رسول الله صلى الله عليه وسلم : \" أترون هذه طارحة ولدها في النار ، وهي تقدر على ألا تطرحه ؟ \" قالوا : لا يا رسول الله . قال : \" فوالله ، لله أرحم بعباده من هذه بولدها \" .\n                                    ",
        "qortoby": "وَكَذَٰلِكَ جَعَلۡنَٰكُمۡ أُمَّةٗ وَسَطٗا لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيۡكُمۡ شَهِيدٗاۗ وَمَا جَعَلۡنَا ٱلۡقِبۡلَةَ ٱلَّتِي كُنتَ عَلَيۡهَآ إِلَّا لِنَعۡلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ وَإِن كَانَتۡ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَٰنَكُمۡۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ ٣٤١\n                                    \n                                    \n                                    قوله تعالى : وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا وما جعلنا القبلة التي كنت عليها إلا لنعلم من يتبع الرسول ممن ينقلب على عقبيه وإن كانت لكبيرة إلا على الذين هدى الله وما كان الله ليضيع إيمانكم إن الله بالناس لرءوف رحيم\nفيه أربع مسائل :\nالأولى : قوله تعالى : وكذلك جعلناكم أمة وسطا المعنى : وكما أن الكعبة وسط الأرض كذلك جعلناكم أمة وسطا ، أي جعلناكم دون الأنبياء وفوق الأمم . والوسط : العدل ، وأصل هذا أن أحمد الأشياء أوسطها . وروى الترمذي عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم في قوله تعالى : وكذلك جعلناكم أمة وسطا قال : ( عدلا ) . قال : هذا حديث حسن صحيح . وفي التنزيل : قال أوسطهم أي أعدلهم وخيرهم . وقال زهير :\nهم وسط يرضى الأنام بحكمهم إذا نزلت إحدى الليالي بمعظم\nآخر :\nأنتم أوسط حي علموا بصغير الأمر أو إحدى الكبر\nوقال آخر :\nلا تذهبن في الأمور فرطا لا تسألن إن سألت شططا\nوكن من الناس جميعا وسطا\nووسط الوادي : خير موضع فيه وأكثره كلأ وماء . ولما كان الوسط مجانبا للغلو والتقصير كان محمودا ، أي هذه الأمة لم تغل غلو النصارى في أنبيائهم ، ولا قصروا تقصير اليهود في أنبيائهم . وفي الحديث : خير الأمور أوسطها . وفيه عن علي رضي الله عنه : \" عليكم بالنمط الأوسط ، فإليه ينزل العالي ، وإليه يرتفع النازل \" . وفلان من أوسط قومه ، وإنه لواسطة قومه ، ووسط قومه ، أي من خيارهم وأهل الحسب منهم . وقد وسط وساطة وسطة ، وليس من الوسط الذي بين شيئين في شيء . والوسط ( بسكون السين ) الظرف ، تقول : صليت وسط القوم . وجلست وسط الدار ( بالتحريك ) لأنه اسم . قال الجوهري : وكل موضع صلح فيه \" بين \" فهو وسط ، وإن لم يصلح فيه \" بين \" فهو وسط بالتحريك ، وربما يسكن وليس بالوجه .\nالثانية : قوله تعالى : لتكونوا نصب بلام كي ، أي لأن تكونوا . شهداء على الناس خبر كان . على الناس أي في المحشر للأنبياء على أممهم ، كما ثبت في صحيح البخاري عن أبي سعيد الخدري قال قال رسول الله صلى الله عليه وسلم : يدعى نوح عليه السلام يوم القيامة فيقول لبيك وسعديك يا رب فيقول هل بلغت فيقول نعم فيقال لأمته هل بلغكم فيقولون ما أتانا من نذير فيقول من يشهد لك فيقول محمد وأمته فيشهدون أنه قد بلغ ويكون الرسول عليكم شهيدا فذلك قوله عز وجل : وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا . وذكر هذا الحديث مطولا ابن المبارك بمعناه ، وفيه : فتقول تلك الأمم كيف يشهد علينا من لم يدركنا فيقول لهم الرب سبحانه كيف تشهدون على من لم تدركوا فيقولون ربنا بعثت إلينا رسولا وأنزلت إلينا عهدك وكتابك وقصصت علينا أنهم قد بلغوا فشهدنا بما عهدت إلينا فيقول الرب صدقوا فذلك قوله عز وجل وكذلك جعلناكم أمة وسطا - والوسط العدل - لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا . قال ابن أنعم : فبلغني أنه يشهد يومئذ أمة محمد عليه السلام ، إلا من كان في قلبه حنة على أخيه . وقالت طائفة : معنى الآية يشهد بعضكم على بعض بعد الموت ، كما ثبت في صحيح مسلم عن أنس عن النبي صلى الله عليه وسلم أنه قال حين مرت به جنازة فأثني عليها خير فقال : وجبت وجبت وجبت . ثم مر عليه بأخرى فأثني عليها شر فقال : وجبت وجبت وجبت . فقال عمر : فدى لك أبي وأمي ، مر بجنازة فأثني عليها خير فقلت : وجبت وجبت وجبت ، ومر بجنازة فأثني عليها شر فقلت : وجبت وجبت وجبت ؟ فقال رسول الله صلى الله عليه وسلم : من أثنيتم عليه خيرا وجبت له الجنة ومن أثنيتم عليه شرا وجبت له النار أنتم شهداء الله في الأرض أنتم شهداء الله في الأرض أنتم شهداء الله في الأرض . أخرجه البخاري بمعناه . وفي بعض طرقه في غير الصحيحين وتلا : لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا . وروى أبان وليث عن شهر بن حوشب عن عبادة بن الصامت قال سمعت رسول الله صلى الله عليه وسلم يقول : أعطيت أمتي ثلاثا لم تعط إلا الأنبياء ؛ كان الله إذا بعث نبيا قال له ادعني أستجب لك وقال لهذه الأمة ادعوني أستجب لكم وكان الله إذا بعث النبي قال له ما جعل عليك في الدين من حرج وقال لهذه الأمة وما جعل عليكم في الدين من حرج وكان الله إذا بعث النبي جعله شهيدا على قومه وجعل هذه الأمة شهداء على الناس . خرجه الترمذي الحكيم أبو عبد الله في \" نوادر الأصول \" .\nالثالثة : قال علماؤنا : أنبأنا ربنا تبارك وتعالى في كتابه بما أنعم علينا من تفضيله لنا باسم العدالة وتولية خطير الشهادة على جميع خلقه ، فجعلناه أولا مكانا وإن كنا آخرا زمانا ، كما قال عليه السلام : نحن الآخرون الأولون . وهذا دليل على أنه لا يشهد إلا العدول ، ولا ينفذ قول الغير على الغير إلا أن يكون عدلا . وسيأتي بيان العدالة وحكمها في آخر السورة إن شاء الله تعالى .\nالرابعة : وفيه دليل على صحة الإجماع ووجوب الحكم به ; لأنهم إذا كانوا عدولا شهدوا على الناس . فكل عصر شهيد على من بعده فقول الصحابة حجة وشاهد على التابعين ، وقول التابعين على من بعدهم . وإذ جعلت الأمة شهداء فقد وجب قبول قولهم . ولا معنى لقول من قال : أريد به جميع الأمة لأنه حينئذ لا يثبت مجمع عليه إلى قيام الساعة . وبيان هذا في كتب أصول الفقه .\nقوله تعالى : ويكون الرسول عليكم شهيدا قيل : معناه بأعمالكم يوم القيامة . وقيل : \" عليكم \" بمعنى لكم ، أي يشهد لكم بالإيمان . وقيل : أي يشهد عليكم بالتبليغ لكم .\nقوله تعالى : وما جعلنا القبلة التي كنت عليها قيل : المراد بالقبلة هنا القبلة الأولى ، لقوله كنت عليها . وقيل : الثانية ، فتكون الكاف زائدة ، أي أنت الآن عليها ، كما تقدم ، وكما قال : كنتم خير أمة أخرجت للناس أي أنتم ، في قول بعضهم ، وسيأتي .\nقوله تعالى : إلا لنعلم من يتبع الرسول قال علي بن أبي طالب رضي الله تعالى عنه : معنى لنعلم لنرى . والعرب تضع العلم مكان الرؤية ، والرؤية مكان العلم ، كقوله تعالى : ألم تر كيف فعل ربك بمعنى ألم تعلم . وقيل : المعنى إلا لتعلموا أننا نعلم ، فإن المنافقين كانوا في شك من علم الله تعالى بالأشياء قبل كونها . وقيل : المعنى لنميز أهل اليقين من أهل الشك ، حكاه ابن فورك ، وذكره الطبري عن ابن عباس . وقيل : المعنى إلا ليعلم النبي وأتباعه ، وأخبر تعالى بذلك عن نفسه ، كما يقال : فعل الأمير كذا ، وإنما فعله أتباعه ، ذكره المهدوي وهو جيد . وقيل : معناه ليعلم محمد ، فأضاف علمه إلى نفسه تعالى تخصيصا وتفضيلا ، كما كنى عن نفسه سبحانه في قوله : يا بن آدم مرضت فلم تعدني الحديث . والأول أظهر ، وأن معناه علم المعاينة الذي يوجب الجزاء ، وهو سبحانه عالم الغيب والشهادة ، علم ما يكون قبل أن يكون ، تختلف الأحوال على المعلومات ، وعلمه لا يختلف بل يتعلق بالكل تعلقا واحدا . وهكذا كل ما ورد في الكتاب من هذا المعنى من قوله تعالى : وليعلم الله الذين آمنوا ويتخذ منكم شهداء ، ولنبلونكم حتى نعلم المجاهدين منكم والصابرين وما أشبه . والآية جواب لقريش في قولهم : ما ولاهم عن قبلتهم التي كانوا عليها وكانت قريش تألف الكعبة ، فأراد الله عز وجل أن يمتحنهم بغير ما ألفوه ليظهر من يتبع الرسول ممن لا يتبعه . وقرأ الزهري إلا ليعلم ف من في موضع رفع على هذه القراءة ; لأنها اسم ما لم يسم فاعله . وعلى قراءة الجماعة في موضع نصب على المفعول . يتبع الرسول يعني فيما أمر به من استقبال الكعبة . ممن ينقلب على عقبيه يعني ممن يرتد عن دينه ; لأن القبلة لما حولت ارتد من المسلمين قوم ونافق قوم ; و لهذا قال : وإن كانت لكبيرة أي تحويلها ، قاله ابن عباس ومجاهد وقتادة . والتقدير في العربية : وإن كانت التحويلة .\nقوله تعالى : وإن كانت لكبيرة ذهب الفراء إلى أن إن واللام بمعنى ما وإلا ، والبصريون يقولون : هي إن الثقيلة خففت . وقال الأخفش : أي وإن كانت القبلة أو التحويلة أو التولية لكبيرة ، إلا على الذين هدى الله أي خلق الهدى الذي هو الإيمان في قلوبهم ، كما قال تعالى : أولئك كتب في قلوبهم الإيمان .\nقوله تعالى : وما كان الله ليضيع إيمانكم اتفق العلماء على أنها نزلت فيمن مات وهو يصلي إلى بيت المقدس ، كما ثبت في البخاري من حديث البراء بن عازب على ما تقدم . وخرج الترمذي عن ابن عباس قال : لما وجه النبي صلى الله عليه وسلم إلى الكعبة قالوا : يا رسول الله ، كيف بإخواننا الذين ماتوا وهم يصلون إلى بيت المقدس ؟ فأنزل الله تعالى : وما كان الله ليضيع إيمانكم الآية ، قال : هذا حديث حسن صحيح . فسمى الصلاة إيمانا لاشتمالها على نية وقول وعمل . وقال مالك : إني لأذكر بهذه الآية قول المرجئة : إن الصلاة ليست من الإيمان . وقال محمد بن إسحاق : وما كان الله ليضيع إيمانكم أي بالتوجه إلى القبلة وتصديقكم لنبيكم ، وعلى هذا معظم المسلمين والأصوليين . وروى ابن وهب وابن القاسم وابن عبد الحكم وأشهب عن مالك وما كان الله ليضيع إيمانكم قال : صلاتكم .\nقوله تعالى : إن الله بالناس لرءوف رحيم الرأفة أشد من الرحمة . وقال أبو عمرو بن العلاء : الرأفة أكثر من الرحمة ، والمعنى متقارب . وقد أتينا على لغته وأشعاره ومعانيه في الكتاب \" الأسنى في شرح أسماء الله الحسنى \" فلينظر هناك . وقرأ الكوفيون وأبو عمرو \" لرؤف \" على وزن فعل ، وهي لغة بني أسد ، ومنه قول الوليد بن عقبة :\nوشر الطالبين فلا تكنه يقاتل عمه الرؤف الرحيم\nوحكى الكسائي أن لغة بني أسد \" لرأف \" ، على فعل . وقرأ أبو جعفر بن القعقاع \" لروف \" مثقلا بغير همز ، وكذلك سهل كل همزة في كتاب الله تعالى ، ساكنة كانت أو متحركة .\n                                    ",
        "saadi": "وَكَذَٰلِكَ جَعَلۡنَٰكُمۡ أُمَّةٗ وَسَطٗا لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيۡكُمۡ شَهِيدٗاۗ وَمَا جَعَلۡنَا ٱلۡقِبۡلَةَ ٱلَّتِي كُنتَ عَلَيۡهَآ إِلَّا لِنَعۡلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ وَإِن كَانَتۡ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَٰنَكُمۡۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ ٣٤١\n                                        \n                                        \n                                        \n                                        ذكر في هذه الآية السبب الموجب لهداية هذه الأمة مطلقا بجميع أنواع الهداية, ومنة الله عليها فقال: { وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا } أي: عدلا خيارا، وما عدا الوسط, فأطراف داخلة تحت الخطر، فجعل الله هذه الأمة, وسطا في كل أمور الدين، وسطا في الأنبياء, بين من غلا فيهم, كالنصارى, وبين من جفاهم, كاليهود, بأن آمنوا بهم كلهم على الوجه اللائق بذلك، ووسطا في الشريعة, لا تشديدات اليهود وآصارهم, ولا تهاون النصارى. وفي باب الطهارة والمطاعم, لا كاليهود الذين لا تصح لهم صلاة إلا في بيعهم وكنائسهم, ولا يطهرهم الماء من النجاسات, وقد حرمت عليهم الطيبات, عقوبة لهم، ولا كالنصارى الذين لا ينجسون شيئا, ولا يحرمون شيئا, بل أباحوا ما دب ودرج. بل طهارتهم أكمل طهارة وأتمها، وأباح الله لهم الطيبات من المطاعم والمشارب والملابس والمناكح, وحرم عليهم الخبائث من ذلك، فلهذه الأمة من الدين أكمله, ومن الأخلاق أجلها, ومن الأعمال أفضلها. ووهبهم الله من العلم والحلم, والعدل والإحسان, ما لم يهبه لأمة سواهم، فلذلك كانوا { أُمَّةً وَسَطًا } [كاملين] ليكونوا { شُهَدَاءَ عَلَى النَّاسِ } بسبب عدالتهم وحكمهم بالقسط, يحكمون على الناس من سائر أهل الأديان, ولا يحكم عليهم غيرهم، فما شهدت له هذه الأمة بالقبول, فهو مقبول, وما شهدت له بالرد, فهو مردود. فإن قيل: كيف يقبل حكمهم على غيرهم, والحال أن كل مختصمين غير مقبول قول بعضهم على بعض؟ قيل: إنما لم يقبل قول أحد المتخاصمين, لوجود التهمة فأما إذا انتفت التهمة, وحصلت العدالة التامة, كما في هذه الأمة, فإنما المقصود, الحكم بالعدل والحق، وشرط ذلك, العلم والعدل, وهما موجودان في هذه الأمة, فقبل قولها. فإن شك شاك في فضلها, وطلب مزكيا لها, فهو أكمل الخلق, نبيهم صلى الله عليه وسلم، فلهذا قال تعالى: { وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا } ومن شهادة هذه الأمة على غيرهم, أنه إذا كان يوم القيامة, وسأل الله المرسلين عن تبليغهم, والأمم المكذبة عن ذلك, وأنكروا أن الأنبياء بلغتهم، استشهدت الأنبياء بهذه الأمة, وزكاها نبيها. وفي الآية دليل على أن إجماع هذه الأمة, حجة قاطعة, وأنهم معصومون عن الخطأ, لإطلاق قوله: { وَسَطًا } فلو قدر اتفاقهم على الخطأ, لم يكونوا وسطا, إلا في بعض الأمور, ولقوله: { ولتكونوا شهداء على الناس } يقتضي أنهم إذا شهدوا على حكم أن الله أحله أو حرمه أو أوجبه، فإنها معصومة في ذلك. وفيها اشتراط العدالة في الحكم, والشهادة, والفتيا, ونحو ذلك. يقول تعالى: { وَمَا جَعَلْنَا الْقِبْلَةَ الَّتِي كُنْتَ عَلَيْهَا } وهي استقبال بيت المقدس أولا { إِلَّا لِنَعْلَمَ } أي: علما يتعلق به الثواب والعقاب, وإلا فهو تعالى عالم بكل الأمور قبل وجودها. ولكن هذا العلم, لا يعلق عليه ثوابا ولا عقابا, لتمام عدله, وإقامة الحجة على عباده، بل إذا وجدت أعمالهم, ترتب عليها الثواب والعقاب، أي: شرعنا تلك القبلة لنعلم ونمتحن { مَنْ يَتَّبِعُ الرَّسُولَ } ويؤمن به, فيتبعه على كل حال, لأنه عبد مأمور مدبر، ولأنه قد أخبرت الكتب المتقدمة, أنه يستقبل الكعبة، فالمنصف الذي مقصوده الحق, مما يزيده ذلك إيمانا, وطاعة للرسول. وأما من انقلب على عقبيه, وأعرض عن الحق, واتبع هواه, فإنه يزداد كفرا إلى كفره, وحيرة إلى حيرته, ويدلي بالحجة الباطلة, المبنية على شبهة لا حقيقة لها. { وَإِنْ كَانَتْ } أي: صرفك عنها { لَكَبِيرَةٌ } أي: شاقة { إِلَّا عَلَى الَّذِينَ هَدَى اللَّهُ } فعرفوا بذلك نعمة الله عليهم, وشكروا, وأقروا له بالإحسان, حيث وجههم إلى هذا البيت العظيم, الذي فضله على سائر بقاع الأرض، وجعل قصده, ركنا من أركان الإسلام, وهادما للذنوب والآثام, فلهذا خف عليهم ذلك, وشق على من سواهم. ثم قال تعالى: { وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ } أي: ما ينبغي له ولا يليق به تعالى, بل هي من الممتنعات عليه، فأخبر أنه ممتنع عليه, ومستحيل, أن يضيع إيمانكم، وفي هذا بشارة عظيمة لمن مَنَّ الله عليهم بالإسلام والإيمان, بأن الله سيحفظ عليهم إيمانهم, فلا يضيعه, وحفظه نوعان: حفظ عن الضياع والبطلان, بعصمته لهم عن كل مفسد ومزيل له ومنقص من المحن المقلقة, والأهواء الصادة، وحفظ له بتنميته لهم, وتوفيقهم لما يزداد به إيمانهم, ويتم به إيقانهم، فكما ابتدأكم, بأن هداكم للإيمان, فسيحفظه لكم, ويتم نعمته بتنميته وتنمية أجره, وثوابه, وحفظه من كل مكدر، بل إذا وجدت المحن المقصود منها, تبيين المؤمن الصادق من الكاذب، فإنها تمحص المؤمنين, وتظهر صدقهم، وكأن في هذا احترازا عما قد يقال إن قوله: { وَمَا جَعَلْنَا الْقِبْلَةَ الَّتِي كُنْتَ عَلَيْهَا إِلَّا لِنَعْلَمَ مَنْ يَتَّبِعُ الرَّسُولَ مِمَّنْ يَنْقَلِبُ عَلَى عَقِبَيْهِ } قد يكون سببا لترك بعض المؤمنين إيمانهم, فدفع هذا الوهم بقوله: { وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ } بتقديره لهذه المحنة أو غيرها. ودخل في ذلك من مات من المؤمنين قبل تحويل الكعبة, فإن الله لا يضيع إيمانهم, لكونهم امتثلوا أمر الله وطاعة رسوله في وقتها، وطاعة الله, امتثال أمره في كل وقت, بحسب ذلك، وفي هذه الآية, دليل لمذهب أهل السنة والجماعة, أن الإيمان تدخل فيه أعمال الجوارح. وقوله: { إِنَّ اللَّهَ بِالنَّاسِ لَرَءُوفٌ رَحِيمٌ } أي: شديد الرحمة بهم عظيمها، فمن رأفته ورحمته بهم, أن يتم عليهم نعمته التي ابتدأهم بها، وأن ميَّزَ عنهم من دخل في الإيمان بلسانه دون قلبه، وأن امتحنهم امتحانا, زاد به إيمانهم, وارتفعت به درجتهم، وأن وجههم إلى أشرف البيوت, وأجلها.\n                                    "
      },
      "originalText": "وَكَذَٰلِكَ جَعَلۡنَٰكُمۡ أُمَّةٗ وَسَطٗا لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيۡكُمۡ شَهِيدٗاۗ وَمَا جَعَلۡنَا ٱلۡقِبۡلَةَ ٱلَّتِي كُنتَ عَلَيۡهَآ إِلَّا لِنَعۡلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ وَإِن كَانَتۡ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَٰنَكُمۡۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ ٣٤١"
    },
    {
      "number": 151,
      "text": "قَدْ نَرَىٰ تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ ۖ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا ۚ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۚ وَحَيْثُ مَا كُنْتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ ۗ وَإِنَّ الَّذِينَ أُوتُوا الْكِتَابَ لَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِنْ رَبِّهِمْ ۗ وَمَا اللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 144,
      "juz": 2,
      "manzil": 1,
      "page": 22,
      "ruku": 18,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَدۡ نَرَىٰ تَقَلُّبَ وَجۡهِكَ فِي ٱلسَّمَآءِۖ فَلَنُوَلِّيَنَّكَ قِبۡلَةٗ تَرۡضَىٰهَاۚ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥۗ وَإِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَيَعۡلَمُونَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا يَعۡمَلُونَ ٤٤١\n                                    \n                                    \n                                    قال علي بن أبي طلحة عن ابن عباس : كان أول ما نسخ من القرآن القبلة ، وذلك أن رسول الله صلى الله عليه وسلم لما هاجر إلى المدينة ، وكان أكثر أهلها اليهود ، فأمره الله أن يستقبل بيت المقدس ، ففرحت اليهود ، فاستقبلها رسول الله صلى الله عليه وسلم بضعة عشر شهرا ، وكان يحب قبلة إبراهيم فكان يدعو إلى الله وينظر إلى السماء ، فأنزل الله : ( قد نرى تقلب وجهك في السماء ) إلى قوله : ( فولوا وجوهكم شطره ) فارتاب من ذلك اليهود ، وقالوا : ( ما ولاهم عن قبلتهم التي كانوا عليها قل لله المشرق والمغرب [ يهدي من يشاء إلى صراط مستقيم ] ) وقال : ( فأينما تولوا فثم وجه الله ) [ البقرة : 115 ] وقال الله تعالى : ( وما جعلنا القبلة التي كنت عليها إلا لنعلم من يتبع الرسول ممن ينقلب على عقبيه )\nوروى ابن مردويه من حديث القاسم العمري ، عن عمه عبيد الله بن عمر ، عن داود بن الحصين ، عن عكرمة ، عن ابن عباس : قال : كان النبي صلى الله عليه وسلم إذا سلم من صلاته إلى بيت المقدس رفع رأسه إلى السماء فأنزل الله : ( فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام ) إلى الكعبة إلى الميزاب ، يؤم به جبرائيل عليه السلام .\nوروى الحاكم ، في مستدركه ، من حديث شعبة عن يعلى بن عطاء ، عن يحيى بن قمطة قال : رأيت عبد الله بن عمرو جالسا في المسجد الحرام ، بإزاء الميزاب ، فتلا هذه الآية : ( فلنولينك قبلة ترضاها ) قال : نحو ميزاب الكعبة .\nثم قال : صحيح الإسناد ، ولم يخرجاه .\nورواه ابن أبي حاتم ، عن الحسن بن عرفة ، عن هشيم ، عن يعلى بن عطاء ، به .\nوهكذا قال غيره ، وهو أحد قولي الشافعي ، رحمه الله : إن الغرض إصابة عين القبلة . والقول الآخر وعليه الأكثرون : أن المراد المواجهة كما رواه الحاكم من حديث محمد بن إسحاق ، عن عمير بن زياد الكندي ، عن علي ، رضي الله عنه ، ( فول وجهك شطر المسجد الحرام ) قال : شطره : قبله . ثم قال : صحيح الإسناد ولم يخرجاه .\nوهذا قول أبي العالية ، ومجاهد ، وعكرمة ، وسعيد بن جبير ، وقتادة ، والربيع بن أنس ، وغيرهم . وكما تقدم في الحديث الآخر : ما بين المشرق والمغرب قبلة .\n[ وقال القرطبي : روى ابن جريج عن عطاء عن ابن عباس أن رسول الله صلى الله عليه وسلم قال : \" ما بين المشرق والمغرب قبلة لأهل المسجد ، والمسجد قبلة لأهل الحرم ، والحرم قبلة لأهل الأرض في مشارقها ومغاربها من أمتي \" ] .\nوقال أبو نعيم الفضل بن دكين :\nحدثنا زهير ، عن أبي إسحاق ، عن البراء أن النبي صلى الله عليه وسلم صلى قبل بيت المقدس ستة عشر شهرا أو سبعة عشر شهرا ، وكان يعجبه قبلته قبل البيت وأنه صلى صلاة العصر ، وصلى معه قوم ، فخرج رجل ممن كان يصلي معه ، فمر على أهل المسجد وهم راكعون ، فقال : أشهد بالله لقد صليت مع رسول الله صلى الله عليه وسلم قبل مكة ، فداروا كما هم قبل البيت .\nوقال عبد الرزاق : أخبرنا إسرائيل ، عن أبي إسحاق ، عن البراء [ قال ] لما قدم رسول الله صلى الله عليه وسلم المدينة صلى نحو بيت المقدس ستة عشر شهرا أو سبعة عشر شهرا ، وكان رسول الله صلى الله عليه وسلم يحب أن يحول نحو الكعبة ، فنزلت : ( قد نرى تقلب وجهك في السماء [ فلنولينك قبلة ترضاها ] ) فصرف إلى الكعبة .\nوروى النسائي عن أبي سعيد بن المعلى قال : كنا نغدو إلى المسجد على عهد رسول الله صلى الله عليه وسلم ، فنمر على المسجد فنصلي فيه ، فمررنا يوما ورسول الله صلى الله عليه وسلم قاعد على المنبر فقلت : لقد حدث أمر ، فجلست ، فقرأ رسول الله صلى الله عليه وسلم هذه الآية : ( قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها ) حتى فرغ من الآية . فقلت لصاحبي : تعال نركع ركعتين قبل أن ينزل رسول الله صلى الله عليه وسلم فنكون أول من صلى ، فتوارينا فصليناهما . ثم نزل النبي صلى الله عليه وسلم فصلى للناس الظهر يومئذ .\nوكذا روى ابن مردويه ، عن ابن عمر : أن أول صلاة صلاها رسول الله صلى الله عليه وسلم إلى الكعبة صلاة الظهر ، وأنها الصلاة الوسطى . والمشهور أن أول صلاة صلاها إلى الكعبة صلاة العصر ، ولهذا تأخر الخبر عن أهل قباء إلى صلاة الفجر .\nوقال الحافظ أبو بكر بن مردويه : حدثنا سليمان بن أحمد ، حدثنا الحسين بن إسحاق التستري ، حدثنا رجاء بن محمد السقطي ، حدثنا إسحاق بن إدريس ، حدثنا إبراهيم بن جعفر ، حدثني أبي ، عن جدته أم أبيه نويلة بنت مسلم ، قالت : صلينا الظهر أو العصر في مسجد بني حارثة ، فاستقبلنا مسجد إيلياء فصلينا ركعتين ، ثم جاء من يحدثنا أن رسول الله صلى الله عليه وسلم قد استقبل البيت الحرام ، فتحول النساء مكان الرجال ، والرجال مكان النساء ، فصلينا السجدتين الباقيتين ، ونحن مستقبلون البيت الحرام . فحدثني رجل من بني حارثة أن النبي صلى الله عليه وسلم قال : \" أولئك رجال يؤمنون بالغيب \" .\nوقال ابن مردويه أيضا : حدثنا محمد بن علي بن دحيم ، حدثنا أحمد بن حازم ، حدثنا مالك بن إسماعيل النهدي ، حدثنا قيس ، عن زياد بن علاقة ، عن عمارة بن أوس قال : بينما نحن في الصلاة نحو بيت المقدس ، ونحن ركوع ، إذ أتى مناد بالباب : أن القبلة قد حولت إلى الكعبة . قال : فأشهد على إمامنا أنه انحرف فتحول هو والرجال والصبيان ، وهم ركوع ، نحو الكعبة .\nوقوله : ( وحيثما كنتم فولوا وجوهكم شطره ) أمر تعالى باستقبال الكعبة من جميع جهات الأرض ، شرقا وغربا وشمالا وجنوبا ، ولا يستثنى من هذا شيء ، سوى النافلة في حال السفر ، فإنه يصليها حيثما توجه قالبه ، وقلبه نحو الكعبة . وكذا في حال المسايفة في القتال يصلي على كل حال ، وكذا من جهل جهة القبلة يصلي باجتهاده ، وإن كان مخطئا في نفس الأمر ، لأن الله تعالى لا يكلف نفسا إلا وسعها .\nمسألة : وقد استدل المالكية بهذه الآية على أن المصلي ينظر أمامه لا إلى موضع سجوده كما ذهب إليه الشافعي وأحمد وأبو حنيفة ، قال المالكية لقوله : ( فول وجهك شطر المسجد الحرام ) فلو نظر إلى موضع سجوده لاحتاج أن يتكلف ذلك بنوع من الانحناء وهو ينافي كمال القيام . وقال بعضهم : ينظر المصلي في قيامه إلى صدره . وقال شريك القاضي : ينظر في حال قيامه إلى موضع سجوده كما قال جمهور الجماعة ، لأنه أبلغ في الخضوع وآكد في الخشوع وقد ورد به الحديث ، وأما في حال ركوعه فإلى موضع قدميه ، وفي حال سجوده إلى موضع أنفه وفي حال قعوده إلى حجره .\nوقوله : ( وإن الذين أوتوا الكتاب ليعلمون أنه الحق من ربهم ) أي : واليهود الذين أنكروا استقبالكم الكعبة وانصرافكم عن بيت المقدس يعلمون أن الله تعالى سيوجهك إليها ، بما في كتبهم عن أنبيائهم ، من النعت والصفة لرسول الله صلى الله عليه وسلم وأمته ، وما خصه الله تعالى به وشرفه من الشريعة الكاملة العظيمة ، ولكن أهل الكتاب يتكاتمون ذلك بينهم حسدا وكفرا وعنادا ; ولهذا يهددهم تعالى بقوله : ( وما الله بغافل عما يعملون ) .\n                                    ",
        "qortoby": "قَدۡ نَرَىٰ تَقَلُّبَ وَجۡهِكَ فِي ٱلسَّمَآءِۖ فَلَنُوَلِّيَنَّكَ قِبۡلَةٗ تَرۡضَىٰهَاۚ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥۗ وَإِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَيَعۡلَمُونَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا يَعۡمَلُونَ ٤٤١\n                                    \n                                    \n                                    قوله تعالى : قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام وحيثما كنتم فولوا وجوهكم شطره وإن الذين أوتوا الكتاب ليعلمون أنه الحق من ربهم وما الله بغافل عما يعملون\nقال العلماء : هذه الآية مقدمة في النزول على قوله تعالى : سيقول السفهاء من الناس . ومعنى تقلب وجهك : تحول وجهك إلى السماء ، قاله الطبري . الزجاج : تقلب عينيك في النظر إلى السماء ، والمعنى متقارب . وخص السماء بالذكر إذ هي مختصة بتعظيم ما أضيف إليها ويعود منها كالمطر والرحمة والوحي . ومعنى ترضاها تحبها . قال السدي : كان إذا صلى نحو بيت المقدس رفع رأسه إلى السماء ينظر ما يؤمر به ، وكان يحب أن يصلي إلى قبل الكعبة فأنزل الله تعالى : قد نرى تقلب وجهك في السماء . وروى أبو إسحاق عن البراء قال : كان رسول الله صلى الله عليه وسلم صلى نحو بيت المقدس ستة عشر شهرا أو سبعة عشر شهرا ، وقد كان رسول الله صلى الله عليه وسلم يحب أن يوجه نحو الكعبة ، فأنزل الله تعالى : قد نرى تقلب وجهك في السماء . وقد تقدم هذا المعنى والقول فيه ، والحمد لله .\nقوله تعالى : فول وجهك شطر المسجد الحرام فيه خمس مسائل : الأولى : قوله تعالى : فول أمر وجهك شطر أي ناحية المسجد الحرام يعني الكعبة ، ولا خلاف في هذا . قيل : حيال البيت كله ، عن ابن عباس . وقال ابن عمر : حيال الميزاب من الكعبة ، قاله ابن عطية . والميزاب : هو قبلة المدينة وأهل الشام ، وهناك قبلة أهل الأندلس .\nقلت : قد روى ابن جريج عن عطاء عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال : البيت قبلة لأهل المسجد والمسجد قبلة لأهل الحرم والحرم قبلة لأهل الأرض في مشارقها ومغاربها من أمتي .\nالثانية : قوله تعالى : شطر المسجد الحرام الشطر له محامل : يكون الناحية والجهة ، كما في هذه الآية ، وهو ظرف مكان ، كما تقول : تلقاءه وجهته . وانتصب الظرف لأنه فضلة بمنزلة المفعول [ به ] ، وأيضا فإن الفعل واقع فيه . وقال داود بن أبي هند : إن في حرف ابن مسعود \" فول وجهك تلقاء المسجد الحرام \" . وقال الشاعر [ هو أبو زنباع الجذامي ] :\nأقول لأم زنباع أقيمي صدور العيس شطر بني تميم\nوقال آخر :\nوقد أظلكم من شطر ثغركم هول له ظلم يغشاكم قطعا\nوقال آخر :\nألا من مبلغ عمرا رسولا وما تغني الرسالة شطر عمرو\nوشطر الشيء : نصفه ، ومنه الحديث : الطهور شطر الإيمان . ويكون من الأضداد ، يقال : شطر إلى كذا إذا أقبل نحوه ، وشطر عن كذا إذا أبعد منه وأعرض عنه . فأما الشاطر من الرجال فلأنه قد أخذ في نحو غير الاستواء ، وهو الذي أعيا أهله خبثا ، وقد شطر وشطر ( بالضم ) شطارة فيهما وسئل بعضهم عن الشاطر ، فقال : هو من أخذ في البعد عما نهى الله عنه .\nالثالثة : لا خلاف بين العلماء أن الكعبة قبلة في كل أفق وأجمعوا على أن من شاهدها وعاينها فرض عليه استقبالها ، وأنه إن ترك استقبالها وهو معاين لها وعالم بجهتها فلا صلاة له ، وعليه إعادة كل ما صلى ذكره أبو عمر . وأجمعوا على أن كل من غاب عنها أن يستقبل ناحيتها وشطرها وتلقاءها ، فإن خفيت عليه فعليه أن يستدل على ذلك بكل ما يمكنه من النجوم والرياح والجبال وغير ذلك مما يمكن أن يستدل به على ناحيتها . ومن جلس في المسجد الحرام فليكن وجهه إلى الكعبة وينظر إليها إيمانا واحتسابا ، فإنه يروى أن النظر إلى الكعبة عبادة ، قاله عطاء ومجاهد .\nالرابعة : واختلفوا هل فرض الغائب استقبال العين أو الجهة ، فمنهم من قال بالأول . قال ابن العربي : وهو ضعيف ; لأنه تكليف لما لا يصل إليه . ومنهم من قال بالجهة ، وهو الصحيح لثلاثة أوجه : الأول : أنه الممكن الذي يرتبط به التكليف . الثاني : أنه المأمور به في القرآن ، لقوله تعالى : فول وجهك شطر المسجد الحرام وحيثما كنتم يعني من الأرض من شرق أو غرب فولوا وجوهكم شطره . الثالث : أن العلماء احتجوا بالصف الطويل الذي يعلم قطعا أنه أضعاف عرض البيت .\nالخامسة : في هذه الآية حجة واضحة لما ذهب إليه مالك ومن وافقه في أن المصلي حكمه أن ينظر أمامه لا إلى موضع سجوده . وقال الثوري وأبو حنيفة والشافعي والحسن بن حي . يستحب أن يكون نظره إلى موضع سجوده . وقال شريك القاضي : ينظر في القيام إلى موضع السجود ، وفي الركوع إلى موضع قدميه ، وفي السجود إلى موضع أنفه ، وفي القعود إلى حجره . قال ابن العربي : إنما ينظر أمامه فإنه إن حنى رأسه ذهب بعض القيام المفترض عليه في الرأس وهو أشرف الأعضاء ، وإن أقام رأسه وتكلف النظر ببصره إلى الأرض فتلك مشقة عظيمة وحرج . وما جعل علينا في الدين من حرج ، أما إن ذلك أفضل لمن قدر عليه .\nقوله تعالى : وإن الذين أوتوا الكتاب يريد اليهود والنصارى ليعلمون أنه الحق من ربهم يعني تحويل القبلة من بيت المقدس . فإن قيل : كيف يعلمون ذلك وليس من دينهم ولا في كتابهم ؟ قيل عنه جوابان : أحدهما : أنهم لما علموا من كتابهم أن محمدا صلى الله عليه وسلم نبي علموا أنه لا يقول إلا الحق ولا يأمر إلا به . الثاني : أنهم علموا من دينهم جواز النسخ وإن جحده بعضهم ، فصاروا عالمين بجواز القبلة .\nقوله تعالى : وما الله بغافل عما يعملون تقدم معناه . وقرأ ابن عامر وحمزة والكسائي \" تعملون \" بالتاء على مخاطبة أهل الكتاب أو أمة محمد صلى الله عليه وسلم . وعلى الوجهين فهو إعلام بأن الله تعالى لا يهمل أعمال العباد ولا يغفل عنها ، وضمنه الوعيد . وقرأ الباقون بالياء من تحت .\n                                    ",
        "saadi": "قَدۡ نَرَىٰ تَقَلُّبَ وَجۡهِكَ فِي ٱلسَّمَآءِۖ فَلَنُوَلِّيَنَّكَ قِبۡلَةٗ تَرۡضَىٰهَاۚ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥۗ وَإِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَيَعۡلَمُونَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا يَعۡمَلُونَ ٤٤١\n                                        \n                                        \n                                        \n                                        يقول الله لنبيه: { قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ } أي: كثرة تردده في جميع جهاته, شوقا وانتظارا لنزول الوحي باستقبال الكعبة، وقال: { وَجْهِكَ } ولم يقل: \" بصرك \" لزيادة اهتمامه, ولأن تقليب الوجه مستلزم لتقليب البصر. { فَلَنُوَلِّيَنَّكَ } أي: نوجهك لولايتنا إياك، { قِبْلَةً تَرْضَاهَا } أي: تحبها, وهي الكعبة، وفي هذا بيان لفضله وشرفه صلى الله عليه وسلم, حيث إن الله تعالى يسارع في رضاه, ثم صرح له باستقبالها فقال: { فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ } والوجه: ما أقبل من بدن الإنسان، { وَحَيْثُمَا كُنْتُمْ } أي: من بر وبحر, وشرق وغرب, جنوب وشمال. { فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ } أي: جهته. ففيها اشتراط استقبال الكعبة, للصلوات كلها, فرضها, ونفلها, وأنه إن أمكن استقبال عينها, وإلا فيكفي شطرها وجهتها، وأن الالتفات بالبدن, مبطل للصلاة, لأن الأمر بالشيء نهي عن ضده، ولما ذكر تعالى فيما تقدم, المعترضين على ذلك من أهل الكتاب وغيرهم، وذكر جوابهم, ذكر هنا, أن أهل الكتاب والعلم منهم, يعلمون أنك في ذلك على حق وأمر، لما يجدونه في كتبهم, فيعترضون عنادا وبغيا، فإذا كانوا يعلمون بخطئهم فلا تبالوا بذلك، فإن الإنسان إنما يغمه اعتراض من اعترض عليه, إذا كان الأمر مشتبها, وكان ممكنا أن يكون معه صواب. فأما إذا تيقن أن الصواب والحق مع المعترض عليه, وأن المعترض معاند, عارف ببطلان قوله, فإنه لا محل للمبالاة, بل ينتظر بالمعترض العقوبة الدنيوية والأخروية, فلهذا قال تعالى: { وَمَا اللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ } بل يحفظ عليهم أعمالهم, ويجازيهم عليها، وفيها وعيد للمعترضين, وتسلية للمؤمنين.\n                                    "
      },
      "originalText": "قَدۡ نَرَىٰ تَقَلُّبَ وَجۡهِكَ فِي ٱلسَّمَآءِۖ فَلَنُوَلِّيَنَّكَ قِبۡلَةٗ تَرۡضَىٰهَاۚ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥۗ وَإِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَيَعۡلَمُونَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا يَعۡمَلُونَ ٤٤١"
    },
    {
      "number": 152,
      "text": "وَلَئِنْ أَتَيْتَ الَّذِينَ أُوتُوا الْكِتَابَ بِكُلِّ آيَةٍ مَا تَبِعُوا قِبْلَتَكَ ۚ وَمَا أَنْتَ بِتَابِعٍ قِبْلَتَهُمْ ۚ وَمَا بَعْضُهُمْ بِتَابِعٍ قِبْلَةَ بَعْضٍ ۚ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ مِنْ بَعْدِ مَا جَاءَكَ مِنَ الْعِلْمِ ۙ إِنَّكَ إِذًا لَمِنَ الظَّالِمِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 145,
      "juz": 2,
      "manzil": 1,
      "page": 22,
      "ruku": 18,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَئِنۡ أَتَيۡتَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ بِكُلِّ ءَايَةٖ مَّا تَبِعُواْ قِبۡلَتَكَۚ وَمَآ أَنتَ بِتَابِعٖ قِبۡلَتَهُمۡۚ وَمَا بَعۡضُهُم بِتَابِعٖ قِبۡلَةَ بَعۡضٖۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم مِّنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ إِنَّكَ إِذٗا لَّمِنَ ٱلظَّٰلِمِينَ ٥٤١\n                                    \n                                    \n                                    يخبر تعالى عن كفر اليهود وعنادهم ، ومخالفتهم ما يعرفونه من شأن رسول الله صلى الله عليه وسلم ، وأنه لو أقام عليهم كل دليل على صحة ما جاءهم به ، لما اتبعوه وتركوا أهواءهم كما قال تعالى : ( إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم ) [ يونس : 96 ، 97 ] ولهذا قال هاهنا : ( ولئن أتيت الذين أوتوا الكتاب بكل آية ما تبعوا قبلتك ) .\nوقوله ( وما أنت بتابع قبلتهم [ وما بعضهم بتابع قبلة بعض ] ) إخبار عن شدة متابعة الرسول صلى الله عليه وسلم لما أمره الله تعالى به ، وأنه كما هم مستمسكون بآرائهم وأهوائهم ، فهو أيضا مستمسك بأمر الله وطاعته واتباع مرضاته ، وأنه لا يتبع أهواءهم في جميع أحواله ، وما كان متوجها إلى بيت المقدس ; لأنها قبلة اليهود ، وإنما ذلك عن أمر الله تعالى . ثم حذر [ الله ] تعالى عن مخالفة الحق الذي يعلمه العالم إلى الهوى ; فإن العالم الحجة عليه أقوم من غيره . ولهذا قال مخاطبا للرسول ، والمراد الأمة : ( ولئن أتيت الذين أوتوا الكتاب بكل آية ما تبعوا قبلتك وما أنت بتابع قبلتهم وما بعضهم بتابع قبلة بعض ولئن اتبعت أهواءهم من بعد ما جاءك من العلم إنك إذا لمن الظالمين ) [ البقرة : 145 ]\n                                    ",
        "qortoby": "وَلَئِنۡ أَتَيۡتَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ بِكُلِّ ءَايَةٖ مَّا تَبِعُواْ قِبۡلَتَكَۚ وَمَآ أَنتَ بِتَابِعٖ قِبۡلَتَهُمۡۚ وَمَا بَعۡضُهُم بِتَابِعٖ قِبۡلَةَ بَعۡضٖۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم مِّنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ إِنَّكَ إِذٗا لَّمِنَ ٱلظَّٰلِمِينَ ٥٤١\n                                    \n                                    \n                                    قوله تعالى : ولئن أتيت الذين أوتوا الكتاب بكل آية ما تبعوا قبلتك وما أنت بتابع قبلتهم وما بعضهم بتابع قبلة بعض ولئن اتبعت أهواءهم من بعد ما جاءك من العلم إنك إذا لمن الظالمين\nقوله تعالى : ولئن أتيت الذين أوتوا الكتاب بكل آية ما تبعوا قبلتك لأنهم كفروا وقد تبين لهم الحق ، وليس تنفعهم الآيات ، أي العلامات . وجمع قبلة في التكسير : قبل . وفي التسليم : قبلات . ويجوز أن تبدل من الكسرة فتحة ، فتقول قبلات . ويجوز أن تحذف الكسرة وتسكن الباء فتقول قبلات . وأجيبت \" لئن \" بجواب \" لو \" وهي ضدها في أن \" لو \" تطلب في جوابها المضي والوقوع ، و \" لئن \" تطلب الاستقبال ، فقال الفراء والأخفش : أجيبت بجواب \" لو \" لأن المعنى : ولو أتيت . وكذلك تجاب \" لو \" بجواب \" لئن \" ، تقول : لو أحسنت أحسن إليك ، ومثله قوله تعالى : ولئن أرسلنا ريحا فرأوه مصفرا لظلوا أي ولو أرسلنا ريحا . وخالفهما سيبويه فقال : إن معنى لئن مخالف لمعنى \" لو \" فلا يدخل واحد منهما على الآخر ، فالمعنى : ولئن أتيت الذين أوتوا الكتاب بكل آية لا يتبعون قبلتك . قال سيبويه : ومعنى ولئن أرسلنا ريحا فرأوه مصفرا لظلوا ليظلن .\nقوله تعالى : وما أنت بتابع قبلتهم لفظ خبر ويتضمن الأمر ، أي فلا تركن إلى شيء من ذلك ثم أخبر تعالى أن اليهود ليست متبعة قبلة النصارى ولا النصارى متبعة قبلة اليهود ، عن السدي وابن زيد . فهذا إعلام باختلافهم وتدابرهم وضلالهم . وقال قوم : المعنى وما من اتبعك ممن أسلم منهم بمتبع قبلة من لم يسلم ، ولا من لم يسلم قبلة من أسلم . والأول أظهر ، والله تعالى أعلم .\nقوله تعالى : ولئن اتبعت أهواءهم من بعد ما جاءك من العلم إنك إذا لمن الظالمين الخطاب للنبي صلى الله عليه وسلم ، والمراد أمته ممن يجوز أن يتبع هواه فيصير باتباعه ظالما ، وليس يجوز أن يفعل النبي صلى الله عليه وسلم ما يكون به ظالما ، فهو محمول على إرادة أمته لعصمة النبي صلى الله عليه وسلم وقطعنا أن ذلك لا يكون منه ، وخوطب النبي صلى الله عليه وسلم تعظيما للأمر ولأنه المنزل عليه . والأهواء : جمع هوى ، وقد تقدم ، وكذا من العلم تقدم أيضا ، فلا معنى للإعادة\n                                    ",
        "saadi": "وَلَئِنۡ أَتَيۡتَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ بِكُلِّ ءَايَةٖ مَّا تَبِعُواْ قِبۡلَتَكَۚ وَمَآ أَنتَ بِتَابِعٖ قِبۡلَتَهُمۡۚ وَمَا بَعۡضُهُم بِتَابِعٖ قِبۡلَةَ بَعۡضٖۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم مِّنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ إِنَّكَ إِذٗا لَّمِنَ ٱلظَّٰلِمِينَ ٥٤١\n                                        \n                                        \n                                        \n                                        كان النبي صلى الله عليه وسلم من كمال حرصه على هداية الخلق يبذل لهم غاية ما يقدر عليه من النصيحة, ويتلطف بهدايتهم, ويحزن إذا لم ينقادوا لأمر الله، فكان من الكفار, من تمرد عن أمر الله, واستكبر على رسل الله, وترك الهدى, عمدا وعدوانا، فمنهم: اليهود والنصارى, أهل الكتاب الأول, الذين كفروا بمحمد صلى الله عليه وسلم عن يقين, لا عن جهل، فلهذا أخبره الله تعالى أنك لو { أَتَيْتَ الَّذِينَ أُوتُوا الْكِتَابَ بِكُلِّ آيَةٍ } أي: بكل برهان ودليل يوضح قولك ويبين ما تدعو إليه، { مَا تَبِعُوا قِبْلَتَكَ } أي: ما تبعوك, لأن اتباع القبلة, دليل على اتباعه، ولأن السبب هو شأن القبلة، وإنما كان الأمر كذلك, لأنهم معاندون, عرفوا الحق وتركوه، فالآيات إنما تفيد وينتفع بها من يتطلب الحق, وهو مشتبه عليه, فتوضح له الآيات البينات، وأما من جزم بعدم اتباع الحق, فلا حيلة فيه. وأيضا فإن اختلافهم فيما بينهم, حاصل, وبعضهم, غير تابع قبلة بعض، فليس بغريب منهم مع ذلك أن لا يتبعوا قبلتك يا محمد, وهم الأعداء حقيقة الحسدة، وقوله: { وَمَا أَنْتَ بِتَابِعٍ قِبْلَتَهُمْ } أبلغ من قوله: \" وَلَا تَتَّبِعْ \" لأن ذلك يتضمن أنه صلى الله عليه وسلم اتصف بمخالفتهم, فلا يمكن وقوع ذلك منه، ولم يقل: \" ولو أتوا بكل آية \" لأنهم لا دليل لهم على قولهم. وكذلك إذا تبين الحق بأدلته اليقينية, لم يلزم الإتيان بأجوبة الشبه الواردة عليه, لأنها لا حد لها, ولأنه يعلم بطلانها, للعلم بأن كل ما نافى الحق الواضح, فهو باطل, فيكون حل الشبه من باب التبرع. { وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ } إنما قال: \" أهواءهم \" ولم يقل \" دينهم \" لأن ما هم عليه مجرد أهوية نفس, حتى هم في قلوبهم يعلمون أنه ليس بدين، ومن ترك الدين, اتبع الهوى ولا محالة، قال تعالى: { أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَهَهُ هَوَاهُ } { مِنْ بَعْدِ مَا جَاءَكَ مِنَ الْعِلْمِ } بأنك على الحق, وهم على الباطل، { إِنَّكَ إِذًا } أي: إن اتبعتهم, فهذا احتراز, لئلا تنفصل هذه الجملة عما قبلها, ولو في الأفهام، { لَمِنَ الظَّالِمِينَ } أي: داخل فيهم, ومندرج في جملتهم، وأي ظلم أعظم, من ظلم, من علم الحق والباطل, فآثر الباطل على الحق، وهذا, وإن كان الخطاب له صلى الله عليه وسلم, فإن أمته داخلة في ذلك، وأيضا, فإذا كان هو صلى الله عليه وسلم لو فعل ذلك -وحاشاه- صار ظالما مع علو مرتبته, وكثرة حسناته فغيره من باب أولى وأحرى.\n                                    "
      },
      "originalText": "وَلَئِنۡ أَتَيۡتَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ بِكُلِّ ءَايَةٖ مَّا تَبِعُواْ قِبۡلَتَكَۚ وَمَآ أَنتَ بِتَابِعٖ قِبۡلَتَهُمۡۚ وَمَا بَعۡضُهُم بِتَابِعٖ قِبۡلَةَ بَعۡضٖۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم مِّنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ إِنَّكَ إِذٗا لَّمِنَ ٱلظَّٰلِمِينَ ٥٤١"
    }
  ]
}