{
  "number": 223,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 1486,
      "text": "أَمْ يَقُولُونَ افْتَرَاهُ ۖ قُلْ فَأْتُوا بِعَشْرِ سُوَرٍ مِثْلِهِ مُفْتَرَيَاتٍ وَادْعُوا مَنِ اسْتَطَعْتُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ",
      "surah": {
        "number": 11,
        "name": "سورة هود",
        "englishName": "Hud",
        "englishNameTranslation": "Hud",
        "revelationType": "Meccan",
        "numberOfAyahs": 123
      },
      "numberInSurah": 13,
      "juz": 12,
      "manzil": 3,
      "page": 223,
      "ruku": 184,
      "hizbQuarter": 89,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِعَشۡرِ سُوَرٖ مِّثۡلِهِۦ مُفۡتَرَيَٰتٖ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ ٣١\n                                    \n                                    \n                                    ثم بين تعالى إعجاز القرآن ، وأنه لا يستطيع البشر الإتيان بمثله ، ولا بعشر سور [ من ] مثله ، ولا بسورة من مثله; لأن كلام الرب لا يشبهه كلام المخلوقين ، كما أن صفاته لا تشبه صفات المحدثات ، وذاته لا يشبهها شيء ، تعالى وتقدس وتنزه ، لا إله إلا هو ولا رب سواه .\n                                    ",
        "qortoby": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِعَشۡرِ سُوَرٖ مِّثۡلِهِۦ مُفۡتَرَيَٰتٖ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ ٣١\n                                    \n                                    \n                                    أم يقولون افتراه قل فأتوا بعشر سور مثله مفتريات \" أم \" بمعنى بل ، وقد تقدم في \" يونس \" أي قد أزحت علتهم وإشكالهم في نبوتك بهذا القرآن ، وحججتهم به ; فإن قالوا : افتريته - أي اختلقته - فليأتوا بمثله مفترى بزعمهم .\nوادعوا من استطعتم من دون الله أي من الكهنة والأعوان .\n                                    ",
        "saadi": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِعَشۡرِ سُوَرٖ مِّثۡلِهِۦ مُفۡتَرَيَٰتٖ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ ٣١\n                                        \n                                        \n                                        \n                                        { أَمْ يَقُولُونَ افْتَرَاهُ } أي: افترى محمد هذا القرآن؟\nفأجابهم بقوله: { قُلْ } لهم { فَأْتُوا بِعَشْرِ سُوَرٍ مِثْلِهِ مُفْتَرَيَاتٍ وَادْعُوا مَنِ اسْتَطَعْتُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ } أنه قد افتراه ، فإنه لا فرق بينكم وبينه في الفصاحة والبلاغة، وأنتم الأعداء حقا، الحريصون بغاية ما يمكنكم على إبطال دعوته، فإن كنتم صادقين، فأتوا بعشر سور مثله مفتريات.\n                                    "
      },
      "originalText": "أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِعَشۡرِ سُوَرٖ مِّثۡلِهِۦ مُفۡتَرَيَٰتٖ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ ٣١"
    },
    {
      "number": 1487,
      "text": "فَإِلَّمْ يَسْتَجِيبُوا لَكُمْ فَاعْلَمُوا أَنَّمَا أُنْزِلَ بِعِلْمِ اللَّهِ وَأَنْ لَا إِلَٰهَ إِلَّا هُوَ ۖ فَهَلْ أَنْتُمْ مُسْلِمُونَ",
      "surah": {
        "number": 11,
        "name": "سورة هود",
        "englishName": "Hud",
        "englishNameTranslation": "Hud",
        "revelationType": "Meccan",
        "numberOfAyahs": 123
      },
      "numberInSurah": 14,
      "juz": 12,
      "manzil": 3,
      "page": 223,
      "ruku": 184,
      "hizbQuarter": 89,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِلَّمۡ يَسۡتَجِيبُواْ لَكُمۡ فَٱعۡلَمُوٓاْ أَنَّمَآ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّآ إِلَٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ ٤١\n                                    \n                                    \n                                    ثم قال تعالى : ( فإن لم يستجيبوا لكم ) أي : فإن لم يأتوا بمعارضة ما دعوتموهم إليه ، فاعلموا أنهم عاجزون عن ذلك ، وأن هذا الكلام منزل من عند الله ، متضمن علمه وأمره ونهيه ، ( وأن لا إله إلا هو فهل أنتم مسلمون ) .\n                                    ",
        "qortoby": "فَإِلَّمۡ يَسۡتَجِيبُواْ لَكُمۡ فَٱعۡلَمُوٓاْ أَنَّمَآ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّآ إِلَٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ ٤١\n                                    \n                                    \n                                    قوله تعالى : فإن لم يستجيبوا لكم فاعلموا أنما أنزل بعلم الله وأن لا إله إلا هو فهل أنتم مسلمون\nقوله تعالى : فإن لم يستجيبوا لكم أي في المعارضة ولم تتهيأ لهم فقد قامت عليهم الحجة ; إذ هم اللسن البلغاء ، وأصحاب الألسن الفصحاء . فاعلموا أنما أنزل بعلم الله واعلموا صدق محمد - صلى الله عليه وسلم - \" و \" اعلموا \" أن لا إله إلا هو فهل أنتم مسلمون \" استفهام معناه الأمر ، وقد تقدم القول في معنى هذه الآية ، وأن القرآن معجز في مقدمة الكتاب . والحمد لله .\nوقال : قل فأتوا وبعده . فإن لم يستجيبوا لكم ولم يقل لك ; فقيل : هو على تحويل المخاطبة من الإفراد إلى الجمع تعظيما وتفخيما ; وقد يخاطب الرئيس بما يخاطب به الجماعة . وقيل : الضمير في \" لكم \" وفي \" فاعلموا \" للجميع ، أي فليعلم الجميع أنما أنزل بعلم الله ; قاله مجاهد . وقيل : الضمير في \" لكم \" وفي \" فاعلموا \" للمشركين ; والمعنى : فإن لم يستجب لكم من تدعونه إلى المعاونة ; ولا تهيأت لكم المعارضة فاعلموا أنما أنزل بعلم الله . وقيل : الضمير في \" لكم \" للنبي - صلى الله عليه وسلم - وللمؤمنين ، وفي \" فاعلموا \" للمشركين .\n                                    ",
        "saadi": "فَإِلَّمۡ يَسۡتَجِيبُواْ لَكُمۡ فَٱعۡلَمُوٓاْ أَنَّمَآ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّآ إِلَٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ ٤١\n                                        \n                                        \n                                        \n                                        { فَإِنْ لَمْ يَسْتَجِيبُوا لَكُمْ } على شيء من ذلكم { فَاعْلَمُوا أَنَّمَا أُنْزِلَ بِعِلْمِ اللَّهِ } [من عند الله] لقيام الدليل والمقتضي، وانتفاء المعارض.\n{ وَأَنْ لَا إِلَهَ إِلَّا هُوَ } أي: واعلموا أَنَّهُ لَا إِلَهَ إِلَّا هُوَ أي: هو وحده المستحق للألوهية والعبادة، { فَهَلْ أَنْتُمْ مُسْلِمُونَ } أي: منقادون لألوهيته، مستسلمون لعبوديته، وفي هذه الآيات إرشاد إلى أنه لا ينبغي للداعي إلى الله أن يصده اعتراض المعترضين، ولا قدح القادحين.\nخصوصا إذا كان القدح لا مستند له، ولا يقدح فيما دعا إليه، وأنه لا يضيق صدره، بل يطمئن بذلك، ماضيا على أمره، مقبلا على شأنه، وأنه لا يجب إجابة اقتراحات المقترحين للأدلة التي يختارونها. بل يكفي إقامة الدليل السالم عن المعارض، على جميع المسائل والمطالب. وفيها أن هذا القرآن، معجز بنفسه، لا يقدر أحد من البشر أن يأتي بمثله، ولا بعشر سور من مثله، بل ولا بسورة من مثله، لأن الأعداء البلغاء الفصحاء، تحداهم الله بذلك، فلم يعارضوه، لعلمهم أنهم لا قدرة فيهم على ذلك.\nوفيها: أن مما يطلب فيه العلم، ولا يكفي غلبة الظن، علم القرآن، وعلم التوحيد، لقوله تعالى: { فَاعْلَمُوا أَنَّمَا أُنْزِلَ بِعِلْمِ اللَّهِ وَأَنْ لَا إِلَهَ إِلَّا هُوَ }\n                                    "
      },
      "originalText": "فَإِلَّمۡ يَسۡتَجِيبُواْ لَكُمۡ فَٱعۡلَمُوٓاْ أَنَّمَآ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّآ إِلَٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ ٤١"
    },
    {
      "number": 1488,
      "text": "مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لَا يُبْخَسُونَ",
      "surah": {
        "number": 11,
        "name": "سورة هود",
        "englishName": "Hud",
        "englishNameTranslation": "Hud",
        "revelationType": "Meccan",
        "numberOfAyahs": 123
      },
      "numberInSurah": 15,
      "juz": 12,
      "manzil": 3,
      "page": 223,
      "ruku": 184,
      "hizbQuarter": 89,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَن كَانَ يُرِيدُ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا نُوَفِّ إِلَيۡهِمۡ أَعۡمَٰلَهُمۡ فِيهَا وَهُمۡ فِيهَا لَا يُبۡخَسُونَ ٥١\n                                    \n                                    \n                                    قال العوفي ، عن ابن عباس ، في هذه الآية : إن أهل الرياء يعطون بحسناتهم في الدنيا ، وذلك أنهم لا يظلمون نقيرا ، يقول : من عمل صالحا التماس الدنيا ، صوما أو صلاة أو تهجدا بالليل ، لا يعمله إلا التماس الدنيا ، يقول الله : أوفيه الذي التمس في الدنيا من المثابة ، وحبط عمله الذي كان يعمله التماس الدنيا ، وهو في الآخرة من الخاسرين .\nوهكذا روي عن مجاهد ، والضحاك ، وغير واحد .\nوقال أنس بن مالك ، والحسن : نزلت في اليهود والنصارى . وقال مجاهد وغيره : نزلت في أهل الرياء .\nوقال قتادة : من كانت الدنيا همه وسدمه وطلبته ونيته ، جازاه الله بحسناته في الدنيا ، ثم يفضي إلى الآخرة وليس له حسنة يعطى بها جزاء . وأما المؤمن فيجازى بحسناته في الدنيا ويثاب عليها في الآخرة .\nوقد ورد في الحديث المرفوع نحو من هذا .\n                                    ",
        "qortoby": "مَن كَانَ يُرِيدُ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا نُوَفِّ إِلَيۡهِمۡ أَعۡمَٰلَهُمۡ فِيهَا وَهُمۡ فِيهَا لَا يُبۡخَسُونَ ٥١\n                                    \n                                    \n                                    قوله تعالى : من كان يريد الحياة الدنيا وزينتها نوف إليهم أعمالهم فيها وهم فيها لا يبخسون\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : \" من كان \" كان زائدة ، ولهذا جزم بالجواب فقال : نوف إليهم قاله الفراء . وقال الزجاج : \" من كان \" في موضع جزم بالشرط ، وجوابه نوف إليهم أي من يكن يريد ; والأول في اللفظ ماض والثاني مستقبل ، كما قال زهير :\nومن هاب أسباب المنية يلقها ولو رام أسباب السماء بسلم\nواختلف العلماء في تأويل هذه الآية ; فقيل : نزلت في الكفار ; قاله الضحاك ، واختاره النحاس ; بدليل الآية التي بعدها أولئك الذين ليس لهم في الآخرة إلا النار أي من أتى منهم بصلة رحم أو صدقة نكافئه بها في الدنيا ، بصحة الجسم ، وكثرة الرزق ، لكن لا حسنة له في الآخرة . وقد تقدم هذا المعنى في \" براءة \" مستوفى . وقيل : المراد بالآية المؤمنون ; أي من أراد بعمله ثواب الدنيا عجل له الثواب ولم ينقص شيئا في الدنيا ، وله في الآخرة العذاب لأنه جرد قصده إلى الدنيا ، وهذا كما قال - صلى الله عليه وسلم - : إنما الأعمال بالنيات فالعبد إنما يعطى على وجه قصده ، وبحكم ضميره ; وهذا أمر متفق عليه في الأمم بين كل ملة . وقيل : هو لأهل الرياء ; وفي الخبر أنه يقال لأهل الرياء : صمتم وصليتم وتصدقتم وجاهدتم وقرأتم ليقال ذلك فقد قيل ذلك ثم قال : إن هؤلاء أول من تسعر بهم النار . رواه أبو هريرة ، ثم بكى بكاء شديدا وقال : صدق رسول الله - صلى الله عليه وسلم - من كان يريد الحياة الدنيا وزينتها وقرأ الآيتين ، . خرجه مسلم [ في صحيحه ] بمعناه والترمذي أيضا . وقيل : الآية عامة في كل من ينوي بعمله غير الله تعالى ، كان معه أصل إيمان أو لم يكن ; قاله مجاهد وميمون بن مهران ، وإليه ذهب معاوية - رحمه الله تعالى - . وقال ميمون بن مهران : ليس أحد يعمل حسنة إلا وفي ثوابها ; فإن كان مسلما مخلصا وفي في الدنيا والآخرة ، وإن كان كافرا وفي في الدنيا . وقيل : من كان يريد الدنيا بغزوه مع النبي - صلى الله عليه وسلم - وفيها ، أي وفي أجر الغزاة ولم ينقص منها ; وهذا خصوص والصحيح العموم .\nالثانية : قال بعض العلماء : معنى هذه الآية قوله - عليه السلام - : إنما الأعمال بالنيات وتدلك هذه الآية على أن من صام في رمضان لا عن رمضان لا يقع عن رمضان ، وتدل على أن من توضأ للتبرد والتنظف لا يقع قربة عن جهة الصلاة ، وهكذا كل ما كان في معناه .\nالثالثة : ذهب أكثر العلماء إلى أن هذه الآية مطلقة ; وكذلك الآية التي في \" الشورى \" من كان يريد حرث الآخرة نزد له في حرثه ومن كان يريد حرث الدنيا نؤته منها الآية . وكذلك ومن يرد ثواب الدنيا نؤته منها قيدها وفسرها التي في سبحان من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد إلى قوله : محظورا فأخبر سبحانه أن العبد ينوي ويريد والله سبحانه يحكم ما يريد ، وروى الضحاك عن ابن عباس - رضي الله عنهما - في قوله : من كان يريد الحياة الدنيا أنها منسوخة بقوله : من كان يريد العاجلة . والصحيح ما ذكرناه ; وأنه من باب الإطلاق والتقييد ; ومثله قوله : وإذا سألك عبادي عني فإني قريب أجيب دعوة الداع إذا دعان فهذا ظاهره خبر عن إجابة كل داع دائما على كل حال ، وليس كذلك ; لقوله تعالى : فيكشف ما تدعون إليه إن شاء والنسخ في الأخبار لا يجوز ; لاستحالة تبدل الواجبات العقلية ، ولاستحالة الكذب على الله تعالى فأما الأخبار عن الأحكام الشرعية فيجوز نسخها على خلاف فيه ، على ما هو مذكور في الأصول ; ويأتي في \" النحل \" بيانه إن شاء الله تعالى .\n                                    ",
        "saadi": "مَن كَانَ يُرِيدُ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا نُوَفِّ إِلَيۡهِمۡ أَعۡمَٰلَهُمۡ فِيهَا وَهُمۡ فِيهَا لَا يُبۡخَسُونَ ٥١\n                                        \n                                        \n                                        \n                                        يقول تعالى: { مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا } أي: كل إرادته مقصورة على الحياة الدنيا، وعلى زينتها من النساء والبنين، والقناطير المقنطرة، من الذهب، والفضة، والخيل المسومة، والأنعام والحرث. قد صرف رغبته وسعيه وعمله في هذه الأشياء، ولم يجعل لدار القرار من إرادته شيئا، فهذا لا يكون إلا كافرا، لأنه لو كان مؤمنا، لكان ما معه من الإيمان يمنعه أن تكون جميع إرادته للدار الدنيا، بل نفس إيمانه وما تيسر له من الأعمال أثر من آثار إرادته الدار الآخرة.\nولكن هذا الشقي، الذي كأنه خلق للدنيا وحدها { نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا } أي: نعطيهم ما قسم لهم في أم الكتاب من ثواب الدنيا.\n{ وَهُمْ فِيهَا لَا يُبْخَسُونَ } أي: لا ينقصون شيئا مما قدر لهم، ولكن هذا منتهى نعيمهم.\n                                    "
      },
      "originalText": "مَن كَانَ يُرِيدُ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا نُوَفِّ إِلَيۡهِمۡ أَعۡمَٰلَهُمۡ فِيهَا وَهُمۡ فِيهَا لَا يُبۡخَسُونَ ٥١"
    },
    {
      "number": 1489,
      "text": "أُولَٰئِكَ الَّذِينَ لَيْسَ لَهُمْ فِي الْآخِرَةِ إِلَّا النَّارُ ۖ وَحَبِطَ مَا صَنَعُوا فِيهَا وَبَاطِلٌ مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 11,
        "name": "سورة هود",
        "englishName": "Hud",
        "englishNameTranslation": "Hud",
        "revelationType": "Meccan",
        "numberOfAyahs": 123
      },
      "numberInSurah": 16,
      "juz": 12,
      "manzil": 3,
      "page": 223,
      "ruku": 184,
      "hizbQuarter": 89,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أُوْلَٰٓئِكَ ٱلَّذِينَ لَيۡسَ لَهُمۡ فِي ٱلۡأٓخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ٦١\n                                    \n                                    \n                                    وقال تعالى : ( من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها مذموما مدحورا ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكورا كلا نمد هؤلاء وهؤلاء من عطاء ربك وما كان عطاء ربك محظورا انظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا ) [ الإسراء : 18 - 21 ] ، وقال تعالى : ( من كان يريد حرث الآخرة نزد له في حرثه ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب ) [ الشورى : 20 ] .\n                                    ",
        "qortoby": "أُوْلَٰٓئِكَ ٱلَّذِينَ لَيۡسَ لَهُمۡ فِي ٱلۡأٓخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ٦١\n                                    \n                                    \n                                    قوله تعالى : أولئك الذين ليس لهم في الآخرة إلا النار وحبط ما صنعوا فيها وباطل ما كانوا يعملون\nقوله تعالى : أولئك الذين ليس لهم في الآخرة إلا النار إشارة إلى التخليد ، والمؤمن لا يخلد ; لقوله تعالى : إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك الآية . فهو محمول على ما لو كانت موافاة هذا المرائي على الكفر . وقيل : المعنى ليس لهم إلا النار في أيام معلومة ثم يخرج ; إما بالشفاعة ، وإما بالقبضة . والآية تقتضي الوعيد بسلب الإيمان ; وفي الحديث الماضي يريد الكفر وخاصة الرياء ، إذ هو شرك على ما تقدم بيانه في \" النساء \" ويأتي في آخر \" الكهف \" .\nوباطل ما كانوا يعملون ابتداء وخبر ، قال أبو حاتم : وحذف الهاء ; قال النحاس : هذا لا يحتاج إلى حذف ; لأنه بمعنى المصدر ; أي وباطل عمله . وفي حرف أبي وعبد الله \" وباطلا ما كانوا يعملون \" وتكون ما زائدة ; أي وكانوا يعملون باطلا .\n                                    ",
        "saadi": "أُوْلَٰٓئِكَ ٱلَّذِينَ لَيۡسَ لَهُمۡ فِي ٱلۡأٓخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ٦١\n                                        \n                                        \n                                        \n                                        { أُولَئِكَ الَّذِينَ لَيْسَ لَهُمْ فِي الْآخِرَةِ إِلَّا النَّارُ } خالدين فيها أبدا، لا يفتَّر عنهم العذاب، وقد حرموا جزيل الثواب.\n{ وَحَبِطَ مَا صَنَعُوا فِيهَا } أي: في الدنيا، أي: بطل واضمحل ما عملوه مما يكيدون به الحق وأهله، وما عملوه من أعمال الخير التي لا أساس لها، ولا وجود لشرطها، وهو الإيمان.\n                                    "
      },
      "originalText": "أُوْلَٰٓئِكَ ٱلَّذِينَ لَيۡسَ لَهُمۡ فِي ٱلۡأٓخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ٦١"
    },
    {
      "number": 1490,
      "text": "أَفَمَنْ كَانَ عَلَىٰ بَيِّنَةٍ مِنْ رَبِّهِ وَيَتْلُوهُ شَاهِدٌ مِنْهُ وَمِنْ قَبْلِهِ كِتَابُ مُوسَىٰ إِمَامًا وَرَحْمَةً ۚ أُولَٰئِكَ يُؤْمِنُونَ بِهِ ۚ وَمَنْ يَكْفُرْ بِهِ مِنَ الْأَحْزَابِ فَالنَّارُ مَوْعِدُهُ ۚ فَلَا تَكُ فِي مِرْيَةٍ مِنْهُ ۚ إِنَّهُ الْحَقُّ مِنْ رَبِّكَ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ",
      "surah": {
        "number": 11,
        "name": "سورة هود",
        "englishName": "Hud",
        "englishNameTranslation": "Hud",
        "revelationType": "Meccan",
        "numberOfAyahs": 123
      },
      "numberInSurah": 17,
      "juz": 12,
      "manzil": 3,
      "page": 223,
      "ruku": 184,
      "hizbQuarter": 89,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَفَمَن كَانَ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّهِۦ وَيَتۡلُوهُ شَاهِدٞ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةًۚ أُوْلَٰٓئِكَ يُؤۡمِنُونَ بِهِۦۚ وَمَن يَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِي مِرۡيَةٖ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ٧١\n                                    \n                                    \n                                    يخبر تعالى عن حال المؤمنين الذين هم على فطرة الله تعالى التي فطر عليها عباده ، من الاعتراف له بأنه لا إله إلا هو ، كما قال تعالى : ( فأقم وجهك للدين حنيفا فطرة الله التي فطر الناس عليها لا تبديل لخلق الله ذلك الدين القيم ) [ الروم : 30 ] ، وفي الصحيحين عن أبي هريرة قال : قال رسول الله ، صلى الله عليه وسلم : \" كل مولود يولد على الفطرة ، فأبواه يهودانه وينصرانه ويمجسانه ، كما تولد البهيمة بهيمة جمعاء ، هل تحسون فيها من جدعاء ؟ \" . وفي صحيح مسلم عن عياض بن حمار ، عن رسول الله - صلى الله عليه وسلم - قال : \" يقول الله تعالى : إني خلقت عبادي حنفاء ، فجاءتهم الشياطين فاجتالتهم عن دينهم ، وحرمت عليهم ما أحللت لهم \" . وفي المسند والسنن : \" كل مولود يولد على هذه الملة ، حتى يعرب عنه لسانه \" الحديث ، فالمؤمن باق على هذه الفطرة . [ وقوله : ( ويتلوه شاهد منه ) أي ] : وجاءه شاهد من الله ، وهو ما أوحاه إلى الأنبياء ، من الشرائع المطهرة المكملة المعظمة المختتمة بشريعة محمد ، صلوات الله وسلامه عليه وعليهم أجمعين . ولهذا قال ابن عباس ، ومجاهد ، وعكرمة ، وأبو العالية ، والضحاك ، وإبراهيم النخعي ، والسدي ، وغير واحد في قوله تعالى : ( ويتلوه شاهد منه ) إنه جبريل عليه السلام .\nوعن علي ، والحسن ، وقتادة : هو محمد ، صلى الله عليه وسلم .\nوكلاهما قريب في المعنى; لأن كلا من جبريل ومحمد ، صلوات الله عليهما ، بلغ رسالة الله تعالى ، فجبريل إلى محمد ، ومحمد إلى الأمة .\nوقيل : هو علي . وهو ضعيف لا يثبت له قائل ، والأول والثاني هو الحق; وذلك أن المؤمن عنده من الفطرة ما يشهد للشريعة من حيث الجملة ، والتفاصيل تؤخذ من الشريعة ، والفطرة تصدقها وتؤمن بها; ولهذا قال تعالى : ( أفمن كان على بينة من ربه ويتلوه شاهد منه ) وهو القرآن ، بلغه جبريل إلى النبي [ محمد ] صلى الله عليه وسلم ، وبلغه النبي محمد إلى أمته .\nثم قال تعالى : ( ومن قبله كتاب موسى ) أي : ومن قبل [ هذا ] القرآن كتاب موسى ، وهو التوراة ، ( إماما ورحمة ) أي : أنزل الله تعالى إلى تلك الأمة إماما لهم ، وقدوة يقتدون بها ، ورحمة من الله بهم . فمن آمن بها حق الإيمان قاده ذلك إلى الإيمان بالقرآن; ولهذا قال تعالى : ( أولئك يؤمنون به ) .\nثم قال تعالى متوعدا لمن كذب بالقرآن أو بشيء منه : ( ومن يكفر به من الأحزاب فالنار موعده ) أي : ومن كفر بالقرآن من سائر أهل الأرض مشركيهم : أهل الكتاب وغيرهم ، من سائر طوائف بني آدم على اختلاف ألوانهم وأشكالهم وأجناسهم ، ممن بلغه القرآن ، كما قال تعالى : ( لأنذركم به ومن بلغ ) [ الأنعام : 19 ] ، وقال تعالى : ( قل ياأيها الناس إني رسول الله إليكم جميعا ) [ الأعراف : 158 ] . وقال تعالى : ( ومن يكفر به من الأحزاب فالنار موعده ) وفي صحيح مسلم ، من حديث شعبة ، عن أبي بشر عن سعيد بن جبير عن أبي موسى الأشعري - رضي الله عنه - أن رسول الله - صلى الله عليه وسلم - قال : \" والذي نفسي بيده ، لا يسمع بي أحد من هذه الأمة يهودي أو نصراني ، ثم لا يؤمن بي إلا دخل النار \" .\nوقال أيوب السختياني ، عن سعيد بن جبير قال : كنت لا أسمع بحديث عن رسول الله - صلى الله عليه وسلم - على وجهه إلا وجدت مصداقه - أو قال : تصديقه - في القرآن ، فبلغني أن رسول الله - صلى الله عليه وسلم - قال : \" لا يسمع بي أحد من هذه الأمة ، ولا يهودي ولا نصراني ، فلا يؤمن بي إلا دخل النار \" . فجعلت أقول : أين مصداقه في كتاب الله ؟ قال : وقلما سمعت عن رسول الله - صلى الله عليه وسلم - إلا وجدت له تصديقا في القرآن ، حتى وجدت هذه الآية : ( ومن يكفر به من الأحزاب فالنار موعده ) قال : \" من الملل كلها \" .\nقوله : ( فلا تك في مرية منه إنه الحق من ربك ) أي : القرآن حق من الله ، لا مرية فيه ولا شك ، كما قال تعالى : ( الم تنزيل الكتاب لا ريب فيه من رب العالمين ) [ السجدة : 1 ، 2 ] ، وقال تعالى : ( الم ذلك الكتاب لا ريب فيه [ هدى للمتقين ] ) [ البقرة : 1 ، 2 ] .\nوقوله : ( ولكن أكثر الناس لا يؤمنون ) كما قال تعالى : ( وما أكثر الناس ولو حرصت بمؤمنين ) [ يوسف : 103 ] ، وقال تعالى : ( وإن تطع أكثر من في الأرض يضلوك عن سبيل الله ) [ الأنعام : 116 ] ، وقال تعالى : ( ولقد صدق عليهم إبليس ظنه فاتبعوه إلا فريقا من المؤمنين ) [ سبأ : 20 ] .\n                                    ",
        "qortoby": "أَفَمَن كَانَ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّهِۦ وَيَتۡلُوهُ شَاهِدٞ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةًۚ أُوْلَٰٓئِكَ يُؤۡمِنُونَ بِهِۦۚ وَمَن يَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِي مِرۡيَةٖ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ٧١\n                                    \n                                    \n                                    قوله تعالى : أفمن كان على بينة من ربه ويتلوه شاهد منه ومن قبله كتاب موسى إماما ورحمة أولئك يؤمنون به ومن يكفر به من الأحزاب فالنار موعده فلا تك في مرية منه إنه الحق من ربك ولكن أكثر الناس لا يؤمنون\nقوله تعالى : أفمن كان على بينة من ربه ابتداء والخبر محذوف ; أي أفمن كان على بينة من ربه في اتباع النبي - صلى الله عليه وسلم - ومعه من الفضل ما يتبين به كغيره ممن يريد الحياة الدنيا وزينتها ؟ ! عن علي بن الحسين والحسن بن أبي الحسن . وكذلك قال ابن زيد : إن الذي على بينة هو من اتبع النبي - صلى الله عليه وسلم - . ويتلوه شاهد منه من الله ، وهو النبي - صلى الله عليه وسلم - . وقيل المراد بقوله أفمن كان على بينة من ربه النبي - صلى الله عليه وسلم - والكلام راجع إلى قوله : وضائق به صدرك ; أي أفمن كان معه بيان من الله ، ومعجزة كالقرآن ، ومعه شاهد كجبريل - على ما يأتي - وقد بشرت به الكتب السالفة يضيق صدره بالإبلاغ ، وهو يعلم أن الله لا يسلمه . والهاء في \" ربه \" تعود عليه .\nويتلوه شاهد منه وروى عكرمة عن ابن عباس أنه جبريل ; وهو قول مجاهد والنخعي . والهاء في \" منه \" لله عز وجل ; أي ويتلو البيان والبرهان شاهد من الله - عز وجل - . وقال مجاهد : الشاهد ملك من الله - عز وجل - يحفظه ويسدده . وقال الحسن البصري وقتادة : الشاهد لسان رسول الله - صلى الله عليه وسلم - . قال محمد بن علي ، ابن الحنفية : قلت لأبي أنت الشاهد ؟ فقال : وددت أن أكون أنا هو ; ولكنه لسان رسول الله - صلى الله عليه وسلم - . وقيل : هو علي بن أبي طالب ; روي عن ابن عباس أنه قال : ( هو علي بن أبي طالب ) ; وروي عن علي أنه قال : ( ما من رجل من قريش إلا وقد أنزلت فيه الآية والآيتان ; فقال له رجل : أي شيء نزل فيك ؟ فقال علي : ويتلوه شاهد منه ) . وقيل : الشاهد صورة رسول الله - صلى الله عليه وسلم - ووجهه ومخائله ; لأن من كان له فضل وعقل فنظر إلى النبي - صلى الله عليه وسلم - علم أنه رسول الله - صلى الله عليه وسلم - ; فالهاء على هذا ترجع إلى النبي - صلى الله عليه وسلم - على قول ابن زيد وغيره . وقيل : الشاهد القرآن في نظمه وبلاغته ، والمعاني الكثيرة منه في اللفظ الواحد ; قاله الحسين بن الفضل ، فالهاء في \" منه \" للقرآن . وقال الفراء قال بعضهم : ويتلوه شاهد منه الإنجيل ، وإن كان قبله فهو يتلو القرآن في التصديق ; والهاء في \" منه \" لله عز وجل . وقيل : البينة معرفة الله التي أشرقت لها القلوب ، والشاهد الذي يتلوه العقل الذي ركب في دماغه وأشرق صدره بنوره\n\" ومن قبله \" أي من قبل الإنجيل .\nكتاب موسى رفع بالابتداء ، قال أبو إسحاق الزجاج والمعنى ويتلوه من قبله كتاب موسى ; لأن النبي - صلى الله عليه وسلم - موصوف في كتاب موسى يجدونه مكتوبا عندهم في التوراة والإنجيل وحكى أبو حاتم عن بعضهم أنه قرأ \" ومن قبله كتاب موسى \" بالنصب ; وحكاها المهدوي عن الكلبي ; يكون معطوفا على الهاء في \" يتلوه \" والمعنى : ويتلو كتاب موسى جبريل - عليه السلام - ; وكذلك قال ابن عباس - رضي الله عنهما - ; المعنى من قبله تلا جبريل كتاب موسى على موسى . ويجوز على ما ذكره ابن عباس أيضا من هذا القول أن يرفع \" كتاب \" على أن يكون المعنى : ومن قبله كتاب موسى كذلك ; أي تلاه جبريل على موسى كما تلا القرآن على محمد .\n\" إماما \" نصب على الحال .\n\" ورحمة \" معطوف .\nأولئك يؤمنون به إشارة إلى بني إسرائيل ، أي يؤمنون بما في التوراة من البشارة بك ; وإنما كفر بك هؤلاء المتأخرون فهم الذين موعدهم النار ; حكاه القشيري . والهاء في به يجوز أن تكون للقرآن ، ويجوز أن تكون للنبي - صلى الله عليه وسلم - .\nومن يكفر به أي بالقرآن أو بالنبي - عليه السلام - .\nمن الأحزاب يعني من الملل كلها ; عن قتادة ; وكذا قال سعيد بن جبير : الأحزاب أهل الأديان كلها ; لأنهم يتحازبون . وقيل : قريش وحلفاؤهم .\nفالنار موعده أي هو من أهل النار ; وأنشد حسان :\nأوردتموها حياض الموت ضاحية فالنار موعدها والموت لاقيها\nوفي صحيح مسلم من حديث أبي يونس عن النبي - صلى الله عليه وسلم - والذي نفس محمد بيده لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني ثم يموت ولم يؤمن بالذي أرسلت به إلا كان من أصحاب النار .\nفلا تك في مرية أي في شك .\nمنه أي من القرآن .\nإنه الحق من ربك أي القرآن من الله ; قاله مقاتل . وقال الكلبي : المعنى فلا تك في مرية في أن الكافر في النار . إنه الحق أي القول الحق الكائن ; والخطاب للنبي - صلى الله عليه وسلم - والمراد جميع المكلفين .\n                                    ",
        "saadi": "أَفَمَن كَانَ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّهِۦ وَيَتۡلُوهُ شَاهِدٞ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةًۚ أُوْلَٰٓئِكَ يُؤۡمِنُونَ بِهِۦۚ وَمَن يَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِي مِرۡيَةٖ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ٧١\n                                        \n                                        \n                                        \n                                        يذكر تعالى، حال رسوله محمد صلى الله عليه وسلم ومن قام مقامه من ورثته القائمين بدينه، وحججه الموقنين بذلك، وأنهم لا يوصف بهم غيرهم ولا يكون أحد مثلهم، فقال: { أَفَمَنْ كَانَ عَلَى بَيِّنَةٍ مِنْ رَبِّهِ } بالوحي الذي أنزل الله فيه المسائل المهمة، ودلائلها الظاهرة، فتيقن تلك البينة.\n{ وَيَتْلُوهُ } أي: يتلو هذه البينة والبرهان برهان آخر { شَاهِدٌ مِنْهُ } وهو شاهد الفطرة المستقيمة، والعقل الصحيح، حين شهد حقيقة ما أوحاه الله وشرعه، وعلم بعقله حسنه، فازداد بذلك إيمانا إلى إيمانه.\n{ و } ثم شاهد ثالث وهو { كِتَابُ مُوسَى } التوراة التي جعلها الله { إِمَامًا } للناس { وَرَحْمَةً } لهم، يشهد لهذا القرآن بالصدق، ويوافقه فيما جاء به من الحق.\nأي: أفمن كان بهذا الوصف قد تواردت عليه شواهد الإيمان، وقامت لديه أدلة اليقين، كمن هو في الظلمات والجهالات، ليس بخارج منها؟!\nلا يستوون عند الله، ولا عند عباد الله، { أُولَئِكَ } أي: الذين وفقوا لقيام الأدلة عندهم، { يُؤْمِنُونَ } بالقرآن حقيقة، فيثمر لهم إيمانهم كل خير في الدنيا والآخرة.\n{ وَمَنْ يَكْفُرْ بِهِ } أي: القرآن { مِنَ الْأَحْزَابِ } أي: سائر طوائف أهل الأرض، المتحزبة على رد الحق، { فَالنَّارُ مَوْعِدُهُ } لا بد من وروده إليها { فَلَا تَكُ فِي مِرْيَةٍ منه } أي: في أدنى شك { إِنَّهُ الْحَقُّ مِنْ رَبِّكَ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ } إما جهلا منهم وضلالا، وإما ظلما وعنادا وبغيا، وإلا فمن كان قصده حسنا وفهمه مستقيما، فلا بد أن يؤمن به، لأنه يرى ما يدعوه إلى الإيمان من كل وجه.\n                                    "
      },
      "originalText": "أَفَمَن كَانَ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّهِۦ وَيَتۡلُوهُ شَاهِدٞ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةًۚ أُوْلَٰٓئِكَ يُؤۡمِنُونَ بِهِۦۚ وَمَن يَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِي مِرۡيَةٖ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ٧١"
    },
    {
      "number": 1491,
      "text": "وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا ۚ أُولَٰئِكَ يُعْرَضُونَ عَلَىٰ رَبِّهِمْ وَيَقُولُ الْأَشْهَادُ هَٰؤُلَاءِ الَّذِينَ كَذَبُوا عَلَىٰ رَبِّهِمْ ۚ أَلَا لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ",
      "surah": {
        "number": 11,
        "name": "سورة هود",
        "englishName": "Hud",
        "englishNameTranslation": "Hud",
        "revelationType": "Meccan",
        "numberOfAyahs": 123
      },
      "numberInSurah": 18,
      "juz": 12,
      "manzil": 3,
      "page": 223,
      "ruku": 184,
      "hizbQuarter": 89,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُوْلَٰٓئِكَ يُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَيَقُولُ ٱلۡأَشۡهَٰدُ هَٰٓؤُلَآءِ ٱلَّذِينَ كَذَبُواْ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ ٨١\n                                    \n                                    \n                                    يبين تعالى حال المفترين عليه وفضيحتهم في الدار الآخرة على رءوس الخلائق; من الملائكة ، والرسل ، والأنبياء ، وسائر البشر والجان ، كما قال الإمام أحمد :\nحدثنا بهز وعفان قالا أخبرنا همام ، حدثنا قتادة ، عن صفوان بن محرز قال : كنت آخذا بيد ابن عمر ، إذ عرض له رجل قال : كيف سمعت رسول الله - صلى الله عليه وسلم - يقول في النجوى يوم القيامة ؟ قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" إن الله عز وجل يدني المؤمن ، فيضع عليه كنفه ، ويستره من الناس ، ويقرره بذنوبه ، ويقول له : أتعرف ذنب كذا ؟ أتعرف ذنب كذا ؟ أتعرف ذنب كذا ؟ حتى إذا قرره بذنوبه ، ورأى في نفسه أنه قد هلك قال : فإني قد سترتها عليك في الدنيا ، وإني أغفرها لك اليوم . ثم يعطى كتاب حسناته ، وأما الكفار والمنافقون فيقول : ( الأشهاد هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين )\nأخرجه البخاري ومسلم في الصحيحين ، من حديث قتادة به .\n                                    ",
        "qortoby": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُوْلَٰٓئِكَ يُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَيَقُولُ ٱلۡأَشۡهَٰدُ هَٰٓؤُلَآءِ ٱلَّذِينَ كَذَبُواْ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ ٨١\n                                    \n                                    \n                                    قوله تعالى : ومن أظلم ممن افترى على الله كذبا أولئك يعرضون على ربهم ويقول الأشهاد هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين\nقوله تعالى : ومن أظلم ممن افترى على الله كذبا أي لا أحد أظلم منهم لأنفسهم لأنهم افتروا على الله كذبا ; فأضافوا كلامه إلى غيره ; وزعموا أن له شريكا وولدا ، وقالوا للأصنام هؤلاء شفعاؤنا عند الله .\nأولئك يعرضون على ربهم أي يحاسبهم على أعمالهم\nويقول الأشهاد هؤلاء الذين كذبوا على ربهم يعني الملائكة الحفظة ; عن مجاهد وغيره ; وقال سفيان : سألت الأعمش عن الأشهاد فقال : الملائكة . الضحاك : هم الأنبياء والمرسلون ; دليله قوله : فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا . وقيل : الملائكة والأنبياء والعلماء الذين بلغوا الرسالات . وقال قتادة : عن الخلائق أجمع . وفي صحيح مسلم من حديث صفوان بن محرز عن ابن عمر عن النبي - صلى الله عليه وسلم - وفيه قال : وأما الكفار والمنافقون فينادى بهم على رءوس الخلائق هؤلاء الذين كذبوا على الله .\nألا لعنة الله على الظالمين أي بعده وسخطه وإبعاده من رحمته على الذين وضعوا العبادة في غير موضعها .\n                                    ",
        "saadi": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُوْلَٰٓئِكَ يُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَيَقُولُ ٱلۡأَشۡهَٰدُ هَٰٓؤُلَآءِ ٱلَّذِينَ كَذَبُواْ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ ٨١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه لا أحد { أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ كَذِبًا } ويدخل في هذا كل من كذب على الله، بنسبة الشريك له، أو وصفه بما لا يليق بجلاله، أو الإخبار عنه، بما لم يقل، أو ادعاء النبوة، أو غير ذلك من الكذب على الله، فهؤلاء أعظم الناس ظلما { أُولَئِكَ يُعْرَضُونَ عَلَى رَبِّهِمْ } ليجازيهم بظلمهم، فعندما يحكم عليهم بالعقاب الشديد { يَقُولُ الْأَشْهَادُ } أي: الذين شهدوا عليهم بافترائهم وكذبهم: { هَؤُلَاءِ الَّذِينَ كَذَبُوا عَلَى رَبِّهِمْ أَلَا لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ } أي: لعنة لا تنقطع، لأن ظلمهم صار وصفا لهم ملازما، لا يقبل التخفيف.\n                                    "
      },
      "originalText": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُوْلَٰٓئِكَ يُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَيَقُولُ ٱلۡأَشۡهَٰدُ هَٰٓؤُلَآءِ ٱلَّذِينَ كَذَبُواْ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ ٨١"
    },
    {
      "number": 1492,
      "text": "الَّذِينَ يَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ",
      "surah": {
        "number": 11,
        "name": "سورة هود",
        "englishName": "Hud",
        "englishNameTranslation": "Hud",
        "revelationType": "Meccan",
        "numberOfAyahs": 123
      },
      "numberInSurah": 19,
      "juz": 12,
      "manzil": 3,
      "page": 223,
      "ruku": 184,
      "hizbQuarter": 89,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجٗا وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ٩١\n                                    \n                                    \n                                    وقوله : ( الذين يصدون عن سبيل الله ويبغونها عوجا ) أي يردون الناس عن اتباع الحق وسلوك طريق الهدى الموصلة إلى الله عز وجل ويجنبونهم الجنة ، ( ويبغونها عوجا ) أي : ويريدون أن يكون طريقهم عوجا غير معتدلة ، ( وهم بالآخرة هم كافرون ) أي : جاحدون بها مكذبون بوقوعها وكونها .\n                                    ",
        "qortoby": "ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجٗا وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ٩١\n                                    \n                                    \n                                    قوله تعالى : الذين يصدون عن سبيل الله يجوز أن تكون الذين في موضع خفض نعتا للظالمين ، ويجوز أن تكون في موضع رفع ; أي هم الذين . وقيل : هو ابتداء خطاب من الله تعالى ; أي هم الذين يصدون أنفسهم وغيرهم عن الإيمان والطاعة .\nويبغونها عوجا أي يعدلون بالناس عنها إلى المعاصي والشرك .\nوهم بالآخرة هم كافرون أعاد لفظ هم تأكيدا .\n                                    ",
        "saadi": "ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجٗا وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ٩١\n                                        \n                                        \n                                        \n                                        ثم وصف ظلمهم فقال: { الَّذِينَ يَصُدُّونَ عَنْ سَبِيلِ اللَّهِ } فصدوا بأنفسهم عن سبيل الله، وهي سبيل الرسل، التي دعوا الناس إليها، وصدوا غيرهم عنها، فصاروا أئمة يدعون إلى النار.\n{ وَيَبْغُونَهَا } أي: سبيل الله { عِوَجًا } أي: يجتهدون في ميلها، وتشيينها، وتهجينها، لتصير عند الناس غير مستقيمة، فيحسنون الباطل ويقبحون الحق، قبحهم الله { وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ }\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجٗا وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ ٩١"
    }
  ]
}