{
  "number": 23,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 153,
      "text": "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ ۖ وَإِنَّ فَرِيقًا مِنْهُمْ لَيَكْتُمُونَ الْحَقَّ وَهُمْ يَعْلَمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 146,
      "juz": 2,
      "manzil": 1,
      "page": 23,
      "ruku": 18,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَعۡرِفُونَهُۥ كَمَا يَعۡرِفُونَ أَبۡنَآءَهُمۡۖ وَإِنَّ فَرِيقٗا مِّنۡهُمۡ لَيَكۡتُمُونَ ٱلۡحَقَّ وَهُمۡ يَعۡلَمُونَ ٦٤١\n                                    \n                                    \n                                    يخبر تعالى أن علماء أهل الكتاب يعرفون صحة ما جاءهم به الرسول صلى الله عليه وسلم [ كما يعرفون أبناءهم ] كما يعرف أحدهم ولده ، والعرب كانت تضرب المثل في صحة الشيء بهذا ، كما جاء في الحديث أن رسول الله صلى الله عليه وسلم قال لرجل معه صغير : \" ابنك هذا ؟ \" قال : نعم يا رسول الله ، أشهد به . قال : \" أما إنه لا يجني عليك ولا تجني عليه \" .\n[ قال القرطبي : ويروى أن عمر قال لعبد الله بن سلام : أتعرف محمدا صلى الله عليه وسلم كما تعرف ولدك ابنك ، قال : نعم وأكثر ، نزل الأمين من السماء على الأمين ، في الأرض بنعته فعرفته ، وإني لا أدري ما كان من أمره . قلت : وقد يكون المراد ( يعرفونه كما يعرفون أبناءهم ) من بين أبناء الناس لا يشك أحد ولا يتمارى في معرفة ابنه إذا رآه من بين أبناء الناس كلهم ] .\nثم أخبر تعالى أنهم مع هذا التحقق والإتقان العلمي ( ليكتمون الحق ) أي : ليكتمون الناس ما في كتبهم من صفة النبي صلى الله عليه وسلم ( وهم يعلمون )\n                                    ",
        "qortoby": "ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَعۡرِفُونَهُۥ كَمَا يَعۡرِفُونَ أَبۡنَآءَهُمۡۖ وَإِنَّ فَرِيقٗا مِّنۡهُمۡ لَيَكۡتُمُونَ ٱلۡحَقَّ وَهُمۡ يَعۡلَمُونَ ٦٤١\n                                    \n                                    \n                                    قوله تعالى : الذين آتيناهم الكتاب يعرفونه كما يعرفون أبناءهم وإن فريقا منهم ليكتمون الحق وهم يعلمون\nقوله تعالى : الذين آتيناهم الكتاب يعرفونه كما يعرفون أبناءهم الذين في موضع رفع بالابتداء والخبر يعرفونه . ويصح أن يكون في موضع خفض على الصفة ل \" لظالمين \" ويعرفون في موضع الحال ، أي يعرفون نبوته وصدق رسالته ، والضمير عائد على محمد صلى الله عليه وسلم ، قاله مجاهد وقتادة وغيرهما . وقيل : يعرفون تحويل القبلة عن بيت المقدس إلى الكعبة أنه حق ، قاله ابن عباس وابن جريج والربيع وقتادة أيضا . وخص الأبناء في المعرفة بالذكر دون الأنفس وإن كانت ألصق لأن الإنسان يمر عليه من زمنه برهة لا يعرف فيها نفسه ، ولا يمر عليه وقت لا يعرف فيه ابنه . وروي أن عمر قال لعبد الله بن سلام : أتعرف محمدا صلى الله عليه وسلم كما تعرف ابنك ؟ فقال : نعم وأكثر ، بعث الله أمينه في سمائه إلى أمينه في أرضه بنعته فعرفته ، وابني لا أدري ما كان من أمه .\nقوله تعالى : وإن فريقا منهم ليكتمون الحق يعني محمدا صلى الله عليه وسلم ، قاله مجاهد وقتادة وخصيف . وقيل : استقبال الكعبة ، على ما ذكرنا آنفا .\nقوله تعالى : وهم يعلمون ظاهر في صحة الكفر عنادا ، ومثله : وجحدوا بها واستيقنتها أنفسهم وقوله فلما جاءهم ما عرفوا كفروا به .\n                                    ",
        "saadi": "ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَعۡرِفُونَهُۥ كَمَا يَعۡرِفُونَ أَبۡنَآءَهُمۡۖ وَإِنَّ فَرِيقٗا مِّنۡهُمۡ لَيَكۡتُمُونَ ٱلۡحَقَّ وَهُمۡ يَعۡلَمُونَ ٦٤١\n                                        \n                                        \n                                        \n                                        يخبر تعالى: أن أهل الكتاب قد تقرر عندهم, وعرفوا أن محمدا رسول الله, وأن ما جاء به, حق وصدق, وتقينوا ذلك, كما تيقنوا أبناءهم بحيث لا يشتبهون عليهم بغيرهم، فمعرفتهم بمحمد صلى الله عليه وسلم, وصلت إلى حد لا يشكون فيه ولا يمترون، ولكن فريقا منهم - وهم أكثرهم - الذين كفروا به, كتموا هذه الشهادة مع تيقنها, وهم يعلمون { وَمَنْ أَظْلَمُ مِمَّنْ كَتَمَ شَهَادَةً عِنْدَهُ مِنَ اللَّهِ } وفي ضمن ذلك, تسلية للرسول والمؤمنين, وتحذير له من شرهم وشبههم، وفريق منهم لم يكتموا الحق وهم يعلمون، فمنهم من آمن [به] ومنهم من كفر [به] جهلا، فالعالم عليه إظهار الحق, وتبيينه وتزيينه, بكل ما يقدر عليه من عبارة وبرهان ومثال, وغير ذلك, وإبطال الباطل وتمييزه عن الحق, وتشيينه, وتقبيحه للنفوس, بكل طريق مؤد لذلك، فهولاء الكاتمون, عكسوا الأمر, فانعكست أحوالهم.\n                                    "
      },
      "originalText": "ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَعۡرِفُونَهُۥ كَمَا يَعۡرِفُونَ أَبۡنَآءَهُمۡۖ وَإِنَّ فَرِيقٗا مِّنۡهُمۡ لَيَكۡتُمُونَ ٱلۡحَقَّ وَهُمۡ يَعۡلَمُونَ ٦٤١"
    },
    {
      "number": 154,
      "text": "الْحَقُّ مِنْ رَبِّكَ ۖ فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 147,
      "juz": 2,
      "manzil": 1,
      "page": 23,
      "ruku": 18,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِينَ ٧٤١\n                                    \n                                    \n                                    ثم ثبت تعالى نبيه والمؤمنين وأخبرهم بأن ما جاء به الرسول صلى الله عليه وسلم هو الحق الذي لا مرية فيه ولا شك ، فقال : ( الحق من ربك فلا تكونن من الممترين )\n                                    ",
        "qortoby": "ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِينَ ٧٤١\n                                    \n                                    \n                                    قوله تعالى : الحق من ربك فلا تكونن من الممترين\nقوله تعالى : الحق من ربك يعني استقبال الكعبة ، لا ما أخبرك به اليهود من قبلتهم . وروي عن علي رضي الله عنه أنه قرأ الحق منصوبا ب يعلمون أي يعلمون الحق . ويصح نصبه على تقدير الزم الحق . والرفع على الابتداء أو على إضمار مبتدإ والتقدير هو الحق ، أو على إضمار فعل ، أي جاءك الحق . قال النحاس : فأما الذي في \" الأنبياء \" الحق فهم معرضون فلا نعلم أحدا قرأه إلا منصوبا ، والفرق بينهما أن الذي في سورة \" البقرة \" مبتدأ آية ، والذي في الأنبياء ليس كذلك\nقوله تعالى : فلا تكونن من الممترين أي من الشاكين . والخطاب للنبي صلى الله عليه وسلم والمراد أمته . يقال : امترى فلان [ في ] كذا إذا اعترضه اليقين مرة والشك أخرى فدافع إحداهما بالأخرى ، ومنه المراء لأن كل واحد منهما يشك في قول صاحبه . والامتراء في الشيء الشك فيه ، وكذا التماري . وأنشد الطبري شاهدا على أن الممترين الشاكون قول الأعشى :\nتدر على أسؤق الممتري ن ركضا إذا ما السراب أرجحن\nقال ابن عطية : ووهم في هذا ; لأن أبا عبيدة وغيره قال : الممترون في البيت هم الذين يمرون الخيل بأرجلهم همزا لتجري كأنهم يحتلبون الجري منها ، وليس في البيت معنى الشك كما قال الطبري .\nقلت : معنى الشك فيه موجود ; لأنه يحتمل أن يختبر الفرس صاحبه هل هو على ما عهد منه الجري أم لا ، لئلا يكون أصابه شيء ، أو يكون هذا عند أول شرائه فيجريه ليعلم مقدار جريه . قال الجوهري : ومريت الفرس إذا استخرجت ما عنده من الجري بسوط أو غيره . والاسم المرية ( بالكسر ) وقد تضم . ومريت الناقة مريا : إذا مسحت ضرعها لتدر . وأمرت هي إذا در لبنها ، والاسم المرية ( بالكسر ) ، والضم غلط . والمرية : الشك ، وقد تضم ، وقرئ بهما .\n                                    ",
        "saadi": "ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِينَ ٧٤١\n                                        \n                                        \n                                        \n                                        { الْحَقُّ مِنْ رَبِّكَ } أي: هذا الحق الذي هو أحق أن يسمى حقا من كل شيء, لما اشتمل عليه من المطالب العالية, والأوامر الحسنة, وتزكية النفوس وحثها على تحصيل مصالحها, ودفع مفاسدها, لصدوره من ربك, الذي من جملة تربيته لك أن أنزل عليك هذا القرآن الذي فيه تربية العقول والنفوس, وجميع المصالح. { فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ } أي: فلا يحصل لك أدنى شك وريبة فيه، بل تفكَّر فيه وتأمل, حتى تصل بذلك إلى اليقين, لأن التفكر فيه لا محالة, دافع للشك, موصل لليقين.\n                                    "
      },
      "originalText": "ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِينَ ٧٤١"
    },
    {
      "number": 155,
      "text": "وَلِكُلٍّ وِجْهَةٌ هُوَ مُوَلِّيهَا ۖ فَاسْتَبِقُوا الْخَيْرَاتِ ۚ أَيْنَ مَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعًا ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 148,
      "juz": 2,
      "manzil": 1,
      "page": 23,
      "ruku": 19,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِكُلّٖ وِجۡهَةٌ هُوَ مُوَلِّيهَاۖ فَٱسۡتَبِقُواْ ٱلۡخَيۡرَٰتِۚ أَيۡنَ مَا تَكُونُواْ يَأۡتِ بِكُمُ ٱللَّهُ جَمِيعًاۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٨٤١\n                                    \n                                    \n                                    قال العوفي ، عن ابن عباس : ( ولكل وجهة هو موليها ) يعني بذلك : أهل الأديان ، يقول : لكل قبلة يرضونها ، ووجهة الله حيث توجه المؤمنون .\nوقال أبو العالية : لليهودي وجهة هو موليها ، وللنصراني وجهة هو موليها ، وهداكم أنتم أيتها الأمة [ الموقنون ] للقبلة التي هي القبلة . وروي عن مجاهد ، وعطاء ، والضحاك ، والربيع بن أنس ، والسدي نحو هذا .\nوقال مجاهد في الرواية الأخرى : ولكن أمر كل قوم أن يصلوا إلى الكعبة .\nوقرأ ابن عباس ، وأبو جعفر الباقر ، وابن عامر : \" ولكل وجهة هو مولاها \" .\nوهذه الآية شبيهة بقوله تعالى : ( لكل جعلنا منكم شرعة ومنهاجا ولو شاء الله لجعلكم أمة واحدة ولكن ليبلوكم في ما آتاكم فاستبقوا الخيرات إلى الله مرجعكم جميعا ) [ المائدة : 48 ] .\nوقال هاهنا : ( أينما تكونوا يأت بكم الله جميعا إن الله على كل شيء قدير ) أي : هو قادر على جمعكم من الأرض ، وإن تفرقت أجسادكم وأبدانكم .\n                                    ",
        "qortoby": "وَلِكُلّٖ وِجۡهَةٌ هُوَ مُوَلِّيهَاۖ فَٱسۡتَبِقُواْ ٱلۡخَيۡرَٰتِۚ أَيۡنَ مَا تَكُونُواْ يَأۡتِ بِكُمُ ٱللَّهُ جَمِيعًاۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٨٤١\n                                    \n                                    \n                                    قوله تعالى : ولكل وجهة هو موليها فاستبقوا الخيرات أينما تكونوا يأت بكم الله جميعا إن الله على كل شيء قدير\nفيه أربع مسائل :\nالأولى : قوله تعالى : ولكل وجهة الوجهة وزنها فعلة من المواجهة . والوجهة والجهة والوجه بمعنى واحد ، والمراد القبلة ، أي إنهم لا يتبعون قبلتك وأنت لا تتبع قبلتهم ، ولكل وجهة إما بحق وإما بهوى .\nالثانية : قوله تعالى : هو موليها هو عائد على لفظ كل لا على معناه ; لأنه لو كان على المعنى لقال : هم مولوها وجوههم ، فالهاء والألف مفعول أول والمفعول الثاني محذوف ، أي هو موليها وجهه ونفسه . والمعنى : ولكل صاحب ملة قبلة ، صاحب القبلة موليها وجهه ، على لفظ كل وهو قول الربيع وعطاء وابن عباس . وقال علي بن سليمان : موليها أي متوليها . وقرأ ابن عباس وابن عامر \" مولاها \" على ما لم يسم فاعله . والضمير على هذه القراءة لواحد ، أي ولكل واحد من الناس قبلة ، الواحد مولاها أي مصروف إليها ، قاله الزجاج . ويحتمل أن يكون على قراءة الجماعة هو ضمير اسم الله عز وجل وإن لم يجر له ذكر ، إذ معلوم أن الله عز وجل فاعل ذلك والمعنى : لكل صاحب ملة قبلة الله موليها إياه . وحكى الطبري : أن قوما قرءوا ولكل وجهة بإضافة كل إلى وجهة . قال ابن عطية : وخطأها الطبري ، وهي متجهة ، أي فاستبقوا الخيرات لكل وجهة ولاكموها ، ولا تعترضوا فيما أمركم بين هذه وهذه ، أي إنما عليكم الطاعة في الجميع . وقدم قوله ولكل وجهة على الأمر في قوله : فاستبقوا الخيرات للاهتمام بالوجهة كما يقدم المفعول ، وذكر أبو عمرو الداني هذه القراءة عن ابن عباس رضي الله عنهما . وسلمت الواو في وجهة للفرق بين عدة وزنة ، لأن جهة ظرف ، وتلك مصادر . وقال أبو علي : ذهب قوم إلى أنه مصدر شذ عن القياس فسلم . وذهب قوم إلى أنه اسم وليس بمصدر . وقال غير أبي علي : وإذا أردت المصدر قلت جهة ، وقد يقال الجهة في الظرف .\nالثالثة : قوله تعالى : فاستبقوا الخيرات أي إلى الخيرات ، فحذف الحرف ، أي بادروا ما أمركم الله عز وجل من استقبال البيت الحرام وإن كان يتضمن الحث على المبادرة والاستعجال إلى جميع الطاعات بالعموم ، فالمراد ما ذكر من الاستقبال لسياق الآي . والمعنى المراد المبادرة بالصلاة أول وقتها ، والله تعالى أعلم . روى النسائي عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال : إنما مثل المهجر إلى الصلاة كمثل الذي يهدي البدنة ثم الذي على أثره كالذي يهدي البقرة ثم الذي على أثره كالذي يهدي الكبش ثم الذي على أثره كالذي يهدي الدجاجة ثم الذي على أثره كالذي يهدي البيضة . وروى الدارقطني عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : إن أحدكم ليصلي الصلاة لوقتها وقد ترك من الوقت الأول ما هو خير له من أهله وماله . وأخرجه مالك عن يحيى بن سعيد قوله . وروى الدارقطني أيضا عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : خير الأعمال الصلاة في أول وقتها . وفي حديث ابن مسعود \" أول وقتها \" بإسقاط \" في \" . وروي أيضا عن إبراهيم بن عبد الملك عن أبي محذورة عن أبيه عن جده قال قال رسول الله صلى الله عليه وسلم : أول الوقت رضوان الله ووسط الوقت رحمة الله وآخر الوقت عفو الله . زاد ابن العربي : فقال أبو بكر : رضوان الله أحب إلينا من عفوه ، فإن رضوانه عن المحسنين وعفوه عن المقصرين ، وهذا اختيار الشافعي . وقال أبو حنيفة : آخر الوقت أفضل ; لأنه وقت الوجوب . وأما مالك ففصل القول ؛ فأما الصبح والمغرب فأول الوقت فيهما أفضل ، أما الصبح فلحديث عائشة رضي الله عنها قالت : إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح فينصرف النساء متلفعات بمروطهن ما يعرفن من الغلس - في رواية - ( متلففات ) . وأما المغرب فلحديث سلمة بن الأكوع أن رسول الله صلى الله عليه وسلم كان يصلي المغرب إذا غربت الشمس وتوارت بالحجاب ، أخرجهما مسلم . وأما العشاء فتأخيرها أفضل لمن قدر عليه . روى ابن عمر قال : مكثنا ذات ليلة ننتظر رسول الله صلى الله عليه وسلم لصلاة العشاء الآخرة ، فخرج إلينا حين ذهب ثلث الليل أو بعده ، فلا ندري أشيء شغله في أهله أو غير ذلك ، فقال حين خرج : إنكم لتنتظرون صلاة ما ينتظرها أهل دين غيركم ولولا أن يثقل على أمتي لصليت بهم هذه الساعة . وفي البخاري عن أنس قال : أخر النبي صلى الله عليه وسلم صلاة العشاء إلى نصف الليل ثم صلى . . . ، وذكر الحديث . وقال أبو برزة : كان النبي صلى الله عليه وسلم يستحب تأخيرها . وأما الظهر فإنها تأتي الناس [ على ] غفلة فيستحب تأخيرها قليلا حتى يتأهبوا ويجتمعوا . قال أبو الفرج قال مالك : أول الوقت أفضل في كل صلاة إلا للظهر في شدة الحر . وقال ابن أبي أويس : وكان مالك يكره أن يصلى الظهر عند الزوال ولكن بعد ذلك ، ويقول : تلك صلاة الخوارج . وفي صحيح البخاري وصحيح الترمذي عن أبي ذر الغفاري قال : كنا مع النبي صلى الله عليه وسلم في سفر فأراد المؤذن أن يؤذن للظهر ، فقال النبي صلى الله عليه وسلم : ( أبرد ) ثم أراد أن يؤذن فقال له : ( أبرد ) حتى رأينا فيء التلول ، فقال النبي صلى الله عليه وسلم : إن شدة الحر من فيح جهنم فإذا اشتد الحر فأبردوا بالصلاة . وفي صحيح مسلم عن أنس أن النبي صلى الله عليه وسلم كان يصلي الظهر إذا زالت الشمس . والذي يجمع بين الحديثين ما رواه أنس أنه إذا كان الحر أبرد بالصلاة ، وإذا كان البرد عجل . قال أبو عيسى الترمذي : \" وقد اختار قوم [ من أهل العلم ] تأخير صلاة الظهر في شدة الحر ، وهو قول ابن المبارك وأحمد وإسحاق . قال الشافعي : إنما الإبراد بصلاة الظهر إذا كان [ مسجدا ] ينتاب أهله من البعد ، فأما المصلي وحده والذي يصلي في مسجد قومه فالذي أحب له ألا يؤخر الصلاة في شدة الحر . قال أبو عيسى : ومعنى من ذهب إلى تأخير الظهر في شدة الحر هو أولى وأشبه بالاتباع ، وأما ما ذهب إليه الشافعي رحمه الله أن الرخصة لمن ينتاب من البعد وللمشقة على الناس ، فإن في حديث أبي ذر رضي الله عنه ما يدل على خلاف ما قال الشافعي . قال أبو ذر : كنا مع النبي صلى الله عليه وسلم في سفر فأذن بلال بصلاة الظهر ، فقال النبي صلى الله عليه وسلم : [ يا بلال ] أبرد ثم أبرد . فلو كان الأمر على ما ذهب إليه الشافعي لم يكن للإبراد في ذلك الوقت معنى ، لاجتماعهم في السفر وكانوا لا يحتاجون أن ينتابوا من البعد \" . وأما العصر فتقديمها أفضل . ولا خلاف في مذهبنا أن تأخير الصلاة رجاء الجماعة أفضل من تقديمها ، فإن فضل الجماعة معلوم ، وفضل أول الوقت مجهول ، وتحصيل المعلوم أولى قاله ابن العربي .\nالرابعة : قوله تعالى : أينما تكونوا شرط ، وجوابه : يأت بكم الله جميعا يعني يوم القيامة . ثم وصف نفسه تعالى بالقدرة على كل شيء لتناسب الصفة مع ما ذكر من الإعادة بعد الموت والبلى .\n                                    ",
        "saadi": "وَلِكُلّٖ وِجۡهَةٌ هُوَ مُوَلِّيهَاۖ فَٱسۡتَبِقُواْ ٱلۡخَيۡرَٰتِۚ أَيۡنَ مَا تَكُونُواْ يَأۡتِ بِكُمُ ٱللَّهُ جَمِيعًاۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٨٤١\n                                        \n                                        \n                                        \n                                        أي: كل أهل دين وملة, له وجهة يتوجه إليها في عبادته، وليس الشأن في استقبال القبلة, فإنه من الشرائع التي تتغير بها الأزمنة والأحوال, ويدخلها النسخ والنقل, من جهة إلى جهة، ولكن الشأن كل الشأن, في امتثال طاعة الله, والتقرب إليه, وطلب الزلفى عنده، فهذا هو عنوان السعادة ومنشور الولاية، وهو الذي إذا لم تتصف به النفوس, حصلت لها خسارة الدنيا والآخرة، كما أنها إذا اتصفت به فهي الرابحة على الحقيقة, وهذا أمر متفق عليه في جميع الشرائع, وهو الذي خلق الله له الخلق, وأمرهم به. والأمر بالاستباق إلى الخيرات قدر زائد على الأمر بفعل الخيرات، فإن الاستباق إليها, يتضمن فعلها, وتكميلها, وإيقاعها على أكمل الأحوال, والمبادرة إليها، ومن سبق في الدنيا إلى الخيرات, فهو السابق في الآخرة إلى الجنات, فالسابقون أعلى الخلق درجة، والخيرات تشمل جميع الفرائض والنوافل, من صلاة, وصيام, وزكوات وحج, عمرة, وجهاد, ونفع متعد وقاصر. ولما كان أقوى ما يحث النفوس على المسارعة إلى الخير, وينشطها, ما رتب الله عليها من الثواب قال: { أَيْنَمَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعًا إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ } فيجمعكم ليوم القيامة بقدرته, فيجازي كل عامل بعمله { لِيَجْزِيَ الَّذِينَ أَسَاءُوا بِمَا عَمِلُوا وَيَجْزِيَ الَّذِينَ أَحْسَنُوا بِالْحُسْنَى } ويستدل بهذه الآية الشريفة على الإتيان بكل فضيلة يتصف بها العمل، كالصلاة في أول وقتها, والمبادرة إلى إبراء الذمة, من الصيام, والحج, والعمرة, وإخراج الزكاة, والإتيان بسنن العبادات وآدابها, فلله ما أجمعها وأنفعها من آية\".\n \n                                    "
      },
      "originalText": "وَلِكُلّٖ وِجۡهَةٌ هُوَ مُوَلِّيهَاۖ فَٱسۡتَبِقُواْ ٱلۡخَيۡرَٰتِۚ أَيۡنَ مَا تَكُونُواْ يَأۡتِ بِكُمُ ٱللَّهُ جَمِيعًاۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٨٤١"
    },
    {
      "number": 156,
      "text": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۖ وَإِنَّهُ لَلْحَقُّ مِنْ رَبِّكَ ۗ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 149,
      "juz": 2,
      "manzil": 1,
      "page": 23,
      "ruku": 19,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ وَإِنَّهُۥ لَلۡحَقُّ مِن رَّبِّكَۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٩٤١\n                                    \n                                    \n                                    هذا أمر ثالث من الله تعالى باستقبال المسجد الحرام ، من جميع أقطار الأرض .\nوقد اختلفوا في حكمة هذا التكرار ثلاث مرات ، فقيل : تأكيد لأنه أول ناسخ وقع في الإسلام على ما نص عليه ابن عباس وغيره ، وقيل : بل هو منزل على أحوال ، فالأمر الأول لمن هو مشاهد الكعبة ، والثاني لمن هو في مكة غائبا عنها ، والثالث لمن هو في بقية البلدان ، هكذا وجهه فخر الدين الرازي . وقال القرطبي : الأول لمن هو بمكة ، والثاني لمن هو في بقية الأمصار ، والثالث لمن خرج ، في الأسفار ، ورجح هذا الجواب القرطبي ، وقيل : إنما ذكر ذلك لتعلقه بما قبله أو بعده من السياق ، فقال : أولا ( قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها ) إلى قوله : ( وإن الذين أوتوا الكتاب ليعلمون أنه الحق من ربهم وما الله بغافل عما يعملون ) فذكر في هذا المقام إجابته إلى طلبته وأمره بالقبلة التي كان يود التوجه إليها ويرضاها\n                                    ",
        "qortoby": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ وَإِنَّهُۥ لَلۡحَقُّ مِن رَّبِّكَۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٩٤١\n                                    \n                                    \n                                    ومن حيث خرجت فول وجهك شطر المسجد الحرام وإنه للحق من ربك وما الله بغافل عما تعملون\nقوله تعالى : ومن حيث خرجت فول وجهك شطر المسجد الحرام قيل : هذا تأكيد للأمر باستقبال الكعبة واهتمام بها لأن موقع التحويل كان صعبا في نفوسهم جدا ، فأكد الأمر ليرى الناس الاهتمام به فيخف عليهم وتسكن نفوسهم إليه . وقيل : أراد بالأول : ول وجهك شطر الكعبة ، أي عاينها إذا صليت تلقاءها . ثم قال : وحيثما كنتم معاشر المسلمين في سائر المساجد بالمدينة وغيرها فولوا وجوهكم شطره ثم قال ومن حيث خرجت يعني وجوب الاستقبال في الأسفار ، فكان هذا أمرا بالتوجه إلى الكعبة في جميع المواضع من نواحي الأرض .\nقلت : هذا القول أحسن من الأول ; لأن فيه حمل كل آية على فائدة . وقد روى الدارقطني عن أنس بن مالك قال : كان النبي صلى الله عليه وسلم إذا كان في سفر فأراد أن يصلي على راحلته استقبل القبلة وكبر ثم صلى حيث توجهت به . أخرجه أبو داود أيضا ، وبه قال الشافعي وأحمد وأبو ثور . وذهب مالك إلى أنه لا يلزمه الاستقبال ، لحديث ابن عمر قال : كان رسول الله صلى الله عليه وسلم يصلي وهو مقبل من مكة إلى المدينة على راحلته . قال : وفيه نزل فأينما تولوا فثم وجه الله وقد تقدم .\nقلت : ولا تعارض بين الحديثين ; لأن هذا من باب المطلق والمقيد ، فقول الشافعي أولى ، وحديث أنس في ذلك حديث صحيح . ويروى أن جعفر بن محمد سئل ما معنى تكرير القصص في القرآن ؟ فقال : علم الله أن كل الناس لا يحفظ القرآن ، فلو لم تكن القصة مكررة لجاز أن تكون عند بعض الناس ولا تكون عند بعض ، فكررت لتكون عند من حفظ البعض .\n                                    ",
        "saadi": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ وَإِنَّهُۥ لَلۡحَقُّ مِن رَّبِّكَۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٩٤١\n                                        \n                                        \n                                        \n                                        أي: { وَمِنْ حَيْثُ خَرَجْتَ } في أسفارك وغيرها, وهذا للعموم, { فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ } أي: جهته. ثم خاطب الأمة عموما فقال: { وَحَيْثُمَا كُنْتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ } وقال: { وَإِنَّهُ لَلْحَقُّ مِنْ رَبِّكَ } أكده بـ \" إن \" واللام, لئلا يقع لأحد فيه أدنى شبهة, ولئلا يظن أنه على سبيل التشهي لا الامتثال. { وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ } بل هو مطلع عليكم في جميع أحوالكم, فتأدبوا معه, وراقبوه بامتثال أوامره, واجتناب نواهيه، فإن أعمالكم غير مغفول عنها, بل مجازون عليها أتم الجزاء, إن خيرا فخير, وإن شرا فشر.\n                                    "
      },
      "originalText": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۖ وَإِنَّهُۥ لَلۡحَقُّ مِن رَّبِّكَۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٩٤١"
    },
    {
      "number": 157,
      "text": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۚ وَحَيْثُ مَا كُنْتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِي وَلِأُتِمَّ نِعْمَتِي عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 150,
      "juz": 2,
      "manzil": 1,
      "page": 23,
      "ruku": 19,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِي وَلِأُتِمَّ نِعۡمَتِي عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُونَ ٠٥١\n                                    \n                                    \n                                    وقال في الأمر الثاني : ( ومن حيث خرجت فول وجهك شطر المسجد الحرام وإنه للحق من ربك وما الله بغافل عما تعملون ) فذكر أنه الحق من الله وارتقى عن المقام الأول ، حيث كان موافقا لرضا الرسول صلى الله عليه وسلم فبين أنه الحق أيضا من الله يحبه ويرتضيه ، وذكر في الأمر الثالث حكمة قطع حجة المخالف من اليهود الذين كانوا يتحججون باستقبال الرسول إلى قبلتهم ، وقد كانوا يعلمون بما في كتبهم أنه سيصرف إلى قبلة إبراهيم ، عليه السلام ، إلى الكعبة ، وكذلك مشركو العرب انقطعت حجتهم لما صرف الرسول صلى الله عليه وسلم عن قبلة اليهود إلى قبلة إبراهيم التي هي أشرف ، وقد كانوا يعظمون الكعبة وأعجبهم استقبال الرسول صلى الله عليه وسلم إليها ، وقيل غير ذلك من الأجوبة عن حكمة التكرار ، وقد بسطها فخر الدين وغيره ، والله سبحانه وتعالى أعلم .\nوقوله : ( لئلا يكون للناس عليكم حجة ) أي : أهل الكتاب ; فإنهم يعلمون من صفة هذه الأمة التوجه إلى الكعبة ، فإذا فقدوا ذلك من صفتها ربما احتجوا بها على المسلمين أو لئلا يحتجوا بموافقة المسلمين إياهم في التوجه إلى بيت المقدس . وهذا أظهر .\nقال أبو العالية : ( لئلا يكون للناس عليكم حجة ) يعني به أهل الكتاب حين قالوا : صرف محمد إلى الكعبة .\nوقالوا : اشتاق الرجل إلى بيت أبيه ودين قومه . وكان حجتهم على النبي صلى الله عليه وسلم انصرافه إلى البيت الحرام أن قالوا : سيرجع إلى ديننا كما رجع إلى قبلتنا .\nقال ابن أبي حاتم : وروي عن مجاهد ، وعطاء ، والضحاك ، والربيع بن أنس ، وقتادة ، والسدي ، نحو هذا .\nوقال هؤلاء في قوله : ( إلا الذين ظلموا منهم ) يعني : مشركي قريش .\nووجه بعضهم حجة الظلمة وهي داحضة أن قالوا : إن هذا الرجل يزعم أنه على دين إبراهيم : فإن كان توجهه إلى بيت المقدس على ملة إبراهيم ، فلم رجع عنه ؟ والجواب : أن الله تعالى اختار له التوجه إلى بيت المقدس أولا لما له تعالى في ذلك من الحكمة ، فأطاع ربه تعالى في ذلك ، ثم صرفه إلى قبلة إبراهيم وهي الكعبة فامتثل أمر الله في ذلك أيضا ، فهو ، صلوات الله وسلامه عليه ، مطيع لله في جميع أحواله ، لا يخرج عن أمر الله طرفة عين ، وأمته تبع له .\nوقوله : ( فلا تخشوهم واخشوني ) أي : لا تخشوا شبه الظلمة المتعنتين ، وأفردوا الخشية لي ، فإنه تعالى هو أهل أن يخشى منه .\nوقوله : ( ولأتم نعمتي عليكم ) عطف على ( لئلا يكون للناس عليكم حجة ) أي : ولأتم نعمتي عليكم فيما شرعت لكم من استقبال الكعبة ، لتكمل لكم الشريعة من جميع وجوهها ( ولعلكم تهتدون ) أي : إلى ما ضلت عنه الأمم هديناكم إليه ، وخصصناكم به ، ولهذا كانت هذه الأمة أشرف الأمم وأفضلها .\n                                    ",
        "qortoby": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِي وَلِأُتِمَّ نِعۡمَتِي عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُونَ ٠٥١\n                                    \n                                    \n                                    قوله تعالى : لئلا يكون للناس عليكم حجة إلا الذين ظلموا منهم قال مجاهد : هم مشركو العرب . وحجتهم قولهم : راجعت قبلتنا ، وقد أجيبوا عن هذا بقوله : قل لله المشرق والمغرب . وقيل : معنى لئلا يكون للناس عليكم حجة لئلا يقولوا لكم : قد أمرتم باستقبال الكعبة ولستم ترونها ، فلما قال عز وجل : وحيثما كنتم فولوا وجوهكم شطره زال هذا . وقال أبو عبيدة : إن \" إلا \" ها هنا بمعنى الواو ، أي والذين ظلموا ، فهو استثناء بمعنى الواو ، ومنه قول الشاعر [ هو الفرزدق ] :\nما بالمدينة دار غير واحدة دار الخليفة إلا دار مروانا\nكأنه قال : إلا دار الخليفة ودار مروان ، وكذا قيل في قوله تعالى : إلا الذين آمنوا وعملوا الصالحات فلهم أجر غير ممنون أي الذين آمنوا . وأبطل الزجاج هذا القول وقال : هذا خطأ عند الحذاق من النحويين ، وفيه بطلان المعاني ، وتكون إلا وما بعدها مستغنى عن ذكرهما . والقول عندهم أن هذا استثناء ليس من الأول ، أي لكن الذين ظلموا منهم فإنهم يحتجون . قال أبو إسحاق الزجاج : أي عرفكم الله أمر الاحتجاج في القبلة في قوله : ولكل وجهة هو موليها لئلا يكون للناس عليكم حجة إلا من ظلم باحتجاجه فيما قد وضح له ، كما تقول : ما لك علي حجة إلا الظلم أو إلا أن تظلمني ، أي ما لك حجة ألبتة ولكنك تظلمني ، فسمى ظلمه حجة لأن المحتج به سماه حجة وإن كانت داحضة . وقال قطرب : يجوز أن يكون المعنى لئلا يكون للناس عليكم حجة إلا على الذين ظلموا ، فالذين بدل من الكاف والميم في عليكم . وقالت فرقة : إلا الذين استثناء متصل ، روي معناه عن ابن عباس وغيره ، واختاره الطبري وقال : نفى الله أن يكون لأحد حجة على النبي صلى الله عليه وسلم وأصحابه في استقبالهم الكعبة . والمعنى : لا حجة لأحد عليكم إلا الحجة الداحضة . حيث قالوا : ما ولاهم ، وتحير محمد في دينه ، وما توجه إلى قبلتنا إلا أنا كنا أهدى منه ، وغير ذلك من الأقوال التي لم تنبعث إلا من عابد وثن أو يهودي أو منافق . والحجة بمعنى المحاجة التي هي المخاصمة والمجادلة . وسماها الله حجة وحكم بفسادها حيث كانت من ظلمة . وقال ابن عطية : وقيل إن الاستثناء منقطع ، وهذا على أن يكون المراد بالناس اليهود ، ثم استثنى كفار العرب ، كأنه قال : لكن الذين ظلموا يحاجونكم ، وقوله منهم يرد هذا التأويل . والمعنى لكن الذين ظلموا ، يعني كفار قريش في قولهم : رجع محمد إلى قبلتنا وسيرجع إلى ديننا كله . ويدخل في ذلك كل من تكلم في النازلة من غير اليهود . وقرأ ابن عباس وزيد بن علي وابن زيد \" ألا الذين ظلموا \" بفتح الهمزة وتخفيف اللام على معنى استفتاح الكلام ، فيكون الذين ظلموا ابتداء ، أو على معنى الإغراء ، فيكون الذين منصوبا بفعل مقدر .\nقوله تعالى : فلا تخشوهم يريد الناس واخشوني الخشية أصلها طمأنينة في القلب تبعث على التوقي . والخوف : فزع القلب تخف له الأعضاء ، ولخفة الأعضاء به سمي خوفا . ومعنى الآية التحقير لكل من سوى الله تعالى ، والأمر باطراح أمرهم ومراعاة أمر الله تعالى .\nقوله تعالى : ولأتم نعمتي عليكم معطوف على لئلا يكون أي ولأن أتم ، قاله الأخفش . وقيل : مقطوع في موضع رفع بالابتداء والخبر مضمر ، التقدير : ولأتم نعمتي عليكم عرفتكم قبلتي ، قالهالزجاج . وإتمام النعمة الهداية إلى القبلة ، وقيل : دخول الجنة . قال سعيد بن جبير : ولم تتم نعمة الله على عبد حتى يدخله الجنة .\nولعلكم تهتدون تقدم .\n                                    ",
        "saadi": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِي وَلِأُتِمَّ نِعۡمَتِي عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُونَ ٠٥١\n                                        \n                                        \n                                        \n                                        وقال هنا: { لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ } أي: شرعنا لكم استقبال الكعبة المشرفة, لينقطع عنكم احتجاج الناس من أهل الكتاب والمشركين، فإنه لو بقي مستقبلا بيت المقدس, لتوجهت عليه الحجة، فإن أهل الكتاب, يجدون في كتابهم أن قبلته المستقرة, هي الكعبة البيت الحرام، والمشركون يرون أن من مفاخرهم, هذا البيت العظيم, وأنه من ملة إبراهيم, وأنه إذا لم يستقبله محمد صلى الله عليه وسلم, توجهت نحوه حججهم, وقالوا: كيف يدعي أنه على ملة إبراهيم, وهو من ذريته, وقد ترك استقبال قبلته؟ فباستقبال الكعبة قامت الحجة على أهل الكتاب والمشركين, وانقطعت حججهم عليه. { إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ } أي: من احتج منهم بحجة, هو ظالم فيها, وليس لها مستند إلا اتباع الهوى والظلم, فهذا لا سبيل إلى إقناعه والاحتجاج عليه، وكذلك لا معنى لجعل الشبهة التي يوردونها على سبيل الاحتجاج محلا يؤبه لها, ولا يلقى لها بال, فلهذا قال تعالى: { فَلَا تَخْشَوْهُمْ } لأن حجتهم باطلة, والباطل كاسمه مخذول, مخذول صاحبه، وهذا بخلاف صاحب الحق, فإن للحق صولة وعزا, يوجب خشية من هو معه, وأمر تعالى بخشيته, التي هي أصل كل خير، فمن لم يخش الله, لم ينكف عن معصيته, ولم يمتثل أمره. وكان صرف المسلمين إلى الكعبة, مما حصلت فيه فتنة كبيرة, أشاعها أهل الكتاب, والمنافقون, والمشركون, وأكثروا فيها من الكلام والشبه، فلهذا بسطها الله تعالى, وبينها أكمل بيان, وأكدها بأنواع من التأكيدات, التي تضمنتها هذه الآيات. منها: الأمر بها, ثلاث مرات, مع كفاية المرة الواحدة، ومنها: أن المعهود, أن الأمر, إما أن يكون للرسول, فتدخل فيه الأمة تبعا, أو للأمة عموما، وفي هذه الآية أمر فيها الرسول بالخصوص في قوله: { فَوَلِّ وَجْهَكَ } والأمة عموما في قوله: { فَوَلُّوا وُجُوهَكُمْ } ومنها: أنه رد فيه جميع الاحتجاجات الباطلة, التي أوردها أهل العناد وأبطلها شبهة شبهة, كما تقدم توضيحها، ومنها: أنه قطع الأطماع من اتباع الرسول قبلة أهل الكتاب، ومنها قوله: { وَإِنَّهُ لَلْحَقُّ مِنْ رَبِّكَ } فمجرد إخبار الصادق العظيم كاف شاف, ولكن مع هذا قال: { وَإِنَّهُ لَلْحَقُّ مِنْ رَبِّكَ } ومنها: أنه أخبر - وهو العالم بالخفيات - أن أهل الكتاب متقرر عندهم, صحة هذا الأمر, ولكنهم يكتمون هذه الشهادة مع العلم. ولما كان توليته لنا إلى استقبال القبلة, نعمة عظيمة, وكان لطفه بهذه الأمة ورحمته, لم يزل يتزايد, وكلما شرع لهم شريعة, فهي نعمة عظيمة قال: { وَلِأُتِمَّ نِعْمَتِي عَلَيْكُمْ } فأصل النعمة, الهداية لدينه, بإرسال رسوله, وإنزال كتابه، ثم بعد ذلك, النعم المتممات لهذا الأصل, لا تعد كثرة, ولا تحصر, منذ بعث الله رسوله إلى أن قرب رحيله من الدنيا، وقد أعطاه الله من الأحوال والنعم, وأعطى أمته, ما أتم به نعمته عليه وعليهم, وأنزل الله عليه: { الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا } فلله الحمد على فضله, الذي لا نبلغ له عدا, فضلا عن القيام بشكره، { وَلَعَلَّكُمْ تَهْتَدُونَ } أي: تعلمون الحق, وتعملون به، فالله تبارك وتعالى - من رحمته - بالعباد, قد يسر لهم أسباب الهداية غاية التيسير, ونبههم على سلوك طرقها, وبينها لهم أتم تبيين، حتى إن من جملة ذلك أنه يقيض للحق, المعاندين له فيجادلون فيه, فيتضح بذلك الحق, وتظهر آياته وأعلامه, ويتضح بطلان الباطل, وأنه لا حقيقة له، ولولا قيامه في مقابلة الحق, لربما لم يتبين حاله لأكثر الخلق، وبضدها تتبين الأشياء، فلولا الليل, ما عرف فضل النهار، ولولا القبيح, ما عرف فضل الحسن، ولولا الظلمة ما عرف منفعة النور، ولولا الباطل ما اتضح الحق اتضاحا ظاهرا، فلله الحمد على ذلك.\n                                    "
      },
      "originalText": "وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِي وَلِأُتِمَّ نِعۡمَتِي عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُونَ ٠٥١"
    },
    {
      "number": 158,
      "text": "كَمَا أَرْسَلْنَا فِيكُمْ رَسُولًا مِنْكُمْ يَتْلُو عَلَيْكُمْ آيَاتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُعَلِّمُكُمْ مَا لَمْ تَكُونُوا تَعْلَمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 151,
      "juz": 2,
      "manzil": 1,
      "page": 23,
      "ruku": 19,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كَمَآ أَرۡسَلۡنَا فِيكُمۡ رَسُولٗا مِّنكُمۡ يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِنَا وَيُزَكِّيكُمۡ وَيُعَلِّمُكُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُعَلِّمُكُم مَّا لَمۡ تَكُونُواْ تَعۡلَمُونَ ١٥١\n                                    \n                                    \n                                    يذكر تعالى عباده المؤمنين ما أنعم به عليهم من بعثة الرسول محمد صلى الله عليه وسلم إليهم ، يتلو عليهم آيات الله مبينات ويزكيهم ، أي : يطهرهم من رذائل الأخلاق ودنس النفوس وأفعال الجاهلية ، ويخرجهم من الظلمات إلى النور ، ويعلمهم الكتاب وهو القرآن والحكمة وهي السنة ويعلمهم ما لم يكونوا يعلمون . فكانوا في الجاهلية الجهلاء يسفهون بالقول الفرى ، فانتقلوا ببركة رسالته ، ويمن سفارته ، إلى حال الأولياء ، وسجايا العلماء فصاروا أعمق الناس علما ، وأبرهم قلوبا ، وأقلهم تكلفا ، وأصدقهم لهجة . وقال تعالى : ( لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم يتلو عليهم آياته ويزكيهم ) الآية [ آل عمران : 164 ] . وذم من لم يعرف قدر هذه النعمة ، فقال تعالى : ( ألم تر إلى الذين بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار ) [ إبراهيم : 28 ] .\nقال ابن عباس : يعني بنعمة الله محمدا صلى الله عليه وسلم ; ولهذا ندب الله المؤمنين إلى الاعتراف بهذه النعمة ومقابلتها بذكره وشكره\n                                    ",
        "qortoby": "كَمَآ أَرۡسَلۡنَا فِيكُمۡ رَسُولٗا مِّنكُمۡ يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِنَا وَيُزَكِّيكُمۡ وَيُعَلِّمُكُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُعَلِّمُكُم مَّا لَمۡ تَكُونُواْ تَعۡلَمُونَ ١٥١\n                                    \n                                    \n                                    قوله تعالى : كما أرسلنا فيكم رسولا منكم يتلو عليكم آياتنا ويزكيكم ويعلمكم الكتاب والحكمة ويعلمكم ما لم تكونوا تعلمون قوله تعالى : كما أرسلنا الكاف في موضع نصب على النعت لمصدر محذوف ، المعنى : ولأتم نعمتي عليكم إتماما مثل ما أرسلنا ، قاله الفراء . قال ابن عطية : وهذا أحسن الأقوال ، أي ولأتم نعمتي عليكم في بيان سنة إبراهيم عليه السلام مثل ما أرسلنا . وقيل : المعنى ولعلكم تهتدون اهتداء مثل ما أرسلنا . وقيل : هي في موضع نصب على الحال ، والمعنى : ولأتم نعمتي عليكم في هذه الحال . والتشبيه واقع على أن النعمة في القبلة كالنعمة في الرسالة ، وأن الذكر المأمور به في عظمه كعظم النعمة . وقيل : معنى الكلام على التقديم والتأخير ، أي فاذكروني كما أرسلنا روي عن علي رضي الله عنه واختاره الزجاج . أي كما أرسلنا فيكم رسولا تعرفونه بالصدق فاذكروني بالتوحيد والتصديق به . والوقف على تهتدون على هذا القول جائز .\nقلت : وهذا اختيار الترمذي الحكيم في كتابه ، أي كما فعلت بكم هذا من المنن التي عددتها عليكم فاذكروني بالشكر أذكركم بالمزيد ; لأن في ذكركم ذلك شكرا لي ، وقد وعدتكم بالمزيد على الشكر ، وهو قوله : لئن شكرتم لأزيدنكم ، فالكاف في قوله كما هنا ، وفي الأنفال كما أخرجك ربك وفي آخر الحجر كما أنزلنا على المقتسمين متعلقة بما بعده ، على ما يأتي بيانه .\n                                    ",
        "saadi": "كَمَآ أَرۡسَلۡنَا فِيكُمۡ رَسُولٗا مِّنكُمۡ يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِنَا وَيُزَكِّيكُمۡ وَيُعَلِّمُكُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُعَلِّمُكُم مَّا لَمۡ تَكُونُواْ تَعۡلَمُونَ ١٥١\n                                        \n                                        \n                                        \n                                        يقول تعالى: إن إنعامنا عليكم باستقبال الكعبة وإتمامها بالشرائع والنعم المتممة, ليس ذلك ببدع من إحساننا, ولا بأوله, بل أنعمنا عليكم بأصول النعم ومتمماتها, فأبلغها إرسالنا إليكم هذا الرسول الكريم منكم, تعرفون نسبه وصدقه, وأمانته وكماله ونصحه. { يَتْلُو عَلَيْكُمْ آيَاتِنَا } وهذا يعم الآيات القرآنية وغيرها، فهو يتلو عليكم الآيات المبينة للحق من الباطل, والهدى من الضلال, التي دلتكم أولا, على توحيد الله وكماله, ثم على صدق رسوله, ووجوب الإيمان به, ثم على جميع ما أخبر به من المعاد والغيوب, حتى حصل لكم الهداية التامة, والعلم اليقيني. { وَيُزَكِّيكُمْ } أي: يطهر أخلاقكم ونفوسكم, بتربيتها على الأخلاق الجميلة, وتنزيهها عن الأخلاق الرذيلة, وذلك كتزكيتكم من الشرك, إلى التوحيد ومن الرياء إلى الإخلاص, ومن الكذب إلى الصدق, ومن الخيانة إلى الأمانة, ومن الكبر إلى التواضع, ومن سوء الخلق إلى حسن الخلق, ومن التباغض والتهاجر والتقاطع, إلى التحاب والتواصل والتوادد, وغير ذلك من أنواع التزكية. { وَيُعَلِّمُكُمُ الْكِتَابَ } أي: القرآن, ألفاظه ومعانيه، { وَالْحِكْمَةَ } قيل: هي السنة, وقيل: الحكمة, معرفة أسرار الشريعة والفقه فيها, وتنزيل الأمور منازلها. فيكون - على هذا - تعليم السنة داخلا في تعليم الكتاب, لأن السنة, تبين القرآن وتفسره, وتعبر عنه، { وَيُعَلِّمُكُمْ مَا لَمْ تَكُونُوا تَعْلَمُونَ } لأنهم كانوا قبل بعثته, في ضلال مبين, لا علم ولا عمل، فكل علم أو عمل, نالته هذه الأمة فعلى يده صلى الله عليه وسلم, وبسببه كان، فهذه النعم هي أصول النعم على الإطلاق, ولهي أكبر نعم ينعم بها على عباده، فوظيفتهم شكر الله عليها والقيام بها؛ فلهذا قال تعالى: { فَاذْكُرُونِي أَذْكُرْكُمْ }\n                                    "
      },
      "originalText": "كَمَآ أَرۡسَلۡنَا فِيكُمۡ رَسُولٗا مِّنكُمۡ يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِنَا وَيُزَكِّيكُمۡ وَيُعَلِّمُكُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُعَلِّمُكُم مَّا لَمۡ تَكُونُواْ تَعۡلَمُونَ ١٥١"
    },
    {
      "number": 159,
      "text": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 152,
      "juz": 2,
      "manzil": 1,
      "page": 23,
      "ruku": 19,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَٱذۡكُرُونِيٓ أَذۡكُرۡكُمۡ وَٱشۡكُرُواْ لِي وَلَا تَكۡفُرُونِ ٢٥١\n                                    \n                                    \n                                    فقال : ( فاذكروني أذكركم واشكروا لي ولا تكفرون ) .\nقال مجاهد في قوله : ( كما أرسلنا فيكم رسولا منكم ) يقول : كما فعلت فاذكروني .\nقال عبد الله بن وهب ، عن هشام بن سعيد ، عن زيد بن أسلم : أن موسى ، عليه السلام ، قال : يا رب ، كيف أشكرك ؟ قال له ربه : تذكرني ولا تنساني ، فإذا ذكرتني فقد شكرتني ، وإذا نسيتني فقد كفرتني .\nوقال الحسن البصري ، وأبو العالية ، والسدي ، والربيع بن أنس ، إن الله يذكر من ذكره ، ويزيد من شكره ويعذب من كفره .\nوقال بعض السلف في قوله تعالى : ( اتقوا الله حق تقاته ) [ آل عمران : 102 ] قال : هو أن يطاع فلا يعصى ، ويذكر فلا ينسى ، ويشكر فلا يكفر .\nوقال ابن أبي حاتم : حدثنا الحسن بن محمد بن الصباح ، أخبرنا يزيد بن هارون ، أخبرنا عمارة الصيدلاني ، حدثنا مكحول الأزدي قال : قلت لابن عمر : أرأيت قاتل النفس ، وشارب الخمر والسارق والزاني يذكر الله ، وقد قال الله تعالى : ( فاذكروني أذكركم ) ؟ قال : إذا ذكر الله هذا ذكره الله بلعنته ، حتى يسكت .\nوقال الحسن البصري في قوله : ( فاذكروني أذكركم ) قال : اذكروني ، فيما افترضت عليكم أذكركم فيما أوجبت لكم على نفسي .\nوعن سعيد بن جبير : اذكروني بطاعتي أذكركم بمغفرتي ، وفي رواية : برحمتي .\nوعن ابن عباس في قوله ( فاذكروني أذكركم ) قال : ذكر الله إياكم أكبر من ذكركم إياه .\nوفي الحديث الصحيح : \" يقول الله تعالى : من ذكرني في نفسه ذكرته في نفسي ، ومن ذكرني في ملأ ذكرته في ملأ خير منه \" .\nقال الإمام أحمد : حدثنا عبد الرزاق ، أخبرنا معمر ، عن قتادة ، عن أنس قال : قال رسول الله صلى الله عليه وسلم : \" قال الله عز وجل : يا ابن آدم ، إن ذكرتني في نفسك ذكرتك في نفسي ، وإن ذكرتني في ملأ ذكرتك ، في ملأ من الملائكة أو قال : [ في ] ملأ خير منهم ، وإن دنوت مني شبرا دنوت منك ذراعا ، وإن دنوت مني ذراعا دنوت منك باعا ، وإن أتيتني تمشي أتيتك أهرول \"\nصحيح الإسناد : أخرجه البخاري من حديث قتادة . وعنده قال قتادة : الله أقرب بالرحمة .\nوقوله تعالى : ( واشكروا لي ولا تكفرون ) أمر الله تعالى بشكره ، ووعده على شكره بمزيد الخير ، فقال : ( وإذ تأذن ربكم لئن شكرتم لأزيدنكم ولئن كفرتم إن عذابي لشديد ) [ إبراهيم : 7 ] .\nوقال الإمام أحمد : حدثنا روح ، حدثنا شعبة ، عن الفضيل بن فضالة رجل من قيس حدثنا أبو رجاء العطاردي ، قال : خرج علينا عمران بن حصين وعليه مطرف من خز لم نره عليه قبل ذلك ولا بعده ، فقال : إن رسول الله صلى الله عليه وسلم قال : \" من أنعم الله عليه نعمة فإن الله يحب أن يرى أثر نعمته على خلقه \" . وقال روح مرة : \" على عبده \" .\n                                    ",
        "qortoby": "فَٱذۡكُرُونِيٓ أَذۡكُرۡكُمۡ وَٱشۡكُرُواْ لِي وَلَا تَكۡفُرُونِ ٢٥١\n                                    \n                                    \n                                    قوله تعالى : فاذكروني أذكركم واشكروا لي ولا تكفرون يا أيها الذين آمنوا استعينوا بالصبر والصلاة إن الله مع الصابرين\nقوله تعالى : فاذكروني أذكركم أمر وجوابه ، وفيه معنى المجازاة فلذلك جزم . وأصل الذكر التنبه بالقلب للمذكور والتيقظ له . وسمي الذكر باللسان ذكرا لأنه دلالة على الذكر القلبي ، غير أنه لما كثر إطلاق الذكر على القول اللساني صار هو السابق للفهم .\nومعنى الآية : اذكروني بالطاعة أذكركم بالثواب والمغفرة ، قاله سعيد بن جبير . وقال أيضا : الذكر طاعة الله ، فمن لم يطعه لم يذكره وإن أكثر التسبيح والتهليل وقراءة القرآن ، وروي عن النبي صلى الله عليه وسلم : من أطاع الله فقد ذكر الله وإن أقل صلاته وصومه وصنيعه للخير ومن عصى الله فقد نسي الله وإن كثر صلاته وصومه وصنيعه للخير ، ذكره أبو عبد الله محمد بن خويز منداد في \" أحكام القرآن \" له . وقال أبو عثمان النهدي : إني لأعلم الساعة التي يذكرنا الله فيها ، قيل له : ومن أين تعلمها ؟ قال يقول الله عز وجل : فاذكروني أذكركم . وقال السدي : ليس من عبد يذكر الله إلا ذكره الله عز وجل ، لا يذكره مؤمن إلا ذكره الله برحمته ، ولا يذكره كافر إلا ذكره الله بعذاب . وسئل أبو عثمان فقيل له : نذكر الله ولا نجد في قلوبنا حلاوة ؟ فقال : احمدوا الله تعالى على أن زين جارحة من جوارحكم بطاعته . وقال ذو النون المصري رحمه الله : من ذكر الله تعالى ذكرا على الحقيقة نسي في جنب ذكره كل شيء ، حفظ الله عليه كل شيء ، وكان له عوضا من كل شيء . وقال معاذ بن جبل رضي الله عنه : ما عمل ابن آدم من عمل أنجى له من عذاب الله من ذكر الله . والأحاديث في فضل الذكر وثوابه كثيرة خرجها الأئمة . روى ابن ماجه عن عبد الله بن بسر أن أعرابيا قال لرسول الله صلى الله عليه وسلم : إن شرائع الإسلام قد كثرت علي فأنبئني منها بشيء أتشبث به ، قال : لا يزال لسانك رطبا من ذكر الله عز وجل . وخرج عن أبي هريرة عن النبي صلى الله عليه وسلم قال : إن الله عز وجل يقول أنا مع عبدي إذا هو ذكرني وتحركت بي شفتاه . وسيأتي لهذا الباب مزيد بيان عند قوله تعالى : يا أيها الذين آمنوا اذكروا الله ذكرا كثيرا وأن المراد ذكر القلب الذي يجب استدامته في عموم الحالات .\nقوله تعالى : واشكروا لي ولا تكفرون قال الفراء يقال : شكرتك وشكرت لك ، ونصحتك ونصحت لك ، والفصيح الأول . والشكر معرفة الإحسان والتحدث به ، وأصله في اللغة الظهور ، وقد تقدم . فشكر العبد لله تعالى ثناؤه عليه بذكر إحسانه إليه ، وشكر الحق سبحانه للعبد ثناؤه عليه بطاعته له ، إلا أن شكر العبد نطق باللسان وإقرار بالقلب بإنعام الرب مع الطاعات .\nقوله تعالى : ولا تكفرون نهي ، ولذلك حذفت منه نون الجماعة ، وهذه نون المتكلم . وحذفت الياء لأنها رأس آية ، وإثباتها أحسن في غير القرآن ، أي لا تكفروا نعمتي وأيادي . فالكفر هنا ستر النعمة لا التكذيب . وقد مضى القول في الكفر لغة ، ومضى القول في معنى الاستعانة بالصبر والصلاة ، فلا معنى للإعادة .\n                                    ",
        "saadi": "فَٱذۡكُرُونِيٓ أَذۡكُرۡكُمۡ وَٱشۡكُرُواْ لِي وَلَا تَكۡفُرُونِ ٢٥١\n                                        \n                                        \n                                        \n                                        { فَاذْكُرُونِي أَذْكُرْكُمْ } فأمر تعالى بذكره, ووعد عليه أفضل جزاء, وهو ذكره لمن ذكره, كما قال تعالى على لسان رسوله: { من ذكرني في نفسه ذكرته في نفسي, ومن ذكرني في ملأ ذكرته في ملأ خير منهم } وذكر الله تعالى, أفضله, ما تواطأ عليه القلب واللسان, وهو الذكر الذي يثمر معرفة الله ومحبته, وكثرة ثوابه، والذكر هو رأس الشكر, فلهذا أمر به خصوصا, ثم من بعده أمر بالشكر عموما فقال: { وَاشْكُرُوا لِي } أي: على ما أنعمت عليكم بهذه النعم، ودفعت عنكم صنوف النقم، والشكر يكون بالقلب, إقرارا بالنعم, واعترافا, وباللسان, ذكرا وثناء, وبالجوارح, طاعة لله وانقيادا لأمره, واجتنابا لنهيه, فالشكر فيه بقاء النعمة الموجودة, وزيادة في النعم المفقودة، قال تعالى: { لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ } وفي الإتيان بالأمر بالشكر بعد النعم الدينية, من العلم وتزكية الأخلاق والتوفيق للأعمال, بيان أنها أكبر النعم, بل هي النعم الحقيقية؟ التي تدوم, إذا زال غيرها وأنه ينبغي لمن وفقوا لعلم أو عمل, أن يشكروا الله على ذلك, ليزيدهم من فضله, وليندفع عنهم الإعجاب, فيشتغلوا بالشكر. ولما كان الشكر ضده الكفر, نهى عن ضده فقال: { وَلَا تَكْفُرُونِ } المراد بالكفر هاهنا ما يقابل الشكر, فهو كفر النعم وجحدها, وعدم القيام بها، ويحتمل أن يكون المعنى عاما, فيكون الكفر أنواعا كثيرة, أعظمه الكفر بالله, ثم أنواع المعاصي, على اختلاف أنواعها وأجناسها, من الشرك, فما دونه.\n                                    "
      },
      "originalText": "فَٱذۡكُرُونِيٓ أَذۡكُرۡكُمۡ وَٱشۡكُرُواْ لِي وَلَا تَكۡفُرُونِ ٢٥١"
    },
    {
      "number": 160,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 153,
      "juz": 2,
      "manzil": 1,
      "page": 23,
      "ruku": 20,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ ٣٥١\n                                    \n                                    \n                                    لما فرغ تعالى من بيان الأمر بالشكر شرع في بيان الصبر ، والإرشاد إلى الاستعانة بالصبر والصلاة ، فإن العبد إما أن يكون في نعمة فيشكر عليها ، أو في نقمة فيصبر عليها ; كما جاء في الحديث : \" عجبا للمؤمن ، لا يقضي الله له قضاء إلا كان خيرا له : إن أصابته سراء ، فشكر ، كان خيرا له ; وإن أصابته ضراء فصبر كان خيرا له \" .\nوبين تعالى أن أجود ما يستعان به على تحمل المصائب الصبر والصلاة ، كما تقدم في قوله : ( واستعينوا بالصبر والصلاة وإنها لكبيرة إلا على الخاشعين ) [ البقرة : 45 ] . وفي الحديث كان رسول الله صلى الله عليه وسلم إذا حزبه أمر صلى . والصبر صبران ، فصبر على ترك المحارم والمآثم ، وصبر على فعل الطاعات والقربات . والثاني أكثر ثوابا لأنه المقصود . كما قال عبد الرحمن بن زيد بن أسلم : الصبر في بابين ، الصبر لله بما أحب ، وإن ثقل على الأنفس والأبدان ، والصبر لله عما كره وإن نازعت إليه الأهواء . فمن كان هكذا ، فهو من الصابرين الذين يسلم عليهم ، إن شاء الله .\nوقال علي بن الحسين زين العابدين : إذا جمع الله الأولين والآخرين ينادي مناد : أين الصابرون ليدخلوا الجنة قبل الحساب ؟ قال : فيقوم عنق من الناس ، فتتلقاهم الملائكة ، فيقولون : إلى أين يا بني آدم ؟ فيقولون : إلى الجنة . فيقولون : وقبل الحساب ؟ قالوا : نعم ، قالوا : ومن أنتم ؟ قالوا : الصابرون ، قالوا : وما كان صبركم ؟ قالوا : صبرنا على طاعة الله ، وصبرنا عن معصية الله ، حتى توفانا الله . قالوا : أنتم كما قلتم ، ادخلوا الجنة ، فنعم أجر العاملين .\nقلت : ويشهد لهذا قوله تعالى : ( إنما يوفى الصابرون أجرهم بغير حساب ) [ الزمر : 10 ] .\nوقال سعيد بن جبير : الصبر اعتراف العبد لله بما أصاب منه ، واحتسابه عند الله رجاء ثوابه ، وقد يجزع الرجل وهو متجلد لا يرى منه إلا الصبر .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ ٣٥١\n                                    \n                                    \n                                    مَضَى الْقَوْل فِي مَعْنَى الِاسْتِعَانَة بِالصَّبْرِ وَالصَّلَاة , فَلَا مَعْنَى لِلْإِعَادَةِ .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ ٣٥١\n                                        \n                                        \n                                        \n                                        أمر الله تعالى المؤمنين, بالاستعانة على أمورهم الدينية والدنيوية { بِالصَّبْرِ وَالصَّلَاةِ } فالصبر هو: حبس النفس وكفها عما تكره, فهو ثلاثة أقسام: صبرها على طاعة الله حتى تؤديها, وعن معصية الله حتى تتركها, وعلى أقدار الله المؤلمة فلا تتسخطها، فالصبر هو المعونة العظيمة على كل أمر, فلا سبيل لغير الصابر, أن يدرك مطلوبه، خصوصا الطاعات الشاقة المستمرة, فإنها مفتقرة أشد الافتقار, إلى تحمل الصبر, وتجرع المرارة الشاقة، فإذا لازم صاحبها الصبر, فاز بالنجاح, وإن رده المكروه والمشقة عن الصبر والملازمة عليها, لم يدرك شيئا, وحصل على الحرمان، وكذلك المعصية التي تشتد دواعي النفس ونوازعها إليها وهي في محل قدرة العبد، فهذه لا يمكن تركها إلا بصبر عظيم, وكف لدواعي قلبه ونوازعها لله تعالى, واستعانة بالله على العصمة منها, فإنها من الفتن الكبار. وكذلك البلاء الشاق, خصوصا إن استمر, فهذا تضعف معه القوى النفسانية والجسدية, ويوجد مقتضاها, وهو التسخط, إن لم يقاومها صاحبها بالصبر لله, والتوكل عليه, واللجأ إليه, والافتقار على الدوام. فعلمت أن الصبر محتاج إليه العبد, بل مضطر إليه في كل حالة من أحواله، فلهذا أمر الله تعالى به, وأخبر أنه { مَعَ الصَّابِرِينَ } أي: مع من كان الصبر لهم خلقا, وصفة, وملكة بمعونته وتوفيقه, وتسديده، فهانت عليهم بذلك, المشاق والمكاره, وسهل عليهم كل عظيم, وزالت عنهم كل صعوبة، وهذه معية خاصة, تقتضي محبته ومعونته, ونصره وقربه, وهذه [منقبة عظيمة] للصابرين، فلو لم يكن للصابرين فضيلة إلا أنهم فازوا بهذه المعية من الله, لكفى بها فضلا وشرفا، وأما المعية العامة, فهي معية العلم والقدرة, كما في قوله تعالى: { وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ } وهذه عامة للخلق. وأمر تعالى بالاستعانة بالصلاة لأن الصلاة هي عماد الدين, ونور المؤمنين, وهي الصلة بين العبد وبين ربه، فإذا كانت صلاة العبد صلاة كاملة, مجتمعا فيها ما يلزم فيها, وما يسن, وحصل فيها حضور القلب, الذي هو لبها فصار العبد إذا دخل فيها, استشعر دخوله على ربه, ووقوفه بين يديه, موقف العبد الخادم المتأدب, مستحضرا لكل ما يقوله وما يفعله, مستغرقا بمناجاة ربه ودعائه لا جرم أن هذه الصلاة, من أكبر المعونة على جميع الأمور فإن الصلاة تنهى عن الفحشاء والمنكر، ولأن هذا الحضور الذي يكون في الصلاة, يوجب للعبد في قلبه, وصفا, وداعيا يدعوه إلى امتثال أوامر ربه, واجتناب نواهيه، هذه هي الصلاة التي أمر الله أن نستعين بها على كل شيء.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ ٣٥١"
    }
  ]
}