{
  "number": 236,
  "ayahsNumber": 10,
  "ayahs": [
    {
      "number": 1601,
      "text": "قَالَ يَا بُنَيَّ لَا تَقْصُصْ رُؤْيَاكَ عَلَىٰ إِخْوَتِكَ فَيَكِيدُوا لَكَ كَيْدًا ۖ إِنَّ الشَّيْطَانَ لِلْإِنْسَانِ عَدُوٌّ مُبِينٌ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 5,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 193,
      "hizbQuarter": 94,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ ٥\n                                    \n                                    \n                                    يقول تعالى مخبرا عن قول يعقوب لابنه يوسف حين قص عليه ما رأى من هذه الرؤيا ، التي تعبيرها خضوع إخوته له وتعظيمهم إياه تعظيما زائدا ، بحيث يخرون له ساجدين إجلالا وإكراما واحتراما فخشي يعقوب ، عليه السلام ، أن يحدث بهذا المنام أحدا من إخوته فيحسدوه على ذلك ، فيبغوا له الغوائل ، حسدا منهم له; ولهذا قال له : ( لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا ) أي : يحتالوا لك حيلة يردونك فيها . ولهذا ثبتت السنة عن رسول الله - صلى الله عليه وسلم - أنه قال : \" إذا رأى أحدكم ما يحب فليحدث به ، وإذا رأى ما يكره فليتحول إلى جنبه الآخر وليتفل عن يساره ثلاثا ، وليستعذ بالله من شرها ، ولا يحدث بها أحدا ، فإنها لن تضره \" . وفي الحديث الآخر الذي رواه الإمام أحمد ، وبعض أهل السنن ، من رواية معاوية بن حيدة القشيري أنه قال : قال رسول الله ، صلى الله عليه وسلم : \" الرؤيا على رجل طائر ما لم تعبر ، فإذا عبرت وقعت \" ومن هذا يؤخذ الأمر بكتمان النعمة حتى توجد وتظهر ، كما ورد في حديث : \" استعينوا على قضاء الحوائج بكتمانها ، فإن كل ذي نعمة محسود \"\n                                    ",
        "qortoby": "قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ ٥\n                                    \n                                    \n                                    قوله تعالى : قال يابني لا تقصص رؤياك على إخوتك فيكيدوا لك كيدا إن الشيطان للإنسان عدو مبين فيه إحدى عشرة مسألة : الأولى : فيكيدوا لك كيدا أي يحتالوا في هلاكك ; لأن تأويلها ظاهر ; فربما يحملهم الشيطان على قصدك بسوء حينئذ . واللام في لك تأكيد . كقوله : إن كنتم للرؤيا تعبرون .\nالثانية : الرؤيا حالة شريفة ، ومنزلة رفيعة ، قال - صلى الله عليه وسلم - : لم يبق بعدي من المبشرات إلا الرؤيا الصالحة الصادقة يراها الرجل الصالح أو ترى له . وقال : أصدقكم رؤيا أصدقكم حديثا . وحكم - صلى الله عليه وسلم - بأنها جزء من ستة وأربعين جزءا من النبوة ، وروي من سبعين جزءا من النبوة . وروي من حديث ابن عباس - رضي الله عنهما - جزءا من أربعين جزءا من النبوة . ومن حديث ابن عمر جزء من تسعة وأربعين جزءا . ومن حديث العباس جزء من خمسين جزءا من النبوة . ومن حديث أنس من ستة وعشرين . وعن عبادة بن الصامت من أربعة وأربعين من النبوة . والصحيح منها حديث الستة والأربعين ، ويتلوه في الصحة حديث السبعين ; ولم يخرج مسلم في صحيحه غير هذين الحديثين ، أما سائرها فمن أحاديث الشيوخ ; قاله ابن بطال . قال أبو عبد الله المازري : والأكثر والأصح عند أهل الحديث من ستة وأربعين . قال الطبري : والصواب أن يقال إن عامة هذه الأحاديث أو أكثرها صحاح ، ولكل حديث منها مخرج معقول ; فأما قوله : إنها جزء من سبعين جزءا من النبوة فإن ذلك قول عام في كل رؤيا صالحة صادقة ، ولكل مسلم رآها في منامه على أي أحواله كان ; وأما قوله : إنها من أربعين أو ستة وأربعين فإنه يريد بذلك من كان صاحبها بالحال التي ذكرت عن الصديق - رضي الله عنه - أنه كان بها ; فمن كان من أهل إسباغ الوضوء في السبرات ، والصبر في الله على المكروهات ، وانتظار الصلاة بعد الصلاة ، فرؤياه الصالحة - إن شاء الله - جزء من أربعين جزءا من النبوة ، ومن كانت حاله في ذاته بين ذلك فرؤياه الصادقة بين جزأين ما بين الأربعين إلى الستين لا تنقص عن سبعين ، وتزيد على الأربعين وإلى هذا المعنى أشار أبو عمر بن عبد البر فقال : اختلاف الآثار في هذا الباب في عدد أجزاء الرؤيا ليس ذلك عندي اختلافا متضادا متدافعا - والله أعلم - لأنه يحتمل أن تكون الرؤيا الصالحة من بعض من يراها على حسب ما يكون من صدق الحديث ، وأداء الأمانة ، والدين المتين ، وحسن اليقين ; فعلى قدر اختلاف الناس فيما وصفنا تكون الرؤيا منهم على الأجزاء المختلفة العدد فمن خلصت نيته في عبادة ربه ويقينه وصدق حديثه كانت رؤياه أصدق وإلى النبوة أقرب كما أن الأنبياء يتفاضلون ، قال الله تعالى : ولقد فضلنا بعض النبيين على بعض .\nقلت : فهذا التأويل يجمع شتات الأحاديث ، وهو أولى من تفسير بعضها دون بعض وطرحه ; ذكره أبو سعيد الأسفاقسي عن بعض أهل العلم قال : معنى قوله : جزء من ستة وأربعين جزءا من النبوة ، فإن الله تعالى أوحى إلى محمد - صلى الله عليه وسلم - في النبوة ثلاثة وعشرين عاما - فيما رواه عكرمة وعمرو بن دينار عن ابن عباس - رضي الله تعالى عنهما - فإذا نسبنا ستة أشهر من ثلاثة وعشرين عاما وجدنا ذلك جزءا من ستة وأربعين جزءا ; وإلى هذا القول أشار المازري في كتابه \" المعلم \" واختاره القونوي في تفسيره من سورة [ يونس ] عند قوله تعالى : لهم البشرى في الحياة الدنيا . وهو فاسد من وجهين : أحدهما : ما رواه أبو سلمة عن ابن عباس وعائشة بأن مدة الوحي كانت عشرين سنة ، وأن النبي - صلى الله عليه وسلم - بعث على رأس أربعين ، فأقام بمكة عشر سنين ; وهو قول عروة والشعبي وابن شهاب والحسن وعطاء الخراساني وسعيد بن المسيب على اختلاف عنه ، وهي رواية ربيعة وأبي غالب عن أنس ، وإذا ثبت هذا الحديث بطل ذلك التأويل - الثاني : أن سائر الأحاديث في الأجزاء المختلفة تبقى بغير معنى .\nالثالثة : إنما كانت الرؤيا جزءا من النبوة ; لأن فيها ما يعجز ويمتنع كالطيران ، وقلب الأعيان ، والاطلاع على شيء من علم الغيب ; كما قال - عليه السلام - : إنه لم يبق من مبشرات النبوة إلا الرؤيا الصادقة في النوم . . . الحديث . وعلى الجملة فإن الرؤيا الصادقة من الله ، وإنها من النبوة ; قال - صلى الله عليه وسلم - : الرؤيا من الله والحلم من الشيطان وأن التصديق بها حق ، ولها التأويل الحسن ، وربما أغنى بعضها عن التأويل ، وفيها من بديع الله ولطفه ما يزيد المؤمن في إيمانه ; ولا خلاف في هذا بين أهل الدين والحق من أهل الرأي والأثر ، ولا ينكر الرؤيا إلا أهل الإلحاد وشرذمة من المعتزلة .\nالرابعة : إن قيل : إذا كانت الرؤيا الصادقة جزءا من النبوة فكيف يكون الكافر والكاذب والمخلط أهلا لها ؟ وقد وقعت من بعض الكفار وغيرهم ممن لا يرضى دينه منامات صحيحة صادقة ; كمنام رؤيا الملك الذي رأى سبع بقرات ، ومنام الفتيين في السجن ; ورؤيا بختنصر التي فسرها دانيال في ذهاب ملكه ، ورؤيا كسرى في ظهور النبي صلى الله عليه وسلم ، ومنام عاتكة عمة رسول الله - صلى الله عليه وسلم - في أمره وهي كافرة ، وقد ترجم البخاري \" باب رؤيا أهل السجن \" : فالجواب أن الكافر والفاجر والفاسق والكاذب وإن صدقت رؤياهم في بعض الأوقات لا تكون من الوحي ولا من النبوة ; إذ ليس كل من صدق في حديث عن غيب يكون خبره ذلك نبوة ; وقد تقدم في [ الأنعام ] أن الكاهن وغيره قد يخبر بكلمة الحق فيصدق ، لكن ذلك على الندور والقلة ، فكذلك رؤيا هؤلاء ; قال المهلب : إنما ترجم البخاري بهذا لجواز أن تكون رؤيا أهل الشرك رؤيا صادقة ، كما كانت رؤيا الفتيين صادقة ، إلا أنه لا يجوز أن تضاف إلى النبوة إضافة رؤيا المؤمن إليها ، إذ ليس كل ما يصح له تأويل من الرؤيا حقيقة يكون جزءا من النبوة .\nالخامسة : الرؤيا المضافة إلى الله تعالى هي التي خلصت من الأضغاث والأوهام ، وكان تأويلها موافقا لما في اللوح المحفوظ ، والتي هي من خبر الأضغاث هي الحلم ، وهي المضافة إلى الشيطان ، وإنما سميت ضغثا ; لأن فيها أشياء متضادة ; قال معناه المهلب . وقد قسم رسول الله - صلى الله عليه وسلم - الرؤيا أقساما تغني عن قول كل قائل ; روى عوف بن مالك عن رسول الله - صلى الله عليه وسلم - قال : الرؤيا ثلاثة منها أهاويل الشيطان ليحزن ابن آدم ، ومنها ما يهتم به في يقظته فيراه في منامه ، ومنها جزء من ستة وأربعين جزءا من النبوة . قال : قلت : سمعت هذا من رسول الله - صلى الله عليه وسلم - ؟ قال : نعم ! سمعته من رسول الله - صلى الله عليه وسلم - .\nالسادسة : قوله تعالى : قال يا بني لا تقصص رؤياك على إخوتك الآية . الرؤيا مصدر رأى في المنام ، رؤيا على وزن فعلى كالسقيا والبشرى ; وألفه للتأنيث ولذلك لم ينصرف . وقد اختلف العلماء في حقيقة الرؤيا ; فقيل : هي إدراك في أجزاء لم تحلها آفة ، كالنوم المستغرق وغيره ; ولهذا أكثر ما تكون الرؤيا في آخر الليل لقلة غلبة النوم ; فيخلق الله تعالى للرائي علما ناشئا ، ويخلق له الذي يراه على ما يراه ليصح الإدراك ، قال ابن العربي : ولا يرى في المنام إلا ما يصح إدراكه في اليقظة ، ولذلك لا يرى في المنام شخصا قائما قاعدا بحال ، وإنما يرى الجائزات المعتادات . وقيل : إن لله ملكا يعرض المرئيات على المحل المدرك من النائم ، فيمثل له صورا محسوسة ; فتارة تكون تلك الصور أمثلة موافقة لما يقع في الوجود ، وتارة تكون لمعان معقولة غير محسوسة ، وفي الحالتين تكون مبشرة أو منذرة ; قال - صلى الله عليه وسلم - في صحيح مسلم وغيره : رأيت سوداء ثائرة الرأس تخرج من المدينة إلى مهيعة فأولتها الحمى . ورأيت سيفي قد انقطع صدره وبقرا تنحر فأولتهما رجل من أهل بيتي يقتل والبقر نفر من أصحابي يقتلون . ورأيت أني أدخلت يدي في درع حصينة فأولتها المدينة . ورأيت في يدي سوارين فأولتهما كذابين يخرجان بعدي . إلى غير ذلك مما ضربت له الأمثال ; ومنها ما يظهر معناه أولا فأولا ، ومنها ما لا يظهر إلا بعد التفكر ; وقد رأى النائم في زمن يوسف - عليه السلام - بقرا فأولها يوسف السنين ، ورأى أحد عشر كوكبا والشمس والقمر فأولها بإخوته وأبويه .\nالسابعة : إن قيل : إن يوسف - عليه السلام - كان صغيرا وقت رؤياه ، والصغير لا حكم لفعله ، فكيف تكون له رؤيا لها حكم حتى يقول له أبوه : لا تقصص رؤياك على إخوتك ؟ فالجواب : أن الرؤيا إدراك حقيقة على ما قدمناه ، فتكون من الصغير كما يكون منه الإدراك الحقيقي في اليقظة ، وإذا أخبر عما رأى صدق ، فكذلك إذا أخبر عما يرى في المنام ; وقد أخبر الله سبحانه عن رؤياه وأنها وجدت كما رأى فلا اعتراض ; روي أن يوسف - عليه السلام - كان ابن اثنتي عشرة سنة .\nالثامنة : هذه الآية أصل في ألا تقص الرؤيا على غير شفيق ولا ناصح ، ولا على من لا يحسن التأويل فيها ; روى أبو رزين العقيلي أن النبي - صلى الله عليه وسلم - قال : الرؤيا جزء من أربعين جزءا من النبوة . والرؤيا معلقة برجل طائر ما لم يحدث بها صاحبها فإذا حدث بها وقعت فلا تحدثوا بها إلا عاقلا أو محبا أو ناصحا أخرجه الترمذي وقال فيه : حديث حسن صحيح ; وأبو رزين اسمه لقيط بن عامر . وقيل لمالك : أيعبر الرؤيا كل أحد ؟ فقال : أبالنبوة يلعب ؟ وقال مالك : لا يعبر الرؤيا إلا من يحسنها ، فإن رأى خيرا أخبر به ، وإن رأى مكروها فليقل خيرا أو ليصمت ; قيل : فهل يعبرها على الخير وهي عنده على المكروه لقول من قال إنها على ما تأولت عليه ؟ فقال : لا ! ثم قال ، : الرؤيا جزء من النبوة فلا يتلاعب بالنبوة .\nالتاسعة : وفي هذه الآية دليل على أن مباحا أن يحذر المسلم أخاه المسلم ممن يخافه عليه ، ولا يكون داخلا في معنى الغيبة ; لأن يعقوب - عليه السلام - قد حذر يوسف أن يقص رؤياه على إخوته فيكيدوا له كيدا ، وفيها أيضا ما يدل على جواز ترك إظهار النعمة عند من تخشى غائلته حسدا وكيدا ; وقال النبي - صلى الله عليه وسلم - : استعينوا على إنجاح حوائجكم بالكتمان فإن كل ذي نعمة محسود . وفيها أيضا دليل واضح على معرفة يعقوب - عليه السلام - بتأويل الرؤيا ; فإنه علم من تأويلها أنه سيظهر عليهم ، ولم يبال بذلك من نفسه ; فإن الرجل يود أن يكون ولده خيرا منه ، والأخ لا يود ذلك لأخيه . ويدل أيضا على أن يعقوب - عليه السلام - كان أحس من بنيه حسد يوسف وبغضه ; فنهاه عن قصص الرؤيا عليهم خوف أن تغل بذلك صدورهم ، فيعملوا الحيلة في هلاكه ; ومن هذا ومن فعلهم بيوسف يدل على أنهم كانوا غير أنبياء في ذلك الوقت ، ووقع في كتاب الطبري لابن زيد أنهم كانوا أنبياء ، وهذا يرده القطع بعصمة الأنبياء عن الحسد الدنيوي ، وعن عقوق الآباء ، وتعريض مؤمن للهلاك ، والتآمر في قتله ، ولا التفات لقول من قال إنهم كانوا أنبياء ، ولا يستحيل في العقل زلة نبي ، إلا أن هذه الزلة قد جمعت أنواعا من الكبائر ، وقد أجمع المسلمون على عصمتهم منها ، وإنما اختلفوا في الصغائر على ما تقدم ويأتي .\nالعاشرة : روى البخاري عن أبي هريرة قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : لم يبق من النبوة إلا المبشرات قالوا : وما المبشرات ؟ قال : الرؤيا الصالحة وهذا الحديث بظاهره يدل على أن الرؤيا بشرى على الإطلاق وليس كذلك ; فإن الرؤيا الصادقة قد تكون منذرة من قبل الله - تعالى - لا تسر رائيها ، وإنما يريها الله تعالى المؤمن رفقا به ورحمة ، ليستعد لنزول البلاء قبل وقوعه ; فإن أدرك تأولها بنفسه ، وإلا سأل عنها من له أهلية ذلك . وقد رأى الشافعي - رضي الله عنه - وهو بمصر رؤيا لأحمد بن حنبل تدل على محنته فكتب إليه بذلك ليستعد لذلك ، وقد تقدم في [ يونس ] في تفسير قوله تعالى : لهم البشرى في الحياة الدنيا أنها الرؤيا الصالحة . وهذا وحديث البخاري مخرجه على الأغلب ، والله أعلم .\nالحادية عشرة : روى البخاري عن أبي سلمة قال : لقد كنت أرى الرؤيا فتمرضني حتى سمعت أبا قتادة يقول : وأنا كنت لأرى الرؤيا فتمرضني حتى سمعت رسول الله - صلى الله عليه وسلم - يقول : الرؤيا الحسنة من الله فإذا رأى أحدكم ما يحب فلا يحدث به إلا من يحب ، وإذا رأى ما يكره فليتعوذ بالله من شرها وليتفل ثلاث مرات ولا يحدث بها أحدا فإنها لن تضره . قال علماؤنا : فجعل الله الاستعاذة منها مما يرفع أذاها ; ألا ترى قول أبي قتادة : إني كنت لأرى الرؤيا هي أثقل علي من الجبل ، فلما سمعت بهذا الحديث كنت لا أعدها شيئا . وزاد مسلم من رواية جابر عن رسول الله - صلى الله عليه وسلم - أنه قال : إذا رأى أحدكم الرؤيا يكرهها فليبصق عن يساره ثلاثا وليتعوذ بالله من الشيطان ثلاثا وليتحول عن جنبه الذي كان عليه . وفي حديث أبي هريرة عن النبي - صلى الله عليه وسلم - قال : إذا رأى أحدكم ما يكره فليقم فليصل . قال علماؤنا : وهذا كله ليس بمتعارض ; وإنما هذا الأمر بالتحول ، والصلاة زيادة ، فعلى الرائي أن يفعل الجميع ، والقيام إلى الصلاة يشمل الجميع ; لأنه إذا صلى تضمن فعله للصلاة جميع تلك الأمور ; لأنه إذا قام إلى الصلاة تحول عن جنبه ، وإذا تمضمض تفل وبصق ، وإذا قام إلى الصلاة تعوذ ودعا وتضرع لله تعالى في أن يكفيه شرها في حال هي أقرب الأحوال إلى الإجابة ; وذلك السحر من الليل .\n                                    ",
        "saadi": "قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ ٥\n                                        \n                                        \n                                        \n                                        ولما بان تعبيرها ليوسف، قال له أبوه: { يَا بُنَيَّ لَا تَقْصُصْ رُؤْيَاكَ عَلَى إِخْوَتِكَ فَيَكِيدُوا لَكَ كَيْدًا ْ} أي: حسدا من عند أنفسهم، أن تكون أنت الرئيس الشريف عليهم.\n{ إِنَّ الشَّيْطَانَ لِلْإِنْسَانِ عَدُوٌّ مُبِينٌ ْ} لا يفتر عنه ليلا ولا نهارا، ولا سرا ولا جهارا، فالبعد عن الأسباب التي يتسلط بها على العبد أولى، فامتثل يوسف أمر أبيه، ولم يخبر إخوته بذلك، بل كتمها عنهم.\n                                    "
      },
      "originalText": "قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ ٥"
    },
    {
      "number": 1602,
      "text": "وَكَذَٰلِكَ يَجْتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِنْ تَأْوِيلِ الْأَحَادِيثِ وَيُتِمُّ نِعْمَتَهُ عَلَيْكَ وَعَلَىٰ آلِ يَعْقُوبَ كَمَا أَتَمَّهَا عَلَىٰ أَبَوَيْكَ مِنْ قَبْلُ إِبْرَاهِيمَ وَإِسْحَاقَ ۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٌ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 6,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 193,
      "hizbQuarter": 94,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَذَٰلِكَ يَجۡتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأۡوِيلِ ٱلۡأَحَادِيثِ وَيُتِمُّ نِعۡمَتَهُۥ عَلَيۡكَ وَعَلَىٰٓ ءَالِ يَعۡقُوبَ كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيۡكَ مِن قَبۡلُ إِبۡرَٰهِيمَ وَإِسۡحَٰقَۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٞ ٦\n                                    \n                                    \n                                    يقول تعالى مخبرا عن قول يعقوب لولده يوسف : إنه كما اختارك ربك ، وأراك هذه الكواكب مع الشمس والقمر ساجدة لك ، ( وكذلك يجتبيك ربك ) أي : يختارك ويصطفيك لنبوته ، ( ويعلمك من تأويل الأحاديث ) قال مجاهد وغير واحد : يعني تعبير الرؤيا .\n( ويتم نعمته عليك ) أي : بإرسالك والإيحاء إليك; ولهذا قال : ( كما أتمها على أبويك من قبل إبراهيم ) وهو الخليل ، ) وإسحاق ) ولده ، وهو الذبيح في قول ، وليس بالرجيح ، ( إن ربك عليم حكيم ) أي : [ هو ] أعلم حيث يجعل رسالاته ، كما قال في الآية الأخرى .\n                                    ",
        "qortoby": "وَكَذَٰلِكَ يَجۡتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأۡوِيلِ ٱلۡأَحَادِيثِ وَيُتِمُّ نِعۡمَتَهُۥ عَلَيۡكَ وَعَلَىٰٓ ءَالِ يَعۡقُوبَ كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيۡكَ مِن قَبۡلُ إِبۡرَٰهِيمَ وَإِسۡحَٰقَۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٞ ٦\n                                    \n                                    \n                                    قوله تعالى : وكذلك يجتبيك ربك ويعلمك من تأويل الأحاديث ويتم نعمته عليك وعلى آل يعقوب كما أتمها على أبويك من قبل إبراهيم وإسحاق إن ربك عليم حكيم\nقوله تعالى : \" وكذلك يجتبيك ربك \" الكاف في موضع نصب ; لأنها نعت لمصدر محذوف ، وكذلك الكاف في قوله : \" كما أتمها على أبويك من قبل \" و \" ما \" كافة . وقيل : \" وكذلك \" أي كما أكرمك بالرؤيا فكذلك يجتبيك ، ويحسن إليك بتحقيق الرؤيا . قال مقاتل : بالسجود لك . الحسن : بالنبوة . والاجتباء اختيار معالي الأمور للمجتبى ، وأصله من جبيت الشيء أي حصلته ، ومنه جبيت الماء في الحوض ; قاله النحاس . وهذا ثناء من الله تعالى على يوسف - عليه السلام - وتعديد فيما عدده عليه من النعم التي أتاه الله تعالى ; من التمكين في الأرض ، وتعليم تأويل الأحاديث ; وأجمعوا أن ذلك في تأويل الرؤيا . قال عبد الله بن شداد بن الهاد : كان تفسير رؤيا يوسف - صلى الله عليه وسلم - بعد أربعين سنة ; وذلك منتهى الرؤيا . وعنى بالأحاديث ما يراه الناس في المنام ، وهي معجزة له ; فإنه لم يلحقه فيها خطأ . وكان يوسف - عليه السلام - أعلم الناس بتأويلها ، وكان نبينا - صلى الله عليه وسلم - نحو ذلك ، وكان الصديق - رضي الله عنه - من أعبر الناس لها ، وحصل لابن سيرين فيها التقدم العظيم ، والطبع والإحسان ، ونحوه أو قريب منه كان سعيد بن المسيب فيما ذكروا .\nويعلمك من تأويل الأحاديث أي أحاديث الأمم والكتب ودلائل التوحيد ، فهو إشارة إلى النبوة ، وهو المقصود بقوله : \" ويتم نعمته عليك \" أي بالنبوة . وقيل : بإخراج إخوتك إليك ; وقيل : بإنجائك من كل مكروه .\n\" كما أتمها على أبويك من قبل إبراهيم \" بالخلة ، وإنجائه من النار .\n\" وإسحاق \" بالنبوة . وقيل : من الذبح ; قاله عكرمة .\nوأعلمه الله تعالى بقوله : \" وعلى آل يعقوب \" أنه سيعطي بني يعقوب كلهم النبوة ; قاله جماعة من المفسرين .\nإن ربك عليم بما يعطيك .\n\" حكيم \" في فعله بك .\n                                    ",
        "saadi": "وَكَذَٰلِكَ يَجۡتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأۡوِيلِ ٱلۡأَحَادِيثِ وَيُتِمُّ نِعۡمَتَهُۥ عَلَيۡكَ وَعَلَىٰٓ ءَالِ يَعۡقُوبَ كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيۡكَ مِن قَبۡلُ إِبۡرَٰهِيمَ وَإِسۡحَٰقَۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٞ ٦\n                                        \n                                        \n                                        \n                                        { وَكَذَلِكَ يَجْتَبِيكَ رَبُّكَ ْ} أي: يصطفيك ويختارك بما يمنُّ به عليك من الأوصاف الجليلة والمناقب الجميلة،. { وَيُعَلِّمُكَ مِنْ تَأْوِيلِ الْأَحَادِيثِ ْ} أي: من تعبير الرؤيا، وبيان ما تئول إليه الأحاديث الصادقة، كالكتب السماوية ونحوها، { وَيُتِمُّ نِعْمَتَهُ عَلَيْكَ ْ} في الدنيا والآخرة، بأن يؤتيك في الدنيا حسنة، وفي الآخرة حسنة، { كَمَا أَتَمَّهَا عَلَى أَبَوَيْكَ مِنْ قَبْلُ إِبْرَاهِيمَ وَإِسْحَاقَ ْ} حيث أنعم الله عليهما، بنعم عظيمة واسعة، دينية، ودنيوية.\n{ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٌ ْ} أي: علمه محيط بالأشياء، وبما احتوت عليه ضمائر العباد من البر وغيره، فيعطي كلا ما تقتضيه حكمته وحمده، فإنه حكيم يضع الأشياء مواضعها، وينزلها منازلها.\n                                    "
      },
      "originalText": "وَكَذَٰلِكَ يَجۡتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأۡوِيلِ ٱلۡأَحَادِيثِ وَيُتِمُّ نِعۡمَتَهُۥ عَلَيۡكَ وَعَلَىٰٓ ءَالِ يَعۡقُوبَ كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيۡكَ مِن قَبۡلُ إِبۡرَٰهِيمَ وَإِسۡحَٰقَۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٞ ٦"
    },
    {
      "number": 1603,
      "text": "۞ لَقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ آيَاتٌ لِلسَّائِلِينَ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 7,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 194,
      "hizbQuarter": 95,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ لَّقَدۡ كَانَ فِي يُوسُفَ وَإِخۡوَتِهِۦٓ ءَايَٰتٞ لِّلسَّآئِلِينَ ٧\n                                    \n                                    \n                                    يقول تعالى : لقد كان في قصة يوسف وخبره مع إخوته آيات ، أي عبرة ومواعظ للسائلين عن ذلك ، المستخبرين عنه ، فإنه خبر عجيب ، يستحق أن يستخبر عنه\n                                    ",
        "qortoby": "۞ لَّقَدۡ كَانَ فِي يُوسُفَ وَإِخۡوَتِهِۦٓ ءَايَٰتٞ لِّلسَّآئِلِينَ ٧\n                                    \n                                    \n                                    قوله تعالى : لقد كان في يوسف وإخوته آيات للسائلين يعني ، من سأل عن حديثهم . وقرأ أهل مكة \" آية \" على التوحيد ; واختار أبو عبيد \" آيات \" على الجمع ; قال : لأنها خير كثير . قال النحاس : و \" آية \" هنا قراءة حسنة ، أي لقد كان للذين سألوا عن خبر يوسف آية فيما خبروا به ، لأنهم سألوا النبي - صلى الله عليه وسلم - وهو بمكة فقالوا : أخبرنا عن رجل من الأنبياء كان بالشام أخرج ابنه إلى مصر ، فبكى عليه حتى عمي ؟ ولم يكن بمكة أحد من أهل الكتاب ، ولا من يعرف خبر الأنبياء ; وإنما وجه اليهود إليهم من المدينة يسألونه عن هذا - فأنزل الله - عز وجل - سورة [ يوسف ] جملة واحدة ; فيها كل ما في التوراة من خبر وزيادة ، فكان ذلك آية للنبي - صلى الله عليه وسلم - بمنزلة إحياء عيسى ابن مريم - عليه السلام - الميت . آيات موعظة ; وقيل : عبرة . وروي أنها في بعض المصاحف \" عبرة \" . وقيل : بصيرة . وقيل : عجب ; تقول فلان آية في العلم والحسن أي عجب . قال الثعلبي في تفسيره : لما بلغت الرؤيا إخوة يوسف حسدوه ; وقال ابن زيد : كانوا أنبياء ، وقالوا : ما يرضى أن يسجد له إخوته حتى يسجد له أبواه ! فبغوه بالعداوة ، وقد تقدم رد هذا القول . قال الله تعالى : لقد كان في يوسف وإخوته وأسماؤهم : روبيل وهو أكبرهم ، وشمعون ولاوي ويهوذا وزيالون ويشجر ، وأمهم ليا بنت ليان ، وهي بنت خال يعقوب ، وولد له من سريتين أربعة نفر ; دان ونفتالي وجاد وآشر ، ثم توفيت ليا فتزوج يعقوب أختها راحيل ، فولدت له يوسف وبنيامين ، فكان بنو يعقوب اثني عشر رجلا . قال السهيلي : وأم يعقوب اسمها رفقا ، وراحيل ماتت في نفاس بنيامين ، وليان بن ناهر بن آزر هو خال يعقوب . وقيل : في اسم الأمتين ليا وتلتا ، كانت إحداهما لراحيل ، والأخرى لأختها ليا ، وكانتا قد وهبتاهما ليعقوب ، وكان يعقوب قد جمع بينهما ، ولم يحل لأحد بعده ; لقول الله تعالى : وأن تجمعوا بين الأختين إلا ما قد سلف . وقد تقدم الرد على ما قاله ابن زيد ، والحمد لله .\n                                    ",
        "saadi": "۞ لَّقَدۡ كَانَ فِي يُوسُفَ وَإِخۡوَتِهِۦٓ ءَايَٰتٞ لِّلسَّآئِلِينَ ٧\n                                        \n                                        \n                                        \n                                        يقول تعالى: { لَقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ آيَاتٌ ْ} أي: عبر وأدلة على كثير من المطالب الحسنة، { لِلسَّائِلِينَ ْ} أي: لكل من سأل عنها بلسان الحال أو بلسان المقال، فإن السائلين هم الذين ينتفعون بالآيات والعبر، وأما المعرضون فلا ينتفعون بالآيات، ولا في القصص والبينات.\n                                    "
      },
      "originalText": "۞ لَّقَدۡ كَانَ فِي يُوسُفَ وَإِخۡوَتِهِۦٓ ءَايَٰتٞ لِّلسَّآئِلِينَ ٧"
    },
    {
      "number": 1604,
      "text": "إِذْ قَالُوا لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰ أَبِينَا مِنَّا وَنَحْنُ عُصْبَةٌ إِنَّ أَبَانَا لَفِي ضَلَالٍ مُبِينٍ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 8,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 194,
      "hizbQuarter": 95,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ قَالُواْ لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰٓ أَبِينَا مِنَّا وَنَحۡنُ عُصۡبَةٌ إِنَّ أَبَانَا لَفِي ضَلَٰلٖ مُّبِينٍ ٨\n                                    \n                                    \n                                    ( إذ قالوا ليوسف وأخوه أحب إلى أبينا منا ) أي : حلفوا فيما يظنون : والله ليوسف وأخوه ، يعنون بنيامين ، وكان شقيقه لأمه ( أحب إلى أبينا منا ونحن عصبة ) أي : جماعة ، فكيف أحب ذينك الاثنين أكثر من الجماعة; ( إن أبانا لفي ضلال مبين ) يعنون في تقديمهما علينا ، ومحبته إياهما أكثر منا .\nواعلم أنه لم يقم دليل على نبوة إخوة يوسف ، وظاهر هذا السياق يدل على خلاف ذلك ، ومن الناس من يزعم أنهم أوحي إليهم بعد ذلك ، وفي هذا نظر . ويحتاج مدعي ذلك إلى دليل ، ولم يذكروا سوى قوله تعالى : ( قولوا آمنا بالله وما أنزل إلينا وما أنزل إلى إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط ) [ البقرة : 136 ] وهذا فيه احتمال; لأن بطون بني إسرائيل يقال لهم : الأسباط ، كما يقال للعرب : قبائل ، وللعجم : شعوب; يذكر تعالى أنه أوحى إلى الأنبياء من أسباط بني إسرائيل ، فذكرهم إجمالا لأنهم كثيرون ، ولكن كل سبط من نسل رجل من إخوة يوسف ، ولم يقم دليل على أعيان هؤلاء أنهم أوحي إليهم ، والله أعلم .\n                                    ",
        "qortoby": "إِذۡ قَالُواْ لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰٓ أَبِينَا مِنَّا وَنَحۡنُ عُصۡبَةٌ إِنَّ أَبَانَا لَفِي ضَلَٰلٖ مُّبِينٍ ٨\n                                    \n                                    \n                                    قوله تعالى : إذ قالوا ليوسف يوسف رفع بالابتداء ; واللام للتأكيد ، وهي التي يتلقى بها القسم ; أي والله ليوسف . \" وأخوه \" عطف عليه .\nأحب إلى أبينا منا خبره ، ولا يثنى ولا يجمع لأنه بمعنى الفعل ; وإنما قالوا هذا لأن خبر المنام بلغهم فتآمروا في كيده .\nونحن عصبة أي جماعة ، وكانوا عشرة . والعصبة ما بين الواحد إلى العشرة ، وقيل : إلى الخمسة عشر . وقيل : ما بين الأربعين إلى العشرة ; ولا واحد لها من لفظها كالنفر والرهط .\nإن أبانا لفي ضلال مبين لم يريدوا ضلال الدين ، إذ لو أرادوه لكانوا كفارا ; بل أرادوا لفي ذهاب عن وجه التدبير ، في إيثار اثنين على عشرة مع استوائهم في الانتساب إليه . وقيل : لفي خطأ بين بإيثاره يوسف وأخاه علينا .\n                                    ",
        "saadi": "إِذۡ قَالُواْ لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰٓ أَبِينَا مِنَّا وَنَحۡنُ عُصۡبَةٌ إِنَّ أَبَانَا لَفِي ضَلَٰلٖ مُّبِينٍ ٨\n                                        \n                                        \n                                        \n                                        { إِذْ قَالُوا ْ} فيما بينهم: { لَيُوسُفُ وَأَخُوهُ ْ} بنيامين، أي: شقيقه، وإلا فكلهم إخوة. { أَحَبُّ إِلَى أَبِينَا مِنَّا وَنَحْنُ عُصْبَةٌْ} أي: جماعة، فكيف يفضلهما علينا بالمحبة والشفقة، { إِنَّ أَبَانَا لَفِي ضَلَالٍ مُبِينٍ ْ} أي: لفي خطأ بيِّن، حيث فضلهما علينا من غير موجب نراه، ولا أمر نشاهده.\n                                    "
      },
      "originalText": "إِذۡ قَالُواْ لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰٓ أَبِينَا مِنَّا وَنَحۡنُ عُصۡبَةٌ إِنَّ أَبَانَا لَفِي ضَلَٰلٖ مُّبِينٍ ٨"
    },
    {
      "number": 1605,
      "text": "اقْتُلُوا يُوسُفَ أَوِ اطْرَحُوهُ أَرْضًا يَخْلُ لَكُمْ وَجْهُ أَبِيكُمْ وَتَكُونُوا مِنْ بَعْدِهِ قَوْمًا صَالِحِينَ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 9,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 194,
      "hizbQuarter": 95,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱقۡتُلُواْ يُوسُفَ أَوِ ٱطۡرَحُوهُ أَرۡضٗا يَخۡلُ لَكُمۡ وَجۡهُ أَبِيكُمۡ وَتَكُونُواْ مِنۢ بَعۡدِهِۦ قَوۡمٗا صَٰلِحِينَ ٩\n                                    \n                                    \n                                    ( اقتلوا يوسف أو اطرحوه أرضا يخل لكم وجه أبيكم ) يقولون : هذا الذي يزاحمكم في محبة أبيكم لكم ، أعدموه من وجه أبيكم ، ليخلو لكم وحدكم ، إما بأن تقتلوه ، أو تلقوه في أرض من الأراضي ، تستريحوا منه ، وتختلوا أنتم بأبيكم ، وتكونوا من بعد إعدامه قوما صالحين . فأضمروا التوبة قبل الذنب .\n                                    ",
        "qortoby": "ٱقۡتُلُواْ يُوسُفَ أَوِ ٱطۡرَحُوهُ أَرۡضٗا يَخۡلُ لَكُمۡ وَجۡهُ أَبِيكُمۡ وَتَكُونُواْ مِنۢ بَعۡدِهِۦ قَوۡمٗا صَٰلِحِينَ ٩\n                                    \n                                    \n                                    قوله تعالى : اقتلوا يوسف في الكلام حذف ; أي قال قائل منهم : اقتلوا يوسف ليكون أحسم لمادة الأمر .\nأو اطرحوه أرضا أي في أرض ، فأسقط الخافض وانتصب الأرض ; وأنشد سيبويه فيما حذف منه \" في \" :\nلدن بهز الكف يعسل متنه فيه كما عسل الطريق الثعلب\nقال النحاس : إلا أنه في الآية حسن كثير ; لأنه يتعدى إلى مفعولين ، أحدهما بحرف ، فإذا حذفت الحرف تعدى الفعل إليه . والقائل قيل : هو شمعون ، قال وهب بن منبه . وقال كعب الأحبار ; دان . وقال مقاتل : روبيل ; والله أعلم . والمعنى أرضا تبعد عن أبيه ; فلا بد من هذا الإضمار لأنه كان عند أبيه في أرض .\n\" يخل \" جزم لأنه جواب الأمر ; معناه : يخلص ويصفو .\nلكم وجه أبيكم فيقبل عليكم بكليته .\nوتكونوا من بعده أي من بعد الذنب ، وقيل : من بعد يوسف .\nقوما صالحين أي تائبين ; أي تحدثوا توبة بعد ذلك فيقبلها الله منكم ; وفي هذا دليل على أن توبة القاتل مقبولة ، لأن الله تعالى لم ينكر هذا القول منهم . وقيل : صالحين أي يصلح شأنكم عند أبيكم من غير أثرة ولا تفضيل .\n                                    ",
        "saadi": "ٱقۡتُلُواْ يُوسُفَ أَوِ ٱطۡرَحُوهُ أَرۡضٗا يَخۡلُ لَكُمۡ وَجۡهُ أَبِيكُمۡ وَتَكُونُواْ مِنۢ بَعۡدِهِۦ قَوۡمٗا صَٰلِحِينَ ٩\n                                        \n                                        \n                                        \n                                        { اقْتُلُوا يُوسُفَ أَوِ اطْرَحُوهُ أَرْضًا ْ} أي: غيبوه عن أبيه في أرض بعيدة لا يتمكن من رؤيته فيها.\nفإنكم إذا فعلتم أحد هذين الأمرين { يَخْلُ لَكُمْ وَجْهُ أَبِيكُمْ ْ} أي: يتفرغ لكم، ويقبل عليكم بالشفقة والمحبة، فإنه قد اشتغل قلبه بيوسف شغلا لا يتفرغ لكم، { وَتَكُونُوا مِنْ بَعْدِهِ ْ} أي: من بعد هذا الصنيع { قَوْمًا صَالِحِينَ ْ} أي: تتوبون إلى الله، وتستغفرون من بعد ذنبكم.\nفقدموا العزم على التوبة قبل صدور الذنب منهم تسهيلا لفعله، وإزالة لشناعته، وتنشيطا من بعضهم لبعض.\n                                    "
      },
      "originalText": "ٱقۡتُلُواْ يُوسُفَ أَوِ ٱطۡرَحُوهُ أَرۡضٗا يَخۡلُ لَكُمۡ وَجۡهُ أَبِيكُمۡ وَتَكُونُواْ مِنۢ بَعۡدِهِۦ قَوۡمٗا صَٰلِحِينَ ٩"
    },
    {
      "number": 1606,
      "text": "قَالَ قَائِلٌ مِنْهُمْ لَا تَقْتُلُوا يُوسُفَ وَأَلْقُوهُ فِي غَيَابَتِ الْجُبِّ يَلْتَقِطْهُ بَعْضُ السَّيَّارَةِ إِنْ كُنْتُمْ فَاعِلِينَ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 10,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 194,
      "hizbQuarter": 95,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ قَآئِلٞ مِّنۡهُمۡ لَا تَقۡتُلُواْ يُوسُفَ وَأَلۡقُوهُ فِي غَيَٰبَتِ ٱلۡجُبِّ يَلۡتَقِطۡهُ بَعۡضُ ٱلسَّيَّارَةِ إِن كُنتُمۡ فَٰعِلِينَ ٠١\n                                    \n                                    \n                                    ( قال قائل منهم ) قال قتادة ، ومحمد بن إسحاق : كان أكبرهم واسمه روبيل . وقال السدي : الذي قال ذلك يهوذا . وقال مجاهد : هو شمعون ( لا تقتلوا يوسف ) أي : لا تصلوا في عداوته وبغضه إلى قتله ، ولم يكن لهم سبيل إلى قتله; لأن الله تعالى كان يريد منه أمرا لا بد من إمضائه وإتمامه ، من الإيحاء إليه بالنبوة ، ومن التمكين له ببلاد مصر والحكم بها ، فصرفهم الله عنه بمقالة روبيل فيه وإشارته عليهم بأن يلقوه في غيابة الجب ، وهو أسفله .\nقال قتادة : وهي بئر بيت المقدس .\n( يلتقطه بعض السيارة ) أي : المارة من المسافرين ، فتستريحوا بهذا ، ولا حاجة إلى قتله .\n( إن كنتم فاعلين ) أي : إن كنتم عازمين على ما تقولون .\nقال محمد بن إسحاق بن يسار : لقد اجتمعوا على أمر عظيم ، من قطيعة الرحم ، وعقوق الوالد ، وقلة الرأفة بالصغير الضرع الذي لا ذنب له ، وبالكبير الفاني ذي الحق والحرمة والفضل ، وخطره عند الله ، مع حق الوالد على ولده ، ليفرقوا بينه وبين ابنه وحبيبه ، على كبر سنه ، ورقة عظمه ، مع مكانه من الله فيمن أحبه طفلا صغيرا ، وبين أبيه على ضعف قوته وصغر سنه ، وحاجته إلى لطف والده وسكونه إليه ، يغفر الله لهم وهو أرحم الراحمين ، فقد احتملوا أمرا عظيما .\nرواه ابن أبي حاتم من طريق سلمة بن الفضل ، عنه .\n                                    ",
        "qortoby": "قَالَ قَآئِلٞ مِّنۡهُمۡ لَا تَقۡتُلُواْ يُوسُفَ وَأَلۡقُوهُ فِي غَيَٰبَتِ ٱلۡجُبِّ يَلۡتَقِطۡهُ بَعۡضُ ٱلسَّيَّارَةِ إِن كُنتُمۡ فَٰعِلِينَ ٠١\n                                    \n                                    \n                                    قوله تعالى : قال قائل منهم لا تقتلوا يوسف وألقوه في غيابة الجب يلتقطه بعض السيارة إن كنتم فاعلين فيه ثلاث عشرة مسألة :\nالأولى : قوله تعالى : قال قائل منهم لا تقتلوا يوسف القائل هو يهوذا ، وهو أكبر ولد يعقوب ; قاله ابن عباس . وقيل : روبيل ، وهو ابن خالته ، وهو الذي قال : \" فلن أبرح الأرض \" الآية . وقيل : شمعون .\nوألقوه في غيابة الجب قرأ أهل مكة وأهل البصرة وأهل الكوفة في غيابة الجب . وقرأ أهل المدينة \" في غيابات الجب \" واختار أبو عبيد التوحيد ; لأنه على موضع واحد ألقوه فيه ، وأنكر الجمع لهذا . قال النحاس : وهذا تضييق في اللغة ; \" وغيابات \" على الجمع يجوز من وجهين : حكى سيبويه سير عليه عشيانات وأصيلانات ، يريد عشية وأصيلا ، فجعل كل وقت منها عشية وأصيلا ; فكذا جعل كل موضع مما يغيب غيابة . والآخر - أن يكون في الجب غيابات ( جماعة ) . ويقال : غاب يغيب غيبا وغيابة وغيابا ; كما قال الشاعر :\nألا فالبثا شهرين أو نصف ثالث أنا ذاكما قد غيبتني غيابيا\nقال الهروي : والغيابة شبه لجف أو طاق في البئر فويق الماء ، يغيب الشيء عن العين . وقال ابن عزيز : كل شيء غيب عنك شيئا فهو غيابة . قلت : ومنه قيل للقبر غيابة ; قال الشاعر :\nفإن أنا يوما غيبتني غيابتي فسيروا بسيري في العشيرة والأهل\nوالجب الركية التي لم تطو ، فإذا طويت فهي في بئر ; فقال الأعشى :\nلئن كنت في جب ثمانين قامة ورقيت أسباب السماء بسلم\nوسميت جبا لأنها قطعت في الأرض قطعا ; وجمع الجب جببة وجباب وأجباب ; وجمع بين الغيابة والجب لأنه أراد ألقوه في موضع مظلم من الجب حتى لا يلحقه نظر الناظرين . قيل : هو بئر بيت المقدس ، وقيل : هو بالأردن ; قاله وهب بن منبه . مقاتل : وهو على ثلاثة فراسخ من منزل يعقوب .\nالثانية : قوله تعالى : يلتقطه بعض السيارة إن كنتم فاعلين جزم على جواب الأمر . وقرأ مجاهد وأبو رجاء والحسن وقتادة : \" تلتقطه \" بالتاء ، وهذا محمول على المعنى ; لأن بعض السيارة سيارة ; وقال سيبويه : سقطت بعض أصابعه ، وأنشد :\nوتشرق بالقول الذي قد أذعته كما شرقت صدر القناة من الدم\nوقال آخر :\nأرى مر السنين أخذن مني كما أخذ السرار من الهلال\nولم يقل شرق ولا أخذت . والسيارة الجمع الذي يسيرون في الطريق للسفر ; وإنما قال القائل هذا حتى لا يحتاجوا إلى حمله إلى موضع بعيد ويحصل المقصود ; فإن من التقطه من السيارة يحمله إلى موضع بعيد ; وكان هذا وجها في التدبير حتى لا يحتاجوا إلى الحركة بأنفسهم ، فربما لا يأذن لهم أبوهم ، وربما يطلع على قصدهم .\nالثالثة : وفي هذا ما يدل على أن إخوة يوسف ما كانوا أنبياء لا أولا ولا آخرا ; لأن الأنبياء لا يدبرون في قتل مسلم ، بل كانوا مسلمين ، فارتكبوا معصية ثم تابوا . وقيل : كانوا أنبياء ، ولا يستحيل في العقل زلة نبي ، فكانت هذه زلة منهم ; وهذا يرده أن الأنبياء معصومون من الكبائر على ما قدمناه . وقيل : ما كانوا في ذلك الوقت أنبياء ثم نبأهم الله ; وهذا أشبه ، والله أعلم .\nالرابعة : قال ابن وهب قال مالك : طرح يوسف في الجب وهو غلام ، وكذلك روى ابن القاسم عنه ، يعني أنه كان صغيرا ; والدليل عليه قوله تعالى : لا تقتلوا يوسف وألقوه في غيابة الجب يلتقطه بعض السيارة قال : ولا يلتقط إلا الصغير ; وقوله : وأخاف أن يأكله الذئب وذلك أمر يختص بالصغار ; وقولهم : أرسله معنا غدا يرتع ويلعب وإنا له لحافظون .\nالخامسة : الالتقاط تناول الشيء من الطريق ; ومنه اللقيط واللقطة ، ونحن نذكر من أحكامها ما دلت عليه الآية والسنة ، وما قال في ذلك أهل العلم واللغة ; قال ابن عرفة : الالتقاط وجود الشيء على غير طلب ، ومنه قوله تعالى : يلتقطه بعض السيارة أي يجده من غير أن يحتسبه . وقد اختلف العلماء في اللقيط ; فقيل : أصله الحرية لغلبة الأحرار على العبيد ; وروي عن الحسن بن علي أنه قضى بأن اللقيط حر ، وتلا وشروه بثمن بخس دراهم معدودة وإلى هذا ذهب أشهب صاحب مالك ; وهو قول عمر بن الخطاب ، وكذلك روي عن علي وجماعة . وقال إبراهيم النخعي : إن نوى رقه فهو مملوك ، وإن نوى الحسبة فهو حر . وقال مالك في موطئه : الأمر عندنا في المنبوذ أنه حر ، وأن ولاءه لجماعة المسلمين ، هم يرثونه ويعقلون عنه ، وبه قال الشافعي ; واحتج بقوله - عليه السلام - : وإنما الولاء لمن أعتق قال : فنفى الولاء عن غير المعتق . واتفق مالك والشافعي وأصحابهما على أن اللقيط لا يوالي أحدا ، ولا يرثه أحد بالولاء . وقال أبو حنيفة وأصحابه وأكثر الكوفيين : اللقيط يوالي من شاء ، فمن والاه فهو يرثه ويعقل عنه ; وعند أبي حنيفة له أن ينتقل بولائه حيث شاء ، ما لم يعقل عنه الذي والاه ، فإن عقل عنه جناية لم يكن له أن ينتقل عنه بولائه أبدا . وذكر أبو بكر بن أبي شيبة عن علي - رضي الله عنه - : المنبوذ حر ، فإن أحب أن يوالي الذي التقطه والاه ، وإن أحب أن يوالي غيره والاه ; ونحوه عن عطاء ، وهو قول ابن شهاب وطائفة من أهل المدينة ، وهو حر . قال ابن العربي : إنما كان أصل اللقيط الحرية لغلبة الأحرار على العبيد ، فقضى بالغالب ، كما حكم أنه مسلم أخذا بالغالب ; فإن كان في قرية فيها نصارى ومسلمون ، قال ابن القاسم : يحكم بالأغلب ; فإن وجد عليه زي اليهود فهو يهودي ، وإن وجد عليه زي النصارى فهو نصراني ، وإلا فهو مسلم ، إلا أن يكون أكثر أهل القرية على غير الإسلام . وقال غيره : لو لم يكن فيها إلا مسلم واحد قضي للقيط بالإسلام تغليبا لحكم الإسلام الذي يعلو ولا يعلى عليه ، وهو مقتضى قولأشهب ; قال أشهب : هو مسلم أبدا ، لأني أجعله مسلما على كل حال ، كما أجعله حرا على كل حال . واختلف الفقهاء في المنبوذ تدل البينة على أنه عبد ; فقالت طائفة من أهل المدينة : لا يقبل قولها في ذلك ، وإلى هذا ذهب أشهب لقول عمر : هو حر ; ومن قضي بحريته لم تقبل البينة في أنه عبد . وقال ابن القاسم : تقبل البينة في ذلك وهو قول الشافعي والكوفي .\nالسادسة : قال مالك في اللقيط : إذا أنفق عليه الملتقط ثم أقام رجل البينة أنه ابنه فإن الملتقط يرجع على الأب إن كان طرحه متعمدا ، وإن لم يكن طرحه ولكنه ضل منه فلا شيء على الأب ، والملتقط متطوع بالنفقة . وقال أبو حنيفة : إذا أنفق على اللقيط فهو متطوع ، إلا أن يأمره الحاكم . وقال الأوزاعي : كل من أنفق على من لا تجب عليه نفقة رجع بما أنفق . وقال الشافعي : إن لم يكن للقيط مال وجبت نفقته في بيت المال ، فإن لم يكن ففيه قولان : أحدهما - يستقرض له في ذمته . والثاني - يقسط على المسلمين من غير عوض .\nالسابعة : وأما اللقطة والضوال فقد اختلف العلماء في حكمهما ; فقالت طائفة من أهل العلم : اللقطة والضوال سواء في المعنى ، والحكم فيهما سواء ; وإلى هذا ذهب أبو جعفر الطحاوي ، وأنكر قول أبي عبيد القاسم بن سلام - أن الضالة لا تكون إلا في الحيوان واللقطة في غير الحيوان - وقال هذا غلط ; واحتج بقوله - صلى الله عليه وسلم - في حديث الإفك للمسلمين : إن أمكم ضلت قلادتها فأطلق ذلك على القلادة .\nالثامنة : أجمع العلماء على أن اللقطة ما لم تكن تافها يسيرا أو شيئا لا بقاء لها فإنها تعرف حولا كاملا ، وأجمعوا أن صاحبها إن جاء فهو أحق بها من ملتقطها إذا ثبت له أنه صاحبها ، وأجمعوا أن ملتقطها إن أكلها بعد الحول وأراد صاحبها أن يضمنه فإن ذلك له ، وإن تصدق بها فصاحبها مخير بين التضمين وبين أن ينزل على أجرها ، فأي ذلك تخير كان ذلك له بإجماع ; ولا تنطلق يد ملتقطها عليها بصدقة ، ولا تصرف قبل الحول . وأجمعوا أن ضالة الغنم المخوف عليها له أكلها .\nالتاسعة : واختلف الفقهاء في الأفضل من تركها أو أخذها ; فمن ذلك أن في الحديث دليلا على إباحة التقاط اللقطة وأخذ الضالة ما لم تكن إبلا . وقال في الشاة : ( لك أو لأخيك أو للذئب ) يحضه على أخذها ، ولم يقل في شيء دعوه حتى يضيع أو يأتيه ربه . ولو كان ترك اللقطة أفضل لأمر به رسول الله - صلى الله عليه وسلم - كما قال في ضالة الإبل ، والله أعلم . وجملة مذهب أصحاب مالك أنه في سعة ، إن شاء أخذها وإن شاء تركها ; هذا قول إسماعيل بن إسحاق - رحمه الله - . وقال المزني عن الشافعي : لا أحب لأحد ترك اللقطة إن وجدها إذا كان أمينا عليها ; قال : وسواء قليل اللقطة وكثيرها .\nالعاشرة : روى الأئمة مالك وغيره عن زيد بن خالد الجهني قال : جاء رجل إلى النبي - صلى الله عليه وسلم - فسأله عن اللقطة فقال : اعرف عفاصها ووكاءها ثم عرفها سنة فإن جاء صاحبها وإلا فشأنك بها قال : فضالة الغنم يا رسول الله ؟ قال : لك أو لأخيك أو للذئب قال : فضالة الإبل ؟ قال : ما لك ولها معها سقاؤها وحذاؤها ترد الماء وتأكل الشجر حتى يلقاها ربها . وفي حديث أبي قال : احفظ عددها ووعاءها ووكاءها فإن جاء صاحبها وإلا فاستمتع بها ففي هذا الحديث زيادة العدد ; خرجه مسلم وغيره . وأجمع العلماء أن عفاص اللقطة ووكاءها من إحدى علاماتها وأدلها عليها ; فإذا أتى صاحب اللقطة بجميع أوصافها دفعت له ; قال ابن القاسم : يجبر على دفعها ; فإن جاء مستحق يستحقها ببينة أنها كانت له لم يضمن الملتقط شيئا ، وهل يحلف مع الأوصاف أو لا ؟ قولان : الأول لأشهب ، والثاني لابن القاسم ، ولا تلزمه بينة عند مالك وأصحابه وأحمد بن حنبل وغيرهم . وقال أبو حنيفة والشافعي : لا تدفع له إلا إذا أقام بينة أنها له ; وهو بخلاف نص الحديث ; ولو كانت البينة شرطا في الدفع لما كان لذكر العفاص والوكاء والعدد معنى ; فإنه يستحقها بالبينة على كل حال ; ولما جاز سكوت النبي - صلى الله عليه وسلم - عن ذلك ، فإنه تأخير البيان عن وقت الحاجة . والله أعلم .\nالحادية عشرة : نص الحديث على الإبل والغنم وبين حكمهما ، وسكت عما عداهما من الحيوان . وقد اختلف علماؤنا في البقر هل تلحق بالإبل أو بالغنم ؟ قولان ; وكذلك اختلف أئمتنا في التقاط الخيل والبغال والحمير ، وظاهر قول ابن القاسم أنها تلتقط ، وقال أشهب وابن كنانة : لا تلتقط ; وقول ابن القاسم أصح ; لقوله - عليه السلام - : احفظ على أخيك المؤمن ضالته .\nالثانية عشرة : واختلف العلماء في النفقة على الضوال ; فقال مالك فيما ذكر عنه ابن القاسم : إن أنفق الملتقط على الدواب والإبل وغيرها فله أن يرجع على صاحبها بالنفقة ، وسواء أنفق عليها بأمر السلطان أو بغير أمره ; قال : وله أن يحبس بالنفقة ما أنفق عليه ويكون أحق به كالرهن . وقال الشافعي : إذا أنفق على الضوال من أخذها فهو متطوع ; حكاه عنه الربيع . وقال المزني عنه : إذا أمره الحاكم بالنفقة كانت دينا ، وما ادعى قبل منه إذا كان مثله قصدا . وقال أبو حنيفة : إذا أنفق على اللقطة والإبل بغير أمر القاضي فهو متطوع ، وإن أنفق بأمر القاضي فذلك دين على صاحبها إذا جاء ، وله أن يحبسها إذا حضر صاحبها ، والنفقة عليها ثلاثة أيام ونحوها ، حتى يأمر القاضي ببيع الشاة وما أشبهها ويقضي بالنفقة .\nالثالثة عشرة : ليس في قوله - صلى الله عليه وسلم - في اللقطة بعد التعريف : فاستمتع بها أو فشأنك بها أو فهي لك أو فاستنفقها أو ثم كلها أو فهو مال الله يؤتيه من يشاء على ما في صحيح مسلم وغيره ، ما يدل على التمليك ، وسقوط الضمان عن الملتقط إذا جاء ربها ; فإن في حديث زيد بن خالد الجهني عن النبي - صلى الله عليه وسلم - : فإن لم تعرف فاستنفقها ولتكن وديعة عندك فإن جاء صاحبها يوما من الدهر فأدها إليه في رواية ثم كلها ، فإن جاء صاحبها فأدها إليه . خرجه البخاري ومسلم . وأجمع العلماء على أن صاحبها متى جاء فهو أحق بها ، إلا ما ذهب إليه داود من أن الملتقط يملك اللقطة بعد التعريف ; لتلك الظواهر ، ولا التفات لقوله ; لمخالفة الناس ، ولقوله - عليه السلام - : فأدها إليه .\n                                    ",
        "saadi": "قَالَ قَآئِلٞ مِّنۡهُمۡ لَا تَقۡتُلُواْ يُوسُفَ وَأَلۡقُوهُ فِي غَيَٰبَتِ ٱلۡجُبِّ يَلۡتَقِطۡهُ بَعۡضُ ٱلسَّيَّارَةِ إِن كُنتُمۡ فَٰعِلِينَ ٠١\n                                        \n                                        \n                                        \n                                        أي: { قَالَ قَائِلٌ ْ} من إخوة يوسف الذين أرادوا قتله أو تبعيده: { لَا تَقْتُلُوا يُوسُفَ ْ} فإن قتله أعظم إثما وأشنع، والمقصود يحصل بتبعيده عن أبيه من غير قتل، ولكن توصلوا إلى تبعيده بأن تلقوه { فِي غَيَابَةِ الْجُبِّ ْ} وتتوعدوه على أنه لا يخبر بشأنكم، بل على أنه عبد مملوك آبق منكم، لأجل أن { يَلْتَقِطْهُ بَعْضُ السَّيَّارَةِ ْ} الذين يريدون مكانا بعيدا، فيحتفظون فيه.\nوهذا القائل أحسنهم رأيا في يوسف، وأبرهم وأتقاهم في هذه القضية، فإن بعض الشر أهون من بعض، والضرر الخفيف يدفع به الضرر الثقيل، .فلما اتفقوا على هذا الرأي.\n                                    "
      },
      "originalText": "قَالَ قَآئِلٞ مِّنۡهُمۡ لَا تَقۡتُلُواْ يُوسُفَ وَأَلۡقُوهُ فِي غَيَٰبَتِ ٱلۡجُبِّ يَلۡتَقِطۡهُ بَعۡضُ ٱلسَّيَّارَةِ إِن كُنتُمۡ فَٰعِلِينَ ٠١"
    },
    {
      "number": 1607,
      "text": "قَالُوا يَا أَبَانَا مَا لَكَ لَا تَأْمَنَّا عَلَىٰ يُوسُفَ وَإِنَّا لَهُ لَنَاصِحُونَ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 11,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 194,
      "hizbQuarter": 95,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالُواْ يَٰٓأَبَانَا مَالَكَ لَا تَأۡمَ۬نَّا عَلَىٰ يُوسُفَ وَإِنَّا لَهُۥ لَنَٰصِحُونَ ١١\n                                    \n                                    \n                                    لما تواطئوا على أخذه وطرحه في البئر ، كما أشار عليهم أخوهم الكبير روبيل ، جاءوا أباهم يعقوب ، عليه السلام ، فقالوا : ( ياأبانا ما لك لا تأمنا على يوسف وإنا له لناصحون ) وهذه توطئة وسلف ودعوى ، وهم يريدون خلاف ذلك; لما له في قلوبهم من الحسد لحب أبيه له\n                                    ",
        "qortoby": "قَالُواْ يَٰٓأَبَانَا مَالَكَ لَا تَأۡمَ۬نَّا عَلَىٰ يُوسُفَ وَإِنَّا لَهُۥ لَنَٰصِحُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : قالوا يا أبانا ما لك لا تأمنا على يوسف وإنا له لناصحون\nقوله تعالى : قالوا يا أبانا ما لك لا تأمنا على يوسف قيل للحسن : أيحسد المؤمن ؟ قال : ما أنساك ببني يعقوب . ولهذا قيل : الأب جلاب والأخ سلاب ; فعند ذلك أجمعوا على التفريق بينه وبين ولده بضرب من الاحتيال . وقالوا ليعقوب : يا أبانا ما لك لا تأمنا على يوسف وقيل : لما تفاوضوا وافترقوا على رأي المتكلم الثاني عادوا إلى يعقوب - عليه السلام - وقالوا : هذا القول . وفيه دليل على أنهم سألوه قبل ذلك أن يخرج معهم يوسف فأبى على ما يأتي . قرأ يزيد بن القعقاع وعمرو بن عبيد والزهري \" لا تأمنا \" بالإدغام ، وبغير إشمام وهو القياس ; لأن سبيل ما يدغم أن يكون ساكنا . وقرأ طلحة بن مصرف \" لا تأمننا \" بنونين ظاهرتين على الأصل . وقرأ يحيى بن وثاب وأبو رزين - وروي عن الأعمش - \" ولا تيمنا \" بكسر التاء ، وهي لغة تميم ; يقولون : أنت تضرب ; وقد تقدم . وقرأ سائر الناس بالإدغام والإشمام ليدل على حال الحرف قبل إدغامه\nوإنا له لناصحون أي في حفظه وحيطته حتى نرده إليك . قال مقاتل : في الكلام تقديم وتأخير ; وذلك أن إخوة يوسف قالوا لأبيهم : أرسله معنا غدا الآية ; فحينئذ قال أبوهم : إني ليحزنني أن تذهبوا به فقالوا حينئذ جوابا لقوله ما لك لا تأمنا على يوسف الآية .\n                                    ",
        "saadi": "قَالُواْ يَٰٓأَبَانَا مَالَكَ لَا تَأۡمَ۬نَّا عَلَىٰ يُوسُفَ وَإِنَّا لَهُۥ لَنَٰصِحُونَ ١١\n                                        \n                                        \n                                        \n                                        أي: قال إخوة يوسف، متوصلين إلى مقصدهم لأبيهم: { يَا أَبَانَا مَا لَكَ لَا تَأْمَنَّا عَلَى يُوسُفَ وَإِنَّا لَهُ لَنَاصِحُونَ ْ} أي: لأي شيء يدخلك الخوف منا على يوسف، من غير سبب ولا موجب؟ { وَ ْ} الحال { إِنَّا لَهُ لَنَاصِحُونَ ْ} أي: مشفقون عليه، نود له ما نود لأنفسنا، وهذا يدل على أن يعقوب عليه السلام لا يترك يوسف يذهب مع إخوته للبرية ونحوها.\n                                    "
      },
      "originalText": "قَالُواْ يَٰٓأَبَانَا مَالَكَ لَا تَأۡمَ۬نَّا عَلَىٰ يُوسُفَ وَإِنَّا لَهُۥ لَنَٰصِحُونَ ١١"
    },
    {
      "number": 1608,
      "text": "أَرْسِلْهُ مَعَنَا غَدًا يَرْتَعْ وَيَلْعَبْ وَإِنَّا لَهُ لَحَافِظُونَ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 12,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 194,
      "hizbQuarter": 95,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَرۡسِلۡهُ مَعَنَا غَدٗا يَرۡتَعۡ وَيَلۡعَبۡ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٢١\n                                    \n                                    \n                                    ( أرسله معنا ) أي : ابعثه معنا ، ( غدا نرتع ونلعب ) وقرأ بعضهم بالياء ( يرتع ويلعب )\nقال ابن عباس : يسعى وينشط . وكذا قال قتادة ، والضحاك والسدي ، وغيرهم .\n( وإنا له لحافظون ) يقولون : ونحن نحفظه ونحوطه من أجلك .\n                                    ",
        "qortoby": "أَرۡسِلۡهُ مَعَنَا غَدٗا يَرۡتَعۡ وَيَلۡعَبۡ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٢١\n                                    \n                                    \n                                    أرسله معنا غدا إلى الصحراء . غدا ظرف ، والأصل عند سيبويه غدو ، وقد نطق به على الأصل ; قال النضر بن شميل : ما بين الفجر وصلاة الصبح يقال له غدوة ، وكذا بكرة .\nنرتع ونلعب بالنون وإسكان العين قراءة أهل البصرة . والمعروف من قراءة أهل مكة . \" نرتع \" بالنون وكسر العين ، وقراءة أهل الكوفة . يرتع ويلعب بالياء وإسكان العين ، وقراءة أهل المدينة بالياء وكسر العين ; القراءة الأولى من قول العرب رتع الإنسان والبعير إذا أكلا كيف شاءا ; والمعنى : نتسع في الخصب ; وكل مخصب راتع ; قال :\nفارعي فزارة لا هناك المرتع\nوقال آخر :\nترتع ما غفلت حتى إذا ادكرت فإنما هي إقبال وإدبار\nوقال آخر :\nأكفرا بعد رد الموت عني وبعد عطائك المائة الرتاعا\nأي الراتعة لكثرة المرعى . وروى معمر عن قتادة \" ترتع \" تسعى ; قال النحاس : أخذه من قوله : إنا ذهبنا نستبق لأن المعنى : نستبق في العدو إلى غاية بعينها ; وكذا \" يرتع \" بإسكان العين ، إلا أنه ليوسف وحده - صلى الله عليه وسلم - و \" يرتع \" بكسر العين من رعي الغنم ، أي ليتدرب بذلك ويترجل ; فمرة يرتع ، ومرة يلعب لصغره . وقال القتبي \" نرتع \" نتحارس ونتحافظ ، ويرعى بعضنا بعضا ; من قولك : رعاك الله ; أي حفظك . \" ونلعب \" من اللعب وقيل لأبي عمرو بن العلاء : كيف قالوا \" ونلعب \" وهم أنبياء ؟ فقال : لم يكونوا يومئذ أنبياء . وقيل : المراد باللعب المباح من الانبساط ، لا اللعب المحظور الذي هو ضد الحق ; ولذلك لم ينكر يعقوب قولهم \" ونلعب \" . ومنه قوله - عليه السلام - : فهلا بكرا تلاعبها وتلاعبك . وقرأ مجاهد وقتادة : يرتع على معنى يرتع مطيته ، فحذف المفعول ; ويلعب بالرفع على الاستئناف ; والمعنى : هو ممن يلعب\nوإنا له لحافظون من كل ما تخاف عليه . ثم يحتمل أنهم كانوا يخرجون ركبانا ، ويحتمل أنهم كانوا رجالة . وقد نقل أنهم حملوا يوسف على أكتافهم ما دام يعقوب يراهم ، ثم لما غابوا عن عينه طرحوه ليعدو معهم إضرارا به .\n                                    ",
        "saadi": "أَرۡسِلۡهُ مَعَنَا غَدٗا يَرۡتَعۡ وَيَلۡعَبۡ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٢١\n                                        \n                                        \n                                        \n                                        فلما نفوا عن أنفسهم التهمة المانعة من عدم إرساله معهم، ذكروا له من مصلحة يوسف وأنسه الذي يحبه أبوه له، ما يقتضي أن يسمح بإرساله معهم، فقالوا:\n{ أَرْسِلْهُ مَعَنَا غَدًا يَرْتَعْ وَيَلْعَبْ ْ} أي: يتنزه في البرية ويستأنس. { وَإِنَّا لَهُ لَحَافِظُونَ ْ} أي: سنراعيه، ونحفظه من أذى يريده.\n                                    "
      },
      "originalText": "أَرۡسِلۡهُ مَعَنَا غَدٗا يَرۡتَعۡ وَيَلۡعَبۡ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٢١"
    },
    {
      "number": 1609,
      "text": "قَالَ إِنِّي لَيَحْزُنُنِي أَنْ تَذْهَبُوا بِهِ وَأَخَافُ أَنْ يَأْكُلَهُ الذِّئْبُ وَأَنْتُمْ عَنْهُ غَافِلُونَ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 13,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 194,
      "hizbQuarter": 95,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ إِنِّي لَيَحۡزُنُنِيٓ أَن تَذۡهَبُواْ بِهِۦ وَأَخَافُ أَن يَأۡكُلَهُ ٱلذِّئۡبُ وَأَنتُمۡ عَنۡهُ غَٰفِلُونَ ٣١\n                                    \n                                    \n                                    يقول تعالى مخبرا عن نبيه يعقوب أنه قال لبنيه في جواب ما سألوا من إرسال يوسف معهم إلى الرعي في الصحراء : ( إني ليحزنني أن تذهبوا به ) أي : يشق علي مفارقته مدة ذهابكم به إلى أن يرجع ، وذلك لفرط محبته له ، لما يتوسم فيه من الخير العظيم ، وشمائل النبوة والكمال في الخلق والخلق ، صلوات الله وسلامه عليه .\nوقوله : ( وأخاف أن يأكله الذئب وأنتم عنه غافلون ) يقول : وأخشى أن تشتغلوا عنه برميكم ورعيتكم فيأتيه ذئب فيأكله وأنتم لا تشعرون ، فأخذوا من فمه هذه الكلمة ، وجعلوها عذرهم فيما فعلوه\n                                    ",
        "qortoby": "قَالَ إِنِّي لَيَحۡزُنُنِيٓ أَن تَذۡهَبُواْ بِهِۦ وَأَخَافُ أَن يَأۡكُلَهُ ٱلذِّئۡبُ وَأَنتُمۡ عَنۡهُ غَٰفِلُونَ ٣١\n                                    \n                                    \n                                    قوله تعالى : قال إني ليحزنني أن تذهبوا به وأخاف أن يأكله الذئب وأنتم عنه غافلون\nقوله تعالى : قال إني ليحزنني أن تذهبوا به في موضع رفع ; أي ذهابكم به . أخبر عن حزنه لغيبته .\nوأخاف أن يأكله الذئب وذلك أنه رأى في منامه أن الذئب شد على يوسف ، فلذلك خافه عليه ; قاله الكلبي . وقيل : إنه رأى في منامه كأنه على ذروة جبل ، وكأن يوسف في بطن الوادي ، فإذا عشرة من الذئاب قد احتوشته تريد أكله ، فدرأ عنه واحد ، ثم انشقت الأرض فتوارى يوسف فيها ثلاثة أيام ; فكانت العشرة إخوته ، لما تمالئوا على قتله ، والذي دافع عنه أخوه الأكبر يهوذا ، وتواريه في الأرض هو مقامه في الجب ثلاثة أيام . وقيل : إنما قال ذلك لخوفه منهم عليه ، وإنه أرادهم بالذئب ; فخوفه إنما كان من قتلهم له ، فكنى عنهم بالذئب مساترة لهم ; قال ابن عباس : فسماهم ذئابا . وقيل : ما خافهم عليه ، ولو خافهم لما أرسله معهم ، وإنما خاف الذئب ; لأنه أغلب ما يخاف في الصحاري . والذئب مأخوذ من تذاءبت الريح إذا جاءت من كل وجه ; كذا قال أحمد بن يحيى ; قال : والذئب مهموز لأنه يجيء من كل وجه . وروى ورش عن نافع \" الذيب \" بغير همز ، لما كانت الهمزة ساكنة وقبلها كسرة فخففها صارت ياء .\nوأنتم عنه غافلون أي مشتغلون بالرعي .\n                                    ",
        "saadi": "قَالَ إِنِّي لَيَحۡزُنُنِيٓ أَن تَذۡهَبُواْ بِهِۦ وَأَخَافُ أَن يَأۡكُلَهُ ٱلذِّئۡبُ وَأَنتُمۡ عَنۡهُ غَٰفِلُونَ ٣١\n                                        \n                                        \n                                        \n                                        فأجابهم بقوله: { إِنِّي لَيَحْزُنُنِي أَنْ تَذْهَبُوا بِهِ ْ} أي: مجرد ذهابكم به يحزنني ويشق علي، لأنني لا أقدر على فراقه، ولو مدة يسيرة، فهذا مانع من إرساله { وَ ْ} مانع ثان، وهو أني { أَخَافُ أَنْ يَأْكُلَهُ الذِّئْبُ وَأَنْتُمْ عَنْهُ غَافِلُونَ ْ} أي: في حال غفلتكم عنه، لأنه صغير لا يمتنع من الذئب.\n                                    "
      },
      "originalText": "قَالَ إِنِّي لَيَحۡزُنُنِيٓ أَن تَذۡهَبُواْ بِهِۦ وَأَخَافُ أَن يَأۡكُلَهُ ٱلذِّئۡبُ وَأَنتُمۡ عَنۡهُ غَٰفِلُونَ ٣١"
    },
    {
      "number": 1610,
      "text": "قَالُوا لَئِنْ أَكَلَهُ الذِّئْبُ وَنَحْنُ عُصْبَةٌ إِنَّا إِذًا لَخَاسِرُونَ",
      "surah": {
        "number": 12,
        "name": "سورة يوسف",
        "englishName": "Yusuf",
        "englishNameTranslation": "Joseph",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 14,
      "juz": 12,
      "manzil": 3,
      "page": 236,
      "ruku": 194,
      "hizbQuarter": 95,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالُواْ لَئِنۡ أَكَلَهُ ٱلذِّئۡبُ وَنَحۡنُ عُصۡبَةٌ إِنَّآ إِذٗا لَّخَٰسِرُونَ ٤١\n                                    \n                                    \n                                    وقالوا مجيبين عنها في الساعة الراهنة : ( لئن أكله الذئب ونحن عصبة إنا إذا لخاسرون ) يقولون : لئن عدا عليه الذئب فأكله من بيننا ، ونحن جماعة ، إنا إذا لهالكون عاجزون .\n                                    ",
        "qortoby": "قَالُواْ لَئِنۡ أَكَلَهُ ٱلذِّئۡبُ وَنَحۡنُ عُصۡبَةٌ إِنَّآ إِذٗا لَّخَٰسِرُونَ ٤١\n                                    \n                                    \n                                    قوله تعالى : قالوا لئن أكله الذئب ونحن عصبة أي جماعة نرى الذئب ثم لا نرده عنه .\nإنا إذا لخاسرون أي في حفظنا أغنامنا ; أي إذا كنا لا نقدر على دفع الذئب عن أخينا فنحن أعجز أن ندفعه عن أغنامنا . وقيل : \" لخاسرون \" لجاهلون بحقه . وقيل : لعاجزون .\n                                    ",
        "saadi": "قَالُواْ لَئِنۡ أَكَلَهُ ٱلذِّئۡبُ وَنَحۡنُ عُصۡبَةٌ إِنَّآ إِذٗا لَّخَٰسِرُونَ ٤١\n                                        \n                                        \n                                        \n                                        { قَالُوا لَئِنْ أَكَلَهُ الذِّئْبُ وَنَحْنُ عُصْبَةٌ ْ} أي: جماعة، حريصون على حفظه، { إِنَّا إِذًا لَخَاسِرُونَ ْ} أي: لا خير فينا ولا نفع يرجى منا إن أكله الذئب وغلبنا عليه.\nفلما مهدوا لأبيهم الأسباب الداعية لإرساله، وعدم الموانع، سمح حينئذ بإرساله معهم لأجل أنسه.\n                                    "
      },
      "originalText": "قَالُواْ لَئِنۡ أَكَلَهُ ٱلذِّئۡبُ وَنَحۡنُ عُصۡبَةٌ إِنَّآ إِذٗا لَّخَٰسِرُونَ ٤١"
    }
  ]
}