{
  "number": 24,
  "ayahsNumber": 10,
  "ayahs": [
    {
      "number": 161,
      "text": "وَلَا تَقُولُوا لِمَنْ يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ ۚ بَلْ أَحْيَاءٌ وَلَٰكِنْ لَا تَشْعُرُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 154,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَقُولُواْ لِمَن يُقۡتَلُ فِي سَبِيلِ ٱللَّهِ أَمۡوَٰتُۢۚ بَلۡ أَحۡيَآءٞ وَلَٰكِن لَّا تَشۡعُرُونَ ٤٥١\n                                    \n                                    \n                                    وقوله تعالى : ( ولا تقولوا لمن يقتل في سبيل الله أموات بل أحياء ) يخبر تعالى أن الشهداء في برزخهم أحياء يرزقون ، كما جاء في صحيح مسلم : \" إن أرواح الشهداء في حواصل طير خضر تسرح في الجنة حيث شاءت ثم تأوي إلى قناديل معلقة تحت العرش ، فاطلع عليهم ربك اطلاعة ، فقال : ماذا تبغون ؟ فقالوا : يا ربنا ، وأي شيء نبغي ، وقد أعطيتنا ما لم تعط أحدا من خلقك ؟ ثم عاد إليهم بمثل هذا ، فلما رأوا أنهم لا يتركون من أن يسألوا ، قالوا : نريد أن تردنا إلى الدار الدنيا ، فنقاتل في سبيلك ، حتى نقتل فيك مرة أخرى ; لما يرون من ثواب الشهادة فيقول الرب جل جلاله : إني كتبت أنهم إليها لا يرجعون \" .\nوفي الحديث الذي رواه الإمام أحمد ، عن الإمام الشافعي ، عن الإمام مالك ، عن الزهري ، عن عبد الرحمن بن كعب بن مالك ، عن أبيه قال : قال رسول الله صلى الله عليه وسلم : \" نسمة المؤمن طائر تعلق في شجر الجنة ، حتى يرجعه الله إلى جسده يوم يبعثه \" .\nففيه دلالة لعموم المؤمنين أيضا ، وإن كان الشهداء قد خصصوا بالذكر في القرآن ، تشريفا لهم وتكريما وتعظيما .\n                                    ",
        "qortoby": "وَلَا تَقُولُواْ لِمَن يُقۡتَلُ فِي سَبِيلِ ٱللَّهِ أَمۡوَٰتُۢۚ بَلۡ أَحۡيَآءٞ وَلَٰكِن لَّا تَشۡعُرُونَ ٤٥١\n                                    \n                                    \n                                    قوله تعالى : ولا تقولوا لمن يقتل في سبيل الله أموات بل أحياء ولكن لا تشعرون هذا مثل قوله تعالى في الآية الأخرى : ولا تحسبن الذين قتلوا في سبيل الله أمواتا بل أحياء عند ربهم يرزقون وهناك يأتي الكلام في الشهداء وأحكامهم ، إن شاء الله تعالى .\nوإذا كان الله تعالى يحييهم بعد الموت ليرزقهم - على ما يأتي - فيجوز أن يحيي الكفار ليعذبهم ، ويكون فيه دليل على عذاب القبر . والشهداء أحياء كما قال الله تعالى ، وليس معناه أنهم سيحيون ، إذ لو كان كذلك لم يكن بين الشهداء وبين غيرهم فرق إذ كل أحد سيحيا . ويدل على هذا قوله تعالى : ولكن لا تشعرون والمؤمنون يشعرون أنهم سيحيون . وارتفع أموات على إضمار مبتدأ ، وكذلك بل أحياء أي هم أموات وهم أحياء ، ولا يصح إعمال القول فيه لأنه ليس بينه وبينه تناسب ، كما يصح في قولك : قلت كلاما وحجة .\n                                    ",
        "saadi": "وَلَا تَقُولُواْ لِمَن يُقۡتَلُ فِي سَبِيلِ ٱللَّهِ أَمۡوَٰتُۢۚ بَلۡ أَحۡيَآءٞ وَلَٰكِن لَّا تَشۡعُرُونَ ٤٥١\n                                        \n                                        \n                                        \n                                        لما ذكر تبارك وتعالى, الأمر بالاستعانة بالصبر على جميع الأمور ذكر نموذجا مما يستعان بالصبر عليه, وهو الجهاد في سبيله, وهو أفضل الطاعات البدنية, وأشقها على النفوس, لمشقته في نفسه, ولكونه مؤديا للقتل, وعدم الحياة, التي إنما يرغب الراغبون في هذه الدنيا لحصول الحياة ولوازمها، فكل ما يتصرفون به, فإنه سعى لها, ودفع لما يضادها. ومن المعلوم أن المحبوب لا يتركه العاقل إلا لمحبوب أعلى منه وأعظم، فأخبر تعالى: أن من قتل في سبيله, بأن قاتل في سبيل الله, لتكون كلمة الله هي العليا, ودينه الظاهر, لا لغير ذلك من الأغراض, فإنه لم تفته الحياة المحبوبة, بل حصل له حياة أعظم وأكمل, مما تظنون وتحسبون. فالشهداء { أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ فَرِحِينَ بِمَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ وَيَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِمْ مِنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ يَسْتَبْشِرُونَ بِنِعْمَةٍ مِنَ اللَّهِ وَفَضْلٍ وَأَنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُؤْمِنِينَ } فهل أعظم من هذه الحياة المتضمنة للقرب من الله تعالى, وتمتعهم برزقه البدني في المأكولات والمشروبات اللذيذة, والرزق الروحي, وهو الفرح، والاستبشار وزوال كل خوف وحزن، وهذه حياة برزخية أكمل من الحياة الدنيا، بل قد أخبر النبي صلى الله عليه وسلم أن أرواح الشهداء في أجواف طيور خضر ترد أنهار الجنة, وتأكل من ثمارها, وتأوي إلى قناديل معلقة بالعرش. وفي هذه الآية, أعظم حث على الجهاد في سبيل الله, وملازمة الصبر عليه، فلو شعر العباد بما للمقتولين في سبيل الله من الثواب لم يتخلف عنه أحد، ولكن عدم العلم اليقيني التام, هو الذي فتر العزائم, وزاد نوم النائم, وأفات الأجور العظيمة والغنائم، لم لا يكون كذلك والله تعالى قد: { اشْتَرَى مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوَالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ } فوالله لو كان للإنسان ألف نفس, تذهب نفسا فنفسا في سبيل الله, لم يكن عظيما في جانب هذا الأجر العظيم، ولهذا لا يتمنى الشهداء بعدما عاينوا من ثواب الله وحسن جزائه إلا أن يردوا إلى الدنيا, حتى يقتلوا في سبيله مرة بعد مرة. وفي الآية, دليل على نعيم البرزخ وعذابه, كما تكاثرت بذلك النصوص.\n                                    "
      },
      "originalText": "وَلَا تَقُولُواْ لِمَن يُقۡتَلُ فِي سَبِيلِ ٱللَّهِ أَمۡوَٰتُۢۚ بَلۡ أَحۡيَآءٞ وَلَٰكِن لَّا تَشۡعُرُونَ ٤٥١"
    },
    {
      "number": 162,
      "text": "وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 155,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَنَبۡلُوَنَّكُم بِشَيۡءٖ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصٖ مِّنَ ٱلۡأَمۡوَٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَٰتِۗ وَبَشِّرِ ٱلصَّٰبِرِينَ ٥٥١\n                                    \n                                    \n                                    أخبر تعالى أنه يبتلي عباده [ المؤمنين ] أي : يختبرهم ويمتحنهم ، كما قال تعالى : ( ولنبلونكم حتى نعلم المجاهدين منكم والصابرين ونبلو أخباركم ) [ محمد : 31 ] فتارة بالسراء ، وتارة بالضراء من خوف وجوع ، كما قال تعالى : ( فأذاقها الله لباس الجوع والخوف ) [ النحل : 112 ] فإن الجائع والخائف كل منهما يظهر ذلك عليه ; ولهذا قال : لباس الجوع والخوف . وقال هاهنا ( بشيء من الخوف والجوع ) أي : بقليل من ذلك ( ونقص من الأموال ) أي : ذهاب بعضها ) والأنفس ) كموت الأصحاب والأقارب والأحباب ) والثمرات ) أي : لا تغل الحدائق والمزارع كعادتها . كما قال بعض السلف : فكانت بعض النخيل لا تثمر غير واحدة . وكل هذا وأمثاله مما يختبر الله به عباده ، فمن صبر أثابه [ الله ] ومن قنط أحل [ الله ] به عقابه .\nولهذا قال : ( وبشر الصابرين )\nوقد حكى بعض المفسرين أن المراد من الخوف هاهنا : خوف الله ، وبالجوع : صيام رمضان ، ونقص الأموال : الزكاة ، والأنفس : الأمراض ، والثمرات : الأولاد .\nوفي هذا نظر ، والله أعلم .\n                                    ",
        "qortoby": "وَلَنَبۡلُوَنَّكُم بِشَيۡءٖ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصٖ مِّنَ ٱلۡأَمۡوَٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَٰتِۗ وَبَشِّرِ ٱلصَّٰبِرِينَ ٥٥١\n                                    \n                                    \n                                    قوله تعالى : ولنبلونكم بشيء من الخوف والجوع ونقص من الأموال والأنفس والثمرات وبشر الصابرين\nقوله تعالى : \" ولنبلونكم \" هذه الواو مفتوحة عند سيبويه لالتقاء الساكنين . وقال غيره : لما ضمت إلى النون الثقيلة بني الفعل فصار بمنزلة خمسة عشر . والبلاء يكون حسنا ويكون سيئا . وأصله المحنة ، وقد تقدم . والمعنى لأمتحننكم لنعلم المجاهد والصابر علم معاينة حتى يقع عليه الجزاء ، كما تقدم . وقيل : إنما ابتلوا بهذا ليكون آية لمن بعدهم فيعلموا أنهم إنما صبروا على هذا حين وضح لهم الحق . وقيل : أعلمهم بهذا ليكونوا على يقين منه أنه يصيبهم ، فيوطنوا أنفسهم عليه فيكونوا أبعد لهم من الجزع ، وفيه تعجيل ثواب الله تعالى على العز وتوطين النفس .\nقوله تعالى : بشيء لفظ مفرد ومعناه الجمع . وقرأ الضحاك \" بأشياء \" على الجمع . وقرأ الجمهور بالتوحيد ، أي بشيء من هذا وشيء من هذا ، فاكتفى بالأول إيجازا : من الخوف أي خوف العدو والفزع في القتال ، قاله ابن عباس . وقال الشافعي : هو خوف الله عز وجل . والجوع يعني المجاعة بالجدب والقحط ، في قول ابن عباس . وقال الشافعي : هو الجوع في شهر رمضان . ونقص من الأموال بسبب الاشتغال بقتال الكفار . وقيل : بالجوائح المتلفة . وقال الشافعي : بالزكاة المفروضة . والأنفس قال ابن عباس : بالقتل والموت في الجهاد . وقال الشافعي : يعني بالأمراض . والثمرات قال الشافعي : المراد موت الأولاد ، وولد الرجل ثمرة قلبه ، كما جاء في الخبر ، على ما يأتي . وقال ابن عباس : المراد قلة النبات وانقطاع البركات .\nقوله تعالى : وبشر الصابرين أي بالثواب على الصبر . والصبر أصله الحبس ، وثوابه غير مقدر ، وقد تقدم . لكن لا يكون ذلك إلا بالصبر عند الصدمة الأولى ، كما روى البخاري عن أنس عن النبي صلى الله عليه وسلم قال : إنما الصبر عند الصدمة الأولى . وأخرجه مسلم أتم منه ، أي إنما الصبر الشاق على النفس الذي يعظم الثواب عليه إنما هو عند هجوم المصيبة وحرارتها ، فإنه يدل على قوة القلب وتثبته في مقام الصبر ، وأما إذا بردت حرارة المصيبة فكل أحد يصبر إذ ذاك ، ولذلك قيل : يجب على كل عاقل أن يلتزم عند المصيبة ما لا بد للأحمق منه بعد ثلاث . وقال سهل بن عبد الله التستري : لما قال تعالى : وبشر الصابرين صار الصبر عيشا . والصبر صبران : صبر عن معصية الله ، فهذا مجاهد ، وصبر على طاعة الله ، فهذا عابد . فإذا صبر عن معصية الله وصبر على طاعة الله أورثه الله الرضا بقضائه وعلامة الرضا سكون القلب بما ورد على النفس من المكروهات والمحبوبات . وقال الخواص : الصبر الثبات على أحكام الكتاب والسنة . وقال رويم : الصبر ترك الشكوى . وقال ذو النون المصري : الصبر هو الاستعانة بالله تعالى . وقال الأستاذ أبو علي : الصبر حده ألا تعترض على التقدير ، فأما إظهار البلوى على غير وجه الشكوى فلا ينافي الصبر ، قال الله تعالى في قصة أيوب : إنا وجدناه صابرا نعم العبد مع ما أخبر عنه أنه قال : مسني الضر .\n                                    ",
        "saadi": "وَلَنَبۡلُوَنَّكُم بِشَيۡءٖ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصٖ مِّنَ ٱلۡأَمۡوَٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَٰتِۗ وَبَشِّرِ ٱلصَّٰبِرِينَ ٥٥١\n                                        \n                                        \n                                        \n                                        أخبر تعالى أنه لا بد أن يبتلي عباده بالمحن, ليتبين الصادق من الكاذب, والجازع من الصابر, وهذه سنته تعالى في عباده؛ لأن السراء لو استمرت لأهل الإيمان, ولم يحصل معها محنة, لحصل الاختلاط الذي هو فساد, وحكمة الله تقتضي تمييز أهل الخير من أهل الشر. هذه فائدة المحن, لا إزالة ما مع المؤمنين من الإيمان, ولا ردهم عن دينهم, فما كان الله ليضيع إيمان المؤمنين، فأخبر في هذه الآية أنه سيبتلي عباده { بِشَيْءٍ مِنَ الْخَوْفِ } من الأعداء { وَالْجُوعِ } أي: بشيء يسير منهما؛ لأنه لو ابتلاهم بالخوف كله, أو الجوع, لهلكوا, والمحن تمحص لا تهلك. { وَنَقْصٍ مِنَ الْأَمْوَالِ } وهذا يشمل جميع النقص المعتري للأموال من جوائح سماوية, وغرق, وضياع, وأخذ الظلمة للأموال من الملوك الظلمة, وقطاع الطريق وغير ذلك. { وَالْأَنْفُسِ } أي: ذهاب الأحباب من الأولاد, والأقارب, والأصحاب, ومن أنواع الأمراض في بدن العبد, أو بدن من يحبه، { وَالثَّمَرَاتِ } أي: الحبوب, وثمار النخيل, والأشجار كلها, والخضر ببرد, أو برد, أو حرق, أو آفة سماوية, من جراد ونحوه. فهذه الأمور, لا بد أن تقع, لأن العليم الخبير, أخبر بها, فوقعت كما أخبر، فإذا وقعت انقسم الناس قسمين: جازعين وصابرين، فالجازع, حصلت له المصيبتان, فوات المحبوب, وهو وجود هذه المصيبة، وفوات ما هو أعظم منها, وهو الأجر بامتثال أمر الله بالصبر، ففاز بالخسارة والحرمان, ونقص ما معه من الإيمان، وفاته الصبر والرضا والشكران, وحصل [له] السخط الدال على شدة النقصان. وأما من وفقه الله للصبر عند وجود هذه المصائب, فحبس نفسه عن التسخط, قولا وفعلا, واحتسب أجرها عند الله, وعلم أن ما يدركه من الأجر بصبره أعظم من المصيبة التي حصلت له, بل المصيبة تكون نعمة في حقه, لأنها صارت طريقا لحصول ما هو خير له وأنفع منها, فقد امتثل أمر الله, وفاز بالثواب، فلهذا قال تعالى: { وَبَشِّرِ الصَّابِرِينَ } أي: بشرهم بأنهم يوفون أجرهم بغير حساب.\n                                    "
      },
      "originalText": "وَلَنَبۡلُوَنَّكُم بِشَيۡءٖ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصٖ مِّنَ ٱلۡأَمۡوَٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَٰتِۗ وَبَشِّرِ ٱلصَّٰبِرِينَ ٥٥١"
    },
    {
      "number": 163,
      "text": "الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 156,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ إِذَآ أَصَٰبَتۡهُم مُّصِيبَةٞ قَالُوٓاْ إِنَّا لِلَّهِ وَإِنَّآ إِلَيۡهِ رَٰجِعُونَ ٦٥١\n                                    \n                                    \n                                    ثم بين تعالى من الصابرون الذين شكرهم ، قال : ( الذين إذا أصابتهم مصيبة قالوا إنا لله وإنا إليه راجعون ) أي : تسلوا بقولهم هذا عما أصابهم ، وعلموا أنهم ملك لله يتصرف في عبيده بما يشاء ، وعلموا أنه لا يضيع لديه مثقال ذرة يوم القيامة ، فأحدث لهم ذلك اعترافهم بأنهم عبيده ، وأنهم إليه راجعون في الدار الآخرة .\n                                    ",
        "qortoby": "ٱلَّذِينَ إِذَآ أَصَٰبَتۡهُم مُّصِيبَةٞ قَالُوٓاْ إِنَّا لِلَّهِ وَإِنَّآ إِلَيۡهِ رَٰجِعُونَ ٦٥١\n                                    \n                                    \n                                    قوله تعالى : الذين إذا أصابتهم مصيبة قالوا إنا لله وإنا إليه راجعون\nفيه ست مسائل :\nالأولى : قوله تعالى : مصيبة المصيبة : كل ما يؤذي المؤمن ويصيبه ، يقال : أصابه إصابة ومصابة ومصابا . والمصيبة واحدة المصائب . والمصوبة ( بضم الصاد ) مثل المصيبة . وأجمعت العرب على همز المصائب ، وأصله الواو ، كأنهم شبهوا الأصلي بالزائد ، ويجمع على مصاوب ، وهو الأصل . والمصاب الإصابة ، قال الشاعر :\nأسليم إن مصابكم رجلا أهدى السلام تحية ظلم\nوصاب السهم القرطاس يصيب صيبا ، لغة في أصابه . والمصيبة : النكبة ينكبها الإنسان وإن صغرت ، وتستعمل في الشر ، روى عكرمة أن مصباح رسول الله صلى الله عليه وسلم انطفأ ذات ليلة فقال : إنا لله وإنا إليه راجعون فقيل : أمصيبة هي يا رسول الله ؟ قال : نعم كل ما آذى المؤمن فهو مصيبة .\nقلت : هذا ثابت معناه في الصحيح ، خرج مسلم عن أبي سعيد وعن أبي هريرة رضي الله عنهما أنهما سمعا رسول الله صلى الله عليه وسلم يقول : ما يصيب المؤمن من وصب ولا نصب ولا سقم ولا حزن حتى الهم يهمه إلا كفر به من سيئاته .\nالثانية : خرج ابن ماجه في سننه حدثنا أبو بكر بن أبي شيبة حدثنا وكيع بن الجراح عن هشام بن زياد عن أمه عن فاطمة بنت الحسين عن أبيها قال قال رسول الله صلى الله عليه وسلم : من أصيب بمصيبة فذكر مصيبته فأحدث استرجاعا وإن تقادم عهدها كتب الله له من الأجر مثله يوم أصيب .\nالثالثة : من أعظم المصائب المصيبة في الدين ، ذكر أبو عمر عن الفريابي قال حدثنا فطر بن خليفة حدثنا عطاء بن أبي رباح قال قال رسول الله صلى الله عليه وسلم : إذا أصاب أحدكم مصيبة فليذكر مصابه بي فإنها من أعظم المصائب . أخرجه السمرقندي أبو محمد في مسنده ، أخبرنا أبو نعيم قال : أنبأنا فطر . . . ، فذكر مثله سواء . وأسند مثله عن مكحول مرسلا . قال أبو عمر : وصدق رسول الله صلى الله عليه وسلم ; لأن المصيبة به أعظم من كل مصيبة يصاب بها المسلم بعده إلى يوم القيامة ، انقطع الوحي وماتت النبوة . وكان أول ظهور الشر بارتداد العرب وغير ذلك ، وكان أول انقطاع الخير وأول نقصانه . قال أبو سعيد : ما نفضنا أيدينا من التراب من قبر رسول الله صلى الله عليه وسلم حتى أنكرنا قلوبنا . ولقد أحسن أبو العتاهية في نظمه معنى هذا الحديث حيث يقول :\nاصبر لكل مصيبة وتجلد واعلم بأن المرء غير مخلد\nأوما ترى أن المصائب جمة وترى المنية للعباد بمرصد\nمن لم يصب ممن ترى بمصيبة ؟ هذا سبيل لست فيه بأوحد\nفإذا ذكرت محمدا ومصابه فاذكر مصابك بالنبي محمد\nالرابعة : قوله تعالى : قالوا إنا لله وإنا إليه راجعون جعل الله تعالى هذه الكلمات ملجأ لذوي المصائب ، وعصمة للممتحنين : لما جمعت من المعاني المباركة ، فإن قوله : إنا لله توحيد وإقرار بالعبودية والملك . وقوله : وإنا إليه راجعون إقرار بالهلك ، على أنفسنا والبعث من قبورنا ، واليقين أن رجوع الأمر كله إليه كما هو له . قال سعيد بن جبير رحمه الله تعالى : لم تعط هذه الكلمات نبيا قبل نبينا ، ولو عرفها يعقوب لما قال : يا أسفى على يوسف .\nالخامسة : قال أبو سنان : دفنت ابني سنانا وأبو طلحة الخولاني على شفير القبر ، فلما أردت الخروج أخذ بيدي فأنشطني وقال : ألا أبشرك يا أبا سنان حدثني الضحاك عن أبي موسى أن النبي صلى الله عليه وسلم قال : إذا مات ولد العبد قال الله لملائكته أقبضتم ولد عبدي فيقولون نعم فيقول أقبضتم ثمرة فؤاده فيقولون نعم فيقول فماذا قال عبدي فيقولون حمدك واسترجع فيقول الله تعالى ابنوا لعبدي بيتا في الجنة وسموه بيت الحمد . وروى مسلم عن أم سلمة قالت سمعت رسول الله صلى الله عليه وسلم يقول : ما من مسلم تصيبه مصيبة فيقول ما أمره الله عز وجل إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي وأخلف لي خيرا منها إلا أخلف الله له خيرا منها . فهذا تنبيه على قوله تعالى : وبشر الصابرين إما بالخلف كما أخلف الله لأم سلمة رسول الله صلى الله عليه وسلم ، فإنه تزوجها لما مات أبو سلمة زوجها . وإما بالثواب الجزيل ، كما في حديث أبي موسى ، وقد يكون بهما .\n                                    ",
        "saadi": "ٱلَّذِينَ إِذَآ أَصَٰبَتۡهُم مُّصِيبَةٞ قَالُوٓاْ إِنَّا لِلَّهِ وَإِنَّآ إِلَيۡهِ رَٰجِعُونَ ٦٥١\n                                        \n                                        \n                                        \n                                        فالصابرين, هم الذين فازوا بالبشارة العظيمة, والمنحة الجسيمة، ثم وصفهم بقوله: { الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ } وهي كل ما يؤلم القلب أو البدن أو كليهما مما تقدم ذكره. { قَالُوا إِنَّا لِلَّهِ } أي: مملوكون لله, مدبرون تحت أمره وتصريفه, فليس لنا من أنفسنا وأموالنا شيء، فإذا ابتلانا بشيء منها, فقد تصرف أرحم الراحمين, بمماليكه وأموالهم, فلا اعتراض عليه، بل من كمال عبودية العبد, علمه, بأن وقوع البلية من المالك الحكيم, الذي أرحم بعبده من نفسه، فيوجب له ذلك, الرضا عن الله, والشكر له على تدبيره, لما هو خير لعبده, وإن لم يشعر بذلك، ومع أننا مملوكون لله, فإنا إليه راجعون يوم المعاد, فمجاز كل عامل بعمله، فإن صبرنا واحتسبنا وجدنا أجرنا موفورا عنده، وإن جزعنا وسخطنا, لم يكن حظنا إلا السخط وفوات الأجر، فكون العبد لله, وراجع إليه, من أقوى أسباب الصبر.\n                                    "
      },
      "originalText": "ٱلَّذِينَ إِذَآ أَصَٰبَتۡهُم مُّصِيبَةٞ قَالُوٓاْ إِنَّا لِلَّهِ وَإِنَّآ إِلَيۡهِ رَٰجِعُونَ ٦٥١"
    },
    {
      "number": 164,
      "text": "أُولَٰئِكَ عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ وَرَحْمَةٌ ۖ وَأُولَٰئِكَ هُمُ الْمُهْتَدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 157,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 9,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أُوْلَٰٓئِكَ عَلَيۡهِمۡ صَلَوَٰتٞ مِّن رَّبِّهِمۡ وَرَحۡمَةٞۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُهۡتَدُونَ ٧٥١\n                                    \n                                    \n                                    ولهذا أخبر تعالى عما أعطاهم على ذلك فقال : ( أولئك عليهم صلوات من ربهم ) أي : ثناء من الله عليهم ورحمة .\nقال سعيد بن جبير : أي : أمنة من العذاب ( وأولئك هم المهتدون ) قال أمير المؤمنين عمر بن الخطاب : نعم العدلان ونعمت العلاوة ( أولئك عليهم صلوات من ربهم ورحمة ) فهذان العدلان ( وأولئك هم المهتدون ) فهذه العلاوة ، وهي ما توضع بين العدلين ، وهي زيادة في الحمل وكذلك هؤلاء ، أعطوا ثوابهم وزيدوا أيضا .\nوقد ورد في ثواب الاسترجاع ، وهو قول ( إنا لله وإنا إليه راجعون ) عند المصائب أحاديث كثيرة . فمن ذلك ما رواه الإمام أحمد :\nحدثنا يونس ، حدثنا ليث يعني ابن سعد عن يزيد بن عبد الله بن أسامة بن الهاد ، عن عمرو بن أبي عمرو ، عن المطلب ، عن أم سلمة قالت : أتاني أبو سلمة يوما من عند رسول الله صلى الله عليه وسلم ، فقال : لقد سمعت من رسول الله صلى الله عليه وسلم قولا سررت به . قال : \" لا يصيب أحدا من المسلمين مصيبة فيسترجع عند مصيبته ، ثم يقول : اللهم أجرني في مصيبتي واخلف لي خيرا منها ، إلا فعل ذلك به \" . قالت أم سلمة : فحفظت ذلك منه ، فلما توفي أبو سلمة استرجعت وقلت : اللهم أجرني في مصيبتي واخلف لي خيرا منه ، ثم رجعت إلى نفسي . فقلت : من أين لي خير من أبي سلمة ؟ فلما انقضت عدتي استأذن علي رسول الله صلى الله عليه وسلم وأنا أدبغ إهابا لي فغسلت يدي من القرظ وأذنت له ، فوضعت له وسادة أدم حشوها ليف ، فقعد عليها ، فخطبني إلى نفسي ، فلما فرغ من مقالته قلت : يا رسول الله ، ما بي ألا يكون بك الرغبة ، ولكني امرأة ، في غيرة شديدة ، فأخاف أن ترى مني شيئا يعذبني الله به ، وأنا امرأة قد دخلت في السن ، وأنا ذات عيال ، فقال : \" أما ما ذكرت من الغيرة فسوف يذهبها الله ، عز وجل عنك . وأما ما ذكرت من السن فقد أصابني مثل الذي أصابك ، وأما ما ذكرت من العيال فإنما عيالك عيالي \" . قالت : فقد سلمت لرسول الله صلى الله عليه وسلم . فتزوجها رسول الله صلى الله عليه وسلم ، فقالت أم سلمة بعد : أبدلني الله بأبي سلمة خيرا منه ، رسول الله صلى الله عليه وسلم .\nوفي صحيح مسلم ، عنها أنها قالت : سمعت رسول الله صلى الله عليه وسلم يقول : \" ما من عبد تصيبه مصيبة فيقول : ( إنا لله وإنا إليه راجعون ) اللهم أجرني في مصيبتي واخلف لي خيرا منها ، إلا آجره الله من مصيبته ، وأخلف له خيرا منها \" قالت : فلما توفي أبو سلمة قلت كما أمرني رسول الله صلى الله عليه وسلم ، فأخلف الله لي خيرا منه : رسول الله صلى الله عليه وسلم .\nوقال الإمام أحمد : حدثنا يزيد ، وعباد بن عباد قالا : حدثنا هشام بن أبي هشام ، حدثنا عباد بن زياد ، عن أمه ، عن فاطمة ابنة الحسين ، عن أبيها الحسين بن علي ، عن النبي صلى الله عليه وسلم قال : \" ما من مسلم ولا مسلمة يصاب بمصيبة فيذكرها وإن طال عهدها ، وقال عباد : قدم عهدها فيحدث لذلك استرجاعا ، إلا جدد الله له عند ذلك فأعطاه مثل أجرها يوم أصيب \" .\nورواه ابن ماجه في سننه ، عن أبي بكر بن أبي شيبة ، عن وكيع ، عن هشام بن زياد ، عن أمه ، عن فاطمة بنت الحسين ، عن أبيها [ الحسين ] .\nوقد رواه إسماعيل بن علية ، ويزيد بن هارون ، عن هشام بن زياد عن أبيه ، كذا عن ، فاطمة ، عن أبيها .\nوقال الإمام أحمد : حدثنا يحيى بن إسحاق السالحيني ، أخبرنا حماد بن سلمة ، عن أبي سنان قال : دفنت ابنا لي ، فإني لفي القبر إذ أخذ بيدي أبو طلحة يعني الخولاني فأخرجني ، وقال لي : ألا أبشرك ؟ قلت : بلى . قال : حدثني الضحاك بن عبد الرحمن بن عرزب ، عن أبي موسى ، قال : قال رسول الله صلى الله عليه وسلم : \" قال الله : يا ملك الموت ، قبضت ولد عبدي ؟ قبضت قرة عينه وثمرة فؤاده ؟ قال نعم . قال : فما قال ؟ قال : حمدك واسترجع ، قال : ابنو له بيتا في الجنة ، وسموه بيت الحمد \" .\nثم رواه عن علي بن إسحاق ، عن عبد الله بن المبارك . فذكره . وهكذا رواه الترمذي عن سويد بن نصر ، عن ابن المبارك ، به . وقال : حسن غريب . واسم أبي سنان : عيسى بن سنان .\n                                    ",
        "qortoby": "أُوْلَٰٓئِكَ عَلَيۡهِمۡ صَلَوَٰتٞ مِّن رَّبِّهِمۡ وَرَحۡمَةٞۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُهۡتَدُونَ ٧٥١\n                                    \n                                    \n                                    السادسة : قوله تعالى : أولئك عليهم صلوات من ربهم ورحمة هذه نعم من الله عز وجل على الصابرين المسترجعين . وصلاة الله على عبده : عفوه ورحمته وبركته وتشريفه إياه في الدنيا والآخرة . وقال الزجاج : الصلاة من الله عز وجل الغفران والثناء الحسن . ومن هذا الصلاة على الميت إنما هو الثناء عليه والدعاء له ، وكرر الرحمة لما اختلف اللفظ تأكيدا وإشباعا للمعنى ، كما قال : من البينات والهدى ، وقوله أم يحسبون أنا لا نسمع سرهم ونجواهم . وقال الشاعر :\nصلى على يحيى وأشياعه رب كريم وشفيع مطاع\nوقيل : أراد بالرحمة كشف الكربة وقضاء الحاجة . وفي البخاري وقال عمر رضي الله عنه : نعم العدلان ونعم العلاوة : الذين إذا أصابتهم مصيبة قالوا إنا لله وإنا إليه راجعون أولئك عليهم صلوات من ربهم ورحمة وأولئك هم المهتدون . أراد بالعدلين الصلاة والرحمة ، وبالعلاوة الاهتداء . قيل : إلى استحقاق الثواب وإجزال الأجر ، وقيل : إلى تسهيل المصائب وتخفيف الحزن .\n                                    ",
        "saadi": "أُوْلَٰٓئِكَ عَلَيۡهِمۡ صَلَوَٰتٞ مِّن رَّبِّهِمۡ وَرَحۡمَةٞۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُهۡتَدُونَ ٧٥١\n                                        \n                                        \n                                        \n                                        { أُولَئِكَ } الموصوفون بالصبر المذكور { عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ } أي: ثناء وتنويه بحالهم { وَرَحْمَةٌ } عظيمة، ومن رحمته إياهم, أن وفقهم للصبر الذي ينالون به كمال الأجر، { وَأُولَئِكَ هُمُ الْمُهْتَدُونَ } الذين عرفوا الحق, وهو في هذا الموضع, علمهم بأنهم لله, وأنهم إليه راجعون, وعملوا به وهو هنا صبرهم لله. ودلت هذه الآية, على أن من لم يصبر, فله ضد ما لهم, فحصل له الذم من الله, والعقوبة, والضلال والخسار، فما أعظم الفرق بين الفريقين وما أقل تعب الصابرين, وأعظم عناء الجازعين، فقد اشتملت هاتان الآيتان على توطين النفوس على المصائب قبل وقوعها, لتخف وتسهل, إذا وقعت، وبيان ما تقابل به, إذا وقعت, وهو الصبر، وبيان ما يعين على الصبر, وما للصابر من الأجر، ويعلم حال غير الصابر, بضد حال الصابر. وأن هذا الابتلاء والامتحان, سنة الله التي قد خلت, ولن تجد لسنة الله تبديلا، وبيان أنواع المصائب.\n                                    "
      },
      "originalText": "أُوْلَٰٓئِكَ عَلَيۡهِمۡ صَلَوَٰتٞ مِّن رَّبِّهِمۡ وَرَحۡمَةٞۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُهۡتَدُونَ ٧٥١"
    },
    {
      "number": 165,
      "text": "۞ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ ۖ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا ۚ وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 158,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلصَّفَا وَٱلۡمَرۡوَةَ مِن شَعَآئِرِ ٱللَّهِۖ فَمَنۡ حَجَّ ٱلۡبَيۡتَ أَوِ ٱعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ أَن يَطَّوَّفَ بِهِمَاۚ وَمَن تَطَوَّعَ خَيۡرٗا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ ٨٥١\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا سليمان بن داود الهاشمي ، أخبرنا إبراهيم بن سعد ، عن الزهري ، عن عروة ، عن عائشة قالت : قلت : أرأيت قول الله تعالى : ( إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما ) قلت : فوالله ما على أحد جناح أن لا يطوف بهما ؟ فقالت عائشة : بئسما قلت يا ابن أختي ، إنها لو كانت على ما أولتها عليه كانت : فلا جناح عليه ألا يطوف بهما ، ولكنها إنما أنزلت أن الأنصار كانوا قبل أن يسلموا كانوا يهلون لمناة الطاغية ، التي كانوا يعبدونها عند المشلل . وكان من أهل لها يتحرج أن يطوف بالصفا والمروة ، فسألوا عن ذلك رسول الله صلى الله عليه وسلم ، فقالوا : يا رسول الله ، إنا كنا نتحرج أن نطوف بالصفا والمروة في الجاهلية . فأنزل الله عز وجل : ( إن الصفا والمروة من شعائر الله ) إلى قوله : ( فلا جناح عليه أن يطوف بهما ) قالت عائشة : ثم قد سن رسول الله صلى الله عليه وسلم الطواف بهما ، فليس لأحد أن يدع الطواف بهما . أخرجاه في الصحيحين .\nوفي رواية عن الزهري أنه قال : فحدثت بهذا الحديث أبا بكر بن عبد الرحمن بن الحارث بن هشام ، فقال : إن هذا العلم ، ما كنت سمعته ، ولقد سمعت رجالا من أهل العلم يقولون : إن الناس إلا من ذكرت عائشة كانوا يقولون : إن طوافنا بين هذين الحجرين من أمر الجاهلية . وقال آخرون من الأنصار : إنما أمرنا بالطواف بالبيت ، ولم نؤمر بالطواف بين الصفا والمروة ، فأنزل الله تعالى : ( إن الصفا والمروة من شعائر الله ) قال أبو بكر بن عبد الرحمن : فلعلها نزلت في هؤلاء وهؤلاء .\nورواه البخاري من حديث مالك ، عن هشام بن عروة ، عن أبيه ، عن عائشة بنحو ما تقدم . ثم قال البخاري : حدثنا محمد بن يوسف ، حدثنا سفيان ، عن عاصم بن سليمان قال : سألت أنسا عن الصفا والمروة قال : كنا نرى ذلك من أمر الجاهلية ، فلما جاء الإسلام أمسكنا عنهما ، فأنزل الله عز وجل : ( إن الصفا والمروة من شعائر الله ) .\nوذكر القرطبي في تفسيره عن ابن عباس قال : كانت الشياطين تفرق بين الصفا والمروة الليل كله ، وكانت بينهما آلهة ، فلما جاء الإسلام سألوا رسول الله صلى الله عليه وسلم ، عن الطواف بينهما ، فنزلت هذه الآية . وقال الشعبي : كان إساف على الصفا ، وكانت نائلة على المروة ، وكانوا يستلمونهما فتحرجوا بعد الإسلام من الطواف بينهما ، فنزلت هذه الآية . قلت : وذكر ابن إسحاق في كتاب السيرة أن إسافا ونائلة كانا بشرين ، فزنيا داخل الكعبة فمسخا حجرين فنصبتهما قريش تجاه الكعبة ليعتبر بهما الناس ، فلما طال عهدهما عبدا ، ثم حولا إلى الصفا والمروة ، فنصبا هنالك ، فكان من طاف بالصفا والمروة يستلمهما ، ولهذا يقول أبو طالب ، في قصيدته المشهورة :\nوحيث ينيخ الأشعرون ركابهم بمفضى السيول من إساف ونائل\nوفي صحيح مسلم [ من ] حديث جابر الطويل ، وفيه : أن رسول الله صلى الله عليه وسلم لما فرغ من طوافه بالبيت ، عاد إلى الركن فاستلمه ، ثم خرج من باب الصفا ، وهو يقول : ( إن الصفا والمروة من شعائر الله ) ثم قال : \" أبدأ بما بدأ الله به \" . وفي رواية النسائي : \" ابدءوا بما بدأ الله به \" .\nوقال الإمام أحمد : حدثنا شريح ، حدثنا عبد الله بن المؤمل ، عن عطاء بن أبي رباح ، عن صفية بنت شيبة ، عن حبيبة بنت أبي تجراة قالت : رأيت رسول الله صلى الله عليه وسلم يطوف بين الصفا والمروة ، والناس بين يديه ، وهو وراءهم ، وهو يسعى حتى أرى ركبتيه من شدة السعي يدور به إزاره ، وهو يقول : \" اسعوا ، فإن الله كتب عليكم السعي \" .\nثم رواه الإمام أحمد ، عن عبد الرزاق ، أخبرنا معمر ، عن واصل مولى أبي عيينة عن موسى بن عبيدة عن صفية بنت شيبة ، أن امرأة أخبرتها أنها سمعت النبي صلى الله عليه وسلم بين الصفا والمروة يقول : \" كتب عليكم السعي ، فاسعوا \" .\nوقد استدل بهذا الحديث على مذهب من يرى أن السعي بين الصفا والمروة ركن في الحج ، كما هو مذهب الشافعي ، ومن وافقه [ ورواية عن أحمد وهو المشهور عن مالك ] . وقيل : إنه واجب ، وليس بركن [ فإن تركه عمدا أو سهوا جبره بدم وهو رواية عن أحمد وبه تقول طائفة وقيل : بل مستحب ، وإليه ذهب أبو حنيفة والثوري والشعبي وابن سيرين ، وروي عن أنس وابن عمر وابن عباس ، وحكي عن مالك في العتبية ، قال القرطبي : واحتجوا بقوله : ( فمن تطوع خيرا ) ] . وقيل : بل مستحب . والقول الأول أرجح ، لأنه عليه السلام طاف بينهما ، وقال : \" لتأخذوا عني مناسككم \" . فكل ما فعله في حجته تلك واجب لا بد من فعله في الحج ، إلا ما خرج بدليل ، والله أعلم [ وقد تقدم قوله عليه السلام : \" اسعوا فإن الله كتب عليكم السعي \" ] .\nفقد بين الله تعالى أن الطواف بين الصفا والمروة من شعائر الله ، أي : مما شرع الله تعالى لإبراهيم الخليل في مناسك الحج ، وقد تقدم في حديث ابن عباس أن أصل ذلك مأخوذ من تطواف هاجر وتردادها بين الصفا والمروة في طلب الماء لولدها ، لما نفد ماؤها وزادها ، حين تركهما إبراهيم عليه السلام هنالك ليس عندهما أحد من الناس ، فلما خافت الضيعة على ولدها هنالك ، ونفد ما عندها قامت تطلب الغوث من الله ، عز وجل ، فلم تزل تردد في هذه البقعة المشرفة بين الصفا والمروة متذللة خائفة وجلة مضطرة فقيرة إلى الله ، عز وجل ، حتى كشف الله كربتها ، وآنس غربتها ، وفرج شدتها ، وأنبع لها زمزم التي ماؤها طعام طعم ، وشفاء سقم ، فالساعي بينهما ينبغي له أن يستحضر فقره وذله وحاجته إلى الله في هداية قلبه وصلاح حاله وغفران ذنبه ، وأن يلتجئ إلى الله ، عز وجل ، ليزيح ما هو به من النقائص والعيوب ، وأن يهديه إلى الصراط المستقيم وأن يثبته عليه إلى مماته ، وأن يحوله من حاله الذي هو عليه من الذنوب والمعاصي ، إلى حال الكمال والغفران والسداد والاستقامة ، كما فعل بهاجر عليها السلام .\nوقوله : ( فمن تطوع خيرا ) قيل : زاد في طوافه بينهما على قدر الواجب ثامنة وتاسعة ونحو ذلك . وقيل : يطوف بينهما في حجة تطوع ، أو عمرة تطوع . وقيل : المراد تطوع خيرا في سائر العبادات . حكى ذلك [ فخر الدين ] الرازي ، وعزى الثالث إلى الحسن البصري ، والله أعلم . وقوله : ( فإن الله شاكر عليم ) أي : يثيب على القليل بالكثير ) عليم ) بقدر الجزاء فلا يبخس أحدا ثوابه و ( لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما ) [ النساء : 40 ] .\n                                    ",
        "qortoby": "إِنَّ ٱلصَّفَا وَٱلۡمَرۡوَةَ مِن شَعَآئِرِ ٱللَّهِۖ فَمَنۡ حَجَّ ٱلۡبَيۡتَ أَوِ ٱعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ أَن يَطَّوَّفَ بِهِمَاۚ وَمَن تَطَوَّعَ خَيۡرٗا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ ٨٥١\n                                    \n                                    \n                                    قوله تعالى : إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما ومن تطوع خيرا فإن الله شاكر عليم فيه تسع مسائل :\nالأولى : روى البخاري عن عاصم بن سليمان قال : سألت أنس بن مالك عن الصفا والمروة فقال : كنا نرى أنهما من أمر الجاهلية ، فلما كان الإسلام أمسكنا عنهما ، فأنزل الله عز وجل إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما وخرج الترمذي عن عروة قال : قلت لعائشة ما أرى على أحد لم يطف بين الصفا والمروة شيئا ، وما أبالي ألا أطوف بينهما . فقالت : بئس ما قلت يا ابن أختي ! طاف رسول الله صلى الله عليه وسلم وطاف المسلمون ، وإنما كان من أهل لمناة الطاغية التي بالمشلل لا يطوفون بين الصفا والمروة ، فأنزل الله تعالى : فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما ولو كانت كما تقول لكانت : \" فلا جناح عليه ألا يطوف بهما \" قال الزهري : فذكرت ذلك لأبي بكر بن عبد الرحمن بن الحارث بن هشام فأعجبه ذلك وقال : إن هذا لعلم ، ولقد سمعت رجالا من أهل العلم يقولون : إنما كان من لا يطوف بين الصفا والمروة من العرب يقولون إن طوافنا بين هذين الحجرين من أمر الجاهلية . وقال آخرون من الأنصار : إنما أمرنا بالطواف [ بالبيت ] ولم نؤمر به بين الصفا والمروة ، فأنزل الله تعالى : إن الصفا والمروة من شعائر الله قال أبو بكر بن عبد الرحمن : فأراها قد نزلت في هؤلاء وهؤلاء . قال : \" هذا حديث حسن صحيح \" . أخرجه البخاري بمعناه ، وفيه بعد قوله فأنزل الله تعالى إن الصفا والمروة من شعائر الله : قالت عائشة وقد سن رسول الله صلى الله عليه وسلم الطواف بينهما ، فليس لأحد أن يترك الطواف بينهما ، ثم أخبرت أبا بكر بن عبد الرحمن فقال : إن هذا لعلم ما كنت سمعته ، ولقد سمعت رجالا من أهل العلم يذكرون أن الناس - إلا من ذكرت عائشة - ممن كان يهل بمناة كانوا يطوفون كلهم بالصفا والمروة ، فلما ذكر الله تعالى الطواف بالبيت ولم يذكر الصفا والمروة في القرآن قالوا : يا رسول الله ، كنا نطوف بالصفا والمروة ، وإن الله أنزل الطواف بالبيت فلم يذكر الصفا ، فهل علينا من حرج أن نطوف بالصفا والمروة ؟ فأنزل الله عز وجل : إن الصفا والمروة من شعائر الله الآية . قال أبو بكر : فأسمع هذه الآية نزلت في الفريقين كليهما : في الذين كانوا يتحرجون أن يطوفوا في الجاهلية بالصفا والمروة ، والذين يطوفون ثم تحرجوا أن يطوفوا بهما في الإسلام ، من أجل أن الله تعالى أمر بالطواف بالبيت ، ولم يذكر الصفا حتى ذكر ذلك بعدما ذكر الطواف بالبيت \" . وروى الترمذي عن عاصم بن سليمان الأحول قال : سألت أنس بن مالك عن الصفا والمروة فقال : كانا من شعائر الجاهلية ، فلما كان الإسلام أمسكنا عنهما ، فأنزل الله عز وجل : إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما قال : هما تطوع ومن تطوع خيرا فإن الله شاكر عليم قال : هذا حديث حسن صحيح . خرجه البخاري أيضا . وعن ابن عباس قال كان في الجاهلية شياطين تعزف الليل كله بين الصفا والمروة وكان بينهما آلهة ، فلما ظهر الإسلام قال المسلمون : يا رسول الله ، لا نطوف بين الصفا والمروة فإنهما شرك ، فنزلت . وقال الشعبي : كان على الصفا في الجاهلية صنم يسمى \" إسافا \" وعلى المروة صنم يسمى \" نائلة \" فكانوا يمسحونهما إذا طافوا ، فامتنع المسلمون من الطواف بينهما من أجل ذلك ، فنزلت الآية .\nالثانية : أصل الصفا في اللغة الحجر الأملس ، وهو هنا جبل بمكة معروف ، وكذلك المروة جبل أيضا ، ولذلك أخرجهما بلفظ التعريف . وذكر الصفا لأن آدم المصطفى صلى الله عليه وسلم وقف عليه فسمي به ، ووقفت حواء على المروة فسميت باسم المرأة ، فأنث لذلك ، والله أعلم . وقال الشعبي : كان على الصفا صنم يسمى [ إسافا ] وعلى المروة صنم يدعى [ نائلة ] فاطرد ذلك في التذكير والتأنيث وقدم المذكر ، وهذا حسن ; لأن الأحاديث المذكورة تدل على هذا المعنى . وما كان كراهة من كره الطواف بينهما إلا من أجل هذا ، حتى رفع الله الحرج في ذلك . وزعم أهل الكتاب أنهما زنيا في الكعبة فمسخهما الله حجرين فوضعهما على الصفا والمروة ليعتبر بهما ، فلما طالت المدة عبدا من دون الله ، والله تعالى أعلم . والصفا ( مقصور ) : جمع صفاة ، وهي الحجارة الملس . وقيل : الصفا اسم مفرد ، وجمعه صفي ( بضم الصاد ) وأصفاء على مثل أرحاء . قال الراجز [ هو الأخيل ] :\nكأن متنيه من النفي مواقع الطير على الصفي\nوقيل : من شروط الصفا البياض والصلابة ، واشتقاقه من صفا يصفو ، أي خلص من التراب والطين . والمروة ( واحدة المرو ) وهي الحجارة الصغار التي فيها لين . وقد قيل إنها الصلاب . والصحيح أن المرو الحجارة صليبها ورخوها الذي يتشظى وترق حاشيته ، وفي هذا يقال : المرو أكثر ويقال في الصليب . قال الشاعر :\nوتولى الأرض خفا ذابلا فإذا ما صادف المرو رضخ\nوقال أبو ذؤيب :\nحتى كأن للحوادث مروة بصفا المشقر كل يوم تقرع\nوقد قيل : إنها الحجارة السود . وقيل : حجارة بيض براقة تكون فيها النار .\nالثالثة : من شعائر الله أي من معالمه ومواضع عباداته ، وهي جمع شعيرة . والشعائر : المتعبدات التي أشعرها الله تعالى ، أي جعلها أعلاما للناس ، من الموقف والسعي والنحر . والشعار : العلامة ، يقال : أشعر الهدي أعلمه بغرز حديدة في سنامه ، من قولك : أشعرت أي أعلمت ، وقال الكميت :\nنقتلهم جيلا فجيلا تراهم شعائر قربان بهم يتقرب\nالرابعة : قوله تعالى : فمن حج البيت أي قصد . وأصل الحج القصد ، قال الشاعر :\nفأشهد من عوف حلولا كثيرة يحجون سب الزبرقان المزعفرا\nالسب : لفظ مشترك . قال أبو عبيدة : السب ( بالكسر ) الكثير السباب . وسبك أيضا الذي يسابك ، قال الشاعر [ هو عبد الرحمن بن حسان ] :\nلا تسبنني فلست بسبي إن سبي من الرجال الكريم\nوالسب أيضا الخمار ، وكذلك العمامة ، قال المخبل السعدي :\nيحجون سب الزبرقان المزعفرا\nوالسب أيضا الحبل في لغة هذيل ، قال أبو ذؤيب :\nتدلى عليها بين سب وخيطة بجرداء مثل الوكف يكبو غرابها\nوالسبوب : الحبال . والسب : شقة كتان رقيقة ، والسبيبة مثله ، والجمع السبوب والسبائب ، قاله الجوهري . وحج الطبيب الشجة إذا سبرها بالميل ، قال الشاعر [ هو عذار بن درة الطائي ] :\nيحج مأمومة في قعرها لجف\nاللجف : الخسف . تلجفت البئر : انخسف أسفلها . ثم اختص هذا الاسم بالقصد إلى البيت الحرام لأفعال مخصوصة .\nالخامسة : قوله تعالى : أو اعتمر أي زار والعمرة : الزيارة ، قال الشاعر [ هو العجاج ] :\nلقد سما ابن معمر حين اعتمر مغزى بعيدا من بعيد وضبر\nالسادسة : قوله تعالى : فلا جناح عليه أي لا إثم . وأصله من الجنوح وهو الميل ، ومنه الجوانح للأعضاء لاعوجاجها . وقد تقدم تأويل عائشة لهذه الآية . قال ابن العربي : \" وتحقيق القول فيه أن قول القائل : لا جناح عليك أن تفعل ، إباحة الفعل . وقوله : لا جناح عليك ألا تفعل ، إباحة لترك الفعل ، فلما سمع عروة قول الله تعالى : فلا جناح عليه أن يطوف بهما قال : هذا دليل على أن ترك الطواف جائز ، ثم رأى الشريعة مطبقة على أن الطواف لا رخصة في تركه فطلب الجمع بين هذين المتعارضين . فقالت له عائشة : ليس قوله : فلا جناح عليه أن يطوف بهما دليلا على ترك الطواف ، إنما كان يكون دليلا على تركه لو كان \" فلا جناح عليه ألا يطوف بهما \" فلم يأت هذا اللفظ لإباحة ترك الطواف ، ولا فيه دليل عليه ، وإنما جاء لإفادة إباحة الطواف لمن كان يتحرج منه في الجاهلية ، أو لمن كان يطوف به في الجاهلية قصدا للأصنام التي كانت فيه ، فأعلمهم الله سبحانه أن الطواف ليس بمحظور إذا لم يقصد الطائف قصدا باطلا \" .\nفإن قيل : فقد روى عطاء عن ابن عباس أنه قرأ \" فلا جناح عليه ألا يطوف بهما \" وهي قراءة ابن مسعود ، ويروى أنها في مصحف أبي كذلك ، ويروى عن أنس مثل هذا . والجواب أن ذلك خلاف ما في المصحف ، ولا يترك ما قد ثبت في المصحف إلى قراءة لا يدرى أصحت أم لا ، وكان عطاء يكثر الإرسال عن ابن عباس من غير سماع . والرواية في هذا عن أنس قد قيل إنها ليست بالمضبوطة ، أو تكون \" لا \" زائدة للتوكيد ، كما قال :\nوما ألوم البيض ألا تسخرا لما رأين الشمط القفندرا\nالسابعة : روى الترمذي عن جابر أن النبي صلى الله عليه وسلم حين قدم مكة فطاف بالبيت سبعا فقرأ : واتخذوا من مقام إبراهيم مصلى وصلى خلف المقام ، ثم أتى الحجر فاستلمه ثم قال : ( نبدأ بما بدأ الله به ) فبدأ بالصفا وقال إن الصفا والمروة من شعائر الله قال : هذا حديث حسن صحيح ، والعمل على هذا عند أهل العلم أنه يبدأ بالصفا قبل المروة ، فإن بدأ بالمروة قبل الصفا لم يجزه ويبدأ بالصفا .\nالثامنة : واختلف العلماء في وجوب السعي بين الصفا والمروة ، فقال الشافعي وابن حنبل : هو ركن ، وهو المشهور من مذهب مالك ، لقوله عليه السلام : اسعوا فإن الله كتب عليكم السعي . خرجه الدارقطني . وكتب بمعنى أوجب ، لقوله تعالى : كتب عليكم الصيام وقوله عليه السلام : خمس صلوات كتبهن الله على العباد . وخرج ابن ماجه عن أم ولد لشيبة قالت : رأيت رسول الله صلى الله عليه وسلم يسعى بين الصفا والمروة وهو يقول : لا يقطع الأبطح إلا شدا فمن تركه أو شوطا منه ناسيا أو عامدا رجع من بلده أو من حيث ذكر إلى مكة فيطوف ويسعى ، لأن السعي لا يكون إلا متصلا بالطواف . وسواء عند مالك كان ذلك في حج أو عمرة وإن لم يكن في العمرة فرضا ، فإن كان قد أصاب النساء فعليه عمرة وهدي عند مالك مع تمام مناسكه . وقال الشافعي : عليه هدي ، ولا معنى للعمرة إذا رجع وطاف وسعى . وقال أبو حنيفة وأصحابه والثوري والشعبي : ليس بواجب ، فإن تركه أحد من الحاج حتى يرجع إلى بلاده جبره بالدم ; لأنه سنة من سنن الحج . وهو قول مالك في العتبية . وروي عن ابن عباس وابن الزبير وأنس بن مالك وابن سيرين أنه تطوع ، لقوله تعالى : ومن تطوع خيرا . وقرأ حمزة والكسائي \" يطوع \" مضارع مجزوم ، وكذلك فمن تطوع خيرا فهو خير له الباقون تطوع ماض ، وهو ما يأتيه المؤمن من قبل نفسه فمن أتى بشيء من النوافل فإن الله يشكره . وشكر الله للعبد إثابته على الطاعة . والصحيح ما ذهب إليه الشافعي رحمه الله تعالى لما ذكرنا ، وقوله عليه السلام : خذوا عني مناسككم فصار بيانا لمجمل الحج ، فالواجب أن يكون فرضا ، كبيانه لعدد الركعات ، وما كان مثل ذلك إذا لم يتفق على أنه سنة أو تطوع .\nوقال طليب : رأى ابن عباس قوما يطوفون بين الصفا والمروة فقال : هذا ما أورثتكم أمكم أم إسماعيل .\nقلت : وهذا ثابت في صحيح البخاري على ما يأتي بيانه في سورة \" إبراهيم \" .\nالتاسعة : ولا يجوز أن يطوف أحد بالبيت ولا بين الصفا والمروة راكبا إلا من عذر ، فإن طاف معذورا فعليه دم ، وإن طاف غير معذور أعاد إن كان بحضرة البيت ، وإن غاب عنه أهدى . إنما قلنا ذلك لأن النبي صلى الله عليه وسلم طاف بنفسه وقال : خذوا عني مناسككم . وإنما جوزنا ذلك من العذر ; لأن النبي صلى الله عليه وسلم طاف على بعيره واستلم الركن بمحجنه وقال لعائشة وقد قالت له : إني أشتكي ، فقال : طوفي من وراء الناس وأنت راكبة . وفرق أصحابنا بين أن يطوف على بعير أو يطوف على ظهر إنسان ، فإن طاف على ظهر إنسان لم يجزه ; لأنه حينئذ لا يكون طائفا ، وإنما الطائف الحامل . وإذا طاف على بعير يكون هو الطائف . قال ابن خويز منداد : وهذه تفرقة اختيار ، وأما الإجزاء فيجزئ ، ألا ترى أنه لو أغمي عليه فطيف به محمولا ، أو وقف به بعرفات محمولا كان مجزئا عنه .\n                                    ",
        "saadi": "إِنَّ ٱلصَّفَا وَٱلۡمَرۡوَةَ مِن شَعَآئِرِ ٱللَّهِۖ فَمَنۡ حَجَّ ٱلۡبَيۡتَ أَوِ ٱعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ أَن يَطَّوَّفَ بِهِمَاۚ وَمَن تَطَوَّعَ خَيۡرٗا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ ٨٥١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أن الصفا والمروة وهما معروفان { مِنْ شَعَائِرِ اللَّهِ } أي أعلام دينه الظاهرة, التي تعبد الله بها عباده, وإذا كانا من شعائر الله, فقد أمر الله بتعظيم شعائره فقال: { وَمَنْ يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ } فدل مجموع النصين أنهما من شعائر الله, وأن تعظيم شعائره, من تقوى القلوب. والتقوى واجبة على كل مكلف, وذلك يدل على أن السعي بهما فرض لازم للحج والعمرة, كما عليه الجمهور, ودلت عليه الأحاديث النبوية وفعله النبي صلى الله عليه وسلم وقال: \" خذوا عني مناسككم \" { فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا } هذا دفع لوهم من توهم وتحرج من المسلمين عن الطواف بينهما, لكونهما في الجاهلية تعبد عندهما الأصنام، فنفى تعالى الجناح لدفع هذا الوهم, لا لأنه غير لازم. ودل تقييد نفي الجناح فيمن تطوف بهما في الحج والعمرة, أنه لا يتطوع بالسعي مفردا إلا مع انضمامه لحج أو عمرة، بخلاف الطواف بالبيت, فإنه يشرع مع العمرة والحج, وهو عبادة مفردة. فأما السعي والوقوف بعرفة ومزدلفة, ورمي الجمار فإنها تتبع النسك، فلو فعلت غير تابعة للنسك, كانت بدعة, لأن البدعة نوعان: نوع يتعبد لله بعبادة, لم يشرعها أصلا، ونوع يتعبد له بعبادة قد شرعها على صفة مخصوصة, فتفعل على غير تلك الصفة, وهذا منه. وقوله: { وَمَنْ تَطَوَّعَ } أي: فعل طاعة مخلصا بها لله تعالى { خَيْرًا } من حج وعمرة, وطواف, وصلاة, وصوم وغير ذلك { فَهُوَ خَيْرٌ لَهُ } فدل هذا, على أنه كلما ازداد العبد من طاعة الله, ازداد خيره وكماله, ودرجته عند الله, لزيادة إيمانه. ودل تقييد التطوع بالخير, أن من تطوع بالبدع, التي لم يشرعها الله ولا رسوله, أنه لا يحصل له إلا العناء, وليس بخير له, بل قد يكون شرا له إن كان متعمدا عالما بعدم مشروعية العمل. { فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ } الشاكر والشكور, من أسماء الله تعالى, الذي يقبل من عباده اليسير من العمل, ويجازيهم عليه, العظيم من الأجر, الذي إذا قام عبده بأوامره, وامتثل طاعته, أعانه على ذلك, وأثنى عليه ومدحه, وجازاه في قلبه نورا وإيمانا, وسعة, وفي بدنه قوة ونشاطا, وفي جميع أحواله زيادة بركة ونماء, وفي أعماله زيادة توفيق. ثم بعد ذلك, يقدم على الثواب الآجل عند ربه كاملا موفرا, لم تنقصه هذه الأمور. ومن شكره لعبده, أن من ترك شيئا لله, أعاضه الله خيرا منه، ومن تقرب منه شبرا, تقرب منه ذراعا, ومن تقرب منه ذراعا, تقرب منه باعا, ومن أتاه يمشي, أتاه هرولة, ومن عامله, ربح عليه أضعافا مضاعفة. ومع أنه شاكر, فهو عليم بمن يستحق الثواب الكامل, بحسب نيته وإيمانه وتقواه, ممن ليس كذلك، عليم بأعمال العباد, فلا يضيعها, بل يجدونها أوفر ما كانت, على حسب نياتهم التي اطلع عليها العليم الحكيم.\n                                    "
      },
      "originalText": "۞ إِنَّ ٱلصَّفَا وَٱلۡمَرۡوَةَ مِن شَعَآئِرِ ٱللَّهِۖ فَمَنۡ حَجَّ ٱلۡبَيۡتَ أَوِ ٱعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ أَن يَطَّوَّفَ بِهِمَاۚ وَمَن تَطَوَّعَ خَيۡرٗا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ ٨٥١"
    },
    {
      "number": 166,
      "text": "إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلْنَا مِنَ الْبَيِّنَاتِ وَالْهُدَىٰ مِنْ بَعْدِ مَا بَيَّنَّاهُ لِلنَّاسِ فِي الْكِتَابِ ۙ أُولَٰئِكَ يَلْعَنُهُمُ اللَّهُ وَيَلْعَنُهُمُ اللَّاعِنُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 159,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلۡنَا مِنَ ٱلۡبَيِّنَٰتِ وَٱلۡهُدَىٰ مِنۢ بَعۡدِ مَا بَيَّنَّٰهُ لِلنَّاسِ فِي ٱلۡكِتَٰبِ أُوْلَٰٓئِكَ يَلۡعَنُهُمُ ٱللَّهُ وَيَلۡعَنُهُمُ ٱللَّٰعِنُونَ ٩٥١\n                                    \n                                    \n                                    هذا وعيد شديد لمن كتم ما جاءت به الرسل من الدلالات البينة على المقاصد الصحيحة والهدى النافع للقلوب ، من بعد ما بينه الله تعالى لعباده في كتبه ، التي أنزلها على رسله .\nقال أبو العالية : نزلت في أهل الكتاب ، كتموا صفة محمد صلى الله عليه وسلم ثم أخبر أنهم يلعنهم كل شيء على صنيعهم ذلك ، فكما أن العالم يستغفر له كل شيء ، حتى الحوت في الماء والطير في الهواء ، فهؤلاء بخلاف العلماء [ الذين يكتمون ] فيلعنهم الله ويلعنهم اللاعنون . وقد ورد في الحديث المسند من طرق يشد بعضها بعضا ، عن أبي هريرة ، وغيره : أن رسول الله صلى الله عليه وسلم قال : \" من سئل عن علم فكتمه ، ألجم يوم القيامة بلجام من نار \" . والذي في الصحيح عن أبي هريرة أنه قال : لولا آية في كتاب الله ما حدثت أحدا شيئا : ( إن الذين يكتمون ما أنزلنا من البينات والهدى ) الآية .\nوقال ابن أبي حاتم : حدثنا الحسن بن عرفة ، حدثنا عمار بن محمد ، عن ليث بن أبي سليم ،\nعن المنهال بن عمرو ، عن زاذان أبي عمر عن البراء بن عازب ، قال : كنا مع النبي صلى الله عليه وسلم في جنازة ، فقال : \" إن الكافر يضرب ضربة بين عينيه ، فيسمع كل دابة غير الثقلين ، فتلعنه كل دابة سمعت صوته ، فذلك قول الله تعالى : ( أولئك يلعنهم الله ويلعنهم اللاعنون ) يعني : دواب الأرض \" .\n[ ورواه ابن ماجه عن محمد بن الصباح عن عمار بن محمد به ] .\nوقال عطاء بن أبي رباح : كل دابة والجن والإنس . وقال مجاهد : إذا أجدبت الأرض قالت البهائم : هذا من أجل عصاة بني آدم ، لعن الله عصاة بني آدم .\nوقال أبو العالية ، والربيع بن أنس ، وقتادة ( ويلعنهم اللاعنون ) يعني تلعنهم ملائكة الله ، والمؤمنون .\n[ وقد جاء في الحديث ، أن العالم يستغفر له كل شيء حتى الحيتان ، وجاء في هذه الآية : أن كاتم العلم يلعنه الله والملائكة والناس أجمعون ، واللاعنون أيضا ، وهم كل فصيح وأعجمي إما بلسان المقال ، أو الحال ، أو لو كان له عقل ، أو يوم القيامة ، والله أعلم ] .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلۡنَا مِنَ ٱلۡبَيِّنَٰتِ وَٱلۡهُدَىٰ مِنۢ بَعۡدِ مَا بَيَّنَّٰهُ لِلنَّاسِ فِي ٱلۡكِتَٰبِ أُوْلَٰٓئِكَ يَلۡعَنُهُمُ ٱللَّهُ وَيَلۡعَنُهُمُ ٱللَّٰعِنُونَ ٩٥١\n                                    \n                                    \n                                    قوله تعالى : إن الذين يكتمون ما أنزلنا من البينات والهدى من بعد ما بيناه للناس في الكتاب أولئك يلعنهم الله ويلعنهم اللاعنون\nوفيه سبع مسائل :\nالأولى : أخبر الله تعالى أن الذي يكتم ما أنزل من البينات والهدى ملعون . واختلفوا من المراد بذلك ، فقيل : أحبار اليهود ورهبان النصارى الذين كتموا أمر محمد صلى الله عليه وسلم ، وقد كتم اليهود أمر الرجم . وقيل : المراد كل من كتم الحق ، فهي عامة في كل من كتم علما من دين الله يحتاج إلى بثه ، وذلك مفسر في قوله صلى الله عليه وسلم : من سئل عن علم يعلمه فكتمه ألجمه الله يوم القيامة بلجام من نار . رواه أبو هريرة وعمرو بن العاص أخرجه ابن ماجه . ويعارضه قول عبد الله بن مسعود : ما أنت بمحدث قوما حديثا لا تبلغه عقولهم إلا كان لبعضهم فتنة . وقال عليه السلام : حدث الناس بما يفهمون أتحبون أن يكذب الله ورسوله . وهذا محمول على بعض العلوم ، كعلم الكلام أو ما لا يستوي في فهمه جميع العوام ، فحكم العالم أن يحدث بما يفهم عنه ، وينزل كل إنسان منزلته ، والله تعالى أعلم .\nالثانية : هذه الآية هي التي أراد أبو هريرة رضي الله عنه في قوله : لولا آية في كتاب الله تعالى ما حدثتكم حديثا . وبها استدل العلماء على وجوب تبليغ العلم الحق ، وتبيان العلم على الجملة ، دون أخذ الأجرة عليه ، إذ لا يستحق الأجرة على ما عليه فعله ، كما لا يستحق الأجرة على الإسلام ، وقد مضى القول في هذا .\nوتحقيق الآية هو : أن العالم إذا قصد كتمان العلم عصى ، وإذا لم يقصده لم يلزمه التبليغ إذا عرف أنه مع غيره . وأما من سئل فقد وجب عليه التبليغ لهذه الآية وللحديث . أما أنه لا يجوز تعليم الكافر القرآن والعلم حتى يسلم ، وكذلك لا يجوز تعليم المبتدع الجدال والحجاج ليجادل به أهل الحق ، ولا يعلم الخصم على خصمه حجة يقطع بها ماله ، ولا السلطان تأويلا يتطرق به إلى مكاره الرعية ، ولا ينشر الرخص في السفهاء فيجعلوا ذلك طريقا إلى ارتكاب المحظورات ، وترك الواجبات ونحو ذلك . يروى عن النبي صلى الله عليه وسلم أنه قال : لا تمنعوا الحكمة أهلها فتظلموهم ولا تضعوها في غير أهلها فتظلموها . وروي عنه صلى الله عليه وسلم أنه قال : لا تعلقوا الدر في أعناق الخنازير ، يريد تعليم الفقه من ليس من أهله . وقد قال سحنون : إن حديث أبي هريرة وعمرو بن العاص إنما جاء في الشهادة . قال ابن العربي : والصحيح خلافه ; لأن في الحديث ( من سئل عن علم ) ولم يقل عن شهادة ، والبقاء على الظاهر حتى يرد عليه ما يزيله ، والله أعلم .\nالثالثة : قوله تعالى : من البينات والهدى يعم المنصوص عليه والمستنبط ، لشمول اسم الهدى للجميع . وفيه دليل على وجوب العمل بقول الواحد ; لأنه لا يجب عليه البيان إلا وقد وجب قبول قوله ، وقال : إلا الذين تابوا وأصلحوا وبينوا فحكم بوقوع البيان بخبرهم .\nفإن قيل : إنه يجوز أن يكون كل واحد منهم منهيا عن الكتمان ومأمورا بالبيان ليكثر المخبرون ويتواتر بهم الخبر . قلنا : هذا غلط ; لأنهم لم ينهوا عن الكتمان إلا وهم ممن يجوز عليهم التواطؤ عليه ، ومن جاز منهم التواطؤ على الكتمان فلا يكون خبرهم موجبا للعلم ، والله تعالى أعلم .\nالرابعة : لما قال : من البينات والهدى دل على أن ما كان من غير ذلك جائز كتمه ، لا سيما إن كان مع ذلك خوف فإن ذلك آكد في الكتمان . وقد ترك أبو هريرة ذلك حين خاف فقال : حفظت عن رسول الله صلى الله عليه وسلم وعاءين ، فأما أحدهما فبثثته ، وأما الآخر فلو بثثته قطع هذا البلعوم . أخرجه البخاري . قال أبو عبد الله : البلعوم مجرى الطعام . قال علماؤنا : وهذا الذي لم يبثه أبو هريرة وخاف على نفسه فيه الفتنة أو القتل إنما هو مما يتعلق بأمر الفتن والنص على أعيان المرتدين والمنافقين ، ونحو هذا مما لا يتعلق بالبينات والهدى ، والله تعالى أعلم .\nالخامسة : قوله تعالى : من بعد ما بيناه الكناية في بيناه ترجع إلى ما أنزل من البينات والهدى . والكتاب : اسم جنس ، فالمراد جميع الكتب المنزلة .\nالسادسة : قوله تعالى : أولئك يلعنهم الله أي يتبرأ منهم ويبعدهم من ثوابه ويقول لهم : عليكم لعنتي ، كما قال للعين : وإن عليك لعنتي . وأصل اللعن في اللغة الإبعاد والطرد ، وقد تقدم .\nالسابعة : قوله تعالى : ويلعنهم اللاعنون قال قتادة والربيع : المراد ب اللاعنون الملائكة والمؤمنون . قال ابن عطية : وهذا واضح جار على مقتضى الكلام . وقال مجاهد وعكرمة : هم الحشرات والبهائم يصيبهم الجدب بذنوب علماء السوء الكاتمين فيلعنونهم . قال الزجاج : والصواب قول من قال : اللاعنون الملائكة والمؤمنون ، فأما أن يكون ذلك لدواب الأرض فلا يوقف على حقيقته إلا بنص أو خبر لازم ولم نجد من ذينك شيئا .\nقلت : قد جاء بذلك خبر رواه البراء بن عازب رضي الله عنه قال قال رسول الله صلى الله عليه وسلم في قوله تعالى : يلعنهم الله ويلعنهم اللاعنون قال : ( دواب الأرض ) . أخرجه ابن ماجه عن محمد بن الصباح أنبأنا عمار بن محمد عن ليث عن أبي المنهال عن زاذان عن البراء إسناد حسن .\nفإن قيل : كيف جمع من لا يعقل جمع من يعقل ؟ قيل : لأنه أسند إليهم فعل من يعقل ، كما قال : رأيتهم لي ساجدين ولم يقل ساجدات ، وقد قال : لم شهدتم علينا ، وقال : وتراهم ينظرون إليك ، ومثله كثير ، وسيأتي إن شاء الله تعالى . وقال البراء بن عازب وابن عباس : اللاعنون كل المخلوقات ما عدا الثقلين : الجن والإنس ، وذلك أن النبي صلى الله عليه وسلم قال : الكافر إذا ضرب في قبره فصاح سمعه الكل إلا الثقلين ولعنه كل سامع . وقال ابن مسعود والسدي : ( هو الرجل يلعن صاحبه فترتفع اللعنة إلى السماء ثم تنحدر فلا تجد صاحبها الذي قيلت فيه أهلا لذلك ، فترجع إلى الذي تكلم بها فلا تجده أهلا فتنطلق فتقع على اليهود الذين كتموا ما أنزل الله تعالى ، فهو قوله : ويلعنهم اللاعنون فمن مات منهم ارتفعت اللعنة عنه فكانت فيمن بقي من اليهود ) .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلۡنَا مِنَ ٱلۡبَيِّنَٰتِ وَٱلۡهُدَىٰ مِنۢ بَعۡدِ مَا بَيَّنَّٰهُ لِلنَّاسِ فِي ٱلۡكِتَٰبِ أُوْلَٰٓئِكَ يَلۡعَنُهُمُ ٱللَّهُ وَيَلۡعَنُهُمُ ٱللَّٰعِنُونَ ٩٥١\n                                        \n                                        \n                                        \n                                        هذه الآية وإن كانت نازلة في أهل الكتاب, وما كتموا من شأن الرسول صلى الله عليه وسلم وصفاته, فإن حكمها عام لكل من اتصف بكتمان ما أنزل الله { مِنَ الْبَيِّنَاتِ } الدالات على الحق المظهرات له، { وَالْهُدَى } وهو العلم الذي تحصل به الهداية إلى الصراط المستقيم, ويتبين به طريق أهل النعيم, من طريق أهل الجحيم، فإن الله أخذ الميثاق على أهل العلم, بأن يبينوا الناس ما منّ الله به عليهم من علم الكتاب ولا يكتموه، فمن نبذ ذلك وجمع بين المفسدتين, كتم ما أنزل الله, والغش لعباد الله، فأولئك { يَلْعَنُهُمُ اللَّهُ } أي: يبعدهم ويطردهم عن قربه ورحمته. { وَيَلْعَنُهُمُ اللَّاعِنُونَ } وهم جميع الخليقة, فتقع عليهم اللعنة من جميع الخليقة, لسعيهم في غش الخلق وفساد أديانهم, وإبعادهم من رحمة الله, فجوزوا من جنس عملهم، كما أن معلم الناس الخير, يصلي الله عليه وملائكته, حتى الحوت في جوف الماء, لسعيه في مصلحة الخلق, وإصلاح أديانهم, وقربهم من رحمة الله, فجوزي من جنس عمله، فالكاتم لما أنزل الله, مضاد لأمر الله, مشاق لله, يبين الله الآيات للناس ويوضحها، وهذا يطمسها فهذا عليه هذا الوعيد الشديد.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلۡنَا مِنَ ٱلۡبَيِّنَٰتِ وَٱلۡهُدَىٰ مِنۢ بَعۡدِ مَا بَيَّنَّٰهُ لِلنَّاسِ فِي ٱلۡكِتَٰبِ أُوْلَٰٓئِكَ يَلۡعَنُهُمُ ٱللَّهُ وَيَلۡعَنُهُمُ ٱللَّٰعِنُونَ ٩٥١"
    },
    {
      "number": 167,
      "text": "إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَبَيَّنُوا فَأُولَٰئِكَ أَتُوبُ عَلَيْهِمْ ۚ وَأَنَا التَّوَّابُ الرَّحِيمُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 160,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَبَيَّنُواْ فَأُوْلَٰٓئِكَ أَتُوبُ عَلَيۡهِمۡ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ ٠٦١\n                                    \n                                    \n                                    ثم استثنى الله تعالى من هؤلاء من تاب إليه فقال : ( إلا الذين تابوا وأصلحوا وبينوا ) أي : رجعوا عما كانوا فيه وأصلحوا أعمالهم وأحوالهم وبينوا للناس ما كانوا كتموه ( فأولئك أتوب عليهم وأنا التواب الرحيم ) وفي هذا دلالة على أن الداعية إلى كفر ، أو بدعة إذا تاب إلى الله تاب الله عليه .\nوقد ورد أن الأمم السابقة لم تكن التوبة تقبل من مثل هؤلاء منهم ، ولكن هذا من شريعة نبي التوبة ونبي الرحمة صلوات الله وسلامه عليه .\nثم أخبر تعالى عمن كفر به واستمر به الحال إلى مماته بأن ( عليهم لعنة الله والملائكة والناس أجمعين خالدين فيها ) أي : في اللعنة التابعة لهم إلى يوم القيامة ثم المصاحبة لهم في نار جهنم التي ( لا يخفف عنهم العذاب ) فيها ، أي : لا ينقص عما هم فيه ( ولا هم ينظرون ) أي : لا يغير عنهم ساعة واحدة ، ولا يفتر ، بل هو متواصل دائم ، فنعوذ بالله من ذلك .\nوقال أبو العالية وقتادة : إن الكافر يوقف يوم القيامة فيلعنه الله ، ثم تلعنه الملائكة ، ثم يلعنه الناس أجمعون .\n                                    ",
        "qortoby": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَبَيَّنُواْ فَأُوْلَٰٓئِكَ أَتُوبُ عَلَيۡهِمۡ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ ٠٦١\n                                    \n                                    \n                                    قوله تعالى : إلا الذين تابوا وأصلحوا وبينوا فأولئك أتوب عليهم وأنا التواب الرحيم\nقوله تعالى : إلا الذين تابوا استثنى تعالى التائبين الصالحين لأعمالهم وأقوالهم المنيبين لتوبتهم . ولا يكفي في التوبة عند علمائنا قول القائل : قد تبت ، حتى يظهر منه في الثاني خلاف الأول ، فإن كان مرتدا رجع إلى الإسلام مظهرا شرائعه ، وإن كان من أهل المعاصي ظهر منه العمل الصالح ، وجانب أهل الفساد والأحوال التي كان عليها ، وإن كان من أهل الأوثان جانبهم وخالط أهل الإسلام ، وهكذا يظهر عكس ما كان عليه . وسيأتي بيان التوبة وأحكامها في \" النساء \" إن شاء الله تعالى .\nوقال بعض العلماء في قوله : وبينوا أي بكسر الخمر وإراقتها . وقيل : بينوا يعني ما في التوراة من نبوة محمد صلى الله عليه وسلم ووجوب اتباعه . والعموم أولى على ما بيناه ، أي بينوا خلاف ما كانوا عليه ، والله تعالى أعلم . فأولئك أتوب عليهم وأنا التواب الرحيم تقدم والحمد لله .\n                                    ",
        "saadi": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَبَيَّنُواْ فَأُوْلَٰٓئِكَ أَتُوبُ عَلَيۡهِمۡ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ ٠٦١\n                                        \n                                        \n                                        \n                                        { إِلَّا الَّذِينَ تَابُوا } أي رجعوا عما هم عليه من الذنوب, ندما وإقلاعا, وعزما على عدم المعاودة { وَأَصْلَحُوا } ما فسد من أعمالهم، فلا يكفي ترك القبيح حتى يحصل فعل الحسن. ولا يكفي ذلك في الكاتم أيضا, حتى يبين ما كتمه, ويبدي ضد ما أخفى، فهذا يتوب الله عليه, لأن توبة الله غير محجوب عنها، فمن أتى بسبب التوبة, تاب الله عليه, لأنه { التَّوَّابُ } أي: الرجاع على عباده بالعفو والصفح, بعد الذنب إذا تابوا, وبالإحسان والنعم بعد المنع, إذا رجعوا، { الرَّحِيمُ } الذي اتصف بالرحمة العظيمة, التي وسعت كل شيء ومن رحمته أن وفقهم للتوبة والإنابة فتابوا وأنابوا, ثم رحمهم بأن قبل ذلك منهم, لطفا وكرما, هذا حكم التائب من الذنب.\n                                    "
      },
      "originalText": "إِلَّا ٱلَّذِينَ تَابُواْ وَأَصۡلَحُواْ وَبَيَّنُواْ فَأُوْلَٰٓئِكَ أَتُوبُ عَلَيۡهِمۡ وَأَنَا ٱلتَّوَّابُ ٱلرَّحِيمُ ٠٦١"
    },
    {
      "number": 168,
      "text": "إِنَّ الَّذِينَ كَفَرُوا وَمَاتُوا وَهُمْ كُفَّارٌ أُولَٰئِكَ عَلَيْهِمْ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 161,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ كَفَرُواْ وَمَاتُواْ وَهُمۡ كُفَّارٌ أُوْلَٰٓئِكَ عَلَيۡهِمۡ لَعۡنَةُ ٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ وَٱلنَّاسِ أَجۡمَعِينَ ١٦١\n                                    \n                                    \n                                    فصل : لا خلاف في جواز لعن الكفار ، وقد كان عمر بن الخطاب ، رضي الله عنه ، وعمن بعده من الأئمة ، يلعنون الكفرة في القنوت وغيره ; فأما الكافر المعين ، فقد ذهب جماعة من العلماء إلى أنه لا يلعن لأنا لا ندري بما يختم له ، واستدل بعضهم بهذه الآية : ( إن الذين كفروا وماتوا وهم كفار أولئك عليهم لعنة الله والملائكة والناس أجمعين ) وقالت طائفة أخرى : بل يجوز لعن الكافر المعين . واختار ذلك الفقيه أبو بكر بن العربي المالكي ، ولكنه احتج بحديث فيه ضعف ، واستدل غيره بقوله ، عليه السلام ، في صحيح البخاري في قصة الذي كان يؤتى به سكران فيحده ، فقال رجل : لعنه الله ، ما أكثر ما يؤتى به ، فقال رسول الله صلى الله عليه وسلم : \" لا تلعنه فإنه يحب الله ورسوله \" قالوا : فعلة المنع من لعنه ; بأنه يحب الله ورسوله فدل على أن من لا يحب الله ورسوله يلعن ، والله أعلم .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ كَفَرُواْ وَمَاتُواْ وَهُمۡ كُفَّارٌ أُوْلَٰٓئِكَ عَلَيۡهِمۡ لَعۡنَةُ ٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ وَٱلنَّاسِ أَجۡمَعِينَ ١٦١\n                                    \n                                    \n                                    قوله تعالى : إن الذين كفروا وماتوا وهم كفار أولئك عليهم لعنة الله والملائكة والناس أجمعين\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : وهم كفار الواو واو الحال . قال ابن العربي : قال لي كثير من أشياخي إن الكافر المعين لا يجوز لعنه ; لأن حاله عند الموافاة لا تعلم ، وقد شرط الله تعالى في هذه الآية في إطلاق اللعنة : الموافاة على الكفر ، وأما ما روي عن النبي صلى الله عليه وسلم أنه لعن أقواما بأعيانهم من الكفار فإنما كان ذلك لعلمه بمآلهم . قال ابن العربي : والصحيح عندي جواز لعنه لظاهر حاله ولجواز قتله وقتاله ، وقد روي عن النبي صلى الله عليه وسلم أنه قال : اللهم إن عمرو بن العاص هجاني وقد علم أني لست بشاعر فالعنه واهجه عدد ما هجاني . فلعنه ، وإن كان الإيمان والدين والإسلام مآله . وانتصف بقوله : ( عدد ما هجاني ) ولم يزد ليعلم العدل والإنصاف . وأضاف الهجو إلى الله تعالى في باب الجزاء دون الابتداء بالوصف بذلك ، كما يضاف إليه المكر والاستهزاء والخديعة ، سبحانه وتعالى عما يقول الظالمون علوا كبيرا .\nقلت : أما لعن الكفار جملة من غير تعيين فلا خلاف في ذلك ، لما رواه مالك عن داود بن الحصين أنه سمع الأعرج يقول : ما أدركت الناس إلا وهم يلعنون الكفرة في رمضان . قال علماؤنا : وسواء كانت لهم ذمة أم لم تكن ، وليس ذلك بواجب ، ولكنه مباح لمن فعله ، لجحدهم الحق وعداوتهم للدين وأهله ، وكذلك كل من جاهر بالمعاصي كشراب الخمر وأكلة الربا ، ومن تشبه من النساء بالرجال ومن الرجال بالنساء ، إلى غير ذلك مما ورد في الأحاديث لعنه .\nالثانية : ليس لعن الكافر بطريق الزجر له عن الكفر ، بل هو جزاء على الكفر وإظهار قبح كفره ، كان الكافر ميتا أو مجنونا . وقال قوم من السلف : إنه لا فائدة في لعن من جن أو مات منهم ، لا بطريق الجزاء ولا بطريق الزجر ، فإنه لا يتأثر به .\nوالمراد بالآية على هذا المعنى أن الناس يلعنونه يوم القيامة ليتأثر بذلك ويتضرر ويتألم قلبه ، فيكون ذلك جزاء على كفره ، كما قال تعالى : ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ، ويدل على هذا القول أن الآية دالة على الإخبار عن الله تعالى بلعنهم ، لا على الأمر . وذكر ابن العربي أن لعن العاصي المعين لا يجوز اتفاقا ، لما روي عن النبي أنه أتي بشارب خمر مرارا ، فقال بعض من حضره : لعنه الله ، ما أكثر ما يؤتى به ، فقال النبي صلى الله عليه وسلم : لا تكونوا عون الشيطان على أخيكم فجعل له حرمة الأخوة ، وهذا يوجب الشفقة ، وهذا حديث صحيح .\nقلت : خرجه البخاري ومسلم ، وقد ذكر بعض العلماء خلافا في لعن العاصي المعين ، قال : وإنما قال عليه السلام : لا تكونوا عون الشيطان على أخيكم في حق نعيمان بعد إقامة الحد عليه ، ومن أقيم عليه حد الله تعالى فلا ينبغي لعنه ، ومن لم يقم عليه الحد فلعنته جائزة سواء سمي أو عين أم لا ; لأن النبي صلى الله عليه وسلم لا يلعن إلا من تجب عليه اللعنة ما دام على تلك الحالة الموجبة للعن ، فإذا تاب منها وأقلع وطهره الحد فلا لعنة تتوجه عليه . وبين هذا قوله صلى الله عليه وسلم : إذا زنت أمة أحدكم فليجلدها الحد ولا يثرب . فدل هذا الحديث مع صحته على أن التثريب واللعن إنما يكون قبل أخذ الحد وقبل التوبة ، والله تعالى أعلم .\nقال ابن العربي : وأما لعن العاصي مطلقا فيجوز إجماعا ، لما روي عن النبي صلى الله عليه وسلم أنه قال : لعن الله السارق يسرق البيضة فتقطع يده .\nالثالثة : قوله تعالى : أولئك عليهم لعنة الله والملائكة والناس أجمعين أي إبعادهم من رحمته . وأصل اللعن الطرد والإبعاد ، وقد تقدم . فاللعنة من العباد الطرد . ومن الله العذاب . وقرأ الحسن البصري : ( والملائكة والناس أجمعون ) بالرفع . وتأويلها : أولئك جزاؤهم أن يلعنهم الله ويلعنهم الملائكة ويلعنهم الناس أجمعون ، كما تقول : كرهت قيام زيد وعمرو وخالد ; لأن المعنى : كرهت أن قام زيد . وقراءة الحسن هذه مخالفة للمصاحف .\nفإن قيل : ليس يلعنهم جميع الناس لأن قومهم لا يلعنونهم ; قيل عن هذا ثلاثة أجوبة ; أحدها : أن اللعنة من أكثر الناس يطلق عليها لعنة الناس تغليبا لحكم الأكثر على الأقل . الثاني : قال السدي : كل أحد يلعن الظالم ، وإذا لعن الكافر الظالم فقد لعن نفسه . الثالث : قال أبو العالية : المراد به يوم القيامة يلعنهم قومهم مع جميع الناس ; كما قال تعالى : ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ كَفَرُواْ وَمَاتُواْ وَهُمۡ كُفَّارٌ أُوْلَٰٓئِكَ عَلَيۡهِمۡ لَعۡنَةُ ٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ وَٱلنَّاسِ أَجۡمَعِينَ ١٦١\n                                        \n                                        \n                                        \n                                        وأما من كفر واستمر على كفره حتى مات ولم يرجع إلى ربه, ولم ينب إليه, ولم يتب عن قريب فأولئك { عَلَيْهِمْ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ } لأنه لما صار كفرهم وصفا ثابتا, صارت اللعنة عليهم وصفا ثابتا لا تزول, لأن الحكم يدور مع علته, وجودا وعدما.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ كَفَرُواْ وَمَاتُواْ وَهُمۡ كُفَّارٌ أُوْلَٰٓئِكَ عَلَيۡهِمۡ لَعۡنَةُ ٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ وَٱلنَّاسِ أَجۡمَعِينَ ١٦١"
    },
    {
      "number": 169,
      "text": "خَالِدِينَ فِيهَا ۖ لَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنْظَرُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 162,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "خَٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنظَرُونَ ٢٦١\n                                    \n                                    \n                                    أي : في اللعنة التابعة لهم إلى يوم القيامة ثم المصاحبة لهم في نار جهنم التي ( لا يخفف عنهم العذاب ) فيها ، أي : لا ينقص عما هم فيه ( ولا هم ينظرون ) أي : لا يغير عنهم ساعة واحدة ، ولا يفتر ، بل هو متواصل دائم ، فنعوذ بالله من ذلك .\nوقال أبو العالية وقتادة : إن الكافر يوقف يوم القيامة فيلعنه الله ، ثم تلعنه الملائكة ، ثم يلعنه الناس أجمعون .\nفصل : لا خلاف في جواز لعن الكفار ، وقد كان عمر بن الخطاب ، رضي الله عنه ، وعمن بعده من الأئمة ، يلعنون الكفرة في القنوت وغيره ; فأما الكافر المعين ، فقد ذهب جماعة من العلماء إلى أنه لا يلعن لأنا لا ندري بما يختم له ، واستدل بعضهم بهذه الآية : ( إن الذين كفروا وماتوا وهم كفار أولئك عليهم لعنة الله والملائكة والناس أجمعين ) وقالت طائفة أخرى : بل يجوز لعن الكافر المعين . واختار ذلك الفقيه أبو بكر بن العربي المالكي ، ولكنه احتج بحديث فيه ضعف ، واستدل غيره بقوله ، عليه السلام ، في صحيح البخاري في قصة الذي كان يؤتى به سكران فيحده ، فقال رجل : لعنه الله ، ما أكثر ما يؤتى به ، فقال رسول الله صلى الله عليه وسلم : \" لا تلعنه فإنه يحب الله ورسوله \" قالوا : فعلة المنع من لعنه ; بأنه يحب الله ورسوله فدل على أن من لا يحب الله ورسوله يلعن ، والله أعلم .\n                                    ",
        "qortoby": "خَٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنظَرُونَ ٢٦١\n                                    \n                                    \n                                    ثم قال جل وعز : خالدين فيها يعني في اللعنة ، أي في جزائها . وقيل : خلودهم في اللعنة أنها مؤبدة عليهم خالدين نصب على الحال من الهاء والميم في عليهم ، والعامل فيه الظرف من قوله : عليهم لأن فيها معنى استقرار اللعنة .\n                                    ",
        "saadi": "خَٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنظَرُونَ ٢٦١\n                                        \n                                        \n                                        \n                                        و { خَالِدِينَ فِيهَا } أي: في اللعنة, أو في العذاب والمعنيان { لَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ } بل عذابهم دائم شديد مستمر { وَلَا هُمْ يُنْظَرُونَ } أي: يمهلون, لأن وقت الإمهال وهو الدنيا قد مضى, ولم يبق لهم عذر فيعتذرون.\n                                    "
      },
      "originalText": "خَٰلِدِينَ فِيهَا لَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنظَرُونَ ٢٦١"
    },
    {
      "number": 170,
      "text": "وَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ ۖ لَا إِلَٰهَ إِلَّا هُوَ الرَّحْمَٰنُ الرَّحِيمُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 163,
      "juz": 2,
      "manzil": 1,
      "page": 24,
      "ruku": 20,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ ٣٦١\n                                    \n                                    \n                                    يخبر تعالى عن تفرده بالإلهية ، وأنه لا شريك له ولا عديل له ، بل هو الله الواحد الأحد الفرد الصمد ، الذي لا إله إلا هو وأنه الرحمن الرحيم . وقد تقدم تفسير هذين الاسمين في أول السورة . وفي الحديث عن شهر بن حوشب ، عن أسماء بنت يزيد بن السكن ، عن رسول الله صلى الله عليه وسلم أنه قال : \" اسم الله الأعظم في هاتين الآيتين : ( وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم ) و ( الم الله لا إله إلا هو الحي القيوم ) [ آل عمران : 1 ، 2 ] \"\n                                    ",
        "qortoby": "وَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ ٣٦١\n                                    \n                                    \n                                    قوله تعالى : وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم فيه مسألتان :\nالأولى : قوله تعالى : وإلهكم إله واحد لما حذر تعالى من كتمان الحق بين أن أول ما يجب إظهاره ولا يجوز كتمانه أمر التوحيد ، ووصل ذلك بذكر البرهان ، وعلم طريق النظر ، وهو الفكر في عجائب الصنع ، ليعلم أنه لا بد له من فاعل لا يشبهه شيء . قال ابن عباس رضي الله عنهما : قالت كفار قريش : يا محمد انسب لنا ربك ، فأنزل الله تعالى سورة \" الإخلاص \" وهذه الآية . وكان للمشركين ثلاثمائة وستون صنما ، فبين الله أنه واحد .\nالثانية : قوله تعالى : لا إله إلا هو نفي وإثبات . أولها كفر وآخرها إيمان ، ومعناه لا معبود إلا الله . وحكي عن الشبلي رحمه الله أنه كان يقول : الله ، ولا يقول : لا إله ، فسئل عن ذلك فقال أخشى أن آخذ في كلمة الجحود ولا أصل إلى كلمة الإقرار .\nقلت : وهذا من علومهم الدقيقة ، التي ليست لها حقيقة ، فإن الله جل اسمه ذكر هذا المعنى في كتابه نفيا وإثباتا وكرره ، ووعد بالثواب الجزيل لقائله على لسان نبيه صلى الله عليه وسلم ، خرجه الموطأ والبخاري ومسلم وغيرهم . وقال صلى الله عليه وسلم : من كان آخر كلامه لا إله إلا الله دخل الجنة خرجه مسلم . والمقصود القلب لا اللسان ، فلو قال : لا إله ومات ومعتقده وضميره الوحدانية وما يجب له من الصفات لكان من أهل الجنة باتفاق أهل السنة . وقد أتينا على معنى اسمه الواحد ، ولا إله إلا هو والرحمن الرحيم في الكتاب الأسنى في شرح أسماء الله الحسنى . والحمد لله .\n                                    ",
        "saadi": "وَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ ٣٦١\n                                        \n                                        \n                                        \n                                        يخبر تعالى - وهو أصدق القائلين - أنه { إِلَهٌ وَاحِدٌ } أي: متوحد منفرد في ذاته, وأسمائه, وصفاته, وأفعاله، فليس له شريك في ذاته, ولا سمي له ولا كفو له, ولا مثل, ولا نظير, ولا خالق, ولا مدبر غيره، فإذا كان كذلك, فهو المستحق لأن يؤله ويعبد بجميع أنواع العبادة, ولا يشرك به أحد من خلقه, لأنه { الرَّحْمَنِ الرَّحِيمِ } المتصف بالرحمة العظيمة, التي لا يماثلها رحمة أحد, فقد وسعت كل شيء وعمت كل حي، فبرحمته وجدت المخلوقات, وبرحمته حصلت لها أنواع الكمالات، وبرحمته اندفع عنها كل نقمة، وبرحمته عرّف عباده نفسه بصفاته وآلائه, وبيَّن لهم كل ما يحتاجون إليه من مصالح دينهم ودنياهم, بإرسال الرسل, وإنزال الكتب. فإذا علم أن ما بالعباد من نعمة, فمن الله, وأن أحدا من المخلوقين, لا ينفع أحدا، علم أن الله هو المستحق لجميع أنواع العبادة, وأن يفرد بالمحبة والخوف, والرجاء, والتعظيم, والتوكل, وغير ذلك من أنواع الطاعات. وأن من أظلم الظلم, وأقبح القبيح, أن يعدل عن عبادته إلى عبادة العبيد, وأن يشرك المخلوق من تراب, برب الأرباب, أو يعبد المخلوق المدبر العاجز من جميع الوجوه, مع الخالق المدبر القادر القوي، الذي قد قهر كل شيء ودان له كل شيء. ففي هذه الآية, إثبات وحدانية الباري وإلهيته، وتقريرها بنفيها عن غيره من المخلوقين وبيان أصل الدليل على ذلك وهو إثبات رحمته التي من آثارها وجود جميع النعم, واندفاع [جميع] النقم، فهذا دليل إجمالي على وحدانيته تعالى.\n                                    "
      },
      "originalText": "وَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ لَّآ إِلَٰهَ إِلَّا هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ ٣٦١"
    }
  ]
}