{
  "number": 249,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 1708,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ المر ۚ تِلْكَ آيَاتُ الْكِتَابِ ۗ وَالَّذِي أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 1,
      "juz": 13,
      "manzil": 3,
      "page": 249,
      "ruku": 205,
      "hizbQuarter": 99,
      "sajda": false,
      "tafsier": {
        "ibnkther": "الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ١\n                                    \n                                    \n                                    تفسير سورة الرعد [ وهي مكية ]\nأما الكلام على الحروف المقطعة في أوائل السورة قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال ألم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه.\nوحكى مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى ألم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه وليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسئلة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسئلة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وإن شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها إسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن اسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\n( تلك آيات الكتاب ) أي : هذه آيات الكتاب ، وهو القرآن ، وقيل : التوارة والإنجيل . قاله مجاهد وقتادة ، وفيه نظر بل هو بعيد .\nثم عطف على ذلك عطف صفات ، قوله : ( والذي أنزل إليك ) أي : يا محمد ، ( من ربك الحق ) خبر تقدم مبتدؤه ، وهو قوله : ( والذي أنزل إليك من ربك ) هذا هو الصحيح المطابق لتفسير مجاهد وقتادة . واختار ابن جرير أن تكون الواو زائدة أو عاطفة صفة على صفة كما قدمنا ، واستشهد بقول الشاعر :\nإلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم\nوقوله : ( ولكن أكثر الناس لا يؤمنون ) كقوله : ( وما أكثر الناس ولو حرصت بمؤمنين ) [ يوسف : 103 ] أي : مع هذا البيان والجلاء والوضوح ، لا يؤمن أكثرهم لما فيهم من الشقاق والعناد والنفاق .\n                                    ",
        "qortoby": "الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ١\n                                    \n                                    \n                                    سورة الرعد\nمكية في قول الحسن وعكرمة وعطاء وجابر ، ومدنية في قول الكلبي ومقاتل . وقال ابن عباس وقتادة : مدنية إلا آيتين منها نزلتا بمكة ; وهما قوله - عز وجل - : ولو أن قرآنا سيرت به الجبال إلى آخرهما\nقوله تعالى : المر تلك آيات الكتاب تقدم القول فيها . والذي أنزل إليك يعني وهذا القرآن الذي أنزل إليك .\nمن ربك الحق لا كما يقول المشركون : إنك تأتي به من تلقاء نفسك ; فاعتصم به ، واعمل بما فيه . قال مقاتل : نزلت حين قال المشركون : إن محمدا أتى بالقرآن من تلقاء نفسه . \" والذي \" في موضع رفع عطفا على \" آيات \" أو على الابتداء ، و \" الحق \" خبره ; ويجوز أن يكون موضعه جرا على تقدير : وآيات الذي أنزل إليك ، وارتفاع الحق على هذا على إضمار مبتدأ ، تقديره : ذلك الحق ; كقوله تعالى : وهم يعلمون الحق ، يعني ذلك الحق . قال الفراء : وإن شئت جعلت الذي خفضا نعتا للكتاب ، وإن كانت فيه الواو كما يقال : أتانا هذا الكتاب عن أبي حفص والفاروق ; ومنه قول الشاعر :\nإلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم\nيريد : إلى الملك القرم بن الهمام ، ليث الكتيبة . ولكن أكثر الناس لا يؤمنون\n                                    ",
        "saadi": "الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أن هذا القرآن هو آيات الكتاب الدالة على كل ما يحتاج إليه العباد من أصول الدين وفروعه، وأن الذي أنزل إلى الرسول من ربه هو الحق المبين، لأن أخباره صدق، وأوامره ونواهيه عدل، مؤيدة بالأدلة والبراهين القاطعة، فمن أقبل عليه وعلى علمه، كان من أهل العلم بالحق، الذي يوجب لهم علمهم العمل بما أحب الله.\n{ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ } بهذا القرآن، إما جهلا وإعراضا عنه وعدم اهتمام به، وإما عنادا وظلما، فلذلك أكثر الناس غير منتفعين به، لعدم السبب الموجب للانتفاع.\n                                    "
      },
      "originalText": "الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ ١"
    },
    {
      "number": 1709,
      "text": "اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى ۚ يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ لَعَلَّكُمْ بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 2,
      "juz": 13,
      "manzil": 3,
      "page": 249,
      "ruku": 205,
      "hizbQuarter": 99,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ ٢\n                                    \n                                    \n                                    يخبر الله تعالى عن كمال قدرته وعظيم سلطانه : أنه الذي بإذنه وأمره رفع السماوات بغير عمد ، بل بإذنه وأمره وتسخيره رفعها عن الأرض بعدا لا تنال ولا يدرك مداها ، فالسماء الدنيا محيطة بجميع الأرض وما حولها من الماء والهواء من جميع نواحيها وجهاتها وأرجائها ، مرتفعة عليها من كل جانب على السواء ، وبعد ما بينها وبين الأرض من كل ناحية مسيرة خمسمائة عام ، وسمكها في نفسها مسيرة خمسمائة عام . ثم السماء الثانية محيطة بالسماء الدنيا وما حوت ، وبينها وبينها من البعد مسيرة خمسمائة عام ، وسمكها خمسمائة عام ، ثم السماء الثالثة محيطة بالثانية ، بما فيها ، وبينها وبينها خمسمائة عام ، وسمكها خمسمائة عام ، وكذا الرابعة والخامسة والسادسة والسابعة ، كما قال [ الله ] تعالى : ( الله الذي خلق سبع سماوات ومن الأرض مثلهن يتنزل الأمر بينهن لتعلموا أن الله على كل شيء قدير وأن الله قد أحاط بكل شيء علما ) [ الطلاق : 12 ] وفي الحديث : \" ما السماوات السبع وما فيهن وما بينهن في الكرسي إلا كحلقة ملقاة بأرض فلاة ، والكرسي في العرش كتلك الحلقة في تلك الفلاة وفي رواية : \" والعرش لا يقدر قدره إلا الله ، عز وجل ، وجاء عن بعض السلف أن بعد ما بين العرش إلى الأرض مسيرة خمسين ألف سنة ، وبعد ما بين قطريه مسيرة خمسين ألف سنة ، وهو من ياقوتة حمراء .\nوقوله : ( بغير عمد ترونها ) روي عن ابن عباس ، ومجاهد ، والحسن ، وقتادة : أنهم : قالوا : لها عمد ولكن لا ترى .\nوقال إياس بن معاوية : السماء على الأرض مثل القبة ، يعني بلا عمد . وكذا روي عن قتادة ، وهذا هو اللائق بالسياق . والظاهر من قوله تعالى : ( ويمسك السماء أن تقع على الأرض إلا بإذنه ) [ الحج : 65 ] فعلى هذا يكون قوله : ( ترونها ) تأكيدا لنفي ذلك ، أي : هي مرفوعة بغير عمد كما ترونها . هذا هو الأكمل في القدرة . وفي شعر أمية بن أبي الصلت الذي آمن شعره وكفر قلبه ، كما ورد في الحديث ويروى لزيد بن عمرو بن نفيل ، رحمه الله ورضي عنه :\nوأنت الذي من فضل من ورحمة بعثت إلى موسى رسولا مناديا فقلت له : فاذهب وهارون فادعوا\nإلى الله فرعون الذي كان طاغيا وقولا له : هل أنت سويت هذه\nبلا [ وتد حتى اطمأنت كما هيا وقولا له : أأنت رفعت هذه\nبلا ] عمد أرفق إذا بك بانيا ؟ وقولا له : هل أنت سويت وسطها\nمنيرا إذا ما جنك الليل هاديا وقولا له : من يرسل الشمس غدوة\nفيصبح ما مست من الأرض ضاحيا ؟ وقولا له : من ينبت الحب في الثرى\nفيصبح منه العشب يهتز رابيا ؟ ويخرج منه حبه في رءوسه\nففي ذاك آيات لمن كان واعيا\nوقوله : ( ثم استوى على العرش ) تقدم تفسير ذلك في سورة \" الأعراف \" وأنه يمرر كما جاء من غير تكييف ، ولا تشبيه ، ولا تعطيل ، ولا تمثيل ، تعالى الله علوا كبيرا .\nوقوله : ( وسخر الشمس والقمر كل يجري لأجل مسمى ) قيل : المراد أنهما يجريان إلى انقطاعهما بقيام الساعة ، كما في قوله تعالى : ( والشمس تجري لمستقر لها ذلك تقدير العزيز العليم ) [ يس : 38 ] .\nوقيل : المراد إلى مستقرهما ، وهو تحت العرش مما يلي بطن الأرض من الجانب الآخر ، فإنهما وسائر الكواكب إذا وصلوا هنالك ، يكونون أبعد ما يكون عن العرش; لأنه على الصحيح الذي تقوم عليه الأدلة ، قبة مما يلي العالم من هذا الوجه ، وليس بمحيط كسائر الأفلاك; لأنه له قوائم وحملة يحملونه . ولا يتصور هذا في الفلك المستدير ، وهذا واضح لمن تدبر ما وردت به الآيات والأحاديث الصحيحة ، ولله الحمد والمنة .\nوذكر الشمس والقمر; لأنهما أظهر الكواكب السيارة السبعة ، التي هي أشرف وأعظم .\nمن الثوابت ، فإذا كان قد سخر هذه ، فلأن يدخل في التسخير سائر الكواكب بطريق الأولى والأحرى ، كما نبه بقوله تعالى : ( لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون ) [ فصلت : 37 ] مع أنه قد صرح بذلك بقوله ( والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين ) [ الأعراف : 54 ] .\nوقوله : ( يفصل الآيات لعلكم بلقاء ربكم توقنون ) أي : يوضح الآيات والدلالات الدالة على أنه لا إله إلا هو ، وأنه يعيد الخلق إذا شاء كما ابتدأ خلقه .\n                                    ",
        "qortoby": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : الله الذي رفع السماوات بغير عمد ترونها ثم استوى على العرش وسخر الشمس والقمر كل يجري لأجل مسمى يدبر الأمر يفصل الآيات لعلكم بلقاء ربكم توقنون\nقوله تعالى : الله الذي رفع السماوات بغير عمد ترونها الآية . لما بين تعالى أن القرآن حق ، بين أن من أنزله قادر على الكمال ; فانظروا في مصنوعاته لتعرفوا كمال قدرته ; وقد تقدم هذا المعنى . وفي قوله : بغير عمد ترونها قولان : أحدهما : أنها مرفوعة بغير عمد ترونها ; قاله قتادة وإياس بن معاوية وغيرهما . الثاني : لها عمد ، ولكنا لا نراه ; قال ابن عباس : لها عمد على جبل قاف ; ويمكن أن يقال على هذا القول : العمد قدرته التي يمسك بها السماوات والأرض ، وهي غير مرئية لنا ; ذكره الزجاج . وقال ابن عباس أيضا : هي توحيد المؤمن . أعمدت السماء حين كادت تنفطر من كفر الكافر ; ذكره الغزنوي . والعمد جمع عمود ; قال النابغة :\nوخيس الجن إني قد أذنت لهم يبنون تدمر بالصفاح والعمد\nثم استوى على العرش تقدم الكلام فيه وسخر الشمس والقمر أي ذللهما لمنافع خلقه ومصالح عباده ; وكل مخلوق مذلل للخالق .\nكل يجري لأجل مسمى أي إلى وقت معلوم ; وهو فناء الدنيا ، وقيام الساعة التي عندها تكور الشمس ، ويخسف القمر ، وتنكدر النجوم ، وتنتثر الكواكب . وقال ابن عباس : أراد بالأجل المسمى درجاتهما ومنازلهما التي ينتهيان إليها لا يجاوزانها . وقيل : معنى الأجل المسمى أن القمر يقطع فلكه في شهر ، والشمس في سنة .\nيدبر الأمر أي يصرفه على ما يريد .\nيفصل الآيات أي يبينها أي من قدر على هذه الأشياء يقدر على الإعادة ; ولهذا قال : لعلكم بلقاء ربكم توقنون\n                                    ",
        "saadi": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ ٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن انفراده بالخلق والتدبير، والعظمة والسلطان الدال على أنه وحده المعبود الذي لا تنبغي العبادة إلا له فقال: { اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ } على عظمها واتساعها بقدرته العظيمة، { بِغَيْرِ عَمَدٍ تَرَوْنَهَا } أي: ليس لها عمد من تحتها، فإنه لو كان لها عمد، لرأيتموها { ثُمَّ } بعد ما خلق السماوات والأرض { اسْتَوَى عَلَى الْعَرْشِ } العظيم الذي هو أعلى المخلوقات، استواء يليق بجلاله ويناسب كماله.\n{ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ } لمصالح العباد ومصالح مواشيهم وثمارهم، { كُلِّ } من الشمس والقمر { يَجْرِي } بتدبير العزيز العليم، { لأَجَلٍ مُسَمًّى } بسير منتظم، لا يفتران ولا ينيان، حتى يجيء الأجل المسمى وهو طي الله هذا العالم، ونقلهم إلى الدار الآخرة التي هي دار القرار، فعند ذلك يطوي الله السماوات ويبدلها، ويغير الأرض ويبدلها. فتكور الشمس والقمر، ويجمع بينهما فيلقيان في النار، ليرى من عبدهما أنهما غير أهل للعبادة؛ فيتحسر بذلك أشد الحسرة وليعلم الذين كفروا أنهم كانوا كاذبين.\nوقوله { يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ } هذا جمع بين الخلق والأمر، أي: قد استوى الله العظيم على سرير الملك، يدبر الأمور في العالم العلوي والسفلي، فيخلق ويرزق، ويغني ويفقر، ويرفع أقواما ويضع آخرين، ويعز ويذل، ويخفض ويرفع، ويقيل العثرات، ويفرج الكربات، وينفذ الأقدار في أوقاتها التي سبق بها علمه، وجرى بها قلمه، ويرسل ملائكته الكرام لتدبير ما جعلهم على تدبيره.\nوينزل الكتب الإلهية على رسله ويبين ما يحتاج إليه العباد من الشرائع والأوامر والنواهي، ويفصلها غاية التفصيل ببيانها وإيضاحها وتمييزها، { لَعَلَّكُمْ } بسبب ما أخرج لكم من الآيات الأفقية والآيات القرآنية، { بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ } فإن كثرة الأدلة وبيانها ووضوحها، من أسباب حصول اليقين في جميع الأمور الإلهية، خصوصا في العقائد الكبار، كالبعث والنشور والإخراج من القبور.\nوأيضا فقد علم أن الله تعالى حكيم لا يخلق الخلق سدى، ولا يتركهم عبثا، فكما أنه أرسل رسله وأنزل كتبه لأمر العباد ونهيهم، فلا بد أن ينقلهم إلى دار يحل فيها جزاؤه، فيجازي المحسنين بأحسن الجزاء، ويجازي المسيئين بإساءتهم.\n                                    "
      },
      "originalText": "ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ ٢"
    },
    {
      "number": 1710,
      "text": "وَهُوَ الَّذِي مَدَّ الْأَرْضَ وَجَعَلَ فِيهَا رَوَاسِيَ وَأَنْهَارًا ۖ وَمِنْ كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ ۖ يُغْشِي اللَّيْلَ النَّهَارَ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 3,
      "juz": 13,
      "manzil": 3,
      "page": 249,
      "ruku": 205,
      "hizbQuarter": 99,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ ٣\n                                    \n                                    \n                                    لما ذكر تعالى العالم العلوي ، شرع في ذكر قدرته وحكمته وإحكامه للعالم السفلي ، فقال : ( وهو الذي مد الأرض ) أي : جعلها متسعة ممتدة في الطول والعرض ، وأرساها بجبال راسيات شامخات ، وأجرى فيها الأنهار والجداول والعيون لسقي ما جعل فيها من الثمرات المختلفة الألوان والأشكال والطعوم والروائح ، من كل زوجين اثنين ، أي : من كل شكل صنفان .\n( يغشي الليل النهار ) أي : جعل كلا منهما يطلب الآخر طلبا حثيثا ، فإذا ذهب هذا غشيه هذا ، وإذا انقضى هذا جاء الآخر ، فيتصرف أيضا في الزمان كما تصرف في المكان والسكان .\n( إن في ذلك لآيات لقوم يتفكرون ) أي : في آلاء الله وحكمته ودلائله .\n                                    ",
        "qortoby": "وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ ٣\n                                    \n                                    \n                                    قوله تعالى : وهو الذي مد الأرض وجعل فيها رواسي وأنهارا ومن كل الثمرات جعل فيها زوجين اثنين يغشي الليل النهار إن في ذلك لآيات لقوم يتفكرون\nقوله تعالى : وهو الذي مد الأرض لما بين آيات السماوات بين آيات الأرض ; أي بسط الأرض طولا وعرضا .\nوجعل فيها رواسي أي جبالا ثوابت ; واحدها راسية ; لأن الأرض ترسو بها ، أي تثبت ; والإرساء الثبوت ; قال عنترة :\nفصبرت عارفة لذلك حرة ترسو إذا نفس الجبان تطلع\nوقال جميل :\nأحبها والذي أرسى قواعده حبا إذا ظهرت آياته بطنا\nوقال ابن عباس وعطاء : أول جبل وضع على الأرض أبو قبيس .\nمسألة : في هذه الآية رد على من زعم أن الأرض كالكرة ، ورد على من زعم أن الأرض تهوي أبوابها عليها ; وزعم ابن الراوندي أن تحت الأرض جسما صعادا كالريح الصعادة ; وهي منحدرة فاعتدل الهاوي والصعادي في الجرم والقوة فتوافقا . وزعم آخرون أن الأرض مركب من جسمين ، أحدهما منحدر ، والآخر مصعد ، فاعتدلا ، فلذلك وقفت . والذي عليه المسلمون وأهل الكتاب القول بوقوف الأرض وسكونها ومدها ، وأن حركتها إنما تكون في العادة بزلزلة تصيبها .\nوقوله تعالى : وأنهارا أي مياها جارية في الأرض ، فيها منافع الخلق .\nومن كل الثمرات جعل فيها زوجين اثنين بمعنى صنفين . قال أبو عبيدة : الزوج واحد ، ويكون اثنين . الفراء : يعني بالزوجين هاهنا الذكر والأنثى ; وهذا خلاف النص . وقيل : معنى زوجين نوعان ، كالحلو والحامض ، والرطب واليابس ، والأبيض والأسود ، والصغير والكبير .\nإن في ذلك لآيات أي دلالات وعلامات لقوم يتفكرون\n                                    ",
        "saadi": "وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ ٣\n                                        \n                                        \n                                        \n                                        { وَهُوَ الَّذِي مَدَّ الْأَرْضَ } أي: خلقها للعباد، ووسعها وبارك فيها ومهدها للعباد، وأودع فيها من مصالحهم ما أودع، { وَجَعَلَ فِيهَا رَوَاسِيَ } أي: جبالا عظاما، لئلا تميد بالخلق، فإنه لولا الجبال لمادت بأهلها، لأنها على تيار ماء، لا ثبوت لها ولا استقرار إلا بالجبال الرواسي، التي جعلها الله أوتادا لها.\n{ و } جعل فيها { أَنْهَارًا } تسقي الآدميين وبهائمهم وحروثهم، فأخرج بها من الأشجار والزروع والثمار خيرا كثيرا ولهذا قال: { وَمِنْ كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ } أي: صنفين مما يحتاج إليه العباد.\n{ يُغْشِي اللَّيْلَ النَّهَارَ } فتظلم الآفاق فيسكن كل حيوان إلى مأواه ويستريحون من التعب والنصب في النهار، ثم إذا قضوا مأربهم من النوم غشي النهار الليل فإذا هم مصبحون منتشرون في مصالحهم وأعمالهم في النهار.\n{ ومن رحمته جعل لكم الليل والنهار لتسكنوا فيه ولتبتغوا من فضله ولعلكم تشكرون }\n{ إِنَّ فِي ذَلِكَ لَآيَاتٍ } على المطالب الإلهية { لِقَوْمٍ يَتَفَكَّرُونَ } فيها، وينظرون فيها نظر اعتبار دالة على أن الذي خلقها ودبرها وصرفها، هو الله الذي لا إله إلا هو، ولا معبود سواه، وأنه عالم الغيب والشهادة، الرحمن الرحيم، وأنه القادر على كل شيء، الحكيم في كل شيء المحمود على ما خلقه وأمر به تبارك وتعالى.\n                                    "
      },
      "originalText": "وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِيهَا رَوَٰسِيَ وَأَنۡهَٰرٗاۖ وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ ٣"
    },
    {
      "number": 1711,
      "text": "وَفِي الْأَرْضِ قِطَعٌ مُتَجَاوِرَاتٌ وَجَنَّاتٌ مِنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ صِنْوَانٌ وَغَيْرُ صِنْوَانٍ يُسْقَىٰ بِمَاءٍ وَاحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِي الْأُكُلِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 4,
      "juz": 13,
      "manzil": 3,
      "page": 249,
      "ruku": 205,
      "hizbQuarter": 99,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤\n                                    \n                                    \n                                    وقوله : ( وفي الأرض قطع متجاورات ) أي : أراض تجاور بعضها بعضا ، مع أن هذه طيبة تنبت ما ينتفع به الناس ، وهذه سبخة مالحة لا تنبت شيئا . هكذا روي عن ابن عباس ، ومجاهد ، وسعيد بن جبير ، والضحاك ، وغيرهم .\nوكذا يدخل في هذه الآية اختلاف ألوان بقاع الأرض ، فهذه تربة حمراء ، وهذه بيضاء ، وهذه صفراء ، وهذه سوداء ، وهذه محجرة وهذه سهلة ، وهذه مرملة ، وهذه سميكة ، وهذه رقيقة ، والكل متجاورات . فهذه بصفتها ، وهذه بصفتها الأخرى ، فهذا كله مما يدل على الفاعل المختار ، لا إله إلا هو ، ولا رب سواه .\nوقوله : ( وجنات من أعناب وزرع ونخيل ) يحتمل أن تكون عاطفة على ) جنات ) فيكون ( وزرع ونخيل ) مرفوعين . ويحتمل أن يكون معطوفا على أعناب ، فيكون مجرورا; ولهذا قرأ بكل منهما طائفة من الأئمة .\nوقوله : ( صنوان وغير صنوان ) الصنوان : هي الأصول المجتمعة في منبت واحد ، كالرمان والتين وبعض النخيل ، ونحو ذلك . وغير الصنوان : ما كان على أصل واحد ، كسائر الأشجار ، ومنه سمي عم الرجل صنو أبيه ، كما جاء في الحديث الصحيح : أن رسول الله - صلى الله عليه وسلم - قال لعمر : \" أما شعرت أن عم الرجل صنو أبيه ؟ \" .\nوقال سفيان الثوري ، وشعبة ، عن أبى إسحاق ، عن البراء ، رضي الله عنه : الصنوان : هي النخلات في أصل واحد ، وغير الصنوان : المتفرقات . وقاله ابن عباس ، ومجاهد ، والضحاك ، وقتادة ، وعبد الرحمن بن زيد بن أسلم .\nوقوله : ( يسقى بماء واحد ونفضل بعضها على بعض في الأكل ) قال الأعمش ، عن أبي صالح ، عن أبي هريرة ، رضي الله عنه ، عن النبي ، صلى الله عليه وسلم : ( ونفضل بعضها على بعض في الأكل ) قال : \" الدقل والفارسي ، والحلو والحامض \" . رواه الترمذي وقال : حسن غريب .\nأي : هذا الاختلاف في أجناس الثمرات والزروع ، في أشكالها وألوانها ، وطعومها وروائحها ، وأوراقها وأزهارها .\nفهذا في غاية الحلاوة وذا في غاية الحموضة ، وذا في غاية المرارة وذا عفص ، وهذا عذب وهذا جمع هذا وهذا ، ثم يستحيل إلى طعم آخر بإذن الله تعالى . وهذا أصفر وهذا أحمر ، وهذا أبيض وهذا أسود وهذا أزرق . وكذلك الزهورات مع أن كلها يستمد من طبيعة واحدة ، وهو الماء ، مع هذا الاختلاف الكبير الذي لا ينحصر ولا ينضبط ، ففي ذلك آيات لمن كان واعيا ، وهذا من أعظم الدلالات على الفاعل المختار ، الذي بقدرته فاوت بين الأشياء وخلقها على ما يريد; ولهذا قال تعالى : ( إن في ذلك لآيات لقوم يعقلون )\n                                    ",
        "qortoby": "وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤\n                                    \n                                    \n                                    قوله تعالى : وفي الأرض قطع متجاورات وجنات من أعناب وزرع ونخيل صنوان وغير صنوان يسقى بماء واحد ونفضل بعضها على بعض في الأكل إن في ذلك لآيات لقوم يعقلون\nفيه خمس مسائل :\nالأولى : قوله تعالى : وفي الأرض قطع متجاورات في الكلام حذف ; المعنى :\nوفي الأرض قطع متجاورات وغير متجاورات ; كما قال : سرابيل تقيكم الحر والمعنى : وتقيكم البرد ، ثم حذف لعلم السامع . والمتجاورات المدن وما كان عامرا ، وغير متجاورات الصحاري وما كان غير عامر .\nالثانية : قوله تعالى : \" متجاورات \" أي قرى متدانيات ، ترابها واحد ، وماؤها واحد ، وفيها زروع وجنات ، ثم تتفاوت في الثمار والتمر ; فيكون البعض حلوا ، والبعض حامضا ; والغصن الواحد من الشجرة قد يختلف الثمر فيه من الصغر والكبر واللون والمطعم ، وإن انبسط الشمس والقمر على الجميع على نسق واحد ; وفي هذا أدل دليل على وحدانيته وعظم صمديته ، والإرشاد لمن ضل عن معرفته ; فإنه نبه سبحانه بقوله : يسقى بماء واحد على أن ذلك كله ليس إلا بمشيئته وإرادته ، وأنه مقدور بقدرته ; وهذا أدل دليل على بطلان القول بالطبع ; إذ لو كان ذلك بالماء والتراب والفاعل له الطبيعة لما وقع الاختلاف . وقيل : وجه الاحتجاج أنه أثبت التفاوت بين البقاع ; فمن تربة عذبة ، ومن تربة سبخة مع تجاورهما ; وهذا أيضا من دلالات كمال قدرته ; جل وعز تعالى عما يقول الظالمون والجاحدون علوا كبيرا .\nالثالثة : ذهبت الكفرة - لعنهم الله - إلى أن كل حادث يحدث بنفسه لا من صانع ; وادعوا ذلك في الثمار الخارجة من الأشجار ، وقد أقروا بحدوثها ، وأنكروا محدثها ، وأنكروا الأعراض . وقالت فرقة بحدوث الثمار لا من صانع ، وأثبتوا للأعراض فاعلا ; والدليل على أن الحادث لا بد له من محدث أنه يحدث في وقت ، ويحدث ما هو من جنسه في وقت آخر ; فلو كان حدوثه في وقته لاختصاصه به ، لوجب أن يحدث في وقته كل ما هو من جنسه ; وإذا بطل اختصاصه بوقته صح أن اختصاصه به لأجل مخصص خصصه به ، ولولا تخصيصه إياه به لم يكن حدوثه في وقته أولى من حدوثه قبل ذلك أو بعده ; واستيفاء هذا في علم الكلام .\nالرابعة : قوله تعالى : وجنات من أعناب وقرأ الحسن \" وجنات \" بكسر التاء ، على التقدير : وجعل فيها جنات ، فهو محمول على قوله : \" وجعل فيها رواسي \" . ويجوز أن تكون مجرورة على الحمل على \" كل \" التقدير : ومن كل الثمرات ، ومن جنات . الباقون \" جنات \" بالرفع على تقدير : وبينهما جنات .\n\" وزرع ونخيل صنوان وغير صنوان \" بالرفع . ابن كثير وأبو عمرو وحفص عطفا على الجنات ; أي على تقدير : وفي الأرض زرع ونخيل . وخفضها الباقون نسقا على الأعناب ; فيكون الزرع والنخيل من الجنات ; ويجوز أن يكون معطوفا على \" كل \" حسب ما تقدم في \" وجنات \" . وقرأ مجاهد والسلمي وغيرهما \" صنوان \" بضم الصاد ، الباقون بالكسر ; وهما لغتان ; وهما جمع صنو ، وهي النخلات والنخلتان ، يجمعهن أصل واحد ، وتتشعب منه رءوس فتصير نخيلا ; نظيرها قنوان ، واحدها قنو وروى أبو إسحاق عن البراء قال : الصنوان المجتمع ، وغير الصنوان المتفرق ; النحاس : وكذلك هو في اللغة ; يقال للنخلة إذا كانت فيها نخلة أخرى أو أكثر صنوان . والصنو المثل ; ومنه قول النبي - صلى الله عليه وسلم - : عم الرجل صنو أبيه . ولا فرق فيها بين التثنية والجمع ولا بالإعراب ; فتعرب نون الجمع ، وتكسر نون التثنية ; قال الشاعر :\nالعلم والحلم خلتا كرم للمرء زين إذا هما اجتمعا صنوان لا يستتم حسنهما\nإلا بجمع ذا وذاك معا\nالخامسة : قوله تعالى : \" يسقى بماء واحد \" كصالح بني آدم وخبيثهم ; أبوهم واحد ; قاله النحاس والبخاري . وقرأ عاصم وابن عامر : يسقى بالياء ، أي يسقى ذلك كله . وقرأ الباقون بالتاء ، لقوله : جنات واختاره أبو حاتم وأبو عبيدة ; قال أبو عمرو : والتأنيث أحسن .\n\" ونفضل بعضها على بعض في الأكل \" ولم يقل بعضه . وقرأ حمزة والكسائي وغيرهما \" ويفضل \" بالياء ردا على قوله : \" يدبر الأمر \" و \" يفصل \" و \" يغشي \" الباقون بالنون على معنى : ونحن نفضل . وروى جابر بن عبد الله قال : سمعت النبي - صلى الله عليه وسلم - يقول لعلي - رضي الله عنه - : الناس من شجر شتى وأنا وأنت من شجرة واحدة ثم قرأ النبي - صلى الله عليه وسلم - وفي الأرض قطع متجاورات حتى بلغ قوله : يسقى بماء واحد و \" الأكل \" الثمر . قال ابن عباس : يعني الحلو والحامض والفارسي والدقل . وروي مرفوعا من حديث أبي هريرة ( أن رسول الله - صلى الله عليه وسلم - قال في قوله تعالى : \" ونفضل بعضها على بعض في الأكل \" قال : الفارسي والدقل والحلو والحامض ) ذكره الثعلبي . قال الحسن : المراد بهذه الآية المثل ; ضربه الله تعالى لبني آدم ، أصلهم واحد ، وهم مختلفون في الخير والشر . والإيمان والكفر ، كاختلاف الثمار التي تسقى بماء واحد ; ومنه قول الشاعر :\nالناس كالنبت والنبت ألوان منها شجر الصندل والكافور والبان\nومنها شجر ينضح طول الدهر قطران\n\" إن في ذلك لآيات لقوم يعقلون \" أي لعلامات لمن كان له قلب يفهم عن الله تعالى .\n                                    ",
        "saadi": "وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤\n                                        \n                                        \n                                        \n                                        ومن الآيات على كمال قدرته وبديع صنعته أن جعل { فِي الْأَرْضِ قِطَعٌ مُتَجَاوِرَاتٌ وَجَنَّاتٌ } فيها أنواع الأشجار { مِنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ } وغير ذلك، والنخيل التي بعضها { صِنْوَانٌ } أي: عدة أشجار في أصل واحد، { وَغَيْرُ صِنْوَانٍ } بأن كان كل شجرة على حدتها، والجميع { يُسْقَى بِمَاءٍ وَاحِدٍ } وأرضه واحدة { وَنُفَضِّلُ بَعْضَهَا عَلَى بَعْضٍ فِي الْأُكُلِ } لونا وطعما ونفعا ولذة؛ فهذه أرض طيبة تنبت الكلأ والعشب الكثير والأشجار والزروع، وهذه أرض تلاصقها لا تنبت كلأ ولا تمسك ماء، وهذه تمسك الماء ولا تنبت الكلأ، وهذه تنبت الزرع والأشجار ولا تنبت الكلأ، وهذه الثمرة حلوة وهذه مرة وهذه بين ذلك.\nفهل هذا التنوع في ذاتها وطبيعتها؟ أم ذلك تقدير العزيز الرحيم؟\n{ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ } أي: لقوم لهم عقول تهديهم إلى ما ينفعهم، وتقودهم إلى ما يرشدهم ويعقلون عن الله وصاياه وأوامره ونواهيه، وأما أهل الإعراض، وأهل البلادة فهم في ظلماتهم يعمهون، وفي غيهم يترددون، لا يهتدون إلى ربهم سبيلا ولا يعون له قيلا.\n                                    "
      },
      "originalText": "وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ وَجَنَّٰتٞ مِّنۡ أَعۡنَٰبٖ وَزَرۡعٞ وَنَخِيلٞ صِنۡوَانٞ وَغَيۡرُ صِنۡوَانٖ يُسۡقَىٰ بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤"
    },
    {
      "number": 1712,
      "text": "۞ وَإِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا تُرَابًا أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ۗ أُولَٰئِكَ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ وَأُولَٰئِكَ الْأَغْلَالُ فِي أَعْنَاقِهِمْ ۖ وَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 5,
      "juz": 13,
      "manzil": 3,
      "page": 249,
      "ruku": 205,
      "hizbQuarter": 100,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥\n                                    \n                                    \n                                    يقول تعالى لرسوله محمد ، صلوات الله وسلامه عليه : ( وإن تعجب ) من تكذيب هؤلاء المشركين بأمر المعاد مع ما يشاهدونه من آيات الله سبحانه ودلالاته في خلقه على أنه القادر على ما يشاء ، ومع ما يعترفون به من أنه ابتدأ خلق الأشياء ، فكونها بعد أن لم تكن شيئا مذكورا ، ثم هم بعد هذا يكذبون خبره في أنه سيعيد العالمين خلقا جديدا ، وقد اعترفوا وشاهدوا ما هو أعجب مما كذبوا به ، فالعجب من قولهم : ( أئذا كنا ترابا أئنا لفي خلق جديد ) وقد علم كل عالم وعاقل أن خلق السماوات والأرض أكبر من خلق الناس ، وأن من بدأ الخلق فالإعادة سهلة عليه ، كما قال تعالى : ( أولم يروا أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير )\nثم نعت المكذبين بهذا فقال : ( أولئك الذين كفروا بربهم وأولئك الأغلال في أعناقهم ) أي : يسحبون بها في النار ، ( وأولئك أصحاب النار هم فيها خالدون ) أي : ماكثون فيها أبدا ، لا يحولون عنها ولا يزولون .\n                                    ",
        "qortoby": "۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥\n                                    \n                                    \n                                    قوله تعالى : وإن تعجب فعجب قولهم أئذا كنا ترابا أئنا لفي خلق جديد أولئك الذين كفروا بربهم وأولئك الأغلال في أعناقهم وأولئك أصحاب النار هم فيها خالدون\nقوله تعالى : وإن تعجب فعجب قولهم أي إن تعجب يا محمد من تكذيبهم لك بعدما كنت عندهم الصادق الأمين فأعجب منه تكذيبهم بالبعث ; والله تعالى لا يتعجب ، ولا يجوز عليه التعجب ; لأنه تغير النفس بما تخفى أسبابه ، وإنما ذكر ذلك ليتعجب منه نبيه والمؤمنون . وقيل المعنى : أي إن عجبت يا محمد من إنكارهم الإعادة مع إقرارهم بأني خالق السماوات والأرض والثمار المختلفة من الأرض الواحدة فقولهم عجب يعجب منه الخلق ; لأن الإعادة في معنى الابتداء . وقيل : الآية في منكري الصانع ; أي إن تعجب من إنكارهم الصانع مع الأدلة الواضحة بأن المتغير لا بد له من مغير فهو محل التعجب ; ونظم الآية يدل على الأول والثاني ; لقوله : أئذا كنا ترابا أي أنبعث إذا كنا ترابا ؟ !\n\" أئنا لفي خلق جديد \" وقرئ \" إنا \" .\nو \" الأغلال \" جمع غل ; وهو طوق تشد به اليد إلى العنق ، أي يغلون يوم القيامة ; بدليل قوله : إذ الأغلال في أعناقهم إلى قوله : ثم في النار يسجرون . وقيل : الأغلال أعمالهم السيئة التي هي لازمة لهم .\n                                    ",
        "saadi": "۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥\n                                        \n                                        \n                                        \n                                        يحتمل أن معنى قوله { وَإِنْ تَعْجَبْ } من عظمة الله تعالى وكثرة أدلة توحيده، فإن العجب -مع هذا- إنكار المكذبين وتكذيبهم بالبعث، وقولهم { أَئِذَا كُنَّا تُرَابًا أَئِنَّا لَفِي خَلْقٍ جَدِيدٍ } أي: هذا بعيد في غاية الامتناع بزعمهم، أنهم بعد ما كانوا ترابا، أن الله يعيدهم، فإنهم -من جهلهم- قاسوا قدرة الخالق بقدرة المخلوق.\nفلما رأوا هذا ممتنعا في قدرة المخلوق ظنوا أنه ممتنع على قدرة الخالق، ونسوا أن الله خلقهم أول مرة ولم يكونوا شيئا.\nويحتمل أن معناه: وإن تعجب من قولهم وتكذيبهم للبعث، فإن ذلك من العجائب، فإن الذي توضح له الآيات، ويرى من الأدلة القاطعة على البعث ما لا يقبل الشك والريب، ثم ينكر ذلك فإن قوله من العجائب.\nولكن ذلك لا يستغرب على { الَّذِينَ كَفَرُوا بِرَبِّهِمْ } وجحدوا وحدانيته، وهي أظهر الأشياء وأجلاها، { وَأُولَئِكَ الْأَغْلَالُ } المانعة لهم من الهدى { فِي أَعْنَاقِهِمْ } حيث دعوا إلى الإيمان فلم يؤمنوا، وعرض عليهم الهدى فلم يهتدوا، فقلبت قلوبهم وأفئدتهم عقوبة على أنهم لم يؤمنوا به أول مرة، { وَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ } لا يخرجون منها أبدا.\n                                    "
      },
      "originalText": "۞ وَإِن تَعۡجَبۡ فَعَجَبٞ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥"
    }
  ]
}