{
  "number": 25,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 171,
      "text": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنْفَعُ النَّاسَ وَمَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ مَاءٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ وَتَصْرِيفِ الرِّيَاحِ وَالسَّحَابِ الْمُسَخَّرِ بَيْنَ السَّمَاءِ وَالْأَرْضِ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 164,
      "juz": 2,
      "manzil": 1,
      "page": 25,
      "ruku": 21,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَٱلۡفُلۡكِ ٱلَّتِي تَجۡرِي فِي ٱلۡبَحۡرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖ وَتَصۡرِيفِ ٱلرِّيَٰحِ وَٱلسَّحَابِ ٱلۡمُسَخَّرِ بَيۡنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤٦١\n                                    \n                                    \n                                    ثم ذكر الدليل على تفرده بالإلهية [ بتفرده ] بخلق السماوات والأرض وما فيهما ، وما بين ذلك مما ذرأ وبرأ من المخلوقات الدالة على وحدانيته ، فقال : ( إن في خلق السماوات والأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس وما أنزل الله من السماء من ماء فأحيا به الأرض بعد موتها وبث فيها من كل دابة وتصريف الرياح والسحاب المسخر بين السماء والأرض لآيات لقوم يعقلون ) يقول تعالى : ( إن في خلق السماوات والأرض ) تلك في [ لطافتها و ] ارتفاعها واتساعها وكواكبها السيارة والثوابت ودوران فلكها ، وهذه الأرض في [ كثافتها و ] انخفاضها وجبالها وبحارها وقفارها ووهادها وعمرانها وما فيها من المنافع ( واختلاف الليل والنهار ) هذا يجيء ثم يذهب ويخلفه الآخر ويعقبه ، لا يتأخر عنه لحظة ، كما قال تعالى : ( لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل في فلك يسبحون ) [ يس : 40 ] وتارة يطول هذا ويقصر هذا ، وتارة يأخذ هذا من هذا ثم يتقارضان ، كما قال تعالى : ( يولج الليل في النهار ويولج النهار في الليل ) [ الحج : 61 ] أي : يزيد من هذا في هذا ، ومن هذا في هذا ( والفلك التي تجري في البحر بما ينفع الناس ) أي : في تسخير البحر لحمل السفن من جانب إلى جانب لمعاش الناس ، والانتفاع بما عند أهل ذلك الإقليم ، ونقل هذا إلى هؤلاء وما عند أولئك إلى هؤلاء ( وما أنزل الله من السماء من ماء فأحيا به الأرض بعد موتها ) كما قال تعالى : ( وآية لهم الأرض الميتة أحييناها وأخرجنا منها حبا فمنه يأكلون وجعلنا فيها جنات من نخيل وأعناب وفجرنا فيها من العيون ليأكلوا من ثمره وما عملته أيديهم أفلا يشكرون سبحان الذي خلق الأزواج كلها مما تنبت الأرض ومن أنفسهم ومما لا يعلمون ) [ يس : 33 - 36 ] ( وبث فيها من كل دابة ) أي : على اختلاف أشكالها وألوانها ومنافعها وصغرها وكبرها ، وهو يعلم ذلك كله ويرزقه لا يخفى عليه شيء من ذلك ، كما قال تعالى : ( وما من دابة في الأرض إلا على الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين ) [ هود : 6 ] ( وتصريف الرياح ) أي : تارة تأتي بالرحمة وتارة تأتي بالعذاب ، تارة تأتي مبشرة بين يدي السحاب ، وتارة تسوقه ، وتارة تجمعه ، وتارة تفرقه ، وتارة تصرفه ، [ ثم تارة تأتي من الجنوب وهي الشامية ، وتارة تأتي من ناحية اليمن وتارة صبا ، وهي الشرقية التي تصدم وجه الكعبة ، وتارة دبور وهي غربية تفد من ناحية دبر الكعبة ، والرياح تسمى كلها بحسب مرورها على الكعبة . وقد صنف الناس في الرياح والمطر والأنواء كتبا كثيرة فيما يتعلق بلغاتها وأحكامها ، وبسط ذلك يطول هاهنا ، والله أعلم ] . ( والسحاب المسخر بين السماء والأرض ) [ أي : سائر بين السماء والأرض ] يسخر إلى ما يشاء الله من الأراضي والأماكن ، كما يصرفه تعالى : ( لآيات لقوم يعقلون ) أي : في هذه الأشياء دلالات بينة على وحدانية الله تعالى ، كما قال تعالى : ( إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب الذين يذكرون الله قياما وقعودا وعلى جنوبهم ويتفكرون في خلق السماوات والأرض ربنا ما خلقت هذا باطلا سبحانك فقنا عذاب النار ) [ آل عمران : 190 ، 191 ] . وقال الحافظ أبو بكر بن مردويه : أخبرنا محمد بن أحمد بن إبراهيم ، حدثنا أبو سعيد الدشتكي ، حدثني أبي ، عن أبيه ، عن أشعث بن إسحاق ، عن جعفر بن أبي المغيرة ، عن سعيد بن جبير ، عن ابن عباس قال : أتت قريش محمدا صلى الله عليه وسلم فقالوا : يا محمد إنما نريد أن تدعو ربك أن يجعل لنا الصفا ذهبا ، فنشتري به الخيل والسلاح ، فنؤمن بك ونقاتل معك . قال : \" أوثقوا لي لئن دعوت ربي فجعل لكم الصفا ذهبا لتؤمنن بي \" فأوثقوا له ، فدعا ربه ، فأتاه جبريل فقال : إن ربك قد أعطاهم الصفا ذهبا على أنهم إن لم يؤمنوا بك عذبهم عذابا لم يعذبه أحدا من العالمين . قال محمد صلى الله عليه وسلم : \" رب لا ، بل دعني وقومي فلأدعهم يوما بيوم \" . فأنزل الله هذه الآية : ( إن في خلق السماوات والأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس ) الآية .\nورواه ابن أبي حاتم من وجه آخر ، عن جعفر بن أبي المغيرة ، به . وزاد في آخره : وكيف يسألونك عن الصفا وهم يرون من الآيات ما هو أعظم من الصفا .\nوقال ابن أبي حاتم أيضا : حدثنا أبي ، حدثنا أبو حذيفة ، حدثنا شبل ، عن ابن أبي نجيح ، عن عطاء ، قال : نزلت على النبي صلى الله عليه وسلم بالمدينة : ( وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم ) فقال كفار قريش بمكة : كيف يسع الناس إله واحد ؟ فأنزل الله تعالى : ( إن في خلق السماوات والأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس ) إلى قوله : ( لآيات لقوم يعقلون )\nفبهذا يعلمون أنه إله واحد ، وأنه إله كل شيء وخالق كل شيء .\nوقال وكيع : حدثنا سفيان ، عن أبيه ، عن أبي الضحى قال : لما نزلت : ( وإلهكم إله واحد ) إلى آخر الآية ، قال المشركون : إن كان هكذا فليأتنا بآية . فأنزل الله عز وجل : ( إن في خلق السماوات والأرض واختلاف الليل والنهار ) إلى قوله : ( يعقلون )\nورواه آدم بن أبي إياس ، عن أبي جعفر هو الرازي عن سعيد بن مسروق ، والد سفيان ، عن أبي الضحى ، به .\n                                    ",
        "qortoby": "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَٱلۡفُلۡكِ ٱلَّتِي تَجۡرِي فِي ٱلۡبَحۡرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖ وَتَصۡرِيفِ ٱلرِّيَٰحِ وَٱلسَّحَابِ ٱلۡمُسَخَّرِ بَيۡنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤٦١\n                                    \n                                    \n                                    قوله تعالى : إن في خلق السماوات والأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس وما أنزل الله من السماء من ماء فأحيا به الأرض بعد موتها وبث فيها من كل دابة وتصريف الرياح والسحاب المسخر بين السماء والأرض لآيات لقوم يعقلون فيه أربع عشرة مسألة :\nالأولى : قال عطاء : لما نزلت وإلهكم إله واحد قالت كفار قريش : كيف يسع الناس إله واحد ، فنزلت إن في خلق السماوات والأرض . ورواه سفيان عن أبيه عن أبي الضحى قال : لما نزلت وإلهكم إله واحد قالوا هل من دليل على ذلك ؟ فأنزل الله تعالى إن في خلق السماوات والأرض فكأنهم طلبوا آية فبين لهم دليل التوحيد ، وأن هذا العالم والبناء العجيب لا بد له من بان وصانع . وجمع السماوات لأنها أجناس مختلفة ، كل سماء من جنس غير جنس الأخرى . ووحد الأرض لأنها كلها تراب ، والله تعالى أعلم .\nفآية السماوات : ارتفاعها بغير عمد من تحتها ولا علائق من فوقها ، ودل ذلك على القدرة وخرق العادة . ولو جاء نبي فتحدي بوقوف جبل في الهواء دون علاقة كان معجزا . ثم ما فيها من الشمس والقمر والنجوم السائرة والكواكب الزاهرة شارقة وغاربة نيرة وممحوة آية ثانية .\nوآية الأرض : بحارها وأنهارها ومعادنها وشجرها وسهلها ووعرها .\nالثانية : قوله تعالى : واختلاف الليل والنهار قيل : اختلافهما بإقبال أحدهما وإدبار الآخر من حيث لا يعلم . وقيل : اختلافهما في الأوصاف من النور والظلمة والطول والقصر . والليل جمع ليلة ، مثل تمرة وتمر ونخلة ونخل . ويجمع أيضا ليالي وليال بمعنى ، وهو مما شذ عن قياس الجموع ، كشبه ومشابه وحاجة وحوائج وذكر ومذاكر ، وكأن ليالي في القياس جمع ليلاة . وقد استعملوا ذلك في الشعر قال :\nفي كل يوم [ وما ] وكل ليلاة\nوقال آخر :\nفي كل يوم ما وكل ليلاه حتى يقول كل راء إذ رآه\nيا ويحه من جمل ما أشقاه\nقال ابن فارس في المجمل : ويقال إن بعض الطير يسمى ليلا ، ولا أعرفه والنهار يجمع نهر وأنهرة . قال أحمد بن يحيى ثعلب : نهر جمع نهر وهو جمع الجمع للنهار ، وقيل النهار اسم مفرد لم يجمع لأنه بمعنى المصدر ، كقولك الضياء ، يقع على القليل والكثير . والأول أكثر ، قال الشاعر :\nلولا الثريدان هلكنا بالضمر ثريد ليل وثريد بالنهر\nقال ابن فارس : النهار معروف ، والجمع نهر وأنهار . ويقال : إن النهار يجمع على النهر . والنهار : ضياء ما بين طلوع الفجر إلى غروب الشمس . ورجل نهر : صاحب نهار . ويقال إن النهار فرخ الحبارى . قال النضر بن شميل : أول النهار طلوع الشمس ، ولا يعد ما قبل ذلك من النهار . وقال ثعلب : أوله عند العرب طلوع الشمس ، واستشهد بقول أمية بن أبي الصلت .\nوالشمس تطلع كل آخر ليلة حمراء يصبح لونها يتورد\nوأنشد قول عدي بن زيد :\nوجاعل الشمس مصرا لا خفاء به بين النهار وبين الليل قد فصلا\nوأنشد الكسائي :\nإذا طلعت شمس النهار فإنها أمارة تسليمي عليك فسلمي\nقال الزجاج في كتاب الأنواء : أول النهار ذرور الشمس . وقسم ابن الأنباري الزمن ثلاثة أقسام : قسما جعله ليلا محضا ، وهو من غروب الشمس إلى طلوع الفجر . وقسما جعله نهارا محضا ، وهو من طلوع الشمس إلى غروبها . وقسما جعله مشتركا بين النهار والليل ، وهو ما بين طلوع الفجر إلى طلوع الشمس ، لبقايا ظلمة الليل ومبادئ ضوء النهار .\nقلت : والصحيح أن النهار من طلوع الفجر إلى غروب الشمس ، كما رواه ابن فارس في المجمل ، يدل عليه ما ثبت في صحيح مسلم عن عدي بن حاتم قال : لما نزلت حتى يتبين لكم الخيط الأبيض من الخيط الأسود من الفجر قال له عدي : يا رسول الله ، إني أجعل تحت وسادتي عقالين : عقالا أبيض وعقالا أسود ، أعرف بهما الليل من النهار . فقال رسول الله صلى الله عليه وسلم : إن وسادك لعريض إنما هو سواد الليل وبياض النهار . فهذا الحديث يقضي أن النهار من طلوع الفجر إلى غروب الشمس ، وهو مقتضى الفقه في الأيمان ، وبه ترتبط الأحكام . فمن حلف ألا يكلم فلانا نهارا فكلمه قبل طلوع الشمس حنث ، وعلى الأول لا يحنث . وقول النبي صلى الله عليه وسلم هو الفيصل في ذلك والحكم . وأما على ظاهر اللغة وأخذه من السنة فهو من وقت الإسفار إذا اتسع وقت النهار ، كما قال [ هو قيس بن الخطيم ] :\nملكت بها كفي فأنهرت فتقها يرى قائم من دونها ما وراءها\nوقد جاء عن حذيفة ما يدل على هذا القول ، خرجه النسائي . وسيأتي في آي الصيام إن شاء الله تعالى .\nالثالثة : قوله تعالى : والفلك التي تجري في البحر الفلك : السفن ، وإفراده وجمعه بلفظ واحد ، ويذكر ويؤنث . وليست الحركات في المفرد تلك بأعيانها في الجمع ، بل كأنه بنى الجمع بناء آخر ، يدل على ذلك توسط التثنية في قولهم : فلكان . والفلك المفرد مذكر ، قال تعالى : في الفلك المشحون فجاء به مذكرا ، وقال : والفلك التي تجري في البحر فأنث . ويحتمل واحدا وجمعا ، وقال : حتى إذا كنتم في الفلك وجرين بهم بريح طيبة فجمع ، فكأنه يذهب بها إذا كانت واحدة إلى المركب فيذكر ، وإلى السفينة فيؤنث .\nوقيل : واحده فلك ، مثل أسد وأسد ، وخشب وخشب ، وأصله من الدوران ، ومنه : فلك السماء التي تدور عليه النجوم . وفلكت الجارية استدار ثديها ، ومنه فلكة المغزل . وسميت السفينة فلكا لأنها تدور بالماء أسهل دور .\nووجه الآية في الفلك : تسخير الله إياها حتى تجري على وجه الماء ووقوفها فوقه مع ثقلها . وأول من عملها نوح عليه السلام كما أخبر تعالى ، وقال له جبريل : اصنعها على جؤجؤ الطائر ، فعملها نوح عليه السلام وراثة في العالمين بما أراه جبريل . فالسفينة طائر مقلوب والماء في أسفلها نظير الهواء في أعلاها ، قاله ابن العربي .\nالرابعة : هذه الآية وما كان مثلها دليل على جواز ركوب البحر مطلقا لتجارة كان أو عبادة ، كالحج والجهاد . ومن السنة حديث أبي هريرة قال : جاء رجل إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، إنا نركب البحر ونحمل معنا القليل من الماء . الحديث . وحديث أنس بن مالك في قصة أم حرام ، أخرجهما الأئمة : مالك وغيره . روى حديث أنس عنه جماعة عن إسحاق بن عبد الله بن أبي طلحة عن أنس ، ورواه بشر بن عمر عن مالك عن إسحاق عن أنس عن أم حرام جعله من مسند أم حرام لا من مسند أنس . هكذا حدث عنه به بندار محمد بن بشار ، ففيه دليل واضح على ركوب البحر في الجهاد للرجال والنساء ، وإذا جاز ركوبه للجهاد فركوبه للحج المفترض أولى وأوجب . وروي عن عمر بن الخطاب وعمر بن عبد العزيز رضي الله عنهما المنع من ركوبه . والقرآن والسنة يرد هذا القول ، ولو كان ركوبه يكره أو لا يجوز لنهى عنه النبي صلى الله عليه وسلم الذين قالوا له : إنا نركب البحر . وهذه الآية وما كان مثلها نص في الغرض وإليها المفزع . وقد تؤول ما روي عن العمرين في ذلك بأن ذلك محمول على الاحتياط وترك التغرير بالمهج في طلب الدنيا والاستكثار منها ، وأما في أداء الفرائض فلا . ومما يدل على جواز ركوبه من جهة المعنى أن الله تعالى ضرب البحر وسط الأرض وجعل الخلق في العدوتين ، وقسم المنافع بين الجهتين فلا يوصل إلى جلبها إلا بشق البحر لها ، فسهل الله سبيله بالفلك ، قاله ابن العربي . قال أبو عمر : وقد كان مالك يكره للمرأة الركوب للحج في البحر ، وهو للجهاد لذلك أكره . والقرآن والسنة يرد قوله ، إلا أن بعض أصحابنا من أهل البصرة قال : إنما كره ذلك مالك لأن السفن بالحجاز صغار ، وأن النساء لا يقدرن على الاستتار عند الخلاء فيها لضيقها وتزاحم الناس فيها ، وكان الطريق من المدينة إلى مكة على البر ممكنا ، فلذلك كره مالك ذلك . وأما السفن الكبار نحو سفن أهل البصرة فليس بذلك بأس . قال : والأصل أن الحج على كل من استطاع إليه سبيلا من الأحرار البالغين ، نساء كانوا أو رجالا ، إذا كان الأغلب من الطريق الأمن ، ولم يخص بحرا من بر .\nقلت : فدل الكتاب والسنة والمعنى على إباحة ركوبه للمعنيين جميعا : العبادة والتجارة ، فهي الحجة وفيها الأسوة . إلا أن الناس في ركوب البحر تختلف أحوالهم ، فرب راكب يسهل عليه ذلك ولا يشق ، وآخر يشق عليه ويضعف به ، كالمائد المفرط الميد ، ومن لم يقدر معه على أداء فرض الصلاة ونحوها من الفرائض ، فالأول ذلك له جائز ، والثاني يحرم عليه ويمنع منه . ولا خلاف بين أهل العلم وهي :\nالخامسة : إن البحر إذا ارتج لم يجز ركوبه لأحد بوجه من الوجوه في حين ارتجاجه ولا في الزمن الذي الأغلب فيه عدم السلامة ، وإنما يجوز عندهم ركوبه في زمن تكون السلامة فيه الأغلب ، فإن الذين يركبونه حال السلامة وينجون لا حاصر لهم ، والذين يهلكون فيه محصورون .\nالسادسة : قوله تعالى : بما ينفع الناس أي بالذي ينفعهم من التجارات وسائر المآرب التي تصلح بها أحوالهم . وبركوب البحر تكتسب الأرباح ، وينتفع من يحمل إليه المتاع أيضا . وقد قال بعض من طعن في الدين : إن الله تعالى يقول في كتابكم : ما فرطنا في الكتاب من شيء فأين ذكر التوابل المصلحة للطعام من الملح والفلفل وغير ذلك ؟ فقيل له في قوله : بما ينفع الناس .\nالسابعة : قوله تعالى : وما أنزل الله من السماء من ماء يعني بها الأمطار التي بها إنعاش العالم وإخراج النبات والأرزاق ، وجعل منه المخزون عدة للانتفاع في غير وقت نزوله ، كما قال تعالى : فأسكناه في الأرض .\nالثامنة : قوله تعالى : وبث فيها من كل دابة أي فرق ونشر ، ومنه كالفراش المبثوث ودابة تجمع الحيوان كله ، وقد أخرج بعض الناس الطير ، وهو مردود ، قال الله تعالى : وما من دابة في الأرض إلا على الله رزقها فإن الطير يدب على رجليه في بعض حالاته ، قال الأعشى :\nدبيب قطا البطحاء في كل منهل\nوقال علقمة بن عبدة :\nصواعقها لطيرهن دبيب\nالتاسعة : قوله تعالى : وتصريف الرياح تصريفها : إرسالها عقيما وملقحة ، وصرا ونصرا وهلاكا ، وحارة وباردة ، ولينة وعاصفة . وقيل : تصريفها إرسالها جنوبا وشمالا ، ودبورا وصبا ، ونكباء ، وهي التي تأتي بين مهبي ريحين . وقيل : تصريفها أن تأتي السفن الكبار بقدر ما تحملها ، والصغار كذلك ، ويصرف عنهما ما يضر بهما ، ولا اعتبار بكبر القلاع ولا صغرها ، فإن الريح لو جاءت جسدا واحدا لصدمت القلاع وأغرقت . والرياح جمع ريح سميت به لأنها تأتي بالروح غالبا . روى أبو داود عن أبي هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول : الريح من روح الله تأتي بالرحمة وتأتي بالعذاب فإذا رأيتموها فلا تسبوها واسألوا الله خيرها واستعيذوا بالله من شرها . وأخرجه أيضا ابن ماجه في سننه حدثنا أبو بكر بن أبي شيبة حدثنا يحيى بن سعيد عن الأوزاعي عن الزهري حدثنا ثابت الزرقي عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم : لا تسبوا الريح فإنها من روح الله تأتي بالرحمة والعذاب ولكن سلوا الله من خيرها وتعوذوا بالله من شرها . وروي عن النبي صلى الله عليه وسلم أنه قال : لا تسبوا الريح فإنها من نفس الرحمن . المعنى : أن الله تعالى جعل فيها التفريج والتنفيس والترويح ، والإضافة من طريق الفعل . والمعنى : أن الله تعالى جعلها كذلك . وفي صحيح مسلم عن ابن عباس عن النبي صلى الله عليه وسلم أنه قال : نصرت بالصبا وأهلكت عاد بالدبور . وهذا معنى ما جاء في الخبر أن الله سبحانه وتعالى فرج عن نبيه صلى الله عليه وسلم بالريح يوم الأحزاب ، فقال تعالى : فأرسلنا عليهم ريحا وجنودا لم تروها . ويقال : نفس الله عن فلان كربة من كرب الدنيا ، أي فرج عنه . وفي صحيح مسلم من حديث أبي هريرة رضي الله عنه : من نفس عن مسلم كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة . أي فرج عنه . وقال الشاعر :\nكأن الصبا ريح إذا ما تنسمت على كبد مهموم تجلت همومها\nقال ابن الأعرابي : النسيم أول هبوب الريح . وأصل الريح روح ، ولهذا قيل في جمع القلة أرواح ، ولا يقال : أرياح ; لأنها من ذوات الواو ، وإنما قيل : رياح من جهة الكثرة وطلب تناسب الياء معها . وفي مصحف حفصة \" وتصريف الأرواح \" .\nالعاشرة : وتصريف الرياح قرأ حمزة والكسائي \" الريح \" على الإفراد ، وكذا في الأعراف والكهف وإبراهيم والنمل والروم وفاطر والشورى والجاثية ، لا خلاف بينهما في ذلك . ووافقهما ابن كثير في الأعراف والنمل والروم وفاطر والشورى . وأفرد حمزة \" الريح لواقح \" . وأفرد ابن كثير \" وهو الذي أرسل الريح \" في الفرقان وقرأ الباقون بالجمع في جميعها سوى الذي في إبراهيم والشورى فلم يقرأهما بالجمع سوى نافع ولم يختلف السبعة فيما سوى هذه المواضع . والذي ذكرناه في الروم هو الثاني الله الذي يرسل الرياح . ولا خلاف بينهم في الرياح مبشرات . وكان أبو جعفر يزيد بن القعقاع يجمع الرياح إذا كان فيها ألف ولام في جميع القرآن ، سوى تهوي به الريح والريح العقيم فإن لم يكن فيه ألف ولام أفرد . فمن وحد الريح فلأنه اسم للجنس يدل على القليل والكثير . ومن جمع فلاختلاف الجهات التي تهب منها الرياح . ومن جمع مع الرحمة ووحد مع العذاب فإنه فعل ذلك اعتبارا بالأغلب في القرآن ، نحو : الرياح مبشرات والريح العقيم فجاءت في القرآن مجموعة مع الرحمة مفردة مع العذاب ، إلا في يونس في قوله : وجرين بهم بريح طيبة . وروي أن رسول الله صلى الله عليه وسلم كان يقول إذا هبت الريح : اللهم اجعلها رياحا ولا تجعلها ريحا . وذلك لأن ريح العذاب شديدة ملتئمة الأجزاء كأنها جسم واحد ، وريح الرحمة لينة متقطعة فلذلك هي رياح . فأفردت مع الفلك في \" يونس \" ; لأن ريح إجراء السفن إنما هي ريح واحدة متصلة ثم وصفت بالطيب فزال الاشتراك بينها وبين ريح العذاب .\nالحادية عشرة : قال العلماء : الريح تحرك الهواء ، وقد يشتد ويضعف . فإذا بدت حركة الهواء من تجاه القبلة ذاهبة إلى سمت القبلة قيل لتلك الريح : \" الصبا \" . وإذا بدت حركة الهواء من وراء القبلة وكانت ذاهبة إلى تجاه القبلة قيل لتلك الريح : \" الدبور \" . وإذا بدت حركة الهواء عن يمين القبلة ذاهبة إلى يسارها قيل لها : \" ريح الجنوب \" . وإذا بدت حركة الهواء عن يسار القبلة ذاهبة إلى يمينها قيل لها : \" ريح الشمال \" . ولكل واحدة من هذه الرياح طبع ، فتكون منفعتها بحسب طبعها ، فالصبا حارة يابسة ، والدبور باردة رطبة ، والجنوب حارة رطبة ، والشمال باردة يابسة . واختلاف طباعها كاختلاف طبائع فصول السنة . وذلك أن الله تعالى وضع للزمان أربعة فصول مرجعها إلى تغيير أحوال الهواء ، فجعل الربيع الذي هو أول الفصول حارا رطبا ، ورتب فيه النشء والنمو فتنزل فيه المياه ، وتخرج الأرض زهرتها وتظهر نباتها ، ويأخذ الناس في غرس الأشجار وكثير من الزرع ، وتتوالد فيه الحيوانات وتكثر الألبان . فإذا انقضى الربيع تلاه الصيف الذي هو مشاكل للربيع في إحدى طبيعتيه وهي الحرارة ، ومباين له في الأخرى وهي الرطوبة ; لأن الهواء في الصيف حار يابس ، فتنضج فيه الثمار وتيبس فيه الحبوب المزروعة في الربيع . فإذا انقضى الصيف تبعه الخريف الذي هو مشاكل للصيف في إحدى طبيعتيه وهي اليبس ، ومباين له في الأخرى وهي الحرارة ; لأن الهواء في الخريف بارد يابس ، فيتناهى فيه صلاح الثمار وتيبس وتجف فتصير إلى حال الادخار ، فتقطف الثمار وتحصد الأعناب وتفرغ من جمعها الأشجار . فإذا انقضى الخريف تلاه الشتاء وهو ملائم للخريف في إحدى طبيعتيه وهي البرودة ، ومباين له في الأخرى وهو اليبس ; لأن الهواء في الشتاء بارد رطب ، فتكثر الأمطار والثلوج وتهمد الأرض كالجسد المستريح ، فلا تتحرك إلا أن يعيد الله تبارك وتعالى إليها حرارة الربيع ، فإذا اجتمعت مع الرطوبة كان عند ذلك النشء والنمو بإذن الله سبحانه وتعالى . وقد تهب رياح كثيرة سوى ما ذكرناه ، إلا أن الأصول هذه الأربع . فكل ريح تهب بين ريحين فحكمها حكم الريح التي تكون في هبوبها أقرب إلى مكانها وتسمى \" النكباء \" .\nالثانية عشرة : قوله تعالى : والسحاب المسخر بين السماء والأرض سمي السحاب سحابا لانسحابه في الهواء . وسحبت ذيلي سحبا . وتسحب فلان على فلان : اجترأ . والسحب : شدة الأكل والشرب . والمسخر : المذلل ، وتسخيره بعثه من مكان إلى آخر . وقيل : تسخيره ثبوته بين السماء والأرض من غير عمد ولا علائق ، والأول أظهر . وقد يكون بماء وبعذاب ، روى مسلم عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال : بينما رجل بفلاة من الأرض فسمع صوتا في سحابة اسق حديقة فلان فتنحى ذلك السحاب فأفرغ ماءه في حرة فإذا شرجة من تلك الشراج قد استوعبت ذلك الماء كله فتتبع الماء فإذا رجل قائم في حديقته يحول الماء بمسحاته فقال له يا عبد الله ما اسمك قال فلان للاسم الذي سمع في السحابة فقال له يا عبد الله لم تسألني عن اسمي فقال إني سمعت صوتا في السحاب الذي هذا ماؤه يقول اسق حديقة فلان لاسمك فما تصنع فيها ؟ قال أما إذ قلت هذا فإني أنظر إلى ما يخرج منها فأتصدق بثلثه وآكل أنا وعيالي ثلثا وأرد فيها ثلثه . وفي رواية وأجعل ثلثه في المساكين والسائلين وابن السبيل . وفي التنزيل : والله الذي أرسل الرياح فتثير سحابا فسقناه إلى بلد ميت ، وقال : حتى إذا أقلت سحابا ثقالا سقناه لبلد ميت وهو في التنزيل كثير . وخرج ابن ماجه عن عائشة أن النبي صلى الله عليه وسلم كان إذا رأى سحابا مقبلا من أفق من الآفاق ترك ما هو فيه وإن كان في صلاة حتى يستقبله فيقول : اللهم إنا نعوذ بك من شر ما أرسل به فإن أمطر قال : اللهم سيبا نافعا مرتين أو ثلاثا ، وإن كشفه الله ولم يمطر حمد الله على ذلك . أخرجه مسلم بمعناه عن عائشة زوج النبي صلى الله عليه وسلم قالت : كان رسول الله صلى الله عليه وسلم إذا كان يوم الريح والغيم عرف ذلك في وجهه وأقبل وأدبر ، فإذا مطرت سر به وذهب عنه ذلك . قالت عائشة : فسألته فقال : إني خشيت أن يكون عذابا سلط على أمتي . ويقول إذا رأى المطر : ( رحمة ) . في رواية فقال : لعله يا عائشة كما قال قوم عاد : فلما رأوه عارضا مستقبل أوديتهم قالوا هذا عارض ممطرنا . فهذه الأحاديث والآي تدل على صحة القول الأول وأن تسخيرها ليس ثبوتها ، والله تعالى أعلم . فإن الثبوت يدل على عدم الانتقال ، فإن أريد بالثبوت كونها في الهواء ليست في السماء ولا في الأرض فصحيح ، لقوله بين وهي مع ذلك مسخرة محمولة ، وذلك أعظم في القدرة ، كالطير في الهواء ، قال الله تعالى : ألم يروا إلى الطير مسخرات في جو السماء ما يمسكهن إلا الله وقال : أولم يروا إلى الطير فوقهم صافات ويقبضن ما يمسكهن إلا الرحمن .\nالثالثة عشرة : قال كعب الأحبار : السحاب غربال المطر ، لولا السحاب حين ينزل الماء من السماء لأفسد ما يقع عليه من الأرض ، رواه عنه ابن عباس . ذكره الخطيب أبو بكر أحمد بن علي عن معاذ بن عبد الله بن خبيب الجهني قال : رأيت ابن عباس مر على بغلة وأنا في بني سلمة فمر به تبيع ابن امرأة كعب فسلم على ابن عباس فسأله ابن عباس : هل سمعت كعب الأحبار يقول في السحاب شيئا ؟ قال : نعم ، قال : السحاب غربال المطر ، لولا السحاب حين ينزل الماء من السماء لأفسد ما يقع عليه من الأرض . قال : سمعت كعبا يقول في الأرض تنبت العام نباتا ، وتنبت عاما قابلا غيره ؟ قال نعم ، سمعته يقول : إن البذر ينزل من السماء . قال ابن عباس : وقد سمعت ذلك من كعب .\nالرابعة عشرة : لآيات أي دلالات تدل على وحدانيته وقدرته ، ولذلك ذكر هذه الأمور عقيب قوله : وإلهكم إله واحد ليدل على صدق الخبر عما ذكره قبلها من وحدانيته سبحانه ، وذكر رحمته ورأفته بخلقه . وروي عن النبي صلى الله عليه وسلم أنه قال : ويل لمن قرأ هذه الآية فمج بها أي لم يتفكر فيها ولم يعتبرها .\nفإن قيل : فما أنكرت أنها أحدثت أنفسها . قيل له : هذا محال ; لأنها لو أحدثت أنفسها لم تخل من أن تكون أحدثتها وهي موجودة أو هي معدومة ، فإن أحدثتها وهي معدومة كان محالا ، لأن الإحداث لا يتأتى إلا من حي عالم قادر مريد ، وما ليس بموجود لا يصح وصفه بذلك ، وإن كانت موجودة فوجودها يغني عن إحداث أنفسها . وأيضا فلو جاز ما قالوه لجاز أن يحدث البناء نفسه وكذلك النجارة والنسج ، وذلك محال ، وما أدى إلى المحال محال . ثم إن الله تعالى لم يقتصر بها في وحدانيته على مجرد الأخبار حتى قرن ذلك بالنظر والاعتبار في آي من القرآن ، فقال لنبيه صلى الله عليه وسلم : قل انظروا ماذا في السماوات والأرض والخطاب للكفار ، لقوله تعالى : وما تغني الآيات والنذر عن قوم لا يؤمنون ، وقال : أولم ينظروا في ملكوت السماوات والأرض يعني بالملكوت الآيات . وقال : وفي أنفسكم أفلا تبصرون . يقول : أولم ينظروا في ذلك نظر تفكر وتدبر حتى يستدلوا بكونها محلا للحوادث والتغييرات على أنها محدثات ، وأن المحدث لا يستغني عن صانع يصنعه ، وأن ذلك الصانع حكيم عالم قدير مريد سميع بصير متكلم ، لأنه لو لم يكن بهذه الصفات لكان الإنسان أكمل منه وذلك محال . وقال تعالى : ولقد خلقنا الإنسان من سلالة من طين المؤمنون : 12 ] يعني آدم عليه السلام ، ثم جعلناه أي جعلنا نسله وذريته نطفة في قرار مكين إلى قوله تبعثون . فالإنسان إذا تفكر بهذا التنبيه بما جعل له من العقل في نفسه رآها مدبرة وعلى أحوال شتى مصرفة . كان نطفة ثم علقة ثم مضغة ثم لحما وعظما ، فيعلم أنه لم ينقل نفسه من حال النقص إلى حال الكمال ; لأنه لا يقدر على أن يحدث لنفسه في الحال الأفضل التي هي كمال عقله وبلوغ أشده عضوا من الأعضاء ، ولا يمكنه أن يزيد في جوارحه جارحة ، فيدله ذلك على أنه في حال نقصه وأوان ضعفه عن فعل ذلك أعجز . وقد يرى نفسه شابا ثم كهلا ثم شيخا وهو لم ينقل نفسه من حال الشباب والقوة إلى حال الشيخوخة والهرم ، ولا اختاره لنفسه ولا في وسعه أن يزايل حال المشيب ويراجع قوة الشباب ، فيعلم بذلك أنه ليس هو الذي فعل تلك الأفعال بنفسه ، وأن له صانعا صنعه وناقلا نقله من حال إلى حال ، ولولا ذلك لم تتبدل أحواله بلا ناقل ولا مدبر . وقال بعض الحكماء : إن كل شيء في العالم الكبير له نظير في العالم الصغير ، الذي هو بدن الإنسان ، ولذلك قال تعالى : لقد خلقنا الإنسان في أحسن تقويم وقال : وفي أنفسكم أفلا تبصرون . فحواس الإنسان أشرف من الكواكب المضيئة ، والسمع والبصر منها بمنزلة الشمس والقمر في إدراك المدركات بها ، وأعضاؤه تصير عند البلى ترابا من جنس الأرض ، وفيه من جنس الماء العرق وسائر رطوبات البدن ، ومن جنس الهواء فيه الروح والنفس ، ومن جنس النار فيه المرة الصفراء . وعروقه بمنزلة الأنهار في الأرض ، وكبده بمنزلة العيون التي تستمد منها الأنهار ; لأن العروق تستمد من الكبد . ومثانته بمنزلة البحر ، لانصباب ما في أوعية البدن إليها كما تنصب الأنهار إلى البحر . وعظامه بمنزلة الجبال التي هي أوتاد الأرض . وأعضاؤه كالأشجار ، فكما أن لكل شجر ورقا وثمرا فكذلك لكل عضو فعل أو أثر . والشعر على البدن بمنزلة النبات والحشيش على الأرض ثم إن الإنسان يحكي بلسانه كل صوت حيوان ، ويحاكي بأعضائه صنيع كل حيوان ، فهو العالم الصغير مع العالم الكبير مخلوق محدث لصانع واحد ، لا إله إلا هو .\n                                    ",
        "saadi": "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَٱلۡفُلۡكِ ٱلَّتِي تَجۡرِي فِي ٱلۡبَحۡرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖ وَتَصۡرِيفِ ٱلرِّيَٰحِ وَٱلسَّحَابِ ٱلۡمُسَخَّرِ بَيۡنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤٦١\n                                        \n                                        \n                                        \n                                        أخبر تعالى أن في هذه المخلوقات العظيمة, آيات أي: أدلة على وحدانية الباري وإلهيته، وعظيم سلطانه ورحمته وسائر صفاته، ولكنها { لِقَوْمٍ يَعْقِلُونَ } أي: لمن لهم عقول يعملونها فيما خلقت له، فعلى حسب ما منّ الله على عبده من العقل, ينتفع بالآيات ويعرفها بعقله وفكره وتدبُّره، ففي { خَلْقِ السَّمَاوَاتِ } في ارتفاعها واتساعها, وإحكامها, وإتقانها, وما جعل الله فيها من الشمس والقمر, والنجوم, وتنظيمها لمصالح العباد. وفي خلق { الْأَرْضِ } مهادا للخلق, يمكنهم القرار عليها والانتفاع بما عليها, والاعتبار. ما يدل ذلك على انفراد الله تعالى بالخلق والتدبير, وبيان قدرته العظيمة التي بها خلقها, وحكمته التي بها أتقنها, وأحسنها ونظمها, وعلمه ورحمته التي بها أودع ما أودع, من منافع الخلق ومصالحهم, وضروراتهم وحاجاتهم. وفي ذلك أبلغ الدليل على كماله, واستحقاقه أن يفرد بالعبادة, لانفراده بالخلق والتدبير, والقيام بشئون عباده { و } في { اخْتِلَافِ اللَّيْلِ وَالنَّهَارِ } وهو تعاقبهما على الدوام, إذا ذهب أحدهما, خلفه الآخر، وفي اختلافهما في الحر, والبرد, والتوسط, وفي الطول, والقصر, والتوسط, وما ينشأ عن ذلك من الفصول, التي بها انتظام مصالح بني آدم وحيواناتهم, وجميع ما على وجه الأرض, من أشجار ونوابت، كل ذلك بانتظام وتدبير, وتسخير, تنبهر له العقول, وتعجز عن إدراكه من الرجال الفحول, ما يدل ذلك على قدرة مصرفها, وعلمه وحكمته, ورحمته الواسعة, ولطفه الشامل, وتصريفه وتدبيره, الذي تفرد به, وعظمته, وعظمة ملكه وسلطانه, مما يوجب أن يؤله ويعبد, ويفرد بالمحبة والتعظيم, والخوف والرجاء, وبذل الجهد في محابه ومراضيه. { و } في { وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ } وهي السفن والمراكب ونحوها, مما ألهم الله عباده صنعتها, وخلق لهم من الآلات الداخلية والخارجية ما أقدرهم عليها. ثم سخر لها هذا البحر العظيم والرياح, التي تحملها بما فيها من الركاب والأموال, والبضائع التي هي من منافع الناس, وبما تقوم به مصالحهم وتنتظم معايشهم. فمن الذي ألهمهم صنعتها, وأقدرهم عليها, وخلق لهم من الآلات ما به يعملونها؟ أم من الذي سخر لها البحر, تجري فيه بإذنه وتسخيره, والرياح؟ أم من الذي خلق للمراكب البرية والبحرية, النار والمعادن المعينة على حملها, وحمل ما فيها من الأموال؟ فهل هذه الأمور, حصلت اتفاقا, أم استقل بعملها هذا المخلوق الضعيف العاجز, الذي خرج من بطن أمه, لا علم له ولا قدرة، ثم خلق له ربه القدرة, وعلمه ما يشاء تعليمه، أم المسخر لذلك رب واحد, حكيم عليم, لا يعجزه شيء, ولا يمتنع عليه شيء؟ بل الأشياء قد دانت لربوبيته, واستكانت لعظمته, وخضعت لجبروته. وغاية العبد الضعيف, أن جعله الله جزءا من أجزاء الأسباب, التي بها وجدت هذه الأمور العظام, فهذا يدل على رحمة الله وعنايته بخلقه, وذلك يوجب أن تكون المحبة كلها له, والخوف والرجاء, وجميع الطاعة, والذل والتعظيم. { وَمَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ مَاءٍ } وهو المطر النازل من السحاب. { فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا } فأظهرت من أنواع الأقوات, وأصناف النبات, ما هو من ضرورات الخلائق, التي لا يعيشون بدونها. أليس ذلك دليلا على قدرة من أنزله, وأخرج به ما أخرج ورحمته, ولطفه بعباده, وقيامه بمصالحهم, وشدة افتقارهم وضرورتهم إليه من كل وجه؟ أما يوجب ذلك أن يكون هو معبودهم وإلههم؟ أليس ذلك دليلا على إحياء الموتى ومجازاتهم بأعمالهم؟ { وَبَثَّ فِيهَا } أي: في الأرض { مِنْ كُلِّ دَابَّةٍ } أي: نشر في أقطار الأرض من الدواب المتنوعة, ما هو دليل على قدرته وعظمته, ووحدانيته وسلطانه العظيم، وسخرها للناس, ينتفعون بها بجميع وجوه الانتفاع. فمنها: ما يأكلون من لحمه, ويشربون من دره، ومنها: ما يركبون، ومنها: ما هو ساع في مصالحهم وحراستهم, ومنها: ما يعتبر به، ومع أنه بث فيها من كل دابة، فإنه سبحانه هو القائم بأرزاقهم, المتكفل بأقواتهم، فما من دابة في الأرض إلا على الله رزقها, ويعلم مستقرها ومستودعها. وفي { تَصْرِيفِ الرِّيَاحِ } باردة وحارة, وجنوبا وشمالا, وشرقا ودبورا وبين ذلك، وتارة تثير السحاب, وتارة تؤلف بينه, وتارة تلقحه, وتارة تدره, وتارة تمزقه وتزيل ضرره, وتارة تكون رحمة, وتارة ترسل بالعذاب. فمن الذي صرفها هذا التصريف, وأودع فيها من منافع العباد, ما لا يستغنون عنه؟ وسخرها ليعيش فيها جميع الحيوانات, وتصلح الأبدان والأشجار, والحبوب والنوابت, إلا العزيز الحكيم الرحيم, اللطيف بعباده المستحق لكل ذل وخضوع, ومحبة وإنابة وعبادة؟. وفي تسخير السحاب بين السماء والأرض على خفته ولطافته يحمل الماء الكثير, فيسوقه الله إلى حيث شاء، فيحيي به البلاد والعباد, ويروي التلول والوهاد, وينزله على الخلق وقت حاجتهم إليه، فإذا كان يضرهم كثرته, أمسكه عنهم, فينزله رحمة ولطفا, ويصرفه عناية وعطفا، فما أعظم سلطانه, وأغزر إحسانه, وألطف امتنانه\" أليس من القبيح بالعباد, أن يتمتعوا برزقه, ويعيشوا ببره وهم يستعينون بذلك على مساخطه ومعاصيه؟ أليس ذلك دليلا على حلمه وصبره, وعفوه وصفحه, وعميم لطفه؟ فله الحمد أولا وآخرا, وباطنا وظاهرا. والحاصل, أنه كلما تدبر العاقل في هذه المخلوقات, وتغلغل فكره في بدائع المبتدعات, وازداد تأمله للصنعة وما أودع فيها من لطائف البر والحكمة, علم بذلك, أنها خلقت للحق وبالحق, وأنها صحائف آيات, وكتب دلالات, على ما أخبر به الله عن نفسه ووحدانيته, وما أخبرت به الرسل من اليوم الآخر, وأنها مسخرات, ليس لها تدبير ولا استعصاء على مدبرها ومصرفها. فتعرف أن العالم العلوي والسفلي كلهم إليه مفتقرون, وإليه صامدون، وأنه الغني بالذات عن جميع المخلوقات، فلا إله إلا الله, ولا رب سواه.\n                                    "
      },
      "originalText": "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَٱلۡفُلۡكِ ٱلَّتِي تَجۡرِي فِي ٱلۡبَحۡرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖ وَتَصۡرِيفِ ٱلرِّيَٰحِ وَٱلسَّحَابِ ٱلۡمُسَخَّرِ بَيۡنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٤٦١"
    },
    {
      "number": 172,
      "text": "وَمِنَ النَّاسِ مَنْ يَتَّخِذُ مِنْ دُونِ اللَّهِ أَنْدَادًا يُحِبُّونَهُمْ كَحُبِّ اللَّهِ ۖ وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ ۗ وَلَوْ يَرَى الَّذِينَ ظَلَمُوا إِذْ يَرَوْنَ الْعَذَابَ أَنَّ الْقُوَّةَ لِلَّهِ جَمِيعًا وَأَنَّ اللَّهَ شَدِيدُ الْعَذَابِ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 165,
      "juz": 2,
      "manzil": 1,
      "page": 25,
      "ruku": 21,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادٗا يُحِبُّونَهُمۡ كَحُبِّ ٱللَّهِۖ وَٱلَّذِينَ ءَامَنُوٓاْ أَشَدُّ حُبّٗا لِّلَّهِۗ وَلَوۡ يَرَى ٱلَّذِينَ ظَلَمُوٓاْ إِذۡ يَرَوۡنَ ٱلۡعَذَابَ أَنَّ ٱلۡقُوَّةَ لِلَّهِ جَمِيعٗا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلۡعَذَابِ ٥٦١\n                                    \n                                    \n                                    يذكر تعالى حال المشركين به في الدنيا وما لهم في الدار الآخرة ، حيث جعلوا [ له ] أندادا ، أي : أمثالا ونظراء يعبدونهم معه ويحبونهم كحبه ، وهو الله لا إله إلا هو ، ولا ضد له ولا ند له ، ولا شريك معه . وفي الصحيحين عن عبد الله بن مسعود قال : قلت : يا رسول الله ، أي الذنب أعظم ؟ قال : \" أن تجعل لله ندا وهو خلقك \" .\nوقوله : ( والذين آمنوا أشد حبا لله ) ولحبهم لله وتمام معرفتهم به ، وتوقيرهم وتوحيدهم له ، لا يشركون به شيئا ، بل يعبدونه وحده ويتوكلون عليه ، ويلجئون في جميع أمورهم إليه . ثم توعد تعالى المشركين به ، الظالمين لأنفسهم بذلك فقال : ( ولو يرى الذين ظلموا إذ يرون العذاب أن القوة لله جميعا ) .\nقال بعضهم : تقدير الكلام : لو عاينوا العذاب لعلموا حينئذ أن القوة لله جميعا ، أي : إن الحكم له وحده لا شريك له ، وأن جميع الأشياء تحت قهره وغلبته وسلطانه ( وأن الله شديد العذاب ) كما قال : ( فيومئذ لا يعذب عذابه أحد ولا يوثق وثاقه أحد ) [ الفجر : 25 ، 26 ] يقول : لو علموا ما يعاينونه هنالك ، وما يحل بهم من الأمر الفظيع المنكر الهائل على شركهم وكفرهم ، لانتهوا عما هم فيه من الضلال .\n                                    ",
        "qortoby": "وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادٗا يُحِبُّونَهُمۡ كَحُبِّ ٱللَّهِۖ وَٱلَّذِينَ ءَامَنُوٓاْ أَشَدُّ حُبّٗا لِّلَّهِۗ وَلَوۡ يَرَى ٱلَّذِينَ ظَلَمُوٓاْ إِذۡ يَرَوۡنَ ٱلۡعَذَابَ أَنَّ ٱلۡقُوَّةَ لِلَّهِ جَمِيعٗا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلۡعَذَابِ ٥٦١\n                                    \n                                    \n                                    قوله تعالى : ومن الناس من يتخذ من دون الله أندادا يحبونهم كحب الله والذين آمنوا أشد حبا لله ولو يرى الذين ظلموا إذ يرون العذاب أن القوة لله جميعا وأن الله شديد العذاب\nلما أخبر الله سبحانه وتعالى في الآية قبل ما دل على وحدانيته وقدرته وعظم سلطانه أخبر أن مع هذه الآيات القاهرة لذوي العقول من يتخذ معه أندادا ، وواحدها ند ، وقد تقدم . والمراد الأوثان والأصنام التي كانوا يعبدونها كعبادة الله مع عجزها ، قاله مجاهد .\nقوله تعالى : يحبونهم كحب الله أي يحبون أصنامهم على الباطل كحب المؤمنين لله على الحق ، قاله المبرد ، وقال معناه الزجاج . أي أنهم مع عجز الأصنام يحبونهم كحب المؤمنين لله مع قدرته . وقال ابن عباس والسدي : المراد بالأنداد الرؤساء المتبعون ، يطيعونهم في معاصي الله . وجاء الضمير في يحبونهم على هذا على الأصل ، وعلى الأول جاء ضمير الأصنام ضمير من يعقل على غير الأصل . وقال ابن كيسان والزجاج أيضا : معنى يحبونهم كحب الله أي يسوون بين الأصنام وبين الله تعالى في المحبة . قال أبو إسحاق : وهذا القول الصحيح ، والدليل على صحته : والذين آمنوا أشد حبا لله وقرأ أبو رجاء يحبونهم بفتح الياء . وكذلك ما كان منه في القرآن ، وهي لغة ، يقال : حببت الرجل فهو محبوب . قال الفراء : أنشدني أبو تراب :\nأحب لحبها السودان حتى حببت لحبها سود الكلاب\nومن في قوله من يتخذ في موضع رفع بالابتداء ويتخذ على اللفظ ، ويجوز في غير القرآن \" يتخذون \" على المعنى ويحبونهم على المعنى و \" يحبهم \" على اللفظ ، وهو في موضع نصب على الحال من الضمير الذي في يتخذ أي محبين ، وإن شئت كان نعتا للأنداد ، أي محبوبة . والكاف من كحب نعت لمصدر محذوف ، أي يحبونهم حبا كحب الله . والذين آمنوا أشد حبا لله أي أشد من حب أهل الأوثان لأوثانهم والتابعين لمتبوعهم . وقيل : إنما قال والذين آمنوا أشد حبا لله لأن الله تعالى أحبهم أولا ثم أحبوه . ومن شهد له محبوبه بالمحبة كانت محبته أتم ، قال الله تعالى : يحبهم ويحبونه . وسيأتي بيان حب المؤمنين لله تعالى وحبه لهم في سورة \" آل عمران \" إن شاء الله تعالى .\nقوله تعالى : ولو يرى الذين ظلموا إذ يرون العذاب أن القوة لله جميعا وأن الله شديد العذاب قراءة أهل المدينة وأهل الشام بالتاء ، وأهل مكة وأهل الكوفة وأبو عمرو بالياء ، وهو اختيار أبي عبيد . وفي الآية إشكال وحذف ، فقال أبو عبيد : المعنى لو يرى الذين ظلموا في الدنيا عذاب الآخرة لعلموا حين يرونه أن القوة لله جميعا . ويرى على هذا من رؤية البصر . قال النحاس في كتاب \" معاني القرآن \" له : وهذا القول هو الذي عليه أهل التفسير . وقال في كتاب \" إعراب القرآن \" له : وروي عن محمد بن يزيد أنه قال : هذا التفسير الذي جاء به أبو عبيد بعيد ، وليست عبارته فيه بالجيدة ; لأنه يقدر : ولو يرى الذين ظلموا العذاب ، فكأنه يجعله مشكوكا فيه وقد أوجبه الله تعالى ، ولكن التقدير وهو قول الأخفش : ولو يرى الذين ظلموا أن القوة لله . ويرى بمعنى يعلم ، أي لو يعلمون حقيقة قوة الله عز وجل وشدة عذابه ، ف يرى واقعة على أن القوة لله ، وسدت مسد المفعولين . والذين فاعل يرى ، وجواب لو محذوف ، أي لتبينوا ضرر اتخاذهم الآلهة ، كما قال عز وجل . ولو ترى إذ وقفوا على ربهم ، ولو ترى إذ وقفوا على النار ولم يأت ل لو جواب . قال الزهري وقتادة : الإضمار أشد للوعيد ، ومثله قول القائل : لو رأيت فلانا والسياط تأخذه ومن قرأ بالتاء فالتقدير : ولو ترى يا محمد الذين ظلموا في حال رؤيتهم العذاب وفزعهم منه واستعظامهم له لأقروا أن القوة لله ، فالجواب مضمر على هذا النحو من المعنى وهو العامل في أن . وتقدير آخر : ولو ترى يا محمد الذين ظلموا في حال رؤيتهم العذاب وفزعهم منه لعلمت أن القوة لله جميعا . وقد كان النبي صلى الله عليه وسلم علم ذلك ، ولكن خوطب والمراد أمته ، فإن فيهم من يحتاج إلى تقوية علمه بمشاهدة مثل هذا . ويجوز أن يكون المعنى : قل يا محمد للظالم هذا . وقيل : أن في موضع نصب مفعول من أجله ، أي لأن القوة لله جميعا . وأنشد سيبويه :\nوأغفر عوراء الكريم ادخاره وأعرض عن شتم اللئيم تكرما\nأي لادخاره ، والمعنى : ولو ترى يا محمد الذين ظلموا في حال رؤيتهم للعذاب لأن القوة لله لعلمت مبلغهم من النكال ولاستعظمت ما حل بهم . ودخلت \" إذ \" وهي لما مضى في إثبات هذه المستقبلات تقريبا للأمر وتصحيحا لوقوعه . وقرأ ابن عامر وحده \" يرون \" بضم الياء ، والباقون بفتحها . وقرأ الحسن ويعقوب وشيبة وسلام وأبو جعفر \" إن القوة ، و \" إن الله \" بكسر الهمزة فيهما على الاستئناف أو على تقدير القول ، أي ولو ترى الذين ظلموا إذ يرون العذاب يقولون إن القوة لله . وثبت بنص هذه الآية القوة لله ، بخلاف قول المعتزلة في نفيهم معاني الصفات القديمة ، تعالى الله عن قولهم .\n                                    ",
        "saadi": "وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادٗا يُحِبُّونَهُمۡ كَحُبِّ ٱللَّهِۖ وَٱلَّذِينَ ءَامَنُوٓاْ أَشَدُّ حُبّٗا لِّلَّهِۗ وَلَوۡ يَرَى ٱلَّذِينَ ظَلَمُوٓاْ إِذۡ يَرَوۡنَ ٱلۡعَذَابَ أَنَّ ٱلۡقُوَّةَ لِلَّهِ جَمِيعٗا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلۡعَذَابِ ٥٦١\n                                        \n                                        \n                                        \n                                        ما أحسن اتصال هذه الآية بما قبلها، فإنه تعالى, لما بين وحدانيته وأدلتها القاطعة, وبراهينها الساطعة الموصلة إلى علم اليقين, المزيلة لكل شك، ذكر هنا أن { مِنَ النَّاسِ } مع هذا البيان التام من يتخذ من المخلوقين أندادا لله أي: نظراء ومثلاء, يساويهم في الله بالعبادة والمحبة, والتعظيم والطاعة. ومن كان بهذه الحالة - بعد إقامة الحجة, وبيان التوحيد - علم أنه معاند لله, مشاق له, أو معرض عن تدبر آياته والتفكر في مخلوقاته, فليس له أدنى عذر في ذلك, بل قد حقت عليه كلمة العذاب. وهؤلاء الذين يتخذون الأنداد مع الله, لا يسوونهم بالله في الخلق والرزق والتدبير, وإنما يسوونهم به في العبادة, فيعبدونهم، ليقربوهم إليه، وفي قوله: { اتخذوا } دليل على أنه ليس لله ند وإنما المشركون جعلوا بعض المخلوقات أندادا له, تسمية مجردة, ولفظا فارغا من المعنى، كما قال تعالى: { وَجَعَلُوا لِلَّهِ شُرَكَاءَ قُلْ سَمُّوهُمْ أَمْ تُنَبِّئُونَهُ بِمَا لَا يَعْلَمُ فِي الْأَرْضِ أَمْ بِظَاهِرٍ مِنَ الْقَوْلِ } { إِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا أَنْتُمْ وَآبَاؤُكُمْ مَا أَنْزَلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ } فالمخلوق ليس ندا لله لأن الله هو الخالق, وغيره مخلوق, والرب الرازق ومن عداه مرزوق, والله هو الغني وأنتم الفقراء، وهو الكامل من كل الوجوه, والعبيد ناقصون من جميع الوجوه، والله هو النافع الضار, والمخلوق ليس له من النفع والضر والأمر شيء، فعلم علما يقينا, بطلان قول من اتخذ من دون الله آلهة وأندادا، سواء كان ملكا أو نبيا, أو صالحا, صنما, أو غير ذلك، وأن الله هو المستحق للمحبة الكاملة, والذل التام، فلهذا مدح الله المؤمنين بقوله: { وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ } أي: من أهل الأنداد لأندادهم, لأنهم أخلصوا محبتهم له, وهؤلاء أشركوا بها، ولأنهم أحبوا من يستحق المحبة على الحقيقة, الذي محبته هي عين صلاح العبد وسعادته وفوزه، والمشركون أحبوا من لا يستحق من الحب شيئا, ومحبته عين شقاء العبد وفساده, وتشتت أمره. فلهذا توعدهم الله بقوله: { وَلَوْ يَرَى الَّذِينَ ظَلَمُوا } باتخاذ الأنداد والانقياد لغير رب العباد وظلموا الخلق بصدهم عن سبيل الله, وسعيهم فيما يضرهم. { إِذْ يَرَوْنَ الْعَذَابَ } أي: يوم القيامة عيانا بأبصارهم، { أَنَّ الْقُوَّةَ لِلَّهِ جَمِيعًا وَأَنَّ اللَّهَ شَدِيدُ الْعَذَابِ } أي: لعلموا علما جازما, أن القوة والقدرة لله كلها, وأن أندادهم ليس فيها من القوة شيء، فتبين لهم في ذلك اليوم ضعفها وعجزها, لا كما اشتبه عليهم في الدنيا, وظنوا أن لها من الأمر شيئا, وأنها تقربهم إليه وتوصلهم إليه، فخاب ظنهم, وبطل سعيهم, وحق عليهم شدة العذاب, ولم تدفع عنهم أندادهم شيئا, ولم تغن عنهم مثقال ذرة من النفع، بل يحصل لهم الضرر منها, من حيث ظنوا نفعها. وتبرأ المتبوعون من التابعين, وتقطعت بينهم الوصل, التي كانت في الدنيا, لأنها كانت لغير الله, وعلى غير أمر الله, ومتعلقة بالباطل الذي لا حقيقة له, فاضمحلت أعمالهم, وتلاشت أحوالهم، وتبين لهم أنهم كانوا كاذبين, وأن أعمالهم التي يؤملون نفعها وحصول نتيجتها, انقلبت عليهم حسرة وندامة, وأنهم خالدون في النار لا يخرجون منها أبدا، فهل بعد هذا الخسران خسران؟ ذلك بأنهم اتبعوا الباطل، فعملوا العمل الباطل ورجوا غير مرجو, وتعلقوا بغير متعلق, فبطلت الأعمال ببطلان متعلقها، ولما بطلت وقعت الحسرة بما فاتهم من الأمل فيها, فضرتهم غاية الضرر، وهذا بخلاف من تعلق بالله الملك الحق المبين, وأخلص العمل لوجهه, ورجا نفعه، فهذا قد وضع الحق في موضعه, فكانت أعماله حقا, لتعلقها بالحق, ففاز بنتيجة عمله, ووجد جزاءه عند ربه, غير منقطع كما قال تعالى: { الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَآمَنُوا بِمَا نُزِّلَ عَلَى مُحَمَّدٍ وَهُوَ الْحَقُّ مِنْ رَبِّهِمْ كَفَّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَأَصْلَحَ بَالَهُمْ ذَلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَبِّهِمْ كَذَلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثَالَهُمْ } وحينئذ يتمنى التابعون أن يردوا إلى الدنيا فيتبرأوا من متبوعيهم, بأن يتركوا الشرك بالله, ويقبلوا على إخلاص العمل لله، وهيهات, فات الأمر, وليس الوقت وقت إمهال وإنظار، ومع هذا, فهم كذبة, فلو ردوا لعادوا لما نهوا عنه، وإنما هو قول يقولونه, وأماني يتمنونها, حنقا وغيظا على المتبوعين لما تبرأوا منهم والذنب ذنبهم، فرأس المتبوعين على الشر, إبليس, ومع هذا يقول لأتباعه لما قضي الأمر { إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُكُمْ فَأَخْلَفْتُكُمْ وَمَا كَانَ لِي عَلَيْكُمْ مِنْ سُلْطَانٍ إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ }\n                                    "
      },
      "originalText": "وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادٗا يُحِبُّونَهُمۡ كَحُبِّ ٱللَّهِۖ وَٱلَّذِينَ ءَامَنُوٓاْ أَشَدُّ حُبّٗا لِّلَّهِۗ وَلَوۡ يَرَى ٱلَّذِينَ ظَلَمُوٓاْ إِذۡ يَرَوۡنَ ٱلۡعَذَابَ أَنَّ ٱلۡقُوَّةَ لِلَّهِ جَمِيعٗا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلۡعَذَابِ ٥٦١"
    },
    {
      "number": 173,
      "text": "إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا مِنَ الَّذِينَ اتَّبَعُوا وَرَأَوُا الْعَذَابَ وَتَقَطَّعَتْ بِهِمُ الْأَسْبَابُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 166,
      "juz": 2,
      "manzil": 1,
      "page": 25,
      "ruku": 21,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ مِنَ ٱلَّذِينَ ٱتَّبَعُواْ وَرَأَوُاْ ٱلۡعَذَابَ وَتَقَطَّعَتۡ بِهِمُ ٱلۡأَسۡبَابُ ٦٦١\n                                    \n                                    \n                                    ثم أخبر عن كفرهم بأوثانهم وتبرؤ المتبوعين من التابعين ، فقال : ( إذ تبرأ الذين اتبعوا من الذين اتبعوا [ ورأوا العذاب وتقطعت بهم الأسباب ] ) تبرأت منهم الملائكة الذين كانوا يزعمون أنهم يعبدونهم في دار الدنيا ، فتقول الملائكة : ( تبرأنا إليك ما كانوا إيانا يعبدون ) [ القصص : 63 ] ويقولون : ( سبحانك أنت ولينا من دونهم بل كانوا يعبدون الجن أكثرهم بهم مؤمنون ) [ سبأ : 41 ] والجن أيضا تتبرأ منهم ، ويتنصلون من عبادتهم لهم ، كما قال تعالى : ( ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين ) [ الأحقاف : 5 ، 6 ] وقال تعالى : ( واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا ) [ مريم : 81 ، 82 ] وقال الخليل لقومه : ( إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين ) [ العنكبوت : 25 ] وقال تعالى : ( ولو ترى إذ الظالمون موقوفون عند ربهم يرجع بعضهم إلى بعض القول يقول الذين استضعفوا للذين استكبروا لولا أنتم لكنا مؤمنين قال الذين استكبروا للذين استضعفوا أنحن صددناكم عن الهدى بعد إذ جاءكم بل كنتم مجرمين وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا وأسروا الندامة لما رأوا العذاب وجعلنا الأغلال في أعناق الذين كفروا هل يجزون إلا ما كانوا يعملون ) [ سبأ : 31 - 33 ] وقال تعالى : ( وقال الشيطان لما قضي الأمر إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ما أنا بمصرخكم وما أنتم بمصرخي إني كفرت بما أشركتمون من قبل إن الظالمين لهم عذاب أليم ) [ إبراهيم : 22 ] .\nوقوله : ( ورأوا العذاب وتقطعت بهم الأسباب ) أي : عاينوا عذاب الله ، وتقطعت بهم الحيل وأسباب الخلاص ولم يجدوا عن النار معدلا ولا مصرفا .\nقال عطاء عن ابن عباس : ( وتقطعت بهم الأسباب ) قال : المودة . وكذا قال مجاهد في رواية ابن أبي نجيح .\n                                    ",
        "qortoby": "إِذۡ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ مِنَ ٱلَّذِينَ ٱتَّبَعُواْ وَرَأَوُاْ ٱلۡعَذَابَ وَتَقَطَّعَتۡ بِهِمُ ٱلۡأَسۡبَابُ ٦٦١\n                                    \n                                    \n                                    قوله تعالى : إذ تبرأ الذين اتبعوا من الذين اتبعوا ورأوا العذاب وتقطعت بهم الأسباب\nقوله تعالى : إذ تبرأ الذين اتبعوا يعني السادة والرؤساء تبرءوا ممن اتبعهم على الكفر . عن قتادة وعطاء والربيع . وقال قتادة أيضا والسدي : هم الشياطين المضلون تبرءوا من الإنس . وقيل : هو عام في كل متبوع . ورأوا العذاب يعني التابعين والمتبوعين ، قيل : بتيقنهم له عند المعاينة في الدنيا . وقيل : عند العرض والمساءلة في الآخرة .\nقلت : كلاهما حاصل ، فهم يعاينون عند الموت ما يصيرون إليه من الهوان ، وفي الآخرة يذوقون أليم العذاب والنكال .\nقوله تعالى : وتقطعت بهم الأسباب أي الوصلات التي كانوا يتواصلون بها في الدنيا من رحم وغيره ، عن مجاهد وغيره . الواحد سبب ووصلة . وأصل السبب الحبل يشد بالشيء فيجذبه ، ثم جعل كل ما جر شيئا سببا . وقال السدي وابن زيد : إن الأسباب أعمالهم . والسبب الناحية ، ومنه قول زهير :\nومن هاب أسباب المنايا ينلنه وإن يرق أسباب السماء بسلم\n                                    ",
        "saadi": "إِذۡ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ مِنَ ٱلَّذِينَ ٱتَّبَعُواْ وَرَأَوُاْ ٱلۡعَذَابَ وَتَقَطَّعَتۡ بِهِمُ ٱلۡأَسۡبَابُ ٦٦١\n                                        \n                                        \n                                        \n                                        وتبرأ المتبوعون من التابعين, وتقطعت بينهم الوصل, التي كانت في الدنيا, لأنها كانت لغير الله, وعلى غير أمر الله, ومتعلقة بالباطل الذي لا حقيقة له, فاضمحلت أعمالهم, وتلاشت أحوالهم، وتبين لهم أنهم كانوا كاذبين, وأن أعمالهم التي يؤملون نفعها وحصول نتيجتها, انقلبت عليهم حسرة وندامة, وأنهم خالدون في النار لا يخرجون منها أبدا، فهل بعد هذا الخسران خسران؟ ذلك بأنهم اتبعوا الباطل، فعملوا العمل الباطل ورجوا غير مرجو, وتعلقوا بغير متعلق, فبطلت الأعمال ببطلان متعلقها، ولما بطلت وقعت الحسرة بما فاتهم من الأمل فيها, فضرتهم غاية الضرر، وهذا بخلاف من تعلق بالله الملك الحق المبين, وأخلص العمل لوجهه, ورجا نفعه، فهذا قد وضع الحق في موضعه, فكانت أعماله حقا, لتعلقها بالحق, ففاز بنتيجة عمله, ووجد جزاءه عند ربه, غير منقطع كما قال تعالى: { الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ أَضَلَّ أَعْمَالَهُمْ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَآمَنُوا بِمَا نُزِّلَ عَلَى مُحَمَّدٍ وَهُوَ الْحَقُّ مِنْ رَبِّهِمْ كَفَّرَ عَنْهُمْ سَيِّئَاتِهِمْ وَأَصْلَحَ بَالَهُمْ ذَلِكَ بِأَنَّ الَّذِينَ كَفَرُوا اتَّبَعُوا الْبَاطِلَ وَأَنَّ الَّذِينَ آمَنُوا اتَّبَعُوا الْحَقَّ مِنْ رَبِّهِمْ كَذَلِكَ يَضْرِبُ اللَّهُ لِلنَّاسِ أَمْثَالَهُمْ }\n                                    "
      },
      "originalText": "إِذۡ تَبَرَّأَ ٱلَّذِينَ ٱتُّبِعُواْ مِنَ ٱلَّذِينَ ٱتَّبَعُواْ وَرَأَوُاْ ٱلۡعَذَابَ وَتَقَطَّعَتۡ بِهِمُ ٱلۡأَسۡبَابُ ٦٦١"
    },
    {
      "number": 174,
      "text": "وَقَالَ الَّذِينَ اتَّبَعُوا لَوْ أَنَّ لَنَا كَرَّةً فَنَتَبَرَّأَ مِنْهُمْ كَمَا تَبَرَّءُوا مِنَّا ۗ كَذَٰلِكَ يُرِيهِمُ اللَّهُ أَعْمَالَهُمْ حَسَرَاتٍ عَلَيْهِمْ ۖ وَمَا هُمْ بِخَارِجِينَ مِنَ النَّارِ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 167,
      "juz": 2,
      "manzil": 1,
      "page": 25,
      "ruku": 21,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ ٱلَّذِينَ ٱتَّبَعُواْ لَوۡ أَنَّ لَنَا كَرَّةٗ فَنَتَبَرَّأَ مِنۡهُمۡ كَمَا تَبَرَّءُواْ مِنَّاۗ كَذَٰلِكَ يُرِيهِمُ ٱللَّهُ أَعۡمَٰلَهُمۡ حَسَرَٰتٍ عَلَيۡهِمۡۖ وَمَا هُم بِخَٰرِجِينَ مِنَ ٱلنَّارِ ٧٦١\n                                    \n                                    \n                                    وقوله : ( وقال الذين اتبعوا لو أن لنا كرة فنتبرأ منهم كما تبرءوا منا ) أي : لو أن لنا عودة إلى الدار الدنيا حتى نتبرأ من هؤلاء ومن عبادتهم ، فلا نلتفت إليهم ، بل نوحد الله وحده بالعبادة . وهم كاذبون في هذا ، بل لو ردوا لعادوا لما نهوا عنه . كما أخبر الله تعالى عنهم بذلك ; ولهذا قال : ( كذلك يريهم الله أعمالهم حسرات عليهم وما هم بخارجين من النار ) أي : تذهب وتضمحل كما قال الله تعالى : ( وقدمنا إلى ما عملوا من عمل فجعلناه هباء منثورا ) [ الفرقان : 23 ] .\nوقال تعالى : ( مثل الذين كفروا بربهم أعمالهم كرماد اشتدت به الريح في يوم عاصف ) الآية [ إبراهيم : 18 ] ، وقال تعالى : ( والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء ) الآية [ النور : 39 ] ، ولهذا قال تعالى : ( وما هم بخارجين من النار ) .\n                                    ",
        "qortoby": "وَقَالَ ٱلَّذِينَ ٱتَّبَعُواْ لَوۡ أَنَّ لَنَا كَرَّةٗ فَنَتَبَرَّأَ مِنۡهُمۡ كَمَا تَبَرَّءُواْ مِنَّاۗ كَذَٰلِكَ يُرِيهِمُ ٱللَّهُ أَعۡمَٰلَهُمۡ حَسَرَٰتٍ عَلَيۡهِمۡۖ وَمَا هُم بِخَٰرِجِينَ مِنَ ٱلنَّارِ ٧٦١\n                                    \n                                    \n                                    قوله تعالى : وقال الذين اتبعوا لو أن لنا كرة فنتبرأ منهم كما تبرءوا منا كذلك يريهم الله أعمالهم حسرات عليهم وما هم بخارجين من النار\nقوله تعالى : وقال الذين اتبعوا لو أن لنا كرة أن في موضع رفع ، أي لو ثبت أن لنا رجعة فنتبرأ منهم جواب التمني . والكرة : الرجعة والعودة إلى حال قد كانت ، أي قال الأتباع : لو رددنا إلى الدنيا حتى نعمل صالحا ونتبرأ منهم كما تبرءوا منا أي تبرؤا كما ، فالكاف في موضع نصب على النعت لمصدر محذوف . ويجوز أن يكون نصبا على الحال ، تقديرها متبرئين ، والتبرؤ الانفصال .\nقوله تعالى : كذلك يريهم الله أعمالهم حسرات عليهم الكاف في موضع رفع ، أي الأمر كذلك . أي كما أراهم الله العذاب كذلك يريهم الله أعمالهم . ويريهم الله قيل : هي ، من رؤية البصر ، فيكون متعديا لمفعولين : الأول الهاء والميم في يريهم ، والثاني أعمالهم ، وتكون حسرات حالا . ويحتمل أن يكون من رؤية القلب ، فتكون حسرات المفعول الثالث . أعمالهم قال الربيع : أي الأعمال الفاسدة التي ارتكبوها فوجبت لهم بها النار . وقال ابن مسعود والسدي : الأعمال الصالحة التي تركوها ففاتتهم الجنة ، ورويت في هذا القول أحاديث . قال السدي : ترفع لهم الجنة فينظرون إليها وإلى بيوتهم فيها لو أطاعوا الله تعالى ، ثم تقسم بين المؤمنين فذلك حين يندمون . وأضيفت هذه الأعمال إليهم من حيث هم مأمورون بها ، وأما إضافة الأعمال الفاسدة إليهم فمن حيث عملوها . والحسرة واحدة الحسرات ، كتمرة وتمرات ، وجفنة وجفنات ، وشهوة وشهوات . هذا إذا كان اسما ، فإن نعته سكنت ، كقولك : ضخمة وضخمات ، وعبلة وعبلات . والحسرة أعلى درجات الندامة على شيء فائت . والتحسر : التلهف ، يقال : حسرت عليه ( بالكسر ) أحسر حسرا وحسرة . وهي مشتقة من الشيء الحسير الذي قد انقطع وذهبت قوته ، كالبعير إذا عيي .\nوقيل : هي مشتقة من حسر إذا كشف ، ومنه الحاسر في الحرب : الذي لا درع معه . والانحسار : الانكشاف .\nقوله تعالى : وما هم بخارجين من النار دليل على خلود الكفار فيها وأنهم لا يخرجون منها . وهذا قول جماعة أهل السنة ، لهذه الآية ولقوله تعالى : ولا يدخلون الجنة حتى يلج الجمل في سم الخياط . وسيأتي .\n                                    ",
        "saadi": "وَقَالَ ٱلَّذِينَ ٱتَّبَعُواْ لَوۡ أَنَّ لَنَا كَرَّةٗ فَنَتَبَرَّأَ مِنۡهُمۡ كَمَا تَبَرَّءُواْ مِنَّاۗ كَذَٰلِكَ يُرِيهِمُ ٱللَّهُ أَعۡمَٰلَهُمۡ حَسَرَٰتٍ عَلَيۡهِمۡۖ وَمَا هُم بِخَٰرِجِينَ مِنَ ٱلنَّارِ ٧٦١\n                                        \n                                        \n                                        \n                                        وحينئذ يتمنى التابعون أن يردوا إلى الدنيا فيتبرأوا من متبوعيهم, بأن يتركوا الشرك بالله, ويقبلوا على إخلاص العمل لله، وهيهات, فات الأمر, وليس الوقت وقت إمهال وإنظار، ومع هذا, فهم كذبة, فلو ردوا لعادوا لما نهوا عنه، وإنما هو قول يقولونه, وأماني يتمنونها, حنقا وغيظا على المتبوعين لما تبرأوا منهم والذنب ذنبهم، فرأس المتبوعين على الشر, إبليس, ومع هذا يقول لأتباعه لما قضي الأمر { إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُكُمْ فَأَخْلَفْتُكُمْ وَمَا كَانَ لِي عَلَيْكُمْ مِنْ سُلْطَانٍ إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ }\n                                    "
      },
      "originalText": "وَقَالَ ٱلَّذِينَ ٱتَّبَعُواْ لَوۡ أَنَّ لَنَا كَرَّةٗ فَنَتَبَرَّأَ مِنۡهُمۡ كَمَا تَبَرَّءُواْ مِنَّاۗ كَذَٰلِكَ يُرِيهِمُ ٱللَّهُ أَعۡمَٰلَهُمۡ حَسَرَٰتٍ عَلَيۡهِمۡۖ وَمَا هُم بِخَٰرِجِينَ مِنَ ٱلنَّارِ ٧٦١"
    },
    {
      "number": 175,
      "text": "يَا أَيُّهَا النَّاسُ كُلُوا مِمَّا فِي الْأَرْضِ حَلَالًا طَيِّبًا وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ ۚ إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 168,
      "juz": 2,
      "manzil": 1,
      "page": 25,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّاسُ كُلُواْ مِمَّا فِي ٱلۡأَرۡضِ حَلَٰلٗا طَيِّبٗا وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٌ ٨٦١\n                                    \n                                    \n                                    ما بين تعالى أنه لا إله إلا هو ، وأنه المستقل بالخلق ، شرع يبين أنه الرزاق لجميع خلقه ، فذكر [ ذلك ] في مقام الامتنان أنه أباح لهم أن يأكلوا مما في الأرض في حال كونه حلالا من الله طيبا ، أي : مستطابا في نفسه غير ضار للأبدان ولا للعقول ، ونهاهم عن اتباع خطوات الشيطان ، وهي : طرائقه ومسالكه فيما أضل أتباعه فيه من تحريم البحائر والسوائب والوصائل ونحوها مما زينه لهم في جاهليتهم ، كما في حديث عياض بن حمار الذي في صحيح مسلم ، عن رسول الله صلى الله عليه وسلم أنه قال : \" يقول الله تعالى : إن كل ما أمنحه عبادي فهو لهم حلال \" وفيه : \" وإني خلقت عبادي حنفاء فجاءتهم الشياطين فاجتالتهم عن دينهم ، وحرمت عليهم ما أحللت لهم \" .\nوقال الحافظ أبو بكر بن مردويه : حدثنا سليمان بن أحمد ، حدثنا محمد بن عيسى بن شيبة المصري ، حدثنا الحسين بن عبد الرحمن الاحتياطي ، حدثنا أبو عبد الله الجوزجاني رفيق إبراهيم بن أدهم حدثنا ابن جريج ، عن عطاء ، عن ابن عباس قال : تليت هذه الآية عند النبي صلى الله عليه وسلم : ( ياأيها الناس كلوا مما في الأرض حلالا طيبا ) فقام سعد بن أبي وقاص ، فقال : يا رسول الله ، ادع الله أن يجعلني مستجاب الدعوة ، فقال . \" يا سعد ، أطب مطعمك تكن مستجاب الدعوة ، والذي نفس محمد بيده ، إن الرجل ليقذف اللقمة الحرام في جوفه ما يتقبل منه أربعين يوما ، وأيما عبد نبت لحمه من السحت والربا فالنار أولى به \" .\nوقوله : ( إنه لكم عدو مبين ) تنفير عنه وتحذير منه ، كما قال : ( إن الشيطان لكم عدو فاتخذوه عدوا إنما يدعو حزبه ليكونوا من أصحاب السعير ) [ فاطر : 6 ] وقال تعالى : ( أفتتخذونه وذريته أولياء من دوني وهم لكم عدو بئس للظالمين بدلا ) [ الكهف : 50 ] .\nوقال قتادة ، والسدي في قوله : ( ولا تتبعوا خطوات الشيطان ) كل معصية لله فهي من خطوات الشيطان .\nوقال عكرمة : هي نزغات الشيطان ، وقال مجاهد : خطاه ، أو قال : خطاياه .\nوقال أبو مجلز : هي النذور في المعاصي .\nوقال الشعبي : نذر رجل أن ينحر ابنه فأفتاه مسروق بذبح كبش . وقال : هذا من خطوات الشيطان .\nوقال أبو الضحى ، عن مسروق : أتى عبد الله بن مسعود بضرع وملح ، فجعل يأكل ، فاعتزل رجل من القوم ، فقال ابن مسعود : ناولوا صاحبكم . فقال : لا أريده . فقال : أصائم أنت ؟ قال : لا . قال : فما شأنك ؟ قال : حرمت أن آكل ضرعا أبدا . فقال ابن مسعود : هذا من خطوات الشيطان ، فاطعم وكفر عن يمينك .\nرواه ابن أبي حاتم ، وقال أيضا :\nحدثنا أبي ، حدثنا حسان بن عبد الله المصري ، عن سليمان التيمي ، عن أبي رافع ، قال : غضبت على امرأتي ، فقالت : هي يوما يهودية ويوما نصرانية ، وكل مملوك لها حر ، إن لم تطلق امرأتك . فأتيت عبد الله بن عمر فقال : إنما هذه من خطوات الشيطان . وكذلك قالت زينب بنت أم سلمة ، وهي يومئذ أفقه امرأة في المدينة . وأتيت عاصما وابن عمر فقالا مثل ذلك .\nوقال عبد بن حميد : حدثنا أبو نعيم عن شريك ، عن عبد الكريم ، عن عكرمة ، عن ابن عباس قال : ما كان من يمين أو نذر في غضب ، فهو من خطوات الشيطان ، وكفارته كفارة يمين .\n[ وقال سعيد بن داود في تفسيره : حدثنا عبادة بن عباد المهلبي عن عاصم الأحول ، عن عكرمة في رجل قال لغلامه : إن لم أجلدك مائة سوط فامرأته طالق ، قال : لا يجلد غلامه ، ولا تطلق امرأته ، هذا من خطوات الشيطان ] .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّاسُ كُلُواْ مِمَّا فِي ٱلۡأَرۡضِ حَلَٰلٗا طَيِّبٗا وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٌ ٨٦١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الناس كلوا مما في الأرض حلالا طيبا ولا تتبعوا خطوات الشيطان إنه لكم عدو مبين\nفيه أربع مسائل :\nالأولى : قوله تعالى : يا أيها الناس الآية . قيل : إنها نزلت في ثقيف وخزاعة وبني مدلج فيما حرموه على أنفسهم من الأنعام ، واللفظ عام . والطيب هنا الحلال ، فهو تأكيد لاختلاف اللفظ ، وهذا قول مالك في الطيب . وقال الشافعي : الطيب المستلذ ، فهو تنويع ، ولذلك يمنع أكل الحيوان القذر . وسيأتي بيان هذا في \" الأنعام \" و \" الأعراف \" إن شاء الله تعالى .\nالثانية : قوله تعالى : حلالا طيبا حلالا حال ، وقيل مفعول . وسمي الحلال حلالا لانحلال عقدة الخطر عنه . قال سهل بن عبد الله : النجاة في ثلاثة : أكل الحلال ، وأداء الفرائض ، والاقتداء بالنبي صلى الله عليه وسلم . وقال أبو عبد الله الساجي واسمه سعيد بن يزيد : خمس خصال بها تمام العلم ، وهي : معرفة الله عز وجل ، ومعرفة الحق وإخلاص العمل لله ، والعمل على السنة ، وأكل الحلال ، فإن فقدت واحدة لم يرفع العمل . قال سهل : ولا يصح أكل الحلال إلا بالعلم ، ولا يكون المال حلالا حتى يصفو من ست خصال : الربا والحرام والسحت - وهو اسم مجمل - والغلول والمكروه والشبهة .\nالثالثة : ولا تتبعوا نهي خطوات الشيطان \" خطوات \" جمع خطوة وخطوة بمعنى واحد . قال الفراء : الخطوات جمع خطوة ، بالفتح . وخطوة ( بالضم ) : ما بين القدمين . وقال الجوهري : وجمع القلة خطوات وخطوات وخطوات ، والكثير خطا . والخطوة ( بالفتح ) : المرة الواحدة ، والجمع خطوات ( بالتحريك ) وخطاء ، مثل ركوة وركاء ، قال امرؤ القيس :\nلها وثبات كوثب الظباء فواد خطاء وواد مطر\nوقرأ أبو السمال العدوي وعبيد بن عمير \" خطوات \" بفتح الخاء والطاء . وروي عن علي بن أبي طالب وقتادة والأعرج وعمرو بن ميمون والأعمش \" خطؤات \" بضم الخاء والطاء والهمزة على الواو . قال الأخفش : وذهبوا بهذه القراءة إلى أنها جمع خطيئة ، من الخطأ لا من الخطو . والمعنى على قراءة الجمهور : ولا تقفوا أثر الشيطان وعمله ، وما لم يرد به الشرع فهو منسوب إلى الشيطان . قال ابن عباس : خطوات الشيطان أعماله مجاهد : خطاياه . السدي : طاعته . أبو مجلز : هي النذور في المعاصي .\nقلت : والصحيح أن اللفظ عام في كل ما عدا السنن والشرائع من البدع والمعاصي . وتقدم القول في \" الشيطان \" مستوفى .\nالرابعة : قوله تعالى : إنه لكم عدو مبين أخبر تعالى بأن الشيطان عدو ، وخبره حق وصدق . فالواجب على العاقل أن يأخذ حذره من هذا العدو الذي قد أبان عداوته من زمن آدم وبذل نفسه وعمره في إفساد أحوال بني آدم وقد أمر الله تعالى بالحذر منه فقال جل من قائل : ولا تتبعوا خطوات الشيطان إنه لكم عدو مبين إنما يأمركم بالسوء والفحشاء وأن تقولوا على الله ما لا تعلمون وقال : الشيطان يعدكم الفقر ويأمركم بالفحشاء وقال : ويريد الشيطان أن يضلهم ضلالا بعيدا وقال : إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر ويصدكم عن ذكر الله وعن الصلاة فهل أنتم منتهون وقال : إنه عدو مضل مبين وقال : إن الشيطان لكم عدو فاتخذوه عدوا إنما يدعو حزبه ليكونوا من أصحاب السعير . وهذا غاية في التحذير ، ومثله في القرآن كثير . وقال عبد الله بن عمر : إن إبليس موثق في الأرض السفلى ، فإذا تحرك فإن كل شر في الأرض بين اثنين فصاعدا من تحركه . وخرج الترمذي من حديث أبي مالك الأشعري وفيه : وآمركم أن تذكروا الله فإن مثل ذلك كمثل رجل خرج العدو في أثره سراعا حتى إذا أتى على حصن حصين فأحرز نفسه منهم كذلك العبد لا يحرز نفسه من الشيطان إلا بذكر الله الحديث . وقال فيه : حديث حسن صحيح غريب .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّاسُ كُلُواْ مِمَّا فِي ٱلۡأَرۡضِ حَلَٰلٗا طَيِّبٗا وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٌ ٨٦١\n                                        \n                                        \n                                        \n                                        هذا خطاب للناس كلهم, مؤمنهم وكافرهم، فامتن عليهم بأن أمرهم أن يأكلوا من جميع ما في الأرض، من حبوب, وثمار, وفواكه, وحيوانات, حالة كونها { حَلَالًا } أي: محللا لكم تناوله، ليس بغصب ولا سرقة, ولا محصلا بمعاملة محرمة أو على وجه محرم، أو معينا على محرم. { طَيِّبًا } أي: ليس بخبيث, كالميتة والدم, ولحم الخنزير, والخبائث كلها، ففي هذه الآية, دليل على أن الأصل في الأعيان الإباحة، أكلا وانتفاعا, وأن المحرم نوعان: إما محرم لذاته, وهو الخبيث الذي هو ضد الطيب، وإما محرم لما عرض له, وهو المحرم لتعلق حق الله, أو حق عباده به, وهو ضد الحلال. وفيه دليل على أن الأكل بقدر ما يقيم البنية واجب, يأثم تاركه لظاهر الأمر، ولما أمرهم باتباع ما أمرهم به - إذ هو عين صلاحهم - نهاهم عن اتباع { خُطُوَاتِ الشَّيْطَانِ } أي: طرقه التي يأمر بها, وهي جميع المعاصي من كفر, وفسوق, وظلم، ويدخل في ذلك تحريم السوائب, والحام, ونحو ذلك، ويدخل فيه أيضا تناول المأكولات المحرمة، { إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ } أي: ظاهر العداوة, فلا يريد بأمركم إلا غشكم, وأن تكونوا من أصحاب السعير،\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّاسُ كُلُواْ مِمَّا فِي ٱلۡأَرۡضِ حَلَٰلٗا طَيِّبٗا وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٌ ٨٦١"
    },
    {
      "number": 176,
      "text": "إِنَّمَا يَأْمُرُكُمْ بِالسُّوءِ وَالْفَحْشَاءِ وَأَنْ تَقُولُوا عَلَى اللَّهِ مَا لَا تَعْلَمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 169,
      "juz": 2,
      "manzil": 1,
      "page": 25,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا يَأۡمُرُكُم بِٱلسُّوٓءِ وَٱلۡفَحۡشَآءِ وَأَن تَقُولُواْ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ ٩٦١\n                                    \n                                    \n                                    وقوله : ( إنما يأمركم بالسوء والفحشاء وأن تقولوا على الله ما لا تعلمون ) أي : إنما يأمركم عدوكم الشيطان بالأفعال السيئة ، وأغلظ منها الفاحشة كالزنا ونحوه ، وأغلظ من ذلك وهو القول على الله بلا علم ، فيدخل في هذا كل كافر وكل مبتدع أيضا .\n                                    ",
        "qortoby": "إِنَّمَا يَأۡمُرُكُم بِٱلسُّوٓءِ وَٱلۡفَحۡشَآءِ وَأَن تَقُولُواْ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ ٩٦١\n                                    \n                                    \n                                    قوله تعالى : إنما يأمركم بالسوء والفحشاء وأن تقولوا على الله ما لا تعلمون قوله تعالى : إنما يأمركم بالسوء والفحشاء سمي السوء سوءا لأنه يسوء صاحبه بسوء عواقبه . وهو مصدر ساءه يسوءه سوءا ومساءة إذا أحزنه . وسؤته فسيء إذا أحزنته فحزن ، قال الله تعالى : سيئت وجوه الذين كفروا . وقال الشاعر :\nإن يك هذا الدهر قد ساءني فطالما قد سرني الدهر الأمر عندي فيهما واحد\nلذاك شكر ولذاك صبر\nوالفحشاء أصله قبح المنظر ، كما قال :\nوجيد كجيد الريم ليس بفاحش\nثم استعملت اللفظة فيما يقبح من المعاني . والشرع هو الذي يحسن ويقبح ، فكل ما نهت عنه الشريعة فهو من الفحشاء . وقال مقاتل : إن كل ما في القرآن من ذكر الفحشاء فإنه الزنى ، إلا قوله : الشيطان يعدكم الفقر ويأمركم بالفحشاء فإنه منع الزكاة\nقلت : فعلى هذا قيل : السوء ما لا حد فيه ، والفحشاء ما فيه حد . وحكي عن ابن عباس وغيره ، والله تعالى أعلم .\nقوله تعالى : وأن تقولوا على الله ما لا تعلمون قال الطبري : يريد ما حرموا من البحيرة والسائبة ونحوها مما جعلوه شرعا . وأن تقولوا في موضع خفض عطفا على قوله تعالى : بالسوء والفحشاء .\n                                    ",
        "saadi": "إِنَّمَا يَأۡمُرُكُم بِٱلسُّوٓءِ وَٱلۡفَحۡشَآءِ وَأَن تَقُولُواْ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ ٩٦١\n                                        \n                                        \n                                        \n                                        فلم يكتف ربنا بنهينا عن اتباع خطواته, حتى أخبرنا - وهو أصدق القائلين - بعداوته الداعية للحذر منه, ثم لم يكتف بذلك, حتى أخبرنا بتفصيل ما يأمر به, وأنه أقبح الأشياء, وأعظمها مفسدة فقال: { إِنَّمَا يَأْمُرُكُمْ بِالسُّوءِ } أي: الشر الذي يسوء صاحبه, فيدخل في ذلك, جميع المعاصي، فيكون قوله: { وَالْفَحْشَاءِ } من باب عطف الخاص على العام؛ لأن الفحشاء من المعاصي, ما تناهى قبحه, كالزنا, وشرب الخمر, والقتل, والقذف, والبخل ونحو ذلك, مما يستفحشه من له عقل، { وَأَنْ تَقُولُوا عَلَى اللَّهِ مَا لَا تَعْلَمُونَ } فيدخل في ذلك, القول على الله بلا علم, في شرعه, وقدره، فمن وصف الله بغير ما وصف به نفسه, أو وصفه به رسوله, أو نفى عنه ما أثبته لنفسه, أو أثبت له ما نفاه عن نفسه, فقد قال على الله بلا علم، ومن زعم أن لله ندا, وأوثانا, تقرب من عبدها من الله, فقد قال على الله بلا علم، ومن قال: إن الله أحل كذا, أو حرم كذا, أو أمر بكذا, أو نهى عن كذا, بغير بصيرة, فقد قال على الله بلا علم، ومن قال: الله خلق هذا الصنف من المخلوقات, للعلة الفلانية بلا برهان له بذلك, فقد قال على الله بلا علم، ومن أعظم القول على الله بلا علم, أن يتأول المتأول كلامه, أو كلام رسوله, على معان اصطلح عليها طائفة من طوائف الضلال, ثم يقول: إن الله أرادها، فالقول على الله بلا علم, من أكبر المحرمات, وأشملها, وأكبر طرق الشيطان التي يدعو إليها, فهذه طرق الشيطان التي يدعو إليها هو وجنوده, ويبذلون مكرهم وخداعهم, على إغواء الخلق بما يقدرون عليه. وأما الله تعالى, فإنه يأمر بالعدل والإحسان, وإيتاء ذي القربى, وينهى عن الفحشاء والمنكر والبغي، فلينظر العبد نفسه, مع أي الداعيين هو, ومن أي الحزبين؟ أتتبع داعي الله الذي يريد لك الخير والسعادة الدنيوية والأخروية, الذي كل الفلاح بطاعته, وكل الفوز في خدمته, وجميع الأرباح في معاملة المنعم بالنعم الظاهرة والباطنة, الذي لا يأمر إلا بالخير, ولا ينهى إلا عن الشر، أم تتبع داعي الشيطان, الذي هو عدو الإنسان, الذي يريد لك الشر, ويسعى بجهده على إهلاكك في الدنيا والآخرة؟ الذي كل الشر في طاعته, وكل الخسران في ولايته، الذي لا يأمر إلا بشر, ولا ينهى إلا عن خير.\n                                    "
      },
      "originalText": "إِنَّمَا يَأۡمُرُكُم بِٱلسُّوٓءِ وَٱلۡفَحۡشَآءِ وَأَن تَقُولُواْ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ ٩٦١"
    }
  ]
}