{
  "number": 251,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 1721,
      "text": "لَهُ دَعْوَةُ الْحَقِّ ۖ وَالَّذِينَ يَدْعُونَ مِنْ دُونِهِ لَا يَسْتَجِيبُونَ لَهُمْ بِشَيْءٍ إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَالِغِهِ ۚ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 14,
      "juz": 13,
      "manzil": 3,
      "page": 251,
      "ruku": 206,
      "hizbQuarter": 100,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ ٤١\n                                    \n                                    \n                                    قال علي بن أبى طالب ، رضي الله عنه : ( له دعوة الحق ) قال : التوحيد . رواه ابن جرير .\nوقال ابن عباس ، وقتادة ، ومالك عن محمد بن المنكدر : ( له دعوة الحق ) [ قال ] لا إله إلا الله .\n( والذين يدعون من دونه ) أي : ومثل الذين يعبدون آلهة غير الله . ( كباسط كفيه إلى الماء ليبلغ فاه ) قال علي بن أبي طالب : كمثل الذي يتناول الماء من طرف البئر بيده ، وهو لا يناله أبدا بيده ، فكيف يبلغ فاه ؟ .\nوقال مجاهد : ( كباسط كفيه ) يدعو الماء بلسانه ، ويشير إليه [ بيده ] فلا يأتيه أبدا .\nوقيل : المراد كقابض يده على الماء ، فإنه لا يحكم منه على شيء ، كما قال الشاعر :\nفإني وإياكم وشوقا إليكم كقابض ماء لم تسقه أنامله\nوقال الآخر :\nفأصبحت مما كان بيني وبينها من الود مثل القابض الماء باليد\nومعنى الكلام : أن هذا الذي يبسط يده إلى الماء ، إما قابضا وإما متناولا له من بعد ، كما أنه لا ينتفع بالماء الذي لم يصل إلى فيه ، الذي جعله محلا للشرب ، فكذلك هؤلاء المشركون الذين يعبدون مع الله إلها غيره ، لا ينتفعون بهم أبدا في الدنيا ولا في الآخرة; ولهذا قال : ( وما دعاء الكافرين إلا في ضلال )\n                                    ",
        "qortoby": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ ٤١\n                                    \n                                    \n                                    قوله تعالى : له دعوة الحق والذين يدعون من دونه لا يستجيبون لهم بشيء إلا كباسط كفيه إلى الماء ليبلغ فاه وما هو ببالغه وما دعاء الكافرين إلا في ضلال\nقوله تعالى : له دعوة الحق أي لله دعوة الصدق . قال ابن عباس وقتادة وغيرهما : لا إله إلا الله . وقال الحسن : إن الله هو الحق ، فدعاؤه دعوة الحق . وقيل : إن الإخلاص في الدعاء هو دعوة الحق ; قال بعض المتأخرين . وقيل : دعوة الحق دعاؤه عند الخوف ; فإنه لا يدعى فيه إلا إياه . كما قال : ضل من تدعون إلا إياه ; قال الماوردي : وهو أشبه بسياق الآية ; لأنه قال : والذين يدعون من دونه\nوالذين يدعون من دونه يعني الأصنام والأوثان .\nلا يستجيبون لهم بشيء أي لا يستجيبون لهم دعاء ، ولا يسمعون لهم نداء .\nإلا كباسط كفيه إلى الماء ليبلغ فاه وما هو ببالغه ضرب الله - عز وجل - الماء مثلا ليأسهم من الإجابة لدعائهم ; لأن العرب تضرب لمن سعى فيما لا يدركه مثلا بالقابض الماء باليد ; قال :\nفأصبحت فيما كان بيني وبينها من الود مثل القابض الماء باليد\nوفي معنى هذا المثل ثلاثة أوجه أن الذي يدعو إلها من دون الله كالظمآن الذي يدعو الماء إلى فيه من بعيد يريد تناوله ولا يقدر عليه بلسانه ، ويشير إليه بيده فلا يأتيه أبدا ، لأن الماء لا يستجيب ، وما الماء ببالغ إليه ; قاله مجاهد .\nأنه كالظمآن الذي يرى خياله في الماء وقد بسط كفه فيه ليبلغ فاه وما هو ببالغه ، لكذب ظنه ، وفساد توهمه ; قاله ابن عباس . الثالث : أنه كباسط كفه إلى الماء ليقبض عليه فلا يجمد في كفه شيء منه . وزعم الفراء أن المراد بالماء هاهنا البئر ; لأنها معدن للماء ، وأن المثل كمن مد يده إلى البئر بغير رشاء ; وشاهده قول الشاعر :\nفإن الماء ماء أبي وجدي وبئري ذو حفرت وذو طويت\nقال علي - رضي الله عنه - : هو كالعطشان على شفة البئر ، فلا يبلغ قعر البئر ، ولا الماء يرتفع إليه ، ومعنى إلا كباسط إلا كاستجابة باسط كفيه إلى الماء فالمصدر مضاف إلى الباسط ، ثم حذف المضاف ; وفاعل المصدر المضاف مراد في المعنى وهو الماء ; والمعنى : إلا كإجابة باسط كفيه إلى الماء ; واللام في قوله : ليبلغ فاه متعلقة بالبسط ، وقوله : وما هو ببالغه كناية عن الماء ; أي وما الماء ببالغ فاه . ويجوز أن يكون هو كناية عن الفم ; أي ما الفم ببالغ الماء .\nوما دعاء الكافرين إلا في ضلال أي ليست عبادة الكافرين الأصنام إلا في ضلال ، لأنها شرك ، وقيل : إلا في ضلال أي يضل عنهم ذلك الدعاء ، فلا يجدون منه سبيلا ; كما قال : أين ما كنتم تدعون من دون الله قالوا ضلوا عنا وقال ابن عباس : أي أصوات الكافرين محجوبة عن الله فلا يسمع دعاءهم .\n                                    ",
        "saadi": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ ٤١\n                                        \n                                        \n                                        \n                                        أي: لله وحده { دَعْوَةُ الْحَقِّ } وهي: عبادته وحده لا شريك له، وإخلاص دعاء العبادة ودعاء المسألة له تعالى، أي: هو الذي ينبغي أن يصرف له الدعاء، والخوف، والرجاء، والحب، والرغبة، والرهبة، والإنابة؛ لأن ألوهيته هي الحق، وألوهية غيره باطلة { وَالَّذِينَ يَدْعُونَ مِنْ دُونِهِ } من الأوثان والأنداد التي جعلوها شركاء لله.\n{ لَا يَسْتَجِيبُونَ لَهُمْ } أي: لمن يدعوها ويعبدها بشيء قليل ولا كثير لا من أمور الدنيا ولا من أمور الآخرة { إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ } الذي لا تناله كفاه لبعده، { لِيَبْلُغَ } ببسط كفيه إلى الماء { فَاهُ } فإنه عطشان ومن شدة عطشه يتناول بيده، ويبسطها إلى الماء الممتنع وصولها إليه، فلا يصل إليه.\nكذلك الكفار الذين يدعون معه آلهة لا يستجيبون لهم بشيء ولا ينفعونهم في أشد الأوقات إليهم حاجة لأنهم فقراء كما أن من دعوهم فقراء، لا يملكون مثقال ذرة في الأرض ولا في السماء، وما لهم فيهما من شرك وما له منهم من ظهير.\n{ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ } لبطلان ما يدعون من دون الله، فبطلت عباداتهم ودعاؤهم؛ لأن الوسيلة تبطل ببطلان غايتها، ولما كان الله تعالى هو الملك الحق المبين، كانت عبادته حقًّا متصلة النفع لصاحبها في الدنيا والآخرة.\nوتشبيه دعاء الكافرين لغير الله بالذي يبسط كفيه إلى الماء ليبلغ فاه من أحسن الأمثلة؛ فإن ذلك تشبيه بأمر محال، فكما أن هذا محال، فالمشبه به محال، والتعليق على المحال من أبلغ ما يكون في نفي الشيء كما قال تعالى: { إن الذين كذبوا بآياتنا واستكبروا عنها لا تفتح لهم أبواب السماء ولا يدخلون الجنة حتى يلج الجمل في سم الخياط }\n                                    "
      },
      "originalText": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ ٤١"
    },
    {
      "number": 1722,
      "text": "وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ ۩",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 15,
      "juz": 13,
      "manzil": 3,
      "page": 251,
      "ruku": 206,
      "hizbQuarter": 100,
      "sajda": {
        "id": 2,
        "recommended": true,
        "obligatory": false
      },
      "tafsier": {
        "ibnkther": "وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ ۩ ٥١\n                                    \n                                    \n                                    يخبر تعالى عن عظمته وسلطانه الذي قهر كل شيء ، ودان له كل شيء . ولهذا يسجد له كل شيء طوعا من المؤمنين ، وكرها من المشركين ، ( وظلالهم بالغدو ) أي : البكر والآصال ، وهو جمع أصيل وهو آخر النهار ، كما قال تعالى : ( أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون ) [ النحل : 48 ] .\n                                    ",
        "qortoby": "وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ ۩ ٥١\n                                    \n                                    \n                                    قوله تعالى : ولله يسجد من في السماوات والأرض طوعا وكرها وظلالهم بالغدو والآصال قوله تعالى : ولله يسجد من في السماوات والأرض طوعا وكرها قال الحسن وقتادة وغيرهما : المؤمن يسجد طوعا ، والكافر يسجد كرها بالسيف . وعن قتادة أيضا : يسجد الكافر كارها حين لا ينفعه الإيمان . وقال الزجاج : سجود الكافر كرها ما فيه من الخضوع وأثر الصنعة . وقال ابن زيد : \" طوعا \" من دخل في الإسلام رغبة ، و \" كرها \" من دخل فيه رهبة بالسيف . وقيل : \" طوعا \" من طالت مدة إسلامه فألف السجود ، و \" كرها \" من يكره نفسه لله تعالى ; فالآية في المؤمنين ، وعلى هذا يكون معنى \" والأرض \" وبعض من في الأرض . قال القشيري : وفي الآية مسلكان : أحدهما : أنها عامة والمراد بها التخصيص ; فالمؤمن يسجد طوعا ، وبعض الكفار يسجدون إكراها وخوفا كالمنافقين ; فالآية محمولة على هؤلاء ، ذكره الفراء . وقيل على هذا القول : الآية في المؤمنين ; منهم من يسجد طوعا لا يثقل عليه السجود ، ومنهم من يثقل عليه ; لأن التزام التكليف مشقة ، ولكنهم يتحملون المشقة إخلاصا وإيمانا ، إلى أن يألفوا الحق ويمرنوا عليه . والمسلك الثاني : وهو الصحيح - إجراء الآية على التعميم ; وعلى هذا طريقان : أحدهما : أن المؤمن يسجد طوعا ، وأما الكافر فمأمور بالسجود مؤاخذ به . والثاني : وهو الحق - أن المؤمن يسجد ببدنه طوعا ، وكل مخلوق من المؤمن والكافر يسجد من حيث إنه مخلوق ، يسجد دلالة وحاجة إلى الصانع ; وهذا كقوله : وإن من شيء إلا يسبح بحمده وهو تسبيح دلالة لا تسبيح عبادة .\nوظلالهم بالغدو والآصال أي ظلال الخلق ساجدة لله تعالى بالغدو والآصال ; لأنها تبين في هذين الوقتين ، وتميل من ناحية إلى ناحية ; وذلك تصريف الله إياها على ما يشاء ; وهو كقوله تعالى : أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون قاله ابن عباس وغيره . وقال مجاهد : ظل المؤمن يسجد طوعا وهو طائع ; وظل الكافر يسجد كرها وهو كاره . وقال ابن الأنباري : يجعل للظلال عقول تسجد بها وتخشع بها ، كما جعل للجبال أفهام حتى خاطبت وخوطبت . قال القشيري : في هذا نظر ; لأن الجبل عين ، فيمكن أن يكون له عقل بشرط تقدير الحياة ، وأما الظلال فآثار وأعراض ، ولا يتصور تقدير الحياة لها ، والسجود بمعنى الميل ; فسجود الظلال ميلها من جانب إلى جانب ; يقال : سجدت النخلة أي مالت . و الآصال جمع أصل ، والأصل جمع أصيل ; وهو ما بين العصر إلى الغروب ، ثم أصائل جمع الجمع ; قال أبو ذؤيب الهذلي :\nلعمري لأنت البيت أكرم أهله وأقعد في أفيائه بالأصائل\nو \" ظلالهم \" يجوز أن يكون معطوفا على \" من \" ويجوز أن يكون ارتفع بالابتداء والخبر محذوف ; التقدير : وظلالهم سجد بالغدو والآصال و \" بالغدو \" يجوز أن يكون مصدرا ، ويجوز أن يكون جمع غداة ; يقوي كونه جمعا مقابلة الجمع الذي هو الآصال به .\n                                    ",
        "saadi": "وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ ۩ ٥١\n                                        \n                                        \n                                        \n                                        أي: جميع ما احتوت عليه السماوات والأرض كلها خاضعة لربها، تسجد له { طَوْعًا وَكَرْهًا } فالطوع لمن يأتي بالسجود والخضوع اختيارا كالمؤمنين، والكره لمن يستكبر عن عبادة ربه، وحاله وفطرته تكذبه في ذلك، { وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ } أي: ويسجد له ظلال المخلوقات أول النهار وآخره وسجود كل شيء بحسب حاله كما قال تعالى: { وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم } فإذا كانت المخلوقات كلها تسجد لربها طوعا وكرها كان هو الإله حقا المعبود المحمود حقا وإلاهية غيره باطلة، ولهذا ذكر بطلانها\n                                    "
      },
      "originalText": "وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ ۩ ٥١"
    },
    {
      "number": 1723,
      "text": "قُلْ مَنْ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ قُلِ اللَّهُ ۚ قُلْ أَفَاتَّخَذْتُمْ مِنْ دُونِهِ أَوْلِيَاءَ لَا يَمْلِكُونَ لِأَنْفُسِهِمْ نَفْعًا وَلَا ضَرًّا ۚ قُلْ هَلْ يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ أَمْ هَلْ تَسْتَوِي الظُّلُمَاتُ وَالنُّورُ ۗ أَمْ جَعَلُوا لِلَّهِ شُرَكَاءَ خَلَقُوا كَخَلْقِهِ فَتَشَابَهَ الْخَلْقُ عَلَيْهِمْ ۚ قُلِ اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ الْوَاحِدُ الْقَهَّارُ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 16,
      "juz": 13,
      "manzil": 3,
      "page": 251,
      "ruku": 206,
      "hizbQuarter": 100,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ ٦١\n                                    \n                                    \n                                    يقرر تعالى أنه لا إله إلا هو; لأنهم معترفون أنه هو الذي خلق السموات والأرض ، وهو ربها ومدبرها ، وهم مع هذا قد اتخذوا من دونه أولياء يعبدونهم ، وأولئك الآلهة لا تملك لنفسها ولا لعابديها بطريق الأولى ( نفعا ولا ضرا ) أي : لا تحصل منفعة ، ولا تدفع مضرة . فهل يستوي من عبد هذه الآلهة مع الله ، ومن عبد الله وحده لا شريك له ، وهو على نور من ربه ؟ ولهذا قال : ( قل هل يستوي الأعمى والبصير أم هل تستوي الظلمات والنور أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم ) أي : أجعل هؤلاء المشركون مع الله آلهة تناظر الرب وتماثله في الخلق ، فخلقوا كخلقه ، فتشابه الخلق عليهم ، فلا يدرون أنها مخلوقة من مخلوق غيره ؟ أي : ليس الأمر كذلك ، فإنه لا يشابهه شيء ولا يماثله ، ولا ند له ولا عدل له ، ولا وزير له ، ولا ولد ولا صاحبة ، تعالى الله عن ذلك علوا كبيرا . وإنما عبد هؤلاء المشركون معه آلهة هم يعترفون أنها مخلوقة له عبيد له ، كما كانوا يقولون في تلبيتهم : لبيك لا شريك لك ، إلا شريكا هو لك ، تملكه وما ملك . وكما أخبر تعالى عنهم في قوله : ( ما نعبدهم إلا ليقربونا إلى الله زلفى ) [ الزمر : 3 ] فأنكر تعالى ذلك عليهم ، حيث اعتقدوا ذلك ، وهو تعالى لا يشفع عنده أحد إلا بإذنه ، ( ولا تنفع الشفاعة عنده إلا لمن أذن له ) [ سبأ : 23 ] ، ( وكم من ملك في السماوات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى ) [ النجم : 26 ] وقال : ( إن كل من في السماوات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا ) [ مريم : 93 - 95 ] فإذا كان الجميع عبيدا ، فلم يعبد بعضهم بعضا بلا دليل ولا برهان ، بل بمجرد الرأي والاختراع والابتداع ؟ ثم قد أرسل رسله من أولهم إلى آخرهم تزجرهم عن ذلك ، وتنهاهم عن عبادة من سوى الله ، فكذبوهم وخالفوهم ، فحقت عليهم كلمة العذاب لا محالة ، ( ولا يظلم ربك أحدا ) [ الكهف : 49 ] .\n                                    ",
        "qortoby": "قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ ٦١\n                                    \n                                    \n                                    قوله تعالى : قل من رب السماوات والأرض قل الله قل أفاتخذتم من دونه أولياء لا يملكون لأنفسهم نفعا ولا ضرا قل هل يستوي الأعمى والبصير أم هل تستوي الظلمات والنور أم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم قل الله خالق كل شيء وهو الواحد القهار\nقوله تعالى : قل من رب السماوات والأرض قل الله أمر الله تعالى نبيه - صلى الله عليه وسلم - أن يقول للمشركين : قل من رب السماوات والأرض ثم أمره أن يقول لهم : هو الله إلزاما للحجة إن لم يقولوا ذلك ، وجهلوا من هو .\nقل أفاتخذتم من دونه أولياء هذا يدل على اعترافهم بأن الله هو الخالق وإلا لم يكن للاحتجاج بقوله : قل أفاتخذتم من دونه أولياء معنى ; دليله قوله : ولئن سألتهم من خلق السماوات والأرض ليقولن الله أي فإذا اعترفتم فلم تعبدون غيره ؟ ! وذلك الغير لا ينفع ولا يضر ; وهو إلزام صحيح .\nقل هل يستوي الأعمى والبصير ثم ضرب لهم مثلا فقال : قل هل يستوي الأعمى والبصير فكذلك لا يستوي المؤمن الذي يبصر الحق ، والمشرك الذي لا يبصر الحق . وقيل : الأعمى مثل لما عبدوه من دون الله ، والبصير مثل الله تعالى :\nأم هل تستوي الظلمات والنور أي الشرك والإيمان . وقرأ ابن محيصن وأبو بكر والأعمش وحمزة والكسائي \" يستوي \" بالياء لتقدم الفعل ; ولأن تأنيث الظلمات ليس بحقيقي . الباقون بالتاء ; واختاره أبو عبيد ، قال : لأنه لم يحل بين المؤنث والفعل حائل . و الظلمات والنور مثل الإيمان والكفر ; ونحن لا نقف على كيفية ذلك .\nأم جعلوا لله شركاء خلقوا كخلقه فتشابه الخلق عليهم هذا من تمام الاحتجاج ; أي خلق غير الله مثل خلقه فتشابه الخلق عليهم ، فلا يدرون خلق الله من خلق آلهتهم .\nقل الله خالق كل شيء أي قل لهم يا محمد : الله خالق كل شيء ، فلزم لذلك أن يعبده كل شيء . والآية رد على المشركين والقدرية الذين زعموا أنهم خلقوا كما خلق الله .\nوهو الواحد قبل كل شيء . \" القهار \" الغالب لكل شيء ، الذي يغلب في مراده كل مريد . قال القشيري أبو نصر : ولا يبعد أن تكون الآية واردة فيمن لا يعترف بالصانع ; أي سلهم عن خالق السماوات والأرض ، فإنه يسهل تقرير الحجة فيه عليهم ، ويقرب الأمر من الضرورة ; فإن عجز الجماد وعجز كل مخلوق عن خلق السماوات والأرض معلوم ، وإذا تقرر هذا وبان أن الصانع هو الله فكيف يجوز اعتداد الشريك له ؟ ! وبين في أثناء الكلام أنه لو كان للعالم صانعان لاشتبه الخلق ، ولم يتميز فعل هذا عن فعل ذلك ، فبم يعلم أن الفعل من اثنين ؟ ! .\n                                    ",
        "saadi": "قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ ٦١\n                                        \n                                        \n                                        \n                                        أي: قل لهؤلاء المشركين به أوثانا وأندادا يحبونها كما يحبون الله، ويبذلون لها أنواع التقربات والعبادات: أفتاهت عقولكم حتى اتخذتم من دونه أولياء تتولونهم بالعبادة وليسوا بأهل لذلك ؟\nفإنهم { لَا يَمْلِكُونَ لِأَنْفُسِهِمْ نَفْعًا وَلَا ضَرًّا } وتتركون ولاية من هو كامل الأسماء والصفات، المالك للأحياء والأموات، الذي بيده الخلق والتدبير والنفع والضر ؟\nفما تستوي عبادة الله وحده، وعبادة المشركين به، كما لا يستوي الأعمى والبصير، وكما لا تستوي الظلمات والنور.\nفإن كان عندهم شك واشتباه، وجعلوا له شركاء زعموا أنهم خلقوا كخلقه وفعلوا كفعله، فأزلْ عنهم هذا الاشتباه واللبس بالبرهان الدال على توحد الإله بالوحدانية، فقل لهم: { اللَّهُ خَالِقُ كُلِّ شَيْءٍ } فإنه من المحال أن يخلق شيء من الأشياء نفسه.\nومن المحال أيضا أن يوجد من دون خالق، فتعين أن لها إلها خالقا لا شريك له في خلقه لأنه الواحد القهار، فإنه لا توجد الوحدة والقهر إلا لله وحده، فالمخلوقات وكل مخلوق فوقه مخلوق يقهره ثم فوق ذلك القاهر قاهر أعلى منه، حتى ينتهي القهر للواحد القهار، فالقهر والتوحيد متلازمان متعينان لله وحده، فتبين بالدليل العقلي القاهر، أن ما يدعى من دون الله ليس له شيء من خلق المخلوقات وبذلك كانت عبادته باطلة.\n                                    "
      },
      "originalText": "قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ لَا يَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعٗا وَلَا ضَرّٗاۚ قُلۡ هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ ٦١"
    },
    {
      "number": 1724,
      "text": "أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَابِيًا ۚ وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِثْلُهُ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ ۚ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً ۖ وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 17,
      "juz": 13,
      "manzil": 3,
      "page": 251,
      "ruku": 206,
      "hizbQuarter": 100,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ ٧١\n                                    \n                                    \n                                    اشتملت هذه الآية الكريمة على مثلين مضروبين للحق في ثباته وبقائه ، والباطل في اضمحلاله وفنائه ، فقال تعالى : ( أنزل من السماء ماء ) أي : مطرا ، ( فسالت أودية بقدرها ) أي : أخذ كل واد بحسبه ، فهذا كبير وسع كثيرا من الماء ، وهذا صغير فوسع بقدره ، وهو إشارة إلى القلوب وتفاوتها ، فمنها ما يسع علما كثيرا ، ومنها ما لا يتسع لكثير من العلوم بل يضيق عنها ، ( فاحتمل السيل زبدا رابيا ) أي : فجاء على وجه الماء الذي سال في هذه الأودية زبد عال عليه ، هذا مثل ، وقوله : ( ومما يوقدون عليه في النار ) هذا هو المثل الثاني ، وهو ما يسبك في النار من ذهب أو فضة ( ابتغاء حلية ) أي : ليجعل حلية أو نحاسا أو حديدا ، فيجعل متاعا فإنه يعلوه زبد منه ، كما يعلو ذلك زبد منه . ( كذلك يضرب الله الحق والباطل ) أي : إذا اجتمعا لا ثبات للباطل ولا دوام له ، كما أن الزبد لا يثبت مع الماء ، ولا مع الذهب ونحوه مما يسبك في النار ، بل يذهب ويضمحل; ولهذا قال : ( فأما الزبد فيذهب جفاء ) أي : لا ينتفع به ، بل يتفرق ويتمزق ويذهب في جانبي الوادي ، ويعلق بالشجر وتنسفه الرياح . وكذلك خبث الذهب والفضة والحديد والنحاس يذهب ، لا يرجع منه شيء ، ولا يبقى إلا الماء وذلك الذهب ونحوه ينتفع به; ولهذا قال : ( وأما ما ينفع الناس فيمكث في الأرض كذلك يضرب الله الأمثال ) كما قال تعالى : ( وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون ) [ العنكبوت : 43 ] .\nقال بعض السلف : كنت إذا قرأت مثلا من القرآن فلم أفهمه بكيت على نفسي; لأن الله تعالى يقول : ( وما يعقلها إلا العالمون )\nقال علي بن أبي طلحة ، عن ابن عباس : قوله تعالى : ( أنزل من السماء ماء فسالت أودية بقدرها ) هذا مثل ضربه الله ، احتملت منه القلوب على قدر يقينها وشكها ، فأما الشك فلا ينفع معه العمل ، وأما اليقين فينفع الله به أهله . وهو قوله : ( فأما الزبد فيذهب جفاء ) [ وهو الشك ] ( وأما ما ينفع الناس فيمكث في الأرض ) وهو اليقين ، وكما يجعل الحلي في النار فيؤخذ خالصه ويترك خبثه في النار; فكذلك يقبل الله اليقين ويترك الشك .\nوقال العوفي ، عن ابن عباس : قوله : ( أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا ) يقول : احتمل السيل ما في الوادي من عود ودمنة ( ومما يوقدون عليه في النار ) فهو الذهب والفضة والحلية والمتاع والنحاس والحديد ، فللنحاس والحديد خبث ، فجعل الله مثل خبثه كزبد الماء ، فأما ما ينفع الناس فالذهب والفضة ، وأما ما ينفع الأرض فما شربت من الماء فأنبتت . فجعل ذاك مثل العمل الصالح يبقى لأهله ، والعمل السيئ يضمحل عن أهله ، كما يذهب هذا الزبد ، فكذلك الهدى والحق جاءا من عند الله ، فمن عمل بالحق كان له ، ويبقى كما يبقى ما ينفع الناس في الأرض . وكذلك الحديد لا يستطاع أن يعمل منه سكين ولا سيف حتى يدخل في النار فتأكل خبثه ، ويخرج جيده فينتفع به . كذلك يضمحل الباطل إذا كان يوم القيامة ، وأقيم الناس ، وعرضت الأعمال ، فيزيغ الباطل ويهلك ، وينتفع أهل الحق بالحق .\nوكذلك روي في تفسيرها عن مجاهد ، والحسن البصري ، وعطاء ، وقتادة ، وغير واحد من السلف والخلف .\nوقد ضرب الله ، سبحانه وتعالى ، في أول سورة البقرة للمنافقين مثلين ناريا ومائيا ، وهما قوله : ( مثلهم كمثل الذي استوقد نارا فلما أضاءت ما حوله ) الآية [ البقرة : 17 ] ، ثم قال : ( أو كصيب من السماء فيه ظلمات ورعد وبرق ) الآية [ البقرة : 19 ] . وهكذا ضرب للكافرين في سورة النور مثلين ، أحدهما : قوله : ( والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء ) [ النور : 39 ] الآية ، والسراب إنما يكون في شدة الحر; ولهذا جاء في الصحيحين : \" فيقال لليهود يوم القيامة : فما تريدون ؟ فيقولون : أي ربنا ، عطشنا فاسقنا . فيقال : ألا تردون ؟ فيردون النار فإذا هي كالسراب يحطم بعضها بعضا \" .\nثم قال في المثل الآخر : ( أو كظلمات في بحر لجي يغشاه موج من فوقه موج من فوقه سحاب ) الآية [ النور : 40 ] . وفي الصحيحين عن أبي موسى الأشعري قال : قال رسول الله ، صلى الله عليه وسلم : \" إن مثل ما بعثني الله به من الهدى والعلم ، كمثل غيث أصاب أرضا ، فكان منها طائفة قبلت الماء فأنبتت الكلأ والعشب الكثير ، وكانت منها أجادب أمسكت الماء ، فنفع الله بها الناس ، فشربوا ورعوا وسقوا وزرعوا ، وأصابت طائفة منها [ أخرى ] إنما هي قيعان لا تمسك ماء ولا تنبت كلأ فذلك مثل من فقه في دين الله ونفعه الله بما بعثني ونفع به ، فعلم وعلم ، ومثل من لم يرفع بذلك رأسا ولم يقبل هدى الله الذي أرسلت به \" .\nفهذا مثل مائي ، وقال في الحديث الآخر الذي رواه الإمام أحمد :\nحدثنا عبد الرزاق ، حدثنا معمر ، عن همام بن منبه قال : هذا ما حدثنا أبو هريرة عن رسول الله - صلى الله عليه وسلم - أنه قال : \" مثلي ومثلكم ، كمثل رجل استوقد نارا ، فلما أضاءت ما حوله جعل الفراش وهذه الدواب التي يقعن في النار يقعن فيها ، وجعل يحجزهن ويغلبنه فيقتحمن فيها \" . قال : \" فذلكم مثلي ومثلكم ، أنا آخذ بحجزكم عن النار ، هلم عن النار [ هلم عن النار ، هلم ] فتغلبوني فتقتحمون فيها \" . وأخرجاه في الصحيحين أيضا فهذا مثل ناري .\n                                    ",
        "qortoby": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ ٧١\n                                    \n                                    \n                                    قوله : أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا ومما يوقدون عليه في النار ابتغاء حلية أو متاع زبد مثله كذلك يضرب الله الحق والباطل فأما الزبد فيذهب جفاء وأما ما ينفع الناس فيمكث في الأرض كذلك يضرب الله الأمثال\nقوله تعالى : أنزل من السماء ماء فسالت أودية بقدرها فاحتمل السيل زبدا رابيا ضرب مثلا للحق والباطل ; فشبه الكفر بالزبد الذي يعلو الماء ، فإنه يضمحل ويعلق بجنبات الأودية ، وتدفعه الرياح ; فكذلك يذهب الكفر ويضمحل ، على ما نبينه . قال مجاهد : فسالت أودية بقدرها قال : بقدر ملئها . وقال ابن جريج : بقدر صغرها وكبرها . وقرأ الأشهب العقيلي والحسن \" بقدرها \" بسكون الدال ، والمعنى واحد . وقيل : معناها بما قدر لها . والأودية . جمع الوادي ; وسمي واديا لخروجه وسيلانه ; فالوادي على هذا اسم للماء السائل . وقال أبو علي : فسالت أودية توسع ; أي سال ماؤها فحذف ، قال : ومعنى \" بقدرها \" بقدر مياهها ; لأن الأودية ما سالت بقدر أنفسها . فاحتمل السيل زبدا رابيا أي طالعا عاليا مرتفعا فوق الماء ; وتم الكلام ; قاله مجاهد . ثم قال : ومما يوقدون عليه في النار وهو المثل الثاني . ابتغاء حلية أي حلية الذهب والفضة . أو متاع زبد مثله قال مجاهد : الحديد والنحاس والرصاص . وقوله : \" زبد مثله \" أي يعلو هذه الأشياء زبد كما يعلو السيل ; وإنما احتمل السيل الزبد لأن الماء خالطه تراب الأرض فصار ذلك زبدا ، كذلك ما يوقد عليه في النار من الجوهر ومن الذهب والفضة مما ينبث في الأرض من المعادن فقد خالطه التراب ; فإنما يوقد عليه ليذوب فيزايله تراب الأرض . وقوله : كذلك يضرب الله الحق والباطل فأما الزبد فيذهب جفاء قال مجاهد : جمودا . وقال أبو عبيدة قال أبو عمرو بن العلاء : أجفأت القدر إذا غلت حتى ينصب زبدها ، وإذا جمد في أسفلها . والجفاء ما أجفاه الوادي أي رمى به . وحكى أبو عبيدة أنه سمع رؤبة يقرأ \" جفالا \" قال أبو عبيدة : يقال أجفلت القدر إذا قذفت بزبدها ، وأجفلت الريح السحاب إذا قطعته . وأما ما ينفع الناس فيمكث في الأرض قال مجاهد : هو الماء الخالص الصافي . وقيل : الماء وما خلص من الذهب والفضة والحديد والنحاس والرصاص ; وهو أن المثلين ضربهما الله للحق في ثباته ، والباطل في اضمحلاله ، فالباطل وإن علا في بعض الأحوال فإنه يضمحل كاضمحلال الزبد والخبث . وقيل : المراد مثل ضربه الله للقرآن وما يدخل منه القلوب ; فشبه القرآن بالمطر لعموم خيره وبقاء نفعه ، وشبه القلوب بالأودية ، يدخل فيها من القرآن مثل ما يدخل في الأودية بحسب سعتها وضيقها . قال ابن عباس : أنزل من السماء ماء قال : قرآنا ، فسالت أودية بقدرها قال : الأودية قلوب العباد . قال صاحب \" سوق العروس \" إن صح هذا التفسير فالمعنى فيه أن الله سبحانه مثل القرآن بالماء . ومثل القلوب بالأودية ، ومثل المحكم بالصافي ، ومثل المتشابه بالزبد . وقيل : الزبد مخايل النفس وغوائل الشك ترتفع من حيث ما فيها فتضطرب من سلطان تلعها ، كما أن ماء السيل يجري صافيا فيرفع ما يجد في الوادي باقيا ، وأما حلية الذهب والفضة فمثل الأحوال السنية . والأخلاق الزكية ; التي بها جمال الرجال ، وقوام صالح الأعمال ، كما أن من الذهب والفضة زينة النساء ، وبهما قيمة الأشياء . وقرأ حميد وابن محيصن ويحيى والأعمش وحمزة والكسائي وحفص ، يوقدون بالياء واختاره أبو عبيد ; لقوله : ينفع الناس فأخبر ، ولا مخاطبة هاهنا . الباقون بالتاء لقوله في أول الكلام : أفاتخذتم من دونه أولياء . وقوله : \" في النار \" متعلق بمحذوف ، وهو في موضع الحال ، وذو الحال الهاء التي في \" عليه \" التقدير : ومما توقدون عليه ثابتا في النار أو كائنا . وفي قوله : \" في النار \" ضمير مرفوع يعود إلى الهاء التي هي اسم ذي الحال ولا يستقيم أن يتعلق \" في النار \" ب \" يوقدون \" من حيث لا يستقيم أوقدت عليه في النار ; لأن الموقد عليه يكون في النار ، فيصير قوله : \" في النار \" غير مفيد . وقوله : \" ابتغاء حلية \" مفعول له . \" زبد مثله \" ابتداء وخبر ; أي زبد مثل زبد السيل . وقيل : إن خبر \" زبد \" قوله : \" في النار \" . الكسائي : \" زبد \" ابتداء ، و \" مثله \" نعت له ، والخبر في الجملة التي قبله ، وهو مما يوقدون . \" كذلك يضرب الله الأمثال \" أي كما بين لكم هذه الأمثال فكذلك يضربها بينات . تم الكلام ،\n                                    ",
        "saadi": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ ٧١\n                                        \n                                        \n                                        \n                                        شبّه تعالى الهدى الذي أنزله على رسوله لحياة القلوب والأرواح، بالماء الذي أنزله لحياة الأشباح، وشبّه ما في الهدى من النفع العام الكثير الذي يضطر إليه العباد، بما في المطر من النفع العام الضروري، وشبه القلوب الحاملة للهدى وتفاوتها بالأودية التي تسيل فيها السيول، فواد كبير يسع ماء كثيرا، كقلب كبير يسع علما كثيرا، وواد صغير يأخذ ماء قليلا، كقلب صغير، يسع علما قليلا، وهكذا.\nوشبه ما يكون في القلوب من الشهوات والشبهات عند وصول الحق إليها، بالزبد الذي يعلو الماء ويعلو ما يوقد عليه النار من الحلية التي يراد تخليصها وسبكها، وأنها لا تزال فوق الماء طافية مكدرة له حتى تذهب وتضمحل، ويبقى ما ينفع الناس من الماء الصافي والحلية الخالصة.\nكذلك الشبهات والشهوات لا يزال القلب يكرهها، ويجاهدها بالبراهين الصادقة، والإرادات الجازمة، حتى تذهب وتضمحل ويبقى القلب خالصا صافيا ليس فيه إلا ما ينفع الناس من العلم بالحق وإيثاره، والرغبة فيه، فالباطل يذهب ويمحقه الحق { إِنَّ الْبَاطِلَ كَانَ زَهُوقًا } وقال هنا: { كَذَلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ } ليتضح الحق من الباطل والهدى والضلال.\n                                    "
      },
      "originalText": "أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ ٧١"
    },
    {
      "number": 1725,
      "text": "لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ الْحُسْنَىٰ ۚ وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ ۚ أُولَٰئِكَ لَهُمْ سُوءُ الْحِسَابِ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمِهَادُ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 18,
      "juz": 13,
      "manzil": 3,
      "page": 251,
      "ruku": 206,
      "hizbQuarter": 100,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ٨١\n                                    \n                                    \n                                    يخبر تعالى عن مآل السعداء والأشقياء فقال : ( للذين استجابوا لربهم ) أي : أطاعوا الله ورسوله ، وانقادوا لأوامره ، وصدقوا أخباره الماضية والآتية ، فلهم ) الحسنى ) وهو الجزاء الحسن كما قال تعالى مخبرا عن ذي القرنين أنه قال : ( قال أما من ظلم فسوف نعذبه ثم يرد إلى ربه فيعذبه عذابا نكرا وأما من آمن وعمل صالحا فله جزاء الحسنى وسنقول له من أمرنا يسرا ) [ الكهف : 87 ، 88 ] وقال تعالى : ( للذين أحسنوا الحسنى وزيادة ) [ يونس : 26 ] .\nوقوله : ( والذين لم يستجيبوا له ) أي لم : يطيعوا الله ( لو أن لهم ما في الأرض جميعا ) أي : في الدار الآخرة ، لو أن يمكنهم أن يفتدوا من عذاب الله بملء الأرض ذهبا ومثله معه لافتدوا به ، ولكن لا يتقبل منهم; لأنه تعالى لا يقبل منهم يوم القيامة صرفا ولا عدلا ( أولئك لهم سوء الحساب ) أي : في الدار الآخرة ، أي : يناقشون على النقير والقطمير ، والجليل والحقير ، ومن نوقش الحساب عذب; ولهذا قال : ( ومأواهم جهنم وبئس المهاد )\n                                    ",
        "qortoby": "لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ٨١\n                                    \n                                    \n                                    ثم قال : للذين استجابوا لربهم الحسنى أي أجابوا ; واستجاب بمعنى أجاب ; قال :\nفلم يستجبه عند ذاك مجيب\nوقد تقدم ; أي أجاب إلى ما دعاه الله من التوحيد والنبوات . \" الحسنى \" لأنها في نهاية الحسن . وقيل : من الحسنى النصر في الدنيا ، والنعيم المقيم غدا .\nوالذين لم يستجيبوا له أي لم يجيبوا إلى الإيمان به . لو أن لهم ما في الأرض جميعا أي من الأموال . \" ومثله معه \" ملك لهم . \" لافتدوا به \" من عذاب يوم القيامة ; نظيره في \" آل عمران \" إن الذين كفروا لن تغني عنهم أموالهم ولا أولادهم من الله شيئا ، إن الذين كفروا وماتوا وهم كفار فلن يقبل من أحدهم ملء الأرض ذهبا ولو افتدى به حسب ما تقدم بيانه هناك .\nأولئك لهم سوء الحساب أي لا يقبل لهم حسنة ، ولا يتجاوز لهم عن سيئة . وقال فرقد السبخي قال لي إبراهيم النخعي : يا فرقد ! أتدري ما سوء الحساب ؟ قلت لا ! قال : أن يحاسب الرجل بذنبه كله لا يفقد منه شيء .\nومأواهم جهنم أي مسكنهم ومقامهم .\n\" وبئس المهاد \" أي الفراش الذي مهدوا لأنفسهم .\n                                    ",
        "saadi": "لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ٨١\n                                        \n                                        \n                                        \n                                        لما بيّن تعالى الحق من الباطل ذكر أن الناس على قسمين: مستجيب لربه، فذكر ثوابه، وغير مستجيب فذكر عقابه فقال: { لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ } أي: انقادت قلوبهم للعلم والإيمان وجوارحهم للأمر والنهي، وصاروا موافقين لربهم فيما يريده منهم، فلهم { الْحُسْنَى } أي: الحالة الحسنة والثواب الحسن.\nفلهم من الصفات أجلها ومن المناقب أفضلها ومن الثواب العاجل والآجل ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر، { وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ } بعد ما ضرب لهم الأمثال وبين لهم الحق، لهم الحالة غير الحسنة، فـ { لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا } من ذهب وفضة وغيرها، { وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ } من عذاب يوم القيامة ما تقبل منهم وأنى لهم ذلك؟\"\n{ أُولَئِكَ لَهُمْ سُوءُ الْحِسَابِ } وهو الحساب الذي يأتي على كل ما أسلفوه من عمل سيئ وما ضيعوه من حقوق الله وحقوق عباده قد كتب ذلك وسطر عليهم وقالوا: { يا ويلتنا ما لهذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا } { و } بعد هذا الحساب السيئ { وَمَأْوَاهُمْ جَهَنَّمُ } الجامعة لكل عذاب، من الجوع الشديد، والعطش الوجيع، والنار الحامية والزقوم والزمهرير، والضريع وجميع ما ذكره الله من أصناف العذاب { وَبِئْسَ الْمِهَادُ } أي: المقر والمسكن مسكنهم.\n                                    "
      },
      "originalText": "لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡاْ بِهِۦٓۚ أُوْلَٰٓئِكَ لَهُمۡ سُوٓءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ٨١"
    }
  ]
}