{
  "number": 255,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 1750,
      "text": "وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا ۚ قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَمَنْ عِنْدَهُ عِلْمُ الْكِتَابِ",
      "surah": {
        "number": 13,
        "name": "سورة الرعد",
        "englishName": "Ar-Ra'd",
        "englishNameTranslation": "The Thunder",
        "revelationType": "Medinan",
        "numberOfAyahs": 43
      },
      "numberInSurah": 43,
      "juz": 13,
      "manzil": 3,
      "page": 255,
      "ruku": 210,
      "hizbQuarter": 102,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ ٣٤\n                                    \n                                    \n                                    يقول : ويكذبك هؤلاء الكفار ويقولون : ( لست مرسلا ) أي : ما أرسلك الله ، ( قل كفى بالله شهيدا بيني وبينكم ) أي : حسبي الله ، وهو الشاهد علي وعليكم ، شاهد علي فيما بلغت عنه من الرسالة ، وشاهد عليكم أيها المكذبون فيما تفترونه من البهتان .\nوقوله : ( ومن عنده علم الكتاب ) قيل : نزلت في عبد الله بن سلام . قاله مجاهد .\nوهذا القول غريب; لأن هذه الآية مكية ، وعبد الله بن سلام إنما أسلم في أول مقدم رسول الله - صلى الله عليه وسلم - المدينة . والأظهر في هذا ما قاله العوفي ، عن ابن عباس قال : هم من اليهود والنصارى .\nوقال قتادة : منهم ابن سلام ، وسلمان ، وتميم الداري .\nوقال مجاهد - في رواية - عنه : هو الله تعالى .\nوكان سعيد بن جبير ينكر أن يكون المراد بها عبد الله بن سلام ، ويقول : هي مكية ، وكان يقرؤها : \" ومن عنده علم الكتاب \" ، ويقول : من عند الله .\nوكذا قرأها مجاهد والحسن البصري .\nوقد روى ابن جرير من حديث ، هارون الأعور ، عن الزهري ، عن سالم ، عن ابن عمر; أن رسول الله - صلى الله عليه وسلم - قرأها : \" \" ومن عنده علم الكتاب \" ، ثم قال : لا أصل له من حديث الزهري عند الثقات .\nقلت : وقد رواه الحافظ أبو يعلى في مسنده ، من طريق هارون بن موسى هذا ، عن سليمان بن أرقم - وهو ضعيف - عن الزهري ، عن سالم ، عن أبيه مرفوعا كذلك . ولا يثبت . والله أعلم\nوالصحيح في هذا : أن ) ومن عنده ) اسم جنس يشمل علماء أهل الكتاب الذين يجدون صفة محمد - صلى الله عليه وسلم - ونعته في كتبهم المتقدمة ، من بشارات الأنبياء به ، كما قال تعالى : ( ورحمتي وسعت كل شيء فسأكتبها للذين يتقون ويؤتون الزكاة والذين هم بآياتنا يؤمنون الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل ) الآية [ الأعراف : 156 ، 157 ] وقال تعالى : ( أولم يكن لهم آية أن يعلمه علماء بني إسرائيل ) الآية : [ الشعراء : 197 ] . وأمثال ذلك مما فيه الإخبار عن علماء بني إسرائيل : أنهم يعلمون ذلك من كتبهم المنزلة . وقد ورد في حديث الأحبار ، عن عبد الله بن سلام بأنه أسلم بمكة قبل الهجرة . قال الحافظ أبو نعيم الأصبهاني في كتاب \" دلائل النبوة \" ، وهو كتاب جليل :\nحدثنا سليمان بن أحمد الطبراني ، حدثنا عبدان بن أحمد ، حدثنا محمد بن مصفى ، حدثنا الوليد بن مسلم ، عن محمد بن حمزة بن يوسف ، بن عبد الله بن سلام ، عن أبيه ، أن عبد الله بن سلام قال لأحبار اليهود : إني أردت أن أجدد بمسجد أبينا إبراهيم وإسماعيل عهدا فانطلق إلى رسول الله - صلى الله عليه وسلم - وهو بمكة ، فوافاهم وقد انصرفوا من الحج ، فوجد رسول الله ، بمنى ، والناس حوله ، فقام مع الناس ، فلما نظر إليه رسول الله - صلى الله عليه وسلم - قال : \" أنت عبد الله بن سلام ؟ \" قال : قلت : نعم . قال : \" ادن \" . فدنوت منه ، قال : \" أنشدك بالله يا عبد الله بن سلام ، أما تجدني في التوراة رسول الله ؟ \" فقلت له : انعت ربنا . قال : فجاء جبريل حتى وقف بين يدي رسول الله - صلى الله عليه وسلم - فقال له : ( قل هو الله أحد الله الصمد لم يلد ولم يولد ولم يكن له كفوا أحد ) [ سورة الإخلاص ] فقرأها علينا رسول الله - صلى الله عليه وسلم - فقال ابن سلام : أشهد أن لا إله إلا الله ، وأنك رسول الله . ثم انصرف ابن سلام إلى المدينة فكتم إسلامه . فلما هاجر رسول الله - صلى الله عليه وسلم - إلى المدينة وأنا فوق نخلة لي أجدها ، فألقيت نفسي ، فقالت أمي : [ لله ] أنت ، لو كان موسى بن عمران ما كان لك أن تلقي نفسك من رأس النخلة . فقلت : والله لأني أسر بقدوم رسول الله - صلى الله عليه وسلم - من موسى بن عمران إذ بعث .\nوهذا حديث غريب جدا .\nآخر تفسير سورة الرعد ولله الحمد والمنة.\n                                    ",
        "qortoby": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ ٣٤\n                                    \n                                    \n                                    قوله تعالى : ويقول الذين كفروا لست مرسلا قال قتادة : هم مشركو العرب ; أي لست بنبي ولا رسول ، وإنما أنت متقول ; أي لما لم يأتهم بما اقترحوا قالوا ذلك .\nقل كفى بالله أي قل لهم يا محمد : كفى بالله أي كفى بالله شهيدا بيني وبينكم بصدقي وكذبكم . ومن عنده علم الكتاب وهذا احتجاج على مشركي العرب لأنهم كانوا يرجعون إلى أهل الكتاب - من آمن منهم - في التفاسير . وقيل : كانت شهادتهم قاطعة لقول الخصوم ; وهم مؤمنو أهل الكتاب كعبد الله بن سلام وسلمان الفارسي وتميم الداري والنجاشي وأصحابه ، قاله قتادة وسعيد بن جبير . وروى الترمذي عن ابن أخي عبد الله بن سلام قال : لما أريد قتل عثمان جاء عبد الله بن سلام فقال له عثمان : ما جاء بك ؟ قال : جئت في نصرتك ; قال : اخرج إلى الناس فاطردهم عني ، فإنك خارجا خير لي من داخل ; قال فخرج عبد الله بن سلام إلى الناس فقال : أيها الناس ! إنه كان اسمي في الجاهلية فلان ، فسماني رسول الله - صلى الله عليه وسلم - عبد الله ، ونزلت في آيات من كتاب الله ; فنزلت في . وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين ونزلت في . قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب الحديث . وقد كتبناه بكماله في كتاب \" التذكرة \" . وقال فيه أبو عيسى : هذا حديث حسن غريب . وكان اسمه في الجاهلية حصين فسماه النبي - صلى الله عليه وسلم - عبد الله . وقال أبو بشر : قلت لسعيد بن جبير ومن عنده علم الكتاب ؟ قال : هو عبد الله بن سلام .\nقلت : وكيف يكون عبد الله بن سلام وهذه السورة مكية وابن سلام ما أسلم إلا بالمدينة ؟ ! ذكره الثعلبي . وقال القشيري : وقال ابن جبير السورة مكية وابن سلام أسلم بالمدينة بعد هذه السورة ; فلا يجوز أن تحمل هذه الآية على ابن سلام ; فمن عنده علم الكتاب جبريل ; وهو قول ابن عباس . وقال الحسن ومجاهد والضحاك : هو الله تعالى ; وكانوا يقرءون \" ومن عنده علم الكتاب \" وينكرون على من يقول : هو عبد الله بن سلام وسلمان ; لأنهم يرون أن السورة مكية ، وهؤلاء أسلموا بالمدينة . وروي عن النبي - صلى الله عليه وسلم - أنه قرأ ومن عنده علم الكتاب وإن كان في الرواية ضعف ، وروى ذلك سليمان بن أرقم عن الزهري عن سالم عن أبيه عن النبي - صلى الله عليه وسلم - ; وروى محبوب عن إسماعيل بن محمد اليماني أنه قرأ كذلك - ومن عنده بكسر الميم والعين والدال علم الكتاب بضم العين ورفع الكتاب . وقال عبد الله بن عطاء : قلت ، لأبي جعفر بن علي بن الحسين بن علي بن أبي طالب - رضي الله عنهم - زعموا أن الذي عنده علم الكتاب عبد الله بن سلام فقال : إنما ذلك علي بن أبي طالب - رضي الله عنه - ; وكذلك قال محمد ابن الحنفية . وقيل : جميع المؤمنين ، والله أعلم . قال القاضي أبو بكر بن العربي : أما من قال إنه علي فعول على أحد وجهين : إما لأنه عنده أعلم المؤمنين وليس كذلك ; بل أبو بكر وعمر وعثمان أعلم منه . ولقول النبي - صلى الله عليه وسلم - . ( أنا مدينة العلم وعلي بابها ) وهو حديث باطل ; النبي - صلى الله عليه وسلم - مدينة علم وأصحابه أبوابها ; فمنهم الباب المنفسح ، ومنهم المتوسط ، على قدر منازلهم في العلوم . وأما من قال إنهم جميع المؤمنين فصدق ; لأن كل مؤمن يعلم الكتاب ، ويدرك وجه إعجازه ، ويشهد للنبي - صلى الله عليه وسلم - بصدقه .\nقلت : فالكتاب على هذا هو القرآن . وأما من قال هو عبد الله بن سلام فعول على حديث الترمذي ; وليس يمتنع أن ينزل في عبد الله بن سلام شيئا ويتناول جميع المؤمنين لفظا ; ويعضده من النظام أن قوله تعالى : ويقول الذين كفروا يعني قريشا ; فالذين عندهم علم الكتاب هم المؤمنون من اليهود والنصارى ، الذين هم إلى معرفة النبوة والكتاب أقرب من عبدة الأوثان . قال النحاس : وقول من قال هو عبد الله بن سلام وغيره يحتمل أيضا ; لأن البراهين إذا صحت وعرفها من قرأ الكتب التي أنزلت قبل القرآن كان أمرا مؤكدا ; والله أعلم بحقيقة ذلك .\n                                    ",
        "saadi": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ ٣٤\n                                        \n                                        \n                                        \n                                        { وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا } أي: يكذبونك ويكذبون ما أرسلت به، { قُلْ } لهم -إن طلبوا على ذلك شهيدا: { كَفَى بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ } وشهادته بقوله وفعله وإقراره، أما قوله فبما أوحاه الله إلى أصدق خلقه مما يثبت به رسالته.\nوأما فعله فلأن الله تعالى أيد رسوله ونصره نصرا خارجا عن قدرته وقدرة أصحابه وأتباعه وهذا شهادة منه له بالفعل والتأييد.\nوأما إقراره، فإنه أخبر الرسول عنه أنه رسوله، وأنه أمر الناس باتباعه، فمن اتبعه فله رضوان الله وكرامته، ومن لم يتبعه فله النار والسخط وحل له ماله ودمه والله يقره على ذلك، فلو تقول عليه بعض الأقاويل لعاجله بالعقوبة.\n{ وَمَنْ عِنْدَهُ عِلْمُ الْكِتَابِ } وهذا شامل لكل علماء أهل الكتابين، فإنهم يشهدون للرسول من آمن واتبع الحق، صرح بتلك الشهادة التي عليه، ومن كتم ذلك فإخبار الله عنه أن عنده شهادة أبلغ من خبره، ولو لم يكن عنده شهادة لرد استشهاده بالبرهان، فسكوته يدل على أن عنده شهادة مكتومة.\nوإنما أمر الله باستشهاد أهل الكتاب لأنهم أهل هذا الشأن، وكل أمر إنما يستشهد فيه أهله ومن هم أعلم به من غيرهم، بخلاف من هو أجنبي عنه، كالأميين من مشركي العرب وغيرهم، فلا فائدة في استشهادهم لعدم خبرتهم ومعرفتهم والله أعلم.\nتم تفسير سورة الرعد ,\nوالحمد لله رب العالمين.\n                                    "
      },
      "originalText": "وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ ٣٤"
    },
    {
      "number": 1751,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الر ۚ كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِ رَبِّهِمْ إِلَىٰ صِرَاطِ الْعَزِيزِ الْحَمِيدِ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 1,
      "juz": 13,
      "manzil": 3,
      "page": 255,
      "ruku": 211,
      "hizbQuarter": 102,
      "sajda": false,
      "tafsier": {
        "ibnkther": "الٓرۚ كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَٰطِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ ١\n                                    \n                                    \n                                    تفسير سورة إبراهيم عليه السلام وهي مكية .\nقد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه.\nوحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\n( كتاب أنزلناه إليك ) أي : هذا كتاب أنزلناه إليك يا محمد ، وهو القرآن العظيم ، الذي هو أشرف كتاب أنزله الله من السماء ، على أشرف رسول بعثه الله في الأرض ، إلى جميع أهلها عربهم وعجمهم .\n( لتخرج الناس من الظلمات إلى النور ) أي : إنما بعثناك يا محمد بهذا الكتاب; لتخرج الناس مما هم فيه من الضلال والغي إلى الهدى والرشد ، كما قال : ( الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات ) الآية [ البقرة : 257 ] ، وقال تعالى : ( هو الذي ينزل على عبده آيات بينات ليخرجكم من الظلمات إلى النور ) [ الحديد : 9 ] .\nوقوله : ( بإذن ربهم ) أي : هو الهادي لمن قدر له الهداية على يدي رسوله المبعوث عن أمره يهديهم ( إلى صراط العزيز ) أي : العزيز الذي لا يمانع ولا يغالب ، بل هو القاهر لكل ما سواه ، \" الحميد \" أي : المحمود في جميع أفعاله وأقواله ، وشرعه وأمره ونهيه ، الصادق في خبره .\n                                    ",
        "qortoby": "الٓرۚ كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَٰطِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ ١\n                                    \n                                    \n                                    تفسير سورة إبراهيم\nصلى الله على محمد وآله وسلم تسليما\nمكية كلها في قول الحسن وعكرمة وجابر . وقال ابن عباس وقتادة : إلا آيتين منها مدنيتين وقيل : ثلاث ، نزلت في الذين حاربوا الله ورسوله وهي قوله تعالى : ألم تر إلى الذين بدلوا نعمة الله كفرا إلى قوله : فإن مصيركم إلى النار .\nبسم الله الرحمن الرحيم\nالر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم إلى صراط العزيز الحميد\nقوله تعالى : الر كتاب أنزلناه إليك تقدم معناه . لتخرج الناس أي بالكتاب ، وهو القرآن ، أي بدعائك إليه . من الظلمات إلى النور أي من ظلمات الكفر والضلالة والجهل إلى نور الإيمان والعلم ; وهذا على التمثيل ; لأن الكفر بمنزلة الظلمة ; والإسلام بمنزلة النور . وقيل : من البدعة إلى السنة ، ومن الشك إلى اليقين ، والمعنى . متقارب .\nبإذن ربهم أي بتوفيقه إياهم ولطفه بهم ، والباء في \" بإذن ربهم \" متعلقة ب \" تخرج \" وأضيف الفعل إلى النبي - صلى الله عليه وسلم - لأنه الداعي والمنذر الهادي .\nإلى صراط العزيز الحميد هو كقولك : خرجت إلى زيد العاقل الفاضل من غير واو ، لأنهما شيء واحد ; والله هو العزيز الذي لا مثل له ولا شبيه . وقيل : العزيز الذي لا يغلبه غالب . وقيل : العزيز المنيع في ملكه وسلطانه . الحميد أي المحمود بكل لسان ، والممجد في كل مكان على كل حال . وروى مقسم عن ابن عباس قال : كان قوم آمنوا بعيسى ابن مريم ، وقوم كفروا به ، فلما بعث محمد - صلى الله عليه وسلم - آمن به الذين كفروا بعيسى ، وكفر الذين آمنوا بعيسى ; فنزلت هذه الآية ، ذكره الماوردي .\n                                    ",
        "saadi": "الٓرۚ كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَٰطِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ ١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه أنزل كتابه على رسوله محمد صلى الله عليه وسلم لنفع الخلق، ليخرج الناس من ظلمات الجهل والكفر والأخلاق السيئة وأنواع المعاصي إلى نور العلم والإيمان والأخلاق الحسنة، وقوله: { بِإِذْنِ رَبِّهِمْ } أي: لا يحصل منهم المراد المحبوب لله، إلا بإرادة من الله ومعونة، ففيه حث للعباد على الاستعانة بربهم.\nثم فسر النور الذي يهديهم إليه هذا الكتاب فقال: { إِلَى صِرَاطِ الْعَزِيزِ الْحَمِيدِ } أي: الموصل إليه وإلى دار كرامته، المشتمل على العلم بالحق والعمل به، وفي ذكر { العزيز الحميد } بعد ذكر الصراط الموصل إليه إشارة إلى أن من سلكه فهو عزيز بعز الله قوي ولو لم يكن له أنصار إلا الله، محمود في أموره، حسن العاقبة.\n                                    "
      },
      "originalText": "الٓرۚ كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَٰطِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ ١"
    },
    {
      "number": 1752,
      "text": "اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَوَيْلٌ لِلْكَافِرِينَ مِنْ عَذَابٍ شَدِيدٍ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 2,
      "juz": 13,
      "manzil": 3,
      "page": 255,
      "ruku": 211,
      "hizbQuarter": 102,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱللَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَوَيۡلٞ لِّلۡكَٰفِرِينَ مِنۡ عَذَابٖ شَدِيدٍ ٢\n                                    \n                                    \n                                    وقوله : ( الله الذي له ما في السماوات وما في الأرض ) قرأه بعضهم مستأنفا مرفوعا ، وقرأه آخرون على الإتباع صفة للجلالة ، كما قال تعالى : ( قل ياأيها الناس إني رسول الله إليكم جميعا الذي له ملك السماوات والأرض ) [ الأعراف : 158 ] .\nوقوله : ( وويل للكافرين من عذاب شديد ) أي : ويل لهم يوم القيامة إذ خالفوك يا محمد وكذبوك .\n                                    ",
        "qortoby": "ٱللَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَوَيۡلٞ لِّلۡكَٰفِرِينَ مِنۡ عَذَابٖ شَدِيدٍ ٢\n                                    \n                                    \n                                    قوله تعالى : الله الذي له ما في السماوات وما في الأرض وويل للكافرين من عذاب شديد\nقوله تعالى : الله الذي له ما في السماوات وما في الأرض أي ملكا وعبيدا واختراعا وخلقا . وقرأ نافع وابن عامر وغيرهما : \" الله \" بالرفع على الابتداء الذي خبره . وقيل : الذي صفة ، والخبر مضمر ; أي الله الذي له ما في السماوات وما في الأرض قادر على كل شيء . الباقون بالخفض نعتا للعزيز الحميد فقدم النعت على المنعوت ; كقولك : مررت بالظريف زيد . وقيل : على البدل من الحميد وليس صفة ; لأن اسم الله صار كالعلم فلا يوصف ; كما لا يوصف بزيد وعمرو ، بل يجوز أن يوصف به من حيث المعنى ; لأن معناه أنه المنفرد بقدرة الإيجاد . وقال أبو عمرو : والخفض على التقديم والتأخير ، مجازه : إلى صراط الله العزيز الحميد الذي له ما في السماوات وما في الأرض . وكان يعقوب إذا وقف على الحميد رفع ، وإذا وصل خفض على النعت . قال ابن الأنباري : من خفض وقف على وما في الأرض .\nقوله تعالى : وويل للكافرين من عذاب شديد قد تقدم معنى الويل في \" البقرة \" وقال الزجاج : هي كلمة تقال للعذاب والهلكة . من عذاب شديد أي من جهنم .\n                                    ",
        "saadi": "ٱللَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَوَيۡلٞ لِّلۡكَٰفِرِينَ مِنۡ عَذَابٖ شَدِيدٍ ٢\n                                        \n                                        \n                                        \n                                        وليدل ذلك على أن صراط الله من أكبر الأدلة على ما لله من صفات الكمال، ونعوت الجلال، وأن الذي نصبه لعباده، عزيز السلطان، حميد في أقواله وأفعاله وأحكامه، وأنه مألوه معبود بالعبادات التي هي منازل الصراط المستقيم، وأنه كما أن له ملك السماوات والأرض خلقا ورزقا وتدبيرا، فله الحكم على عباده بأحكامه الدينية، لأنهم ملكه، ولا يليق به أن يتركهم سدى، فلما بيَّن الدليل والبرهان توعد من لم ينقد لذلك، فقال: { وَوَيْلٌ لِلْكَافِرِينَ مِنْ عَذَابٍ شَدِيدٍ } لا يقدر قدره، ولا يوصف أمره\n                                    "
      },
      "originalText": "ٱللَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَوَيۡلٞ لِّلۡكَٰفِرِينَ مِنۡ عَذَابٖ شَدِيدٍ ٢"
    },
    {
      "number": 1753,
      "text": "الَّذِينَ يَسْتَحِبُّونَ الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا ۚ أُولَٰئِكَ فِي ضَلَالٍ بَعِيدٍ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 3,
      "juz": 13,
      "manzil": 3,
      "page": 255,
      "ruku": 211,
      "hizbQuarter": 102,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَسۡتَحِبُّونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجًاۚ أُوْلَٰٓئِكَ فِي ضَلَٰلِۢ بَعِيدٖ ٣\n                                    \n                                    \n                                    ثم وصفهم بأنهم يستحبون الحياة الدنيا على الآخرة ، أي : يقدمونها ويؤثرونها عليها ، ويعملون للدنيا ونسوا الآخرة ، وتركوها وراء ظهورهم ، ( ويصدون عن سبيل الله ) وهي اتباع الرسل ( ويبغونها عوجا ) أي : ويحبون أن تكون سبيل الله عوجا مائلة عائلة وهي مستقيمة في نفسها ، لا يضرها من خالفها ولا من خذلها ، فهم في ابتغائهم ذلك في جهل وضلال بعيد من الحق ، لا يرجى لهم - والحالة هذه - صلاح .\n                                    ",
        "qortoby": "ٱلَّذِينَ يَسۡتَحِبُّونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجًاۚ أُوْلَٰٓئِكَ فِي ضَلَٰلِۢ بَعِيدٖ ٣\n                                    \n                                    \n                                    الذين يستحبون الحياة الدنيا على الآخرة ويصدون عن سبيل الله أي يختارونها على الآخرة ، والكافرون يفعلون ذلك . ف \" الذين في موضع خفض صفة لهم . وقيل : في موضع رفع خبر ابتداء مضمر ، أي هم الذين ، وقيل : الذين يستحبون مبتدأ وخبره \" أولئك \" وكل من آثر الدنيا وزهرتها ، واستحب البقاء في نعيمها على النعيم في الآخرة ، وصد عن سبيل الله - أي صرف الناس عنه وهو دين الله ، الذي جاءت به الرسل ، في قول ابن عباس وغيره - فهو داخل في هذه الآية ; وقد قال - صلى الله عليه وسلم - : إن أخوف ما أخاف على أمتي الأئمة المضلون وهو حديث صحيح . وما أكثر ما هم في هذه الأزمان ، والله المستعان . وقيل : يستحبون أي يلتمسون الدنيا من غير وجهها ; لأن نعمة الله لا تلتمس إلا بطاعته دون معصيته .\nويبغونها عوجا أي يطلبون لها زيغا وميلا لموافقة أهوائهم ، وقضاء حاجاتهم وأغراضهم . والسبيل تذكر وتؤنث . والعوج بكسر العين في الدين والأمر والأرض وفي كل ما لم يكن قائما ; وبفتح العين في كل ما كان قائما ، كالحائط والرمح ونحوه ; وقد تقدم في \" آل عمران \" وغيرها .\nأولئك في ضلال بعيد أي : ذهاب عن الحق بعيد عنه .\n                                    ",
        "saadi": "ٱلَّذِينَ يَسۡتَحِبُّونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجًاۚ أُوْلَٰٓئِكَ فِي ضَلَٰلِۢ بَعِيدٖ ٣\n                                        \n                                        \n                                        \n                                        { الَّذِينَ يَسْتَحِبُّونَ الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ } فرضوا بها واطمأنوا، وغفلوا عن الدار الآخرة.\n{ وَيَصُدُّونَ } الناس { عَنْ سَبِيلِ اللَّهِ } التي نصبها لعباده وبينها في كتبه وعلى ألسنة رسله، فهؤلاء قد نابذوا مولاهم بالمعاداة والمحاربة، { وَيَبْغُونَهَا } أي: سبيل الله { عِوَجًا } أي: يحرصون على تهجينها وتقبيحها، للتنفير عنها، ولكن يأبى الله إلا أن يتم نوره ولو كره الكافرون.\n{ أُولَئِكَ } الذين ذكر وصفهم { فِي ضَلَالٍ بَعِيدٍ } لأنهم ضلوا وأضلوا، وشاقوا الله ورسوله وحاربوهما، فأي ضلال أبعد من هذا؟\" وأما أهل الإيمان فبعكس هؤلاء يؤمنون بالله وآياته، ويستحبون الآخرة على الدنيا ويدعون إلى سبيل الله ويحسنونها مهما أمكنهم، ويبينون استقامتها.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَسۡتَحِبُّونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَيَبۡغُونَهَا عِوَجًاۚ أُوْلَٰٓئِكَ فِي ضَلَٰلِۢ بَعِيدٖ ٣"
    },
    {
      "number": 1754,
      "text": "وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ ۖ فَيُضِلُّ اللَّهُ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 4,
      "juz": 13,
      "manzil": 3,
      "page": 255,
      "ruku": 211,
      "hizbQuarter": 102,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَآ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ لِيُبَيِّنَ لَهُمۡۖ فَيُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤\n                                    \n                                    \n                                    هذا من لطفه تعالى بخلقه : أنه يرسل إليهم رسلا منهم بلغاتهم ليفهموا عنهم ما يريدون وما أرسلوا به إليهم ، كما قال الإمام أحمد :\nحدثنا وكيع ، عن عمر بن ذر قال : قال مجاهد : عن أبي ذر قال : قال رسول الله ، صلى الله عليه وسلم : \" لم يبعث الله ، عز وجل ، نبيا إلا بلغة قومه \" .\nوقوله : ( فيضل الله من يشاء ويهدي من يشاء ) أي : بعد البيان وإقامة الحجة عليهم يضل تعالى من يشاء عن وجه الهدى ، ويهدي من يشاء إلى الحق ، ( وهو العزيز ) الذي ما شاء كان ، وما لم يشأ لم يكن ، ( الحكيم ) في أفعاله ، فيضل من يستحق الإضلال ، ويهدي من هو أهل لذلك .\nوقد كانت هذه سنة الله في خلقه : أنه ما بعث نبيا في أمة إلا أن يكون بلغتهم ، فاختص كل نبي بإبلاغ رسالته إلى أمته دون غيرهم ، واختص محمد بن عبد الله رسول الله بعموم الرسالة إلى سائر الناس ، كما ثبت في الصحيحين عن جابر قال : قال رسول الله ، صلى الله عليه وسلم : \" أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي : نصرت بالرعب مسيرة شهر ، وجعلت لي الأرض مسجدا وطهورا ، وأحلت لي الغنائم ولم تحل لأحد قبلي ، وأعطيت الشفاعة ، وكان النبي يبعث إلى قومه ، وبعثت إلى الناس عامة \" .\nوله شواهد من وجوه كثيرة ، وقال تعالى : ( قل ياأيها الناس إني رسول الله إليكم جميعا ) [ الأعراف : 158 ] .\n                                    ",
        "qortoby": "وَمَآ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ لِيُبَيِّنَ لَهُمۡۖ فَيُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤\n                                    \n                                    \n                                    قوله تعالى : وما أرسلنا من رسول إلا بلسان قومه ليبين لهم فيضل الله من يشاء ويهدي من يشاء وهو العزيز الحكيم\nقوله تعالى وما أرسلنا من رسول أي قبلك يا محمد إلا بلسان قومه أي بلغتهم ، ليبين لهم أمر دينهم ; ووحد اللسان وإن أضافه إلى القوم لأن المراد اللغة ; فهي اسم جنس يقع على القليل والكثير ; ولا حجة للعجم وغيرهم في هذه الآية ; لأن كل من ترجم له ما جاء به النبي - صلى الله عليه وسلم - ترجمة يفهمها لزمته الحجة ، وقد قال الله تعالى : وما أرسلناك إلا كافة للناس بشيرا ونذيرا . وقال - صلى الله عليه وسلم - : أرسل كل نبي إلى أمته بلسانها وأرسلني الله إلى كل أحمر وأسود من خلقه . وقال - صلى الله عليه وسلم - : والذي نفسي بيده لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني ثم لم يؤمن بالذي أرسلت به إلا كان من أصحاب النار . خرجه مسلم ، وقد تقدم .\nفيضل الله من يشاء ويهدي من يشاء رد على القدرية في نفوذ المشيئة ، وهو مستأنف ، وليس بمعطوف على ليبين لأن الإرسال إنما وقع للتبيين لا للإضلال . ويجوز النصب في يضل لأن الإرسال صار سببا للإضلال ; فيكون كقوله : ليكون لهم عدوا وحزنا وإنما صار الإرسال سببا للإضلال لأنهم كفروا به لما جاءهم ; فصار كأنه سبب لكفرهم\nوهو العزيز الحكيم تقدم معناه .\n                                    ",
        "saadi": "وَمَآ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ لِيُبَيِّنَ لَهُمۡۖ فَيُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤\n                                        \n                                        \n                                        \n                                        وهذا من لطفه بعباده أنه ما أرسل رسولا { إلا بلسان قومه ليبين لهم } ما يحتاجون إليه، ويتمكنون من تعلم ما أتى به، بخلاف ما لو كانوا على غير لسانهم، فإنهم يحتاجون إلى أن يتعلموا تلك اللغة التي يتكلم بها، ثم يفهمون عنه، فإذا بين لهم الرسول ما أمروا به، ونهوا عنه وقامت عليهم حجة الله { فيضل الله من يشاء } ممن لم ينقد للهدى، ويهدي من يشاء ممن اختصه برحمته.\n{ وهو العزيز الحكيم } الذي -من عزته- أنه انفرد بالهداية والإضلال، وتقليب القلوب إلى ما شاء، ومن حكمته أنه لا يضع هدايته ولا إضلاله إلا بالمحل اللائق به.\nويستدل بهذه الآية الكريمة على أن علوم العربية الموصلة إلى تبيين كلامه وكلام رسوله أمور مطلوبة محبوبة لله لأنه لا يتم معرفة ما أنزل على رسوله إلا بها إلا إذا كان الناس بحالة لا يحتاجون إليها، وذلك إذا تمرنوا على العربية، ونشأ عليها صغيرهم وصارت طبيعة لهم فحينئذ قد اكتفوا المؤنة، وصلحوا لأن يتلقوا عن الله وعن رسوله ابتداء كما تلقى عنهم الصحابة رضي الله عنهم.\n                                    "
      },
      "originalText": "وَمَآ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ لِيُبَيِّنَ لَهُمۡۖ فَيُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤"
    },
    {
      "number": 1755,
      "text": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا أَنْ أَخْرِجْ قَوْمَكَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 5,
      "juz": 13,
      "manzil": 3,
      "page": 255,
      "ruku": 211,
      "hizbQuarter": 102,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِ‍َٔايَٰتِنَآ أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ وَذَكِّرۡهُم بِأَيَّىٰمِ ٱللَّهِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ ٥\n                                    \n                                    \n                                    يقول تعالى : وكما أرسلناك يا محمد وأنزلنا عليك الكتاب ، لتخرج الناس كلهم ، تدعوهم إلى الخروج من الظلمات إلى النور ، كذلك أرسلنا موسى في بني إسرائيل بآياتنا .\nقال مجاهد : وهي التسع الآيات .\n( أن أخرج قومك من الظلمات ) أي : أمرناه قائلين له : ( أخرج قومك من الظلمات إلى النور ) أي : ادعهم إلى الخير ، ليخرجوا من ظلمات ما كانوا فيه من الجهل والضلال إلى نور الهدى وبصيرة الإيمان .\n( وذكرهم بأيام الله ) أي : بأياديه ونعمه عليهم ، في إخراجه إياهم من أسر فرعون وقهره وظلمه وغشمه ، وإنجائه إياهم من عدوهم ، وفلقه لهم البحر ، وتظليله إياهم بالغمام ، وإنزاله عليهم المن والسلوى ، إلى غير ذلك من النعم . قال ذلك مجاهد ، وقتادة ، وغير واحد .\nوقد ورد فيه الحديث المرفوع الذي رواه عبد الله ابن الإمام أحمد بن حنبل في مسند أبيه حيث قال : حدثني يحيى بن عبد الله مولى بني هاشم ، حدثنا محمد بن أبان الجعفي ، عن أبي إسحاق ، عن سعيد بن جبير [ عن ابن عباس ، عن أبي بن كعب ، عن النبي ، صلى الله عليه وسلم ، في قوله تبارك وتعالى : ( وذكرهم بأيام الله ) قال : \" بنعم الله تبارك وتعالى ] \" .\n[ ورواه ابن جرير ] وابن أبي حاتم ، من حديث محمد بن أبان ، به ورواه عبد الله ابنه أيضا موقوفا وهو أشبه .\nوقوله : ( إن في ذلك لآيات لكل صبار شكور ) أي : إن فيما صنعنا بأوليائنا بني إسرائيل حين أنقذناهم من يد فرعون ، وأنجيناهم مما كانوا فيه من العذاب المهين ، لعبرة لكل صبار ، أي : في الضراء ، شكور ، أي : في السراء ، كما قال قتادة : نعم العبد ، عبد إذا ابتلي صبر ، وإذا أعطي شكر .\nوكذا جاء في الصحيح عن رسول الله - صلى الله عليه وسلم - أنه قال : \" إن أمر المؤمن كله عجب ، لا يقضي الله له قضاء إلا كان خيرا له ، إن أصابته ضراء صبر فكان خيرا له ، وإن أصابته سراء شكر فكان خيرا له \" .\n                                    ",
        "qortoby": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِ‍َٔايَٰتِنَآ أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ وَذَكِّرۡهُم بِأَيَّىٰمِ ٱللَّهِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ ٥\n                                    \n                                    \n                                    قوله تعالى : ولقد أرسلنا موسى بآياتنا أن أخرج قومك من الظلمات إلى النور وذكرهم بأيام الله إن في ذلك لآيات لكل صبار شكور\nقوله تعالى : ولقد أرسلنا موسى بآياتنا أي بحجتنا وبراهيننا ; أي بالمعجزات الدالة على صدقه . قال مجاهد : هي التسع الآيات\nأن أخرج قومك من الظلمات إلى النور نظيره قوله تعالى : لنبينا - عليه السلام - أول السورة : لتخرج الناس من الظلمات إلى النور وقيل : \" أن \" هنا بمعنى أي ، كقوله تعالى : وانطلق الملأ منهم أن امشوا أي امشوا .\nقوله تعالى : وذكرهم بأيام الله أي قل لهم قولا يتذكرون به أيام الله تعالى . قال ابن عباس ومجاهد وقتادة : بنعم الله عليهم ; وقاله أبي بن كعب ورواه مرفوعا ; أي بما أنعم الله عليهم من النجاة من فرعون ومن التيه إلى سائر النعم ، وقد تسمى النعم الأيام ; ومنه قول عمرو بن كلثوم :\nوأيام لنا غر طوال\nوعن ابن عباس أيضا ومقاتل : بوقائع الله في الأمم السالفة ; يقال : فلان عالم بأيام العرب ، أي بوقائعها . قال ابن زيد : يعني الأيام التي انتقم فيها من الأمم الخالية ; وكذلك روى ابن وهب عن مالك قال : بلاؤه . وقال الطبري : وعظهم بما سلف في الأيام الماضية لهم ، أي بما كان في أيام الله من النعمة والمحنة ; وقد كانوا عبيدا مستذلين ; واكتفى بذكر الأيام عنه لأنها كانت معلومة عندهم . وروى سعيد بن جبير عن ابن عباس عن أبي بن كعب قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : بينا موسى - عليه السلام - في قومه يذكرهم بأيام الله ، وأيام الله بلاؤه ونعماؤه وذكر حديث الخضر ; ودل هذا على جواز الوعظ المرقق للقلوب ، المقوي لليقين . الخالي من كل بدعة ، والمنزه عن كل ضلالة وشبهة .\nإن في ذلك أي في التذكير بأيام الله \" لآيات \" أي دلالات . لكل صبار أي كثير الصبر على طاعة الله ، وعن معاصيه . شكور لنعم الله . وقال قتادة : هو العبد ; إذا أعطي شكر ، وإذا ابتلي صبر . وروي عن النبي صلى الله عليه وسلم أنه قال : الإيمان نصفان نصف صبر ونصف شكر - ثم تلا هذه الآية - إن في ذلك لآيات لكل صبار شكور . ونحوه عن الشعبي موقوفا . وتوارى الحسن البصري عن الحجاج سبع سنين ، فلما بلغه موته قال : اللهم قد أمته فأمت سنته ، وسجد شكرا ، وقرأ : إن في ذلك لآيات لكل صبار شكور . وإنما خص بالآيات كل صبار شكور ; لأنه يعتبر بها ولا يغفل عنها ; كما قال : إنما أنت منذر من يخشاها وإن كان منذرا للجميع .\n                                    ",
        "saadi": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِ‍َٔايَٰتِنَآ أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ وَذَكِّرۡهُم بِأَيَّىٰمِ ٱللَّهِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ ٥\n                                        \n                                        \n                                        \n                                        يخبر تعالى: أنه أرسل موسى بآياته العظيمة الدالة على صدق ما جاء به وصحته، وأمره بما أمر الله به رسوله محمدا صلى الله عليه وسلم بل وبما أمر به جميع الرسل قومهم { أَنْ أَخْرِجْ قَوْمَكَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ } أي: ظلمات الجهل والكفر وفروعه، إلى نور العلم والإيمان وتوابعه.\n{ وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ } أي: بنعمه عليهم وإحسانه إليهم، وبأيامه في الأمم المكذبين، ووقائعه بالكافرين، ليشكروا نعمه وليحذروا عقابه، { إِنَّ فِي ذَلِكَ } أي: في أيام الله على العباد { لآيات لِكُلِّ صَبَّارٍ شَكُورٍ } أي: صبار في الضراء والعسر والضيق، شكور على السراء والنعمة.\n                                    "
      },
      "originalText": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِ‍َٔايَٰتِنَآ أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ وَذَكِّرۡهُم بِأَيَّىٰمِ ٱللَّهِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ ٥"
    }
  ]
}