{
  "number": 258,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 1769,
      "text": "أَلَمْ تَرَ أَنَّ اللَّهَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ ۚ إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 19,
      "juz": 13,
      "manzil": 3,
      "page": 258,
      "ruku": 213,
      "hizbQuarter": 103,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِن يَشَأۡ يُذۡهِبۡكُمۡ وَيَأۡتِ بِخَلۡقٖ جَدِيدٖ ٩١\n                                    \n                                    \n                                    يقول تعالى مخبرا عن قدرته على معاد الأبدان يوم القيامة ، بأنه خلق السموات والأرض التي هي أكبر من خلق الناس ، أفليس الذي قدر على خلق هذه السموات ، في ارتفاعها واتساعها وعظمتها وما فيها من الكواكب الثوابت والسيارات ، والحركات المختلفات ، والآيات الباهرات ، وهذه الأرض بما فيها من مهاد ووهاد وأوتاد ، وبراري وصحاري وقفار ، وبحار وأشجار ، ونبات وحيوان ، على اختلاف أصنافها ومنافعها ، وأشكالها وألوانها; ( أولم يروا أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير ) [ الأحقاف : 33 ] ، وقال تعالى : ( أولم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون أوليس الذي خلق السماوات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم إنما أمره إذا أراد شيئا أن يقول له كن فيكون فسبحان الذي بيده ملكوت كل شيء وإليه ترجعون ) [ يس : 77 - 83 ] .\nوقوله : ( إن يشأ يذهبكم ويأت بخلق جديد)\n                                    ",
        "qortoby": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِن يَشَأۡ يُذۡهِبۡكُمۡ وَيَأۡتِ بِخَلۡقٖ جَدِيدٖ ٩١\n                                    \n                                    \n                                    قوله تعالى : ألم تر أن الله خلق السماوات والأرض بالحق الرؤية هنا رؤية القلب ; لأن المعنى : ألم ينته علمك إليه . وقرأ حمزة والكسائي خالق السماوات والأرض . ومعنى \" بالحق \" ليستدل بها على قدرته .\nإن يشأ يذهبكم أيها الناس ; أي هو قادر على الإفناء كما قدر على إيجاد الأشياء ; فلا تعصوه فإنكم إن عصيتموه يذهبكم ويأت بخلق جديد أفضل وأطوع منكم ; إذ لو كانوا مثل الأولين فلا فائدة في الإبدال .\n                                    ",
        "saadi": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِن يَشَأۡ يُذۡهِبۡكُمۡ وَيَأۡتِ بِخَلۡقٖ جَدِيدٖ ٩١\n                                        \n                                        \n                                        \n                                        ينبه تعالى عباده بأنه { خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقَّ } أي: ليعبده الخلق ويعرفوه، ويأمرهم وينهاهم وليستدلوا بهما وما فيهما على ما له من صفات الكمال، وليعلموا أن الذي خلق السماوات والأرض -على عظمهما وسعتهما- قادر على أن يعيدهم خلقا جديدا، ليجازيهم بإحسانهم وإساءتهم، وأن قدرته ومشيئته لا تقصر عن ذلك ولهذا قال: { إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ }\nيحتمل أن المعنى: إن يشأ يذهبكم ويأت بقوم غيركم يكونون أطوع لله منكم، ويحتمل أن المراد أنه: إن يشأ يفنيكم ثم يعيدهم بالبعث خلقا جديدا، ويدل على هذا الاحتمال ما ذكره بعده من أحوال القيامة.\n                                    "
      },
      "originalText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِن يَشَأۡ يُذۡهِبۡكُمۡ وَيَأۡتِ بِخَلۡقٖ جَدِيدٖ ٩١"
    },
    {
      "number": 1770,
      "text": "وَمَا ذَٰلِكَ عَلَى اللَّهِ بِعَزِيزٍ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 20,
      "juz": 13,
      "manzil": 3,
      "page": 258,
      "ruku": 213,
      "hizbQuarter": 103,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٖ ٠٢\n                                    \n                                    \n                                    وقوله \" وما ذلك على الله بعزيز \" أي : بعظيم ولا ممتنع ، بل هو سهل عليه إذا خالفتم أمره ، أن يذهبكم ويأتي بآخرين على غير صفتكم ، كما قال تعالى : ( يا أيها الناس أنتم الفقراء إلى الله والله هو الغني الحميد إن يشأ يذهبكم ويأت بخلق جديد وما ذلك على الله بعزيز ) [ فاطر : 15 - 17 ] وقال : ( وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم ) [ محمد : 38 ] ، وقال : ( ياأيها الذين آمنوا من يرتد منكم عن دينه فسوف يأتي الله بقوم يحبهم ويحبونه ) [ المائدة : 54 ] وقال : ( إن يشأ يذهبكم أيها الناس ويأت بآخرين وكان الله على ذلك قديرا ) [ النساء : 133 ] .\n                                    ",
        "qortoby": "وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٖ ٠٢\n                                    \n                                    \n                                    وما ذلك على الله بعزيز أي منيع متعذر\n                                    ",
        "saadi": "وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٖ ٠٢\n                                        \n                                        \n                                        \n                                        { وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ } أي: بممتنع بل هو سهل عليه جدا، { ما خلقكم ولا بعثكم إلا كنفس واحدة } { وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه }\n                                    "
      },
      "originalText": "وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٖ ٠٢"
    },
    {
      "number": 1771,
      "text": "وَبَرَزُوا لِلَّهِ جَمِيعًا فَقَالَ الضُّعَفَاءُ لِلَّذِينَ اسْتَكْبَرُوا إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنْتُمْ مُغْنُونَ عَنَّا مِنْ عَذَابِ اللَّهِ مِنْ شَيْءٍ ۚ قَالُوا لَوْ هَدَانَا اللَّهُ لَهَدَيْنَاكُمْ ۖ سَوَاءٌ عَلَيْنَا أَجَزِعْنَا أَمْ صَبَرْنَا مَا لَنَا مِنْ مَحِيصٍ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 21,
      "juz": 13,
      "manzil": 3,
      "page": 258,
      "ruku": 213,
      "hizbQuarter": 103,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَبَرَزُواْ لِلَّهِ جَمِيعٗا فَقَالَ ٱلضُّعَفَٰٓؤُاْ لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُنَّا لَكُمۡ تَبَعٗا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا مِنۡ عَذَابِ ٱللَّهِ مِن شَيۡءٖۚ قَالُواْ لَوۡ هَدَىٰنَا ٱللَّهُ لَهَدَيۡنَٰكُمۡۖ سَوَآءٌ عَلَيۡنَآ أَجَزِعۡنَآ أَمۡ صَبَرۡنَا مَا لَنَا مِن مَّحِيصٖ ١٢\n                                    \n                                    \n                                    يقول : ( وبرزوا [ لله ] ) أي : برزت الخلائق كلها ، برها وفاجرها لله وحده الواحد القهار ، أي : اجتمعوا له في براز من الأرض ، وهو المكان الذي ليس فيه شيء يستر أحدا .\n( فقال الضعفاء ) وهم الأتباع لقادتهم وسادتهم وكبرائهم الذين استكبروا عن عبادة الله وحده لا شريك له ، وعن موافقة الرسل ، فقالوا لهم : ( إنا كنا لكم تبعا ) أي : مهما أمرتمونا ائتمرنا وفعلنا ، ( فهل أنتم مغنون عنا من عذاب الله من شيء ) أي : فهل تدفعون عنا شيئا من عذاب الله ، كما كنتم تعدوننا وتمنوننا ؟ فقالت القادة لهم : ( لو هدانا الله لهديناكم ) ولكن حق علينا قول ربنا ، وسبق فينا وفيكم قدر الله ، وحقت كلمة العذاب على الكافرين ( سواء علينا أجزعنا أم صبرنا ما لنا من محيص ) أي : ليس لنا خلاص مما نحن فيه إن صبرنا عليه أو جزعنا منه .\nقال عبد الرحمن بن زيد بن أسلم : إن أهل النار قال بعضهم لبعض : تعالوا ، فإنما أدرك أهل الجنة الجنة ببكائهم وتضرعهم إلى الله - عز وجل - تعالوا نبك ونتضرع إلى الله فبكوا وتضرعوا ، فلما رأوا ذلك لا ينفعهم قالوا : تعالوا ، فإنما أدرك أهل الجنة الجنة بالصبر ، تعالوا حتى نصبر فصبروا صبرا لم ير مثله ، فلم ينفعهم ذلك ، فعند ذلك قالوا ( سواء علينا أجزعنا أم صبرنا ما لنا من محيص )\nقلت : والظاهر أن هذه المراجعة في النار بعد دخولهم إليها ، كما قال تعالى : ( وإذ يتحاجون في النار فيقول الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا نصيبا من النار قال الذين استكبروا إنا كل فيها إن الله قد حكم بين العباد ) [ غافر : 47 ، 48 ] وقال تعالى : ( قال ادخلوا في أمم قد خلت من قبلكم من الجن والإنس في النار كلما دخلت أمة لعنت أختها حتى إذا اداركوا فيها جميعا قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون وقالت أولاهم لأخراهم فما كان لكم علينا من فضل فذوقوا العذاب بما كنتم تكسبون ) [ الأعراف : 38 ، 39 ] ، وقال تعالى : ( يوم تقلب وجوههم في النار يقولون يا ليتنا أطعنا الله وأطعنا الرسولا وقالوا ربنا إنا أطعنا سادتنا وكبراءنا فأضلونا السبيلا ربنا آتهم ضعفين من العذاب والعنهم لعنا كبيرا ) [ الأحزاب : 66 - 68 ] .\nوأما تخاصمهم في المحشر ، فقال تعالى : ( ولو ترى إذ الظالمون موقوفون عند ربهم يرجع بعضهم إلى بعض القول يقول الذين استضعفوا للذين استكبروا لولا أنتم لكنا مؤمنين قال الذين استكبروا للذين استضعفوا أنحن صددناكم عن الهدى بعد إذ جاءكم بل كنتم مجرمين وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا وأسروا الندامة لما رأوا العذاب وجعلنا الأغلال في أعناق الذين كفروا هل يجزون إلا ما كانوا يعملون ) [ سبأ : 31 - 33 ] .\n                                    ",
        "qortoby": "وَبَرَزُواْ لِلَّهِ جَمِيعٗا فَقَالَ ٱلضُّعَفَٰٓؤُاْ لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُنَّا لَكُمۡ تَبَعٗا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا مِنۡ عَذَابِ ٱللَّهِ مِن شَيۡءٖۚ قَالُواْ لَوۡ هَدَىٰنَا ٱللَّهُ لَهَدَيۡنَٰكُمۡۖ سَوَآءٌ عَلَيۡنَآ أَجَزِعۡنَآ أَمۡ صَبَرۡنَا مَا لَنَا مِن مَّحِيصٖ ١٢\n                                    \n                                    \n                                    قوله : وبرزوا لله جميعا أي برزوا من قبورهم ، يعني يوم القيامة . والبروز الظهور . والبراز المكان الواسع لظهوره ; ومنه امرأة برزة أي تظهر للناس ; فمعنى ، برزوا ظهروا من قبورهم . وجاء بلفظ الماضي ومعناه الاستقبال ، واتصل هذا بقوله : وخاب كل جبار عنيد أي وقاربوا لما استفتحوا فأهلكوا ، ثم بعثوا للحساب فبرزوا لله جميعا لا يسترهم عنه ساتر . \" لله \" لأجل أمر الله إياهم بالبروز .\nفقال الضعفاء يعني الأتباع\nللذين استكبروا وهم القادة .\nإنا كنا لكم تبعا يجوز أن يكون \" تبع \" مصدرا ; التقدير : ذوي تبع . ويجوز أن يكون جمع تابع ; مثل حارس وحرس ، وخادم وخدم ، وراصد ورصد ، وباقر وبقر .\nفهل أنتم مغنون أي دافعون عنا من عذاب الله من شيء أي شيئا ، و \" من \" صلة ; يقال : أغنى عنه إذا دفع عنه الأذى ، وأغناه إذا أوصل إليه النفع .\nقالوا لو هدانا الله لهديناكم أي لو هدانا الله إلى الإيمان لهديناكم إليه . وقيل : لو هدانا الله إلى طريق الجنة لهديناكم إليها . وقيل ; لو نجانا الله من العذاب لنجيناكم منه .\n\" سواء علينا \" هذا ابتداء خبره \" أجزعنا \" أي : سواء علينا أجزعنا أم صبرنا ما لنا من محيص أي من مهرب وملجأ . ويجوز أن يكون بمعنى المصدر ، وبمعنى الاسم ; يقال : حاص فلان عن كذا أي فر وزاغ يحيص حيصا وحيوصا وحيصانا ; والمعنى : ما لنا وجه نتباعد به عن النار . وروي عن النبي - صلى الله عليه وسلم - أنه قال : ( يقول أهل النار إذا اشتد بهم العذاب تعالوا نصبر فيصبرون خمسمائة عام فلما رأوا أن ذلك لا ينفعهم قالوا هلم فلنجزع فيجزعون ويصيحون خمسمائة عام فلما رأوا أن ذلك لا ينفعهم قالوا سواء علينا أجزعنا أم صبرنا ما لنا من محيص . وقال محمد بن كعب القرظي : ذكر لنا أن أهل النار يقول بعضهم لبعض : يا هؤلاء ! قد نزل بكم من البلاء والعذاب ما قد ترون ، فهلم فلنصبر ; فلعل الصبر ينفعنا كما صبر أهل الطاعة على طاعة الله فنفعهم الصبر إذ صبروا ; فأجمعوا رأيهم على الصبر فصبروا ; فطال صبرهم فجزعوا ، فنادوا : سواء علينا أجزعنا أم صبرنا ما لنا من محيص أي منجى ، فقام إبليس عند ذلك فقال : إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ما أنا بمصرخكم\nيقول : لست بمغن عنكم شيئا وما أنتم بمصرخي إني كفرت بما أشركتموني من قبل الحديث بطوله ، وقد كتبناه في كتاب التذكرة بكماله .\n                                    ",
        "saadi": "وَبَرَزُواْ لِلَّهِ جَمِيعٗا فَقَالَ ٱلضُّعَفَٰٓؤُاْ لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُنَّا لَكُمۡ تَبَعٗا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا مِنۡ عَذَابِ ٱللَّهِ مِن شَيۡءٖۚ قَالُواْ لَوۡ هَدَىٰنَا ٱللَّهُ لَهَدَيۡنَٰكُمۡۖ سَوَآءٌ عَلَيۡنَآ أَجَزِعۡنَآ أَمۡ صَبَرۡنَا مَا لَنَا مِن مَّحِيصٖ ١٢\n                                        \n                                        \n                                        \n                                        { وَبَرَزُوا } أي: الخلائق { لِلَّهِ جَمِيعًا } حين ينفخ في الصور فيخرجون من الأجداث إلى ربهم فيقفون في أرض مستوية قاع صفصف، لا ترى فيها عوجا ولا أمتا، ويبرزون له لا يخفى [عليه] منهم خافية، فإذا برزوا صاروا يتحاجون، وكل يدفع عن نفسه، ويدافع ما يقدر عليه، ولكن أني لهم ذلك؟\nفيقول { الضُّعَفَاءُ } أي: التابعون والمقلدون { لِلَّذِينَ اسْتَكْبَرُوا } وهم: المتبوعون الذين هم قادة في الضلال: { إِنَّا كُنَّا لَكُمْ تَبَعًا } أي: في الدنيا، أمرتمونا بالضلال، وزينتموه لنا فأغويتمونا، { فَهَلْ أَنْتُمْ مُغْنُونَ عَنَّا مِنْ عَذَابِ اللَّهِ مِنْ شَيْءٍ } أي: ولو مثقال ذرة، { قَالُوا } أي: المتبوعون والرؤساء { أغويناكم كما غوينا } و { لَوْ هَدَانَا اللَّهُ لَهَدَيْنَاكُمْ } فلا يغني أحد أحدا، { سَوَاءٌ عَلَيْنَا أَجَزِعْنَا } من العذاب { أَمْ صَبَرْنَا } عليه، { مَا لَنَا مِنْ مَحِيصٍ } أي: من ملجأ نلجأ إليه، ولا مهرب لنا من عذاب الله.\n                                    "
      },
      "originalText": "وَبَرَزُواْ لِلَّهِ جَمِيعٗا فَقَالَ ٱلضُّعَفَٰٓؤُاْ لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ إِنَّا كُنَّا لَكُمۡ تَبَعٗا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا مِنۡ عَذَابِ ٱللَّهِ مِن شَيۡءٖۚ قَالُواْ لَوۡ هَدَىٰنَا ٱللَّهُ لَهَدَيۡنَٰكُمۡۖ سَوَآءٌ عَلَيۡنَآ أَجَزِعۡنَآ أَمۡ صَبَرۡنَا مَا لَنَا مِن مَّحِيصٖ ١٢"
    },
    {
      "number": 1772,
      "text": "وَقَالَ الشَّيْطَانُ لَمَّا قُضِيَ الْأَمْرُ إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُكُمْ فَأَخْلَفْتُكُمْ ۖ وَمَا كَانَ لِيَ عَلَيْكُمْ مِنْ سُلْطَانٍ إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي ۖ فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ ۖ مَا أَنَا بِمُصْرِخِكُمْ وَمَا أَنْتُمْ بِمُصْرِخِيَّ ۖ إِنِّي كَفَرْتُ بِمَا أَشْرَكْتُمُونِ مِنْ قَبْلُ ۗ إِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 22,
      "juz": 13,
      "manzil": 3,
      "page": 258,
      "ruku": 214,
      "hizbQuarter": 103,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ ٱلشَّيۡطَٰنُ لَمَّا قُضِيَ ٱلۡأَمۡرُ إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ وَوَعَدتُّكُمۡ فَأَخۡلَفۡتُكُمۡۖ وَمَا كَانَ لِيَ عَلَيۡكُم مِّن سُلۡطَٰنٍ إِلَّآ أَن دَعَوۡتُكُمۡ فَٱسۡتَجَبۡتُمۡ لِيۖ فَلَا تَلُومُونِي وَلُومُوٓاْ أَنفُسَكُمۖ مَّآ أَنَا۠ بِمُصۡرِخِكُمۡ وَمَآ أَنتُم بِمُصۡرِخِيَّ إِنِّي كَفَرۡتُ بِمَآ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ إِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ ٢٢\n                                    \n                                    \n                                    يخبر تعالى عما خطب به إبليس [ لعنه الله ] أتباعه ، بعدما قضى الله بين عباده ، فأدخل المؤمنين الجنات ، وأسكن الكافرين الدركات ، فقام فيهم إبليس - لعنه الله - حينئذ خطيبا ليزيدهم حزنا إلى حزنهم وغبنا إلى غبنهم ، وحسرة إلى حسرتهم ، فقال : ( إن الله وعدكم وعد الحق ) أي : على ألسنة رسله ، ووعدكم في اتباعهم النجاة والسلامة ، وكان وعدا حقا ، وخبرا صدقا ، وأما أنا فوعدتكم وأخلفتكم ، كما قال الله تعالى : ( يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا ) [ النساء : 120 ] .\nثم قال : ( وما كان لي عليكم من سلطان ) أي : ما كان لي عليكم فيما دعوتكم إليه من دليل ولا حجة على صدق ما وعدتكم به ، ( إلا أن دعوتكم فاستجبتم لي ) بمجرد ذلك ، هذا وقد أقامت عليكم الرسل الحجج والأدلة الصحيحة على صدق ما جاءوكم به ، فخالفتموهم فصرتم إلى ما أنتم فيه ، ( فلا تلوموني ) اليوم ، ( ولوموا أنفسكم ) فإن الذنب لكم ، لكونكم خالفتم الحجج واتبعتموني بمجرد ما دعوتكم إلى الباطل ، ( ما أنا بمصرخكم ) أي : بنافعكم ومنقذكم ومخلصكم مما أنتم فيه ، ( وما أنتم بمصرخي ) أي : بنافعي بإنقاذي مما أنا فيه من العذاب والنكال ، ( إني كفرت بما أشركتمون من قبل )\nقال قتادة : أي بسبب ما أشركتمون من قبل .\nوقال ابن جرير : يقول : إني جحدت أن أكون شريكا لله ، عز وجل .\nوهذا الذي قاله هو الراجح كما قال تعالى : ( ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين ) [ الأحقاف : 5 ، 6 ] ، وقال : ( كلا سيكفرون بعبادتهم ويكونون عليهم ضدا ) [ مريم : 82 ] .\nوقوله : ( إن الظالمين ) أي : في إعراضهم عن الحق واتباعهم الباطل ) لهم عذاب أليم )\nوالظاهر من سياق الآية : أن هذه الخطبة تكون من إبليس بعد دخولهم النار ، كما قدمنا . ولكن قد ورد في حديث رواه ابن أبي حاتم - وهذا لفظه - وابن جرير من رواية عبد الرحمن بن زياد : حدثني دخين الحجري ، عن عقبة بن عامر ، عن رسول الله صلى الله عليه وسلم أنه قال : \" إذا جمع الله الأولين والآخرين ، فقضى بينهم ، ففرغ من القضاء ، قال المؤمنون : قد قضى بيننا ربنا ، فمن يشفع لنا ؟ فيقولون : انطلقوا بنا إلى آدم - وذكر نوحا ، وإبراهيم ، وموسى ، وعيسى - فيقول عيسى : أدلكم على النبي الأمي . فيأتوني ، فيأذن الله لي أن أقوم إليه فيثور [ من ] مجلسي من أطيب ريح شمها أحد قط ، حتى آتي ربي فيشفعني ، ويجعل لي نورا من شعر رأسي إلى ظفر قدمي ، ثم يقول الكافرون هذا : قد وجد المؤمنون من يشفع لهم ، فمن يشفع لنا ؟ ما هو إلا إبليس هو الذي أضلنا ، فيأتون إبليس فيقولون : قد وجد المؤمنون من يشفع لهم ، فقم أنت فاشفع لنا ، فإنك أنت أضللتنا . فيقوم فيثور من مجلسه من أنتن ريح شمها أحد قط ، ثم يعظم نحيبهم ( وقال الشيطان لما قضي الأمر إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ) .\nوهذا سياق ابن أبي حاتم ، ورواه ابن المبارك عن رشدين بن سعد ، عن عبد الرحمن بن زياد بن أنعم ، عن دخين عن عقبة ، به مرفوعا .\nوقال محمد بن كعب القرظي ، رحمه الله : لما قال أهل النار : ( سواء علينا أجزعنا أم صبرنا ما لنا من محيص ) قال لهم إبليس : ( إن الله وعدكم وعد الحق ) الآية ، فلما سمعوا مقالته مقتوا أنفسهم ، فنودوا : ( لمقت الله أكبر من مقتكم أنفسكم إذ تدعون إلى الإيمان فتكفرون ) [ غافر : 10 ] .\nوقال عامر الشعبي : يقوم خطيبان يوم القيامة على رءوس الناس ، يقول الله لعيسى ابن مريم : ( أأنت قلت للناس اتخذوني وأمي إلهين من دون الله ) إلى قوله : ( قال الله هذا يوم ينفع الصادقين صدقهم ) [ المائدة : 116 ، 119 ] ، قال : ويقوم إبليس - لعنه الله - فيقول : ( وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي ) الآية .\n                                    ",
        "qortoby": "وَقَالَ ٱلشَّيۡطَٰنُ لَمَّا قُضِيَ ٱلۡأَمۡرُ إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ وَوَعَدتُّكُمۡ فَأَخۡلَفۡتُكُمۡۖ وَمَا كَانَ لِيَ عَلَيۡكُم مِّن سُلۡطَٰنٍ إِلَّآ أَن دَعَوۡتُكُمۡ فَٱسۡتَجَبۡتُمۡ لِيۖ فَلَا تَلُومُونِي وَلُومُوٓاْ أَنفُسَكُمۖ مَّآ أَنَا۠ بِمُصۡرِخِكُمۡ وَمَآ أَنتُم بِمُصۡرِخِيَّ إِنِّي كَفَرۡتُ بِمَآ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ إِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ ٢٢\n                                    \n                                    \n                                    وَقَالَ الشَّيْطَانُ لَمَّا قُضِيَ الْأَمْرُ إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُكُمْ فَأَخْلَفْتُكُمْ وَمَا كَانَ لِيَ عَلَيْكُمْ مِنْ سُلْطَانٍ إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ مَا أَنَا بِمُصْرِخِكُمْ وَمَا أَنْتُمْ بِمُصْرِخِيَّ\nقوله تعالى وقال الشيطان لما قضي الأمر قال الحسن : يقف إبليس يوم القيامة خطيبا في جهنم على منبر من نار يسمعه الخلائق جميعا . ومعنى : لما قضي الأمر أي حصل أهل الجنة في الجنة وأهل النار في النار ، على ما يأتي بيانه في \" مريم \" عليها السلام . إن الله وعدكم وعد الحق يعني البعث والجنة والنار وثواب المطيع وعقاب العاصي فصدقكم وعده ، ووعدتكم أن لا بعث ولا جنة ولا نار ولا ثواب ولا عقاب فأخلفتكم . وروى ابن المبارك من حديث عقبة بن عامر عن رسول الله - صلى الله عليه وسلم - في حديث الشفاعة قال : فيقول عيسى أدلكم على النبي الأمي ، فيأتوني فيأذن الله لي أن أقوم فيثور مجلسي من أطيب ريح شمها أحد حتى آتي ربي فيشفعني ويجعل لي نورا من شعر رأسي إلى ظفر قدمي ثم يقول الكافرون قد وجد المؤمنون من يشفع لهم فمن يشفع لنا فيقولون ما هو غير إبليس هو الذي أضلنا ، فيأتونه فيقولون قد وجد المؤمنون من يشفع لهم فاشفع لنا فإنك أضللتنا فيثور مجلسه من أنتن ريح شمها أحد ثم يعظم نحيبهم ويقول عند ذلك : إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم الآية . \" وعد الحق \" هو إضافة الشيء إلى نعته كقولهم : مسجد الجامع ; قال الفراء قال البصريون : وعدكم وعد اليوم الحق أو وعدكم وعد الوعد الحق فصدقكم ; فحذف المصدر لدلالة الحال . وما كان لي عليكم من سلطان أي من حجة وبيان ; أي ما أظهرت لكم حجة على ما وعدتكم وزينته لكم في الدنيا ، إلا أن دعوتكم فاستجبتم لي أي أغويتكم فتابعتموني . وقيل : لم أقهركم على ما دعوتكم إليه . إلا أن دعوتكم هو استثناء منقطع ; أي لكن دعوتكم بالوسواس فاستجبتم لي باختياركم ، فلا تلوموني ولوموا أنفسكم وقيل : وما كان لي عليكم من سلطان أي على قلوبكم وموضع إيمانكم لكن دعوتكم فاستجبتم لي ; وهذا على أنه خطب العاصي المؤمن والكافر الجاحد ; وفيه نظر ; لقوله : لما قضي الأمر فإنه يدل على أنه خطب الكفار دون العاصين الموحدين ; والله أعلم . فلا تلوموني ولوموا أنفسكم إذا جئتموني من غير حجة . ما أنا بمصرخكم أي بمغيثكم . وما أنتم بمصرخي أي بمغيثي . والصارخ والمستصرخ هو الذي يطلب النصرة والمعاونة ، والمصرخ هو المغيث . قال سلامة بن جندل :\nكنا إذا ما أتانا صارخ فزع وكان الصراخ له قرع الظنابيب\nوقال أمية بن أبي الصلت :\nولا تجزعوا إني لكم غير مصرخ وليس لكم عندي غناء ولا نصر\n. يقال : صرخ فلان أي استغاث يصرخ صرخا وصراخا وصرخة . واصطرخ بمعنى صرخ . والتصرخ تكلف الصراخ . والمصرخ المغيث ، والمستصرخ المستغيث ; تقول منه : استصرخني فأصرخته . والصريخ صوت المستصرخ . والصريخ أيضا الصارخ ، وهو المغيث والمستغيث ، وهو من الأضداد ; قاله الجوهري . وقراءة العامة بمصرخي بفتح الياء . وقرأ الأعمش وحمزة بمصرخي بكسر الياء . والأصل فيها بمصرخيين فذهبت النون للإضافة ، وأدغمت ياء الجماعة في ياء الإضافة ، فمن نصب فلأجل التضعيف ، ولأن ياء الإضافة إذا سكن ما قبلها تعين فيها الفتح مثل : هواي وعصاي ، فإن تحرك ما قبلها جاز الفتح والإسكان ، مثل : غلامي وغلامتي ، ومن كسر فلالتقاء الساكنين حركت إلى الكسر ; لأن الياء أخت الكسرة . وقال الفراء : قراءة حمزة وهم منه ، وقل من سلم منهم عن خطأ . وقال الزجاج : هذه قراءة رديئة ولا وجه لها إلا وجه ضعيف . وقال قطرب : هذه لغة بني يربوع يزيدون على ياء الإضافة ياء . القشيري : والذي يغني عن هذا أن ما يثبت بالتواتر عن النبي - صلى الله عليه وسلم - فلا يجوز أن يقال فيه هو خطأ أو قبيح أو رديء ، بل هو في القرآن فصيح ، وفيه ما هو أفصح منه ، فلعل هؤلاء أرادوا أن غير هذا الذي قرأ به حمزة أفصح .\nإني كفرت بما أشركتموني من قبل أي كفرت بإشراككم إياي مع الله تعالى في الطاعة ; ف \" ما \" بمعنى المصدر . وقال ابن جريج : إني كفرت اليوم بما كنتم تدعونه في الدنيا من الشرك بالله تعالى . قتادة : إني عصيت الله . الثوري : كفرت بطاعتكم إياي في الدنيا .\nإن الظالمين لهم عذاب أليم . وفي هذه الآيات رد على القدرية والمعتزلة والإمامية ومن كان على طريقهم ; انظر إلى قول المتبوعين : لو هدانا الله لهديناكم وقول إبليس : إن الله وعدكم وعد الحق كيف اعترفوا بالحق في صفات الله تعالى وهم في دركات النار ; كما قال في موضع آخر : كلما ألقي فيها فوج سألهم خزنتها إلى قول : فاعترفوا بذنبهم واعترافهم في دركات لظى بالحق ليس بنافع ، وإنما ينفع الاعتراف صاحبه في الدنيا ; قال الله - عز وجل - : وآخرون اعترفوا بذنوبهم خلطوا عملا صالحا وآخر سيئا عسى الله أن يتوب عليهم و \" عسى \" من الله واجبة .\n                                    ",
        "saadi": "وَقَالَ ٱلشَّيۡطَٰنُ لَمَّا قُضِيَ ٱلۡأَمۡرُ إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ وَوَعَدتُّكُمۡ فَأَخۡلَفۡتُكُمۡۖ وَمَا كَانَ لِيَ عَلَيۡكُم مِّن سُلۡطَٰنٍ إِلَّآ أَن دَعَوۡتُكُمۡ فَٱسۡتَجَبۡتُمۡ لِيۖ فَلَا تَلُومُونِي وَلُومُوٓاْ أَنفُسَكُمۖ مَّآ أَنَا۠ بِمُصۡرِخِكُمۡ وَمَآ أَنتُم بِمُصۡرِخِيَّ إِنِّي كَفَرۡتُ بِمَآ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ إِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ ٢٢\n                                        \n                                        \n                                        \n                                        أي: { وَقَالَ الشَّيْطَانُ } الذي هو سبب لكل شر يقع ووقع في العالم، مخاطبا لأهل النار ومتبرئا منهم { لَمَّا قُضِيَ الْأَمْرُ } ودخل أهل الجنة الجنة وأهل النار النار. { إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ } على ألسنة رسله فلم تطيعوه، فلو أطعتموه لأدركتم الفوز العظيم، { وَوَعَدْتُكُمْ } الخير { فَأَخْلَفْتُكُمْ } أي: لم يحصل ولن يحصل لكم ما منيتكم به من الأماني الباطلة.\n{ وَمَا كَانَ لِي عَلَيْكُمْ مِنْ سُلْطَانٍ } أي: من حجة على تأييد قولي، { إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي } أي: هذا نهاية ما عندي أني دعوتكم إلى مرادي وزينته لكم، فاستجبتم لي اتباعا لأهوائكم وشهواتكم، فإذا كانت الحال بهذه الصورة { فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ } فأنتم السبب وعليكم المدار في موجب العقاب، { مَا أَنَا بِمُصْرِخِكُمْ } أي: بمغيثكم من الشدة التي أنتم بها { وَمَا أَنْتُمْ بِمُصْرِخِيَّ } كل له قسط من العذاب.\n{ إِنِّي كَفَرْتُ بِمَا أَشْرَكْتُمُونِ مِنْ قَبْلُ } أي: تبرأت من جعلكم لي شريكا مع الله فلست شريكا لله ولا تجب طاعتي، { إِنَّ الظَّالِمِينَ } لأنفسهم بطاعة الشيطان { لَهُمْ عَذَابٌ أَلِيمٌ } خالدين فيه أبدا.\nوهذا من لطف الله بعباده ،أن حذرهم من طاعة الشيطان وأخبر بمداخله التي يدخل منها على الإنسان ومقاصده فيه، وأنه يقصد أن يدخله النيران، وهنا بين لنا أنه إذا دخل النار وحزبه أنه يتبرأ منهم هذه البراءة، ويكفر بشركهم { ولا ينبئك مثل خبير }\nواعلم أن الله ذكر في هذه الآية أنه ليس له سلطان، وقال في آية أخرى { إنما سلطانه على الذين يتولونه والذين هم به مشركون } فالسلطان الذي نفاه عنه هو سلطان الحجة والدليل، فليس له حجة أصلا على ما يدعو إليه، وإنما نهاية ذلك أن يقيم لهم من الشبه والتزيينات ما به يتجرؤون على المعاصي.\nوأما السلطان الذي أثبته فهو التسلط بالإغراء على المعاصي لأوليائه يُؤزّهم إلى المعاصي أزّا، وهم الذين سلطوه على أنفسهم بموالاته والالتحاق بحزبه، ولهذا ليس له سلطان على الذين آمنوا وعلى ربهم يتوكلون.\n                                    "
      },
      "originalText": "وَقَالَ ٱلشَّيۡطَٰنُ لَمَّا قُضِيَ ٱلۡأَمۡرُ إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ وَوَعَدتُّكُمۡ فَأَخۡلَفۡتُكُمۡۖ وَمَا كَانَ لِيَ عَلَيۡكُم مِّن سُلۡطَٰنٍ إِلَّآ أَن دَعَوۡتُكُمۡ فَٱسۡتَجَبۡتُمۡ لِيۖ فَلَا تَلُومُونِي وَلُومُوٓاْ أَنفُسَكُمۖ مَّآ أَنَا۠ بِمُصۡرِخِكُمۡ وَمَآ أَنتُم بِمُصۡرِخِيَّ إِنِّي كَفَرۡتُ بِمَآ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ إِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ ٢٢"
    },
    {
      "number": 1773,
      "text": "وَأُدْخِلَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ ۖ تَحِيَّتُهُمْ فِيهَا سَلَامٌ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 23,
      "juz": 13,
      "manzil": 3,
      "page": 258,
      "ruku": 214,
      "hizbQuarter": 103,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأُدۡخِلَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا بِإِذۡنِ رَبِّهِمۡۖ تَحِيَّتُهُمۡ فِيهَا سَلَٰمٌ ٣٢\n                                    \n                                    \n                                    ثم لما ذكر تعالى مآل الأشقياء وما صاروا إليه من الخزي والنكال . وأن خطيبهم إبليس ، عطف بحال السعداء وأنهم يدخلون يوم القيامة جنات تجري من تحتها الأنهار سارحة فيها حيث ساروا وأين ساروا ) خالدين فيها ) ماكثين أبدا لا يحولون ولا يزولون ، ( بإذن ربهم تحيتهم فيها سلام ) كما قال تعالى : ( حتى إذا جاءوها وفتحت أبوابها وقال لهم خزنتها سلام عليكم ) [ الزمر : 73 ] ، وقال تعالى : ( والملائكة يدخلون عليهم من كل باب سلام عليكم ) [ الرعد : 23 ، 24 ] وقال تعالى : ( ويلقون فيها تحية وسلاما ) [ الفرقان : 75 ] ، وقال : ( دعواهم فيها سبحانك اللهم وتحيتهم فيها سلام وآخر دعواهم أن الحمد لله رب العالمين ) [ يونس : 10 ] .\n                                    ",
        "qortoby": "وَأُدۡخِلَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا بِإِذۡنِ رَبِّهِمۡۖ تَحِيَّتُهُمۡ فِيهَا سَلَٰمٌ ٣٢\n                                    \n                                    \n                                    قوله تعالى : وأدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار خالدين فيها بإذن ربهم تحيتهم فيها سلام\nقوله تعالى : وأدخل الذين آمنوا وعملوا الصالحات جنات أي في جنات لأن دخلت لا يتعدى ; كما لا يتعدى نقيضه وهو خرجت ، ولا يقاس عليه ; قاله المهدوي . ولما أخبر تعالى بحال أهل النار أخبر بحال أهل الجنة أيضا . وقراءة الجماعة أدخل على أنه فعل مبني للمفعول . وقرأ الحسن وأدخل على الاستقبال والاستئناف .\nبإذن ربهم أي بأمره . وقيل : بمشيئته وتيسيره . وقال : \" بإذن ربهم \" ولم يقل : بإذني تعظيما وتفخيما .\nتحيتهم فيها سلام تقدم في يونس والحمد لله .\n                                    ",
        "saadi": "وَأُدۡخِلَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا بِإِذۡنِ رَبِّهِمۡۖ تَحِيَّتُهُمۡ فِيهَا سَلَٰمٌ ٣٢\n                                        \n                                        \n                                        \n                                        ولما ذكر عقاب الظالمين ذكر ثواب الطائعين فقال: { وَأُدْخِلَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ } أي: قاموا بالدين، قولا، وعملا، واعتقادا { جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ } فيها من اللذات والشهوات ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر، { خَالِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ } أي: لا بحولهم وقوتهم بل بحول الله وقوته { تَحِيَّتُهُمْ فِيهَا سَلَامٌ } أي: يحيي بعضهم بعضا بالسلام والتحية والكلام الطيب.\n                                    "
      },
      "originalText": "وَأُدۡخِلَ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا بِإِذۡنِ رَبِّهِمۡۖ تَحِيَّتُهُمۡ فِيهَا سَلَٰمٌ ٣٢"
    },
    {
      "number": 1774,
      "text": "أَلَمْ تَرَ كَيْفَ ضَرَبَ اللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِي السَّمَاءِ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 24,
      "juz": 13,
      "manzil": 3,
      "page": 258,
      "ruku": 214,
      "hizbQuarter": 103,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَرَ كَيۡفَ ضَرَبَ ٱللَّهُ مَثَلٗا كَلِمَةٗ طَيِّبَةٗ كَشَجَرَةٖ طَيِّبَةٍ أَصۡلُهَا ثَابِتٞ وَفَرۡعُهَا فِي ٱلسَّمَآءِ ٤٢\n                                    \n                                    \n                                    قال علي بن أبي طلحة ، عن ابن عباس في قوله : ( مثلا كلمة طيبة ) شهادة أن لا إله إلا الله ، ( كشجرة طيبة ) وهو المؤمن ، ( أصلها ثابت ) يقول : لا إله إلا الله في قلب المؤمن ، ( وفرعها في السماء ) يقول : يرفع بها عمل المؤمن إلى السماء .\nوهكذا قال الضحاك ، وسعيد بن جبير ، وعكرمة وقتادة وغير واحد : إن ذلك عبارة عن المؤمن ، وقوله الطيب ، وعمله الصالح ، وإن المؤمن كالشجرة من النخل ، لا يزال يرفع له عمل صالح في كل حين ووقت ، وصباح ومساء .\nوهكذا رواه السدي ، عن مرة ، عن ابن مسعود قال : هي النخلة .\nوشعبة ، عن معاوية بن قرة ، عن أنس : هي النخلة .\nوحماد بن سلمة ، عن شعيب بن الحبحاب ، عن أنس : أن رسول الله صلى الله عليه وسلم أتى بقناع بسر فقال : \" ومثل كلمة طيبة كشجرة طيبة \" قال : \" هي النخلة \" .\nوروي من هذا الوجه ومن غيره ، عن أنس موقوفا وكذا نص عليه مسروق ، ومجاهد ، وعكرمة ، وسعيد بن جبير ، والضحاك ، وقتادة وغيرهم .\nوقال البخاري : حدثنا عبيد بن إسماعيل ، عن أبي أسامة ، عن عبيد الله ، عن نافع ، عن ابن عمر قال : كنا عند رسول الله صلى الله عليه وسلم فقال : \" أخبروني عن شجرة تشبه - أو : كالرجل - المسلم ، لا يتحات ورقها [ ولا ولا ولا ] تؤتي أكلها كل حين \" . قال ابن عمر : فوقع في نفسي أنها النخلة ، ورأيت أبا بكر وعمر لا يتكلمان ، فكرهت أن أتكلم ، فلما لم يقولوا شيئا ، قال رسول الله صلى الله عليه وسلم : \" هي النخلة \" . فلما قمنا قلت لعمر : يا أبتا ، والله لقد كان وقع في نفسي أنها النخلة . قال : ما منعك أن تكلم ؟ قال : لم أركم تتكلمون ، فكرهت أن أتكلم أو أقول شيئا . قال عمر : لأن تكون قلتها أحب إلي من كذا وكذا .\nوقال أحمد : حدثنا سفيان ، عن ابن أبي نجيح ، عن مجاهد : صحبت ابن عمر إلى المدينة ، فلم أسمعه يحدث عن رسول الله صلى الله عليه وسلم إلا حديثا واحدا - قال : كنا عند رسول الله صلى الله عليه وسلم فأتى بجمار . فقال : \" من الشجر شجرة مثلها مثل الرجل المسلم \" . فأردت أن أقول : هي النخلة ، فنظرت فإذا أنا أصغر القوم ، [ فسكت ] فقال رسول الله صلى الله عليه وسلم : \" هي النخلة \" أخرجاه .\nوقال مالك وعبد العزيز ، عن عبد الله بن دينار ، عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم يوما لأصحابه : \" إن من الشجر شجرة لا يطرح ورقها ، مثل المؤمن \" . قال : فوقع الناس في شجر البوادي ، ووقع في قلبي أنها النخلة [ فاستحييت ، حتى قال رسول الله صلى الله عليه وسلم : \" هي النخلة ] \" أخرجاه أيضا .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا موسى بن إسماعيل ، حدثنا أبان - يعني ابن زيد العطار - حدثنا قتادة : أن رجلا قال : يا رسول الله ، ذهب أهل الدثور بالأجور! فقال : \" أرأيت لو عمد إلى متاع الدنيا ، فركب بعضها على بعض أكان يبلغ السماء ؟ أفلا أخبرك بعمل أصله في الأرض وفرعه في السماء ؟ \" . قال : ما هو يا رسول الله ؟ قال : \" تقول : لا إله إلا الله ، والله أكبر ، وسبحان الله ، والحمد لله \" ، عشر مرات في دبر كل صلاة ، فذاك أصله في الأرض وفرعه في السماء \" .\nوعن ابن عباس ( كشجرة طيبة ) قال : هي شجرة في الجنة .\n                                    ",
        "qortoby": "أَلَمۡ تَرَ كَيۡفَ ضَرَبَ ٱللَّهُ مَثَلٗا كَلِمَةٗ طَيِّبَةٗ كَشَجَرَةٖ طَيِّبَةٍ أَصۡلُهَا ثَابِتٞ وَفَرۡعُهَا فِي ٱلسَّمَآءِ ٤٢\n                                    \n                                    \n                                    قوله تعالى : ألم تر كيف ضرب الله مثلا كلمة طيبة كشجرة طيبة أصلها ثابت وفرعها في السماء\nفيه مسألتان : الأولى : قوله تعالى : ألم تر كيف ضرب الله مثلا لما ذكر تعالى مثل أعمال الكفار وأنها كرماد اشتدت به الريح في يوم عاصف ، ذكر مثل أقوال المؤمنين وغيرها ، ثم فسر ذلك المثل فقال : \" كلمة طيبة \" الثمر ، فحذف لدلالة الكلام عليه . قال ابن عباس : الكلمة الطيبة لا إله إلا الله ، والشجرة الطيبة المؤمن . وقال مجاهد وابن جريج : الكلمة الطيبة الإيمان . عطية العوفي والربيع بن أنس : هي المؤمن نفسه . وقال مجاهد أيضا وعكرمة : الشجرة النخلة ; فيجوز أن يكون المعنى : أصل الكلمة في قلب المؤمن - وهو الإيمان - شبهه بالنخلة في المنبت ، وشبه ارتفاع عمله في السماء بارتفاع فروع النخلة ، وثواب الله له بالثمر . وروي من حديث أنس عن النبي - صلى الله عليه وسلم - أنه قال : إن مثل الإيمان كمثل شجرة ثابتة ، الإيمان عروقها والصلاة أصلها والزكاة فروعها والصيام أغصانها والتأذي في الله نباتها وحسن الخلق ورقها والكف عن محارم الله ثمرتها . ويجوز أن يكون المعنى : أصل النخلة ثابت في الأرض ; أي عروقها تشرب من الأرض وتسقيها السماء من فوقها ، فهي زاكية نامية . وخرج الترمذي من حديث أنس بن مالك قال : أتي رسول الله - صلى الله عليه وسلم - بقناع فيه رطب ، فقال : مثلا كلمة طيبة كشجرة طيبة أصلها ثابت وفرعها في السماء تؤتي أكلها كل حين بإذن ربها - قال - هي النخلة ، ومثل كلمة خبيثة كشجرة خبيثة اجتثت من فوق الأرض ما لها من قرار - قال - هي الحنظل . وروي عن أنس قوله وقال : وهو أصح . وخرج الدارقطني عن ابن عمر قال : ( قرأ رسول الله - صلى الله عليه وسلم - ضرب الله مثلا كلمة طيبة كشجرة طيبة أصلها ثابت فقال رسول الله - صلى الله عليه وسلم - : أتدرون ما هي فوقع في نفسي أنها النخلة . قال السهيلي ولا يصح فيها ما روي عن علي بن أبي طالب أنها جوزة الهند ; لما صح عن النبي - صلى الله عليه وسلم - في حديث ابن عمر إن من الشجرة شجرة لا يسقط ورقها وهي مثل المؤمن خبروني ما هي - ثم قال - هي النخلة خرجه مالك في \" الموطأ \" من رواية ابن القاسم وغيره إلا يحيى فإنه أسقطه من روايته . وخرجه أهل الصحيح وزاد فيه الحارث بن أسامة زيادة تساوي رحلة ، عن النبي - صلى الله عليه وسلم - قال : وهي النخلة لا تسقط لها أنملة وكذلك المؤمن لا تسقط له دعوة . فبين معنى الحديث والمماثلة\nوذكر الغزنوي عنه - عليه السلام - : مثل المؤمن كالنخلة إن صاحبته نفعك وإن جالسته نفعك وإن شاورته نفعك كالنخلة كل شيء منها ينتفع به . وقال : كلوا من عمتكم يعني النخلة خلقت من فضلة طينة آدم - عليه السلام - وكذلك أنها برأسها تبقى ، وبقلبها تحيا ، وثمرها بامتزاج الذكر والأنثى . وقد قيل : إنها لما كانت أشبه الأشجار بالإنسان شبهت به ; وذلك أن كل شجرة إذا قطع رأسها تشعبت الغصون من جوانبها ، والنخلة إذا قطع رأسها يبست وذهبت أصلا ; ولأنها تشبه الإنسان وسائر الحيوان في الالتقاح لأنها لا تحمل حتى تلقح قال النبي - صلى الله عليه وسلم - : \" خير المال سكة مأبورة ومهرة مأمورة ) . والإبار اللقاح وسيأتي في سورة \" الحجر \" بيانه . ولأنها من فضلة طينة آدم . ويقال : إن الله - عز وجل - لما صور آدم من الطين فضلت قطعة طين فصورها بيده وغرسها في جنة عدن . قال النبي - صلى الله عليه وسلم - : أكرموا عمتكم قالوا : ومن عمتنا يا رسول الله ؟ قال : النخلة .\n                                    ",
        "saadi": "أَلَمۡ تَرَ كَيۡفَ ضَرَبَ ٱللَّهُ مَثَلٗا كَلِمَةٗ طَيِّبَةٗ كَشَجَرَةٖ طَيِّبَةٍ أَصۡلُهَا ثَابِتٞ وَفَرۡعُهَا فِي ٱلسَّمَآءِ ٤٢\n                                        \n                                        \n                                        \n                                        يقول تعالى: { أَلَمْ تَرَ كَيْفَ ضَرَبَ اللَّهُ مَثَلًا كَلِمَةً طَيِّبَة } \" وهي شهادة أن لا إله إلا الله، وفروعها { كَشَجَرَةٍ طَيِّبَةٍ } وهي النخلة { أَصْلُهَا ثَابِتٌ } في الأرض { وَفَرْعُهَا } منتشر { فِي السَّمَاءِ }\n                                    "
      },
      "originalText": "أَلَمۡ تَرَ كَيۡفَ ضَرَبَ ٱللَّهُ مَثَلٗا كَلِمَةٗ طَيِّبَةٗ كَشَجَرَةٖ طَيِّبَةٍ أَصۡلُهَا ثَابِتٞ وَفَرۡعُهَا فِي ٱلسَّمَآءِ ٤٢"
    }
  ]
}