{
  "number": 26,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 177,
      "text": "وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا مَا أَنْزَلَ اللَّهُ قَالُوا بَلْ نَتَّبِعُ مَا أَلْفَيْنَا عَلَيْهِ آبَاءَنَا ۗ أَوَلَوْ كَانَ آبَاؤُهُمْ لَا يَعْقِلُونَ شَيْئًا وَلَا يَهْتَدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 170,
      "juz": 2,
      "manzil": 1,
      "page": 26,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُواْ مَآ أَنزَلَ ٱللَّهُ قَالُواْ بَلۡ نَتَّبِعُ مَآ أَلۡفَيۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ءَابَآؤُهُمۡ لَا يَعۡقِلُونَ شَيۡ‍ٔٗا وَلَا يَهۡتَدُونَ ٠٧١\n                                    \n                                    يقول تعالى : ( وإذا قيل ) لهؤلاء الكفرة من المشركين : ( اتبعوا ما أنزل الله ) على رسوله ، واتركوا ما أنتم فيه من الضلال والجهل ، قالوا في جواب ذلك : ( بل نتبع ما ألفينا ) أي : وجدنا ( عليه آباءنا ) أي : من عبادة الأصنام والأنداد . قال الله تعالى منكرا عليهم : ( أولو كان آباؤهم ) أي : الذين يقتدون بهم ويقتفون أثرهم ( لا يعقلون شيئا ولا يهتدون ) أي : ليس لهم فهم ولا هداية ! ! .\nوروى ابن إسحاق عن محمد بن أبي محمد ، عن عكرمة أو سعيد بن جبير ، عن ابن عباس : أنها نزلت في طائفة من اليهود ، دعاهم رسول الله صلى الله عليه وسلم إلى الإسلام ، فقالوا : بل نتبع ما ألفينا عليه آباءنا . فأنزل الله هذه الآية .\n                                    ",
        "qortoby": "وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُواْ مَآ أَنزَلَ ٱللَّهُ قَالُواْ بَلۡ نَتَّبِعُ مَآ أَلۡفَيۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ءَابَآؤُهُمۡ لَا يَعۡقِلُونَ شَيۡ‍ٔٗا وَلَا يَهۡتَدُونَ ٠٧١\n                                    \n                                    \n                                    قوله تعالى : وإذا قيل لهم اتبعوا ما أنزل الله قالوا بل نتبع ما ألفينا عليه آباءنا أولو كان آباؤهم لا يعقلون شيئا ولا يهتدون\nفيه سبع مسائل : الأولى : قوله تعالى : وإذا قيل لهم يعني كفار العرب . ابن عباس : نزلت في اليهود . الطبري : الضمير في لهم عائد على الناس من قوله تعالى : يا أيها الناس كلوا . وقيل : هو عائد على من في قوله تعالى : ومن الناس من يتخذ من دون الله الآية .\nقوله تعالى : اتبعوا ما أنزل الله أي بالقبول والعمل . قالوا بل نتبع ما ألفينا عليه آباءنا ألفينا : وجدنا . وقال الشاعر :\nفألفيته غير مستعتب ولا ذاكر الله إلا قليلا\nالثانية : قوله تعالى : أولو كان آباؤهم الألف للاستفهام ، وفتحت الواو لأنها واو عطف ، عطفت جملة كلام على جملة ; لأن غاية الفساد في الالتزام أن يقولوا : نتبع آباءنا ولو كانوا لا يعقلون ، فقرروا على التزامهم هذا ، إذ هي حال آبائهم .\nمسألة : قال علماؤنا : وقوة ألفاظ هذه الآية تعطي إبطال التقليد ، ونظيرها : وإذا قيل لهم تعالوا إلى ما أنزل الله وإلى الرسول قالوا حسبنا ما وجدنا عليه آباءنا الآية . وهذه الآية والتي قبلها مرتبطة بما قبلهما ، وذلك أن الله سبحانه أخبر عن جهالة العرب فيما تحكمت فيه بآرائها السفيهة في البحيرة والسائبة والوصيلة ، فاحتجوا بأنه أمر وجدوا عليه آباءهم فاتبعوهم في ذلك ، وتركوا ما أنزل الله على رسوله وأمر به في دينه ، فالضمير في لهم عائد عليهم في الآيتين جميعا .\nالثالثة : تعلق قوم بهذه الآية في ذم التقليد لذم الله تعالى الكفار باتباعهم لآبائهم في الباطل ، واقتدائهم بهم في الكفر والمعصية . وهذا في الباطل صحيح ، أما التقليد في الحق فأصل من أصول الدين ، وعصمة من عصم المسلمين يلجأ إليها الجاهل المقصر عن درك النظر .\nواختلف العلماء في جوازه في مسائل الأصول على ما يأتي ، وأما جوازه في مسائل الفروع فصحيح .\nالرابعة : التقليد عند العلماء حقيقته قبول قول بلا حجة ، وعلى هذا فمن قبل قول النبي صلى الله عليه وسلم من غير نظر في معجزته يكون مقلدا ، وأما من نظر فيها فلا يكون مقلدا . وقيل : هو اعتقاد صحة فتيا من لا يعلم صحة قوله . وهو في اللغة مأخوذ من قلادة البعير ، فإن العرب تقول : قلدت البعير إذا جعلت في عنقه حبلا يقاد به ، فكأن المقلد يجعل أمره كله لمن يقوده حيث شاء ، وكذلك قال شاعرهم :\nوقلدوا أمركم لله دركم ثبت الجنان بأمر الحرب مضطلعا\nالخامسة : التقليد ليس طريقا للعلم ولا موصلا له ، لا في الأصول ولا في الفروع ، وهو قول جمهور العقلاء والعلماء ، خلافا لما يحكى عن جهال الحشوية والثعلبية من أنه طريق إلى معرفة الحق ، وأن ذلك هو الواجب ، وأن النظر والبحث حرام ، والاحتجاج عليهم في كتب الأصول .\nالسادسة : فرض العامي الذي لا يشتغل باستنباط الأحكام من أصولها لعدم أهليته فيما لا يعلمه من أمر دينه ويحتاج إليه أن يقصد أعلم من في زمانه وبلده فيسأله عن نازلته فيمتثل فيها فتواه ، لقوله تعالى : فاسألوا أهل الذكر إن كنتم لا تعلمون ، وعليه الاجتهاد في أعلم أهل وقته بالبحث عنه ، حتى يقع عليه الاتفاق من الأكثر من الناس . وعلى العالم أيضا فرض أن يقلد عالما مثله في نازلة خفي عليه فيها وجه الدليل والنظر ، وأراد أن يجدد الفكر فيها والنظر حتى يقف على المطلوب ، فضاق الوقت عن ذلك ، وخاف على العبادة أن تفوت ، أو على الحكم أن يذهب ، سواء كان ذلك المجتهد الآخر صحابيا أو غيره ، وإليه ذهب القاضي أبو بكر وجماعة من المحققين .\nالسابعة : قال ابن عطية : أجمعت الأمة على إبطال التقليد في العقائد . وذكر فيه غيره خلافا كالقاضي أبي بكر بن العربي وأبي عمر وعثمان بن عيسى بن درباس الشافعي . قال ابن درباس في كتاب \" الانتصار \" له : وقال بعض الناس يجوز التقليد في أمر التوحيد ، وهو خطأ لقوله تعالى : إنا وجدنا آباءنا على أمة . فذمهم بتقليدهم آباءهم وتركهم اتباع الرسل ، كصنيع أهل الأهواء في تقليدهم كبراءهم وتركهم اتباع محمد صلى الله عليه وسلم في دينه ، ولأنه فرض على كل مكلف تعلم أمر التوحيد والقطع به ، وذلك لا يحصل إلا من جهة الكتاب والسنة ، كما بيناه في آية التوحيد ، والله يهدي من يريد .\nقال ابن درباس : وقد أكثر أهل الزيغ القول على من تمسك بالكتاب والسنة أنهم مقلدون . وهذا خطأ منهم ، بل هو بهم أليق وبمذاهبهم أخلق ، إذ قبلوا قول ساداتهم وكبرائهم فيما خالفوا فيه كتاب الله وسنة رسوله وإجماع الصحابة رضي الله عنهم ، فكانوا داخلين فيمن ذمهم الله بقوله : ربنا إنا أطعنا سادتنا وكبراءنا إلى قوله : كبيرا وقوله : إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون . ثم قال لنبيه : قال أولو جئتكم بأهدى مما وجدتم عليه آباءكم قالوا إنا بما أرسلتم به كافرون ثم قال لنبيه عليه السلام ( فانتقمنا منهم ) الآية . فبين تعالى أن الهدى فيما جاءت به رسله عليهم السلام . وليس قول أهل الأثر في عقائدهم : إنا وجدنا أئمتنا وآباءنا والناس على الأخذ بالكتاب والسنة وإجماع السلف الصالح من الأمة ، من قولهم : إنا وجدنا آباءنا وأطعنا سادتنا وكبراءنا بسبيل ; لأن هؤلاء نسبوا ذلك إلى التنزيل وإلى متابعة الرسول ، وأولئك نسبوا إفكهم إلى أهل الأباطيل ، فازدادوا بذلك في التضليل ، ألا ترى أن الله سبحانه أثنى على يوسف عليه السلام في القرآن حيث قال : إني تركت ملة قوم لا يؤمنون بالله وهم بالآخرة هم كافرون واتبعت ملة آبائي إبراهيم وإسحاق ويعقوب ما كان لنا أن نشرك بالله من شيء ذلك من فضل الله علينا وعلى الناس . فلما كان آباؤه عليه وعليهم السلام أنبياء متبعين للوحي وهو الدين الخالص الذي ارتضاه الله ، كان اتباعه آباءه من صفات المدح . ولم يجئ فيما جاءوا به ذكر الأعراض وتعلقها بالجواهر وانقلابها فيها ، فدل على أن لا هدى فيها ولا رشد في واضعيها .\nقال ابن الحصار : وإنما ظهر التلفظ بها في زمن المأمون بعد المائتين لما ترجمت كتب الأوائل وظهر فيها اختلافهم في قدم العالم وحدوثه ، واختلافهم في الجوهر وثبوته ، والعرض وماهيته ، فسارع المبتدعون ومن في قلبه زيغ إلى حفظ تلك الاصطلاحات ، وقصدوا بها الإغراب على أهل السنة ، وإدخال الشبه على الضعفاء من أهل الملة . فلم يزل الأمر كذلك إلى أن ظهرت البدعة ، وصارت للمبتدعة شيعة ، والتبس الأمر على السلطان ، حتى قال الأمير بخلق القرآن ، وجبر الناس عليه ، وضرب أحمد بن حنبل على ذلك .\nفانتدب رجال من أهل السنة كالشيخ أبي الحسن الأشعري وعبد الله بن كلاب وابن مجاهد والمحاسبي وأضرابهم ، فخاضوا مع المبتدعة في اصطلاحاتهم ، ثم قاتلوهم وقتلوهم بسلاحهم وكان من درج من المسلمين من هذه الأمة متمسكين بالكتاب والسنة ، معرضين عن شبه الملحدين ، لم ينظروا في الجوهر والعرض ، على ذلك كان السلف .\nقلت : ومن نظر الآن في اصطلاح المتكلمين حتى يناضل بذلك عن الدين فمنزلته قريبة من النبيين . فأما من يهجن من غلاة المتكلمين طريق من أخذ بالأثر من المؤمنين ، ويحض على درس كتب الكلام ، وأنه لا يعرف الحق إلا من جهتها بتلك الاصطلاحات فصاروا مذمومين لنقضهم طريق المتقدمين من الأئمة الماضين ، والله أعلم . وأما المخاصمة والجدال بالدليل والبرهان فذلك بين في القرآن ، وسيأتي بيانه إن شاء الله تعالى .\n                                    ",
        "saadi": "وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُواْ مَآ أَنزَلَ ٱللَّهُ قَالُواْ بَلۡ نَتَّبِعُ مَآ أَلۡفَيۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ءَابَآؤُهُمۡ لَا يَعۡقِلُونَ شَيۡ‍ٔٗا وَلَا يَهۡتَدُونَ ٠٧١\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى عن حال المشركين إذا أمروا باتباع ما أنزل الله على رسوله - مما تقدم وصفه - رغبوا عن ذلك وقالوا: { بَلْ نَتَّبِعُ مَا أَلْفَيْنَا عَلَيْهِ آبَاءَنَا } فاكتفوا بتقليد الآباء, وزهدوا في الإيمان بالأنبياء، ومع هذا فآباؤهم أجهل الناس, وأشدهم ضلالا وهذه شبهة لرد الحق واهية، فهذا دليل على إعراضهم عن الحق, ورغبتهم عنه, وعدم إنصافهم، فلو هدوا لرشدهم, وحسن قصدهم, لكان الحق هو القصد، ومن جعل الحق قصده, ووازن بينه وبين غيره, تبين له الحق قطعا, واتبعه إن كان منصفا.\n                                    "
      },
      "originalText": "وَإِذَا قِيلَ لَهُمُ ٱتَّبِعُواْ مَآ أَنزَلَ ٱللَّهُ قَالُواْ بَلۡ نَتَّبِعُ مَآ أَلۡفَيۡنَا عَلَيۡهِ ءَابَآءَنَآۚ أَوَلَوۡ كَانَ ءَابَآؤُهُمۡ لَا يَعۡقِلُونَ شَيۡ‍ٔٗا وَلَا يَهۡتَدُونَ ٠٧١"
    },
    {
      "number": 178,
      "text": "وَمَثَلُ الَّذِينَ كَفَرُوا كَمَثَلِ الَّذِي يَنْعِقُ بِمَا لَا يَسْمَعُ إِلَّا دُعَاءً وَنِدَاءً ۚ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 171,
      "juz": 2,
      "manzil": 1,
      "page": 26,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَثَلُ ٱلَّذِينَ كَفَرُواْ كَمَثَلِ ٱلَّذِي يَنۡعِقُ بِمَا لَا يَسۡمَعُ إِلَّا دُعَآءٗ وَنِدَآءٗۚ صُمُّۢ بُكۡمٌ عُمۡيٞ فَهُمۡ لَا يَعۡقِلُونَ ١٧١\n                                    \n                                    \n                                    ثم ضرب لهم تعالى مثلا كما قال تعالى : ( للذين لا يؤمنون بالآخرة مثل السوء ) [ النحل : 60 ] فقال : ( ومثل الذين كفروا ) أي : فيما هم فيه من الغي والضلال والجهل كالدواب السارحة التي لا تفقه ما يقال لها ، بل إذا نعق بها راعيها ، أي : دعاها إلى ما يرشدها ، لا تفقه ما يقول ولا تفهمه ، بل إنما تسمع صوته فقط .\nهكذا روي عن ابن عباس ، وأبي العالية ، ومجاهد ، وعكرمة ، وعطاء ، والحسن ، وقتادة ، وعطاء الخراساني والربيع بن أنس ، نحو هذا .\nوقيل : إنما هذا مثل ضرب لهم في دعائهم الأصنام التي لا تسمع ولا تبصر ولا تعقل شيئا ، اختاره ابن جرير ، والأول أولى ; لأن الأصنام لا تسمع شيئا ولا تعقله ولا تبصره ، ولا بطش لها ولا حياة فيها . وقوله : ( صم بكم عمي ) أي : صم عن سماع الحق ، بكم لا يتفوهون به ، عمي عن رؤية طريقه ومسلكه ( فهم لا يعقلون ) أي : لا يعقلون شيئا ولا يفهمونه ، كما قال تعالى : ( والذين كذبوا بآياتنا صم وبكم في الظلمات من يشأ الله يضلله ومن يشأ يجعله على صراط مستقيم ) [ الأنعام : 39 ] .\n                                    ",
        "qortoby": "وَمَثَلُ ٱلَّذِينَ كَفَرُواْ كَمَثَلِ ٱلَّذِي يَنۡعِقُ بِمَا لَا يَسۡمَعُ إِلَّا دُعَآءٗ وَنِدَآءٗۚ صُمُّۢ بُكۡمٌ عُمۡيٞ فَهُمۡ لَا يَعۡقِلُونَ ١٧١\n                                    \n                                    \n                                    قوله تعالى : ومثل الذين كفروا كمثل الذي ينعق بما لا يسمع إلا دعاء ونداء صم بكم عمي فهم لا يعقلون\nشبه تعالى واعظ الكفار وداعيهم وهو محمد صلى الله عليه وسلم بالراعي الذي ينعق بالغنم والإبل فلا تسمع إلا دعاءه ونداءه ، ولا تفهم ما يقول ، هكذا فسره ابن عباس ومجاهد وعكرمة والسدي والزجاج والفراء وسيبويه ، وهذه نهاية الإيجاز . قال سيبويه : لم يشبهوا بالناعق إنما شبهوا بالمنعوق به . والمعنى : ومثلك يا محمد ومثل الذين كفروا كمثل الناعق والمنعوق به من البهائم التي لا تفهم ، فحذف لدلالة المعنى . وقال ابن زيد : المعنى مثل الذين كفروا في دعائهم الآلهة الجماد كمثل الصائح في جوف الليل فيجيبه الصدى ، فهو يصيح بما لا يسمع ، ويجيبه ما لا حقيقة فيه ولا منتفع . وقال قطرب : المعنى مثل الذين كفروا في دعائهم ما لا يفهم ، يعني الأصنام ، كمثل الراعي إذا نعق بغنمه وهو لا يدري أين هي . قال الطبري : المراد مثل الكافرين في دعائهم آلهتهم كمثل الذي ينعق بشيء بعيد فهو لا يسمع من أجل البعد ، فليس للناعق من ذلك إلا النداء الذي يتعبه وينصبه . ففي هذه التأويلات الثلاثة يشبه الكفار بالناعق الصائح ، والأصنام بالمنعوق به . والنعيق : زجر الغنم والصياح بها ، يقال : نعق الراعي بغنمه ينعق نعيقا ونعاقا ونعقانا ، أي صاح بها وزجرها . قال الأخطل :\nانعق بضأنك يا جرير فإنما منتك نفسك في الخلاء ضلالا\nقال القتبي : لم يكن جرير راعي ضأن ، وإنما أراد أن بني كليب يعيرون برعي الضأن ، وجرير منهم ، فهو في جهلهم . والعرب تضرب المثل براعي الغنم في الجهل ويقولون : \" أجهل من راعي ضأن \" . قال القتبي : ومن ذهب إلى هذا في معنى الآية كان مذهبا ، غير أنه لم يذهب إليه أحد من العلماء فيما نعلم .\nوالنداء للبعيد ، والدعاء للقريب ، ولذلك قيل للأذان بالصلاة نداء لأنه للأباعد . وقد تضم النون في النداء والأصل الكسر . ثم شبه تعالى الكافرين بأنهم صم بكم عمي . وقد تقدم في أول السورة .\n                                    ",
        "saadi": "وَمَثَلُ ٱلَّذِينَ كَفَرُواْ كَمَثَلِ ٱلَّذِي يَنۡعِقُ بِمَا لَا يَسۡمَعُ إِلَّا دُعَآءٗ وَنِدَآءٗۚ صُمُّۢ بُكۡمٌ عُمۡيٞ فَهُمۡ لَا يَعۡقِلُونَ ١٧١\n                                        \n                                        \n                                        \n                                        ثم قال [تعالى]: { وَمَثَلُ الَّذِينَ كَفَرُوا كَمَثَلِ الَّذِي يَنْعِقُ بِمَا لَا يَسْمَعُ إِلَّا دُعَاءً وَنِدَاءً صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ } لما بين تعالى عدم انقيادهم لما جاءت به الرسل, وردهم لذلك بالتقليد, علم من ذلك أنهم غير قابلين للحق, ولا مستجيبين له, بل كان معلوما لكل أحد أنهم لن يزولوا عن عنادهم، أخبر تعالى, أن مثلهم عند دعاء الداعي لهم إلى الإيمان كمثل البهائم التي ينعق لها راعيها, وليس لها علم بما يقول راعيها ومناديها، فهم يسمعون مجرد الصوت, الذي تقوم به عليهم الحجة, ولكنهم لا يفقهونه فقها ينفعهم, فلهذا كانوا صما, لا يسمعون الحق سماع فهم وقبول, عميا, لا ينظرون نظر اعتبار, بكما, فلا ينطقون بما فيه خير لهم. والسبب الموجب لذلك كله, أنه ليس لهم عقل صحيح, بل هم أسفه السفهاء, وأجهل الجهلاء. فهل يستريب العاقل, أن من دعي إلى الرشاد, وذيد عن الفساد, ونهي عن اقتحام العذاب, وأمر بما فيه صلاحه وفلاحه, وفوزه, ونعيمه فعصى الناصح, وتولى عن أمر ربه, واقتحم النار على بصيرة, واتبع الباطل, ونبذ الحق - أن هذا ليس له مسكة من عقل, وأنه لو اتصف بالمكر والخديعة والدهاء, فإنه من أسفه السفهاء.\n                                    "
      },
      "originalText": "وَمَثَلُ ٱلَّذِينَ كَفَرُواْ كَمَثَلِ ٱلَّذِي يَنۡعِقُ بِمَا لَا يَسۡمَعُ إِلَّا دُعَآءٗ وَنِدَآءٗۚ صُمُّۢ بُكۡمٌ عُمۡيٞ فَهُمۡ لَا يَعۡقِلُونَ ١٧١"
    },
    {
      "number": 179,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 172,
      "juz": 2,
      "manzil": 1,
      "page": 26,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡ وَٱشۡكُرُواْ لِلَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٢٧١\n                                    \n                                    \n                                    يقول تعالى آمرا عباده المؤمنين بالأكل من طيبات ما رزقهم تعالى ، وأن يشكروه على ذلك ، إن كانوا عبيده ، والأكل من الحلال سبب لتقبل الدعاء والعبادة ، كما أن الأكل من الحرام يمنع قبول الدعاء والعبادة ، كما جاء في الحديث الذي رواه الإمام أحمد :\nحدثنا أبو النضر ، حدثنا الفضيل بن مرزوق ، عن عدي بن ثابت ، عن أبي حازم ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" أيها الناس ، إن الله طيب لا يقبل إلا طيبا ، وإن الله أمر المؤمنين بما أمر به المرسلين ، فقال : ( يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم ) [ المؤمنون : 51 ] وقال : ( يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم ) ثم ذكر الرجل يطيل السفر أشعث أغبر ، يمد يديه إلى السماء : يا رب ، يا رب ، ومطعمه حرام ، ومشربه حرام ، وملبسه حرام ، وغذي بالحرام ، فأنى يستجاب لذلك \" .\nورواه مسلم في صحيحه ، والترمذي من حديث [ فضيل ] بن مرزوق .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡ وَٱشۡكُرُواْ لِلَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٢٧١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم واشكروا لله إن كنتم إياه تعبدون\nهذا تأكيد للأمر الأول ، وخص المؤمنين هنا بالذكر تفضيلا . والمراد بالأكل الانتفاع من جميع الوجوه . وقيل : هو الأكل المعتاد . وفي صحيح مسلم عن أبي هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم : أيها الناس إن الله تعالى طيب لا يقبل إلا طيبا وإن الله أمر المؤمنين بما أمر به المرسلين فقال يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم وقال : يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء يا رب يا رب ومطعمه حرام ومشربه حرام وملبسه حرام وغذي بالحرام فأنى يستجاب لذلك . واشكروا لله إن كنتم إياه تقدم معنى الشكر فلا معنى للإعادة .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡ وَٱشۡكُرُواْ لِلَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٢٧١\n                                        \n                                        \n                                        \n                                        هذا أمر للمؤمنين خاصة, بعد الأمر العام, وذلك أنهم هم المنتفعون على الحقيقة بالأوامر والنواهي, بسبب إيمانهم, فأمرهم بأكل الطيبات من الرزق, والشكر لله على إنعامه, باستعمالها بطاعته, والتقوي بها على ما يوصل إليه، فأمرهم بما أمر به المرسلين في قوله { يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا } فالشكر في هذه الآية, هو العمل الصالح، وهنا لم يقل \" حلالا \" لأن المؤمن أباح الله له الطيبات من الرزق خالصة من التبعة، ولأن إيمانه يحجزه عن تناول ما ليس له. وقوله { إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ } أي: فاشكروه، فدل على أن من لم يشكر الله, لم يعبده وحده, كما أن من شكره, فقد عبده, وأتى بما أمر به، ويدل أيضا على أن أكل الطيب, سبب للعمل الصالح وقبوله، والأمر بالشكر, عقيب النعم؛ لأن الشكر يحفظ النعم الموجودة, ويجلب النعم المفقودة كما أن الكفر, ينفر النعم المفقودة ويزيل النعم الموجودة.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡ وَٱشۡكُرُواْ لِلَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٢٧١"
    },
    {
      "number": 180,
      "text": "إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيرِ وَمَا أُهِلَّ بِهِ لِغَيْرِ اللَّهِ ۖ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلَا عَادٍ فَلَا إِثْمَ عَلَيْهِ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 173,
      "juz": 2,
      "manzil": 1,
      "page": 26,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ بِهِۦ لِغَيۡرِ ٱللَّهِۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَلَآ إِثۡمَ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٣٧١\n                                    \n                                    \n                                    ولما امتن تعالى عليهم برزقه ، وأرشدهم إلى الأكل من طيبه ، ذكر أنه لم يحرم عليهم من ذلك إلا الميتة ، وهي التي تموت حتف أنفها من غير تذكية ، وسواء كانت منخنقة أو موقوذة أو متردية أو نطيحة أو قد عدا عليها السبع .\nوقد خصص الجمهور من ذلك ميتة البحر لقوله تعالى : ( أحل لكم صيد البحر وطعامه متاعا لكم وللسيارة ) [ المائدة : 96 ] على ما سيأتي ، وحديث العنبر في الصحيح ، وفي المسند والموطأ والسنن قوله ، عليه السلام ، في البحر : \" هو الطهور ماؤه الحل ميتته \" وروى الشافعي وأحمد وابن ماجه والدارقطني من حديث ابن عمر مرفوعا : \" أحل لنا ميتتان ودمان : السمك والجراد ، والكبد والطحال \" وسيأتي تقرير ذلك في سورة المائدة .\nولبن الميتة وبيضها المتصل بها نجس عند الشافعي وغيره ; لأنه جزء منها . وقال مالك في رواية : هو طاهر إلا أنه ينجس بالمجاورة ، وكذلك أنفحة الميتة فيها الخلاف والمشهور عندهم أنها نجسة ، وقد أوردوا على أنفسهم أكل الصحابة من جبن المجوس ، فقال القرطبي في تفسيره هاهنا : يخالط اللبن منها يسير ، ويعفى عن قليل النجاسة إذا خالط الكثير من المائع . وقد روى ابن ماجه من حديث سيف بن هارون ، عن سليمان التيمي ، عن أبي عثمان النهدي ، عن سلمان سئل رسول الله صلى الله عليه وسلم عن السمن والجبن والفراء ، فقال : \" الحلال ما أحل الله في كتابه ، والحرام ما حرم الله في كتابه ، وما سكت عنه فهو مما عفا عنه \" .\nوكذلك حرم عليهم لحم الخنزير ، سواء ذكي أو مات حتف أنفه ، ويدخل شحمه في حكم لحمه إما تغليبا أو أن اللحم يشمل ذلك ، أو بطريق القياس على رأي . و [ كذلك ] حرم عليهم ما أهل به لغير الله ، وهو ما ذبح على غير اسمه تعالى من الأنصاب والأنداد والأزلام ، ونحو ذلك مما كانت الجاهلية ينحرون له . [ وذكر القرطبي عن ابن عطية أنه نقل عن الحسن البصري : أنه سئل عن امرأة عملت عرسا للعبها فنحرت فيه جزورا فقال : لا تؤكل لأنها ذبحت لصنم ; وأورد القرطبي عن عائشة أنها سئلت عما يذبحه العجم في أعيادهم فيهدون منه للمسلمين ، فقالت : ما ذبح لذلك اليوم فلا تأكلوه ، وكلوا من أشجارهم ] . ثم أباح تعالى تناول ذلك عند الضرورة والاحتياج إليها ، عند فقد غيرها من الأطعمة ، فقال : ( فمن اضطر غير باغ ولا عاد ) أي : في غير بغي ولا عدوان ، وهو مجاوزة الحد ( فلا إثم عليه ) أي : في أكل ذلك ) إن الله غفور رحيم )\nوقال مجاهد : فمن اضطر غير باغ ولا عاد ، قاطعا للسبيل ، أو مفارقا للأئمة ، أو خارجا في معصية الله ، فله الرخصة ، ومن خرج باغيا أو عاديا أو في معصية الله فلا رخصة له ، وإن اضطر إليه ، وكذا روي عن سعيد بن جبير .\nوقال سعيد في رواية عنه ومقاتل بن حيان : غير باغ : يعني غير مستحله . وقال السدي : غير باغ يبتغي فيه شهوته ، وقال عطاء الخراساني في قوله : ( غير باغ ) [ قال ] لا يشوي من الميتة ليشتهيه ولا يطبخه ، ولا يأكل إلا العلقة ، ويحمل معه ما يبلغه الحلال ، فإذا بلغه ألقاه [ وهو قوله : ( ولا عاد ) يقول : لا يعدو به الحلال ] .\nوعن ابن عباس : لا يشبع منها . وفسره السدي بالعدوان . وعن ابن عباس ( غير باغ ولا عاد ) قال : ( غير باغ ) في الميتة ( ولا عاد ) في أكله . وقال قتادة : فمن اضطر غير باغ ولا عاد في أكله : أن يتعدى حلالا إلى حرام ، وهو يجد عنه مندوحة .\nوحكى القرطبي عن مجاهد في قوله : ( فمن اضطر ) أي : أكره على ذلك بغير اختياره .\nمسألة : ذكر القرطبي إذا وجد المضطر ميتة وطعام الغير بحيث لا قطع فيه ولا أذى ، فإنه لا يحل له أكل الميتة بل يأكل طعام الغير بلا خلاف . كذا قال ، ثم قال : وإذا أكله ، والحالة هذه ، هل يضمنه أم لا ؟ فيه قولان هما روايتان عن مالك ، ثم أورد من سنن ابن ماجه من حديث شعبة عن أبي إياس جعفر بن أبي وحشية : سمعت عباد بن العنزي قال : أصابتنا عاما مخمصة ، فأتيت المدينة . فأتيت حائطا ، فأخذت سنبلا ففركته وأكلته ، وجعلت منه في كسائي ، فجاء صاحب الحائط فضربني وأخذ ثوبي ، فأتيت رسول الله صلى الله عليه وسلم فأخبرته ، فقال للرجل : \" ما أطعمته إذ كان جائعا أو ساعيا ، ولا علمته إذ كان جاهلا \" . فأمره فرد إليه ثوبه ، وأمر له بوسق من طعام أو نصف وسق ، إسناد صحيح قوي جيد وله شواهد كثيرة : من ذلك حديث عمرو بن شعيب ، عن أبيه ، عن جده : سئل رسول الله صلى الله عليه وسلم عن الثمر المعلق ، فقال : \" من أصاب منه من ذي حاجة بفيه غير متخذ خبنة فلا شيء عليه \" الحديث .\nوقال مقاتل بن حيان في قوله : ( فلا إثم عليه إن الله غفور رحيم ) فيما أكل من اضطرار ، وبلغنا والله أعلم أنه لا يزاد على ثلاث لقم .\nوقال سعيد بن جبير : غفور لما أكل من الحرام . رحيم إذ أحل له الحرام في الاضطرار .\nوقال وكيع : حدثنا الأعمش ، عن أبي الضحى ، عن مسروق قال : من اضطر فلم يأكل ولم يشرب ، ثم مات دخل النار .\n[ وهذا يقتضي أن أكل الميتة للمضطر عزيمة لا رخصة . قال أبو الحسن الطبري المعروف بالكيا الهراسي رفيق الغزالي في الاشتغال : وهذا هو الصحيح عندنا ; كالإفطار للمريض في رمضان ونحو ذلك ] .\n                                    ",
        "qortoby": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ بِهِۦ لِغَيۡرِ ٱللَّهِۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَلَآ إِثۡمَ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٣٧١\n                                    \n                                    \n                                    قوله تعالى : إنما حرم عليكم الميتة والدم ولحم الخنزير وما أهل به لغير الله فمن اضطر غير باغ ولا عاد فلا إثم عليه إن الله غفور رحيم\nفيه أربع وثلاثون مسألة :\nالأولى : قوله تعالى : إنما حرم عليكم الميتة إنما كلمة موضوعة للحصر ، تتضمن النفي والإثبات ، فتثبت ما تناوله الخطاب وتنفي ما عداه ، وقد حصرت ها هنا التحريم ، لا سيما وقد جاءت عقيب التحليل في قوله تعالى : يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم فأفادت الإباحة على الإطلاق ، ثم عقبها بذكر المحرم بكلمة إنما الحاصرة ، فاقتضى ذلك الإيعاب للقسمين ، فلا محرم يخرج عن هذه الآية ، وهي مدنية ، وأكدها بالآية الأخرى التي روي أنها نزلت بعرفة : قل لا أجد في ما أوحي إلي محرما على طاعم يطعمه إلى آخرها ، فاستوفى البيان أولا وآخرا ، قاله ابن العربي . وسيأتي الكلام في تلك في \" الأنعام \" إن شاء الله تعالى .\nالثانية : الميتة نصب ب حرم ، و \" ما \" كافة . ويجوز أن تجعلها بمعنى الذي ، منفصلة في الخط ، وترفع الميتة والدم ولحم الخنزير على خبر \" إن \" وهي قراءة ابن أبي عبلة . وفي حرم ضمير يعود على الذي ، ونظيره قوله تعالى : إنما صنعوا كيد ساحر . وقرأ أبو جعفر \" حرم \" بضم الحاء وكسر الراء ورفع الأسماء بعدها ، إما على ما لم يسم فاعله ، وإما على خبر إن . وقرأ أبو جعفر بن القعقاع أيضا \" الميتة \" بالتشديد . الطبري : وقال جماعة من اللغويين : التشديد والتخفيف في ميت ، وميت لغتان . وقال أبو حاتم وغيره : ما قد مات فيقالان فيه ، وما لم يمت بعد فلا يقال فيه \" ميت \" بالتخفيف ، دليله قوله تعالى : إنك ميت وإنهم ميتون . وقال الشاعر :\nليس من مات فاستراح بميت إنما الميت ميت الأحياء\nولم يقرأ أحد بتخفيف ما لم يمت ، إلا ما روى البزي عن ابن كثير \" وما هو بميت \" والمشهور عنه التثقيل ، وأما قول الشاعر :\nإذا ما مات ميت من تميم فسرك أن يعيش فجئ بزاد\nفلا أبلغ في الهجاء من أنه أراد الميت حقيقة ، وقد ذهب بعض الناس إلى أنه أراد من شارف الموت ، والأول أشهر .\nالثالثة : الميتة : ما فارقته الروح من غير ذكاة مما يذبح ، وما ليس بمأكول فذكاته كموته ، كالسباع وغيرها ، على ما يأتي بيانه هنا وفي \" الأنعام \" إن شاء الله تعالى .\nالرابعة : هذه الآية عامة دخلها التخصيص بقوله عليه السلام : أحلت لنا ميتتان الحوت والجراد ودمان الكبد والطحال . أخرجه الدارقطني وكذلك حديث جابر في العنبر يخصص عموم القرآن بصحة سنده . خرجه البخاري ومسلم مع قوله تعالى : أحل لكم صيد البحر ، على ما يأتي بيانه هناك ، إن شاء الله تعالى .\nوأكثر أهل العلم على جواز أكل جميع دواب البحر حيها وميتها ، وهو مذهب مالك . وتوقف أن يجيب في خنزير الماء وقال : أنتم تقولون خنزيرا قال ابن القاسم : وأنا أتقيه ولا أراه حراما .\nالخامسة : وقد اختلف الناس في تخصيص كتاب الله تعالى بالسنة ، ومع اختلافهم في ذلك اتفقوا على أنه لا يجوز تخصيصه بحديث ضعيف ، قاله ابن العربي . وقد يستدل على تخصيص هذه الآية أيضا بما في صحيح مسلم من حديث عبد الله بن أبي أوفى قال : غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات كنا نأكل الجراد معه . وظاهره أكله كيف ما مات بعلاج أو حتف أنفه ، وبهذا قال ابن نافع وابن عبد الحكم وأكثر العلماء ، وهو مذهب الشافعي وأبي حنيفة وغيرهما . ومنع مالك وجمهور أصحابه من أكله إن مات حتف أنفه ; لأنه من صيد البر ، ألا ترى أن المحرم يجزئه إذا قتله ، فأشبه الغزال . وقال أشهب : إن مات من قطع رجل أو جناح لم يؤكل ; لأنها حالة قد يعيش بها وينسل . وسيأتي لحكم الجراد مزيد بيان في \" الأعراف \" عند ذكره ، إن شاء الله تعالى .\nالسادسة : واختلف العلماء هل يجوز أن ينتفع بالميتة أو بشيء من النجاسات ، واختلف عن مالك في ذلك أيضا ، فقال مرة : يجوز الانتفاع بها ; لأن النبي صلى الله عليه وسلم مر على شاة ميمونة فقال : ( هلا أخذتم إهابها ) الحديث . وقال مرة : جملتها محرم ، فلا يجوز الانتفاع بشيء منها ، ولا بشيء من النجاسات على وجه من وجوه الانتفاع ، حتى لا يجوز أن يسقى الزرع ولا الحيوان الماء النجس ، ولا تعلف البهائم النجاسات ، ولا تطعم الميتة الكلاب والسباع ، وإن أكلتها لم تمنع . ووجه هذا القول ظاهر قوله تعالى : حرمت عليكم الميتة والدم ولم يخص وجها من وجه ، ولا يجوز أن يقال : هذا الخطاب مجمل ; لأن المجمل ما لا يفهم المراد من ظاهره ، وقد فهمت العرب المراد من قوله تعالى : \" حرمت عليكم الميتة \" ، وأيضا فإن النبي صلى الله عليه وسلم قال : لا تنتفعوا من الميتة بشيء . وفي حديث عبد الله بن عكيم لا تنتفعوا من الميتة بإهاب ولا عصب . وهذا آخر ما ورد به كتابه قبل موته بشهر ، وسيأتي بيان هذه الأخبار والكلام عليها في \" النحل \" إن شاء الله تعالى .\nالسابعة : فأما الناقة إذا نحرت ، أو البقرة أو الشاة إذا ذبحت ، وكان في بطنها جنين ميت فجائز أكله من غير تذكية له في نفسه ، إلا أن يخرج حيا فيذكى ، ويكون له حكم نفسه ، وذلك أن الجنين إذا خرج منها بعد الذبح ميتا جرى مجرى العضو من أعضائها ، ومما يبين ذلك أنه لو باع الشاة واستثنى ما في بطنها لم يجز ، كما لو استثنى عضوا منها ، وكان ما في بطنها تابعا لها كسائر أعضائها ، وكذلك لو أعتقها من غير أن يوقع على ما في بطنها عتقا مبتدأ ، ولو كان منفصلا عنها لم يتبعها في بيع ولا عتق ، وقد روى جابر رضي الله عنه أن رسول الله صلى الله عليه وسلم سئل عن البقرة والشاة تذبح ، والناقة تنحر فيكون في بطنها جنين ميت ، فقال : إن شئتم فكلوه لأن ذكاته ذكاة أمه . خرجه أبو داود بمعناه من حديث أبي سعيد الخدري وهو نص لا يحتمل ، وسيأتي لهذا مزيد بيان في سورة \" المائدة \" إن شاء الله تعالى .\nالثامنة : واختلفت الرواية عن مالك في جلد الميتة هل يطهر بالدباغ أو لا ، فروي عنه أنه لا يطهر ، وهو ظاهر مذهبه ، وروي عنه أنه يطهر ، لقوله عليه السلام أيما إهاب دبغ فقد طهر ، ووجه قوله : لا يطهر ، بأنه جزء من الميتة لو أخذ منها في حال الحياة كان نجسا ، فوجب ألا يطهره الدباغ قياسا على اللحم ، وتحمل الأخبار بالطهارة على أن الدباغ يزيل الأوساخ عن الجلد حتى ينتفع به في الأشياء اليابسة وفي الجلوس عليه ، ويجوز أيضا أن ينتفع به في الماء بأن يجعل سقاء ; لأن الماء على أصل الطهارة ما لم يتغير له وصف على ما يأتي من حكمه في سورة \" الفرقان \" ، والطهارة في اللغة متوجهة نحو إزالة الأوساخ كما تتوجه إلى الطهارة الشرعية ، والله تعالى أعلم .\nالتاسعة : وأما شعر الميتة وصوفها فطاهر ، لما روي عن أم سلمة رضي الله عنها عن النبي صلى الله عليه وسلم أنه قال : لا بأس بمسك الميتة إذا دبغ وصوفها وشعرها إذا غسل ; ولأنه كان طاهرا لو أخذ منها في حال الحياة فوجب أن يكون كذلك بعد الموت ، إلا أن اللحم لما كان نجسا في حال الحياة كان كذلك بعد الموت ، فيجب أن يكون الصوف خلافه في حال الموت كما كان خلافه في حال الحياة استدلالا بالعكس ، ولا يلزم على هذا اللبن والبيضة من الدجاجة الميتة ; لأن اللبن عندنا طاهر بعد الموت ، وكذلك البيضة ، ولكنهما حصلا في وعاء نجس فتنجسا بمجاورة الوعاء لا أنهما نجسا بالموت . وسيأتي مزيد بيان لهذه المسألة والتي قبلها وما للعلماء فيهما من الخلاف في سورة \" النحل \" إن شاء الله تعالى .\nالعاشرة : وأما ما وقعت فيه الفأرة فله حالتان : حالة تكون إن أخرجت الفأرة حية فهو طاهر ، وإن ماتت فيه فله حالتان : حالة يكون مائعا فإنه ينجس جميعه ، وحالة يكون جامدا فإنه ينجس ما جاورها ، فتطرح وما حولها ، وينتفع بما بقي وهو على طهارته ; لما رويأن النبي صلى الله عليه وسلم سئل عن الفأرة تقع في السمن فتموت ، فقال عليه السلام : إن كان جامدا فاطرحوها وما حولها وإن كان مائعا فأريقوه ، واختلف العلماء فيه إذا غسل ، فقيل : لا يطهر بالغسل ; لأنه مائع نجس فأشبه الدم والخمر والبول وسائر النجاسات ، وقال ابن القاسم : يطهر بالغسل ; لأنه جسم تنجس بمجاورة النجاسة فأشبه الثوب ، ولا يلزم على هذا الدم ; لأنه نجس بعينه ، ولا الخمر والبول لأن الغسل يستهلكهما ولا يتأتى فيه .\nالحادية عشرة : فإذا حكمنا بطهارته بالغسل رجع إلى حالته الأولى في الطهارة وسائر وجوه الانتفاع ، لكن لا يبيعه حتى يبين ; لأن ذلك عيب عند الناس تأباه نفوسهم . ومنهم من يعتقد تحريمه ونجاسته ، فلا يجوز بيعه حتى يبين العيب كسائر الأشياء المعيبة ، وأما قبل الغسل فلا يجوز بيعه بحال ، لأن النجاسات عنده لا يجوز بيعها ، ولأنه مائع نجس فأشبه الخمر ، ولأن النبي صلى الله عليه وسلم سئل عن ثمن الخمر فقال : لعن الله اليهود حرمت عليهم الشحوم فجملوها فباعوها وأكلوا أثمانها وأن الله إذا حرم شيئا حرم ثمنه وهذا المائع محرم لنجاسته فوجب أن يحرم ثمنه بحكم الظاهر .\nالثانية عشرة : واختلف إذا وقع في القدر حيوان ، طائر أو غيره [ فمات ] فروى ابن وهب عن مالك أنه قال : لا يؤكل ما في القدر ، وقد تنجس بمخالطة الميتة إياه ، وروى ابن القاسم عنه أنه قال : يغسل اللحم ويراق المرق ، وقد سئل ابن عباس عن هذه المسألة فقال : يغسل اللحم ويؤكل ، ولا مخالف له في المرق من أصحابه ، ذكره ابن خويز منداد .\nالثالثة عشرة : فأما إنفحة الميتة ولبن الميتة فقال الشافعي : ذلك نجس لعموم قوله تعالى حرمت عليكم الميتة ، وقال أبو حنيفة بطهارتهما ، ولم يجعل لموضع الخلقة أثرا في تنجس ما جاوره مما حدث فيه خلقة ، قال : ولذلك يؤكل اللحم بما فيه من العروق ، مع القطع بمجاورة الدم لدواخلها من غير تطهير ولا غسل إجماعا . وقال مالك نحو قول أبي حنيفة إن ذلك لا ينجس بالموت ، ولكن ينجس بمجاورة الوعاء النجس وهو مما لا يتأتى فيه الغسل ، وكذلك الدجاجة تخرج منها البيضة بعد موتها ; لأن البيضة لينة في حكم المائع قبل خروجها ، وإنما تجمد وتصلب بالهواء .\nقال ابن خويز منداد فإن قيل : فقولكم يؤدي إلى خلاف الإجماع ، وذلك أن النبي صلى الله عليه وسلم والمسلمين بعده كانوا يأكلون الجبن وكان مجلوبا إليهم من أرض العجم ، ومعلوم أن ذبائح العجم وهم مجوس ميتة ، ولم يعتدوا بأن يكون مجمدا بإنفحة ميتة أو ذكي . قيل له : قدر ما يقع من الإنفحة في اللبن المجبن يسير ، واليسير من النجاسة معفو عنه إذا خالط الكثير من المائع . هذا جواب على إحدى الروايتين . وعلى الرواية الأخرى إنما كان ذلك في أول الإسلام ، ولا يمكن أحد أن ينقل أن الصحابة أكلت الجبن المحمول من أرض العجم ، بل الجبن ليس من طعام العرب ، فلما انتشر المسلمون في أرض العجم بالفتوح صارت الذبائح لهم ، فمن أين لنا أن النبي صلى الله عليه وسلم والصحابة أكلت جبنا فضلا عن أن يكون محمولا من أرض العجم ومعمولا من إنفحة ذبائحهم .\nوقال أبو عمر : ولا بأس بأكل طعام عبدة الأوثان والمجوس وسائر من لا كتاب له من الكفار ما لم يكن من ذبائحهم ولم يحتج إلى ذكاة إلا الجبن لما فيه من إنفحة الميتة . وفي سنن ابن ماجه \" الجبن والسمن \" حدثنا إسماعيل بن موسى السدي حدثنا سيف بن هارون عن سليمان التيمي عن أبي عثمان النهدي عن سلمان الفارسي قال : سئل رسول الله صلى الله عليه وسلم عن السمن والجبن والفراء . فقال : الحلال ما أحل الله في كتابه والحرام ما حرم الله في كتابه وما سكت عنه فهو مما عفا عنه .\nالرابعة عشرة : قوله تعالى : والدم اتفق العلماء على أن الدم حرام نجس لا يؤكل ولا ينتفع به . قال ابن خويز منداد : وأما الدم فمحرم ما لم تعم به البلوى ، ومعفو عما تعم به البلوى ، والذي تعم به البلوى هو الدم في اللحم وعروقه ، ويسيره في البدن والثوب يصلى فيه . وإنما قلنا ذلك لأن الله تعالى قال : حرمت عليكم الميتة والدم وقال في موضع آخر قل لا أجد في ما أوحي إلي محرما على طاعم يطعمه إلا أن يكون ميتة أو دما مسفوحا . فحرم المسفوح من الدم ، وقد روت عائشة رضي الله عنها قالت : كنا نطبخ البرمة على عهد رسول الله صلى الله عليه وسلم تعلوها الصفرة من الدم فنأكل ولا ننكره لأن التحفظ من هذا إصر وفيه مشقة ، والإصر والمشقة في الدين موضوع ، وهذا أصل في الشرع ، أن كلما حرجت الأمة في أداء العبادة فيه وثقل عليها سقطت العبادة عنها فيه ، ألا ترى أن المضطر يأكل الميتة ، وأن المريض يفطر ويتيمم في نحو ذلك .\nقلت : ذكر الله سبحانه وتعالى الدم ها هنا مطلقا ، وقيده في الأنعام بقوله مسفوحا وحمل العلماء ها هنا المطلق على المقيد إجماعا . فالدم هنا يراد به المسفوح ; لأن ما خالط اللحم فغير محرم بإجماع ، وكذلك الكبد والطحال مجمع عليه ، وفي دم الحوت المزايل له اختلاف ، وروي عن القابسي أنه طاهر ، ويلزم على طهارته أنه غير محرم ، وهو اختيار ابن العربي ، قال : لأنه لو كان دم السمك نجسا لشرعت ذكاته .\nقلت : وهو مذهب أبي حنيفة في دم الحوت ، سمعت بعض الحنفية يقول : الدليل على أنه طاهر أنه إذا يبس ابيض بخلاف سائر الدماء فإنه يسود ، وهذه النكتة لهم في الاحتجاج على الشافعية .\nالخامسة عشرة : قوله تعالى : ولحم الخنزير خص الله تعالى ذكر اللحم من الخنزير ليدل على تحريم عينه ذكي أو لم يذك ، وليعم الشحم وما هنالك من الغضاريف وغيرها .\nالسادسة عشرة : أجمعت الأمة على تحريم شحم الخنزير ، وقد استدل مالك وأصحابه على أن من حلف ألا يأكل شحما فأكل لحما لم يحنث بأكل اللحم . فإن حلف ألا يأكل لحما فأكل شحما حنث لأن اللحم مع الشحم يقع عليه اسم اللحم ، فقد دخل الشحم في اسم اللحم ولا يدخل اللحم في اسم الشحم ، وقد حرم الله تعالى لحم الخنزير فناب ذكر لحمه عن شحمه ; لأنه دخل تحت اسم اللحم ، وحرم الله تعالى على بني إسرائيل الشحوم بقوله : حرمنا عليهم شحومهما فلم يقع بهذا عليهم تحريم اللحم ولم يدخل في اسم الشحم ، فلهذا فرق مالك بين الحالف في الشحم والحالف في اللحم ، إلا أن يكون للحالف نية في اللحم دون الشحم فلا يحنث والله تعالى أعلم ، ولا يحنث في قول الشافعي وأبي ثور وأصحاب الرأي إذا حلف ألا يأكل لحما فأكل شحما ، وقال أحمد : إذا حلف ألا يأكل لحما فأكل الشحم لا بأس به إلا أن يكون أراد اجتناب الدسم .\nالسابعة عشرة : لا خلاف أن جملة الخنزير محرمة إلا الشعر فإنه يجوز الخرازة به ، وقد روي أن رجلا سأل رسول الله صلى الله عليه وسلم عن الخرازة بشعر الخنزير ، فقال : لا بأس بذلك ذكره ابن خويز منداد ، قال : ولأن الخرازة على عهد رسول الله صلى الله عليه وسلم كانت ، وبعده موجودة ظاهرة ، لا نعلم أن رسول الله صلى الله عليه وسلم أنكرها ولا أحد من الأئمة بعده . وما أجازه الرسول صلى الله عليه وسلم فهو كابتداء الشرع منه .\nالثامنة عشرة : لا خلاف في تحريم خنزير البر كما ذكرنا ، وفي خنزير الماء خلاف ، وأبى مالك أن يجيب فيه بشيء ، وقال : أنتم تقولون خنزيرا وقد تقدم ، وسيأتي بيانه في \" المائدة \" إن شاء الله تعالى .\nالتاسعة عشرة : ذهب أكثر اللغويين إلى أن لفظة الخنزير رباعية . وحكى ابن سيده عن بعضهم أنه مشتق من خزر العين ; لأنه كذلك ينظر ، واللفظة على هذا ثلاثية ، وفي الصحاح : وتخازر الرجل إذا ضيق جفنه ليحدد النظر ، والخزر : ضيق العين وصغرها . رجل أخزر بين الخزر ، ويقال : هو أن يكون الإنسان كأنه ينظر بمؤخرها ، وجمع الخنزير خنازير . والخنازير أيضا علة معروفة ، وهي قروح صلبة تحدث في الرقبة .\nالموفية عشرين : قوله تعالى : وما أهل به لغير الله أي ذكر عليه غير اسم الله تعالى ، وهي ذبيحة المجوسي والوثني والمعطل . فالوثني يذبح للوثن ، والمجوسي للنار ، والمعطل لا يعتقد شيئا فيذبح لنفسه ، ولا خلاف بين العلماء أن ما ذبحه المجوسي لناره والوثني لوثنه لا يؤكل ، ولا تؤكل ذبيحتهما عند مالك والشافعي وغيرهما وإن لم يذبحا لناره ووثنه ، وأجازهما ابن المسيب وأبو ثور إذا ذبح لمسلم بأمره ، وسيأتي لهذا مزيد بيان إن شاء الله تعالى في سورة \" المائدة \" ، والإهلال : رفع الصوت ، يقال : أهل بكذا ، أي رفع صوته . قال ابن أحمر يصف فلاة :\nيهل بالفرقد ركبانها كما يهل الراكب المعتمر\nوقال النابغة :\nأو درة صدفية غواصها بهج متى يرها يهل ويسجد\nومنه إهلال الصبي واستهلاله ، وهو صياحه عند ولادته ، وقال ابن عباس وغيره : المراد ما ذبح للأنصاب والأوثان ، لا ما ذكر عليه اسم المسيح ، على ما يأتي بيانه في سورة \" المائدة \" إن شاء الله تعالى ، وجرت عادة العرب بالصياح باسم المقصود بالذبيحة ، وغلب ذلك في استعمالهم حتى عبر به عن النية التي هي علة التحريم ، ألا ترى أن علي بن أبي طالب رضي الله عنه راعى النية في الإبل التي نحرها غالب أبو الفرزدق فقال : إنها مما أهل لغير الله به ، فتركها الناس . قال ابن عطية : ورأيت في أخبار الحسن بن أبي الحسن أنه سئل عن امرأة مترفة صنعت للعبها عرسا فنحرت جزورا ، فقال الحسن : لا يحل أكلها فإنها إنما نحرت لصنم .\nقلت : ومن هذا المعنى ما رويناه عن يحيى بن يحيى التميمي شيخ مسلم قال : أخبرنا جرير عن قابوس قال : أرسل أبي امرأة إلى عائشة رضي الله عنها وأمرها أن تقرأ عليها السلام منه ، وتسألها أية صلاة كانت أعجب إلى رسول الله صلى الله عليه وسلم يدوم عليها . قالت : كان يصلي قبل الظهر أربع ركعات يطيل فيهن القيام ويحسن الركوع والسجود ، فأما ما لم يدع قط ، صحيحا ولا مريضا ولا شاهدا ، ركعتين قبل صلاة الغداة . قالت امرأة عند ذلك من الناس : يا أم المؤمنين ، إن لنا أظآرا من العجم لا يزال يكون لهم عيد فيهدون لنا منه ، أفنأكل منه شيئا ؟ قالت : أما ما ذبح لذلك اليوم فلا تأكلوا ولكن كلوا من أشجارهم .\nالحادية والعشرون : قوله تعالى : فمن اضطر قرئ بضم النون للاتباع وبالكسر وهو الأصل لالتقاء الساكنين ، وفيه إضمار ، أي فمن اضطر إلى شيء من هذه المحرمات أي أحوج إليها ، فهو افتعل من الضرورة ، وقرأ ابن محيصن \" فمن اطر \" بإدغام الضاد في الطاء ، وأبو السمال \" فمن اضطر \" بكسر الطاء ، وأصله اضطرر فلما أدغمت نقلت حركة الراء إلى الطاء .\nالثانية والعشرون : الاضطرار لا يخلو أن يكون بإكراه من ظالم أو بجوع في مخمصة ، والذي عليه الجمهور من الفقهاء والعلماء في معنى الآية هو من صيره العدم والغرث وهو الجوع إلى ذلك ، وهو الصحيح ، وقيل : معناه أكره وغلب على أكل هذه المحرمات . قال مجاهد : يعني أكره عليه كالرجل يأخذه العدو فيكرهونه على أكل لحم الخنزير وغيره من معصية الله تعالى ، إلا أن الإكراه يبيح ذلك إلى آخر الإكراه .\nوأما المخمصة فلا يخلو أن تكون دائمة أو لا ، فإن كانت دائمة فلا خلاف في جواز الشبع من الميتة إلا أنه لا يحل له أكلها وهو يجد مال مسلم لا يخاف فيه قطعا ، كالتمر المعلق وحريسة الجبل ، ونحو ذلك مما لا قطع فيه ولا أذى ، وهذا مما لا اختلاف فيه ، لحديث أبي هريرة رضي الله عنه قال : بينما نحن مع رسول الله صلى الله عليه وسلم في سفر إذ رأينا إبلا مصرورة بعضاه الشجر فثبنا إليها فنادانا رسول الله صلى الله عليه وسلم فرجعنا إليه فقال : إن هذه الإبل لأهل بيت من المسلمين هو قوتهم ويمنهم بعد الله أيسركم لو رجعتم إلى مزاودكم فوجدتم ما فيها قد ذهب به أترون ذلك عدلا قالوا لا ، فقال : إن هذه كذلك . قلنا : أفرأيت إن احتجنا إلى الطعام والشراب ؟ فقال : كل ولا تحمل واشرب ولا تحمل . خرجه ابن ماجه رحمه الله ، وقال : هذا الأصل عندي ، وذكره ابن المنذر قال : قلنا يا رسول الله ، ما يحل لأحدنا من مال أخيه إذا اضطر إليه ؟ قال : يأكل ولا يحمل ويشرب ولا يحمل . قال ابن المنذر : وكل مختلف فيه بعد ذلك فمردود إلى تحريم الله الأموال . قال أبو عمر : وجملة القول في ذلك أن المسلم إذا تعين عليه رد رمق مهجة المسلم ، وتوجه الفرض في ذلك بألا يكون هناك غيره قضي عليه بترميق تلك المهجة الآدمية ، وكان للممنوع منه ما له من ذلك محاربة من منعه ومقاتلته ، وإن أتى ذلك على نفسه ، وذلك عند أهل العلم إذا لم يكن هناك إلا واحد لا غير ، فحينئذ يتعين عليه الفرض ، فإن كانوا كثيرا أو جماعة وعددا كان ذلك عليهم فرضا على الكفاية ، والماء في ذلك وغيره مما يرد نفس المسلم ويمسكها سواء . إلا أنهم اختلفوا في وجوب قيمة ذلك الشيء على الذي ردت به مهجته ورمق به نفسه ، فأوجبها موجبون ، وأباها آخرون ، وفي مذهبنا القولان جميعا ، ولا خلاف بين أهل العلم متأخريهم ومتقدميهم في وجوب رد مهجة المسلم عند خوف الذهاب والتلف بالشيء اليسير الذي لا مضرة فيه على صاحبه وفيه البلغة .\nالثالثة والعشرون : خرج ابن ماجه أنبأنا أبو بكر بن أبي شيبة أنبأنا شبابة ( ح ) وحدثنا محمد بن بشار ومحمد بن الوليد قالا حدثنا محمد بن جعفر حدثنا شعبة عن أبي بشر جعفر بن إياس قال : سمعت عباد بن شرحبيل - رجلا من بني غبر - قال : أصابنا عاما مخمصة فأتيت المدينة فأتيت حائطا من حيطانها فأخذت سنبلا ففركته وأكلته وجعلته في كسائي ، فجاء صاحب الحائط فضربني وأخذ ثوبي ، فأتيت رسول الله صلى الله عليه وسلم فأخبرته ، فقال للرجل : ما أطعمته إذ كان جائعا أو ساغبا ولا علمته إذ كان جاهلا فأمره النبي صلى الله عليه وسلم فرد إليه ثوبه ، وأمر له بوسق من طعام أو نصف وسق .\nقلت : هذا حديث صحيح اتفق على رجاله البخاري ومسلم ، إلا ابن أبي شيبة فإنه لمسلم وحده وعباد بن شرحبيل الغبري اليشكري لم يخرج له البخاري ومسلم شيئا ، وليس له عن النبي صلى الله عليه وسلم غير هذه القصة فيما ذكر أبو عمر رحمه الله ، وهو ينفي القطع والأدب في المخمصة . وقد روى أبو داود عن الحسن عن سمرة أن النبي صلى الله عليه وسلم قال : إذا أتى أحدكم على ماشية فإن كان فيها صاحبها فليستأذنه فإن أذن له فليحتلب وليشرب وإن لم يكن فيها فليصوت ثلاثا فإن أجاب فليستأذنه فإن أذن له وإلا فليحتلب وليشرب ولا يحمل . وذكر الترمذي عن يحيى بن سليم عن عبيد الله عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم قال : من دخل حائطا فليأكل ولا يتخذ خبنة . قال : هذا حديث غريب لا نعرفه إلا من حديث يحيى بن سليم وذكر من حديث عمرو بن شعيب عن أبيه عن جده أن النبي صلى الله عليه وسلم سئل عن الثمر المعلق ، فقال : من أصاب منه من ذي حاجة غير متخذ خبنة فلا شيء عليه . قال فيه : حديث حسن . وفي حديث عمر رضي الله عنه : إذا مر أحدكم بحائط فليأكل ولا يتخذ ثبانا . قال أبو عبيد قال أبو عمر : وهو الوعاء الذي يحمل فيه الشيء ، فإن حملته بين يديك فهو ثبان ، يقال : قد تثبنت ثبانا ، فإن حملته على ظهرك فهو الحال ، يقال منه : قد تحولت كسائي إذا جعلت فيه شيئا ثم حملته على ظهرك ، فإن جعلته في حضنك فهو خبنة ، ومنه حديث عمرو بن شعيب المرفوع ولا يتخذ خبنة . يقال منه : خبنت أخبن خبنا . قال أبو عبيد : وإنما يوجه هذا الحديث أنه رخص فيه للجائع المضطر الذي لا شيء معه يشتري به ألا يحمل إلا ما كان في بطنه قدر قوته .\nقلت : لأن الأصل المتفق عليه تحريم مال الغير إلا بطيب نفس منه ، فإن كانت هناك عادة بعمل ذلك كما كان في أول الإسلام ، أو كما هو الآن في بعض البلدان ، فذلك جائز ، ويحمل ذلك على أوقات المجاعة والضرورة ، كما تقدم والله أعلم .\nوإن كان الثاني وهو النادر في وقت من الأوقات ، فاختلف العلماء فيها على قولين : أحدهما : أنه يأكل حتى يشبع ويتضلع ، ويتزود إذا خشي الضرورة فيما بين يديه من مفازة وقفر ، وإذا وجد عنها غنى طرحها . قال معناه مالك في موطئه ، وبه قال الشافعي وكثير من العلماء ، والحجة في ذلك أن الضرورة ترفع التحريم فيعود مباحا ومقدار الضرورة إنما هو في حالة عدم القوت إلى حالة وجوده ، وحديث العنبر نص في ذلك ، فإن أصحاب النبي صلى الله عليه وسلم لما رجعوا من سفرهم وقد ذهب عنهم الزاد ، انطلقوا إلى ساحل البحر فرفع لهم على ساحله كهيئة الكثيب الضخم ، فلما أتوه إذا هي دابة تدعى العنبر ، فقال أبو عبيدة أميرهم : ميتة . ثم قال : لا ، بل نحن رسل رسول الله صلى الله عليه وسلم وفي سبيل الله ، وقد اضطررتم فكلوا . قال : فأقمنا عليها شهرا ونحن ثلاثمائة حتى سمنا ، الحديث ، فأكلوا وشبعوا - رضوان الله عليهم - مما اعتقدوا أنه ميتة وتزودوا منها إلى المدينة ، وذكروا ذلك للنبي صلى الله عليه وسلم فأخبرهم صلى الله عليه وسلم أنه حلال وقال : هل معكم من لحمه شيء فتطعمونا فأرسلوا إلى رسول الله صلى الله عليه وسلم منه فأكله ، وقالت طائفة . يأكل بقدر سد الرمق . وبه قال ابن الماجشون وابن حبيب وفرق أصحاب الشافعي بين حالة المقيم والمسافر فقالوا : المقيم يأكل بقدر ما يسد رمقه ، والمسافر يتضلع ويتزود : فإذا وجد غنى عنها طرحها ، وإن وجد مضطرا أعطاه إياها ولا يأخذ منه عوضا ، فإن الميتة لا يجوز بيعها .\nالرابعة والعشرون : فإن اضطر إلى خمر فإن كان بإكراه شرب بلا خلاف ، وإن كان بجوع أو عطش فلا يشرب ، وبه قال مالك في العتبية قال : ولا يزيده الخمر إلا عطشا . وهو قول الشافعي ، فإن الله تعالى حرم الخمر تحريما مطلقا ، وحرم الميتة بشرط عدم الضرورة ، وقال الأبهري : إن ردت الخمر عنه جوعا أو عطشا شربها ; لأن الله تعالى قال في الخنزير فإنه رجس ثم أباحه للضرورة ، وقال تعالى في الخمر إنها رجس فتدخل في إباحة الخنزير للضرورة بالمعنى الجلي الذي هو أقوى من القياس ، ولا بد أن تروي ولو ساعة ، وترد الجوع ولو مدة .\nالخامسة والعشرون : روى أصبغ عن ابن القاسم أنه قال : يشرب المضطر الدم ولا يشرب الخمر ، ويأكل الميتة ولا يقرب ضوال الإبل - وقاله ابن وهب - ويشرب البول ولا يشرب الخمر ; لأن الخمر يلزم فيها الحد فهي أغلظ . نص عليه أصحاب الشافعي .\nالسادسة والعشرون : فإن غص بلقمة فهل يسيغها بخمر أو لا ، فقيل : لا ، مخافة أن يدعي ذلك ، وأجاز ذلك ابن حبيب ; لأنها حالة ضرورة . ابن العربي : \" أما الغاص بلقمة فإنه يجوز له فيما بينه وبين الله تعالى ، وأما فيما بيننا فإن شاهدناه فلا تخفى علينا بقرائن الحال صورة الغصة من غيرها ، فيصدق إذا ظهر ذلك ، وإن لم يظهر حددناه ظاهرا وسلم من العقوبة عند الله تعالى باطنا ، ثم إذا وجد المضطر ميتة وخنزيرا ولحم ابن آدم أكل الميتة ; لأنها حلال في حال ، والخنزير وابن آدم لا يحل بحال ، والتحريم المخفف أولى أن يقتحم من التحريم المثقل ، كما لو أكره أن يطأ أخته أو أجنبية ، وطئ الأجنبية لأنها تحل له بحال ، وهذا هو الضابط لهذه الأحكام ، ولا يأكل ابن آدم ولو مات ، قاله علماؤنا ، وبه قال أحمد وداود . احتج أحمد بقوله عليه السلام : كسر عظم الميت ككسره حيا ، وقال الشافعي : يأكل لحم ابن آدم ، ولا يجوز له أن يقتل ذميا لأنه محترم الدم ، ولا مسلما ولا أسيرا لأنه مال الغير ، فإن كان حربيا أو زانيا محصنا جاز قتله والأكل منه ، وشنع داود على المزني بأن قال : قد أبحت أكل لحوم الأنبياء فغلب عليه ابن شريح بأن قال : فأنت قد تعرضت لقتل الأنبياء إذ منعتهم من أكل الكافر . قال ابن العربي : الصحيح عندي ألا يأكل الآدمي إلا إذا تحقق أن ذلك ينجيه ويحييه ، والله أعلم .\nالسابعة والعشرون : سئل مالك عن المضطر إلى أكل الميتة وهو يجد مال الغير تمرا أو زرعا أو غنما ، فقال : إن أمن الضرر على بدنه بحيث لا يعد سارقا ويصدق في قوله ، أكل من أي ذلك وجد ما يرد جوعه ولا يحمل منه شيئا ، وذلك أحب إلي من أن يأكل الميتة ، وقد تقدم هذا المعنى مستوفى ، وإن هو خشي ألا يصدقوه وأن يعدوه سارقا فإن أكل الميتة أجوز عندي ، وله في أكل الميتة على هذه المنزلة سعة .\nالثامنة والعشرون : روى أبو داود قال حدثنا موسى بن إسماعيل قال حدثنا حماد عن سماك بن حرب عن جابر بن سمرة أن رجلا نزل الحرة ومعه أهله وولده ، فقال رجل : إن ناقة لي ضلت فإن وجدتها فأمسكها ، فوجدها فلم يجد صاحبها فمرضت ، فقالت امرأته : انحرها ، فأبى فنفقت ، فقالت : اسلخها حتى نقدد لحمها وشحمها ونأكله ، فقال : حتى أسأل رسول الله صلى الله عليه وسلم فأتاه فسأله ، فقال : هل عندك غنى يغنيك قال لا ، قال : فكلوها قال : فجاء صاحبها فأخبره الخبر ، فقال : هلا كنت نحرتها فقال : استحييت منك . قال ابن خويز منداد : في هذا الحديث دليلان : أحدهما : أن المضطر يأكل من الميتة وإن لم يخف التلف ، لأنه سأله عن الغنى ولم يسأله عن خوفه على نفسه ، والثاني : يأكل ويشبع ويدخر ويتزود ; لأنه أباحه الادخار ولم يشترط عليه ألا يشبع . قال أبو داود : وحدثنا هارون بن عبد الله قال حدثنا الفضل بن دكين قال أنبأنا عقبة بن وهب بن عقبة العامري قال : سمعت أبي يحدث عن الفجيع العامري أنه أتى رسول الله صلى الله عليه وسلم فقال : ما يحل لنا الميتة ؟ قال : ما طعامكم قلنا : نغتبق ونصطبح . قال أبو نعيم : فسره لي عقبة : قدح غدوة وقدح عشية قال : ذاك وأبي الجوع . قال : فأحل لهم الميتة على هذه الحال . قال أبو داود : الغبوق من آخر النهار والصبوح من أول النهار ، وقال الخطابي : الغبوق العشاء ، والصبوح الغداء ، والقدح من اللبن بالغداة ، والقدح بالعشي يمسك الرمق ويقيم النفس ، وإن كان لا يغذي البدن ولا يشبع الشبع التام ، وقد أباح لهم مع ذلك تناول الميتة ، فكان دلالته أن تناول الميتة مباح إلى أن تأخذ النفس حاجتها من القوت . وإلى هذا ذهب مالك وهو أحد قولي الشافعي . قال ابن خويز منداد : إذا جاز أن يصطبحوا ويغتبقوا جاز أن يشبعوا ويتزودوا ، وقال أبو حنيفة والشافعي في القول الآخر : لا يجوز له أن يتناول من الميتة إلا قدر ما يمسك رمقه ، وإليه ذهب المزني . قالوا : لأنه لو كان في الابتداء بهذه الحال لم يجز له أن يأكل منها شيئا ، فكذلك إذا بلغها بعد تناولها ، وروي نحوه عن الحسن . وقال قتادة : لا يتضلع منها بشيء ، وقال مقاتل بن حيان : لا يزداد على ثلاث لقم ، والصحيح خلاف هذا ، كما تقدم .\nالتاسعة والعشرون : وأما التداوي بها فلا يخلو أن يحتاج إلى استعمالها قائمة العين أو محرقة ، فإن تغيرت بالإحراق فقال ابن حبيب : يجوز التداوي بها والصلاة ، وخففه ابن الماجشون بناء على أن الحرق تطهير لتغير الصفات ، وفي العتبية من رواية مالك في المرتك يصنع من عظام الميتة إذا وضعه في جرحه لا يصلي به حتى يغسله . وإن كانت الميتة قائمة بعينها فقد قال سحنون : لا يتداوى بها بحال ولا بالخنزير ; لأن منها عوضا حلالا بخلاف المجاعة ، ولو وجد منها عوض في المجاعة لم تؤكل ، وكذلك الخمر لا يتداوى بها ، قاله مالك ، وهو ظاهر مذهب الشافعي ، وهو اختيار ابن أبي هريرة من أصحابه ، وقال أبو حنيفة : يجوز شربها للتداوي دون العطش ، وهو اختيار القاضي الطبري من أصحاب الشافعي ، وهو قول الثوري ، وقال بعض البغداديين من الشافعية : يجوز شربها للعطش دون التداوي ، لأن ضرر العطش عاجل بخلاف التداوي ، وقيل : يجوز شربها للأمرين جميعا ، ومنع بعض أصحاب الشافعي التداوي بكل محرم إلا بأبوال الإبل خاصة ، لحديث العرنيين ، ومنع بعضهم التداوي بكل محرم ، لقوله عليه السلام : إن الله لم يجعل شفاء أمتي فيما حرم عليهم ، ولقوله عليه السلام لطارق بن سويد وقد سأله عن الخمر فنهاه أو كره أن يصنعها فقال ، إنما أصنعها للدواء ، فقال : إنه ليس بدواء ولكنه داء . رواه مسلم في الصحيح ، وهذا يحتمل أن يقيد بحالة الاضطرار ، فإنه يجوز التداوي بالسم ولا يجوز شربه ، والله أعلم .\nالموفية ثلاثين : غير باغ غير نصب على الحال ، وقيل : على الاستثناء ، وإذا رأيت غير يصلح في موضعه \" في \" فهي حال ، وإذا صلح موضعها \" إلا \" فهي استثناء ، فقس عليه . وباغ أصله باغي ، ثقلت الضمة على الياء فسكنت والتنوين ساكن ، فحذفت الياء والكسرة تدل عليها ، والمعنى فيما قال قتادة والحسن والربيع وابن زيد وعكرمة غير باغ في أكله فوق حاجته ، ولا عاد بأن يجد عن هذه المحرمات مندوحة ويأكلها وقال السدي : غير باغ في أكلها شهوة وتلذذا ، ولا عاد باستيفاء الأكل إلى حد الشبع ، وقال مجاهد وابن جبير وغيرهما : المعنى غير باغ على المسلمين ولا عاد عليهم ، فيدخل في الباغي والعادي قطاع الطريق والخارج على السلطان والمسافر في قطع الرحم والغارة على المسلمين وما شاكله ، وهذا صحيح ، فإن أصل البغي في اللغة قصد الفساد ، يقال : بغت المرأة تبغي بغاء إذا فجرت ، قال الله تعالى : ولا تكرهوا فتياتكم على البغاء وربما استعمل البغي في طلب غير الفساد . والعرب تقول : خرج الرجل في بغاء إبل له ، أي في طلبها ، ومنه قول الشاعر :\nإن الأشائم كالأيا من والأيامن كالأشائم\nالحادية والثلاثون : قوله تعالى : ولا عاد أصل عاد عائد ، فهو من المقلوب ، كشاكي السلاح وهار ولاث ، والأصل شائك وهائر ولائث ، من لثت العمامة ، فأباح الله في حالة الاضطرار أكل جميع المحرمات لعجزه عن جميع المباحات كما بينا ، فصار عدم المباح شرطا في استباحة المحرم .\nالثانية والثلاثون : واختلف العلماء إذا اقترن بضرورته معصية بقطع طريق وإخافة سبيل ، فحظرها عليه مالك والشافعي في أحد قوليه لأجل معصيته ; لأن الله سبحانه أباح ذلك عونا ، والعاصي لا يحل أن يعان ، فإن أراد الأكل فليتب وليأكل . وأباحها له أبو حنيفة والشافعي في القول الآخر له ، وسويا في استباحته بين طاعته ومعصيته . قال ابن العربي : وعجبا ممن يبيح له ذلك مع التمادي على المعصية ، وما أظن أحدا يقوله ، فإن قاله فهو مخطئ قطعا .\nقلت : الصحيح خلاف هذا ، فإن إتلاف المرء نفسه في سفر المعصية أشد معصية مما هو فيه ، قال الله تعالى : ولا تقتلوا أنفسكم وهذا عام ، ولعله يتوب في ثاني حال فتمحو التوبة عنه ما كان ، وقد قال مسروق : من اضطر إلى أكل الميتة والدم ولحم الخنزير فلم يأكل حتى مات دخل النار ، إلا أن يعفو الله عنه . قال أبو الحسن الطبري المعروف بإلكيا : وليس أكل الميتة عند الضرورة رخصة بل هو عزيمة واجبة ، ولو امتنع من أكل الميتة كان عاصيا ، وليس تناول الميتة من رخص السفر أو متعلقا بالسفر بل هو من نتائج الضرورة سفرا كان أو حضرا ، وهو كالإفطار للعاصي المقيم إذا كان مريضا ، وكالتيمم للعاصي المسافر عند عدم الماء . قال : وهو الصحيح عندنا .\nقلت : واختلفت الروايات عن مالك في ذلك ، فالمشهور من مذهبه فيما ذكره الباجي في المنتقى : أنه يجوز له الأكل في سفر المعصية ولا يجوز له القصر والفطر وقال ابن خويز منداد : فأما الأكل عند الاضطرار فالطائع والعاصي فيه سواء ; لأن الميتة يجوز تناولها في السفر والحضر ، وليس بخروج الخارج إلى المعاصي يسقط عنه حكم المقيم بل أسوأ حالة من أن يكون مقيما ، وليس كذلك الفطر والقصر ; لأنهما رخصتان متعلقتان بالسفر ، فمتى كان السفر سفر معصية لم يجز أن يقصر فيه ، لأن هذه الرخصة تختص بالسفر ، ولذلك قلنا : إنه يتيمم إذا عدم الماء في سفر المعصية ; لأن التيمم في الحضر والسفر سواء . وكيف يجوز منعه من أكل الميتة والتيمم لأجل معصية ارتكبها ، وفي تركه الأكل تلف نفسه ، وتلك أكبر المعاصي ، وفي تركه التيمم إضاعة للصلاة . أيجوز أن يقال له : ارتكبت معصية فارتكب أخرى ؟ أيجوز أن يقال لشارب الخمر : ازن ؟ وللزاني : اكفر ؟ أو يقال لهما : ضيعا الصلاة ؟ ذكر هذا كله في أحكام القرآن له ، ولم يذكر خلافا عن مالك ولا عن أحد من أصحابه . وقال الباجي : \" وروى زياد بن عبد الرحمن الأندلسي أن العاصي بسفره يقصر الصلاة ، ويفطر في رمضان ، فسوى بين ذلك كله ، وهو قول أبي حنيفة ، ولا خلاف أنه لا يجوز له قتل نفسه بالإمساك عن الأكل ، وأنه مأمور بالأكل على وجه الوجوب ، ومن كان في سفر معصية لا تسقط عنه الفروض والواجبات من الصيام والصلاة ، بل يلزمه الإتيان بها ، فكذلك ما ذكرناه . وجه القول الأول أن هذه المعاني إنما أبيحت في الأسفار لحاجة الناس إليها ، فلا يباح له أن يستعين بها على المعاصي وله سبيل إلى ألا يقتل نفسه . قال ابن حبيب : وذلك بأن يتوب ثم يتناول لحم الميتة بعد توبته ، وتعلق ابن حبيب في ذلك بقوله تعالى : فمن اضطر غير باغ ولا عاد فاشترط في إباحة الميتة للضرورة ألا يكون باغيا ، والمسافر على وجه الحرابة أو القطع ، أو في قطع رحم أو طالب إثم - باغ ومعتد ، فلم توجد فيه شروط الإباحة ، والله أعلم .\nقلت : هذا استدلال بمفهوم الخطاب ، وهو مختلف فيه بين الأصوليين ، ومنظوم الآية أن المضطر غير باغ ولا عاد لا إثم عليه ، وغيره مسكوت عنه ، والأصل عموم الخطاب ، فمن ادعى زواله لأمر ما فعليه الدليل .\nالرابعة والثلاثون : قوله تعالى : فإن الله غفور رحيم أي يغفر المعاصي ، فأولى ألا يؤاخذ بما رخص فيه ، ومن رحمته أنه رخص .\n                                    ",
        "saadi": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ بِهِۦ لِغَيۡرِ ٱللَّهِۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَلَآ إِثۡمَ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٣٧١\n                                        \n                                        \n                                        \n                                        ولما ذكر تعالى إباحة الطيبات ذكر تحريم الخبائث فقال { إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ } وهي: ما مات بغير تذكية شرعية, لأن الميتة خبيثة مضرة, لرداءتها في نفسها, ولأن الأغلب, أن تكون عن مرض, فيكون زيادة ضرر واستثنى الشارع من هذا العموم, ميتة الجراد, وسمك البحر, فإنه حلال طيب. { وَالدَّمَ } أي: المسفوح كما قيد في الآية الأخرى. { وَمَا أُهِلَّ بِهِ لِغَيْرِ اللَّهِ } أي: ذبح لغير الله, كالذي يذبح للأصنام والأوثان من الأحجار, والقبور ونحوها, وهذا المذكور غير حاصر للمحرمات، جيء به لبيان أجناس الخبائث المدلول عليها بمفهوم قوله: { طَيِّبَاتِ } فعموم المحرمات, تستفاد من الآية السابقة, من قوله: { حَلَالًا طَيِّبًا } كما تقدم. وإنما حرم علينا هذه الخبائث ونحوها, لطفا بنا, وتنزيها عن المضر، ومع هذا { فَمَنِ اضْطُرَّ } أي: ألجئ إلى المحرم, بجوع وعدم, أو إكراه، { غَيْرَ بَاغٍ } أي: غير طالب للمحرم, مع قدرته على الحلال, أو مع عدم جوعه، { وَلَا عَادٍ } أي: متجاوز الحد في تناول ما أبيح له, اضطرارا، فمن اضطر وهو غير قادر على الحلال، وأكل بقدر الضرورة فلا يزيد عليها، { فَلَا إِثْمَ } [أي: جناح] عليه، وإذا ارتفع الجناح الإثم رجع الأمر إلى ما كان عليه، والإنسان بهذه الحالة, مأمور بالأكل, بل منهي أن يلقي بيده إلى التهلكة, وأن يقتل نفسه. فيجب, إذًا عليه الأكل, ويأثم إن ترك الأكل حتى مات, فيكون قاتلا لنفسه. وهذه الإباحة والتوسعة, من رحمته تعالى بعباده, فلهذا ختمها بهذين الاسمين الكريمين المناسبين غاية المناسبة فقال: { إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } ولما كان الحل مشروطا بهذين الشرطين, وكان الإنسان في هذه الحالة, ربما لا يستقصي تمام الاستقصاء في تحقيقها - أخبر تعالى أنه غفور, فيغفر ما أخطأ فيه في هذه الحال, خصوصا وقد غلبته الضرورة, وأذهبت حواسه المشقة. وفي هذه الآية دليل على القاعدة المشهورة: \" الضرورات تبيح المحظورات \" فكل محظور, اضطر إليه الإنسان, فقد أباحه له, الملك الرحمن. [فله الحمد والشكر, أولا وآخرا, وظاهرا وباطنا].\n                                    "
      },
      "originalText": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ بِهِۦ لِغَيۡرِ ٱللَّهِۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَلَآ إِثۡمَ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ ٣٧١"
    },
    {
      "number": 181,
      "text": "إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنْزَلَ اللَّهُ مِنَ الْكِتَابِ وَيَشْتَرُونَ بِهِ ثَمَنًا قَلِيلًا ۙ أُولَٰئِكَ مَا يَأْكُلُونَ فِي بُطُونِهِمْ إِلَّا النَّارَ وَلَا يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 174,
      "juz": 2,
      "manzil": 1,
      "page": 26,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلَ ٱللَّهُ مِنَ ٱلۡكِتَٰبِ وَيَشۡتَرُونَ بِهِۦ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ مَا يَأۡكُلُونَ فِي بُطُونِهِمۡ إِلَّا ٱلنَّارَ وَلَا يُكَلِّمُهُمُ ٱللَّهُ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ ٤٧١\n                                    \n                                    \n                                    يقول تعالى : ( إن الذين يكتمون ) [ مما يشهد له بالرسالة ] ( ما أنزل الله من الكتاب ) يعني اليهود الذين كتموا صفة محمد صلى الله عليه وسلم في كتبهم التي بأيديهم ، مما تشهد له بالرسالة والنبوة ، فكتموا ذلك لئلا تذهب رياستهم وما كانوا يأخذونه من العرب من الهدايا والتحف على تعظيمهم إياهم ، فخشوا لعنهم الله إن أظهروا ذلك أن يتبعه الناس ويتركوهم ، فكتموا ذلك إبقاء على ما كان يحصل لهم من ذلك ، وهو نزر يسير ، فباعوا أنفسهم بذلك ، واعتاضوا عن الهدى واتباع الحق وتصديق الرسول والإيمان بما جاء عن الله بذلك النزر اليسير ، فخابوا وخسروا في الدنيا والآخرة ; أما في الدنيا فإن الله أظهر لعباده صدق رسوله ، بما نصبه وجعله معه من الآيات الظاهرات والدلائل القاطعات ، فصدقه الذين كانوا يخافون أن يتبعوه ، وصاروا عونا له على قتالهم ، وباءوا بغضب على غضب ، وذمهم الله في كتابه في غير موضع . من ذلك هذه الآية الكريمة : ( إن الذين يكتمون ما أنزل الله من الكتاب ويشترون به ثمنا قليلا ) وهو عرض الحياة الدنيا ( أولئك ما يأكلون في بطونهم إلا النار ) أي : إنما يأكلون ما يأكلونه في مقابلة كتمان الحق نارا تأجج في بطونهم يوم القيامة . كما قال تعالى : ( إن الذين يأكلون أموال اليتامى ظلما إنما يأكلون في بطونهم نارا وسيصلون سعيرا ) [ النساء : 10 ] وفي الحديث الصحيح عن رسول الله صلى الله عليه وسلم أنه قال : \" الذي يأكل أو يشرب في آنية الذهب والفضة ، إنما يجرجر في بطنه نار جهنم \" .\nوقوله : ( ولا يكلمهم الله يوم القيامة ولا يزكيهم ولهم عذاب أليم ) وذلك لأنه غضبان عليهم ، لأنهم كتموا وقد علموا ، فاستحقوا الغضب ، فلا ينظر إليهم ولا يزكيهم ، أي يثني عليهم ويمدحهم بل يعذبهم عذابا أليما .\nوقد ذكر ابن أبي حاتم وابن مردويه هاهنا [ الحديث الذي رواه مسلم أيضا من ] حديث الأعمش ، عن أبي حازم ، عن أبي هريرة عن رسول الله صلى الله عليه وسلم : \" ثلاثة لا يكلمهم الله ، ولا ينظر إليهم ولا يزكيهم [ ولهم عذاب أليم ] شيخ زان ، وملك كذاب ، وعائل مستكبر \" .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلَ ٱللَّهُ مِنَ ٱلۡكِتَٰبِ وَيَشۡتَرُونَ بِهِۦ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ مَا يَأۡكُلُونَ فِي بُطُونِهِمۡ إِلَّا ٱلنَّارَ وَلَا يُكَلِّمُهُمُ ٱللَّهُ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ ٤٧١\n                                    \n                                    \n                                    قوله تعالى : إن الذين يكتمون ما أنزل الله من الكتاب ويشترون به ثمنا قليلا أولئك ما يأكلون في بطونهم إلا النار ولا يكلمهم الله يوم القيامة ولا يزكيهم ولهم عذاب أليم\nقوله تعالى : إن الذين يكتمون ما أنزل الله من الكتاب يعني علماء اليهود ، كتموا ما أنزل الله في التوراة من صفة محمد صلى الله عليه وسلم وصحة رسالته ، ومعنى أنزل : أظهر ، كما قال تعالى : ومن قال سأنزل مثل ما أنزل الله أي سأظهر ، وقيل : هو على بابه من النزول ، أي ما أنزل به ملائكته على رسله . ويشترون به أي بالمكتوم ثمنا قليلا يعني أخذ الرشاء ، وسماه قليلا لانقطاع مدته وسوء عاقبته ، وقيل : لأن ما كانوا يأخذونه من الرشاء كان قليلا .\nقلت : وهذه الآية وإن كانت في الأخبار فإنها تتناول من المسلمين من كتم الحق مختارا لذلك بسبب دنيا يصيبها ، وقد تقدم هذا المعنى .\nقوله تعالى : في بطونهم ذكر البطون دلالة وتأكيدا على حقيقة الأكل ، إذ قد يستعمل مجازا في مثل أكل فلان أرضي ونحوه ، وفي ذكر البطون أيضا تنبيه على جشعهم وأنهم باعوا آخرتهم بحظهم من المطعم الذي لا خطر له .\nومعنى إلا النار\nأي إنه حرام يعذبهم الله عليه بالنار ، فسمي ما أكلوه من الرشاء نارا لأنه يؤديهم إلى النار ، هكذا قال أكثر المفسرين . وقيل : أي إنه يعاقبهم على كتمانهم بأكل النار في جهنم حقيقة ، فأخبر عن المآل بالحال ، كما قال تعالى : إن الذين يأكلون أموال اليتامى ظلما إنما يأكلون في بطونهم نارا أي أن عاقبته تئول إلى ذلك ، ومنه قولهم :\nلدوا للموت وابنوا للخراب\nقال : فللموت ما تلد الوالدة\nآخر :\nودورنا لخراب الدهر نبنيها\nوهو في القرآن والشعر كثير .\nقوله تعالى : ولا يكلمهم الله يوم القيامة عبارة عن الغضب عليهم وإزالة الرضا عنهم ، يقال : فلان لا يكلم فلانا إذا غضب عليه ، وقال الطبري : المعنى ولا يكلمهم بما يحبونه ، وفي التنزيل اخسئوا فيها ولا تكلمون ، وقيل : المعنى ولا يرسل إليهم الملائكة بالتحية . ولا يزكيهم أي لا يصلح أعمالهم الخبيثة فيطهرهم ، وقال الزجاج : لا يثني عليهم خيرا ولا يسميهم أزكياء . أليم بمعنى مؤلم ، وقد تقدم ، وفي صحيح مسلم عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : ثلاثة لا يكلمهم الله يوم القيامة ولا يزكيهم ولا ينظر إليهم ولهم عذاب أليم شيخ زان وملك كذاب وعائل مستكبر . وإنما خص هؤلاء بأليم العذاب وشدة العقوبة لمحض المعاندة والاستخفاف الحامل لهم على تلك المعاصي ، إذ لم يحملهم على ذلك حاجة ، ولا دعتهم إليه ضرورة كما تدعو من لم يكن مثلهم ، ومعنى لا ينظر إليهم لا يرحمهم ولا يعطف عليهم ، وسيأتي في \" آل عمران \" إن شاء الله تعالى .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلَ ٱللَّهُ مِنَ ٱلۡكِتَٰبِ وَيَشۡتَرُونَ بِهِۦ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ مَا يَأۡكُلُونَ فِي بُطُونِهِمۡ إِلَّا ٱلنَّارَ وَلَا يُكَلِّمُهُمُ ٱللَّهُ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ ٤٧١\n                                        \n                                        \n                                        \n                                        هذا وعيد شديد لمن كتم ما أنزل الله على رسله, من العلم الذي أخذ الله الميثاق على أهله, أن يبينوه للناس ولا يكتموه، فمن تعوض عنه بالحطام الدنيوي, ونبذ أمر الله, فأولئك: { مَا يَأْكُلُونَ فِي بُطُونِهِمْ إِلَّا النَّارَ } لأن هذا الثمن الذي اكتسبوه, إنما حصل لهم بأقبح المكاسب, وأعظم المحرمات, فكان جزاؤهم من جنس عملهم، { وَلَا يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ } بل قد سخط عليهم وأعرض عنهم، فهذا أعظم عليهم من عذاب النار، { وَلَا يُزَكِّيهِمْ } أي: لا يطهرهم من الأخلاق الرذيلة, وليس لهم أعمال تصلح للمدح والرضا والجزاء عليها، وإنما لم يزكهم لأنهم فعلوا أسباب عدم التزكية التي أعظم أسبابها العمل بكتاب الله, والاهتداء به, والدعوة إليه، فهؤلاء نبذوا كتاب الله, وأعرضوا عنه, واختاروا الضلالة على الهدى, والعذاب على المغفرة، فهؤلاء لا يصلح لهم إلا النار, فكيف يصبرون عليها, وأنى لهم الجلد عليها؟\"\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ يَكۡتُمُونَ مَآ أَنزَلَ ٱللَّهُ مِنَ ٱلۡكِتَٰبِ وَيَشۡتَرُونَ بِهِۦ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ مَا يَأۡكُلُونَ فِي بُطُونِهِمۡ إِلَّا ٱلنَّارَ وَلَا يُكَلِّمُهُمُ ٱللَّهُ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٌ ٤٧١"
    },
    {
      "number": 182,
      "text": "أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ وَالْعَذَابَ بِالْمَغْفِرَةِ ۚ فَمَا أَصْبَرَهُمْ عَلَى النَّارِ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 175,
      "juz": 2,
      "manzil": 1,
      "page": 26,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ وَٱلۡعَذَابَ بِٱلۡمَغۡفِرَةِۚ فَمَآ أَصۡبَرَهُمۡ عَلَى ٱلنَّارِ ٥٧١\n                                    \n                                    \n                                    ثم قال تعالى مخبرا عنهم : ( أولئك الذين اشتروا الضلالة بالهدى ) أي : اعتاضوا عن الهدى ، وهو نشر ما في كتبهم من صفة الرسول وذكر مبعثه والبشارة به من كتب الأنبياء واتباعه وتصديقه ، استبدلوا عن ذلك واعتاضوا عنه بالضلالة ، وهو تكذيبه والكفر به وكتمان صفاته في كتبهم ( والعذاب بالمغفرة ) أي : اعتاضوا عن المغفرة بالعذاب وهو ما تعاطوه من أسبابه المذكورة .\nوقوله تعالى : ( فما أصبرهم على النار ) يخبر تعالى أنهم في عذاب شديد عظيم هائل ، يتعجب من رآهم فيها من صبرهم على ذلك ، مع شدة ما هم فيه من العذاب ، والنكال ، والأغلال عياذا بالله من ذلك .\n[ وقيل معنى قوله : ( فما أصبرهم على النار ) أي : ما أدومهم لعمل المعاصي التي تفضي بهم إلى النار ] .\n                                    ",
        "qortoby": "أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ وَٱلۡعَذَابَ بِٱلۡمَغۡفِرَةِۚ فَمَآ أَصۡبَرَهُمۡ عَلَى ٱلنَّارِ ٥٧١\n                                    \n                                    \n                                    قوله تعالى : أولئك الذين اشتروا الضلالة بالهدى والعذاب بالمغفرة فما أصبرهم على النار\nقوله تعالى : أولئك الذين اشتروا الضلالة بالهدى والعذاب بالمغفرة تقدم القول فيه ، ولما كان العذاب تابعا للضلالة وكانت المغفرة تابعة للهدى الذي اطرحوه دخلا في تجوز الشراء .\nقوله تعالى : فما أصبرهم على النار مذهب الجمهور - منهم الحسن ومجاهد - أن \" ما \" معناه التعجب وهو مردود إلى المخلوقين ، كأنه قال : اعجبوا من صبرهم على النار ومكثهم فيها ، وفي التنزيل : قتل الإنسان ما أكفره و أسمع بهم وأبصر . وبهذا المعنى صدر أبو علي . قال الحسن وقتادة وابن جبير والربيع : ما لهم والله عليها من صبر ولكن ما أجرأهم على النار وهي لغة يمنية معروفة . قال الفراء أخبرني الكسائي قال : أخبرني قاضي اليمن أن خصمين اختصما إليه فوجبت اليمين على أحدهما فحلف ، فقال له صاحبه : ما أصبرك على الله ؟ أي ما أجرأك عليه ، والمعنى : ما أشجعهم على النار إذ يعملون عملا يؤدي إليها ، وحكى الزجاج أن المعنى ما أبقاهم على النار ، من قولهم : ما أصبر فلانا على الحبس أي ما أبقاه فيه ، وقيل : المعنى فما أقل جزعهم من النار ، فجعل قلة الجزع صبرا وقال الكسائي وقطرب : أي ما أدومهم على عمل أهل النار ، وقيل : \" ما \" استفهام معناه التوبيخ ، قاله ابن عباس والسدي وعطاء وأبو عبيدة معمر بن المثنى ، ومعناه : أي أي شيء صبرهم على عمل أهل النار ؟ وقيل : هذا على وجه الاستهانة بهم والاستخفاف بأمرهم .\n                                    ",
        "saadi": "أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ وَٱلۡعَذَابَ بِٱلۡمَغۡفِرَةِۚ فَمَآ أَصۡبَرَهُمۡ عَلَى ٱلنَّارِ ٥٧١\n                                        \n                                        \n                                        \n                                        هذا وعيد شديد لمن كتم ما أنزل الله على رسله, من العلم الذي أخذ الله الميثاق على أهله, أن يبينوه للناس ولا يكتموه، فمن تعوض عنه بالحطام الدنيوي, ونبذ أمر الله, فأولئك: { مَا يَأْكُلُونَ فِي بُطُونِهِمْ إِلَّا النَّارَ } لأن هذا الثمن الذي اكتسبوه, إنما حصل لهم بأقبح المكاسب, وأعظم المحرمات, فكان جزاؤهم من جنس عملهم، { وَلَا يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ } بل قد سخط عليهم وأعرض عنهم، فهذا أعظم عليهم من عذاب النار، { وَلَا يُزَكِّيهِمْ } أي: لا يطهرهم من الأخلاق الرذيلة, وليس لهم أعمال تصلح للمدح والرضا والجزاء عليها، وإنما لم يزكهم لأنهم فعلوا أسباب عدم التزكية التي أعظم أسبابها العمل بكتاب الله, والاهتداء به, والدعوة إليه، فهؤلاء نبذوا كتاب الله, وأعرضوا عنه, واختاروا الضلالة على الهدى, والعذاب على المغفرة، فهؤلاء لا يصلح لهم إلا النار, فكيف يصبرون عليها, وأنى لهم الجلد عليها؟\"\n                                    "
      },
      "originalText": "أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ وَٱلۡعَذَابَ بِٱلۡمَغۡفِرَةِۚ فَمَآ أَصۡبَرَهُمۡ عَلَى ٱلنَّارِ ٥٧١"
    },
    {
      "number": 183,
      "text": "ذَٰلِكَ بِأَنَّ اللَّهَ نَزَّلَ الْكِتَابَ بِالْحَقِّ ۗ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِي الْكِتَابِ لَفِي شِقَاقٍ بَعِيدٍ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 176,
      "juz": 2,
      "manzil": 1,
      "page": 26,
      "ruku": 22,
      "hizbQuarter": 10,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَٰلِكَ بِأَنَّ ٱللَّهَ نَزَّلَ ٱلۡكِتَٰبَ بِٱلۡحَقِّۗ وَإِنَّ ٱلَّذِينَ ٱخۡتَلَفُواْ فِي ٱلۡكِتَٰبِ لَفِي شِقَاقِۢ بَعِيدٖ ٦٧١\n                                    \n                                    \n                                    وقوله : ( ذلك بأن الله نزل الكتاب بالحق ) أي : إنما استحقوا هذا العذاب الشديد لأن الله تعالى أنزل على رسوله محمد صلى الله عليه وسلم وعلى الأنبياء قبله كتبه بتحقيق الحق وإبطال الباطل ، وهؤلاء اتخذوا آيات الله هزوا ، فكتابهم يأمرهم بإظهار العلم ونشره ، فخالفوه وكذبوه . وهذا الرسول الخاتم يدعوهم إلى الله تعالى ، ويأمرهم بالمعروف وينهاهم عن المنكر ، وهم يكذبونه ويخالفونه ويجحدونه ، ويكتمون صفته ، فاستهزأوا بآيات الله المنزلة على رسله ; فلهذا استحقوا العذاب والنكال ; ولهذا قال : ( ذلك بأن الله نزل الكتاب بالحق وإن الذين اختلفوا في الكتاب لفي شقاق بعيد ) .\n                                    ",
        "qortoby": "ذَٰلِكَ بِأَنَّ ٱللَّهَ نَزَّلَ ٱلۡكِتَٰبَ بِٱلۡحَقِّۗ وَإِنَّ ٱلَّذِينَ ٱخۡتَلَفُواْ فِي ٱلۡكِتَٰبِ لَفِي شِقَاقِۢ بَعِيدٖ ٦٧١\n                                    \n                                    \n                                    قوله تعالى : ذلك بأن الله نزل الكتاب بالحق وإن الذين اختلفوا في الكتاب لفي شقاق بعيد قوله تعالى : ذلك ذلك في موضع رفع ، وهو إشارة إلى الحكم ، كأنه قال : ذلك الحكم بالنار ، وقال الزجاج : تقديره الأمر ذلك ، أو ذلك الأمر ، أو ذلك العذاب لهم . قال الأخفش : وخبر ذلك مضمر ، معناه ذلك معلوم لهم ، وقيل : محله نصب ، معناه فعلنا ذلك بهم .\nبأن الله نزل الكتاب يعني القرآن في هذا الموضع بالحق أي بالصدق . وقيل بالحجة . وإن الذين اختلفوا في الكتاب يعني التوراة ، فادعى النصارى أن فيها صفة عيسى ، وأنكر اليهود صفته ، وقيل : خالفوا آباءهم وسلفهم في التمسك بها . وقيل : خالفوا ما في التوراة من صفة محمد صلى الله عليه وسلم واختلفوا فيها ، وقيل : المراد القرآن ، والذين اختلفوا كفار قريش ، يقول بعضهم : هو سحر ، وبعضهم يقول : أساطير الأولين ، وبعضهم : مفترى ، إلى غير ذلك . وقد تقدم القول في معنى الشقاق ، والحمد لله .\n                                    ",
        "saadi": "ذَٰلِكَ بِأَنَّ ٱللَّهَ نَزَّلَ ٱلۡكِتَٰبَ بِٱلۡحَقِّۗ وَإِنَّ ٱلَّذِينَ ٱخۡتَلَفُواْ فِي ٱلۡكِتَٰبِ لَفِي شِقَاقِۢ بَعِيدٖ ٦٧١\n                                        \n                                        \n                                        \n                                        { ذَلِكَ } المذكور, وهو مجازاته بالعدل, ومنعه أسباب الهداية, ممن أباها واختار سواها. { بِأَنَّ اللَّهَ نَزَّلَ الْكِتَابَ بِالْحَقِّ } ومن الحق, مجازاة المحسن بإحسانه, والمسيء بإساءته. وأيضا ففي قوله: { نَزَّلَ الْكِتَابَ بِالْحَقِّ } ما يدل على أن الله أنزله لهداية خلقه, وتبيين الحق من الباطل, والهدى من الضلال، فمن صرفه عن مقصوده, فهو حقيق بأن يجازى بأعظم العقوبة. { وَإِنَّ الَّذِينَ اخْتَلَفُوا فِي الْكِتَابِ لَفِي شِقَاقٍ بَعِيدٍ } أي: وإن الذين اختلفوا في الكتاب, فآمنوا ببعضه, وكفروا ببعضه، والذين حرفوه وصرفوه على أهوائهم ومراداتهم { لَفِي شِقَاقٍ } أي: محادة، { بَعِيدٍ } عن الحق لأنهم قد خالفوا الكتاب الذي جاء بالحق الموجب للاتفاق وعدم التناقض، فمرج أمرهم, وكثر شقاقهم, وترتب على ذلك افتراقهم، بخلاف أهل الكتاب الذين آمنوا به, وحكموه في كل شيء, فإنهم اتفقوا وارتفقوا بالمحبة والاجتماع عليه. وقد تضمنت هذه الآيات, الوعيد للكاتمين لما أنزل الله, المؤثرين عليه, عرض الدنيا بالعذاب والسخط, وأن الله لا يطهرهم بالتوفيق, ولا بالمغفرة، وذكر السبب في ذلك بإيثارهم الضلالة على الهدى، فترتب على ذلك اختيار العذاب على المغفرة، ثم توجع لهم بشدة صبرهم على النار, لعملهم بالأسباب التي يعلمون أنها موصلة إليها، وأن الكتاب مشتمل على الحق الموجب للاتفاق عليه, وعدم الافتراق، وأن كل من خالفه, فهو في غاية البعد عن الحق, والمنازعة والمخاصمة, والله أعلم.\n                                    "
      },
      "originalText": "ذَٰلِكَ بِأَنَّ ٱللَّهَ نَزَّلَ ٱلۡكِتَٰبَ بِٱلۡحَقِّۗ وَإِنَّ ٱلَّذِينَ ٱخۡتَلَفُواْ فِي ٱلۡكِتَٰبِ لَفِي شِقَاقِۢ بَعِيدٖ ٦٧١"
    }
  ]
}