{
  "number": 260,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 1784,
      "text": "وَآتَاكُمْ مِنْ كُلِّ مَا سَأَلْتُمُوهُ ۚ وَإِنْ تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ الْإِنْسَانَ لَظَلُومٌ كَفَّارٌ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 34,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 215,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّواْ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱلۡإِنسَٰنَ لَظَلُومٞ كَفَّارٞ ٤٣\n                                    \n                                    \n                                    وقوله : ( وآتاكم من كل ما سألتموه ) يقول : هيأ لكم كل ما تحتاجون إليه في جميع أحوالكم مما تسألونه بحالكم وقالكم .\nوقال بعض السلف : من كل ما سألتموه وما لم تسألوه .\nوقرأ بعضهم : \" وأتاكم من كل ما سألتموه \" .\nوقوله : ( وإن تعدوا نعمة الله لا تحصوها ) يخبر عن عجز العباد عن تعداد النعم فضلا عن القيام بشكرها ، كما قال طلق بن حبيب - رحمه الله - : إن حق الله أثقل من أن يقوم به العباد ، وإن نعم الله أكثر من أن يحصيها العباد ، ولكن أصبحوا توابين وأمسوا توابين .\nوفي صحيح البخاري : أن رسول الله - صلى الله عليه وسلم - كان يقول : \" اللهم ، لك الحمد غير مكفي ولا مودع ، ولا مستغنى عنه ربنا \" .\nوقال الحافظ أبو بكر البزار في مسنده : حدثنا إسماعيل بن أبي الحارث ، حدثنا داود بن المحبر ، حدثنا صالح المري عن جعفر بن زيد العبدي ، عن أنس ، عن النبي - صلى الله عليه وسلم - أنه قال : \" يخرج لابن آدم يوم القيامة ثلاثة دواوين ، ديوان فيه العمل الصالح ، وديوان فيه ذنوبه ، وديوان فيه النعم من الله تعالى عليه . فيقول الله لأصغر نعمه - أحسبه قال في ديوان النعم - خذي ثمنك من عمله الصالح ، فتستوعب عمله الصالح كله ، ثم تنحى وتقول : وعزتك ما استوفيت . وتبقى الذنوب والنعم فإذا أراد الله أن يرحم قال : يا عبدي ، قد ضاعفت لك حسناتك وتجاوزت عن سيئاتك - أحسبه قال : ووهبت لك نعمي - . غريب ، وسنده ضعيف .\nوقد روي في الأثر : أن داود - عليه السلام - قال : يا رب ، كيف أشكرك وشكري لك نعمة منك علي ؟ فقال الله تعالى : الآن شكرتني يا داود ، أي : حين اعترفت بالتقصير عن أداء شكر النعم .\nوقال الشافعي - رحمه الله - : الحمد لله الذي لا يؤدى شكر نعمة من نعمه ، إلا بنعمة توجب على مؤدي ماضي نعمه بأدائها نعمة حادثة توجب عليه شكره بها .\nوقال القائل في ذلك :\nلو كل جارحة مني لها لغة تثني عليك بما أوليت من حسن لكان ما زاد شكري إذ شكرت به\nإليك أبلغ في الإحسان والمنن\n                                    ",
        "qortoby": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّواْ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱلۡإِنسَٰنَ لَظَلُومٞ كَفَّارٞ ٤٣\n                                    \n                                    \n                                    قوله تعالى : وآتاكم من كل ما سألتموه أي أعطاكم من كل مسئول سألتموه شيئا ; فحذف ; عن الأخفش . وقيل : المعنى وآتاكم من كل ما سألتموه ، ومن كل ما لم تسألوه فحذف ، فلم نسأله شمسا ولا قمرا ولا كثيرا من نعمه التي ابتدأنا بها . وهذا كما قال : سرابيل تقيكم الحر على ما يأتي . وقيل : \" من \" زائدة ; أي آتاكم كل ما سألتموه . وقرأ ابن عباس والضحاك وغيرهما \" وآتاكم من كل \" بالتنوين \" ما سألتموه \" وقد رويت هذه القراءة عن الحسن والضحاك وقتادة ; هي على النفي أي من كل ما لم تسألوه ; كالشمس والقمر وغيرهما . وقيل : من كل شيء ما سألتموه أي الذي ما سألتموه .\nوإن تعدوا نعمة الله أي نعم الله . لا تحصوها ولا تطيقوا عدها ، ولا تقوموا بحصرها لكثرتها ، كالسمع والبصر وتقويم الصور إلى غير ذلك من العافية والرزق ; نعم لا تحصى وهذه النعم من الله ، فلم تبدلون نعمة الله بالكفر ؟ ! وهلا استعنتم بها على الطاعة ؟ !\nإن الإنسان لظلوم كفار الإنسان لفظ جنس وأراد به الخصوص ; قال ابن عباس : أراد أبا جهل . وقيل : جميع الكفار .\n                                    ",
        "saadi": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّواْ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱلۡإِنسَٰنَ لَظَلُومٞ كَفَّارٞ ٤٣\n                                        \n                                        \n                                        \n                                        { وَآتَاكُمْ مِنْ كُلِّ مَا سَأَلْتُمُوهُ } أي: أعطاكم من كل ما تعلقت به أمانيكم وحاجتكم مما تسألونه إياه بلسان الحال، أو بلسان المقال، من أنعام، وآلات، وصناعات وغير ذلك.\n{ وَإِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا } فضلا عن قيامكم بشكرها { إِنَّ الْإِنْسَانَ لَظَلُومٌ كَفَّارٌ } أي: هذه طبيعة الإنسان من حيث هو ظالم متجرئ على المعاصي مقصر في حقوق ربه كفَّار لنعم الله، لا يشكرها ولا يعترف بها إلا من هداه الله فشكر نعمه، وعرف حق ربه وقام به.\nففي هذه الآيات من أصناف نعم الله على العباد شيء عظيم، مجمل ومفصل يدعو الله به العباد إلى القيام بشكره، وذكره ويحثهم على ذلك، ويرغبهم في سؤاله ودعائه، آناء الليل والنهار، كما أن نعمه تتكرر عليهم في جميع الأوقات.\n                                    "
      },
      "originalText": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّواْ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱلۡإِنسَٰنَ لَظَلُومٞ كَفَّارٞ ٤٣"
    },
    {
      "number": 1785,
      "text": "وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 35,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 216,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ قَالَ إِبۡرَٰهِيمُ رَبِّ ٱجۡعَلۡ هَٰذَا ٱلۡبَلَدَ ءَامِنٗا وَٱجۡنُبۡنِي وَبَنِيَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ ٥٣\n                                    \n                                    \n                                    يذكر تعالى في هذا المقام محتجا على مشركي العرب ، بأن البلد الحرام مكة إنما وضعت أول ما وضعت على عبادة الله وحده لا شريك له ، وأن إبراهيم الذي كانت عامرة بسببه آهلة تبرأ ممن عبد غير الله ، وأنه دعا لمكة بالأمن فقال : ( رب اجعل هذا البلد آمنا ) وقد استجاب الله له ، فقال تعالى : ( أولم يروا أنا جعلنا حرما آمنا ويتخطف الناس من حولهم ) [ العنكبوت : 67 ] وقال تعالى : ( إن أول بيت وضع للناس للذي ببكة مباركا وهدى للعالمين فيه آيات بينات مقام إبراهيم ومن دخله كان آمنا ) [ آل عمران : 96 ، 97 ] وقال في هذه القصة : ( رب اجعل هذا البلد آمنا ) فعرفه ، كأنه دعا به بعد بنائها ; ولهذا قال : ( الحمد لله الذي وهب لي على الكبر إسماعيل وإسحاق ) [ إبراهيم : 39 ] ومعلوم أن إسماعيل أكبر من إسحاق بثلاث عشرة سنة ، فأما حين ذهب بإسماعيل وأمه وهو رضيع إلى مكان مكة ، فإنه دعا أيضا فقال : ( رب اجعل هذا بلدا آمنا ) [ البقرة : 126 ] كما ذكرناه هنالك في سورة البقرة مستقصى مطولا .\nوقال : ( واجنبني وبني أن نعبد الأصنام ) ينبغي لكل داع أن يدعو لنفسه ولوالديه ولذريته .\nثم ذكر أنه افتتن بالأصنام خلائق من الناس وأنه برئ ممن عبدها ، ورد أمرهم إلى الله ، إن شاء عذبهم وإن شاء غفر لهم كما قال عيسى - عليه السلام - : ( إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم ) [ المائدة : 118 ] وليس في هذا أكثر من الرد إلى مشيئة الله تعالى ، لا تجويز وقوع ذلك .\n                                    ",
        "qortoby": "وَإِذۡ قَالَ إِبۡرَٰهِيمُ رَبِّ ٱجۡعَلۡ هَٰذَا ٱلۡبَلَدَ ءَامِنٗا وَٱجۡنُبۡنِي وَبَنِيَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ ٥٣\n                                    \n                                    \n                                    قوله تعالى : وإذ قال إبراهيم رب اجعل هذا البلد آمنا واجنبني وبني أن نعبد الأصنام رب إنهن أضللن كثيرا من الناس فمن تبعني فإنه مني ومن عصاني فإنك غفور رحيم\nقوله تعالى : وإذ قال إبراهيم رب اجعل هذا البلد آمنا يعني مكة وقد مضى في \" البقرة \" .\nواجنبني وبني أن نعبد الأصنام أي اجعلني جانبا عن عبادتها ، وأراد بقوله : \" بني \" بنيه من صلبه وكانوا ثمانية ، فما عبد أحد منهم صنما . وقيل : هو دعاء لمن أراد الله أن يدعو له . وقرأ الجحدري وعيسى \" وأجنبني \" بقطع الألف والمعنى واحد ; يقال : جنبت ذلك الأمر ، وأجنبته وجنبته إياه فتجانبه واجتنبه أي تركه . وكان إبراهيم التيمي يقول في قصصه : من يأمن البلاء بعد الخليل حين يقول \" واجنبني وبني أن نعبد الأصنام \" كما عبدها أبي وقومي .\n                                    ",
        "saadi": "وَإِذۡ قَالَ إِبۡرَٰهِيمُ رَبِّ ٱجۡعَلۡ هَٰذَا ٱلۡبَلَدَ ءَامِنٗا وَٱجۡنُبۡنِي وَبَنِيَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ ٥٣\n                                        \n                                        \n                                        \n                                        أي: { و } اذكر إبراهيم عليه الصلاة والسلام في هذه الحالة الجميلة، إذ قَال: { رَبِّ اجْعَلْ هَذَا الْبَلَدَ } أي: الحرم { آمِنًا } فاستجاب الله دعاءه شرعا وقدرا، فحرمه الله في الشرع ويسر من أسباب حرمته قدرا ما هو معلوم، حتى إنه لم يرده ظالم بسوء إلا قصمه الله كما فعل بأصحاب الفيل وغيرهم.\nولما دعا له بالأمن دعا له ولبنيه بالأمن فقال: { وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ } أي: اجعلني وإياهم جانبا بعيدا عن عبادتها والإلمام بها، ثم ذكر الموجب لخوفه عليه وعلى بنيه بكثرة من افتتن وابتلي بعبادتها فقال:\n                                    "
      },
      "originalText": "وَإِذۡ قَالَ إِبۡرَٰهِيمُ رَبِّ ٱجۡعَلۡ هَٰذَا ٱلۡبَلَدَ ءَامِنٗا وَٱجۡنُبۡنِي وَبَنِيَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ ٥٣"
    },
    {
      "number": 1786,
      "text": "رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِنَ النَّاسِ ۖ فَمَنْ تَبِعَنِي فَإِنَّهُ مِنِّي ۖ وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 36,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 216,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبِّ إِنَّهُنَّ أَضۡلَلۡنَ كَثِيرٗا مِّنَ ٱلنَّاسِۖ فَمَن تَبِعَنِي فَإِنَّهُۥ مِنِّيۖ وَمَنۡ عَصَانِي فَإِنَّكَ غَفُورٞ رَّحِيمٞ ٦٣\n                                    \n                                    \n                                    قال عبد الله بن وهب : حدثنا عمرو بن الحارث ، أن بكر بن سوادة حدثه ، عن عبد الرحمن بن جبير عن عبد الله بن عمرو ، أن رسول الله - صلى الله عليه وسلم - تلا قول إبراهيم : ( رب إنهن أضللن كثيرا من الناس فمن تبعني فإنه مني ومن عصاني فإنك غفور رحيم ) وقول عيسى عليه السلام : ( إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم ) ورفع يديه [ ثم ] قال : \" اللهم أمتي ، اللهم أمتي ، اللهم أمتي \" وبكى . فقال الله : [ يا جبريل ] اذهب إلى محمد - وربك أعلم - وسله ما يبكيك ؟ فأتاه جبريل - عليه السلام - فسأله ، فأخبره رسول الله - صلى الله عليه وسلم - ما قال [ قال ] فقال الله : اذهب إلى محمد ، فقل له : إنا سنرضيك في أمتك ولا نسوءك .\n                                    ",
        "qortoby": "رَبِّ إِنَّهُنَّ أَضۡلَلۡنَ كَثِيرٗا مِّنَ ٱلنَّاسِۖ فَمَن تَبِعَنِي فَإِنَّهُۥ مِنِّيۖ وَمَنۡ عَصَانِي فَإِنَّكَ غَفُورٞ رَّحِيمٞ ٦٣\n                                    \n                                    \n                                    قوله تعالى : رب إنهن أضللن كثيرا من الناس لما كانت سببا للإضلال أضاف الفعل إليهن مجازا ; فإن الأصنام جمادات لا تفعل .\nفمن تبعني في التوحيد . \" فإنه مني \" أي من أهل ديني .\nومن عصاني أي أصر على الشرك . فإنك غفور رحيم قيل : قال هذا قبل أن يعرفه الله أن الله لا يغفر أن يشرك به . وقيل : غفور رحيم لمن تاب من معصيته قبل الموت . وقال مقاتل بن حيان : ومن عصاني فيما دون الشرك .\n                                    ",
        "saadi": "رَبِّ إِنَّهُنَّ أَضۡلَلۡنَ كَثِيرٗا مِّنَ ٱلنَّاسِۖ فَمَن تَبِعَنِي فَإِنَّهُۥ مِنِّيۖ وَمَنۡ عَصَانِي فَإِنَّكَ غَفُورٞ رَّحِيمٞ ٦٣\n                                        \n                                        \n                                        \n                                        أي: ضلوا بسببها، { فَمَنْ تَبِعَنِي } على ما جئت به من التوحيد والإخلاص لله رب العالمين { فَإِنَّهُ مِنِّي } لتمام الموافقة ومن أحب قوما وتبعهم التحق بهم.\n{ وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَحِيمٌ } وهذا من شفقة الخليل عليه الصلاة والسلام حيث دعا للعاصين بالمغفرة والرحمة من الله والله تبارك وتعالى أرحم منه بعباده لا يعذب إلا من تمرد عليه.\n                                    "
      },
      "originalText": "رَبِّ إِنَّهُنَّ أَضۡلَلۡنَ كَثِيرٗا مِّنَ ٱلنَّاسِۖ فَمَن تَبِعَنِي فَإِنَّهُۥ مِنِّيۖ وَمَنۡ عَصَانِي فَإِنَّكَ غَفُورٞ رَّحِيمٞ ٦٣"
    },
    {
      "number": 1787,
      "text": "رَبَّنَا إِنِّي أَسْكَنْتُ مِنْ ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِنْدَ بَيْتِكَ الْمُحَرَّمِ رَبَّنَا لِيُقِيمُوا الصَّلَاةَ فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَارْزُقْهُمْ مِنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 37,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 216,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡ‍ِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ ٧٣\n                                    \n                                    \n                                    وهذا يدل على أن هذا دعاء ثان بعد الدعاء الأول الذي دعا به عندما ولى عن هاجر وولدها - وذلك قبل بناء البيت ، وهذا كان بعد بنائه - تأكيدا ورغبة إلى الله - عز وجل - ; ولهذا قال : ( عند بيتك المحرم )\nوقوله : ( ربنا ليقيموا الصلاة ) قال ابن جرير : هو متعلق بقوله : \" المحرم \" أي : إنما جعلته محرما ليتمكن أهله من إقامة الصلاة عنده .\n( فاجعل أفئدة من الناس تهوي إليهم ) قال ابن عباس ، ومجاهد ، وسعيد بن جبير : لو قال : \" أفئدة الناس \" لازدحم عليه فارس والروم واليهود والنصارى والناس كلهم ، ولكن قال : ( من الناس ) فاختص به المسلمون .\nوقوله : ( وارزقهم من الثمرات ) أي : ليكون ذلك عونا لهم على طاعتك وكما أنه ( واد غير ذي زرع ) فاجعل لهم ثمارا يأكلونها . وقد استجاب الله ذلك ، كما قال : ( أولم نمكن لهم حرما آمنا يجبى إليه ثمرات كل شيء رزقا من لدنا ) [ القصص : 57 ] وهذا من لطفه تعالى وكرمه ورحمته وبركته أنه ليس في البلد الحرام مكة شجرة مثمرة ، وهي تجبى إليها ثمرات ما حولها ، استجابة لخليله إبراهيم - عليه الصلاة والسلام - .\n                                    ",
        "qortoby": "رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡ‍ِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ ٧٣\n                                    \n                                    \n                                    قوله تعالى : ربنا إني أسكنت من ذريتي بواد غير ذي زرع عند بيتك المحرم ربنا ليقيموا الصلاة فاجعل أفئدة من الناس تهوي إليهم وارزقهم من الثمرات لعلهم يشكرون\nفيه ست مسائل :\nالأولى : روى البخاري عن ابن عباس : ( أول ما اتخذ النساء المنطق من قبل أم إسماعيل ; اتخذت منطقا لتعفي أثرها على سارة ، ثم جاء بها إبراهيم وبابنها إسماعيل وهي ترضعه ، حتى وضعهما عند البيت عند دوحة فوق زمزم في أعلى المسجد ، وليس بمكة يومئذ أحد ، وليس بها ماء ، فوضعهما هنالك ; ووضع عندهما جرابا فيه تمر ، وسقاء فيه ماء ، ثم قفى إبراهيم منطلقا فتبعته أم إسماعيل ; فقالت : يا إبراهيم ! أين تذهب وتتركنا بهذا الوادي الذي ليس فيه إنس ولا شيء ، فقالت له ذلك مرارا وجعل لا يلتفت إليها ، فقالت له : آلله أمرك بهذا ؟ قال : نعم . قالت إذا لا يضيعنا ; ثم رجعت ، فانطلق إبراهيم . حتى إذا كان عند الثنية حيث لا يرونه ، استقبل بوجهه البيت ثم دعا بهذه الدعوات ، ورفع يديه فقال : ربنا إني أسكنت من ذريتي بواد غير ذي زرع حتى بلغ يشكرون وجعلت أم إسماعيل ترضع إسماعيل وتشرب من ذلك الماء ، حتى إذا نفد ما في السقاء عطشت وعطش ابنها ، وجعلت تنظر إليه يتلوى - أو قال يتلبط - فانطلقت كراهية أن تنظر إليه ، فوجدت الصفا أقرب جبل في الأرض يليها ، فقامت عليه ، ثم استقبلت الوادي تنظر هل ترى أحدا ، فلم تر أحدا ، فهبطت من الصفا ، حتى إذا بلغت الوادي ، رفعت طرف درعها ، ثم سعت سعي الإنسان المجهود ، ثم جاوزت الوادي ، ثم أتت المروة فقامت عليه ، فنظرت هل ترى أحدا فلم تر أحدا ، ففعلت ذلك سبع مرات ; قال ابن عباس قال النبي - صلى الله عليه وسلم - : فذلك سعي الناس بينهما فلما أشرفت على المروة سمعت صوتا فقالت : صه ! تريد نفسها ، ثم تسمعت فسمعت أيضا فقالت : قد أسمعت ، إن كان عندك غواث ! فإذا هي بالملك عند موضع زمزم فبحث بعقبه - أو قال بجناحه - حتى ظهر الماء ، فجعلت تحوضه وتقول بيدها هكذا ، وجعلت تغرف من الماء في سقائها وهو يفور بعد ما تغرف ; قال ابن عباس قال النبي - صلى الله عليه وسلم - : يرحم الله أم إسماعيل لو تركت زمزم - أو قال : لو لم تغرف من الماء - لكانت زمزم عينا معينا قال : فشربت وأرضعت ولدها فقال لها الملك : لا تخافي الضيعة فإن هاهنا بيت الله يبنيه هذا الغلام وأبوه ، وإن الله لا يضيع أهله ) وذكر الحديث بطوله .\nمسألة : لا يجوز لأحد أن يتعلق بهذا في طرح ولده وعياله بأرض مضيعة اتكالا على العزيز الرحيم ، واقتداء بفعل إبراهيم الخليل ، كما تقول غلاة الصوفية في حقيقة التوكل ، فإن إبراهيم فعل ذلك بأمر الله لقوله في الحديث : آلله أمرك بهذا ؟ قال : نعم . وقد روي أن سارة لما غارت من هاجر بعد أن ولدت إسماعيل خرج بها إبراهيم - عليه السلام - إلى مكة ، فروي أنه ركب البراق هو وهاجر والطفل فجاء في يوم واحد من الشام إلى بطن مكة ، وترك ابنه وأمته هنالك وركب منصرفا من يومه ، فكان ذلك كله بوحي من الله تعالى ، فلما ولى دعا بضمن هذه الآية .\nالثانية : لما أراد الله تأسيس الحال ، وتمهيد المقام ، وخط الموضع للبيت المكرم ، والبلد المحرم ، أرسل الملك فبحث عن الماء وأقامه مقام الغذاء ، وفي الصحيح : أن أبا ذر - رضي الله عنه - اجتزأ به ثلاثين بين يوم وليلة ، قال أبو ذر : ما كان لي طعام إلا ماء زمزم فسمنت حتى تكسرت عكني ، وما أجد على كبدي سخفة جوع ; وذكر الحديث . وروى الدارقطني عن ابن عباس قال : قال رسول الله - صلى الله عليه وسلم - : ماء زمزم لما شرب له إن شربته تشتفي به شفاك الله وإن شربته لشبعك أشبعك الله به وإن شربته لقطع ظمئك قطعه وهي هزمة جبريل وسقيا الله إسماعيل . وروي أيضا عن عكرمة قال : كان ابن عباس إذا شرب من زمزم قال : اللهم إني أسألك علما نافعا ، ورزقا واسعا ، وشفاء من كل داء . قال ابن العربي : وهذا موجود فيه إلى يوم القيامة لمن صحت نيته ، وسلمت طويته ، ولم يكن به مكذبا ، ولا يشربه مجربا ، فإن الله مع المتوكلين ، وهو يفضح المجربين . وقال أبو عبد الله محمد بن علي الترمذي وحدثني أبي - رحمه الله - قال : دخلت الطواف في ليلة ظلماء فأخذني من البول ما شغلني ، فجعلت أعتصر حتى آذاني ، وخفت إن خرجت من المسجد أن أطأ بعض تلك الأقدام ، وذلك أيام الحج ; فذكرت هذا الحديث ، فدخلت زمزم فتضلعت منه ، فذهب عني إلى الصباح . وروي عن عبد الله بن عمرو : إن في زمزم عينا في الجنة من قبل الركن .\nالثالثة : قوله تعالى : ومن ذريتي \" من \" في قوله تعالى : من ذريتي للتبعيض أي أسكنت بعض ذريتي ; يعني إسماعيل وأمه ; لأن إسحاق كان بالشام . وقيل : هي صلة ; أي أسكنت ذريتي .\nالرابعة : قوله تعالى : عند بيتك المحرم يدل على أن البيت كان قديما على ما روي قبل الطوفان ، وقد مضى هذا المعنى في سورة \" البقرة \" . وأضاف البيت إليه لأنه لا يملكه غيره ، ووصفه بأنه محرم ، أي يحرم فيه ما يستباح في غيره من جماع واستحلال . وقيل : محرم على الجبابرة ، وأن تنتهك حرمته ، ويستخف بحقه ، قاله قتادة وغيره . وقد مضى القول في هذا في \" المائدة \" .\nالخامسة : قوله تعالى : ربنا ليقيموا الصلاة خصها من جملة الدين لفضلها فيه ، ومكانها منه ، وهي عهد الله عند العباد ; قال - صلى الله عليه وسلم - : خمس صلوات كتبهن الله على العباد . الحديث . واللام في ليقيموا الصلاة لام كي ; هذا هو الظاهر فيها وتكون متعلقة ب \" أسكنت \" ويصح أن تكون لام أمر ، كأنه رغب إلى الله أن يأتمنهم وأن يوفقهم لإقامة الصلاة .\nالسادسة : تضمنت هذه الآية أن الصلاة بمكة أفضل من الصلاة بغيرها ; لأن معنى ربنا ليقيموا الصلاة أي أسكنتهم عند بيتك المحرم ليقيموا الصلاة فيه . وقد اختلف العلماء هل الصلاة بمكة أفضل أو في مسجد النبي - صلى الله عليه وسلم - ؟ فذهب عامة أهل الأثر إلى أن الصلاة في المسجد الحرام أفضل من الصلاة في مسجد الرسول - صلى الله عليه وسلم - بمائة صلاة ، واحتجوا بحديث عبد الله بن الزبير قال : قال رسول الله - صلى الله عليه وسلم - : صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه من المساجد إلا المسجد الحرام وصلاة في المسجد الحرام أفضل من صلاة في مسجدي هذا بمائة صلاة \" . قال الإمام الحافظ أبو عمر : وأسند هذا الحديث حبيب المعلم عن عطاء بن أبي رباح عن عبد الله بن الزبير وجوده ، ولم يخلط في لفظه ولا في معناه ، وكان ثقة . قال ابن أبي خيثمة سمعت يحيى بن معين يقول : حبيب المعلم ثقة . وذكر عبد الله بن أحمد قال سمعت أبي يقول : حبيب المعلم ثقة ما أصح حديثه ! وسئل أبو زرعة الرازي عن حبيب المعلم فقال : بصري ثقة . قلت : وقد خرج حديث حبيب المعلم هذا عن عطاء بن أبي رباح عن عبد الله بن الزبير عن النبي - صلى الله عليه وسلم - الحافظ أبو حاتم محمد بن حاتم التميمي البستي في المسند الصحيح له ، فالحديث صحيح وهو الحجة عند التنازع والاختلاف . والحمد لله . قال أبو عمر : وقد روي عن ابن عمر عن النبي - صلى الله عليه وسلم - مثل حديث ابن الزبير ; رواه موسى الجهني عن نافع عن ابن عمرو ; وموسى الجهني الكوفي ثقة ، أثنى عليه القطان وأحمد ويحيى وجماعتهم . وروى عنه شعبة . والثوري ويحيى بن سعيد . وروى حكيم بن سيف ، حدثنا عبيد الله بن عمر ; عن عبد الكريم عن عطاء بن أبي رباح ، عن جابر بن عبد الله قال : قال رسول الله - صلى الله عليه وسلم - : صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه إلا المسجد الحرام وصلاة في المسجد الحرام أفضل من مائة ألف فيمن سواه . وحكيم بن سيف هذا شيخ من أهل الرقة قد روى عنه أبو زرعة الرازي ، وأخذ عنه ابن وضاح ، وهو عندهم شيخ صدوق لا بأس به . فإن كان حفظ فهما حديثان ، وإلا فالقول قول حبيب المعلم . وروى محمد بن وضاح ، حدثنا يوسف بن عدي عن عمر بن عبيد عن عبد الملك عن عطاء عن ابن عمر قال : قال رسول الله - صلى الله عليه وسلم - : صلاة في مسجدي هذا أفضل من ألف صلاة في غيره من المساجد إلا المسجد الحرام فإن الصلاة فيه أفضل . قال أبو عمر : وهذا كله نص في موضع الخلاف قاطع له عند من ألهم رشده ، ولم تمل به عصبيته . وذكر ابن حبيب عن مطرف وعن أصبغ عن ابن وهب أنهما كانا يذهبان إلى تفضيل الصلاة في المسجد الحرام على الصلاة في مسجد النبي - صلى الله عليه وسلم - على ما في هذا الباب . وقد اتفق مالك وسائر العلماء على أن صلاة العيدين يبرز لهما في كل بلد إلا مكة فإنها تصلى في المسجد الحرام . وكان عمر وعلي وابن مسعود وأبو الدرداء وجابر يفضلون مكة ومسجدها وهم أولى بالتقليد ممن بعدهم ; وإلى هذا ذهب الشافعي . وهو قول عطاء والمكيين والكوفيين ، وروي مثله عن مالك ; ذكر ابن وهب في جامعه عن مالك أن آدم - عليه السلام - لما أهبط إلى الأرض قال : يا رب هذه أحب إليك أن تعبد فيها ؟ قال : بل مكة . والمشهور عنه وعن أهل المدينة تفضيل المدينة ، واختلف أهل البصرة والبغداديون في ذلك ; فطائفة تقول مكة ، وطائفة تقول المدينة .\nقوله تعالى : فاجعل أفئدة من الناس تهوي إليهم الأفئدة جمع فؤاد وهي القلوب ، وقد يعبر عن القلب بالفؤاد كما قال الشاعر :\nوإن فؤادا قادني بصبابة إليك على طول المدى لصبور\nوقيل : جمع وفد ، والأصل أوفدة ، فقدمت الفاء وقلبت الواو ياء كما هي ، فكأنه قال : واجعل وفودا من الناس تهوي إليهم ; أي تنزع ; يقال : هوي نحوه إذا مال ، وهوت الناقة تهوي هويا فهي هاوية إذا عدت عدوا شديدا كأنها في هواء بئر ، وقوله : تهوي إليهم مأخوذ منه . قال ابن عباس ومجاهد : لو قال أفئدة الناس لازدحمت عليه فارس والروم والترك والهند واليهود والنصارى والمجوس ، ولكن قال : من الناس فهم المسلمون ; فقوله : تهوي إليهم أي تحن إليهم ، وتحن إلى زيارة البيت . وقرأ مجاهد \" تهوى إليهم \" أي تهواهم وتجلهم .\nوارزقهم من الثمرات لعلهم يشكرون فاستجاب الله دعاءه ، وأنبت لهم بالطائف سائر الأشجار ، وبما يجلب إليهم من الأمصار . وفي صحيح البخاري عن ابن عباس الحديث الطويل وقد ذكرنا بعضه : ( فجاء إبراهيم بعد ما تزوج إسماعيل يطالع تركته فلم يجد إسماعيل ، فسأل امرأته عنه فقالت : خرج يبتغي لنا ، ثم سألهم عن عيشهم وهيئتهم فقالت : نحن بشر ، نحن في ضيق وشدة ; فشكت إليه ، قال : فإذا جاء زوجك فاقرئي عليه السلام وقولي له يغير عتبة بابه ، فلما جاء إسماعيل كأنه آنس شيئا فقال : هل جاءكم من أحد ! قالت : نعم جاءنا شيخ كذا وكذا فسألني عنك فأخبرته ، وسألني كيف عيشتنا فأخبرته أنا في جهد وشدة ، قال فهل أوصاك بشيء : قالت : أمرني أن أقرأ عليك السلام ، ويقول : غير عتبة بابك ; قال : ذاك أبي وقد أمرني أن أفارقك ، الحقي بأهلك ; فطلقها وتزوج منهم أخرى ، فلبث عنهمإبراهيم ما شاء الله ثم أتاهم بعد فلم يجده ، ودخل على امرأته فسألها عنه فقالت : خرج يبتغي لنا . قال : كيف أنتم ؟ وسألها عن عيشهم وهيئتهم فقالت : نحن بخير وسعة وأثنت على الله . قال ما طعامكم ؟ قالت : اللحم . قال فما شرابكم ؟ قالت : الماء . قال : اللهم بارك لهم في اللحم والماء . قال النبي - صلى الله عليه وسلم - : ولم يكن لهم يومئذ حب ولو كان لهم دعا لهم فيه . قال : فهما لا يخلو عليهما أحد بغير مكة إلا لم يوافقاه ; وذكر الحديث . وقال ابن عباس : قول إبراهيم فاجعل أفئدة من الناس تهوي إليهم سأل أن يجعل الله الناس يهوون السكنى بمكة ، فيصير بيتا محرما ، وكل ذلك كان والحمد لله . وأول من سكنه جرهم . ففي البخاري - بعد قوله : وإن الله لا يضيع أهله - وكان البيت مرتفعا من الأرض كالرابية تأتيه السيول فتأخذ عن يمينه وعن شماله ، وكذلك حتى مرت بهم رفقة من جرهم قافلين من طريق كذا ، فنزلوا بأسفل مكة ، فرأوا طائرا عائفا فقالوا : إن هذا الطائر ليدور على ماء ! لعهدنا بهذا الوادي وما فيه ماء ; فأرسلوا جريا أو جريين فإذا هم بالماء ، فأخبروهم بالماء فأقبلوا . قال : وأم إسماعيل عند الماء ; فقالوا : أتأذنين لنا أن ننزل عندك ؟ قالت : نعم ولكن لا حق لكم في الماء . قالوا : نعم . قال ابن عباس قال النبي - صلى الله عليه وسلم - : فألفى ذلك أم إسماعيل وهي تحب الأنس فنزلوا وأرسلوا إلى أهلهم فنزلوا معهم حتى إذا كان بها أهل أبيات منهم ، شب الغلام ، وماتت أم إسماعيل ، فجاء إبراهيم بعد ما تزوج إسماعيل يطالع تركته ; الحديث .\n                                    ",
        "saadi": "رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡ‍ِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ ٧٣\n                                        \n                                        \n                                        \n                                        وذلك أنه أتى بـ \"هاجر\" أم إسماعيل وبابنها إسماعيل عليه الصلاة والسلام وهو في الرضاع، من الشام حتى وضعهما في مكة وهي -إذ ذاك- ليس فيها سكن، ولا داع ولا مجيب، فلما وضعهما دعا ربه بهذا الدعاء فقال -متضرعا متوكلا على ربه: { رَبَّنَا إِنِّي أَسْكَنْتُ مِنْ ذُرِّيَّتِي } أي: لا كل ذريتي لأن إسحاق في الشام وباقي بنيه كذلك وإنما أسكن في مكة إسماعيل وذريته، وقوله: { بِوَادٍ غَيْرِ ذِي زَرْعٍ } أي: لأن أرض مكة لا تصلح للزراعة.\n{ رَبَّنَا لِيُقِيمُوا الصَّلَاة } أي: اجعلهم موحدين مقيمين الصلاة لأن إقامة الصلاة من أخص وأفضل العبادات الدينية فمن أقامها كان مقيما لدينه، { فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ } أي: تحبهم وتحب الموضع الذي هم ساكنون فيه.\nفأجاب الله دعاءه فأخرج من ذرية إسماعيل محمدا صلى الله عليه وسلم حتى دعا ذريته إلى الدين الإسلامي وإلى ملة أبيهم إبراهيم فاستجابوا له وصاروا مقيمي الصلاة.\nوافترض الله حج هذا البيت الذي أسكن به ذرية إبراهيم وجعل فيه سرا عجيبا جاذبا للقلوب، فهي تحجه ولا تقضي منه وطرا على الدوام، بل كلما أكثر العبد التردد إليه ازداد شوقه وعظم ولعه وتوقه، وهذا سر إضافته تعالى إلى نفسه المقدسة.\n{ وَارْزُقْهُمْ مِنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ } فأجاب الله دعاءه، فصار يجبي إليه ثمرات كل شيء، فإنك ترى مكة المشرفة كل وقت والثمار فيها متوفرة والأرزاق تتوالى إليها من كل جانب.\n                                    "
      },
      "originalText": "رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡ‍ِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ ٧٣"
    },
    {
      "number": 1788,
      "text": "رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ ۗ وَمَا يَخْفَىٰ عَلَى اللَّهِ مِنْ شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 38,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 216,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَآ إِنَّكَ تَعۡلَمُ مَا نُخۡفِي وَمَا نُعۡلِنُۗ وَمَا يَخۡفَىٰ عَلَى ٱللَّهِ مِن شَيۡءٖ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ ٨٣\n                                    \n                                    \n                                    قال ابن جرير : يقول تعالى مخبرا عن إبراهيم خليله أنه قال : ( ربنا إنك تعلم ما نخفي وما نعلن ) أي : أنت تعلم قصدي في دعائي وما أردت بدعائي لأهل هذا البلد ، وإنما هو القصد إلى رضاك والإخلاص لك ، فإنك تعلم الأشياء كلها ظاهرها وباطنها ، ولا يخفى عليك منها شيء في الأرض ولا في السماء .\n                                    ",
        "qortoby": "رَبَّنَآ إِنَّكَ تَعۡلَمُ مَا نُخۡفِي وَمَا نُعۡلِنُۗ وَمَا يَخۡفَىٰ عَلَى ٱللَّهِ مِن شَيۡءٖ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ ٨٣\n                                    \n                                    \n                                    قوله تعالى : ربنا إنك تعلم ما نخفي وما نعلن أي ، ليس يخفى عليك شيء من أحوالنا . وقال ابن عباس ومقاتل : تعلم جميع ما أخفيه وما أعلنه من الوجد بإسماعيل وأمه حيث أسكنا بواد غير ذي زرع . \" وما يخفى على الله من شيء في الأرض ولا في السماء \" قيل : هو من قول إبراهيم . وقيل : هو من قول الله تعالى لما قال إبراهيم : ربنا إنك تعلم ما نخفي وما نعلن قال الله : وما يخفى على الله من شيء في الأرض ولا في السماء .\n                                    ",
        "saadi": "رَبَّنَآ إِنَّكَ تَعۡلَمُ مَا نُخۡفِي وَمَا نُعۡلِنُۗ وَمَا يَخۡفَىٰ عَلَى ٱللَّهِ مِن شَيۡءٖ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ ٨٣\n                                        \n                                        \n                                        \n                                        أي: أنت أعلم بنا منا، فنسألك من تدبيرك وتربيتك لنا أن تيسر لنا من الأمور التي نعلمها والتي لا نعلمها ما هو مقتضى علمك ورحمتك، { وَمَا يَخْفَى عَلَى اللَّهِ مِنْ شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ } ومن ذلك هذا الدعاء الذي لم يقصد به الخليل إلا الخير وكثرة الشكر لله رب العالمين.\n                                    "
      },
      "originalText": "رَبَّنَآ إِنَّكَ تَعۡلَمُ مَا نُخۡفِي وَمَا نُعۡلِنُۗ وَمَا يَخۡفَىٰ عَلَى ٱللَّهِ مِن شَيۡءٖ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ ٨٣"
    },
    {
      "number": 1789,
      "text": "الْحَمْدُ لِلَّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَاقَ ۚ إِنَّ رَبِّي لَسَمِيعُ الدُّعَاءِ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 39,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 216,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي وَهَبَ لِي عَلَى ٱلۡكِبَرِ إِسۡمَٰعِيلَ وَإِسۡحَٰقَۚ إِنَّ رَبِّي لَسَمِيعُ ٱلدُّعَآءِ ٩٣\n                                    \n                                    \n                                    ثم حمد ربه - عز وجل - على ما رزقه من الولد بعد الكبر ، فقال : ( الحمد لله الذي وهب لي على الكبر إسماعيل وإسحاق إن ربي لسميع الدعاء ) أي : إنه ليستجيب لمن دعاه ، وقد استجاب لي فيما سألته من الولد .\n                                    ",
        "qortoby": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي وَهَبَ لِي عَلَى ٱلۡكِبَرِ إِسۡمَٰعِيلَ وَإِسۡحَٰقَۚ إِنَّ رَبِّي لَسَمِيعُ ٱلدُّعَآءِ ٩٣\n                                    \n                                    \n                                    الحمد لله الذي وهب لي على الكبر أي على كبر سني وسن امرأتي ; قال ابن عباس : ولد له إسماعيل وهو ابن تسع وتسعين سنة . وإسحاق وهو ابن مائة واثنتي عشرة سنة . وقال سعيد بن جبير : بشر إبراهيم بإسحاق بعد عشر ومائة سنة . إن ربي لسميع الدعاء .\n                                    ",
        "saadi": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي وَهَبَ لِي عَلَى ٱلۡكِبَرِ إِسۡمَٰعِيلَ وَإِسۡحَٰقَۚ إِنَّ رَبِّي لَسَمِيعُ ٱلدُّعَآءِ ٩٣\n                                        \n                                        \n                                        \n                                        فهبتهم من أكبر النعم، وكونهم على الكبر في حال الإياس من الأولاد نعمة أخرى، وكونهم أنبياء صالحين أجل وأفضل، { إِنَّ رَبِّي لَسَمِيعُ الدُّعَاءِ } أي: لقريب الإجابة ممن دعاه وقد دعوته فلم يخيب رجائي،\n                                    "
      },
      "originalText": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي وَهَبَ لِي عَلَى ٱلۡكِبَرِ إِسۡمَٰعِيلَ وَإِسۡحَٰقَۚ إِنَّ رَبِّي لَسَمِيعُ ٱلدُّعَآءِ ٩٣"
    },
    {
      "number": 1790,
      "text": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 40,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 216,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبِّ ٱجۡعَلۡنِي مُقِيمَ ٱلصَّلَوٰةِ وَمِن ذُرِّيَّتِيۚ رَبَّنَا وَتَقَبَّلۡ دُعَآءِ ٠٤\n                                    \n                                    \n                                    ثم قال : ( رب اجعلني مقيم الصلاة ) أي : محافظا عليها مقيما لحدودها ( ومن ذريتي ) أي : واجعلهم كذلك مقيمين الصلاة ( ربنا وتقبل دعاء ) أي : فيما سألتك فيه كله .\n\n                                    ",
        "qortoby": "رَبِّ ٱجۡعَلۡنِي مُقِيمَ ٱلصَّلَوٰةِ وَمِن ذُرِّيَّتِيۚ رَبَّنَا وَتَقَبَّلۡ دُعَآءِ ٠٤\n                                    \n                                    \n                                    رب اجعلني مقيم الصلاة أي من الثابتين على الإسلام والتزام أحكامه .\nومن ذريتي أي واجعل من ذريتي من يقيمها .\nربنا وتقبل دعاء أي عبادتي كما قال : وقال ربكم ادعوني أستجب لكم . وقال - عليه السلام - : الدعاء مخ العبادة وقد تقدم في \" البقرة \"\n                                    ",
        "saadi": "رَبِّ ٱجۡعَلۡنِي مُقِيمَ ٱلصَّلَوٰةِ وَمِن ذُرِّيَّتِيۚ رَبَّنَا وَتَقَبَّلۡ دُعَآءِ ٠٤\n                                        \n                                        \n                                        \n                                        ثم دعا لنفسه ولذريته، فقال: رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ\n                                    "
      },
      "originalText": "رَبِّ ٱجۡعَلۡنِي مُقِيمَ ٱلصَّلَوٰةِ وَمِن ذُرِّيَّتِيۚ رَبَّنَا وَتَقَبَّلۡ دُعَآءِ ٠٤"
    },
    {
      "number": 1791,
      "text": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 41,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 216,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَا ٱغۡفِرۡ لِي وَلِوَٰلِدَيَّ وَلِلۡمُؤۡمِنِينَ يَوۡمَ يَقُومُ ٱلۡحِسَابُ ١٤\n                                    \n                                    \n                                    ( ربنا اغفر لي ولوالدي ) وقرأ بعضهم : \" ولوالدي \" على الإفراد وكان هذا قبل أن يتبرأ من أبيه لما تبين له عداوته لله - عز وجل - ( وللمؤمنين ) أي : كلهم ( يوم يقوم الحساب ) أي : يوم تحاسب عبادك فتجزيهم بأعمالهم ، إن خيرا فخير ، وإن شرا فشر ، [ والله أعلم ] .\n                                    ",
        "qortoby": "رَبَّنَا ٱغۡفِرۡ لِي وَلِوَٰلِدَيَّ وَلِلۡمُؤۡمِنِينَ يَوۡمَ يَقُومُ ٱلۡحِسَابُ ١٤\n                                    \n                                    \n                                    ربنا اغفر لي ولوالدي وللمؤمنين قيل : استغفر إبراهيم لوالديه قبل أن يثبت عنده أنهما عدوان لله . قال القشيري : ولا يبعد أن تكون أمه مسلمة لأن الله ذكر عذره في استغفاره لأبيه دون أمه . قلت : وعلى هذا قراءة سعيد بن جبير ، رب اغفر لي ولوالدي يعني . أباه . وقيل : استغفر لهما طمعا في إيمانهما . وقيل : استغفر لهما بشرط أن يسلما . وقيل : أراد آدم وحواء . وقد روي أن العبد إذا قال : اللهم اغفر لي ولوالدي وكان أبواه قد ماتا كافرين انصرفت المغفرة إلى آدم وحواء لأنهما والدا الخلق أجمع . وقيل : إنه أراد ولديه إسماعيل وإسحاق . وكان إبراهيم النخعي يقرأ : \" ولولدي \" يعني ابنيه ، وكذلك قرأ يحيى بن يعمر ذكره الماوردي والنحاس وللمؤمنين قال ابن عباس : من أمة محمد - صلى الله عليه وسلم - . وقيل : للمؤمنين كلهم وهو أظهر .\nيوم يقوم الحساب أي يوم يقوم الناس للحساب .\n                                    ",
        "saadi": "رَبَّنَا ٱغۡفِرۡ لِي وَلِوَٰلِدَيَّ وَلِلۡمُؤۡمِنِينَ يَوۡمَ يَقُومُ ٱلۡحِسَابُ ١٤\n                                        \n                                        \n                                        \n                                        رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ فاستجاب الله له في ذلك كله إلا أن دعاءه لأبيه إنما كان عن موعدة وعده إياه فلما تبين له أنه عدو لله تبرأ منه\n                                    "
      },
      "originalText": "رَبَّنَا ٱغۡفِرۡ لِي وَلِوَٰلِدَيَّ وَلِلۡمُؤۡمِنِينَ يَوۡمَ يَقُومُ ٱلۡحِسَابُ ١٤ "
    },
    {
      "number": 1792,
      "text": "وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ ۚ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ",
      "surah": {
        "number": 14,
        "name": "سورة ابراهيم",
        "englishName": "Ibrahim",
        "englishNameTranslation": "Abraham",
        "revelationType": "Meccan",
        "numberOfAyahs": 52
      },
      "numberInSurah": 42,
      "juz": 13,
      "manzil": 3,
      "page": 260,
      "ruku": 217,
      "hizbQuarter": 104,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَحۡسَبَنَّ ٱللَّهَ غَٰفِلًا عَمَّا يَعۡمَلُ ٱلظَّٰلِمُونَۚ إِنَّمَا يُؤَخِّرُهُمۡ لِيَوۡمٖ تَشۡخَصُ فِيهِ ٱلۡأَبۡصَٰرُ ٢٤\n                                    \n                                    \n                                    يقول [ تعالى شأنه ] ( ولا تحسبن الله ) يا محمد ( غافلا عما يعمل الظالمون ) أي : لا تحسبه إذ أنظرهم وأجلهم أنه غافل عنهم مهمل لهم ، لا يعاقبهم على صنعهم بل هو يحصي ذلك عليهم ويعده عدا أي : ( إنما يؤخرهم ليوم تشخص فيه الأبصار ) أي : من شدة الأهوال يوم القيامة .\n                                    ",
        "qortoby": "وَلَا تَحۡسَبَنَّ ٱللَّهَ غَٰفِلًا عَمَّا يَعۡمَلُ ٱلظَّٰلِمُونَۚ إِنَّمَا يُؤَخِّرُهُمۡ لِيَوۡمٖ تَشۡخَصُ فِيهِ ٱلۡأَبۡصَٰرُ ٢٤\n                                    \n                                    \n                                    قوله تعالى : ولا تحسبن الله غافلا عما يعمل الظالمون إنما يؤخرهم ليوم تشخص فيه الأبصار\nقوله تعالى : ولا تحسبن الله غافلا عما يعمل الظالمون وهذا تسلية للنبي - صلى الله عليه وسلم - بعد أن أعجبه من أفعال المشركين ومخالفتهم دين إبراهيم ; أي اصبر كما صبر إبراهيم ، وأعلم المشركين أن تأخير العذاب ليس للرضا بأفعالهم ، بل سنة الله إمهال العصاة مدة . قال ميمون بن مهران : هذا وعيد للظالم ، وتعزية للمظلوم .\nإنما يؤخرهم يعني مشركي مكة يمهلهم ويؤخر عذابهم . وقراءة العامة \" يؤخرهم \" بالياء واختاره أبو عبيد وأبو حاتم لقوله ولا تحسبن الله . وقرأ الحسن والسلمي وروي عن أبي عمرو أيضا \" نؤخرهم \" بالنون للتعظيم .\nليوم تشخص فيه الأبصار أي لا تغمض من هول ما تراه في ذلك اليوم ، قاله الفراء . يقال : شخص الرجل بصره وشخص البصر نفسه أي سما وطمح من هول ما يرى . قال ابن عباس : تشخص أبصار الخلائق يومئذ إلى الهواء لشدة الحيرة فلا يرمضون .\n                                    ",
        "saadi": "وَلَا تَحۡسَبَنَّ ٱللَّهَ غَٰفِلًا عَمَّا يَعۡمَلُ ٱلظَّٰلِمُونَۚ إِنَّمَا يُؤَخِّرُهُمۡ لِيَوۡمٖ تَشۡخَصُ فِيهِ ٱلۡأَبۡصَٰرُ ٢٤\n                                        \n                                        \n                                        \n                                        هذا وعيد شديد للظالمين، وتسلية للمظلومين، يقول تعالى: { وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ } حيث أمهلهم وأدرَّ عليهم الأرزاق، وتركهم يتقلبون في البلاد آمنين مطمئنين، فليس في هذا ما يدل على حسن حالهم فإن الله يملي للظالم ويمهله ليزداد إثما، حتى إذا أخذه لم يفلته { وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد } والظلم -هاهنا- يشمل الظلم فيما بين العبد وربه وظلمه لعباد الله. { إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ } أي: لا تطرف من شدة ما ترى من الأهوال وما أزعجها من القلاقل.\n                                    "
      },
      "originalText": "وَلَا تَحۡسَبَنَّ ٱللَّهَ غَٰفِلًا عَمَّا يَعۡمَلُ ٱلظَّٰلِمُونَۚ إِنَّمَا يُؤَخِّرُهُمۡ لِيَوۡمٖ تَشۡخَصُ فِيهِ ٱلۡأَبۡصَٰرُ ٢٤"
    }
  ]
}