{
  "number": 262,
  "ayahsNumber": 15,
  "ayahs": [
    {
      "number": 1803,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الر ۚ تِلْكَ آيَاتُ الْكِتَابِ وَقُرْآنٍ مُبِينٍ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 1,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ ١\n                                    \n                                    \n                                    قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه.\nوحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شئ حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\n                                    ",
        "qortoby": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ ١\n                                    \n                                    \n                                    الر\nسورة الحجر : مكية إلا آية 87 فمدنية وآياتها 99 نزلت بعد يوسف قال النحاس : قرئ على أبي جعفر أحمد بن شعيب بن علي بن الحسين بن حريث قال : أخبرنا علي بن الحسن عن أبيه عن يزيد أن عكرمة حدثه عن ابن عباس : الر , حم ونون حروف الرحمن مفرقة ; فحدثت به الأعمش فقال : عندك أشباه هذا ولا تخبرني به ؟ .\nوعن ابن عباس أيضا قال : \" الر \" أنا الله أرى .\nقال النحاس : ورأيت أبا إسحاق يميل إلى هذا القول ; لأن سيبويه قد حكى مثله عن العرب وأنشد : بالخير خيرات وإن شرا فا ولا أريد الشر إلا أن تا وقال الحسن وعكرمة : \" الر \" قسم .\nوقال سعيد عن قتادة : \" الر \" اسم السورة ; قال : وكذلك كل هجاء في القرآن .\nوقال مجاهد : هي فواتح السور .\nوقال محمد بن يزيد : هي تنبيه , وكذا حروف التهجي .\nوقرئ \" الر \" من غير إمالة .\nوقرئ بالإمالة لئلا تشبه ما ولا من الحروف .الْكِتَابِ\nقيل فيه : إنه اسم لجنس الكتب المتقدمة من التوراة والإنجيل , ثم قرنهما بالكتاب المبين .\nوقيل : الكتاب هو القرآن , جمع له بين الاسمين .\n                                    ",
        "saadi": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ ١\n                                        \n                                        \n                                        \n                                        يقول تعالى معظما لكتابه مادحا له { تِلْكَ آيَاتُ الْكِتَابِ } أي: الآيات الدالة على أحسن المعاني وأفضل المطالب، { وَقُرْآنٍ مُبِينٍ } للحقائق بأحسن لفظ وأوضحه وأدله على المقصود، وهذا مما يوجب على الخلق الانقياد إليه، والتسليم لحكمه وتلقيه بالقبول والفرح والسرور.\n                                    "
      },
      "originalText": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ ١"
    },
    {
      "number": 1804,
      "text": "رُبَمَا يَوَدُّ الَّذِينَ كَفَرُوا لَوْ كَانُوا مُسْلِمِينَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 2,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ ٢\n                                    \n                                    \n                                    وقوله : ( ربما يود الذين كفروا لو كانوا مسلمين ) إخبار عنهم أنهم سيندمون على ما كانوا فيه من الكفر ، ويتمنون لو كانوا مع المسلمين في الدار الدنيا .\nونقل السدي في تفسيره بسنده المشهور عن ابن عباس ، وابن مسعود ، وغيرهما من الصحابة : أن الكفار لما عرضوا على النار ، تمنوا أن لو كانوا مسلمين .\nوقيل : المراد أن كل كافر يود عند احتضاره أن لو كان مؤمنا .\nوقيل : هذا إخبار عن يوم القيامة ، كما في قوله تعالى : ( ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين ) [ الأنعام : 27 ]\nوقال سفيان الثوري : عن سلمة بن كهيل ، عن أبي الزعراء ، عن عبد الله في قوله : ( ربما يود الذين كفروا لو كانوا مسلمين ) قال : هذا في الجهنميين إذ رأوهم يخرجون من النار .\nوقال ابن جرير : حدثنا المثنى ، حدثنا مسلم ، حدثنا القاسم ، حدثنا ابن أبي فروة العبدي أن ابن عباس وأنس بن مالك كانا يتأولان هذه الآية : ( ربما يود الذين كفروا لو كانوا مسلمين ) يتأولانها : يوم يحبس الله أهل الخطايا من المسلمين مع المشركين في النار . قال : فيقول لهم المشركون : ما أغنى عنكم ما كنتم تعبدون في الدنيا . قال : فيغضب الله لهم بفضل رحمته ، فيخرجهم ، فذلك حين يقول : ( ربما يود الذين كفروا لو كانوا مسلمين )\nوقال عبد الرزاق : أخبرنا الثوري ، عن حماد ، عن إبراهيم ، عن خصيف ، عن مجاهد قالا : يقول أهل النار للموحدين : ما أغنى عنكم إيمانكم ؟ فإذا قالوا ذلك ، قال : أخرجوا من كان في قلبه مثقال ذرة ، قال : فعند ذلك قوله : ( [ ربما ] يود الذين كفروا لو كانوا مسلمين )\nوهكذا روي عن الضحاك ، وقتادة ، وأبي العالية ، وغيرهم . وقد ورد في ذلك أحاديث مرفوعة ، فقال الحافظ أبو القاسم الطبراني .\nحدثنا محمد بن العباس هو الأخرم ، حدثنا محمد بن منصور الطوسي ، حدثنا صالح بن إسحاق الجهبذ - دلني عليه يحيى بن معين - حدثنا معرف بن واصل ، عن يعقوب بن أبي نباتة عن عبد الرحمن الأغر ، عن أنس بن مالك - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" إن ناسا من أهل لا إله إلا الله يدخلون النار بذنوبهم ، فيقول لهم أهل اللات والعزى : ما أغنى عنكم قولكم : لا إله إلا الله وأنتم معنا في النار ، فيغضب الله لهم ، فيخرجهم ، فيلقيهم في نهر الحياة ، فيبرءون من حرقهم كما يبرأ القمر من خسوفه ، فيدخلون الجنة ، ويسمون فيها الجهنميين \" فقال رجل : يا أنس ، أنت سمعت هذا من رسول الله - صلى الله عليه وسلم - ؟ فقال أنس : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" من كذب علي متعمدا فليتبوأ مقعده من النار \" . نعم ، أنا سمعت رسول الله - صلى الله عليه وسلم - يقول هذا .\nثم قال الطبراني : تفرد به الجهبذ\nالحديث الثاني : وقال الطبراني أيضا : حدثنا عبد الله بن أحمد بن حنبل ، حدثنا أبو الشعثاء علي بن حسن الواسطي ، حدثنا خالد بن نافع الأشعري ، عن سعيد بن أبي بردة ، عن أبيه ، عن أبي موسى - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" إذا اجتمع أهل النار في النار ، ومعهم من شاء الله من أهل القبلة ، قال الكفار للمسلمين : ألم تكونوا مسلمين ؟ قالوا : بلى . قالوا : فما أغنى عنكم الإسلام ! فقد صرتم معنا في النار ؟ قالوا : كانت لنا ذنوب فأخذنا بها . فسمع الله ما قالوا ، فأمر بمن كان في النار من أهل القبلة فأخرجوا ، فلما رأى ذلك من بقي من الكفار قالوا : يا ليتنا كنا مسلمين فنخرج كما خرجوا \" . قال : ثم قرأ رسول الله - صلى الله عليه وسلم - : أعوذ بالله من الشيطان الرجيم ( الر تلك آيات الكتاب وقرآن مبين ربما يود الذين كفروا لو كانوا مسلمين )\nورواه ابن أبي حاتم من حديث خالد بن نافع به ، وزاد فيه : ( بسم الله الرحمن الرحيم ) ، عوض الاستعاذة .\nالحديث الثالث : وقال الطبراني أيضا : حدثنا موسى بن هارون ، حدثنا إسحاق بن راهويه قال : قلت لأبي أسامة : أحدثكم أبو روق - واسمه عطية بن الحارث - : حدثني صالح بن أبي طريف قال : سألت أبا سعيد الخدري فقلت له : هل سمعت رسول الله - صلى الله عليه وسلم - يقول في هذه الآية : ( ربما يود الذين كفروا لو كانوا مسلمين ) ؟ قال : نعم ، سمعته يقول : \" يخرج الله ناسا من المؤمنين من النار بعدما يأخذ نقمته منهم \" . وقال : \" لما أدخلهم الله النار مع المشركين قال لهم المشركون : تزعمون أنكم أولياء الله في الدنيا ، فما بالكم معنا في النار ؟ فإذا سمع الله ذلك منهم ، أذن في الشفاعة لهم فتشفع الملائكة والنبيون ، ويشفع المؤمنون ، حتى يخرجوا بإذن الله ، فإذا رأى المشركون ذلك ، قالوا : يا ليتنا كنا مثلهم ، فتدركنا الشفاعة ، فنخرج معهم \" . قال : \" فذلك قول الله : ( ربما يود الذين كفروا لو كانوا مسلمين ) فيسمون في الجنة الجهنميين من أجل سواد في وجوههم ، فيقولون : يا رب ، أذهب عنا هذا الاسم ، فيأمرهم فيغتسلون في نهر الجنة ، فيذهب ذلك الاسم عنهم \" ، فأقر به أبو أسامة ، وقال : نعم .\nالحديث الرابع وقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا العباس بن الوليد النرسي حدثنا مسكين أبو فاطمة ، حدثني اليمان بن يزيد ، عن محمد بن حمير عن محمد بن علي ، عن أبيه ، عن جده قال : قال رسول الله - صلى الله عليه وسلم - : \" منهم من تأخذه النار إلى ركبتيه ، ومنهم من تأخذه النار إلى حجزته ، ومنهم من تأخذه النار إلى عنقه ، على قدر ذنوبهم وأعمالهم ، ومنهم من يمكث فيها شهرا ثم يخرج منها ، ومنهم من يمكث فيها سنة ثم يخرج منها ، وأطولهم فيها مكثا بقدر الدنيا منذ يوم خلقت إلى أن تفنى ، فإذا أراد الله أن يخرجوا منها قالت اليهود والنصارى ومن في النار من أهل الأديان والأوثان لمن في النار من أهل التوحيد : آمنتم بالله وكتبه ورسله ، فنحن وأنتم اليوم في النار سواء ، فيغضب الله لهم غضبا لم يغضبه لشيء فيما مضى ، فيخرجهم إلى عين في الجنة ، وهو قوله : ( ربما يود الذين كفروا لو كانوا مسلمين ) .\n                                    ",
        "qortoby": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ ٢\n                                    \n                                    \n                                    قوله تعالى : ربما يود الذين كفروا لو كانوا مسلمين رب لا تدخل على الفعل ، فإذا لحقتها \" ما \" هيأتها للدخول على الفعل تقول : ربما قام زيد ، وربما يقوم زيد . ويجوز أن تكون ما نكرة بمعنى شيء ، ويود صفة له ; أي رب شيء يود الكافر . وقرأ نافع وعاصم ربما مخفف الباء . الباقون مشددة ، وهما لغتان . قال أبو حاتم : أهل الحجاز يخففون ربما ; قال الشاعر :\nربما ضربة بسيف صقيل بين بصرى وطعنة نجلاء\nوتميم وقيس وربيعة يثقلونها . وحكي فيها : ربما وربما ، وربتما وربتما ، بتخفيف الباء وتشديدها أيضا . وأصلها أن تستعمل في القليل وقد تستعمل في الكثير ; أي يود الكفار في أوقات كثيرة لو كانوا مسلمين ; قاله الكوفيون . ومنه قول الشاعر :\nألا ربما أهدت لك العين نظرة قصاراك منها أنها عنك لا تجدي\nوقال بعضهم : هي للتقليل في هذا الموضع ; لأنهم قالوا ذلك في بعض المواضع لا في كلها ; لشغلهم بالعذاب ، والله أعلم . قال : ربما يود وهي إنما تكون لما وقع ; لأنه لصدق الوعد كأنه عيان قد كان . وخرج الطبراني أبو القاسم من حديث جابر بن عبد الله قال : قال رسول الله - صلى الله عليه وسلم - : إن ناسا من أمتي يدخلون النار بذنوبهم فيكونون في النار ما شاء الله أن يكونوا ثم يعيرهم أهل الشرك فيقولون ما نرى ما كنتم تخالفونا فيه من تصديقكم وإيمانكم نفعكم فلا يبقى موحد إلا أخرجه الله من النار - ثم قرأ رسول الله - صلى الله عليه وسلم - - ربما يود الذين كفروا لو كانوا مسلمين . قال الحسن \" إذا رأى المشركون المسلمين وقد دخلوا الجنة ومأواهم في النار تمنوا أنهم كانوا مسلمين . وقال الضحاك : هذا التمني إنما هو عند المعاينة في الدنيا حين تبين لهم الهدى من الضلالة . وقيل : في القيامة إذا رأوا كرامة المؤمنين وذل الكافرين .\n                                    ",
        "saadi": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ ٢\n                                        \n                                        \n                                        \n                                        فأما من قابل هذه النعمة العظيمة بردها والكفر بها، فإنه من المكذبين الضالين، الذين سيأتي عليهم وقت يتمنون أنهم مسلمون، أي: منقادون لأحكامه وذلك حين ينكشف الغطاء وتظهر أوائل الآخرة ومقدمات الموت، فإنهم في أحوال الآخرة كلها يتمنون أنهم مسلمون، وقد فات وقت الإمكان، ولكنهم في هذه الدنيا مغترون.\n                                    "
      },
      "originalText": "رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ ٢"
    },
    {
      "number": 1805,
      "text": "ذَرْهُمْ يَأْكُلُوا وَيَتَمَتَّعُوا وَيُلْهِهِمُ الْأَمَلُ ۖ فَسَوْفَ يَعْلَمُونَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 3,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ٣\n                                    \n                                    \n                                    وقوله : ( ذرهم يأكلوا ويتمتعوا ) تهديد لهم شديد ، ووعيد أكيد ، كقوله تعالى : ( قل تمتعوا فإن مصيركم إلى النار ) [ إبراهيم : 30 ] وقوله : ( كلوا وتمتعوا قليلا إنكم مجرمون ) [ المرسلات : 46 ] ولهذا قال : ( ويلههم الأمل ) أي : عن التوبة والإنابة ، ( فسوف يعلمون ) أي : عاقبة أمرهم .\n                                    ",
        "qortoby": "ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ٣\n                                    \n                                    \n                                    قوله تعالى : ذرهم يأكلوا ويتمتعوا ويلههم الأمل فسوف يعلمون فيه مسألتان :\nالأولى : قوله - تعالى - : ذرهم يأكلوا ويتمتعوا تهديد لهم . ويلههم الأمل أي يشغلهم عن الطاعة . يقال : ألهاه عن كذا أي شغله . ولهي هو عن الشيء يلهى . فسوف يعلمون إذا رأوا القيامة وذاقوا وبال ما صنعوا . وهذه الآية منسوخة بالسيف .\nالثانية : في مسند البزار عن أنس قال : قال رسول الله - صلى الله عليه وسلم - : أربعة من الشقاء : جمود العين ، وقساوة القلب ، وطول الأمل ، والحرص على الدنيا . وطول الأمل داء عضال ومرض مزمن ، ومتى تمكن من القلب فسد مزاجه واشتد علاجه ، ولم يفارقه داء ولا نجح فيه دواء ، بل أعيا الأطباء ويئس من برئه الحكماء والعلماء . وحقيقة الأمل : الحرص على الدنيا والانكباب عليها ، والحب لها والإعراض عن الآخرة . وروي عن رسول الله - صلى الله عليه وسلم - أنه قال : نجا أول هذه الأمة باليقين والزهد ويهلك آخرها بالبخل والأمل . ويروى عن أبي الدرداء - رضي الله عنه - أنه قام على درج مسجد دمشق فقال : ( يا أهل دمشق ، ألا تسمعون من أخ لكم ناصح ، إن من كان قبلكم كانوا يجمعون كثيرا ويبنون مشيدا ويأملون بعيدا ، فأصبح جمعهم بورا وبنيانهم قبورا وأملهم غرورا . هذه عاد قد ملأت البلاد أهلا ومالا وخيلا ورجالا ، فمن يشتري مني اليوم تركتهم بدرهمين ! وأنشد :\nيا ذا المؤمل آمالا وإن بعدت منه ويزعم أن يحظى بأقصاها أنى تفوز بما ترجوه ويك وما\nأصبحت في ثقة من نيل أدناها\nوقال الحسن : ( ما أطال عبد الأمل إلا أساء العمل ) . وصدق - رضي الله عنه - ! فالأمل يكسل عن العمل ويورث التراخي والتواني ، ويعقب التشاغل والتقاعس ، ويخلد إلى الأرض ويميل إلى الهوى . وهذا أمر قد شوهد بالعيان فلا يحتاج إلى بيان ولا يطلب صاحبه ببرهان ; كما أن قصر الأمل يبعث على العمل ، ويحيل على المبادرة ، ويحث على المسابقة .\n                                    ",
        "saadi": "ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ٣\n                                        \n                                        \n                                        \n                                        فـ { ذَرْهُمْ يَأْكُلُوا وَيَتَمَتَّعُوا } بلذاتهم { وَيُلْهِهِمُ الْأَمَلُ } أي: يؤملون البقاء في الدنيا فيلهيهم عن الآخرة، { فَسَوْفَ يَعْلَمُونَ } أن ما هم عليه باطل وأن أعمالهم ذهبت خسرانا عليهم ولا يغتروا بإمهال الله تعالى فإن هذه سنته في الأمم.\n                                    "
      },
      "originalText": "ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ٣"
    },
    {
      "number": 1806,
      "text": "وَمَا أَهْلَكْنَا مِنْ قَرْيَةٍ إِلَّا وَلَهَا كِتَابٌ مَعْلُومٌ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 4,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ ٤\n                                    \n                                    \n                                    يخبر تعالى أنه ما أهلك قرية إلا بعد قيام الحجة عليها وانتهاء أجلها.\n                                    ",
        "qortoby": "وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ ٤\n                                    \n                                    \n                                    قوله تعالى : وما أهلكنا من قرية إلا ولها كتاب معلوم أي أجل مؤقت كتب لهم في اللوح المحفوظ .\n                                    ",
        "saadi": "وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ ٤\n                                        \n                                        \n                                        \n                                        { وَمَا أَهْلَكْنَا مِنْ قَرْيَةٍ } كانت مستحقة للعذاب { إِلَّا وَلَهَا كِتَابٌ مَعْلُومٌ } مقدر لإهلاكها.\n                                    "
      },
      "originalText": "وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ ٤"
    },
    {
      "number": 1807,
      "text": "مَا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَأْخِرُونَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 5,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ٥\n                                    \n                                    \n                                    وأنه لا يؤخر أمة حان هلاكهم عن ميقاتهم ولا يتقدمون عن مدتهم وهذا تنبيه لأهل مكة وإرشاد لهم إلى الإقلاع عما هم عليه من الشرك والعناد والإلحاد الذي يستحقون به الهلاك.\n                                    ",
        "qortoby": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ٥\n                                    \n                                    \n                                    قوله تعالى : ما تسبق من أمة أجلها وما يستأخرون ( من ) صلة ; كقولك : ما جاءني من أحد . أي لا تتجاوز أجلها فتزيد عليه ، ولا تتقدم قبله . ونظيره قوله - تعالى - : فإذا جاء أجلهم لا يستأخرون ساعة ولا يستقدمون .\n                                    ",
        "saadi": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ٥\n                                        \n                                        \n                                        \n                                        { مَا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَأْخِرُونَ } وإلا فالذنوب لا بد من وقوع أثرها وإن تأخر\n                                    "
      },
      "originalText": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ٥"
    },
    {
      "number": 1808,
      "text": "وَقَالُوا يَا أَيُّهَا الَّذِي نُزِّلَ عَلَيْهِ الذِّكْرُ إِنَّكَ لَمَجْنُونٌ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 6,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونٞ ٦\n                                    \n                                    \n                                    يخبر تعالى عن كفرهم وعتوهم وعنادهم في قولهم : ( يا أيها الذي نزل عليه الذكر ) أي : الذي يدعي ذلك ( إنك لمجنون ) أي : في دعائك إيانا إلى اتباعك وترك ما وجدنا عليه آباءنا .\n                                    ",
        "qortoby": "وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونٞ ٦\n                                    \n                                    \n                                    قاله كفار قريش لمحمد صلى الله عليه وسلم على جهة الاستهزاء .\n                                    ",
        "saadi": "وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونٞ ٦\n                                        \n                                        \n                                        \n                                        أي: وقال المكذبون لمحمد صلى الله عليه وسلم استهزاء وسخرية: { يا أيها الذي نزل عليه الذكر } على زعمك { إنك لمجنون } إذ تظن أنا سنتبعك ونترك ما وجدنا عليه آباءنا لمجرد قولك.\n                                    "
      },
      "originalText": "وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونٞ ٦"
    },
    {
      "number": 1809,
      "text": "لَوْ مَا تَأْتِينَا بِالْمَلَائِكَةِ إِنْ كُنْتَ مِنَ الصَّادِقِينَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 7,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّوۡ مَا تَأۡتِينَا بِٱلۡمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٧\n                                    \n                                    \n                                    ( لو ما ) أي : هلا ( تأتينا بالملائكة ) أي : يشهدون لك بصحة ما جئت به ( إن كنت من الصادقين ) كما قال فرعون : ( فلولا ألقي عليه أسورة من ذهب أو جاء معه الملائكة مقترنين ) [ الزخرف : 53 ] ( وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا لقد استكبروا في أنفسهم وعتوا عتوا كبيرا يوم يرون الملائكة لا بشرى يومئذ للمجرمين ويقولون حجرا محجورا ) [ الفرقان : 21 ، 22 ]\n                                    ",
        "qortoby": "لَّوۡ مَا تَأۡتِينَا بِٱلۡمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٧\n                                    \n                                    \n                                    ثم طلبوا منه إتيان الملائكة دلالة على صدقه . ولوما تحضيض على الفعل كلولا وهلا . وقال الفراء : الميم في لوما بدل من اللام في لولا . ومثله استولى على الشيء واستومى عليه ، ومثله خالمته وخاللته ، فهو خلي وخلمي ; أي صديقي . وعلى هذا يجوز لوما بمعنى الخبر ، تقول : لوما زيد لضرب عمرو . قال الكسائي : لولا ولوما سواء في الخبر والاستفهام .\nقال ابن مقبل :\nلوما الحياء ولوما الدين عبتكما ببعض ما فيكما إذ عبتما عوري\nيريد لولا الحياء . وحكى النحاس لوما ولولا وهلا واحد . وأنشد أهل اللغة على ذلك :\nتعدون عقر النيب أفضل مجدكم بني ضوطرى لولا الكمي المقنعا\nأي هلا تعدون الكمي المقنعا .\n                                    ",
        "saadi": "لَّوۡ مَا تَأۡتِينَا بِٱلۡمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٧\n                                        \n                                        \n                                        \n                                        { لو ما تأتينا بالملائكة } يشهدون لك بصحة ما جئت به { إن كنت من الصادقين } فلما لم تأت بالملائكة فلست بصادق، وهذا من أعظم الظلم والجهل.\nأما الظلم فظاهر فإن هذا تجرؤ على الله وتعنت بتعيين الآيات التي لم يخترها وحصل المقصود والبرهان بدونها من الآيات الكثيرة الدالة على صحة ما جاء به، وأما الجهل، فإنهم جهلوا مصلحتهم من مضرتهم، فليس في إنزال الملائكة، خير لهم بل لا ينزل الله الملائكة إلا بالحق الذي لا إمهال على من لم يتبعه وينقد له.\n                                    "
      },
      "originalText": "لَّوۡ مَا تَأۡتِينَا بِٱلۡمَلَٰٓئِكَةِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ ٧"
    },
    {
      "number": 1810,
      "text": "مَا نُنَزِّلُ الْمَلَائِكَةَ إِلَّا بِالْحَقِّ وَمَا كَانُوا إِذًا مُنْظَرِينَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 8,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ ٨\n                                    \n                                    \n                                    وكذا قال في هذه الآية : ( ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين )\nوقال مجاهد في قوله : ( ما ننزل الملائكة إلا بالحق ) بالرسالة والعذاب .\n                                    ",
        "qortoby": "مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ ٨\n                                    \n                                    \n                                    قوله تعالى : ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين / قرأ حفص وحمزة والكسائي ما ننزل الملائكة إلا بالحق واختاره أبو عبيد .\nوقرأ أبو بكر والمفضل \" ما تنزل الملائكة \" . الباقون \" ما تنزل الملائكة \" وتقديره : ما تتنزل بتاءين حذفت إحداهما تخفيفا ، وقد شدد التاء البزي ، واختاره أبو حاتم اعتبارا بقوله : تنزل الملائكة والروح .\nومعنى إلا بالحق إلا بالقرآن . وقيل بالرسالة ; عن مجاهد . وقال الحسن : إلا بالعذاب إن لم يؤمنوا .\nوما كانوا إذا منظرين أي لو تنزلت الملائكة بإهلاكهم لما أمهلوا ولا قبلت لهم توبة . وقيل : المعنى لو تنزلت الملائكة تشهد لك فكفروا بعد ذلك لم ينظروا . وأصل إذا إذ أن - ومعناه حينئذ - فضم إليها أن ، واستثقلوا الهمزة فحذفوها .\n                                    ",
        "saadi": "مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ ٨\n                                        \n                                        \n                                        \n                                        لا ينزل الله الملائكة إلا بالحق الذي لا إمهال على من لم يتبعه وينقد له.( وَمَا كَانُوا إِذًا ) أي: حين تنزل الملائكة، إن لم يؤمنوا، ولن يؤمنوا بـ ( مُنْظَرِينَ ) أي: بمهملين، فصار طلبهم لإنزال الملائكة تعجيلا لأنفسهم بالهلاك والدمار، فإن الإيمان ليس في أيديهم وإنما هو بيد الله، وَلَوْ أَنَّنَا نَزَّلْنَا إِلَيْهِمُ الْمَلائِكَةَ وَكَلَّمَهُمُ الْمَوْتَى وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلا مَا كَانُوا لِيُؤْمِنُوا إِلا أَنْ يَشَاءَ اللَّهُ وَلَكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ ويكفيهم من الآيات إن كانوا صادقين، هذا القرآن العظيم ولهذا قال هنا:\n                                    "
      },
      "originalText": "مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ ٨"
    },
    {
      "number": 1811,
      "text": "إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 9,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٩\n                                    \n                                    \n                                    ثم قرر تعالى أنه هو الذي أنزل الذكر ، وهو القرآن ، وهو الحافظ له من التغيير والتبديل .\nومنهم من أعاد الضمير في قوله تعالى : ( له لحافظون ) على النبي - صلى الله عليه وسلم - كقوله : ( والله يعصمك من الناس ) [ المائدة : 67 ] والمعنى الأول أولى ، وهو ظاهر السياق ، [ والله أعلم ]\n                                    ",
        "qortoby": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٩\n                                    \n                                    \n                                    قوله تعالى : إنا نحن نزلنا الذكر وإنا له لحافظون قوله تعالى : إنا نحن نزلنا الذكر يعني القرآن .\nوإنا له لحافظون من أن يزاد فيه أو ينقص منه . قال قتادة وثابت البناني : حفظه الله من أن تزيد فيه الشياطين باطلا أو تنقص منه حقا ; فتولى سبحانه حفظه فلم يزل محفوظا ، وقال في غيره : بما استحفظوا ، فوكل حفظه إليهم فبدلوا وغيروا . أنبأنا الشيخ الفقيه الإمام أبو القاسم عبد الله عن أبيه الشيخ الفقيه الإمام المحدث أبي الحسن علي بن خلف بن معزوز الكومي التلمساني قال : قرئ على الشيخة العالمة فخر النساء شهدة بنت أبي نصر أحمد بن الفرج الدينوري وذلك بمنزلها بدار السلام في آخر جمادى الآخرة من سنة أربع وستين وخمسمائة ، قيل لها : أخبركم الشيخ الأجل العامل نقيب النقباء أبو الفوارس طراد بن محمد الزيني قراءة عليه وأنت تسمعين سنة تسعين وأربعمائة ، أخبرنا علي بن عبد الله بن إبراهيم حدثنا أبو علي عيسى بن محمد بن أحمد بن عمر بن عبد الملك بن عبد العزيز بن جريج المعروف بالطوماري حدثنا الحسين بن فهم قال : سمعت يحيى بن أكثم يقول : كان للمأمون - وهو أمير إذ ذاك - مجلس نظر ، فدخل في جملة الناس رجل يهودي حسن الثوب حسن الوجه طيب الرائحة ، قال : فتكلم فأحسن الكلام والعبارة ، قال : فلما تقوض المجلس دعاه المأمون فقال له : إسرائيلي ؟ قال نعم . قال له : أسلم حتى أفعل بك وأصنع ، ووعده . فقال : ديني ودين آبائي ! وانصرف . قال : فلما كان بعد سنة جاءنا مسلما ، قال : فتكلم على الفقه فأحسن الكلام ; فلما تقوض المجلس دعاه المأمون وقال : ألست صاحبنا بالأمس ؟ قال له : بلى . قال : فما كان سبب إسلامك ؟ قال : انصرفت من حضرتك فأحببت أن أمتحن هذه الأديان ، وأنت تراني حسن الخط ، فعمدت إلى التوراة فكتبت ثلاث نسخ فزدت فيها ونقصت ، وأدخلتها الكنيسة فاشتريت مني ، وعمدت إلى الإنجيل فكتبت ثلاث نسخ فزدت فيها ونقصت ، وأدخلتها البيعة فاشتريت مني ، وعمدت إلى القرآن فعملت ثلاث نسخ وزدت فيها ونقصت ، وأدخلتها الوراقين فتصفحوها ، فلما أن وجدوا فيها الزيادة والنقصان رموا بها فلم يشتروها ; فعلمت أن هذا كتاب محفوظ ، فكان هذا سبب إسلامي . قال يحيى بن أكثم : فحججت تلك السنة فلقيت سفيان بن عيينة فذكرت له الخبر فقال لي : مصداق هذا في كتاب الله - عز وجل - . قال قلت : في أي موضع ؟ قال : في قول الله - تبارك وتعالى - في التوراة والإنجيل : بما استحفظوا من كتاب الله ، فجعل حفظه إليهم فضاع ، وقال - عز وجل - : إنا نحن نزلنا الذكر وإنا له لحافظون فحفظه الله - عز وجل - علينا فلم يضع . وقيل : وإنا له لحافظون أي لمحمد - صلى الله عليه وسلم - من أن يتقول علينا أو نتقول عليه . أو وإنا له لحافظون من أن يكاد أو يقتل . نظيره والله يعصمك من الناس . ونحن نجوز أن يكون موضعه رفعا بالابتداء \" ونزلنا \" الخبر . والجملة خبر إن . ويجوز أن يكون نحن تأكيدا لاسم إن في موضع نصب ، ولا تكون فاصلة لأن الذي بعدها ليس بمعرفة وإنما هو جملة ، والجمل تكون نعوتا للنكرات فحكمها حكم النكرات .\n                                    ",
        "saadi": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٩\n                                        \n                                        \n                                        \n                                        ( إِنَّا نَحْنُ نزلْنَا الذِّكْرَ ) أي: القرآن الذي فيه ذكرى لكل شيء من المسائل والدلائل الواضحة، وفيه يتذكر من أراد التذكر، ( وَإِنَّا لَهُ لَحَافِظُونَ ) أي: في حال إنزاله وبعد إنزاله، ففي حال إنزاله حافظون له من استراق كل شيطان رجيم، وبعد إنزاله أودعه الله في قلب رسوله، واستودعه فيها ثم في قلوب أمته، وحفظ الله ألفاظه من التغيير فيها والزيادة والنقص، ومعانيه من التبديل، فلا يحرف محرف معنى من معانيه إلا وقيض الله له من يبين الحق المبين، وهذا من أعظم آيات الله ونعمه على عباده المؤمنين، ومن حفظه أن الله يحفظ أهله من أعدائهم، ولا يسلط عليهم عدوا يجتاحهم.\n                                    "
      },
      "originalText": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ ٩"
    },
    {
      "number": 1812,
      "text": "وَلَقَدْ أَرْسَلْنَا مِنْ قَبْلِكَ فِي شِيَعِ الْأَوَّلِينَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 10,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ٠١\n                                    \n                                    \n                                    يقول تعالى مسليا لرسوله في تكذيب من كذبه من كفار قريش : إنه أرسل من قبله في الأمم الماضية ، وإنه ما أتى أمة رسول إلا كذبوه واستهزءوا به .\n                                    ",
        "qortoby": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ٠١\n                                    \n                                    \n                                    قوله تعالى : ولقد أرسلنا من قبلك في شيع الأولين المعنى : ولقد أرسلنا من قبلك رسلا ، فحذف . والشيع جمع شيعة وهي الأمة ، أي في أممهم ; قاله ابن عباس وقتادة . والحسن : في فرقهم . والشيعة : الفرقة والطائفة من الناس المتآلفة المتفقة الكلمة . فكأن الشيع الفرق ; ومنه قوله - تعالى - : أو يلبسكم شيعا . وأصله مأخوذ من الشياع وهو الحطب الصغار يوقد به الكبار - كما تقدم في \" الأنعام \" . - وقال الكلبي : إن الشيع هنا القرى .\n                                    ",
        "saadi": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ٠١\n                                        \n                                        \n                                        \n                                        يقول تعالى لنبيه إذ كذبه المشركون: لم يزل هذا دأب الأمم الخالية والقرون الماضية: { ولقد أرسلنا من قبلك في شيع الأولين } أي: فرقهم وجماعتهم رسلا.\n                                    "
      },
      "originalText": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ٠١"
    },
    {
      "number": 1813,
      "text": "وَمَا يَأْتِيهِمْ مِنْ رَسُولٍ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 11,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ١١\n                                    \n                                    \n                                    ثم أخبر أنه سلك التكذيب في قلوب المجرمين الذين عاندوا واستكبروا عن اتباع الهدى .\n                                    ",
        "qortoby": "وَمَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : وما يأتيهم من رسول إلا كانوا به يستهزئون تسلية للنبي - صلى الله عليه وسلم - ; أي كما فعل بك هؤلاء المشركون فكذلك فعل بمن قبلك من الرسل .\n                                    ",
        "saadi": "وَمَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ١١\n                                        \n                                        \n                                        \n                                        { وما يأتيهم من رسول } يدعوهم إلى الحق والهدى { إلا كانوا به يستهزئون }\n                                    "
      },
      "originalText": "وَمَا يَأۡتِيهِم مِّن رَّسُولٍ إِلَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ١١"
    },
    {
      "number": 1814,
      "text": "كَذَٰلِكَ نَسْلُكُهُ فِي قُلُوبِ الْمُجْرِمِينَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 12,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كَذَٰلِكَ نَسۡلُكُهُۥ فِي قُلُوبِ ٱلۡمُجۡرِمِينَ ٢١\n                                    \n                                    \n                                    قال أنس ، والحسن البصري : ( كذلك نسلكه في قلوب المجرمين ) يعني : الشرك .\n                                    ",
        "qortoby": "كَذَٰلِكَ نَسۡلُكُهُۥ فِي قُلُوبِ ٱلۡمُجۡرِمِينَ ٢١\n                                    \n                                    \n                                    قوله تعالى : كذلك نسلكه في قلوب المجرمين\nقوله - تعالى - : كذلك نسلكه أي الضلال والكفر والاستهزاء والشرك . في قلوب المجرمين من قومك ; عن الحسن وقتادة وغيرهما . أي كما سلكناه في قلوب من تقدم من شيع الأولين كذلك نسلكه في قلوب مشركي قومك حتى لا يؤمنوا بك ، كما لم يؤمن من قبلهم برسلهم . وروى ابن جريج عن مجاهد قال : نسلك التكذيب . والسلك : إدخال الشيء في الشيء كإدخال الخيط في المخيط . يقال : سلكه يسلكه سلكا وسلوكا ، وأسلكه إسلاكا . وسلك الطريق سلوكا وسلكا وأسلكه دخله ، والشيء في غيره مثله ، والشيء كذلك والرمح ، والخيط في الجوهر ; كله فعل وأفعل . وقال عدي بن زيد :\nوقد سلكوك في يوم عصيب\nوالسلك ( بالكسر ) الخيط . وفي الآية رد على القدرية والمعتزلة . وقيل : المعنى نسلك القرآن في قلوبهم فيكذبون به . وقال الحسن ومجاهد وقتادة القول الذي عليه أكثر أهل التفسير ، وهو ألزم حجة على المعتزلة . وعن الحسن أيضا : نسلك الذكر إلزاما للحجة ; ذكره الغزنوي .\n                                    ",
        "saadi": "كَذَٰلِكَ نَسۡلُكُهُۥ فِي قُلُوبِ ٱلۡمُجۡرِمِينَ ٢١\n                                        \n                                        \n                                        \n                                        { كذلك نسلكه } أي: ندخل التكذيب { في قلوب المجرمين } أي: الذين وصفهم لظلم والبهت، عاقبناهم لما اشتبهت قلوبهم بالكفر والتكذيب، تشابهت معاملتهم لأنبيائهم ورسلهم بالاستهزاء والسخرية وعدم الإيمان\n                                    "
      },
      "originalText": "كَذَٰلِكَ نَسۡلُكُهُۥ فِي قُلُوبِ ٱلۡمُجۡرِمِينَ ٢١"
    },
    {
      "number": 1815,
      "text": "لَا يُؤْمِنُونَ بِهِ ۖ وَقَدْ خَلَتْ سُنَّةُ الْأَوَّلِينَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 13,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَا يُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ ٣١\n                                    \n                                    \n                                    وقوله : ( وقد خلت سنة الأولين ) أي : قد علم ما فعل تعالى بمن كذب رسله من الهلاك والدمار ، وكيف أنجى الله الأنبياء وأتباعهم في الدنيا والآخرة .\n                                    ",
        "qortoby": "لَا يُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ ٣١\n                                    \n                                    \n                                    وقد خلت سنة الأولين أي مضت سنة الله بإهلاك الكفار ، فما أقرب هؤلاء من الهلاك . وقيل : خلت سنة الأولين بمثل ما فعل هؤلاء من التكذيب والكفر ، فهم يقتدون بأولئك .\n                                    ",
        "saadi": "لَا يُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ ٣١\n                                        \n                                        \n                                        \n                                        { لا يؤمنون به وقد خلت سنة الأولين } أي: عادة الله فيهم بإهلاك من لم يؤمن بآيات الله.\n                                    "
      },
      "originalText": "لَا يُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ ٣١"
    },
    {
      "number": 1816,
      "text": "وَلَوْ فَتَحْنَا عَلَيْهِمْ بَابًا مِنَ السَّمَاءِ فَظَلُّوا فِيهِ يَعْرُجُونَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 14,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ فِيهِ يَعۡرُجُونَ ٤١\n                                    \n                                    \n                                    يخبر تعالى عن قوة كفرهم وعنادهم ومكابرتهم للحق أنه لو فتح لهم بابا من السماء ، فجعلوا يصعدون فيه ، لما صدقوا بذلك\n                                    ",
        "qortoby": "وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ فِيهِ يَعۡرُجُونَ ٤١\n                                    \n                                    \n                                    قوله تعالى : ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون\nيقال : ظل يفعل كذا ، أي يفعله بالنهار . والمصدر الظلول . أي لو أجيبوا إلى ما اقترحوا من الآيات لأصروا على الكفر وتعللوا بالخيالات ; كما قالوا للقرآن المعجز : إنه سحر . يعرجون من عرج يعرج أي صعد . والمعارج المصاعد . أي لو صعدوا إلى السماء وشاهدوا الملكوت والملائكة لأصروا على الكفر ; عن الحسن وغيره . وقيل : الضمير في عليهم للمشركين . وفي فظلوا للملائكة ، تذهب وتجيء . أي لو كشف لهؤلاء حتى يعاينوا أبوابا في السماء تصعد فيها الملائكة وتنزل لقالوا : رأينا بأبصارنا ما لا حقيقة له ; عن ابن عباس وقتادة .\n                                    ",
        "saadi": "وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ فِيهِ يَعۡرُجُونَ ٤١\n                                        \n                                        \n                                        \n                                        أي: ولو جاءتهم كل آية عظيمة لم يؤمنوا وكابروا { ولو فتحنا عليهم بابا من السماء } فصاروا يعرجون فيه، ويشاهدونه عيانا بأنفسهم\n                                    "
      },
      "originalText": "وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ فِيهِ يَعۡرُجُونَ ٤١"
    },
    {
      "number": 1817,
      "text": "لَقَالُوا إِنَّمَا سُكِّرَتْ أَبْصَارُنَا بَلْ نَحْنُ قَوْمٌ مَسْحُورُونَ",
      "surah": {
        "number": 15,
        "name": "سورة الحجر",
        "englishName": "Al-Hijr",
        "englishNameTranslation": "The Rock",
        "revelationType": "Meccan",
        "numberOfAyahs": 99
      },
      "numberInSurah": 15,
      "juz": 14,
      "manzil": 3,
      "page": 262,
      "ruku": 218,
      "hizbQuarter": 105,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَقَالُوٓاْ إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ ٥١\n                                    \n                                    \n                                    بل قالوا : ( سكرت أبصارنا )\nقال مجاهد وابن كثير ، والضحاك : سدت أبصارنا .\nوقال قتادة ، عن ابن عباس : أخذت أبصارنا .\nوقال العوفي عن ابن عباس : شبه علينا ، وإنما سحرنا .\nوقال الكلبي : عميت أبصارنا .\nوقال ابن زيد : ( سكرت أبصارنا ) السكران الذي لا يعقل .\n                                    ",
        "qortoby": "لَقَالُوٓاْ إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ ٥١\n                                    \n                                    \n                                    معنى سكرت سدت بالسحر ; قاله ابن عباس والضحاك . وقال الحسن : سحرت . الكلبي : أغشيت أبصارنا ; وعنه أيضا عميت . قتادة : أخذت . وقال المؤرج : دير بنا من الدوران ; أي صارت أبصارنا سكرى . جويبر : خدعت . وقال أبو عمرو بن العلاء : سكرت غشيت وغطيت . ومنه قول الشاعر :\nوطلعت شمس عليها مغفر وجعلت عين الحرور تسكر\nوقال مجاهد : سكرت حبست . ومنه قول أوس بن حجر :\nفصرت على ليلة ساهرة فليست بطلق ولا ساكرةs\nقلت : وهذه أقوال متقاربة يجمعها قولك : منعت . قال ابن عزيز : سكرت أبصارنا سدت أبصارنا ; هو من قولك ، سكرت النهر إذا سددته . ويقال : هو من سكر الشراب ، كأن العين يلحقها ما يلحق الشارب إذا سكر . وقرأ ابن كثير \" سكرت \" بالتخفيف ، . والباقون بالتشديد . قال ابن الأعرابي : سكرت ملئت . قال المهدوي : والتخفيف والتشديد في سكرت ظاهران ، التشديد للتكثير والتخفيف يؤدي عن معناه . والمعروف أن \" سكر \" لا يتعدى . قال أبو علي : يجوز أن يكون سمع متعديا في البصر . ومن قرأ \" سكرت \" فإنه شبه ما عرض لأبصارهم بحال السكران ، كأنها جرت مجرى السكران لعدم تحصيله . وقد قيل : إنه بالتخفيف [ من ] سكر الشراب ، وبالتشديد أخذت ، ذكرهما الماوردي . وقال النحاس : والمعروف من قراءة مجاهد والحسن \" سكرت \" بالتخفيف . قال الحسن : أي سحرت وحكى أبو عبيد عن أبي عبيدة أنه يقال : سكرت أبصارهم إذا غشيها سمادير حتى لا يبصروا . وقال الفراء : من قرأ سكرت أخذه من سكور الريح . قال النحاس : وهذه الأقوال متقاربة . والأصل فيها ما قال أبو عمرو بن العلاء - رحمه الله تعالى - ، قال : هو من السكر في الشراب . وهذا قول حسن ; أي غشيهم ما غطى أبصارهم كما غشي السكران ما غطى عقله . وسكور الريح سكونها وفتورها ; فهو يرجع إلى معنى التحيير .\n                                    ",
        "saadi": "لَقَالُوٓاْ إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ ٥١\n                                        \n                                        \n                                        \n                                        لقالوا من ظلمهم وعنادهم منكرين لهذه الآية: { إنما سكرت أبصارنا } أي: أصابها سكر وغشاوة حتى رأينا ما لم نر، { بل نحن قوم مسحورون } أي: ليس هذا بحقيقة، بل هذا سحر، وقوم وصلت بهم الحال إلى هذا الإنكار، فإنهم لا مطمع فيهم ولا رجاء\n                                    "
      },
      "originalText": "لَقَالُوٓاْ إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ ٥١"
    }
  ]
}