{
  "number": 268,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 1908,
      "text": "وَتَحْمِلُ أَثْقَالَكُمْ إِلَىٰ بَلَدٍ لَمْ تَكُونُوا بَالِغِيهِ إِلَّا بِشِقِّ الْأَنْفُسِ ۚ إِنَّ رَبَّكُمْ لَرَءُوفٌ رَحِيمٌ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 7,
      "juz": 14,
      "manzil": 3,
      "page": 268,
      "ruku": 224,
      "hizbQuarter": 107,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدٖ لَّمۡ تَكُونُواْ بَٰلِغِيهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ ٧\n                                    \n                                    \n                                    وتحمل أثقالكم ) وهي الأحمال المثقلة التي تعجزون عن نقلها وحملها ، إلى بلد لم تكونوا بالغيه إلا بشق الأنفس ) وذلك في الحج والعمرة والغزو والتجارة ، وما جرى مجرى ذلك ، تستعملونها في أنواع الاستعمال ، من ركوب وتحميل ، كما قال تعالى : ( وإن لكم في الأنعام لعبرة نسقيكم مما في بطونها ولكم فيها منافع كثيرة ومنها تأكلون وعليها وعلى الفلك تحملون ) [ المؤمنون : 21 ، 22 ] وقال تعالى : ( الله الذي جعل لكم الأنعام لتركبوا منها ومنها تأكلون ولكم فيها منافع ولتبلغوا عليها حاجة في صدوركم وعليها وعلى الفلك تحملون ويريكم آياته فأي آيات الله تنكرون ) [ غافر : 79 ، 81 ] ولهذا قال هاهنا بعد تعداد هذه النعم : ( إن ربكم لرءوف رحيم ) أي : ربكم الذي قيض لكم هذه الأنعام وسخرها لكم ، كما قال : ( أولم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون وذللناها لهم فمنها ركوبهم ومنها يأكلون ) [ يس : 71 ، 72 ] وقال : ( وجعل لكم من الفلك والأنعام ما تركبون لتستووا على ظهوره ثم تذكروا نعمة ربكم إذا استويتم عليه وتقولوا سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون ) [ الزخرف : 12 - 14 ] .\nقال ابن عباس : ( لكم فيها دفء ) أي : ثياب ، والمنافع : ما تنتفعون به من الأطعمة والأشربة .\nوقال عبد الرزاق : أخبرنا إسرائيل ، عن سماك ، عن عكرمة ، عن ابن عباس : ( دفء ومنافع ) نسل كل دابة .\nوقال مجاهد : ( لكم فيها دفء ) قال : لباس ينسج ، ومنافع تركب ، ولحم ولبن .\nوقال قتادة : ( دفء ومنافع ) يقول : لكم فيها لباس ، ومنفعة ، وبلغة .\nوكذا قال غير واحد من المفسرين بألفاظ متقاربة .\n                                    ",
        "qortoby": "وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدٖ لَّمۡ تَكُونُواْ بَٰلِغِيهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ ٧\n                                    \n                                    \n                                    قوله تعالى : وتحمل أثقالكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس إن ربكم لرءوف رحيم فيه ثلاث مسائل :\nالأولى : قوله - تعالى - : وتحمل أثقالكم الأثقال أثقال الناس من متاع وطعام وغيره ، وهو ما يثقل الإنسان حمله . وقيل : المراد أبدانهم ; يدل على ذلك قوله - تعالى - : وأخرجت الأرض أثقالها . والبلد مكة ، في قول عكرمة . وقيل : هو محمول على العموم في كل بلد مسلكه على الظهر . وشق الأنفس : مشقتها وغاية جهدها . وقراءة العامة بكسر الشين . قال الجوهري : والشق المشقة ; ومنه قوله - تعالى - : لم تكونوا بالغيه إلا بشق الأنفس وهذا قد يفتح ، حكاه أبو عبيدة . قال المهدوي : وكسر الشين وفتحها في \" شق \" متقاربان ، وهما بمعنى المشقة ، وهو من الشق في العصا ونحوها ; لأنه ينال منها كالمشقة من الإنسان . وقال الثعلبي : وقرأ أبو جعفر إلا بشق الأنفس وهما لغتان ، مثل رق ورق وجص وجص ورطل ورطل . وينشد قول الشاعر بكسر الشين وفتحها :\nوذي إبل يسعى ويحسبها له أخي نصب من شقها ودؤوب\nويجوز أن يكون بمعنى المصدر ، من شققت عليه أشق شقا . والشق أيضا بالكسر النصف ، يقال : أخذت شق الشاة وشقة الشاة . وقد يكون المراد من الآية هذا المعنى ; أي لم تكونوا بالغيه إلا بنقص من القوة وذهاب شق منها ، أي لم تكونوا تبلغوه إلا بنصف قوى أنفسكم وذهاب النصف الآخر . والشق أيضا الناحية من الجبل . وفي حديث أم زرع : وجدني في أهل غنيمة بشق . قال أبو عبيد : هو اسم موضع . والشق أيضا : الشقيق ، يقال :\nهو أخي وشق نفسي . وشق اسم كاهن من كهان العرب . والشق أيضا : الجانب ; ومنه قول امرئ القيس :\nإذا ما بكى من خلفها انصرفت له بشق وتحتي شقها لم يحول\nفهو مشترك .\nالثانية : من الله سبحانه بالأنعام عموما ، وخص الإبل هنا بالذكر في حمل الأثقال على سائر الأنعام ; فإن الغنم للسرح والذبح ، والبقر للحرث ، والإبل للحمل . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : بينما رجل يسوق بقرة له قد حمل عليها التفتت إليه البقرة فقالت إني لم أخلق لهذا ولكني إنما خلقت للحرث فقال الناس سبحان الله تعجبا وفزعا أبقرة تكلم ؟ فقال رسول الله - صلى الله عليه وسلم - : وإني أومن به وأبو بكر وعمر . فدل هذا الحديث على أن البقر لا يحمل عليها ولا تركب ، وإنما هي للحرث وللأكل والنسل والرسل .\nالثالثة : في هذه الآية دليل على جواز السفر بالدواب وحمل الأثقال عليها . ولكن على قدر ما تحتمله من غير إسراف في الحمل مع الرفق في السير . وقد أمر النبي - صلى الله عليه وسلم - بالرفق بها والإراحة لها ومراعاة التفقد لعلفها وسقيها . وروى مسلم من حديث أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : إذا سافرتم في الخصب فأعطوا الإبل حظها من الأرض وإذا سافرتم في السنة فبادروا بها نقيها رواه مالك في الموطأ عن أبي عبيد عن خالد بن معدان . وروى معاوية بن قرة قال : كان لأبي الدرداء جمل يقال له دمون ، فكان يقول : يا دمون ، لا تخاصمني عند ربك . فالدواب عجم لا تقدر أن تحتال لنفسها ما تحتاج إليه ، ولا تقدر أن تفصح بحوائجها ، فمن ارتفق بمرافقها ثم ضيعها من حوائجها فقد ضيع الشكر وتعرض للخصومة بين يدي الله - تعالى - . وروى مطر بن محمد قال : حدثنا أبو داود قال حدثنا ابن خالد قال حدثنا المسيب بن آدم قال . رأيت عمر بن الخطاب - رضي الله عنه - ضرب جمالا وقال : تحمل على بعيرك ما لا يطيق .\n                                    ",
        "saadi": "وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدٖ لَّمۡ تَكُونُواْ بَٰلِغِيهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ ٧\n                                        \n                                        \n                                        \n                                        { وَتَحْمِلُ أَثْقَالَكُمْ } من الأحمال الثقيلة، بل وتحملكم أنتم { إِلَى بَلَدٍ لَمْ تَكُونُوا بَالِغِيهِ إِلَّا بِشِقِّ الْأَنْفُسِ } ولكن الله ذللها لكم.\nفمنها ما تركبونه، ومنها ما تحملون عليه ما تشاءون من الأثقال إلى البلدان البعيدة والأقطار الشاسعة، { إِنَّ رَبَّكُمْ لَرَءُوفٌ رَحِيمٌ } إذ سخر لكم ما تضطرون إليه وتحتاجونه، فله الحمد كما ينبغي لجلال وجهه، وعظيم سلطانه وسعة جوده وبره.\n                                    "
      },
      "originalText": "وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدٖ لَّمۡ تَكُونُواْ بَٰلِغِيهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ ٧"
    },
    {
      "number": 1909,
      "text": "وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ لِتَرْكَبُوهَا وَزِينَةً ۚ وَيَخْلُقُ مَا لَا تَعْلَمُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 8,
      "juz": 14,
      "manzil": 3,
      "page": 268,
      "ruku": 224,
      "hizbQuarter": 107,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ ٨\n                                    \n                                    \n                                    هذا صنف آخر مما خلق تبارك وتعالى لعباده ، يمتن به عليهم ، وهو : الخيل والبغال والحمير ، التي جعلها للركوب والزينة بها ، وذلك أكبر المقاصد منها ، ولما فصلها من الأنعام وأفردها بالذكر استدل من استدل من العلماء - ممن ذهب إلى تحريم لحوم الخيل - بذلك على ما ذهب إليه فيها ، كالإمام أبي حنيفة - رحمه الله - ومن وافقه من الفقهاء ; لأنه تعالى قرنها بالبغال والحمير ، وهي حرام ، كما ثبتت به السنة النبوية ، وذهب إليه أكثر العلماء .\nوقد روى الإمام أبو جعفر بن جرير : حدثني يعقوب ، حدثنا ابن علية ، أنبأنا هشام الدستوائي ، حدثنا يحيى بن أبي كثير ، عن مولى نافع بن علقمة ، أن ابن عباس كان يكره لحوم الخيل والبغال والحمير ، وكان يقول : قال الله : ( والأنعام خلقها لكم فيها دفء ومنافع ومنها تأكلون ) فهذه للأكل ، ( والخيل والبغال والحمير لتركبوها ) فهذه للركوب .\nوكذا روي من طريق سعيد بن جبير وغيره ، عن ابن عباس ، بمثله . وقال مثل ذلك الحكم بن عتيبة - رضي الله عنه - أيضا ، واستأنسوا بحديث رواه الإمام أحمد في مسنده :\nحدثنا يزيد بن عبد ربه ، حدثنا بقية بن الوليد ، حدثنا ثور بن يزيد ، عن صالح بن يحيى بن المقدام بن معد يكرب ، عن أبيه ، عن جده ، عن خالد بن الوليد - رضي الله عنه - قال : نهى رسول الله - صلى الله عليه وسلم - عن أكل لحوم الخيل ، والبغال ، والحمير .\nوأخرجه أبو داود والنسائي ، وابن ماجه من حديث صالح بن يحيى بن المقدام - وفيه كلام - به .\nورواه أحمد أيضا من وجه آخر بأبسط من هذا وأدل منه فقال :\nحدثنا أحمد بن عبد الملك ، حدثنا محمد بن حرب ، حدثنا سليمان بن سليم ، عن صالح بن يحيى بن المقدام ، عن جده المقدام بن معد يكرب قال : غزونا مع خالد بن الوليد الصائفة ، فقرم أصحابنا إلى اللحم ، فسألوني رمكة ، فدفعتها إليهم فحبلوها ، وقلت : مكانكم حتى آتي خالدا فأسأله ، فأتيته فسألته ، فقال : غزونا مع رسول الله - صلى الله عليه وسلم - غزوة خيبر ، فأسرع الناس في حظائر يهود ، فأمرني أن أنادي : \" الصلاة جامعة ، ولا يدخل الجنة إلا مسلم \" ثم قال : \" أيها الناس ، إنكم قد أسرعتم في حظائر يهود ، ألا لا تحل أموال المعاهدين إلا بحقها ، وحرام عليكم لحوم الأتن الأهلية وخيلها وبغالها ، وكل ذي ناب من السباع ، وكل ذي مخلب من الطير \" .\nوالرمكة : هي الحجرة . وقوله : حبلوها ، أي : أوثقوها في الحبل ليذبحوها . والحظائر : البساتين القريبة من العمران .\nوكأن هذا الصنيع وقع بعد إعطائهم العهد ومعاملتهم على الشطر ، والله أعلم .\nفلو صح هذا الحديث لكان نصا في تحريم لحوم الخيل ، ولكن لا يقاوم ما ثبت في الصحيحين ، عن جابر بن عبد الله قال : نهى رسول الله - صلى الله عليه وسلم - عن لحوم الحمر الأهلية ، وأذن في لحوم الخيل .\nورواه الإمام أحمد وأبو داود بإسنادين كل منهما على شرط مسلم ، عن جابر قال : ذبحنا يوم خيبر الخيل والبغال والحمير ، فنهانا رسول الله - صلى الله عليه وسلم - عن البغال والحمير ، ولم ينهنا عن الخيل .\nوفي صحيح مسلم ، عن أسماء بنت أبي بكر - رضي الله عنهما - قالت : نحرنا على عهد رسول الله - صلى الله عليه وسلم - فرسا فأكلناه ونحن بالمدينة .\nفهذه أدل وأقوى وأثبت ، وإلى ذلك صار جمهور العلماء : مالك ، والشافعي ، وأحمد ، وأصحابهم ، وأكثر السلف والخلف ، والله أعلم .\nوقال عبد الرزاق : أنبأنا ابن جريج ، عن ابن أبي مليكة ، عن ابن عباس قال : كانت الخيل وحشية ، فذللها الله لإسماعيل بن إبراهيم - عليهما السلام - .\nوذكر وهب بن منبه في إسرائيلياته : أن الله خلق الخيل من ريح الجنوب ، والله أعلم .\nفقد دل النص على جواز ركوب هذه الدواب ، ومنها البغال . وقد أهديت إلى رسول الله - صلى الله عليه وسلم - بغلة ، فكان يركبها ، مع أنه قد نهى عن إنزاء الحمر على الخيل لئلا ينقطع النسل .\nقال الإمام أحمد : حدثني محمد بن عبيد ، حدثنا عمر من آل حذيفة ، عن الشعبي ، عن دحية الكلبي قال : قلت : يا رسول الله ، ألا أحمل لك حمارا على فرس ، فتنتج لك بغلا فتركبها ؟ قال : \" إنما يفعل ذلك الذين لا يعلمون \" .\n                                    ",
        "qortoby": "وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ ٨\n                                    \n                                    \n                                    قوله تعالى : والخيل والبغال والحمير لتركبوها وزينة ويخلق ما لا تعلمون فيه ثمان مسائل :\nالأولى : قوله - تعالى - : والخيل بالنصب معطوف ، أي وخلق الخيل . وقرأ ابن أبي عبلة \" والخيل والبغال والحمير \" بالرفع فيها كلها . وسميت الخيل خيلا لاختيالها في المشية . وواحد الخيل خائل ، كضائن واحد ضين . وقيل لا واحد له . وقد تقدم هذا في \" آل عمران \" وذكرنا الأحاديث هناك ولما أفرد سبحانه الخيل والبغال والحمير بالذكر دل على أنها لم تدخل تحت لفظ الأنعام وقيل دخلت ولكن أفردها بالذكر لما يتعلق بها من الركوب ; فإنه يكثر في الخيل والبغال والحمير .\nالثانية : قال العلماء : ملكنا الله - تعالى - الأنعام والدواب وذللها لنا ، وأباح لنا تسخيرها والانتفاع بها رحمة منه - تعالى - لنا ، وما ملكه الإنسان وجاز له تسخيره من الحيوان فكراؤه له جائز بإجماع أهل العلم ، لا اختلاف بينهم في ذلك . وحكم كراء الرواحل والدواب مذكور في كتب الفقه .\nالثالثة : لا خلاف بين العلماء في اكتراء الدواب والرواحل للحمل عليها والسفر بها ; لقوله - تعالى - : وتحمل أثقالكم الآية . وأجازوا أن يكري الرجل الدابة والراحلة إلى مدينة بعينها وإن لم يسم أين ينزل منها ، وكم من منهل ينزل فيه ، وكيف صفة سيره ، وكم ينزل في طريقه ، واجتزءوا بالمتعارف بين الناس في ذلك . قال علماؤنا : والكراء يجري مجرى البيوع فيما يحل منه ويحرم . قال ابن القاسم فيمن اكترى دابة إلى موضع كذا بثوب مروي ولم يصف رقعته وذرعه : لم يجز ; لأن مالكا لم يجز هذا في البيع ، ولا يجيز في ثمن الكراء إلا ما يجوز في ثمن البيع .\nقلت : ولا يختلف في هذا إن شاء الله ; لأن ذلك إجارة . قال ابن المنذر : وأجمع كل من يحفظ عنه من أهل العلم على أن من اكترى دابة ليحمل عليها عشرة أقفزة قمح فحمل عليها ما اشترط فتلفت أن لا شيء عليه . وهكذا إن حمل عليها عشرة أقفزة شعير . واختلفوا فيمن اكترى دابة ليحمل عليها عشرة أقفزة فحمل عليها أحد عشر قفيزا ، فكان الشافعي وأبو ثور يقولان : هو ضامن لقيمة الدابة وعليه الكراء . وقال ابن أبي ليلى : عليه قيمتها ولا أجر عليه . وفيه قول ثالث - وهو أن عليه الكراء وعليه جزء من أجر وجزء من قيمة الدابة بقدر ما زاد من الحمل ; وهذا قول النعمان ويعقوب ومحمد . وقال ابن القاسم صاحب مالك : لا ضمان عليه في قول مالك إذا كان القفيز الزائد لا يفدح الدابة ، ويعلم أن مثله لا تعطب فيه الدابة ، ولرب الدابة أجر القفيز الزائد مع الكراء الأول ; لأن عطبها ليس من أجل الزيادة . وذلك بخلاف مجاوزة المسافة ; لأن مجاوزة المسافة تعد كله فيضمن إذا هلكت في قليله وكثيره . والزيادة على الحمل المشترط اجتمع فيه إذن وتعد ، فإذا كانت الزيادة لا تعطب في مثلها علم أن هلاكها مما أذن له فيه .\nالرابعة : واختلف أهل العلم في الرجل يكتري الدابة بأجر معلوم إلى موضع مسمى ، فيتعدى فيتجاوز ذلك المكان ثم يرجع إلى المكان المأذون له في المصير إليه . فقالت طائفة : إذا جاوز ذلك المكان ضمن وليس عليه في التعدي كراء ; هكذا قال الثوري . وقال أبو حنيفة : الأجر له فيما سمى ، ولا أجر له فيما لم يسم ; لأنه خالف فهو ضامن ، وبه قال يعقوب . وقال الشافعي : عليه الكراء الذي سمى ، وكراء المثل فيما جاوز ذلك ، ولو عطبت لزمه قيمتها . ونحوه قال الفقهاء السبعة ، مشيخة أهل المدينة قالوا : إذا بلغ المسافة ثم زاد فعليه كراء الزيادة إن سلمت وإن هلكت ضمن . وقال أحمد وإسحاق وأبو ثور : عليه الكراء والضمان . قال ابن المنذر : وبه نقول . وقال ابن القاسم : إذا بلغ المكتري الغاية التي اكترى إليها ثم زاد ميلا ونحوه أو أميالا أو زيادة كثيرة فعطبت الدابة ، فلربها كراؤه الأول والخيار في أخذه كراء الزائد بالغا ما بلغ ، أو قيمة الدابة يوم التعدي . ابن المواز : وقد روى أنه ضامن ولو زاد خطوة . وقال ابن القاسم عن مالك في زيادة الميل ونحوه : وأما ما يعدل الناس إليه في المرحلة فلا يضمن . وقال ابن حبيب عن ابن الماجشون وأصبغ : إذا كانت الزيادة يسيرة أو جاوز الأمد الذي تكاراها إليه بيسير ، ثم رجع بها سالمة إلى موضع تكاراها إليه فماتت ، أو ماتت في الطريق إلى الموضع الذي تكاراها إليه ، فليس له إلا كراء الزيادة ، كرده لما تسلف من الوديعة . ولو زاد كثيرا مما فيه مقام الأيام الكثيرة التي يتغير في مثلها سوقها فهو ضامن ، كما لو ماتت في مجاوزة الأمد أو المسافة ; لإنه إذا كانت زيادة يسيرة مما يعلم أن ذلك مما لم يعن على قتلها فهلاكها بعد ردها إلى الموضع المأذون له فيه كهلاك ما تسلف من الوديعة بعد رده لا محالة . وإن كانت الزيادة كثيرة فتلك الزيادة قد أعانت على قتلها .\nالخامسة : قال ابن القاسم وابن وهب قال مالك قال الله - تعالى - : والخيل والبغال والحمير لتركبوها وزينة فجعلها للركوب والزينة ولم يجعلها للأكل ; ونحوه عن أشهب . ولهذا قال أصحابنا : لا يجوز أكل لحوم الخيل والبغال والحمير ; لأن الله - تعالى - لما نص على الركوب والزينة دل على أن ما عداه بخلافه . وقال في [ الأنعام ] ومنها تأكلون مع ما امتن الله منها من الدفء والمنافع ، فأباح لنا أكلها بالذكاة المشروعة فيها . وبهذه الآية احتج ابن عباس والحكم بن عيينة ، قال الحكم : لحوم الخيل حرام في كتاب الله ، وقرأ هذه الآية والتي قبلها وقال : هذه للأكل وهذه للركوب . وسئل ابن عباس عن لحوم الخيل فكرهها ، وتلا هذه الآية وقال : هذه للركوب ، وقرأ الآية التي قبلها والأنعام خلقها لكم فيها دفء ومنافع ثم قال : هذه للأكل . وبه قال مالك وأبو حنيفة وأصحابهما والأوزاعي ومجاهد وأبو عبيد وغيرهم ، واحتجوا بما خرجه أبو داود والنسائي والدارقطني وغيرهم عن صالح بن يحيى بن المقدام بن معديكرب عن أبيه عن جده عن خالد بن الوليد ، أن رسول الله - صلى الله عليه وسلم - نهى يوم خيبر عن أكل لحوم الخيل والبغال والحمير ، وكل ذي ناب من السباع أو مخلب من الطير . لفظ الدارقطني . وعند النسائي أيضا عن خالد بن الوليد أنه سمع النبي - صلى الله عليه وسلم - يقول : لا يحل أكل لحوم الخيل والبغال والحمير . وقال الجمهور من الفقهاء والمحدثين : هي مباحة . وروي عن أبي حنيفة . وشذت طائفة فقالت بالتحريم ; منهم الحكم كما ذكرنا ، وروي عن أبي حنيفة . حكى الثلاث روايات عنه الروياني في بحر المذهب على مذهب الشافعي .\nقلت : الصحيح الذي يدل عليه النظر والخبر جواز أكل لحوم الخيل ، وأن الآية والحديث لا حجة فيهما لازمة . أما الآية فلا دليل فيها على تحريم الخيل . إذ لو دلت عليه لدلت على تحريم لحوم الحمر ، والسورة مكية ، وأي حاجة كانت إلى تجديد تحريم لحوم الحمر عام خيبر وقد ثبت في الأخبار تحليل الخيل على ما يأتي . وأيضا لما ذكر - تعالى - الأنعام ذكر الأغلب من منافعها وأهم ما فيها ، وهو حمل الأثقال والأكل ، ولم يذكر الركوب ولا الحرث بها ولا غير ذلك مصرحا به ، وقد تركب ويحرث بها ; قال الله - تعالى - : الذي جعل لكم الأنعام لتركبوا منها ومنها تأكلون . وقال في الخيل : لتركبوها وزينة فذكر أيضا أغلب منافعها والمقصود منها ، ولم يذكر حمل الأثقال عليها ، وقد تحمل كما هو مشاهد فلذلك لم يذكر الأكل . وقد بينه - عليه السلام - الذي جعل إليه بيان ما أنزل عليه ما يأتي ، ولا يلزم من كونها خلقت للركوب والزينة ألا تؤكل ، فهذه البقرة قد أنطقها خالقها الذي أنطق كل شيء فقالت : إنما خلقت للحرث . فيلزم من علل أن الخيل لا تؤكل لأنها خلقت للركوب ألا تؤكل البقر لأنها خلقت للحرث . وقد أجمع المسلمون على جواز أكلها ، فكذلك الخيل بالسنة الثابتة فيها . روى مسلم من حديث جابر قال : نهى رسول الله - صلى الله عليه وسلم - يوم خيبر عن لحوم الحمر الأهلية وأذن في لحوم الخيل . وقال النسائي عن جابر : أطعمنا رسول الله - صلى الله عليه وسلم - يوم خيبر لحوم الخيل ونهانا عن لحوم الحمر . وفي رواية عن جابر قال : كنا نأكل لحوم الخيل على عهد رسول الله - صلى الله عليه وسلم - . فإن قيل : الرواية عن جابر بأنهم أكلوها في خيبر حكاية حال وقضية في عين ، فيحتمل أن يكونوا ذبحوا لضرورة ، ولا يحتج بقضايا الأحوال . قلنا : الرواية عنجابر وإخباره بأنهم كانوا يأكلون لحوم الخيل على عهد رسول الله - صلى الله عليه وسلم - يزيل ذلك الاحتمال ، ولئن سلمناه فمعنا حديث أسماء قالت : نحرنا فرسا على عهد رسول الله - صلى الله عليه وسلم - ونحن بالمدينة فأكلناه ; رواه مسلم . وكل تأويل من غير ترجيح في مقابلة النص فإنما هو دعوى ، لا يلتفت إليه ولا يعرج عليه . وقد روى الدارقطني زيادة حسنة ترفع كل تأويل في حديث أسماء ، قالت أسماء : كان لنا فرس على عهد رسول الله - صلى الله عليه وسلم - أرادت أن تموت فذبحناها فأكلناها . فذبحها إنما كان لخوف الموت عليها لا لغير ذلك من الأحوال . وبالله التوفيق . فإن قيل : حيوان من ذوات الحوافر فلا يؤكل كالحمار ؟ قلنا : هذا قياس الشبه وقد اختلف أرباب الأصول في القول به ، ولئن سلمناه فهو منتقض بالخنزير ; فإنه ذو ظلف وقد باين ذوات الأظلاف ، وعلى أن القياس إذا كان في مقابلة النص فهو فاسد الوضع لا التفات إليه . قال الطبري : وفي إجماعهم على جواز ركوب ما ذكر للأكل دليل على جواز أكل ما ذكر للركوب .\nالسادسة : وأما البغال فإنها تلحق بالحمير ، إن قلنا إن الخيل لا تؤكل ; فإنها تكون متولدة من عينين لا يؤكلان . وإن قلنا إن الخيل تؤكل ، فإنها عين متولدة من مأكول وغير مأكول فغلب التحريم على ما يلزم في الأصول . وكذلك ذبح المولود بين كافرين أحدهما من أهل الذكاة والآخر ليس من أهلها ، لا تكون ذكاة ولا تحل به الذبيحة . وقد مضى في \" الأنعام \" الكلام في تحريم الحمر فلا معنى للإعادة وقد علل تحريم أكل الحمار بأنه أبدى جوهره الخبيث حيث نزا على ذكر وتلوط ; فسمي رجسا .\nالسابعة : في الآية دليل على أن الخيل لا زكاة فيها ; لأن الله سبحانه من علينا بما أباحنا منها وكرمنا به من منافعها ، فغير جائز أن يلزم فيها كلفة إلا بدليل . وقد روى مالك عن عبد الله بن دينار عن سليمان بن يسار عن عراك بن مالك عن أبي هريرة أن رسول الله - صلى الله عليه وسلم - قال : ليس على المسلم في عبده ولا فرسه صدقة . وروى أبو داود عن أبي هريرة عن رسول الله - صلى الله عليه وسلم - قال : ليس في الخيل والرقيق زكاة إلا زكاة الفطر في الرقيق . وبه قال مالك والشافعي والأوزاعي والليث وأبو يوسف ومحمد . وقال أبو حنيفة : إن كانت إناثا كلها أو ذكورا وإناثا ، ففي كل فرس دينار إذا كانت سائمة ، وإن شاء قومها فأخرج عن كل مائتي درهم خمسة دراهم . واحتج بأثر عن النبي - صلى الله عليه وسلم - أنه قال : في الخيل السائمة في كل فرس دينار وبقوله - صلى الله عليه وسلم - : الخيل ثلاثة . . . الحديث . وفيه : ولم ينس حق الله في رقابها ولا ظهورها . والجواب عن الأول أنه حديث لم يروه إلا غورك السعدي عن جعفر عن محمد عن أبيه عن جابر . قال الدارقطني : تفرد به غورك عن جعفر وهو ضعيف جدا ، ومن دونه ضعفاء . وأما الحديث فالحق المذكور فيه هو الخروج عليها إذا وقع النفير وتعين بها لقتال العدو إذا تعين ذلك عليه ، ويحمل المنقطعين عليها إذا احتاجوا لذلك ، وهذا واجب عليه إذا تعين ذلك ، كما يتعين عليه أن يطعمهم عند الضرورة ، فهذه حقوق الله في رقابها . فإن قيل : هذا هو الحق الذي في ظهورها وبقي الحق الذي في رقابها ; قيل : قد روي لا ينسى حق الله فيها ولا فرق بين قوله : حق الله فيها أو في رقابها وظهورها فإن المعنى يرجع إلى شيء واحد ; لأن الحق يتعلق بجملتها . وقد قال جماعة من العلماء : إن الحق هنا حسن ملكها وتعهد شبعها والإحسان إليها وركوبها غير مشقوق عليها ; كما جاء في الحديث لا تتخذوا ظهورها كراسي . وإنما خص رقابها بالذكر لأن الرقاب والأعناق تستعار كثيرا في مواضع الحقوق اللازمة والفروض الواجبة ; ومنه قوله - تعالى - : فتحرير رقبة مؤمنة وكثر عندهم استعمال ذلك واستعارته حتى جعلوه في الرباع والأموال ; ألا ترى قول كثير :\nغمر الرداء إذا تبسم ضاحكا غلقت لضحكته رقاب المال\nوأيضا فإن الحيوان الذي تجب فيه الزكاة له نصاب من جنسه ، ولما خرجت الخيل عن ذلك علمنا سقوط الزكاة فيها . وأيضا فإيجابه الزكاة في إناثها منفردة دون الذكور تناقض منه . وليس في الحديث فصل بينهما . ونقيس الإناث على الذكور في نفي الصدقة بأنه حيوان مقتنى لنسله لا لدره ، ولا تجب الزكاة في ذكوره فلم تجب في إناثه كالبغال والحمير . وقد روي عنه أنه لا زكاة في إناثها وإن انفردت كذكورها منفردة ، وهذا الذي عليه الجمهور . قال ابن عبد البر : الخبر في صدقة الخيل عن عمر صحيح من حديث الزهري وغيره . وقد روي من حديث مالك ، ورواه عنه جويرية عن الزهري أن السائب بن يزيد قال : لقد رأيت أبي يقوم الخيل ثم يدفع صدقتها إلى عمر . وهذا حجة لأبي حنيفة وشيخه حماد بن أبي سليمان ، لا أعلم أحدا من فقهاء الأمصار أوجب الزكاة في الخيل غيرهما . تفرد به جويرية عن مالك وهو ثقة .\nالثامنة : قوله - تعالى - : وزينة منصوب بإضمار فعل ، المعنى : وجعلها زينة . وقيل : هو مفعول من أجله . والزينة : ما يتزين به ، وهذا الجمال والتزيين وإن كان من متاع الدنيا فقد أذن الله سبحانه لعباده فيه ; قال النبي - صلى الله عليه وسلم - : الإبل عز لأهلها والغنم بركة والخيل في نواصيها الخير . خرجه البرقاني وابن ماجه في السنن . وقد تقدم في الأنعام وإنما جمع النبي - صلى الله عليه وسلم - العز في الإبل ; لأن فيها اللباس والأكل واللبن والحمل والغزو وإن نقصها الكر والفر وجعل البركة في الغنم لما فيها من اللباس والطعام والشراب وكثرة الأولاد ; فإنها تلد في العام ثلاث مرات إلى ما يتبعها من السكينة ، وتحمل صاحبها عليه من خفض الجناح ولين الجانب ; بخلاف الفدادين أهل الوبر . وقرن النبي - صلى الله عليه وسلم - الخير بنواصي الخيل بقية الدهر لما فيها من الغنيمة المستفادة للكسب والمعاش ، وما يوصل إليه من قهر الأعداء وغلب الكفار وإعلاء كلمة الله - تعالى - .\nقوله تعالى : ويخلق ما لا تعلمون قال الجمهور : من الخلق . وقيل : من أنواع الحشرات والهوام في أسافل الأرض والبر والبحر مما لم يره البشر ولم يسمعوا به . وقيل : ويخلق ما لا تعلمون \" مما أعد الله في الجنة لأهلها وفي النار لأهلها ، مما لم تره عين ولم تسمع به أذن ولا خطر على قلب بشر . وقال قتادة والسدي : هو خلق السوس في الثياب والدود في الفواكه . ابن عباس : عين تحت العرش ; حكاه الماوردي . الثعلبي : وقال ابن عباس عن يمين العرش نهر من النور مثل السماوات السبع والأرضين السبع والبحار السبع سبعين مرة ، يدخله جبريل كل سحر فيغتسل فيزداد نورا إلى نوره وجمالا إلى جماله وعظما إلى عظمه ، ثم ينتفض فيخرج الله من كل ريشة سبعين ألف قطرة ، ويخرج من كل قطرة سبعة آلاف ملك ، يدخل منهم كل يوم سبعون ألف ملك إلى البيت المعمور ، وفي الكعبة سبعون ألفا لا يعودون إليه إلى يوم القيامة . وقول خامس : وهو ما روي عن النبي - صلى الله عليه وسلم - أنها أرض بيضاء ، مسيرة الشمس ثلاثين يوما مشحونة خلقا لا يعلمون أن الله - تعالى - يعصى في الأرض ، قالوا : يا رسول الله ، من ولد آدم ؟ قال : لا يعلمون أن الله خلق آدم . قالوا : يا رسول الله ، فأين إبليس منهم ؟ قال : لا يعلمون أن الله خلق إبليس - ثم تلا ويخلق ما لا تعلمون ذكره الماوردي .\nقلت : ومن هذا المعنى ما ذكر البيهقي عن الشعبي قال : إن لله عبادا من وراء الأندلس كما بيننا وبين الأندلس ، ما يرون أن الله عصاه مخلوق ، رضراضهم الدر والياقوت وجبالهم الذهب والفضة ، لا يحرثون ولا يزرعون ولا يعملون عملا ، لهم شجر على أبوابهم لها ثمر هي طعامهم وشجر لها أوراق عراض هي لباسهم ; ذكره في بدء الخلق من \" كتاب الأسماء والصفات \" . وخرج من حديث موسى بن عقبة عن محمد بن المنكدر عن جابر بن عبد الله الأنصاري أنه قال : قال رسول الله - صلى الله عليه وسلم - : أذن لي أن أحدث عن ملك من ملائكة الله من حملة العرش ما بين شحمة أذنه إلى عاتقه مسيرة سبعمائة عام .\n                                    ",
        "saadi": "وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ ٨\n                                        \n                                        \n                                        \n                                        { وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ } سخرناها لكم { لِتَرْكَبُوهَا وَزِينَةً } أي: تارة تستعملونها للضرورة في الركوب وتارة لأجل الجمال والزينة، ولم يذكر الأكل لأن البغال والحمر محرم أكلها، والخيل لا تستعمل -في الغالب- للأكل، بل ينهى عن ذبحها لأجل الأكل خوفا من انقطاعها وإلا فقد ثبت في الصحيحين، أن النبي صلى الله عليه وسلم أذن في لحوم الخيل.{ وَيَخْلُقُ مَا لَا تَعْلَمُونَ } مما يكون بعد نزول القرآن من الأشياء، التي يركبها الخلق في البر والبحر والجو، ويستعملونها في منافعهم ومصالحهم، فإنه لم يذكرها بأعيانها، لأن الله تعالى لا يذكر في كتابه إلا ما يعرفه العباد، أو يعرفون نظيره، وأما ما ليس له نظير في زمانهم فإنه لو ذكر لم يعرفوه ولم يفهموا المراد منه، فيذكر أصلا جامعا يدخل فيه ما يعلمون وما لا يعلمون، كما ذكر نعيم الجنة وسمى منه ما نعلم ونشاهد نظيره، كالنخل والأعناب والرمان، وأجمل ما لا نعرف له نظيرا في قوله: { فِيهِمَا مِنْ كُلِّ فَاكِهَةٍ زَوْجَان } فكذلك هنا ذكر ما نعرفه من المراكب كالخيل والبغال والحمير والإبل والسفن، وأجمل الباقي في قوله: { وَيَخْلُقُ مَا لَا تَعْلَمُونَ } ولما ذكر تعالى الطريق الحسي، وأن الله قد جعل للعباد ما يقطعونه به من الإبل وغيرها ذكر الطريق المعنوي الموصل إليه\n                                    "
      },
      "originalText": "وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ ٨"
    },
    {
      "number": 1910,
      "text": "وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ وَمِنْهَا جَائِرٌ ۚ وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 9,
      "juz": 14,
      "manzil": 3,
      "page": 268,
      "ruku": 224,
      "hizbQuarter": 107,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ وَمِنۡهَا جَآئِرٞۚ وَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ ٩\n                                    \n                                    \n                                    لما ذكر تعالى من الحيوانات ما يسار عليه في السبل الحسية ، نبه على الطرق المعنوية الدينية ، وكثيرا ما يقع في القرآن العبور من الأمور الحسية إلى الأمور المعنوية النافعة الدينية ، كما قال تعالى : ( وتزودوا فإن خير الزاد التقوى ) [ البقرة : 197 ] وقال : ( يا بني آدم قد أنزلنا عليكم لباسا يواري سوآتكم وريشا ولباس التقوى ذلك خير ) [ الأعراف : 26 ] .\nولما ذكر في هذه السورة الحيوانات من الأنعام وغيرها ، التي يركبونها ويبلغون عليها حاجة في صدورهم ، وتحمل أثقالهم إلى البلاد والأماكن البعيدة والأسفار الشاقة - شرع في ذكر الطرق التي يسلكها الناس إليه ، فبين أن الحق منها ما هي موصلة إليه ، فقال : ( وعلى الله قصد السبيل ) كما قال : ( وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله ) [ الأنعام : 153 ] وقال : ( هذا صراط علي مستقيم ) [ الحجر : 41 ] .\nقال مجاهد : في [ قوله ] : ( وعلى الله قصد السبيل ) قال : طريق الحق على الله .\nوقال السدي : ( وعلى الله قصد السبيل ) قال : الإسلام .\nوقال العوفي عن ابن عباس في قوله : ( وعلى الله قصد السبيل ) يقول : وعلى الله البيان ، أي : تبين الهدى والضلال .\nوكذا روى علي بن أبي طلحة ، عنه . وكذا قال قتادة ، والضحاك . وقول مجاهد هاهنا أقوى من حيث السياق ; لأنه تعالى أخبر أن ثم طرقا تسلك إليه ، فليس يصل إليه منها إلا طريق الحق ، وهي الطريق التي شرعها ورضيها وما عداها مسدودة ، والأعمال فيها مردودة ; ولهذا قال تعالى : ( ومنها جائر ) أي : حائد مائل زائغ عن الحق .\nقال ابن عباس وغيره : هي الطرق المختلفة ، والآراء والأهواء المتفرقة ، كاليهودية والنصرانية والمجوسية ، وقرأابن مسعود : \" ومنكم جائر \" .\nثم أخبر أن ذلك كله كائن عن قدرته ومشيئته ، فقال : ( ولو شاء لهداكم أجمعين ) كما قال : ( ولو شاء ربك لآمن من في الأرض كلهم جميعا ) [ يونس : 99 ] وقال : ( ولو شاء ربك لجعل الناس أمة واحدة ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم وتمت كلمة ربك لأملأن جهنم من الجنة والناس أجمعين ) [ هود : 118 ، 119 ] .\n                                    ",
        "qortoby": "وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ وَمِنۡهَا جَآئِرٞۚ وَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ ٩\n                                    \n                                    \n                                    قوله تعالى : وعلى الله قصد السبيل ومنها جائر ولو شاء لهداكم أجمعين قوله تعالى : وعلى الله قصد السبيل أي على الله بيان قصد السبيل ، فحذف المضاف وهو البيان . والسبيل : الإسلام ، أي على الله بيانه بالرسل والحجج والبراهين . وقصد السبيل : استعانة الطريق ; يقال : طريق قاصد أي يؤدي إلى المطلوب .\nومنها جائر أي ومن السبيل جائر ; أي عادل عن الحق فلا يهتدى به ; ومنه قول امرئ القيس :\nومن الطريقة جائر وهدى قصد السبيل ومنه ذو دخل\nوقال طرفة :\nعدولية أو من سفين ابن يامن يجور بها الملاح طورا ويهتدي\nالعدولية سفينة منسوبة إلى عدولى قرية بالبحرين . والعدولي : الملاح ; قاله في الصحاح . وفي التنزيل وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل . وقد تقدم وقيل : المعنى ومنهم جائر عن سبيل الحق ، أي عادل عنه فلا يهتدي إليه . وفيهم قولان : أحدهما : أنهم أهل الأهواء المختلفة ; قاله ابن عباس . الثاني : ملل الكفر من اليهودية والمجوسية والنصرانية . وفي مصحف عبد الله \" ومنكم جائر \" وكذا قرأ علي \" ومنكم \" بالكاف . وقيل : المعنى وعنها جائر ; أي عن السبيل . ف \" من \" بمعنى عن . وقال ابن عباس : أي من أراد الله أن يهديه سهل له طريق الإيمان ، ومن أراد أن يضله ثقل عليه الإيمان وفروعه . وقيل : معنى قصد السبيل مسيركم ورجوعكم . والسبيل واحدة بمعنى الجمع ، ولذلك أنث الكناية فقال : ومنها والسبيل مؤنثة في لغةأهل الحجاز .\nقوله تعالى : ولو شاء لهداكم أجمعين بين أن المشيئة لله - تعالى - ، وهو يصحح ما ذهب إليه ابن عباس في تأويل الآية ، ويرد على القدرية ومن وافقها كما تقدم .\n                                    ",
        "saadi": "وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ وَمِنۡهَا جَآئِرٞۚ وَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ ٩\n                                        \n                                        \n                                        \n                                        { وَعَلَى اللَّهِ قَصْدُ السَّبِيلِ } أي: الصراط المستقيم، الذي هو أقرب الطرق وأخصرها موصل إلى الله.\nوأما الطريق الجائر في عقائده وأعماله وهو: كل ما خالف الصراط المستقيم فهو قاطع عن الله، موصل إلى دار الشقاء، فسلك المهتدون الصراط المستقيم بإذن ربهم، وضل الغاوون عنه، وسلكوا الطرق الجائرة { وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ } ولكنه هدى بعضا كرما وفضلا، ولم يهد آخرين، حكمة منه وعدلا.\n                                    "
      },
      "originalText": "وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِيلِ وَمِنۡهَا جَآئِرٞۚ وَلَوۡ شَآءَ لَهَدَىٰكُمۡ أَجۡمَعِينَ ٩"
    },
    {
      "number": 1911,
      "text": "هُوَ الَّذِي أَنْزَلَ مِنَ السَّمَاءِ مَاءً ۖ لَكُمْ مِنْهُ شَرَابٌ وَمِنْهُ شَجَرٌ فِيهِ تُسِيمُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 10,
      "juz": 14,
      "manzil": 3,
      "page": 268,
      "ruku": 225,
      "hizbQuarter": 107,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗۖ لَّكُم مِّنۡهُ شَرَابٞ وَمِنۡهُ شَجَرٞ فِيهِ تُسِيمُونَ ٠١\n                                    \n                                    \n                                    لما ذكر سبحانه ما أنعم به عليهم من الأنعام والدواب ، شرع في ذكر نعمته عليهم في إنزال المطر من السماء - وهو العلو - مما لهم فيه بلغة ومتاع لهم ولأنعامهم ، فقال : ( لكم منه شراب ) أي : جعله عذبا زلالا يسوغ لكم شرابه ، ولم يجعله ملحا أجاجا .\n( ومنه شجر فيه تسيمون ) أي : وأخرج لكم به شجرا ترعون فيه أنعامكم . كما قال ابن عباس ، وعكرمة والضحاك ، وقتادة وابن زيد في قوله : ( فيه تسيمون ) أي : ترعون .\nومنه الإبل السائمة ، والسوم : الرعي .\nوروى ابن ماجه : أن رسول الله - صلى الله عليه وسلم - نهى عن السوم قبل طلوع الشمس .\n                                    ",
        "qortoby": "هُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗۖ لَّكُم مِّنۡهُ شَرَابٞ وَمِنۡهُ شَجَرٞ فِيهِ تُسِيمُونَ ٠١\n                                    \n                                    \n                                    قوله تعالى : هو الذي أنزل من السماء ماء لكم منه شراب ومنه شجر فيه تسيمون الشراب ما يشرب ، والشجر معروف . أي ينبت من الأمطار أشجارا وعروشا ونباتا . وتسيمون ترعون إبلكم ; يقال : سامت السائمة تسوم سوما أي رعت ، فهي سائمة . والسوام والسائم بمعنى ، وهو المال الراعي . وجمع السائم والسائمة سوائم . وأسمتها أنا أي أخرجتها إلى الرعي ، فأنا مسيم وهي مسامة وسائمة . قال :\nأولى لك ابن مسيمة الأجمال\nوأصل السوم الإبعاد في المرعى . وقال الزجاج : أخذ من السومة وهي العلامة ; أي أنها تؤثر في الأرض علامات برعيها ، أو لأنها تعلم للإرسال في المرعى .\nقلت : والخيل المسومة تكون المرعية . وتكون المعلمة . وقوله : مسومين قال الأخفش تكون معلمين وتكون مرسلين ; من قولك : سوم فيها الخيل أي أرسلها ، ومنه السائمة ، وإنما جاء بالياء والنون لأن الخيل سومت وعليها ركبانها .\n                                    ",
        "saadi": "هُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗۖ لَّكُم مِّنۡهُ شَرَابٞ وَمِنۡهُ شَجَرٞ فِيهِ تُسِيمُونَ ٠١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 10 و11:ـ\nبذلك على كمال قدرة الله الذي أنزل هذا الماء من السحاب الرقيق اللطيف ورحمته حيث جعل فيه ماء غزيرا منه يشربون وتشرب مواشيهم ويسقون منه حروثهم فتخرج لهم الثمرات الكثيرة والنعم الغزيرة.\n                                    "
      },
      "originalText": "هُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗۖ لَّكُم مِّنۡهُ شَرَابٞ وَمِنۡهُ شَجَرٞ فِيهِ تُسِيمُونَ ٠١"
    },
    {
      "number": 1912,
      "text": "يُنْبِتُ لَكُمْ بِهِ الزَّرْعَ وَالزَّيْتُونَ وَالنَّخِيلَ وَالْأَعْنَابَ وَمِنْ كُلِّ الثَّمَرَاتِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَتَفَكَّرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 11,
      "juz": 14,
      "manzil": 3,
      "page": 268,
      "ruku": 225,
      "hizbQuarter": 107,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّيۡتُونَ وَٱلنَّخِيلَ وَٱلۡأَعۡنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ ١١\n                                    \n                                    \n                                    وقوله : ( ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات ) أي : يخرجها من الأرض بهذا الماء الواحد ، على اختلاف صنوفها وطعومها وألوانها وروائحها وأشكالها ; ولهذا قال : ( إن في ذلك لآية لقوم يتفكرون ) أي : دلالة وحجة على أنه لا إله إلا الله ، كما قال تعالى : ( أم من خلق السماوات والأرض وأنزل لكم من السماء ماء فأنبتنا به حدائق ذات بهجة ما كان لكم أن تنبتوا شجرها أإله مع الله بل هم قوم يعدلون ) [ النمل : 60 ]\nثم قال تعالى :\n                                    ",
        "qortoby": "يُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّيۡتُونَ وَٱلنَّخِيلَ وَٱلۡأَعۡنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات إن في ذلك لآية لقوم يتفكرون قوله تعالى : ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات قرأ أبو بكر عن عاصم \" ننبت \" بالنون على التعظيم . العامة بالياء على معنى ينبت الله لكم ; يقال : نبتت الأرض وأنبتت بمعنى ، ونبت البقل وأنبت بمعنى . وأنشد الفراء :\nرأيت ذوي الحاجات حول بيوتهم قطينا بها حتى إذا أنبت البقل\nأي نبت . وأنبته الله فهو منبوت ، على غير قياس . وأنبت الغلام نبتت عانته . ونبت الشجر غرسه ; يقال : نبت أجلك بين عينيك . ونبت الصبي تنبيتا ربيته . والمنبت موضع النبات ; يقال : ما أحسن نابتة بني فلان ; أي ما ينبت عليه أموالهم وأولادهم . ونبتت لهم نابتة إذا نشأ لهم نشء صغار . وإن بني فلان لنابتة شر . والنوابت من الأحداث الأغمار . والنبيت حي من اليمن . والينبوت شجر ; كله عن الجوهري . والزيتون جمع زيتونة . ويقال للشجرة نفسها : زيتونة ، وللثمرة زيتونة . وقد مضى في سورة \" الأنعام \" حكم زكاة هذه الثمار فلا معنى للإعادة .\nإن في ذلك أي الإنزال والإنبات .\nلآية أي دلالة لقوم يتفكرون .\n                                    ",
        "saadi": "يُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّيۡتُونَ وَٱلنَّخِيلَ وَٱلۡأَعۡنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ ١١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 10 و11:ـ\nبذلك على كمال قدرة الله الذي أنزل هذا الماء من السحاب الرقيق اللطيف ورحمته حيث جعل فيه ماء غزيرا منه يشربون وتشرب مواشيهم ويسقون منه حروثهم فتخرج لهم الثمرات الكثيرة والنعم الغزيرة.\n                                    "
      },
      "originalText": "يُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّيۡتُونَ وَٱلنَّخِيلَ وَٱلۡأَعۡنَٰبَ وَمِن كُلِّ ٱلثَّمَرَٰتِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ ١١"
    },
    {
      "number": 1913,
      "text": "وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ ۖ وَالنُّجُومُ مُسَخَّرَاتٌ بِأَمْرِهِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 12,
      "juz": 14,
      "manzil": 3,
      "page": 268,
      "ruku": 225,
      "hizbQuarter": 107,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٢١\n                                    \n                                    \n                                    ينبه تعالى عباده على آياته العظام ، ومننه الجسام ، في تسخيره الليل والنهار يتعاقبان ، والشمس والقمر يدوران ، والنجوم الثوابت والسيارات ، في أرجاء السموات نورا وضياء لمهتدين بها في الظلمات ، وكل منها يسير في فلكه الذي جعله الله تعالى فيه ، يسير بحركة مقدرة ، لا يزيد عليها ولا ينقص منها ، والجميع تحت قهره وسلطانه وتسخيره وتقديره وتسييره ، كما قال : ( إن ربكم الله الذي خلق السماوات والأرض في ستة أيام ثم استوى على العرش يغشي الليل النهار يطلبه حثيثا والشمس والقمر والنجوم مسخرات بأمره ألا له الخلق والأمر تبارك الله رب العالمين ) [ الأعراف : 54 ] ; ولهذا قال : ( إن في ذلك لآيات لقوم يعقلون ) أي : لدلالات على قدرته الباهرة وسلطانه العظيم ، لقوم يعقلون عن الله ويفهمون حججه .\n\n                                    ",
        "qortoby": "وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٢١\n                                    \n                                    \n                                    قوله تعالى : وسخر لكم الليل والنهار والشمس والقمر والنجوم مسخرات بأمره إن في ذلك لآيات لقوم يعقلون قوله تعالى : وسخر لكم الليل والنهار أي للسكون والأعمال ; كما قال : ومن رحمته جعل لكم الليل والنهار لتسكنوا فيه ولتبتغوا من فضله .\nوالشمس والقمر والنجوم مسخرات بأمره أي مذللات لمعرفة الأوقات ونضج الثمار والزرع والاهتداء بالنجوم في الظلمات . وقرأ ابن عامر وأهل الشام والشمس والقمر والنجوم مسخرات بالرفع على الابتداء والخبر . الباقون بالنصب عطفا على ما قبله . وقرأ حفص عن عاصم برفع \" والنجوم \" ، مسخرات خبره . وقرئ والشمس والقمر والنجوم بالنصب . مسخرات بالرفع ، وهو خبر ابتداء محذوف أي هي مسخرات ، وهي في قراءة من نصبها حال مؤكدة ; كقوله : وهو الحق مصدقا .\nإن في ذلك لآيات لقوم يعقلون أي يعقلون عن الله ما نبههم عليه ووفقهم له .\n                                    ",
        "saadi": "وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٢١\n                                        \n                                        \n                                        \n                                        أي: سخر لكم هذه الأشياء لمنافعكم وأنواع مصالحكم بحيث لا تستغنون عنها أبدا، فبالليل تسكنون وتنامون وتستريحون، وبالنهار تنتشرون في معايشكم ومنافع دينكم ودنياكم، وبالشمس والقمر من الضياء والنور والإشراق، وإصلاح الأشجار والثمار والنبات، وتجفيف الرطوبات، وإزالة البرودة الضارة للأرض، وللأبدان، وغير ذلك من الضروريات والحاجيات التابعة لوجود الشمس والقمر.\nوفيهما وفي النجوم من الزينة للسماء والهداية في ظلمات البر والبحر، ومعرفة الأوقات وحساب الأزمنة ما تتنوع دلالاتها وتتصرف آياتها، ولهذا جمعها في قوله { إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ } أي: لمن لهم عقول يستعملونها في التدبر والتفكر فيما هي مهيأة له مستعدة تعقل ما تراه وتسمعه، لا كنظر الغافلين الذين حظهم من النظر حظ البهائم التي لا عقل لها.\n                                    "
      },
      "originalText": "وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَٰتُۢ بِأَمۡرِهِۦٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَعۡقِلُونَ ٢١"
    },
    {
      "number": 1914,
      "text": "وَمَا ذَرَأَ لَكُمْ فِي الْأَرْضِ مُخْتَلِفًا أَلْوَانُهُ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَذَّكَّرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 13,
      "juz": 14,
      "manzil": 3,
      "page": 268,
      "ruku": 225,
      "hizbQuarter": 107,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَٰنُهُۥٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَذَّكَّرُونَ ٣١\n                                    \n                                    \n                                    وقوله : ( وما ذرأ لكم في الأرض مختلفا ألوانه ) لما نبه سبحانه على معالم السماوات ، نبه على ما خلق في الأرض من الأمور العجيبة والأشياء المختلفة ، من الحيوانات والمعادن والنباتات [ والجمادات ] على اختلاف ألوانها وأشكالها ، وما فيها من المنافع والخواص ( إن في ذلك لآية لقوم يذكرون ) أي : آلاء الله ونعمه فيشكرونها .\n                                    ",
        "qortoby": "وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَٰنُهُۥٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَذَّكَّرُونَ ٣١\n                                    \n                                    \n                                    قوله تعالى : وما ذرأ لكم في الأرض مختلفا ألوانه إن في ذلك لآية لقوم يذكرون فيه ثلاث مسائل :\nالأولى : قوله تعالى : وما ذرأ أي وسخر ما ذرأ في الأرض لكم . ذرأ أي خلق ; ذرأ الله الخلق يذرؤهم ذرءا خلقهم ، فهو ذارئ ; ومنه الذرية وهي نسل الثقلين ، إلا أن العرب تركت همزها ، والجمع الذراري . يقال : أنمى الله ذرأك وذروك ، أي ذريتك . وأصل الذرو والذرء التفريق عن جمع . وفي الحديث : ذرء النار ; أي أنهم خلقوا لها .\nالثانية : ما ذرأه الله سبحانه منه مسخر مذلل كالدواب والأنعام والأشجار وغيرها ، ومنه غير ذلك . والدليل عليه ما رواه مالك في الموطأ عن كعب الأحبار قال : لولا كلمات أقولهن لجعلتني يهود حمارا . فقيل له : وما هن ؟ فقال : أعوذ بوجه الله العظيم الذي ليس شيء أعظم منه ، وبكلمات الله التامات التي لا يجاوزهن بر ولا فاجر ، وبأسماء الله الحسنى كلها ما علمت منها وما لم أعلم ، من شر ما خلق وبرأ وذرأ . وفيه عن يحيى بن سعيد أنه قال : أسري برسول الله - صلى الله عليه وسلم - فرأى عفريتا من الجن يطلبه بشعلة من نار ، الحديث . وفيه : وشر ما ذرأ في الأرض . وقد ذكرناه وما في معناه في غير هذا الموضع .\nالثالثة : قوله تعالى : مختلفا ألوانه مختلفا نصب على الحال . وألوانه هيئاته ومناظره ، يعني الدواب والشجر وغيرها .\nإن في ذلك أي في اختلاف ألوانها .\nلآية أي لعبرة .\nلقوم يذكرون أي يتعظون ويعلمون أن في تسخير هذه المكونات لعلامات على وحدانية الله - تعالى - ، وأنه لا يقدر على ذلك أحد غيره .\n                                    ",
        "saadi": "وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَٰنُهُۥٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَذَّكَّرُونَ ٣١\n                                        \n                                        \n                                        \n                                        أي: فيما ذرأ الله ونشر للعباد من كل ما على وجه الأرض، من حيوان وأشجار ونبات، وغير ذلك، مما تختلف ألوانه، وتختلف منافعه، آية على كمال قدرة الله وعميم إحسانه، وسعة بره، وأنه الذي لا تنبغي العبادة إلا له وحده لا شريك له، { لِقَوْمٍ يَذَّكَّرُونَ } أي: يستحضرون في ذاكرتهم ما ينفعهم من العلم النافع، ويتأملون ما دعاهم الله إلى التأمل فيه حتى يتذكروا بذلك ما هو دليل عليه.\n                                    "
      },
      "originalText": "وَمَا ذَرَأَ لَكُمۡ فِي ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَٰنُهُۥٓۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَذَّكَّرُونَ ٣١"
    },
    {
      "number": 1915,
      "text": "وَهُوَ الَّذِي سَخَّرَ الْبَحْرَ لِتَأْكُلُوا مِنْهُ لَحْمًا طَرِيًّا وَتَسْتَخْرِجُوا مِنْهُ حِلْيَةً تَلْبَسُونَهَا وَتَرَى الْفُلْكَ مَوَاخِرَ فِيهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 14,
      "juz": 14,
      "manzil": 3,
      "page": 268,
      "ruku": 225,
      "hizbQuarter": 107,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَهُوَ ٱلَّذِي سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُواْ مِنۡهُ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُواْ مِنۡهُ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ ٤١\n                                    \n                                    \n                                    يخبر تعالى عن تسخيره البحر المتلاطم الأمواج ، ويمتن على عباده بتذليله لهم ، وتيسيره للركوب فيه ، وجعله السمك والحيتان فيه ، وإحلاله لعباده لحمها حيها وميتها ، في الحل والإحرام وما يخلقه فيه من اللآلئ والجواهر النفيسة ، وتسهيله للعباد استخراجها من قرارها حلية يلبسونها ، وتسخيره البحر لحمل السفن التي تمخره ، أي : تشقه .\nوقيل : تمخر الرياح ، وكلاهما صحيح بجؤجئها وهو صدرها المسنم - الذي أرشد العباد إلى صنعتها ، وهداهم إلى ذلك ، إرثا عن أبيهم نوح - عليه السلام - فإنه أول من ركب السفن ، وله كان تعليم صنعتها ، ثم أخذها الناس عنه قرنا بعد قرن ، وجيلا بعد جيل ، يسيرون من قطر إلى قطر ، وبلد إلى بلد ، وإقليم إلى إقليم ، تجلب ما هنا إلى هنالك ، وما هنالك إلى هنا ; ولهذا قال تعالى : ( ولتبتغوا من فضله ولعلكم تشكرون ) أي : نعمه وإحسانه .\nوقد قال الحافظ أبو بكر البزار في مسنده : وجدت في كتابي عن محمد بن معاوية البغدادي : حدثنا عبد الرحمن بن عبد الله بن [ عمر ، عن ] سهيل بن أبى صالح ، عن أبيه ، عن أبي هريرة [ رفعه ] قال : كلم الله هذا البحر الغربي ، وكلم البحر الشرقي ، فقال للبحر الغربي : إني حامل فيك عبادا من عبادي ، فكيف أنت صانع فيهم ؟ قال : أغرقهم . فقال : بأسك في نواحيك . وأحملهم على يدي . وحرمه الحلية والصيد . وكلم هذا البحر الشرقي فقال : إني حامل فيك عبادا من عبادي ، فما أنت صانع بهم ؟ فقال : أحملهم على يدي ، وأكون لهم كالوالدة لولدها . فأثابه الحلية والصيد .\nثم قال البزار : لا نعلم من رواه عن سهيل غير عبد الرحمن بن عبد الله بن عمر وهو منكر الحديث . وقد رواه سهيل عن النعمان بن أبي عياش عن عبد الله بن عمرو موقوفا .\n                                    ",
        "qortoby": "وَهُوَ ٱلَّذِي سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُواْ مِنۡهُ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُواْ مِنۡهُ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ ٤١\n                                    \n                                    \n                                    قوله : وهو الذي سخر البحر لتأكلوا منه لحما طريا وتستخرجوا منه حلية تلبسونها وترى الفلك مواخر فيه ولتبتغوا من فضله ولعلكم تشكرون\nفيه تسع مسائل :\nالأولى : قوله تعالى : وهو الذي سخر البحر تسخير البحر هو تمكين البشر من التصرف فيه وتذليله بالركوب والإرفاء وغيره ، وهذه نعمة من نعم الله علينا ، فلو شاء سلطه علينا وأغرقنا . وقد مضى الكلام في البحر وفي صيده\nلتأكلوا منه لحما طريا سماه هنا لحما واللحوم عند مالك ثلاثة أجناس : فلحم ذوات الأربع جنس ، ولحم ذوات الريش جنس ، ولحم ذوات الماء جنس . فلا يجوز بيع الجنس من جنسه متفاضلا ، ويجوز بيع لحم البقر والوحش بلحم الطير والسمك متفاضلا ، وكذلك لحم الطير بلحم البقر والوحش والسمك يجوز متفاضلا . وقال أبو حنيفة : اللحم كلها أصناف مختلفة كأصولها ; فلحم البقر صنف ، ولحم الغنم صنف ، ولحم الإبل صنف ، وكذلك الوحش مختلف ، كذلك الطير ، وكذلك السمك ، وهو أحد قولي الشافعي . والقول الآخر أن الكل من النعم والصيد والطير والسمك جنس واحد لا يجوز التفاضل فيه . والقول الأول هو المشهور من مذهبه عند أصحابه . ودليلنا هو أن الله - تعالى - فرق بين أسماء الأنعام في حياتها فقال : ثمانية أزواج من الضأن اثنين ومن المعز اثنين ثم قال : ومن الإبل اثنين ومن البقر اثنين فلما أن أم بالجميع إلى اللحم قال : أحلت لكم بهيمة الأنعام فجمعها بلحم واحد لتقارب منافعها كتقارب لحم الضأن والمعز . وقال في موضع آخر : ولحم طير مما يشتهون وهذا جمع طائر الذي هو الواحد ، لقوله - تعالى - : ولا طائر يطير بجناحيه فجمع لحم الطير كله باسم واحد . وقال هنا : \" لحما طريا \" فجمع أصناف السمك بذكر واحد ، فكان صغاره ككباره في الجمع بينهما . وقد روي عن ابن عمر أنه سئل عن لحم المعز بلحم الكباش أشيء واحد ؟ فقال لا ; ولا مخالف له فصار كالإجماع ، والله أعلم . ولا حجة للمخالف في نهيه - صلى الله عليه وسلم - عن بيع الطعام إلا مثلا بمثل ; فإن الطعام في الإطلاق يتناول الحنطة وغيرها من المأكولات ولا يتناول اللحم ; ألا ترى أن القائل إذا قال : أكلت اليوم طعاما لم يسبق الفهم منه إلى أكل اللحم ، وأيضا فإنه معارض بقوله - صلى الله عليه وسلم - : إذا اختلف الجنسان فبيعوا كيف شئتم وهذان جنسان ، وأيضا فقد اتفقنا على جواز بيع اللحم بلحم الطير متفاضلا لا لعلة أنه بيع طعام لا زكاة له بيع بلحم ليس فيه الزكاة ، وكذلك بيع السمك بلحم الطير متفاضلا .\nالثانية : وأما الجراد فالمشهور عندنا جواز بيع بعضه ببعض متفاضلا . وذكر عن سحنون أنه يمنع من ذلك ، وإليه مال بعض المتأخرين ورآه مما يدخر .\nالثالثة : اختلف العلماء فيمن حلف ألا يأكل لحما ; فقال ابن القاسم : يحنث بكل نوع من هذه الأنواع الأربعة . وقال أشهب في المجموعة . لا يحنث إلا بكل لحوم الأنعام دون الوحش وغيره ، مراعاة للعرف والعادة ، وتقديما لها على إطلاق اللفظ اللغوي ، وهو أحسن .\nالرابعة : قوله تعالى : وتستخرجوا منه حلية تلبسونها يعني به اللؤلؤ والمرجان ; لقوله - تعالى - : يخرج منهما اللؤلؤ والمرجان . وإخراج الحلية إنما هي فيما عرف من الملح فقط . وقال : إن في الزمرد بحريا . وقد خطئ الهذلي في قوله في وصف الدرة :\nفجاء بها من درة لطمية على وجهها ماء الفرات يدوم\nفجعلها من الماء الحلو . فالحلية حق وهي نحلة الله - تعالى - لآدم وولده . خلق آدم وتوج وكلل بإكليل الجنة ، وختم بالخاتم الذي ورثه عنه سليمان بن داود - صلوات الله عليهم - ، وكان يقال له خاتم العز فيما روي .\nالخامسة : امتن الله سبحانه على الرجال والنساء امتنانا عاما بما يخرج من البحر ، فلا يحرم عليهم شيء منه ، وإنما حرم الله - تعالى - على الرجال الذهب والحرير . روى الصحيح عن عمر بن الخطاب قال : قال رسول الله - صلى الله عليه وسلم - : لا تلبسوا الحرير فإنه من لبسه في الدنيا لم يلبسه في الآخرة . وسيأتي في سورة [ الحج ] الكلام فيه إن شاء الله . وروى البخاري عن ابن عمر أن رسول الله - صلى الله عليه وسلم - اتخذ خاتما من ذهب ، وجعل فصه مما يلي باطن كفه ، ونقش فيه محمد رسول الله ; فاتخذ الناس مثله ; فلما رآهم قد اتخذوها رمى به وقال : لا ألبسه أبدا ثم اتخذ خاتما من فضة فاتخذ الناس خواتيم الفضة . قال ابن عمر : فلبس الخاتم بعد النبي - صلى الله عليه وسلم - أبو بكر ثم عمر ثم عثمان ، حتى وقع من عثمان في بئر أريس . قال أبو داود : لم يختلف الناس على عثمان حتى سقط الخاتم من يده . وأجمع العلماء على جواز التختم بالورق على الجملة للرجال . قال الخطابي : وكره للنساء التختم بالفضة ; لأنه من زي الرجال ، فإن لم يجدن ذهبا فليصفرنه بزعفران أو بشبهه . وجمهور العلماء من السلف والخلف على تحريم اتخاذ الرجال خاتم الذهب ، إلا ما روي عن أبي بكر بن عبد الرحمن وخباب ، وهو خلاف شاذ ، وكل منهما لم يبلغهما النهي والنسخ . والله أعلم . وأما ما رواه أنس بن مالك أنه رأى في يد رسول الله - صلى الله عليه وسلم - خاتما من ورق يوما واحدا ، ثم إن الناس اصطنعوا الخواتم ، من ورق ولبسوها ، فطرح رسول الله - صلى الله عليه وسلم - خاتمه فطرح الناس خواتيمهم - أخرجه الصحيحان واللفظ للبخاري - فهو عند العلماء وهم من ابن شهاب ; لأن الذي نبذ رسول الله - صلى الله عليه وسلم - إنما هو خاتم الذهب . رواه عبد العزيز بن صهيب وقتادة عن أنس ، وهو خلاف ما روى ابن شهاب عن أنس فوجب القضاء بالجملة على الواحد إذا خالفها ، مع ما يشهد للجماعة من حديث ابن عمر .\nالسادسة : إذا ثبت جواز التختم للرجال بخاتم الفضة والتحلي به ، فقد كره ابن سيرين وغيره من العلماء نقشه وأن يكون فيه ذكر الله . وأجاز نقشه جماعة من العلماء . ثم إذا نقش عليه اسم الله أو كلمة حكمة أو كلمات من القرآن وجعله في شماله ، فهل يدخل به الخلاء ويستنجي بشماله ؟ خففه سعيد بن المسيب ومالك . قيل لمالك : إن كان في الخاتم ذكر الله ويلبسه في الشمال أيستنجى به ؟ قال : أرجو أن يكون خفيفا . وروي عنه الكراهة وهو الأولى . وعلى المنع من ذلك أكثر أصحابه . وقد روى همام عن ابن جريج عن الزهري عن أنس قال :\nكان رسول الله - صلى الله عليه وسلم - إذا دخل الخلاء وضع خاتمه . قال أبو داود : هذا حديث منكر ، وإنما يعرف عن ابن جريج عن زياد بن سعد عن الزهري عن أنس أن النبي - صلى الله عليه وسلم - اتخذ خاتما من ورق ثم ألقاه . قال أبو داود : لم يحدث بهذا إلا همام .\nالسابعة : روى البخاري عن أنس بن مالك أن رسول الله - صلى الله عليه وسلم - اتخذ خاتما من فضة ونقش فيه \" محمد رسول الله \" وقال : إني اتخذت خاتما من ورق ونقشت فيه محمد رسول الله فلا ينقشن أحد على نقشه . قال علماؤنا : فهذا دليل على جواز نقش اسم صاحب الخاتم على خاتمه . قال مالك : ومن شأن الخلفاء والقضاة نقش أسمائهم على خواتيمهم ، ونهيه - عليه السلام - : لا ينقشن أحد على نقش خاتمه ، من أجل أن ذلك اسمه وصفته برسالة الله له إلى خلقه . وروى أهل الشام أنه لا يجوز الخاتم لغير ذي سلطان . وروي في ذلك حديثا عن أبي ريحانة ، وهو حديث لا حجة فيه لضعفه . وقوله - عليه السلام - : لا ينقشن أحد على نقشه يرده ويدل على جواز اتخاذ الخاتم لجميع الناس ، إذا لم ينقش على نقش خاتمه . وكان نقش خاتم الزهري \" محمد يسأل الله العافية \" . وكان نقش خاتم مالك \" حسبي الله ونعم الوكيل \" . وذكر الترمذي الحكيم في \" نوادر الأصول \" أن نقش خاتم موسى - عليه السلام - لكل أجل كتاب . وقد مضى في الرعد وبلغ عمر بن عبد العزيز أن ابنه اشترى خاتما بألف درهم فكتب إليه : إنه بلغني أنك اشتريت خاتما بألف درهم ، فبعه وأطعم منه ألف جائع ، واشتر خاتما من حديد بدرهم ، واكتب عليه \" رحم الله امرأ عرف قدر نفسه \" .\nالثامنة : من حلف ألا يلبس حليا فلبس لؤلؤا لم يحنث ; وبه قال أبو حنيفة . قال ابن خويز منداد : لأن هذا وإن كان الاسم اللغوي يتناوله فلم يقصده باليمين ، والأيمان تخص بالعرف ; ألا ترى أنه لو حلف ألا ينام على فراش فنام على الأرض لم يحنث ، وكذلك لا يستضيء بسراج فجلس في الشمس لا يحنث ، وإن كان الله - تعالى - قد سمى الأرض فراشا والشمس سراجا . وقال الشافعي وأبو يوسف ومحمد : من حلف ألا يلبس حليا ولبس اللؤلؤ فإنه يحنث ; لقوله - تعالى - : وتستخرجوا منه حلية تلبسونها والذي يخرج منه : اللؤلؤ والمرجان .\nالتاسعة : قوله تعالى : وترى الفلك مواخر فيه قد تقدم ذكر الفلك وركوب البحر في ( البقرة ) وغيرها . وقوله : مواخر قال ابن عباس : جواري ، من جرت تجري . سعيد بن جبير : معترضة . الحسن : مواقر . قتادة والضحاك : أي تذهب وتجيء ، مقبلة ومدبرة بريح واحدة . وقيل : مواخر ملججة في داخل البحر ; وأصل المخر شق الماء عن يمين وشمال . مخرت السفينة تمخر وتمخر مخرا ومخورا إذا جرت تشق الماء مع صوت ; ومنه قوله - تعالى - : وترى الفلك مواخر فيه يعني جواري . وقال الجوهري : ومخر السابح إذا شق الماء بصدره ، ومخر الأرض شقها للزراعة ، ومخرها بالماء إذا حبس الماء فيها حتى تصير أريضة ; أي خليقة بجودة نبات الزرع . وقال الطبري : المخر في اللغة صوت هبوب الريح ; ولم يقيد كونه في ماء ، وقال : إن من ذلك قول واصل مولى أبي عيينة : إذا أراد أحدكم البول فليتمخر الريح ; أي لينظر في صوتها في الأجسام من أين تهب ، فيتجنب استقبالها لئلا ترد عليه بوله .\nولتبتغوا من فضله أي ولتركبوه للتجارة وطلب الربح .\nولعلكم تشكرون تقدم جميع هذا في ( البقرة ) والحمد لله .\n                                    ",
        "saadi": "وَهُوَ ٱلَّذِي سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُواْ مِنۡهُ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُواْ مِنۡهُ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ ٤١\n                                        \n                                        \n                                        \n                                        أي: هو وحده لا شريك له { الَّذِي سَخَّرَ الْبَحْرَ } وهيأه لمنافعكم المتنوعة. { لِتَأْكُلُوا مِنْهُ لَحْمًا طَرِيًّا } وهو السمك والحوت الذي يصطادونه منه، { وَتَسْتَخْرِجُوا مِنْهُ حِلْيَةً تَلْبَسُونَهَا } فتزيدكم جمالا وحسنا إلى حسنكم، { وَتَرَى الْفُلْكَ } أي: السفن والمراكب { مَوَاخِرَ فِيهِ } أي: تمخر في البحر العجاج الهائل بمقدمها حتى تسلك فيه من قطر إلى آخر، تحمل المسافرين وأرزاقهم وأمتعتهم وتجاراتهم التي يطلبون بها الأرزاق وفضل الله عليهم.\n{ وَلَعَلَّكُمْ تَشْكُرُونَ } الذي يسر لكم هذه الأشياء وهيأها وتثنون على الله الذي منَّ بها، فلله تعالى الحمد والشكر والثناء، حيث أعطى العباد من مصالحهم ومنافعهم فوق ما يطلبون، وأعلى ما يتمنون، وآتاهم من كل ما سألوه، لا نحصي ثناء عليه بل هو كما أثنى على نفسه.\n                                    "
      },
      "originalText": "وَهُوَ ٱلَّذِي سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُواْ مِنۡهُ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُواْ مِنۡهُ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ ٤١"
    }
  ]
}