{
  "number": 274,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 1966,
      "text": "وَاللَّهُ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَسْمَعُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 65,
      "juz": 14,
      "manzil": 3,
      "page": 274,
      "ruku": 231,
      "hizbQuarter": 109,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَسۡمَعُونَ ٥٦\n                                    \n                                    \n                                    وكما جعل تعالى القرآن حياة للقلوب الميتة بكفرها ، كذلك يحيي [ الله ] الأرض بعد موتها بما ينزله عليها من السماء من ماء ، ( إن في ذلك لآية لقوم يسمعون ) أي : يفهمون الكلام ومعناه .\n                                    ",
        "qortoby": "وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَسۡمَعُونَ ٥٦\n                                    \n                                    \n                                    قوله تعالى : والله أنزل من السماء ماء فأحيا به الأرض بعد موتها إن في ذلك لآية لقوم يسمعون قوله تعالى : والله أنزل من السماء أي السحاب .\nماء فأحيا به الأرض بعد موتها عاد الكلام إلى تعداد النعم وبيان كمال القدرة .\nإن في ذلك أي دلالة على البعث على وحدانيته ; إذ علموا أن معبودهم لا يستطيع شيئا ، فتكون هذه الدلالة .\nلآية لقوم يسمعون عن الله - تعالى - بالقلوب لا بالآذان ; فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور .\n                                    ",
        "saadi": "وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَسۡمَعُونَ ٥٦\n                                        \n                                        \n                                        \n                                        عن الله مواعظه وتذكيره فيستدلوا بذلك على أنه وحده المعبود، الذي لا تنبغي العبادة إلا له وحده، لأنه المنعم بإنزال المطر وإنبات جميع أصناف النبات، وعلى أنه على كل شيء قدير، وأن الذي أحيا الأرض بعد موتها قادر على إحياء الأموات وأن الذي نشر هذا الإحسان لذو رحمة واسعة وجود عظيم.\n                                    "
      },
      "originalText": "وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَآۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَسۡمَعُونَ ٥٦"
    },
    {
      "number": 1967,
      "text": "وَإِنَّ لَكُمْ فِي الْأَنْعَامِ لَعِبْرَةً ۖ نُسْقِيكُمْ مِمَّا فِي بُطُونِهِ مِنْ بَيْنِ فَرْثٍ وَدَمٍ لَبَنًا خَالِصًا سَائِغًا لِلشَّارِبِينَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 66,
      "juz": 14,
      "manzil": 3,
      "page": 274,
      "ruku": 232,
      "hizbQuarter": 109,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّٰرِبِينَ ٦٦\n                                    \n                                    \n                                    يقول تعالى : ( وإن لكم ) أيها الناس ( في الأنعام ) وهي : الإبل والبقر والغنم ، ( لعبرة ) أي : لآية ودلالة على قدرة خالقها وحكمته ولطفه ورحمته ، ( نسقيكم مما في بطونه ) وأفرد هاهنا [ الضمير ] عودا على معنى النعم ، أو الضمير عائد على الحيوان ; فإن الأنعام حيوانات ، أي نسقيكم مما في بطن هذا الحيوان .\nوفي الآية الأخرى : ( مما في بطونها ) [ المؤمنون : 21 ] ويجوز هذا وهذا ، كما في قوله تعالى : ( كلا إنه تذكرة فمن شاء ذكره ) [ المدثر : 54 ، 55 ] وفي قوله تعالى : ( وإني مرسلة إليهم بهدية فناظرة بم يرجع المرسلون فلما جاء سليمان ) [ النمل : 35 ، 36 ] أي : المال .\nوقوله : ( من بين فرث ودم لبنا خالصا ) أي : يتخلص الدم بياضه وطعمه وحلاوته من بين فرث ودم في باطن الحيوان ، فيسري كل إلى موطنه ، إذا نضج الغذاء في معدته تصرف منه دم إلى العروق ، ولبن إلى الضرع وبول إلى المثانة ، وروث إلى المخرج ، وكل منها لا يشوب الآخر ولا يمازجه بعد انفصاله عنه ، ولا يتغير به .\nوقوله : ( لبنا خالصا سائغا للشاربين ) أي : لا يغص به أحد .\n                                    ",
        "qortoby": "وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّٰرِبِينَ ٦٦\n                                    \n                                    \n                                    قوله تعالى : وإن لكم في الأنعام لعبرة نسقيكم مما في بطونه من بين فرث ودم لبنا خالصا سائغا للشاربين فيه عشر مسائل :\nالأولى : قوله تعالى : وإن لكم في الأنعام لعبرة قد تقدم القول في الأنعام ، وهي هنا الأصناف الأربعة : الإبل والبقر والضأن والمعز . لعبرة أي دلالة على قدرة الله ووحدانيته وعظمته . والعبرة أصلها تمثيل الشيء بالشيء لتعرف حقيقته من طريق المشاكلة ، ومنه فاعتبروا . وقال أبو بكر الوراق : العبرة في الأنعام تسخيرها لأربابها وطاعتها لهم ، وتمردك على ربك وخلافك له في كل شيء . ومن أعظم العبر بريء يحمل مذنبا .\nالثانية : قوله تعالى : نسقيكم قراءة أهل المدينة وابن عامر وعاصم في رواية أبي بكر ( بفتح النون ) من سقى يسقي . وقرأ الباقون وحفص عن عاصم بضم النون من أسقى يسقي ، وهي قراءة الكوفيين وأهل مكة . قيل : هما لغتان . وقال لبيد :\nسقى قومي بني مجد وأسقى نميرا والقبائل من هلال\nوقيل : يقال لما كان من يدك إلى فيه سقيته ، فإذا جعلت له شرابا أو عرضته لأن يشرب بفيه أو يزرعه قلت أسقيته ; قال ابن عزيز ، وقد تقدم . وقرأت فرقة \" تسقيكم \" بالتاء ، وهي ضعيفة ، يعني الأنعام . وقرئ بالياء ، أي يسقيكم الله - عز وجل - . والقراء على القراءتين المتقدمتين ; ففتح النون لغة قريش وضمها لغة حمير .\nالثالثة : قوله تعالى : مما في بطونه اختلف الناس في الضمير من قوله : مما في بطونه على ماذا يعود . فقيل : هو عائد إلى ما قبله وهو جمع المؤنث . قال سيبويه : العرب تخبر عن الأنعام بخبر الواحد . قال ابن العربي : وما أراه عول عليه إلا من هذه الآية ، وهذا لا يشبه منصبه ولا يليق بإدراكه . وقيل : لما كان لفظ الجمع وهو اسم الجنس يذكر ويؤنث فيقال : هو الأنعام وهي الأنعام ، جاز عود الضمير بالتذكير ; وقال الزجاج ، وقال الكسائي : معناه مما في بطون ما ذكرناه ، فهو عائد على المذكور ; وقد قال الله - تعالى - : إنها تذكرة . فمن شاء ذكره وقال الشاعر :\nمثل الفراخ نتفت حواصله\nومثله كثير . وقال الكسائي : مما في بطونه أي مما في بطون بعضه ; إذ الذكور لا ألبان لها ، وهو الذي عول عليه أبو عبيدة . وقال الفراء : الأنعام والنعم واحد ، والنعم يذكر ، ولهذا تقول العرب : هذا نعم وارد ، فرجع الضمير إلى لفظ النعم الذي هو بمعنى الأنعام . قال ابن العربي : إنما رجع التذكير إلى معنى الجمع ، والتأنيث إلى معنى الجماعة ، فذكره هنا باعتبار لفظ الجمع ، وأنثه في سورة المؤمنين باعتبار لفظ الجماعة فقال : نسقيكم مما في بطونها وبهذا التأويل ينتظم المعنى انتظاما حسنا . والتأنيث باعتبار لفظ الجماعة والتذكير باعتبار لفظ الجمع أكثر من رمل يبرين وتيهاء فلسطين .\nالرابعة : استنبط بعض العلماء الجلة وهو القاضي إسماعيل من عود هذا الضمير ، أن لبن الفحل يفيد التحريم ، وقال : إنما جيء به مذكرا لأنه راجع إلى ذكر النعم ; لأن اللبن للذكر محسوب ، ولذلك قضى النبي - صلى الله عليه وسلم - بأن لبن الفحل يحرم حين أنكرته عائشة في حديث أفلح أخي أبي القعيس ( فللمرأة السقي وللرجل اللقاح ) فجرى الاشتراك فيه بينهما . وقد مضى القول في تحريم لبن الفحل في \" النساء \" والحمد لله\nالخامسة : قوله تعالى : من بين فرث ودم لبنا خالصا نبه سبحانه على عظيم قدرته بخروج اللبن خالصا بين الفرث والدم . والفرث : الزبل الذي ينزل إلى الكرش ، فإذا خرج لم يسم فرثا . يقال : أفرثت الكرش إذا أخرجت ما فيها . والمعنى : أن الطعام يكون فيه ما في الكرش ويكون منه الدم ، ثم يخلص اللبن من الدم ; فأعلم الله سبحانه أن هذا اللبن يخرج من بين ذلك وبين الدم في العروق . وقال ابن عباس : إن الدابة تأكل العلف فإذا استقر في كرشها طبخته فكان أسفله فرثا وأوسطه لبنا وأعلاه دما ، والكبد مسلط على هذه الأصناف فتقسم الدم وتميزه وتجريه في العروق ، وتجري اللبن في الضرع ويبقى الفرث كما هو في الكرش ; حكمة بالغة فما تغن النذر . خالصا يريد من حمرة الدم وقذارة الفرث وقد جمعهما وعاء واحد . وقال ابن بحر : خالصا بياضه . قال النابغة :\nبخالصة الأردان خضر المناكب\nأي بيض الأكمام . وهذه قدرة لا تنبغي إلا للقائم على كل شيء بالمصلحة .\nالسادسة : قال النقاش : في هذا دليل على أن المني ليس بنجس . وقاله أيضا غيره واحتج بأن قال : كما يخرج اللبن من بين الفرث والدم سائغا خالصا كذلك يجوز أن يخرج المني على مخرج البول طاهرا . قال ابن العربي : إن هذا لجهل عظيم وأخذ شنيع . اللبن جاء الخبر عنه مجيء النعمة والمنة الصادرة عن القدرة ليكون عبرة ، فاقتضى ذلك كله وصف الخلوص واللذة ; وليس المني من هذه الحالة حتى يكون ملحقا به أو مقيسا عليه .\nقلت : قد يعارض هذا بأن يقال : وأي منة أعظم وأرفع من خروج المني الذي يكون عنه الإنسان المكرم ; وقد قال - تعالى - : يخرج من بين الصلب والترائب ، وقال : والله جعل لكم من أنفسكم أزواجا وجعل لكم من أزواجكم بنين وحفدة وهذا غاية في الامتنان . فإن قيل : إنه يتنجس بخروجه في مجرى البول ، قلنا : هو ما أردناه ، فالنجاسة عارضة وأصله طاهر ; وقد قيل : إن مخرجه غير مخرج البول وخاصة المرأة ; فإن مدخل الذكر منها ومخرج الولد غير مخرج البول على ما قاله العلماء . وقد تقدم فإن قيل : أصله دم فهو نجس ، قلنا ينتقض بالمسك ، فإن أصله دم وهو طاهر . وممن قال بطهارته الشافعي وأحمد وإسحاق وأبو ثور وغيرهم ; لحديث عائشة - رضي الله عنها - قالت : كنت أفركه من ثوب رسول الله - صلى الله عليه وسلم - يابسا بظفري . قال الشافعي : فإن لم يفرك فلا بأس به . وكان سعد بن أبي وقاص يفرك المني من ثوبه . وقال ابن عباس : هو كالنخامة أمطه عنك بإذخرة وامسحه بخرقة . فإن قيل : فقد ثبت عن عائشة أنها قالت : كنت أغسل المني من ثوب رسول الله - صلى الله عليه وسلم - ثم يخرج إلى الصلاة في ذلك الثوب وأنا أنظر إلى أثر الغسل فيه . قلنا : يحتمل أن تكون غسلته استقذارا كالأشياء التي تزال من الثوب كالنجاسة ، ويكون هذا جمعا بين الأحاديث . والله أعلم . وقال مالك وأصحابه والأوزاعي : هو نجس . قال مالك : غسل الاحتلام من الثوب أمر واجب مجتمع عليه عندنا ، وهو قول الكوفيين . ويروى عن عمر بن الخطاب وابن مسعود وجابر بن سمرة أنهم غسلوه من ثيابهم . واختلف فيه عن ابن عمر وعائشة . وعلى هذين القولين في نجاسة المني وطهارته التابعون .\nالسابعة : في هذه الآية دليل على جواز الانتفاع بالألبان من الشرب وغيره ، فأما لبن الميتة فلا يجوز الانتفاع به ; لأنه مائع طاهر حصل في وعاء نجس ، وذلك أن ضرع الميتة نجس واللبن طاهر فإذا حلب صار مأخوذا من وعاء نجس . فأما لبن المرأة الميتة فاختلف أصحابنا فيه ، فمن قال : إن الإنسان طاهر حيا وميتا فهو طاهر . ومن قال : ينجس بالموت فهو نجس . وعلى القولين جميعا تثبت الحرمة ; لأن الصبي قد يغتذي به كما يغتذي من الحية ، وذلك أن رسول الله - صلى الله عليه وسلم - قال : الرضاع ما أنبت اللحم وأنشز العظم . ولم يخص . وقد مضى في \" النساء \"\nالثامنة : قوله تعالى : سائغا للشاربين أي لذيذا هينا لا يغص به من شربه . يقال : ساغ الشراب يسوغ سوغا أي سهل مدخله في الحلق ، وأساغه شاربه ، وسغته أنا أسيغه وأسوغه ، يتعدى ، والأجود أسغته إساغة . يقال : أسغ لي غصتي أي أمهلني ولا تعجلني ; وقال - تعالى - : يتجرعه ولا يكاد يسيغه . والسواغ - بكسر السين - ما أسغت به غصتك . يقال : الماء سواغ الغصص ; ومنه قول الكميت :\nفكانت سواغا أن جئزت بغصة\nوروي أن اللبن لم يشرق به أحد قط ، وروي ذلك عن النبي - صلى الله عليه وسلم - .\nالتاسعة : في هذه الآية دليل على استعمال الحلاوة والأطعمة اللذيذة وتناولها ، ولا يقال : إن ذلك يناقض الزهد أو يباعده ، لكن إذا كان من وجهه ومن غير سرف ولا إكثار . وقد تقدم هذا المعنى في \" المائدة \" وغيرها وفي الصحيح عن أنس قال : لقد سقيت رسول الله - صلى الله عليه وسلم - بقدحي هذا الشراب كله : العسل والنبيذ واللبن والماء . وقد كره بعض القراء أكل الفالوذج واللبن من الطعام ، وأباحه عامة العلماء . وروي عن الحسن أنه كان على مائدة ومعه مالك بن دينار ، فأتي بفالوذج فامتنع عن أكله ، فقال له الحسن : كل فإن عليك في الماء البارد أكثر من هذا .\nالعاشرة : روى أبو داود وغيره عن ابن عباس قال : أتي رسول الله - صلى الله عليه وسلم - بلبن فشرب ، فقال رسول الله - صلى الله عليه وسلم - : إذا أكل أحدكم طعاما فليقل اللهم بارك لنا فيه وأطعمنا خيرا منه . وإذا سقي لبنا فليقل اللهم بارك لنا فيه وزدنا منه فإنه ليس شيء يجزي عن الطعام والشراب إلا اللبن . قال علماؤنا : فكيف لا يكون ذلك وهو أول ما يغتذي به الإنسان وتنمى به الجثث والأبدان ، فهو قوت خلي عن المفاسد به قوام الأجسام ، وقد جعله الله - تعالى - علامة لجبريل على هداية هذه الأمة التي هي خير الأمم أمة ; فقال في الصحيح : فجاءني جبريل بإناء من خمر وإناء من لبن فاخترت اللبن فقال لي جبريل اخترت الفطرة أما إنك لو اخترت الخمر غوت أمتك . ثم إن في الدعاء بالزيادة منه علامة الخصب وظهور الخيرات والبركات ; فهو مبارك كله .\n                                    ",
        "saadi": "وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّٰرِبِينَ ٦٦\n                                        \n                                        \n                                        \n                                        أي: { وَإِنَّ لَكُمْ فِي الْأَنْعَامِ } التي سخرها الله لمنافعكم { لَعِبْرَةً } تستدلون بها على كمال قدرة الله وسعة إحسانه حيث أسقاكم من بطونها المشتملة على الفرث والدم، فأخرج من بين ذلك لبنا خالصا من الكدر سائغا للشاربين للذته ولأنه يسقي ويغذي، فهل هذه إلا قدرة إلهية لا أمور طبيعية.\nفأي شيء في الطبيعة يقلب العلف الذي تأكله البهيمة والشراب الذي تشربه من الماء العذب والملح لبنا خالصا سائغا للشاربين؟\n                                    "
      },
      "originalText": "وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّٰرِبِينَ ٦٦"
    },
    {
      "number": 1968,
      "text": "وَمِنْ ثَمَرَاتِ النَّخِيلِ وَالْأَعْنَابِ تَتَّخِذُونَ مِنْهُ سَكَرًا وَرِزْقًا حَسَنًا ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَعْقِلُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 67,
      "juz": 14,
      "manzil": 3,
      "page": 274,
      "ruku": 232,
      "hizbQuarter": 109,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرٗا وَرِزۡقًا حَسَنًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡقِلُونَ ٧٦\n                                    \n                                    \n                                    ولما ذكر اللبن وأنه تعالى جعله شرابا للناس سائغا ، ثنى بذكر ما يتخذه الناس من الأشربة ، من ثمرات النخيل والأعناب ، وما كانوا يصنعون من النبيذ المسكر قبل تحريمه ؛ ولهذا امتن به عليهم فقال : ( ومن ثمرات النخيل والأعناب تتخذون منه سكرا ) دل على إباحته شرعا قبل تحريمه ، ودل على التسوية بين السكر المتخذ من العنب ، والمتخذ من النخل كما هو مذهب مالك والشافعي وأحمد وجمهور العلماء ، وكذا حكم سائر الأشربة المتخذة من الحنطة والشعير والذرة والعسل ، كما جاءت السنة بتفصيل ذلك ، وليس هذا موضع بسط ذلك ، كما قال ابن عباس في قوله : ( سكرا ورزقا حسنا ) قال : السكر : ما حرم من ثمرتيهما ، والرزق الحسن ما أحل من ثمرتيهما . وفي رواية : السكر حرامه ، والرزق الحسن حلاله . يعني : ما يبس منهما من تمر وزبيب ، وما عمل منهما من طلاء - وهو الدبس - وخل ونبيذ ، حلال يشرب قبل أن يشتد ، كما وردت السنة بذلك .\n( إن في ذلك لآية لقوم يعقلون ) ناسب ذكر العقل هاهنا ، فإنه أشرف ما في الإنسان ; ولهذا حرم الله على هذه الأمة الأشربة المسكرة ؛ صيانة لعقولها . قال الله تعالى : ( وجعلنا فيها جنات من نخيل وأعناب وفجرنا فيها من العيون ليأكلوا من ثمره وما عملته أيديهم أفلا يشكرون سبحان الذي خلق الأزواج كلها مما تنبت الأرض ومن أنفسهم ومما لا يعلمون ) [ يس : 34 - 36 ] .\n                                    ",
        "qortoby": "وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرٗا وَرِزۡقًا حَسَنًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡقِلُونَ ٧٦\n                                    \n                                    \n                                    قوله تعالى : ومن ثمرات النخيل والأعناب تتخذون منه سكرا ورزقا حسنا إن في ذلك لآية لقوم يعقلون فيه مسألتان :\nالأولى : قوله تعالى : ومن ثمرات النخيل قال الطبري : التقدير ومن ثمرات النخيل والأعناب ما تتخذون ; فحذف \" ما \" ودل على حذفه قوله : منه . وقيل : المحذوف شيء ، والأمر قريب . وقيل : معنى منه أي من المذكور ، فلا يكون في الكلام حذف وهو أولى . ويجوز أن يكون قوله : ومن ثمرات عطفا على الأنعام ; أي ولكم من ثمرات النخيل والأعناب عبرة . ويجوز أن يكون معطوفا على مما أي ونسقيكم أيضا مشروبات من ثمرات .\nالثانية : قوله تعالى : سكرا السكر ما يسكر ; هذا هو المشهور في اللغة . قال ابن عباس : نزلت هذه الآية قبل تحريم الخمر . وأراد بالسكر الخمر ، وبالرزق الحسن جميع ما يؤكل ويشرب حلالا من هاتين الشجرتين . وقال بهذا القول ابن جبير والنخعي والشعبي وأبو ثور . وقد قيل : إن السكر الخل بلغة الحبشة ، والرزق الحسن الطعام . وقيل : السكر العصير الحلو الحلال ، وسمي سكرا لأنه قد يصير مسكرا إذا بقي ، فإذا بلغ الإسكار حرم . قال ابن العربي : أسد هذه الأقوال قول ابن عباس ، ويخرج ذلك على أحد معنيين ، إما أن يكون ذلك قبل تحريم الخمر ، وإما أن يكون المعنى : أنعم الله عليكم بثمرات النخيل والأعناب تتخذون منه ما حرم الله عليكم اعتداء منكم ، وما أحل لكم اتفاقا أو قصدا إلى منفعة أنفسكم . والصحيح أن ذلك كان قبل تحريم الخمر فتكون منسوخة ; فإن هذه الآية مكية باتفاق من العلماء ، وتحريم الخمر مدني .\nقلت : فعلى أن السكر الخل أو العصير الحلو لا نسخ ، وتكون الآية محكمة وهو حسن . قال ابن عباس : الحبشة يسمون الخل السكر ، إلا أن الجمهور على أن السكر الخمر ، منهم ابن مسعود وابن عمر وأبو رزين والحسن ومجاهد وابن أبي ليلى والكلبي وغيرهم ممن تقدم ذكرهم ، كلهم قالوا : السكر ما حرمه الله من ثمرتيهما . وكذا قال أهل اللغة : السكر اسم للخمر وما يسكر ، وأنشدوا :\nبئس الصحاة وبئس الشرب شربهم إذا جرى فيهم المزاء والسكر\nوالرزق الحسن : ما أحله الله من ثمرتيهما . وقيل : إن قوله تتخذون منه سكرا خبر معناه الاستفهام بمعنى الإنكار ، أي أتتخذون منه سكرا وتدعون رزقا حسنا الخل والزبيب والتمر ; كقوله : فهم الخالدون أي أفهم الخالدون . والله أعلم . وقال أبو عبيدة : السكر الطعم ; يقال : هذا سكر لك أي طعم . وأنشد :\nجعلت عيب الأكرمين سكرا\nأي جعلت ذمهم طعما . وهذا اختيار الطبري أن السكر ما يطعم من الطعام وحل شربه من ثمار النخيل والأعناب ، وهو الرزق الحسن ، فاللفظ مختلف والمعنى واحد ; مثل إنما أشكو بثي وحزني إلى الله وهذا حسن ولا نسخ ، إلا أن الزجاج قال : قول أبي عبيدة هذا لا يعرف ، وأهل التفسير على خلافه ، ولا حجة له في البيت الذي أنشده ; لأن معناه عند غيره أنه يصف أنها تتخمر بعيوب الناس . وقال الحنفيون : المراد بقوله : سكرا ما لا يسكر من الأنبذة ; والدليل عليه أن الله - سبحانه وتعالى - امتن على عباده بما خلق لهم من ذلك ، ولا يقع الامتنان إلا بمحلل لا بمحرم ، فيكون ذلك دليلا على جواز شرب ما دون المسكر من النبيذ ، فإذا انتهى إلى السكر لم يجز ، وعضدوا هذا من السنة بما روي عن النبي - صلى الله عليه وسلم - أنه قال : حرم الله الخمر بعينها والسكر من غيرها . وبما رواه عبد الملك بن نافع عن ابن عمر قال : رأيت رجلا جاء إلى رسول الله - صلى الله عليه وسلم - وهو عند الركن ، ودفع إليه القدح فرفعه إلى فيه فوجده شديدا فرده إلى صاحبه ، فقال له حينئذ رجل من القوم : يا رسول الله ، أحرام هو ؟ فقال : علي بالرجل فأتي به فأخذ منه القدح ، ثم دعا بماء فصبه فيه ثم رفعه إلى فيه فقطب ، ثم دعا بماء أيضا فصبه فيه ثم قال : إذا اغتلمت عليكم هذه الأوعية فاكسروا متونها بالماء . وروي أنه - عليه السلام - كان ينبذ له فيشربه ذلك اليوم ، فإذا كان من اليوم الثاني أو الثالث سقاه الخادم إذا تغير ، ولو كان حراما ما سقاه إياه . قال الطحاوي : وقد روى أبو عون الثقفي عن عبد الله بن شداد عن ابن عباس قال : حرمت الخمر بعينها القليل منها والكثير والسكر من كل شراب ، خرجه الدارقطني أيضا . ففي هذا الحديث وما كان مثله ، أن غير الخمر لم تحرم عينه كما حرمت الخمر بعينها . قالوا : والخمر شراب العنب لا خلاف فيها ، ومن حجتهم أيضا ما رواه شريك بن عبد الله ، حدثنا أبو إسحاق الهمداني عن عمرو بن ميمون قال : قال عمر بن الخطاب : إنا نأكل لحوم هذه الإبل وليس يقطعه في بطوننا إلا النبيذ . قال شريك : ورأيت الثوري يشرب النبيذ في بيت حبر أهل زمانه مالك بن مغول . والجواب أن قولهم : إن الله - سبحانه وتعالى - امتن على عباده ولا يكون امتنانه إلا بما أحل فصحيح ; بيد أنه يحتمل أن يكون ذلك قبل تحريم الخمر كما بيناه فيكون منسوخا كما قدمناه . قال ابن العربي : إن قيل كيف ينسخ هذا وهو خبر والخبر لا يدخله النسخ ، قلنا : هذا كلام من لم يتحقق الشريعة ، وقد بينا أن الخبر إذا كان عن الوجود الحقيقي أو عن إعطاء ثواب فضلا من الله فهو الذي لا يدخله النسخ ، فأما إذا تضمن الخبر حكما شرعيا فالأحكام تتبدل وتنسخ ، جاءت بخبر أو أمر ، ولا يرجع النسخ إلى نفس اللفظ وإنما يرجع إلى ما تضمنه ، فإذا فهمتم هذا خرجتم عن الصنف الغبي الذي أخبر الله عن الكفار فيه بقوله : وإذا بدلنا آية مكان آية والله أعلم بما ينزل قالوا إنما أنت مفتر بل أكثرهم لا يعلمون . المعنى أنهم جهلوا أن الرب يأمر بما يشاء ويكلف ما يشاء ، ويرفع من ذلك بعدله ما يشاء ويثبت ما يشاء وعنده أم الكتاب .\nقلت : هذا تشنيع شنيع حتى يلحق فيه العلماء الأخيار في قصور الفهم بالكفار ، والمسألة أصولية ، وهي أن الأخبار عن الأحكام الشرعية هل يجوز نسخها أم لا ؟ اختلف في ذلك ، والصحيح جوازه لهذه الآية وما كان مثلها ، ولأن الخبر عن مشروعية حكم ما يتضمن طلب ذلك المشروع ، وذلك الطلب هو الحكم الشرعي الذي يستدل على نسخه . والله أعلم . وأما ما ذكروا من الأحاديث فالأول والثاني ضعيفان ; لأنه - عليه السلام - قد روي عنه بالنقل الثابت أنه قال : كل شراب أسكر فهو حرام وقال : كل مسكر خمر وكل مسكر حرام وقال : ما أسكر كثيره فقليله حرام . قال النسائي : وهؤلاء أهل الثبت والعدالة مشهورون بصحة النقل ، وعبد الملك لا يقوم مقام واحد منهم ولو عاضده من أشكاله جماعة ، وبالله التوفيق . وأما الثالث وإن كان صحيحا فإنه ما كان يسقيه للخادم على أنه مسكر ، وإنما كان يسقيه لأنه متغير الرائحة . وكان - صلى الله عليه وسلم - يكره أن توجد منه الرائحة ، فلذلك لم يشربه ، ولذلك تحيل عليه أزواجه في عسل زينب بأن قيل له : إنا نجد منك ريح مغافير ، يعني ريحا منكرة ، فلم يشربه بعد . وسيأتي في التحريم . وأما حديث ابن عباس فقد روي عنه خلاف ذلك من رواية عطاء وطاوس ومجاهد أنه قال : ما أسكر كثيره فقليله حرام ، ورواه عنه قيس بن دينار . وكذلك فتياه في المسكر ; قاله الدارقطني . والحديث الأول رواه عنه عبد الله بن شداد وقد خالفه الجماعة ، فسقط القول به مع ما ثبت عن النبي - صلى الله عليه وسلم - . وأما ما روي عن عمر من قوله : ليس يقطعه في بطوننا إلا النبيذ ، فإنه يريد غير المسكر بدليل ما ذكرنا . وقد روى النسائي عن عتبة بن فرقد قال : كان النبيذ الذي شربه عمر بن الخطاب قد خلل . قال النسائي : ومما يدل على صحة هذا حديث السائب ، قال الحارث بن مسكين قراءة عليه وأنا أسمع عن ابن القاسم : حدثني مالك عن ابن شهاب عن السائب بن يزيد ، أنه أخبره أن عمر بن الخطاب خرج عليهم فقال : إني وجدت من فلان ريح شراب ، فزعم أنه شراب الطلاء ، وأنا سائل عما شرب ، فإن كان مسكرا جلدته ، فجلده عمر بن الخطاب - رضي الله عنه - الحد تاما . وقد قال في خطبته على منبر رسول الله - صلى الله عليه وسلم - : أما بعد ، أيها الناس فإنه نزل تحريم الخمر وهي من خمسة : من العنب والعسل والتمر والحنطة والشعير . والخمر ما خامر العقل . وقد تقدم في المائدة . فإن قيل : فقد أحل شربه إبراهيم النخعي وأبو جعفر الطحاوي وكان إمام أهل زمانه ، وكان سفيان الثوري يشربه . قلنا : ذكر النسائي في كتابه أن أول من أحل المسكر من الأنبذة إبراهيم النخعي ، وهذه زلة من عالم وقد حذرنا من زلة العالم ، ولا حجة في قول أحد مع السنة . وذكر النسائي أيضا عن ابن المبارك قال : ما وجدت الرخصة في المسكر عن أحد صحيحا إلا عن إبراهيم . قال أبو أسامة : ما رأيت رجلا أطلب للعلم من عبد الله بن المبارك الشامات ومصر واليمن والحجاز . وأما الطحاوي وسفيان لو صح ذلك عنهما لم يحتج بهما على من خالفهما من الأئمة في تحريم المسكر مع ما ثبت من السنة ; على أن الطحاوي قد ذكر في كتابه الكبير في الاختلاف خلاف ذلك . قال أبو عمر بن عبد البر في كتاب التمهيد له : قال أبو جعفر الطحاوي اتفقت الأمة على أن عصير العنب إذا اشتد وغلى وقذف بالزبد فهو خمر ومستحله كافر . واختلفوا في نقيع التمر إذا غلى وأسكر . قال : فهذا يدلك على أن حديث يحيى بن أبي كثير عن أبي هريرة عن النبي - صلى الله عليه وسلم - أنه قال : الخمر من هاتين الشجرتين النخلة والعنب غير معمول به عندهم ; لأنهم لو قبلوا الحديث لأكفروا مستحل نقيع التمر ، فثبت أنه لم يدخل في الخمر المحرمة غير عصير العنب الذي قد اشتد وبلغ أن يسكر . قال : ثم لا يخلو من أن يكون التحريم معلقا بها فقط غير مقيس عليها غيرها أو يجب القياس عليها ، فوجدناهم جميعا قد قاسوا عليها نقيع التمر إذا غلى وأسكر كثيره وكذلك نقيع الزبيب . قال : فوجب قياسا على ذلك أن يحرم كل ما أسكر من الأشربة . قال : وقد روي عن النبي - صلى الله عليه وسلم - أنه قال : كل مسكر حرام واستغني عن مسنده لقبول الجميع له ، وإنما الخلاف بينهم في تأويله ، فقال بعضهم : أراد به جنس ما يسكر . وقال بعضهم : أراد به ما يقع السكر عنده كما لا يسمى قاتلا إلا مع وجود القتل .\nقلت : فهذا يدل على أنه محرم عند الطحاوي لقوله ، فوجب قياسا على ذلك أن يحرم كل ما أسكر من الأشربة . وقد روى الدارقطني في سننه عن عائشة - رضي الله عنها - أنها قالت : إن الله لم يحرم الخمر لاسمها وإنما حرمها لعاقبتها ، فكل شراب يكون عاقبته كعاقبة الخمر فهو حرام كتحريم الخمر . قال ابن المنذر : وجاء أهل الكوفة بأخبار معلولة ، وإذا اختلف الناس في الشيء وجب رد ذلك إلى كتاب الله وسنة رسوله - عليه السلام - ، وما روي عن بعض التابعين أنه شرب الشراب الذي يسكر كثيره فللقوم ذنوب يستغفرون الله منها ، وليس يخلو ذلك من أحد معنيين : إما مخطئ أخطأ في التأويل على حديث سمعه ، أو رجل أتى ذنبا لعله أن يكثر من الاستغفار لله - تعالى - ، والنبي - صلى الله عليه وسلم - حجة الله على الأولين والآخرين من هذه الأمة . وقد قيل في تأويل الآية : إنها إنما ذكرت للاعتبار ، أي من قدر على خلق هذه الأشياء قادر على البعث ، وهذا الاعتبار لا يختلف بأن كانت الخمر حلالا أو حراما ، فاتخاذ السكر لا يدل على التحريم ، وهو كما قال - تعالى - : قل فيهما إثم كبير ومنافع للناس . والله أعلم .\n                                    ",
        "saadi": "وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرٗا وَرِزۡقًا حَسَنًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡقِلُونَ ٧٦\n                                        \n                                        \n                                        \n                                        وجعل تعالى لعباده من ثمرات النخيل والأعناب منافع للعباد، ومصالح من أنواع الرزق الحسن الذي يأكله العباد طريًّا ونضيجا وحاضرا ومدخرا وطعاما وشرابا يتخذ من عصيرها ونبيذها، ومن السكر الذي كان حلالا قبل ذلك، ثم إن الله نسخ حلَّ المسكرات، وأعاض عنها بالطيبات من الأنبذة، وأنواع الأشربة اللذيذة المباحة.\n{ إِنَّ فِي ذَلِكَ لَآية لِقَوْمٍ يَعْقِلُونَ } عن الله كمال اقتداره حيث أخرجها من أشجار شبيهة بالحطب، فصارت ثمرة لذيذة وفاكهة طيبة وعلى شمول رحمته حيث عم بها عباده ويسرها لهم وأنه الإله المعبود وحده حيث إنه المنفرد بذلك.\n                                    "
      },
      "originalText": "وَمِن ثَمَرَٰتِ ٱلنَّخِيلِ وَٱلۡأَعۡنَٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرٗا وَرِزۡقًا حَسَنًاۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَعۡقِلُونَ ٧٦"
    },
    {
      "number": 1969,
      "text": "وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 68,
      "juz": 14,
      "manzil": 3,
      "page": 274,
      "ruku": 232,
      "hizbQuarter": 109,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ بُيُوتٗا وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُونَ ٨٦\n                                    \n                                    \n                                    لمراد بالوحي هاهنا : الإلهام والهداية والإرشاد إلى النحل أن تتخذ من الجبال بيوتا تأوي إليها ، ومن الشجر ، ومما يعرشون . ثم هي محكمة في غاية الإتقان في تسديسها ورصها ، بحيث لا يكون بينها خلل .\n                                    ",
        "qortoby": "وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ بُيُوتٗا وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُونَ ٨٦\n                                    \n                                    \n                                    قوله تعالى : وأوحى ربك إلى النحل أن اتخذي من الجبال بيوتا ومن الشجر ومما يعرشون فيه ثلاث مسائل :\nالأولى : قوله تعالى : وأوحى ربك إلى النحل قد مضى القول في الوحي وأنه قد يكون بمعنى الإلهام ، وهو ما يخلقه الله - تعالى - في القلب ابتداء من غير سبب ظاهر ، وهو من قوله - تعالى - : ونفس وما سواها . فألهمها فجورها وتقواها . ومن ذلك البهائم وما يخلق الله سبحانه فيها من درك منافعها واجتناب مضارها وتدبير معاشها . وقد أخبر - عز وجل - بذلك عن الموات فقال : تحدث أخبارها . بأن ربك أوحى لها . قال إبراهيم الحربي . لله - عز وجل - في الموات قدرة لم يدر ما هي ، لم يأتها رسول من عند الله ولكن الله - تعالى - عرفها ذلك ; أي ألهمها . ولا خلاف بين المتأولين أن الوحي هنا بمعنى الإلهام . وقرأ يحيى بن وثاب \" إلى النحل \" بفتح الحاء . وسمي نحلا لأن الله - عز وجل - نحله العسل الذي يخرج منه ; قاله الزجاج . الجوهري : والنحل والنحلة الدبر يقع على الذكر والأنثى ، حتى يقال : يعسوب . والنحل يؤنث في لغة أهل الحجاز ، وكل جمع ليس بينه وبين واحده إلا الهاء . وروي من حديث أبي هريرة عن النبي - صلى الله عليه وسلم - أنه قال : الذبان كلها في النار يجعلها عذابا لأهل النار إلا النحل ذكره الترمذي الحكيم في نوادر الأصول . وروي عن ابن عباس قال : نهى رسول الله - صلى الله عليه وسلم - عن قتل النملة والنحلة والهدهد والصرد ، خرجه أبو داود أيضا ، وسيأتي في [ النمل ] إن شاء الله - تعالى - .\nالثانية : قوله تعالى : أن اتخذي من الجبال بيوتا ومن الشجر ومما يعرشون هذا إذا لم يكن لها مالك . وجعل الله بيوت النحل في هذه الثلاثة الأنواع ، إما في الجبال وكواها ، وإما في متجوف الأشجار ، وإما فيما يعرش ابن آدم من الأجباح والخلايا والحيطان وغيرها . وعرش معناه هنا هيأ ، وأكثر ما يستعمل فيما يكون من إتقان الأغصان والخشب وترتيب ظلالها ; ومنه العريش الذي صنع لرسول الله - صلى الله عليه وسلم - يوم بدر ، ومن هذا لفظة العرش . يقال : عرش يعرش ويعرش [ بكسر الراء وضمها ] ، وقرئ بهما . قرأ ابن عامر بالضم وسائرهم بالكسر ، واختلف في ذلك عن عاصم .\nالثالثة : قال ابن العربي : ومن عجيب ما خلق الله في النحل أن ألهمها لاتخاذ بيوتها مسدسة ، فبذلك اتصلت حتى صارت كالقطعة الواحدة ، وذلك أن الأشكال من المثلث إلى المعشر إذا جمع كل واحد منها إلى أمثاله لم يتصل وجاءت بينهما فرج ، إلا الشكل المسدس ; فإنه إذا جمع إلى أمثاله اتصل كأنه كالقطعة الواحدة .\n                                    ",
        "saadi": "وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ بُيُوتٗا وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُونَ ٨٦\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 68 و69 :ـ\nفي خلق هذه النحلة الصغيرة، التي هداها الله هذه الهداية العجيبة، ويسر لها المراعي، ثم الرجوع إلى بيوتها التي أصلحتها بتعليم الله لها، وهدايته لها ثم يخرج من بطونها هذا العسل اللذيذ مختلف الألوان بحسب اختلاف أرضها ومراعيها، فيه شفاء للناس من أمراض عديدة. فهذا دليل على كمال عناية الله تعالى، وتمام لطفه بعباده، وأنه الذي لا ينبغي أن يحب غيره ويدعي سواه.\n                                    "
      },
      "originalText": "وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ بُيُوتٗا وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُونَ ٨٦"
    },
    {
      "number": 1970,
      "text": "ثُمَّ كُلِي مِنْ كُلِّ الثَّمَرَاتِ فَاسْلُكِي سُبُلَ رَبِّكِ ذُلُلًا ۚ يَخْرُجُ مِنْ بُطُونِهَا شَرَابٌ مُخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِلنَّاسِ ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَتَفَكَّرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 69,
      "juz": 14,
      "manzil": 3,
      "page": 274,
      "ruku": 232,
      "hizbQuarter": 109,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ ٩٦\n                                    \n                                    \n                                    ثم أذن لها تعالى إذنا قدريا تسخيريا أن تأكل من كل الثمرات ، وأن تسلك الطرق التي جعلها الله تعالى لها مذللة ، أي : سهلة عليها حيث شاءت في هذا الجو العظيم والبراري الشاسعة ، والأودية والجبال الشاهقة ، ثم تعود كل واحدة منها إلى موضعها وبيتها ، لا تحيد عنه يمنة ولا يسرة ، بل إلى بيتها وما لها فيه من فراخ وعسل ، فتبني الشمع من أجنحتها ، وتقيء العسل من فيها وتبيض الفراخ من دبرها ، ثم تصبح إلى مراعيها .\nوقال قتادة ، وعبد الرحمن بن زيد بن أسلم : ( فاسلكي سبل ربك ذللا ) أي : مطيعة . فجعلاه حالا من السالكة . قال ابن زيد : وهو كقول الله تعالى : ( وذللناها لهم فمنها ركوبهم ومنها يأكلون ) [ يس : 72 ] قال : ألا ترى أنهم ينقلون النحل من بيوته من بلد إلى بلد وهو يصحبهم .\nوالقول الأول أظهر ، وهو أنه حال من الطريق ، أي : فاسلكيها مذللة لك ، نص عليه مجاهد . وقال ابن جرير : كلا القولين صحيح .\nوقد قال أبو يعلى الموصلي : حدثنا شيبان بن فروخ ، حدثنا سكين بن عبد العزيز ، عن أنس قال : قال رسول الله - صلى الله عليه وسلم - : \" عمر الذباب أربعون يوما ، والذباب كله في النار إلا النحل \" .\nوقوله تعالى ( يخرج من بطونها شراب مختلف ألوانه ) أي : ما بين أبيض وأصفر وأحمر وغير ذلك من الألوان الحسنة ، على اختلاف مراعيها ومأكلها منها .\nوقوله : ( فيه شفاء للناس ) أي : في العسل شفاء للناس من أدواء تعرض لهم . قال بعض من تكلم على الطب النبوي : لو قال فيه : \" الشفاء للناس \" لكان دواء لكل داء ، ولكن قال ( فيه شفاء للناس ) أي : يصلح لكل أحد من أدواء باردة ، فإنه حار ، والشيء يداوى بضده .\nوقال مجاهد بن جبر في قوله : ( فيه شفاء للناس ) يعني : القرآن .\nوهذا قول صحيح في نفسه ، ولكن ليس هو الظاهر هاهنا من سياق الآية ; فإن الآية إنما ذكر فيها العسل ، ولم يتابع مجاهد على قوله هاهنا ، وإنما الذي قاله ذكروه في قوله تعالى : ( وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ) الآية [ الإسراء : 82 ] . وقوله تعالى : ( يا أيها الناس قد جاءتكم موعظة من ربكم وشفاء لما في الصدور وهدى ورحمة للمؤمنين ) [ يونس : 57 ] .\nوالدليل على أن المراد بقوله تعالى : ( فيه شفاء للناس ) هو العسل - الحديث الذي رواه البخاري ومسلم في صحيحيهما من رواية قتادة ، عن أبي المتوكل علي بن داود الناجي ، عن أبي سعيد الخدري - رضي الله عنه - قال : جاء رجل إلى رسول الله - صلى الله عليه وسلم - فقال : إن أخي استطلق بطنه . فقال : \" اسقه عسلا \" . فسقاه عسلا ثم جاء فقال : يا رسول الله ، سقيته عسلا فما زاده إلا استطلاقا ، قال : \" اذهب فاسقه عسلا \" . فذهب فسقاه ، ثم جاء فقال : يا رسول الله ، ما زاده إلا استطلاقا ، فقال رسول الله - صلى الله عليه وسلم - : \" صدق الله ، وكذب بطن أخيك ، اذهب فاسقه عسلا \" . فذهب فسقاه فبرئ .\nقال بعض العلماء بالطب : كان هذا الرجل عنده فضلات ، فلما سقاه عسلا وهو حار تحللت ، فأسرعت في الاندفاع ، فزاد إسهاله ، فاعتقد الأعرابي أن هذا يضره وهو مصلحة لأخيه ، ثم سقاه فازداد التحليل والدفع ، ثم سقاه فكذلك ، فلما اندفعت الفضلات الفاسدة المضرة بالبدن استمسك بطنه ، وصلح مزاجه ، واندفعت الأسقام والآلام ببركة إشارته - عليه من ربه أفضل الصلاة والسلام - .\nوفي الصحيحين من حديث هشام بن عروة ، عن أبيه ، عن عائشة ، - رضي الله عنها - أن رسول الله - صلى الله عليه وسلم - كان يعجبه الحلواء والعسل . هذا لفظ البخاري .\nوفي صحيح البخاري : من حديث سالم الأفطس ، عن سعيد بن جبير ، عن ابن عباس قال : قال رسول الله - صلى الله عليه وسلم - : \" الشفاء في ثلاثة : في شرطة محجم ، أو شربة عسل ، أو كية بنار ، وأنهى أمتي عن الكي \" .\nوقال البخاري : حدثنا أبو نعيم ، حدثنا عبد الرحمن بن الغسيل ، عن عاصم بن عمر بن قتادة ، سمعت جابر بن عبد الله قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" إن كان في شيء من أدويتكم ، أو يكون في شيء من أدويتكم خير : ففي شرطة محجم ، أو شربة عسل ، أو لذعة بنار توافق الداء ، وما أحب أن أكتوي \" .\nورواه مسلم من حديث عاصم بن عمر بن قتادة ، عن جابر به .\nوقال الإمام أحمد : حدثنا علي بن إسحاق ، أنبأنا عبد الله ، أنبأنا سعيد بن أبي أيوب ، حدثنا عبد الله بن الوليد ، عن أبي الخير ، عن عقبة بن عامر الجهني قال : قال رسول الله - صلى الله عليه وسلم - : \" ثلاث إن كان في شيء شفاء : فشرطة محجم ، أو شربة عسل ، أو كية تصيب ألما ، وأنا أكره الكي ولا أحبه \" .\nورواه الطبراني عن هارون بن ملول المصري ، عن أبي عبد الرحمن المقرئ ، [ عن حيوة بن شريح ] عن عبد الله بن الوليد به . ولفظه : \" إن كان في شيء شفاء : فشرطة محجم \" . . . وذكره وهذا إسناد صحيح ولم يخرجوه .\nوقال الإمام أبو عبد الله محمد بن يزيد بن ماجه القزويني في سننه : حدثنا علي بن سلمة - هو اللبقي - حدثنا زيد بن الحباب ، حدثنا سفيان عن أبي إسحاق ، عن أبي الأحوص ، عن عبد الله - هو ابن مسعود - قال : قال رسول الله - صلى الله عليه وسلم - : \" عليكم بالشفاءين : العسل والقرآن \" .\nوهذا إسناد جيد ، تفرد بإخراجه ابن ماجه مرفوعا . وقد رواه ابن جرير ، عن سفيان بن وكيع ، عن أبيه ، عن سفيان - هو الثوري - به موقوفا : ولهو أشبه .\nوروينا عن أمير المؤمنين علي بن أبي طالب - رضي الله عنه - أنه قال : إذا أراد أحدكم الشفاء فليكتب آية من كتاب الله في صحفة ، وليغسلها بماء السماء ، وليأخذ من امرأته درهما عن طيب نفس منها ، فليشتر به عسلا فليشربه بذلك ، فإنه شفاء . أي : من وجوه ، قال الله : ( وننزل من القرآن ما هو شفاء ) [ الإسراء : 82 ] وقال : ( ونزلنا من السماء ماء مباركا ) [ ق : 9 ] وقال : ( فإن طبن لكم عن شيء منه نفسا فكلوه هنيئا مريئا ) [ النساء : 4 ] وقال في العسل : ( فيه شفاء للناس )\nوقال ابن ماجه أيضا : حدثنا محمود بن خداش ، حدثنا سعيد بن زكريا القرشي ، حدثنا الزبير بن سعيد الهاشمي ، عن عبد الحميد بن سالم ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" من لعق العسل ثلاث غدوات في كل شهر لم يصبه عظيم من البلاء \" .\nالزبير بن سعيد متروك .\nوقال ابن ماجه أيضا : حدثنا إبراهيم بن محمد بن يوسف بن سرح الفريابي ، حدثنا عمرو بن بكر السكسكي ، حدثنا إبراهيم بن أبي عبلة . سمعت أبا أبي بن أم حرام - وكان قد صلى القبلتين - يقول : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" عليكم بالسنى والسنوت ، فإن فيهما شفاء من كل داء إلا السام \" . قيل : يا رسول الله ، وما السام ؟ قال : \" الموت \" .\nقال عمرو : قال ابن أبي عبلة : \" السنوت \" : الشبت . وقال آخرون : بل هو العسل الذي [ يكون ] في زقاق السمن ، وهو قول الشاعر :\nهم السمن بالسنوت لا ألس فيهم وهم يمنعون الجار أن يقردا\nكذا رواه ابن ماجه . وقوله : \" لا ألس فيهم \" أي : لا خلط . وقوله : \" يمنعون الجار أن يقردا \" [ أي يضطهد ويظلم ] .\nوقوله : ( إن في ذلك لآية لقوم يتفكرون ) أي : إن في إلهام الله لهذه الدواب الضعيفة الخلقة إلى السلوك في هذه المهامة والاجتناء من سائر الثمار ، ثم جمعها للشمع والعسل ، وهو من أطيب الأشياء ، ( لآية لقوم يتفكرون ) في عظمة خالقها ومقدرها ومسخرها وميسرها ، فيستدلون بذلك على أنه [ الفاعل ] القادر ، الحكيم العليم ، الكريم الرحيم .\n                                    ",
        "qortoby": "ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ ٩٦\n                                    \n                                    \n                                    قوله تعالى : ثم كلي من كل الثمرات فاسلكي سبل ربك ذللا يخرج من بطونها شراب مختلف ألوانه فيه شفاء للناس إن في ذلك لآية لقوم يتفكرون\nقوله تعالى : ثم كلي من كل الثمرات وذلك أنها إنما تأكل النوار من الأشجار .\nفاسلكي سبل ربك ذللا أي طرق ربك . والسبل : الطرق ، وأضافها إليه لأنه خالقها . أي ادخلي طرق ربك لطلب الرزق في الجبال وخلال الشجر .\nذللا جمع ذلول وهو المنقاد ; أي مطيعة مسخرة . ف ذللا حال من النحل . أي تنقاد وتذهب حيث شاء صاحبها ; لأنها تتبع أصحابها حيث ذهبوا ; قاله ابن زيد . وقيل : المراد بقوله ذللا السبل . يقول : مذلل طرقها سهلة للسلوك عليها ; واختاره الطبري ، وذللا حال من السبل . واليعسوب سيد النحل ، إذا وقف وقفت وإذا سار سارت .\nقوله تعالى : يخرج من بطونها شراب مختلف ألوانه فيه شفاء للناس\nفيه تسع مسائل :\nالأولى : قوله تعالى : يخرج من بطونها رجع الخطاب إلى الخبر على جهة تعديد النعمة والتنبيه على العبرة فقال : يخرج من بطونها شراب يعني العسل . وجمهور الناس على أن العسل يخرج من أفواه النحل ; وورد عن علي بن أبي طالب - رضي الله عنه - أنه قال في تحقيره للدنيا : أشرف لباس ابن آدم فيها لعاب دودة ، وأشرف شرابه رجيع نحلة . فظاهر هذا أنه من غير الفم . وبالجملة فإنه يخرج ولا يدرى من فيها أو أسفلها ، ولكن لا يتم صلاحه إلا بحمي أنفاسها . وقد صنع أرسطاطاليس بيتا من زجاج لينظر إلى كيفية ما تصنع ، فأبت أن تعمل حتى لطخت باطن الزجاج بالطين ; ذكره الغزنوي . وقال : من بطونها لأن استحالة الأطعمة لا تكون إلا في البطن .\nالثانية : قوله تعالى : مختلف ألوانه يريد أنواعه من الأحمر والأبيض والأصفر والجامد والسائل ، والأم واحدة والأولاد مختلفون دليل على أن القدرة نوعته بحسب تنويع الغذاء ، كما يختلف طعمه بحسب اختلاف المراعي ; ومن هذا المعنى قول زينب للنبي - صلى الله عليه وسلم - : ( جرست نحله العرفط ) حين شبهت رائحته برائحة المغافير .\nالثالثة : قوله تعالى : فيه شفاء للناس الضمير للعسل ; قال الجمهور . أي في العسل شفاء للناس . وروي عن ابن عباس والحسن ومجاهد والضحاك والفراء وابن كيسان : الضمير للقرآن ; أي في القرآن شفاء . النحاس : وهذا قول حسن ; أو فيما قصصنا عليكم من الآيات والبراهين شفاء للناس . وقيل : العسل فيه شفاء ، وهذا القول بين أيضا ; لأن أكثر الأشربة والمعجونات التي يتعالج بها أصلها من العسل . قال القاضي أبو بكر بن العربي : من قال إنه القرآن بعيد ما أراه يصح عنهم ، ولو صح نقلا لم يصح عقلا ; فإن مساق الكلام كله للعسل ، ليس للقرآن فيه ذكر . قال ابن عطية : وذهب قوم من أهل الجهالة إلى أن هذه الآية يراد بها أهل البيت وبنو هاشم ، وأنهم النحل ، وأن الشراب القرآن والحكمة ، وقد ذكر هذا بعضهم في مجلس المنصور أبي جعفر العباسي ، فقال له رجل ممن حضر : جعل الله طعامك وشرابك مما يخرج من بطون بني هاشم ، فأضحك الحاضرين وبهت الآخر وظهرت سخافة قوله .\nالرابعة : اختلف العلماء في قوله - تعالى - : فيه شفاء للناس هل هو على عمومه أم لا ; فقالت طائفة : هو على العموم في كل حال ولكل أحد ، فروي عن ابن عمر أنه كان لا يشكو قرحة ولا شيئا إلا جعل عليه عسلا ، حتى الدمل إذا خرج عليه طلى عليه عسلا . وحكى النقاش عن أبي وجرة أنه كان يكتحل بالعسل ويستمشي بالعسل ويتداوى بالعسل . وروي أن عوف بن مالك الأشجعي مرض فقيل له : ألا نعالجك ؟ فقال : ائتوني بالماء ، فإن الله - تعالى - يقول : ونزلنا من السماء ماء مباركا ثم قال : ائتوني بعسل ، فإن الله - تعالى - يقول : فيه شفاء للناس وائتوني بزيت ، فإن الله - تعالى - يقول : من شجرة مباركة فجاءوه بذلك كله فخلطه جميعا ثم شربه فبرئ . ومنهم من قال : إنه على العموم إذا خلط بالخل ويطبخ فيأتي شرابا ينتفع به في كل حالة من كل داء . وقالت طائفة : إن ذلك على الخصوص ولا يقتضي العموم في كل علة وفي كل إنسان ، بل إنه خبر عن أنه يشفي كما يشفي غيره من الأدوية في بعض وعلى حال دون حال ; ففائدة الآية إخبار منه في أنه دواء لما كثر الشفاء به وصار خليطا ومعينا للأدوية في الأشربة والمعاجين ; وليس هذا بأول لفظ خصص فالقرآن مملوء منه ولغة العرب يأتي فيها العام كثيرا بمعنى الخاص والخاص بمعنى العام . ومما يدل على أنه ليس على العموم أن \" شفاء \" نكرة في سياق الإثبات ، ولا عموم فيها باتفاق أهل اللسان ومحققي أهل العلم ومختلفي أهل الأصول . لكن قد حملته طائفة من أهل الصدق والعزم على العموم . فكانوا يستشفون بالعسل من كل الأوجاع والأمراض ، وكانوا يشفون من عللهم ببركة القرآن وبصحة التصديق والإيقان . ابن العربي : ومن ضعفت نيته وغلبته على الدين عادته أخذه مفهوما على قول الأطباء ، والكل من حكم الفعال لما يشاء .\nالخامسة : إن قال قائل : قد رأينا من ينفعه العسل ومن يضره ، فكيف يكون شفاء للناس ؟ قيل له : الماء حياة كل شيء وقد رأينا من يقتله الماء إذا أخذه على ما يضاده من علة في البدن ، وقد رأينا شفاء العسل في أكثر هذه الأشربة ; قال معناه الزجاج . وقد اتفق الأطباء عن بكرة أبيهم على مدح عموم منفعة السكنجبين في كل مرض ، وأصله العسل وكذلك سائر المعجونات ، على أن النبي - صلى الله عليه وسلم - قد حسم داء الإشكال وأزاح وجه الاحتمال حين أمر الذي يشتكي بطنه بشرب العسل ، فلما أخبره أخوه بأنه لم يزده إلا استطلاقا أمره بعود الشراب له فبرئ ; وقال : صدق الله وكذب بطن أخيك .\nالسادسة : اعترض بعض زنادقة الأطباء على هذا الحديث فقال : قد أجمعت الأطباء على أن العسل يسهل فكيف يوصف لمن به الإسهال ; فالجواب أن ذلك القول حق في نفسه لمن حصل له التصديق بنبيه - عليه السلام - ، فيستعمله على الوجه الذي عينه وفي المحل الذي أمره بعقد نية وحسن طوية ، فإنه يرى منفعته ويدرك بركته ، كما قد اتفق لصاحب هذا العسل وغيره كما تقدم . وأما ما حكي من الإجماع فدليل على جهله بالنقل حيث لم يقيد وأطلق . قال الإمام أبو عبد الله المازري : ينبغي أن يعلم أن الإسهال يعرض من ضروب كثيرة ، منها الإسهال الحادث عن التخم والهيضات ; والأطباء مجمعون في مثل هذا على أن علاجه بأن يترك للطبيعة وفعلها ، وإن احتاجت إلى معين على الإسهال أعينت ما دامت القوة باقية ، فأما حبسها فضرر ، فإذا وضح هذا قلنا : فيمكن أن يكون ذلك الرجل أصابه الإسهال عن امتلاء وهيضة فأمره النبي - صلى الله عليه وسلم - بشرب العسل فزاده إلى أن فنيت المادة فوقف الإسهال فوافقه شرب العسل . فإذا خرج هذا عن صناعة الطب أذن ذلك بجهل المعترض بتلك الصناعة . قال : ولسنا نستظهر على قول نبينا بأن يصدقه الأطباء بل لو كذبوه لكذبناهم ولكفرناهم وصدقناه - صلى الله عليه وسلم - ; فإن أوجدونا بالمشاهدة صحة ما قالوه فنفتقر حينئذ إلى تأويل كلام رسول الله - صلى الله عليه وسلم - وتخريجه على ما يصح إذ قامت الدلالة على أنه لا يكذب .\nالسابعة : في قوله - تعالى - : فيه شفاء للناس دليل على جواز التعالج بشرب الدواء وغير ذلك خلافا لمن كره ذلك من جلة العلماء ، وهو يرد على الصوفية الذين يزعمون أن الولاية لا تتم إلا إذا رضي بجميع ما نزل به من البلاء ، ولا يجوز له مداواة . ولا معنى لمن أنكر ذلك ، روى الصحيح عن جابر عن رسول الله - صلى الله عليه وسلم - أنه قال : لكل داء دواء فإذا أصيب دواء الداء برأ بإذن الله . وروى أبو داود والترمذي عن أسامة بن شريك قال : قالت الأعراب : ألا نتداوى يا رسول الله ؟ قال : نعم . يا عباد الله تداووا فإن الله لم يضع داء إلا وضع له شفاء أو دواء إلا داء واحدا قالوا : يا رسول الله وما هو ؟ قال : الهرم لفظ الترمذي ، وقال : حديث حسن صحيح . وروي عن أبي خزامة عن أبيه قال : سألت رسول الله - صلى الله عليه وسلم - فقلت : يا رسول الله ، أرأيت رقى نسترقيها ودواء نتداوى به وتقاة نتقيها ، هل ترد من قدر الله شيئا ؟ قال : هي من قدر الله قال : حديث حسن ، ولا يعرف لأبي خزامة غير هذا الحديث . وقال - صلى الله عليه وسلم - : إن كان في شيء من أدويتكم خير ففي شرطة محجم أو شربة من عسل أو لذعة بنار وما أحب أن أكتوي أخرجه الصحيح . والأحاديث في هذا الباب أكثر من أن تحصى . وعلى إباحة التداوي والاسترقاء جمهور العلماء . روي أن ابن عمر اكتوى من اللقوة ورقي من العقرب . وعن ابن سيرين أن ابن عمر كان يسقي ولده الترياق . وقال مالك : لا بأس بذلك . وقد احتج من كره ذلك بما رواه أبو هريرة قال : قال رسول الله - صلى الله عليه وسلم - : دخلت أمة بقضها وقضيضها الجنة كانوا لا يسترقون ولا يكتوون ولا يتطيرون وعلى ربهم يتوكلون . قالوا : فالواجب على المؤمن أن يترك ذلك اعتصاما بالله وتوكلا عليه وثقة به وانقطاعا إليه ; فإن الله - تعالى - قد علم أيام المرض وأيام الصحة فلو حرص الخلق على تقليل ذلك أو زيادته ما قدروا ; قال الله - تعالى - : ما أصاب من مصيبة في الأرض ولا في أنفسكم إلا في كتاب من قبل أن نبرأها . وممن ذهب إلى هذا جماعة من أهل الفضل والأثر ، وهو قول ابن مسعود وأبي الدرداء رضوان الله عليهم . دخل عثمان بن عفان على ابن مسعود في مرضه الذي قبض فيه فقال له عثمان : ما تشتكي ؟ قال ذنوبي . قال : فما تشتهي ؟ قال : رحمة ربي . قال : ألا أدعو لك طبيبا ؟ قال : الطبيب أمرضني . . . وذكر الحديث . وسيأتي بكماله في فضل الواقعة إن شاء الله - تعالى - . وذكر وكيع قال : حدثنا أبو هلال عن معاوية بن قرة قال : مرض أبو الدرداء فعادوه وقالوا : ألا ندعو لك طبيبا ؟ قال : الطبيب أضجعني . وإلى هذا ذهب الربيع بن خثيم . وكره سعيد بن جبير الرقى . وكان الحسن يكره شرب الأدوية كلها إلا اللبن والعسل . وأجاب الأولون عن الحديث بأنه لا حجة فيه ، لأنه يحتمل أن يكون قصد إلى نوع من الكي مكروه بدليل كي النبي - صلى الله عليه وسلم - أبيا يوم الأحزاب على أكحله لما رمي . وقال : الشفاء في ثلاثة كما تقدم . ويحتمل أن يكون قصد إلى الرقى بما ليس في كتاب الله ، وقد قال - سبحانه وتعالى - : وننزل من القرآن ما هو شفاء على ما يأتي بيانه . ورقى أصحابه وأمرهم بالرقية ; على ما يأتي بيانه .\nالثامنة : ذهب مالك وجماعة أصحابه إلى أن لا زكاة في العسل وإن كان مطعوما مقتاتا . واختلف فيه قول الشافعي ، والذى قطع به في قوله الجديد : أنه لا زكاة فيه . وقال أبو حنيفة بوجوب زكاة العسل في قليله وكثيره ; لأن النصاب عنده فيه ليس بشرط . وقال محمد بن الحسن : لا شيء فيه حتى يبلغ ثمانية أفراق ، والفرق ستة وثلاثون رطلا من أرطال العراق . وقال أبو يوسف : في كل عشرة أزقاق زق ; متمسكا بما رواه الترمذي عن ابن عمر قال : قال رسول الله - صلى الله عليه وسلم - : في العسل في كل عشرة أزقاق زق قال أبو عيسى : في إسناده مقال ، ولا يصح عن النبي - صلى الله عليه وسلم - في هذا الباب كبير شيء ، والعمل على هذا عند أكثر أهل العلم ، وبه يقول أحمد وإسحاق ، وقال بعض أهل العلم : ليس في العسل شيء .\nالتاسعة : قوله تعالى : إن في ذلك لآية لقوم يتفكرون أي يعتبرون ; ومن العبرة في النحل بإنصاف النظر وإلطاف الفكر في عجيب أمرها . فيشهد اليقين بأن ملهمها الصنعة اللطيفة مع البنية الضعيفة ، وحذقها باحتيالها في تفاوت أحوالها هو الله - سبحانه وتعالى - ; كما قال : وأوحى ربك إلى النحل الآية . ثم أنها تأكل الحامض والمر والحلو والمالح والحشائش الضارة ، فيجعله الله - تعالى - عسلا حلوا وشفاء ، وفي هذا دليل على قدرته .\n                                    ",
        "saadi": "ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ ٩٦\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 68 و69 :ـ\nفي خلق هذه النحلة الصغيرة، التي هداها الله هذه الهداية العجيبة، ويسر لها المراعي، ثم الرجوع إلى بيوتها التي أصلحتها بتعليم الله لها، وهدايته لها ثم يخرج من بطونها هذا العسل اللذيذ مختلف الألوان بحسب اختلاف أرضها ومراعيها، فيه شفاء للناس من أمراض عديدة. فهذا دليل على كمال عناية الله تعالى، وتمام لطفه بعباده، وأنه الذي لا ينبغي أن يحب غيره ويدعي سواه.\n                                    "
      },
      "originalText": "ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ ٩٦"
    },
    {
      "number": 1971,
      "text": "وَاللَّهُ خَلَقَكُمْ ثُمَّ يَتَوَفَّاكُمْ ۚ وَمِنْكُمْ مَنْ يُرَدُّ إِلَىٰ أَرْذَلِ الْعُمُرِ لِكَيْ لَا يَعْلَمَ بَعْدَ عِلْمٍ شَيْئًا ۚ إِنَّ اللَّهَ عَلِيمٌ قَدِيرٌ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 70,
      "juz": 14,
      "manzil": 3,
      "page": 274,
      "ruku": 232,
      "hizbQuarter": 109,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱللَّهُ خَلَقَكُمۡ ثُمَّ يَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡ لَا يَعۡلَمَ بَعۡدَ عِلۡمٖ شَيۡ‍ًٔاۚ إِنَّ ٱللَّهَ عَلِيمٞ قَدِيرٞ ٠٧\n                                    \n                                    \n                                    يخبر تعالى عن تصرفه في عباده ، وأنه هو الذي أنشأهم من العدم ، ثم بعد ذلك يتوفاهم ، ومنهم من يتركه حتى يدركه الهرم - وهو الضعف في الخلقة - كما قال الله تعالى : ( الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا وشيبة يخلق ما يشاء وهو العليم القدير ) [ الروم : 54 ] .\nوقد روي عن علي - رضي الله عنه - في أرذل العمر [ قال ] خمس وسبعون سنة . وفي هذا السن يحصل له ضعف القوى والخرف وسوء الحفظ وقلة العلم ; ولهذا قال : ( لكي لا يعلم بعد علم شيئا ) أي : بعدما كان عالما أصبح لا يدري شيئا من الفند والخرف ; ولهذا روى البخاري عند تفسير هذه الآية :\nحدثنا موسى بن إسماعيل ، حدثنا هارون بن موسى أبو عبد الله الأعور ، عن شعيب ، عن أنس بن مالك أن رسول الله - صلى الله عليه وسلم - كان يدعو : \" أعوذ بك من البخل والكسل ، والهرم وأرذل العمر ، وعذاب القبر ، وفتنة الدجال ، وفتنة المحيا والممات \" .\nورواه مسلم من حديث هارون الأعور به .\nوقال زهير بن أبي سلمى في معلقته المشهورة :\nسئمت تكاليف الحياة ومن يعش ثمانين عاما - لا أبا لك - يسأم رأيت المنايا خبط عشواء من تصب\nتمته ومن تخطئ يعمر فيهرم\n                                    ",
        "qortoby": "وَٱللَّهُ خَلَقَكُمۡ ثُمَّ يَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡ لَا يَعۡلَمَ بَعۡدَ عِلۡمٖ شَيۡ‍ًٔاۚ إِنَّ ٱللَّهَ عَلِيمٞ قَدِيرٞ ٠٧\n                                    \n                                    \n                                    قوله تعالى : والله خلقكم ثم يتوفاكم ومنكم من يرد إلى أرذل العمر لكي لا يعلم بعد علم شيئا إن الله عليم قدير قوله تعالى : والله خلقكم ثم يتوفاكم بين معناه . ومنكم من يرد إلى أرذل العمر يعني أردأه وأوضعه . وقيل : الذي ينقص قوته وعقله ويصيره إلى الخرف ونحوه . وقال ابن عباس : يعني إلى أسفل العمر ، يصير كالصبي الذي لا عقل له ; والمعنى متقارب . وفي صحيح البخاري عن أنس بن مالك قال كان رسول الله - صلى الله عليه وسلم - يتعوذ يقول : اللهم إني أعوذ بك من الكسل وأعوذ بك من الجبن وأعوذ بك من الهرم وأعوذ بك من البخل . وفي حديث سعد بن أبي وقاص وأعوذ بك أن أرد إلى أرذل العمر الحديث . خرجه البخاري .\nلكي لا يعلم بعد علم شيئا إن الله عليم قدير أي يرجع إلى حالة الطفولية فلا يعلم ما كان يعلم قبل من الأمور لفرط الكبر . وقد قيل : هذا لا يكون للمؤمن ، لأن المؤمن لا ينزع عنه علمه . وقيل : المعنى لكيلا يعمل بعد علم شيئا ; فعبر عن العمل بالعلم لافتقاره إليه ; لأن تأثير الكبر في عمله أبلغ من تأثيره في علمه . والمعنى المقصود الاحتجاج على منكري البعث ، أي الذي رده إلى هذه الحال قادر على أن يميته ثم يحييه .\n                                    ",
        "saadi": "وَٱللَّهُ خَلَقَكُمۡ ثُمَّ يَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡ لَا يَعۡلَمَ بَعۡدَ عِلۡمٖ شَيۡ‍ًٔاۚ إِنَّ ٱللَّهَ عَلِيمٞ قَدِيرٞ ٠٧\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه الذي خلق العباد ونقلهم في الخلقة، طورا بعد طور، ثم بعد أن يستكملوا آجالهم يتوفاهم، ومنهم من يعمره حتى { يُرَدُّ إِلَى أَرْذَلِ الْعُمُرِ } أي: أخسه الذي يبلغ به الإنسان إلى ضعف القوى الظاهرة والباطنة حتى العقل الذي هو جوهر الإنسان يزيد ضعفه حتى إنه ينسى ما كان يعلمه، ويصير عقله كعقل الطفل ولهذا قال: { لِكَيلَا يَعْلَمَ بَعْدَ عِلْمٍ شَيْئًا إِنَّ اللَّهَ عَلِيمٌ قَدِيرٌ } أي: قد أحاط علمه وقدرته بجميع الأشياء ومن ذلك ما ينقل به الآدمي من أطوار الخلقة، خلقا بعد خلق كما قال تعالى: { اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ ثُمَّ جَعَلَ مِنْ بَعْدِ ضَعْفٍ قُوَّةً ثُمَّ جَعَلَ مِنْ بَعْدِ قُوَّةٍ ضَعْفًا وَشَيْبَةً يَخْلُقُ مَا يَشَاءُ وَهُوَ الْعَلِيمُ الْقَدِيرُ }\n                                    "
      },
      "originalText": "وَٱللَّهُ خَلَقَكُمۡ ثُمَّ يَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡ لَا يَعۡلَمَ بَعۡدَ عِلۡمٖ شَيۡ‍ًٔاۚ إِنَّ ٱللَّهَ عَلِيمٞ قَدِيرٞ ٠٧"
    },
    {
      "number": 1972,
      "text": "وَاللَّهُ فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْضٍ فِي الرِّزْقِ ۚ فَمَا الَّذِينَ فُضِّلُوا بِرَادِّي رِزْقِهِمْ عَلَىٰ مَا مَلَكَتْ أَيْمَانُهُمْ فَهُمْ فِيهِ سَوَاءٌ ۚ أَفَبِنِعْمَةِ اللَّهِ يَجْحَدُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 71,
      "juz": 14,
      "manzil": 3,
      "page": 274,
      "ruku": 233,
      "hizbQuarter": 109,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ فَمَا ٱلَّذِينَ فُضِّلُواْ بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَهُمۡ فِيهِ سَوَآءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ يَجۡحَدُونَ ١٧\n                                    \n                                    \n                                    يبين تعالى للمشركين جهلهم وكفرهم فيما زعموه لله من الشركاء ، وهم يعترفون أنها عبيد له ، كما كانوا يقولون في تلبياتهم في حجهم : \" لبيك لا شريك لك ، إلا شريكا هو لك ، تملكه وما ملك \" . فقال تعالى منكرا عليهم : إنكم لا ترضون أن تساووا عبيدكم فيما رزقناكم ، فكيف يرضى هو تعالى بمساواة عبيده له في الإلهية والتعظيم ، كما قال في الآية الأخرى : ( ضرب لكم مثلا من أنفسكم هل لكم من ما ملكت أيمانكم من شركاء في ما رزقناكم فأنتم فيه سواء تخافونهم كخيفتكم أنفسكم ) الآية [ الروم : 28 ] .\nقال العوفي ، عن ابن عباس في هذه الآية : يقول : لم يكونوا ليشركوا عبيدهم في أموالهم ونسائهم ، فكيف يشركون عبيدي معي في سلطاني ، فذلك قوله : ( أفبنعمة الله يجحدون )\nوقال في الرواية الأخرى عنه : فكيف ترضون لي ما لا ترضون لأنفسكم .\nوقال مجاهد في هذه الآية : هذا مثل للآلهة الباطلة .\nوقال قتادة : هذا مثل ضربه الله ، فهل منكم من أحد شارك مملوكه في زوجته وفي فراشه ، فتعدلون بالله خلقه وعباده ؟ فإن لم ترض لنفسك هذا ، فالله أحق أن ينزه منك .\nوقوله : ( أفبنعمة الله يجحدون ) أي : أنهم جعلوا لله مما ذرأ من الحرث والأنعام نصيبا ، فجحدوا نعمته وأشركوا معه غيره .\nوعن الحسن البصري قال : كتب عمر بن الخطاب - رضي الله عنه - هذه الرسالة إلى أبي موسى الأشعري : واقنع برزقك من الدنيا ، فإن الرحمن فضل بعض عباده على بعض في الرزق ، بل يبتلي به كلا ، فيبتلي من بسط له كيف شكره لله وأداؤه الحق الذي افترض عليه فيما رزقه وخوله . رواه ابن أبي حاتم .\n                                    ",
        "qortoby": "وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ فَمَا ٱلَّذِينَ فُضِّلُواْ بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَهُمۡ فِيهِ سَوَآءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ يَجۡحَدُونَ ١٧\n                                    \n                                    \n                                    قوله تعالى : والله فضل بعضكم على بعض في الرزق فما الذين فضلوا برادي رزقهم على ما ملكت أيمانهم فهم فيه سواء أفبنعمة الله يجحدون\nقوله تعالى : والله فضل بعضكم على بعض في الرزق أي جعل منكم غنيا وحرا وعبدا .\nفما الذين فضلوا أي في الرزق .\nبرادي رزقهم على ما ملكت أيمانهم أي لا يرد المولى على ما ملكت يمينه مما رزق شيئا حتى يستوي المملوك والمالك في المال . وهذا مثل ضربه الله لعبدة الأصنام ، أي إذا لم يكن عبيدكم معكم سواء فكيف تجعلون عبيدي معي سواء ; فلما لم يكن يشركهم عبيدهم في أموالهم لم يجز لهم أن يشاركوا الله - تعالى - في عبادة غيره من الأوثان والأنصاب وغيرهما مما عبد ; كالملائكة والأنبياء وهم عبيده وخلقه . حكى معناه الطبري ، وقاله ابن عباس ومجاهد وقتادة وغيرهم . وعن ابن عباس أيضا أنها نزلت في نصارى نجران حين قالوا عيسى ابن الله فقال الله لهم فما الذين فضلوا برادي رزقهم على ما ملكت أيمانهم أي لا يرد المولى على ما ملكت يمينه مما رزق حتى يكون المولى والعبد في المال شرعا سواء ، فكيف ترضون لي ما لا ترضون لأنفسكم فتجعلون لي ولدا من عبيدي . ونظيرها ضرب لكم مثلا من أنفسكم هل لكم من ما ملكت أيمانكم من شركاء في ما رزقناكم فأنتم فيه سواء على ما يأتي . ودل هذا على أن العبد لا يملك ، على ما يأتي آنفا .\n                                    ",
        "saadi": "وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ فَمَا ٱلَّذِينَ فُضِّلُواْ بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَهُمۡ فِيهِ سَوَآءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ يَجۡحَدُونَ ١٧\n                                        \n                                        \n                                        \n                                        وهذا من أدلة توحيده وقبح الشرك به، يقول تعالى: كما أنكم مشتركون بأنكم مخلوقون مرزوقون إلا أنه تعالى { فَضَّلَ بَعْضَكُمْ عَلَى بَعْضٍ فِي الرِّزْقِ } فجعل منكم أحرارا لهم مال وثروة، ومنكم أرقاء لهم لا يملكون شيئا من الدنيا، فكما أن سادتهم الذين فضلهم الله عليهم بالرزق ليسوا { بِرَادِّي رِزْقِهِمْ عَلَى مَا مَلَكَتْ أَيْمَانُهُمْ فَهُمْ فِيهِ سَوَاءٌ } ويرون هذا من الأمور الممتنعة، فكذلك من أشركتم بها مع الله، فإنها عبيد ليس لها من الملك مثقال ذرة، فكيف تجعلونها شركاء لله تعالى؟!\nهل هذا إلا من أعظم الظلم والجحود لنعم الله؟\" ولهذا قال: { أَفَبِنِعْمَةِ اللَّهِ يَجْحَدُونَ } فلو أقروا بالنعمة ونسبوها إلى من أولاها، لما أشركوا به أحدا.\n                                    "
      },
      "originalText": "وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖ فِي ٱلرِّزۡقِۚ فَمَا ٱلَّذِينَ فُضِّلُواْ بِرَآدِّي رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَيۡمَٰنُهُمۡ فَهُمۡ فِيهِ سَوَآءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ يَجۡحَدُونَ ١٧"
    },
    {
      "number": 1973,
      "text": "وَاللَّهُ جَعَلَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا وَجَعَلَ لَكُمْ مِنْ أَزْوَاجِكُمْ بَنِينَ وَحَفَدَةً وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ ۚ أَفَبِالْبَاطِلِ يُؤْمِنُونَ وَبِنِعْمَتِ اللَّهِ هُمْ يَكْفُرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 72,
      "juz": 14,
      "manzil": 3,
      "page": 274,
      "ruku": 233,
      "hizbQuarter": 109,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَجَعَلَ لَكُم مِّنۡ أَزۡوَٰجِكُم بَنِينَ وَحَفَدَةٗ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ يَكۡفُرُونَ ٢٧\n                                    \n                                    \n                                    يذكر تعالى نعمه على عبيده ، بأن جعل لهم من أنفسهم أزواجا من جنسهم وشكلهم [ وزيهم ] ولو جعل الأزواج من نوع آخر لما حصل ائتلاف ومودة ورحمة ، ولكن من رحمته خلق من بني آدم ذكورا وإناثا ، وجعل الإناث أزواجا للذكور .\nثم ذكر تعالى أنه جعل من الأزواج البنين والحفدة ، وهم أولاد البنين . قاله ابن عباس ، وعكرمة ، والحسن ، والضحاك ، وابن زيد .\nقال شعبة ، عن أبى بشر ، عن سعيد بن جبير ، عن ابن عباس : ( بنين وحفدة ) هم الولد وولد الولد .\nوقال سنيد : حدثنا حجاج عن أبي بكر ، عن عكرمة ، عن ابن عباس قال : بنوك حين يحفدونك ويرفدونك ويعينونك ويخدمونك . قال جميل :\nحفد الولائد حولهن وأسلمت بأكفهن أزمة الأجمال\nوقال مجاهد : ( بنين وحفدة ) ابنه وخادمه . وقال في رواية : الحفدة : الأنصار والأعوان والخدام .\nوقال طاوس : الحفدة : الخدم وكذا قال قتادة ، وأبو مالك ، والحسن البصري .\nوقال عبد الرزاق : أنبأنا معمر ، عن الحكم بن أبان ، عن عكرمة أنه قال : الحفدة : من خدمك من ولدك وولد ولدك .\nقال الضحاك : إنما كانت العرب يخدمها بنوها .\nوقال العوفي ، عن ابن عباس قوله : ( وجعل لكم من أزواجكم بنين وحفدة ) يقول : بنو امرأة الرجل ليسوا منه . ويقال : الحفدة : الرجل يعمل بين يدي الرجل ، يقال : فلان يحفد لنا قال : ويزعم رجال أن الحفدة أختان الرجل .\nوهذا [ القول ] الأخير الذي ذكره ابن عباس قاله ابن مسعود ، ومسروق ، وأبو الضحى ، وإبراهيم النخعي ، وسعيد بن جبير ، ومجاهد ، والقرظي . ورواه عكرمة ، عن ابن عباس .\nوقال علي بن أبي طلحة ، عن ابن عباس : هم الأصهار .\nقال ابن جرير : وهذه الأقوال كلها داخلة في معنى : \" الحفد \" وهو الخدمة ، الذي منه قوله في القنوت : \" وإليك نسعى ونحفد \" ولما كانت الخدمة قد تكون من الأولاد والأصهار والخدم فالنعمة حاصلة بهذا كله ; ولهذا قال : ( وجعل لكم من أزواجكم بنين وحفدة )\nقلت : فمن جعل ) وحفدة ) متعلقا بأزواجكم فلا بد أن يكون المراد الأولاد ، وأولاد الأولاد ، والأصهار ; لأنهم أزواج البنات ، وأولاد الزوجة ، وكما قال الشعبي والضحاك فإنهم غالبا يكونون تحت كنف الرجل وفي حجره وفي خدمته . وقد يكون هذا هو المراد من قوله [ عليه الصلاة ] والسلام في حديث بصرة بن أكثم : \" والولد عبد لك \" رواه أبو داود .\nوأما من جعل الحفدة هم الخدم فعنده أنه معطوف على قوله : ( والله جعل لكم من أنفسكم أزواجا ) أي : وجعل لكم الأزواج والأولاد .\n( ورزقكم من الطيبات ) من المطاعم والمشارب .\nثم قال تعالى منكرا على من أشرك في عبادة المنعم غيره : ( أفبالباطل يؤمنون ) وهم : الأصنام والأنداد ، ( وبنعمة الله هم يكفرون ) أي : يسترون نعم الله عليهم ويضيفونها إلى غيره .\nوفي الحديث الصحيح : \" إن الله تعالى يقول للعبد يوم القيامة ممتنا عليه \" ألم أزوجك ؟ ألم أكرمك ؟ ألم أسخر لك الخيل والإبل وأذرك ترأس وتربع ؟ \" .\n                                    ",
        "qortoby": "وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَجَعَلَ لَكُم مِّنۡ أَزۡوَٰجِكُم بَنِينَ وَحَفَدَةٗ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ يَكۡفُرُونَ ٢٧\n                                    \n                                    \n                                    قوله تعالى : والله جعل لكم من أنفسكم أزواجا وجعل لكم من أزواجكم بنين وحفدة ورزقكم من الطيبات أفبالباطل يؤمنون وبنعمة الله هم يكفرون\nوالله جعل لكم من أنفسكم أزواجا جعل بمعنى خلق وقد تقدم من أنفسكم أزواجا يعني آدم خلق منه حواء . وقيل : المعنى جعل لكم من أنفسكم ، أي من جنسكم ونوعكم وعلى خلقتكم ; كما قال : لقد جاءكم رسول من أنفسكم أي من الآدميين . وفي هذا رد على العرب التي كانت تعتقد أنها كانت تزوج الجن وتباضعها ، حتى روي أن عمرو بن هند تزوج منهم غولا وكان يخبئوها عن البرق لئلا تراه فتنفر ، فلما كان في بعض الليالي لمع البرق وعاينته السعلاة فقالت : عمرو ! ونفرت ، فلم يرها أبدا . وهذا من أكاذيبها ، وإن كان جائزا في حكم الله وحكمته فهو رد على الفلاسفة الذين ينكرون وجود الجن ويحيلون طعامهم . \" أزواجا \" زوج الرجل هي ثانيته ، فإنه فرد فإذا انضافت إليه كانا زوجين ، وإنما جعلت الإضافة إليه دونها لأنه أصلها في الوجود كما تقدم .\nقوله تعالى : وجعل لكم من أزواجكم بنين وحفدة فيه خمس مسائل :\nالأولى : قوله تعالى : وجعل لكم من أزواجكم بنين ظاهر في تعديد النعمة في الأبناء ، ووجود الأبناء يكون منهما معا ; ولكنه لما كان خلق المولود فيها وانفصاله عنها أضيف إليها ، ولذلك تبعها في الرق والحرية وصار مثلها في المالية . قال ابن العربي : سمعت إمام الحنابلة بمدينة السلام أبا الوفاء علي بن عقيل يقول : إنما تبع الولد الأم في المالية وصار بحكمها في الرق والحرية ; لأنه انفصل عن الأب نطفة لا قيمة له ولا مالية فيه ولا منفعة ، وإنما اكتسب ما اكتسب بها ومنها فلأجل ذلك تبعها . كما لو أكل رجل تمرا في أرض رجل وسقطت منه نواة في الأرض من يد الآكل فصارت نخلة فإنها ملك صاحب الأرض دون الآكل بإجماع من الأمة لأنها انفصلت عن الآكل ولا قيمة لها .\nالثانية : قوله تعالى : وحفدة روى ابن القاسم عن مالك قال وسألته عن قوله - تعالى - : بنين وحفدة قال : الحفدة الخدم والأعوان في رأيي . وروي عن ابن عباس في قوله - تعالى - : وحفدة قال هم الأعوان ، من أعانك فقد حفدك . قيل له : فهل تعرف العرب ذلك ؟ قال نعم وتقول أوما سمعت قول الشاعر :\nحفد الولائد حولهن وأسلمت بأكفهن أزمة الأجمال\nأي أسرعن الخدمة . والولائد : الخدم ، الواحدة وليدة ; قال الأعشى :\nكلفت مجهولها نوقا يمانية إذا الحداة على أكسائها حفدوا\nأي أسرعوا . وقال ابن عرفة : الحفدة عند العرب الأعوان ، فكل من عمل عملا أطاع فيه وسارع فهو حافد ، قال : ومنه قولهم إليك نسعى ونحفد ، والحفدان السرعة . قال أبو عبيد : الحفد العمل والخدمة . وقال الخليل بن أحمد : الحفدة عند العرب الخدم ، وقاله مجاهد . وقال الأزهري : قيل الحفدة أولاد الأولاد . وروي عن ابن عباس . وقيل الأختان ; قاله ابن مسعود وعلقمة وأبو الضحى وسعيد بن جبير وإبراهيم ; ومنه قول الشاعر :\nفلو أن نفسي طاوعتني لأصبحت لها حفد ما يعد كثير\nولكنها نفس علي أبية عيوف لإصهار اللئام قذور\nوروى زر عن عبد الله قال : الحفدة الأصهار ; وقاله إبراهيم ، والمعنى متقارب . قال الأصمعي : الختن من كان من قبل المرأة ، مثل أبيها وأخيها وما أشبههما ; والأصهار منها جميعا . يقال : أصهر فلان إلى بني فلان وصاهر . وقول عبد الله هم الأختان ، يحتمل المعنيين جميعا . يحتمل أن يكون أراد أبا المرأة وما أشبهه من أقربائها ، ويحتمل أن يكون أراد وجعل لكم من أزواجكم بنين وبنات تزوجونهن ، فيكون لكم بسببهن أختان . وقال عكرمة : الحفدة من نفع الرجل من ولده ; وأصله من حفد يحفد - بفتح العين في الماضي وكسرها في المستقبل - إذا أسرع في سيره ; كما قال كثير :\nحفد الولائد بينهن . . . البيت\nويقال : حفدت وأحفدت ، لغتان إذا خدمت . ويقال : حافد وحفد ; مثل خادم وخدم ، وحافد وحفدة مثل كافر وكفرة . قال المهدوي : ومن جعل الحفدة الخدم جعله منقطعا مما قبله ينوي به التقديم ; كأنه قال : جعل لكم حفدة وجعل لكم من أزواجكم بنين .\nقلت : ما قاله الأزهري من أن الحفدة أولاد الأولاد هو ظاهر القرآن بل نصه ; ألا ترى أنه قال : وجعل لكم من أزواجكم بنين وحفدة فجعل الحفدة والبنين منهن . وقال ابن العربي : الأظهر عندي في قوله بنين وحفدة أن البنين أولاد الرجل لصلبه والحفدة أولاد ولده ، وليس في قوة اللفظ أكثر من هذا ، ويكون تقدير الآية على هذا : وجعل لكم من أزواجكم بنين ومن البنين حفدة . وقال معناه الحسن .\nالثالثة : إذا فرعنا على قول مجاهد وابن عباس ومالك وعلماء اللغة في قولهم إن الحفدة الخدم والأعوان ، فقد خرجت خدمة الولد والزوجة من القرآن بأبدع بيان ; قاله ابن العربي . روى البخاري وغيره عن سهل بن سعد أن أبا أسيد الساعدي دعا النبي - صلى الله عليه وسلم - لعرسه فكانت امرأته خادمهم . . . الحديث ، وقد تقدم في سورة \" هود \" وفي الصحيح عن عائشة قالت : أنا فتلت قلائد بدن النبي - صلى الله عليه وسلم - بيدي . الحديث . ولهذا قال علماؤنا : عليها أن تفرش الفراش وتطبخ القدر وتقم الدار ، بحسب حالها وعادة مثلها ; قال الله - تعالى - : وجعل منها زوجها ليسكن إليها فكأنه جمع لنا فيها السكن والاستمتاع وضربا من الخدمة بحسب جري العادة .\nالرابعة : ويخدم الرجل زوجته فيما خف من الخدمة ويعينها ، لما روته عائشة أن النبي - صلى الله عليه وسلم - كان يكون في مهنة أهله فإذا سمع الأذان خرج . وهذا قول مالك : ويعينها . وفي أخلاق النبي - صلى الله عليه وسلم - أنه كان يخصف النعل ويقم البيت ويخيط الثوب . وقالت عائشة وقد قيل لها : ما كان يعمل رسول الله - صلى الله عليه وسلم - في بيته ؟ قالت : كان بشرا من البشر يفلي ثوبه ويحلب شاته ويخدم نفسه .\nالخامسة : وينفق على خادمة واحدة ، وقيل على أكثر ; على قدر الثروة والمنزلة . وهذا أمر دائر على العرف الذي هو أصل من أصول الشريعة ، فإن نساء الأعراب وسكان البوادي يخدمن أزواجهن في استعذاب الماء وسياسة الدواب ، ونساء الحواضر يخدم المقل منهم زوجته فيما خف ويعينها ، وأما أهل الثروة فيخدمون أزواجهن ويترفهن معهم إذا كان لهم منصب ذلك ; فإن كان أمرا مشكلا شرطت عليه الزوجة ذلك ، فتشهد أنه قد عرف أنها ممن لا تخدم نفسها فالتزم إخدامها ، فينفذ ذلك وتنقطع الدعوى فيه .\nقوله تعالى : ورزقكم من الطيبات أي من الثمار والحبوب والحيوان .\nأفبالباطل يعني الأصنام ; قاله ابن عباس . يؤمنون قراءة الجمهور بالياء . وقرأ أبو عبد الرحمن بالتاء .\nوبنعمة الله أي بالإسلام . هم يكفرون .\n                                    ",
        "saadi": "وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَجَعَلَ لَكُم مِّنۡ أَزۡوَٰجِكُم بَنِينَ وَحَفَدَةٗ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ يَكۡفُرُونَ ٢٧\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن منته العظيمة على عباده، حيث جعل لهم أزواجا ليسكنوا إليها، وجعل لهم من أزواجهم أولادا تقرُّ بهم أعينهم ويخدمونهم، ويقضون حوائجهم، وينتفعون بهم من وجوه كثيرة، ورزقهم من الطيبات من جميع المآكل والمشارب، والنعم الظاهرة التي لا يقدر العباد أن يحصوها.\n{ أَفَبِالْبَاطِلِ يُؤْمِنُونَ وَبِنِعْمَةِ اللَّهِ هُمْ يَكْفُرُونَ } أي: أيؤمنون بالباطل الذي لم يكن شيئا مذكورا ثم أوجده الله وليس له من وجوده سوى العدم فلا تخلق ولا ترزق ولا تدبر من الأمر شيئا، وهذا عام لكل ما عبد من دون الله فإنها باطلة فكيف يتخذها المشركون من دون الله؟\"\n{ وَبِنِعْمَةِ اللَّهِ هُمْ يَكْفُرُونَ } يجحدونها ويستعينون بها على معاصي الله والكفر به، هل هذا إلا من أظلم الظلم وأفجر الفجور وأسفه السفه؟\"\n                                    "
      },
      "originalText": "وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَجَعَلَ لَكُم مِّنۡ أَزۡوَٰجِكُم بَنِينَ وَحَفَدَةٗ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَٰتِۚ أَفَبِٱلۡبَٰطِلِ يُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ يَكۡفُرُونَ ٢٧"
    }
  ]
}