{
  "number": 276,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 1981,
      "text": "وَاللَّهُ جَعَلَ لَكُمْ مِنْ بُيُوتِكُمْ سَكَنًا وَجَعَلَ لَكُمْ مِنْ جُلُودِ الْأَنْعَامِ بُيُوتًا تَسْتَخِفُّونَهَا يَوْمَ ظَعْنِكُمْ وَيَوْمَ إِقَامَتِكُمْ ۙ وَمِنْ أَصْوَافِهَا وَأَوْبَارِهَا وَأَشْعَارِهَا أَثَاثًا وَمَتَاعًا إِلَىٰ حِينٍ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 80,
      "juz": 14,
      "manzil": 3,
      "page": 276,
      "ruku": 234,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ ٠٨\n                                    \n                                    \n                                    يذكر تبارك وتعالى تمام نعمه على عبيده ، بما جعل لهم من البيوت التي هي سكن لهم ، يأوون إليها ، ويستترون بها ، وينتفعون بها سائر وجوه الانتفاع ، وجعل لهم أيضا ( من جلود الأنعام بيوتا ) أي : من الأدم ، يستخفون حملها في أسفارهم ، ليضربوها لهم في إقامتهم في السفر والحضر ولهذا قال : ( تستخفونها يوم ظعنكم ويوم إقامتكم ومن أصوافها ) أي : الغنم ، ( وأوبارها ) أي : الإبل ، ( وأشعارها ) أي : المعز - والضمير عائد على الأنعام - ( أثاثا ) أي : تتخذون منه أثاثا وهو المال . وقيل : المتاع . وقيل : الثياب والصحيح أعم من هذا كله ، فإنه يتخذ من الأثاث البسط والثياب وغير ذلك ، ويتخذ مالا وتجارة .\nوقال ابن عباس : الأثاث : المتاع . وكذا قال مجاهد ، وعكرمة ، وسعيد بن جبير ، والحسن ، وعطية العوفي ، وعطاء الخراساني ، والضحاك ، وقتادة .\nوقوله : ( إلى حين ) أي : إلى أجل مسمى ووقت معلوم .\n                                    ",
        "qortoby": "وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ ٠٨\n                                    \n                                    \n                                    قوله تعالى : والله جعل لكم من بيوتكم سكنا وجعل لكم من جلود الأنعام بيوتا تستخفونها يوم ظعنكم ويوم إقامتكم ومن أصوافها وأوبارها وأشعارها أثاثا ومتاعا إلى حين\nفيه عشر مسائل :\nالأولى : قوله تعالى : جعل لكم معناه صير . وكل ما علاك فأظلك فهو سقف وسماء ، وكل ما أقلك فهو أرض ، وكل ما سترك من جهاتك الأربع فهو جدار ; فإذا انتظمت واتصلت فهو بيت . وهذه الآية فيها تعديد نعم الله - تعالى - على الناس في البيوت ، فذكر أولا بيوت المدن وهي التي للإقامة الطويلة . وقوله : سكنا أي تسكنون فيها وتهدأ جوارحكم من الحركة ، وقد تتحرك فيه وتسكن في غيره ; إلا أن القول خرج على الغالب . وعد هذا في جملة النعم فإنه لو شاء خلق العبد مضطربا أبدا كالأفلاك لكان ذلك كما خلق وأراد ، لو خلقه ساكنا كالأرض لكان كما خلق وأراد ، ولكنه أوجده خلقا يتصرف للوجهين ، ويختلف حاله بين الحالتين ، وردده كيف وأين . والسكن مصدر يوصف به الواحد والجمع .\nثم ذكر - تعالى - بيوت النقلة والرحلة وهي :\nالثانية : فقال وجعل لكم من جلود الأنعام بيوتا تستخفونها أي من الأنطاع والأدم . بيوتا يعني الخيام والقباب يخف عليكم حملها في الأسفار .\nيوم ظعنكم الظعن : سير البادية في الانتجاع والتحول من موضع إلى موضع ; ومنه قول عنترة :\nظعن الذين فراقهم أتوقع وجرى ببينهم الغراب الأبقع\nوالظعن الهودج أيضا ; قال :\nألا هل هاجك الأظعان إذ بانوا وإذ جادت بوشك البين غربان\nوقرئ بإسكان العين وفتحها كالشعر والشعر . وقيل : يحتمل أن يعم بيوت الأدم وبيوت الشعر وبيوت الصوف ; لأن هذه من الجلود لكونها ثابتة فيها ; نحا إلى ذلك ابن سلام . وهو احتمال حسن ، ويكون قوله ومن أصوافها ابتداء كلام ، كأنه قال جعل أثاثا ; يريد الملابس والوطاء ، وغير ذلك ; قال الشاعر :\nأهاجتك الظعائن يوم بانوا بذي الزي الجميل من الأثاث\nويحتمل أن يريد بقوله من جلود الأنعام بيوت الأدم فقط كما قدمناه أولا . ويكون قوله ومن أصوافها عطفا على قوله من جلود الأنعام أي جعل بيوتا أيضا . قال ابن العربي : وهذا أمر انتشر في تلك الديار ، وعزبت عنه بلادنا ، فلا تضرب الأخبية عندنا إلا من الكتان والصوف ، وقد كان للنبي - صلى الله عليه وسلم - قبة من أدم ، وناهيك من أدم الطائف غلاء في القيمة ، واعتلاء في الصنعة ، وحسنا في البشرة ، ولم يعد ذلك - صلى الله عليه وسلم - ترفا ولا رآه سرفا ; لأنه مما امتن الله سبحانه من نعمته وأذن فيه من متاعه ، وظهرت وجوه منفعته في الاكتنان والاستظلال الذي لا يقدر على الخروج عنه جنس الإنسان . ومن غريب ما جرى أني زرت بعض المتزهدين من الغافلين مع بعض المحدثين ، فدخلنا عليه في خباء كتان فعرض عليه صاحبي المحدث أن يحمله إلى منزله ضيفا ، وقال : إن هذا موضع يكثر فيه الحر والبيت أرفق بك وأطيب لنفسي فيك ; فقال : هذا الخباء لنا كثير ، وكان في صنعنا من الحقير ; فقلت : ليس كما زعمت فقد كان لرسول الله - صلى الله عليه وسلم - وهو رئيس الزهاد قبة من أدم طائفي يسافر معها ويستظل بها ; فبهت ، ورأيته على منزلة من العي فتركته مع صاحبي وخرجت عنه .\nالثالثة : قوله تعالى : ومن أصوافها وأوبارها وأشعارها أذن الله سبحانه بالانتفاع بصوف الغنم ووبر الإبل وشعر المعز ، كما أذن في الأعظم ، وهو ذبحها وأكل لحومها ، ولم يذكر القطن والكتان لأنه لم يكن في بلاد العرب المخاطبين به ، وإنما عدد عليهم ما أنعم به عليهم ، وخوطبوا فيما عرفوا بما فهموا . وما قام مقام هذه وناب منابها فيدخل في الاستعمال والنعمة مدخلها ; وهذا كقوله - تعالى - : وينزل من السماء من جبال فيها من برد ; فخاطبهم بالبرد لأنهم كانوا يعرفون نزوله كثيرا عندهم ، وسكت عن ذكر الثلج ; لأنه لم يكن في بلادهم ، وهو مثله في الصفة والمنفعة ، وقد ذكرهما النبي - صلى الله عليه وسلم - معا في التطهير فقال : اللهم اغسلني بماء وثلج وبرد . قال ابن عباس : الثلج شيء أبيض ينزل من السماء وما رأيته قط . وقيل : إن ترك ذكر القطن والكتان إنما كان إعراضا عن الترف ; إذ ملبس عباد الله الصالحين إنما هو الصوف . وهذا فيه نظر ; فإنه سبحانه يقول : يابني آدم قد أنزلنا عليكم لباسا يواري سوآتكم حسبما تقدم بيانه في \" الأعراف وقال هنا : وجعل لكم سرابيل فأشار إلى القطن والكتان في لفظة سرابيل والله أعلم . و أثاثا قال الخليل : متاعا منضما بعضه إلى بعض ; من أث إذا كثر . قال :\nوفرع يزين المتن أسود فاحم أثيث كقنو النخلة المتعثكل\nابن عباس : أثاثا ثيابا . وقد تقدم\nوتضمنت هذه الآية جواز الانتفاع بالأصواف والأوبار والأشعار على كل حال ، ولذلك قال أصحابنا : صوف الميتة وشعرها طاهر يجوز الانتفاع به على كل حال ، ويغسل مخافة أن يكون علق به وسخ ; وكذلك روت أم سلمة عن النبي - صلى الله عليه وسلم - أنه قال : لا بأس بجلد الميتة إذا دبغ وصوفها وشعرها إذا غسل لأنه مما لا يحله الموت ، سواء كان شعر ما يؤكل لحمه أو لا ، كشعر ابن آدم والخنزير ، فإنه طاهر كله ; وبه قال أبو حنيفة ، ولكنه زاد علينا فقال : القرن والسن والعظم مثل الشعر ; قال : لأن هذه الأشياء كلها لا روح فيها لا تنجس بموت الحيوان . وقال الحسن البصري والليث بن سعد والأوزاعي : إن الشعور كلها نجسة ولكنها تطهر بالغسل . وعن الشافعي ثلاث روايات : الأولى : طاهرة لا تنجس بالموت . الثانية : تنجس . الثالثة : الفرق بين شعر ابن آدم وغيره ، فشعر ابن آدم طاهر وما عداه نجس . ودليلنا عموم قوله - تعالى - : ومن أصوافها الآية . فمن علينا بأن جعل لنا الانتفاع بها ، ولم يخص شعر الميتة من المذكاة ، فهو عموم إلا أن يمنع منه دليل . وأيضا فإن الأصل كونها طاهرة قبل الموت بإجماع ، فمن زعم أنه انتقل إلى نجاسة فعليه الدليل . فإن قيل قوله : حرمت عليكم الميتة وذلك عبارة عن الجملة . قلنا : نخصه بما ذكرنا ; فإنه منصوص عليه في ذكر الصوف ، وليس في آيتكم ذكره صريحا ، فكان دليلنا أولى . والله أعلم . وقد عول الشيخ الإمام أبو إسحاق إمام الشافعية ببغداد على أن الشعر جزء متصل بالحيوان خلقة ، فهو ينمي بنمائه ويتنجس بموته كسائر الأجزاء . وأجيب بأن النماء ليس بدليل على الحياة ; لأن النبات ينمي وليس بحي . وإذا عولوا على النماء المتصل لما على الحيوان عولنا نحن على الإبانة التي تدل على عدم الإحساس الذي يدل على عدم الحياة . وأما ما ذكره الحنفيون في العظم والسن والقرن أنه مثل الشعر ، فالمشهور عندنا أن ذلك نجس كاللحم . وقال ابن وهب مثل قول أبي حنيفة . ولنا قول ثالث : هل تلحق أطراف القرون والأظلاف بأصولها أو بالشعر ، قولان . وكذلك الشعري من الريش حكمه حكم الشعر ، والعظمي منه حكمه حكمه . ودليلنا قوله - صلى الله عليه وسلم - : لا تنتفعوا من الميتة بشيء وهذا عام فيها وفي كل جزء منها ، إلا ما قام دليله ; ومن الدليل القاطع على ذلك قوله - تعالى - : قال من يحيي العظام وهي رميم ، وقال - تعالى - : وانظر إلى العظام كيف ننشزها ، وقال : فكسونا العظام لحما ، وقال : أئذا كنا عظاما نخرة فالأصل هي العظام ، والروح والحياة فيها كما في اللحم والجلد . وفي حديث عبد الله بن عكيم : ( لا تنتفعوا من الميتة بإهاب ولا عصب ) . فإن قيل : قد ثبت في الصحيح أن النبي - صلى الله عليه وسلم - قال في شاة ميمونة : ( ألا انتفعتم بجلدها ) ؟ فقالوا : يا رسول الله ، إنها ميتة . فقال : ( إنما حرم أكلها ) والعظم لا يؤكل . قلنا : العظم يؤكل ، وخاصة عظم الجمل الرضيع والجدي والطير ، وعظم الكبير يشوى ويؤكل . وما ذكرناه قبل يدل على وجود الحياة فيه ، وما كان طاهرا بالحياة ويستباح بالذكاة ينجس بالموت . والله أعلم .\nالرابعة : قوله تعالى : من جلود الأنعام عام في جلد الحي والميت ، فيجوز الانتفاع بجلود الميتة وإن لم تدبغ ; وبه قال ابن شهاب الزهري والليث بن سعد . قال الطحاوي : لم نجد عن أحد من الفقهاء جواز بيع جلد الميتة قبل الدباغ إلا عن الليث . قال أبو عمر : يعني من الفقهاء أئمة الفتوى بالأمصار بعد التابعين ، وأما ابن شهاب فذلك عنه صحيح ، وهو قول أباه جمهور أهل العلم . وقد روي عنهما خلاف هذا القول ، والأول أشهر .\nقلت : قد ذكر الدارقطني في سننه حديث يحيى بن أيوب عن يونس وعقيل عن الزهري ، وحديث بقية عن الزبيدي ، وحديث محمد بن كثير العبدي وأبي سلمة المنقري عن سليمان بن كثير عن الزهري ، وقال في آخرها : هذه أسانيد صحاح .\nالسادسة : اختلف العلماء في جلد الميتة إذا دبغ هل يطهر أم لا ; فذكر ابن عبد الحكم عن مالك ما يشبه مذهب ابن شهاب في ذلك . وذكره ابن خويز منداد في كتابه عن ابن عبد الحكم أيضا . قال ابن خويز منداد : وهو قول الزهري والليث . قال : والظاهر من مذهب مالك ما ذكره ابن عبد الحكم ، وهو أن الدباغ لا يطهر جلد الميتة ، ولكن يبيح الانتفاع به في الأشياء اليابسة ، ولا يصلى عليه ولا يؤكل فيه . وفي المدونة لابن القاسم : من اغتصب جلد ميتة غير مدبوغ فأتلفه كان عليه قيمته . وحكي أن ذلك قول مالك . وذكر أبو الفرج أن مالكا قال : من اغتصب لرجل جلد ميتة غير مدبوغ فلا شيء عليه . قال إسماعيل : إلا أن يكون لمجوسي . وروى ابن وهب ، وابن عبد الحكم عن مالك جواز بيعه ، وهذا في جلد كل ميتة إلا الخنزير وحده ; لأن الزكاة لا تعمل فيه ، فالدباغ أولى . قال أبو عمر : وكل جلد ذكي فجائز استعماله للوضوء وغيره . وكان مالك يكره الوضوء في إناء جلد الميتة بعد الدباغ على اختلاف من قوله ، ومرة قال : إنه لم يكرهه إلا في خاصة نفسه ، وتكره الصلاة عليه وبيعه ، وتابعه على ذلك جماعة من أصحابه . وأما أكثر المدنيين فعلى إباحة ذلك وإجازته ; لقول رسول الله - صلى الله عليه وسلم - : أيما إهاب دبغ فقد طهر . وعلى هذا أكثر أهل الحجاز والعراق من أهل الفقه والحديث ، . وهو اختيار ابن وهب .\nالسابعة : ذهب الإمام أحمد بن حنبل - رضي الله عنه - إلى أنه لا يجوز الانتفاع بجلود الميتة في شيء وإن دبغت ; لأنها كلحم الميتة . والأخبار بالانتفاع بعد الدباغ ترد قوله . واحتج بحديث عبد الله بن عكيم - رواه أبو داود - قال : قرئ علينا كتاب رسول الله - صلى الله عليه وسلم - بأرض جهينة وأنا غلام شاب : ألا تستمتعوا من الميتة بإهاب ولا عصب . وفي رواية : قبل موته بشهر . رواه القاسم بن مخيمرة عن عبد الله بن عكيم ، قال : حدثنا مشيخة لنا أن النبي - صلى الله عليه وسلم - كتب إليهم . . قال داود بن علي : سألت يحيى بن معين عن هذا الحديث ، فضعفه وقال : ليس بشيء ، إنما يقول حدثني الأشياخ ، قال أبو عمر : ولو كان ثابتا لاحتمل أن يكون مخالفا للأحاديث المروية عن ابن عباس وعائشة وسلمة بن المحبق وغيرهم ، لأنه جائز أن يكون معنى حديث ابن عكيم ( ألا تنتفعوا من الميتة بإهاب ) قبل الدباغ ; وإذا احتمل ألا يكون مخالفا فليس لنا أن نجعله مخالفا ، وعلينا أن نستعمل الخبرين ما أمكن ، وحديث عبد الله بن عكيم وإن كان قبل موت النبي - صلى الله عليه وسلم - بشهر كما جاء في الخبر فيمكن أن تكون قصة ميمونة وسماع ابن عباس منه أيما إهاب دبغ فقد طهر قبل موته بجمعة أو دون جمعة ، والله أعلم .\nالثامنة : المشهور عندنا أن جلد الخنزير لا يدخل في الحديث ولا يتناوله العموم ، وكذلك الكلب عند الشافعي . وعند الأوزاعي وأبي ثور : لا يطهر بالدباغ إلا جلد ما يؤكل لحمه . وروى معن بن عيسى عن مالك أنه سئل عن جلد الخنزير إذا دبغ فكرهه . قال ابن وضاح : وسمعت سحنونا يقول لا بأس به ; وكذلك قال محمد بن عبد الحكم وداود بن علي وأصحابه ; لقوله - عليه السلام - : أيما مسك دبغ فقد طهر . قال أبو عمر : يحتمل أن يكون أراد بهذا القول عموم الجلود المعهود الانتفاع بها ، فأما الخنزير فلم يدخل في المعنى لأنه غير معهود الانتفاع بجلده ، إذ لا تعمل فيه الذكاة . ودليل آخر وهو ما قاله النضر بن شميل : إن الإهاب جلد البقر والغنم والإبل ، وما عداه فإنما يقال له : جلد لا إهاب .\nقلت : وجلد الكلب وما لا يؤكل لحمه أيضا غير معهود الانتفاع به فلا يطهر ; وقد قال - صلى الله عليه وسلم - : أكل كل ذي ناب من السباع حرام فليست الذكاة فيها ذكاة ، كما أنها ليست في الخنزير ذكاة . وروى النسائي عن المقدام بن معديكرب قال : نهى رسول الله - صلى الله عليه وسلم - عن الحرير والذهب ومياثر النمور\nالتاسعة : اختلف الفقهاء في الدباغ التي تطهر به جلود الميتة ما هو ؟ فقال أصحاب مالك وهو المشهور من مذهبه : كل شيء دبغ الجلد من ملح أو قرظ أو شب أو غير ذلك فقد جاز الانتفاع به . وكذلك قال أبو حنيفة وأصحابه ، وهو قول داود . وللشافعي في هذه المسألة قولان : أحدهما : هذا ، والآخر أنه لا يطهر إلا الشب والقرظ ; لأنه الدباغ المعهود على عهد النبي - صلى الله عليه وسلم - ، وعليه خرج الخطابي - والله أعلم - ما رواه النسائي عن ميمونة زوج النبي - صلى الله عليه وسلم - أنه مر برسول الله - صلى الله عليه وسلم - رجال من قريش يجرون شاة لهم مثل الحصان ; فقال لهم رسول الله - صلى الله عليه وسلم - : لو أخذتم إهابها قالوا . إنها ميتة ، فقال رسول الله - صلى الله عليه وسلم - : يطهرها الماء والقرظ .\nالعاشرة : قوله تعالى : أثاثا الأثاث متاع البيت ، واحدها أثاثة ; هذا قول أبي زيد الأنصاري . وقال الأموي : الأثاث متاع البيت ، وجمعه آثة وأثث . وقال غيرهما : الأثاث جميع أنواع المال ولا واحد له من لفظه . وقالالخليل : أصله من الكثرة واجتماع بعض المتاع إلى بعض حتى يكثر ; ومنه شعر أثيث أي كثير . وأث شعر فلان يأث أثا إذا كثر والتف ; قال امرؤ القيس :\nوفرع يزين المتن أسود فاحم أثيث كقنو النخلة المتعثكل\nوقيل : الأثاث ما يلبس ويفترش . وقد تأثثت إذا اتخذت أثاثا . وعن ابن عباس - رضي الله عنه - أثاثا مالا . وقد تقدم القول في الحين ; وهو هنا وقت غير معين بحسب كل إنسان ، إما بموته وإما بفقد تلك الأشياء التي هي أثاث . ومن هذه اللفظة قول الشاعر :\nأهاجتك الظعائن يوم بانوا بذي الزي الجميل من الأثاث\n                                    ",
        "saadi": "وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ ٠٨\n                                        \n                                        \n                                        \n                                        يذكر تعالى عباده نعمه، ويستدعي منهم شكرها والاعتراف بها فقال: { وَاللَّهُ جَعَلَ لَكُمْ مِنْ بُيُوتِكُمْ سَكَنًا } في الدور والقصور ونحوها تكنُّكم من الحر والبرد وتستركم أنتم وأولادكم وأمتعتكم، وتتخذون فيها الغرف والبيوت التي هي لأنواع منافعكم ومصالحكم وفيها حفظ لأموالكم وحرمكم وغير ذلك من الفوائد المشاهدة، { وَجَعَلَ لَكُمْ مِنْ جُلُودِ الْأَنْعَامِ } إما من الجلد نفسه أو مما نبت عليه، من صوف وشعر ووبر.\n{ بُيُوتًا تَسْتَخِفُّونَهَا } أي: خفيفة الحمل تكون لكم في السفر والمنازل التي لا قصد لكم في استيطانها، فتقيكم من الحر والبرد والمطر، وتقي متاعكم من المطر، { و } جعل لكم { وَمِنْ أَصْوَافِهَا } أي: الأنعام { وَأَوْبَارِهَا وَأَشْعَارِهَا أَثَاثًا } وهذا شامل لكل ما يتخذ منها من الآنية والأوعية والفرش والألبسة والأجلة، وغير ذلك.\n{ وَمَتَاعًا إِلَى حِينٍ } أي: تتمتعون بذلك في هذه الدنيا وتنتفعون بها، فهذا مما سخر الله العباد لصنعته وعمله.\n                                    "
      },
      "originalText": "وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ ٠٨"
    },
    {
      "number": 1982,
      "text": "وَاللَّهُ جَعَلَ لَكُمْ مِمَّا خَلَقَ ظِلَالًا وَجَعَلَ لَكُمْ مِنَ الْجِبَالِ أَكْنَانًا وَجَعَلَ لَكُمْ سَرَابِيلَ تَقِيكُمُ الْحَرَّ وَسَرَابِيلَ تَقِيكُمْ بَأْسَكُمْ ۚ كَذَٰلِكَ يُتِمُّ نِعْمَتَهُ عَلَيْكُمْ لَعَلَّكُمْ تُسْلِمُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 81,
      "juz": 14,
      "manzil": 3,
      "page": 276,
      "ruku": 234,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا وَجَعَلَ لَكُمۡ سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ وَسَرَٰبِيلَ تَقِيكُم بَأۡسَكُمۡۚ كَذَٰلِكَ يُتِمُّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ ١٨\n                                    \n                                    \n                                    وقوله : ( والله جعل لكم مما خلق ظلالا ) قال قتادة : يعني : الشجر .\n( وجعل لكم من الجبال أكنانا ) أي : حصونا ومعاقل ، كما ( جعل لكم سرابيل تقيكم الحر ) وهي الثياب من القطن والكتان والصوف ، ( وسرابيل تقيكم بأسكم ) كالدروع من الحديد المصفح والزرد وغير ذلك ، ( كذلك يتم نعمته عليكم ) أي : هكذا يجعل لكم ما تستعينون به على أمركم ، وما تحتاجون إليه ؛ ليكون عونا لكم على طاعته وعبادته ، (لعلكم تسلمون )\nهكذا فسره الجمهور ، وقرءوه بكسر اللام من \" تسلمون \" أي : من الإسلام .\nوقال قتادة في قوله : ( كذلك يتم نعمته عليكم [ لعلكم تسلمون ] ) هذه السورة تسمى : سورة النعم .\nوقال عبد الله بن المبارك وعباد بن العوام ، عن حنظلة السدوسي ، عن شهر بن حوشب ، عن ابن عباس أنه كان يقرؤها \" تسلمون \" بفتح اللام ، يعني من الجراح . رواه أبو عبيد القاسم بن سلام ، عن عباد ، وأخرجه ابن جرير من الوجهين ، ورد هذه القراءة .\nوقال عطاء الخراساني : إنما نزل القرآن على قدر معرفة العرب ، ألا ترى إلى قوله تعالى : ( والله جعل لكم مما خلق ظلالا وجعل لكم من الجبال أكنانا ) وما جعل [ لكم ] من السهل أعظم وأكثر ، ولكنهم كانوا أصحاب جبال ؟ ألا ترى إلى قوله : ( ومن أصوافها وأوبارها وأشعارها أثاثا ومتاعا إلى حين ) وما جعل لكم من غير ذلك أعظم منه وأكثر ولكنهم كانوا أصحاب وبر وشعر ، ألا ترى إلى قوله : ( وينزل من السماء من جبال فيها من برد ) [ النور : 43 ] لعجبهم من ذلك ، وما أنزل من الثلج أعظم وأكثر ، ولكنهم كانوا لا يعرفونه ؟ ألا ترى إلى قوله تعالى : ( سرابيل تقيكم الحر ) وما بقي من البرد أعظم وأكثر ولكنهم كانوا أصحاب حر .\n                                    ",
        "qortoby": "وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا وَجَعَلَ لَكُمۡ سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ وَسَرَٰبِيلَ تَقِيكُم بَأۡسَكُمۡۚ كَذَٰلِكَ يُتِمُّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ ١٨\n                                    \n                                    \n                                    قوله : والله جعل لكم مما خلق ظلالا وجعل لكم من الجبال أكنانا وجعل لكم سرابيل تقيكم الحر وسرابيل تقيكم بأسكم كذلك يتم نعمته عليكم لعلكم تسلمون\nفيه ست مسائل :\nالأولى : قوله تعالى : ظلالا الظلال : كل ما يستظل به من البيوت والشجر . وقوله مما خلق يعم جميع الأشخاص المظلة .\nالثانية : قوله تعالى : أكنانا الأكنان : جمع كن ، وهو الحافظ من المطر والريح وغير ذلك ; وهي هنا الغيران في الجبال ، جعلها الله عدة للخلق يأوون إليها ويتحصنون به أو يعتزلون عن الخلق فيها . وفي الصحيح أنه - عليه السلام - كان في أول أمره يتعبد بغار حراء ويمكث فيه الليالي . . الحديث ، وفي صحيح البخاري قال : خرج رسول الله - صلى الله عليه وسلم - من مكة مهاجرا هاربا من قومه فارا بدينه مع صاحبه أبي بكر حتى لحقا بغار في جبل ثور ، فكمنا فيه ثلاث ليال يبيت عندهما فيه عبد الله بن أبي بكر وهو غلام شاب ثقف لقن فيدلج من عندهما بسحر فيصبح مع قريش بمكة كبائت فلا يسمع أمرا يكادان به إلا وعاه حتى يأتيهما بخبر ذلك حين يختلط الظلام ، ويرعى عليهما عامر بن فهيرة مولى أبي بكر منحة من غنم فيريحها عليهما حتى تذهب ساعة من العشاء فيبيتان في رسل ، وهو لبن منحتهما ورضيفهما حتى ينعق بهما عامر بن فهيرة بغلس ، يفعل ذلك في كل ليلة من تلك الليالي الثلاث . . . وذكر الحديث . انفرد بإخراجه البخاري .\nالثالثة : قوله تعالى : وجعل لكم سرابيل تقيكم الحر يعني القمص ، واحدها سربال .\nوسرابيل تقيكم بأسكم يعني الدروع التي تقي الناس في الحرب ; ومنه قول كعب بن زهير :\nشم العرانين أبطال لبوسهم من نسج داود في الهيجا سرابيل\nالرابعة : إن قال قائل : كيف قال وجعل لكم من الجبال أكنانا ولم يذكر السهل ، قال تقيكم الحر ولم يذكر البرد ؟ فالجواب أن القوم كانوا أصحاب جبال ولم يكونوا أصحاب سهل ، وكانوا أهل حر ولم يكونوا أهل برد ، فذكر لهم نعمه التي تختص بهم كما خصهم بذكر الصوف وغيره ، ولم يذكر القطن والكتان ولا الثلج - كما تقدم - فإنه لم يكن ببلادهم ; قال معناه عطاء الخراساني وغيره . وأيضا : وأيضا : فذكر أحدهما يدل على الآخر ; ومنه قول الشاعر :\nوما أدري إذا يممت أرضا أريد الخير أيهما يليني\nأألخير الذي أنا أبتغيه أم الشر الذي هو يبتغيني\nالخامسة : قال العلماء : في قوله - تعالى - : وسرابيل تقيكم بأسكم دليل على اتخاذ العباد عدة الجهاد ليستعينوا بها على قتال الأعداء ، وقد لبسها النبي - صلى الله عليه وسلم - تقاة الجراحة وإن كان يطلب الشهادة ، وليس للعبد أن يطلبها بأن يستسلم للحتوف وللطعن بالسنان وللضرب بالسيوف ، ولكنه يلبس لأمة حرب لتكون له قوة على قتال عدوه ، ويقاتل لتكون كلمة الله هي العليا ، ويفعل الله بعد ما يشاء .\nالسادسة : قوله تعالى : كذلك يتم نعمته عليكم لعلكم تسلمون قرأ ابن محيصن وحميد \" تتم \" بتاءين ، \" نعمته \" رفعا على أنها الفاعل . الباقون يتم بضم الياء على أن الله هو يتمها . وتسلمون قراءة ابن عباس وعكرمة \" تسلمون \" بفتح التاء واللام ، أي تسلمون من الجراح ، وإسناده ضعيف ; رواه عباد بن العوام عن حنظلة عن شهر عن ابن عباس . الباقون بضم التاء ، ومعناه تستسلمون وتنقادون إلى معرفة الله وطاعته شكرا على نعمه . قال أبو عبيد : والاختيار قراءة العامة ; لأن ما أنعم الله به علينا من الإسلام أفضل مما أنعم به من السلامة من الجراح .\n                                    ",
        "saadi": "وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا وَجَعَلَ لَكُمۡ سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ وَسَرَٰبِيلَ تَقِيكُم بَأۡسَكُمۡۚ كَذَٰلِكَ يُتِمُّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ ١٨\n                                        \n                                        \n                                        \n                                        { وَاللَّهُ جَعَلَ لَكُمْ مِمَّا خَلَقَ } أي: من مخلوقاته التي لا صنعة لكم فيها، { ظِلَالًا } وذلك كأظلة الأشجار والجبال والآكام ونحوها، { وَجَعَلَ لَكُمْ مِنَ الْجِبَالِ أَكْنَانًا } أي: مغارات تكنكم من الحر والبرد والأمطار والأعداء.\n{ وَجَعَلَ لَكُمْ سَرَابِيلَ } أي: ألبسة وثيابا { تَقِيكُمُ الْحَرَّ } ولم يذكر الله البرد لأنه قد تقدم أن هذه السورة أولها في أصول النعم وآخرها في مكملاتها ومتمماتها، ووقاية البرد من أصول النعم فإنه من الضرورة، وقد ذكره في أولها في قوله { لَكُمْ فِيهَا دِفْءٌ وَمَنَافِعُ }\n{ وَسَرَابِيلَ تَقِيكُمْ بَأْسَكُمْ } أي: وثيابا تقيكم وقت البأس والحرب من السلاح، وذلك كالدروع والزرد ونحوها، كذلك يتم نعمته عليكم حيث أسبغ عليكم من نعمه ما لا يدخل تحت الحصر { لَعَلَّكُمْ } إذا ذكرتم نعمة الله ورأيتموها غامرة لكم من كل وجه { تُسْلِمُونَ } لعظمته وتنقادون لأمره، وتصرفونها في طاعة موليها ومسديها، فكثرة النعم من الأسباب الجالبة من العباد مزيد الشكر ، والثناء بها على الله تعالى، ولكن أبى الظالمون إلا تمردا وعنادا.\n                                    "
      },
      "originalText": "وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَٰلٗا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَٰنٗا وَجَعَلَ لَكُمۡ سَرَٰبِيلَ تَقِيكُمُ ٱلۡحَرَّ وَسَرَٰبِيلَ تَقِيكُم بَأۡسَكُمۡۚ كَذَٰلِكَ يُتِمُّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ ١٨"
    },
    {
      "number": 1983,
      "text": "فَإِنْ تَوَلَّوْا فَإِنَّمَا عَلَيْكَ الْبَلَاغُ الْمُبِينُ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 82,
      "juz": 14,
      "manzil": 3,
      "page": 276,
      "ruku": 234,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ ٱلۡمُبِينُ ٢٨\n                                    \n                                    \n                                    وقوله \"فإن تولوا\" أي بعد هذا البيان وهذا الامتنان فلا عليك منهم \"فإنما عليك البلاغ المبين\" وقد أديته إليهم.\n                                    ",
        "qortoby": "فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ ٱلۡمُبِينُ ٢٨\n                                    \n                                    \n                                    قوله تعالى : فإن تولوا فإنما عليك البلاغ المبين قوله تعالى : فإن تولوا أي أعرضوا عن النظر والاستدلال والإيمان .\nفإنما عليك البلاغ المبين أي ليس عليك إلا التبليغ ، وأما الهداية فإلينا .\n                                    ",
        "saadi": "فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ ٱلۡمُبِينُ ٢٨\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 82 و83 :ـ\n{ فَإِنْ تَوَلَّوْا } عن الله وعن طاعته بعد ما ذُكِّروا بنعمه وآياته، { فَإِنَّمَا عَلَيْكَ الْبَلَاغُ الْمُبِينُ } أي: ليس عليك من هدايتهم وتوفيقهم شيء بل أنت مطالب بالوعظ والتذكير والإنذار والتحذير، فإذا أديت ما عليك، فحسابهم على الله فإنهم يرون الإحسان، ويعرفون نعمة الله، ولكنهم ينكرونها ويجحدونها، { وَأَكْثَرُهُمُ الْكَافِرُونَ } لا خير فيهم، وما ينفعهم توالي الآيات، لفساد مشاعرهم وسوء قصودهم وسيرون جزاء الله لكل جبار عنيد كفور للنعم متمرد على الله وعلى رسله.\n                                    "
      },
      "originalText": "فَإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُ ٱلۡمُبِينُ ٢٨"
    },
    {
      "number": 1984,
      "text": "يَعْرِفُونَ نِعْمَتَ اللَّهِ ثُمَّ يُنْكِرُونَهَا وَأَكْثَرُهُمُ الْكَافِرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 83,
      "juz": 14,
      "manzil": 3,
      "page": 276,
      "ruku": 234,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَٰفِرُونَ ٣٨\n                                    \n                                    \n                                    ( يعرفون نعمة الله ثم ينكرونها ) أي : يعرفون أن الله تعالى هو المسدي إليهم ذلك ، وهو المتفضل به عليهم ، ومع هذا ينكرون ذلك ، ويعبدون معه غيره ، ويسندون النصر والرزق إلى غيره ، ( وأكثرهم الكافرون ) - كما قال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا صفوان ، حدثنا الوليد حدثنا عبد الرحمن بن يزيد بن جابر ، عن مجاهد أن أعرابيا أتى رسول الله - صلى الله عليه وسلم - فسأله ، فقرأ عليه رسول الله - صلى الله عليه وسلم - : ( والله جعل لكم من بيوتكم سكنا ) قال الأعرابي : نعم . قال : ( وجعل لكم من جلود الأنعام بيوتا تستخفونها يوم ظعنكم ويوم إقامتكم ) قال الأعرابي : نعم . ثم قرأ عليه كل ذلك يقول الأعرابي : نعم ، حتى بلغ : ( كذلك يتم نعمته عليكم لعلكم تسلمون ) فولى الأعرابي ، فأنزل الله : ( يعرفون نعمة الله ثم ينكرونها وأكثرهم الكافرون ) .\n                                    ",
        "qortoby": "يَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَٰفِرُونَ ٣٨\n                                    \n                                    \n                                    قوله تعالى : يعرفون نعمة الله ثم ينكرونها وأكثرهم الكافرون قوله تعالى : يعرفون نعمة الله ثم ينكرونها قال السدي : يعني محمدا - صلى الله عليه وسلم - ، أي يعرفون نبوته ثم ينكرونها ويكذبونه . وقال مجاهد : يريد ما عدد الله عليهم في هذه السورة من النعم ; أي يعرفون أنها من عند الله وينكرونها بقولهم إنهم ورثوا ذلك عن آبائهم . وبمثله قال قتادة . وقال عون بن عبد الله : هو قول الرجل لولا فلان لكان كذا ، ولولا فلان ما أصبت كذا ، وهم يعرفون النفع والضر من عند الله . وقالالكلبي : هو أن رسول الله - صلى الله عليه وسلم - لما عرفهم بهذه النعم كلها عرفوها وقالوا : نعم ، هي كلها نعم من الله ، ولكنها بشفاعة آلهتنا . وقيل : يعرفون نعمة الله بتقلبهم فيها ، وينكرونها بترك الشكر عليها . ويحتمل سادسا : يعرفونها في الشدة وينكرونها في الرخاء . ويحتمل سابعا : يعرفونها بأقوالهم وينكرونها بأفعالهم . ويحتمل ثامنا : يعرفونها بقلوبهم ويجحدونها بألسنتهم ; نظيرها وجحدوا بها واستيقنتها أنفسهم\nوأكثرهم الكافرون يعني جميعهم ; حسبما تقدم .\n                                    ",
        "saadi": "يَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَٰفِرُونَ ٣٨\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 82 و83 :ـ\n{ فَإِنْ تَوَلَّوْا } عن الله وعن طاعته بعد ما ذُكِّروا بنعمه وآياته، { فَإِنَّمَا عَلَيْكَ الْبَلَاغُ الْمُبِينُ } أي: ليس عليك من هدايتهم وتوفيقهم شيء بل أنت مطالب بالوعظ والتذكير والإنذار والتحذير، فإذا أديت ما عليك، فحسابهم على الله فإنهم يرون الإحسان، ويعرفون نعمة الله، ولكنهم ينكرونها ويجحدونها، { وَأَكْثَرُهُمُ الْكَافِرُونَ } لا خير فيهم، وما ينفعهم توالي الآيات، لفساد مشاعرهم وسوء قصودهم وسيرون جزاء الله لكل جبار عنيد كفور للنعم متمرد على الله وعلى رسله.\n                                    "
      },
      "originalText": "يَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ يُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَٰفِرُونَ ٣٨"
    },
    {
      "number": 1985,
      "text": "وَيَوْمَ نَبْعَثُ مِنْ كُلِّ أُمَّةٍ شَهِيدًا ثُمَّ لَا يُؤْذَنُ لِلَّذِينَ كَفَرُوا وَلَا هُمْ يُسْتَعْتَبُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 84,
      "juz": 14,
      "manzil": 3,
      "page": 276,
      "ruku": 235,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةٖ شَهِيدٗا ثُمَّ لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ وَلَا هُمۡ يُسۡتَعۡتَبُونَ ٤٨\n                                    \n                                    \n                                    يخبر تعالى عن شأن المشركين يوم معادهم في الدار الآخرة وأنه يبعث من كل أمة شهيدا وهو نبيها يشهد عليها بما أجابته فيما بلغها عن الله تعالى \"ثم لا يؤذن للذين كفروا\" أي في الاعتذار لأنهم يعلمون بطلانه وكذبه كقوله \" هذا يوم لا ينطقون ولا يؤذن لهم فيعتذرون\" فلهذا قال \"ولا هم يستعتبون.\n                                    ",
        "qortoby": "وَيَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةٖ شَهِيدٗا ثُمَّ لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ وَلَا هُمۡ يُسۡتَعۡتَبُونَ ٤٨\n                                    \n                                    \n                                    قوله تعالى : ويوم نبعث من كل أمة شهيدا ثم لا يؤذن للذين كفروا ولا هم يستعتبون ويوم نبعث من كل أمة شهيدا نظيره : فكيف إذا جئنا من كل أمة بشهيد وقد تقدم . ثم لا يؤذن للذين كفروا أي في الاعتذار والكلام ; كقوله : ولا يؤذن لهم فيعتذرون . وذلك حين تطبق عليهم جهنم ، كما تقدم في أول [ الحجر ] ويأتي .\nولا هم يستعتبون يعني يسترضون ، أي لا يكلفون أن يرضوا ربهم ; لأن الآخرة ليست بدار تكليف ، ولا يتركون إلى رجوع الدنيا فيتوبون . وأصل الكلمة من العتب وهي الموجدة ; يقال : عتب عليه يعتب إذا وجد عليه ، فإذا فاوضه ما عتب عليه فيه قيل عاتبه ، فإذا رجع إلى مسرتك فقد أعتب ، والاسم العتبى وهو رجوع المعتوب عليه إلى ما يرضي العاتب ; قاله الهروي . وقال النابغة :\nفإن كنت مظلوما فعبدا ظلمته وإن كنت ذا عتبى فمثلك يعتب\n                                    ",
        "saadi": "وَيَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةٖ شَهِيدٗا ثُمَّ لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ وَلَا هُمۡ يُسۡتَعۡتَبُونَ ٤٨\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 84 و85 :ـ\nيخبر تعالى عن حال الذين كفروا في يوم القيامة وأنه لا يقبل لهم عذر ولا يرفع عنهم العقاب وأن شركاءهم تتبرأ منهم ويقرون على أنفسهم بالكفر والافتراء على الله فقال: { وَيَوْمَ نَبْعَثُ مِنْ كُلِّ أُمَّةٍ شَهِيدًا } يشهد عليهم بأعمالهم وماذا أجابوا به الداعي إلى الهدى وذلك الشهيد الذي يبعثه الله أزكى الشهداء وأعدلهم وهم الرسل الذين إذا شهدوا تم عليهم الحكم.\nفـ { لَا يُؤْذَنُ لِلَّذِينَ كَفَرُوا } في الاعتذار لأن اعتذارهم بعد ما علم يقينا بطلان ما هم عليه، اعتذار كاذب لا يفيدهم شيئا، وإن طلبوا أيضا الرجوع إلى الدنيا ليستدركوا لم يجابوا ولم يعتبوا، بل يبادرهم العذاب الشديد الذي لا يخفف عنهم من غير إنظار ولا إمهال من حين يرونه لأنهم لا حساب عليهم لأنهم لا حسنات لهم وإنما تعد أعمالهم وتحصى ويوقفون عليها ويقرون بها ويفتضحون.\n                                    "
      },
      "originalText": "وَيَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةٖ شَهِيدٗا ثُمَّ لَا يُؤۡذَنُ لِلَّذِينَ كَفَرُواْ وَلَا هُمۡ يُسۡتَعۡتَبُونَ ٤٨"
    },
    {
      "number": 1986,
      "text": "وَإِذَا رَأَى الَّذِينَ ظَلَمُوا الْعَذَابَ فَلَا يُخَفَّفُ عَنْهُمْ وَلَا هُمْ يُنْظَرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 85,
      "juz": 14,
      "manzil": 3,
      "page": 276,
      "ruku": 235,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا رَءَا ٱلَّذِينَ ظَلَمُواْ ٱلۡعَذَابَ فَلَا يُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ يُنظَرُونَ ٥٨\n                                    \n                                    \n                                    ( وإذا رأى الذين ظلموا ) أي : أشركوا ( العذاب فلا يخفف عنهم ) أي : لا يفتر عنهم ساعة واحدة ، ( ولا هم ينظرون ) أي : [ و ] لا يؤخر عنهم ، بل يأخذهم سريعا من الموقف بلا حساب ، فإنه إذا جيء بجهنم تقاد بسبعين ألف زمام ، مع كل زمام سبعون ألف ملك ، فيشرف عنق منها على الخلائق ، وتزفر زفرة لا يبقى أحد إلا جثا لركبتيه ، فتقول : إني وكلت بكل جبار عنيد ، الذي جعل مع الله إلها آخر ، وبكذا وكذا وتذكر أصنافا من الناس ، كما جاء في الحديث . ثم تنطوي عليهم وتتلقطهم من الموقف كما يتلقط الطائر الحب قال الله تعالى : ( إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا وإذا ألقوا منها مكانا ضيقا مقرنين دعوا هنالك ثبورا لا تدعوا اليوم ثبورا واحدا وادعوا ثبورا كثيرا ) [ الفرقان : 12 - 14 ] وقال تعالى : ( ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا ) [ الكهف : 53 ] . وقال تعالى : ( لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون بل تأتيهم بغتة فتبهتهم فلا يستطيعون ردها ولا هم ينظرون ) [ الأنبياء : 39 ، 40 ] .\n                                    ",
        "qortoby": "وَإِذَا رَءَا ٱلَّذِينَ ظَلَمُواْ ٱلۡعَذَابَ فَلَا يُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ يُنظَرُونَ ٥٨\n                                    \n                                    \n                                    قوله تعالى : وإذا رأى الذين ظلموا العذاب فلا يخفف عنهم ولا هم ينظرون قوله تعالى : وإذا رأى الذين ظلموا أي أشركوا .\nالعذاب أي عذاب جهنم بالدخول فيها .\nفلا يخفف عنهم ولا هم ينظرون أي لا يمهلون ; إذ لا توبة لهم ثم .\n                                    ",
        "saadi": "وَإِذَا رَءَا ٱلَّذِينَ ظَلَمُواْ ٱلۡعَذَابَ فَلَا يُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ يُنظَرُونَ ٥٨\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 84 و85 :ـ\nيخبر تعالى عن حال الذين كفروا في يوم القيامة وأنه لا يقبل لهم عذر ولا يرفع عنهم العقاب وأن شركاءهم تتبرأ منهم ويقرون على أنفسهم بالكفر والافتراء على الله فقال: { وَيَوْمَ نَبْعَثُ مِنْ كُلِّ أُمَّةٍ شَهِيدًا } يشهد عليهم بأعمالهم وماذا أجابوا به الداعي إلى الهدى وذلك الشهيد الذي يبعثه الله أزكى الشهداء وأعدلهم وهم الرسل الذين إذا شهدوا تم عليهم الحكم.\nفـ { لَا يُؤْذَنُ لِلَّذِينَ كَفَرُوا } في الاعتذار لأن اعتذارهم بعد ما علم يقينا بطلان ما هم عليه، اعتذار كاذب لا يفيدهم شيئا، وإن طلبوا أيضا الرجوع إلى الدنيا ليستدركوا لم يجابوا ولم يعتبوا، بل يبادرهم العذاب الشديد الذي لا يخفف عنهم من غير إنظار ولا إمهال من حين يرونه لأنهم لا حساب عليهم لأنهم لا حسنات لهم وإنما تعد أعمالهم وتحصى ويوقفون عليها ويقرون بها ويفتضحون.\n                                    "
      },
      "originalText": "وَإِذَا رَءَا ٱلَّذِينَ ظَلَمُواْ ٱلۡعَذَابَ فَلَا يُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ يُنظَرُونَ ٥٨"
    },
    {
      "number": 1987,
      "text": "وَإِذَا رَأَى الَّذِينَ أَشْرَكُوا شُرَكَاءَهُمْ قَالُوا رَبَّنَا هَٰؤُلَاءِ شُرَكَاؤُنَا الَّذِينَ كُنَّا نَدْعُو مِنْ دُونِكَ ۖ فَأَلْقَوْا إِلَيْهِمُ الْقَوْلَ إِنَّكُمْ لَكَاذِبُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 86,
      "juz": 14,
      "manzil": 3,
      "page": 276,
      "ruku": 235,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ ٦٨\n                                    \n                                    \n                                    ثم أخبر تعالى عن تبرئ آلهتهم منهم أحوج ما يكونون إليها ، فقال : ( وإذا رأى الذين أشركوا شركاءهم ) أي : الذين كانوا يعبدونهم في الدنيا ، ( قالوا ربنا هؤلاء شركاؤنا الذين كنا ندعو من دونك فألقوا إليهم القول إنكم لكاذبون ) أي : قالت لهم الآلهة : كذبتم ، ما نحن أمرناكم بعبادتنا . كما قال تعالى : ( ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين ) [ الأحقاف : 5 ، 6 ] وقال تعالى : ( واتخذوا من دون الله آلهة ليكونوا لهم عزا كلا سيكفرون بعبادتهم ويكونون عليهم ضدا ) [ مريم : 81 ، 82 ] . وقال الخليل عليه الصلاة والسلام : ( ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين ) [ العنكبوت : 25 ] وقال تعالى : ( ويوم يقول نادوا شركائي الذين زعمتم فدعوهم فلم يستجيبوا لهم وجعلنا بينهم موبقا ) [ الكهف : 52 ] والآيات في هذا كثيرة .\n                                    ",
        "qortoby": "وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ ٦٨\n                                    \n                                    \n                                    قوله : وإذا رأى الذين أشركوا شركاءهم قالوا ربنا هؤلاء شركاؤنا الذين كنا ندعوا من دونك فألقوا إليهم القول إنكم لكاذبون\nقوله تعالى : وإذا رأى الذين أشركوا شركاءهم أي أصنامهم وأوثانهم التي عبدوها وذلك أن الله يبعث معبوديهم فيتبعونهم حتى يوردوهم النار . وفي صحيح مسلم : من كان يعبد شيئا فليتبعه فيتبع من كان يعبد الشمس الشمس ويتبع من كان يعبد القمر القمر ويتبع من كان يعبد الطواغيت الطواغيت . . . الحديث ، خرجه من حديث أنس ، والترمذي من حديث أبي هريرة ، وفيه : فيمثل لصاحب الصليب صليبه ولصاحب التصاوير تصاويره ولصاحب النار ناره فيتبعون ما كانوا يعبدون . . . وذكر الحديث .\nقالوا ربنا هؤلاء شركاؤنا الذين كنا ندعوا من دونك أي الذين جعلناهم لك شركاء .\nفألقوا إليهم القول إنكم لكاذبون أي ألقت إليهم الآلهة القول ، أي نطقت بتكذيب من عبدها بأنها لم تكن آلهة ، ولا أمرتهم بعبادتها ، فينطق الله الأصنام حتى تظهر عند ذلك فضيحة الكفار . وقيل : المراد بذلك الملائكة الذين عبدوهم .\n                                    ",
        "saadi": "وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ ٦٨\n                                        \n                                        \n                                        \n                                        { وَإِذَا رَأَى الَّذِينَ أَشْرَكُوا شُرَكَاءَهُمْ } يوم القيامة وعلموا بطلانها ولم يمكنهم الإنكار.\n{ قَالُوا رَبَّنَا هَؤُلَاءِ شُرَكَاؤُنَا الَّذِينَ كُنَّا نَدْعُوا مِنْ دُونِكَ } ليس عندها نفع ولا شفع، فنوَّهوا بأنفسهم ببطلانها، وكفروا بها، وبدت البغضاء والعداوة بينهم وبينها، { فَأَلْقَوْا إِلَيْهِمُ الْقَوْلَ } أي: ردت عليهم شركاؤهم قولهم، فقالت لهم: { إِنَّكُمْ لَكَاذِبُونَ } حيث جعلتمونا شركاء لله، وعبدتمونا معه فلم نأمركم بذلك، ولا زعمنا أن فينا استحقاقا للألوهية فاللوم عليكم.\n                                    "
      },
      "originalText": "وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ ٦٨"
    },
    {
      "number": 1988,
      "text": "وَأَلْقَوْا إِلَى اللَّهِ يَوْمَئِذٍ السَّلَمَ ۖ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 87,
      "juz": 14,
      "manzil": 3,
      "page": 276,
      "ruku": 235,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ ٧٨\n                                    \n                                    \n                                    وقوله : ( وألقوا إلى الله يومئذ السلم ) - قال قتادة ، وعكرمة : ذلوا واستسلموا يومئذ ، أي : استسلموا لله جميعهم ، فلا أحد إلا سامع مطيع ، كما قال : ( أسمع بهم وأبصر يوم يأتوننا ) [ مريم : 38 ] أي : ما أسمعهم وما أبصرهم يومئذ ! وقال تعالى : ( ولو ترى إذ المجرمون ناكسو رءوسهم عند ربهم ربنا أبصرنا وسمعنا فارجعنا نعمل صالحا إنا موقنون ) [ السجدة : 12 ] وقال : ( وعنت الوجوه للحي القيوم ) [ طه : 111 ] أي : خضعت وذلت واستكانت وأنابت واستسلمت .\n( وألقوا إلى الله يومئذ السلم وضل عنهم ما كانوا يفترون ) أي : ذهب واضمحل ما كانوا يعبدونه افتراء على الله فلا ناصر لهم ولا معين ولا مجيز .\n                                    ",
        "qortoby": "وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ ٧٨\n                                    \n                                    \n                                    وألقوا إلى الله يومئذ السلم يعني المشركين ، أي استسلموا لعذابه وخضعوا لعزه . وقيل : استسلم العابد والمعبود وانقادوا لحكمه فيهم .\nوضل عنهم ما كانوا يفترون أي زال عنهم ما زين لهم الشيطان وما كانوا يؤملون من شفاعة آلهتهم .\n                                    ",
        "saadi": "وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ ٧٨\n                                        \n                                        \n                                        \n                                        فحينئذ استسلموا لله، وخضعوا لحكمه وعلموا إنهم مستحقون للعذاب.{ وَضَلَّ عَنْهُمْ مَا كَانُوا يَفْتَرُونَ } فدخلوا النار وقد امتلأت قلوبهم من مقت أنفسهم ومن حمد ربهم وأنه لم يعاقبهم إلا بما كسبوا.\n                                    "
      },
      "originalText": "وَأَلۡقَوۡاْ إِلَى ٱللَّهِ يَوۡمَئِذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُواْ يَفۡتَرُونَ ٧٨"
    }
  ]
}