{
  "number": 277,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 1989,
      "text": "الَّذِينَ كَفَرُوا وَصَدُّوا عَنْ سَبِيلِ اللَّهِ زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ بِمَا كَانُوا يُفْسِدُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 88,
      "juz": 14,
      "manzil": 3,
      "page": 277,
      "ruku": 235,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ زِدۡنَٰهُمۡ عَذَابٗا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُواْ يُفۡسِدُونَ ٨٨\n                                    \n                                    \n                                    ثم قال تعالى : ( الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون ) أي : عذابا على كفرهم ، وعذابا على صدهم الناس عن اتباع الحق ، كما قال تعالى : ( وهم ينهون عنه وينأون عنه ) [ الأنعام : 26 ] أي : ينهون الناس ، عن اتباعه ، ويبتعدون هم منه أيضا ( وإن يهلكون إلا أنفسهم وما يشعرون ) [ الأنعام : 26 ]\nوهذا دليل على تفاوت الكفار في عذابهم ، كما يتفاوت المؤمنون في منازلهم في الجنة ودرجاتهم ، كما قال [ الله ] تعالى : ( قال لكل ضعف ولكن لا تعلمون ) [ الأعراف : 38 ] .\nوقد قال الحافظ أبو يعلى : حدثنا سريج بن يونس ، حدثنا أبو معاوية ، حدثنا الأعمش ، عن عبد الله بن مرة ، عن مسروق ، عن عبد الله في قول الله : ( زدناهم عذابا فوق العذاب ) قال : زيدوا عقارب أنيابها كالنخل الطوال .\nوحدثنا سريج بن يونس ، حدثنا إبراهيم بن سليمان ، حدثنا الأعمش ، عن الحسن ، عن ابن عباس أنه قال : ( زدناهم عذابا فوق العذاب ) قال : هي خمسة أنهار فوق العرش يعذبون ببعضها بالليل وببعضها بالنهار .\n                                    ",
        "qortoby": "ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ زِدۡنَٰهُمۡ عَذَابٗا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُواْ يُفۡسِدُونَ ٨٨\n                                    \n                                    \n                                    قوله تعالى : الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون قوله تعالى : الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب قال ابن مسعود : عقارب أنيابها كالنخل الطوال ، وحيات مثل أعناق الإبل ، وأفاعي كأنها البخاتي تضربهم ، فتلك الزيادة وقيل : المعنى يخرجون من النار إلى الزمهرير فيبادرون من شدة برده إلى النار . وقيل : المعنى زدنا القادة عذابا فوق السفلة ، فأحد العذابين على كفرهم والعذاب الآخر على صدهم .\nبما كانوا يفسدون في الدنيا من الكفر والمعصية .\n                                    ",
        "saadi": "ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ زِدۡنَٰهُمۡ عَذَابٗا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُواْ يُفۡسِدُونَ ٨٨\n                                        \n                                        \n                                        \n                                        حيث كفروا بأنفسهم، وكذبوا بآيات الله، وحاربوا رسله، وصدوا الناس عن سبيل الله، وصاروا دعاة إلى الضلال فاستحقوا مضاعفة العذاب، كما تضاعف جرمهم، وكما أفسدوا في أرض الله.\n                                    "
      },
      "originalText": "ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ زِدۡنَٰهُمۡ عَذَابٗا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُواْ يُفۡسِدُونَ ٨٨"
    },
    {
      "number": 1990,
      "text": "وَيَوْمَ نَبْعَثُ فِي كُلِّ أُمَّةٍ شَهِيدًا عَلَيْهِمْ مِنْ أَنْفُسِهِمْ ۖ وَجِئْنَا بِكَ شَهِيدًا عَلَىٰ هَٰؤُلَاءِ ۚ وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِكُلِّ شَيْءٍ وَهُدًى وَرَحْمَةً وَبُشْرَىٰ لِلْمُسْلِمِينَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 89,
      "juz": 14,
      "manzil": 3,
      "page": 277,
      "ruku": 235,
      "hizbQuarter": 110,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَوۡمَ نَبۡعَثُ فِي كُلِّ أُمَّةٖ شَهِيدًا عَلَيۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِيدًا عَلَىٰ هَٰٓؤُلَآءِۚ وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ ٩٨\n                                    \n                                    \n                                    يقول تعالى مخاطبا عبده ورسوله محمدا - صلى الله عليه وسلم - : ( ويوم نبعث في كل أمة شهيدا عليهم من أنفسهم وجئنا بك شهيدا على هؤلاء ) يعني أمته .\nأي : اذكر ذلك اليوم وهوله وما منحك الله فيه من الشرف العظيم والمقام الرفيع . وهذه الآية شبيهة بالآية التي انتهى إليها عبد الله بن مسعود حين قرأ على رسول الله - صلى الله عليه وسلم - صدر سورة \" النساء \" فلما وصل إلى قوله تعالى : ( فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا ) [ النساء : 41 ] . فقال له رسول الله - صلى الله عليه وسلم - : \" حسبك \" . قال ابن مسعود - رضي الله عنه - : فالتفت فإذا عيناه تذرفان .\nوقوله : ( ونزلنا عليك الكتاب تبيانا لكل شيء ) قال ابن مسعود : [ و ] قد بين لنا في هذا القرآن كل علم ، وكل شيء .\nوقال مجاهد : كل حلال وحرام .\nوقول ابن مسعود أعم وأشمل ; فإن القرآن اشتمل على كل علم نافع من خبر ما سبق ، وعلم ما سيأتي ، وحكم كل حلال وحرام ، وما الناس إليه محتاجون في أمر دنياهم ودينهم ، ومعاشهم ومعادهم .\n( وهدى ) أي : للقلوب ، ( ورحمة وبشرى للمسلمين )\nوقال الأوزاعي : ( ونزلنا عليك الكتاب تبيانا لكل شيء ) أي : بالسنة .\nووجه اقتران قوله : ( ونزلنا عليك الكتاب ) مع قوله : ( وجئنا بك شهيدا على هؤلاء ) أن المراد - والله أعلم - : إن الذي فرض عليك تبليغ الكتاب - الذي أنزله عليك - سائلك عن ذلك يوم القيامة ، ( فلنسألن الذين أرسل إليهم ولنسألن المرسلين ) [ الأعراف : 6 ] ( فوربك لنسألنهم أجمعين عما كانوا يعملون ) [ الحجر : 92 ، 93 ] ( يوم يجمع الله الرسل فيقول ماذا أجبتم قالوا لا علم لنا إنك أنت علام الغيوب ) [ المائدة : 109 ] وقال تعالى : ( إن الذي فرض عليك القرآن لرادك إلى معاد ) [ القصص : 85 ] أي : إن الذي أوجب عليك تبليغ القرآن لرادك إليه ، ومعيدك يوم القيامة ، وسائلك عن أداء ما فرض عليك . هذا أحد الأقوال ، وهو متجه حسن .\n                                    ",
        "qortoby": "وَيَوۡمَ نَبۡعَثُ فِي كُلِّ أُمَّةٖ شَهِيدًا عَلَيۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِيدًا عَلَىٰ هَٰٓؤُلَآءِۚ وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ ٩٨\n                                    \n                                    \n                                    قوله تعالى : ويوم نبعث في كل أمة شهيدا عليهم من أنفسهم وجئنا بك شهيدا على هؤلاء ونزلنا عليك الكتاب تبيانا لكل شيء وهدى ورحمة وبشرى للمسلمين\nقوله تعالى : ويوم نبعث في كل أمة شهيدا عليهم من أنفسهم وهم الأنبياء شهداء على أممهم يوم القيامة بأنهم قد بلغوا الرسالة ودعوهم إلى الإيمان ، في كل زمان شهيد وإن لم يكن نبيا ; وفيهم قولان : أحدهما : أنهم أئمة الهدى الذين هم خلفاء الأنبياء . الثاني : أنهم العلماء الذين حفظ الله بهم شرائع أنبيائه .\nقلت : فعلى هذا لم تكن فترة إلا وفيها من يوحد الله ; كقس بن ساعدة ، وزيد بن عمرو بن نفيل الذي قال فيه النبي - صلى الله عليه وسلم - : يبعث أمة وحده ، وسطيح ، وورقة بن نوفل الذي قال فيه النبي - صلى الله عليه وسلم - : رأيته ينغمس في أنهار الجنة . فهؤلاء ومن كان مثلهم حجة على أهل زمانهم وشهيد عليهم . والله أعلم .\nكما ثبت في صحيح البخاري عن أبي سعيد الخدري قال : قال رسول الله - صلى الله عليه وسلم - : يدعى نوح - عليه السلام - يوم القيامة فيقول لبيك وسعديك يا رب فيقول هل بلغت فيقول نعم فيقال لأمته هل بلغكم فيقولون ما أتانا من نذير فيقول من يشهد لك فيقول محمد وأمته فيشهدون أنه قد بلغ ويكون الرسول عليكم شهيدا فذلك قوله - عز وجل - وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا . . . . وذكر هذا الحديث مطولا ابن المبارك بمعناه ، وفيه : فتقول تلك الأمم كيف يشهد علينا من لم يدركنا فيقول لهم الرب سبحانه كيف تشهدون على من لم تدركوا فيقولون ربنا بعثت إلينا رسولا وأنزلت إلينا عهدك وكتابك وقصصت علينا أنهم قد بلغوا فشهدنا بما عهدت إلينا فيقول الرب صدقوا فذلك قوله - عز وجل - وكذلك جعلناكم أمة وسطا - والوسط العدل - لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا .\nقوله تعالى : ونزلنا عليك الكتاب تبيانا لكل شيء نظيره : ما فرطنا في الكتاب من شيء . وقد تقدم فلينظر هناك وقال مجاهد : تبيانا للحلال والحرام .\n                                    ",
        "saadi": "وَيَوۡمَ نَبۡعَثُ فِي كُلِّ أُمَّةٖ شَهِيدًا عَلَيۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِيدًا عَلَىٰ هَٰٓؤُلَآءِۚ وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ ٩٨\n                                        \n                                        \n                                        \n                                        لما ذكر فيما تقدم أنه يبعث { فِي كُلِّ أُمَّةٍ شَهِيدًا } ذكر ذلك أيضا هنا، وخص منهم هذا الرسول الكريم فقال: { وَجِئْنَا بِكَ شَهِيدًا عَلَى هَؤُلَاءِ } أي: على أمتك تشهد عليهم بالخير والشر، وهذا من كمال عدل الله تعالى أن كل رسول يشهد على أمته لأنه أعظم اطلاعا من غيره على أعمال أمته، وأعدل وأشفق من أن يشهد عليهم إلا بما يستحقون.\nوهذا كقوله تعالى: { وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا }\nوقال تعالى: { فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدًا يَوْمَئِذٍ يَوَدُّ الَّذِينَ كَفَرُوا وَعَصَوُا الرَّسُولَ لَوْ تُسَوَّى بِهِمُ الْأَرْضُ } وقوله: { وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِكُلِّ شَيْءٍ } في أصول الدين وفروعه، وفي أحكام الدارين وكل ما يحتاج إليه العباد، فهو مبين فيه أتم تبيين بألفاظ واضحة ومعان جلية، حتى إنه تعالى يثني فيه الأمور الكبار التي يحتاج القلب لمرورها عليه كل وقت، وإعادتها في كل ساعة، ويعيدها ويبديها بألفاظ مختلفة وأدلة متنوعة لتستقر في القلوب فتثمر من الخير والبر بحسب ثبوتها في القلب، وحتى إنه تعالى يجمع في اللفظ القليل الواضح معاني كثيرة يكون اللفظ لها كالقاعدة والأساس، واعتبر هذا بالآية التي بعد هذه الآية وما فيها من أنواع الأوامر والنواهي التي لا تحصى، فلما كان هذا القرآن تبيانا لكل شيء صار حجة الله على العباد كلهم. فانقطعت به حجة الظالمين وانتفع به المسلمون فصار هدى لهم يهتدون به إلى أمر دينهم ودنياهم، ورحمة ينالون به كل خير في الدنيا والآخرة. فالهدى ما نالوه به من علم نافع وعمل صالح.\nوالرحمة ما ترتب على ذلك من ثواب الدنيا والآخرة، كصلاح القلب وبره وطمأنينته، وتمام العقل الذي لا يتم إلا بتربيته على معانيه التي هي أجل المعاني وأعلاها، والأعمال الكريمة والأخلاق الفاضلة، والرزق الواسع والنصر على الأعداء بالقول والفعل ونيل رضا الله تعالى وكرامته العظيمة التي لا يعلم ما فيها من النعيم المقيم إلا الرب الرحيم.\n                                    "
      },
      "originalText": "وَيَوۡمَ نَبۡعَثُ فِي كُلِّ أُمَّةٖ شَهِيدًا عَلَيۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِيدًا عَلَىٰ هَٰٓؤُلَآءِۚ وَنَزَّلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ تِبۡيَٰنٗا لِّكُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ ٩٨"
    },
    {
      "number": 1991,
      "text": "۞ إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَالْبَغْيِ ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 90,
      "juz": 14,
      "manzil": 3,
      "page": 277,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ ٠٩\n                                    \n                                    \n                                    يخبر تعالى أنه يأمر عباده بالعدل ، وهو القسط والموازنة ، ويندب إلى الإحسان ، كما قال تعالى : ( وإن عاقبتم فعاقبوا بمثل ما عوقبتم به ولئن صبرتم لهو خير للصابرين ) [ النحل : 126 ] وقال ( وجزاء سيئة سيئة مثلها فمن عفا وأصلح فأجره على الله ) [ الشورى : 40 ] وقال ( والجروح قصاص فمن تصدق به فهو كفارة له ) [ المائدة : 45 ] إلى غير ذلك من الآيات الدالة على هذا من شرعية العدل والندب إلى الفضل .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( إن الله يأمر بالعدل ) قال : شهادة أن لا إله إلا الله .\nوقال سفيان بن عيينة : العدل في هذا الموضع : هو استواء السريرة والعلانية من كل عامل لله عملا . والإحسان : أن تكون سريرته أحسن من علانيته . والفحشاء والمنكر : أن تكون علانيته أحسن من سريرته .\nوقوله : ( وإيتاء ذي القربى ) أي : يأمر بصلة الأرحام ، كما قال : ( وآت ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا ) [ الإسراء : 26 ] .\nوقوله : ( وينهى عن الفحشاء والمنكر ) فالفواحش : المحرمات . والمنكرات : ما ظهر منها من فاعلها ; ولهذا قيل في الموضع الآخر : ( قل إنما حرم ربي الفواحش ما ظهر منها وما بطن ) [ الأعراف : 33 ] . وأما البغي فهو : العدوان على الناس . وقد جاء في الحديث : \" ما من ذنب أجدر أن يعجل الله عقوبته في الدنيا - مع ما يدخر لصاحبه في الآخرة - من البغي وقطيعة الرحم \" .\nوقوله ) يعظكم ) أي : يأمركم بما يأمركم به من الخير ، وينهاكم عما ينهاكم عنه من الشر ، ( لعلكم تذكرون )\nقال الشعبي ، عن شتير بن شكل : سمعت ابن مسعود يقول : إن أجمع آية في القرآن في سورة النحل : ( إن الله يأمر بالعدل والإحسان ) الآية . رواه ابن جرير .\nوقال سعيد عن قتادة : قوله : ( إن الله يأمر بالعدل والإحسان ) الآية ، ليس من خلق حسن كان أهل الجاهلية يعملون به ويستحسنونه إلا أمر الله به ، وليس من خلق سيئ كانوا يتعايرونه بينهم إلا نهى الله عنه وقدم فيه . وإنما نهى عن سفاسف الأخلاق ومذامها .\nقلت : ولهذا جاء في الحديث : \" إن الله يحب معالي الأخلاق ، ويكره سفسافها \" .\nوقال الحافظ أبو نعيم في كتابه \" كتاب معرفة الصحابة \" : حدثنا أبو بكر محمد بن الفتح الحنبلي ، حدثنا يحيى بن محمد مولى بني هاشم ، حدثنا الحسن بن داود المنكدري ، حدثنا عمر بن علي المقدمي ، عن علي بن عبد الملك بن عمير عن أبيه قال : بلغ أكثم بن صيفي مخرج النبي - صلى الله عليه وسلم - فأراد أن يأتيه فأبى قومه أن يدعوه وقالوا : أنت كبيرنا ، لم تكن لتخف إليه ، قال : فليأته من يبلغه عني ويبلغني عنه ، فانتدب رجلان فأتيا النبي - صلى الله عليه وسلم - فقالا نحن رسل أكثم بن صيفي ، وهو يسألك : من أنت ؟ وما أنت ؟ فقال النبي - صلى الله عليه وسلم - : \" أما من أنا فأنا محمد بن عبد الله ، وأما ما أنا فأنا عبد الله ورسوله \" . قال : ثم تلا عليهم هذه الآية : ( إن الله يأمر بالعدل والإحسان وإيتاء ذي القربى وينهى عن الفحشاء والمنكر والبغي يعظكم لعلكم تذكرون ) قالوا : اردد علينا هذا القول فردده عليهم حتى حفظوه . فأتيا أكثم فقالا أبى أن يرفع نسبه ، فسألنا عن نسبه ، فوجدناه زاكي النسب وسطا في مضر ، وقد رمى إلينا بكلمات قد سمعناها ، فلما سمعهن أكثم قال : إني قد أراه يأمر بمكارم الأخلاق ، وينهى عن ملائمها ، فكونوا في هذا الأمر رءوسا ، ولا تكونوا فيه أذنابا .\nوقد ورد في نزول هذه الآية الكريمة حديث حسن رواه الإمام أحمد :\nحدثنا أبو النضر ، حدثنا عبد الحميد ، حدثنا شهر ، حدثني عبد الله بن عباس قال : بينما رسول الله - صلى الله عليه وسلم - بفناء بيته جالس ، إذ مر به عثمان بن مظعون ، فكشر إلى رسول الله - صلى الله عليه وسلم - فقال له رسول الله - صلى الله عليه وسلم - : \" ألا تجلس ؟ \" فقال : بلى . قال : فجلس رسول الله - صلى الله عليه وسلم - مستقبله ، فبينما هو يحدثه إذ شخص رسول الله - صلى الله عليه وسلم - ببصره في السماء ، فنظر ساعة إلى [ السماء ] فأخذ يضع بصره حتى وضعه على يمنته في الأرض ، فتحرف رسول الله - صلى الله عليه وسلم - عن جليسه عثمان إلى حيث وضع بصره فأخذ ينغض رأسه كأنه يستفقه ما يقال له ، وابن مظعون ينظر فلما قضى حاجته واستفقه ما يقال له ، شخص بصر رسول الله - صلى الله عليه وسلم - إلى السماء كما شخص أول مرة ، فأتبعه بصره حتى توارى في السماء . فأقبل إلى عثمان بجلسته الأولى فقال : يا محمد ، فيما كنت أجالسك ؟ ما رأيتك تفعل كفعلك الغداة ، قال : \" وما رأيتني فعلت ؟ \" قال : رأيتك شخص بصرك إلى السماء ثم وضعته حيث وضعته على يمينك ، فتحرفت إليه وتركتني ، فأخذت تنغض رأسك كأنك تستفقه شيئا يقال لك . قال : \" وفطنت لذلك ؟ \" فقال عثمان : نعم . قال رسول الله - صلى الله عليه وسلم - : \" أتاني رسول الله آنفا وأنت جالس \" . قال : رسول الله ؟ قال : \" نعم \" . قال : فما قال لك ؟ قال : ( إن الله يأمر بالعدل والإحسان وإيتاء ذي القربى وينهى عن الفحشاء والمنكر والبغي يعظكم لعلكم تذكرون ) قال عثمان : فذلك حين استقر الإيمان في قلبي ، وأحببت محمدا - صلى الله عليه وسلم - .\nإسناد جيد متصل حسن ، قد بين فيه السماع المتصل . ورواه ابن أبي حاتم ، من حديث عبد الحميد بن بهرام مختصرا .\nحديث آخر : عن عثمان بن أبي العاص الثقفي في ذلك ، قال الإمام أحمد : حدثنا أسود بن عامر ، حدثنا هريم ، عن ليث ، عن شهر بن حوشب ، عن عثمان بن أبي العاص قال : كنت عند رسول الله - صلى الله عليه وسلم - جالسا ، إذ شخص بصره فقال : \" أتاني جبريل ، فأمرني أن أضع هذه الآية بهذا الموضع من هذه السورة : ( إن الله يأمر بالعدل والإحسان [ وإيتاء ذي القربى وينهى عن الفحشاء والمنكر والبغي يعظكم لعلكم تذكرون ] ) .\nوهذا إسناد لا بأس به ، ولعله عند شهر بن حوشب من الوجهين ، والله أعلم .\n                                    ",
        "qortoby": "۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ ٠٩\n                                    \n                                    \n                                    قوله تعالى : إن الله يأمر بالعدل والإحسان وإيتاء ذي القربى وينهى عن الفحشاء والمنكر والبغي يعظكم لعلكم تذكرون\nفيه ست مسائل :\nالأولى : قوله تعالى : إن الله يأمر بالعدل والإحسان روي عن عثمان بن مظعون أنه قال : لما نزلت هذه الآية قرأتها على علي بن أبي طالب - رضي الله عنه - فتعجب فقال : يا آل غالب ، اتبعوه تفلحوا ، فوالله إن الله أرسله ليأمركم بمكارم الأخلاق . وفي حديث - إن أبا طالب لما قيل له : إن ابن أخيك زعم أن الله أنزل عليه إن الله يأمر بالعدل والإحسان الآية ، قال : اتبعوا ابن أخي ، فوالله إنه لا يأمر إلا بمحاسن الأخلاق . وقال عكرمة : قرأ النبي - صلى الله عليه وسلم - على الوليد بن المغيرة إن الله يأمر بالعدل والإحسان إلى آخرها ، فقال : يا ابن أخي أعد ، فأعاد عليه فقال : والله إن له لحلاوة ، وإن عليه لطلاوة ، وإن أصله لمورق ، وأعلاه لمثمر ، وما هو بقول بشر ، وذكر الغزنوي أن عثمان بن مظعون هو القارئ . قال عثمان : ما أسلمت ابتداء إلا حياء من رسول الله - صلى الله عليه وسلم - حتى نزلت هذه الآية وأنا عنده فاستقر الإيمان في قلبي ، فقرأتها على الوليد بن المغيرة فقال : يا ابن أخي أعد فأعدت فقال : والله إن له لحلاوة . . . وذكر تمام الخبر . وقال ابن مسعود : هذه أجمع آية في القرآن لخير يمتثل ، ولشر يجتنب . وحكى النقاش قال : يقال زكاة العدل الإحسان ، وزكاة القدرة العفو ، وزكاة الغنى المعروف ، وزكاة الجاه كتب الرجل إلى إخوانه .\nالثانية : اختلف العلماء في تأويل العدل والإحسان ; فقال ابن عباس : العدل لا إله إلا الله ، والإحسان أداء الفرائض . وقيل : العدل الفرض ، والإحسان النافلة . وقال سفيان بن عيينة : العدل هاهنا استواء السريرة ، والإحسان أن تكون السريرة أفضل من العلانية . علي بن أبي طالب : العدل الإنصاف ، والإحسان التفضل . قال ابن عطية : العدل هو كل مفروض ، من عقائد وشرائع في أداء الأمانات ، وترك الظلم والإنصاف ، وإعطاء الحق . والإحسان هو فعل كل مندوب إليه ; فمن الأشياء ما هو كله مندوب إليه ، ومنها ما هو فرض ، إلا أن حد الإجزاء منه داخل في العدل ، والتكميل الزائد على الإجزاء داخل في الإحسان . وأما قول ابن عباس ففيه نظر ; لأن أداء الفرائض هي الإسلام حسبما فسره رسول الله - صلى الله عليه وسلم - في حديث سؤال جبريل ، وذلك هو العدل ، وإنما الإحسان التكميلات والمندوب إليه حسبما يقتضيه تفسير النبي - صلى الله عليه وسلم - في حديث سؤال جبريل بقوله : أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك . فإن صح هذا عن ابن عباس فإنما أراد الفرائض مكملة . وقال ابن العربي : العدل بين العبد وبين ربه إيثار حقه - تعالى - على حظ نفسه ، وتقديم رضاه على هواه ، والاجتناب للزواجر والامتثال للأوامر . وأما العدل بينه وبين نفسه فمنعها مما فيه هلاكها ; قال الله - تعالى - : ونهى النفس عن الهوى وعزوب الأطماع عن الأتباع ، ولزوم القناعة في كل حال ومعنى . وأما العدل بينه وبين الخلق فبذل النصيحة ، وترك الخيانة فيما قل وكثر ، والإنصاف من نفسك لهم بكل وجه ، ولا يكون منك إساءة إلى أحد بقول ولا فعل لا في سر ولا في علن ، والصبر على ما يصيبك منهم من البلوى ، وأقل ذلك الإنصاف وترك الأذى .\nقلت : هذا التفصيل في العدل حسن وعدل ، وأما الإحسان فقد قال علماؤنا : الإحسان مصدر أحسن يحسن إحسانا . ويقال على معنيين : أحدهما متعد بنفسه ; كقولك : أحسنت كذا ، أي حسنته وكملته ، وهو منقول بالهمزة من حسن الشيء . وثانيهما متعد بحرف جر ; كقولك : أحسنت إلى فلان ، أي أوصلت إليه ما ينتفع به .\nقلت : وهو في هذه الآية مراد بالمعنيين معا ; فإنه - تعالى - يحب من خلقه إحسان بعضهم إلى بعض ، حتى أن الطائر في سجنك والسنور في دارك لا ينبغي أن تقصر تعهده بإحسانك ; وهو - تعالى - غني عن إحسانهم ، ومنه الإحسان والنعم والفضل والمنن . وهو في حديث جبريل بالمعنى الأول لا بالثاني ; فإن المعنى الأول راجع إلى إتقان العبادة ومراعاتها بأدائها المصححة والمكملة ، ومراقبة الحق فيها واستحضار عظمته وجلاله حالة الشروع وحالة الاستمرار . وهو المراد بقوله أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك . وأرباب القلوب في هذه المراقبة على حالين : أحدهما غالب عليه مشاهدة الحق فكأنه يراه . ولعل النبي - صلى الله عليه وسلم - أشار إلى هذه الحالة بقوله : وجعلت قرة عيني في الصلاة . وثانيهما : لا تنتهي إلى هذا ، لكن يغلب عليه أن الحق سبحانه مطلع عليه ومشاهد له ، وإليه الإشارة بقوله - تعالى - : الذي يراك حين تقوم . وتقلبك في الساجدين وقوله : إلا كنا عليكم شهودا إذ تفيضون فيه .\nالثالثة : قوله تعالى : وإيتاء ذي القربى أي القرابة ; يقول : يعطيهم المال كما قال وآت ذا القربى حقه يعني صلته . وهذا من باب عطف المندوب على الواجب ، وبه استدل الشافعي في إيجاب إيتاء المكاتب ، على ما يأتي بيانه . وإنما خص ذا القربى لأن حقوقهم أوكد وصلتهم أوجب ; لتأكيد حق الرحم التي اشتق الله اسمها من اسمه ، وجعل صلتها من صلته ، فقال في الصحيح : أما ترضين أن أصل من وصلك وأقطع من قطعك . ولا سيما إذا كانوا فقراء .\nالرابعة : قوله تعالى : وينهى عن الفحشاء والمنكر والبغي الفحشاء : الفحش ، وهو كل قبيح من قول أو فعل . ابن عباس : هو الزنا . والمنكر : ما أنكره الشرع بالنهي عنه ، وهو يعم جميع المعاصي والرذائل والدناءات على اختلاف أنواعها . وقيل هو الشرك . والبغي : هو الكبر والظلم والحقد والتعدي ; وحقيقته تجاوز الحد ، وهو داخل تحت المنكر ، لكنه - تعالى - خصه بالذكر اهتماما به لشدة ضرره . وفي الحديث عن النبي - صلى الله عليه وسلم - لا ذنب أسرع عقوبة من بغي . وقال - عليه السلام - : الباغي مصروع . وقد وعد الله من بغي عليه بالنصر . وفى بعض الكتب المنزلة : لو بغى جبل على جبل لجعل الباغي منهما دكا . .\nالخامسة : ترجم الإمام أبو عبد الله محمد بن إسماعيل البخاري في صحيحه فقال : ( باب قول الله - تعالى - : إن الله يأمر بالعدل والإحسان وإيتاء ذي القربى وينهى عن الفحشاء والمنكر والبغي يعظكم لعلكم تذكرون وقوله : إنما بغيكم على أنفسكم ، ثم بغي عليه لينصرنه الله ، وترك إثارة الشر على مسلم أو كافر ) ثم ذكر حديث عائشة في سحر لبيد بن الأعصم النبي - صلى الله عليه وسلم - . قال ابن بطال : فتأول - رضي الله عنه - من هذه الآيات ترك إثارة الشر على مسلم أو كافر ; كما دل عليه حديث عائشة حيث قال - عليه السلام - : أما الله فقد شفاني وأما أنا فأكره أن أثير على الناس شرا . ووجه ذلك - والله أعلم - أنه تأول في قول الله - تعالى - : إن الله يأمر بالعدل والإحسان الندب بالإحسان إلى المسيء وترك معاقبته على إساءته . فإن قيل : كيف يصح هذا التأويل في آيات البغي . قيل : وجه ذلك - والله أعلم - أنه لما أعلم الله عباده بأن ضرر البغي ينصرف على الباغي بقوله : إنما بغيكم على أنفسكم وضمن - تعالى - نصرة من بغي عليه ، كان الأولى بمن بغي عليه شكر الله على ما ضمن من نصره ومقابلة ذلك بالعفو عمن بغى عليه ; وكذلك فعل النبي - صلى الله عليه وسلم - باليهودي الذي سحره ، وقد كان له الانتقام منه بقوله : وإن عاقبتم فعاقبوا بمثل ما عوقبتم به . ولكن آثر الصفح أخذا بقوله : ولمن صبر وغفر إن ذلك لمن عزم الأمور .\nالسادسة : تضمنت هذه الآية الأمر بالمعروف والنهي عن المنكر . وقد تقدم القول فيهما روي أن جماعة رفعت عاملها إلى أبي جعفر المنصور العباسي ، فحاجها العامل وغلبها ; بأنهم لم يثبتوا عليه كبير ظلم ولا جوره في شيء ; فقام فتى من القوم فقال : يا أمير المؤمنين ، إن الله يأمر بالعدل والإحسان وإنه عدل ولم يحسن . قال : فعجب أبو جعفر من إصابته وعزل العامل .\n                                    ",
        "saadi": "۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ ٠٩\n                                        \n                                        \n                                        \n                                        فالعدل الذي أمر الله به يشمل العدل في حقه وفي حق عباده، فالعدل في ذلك أداء الحقوق كاملة موفرة بأن يؤدي العبد ما أوجب الله عليه من الحقوق المالية والبدنية والمركبة منهما في حقه وحق عباده، ويعامل الخلق بالعدل التام، فيؤدي كل وال ما عليه تحت ولايته سواء في ذلك ولاية الإمامة الكبرى، وولاية القضاء ونواب الخليفة، ونواب القاضي.\nوالعدل هو ما فرضه الله عليهم في كتابه، وعلى لسان رسوله، وأمرهم بسلوكه، ومن العدل في المعاملات أن تعاملهم في عقود البيع والشراء وسائر المعاوضات، بإيفاء جميع ما عليك فلا تبخس لهم حقا ولا تغشهم ولا تخدعهم وتظلمهم. فالعدل واجب، والإحسان فضيلة مستحب وذلك كنفع الناس بالمال والبدن والعلم، وغير ذلك من أنواع النفع حتى إنه يدخل فيه الإحسان إلى الحيوان البهيم المأكول وغيره.\nوخص الله إيتاء ذي القربى -وإن كان داخلا في العموم- لتأكد حقهم وتعين صلتهم وبرهم، والحرص على ذلك.\nويدخل في ذلك جميع الأقارب قريبهم وبعيدهم لكن كل ما كان أقرب كان أحق بالبر.\nوقوله: { وَيَنْهَى عَنِ الْفَحْشَاءِ } وهو كل ذنب عظيم استفحشته الشرائع والفطر كالشرك بالله والقتل بغير حق والزنا والسرقة والعجب والكبر واحتقار الخلق وغير ذلك من الفواحش.\nويدخل في المنكر كل ذنب ومعصية متعلق بحق الله تعالى.\nوبالبغي كل عدوان على الخلق في الدماء والأموال والأعراض.\nفصارت هذه الآية جامعة لجميع المأمورات والمنهيات لم يبق شيء إلا دخل فيها، فهذه قاعدة ترجع إليها سائر الجزئيات، فكل مسألة مشتملة على عدل أو إحسان أو إيتاء ذي القربى فهي مما أمر الله به.\nوكل مسألة مشتملة على فحشاء أو منكر أو بغي فهي مما نهى الله عنه. وبها يعلم حسن ما أمر الله به وقبح ما نهى عنه، وبها يعتبر ما عند الناس من الأقوال وترد إليها سائر الأحوال، فتبارك من جعل في كلامه الهدى والشفاء والنور والفرقان بين جميع الأشياء.\nولهذا قال: { يَعِظُكُمْ بِهِ } أي: بما بينه لكم في كتابه بأمركم بما فيه غاية صلاحكم ونهيكم عما فيه مضرتكم.\n{ لَعَلَّكُمْ تَذَكَّرُونَ } ما يعظكم به فتفهمونه وتعقلونه، فإنكم إذا تذكرتموه وعقلتموه عملتم بمقتضاه فسعدتم سعادة لا شقاوة معها.\n                                    "
      },
      "originalText": "۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ ٠٩"
    },
    {
      "number": 1992,
      "text": "وَأَوْفُوا بِعَهْدِ اللَّهِ إِذَا عَاهَدْتُمْ وَلَا تَنْقُضُوا الْأَيْمَانَ بَعْدَ تَوْكِيدِهَا وَقَدْ جَعَلْتُمُ اللَّهَ عَلَيْكُمْ كَفِيلًا ۚ إِنَّ اللَّهَ يَعْلَمُ مَا تَفْعَلُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 91,
      "juz": 14,
      "manzil": 3,
      "page": 277,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ ١٩\n                                    \n                                    \n                                    وهذا مما يأمر الله تعالى به وهو الوفاء بالعهود والمواثيق ، والمحافظة على الأيمان المؤكدة ; ولهذا قال : ( ولا تنقضوا الأيمان بعد توكيدها )\nولا تعارض بين هذا وبين قوله : ( ولا تجعلوا الله عرضة لأيمانكم أن تبروا وتتقوا [ وتصلحوا بين الناس ] ) [ البقرة : 224 ] وبين قوله تعالى : ( ذلك كفارة أيمانكم إذا حلفتم واحفظوا أيمانكم ) [ المائدة : 89 ] أي : لا تتركوها بلا تكفير ، وبين قوله - عليه السلام - فيما ثبت عنه في الصحيحين : إني والله - إن شاء الله - لا أحلف على يمين فأرى غيرها خيرا منها ، إلا أتيت الذي هو خير وتحللتها \" . وفي رواية : \" وكفرت عن يميني \" لا تعارض بين هذا كله ، ولا بين الآية المذكورة هاهنا وهي قوله : ( ولا تنقضوا الأيمان بعد توكيدها [ وقد جعلتم الله عليكم كفيلا ] ) ; لأن هذه الأيمان المراد بها الداخلة في العهود والمواثيق ، لا الأيمان التي هي واردة على حث أو منع ; ولهذا قال مجاهد في قوله : ( ولا تنقضوا الأيمان بعد توكيدها ) يعني : الحلف ، أي : حلف الجاهلية ; ويؤيده ما رواه الإمام أحمد :\nحدثنا عبد الله بن محمد - هو ابن أبي شيبة - حدثنا ابن نمير وأبو أسامة ، عن زكريا - هو ابن أبي زائدة - عن سعد بن إبراهيم ، عن أبيه ، عن جبير بن مطعم قال : قال رسول الله - صلى الله عليه وسلم - : \" لا حلف في الإسلام ، وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة \" .\nوكذا رواه مسلم ، عن ابن أبي شيبة به .\nومعناه أن الإسلام لا يحتاج معه إلى الحلف الذي كان أهل الجاهلية يفعلونه ، فإن في التمسك بالإسلام كفاية عما كانوا فيه .\nوأما ما ورد في الصحيحين ، عن عاصم الأحول ، عن أنس - رضي الله عنه - أنه قال : حالف رسول الله - صلى الله عليه وسلم - بين المهاجرين والأنصار في دارنا - فمعناه : أنه آخى بينهم ، فكانوا يتوارثون به ، حتى نسخ الله ذلك ، والله أعلم .\nوقال ابن جرير : حدثني محمد بن عمارة الأسدي ، حدثنا عبيد الله بن موسى ، أخبرنا ابن أبي ليلى ، عن مزيدة في قوله : ( وأوفوا بعهد الله إذا عاهدتم ) قال : نزلت في بيعة النبي - صلى الله عليه وسلم - كان من أسلم بايع النبي - صلى الله عليه وسلم - على الإسلام ، فقال : ( وأوفوا بعهد الله إذا عاهدتم ) هذه البيعة التي بايعتم على الإسلام ، ( ولا تنقضوا الأيمان بعد توكيدها ) البيعة ، لا يحملنكم قلة محمد [ وأصحابه ] وكثرة المشركين أن تنقضوا البيعة التي تبايعتم على الإسلام .\nوقال الإمام أحمد : حدثنا إسماعيل ، حدثنا صخر بن جويرية ، عن نافع قال : لما خلع الناس يزيد بن معاوية ، جمع ابن عمر بنيه وأهله ، ثم تشهد ، ثم قال : أما بعد ، فإنا قد بايعنا هذا الرجل على بيعة الله ورسوله ، وإني سمعت رسول الله - صلى الله عليه وسلم - يقول : \" إن الغادر ينصب له لواء يوم القيامة ، فيقال هذه غدرة فلان وإن من أعظم الغدر - إلا أن يكون الإشراك بالله - أن يبايع رجل رجلا على بيعة الله ورسوله ، ثم ينكث بيعته ، فلا يخلعن أحد منكم يزيد ولا يسرفن أحد منكم في هذا الأمر فيكون صيلم بيني وبينه \" . المرفوع منه في الصحيحين .\nوقال الإمام أحمد : حدثنا يزيد ، حدثنا حجاج ، عن عبد الرحمن بن عابس ، عن أبيه ، عن حذيفة قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" من شرط لأخيه شرطا ، لا يريد أن يفي له به ، فهو كالمدلي جاره إلى غير منعة \" .\nوقوله : ( إن الله يعلم ما تفعلون ) تهديد ووعيد لمن نقض الأيمان بعد توكيدها .\n                                    ",
        "qortoby": "وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ ١٩\n                                    \n                                    \n                                    قوله تعالى : وأوفوا بعهد الله إذا عاهدتم ولا تنقضوا الأيمان بعد توكيدها وقد جعلتم الله عليكم كفيلا إن الله يعلم ما تفعلون\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : وأوفوا بعهد الله لفظ عام لجميع ما يعقد باللسان ويلتزمه الإنسان بالعدل والإحسان لأن المعنى فيها : افعلوا كذا ، وانتهوا عن كذا ; فعطف على ذلك التقدير . وقد قيل : إنها نزلت في بيعة النبي - صلى الله عليه وسلم - على الإسلام . وقيل : نزلت في التزام الحلف الذي كان في الجاهلية وجاء الإسلام بالوفاء ; قاله قتادة ومجاهد وابن زيد . والعموم يتناول كل ذلك كما بيناه . روى الصحيح عن جبير بن مطعم قال : قال رسول الله - صلى الله عليه وسلم - : لا حلف في الإسلام وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة يعني في نصرة الحق والقيام به والمواساة . وهذا كنحو حلف الفضول الذي ذكره ابن إسحاق قال : اجتمعت قبائل من قريش في دار عبد الله بن جدعان لشرفه ونسبه ، فتعاقدوا وتعاهدوا على ألا يجدوا بمكة مظلوما من أهلها أو غيرهم إلا قاموا معه حتى ترد عليه مظلمته ; فسمت قريش ذلك الحلف حلف الفضول ، أي حلف الفضائل . والفضول هنا جمع فضل للكثرة كفلس وفلوس . روى ابن إسحاق عن ابن شهاب قال : قال رسول الله - صلى الله عليه وسلم - : لقد شهدت في دار عبد الله بن جدعان حلفا ما أحب أن لي به حمر النعم لو أدعى به في الإسلام لأجبت . وقال ابن إسحاق : تحامل الوليد بن عتبة على حسين بن علي في مال له ، لسلطان الوليد فإنه كان أميرا على المدينة ; فقال له حسين بن علي : أحلف بالله لتنصفني من حقي أو لآخذن سيفي ثم لأقومن في مسجد رسول الله - صلى الله عليه وسلم - ثم لأدعون بحلف الفضول . قال عبد الله بن الزبير : وأنا أحلف والله لئن دعانا لآخذن سيفي ثم لأقومن معه حتى ينتصف من حقه أو نموت جميعا . وبلغت المسور بن مخرمة فقال مثل ذلك . وبلغت عبد الرحمن بن عثمان بن عبيد الله التيمي فقال مثل ذلك . فلما بلغ ذلك الوليد أنصفه . قال العلماء : فهذا الحلف الذي كان في الجاهلية هو الذي شده الإسلام وخصه النبي - عليه الصلاة والسلام - من عموم قوله : لا حلف في الإسلام . والحكمة في ذلك أن الشرع جاء بالانتصار من الظالم وأخذ الحق منه وإيصاله إلى المظلوم ، وأوجب ذلك بأصل الشريعة إيجابا عاما على من قدر من المكلفين ، وجعل لهم السبيل على الظالمين فقال - تعالى - : إنما السبيل على الذين يظلمون الناس ويبغون في الأرض بغير الحق أولئك لهم عذاب أليم . وفي الصحيح : انصر أخاك ظالما أو مظلوما قالوا : يا رسول الله ، هذا ننصره مظلوما فكيف ننصره ظالما ؟ قال : تأخذ على يديه : في رواية : تمنعه من الظلم فإن ذلك نصره . وقد تقدم قوله - عليه السلام - : إن الناس إذا رأوا الظالم ولم يأخذوا على يديه أوشك أن يعمهم الله بعقاب من عنده .\nالثانية : قوله تعالى : ولا تنقضوا الأيمان بعد توكيدها يقول بعد تشديدها وتغليظها ; يقال : توكيد وتأكيد ، ووكد وأكد ، وهما لغتان .\nالثالثة : قوله تعالى : وقد جعلتم الله عليكم كفيلا يعني شهيدا . ويقال حافظا ، ويقال ضامنا . وإنما قال بعد توكيدها فرقا بين اليمين المؤكدة بالعزم وبين لغو اليمين وقال ابن وهب وابن القاسم عن مالك التوكيد هو حلف الإنسان في الشيء الواحد مرارا ، يردد فيه الأيمان ثلاثا أو أكثر من ذلك ; كقوله : والله لا أنقصه من كذا ، والله لا أنقصه من كذا ، والله لا أنقصه من كذا . قال : فكفارة ذلك واحدة مثل كفارة اليمين . وقال يحيى بن سعيد : هي العهود ، والعهد يمين ، ولكن الفرق بينهما أن العهد لا يكفر . قال النبي - صلى الله عليه وسلم - : ينصب لكل غادر لواء يوم القيامة عند استه بقدر غدرته يقال هذه غدرة فلان . وأما اليمين بالله فقد شرع الله سبحانه فيها الكفارة بخصلة واحدة ، وحل ما انعقدت عليه اليمين . وقال ابن عمر : التوكيد هو أن يحلف مرتين ، فإن حلف واحدة فلا كفارة فيه . وقد تقدم في المائدة\n                                    ",
        "saadi": "وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ ١٩\n                                        \n                                        \n                                        \n                                        وهذا يشمل جميع ما عاهد العبد عليه ربه من العبادات والنذور والأيمان التي عقدها إذا كان الوفاء بها برا، ويشمل أيضا ما تعاقد عليه هو وغيره كالعهود بين المتعاقدين، وكالوعد الذي يعده العبد لغيره ويؤكده على نفسه، فعليه في جميع ذلك الوفاء وتتميمها مع القدرة، ولهذا نهى الله عن نقضها فقال: { وَلَا تَنْقُضُوا الْأَيْمَانَ بَعْدَ تَوْكِيدِهَا } بعقدها على اسم الله تعالى: { وَقَدْ جَعَلْتُمُ اللَّهَ عَلَيْكُمْ } أيها المتعاقدون { كَفِيلًا } فلا يحل لكم أن لا تحكموا ما جعلتم الله عليكم كفيلا فيكون ذلك ترك تعظيم الله واستهانة به، وقد رضي الآخر منك باليمين والتوكيد الذي جعلت الله فيه كفيلا. فكما ائتمنك وأحسن ظنه فيك فلتف له بما قلته وأكدته.\n{ إِنَّ اللَّهَ يَعْلَمُ مَا تَفْعَلُونَ } يجازي كل عامل بعمله على حسب نيته ومقصده.\n                                    "
      },
      "originalText": "وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ ١٩"
    },
    {
      "number": 1993,
      "text": "وَلَا تَكُونُوا كَالَّتِي نَقَضَتْ غَزْلَهَا مِنْ بَعْدِ قُوَّةٍ أَنْكَاثًا تَتَّخِذُونَ أَيْمَانَكُمْ دَخَلًا بَيْنَكُمْ أَنْ تَكُونَ أُمَّةٌ هِيَ أَرْبَىٰ مِنْ أُمَّةٍ ۚ إِنَّمَا يَبْلُوكُمُ اللَّهُ بِهِ ۚ وَلَيُبَيِّنَنَّ لَكُمْ يَوْمَ الْقِيَامَةِ مَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 92,
      "juz": 14,
      "manzil": 3,
      "page": 277,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٢٩\n                                    \n                                    \n                                    وقوله : ( ولا تكونوا كالتي نقضت غزلها من بعد قوة أنكاثا ) قال عبد الله بن كثير ، والسدي : هذه امرأة خرقاء كانت بمكة ، كلما غزلت شيئا نقضته بعد إبرامه .\nوقال مجاهد ، وقتادة ، وابن زيد : هذا مثل لمن نقض عهده بعد توكيده .\nوهذا القول أرجح وأظهر ، وسواء كان بمكة امرأة تنقض غزلها أم لا .\nوقوله : ( أنكاثا ) يحتمل أن يكون اسم مصدر ، نقضت غزلها أنكاثا ، أي : أنقاضا . ويحتمل أن يكون بدلا عن خبر كان ، أي : لا تكونوا أنكاثا ، جمع نكث من ناكث ; ولهذا قال بعده : ( تتخذون أيمانكم دخلا بينكم ) أي : خديعة ومكرا ، ( أن تكون أمة هي أربى من أمة ) أي : يحلفون للناس إذا كانوا أكثر منكم ليطمئنوا إليكم ، فإذا أمكنكم الغدر بهم غدرتم . فنهى الله عن ذلك ؛ لينبه بالأدنى على الأعلى إذا كان قد نهى عن الغدر - والحالة هذه - فلأن ينهى عنه مع التمكن والقدرة بطريق الأولى .\nوقد قدمنا - ولله الحمد - في سورة \" الأنفال \" قصة معاوية لما كان بينه وبين ملك الروم أمد ، فسار معاوية إليهم في آخر الأجل ، حتى إذا انقضى وهو قريب من بلادهم ، أغار عليهم وهم غارون لا يشعرون ، فقال له عمرو بن عبسة : الله أكبر يا معاوية وفاء لا غدرا ، سمعت رسول الله - صلى الله عليه وسلم - يقول : \" من كان بينه وبين قوم أجل فلا يحلن عقدة حتى ينقضي أمدها \" . فرجع معاوية بالجيش - رضي الله عنه - وأرضاه .\nقال ابن عباس : ( أن تكون أمة هي أربى من أمة ) أي : أكثر .\nوقال مجاهد : كانوا يحالفون الحلفاء ، فيجدون أكثر منهم وأعز ، فينقضون حلف هؤلاء ويحالفون أولئك الذين هم أكثر وأعز ، فنهوا عن ذلك . وقال الضحاك ، وقتادة ، وابن زيد نحوه .\nوقوله : ( إنما يبلوكم الله به ) قال سعيد بن جبير : يعني بالكثرة ، رواه ابن أبي حاتم .\nوقال ابن جرير : أي : بأمره إياكم بالوفاء والعهد .\n( وليبينن لكم يوم القيامة ما كنتم فيه تختلفون ) فيجازي كل عامل بعمله ، من خير وشر .\n                                    ",
        "qortoby": "وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٢٩\n                                    \n                                    \n                                    قوله تعالى : ولا تكونوا كالتي نقضت غزلها من بعد قوة أنكاثا تتخذون أيمانكم دخلا بينكم أن تكون أمة هي أربى من أمة إنما يبلوكم الله به وليبينن لكم يوم القيامة ما كنتم فيه تختلفون\nقوله تعالى : ولا تكونوا كالتي نقضت غزلها من بعد قوة أنكاثا النقض والنكث واحد ، والاسم النكث والنقض ، والجمع الأنكاث . فشبهت هذه الآية الذي يحلف ويعاهد ويبرم عهده ثم ينقضه بالمرأة تغزل غزلها وتفتله محكما ثم تحله . ويروى أن امرأة حمقاء كانت بمكة تسمى ريطة بنت عمرو بن كعب بن سعد بن تيم بن مرة كانت تفعل ذلك ، فبها وقع التشبيه ; قال الفراء ، وحكاه عبد الله بن كثير والسدي ولم يسميا المرأة ، وقال مجاهد وقتادة : وذلك ضرب مثل ، لا على امرأة معينة . وأنكاثا نصب على الحال . والدخل : الدغل والخديعة والغش . قال أبو عبيدة : كل أمر لم يكن صحيحا فهو دخل .\nأن تكون أمة هي أربى من أمة قال المفسرون : نزلت هذه الآية في العرب الذين كانت القبيلة منهم إذ حالفت أخرى ، ثم جاءت إحداهما قبيلة كثيرة قوية فداخلتها غدرت الأولى ونقضت عهدها ورجعت إلى هذه الكبرى - قاله مجاهد - فقال الله - تعالى - : لا تنقضوا العهود من أجل أن طائفة أكثر من طائفة أخرى أو أكثر أموالا فتنقضون أيمانكم إذا رأيتم الكثرة والسعة في الدنيا لأعدائكم المشركين . والمقصود النهي عن العود إلى الكفر بسبب كثرة الكفار وكثرة أموالهم . وقال الفراء : المعنى لا تغدروا بقوم لقلتهم وكثرتكم أو لقلتكم وكثرتهم ، وقد عززتموهم بالأيمان . أربى أي أكثر ; من ربا الشيء يربو إذا كثر . والضمير في به يحتمل أن يعود على الوفاء الذي أمر الله به . ويحتمل أن يعود على الرباء ;\nأي أن الله - تعالى - ابتلى عباده بالتحاسد وطلب بعضهم الظهور على بعض ، واختبرهم بذلك من يجاهد نفسه فيخالفها ممن يتبعها ويعمل بمقتضى هواها ; وهو معنى قوله : إنما يبلوكم الله به وليبينن لكم يوم القيامة ما كنتم فيه تختلفون من البعث وغيره .\n                                    ",
        "saadi": "وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٢٩\n                                        \n                                        \n                                        \n                                        { وَلَا تَكُونُوا } في نقضكم للعهود بأسوأ الأمثال وأقبحها وأدلها على سفه متعاطيها، وذلك { كَالَّتِي } تغزل غزلا قويا فإذا استحكم وتم ما أريد منه نقضته فجعلته { أَنْكَاثًا } فتعبت على الغزل ثم على النقض، ولم تستفد سوى الخيبة والعناء وسفاهة العقل ونقص الرأي، فكذلك من نقض ما عاهد عليه فهو ظالم جاهل سفيه ناقص الدين والمروءة.\nوقوله: { تَتَّخِذُونَ أَيْمَانَكُمْ دَخَلًا بَيْنَكُمْ أَنْ تَكُونَ أُمَّةٌ هِيَ أَرْبَى مِنْ أُمَّةٍ } أي: لا تنبغي هذه الحالة منكم تعقدون الأيمان المؤكدة وتنتظرون فيها الفرص، فإذا كان العاقد لها ضعيفا غير قادر على الآخر أتمها لا لتعظيم العقد واليمين بل لعجزه، وإن كان قويا يرى مصلحته الدنيوية في نقضها نقضها غير مبال بعهد الله ويمينه.\nكل ذلك دورانا مع أهوية النفوس، وتقديما لها على مراد الله منكم، وعلى المروءة الإنسانية، والأخلاق المرضية لأجل أن تكون أمة أكثر عددا وقوة من الأخرى.\nوهذا ابتلاء من الله وامتحان يبتليكم الله به حيث قيض من أسباب المحن ما يمتحن به الصادق الوفي من الفاجر الشقي.\n{ وَلَيُبَيِّنَنَّ لَكُمْ يَوْمَ الْقِيَامَةِ مَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ } فيجازي كلا بما عمل، ويخزي الغادر.\n                                    "
      },
      "originalText": "وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٢٩"
    },
    {
      "number": 1994,
      "text": "وَلَوْ شَاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً وَاحِدَةً وَلَٰكِنْ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ ۚ وَلَتُسْأَلُنَّ عَمَّا كُنْتُمْ تَعْمَلُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 93,
      "juz": 14,
      "manzil": 3,
      "page": 277,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَلَتُسۡ‍َٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ ٣٩\n                                    \n                                    \n                                    قول تعالى : ( ولو شاء الله لجعلكم ) أيها الناس ( أمة واحدة ) ، كما قال تعالى : ( ولو شاء ربك لآمن من في الأرض كلهم جميعا ) [ يونس : 99 ] أي : لوفق بينكم . ولما جعل اختلافا ولا تباغض ولا شحناء ( ولو شاء ربك لجعل الناس أمة واحدة ولا يزالون مختلفين إلا من رحم ربك ولذلك خلقهم ) [ هود : 118 ، 119 ] وهكذا قال هاهنا : ( ولكن يضل من يشاء ويهدي من يشاء ) ثم يسألكم يوم القيامة عن جميع أعمالكم ، فيجازيكم عليها على الفتيل والنقير والقطمير .\n                                    ",
        "qortoby": "وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَلَتُسۡ‍َٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ ٣٩\n                                    \n                                    \n                                    قوله تعالى : ولو شاء الله لجعلكم أمة واحدة ولكن يضل من يشاء ويهدي من يشاء ولتسألن عما كنتم تعملون ولو شاء الله لجعلكم أمة واحدة أي على ملة واحدة .\nولكن يضل من يشاء بخذلانه إياهم ; عدلا منه فيهم .\nويهدي من يشاء بتوفيقه إياهم ; فضلا منه عليهم ، ولا يسأل عما يفعل بل تسألون أنتم . والآية ترد على أهل القدر كما تقدم .\nواللام في وليبينن ولتسئلن مع النون المشددة يدلان على قسم مضمر ، أي والله ليبينن لكم ولتسئلن .\n                                    ",
        "saadi": "وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَلَتُسۡ‍َٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ ٣٩\n                                        \n                                        \n                                        \n                                        أي: { لَوْ شَاءَ اللَّهُ } لجمع الناس على الهدى وجعلهم { أُمَّةً وَاحِدَةً } ولكنه تعالى المنفرد بالهداية والإضلال، وهدايته وإضلاله من أفعاله التابعة لعلمه وحكمته، يعطي الهداية من يستحقها فضلا، ويمنعها من لا يستحقها عدلا. { وَلَتُسْأَلُنَّ عَمَّا كُنْتُمْ تَعْمَلُونَ } من خير وشر فيجازيكم عليها أتم الجزاء وأعدله.\n                                    "
      },
      "originalText": "وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَلَتُسۡ‍َٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ ٣٩"
    }
  ]
}