{
  "number": 278,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 1995,
      "text": "وَلَا تَتَّخِذُوا أَيْمَانَكُمْ دَخَلًا بَيْنَكُمْ فَتَزِلَّ قَدَمٌ بَعْدَ ثُبُوتِهَا وَتَذُوقُوا السُّوءَ بِمَا صَدَدْتُمْ عَنْ سَبِيلِ اللَّهِ ۖ وَلَكُمْ عَذَابٌ عَظِيمٌ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 94,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَتَّخِذُوٓاْ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُواْ ٱلسُّوٓءَ بِمَا صَدَدتُّمۡ عَن سَبِيلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِيمٞ ٤٩\n                                    \n                                    \n                                    ثم حذر تعالى عباده عن اتخاذ الأيمان دخلا أي خديعة ومكرا ؛ لئلا تزل قدم بعد ثبوتها : مثل لمن كان على الاستقامة فحاد عنها وزل عن طريق الهدى ، بسبب الأيمان الحانثة المشتملة على الصد عن سبيل الله ؛ لأن الكافر إذا رأى أن المؤمن قد عاهده ثم غدر به ، لم يبق له وثوق بالدين ، فانصد بسببه عن الدخول في الإسلام ; ولهذا قال : ( وتذوقوا السوء بما صددتم عن سبيل الله ولكم عذاب عظيم )\n                                    ",
        "qortoby": "وَلَا تَتَّخِذُوٓاْ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُواْ ٱلسُّوٓءَ بِمَا صَدَدتُّمۡ عَن سَبِيلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِيمٞ ٤٩\n                                    \n                                    \n                                    قوله تعالى : ولا تتخذوا أيمانكم دخلا بينكم فتزل قدم بعد ثبوتها وتذوقوا السوء بما صددتم عن سبيل الله ولكم عذاب عظيم\nقوله تعالى : ولا تتخذوا أيمانكم دخلا بينكم كرر ذلك تأكيدا .\nفتزل قدم بعد ثبوتها مبالغة في النهي عنه لعظم موقعه في الدين وتردده في معاشرات الناس ; أي لا تعقدوا الأيمان بالانطواء على الخديعة والفساد فتزل قدم بعد ثبوتها ، أي عن الأيمان بعد المعرفة بالله . وهذه استعارة للمستقيم الحال يقع في شر عظيم ويسقط فيه ; لأن القدم إذا زلت نقلت الإنسان من حال خير إلى حال شر ; ومن هذا المعنى قول كثير :\nفلما توافينا ثبت وزلت\nوالعرب تقول لكل مبتلى بعد عافية أو ساقط في ورطة : زلت قدمه ; كقول الشاعر :\nسيمنع منك السبق إن كنت سابقا وتقتل إن زلت بك القدمان\nويقال لمن أخطأ في شيء : زل فيه .\nثم توعد - تعالى - بعد بعذاب في الدنيا وعذاب عظيم في الآخرة . وهذا الوعيد إنما هو فيمن نقض عهد رسول الله - صلى الله عليه وسلم - ; فإن من عاهده ثم نقض عهده خرج من الإيمان ، ولهذا قال : وتذوقوا السوء بما صددتم عن سبيل الله أي بصدكم . وذوق السوء في الدنيا هو ما يحل بهم من المكروه .\n                                    ",
        "saadi": "وَلَا تَتَّخِذُوٓاْ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُواْ ٱلسُّوٓءَ بِمَا صَدَدتُّمۡ عَن سَبِيلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِيمٞ ٤٩\n                                        \n                                        \n                                        \n                                        أي: { وَلَا تَتَّخِذُوا أَيْمَانَكُمْ } وعهودكم ومواثيقكم تبعا لأهوائكم متى شئتم وفيتم بها، ومتى شئتم نقضتموها، فإنكم إذا فعلتم ذلك تزل أقدامكم بعد ثبوتها على الصراط المستقيم، { وَتَذُوقُوا السُّوءَ } أي: العذاب الذي يسوءكم ويحزنكم { بِمَا صَدَدْتُمْ عَنْ سَبِيلِ اللَّهِ } حيث ضللتم وأضللتم غيركم { وَلَكُمْ عَذَابٌ عَظِيمٌ } مضاعف.\n                                    "
      },
      "originalText": "وَلَا تَتَّخِذُوٓاْ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُواْ ٱلسُّوٓءَ بِمَا صَدَدتُّمۡ عَن سَبِيلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِيمٞ ٤٩"
    },
    {
      "number": 1996,
      "text": "وَلَا تَشْتَرُوا بِعَهْدِ اللَّهِ ثَمَنًا قَلِيلًا ۚ إِنَّمَا عِنْدَ اللَّهِ هُوَ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 95,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَشۡتَرُواْ بِعَهۡدِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ ٥٩\n                                    \n                                    \n                                    ثم قال تعالى : ( ولا تشتروا بعهد الله ثمنا قليلا ) أي : لا تعتاضوا عن الإيمان بالله عرض الحياة الدنيا وزينتها ، فإنها قليلة ، ولو حيزت لابن آدم الدنيا بحذافيرها لكان ما عند الله هو خير له ، أي : جزاء الله وثوابه خير لمن رجاه وآمن به وطلبه ، وحفظ عهده رجاء موعوده ; ولهذا قال : ( إن كنتم تعلمون)\n                                    ",
        "qortoby": "وَلَا تَشۡتَرُواْ بِعَهۡدِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ ٥٩\n                                    \n                                    \n                                    قوله تعالى : ولا تشتروا بعهد الله ثمنا قليلا إنما عند الله هو خير لكم إن كنتم تعلمون\nقوله تعالى : ولا تشتروا بعهد الله ثمنا قليلا إنما عند الله هو خير لكم إن كنتم تعلمون نهى عن الرشا وأخذ الأموال على نقض العهد ; أي لا تنقضوا عهودكم لعرض قليل من الدنيا . وإنما كان قليلا وإن كثر لأنه مما يزول ، فهو على التحقيق قليل ، وقيل : إن هذه الآية ولا تشتروا نزلت في امرئ القيس بن عابس الكندي وخصمه ابن أسوع ، اختصما في أرض فأراد امرؤ القيس أن يحلف فلما سمع هذه الآية نكل وأقر له بحقه ; والله أعلم .\n                                    ",
        "saadi": "وَلَا تَشۡتَرُواْ بِعَهۡدِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ ٥٩\n                                        \n                                        \n                                        \n                                        يحذر تعالى عباده من نقض العهود والأيمان لأجل متاع الدنيا وحطامها فقال: { وَلَا تَشْتَرُوا بِعَهْدِ اللَّهِ ثَمَنًا قَلِيلًا } تنالونه بالنقض وعدم الوفاء { إِنَّمَا عِنْدَ اللَّهِ } من الثواب العاجل والآجل لمن آثر رضاه، وأوفى بما عاهد عليه الله { هُوَ خَيْرٌ لَكُمْ } من حطام الدنيا الزائلة { إِنْ كُنْتُمْ تَعْلَمُونَ }\n                                    "
      },
      "originalText": "وَلَا تَشۡتَرُواْ بِعَهۡدِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ ٥٩"
    },
    {
      "number": 1997,
      "text": "مَا عِنْدَكُمْ يَنْفَدُ ۖ وَمَا عِنْدَ اللَّهِ بَاقٍ ۗ وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُوا أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 96,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ ٦٩\n                                    \n                                    \n                                    ( ما عندكم ينفد ) أي : يفرغ وينقضي ، فإنه - إلى أجل - معدود محصور مقدر متناه . ( وما عند الله باق ) أي : وثوابه لكم في الجنة باق لا انقطاع ولا نفاد له فإنه دائم لا يحول ولا يزول ، ( ولنجزين الذين صبروا أجرهم بأحسن ما كانوا يعملون ) قسم من الرب - عز وجل متلقى باللام - أنه يجازي الصابرين بأحسن أعمالهم ، أي : ويتجاوز عن سيئها .\n                                    ",
        "qortoby": "مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ ٦٩\n                                    \n                                    \n                                    ما عندكم ينفد وما عند الله باق فبين الفرق بين حال الدنيا وحال الآخرة بأن هذه تنفد وتحول ، وما عند الله من مواهب فضله ونعيم جنته ثابت لا يزول لمن وفى بالعهد وثبت على العقد . ولقد أحسن من قال :\nالمال ينفد حله وحرامه يوما وتبقى في غد آثامه ليس التقي بمتق لإلهه\nحتى يطيب شرابه وطعامه\nآخر :\nهب الدنيا تساق إليك عفوا أليس مصير ذاك إلى انتقال\nوما دنياك إلا مثل فيء أظلك ثم آذن بالزوال\nقوله تعالى : ولنجزين الذين صبروا أي على الإسلام والطاعات وعن المعاصي .\nأجرهم بأحسن ما كانوا يعملون أي من الطاعات ، وجعلها أحسن لأن ما عداها من الحسن مباح ، والجزاء إنما يكون على الطاعات من حيث الوعد من الله . وقرأ عاصم وابن كثير ولنجزين بالنون على التعظيم . الباقون بالياء .\n                                    ",
        "saadi": "مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ ٦٩\n                                        \n                                        \n                                        \n                                        فآثروا ما يبقى على ما يفنى فإن الذي عندكم ولو كثر جدا لا بد أن { يَنْفَدُ } ويفنى، { وَمَا عِنْدَ اللَّهِ بَاقٍ } ببقائه لا يفنى ولا يزول، فليس بعاقل من آثر الفاني الخسيس على الباقي النفيس وهذا كقوله تعالى: { بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا وَالْآخِرَةُ خَيْرٌ وَأَبْقَى } { وَمَا عِنْدَ اللَّهِ خَيْرٌ لِلْأَبْرَارِ } وفي هذا الحث والترغيب على الزهد في الدنيا. خصوصا الزهد المتعين وهو الزهد فيما يكون ضررا على العبد ويوجب له الاشتغال عما أوجب الله عليه وتقديمه على حق الله فإن هذا الزهد واجب. \nومن الدواعي للزهد أن يقابل العبد لذات الدنيا وشهواتها بخيرات الآخرة، فإنه يجد من الفرق والتفاوت ما يدعوه إلى إيثار أعلى الأمرين [وليس الزهد الممدوح هو الانقطاع للعبادات القاصرة كالصلاة والصيام والذكر ونحوها، بل لا يكون العبد زاهدا زهدا صحيحا حتى يقوم بما يقدر عليه من الأوامر الشرعية الظاهرة والباطنة، ومن الدعوة إلى الله وإلى دينه بالقول والفعل، فالزهد الحقيقي هو الزهد فيما لا ينفع في الدين والدنيا، والرغبة والسعي في كل ما ينفع] { وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُوا } على طاعة الله، وعن معصيته، وفطموا نفوسهم عن الشهوات الدنيوية المضرة بدينهم { أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ } الحسنة بعشر أمثالها إلى سبعمائة ضعف إلى أضعاف كثيرة فإن الله لا يضيع أجر من أحسن عملا\n                                    "
      },
      "originalText": "مَا عِندَكُمۡ يَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقٖۗ وَلَنَجۡزِيَنَّ ٱلَّذِينَ صَبَرُوٓاْ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ ٦٩"
    },
    {
      "number": 1998,
      "text": "مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 97,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَلَنُحۡيِيَنَّهُۥ حَيَوٰةٗ طَيِّبَةٗۖ وَلَنَجۡزِيَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ ٧٩\n                                    \n                                    \n                                    هذا وعد من الله تعالى لمن عمل صالحا - وهو العمل المتابع لكتاب الله تعالى وسنة نبيه من ذكر أو أنثى من بني آدم ، وقلبه مؤمن بالله ورسوله ، وإن هذا العمل المأمور به مشروع من عند الله - بأن يحييه الله حياة طيبة في الدنيا وأن يجزيه بأحسن ما عمله في الدار الآخرة .\nوالحياة الطيبة تشمل وجوه الراحة من أي جهة كانت . وقد روي عن ابن عباس وجماعة أنهم فسروها بالرزق الحلال الطيب .\nوعن علي بن أبي طالب - رضي الله عنه - أنه فسرها بالقناعة . وكذا قال ابن عباس ، وعكرمة ، ووهب بن منبه .\nوقال علي بن أبي طلحة ، عن ابن عباس أنها السعادة .\nوقال الحسن ، ومجاهد ، وقتادة : لا يطيب لأحد حياة إلا في الجنة .\nوقال الضحاك : هي الرزق الحلال والعبادة في الدنيا ، وقال الضحاك أيضا : هي العمل بالطاعة والانشراح بها .\nوالصحيح أن الحياة الطيبة تشمل هذا كله كما جاء في الحديث الذي رواه الإمام أحمد : حدثنا عبد الله بن يزيد ، حدثنا سعيد بن أبي أيوب ، حدثني شرحبيل بن شريك ، عن أبي عبد الرحمن الحبلي ، عن عبد الله بن عمرو أن رسول الله - صلى الله عليه وسلم - قال : \" قد أفلح من أسلم ورزق كفافا ، وقنعه الله بما آتاه \" .\nورواه مسلم من حديث عبد الله بن يزيد المقرئ به\nوروى الترمذي والنسائي من حديث أبي هانئ ، عن أبي علي الجنبي عن فضالة بن عبيد أنه سمع رسول الله - صلى الله عليه وسلم - يقول : \" قد أفلح من هدي إلى الإسلام ، وكان عيشه كفافا ، وقنع به \" . وقال الترمذي : هذا حديث صحيح .\nوقال الإمام أحمد ، حدثنا يزيد ، حدثنا همام ، عن يحيى ، عن قتادة ، عن أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - : \" إن الله لا يظلم المؤمن حسنة يعطى بها في الدنيا [ ويثاب عليها في الآخرة ، وأما الكافر فيعطيه حسناته في الدنيا ] حتى إذا أفضى إلى الآخرة ، لم تكن له حسنة يعطى بها خيرا \" . انفرد بإخراجه مسلم .\n                                    ",
        "qortoby": "مَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَلَنُحۡيِيَنَّهُۥ حَيَوٰةٗ طَيِّبَةٗۖ وَلَنَجۡزِيَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ ٧٩\n                                    \n                                    \n                                    قوله تعالى : من عمل صالحا من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة ولنجزينهم أجرهم بأحسن ما كانوا يعملون قوله تعالى : من عمل صالحا من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة شرط وجوابه . وفي الحياة الطيبة خمسة أقوال [ الأول ] أنه الرزق الحلال ; قاله ابن عباس وسعيد بن جبير وعطاء والضحاك . [ الثاني ] القناعة ; قاله الحسن البصري وزيد بن وهب ووهب بن منبه ، ورواه الحكم عن عكرمة عن ابن عباس ، وهو قول علي بن أبي طالب - رضي الله عنه - . [ الثالث ] توفيقه إلى الطاعات فإنها تؤديه إلى رضوان الله ; قال معناه الضحاك . وقال أيضا : من عمل صالحا وهو مؤمن في فاقة وميسرة فحياته طيبة ، ومن أعرض عن ذكر الله ولم يؤمن بربه ولا عمل صالحا فمعيشته ضنك لا خير فيها . وقال مجاهد وقتادة وابن زيد : هي الجنة ، وقاله الحسن ، وقال : لا تطيب الحياة لأحد إلا في الجنة . وقيل هي السعادة ، روي عن ابن عباس أيضا . وقال أبو بكر الوراق : هي حلاوة الطاعة . وقال سهل بن عبد الله التستري : هي أن ينزع عن العبد تدبيره ويرد تدبيره إلى الحق . وقال جعفر الصادق : هي المعرفة بالله ، وصدق المقام بين يدي الله . وقيل : الاستغناء عن الخلق والافتقار إلى الحق . وقيل : الرضا بالقضاء . ولنجزينهم أجرهم أي في الآخرة . بأحسن ما كانوا يعملون وقال ( فلنحيينه ) ثم قال ( ولنجزينهم ) لأن ( من ) يصلح للواحد والجمع ، فأعاد مرة على اللفظ ومرة على المعنى . وقال أبو صالح : جلس ناس من أهل التوراة وناس من أهل الإنجيل وناس من أهل الأوثان ، فقال هؤلاء : نحن أفضل ، وقال هؤلاء : نحن أفضل ; فنزلت .\n                                    ",
        "saadi": "مَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَلَنُحۡيِيَنَّهُۥ حَيَوٰةٗ طَيِّبَةٗۖ وَلَنَجۡزِيَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ ٧٩\n                                        \n                                        \n                                        \n                                        { مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَى وَهُوَ مُؤْمِنٌ } فإن الإيمان شرط في صحة الأعمال الصالحة وقبولها، بل لا تسمى أعمالا صالحة إلا بالإيمان، والإيمان مقتض لها، فإنه التصديق الجازم المثمر لأعمال الجوارح من الواجبات والمستحبات، فمن جمع بين الإيمان والعمل الصالح { فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً } وذلك بطمأنينة قلبه، وسكون نفسه، وعدم التفاته لما يشوش عليه قلبه، ويرزقه الله رزقا حلالا طيبا من حيث لا يحتسب. { وَلَنَجْزِيَنَّهُمْ } في الآخرة { أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ } من أصناف اللذات مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر. فيؤتيه الله في الدنيا حسنة وفي الآخرة حسنة.\n                                    "
      },
      "originalText": "مَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَلَنُحۡيِيَنَّهُۥ حَيَوٰةٗ طَيِّبَةٗۖ وَلَنَجۡزِيَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُواْ يَعۡمَلُونَ ٧٩"
    },
    {
      "number": 1999,
      "text": "فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 98,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ٨٩\n                                    \n                                    \n                                    هذا أمر من الله تعالى لعباده على لسان نبيه - صلى الله عليه وسلم - : إذا أرادوا قراءة القرآن أن يستعيذوا بالله من الشيطان الرجيم . وهو أمر ندب ليس بواجب ، حكى الإجماع على ذلك الإمام أبو جعفر بن جرير وغيره من الأئمة . وقد قدمنا الأحاديث الواردة في الاستعاذة مبسوطة في أول التفسير ، ولله الحمد والمنة .\nوالمعنى في الاستعاذة عند ابتداء القراءة لئلا يلبس على القارئ قراءته ويخلط عليه ، ويمنعه من التدبر والتفكر ، ولهذا ذهب الجمهور إلى أن الاستعاذة إنما تكون قبل التلاوة وحكي عن حمزة وأبي حاتم السجستاني : أنها تكون بعد التلاوة ، واحتجا بهذه الآية . ونقل النووي في شرح المهذب مثل ذلك عن أبي هريرة أيضا ، ومحمد بن سيرين ، وإبراهيم النخعي ، والصحيح الأول ؛ لما تقدم من الأحاديث الدالة على تقدمها على التلاوة ، والله أعلم .\n                                    ",
        "qortoby": "فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ٨٩\n                                    \n                                    \n                                    قوله تعالى : فإذا قرأت القرآن فاستعذ بالله من الشيطان الرجيم فيه مسالة واحدة : وهي أن هذه الآية متصلة بقوله : ونزلنا عليك الكتاب تبيانا لكل شيء فإذا أخذت في قراءته فاستعذ بالله من أن يعرض لك الشيطان فيصدك عن تدبره والعمل بما فيه ; وليس يريد استعذ بعد القراءة ; بل هو كقولك : إذا أكلت فقل بسم الله ; أي إذا أردت أن تأكل . وقد روى جبير بن مطعم عن أبيه قال : سمعت رسول الله - صلى الله عليه وسلم - حين افتتح الصلاة قال اللهم إني أعوذ بك من الشيطان من همزه ونفخه ونفثه . وروى أبو سعيد الخدري أن النبي - صلى الله عليه وسلم - كان يتعوذ في صلاته قبل القراءة . قال ألكيا الطبري : ونقل عن بعض السلف التعوذ بعد القراءة مطلقا ، احتجاجا بقوله - تعالى - : فإذا قرأت القرآن فاستعذ بالله من الشيطان الرجيم ولا شك أن ظاهر ذلك يقتضي أن تكون الاستعاذة بعد القراءة ; كقوله - تعالى - : فإذا قضيتم الصلاة فاذكروا الله قياما وقعودا . إلا أن غيره محتمل ، مثل قوله - تعالى - : وإذا قلتم فاعدلوا وإذا سألتموهن متاعا فاسألوهن من وراء حجاب وليس المراد به أن يسألها من وراء حجاب بعد سؤال متقدم . ومثله قول القائل : إذا قلت فاصدق ، وإذا أحرمت فاغتسل ; يعني قبل الإحرام . والمعنى في جميع ذلك : إذا أردت ذلك ; فكذلك الاستعاذة . وقد تقدم هذا المعنى وتقدم القول في الاستعاذة مستوفى\n                                    ",
        "saadi": "فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ٨٩\n                                        \n                                        \n                                        \n                                        أي: فإذا أردت القراءة لكتاب الله الذي هو أشرف الكتب وأجلها وفيه صلاح القلوب والعلوم الكثيرة فإن الشيطان أحرص ما يكون على العبد عند شروعه في الأمور الفاضلة، فيسعى في صرفه عن مقاصدها ومعانيها.\nفالطريق إلى السلامة من شره الالتجاء إلى الله، والاستعاذة به من شره، فيقول القارئ: { أعوذ بالله من الشيطان الرجيم } متدبرا لمعناها، معتمدا بقلبه على الله في صرفه عنه، مجتهدا في دفع وساوسه وأفكاره الرديئة مجتهدا، على السبب الأقوى في دفعه، وهو التحلي بحلية الإيمان والتوكل.\n                                    "
      },
      "originalText": "فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ٨٩"
    },
    {
      "number": 2000,
      "text": "إِنَّهُ لَيْسَ لَهُ سُلْطَانٌ عَلَى الَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 99,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ ٩٩\n                                    \n                                    \n                                    وقوله : ( إنه ليس له سلطان على الذين آمنوا وعلى ربهم يتوكلون ) قال الثوري : ليس له عليهم سلطان أن يوقعهم في ذنب لا يتوبون منه .\nوقال آخرون : معناه لا حجة له عليهم . وقال آخرون : كقوله : ( إلا عبادك منهم المخلصين ) .\n                                    ",
        "qortoby": "إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ ٩٩\n                                    \n                                    \n                                    قوله تعالى : إنه ليس له سلطان على الذين آمنوا وعلى ربهم يتوكلون\nقوله تعالى : إنه ليس له سلطان على الذين آمنوا أي بالإغواء والكفر ، أي ليس لك قدرة على أن تحملهم على ذنب لا يغفر ; قاله سفيان . وقال مجاهد : لا حجة له على ما يدعوهم إليه من المعاصي . وقيل : إنه ليس عليهم سلطان بحال ; لأن الله - تعالى - صرف سلطانه عليهم حين قال عدو الله إبليس لعنه الله ولأغوينهم أجمعين إلا عبادك منهم المخلصين قال الله - تعالى - : إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين .\nقلت : قد بينا أن هذا عام يدخله التخصيص ، وقد أغوى آدم وحواء - عليهما السلام - بسلطانه ، وقد شوش على الفضلاء أوقاتهم بقوله : من خلق ربك ؟ . حسبما تقدم في آخر الأعراف بيانه\n                                    ",
        "saadi": "إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ ٩٩\n                                        \n                                        \n                                        \n                                        فإن الشيطان { لَيْسَ لَهُ سُلْطَانٌ } أي: تسلط { عَلَى الَّذِينَ آمَنُوا وَعَلَى رَبِّهِمْ } وحده لا شريك له { يَتَوَكَّلُونَ } فيدفع الله عن المؤمنين المتوكلين عليه شر الشيطان ولا يبق له عليهم سبيل.\n                                    "
      },
      "originalText": "إِنَّهُۥ لَيۡسَ لَهُۥ سُلۡطَٰنٌ عَلَى ٱلَّذِينَ ءَامَنُواْ وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ ٩٩"
    },
    {
      "number": 2001,
      "text": "إِنَّمَا سُلْطَانُهُ عَلَى الَّذِينَ يَتَوَلَّوْنَهُ وَالَّذِينَ هُمْ بِهِ مُشْرِكُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 100,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 236,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ ٠٠١\n                                    \n                                    \n                                    ( إنما سلطانه على الذين يتولونه ) قال مجاهد : يطيعونه .\nوقال آخرون : اتخذوه وليا من دون الله .\n( والذين هم به مشركون ) أي : أشركوا في عبادة الله تعالى . ويحتمل أن تكون الباء سببية ، أي : صاروا بسبب طاعتهم للشيطان مشركين بالله تعالى .\nوقال آخرون : معناه : أنه شركهم في الأموال والأولاد .\n                                    ",
        "qortoby": "إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ ٠٠١\n                                    \n                                    \n                                    إنما سلطانه على الذين يتولونه أي يطيعونه . يقال : توليته أي أطعته ، وتوليت عنه ، أي أعرضت عنه .\nوالذين هم به مشركون أي بالله ; قاله مجاهد والضحاك . وقيل : يرجع به إلى الشيطان ; قاله الربيع بن أنس والقتيبي . والمعنى : والذين هم من أجله مشركون . يقال : كفرت بهذه الكلمة ، أي من أجلها . وصار فلان بك عالما ، أي من أجلك . أي والذي تولى الشيطان مشركون بالله .\n                                    ",
        "saadi": "إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ ٠٠١\n                                        \n                                        \n                                        \n                                        { إِنَّمَا سُلْطَانُهُ } أي: تسلطه { عَلَى الَّذِينَ يَتَوَلَّوْنَهُ } أي: يجعلونه لهم وليا، وذلك بتخليهم عن ولاية الله، ودخولهم في طاعة الشيطان، وانضمامهم لحزبه، فهم الذين جعلوا له ولاية على أنفسهم، فأزَّهم إلى المعاصي أزًّا وقادهم إلى النار قَوْدًا.\n                                    "
      },
      "originalText": "إِنَّمَا سُلۡطَٰنُهُۥ عَلَى ٱلَّذِينَ يَتَوَلَّوۡنَهُۥ وَٱلَّذِينَ هُم بِهِۦ مُشۡرِكُونَ ٠٠١"
    },
    {
      "number": 2002,
      "text": "وَإِذَا بَدَّلْنَا آيَةً مَكَانَ آيَةٍ ۙ وَاللَّهُ أَعْلَمُ بِمَا يُنَزِّلُ قَالُوا إِنَّمَا أَنْتَ مُفْتَرٍ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 101,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 237,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ وَٱللَّهُ أَعۡلَمُ بِمَا يُنَزِّلُ قَالُوٓاْ إِنَّمَآ أَنتَ مُفۡتَرِۢۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ ١٠١\n                                    \n                                    \n                                    يخبر تعالى عن ضعف عقول المشركين وقلة ثباتهم وإيقانهم ، وأنه لا يتصور منهم الإيمان وقد كتب عليهم الشقاوة ، وذلك أنهم إذا رأوا تغيير الأحكام ناسخها بمنسوخها قالوا للرسول : ( إنما أنت مفتر ) أي : كذاب ، وإنما هو الرب تعالى يفعل ما يشاء ، ويحكم ما يريد .\nوقال مجاهد : ( بدلنا آية مكان آية ) أي : رفعناها وأثبتنا غيرها .\nوقال قتادة : هو كقوله تعالى : ( ما ننسخ من آية أو ننسها ) [ البقرة : 106 ] .\n                                    ",
        "qortoby": "وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ وَٱللَّهُ أَعۡلَمُ بِمَا يُنَزِّلُ قَالُوٓاْ إِنَّمَآ أَنتَ مُفۡتَرِۢۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ ١٠١\n                                    \n                                    \n                                    قوله تعالى : وإذا بدلنا آية مكان آية والله أعلم بما ينزل قالوا إنما أنت مفتر بل أكثرهم لا يعلمون\nقوله تعالى : وإذا بدلنا آية مكان آية والله أعلم بما ينزل قيل : المعنى بدلنا شريعة متقدمة بشريعة مستأنفة ; قاله ابن بحر . مجاهد : أي رفعنا آية وجعلنا موضعها غيرها . وقال الجمهور : نسخنا آية بآية أشد منها عليهم . والنسخ والتبديل رفع الشيء مع وضع غيره مكانه . وقد تقدم الكلام في النسخ في البقرة مستوفى\nقالوا يريد كفار قريش .\nإنما أنت مفتر أي كاذب مختلق ، وذلك لما رأوا من تبديل الحكم .\nبل أكثرهم لا يعلمون لا يعلمون أن الله شرع الأحكام وتبديل البعض بالبعض .\n                                    ",
        "saadi": "وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ وَٱللَّهُ أَعۡلَمُ بِمَا يُنَزِّلُ قَالُوٓاْ إِنَّمَآ أَنتَ مُفۡتَرِۢۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ ١٠١\n                                        \n                                        \n                                        \n                                        يذكر تعالى أن المكذبين بهذا القرآن يتتبعون ما يرونه حجة لهم، وهو أن الله تعالى هو الحاكم الحكيم، الذي يشرع الأحكام، ويبدل حكما مكان آخر لحكمته ورحمته، فإذا رأوه كذلك قدحوا في الرسول وبما جاء به و { قَالُوا إِنَّمَا أَنْتَ مُفْتَرٍ } قال الله تعالى: { بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ } فهم جهال لا علم لهم بربهم ولا بشرعه، ومن المعلوم أن قدح الجاهل بلا علم لا عبرة به، فإن القدح في الشيء فرع عن العلم به، وما يشتمل عليه مما يوجب المدح أو القدح.\n                                    "
      },
      "originalText": "وَإِذَا بَدَّلۡنَآ ءَايَةٗ مَّكَانَ ءَايَةٖ وَٱللَّهُ أَعۡلَمُ بِمَا يُنَزِّلُ قَالُوٓاْ إِنَّمَآ أَنتَ مُفۡتَرِۢۚ بَلۡ أَكۡثَرُهُمۡ لَا يَعۡلَمُونَ ١٠١"
    },
    {
      "number": 2003,
      "text": "قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ مِنْ رَبِّكَ بِالْحَقِّ لِيُثَبِّتَ الَّذِينَ آمَنُوا وَهُدًى وَبُشْرَىٰ لِلْمُسْلِمِينَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 102,
      "juz": 14,
      "manzil": 3,
      "page": 278,
      "ruku": 237,
      "hizbQuarter": 111,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ ٢٠١\n                                    \n                                    \n                                    فقال تعالى مجيبا لهم : ( قل نزله روح القدس ) أي : جبريل ، ( من ربك بالحق ) أي : بالصدق والعدل ، ( ليثبت الذين آمنوا ) فيصدقوا بما أنزل أولا وثانيا وتخبت له قلوبهم ، ( وهدى وبشرى للمسلمين ) أي : وجعله هاديا [ مهديا ] وبشارة للمسلمين الذين آمنوا بالله ورسله .\n                                    ",
        "qortoby": "قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ ٢٠١\n                                    \n                                    \n                                    قل نزله روح القدس يعني جبريل ، نزل بالقرآن كله ناسخه ومنسوخه . وروي بإسناد صحيح عن عامر الشعبي قال : وكل إسرافيل بمحمد - صلى الله عليه وسلم - ثلاث سنين ، فكان يأتيه بالكلمة والكلمة ، ثم نزل عليه جبريل بالقرآن . وفي صحيح مسلم أيضا أنه نزل عليه بسورة \" الحمد \" ملك لم ينزل إلى الأرض قط . كما تقدم في الفاتحة بيانه .\nمن ربك بالحق أي من كلام ربك .\nليثبت الذين آمنوا أي بما فيه من الحجج والآيات .\nوهدى أي وهو هدى وبشرى للمسلمين .\n                                    ",
        "saadi": "قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ ٢٠١\n                                        \n                                        \n                                        \n                                        { قُلْ نَزَّلَهُ رُوحُ الْقُدُسِ } وهو جبريل الرسول المقدس المنزه عن كل عيب وخيانة وآفة. \n{ بِالْحَقِّ } أي: نزوله بالحق وهو مشتمل على الحق في أخباره وأوامره ونواهيه، فلا سبيل لأحد أن يقدح فيه قدحا صحيحا، لأنه إذا علم أنه الحق علم أن ما عارضه وناقضه باطل. \n{ لِيُثَبِّتَ الَّذِينَ آمَنُوا } عند نزول آياته وتواردها عليهم وقتا بعد وقت، فلا يزال الحق يصل إلى قلوبهم شيئا فشيئا حتى يكون إيمانهم أثبت من الجبال الرواسي، وأيضا فإنهم يعلمون أنه الحق، وإذا شرع حكما [من الأحكام] ثم نسخه علموا أنه أبدله بما هو مثله أو خير منه لهم وأن نسخه هو المناسب للحكمة الربانية والمناسبة العقلية. \n{ وَهُدًى وَبُشْرَى لِلْمُسْلِمِينَ } أي: يهديهم إلى حقائق الأشياء ويبين لهم الحق من الباطل والهدى من الضلال، ويبشرهم أن لهم أجرا حسنا، ماكثين فيه أبدا. وأيضا فإنه كلما نزل شيئا فشيئا، كان أعظم هداية وبشارة لهم مما لو أتاهم جملة واحدة وتفرق الفكر فيه بل ينزل الله حكما وبشارة [أكثر] فإذا فهموه وعقلوه وعرفوا المراد منه وترووا منه أنزل نظيره وهكذا. ولذلك بلغ الصحابة رضي الله عنهم به مبلغا عظيما، وتغيرت أخلاقهم وطبائعهم، وانتقلوا إلى أخلاق وعوائد وأعمال فاقوا بها الأولين والآخرين. \nوكان أعلى وأولى لمن بعدهم أن يتربوا بعلومه ويتخلقوا بأخلاقه، ويستضيئوا بنوره في ظلمات الغي والجهالات ويجعلوه إمامهم في جميع الحالات، فبذلك تستقيم أمورهم الدينية والدنيوية.\n                                    "
      },
      "originalText": "قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ ٢٠١"
    }
  ]
}