{
  "number": 280,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 2012,
      "text": "۞ يَوْمَ تَأْتِي كُلُّ نَفْسٍ تُجَادِلُ عَنْ نَفْسِهَا وَتُوَفَّىٰ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُمْ لَا يُظْلَمُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 111,
      "juz": 14,
      "manzil": 3,
      "page": 280,
      "ruku": 238,
      "hizbQuarter": 112,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ يَوۡمَ تَأۡتِي كُلُّ نَفۡسٖ تُجَٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١١١\n                                    \n                                    \n                                    ( يوم تأتي كل نفس تجادل ) أي : تحاج ) عن نفسها ) ليس أحد يحاج عنها لا أب ولا ابن ولا أخ ولا زوجة ( وتوفى كل نفس ما عملت ) أي : من خير وشر ، ( وهم لا يظلمون ) أي : لا ينقص من ثواب الخير ولا يزاد على ثواب الشر ولا يظلمون نقيرا .\n                                    ",
        "qortoby": "۞ يَوۡمَ تَأۡتِي كُلُّ نَفۡسٖ تُجَٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١١١\n                                    \n                                    \n                                    قوله تعالى يوم تأتي كل نفس تجادل عن نفسها وتوفى كل نفس ما عملت وهم لا يظلمون قوله تعالى : يوم تأتي كل نفس تجادل عن نفسها أي تخاصم وتحاج عن نفسها ; جاء في الخبر أن كل أحد يقول يوم القيامة : نفسي نفسي ! من شدة هول يوم القيامة سوى محمد - صلى الله عليه وسلم - فإنه يسأل في أمته . وفي حديث عمر أنه قال لكعب الأحبار : يا كعب ، خوفنا هيجنا حدثنا نبهنا . فقال له كعب : يا أمير المؤمنين ، والذي نفسي بيده لو وافيت يوم القيامة بمثل عمل سبعين نبيا لأتت عليك تارات لا يهمك إلا نفسك ، وإن لجهنم زفرة لا يبقى ملك مقرب ولا نبي منتخب إلا وقع جاثيا على ركبتيه ، حتى إن إبراهيم الخليل ليدلي بالخلة فيقول : يا رب ، أنا خليلك إبراهيم ، لا أسألك اليوم إلا نفسي ! قال : يا كعب ، أين تجد ذلك في كتاب الله ؟ قال : قوله - تعالى - : يوم تأتي كل نفس تجادل عن نفسها وتوفى كل نفس ما عملت وهم لا يظلمون . وقال ابن عباس في هذه الآية : ما تزال الخصومة بالناس يوم القيامة حتى تخاصم الروح الجسد ; فتقول الروح : رب ، الروح منك أنت خلقته ، لم تكن لي يد أبطش بها ، ولا رجل أمشي بها ، ولا عين أبصر بها ، ولا أذن أسمع بها ولا عقل أعقل به ، حتى جئت فدخلت في هذا الجسد ، فضعف عليه أنواع العذاب ونجني ; فيقول الجسد : رب ، أنت خلقتني بيدك فكنت كالخشبة ، ليس لي يد أبطش بها ، ولا قدم أسعى به ، ولا بصر أبصر به ، ولا سمع أسمع به ، فجاء هذا كشعاع النور ، فبه نطق لساني ، وبه أبصرت عيني ، وبه مشت رجلي ، وبه سمعت أذني ، فضعف عليه أنواع العذاب ونجني منه . قال : فيضرب الله لهما مثلا أعمى ومقعدا دخلا بستانا فيه ثمار ، فالأعمى لا يبصر الثمرة والمقعد لا ينالها ، فنادى المقعد الأعمى ايتني فاحملني آكل وأطعمك ، فدنا منه فحمله ، فأصابوا من الثمرة ; فعلى من يكون العذاب ؟ قال : عليكما جميعا العذاب ; ذكره الثعلبي .\n                                    ",
        "saadi": "۞ يَوۡمَ تَأۡتِي كُلُّ نَفۡسٖ تُجَٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١١١\n                                        \n                                        \n                                        \n                                        في يوم القيامة حين { تَأْتِي كُلُّ نَفْسٍ تُجَادِلُ عَنْ نَفْسِهَا } كلٌّ يقول نفسي نفسي لا يهمه سوى نفسه، ففي ذلك اليوم يفتقر العبد إلى حصول مثقال ذرة من الخير.\n{ وَتُوَفَّى كُلُّ نَفْسٍ مَا عَمِلَتْ } من خير وشر { وَهُمْ لَا يُظْلَمُونَ } فلا يزاد في سيئاتهم ولا ينقص من حسناتهم { فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنْتُمْ تَعْمَلُونَ }\n                                    "
      },
      "originalText": "۞ يَوۡمَ تَأۡتِي كُلُّ نَفۡسٖ تُجَٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١١١"
    },
    {
      "number": 2013,
      "text": "وَضَرَبَ اللَّهُ مَثَلًا قَرْيَةً كَانَتْ آمِنَةً مُطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا رَغَدًا مِنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِأَنْعُمِ اللَّهِ فَأَذَاقَهَا اللَّهُ لِبَاسَ الْجُوعِ وَالْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 112,
      "juz": 14,
      "manzil": 3,
      "page": 280,
      "ruku": 238,
      "hizbQuarter": 112,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَضَرَبَ ٱللَّهُ مَثَلٗا قَرۡيَةٗ كَانَتۡ ءَامِنَةٗ مُّطۡمَئِنَّةٗ يَأۡتِيهَا رِزۡقُهَا رَغَدٗا مِّن كُلِّ مَكَانٖ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُواْ يَصۡنَعُونَ ٢١١\n                                    \n                                    \n                                    هذا مثل أريد به أهل مكة فإنها كانت أمنة مطمئنة مستقره يتخطف الناس من حولها ومن دخلها كان آمنا لا يخاف كما قال تعالى \"وقالوا إن نتبع الهدى معك نتخطف من أرضنا أولم نمكن لهم حرما آمنا يجبى إليه ثمرات كل شيء رزقا من لدنا\" وهكذا قال ههنا \"يأتيها رزقها رغدا\" أي هنيئا سهلا \"من كل مكان فكفرت بأنعم الله\" أي جحدت آلاء الله عليها وأعظمها بعثة محمد صلى الله عليه وسلم إليهم كما قال تعالى \"ألم تر إلى الذين بدلوا نعمة الله كفرا وأحلوا قومهم دار البوار جهنم يصلونها وبئس القرار\" ولهذا بدلهم الله بحاليهم الأولين خلافهما فقال \"فأذاقها الله لباس الجوع والخوف\" أي ألبسها وأذاقها الجوع بعد أن كان يجبى إليهم ثمرات كل شيء ويأتيها رزقها رغدا من كل مكان وذلك أنهم استعصوا على رسول الله صلى الله عليه وسلم وأبوا إلا خلافه فدعا عليهم بسبع كسبع يوسف فأصابتهم سنة أذهبت كل شيء لهم فأكلوا العلهز وهو وبر البعير يخلط بدمه إذا نحروه وقوله والخوف وذلك أنهم بدلوا بأمنهم خوفا من رسول الله صلى الله عليه وسلم وأصحابه حين هاجروا إلى المدينة من سطوته وسراياه وجيوشه.\n                                    ",
        "qortoby": "وَضَرَبَ ٱللَّهُ مَثَلٗا قَرۡيَةٗ كَانَتۡ ءَامِنَةٗ مُّطۡمَئِنَّةٗ يَأۡتِيهَا رِزۡقُهَا رَغَدٗا مِّن كُلِّ مَكَانٖ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُواْ يَصۡنَعُونَ ٢١١\n                                    \n                                    \n                                    قوله تعالى : وضرب الله مثلا قرية كانت آمنة مطمئنة يأتيها رزقها رغدا من كل مكان فكفرت بأنعم الله فأذاقها الله لباس الجوع والخوف بما كانوا يصنعون\nقوله تعالى : وضرب الله مثلا قرية هذا متصل بذكر المشركين . وكان رسول الله - صلى الله عليه وسلم - دعا على مشركي قريش وقال : اللهم اشدد وطأتك على مضر واجعلها عليهم سنين كسني يوسف . فابتلوا بالقحط حتى أكلوا العظام ، ووجه إليهم رسول الله - صلى الله عليه وسلم - طعاما ففرق فيهم .\nكانت آمنة لا يهاج أهلها .\nمطمئنة يأتيها رزقها رغدا من كل مكان من البر والبحر ; نظيره يجبى إليه ثمرات كل شيء الآية .\nفكفرت بأنعم الله الأنعم : جمع النعمة ; كالأشد جمع الشدة . وقيل : جمع نعمى ; مثل بؤسى وأبؤس . وهذا الكفران تكذيب بمحمد - صلى الله عليه وسلم - .\nفأذاقها الله أي أذاق أهلها .\nلباس الجوع والخوف سماه لباسا لأنه يظهر عليهم من الهزال وشحوبة اللون وسوء الحال ما هو كاللباس . بما كانوا يصنعون أي من الكفر والمعاصي .\nوقرأه حفص بن غياث ونصر بن عاصم وابن أبي إسحاق والحسن وأبو عمرو فيما روى عنه عبد الوارث وعبيد وعباس والخوف نصبا بإيقاع \" أذاقها \" عليه ، عطفا على لباس الجوع وأذاقها الخوف . وهو بعث النبي - صلى الله عليه وسلم - سراياه التي كانت تطيف بهم . وأصل الذوق بالفم ثم يستعار فيوضع موضع الابتلاء .\nوضرب مكة مثلا لغيرها من البلاد ; أي أنها مع جوار بيت الله وعمارة مسجده لما كفر أهلها أصابهم القحط فكيف بغيرها من القرى . وقد قيل : إنها المدينة ، آمنت برسول الله - صلى الله عليه وسلم - ، ثم كفرت بأنعم الله لقتل عثمان بن عفان ، وما حدث بها بعد رسول الله - صلى الله عليه وسلم - من الفتن . وهذا قول عائشة وحفصة زوجي النبي - صلى الله عليه وسلم - . وقيل : إنه مثل مضروب بأي قرية كانت على هذه الصفة من سائر القرى .\n                                    ",
        "saadi": "وَضَرَبَ ٱللَّهُ مَثَلٗا قَرۡيَةٗ كَانَتۡ ءَامِنَةٗ مُّطۡمَئِنَّةٗ يَأۡتِيهَا رِزۡقُهَا رَغَدٗا مِّن كُلِّ مَكَانٖ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُواْ يَصۡنَعُونَ ٢١١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 112 و 113 :ـ\nوهذه القرية هي مكة المشرفة التي كانت آمنة مطمئنة لا يهاج فيها أحد، وتحترمها الجاهلية الجهلاء حتى إن أحدهم يجد قاتل أبيه وأخيه، فلا يهيجه مع شدة الحمية فيهم، والنعرة العربية فحصل لها من الأمن التام ما لم يحصل لسواها وكذلك الرزق الواسع.\nكانت بلدة ليس فيها زرع ولا شجر، ولكن يسر الله لها الرزق يأتيها من كل مكان، فجاءهم رسول منهم يعرفون أمانته وصدقه، يدعوهم إلى أكمل الأمور، وينهاهم عن الأمور السيئة، فكذبوه وكفروا بنعمة الله عليهم، فأذاقهم الله ضد ما كانوا فيه، وألبسهم لباس الجوع الذي هو ضد الرغد، والخوف الذي هو ضد الأمن، وذلك بسبب صنيعهم وكفرهم وعدم شكرهم { وما ظلمهم الله ولكن كانوا أنفسهم يظلمون }\n                                    "
      },
      "originalText": "وَضَرَبَ ٱللَّهُ مَثَلٗا قَرۡيَةٗ كَانَتۡ ءَامِنَةٗ مُّطۡمَئِنَّةٗ يَأۡتِيهَا رِزۡقُهَا رَغَدٗا مِّن كُلِّ مَكَانٖ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُواْ يَصۡنَعُونَ ٢١١"
    },
    {
      "number": 2014,
      "text": "وَلَقَدْ جَاءَهُمْ رَسُولٌ مِنْهُمْ فَكَذَّبُوهُ فَأَخَذَهُمُ الْعَذَابُ وَهُمْ ظَالِمُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 113,
      "juz": 14,
      "manzil": 3,
      "page": 280,
      "ruku": 238,
      "hizbQuarter": 112,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ جَآءَهُمۡ رَسُولٞ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَٰلِمُونَ ٣١١\n                                    \n                                    \n                                    وجعلوا كل ما لهم في سفال ودمار ، حتى فتحها الله عليهم وذلك بسبب صنيعهم وبغيهم وتكذيبهم الرسول الذي بعثه الله فيهم منهم ، وامتن به عليهم في قوله : ( لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم ) [ آل عمران : 164 ] وقال تعالى : ( فاتقوا الله يا أولي الألباب الذين آمنوا قد أنزل الله إليكم ذكرا رسولا [ يتلو عليكم آيات الله مبينات ليخرج الذين آمنوا وعملوا الصالحات من الظلمات إلى النور ] ) [ الطلاق : 10 ، 11 ] الآية . وقوله : ( كما أرسلنا فيكم رسولا منكم يتلو عليكم آياتنا ويزكيكم ويعلمكم الكتاب والحكمة ) إلى قوله : ( ولا تكفرون ) [ البقرة : 151 ، 152 ] .\nوكما أنه انعكس على الكافرين حالهم فخافوا بعد الأمن ، وجاعوا بعد الرغد ، بدل الله المؤمنين من بعد خوفهم أمنا ، ورزقهم بعد العيلة ، وجعلهم أمراء الناس وحكامهم ، وسادتهم وقادتهم وأئمتهم .\nوهذا الذي قلناه - من أن هذا المثل مضروب لمكة - قاله العوفي ، عن ابن عباس . وإليه ذهب مجاهد ، وقتادة ، وعبد الرحمن بن زيد بن أسلم . وحكاه مالك عن الزهري رحمهم الله .\nوقال ابن جرير : حدثني ابن عبد الرحيم البرقي ، حدثنا ابن أبي مريم ، حدثنا نافع بن زيد ، حدثنا عبد الرحمن بن شريح ، أن عبد الكريم بن الحارث الحضرمي حدثه أنه سمع مشرح بن هاعان يقول : سمعت سليم بن عتر يقول : صدرنا من الحج مع حفصة زوج النبي - صلى الله عليه وسلم - وعثمان - رضي الله عنه - محصور ب المدينة ، فكانت تسأل عنه : ما فعل ؟ حتى رأت راكبين ، فأرسلت إليهما تسألهما ، فقالا قتل . فقالت حفصة : والذي نفسي بيده إنها القرية التي قال الله : ( وضرب الله مثلا قرية كانت آمنة مطمئنة يأتيها رزقها رغدا من كل مكان فكفرت بأنعم الله ) قال أبو شريح : وأخبرني عبيد الله بن المغيرة ، عمن حدثه : أنه كان يقول : إنها المدينة .\n                                    ",
        "qortoby": "وَلَقَدۡ جَآءَهُمۡ رَسُولٞ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَٰلِمُونَ ٣١١\n                                    \n                                    \n                                    قوله تعالى : ولقد جاءهم رسول منهم فكذبوه فأخذهم العذاب وهم ظالمون قوله تعالى : ولقد جاءهم رسول منهم فكذبوه هذا يدل على أنها مكة . وهو قول ابن عباس ومجاهد وقتادة .\nفأخذهم العذاب وهو الجوع الذي وقع بمكة . وقيل : الشدائد والجوع منها .\n                                    ",
        "saadi": "وَلَقَدۡ جَآءَهُمۡ رَسُولٞ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَٰلِمُونَ ٣١١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 112 و 113 :ـ\nوهذه القرية هي مكة المشرفة التي كانت آمنة مطمئنة لا يهاج فيها أحد، وتحترمها الجاهلية الجهلاء حتى إن أحدهم يجد قاتل أبيه وأخيه، فلا يهيجه مع شدة الحمية فيهم، والنعرة العربية فحصل لها من الأمن التام ما لم يحصل لسواها وكذلك الرزق الواسع.\nكانت بلدة ليس فيها زرع ولا شجر، ولكن يسر الله لها الرزق يأتيها من كل مكان، فجاءهم رسول منهم يعرفون أمانته وصدقه، يدعوهم إلى أكمل الأمور، وينهاهم عن الأمور السيئة، فكذبوه وكفروا بنعمة الله عليهم، فأذاقهم الله ضد ما كانوا فيه، وألبسهم لباس الجوع الذي هو ضد الرغد، والخوف الذي هو ضد الأمن، وذلك بسبب صنيعهم وكفرهم وعدم شكرهم { وما ظلمهم الله ولكن كانوا أنفسهم يظلمون }\n                                    "
      },
      "originalText": "وَلَقَدۡ جَآءَهُمۡ رَسُولٞ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَٰلِمُونَ ٣١١"
    },
    {
      "number": 2015,
      "text": "فَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلَالًا طَيِّبًا وَاشْكُرُوا نِعْمَتَ اللَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 114,
      "juz": 14,
      "manzil": 3,
      "page": 280,
      "ruku": 238,
      "hizbQuarter": 112,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗا وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٤١١\n                                    \n                                    \n                                    يقول تعالى آمرا عباده المؤمنين بأكل رزقه الحلال الطيب وبشكره على ذلك فإنه المنعم المتفضل به ابتداء الذي يستحق العبادة وحده لا شريك له.\n                                    ",
        "qortoby": "فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗا وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٤١١\n                                    \n                                    \n                                    قوله تعالى : فكلوا مما رزقكم الله حلالا طيبا واشكروا نعمة الله إن كنتم إياه تعبدون قوله تعالى : فكلوا مما رزقكم الله أي كلوا يا معشر المسلمين من الغنائم . وقيل : الخطاب للمشركين ; لأن النبي - صلى الله عليه وسلم - بعث إليهم بطعام رقة عليهم ، وذلك أنهم لما ابتلوا بالجوع سبع سنين ، وقطع العرب عنهم الميرة بأمر النبي - صلى الله عليه وسلم - أكلوا العظام المحرقة والجيفة والكلاب الميتة والجلود والعلهز ، وهو الوبر يعالج بالدم . ثم إن رؤساء مكة كلموا رسول الله - صلى الله عليه وسلم - حين جهدوا وقالوا : هذا عذاب الرجال فما بال النساء والصبيان . وقال له أبو سفيان : يا محمد ، إنك جئت تأمر بصلة الرحم والعفو ، وإن قومك قد هلكوا ; فادع الله لهم . فدعا لهم رسول الله - صلى الله عليه وسلم - ، وأذن للناس بحمل الطعام إليهم وهم بعد مشركون .\n                                    ",
        "saadi": "فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗا وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٤١١\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده بأكل ما رزقهم الله من الحيوانات والحبوب والثمار وغيرها. { حَلَالًا طَيِّبًا } أي: حالة كونها متصفة بهذين الوصفين بحيث لا تكون مما حرم الله أو أثرا عن غصب ونحوه. فتمتعوا بما خلق الله لكم من غير إسراف ولا تَعَدٍّ. { وَاشْكُرُوا نِعْمَةَ اللَّهِ } بالاعتراف بها بالقلب والثناء على الله بها وصرفها في طاعة الله. { إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ } أي إن كنتم مخلصين له العبادة، فلا تشكروا إلا إياه، ولا تنسوا المنعم.\n                                    "
      },
      "originalText": "فَكُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَٰلٗا طَيِّبٗا وَٱشۡكُرُواْ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ ٤١١"
    },
    {
      "number": 2016,
      "text": "إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ ۖ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلَا عَادٍ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 115,
      "juz": 14,
      "manzil": 3,
      "page": 280,
      "ruku": 238,
      "hizbQuarter": 112,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٥١١\n                                    \n                                    \n                                    ثم ذكر ما حرمه عليهم مما فيه مضرة لهم في دينهم ودنياهم من الميتة والدم ولحم الخنزير .\n( وما أهل لغير الله به ) أي : ذبح على غير اسم الله ، ومع هذا ( فمن اضطر ) أي : احتاج في غير بغي ولا عدوان ، ( فإن الله غفور رحيم )\nوقد تقدم الكلام على مثل هذه الآية في سورة \" البقرة \" بما فيه كفاية عن إعادته ، ولله الحمد [ والمنة ] .\n                                    ",
        "qortoby": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٥١١\n                                    \n                                    \n                                    قوله تعالى : إنما حرم عليكم الميتة والدم ولحم الخنزير وما أهل لغير الله به فمن اضطر غير باغ ولا عاد فإن الله غفور رحيم تقدم في ( البقرة ) القول فيها مستوفي .\n                                    ",
        "saadi": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٥١١\n                                        \n                                        \n                                        \n                                        { إِنَّمَا حَرَّمَ عَلَيْكُمُ } الأشياء المضرة تنزيها لكم، وذلك: كـ { الْمَيْتَةَ } ويدخل في ذلك كل ما كان موته على غير ذكاة مشروعة، ويستثنى من ذلك ميتة الجراد والسمك.\n{ والدم } المسفوح وأما ما يبقى في العروق واللحم فلا يضر.\n{ وَلَحْمَ الْخِنْزِيرِ } لقذارته وخبثه وذلك شامل للحمه وشحمه وجميع أجزائه. { وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ } كالذي يذبح للأصنام والقبور ونحوها لأنه مقصود به الشرك.\n{ فَمَنِ اضْطُرَّ } إلى شيء من المحرمات -بأن حملته الضرورة وخاف إن لم يأكل أن يهلك- فلا جناح عليه إذا لم يكن باغيا أو عاديا، أي: إذا لم يرد أكل المحرم وهو غير مضطر، ولا متعد الحلال إلى الحرام، أو متجاوز لما زاد على قدر الضرورة، فهذا الذي حرمه الله من المباحات.\n                                    "
      },
      "originalText": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ ٥١١"
    },
    {
      "number": 2017,
      "text": "وَلَا تَقُولُوا لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هَٰذَا حَلَالٌ وَهَٰذَا حَرَامٌ لِتَفْتَرُوا عَلَى اللَّهِ الْكَذِبَ ۚ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لَا يُفْلِحُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 116,
      "juz": 14,
      "manzil": 3,
      "page": 280,
      "ruku": 238,
      "hizbQuarter": 112,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَٰذَا حَلَٰلٞ وَهَٰذَا حَرَامٞ لِّتَفۡتَرُواْ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ ٦١١\n                                    \n                                    \n                                    ثم نهى تعالى عن سلوك سبيل المشركين ، الذين حللوا وحرموا بمجرد ما وضعوه واصطلحوا عليه من الأسماء بآرائهم ، من البحيرة والسائبة والوصيلة والحام ، وغير ذلك مما كان شرعا لهم ابتدعوه في جاهليتهم ، فقال : ( ولا تقولوا لما تصف ألسنتكم الكذب هذا حلال وهذا حرام لتفتروا على الله الكذب ) ويدخل في هذا كل من ابتدع بدعة ليس [ له ] فيها مستند شرعي ، أو حلل شيئا مما حرم الله ، أو حرم شيئا مما أباح الله بمجرد رأيه وتشهيه .\nو \" ما \" في قوله : ( لما ) مصدرية ، أي : ولا تقولوا الكذب لوصف ألسنتكم .\n                                    ",
        "qortoby": "وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَٰذَا حَلَٰلٞ وَهَٰذَا حَرَامٞ لِّتَفۡتَرُواْ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ ٦١١\n                                    \n                                    \n                                    قوله تعالى : ولا تقولوا لما تصف ألسنتكم الكذب هذا حلال وهذا حرام لتفتروا على الله الكذب إن الذين يفترون على الله الكذب لا يفلحون\nفيه مسألتان :\nالأولى : قوله تعالى : لما تصف ما هنا مصدرية ، أي لوصف . وقيل : اللام لام سبب وأجل ، أي لا تقول لأجل وصفكم الكذب بنزع الخافض ، أي لما تصف ألسنتكم من الكذب . وقرئ الكذب بضم الكاف والذال والباء ، نعتا للألسنة . وقد تقدم وقرأ الحسن هنا خاصة الكذب بفتح الكاف وخفض الذال والباء ، نعتا \" لما \" ; التقدير : ولا تقولوا لوصف ألسنتكم الكذب . وقيل على البدل من ما ; أي ولا تقولوا للكذب الذي تصفه ألسنتكم هذا حلال وهذا حرام لتفتروا على الله الكذب . الآية خطاب للكفار الذين حرموا البحائر والسوائب وأحلوا ما في بطون الأنعام وإن كان ميتة .\nهذا حلال إشارة إلى ميتة بطون الأنعام ، وكل ما أحلوه .\nوهذا حرام إشارة إلى البحائر والسوائب وكل ما حرموه .\nإن الذين يفترون على الله الكذب لا يفلحون\nالثانية : أسند الدارمي أبو محمد في مسنده أخبرنا هارون عن حفص عن الأعمش قال : ما سمعت إبراهيم قط يقول حلال ولا حرام ، ولكن كان يقول : كانوا يكرهون وكانوا يستحبون . وقال ابن وهب قال مالك : لم يكن من فتيا الناس أن يقولوا هذا حلال وهذا حرام ، ولكن يقولوا إياكم كذا وكذا ، ولم أكن لأصنع هذا . ومعنى هذا : أن التحليل والتحريم إنما هو لله - عز وجل - ، وليس لأحد أن يقول أو يصرح بهذا في عين من الأعيان ، إلا أن يكون البارئ - تعالى - يخبر بذلك عنه . وما يؤدي إليه الاجتهاد في أنه حرام يقول : إني أكره كذا . وكذلك كان مالك يفعل اقتداء بمن تقدم من أهل الفتوى . فإن قيل : فقد قال فيمن قال لزوجته أنت علي حرام إنها حرام ويكون ثلاثا . فالجواب أن مالكا لما سمع علي بن أبي طالب يقول إنها حرام اقتدى به . وقد يقوى الدليل على التحريم عند المجتهد فلا بأس عند ذلك أن يقول ذلك ، كما يقول إن الربا حرام في غير الأعيان الستة ، وكثيرا ما يطلق مالك - رحمه الله - ; فذلك حرام لا يصلح في الأموال الربوية وفيما خالف المصالح وخرج عن طريق المقاصد لقوة الأدلة في ذلك .\n                                    ",
        "saadi": "وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَٰذَا حَلَٰلٞ وَهَٰذَا حَرَامٞ لِّتَفۡتَرُواْ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ ٦١١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 116 و 117 :ـ\n{ وَلَا تَقُولُوا لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هَذَا حَلَالٌ وَهَذَا حَرَامٌ } أي: لا تحرموا وتحللوا من تلقاء أنفسكم، كذبا وافتراء على الله وتقولا عليه.\n{ لِتَفْتَرُوا عَلَى اللَّهِ الْكَذِبَ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لَا يُفْلِحُونَ } لا في الدنيا ولا في الآخرة، ولا بد أن يظهر الله خزيهم وإن تمتعوا في الدنيا فإنه { مَتَاعٌ قَلِيلٌ } ومصيرهم إلى النار { وَلَهُمْ عَذَابٌ أَلِيمٌ }\n                                    "
      },
      "originalText": "وَلَا تَقُولُواْ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَٰذَا حَلَٰلٞ وَهَٰذَا حَرَامٞ لِّتَفۡتَرُواْ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ ٦١١"
    },
    {
      "number": 2018,
      "text": "مَتَاعٌ قَلِيلٌ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 117,
      "juz": 14,
      "manzil": 3,
      "page": 280,
      "ruku": 238,
      "hizbQuarter": 112,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَتَٰعٞ قَلِيلٞ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٧١١\n                                    \n                                    \n                                    أما في الدنيا فمتاع قليل وأما في الآخرة فلهم عذاب أليم كما قال \"نمتعهم قليلا ثم نضطرهم إلى عذاب غليظ\" وقال \"إن الذين يفترون على الله الكذب لا يفلحون متاع في الدنيا ثم إلينا مرجعهم ثم نذيقهم العذاب الشديد بما كانوا يكفرون\".\n                                    ",
        "qortoby": "مَتَٰعٞ قَلِيلٞ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٧١١\n                                    \n                                    \n                                    متاع قليل أي ما هم فيه من نعيم الدنيا يزول عن قريب . وقال الزجاج : أي متاعهم متاع قليل . وقيل : لهم متاع قليل ثم يردون إلى عذاب أليم .\n                                    ",
        "saadi": "مَتَٰعٞ قَلِيلٞ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٧١١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 116 و 117 :ـ\n{ وَلَا تَقُولُوا لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هَذَا حَلَالٌ وَهَذَا حَرَامٌ } أي: لا تحرموا وتحللوا من تلقاء أنفسكم، كذبا وافتراء على الله وتقولا عليه.\n{ لِتَفْتَرُوا عَلَى اللَّهِ الْكَذِبَ إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لَا يُفْلِحُونَ } لا في الدنيا ولا في الآخرة، ولا بد أن يظهر الله خزيهم وإن تمتعوا في الدنيا فإنه { مَتَاعٌ قَلِيلٌ } ومصيرهم إلى النار { وَلَهُمْ عَذَابٌ أَلِيمٌ }\n                                    "
      },
      "originalText": "مَتَٰعٞ قَلِيلٞ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٧١١"
    },
    {
      "number": 2019,
      "text": "وَعَلَى الَّذِينَ هَادُوا حَرَّمْنَا مَا قَصَصْنَا عَلَيْكَ مِنْ قَبْلُ ۖ وَمَا ظَلَمْنَاهُمْ وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ",
      "surah": {
        "number": 16,
        "name": "سورة النحل",
        "englishName": "An-Nahl",
        "englishNameTranslation": "The Bee",
        "revelationType": "Meccan",
        "numberOfAyahs": 128
      },
      "numberInSurah": 118,
      "juz": 14,
      "manzil": 3,
      "page": 280,
      "ruku": 238,
      "hizbQuarter": 112,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٨١١\n                                    \n                                    \n                                    لما ذكر تعالى أنه إنما حرم علينا الميتة والدم ولحم الخنزير ، وما أهل لغير الله به ، وأنه أرخص فيه عند الضرورة - وفي ذلك توسعة لهذه الأمة التي يريد الله بها اليسر ولا يريد بها العسر - ذكر سبحانه وتعالى ما كان حرمه على اليهود في شريعتهم قبل أن ينسخها ، وما كانوا فيه من الآصار والأغلال والحرج والتضييق ، فقال : ( وعلى الذين هادوا حرمنا ما قصصنا عليك من قبل ) يعني : في \" سورة الأنعام \" في قوله : ( وعلى الذين هادوا حرمنا كل ذي ظفر ومن البقر والغنم حرمنا عليهم شحومهما إلا ما حملت ظهورهما [ أو الحوايا أو ما اختلط بعظم ذلك جزيناهم ببغيهم وإنا لصادقون ] ) [ الأنعام : 146 ] ; ولهذا قال هاهنا : ( وما ظلمناهم ) أي : فيما ضيقنا عليهم ، ( ولكن كانوا أنفسهم يظلمون ) أي : فاستحقوا ذلك ، كما قال : ( فبظلم من الذين هادوا حرمنا عليهم طيبات أحلت لهم وبصدهم عن سبيل الله كثيرا ) [ النساء : 160 ] .\n                                    ",
        "qortoby": "وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٨١١\n                                    \n                                    \n                                    قوله تعالى : وعلى الذين هادوا حرمنا ما قصصنا عليك من قبل وما ظلمناهم ولكن كانوا أنفسهم يظلمون قوله تعالى : وعلى الذين هادوا بين أن الأنعام والحرث حلال لهذه الأمة ، فأما اليهود فحرمت عليهم منها أشياء .\nمن قبل أي في سورة الأنعام .\nوما ظلمناهم أي بتحريم ما حرمنا عليهم ، ولكن ظلموا أنفسهم فحرمنا عليهم تلك الأشياء عقوبة لهم . كما تقدم في النساء\n                                    ",
        "saadi": "وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٨١١\n                                        \n                                        \n                                        \n                                        فالله تعالى ما حرم علينا إلا الخبيثات تفضلا منه، وصيانة عن كل مستقذر.\nوأما الذين هادوا فحرم الله عليهم طيبات أحلت لهم بسبب ظلمهم عقوبة لهم، كما قصه في سورة الأنعام في قوله: { وَعَلَى الَّذِينَ هَادُوا حَرَّمْنَا كُلَّ ذِي ظُفُرٍ وَمِنَ الْبَقَرِ وَالْغَنَمِ حَرَّمْنَا عَلَيْهِمْ شُحُومَهُمَا إِلَّا مَا حَمَلَتْ ظُهُورُهُمَا أَوِ الْحَوَايَا أَوْ مَا اخْتَلَطَ بِعَظْمٍ ذَلِكَ جَزَيْنَاهُمْ بِبَغْيِهِمْ وَإِنَّا لَصَادِقُونَ }\n                                    "
      },
      "originalText": "وَعَلَى ٱلَّذِينَ هَادُواْ حَرَّمۡنَا مَا قَصَصۡنَا عَلَيۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَٰهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٨١١"
    }
  ]
}