{
  "number": 284,
  "ayahsNumber": 10,
  "ayahs": [
    {
      "number": 2047,
      "text": "مَنْ كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاءُ لِمَنْ نُرِيدُ ثُمَّ جَعَلْنَا لَهُ جَهَنَّمَ يَصْلَاهَا مَذْمُومًا مَدْحُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 18,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 241,
      "hizbQuarter": 113,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا ٨١\n                                    \n                                    \n                                    يخبر تعالى أنه ما كل من طلب الدنيا وما فيها من النعيم يحصل له ، بل إنما يحصل لمن أراد الله ما يشاء .\nوهذه مقيدة لإطلاق ما سواها من الآيات فإنه قال : ( عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها ) أي : في الآخرة ) يصلاها ) أي : يدخلها حتى تغمره من جميع جوانبه ) مذموما ) أي : في حال كونه مذموما على سوء تصرفه وصنيعه ؛ إذ اختار الفاني على الباقي ) مدحورا ) : مبعدا مقصيا حقيرا ذليلا مهانا .\nقال الإمام أحمد : حدثنا حسين ، حدثنا دويد ، عن أبي إسحاق ، عن زرعة ، عن عائشة ، رضي الله عنها ، قالت : قال رسول الله صلى الله عليه وسلم : \" الدنيا دار من لا دار له ، ومال من لا مال له ، ولها يجمع من لا عقل له \" .\n                                    ",
        "qortoby": "مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا ٨١\n                                    \n                                    \n                                    قوله : من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها مذموما مدحورا\nقوله تعالى : من كان يريد العاجلة يعني الدنيا ، والمراد الدار العاجلة ; فعبر بالنعت عن المنعوت .\nعجلنا له فيها ما نشاء لمن نريد أي لم نعطه منها إلا ما نشاء ثم نؤاخذه بعمله ، وعاقبته دخول النار .\nمذموما مدحورا أي مطردا مبعدا من رحمة الله . وهذه صفة المنافقين الفاسقين ، والمرائين المداجين ، يلبسون الإسلام والطاعة لينالوا عاجل الدنيا من الغنائم وغيرها ، فلا يقبل ذلك العمل منهم في الآخرة ولا يعطون في الدنيا إلا ما قسم لهم . وقد تقدم في [ هود ] أن هذه الآية تقيد الآيات المطلقة ; فتأمله .\n                                    ",
        "saadi": "مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا ٨١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أن { مَنْ كَانَ يُرِيدُ } الدنيا { العاجلة } المنقضية الزائلة فعمل لها وسعى، ونسي المبتدأ أو المنتهى أن الله يعجل له من حطامها ومتاعها ما يشاؤه ويريده مما كتب [الله] له في اللوح المحفوظ ولكنه متاع غير نافع ولا دائم له.\nثم يجعل له في الآخرة { جَهَنَّمَ يَصْلَاهَا } أي: يباشر عذابها { مَذْمُومًا مَدْحُورًا } أي: في حالة الخزي والفضيحة والذم من الله ومن خلقه، والبعد عن رحمة الله فيجمع له بين العذاب والفضيحة.\n                                    "
      },
      "originalText": "مَّن كَانَ يُرِيدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ يَصۡلَىٰهَا مَذۡمُومٗا مَّدۡحُورٗا ٨١"
    },
    {
      "number": 2048,
      "text": "وَمَنْ أَرَادَ الْآخِرَةَ وَسَعَىٰ لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَأُولَٰئِكَ كَانَ سَعْيُهُمْ مَشْكُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 19,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 241,
      "hizbQuarter": 113,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا ٩١\n                                    \n                                    \n                                    وقوله : ( ومن أراد الآخرة ) أي : أراد الدار الآخرة وما فيها من النعيم والسرور ( وسعى لها سعيها ) أي : طلب ذلك من طريقه وهو متابعة الرسول ) وهو مؤمن ) أي : وقلبه مؤمن ، أي : مصدق بالثواب والجزاء ( فأولئك كان سعيهم مشكورا )\n                                    ",
        "qortoby": "وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا ٩١\n                                    \n                                    \n                                    ومن أراد الآخرة أي الدار الآخرة .\nوسعى لها سعيها أي عمل لها عملها من الطاعات .\nوهو مؤمن لأن الطاعات لا تقبل إلا من مؤمن .\nفأولئك كان سعيهم مشكورا أي مقبولا غير مردود . وقيل : مضاعفا ; أي تضاعف لهم الحسنات إلى عشر ، وإلى سبعين وإلى سبعمائة ضعف ، وإلى أضعاف كثيرة ; كما روي عن أبي هريرة وقد قيل له : أسمعت رسول الله - صلى الله عليه وسلم - يقول : إن الله ليجزي على الحسنة الواحدة ألف ألف حسنة ؟ فقال سمعته يقول : إن الله ليجزي على الحسنة الواحدة ألفي ألف حسنة .\n                                    ",
        "saadi": "وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا ٩١\n                                        \n                                        \n                                        \n                                        { وَمَنْ أَرَادَ الْآخِرَةَ } فرضيها وآثرها على الدنيا { وَسَعَى لَهَا سَعْيَهَا } الذي دعت إليه الكتب السماوية والآثار النبوية فعمل بذلك على قدر إمكانه { وَهُوَ مُؤْمِنٌ } بالله وملائكته وكتبه ورسله واليوم الآخر.\n{ فَأُولَئِكَ كَانَ سَعْيُهُمْ مَشْكُورًا } أي: مقبولا منمى مدخرا لهم أجرهم وثوابهم عند ربهم.\n                                    "
      },
      "originalText": "وَمَنۡ أَرَادَ ٱلۡأٓخِرَةَ وَسَعَىٰ لَهَا سَعۡيَهَا وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ كَانَ سَعۡيُهُم مَّشۡكُورٗا ٩١"
    },
    {
      "number": 2049,
      "text": "كُلًّا نُمِدُّ هَٰؤُلَاءِ وَهَٰؤُلَاءِ مِنْ عَطَاءِ رَبِّكَ ۚ وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 20,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 241,
      "hizbQuarter": 113,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا ٠٢\n                                    \n                                    \n                                    يقول تعالى : ( كلا ) أي كل واحد من الفريقين الذين أرادوا الدنيا والذين أرادوا الآخرة نمدهم فيما هم فيه ( من عطاء ربك ) أي هو المتصرف الحاكم الذي لا يجور فيعطي كلا ما يستحقه من الشقاوة والسعادة ولا راد لحكمه ولا مانع لما أعطى ولا مغير لما أراد ولهذا قال : ( وما كان عطاء ربك محظورا ) أي ممنوعا ، أي لا يمنعه أحد ولا يرده راد\nقال قتادة ( وما كان عطاء ربك محظورا ) أي منقوصا\nوقال الحسن وابن جريج وابن زيد ممنوعا\n                                    ",
        "qortoby": "كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا ٠٢\n                                    \n                                    \n                                    قوله : كلا نمد هؤلاء وهؤلاء من عطاء ربك وما كان عطاء ربك محظورا انظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا لا تجعل مع الله إلها آخر فتقعد مذموما مخذولا\nقوله تعالى : كلا نمد هؤلاء وهؤلاء من عطاء ربك أعلم أنه يرزق المؤمنين والكافرين .\nوما كان عطاء ربك محظورا أي محبوسا ممنوعا ; من حظر يحظر حظرا وحظارا .\n                                    ",
        "saadi": "كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا ٠٢\n                                        \n                                        \n                                        \n                                        ومع هذا فلا يفوتهم نصيبهم من الدنيا فكلا يمده الله منها لأنه عطاؤه وإحسانه.\n{ وَمَا كَانَ عَطَاءُ رَبِّكَ مَحْظُورًا } أي: ممنوعا من أحد بل جميع الخلق راتعون بفضله وإحسانه.\n                                    "
      },
      "originalText": "كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِنۡ عَطَآءِ رَبِّكَۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحۡظُورًا ٠٢"
    },
    {
      "number": 2050,
      "text": "انْظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۚ وَلَلْآخِرَةُ أَكْبَرُ دَرَجَاتٍ وَأَكْبَرُ تَفْضِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 21,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 241,
      "hizbQuarter": 113,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا ١٢\n                                    \n                                    \n                                    ثم قال تعالى ( انظر كيف فضلنا بعضهم على بعض ) في الدنيا فمنهم الغني والفقير وبين ذلك والحسن والقبيح وبين ذلك ومن يموت صغيرا ، ومن يعمر حتى يبقى شيخا كبيرا وبين ذلك ( وللآخرة أكبر درجات وأكبر تفضيلا ) أي ولتفاوتهم في الدار الآخرة أكبر من الدنيا فإن منهم من يكون في الدركات في جهنم وسلاسلها وأغلالها ومنهم من يكون في الدرجات العلى ونعيمها وسرورها ثم أهل الدركات يتفاوتون فيما هم فيه كما أن أهل الدرجات يتفاوتون فإن الجنة مائة درجة ما بين كل درجتين كما بين السماء والأرض وفي الصحيحين إن أهل الدرجات العلى ليرون أهل عليين كما ترون الكوكب الغابر في أفق السماء \" ولهذا قال تعالى : ( وللآخرة أكبر درجات وأكبر تفضيلا ) ] .\n                                    ",
        "qortoby": "ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا ١٢\n                                    \n                                    \n                                    ثم قال تعالى : انظر كيف فضلنا بعضهم على بعض في الرزق والعمل ; فمن مقل ومكثر .\nوللآخرة أكبر درجات وأكبر تفضيلا أي للمؤمنين ; فالكافر وإن وسع عليه في الدنيا مرة ، وقتر على المؤمن مرة فالآخرة لا تقسم إلا مرة واحدة بأعمالهم ; فمن فاته شيء منها لم يستدركه فيها .\n                                    ",
        "saadi": "ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا ١٢\n                                        \n                                        \n                                        \n                                        { انْظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ } في الدنيا بسعة الأرزاق وقلتها، واليسر والعسر والعلم والجهل والعقل والسفه وغير ذلك من الأمور التي فضل الله العباد بعضهم على بعض بها.\n{ وَلَلْآخِرَةُ أَكْبَرُ دَرَجَاتٍ وَأَكْبَرُ تَفْضِيلًا } فلا نسبة لنعيم الدنيا ولذاتها إلى الآخرة بوجه من الوجوه.\nفكم بين من هو في الغرف العاليات واللذات المتنوعات والسرور والخيرات والأفراح ممن هو يتقلب في الجحيم ويعذب بالعذاب الأليم، وقد حل عليه سخط الرب الرحيم وكل من الدارين بين أهلها من التفاوت ما لا يمكن أحدا عده.\n                                    "
      },
      "originalText": "ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۚ وَلَلۡأٓخِرَةُ أَكۡبَرُ دَرَجَٰتٖ وَأَكۡبَرُ تَفۡضِيلٗا ١٢"
    },
    {
      "number": 2051,
      "text": "لَا تَجْعَلْ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَتَقْعُدَ مَذْمُومًا مَخْذُولًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 22,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 241,
      "hizbQuarter": 113,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا ٢٢\n                                    \n                                    \n                                    يقول تعالى والمراد المكلفون من الأمة لا تجعل أيها المكلف في عبادتك ربك له شريكا ( فتقعد مذموما ) على إشراكك ( مخذولا ) لأن الرب تعالى لا ينصرك بل يكلك إلى الذي عبدت معه وهو لا يملك لك ضرا ولا نفعا لأن مالك الضر والنفع هو الله وحده لا شريك له وقد قال الإمام أحمد\nحدثنا أبو أحمد الزبيري حدثنا بشير بن سلمان عن سيار أبي الحكم عن طارق بن شهاب عن عبد الله هو ابن مسعود قال قال رسول الله صلى الله عليه وسلم من أصابته فاقة فأنزلها بالناس لم تسد فاقته ومن أنزلها بالله أوشك الله له بالغنى إما أجل [ عاجل وإما غنى عاجل\nورواه أبو داود والترمذي من حديث بشير بن سلمان به ، وقال الترمذي حسن صحيح غريب\n                                    ",
        "qortoby": "لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا ٢٢\n                                    \n                                    \n                                    وقوله : لا تجعل مع الله إلها آخر الخطاب للنبي - صلى الله عليه وسلم - والمراد أمته . وقيل : الخطاب للإنسان .\nفتقعد أي تبقى .\nمذموما مخذولا لا ناصر لك ولا وليا .\n                                    ",
        "saadi": "لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا ٢٢\n                                        \n                                        \n                                        \n                                        أي: لا تعتقد أن أحدا من المخلوقين يستحق شيئا من العبادة ولا تشرك بالله أحدا منهم فإن ذلك داع للذم والخذلان، فالله وملائكته ورسله قد نهوا عن الشرك وذموا من عمله أشد الذم ورتبوا عليه من الأسماء المذمومة، والأوصاف المقبوحة ما كان به متعاطيه، أشنع الخلق وصفا وأقبحهم نعتا.\nوله من الخذلان في أمر دينه ودنياه بحسب ما تركه من التعلق بربه، فمن تعلق بغيره فهو مخذول قد وكل إلى من تعلق به ولا أحد من الخلق ينفع أحدا إلا بإذن الله، كما أن من جعل مع الله إلها آخر له الذم والخذلان، فمن وحده وأخلص دينه لله وتعلق به دون غيره فإنه محمود معان في جميع أحواله.\n                                    "
      },
      "originalText": "لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومٗا مَّخۡذُولٗا ٢٢"
    },
    {
      "number": 2052,
      "text": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا ۚ إِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلَاهُمَا فَلَا تَقُلْ لَهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُلْ لَهُمَا قَوْلًا كَرِيمًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 23,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 242,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا ٣٢\n                                    \n                                    \n                                    يقول تعالى آمرا بعبادته وحده لا شريك له فإن القضاء هاهنا بمعنى الأمر\nقال مجاهد ( وقضى ) يعني وصى وكذا قرأ أبي بن كعب وعبد الله بن مسعود والضحاك بن مزاحم ووصى ربك ألا تعبدوا إلا إياه ولهذا قرن بعبادته بر الوالدين فقال ( وبالوالدين إحسانا ) أي وأمر بالوالدين إحسانا كما قال في الآية الأخرى ( أن اشكر لي ولوالديك إلي المصير ) [ لقمان 14 .\nوقوله ( إما يبلغن عندك الكبر أحدهما أو كلاهما فلا تقل لهما أف ) أي لا تسمعهما قولا سيئا حتى ولا التأفيف الذي هو أدنى مراتب القول السيئ ( ولا تنهرهما ) أي ولا يصدر منك إليهما فعل قبيح كما قال عطاء بن أبي رباح في قوله : ( ولا تنهرهما ) أي لا تنفض يدك على والديك\nولما نهاه عن القول القبيح والفعل القبيح أمره بالقول الحسن والفعل الحسن فقال ( وقل لهما قولا كريما ) أي لينا طيبا حسنا بتأدب وتوقير وتعظيم\n                                    ",
        "qortoby": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا ٣٢\n                                    \n                                    \n                                    قوله تعالى : وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا إما يبلغن عندك الكبر أحدهما أو كلاهما فلا تقل لهما أف ولا تنهرهما وقل لهما قولا كريما\nفيه ثلاث عشرة مسألة :\nالأولى : وقضى أي أمر وألزم وأوجب . قال ابن عباس والحسن وقتادة : وليس هذا قضاء حكم بل هو قضاء أمر . وفي مصحف ابن مسعود \" ووصى \" وهي قراءة أصحابه وقراءة ابن عباس أيضا وعلي وغيرهما ، وكذلك عند أبي بن كعب . قال ابن عباس : إنما هو \" ووصى ربك \" فالتصقت إحدى الواوين فقرئت وقضى ربك إذ لو كان على القضاء ما عصى الله أحد . وقال الضحاك : تصحفت على قوم \" وصى بقضى \" حين اختلطت الواو بالصاد وقت كتب المصحف . وذكر أبو حاتم عن ابن عباس مثل قول الضحاك . وقال عن ميمون بن مهران أنه قال : إن على قول ابن عباس لنورا ; قال الله - تعالى - : شرع لكم من الدين ما وصى به نوحا والذي أوحينا إليك ثم أبى أبو حاتم أن يكون ابن عباس قال ذلك . وقال : لو قلنا هذا لطعن الزنادقة في مصحفنا ، ثم قال علماؤنا المتكلمون وغيرهم : القضاء يستعمل في اللغة على وجوه : فالقضاء بمعنى الأمر ; كقوله - تعالى - : وقضى ربك ألا تعبدوا إلا إياه معناه أمر . والقضاء بمعنى الخلق ; كقوله : فقضاهن سبع سماوات في يومين يعني خلقهن . والقضاء بمعنى الحكم ; كقوله - تعالى - : فاقض ما أنت قاض يعني احكم ما أنت تحكم . والقضاء بمعنى الفراغ ; كقوله : قضي الأمر الذي فيه تستفتيان أي فرغ منه ; ومنه قوله - تعالى - فإذا قضيتم مناسككم . وقوله - تعالى - : فإذا قضيت الصلاة . والقضاء بمعنى الإرادة ; كقوله - تعالى - : إذا قضى أمرا فإنما يقول له كن فيكون . والقضاء بمعنى العهد ; كقوله - تعالى - : وما كنت بجانب الغربي إذ قضينا إلى موسى الأمر . فإذا كان القضاء يحتمل هذه المعاني فلا يجوز إطلاق القول بأن المعاصي بقضاء الله ; لأنه إن أريد به الأمر فلا خلاف أنه لا يجوز ذلك ، لأن الله - تعالى - لم يأمر بها ، فإنه لا يأمر بالفحشاء . وقال زكريا بن سلام : جاء رجل إلى الحسن فقال إنه طلق امرأته ثلاثا . فقال : إنك قد عصيت ربك وبانت منك . فقال الرجل : قضى الله ذلك علي فقال الحسن وكان فصيحا : ما قضى الله ذلك أي ما أمر الله به ، وقرأ هذه الآية : وقضى ربك ألا تعبدوا إلا إياه .\nالثانية : أمر الله سبحانه بعبادته وتوحيده ، وجعل بر الوالدين مقرونا بذلك ، كما قرن شكرهما بشكره فقال : وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا . وقال : أن اشكر لي ولوالديك إلي المصير . وفي صحيح البخاري عن عبد الله قال : سألت النبي - صلى الله عليه وسلم - أي العمل أحب إلى الله - عز وجل - ؟ قال : الصلاة على وقتها قال : ثم أي ؟ قال : ثم بر الوالدين قال ثم أي ؟ قال : الجهاد في سبيل الله فأخبر - صلى الله عليه وسلم - أن بر الوالدين أفضل الأعمال بعد الصلاة التي هي أعظم دعائم الإسلام . ورتب ذلك ( بثم ) التي تعطي الترتيب والمهلة .\nالثالثة : من البر بهما والإحسان إليهما ألا يتعرض لسبهما ولا يعقهما ; فإن ذلك من الكبائر بلا خلاف ، وبذلك وردت السنة الثابتة ; ففي صحيح مسلم عن عبد الله بن عمرو أن رسول الله - صلى الله عليه وسلم - قال : إن من الكبائر شتم الرجل والديه قالوا : يا رسول الله ، وهل يشتم الرجل والديه ؟ قال نعم . يسب الرجل أبا الرجل فيسب أباه ويسب أمه فيسب أمه .\nالرابعة : عقوق الوالدين مخالفتهما في أغراضهما الجائزة لهما ; كما أن برهما موافقتهما على أغراضهما . وعلى هذا إذا أمرا أو أحدهما ولدهما بأمر وجبت طاعتهما فيه ، إذا لم يكن ذلك الأمر معصية ، وإن كان ذلك المأمور به من قبيل المباح في أصله ، وكذلك إذا كان من قبيل المندوب . وقد ذهب بعض الناس إلى أن أمرهما بالمباح يصيره في حق الولد مندوبا إليه وأمرهما بالمندوب يزيده تأكيدا في ندبيته .\nالخامسة : روى الترمذي عن ابن عمر قال : كانت تحتي امرأة أحبها ، وكان أبي يكرهها فأمرني أن أطلقها فأبيت ، فذكرت ذلك للنبي - صلى الله عليه وسلم - فقال : يا عبد الله بن عمر طلق امرأتك . قال هذا حديث حسن صحيح .\nالسادسة : روى الصحيح عن أبي هريرة قال : جاء رجل إلى النبي - صلى الله عليه وسلم - فقال : من أحق الناس بحسن صحابتي ؟ قال : أمك قال : ثم من ؟ قال : ثم أمك قال : ثم من ؟ قال : ثم أمك قال : ثم من ؟ قال : ثم أبوك . فهذا الحديث يدل على أن محبة الأم والشفقة عليها ينبغي أن تكون ثلاثة أمثال محبة الأب ; لذكر النبي - صلى الله عليه وسلم - الأم ثلاث مرات وذكر الأب في الرابعة فقط . وإذا توصل هذا المعنى شهد له العيان . وذلك أن صعوبة الحمل وصعوبة الوضع وصعوبة الرضاع والتربية تنفرد بها الأم دون الأب ; فهذه ثلاث منازل يخلو منها الأب . وروي عن مالك أن رجلا قال له : إن أبي في بلد السودان ، وقد كتب إلي أن أقدم عليه ، وأمي تمنعني من ذلك ; فقال : أطع أباك ، ولا تعص أمك . فدل قول مالك هذا أن برهما متساو عنده . وقد سئل الليث عن هذه المسألة فأمره بطاعة الأم ; وزعم أن لها ثلثي البر . وحديث أبي هريرة يدل على أن لها ثلاثة أرباع البر ; وهو الحجة على من خالف . وقد زعم المحاسبي في ( كتاب الرعاية ) له أنه لا خلاف بين العلماء أن للأم ثلاثة أرباع البر وللأب الربع ; على مقتضى حديث أبي هريرة - رضي الله عنه - . والله أعلم .\nالسابعة : لا يختص بر الوالدين بأن يكونا مسلمين ، بل إن كانا كافرين يبرهما ويحسن إليهما إذا كان لهما عهد ; قال الله - تعالى - : لا ينهاكم الله عن الذين لم يقاتلوكم في الدين ولم يخرجوكم من دياركم أن تبروهم . وفي صحيح البخاري عن أسماء قالت : قدمت أمي وهي مشركة في عهد قريش ومدتهم إذ عاهدوا النبي - صلى الله عليه وسلم - مع أبيها ، فاستفتيت النبي - صلى الله عليه وسلم - فقلت : إن أمي قدمت وهي راغبة أفأصلها ؟ قال : نعم صلي أمك . وروي أيضا عن أسماء قالت : أتتني أمي راغبة في عهد النبي - صلى الله عليه وسلم - فسألت النبي - صلى الله عليه وسلم - أأصلها ؟ قال : نعم . قال ابن عيينة : فأنزل الله - عز وجل - فيها : لا ينهاكم الله عن الذين لم يقاتلوكم في الدين الأول معلق والثاني مسند .\nالثامنة : من الإحسان إليهما والبر بهما إذا لم يتعين الجهاد ألا يجاهد إلا بإذنهما . روى الصحيح عن عبد الله بن عمرو قال : جاء رجل إلى النبي - صلى الله عليه وسلم - يستأذنه في الجهاد فقال : أحي والداك ؟ قال نعم . قال : ففيهما فجاهد . لفظ مسلم . في غير الصحيح قال : نعم ; وتركتهما يبكيان . قال : اذهب فأضحكهما كما أبكيتهما . وفي خبر آخر أنه قال : نومك مع أبويك على فراشهما يضاحكانك ويلاعبانك أفضل لك من الجهاد معي . ذكره ابن خويز منداد . ولفظ البخاري في كتاب بر الوالدين : أخبرنا أبو نعيم أخبرنا سفيان عن عطاء بن السائب عن أبيه عن عبد الله بن عمرو قال : جاء رجل إلى النبي - صلى الله عليه وسلم - يبايعه على الهجرة ، وترك أبويه يبكيان فقال : ارجع إليهما فأضحكهما كما أبكيتهما . قال ابن المنذر : في هذا الحديث النهي عن الخروج بغير إذن الأبوين ما لم يقع النفير ; فإذا وقع وجب الخروج على الجميع . وذلك بين في حديث أبي قتادة أن رسول الله - صلى الله عليه وسلم - بعث جيش الأمراء . . . ; فذكر قصة زيد بن حارثة وجعفر بن أبي طالب وابن رواحة وأن منادي رسول الله - صلى الله عليه وسلم - نادى بعد ذلك : أن الصلاة جامعة ; فاجتمع الناس فحمد الله وأثنى عليه ثم قال : أيها الناس ، اخرجوا فأمدوا إخوانكم ولا يتخلفن أحد فخرج الناس مشاة وركبانا في حر شديد . فدل قوله : اخرجوا فأمدوا إخوانكم أن العذر في التخلف عن الجهاد إنما هو ما لم يقع النفير ; مع قوله - عليه السلام - : فإذا استنفرتم فانفروا .\nقلت : وفي هذه الأحاديث دليل على أن المفروض أو المندوبات متى اجتمعت قدم الأهم منها . وقد استوفى هذا المعنى المحاسبي في كتاب الرعاية .\nالتاسعة : واختلفوا في الوالدين المشركين هل يخرج بإذنهما إذا كان الجهاد من فروض الكفاية ; فكان الثوري يقول : لا يغزو إلا بإذنهما . وقال الشافعي : له أن يغزو بغير إذنهما . قال ابن المنذر : والأجداد آباء ، والجدات أمهات فلا يغزو المرء إلا بإذنهم ، ولا أعلم دلالة توجب ذلك لغيرهم من الأخوة وسائر القرابات . وكان طاوس يرى السعي على الأخوات أفضل من الجهاد في سبيل الله - عز وجل - .\nالعاشرة : من تمام برهما صلة أهل ودهما ; ففي الصحيح عن ابن عمر قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : إن من أبر البر صلة الرجل أهل ود أبيه بعد أن يولي . وروى أبو أسيد وكان بدريا قال : كنت مع النبي - صلى الله عليه وسلم - جالسا فجاءه رجل من الأنصار فقال : يا رسول الله ، هل بقي من بر والدي من بعد موتهما شيء أبرهما به ؟ قال : نعم . الصلاة عليهما والاستغفار لهما وإنفاذ عهدهما بعدهما وإكرام صديقهما وصلة الرحم التي لا رحم لك إلا من قبلهما فهذا الذي بقي عليك . وكان - صلى الله عليه وسلم - يهدي لصدائق خديجة برا بها ووفاء لها وهي زوجته ، فما ظنك بالوالدين .\nالحادية عشرة : قوله تعالى : إما يبلغن عندك الكبر أحدهما أو كلاهما خص حالة الكبر لأنها الحالة التي يحتاجان فيها إلى بره لتغير الحال عليهما بالضعف والكبر ; فألزم في هذه الحالة من مراعاة أحوالهما أكثر مما ألزمه من قبل ، لأنهما في هذه الحالة قد صارا كلا عليه ، فيحتاجان أن يلي منهما في الكبر ما كان يحتاج في صغره أن يليا منه ; فلذلك خص هذه الحالة بالذكر . وأيضا فطول المكث للمرء يوجب الاستثقال للمرء عادة ويحصل الملل ويكثر الضجر فيظهر غضبه على أبويه وتنتفخ لهما أوداجه ، ويستطيل عليهما بدالة البنوة وقلة الديانة ، وأقل المكروه ما يظهره بتنفسه المتردد من الضجر . وقد أمر أن يقابلهما بالقول الموصوف بالكرامة ، وهو السالم عن كل عيب فقال : فلا تقل لهما أف ولا تنهرهما وقل لهما قولا كريما . روى مسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : رغم أنفه رغم أنفه رغم أنفه قيل : من يا رسول الله ؟ قال : من أدرك والديه عند الكبر أحدهما أو كليهما ثم لم يدخل الجنة . وقال البخاري في كتاب الوالدين : حدثنا مسدد حدثنا بشر بن المفضل حدثنا عبد الرحمن بن إسحاق عن أبي سعيد المقبري عن أبي هريرة عن النبي - صلى الله عليه وسلم - قال : رغم أنف رجل ذكرت عنده فلم يصل علي . رغم أنف رجل أدرك أبويه عند الكبر أو أحدهما فلم يدخلاه الجنة . ورغم أنف رجل دخل عليه رمضان ثم انسلخ قبل أن يغفر له . حدثنا ابن أبي أويس حدثني أخي عن سليمان بن بلال عن محمد بن هلال عن سعد بن إسحاق بن كعب بن عجرة السالمي عن أبيه - رضي الله عنه - قال : إن كعب بن عجرة - رضي الله عنه - قال : قال النبي - صلى الله عليه وسلم - : أحضروا المنبر فلما خرج رقي إلى المنبر ، فرقي في أول درجة منه قال آمين ثم رقي في الثانية فقال آمين ثم لما رقي في الثالثة قال آمين ، فلما فرغ ونزل من المنبر قلنا : يا رسول الله ، لقد سمعنا منك اليوم شيئا ما كنا نسمعه منك ؟ قال : وسمعتموه ؟ قلنا نعم . قال : إن جبريل - عليه السلام - اعترض قال : بعد من أدرك رمضان فلم يغفر له فقلت آمين فلما رقيت في الثانية قال بعد من ذكرت عنده فلم يصل عليك فقلت آمين فلما رقيت في الثالثة قال بعد من أدرك عنده أبواه الكبر أو أحدهما فلم يدخلاه الجنة قلت آمين . حدثنا أبو نعيم حدثنا سلمة بن وردان سمعت أنسا - رضي الله عنه - يقول : ارتقى رسول الله - صلى الله عليه وسلم - على المنبر درجة فقال آمين ثم ارتقى درجة فقال آمين ثم ارتقى الدرجة الثالثة فقال آمين ، ثم استوى وجلس فقال أصحابه : يا رسول الله ، علام أمنت ؟ قال : أتاني جبريل - عليه السلام - فقال رغم أنف من ذكرت عنده فلم يصل عليك فقلت آمين ورغم أنف من أدرك أبويه أو أحدهما فلم يدخل الجنة فقلت آمين الحديث . فالسعيد الذي يبادر اغتنام فرصة برهما لئلا تفوته بموتهما فيندم على ذلك . والشقي من عقهما ، لا سيما من بلغه الأمر ببرهما .\nالثانية عشرة : قوله تعالى : فلا تقل لهما أف أي لا تقل لهما ما يكون فيه أدنى تبرم . وعن أبي رجاء العطاردي قال : الأف الكلام القذع الرديء الخفي . وقال مجاهد : معناه إذا رأيت منهما في حال الشيخ الغائط والبول الذي رأياه منك في الصغر فلا تقذرهما وتقول أف . والآية أعم من هذا . والأف والتف وسخ الأظفار . ويقال لكل ما يضجر ويستثقل : أف له . قال الأزهري : والتف أيضا الشيء الحقير . وقرئ أف منون مخفوض ; كما تخفض الأصوات وتنون ، تقول : صه ومه . وفيه عشر لغات : أف ، وأف ، وأف ، وأفا وأف ، وأف وأفه ، وإف لك ( بكسر الهمزة ) ، وأف ( بضم الهمزة وتسكين الفاء ) ، وأفا ( مخففة الفاء ) . وفي الحديث : فألقى طرف ثوبه على أنفه ثم قال أف أف . قال أبو بكر : معناه استقذار لما شم . وقال بعضهم : معنى أف الاحتقار والاستقلال ; أخذ من الأفف وهو القليل . وقال القتبي : أصله نفخك الشيء يسقط عليك من رماد وتراب وغير ذلك ، وللمكان تريد إماطة شيء لتقعد فيه ; فقيلت هذه الكلمة لكل مستثقل . وقال أبو عمرو بن العلاء : الأف وسخ بين الأظفار ، والتف قلامتها . وقال الزجاج : معنى أف النتن . وقال الأصمعي : الأف وسخ الأذن ، والتف وسخ الأظفار ; فكثر استعماله حتى ذكر في كل ما يتأذى به . وروي من حديث علي بن أبي طالب - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : لو علم الله من العقوق شيئا أردأ من أف لذكره فليعمل البار ما شاء أن يعمل فلن يدخل النار . وليعمل العاق ما شاء أن يعمل فلن يدخل الجنة . قال علماؤنا : وإنما صارت قولة أف للأبوين أردأ شيء لأنه رفضهما رفض كفر النعمة ، وجحد التربية ورد الوصية التي أوصاه في التنزيل . وأف كلمة مقولة لكل شيء مرفوض ; ولذلك قال إبراهيم لقومه : أف لكم ولما تعبدون من دون الله أي رفض لكم ولهذه الأصنام معكم .\nالثالثة عشرة : قوله تعالى : ولا تنهرهما النهر : الزجر والغلظة .\nوقل لهما قولا كريما أي لينا لطيفا ، مثل : يا أبتاه ويا أماه ، من غير أن يسميهما ويكنيهما ; قال عطاء . وقال ابن البداح التجيبي : قلت لسعيد بن المسيب كل ما في القرآن من بر الوالدين قد عرفته إلا قوله : وقل لهما قولا كريما ما هذا القول الكريم ؟ قال ابن المسيب : قول العبد المذنب للسيد الفظ الغليظ .\n                                    ",
        "saadi": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا ٣٢\n                                        \n                                        \n                                        \n                                        لما نهى تعالى عن الشرك به أمر بالتوحيد فقال: { وَقَضَى رَبُّكَ } قضاء دينيا وأمر أمرا شرعيا { أَنْ لَا تَعْبُدُوا } أحدا من أهل الأرض والسماوات الأحياء والأموات.\n{ إِلَّا إِيَّاهُ } لأنه الواحد الأحد الفرد الصمد الذي له كل صفة كمال، وله من تلك الصفة أعظمها على وجه لا يشبهه أحد من خلقه، وهو المنعم بالنعم الظاهرة والباطنة الدافع لجميع النقم الخالق الرازق المدبر لجميع الأمور فهو المتفرد بذلك كله وغيره ليس له من ذلك شيء.\nثم ذكر بعد حقه القيام بحق الوالدين فقال: { وَبِالْوَالِدَيْنِ إِحْسَانًا } أي: أحسنوا إليهما بجميع وجوه الإحسان القولي والفعلي لأنهما سبب وجود العبد ولهما من المحبة للولد والإحسان إليه والقرب ما يقتضي تأكد الحق ووجوب البر.\n{ إِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلَاهُمَا } أي: إذا وصلا إلى هذا السن الذي تضعف فيه قواهما ويحتاجان من اللطف والإحسان ما هو معروف. { فَلَا تَقُلْ لَهُمَا أُفٍّ } وهذا أدنى مراتب الأذى نبه به على ما سواه، والمعنى لا تؤذهما أدنى أذية.\n{ وَلَا تَنْهَرْهُمَا } أي: تزجرهما وتتكلم لهما كلاما خشنا، { وَقُلْ لَهُمَا قَوْلًا كَرِيمًا } بلفظ يحبانه وتأدب وتلطف بكلام لين حسن يلذ على قلوبهما وتطمئن به نفوسهما، وذلك يختلف باختلاف الأحوال والعوائد والأزمان.\n                                    "
      },
      "originalText": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا ٣٢"
    },
    {
      "number": 2053,
      "text": "وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُلْ رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 24,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 242,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا ٤٢\n                                    \n                                    \n                                    ( واخفض لهما جناح الذل من الرحمة ) أي تواضع لهما بفعلك ) وقل رب ارحمهما ) أي في كبرهما وعند وفاتهما ( كما ربياني صغيرا )\nقال ابن عباس ثم أنزل الله [ تعالى : ( ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى ) [ التوبة 113 .\nوقد جاء في بر الوالدين أحاديث كثيرة منها الحديث المروي من طرق عن أنس وغيره أن رسول الله صلى الله عليه وسلم لما صعد المنبر قال آمين آمين آمين فقالوا يا رسول الله علام أمنت قال أتاني جبريل فقال يا محمد رغم أنف امرئ ذكرت عنده فلم يصل عليك فقل آمين فقلت : آمين ثم قال رغم أنف امرئ دخل عليه شهر رمضان ثم خرج ولم يغفر له قل آمين فقلت : آمين ثم قال رغم أنف امرئ أدرك أبويه أو أحدهما فلم يدخلاه الجنة قل آمين فقلت : آمين .\nحديث آخر قال الإمام أحمد حدثنا هشيم حدثنا علي بن زيد أخبرنا زرارة بن أوفى عن مالك بن الحارث رجل منهم أنه سمع النبي صلى الله عليه وسلم يقول من ضم يتيما بين أبوين مسلمين إلى طعامه وشرابه حتى يستغني عنه وجبت له الجنة البتة ومن أعتق امرأ مسلما كان فكاكه من النار يجزى بكل عضو منه عضوا منه\nثم قال حدثنا محمد بن جعفر حدثنا شعبة سمعت علي بن زيد فذكر معناه إلا أنه قال عن رجل من قومه يقال له مالك أو ابن مالك وزاد ومن أدرك والديه أو أحدهما فدخل النار فأبعده الله .\nحديث آخر وقال الإمام أحمد حدثنا عفان حدثنا حماد بن سلمة أخبرنا علي بن زيد عن زرارة بن أوفى عن مالك بن عمرو القشيري سمعت رسول الله صلى الله عليه وسلم يقول من أعتق رقبة مسلمة فهي فداؤه من النار مكان كل عظم من عظامه محررة بعظم من عظامه ومن أدرك أحد والديه ثم لم يغفر له فأبعده الله عز وجل ومن ضم يتيما بين أبوين مسلمين إلى طعامه وشرابه حتى يغنيه الله وجبت له الجنة \"\nحديث آخر وقال الإمام أحمد حدثنا حجاج ومحمد بن جعفر قالا حدثنا شعبة عن قتادة سمعت زرارة بن أوفى يحدث عن أبي بن مالك القشيري قال قال النبي صلى الله عليه وسلم من أدرك والديه أو أحدهما ثم دخل النار من بعد ذلك فأبعده الله وأسحقه\nورواه أبو داود الطيالسي عن شعبة به وفيه زيادات أخر\nحديث آخر قال الإمام أحمد حدثنا عفان حدثنا أبو عوانة حدثنا سهيل بن أبي صالح عن أبيه عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال رغم أنف ثم رغم أنف ثم رغم أنف رجل أدرك والديه أحدهما أو كلاهما عند الكبر ولم يدخل الجنة\nصحيح من هذا الوجه ولم يخرجه سوى مسلم من حديث أبي عوانة وجرير وسليمان بن بلال عن سهيل به .\nحديث آخر وقال الإمام أحمد حدثنا ربعي بن إبراهيم قال أحمد وهو أخو إسماعيل ابن علية وكان يفضل على أخيه عن عبد الرحمن بن إسحاق عن سعيد بن أبي سعيد عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم رغم أنف رجل ذكرت عنده فلم يصل علي ! ورغم أنف رجل دخل عليه شهر رمضان فانسلخ قبل أن يغفر له! ورغم أنف رجل أدرك عنده أبواه الكبر فلم يدخلاه الجنة قال ربعي لا أعلمه إلا قال أحدهما\nورواه الترمذي عن أحمد بن إبراهيم الدورقي عن ربعي بن إبراهيم ثم قال غريب من هذا الوجه .\nحديث آخر وقال الإمام أحمد حدثنا يونس بن محمد حدثنا عبد الرحمن بن الغسيل حدثنا أسيد بن علي عن أبيه علي بن عبيد عن أبي أسيد وهو مالك بن ربيعة الساعدي ، قال بينما أنا جالس عند رسول الله صلى الله عليه وسلم إذ جاءه رجل من الأنصار فقال يا رسول الله هل بقي علي من بر أبوي شيء بعد موتهما أبرهما به قال : نعم خصال أربع الصلاة عليهما والاستغفار لهما وإنفاذ عهدهما وإكرام صديقهما وصلة الرحم التي لا رحم لك إلا من قبلهما فهو الذي بقي عليك بعد موتهما من برهما \"\nورواه أبو داود وابن ماجه من حديث عبد الرحمن بن سليمان وهو ابن الغسيل به .\nحديث آخر وقال الإمام أحمد حدثنا روح حدثنا ابن جريج أخبرني محمد بن طلحة بن عبد الله بن عبد الرحمن عن أبيه ، عن معاوية بن جاهمة السلمي أن جاهمة جاء إلى النبي صلى الله عليه وسلم فقال يا رسول الله أردت الغزو وجئتك أستشيرك ؟ فقال فهل لك من أم قال . نعم فقال : الزمها فإن الجنة عند رجليها ثم الثانية ثم الثالثة في مقاعد شتى كمثل هذا القول\nورواه النسائي وابن ماجه من حديث ابن جريج به .\nحديث آخر قال الإمام أحمد حدثنا خلف بن الوليد حدثنا ابن عياش عن بحير بن سعد عن خالد بن معدان عن المقدام بن معد يكرب الكندي عن النبي صلى الله عليه وسلم قال إن الله يوصيكم بآبائكم إن الله يوصيكم بأمهاتكم إن الله يوصيكم بأمهاتكم إن الله يوصيكم بأمهاتكم إن الله يوصيكم بالأقرب فالأقرب\nوقد أخرجه ابن ماجه من حديث عبد الله بن عياش به .\nحديث آخر قال الإمام أحمد حدثنا يونس حدثنا أبو عوانة عن الأشعث بن سليم عن أبيه ، عن رجل من بني يربوع قال أتيت النبي صلى الله عليه وسلم فسمعته وهو يكلم الناس يقول يد المعطي [ العليا أمك وأباك وأختك وأخاك ثم أدناك أدناك .\nحديث آخر : قال الحافظ أبو بكر أحمد بن عمرو بن عبد الخالق البزار في مسنده حدثنا إبراهيم بن المستمر العروقي حدثنا عمرو بن سفيان حدثنا الحسن بن أبي جعفر عن ليث بن أبي سليم عن علقمة بن مرثد عن سليمان بن بريدة عن أبيه أن رجلا كان في الطواف حاملا أمه يطوف بها فسأل النبي صلى الله عليه وسلم هل أديت حقها ؟ قال لا ولا بزفرة واحدة أو كما قال ثم قال البزار لا نعلمه يروى إلا من هذا الوجه .\nقلت والحسن بن أبي جعفر ضعيف والله أعلم\n                                    ",
        "qortoby": "وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا ٤٢\n                                    \n                                    \n                                    قوله تعالى : واخفض لهما جناح الذل من الرحمة هذه استعارة في الشفقة والرحمة بهما ، والتذلل لهما تذلل الرعية للأمير والعبيد للسادة ; كما أشار إليه سعيد بن المسيب . وضرب خفض الجناح ونصبه مثلا لجناح الطائر حين ينتصب بجناحه لولده . والذل : هو اللين . وقراءة الجمهور بضم الذال ، من ذل يذل ذلا وذلة ومذلة فهو ذال وذليل . وقرأ سعيد بن جبير وابن عباس وعروة بن الزبير \" الذل \" بكسر الذال ، ورويت عن عاصم ; من قولهم : دابة ذلول بينة الذل . والذل في الدواب المنقاد السهل دون الصعب . فينبغي بحكم هذه الآية أن يجعل الإنسان نفسه مع أبويه في خير ذلة ، في أقواله وسكناته ونظره ، ولا يحد إليهما بصره فإن تلك هي نظرة الغاضب .\nقوله تعالى : الخطاب في هذه الآية للنبي - صلى الله عليه وسلم - والمراد به أمته ; إذ لم يكن له - عليه السلام - في ذلك الوقت أبوان . ولم يذكر الذل في قوله - تعالى - : واخفض جناحك لمن اتبعك من المؤمنين وذكره هنا بحسب عظم الحق وتأكيده . ومن في قوله : من الرحمة لبيان الجنس ، أي إن هذا الخفض يكون من الرحمة المستكنة في النفس ، لا بأن يكون ذلك استعمالا . ويصح أن يكون لانتهاء الغاية .\nثم أمر - تعالى - عباده بالترحم على آبائهم والدعاء لهم ، وأن ترحمهما كما رحماك وترفق بهما كما رفقا بك ; إذ ولياك صغيرا جاهلا محتاجا فآثراك على أنفسهما ، وأسهرا ليلهما ، وجاعا وأشبعاك ، وتعريا وكسواك ، فلا تجزيهما إلا أن يبلغا من الكبر الحد الذي كنت فيه من الصغر ، فتلي منهما ما وليا منك ، ويكون لهما حينئذ فضل التقدم . قال - صلى الله عليه وسلم - : لا يجزي ولد والدا إلا أن يجده مملوكا فيشتريه فيعتقه . وسيأتي في سورة [ مريم ] الكلام على هذا الحديث .\nقوله تعالى : كما ربياني خص التربية بالذكر ليتذكر العبد شفقة الأبوين وتعبهما في التربية ، فيزيده ذلك إشفاقا لهما وحنانا عليهما ، وهذا كله في الأبوين المؤمنين . وقد نهى القرآن عن الاستغفار للمشركين الأموات ولو كانوا أولي قربى ، كما تقدم . وذكر عن ابن عباس وقتادة أن هذا كله منسوخ بقوله : ما كان للنبي والذين آمنوا أن يستغفروا للمشركين - إلى قوله - أصحاب الجحيم فإذا كان والدا المسلم ذميين استعمل معهما ما أمره الله به هاهنا ; إلا الترحم لهما بعد موتهما على الكفر ; لأن هذا وحده نسخ بالآية المذكورة . وقيل : ليس هذا موضع نسخ ، فهو دعاء بالرحمة الدنيوية للأبوين المشركين ما داما حيين ، كما تقدم . أو يكون عموم هذه الآية خص بتلك ، لا رحمة الآخرة ، لا سيما وقد قيل إن قوله : وقل رب ارحمهما نزلت في سعد بن أبي وقاص ، فإنه أسلم ، فألقت أمه نفسها في الرمضاء متجردة ، فذكر ذلك لسعد فقال : لتمت ، فنزلت الآية . وقيل : الآية خاصة في الدعاء للأبوين المسلمين . والصواب أن ذلك عموم كما ذكرنا ، وقال ابن عباس قال النبي - صلى الله عليه وسلم - : من أمسى مرضيا لوالديه وأصبح أمسى وأصبح وله بابان مفتوحان من الجنة وإن واحدا فواحدا . ومن أمسى وأصبح مسخطا لوالديه أمسى وأصبح وله بابان مفتوحان إلى النار وإن واحدا فواحدا فقال رجل : يا رسول الله ، وإن ظلماه ؟ قال : وإن ظلماه وإن ظلماه وإن ظلماه . وقد روينا بالإسناد المتصل عن جابر بن عبد الله - رضي الله تعالى عنه - قال : جاء رجل إلى النبي - صلى الله عليه وسلم - فقال : يا رسول الله ، إن أبي أخذ مالي . فقال النبي - صلى الله عليه وسلم - للرجل : فأتني بأبيك فنزل جبريل - عليه السلام - على النبي - صلى الله عليه وسلم - فقال : إن الله - عز وجل - يقرئك السلام ويقول لك إذا جاءك الشيخ فاسأله عن شيء قاله في نفسه ما سمعته أذناه فلما جاء الشيخ قال له النبي - صلى الله عليه وسلم - : ما بال ابنك يشكوك أتريد أن تأخذ ماله ؟ فقال : سله يا رسول الله ، هل أنفقه إلا على إحدى عماته أو خالاته أو على نفسي ! فقال له رسول الله - صلى الله عليه وسلم - : إيه ، دعنا من هذا أخبرني عن شيء قلته في نفسك ما سمعته أذناك ؟ فقال الشيخ : والله يا رسول الله ، ما زال الله - عز وجل - يزيدنا بك يقينا ، لقد قلت في نفسي شيئا ما سمعته أذناي . قال : قل وأنا أسمع قال قلت :\nغذوتك مولودا ومنتك يافعا تعل بما أجني عليك وتنهل إذا ليلة ضافتك بالسقم لم أبت\nلسقمك إلا ساهرا أتململ كأني أنا المطروق دونك بالذي\nطرقت به دوني فعيني تهمل تخاف الردى نفسي عليك وإنها\nلتعلم أن الموت وقت مؤجل فلما بلغت السن والغاية التي\nإليها مدى ما كنت فيك أؤمل جعلت جزائي غلظة وفظاظة\nكأنك أنت المنعم المتفضل فليتك إذ لم ترع حق أبوتي\nفعلت كما الجار المصاقب يفعل أوليتني حق الجوار ولم تكن\nعلي بمال دون مالك تبخل\nقال : فحينئذ أخذ النبي - صلى الله عليه وسلم - بتلابيب ابنه وقال : ( أنت ومالك لأبيك ) . قال الطبراني : اللخمي لا يروي - يعني هذا الحديث - عن ابن المنكدر بهذا التمام والشعر إلا بهذا الإسناد ; وتفرد به عبيد الله بن خلصة . والله أعلم .\n                                    ",
        "saadi": "وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا ٤٢\n                                        \n                                        \n                                        \n                                        { وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ } أي: تواضع لهما ذلا لهما ورحمة واحتسابا للأجر لا لأجل الخوف منهما أو الرجاء لما لهما، ونحو ذلك من المقاصد التي لا يؤجر عليها العبد.\n{ وَقُلْ رَبِّ ارْحَمْهُمَا } أي: ادع لهما بالرحمة أحياء وأمواتا، جزاء على تربيتهما إياك صغيرا.\nوفهم من هذا أنه كلما ازدادت التربية ازداد الحق، وكذلك من تولى تربية الإنسان في دينه ودنياه تربية صالحة غير الأبوين فإن له على من رباه حق التربية.\n                                    "
      },
      "originalText": "وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّيَانِي صَغِيرٗا ٤٢"
    },
    {
      "number": 2054,
      "text": "رَبُّكُمْ أَعْلَمُ بِمَا فِي نُفُوسِكُمْ ۚ إِنْ تَكُونُوا صَالِحِينَ فَإِنَّهُ كَانَ لِلْأَوَّابِينَ غَفُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 25,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 242,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا ٥٢\n                                    \n                                    \n                                    قال سعيد بن جبير هو الرجل تكون منه البادرة إلى أبويه وفي نيته وقلبه أنه لا يؤخذ به وفي رواية لا يريد إلا الخير بذلك - فقال ربكم أعلم بما في نفوسكم\nوقوله [ تعالى ] : ( ربكم أعلم بما في نفوسكم )\nوقوله تعالى ( فإنه كان للأوابين غفورا ) قال قتادة للمطيعين أهل الصلاة\nوعن ابن عباس المسبحين وفي رواية عنه المطيعين المحسنين\nوقال بعضهم هم الذين يصلون بين العشاءين وقال بعضهم هم الذين يصلون الضحى\nوقال شعبة عن يحيى بن سعيد عن سعيد بن المسيب في قوله ( فإنه كان للأوابين غفورا ) قال الذي يصيب الذنب ثم يتوب ويصيب الذنب ثم يتوب\nوكذا رواه عبد الرزاق عن الثوري ومعمر عن يحيى بن سعيد عن ابن المسيب نحوه وكذا رواه الليث وابن جريج عن يحيى بن سعيد عن ابن المسيب به وكذا قال عطاء بن يسار\nوقال مجاهد وسعيد بن جبير هم الراجعون إلى الخير\nوقال مجاهد عن عبيد بن عمير في قوله ( فإنه كان للأوابين غفورا ) قال : هو الذي إذا ذكر ذنوبه في الخلاء فيستغفر الله منها ووافقه على ذلك مجاهد .\nوقال عبد الرزاق أخبرنا محمد بن مسلم عن عمرو بن دينار عن عبيد بن عمير في قوله ( فإنه كان للأوابين غفورا ) قال كنا نعد الأواب الحفيظ أن يقول اللهم اغفر لي ما أصبت في مجلسي هذا .\nوقال ابن جرير والأولى في ذلك قول من قال هو التائب من الذنب الراجع عن المعصية إلى الطاعة مما يكره الله إلى ما يحبه ويرضاه .\nوهذا الذي قاله هو الصواب لأن الأواب مشتق من الأوب وهو الرجوع يقال آب فلان إذا رجع قال الله تعالى : ( إن إلينا إيابهم ) [ الغاشية 25 ، وفي الحديث الصحيح ، أن رسول الله صلى الله عليه وسلم كان إذا رجع من سفر قال : آيبون تائبون عابدون لربنا حامدون .\n                                    ",
        "qortoby": "رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا ٥٢\n                                    \n                                    \n                                    وله تعالى : ربكم أعلم بما في نفوسكم إن تكونوا صالحين فإنه كان للأوابين غفورا قوله تعالى : ربكم أعلم بما في نفوسكم أي من اعتقاد الرحمة بهما والحنو عليهما ، أو من غير ذلك من العقوق ، أو من جعل ظاهر برهما رياء . وقال ابن جبير : يريد البادرة التي تبدر ، كالفلتة والزلة ، تكون من الرجل إلى أبويه أو أحدهما ، لا يريد بذلك بأسا .\nإن تكونوا صالحين أي صادقين في نية البر بالوالدين فإن الله يغفر البادرة .\nفإنه كان للأوابين غفورا وعد بالغفران مع شرط الصلاح والأوبة بعد الأوبة إلى طاعة الله - سبحانه وتعالى - . قال سعيد بن المسيب : هو العبد يتوب ثم يذنب ثم يتوب ثم يذنب . وقال ابن عباس - رضي الله عنه - : الأواب : الحفيظ الذي إذا ذكر خطاياه استغفر منها . وقال عبيد بن عمير : هم الذين يذكرون ذنوبهم في الخلاء ثم يستغفرون الله - عز وجل - . وهذه الأقوال متقاربة . وقال عون العقيلي : الأوابون هم الذين يصلون صلاة الضحى . وفي الصحيح : صلاة الأوابين حين ترمض الفصال . وحقيقة اللفظ من آب يؤوب إذا رجع .\n                                    ",
        "saadi": "رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا ٥٢\n                                        \n                                        \n                                        \n                                        أي: ربكم تعالى مطلع على ما أكنته سرائركم من خير وشر وهو لا ينظر إلى أعمالكم وأبدانكم وإنما ينظر إلى قلوبكم وما فيها من الخير والشر.\n{ إِنْ تَكُونُوا صَالِحِينَ } بأن تكون إرادتكم ومقاصدكم دائرة على مرضاة الله ورغبتكم فيما يقربكم إليه وليس في قلوبكم إرادات مستقرة لغير الله.\n{ فَإِنَّهُ كَانَ لِلْأَوَّابِينَ } أي: الرجاعين إليه في جميع الأوقات { غَفُورًا } فمن اطلع الله على قلبه وعلم أنه ليس فيه إلا الإنابة إليه ومحبته ومحبة ما يقرب إليه فإنه وإن جرى منه في بعض الأوقات ما هو مقتضى الطبائع البشرية فإن الله يعفو عنه ويغفر له الأمور العارضة غير المستقرة.\n                                    "
      },
      "originalText": "رَّبُّكُمۡ أَعۡلَمُ بِمَا فِي نُفُوسِكُمۡۚ إِن تَكُونُواْ صَٰلِحِينَ فَإِنَّهُۥ كَانَ لِلۡأَوَّٰبِينَ غَفُورٗا ٥٢"
    },
    {
      "number": 2055,
      "text": "وَآتِ ذَا الْقُرْبَىٰ حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ وَلَا تُبَذِّرْ تَبْذِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 26,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 242,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا ٦٢\n                                    \n                                    \n                                    لما ذكر تعالى بر الوالدين عطف بذكر الإحسان إلى القرابة وصلة الأرحام كما تقدم في الحديث أمك وأباك ثم أدناك أدناك وفي رواية ثم الأقرب فالأقرب\nوفي الحديث من أحب أن يبسط له رزقه وينسأ له في أجله فليصل رحمه \"\nوقال الحافظ أبو بكر البزار حدثنا عباد بن يعقوب حدثنا أبو يحيى التيمي حدثنا فضيل بن مرزوق عن عطية عن أبي سعيد قال لما نزلت هذه الآية ( وآت ذا القربى حقه ) دعا رسول الله صلى الله عليه وسلم فاطمة فأعطاها فدك ثم قال لا نعلم حدث به عن فضيل بن مرزوق إلا أبو يحيى التيمي وحميد بن حماد بن أبي الخوار\nوهذا الحديث مشكل لو صح إسناده لأن الآية مكية ، و فدك إنما فتحت مع خيبر سنة سبع من الهجرة فكيف يلتئم هذا مع هذا\nوقد تقدم الكلام على المساكين وابن السبيل في سورة براءة بما أغنى عن إعادته هاهنا\nقوله تعالى ] ( ولا تبذر تبذيرا ) لما أمر بالإنفاق نهى عن الإسراف فيه بل يكون وسطا كما قال في الآية الأخرى ( والذين إذا أنفقوا لم يسرفوا ولم يقتروا وكان بين ذلك قواما ) [ الفرقان 67 .\n                                    ",
        "qortoby": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا ٦٢\n                                    \n                                    \n                                    قوله تعالى : وآت ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا\nفيه مسائل :\nالأولى : قوله تعالى : وآت ذا القربى حقه أي كما راعيت حق الوالدين فصل الرحم ، ثم تصدق على المسكين وابن السبيل . وقال علي بن الحسين في قوله - تعالى - : وآت ذا القربى حقه : هم قرابة النبي - صلى الله عليه وسلم - ، أمر - صلى الله عليه وسلم - بإعطائهم حقوقهم من بيت المال ، أي من سهم ذوي القربى من الغزو والغنيمة ، ويكون خطابا للولاة أو من قام مقامهم . والحق في هذه الآية ما يتعين من صلة الرحم ، وسد الخلة ، والمواساة عند الحاجة بالمال ، والمعونة بكل وجه .\nالثانية : قوله تعالى : ولا تبذر أي لا تسرف في الإنفاق في غير حق . قال الشافعي - رضي الله عنه - : والتبذير إنفاق المال في غير حقه ، ولا تبذير في عمل الخير . وهذا قول الجمهور . وقال أشهب عن مالك : التبذير هو أخذ المال من حقه ووضعه في غير حقه ، وهو الإسراف ، وهو حرام لقوله - تعالى - : إن المبذرين كانوا إخوان الشياطين\n                                    ",
        "saadi": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا ٦٢\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وَآتِ ذَا الْقُرْبَى حَقَّهُ } من البر والإكرام الواجب والمسنون وذلك الحق يتفاوت بتفاوت الأحوال والأقارب والحاجة وعدمها والأزمنة.\n{ وَالْمِسْكِينَ } آته حقه من الزكاة ومن غيرها لتزول مسكنته { وَابْنَ السَّبِيلِ } وهو الغريب المنقطع به عن بلده، فيعطي الجميع من المال على وجه لا يضر المعطي ولا يكون زائدا على المقدار اللائق فإن ذلك تبذير قد نهى الله عنه\n                                    "
      },
      "originalText": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِ وَلَا تُبَذِّرۡ تَبۡذِيرًا ٦٢"
    },
    {
      "number": 2056,
      "text": "إِنَّ الْمُبَذِّرِينَ كَانُوا إِخْوَانَ الشَّيَاطِينِ ۖ وَكَانَ الشَّيْطَانُ لِرَبِّهِ كَفُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 27,
      "juz": 15,
      "manzil": 4,
      "page": 284,
      "ruku": 242,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا ٧٢\n                                    \n                                    \n                                    ثم قال منفرا عن التبذير والسرف : ( إن المبذرين كانوا إخوان الشياطين ) أي أشباههم في ذلك\nوقال ابن مسعود التبذير الإنفاق في غير حق وكذا قال ابن عباس\nوقال مجاهد لو أنفق إنسان ماله كله في الحق لم يكن مبذرا ولو أنفق مدا في غير حقه كان تبذيرا\nوقال قتادة التبذير النفقة في معصية الله تعالى وفي غير الحق وفي الفساد\nوقال الإمام أحمد حدثنا هاشم بن القاسم حدثنا ليث عن خالد بن يزيد عن سعيد بن أبى هلال عن أنس بن مالك أنه قال أتى رجل من بني تميم إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني ذو مال كثير وذو أهل وولد وحاضرة فأخبرني كيف أنفق وكيف أصنع فقال رسول الله صلى الله عليه وسلم تخرج الزكاة من مالك فإنها طهرة تطهرك وتصل أقرباءك وتعرف حق السائل والجار والمسكين \" . فقال يا رسول الله أقلل لي فقال : ( وآت ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا ) فقال : : حسبي يا رسول الله إذا أديت الزكاة إلى رسولك فقد برئت منها إلى الله وإلى رسوله فقال رسول الله صلى الله عليه وسلم نعم إذا أديتها إلى رسولي فقد برئت منها فلك أجرها وإثمها على من بدلها \"\nوقوله تعالى ] ( إن المبذرين كانوا إخوان الشياطين ) أي في التبذير والسفه وترك طاعة الله وارتكاب معصيته ولهذا قال : ( وكان الشيطان لربه كفورا ) أي جحودا لأنه أنكر نعمة الله عليه ولم يعمل بطاعته بل أقبل على معصيته ومخالفته\n                                    ",
        "qortoby": "إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا ٧٢\n                                    \n                                    \n                                    \" إخوان \" يعني أنهم في حكمهم ; إذ المبذر ساع في إفساد كالشياطين ، أو أنهم يفعلون ما تسول لهم أنفسهم ، أو أنهم يقرنون بهم غدا في النار ; ثلاثة أقوال . والإخوان هنا جمع أخ من غير النسب ; ومنه قوله - تعالى - : إنما المؤمنون إخوة . وكان الشيطان لربه كفورا أي احذروا متابعته والتشبه به في الفساد . والشيطان اسم الجنس .\nوقرأ الضحاك \" إخوان الشيطان \" على الانفراد ، وكذلك ثبت في مصحف أنس بن مالك - رضي الله عنه - .\nمن أنفق ماله في الشهوات زائدا على قدر الحاجات وعرضه بذلك للنفاد فهو مبذر . ومن أنفق ربح ماله في شهواته وحفظ الأصل أو الرقبة فليس بمبذر . ومن أنفق درهما في حرام فهو مبذر ، ويحجر عليه في نفقته الدرهم في الحرام ، ولا يحجر عليه إن بذله في الشهوات إلا إذا خيف عليه النفاد .\n                                    ",
        "saadi": "إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا ٧٢\n                                        \n                                        \n                                        \n                                        { إِنَّ الْمُبَذِّرِينَ كَانُوا إِخْوَانَ الشَّيَاطِينِ } لأن الشيطان لا يدعو إلا إلى كل خصلة ذميمة فيدعو الإنسان إلى البخل والإمساك فإذا عصاه، دعاه إلى الإسراف والتبذير. والله تعالى إنما يأمر بأعدل الأمور وأقسطها ويمدح عليه، كما في قوله عن عباد الرحمن الأبرار { والذين إذا أنفقوا لم يسرفوا ولم يقتروا وكان بين ذلك قواما }\n                                    "
      },
      "originalText": "إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا ٧٢"
    }
  ]
}