{
  "number": 285,
  "ayahsNumber": 11,
  "ayahs": [
    {
      "number": 2057,
      "text": "وَإِمَّا تُعْرِضَنَّ عَنْهُمُ ابْتِغَاءَ رَحْمَةٍ مِنْ رَبِّكَ تَرْجُوهَا فَقُلْ لَهُمْ قَوْلًا مَيْسُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 28,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 242,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا ٨٢\n                                    \n                                    \n                                    وقوله تعالى ] ( وإما تعرضن عنهم ابتغاء رحمة من ربك ترجوها فقل لهم قولا ميسورا ) أي وإذا سألك أقاربك ومن أمرنا بإعطائهم وليس عندك شيء وأعرضت عنهم لفقد النفقة ( فقل لهم قولا ميسورا ) أي عدهم وعدا بسهولة ولين : إذا جاء رزق الله فسنصلكم إن شاء الله هكذا فسر قوله ( فقل لهم قولا ميسورا ) بالوعد مجاهد وعكرمة وسعيد بن جبير والحسن وقتادة وغير واحد\n                                    ",
        "qortoby": "وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا ٨٢\n                                    \n                                    \n                                    وإما تعرضن عنهم ابتغاء رحمة من ربك ترجوها فقل لهم قولا ميسورا فيه ثلاث مسائل :\nالأولى : أنه - سبحانه وتعالى - خص نبيه - صلى الله عليه وسلم - بقوله : وإما تعرضن عنهم ابتغاء رحمة من ربك ترجوها . وهو تأديب عجيب وقول لطيف بديع ، أي لا تعرض عنهم إعراض مستهين عن ظهر الغنى والقدرة فتحرمهم . وإنما يجوز أن تعرض عنهم عند عجز يعرض وعائق يعوق ، وأنت عند ذلك ترجو من الله - سبحانه وتعالى - فتح باب الخير لتتوصل به إلى مواساة السائل ; فإن قعد بك الحال فقل لهم قولا ميسورا .\nالثانية : في سبب نزولها ; قال ابن زيد : نزلت الآية في قوم كانوا يسألون رسول الله - صلى الله عليه وسلم - فيأبى أن يعطيهم ; لأنه كان يعلم منهم نفقة المال في فساد ، فكان يعرض عنهم رغبة في الأجر في منعهم لئلا يعينهم على فسادهم . وقال عطاء الخراساني في قوله - تعالى - وإما تعرضن عنهم ابتغاء رحمة من ربك ترجوها قال : ليس هذا في ذكر الوالدين ، جاء ناس من مزينة إلى النبي - صلى الله عليه وسلم - يستحملونه ; فقال : لا أجد ما أحملكم عليه فتولوا وأعينهم تفيض من الدمع حزنا ; فأنزل الله - تعالى - : وإما تعرضن عنهم ابتغاء رحمة من ربك ترجوها . والرحمة الفيء . والضمير في عنهم عائد على من تقدم ذكرهم من الآباء والقرابة والمساكين وأبناء السبيل .\nالثالثة : قوله تعالى : فقل لهم قولا ميسورا أمره بالدعاء لهم ، أي يسر فقرهم عليهم بدعائك لهم . وقيل : ادع لهم دعاء يتضمن الفتح لهم والإصلاح . وقيل : المعنى وإما تعرضن أي إن أعرضت يا محمد عن إعطائهم لضيق يد فقل لهم قولا ميسورا ; أي أحسن القول وابسط العذر ، وادع لهم بسعة الرزق ، وقل إذا وجدت فعلت وأكرمت ; فإن ذلك يعمل في مسرة نفسه عمل المواساة . وكان - عليه الصلاة والسلام - إذا سئل وليس عنده ما يعطي سكت انتظارا لرزق يأتي من الله - سبحانه وتعالى - كراهة الرد ، فنزلت هذه الآية ، فكان - صلى الله عليه وسلم - إذا سئل وليس عنده ما يعطي قال : يرزقنا الله وإياكم من فضله . فالرحمة على هذا التأويل الرزق المنتظر . وهذا قول ابن عباس ومجاهد وعكرمة . و قولا ميسورا أي لينا لطيفا طيبا ، مفعول بمعنى الفاعل ، من لفظ اليسر كالميمون ، أي وعدا جميلا ، على ما بيناه . ولقد أحسن من قال :\nإلا تكن ورق يوما أجود بها للسائلين فإني لين العود لا يعدم السائلون الخير من خلقي\nإما نوالي وإما حسن مردودي\nتقول : يسرت لك كذا إذا أعددته .\n                                    ",
        "saadi": "وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا ٨٢\n                                        \n                                        \n                                        \n                                        وهذا الأمر بإيتاء ذي القربى مع القدرة والغنى، فأما مع العدم أو تعسر النفقة الحاضرة فأمر تعالى أن يردوا ردا جميلا فقال: { وَإِمَّا تُعْرِضَنَّ عَنْهُمُ ابْتِغَاءَ رَحْمَةٍ مِنْ رَبِّكَ تَرْجُوهَا } أي: تعرض عن إعطائهم إلى وقت آخر ترجو فيه من الله تيسير الأمر.\n{ فَقُلْ لَهُمْ قَوْلًا مَيْسُورًا } أي: لطيفا برفق ووعد بالجميل عند سنوح الفرصة واعتذار بعدم الإمكان في الوقت الحاضر لينقلبوا عنك مطمئنة خواطرهم كما قال تعالى: { قَوْلٌ مَعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ مِنْ صَدَقَةٍ يَتْبَعُهَا أَذًى }\nوهذا أيضا من لطف الله تعالى بالعباد أمرهم بانتظار الرحمة والرزق منه لأن انتظار ذلك عبادة، وكذلك وعدهم بالصدقة والمعروف عند التيسر عبادة حاضرة لأن الهم بفعل الحسنة حسنة، ولهذا ينبغي للإنسان أن يفعل ما يقدر عليه من الخير وينوي فعل ما لم يقدر عليه ليثاب على ذلك ولعل الله ييسر له [بسبب رجائه]\n\n                                    "
      },
      "originalText": "وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَآءَ رَحۡمَةٖ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلٗا مَّيۡسُورٗا ٨٢"
    },
    {
      "number": 2058,
      "text": "وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُومًا مَحْسُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 29,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 242,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا ٩٢\n                                    \n                                    \n                                    يقول تعالى آمرا بالاقتصاد في العيش ذاما للبخل ناهيا عن السرف ( ولا تجعل يدك مغلولة إلى عنقك ) أي لا تكن بخيلا منوعا لا تعطي أحدا شيئا كما قالت اليهود عليهم لعائن الله ( يد الله مغلولة ) [ المائدة 64 ] أي نسبوه إلى البخل تعالى وتقدس الكريم الوهاب\nوقوله : ( ولا تبسطها كل البسط ) أي ولا تسرف في الإنفاق فتعطي فوق طاقتك وتخرج أكثر من دخلك فتقعد ملوما محسورا\nوهذا من باب اللف والنشر أي فتقعد إن بخلت ملوما يلومك الناس ويذمونك ويستغنون عنك كما قال زهير بن أبي سلمى في المعلقة\nومن كان ذا مال ويبخل بماله على قومه يستغن عنه ويذمم\nومتى بسطت يدك فوق طاقتك قعدت بلا شيء تنفقه فتكون كالحسير ، وهو الدابة التي قد عجزت عن السير فوقفت ضعفا وعجزا فإنها تسمى الحسير وهو مأخوذ من الكلال كما قال تعالى : ( فارجع البصر هل ترى من فطور ثم ارجع البصر كرتين ينقلب إليك البصر خاسئا وهو حسير ) [ الملك 3 ، 4 ] أي كليل عن أن يرى عيبا هكذا فسر هذه الآية بأن المراد هنا البخل والسرف ابن عباس والحسن وقتادة وابن جريج وابن زيد وغيرهم\nوقد جاء في الصحيحين من حديث أبي الزناد عن الأعرج عن أبي هريرة أنه سمع رسول الله صلى الله عليه وسلم يقول مثل البخيل والمنفق كمثل رجلين عليهما جبتان من حديد من ثدييهما إلى تراقيهما فأما المنفق فلا ينفق إلا سبغت أو : وفرت على جلده حتى تخفي بنانه وتعفو أثره وأما البخيل فلا يريد أن ينفق شيئا إلا لزقت كل حلقة مكانها فهو يوسعها فلا تتسع\nهذا لفظ البخاري في الزكاة .\nوفي الصحيحين من طريق هشام بن عروة عن زوجته فاطمة بنت المنذر عن جدتها أسماء بنت أبي بكر قالت قال رسول الله صلى الله عليه وسلم أنفقي هكذا وهكذا وهكذا ولا توعي فيوعي الله عليك ولا توكي فيوكي الله عليك وفي لفظ ولا تحصي فيحصي الله عليك \"\nوفي صحيح مسلم من طريق عبد الرزاق عن معمر عن همام عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم إن الله قال لي أنفق أنفق عليك .\nوفي الصحيحين من طريق معاوية بن أبي مزرد عن سعيد بن يسار عن أبي هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم ما من يوم يصبح العباد فيه إلا وملكان ينزلان من السماء يقول أحدهما اللهم أعط منفقا خلفا ويقول الآخر اللهم أعط ممسكا تلفا \"\nوروى مسلم عن قتيبة عن إسماعيل بن جعفر عن العلاء عن أبيه عن أبي هريرة مرفوعا ما نقص مال من صدقة وما زاد الله عبدا بعفو إلا عزا ومن تواضع لله رفعه الله وفي حديث أبي كثير عن عبد الله بن عمرو مرفوعا إياكم والشح فإنه أهلك من كان قبلكم أمرهم بالبخل فبخلوا وأمرهم بالقطيعة فقطعوا وأمرهم بالفجور ففجروا \"\nوروى البيهقي من طريق سعدان بن نصر عن أبي معاوية عن الأعمش عن ابن بريدة عن أبيه قال : قال رسول الله صلى الله عليه وسلم ما يخرج رجل صدقة حتى يفك لحيي سبعين شيطانا وقال الإمام أحمد حدثنا أبو عبيدة الحداد حدثنا سكين بن عبد العزيز حدثنا إبراهيم الهجري عن أبي الأحوص عن عبد الله بن مسعود قال : قال رسول الله صلى الله عليه وسلم ما عال من اقتصد \"\n                                    ",
        "qortoby": "وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا ٩٢\n                                    \n                                    \n                                    قوله تعالى : ولا تجعل يدك مغلولة إلى عنقك ولا تبسطها كل البسط فتقعد ملوما محسورا فيه أربع مسائل :\nالأولى : قوله تعالى : ولا تجعل يدك مغلولة إلى عنقك هذا مجاز عبر به عن البخيل الذي لا يقدر من قلبه على إخراج شيء من ماله ; فضرب له مثل الغل الذي يمنع من التصرف باليد . وفي صحيح البخاري ومسلم عن أبي هريرة - رضي الله عنه - قال : ضرب رسول الله - صلى الله عليه وسلم - مثل البخيل والمتصدق كمثل رجلين عليهما جبتان من حديد قد اضطرت أيديهما إلى ثديهما وتراقيهما فجعل المتصدق كلما تصدق بصدقة انبسطت عنه حتى تغشى أنامله وتعفو أثره وجعل البخيل كلما هم بصدقة قلصت وأخذت كل حلقة بمكانها . قال أبو هريرة - رضي الله عنه - : فأنا رأيت رسول الله - صلى الله عليه وسلم - يقول بأصبعيه هكذا في جيبه فلو رأيته يوسعها ولا تتوسع .\nالثانية : ولا تبسطها كل البسط ضرب بسط اليد مثلا لذهاب المال ، فإن قبض الكف يحبس ما فيها ، وبسطها يذهب ما فيها . وهذا كله خطاب للنبي - صلى الله عليه وسلم - والمراد أمته ، وكثيرا ما جاء في القرآن ; فإن النبي - صلى الله عليه وسلم - لما كان سيدهم وواسطتهم إلى ربهم عبر به عنهم على عادة العرب في ذلك . وأيضا فإنه - عليه الصلاة والسلام - لم يكن يدخر شيئا لغد ، وكان يجوع حتى يشد الحجر على بطنه من الجوع . وكان كثير من الصحابة ينفقون في سبيل الله جميع أموالهم ، فلم يعنفهم النبي - صلى الله عليه وسلم - ولم ينكر عليهم لصحة يقينهم وشدة بصائرهم . وإنما نهى الله - سبحانه وتعالى - عن الإفراط في الإنفاق ، وإخراج ما حوته يده من المال من خيف عليه الحسرة على ما خرج من يده ، فأما من وثق بموعود الله - عز وجل - وجزيل ثوابه فيما أنفقه فغير مراد بالآية ، والله أعلم . وقيل : إن هذا الخطاب للنبي - صلى الله عليه وسلم - في خاصة نفسه ، علمه فيه كيفية الإنفاق ، وأمره بالاقتصاد . قال جابر وابن مسعود : جاء غلام إلى النبي - صلى الله عليه وسلم - فقال : إن أمي تسألك كذا وكذا . فقال : ما عندنا اليوم شيء . قال : فتقول لك اكسني قميصك ; فخلع قميصه فدفعه إليه وجلس في البيت عريانا . وفي رواية جابر : فأذن بلال للصلاة وانتظر رسول الله - صلى الله عليه وسلم - يخرج ، واشتغلت القلوب ، فدخل بعضهم فإذا هو عار ; فنزلت هذه الآية . وكل هذا في إنفاق الخير . وأما إنفاق الفساد فقليله وكثيره حرام ، كما تقدم .\nالثالثة : نهت هذه الآية عن استفراغ الوجد فيما يطرأ أولا من سؤال المؤمنين ; لئلا يبقى من يأتي بعد ذلك لا شيء له ، أو لئلا يضيع المنفق عياله . ونحوه من كلام الحكمة : ما رأيت قط سرفا إلا ومعه حق مضيع . وهذه من آيات فقه الحال فلا يبين حكمها إلا باعتبار شخص شخص من الناس .\nالرابعة : قوله تعالى : فتقعد ملوما محسورا قال ابن عرفة : يقول لا تسرف ولا تتلف مالك فتبقى محسورا منقطعا عن النفقة والتصرف ; كما يكون البعير الحسير ، وهو الذي ذهبت قوته فلا انبعاث به ; ومنه قوله - تعالى - : ينقلب إليك البصر خاسئا وهو حسير أي كليل منقطع . وقال قتادة : أي نادما على ما سلف منك ; فجعله من الحسرة ، وفيه بعد ; لأن الفاعل من الحسرة حسر وحسران ولا يقال محسور . والملوم : الذي يلام على إتلاف ماله ، أو يلومه من لا يعطيه .\n                                    ",
        "saadi": "وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا ٩٢\n                                        \n                                        \n                                        \n                                        وقال هنا: { وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَى عُنُقِكَ } كناية عن شدة الإمساك والبخل.\n{ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ } فتنفق فيما لا ينبغي، أو زيادة على ما ينبغي.\n{ فَتَقْعُدَ } إن فعلت ذلك { مَلُومًا } أي: تلام على ما فعلت { مَحْسُورًا } أي: حاسر اليد فارغها فلا بقي ما في يدك من المال ولا خلفه مدح وثناء.\n                                    "
      },
      "originalText": "وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا ٩٢"
    },
    {
      "number": 2059,
      "text": "إِنَّ رَبَّكَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 30,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 242,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا ٠٣\n                                    \n                                    \n                                    وقوله تعالى ] ( إن ربك يبسط الرزق لمن يشاء ويقدر ) إخبار أنه تعالى هو الرزاق القابض الباسط المتصرف في خلقه بما يشاء فيغني من يشاء ويفقر من يشاء بما له في ذلك من الحكمة ولهذا قال : ( إنه كان بعباده خبيرا بصيرا ) أي خبير بصير بمن يستحق الغنى ومن يستحق الفقر ، كما جاء في الحديث إن من عبادي من لا يصلحه إلا الفقر ولو أغنيته لأفسدت عليه دينه وإن من عبادي لمن لا يصلحه إلا الغنى ولو أفقرته لأفسدت عليه دينه\nوقد يكون الغنى في حق بعض الناس استدراجا والفقر عقوبة عياذا بالله من هذا وهذا\n                                    ",
        "qortoby": "إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا ٠٣\n                                    \n                                    \n                                    لما ذكر عاقبة البخيل والمنفق بين أنه تعالى الذي يبسط الرزق ويقدر في الدنيا , لأنها دار امتحان ; \" ويقدر \" أي يضيق ; ومنه \" ومن قدر عليه رزقه \" [ الطلاق : 7 ] أي ضيق .\nوقيل : \" يقدر \" يعطي بقدر الكفاية .\n                                    ",
        "saadi": "إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا ٠٣\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى أنه يبسط الرزق لمن يشاء من عباده ويقدره ويضيقه على من يشاء حكمة منه، { إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا } فيجزيهم على ما يعلمه صالحا لهم ويدبرهم بلطفه وكرمه.\n                                    "
      },
      "originalText": "إِنَّ رَبَّكَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا ٠٣"
    },
    {
      "number": 2060,
      "text": "وَلَا تَقْتُلُوا أَوْلَادَكُمْ خَشْيَةَ إِمْلَاقٍ ۖ نَحْنُ نَرْزُقُهُمْ وَإِيَّاكُمْ ۚ إِنَّ قَتْلَهُمْ كَانَ خِطْئًا كَبِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 31,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡ‍ٔٗا كَبِيرٗا ١٣\n                                    \n                                    \n                                    هذه الآية الكريمة دالة على أن الله تعالى أرحم بعباده من الوالد بولده لأنه ينهى [ تعالى عن قتل الأولاد كما أوصى بالأولاد في الميراث وكان أهل الجاهلية لا يورثون البنات بل كان أحدهم ربما قتل ابنته لئلا تكثر عيلته فنهى الله [ تعالى عن ذلك فقال : ( ولا تقتلوا أولادكم خشية إملاق ) أي خوف أن تفتقروا في ثاني الحال ولهذا قدم الاهتمام برزقهم فقال ( نحن نرزقهم وإياكم ) وفي الأنعام \" ( ولا تقتلوا أولادكم من إملاق ) أي من فقر ( نحن نرزقكم وإياهم ) [ الأنعام 151\nوقوله : ( إن قتلهم كان خطئا كبيرا ) أي ذنبا عظيما\nوقرأ بعضهم كان خطأ كبيرا وهو بمعناه\nوفي الصحيحين عن عبد الله بن مسعود قلت يا رسول الله أي الذنب أعظم ؟ قال أن تجعل لله ندا وهو خلقك \" قلت ثم أي ؟ قال أن تقتل ولدك خشية أن يطعم معك قلت ثم أي ؟ قال أن تزاني بحليلة جارك \"\n                                    ",
        "qortoby": "وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡ‍ٔٗا كَبِيرٗا ١٣\n                                    \n                                    \n                                    قوله تعالى : ولا تقتلوا أولادكم خشية إملاق نحن نرزقهم وإياكم إن قتلهم كان خطئا كبيرا\nالإملاق : الفقر وعدم الملك . أملق الرجل أي لم يبق له إلا الملقات ; وهي الحجارة العظام الملس . قال الهذلي يصف صائدا :\nأتيح لها أقيدر ذو حشيف إذا سامت على الملقات ساما\nالواحدة ملقة . والأقيدر تصغير الأقدر ، وهو الرجل القصير . والحشيف من الثياب : الخلق . وسامت مرت . وقال شمر : أملق لازم ومتعد ، أملق إذا افتقر ، وأملق الدهر ما بيده . قال أوس :\nوأملق ما عندي خطوب تنبل\nإن قتلهم كان خطئا كبيرا الثانية : قوله تعالى : خطئا خطئا قراءة الجمهور بكسر الخاء وسكون الطاء وبالهمزة والقصر . وقرأ ابن عامر \" خطأ \" بفتح الخاء والطاء والهمزة مقصورة ، وهي قراءة أبي جعفر يزيد . وهاتان قراءتان مأخوذتان من \" خطئ \" إذا أتى الذنب على عمد . قال ابن عرفة : يقال خطئ في ذنبه خطأ إذا أثم فيه ، وأخطأ إذا سلك سبيل خطأ عامدا أو غير عامد . قال :\nويقال خطئ في معنى أخطأ . وقال الأزهري : يقال خطئ يخطأ خطئا إذا تعمد الخطأ ; مثل أثم يأثم إثما . وأخطأ إذا لم يتعمد إخطاء وخطأ . قال الشاعر :\nدعيني إنما خطئي وصوبي علي وإن ما أهلكت مال\nوالخطأ الاسم يقوم مقام الإخطاء ، وهو ضد الصواب . وفيه لغتان : القصر وهو الجيد ، والمد وهو قليل ، وروي عن ابن عباس - رضي الله - تعالى - عنهما - \" خطأ \" بفتح الخاء وسكون الطاء وهمزة . وقرأ ابن كثير بكسر الخاء وفتح الطاء ومد الهمزة . قال النحاس : ولا أعرف لهذه القراءة وجها ، ولذلك جعلها أبو حاتم غلطا . قال أبو علي : هي مصدر من خاطأ يخاطئ ، وإن كنا لا نجد خاطأ ، ولكن وجدنا تخاطأ ، وهو مطاوع خاطأ ، فدلنا عليه ; ومنه قول الشاعر :\nتخاطأت النبل أحشاءه وأخر يومي فلم يعجل\nوقول الآخر في وصف مهاة :\nتخاطأه القناص حتى وجدته وخرطومه في منقع الماء راسب\nالجوهري : تخاطأه أي أخطأه ; وقال أوفى بن مطر المازني :\nألا أبلغا خلتي جابرا بأن خليلك لم يقتل\nتخاطأت النبل أحشاءه وأخر يومي فلم يعجل\nوقرأ الحسن \" خطاء \" بفتح الخاء والطاء والمد في الهمزة . قال أبو حاتم : لا يعرف هذا في اللغة وهي غلط غير جائز . وقال أبو الفتح : الخطأ من أخطأت بمنزلة العطاء من أعطيت ، هو اسم بمعنى المصدر ، وعن الحسن أيضا \" خطى \" بفتح الخاء والطاء منونة من غير همز .\n                                    ",
        "saadi": "وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡ‍ٔٗا كَبِيرٗا ١٣\n                                        \n                                        \n                                        \n                                        وهذا من رحمته بعباده حيث كان أرحم بهم من والديهم، فنهى الوالدين أن يقتلوا أولادهم خوفا من الفقر والإملاق وتكفل برزق الجميع.\nوأخبر أن قتلهم كان خطأ كبيرا أي: من أعظم كبائر الذنوب لزوال الرحمة من القلب والعقوق العظيم والتجرؤ على قتل الأطفال الذين لم يجر منهم ذنب ولا معصية.\n                                    "
      },
      "originalText": "وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُمۡ خَشۡيَةَ إِمۡلَٰقٖۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِيَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡ‍ٔٗا كَبِيرٗا ١٣"
    },
    {
      "number": 2061,
      "text": "وَلَا تَقْرَبُوا الزِّنَا ۖ إِنَّهُ كَانَ فَاحِشَةً وَسَاءَ سَبِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 32,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا ٢٣\n                                    \n                                    \n                                    يقول تعالى ناهيا عباده عن الزنا وعن مقاربته وهو مخالطة أسبابه ودواعيه ( ولا تقربوا الزنا إنه كان فاحشة ) أي ذنبا عظيما ( وساء سبيلا ) أي وبئس طريقا ومسلكا\nوقد قال الإمام أحمد حدثنا يزيد بن هارون حدثنا جرير حدثنا سليم بن عامر عن أبي أمامة قال إن فتى شابا أتى النبي صلى الله عليه وسلم فقال يا رسول الله ائذن لي بالزنا فأقبل القوم عليه فزجروه وقالوا مه مه فقال : ادنه فدنا منه قريبا فقال اجلس فجلس ، قال أتحبه لأمك قال لا والله جعلني الله فداك . قال ولا الناس يحبونه لأمهاتهم \" قال أفتحبه لابنتك \" قال لا والله يا رسول الله جعلني الله فداك . قال ولا الناس يحبونه لبناتهم \" قال أتحبه لأختك \" قال لا والله جعلني الله فداك قال ولا الناس يحبونه لأخواتهم قال أفتحبه لعمتك قال لا والله جعلني الله فداك قال ولا الناس يحبونه لعماتهم قال أفتحبه لخالتك قال لا والله جعلني الله فداك قال : \" ولا الناس يحبونه لخالاتهم قال فوضع يده عليه وقال اللهم اغفر ذنبه وطهر قلبه وحصن فرجه \" قال فلم يكن بعد ذلك الفتى يلتفت إلى شيء .\nوقال ابن أبي الدنيا حدثنا عمار بن نصر حدثنا بقية عن أبي بكر بن أبي مريم عن الهيثم بن مالك الطائي عن النبي صلى الله عليه وسلم قال ما من ذنب بعد الشرك أعظم عند الله من نطفة وضعها رجل في رحم لا يحل له \"\n                                    ",
        "qortoby": "وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا ٢٣\n                                    \n                                    \n                                    قوله تعالى : ولا تقربوا الزنا إنه كان فاحشة وساء سبيلا فيه مسألة واحدة : قال العلماء : قوله - تعالى - ولا تقربوا الزنا أبلغ من أن يقول : ولا تزنوا ; فإن معناه لا تدنوا من الزنا . والزنا يمد ويقصر ، لغتان . قال الشاعر :\nكانت فريضة ما تقول كما كان الزناء فريضة الرجم\nوسبيلا نصب على التمييز ; التقدير : وساء سبيله سبيلا . أي لأنه يؤدي إلى النار . والزنا من الكبائر ، ولا خلاف فيه وفي قبحه لا سيما بحليلة الجار . وينشأ عنه استخدام ولد الغير واتخاذه ابنا وغير ذلك من الميراث وفساد الأنساب باختلاط المياه . وفي الصحيح أن النبي - صلى الله عليه وسلم - أتى بامرأة مجح على باب فسطاط فقال : لعله يريد أن يلم بها فقالوا : نعم . فقال رسول الله - صلى الله عليه وسلم - : لقد هممت أن ألعنه لعنا يدخل معه قبره كيف يورثه وهو لا يحل له كيف يستخدمه وهو لا يحل له .\n                                    ",
        "saadi": "وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا ٢٣\n                                        \n                                        \n                                        \n                                        والنهي عن قربانه أبلغ من النهي عن مجرد فعله لأن ذلك يشمل النهي عن جميع مقدماته ودواعيه فإن: \" من حام حول الحمى يوشك أن يقع فيه \" خصوصا هذا الأمر الذي في كثير من النفوس أقوى داع إليه.\nووصف الله الزنى وقبحه بأنه { كَانَ فَاحِشَةً } أي: إثما يستفحش في الشرع والعقل والفطر لتضمنه التجري على الحرمة في حق الله وحق المرأة وحق أهلها أو زوجها وإفساد الفراش واختلاط الأنساب وغير ذلك من المفاسد.\nوقوله: { وَسَاءَ سَبِيلًا } أي: بئس السبيل سبيل من تجرأ على هذا الذنب العظيم.\n                                    "
      },
      "originalText": "وَلَا تَقۡرَبُواْ ٱلزِّنَىٰٓۖ إِنَّهُۥ كَانَ فَٰحِشَةٗ وَسَآءَ سَبِيلٗا ٢٣"
    },
    {
      "number": 2062,
      "text": "وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۗ وَمَنْ قُتِلَ مَظْلُومًا فَقَدْ جَعَلْنَا لِوَلِيِّهِ سُلْطَانًا فَلَا يُسْرِفْ فِي الْقَتْلِ ۖ إِنَّهُ كَانَ مَنْصُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 33,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا ٣٣\n                                    \n                                    \n                                    يقول تعالى ناهيا عن قتل النفس بغير حق شرعي كما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأن محمدا رسول الله إلا بإحدى ثلاث النفس بالنفس والزاني المحصن والتارك لدينه المفارق للجماعة \"\nوفي السنن لزوال الدنيا أهون عند الله من قتل مسلم \" .\nوقوله : ( ومن قتل مظلوما فقد جعلنا لوليه سلطانا ) أي سلطة على القاتل فإنه بالخيار فيه إن شاء قتله قودا وإن شاء عفا عنه على الدية وإن شاء عفا عنه مجانا كما ثبتت السنة بذلك وقد أخذ الإمام الحبر ابن عباس من عموم هذه الآية الكريمة ولاية معاوية السلطنة وأنه سيملك لأنه كان ولي عثمان وقد قتل عثمان مظلوما رضي الله عنه وكان معاوية يطالب عليا رضي الله عنه أن يسلمه قتلته حتى يقتص منهم لأنه أموي وكان علي رضي الله عنه يستمهله في الأمر حتى يتمكن ويفعل ذلك ويطلب علي من معاوية أن يسلمه الشام فيأبى معاوية ذلك حتى يسلمه القتلة وأبى أن يبايع عليا هو وأهل الشام ثم مع المطاولة تمكن معاوية وصار الأمر إليه كما تفاءل ابن عباس واستنبط من هذه الآية الكريمة وهذا من الأمر العجب وقد روى ذلك الطبراني في معجمه حيث قال\nحدثنا يحيى بن عبد الباقي حدثنا أبو عمير بن النحاس حدثنا ضمرة بن ربيعة عن ابن شوذب عن مطر الوراق عن زهدم الجرمي قال كنا في سمر ابن عباس فقال إني محدثكم حديثا ليس بسر ولا علانية إنه لما كان من أمر هذا الرجل ما كان يعني عثمان قلت لعلي : اعتزل فلو كنت في جحر طلبت حتى تستخرج فعصاني وايم الله ليتأمرن عليكم معاوية وذلك أن الله تعالى يقول ) ومن قتل مظلوما فقد جعلنا لوليه سلطانا فلا يسرف في القتل ) الآية ، وليحملنكم قريش على سنة فارس والروم وليقيمن عليكم النصارى واليهود والمجوس فمن أخذ منكم يومئذ بما يعرف نجا ومن ترك وأنتم تاركون كنتم كقرن من القرون هلك فيمن هلك .\nوقوله تعالى ] ( فلا يسرف في القتل ) قالوا معناه فلا يسرف الولي في قتل القاتل بأن يمثل به أو يقتص من غير القاتل\nوقوله ( إنه كان منصورا ) أي أن الولي منصور على القاتل شرعا وغالبا قدرا\n                                    ",
        "qortoby": "وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا ٣٣\n                                    \n                                    \n                                    قوله تعالى : ولا تقتلوا النفس التي حرم الله إلا بالحق ومن قتل مظلوما فقد جعلنا لوليه سلطانا فلا يسرف في القتل إنه كان منصورا\nقوله تعالى : ولا تقتلوا النفس التي حرم الله إلا بالحق قد مضى الكلام فيه في الأنعام .\nقوله تعالى : ومن قتل مظلوما فقد جعلنا لوليه سلطانا فلا يسرف في القتل إنه كان منصورا\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : ومن قتل مظلوما أي بغير سبب يوجب القتل .\nفقد جعلنا لوليه أي لمستحق دمه . قال ابن خويز منداد : الولي يجب أن يكون ذكرا ; لأنه أفرده بالولاية بلفظ التذكير . وذكر إسماعيل بن إسحاق في قوله - تعالى - : فقد جعلنا لوليه ما يدل على خروج المرأة عن مطلق لفظ الولي ، فلا جرم ، ليس للنساء حق في القصاص لذلك ولا أثر لعفوها ، وليس لها الاستيفاء . وقال المخالف : إن المراد هاهنا بالولي الوارث ; وقد قال - تعالى - : والمؤمنون والمؤمنات بعضهم أولياء بعض ، وقال : والذين آمنوا ولم يهاجروا ما لكم من ولايتهم من شيء ، وقال : وأولوا الأرحام بعضهم أولى ببعض في كتاب الله فاقتضى ذلك إثبات القود لسائر الورثة ; وأما ما ذكروه من أن الولي في ظاهره على التذكير وهو واحد ، كأن ما كان بمعنى الجنس يستوي المذكر والمؤنث فيه ، وتتمته في كتب الخلاف .\nسلطانا أي تسليطا إن شاء قتل وإن شاء عفا ، وإن شاء أخذ الدية ; قاله ابن عباس - رضي الله - تعالى - عنهما - والضحاك وأشهب والشافعي . وقال ابن وهب قال مالك : السلطان أمر الله . ابن عباس : السلطان الحجة . وقيل : السلطان طلبه حتى يدفع إليه . قال ابن العربي : وهذه الأقوال متقاربة ، وأوضحها قول مالك : إنه أمر الله . ثم إن أمر الله - عز وجل - لم يقع نصا فاختلف العلماء فيه ; فقال ابن القاسم عن مالك وأبي حنيفة : القتل خاصة . وقال أشهب : الخيرة ; كما ذكرنا آنفا ، وبه قال الشافعي . وقد مضى في سورة [ البقرة ] هذا المعنى .\nالثانية : قوله تعالى : فلا يسرف في القتل فيه ثلاثة أقوال : لا يقتل غير قاتله ; قاله الحسن والضحاك ومجاهد وسعيد بن جبير . الثاني : لا يقتل بدل وليه اثنين كما كانت العرب تفعله . الثالث : لا يمثل بالقاتل ; قاله طلق بن حبيب ، وكله مراد لأنه إسراف منهي عنه . وقد مضى في [ البقرة ] القول في هذا مستوفى . وقرأ الجمهور يسرف بالياء ، يريد الولي ، وقرأ ابن عامر وحمزة والكسائي \" تسرف \" بالتاء من فوق ، وهي قراءة حذيفة . وروى العلاء بن عبد الكريم عن مجاهد قال : هو للقاتل الأول ، والمعنى عندنا فلا تسرف أيها القاتل . وقال الطبري : هو على معنى الخطاب للنبي - صلى الله عليه وسلم - والأئمة من بعده . أي لا تقتلوا غير القاتل . وفي حرفأبي \" فلا تسرفوا في القتل \" .\nالثالثة : إنه كان منصورا أي معانا ، يعني الولي . فإن قيل : وكم من ولي مخذول لا يصل إلى حقه . قلنا : المعونة تكون بظهور الحجة تارة وباستيفائها أخرى ، وبمجموعهما ثالثة ، فأيها كان فهو نصر من الله - سبحانه وتعالى - . وروى ابن كثير عن مجاهد قال : إن المقتول كان منصورا . النحاس : ومعنى قوله إن الله نصره بوليه . وروي أنه في قراءة أبي \" فلا تسرفوا في القتل إن ولي المقتول كان منصورا \" . قال النحاس : الأبين بالياء ويكون للولي ; لأنه إنما يقال : لا يسرف إن كان له أن يقتل ، فهذا للولي . وقد يجوز بالتاء ويكون للولي أيضا ، إلا أنه يحتاج فيه إلى تحويل المخاطبة . قال الضحاك : هذا أول ما نزل من القرآن في شأن القتل ، وهي مكية .\n                                    ",
        "saadi": "وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا ٣٣\n                                        \n                                        \n                                        \n                                        وهذا شامل لكل نفس { حَرَّمَ اللَّهُ } قتلها من صغير وكبير وذكر وأنثى وحر وعبد ومسلم وكافر له عهد.\n{ إِلَّا بِالْحَقِّ } كالنفس بالنفس والزاني المحصن والتارك لدينه المفارق للجماعة والباغي في حال بغيه إذا لم يندفع إلا بالقتل.\n{ وَمَنْ قُتِلَ مَظْلُومًا } أي: بغير حق { فَقَدْ جَعَلْنَا لِوَلِيِّهِ } وهو أقرب عصباته وورثته إليه { سُلْطَانًا } أي: حجة ظاهرة على القصاص من القاتل، وجعلنا له أيضا تسلطا قدريا على ذلك، وذلك حين تجتمع الشروط الموجبة للقصاص كالعمد العدوان والمكافأة.\n{ فَلَا يُسْرِفْ } الولي { فِي الْقَتْلِ إِنَّهُ كَانَ مَنْصُورًا } والإسراف مجاوزة الحد إما أن يمثل بالقاتل أو يقتله بغير ما قتل به أو يقتل غير القاتل.\nوفي هذه الآية دليل إلى أن الحق في القتل للولي فلا يقتص إلا بإذنه وإن عفا سقط القصاص.\nوأن ولي المقتول يعينه الله على القاتل ومن أعانه حتى يتمكن من قتله.\n                                    "
      },
      "originalText": "وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومٗا فَقَدۡ جَعَلۡنَا لِوَلِيِّهِۦ سُلۡطَٰنٗا فَلَا يُسۡرِف فِّي ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورٗا ٣٣"
    },
    {
      "number": 2063,
      "text": "وَلَا تَقْرَبُوا مَالَ الْيَتِيمِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ حَتَّىٰ يَبْلُغَ أَشُدَّهُ ۚ وَأَوْفُوا بِالْعَهْدِ ۖ إِنَّ الْعَهْدَ كَانَ مَسْئُولًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 34,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡ‍ُٔولٗا ٤٣\n                                    \n                                    \n                                    يقول تعالى ( ولا تقربوا مال اليتيم إلا بالتي هي أحسن ) أي لا تتصرفوا له إلا بالغبطة ( ولا تأكلوا أموالهم إلى أموالكم إنه كان حوبا كبيرا ) [ النساء 2 ] و ( لا تأكلوها إسرافا وبدارا أن يكبروا ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف ) [ النساء 6 .\nوقد جاء في صحيح مسلم أن رسول الله صلى الله عليه وسلم قال لأبي ذر يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين مال يتيم \" .\nوقوله [ تعالى : ( وأوفوا بالعهد ) أي الذي تعاهدون عليه الناس والعقود التي تعاملونهم بها فإن العهد والعقد كل منهما يسأل صاحبه عنه ( إن العهد كان مسئولا ) أي عنه\n                                    ",
        "qortoby": "وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡ‍ُٔولٗا ٤٣\n                                    \n                                    \n                                    قوله تعالى : ولا تقربوا مال اليتيم إلا بالتي هي أحسن حتى يبلغ أشده وأوفوا بالعهد إن العهد كان مسئولا\nفيه مسألتان :\nالأولى : قوله تعالى : ولا تقربوا مال اليتيم إلا بالتي هي أحسن حتى يبلغ أشده قد مضى الكلام فيه في الأنعام . الثانية : قوله تعالى : وأوفوا بالعهد قد مضى الكلام فيه في غير موضع . قال الزجاج : كل ما أمر الله به ونهى عنه فهو من العهد .\nإن العهد كان مسئولا عنه ، فحذف ; كقوله : ويفعلون ما يؤمرون به وقيل : إن العهد يسأل تبكيتا لناقضه فيقال : نقضت ، كما تسأل الموءودة تبكيتا لوائدها .\n                                    ",
        "saadi": "وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡ‍ُٔولٗا ٤٣\n                                        \n                                        \n                                        \n                                        وهذا من لطفه ورحمته تعالى باليتيم الذي فقد والده وهو صغير غير عارف بمصلحة نفسه ولا قائم بها أن أمر أولياءه بحفظه وحفظ ماله وإصلاحه وأن لا يقربوه { إِلَّا بِالَّتِي هِيَ أَحْسَنُ } من التجارة فيه وعدم تعريضه للأخطار، والحرص على تنميته، وذلك ممتد إلى أن { يَبْلُغَ } اليتيم { أَشُدَّهُ } أي: بلوغه وعقله ورشده، فإذا بلغ أشده زالت عنه الولاية وصار ولي نفسه ودفع إليه ماله.\nكما قال تعالى: { فَإِنْ آنَسْتُمْ مِنْهُمْ رُشْدًا فَادْفَعُوا إِلَيْهِمْ أَمْوَالَهُمْ } { وَأَوْفُوا بِالْعَهْدِ } الذي عاهدتم الله عليه والذي عاهدتم الخلق عليه. { إِنَّ الْعَهْدَ كَانَ مَسْئُولًا } أي: مسئولين عن الوفاء به وعدمه، فإن وفيتم فلكم الثواب الجزيل وإن لم تفوا فعليكم الإثم العظيم.\n                                    "
      },
      "originalText": "وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡ‍ُٔولٗا ٤٣"
    },
    {
      "number": 2064,
      "text": "وَأَوْفُوا الْكَيْلَ إِذَا كِلْتُمْ وَزِنُوا بِالْقِسْطَاسِ الْمُسْتَقِيمِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 35,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا ٥٣\n                                    \n                                    \n                                    وقوله [ تعالى : ( وأوفوا الكيل إذا كلتم ) أي من غير تطفيف ولا تبخسوا الناس أشياءهم ( وزنوا بالقسطاس ) قرئ بضم القاف وكسرها كالقرطاس وهو الميزان وقال مجاهد هو العدل بالرومية\nوقوله : ( المستقيم ) أي الذي لا اعوجاج فيه ولا انحراف ولا اضطراب\n( ذلك خير ) أي لكم في معاشكم ومعادكم ولهذا قال : ( وأحسن تأويلا ) أي مآلا ومنقلبا في آخرتكم\nقال سعيد عن قتادة ( ذلك خير وأحسن تأويلا ) أي : خير ثوابا وعاقبة وأما ابن عباس كان يقول يا معشر الموالي إنكم وليتم أمرين بهما هلك الناس قبلكم هذا المكيال وهذا الميزان قال وذكر لنا أن نبي الله صلى الله عليه وسلم كان يقول لا يقدر رجل على حرام ثم يدعه ليس به إلا مخافة الله إلا أبدله الله في عاجل الدنيا قبل الآخرة ما هو خير له من ذلك \"\n                                    ",
        "qortoby": "وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا ٥٣\n                                    \n                                    \n                                    قوله تعالى : وأوفوا الكيل إذا كلتم وزنوا بالقسطاس المستقيم ذلك خير وأحسن تأويلا فيه مسألتان :\nالأولى : قوله تعالى : وأوفوا الكيل إذا كلتم أي بالاعتدال في الأخذ والعطاء عند البيع والشراء . وتقتضي هذه الآية أن الكيل على البائع ، وقد مضى في سورة [ يوسف ] فلا معنى للإعادة .\nوزنوا بالقسطاس المستقيم والقسطاس ( بضم القاف وكسرها ) : الميزان بلغة الروم ; قاله ابن عزيز . وقال الزجاج : القسطاس : الميزان صغيرا كان أو كبيرا . وقال مجاهد : القسطاس العدل ، وكان يقول : هي لغة رومية ، وكأن الناس قيل لهم : زنوا بمعدلة في وزنكم . وقرأ ابن كثير وأبو عمرو ونافع وابن عامر وعاصم في رواية أبي بكر \" القسطاس \" بضم القاف . وحمزة والكسائي وحفص عن عاصم ( بكسر القاف ) وهما لغتان .\nالثانية : قوله تعالى : ذلك خير وأحسن تأويلا أي وفاء الكيل وإقامة الوزن خير عند ربك وأبرك .\nوأحسن تأويلا أي عاقبة . قال الحسن : ذكر لنا أن رسول الله - صلى الله عليه وسلم - قال : لا يقدر رجل على حرام ثم يدعه ليس لديه إلا مخافة الله - تعالى - إلا أبدله الله في عاجل الدنيا قبل الآخرة ما هو خير له من ذلك .\n                                    ",
        "saadi": "وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا ٥٣\n                                        \n                                        \n                                        \n                                        وهذا أمر بالعدل وإيفاء المكاييل والموازين بالقسط من غير بخس ولا نقص.\nويؤخذ من عموم المعنى النهي عن كل غش في ثمن أو مثمن أو معقود عليه والأمر بالنصح والصدق في المعاملة.\n{ ذَلِكَ خَيْرٌ } من عدمه { وَأَحْسَنُ تَأْوِيلًا } أي: أحسن عاقبة به يسلم العبد من التبعات وبه تنزل البركة.\n                                    "
      },
      "originalText": "وَأَوۡفُواْ ٱلۡكَيۡلَ إِذَا كِلۡتُمۡ وَزِنُواْ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِيمِۚ ذَٰلِكَ خَيۡرٞ وَأَحۡسَنُ تَأۡوِيلٗا ٥٣"
    },
    {
      "number": 2065,
      "text": "وَلَا تَقْفُ مَا لَيْسَ لَكَ بِهِ عِلْمٌ ۚ إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولَٰئِكَ كَانَ عَنْهُ مَسْئُولًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 36,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَٰٓئِكَ كَانَ عَنۡهُ مَسۡ‍ُٔولٗا ٦٣\n                                    \n                                    \n                                    قال علي بن أبي طلحة عن ابن عباس يقول لا تقل\nوقال العوفي عنه لا ترم أحدا بما ليس لك به علم\nوقال محمد بن الحنفية يعني شهادة الزور\nوقال قتادة لا تقل رأيت ولم تر وسمعت ولم تسمع وعلمت ولم تعلم فإن الله سائلك عن ذلك كله\nومضمون ما ذكروه أن الله تعالى نهى عن القول بلا علم بل بالظن الذي هو التوهم والخيال كما قال تعالى : ( اجتنبوا كثيرا من الظن إن بعض الظن إثم ) [ الحجرات 12 ، وفي الحديث إياكم والظن فإن الظن أكذب الحديث \" وفي سنن أبي داود بئس مطية الرجل : زعموا ، وفي الحديث الآخر إن أفرى الفرى أن يري عينيه ما لم تريا \" وفي الصحيح من تحلم حلما كلف يوم القيامة أن يعقد بين شعيرتين وليس بعاقد .\nوقوله ( كل أولئك ) أي هذه الصفات من السمع والبصر والفؤاد ( كان عنه مسئولا ) أي سيسأل العبد عنها يوم القيامة وتسأل عنه وعما عمل فيها ويصح استعمال أولئك مكان \" تلك كما قال الشاعر .\nذم المنازل بعد منزلة اللوى والعيش بعد أولئك الأيام\n\n                                    ",
        "qortoby": "وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَٰٓئِكَ كَانَ عَنۡهُ مَسۡ‍ُٔولٗا ٦٣\n                                    \n                                    \n                                    قوله تعالى : ولا تقف ما ليس لك به علم إن السمع والبصر والفؤاد كل أولئك كان عنه مسئولا فيه ست مسائل :\nالأولى : ولا تقف أي لا تتبع ما لا تعلم ولا يعنيك . قال قتادة : لا تقل رأيت وأنت لم تر ، وسمعت وأنت لم تسمع ، وعلمت وأنت لم تعلم ; وقاله ابن عباس - رضي الله عنهما - . قال مجاهد : لا تذم أحدا بما ليس لك به علم ; وقاله ابن عباس - رضي الله عنهما - أيضا . وقال محمد ابن الحنفية : هي شهادة الزور . وقال القتبي : المعنى لا تتبع الحدس والظنون ; وكلها متقاربة . وأصل القفو البهت والقذف بالباطل ; ومنه قوله - عليه الصلاة والسلام - : نحن بنو النضر بن كنانة لا نقفو أمنا ولا ننتفي من أبينا أي لا نسب أمنا . وقال الكميت :\nفلا أرمي البريء بغير ذنب ولا أقفو الحواصن إن قفينا\nيقال : قفوته أقفوه ، وقفته أقوفه ، وقفيته إذا اتبعت أثره . ومنه القافة لتتبعهم الآثار وقافية كل شيء آخره ، ومنه قافية الشعر ; لأنها تقفو البيت . ومنه اسم النبي - صلى الله عليه وسلم - المقفي ; لأنه جاء آخر الأنبياء . ومنه القائف ، وهو الذي يتبع أثر الشبه . يقال : قاف القائف يقوف إذا فعل ذلك . وتقول : فقوت للأثر ، بتقديم الفاء على القاف . ابن عطية : ويشبه أن يكون هذا من تلعب العرب في بعض الألفاظ ; كما قالوا : رعملي في لعمري . وحكى الطبري عن فرقة أنها قالت : قفا وقاف ، مثل عتا وعات . وذهب منذر بن سعيد إلى أن قفا وقاف مثل جبذ وجذب . وبالجملة فهذه الآية تنهى عن قول الزور والقذف ، وما أشبه ذلك من الأقوال الكاذبة والرديئة . وقرأ بعض الناس فيما حكى الكسائي تقف بضم القاف وسكون الفاء . وقرأ الجراح \" والفآد \" بفتح الفاء ، وهي لغة لبعض الناس ، وأنكرها أبو حاتم وغيره .\nالثانية : قال ابن خويز منداد : تضمنت هذه الآية الحكم بالقافة ; لأنه لما قال : ولا تقف ما ليس لك به علم دل على جواز ما لنا به علم ، فكل ما علمه الإنسان أو غلب على ظنه جاز أن يحكم به ، وبهذا احتججنا على إثبات القرعة والخرص ; لأنه ضرب من غلبة الظن ، وقد يسمى علما اتساعا . فالقائف يلحق الولد بأبيه من طريق الشبه بينهما كما يلحق الفقيه الفرع بالأصل من طريق الشبه . وفي الصحيح عن عائشة : أن رسول الله - صلى الله عليه وسلم - دخل علي مسرورا تبرق أسارير وجهه فقال : ألم تر أن مجززا نظر إلى زيد بن حارثة وأسامة بن زيد عليهما قطيفة قد غطيا رءوسهما وبدت أقدامهما فقال إن بعض هذه الأقدام لمن بعض . وفي حديث يونس بن يزيد : ( وكان مجزز قائفا ) .\nالثالثة : قال الإمام أبو عبد الله المازري : كانت الجاهلية تقدح في نسب أسامة لكونه أسود شديد السواد ، وكان زيد أبوه أبيض من القطن ، هكذا ذكره أبو داود عن أحمد بن صالح . قال القاضي عياض : وقال غير أحمد كان زيد أزهر اللون ، وكان أسامة شديد الأدمة ; وزيد بن حارثة عربي صريح من كلب ، أصابه سباء ، حسبما يأتي في سورة [ الأحزاب ] إن شاء الله - تعالى - .\nالرابعة : استدل جمهور العلماء على الرجوع إلى القافة عند التنازع في الولد ، بسرور النبي - صلى الله عليه وسلم - بقول هذا القائف ; وما كان - عليه السلام - بالذي يسر بالباطل ولا يعجبه . ولم يأخذ بذلك أبو حنيفة وإسحاق والثوري وأصحابهم متمسكين بإلغاء النبي - صلى الله عليه وسلم - الشبه في حديث اللعان ; على ما يأتي في سورة [ النور ] إن شاء الله - تعالى - .\nالخامسة : واختلف الآخذون بأقوال القافة ، هل يؤخذ بذلك في أولاد الحرائر والإماء أو يختص بأولاد الإماء ، على قولين ; فالأول : قول الشافعي ومالك - رضي الله عنهما - في رواية ابن وهب عنه ، ومشهور مذهبه قصره على ولد الأمة . والصحيح ما رواه ابن وهب عنه وقال الشافعي - رضي الله عنه - ; لأن الحديث الذي هو الأصل في الباب إنما وقع في الحرائر ، فإن أسامة وأباه حران فكيف يلغى السبب الذي خرج عليه دليل الحكم وهو الباعث عليه ، هذا مما لا يجوز عند الأصوليين . وكذلك اختلف هؤلاء ، هل يكتفى بقول واحد من القافة أو لا بد من اثنين لأنها شهادة ; وبالأول قالابن القاسم وهو ظاهر الخبر بل نصه . وبالثاني قال مالك والشافعي - رضي الله عنهما - .\nالسادسة : قوله تعالى : إن السمع والبصر والفؤاد كل أولئك كان عنه مسئولا أي يسأل كل واحد منهم عما اكتسب ، فالفؤاد يسأل عما افتكر فيه واعتقده ، والسمع والبصر عما رأى من ذلك وسمع . وقيل : المعنى أن الله - سبحانه وتعالى - يسأل الإنسان عما حواه سمعه وبصره وفؤاده ; ونظيره قوله - صلى الله عليه وسلم - : كلكم راع وكلكم مسئول عن رعيته فالإنسان راع على جوارحه ; فكأنه قال : كل هذه كان الإنسان عنه مسئولا ، فهو على حذف مضاف . والمعنى الأول أبلغ في الحجة ; فإنه يقع تكذيبه من جوارحه ، وتلك غاية الخزي ; كما قال : اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون ، وقوله شهد عليهم سمعهم وأبصارهم وجلودهم بما كانوا يعملون . وعبر عن السمع والبصر والفؤاد بأولئك لأنها حواس لها إدراك ، وجعلها في هذه الآية مسئولة ، فهي حالة من يعقل ، فلذلك عبر عنها بأولئك . وقال سيبويه - رحمه الله - في قوله - تعالى - : رأيتهم لي ساجدين : إنما قال : رأيتهم في نجوم ، لأنه لما وصفها بالسجود وهو من فعل من يعقل عبر عنها بكناية من يعقل ; وقد تقدم . وحكى الزجاج أن العرب تعبر عما يعقل وعما لا يعقل بأولئك ، وأنشد هو والطبري :\nذم المنازل بعد منزلة اللوى والعيش بعد أولئك الأيام\nوهذا أمر يوقف عنده . وأما البيت فالرواية فيه \" الأقوام \" والله أعلم .\n                                    ",
        "saadi": "وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَٰٓئِكَ كَانَ عَنۡهُ مَسۡ‍ُٔولٗا ٦٣\n                                        \n                                        \n                                        \n                                        أي: ولا تتبع ما ليس لك به علم، بل تثبت في كل ما تقوله وتفعله، فلا تظن ذلك يذهب لا لك ولا عليك، { إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولَئِكَ كَانَ عَنْهُ مَسْئُولًا } فحقيق بالعبد الذي يعرف أنه مسئول عما قاله وفعله وعما استعمل به جوارحه التي خلقها الله لعبادته أن يعد للسؤال جوابا، وذلك لا يكون إلا باستعمالها بعبودية الله وإخلاص الدين له وكفها عما يكرهه الله تعالى.\n                                    "
      },
      "originalText": "وَلَا تَقۡفُ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُوْلَٰٓئِكَ كَانَ عَنۡهُ مَسۡ‍ُٔولٗا ٦٣"
    },
    {
      "number": 2066,
      "text": "وَلَا تَمْشِ فِي الْأَرْضِ مَرَحًا ۖ إِنَّكَ لَنْ تَخْرِقَ الْأَرْضَ وَلَنْ تَبْلُغَ الْجِبَالَ طُولًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 37,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا ٧٣\n                                    \n                                    \n                                    يقول تعالى ناهيا عباده عن التجبر والتبختر في المشية ( ولا تمش في الأرض مرحا ) أي متبخترا متمايلا مشي الجبارين ( إنك لن تخرق الأرض ) أي لن تقطع الأرض بمشيتك ؛ قاله ابن جرير واستشهد عليه بقول رؤبة بن العجاج\nوقاتم الأعماق خاوي المخترق\nوقوله [ تعالى : ( ولن تبلغ الجبال طولا ) أي بتمايلك وفخرك وإعجابك بنفسك بل قد يجازى فاعل ذلك بنقيض قصده كما ثبت في الصحيح بينما رجل يمشي فيمن كان قبلكم وعليه بردان يتبختر فيهما إذ خسف به الأرض فهو يتجلجل فيها إلى يوم القيامة \"\nوكذلك أخبر الله تعالى عن قارون أنه خرج على قومه في زينته وأن الله تعالى خسف به وبداره الأرض وفي الحديث من تواضع لله رفعه الله فهو في نفسه حقير وعند الناس كبير ومن استكبر وضعه الله فهو في نفسه كبير وعند الناس حقير حتى لهو أبغض إليهم من الكلب أو الخنزير \"\nوقال أبو بكر بن أبي الدنيا في كتاب الخمول والتواضع \" حدثنا أحمد بن إبراهيم بن كثير حدثنا حجاج بن محمد بن أبي بكر الهذلي قال بينما نحن مع الحسن إذ مر عليه ابن الأهتم يريد المنصور وعليه جباب خز قد نضد بعضها فوق بعض على ساقه وانفرج عنها قباؤه وهو يمشي ويتبختر إذ نظر إليه الحسن نظرة فقال أف أف شامخ بأنفه ثان عطفه مصعر خده ينظر في عطفيه أي حميق ينظر في عطفه في نعم غير مشكورة ولا مذكورة غير المأخوذ بأمر الله فيها ولا المؤدي حق الله منها! والله إن يمشي أحدهم طبيعته يتلجلج تلجلج المجنون في كل عضو منه نعمة وللشيطان به لعنة فسمعه ابن الأهتم فرجع يعتذر إليه فقال لا تعتذر إلي وتب إلى ربك أما سمعت قول الله تعالى ( ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا ) .\nورأى البختري العابد رجلا من آل علي يمشي وهو يخطر في مشيته فقال له يا هذا إن الذي أكرمك به لم تكن هذه مشيته! قال فتركها الرجل بعد\nورأى ابن عمر رجلا يخطر في مشيته فقال إن للشياطين إخوانا\nوقال خالد بن معدان إياكم والخطر فإن الرجل يده من سائر جسده رواهما ابن أبي الدنيا\nوقال ابن أبي الدنيا حدثنا خلف بن هشام البزار حدثنا حماد بن زيد عن يحيى عن سعيد عن يحنس قال قال رسول الله صلى الله عليه وسلم إذا مشت أمتي المطيطاء وخدمتهم فارس والروم سلط بعضهم على بعض \"\n                                    ",
        "qortoby": "وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا ٧٣\n                                    \n                                    \n                                    قوله تعالى : ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا\nفيه أربع مسائل :\nالأولى : ولا تمش في الأرض مرحا هذا نهي عن الخيلاء وأمر بالتواضع . والمرح : شدة الفرح . وقيل : التكبر في المشي . وقيل : تجاوز الإنسان قدره . وقال قتادة : هو الخيلاء في المشي . وقيل : هو البطر والأشر . وقيل : هو النشاط وهذه الأقوال متقاربة ولكنها منقسمة قسمين : أحدهما مذموم والآخر محمود ; فالتكبر والبطر والخيلاء وتجاوز الإنسان قدره مذموم والفرح والنشاط محمود . وقد وصف الله - تعالى - نفسه بأحدهما ; ففي الحديث الصحيح لله أفرح بتوبة العبد من رجل . . . الحديث . والكسل مذموم شرعا والنشاط ضده . وقد يكون التكبر وما في معناه محمودا ، وذلك على أعداء الله والظلمة . أسند أبو حاتم بن حبان عن ابن جابر بن عتيك عن أبيه عن رسول الله - صلى الله عليه وسلم - أنه قال : من الغيرة ما يبغض الله - عز وجل - ومنها ما يحب الله - عز وجل - ومن الخيلاء ما يحب الله - عز وجل - ومنها ما يبغض الله فأما الغيرة التي يحب الله الغيرة في الدين والغيرة التي يبغض الله الغيرة في غير دينه والخيلاء التي يحب الله اختيال الرجل بنفسه عند القتال وعند الصدقة والاختيال الذي يبغض الله الخيلاء في الباطل وأخرجه أبو داود في مصنفه وغيره . وأنشدوا :\nولا تمش فوق الأرض إلا تواضعا فكم تحتها قوم همو منك أرفع وإن كنت في عز وحرز ومنعة\nفكم مات من قوم همو منك أمنع\nالثانية : إقبال الإنسان على الصيد ونحوه ترفعا دون حاجة إلى ذلك داخل في هذه الآية ، وفيه تعذيب الحيوان وإجراؤه لغير معنى . وأما الرجل يستريح في اليوم النادر والساعة من يومه ، ويجم فيها نفسه في التطرح والراحة ليستعين بذلك على شغل من البر ، كقراءة علم أو صلاة ، فليس بداخل في هذه الآية .\nقوله تعالى : مرحا قراءة الجمهور بفتح الراء . وقراءة فرقة فيما حكى يعقوب بكسر الراء على بناء اسم الفاعل . والأول أبلغ ، فإن قولك : جاء زيد ركضا أبلغ من قولك : جاء زيد راكضا ; فكذلك قولك مرحا . والمرح المصدر أبلغ من أن يقال مرحا .\nالثالثة : قوله تعالى : إنك لن تخرق الأرض يعني لن تتولج باطنها فتعلم ما فيها ولن تبلغ الجبال طولا أي لن تساوي الجبال بطولك ولا تطاولك . ويقال : خرق الثوب أي شقه ، وخرق الأرض قطعها . والخرق : الواسع من الأرض . أي لن تخرق الأرض بكبرك ومشيك عليها . ولن تبلغ الجبال طولا بعظمتك ، أي بقدرتك لا تبلغ هذا المبلغ ، بل أنت عبد ذليل ، محاط بك من تحتك ومن فوقك ، والمحاط محصور ضعيف ، فلا يليق بك التكبر .\nوالمراد بخرق الأرض هنا نقبها لا قطعها بالمسافة ; والله أعلم . وقال الأزهري : معناه لن تقطعها . النحاس : وهذا أبين ; لأنه مأخوذ من الخرق وهي الصحراء الواسعة . ويقال : فلان أخرق من فلان ، أي أكثر سفرا وعزة ومنعة . ويروى أن سبأ دوخ الأرض بأجناده شرقا وغربا وسهلا وجبلا ، وقتل سادة وسبى - وبه سمي سبأ - ودان له الخلق ، فلما رأى ذلك انفرد عن أصحابه ثلاثة أيام ثم خرج إليهم فقال : إني لما نلت ما لم ينل أحد رأيت الابتداء بشكر هذه النعم ، فلم أر أوقع في ذلك من السجود للشمس إذا أشرقت ، فسجدوا لها ، وكان ذلك أول عبادة الشمس ; فهذه عاقبة الخيلاء والتكبر والمرح ; نعوذ بالله من ذلك .\n                                    ",
        "saadi": "وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا ٧٣\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وَلَا تَمْشِ فِي الْأَرْضِ مَرَحًا } أي: كبرا وتيها وبطرا متكبرا على الحق ومتعاظما على الخلق.\n{ إِنَّكَ } في فعلك ذلك { لَنْ تَخْرِقَ الْأَرْضَ وَلَنْ تَبْلُغَ الْجِبَالَ طُولًا } في تكبرك بل تكون حقيرا عند الله ومحتقرا عند الخلق مبغوضا ممقوتا قد اكتسبت أشر الأخلاق واكتسيت أرذلها من غير إدراك لبعض ما تروم.\n                                    "
      },
      "originalText": "وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا ٧٣"
    },
    {
      "number": 2067,
      "text": "كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُ عِنْدَ رَبِّكَ مَكْرُوهًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 38,
      "juz": 15,
      "manzil": 4,
      "page": 285,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا ٨٣\n                                    \n                                    \n                                    وقوله تعالى : ( كل ذلك كان سيئه عند ربك مكروها ) أما من قرأ سيئة أي : فاحشة فمعناه عنده كل هذا الذي نهينا عنه من قوله : ( ولا تقتلوا أولادكم خشية إملاق ) إلى هاهنا فهو سيئة مؤاخذ عليها ( مكروها ) عند الله لا يحبه ولا يرضاه\nوأما من قرأ ( سيئه ) على الإضافة فمعناه عنده كل هذا الذي ذكرناه من قوله ( وقضى ربك ألا تعبدوا إلا إياه ) إلى هاهنا فسيئه أي فقبيحه مكروه عند الله هكذا وجه ذلك ابن جرير رحمه الله .\n                                    ",
        "qortoby": "كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا ٨٣\n                                    \n                                    \n                                    قوله تعالى : كل ذلك كان سيئه عند ربك مكروها ذلك إشارة إلى جملة ما تقدم ذكره مما أمر به ونهى عنه . ذلك يصلح للواحد والجمع والمؤنث والمذكر . وقرأ عاصم وابن عامر وحمزة والكسائي ومسروق سيئه على إضافة سيئ إلى الضمير ، ولذلك قال : مكروها نصب على خبر كان . والسيء : هو المكروه ، وهو الذي لا يرضاه الله - عز وجل - ولا يأمر به . وقد ذكر الله - سبحانه وتعالى - في هذه الآي من قوله : وقضى ربك - إلى قوله - \" كان سيئه \" مأمورات بها ومنهيات عنها ، فلا يخبر عن الجميع بأنه سيئة فيدخل المأمور به في المنهي عنه . واختار هذه القراءة أبو عبيد . ولأن في قراءة أبي \" كل ذلك كان سيئاته \" فهذه لا تكون إلا للإضافة . وقرأ ابن كثير ونافع وأبو عمرو سيئة بالتنوين ; أي كل ما نهى الله ورسوله عنه سيئة . وعلى هذا انقطع الكلام عند قوله : وأحسن تأويلا ثم قال : ولا تقف ما ليس لك به علم ، ولا تمش ، ثم قال : كل ذلك كان سيئة بالتنوين . وقيل : إن قوله ولا تقتلوا أولادكم إلى هذه الآية كان سيئة لا حسنة فيه ، فجعلوا كلا محيطا بالمنهي عنه دون غيره . وقوله : مكروها ليس نعتا لسيئة ، بل هو بدل منه ; والتقدير : كان سيئة وكان مكروها . وقد قيل : إن مكروها خبر ثان لكان حمل على لفظه كل ، و \" سيئة \" محمول على المعنى في جميع هذه الأشياء المذكورة قبل . وقال بعضهم : وهو نعت لسيئة ; لأنه لما كان تأنيثها غير حقيقي جاز أن توصف بمذكر . وضعف أبو علي الفارسي هذا وقال : إن المؤنث إذا ذكر فإنما ينبغي أن يكون ما بعده مذكرا ، وإنما التساهل أن يتقدم الفعل المسند إلى المؤنث وهو في صيغة ما يسند إلى المذكر ; ألا ترى قول الشاعر :\nفلا مزنة ودقت ودقها ولا أرض أبقل إبقالها\nمستقبح عندهم . ولو قال قائل : أبقل أرض لم يكن قبيحا . قال أبو علي : ولكن يجوز في قوله مكروها أن يكون بدلا من \" سيئة \" . ويجوز أن يكون حالا من الضمير الذي في عند ربك ويكون عند ربك في موضع الصفة لسيئة .\nاستدل العلماء بهذه الآية على ذم الرقص وتعاطيه . قال الإمام أبو الوفاء ابن عقيل : قد نص القرآن على النهي عن الرقص فقال : ولا تمش في الأرض مرحا وذم المختال . والرقص أشد المرح والبطر . أولسنا الذين قسنا النبيذ على الخمر لاتفاقهما في الإطراب والسكر ، فما بالنا لا نقيس القضيب وتلحين الشعر معه على الطنبور والمزمار والطبل لاجتماعهما . فما أقبح من ذي لحية ، وكيف إذا كان شيبة ، يرقص ويصفق على إيقاع الألحان والقضبان ، وخصوصا إن كانت أصوات لنسوان ومردان ، وهل يحسن لمن بين يديه الموت والسؤال والحشر والصراط ، ثم هو إلى إحدى الدارين ، يشمس بالرقص شمس البهائم ، ويصفق تصفيق النسوان ، ولقد رأيت مشايخ في عمري ما بان لهم سن من التبسم فضلا عن الضحك مع إدمان مخالطتي لهم وقال أبو الفرج ابن الجوزي - رحمه الله - : ولقد حدثني بعض المشايخ عن الإمام الغزالي - رضي الله عنه - أنه قال : الرقص حماقة بين الكتفين لا تزول إلا باللعب . وسيأتي لهذا الباب مزيد بيان في [ الكهف ] وغيرها إن شاء الله - تعالى - .\n                                    ",
        "saadi": "كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا ٨٣\n                                        \n                                        \n                                        \n                                        { كُلُّ ذَلِكَ } المذكور الذي نهى الله عنه فيما تقدم من قوله: { وَلَا تَجْعَلْ مَعَ اللَّهِ إِلَهًا آخَرَ } والنهي عن عقوق الوالدين وما عطف على ذلك { كَانَ سَيِّئُهُ عِنْدَ رَبِّكَ مَكْرُوهًا } أي: كل ذلك يسوء العاملين ويضرهم والله تعالى يكرهه ويأباه.\n                                    "
      },
      "originalText": "كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهٗا ٨٣"
    }
  ]
}