{
  "number": 286,
  "ayahsNumber": 11,
  "ayahs": [
    {
      "number": 2068,
      "text": "ذَٰلِكَ مِمَّا أَوْحَىٰ إِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِ ۗ وَلَا تَجْعَلْ مَعَ اللَّهِ إِلَٰهًا آخَرَ فَتُلْقَىٰ فِي جَهَنَّمَ مَلُومًا مَدْحُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 39,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا ٩٣\n                                    \n                                    \n                                    يقول تعالى هذا الذي أمرناك به من الأخلاق الجميلة ونهيناك عنه من الصفات الرذيلة مما أوحينا إليك يا محمد لتأمر به الناس\n( ولا تجعل مع الله إلها آخر فتلقى في جهنم ملوما ) أي تلومك نفسك ويلومك الله والخلق . ( مدحورا ) . قال ابن عباس وقتادة مطرودا\nوالمراد من هذا الخطاب الأمة بواسطة الرسول صلى الله عليه وسلم فإنه صلوات الله وسلامه عليه معصوم\n                                    ",
        "qortoby": "ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا ٩٣\n                                    \n                                    \n                                    قوله تعالى : ذلك مما أوحى إليك ربك من الحكمة ولا تجعل مع الله إلها آخر فتلقى في جهنم ملوما مدحورا\nالإشارة بذلك إلى هذه الآداب والقصص والأحكام التي تضمنتها هذه الآيات المتقدمة التي نزل بها جبريل - عليه السلام - . أي هذه من الأفعال المحكمة التي تقتضيها حكمة الله - عز وجل - في عباده ، وخلقها لهم من محاسن الأخلاق والحكمة وقوانين المعاني المحكمة والأفعال الفاضلة . ثم عطف قوله ولا تجعل على ما تقدم من النواهي . والخطاب للنبي - صلى الله عليه وسلم - المراد كل من سمع الآية من البشر . والمدحور : المهان المبعد المقصى . وقد تقدم في هذه السورة . ويقال في الدعاء : اللهم ادحر عنا الشيطان ; أي أبعده .\n                                    ",
        "saadi": "ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا ٩٣\n                                        \n                                        \n                                        \n                                        { ذَلِكَ } الذي بيناه ووضحناه من هذه الأحكام الجليلة، { مِمَّا أَوْحَى إِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِ } فإن الحكمة الأمر بمحاسن الأعمال ومكارم الأخلاق والنهي عن أراذل الأخلاق وأسوأ الأعمال.\nوهذه الأعمال المذكورة في هذه الآيات من الحكمة العالية التي أوحاها رب العالمين لسيد المرسلين في أشرف الكتب ليأمر بها أفضل الأمم فهي من الحكمة التي من أوتيها فقد أوتي خيرا كثيرا.\nثم ختمها بالنهي عن عبادة غير الله كما افتتحها بذلك فقال: { وَلَا تَجْعَلْ مَعَ اللَّهِ إِلَهًا آخَرَ فَتُلْقَى فِي جَهَنَّمَ } أي: خالدا مخلدا فإنه من يشرك بالله فقد حرم الله عليه الجنة ومأواه النار.\n{ مَلُومًا مَدْحُورًا } أي: قد لحقتك اللائمة واللعنة والذم من الله وملائكته والناس أجمعين.\n                                    "
      },
      "originalText": "ذَٰلِكَ مِمَّآ أَوۡحَىٰٓ إِلَيۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَتُلۡقَىٰ فِي جَهَنَّمَ مَلُومٗا مَّدۡحُورًا ٩٣"
    },
    {
      "number": 2069,
      "text": "أَفَأَصْفَاكُمْ رَبُّكُمْ بِالْبَنِينَ وَاتَّخَذَ مِنَ الْمَلَائِكَةِ إِنَاثًا ۚ إِنَّكُمْ لَتَقُولُونَ قَوْلًا عَظِيمًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 40,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 243,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا ٠٤\n                                    \n                                    \n                                    يقول تعالى رادا على المشركين الكاذبين الزاعمين عليهم لعائن الله أن الملائكة بنات الله فجعلوا الملائكة الذين هم عباد الرحمن إناثا ثم ادعوا أنهم بنات الله ثم عبدوهم فأخطئوا في كل من المقامات الثلاث خطأ عظيما قال تعالى منكرا عليهم ( أفأصفاكم ربكم بالبنين ) أي خصصكم بالذكور ( واتخذ من الملائكة إناثا ) أي اختار لنفسه على زعمكم البنات ثم شدد الإنكار عليهم فقال ( إنكم لتقولون قولا عظيما ) أي في زعمكم لله ولدا ثم جعلكم ولده الإناث التي تأنفون أن يكن لكم وربما قتلتموهن بالوأد فتلك إذا قسمة ضيزى وقال الله تعالى : ( وقالوا اتخذ الرحمن ولدا لقد جئتم شيئا إدا تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا أن دعوا للرحمن ولدا وما ينبغي للرحمن أن يتخذ ولدا إن كل من في السماوات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا ) [ مريم 88 - 95 .\n                                    ",
        "qortoby": "أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا ٠٤\n                                    \n                                    \n                                    قوله تعالى : أفأصفاكم ربكم بالبنين واتخذ من الملائكة إناثا إنكم لتقولون قولا عظيما هذا يرد على من قال من العرب : الملائكة بنات الله ، وكان لهم بنات أيضا مع النبيين ، ولكنه أراد : أفأخلص لكم البنين دونه وجعل البنات مشتركة بينكم وبينه .s\nإنكم لتقولون قولا عظيما أي في الإثم عند الله - عز وجل - .\n                                    ",
        "saadi": "أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا ٠٤\n                                        \n                                        \n                                        \n                                        وهذا إنكار شديد على من زعم أن الله اتخذ من خلقه بنات فقال: { أَفَأَصْفَاكُمْ رَبُّكُمْ بِالْبَنِينَ } أي: اختار لكم الصفوة والقسم الكامل واتخذ لنفسه من الملائكة إناثا حيث زعموا أن الملائكة بنات الله.s\n{ إِنَّكُمْ لَتَقُولُونَ قَوْلًا عَظِيمًا } فيه أعظم الجرأة على الله حيث نسبتم له الولد المتضمن لحاجته واستغناء بعض المخلوقات عنه وحكمتم له بأردأ القسمين، وهن الإناث وهو الذي خلقكم واصطفاكم بالذكور فتعالى الله عما يقول الظالمون علوا كبيرا.\n                                    "
      },
      "originalText": "أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِينَ وَٱتَّخَذَ مِنَ ٱلۡمَلَٰٓئِكَةِ إِنَٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِيمٗا ٠٤"
    },
    {
      "number": 2070,
      "text": "وَلَقَدْ صَرَّفْنَا فِي هَٰذَا الْقُرْآنِ لِيَذَّكَّرُوا وَمَا يَزِيدُهُمْ إِلَّا نُفُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 41,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا ١٤\n                                    \n                                    \n                                    يقول تعالى ( ولقد صرفنا في هذا القرآن ليذكروا ) أي صرفنا فيه من الوعيد لعلهم يذكرون ما فيه من الحجج والبينات والمواعظ فينزجروا عما هم فيه من الشرك والظلم والإفك ( وما يزيدهم ) أي الظالمين منهم ( إلا نفورا ) أي عن الحق وبعدا منه\n                                    ",
        "qortoby": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا ١٤\n                                    \n                                    \n                                    قوله تعالى : ولقد صرفنا في هذا القرآن ليذكروا وما يزيدهم إلا نفورا قوله تعالى : ولقد صرفنا أي بينا . وقيل كررنا . والتصريف : صرف الشيء من جهة إلى جهة . والمراد بهذا التصريف البيان والتكرير . وقيل : المغايرة ; أي غايرنا بين المواعظ ليذكروا ويعتبروا ويتعظوا . وقراءة العامة صرفنا بالتشديد على التكثير حيث وقع . وقرأ الحسن بالتخفيف . قال الثعلبي : سمعت أبا القاسم الحسين يقول بحضرة الإمام الشيخ أبي الطيب : لقوله - تعالى - : \" صرفنا \" معنيان ; أحدهما لم يجعله نوعا واحدا بل وعدا ووعيدا ومحكما ومتشابها ونهيا وأمرا وناسخا ومنسوخا وأخبارا وأمثالا ; مثل تصريف الرياح من صبا ودبور وجنوب وشمال ، وتصريف الأفعال من الماضي والمستقبل والأمر والنهي والفعل والفاعل والمفعول ونحوها . والثاني أنه لم ينزل مرة واحدة بل نجوما ; نحو قوله وقرآنا فرقناه ومعناه : أكثرنا صرف جبريل - عليه السلام - إليك .\nفي هذا القرآن قيل في زائدة ، والتقدير : ولقد صرفنا هذا القرآن ; مثل وأصلح لي في ذريتي أي أصلح ذريتي . وقوله في هذا القرآن يعني الأمثال والعبر والحكم والمواعظ والأحكام والإعلام .\nليذكروا قراءة يحيى والأعمش وحمزة والكسائي \" ليذكروا \" مخففا ، وكذلك في الفرقان ولقد صرفناه بينهم ليذكروا . الباقون بالتشديد . واختاره أبو عبيد ; لأن معناه ليتذكروا وليتعظوا . قال المهدوي : من شدد ليذكروا أراد التدبر . وكذلك من قرأ ليذكروا . ونظير الأول ولقد وصلنا لهم القول لعلهم يتذكرون والثاني : واذكروا ما فيه\nوما يزيدهم أي التصريف والتذكير .\nإلا نفورا أي تباعدا عن الحق وغفلة عن النظر والاعتبار ; وذلك لأنهم اعتقدوا في القرآن أنه حيلة وسحر وكهانة وشعر .\n                                    ",
        "saadi": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا ١٤\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه صرف لعباده في هذا القرآن أي: نوع الأحكام ووضحها وأكثر من الأدلة والبراهين على ما دعا إليه، ووعظ وذكر لأجل أن يتذكروا ما ينفعهم فيسلكوه وما يضرهم فيدعوه.\nولكن أبى أكثر الناس إلا نفورا عن آيات الله لبغضهم للحق ومحبتهم ما كانوا عليه من الباطل حتى تعصبوا لباطلهم ولم يعيروا آيات الله لهم سمعا ولا ألقوا لها بالا.\nومن أعظم ما صرف فيه الآيات والأدلة التوحيد الذي هو أصل الأصول، فأمر به ونهى عن ضده وأقام عليه من الحجج العقلية والنقلية شيئا كثيرا بحيث من أصغى إلى بعضها لا تدع في قلبه شكا ولا ريبا.\n                                    "
      },
      "originalText": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِيَذَّكَّرُواْ وَمَا يَزِيدُهُمۡ إِلَّا نُفُورٗا ١٤"
    },
    {
      "number": 2071,
      "text": "قُلْ لَوْ كَانَ مَعَهُ آلِهَةٌ كَمَا يَقُولُونَ إِذًا لَابْتَغَوْا إِلَىٰ ذِي الْعَرْشِ سَبِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 42,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا ٢٤\n                                    \n                                    \n                                    يقول تعالى قل يا محمد لهؤلاء المشركين الزاعمين أن لله شريكا من خلقه العابدين معه غيره ليقربهم إليه زلفى لو كان الأمر كما تقولون وأن معه آلهة تعبد لتقرب إليه وتشفع لديه لكان أولئك المعبودون يعبدونه ويتقربون إليه ويبتغون إليه الوسيلة والقربة فاعبدوه أنتم وحده كما يعبده من تدعونه من دونه ولا حاجة لكم إلى معبود يكون واسطة بينكم وبينه فإنه لا يحب ذلك ولا يرضاه بل يكرهه ويأباه وقد نهى عن ذلك على ألسنة جميع رسله وأنبيائه\n                                    ",
        "qortoby": "قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا ٢٤\n                                    \n                                    \n                                    قوله تعالى : قل لو كان معه آلهة كما يقولون إذا لابتغوا إلى ذي العرش سبيلا سبحانه وتعالى عما يقولون علوا كبيرا قوله تعالى : قل لو كان معه آلهة هذا متصل بقوله - تعالى - : ولا تجعل مع الله إلها آخر وهو رد على عباد الأصنام .\nكما يقولون قرأ ابن كثير وحفص يقولون بالياء . الباقون \" تقولون \" بالتاء على الخطاب .\nإذا لابتغوا يعني الآلهة .\nإلى ذي العرش سبيلا قال ابن العباس - رضي الله - تعالى - عنهما - : لطلبوا مع الله منازعة وقتالا كما تفعل ملوك الدنيا بعضهم ببعض . وقال سعيد بن جبير - رضي الله تعالى عنه - : المعنى إذا لطلبوا طريقا إلى الوصول إليه ليزيلوا ملكه ، لأنهم شركاؤه . وقال قتادة : المعنى إذا لابتغت الآلهة القربة إلى ذي العرش سبيلا ، والتمست الزلفة عنده لأنهم دونه ، والقوم اعتقدوا أن الأصنام تقربهم إلى الله زلفى ، فإذا اعتقدوا في الأصنام أنها محتاجة إلى الله - سبحانه وتعالى - فقد بطل أنها آلهة .\n                                    ",
        "saadi": "قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا ٢٤\n                                        \n                                        \n                                        \n                                        { قُلْ } للمشركين الذين يجعلون مع الله إلها آخر: { لَوْ كَانَ مَعَهُ آلِهَةٌ كَمَا يَقُولُونَ } أي: على موجب زعمهم وافترائهم { إِذًا لَابْتَغَوْا إِلَى ذِي الْعَرْشِ سَبِيلًا } أي: لاتخذوا سبيلا إلى الله بعبادته والإنابة إليه والتقرب وابتغاء الوسيلة، فكيف يجعل العبد الفقير الذي يرى شدة افتقاره لعبودية ربه إلها مع الله؟! هل هذا إلا من أظلم الظلم وأسفه السفه؟\".\nفعلى هذا المعنى تكون هذه الآية كقوله تعالى: { أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ }\nوكقوله تعالى: { وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُونَ مِنْ دُونِ اللَّهِ فَيَقُولُ أَأَنْتُمْ أَضْلَلْتُمْ عِبَادِي هَؤُلَاءِ أَمْ هُمْ ضَلُّوا السَّبِيلَ قَالُوا سُبْحَانَكَ مَا كَانَ يَنْبَغِي لَنَا أَنْ نَتَّخِذَ مِنْ دُونِكَ مِنْ أَوْلِيَاءَ }\nويحتمل أن المعنى في قوله: { قُلْ لَوْ كَانَ مَعَهُ آلِهَةٌ كَمَا يَقُولُونَ إِذًا لَابْتَغَوْا إِلَى ذِي الْعَرْشِ سَبِيلًا } أي: لطلبوا السبيل وسعوا في مغالبة الله تعالى، فإما أن يعلوا عليه فيكون من علا وقهر هو الرب الإله، فأما وقد علموا أنهم يقرون أن آلهتهم التي يعبدون من دون الله مقهورة مغلوبة ليس لها من الأمر شيء فلم اتخذوها وهي بهذه الحال؟ فيكون هذا كقوله تعالى: { مَا اتَّخَذَ اللَّهُ مِنْ وَلَدٍ وَمَا كَانَ مَعَهُ مِنْ إِلَهٍ إِذًا لَذَهَبَ كُلُّ إِلَهٍ بِمَا خَلَقَ وَلَعَلَا بَعْضُهُمْ عَلَى بَعْضٍ }\n                                    "
      },
      "originalText": "قُل لَّوۡ كَانَ مَعَهُۥٓ ءَالِهَةٞ كَمَا يَقُولُونَ إِذٗا لَّٱبۡتَغَوۡاْ إِلَىٰ ذِي ٱلۡعَرۡشِ سَبِيلٗا ٢٤"
    },
    {
      "number": 2072,
      "text": "سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يَقُولُونَ عُلُوًّا كَبِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 43,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا ٣٤\n                                    \n                                    \nثم نزه نفسه الكريمة وقدسها فقال ( سبحانه وتعالى عما يقولون ) أي هؤلاء المشركون المعتدون الظالمون في زعمهم أن معه آلهة أخرى ( علوا كبيرا ) أي تعاليا كبيرا بل هو الله الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد\n                                    ",
        "qortoby": "سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا ٣٤\n                                    \n                                    \n                                    سبحانه وتعالى عما يقولون علوا كبيرا نزه - سبحانه - نفسه وقدسه ومجده عما لا يليق به . والتسبيح : التنزيه . وقد تقدم .\n                                    ",
        "saadi": "سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا ٣٤\n                                        \n                                        \n                                        \n                                        { سُبْحَانَهُ وَتَعَالَى } أي: تقدس وتنزه وعلت أوصافه { عَمَّا يَقُولُونَ } من الشرك به واتخاذ الأنداد معه { عُلُوًّا كَبِيرًا } فعلا قدره وعظم وجلت كبرياؤه التي لا تقادر أن يكون معه آلهة فقد ضل من قال ذلك ضلالا مبينا وظلم ظلما كبيرا.\nلقد تضاءلت لعظمته المخلوقات العظيمة وصغرت لدى كبريائه السماوات السبع ومن فيهن والأرضون السبع ومن فيهن { والأرض جميعا قبضته يوم القيامة والسماوات مطويات بيمينه }\nوافتقر إليه العالم العلوي والسفلي فقرا ذاتيا لا ينفك عن أحد منهم في وقت من الأوقات.هذا الفقر بجميع وجوهه فقر من جهة الخلق والرزق والتدبير، وفقر من جهة الاضطرار إلى أن يكون معبودهم ومحبوبهم الذي إليه يتقربون وإليه في كل حال يفزعون\n                                    "
      },
      "originalText": "سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يَقُولُونَ عُلُوّٗا كَبِيرٗا ٣٤"
    },
    {
      "number": 2073,
      "text": "تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالْأَرْضُ وَمَنْ فِيهِنَّ ۚ وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَٰكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ ۗ إِنَّهُ كَانَ حَلِيمًا غَفُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 44,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا ٤٤\n                                    \n                                    \n                                    يقول تعالى تقدسه السموات السبع والأرض ومن فيهن أي من المخلوقات وتنزهه وتعظمه وتجله وتكبره عما يقول هؤلاء المشركون وتشهد له بالوحدانية في ربوبيته وإلهيته\nففي كل شيء له آية تدل على أنه واحد\nكما قال تعالى : ( تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا أن دعوا للرحمن ولدا وما ينبغي للرحمن أن يتخذ ولدا ) [ مريم 90 - 92 .\nوقال أبو القاسم الطبراني حدثنا علي بن عبد العزيز حدثنا سعيد بن منصور حدثنا مسكين بن ميمون مؤذن مسجد الرملة حدثنا عروة بن رويم عن عبد الرحمن بن قرط أن رسول الله صلى الله عليه وسلم ليلة أسري إلى المسجد الأقصى كان بين المقام وزمزم جبريل عن يمينه وميكائيل عن يساره فطار به حتى بلغ السماوات السبع ، فلما رجع قال سمعت تسبيحا في السماوات العلى مع تسبيح كثير سبحت السماوات العلى من ذي المهابة مشفقات لذي العلو بما علا سبحان العلي الأعلى سبحانه وتعالى .\nوقوله ( وإن من شيء إلا يسبح بحمده ) أي وما من شيء من المخلوقات إلا يسبح بحمد الله ( ولكن لا تفقهون تسبيحهم ) أي لا تفقهون تسبيحهم أيها الناس لأنها بخلاف لغتكم وهذا عام في الحيوانات والنبات والجماد وهذا أشهر القولين كما ثبت في صحيح البخاري عن ابن مسعود أنه قال كنا نسمع تسبيح الطعام وهو يؤكل .\nوفي حديث أبي ذر أن النبي صلى الله عليه وسلم أخذ في يده حصيات فسمع لهن تسبيح كحنين النحل وكذا يد أبي بكر وعمر وعثمان رضي الله عنهم [ أجمعين ، وهو حديث مشهور في المسانيد .\nوقال الإمام أحمد حدثنا ابن لهيعة حدثنا زبان عن سهل بن معاذ بن أنس عن أبيه رضي الله عنه عن رسول الله صلى الله عليه وسلم أنه مر على قوم وهم وقوف على دواب لهم ورواحل فقال لهم اركبوها سالمة ودعوها سالمة ولا تتخذوها كراسي لأحاديثكم في الطرق والأسواق فرب مركوبة خير من راكبها وأكثر ذكرا لله منه .\nوفي سنن النسائي عن عبد الله بن عمرو قال نهى رسول الله صلى الله عليه وسلم عن قتل الضفدع وقال نقيقها تسبيح \"\nوقال قتادة عن عبد الله بن بابي ، عن عبد الله بن عمرو أن الرجل إذا قال لا إله إلا الله فهي كلمة الإخلاص التي لا يقبل الله من أحد عملا حتى يقولها وإذا قال الحمد لله فهي كلمة الشكر التي لم يشكر الله عبد قط حتى يقولها وإذا قال الله أكبر فهي تملأ ما بين السماء والأرض وإذا قال سبحان الله فهي صلاة الخلائق التي لم يدع الله أحد من خلقه إلا قرره بالصلاة والتسبيح وإذا قال لا حول ولا قوة إلا بالله \" قال أسلم عبدي واستسلم\nوقال الإمام أحمد حدثنا وهب بن جرير حدثنا أبي ، سمعت الصقعب بن زهير يحدث ] عن زيد بن أسلم عن عطاء بن يسار عن عبد الله بن عمرو قال أتى النبي صلى الله عليه وسلم أعرابي عليه جبة من طيالسة مكفوفة بديباج أو مزورة بديباج - فقال إن صاحبكم هذا يريد أن يرفع كل راع ابن راع ويضع كل رأس ابن رأس فقام إليه النبي صلى الله عليه وسلم مغضبا فأخذ بمجامع جبته فاجتذبه ، فقال لا أرى عليك ثياب من لا يعقل ثم رجع رسول الله صلى الله عليه وسلم فجلس فقال إن نوحا عليه السلام لما حضرته الوفاة دعا ابنيه فقال إني قاص عليكما الوصية آمركما باثنتين وأنهاكما عن اثنتين أنهاكما عن الشرك بالله والكبر وآمركما بلا إله إلا الله فإن السماوات والأرض وما بينهما لو وضعت في كفة الميزان ووضعت لا إله إلا الله في الكفة الأخرى كانت أرجح ولو أن السماوات والأرض كانتا حلقة فوضعت لا إله إلا الله عليهما لفصمتهما أو لقصمتهما وآمركما بسبحان الله وبحمده فإنها صلاة كل شيء وبها يرزق كل شيء \"\nورواه الإمام أحمد أيضا ، عن سليمان بن حرب عن حماد بن زيد عن الصقعب بن زهير به أطول من هذا تفرد به .\nوقال ابن جرير حدثني نصر بن عبد الرحمن الأودي حدثنا محمد بن يعلى عن موسى بن عبيدة عن زيد بن أسلم عن جابر بن عبد الله رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم ألا أخبركم بشيء أمر به نوح ابنه إن نوحا عليه السلام قال لابنه يا بني آمرك أن تقول سبحان الله فإنها صلاة الخلق وتسبيح الخلق وبها يرزق الخلق قال الله تعالى : ( وإن من شيء إلا يسبح بحمده ) إسناده فيه ضعف فإن الربذي ضعيف عند الأكثرين\nوقال عكرمة في قوله تعالى ( وإن من شيء إلا يسبح بحمده ) قال : الأسطوانة تسبح ، والشجرة تسبح - الأسطوانة السارية\nوقال بعض السلف : إن صرير الباب تسبيحه وخرير الماء تسبيحه قال الله تعالى : ( وإن من شيء إلا يسبح بحمده )\nوقال سفيان الثوري عن منصور عن إبراهيم قال الطعام يسبح\nويشهد لهذا القول آية السجدة أول سورة الحج\nوقال آخرون إنما يسبح ما كان فيه روح يعنون من حيوان أو نبات\nوقال قتادة في قوله ( وإن من شيء إلا يسبح بحمده ) قال : كل شيء فيه الروح يسبح من شجر أو شيء فيه\nوقال الحسن ، والضحاك في قوله : ( وإن من شيء إلا يسبح بحمده ) قالا : كل شيء فيه الروح\nوقال ابن جرير حدثنا محمد بن حميد حدثنا يحيى بن واضح وزيد بن حباب قالا : حدثنا جرير أبو الخطاب قال كنا مع يزيد الرقاشي ومعه الحسن في طعام فقدموا الخوان فقال يزيد الرقاشي يا أبا سعيد يسبح هذا الخوان ؟ فقال كان يسبح مرة .\nقلت الخوان هو المائدة من الخشب فكأن الحسن رحمه الله ذهب إلى أنه لما كان حيا فيه خضرة كان يسبح فلما قطع وصار خشبة يابسة انقطع تسبيحه وقد يستأنس لهذا القول بحديث ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم مر بقبرين فقال إنهما ليعذبان وما يعذبان في كبير ؛ أما أحدهما فكان لا يستتر من البول وأما الآخر فكان يمشي بالنميمة ثم أخذ جريدة رطبة فشقها نصفين ثم غرز في كل قبر واحدة ثم قال لعله يخفف عنهما ما لم ييبسا أخرجاه في الصحيحين .\nقال بعض من تكلم على هذا الحديث من العلماء إنما قال ما لم ييبسا لأنهما يسبحان ما دام فيهما خضرة فإذا يبسا انقطع تسبيحهما والله أعلم\nوقوله تعالى ] ( إنه كان حليما غفورا ) أي إنه [ تعالى لا يعاجل من عصاه بالعقوبة بل يؤجله وينظره فإن استمر على كفره وعناده أخذه أخذ عزيز مقتدر كما جاء في الصحيحين إن الله ليملي للظالم حتى إذا أخذه لم يفلته ثم قرأ رسول الله صلى الله عليه وسلم ( وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد ) [ هود 102 ] الآية ، وقال الله تعالى : ( وكأين من قرية أمليت لها وهي ظالمة ثم أخذتها وإلي المصير ) [ الحج 48 ] . ومن أقلع عما هو فيه من كفر أو عصيان ورجع إلى الله وتاب إليه تاب عليه كما قال تعالى : ( ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما ) [ النساء 110 .\nوقال هاهنا ( إنه كان حليما غفورا ) كما قال في آخر فاطر \" ( إن الله يمسك السماوات والأرض أن تزولا ولئن زالتا إن أمسكهما من أحد من بعده إنه كان حليما غفورا ) إلى أن قال ( ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة ولكن يؤخرهم إلى أجل مسمى فإذا جاء أجلهم فإن الله كان بعباده بصيرا ) [ فاطر 41 - 45 .\n                                    ",
        "qortoby": "تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا ٤٤\n                                    \n                                    \n                                    قوله تعالى : تسبح له السماوات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم إنه كان حليما غفورا\nقوله تعالى : تسبح له السماوات السبع والأرض أعاد على السماوات والأرض ضمير من يعقل ، لما أسند إليها فعل العاقل وهو التسبيح .\nومن فيهن يريد الملائكة والإنس والجن .\nثم عم بعد ذلك الأشياء كلها في قوله : وإن من شيء إلا يسبح بحمده . واختلف في هذا العموم ، هل هو مخصص أم لا ; فقالت فرقة : ليس مخصوصا والمراد به تسبيح الدلالة ، وكل محدث يشهد على نفسه بأن الله - عز وجل - خالق قادر . وقالت طائفة : هذا التسبيح حقيقة ، وكل شيء على العموم يسبح تسبيحا لا يسمعه البشر ولا يفقهه ، ولو كان ما قاله الأولون من أنه أثر الصنعة والدلالة لكان أمرا مفهوما ، والآية تنطق بأن هذا التسبيح لا يفقه . وأجيبوا بأن المراد بقوله : لا تفقهون الكفار الذين يعرضون عن الاعتبار فلا يفقهون حكمة الله - سبحانه وتعالى - في الأشياء . وقالت فرقة : قوله من شيء عموم ، ومعناه الخصوص في كل حي ونام ، وليس ذلك في الجمادات . ومن هذا قول عكرمة : الشجرة تسبح والأسطوان لا يسبح . وقال يزيد الرقاشي للحسن وهما في طعام وقد قدم الخوان : أيسبح هذا الخوان يا أبا سعيد ؟ فقال : قد كان يسبح مرة ; يريد أن الشجرة في زمن ثمرها واعتدالها كانت تسبح ، وأما الآن فقد صار خوانا مدهونا .\nقلت : ويستدل لهذا القول من السنة بما ثبت عن ابن عباس رضي الله - تعالى - عنهما أن النبي - صلى الله عليه وسلم - مر على قبرين فقال : إنهما ليعذبان وما يعذبان في كبير أما أحدهما فكان يمشي بالنميمة وأما الآخر فكان لا يستبرئ من البول قال : فدعا بعسيب رطب فشقه اثنين ، ثم غرس على هذا واحدا وعلى هذا واحدا ثم قال : لعله يخفف عنهما ما لم ييبسا . فقوله - عليه الصلاة والسلام - . ما لم ييبسا إشارة إلى أنهما ما داما رطبين يسبحان ، فإذا يبسا صارا جمادا . والله أعلم . وفي مسند أبي داود الطيالسي : فتوضع على أحدهما نصفا وعلى الآخر نصفا وقال : لعله أن يهون عليهما العذاب ما دام فيهما من بلولتهما شيء . قال علماؤنا : ويستفاد من هذا غرس الأشجار وقراءة القرآن على القبور ، وإذا خفف عنهم بالأشجار فكيف بقراءة الرجل المؤمن القرآن . وقد بينا هذا المعنى في كتاب التذكرة بيانا شافيا ، وأنه يصل إلى الميت ثواب ما يهدى إليه . والحمد لله على ذلك . وعلى التأويل الثاني لا يحتاج إلى ذلك ; فإن كل شيء من الجماد وغيره يسبح .\nقلت : ويستدل لهذا التأويل وهذا القول من الكتاب بقوله - سبحانه وتعالى - : واذكر عبدنا داود ذا الأيد إنه أواب إنا سخرنا الجبال معه يسبحن بالعشي والإشراق ، وقوله : وإن منها لما يهبط من خشية الله - على قول مجاهد - ، وقوله : وتخر الجبال هدا أن دعوا للرحمن ولدا . وذكر ابن المبارك في ( دقائقه ) أخبرنا مسعر عن عبد الله بن واصل عن عوف بن عبد الله قال : قال عبد الله بن مسعود - رضي الله عنه - : إن الجبل يقول للجبل : يا فلان ، هل مر بك اليوم ذاكر لله - عز وجل - ؟ فإن قال نعم سر به . ثم قرأ عبد الله وقالوا اتخذ الرحمن ولدا الآية . قال : أفتراهن يسمعن الزور ولا يسمعن الخير . وفيه عن أنس بن مالك - رضي الله عنه - قال : ما من صباح ولا رواح إلا تنادي بقاع الأرض بعضها بعضا . يا جاراه ; هل مر بك اليوم عبد فصلى لله أو ذكر الله عليك ؟ فمن قائلة لا ، ومن قائلة نعم ، فإذا قالت نعم رأت لها بذلك فضلا عليها . وقال رسول الله - صلى الله عليه وسلم - : لا يسمع صوت المؤذن جن ولا إنس ولا شجرة ولا حجر ولا مدر ولا شيء إلا شهد له يوم القيامة . رواه ابن ماجه في سننه ، ومالك في موطئه من حديث أبي سعيد الخدري - رضي الله عنه - . وخرج البخاري عن عبد الله - رضي الله عنه - قال : لقد كنا نسمع تسبيح الطعام وهو يؤكل . في غير هذه الرواية عن ابن مسعود - رضي الله تعالى عنه - : كنا نأكل مع رسول الله - صلى الله عليه وسلم - الطعام ونحن نسمع تسبيحه . وفي صحيح مسلم عن جابر بن سمرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : إني لأعرف حجرا بمكة كان يسلم علي قبل أن أبعث إني لأعرفه الآن . قيل : إنه الحجر الأسود ، والله أعلم . والأخبار في هذا المعنى كثيرة ; وقد أتينا على جملة منها في اللمع اللؤلؤية في شرح العشرينيات النبوية للفاداري - رحمه الله - ، وخبر الجذع أيضا مشهور في هذا الباب خرجه البخاري في موضع من كتابه . وإذا ثبت ذلك في جماد واحد جاز في جميع الجمادات ، ولا استحالة في شيء من ذلك ; فكل شيء يسبح للعموم . وكذا قال النخعي وغيره : هو عام فيما فيه روح وفيما لا روح فيه حتى صرير الباب . واحتجوا بالأخبار التي ذكرنا . وقيل : تسبيح الجمادات أنها تدعو الناظر إليها إلى أن يقول : سبحان الله ! لعدم الإدراك منها . وقال الشاعر :\nتلقى بتسبيحة من حيث ما انصرفت وتستقر حشا الرائي بترعاد\nأي يقول من رآها : سبحان خالقها . فالصحيح أن الكل يسبح للأخبار الدالة على ذلك لو كان ذلك التسبيح تسبيح دلالة فأي تخصيص لداود ، وإنما ذلك تسبيح المقال بخلق الحياة والإنطاق بالتسبيح كما ذكرنا . وقد نصت السنة على ما دل عليه ظاهر القرآن من تسبيح كل شيء فالقول به أولى . والله أعلم . وقرأ الحسن وأبو عمرو ويعقوب وحفص وحمزة والكسائي وخلف تفقهون بالتاء لتأنيث الفاعل . الباقون بالياء ، واختاره أبو عبيد ، قال : للحائل بين الفعل والتأنيث .\nإنه كان حليما عن ذنوب عباده في الدنيا .\nغفورا للمؤمنين في الآخرة .\n                                    ",
        "saadi": "تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا ٤٤\n                                        \n                                        \n                                        \n                                        { تُسَبِّحُ لَهُ السَّمَاوَاتُ السَّبْعُ وَالْأَرْضُ وَمَنْ فِيهِنَّ وَإِنْ مِنْ شَيْءٍ } من حيوان ناطق وغير ناطق ومن أشجار ونبات وجامد وحي وميت { إِلَّا يُسَبِّحُ بِحَمْدِهِ } بلسان الحال ولسان المقال. { وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ } أي: تسبيح باقي المخلوقات التي على غير لغتكم بل يحيط بها علام الغيوب.\n{ إِنَّهُ كَانَ حَلِيمًا غَفُورًا } حيث لم يعاجل بالعقوبة من قال فيه قولا تكاد السماوات والأرض تتفطر منه وتخر له الجبال ولكنه أمهلهم وأنعم عليهم وعافاهم ورزقهم ودعاهم إلى بابه ليتوبوا من هذا الذنب العظيم ليعطيهم الثواب الجزيل ويغفر لهم ذنبهم، فلولا حلمه ومغفرته لسقطت السماوات على الأرض ولما ترك على ظهرها من دابة.\n                                    "
      },
      "originalText": "تُسَبِّحُ لَهُ ٱلسَّمَٰوَٰتُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ وَإِن مِّن شَيۡءٍ إِلَّا يُسَبِّحُ بِحَمۡدِهِۦ وَلَٰكِن لَّا تَفۡقَهُونَ تَسۡبِيحَهُمۡۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا ٤٤"
    },
    {
      "number": 2074,
      "text": "وَإِذَا قَرَأْتَ الْقُرْآنَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ حِجَابًا مَسْتُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 45,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا ٥٤\n                                    \n                                    \n                                    يقول تعالى لرسوله محمد صلى الله عليه وسلم وإذا قرأت يا محمد على هؤلاء المشركين القرآن جعلنا بينك وبينهم حجابا مستورا\nقال قتادة وابن زيد هو الأكنة على قلوبهم كما قال تعالى : ( وقالوا قلوبنا في أكنة مما تدعونا إليه وفي آذاننا وقر ومن بيننا وبينك حجاب ) [ فصلت 5 ] أي مانع حائل أن يصل إلينا مما تقول شيء\nوقوله : ( حجابا مستورا ) أي بمعنى ساتر كميمون ومشئوم بمعنى يامن وشائم لأنه من يمنهم وشأمهم\nوقيل مستورا عن الأبصار فلا تراه وهو مع ذلك حجاب بينهم وبين الهدى ومال إلى ترجيحه ابن جرير رحمه الله\nوقال الحافظ أبو يعلى الموصلي حدثنا أبو موسى الهروي إسحاق بن إبراهيم حدثنا سفيان عن الوليد بن كثير عن يزيد بن تدرس عن أسماء بنت أبي بكر [ الصديق رضي الله عنها ، قالت لما نزلت ) تبت يدا أبي لهب وتب ) [ سورة المسد ] جاءت العوراء أم جميل ولها ولولة وفي يدها فهر وهي تقول مدمما أتينا أو أبينا ، قال أبو موسى الشك مني ودينه قلينا وأمره عصينا ورسول الله جالس وأبو بكر إلى جنبه أو قال معه قال : فقال أبو بكر لقد أقبلت هذه وأنا أخاف أن تراك فقال إنها لن تراني وقرأ قرآنا اعتصم به منها ) وإذا قرأت القرآن جعلنا بينك وبين الذين لا يؤمنون بالآخرة حجابا مستورا ) . قال فجاءت حتى قامت على أبي بكر فلم تر النبي صلى الله عليه وسلم فقالت : يا أبا بكر بلغني أن صاحبك هجاني فقال أبو بكر لا ورب هذا البيت ما هجاك قال فانصرفت وهي تقول لقد علمت قريش أني بنت سيدها .\n                                    ",
        "qortoby": "وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا ٥٤\n                                    \n                                    \n                                    قوله تعالى : وإذا قرأت القرآن جعلنا بينك وبين الذين لا يؤمنون بالآخرة حجابا مستورا عن أسماء بنت أبي بكر - رضي الله تعالى عنهما - قالت : لما نزلت سورة تبت يدا أبي لهب أقبلت العوراء أم جميل بنت حرب ولها ولولة وفي يدها فهر وهي تقول :\nمذمما عصينا وأمره أبينا\nودينه قلينا\nوالنبي - صلى الله عليه وسلم - قاعد في المسجد ومعه أبو بكر - رضي الله عنه - ; فلما رآها أبو بكر قال : يا رسول الله ، لقد أقبلت وأنا أخاف أن تراك ! قال رسول الله - صلى الله عليه وسلم - : إنها لن تراني وقرأ قرآنا فاعتصم به كما قال . وقرأ وإذا قرأت القرآن جعلنا بينك وبين الذين لا يؤمنون بالآخرة حجابا مستورا . فوقفت على أبي بكر - رضي الله عنه - ولم تر رسول الله - صلى الله عليه وسلم - فقالت : يا أبا بكر ، أخبرت أن صاحبك هجاني ! فقال : لا ورب هذا البيت ما هجاك . قال : فولت وهي تقول : قد علمت قريش أني ابنة سيدها . وقال سعيد بن جبير - رضي الله عنه - : لما نزلت تبت يدا أبي لهب وتب جاءت امرأة أبي لهب إلى النبي - صلى الله عليه وسلم - ومعه أبو بكر - رضي الله عنه - ، فقال أبو بكر : لو تنحيت عنها لئلا تسمعك ما يؤذيك ، فإنها امرأة بذية . فقال النبي - صلى الله عليه وسلم - : إنه سيحال بيني وبينها فلم تره . فقالت لأبي بكر : يا أبا بكر ، هجانا صاحبك ! فقال : والله ما ينطق بالشعر ولا يقوله . فقالت : وإني لمصدقة ; فاندفعت راجعة . فقال أبو بكر - رضي الله عنه - : يا رسول الله ، أما رأتك ؟ قال : لا ما زال ملك بيني وبينها يسترني حتى ذهبت . وقال كعب - رضي الله عنه - في هذه الآية : كان النبي - صلى الله عليه وسلم - يستتر من المشركين بثلاث آيات : الآية التي في الكهف إنا جعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا ، والآية في النحل أولئك الذين طبع الله على قلوبهم وسمعهم وأبصارهم ، والآية التي في الجاثية أفرأيت من اتخذ إلهه هواه وأضله الله على علم وختم على سمعه وقلبه وجعل على بصره غشاوة الآية . فكان النبي - صلى الله عليه وسلم - إذا قرأهن يستتر من المشركين . قال كعب - رضي الله تعالى عنه - : فحدثت بهن رجلا من أهل الشام ، فأتى أرض الروم فأقام بها زمانا ، ثم خرج هاربا فخرجوا في طلبه فقرأ بهن فصاروا يكونون معه على طريقه ولا يبصرونه . قالالثعلبي : وهذا الذي يروونه عن كعب حدثت به رجلا من أهل الري فأسر بالديلم ، فمكث زمانا ثم خرج هاربا فخرجوا في طلبه فقرأ بهن حتى جعلت ثيابهن لتلمس ثيابه فما يبصرونه .\nقلت : ويزاد إلى هذه الآي أول سورة يس إلى قوله فهم لا يبصرون . فإن في السيرة في هجرة النبي - صلى الله عليه وسلم - ومقام علي - رضي الله عنه - في فراشه قال : وخرج رسول الله - صلى الله عليه وسلم - فأخذ حفنة من تراب في يده ، وأخذ الله - عز وجل - على أبصارهم عنه فلا يرونه ، فجعل ينثر ذلك التراب على رءوسهم وهو يتلو هذه الآيات من يس : يس والقرآن الحكيم إنك لمن المرسلين على صراط مستقيم تنزيل العزيز الرحيم - إلى قوله - وجعلنا من بين أيديهم سدا ومن خلفهم سدا فأغشيناهم فهم لا يبصرون . حتى فرغ رسول الله - صلى الله عليه وسلم - من هذه الآيات ، ولم يبق منهم رجل إلا وقد وضع على رأسه ترابا ، ثم انصرف إلى حيث أراد أن يذهب .\nقلت : ولقد اتفق لي ببلادنا الأندلس بحصن منثور من أعمال قرطبة مثل هذا . وذلك أني هربت أمام العدو وانحزت إلى ناحية عنه ، فلم ألبث أن خرج في طلبي فارسان وأنا في فضاء من الأرض قاعد ليس يسترني عنهما شيء ، وأنا أقرأ أول سورة يس وغير ذلك من القرآن ; فعبرا علي ثم رجعا من حيث جاءا وأحدهما يقول للآخر : هذا ديبلة ; يعنون شيطانا . وأعمى الله - عز وجل - أبصارهم فلم يروني ، والحمد لله حمدا كثيرا على ذلك .\nوقيل : الحجاب المستور طبع الله على قلوبهم حتى لا يفقهوه ولا يدركوا ما فيه من الحكمة ; قاله قتادة . وقال الحسن : أي أنهم لإعراضهم عن قراءتك وتغافلهم عنك كمن بينك وبينه حجاب في عدم رؤيته لك حتى كأن على قلوبهم أغطية . وقيل : نزلت في قوم كانوا يؤذون رسول الله - صلى الله عليه وسلم - إذا قرأ القرآن ، وهم أبو جهل وأبو سفيان والنضر بن الحارث وأم جميل أمرأة أبي لهب وحويطب ; فحجب الله - سبحانه وتعالى - رسوله - صلى الله عليه وسلم - عن أبصارهم عند قراءة القرآن ، وكانوا يمرون به ولا يرونه ; قاله الزجاج وغيره . وهو معنى القول الأول بعينه ، وهو الأظهر في الآية ، والله أعلم . وقوله : مستورا فيه قولان : أحدهما - أن الحجاب مستور عنكم لا ترونه . والثاني : أن الحجاب ساتر عنكم ما وراءه ; ويكون مستورا به بمعنى ساتر .\n                                    ",
        "saadi": "وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا ٥٤\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن عقوبته للمكذبين بالحق الذين ردوه وأعرضوا عنه أنه يحول بينهم وبين الإيمان فقال:\n{ وَإِذَا قَرَأْتَ الْقُرْآنَ } الذي فيه الوعظ والتذكير والهدى والإيمان والخير والعلم الكثير.\n{ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ حِجَابًا مَسْتُورًا } يسترهم عن فهمه حقيقة وعن التحقق بحقائقه والانقياد إلى ما يدعو إليه من الخير.\n                                    "
      },
      "originalText": "وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا ٥٤"
    },
    {
      "number": 2075,
      "text": "وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَنْ يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا ۚ وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلَىٰ أَدْبَارِهِمْ نُفُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 46,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا ٦٤\n                                    \n                                    \n                                    وقوله : ( وجعلنا على قلوبهم أكنة ) : جمع كنان الذي يغشى القلب ( أن يفقهوه ) أي لئلا يفهموا القرآن ( وفي آذانهم وقرا ) وهو الثقل الذي يمنعهم من سماع القرآن سماعا ينفعهم ويهتدون به\nوقوله : ( وإذا ذكرت ربك في القرآن وحده ) أي إذا وحدت الله في تلاوتك وقلت لا إله إلا الله ( ولوا ) أي أدبروا راجعين ( على أدبارهم نفورا ) ونفور جمع نافر كقعود جمع قاعد ويجوز أن يكون مصدرا من غير الفعل والله أعلم كما قال تعالى : ( وإذا ذكر الله وحده اشمأزت قلوب الذين لا يؤمنون بالآخرة وإذا ذكر الذين من دونه إذا هم يستبشرون ) [ الزمر 45 .\nقال قتادة في قوله : ( وإذا ذكرت ربك في القرآن وحده ولوا على أدبارهم نفورا ) إن المسلمين لما قالوا لا إله إلا الله أنكر ذلك المشركون وكبرت عليهم وضاقها إبليس وجنوده فأبى الله إلا أن يمضيها وينصرها ويفلجها ويظهرها على من ناوأها إنها كلمة من خاصم بها فلج ومن قاتل بها نصر إنما يعرفها أهل هذه الجزيرة من المسلمين التي يقطعها الراكب في ليال قلائل ويسير الدهر في فئام من الناس لا يعرفونها ولا يقرون بها\nقول آخر في الآية\nوروى ابن جرير حدثني الحسين بن محمد الذارع ، حدثنا روح بن المسيب أبو رجاء الكلبي حدثنا عمرو بن مالك عن أبي الجوزاء عن ابن عباس في قوله : ( وإذا ذكرت ربك في القرآن وحده ولوا على أدبارهم نفورا ) هم الشياطين\nهذا غريب جدا في تفسيرها وإلا فالشياطين إذا قرئ القرآن أو نودي بالأذان أو ذكر الله انصرفوا .\n                                    ",
        "qortoby": "وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا ٦٤\n                                    \n                                    \n                                    قوله تعالى : وجعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرأ وإذا ذكرت ربك في القرآن وحده ولوا على أدبارهم نفورا\nقوله تعالى : وجعلنا على قلوبهم أكنة أي فعلنا ذلك بهم مجازاة على كفرهم . وليس المعنى أنهم لا يسمعون ولا يفقهون ، ولكن لما كانوا لا ينتفعون بما يسمعون ، ولا ينقادون إلى الحق كانوا بمنزلة من لا يسمع ولا يفهم . والأكنة الأغطية جمع كنان مثل الأسنة والسنان ، والأعنة والعنان . كننت الشيء في كنه إذا صنته فيه . وأكننت الشيء أخفيته . والكنانة معروفة . والكنة ( بفتح الكاف والنون ) امرأة أبيك ; ويقال : امرأة الابن أو الأخ ; لأنها في كنه . وأكنة جمع كنان ، وهو ما ستر الشيء . وقد تقدم في الأنعام\nأن يفقهوه أي يفهموه وهو في موضع نصب ; المعنى كراهية أن يفهموه ، أو لئلا يفهموه . أن يفقهوه أي لئلا يفقهوه ، أو كراهية أن يفقهوه ، أي أن يفهموا ما فيه من الأوامر والنواهي والحكم والمعاني . وهذا رد على القدرية .\nوفي آذانهم وقرا عطف عليه أي ثقلا ; يقال منه : وقرت أذنه ( بفتح الواو ) توقر وقرا أي صمت ، وقياس مصدره التحريك إلا أنه جاء بالتسكين . وقد وقر الله أذنه يقرها وقرا ; يقال : اللهم قر أذنه . وحكى أبو زيد عن العرب : أذن موقورة على ما لم يسم فاعله ; فعلى هذا وقرت ( بضم الواو ) . وقرأ طلحة بن مصرف ( وقرا ) بكسر الواو ; أي جعل ، في آذانهم ما سدها عن استماع القول على التشبيه بوقر البعير ، وهو مقدار ما يطيق أن يحمل ، والوقر الحمل ; يقال منه : نخلة موقر وموقرة إذا كانت ذات ثمر كثير . ورجل ذو وقرة إذا كان وقورا بفتح الواو ; ويقال منه : وقر الرجل ( بضم القاف ) وقارا ، ووقر ( بفتح القاف ) أيضا .\nوفي آذانهم وقرا أي صمما وثقلا . وفي الكلام إضمار ، أي أن يسمعوه .\nوإذا ذكرت ربك في القرآن وحده أي قلت : لا إله إلا الله وأنت تتلو القرآن . وقال أبو الجوزاء أوس بن عبد الله : ليس شيء أطرد للشياطين من القلب من قول لا إله إلا الله ، ثم تلا وإذا ذكرت ربك في القرآن وحده ولوا على أدبارهم نفورا . وقال علي بن الحسين : هو قوله بسم الله الرحمن الرحيم . وقد تقدم هذا في البسملة .\nولوا على أدبارهم قيل : يعني بذلك المشركين . وقيل الشياطين .\nنفورا جمع نافر ; مثل شهود جمع شاهد ، وقعود جمع قاعد ، فهو منصوب على الحال . ويجوز أن يكون مصدرا على غير الصدر ; إذ كان قوله ولوا بمعنى نفروا ، فيكون معناه نفروا نفورا .\n                                    ",
        "saadi": "وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا ٦٤\n                                        \n                                        \n                                        \n                                        { وَجَعَلْنَا عَلَى قُلُوبِهِمْ أَكِنَّةً } أي: أغطية وأغشية لا يفقهون معها القرآن بل يسمعونه سماعا تقوم به عليهم الحجة، { وَفِي آذَانِهِمْ وَقْرًا } أي: صمما عن سماعه، { وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآن } داعيا لتوحيده ناهيا عن الشرك به.\n{ وَلَّوْا عَلَى أَدْبَارِهِمْ نُفُورًا } من شدة بغضهم له ومحبتهم لما هم عليه من الباطل، كما قال تعالى: { وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ وَإِذَا ذُكِرَ الَّذِينَ مِنْ دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ }\n                                    "
      },
      "originalText": "وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِي ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡاْ عَلَىٰٓ أَدۡبَٰرِهِمۡ نُفُورٗا ٦٤"
    },
    {
      "number": 2076,
      "text": "نَحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِ إِذْ يَسْتَمِعُونَ إِلَيْكَ وَإِذْ هُمْ نَجْوَىٰ إِذْ يَقُولُ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلَّا رَجُلًا مَسْحُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 47,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا ٧٤\n                                    \n                                    \n                                    يخبر تعالى نبيه صلوات الله وسلامه ] عليه بما تناجى به رؤساء كفار قريش حين جاءوا يستمعون قراءة رسول الله صلى الله عليه وسلم سرا من قومهم بما قالوا من أنه رجل مسحور ، من السحر على المشهور أو من السحر وهو الرئة أي إن تتبعون إن اتبعتم محمدا - ( إلا بشرا ) يأكل [ ويشرب ، كما قال الشاعر :\nفإن تسألينا فيم نحن فإننا عصافير من هذا الأنام المسحر\nوقال الراجز\nونسحر بالطعام وبالشراب\nأي : نغذى وقد صوب هذا القول ابن جرير وفيه نظر لأنهم إنما أرادوا هاهنا أنه مسحور له رئى يأتيه بما استمعوه من الكلام الذي يتلوه ومنهم من قال شاعر ومنهم من قال كاهن ومنهم من قال مجنون ومنهم من قال ساحر ولهذا قال تعالى :\n                                    ",
        "qortoby": "نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا ٧٤\n                                    \n                                    \n                                    قوله تعالى : نحن أعلم بما يستمعون به إذ يستمعون إليك وإذ هم نجوى إذ يقول الظالمون إن تتبعون إلا رجلا مسحورا .\nقوله تعالى : نحن أعلم بما يستمعون به إذ يستمعون إليك قيل : الباء زائدة في قوله به أي يستمعونه . وكانوا يستمعون من النبي - صلى الله عليه وسلم - القرآن ثم ينفرون فيقولون : هو ساحر ومسحور ; كما أخبر الله - تعالى - به عنهم ; قاله قتادة وغيره .\nوإذ هم نجوى أي متناجون في أمرك . قال قتادة : وكانت نجواهم قولهم إنه مجنون وإنه ساحر وإنه يأتي بأساطير الأولين ، وغير ذلك . وقيل : نزلت حين دعا عتبة أشراف قريش إلى طعام صنعه لهم ، فدخل عليهم النبي - صلى الله عليه وسلم - وقرأ عليهم القرآن ودعاهم إلى الله ; فتناجوا ; يقولون ساحر ومجنون . وقيل : أمر النبي - صلى الله عليه وسلم - عليا أن يتخذ طعاما ويدعو إليه أشراف قريش من المشركين ; ففعل ذلك علي ودخل عليهم رسول الله - صلى الله عليه وسلم - وقرأ عليهم القرآن ودعاهم إلى التوحيد ، وقال : قولوا لا إله إلا الله لتطيعكم العرب وتدين لكم العجم فأبوا ، وكانوا يستمعون من النبي - صلى الله عليه وسلم - ويقولون بينهم متناجين هو : ساحر وهو مسحور ; فنزلت الآية . وقال الزجاج : النجوى اسم للمصدر ; أي وإذ هم ذو نجوى ، أي سرار .\nإذ يقول الظالمون أبو جهل والوليد بن المغيرة وأمثالهما .\nإن تتبعون إلا رجلا مسحورا أي مطبوبا قد خبله السحر فاختلط عليه أمره ، يقولون ذلك لينفروا عنه الناس . وقال مجاهد : مسحورا أي مخدوعا ; مثل قوله : فأنى تسحرون أي من أين تخدعون . وقال أبو عبيدة : مسحورا معناه أن له سحرا ، أي رئة ، فهو لا يستغني عن الطعام والشراب ; فهو مثلكم وليس بملك . وتقول العرب للجبان : قد انتفخ سحره . ولكل من أكل من آدمي وغيره أو شرب مسحور ومسحر . قال لبيد :\nفإن تسألينا فيم نحن فإننا عصافير من هذا الأنام المسحر\nوقال امرؤ القيس :\nأرينا موضعين لأمر غيب ونسحر بالطعام وبالشراب\nأي نغذى ونعلل . وفي الحديث عن عائشة - رضي الله عنها - أنها قالت : من هذه التي تساميني من أزواج النبي - صلى الله عليه وسلم - ; وقد توفي رسول الله - صلى الله عليه وسلم - بين سحري ونحري .\n                                    ",
        "saadi": "نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا ٧٤\n                                        \n                                        \n                                        \n                                        { نَحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِ } أي: إنما منعناهم من الانتفاع عند سماع القرآن لأننا نعلم أن مقاصدهم سيئة يريدون أن يعثروا على أقل شيء ليقدحوا به، وليس استماعهم لأجل الاسترشاد وقبول الحق وإنما هم متعمدون على عدم اتباعه، ومن كان بهذه الحالة لم يفده الاستماع شيئا ولهذا قال: { إِذْ يَسْتَمِعُونَ إِلَيْكَ وَإِذْ هُمْ نَجْوَى } أي: متناجين { إِذْ يَقُولُ الظَّالِمُونَ } في مناجاتهم: { إِنْ تَتَّبِعُونَ إِلَّا رَجُلًا مَسْحُورًا } فإذا كانت هذه مناجاتهم الظالمة فيما بينهم وقد بنوها على أنه مسحور فهم جازمون أنهم غير معتبرين لما قال، وأنه يهذي لا يدري ما يقول.\n                                    "
      },
      "originalText": "نَّحۡنُ أَعۡلَمُ بِمَا يَسۡتَمِعُونَ بِهِۦٓ إِذۡ يَسۡتَمِعُونَ إِلَيۡكَ وَإِذۡ هُمۡ نَجۡوَىٰٓ إِذۡ يَقُولُ ٱلظَّٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلٗا مَّسۡحُورًا ٧٤"
    },
    {
      "number": 2077,
      "text": "انْظُرْ كَيْفَ ضَرَبُوا لَكَ الْأَمْثَالَ فَضَلُّوا فَلَا يَسْتَطِيعُونَ سَبِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 48,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا ٨٤\n                                    \n                                    \n                                    ( انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا ) أي فلا يهتدون إلى الحق ولا يجدون إليه مخلصا\nقال محمد بن إسحاق في السيرة : حدثني محمد بن مسلم بن شهاب الزهري أنه حدث أن أبا سفيان بن حرب وأبا جهل بن هشام والأخنس بن شريق بن عمرو بن وهب الثقفي حليف ابن زهرة خرجوا ليلة ليستمعوا من رسول الله صلى الله عليه وسلم وهو يصلي بالليل في بيته فأخذ كل واحد منهم مجلسا يستمع فيه وكل لا يعلم بمكان صاحبه فباتوا يستمعون له حتى إذا طلع الفجر تفرقوا حتى إذا جمعتهم الطريق فتلاوموا وقال بعضهم لبعض لا تعودوا فلو رآكم بعض سفهائكم لأوقعتم في نفسه شيئا ثم انصرفوا حتى إذا كانت الليلة الثانية عاد كل رجل منهم إلى مجلسه فباتوا يستمعون له حتى إذا طلع الفجر تفرقوا حتى إذا جمعتهم الطريق فقال بعضهم لبعض مثل ما قال أول مرة ثم انصرفوا حتى إذا كانت الليلة الثالثة أخذ كل رجل منهم مجلسه فباتوا يستمعون له حتى إذا طلع الفجر تفرقوا فجمعهم الطريق فقال بعضهم لبعض لا نبرح حتى نتعاهد لا نعود فتعاهدوا على ذلك ثم تفرقوا\nفلما أصبح الأخنس بن شريق أخذ عصاه ثم خرج حتى أتى أبا سفيان بن حرب في بيته فقال أخبرني يا أبا حنظلة عن رأيك فيما سمعت من محمد قال : يا أبا ثعلبة والله لقد سمعت أشياء أعرفها وأعرف ما يراد بها وسمعت أشياء ما عرفت معناها ولا ما يراد بها قال الأخنس وأنا والذي حلفت به . قال ثم خرج من عنده حتى أتى أبا جهل فدخل عليه بيته فقال يا أبا الحكم ما رأيك فيما سمعت من محمد قال ماذا سمعت تنازعنا نحن وبنو عبد مناف الشرف أطعموا فأطعمنا وحملوا فحملنا وأعطوا فأعطينا حتى إذا تجاثينا على الركب وكنا كفرسي رهان قالوا منا نبي يأتيه الوحي من السماء فمتى ندرك هذه والله لا نؤمن به أبدا ولا نصدقه قال فقام عنه الأخنس وتركه .\n                                    ",
        "qortoby": "ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا ٨٤\n                                    \n                                    \n                                    قوله تعالى : انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا قوله تعالى : انظر كيف ضربوا لك الأمثال عجبه من صنعهم كيف يقولون تارة ساحر وتارة مجنون وتارة شاعر .\nفضلوا فلا يستطيعون سبيلا أي حيلة في صد الناس عنك . وقيل : ضلوا عن الحق فلا يجدون سبيلا ، أي إلى الهدى . وقيل : مخرجا ; لتناقض كلامهم في قولهم : مجنون ، ساحر ، شاعر .\n                                    ",
        "saadi": "ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا ٨٤\n                                        \n                                        \n                                        \n                                        قال تعالى: { انْظُرْ } متعجبا { كَيْفَ ضَرَبُوا لَكَ الْأَمْثَالَ } التي هي أضل الأمثال وأبعدها عن الصواب { فَضَلُّوا } في ذلك أو فصارت سببا لضلالهم لأنهم بنوا عليها أمرهم والمبني على فاسد أفسد منه.\n{ فَلَا يَسْتَطِيعُونَ سَبِيلًا } أي: لا يهتدون أي اهتداء فنصيبهم الضلال المحض والظلم الصرف.\n                                    "
      },
      "originalText": "ٱنظُرۡ كَيۡفَ ضَرَبُواْ لَكَ ٱلۡأَمۡثَالَ فَضَلُّواْ فَلَا يَسۡتَطِيعُونَ سَبِيلٗا ٨٤"
    },
    {
      "number": 2078,
      "text": "وَقَالُوا أَإِذَا كُنَّا عِظَامًا وَرُفَاتًا أَإِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 49,
      "juz": 15,
      "manzil": 4,
      "page": 286,
      "ruku": 244,
      "hizbQuarter": 114,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا ٩٤\n                                    \n                                    \n                                    يقول تعالى مخبرا عن الكفار المستبعدين وقوع المعاد القائلين استفهام إنكار منهم لذلك ( أئذا كنا عظاما ورفاتا ) أي ترابا قاله مجاهد\nوقال علي بن أبي طلحة عن ابن عباس غبارا\n( أئنا لمبعوثون ) أي يوم القيامة ( خلقا جديدا ) أي بعد ما بلينا وصرنا عدما لا يذكر كما أخبر عنهم في الموضع الآخر ( يقولون أئنا لمردودون في الحافرة أئذا كنا عظاما نخرة قالوا تلك إذا كرة خاسرة ) [ النازعات 10 12 ] قال تعالى : ( وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم ) [ يس 78 ، 79 .\n                                    ",
        "qortoby": "وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا ٩٤\n                                    \n                                    \n                                    قوله تعالى : وقالوا أئذا كنا عظاما ورفاتا أئنا لمبعوثون خلقا جديدا قوله تعالى : وقالوا أئذا كنا عظاما ورفاتا أي قالوا وهم يتناجون لما سمعوا القرآن وسمعوا أمر البعث : لو لم يكن مسحورا مخدوعا لما قال هذا . قال ابن عباس : الرفات الغبار . مجاهد : التراب . والرفات ما تكسر وبلي من كل شيء ; كالفتات والحطام والرضاض ; عن أبي عبيدة والكسائي والفراء والأخفش . تقول منه : رفت الشيء رفتا ، أي حطم ; فهو مرفوت .\nأئنا لمبعوثون خلقا جديدا أئنا استفهام والمراد به الجحد والإنكار . وخلقا نصب لأنه مصدر ; أي بعثا جديدا . وكان هذا غاية الإنكار منهم .\n                                    ",
        "saadi": "وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا ٩٤\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن قول المنكرين للبعث وتكذيبهم به واستبعادهم بقولهم: { أَئِذَا كُنَّا عِظَامًا وَرُفَاتًا } أي: أجسادا بالية { أَئِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا } أي: لا يكون ذلك وهو محال بزعمهم، فجهلوا أشد الجهل حيث كذبوا رسل الله وجحدوا آيات الله وقاسوا قدرة خالق السماوات والأرض بقدرتهم الضعيفة العاجزة.\nفلما رأوا أن هذا ممتنع عليهم لا يقدرون عليه جعلوا قدرة الله كذلك.\nفسبحان من جعل خلقا من خلقه يزعمون أنهم أولو العقول والألباب مثالا في جهل أظهر الأشياء وأجلاها وأوضحها براهين وأعلاها ليرى عباده أنه ما ثم إلا توفيقه وإعانته أو الهلاك والضلال.\n{ رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ }\n                                    "
      },
      "originalText": "وَقَالُوٓاْ أَءِذَا كُنَّا عِظَٰمٗا وَرُفَٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقٗا جَدِيدٗا ٩٤"
    }
  ]
}