{
  "number": 289,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 2096,
      "text": "وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُونَ إِلَّا إِيَّاهُ ۖ فَلَمَّا نَجَّاكُمْ إِلَى الْبَرِّ أَعْرَضْتُمْ ۚ وَكَانَ الْإِنْسَانُ كَفُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 67,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 246,
      "hizbQuarter": 115,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا ٧٦\n                                    \n                                    \n                                    يخبر تعالى أنه إذا مس الناس ضر دعوه منيبين إليه مخلصين له الدين ولهذا قال : ( وإذا مسكم الضر في البحر ضل من تدعون إلا إياه ) أي ذهب عن قلوبكم كل ما تعبدون غير الله كما اتفق لعكرمة بن أبي جهل لما ذهب فارا من رسول الله صلى الله عليه وسلم حين فتح مكة فذهب هاربا فركب في البحر ليدخل الحبشة فجاءتهم ريح عاصف فقال القوم بعضهم لبعض إنه لا يغني عنكم إلا أن تدعو الله وحده فقال عكرمة في نفسه والله لئن كان لا ينفع في البحر غيره فإنه لا ينفع في البر غيره اللهم لك علي عهد لئن أخرجتني منه لأذهبن فأضعن يدي في يديه ، فلأجدنه رءوفا رحيما فخرجوا من البحر فرجع إلى رسول الله صلى الله عليه وسلم فأسلم وحسن إسلامه رضي الله عنه وأرضاه\nوقوله : ( فلما نجاكم إلى البر أعرضتم ) أي نسيتم ما عرفتم من توحيده في البحر وأعرضتم عن دعائه وحده لا شريك له\n( وكان الإنسان كفورا ) أي سجيته هذا ينسى النعم ويجحدها إلا من عصم الله\n                                    ",
        "qortoby": "وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا ٧٦\n                                    \n                                    \n                                    قوله تعالى : وإذا مسكم الضر في البحر ضل من تدعون إلا إياه فلما نجاكم إلى البر أعرضتم وكان الإنسان كفورا\nقوله تعالى : وإذا مسكم الضر في البحر الضر لفظ يعم خوف الغرق والإمساك عن الجري . وأهوال حالاته اضطرابه وتموجه .\nضل من تدعون إلا إياه ضل معناه تلف وفقد ; وهي عبارة تحقير لمن يدعي إلها من دون الله . المعنى في هذه الآية : أن الكفار إنما يعتقدون في أصنامهم أنها شافعة ، وأن لها فضلا . وكل واحد منهم بالفطرة يعلم علما لا يقدر على مدافعته أن الأصنام لا فعل لها في الشدائد العظام ، فوقفهم الله من ذلك على حالة البحر حيث تنقطع الحيل .\nفلما نجاكم إلى البر أعرضتم أي عن الإخلاص .\nوكان الإنسان كفورا الإنسان هنا الكافر . وقيل : وطبع الإنسان كفورا للنعم إلا من عصمه الله ; فالإنسان لفظ الجنس .\n                                    ",
        "saadi": "وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا ٧٦\n                                        \n                                        \n                                        \n                                        ومن رحمته الدالة على أنه وحده المعبود دون ما سواه أنهم إذا مسهم الضر في البحر فخافوا من الهلاك لتراكم الأمواج ضل عنهم ما كانوا يدعون من دون الله في حال الرخاء من الأحياء والأموات، فكأنهم لم يكونوا يدعونهم في وقت من الأوقات لعلمهم أنهم ضعفاء عاجزون عن كشف الضر وصرخوا بدعوة فاطر الأرض والسماوات الذي تستغيث به في شدائدها جميع المخلوقات وأخلصوا له الدعاء والتضرع في هذه الحال.\nفلما كشف الله عنهم الضر ونجاهم إلى البر ونسوا ما كانوا يدعون إليه من قبل وأشركوا به من لا ينفع ولا يضر ولا يعطي ولا يمنع وأعرضوا عن الإخلاص لربهم ومليكهم، وهذا من جهل الإنسان وكفره فإن الإنسان كفور للنعم، إلا من هدى الله فمن عليه بالعقل السليم واهتدى إلى الصراط المستقيم، فإنه يعلم أن الذي يكشف الشدائد وينجي من الأهوال هو الذي يستحق أن يفرد وتخلص له سائر الأعمال في الشدة والرخاء واليسر والعسر.\nوأما من خذل ووكل إلى عقله الضعيف فإنه لم يلحظ وقت الشدة إلا مصلحته الحاضرة وإنجاءه في تلك الحال.\nفلما حصلت له النجاة وزالت عنه المشقة ظن بجهله أنه قد أعجز الله ولم يخطر بقلبه شيء من العواقب الدنيوية فضلا عن أمور الآخرة.\n                                    "
      },
      "originalText": "وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا ٧٦"
    },
    {
      "number": 2097,
      "text": "أَفَأَمِنْتُمْ أَنْ يَخْسِفَ بِكُمْ جَانِبَ الْبَرِّ أَوْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا ثُمَّ لَا تَجِدُوا لَكُمْ وَكِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 68,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 246,
      "hizbQuarter": 115,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا ٨٦\n                                    \n                                    \n                                    يقول تعالى أفحسبتم أن نخرجكم إلى البر ، أمنتم من انتقامه وعذابه!\n( أن يخسف بكم جانب البر أو يرسل عليكم حاصبا ) ، وهو المطر الذي فيه حجارة قاله مجاهد وغير واحد كما قال تعالى : ( إنا أرسلنا عليهم حاصبا إلا آل لوط نجيناهم بسحر ) [ القمر 34 ] وقد قال في الآية الأخرى ( وأمطرنا عليها حجارة من سجيل ) [ هود 82 ] وقال : ( أأمنتم من في السماء أن يخسف بكم الأرض فإذا هي تمور أم أمنتم من في السماء أن يرسل عليكم حاصبا فستعلمون كيف نذير ) [ الملك 16 ، 17 ]\nوقوله ( ثم لا تجدوا لكم وكيلا ) أي ناصرا يرد ذلك عنكم وينقذكم منه والله سبحانه وتعالى أعلم ]\n                                    ",
        "qortoby": "أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا ٨٦\n                                    \n                                    \n                                    قوله تعالى : أفأمنتم أن يخسف بكم جانب البر أو يرسل عليكم حاصبا ثم لا تجدوا لكم وكيلا قوله تعالى : أفأمنتم أن يخسف بكم جانب البر بين أنه قادر على هلاكهم في البر وإن سلموا من البحر . والخسف : أن تنهار الأرض بالشيء ; يقال : بئر خسيف إذا انهدم أصلها . وعين خاسف أي غارت حدقتها في الرأس . وعين من الماء خاسفة أي غار ماؤها . وخسفت الشمس أي غابت عن الأرض . وقال أبو عمرو : والخسيف البئر التي تحفر في الحجارة فلا ينقطع ماؤها كثرة . والجمع خسف . وجانب البر : ناحية الأرض ; وسماه جانبا لأنه يصير بعد الخسف جانبا . وأيضا فإن البحر جانب والبر جانب . وقيل : إنهم كانوا على ساحل البحر ، وساحله جانب البر ، وكانوا فيه آمنين من أهوال البحر ، فحذرهم ما أمنوه من البر كما حذرهم ما خافوه من البحر .\nأو يرسل عليكم حاصبا يعني ريحا شديدة ، وهي التي ترمي بالحصباء ، وهي الحصى الصغار ; قاله أبو عبيدة والقتبي . وقال قتادة : يعني حجارة من السماء تحصبهم ، كما فعل بقوم لوط . ويقال للسحابة التي ترمي بالبرد : حاصب ، وللريح التي تحمل التراب والحصباء حاصب وحصبة أيضا . قال لبيد :\nجرت عليها أن خوت من أهلها أذيالها كل عصوف حصبه\nوقال الفرزدق :\nمستقبلين شمال الشام يضربنا بحاصب كنديف القطن منثور\nثم لا تجدوا لكم وكيلا أي حافظا ونصيرا يمنعكم من بأس الله .\n                                    ",
        "saadi": "أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا ٨٦\n                                        \n                                        \n                                        \n                                        { أَفَأَمِنْتُمْ أَنْ يَخْسِفَ بِكُمْ جَانِبَ الْبَرِّ أَوْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا } أي: فهو على كل شيء قدير إن شاء أنزل عليكم عذابا من أسفل منكم بالخسف أو من فوقكم بالحاصب وهو العذاب الذي يحصبهم فيصبحوا هالكين، فلا تظنوا أن الهلاك لا يكون إلا في البحر.\n                                    "
      },
      "originalText": "أَفَأَمِنتُمۡ أَن يَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ يُرۡسِلَ عَلَيۡكُمۡ حَاصِبٗا ثُمَّ لَا تَجِدُواْ لَكُمۡ وَكِيلًا ٨٦"
    },
    {
      "number": 2098,
      "text": "أَمْ أَمِنْتُمْ أَنْ يُعِيدَكُمْ فِيهِ تَارَةً أُخْرَىٰ فَيُرْسِلَ عَلَيْكُمْ قَاصِفًا مِنَ الرِّيحِ فَيُغْرِقَكُمْ بِمَا كَفَرْتُمْ ۙ ثُمَّ لَا تَجِدُوا لَكُمْ عَلَيْنَا بِهِ تَبِيعًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 69,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 246,
      "hizbQuarter": 115,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا ٩٦\n                                    \n                                    \n                                    يقول تعالى ( أم أمنتم ) أيها المعرضون عنا بعدما اعترفوا بتوحيدنا في البحر وخرجوا إلى البر ( أن يعيدكم ) في البحر مرة ثانية ( فيرسل عليكم قاصفا من الريح ) أي يقصف الصواري ويغرق المراكب\nقال ابن عباس وغيره : القاصف ريح البحار التي تكسر المراكب وتغرقها .\nوقوله ( فيغرقكم بما كفرتم ) أي بسبب كفركم وإعراضكم عن الله تعالى\nوقوله : ( ثم لا تجدوا لكم علينا به تبيعا ) قال ابن عباس نصيرا\nوقال مجاهد نصيرا ثائرا ، أي يأخذ بثأركم بعدكم\nوقال قتادة ولا نخاف أحدا يتبعنا بشيء من ذلك\n                                    ",
        "qortoby": "أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا ٩٦\n                                    \n                                    \n                                    قوله تعالى : أم أمنتم أن يعيدكم فيه تارة أخرى فيرسل عليكم قاصفا من الريح فيغرقكم بما كفرتم ثم لا تجدوا لكم علينا به تبيعا\nقوله تعالى : أم أمنتم أن يعيدكم فيه تارة أخرى يعني في البحر .\nفيرسل عليكم قاصفا من الريح القاصف : الريح الشديدة التي تكسر بشدة ; من قصف الشيء يقصفه ; أي كسره بشدة . والقصف : الكسر ; يقال : قصفت الريح السفينة . وريح قاصف : شديدة . ورعد قاصف : شديد الصوت . يقال : قصف الرعد وغيره قصيفا . والقصيف : هشيم الشجر . والتقصف التكسر . والقصف أيضا : اللهو واللعب ; يقال : إنها مولدة .\nفيغرقكم بما كفرتم أي بكفركم . وقرأ ابن كثير وأبو عمرو \" نخسف بكم \" \" أو نرسل عليكم \" \" أن نعيدكم \" \" فنرسل عليكم \" \" فنغرقكم بالنون في الخمسة على التعظيم ، لقوله : علينا ، الباقون بالياء ; لقوله في الآية قبل : إياه . وقرأ أبو جعفر وشيبة ورويس ومجاهد \" فتغرقكم \" بالتاء نعتا للريح . وعن الحسن وقتادة \" فيغرقكم \" بالياء مع التشديد في الراء . وقرأ أبو جعفر \" الرياح \" هنا وفي كل القرآن . وقيل : إن القاصف المهلكة في البر ، والعاصف المغرقة في البحر ; حكاه الماوردي .\nثم لا تجدوا لكم علينا به تبيعا قال مجاهد : ثائرا . النحاس : وهو من الثأر . وكذلك يقال لكل من طلب بثأر أو غيره : تبيع وتابع ; ومنه فاتباع بالمعروف أي مطالبة .\n                                    ",
        "saadi": "أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا ٩٦\n                                        \n                                        \n                                        \n                                        وإن ظننتم ذلك فأنتم آمنون من { أَنْ يُعِيدَكُمْ } في البحر { تَارَةً أُخْرَى فَيُرْسِلَ عَلَيْكُمْ قَاصِفًا مِنَ الرِّيحِ } أي: ريحا شديدة جدا تقصف ما أتت عليه.\n{ فَيُغْرِقَكُمْ بِمَا كَفَرْتُمْ ثُمَّ لَا تَجِدُوا لَكُمْ عَلَيْنَا بِهِ تَبِيعًا } أي: تبعة ومطالبة فإن الله لم يظلمكم مثقال ذرة.\n                                    "
      },
      "originalText": "أَمۡ أَمِنتُمۡ أَن يُعِيدَكُمۡ فِيهِ تَارَةً أُخۡرَىٰ فَيُرۡسِلَ عَلَيۡكُمۡ قَاصِفٗا مِّنَ ٱلرِّيحِ فَيُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُواْ لَكُمۡ عَلَيۡنَا بِهِۦ تَبِيعٗا ٩٦"
    },
    {
      "number": 2099,
      "text": "۞ وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِمَّنْ خَلَقْنَا تَفْضِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 70,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 246,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا ٠٧\n                                    \n                                    \n                                    يخبر تعالى عن تشريفه لبني آدم وتكريمه إياهم في خلقه لهم على أحسن الهيئات وأكملها كما قال ) لقد خلقنا الإنسان في أحسن تقويم ) [ التين 4 ] أي يمشي قائما منتصبا على رجليه ويأكل بيديه وغيره من الحيوانات يمشي على أربع ويأكل بفمه وجعل له سمعا وبصرا وفؤادا يفقه بذلك كله وينتفع به ويفرق بين الأشياء ويعرف منافعها وخواصها ومضارها في الأمور الدنيوية والدينية\n( وحملناهم في البر ) أي على الدواب من الأنعام والخيل والبغال وفي \" البحر أيضا على السفن الكبار والصغار\n( ورزقناهم من الطيبات ) أي من زروع وثمار ولحوم وألبان من سائر أنواع الطعوم والألوان المشتهاة اللذيذة والمناظر الحسنة والملابس الرفيعة من سائر الأنواع على اختلاف أصنافها وألوانها وأشكالها مما يصنعونه لأنفسهم ويجلبه إليهم غيرهم من أقطار الأقاليم والنواحي\n( وفضلناهم على كثير ممن خلقنا تفضيلا ) أي من سائر الحيوانات وأصناف المخلوقات .\nوقد استدل بهذه الآية على أفضلية جنس البشر على جنس الملائكة قال عبد الرزاق أخبرنا معمر عن زيد بن أسلم قال قالت الملائكة يا ربنا إنك أعطيت بني آدم الدنيا يأكلون منها ويتنعمون ولم تعطنا ذلك فأعطناه في الآخرة فقال الله وعزتي وجلالي لا أجعل صالح ذرية من خلقت بيدي كمن قلت له كن فكان .\nوهذا الحديث مرسل من هذا الوجه وقد روي من وجه آخر متصلا\nوقال الحافظ أبو القاسم الطبراني حدثنا أحمد بن محمد بن صدقة البغدادي حدثنا إبراهيم بن عبد الله بن خالد المصيصي حدثنا حجاج بن محمد حدثنا أبو غسان محمد بن مطرف عن صفوان بن سليم عن عطاء بن يسار عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم قال إن الملائكة قالت يا ربنا أعطيت بني آدم الدنيا يأكلون فيها ويشربون ويلبسون ونحن نسبح بحمدك ولا نأكل ولا نشرب ولا نلهو فكما جعلت لهم الدنيا فاجعل لنا الآخرة قال لا أجعل صالح ذرية من خلقت بيدي كمن قلت له كن ، فكان .\nوقد روى ابن عساكر من طريق محمد بن أيوب الرازي حدثنا الحسن بن علي بن خلف الصيدلاني حدثنا سليمان بن عبد الرحمن حدثني عثمان بن حصن بن عبيدة بن علاق سمعت عروة بن رويم اللخمي حدثني أنس بن مالك عن رسول الله صلى الله عليه وسلم قال إن الملائكة قالوا : ربنا خلقتنا وخلقت بني آدم فجعلتهم يأكلون الطعام ويشربون الشراب ويلبسون الثياب ويتزوجون النساء ويركبون الدواب ينامون ويستريحون ولم تجعل لنا من ذلك شيئا فاجعل لهم الدنيا ولنا الآخرة فقال الله عز وجل لا أجعل من خلقته بيدي ونفخت فيه من روحي كمن قلت له كن فكان \"\nوقال الطبراني حدثنا عبدان بن أحمد حدثنا عمر بن سهل حدثنا عبيد الله بن تمام عن خالد الحذاء عن بشر بن شغاف عن أبيه ، عن عبد الله بن عمرو قال قال رسول الله صلى الله عليه وسلم ما شيء أكرم على الله يوم القيامة من ابن آدم قيل يا رسول الله ولا الملائكة قال ولا الملائكة الملائكة مجبورون بمنزلة الشمس والقمر \" وهذا حديث غريب جدا\n                                    ",
        "qortoby": "۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا ٠٧\n                                    \n                                    \n                                    قوله تعالى : ولقد كرمنا بني آدم وحملناهم في البر والبحر ورزقناهم من الطيبات وفضلناهم على كثير ممن خلقنا تفضيلا فيه ثلاث مسائل : الأولى : قوله تعالى : ولقد كرمنا بني آدم الآية . لما ذكر من الترهيب ما ذكر بين النعمة عليهم أيضا . كرمنا تضعيف كرم ; أي جعلنا لهم كرما أي شرفا وفضلا . وهذا هو كرم نفي النقصان لا كرم المال . وهذه الكرامة يدخل فيها خلقهم على هذه الهيئة في امتداد القامة وحسن الصورة ، وحملهم في البر والبحر مما لا يصح لحيوان سوى بني آدم أن يكون يتحمل بإرادته وقصده وتدبيره . وتخصيصهم بما خصهم به من المطاعم والمشارب والملابس ، وهذا لا يتسع فيه حيوان اتساع بني آدم ; لأنهم يكسبون المال خاصة دون الحيوان ، ويلبسون الثياب ويأكلون المركبات من الأطعمة . وغاية كل حيوان يأكل لحما نيئا أو طعاما غير مركب . وحكى الطبري عن جماعة أن التفضيل هو أن يأكل بيده وسائر الحيوان بالفم . وروي عن ابن عباس ; ذكره المهدوي والنحاس ; وهو قول الكلبي ومقاتل ; ذكره الماوردي . وقال الضحاك : كرمهم بالنطق والتمييز . عطاء : كرمهم بتعديل القامة وامتدادها . يمان : بحسن الصورة . محمد بن كعب : بأن جعل محمدا - صلى الله عليه وسلم - منهم . وقيل أكرم الرجال باللحى والنساء بالذوائب . وقال محمد بن جرير الطبري : بتسليطهم على سائر الخلق ، وتسخير سائر الخلق لهم . وقيل : بالكلام والخط . وقيل : بالفهم والتمييز . والصحيح الذي يعول عليه أن التفضيل إنما كان بالعقل الذي هو عمدة التكليف ، . وبه يعرف الله ويفهم كلامه ، ويوصل إلى نعيمه وتصديق رسله ; إلا أنه لما لم ينهض بكل المراد من العبد بعثت الرسل وأنزلت الكتب . فمثال الشرع الشمس ، ومثال العقل العين ; فإذا فتحت وكانت سليمة رأت الشمس وأدركت تفاصيل الأشياء . وما تقدم من الأقوال بعضه أقوى من بعض . وقد جعل الله في بعض الحيوان خصالا يفضل بها ابن آدم أيضا ; كجري الفرس وسمعه وإبصاره ، وقوة الفيل وشجاعة الأسد وكرم الديك . وإنما التكريم والتفضيل بالعقل كما بيناه . والله أعلم .\nالثانية : قالت فرقة : هذه الآية تقتضي تفضيل الملائكة على الإنس والجن من حيث إنهم المستثنون في قوله - تعالى - : ولا الملائكة المقربون . وهذا غير لازم من الآية ، بل التفضيل فيها بين الإنس والجن ; فإن هذه الآية إنما عدد الله فيها على بني آدم ما خصهم به من سائر الحيوان ، والجن هو الكثير المفضول ، والملائكة هم الخارجون عن الكثير المفضول ، ولم تتعرض الآية لذكرهم ، بل يحتمل أن الملائكة أفضل ، ويحتمل العكس ، ويحتمل التساوي ، وعلى الجملة فالكلام لا ينتهي في هذه المسألة إلى القطع . وقد تحاشى قوم من الكلام في هذا كما تحاشوا من الكلام في تفضيل بعض الأنبياء على بعض ; إذ في الخبر لا تخايروا بين الأنبياء ولا تفضلوني على يونس بن متى . وهذا ليس بشيء ; لوجود النص في القرآن في التفضيل بين الأنبياء . وقد بيناه في [ البقرة ] ومضى فيها الكلام في تفضيل الملائكة والمؤمن .\nالثالثة : قوله تعالى : ورزقناهم من الطيبات يعني لذيذ المطاعم والمشارب . قال مقاتل : السمن والعسل والزبد والتمر والحلوى ، وجعل رزق غيرهم ما لا يخفى عليكم من التبن والعظام وغيرها .\nوفضلناهم على كثير ممن خلقنا تفضيلا أي على البهائم والدواب والوحش والطير بالغلبة والاستيلاء ، والثواب والجزاء والحفظ والتمييز وإصابة الفراسة .\nالرابعة : هذه الآية ترد ما روي عن عائشة - رضي الله عنها - ، قالت قال رسول الله - صلى الله عليه وسلم - : احرموا أنفسكم طيب الطعام فإنما قوي الشيطان أن يجري في العروق منها . وبه يستدل كثير من الصوفية في ترك أكل الطيبات ، ولا أصل له ; لأن القرآن يرده ، والسنة الثابتة بخلافه ، على ما تقرر في غير موضع . وقد حكى أبو حامد الطوسي قال : كان سهل يقتات من ورق النبق مدة . وأكل دقاق ورق التين ثلاث سنين . وذكر إبراهيم بن البنا قال : صحبت ذا النون من إخميم إلى الإسكندرية ، فلما كان وقت إفطاره أخرجت قرصا وملحا كان معي ، وقلت : هلم . فقال لي : ملحك مدقوق ؟ قلت نعم . قال : لست تفلح ! فنظرت إلى مزوده وإذا فيه قليل سويق شعير يسف منه . وقال أبو يزيد : ما أكلت شيئا مما يأكله بنو آدم أربعين سنة . قال علماؤنا : وهذا مما لا يجوز حمل النفس عليه ; لأن الله - تعالى - أكرم الآدمي بالحنطة وجعل قشورها لبهائمهم ، فلا يصح مزاحمة الدواب في أكل التبن ، وأما سويق الشعير فإنه يورث القولنج ، وإذا اقتصر الإنسان على خبز الشعير والملح الجريش فإنه ينحرف مزاجه ; لأن خبز الشعير بارد مجفف ، والملح يابس قابض يضر الدماغ والبصر . وإذا مالت النفس إلى ما يصلحها فمنعت فقد قوومت حكمة البارئ سبحانه بردها ، ثم يؤثر ذلك في البدن ، فكان هذا الفعل مخالفا للشرع والعقل . ومعلوم أن البدن مطية الآدمي ، ومتى لم يرفق بالمطية لم تبلغ . وروي عن إبراهيم بن أدهم أنه اشترى زبدا وعسلا وخبز حوارى ، فقيل له : هذا كله ؟ فقال : إذا وجدنا أكلنا أكل الرجال ، وإذا عدمنا صبرنا صبر الرجال . وكان الثوري يأكل اللحم والعنب والفالوذج ثم يقوم إلى الصلاة . ومثل هذا عن السلف كثير . وقد تقدم منه ما يكفي في المائدة والأعراف وغيرهما . والأول غلو في الدين إن صح عنهم ورهبانية ابتدعوها ما كتبناها عليهم .\n                                    ",
        "saadi": "۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا ٠٧\n                                        \n                                        \n                                        \n                                        وهذا من كرمه عليهم وإحسانه الذي لا يقادر قدره حيث كرم بني آدم بجميع وجوه الإكرام، فكرمهم بالعلم والعقل وإرسال الرسل وإنزال الكتب، وجعل منهم الأولياء والأصفياء وأنعم عليهم بالنعم الظاهرة والباطنة.\n{ وَحَمَلْنَاهُمْ فِي الْبَرِّ } على الركاب من الإبل والبغال والحمير والمراكب البرية. { وَ } في { الْبَحْرِ } في السفن والمراكب { وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ } من المآكل والمشارب والملابس والمناكح. فما من طيب تتعلق به حوائجهم إلا وقد أكرمهم الله به ويسره لهم غاية التيسير.\n{ وَفَضَّلْنَاهُمْ عَلَى كَثِيرٍ مِمَّنْ خَلَقْنَا تَفْضِيلًا } بما خصهم به من المناقب وفضلهم به من الفضائل التي ليست لغيرهم من أنواع المخلوقات.\nأفلا يقومون بشكر من أولى النعم ودفع النقم ولا تحجبهم النعم عن المنعم فيشتغلوا بها عن عبادة ربهم بل ربما استعانوا بها على معاصيه.\n                                    "
      },
      "originalText": "۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا ٠٧"
    },
    {
      "number": 2100,
      "text": "يَوْمَ نَدْعُو كُلَّ أُنَاسٍ بِإِمَامِهِمْ ۖ فَمَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَأُولَٰئِكَ يَقْرَءُونَ كِتَابَهُمْ وَلَا يُظْلَمُونَ فَتِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 71,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 247,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۢ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا ١٧\n                                    \n                                    \n                                    يخبر تبارك وتعالى عن يوم القيامة أنه يحاسب كل أمة بإمامهم\nوقد اختلفوا في ذلك فقال مجاهد وقتادة أي بنبيهم وهذا كقوله : ( ولكل أمة رسول فإذا جاء رسولهم قضي بينهم بالقسط وهم لا يظلمون ) [ يونس 47 .\nوقال بعض السلف هذا أكبر شرف لأصحاب الحديث لأن إمامهم النبي صلى الله عليه وسلم\nوقال ابن زيد بكتابهم الذي أنزل على نبيهم من التشريع\nواختاره ابن جرير وروي عن ابن أبي نجيح عن مجاهد أنه قال : بكتبهم فيحتمل أن يكون أراد هذا وأن يكون أراد ما رواه العوفي عن ابن عباس في قوله : ( يوم ندعوا كل أناس بإمامهم ) أي بكتاب أعمالهم وكذا قال أبو العالية والحسن والضحاك وهذا القول هو الأرجح لقوله تعالى : ( وكل شيء أحصيناه في إمام مبين ) يس : 12 ] وقال تعالى ( ووضع الكتاب فترى المجرمين مشفقين مما فيه ويقولون ياويلتنا مال هذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا ) الكهف : 49 ]\nوقال تعالى : ( وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون هذا كتابنا ينطق عليكم بالحق إنا كنا نستنسخ ما كنتم تعملون ) الجاثية : 28 ، 29 .\nوهذا لا ينافي أن يجاء بالنبي إذا حكم الله بين أمته فإنه لا بد أن يكون شاهدا عليها بأعمالها كما قال : ( وأشرقت الأرض بنور ربها ووضع الكتاب وجيء بالنبيين والشهداء ) الزمر : 69 ، وقال ( فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا ) النساء : 41 .\nولكن المراد هاهنا بالإمام هو كتاب الأعمال ولهذا قال تعالى : ( يوم ندعو كل أناس بإمامهم فمن أوتي كتابه بيمينه فأولئك يقرءون كتابهم ) أي من فرحته وسروره بما فيه من العمل الصالح يقرؤه ويحب قراءته كما قال تعالى : ( فأما من أوتي كتابه بيمينه فيقول هاؤم اقرءوا كتابيه إني ظننت أني ملاق حسابيه ) إلى أن قال ( وأما من أوتي كتابه بشماله فيقول يا ليتني لم أوت كتابيه ولم أدر ما حسابيه ) الحاقة : 19 26 .\nوقوله : ( ولا يظلمون فتيلا ) قد تقدم أن الفتيل هو الخيط المستطيل في شق النواة\nوقد روى الحافظ أبو بكر البزار حديثا في هذا فقال حدثنا محمد بن يعمر ومحمد بن عثمان بن كرامة قالا : حدثنا عبيد الله بن موسى عن إسرائيل عن السدي عن أبيه عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم في قول الله ( يوم ندعوا كل أناس بإمامهم ) قال يدعى أحدهم فيعطى كتابه بيمينه ويمد له في جسمه ويبيض وجهه ويجعل على رأسه تاج من لؤلؤة تتلألأ فينطلق إلى أصحابه فيرونه من بعيد فيقولون اللهم ائتنا بهذا وبارك لنا في هذا فيأتيهم فيقول لهم : أبشروا فإن لكل رجل منكم مثل هذا وأما الكافر فيسود وجهه ويمد له في جسمه ويراه أصحابه فيقولون نعوذ بالله من هذا أو من شر هذا اللهم لا تأتنا به فيأتيهم فيقولون اللهم أخزه فيقول أبعدكم الله فإن لكل رجل منكم مثل هذا\nثم قال البزار لا يروى إلا من هذا الوجه .\n                                    ",
        "qortoby": "يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۢ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا ١٧\n                                    \n                                    \n                                    قوله تعالى : يوم ندعوا كل أناس بإمامهم فمن أوتي كتابه بيمينه فأولئك يقرءون كتابهم ولا يظلمون فتيلا قوله تعالى : يوم ندعوا كل أناس بإمامهم روى الترمذي عن أبي هريرة عن النبي - صلى الله عليه وسلم - في قوله - تعالى - : يوم ندعو كل أناس بإمامهم قال : يدعى أحدهم فيعطى كتابه بيمينه ، ويمد له في جسمه ستون ذراعا ، ويبيض وجهه ويجعل على رأسه تاج من لؤلؤ يتلألأ فينطلق إلى أصحابه فيرونه من بعيد فيقولون اللهم ائتنا بهذا وبارك لنا في هذا حتى يأتيهم فيقول أبشروا لكل منكم مثل هذا - قال - وأما الكافر فيسود وجهه ويمد له في جسمه ستون ذراعا على صورة آدم ويلبس تاجا فيراه أصحابه فيقولون نعوذ بالله من شر هذا ! اللهم لا تأتنا بهذا . قال : فيأتيهم فيقولون اللهم أخره . فيقول أبعدكم الله فإن لكل رجل منكم مثل هذا . قال أبو عيسى : هذا حديث حسن غريب . ونظير هذا قوله : وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون . والكتاب يسمى إماما ; لأنه يرجع إليه في تعرف أعمالهم . وقال ابن عباس والحسن وقتادة والضحاك : بإمامهم أي بكتابهم ، أي بكتاب كل إنسان منهم الذي فيه عمله ; دليله فمن أوتي كتابه بيمينه . وقال ابن زيد : بالكتاب المنزل عليهم . أي يدعى كل إنسان بكتابه الذي كان يتلوه ; فيدعى أهل التوراة بالتوراة ، وأهل القرآن بالقرآن ; فيقال : يا أهل القرآن ، ماذا عملتم ، هل امتثلتم أوامره هل اجتنبتم نواهيه ! وهكذا . وقال مجاهد : بإمامهم بنبيهم ، والإمام من يؤتم به . فيقال : هاتوا متبعي إبراهيم - عليه السلام - ، هاتوا متبعي موسى - عليه السلام - ، هاتوا متبعي الشيطان ، هاتوا متبعي الأصنام . فيقوم أهل الحق فيأخذون كتابهم بأيمانهم ، ويقوم أهل الباطل فيأخذون كتابهم بشمالهم . وقاله قتادة . وقال علي - رضي الله عنه - : بإمام عصرهم . وروى عن النبي - صلى الله عليه وسلم - في قوله : يوم ندعو كل أناس بإمامهم فقال : كل يدعى بإمام زمانهم وكتاب ربهم وسنة نبيهم فيقول هاتوا متبعي إبراهيم هاتوا متبعي موسى هاتوا متبعي عيسى هاتوا متبعي محمد - عليهم أفضل الصلوات والسلام - فيقوم أهل الحق فيأخذون كتابهم بأيمانهم ، ويقول : هاتوا متبعي الشيطان هاتوا متبعي رؤساء الضلالة إمام هدى وإمام ضلالة . وقال الحسن وأبو العالية : بإمامهم أي بأعمالهم . وقاله ابن عباس . فيقال : أين الراضون بالمقدور ، أين الصابرون عن المحذور . وقيل : بمذاهبهم ; فيدعون بمن كانوا يأتمون به في الدنيا : يا حنفي ، يا شافعي ، يا معتزلي ، يا قدري ، ونحوه ; فيتبعونه في خير أو شر أو على حق أو باطل ، وهذا معنى قول أبي عبيدة . وقد تقدم . وقال أبو هريرة : يدعى أهل الصدقة من باب الصدقة ، وأهل الجهاد من باب الجهاد . . . ، الحديث بطوله . أبو سهل : يقال أين فلان المصلي والصوام ، وعكسه الدفاف والنمام . وقال محمد بن كعب : بإمامهم بأمهاتهم . وإمام جمع آم . قالت الحكماء : وفي ذلك ثلاثة أوجه من الحكمة ; أحدها - لأجل عيسى . والثاني - إظهار لشرف الحسن والحسين . والثالث - لئلا يفتضح أولاد الزنا .\nقلت : وفي هذا القول نظر ; فإن في الحديث الصحيح عن ابن عمر قال : قال رسول الله - صلى الله عليه وسلم - : إذا جمع الله الأولين والآخرين يوم القيامة يرفع لكل غادر لواء فيقال هذه غدرة فلان بن فلان خرجه مسلم والبخاري . فقوله : هذه غدرة فلان بن فلان دليل على أن الناس يدعون في الآخرة بأسمائهم وأسماء آبائهم ، وهذا يرد على من قال : إنما يدعون بأسماء أمهاتهم لأن في ذلك سترا على آبائهم . والله أعلم .\nقوله تعالى : فمن أوتي كتابه بيمينه هذا يقوي قول من قال : بإمامهم بكتابهم ويقويه أيضا قوله : وكل شيء أحصيناه في إمام مبين .\nفأولئك يقرءون كتابهم ولا يظلمون فتيلا الفتيل الذي في شق النواة . وقد مضى في [ النساء ] .\n                                    ",
        "saadi": "يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۢ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا ١٧\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن حال الخلق يوم القيامة، وأنه يدعو كل أناس، ومعهم إمامهم وهاديهم إلى الرشد، وهم الرسل ونوابهم، فتعرض كل أمة، ويحضرها رسولهم الذي دعاهم، وتعرض أعمالهم على الكتاب الذي يدعو إليه الرسول، هل هي موافقة له أم لا؟ فينقسمون بهذا قسمين: { فَمَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ } لكونه اتبع إمامه، الهادي إلى صراط مستقيم، واهتدى بكتابه، فكثرت حسناته، وقلت سيئاته { فَأُولَئِكَ يَقْرَءُونَ كِتَابَهُمْ } قراءة سرور وبهجة، على ما يرون فيها مما يفرحهم ويسرهم. { وَلَا يُظْلَمُونَ فَتِيلًا } مما عملوه من الحسنات.\n                                    "
      },
      "originalText": "يَوۡمَ نَدۡعُواْ كُلَّ أُنَاسِۢ بِإِمَٰمِهِمۡۖ فَمَنۡ أُوتِيَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَأُوْلَٰٓئِكَ يَقۡرَءُونَ كِتَٰبَهُمۡ وَلَا يُظۡلَمُونَ فَتِيلٗا ١٧"
    },
    {
      "number": 2101,
      "text": "وَمَنْ كَانَ فِي هَٰذِهِ أَعْمَىٰ فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 72,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 247,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا ٢٧\n                                    \n                                    \n                                    وقوله ( ومن كان في هذه أعمى فهو في الآخرة أعمى وأضل سبيلا ) قال ابن عباس ومجاهد ، وقتادة وابن زيد : ( ومن كان في هذه ) أي في الحياة الدنيا ( أعمى ) عن حجج الله وآياته وبيناته ( فهو في الآخرة أعمى ) أي كذلك يكون ( وأضل سبيلا ) أي وأضل منه كما كان في الدنيا عياذا بالله من ذلك .\n                                    ",
        "qortoby": "وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا ٢٧\n                                    \n                                    \n                                    قوله تعالى : ومن كان في هذه أعمى فهو في الآخرة أعمى وأضل سبيلا قوله تعالى : ومن كان في هذه أعمى أي في الدنيا عن الاعتبار وإبصار الحق .\nفهو في الآخرة أي في أمر الآخرة\nأعمى وقال عكرمة : جاء نفر من أهل اليمن إلى ابن عباس فسألوه عن هذه الآية فقال : اقرءوا ما قبلها ربكم الذي يزجي لكم الفلك في البحر - إلى - \" تفضيلا \" . قال ابن عباس : من كان في هذه النعم والآيات التي رأى أعمى فهو عن الآخرة التي لم يعاين أعمى وأضل سبيلا . وقيل : المعنى من عمي عن النعم التي أنعم الله بها عليه في الدنيا فهو عن نعم الآخرة أعمى . وقيل : المعنى من كان في الدنيا التي أمهل فيها وفسح له ووعد بقبول التوبة أعمى فهو في الآخرة التي لا توبة فيها أعمى . وقال الحسن : من كان في هذه الدنيا كافرا ضالا فهو في الآخرة أعمى وأضل سبيلا وقيل : ومن كان في الدنيا أعمى عن حجج الله بعثه الله يوم القيامة أعمى ; كما قال : ونحشره يوم القيامة أعمى الآيات . وقال : ونحشرهم يوم القيامة على وجوههم عميا وبكما وصما مأواهم جهنم . وقيل : المعنى في قوله فهو في الآخرة أعمى في جميع الأقوال : أشد عمى ; لأنه من عمى القلب ، ولا يقال مثله في عمى العين . قال الخليل وسيبويه : لأنه خلقة بمنزلة اليد والرجل ، فلم يقل ما أعماه كما لا يقال ما أيداه . الأخفش : لم يقل فيه ذلك لأنه على أكثر من ثلاثة أحرف ، وأصله أعمى . وقد أجاز بعض النحويين ما أعماه وما أعشاه ; لأن فعله عمي وعشى . وقال الفراء : حدثني بالشام شيخ بصري أنه سمع العرب تقول : ما أسود شعره . قال الشاعر :\nما في المعالي لكم ظل ولا ثمر وفي المخازي لكم أشباح أشياخ أما الملوك فأنت اليوم ألأمهم\nلؤما وأبيضهم سربال طباخ\nوأمال أبو بكر وحمزة والكسائي وخلف الحرفين أعمى وأعمى وفتح الباقون . وأمال أبو عمرو الأول وفتح الثاني .\nوأضل سبيلا يعني أنه لا يجد طريقا إلى الهداية .\n                                    ",
        "saadi": "وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا ٢٧\n                                        \n                                        \n                                        \n                                        { وَمَنْ كَانَ فِي هَذِهِ } الدنيا { أَعْمَى } عن الحق فلم يقبله، ولم ينقد له، بل اتبع الضلال. { فَهُوَ فِي الْآخِرَةِ أَعْمَى } عن سلوك طريق الجنة كما لم يسلكه في الدنيا، { وَأَضَلُّ سَبِيلًا } فإن الجزاء من جنس العمل، كما تدين تدان.\nوفي هذه الآية دليل على أن كل أمة تدعى إلى دينها وكتابها، هل عملت به أم لا؟\nوأنهم لا يؤاخذون بشرع نبي لم يؤمروا باتباعه، وأن الله لا يعذب أحدًا إلا بعد قيام الحجة عليه ومخالفته لها.\nوأن أهل الخير، يعطون كتبهم بأيمانهم، ويحصل لهم من الفرح والسرور شيء عظيم، وأن أهل الشر بعكس ذلك، لأنهم لا يقدرون على قراءة كتبهم، من شدة غمهم وحزنهم وثبورهم.\n                                    "
      },
      "originalText": "وَمَن كَانَ فِي هَٰذِهِۦٓ أَعۡمَىٰ فَهُوَ فِي ٱلۡأٓخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِيلٗا ٢٧"
    },
    {
      "number": 2102,
      "text": "وَإِنْ كَادُوا لَيَفْتِنُونَكَ عَنِ الَّذِي أَوْحَيْنَا إِلَيْكَ لِتَفْتَرِيَ عَلَيْنَا غَيْرَهُ ۖ وَإِذًا لَاتَّخَذُوكَ خَلِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 73,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 247,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا ٣٧\n                                    \n                                    \n                                    يخبر تعالى عن تأييد رسوله - صلوات الله عليه وسلامه - وتثبيته ، وعصمته وسلامته من شر الأشرار وكيد الفجار ، وأنه تعالى هو المتولي أمره ونصره ، وأنه لا يكله إلى أحد من خلقه ، بل هو وليه وحافظه وناصره ومؤيده ومظفره ، ومظهر دينه على من عاداه وخالفه وناوأه ، في مشارق الأرض ومغاربها ، صلى الله عليه وسلم تسليما كثيرا إلى يوم الدين .\n                                    ",
        "qortoby": "وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا ٣٧\n                                    \n                                    \n                                    قوله تعالى : وإن كادوا ليفتنونك عن الذي أوحينا إليك لتفتري علينا غيره وإذا لاتخذوك خليلا قال سعيد بن جبير : كان النبي - صلى الله عليه وسلم - يستلم الحجر الأسود في طوافه ، فمنعته قريش وقالوا : لا ندعك تستلم حتى تلم بآلهتنا . فحدث نفسه وقال : ما علي أن ألم بها بعد أن يدعوني أستلم الحجر والله يعلم أني لها كاره فأبى الله - تعالى - ذلك وأنزل عليه هذه الآية ; قاله مجاهد وقتادة . وقال ابن عباس في رواية عطاء : نزلت في وفد ثقيف ، أتوا النبي - صلى الله عليه وسلم - فسألوه شططا وقالوا : متعنا بآلهتنا سنة حتى نأخذ ما يهدى لها ، فإذا أخذناه كسرناها وأسلمنا ، وحرم وادينا كما حرمت مكة ، حتى تعرف العرب فضلنا عليهم ; فهم رسول الله - صلى الله عليه وسلم - أن يعطيهم ذلك فنزلت هذه الآية . وقيل : هو قول أكابر قريش للنبي - صلى الله عليه وسلم - : اطرد عنا هؤلاء السقاط والموالي حتى نجلس معك ونسمع منك ; فهم بذلك حتى نهي عنه . وقال قتادة ذكر لنا أن قريشا خلوا برسول الله - صلى الله عليه وسلم - ذات ليلة إلى الصبح يكلمونه ويفخمونه ، ويسودونه ويقاربونه ; فقالوا : إنك تأتي بشيء لا يأتي به أحد من الناس ، وأنت سيدنا يا سيدنا ; وما زالوا به حتى كاد يقاربهم في بعض ما يريدون ، ثم عصمه الله من ذلك ، وأنزل الله - تعالى - هذه الآية . ومعنى ليفتنونك أي يزيلونك . يقال : فتنت الرجل عن رأيه إذا أزلته عما كان عليه ; قاله الهروي . وقيل يصرفونك ، والمعنى واحد .\nعن الذي أوحينا إليك أي حكم القرآن ; لأن في إعطائهم ما سألوه مخالفة لحكم القرآن .\nلتفتري علينا غيره أي لتختلق علينا غير ما أوحينا إليك ، وهو قول ثقيف : وحرم وادينا كما حرمت مكة ، شجرها وطيرها ووحشها ، فإن سألتك العرب لم خصصتهم فقل الله أمرني بذلك حتى يكون عذرا لك .\nوإذا لاتخذوك خليلا أي لو فعلت ما أرادوا لاتخذوك خليلا ، أي والوك وصافوك ; مأخوذ من الخلة ( بالضم ) وهي الصداقة لممايلته لهم . وقيل : لاتخذوك خليلا أي فقيرا . مأخوذ من الخلة ( بفتح الخاء ) وهي الفقر لحاجته إليهم .\n                                    ",
        "saadi": "وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا ٣٧\n                                        \n                                        \n                                        \n                                        يذكر تعالى منته على رسوله محمد صلى الله عليه وسلم وحفظه له من أعدائه الحريصين على فتنته بكل طريق، فقال: { وَإِنْ كَادُوا لَيَفْتِنُونَكَ عَنِ الَّذِي أَوْحَيْنَا إِلَيْكَ لِتَفْتَرِيَ عَلَيْنَا } أي: قد كادوا لك أمرًا لم يدركوه، وتحيلوا لك، على أن تفتري على الله غير الذي أنزلنا إليك، فتجيء بما يوافق أهواءهم، وتدع ما أنزل الله إليك.\n{ وَإِذَا } لو فعلت ما يهوون { لَاتَّخَذُوكَ خَلِيلًا } أي حبيبًا صفيًا، أعز عليهم من أحبابهم، لما جبلك الله عليه من مكارم الأخلاق، ومحاسن الآداب، المحببة للقريب والبعيد، والصديق والعدو.\nولكن لتعلم أنهم لم يعادوك وينابذوك العداوة، إلا للحق الذي جئت به لا لذاتك، كما قال الله تعالى { قَدْ نَعْلَمُ إِنَّهُ لَيَحْزُنُكَ الَّذِي يَقُولُونَ فَإِنَّهُمْ لَا يُكَذِّبُونَكَ وَلَكِنَّ الظَّالِمِينَ بِآيَاتِ اللَّهِ يَجْحَدُونَ }\n                                    "
      },
      "originalText": "وَإِن كَادُواْ لَيَفۡتِنُونَكَ عَنِ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ لِتَفۡتَرِيَ عَلَيۡنَا غَيۡرَهُۥۖ وَإِذٗا لَّٱتَّخَذُوكَ خَلِيلٗا ٣٧"
    },
    {
      "number": 2103,
      "text": "وَلَوْلَا أَنْ ثَبَّتْنَاكَ لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئًا قَلِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 74,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 247,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡ‍ٔٗا قَلِيلًا ٤٧\n                                    \n                                    \n                                    يخبر تعالى عن تأييد رسوله - صلوات الله عليه وسلامه - وتثبيته ، وعصمته وسلامته من شر الأشرار وكيد الفجار ، وأنه تعالى هو المتولي أمره ونصره ، وأنه لا يكله إلى أحد من خلقه ، بل هو وليه وحافظه وناصره ومؤيده ومظفره ، ومظهر دينه على من عاداه وخالفه وناوأه ، في مشارق الأرض ومغاربها ، صلى الله عليه وسلم تسليما كثيرا إلى يوم الدين .\n                                    ",
        "qortoby": "وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡ‍ٔٗا قَلِيلًا ٤٧\n                                    \n                                    \n                                    قوله تعالى : ولولا أن ثبتناك لقد كدت تركن إليهم شيئا قليلا\nقوله تعالى : ولولا أن ثبتناك أي على الحق وعصمناك من موافقتهم .\nلقد كدت تركن إليهم أي تميل . شيئا قليلا أي ركونا قليلا .\nقال قتادة : لما نزلت هذه الآية قال - عليه السلام - : اللهم لا تكلني إلى نفسي طرفة عين . وقيل : ظاهر الخطاب للنبي - صلى الله عليه وسلم - وباطنه إخبار عن ثقيف . والمعنى : وإن كادوا ليركنونك ، أي كادوا يخبرون عنك بأنك ملت إلى قولهم ; فنسب فعلهم إليه مجازا واتساعا ; كما تقول لرجل : كدت تقتل نفسك ، أي كاد الناس يقتلونك بسبب ما فعلت ; ذكره المهدوي . وقيل ما كان منه هم بالركون إليهم ، بل المعنى : ولولا فضل الله عليك لكان منك ميل إلى موافقتهم ، ولكن تم فضل الله عليك فلم تفعل ; ذكره القشيري . وقال ابن عباس : كان رسول الله - صلى الله عليه وسلم - معصوما ، ولكن هذا تعريف للأمة لئلا يركن أحد منهم إلى المشركين في شيء من أحكام الله - تعالى - وشرائعه .\n                                    ",
        "saadi": "وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡ‍ٔٗا قَلِيلًا ٤٧\n                                        \n                                        \n                                        \n                                        { وَ } مع هذا فـ { لَوْلَا أَنْ ثَبَّتْنَاكَ } على الحق، وامتننا عليك بعدم الإجابة لداعيهم، { لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئًا قَلِيلًا } من كثرة المعالجة، ومحبتك لهدايتهم.\n                                    "
      },
      "originalText": "وَلَوۡلَآ أَن ثَبَّتۡنَٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَيۡهِمۡ شَيۡ‍ٔٗا قَلِيلًا ٤٧"
    },
    {
      "number": 2104,
      "text": "إِذًا لَأَذَقْنَاكَ ضِعْفَ الْحَيَاةِ وَضِعْفَ الْمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 75,
      "juz": 15,
      "manzil": 4,
      "page": 289,
      "ruku": 247,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا ٥٧\n                                    \n                                    \n                                    إذا لأذقناك ضعف الحياة وضعف الممات ثم لا تجد لك علينا نصيرا\nيخبر تعالى عن تأييد رسوله - صلوات الله عليه وسلامه - وتثبيته ، وعصمته وسلامته من شر الأشرار وكيد الفجار ، وأنه تعالى هو المتولي أمره ونصره ، وأنه لا يكله إلى أحد من خلقه ، بل هو وليه وحافظه وناصره ومؤيده ومظفره ، ومظهر دينه على من عاداه وخالفه وناوأه ، في مشارق الأرض ومغاربها ، صلى الله عليه وسلم تسليما كثيرا إلى يوم الدين .\n                                    ",
        "qortoby": "إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا ٥٧\n                                    \n                                    \n                                    قوله تعالى : إذا لأذقناك ضعف الحياة وضعف الممات أي لو ركنت لأذقناك مثلي عذاب الحياة في الدنيا ومثلي عذاب الممات في الآخرة ; قاله ابن عباس ومجاهد وغيرهما . وهذا غاية الوعيد . وكلما كانت الدرجة أعلى كان العذاب عند المخالفة أعظم . قال الله - تعالى - : يانساء النبي من يأت منكن بفاحشة مبينة يضاعف لها العذاب ضعفين وضعف الشيء مثله مرتين ، وقد يكون الضعف النصيب ; كقوله - عز وجل - : لكل ضعف أي نصيب . وقد تقدم في الأعراف .\n                                    ",
        "saadi": "إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا ٥٧\n                                        \n                                        \n                                        \n                                        { إذًا } لو ركنت إليهم بما يهوون { لأذقناك ضعف الحياة وضعف الممات } أي لأصبناك بعذاب مضاعف ، في الحياة الدنيا والآخرة ، وذلك لكمال نعمة الله عليك ، وكمال معرفتك.\n{ ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيرًا } ينقذك مما يحل بك من العذاب، ولكن الله تعالى عصمك من أسباب الشر، ومن البشر فثبتك وهداك الصراط المستقيم، ولم تركن إليهم بوجه من الوجوه، فله عليك أتم نعمة وأبلغ منحة.\n                                    "
      },
      "originalText": "إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا ٥٧"
    }
  ]
}