{
  "number": 291,
  "ayahsNumber": 10,
  "ayahs": [
    {
      "number": 2116,
      "text": "إِلَّا رَحْمَةً مِنْ رَبِّكَ ۚ إِنَّ فَضْلَهُ كَانَ عَلَيْكَ كَبِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 87,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 249,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا ٧٨\n                                    \n                                    \n                                    ذكر تعالى نعمته وفضله العظيم على عبده ورسوله الكريم ، فيما أوحاه إليه من القرآن المجيد ، الذي لا يأتيه الباطل من بين يديه ولا من خلفه ، تنزيل من حكيم حميد .\n                                    ",
        "qortoby": "إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا ٧٨\n                                    \n                                    \n                                    إلا رحمة من ربك يعني لكن لا نشاء ذلك رحمة من ربك ; فهو استثناء ليس من الأول . وقيل : إلا أن يرحمك ربك فلا يذهب به .\nإن فضله كان عليك كبيرا إذ جعلك سيد ولد آدم . وأعطاك المقام المحمود وهذا الكتاب العزيز .\nوقال عبد الله بن مسعود : أول ما تفقدون من دينكم الأمانة ، وآخر ما تفقدون الصلاة ، وأن هذا القرآن كأنه قد نزع منكم ، تصبحون يوما وما معكم منه شيء . فقال رجل : كيف يكون ذلك يا أبا عبد الرحمن وقد ثبتناه في قلوبنا وأثبتناه في مصاحفنا ، نعلمه أبناءنا ويعلمه أبناؤنا أبناءهم إلى يوم القيامة ! قال : يسرى به في ليلة فيذهب بما في المصاحف وما في القلوب ، فتصبح الناس كالبهائم . ثم قرأ عبد الله ولئن شئنا لنذهبن بالذي أوحينا إليك الآية . أخرجه أبو بكر بن أبي شيبة بمعناه قال : أخبرنا أبو الأحوص عن عبد العزيز بن رفيع عن شداد بن معقل قال : قال عبد الله - يعني ابن مسعود - : إن هذا القرآن الذي بين أظهركم يوشك أن ينزع منكم . قال : قلت كيف ينزع منا وقد أثبته الله في قلوبنا وثبتناه في مصاحفنا ! قال : يسرى عليه في ليلة واحدة فينزع ما في القلوب ويذهب ما في المصاحف ويصبح الناس منه فقراء . ثم قرأ لئن شئنا لنذهبن بالذي أوحينا إليك وهذا إسناد صحيح . وعن ابن عمر : لا تقوم الساعة حتى يرجع القرآن من حيث نزل ، له دوي كدوي النحل ، فيقول الله ما بالك . فيقول : يا رب منك خرجت وإليك أعود ، أتلى فلا يعمل بي ، أتلى ولا يعمل بي . .\nقلت : قد جاء معنى هذا مرفوعا من حديث عبد الله بن عمرو بن العاص وحذيفة . قال حذيفة قال رسول الله - صلى الله عليه وسلم - : يدرس الإسلام كما يدرس وشي الثوب حتى لا يدرى ما صيام ولا صلاة ولا نسك ولا صدقة فيسرى على كتاب الله تعالى في ليلة فلا يبقى منه في الأرض آية وتبقى طوائف من الناس الشيخ الكبير والعجوز يقولون أدركنا آباءنا على هذه الكلمة لا إله إلا الله . وهم لا يدرون ما صلاة ولا صيام ولا نسك ولا صدقة . قال له صلة : ما تغني عنهم لا إله إلا الله ! وهم لا يدرون ما صلاة ولا صيام ولا نسك ولا صدقة ; فأعرض عنه حذيفة ; ثم رددها ثلاثا ، كل ذلك يعرض عنه حذيفة . ثم أقبل عليه حذيفة فقال : يا صلة ! تنجيهم من النار ، ثلاثا . خرجه ابن ماجه في السنن . وقال عبد الله بن عمر : خرج النبي - صلى الله عليه وسلم - وهو معصوب الرأس من وجع فضحك ، فصعد المنبر فحمد الله وأثنى عليه ثم قال : أيها الناس ما هذه الكتب التي تكتبون أكتاب غير كتاب الله يوشك أن يغضب الله لكتابه فلا يدع ورقا ولا قلبا إلا أخذ منه قالوا : يا رسول الله ، فكيف بالمؤمنين والمؤمنات يومئذ ؟ قال : من أراد الله به خيرا أبقى في قلبه لا إله إلا الله ذكره الثعلبي والغزنوي وغيرهما في التفسير .\n                                    ",
        "saadi": "إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا ٧٨\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 86 و87 :ـ\nيخبر تعالى أن القرآن والوحي الذي أوحاه إلى رسوله، رحمة منه عليه وعلى عباده، وهو أكبر النعم على الإطلاق على رسوله، فإن فضل الله عليه كبير، لا يقادر قدره.\nفالذي تفضل به عليك، قادر على أن يذهب به، ثم لا تجد رادًا يرده، ولا وكيلا بتوجه عند الله فيه.\nفلتغتبط به، وتقر به عينك، ولا يحزنك تكذيب المكذبين، واستهزاء الضالين، فإنهم عرضت عليهم أجل النعم، فردوها لهوانهم على الله وخذلانه لهم.\n                                    "
      },
      "originalText": "إِلَّا رَحۡمَةٗ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَيۡكَ كَبِيرٗا ٧٨"
    },
    {
      "number": 2117,
      "text": "قُلْ لَئِنِ اجْتَمَعَتِ الْإِنْسُ وَالْجِنُّ عَلَىٰ أَنْ يَأْتُوا بِمِثْلِ هَٰذَا الْقُرْآنِ لَا يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 88,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 249,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا ٨٨\n                                    \n                                    \n                                    ثم نبه تعالى على شرف هذا القرآن العظيم ، فأخبر أنه لو اجتمعت الإنس والجن كلهم ، واتفقوا على أن يأتوا بمثل ما أنزله على رسوله ، لما أطاقوا ذلك ولما استطاعوه ، ولو تعاونوا وتساعدوا وتظافروا ، فإن هذا أمر لا يستطاع ، وكيف يشبه كلام المخلوقين كلام الخالق ، الذي لا نظير له ، ولا مثال له ، ولا عديل له ؟ !\nوقد روى محمد بن إسحاق عن محمد بن أبي محمد ، عن سعيد [ بن جبير ] أو عكرمة ، عن ابن عباس : إن هذه الآية نزلت في نفر من اليهود ، جاءوا رسول الله صلى الله عليه وسلم فقالوا له : إنا نأتيك بمثل ما جئتنا به ، فأنزل الله هذه الآية .\nوفي هذا نظر ؛ لأن هذه السورة مكية ، وسياقها كله مع قريش ، واليهود إنما اجتمعوا به في المدينة . فالله أعلم .\n                                    ",
        "qortoby": "قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا ٨٨\n                                    \n                                    \n                                    قوله تعالى : قل لئن اجتمعت الإنس والجن على أن يأتوا بمثل هذا القرآن لا يأتون بمثله ولو كان بعضهم لبعض ظهيرا\nأي عونا ونصيرا ; مثلما يتعاون الشعراء على بيت شعر فيقيمونه . نزلت حين قال الكفار : لو نشاء لقلنا مثل هذا ; فأكذبهم الله - تعالى - . وقد مضى القول في إعجاز القرآن في أول الكتاب والحمد لله . و \" لا يأتون \" جواب القسم في لئن وقد يجزم على إرادة الشرط . قال الشاعر :\nلئن كان ما حدثته اليوم صادقا أقم في نهار القيظ للشمس باديا\n                                    ",
        "saadi": "قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا ٨٨\n                                        \n                                        \n                                        \n                                        وهذا دليل قاطع، وبرهان ساطع، على صحة ما جاء به الرسول وصدقه، حيث تحدى الله الإنس والجن أن يأتوا بمثله، وأخبر أنهم لا يأتون بمثله، ولو تعاونوا كلهم على ذلك لم يقدروا عليه.\nووقع كما أخبر الله، فإن دواعي أعدائه المكذبين به، متوفرة على رد ما جاء به بأي: وجه كان، وهم أهل اللسان والفصاحة، فلو كان عندهم أدنى تأهل وتمكن من ذلك لفعلوه.\nفعلم بذلك، أنهم أذعنوا غاية الإذعان، طوعًا وكرهًا، وعجزوا عن معارضته.\nوكيف يقدر المخلوق من تراب، الناقص من جميع الوجوه، الذي ليس له علم ولا قدرة ولا إرادة ولا مشيئة ولا كلام ولا كمال إلا من ربه، أن يعارض كلام رب الأرض والسماوات، المطلع على سائر الخفيات، الذي له الكمال المطلق، والحمد المطلق، والمجد العظيم، الذي لو أن البحر يمده من بعده سبعة أبحر مدادًا، والأشجار كلها أقلام، لنفذ المداد، وفنيت الأقلام، ولم تنفد كلمات الله.\nفكما أنه ليس أحد من المخلوقين مماثلاً لله في أوصافه فكلامه من أوصافه، التي لا يماثله فيها أحد، فليس كمثله شيء، في ذاته، وأسمائه، وصفاته، وأفعاله تبارك وتعالى.\nفتبًا لمن اشتبه عليه كلام الخالق بكلام المخلوق، وزعم أن محمدًا صلى الله عليه وسلم افتراه على الله واختلقه من نفسه.\n                                    "
      },
      "originalText": "قُل لَّئِنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰٓ أَن يَأۡتُواْ بِمِثۡلِ هَٰذَا ٱلۡقُرۡءَانِ لَا يَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضٖ ظَهِيرٗا ٨٨"
    },
    {
      "number": 2118,
      "text": "وَلَقَدْ صَرَّفْنَا لِلنَّاسِ فِي هَٰذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ فَأَبَىٰ أَكْثَرُ النَّاسِ إِلَّا كُفُورًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 89,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 249,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا ٩٨\n                                    \n                                    \n                                    وقوله : ( ولقد صرفنا للناس في هذا القرآن من كل مثل ) أي : بينا لهم الحجج والبراهين القاطعة ، ووضحنا لهم الحق وشرحناه وبسطناه ، ومع هذا ( فأبى أكثر الناس إلا كفورا ) أي : جحودا وردا للصواب .\n                                    ",
        "qortoby": "وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا ٩٨\n                                    \n                                    \n                                    قوله تعالى : ولقد صرفنا للناس في هذا القرآن من كل مثل فأبى أكثر الناس إلا كفورا قوله تعالى : ولقد صرفنا للناس في هذا القرآن من كل مثل أي وجهنا القول فيه بكل مثل يجب به الاعتبار ; من الآيات والعبر والترغيب والترهيب ، والأوامر والنواهي وأقاصيص الأولين ، والجنة والنار والقيامة .\nفأبى أكثر الناس إلا كفورا يريد أهل مكة ، بين لهم الحق وفتح لهم وأمهلهم حتى تبين لهم أنه الحق ، فأبوا إلا الكفر وقت تبين الحق . قال المهدوي : ولا حجة للقدري في قولهم : لا يقال أبى إلا لمن أبى فعل ما هو قادر عليه ; لأن الكافر وإن كان غير قادر على الإيمان بحكم الله عليه بالإعراض عنه وطبعه على قلبه ، فقد كان قادرا وقت الفسحة والمهلة على طلب الحق وتمييزه من الباطل .\n                                    ",
        "saadi": "وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا ٩٨\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وَلَقَدْ صَرَّفْنَا لِلنَّاسِ فِي هَذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ } أي: نوعنا فيه المواعظ والأمثال، وثنينا فيه المعاني التي يضطر إليها العباد، لأجل أن يتذكروا ويتقوا، فلم يتذكر إلا القليل منهم، الذين سبقت لهم من الله سابقة السعادة، وأعانهم الله بتوفيقه، وأما أكثر الناس فأبوا إلا كفورًا لهذه النعمة التي هي أكبر من جميع النعم، وجعلوا يتعنتون عليه [باقتراح] آيات غير آياته، يخترعونها من تلقاء أنفسهم الظالمة الجاهلة.\n                                    "
      },
      "originalText": "وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِي هَٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلٖ فَأَبَىٰٓ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورٗا ٩٨"
    },
    {
      "number": 2119,
      "text": "وَقَالُوا لَنْ نُؤْمِنَ لَكَ حَتَّىٰ تَفْجُرَ لَنَا مِنَ الْأَرْضِ يَنْبُوعًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 90,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 249,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا ٠٩\n                                    \n                                    \n                                    قال ابن جرير : حدثنا أبو كريب ، حدثنا يونس بن بكير ، حدثنا محمد بن إسحاق ، حدثني شيخ من أهل مصر ، قدم منذ بضع وأربعين سنة ، عن عكرمة ، عن ابن عباس : أن عتبة وشيبة ابني ربيعة ، وأبا سفيان بن حرب ، ورجلا من بني عبد الدار ، وأبا البختري أخا بني أسد ، والأسود بن المطلب بن أسد ، وزمعة بن الأسود ، والوليد بن المغيرة ، وأبا جهل بن هشام وعبد الله بن أبي أمية ، وأمية بن خلف ، والعاص بن وائل ، ونبيها ومنبها ابني الحجاج السهميين ، اجتمعوا ، أو : من اجتمع منهم ، بعد غروب الشمس عند ظهر الكعبة ، فقال بعضهم لبعض : ابعثوا إلى محمد فكلموه وخاصموه حتى تعذروا فيه فبعثوا إليه : أن أشراف قومك قد اجتمعوا لك ليكلموك . فجاءهم رسول الله صلى الله عليه وسلم سريعا وهو يظن أنه قد بدا لهم في أمره بداء ، وكان عليهم حريصا ، يحب رشدهم ، ويعز عليه عنتهم ، حتى جلس إليهم ، فقالوا : يا محمد ، إنا قد بعثنا إليك لنعذر فيك ، وإنا والله ما نعلم رجلا من العرب أدخل على قومه ما أدخلت على قومك! لقد شتمت الآباء ، وعبت الدين ، وسفهت الأحلام ، وشتمت الآلهة ، وفرقت الجماعة ، فما بقي من أمر قبيح إلا وقد جئته فيما بيننا وبينك! فإن كنت إنما جئت بهذا الحديث تطلب به مالا جمعنا لك من أموالنا حتى تكون أكثرنا مالا وإن كنت إنما تطلب الشرف فينا ، سودناك علينا ، وإن كنت تريد ملكا ملكناك علينا ، وإن كان هذا الذي يأتيك بما يأتيك رئيا تراه قد غلب عليك - وكانوا يسمون التابع من الجن الرئي - فربما كان ذلك ، بذلنا أموالنا في طلب الطب ، حتى نبرئك منه ، أو نعذر فيك .\nفقال رسول الله صلى الله عليه وسلم : \" ما بي ما تقولون ، ما جئتكم بما جئتكم به أطلب أموالكم ، ولا الشرف فيكم ، ولا الملك عليكم ، ولكن بعثني إليكم رسولا وأنزل علي كتابا ، وأمرني أن أكون لكم بشيرا ونذيرا ، فبلغتكم رسالة ربي ، ونصحت لكم ، فإن تقبلوا مني ما جئتكم به ، فهو حظكم في الدنيا والآخرة ، وإن تردوه علي أصبر لأمر الله ، حتى يحكم الله بيني وبينكم \" . أو كما قال رسول الله صلى الله عليه وسلم تسليما .\nفقالوا : يا محمد ، فإن كنت غير قابل منا ما عرضنا عليك ، فقد علمت أنه ليس أحد من الناس أضيق منا بلادا ، ولا أقل مالا ولا أشد عيشا منا ، فاسأل لنا ربك الذي بعثك بما بعثك به ، فليسير عنا هذه الجبال التي قد ضيقت علينا ، وليبسط لنا بلادنا ، وليفجر فيها أنهارا كأنهار الشام والعراق ، وليبعث لنا من مضى من آبائنا ، وليكن فيمن يبعث لنا قصي بن كلاب ، فإنه كان شيخا صدوقا ، فنسألهم عما تقول حق هو أم باطل ؟ فإن صنعت ما سألناك وصدقوك ، صدقناك ، وعرفنا منزلتك عند الله ، وأنه بعثك رسولا كما تقول!\nفقال لهم رسول الله صلى الله عليه وسلم : \" ما بهذا بعثت ، إنما جئتكم من عند الله بما بعثني به ، فقد بلغتكم ما أرسلت به ، فإن تقبلوه فهو حظكم في الدنيا والآخرة ، وإن تردوه علي أصبر لأمر الله ، حتى يحكم الله بيني وبينكم \" .\nقالوا : فإن لم تفعل لنا هذا فخذ لنفسك ، فاسأل ربك أن يبعث ملكا يصدقك بما تقول ويراجعنا عنك ، وتسأله فيجعل لك جنانا ، وكنوزا وقصورا من ذهب وفضة ، ويغنيك بها عما نراك تبتغي ، فإنك تقوم بالأسواق ، وتلتمس المعاش كما نلتمسه ، حتى نعرف فضل منزلتك من ربك ، إن كنت رسولا كما تزعم .\nفقال لهم رسول الله صلى الله عليه وسلم : \" ما أنا بفاعل ، ما أنا بالذي يسأل ربه هذا ، وما بعثت إليكم بهذا ، ولكن الله بعثني بشيرا ونذيرا ، فإن تقبلوا ما جئتكم به فهو حظكم في الدنيا والآخرة ، وإن تردوه علي أصبر لأمر الله حتى يحكم الله بيني وبينكم \" .\nقالوا : فأسقط السماء ، كما زعمت أن ربك إن شاء فعل ذلك ، فإنا لن نؤمن لك إلا أن تفعل .\nفقال لهم رسول الله صلى الله عليه وسلم : \" ذلك إلى الله إن شاء فعل بكم ذلك \" .\nفقالوا : يا محمد ، أما علم ربك أنا سنجلس معك ، ونسألك عما سألناك عنه ، ونطلب منك ما نطلب فيقدم إليك ويعلمك ما تراجعنا به ، ويخبرك ما هو صانع في ذلك بنا ، إذا لم نقبل منك ما جئتنا به ، فقد بلغنا أنه إنما يعلمك هذا رجل باليمامة ، يقال له : الرحمن ، وإنا والله لا نؤمن بالرحمن أبدا ، فقد أعذرنا إليك يا محمد ، أما والله لا نتركك وما فعلت بنا حتى نهلكك أو تهلكنا . وقال قائلهم : نحن نعبد الملائكة وهي بنات الله . وقال قائلهم : لن نؤمن لك حتى تأتي بالله والملائكة قبيلا .\nفلما قالوا ذلك قام رسول الله صلى الله عليه وسلم عنهم ، وقام معه عبد الله بن أبي أمية بن المغيرة بن عبد الله بن عمر بن مخزوم ، وهو ابن عمته ، ابن عاتكة ابنة عبد المطلب ، فقال : يا محمد ، عرض عليك قومك ما عرضوا ، فلم تقبله منهم ، ثم سألوك لأنفسهم أمورا ليعرفوا بها منزلتك من الله ، فلم تفعل ذلك ، ثم سألوك أن تعجل لهم ما تخوفهم به من العذاب ، فوالله لا أؤمن بك أبدا حتى تتخذ إلى السماء سلما ، ثم ترقى فيه ، وأنا أنظر حتى تأتيها ، وتأتي معك بنسخة منشورة ، معك أربعة من الملائكة ، يشهدون أنك كما تقول . وايم الله ، لو فعلت ذلك لظننت أني لا أصدقك . ثم انصرف عن رسول الله صلى الله عليه وسلم ، وانصرف رسول الله صلى الله عليه وسلم إلى أهله حزينا أسفا لما فاته ، مما كان طمع فيه من قومه حين دعوه ، ولما رأى من مباعدتهم إياه .\nوهكذا رواه زياد بن عبد الله البكائي ، عن ابن إسحاق ، حدثني بعض أهل العلم ، عن سعيد بن جبير وعكرمة ، عن ابن عباس ، فذكر مثله سواء .\nوهذا المجلس الذي اجتمع هؤلاء له ، لو علم الله منهم أنهم يسألون ذلك استرشادا لأجيبوا إليه ، ولكن علم أنهم إنما يطلبون ذلك كفرا وعنادا ، فقيل للرسول : إن شئت أعطيناهم ما سألوا فإن كفروا عذبتهم عذابا لا أعذبه أحدا من العالمين ، وإن شئت فتحت عليهم باب التوبة والرحمة ، فقال : \" بل تفتح عليهم باب التوبة والرحمة \" كما تقدم ذلك في حديثي ابن عباس والزبير بن العوام أيضا ، عند قوله تعالى : ( وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا ) [ الإسراء : 59 ] وقال تعالى : ( وقالوا ما لهذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا أو يلقى إليه كنز أو تكون له جنة يأكل منها وقال الظالمون إن تتبعون إلا رجلا مسحورا انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا ) [ الفرقان : 7 - 11 ] .\n                                    ",
        "qortoby": "وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا ٠٩\n                                    \n                                    \n                                    قوله تعالى : وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا\nقوله تعالى : وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا الآية نزلت في رؤساء قريش مثل عتبة وشيبة ابني ربيعة ، وأبي سفيان والنضر بن الحارث ، وأبي جهل وعبد الله بن أبي أمية ، وأمية بن خلف وأبي البختري ، والوليد بن المغيرة وغيرهم . وذلك أنهم لما عجزوا عن معارضة القرآن ولم يرضوا به معجزة ، اجتمعوا - فيما ذكر ابن إسحاق وغيره - بعد غروب الشمس عند ظهر الكعبة ، ثم قال بعضهم لبعض : ابعثوا إلى محمد - صلى الله عليه وسلم - فكلموه وخاصموه حتى تعذروا فيه ، فبعثوا إليه أن أشراف قومك قد اجتمعوا إليك ليكلموك فأتهم ، فجاءهم رسول الله - صلى الله عليه وسلم - وهو يظن أن قد بدا لهم فيما كلمهم فيه بدو ، وكان رسول الله - صلى الله عليه وسلم - حريصا يحب رشدهم ويعز عليه عنتهم ، حتى جلس إليهم فقالوا له : يا محمد ! إنا قد بعثنا إليك لنكلمك ، وإنا والله ما نعلم رجلا من العرب أدخل على قومه ما أدخلت على قومك ; لقد شتمت الآباء وعبت الدين وشتمت الآلهة وسفهت الأحلام وفرقت الجماعة ، فما بقي أمر قبيح إلا قد جئته فيما بيننا وبينك ، أو كما قالوا له . فإن كنت إنما جئت بهذا الحديث تطلب به مالا جمعنا لك من أموالنا حتى تكون أكثرنا مالا ، وإن كنت إنما تطلب به الشرف فينا فنحن نسودك علينا ، وإن كنت تريد به ملكا ملكناك علينا ، وإن كان هذا الذي يأتيك رئيا تراه قد غلب عليك - وكانوا يسمون التابع من الجن رئيا - فربما كان ذلك بذلنا أموالنا في طلب الطب لك حتى نبرئك منه أو نعذر فيك . فقال لهم رسول الله - صلى الله عليه وسلم - : ما بي ما تقولون ما جئت بما جئتكم به أطلب أموالكم ولا الشرف فيكم ولا الملك عليكم ولكن الله بعثني إليكم رسولا وأنزل علي كتابا وأمرني أن أكون لكم بشيرا ونذيرا فبلغتكم رسالات ربي ونصحت لكم فإن تقبلوا مني ما جئتكم به فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتى يحكم الله بيني وبينكم أو كما قال - صلى الله عليه وسلم - . قالوا : يا محمد ، فإن كنت غير قابل منا شيئا مما عرضناه عليك ، فإنك قد علمت أنه ليس من الناس أحد أضيق بلدا ولا أقل ماء ولا أشد عيشا منا ، فسل لنا ربك الذي بعثك بما بعثك به ، فليسير عنا هذه الجبال التي قد ضيقت علينا ، وليبسط لنا بلادنا وليخرق لنا فيها أنهارا كأنهار الشام ، وليبعث لنا من مضى من آبائنا ; وليكن فيمن يبعث لنا قصي بن كلاب ; فإنه كان شيخ صدق فنسألهم عما تقول ، أحق هو أم باطل ، فإن صدقوك وصنعت ما سألناك صدقناك ، وعرفنا به منزلتك من الله - تعالى - ، وأنه بعثك رسولا كما تقول . فقال لهم - صلوات الله عليه وسلامه - : ما بهذا بعثت إليكم إنما جئتكم من الله - تعالى - بما بعثني به وقد بلغتكم ما أرسلت به إليكم فإن تقبلوه فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتى يحكم الله بيني وبينكم . قالوا : فإذا لم تفعل هذا لنا فخذ لنفسك ! سل ربك أن يبعث معك ملكا يصدقك بما تقول ويراجعنا عنك ، واسأله فليجعل لك جنانا وقصورا وكنوزا من ذهب وفضة يغنيك بها عما نراك تبتغي ; فإنك تقوم بالأسواق وتلتمس المعاش كما نلتمس ، حتى نعرف فضلك ومنزلتك من ربك إن كنت رسولا كما تزعم . فقال لهم رسول الله : ما أنا بفاعل وما أنا بالذي يسأل ربه هذا وما بعثت بهذا إليكم ولكن الله بعثني بشيرا ونذيرا - أو كما قال - فإن تقبلوا مني ما جئتكم به فهو حظكم في الدنيا والآخرة وإن تردوه علي أصبر لأمر الله حتى يحكم الله بيني وبينكم قالوا : فأسقط السماء علينا كسفا كما زعمت أن ربك إن شاء فعل ; فإنا لن نؤمن لك إلا أن تفعل . قال فقال رسول الله - صلى الله عليه وسلم - : ذلك إلى الله - عز وجل - إن شاء أن يفعله بكم فعل قالوا : يا محمد ، فما علم ربك أنا سنجلس معك ونسألك عما سألناك عنه ونطلب منك ما نطلب ، فيتقدم إليك فيعلمك بما تراجعنا به ، ويخبرك ما هو صانع في ذلك بنا إذ لم نقبل منك ما جئتنا به . إنه قد بلغنا إنما يعلمك هذا رجل من اليمامة يقال له الرحمن ، وإنا والله لا نؤمن بالرحمن أبدا ، فقد أعذرنا إليك يا محمد ، وإنا والله لا نتركك وما بلغت منا حتى نهلكك أو تهلكنا . وقال قائلهم : نحن نعبد الملائكة وهي بنات الله . وقال قائلهم : لن نؤمن لك حتى تأتي بالله والملائكة قبيلا . فلما قالوا ذلك لرسول الله - صلى الله عليه وسلم - ، قام عنهم وقام معه عبد الله بن أبي أمية بن المغيرة بن عبد الله بن عمر بن مخزوم ، وهو ابن عمته ، هو لعاتكة بنت عبد المطلب ، فقال له : يا محمد عرض عليك قومك ما عرضوا فلم تقبله منهم ، ثم سألوك لأنفسهم أمورا ليعرفوا بها منزلتك من الله كما تقول ، ويصدقوك ويتبعوك فلم تفعل ثم سألوك أن تأخذ لنفسك ما يعرفون به فضلك عليهم ومنزلتك من الله فلم تفعل ثم سألوك أن تعجل لهم بعض ما تخوفهم به من العذاب فلم تفعل - أو كما قال له - فوالله لا أومن بك أبدا حتى تتخذ إلى السماء سلما ، ثم ترقى فيه وأنا أنظر حتى تأتيها ، ثم تأتي معك بصك معه أربعة من الملائكة يشهدون لك أنك كما تقول . وايم الله لو فعلت ذلك ما ظننت أني أصدقك ثم انصرف عن رسول الله - صلى الله عليه وسلم - ، وانصرف رسول الله - صلى الله عليه وسلم - إلى أهله حزينا آسفا لما فاته مما كان يطمع به من قومه حين دعوه ، ولما رأى من مباعدتهم إياه ، كله لفظ ابن إسحاق . وذكر الواحدي عن عكرمة عن ابن عباس : فأنزل الله - تعالى - وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا . ينبوعا يعني العيون ; عن مجاهد . وهي يفعول ، من نبع ينبع . وقرأ عاصم وحمزة والكسائي \" تفجر \" لنا مخففة ; واختاره أبو حاتم لأن الينبوع واحد . ولم يختلفوا في تفجر الأنهار أنه مشدد . قال أبو عبيد : والأولى مثلها . قال أبو حاتم . ليست مثلها ، لأن الأولى بعدها ينبوع وهو واحد ، والثانية بعدها الأنهار وهي جمع ، والتشديد يدل على التكثير . أجيب بأن ينبوعا وإن كان واحدا فالمراد به الجمع ، كما قال مجاهد . الينبوع عين الماء ، والجمع الينابيع . وقرأ قتادة أو يكون لك جنة .\n                                    ",
        "saadi": "وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا ٠٩\n                                        \n                                        \n                                        \n                                        فيقولون لرسول الله صلى الله عليه وسلم الذي أتى بهذا القرآن المشتمل على كل برهان وآية: { لَنْ نُؤْمِنَ لَكَ حَتَّى تَفْجُرَ لَنَا مِنَ الْأَرْضِ يَنْبُوعًا } أي: أنهارًا جارية.\n                                    "
      },
      "originalText": "وَقَالُواْ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ يَنۢبُوعًا ٠٩"
    },
    {
      "number": 2120,
      "text": "أَوْ تَكُونَ لَكَ جَنَّةٌ مِنْ نَخِيلٍ وَعِنَبٍ فَتُفَجِّرَ الْأَنْهَارَ خِلَالَهَا تَفْجِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 91,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 249,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا ١٩\n                                    \n                                    \n                                    قال ابن جرير : حدثنا أبو كريب ، حدثنا يونس بن بكير ، حدثنا محمد بن إسحاق ، حدثني شيخ من أهل مصر ، قدم منذ بضع وأربعين سنة ، عن عكرمة ، عن ابن عباس : أن عتبة وشيبة ابني ربيعة ، وأبا سفيان بن حرب ، ورجلا من بني عبد الدار ، وأبا البختري أخا بني أسد ، والأسود بن المطلب بن أسد ، وزمعة بن الأسود ، والوليد بن المغيرة ، وأبا جهل بن هشام وعبد الله بن أبي أمية ، وأمية بن خلف ، والعاص بن وائل ، ونبيها ومنبها ابني الحجاج السهميين ، اجتمعوا ، أو : من اجتمع منهم ، بعد غروب الشمس عند ظهر الكعبة ، فقال بعضهم لبعض : ابعثوا إلى محمد فكلموه وخاصموه حتى تعذروا فيه فبعثوا إليه : أن أشراف قومك قد اجتمعوا لك ليكلموك . فجاءهم رسول الله صلى الله عليه وسلم سريعا وهو يظن أنه قد بدا لهم في أمره بداء ، وكان عليهم حريصا ، يحب رشدهم ، ويعز عليه عنتهم ، حتى جلس إليهم ، فقالوا : يا محمد ، إنا قد بعثنا إليك لنعذر فيك ، وإنا والله ما نعلم رجلا من العرب أدخل على قومه ما أدخلت على قومك! لقد شتمت الآباء ، وعبت الدين ، وسفهت الأحلام ، وشتمت الآلهة ، وفرقت الجماعة ، فما بقي من أمر قبيح إلا وقد جئته فيما بيننا وبينك! فإن كنت إنما جئت بهذا الحديث تطلب به مالا جمعنا لك من أموالنا حتى تكون أكثرنا مالا وإن كنت إنما تطلب الشرف فينا ، سودناك علينا ، وإن كنت تريد ملكا ملكناك علينا ، وإن كان هذا الذي يأتيك بما يأتيك رئيا تراه قد غلب عليك - وكانوا يسمون التابع من الجن الرئي - فربما كان ذلك ، بذلنا أموالنا في طلب الطب ، حتى نبرئك منه ، أو نعذر فيك .\nفقال رسول الله صلى الله عليه وسلم : \" ما بي ما تقولون ، ما جئتكم بما جئتكم به أطلب أموالكم ، ولا الشرف فيكم ، ولا الملك عليكم ، ولكن بعثني إليكم رسولا وأنزل علي كتابا ، وأمرني أن أكون لكم بشيرا ونذيرا ، فبلغتكم رسالة ربي ، ونصحت لكم ، فإن تقبلوا مني ما جئتكم به ، فهو حظكم في الدنيا والآخرة ، وإن تردوه علي أصبر لأمر الله ، حتى يحكم الله بيني وبينكم \" . أو كما قال رسول الله صلى الله عليه وسلم تسليما .\nفقالوا : يا محمد ، فإن كنت غير قابل منا ما عرضنا عليك ، فقد علمت أنه ليس أحد من الناس أضيق منا بلادا ، ولا أقل مالا ولا أشد عيشا منا ، فاسأل لنا ربك الذي بعثك بما بعثك به ، فليسير عنا هذه الجبال التي قد ضيقت علينا ، وليبسط لنا بلادنا ، وليفجر فيها أنهارا كأنهار الشام والعراق ، وليبعث لنا من مضى من آبائنا ، وليكن فيمن يبعث لنا قصي بن كلاب ، فإنه كان شيخا صدوقا ، فنسألهم عما تقول حق هو أم باطل ؟ فإن صنعت ما سألناك وصدقوك ، صدقناك ، وعرفنا منزلتك عند الله ، وأنه بعثك رسولا كما تقول!\nفقال لهم رسول الله صلى الله عليه وسلم : \" ما بهذا بعثت ، إنما جئتكم من عند الله بما بعثني به ، فقد بلغتكم ما أرسلت به ، فإن تقبلوه فهو حظكم في الدنيا والآخرة ، وإن تردوه علي أصبر لأمر الله ، حتى يحكم الله بيني وبينكم \" .\nقالوا : فإن لم تفعل لنا هذا فخذ لنفسك ، فاسأل ربك أن يبعث ملكا يصدقك بما تقول ويراجعنا عنك ، وتسأله فيجعل لك جنانا ، وكنوزا وقصورا من ذهب وفضة ، ويغنيك بها عما نراك تبتغي ، فإنك تقوم بالأسواق ، وتلتمس المعاش كما نلتمسه ، حتى نعرف فضل منزلتك من ربك ، إن كنت رسولا كما تزعم .\nفقال لهم رسول الله صلى الله عليه وسلم : \" ما أنا بفاعل ، ما أنا بالذي يسأل ربه هذا ، وما بعثت إليكم بهذا ، ولكن الله بعثني بشيرا ونذيرا ، فإن تقبلوا ما جئتكم به فهو حظكم في الدنيا والآخرة ، وإن تردوه علي أصبر لأمر الله حتى يحكم الله بيني وبينكم \" .\nقالوا : فأسقط السماء ، كما زعمت أن ربك إن شاء فعل ذلك ، فإنا لن نؤمن لك إلا أن تفعل .\nفقال لهم رسول الله صلى الله عليه وسلم : \" ذلك إلى الله إن شاء فعل بكم ذلك \" .\nفقالوا : يا محمد ، أما علم ربك أنا سنجلس معك ، ونسألك عما سألناك عنه ، ونطلب منك ما نطلب فيقدم إليك ويعلمك ما تراجعنا به ، ويخبرك ما هو صانع في ذلك بنا ، إذا لم نقبل منك ما جئتنا به ، فقد بلغنا أنه إنما يعلمك هذا رجل باليمامة ، يقال له : الرحمن ، وإنا والله لا نؤمن بالرحمن أبدا ، فقد أعذرنا إليك يا محمد ، أما والله لا نتركك وما فعلت بنا حتى نهلكك أو تهلكنا . وقال قائلهم : نحن نعبد الملائكة وهي بنات الله . وقال قائلهم : لن نؤمن لك حتى تأتي بالله والملائكة قبيلا .\nفلما قالوا ذلك قام رسول الله صلى الله عليه وسلم عنهم ، وقام معه عبد الله بن أبي أمية بن المغيرة بن عبد الله بن عمر بن مخزوم ، وهو ابن عمته ، ابن عاتكة ابنة عبد المطلب ، فقال : يا محمد ، عرض عليك قومك ما عرضوا ، فلم تقبله منهم ، ثم سألوك لأنفسهم أمورا ليعرفوا بها منزلتك من الله ، فلم تفعل ذلك ، ثم سألوك أن تعجل لهم ما تخوفهم به من العذاب ، فوالله لا أؤمن بك أبدا حتى تتخذ إلى السماء سلما ، ثم ترقى فيه ، وأنا أنظر حتى تأتيها ، وتأتي معك بنسخة منشورة ، معك أربعة من الملائكة ، يشهدون أنك كما تقول . وايم الله ، لو فعلت ذلك لظننت أني لا أصدقك . ثم انصرف عن رسول الله صلى الله عليه وسلم ، وانصرف رسول الله صلى الله عليه وسلم إلى أهله حزينا أسفا لما فاته ، مما كان طمع فيه من قومه حين دعوه ، ولما رأى من مباعدتهم إياه .\nوهكذا رواه زياد بن عبد الله البكائي ، عن ابن إسحاق ، حدثني بعض أهل العلم ، عن سعيد بن جبير وعكرمة ، عن ابن عباس ، فذكر مثله سواء .\nوهذا المجلس الذي اجتمع هؤلاء له ، لو علم الله منهم أنهم يسألون ذلك استرشادا لأجيبوا إليه ، ولكن علم أنهم إنما يطلبون ذلك كفرا وعنادا ، فقيل للرسول : إن شئت أعطيناهم ما سألوا فإن كفروا عذبتهم عذابا لا أعذبه أحدا من العالمين ، وإن شئت فتحت عليهم باب التوبة والرحمة ، فقال : \" بل تفتح عليهم باب التوبة والرحمة \" كما تقدم ذلك في حديثي ابن عباس والزبير بن العوام أيضا ، عند قوله تعالى : ( وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا ) [ الإسراء : 59 ] وقال تعالى : ( وقالوا ما لهذا الرسول يأكل الطعام ويمشي في الأسواق لولا أنزل إليه ملك فيكون معه نذيرا أو يلقى إليه كنز أو تكون له جنة يأكل منها وقال الظالمون إن تتبعون إلا رجلا مسحورا انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا تبارك الذي إن شاء جعل لك خيرا من ذلك جنات تجري من تحتها الأنهار ويجعل لك قصورا بل كذبوا بالساعة وأعتدنا لمن كذب بالساعة سعيرا ) [ الفرقان : 7 - 11 ] .\nوقوله تعالى : ( حتى تفجر لنا من الأرض ينبوعا ) الينبوع : العين الجارية ، سألوه أن يجري لهم عينا معينا في أرض الحجاز هاهنا وهاهنا ، وذلك سهل يسير على الله تعالى ، لو شاء لفعله ولأجابهم إلى جميع ما سألوا وطلبوا ، ولكن علم أنهم لا يهتدون ، كما قال تعالى : ( إن الذين حقت عليهم كلمة ربك لا يؤمنون ولو جاءتهم كل آية حتى يروا العذاب الأليم ) [ يونس : 96 ، 97 ] وقال تعالى : ( ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون ) [ الأنعام : 111 ] .\n                                    ",
        "qortoby": "أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا ١٩\n                                    \n                                    \n                                    خلالها أي وسطها .\n                                    ",
        "saadi": "أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا ١٩\n                                        \n                                        \n                                        \n                                        { أَوْ تَكُونَ لَكَ جَنَّةٌ مِنْ نَخِيلٍ وَعِنَبٍ } فتستغنى بها عن المشي في الأسواق والذهاب والمجيء.\n                                    "
      },
      "originalText": "أَوۡ تَكُونَ لَكَ جَنَّةٞ مِّن نَّخِيلٖ وَعِنَبٖ فَتُفَجِّرَ ٱلۡأَنۡهَٰرَ خِلَٰلَهَا تَفۡجِيرًا ١٩"
    },
    {
      "number": 2121,
      "text": "أَوْ تُسْقِطَ السَّمَاءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا أَوْ تَأْتِيَ بِاللَّهِ وَالْمَلَائِكَةِ قَبِيلًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 92,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 249,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ قَبِيلًا ٢٩\n                                    \n                                    \n                                    وقوله تعالى ( أو تسقط السماء كما زعمت ) أي : أنك وعدتنا أن يوم القيامة تنشق فيه السماء وتهي ، وتدلى أطرافها ، فعجل ذلك في الدنيا ، وأسقطها كسفا [ أي : قطعا ، كقولهم : ( اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم ) الآية [ الأنفال : 32 ] ، وكذلك سأل قوم شعيب منه فقالوا : ( أسقط علينا كسفا ] من السماء إن كنت من الصادقين ) [ الشعراء : 187 ] . فعاقبهم الرب بعذاب يوم الظلة ، إنه كان عذاب يوم عظيم . وأما نبي الرحمة ، ونبي التوبة المبعوث رحمة للعالمين ، فسأل إنظارهم وتأجيلهم ، لعل الله أن يخرج من أصلابهم من يعبده لا يشرك به شيئا . وكذلك وقع ، فإن من هؤلاء الذين ذكروا من أسلم بعد ذلك وحسن إسلامه حتى \" عبد الله بن أبي أمية \" الذي تبع النبي صلى الله عليه وسلم وقال له ما قال ، أسلم إسلاما تاما ، وأناب إلى الله عز وجل .\n                                    ",
        "qortoby": "أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ قَبِيلًا ٢٩\n                                    \n                                    \n                                    أو تسقط السماء قراءة العامة . وقرأ مجاهد \" أو يسقط السماء \" على إسناد الفعل إلى السماء . كسفا قطعا ، عن ابن عباس وغيره . والكسف ( بفتح السين ) جمع كسفة ، وهي قراءة نافع وابن عامر وعاصم . الباقون كسفا بإسكان السين . قال الأخفش : من قرأ كسفا من السماء جعله واحدا ، ومن قرأ كسفا جعله جمعا . قال المهدوي : ومن أسكن السين جاز أن يكون جمع كسفة وجاز أن يكون مصدرا ، من كسفت الشيء إذا غطيته . فكأنهم قالوا : أسقطها طبقا علينا . وقال الجوهري . الكسفة القطعة من الشيء ; يقال : أعطني كسفة من ثوبك ، والجمع كسف وكسف . ويقال : الكسفة واحد .\nأو تأتي بالله والملائكة قبيلا أي معاينة ; عن قتادة وابن جريج . وقال الضحاك وابن عباس : كفيلا . قال مقاتل : شهيدا . مجاهد : هو جمع القبيلة ; أي بأصناف الملائكة قبيلة قبيلة . وقيل : ضمناء يضمنون لنا إتيانك به .\n                                    ",
        "saadi": "أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ قَبِيلًا ٢٩\n                                        \n                                        \n                                        \n                                        { أَوْ تُسْقِطَ السَّمَاءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا } أي: قطعًا من العذاب، { أَوْ تَأْتِيَ بِاللَّهِ وَالْمَلَائِكَةِ قَبِيلًا } أي: جميعًا، أو مقابلة ومعاينة، يشهدون لك بما جئت به.\n                                    "
      },
      "originalText": "أَوۡ تُسۡقِطَ ٱلسَّمَآءَ كَمَا زَعَمۡتَ عَلَيۡنَا كِسَفًا أَوۡ تَأۡتِيَ بِٱللَّهِ وَٱلۡمَلَٰٓئِكَةِ قَبِيلًا ٢٩"
    },
    {
      "number": 2122,
      "text": "أَوْ يَكُونَ لَكَ بَيْتٌ مِنْ زُخْرُفٍ أَوْ تَرْقَىٰ فِي السَّمَاءِ وَلَنْ نُؤْمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيْنَا كِتَابًا نَقْرَؤُهُ ۗ قُلْ سُبْحَانَ رَبِّي هَلْ كُنْتُ إِلَّا بَشَرًا رَسُولًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 93,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 249,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا ٣٩\n                                    \n                                    \n                                    ( أو يكون لك بيت من زخرف ) قال ابن عباس ، ومجاهد ، وقتادة : هو الذهب . وكذلك هو في قراءة ابن مسعود : \" أو يكون لك بيت من ذهب \" ، ( أو ترقى في السماء ) أي : تصعد في سلم ونحن ننظر إليك ( ولن نؤمن لرقيك حتى تنزل علينا كتابا نقرؤه ) قال مجاهد : أي مكتوب فيه إلى كل واحد واحد صحيفة : هذا كتاب من الله لفلان بن فلان ، تصبح موضوعة عند رأسه .\nوقوله : ( قل سبحان ربي هل كنت إلا بشرا رسولا ) أي : سبحانه وتعالى وتقدس أن يتقدم أحد بين يديه في أمر من أمور سلطانه وملكوته ، بل هو الفعال لما يشاء ، إن شاء أجابكم إلى ما سألتم ، وإن شاء لم يجبكم ، وما أنا إلا رسول إليكم أبلغكم رسالات ربي وأنصح لكم ، وقد فعلت ذلك ، وأمركم فيما سألتم إلى الله عز وجل .\nقال الإمام أحمد بن حنبل : حدثنا علي بن إسحاق ، حدثنا ابن المبارك ، حدثنا يحيى بن أيوب ، عن عبيد الله بن زحر ، عن علي بن يزيد ، عن القاسم عن أبي أمامة ، عن النبي صلى الله عليه وسلم قال : \" عرض ربي عز وجل ليجعل لي بطحاء مكة ذهبا ، فقلت : لا يا رب ، ولكن أشبع يوما ، وأجوع يوما - أو نحو ذلك - فإذا جعت تضرعت إليك وذكرتك ، وإذا شبعت حمدتك وشكرتك \" .\nورواه الترمذي في \" الزهد \" عن سويد بن نصر عن ابن المبارك ، به وقال : هذا حديث حسن . وعلي بن يزيد يضعف في الحديث .\n                                    ",
        "qortoby": "أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا ٣٩\n                                    \n                                    \n                                    أو يكون لك بيت من زخرف أي من ذهب ; عن ابن عباس وغيره . وأصله الزينة . والمزخرف المزين . وزخارف الماء طرائقه . وقال مجاهد : كنت لا أدري ما الزخرف حتى رأيته في قراءة ابن مسعود \" بيت من ذهب \" أي نحن لا ننقاد لك مع هذا الفقر الذي نرى .\nأو ترقى في السماء أي تصعد ; يقال : رقيت في السلم أرقى رقيا ورقيا إذا صعدت . وارتقيت مثله .\nولن نؤمن لرقيك أي من أجل رقيك ، وهو مصدر ; نحو مضى يمضي مضيا ، وهوى يهوي هويا ، كذلك رقي يرقى رقيا .\nحتى تنزل علينا كتابا نقرؤه أي كتابا من الله - تعالى - إلى كل رجل منا ; كما قال - تعالى - : بل يريد كل امرئ منهم أن يؤتى صحفا منشرة .\nقل سبحان ربي وقرأ أهل مكة والشام \" قال سبحان ربي \" يعني النبي - صلى الله عليه وسلم - ; أي قال ذلك تنزيها لله - عز وجل - عن أن يعجز عن شيء وعن أن يعترض عليه في فعل . وقيل : هذا كله تعجب عن فرط كفرهم واقتراحاتهم . الباقون قل على الأمر ; أي قل لهم يا محمد\nهل كنت إلا بشرا رسولا أي ما أنا إلا بشرا رسولا أتبع ما يوحى إلي من ربي ، ويفعل الله ما يشاء من هذه الأشياء التي ليست في قدرة البشر ، فهل سمعتم أحدا من البشر أتى بهذه الآيات وقال بعض الملحدين : ليس هذا جوابا مقنعا ، وغلطوا ; لأنه أجابهم فقال : إنما أنا بشر لا أقدر على شيء مما سألتموني ، وليس لي أن أتخير على ربي ، ولم تكن الرسل قبلي يأتون أممهم بكل ما يريدونه ويبغونه ، وسبيلي سبيلهم ، وكانوا يقتصرون على ما أتاهم الله من آياته الدالة على صحة نبوتهم ، فإذا أقاموا عليهم الحجة لم يجب لقومهم أن يقترحوا غيرها ، ولو وجب على الله أن يأتيهم بكل ما يقترحونه من الآيات لوجب عليه أن يأتيهم بمن يختارونه من الرسل ، ولوجب لكل إنسان أن يقول : لا أومن حتى أوتى بآية خلاف ما طلب غيري . وهذا يؤول إلى أن يكون التدبير إلى الناس . وإنما التدبير إلى الله - تعالى - .\n                                    ",
        "saadi": "أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا ٣٩\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 93 و 94 :ـ\n{ أَوْ يَكُونَ لَكَ بَيْتٌ مِنْ زُخْرُفٍ } أي: مزخرف بالذهب وغيره { أَوْ تَرْقَى فِي السَّمَاءِ } رقيًا حسيًا، { و } ومع هذا فـ { وَلَنْ نُؤْمِنَ لِرُقِيِّكَ حَتَّى تُنَزِّلَ عَلَيْنَا كِتَابًا نَقْرَؤُهُ }\nولما كانت هذه تعنتات وتعجيزات؛ وكلام أسفه الناس وأظلمهم، المتضمنة لرد الحق وسوء الأدب مع الله، وأن الرسول صلى الله عليه وسلم هو الذي يأتي بالآيات، أمره الله أن ينزهه فقال: { قُلْ سُبْحَانَ رَبِّي } عما تقولون علوًا كبيرًا، وسبحانه أن تكون أحكامه وآياته تابعة لأهوائهم الفاسدة، وآرائهم الضالة. { هَلْ كُنْتُ إِلَّا بَشَرًا رَسُولًا } ليس بيده شيء من الأمر.\nوهذا السبب الذي منع أكثر الناس من الإيمان، حيث كانت الرسل التي ترسل إليهم من جنسهم بشرًا.\nوهذا من رحمته بهم، أن أرسل إليهم بشرًا منهم، فإنهم لا يطيقون التلقي من الملائكة.\n                                    "
      },
      "originalText": "أَوۡ يَكُونَ لَكَ بَيۡتٞ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِي ٱلسَّمَآءِ وَلَن نُّؤۡمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيۡنَا كِتَٰبٗا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّي هَلۡ كُنتُ إِلَّا بَشَرٗا رَّسُولٗا ٣٩"
    },
    {
      "number": 2123,
      "text": "وَمَا مَنَعَ النَّاسَ أَنْ يُؤْمِنُوا إِذْ جَاءَهُمُ الْهُدَىٰ إِلَّا أَنْ قَالُوا أَبَعَثَ اللَّهُ بَشَرًا رَسُولًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 94,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 250,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا ٤٩\n                                    \n                                    \n                                    يقول تعالى : ( وما منع الناس ) أي : أكثرهم ) أن يؤمنوا ) ويتابعوا الرسل ، إلا استعجابهم من بعثته البشر رسلا كما قال تعالى : ( أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس وبشر الذين آمنوا ) [ يونس : 2 ] .\nوقال تعالى : ( ذلك بأنه كانت تأتيهم رسلهم بالبينات فقالوا أبشر يهدوننا فكفروا وتولوا واستغنى الله والله غني حميد ) [ التغابن : 6 ] ، وقال فرعون وملؤه : ( أنؤمن لبشرين مثلنا وقومهما لنا عابدون ) [ المؤمنون : 47 ] ، وكذلك قالت الأمم لرسلهم : ( إن أنتم إلا بشر مثلنا تريدون أن تصدونا عما كان يعبد آباؤنا فأتونا بسلطان مبين ) [ إبراهيم : 10 ] ، والآيات في هذا كثيرة .\nثم قال تعالى منبها على لطفه ورحمته بعباده : إنه يبعث إليهم الرسول من جنسهم ؛ ليفقهوا عنه ويفهموا منه ، لتمكنهم من مخاطبته ومكالمته ، ولو بعث إلى البشر رسولا من الملائكة لما استطاعوا مواجهته ولا الأخذ عنه ، كما قال تعالى : ( لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم ) [ آل عمران : 164 ] ، وقال تعالى : ( لقد جاءكم رسول من أنفسكم ) [ التوبة : 128 ] ، وقال تعالى : ( كما أرسلنا فيكم رسولا منكم يتلو عليكم آياتنا ويزكيكم ويعلمكم الكتاب والحكمة ويعلمكم ما لم تكونوا تعلمون فاذكروني أذكركم واشكروا لي ولا تكفرون ) [ البقرة : 151 ، 152 ]\n                                    ",
        "qortoby": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا ٤٩\n                                    \n                                    \n                                    قوله تعالى : وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث الله بشرا رسولا قوله تعالى : وما منع الناس أن يؤمنوا إذ جاءهم الهدى يعني الرسل والكتب من عند الله بالدعاء إليه . \" فأن \" الأولى في محل نصب بإسقاط حرف الخفض . و \" أن \" الثانية في محل رفع \" بمنع \" أي وما منع الناس من أن يؤمنوا إذ جاءهم الهدى إلا قولهم أبعث الله بشرا رسولا .\n                                    ",
        "saadi": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا ٤٩\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 93 و 94 :ـ\n{ أَوْ يَكُونَ لَكَ بَيْتٌ مِنْ زُخْرُفٍ } أي: مزخرف بالذهب وغيره { أَوْ تَرْقَى فِي السَّمَاءِ } رقيًا حسيًا، { و } ومع هذا فـ { وَلَنْ نُؤْمِنَ لِرُقِيِّكَ حَتَّى تُنَزِّلَ عَلَيْنَا كِتَابًا نَقْرَؤُهُ }\nولما كانت هذه تعنتات وتعجيزات؛ وكلام أسفه الناس وأظلمهم، المتضمنة لرد الحق وسوء الأدب مع الله، وأن الرسول صلى الله عليه وسلم هو الذي يأتي بالآيات، أمره الله أن ينزهه فقال: { قُلْ سُبْحَانَ رَبِّي } عما تقولون علوًا كبيرًا، وسبحانه أن تكون أحكامه وآياته تابعة لأهوائهم الفاسدة، وآرائهم الضالة. { هَلْ كُنْتُ إِلَّا بَشَرًا رَسُولًا } ليس بيده شيء من الأمر.\nوهذا السبب الذي منع أكثر الناس من الإيمان، حيث كانت الرسل التي ترسل إليهم من جنسهم بشرًا.\nوهذا من رحمته بهم، أن أرسل إليهم بشرًا منهم، فإنهم لا يطيقون التلقي من الملائكة.\n                                    "
      },
      "originalText": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰٓ إِلَّآ أَن قَالُوٓاْ أَبَعَثَ ٱللَّهُ بَشَرٗا رَّسُولٗا ٤٩"
    },
    {
      "number": 2124,
      "text": "قُلْ لَوْ كَانَ فِي الْأَرْضِ مَلَائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنَا عَلَيْهِمْ مِنَ السَّمَاءِ مَلَكًا رَسُولًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 95,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 250,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا ٥٩\n                                    \n                                    \n                                    ولهذا قال هاهنا : ( لو كان في الأرض ملائكة يمشون مطمئنين ) أي : كما أنتم فيها ( لنزلنا عليهم من السماء ملكا رسولا ) أي : من جنسهم ، ولما كنتم أنتم بشرا ، بعثنا فيكم رسلنا منكم لطفا ورحمة .\n                                    ",
        "qortoby": "قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا ٥٩\n                                    \n                                    \n                                    قوله تعالى : قل لو كان في الأرض ملائكة يمشون مطمئنين لنزلنا عليهم من السماء ملكا رسولا أعلم الله - تعالى - أن الملك إنما يرسل إلى الملائكة ; لأنه لو أرسل ملكا إلى الآدميين لم يقدروا أن يروه على الهيئة التي خلق عليها ، وإنما أقدر الأنبياء على ذلك وخلق فيهم ما يقدرون به ، ليكون ذلك آية لهم ومعجزة . وقد تقدم في [ الأنعام ] نظير هذه الآية ; وهو قوله : وقالوا لولا أنزل عليه ملك ولو أنزلنا ملكا لقضي الأمر ثم لا ينظرون . ولو جعلناه ملكا لجعلناه رجلا وقد تقدم الكلام فيه .\n                                    ",
        "saadi": "قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا ٥٩\n                                        \n                                        \n                                        \n                                        فلو { كَانَ فِي الْأَرْضِ مَلَائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ } يثبتون على رؤية الملائكة والتلقي عنهم؛ { لَنَزَّلْنَا عَلَيْهِمْ مِنَ السَّمَاءِ مَلَكًا رَسُولًا } ليمكنهم التلقي عنه.\n                                    "
      },
      "originalText": "قُل لَّوۡ كَانَ فِي ٱلۡأَرۡضِ مَلَٰٓئِكَةٞ يَمۡشُونَ مُطۡمَئِنِّينَ لَنَزَّلۡنَا عَلَيۡهِم مِّنَ ٱلسَّمَآءِ مَلَكٗا رَّسُولٗا ٥٩"
    },
    {
      "number": 2125,
      "text": "قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ ۚ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا",
      "surah": {
        "number": 17,
        "name": "سورة الإسراء",
        "englishName": "Al-Israa",
        "englishNameTranslation": "The Night Journey",
        "revelationType": "Meccan",
        "numberOfAyahs": 111
      },
      "numberInSurah": 96,
      "juz": 15,
      "manzil": 4,
      "page": 291,
      "ruku": 250,
      "hizbQuarter": 116,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا ٦٩\n                                    \n                                    \n                                    يقول تعالى مرشدا نبيه إلى الحجة على قومه ، في صدق ما جاءهم به : أنه شاهد علي وعليكم ، عالم بما جئتكم به ، فلو كنت كاذبا [ عليه ] انتقم مني أشد الانتقام ، كما قال تعالى : ( ولو تقول علينا بعض الأقاويل لأخذنا منه باليمين ثم لقطعنا منه الوتين ) [ الحاقة : 44 - 46 ] .\nوقوله : ( إنه كان بعباده خبيرا بصيرا ) أي : عليم بهم بمن يستحق الإنعام والإحسان والهداية ، ممن يستحق الشقاء والإضلال والإزاغة ؛ ولهذا قال :\n                                    ",
        "qortoby": "قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا ٦٩\n                                    \n                                    \n                                    يروى أن كفار قريش قالوا حين سمعوا قوله \" هل كنت إلا بشرا رسولا \" : فمن يشهد لك أنك رسول الله .\nفنزل \" قل كفى بالله شهيدا بيني وبينكم إنه كان بعباده خبيرا بصيرا \" .\n                                    ",
        "saadi": "قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا ٦٩\n                                        \n                                        \n                                        \n                                        { قُلْ كَفَى بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا } فمن شهادته لرسوله ما أيده به من المعجزات، وما أنزل عليه من الآيات، ونصره على من عاداه وناوأه.\nفلو تقول عليه بعض الأقاويل، لأخذ منه باليمين، ثم لقطع منه الوتين، فإنه خبير بصير، لا تخفى عليه من أحوال العباد خافية.\n                                    "
      },
      "originalText": "قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرَۢا بَصِيرٗا ٦٩"
    }
  ]
}