{
  "number": 295,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 2156,
      "text": "وَإِذِ اعْتَزَلْتُمُوهُمْ وَمَا يَعْبُدُونَ إِلَّا اللَّهَ فَأْوُوا إِلَى الْكَهْفِ يَنْشُرْ لَكُمْ رَبُّكُمْ مِنْ رَحْمَتِهِ وَيُهَيِّئْ لَكُمْ مِنْ أَمْرِكُمْ مِرْفَقًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 16,
      "juz": 15,
      "manzil": 4,
      "page": 295,
      "ruku": 253,
      "hizbQuarter": 117,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا ٦١\n                                    \n                                    \n                                    فلما وقع عزمهم على الذهاب والهرب من قومهم ، واختار الله تعالى لهم ذلك ، وأخبر عنهم بذلك في قوله : ( وإذ اعتزلتموهم وما يعبدون إلا الله ) أي : وإذا فارقتموهم وخالفتموهم بأديانكم في عبادتهم غير الله ، ففارقوهم أيضا بأبدانكم ( فأووا إلى الكهف ينشر لكم ربكم من رحمته ) أي : يبسط عليكم رحمة يستركم بها من قومكم ( ويهيئ لكم من أمركم ) [ أي ] الذي أنتم فيه ، ( مرفقا ) أي : أمرا ترتفقون به . فعند ذلك خرجوا هرابا إلى الكهف ، فأووا إليه ، ففقدهم قومهم من بين أظهرهم ، وتطلبهم الملك فيقال : إنه لم يظفر بهم ، وعمى الله عليه خبرهم . كما فعل بنبيه [ محمد ] صلى الله عليه وسلم وصاحبه الصديق ، حين لجأ إلى غار ثور ، وجاء المشركون من قريش في الطلب ، فلم يهتدوا إليه مع أنهم يمرون عليه ، وعندها قال النبي صلى الله عليه وسلم حين رأى جزع الصديق في قوله : يا رسول الله ، لو أن أحدهم نظر إلى موضع قدميه لأبصرنا ، فقال : \" يا أبا بكر ، ما ظنك باثنين الله ثالثهما ؟ \" ، وقد قال تعالى : ( إلا تنصروه فقد نصره الله إذ أخرجه الذين كفروا ثاني اثنين إذ هما في الغار إذ يقول لصاحبه لا تحزن إن الله معنا فأنزل الله سكينته عليه وأيده بجنود لم تروها وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا والله عزيز حكيم ) [ التوبة : 40 ] فقصة هذا الغار أشرف وأجل وأعظم وأعجب من قصة أصحاب الكهف ، وقد قيل : إن قومهم ظفروا بهم ، وقفوا على باب الغار الذي دخلوه ، فقالوا : ما كنا نريد منهم من العقوبة أكثر مما فعلوا بأنفسهم . فأمر الملك بردم بابه عليهم ليهلكوا مكانهم ففعل [ لهم ] ذلك . وفي هذا نظر ، والله أعلم ؛ فإن الله تعالى قد أخبر أن الشمس تدخل عليهم في الكهف بكرة وعشية ، كما قال تعالى :s\n                                    ",
        "qortoby": "وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا ٦١\n                                    \n                                    \n                                    قوله تعالى : وإذ اعتزلتموهم وما يعبدون إلا الله فأووا إلى الكهف ينشر لكم ربكم من رحمته ويهيئ لكم من أمركم مرفقا\nقوله تعالى : وإذ اعتزلتموهم وإذ اعتزلتموهم قيل : هو من قول الله لهم . أي وإذ اعتزلتموهم فأووا إلى الكهف . وقيل : هو من قول رئيسهم يملخا ; فيما ذكر ابن عطية . وقال الغزنوي : رئيسهم مكسلمينا ، قال لهم ذلك ; أي إذ اعتزلتموهم واعتزلتم ما يعبدون . ثم استثنى وقال إلا الله أي إنكم لم تتركوا عبادته ; فهو استثناء منقطع . قال ابن عطية : وهذا على تقدير إن الذين فر أهل الكهف منهم لا يعرفون الله ، ولا علم لهم به ; وإنما يعتقدون الأصنام في ألوهيتهم فقط . وإن فرضنا أنهم يعرفون الله كما كانت العرب تفعل لكنهم يشركون أصنامهم معه في العبادة فالاستثناء متصل ; لأن الاعتزال وقع في كل ما يعبد الكفار إلا في جهة الله . وفي مصحف عبد الله بن مسعود \" وما يعبدون من دون الله \" . قال قتادة هذا تفسيرها .\nقلت : ويدل على هذا ما ذكره أبو نعيم الحافظ عن عطاء الخراساني في قوله - تعالى - وإذ اعتزلتموهم وما يعبدون إلا الله قال : كان فتية من قوم يعبدون الله ويعبدون معه آلهة فاعتزلت الفتية عبادة تلك الآلهة ولم تعتزل عبادة الله . ابن عطية : فعلى ما قال قتادة تكون إلا بمنزلة \" غير \" ، وما من قوله وما يعبدون إلا الله في موضع نصب ، عطفا على الضمير في قوله اعتزلتموهم . ومضمن هذه الآية أن بعضهم قال لبعض : إذا فارقنا الكفار وانفردنا بالله - تعالى - فلنجعل الكهف مأوى ونتكل على الله ; فإنه سيبسط لنا رحمته ، وينشرها علينا ، ويهيئ لنا من أمرنا مرفقا . وهذا كله دعاء بحسب الدنيا ، وعلى ثقة كانوا من الله في أمر آخرتهم . وقال أبو جعفر محمد بن علي بن الحسين - رضي الله عنه - : كان أصحاب الكهف صياقلة ، واسم الكهف حيوم .\nمرفقا قرئ بكسر الميم وفتحها ، وهو ما يرتفق به وكذلك مرفق الإنسان ومرفقه ; ومنهم من يجعل \" المرفق \" بفتح الميم الموضع كالمسجد وهما لغتان .\n                                    ",
        "saadi": "وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا ٦١\n                                        \n                                        \n                                        \n                                        أي: قال بعضهم لبعض، إذ حصل لكم اعتزال قومكم في أجسامكم وأديانكم، فلم يبق إلا النجاء من شرهم، والتسبب بالأسباب المفضية لذلك، لأنهم لا سبيل لهم إلى قتالهم، ولا بقائهم بين أظهرهم، وهم على غير دينهم، { فَأْوُوا إِلَى الْكَهْفِ } أي: انضموا إليه واختفوا فيه { يَنْشُرْ لَكُمْ رَبُّكُمْ مِنْ رَحْمَتِهِ وَيُهَيِّئْ لَكُمْ مِنْ أَمْرِكُمْ مِرفَقًا } وفيما تقدم، أخبر أنهم دعوه بقولهم { ربنا آتنا من لدنك رحمة وهيء لنا من أمرنا رشدا } فجمعوا بين التبري من حولهم وقوتهم، والالتجاء إلى الله في صلاح أمرهم، ودعائه بذلك، وبين الثقة بالله أنه سيفعل ذلك، لا جرم أن الله نشر لهم من رحمته، وهيأ لهم من أمرهم مرفقا، فحفظ أديانهم وأبدانهم، وجعلهم من آياته على خلقه، ونشر لهم من الثناء الحسن، ما هو من رحمته بهم، ويسر لهم كل سبب، حتى المحل الذي ناموا فيه، كان على غاية ما يمكن من الصيانة\n                                    "
      },
      "originalText": "وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا ٦١"
    },
    {
      "number": 2157,
      "text": "۞ وَتَرَى الشَّمْسَ إِذَا طَلَعَتْ تَزَاوَرُ عَنْ كَهْفِهِمْ ذَاتَ الْيَمِينِ وَإِذَا غَرَبَتْ تَقْرِضُهُمْ ذَاتَ الشِّمَالِ وَهُمْ فِي فَجْوَةٍ مِنْهُ ۚ ذَٰلِكَ مِنْ آيَاتِ اللَّهِ ۗ مَنْ يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِ ۖ وَمَنْ يُضْلِلْ فَلَنْ تَجِدَ لَهُ وَلِيًّا مُرْشِدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 17,
      "juz": 15,
      "manzil": 4,
      "page": 295,
      "ruku": 253,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡيَمِينِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِي فَجۡوَةٖ مِّنۡهُۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِۗ مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِيّٗا مُّرۡشِدٗا ٧١\n                                    \n                                    \n                                    هذا دليل على أن باب هذا الكهف من نحو الشمال ؛ لأنه تعالى أخبر أن الشمس إذا دخلته عند طلوعها تزاور عنه ) ذات اليمين ) أي : يتقلص الفيء يمنة كما قال ابن عباس ، وسعيد بن جبير ، وقتادة : ( تزاور ) أي : تميل ؛ وذلك أنها كلما ارتفعت في الأفق تقلص شعاعها بارتفاعها حتى لا يبقى منه شيء عند الزوال في مثل ذلك المكان ؛ ولهذا قال : ( وإذا غربت تقرضهم ذات الشمال ) أي : تدخل إلى غارهم من شمال بابه ، وهو من ناحية المشرق ، فدل على صحة ما قلناه ، وهذا بين لمن تأمله وكان له علم بمعرفة الهيئة ، وسير الشمس والقمر والكواكب ، وبيانه أنه لو كان باب الغار من ناحية الشرق لما دخل إليه منها شيء عند الغروب ، ولو كان من ناحية القبلة لما دخل منها شيء عند الطلوع ولا عند الغروب ، ولا تزاور الفيء يمينا ولا شمالا ولو كان من جهة الغرب لما دخلته وقت الطلوع ، بل بعد الزوال ولم تزل فيه إلى الغروب . فتعين ما ذكرناه ولله الحمد .\nوقال ابن عباس ومجاهد وقتادة : ( تقرضهم ) تتركهم .\nوقد أخبر الله تعالى بذلك وأراد منا فهمه وتدبره ، ولم يخبرنا بمكان هذا الكهف في أي البلاد من الأرض ؛ إذ لا فائدة لنا فيه ولا قصد شرعي . وقد تكلف بعض المفسرين فذكروا فيه أقوالا فتقدم عن ابن عباس أنه قال : [ هو ] قريب من أيلة . وقال ابن إسحاق : هو عند نينوى . وقيل : ببلاد الروم . وقيل : ببلاد البلقاء . والله أعلم بأي بلاد الله هو . ولو كان لنا فيه مصلحة دينية لأرشدنا الله ورسوله إليه فقد قال رسول الله صلى الله عليه وسلم : \" ما تركت شيئا يقربكم إلى [ الجنة ] ويباعدكم من النار ، إلا وقد أعلمتكم به \" . فأعلمنا تعالى بصفته ، ولم يعلمنا بمكانه ، فقال ( وترى الشمس إذا طلعت تزاور عن كهفهم ) قال مالك ، عن زيد بن أسلم : تميل ( ذات اليمين وإذا غربت تقرضهم ذات الشمال وهم في فجوة منه ) أي : في متسع منه داخلا بحيث لا تمسهم ؛ إذ لو أصابتهم لأحرقت أبدانهم وثيابهم ؛ قاله ابن عباس .\n( ذلك من آيات الله ) حيث أرشدهم تعالى إلى هذا الغار الذي جعلهم فيه أحياء ، والشمس والريح تدخل عليهم فيه لتبقى أبدانهم ؛ ولهذا قال : ( ذلك من آيات الله )\nثم قال : ( من يهد الله فهو المهتدي ومن يضلل فلن تجد له وليا مرشدا ) أي : هو الذي أرشد هؤلاء الفتية إلى الهداية من بين قومهم ، فإنه من هداه الله اهتدى ، ومن أضله فلا هادي له .\n                                    ",
        "qortoby": "۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡيَمِينِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِي فَجۡوَةٖ مِّنۡهُۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِۗ مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِيّٗا مُّرۡشِدٗا ٧١\n                                    \n                                    \n                                    قوله تعالى : وترى الشمس إذا طلعت تزاور عن كهفهم ذات اليمين أي ترى أيها المخاطب الشمس عند طلوعها تميل عن كهفهم . والمعنى : إنك لو رأيتهم لرأيتهم كذا ; لا أن المخاطب رآهم على التحقيق . وتزاور تتنحى وتميل ; من الازورار . والزور الميل . والأزور في العين المائل النظر إلى ناحية ، ويستعمل في غير العين ; كما قال ابن أبي ربيعة :\nوجنبي خيفة القوم أزور\nومن اللفظة قول عنترة :\nفازور من وقع القنا بلبانه\nوفي حديث غزوة مؤتة أن رسول الله - صلى الله عليه وسلم - رأى في سرير عبد الله بن رواحة ازورارا عن سرير جعفر وزيد بن حارثة . وقرأ أهل الحرمين وأبو عمرو \" تزاور \" بإدغام التاء في الزاي ، والأصل \" تتزاور \" . وقرأ عاصم وحمزة والكسائي تزاور مخففة الزاي . وقرأ ابن عامر \" تزور \" مثل تحمر . وحكى الفراء \" تزوار \" مثل تحمار ; كلها بمعنى واحد .\nوإذا غربت تقرضهم قرأ الجمهور بالتاء على معنى تتركهم ; قاله مجاهد . وقال قتادة : تدعهم . النحاس : وهذا معروف في اللغة ، حكى البصريون أنه يقال : قرضه يقرضه إذا تركه ; والمعنى : أنهم كانوا لا تصيبهم شمس ألبتة كرامة لهم ; وهو قول ابن عباس . يعني أن الشمس إذا طلعت مالت عن كهفهم ذات اليمين ، أي يمين الكهف ، وإذا غربت تمر بهم ذات الشمال ، أي شمال الكهف ، فلا تصيبهم في ابتداء النهار ولا في آخر النهار . وكان كهفهم مستقبل بنات نعش في أرض الروم ، فكانت الشمس تميل عنهم طالعة وغاربة وجارية لا تبلغهم لتؤذيهم بحرها ، وتغير ألوانهم وتبلي ثيابهم . وقد قيل : إنه كان لكهفهم حاجب من جهة الجنوب ، وحاجب من جهة الدبور وهم في زاويته . وذهب الزجاج إلى أن فعل الشمس كان آية من الله ، دون أن يكون باب الكهف إلى جهة توجب ذلك . وقرأت فرقة \" يقرضهم \" بالياء من القرض وهو القطع ، أي يقطعهم الكهف بظله من ضوء الشمس . وقيل : وإذا غربت تقرضهم أي يصيبهم يسير منها ، مأخوذ من قراضة الذهب والفضة ، أي تعطيهم الشمس اليسير من شعاعها . وقالوا : كان في مسها لهم بالعشي إصلاح لأجسادهم . وعلى الجملة فالآية في ذلك أن الله - تعالى - آواهم إلى كهف هذه صفته لا إلى كهف آخر يتأذون فيه بانبساط الشمس عليهم في معظم النهار . وعلى هذا فيمكن أن يكون صرف الشمس عنهم بإظلال غمام أو سبب آخر . والمقصود بيان حفظهم عن تطرق البلاء وتغير الأبدان والألوان إليهم ، والتأذي بحر أو برد .\nوهم في فجوة منه أي من الكهف ، والفجوة المتسع ، وجمعها فجوات وفجاء ; مثل ركوة وركاء وركوات وقال الشاعر :\nونحن ملأنا كل واد وفجوة رجالا وخيلا غير ميل ولا عزل\nأي كانوا بحيث يصيبهم نسيم الهواء .\nذلك من آيات الله لطف بهم . وهذا يقوي قول الزجاج .\n                                    ",
        "saadi": "۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡيَمِينِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِي فَجۡوَةٖ مِّنۡهُۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِۗ مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِيّٗا مُّرۡشِدٗا ٧١\n                                        \n                                        \n                                        \n                                        أي: حفظهم الله من الشمس فيسر لهم غارا إذا طلعت الشمس تميل عنه يمينا، وعند غروبها تميل عنه شمالا، فلا ينالهم حرها فتفسد أبدانهم بها، { وَهُمْ فِي فَجْوَةٍ مِنْهُ } أي: من الكهف أي: مكان متسع، وذلك ليطرقهم الهواء والنسيم، ويزول عنهم الوخم والتأذي بالمكان الضيق، خصوصا مع طول المكث، وذلك من آيات الله الدالة على قدرته ورحمته بهم، وإجابة دعائهم وهدايتهم حتى في هذه الأمور، ولهذا قال: { مَنْ يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِ } أي: لا سبيل إلى نيل الهداية إلا من الله، فهو الهادي المرشد لمصالح الدارين، { وَمَنْ يُضْلِلْ فَلَنْ تَجِدَ لَهُ وَلِيًّا مُرْشِدًا } أي: لا تجد من يتولاه ويدبره، على ما فيه صلاحه، ولا يرشده إلى الخير والفلاح، لأن الله قد حكم عليه بالضلال، ولا راد لحكمه.\n                                    "
      },
      "originalText": "۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡيَمِينِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِي فَجۡوَةٖ مِّنۡهُۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِۗ مَن يَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن يُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِيّٗا مُّرۡشِدٗا ٧١"
    },
    {
      "number": 2158,
      "text": "وَتَحْسَبُهُمْ أَيْقَاظًا وَهُمْ رُقُودٌ ۚ وَنُقَلِّبُهُمْ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ ۖ وَكَلْبُهُمْ بَاسِطٌ ذِرَاعَيْهِ بِالْوَصِيدِ ۚ لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِرَارًا وَلَمُلِئْتَ مِنْهُمْ رُعْبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 18,
      "juz": 15,
      "manzil": 4,
      "page": 295,
      "ruku": 254,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ لَوِ ٱطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارٗا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبٗا ٨١\n                                    \n                                    \n                                    ذكر بعض أهل العلم أنهم لما ضرب الله على آذانهم بالنوم ، لم تنطبق أعينهم ؛ لئلا يسرع إليها البلى ، فإذا بقيت‌ ظاهرة للهواء كان أبقى لها ؛ ولهذا قال تعالى : ( وتحسبهم أيقاظا وهم رقود ) وقد ذكر عن الذئب أنه ينام فيطبق عينا ويفتح عينا ، ثم يفتح هذه ويطبق هذه وهو راقد ، كما قال الشاعر ينام بإحدى مقلتيه ويتقي بأخرى الرزايا فهو يقظان نائم\nوقوله تعالى : ( ونقلبهم ذات اليمين وذات الشمال ) قال بعض السلف : يقلبون في العام مرتين . قال ابن عباس : لو لم يقلبوا لأكلتهم الأرض .\nوقوله : ( وكلبهم باسط ذراعيه بالوصيد ) قال ابن عباس ، وقتادة ومجاهد وسعيد بن جبير الوصيد : الفناء .\nوقال ابن عباس : بالباب . وقيل : بالصعيد ، وهو التراب . والصحيح أنه بالفناء ، وهو الباب ، ومنه قوله تعالى : ( إنها عليهم مؤصدة ) [ الهمزة : 8 ] أي : مطبقة مغلقة . ويقال : \" وصيد \" و \" أصيد \" .\nربض كلبهم على الباب كما جرت به عادة الكلاب .\nقال ابن جريج يحرس عليهم الباب . وهذا من سجيته وطبيعته ، حيث يربض ببابهم كأنه يحرسهم ، وكان جلوسه خارج الباب ؛ لأن الملائكة لا تدخل بيتا فيه كلب - كما ورد في الصحيح - ولا صورة ولا جنب ولا كافر ، كما ورد به الحديث الحسن وشملت كلبهم بركتهم ، فأصابه ما أصابهم من النوم على تلك الحال . وهذا فائدة صحبة الأخيار ؛ فإنه صار لهذا الكلب ذكر وخبر وشأن .\nوقد قيل : إنه كان كلب صيد لأحدهم ، وهو الأشبه . وقيل : كان كلب طباخ الملك ، وقد كان وافقهم على الدين فصحبه كلبه فالله أعلم .\nوقد روى الحافظ ابن عساكر في ترجمة \" همام بن الوليد الدمشقي \" : حدثنا صدقة بن عمر الغساني ، حدثنا عباد المنقري ، سمعت الحسن البصري ، رحمه الله ، يقول : كان اسم كبش إبراهيم : جرير واسم هدهد سليمان : عنقز ، واسم كلب أصحاب الكهف : قطمير ، واسم عجل بني إسرائيل الذي عبدوه : بهموت . وهبط آدم ، عليه السلام ، بالهند ، وحواء بجدة ، وإبليس بدست بيسان ، والحية بأصبهان\nوقد تقدم عن شعيب الجبائي أنه سماه : حمران .\nواختلفوا في لونه على أقوال لا حاصل لها ، ولا طائل تحتها ولا دليل عليها ، ولا حاجة إليها ، بل هي مما ينهى عنه ، فإن مستندها رجم بالغيب .\nوقوله تعالى : ( لو اطلعت عليهم لوليت منهم فرارا ولملئت منهم رعبا ) أي : أنه تعالى ألقى عليهم المهابة بحيث لا يقع نظر أحد عليهم إلا هابهم ؛ لما ألبسوا من المهابة والذعر ؛ لئلا يدنو منهم أحد ولا تمسهم يد لامس ، حتى يبلغ الكتاب أجله ، وتنقضي رقدتهم التي شاء تبارك وتعالى فيهم ، لما له في ذلك من الحجة والحكمة البالغة ، والرحمة الواسعة .\n                                    ",
        "qortoby": "وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ لَوِ ٱطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارٗا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبٗا ٨١\n                                    \n                                    \n                                    وقال أهل التفسير : كانت أعينهم مفتوحة وهم نائمون ; فكذلك كان الرائي يحسبهم أيقاظا . وقيل : تحسبهم أيقاظا لكثرة تقلبهم كالمستيقظ في مضجعه . وأيقاظا جمع يقظ ويقظان ، وهو المنتبه .\nوهم رقود كقولهم : وهم قوم ركوع وسجود وقعود فوصف الجمع بالمصدر .\nونقلبهم ذات اليمين وذات الشمال قال ابن عباس : لئلا تأكل الأرض لحومهم . قال أبو هريرة : كان لهم في كل عام تقليبتان . وقيل : في كل سنة مرة . وقال مجاهد : في كل سبع سنين مرة . وقالت فرقة : إنما قلبوا في التسع الأواخر ، وأما في الثلاثمائة فلا . وظاهر كلام المفسرين أن التقليب كان من فعل الله ، ويجوز أن يكون من ملك بأمر الله ، فيضاف إلى الله - تعالى - .\nقوله تعالى : وكلبهم باسط ذراعيه بالوصيد\nفيه أربع مسائل :\nالأولى : وكلبهم قال عمرو بن دينار : إن مما أخذ على العقرب ألا تضر أحدا [ قال ] في ليله أو في نهاره : صلى الله على نوح . وإن مما أخذ على الكلب ألا يضر من حمل عليه [ إذا قال ] : وكلبهم باسط ذراعيه بالوصيد .\nأكثر المفسرين على أنه كلب حقيقة ، وكان لصيد أحدهم أو لزرعه أو غنمه ; على ما قال مقاتل . واختلف في لونه اختلافا كثيرا ، ذكره الثعلبي . تحصيله : أي لون ذكرت أصبت ; حتى قيل لون الحجر وقيل لون السماء . واختلف أيضا في اسمه ; فعن علي : ريان . ابن عباس : قطمير . الأوزاعي : مشير . عبد الله بن سلام : بسيط . كعب : صهيا . وهب : نقيا . وقيل قطمير ; ذكره الثعلبي . وكان اقتناء الكلب جائزا في وقتهم ، كما هو عندنا اليوم جائز في شرعنا . وقال ابن عباس : هربوا ليلا ، وكانوا سبعة فمروا براع معه كلب فاتبعهم على دينهم . وقال كعب : مروا بكلب فنبح لهم فطردوه فعاد فطردوه مرارا ، فقام الكلب على رجليه ورفع يديه إلى السماء كهيئة الداعي ، فنطق فقال : لا تخافوا مني أنا أحب أحباء الله - تعالى - فناموا حتى أحرسكم .\nالثانية : ورد في الصحيح عن ابن عمر عن النبي - صلى الله عليه وسلم - قال : من اقتنى كلبا إلا كلب صيد أو ماشية نقص من أجره كل يوم قيراطان . وروى الصحيح أيضا عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : من اتخذ كلبا إلا كلب ماشية أو صيد أو زرع انتقص من أجره كل يوم قيراط . قال الزهري : وذكر لابن عمر قول أبي هريرة فقال : يرحم الله أبا هريرة كان صاحب زرع . فقد دلت السنة الثابتة على اقتناء الكلب للصيد والزرع والماشية . وجعل النقص في أجر من اقتناها على غير ذلك من المنفعة ; إما لترويع الكلب المسلمين وتشويشه عليهم بنباحه ، أو لمنع دخول الملائكة البيت ، أو لنجاسته ، على ما يراه الشافعي ، أو لاقتحام النهي عن اتخاذ ما لا منفعة فيه ; والله أعلم . وقال في إحدى الروايتين قيراطان وفي الأخرى قيراط . وذلك يحتمل أن يكون في نوعين من الكلاب أحدهما أشد أذى من الآخر ، كالأسود الذي أمر - عليه السلام - بقتله ، ولم يدخله في الاستثناء حين نهى عن قتلها كما هو منصوص في حديث جابر ; أخرجه الصحيح . وقال : عليكم بالأسود البهيم ذي النقطتين فإنه شيطان . ويحتمل أن يكون ذلك لاختلاف المواضع ، فيكون ممسكه بالمدينة مثلا أو بمكة ينقص قيراطان وبغيرها قيراط . وأما المباح اتخاذه فلا ينقص ; كالفرس والهرة . والله أعلم .\nالثالثة : وكلب الماشية المباح اتخاذه عند مالك هو الذي يسرح معها ، لا الذي يحفظها في الدار من السراق . وكلب الزرع هو الذي يحفظها من الوحوش بالليل أو بالنهار لا من السراق . وقد أجاز غير مالك اتخاذها لسراق الماشية والزرع . وقد تقدم في \" المائدة \" من أحكام الكلاب ما فيه كفاية ، والحمد لله .\nالرابعة : قال ابن عطية : وحدثني أبي - رضي الله عنه - قال سمعت أبا الفضل الجوهري في جامع مصر يقول على منبر وعظه سنة تسع وستين وأربعمائة : إن من أحب أهل الخير نال من بركتهم ; كلب أحب أهل فضل وصحبهم فذكره الله في محكم تنزيله .\nقلت : إذا كان بعض الكلاب قد نال هذه الدرجة العليا بصحبته ومخالطته الصلحاء والأولياء حتى أخبر الله - تعالى - بذلك في كتابه جل وعلا فما ظنك بالمؤمنين الموحدين المخالطين المحبين للأولياء والصالحين بل في هذا تسلية وأنس للمؤمنين المقصرين عن درجات الكمال ، المحبين للنبي - صلى الله عليه وسلم - وآله خير آل . روى الصحيح عن أنس بن مالك قال : بينا أنا ورسول الله - صلى الله عليه وسلم - خارجان من المسجد فلقينا رجل عند سدة المسجد فقال : يا رسول الله ، متى الساعة ؟ قال رسول الله - صلى الله عليه وسلم - : ما أعددت لها قال : فكأن الرجل استكان ، ثم قال : يا رسول الله - صلى الله عليه وسلم - : \" ما أعددت لها كثير صلاة ولا صيام ولا صدقة ، ولكني أحب الله ورسوله . قال : فأنت مع من أحببت . في رواية قال أنس بن مالك : فما فرحنا بعد الإسلام فرحا أشد من قول النبي - صلى الله عليه وسلم - : فأنت مع من أحببت . قال أنس : فأنا أحب الله ورسوله وأبا بكر وعمر ، فأرجو أن أكون معهم وإن لم أعمل بأعمالهم .\nقلت : وهذا الذي تمسك به أنس يشمل من المسلمين كل ذي نفس ، فكذلك تعلقت أطماعنا بذلك وإن كنا مقصرين ، ورجونا رحمة الرحمن وإن كنا غير مستأهلين ; كلب أحب قوما فذكره الله معهم فكيف بنا وعندنا عقد الإيمان وكلمة الإسلام ، وحب النبي - صلى الله عليه وسلم - ، ولقد كرمنا بني آدم وحملناهم في البر والبحر ورزقناهم من الطيبات وفضلناهم على كثير ممن خلقنا تفضيلا .\nوقالت فرقة : لم يكن كلبا حقيقة ، وإنما كان أحدهم ، وكان قد قعد عند باب الغار طليعة لهم كما سمي النجم التابع للجوزاء كلبا ; لأنه منها كالكلب من الإنسان ; ويقال له : كلب الجبار . قال ابن عطية : فسمي باسم الحيوان اللازم لذلك الموضع أما إن هذا القول يضعفه ذكر بسط الذراعين فإنها في العرف من صفة الكلب حقيقة ; ومنه قول النبي - صلى الله عليه وسلم - : ولا يبسط أحدكم ذراعيه انبساط الكلب . وقد حكى أبو عمر المطرز في كتاب اليواقيت أنه قرئ \" وكالبهم باسط ذراعيه بالوصيد \" . فيحتمل أن يريد بالكالب هذا الرجل على ما روي ; إذ بسط الذراعين واللصوق بالأرض مع رفع الوجه للتطلع هي هيئة الريبة المستخفي بنفسه . ويحتمل أن يريد بالكالب الكلب . وقرأ جعفر بن محمد الصادق \" كالبهم \" يعني صاحب الكلب .\nقوله تعالى : باسط ذراعيه أعمل اسم الفاعل وهو بمعنى المضي ; لأنها حكاية حال ولم يقصد الإخبار عن فعل الكلب . والذراع من طرف المرفق إلى طرف الأصبع الوسطى . ثم قيل : بسط ذراعيه لطول المدة . وقيل : نام الكلب ، وكان ذلك من الآيات . وقيل : نام مفتوح العين .\nبالوصيد الوصيد : الفناء ; قاله ابن عباس ومجاهد وابن جبير ، أي فناء الكهف ، والجمع وصائد ووصد . وقيل الباب . وقاله ابن عباس أيضا . وأنشد :\nبأرض فضاء لا يسد وصيدها علي ومعروفي بها غير منكر\nوقد تقدم . وقال عطاء : عتبة الباب ، والباب الموصد هو المغلق . وقد أوصدت الباب وآصدته أي أغلقته . والوصيد : النبات المتقارب الأصول ، فهو مشترك ، والله أعلم .\nقوله تعالى : لو اطلعت عليهم قرأ الجمهور بكسر الواو . والأعمش ويحيى بن وثاب بضمها .\nلوليت منهم فرارا أي لو أشرفت عليهم لهربت منهم .\nولملئت منهم رعبا أي لما حفهم الله - تعالى - من الرعب واكتنفهم من الهيبة . وقيل : لوحشة مكانهم ; وكأنهم آواهم الله إلى هذا المكان الوحش في الظاهر لينفر الناس عنهم . وقيل : كان الناس محجوبين عنهم بالرعب ، لا يجسر أحد منهم على الدنو إليهم . وقيل : الفرار منهم لطول شعورهم وأظفارهم ; وذكره المهدوي والنحاس والزجاج والقشيري . وهذا بعيد ; لأنهم لما استيقظوا قال بعضهم لبعض : لبثنا يوما أو بعض يوم . ودل هذا على أن شعورهم وأظفارهم كانت بحالها ; إلا أن يقال : إنما قالوا ذلك قبل أن ينظروا إلى أظفارهم وشعورهم . قال ابن عطية : والصحيح في أمرهم أن الله - عز وجل - حفظ لهم الحالة التي ناموا عليها لتكون لهم ولغيرهم فيهم آية ، فلم يبل لهم ثوب ولم تغير صفة ، ولم ينكر الناهض إلى المدينة إلا معالم الأرض والبناء ، ولو كانت في نفسه حالة ينكرها لكانت عليه أهم . وقرأ نافع وابن كثير وابن عباس وأهل مكة والمدينة \" لملئت منهم \" بتشديد اللام على تضعيف المبالغة ; أي ملئت ثم ملئت . وقرأ الباقون لملئت بالتخفيف ، والتخفيف أشهر في اللغة . وقد جاء التثقيل في قول المخبل السعدي :\nوإذ فتك النعمان بالناس محرما فملي من كعب بن عوف سلاسله\nوقرأ الجمهور رعبا بإسكان العين . وقرأ بضمها أبو جعفر . قال أبو حاتم : هما لغتان . وفرارا نصب على الحال ورعبا مفعول ثان أو تمييز .\n                                    ",
        "saadi": "وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ لَوِ ٱطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارٗا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبٗا ٨١\n                                        \n                                        \n                                        \n                                        { وَتَحْسَبُهُمْ أَيْقَاظًا وَهُمْ رُقُودٌ } أي: تحسبهم أيها الناظر إليهم [كأنهم] أيقاظ، والحال أنهم نيام، قال المفسرون: وذلك لأن أعينهم منفتحة، لئلا تفسد، فالناظر إليهم يحسبهم أيقاظا، وهم رقود، { وَنُقَلِّبُهُمْ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ } وهذا أيضا من حفظه لأبدانهم، لأن الأرض من طبيعتها، أكل الأجسام المتصلة بها، فكان من قدر الله، أن قلبهم على جنوبهم يمينا وشمالا، بقدر ما لا تفسد الأرض أجسامهم، والله تعالى قادر على حفظهم من الأرض، من غير تقليب، ولكنه تعالى حكيم، أراد أن تجري سنته في الكون، ويربط الأسباب بمسبباتها.\n{ وَكَلْبُهُمْ بَاسِطٌ ذِرَاعَيْهِ بِالْوَصِيدِ } أي: الكلب الذي كان مع أصحاب الكهف، أصابه ما أصابهم من النوم وقت حراسته، فكان باسطا ذراعيه بالوصيد، أي: الباب، أو فنائه، هذا حفظهم من الأرض. وأما حفظهم من الآدميين، فأخبر أنه حماهم بالرعب، الذي نشره الله عليهم، فلو اطلع عليهم أحد، لامتلأ قلبه رعبا، وولى منهم فرارا، وهذا الذي أوجب أن يبقوا كل هذه المدة الطويلة، وهم لم يعثر عليهم أحد، مع قربهم من المدينة جدا، والدليل على قربهم، أنهم لما استيقظوا، أرسلوا أحدهم، يشتري لهم طعاما من المدينة، وبقوا في انتظاره، فدل ذلك على شدة قربهم منها.\n                                    "
      },
      "originalText": "وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ لَوِ ٱطَّلَعۡتَ عَلَيۡهِمۡ لَوَلَّيۡتَ مِنۡهُمۡ فِرَارٗا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبٗا ٨١"
    },
    {
      "number": 2159,
      "text": "وَكَذَٰلِكَ بَعَثْنَاهُمْ لِيَتَسَاءَلُوا بَيْنَهُمْ ۚ قَالَ قَائِلٌ مِنْهُمْ كَمْ لَبِثْتُمْ ۖ قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ ۚ قَالُوا رَبُّكُمْ أَعْلَمُ بِمَا لَبِثْتُمْ فَابْعَثُوا أَحَدَكُمْ بِوَرِقِكُمْ هَٰذِهِ إِلَى الْمَدِينَةِ فَلْيَنْظُرْ أَيُّهَا أَزْكَىٰ طَعَامًا فَلْيَأْتِكُمْ بِرِزْقٍ مِنْهُ وَلْيَتَلَطَّفْ وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 19,
      "juz": 15,
      "manzil": 4,
      "page": 295,
      "ruku": 254,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَذَٰلِكَ بَعَثۡنَٰهُمۡ لِيَتَسَآءَلُواْ بَيۡنَهُمۡۚ قَالَ قَآئِلٞ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۚ قَالُواْ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوٓاْ أَحَدَكُم بِوَرِقِكُمۡ هَٰذِهِۦٓ إِلَى ٱلۡمَدِينَةِ فَلۡيَنظُرۡ أَيُّهَآ أَزۡكَىٰ طَعَامٗا فَلۡيَأۡتِكُم بِرِزۡقٖ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ أَحَدًا ٩١\n                                    \n                                    \n                                    يقول تعالى : وكما أرقدناهم بعثناهم صحيحة أبدانهم وأشعارهم وأبشارهم ، لم يفقدوا من أحوالهم وهيئاتهم شيئا ، وذلك بعد ثلاثمائة سنة وتسع سنين ؛ ولهذا تساءلوا بينهم : ( كم لبثتم ) ؟ أي : كم رقدتم ؟ ( قالوا لبثنا يوما أو بعض يوم ) كان دخولهم إلى الكهف في أول نهار ، واستيقاظهم كان في آخر نهار ؛ ولهذا استدركوا فقالوا : ( أو بعض يوم قالوا ربكم أعلم بما لبثتم ) أي : الله أعلم بأمركم ، وكأنه حصل لهم نوع تردد في كثرة نومهم ، فالله أعلم ، ثم عدلوا إلى الأهم في أمرهم إذ ذاك وهو احتياجهم إلى الطعام والشراب ، فقالوا : ( فابعثوا أحدكم بورقكم ) أي فضتكم هذه . وذلك أنهم كانوا قد استصحبوا معهم دراهم من منازلهم لحاجتهم إليها ، فتصدقوا منها وبقي منها ؛ فلهذا قالوا : ( فابعثوا أحدكم بورقكم هذه إلى المدينة ) أي مدينتكم التي خرجتم منها والألف واللام للعهد .\n( فلينظر أيها أزكى طعاما ) أي : أطيب طعاما ، كقوله : ( ولولا فضل الله عليكم ورحمته ما زكا منكم من أحد أبدا ) [ النور : 21 ] وقوله ) قد أفلح من تزكى ) [ الأعلى : 14 ] ومنه الزكاة التي تطيب المال وتطهره . وقيل : أكثر طعاما ، ومنه زكاة الزرع إذا كثر ، قال الشاعر :\nقبائلنا سبع وأنتم ثلاثة وللسبع أزكى من ثلاث وأطيب\nوالصحيح الأول ؛ لأن مقصودهم إنما هو الطيب الحلال ، سواء كان قليلا أو كثيرا .\nوقوله ) وليتلطف ) أي : في خروجه وذهابه ، وشرائه وإيابه ، يقولون : وليتخف كل ما يقدر عليه ) ولا يشعرن ) أي : ولا يعلمن ( بكم أحدا)\n                                    ",
        "qortoby": "وَكَذَٰلِكَ بَعَثۡنَٰهُمۡ لِيَتَسَآءَلُواْ بَيۡنَهُمۡۚ قَالَ قَآئِلٞ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۚ قَالُواْ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوٓاْ أَحَدَكُم بِوَرِقِكُمۡ هَٰذِهِۦٓ إِلَى ٱلۡمَدِينَةِ فَلۡيَنظُرۡ أَيُّهَآ أَزۡكَىٰ طَعَامٗا فَلۡيَأۡتِكُم بِرِزۡقٖ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ أَحَدًا ٩١\n                                    \n                                    \n                                    قوله : وكذلك بعثناهم ليتساءلوا بينهم قال قائل منهم كم لبثتم قالوا لبثنا يوما أو بعض يوم قالوا ربكم أعلم بما لبثتم فابعثوا أحدكم بورقكم هذه إلى المدينة فلينظر أيها أزكى طعاما فليأتكم برزق منه وليتلطف ولا يشعرن بكم أحدا\nقوله تعالى : وكذلك بعثناهم ليتساءلوا بينهم البعث : التحريك عن سكون . والمعنى : كما ضربنا على آذانهم وزدناهم هدى وقلبناهم بعثناهم أيضا ; أي أيقظناهم من نومهم على ما كانوا عليهم من هيئتهم في ثيابهم وأحوالهم . قال الشاعر :\nوفتيان صدق قد بعثت بسحرة فقاموا جميعا بين عاث ونشوان\nأي أيقظت واللام في قوله ليتساءلوا لام الصيرورة وهي لام العاقبة ; كقوله ليكون لهم عدوا وحزنا فبعثهم لم يكن لأجل تساؤلهم .\nقوله تعالى : قالوا لبثنا يوما أو بعض يوم وذلك أنهم دخلوه غدوة وبعثهم الله في آخر النهار ; فقال رئيسهم يمليخا أو مكسلمينا : الله أعلم بالمدة .\nقوله تعالى : فابعثوا أحدكم بورقكم هذه إلى المدينة فيه سبع مسائل :\nالأولى : قال ابن عباس : كانت ورقهم كأخفاف الربع ; ذكره النحاس . وقرأ ابن كثير ونافع وابن عامر والكسائي وحفص عن عاصم بورقكم بكسر الراء . وقرأ أبو عمرو وحمزة وأبو بكر عن عاصم \" بورقكم \" بسكون الراء ، حذفوا الكسرة لثقلها ، وهما لغتان . وقرأ الزجاج \" بورقكم \" بكسر الواو وسكون الراء . ويروى أنهم انتبهوا جياعا ، وأن المبعوث هو يمليخا ، كان أصغرهم ; فيما ذكر الغزنوي . والمدينة : أفسوس ويقال هي طرسوس ، وكان اسمها في الجاهلية أفسوس ; فلما جاء الإسلام سموها طرسوس . وقال ابن عباس : كان معهم دراهم عليها صورة الملك الذي كان في زمانهم .\nالثانية : قوله تعالى : فلينظر أيها أزكى طعاما قال ابن عباس : أحل ذبيحة ; لأن أهل بلدهم كانوا يذبحون على اسم الصنم ، وكان فيهم قوم يخفون إيمانهم . ابن عباس : كان عامتهم مجوسا . وقيل أزكى طعاما أي أكثر بركة . قيل : إنهم أمروه أن يشتري ما يظن أنه طعام اثنين أو ثلاثة لئلا يطلع عليهم ، ثم إذا طبخ كفى جماعة ; ولهذا قيل ذلك الطعام الأرز . وقيل : كان زبيبا . وقيل تمرا ; فالله أعلم . وقيل : \" أزكى \" أطيب . وقيل أرخص .\nفليأتكم برزق منه أي بقوت .\nوليتلطف أي في دخول المدينة وشراء الطعام .\nولا يشعرن بكم أحدا أي لا يخبرن . وقيل : إن ظهر عليه فلا يوقعن إخوانه فيما وقع فيه .\n                                    ",
        "saadi": "وَكَذَٰلِكَ بَعَثۡنَٰهُمۡ لِيَتَسَآءَلُواْ بَيۡنَهُمۡۚ قَالَ قَآئِلٞ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۚ قَالُواْ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوٓاْ أَحَدَكُم بِوَرِقِكُمۡ هَٰذِهِۦٓ إِلَى ٱلۡمَدِينَةِ فَلۡيَنظُرۡ أَيُّهَآ أَزۡكَىٰ طَعَامٗا فَلۡيَأۡتِكُم بِرِزۡقٖ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ أَحَدًا ٩١\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وكذلك بعثناهم } أي: من نومهم الطويل { ليتساءلوا بينهم } أي: ليتباحثوا للوقوف على الحقيقة من مدة لبثهم.\n{ قَالَ قَائِلٌ مِنْهُمْ كَمْ لَبِثْتُمْ قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ } وهذا مبني على ظن القائل، وكأنهم وقع عندهم اشتباه. في طول مدتهم، فلهذا { قَالُوا رَبُّكُمْ أَعْلَمُ بِمَا لَبِثْتُمْ } فردوا العلم إلى المحيط علمه بكل شيء، جملة وتفصيلا، ولعل الله تعالى -بعد ذلك- أطلعهم على مدة لبثهم، لأنه بعثهم ليتساءلوا بينهم، وأخبر أنهم تساءلوا، وتكلموا بمبلغ ما عندهم، وصار آخر أمرهم، الاشتباه، فلا بد أن يكون قد أخبرهم يقينا، علمنا ذلك من حكمته في بعثهم، وأنه لا يفعل ذلك عبثا. ومن رحمته بمن طلب علم الحقيقة في الأمور المطلوب علمها، وسعى لذلك ما أمكنه، فإن الله يوضح له ذلك، وبما ذكر فيما بعده من قوله. { وَكَذَلِكَ أَعْثَرْنَا عَلَيْهِمْ لِيَعْلَمُوا أَنَّ وَعْدَ اللَّهِ حَقٌّ وَأَنَّ السَّاعَةَ لَا رَيْبَ فِيهَا } فلولا أنه حصل العلم بحالهم، لم يكونوا دليلا على ما ذكر، ثم إنهم لما تساءلوا بينهم، وجرى منهم ما أخبر الله به، أرسلوا أحدهم بورقهم، أي: بالدراهم، التي كانت معهم، ليشتري لهم طعاما يأكلونه، من المدينة التي خرجوا منها، وأمروه أن يتخير من الطعام أزكاه، أي: أطيبه وألذه، وأن يتلطف في ذهابه وشرائه وإيابه، وأن يختفي في ذلك، ويخفي حال إخوانه، ولا يشعرن بهم أحدا. وذكروا المحذور من اطلاع غيرهم عليهم، وظهورهم عليهم، أنهم بين أمرين، إما الرجم بالحجارة، فيقتلونهم أشنع قتلة، لحنقهم عليهم وعلى دينهم، وإما أن يفتنوهم عن دينهم، ويردوهم في ملتم، وفي هذه الحال، لا يفلحون أبدا، بل يحشرون في دينهم ودنياهم وأخراهم، وقد دلت هاتان الآيتان، على عدة فوائد.\nمنها: الحث على العلم، وعلى المباحثة فيه، لكون الله بعثهم لأجل ذلك.\nومنها: الأدب فيمن اشتبه عليه العلم، أن يرده إلى عالمه، وأن يقف عند حده.\nومنها: صحة الوكالة في البيع والشراء، وصحة الشركة في ذلك.\nومنها: جواز أكل الطيبات، والمطاعم اللذيذة، إذا لم تخرج إلى حد الإسراف المنهي عنه لقوله { فَلْيَنْظُرْ أَيُّهَا أَزْكَى طَعَامًا فَلْيَأْتِكُمْ بِرِزْقٍ مِنْهُ } وخصوصا إذا كان الإنسان لا يلائمه إلا ذلك ولعل هذا عمدة كثير من المفسرين، القائلين بأن هؤلاء أولاد ملوك لكونهم أمروه بأزكى الأطعمة، التي جرت عادة الأغنياء الكبار بتناولها.\n                                    "
      },
      "originalText": "وَكَذَٰلِكَ بَعَثۡنَٰهُمۡ لِيَتَسَآءَلُواْ بَيۡنَهُمۡۚ قَالَ قَآئِلٞ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُواْ لَبِثۡنَا يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۚ قَالُواْ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوٓاْ أَحَدَكُم بِوَرِقِكُمۡ هَٰذِهِۦٓ إِلَى ٱلۡمَدِينَةِ فَلۡيَنظُرۡ أَيُّهَآ أَزۡكَىٰ طَعَامٗا فَلۡيَأۡتِكُم بِرِزۡقٖ مِّنۡهُ وَلۡيَتَلَطَّفۡ وَلَا يُشۡعِرَنَّ بِكُمۡ أَحَدًا ٩١"
    },
    {
      "number": 2160,
      "text": "إِنَّهُمْ إِنْ يَظْهَرُوا عَلَيْكُمْ يَرْجُمُوكُمْ أَوْ يُعِيدُوكُمْ فِي مِلَّتِهِمْ وَلَنْ تُفْلِحُوا إِذًا أَبَدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 20,
      "juz": 15,
      "manzil": 4,
      "page": 295,
      "ruku": 254,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّهُمۡ إِن يَظۡهَرُواْ عَلَيۡكُمۡ يَرۡجُمُوكُمۡ أَوۡ يُعِيدُوكُمۡ فِي مِلَّتِهِمۡ وَلَن تُفۡلِحُوٓاْ إِذًا أَبَدٗا ٠٢\n                                    \n                                    \n                                    أي : إن علموا بمكانكم ، ( يرجموكم أو يعيدوكم في ملتهم ) يعنون أصحاب دقيانوس ، يخافون منهم أن يطلعوا على مكانهم ، فلا يزالون يعذبونهم بأنواع العذاب إلى أن يعيدوهم في ملتهم التي هم عليها أو يموتوا ، وإن واتوهم على العود في الدين فلا فلاح لكم في الدنيا ولا في الآخرة ؛ ولهذا قال ) ولن تفلحوا إذا أبدا ) .\n                                    ",
        "qortoby": "إِنَّهُمۡ إِن يَظۡهَرُواْ عَلَيۡكُمۡ يَرۡجُمُوكُمۡ أَوۡ يُعِيدُوكُمۡ فِي مِلَّتِهِمۡ وَلَن تُفۡلِحُوٓاْ إِذًا أَبَدٗا ٠٢\n                                    \n                                    \n                                    إنهم إن يظهروا عليكم يرجموكم أو يعيدوكم في ملتهم ولن تفلحوا إذا أبدا قال الزجاج : معناه بالحجارة ، وهو أخبث القتل . وقيل : يرموكم بالسب والشتم ; والأول أصح ، لأنه كان عازما على قتلهم كما تقدم في قصصهم . والرجم فيما سلف هي كانت على ما ذكر قبله [ عقوبة ] مخالفة دين الناس إذ هي أشفى لجملة أهل ذلك الدين من حيث إنهم يشتركون فيها .\nفي هذه البعثة بالورق دليل على الوكالة وصحتها . وقد وكل علي بن أبي طالب أخاه عقيلا عند عثمان - رضي الله عنه - ; ولا خلاف فيها في الجملة . والوكالة معروفة في الجاهلية والإسلام ; ألا ترى إلى عبد الرحمن بن عوف كيف وكل أمية بن خلف بأهله وحاشيته بمكة ; أي يحفظهم ، وأمية مشرك ، والتزم عبد الرحمن لأمية من حفظ حاشيته بالمدينة مثل ذلك مجازاة لصنعه . روى البخاري عن عبد الرحمن بن عوف قال : كاتبت أمية بن خلف كتابا بأن يحفظني في صاغيتي بمكة وأحفظه في صاغيته بالمدينة ; فلما ذكرت الرحمن ; قال : لا أعرف الرحمن كاتبني باسمك الذي كان في الجاهلية ، فكاتبته عبد عمرو . . . وذكر الحديث . قال الأصمعي : صاغية الرجل الذين يميلون إليه ويأتونه ; وهو مأخوذ من صغا يصغو ويصغى إذا مال ، وكل مائل إلى الشيء أو معه فقد صغا إليه وأصغى ; من كتاب الأفعال .\nالوكالة عقد نيابة ، أذن الله سبحانه فيه للحاجة إليه وقيام المصلحة في ذلك ، إذ ليس كل أحد يقدر على تناول أموره إلا بمعونة من غيره أو بترفه فيستنيب من يريحه . وقد استدل علماؤنا على صحتها بآيات من الكتاب ، منها هذه الآية ، وقوله - تعالى - : والعاملين عليها وقوله اذهبوا بقميصي هذا . وأما من السنة فأحاديث كثيرة ; منها حديث عروة البارقي ، وقد تقدم في آخر الأنعام . روى جابر بن عبد الله قال أردت الخروج إلى خيبر فأتيت رسول الله - صلى الله عليه وسلم - فقلت له : إني أردت الخروج إلى خيبر ; فقال : إذا أتيت وكيلي فخذ منه خمسة عشر وسقا فإن ابتغى منك آية فضع يدك على ترقوته خرجه أبو داود . والأحاديث كثيرة في هذا المعنى ، وفي إجماع الأمة على جوازها كفاية .\nالوكالة جائزة في كل حق تجوز النيابة فيه ، فلو وكل الغاصب لم يجز ، وكان هو الوكيل ; لأن كل محرم فعله لا تجوز النيابة فيه .\nفي هذه الآية نكتة بديعة ، وهي أن الوكالة إنما كانت مع التقية خوف أن يشعر بهم أحد لما كانوا عليه من الخوف على أنفسهم . وجواز توكيل ذوي العذر متفق عليه ; فأما من لا عذر له فالجمهور على جوازها . وقال أبو حنيفة وسحنون : لا تجوز . قال ابن العربي : وكأن سحنون تلقفه من أسد بن الفرات فحكم به أيام قضائه ، ولعله كان يفعل ذلك بأهل الظلم والجبروت ; إنصافا منهم وإذلالا لهم ، وهو الحق ; فإن الوكالة معونة ولا تكون لأهل الباطل .\nقلت : هذا حسن ; فأما أهل الدين والفضل فلهم أن يوكلوا وإن كانوا حاضرين أصحاء . والدليل على صحة جواز الوكالة للشاهد الصحيح ما خرجه الصحيحان وغيرهما عن أبي هريرة قال : كان لرجل على النبي - صلى الله عليه وسلم - سن من الإبل فجاء يتقاضاه فقال : أعطوه فطلبوا له سنه فلم يجدوا إلا سنا فوقها ; فقال : أعطوه فقال : أوفيتني أوفى الله لك . قال النبي - صلى الله عليه وسلم - : إن خيركم أحسنكم قضاء . لفظ البخاري . فدل هذا الحديث مع صحته على جواز توكيل الحاضر الصحيح البدن ; فإن النبي - صلى الله عليه وسلم - أمر أصحابه أن يعطوا عنه السن التي كانت عليه ; وذلك توكيد منه لهم على ذلك ، ولم يكن النبي - صلى الله عليه وسلم - مريضا ولا مسافرا . وهذا يرد قول أبي حنيفة وسحنون في قولهما : إنه لا يجوز توكيل الحاضر الصحيح البدن إلا برضا خصمه ; وهذا الحديث خلاف قولهما .\nقال ابن خويز منداد : تضمنت هذه الآية جواز الشركة لأن الورق كان لجميعهم وتضمنت جواز الوكالة لأنهم بعثوا من وكلوه بالشراء . وتضمنت جواز أكل الرفقاء وخلطهم طعامهم معا ، وإن كان بعضهم أكثر أكلا من الآخر ; ومثله قوله - تعالى - : وإن تخالطوهم فإخوانكم حسبما تقدم بيانه في \" البقرة \" . ولهذا قال أصحابنا في المسكين يتصدق عليه فيخلطه بطعام لغني ثم يأكل معه : إن ذلك جائز . وقد قالوا في المضارب يخلط طعامه بطعام غيره ثم يأكل معه : إن ذلك جائز . وقد كان رسول الله - صلى الله عليه وسلم - وكل من اشترى له أضحية . قال ابن العربي : ليس في الآية دليل على ذلك ; لأنه يحتمل أن يكون كل واحد منهم قد أعطاه منفردا فلا يكون فيه اشتراك . ولا معول في هذه المسألة إلا على حديثين : أحدهما : أن ابن عمر مر بقوم يأكلون تمرا فقال : نهى رسول الله - صلى الله عليه وسلم - عن الاقتران إلا أن يستأذن الرجل أخاه . الثاني : حديث أبي عبيدة في جيش الخبط . وهذا دون الأول في الظهور ; لأنه يحتمل أن يكون أبو عبيدة يعطيهم كفافا من ذلك القوت ولا يجمعهم عليه .\nقلت : ومما يدل على خلاف هذا من الكتاب قوله - تعالى - : وإن تخالطوهم فإخوانكم وقوله ليس عليكم جناح أن تأكلوا جميعا أو أشتاتا على ما يأتي إن شاء الله - تعالى - .\n                                    ",
        "saadi": "إِنَّهُمۡ إِن يَظۡهَرُواْ عَلَيۡكُمۡ يَرۡجُمُوكُمۡ أَوۡ يُعِيدُوكُمۡ فِي مِلَّتِهِمۡ وَلَن تُفۡلِحُوٓاْ إِذًا أَبَدٗا ٠٢\n                                        \n                                        \n                                        \n                                        ومنها: الحث على التحرز، والاستخفاء، والبعد عن مواقع الفتن في الدين، واستعمال الكتمان في ذلك على الإنسان وعلى إخوانه في الدين.\nومنها: شدة رغبة هؤلاء الفتية في الدين، وفرارهم من كل فتنة، في دينهم وتركهم أوطانهم في الله.\nومنها: ذكر ما اشتمل عليه الشر من المضار والمفاسد، الداعية لبغضه، وتركه، وأن هذه الطريقة، هي طريقة المؤمنين المتقدمين، والمتأخرين لقولهم: { وَلَنْ تُفْلِحُوا إِذًا أَبَدًا }\n                                    "
      },
      "originalText": "إِنَّهُمۡ إِن يَظۡهَرُواْ عَلَيۡكُمۡ يَرۡجُمُوكُمۡ أَوۡ يُعِيدُوكُمۡ فِي مِلَّتِهِمۡ وَلَن تُفۡلِحُوٓاْ إِذًا أَبَدٗا ٠٢"
    }
  ]
}