{
  "number": 296,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 2161,
      "text": "وَكَذَٰلِكَ أَعْثَرْنَا عَلَيْهِمْ لِيَعْلَمُوا أَنَّ وَعْدَ اللَّهِ حَقٌّ وَأَنَّ السَّاعَةَ لَا رَيْبَ فِيهَا إِذْ يَتَنَازَعُونَ بَيْنَهُمْ أَمْرَهُمْ ۖ فَقَالُوا ابْنُوا عَلَيْهِمْ بُنْيَانًا ۖ رَبُّهُمْ أَعْلَمُ بِهِمْ ۚ قَالَ الَّذِينَ غَلَبُوا عَلَىٰ أَمْرِهِمْ لَنَتَّخِذَنَّ عَلَيْهِمْ مَسْجِدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 21,
      "juz": 15,
      "manzil": 4,
      "page": 296,
      "ruku": 254,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَذَٰلِكَ أَعۡثَرۡنَا عَلَيۡهِمۡ لِيَعۡلَمُوٓاْ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَأَنَّ ٱلسَّاعَةَ لَا رَيۡبَ فِيهَآ إِذۡ يَتَنَٰزَعُونَ بَيۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُواْ ٱبۡنُواْ عَلَيۡهِم بُنۡيَٰنٗاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰٓ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَيۡهِم مَّسۡجِدٗا ١٢\n                                    \n                                    \n                                    يقول تعالى : ( وكذلك أعثرنا عليهم ) أي : أطلعنا عليهم الناس ( ليعلموا أن وعد الله حق وأن الساعة لا ريب فيها )\nذكر غير واحد من السلف أنه كان قد حصل لأهل ذلك الزمان شك في البعث وفي أمر القيامة . وقال عكرمة : كان منهم طائفة قد قالوا : تبعث الأرواح ولا تبعث الأجساد . فبعث الله أهل الكهف حجة ودلالة وآية على ذلك .\nوذكروا أنه لما أراد أحدهم الخروج ليذهب إلى المدينة ، في شراء شيء لهم ليأكلوه ، تنكر وخرج يمشي في غير الجادة ، حتى انتهى إلى المدينة ، وذكروا أن اسمها دقسوس وهو يظن أنه قريب العهد بها ، وكان الناس قد تبدلوا قرنا بعد قرن ، وجيلا بعد جيل ، وأمة بعد أمة ، وتغيرت البلاد ومن عليها ، كما قال الشاعر :\nأما الديار فإنها كديارهم وأرى رجال الحي غير رجاله\nفجعل لا يرى شيئا من معالم البلد التي يعرفها ، ولا يعرف أحدا من أهلها ، لا خواصها ولا عوامها ، فجعل يتحير في نفسه ويقول : لعل بي جنونا أو مسا ، أو أنا حالم ، ويقول : والله ما بي شيء من ذلك ، وإن عهدي بهذه البلدة عشية أمس على غير هذه الصفة . ثم قال : إن تعجيل الخروج من هاهنا لأولى لي . ثم عمد إلى رجل ممن يبيع الطعام ، فدفع إليه ما معه من النفقة ، وسأله أن يبيعه بها طعاما . فلما رآها ذلك الرجل أنكرها وأنكر ضربها ، فدفعها إلى جاره ، وجعلوا يتداولونها بينهم ويقولون : لعل هذا قد وجد كنزا . فسألوه عن أمره ، ومن أين له هذه النفقة ؟ لعله وجدها من كنز . ومن أنت ؟ فجعل يقول : أنا من أهل هذه المدينة وعهدي بها عشية أمس وفيها دقيانوس . فنسبوه إلى الجنون ، فحملوه إلى ولي أمرهم ، فسأله عن شأنه وعن أمره حتى أخبرهم بأمره ، وهو متحير في حاله ، وما هو فيه . فلما أعلمهم بذلك قاموا معه إلى الكهف متولي البلد وأهلها ، حتى انتهى بهم إلى الكهف ، فقال : دعوني حتى أتقدمكم في الدخول لأعلم أصحابي ، فيقال : إنهم لا يدرون كيف ذهب فيه ، وأخفى الله عليهم خبره ويقال : بل دخلوا عليهم ، ورأوهم وسلم عليهم الملك واعتنقهم ، وكان مسلما فيما قيل ، واسمه تيدوسيس ففرحوا به وآنسوه بالكلام ، ثم ودعوه وسلموا عليه ، وعادوا إلى مضاجعهم ، وتوفاهم الله - عز وجل - فالله أعلم .\nقال قتادة : غزا ابن عباس مع حبيب بن مسلمة ، فمروا بكهف في بلاد الروم ، فرأوا فيه عظاما ، فقال قائل : هذه عظام أهل الكهف ؟ فقال ابن عباس : لقد بليت عظامهم من أكثر من ثلاثمائة سنة . رواه ابن جرير .\nوقوله : ( وكذلك أعثرنا عليهم ) أي : كما أرقدناهم وأيقظناهم بهيئاتهم ، أطلعنا عليهم أهل ذلك الزمان ( ليعلموا أن وعد الله حق وأن الساعة لا ريب فيها إذ يتنازعون بينهم أمرهم ) أي : في أمر القيامة ، فمن مثبت لها ومن منكر ، فجعل الله ظهورهم على أصحاب الكهف حجة لهم وعليهم ( فقالوا ابنوا عليهم بنيانا ربهم أعلم بهم ) أي : سدوا عليهم باب كهفهم ، وذروهم على حالهم ( قال الذين غلبوا على أمرهم لنتخذن عليهم مسجدا )\nحكى ابن جرير في القائلين ذلك قولين : أحدهما : إنهم المسلمون منهم . والثاني : أهل الشرك منهم ، فالله أعلم .\nوالظاهر أن الذين قالوا ذلك هم أصحاب الكلمة والنفوذ . ولكن هل هم محمودون أم لا ؟ فيه نظر ؛ لأن النبي صلى الله عليه وسلم قال : \" لعن الله اليهود والنصارى ، اتخذوا قبور أنبيائهم وصالحيهم مساجد \" يحذر ما فعلوا . وقد روينا عن أمير المؤمنين عمر بن الخطاب - رضي الله عنه - أنه لما وجد قبر دانيال في زمانه بالعراق ، أمر أن يخفى عن الناس ، وأن تدفن تلك الرقعة التي وجدوها عنده ، فيها شيء من الملاحم وغيرها .\n                                    ",
        "qortoby": "وَكَذَٰلِكَ أَعۡثَرۡنَا عَلَيۡهِمۡ لِيَعۡلَمُوٓاْ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَأَنَّ ٱلسَّاعَةَ لَا رَيۡبَ فِيهَآ إِذۡ يَتَنَٰزَعُونَ بَيۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُواْ ٱبۡنُواْ عَلَيۡهِم بُنۡيَٰنٗاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰٓ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَيۡهِم مَّسۡجِدٗا ١٢\n                                    \n                                    \n                                    قوله : وكذلك أعثرنا عليهم ليعلموا أن وعد الله حق وأن الساعة لا ريب فيها إذ يتنازعون بينهم أمرهم فقالوا ابنوا عليهم بنيانا ربهم أعلم بهم قال الذين غلبوا على أمرهم لنتخذن عليهم مسجدا\nقوله تعالى : وكذلك أعثرنا عليهم أي أطلعنا عليهم وأظهرناهم . و \" أعثر \" تعدية عثر بالهمزة ، وأصل العثار في القدم .\nليعلموا أن وعد الله حق يعني الأمة المسلمة الذين بعث أهل الكهف على عهدهم . وذلك أن دقيانوس مات ومضت قرون وملك أهل تلك الدار رجل صالح ، فاختلف أهل بلده في الحشر وبعث الأجساد من القبور ، فشك في ذلك بعض الناس واستبعدوه وقالوا : إنما تحشر الأرواح والجسد تأكله الأرض . وقال بعضهم : تبعث الروح والجسد جميعا ; فكبر ذلك على الملك وبقي حيران لا يدري كيف يتبين أمره لهم ، حتى لبس المسوح وقعد على الرماد وتضرع إلى الله - تعالى - في حجة وبيان ، فأعثر الله على أهل الكهف ; فيقال : إنهم لما بعثوا أحدهم بورقهم إلى المدينة ليأتيهم برزق منها استنكر شخصه واستنكرت دراهمه لبعد العهد ، فحمل إلى الملك وكان صالحا قد آمن من معه ، فلما نظر إليه قال : لعل هذا من الفتية الذين خرجوا على عهد دقيانوس الملك ، فقد كنت أدعو الله أن يرينيهم ، وسأل الفتى فأخبره ; فسر الملك بذلك وقال : لعل الله قد بعث لكم آية ، فلنسر إلى الكهف معه ، فركب مع أهل المدينة إليهم ، فلما دنوا إلى الكهف قال تمليخا : أنا أدخل عليهم لئلا يرعبوا فدخل عليهم فأعلمهم الأمر وأن الأمة أمة إسلام ، فروي أنهم سروا بذلك وخرجوا إلى الملك وعظموه وعظمهم ثم رجعوا إلى كهفهم . وأكثر الروايات على أنهم ماتوا حين حدثهم تمليخا ميتة الحق ، على ما يأتي . ورجع من كان شك في بعث الأجساد إلى اليقين . فهذا معنى أعثرنا عليهم . ليعلموا أن وعد الله حق أي ليعلم الملك ورعيته أن القيامة حق والبعث حق إذ يتنازعون بينهم أمرهم . وإنما استدلوا بذلك الواحد على خبرهم وهابوا الدخول عليهم .\nفقال الملك : ابنوا عليهم بنيانا ; فقال الذين هم على دين الفتية : اتخذوا عليهم مسجدا . وروي أن طائفة كافرة قالت : نبني بيعة أو مضيفا ، فمانعهم المسلمون وقالوا لنتخذن عليهم مسجدا . وروي أن بعض القوم ذهب إلى طمس الكهف عليهم وتركهم فيه مغيبين . وروي عن عبد الله بن عمر أن الله - تعالى - أعمى على الناس حينئذ أثرهم وحجبهم عنهم ، فذلك دعا إلى بناء البنيان ليكون معلما لهم . وقيل : إن الملك أراد أن يدفنهم في صندوق من ذهب فأتاه آت منهم في المنام فقال : أردت أن تجعلنا في صندوق من ذهب فلا تفعل ; فإنا من التراب خلقنا وإليه نعود ، فدعنا .\nوتنشأ هنا مسائل ممنوعة وجائزة ; فاتخاذ المساجد على القبور والصلاة فيها والبناء عليها ، إلى غير ذلك مما تضمنته السنة من النهي عنه ممنوع لا يجوز ; لما روى أبو داود والترمذي عن ابن عباس قال : لعن رسول الله - صلى الله عليه وسلم - زوارات القبور والمتخذين عليها المساجد والسرج . قال الترمذي : وفي الباب عن أبي هريرة وعائشة حديث ابن عباس حديث حسن . وروى الصحيحان عن عائشة أن أم حبيبة وأم سلمة ذكرتا كنيسة رأينها بالحبشة فيها تصاوير لرسول الله - صلى الله عليه وسلم - ، فقال رسول الله - صلى الله عليه وسلم - : إن أولئك إذا كان فيهم الرجل الصالح فمات بنوا على قبره مسجدا وصوروا فيه تلك الصور أولئك شرار الخلق عند الله - تعالى - يوم القيامة . لفظ مسلم . قال علماؤنا : وهذا يحرم على المسلمين أن يتخذوا قبور الأنبياء والعلماء مساجد . وروى الأئمة عن أبي مرثد الغنوي قال سمعت رسول الله - صلى الله عليه وسلم - يقول : لا تصلوا إلى القبور ولا تجلسوا عليها لفظ مسلم . أي لا تتخذوها قبلة فتصلوا عليها أو إليها كما فعل اليهود والنصارى ، فيؤدي إلى عبادة من فيها كما كان السبب في عبادة الأصنام . فحذر النبي - صلى الله عليه وسلم - عن مثل ذلك ، وسد الذرائع المؤدية إلى ذلك فقال : اشتد غضب الله على قوم اتخذوا قبور أنبيائهم وصالحيهم مساجد . وروى الصحيحان عن عائشة وعبد الله بن عباس قالا : لما نزل برسول الله - صلى الله عليه وسلم - طفق يطرح خميصة له على وجهه فإذا اغتم بها كشفها عن وجهه فقال وهو كذلك : لعنة الله على اليهود والنصارى اتخذوا قبور أنبيائهم مساجد يحذر ما صنعوا . وروى مسلم عن جابر قال : نهى رسول الله - صلى الله عليه وسلم - أن يجصص القبر وأن يقعد عليه وأن يبنى عليه . وخرجه أبو داود والترمذي أيضا عن جابر قال : نهى رسول الله - صلى الله عليه وسلم - أن تجصص القبور وأن يكتب عليها وأن يبنى عليها وأن توطأ . قال الترمذي : هذا حديث حسن صحيح . وروى الصحيح عن أبي الهياج الأسدي قال : قال لي علي بن أبي طالب : ألا أبعثك على ما بعثني عليه رسول الله - صلى الله عليه وسلم - : ألا تدع تمثالا إلا طمسته ولا قبرا مشرفا إلا سويته - في رواية - ولا صورة إلا طمستها . وأخرجه أبو داود والترمذي . قال علماؤنا : ظاهره منع تسنيم القبور ورفعها وأن تكون لاطئة . وقد قال به بعض أهل العلم . وذهب الجمهور إلى أن هذا الارتفاع المأمور بإزالته هو ما زاد على التسنيم ، ويبقى للقبر ما يعرف به ويحترم ، وذلك صفة قبر نبينا محمد - صلى الله عليه وسلم - وقبر صاحبيه - رضي الله عنهما - على ما ذكر مالك في الموطإ - وقبر أبينا آدم - صلى الله عليه وسلم - ، على ما رواه الدارقطني من حديث ابن عباس . وأما تعلية البناء الكثير على نحو ما كانت الجاهلية تفعله تفخيما وتعظيما فذلك يهدم ويزال ; فإن فيه استعمال زينة الدنيا في أول منازل الآخرة ، وتشبها بمن كان يعظم القبور ويعبدها . وباعتبار هذه المعاني وظاهر النهي أن ينبغي أن يقال : هو حرام . والتسنيم في القبر : ارتفاعه قدر شبر ; مأخوذ من سنام البعير . ويرش عليه بالماء لئلا ينتثر بالريح . وقال الشافعي لا بأس أن يطين القبر . وقال أبو حنيفة : لا يجصص القبر ولا يطين ولا يرفع عليه بناء فيسقط . ولا بأس بوضع الأحجار لتكون علامة ; لما رواه أبو بكر الأثرم قال : حدثنا مسدد حدثنا نوح بن دراج عن أبان بن تغلب عن جعفر بن محمد قال : كانت فاطمة بنت رسول الله - صلى الله عليه وسلم - تزور قبر حمزة بن عبد المطلب كل جمعة وعلمته بصخرة ; ذكره أبو عمر .\nوأما الجائزة : فالدفن في التابوت ; وهو جائز لا سيما في الأرض الرخوة . روي أن دانيال - صلوات الله عليه - كان في تابوت من حجر ، وأن يوسف - عليه السلام - أوصى بأن يتخذ له تابوت من زجاج ويلقى في ركية مخافة أن يعبد ، وبقي كذلك إلى زمان موسى - صلوات الله عليهم أجمعين - ; فدلته عليه عجوز فرفعه ووضعه في حظيرة إسحاق - عليه السلام - . وفي الصحيح عن سعد بن أبي وقاص أنه قال في مرضه الذي هلك فيه : اتخذوا لي لحدا وانصبوا علي اللبن نصبا ; كما صنع برسول الله - صلى الله عليه وسلم - . اللحد : هو أن يشق في الأرض ثم يحفر قبر آخر في جانب الشق من جانب القبلة إن كانت الأرض صلبة يدخل فيه الميت ويسد عليه باللبن . وهو أفضل عندنا من الشق ; لأنه الذي اختاره الله - تعالى - لرسوله - صلى الله عليه وسلم - . وبه قال أبو حنيفة قال : السنة اللحد . وقال الشافعي : الشق . ويكره الآجر في اللحد . وقال الشافعي : لا بأس به لأنه نوع من الحجر . وكرهه أبو حنيفة وأصحابه ; لأن الآجر لإحكام البناء ، والقبر وما فيه للبلى ، فلا يليق به الإحكام . وعلى هذا يسوى بين الحجر والآجر . وقيل : إن الآجر أثر النار فيكره تفاؤلا ; فعلى هذا يفرق بين الحجر والآجر . قالوا : ويستحب اللبن والقصب لما روي أنه وضع على قبر النبي - صلى الله عليه وسلم - حزمة من قصب . وحكي عن الشيخ الإمام أبي بكر محمد بن الفضل الحنفي - رحمه الله - أنه جوز اتخاذ التابوت في بلادهم لرخاوة الأرض . وقال : لو اتخذ تابوت من حديد فلا بأس به ، لكن ينبغي أن يفرش فيه التراب وتطين الطبقة العليا مما يلي الميت ، ويجعل اللبن الخفيف على يمين الميت ويساره ليصير بمنزلة اللحد .\nقلت : ومن هذا المعنى جعل القطيفة في قبر النبي - صلى الله عليه وسلم - ; فإن المدينة سبخة ، قال شقران : أنا والله طرحت القطيفة تحت رسول الله - صلى الله عليه وسلم - في القبر . قال أبو عيسى الترمذي : حديث شقران حديث حسن غريب .\n                                    ",
        "saadi": "وَكَذَٰلِكَ أَعۡثَرۡنَا عَلَيۡهِمۡ لِيَعۡلَمُوٓاْ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَأَنَّ ٱلسَّاعَةَ لَا رَيۡبَ فِيهَآ إِذۡ يَتَنَٰزَعُونَ بَيۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُواْ ٱبۡنُواْ عَلَيۡهِم بُنۡيَٰنٗاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰٓ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَيۡهِم مَّسۡجِدٗا ١٢\n                                        \n                                        \n                                        \n                                        يخبر الله تعالى، أنه أطلع الناس على حال أهل الكهف، وذلك -والله أعلم- بعدما استيقظوا، وبعثوا أحدهم يشتري لهم طعاما، وأمروه بالاستخفاء والإخفاء، فأراد الله أمرا فيه صلاح للناس، وزيادة أجر لهم، وهو أن الناس رأوا منهم آية من آيات الله، المشاهدة بالعيان، على أن وعد الله حق لا شك فيه ولا مرية ولا بعد، بعدما كانوا يتنازعون بينهم أمرهم، فمن مثبت للوعد والجزاء، ومن ناف لذلك، فجعل قصتهم زيادة بصيرة ويقين للمؤمنين، وحجة على الجاحدين، وصار لهم أجر هذه القضية، وشهر الله أمرهم، ورفع قدرهم حتى عظمهم الذين اطلعوا عليهم.\nو { فَقَالُوا ابْنُوا عَلَيْهِمْ بُنْيَانًا } الله أعلم بحالهم ومآلهم، وقال من غلب على أمرهم، وهم الذين لهم الأمر:\n{ لَنَتَّخِذَنَّ عَلَيْهِمْ مَسْجِدًا } أي: نعبد الله تعالى فيه، ونتذكر به أحوالهم، وما جرى لهم، وهذه الحالة محظورة، نهى عنها النبي صلى الله عليه وسلم، وذم فاعليها، ولا يدل ذكرها هنا على عدم ذمها، فإن السياق في شأن تعظيم أهل الكهف والثناء عليهم، وأن هؤلاء وصلت بهم الحال إلى أن قالوا: ابنوا عليهم مسجدا، بعد خوف أهل الكهف الشديد من قومهم، وحذرهم من الاطلاع عليهم، فوصلت الحال إلى ما ترى.\nوفي هذه القصة، دليل على أن من فر بدينه من الفتن، سلمه الله منها. وأن من حرص على العافية عافاه الله ومن أوى إلى الله، آواه الله، وجعله هداية لغيره، ومن تحمل الذل في سبيله وابتغاء مرضاته، كان آخر أمره وعاقبته العز العظيم من حيث لا يحتسب { وما عند الله خير للأبرار }\n                                    "
      },
      "originalText": "وَكَذَٰلِكَ أَعۡثَرۡنَا عَلَيۡهِمۡ لِيَعۡلَمُوٓاْ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَأَنَّ ٱلسَّاعَةَ لَا رَيۡبَ فِيهَآ إِذۡ يَتَنَٰزَعُونَ بَيۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُواْ ٱبۡنُواْ عَلَيۡهِم بُنۡيَٰنٗاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِينَ غَلَبُواْ عَلَىٰٓ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَيۡهِم مَّسۡجِدٗا ١٢"
    },
    {
      "number": 2162,
      "text": "سَيَقُولُونَ ثَلَاثَةٌ رَابِعُهُمْ كَلْبُهُمْ وَيَقُولُونَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًا بِالْغَيْبِ ۖ وَيَقُولُونَ سَبْعَةٌ وَثَامِنُهُمْ كَلْبُهُمْ ۚ قُلْ رَبِّي أَعْلَمُ بِعِدَّتِهِمْ مَا يَعْلَمُهُمْ إِلَّا قَلِيلٌ ۗ فَلَا تُمَارِ فِيهِمْ إِلَّا مِرَاءً ظَاهِرًا وَلَا تَسْتَفْتِ فِيهِمْ مِنْهُمْ أَحَدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 22,
      "juz": 15,
      "manzil": 4,
      "page": 296,
      "ruku": 254,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا ٢٢\n                                    \n                                    \n                                    يقول تعالى مخبرا عن اختلاف الناس في عدة أصحاب الكهف ، فحكى ثلاثة أقوال ، فدل على أنه لا قائل برابع ، ولما ضعف القولين الأولين بقوله : ( رجما بالغيب ) أي : قولا بلا علم ، كمن يرمي إلى مكان لا يعرفه ، فإنه لا يكاد يصيب ، وإن أصاب فبلا قصد ، ثم حكى الثالث وسكت عليه أو قرره بقوله : ( وثامنهم كلبهم ) فدل على صحته ، وأنه هو الواقع في نفس الأمر .\nوقوله : ( قل ربي أعلم بعدتهم ) إرشاد إلى أن الأحسن في مثل هذا المقام رد العلم إلى الله تعالى ؛ إذ لا احتياج إلى الخوض في مثل ذلك بلا علم ، لكن إذا أطلعنا على أمر قلنا به ، وإلا وقفنا حيث وقفنا .\nوقوله : ( ما يعلمهم إلا قليل ) أي : من الناس . قال قتادة : قال ابن عباس : أنا من القليل الذي استثنى الله - عز وجل - كانوا سبعة . وكذا روى ابن جريج ، عن عطاء الخراساني عنه أنه كان يقول : أنا ممن استثنى الله ، ويقول : عدتهم سبعة .\nوقال ابن جرير : حدثنا ابن بشار حدثنا عبد الرحمن ، حدثنا إسرائيل ، عن سماك ، عن عكرمة ، عن ابن عباس : ( ما يعلمهم إلا قليل ) قال : أنا من القليل ، كانوا سبعة .\nفهذه أسانيد صحيحة إلى ابن عباس : أنهم كانوا سبعة ، وهو موافق لما قدمناه .\nوقال محمد بن إسحاق بن يسار عن عبد الله بن أبي نجيح ، عن مجاهد قال : لقد حدثت أنه كان على بعضهم من حداثة سنه وضح الورق . قال ابن عباس : فكانوا كذلك ليلهم ونهارهم في عبادة الله ، يبكون ويستغيثون بالله ، وكانوا ثمانية نفر : مكسلمينا وكان أكبرهم وهو الذي كلم الملك عنهم ، و مجسيميلنينا وتمليخا ومرطونس ، وكشطونس ، وبيرونس ، وديموس ، ويطونس وقالوش .\nهكذا وقع في هذه الرواية ، ويحتمل هذا من كلام ابن إسحاق ، ومن بينه وبينه ، فإن الصحيح عن ابن عباس أنهم كانوا سبعة ، وهو ظاهر الآية . وقد تقدم عن شعيب الجبائي أن اسم كلبهم حمران ، وفي تسميتهم بهذه الأسماء واسم كلبهم نظر في صحته ، والله أعلم ؛ فإن غالب ذلك متلقى من أهل الكتاب ، وقد قال تعالى : ( فلا تمار فيهم إلا مراء ظاهرا ) أي : سهلا هينا ؛ فإن الأمر في معرفة ذلك لا يترتب عليه كبير فائدة ( ولا تستفت فيهم منهم أحدا ) أي : فإنهم لا علم لهم بذلك إلا ما يقولونه من تلقاء أنفسهم رجما بالغيب ، أي من غير استناد إلى كلام معصوم ، وقد جاءك الله يا محمد بالحق الذي لا شك فيه ولا مرية ، فهو المقدم الحاكم على كل ما تقدمه من الكتب والأقوال .\n                                    ",
        "qortoby": "سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا ٢٢\n                                    \n                                    \n                                    قوله تعالى : سيقولون ثلاثة رابعهم كلبهم ويقولون خمسة سادسهم كلبهم رجما بالغيب ويقولون سبعة وثامنهم كلبهم قل ربي أعلم بعدتهم ما يعلمهم إلا قليل فلا تمار فيهم إلا مراء ظاهرا ولا تستفت فيهم منهم أحدا\nقوله تعالى : سيقولون ثلاثة رابعهم كلبهم الضمير في سيقولون يراد به أهل التوراة ومعاصري محمد - صلى الله عليه وسلم - . وذلك أنهم اختلفوا في عدد أهل الكهف هذا الاختلاف المنصوص . وقيل : المراد به النصارى ; فإن قوما منهم حضروا النبي - صلى الله عليه وسلم - من نجران فجرى ذكر أصحاب الكهف فقالت اليعقوبية : كانوا ثلاثة رابعهم كلبهم . وقالت النسطورية : كانوا خمسة سادسهم كلبهم . وقال المسلمون : كانوا سبعة ثامنهم كلبهم . وقيل : هو إخبار عن اليهود الذين أمروا المشركين بمسألة النبي - صلى الله عليه وسلم - عن أصحاب الكهف . والواو في قوله وثامنهم كلبهم طريق النحويين أنها واو عطف دخلت في آخر إخبار عن عددهم ; لتفصل أمرهم ، وتدل على أن هذا غاية ما قيل ، ولو سقطت لصح الكلام . وقالت فرقة منها ابن خالويه : هي واو الثمانية . وحكى الثعلبي عن أبي بكر بن عياش أن قريشا كانت تقول في عددها ستة سبعة وثمانية ; فتدخل الواو في الثمانية . وحكى نحوه القفال ، فقال : إن قوما قالوا العدد ينتهي عند العرب إلى سبعة ، فإذا احتيج إلى الزيادة عليها استؤنف خبر آخر بإدخال الواو ، كقوله التائبون العابدون - ثم قال - والناهون عن المنكر والحافظون . يدل عليه أنه لما ذكر أبواب جهنم حتى إذا جاءوها فتحت أبوابها بلا واو ، ولما ذكر الجنة قال : وفتحت أبوابها بالواو . وقال خيرا منكن مسلمات ثم قال وأبكارا فالسبعة نهاية العدد عندهم كالعشرة الآن عندنا . قال القشيري أبو نصر : ومثل هذا الكلام تحكم ، ومن أين السبعة نهاية عندهم ثم هو منقوض بقوله - تعالى - : هو الله الذي لا إله إلا هو الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر ولم يذكر الاسم الثامن بالواو . وقال قوم ممن صار إلى أن عددهم سبعة : إنما ذكر الواو في قوله سبعة وثامنهم لينبه على أن هذا العدد هو الحق ، وأنه مباين للأعداد الأخر التي قال فيها أهل الكتاب ; ولهذا قال - تعالى - في الجملتين المتقدمتين رجما بالغيب ولم يذكره في الجملة الثالثة ولم يقدح فيها بشيء ; فكأنه قال لنبيه هم سبعة وثامنهم كلبهم . والرجم : القول بالظن ; يقال لكل ما يخرص : رجم فيه ومرجوم ومرجم ; كما قال :\nوما الحرب إلا ما علمتم وذقتم وما هو عنها بالحديث المرجم\nقلت : قد ذكر الماوردي والغزنوي : وقال ابن جريج ومحمد بن إسحاق كانوا ثمانية ، وجعلا قوله - تعالى - وثامنهم كلبهم أي صاحب كلبهم . وهذا مما يقوي طريق النحويين في الواو ، وأنها كما قالوا . وقال القشيري : لم يذكر الواو في قوله : رابعهم سادسهم ، ولو كان بالعكس لكان جائزا ، فطلب الحكمة والعلة في مثل هذه الواو تكلف بعيد ، وهو كقوله في موضع آخر وما أهلكنا من قرية إلا ولها كتاب معلوم . وفي موضع آخر : إلا لها منذرون ذكرى .\nقوله تعالى : قل ربي أعلم بعدتهم أمر الله - تعالى - نبيه - عليه السلام - في هذه الآية أن يرد علم عدتهم إليه - عز وجل - . ثم أخبر أن عالم ذلك من البشر قليل . والمراد به قوم من أهل الكتاب ; في قول عطاء . وكان ابن عباس يقول : أنا من ذلك القليل ، كانوا سبعة وثامنهم كلبهم ، ثم ذكر السبعة بأسمائهم ، والكلب اسمه قطمير كلب أنمر ، فوق القلطي ودون الكردي . وقال محمد بن سعيد بن المسيب : هو كلب صيني . والصحيح أنه زبيري . وقال : ما بقي بنيسابور محدث إلا كتب عني هذا الحديث إلا من لم يقدر له . قال : وكتبه أبو عمرو الحيري عني .\nقوله تعالى : فلا تمار فيهم إلا مراء ظاهرا أي لا تجادل في أصحاب الكهف إلا بما أوحيناه إليك ; وهو رد علم عدتهم إلى الله - تعالى - . وقيل : معنى المراء الظاهر أن تقول : ليس كما تقولون ، ونحو هذا ، ولا تحتج على أمر مقدر في ذلك . وفي هذا دليل على أن الله - تعالى - لم يبين لأحد عددهم فلهذا قال إلا مراء ظاهرا أي ذاهبا ; كما قال :\nوتلك شكاة ظاهر عنك عارها\nولم يبح له في هذه الآية أن يماري ; ولكن قوله إلا مراء استعارة من حيث يماريه أهل الكتاب . سميت مراجعته لهم مراء ثم قيد بأنه ظاهر ; ففارق المراء الحقيقي المذموم . والضمير في قوله فيهم عائد على أهل الكهف . وقوله : فلا تمار فيهم يعني في عدتهم ; وحذفت العدة لدلالة ظاهر القول عليها .\nقوله تعالى : ولا تستفت فيهم منهم أحدا روي أنه - عليه السلام - سأل نصارى نجران عنهم فنهي عن السؤال . والضمير في قوله منهم عائد على أهل الكتاب المعارضين . وفي هذا دليل على منع المسلمين من مراجعة أهل الكتاب في شيء من العلم .\n                                    ",
        "saadi": "سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا ٢٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن اختلاف أهل الكتاب في عدة أصحاب الكهف، اختلافا صادرا عن رجمهم بالغيب، وتقولهم بما لا يعلمون، وأنهم فيهم على ثلاثة أقوال:\nمنهم: من يقول: ثلاثة، رابعهم كلبهم، ومنهم من يقول: خمسة، سادسهم كلبهم. وهذان القولان، ذكر الله بعدهما، أن هذا رجم منهم بالغيب، فدل على بطلانهما.\nومنهم من يقول: سبعة، وثامنهم كلبهم، وهذا -والله أعلم- الصواب، لأن الله أبطل الأولين ولم يبطله، فدل على صحته، وهذا من الاختلاف الذي لا فائدة تحته، ولا يحصل بمعرفة عددهم مصلحة للناس، دينية ولا دنيوية، ولهذا قال تعالى:\n( قُلْ رَبِّي أَعْلَمُ بِعِدَّتِهِمْ مَا يَعْلَمُهُمْ إِلا قَلِيلٌ ) وهم الذين أصابوا الصواب وعلموا إصابتهم. ( فَلا تُمَارِ ) أي: تجادل وتحاج ( فيهم إِلا مِرَاءً ظَاهِرًا ) أي: مبنيا على العلم واليقين، ويكون أيضا فيه فائدة، وأما المماراة المبنية على الجهل والرجم بالغيب، أو التي لا فائدة فيها، إما أن يكون الخصم معاندا، أو تكون المسألة لا أهمية فيها، ولا تحصل فائدة دينية بمعرفتها، كعدد أصحاب الكهف ونحو ذلك، فإن في كثرة المناقشات فيها، والبحوث المتسلسلة، تضييعا للزمان، وتأثيرا في مودة القلوب بغير فائدة.\n( وَلا تَسْتَفْتِ فِيهِمْ ) أي: في شأن أهل الكهف ( مِنْهُمْ ) أي: من أهل الكتاب ( أَحَدًا ) وذلك لأن مبنى كلامهم فيهم على الرجم بالغيب والظن، الذي لا يغني من الحق شيئا، ففيها دليل على المنع من استفتاء من لا يصلح للفتوى، إما لقصوره في الأمر المستفتى فيه، أو لكونه لا يبالي بما تكلم به، وليس عنده ورع يحجزه، وإذا نهي عن استفتاء هذا الجنس، فنهيه هو عن الفتوى، من باب أولى وأحرى.\nوفي الآية أيضا، دليل على أن الشخص، قد يكون منهيا عن استفتائه في شيء، دون آخر. فيستفتى فيما هو أهل له، بخلاف غيره، لأن الله لم ينه عن استفتائهم مطلقا، إنما نهى عن استفتائهم في قصة أصحاب الكهف، وما أشبهها.\n                                    "
      },
      "originalText": "سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا ٢٢"
    },
    {
      "number": 2163,
      "text": "وَلَا تَقُولَنَّ لِشَيْءٍ إِنِّي فَاعِلٌ ذَٰلِكَ غَدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 23,
      "juz": 15,
      "manzil": 4,
      "page": 296,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا ٣٢\n                                    \n                                    \n                                    هذا إرشاد من الله لرسوله صلوات الله وسلامه عليه ، إلى الأدب فيما إذا عزم على شيء ليفعله في المستقبل ، أن يرد ذلك إلى مشيئة الله - عز وجل - علام الغيوب ، الذي يعلم ما كان وما يكون ، وما لم يكن لو كان كيف كان يكون ، كما ثبت في الصحيحين عن أبي هريرة - رضي الله عنه - عن رسول الله صلى الله عليه وسلم أنه [ قال ] قال سليمان بن داود عليهما السلام : لأطوفن الليلة على سبعين امرأة - وفي رواية : تسعين امرأة . وفي رواية : مائة امرأة - تلد كل امرأة منهن غلاما يقاتل في سبيل الله ، فقيل له - وفي رواية : فقال له الملك - قل : إن شاء الله . فلم يقل فطاف بهن فلم يلد منهن إلا امرأة واحدة نصف إنسان \" ، فقال رسول الله صلى الله عليه وسلم : \" والذي نفسي بيده ، لو قال : \" إن شاء الله \" لم يحنث ، وكان دركا لحاجته \" ، وفي رواية : \" ولقاتلوا في سبيل الله فرسانا أجمعون\nوقد تقدم في أول السورة ذكر سبب نزول هذه الآية في قول النبي صلى الله عليه وسلم ، لما سئل عن قصة أصحاب الكهف : \" غدا أجيبكم \" . فتأخر الوحي خمسة عشر يوما ، وقد ذكرناه بطوله في أول السورة ، فأغنى عن إعادته .\n                                    ",
        "qortoby": "وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا ٣٢\n                                    \n                                    \n                                    قوله تعالى : ولا تقولن لشيء إني فاعل ذلك غدا إلا أن يشاء الله واذكر ربك إذا نسيت وقل عسى أن يهديني ربي لأقرب من هذا رشدا\nقوله تعالى : ولا تقولن لشيء إني فاعل ذلك غدا إلا أن يشاء الله فيه :\nقال العلماء عاتب الله - تعالى - نبيه - عليه السلام - على قوله للكفار حين سألوه عن الروح والفتية وذي القرنين : غدا أخبركم بجواب أسئلتكم ; ولم يستثن في ذلك . فاحتبس الوحي عنه خمسة عشر يوما حتى شق ذلك عليه وأرجف الكفار به ، فنزلت عليه هذه السورة مفرجة . وأمر في هذه الآية ألا يقول في أمر من الأمور إني أفعل غدا كذا وكذا ، إلا أن يعلق ذلك بمشيئة الله - عز وجل - حتى لا يكون محققا لحكم الخبر ; فإنه إذا قال : لأفعلن ذلك ولم يفعل كان كاذبا ، وإذا قال لأفعلن ذلك إن شاء الله خرج عن أن يكون محققا للمخبر عنه . واللام في قوله لشيء بمنزلة في ، أو كأنه قال لأجل شيء .\n                                    ",
        "saadi": "وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا ٣٢\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 23 و 24 :ـ\nهذا النهي كغيره، وإن كان لسبب خاص وموجها للرسول صل الله عليه وسلم، فإن الخطاب عام للمكلفين، فنهى الله أن يقول العبد في الأمور المستقبلة، { إني فاعل ذلك } من دون أن يقرنه بمشيئة الله، وذلك لما فيه من المحذور، وهو: الكلام على الغيب المستقبل، الذي لا يدري، هل يفعله أم لا؟ وهل تكون أم لا؟ وفيه رد الفعل إلى مشيئة العبد استقلالا، وذلك محذور محظور، لأن المشيئة كلها لله { وما تشاءون إلا أن يشاء الله رب العالمين } ولما في ذكر مشيئة الله، من تيسير الأمر وتسهيله، وحصول البركة فيه، والاستعانة من العبد لربه، ولما كان العبد بشرا، لا بد أن يسهو فيترك ذكر المشيئة، أمره الله أن يستثني بعد ذلك، إذا ذكر، ليحصل المطلوب، وينفع المحذور، ويؤخذ من عموم قوله: { وَاذْكُرْ رَبَّكَ إِذَا نَسِيتَ } الأمر بذكر الله عند النسيان، فإنه يزيله، ويذكر العبد ما سها عنه، وكذلك يؤمر الساهي الناسي لذكر الله، أن يذكر ربه، ولا يكونن من الغافلين، ولما كان العبد مفتقرا إلى الله في توفيقه للإصابة، وعدم الخطأ في أقواله وأفعاله، أمره الله أن يقول: { عَسَى أَنْ يَهْدِيَنِ رَبِّي لِأَقْرَبَ مِنْ هَذَا رَشَدًا } فأمره أن يدعو الله ويرجوه، ويثق به أن يهديه لأقرب الطرق الموصلة إلى الرشد. وحري بعبد، تكون هذه حاله، ثم يبذل جهده، ويستفرغ وسعه في طلب الهدى والرشد، أن يوفق لذلك، وأن تأتيه المعونة من ربه، وأن يسدده في جميع أموره.\n                                    "
      },
      "originalText": "وَلَا تَقُولَنَّ لِشَاْيۡءٍ إِنِّي فَاعِلٞ ذَٰلِكَ غَدًا ٣٢"
    },
    {
      "number": 2164,
      "text": "إِلَّا أَنْ يَشَاءَ اللَّهُ ۚ وَاذْكُرْ رَبَّكَ إِذَا نَسِيتَ وَقُلْ عَسَىٰ أَنْ يَهْدِيَنِ رَبِّي لِأَقْرَبَ مِنْ هَٰذَا رَشَدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 24,
      "juz": 15,
      "manzil": 4,
      "page": 296,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا ٤٢\n                                    \n                                    \n                                    وقوله : ( واذكر ربك إذا نسيت ) قيل : معناه إذا نسيت الاستثناء ، فاستثن عند ذكرك له . قاله أبو العالية ، والحسن البصري .\nوقال هشيم ، عن الأعمش ، عن مجاهد ، عن ابن عباس في الرجل يحلف ؟ قال : له أن يستثني ولو إلى سنة ، وكان يقول : ( واذكر ربك إذا نسيت ) في ذلك . قيل للأعمش : سمعته عن مجاهد ؟ قال حدثني به ليث بن أبي سليم ، يرى ذهب كسائي هذا .\nورواه الطبراني من حديث أبي معاوية ، عن الأعمش ، به .\nومعنى قول ابن عباس : \" أنه يستثني ولو بعد سنة \" أي : إذا نسي أن يقول في حلفه أو كلامه \" إن شاء الله \" وذكر ولو بعد سنة ، فالسنة له أن يقول ذلك ، ليكون آتيا بسنة الاستثناء ، حتى ولو كان بعد الحنث ، قال ابن جرير ، رحمه الله ، ونص على ذلك ، لا أن يكون [ ذلك ] رافعا لحنث اليمين ومسقطا للكفارة . وهذا الذي قاله ابن جرير ، رحمه الله ، هو الصحيح ، وهو الأليق بحمل كلام ابن عباس عليه ، والله أعلم .\nوقال عكرمة : ( واذكر ربك إذا نسيت ) أي : إذا غضبت . وهذا تفسير باللازم .\nوقال الطبراني : حدثنا أحمد بن يحيى الحلواني ، حدثنا سعيد بن سليمان ، عن عباد بن العوام ، عن سفيان بن حسين ، عن يعلى بن مسلم ، عن جابر بن زيد ، عن ابن عباس : ( ولا تقولن لشيء إني فاعل ذلك غدا إلا أن يشاء الله واذكر ربك إذا نسيت ) أن تقول : إن شاء الله [ وهذا تفسير باللازم ] .\nوقال الطبراني : حدثنا محمد بن الحارث الجبيلي حدثنا صفوان بن صالح ، حدثنا الوليد بن مسلم ، عن عبد العزيز بن حصين ، عن ابن أبي نجيح ، عن مجاهد ، عن ابن عباس في قوله : ( ولا تقولن لشيء إني فاعل ذلك غدا إلا أن يشاء الله واذكر ربك إذا نسيت ) أن تقول : إن شاء الله .\nوروى الطبراني ، أيضا عن ابن عباس في قوله : ( واذكر ربك إذا نسيت ) الاستثناء ، فاستثن إذا ذكرت . وقال : هي خاصة برسول الله صلى الله عليه وسلم ، وليس لأحد منا أن يستثني إلا في صلة من يمينه ثم قال : تفرد به الوليد ، عن عبد العزيز بن الحصين .\nويحتمل في الآية وجه آخر ، وهو أن يكون الله - عز وجل - قد أرشد من نسي الشيء في كلامه إلى ذكر الله تعالى ؛ لأن النسيان منشؤه من الشيطان ، كما قال فتى موسى : ( وما أنسانيه إلا الشيطان أن أذكره ) [ الكهف : 63 ] وذكر الله تعالى يطرد الشيطان ، فإذا ذهب الشيطان ذهب النسيان ، فذكر الله سبب للذكر ؛ ولهذا قال : ( واذكر ربك إذا نسيت ) .\nوقوله : ( وقل عسى أن يهديني ربي لأقرب من هذا رشدا ) أي : إذا سئلت عن شيء لا تعلمه ، فاسأل الله فيه ، وتوجه إليه في أن يوفقك للصواب والرشد [ في ذلك ] وقيل غير ذلك في تفسيره ، والله أعلم .\n                                    ",
        "qortoby": "إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا ٤٢\n                                    \n                                    \n                                    قال ابن عطية : وتكلم الناس في هذه الآية في الاستثناء في اليمين ، والآية ليست في الأيمان وإنما هي في سنة الاستثناء في غير اليمين . وقوله : إلا أن يشاء الله في الكلام حذف يقتضيه الظاهر ويحسنه الإيجاز ; تقديره : إلا أن تقول إلا أن يشاء الله ; أو إلا أن تقول إن شاء الله . فالمعنى : إلا أن تذكر مشيئة الله ; فليس إلا أن يشاء الله من القول الذي نهي عنه .\nقلت : ما اختاره ابن عطية وارتضاه هو قول الكسائي والفراء والأخفش . وقال البصريون : المعنى إلا بمشيئة الله . فإذا قال الإنسان أنا أفعل هذا إن شاء الله فمعناه بمشيئة الله . قال ابن عطية : وقالت فرقة إلا أن يشاء الله استثناء من قوله ولا تقولن . قال : وهذا قول حكاه الطبري ورد عليه ، وهو من الفساد بحيث كان الواجب ألا يحكى . وقد تقدم القول في الاستثناء في اليمين وحكمه في \" المائدة \" .\nقوله تعالى : واذكر ربك إذا نسيت وفيه الأمر بالذكر بعد النسيان واختلف في الذكر المأمور به ; فقيل : هو قوله وقل عسى أن يهديني ربي لأقرب من هذا رشدا قال محمد الكوفي المفسر : إنها بألفاظها مما أمر أن يقولها كل من لم يستثن ، وإنها كفارة لنسيان الاستثناء . وقال الجمهور : هو دعاء مأمور به دون هذا التخصيص . وقيل : هو قوله إن شاء الله الذي كان نسيه عند يمينه . حكي عن ابن عباس أنه إن نسي الاستثناء ثم ذكر ولو بعد سنة لم يحنث إن كان حالفا . وهو قول مجاهد . وحكى إسماعيل بن إسحاق ذلك عن أبي العالية في قوله - تعالى - : واذكر ربك إذا نسيت قال : يستثني إذا ذكره . الحسن : ما دام في مجلس الذكر . ابن عباس : سنتين ; ذكره الغزنوي قال : فيحمل على تدارك التبرك بالاستثناء للتخلص عن الإثم . فأما الاستثناء المفيد حكما فلا يصح إلا متصلا . السدي : أي كل صلاة نسيها إذا ذكرها . وقيل : استثن باسمه لئلا تنسى . وقيل : اذكره متى ما نسيته . وقيل : إذا نسيت شيئا فاذكره يذكركه . وقيل : اذكره إذا نسيت غيره أو نسيت نفسك ; فذلك حقيقة الذكر . وهذه الآية مخاطبة للنبي - صلى الله عليه وسلم - ، وهي استفتاح كلام على الأصح ، وليست من الاستثناء في اليمين بشيء ، وهي بعد تعم جميع أمته ; لأنه حكم يتردد في الناس لكثرة وقوعه . والله الموفق .\n                                    ",
        "saadi": "إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا ٤٢\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 23 و 24 :ـ\nهذا النهي كغيره، وإن كان لسبب خاص وموجها للرسول صل الله عليه وسلم، فإن الخطاب عام للمكلفين، فنهى الله أن يقول العبد في الأمور المستقبلة، { إني فاعل ذلك } من دون أن يقرنه بمشيئة الله، وذلك لما فيه من المحذور، وهو: الكلام على الغيب المستقبل، الذي لا يدري، هل يفعله أم لا؟ وهل تكون أم لا؟ وفيه رد الفعل إلى مشيئة العبد استقلالا، وذلك محذور محظور، لأن المشيئة كلها لله { وما تشاءون إلا أن يشاء الله رب العالمين } ولما في ذكر مشيئة الله، من تيسير الأمر وتسهيله، وحصول البركة فيه، والاستعانة من العبد لربه، ولما كان العبد بشرا، لا بد أن يسهو فيترك ذكر المشيئة، أمره الله أن يستثني بعد ذلك، إذا ذكر، ليحصل المطلوب، وينفع المحذور، ويؤخذ من عموم قوله: { وَاذْكُرْ رَبَّكَ إِذَا نَسِيتَ } الأمر بذكر الله عند النسيان، فإنه يزيله، ويذكر العبد ما سها عنه، وكذلك يؤمر الساهي الناسي لذكر الله، أن يذكر ربه، ولا يكونن من الغافلين، ولما كان العبد مفتقرا إلى الله في توفيقه للإصابة، وعدم الخطأ في أقواله وأفعاله، أمره الله أن يقول: { عَسَى أَنْ يَهْدِيَنِ رَبِّي لِأَقْرَبَ مِنْ هَذَا رَشَدًا } فأمره أن يدعو الله ويرجوه، ويثق به أن يهديه لأقرب الطرق الموصلة إلى الرشد. وحري بعبد، تكون هذه حاله، ثم يبذل جهده، ويستفرغ وسعه في طلب الهدى والرشد، أن يوفق لذلك، وأن تأتيه المعونة من ربه، وأن يسدده في جميع أموره.\n                                    "
      },
      "originalText": "إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا ٤٢"
    },
    {
      "number": 2165,
      "text": "وَلَبِثُوا فِي كَهْفِهِمْ ثَلَاثَ مِائَةٍ سِنِينَ وَازْدَادُوا تِسْعًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 25,
      "juz": 15,
      "manzil": 4,
      "page": 296,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا ٥٢\n                                    \n                                    \n                                    هذا خبر من الله تعالى لرسوله صلى الله عليه وسلم بمقدار ما لبث أصحاب الكهف في كهفهم ، منذ أرقدهم الله إلى أن بعثهم وأعثر عليهم أهل ذلك الزمان ، وأنه كان مقداره ثلاثمائة [ سنة ] وتسع سنين بالهلالية ، وهي ثلاثمائة سنة بالشمسية ، فإن تفاوت ما بين كل مائة [ سنة ] بالقمرية إلى الشمسية ثلاث سنين ؛ فلهذا قال بعد الثلاثمائة : ( وازدادوا تسعا )\n                                    ",
        "qortoby": "وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا ٥٢\n                                    \n                                    \n                                    قوله تعالى : ولبثوا في كهفهم ثلاث مائة سنين وازدادوا تسعا هذا خبر من الله - تعالى - عن مدة لبثهم . وفي قراءة ابن مسعود وقالوا لبثوا . قال الطبري : إن بني إسرائيل اختلفوا فيما مضى لهم من المدة بعد الإعثار عليهم إلى مدة النبي - صلى الله عليه وسلم - ، فقال بعضهم : إنهم لبثوا ثلاثمائة سنة وتسع سنين ، فأخبر الله - تعالى - نبيه أن هذه المدة في كونهم نياما ، وأن ما بعد ذلك مجهول للبشر . فأمر الله - تعالى - أن يرد علم ذلك إليه . قال ابن عطية : فقوله على هذا لبثوا الأول يريد في نوم الكهف ، ولبثوا الثاني يريد بعد الإعثار إلى مدة محمد - صلى الله عليه وسلم - ، أو إلى وقت عدمهم بالبلاء . مجاهد : إلى وقت نزول القرآن . الضحاك : إلى أن ماتوا . وقال بعضهم : إنه لما قال وازدادوا تسعا لم يدر الناس أهي ساعات أم أيام أم جمع أم شهور أم أعوام . واختلف بنو إسرائيل بحسب ذلك ، فأمر الله - تعالى - برد العلم إليه في التسع ، فهي على هذا مبهمة . وظاهر كلام العرب المفهوم منه أنها أعوام ، والظاهر من أمرهم أنهم قاموا ودخلوا الكهف بعد عيسى بيسير وقد بقيت من الحواريين بقية . وقيل غير هذا على ما يأتي . قال القشيري : لا يفهم من التسع تسع ليال وتسع ساعات لسبق ذكر السنين ; كما تقول : عندي مائة درهم وخمسة ; والمفهوم منه خمسة دراهم . وقال أبو علي وازدادوا تسعا أي ازدادوا لبث تسع ; فحذف . وقال الضحاك : لما نزلت ولبثوا في كهفهم ثلاثمائة قالوا سنين أم شهور أم جمع أم أيام ; فأنزل الله - عز وجل - سنين . وحكى النقاش ما معناه أنهم لبثوا ثلاثمائة سنة شمسية بحساب الأيام ; فلما كان الإخبار هنا للنبي العربي ذكرت التسع ; إذ المفهوم عنده من السنين القمرية ، وهذه الزيادة هي ما بين الحسابين . ونحوه ذكر الغزنوي . أي باختلاف سني الشمس والقمر ; لأنه يتفاوت في كل ثلاث وثلاثين وثلث سنة سنة فيكون في ثلاثمائة تسع سنين . وقرأ الجمهور ثلاثمائة سنين بتنوين مائة ونصب سنين ، على التقديم والتأخير ; أي سنين ثلاثمائة فقدم الصفة على الموصوف ، فتكون سنين على هذا بدلا أو عطف بيان . وقيل : على التفسير والتمييز . وسنين في موضع سنة . وقرأ حمزة والكسائي بإضافة مائة إلى سنين ، وترك التنوين ; كأنهم جعلوا سنين بمنزلة سنة إذ المعني بهما واحد . قال أبو علي : هذه الأعداد التي تضاف في المشهور إلى الآحاد نحو ثلاثمائة رجل وثوب قد تضاف إلى الجموع . وفي مصحف عبد الله \" ثلاثمائة سنة \" . وقرأ الضحاك \" ثلثمائة سنون \" بالواو . وقرأ أبو عمرو بخلاف \" تسعا \" بفتح التاء وقرأ الجمهور بكسرها . وقال الفراء والكسائي وأبو عبيدة : التقدير ولبثوا في كهفهم سنين ثلاثمائة .\n                                    ",
        "saadi": "وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا ٥٢\n                                        \n                                        \n                                        \n                                        لما نهاه الله عن استفتاء أهل الكتاب، في شأن أهل الكهف، لعدم علمهم بذلك، وكان الله عالم الغيب والشهادة، العالم بكل شيء، أخبره بمدة لبثهم، وأن علم ذلك عنده وحده، فإنه من غيب السماوات والأرض، وغيبها مختص به، فما أخبر به عنها على ألسنة رسله، فهو الحق اليقين، الذي لا يشك فيه، وما لا يطلع رسله عليه، فإن أحدا من الخلق، لا يعلمه.\n                                    "
      },
      "originalText": "وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا ٥٢"
    },
    {
      "number": 2166,
      "text": "قُلِ اللَّهُ أَعْلَمُ بِمَا لَبِثُوا ۖ لَهُ غَيْبُ السَّمَاوَاتِ وَالْأَرْضِ ۖ أَبْصِرْ بِهِ وَأَسْمِعْ ۚ مَا لَهُمْ مِنْ دُونِهِ مِنْ وَلِيٍّ وَلَا يُشْرِكُ فِي حُكْمِهِ أَحَدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 26,
      "juz": 15,
      "manzil": 4,
      "page": 296,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُواْۖ لَهُۥ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا يُشۡرِكُ فِي حُكۡمِهِۦٓ أَحَدٗا ٦٢\n                                    \n                                    \n                                    وقوله : ( قل الله أعلم بما لبثوا ) أي : إذا سئلت عن لبثهم وليس عندك [ علم ] في ذلك وتوقيف من الله عز وجل فلا تتقدم فيه بشيء ، بل قل في مثل هذا : ( الله أعلم بما لبثوا له غيب السماوات والأرض ) أي : لا يعلم ذلك إلا هو أو من أطلعه الله عليه من خلقه ، وهذا الذي قلناه ، عليه غير واحد من علماء التفسير كمجاهد ، وغير واحد من السلف والخلف .\nوقال قتادة في قوله : ( ولبثوا في كهفهم ثلاث مائة سنين وازدادوا تسعا ) هذا قول أهل الكتاب ، وقد رده الله تعالى بقوله : ( قل الله أعلم بما لبثوا ) قال : وفي قراءة عبد الله : \" وقالوا : ولبثوا \" ، يعني أنه قاله الناس\nوهكذا قال - كما قال قتادة - مطرف بن عبد الله .\nوفي هذا الذي زعمه قتادة نظر ، فإن الذي بأيدي أهل الكتاب أنهم لبثوا ثلاثمائة سنة من غير تسع ، يعنون بالشمسية ، ولو كان الله قد حكى قولهم لما قال : ( وازدادوا تسعا ) وظاهر من الآية إنما هو إخبار من الله ، لا حكاية عنهم . وهذا اختيار ابن جرير ، رحمه الله . ورواية قتادة قراءة ابن مسعود منقطعة ، ثم هي شاذة بالنسبة إلى قراءة الجمهور فلا يحتج بها ، والله أعلم .\nوقوله : ( أبصر به وأسمع ) أي : إنه لبصير بهم سميع لهم .\nقال ابن جرير : وذلك في معنى المبالغة في المدح ، كأنه قيل : ما أبصره وأسمعه ، وتأويل الكلام : ما أبصر الله لكل موجود ، وأسمعه لكل مسموع ، لا يخفى عليه من ذلك شيء .\nثم روي عن قتادة في قوله : ( أبصر به وأسمع ) فلا أحد أبصر من الله ولا أسمع .\nوقال ابن زيد : ( أبصر به وأسمع ) يرى أعمالهم ، ويسمع ذلك منهم ، سميعا بصيرا .\nوقوله : ( ما لهم من دونه من ولي ولا يشرك في حكمه أحدا ) أي : أنه تعالى هو الذي له الخلق والأمر ، الذي لا معقب لحكمه ، وليس له وزير ولا نصير ولا شريك ولا مشير ، تعالى وتقدس .\n                                    ",
        "qortoby": "قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُواْۖ لَهُۥ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا يُشۡرِكُ فِي حُكۡمِهِۦٓ أَحَدٗا ٦٢\n                                    \n                                    \n                                    قوله تعالى : قل الله أعلم بما لبثوا له غيب السماوات والأرض أبصر به وأسمع ما لهم من دونه من ولي ولا يشرك في حكمه أحدا\nقوله تعالى : قل الله أعلم بما لبثوا قيل بعد موتهم إلى نزول القرآن فيهم ، على قول مجاهد . أو إلى أن ماتوا ; على قول الضحاك . أو إلى وقت تغيرهم بالبلى ; على ما تقدم . وقيل : بما لبثوا في الكهف ، وهي المدة التي ذكرها الله - تعالى - عن اليهود وإن ذكروا زيادة ونقصانا . أي لا يعلم علم ذلك إلا الله أو من علمه ذلك له غيب السماوات والأرض .\nقوله تعالى : أبصر به وأسمع أي ما أبصره وأسمعه . قال قتادة : لا أحد أبصر من الله ولا أسمع . وهذه عبارات عن الإدراك . ويحتمل أن يكون المعنى أبصر به أي بوحيه وإرشاده هداك وحججك والحق من الأمور ، وأسمع به العالم ; فيكونان أمرين لا على وجه التعجب . وقيل . المعنى أبصرهم وأسمعهم ما قال الله فيهم .\nما لهم من دونه من ولي أي لم يكن لأصحاب الكهف ولي يتولى حفظهم دون الله . ويحتمل أن يعود الضمير في لهم على معاصري محمد - صلى الله عليه وسلم - من الكفار . والمعنى : ما لهؤلاء المختلفين في مدة لبثهم ولي دون الله يتولى تدبير أمرهم ; فكيف يكونون أعلم منه ، أو كيف يتعلمون من غير إعلامه إياهم .\nقوله تعالى : ولا يشرك في حكمه أحدا قرئ بالياء ورفع الكاف ، على معنى الخبر عن الله - تعالى - . وقرأ ابن عامر والحسن وأبو رجاء وقتادة والجحدري \" ولا تشرك \" بالتاء من فوق وإسكان الكاف على جهة النبي - صلى الله عليه وسلم - ، ويكون قوله \" ولا يشرك \" عطفا على قوله : أبصر به وأسمع . وقرأ مجاهد \" يشرك \" بالياء من تحت والجزم . قال يعقوب : لا أعرف وجهه .\nمسألة : اختلف في أصحاب الكهف هل ماتوا وفنوا ، أو هم نيام وأجسادهم محفوظة ; فروي عن ابن عباس أنه مر بالشام في بعض غزواته مع ناس على موضع الكهف وجبله ، فمشى الناس معه إليه فوجدوا عظاما فقالوا : هذه عظام أهل الكهف . فقال لهم ابن عباس : أولئك قوم فنوا وعدموا منذ مدة طويلة ; فسمعه راهب فقال : ما كنت أحسب أن أحدا من العرب يعرف هذا ; فقيل له : هذا ابن عم نبينا - صلى الله عليه وسلم - . وروت فرقة أن النبي - صلى الله عليه وسلم - قال : ليحجن عيسى ابن مريم ومعه أصحاب الكهف فإنهم لم يحجوا بعد . ذكره ابن عطية .\nقلت : ومكتوب في التوراة والإنجيل أن عيسى ابن مريم عبد الله ورسوله ، وأنه يمر بالروحاء حاجا أو معتمرا أو يجمع الله له ذلك فيجعل الله حواريه أصحاب الكهف والرقيم ، فيمرون حجاجا فإنهم لم يحجوا ولم يموتوا . وقد ذكرنا هذا الخبر بكماله في كتاب \" التذكرة \" . فعلى هذا هم نيام ولم يموتوا إلى يوم القيامة ، بل يموتون قبيل الساعة .\n                                    ",
        "saadi": "قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُواْۖ لَهُۥ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا يُشۡرِكُ فِي حُكۡمِهِۦٓ أَحَدٗا ٦٢\n                                        \n                                        \n                                        \n                                        وقوله: { أَبْصِرْ بِهِ وَأَسْمِعْ } تعجب من كمال سمعه وبصره، وإحاطتهما بالمسموعات والمبصرات، بعد ما أخبر بإحاطة علمه بالمعلومات. ثم أخبر عن انفراده بالولاية العامة والخاصة، فهو الولي الذي يتولى تدبير جميع الكون، الولي لعباده المؤمنين، يخرجهم من الظلمات إلى النور وييسرهم لليسرى، ويجنبهم العسرى، ولهذا قال: { مَا لَهُمْ مِنْ دُونِهِ مِنْ وَلِيٍّ } أي: هو الذي تولى أصحاب الكهف، بلطفه وكرمه، ولم يكلهم إلى أحد من الخلق.\n{ وَلَا يُشْرِكُ فِي حُكْمِهِ أَحَدًا } وهذا يشمل الحكم الكوني القدري، والحكم الشرعي الديني، فإنه الحاكم في خلقه، قضاء وقدرا، وخلقا وتدبيرا، والحاكم فيهم، بأمره ونهيه، وثوابه وعقابه.\nولما أخبر أنه تعالى، له غيب السماوات والأرض، فليس لمخلوق إليها طريق، إلا عن الطريق التي يخبر بها عباده، وكان هذا القرآن، قد اشتمل على كثير من الغيوب\n                                    "
      },
      "originalText": "قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُواْۖ لَهُۥ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِيّٖ وَلَا يُشۡرِكُ فِي حُكۡمِهِۦٓ أَحَدٗا ٦٢"
    },
    {
      "number": 2167,
      "text": "وَاتْلُ مَا أُوحِيَ إِلَيْكَ مِنْ كِتَابِ رَبِّكَ ۖ لَا مُبَدِّلَ لِكَلِمَاتِهِ وَلَنْ تَجِدَ مِنْ دُونِهِ مُلْتَحَدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 27,
      "juz": 15,
      "manzil": 4,
      "page": 296,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا ٧٢\n                                    \n                                    \n                                    يقول تعالى آمرا رسوله [ عليه الصلاة والسلام ] بتلاوة كتابه العزيز وإبلاغه إلى الناس : ( لا مبدل لكلماته ) أي : لا مغير لها ولا محرف ولا مؤول .\nوقوله : ( ولن تجد من دونه ملتحدا ) [ عن مجاهد : ( ملتحدا ) قال : ملجأ . وعن قتادة : وليا ولا مولى ] قال ابن جرير : يقول إن أنت يا محمد لم تتل ما أوحي إليك من كتاب ربك ، فإنه لا ملجأ لك من الله \" . كما قال تعالى : ( ياأيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس ) [ المائدة : 67 ] ، وقال تعالى ( إن الذي فرض عليك القرآن لرادك إلى معاد ) [ القصص : 85 ] أي : سائلك عما فرض عليك من إبلاغ الرسالة .\n                                    ",
        "qortoby": "وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا ٧٢\n                                    \n                                    \n                                    قوله تعالى : واتل ما أوحي إليك من كتاب ربك لا مبدل لكلماته ولن تجد من دونه ملتحدا\nقوله تعالى : واتل ما أوحي إليك من كتاب ربك لا مبدل لكلماته قيل : هو من تمام قصة أصحاب الكهف ; أي اتبع القرآن فلا مبدل لكلمات الله ولا خلف فيما أخبر به من قصة أصحاب الكهف . وقال الطبري : لا مغير لما أوعد بكلماته أهل معاصيه والمخالفين لكتابه .\nولن تجد أنت .\nمن دونه إن لم تتبع القرآن وخالفته .\nملتحدا أي ملجأ وقيل موئلا وأصله الميل ومن لجأت إليه فقد ملت إليه . قال القشيري أبو نصر عبد الرحيم : وهذا آخر قصة أصحاب الكهف . ولما غزا معاوية غزوة المضيق نحو الروم وكان معه ابن عباس فانتهى إلى الكهف الذي فيه أصحاب الكهف ; فقال معاوية : لو كشف لنا عن هؤلاء فننظر إليهم ; فقال ابن عباس : قد منع الله من هو خير منك عن ذلك ، فقال : لو اطلعت عليهم لوليت منهم فرارا فقال : لا أنتهي حتى أعلم علمهم ، وبعث قوما لذلك ، فلما دخلوا الكهف بعث الله عليهم ريحا فأخرجتهم ; ذكره الثعلبي أيضا . وذكر أن النبي - صلى الله عليه وسلم - سأل الله أن يريه إياهم ، فقال إنك لن تراهم في دار الدنيا ولكن ابعث إليهم أربعة من خيار أصحابك ليبلغوهم رسالتك ويدعوهم إلى الإيمان ; فقال النبي - صلى الله عليه وسلم - لجبريل - عليه السلام - : كيف أبعثهم ؟ فقال : ابسط كساءك وأجلس على طرف من أطرافه أبا بكر وعلى الطرف الآخر عمر وعلى الثالث عثمان وعلى الرابع علي بن أبي طالب ، ثم ادع الريح الرخاء المسخرة لسليمان فإن الله - تعالى - يأمرها أن تطيعك ; ففعل فحملتهم الريح إلى باب الكهف ، فقلعوا منه حجرا ، فحمل الكلب عليهم فلما رآهم حرك رأسه وبصبص بذنبه وأومأ إليهم برأسه أن ادخلوا فدخلوا الكهف فقالوا : السلام عليكم ورحمة الله وبركاته ; فرد الله على الفتية أرواحهم فقاموا بأجمعهم وقالوا : عليكم السلام ورحمة الله وبركاته ; فقالوا لهم : معشر الفتية ، إن النبي محمد بن عبد الله - صلى الله عليه وسلم - يقرأ عليكم السلام ; فقالوا : وعلى محمد رسول الله السلام ما دامت السماوات والأرض ، وعليكم بما أبلغتم ، وقبلوا دينه وأسلموا ، ثم قالوا : أقرئوا محمدا رسول الله منا السلام ، وأخذوا مضاجعهم وصاروا إلى رقدتهم إلى آخر الزمان عند خروج المهدي . فيقال : إن المهدي يسلم عليهم فيحييهم الله ثم يرجعون إلى رقدتهم فلا يقومون حتى تقوم الساعة ، فأخبر جبريل رسول الله - صلى الله عليه وسلم - بما كان منهم ، ثم ردتهم الريح فقال النبي - صلى الله عليه وسلم - : كيف وجدتموهم ؟ . فأخبروه الخبر ؟ فقال النبي - صلى الله عليه وسلم - : اللهم لا تفرق بيني وبين أصحابي وأصهاري واغفر لمن أحبني وأحب أهل بيتي وخاصتي وأصحابي . وقيل : إن أصحاب الكهف دخلوا الكهف قبل المسيح ; فأخبر الله - تعالى - المسيح بخبرهم ثم بعثوا في الفترة بين عيسى ومحمد - صلى الله عليه وسلم - . وقيل : كانوا قبل موسى - عليه السلام - وأن موسى ذكرهم في التوراة ; ولهذا سألت اليهود رسول الله - صلى الله عليه وسلم - . وقيل : دخلوا الكهف بعد المسيح ; فالله أعلم أي ذلك كان .\n                                    ",
        "saadi": "وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا ٧٢\n                                        \n                                        \n                                        \n                                        التلاوة: هي الاتباع، أي: اتبع ما أوحى الله إليك بمعرفة معانيه وفهمها، وتصديق أخباره، وامتثال أوامره ونواهيه، فإنه الكتاب الجليل، الذي لا مبدل لكلماته، أي: لا تغير ولا تبدل لصدقها وعدلها، وبلوغها من الحسن فوق كل غاية { وتمت كلمة ربك صدقا وعدلا } فلتمامها، استحال عليها التغيير والتبديل، فلو كانت ناقصة، لعرض لها ذلك أو شيء منه، وفي هذا تعظيم للقرآن، في ضمنه الترغيب على الإقبال عليه.\n{ وَلَنْ تَجِدَ مِنْ دُونِهِ مُلْتَحَدًا } أي: لن تجد من دون ربك، ملجأ تلجأ إليه، ولا معاذا تعوذ به، فإذا تعين أنه وحده الملجأ في كل الأمور، تعين أن يكون هو المألوه المرغوب إليه، في السراء والضراء، المفتقر إليه في جميع الأحوال، المسئول في جميع المطالب.\n                                    "
      },
      "originalText": "وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا ٧٢"
    }
  ]
}