{
  "number": 297,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 2168,
      "text": "وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ ۖ وَلَا تَعْدُ عَيْنَاكَ عَنْهُمْ تُرِيدُ زِينَةَ الْحَيَاةِ الدُّنْيَا ۖ وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُ عَنْ ذِكْرِنَا وَاتَّبَعَ هَوَاهُ وَكَانَ أَمْرُهُ فُرُطًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 28,
      "juz": 15,
      "manzil": 4,
      "page": 297,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَيۡنَاكَ عَنۡهُمۡ تُرِيدُ زِينَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطٗا ٨٢\n                                    \n                                    \n                                    وقوله : ( واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه ) أي : اجلس مع الذين يذكرون الله ويهللونه ، ويحمدونه ويسبحونه ويكبرونه ، ويسألونه بكرة وعشيا من عباد الله ، سواء كانوا فقراء أو أغنياء أو أقوياء أو ضعفاء . يقال : إنها نزلت في أشراف قريش ، حين طلبوا من النبي صلى الله عليه وسلم أن يجلس معهم وحده ولا يجالسهم بضعفاء أصحابه كبلال وعمار وصهيب [ وخباب ] وابن مسعود ، وليفرد أولئك بمجلس على حدة . فنهاه الله عن ذلك ، فقال : ( ولا تطرد الذين يدعون ربهم بالغداة والعشي ) الآية [ الأنعام : 52 ] الآية ، وأمره أن يصبر نفسه في الجلوس مع هؤلاء ، فقال : ( واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه )\nوقال مسلم في صحيحه : حدثنا أبو بكر بن أبي شيبة ، حدثنا محمد بن عبد الله الأسدي ، عن إسرائيل ، عن المقدام بن شريح ، عن أبيه ، عن سعد - هو ابن أبي وقاص - قال : كنا مع النبي صلى الله عليه وسلم ستة نفر ، فقال المشركون للنبي صلى الله عليه وسلم : اطرد هؤلاء لا يجترئون علينا! . قال : وكنت أنا وابن مسعود ، ورجل من هذيل ، وبلال ورجلان نسيت اسميهما فوقع في نفس رسول الله صلى الله عليه وسلم ما شاء الله أن يقع ، فحدث نفسه ، فأنزل الله عز وجل : ( ولا تطرد الذين يدعون ربهم بالغداة والعشي يريدون وجهه ) انفرد بإخراجه مسلم دون البخاري\nوقال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن أبي التياح قال : سمعت أبا الجعد يحدث عن أبي أمامة قال : خرج رسول الله صلى الله عليه وسلم على قاص يقص ، فأمسك ، فقال رسول الله صلى الله عليه وسلم : \" قص ، فلأن أقعد غدوة إلى أن تشرق الشمس ، أحب إلي من أن أعتق أربع رقاب \"\nوقال الإمام أحمد أيضا : حدثنا هاشم حدثنا شعبة ، عن عبد الملك بن ميسرة قال : سمعت كردوس بن قيس - وكان قاص العامة بالكوفة - يقول : أخبرني رجل من أصحاب بدر : أنه سمع النبي صلى الله عليه وسلم يقول : \" لأن أقعد في مثل هذا المجلس أحب إلي من أن أعتق أربع رقاب \" . قال شعبة : فقلت : أي مجلس ؟ قال : كان قاصا\nوقال أبو داود الطيالسي في مسنده : حدثنا محمد ، حدثنا يزيد بن أبان ، عن أنس قال : قال رسول الله صلى الله عليه وسلم : \" لأن أجالس قوما يذكرون الله من صلاة الغداة إلى طلوع الشمس ، أحب إلي مما طلعت عليه الشمس ، ولأن أذكر الله من صلاة العصر إلى غروب الشمس أحب إلي من أن أعتق ثمانية من ولد إسماعيل دية كل واحد منهم اثنا عشر ألفا \" . فحسبنا دياتهم ونحن في مجلس أنس ، فبلغت ستة وتسعين ألفا ، وهاهنا من يقول : \" أربعة من ولد إسماعيل \" والله ما قال إلا ثمانية ، دية كل واحد منهم اثنا عشر ألفا\nوقال الحافظ أبو بكر البزار : حدثنا أحمد بن إسحاق الأهوازي ، حدثنا أبو أحمد الزبيري ، حدثنا عمرو بن ثابت ، عن علي بن الأقمر ، عن الأغر أبي مسلم - وهو الكوفي - أن رسول الله صلى الله عليه وسلم مر برجل يقرأ سورة الكهف ، فلما رأى النبي صلى الله عليه وسلم سكت ، فقال رسول الله صلى الله عليه وسلم \" هذا المجلس الذي أمرت أن أصبر نفسي معهم \" .\nهكذا رواه أبو أحمد ، عن عمرو بن ثابت ، عن علي بن الأقمر ، عن الأغر مرسلا . وحدثناه يحيى بن المعلى ، عن منصور ، حدثنا محمد بن الصلت ، حدثنا عمرو بن ثابت ، عن علي بن الأقمر ، عن الأغر أبي مسلم عن أبي هريرة وأبي سعيد قالا : جاء رسول الله صلى الله عليه وسلم ، ورجل يقرأ سورة الحجر أو سورة الكهف ، فسكت ، فقال رسول الله صلى الله عليه وسلم : \" هذا المجلس الذي أمرت أن أصبر نفسي معهم \" .\nوقال الإمام أحمد : حدثنا محمد بن بكر حدثنا ميمون المرئي ، حدثنا ميمون بن سياه ، عن أنس بن مالك - رضي الله عنه - عن رسول الله صلى الله عليه وسلم قال : \" ما من قوم اجتمعوا يذكرون الله ، لا يريدون بذلك إلا وجهه ، إلا ناداهم مناد من السماء : أن قوموا مغفورا لكم ، قد بدلت سيئاتكم حسنات \" تفرد به أحمد ، رحمه الله .\nوقال الطبراني : حدثنا إسماعيل بن الحسن ، حدثنا أحمد بن صالح ، حدثنا ابن وهب ، عن أسامة بن زيد عن أبي حازم ، عن عبد الرحمن بن سهل بن حنيف قال : نزلت على رسول الله صلى الله عليه وسلم ، وهو في بعض أبياته : ( واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه ) فخرج يلتمسهم ، فوجد قوما يذكرون الله تعالى ، منهم ثائر الرأس ، وجافي الجلد وذو الثوب الواحد ، فلما رآهم جلس معهم وقال : \" الحمد لله الذي جعل في أمتي من أمرني الله أن أصبر نفسي معهم \"\nعبد الرحمن هذا ، ذكره أبو بكر بن أبي داود في الصحابة وأما أبوه فمن سادات الصحابة ، رضي الله عنهم .\nوقوله : ( ولا تعد عيناك عنهم تريد زينة الحياة الدنيا ) قال ابن عباس : ولا تجاوزهم إلى غيرهم : يعني : تطلب بدلهم أصحاب الشرف والثروة .\n( ولا تطع من أغفلنا قلبه عن ذكرنا ) أي : شغل عن الدين وعبادة ربه بالدنيا ( واتبع هواه وكان أمره فرطا ) أي : أعماله وأفعاله سفه وتفريط وضياع ، ولا تكن مطيعا له ولا محبا لطريقته ، ولا تغبطه بما هو فيه ، كما قال تعالى : ( ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه ورزق ربك خير وأبقى ) [ طه : 131 ]\n                                    ",
        "qortoby": "وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَيۡنَاكَ عَنۡهُمۡ تُرِيدُ زِينَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطٗا ٨٢\n                                    \n                                    \n                                    قوله تعالى : واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه ولا تعد عيناك عنهم تريد زينة الحياة الدنيا ولا تطع من أغفلنا قلبه عن ذكرنا واتبع هواه وكان أمره فرطا\nقوله تعالى : واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي هذا مثل قوله : ولا تطرد الذين يدعون ربهم بالغداة والعشي في سورة \" الأنعام \" وقد مضى الكلام فيه . وقال سلمان الفارسي - رضي الله عنه - : جاءت المؤلفة قلوبهم إلى رسول الله - صلى الله عليه وسلم - : عيينة بن حصن والأقرع بن حابس فقالوا : يا رسول الله ; إنك لو جلست في صدر المجلس ونحيت عنا هؤلاء وأرواح جبابهم - يعنون سلمان وأبا ذر وفقراء المسلمين ، وكانت عليهم جباب الصوف لم يكن عليهم غيرها - جلسنا إليك وحادثناك وأخذنا عنك ، فأنزل الله - تعالى - : واتل ما أوحي إليك من كتاب ربك لا مبدل لكلماته ولن تجد من دونه ملتحدا واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه - حتى بلغ - إنا أعتدنا للظالمين نارا أحاط بهم سرادقها . يتهددهم بالنار . فقام النبي - صلى الله عليه وسلم - يلتمسهم حتى إذا أصابهم في مؤخر المسجد يذكرون الله قال : الحمد لله الذي لم يمتني حتى أمرني أن أصبر نفسي مع رجال من أمتي ، معكم المحيا ومعكم الممات . وقرأ نصر بن عاصم ومالك بن دينار وأبو عبد الرحمن \" ولا تطرد الذين يدعون ربهم بالغدوة والعشي \" وحجتهم أنها في السواد بالواو . وقال أبو جعفر النحاس : وهذا لا يلزم لكتبهم الحياة والصلاة بالواو ، ولا تكاد العرب تقول الغدوة لأنها معروفة .\nوروي عن الحسن \" ولا تعد عيناك عنهم \" أي لا تتجاوز عيناك إلى غيرهم من أبناء الدنيا طلبا لزينتها ; حكاه اليزيدي . وقيل : لا تحتقرهم عيناك ; كما يقال فلان تنبو عنه العين ; أي مستحقرا .\nتريد زينة الحياة الدنيا أي تتزين بمجالسة هؤلاء الرؤساء الذين اقترحوا إبعاد الفقراء من مجلسك ; ولم يرد النبي - صلى الله عليه وسلم - أن يفعل ذلك ، ولكن الله نهاه عن أن يفعله ، وليس هذا بأكثر من قوله لئن أشركت ليحبطن عملك . وإن كان الله أعاذه من الشرك .\nوتريد فعل مضارع في موضع الحال ; أي لا تعد عيناك مريدا ; كقول امرئ القيس :\nفقلت له لا تبك عينك إنما نحاول ملكا أو نموت فنعذرا\nوزعم بعضهم أن حق الكلام : لا تعد عيناك عنهم ; لأن \" تعد \" متعد بنفسه . قيل له : والذي وردت به التلاوة من رفع العينين يئول إلى معنى النصب فيها ، إذا كان لا تعد عيناك عنهم بمنزلة لا تنصرف عيناك عنهم ، ومعنى لا تنصرف عيناك عنهم لا تصرف عينيك عنهم ; فالفعل مسند إلى العينين وهو في الحقيقة موجه إلى النبي - صلى الله عليه وسلم - ; كما قال - تعالى - : فلا تعجبك أموالهم فأسند الإعجاب إلى الأموال ، والمعنى : لا تعجبك يا محمد أموالهم . ويزيدك وضوحا قول الزجاج : إن المعنى لا تصرف بصرك عنهم إلى غيرهم من ذوي الهيئات والزينة .\nقوله تعالى : ولا تطع من أغفلنا قلبه عن ذكرنا روى جويبر عن الضحاك عن ابن عباس في قوله - تعالى - : ولا تطع من أغفلنا قلبه عن ذكرنا قال : نزلت في أمية بن خلف الجمحي ، وذلك أنه دعا النبي - صلى الله عليه وسلم - إلى أمر كرهه من تجرد الفقراء عنه وتقريب صناديد أهل مكة ; فأنزل الله - تعالى - : ولا تطع من أغفلنا قلبه عن ذكرنا يعني من ختمنا على قلبه عن التوحيد . واتبع هواه يعني الشرك .\nوكان أمره فرطا قيل هو من التفريط الذي هو التقصير وتقديم العجز بترك الإيمان . وقيل : من الإفراط ومجاوزة الحد ، وكأن القوم قالوا : نحن أشراف مضر إن أسلمنا أسلم الناس ; وكان هذا من التكبر والإفراط في القول . وقيل : فرطا أي قدما في الشر ; من قولهم : فرط منه أمر أي سبق . وقيل : معنى أغفلنا قلبه وجدناه غافلا ; كما تقول : لقيت فلانا فأحمدته ; أي وجدته محمودا . وقال عمرو بن معديكرب لبني الحارث بن كعب : والله لقد سألناكم فما أبخلناكم ، وقاتلناكم فما أجبناكم ، وهاجيناكم فما أفحمناكم ; أي ما وجدناكم بخلاء ولا جبناء ولا مفحمين .\nوقيل : نزلت ولا تطع من أغفلنا قلبه عن ذكرنا في عيينة بن حصن الفزاري ; ذكره عبد الرزاق ، وحكاه النحاس عن سفيان الثوري . والله أعلم .\n                                    ",
        "saadi": "وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَيۡنَاكَ عَنۡهُمۡ تُرِيدُ زِينَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطٗا ٨٢\n                                        \n                                        \n                                        \n                                        يأمر تعالى نبيه محمدا صلى الله عليه وسلم، وغيره أسوته، في الأوامر والنواهي -أن يصبر نفسه مع المؤمنين العباد المنيبين { الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ } أي: أول النهار وآخره يريدون بذلك وجه الله، فوصفهم بالعبادة والإخلاص فيها، ففيها الأمر بصحبة الأخيار، ومجاهدة النفس على صحبتهم، ومخالطتهم وإن كانوا فقراء فإن في صحبتهم من الفوائد، ما لا يحصى.\n{ وَلَا تَعْدُ عَيْنَاكَ عَنْهُمْ } أي: لا تجاوزهم بصرك، وترفع عنهم نظرك.\n{ تُرِيدُ زِينَةَ الْحَيَاةِ الدُّنْيَا } فإن هذا ضار غير نافع، وقاطع عن المصالح الدينية، فإن ذلك يوجب تعلق القلب بالدنيا، فتصير الأفكار والهواجس فيها، وتزول من القلب الرغبة في الآخرة، فإن زينة الدنيا تروق للناظر، وتسحر العقل، فيغفل القلب عن ذكر الله، ويقبل على اللذات والشهوات، فيضيع وقته، وينفرط أمره، فيخسر الخسارة الأبدية، والندامة السرمدية، ولهذا قال: { وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُ عَنْ ذِكْرِنَا } غفل عن الله، فعاقبه بأن أغفله عن ذكره.\n{ وَاتَّبَعَ هَوَاهُ } أي: صار تبعا لهواه، حيث ما اشتهت نفسه فعله، وسعى في إدراكه، ولو كان فيه هلاكه وخسرانه، فهو قد اتخذ إلهه هواه، كما قال تعالى: { أفرأيت من اتخذ إلهه هواه وأضله الله على علم } الآية. { وَكَانَ أَمْرُهُ } أي: مصالح دينه ودنياه { فُرُطًا } أي: ضائعة معطلة. فهذا قد نهى الله عن طاعته، لأن طاعته تدعو إلى الاقتداء به، ولأنه لا يدعو إلا لما هو متصف به، ودلت الآية، على أن الذي ينبغي أن يطاع، ويكون إماما للناس، من امتلأ قلبه بمحبة الله، وفاض ذلك على لسانه، فلهج بذكر الله، واتبع مراضي ربه، فقدمها على هواه، فحفظ بذلك ما حفظ من وقته، وصلحت أحواله، واستقامت أفعاله، ودعا الناس إلى ما من الله به عليه، فحقيق بذلك، أن يتبع ويجعل إماما، والصبر المذكور في هذه الآية، هو الصبر على طاعة الله، الذي هو أعلى أنواع الصبر، وبتمامه تتم باقي الأقسام. وفي الآية، استحباب الذكر والدعاء والعبادة طرفي النهار، لأن الله مدحهم بفعله، وكل فعل مدح الله فاعله، دل ذلك على أن الله يحبه، وإذا كان يحبه فإنه يأمر به، ويرغب فيه.\n                                    "
      },
      "originalText": "وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِينَ يَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِيِّ يُرِيدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَيۡنَاكَ عَنۡهُمۡ تُرِيدُ زِينَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطٗا ٨٢"
    },
    {
      "number": 2169,
      "text": "وَقُلِ الْحَقُّ مِنْ رَبِّكُمْ ۖ فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ ۚ إِنَّا أَعْتَدْنَا لِلظَّالِمِينَ نَارًا أَحَاطَ بِهِمْ سُرَادِقُهَا ۚ وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ ۚ بِئْسَ الشَّرَابُ وَسَاءَتْ مُرْتَفَقًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 29,
      "juz": 15,
      "manzil": 4,
      "page": 297,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَآءَ فَلۡيُؤۡمِن وَمَن شَآءَ فَلۡيَكۡفُرۡۚ إِنَّآ أَعۡتَدۡنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن يَسۡتَغِيثُواْ يُغَاثُواْ بِمَآءٖ كَٱلۡمُهۡلِ يَشۡوِي ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا ٩٢\n                                    \n                                    \n                                    قول تعالى لرسوله محمد صلى الله عليه وسلم : وقل يا محمد للناس : هذا الذي جئتكم به من ربكم هو الحق الذي لا مرية فيه ولا شك ( فمن شاء فليؤمن ومن شاء فليكفر ) هذا من باب التهديد والوعيد الشديد ؛ ولهذا قال : ( إنا أعتدنا ) أي : أرصدنا ) للظالمين ) وهم الكافرون بالله ورسوله وكتابه ( نارا أحاط بهم سرادقها ) أي : سورها .\nقال الإمام أحمد : حدثنا حسن بن موسى ، حدثنا ابن لهيعة ، حدثنا دراج ، عن أبي الهيثم عن أبي سعيد الخدري ، عن رسول الله صلى الله عليه وسلم أنه قال : \" لسرادق النار أربعة جدر ، كثافة كل جدار مسافة أربعين سنة \" .\nوأخرجه الترمذي في \" صفة النار \" وابن جرير في تفسيره ، من حديث دراج أبي السمح به\n[ وقال ابن جريج : قال ابن عباس : ( أحاط بهم سرادقها ) قال : حائط من نار ]\nوقال ابن جرير : حدثني الحسين بن نصر والعباس بن محمد قالا : حدثنا أبو عاصم ، عن عبد الله بن أمية ، حدثني محمد بن حيي بن يعلى ، عن صفوان بن يعلى ، عن يعلى بن أمية قال : قال رسول الله صلى الله عليه وسلم : \" البحر هو جهنم \" قال : فقيل له : [ كيف ذلك ؟ ] فتلا هذه الآية - أو : قرأ هذه الآية - : ( نارا أحاط بهم سرادقها ) ثم قال : \" والله لا أدخلها أبدا أو : ما دمت حيا - ولا تصيبني منها قطرة \" .\nوقوله : ( وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب وساءت مرتفقا ) قال ابن عباس : \" المهل \" : ماء غليظ مثل دردي الزيت .\nوقال مجاهد : هو كالدم والقيح . وقال عكرمة : هو الشيء الذي انتهى حره : وقال آخرون : هو كل شيء أذيب .\nوقال قتادة : أذاب ابن مسعود شيئا من الذهب في أخدود ، فلما انماع وأزبد قال : هذا أشبه شيء بالمهل .\nوقال الضحاك : ماء جهنم أسود ، وهي سوداء وأهلها سود .\nوهذه الأقوال ليس شيء منها ينفي الآخر ، فإن المهل يجمع هذه الأوصاف الرذيلة كلها ، فهو أسود منتن غليظ حار ؛ ولهذا قال : ( يشوي الوجوه ) أي : من حره ، إذا أراد الكافر أن يشربه وقربه من وجهه ، شواه حتى يسقط جلد وجهه فيه ، كما جاء في الحديث الذي رواه الإمام أحمد بإسناده المتقدم في سرادق النار عن أبي سعيد الخدري ، عن رسول الله صلى الله عليه وسلم أنه قال : \" ماء كالمهل \" . قال كعكر الزيت فإذا قربه إليه سقطت فروة وجهه فيه \" وهكذا رواه الترمذي في \" صفة النار \" من جامعه ، من حديث رشدين بن سعد عن عمرو بن الحارث ، عن دراج ، به ثم قال : لا نعرفه إلا من حديث \" رشدين \" ، وقد تكلم فيه من قبل حفظه ، هكذا قال ، وقد رواه الإمام أحمد كما تقدم عن حسن الأشيب ، عن ابن لهيعة ، عن دراج ، والله أعلم .\nوقال عبد الله بن المبارك ، وبقية بن الوليد ، عن صفوان بن عمرو ، عن عبد الله بن بسر ، عن أبي أمامة - رضي الله عنه - عن النبي صلى الله عليه وسلم في قوله : ( ويسقى من ماء صديد يتجرعه ) [ إبراهيم : 16 ، 17 ] قال : \" يقرب إليه فيتكرهه ، فإذا قرب منه شوى وجهه ووقعت فروة رأسه ، فإذا شربه قطع أمعاءه ، يقول الله تعالى : ( وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب ) .\nوقال سعيد بن جبير : إذا جاع أهل النار استغاثوا بشجرة الزقوم ، فأكلوا منها فاختلست جلود وجوههم ، فلو أن مارا مر بهم يعرفهم ، لعرف جلود وجوههم فيها . ثم يصب عليهم العطش فيستغيثون . فيغاثون بماء كالمهل ، وهو الذي قد انتهى حره ، فإذا أدنوه من أفواههم اشتوى من حره لحوم وجوههم التي قد سقطت عنها الجلود .\nولهذا قال تعالى بعد وصفه هذا الشراب بهذه الصفات [ الذميمة ] القبيحة : ( بئس الشراب ) أي : بئس هذا الشراب كما قال في الآية الأخرى : ( وسقوا ماء حميما فقطع أمعاءهم ) [ محمد : 15 ] وقال تعالى : ( تسقى من عين آنية ) [ الغاشية : 5 ] أي حارة ، كما قال : ( وبين حميم آن ) [ الرحمن : 44 ]\n( وساءت مرتفقا ) [ أي : وساءت النار ] منزلا ومقيلا ومجتمعا وموضعا للارتفاق كما قال في الآية الأخرى : ( إنها ساءت مستقرا ومقاما ) [ الفرقان : 66 ]\n                                    ",
        "qortoby": "وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَآءَ فَلۡيُؤۡمِن وَمَن شَآءَ فَلۡيَكۡفُرۡۚ إِنَّآ أَعۡتَدۡنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن يَسۡتَغِيثُواْ يُغَاثُواْ بِمَآءٖ كَٱلۡمُهۡلِ يَشۡوِي ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا ٩٢\n                                    \n                                    \n                                    قوله : وقل الحق من ربكم فمن شاء فليؤمن ومن شاء فليكفر إنا أعتدنا للظالمين نارا أحاط بهم سرادقها وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب وساءت مرتفقا\nقوله تعالى : وقل الحق من ربكم فمن شاء فليؤمن ومن شاء فليكفر الحق رفع على خبر الابتداء المضمر ; أي قل هو الحق . وقيل : هو رفع على الابتداء ، وخبره في قوله من ربكم . ومعنى الآية : قل يا محمد لهؤلاء الذين أغفلنا قلوبهم عن ذكرنا : أيها الناس من ربكم الحق فإليه التوفيق والخذلان ، وبيده الهدى والضلال ، يهدي من يشاء فيؤمن ، ويضل من يشاء فيكفر ; ليس إلي من ذلك شيء ، فالله يؤتي الحق من يشاء وإن كان ضعيفا ، ويحرمه من يشاء وإن كان قويا غنيا ، ولست بطارد المؤمنين لهواكم ; فإن شئتم فآمنوا ، وإن شئتم فاكفروا . وليس هذا بترخيص وتخيير بين الإيمان والكفر ، وإنما هو وعيد وتهديد . أي إن كفرتم فقد أعد لكم النار ، وإن آمنتم فلكم الجنة .\nإنا أعتدنا أي أعددنا .\nللظالمين أي للكافرين الجاحدين .\nنارا أحاط بهم سرادقها قال الجوهري : السرادق واحد السرادقات التي تمد فوق صحن الدار . وكل بيت من كرسف فهو سرادق . قال رؤبة :\nيا حكم بن المنذر بن الجارود سرادق المجد عليك ممدود\nيقال : بيت مسردق . وقال سلامة بن جندل يذكر أبرويز وقتله النعمان بن المنذر تحت أرجل الفيلة :\nهو المدخل النعمان بيتا سماؤه صدور الفيول بعد بيت مسردق\nوقال ابن الأعرابي : سرادقها سورها . وعن ابن عباس : حائط من نار . الكلبي : وقال ابن الأعرابي : سرادقها سورها . وعن ابن عباس : حائط من نار . الكلبي : عنق تخرج من النار فتحيط بالكفار كالحظيرة . القتبي : السرادق الحجزة التي تكون حول الفسطاط . وقاله ابن عزيز . وقيل : هو دخان يحيط بالكفار يوم القيامة ، وهو الذي ذكره الله - تعالى - في سورة ( والمرسلات ) . حيث يقول : انطلقوا إلى ظل ذي ثلاث شعب وقوله : وظل من يحموم قاله قتادة . وقيل : إنه البحر المحيط بالدنيا . وروى يعلى بن أمية قال : قال رسول الله - صلى الله عليه وسلم - : البحر هو جهنم - ثم تلا - نارا أحاط بهم سرادقها - ثم قال - والله لا أدخلها أبدا ما دمت حيا ولا يصيبني منها قطرة ذكره الماوردي . وخرج ابن المبارك من حديث أبي سعيد الخدري عن النبي - صلى الله عليه وسلم - قال : لسرادق النار أربع جدر كثف كل جدار مسيرة أربعين سنة . وخرجه أبو عيسى الترمذي ، وقال فيه : حديث حسن صحيح غريب .\nقلت : وهذا يدل على أن السرادق ما يعلو الكفار من دخان أو نار ، وجدره ما وصف .\nقوله تعالى : وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه قال ابن عباس : المهل ماء غليظ مثل دردي الزيت . مجاهد : القيح والدم . الضحاك : ماء أسود ، وإن جهنم لسوداء ، وماؤها أسود وشجرها أسود وأهلها سود . وقال أبو عبيدة : هو كل ما أذيب من جواهر الأرض من حديد ورصاص ونحاس وقزدير ، فتموج بالغليان ، فذلك المهل . ونحوه عن ابن مسعود قال سعيد بن جبير : هو الذي قد انتهى حره . وقال : المهل ضرب من القطران ; يقال : مهلت البعير فهو ممهول . وقيل : هو السم . والمعنى في هذه الأقوال متقارب . وفي الترمذي عن النبي - صلى الله عليه وسلم - في قوله كالمهل قال : كعكر الزيت فإذا قربه إلى وجهه سقطت فروة وجهه قال أبو عيسى : هذا حديث إنما نعرفه من حديث رشدين بن سعد ورشدين قد تكلم فيه من قبل حفظه . وخرج عن أبي أمامة عن النبي - صلى الله عليه وسلم - في قوله : ويسقى من ماء صديد يتجرعه قال : يقرب إلى فيه فكرهه فإذا أدني منه شوى وجهه ووقعت فروة رأسه وإذا شربه قطع أمعاءه حتى يخرج من دبره . يقول الله - تعالى - وسقوا ماء حميما فقطع أمعاءهم يقول وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب وساءت مرتفقا قال : حديث غريب .\nقلت : وهذا يدل على صحة تلك الأقوال ، وأنها مرادة ، والله أعلم . وكذلك نص عليها أهل اللغة . في الصحاح \" المهل \" النحاس المذاب . ابن الأعرابي : المهل المذاب من الرصاص . وقال أبو عمرو . المهل دردي الزيت . والمهل أيضا القيح والصديد . وفي حديث أبي بكر : ادفنوني في ثوبي هذين فإنهما للمهل والتراب .\nبئس الشراب وساءت مرتفقا قال مجاهد : معناه مجتمعا ، كأنه ذهب إلى معنى المرافقة . ابن عباس : منزلا . عطاء : مقرا . وقيل مهادا . وقال القتبي : مجلسا ، والمعنى متقارب ; وأصله من المتكأ ، يقال منه : ارتفقت أي اتكأت على المرفق . قال الشاعر :\nقالت له وارتفقت ألا فتى يسوق بالقوم غزالات الضحى\nويقال : ارتفق الرجل إذا نام على مرفقه لا يأتيه نوم . قال أبو ذؤيب الهذلي :\nنام الخلي وبت الليل مرتفقا كأن عيني فيها الصاب مدبوح\nالصاب : عصارة شجر مر .\n                                    ",
        "saadi": "وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَآءَ فَلۡيُؤۡمِن وَمَن شَآءَ فَلۡيَكۡفُرۡۚ إِنَّآ أَعۡتَدۡنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن يَسۡتَغِيثُواْ يُغَاثُواْ بِمَآءٖ كَٱلۡمُهۡلِ يَشۡوِي ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا ٩٢\n                                        \n                                        \n                                        \n                                        أي: قل للناس يا محمد: هو الحق من ربكم أي: قد تبين الهدى من الضلال، والرشد من الغي، وصفات أهل السعادة، وصفات أهل الشقاوة، وذلك بما بينه الله على لسان رسوله، فإذا بان واتضح، ولم يبق فيه شبهة.\n{ فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ } أي: لم يبق إلا سلوك أحد الطريقين، بحسب توفيق العبد، وعدم توفيقه، وقد أعطاه الله مشيئة بها يقدر على الإيمان والكفر، والخير والشر، فمن آمن فقد وفق للصواب، ومن كفر فقد قامت عليه الحجة، وليس بمكره على الإيمان، كما قال تعالى { لا إكراه في الدين قد تبين الرشد من الغي } وليس في قوله: { فمن شاء فليؤمن ومن شاء فليكفر } الإذن في كلا الأمرين، وإنما ذلك تهديد ووعيد لمن اختار الكفر بعد البيان التام، كما ليس فيها ترك قتال الكافرين. ثم ذكر تعالى مآل الفريقين فقال: { إِنَّا أَعْتَدْنَا لِلظَّالِمِينَ } بالكفر والفسوق والعصيان { نَارًا أَحَاطَ بِهِمْ سُرَادِقُهَا } أي: سورها المحيط بها، فليس لهم منفذ ولا طريق ولا مخلص منها، تصلاهم النار الحامية.\n{ وَإِنْ يَسْتَغِيثُوا } أي: يطلبوا الشراب، ليطفئ ما نزل بهم من العطش الشديد.\n{ يُغَاثُوا بِمَاءٍ كَالْمُهْلِ } أي: كالرصاص المذاب، أو كعكر الزيت، من شدة حرارته.\n{ يَشْوِي الْوُجُوهَ } أي: فكيف بالأمعاء والبطون، كما قال تعالى { يصهر به ما في بطونهم والجلود ولهم مقامع من حديد }\n{ بِئْسَ الشَّرَابُ } الذي يراد ليطفئ العطش، ويدفع بعض العذاب، فيكون زيادة في عذابهم، وشدة عقابهم.\n{ وَسَاءَتْ } النار { مُرْتَفَقًا } وهذا ذم لحالة النار، أنها ساءت المحل، الذي يرتفق به، فإنها ليست فيها ارتفاق، وإنما فيها العذاب العظيم الشاق، الذي لا يفتر عنهم ساعة، وهم فيه مبلسون قد أيسوا من كل خير، ونسيهم الرحيم في العذاب، كما نسوه.\n                                    "
      },
      "originalText": "وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَآءَ فَلۡيُؤۡمِن وَمَن شَآءَ فَلۡيَكۡفُرۡۚ إِنَّآ أَعۡتَدۡنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن يَسۡتَغِيثُواْ يُغَاثُواْ بِمَآءٖ كَٱلۡمُهۡلِ يَشۡوِي ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَآءَتۡ مُرۡتَفَقًا ٩٢"
    },
    {
      "number": 2170,
      "text": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ إِنَّا لَا نُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 30,
      "juz": 15,
      "manzil": 4,
      "page": 297,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا ٠٣\n                                    \n                                    \n                                    لما ذكر تعالى حال الأشقياء ، ثنى بذكر السعداء ، الذين آمنوا بالله وصدقوا المرسلين فيما جاءوا به ، وعملوا بما أمروهم به من الأعمال الصالحة ، فلهم ) جنات عدن ) والعدن : الإقامة .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا ٠٣\n                                    \n                                    \n                                    لما ذكر ما أعد للكافرين من الهوان ذكر أيضا ما للمؤمنين من الثواب . وفي الكلام إضمار ; أي لا نضيع أجر من أحسن منهم عملا ، فأما من أحسن عملا من غير المؤمنين فعمله محبط . وروى البراء بن عازب أن أعرابيا قام إلى رسول الله - صلى الله عليه وسلم - في حجة الوداع ، والنبي - صلى الله عليه وسلم - واقف بعرفات على ناقته العضباء فقال : إني رجل مسلم فأخبرني عن هذه الآية إن الذين آمنوا وعملوا الصالحات الآية ; فقال رسول الله - صلى الله عليه وسلم - : ما أنت منهم ببعيد ولا هم ببعيد منك هم هؤلاء الأربعة أبو بكر وعمر وعثمان وعلي فأعلم قومك أن هذه الآية نزلت فيهم ذكره الماوردي ، وأسنده النحاس في كتاب معاني القرآن ، قال : حدثنا أبو عبد الله أحمد بن علي بن سهل قال حدثنا محمد بن حميد قال حدثنا يحيى بن الضريس عن زهير بن معاوية عن أبي إسحاق عن البراء بن عازب قال : قام أعرابي . . . ; فذكره . وأسنده السهيلي في كتاب الأعلام . وقد روينا جميع ذلك بالإجازة ، والحمد لله . وعملا نصب على التمييز ، وإن شئت بإيقاع أحسن عليه . وقيل : إنا لا نضيع أجر من أحسن عملا كلام معترض ، والخبر قوله أولئك لهم جنات عدن .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا ٠٣\n                                        \n                                        \n                                        \n                                        ثم ذكر الفريق الثاني فقال: { إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ } أي: جمعوا بين الإيمان بالله وملائكته وكتبه ورسله واليوم الآخر والقدر خيره وشره، وعمل الصالحات من الواجبات والمستحبات { إِنَّا لَا نُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا } وإحسان العمل: أن يريد العبد العمل لوجه الله، متبعا في ذلك شرع الله. فهذا العمل لا يضيعه الله، ولا شيئا منه، بل يحفظه للعاملين، ويوفيهم من الأجر، بحسب عملهم وفضله وإحسانه\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا ٠٣"
    },
    {
      "number": 2171,
      "text": "أُولَٰئِكَ لَهُمْ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهِمُ الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَيَلْبَسُونَ ثِيَابًا خُضْرًا مِنْ سُنْدُسٍ وَإِسْتَبْرَقٍ مُتَّكِئِينَ فِيهَا عَلَى الْأَرَائِكِ ۚ نِعْمَ الثَّوَابُ وَحَسُنَتْ مُرْتَفَقًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 31,
      "juz": 15,
      "manzil": 4,
      "page": 297,
      "ruku": 255,
      "hizbQuarter": 118,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أُوْلَٰٓئِكَ لَهُمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَيَلۡبَسُونَ ثِيَابًا خُضۡرٗا مِّن سُندُسٖ وَإِسۡتَبۡرَقٖ مُّتَّكِ‍ِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقٗا ١٣\n                                    \n                                    \n                                    ( تجري من تحتهم الأنهار ) أي : من تحت غرفهم ومنازلهم ، قال [ لهم ] فرعون : ( وهذه الأنهار تجري من تحتي ) [ الزخرف : 51 ] .\n( يحلون ) أي : من الحلية ( فيها من أساور من ذهب ) وقال في المكان الآخر : ( ولؤلؤا ولباسهم فيها حرير ) [ الحج : 23 ] وفصله هاهنا فقال : ( ويلبسون ثيابا خضرا من سندس وإستبرق ) فالسندس : ثياب رفاع رفاق كالقمصان وما جرى مجراها ، وأما الإستبرق فغليظ الديباج وفيه بريق .\nوقوله : ( متكئين فيها على الأرائك ) الاتكاء قيل : الاضطجاع وقيل التربع في الجلوس . وهو أشبه بالمراد هاهنا ومنه الحديث [ في ] الصحيح : \" أما أنا فلا آكل متكئا \" فيه القولان .\nوالأرائك : جمع أريكة ، وهي السرير تحت الحجلة ، والحجلة كما يعرفه الناس في زماننا هذا بالباشخاناه ، والله أعلم .\nقال عبد الرزاق : أخبرنا معمر ، عن قتادة : ( على الأرائك ) قال : هي الحجال . قال معمر : وقال غيره : السرر في الحجال\nوقوله : ( نعم الثواب وحسنت مرتفقا ) [ أي : نعمت الجنة ثوابا على أعمالهم ( وحسنت مرتفقا ) أي : حسنت منزلا ومقيلا ومقاما ، كما قال في النار : ( بئس الشراب وساءت مرتفقا ) [ الكهف : 29 ] ، وهكذا قابل بينهما في سورة الفرقان في قوله : ( إنها ساءت مستقرا ومقاما ) [ الفرقان : 66 ] ثم ذكر صفات المؤمنين فقال : ( أولئك يجزون الغرفة بما صبروا ويلقون فيها تحية وسلاما خالدين فيها حسنت مستقرا ومقاما ) [ الفرقان : 76 ، 75 ] .\n                                    ",
        "qortoby": "أُوْلَٰٓئِكَ لَهُمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَيَلۡبَسُونَ ثِيَابًا خُضۡرٗا مِّن سُندُسٖ وَإِسۡتَبۡرَقٖ مُّتَّكِ‍ِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقٗا ١٣\n                                    \n                                    \n                                    أولئك لهم جنات عدن سرة الجنة ، أي وسطها وسائر الجنات محدقة بها وذكرت بلفظ الجمع لسعتها ; لأن كل بقعة منها تصلح أن تكون جنة وقيل : العدن الإقامة ، يقال : عدن بالمكان إذا أقام به وعدنت البلد توطنته وعدنت الإبل بمكان كذا لزمته فلم تبرح منه ; ومنه جنات عدن أي جنات إقامة ومنه سمي المعدن ( بكسر الدال ; لأن الناس يقيمون فيه بالصيف والشتاء ومركز كل شيء معدنه والعادن : الناقة المقيمة في المرعى . وعدن بلد ; قاله الجوهري .\nتجري من تحتهم الأنهار أي من تحت أشجارهم ومنازلهم ; ومنه قوله فرعون : وهذه الأنهار تجري من تحتي .\nيحلون فيها من أساور من ذهب وهو جمع سوار . قال سعيد بن جبير : على كل واحد منهم ثلاثة أسورة : واحد من ذهب ، وواحد من ورق ، وواحد من لؤلؤ .\nقلت : هذا منصوص في القرآن ، قال هنا من ذهب وقال في الحج وفاطر من ذهب ولؤلؤا وفي الإنسان من فضة . وقال أبو هريرة : سمعت خليلي - صلى الله عليه وسلم - يقول : تبلغ الحلية من المؤمن حيث يبلغ الوضوء خرجه مسلم . وحكى الفراء : \" يحلون \" بفتح الياء وسكون الحاء وفتح اللام خفيفة ; يقال : حليت المرأة تحلى فهي حالية إذا لبست الحلي . وحلي الشيء بعيني يحلى ; ذكره النحاس . والسوار سوار المرأة ، والجمع أسورة ، وجمع الجمع أساورة . وقرئ \" فلولا ألقي عليه أساورة من ذهب \" وقد يكون الجمع أساور . وقال الله - تعالى - يحلون فيها من أساور من ذهب قاله الجوهري . وقال ابن عزيز : أساور جمع أسورة ، وأسورة جمع سوار وسوار ، وهو الذي يلبس في الذراع من ذهب ، فإن كان من فضة فهو قلب وجمعه قلبة ; فإن كان من قرن أو عاج فهي مسكة وجمعه مسك . قال النحاس : وحكى قطرب في واحد الأساور إسوار ، وقطرب صاحب شذوذ ، قد تركه يعقوب وغيره فلم يذكره .\nقلت : قد جاء في الصحاح وقال أبو عمرو بن العلاء : واحدها إسوار . وقال المفسرون : لما كانت الملوك تلبس في الدنيا الأساور والتيجان جعل الله - تعالى - ذلك لأهل الجنة .\nقوله تعالى : ويلبسون ثيابا خضرا من سندس وإستبرق السندس : الرقيق النحيف ، واحده سندسة ; قال الكسائي . والإستبرق : ما ثخن منه - عن عكرمة - وهو الحرير . قال الشاعر :\nتراهن يلبسن المشاعر مرة وإستبرق الديباج طورا لباسها\nفالإستبرق الديباج . ابن بحر : المنسوج بالذهب . القتبي : فارسي معرب . الجوهري : وتصغيره أبيرق . وقيل : هو استفعل من البريق . والصحيح أنه وفاق بين اللغتين ; إذ ليس في القرآن ما ليس من لغة العرب ، على ما تقدم ، والله أعلم .\nوخص الأخضر بالذكر لأنه الموافق للبصر ; لأن البياض يبدد النظر ويؤلم ، والسواد يذم ، والخضرة بين البياض والسواد ، وذلك يجمع الشعاع . والله أعلم . روى النسائي عن عبد الله بن عمرو بن العاص قال : بينما نحن عند رسول الله - صلى الله عليه وسلم - إذ جاءه رجل فقال : يا رسول الله ، أخبرنا عن ثياب الجنة ، أخلق يخلق أم نسج ينسج ؟ فضحك بعض القوم . فقال لهم : مم تضحكون من جاهل يسأل عالما فجلس يسيرا أو قليلا فقال رسول الله - صلى الله عليه وسلم - : أين السائل عن ثياب الجنة ؟ فقال : ها هو ذا يا رسول الله ; قال لا بل تشقق عنها ثمر الجنة قالها ثلاثا . وقال أبو هريرة : دار المؤمن درة مجوفة في وسطها شجرة تنبت الحلل ويأخذ بأصبعه أو قال بأصبعيه سبعين حلة منظمة بالدر والمرجان . ذكره يحيى بن سلام في تفسيره وابن المبارك في رقائقه . وقد ذكرنا إسناده في كتاب التذكرة . وذكر في الحديث أنه يكون على كل واحد منهم الحلة لها وجهان لكل وجه لون ، يتكلمان به بصوت يستحسنه سامعه ، يقول أحد الوجهين للآخر : أنا أكرم على ولي الله منك ، أنا ألي جسده وأنت لا تلي . ويقول الآخر : أنا أكرم على ولي الله منك ، أنا أبصر وجهه وأنت لا تبصر .\nقوله تعالى : متكئين فيها على الأرائك الأرائك جمع أريكة ، وهي السرر في الحجال . وقيل الفرش في الحجال ; قاله الزجاج . ابن عباس : هي الأسرة من ذهب ، وهي مكللة بالدر والياقوت عليها الحجال ، الأريكة ما بين صنعاء إلى أيلة وما بين عدن إلى الجابية . وأصل متكئين موتكئين ، وكذلك اتكأ أصله اوتكأ ، وأصل التكأة وكأة ; ومنه التوكؤ للتحامل على الشيء ، فقلبت الواو تاء وأدغمت . ورجل وكأة كثير الاتكاء .\nنعم الثواب وحسنت مرتفقا يعني الجنات ، عكس وساءت مرتفقا . وقد تقدم . ولو كان \" نعمت \" لجاز لأنه اسم للجنة . وعلى هذا وحسنت مرتفقا .\n                                    ",
        "saadi": "أُوْلَٰٓئِكَ لَهُمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَيَلۡبَسُونَ ثِيَابًا خُضۡرٗا مِّن سُندُسٖ وَإِسۡتَبۡرَقٖ مُّتَّكِ‍ِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقٗا ١٣\n                                        \n                                        \n                                        \n                                        أي: أولئك الموصوفون بالإيمان والعمل الصالح، لهم الجنات العاليات التي قد كثرت أشجارها، فأجنت من فيها، وكثرت أنهارها، فصارت تجري من تحت تلك الأشجار الأنيقة، والمنازل الرفيعة، وحليتهم فيها الذهب، ولباسهم فيها الحرير الأخضر من السندس، وهو الغليظ من الديباج، والإستبرق، وهو ما رق منه. متكئين فيها على الأرائك، وهي السرر المزينة، المجملة بالثياب الفاخرة فإنها لا تسمى أريكة حتى تكون كذلك، وفي اتكائهم على الأرائك، ما يدل على كمال الراحة، وزوال النصب والتعب، وكون الخدم يسعون عليهم بما يشتهون، وتمام ذلك الخلود الدائم والإقامة الأبدية، فهذه الدار الجليلة { نِعْمَ الثَّوَابُ } للعاملين { وَحَسُنَتْ مُرْتَفَقًا } يرتفقون بها، ويتمتعون بما فيها، مما تشتهيه الأنفس وتلذ الأعين، من الحبرة والسرور، والفرح الدائم، واللذات المتواترة، والنعم المتوافرة، وأي مرتفق أحسن من دار، أدنى أهلها، يسير في ملكه ونعيمه وقصوره وبساتينه ألفي سنة، ولا يرى فوق ما هو فيه من النعيم، قد أعطى جميع أمانيه ومطالبه، وزيد من المطالب، ما قصرت عنه الأماني، ومع ذلك، فنعيمهم على الدوام متزايد في أوصافه وحسنه، فنسأل الله الكريم، أن لا يحرمنا خير ما عنده من الإحسان، بشر ما عندنا من التقصير والعصيان.\nودلت الآية الكريمة وما أشبهها، على أن الحلية، عامة للذكور والإناث، كما ورد في الأحاديث الصحيحة لأنه أطلقها في قوله { يُحَلَّوْنَ } وكذلك الحرير ونحوه.\n                                    "
      },
      "originalText": "أُوْلَٰٓئِكَ لَهُمۡ جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ يُحَلَّوۡنَ فِيهَا مِنۡ أَسَاوِرَ مِن ذَهَبٖ وَيَلۡبَسُونَ ثِيَابًا خُضۡرٗا مِّن سُندُسٖ وَإِسۡتَبۡرَقٖ مُّتَّكِ‍ِٔينَ فِيهَا عَلَى ٱلۡأَرَآئِكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقٗا ١٣"
    },
    {
      "number": 2172,
      "text": "۞ وَاضْرِبْ لَهُمْ مَثَلًا رَجُلَيْنِ جَعَلْنَا لِأَحَدِهِمَا جَنَّتَيْنِ مِنْ أَعْنَابٍ وَحَفَفْنَاهُمَا بِنَخْلٍ وَجَعَلْنَا بَيْنَهُمَا زَرْعًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 32,
      "juz": 15,
      "manzil": 4,
      "page": 297,
      "ruku": 256,
      "hizbQuarter": 119,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَيۡنِ مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا ٢٣\n                                    \n                                    \n                                    يقول الله تعالى بعد ذكر المشركين المستكبرين عن مجالسة الضعفاء والمساكين من المسلمين ، وافتخروا عليهم بأموالهم وأحسابهم ، فضرب لهم مثلا برجلين ، جعل الله ( لأحدهما جنتين ) أي : بستانين من أعناب ، محفوفتين بالنخل المحدقة في جنباتهما ، وفي خلالهما الزروع ، وكل من الأشجار والزروع مثمر مقبل في غاية الجود\n                                    ",
        "qortoby": "۞ وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَيۡنِ مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا ٢٣\n                                    \n                                    \n                                    قوله تعالى : واضرب لهم مثلا رجلين جعلنا لأحدهما جنتين من أعناب وحففناهما بنخل وجعلنا بينهما زرعا\nقوله تعالى : واضرب لهم مثلا رجلين هذا مثل لمن يتعزز بالدنيا ويستنكف عن مجالسة المؤمنين ، وهو متصل بقوله واصبر نفسك . واختلف في اسم هذين الرجلين وتعيينهما ; فقال الكلبي : نزلت في أخوين من أهل مكة مخزوميين ، أحدهما مؤمن وهو أبو سلمة عبد الله بن عبد الأسد بن هلال بن عبد الله بن عمر بن مخزوم ، زوج أم سلمة قبل النبي - صلى الله عليه وسلم - . والآخر كافر وهو الأسود بن عبد الأسد ، وهما الأخوان المذكوران في سورة \" الصافات \" في قوله قال قائل منهم إني كان لي قرين ، ورث كل واحد منهما أربعة آلاف دينار ، فأنفق أحدهما ماله في سبيل الله وطلب من أخيه شيئا فقال ما قال . . . ; ذكره الثعلبي والقشيري . وقيل : نزلت في النبي - صلى الله عليه وسلم - وأهل مكة . وقيل : هو مثل لجميع من آمن بالله وجميع من كفر . وقيل : هو مثل لعيينة بن حصن وأصحابه مع سلمان وصهيب وأصحابه ; شبههم الله برجلين من بني إسرائيل أخوين أحدهما مؤمن واسمه يهوذا ; في قول ابن عباس . وقال مقاتل : اسمه تمليخا . والآخر كافر واسمه قرطوش . وهما اللذان وصفهما الله - تعالى - في سورة الصافات . وكذا ذكر محمد بن الحسن المقرئ قال : اسم الخير منهما تمليخا ، والآخر قرطوش ، وأنهما كانا شريكين ثم اقتسما المال فصار لكل واحد منهما ثلاثة آلاف دينار ، فاشترى المؤمن منهما عبيدا بألف وأعتقهم ، وبالألف الثانية ثيابا فكسا العراة ، وبالألف الثالثة طعاما فأطعم الجوع ، وبنى أيضا مساجد ، وفعل خيرا . وأما الآخر فنكح بماله نساء ذوات يسار ، واشترى دواب وبقرا فاستنتجها فنمت له نماء مفرطا ، واتجر بباقيها فربح حتى فاق أهل زمانه غنى ; وأدركت الأول الحاجة ، فأراد أن يستخدم نفسه في جنة يخدمها فقال : لو ذهبت لشريكي وصاحبي فسألته أن يستخدمني في بعض جناته رجوت أن يكون ذلك أصلح بي ، فجاءه فلم يكد يصل إليه من غلظ الحجاب ، فلما دخل عليه وعرفه وسأله حاجته قال له : ألم أكن قاسمتك المال نصفين فما صنعت بمالك ؟ . قال : اشتريت به من الله - تعالى - ما هو خير منه وأبقى . فقال : أئنك لمن المصدقين ، ما أظن الساعة قائمة وما أراك إلا سفيها ، وما جزاؤك عندي على سفاهتك إلا الحرمان ، أوما ترى ما صنعت أنا بمالي حتى آل إلى ما تراه من الثروة وحسن الحال ، وذلك أني كسبت وسفهت أنت ، اخرج عني . ثم كان من قصة هذا الغني ما ذكره الله - تعالى - في القرآن من الإحاطة بثمره وذهابها أصلا بما أرسل عليها من السماء من الحسبان . وقد ذكر الثعلبي هذه القصة بلفظ آخر ، والمعنى متقارب . قال عطاء : كانا شريكين لهما ثمانية آلاف دينار . وقيل : ورثاه من أبيهما وكانا أخوين فاقتسماها ، فاشترى أحدهما أرضا بألف دينار ، فقال صاحبه : اللهم إن فلانا قد اشترى أرضا بألف دينار وإني اشتريت منك أرضا في الجنة بألف دينار فتصدق بها ، ثم إن صاحبه بنى دارا بألف دينار فقال : اللهم إن فلانا بنى دارا بألف دينار وإني أشتري منك دارا في الجنة بألف دينار ، فتصدق بها ، ثم تزوج امرأة فأنفق عليها ألف دينار ، فقال : اللهم إن فلانا تزوج امرأة بألف دينار وإني أخطب إليك من نساء الجنة بألف دينار ، فتصدق بألف دينار . ثم اشترى خدما ومتاعا بألف دينار ، وإني أشتري منك خدما ومتاعا من الجنة بألف دينار ، فتصدق بألف دينار . ثم أصابته حاجة شديدة فقال : لعل صاحبي ينالني معروفه فأتاه فقال : ما فعل مالك ؟ فأخبره قصته فقال : وإنك لمن المصدقين بهذا الحديث والله لا أعطيك شيئا ثم قال له : أنت تعبد إله السماء ، وأنا لا أعبد إلا صنما ; فقال صاحبه : والله لأعظنه ، فوعظه وذكره وخوفه . فقال : سر بنا نصطد السمك ، فمن صاد أكثر فهو على حق ; فقال له : يا أخي إن الدنيا أحقر عند الله من أن يجعلها ثوابا لمحسن أو عقابا لكافر . قال : فأكرهه على الخروج معه ، فابتلاهما الله ، فجعل الكافر يرمي شبكته ويسمي باسم صنمه ، فتطلع متدفقة سمكا . وجعل المؤمن يرمي شبكته ويسمي باسم الله فلا يطلع له فيها شيء ; فقال له : كيف ترى أنا أكثر منك في الدنيا نصيبا ومنزلة ونفرا ، كذلك أكون أفضل منك في الآخرة إن كان ما تقول بزعمك حقا . قال : فضج الملك الموكل بهما ، فأمر الله - تعالى - جبريل أن يأخذه فيذهب به إلى الجنان فيريه منازل المؤمن فيها ، فلما رأى ما أعد الله له قال : وعزتك لا يضره ما ناله من الدنيا بعد ما يكون مصيره إلى هذا ; وأراه منازل الكافر في جهنم فقال : وعزتك لا ينفعه ما أصابه من الدنيا بعد أن يكون مصيره إلى هذا . ثم إن الله - تعالى - توفى المؤمن وأهلك الكافر بعذاب من عنده ، فلما استقر المؤمن في الجنة ورأى ما أعد الله له أقبل هو وأصحابه يتساءلون ، فقال : إني كان لي قرين يقول أإنك لمن المصدقين الآية ; فنادى مناد : يا أهل الجنة هل أنتم مطلعون فاطلع إلى جهنم فرآه في سواء الجحيم ; فنزلت واضرب لهم مثلا .\nبين الله - تعالى - حال الأخوين في الدنيا في هذه السورة ، وبين حالهما في الآخرة في سورة \" الصافات في قوله إني كان لي قرين يقول أئنك لمن المصدقين - إلى قوله - لمثل هذا فليعمل العاملون . قال ابن عطية : وذكر إبراهيم بن القاسم الكاتب في كتابه في عجائب البلاد أن بحيرة تنيس كانت هاتين الجنتين ، وكانتا لأخوين فباع أحدهما نصيبه من الآخر فأنفق في طاعة الله حتى عيره الآخر ، وجرت بينهما المحاورة فغرقها الله - تعالى - في ليلة ، وإياها عنى بهذه الآية . وقد قيل : إن هذا مثل ضربه الله - تعالى - لهذه الأمة ، وليس بخبر عن حال متقدمة ، لتزهد في الدنيا وترغب في الآخرة ، وجعله زجرا وإنذارا ; ذكره الماوردي . وسياق الآية يدل على خلاف هذا ، والله أعلم .\nقوله تعالى : وحففناهما بنخل أي أطفناهما من جوانبهما بنخل . والحفاف الجانب ، وجمعه أحفة ; ويقال : حف القوم بفلان يحفون حفا ، أي طافوا به ; ومنه حافين من حول العرش .\nوجعلنا بينهما زرعا أي جعلنا حول الأعناب النخل ، ووسط الأعناب الزرع .\n                                    ",
        "saadi": "۞ وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَيۡنِ مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا ٢٣\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 32 و 33 :ـ\nيقول تعالى لنبيه صلى الله عليه وسلم: اضرب للناس مثل هذين الرجلين، الشاكر لنعمة الله، والكافر لها، وما صدر من كل منهما، من الأقوال والأفعال، وما حصل بسبب ذلك من العقاب العاجل والآجل، والثواب، ليعتبروا بحالهما، ويتعظوا بما حصل عليهما، وليس معرفة أعيان الرجلين، وفي أي: زمان أو مكان هما فيه فائدة أو نتيجة، فالنتيجة تحصل من قصتهما فقط، والتعرض لما سوى ذلك من التكلف. فأحد هذين الرجلين الكافر لنعمة الله الجليلة، جعل الله له جنتين، أي: بستانين حسنين، من أعناب.\n{ وَحَفَفْنَاهُمَا بِنَخْلٍ } أي: في هاتين الجنتين من كل الثمرات، وخصوصا أشرف الأشجار، العنب والنخل، فالعنب في وسطها، والنخل قد حف بذلك، ودار به، فحصل فيه من حسن المنظر وبهائه، وبروز الشجر والنخل للشمس والرياح، التي تكمل بها الثمار، وتنضج وتتجوهر، ومع ذلك جعل بين تلك الأشجار زرعا، فلم يبق عليهما إلا أن يقال: كيف ثمار هاتين الجنتين؟ وهل لهما ماء يكفيهما؟ فأخبر تعالى أن كلا من الجنتين آتت أكلها، أي: ثمرها وزرعها ضعفين، أي: متضاعفا { و } أنها { لم تَظْلِمْ مِنْهُ شَيْئًا } أي: لم تنقص من أكلها أدنى شيء، ومع ذلك، فالأنهار في جوانبهما سارحة، كثيرة غزيرة.\n{ وَكَانَ لَهُ } أي: لذلك الرجل { ثَمَرٌ } أي: عظيم كما يفيده التنكير، أي: قد استكملت جنتاه ثمارهما، وارجحنت أشجارهما، ولم تعرض لهما آفة أو نقص، فهذا غاية منتهى زينة الدنيا في الحرث، ولهذا اغتر هذا الرجل بهما، وتبجح وافتخر، ونسي آخرته.\n                                    "
      },
      "originalText": "۞ وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَيۡنِ مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا ٢٣"
    },
    {
      "number": 2173,
      "text": "كِلْتَا الْجَنَّتَيْنِ آتَتْ أُكُلَهَا وَلَمْ تَظْلِمْ مِنْهُ شَيْئًا ۚ وَفَجَّرْنَا خِلَالَهُمَا نَهَرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 33,
      "juz": 15,
      "manzil": 4,
      "page": 297,
      "ruku": 256,
      "hizbQuarter": 119,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كِلۡتَا ٱلۡجَنَّتَيۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَيۡ‍ٔٗاۚ وَفَجَّرۡنَا خِلَٰلَهُمَا نَهَرٗا ٣٣\n                                    \n                                    \n                                    ولهذا قال : ( كلتا الجنتين آتت أكلها ) أي : خرجت ثمرها ( ولم تظلم منه شيئا ) أي : ولم تنقص منه شيئا ( وفجرنا خلالهما نهرا ) أي : والأنهار تتخرق فيهما هاهنا وهاهنا .\n                                    ",
        "qortoby": "كِلۡتَا ٱلۡجَنَّتَيۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَيۡ‍ٔٗاۚ وَفَجَّرۡنَا خِلَٰلَهُمَا نَهَرٗا ٣٣\n                                    \n                                    \n                                    كلتا الجنتين أي كل واحدة من الجنتين ، آتت أكلها تاما ولذلك لم يقل آتتا واختلف في لفظ كلتا وكلا هل هو مفرد أو مثنى ; فقال أهل البصرة : هو مفرد ; لأن كلا وكلتا في توكيد الاثنين نظير \" كل \" في المجموع ، وهو اسم مفرد غير مثنى ; فإذا ولي اسما ظاهرا كان في الرفع والنصب والخفض على حالة واحدة ، تقول : رأيت كلا الرجلين وجاءني كلا الرجلين ومررت بكلا الرجلين ; فإذا اتصل بمضمر قلبت الألف ياء في موضع الجر والنصب ، تقول : رأيت كليهما ومررت بكليهما ، كما تقول عليهما . وقال الفراء : هو مثنى ، وهو مأخوذ من كل فخففت اللام وزيدت الألف للتثنية . وكذلك كلتا للمؤنث ، ولا يكونان إلا مضافين ولا يتكلم بواحد ، ولو تكلم به لقيل : كل وكلت وكلان وكلتان . واحتج بقول الشاعر :\nفي كلت رجليها سلامى واحده كلتاهما مقرونة بزائده\nأراد في إحدى رجليها فأفرد . وهذا القول ضعيف عند أهل البصرة ; لأنه لو كان مثنى لوجب أن تكون ألفه في النصب والجر ياء مع الاسم الظاهر ، ولأن معنى \" كلا \" مخالف لمعنى \" كل \" لأن \" كلا \" للإحاطة و \" كلا \" يدل على شيء مخصوص ، وأما هذا الشاعر فإما حذف الألف للضرورة وقدر أنها زائدة ، وما يكون ضرورة لا يجوز أن يجعل حجة ، فثبت أنه اسم مفرد كمعى ، إلا أنه وضع ليدل على التثنية ، كما أن قولهم \" نحن \" اسم مفرد يدل على اثنين فما فوقهما ، يدل على ذلك قول جرير :\nكلا يومي أمامة يوم صد وإن لم نأتها إلا لماما\nفأخبر عن \" كلا \" بيوم مفرد ، كما أفرد الخبر بقوله آتت ولو كان مثنى لقال آتتا ، ويوما . واختلف أيضا في ألف كلتا ; فقال سيبويه : ألف \" كلتا \" للتأنيث والتاء بدل من لام الفعل وهي واو والأصل كلوا ، وإنما أبدلت تاء لأن في التاء علم التأنيث ، والألف في كلتا قد تصير ياء مع المضمر فتخرج عن علم التأنيث ، فصار في إبدال الواو تاء تأكيد للتأنيث . وقال أبو عمر الجرمي : التاء ملحقة والألف لام الفعل ، وتقديرها عنده : فعتل ، ولو كان الأمر على ما زعم لقالوا في النسبة إليها كلتوي ، فلما قالوا كلوي وأسقطوا التاء دل على أنهم أجروها مجرى التاء في أخت إذا نسبت إليها قلت : أخوي ; ذكره الجوهري . قال أبو جعفر النحاس : وأجاز النحويون في غير القرآن الحمل على المعنى ، وأن تقول : كلتا الجنتين آتتا أكلهما ; لأن المعنى المختار كلتاهما آتتا . وأجاز الفراء : كلتا الجنتين آتى أكله ، قال : لأن المعنى كل الجنتين . قال : وفي قراءة عبد الله \" كل الجنتين آتى أكله \" . والمعنى على هذا عند الفراء : كل شيء من الجنتين آتى أكله . والأكل ( بضم الهمزة ) ثمر النخل والشجر . وكل ما يؤكل فهو أكل ; ومنه قوله - تعالى - : أكلها دائم وقد تقدم .\nآتت أكلها تاما ولذلك لم يقل آتتا .\nولم تظلم منه شيئا أي لم تنقص .\nوفجرنا خلالهما نهرا أي أجرينا وشققنا وسط الجنتين بنهر .\n                                    ",
        "saadi": "كِلۡتَا ٱلۡجَنَّتَيۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَيۡ‍ٔٗاۚ وَفَجَّرۡنَا خِلَٰلَهُمَا نَهَرٗا ٣٣\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 32 و 33 :ـ\nيقول تعالى لنبيه صلى الله عليه وسلم: اضرب للناس مثل هذين الرجلين، الشاكر لنعمة الله، والكافر لها، وما صدر من كل منهما، من الأقوال والأفعال، وما حصل بسبب ذلك من العقاب العاجل والآجل، والثواب، ليعتبروا بحالهما، ويتعظوا بما حصل عليهما، وليس معرفة أعيان الرجلين، وفي أي: زمان أو مكان هما فيه فائدة أو نتيجة، فالنتيجة تحصل من قصتهما فقط، والتعرض لما سوى ذلك من التكلف. فأحد هذين الرجلين الكافر لنعمة الله الجليلة، جعل الله له جنتين، أي: بستانين حسنين، من أعناب.\n{ وَحَفَفْنَاهُمَا بِنَخْلٍ } أي: في هاتين الجنتين من كل الثمرات، وخصوصا أشرف الأشجار، العنب والنخل، فالعنب في وسطها، والنخل قد حف بذلك، ودار به، فحصل فيه من حسن المنظر وبهائه، وبروز الشجر والنخل للشمس والرياح، التي تكمل بها الثمار، وتنضج وتتجوهر، ومع ذلك جعل بين تلك الأشجار زرعا، فلم يبق عليهما إلا أن يقال: كيف ثمار هاتين الجنتين؟ وهل لهما ماء يكفيهما؟ فأخبر تعالى أن كلا من الجنتين آتت أكلها، أي: ثمرها وزرعها ضعفين، أي: متضاعفا { و } أنها { لم تَظْلِمْ مِنْهُ شَيْئًا } أي: لم تنقص من أكلها أدنى شيء، ومع ذلك، فالأنهار في جوانبهما سارحة، كثيرة غزيرة.\n{ وَكَانَ لَهُ } أي: لذلك الرجل { ثَمَرٌ } أي: عظيم كما يفيده التنكير، أي: قد استكملت جنتاه ثمارهما، وارجحنت أشجارهما، ولم تعرض لهما آفة أو نقص، فهذا غاية منتهى زينة الدنيا في الحرث، ولهذا اغتر هذا الرجل بهما، وتبجح وافتخر، ونسي آخرته.\n                                    "
      },
      "originalText": "كِلۡتَا ٱلۡجَنَّتَيۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَيۡ‍ٔٗاۚ وَفَجَّرۡنَا خِلَٰلَهُمَا نَهَرٗا ٣٣"
    },
    {
      "number": 2174,
      "text": "وَكَانَ لَهُ ثَمَرٌ فَقَالَ لِصَاحِبِهِ وَهُوَ يُحَاوِرُهُ أَنَا أَكْثَرُ مِنْكَ مَالًا وَأَعَزُّ نَفَرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 34,
      "juz": 15,
      "manzil": 4,
      "page": 297,
      "ruku": 256,
      "hizbQuarter": 119,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَانَ لَهُۥ ثَمَرٞ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكۡثَرُ مِنكَ مَالٗا وَأَعَزُّ نَفَرٗا ٤٣\n                                    \n                                    \n                                    ( وكان له ثمر ) قيل : المراد به : المال . روي عن ابن عباس ، ومجاهد ، وقتادة . وقيل : الثمار وهو أظهر هاهنا ، ويؤيده القراءة الأخرى : \" وكان له ثمر \" بضم الثاء وتسكين الميم ، فيكون جمع ثمرة ، كخشبة وخشب ، وقرأ آخرون : ( ثمر ) بفتح الثاء والميم .\nفقال - أي صاحب هاتين [ الجنتين ] - ( لصاحبه وهو يحاوره ) أي : يجادله ويخاصمه ، يفتخر عليه ويترأس : ( أنا أكثر منك مالا وأعز نفرا ) أي أكثر خدما وحشما وولدا .\nقال قتادة : تلك - والله - أمنية الفاجر : كثرة المال وعزة النفر .\n                                    ",
        "qortoby": "وَكَانَ لَهُۥ ثَمَرٞ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكۡثَرُ مِنكَ مَالٗا وَأَعَزُّ نَفَرٗا ٤٣\n                                    \n                                    \n                                    وكان له ثمر قرأ أبو جعفر وشيبة وعاصم ويعقوب وابن أبي إسحاق ثمر بفتح الثاء والميم ، وكذلك قوله وأحيط بثمره جمع ثمرة . قاله الجوهري : الثمرة واحدة الثمر والثمرات ، وجمع الثمر ثمار ; مثل جبل وجبال . قال الفراء : وجمع الثمار ثمر ; مثل كتاب وكتب ، وجمع الثمر أثمار ; مثل أعناق وعنق . والثمر أيضا المال المثمر ; يخفف ويثقل . وقرأ أبو عمرو \" وكان له ثمر \" بضم الثاء وإسكان الميم ، وفسره بأنواع المال . والباقون بضمها في الحرفين . قال ابن عباس : ذهب وفضة وأموال . وقد مضى في \" الأنعام \" نحو هذا مبينا . ذكر النحاس : حدثنا أحمد بن شعيب قال أخبرني عمران بن بكار قال حدثنا إبراهيم بن العلاء الزبيدي قال حدثنا شعيب بن إسحاق قال هارون قال حدثني أبان عن ثعلب عن الأعمش أن الحجاج قال : لو سمعت أحدا يقرأ \" وكان له ثمر \" لقطعت لسانه ; فقلت للأعمش : أتأخذ بذلك ؟ فقال : لا ! ولا نعمة عين . فكان يقرأ \" ثمر \" ويأخذه من جمع الثمر . قال النحاس : فالتقدير على هذا القول أنه جمع ثمرة على ثمار ، ثم جمع ثمارا على ثمر ; وهو حسن في العربية إلا أن القول الأول أشبه والله أعلم ; لأن قوله كلتا الجنتين آتت أكلها يدل على أن له ثمرا .\nقوله تعالى : فقال لصاحبه وهو يحاوره أي يراجعه في الكلام ويجاوبه . والمحاورة المجاوبة ، والتحاور التجاوب . ويقال : كلمته فما أحار إلي جوابا ، وما رجع إلي حويرا ولا حويرة ولا محورة ولا حوارا ; أي ما رد جوابا .\nأنا أكثر منك مالا وأعز نفرا النفر : الرهط وهو ما دون العشرة . وأراد هاهنا الأتباع والخدم والولد ، حسبما تقدم بيانه .\n                                    ",
        "saadi": "وَكَانَ لَهُۥ ثَمَرٞ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكۡثَرُ مِنكَ مَالٗا وَأَعَزُّ نَفَرٗا ٤٣\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 34 حتى 36 :ـ\nأي: فقال صاحب الجنتين لصاحبه المؤمن، وهما يتحاوران، أي: يتراجعان بينهما في بعض الماجريات المعتادة، مفتخرا عليه: { أَنَا أَكْثَرُ مِنْكَ مَالًا وَأَعَزُّ نَفَرًا } فخر بكثرة ماله، وعزة أنصاره من عبيد، وخدم، وأقارب، وهذا جهل منه، وإلا فأي: افتخار بأمر خارجي ليس فيه فضيلة نفسية، ولا صفة معنوية، وإنما هو بمنزله فخر الصبي بالأماني، التي لا حقائق تحتها، ثم لم يكفه هذا الافتخار على صاحبه، حتى حكم، بجهله وظلمه، وظن لما دخل جنته، فـ { قَالَ مَا أَظُنُّ أَنْ تَبِيدَ } أي: تنقطع وتضمحل { هَذِهِ أَبَدًا } فاطمأن إلى هذه الدنيا، ورضى بها، وأنكر البعث، فقال: { وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَئِنْ رُدِدْتُ إِلَى رَبِّي } على ضرب المثل { لَأَجِدَنَّ خَيْرًا مِنْهَا مُنْقَلَبًا } أي ليعطيني خيرا من هاتين الجنتين، وهذا لا يخلو من أمرين: إما أن يكون عالما بحقيقة الحال، فيكون كلامه هذا على وجه التهكم والاستهزاء فيكون زيادة كفر إلى كفره، وإما أن يكون هذا ظنه في الحقيقة، فيكون من أجهل الناس، وأبخسهم حظا من العقل، فأي: تلازم بين عطاء الدنيا وعطاء الآخرة، حتى يظن بجهله أن من أعطي في الدنيا أعطي في الآخرة، بل الغالب، أن الله تعالى يزوي الدنيا عن أوليائه وأصفيائه، ويوسعها على أعدائه الذين ليس لهم في الآخرة نصيب، والظاهر أنه يعلم حقيقة الحال، ولكنه قال هذا الكلام، على وجه التهكم والاستهزاء، بدليل قوله: { وَدَخَلَ جَنَّتَهُ وَهُوَ ظَالِمٌ لِنَفْسِهِ } فإثبات أن وصفه الظلم، في حال دخوله، الذي جرى منه، من القول ما جرى، يدل على تمرده وعناده.\n                                    "
      },
      "originalText": "وَكَانَ لَهُۥ ثَمَرٞ فَقَالَ لِصَٰحِبِهِۦ وَهُوَ يُحَاوِرُهُۥٓ أَنَا۠ أَكۡثَرُ مِنكَ مَالٗا وَأَعَزُّ نَفَرٗا ٤٣"
    }
  ]
}