{
  "number": 300,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 2194,
      "text": "وَلَقَدْ صَرَّفْنَا فِي هَٰذَا الْقُرْآنِ لِلنَّاسِ مِنْ كُلِّ مَثَلٍ ۚ وَكَانَ الْإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 54,
      "juz": 15,
      "manzil": 4,
      "page": 300,
      "ruku": 259,
      "hizbQuarter": 120,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٖۚ وَكَانَ ٱلۡإِنسَٰنُ أَكۡثَرَ شَيۡءٖ جَدَلٗا ٤٥\n                                    \n                                    \n                                    يقول تعالى : ولقد بينا للناس في هذا القرآن ، ووضحنا لهم الأمور ، وفصلناها ، كيلا يضلوا عن الحق ، ويخرجوا عن طريق الهدى . ومع هذا البيان وهذا الفرقان ، الإنسان كثير المجادلة والمخاصمة والمعارضة للحق بالباطل ، إلا من هدى الله وبصره لطريق النجاة .\nقال الإمام أحمد : حدثنا أبو اليمان ، أخبرنا شعيب ، عن الزهري ، أخبرني علي بن الحسين ، أن حسين بن علي أخبره ، أن علي بن أبي طالب أخبره ، أن رسول الله صلى الله عليه وسلم طرقه وفاطمة بنت رسول الله صلى الله عليه وسلم ليلة ، فقال : \" ألا تصليان ؟ \" فقلت : يا رسول الله ، إنما أنفسنا بيد الله ، فإذا شاء أن يبعثنا بعثنا . فانصرف حين قلت ذلك ، ولم يرجع إلي شيئا ، ثم سمعته وهو مول يضرب فخذه [ ويقول ] ( وكان الإنسان أكثر شيء جدلا ) أخرجاه في الصحيحين .\n                                    ",
        "qortoby": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٖۚ وَكَانَ ٱلۡإِنسَٰنُ أَكۡثَرَ شَيۡءٖ جَدَلٗا ٤٥\n                                    \n                                    \n                                    قوله تعالى : ولقد صرفنا في هذا القرآن للناس من كل مثل يحتمل وجهين :\n[ أحدهما ] ما ذكره لهم من العبر والقرون الخالية . [ الثاني ] ما أوضحه لهم من دلائل الربوبية وقد تقدم في \" سبحان \" ; فهو على الوجه الأول زجر ، وعلى الثاني بيان .\nوكان الإنسان أكثر شيء جدلا أي جدالا ومجادلة والمراد به النضر بن الحارث وجداله في القرآن وقيل : الآية في أبي بن خلف . وقال الزجاج : أي الكافر أكثر شيء جدلا ; والدليل على أنه أراد الكافر قوله ويجادل الذين كفروا بالباطل\nوروى أنس أن النبي - صلى الله عليه وسلم - قال : يؤتى بالرجل يوم القيامة من الكفار فيقول الله له : ما صنعت فيما أرسلت إليك ؟ فيقول : رب آمنت بك وصدقت برسلك وعملت بكتابك ، فيقول الله : له هذه صحيفتك ليس فيها من ذلك ، فيقول : يا رب إني لا أقبل ما في هذه الصحيفة ، فيقال له : هذه الملائكة الحفظة يشهدون عليك ، فيقول : ولا أقبلهم يا رب وكيف أقبلهم ولا هم من عندي ولا من جهتي ، فيقول الله - تعالى - : هذا اللوح المحفوظ أم الكتاب قد شهد بذلك ، فقال : يا رب ألم تجرني من الظلم ؟ قال : بلى ، فقال : يا رب لا أقبل إلا شاهدا علي إلا من نفسي ، فيقول الله - تعالى - : الآن نبعث عليك شاهدا من نفسك ، فيتفكر من ذا الذي يشهد عليه من نفسه فيختم على فيه ثم تنطق جوارحه بالشرك ثم يخلى بينه وبين الكلام فيدخل النار وإن بعضه ليلعن بعضا يقول لأعضائه لعنكن الله فعنكن كنت أناضل فتقول أعضاؤه لعنك الله أفتعلم أن الله - تعالى - يكتم حديثا فذلك قوله - تعالى - : وكان الإنسان أكثر شيء جدلا أخرجه مسلم بمعناه من حديث أنس أيضا . وفي صحيح مسلم عن علي أن النبي - صلي الله عليه وسلم - طرقه وفاطمة فقال : ألا تصلون ؟ فقلت : يا رسول الله إنما أنفسنا بيد الله فإذا شاء أن يبعثنا بعثنا ; فانصرف رسول الله - صلى الله عليه وسلم - حين قلت له ذلك ، ثم سمعته وهو مدبر يضرب فخذه ويقول : وكان الإنسان أكثر شيء جدلا\n                                    ",
        "saadi": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٖۚ وَكَانَ ٱلۡإِنسَٰنُ أَكۡثَرَ شَيۡءٖ جَدَلٗا ٤٥\n                                        \n                                        \n                                        \n                                        يخبر الله تعالى عن عظمة القرآن، وجلالته، وعمومه، وأنه صرف فيه من كل مثل، أي: من كل طريق موصل إلى العلوم النافعة، والسعادة الأبدية، وكل طريق يعصم من الشر والهلاك، ففيه أمثال الحلال والحرام، وجزاء الأعمال، والترغيب والترهيب، والأخبار الصادقة النافعة للقلوب، اعتقادا، وطمأنينة، ونورا، وهذا مما يوجب التسليم لهذا القرآن وتلقيه بالانقياد والطاعة، وعدم المنازعة له في أمر من الأمور، ومع ذلك، كان كثير من الناس يجادلون في الحق بعد ما تبين، ويجادلون بالباطل { لِيُدْحِضُوا بِهِ الْحَقَّ } ولهذا قال: { وَكَانَ الْإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلًا } أي: مجادلة ومنازعة فيه، مع أن ذلك، غير لائق بهم، ولا عدل منهم، والذي أوجب له ذلك وعدم الإيمان بالله، إنما هو الظلم والعناد، لا لقصور في بيانه وحجته، وبرهانه، وإلا فلو جاءهم العذاب، وجاءهم ما جاء قبلهم، لم تكن هذه حالهم، ولهذا قال:\n                                    "
      },
      "originalText": "وَلَقَدۡ صَرَّفۡنَا فِي هَٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٖۚ وَكَانَ ٱلۡإِنسَٰنُ أَكۡثَرَ شَيۡءٖ جَدَلٗا ٤٥"
    },
    {
      "number": 2195,
      "text": "وَمَا مَنَعَ النَّاسَ أَنْ يُؤْمِنُوا إِذْ جَاءَهُمُ الْهُدَىٰ وَيَسْتَغْفِرُوا رَبَّهُمْ إِلَّا أَنْ تَأْتِيَهُمْ سُنَّةُ الْأَوَّلِينَ أَوْ يَأْتِيَهُمُ الْعَذَابُ قُبُلًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 55,
      "juz": 15,
      "manzil": 4,
      "page": 300,
      "ruku": 259,
      "hizbQuarter": 120,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰ وَيَسۡتَغۡفِرُواْ رَبَّهُمۡ إِلَّآ أَن تَأۡتِيَهُمۡ سُنَّةُ ٱلۡأَوَّلِينَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ قُبُلٗا ٥٥\n                                    \n                                    \n                                    يخبر تعالى عن تمرد الكفرة في قديم الزمان وحديثه ، وتكذيبهم بالحق البين الظاهر مع ما يشاهدون من الآيات [ والآثار ] والدلالات الواضحات ، وأنه ما منعهم من اتباع ذلك إلا طلبهم أن يشاهدوا العذاب الذي وعدوا به عيانا ، كما قال أولئك لنبيهم : ( فأسقط علينا كسفا من السماء إن كنت من الصادقين ) [ الشعراء : 187 ] ، وآخرون قالوا : ( ائتنا بعذاب الله إن كنت من الصادقين ) [ العنكبوت : 29 ] ، وقالت قريش : ( اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم ) [ الأنفال : 32 ] ، ( وقالوا ياأيها الذي نزل عليه الذكر إنك لمجنون لو ما تأتينا بالملائكة إن كنت من الصادقين ) [ الحجر : 7 ، 6 ] إلى غير ذلك [ من الآيات الدالة على ذلك ] .\nثم قال : ( إلا أن تأتيهم سنة الأولين ) من غشيانهم بالعذاب وأخذهم عن آخرهم ، ( أو يأتيهم العذاب قبلا ) أي : يرونه عيانا مواجهة [ ومقابلة ]\n                                    ",
        "qortoby": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰ وَيَسۡتَغۡفِرُواْ رَبَّهُمۡ إِلَّآ أَن تَأۡتِيَهُمۡ سُنَّةُ ٱلۡأَوَّلِينَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ قُبُلٗا ٥٥\n                                    \n                                    \n                                    قوله تعالى : وما منع الناس أن يؤمنوا إذ جاءهم الهدى أي القرآن والإسلام ومحمد - عليه الصلاة والسلام -\nويستغفروا ربهم إلا أن تأتيهم سنة الأولين أي سنتنا في إهلاكهم أي ما منعهم عن الإيمان إلا حكمي عليهم بذلك ; ولو حكمت عليهم بالإيمان آمنوا . وسنة الأولين عادة الأولين في عذاب الاستئصال . وقيل : المعنى وما منع الناس أن يؤمنوا إلا طلب أن تأتيهم سنة الأولين فحذف . وسنة الأولين معاينة العذاب ، فطلب المشركون ذلك ، وقالوا اللهم إن كان هذا هو الحق من عندك الآية .\nأو يأتيهم العذاب قبلا نصب على الحال ، ومعناه عيانا قاله ابن عباس . وقال الكلبي : هو السيف يوم بدر . وقال مقاتل : فجأة وقرأ أبو جعفر وعاصم والأعمش وحمزة ويحيى والكسائي قبلا بضمتين أرادوا به أصناف العذاب كله ، جمع قبيل نحو سبيل وسبل . النحاس : ومذهب الفراء أن قبلا جمع قبيل أي متفرقا يتلو بعضه بعضا . ويجوز عنده أن يكون المعنى عيانا . وقال الأعرج : وكانت قراءته قبلا معناه جميعا وقال أبو عمرو : وكانت قراءته قبلا ومعناه عيانا .\n                                    ",
        "saadi": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰ وَيَسۡتَغۡفِرُواْ رَبَّهُمۡ إِلَّآ أَن تَأۡتِيَهُمۡ سُنَّةُ ٱلۡأَوَّلِينَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ قُبُلٗا ٥٥\n                                        \n                                        \n                                        \n                                        أي: ما منع الناس من الإيمان، والحال أن الهدى الذي يحصل به الفرق، بين الهدى والضلال، والحق والباطل، قد وصل إليهم، وقامت عليهم حجة الله، فلم يمنعهم عدم البيان، بل منعهم الظلم والعدوان، عن الإيمان، فلم يبق إلا أن تأتيهم سنة الله، وعادته في الأولين من أنهم إذا لم يؤمنوا، عوجلوا بالعذاب، أو يرون العذاب قد أقبل عليهم، ورأوه مقابلة ومعاينة، أي: فليخافوا من ذلك، وليتوبوا من كفرهم، قبل أن يكون العذاب الذي لا مرد له.\n                                    "
      },
      "originalText": "وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤۡمِنُوٓاْ إِذۡ جَآءَهُمُ ٱلۡهُدَىٰ وَيَسۡتَغۡفِرُواْ رَبَّهُمۡ إِلَّآ أَن تَأۡتِيَهُمۡ سُنَّةُ ٱلۡأَوَّلِينَ أَوۡ يَأۡتِيَهُمُ ٱلۡعَذَابُ قُبُلٗا ٥٥"
    },
    {
      "number": 2196,
      "text": "وَمَا نُرْسِلُ الْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنْذِرِينَ ۚ وَيُجَادِلُ الَّذِينَ كَفَرُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ ۖ وَاتَّخَذُوا آيَاتِي وَمَا أُنْذِرُوا هُزُوًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 56,
      "juz": 15,
      "manzil": 4,
      "page": 300,
      "ruku": 259,
      "hizbQuarter": 120,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۚ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَمَآ أُنذِرُواْ هُزُوٗا ٦٥\n                                    \n                                    \n                                    ثم قال : ( وما نرسل المرسلين إلا مبشرين ومنذرين ويجادل الذين كفروا بالباطل ليدحضوا به الحق واتخذوا آياتي وما أنذروا هزوا ) أي : قبل العذاب مبشرين من صدقهم وآمن بهم ، ومنذرين من كذبهم وخالفهم .\nثم أخبر عن الكفار بأنهم يجادلون بالباطل ) ليدحضوا به ) أي : ليضعفوا به ) الحق ) الذي جاءتهم به الرسل ، وليس ذلك بحاصل لهم . ( واتخذوا آياتي وما أنذروا هزوا ) أي : اتخذوا الحجج والبراهين وخوارق العادات التي بعث بها الرسل وما أنذروهم وخوفوهم به من العذاب ) هزوا ) أي : سخروا منهم في ذلك ، وهو أشد التكذيب .\n                                    ",
        "qortoby": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۚ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَمَآ أُنذِرُواْ هُزُوٗا ٦٥\n                                    \n                                    \n                                    قوله تعالى : وما نرسل المرسلين إلا مبشرين أي بالجنة لمن آمن .\nومنذرين أي مخوفين بالعذاب من الكفر . وقد تقدم .\nويجادل الذين كفروا بالباطل ليدحضوا به الحق قيل : نزلت في المقتسمين كانوا يجادلون في الرسول - صلى الله عليه وسلم - فيقولون : ساحر ومجنون وشاعر وكاهن كما تقدم . ومعنى يدحضوا يزيلوا ويبطلوا وأصل الدحض الزلق يقال : دحضت رجله أي زلقت ، تدحض دحضا ودحضت الشمس عن كبد السماء زالت ودحضت حجته دحوضا بطلت ، وأدحضها الله والإدحاض الإزلاق . وفي وصف الصراط : ويضرب الجسر على جهنم وتحل الشفاعة فيقولون اللهم سلم سلم قيل : يا رسول الله وما الجسر ؟ قال : دحض مزلقة أي تزلق فيه القدم قال طرفة :\nأبا منذر رمت الوفاء فهبته وحدت كما حاد البعير عن الدحض\nواتخذوا آياتي يعني القرآن .\nوما أنذروا من الوعيد . هزوا و \" ما \" بمعنى المصدر أي والإنذار وقيل : بمعنى الذي ; أي اتخذوا القرآن والذي أنذروا به من الوعيد هزوا أي لعبا وباطلا .\n; وقد تقدم في \" البقرة \" بيانه . وقيل : هو قول أبي جهل في الزبد والتمر هذا هو الزقوم وقيل : هو قولهم في القرآن هو سحر وأضغاث أحلام وأساطير الأولين ، وقالوا للرسول : هل هذا إلا بشر مثلكم وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم و ماذا أراد الله بهذا مثلا .\n                                    ",
        "saadi": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۚ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَمَآ أُنذِرُواْ هُزُوٗا ٦٥\n                                        \n                                        \n                                        \n                                        أي: لم نرسل الرسل عبثا، ولا ليتخذهم الناس أربابا، ولا ليدعوا إلى أنفسهم، بل أرسلناهم يدعون الناس إلى كل خير، وينهون عن كل شر، ويبشرونهم على امتثال ذلك بالثواب العاجل والأجل، وينذرونهم على معصية ذلك بالعقاب العاجل والآجل، فقامت بذلك حجة الله على العباد، ومع ذلك يأبى الظالمون الكافرون، إلا المجادلة بالباطل، ليدحضوا به الحق، فسعوا في نصر الباطل مهما أمكنهم، وفي دحض الحق وإبطاله، واستهزءوا برسل الله وآياته، وفرحوا بما عندهم من العلم، ويأبى الله إلا أن يتم نوره ولو كره الكافرون، ويظهر الحق على الباطل { بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق } ومن حكمة الله ورحمته، أن تقييضه المبطلين المجادلين الحق بالباطل، من أعظم الأسباب إلى وضوح الحق وتبين شواهده وأدلته، وتبين الباطل وفساده، فبضدها تتبين الأشياء.\n                                    "
      },
      "originalText": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَۚ وَيُجَٰدِلُ ٱلَّذِينَ كَفَرُواْ بِٱلۡبَٰطِلِ لِيُدۡحِضُواْ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوٓاْ ءَايَٰتِي وَمَآ أُنذِرُواْ هُزُوٗا ٦٥"
    },
    {
      "number": 2197,
      "text": "وَمَنْ أَظْلَمُ مِمَّنْ ذُكِّرَ بِآيَاتِ رَبِّهِ فَأَعْرَضَ عَنْهَا وَنَسِيَ مَا قَدَّمَتْ يَدَاهُ ۚ إِنَّا جَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَنْ يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا ۖ وَإِنْ تَدْعُهُمْ إِلَى الْهُدَىٰ فَلَنْ يَهْتَدُوا إِذًا أَبَدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 57,
      "juz": 15,
      "manzil": 4,
      "page": 300,
      "ruku": 259,
      "hizbQuarter": 120,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِ‍َٔايَٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِيَ مَا قَدَّمَتۡ يَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن يَهۡتَدُوٓاْ إِذًا أَبَدٗا ٧٥\n                                    \n                                    \n                                    يقول تعالى : وأي عباد الله أظلم ممن ذكر بآيات الله فأعرض عنها ، أي : تناساها وأعرض عنها ، ولم يصغ لها ، ولا ألقى إليها بالا ( ونسي ما قدمت يداه ) أي : من الأعمال السيئة والأفعال القبيحة . ( إنا جعلنا على قلوبهم ) أي قلوب هؤلاء ) أكنة ) أي : أغطية وغشاوة ، ( أن يفقهوه ) أي : لئلا يفهموا هذا القرآن والبيان ، ( وفي آذانهم وقرا ) أي : صمم معنوي عن الرشاد ، ( وإن تدعهم إلى الهدى فلن يهتدوا إذا أبدا ) .\n                                    ",
        "qortoby": "وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِ‍َٔايَٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِيَ مَا قَدَّمَتۡ يَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن يَهۡتَدُوٓاْ إِذًا أَبَدٗا ٧٥\n                                    \n                                    \n                                    قوله تعالى : ومن أظلم ممن ذكر بآيات ربه فأعرض عنها أي لا أحد أظلم لنفسه ممن وعظ بآيات ربه ، فتهاون بها وأعرض عن قبولها .\nونسي ما قدمت يداه أي ترك كفره ومعاصيه فلم يتب منها ، فالنسيان هنا بمعنى الترك . وقيل : المعنى نسي ما قدم لنفسه وحصل من العذاب ; والمعنى متقارب .\nإنا جعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا بسبب كفرهم ; أي نحن منعنا الإيمان من أن يدخل قلوبهم وأسماعهم .\nوإن تدعهم إلى الهدى أي إلى الإيمان .\nفلن يهتدوا إذا أبدا نزل في قوم معينين ، وهو يرد على القدرية قولهم ; وقد تقدم معنى هذه الآية في سبحان وغيرها .\n                                    ",
        "saadi": "وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِ‍َٔايَٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِيَ مَا قَدَّمَتۡ يَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن يَهۡتَدُوٓاْ إِذًا أَبَدٗا ٧٥\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه لا أعظم ظلما، ولا أكبر جرما، من عبد ذكر بآيات الله وبين له الحق من الباطل، والهدى من الضلال، وخوف ورهب ورغب، فأعرض عنها، فلم يتذكر بما ذكر به، ولم يرجع عما كان عليه، ونسى ما قدمت يداه من الذنوب، ولم يراقب علام الغيوب، فهذا أعظم ظلما من المعرض الذي لم تأته آيات الله ولم يذكر بها، وإن كان ظالما، فإنه أخف ظلما من هذا، لكون العاصي على بصيرة وعلم، أعظم ممن ليس كذلك، ولكن الله تعالى عاقبه بسبب إعراضه عن آياته، ونسيانه لذنوبه، ورضاه لنفسه، حالة الشر مع علمه بها، أن سد عليه أبواب الهداية بأن جعل على قلبه أكنة، أي: أغطية محكمة تمنعه أن يفقه الآيات وإن سمعتها، فليس في إمكانها الفقه الذي يصل إلى القلب، { وَفِي آذَانِهِمْ وَقْرًا } أي: صمما يمنعهم من وصول الآيات، ومن سماعها على وجه الانتفاع وإذا كانوا بهذه الحالة، فليس لهدايتهم سبيل، { وَإِنْ تَدْعُهُمْ إِلَى الْهُدَى فَلَنْ يَهْتَدُوا إِذًا أَبَدًا } لأن الذي يرجى أن يجيب الداعي للهدى من ليس عالما، وأما هؤلاء، الذين أبصروا ثم عموا، ورأوا طريق الحق فتركوه، وطريق الضلال فسلكوه، وعاقبهم الله بإقفال القلوب والطبع عليها، فليس في هدايتهم حيلة ولا طريق وفي هذه الآية من التخويف لمن ترك الحق بعد علمه، أن يحال بينهم وبينه، ولا يتمكن منه بعد ذلك، ما هو أعظم مرهب وزاجر عن ذلك.\n                                    "
      },
      "originalText": "وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِ‍َٔايَٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِيَ مَا قَدَّمَتۡ يَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن يَفۡقَهُوهُ وَفِيٓ ءَاذَانِهِمۡ وَقۡرٗاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن يَهۡتَدُوٓاْ إِذًا أَبَدٗا ٧٥"
    },
    {
      "number": 2198,
      "text": "وَرَبُّكَ الْغَفُورُ ذُو الرَّحْمَةِ ۖ لَوْ يُؤَاخِذُهُمْ بِمَا كَسَبُوا لَعَجَّلَ لَهُمُ الْعَذَابَ ۚ بَلْ لَهُمْ مَوْعِدٌ لَنْ يَجِدُوا مِنْ دُونِهِ مَوْئِلًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 58,
      "juz": 15,
      "manzil": 4,
      "page": 300,
      "ruku": 259,
      "hizbQuarter": 120,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدٞ لَّن يَجِدُواْ مِن دُونِهِۦ مَوۡئِلٗا ٨٥\n                                    \n                                    \n                                    وقوله : ( وربك الغفور ذو الرحمة ) أي : ربك - يا محمد - غفور ذو رحمة واسعة ، ( لو يؤاخذهم بما كسبوا لعجل لهم العذاب ) ، كما قال : ( ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة ) [ فاطر : 45 ] ، وقال : ( وإن ربك لذو مغفرة للناس على ظلمهم وإن ربك لشديد العقاب ) [ الرعد : 6 ] . والآيات في هذا كثيرة .\nثم أخبر أنه يحلم ويستر ويغفر ، وربما هدى بعضهم من الغي إلى الرشاد ، ومن استمر منهم فله يوم يشيب فيه الوليد ، وتضع كل ذات حمل حملها ؛ ولهذا قال : ( بل لهم موعد لن يجدوا من دونه موئلا ) أي : ليس لهم عنه محيد ولا محيص ولا معدل .\n                                    ",
        "qortoby": "وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدٞ لَّن يَجِدُواْ مِن دُونِهِۦ مَوۡئِلٗا ٨٥\n                                    \n                                    \n                                    قوله تعالى : وربك الغفور ذو الرحمة أي للذنوب . وهذا يختص به أهل الإيمان دون الكفرة بدليل قوله : إن الله لا يغفر أن يشرك به .\nذو الرحمة فيه أربع تأويلات :\n[ أحدها ] ذو العفو . [ الثاني ] ذو الثواب ; وهو على هذين الوجهين مختص بأهل الإيمان دون الكفر . [ الثالث ] ذو النعمة . [ الرابع ] ذو الهدى ; وهو على هذين الوجهين يعم أهل الإيمان والكفر ، لأنه ينعم في الدنيا على الكافر ، كإنعامه على المؤمن . وقد أوضح هداه للكافر كما أوضحه للمؤمن وإن اهتدى به المؤمن دون الكافر .\nومعنى قوله : لو يؤاخذهم بما كسبوا أي من الكفر والمعاصي .\nلعجل لهم العذاب ولكنه يمهل .\nبل لهم موعد أي أجل مقدر يؤخرون إليه ، نظيره لكل نبإ مستقر ، لكل أجل كتاب أي إذا حل لم يتأخر عنهم إما في الدنيا وإما في الآخرة .\nلن يجدوا من دونه موئلا أي ملجأ ; قاله ابن عباس وابن زيد ، وحكاه الجوهري في الصحاح . وقد وأل يئل وألا ووءولا على فعول أي لجأ ; وواءل منه على فاعل أي طلب النجاة . وقال مجاهد : محرزا . قتادة : وليا . وأبو عبيدة : منجى . وقيل : محيصا ; والمعنى واحد والعرب تقول : لا وألت نفسه أي لا نجت ; ومنه قول الشاعر :\nلا وألت نفسك خليتها للعامريين ولم تكلم\nوقال الأعشى :\nوقد أخالس رب البيت غفلته وقد يحاذر مني ثم ما يئل\nأي ما ينجو .\n                                    ",
        "saadi": "وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدٞ لَّن يَجِدُواْ مِن دُونِهِۦ مَوۡئِلٗا ٨٥\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى عن سعة مغفرته ورحمته، وأنه يغفر الذنوب، ويتوب الله على من يتوب، فيتغمده برحمته، ويشمله بإحسانه، وأنه لو آخذ العباد على ما قدمت أيديهم من الذنوب، لعجل لهم العذاب، ولكنه تعالى حليم لا يعجل بالعقوبة، بل يمهل ولا يهمل، والذنوب لا بد من وقوع آثارها، وإن تأخرت عنها مدة طويلة، ولهذا قال:{ بَلْ لَهُمْ مَوْعِدٌ لَنْ يَجِدُوا مِنْ دُونِهِ مَوْئِلًا } أي: لهم موعد، يجازون فيه بأعمالهم، لا بد لهم منه، ولا مندوحة لهم عنه، ولا ملجأ، ولا محيد عنه، وهذه سنته في الأولين والآخرين، أن لا يعاجلهم بالعقاب، بل يستدعيهم إلى التوبة والإنابة، فإن تابوا وأنابوا، غفر لهم ورحمهم، وأزال عنهم العقاب، وإلا، فإن استمروا على ظلمهم وعنادهم، وجاء الوقت الذي جعله موعدا لهم، أنزل بهم بأسه\n                                    "
      },
      "originalText": "وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ يُؤَاخِذُهُم بِمَا كَسَبُواْ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدٞ لَّن يَجِدُواْ مِن دُونِهِۦ مَوۡئِلٗا ٨٥"
    },
    {
      "number": 2199,
      "text": "وَتِلْكَ الْقُرَىٰ أَهْلَكْنَاهُمْ لَمَّا ظَلَمُوا وَجَعَلْنَا لِمَهْلِكِهِمْ مَوْعِدًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 59,
      "juz": 15,
      "manzil": 4,
      "page": 300,
      "ruku": 259,
      "hizbQuarter": 120,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا ٩٥\n                                    \n                                    \n                                    وقوله : ( وتلك القرى أهلكناهم لما ظلموا ) أي : الأمم السالفة والقرون الخالية أهلكناهم بسبب كفرهم وعنادهم ( وجعلنا لمهلكهم موعدا ) أي : جعلناه إلى مدة معلومة ووقت [ معلوم ] معين ، لا يزيد ولا ينقص ، أي : وكذلك أنتم أيها المشركون ، احذروا أن يصيبكم ما أصابهم ، فقد كذبتم أشرف رسول وأعظم نبي ، ولستم بأعز علينا منهم ، فخافوا عذابي ونذر .\n                                    ",
        "qortoby": "وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا ٩٥\n                                    \n                                    \n                                    قوله تعالى : وتلك القرى أهلكناهم لما ظلموا تلك في موضع رفع بالابتداء . القرى نعت أو بدل . وأهلكناهم في موضع الخبر محمول على المعنى ; لأن المعني أهل القرى . ويجوز أن تكون تلك في موضع نصب على قول من قال : زيدا ضربته ; أي وتلك القرى التي قصصنا عليك نبأهم ، نحو قرى عاد وثمود ومدين وقوم لوط أهلكناهم لما ظلموا وكفروا .\nوجعلنا لمهلكهم موعدا أي وقتا معلوما لم تعده و \" مهلك \" من أهلكوا . وقرأ عاصم مهلكهم بفتح الميم واللام وهو مصدر هلك . وأجاز الكسائي والفراء لمهلكهم بكسر اللام وفتح الميم . النحاس : قال الكسائي وهو أحب إلي لأنه من هلك . الزجاج : اسم للزمان والتقدير : لوقت مهلكهم ، كما يقال : أتت الناقة على مضربها .\n                                    ",
        "saadi": "وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا ٩٥\n                                        \n                                        \n                                        \n                                        { وَتِلْكَ الْقُرَى أَهْلَكْنَاهُمْ لَمَّا ظَلَمُوا } أي: بظلمهم، لا بظلم منا { وَجَعَلْنَا لِمَهْلِكِهِمْ مَوْعِدًا } أي: وقتا مقدرا، لا يتقدمون عنه ولا يتأخرون.\n                                    "
      },
      "originalText": "وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا ٩٥"
    },
    {
      "number": 2200,
      "text": "وَإِذْ قَالَ مُوسَىٰ لِفَتَاهُ لَا أَبْرَحُ حَتَّىٰ أَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ أَوْ أَمْضِيَ حُقُبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 60,
      "juz": 15,
      "manzil": 4,
      "page": 300,
      "ruku": 260,
      "hizbQuarter": 120,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا ٠٦\n                                    \n                                    \n                                    سبب قول موسى [ عليه السلام ] لفتاه - وهو يوشع بن نون - هذا الكلام : أنه ذكر له أن عبدا من عباد الله بمجمع البحرين ، عنده من العلم ما لم يحط به موسى ، فأحب الذهاب إليه ، وقال لفتاه ذلك : ( لا أبرح حتى أبلغ مجمع البحرين ) أي لا أزال سائرا حتى أبلغ هذا المكان الذي فيه مجمع البحرين ، قال الفرزدق :\nفما برحوا حتى تهادت نساؤهم ببطحاء ذي قار عياب اللطائم\nقال قتادة وغير واحد : وهما بحر فارس مما يلي المشرق ، وبحر الروم مما يلي المغرب .\nوقال محمد بن كعب القرظي : مجمع البحرين عند طنجة ، يعني في أقصى بلاد المغرب ، فالله أعلم .\nوقوله : ( أو أمضي حقبا ) أي : ولو أني أسير حقبا من الزمان .\nقال ابن جرير ، رحمه الله : ذكر بعض أهل العلم بكلام العرب أن الحقب في لغة قيس سنة . ثم قد روي عن عبد الله بن عمرو أنه قال : الحقب ثمانون سنة . وقال مجاهد : سبعون خريفا . وقال علي بن أبي طلحة ، عن ابن عباس قوله : ( أو أمضي حقبا ) قال : دهرا . وقال قتادة ، وابن زيد ، مثل ذلك .\n                                    ",
        "qortoby": "وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا ٠٦\n                                    \n                                    \n                                    قوله تعالى : وإذ قال موسى لفتاه لا أبرح حتى أبلغ مجمع البحرين أو أمضي حقبا فيه أربع مسائل :\nالأولى : قوله تعالى : وإذ قال موسى لفتاه الجمهور من العلماء وأهل التاريخ أنه موسى بن عمران المذكور في القرآن ليس فيه موسى غيره . وقالت فرقة منها نوف البكالي : إنه ليس ابن عمران وإنما هو موسى بن منشا بن يوسف بن يعقوب وكان نبيا قبل موسى بن عمران . وقد رد هذا القول ابن عباس في صحيح البخاري وغيره . وفتاه : هو يوشع بن نون . وقد مضى ذكره في \" المائدة \" وآخر \" يوسف \" . ومن قال هو ابن منشا فليس الفتى يوشع بن نون .\nلا أبرح أي لا أزال أسير ; قال الشاعر :\nوأبرح ما أدام الله قومي بحمد الله منتطقا مجيدا\nوقيل : لا أبرح لا أفارقك .\nحتى أبلغ مجمع البحرين أي ملتقاهما . قال قتادة : وهو بحر فارس والروم ; وقاله مجاهد . قال ابن عطية : وهو ذراع يخرج من البحر المحيط من شمال إلى جنوب في أرض فارس من وراء أذربيجان ، فالركن الذي لاجتماع البحرين مما يلي بر الشام هو مجمع البحرين على هذا القول . وقيل : هما بحر الأردن وبحر القلزم . وقيل : مجمع البحرين عند طنجة ; قال محمد بن كعب . وروي عن أبي بن كعب أنه بأفريقية . وقال السدي : الكر والرس بأرمينية .\nوقال بعض أهل العلم : هو بحر الأندلس من البحر المحيط ; حكاه النقاش ; وهذا مما يذكر كثيرا . وقالت فرقة : إنما هما موسى والخضر ; وهذا قول ضعيف ; وحكي عن ابن عباس ، ولا يصح ; فإن الأمر بين من الأحاديث أنه إنما وسم له بحر ماء .\nوسبب هذه القصة ما خرجه الصحيحان عن أبي بن كعب أنه سمع رسول الله - صلى الله عليه وسلم - يقول : إن موسى - عليه السلام - قام خطيبا في بني إسرائيل فسئل أي الناس أعلم فقال أنا فعتب الله عليه إذ لم يرد العلم إليه فأوحى الله إليه إن لي عبدا بمجمع البحرين هو أعلم منك قال موسى يا رب فكيف لي به قال تأخذ معك حوتا فتجعله في مكتل فحيثما فقدت الحوت فهو ثم . . . وذكر الحديث ، واللفظ للبخاري . وقال ابن عباس : لما ظهر موسى وقومه على أرض مصر أنزل قومه مصر ، فلما استقرت بهم الدار أمره الله أن ذكرهم بأيام الله ، فخطب قومه فذكرهم ما أتاهم الله من الخير والنعمة إذ نجاهم من آل فرعون ، وأهلك عدوهم ، واستخلفهم في الأرض ، ثم قال : وكلم الله نبيكم تكليما ، واصطفاه لنفسه ، وألقى علي محبة منه ، وآتاكم من كل ما سألتموه ، فجعلكم أفضل أهل الأرض ، ورزقكم العز بعد الذل ، والغنى بعد الفقر ، والتوراة بعد أن كنتم جهالا ; فقال له رجل من بني إسرائيل : عرفنا الذي تقول ، فهل على وجه الأرض أحد أعلم منك يا نبي الله ؟ قال : لا ; فعتب عليه حين لم يرد العلم إليه ، فبعث الله جبريل : أن يا موسى وما يدريك أين أضع علمي ؟ بلى إن لي عبدا بمجمع البحرين أعلم منك . . . ) وذكر الحديث .\nقال علماؤنا : قوله في الحديث ( هو أعلم منك ) أي بأحكام وقائع مفصلة ، وحكم نوازل معينة ، لا مطلقا بدليل قول الخضر لموسى : إنك على علم علمكه الله لا أعلمه أنا ، وأنا على علم علمنيه لا تعلمه أنت ، وعلى هذا فيصدق على كل واحد منهما أنه أعلم من الآخر بالنسبة إلى ما يعلمه كل واحد منهما ولا يعلمه الآخر ، فلما سمع موسى هذا تشوقت نفسه الفاضلة ، وهمته العالية ، لتحصيل علم ما لم يعلم ، وللقاء من قيل فيه : إنه أعلم منك ; فعزم فسأل سؤال الذليل بكيف السبيل ، فأمر بالارتحال على كل حال وقيل له احمل معك حوتا مالحا في مكتل - وهو الزنبيل - فحيث يحيا وتفقده فثم السبيل ، فانطلق مع فتاه لما واتاه ، مجتهدا طلبا قائلا : لا أبرح حتى أبلغ مجمع البحرين أو أمضي حقبا\nالثانية : في هذا من الفقه رحلة العالم في طلب الازدياد من العلم ، والاستعانة على ذلك بالخادم والصاحب ، واغتنام لقاء الفضلاء والعلماء وإن بعدت أقطارهم ، وذلك كان في دأب السلف الصالح ، وبسبب ذلك وصل المرتحلون إلى الحظ الراجح ، وحصلوا على السعي الناجح ، فرسخت لهم في العلوم أقدام ، وصح لهم من الذكر والأجر والفضل أفضل الأقسام قال البخاري : ورحل جابر بن عبد الله مسيرة شهر إلى عبد الله بن أنيس في حديث .\nالثالثة : وإذ قال موسى لفتاه للعلماء فيه ثلاثة أقوال : أحدها : أنه كان معه يخدمه ، والفتى في كلام العرب الشاب ، ولما كان الخدمة أكثر ما يكونون فتيانا قيل للخادم فتى على جهة حسن الأدب ، وندبت الشريعة إلى ذلك في قول النبي - صلى الله عليه وسلم - : لا يقل أحدكم عبدي ولا أمتي وليقل فتاي وفتاتي فهذا ندب إلى التواضع ; وقد تقدم هذا في \" يوسف \" . والفتى في الآية هو الخادم وهو يوشع بن نون بن إفراثيم بن يوسف - عليه السلام - . ويقال : هو ابن أخت موسى - عليه السلام - . وقيل : إنما سمي فتى موسى لأنه لزمه ليتعلم منه وإن كان حرا ; وهذا معنى الأول . وقيل : إنما سماه فتى لأنه قام مقام الفتى وهو العبد ، قال الله - تعالى - : وقال لفتيانه اجعلوا بضاعتهم في رحالهم وقال : تراود فتاها عن نفسه قال ابن العربي : فظاهر القرآن يقتضي أنه عبد ، وفي الحديث : ( أنه كان يوشع بن نون ) وفي التفسير : أنه ابن أخته ، وهذا كله مما لا يقطع به ، والتوقف فيه أسلم .\nالرابعة : أو أمضي حقبا بضم الحاء والقاف وهو الدهر ، والجمع أحقاب . وقد تسكن قافه فيقال حقب . وهو ثمانون سنة . ويقال : أكثر من ذلك . والجمع حقاب . والحقبة بكسر الحاء واحدة الحقب وهي السنون . قال عبد الله بن عمر : والحقب ثمانون سنة . مجاهد : سبعون خريفا . قتادة : زمان ، النحاس : الذي يعرفه أهل اللغة أن الحقب والحقبة زمان من الدهر مبهم غير محدود ; كما أن رهطا وقوما مبهم غير محدود : وجمعه أحقاب .\n                                    ",
        "saadi": "وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا ٠٦\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن نبيه موسى عليه السلام، وشدة رغبته في الخير وطلب العلم، أنه قال لفتاه - أي: خادمه الذي يلازمه في حضره وسفره، وهو \" يوشع بن نون \" الذي نبأه الله بعد ذلك:- { لَا أَبْرَحُ حَتَّى أَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ ْ} أي: لا أزال مسافرا وإن طالت علي الشقة، ولحقتني المشقة، حتى أصل إلى مجمع البحرين، وهو المكان الذي أوحي إليه أنك ستجد فيه عبدا من عباد الله العالمين، عنده من العلم، ما ليس عندك، { أَوْ أَمْضِيَ حُقُبًا ْ} أي: مسافة طويلة، المعنى: أن الشوق والرغبة، حمل موسى أن قال لفتاه هذه المقالة، وهذا عزم منه جازم، فلذلك أمضاه.\n                                    "
      },
      "originalText": "وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا ٠٦"
    },
    {
      "number": 2201,
      "text": "فَلَمَّا بَلَغَا مَجْمَعَ بَيْنِهِمَا نَسِيَا حُوتَهُمَا فَاتَّخَذَ سَبِيلَهُ فِي الْبَحْرِ سَرَبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 61,
      "juz": 15,
      "manzil": 4,
      "page": 300,
      "ruku": 260,
      "hizbQuarter": 120,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا ١٦\n                                    \n                                    \n                                    وقوله : ( فلما بلغا مجمع بينهما نسيا حوتهما ) ، وذلك أنه كان قد أمر بحمل حوت مملوح معه ، وقيل له : متى فقدت الحوت فهو ثمة . فسارا حتى بلغا مجمع البحرين ؛ وهناك عين يقال لها : \" عين الحياة \" ، فناما هنالك ، وأصاب الحوت من رشاش ذلك الماء فاضطرب ، وكان في مكتل مع يوشع [ عليه السلام ] ، وطفر من المكتل إلى البحر ، فاستيقظ يوشع ، عليه السلام ، وسقط الحوت في البحر وجعل يسير فيه ، والماء له مثل الطاق لا يلتئم بعده ؛ ولهذا قال : ( فاتخذ سبيله في البحر سربا ) أي : مثل السرب في الأرض .\nقال ابن جريج : قال ابن عباس : صار أثره كأنه حجر .\nوقال العوفي ، عن ابن عباس : جعل الحوت لا يمس شيئا من البحر إلا يبس حتى يكون صخرة .\nوقال محمد - [ هو ] ابن إسحاق - عن الزهري ، عن عبيد الله بن عبد الله ، عن ابن عباس ، عن أبي بن كعب قال : قال رسول الله صلى الله عليه وسلم حين ذكر حديث ذلك : \" ما انجاب ماء منذ كان الناس غيره ثبت مكان الحوت الذي فيه ، فانجاب كالكوة حتى رجع إليه موسى فرأى مسلكه \" ، فقال : ( ذلك ما كنا نبغ ) .\nوقال قتادة : سرب من البر ، حتى أفضى إلى البحر ، ثم سلك فيه فجعل لا يسلك فيه طريقا إلا جعل ماء جامدا .\n                                    ",
        "qortoby": "فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا ١٦\n                                    \n                                    \n                                    قوله تعالى : فلما بلغا مجمع بينهما نسيا حوتهما فاتخذ سبيله في البحر سربا الضمير في قوله : بينهما للبحرين ; قاله مجاهد . والسرب المسلك ; قاله مجاهد . وقال قتادة : جمد الماء فصار كالسرب .\nوجمهور المفسرين أن الحوت بقي موضع سلوكه فارغا ، وأن موسى مشى عليه متبعا للحوت ، حتى أفضى به الطريق إلى جزيرة في البحر ، وفيها وجد الخضر . وظاهر الروايات والكتاب أنه إنما وجد الخضر في ضفة البحر وقوله : نسيا حوتهما وإنما كان النسيان من الفتى وحده فقيل : المعنى ; نسي أن يعلم موسى بما رأى من حاله فنسب النسيان إليهما للصحبة ، كقوله - تعالى - : يخرج منهما اللؤلؤ والمرجان وإنما يخرج من الملح ، وقوله : يامعشر الجن والإنس ألم يأتكم رسل منكم وإنما الرسل من الإنس لا من الجن وفي البخاري ; ( فقال لفتاه : لا أكلفك إلا أن تخبرني بحيث يفارقك الحوت ، قال : ما كلفت كثيرا ; فذلك قوله - عز وجل - : وإذ قال موسى لفتاه يوشع بن نون - ليست عن سعيد - قال فبينا هو في ظل صخرة في مكان ثريان إذ تضرب الحوت وموسى نائم فقال فتاه : لا أوقظه ; حتى إذا استيقظ نسي أن يخبره ، وتضرب الحوت حتى دخل البحر ، فأمسك الله عنه جرية البحر حتى كأن أثره في حجر ; قال لي عمرو : هكذا كأن أثره في حجر وحلق بين إبهاميه واللتين تليانهما ) وفي رواية ( وأمسك الله عن الحوت جرية الماء فصار مثل الطاق ، فلما استيقظ نسي صاحبه أن يخبره بالحوت فانطلقا بقية يومهما وليلتهما ، حتى إذا كان من الغد قال موسى لفتاه : آتنا غداءنا لقد لقينا من سفرنا هذا نصبا ولم يجد موسى النصب حتى جاوز المكان الذي أمر الله به ، فقال له فتاه : أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره ) وقيل : إن النسيان كان منهما لقوله - تعالى - : نسيا فنسب النسيان إليهما ; وذلك أن بدو حمل الحوت كان منموسى لأنه الذي أمر به ، فلما مضيا كان فتاه الحامل له حتى أويا إلى الصخرة نزلا .\n                                    ",
        "saadi": "فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا ١٦\n                                        \n                                        \n                                        \n                                        { فَلَمَّا بَلَغَا ْ} أي: هو وفتاه { مَجْمَعَ بَيْنِهِمَا نَسِيَا حُوتَهُمَا ْ} وكان معهما حوت يتزودان منه ويأكلان، وقد وعد أنه متى فقد الحوت فثم ذلك العبد الذي قصدته، فاتخذ ذلك الحوت سبيله، أي: طريقه في البحر سربا وهذا من الآيات.\nقال المفسرون إن ذلك الحوت الذي كانا يتزودان منه، لما وصلا إلى ذلك المكان، أصابه بلل البحر، فانسرب بإذن الله في البحر، وصار مع حيواناته حيا.\n                                    "
      },
      "originalText": "فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا ١٦"
    }
  ]
}