{
  "number": 302,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 2215,
      "text": "۞ قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 75,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 261,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا ٥٧\n                                    \n                                    \n                                    \" قال ألم أقل لك إنك لن تستطيع معي صبرا \" فأكد أيضًا وفي التذكار بالشرط الأول.\n                                    ",
        "qortoby": "۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا ٥٧\n                                    \n                                    \n                                    قَالَ\nالخضر .أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا\nأي إنك يا موسى لا تطيق أن تصبر على ما تراه من علمي ; لأن الظواهر التي هي علمك لا تعطيه , وكيف تصبر على ما تراه خطأ ولم تخبر بوجه الحكمة فيه , ولا طريق الصواب .\n                                    ",
        "saadi": "۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا ٥٧\n                                        \n                                        \n                                        \n                                        فقال له الخضر معاتبا ومذكرا: { أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا ْ}\n                                    "
      },
      "originalText": "۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا ٥٧"
    },
    {
      "number": 2216,
      "text": "قَالَ إِنْ سَأَلْتُكَ عَنْ شَيْءٍ بَعْدَهَا فَلَا تُصَاحِبْنِي ۖ قَدْ بَلَغْتَ مِنْ لَدُنِّي عُذْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 76,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 261,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۢ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي عُذۡرٗا ٦٧\n                                    \n                                    \n                                    فلهذا قال له موسى : ( إن سألتك عن شيء بعدها ) أي : إن اعترضت عليك بشيء بعد هذه المرة ( فلا تصاحبني قد بلغت من لدني عذرا ) أي : قد أعذرت إلي مرة بعد مرة .\nقال ابن جرير : حدثنا عبد الله بن زياد ، حدثنا حجاج بن محمد ، عن حمزة الزيات ، عن أبي إسحاق ، عن سعيد بن جبير ، عن ابن عباس ، عن أبي بن كعب قال : كان النبي صلى الله عليه وسلم إذا ذكر أحدا فدعا له ، بدأ بنفسه ، فقال ذات يوم : \" رحمة الله علينا وعلى موسى ، لو لبث مع صاحبه لأبصر العجب ولكنه قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرا \"مثقلة.\n                                    ",
        "qortoby": "قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۢ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي عُذۡرٗا ٦٧\n                                    \n                                    \n                                    قوله تعالى : فلا تصاحبني كذا قرأ الجمهور ; أي تتابعني . وقرأ الأعرج \" تصحبني \" بفتح التاء والباء وتشديد النون وقرئ \" تصحبني \" أي تتبعني وقرأ يعقوب \" تصحبني \" بضم التاء وكسر الحاء ; ورواها سهل عن أبي عمرو ; قال الكسائي : معناه فلا تتركني أصحبك .\nقد بلغت من لدني عذرا أي بلغت مبلغا تعذر به في ترك مصاحبتي ، وقرأ الجمهور : من لدني بضم الدال ، إلا أن نافعا وعاصما خففا النون ، فهي \" لدن \" اتصلت بها ياء المتكلم التي في غلامي وفرسي ، وكسر ما قبل الياء كما كسر في هذه . وقرأ أبو بكر عن عاصم \" لدني \" بفتح اللام وسكون الدال وتخفيف النون وروي عن عاصم \" لدني \" بضم اللام وسكون الدال ; قال ابن مجاهد : وهي غلط ; قال أبو علي : هذا التغليط يشبه أن يكون من جهة الرواية ، فأما على قياس العربية فهي صحيحة وقرأ الجمهور عذرا وقرأ عيسى \" عذرا \" بضم الذال وحكى الداني أن أبيا روى عن النبي - صلى الله عليه وسلم - \" عذري \" بكسر الراء وياء بعدها .\nمسألة : أسند الطبري قال : ( كان رسول الله - صلى الله عليه وسلم - إذا دعا لأحد بدأ بنفسه ، فقال يوما : رحمة الله علينا وعلى موسى لو صبر على صاحبه لرأى العجب ولكنه قال فلا تصاحبني قد بلغت من لدني عذرا والذي في صحيح مسلم قال رسول الله - صلى الله عليه وسلم - : رحمة الله علينا وعلى موسى لولا أنه عجل لرأى العجب ولكنه أخذته من صاحبه ذمامة ولو صبر لرأى العجب قال : وكان إذا ذكر أحدا من الأنبياء بدأ بنفسه : رحمة الله علينا وعلى أخي كذا وفي البخاري عن النبي - صلى الله عليه وسلم - قال : يرحم الله موسى لوددنا أنه صبر حتى يقص علينا من أمرهما الذمامة بالذال المعجمة المفتوحة ، وهو بمعنى المذمة بفتح الذال وكسرها ، وهي الرقة والعار من تلك الحرمة : يقال أخذتني منك مذمة ومذمة وذمامة وكأنه استحيا من تكرار مخالفته ، ومما صدر عنه من تغليظ الإنكار .\n                                    ",
        "saadi": "قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۢ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي عُذۡرٗا ٦٧\n                                        \n                                        \n                                        \n                                        فقال [له] موسى: { إِنْ سَأَلْتُكَ عَنْ شَيْءٍ ْ} بعد هذه المرة { فَلَا تُصَاحِبْنِي ْ} أي: فأنت معذور بذلك، وبترك صحبتي { قَدْ بَلَغْتَ مِنْ لَدُنِّي عُذْرًا ْ} أي: أعذرت مني، ولم تقصر.\n                                    "
      },
      "originalText": "قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۢ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي عُذۡرٗا ٦٧"
    },
    {
      "number": 2217,
      "text": "فَانْطَلَقَا حَتَّىٰ إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا فَأَبَوْا أَنْ يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ فَأَقَامَهُ ۖ قَالَ لَوْ شِئْتَ لَاتَّخَذْتَ عَلَيْهِ أَجْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 77,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 261,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا ٧٧\n                                    \n                                    \n                                    يقول تعالى مخبرا عنهما : إنهما انطلقا بعد المرتين الأوليين ( حتى إذا أتيا أهل قرية ) روى ابن جرير عن ابن سيرين أنها الأيلة وفي الحديث : \" حتى إذا أتيا أهل قرية لئاما \" أي بخلاء ( فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض ) إسناد الإرادة هاهنا إلى الجدار على سبيل الاستعارة ، فإن الإرادة في المحدثات بمعنى الميل . والانقضاض هو : السقوط . \nوقوله : ( فأقامه ) أي : فرده إلى حالة الاستقامة وقد تقدم في الحديث أنه رده بيديه ، ودعمه حتى رد ميله . وهذا خارق فعند ذلك قال موسى له ( لو شئت لاتخذت عليه أجرا ) أي : لأجل أنهم لم يضيفونا كان ينبغي ألا تعمل لهم مجانا\n                                    ",
        "qortoby": "فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا ٧٧\n                                    \n                                    \n                                    قوله : فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض فأقامه قال لو شئت لاتخذت عليه أجرا قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا فيه ثلاث عشرة مسألة :\nالأولى : قوله تعالى : حتى إذا أتيا أهل قرية في صحيح مسلم عن أبي بن كعب عن النبي - صلى الله عليه وسلم - : لئاما ; فطافا في المجالس ف استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض يقول : مائل قال : فأقامه الخضر بيده قال له موسى : قوم أتيناهم فلم يضيفونا ، ولم يطعمونا لو شئت لاتخذت عليه أجرا قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا قال رسول الله - صلى الله عليه وسلم - : يرحم الله موسى لوددت أنه كان صبر حتى يقص علينا من أخبارهما .\nالثانية : واختلف العلماء في القرية فقيل : هي أبلة ; قاله قتادة ، وكذلك قال محمد بن سيرين ، وهي أبخل قرية وأبعدها من السماء وقيل : أنطاكية وقيل : بجزيرة الأندلس ; روي ذلك عن أبي هريرة وغيره ، ويذكر أنها الجزيرة الخضراء وقالت فرقة : هي باجروان وهي بناحية أذربيجان وحكى السهيلي وقال : إنها برقة . الثعلبي : هي قرية من قرى الروم يقال لها ناصرة ، وإليها تنسب النصارى ; وهذا كله بحسب الخلاف في أي ناحية من الأرض كانت قصة موسى والله أعلم بحقيقة ذلك .\nالثالثة : كان موسى - عليه السلام - حين سقى لبنتي شعيب أحوج منه حين أتى القرية مع الخضر ; ولم يسأل قوتا بل سقى ابتداء ، وفي القرية سأل القوت ; وفي ذلك للعلماء انفصالات كثيرة ; منها أن موسى كان في حديث مدين منفردا وفي قصة الخضر تبعا لغيره .\nقلت : وعلى هذا المعنى يتمشى قوله في أول الآية لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا فأصابه الجوع مراعاة لصاحبه يوشع ; والله أعلم .\nوقيل : لما كان هذا سفر تأديب وكل إلى تكلف المشقة ، وكان ذلك سفر هجرة فوكل إلى العون والنصرة بالقوت .\nالرابعة : في هذه الآية دليل على سؤال القوت ، وأن من جاع وجب عليه أن يطلب ما يرد جوعه خلافا لجهال المتصوفة والاستطعام سؤال الطعام ، والمراد به هنا سؤال الضيافة . بدليل قوله : فأبوا أن يضيفوهما فاستحق أهل القرية لذلك أن يذموا ، وينسبوا إلى اللؤم والبخل ، كما وصفهم بذلك نبينا - عليه الصلاة والسلام - قال قتادة في هذه الآية : شر القرى التي لا تضيف الضيف ولا تعرف لابن السبيل حقه . ويظهر من ذلك أن الضيافة كانت عليهم واجبة ، وأن الخضر وموسى إنما سألا ما وجب لهما من الضيافة ، وهذا هو الأليق بحال الأنبياء ، ومنصب الفضلاء والأولياء وقد تقدم القول في الضيافة في \" هود \" والحمد لله .\nويعفو الله عن الحريري حيث استخف في هذه الآية وتمجن ، وأتى بخطل من القول وزل ; فاستدل بها على الكدية والإلحاح فيها ، وأن ذلك ليس بمعيب على فاعله ، ولا منقصة عليه ; فقال :\nوإن رددت فما في الرد منقصة عليك قد رد موسى قبل والخضر\nقلت : وهذا لعب بالدين ، وانسلال عن احترام النبيين ، وهي شنشنة أدبية ، وهفوة سخافية ; ويرحم الله السلف الصالح ، فلقد بالغوا في وصية كل ذي عقل راجح ، فقالوا : مهما كنت لاعبا بشيء فإياك أن تلعب بدينك .\nالخامسة : قوله تعالى : جدارا الجدار والجدر بمعنى واحد ; وفي الخبر : ( حتى يبلغ الماء الجدر ) . ومكان جدير بني حواليه جدار ، وأصله الرفع وأجدرت الشجرة طلعت ; ومنه الجدري .\nالسادسة : قوله تعالى : يريد أن ينقض أي قرب أن يسقط ، وهذا مجاز وتوسع وقد فسره في الحديث بقوله : ( مائل ) فكان فيه دليل على وجود المجاز في القرآن ، وهو مذهب الجمهور . وجميع الأفعال التي حقها أن تكون للحي الناطق متى أسندت إلى جماد أو بهيمة فإنما هي استعارة ، أي لو كان مكانهما إنسان لكان متمثلا لذلك الفعل ، وهذا في كلام العرب وأشعارها كثير ; فمن ذلك قول الأعشى :\nأتنتهون ولا ينهى ذوي شطط كالطعن يذهب فيه الزيت والفتل\nفأضاف النهي إلى الطعن . ومن ذلك قول الآخر :\nيريد الرمح صدر أبي براء ويرغب عن دماء بني عقيل\nوقال آخر :\nإن دهرا يلف شملي بجمل لزمان يهم بالإحسان\nوقال آخر :\nفي مهمه فلقت به هاماتها فلق الفؤوس إذا أردن نصولا\nأي ثبوتا في الأرض ; من قولهم : نصل السيف إذا ثبت في الرمية ; فشبه وقع السيوف على رءوسهم بوقع الفؤوس في الأرض فإن الفأس يقع فيها ويثبت لا يكاد يخرج . وقال حسان بن ثابت :\nلو أن اللؤم ينسب كان عبدا قبيح الوجه أعور من ثقيف\nوقال عنترة :\nفازور من وقع القنا بلبانه وشكا إلي بعبرة وتحمحم\nوقد فسر هذا المعنى بقوله :\nلو كان يدري ما المحاورة اشتكى\nوهذا في هذا المعنى كثير جدا ومنه قول الناس : إن داري تنظر إلى دار فلان وفي الحديث : اشتكت النار إلى ربها وذهب قوم إلى منع المجاز في القرآن ، منهم أبو إسحاق الإسفراييني وأبو بكر محمد بن داود الأصبهاني وغيرهما ، فإن كلام الله - عز وجل - وكلام رسوله حمله على الحقيقة أولى بذي الفضل والدين ; لأنه يقص الحق كما أخبر الله - تعالى - في كتابه ،\nومما احتجوا به أن قالوا : لو خاطبنا الله - تعالى - بالمجاز لزم وصفه بأنه متجوز أيضا ، فإن العدول عن الحقيقة إلى المجاز يقتضي العجز عن الحقيقة ، وهو على الله - تعالى - محال ; قال الله - تعالى - : يوم تشهد عليهم ألسنتهم وأيديهم وأرجلهم بما كانوا يعملون وقال - تعالى - : وتقول هل من مزيد وقال - تعالى - : إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا وقال - تعالى - : تدعو من أدبر وتولى و اشتكت النار إلى ربها واحتجت النار والجنة وما كان مثلها حقيقة ، وأن خالقها الذي أنطق كل شيء أنطقها . وفي صحيح مسلم من حديث أنس عن النبي - صلى الله عليه وسلم - فيختم على فيه ويقال لفخذه انطقي فتنطق فخذه ولحمه وعظامه بعمله وذلك ليعذر من نفسه وذلك المنافق وذلك الذي يسخط الله عليه . هذا في الآخرة .\nوأما في الدنيا ; ففي الترمذي عن أبي سعيد الخدري قال : قال رسول الله - صلى الله عليه وسلم - : والذي نفسي بيده لا تقوم الساعة حتى تكلم السباع الإنسان وحتى تكلم الرجل عذبة سوطه وشراك نعله وتخبره فخذه بما أحدث أهله من بعده قال أبو عيسى : وفي الباب عن أبي هريرة ، وهذا حديث حسن غريب .\nالسادسة : قوله تعالى : فأقامه قيل : هدمه ثم قعد يبنيه .\nفقال موسى للخضر : قال لو شئت لاتخذت عليه أجرا لأنه فعل يستحق أجرا ، وذكر أبو بكر الأنباري عن ابن عباس عن أبي بكر عن رسول الله - صلى الله عليه وسلم - أنه قرأ \" فوجدا فيها جدارا يريد أن ينقض فهدمه ثم قعد يبنيه \" قال أبو بكر : وهذا الحديث إن صح سنده فهو جار من الرسول - عليه الصلاة والسلام - مجرى التفسير للقرآن ، وأن بعض الناقلين أدخل تفسير قرآن في موضع فسرى أن ذلك قرآن نقص من مصحف عثمان ; على ما قاله بعض الطاعنين ، وقال سعيد بن جبير : مسحه بيده وأقامه فقام ، وهذا القول هو الصحيح ، وهو الأشبه بأفعال الأنبياء عليهم الصلاة والسلام ، بل والأولياء ، وفي بعض الأخبار : إن سمك ذلك الحائط كان ثلاثين ذراعا بذراع ذلك القرن ، وطوله على وجه الأرض خمسمائة ذراع ، وعرضه خمسون ذراعا ، فأقامه الخضر - عليه السلام - أي سواه بيده فاستقام ; قاله الثعلبي في كتاب العرائس : فقال موسى للخضر لو شئت لاتخذت عليه أجرا أي طعاما تأكله ; ففي هذا دليل على كرامات الأولياء ، وكذلك ما وصف من أحوال الخضر - عليه السلام - في هذا الباب كلها أمور خارقة للعادة ; هذا إذا تنزلنا على أنه ولي لا نبي .\nوقوله - تعالى - : وما فعلته عن أمري يدل علي نبوته وأنه يوحى إليه بالتكليف والأحكام ، كما أوحي للأنبياء عليهم الصلاة والسلام غير أنه ليس برسول ; والله أعلم .\nالثامنة : واجب على الإنسان ألا يتعرض للجلوس تحت جدار مائل يخاف سقوطه ، بل يسرع في المشي إذا كان مارا عليه ; لأن في حديث النبي - عليه الصلاة والسلام - إذا مر أحدكم بطربال مائل فليسرع المشي . قال أبو عبيد القاسم بن سلام : كان أبو عبيدة يقول : الطربال شبيه بالمنظرة من مناظر العجم كهيئة الصومعة ; والبناء المرتفع ; قال جرير :\nألوى بها شذب العروق مشذب فكأنما وكنت على طربال\nيقال منه : وكن يكن إذا جلس ، وفي الصحاح : الطربال القطعة العالية من الجدار ، والصخرة العظيمة المشرفة من الجبل ، وطرابيل الشام صوامعها . ويقال : طربل بوله إذا مده إلى فوق .\nالتاسعة : كرامات الأولياء ثابتة ، على ما دلت عليه الأخبار الثابتة ، والآيات المتواترة ، ولا ينكرها إلا المتبدع الجاحد ، أو الفاسق الحائد ; فالآيات ما أخبر الله - تعالى - في حق مريم من ظهور الفواكه الشتوية في الصيف ، والصيفية في الشتاء - على ما تقدم - وما ظهر على يدها حيث أمرت النخلة وكانت يابسة فأثمرت ، وهي ليست بنبية ; على الخلاف ويدل عليها ما ظهر على يد الخضر - عليه السلام - من خرق السفينة ، وقتل الغلام ، وإقامة الجدار . قال بعض العلماء : ولا يجوز أن يقال كان نبيا ; لأن إثبات النبوة لا يجوز بأخبار الآحاد ، لا سيما وقد روي من طريق التواتر - من غير أن يحتمل تأويلا - بإجماع الأمة قوله - عليه الصلاة والسلام - : لا نبي بعدي وقال - تعالى - : وخاتم النبيين والخضر وإلياس جميعا باقيان مع هذه الكرامة ، فوجب أن يكونا غير نبيين ، لأنهما لو كانا نبيين لوجب أن يكون بعد نبينا - عليه الصلاة والسلام - نبي ، إلا ما قامت الدلالة في حديث عيسى أنه ينزل بعده .\nقلت : الخضر كان نبيا - على ما تقدم - وليس بعد نبينا - عليه الصلاة والسلام - نبي ، أي يدعي النبوة بعده أبدا ; والله أعلم .\nالعاشرة : اختلف الناس هل يجوز أن يعلم الولي أنه ولي أم لا ؟ على قولين : [ أحدهما ] أنه لا يجوز ; وأن ما يظهر على يديه يجب أن يلاحظه بعين خوف المكر ، لأنه لا يأمن أن يكون مكرا واستدراجا له ; وقد حكي عن السري أنه كان يقول : لو أن رجلا دخل بستانا فكلمه من رأس كل شجرة طير بلسان فصيح : السلام عليك يا ولي الله فلو لم يخف أن يكون ذلك مكرا لكان ممكورا به ; ولأنه لو علم أنه ولي لزال عنه الخوف ، وحصل له الأمن . ومن شرط الولي أن يستديم الخوف إلى أن تتنزل عليه الملائكة ، كما قال - عز وجل - : تتنزل عليهم الملائكة ألا تخافوا ولا تحزنوا ولأن الولي من كان مختوما له بالسعادة ، والعواقب مستورة ولا يدري أحد ما يختم له به ; ولهذا قال - عليه الصلاة والسلام - : إنما الأعمال بالخواتيم . [ القول الثاني ] أنه يجوز للولي أن يعلم أنه ولي ; ألا ترى أن النبي - عليه الصلاة والسلام - يجوز أن يعلم أنه ولي ، ولا خلاف أنه يجوز لغيره أن يعلم أنه ولي الله - تعالى - ، فجاز أن يعلم ذلك . وقد أخبر النبي - عليه الصلاة والسلام - من حال العشرة من أصحابه أنهم من أهل الجنة ، ثم لم يكن في ذلك زوال خوفهم ، بل كانوا أكثر تعظيما لله - سبحانه وتعالى - ، وأشد خوفا وهيبة ; فإذا جاز للعشرة ذلك ولم يخرجهم عن الخوف فكذلك غيرهم . وكان الشبلي يقول : أنا أمان هذا الجانب ; فلما مات ودفن عبر الديلم دجلة ذلك اليوم ، واستولوا على بغداد ، ويقول الناس : مصيبتان موت الشبلي وعبور الديلم . ولا يقال : إنه يحتمل أن يكون ذلك استدراجا لأنه لو جاز ذلك لجاز ألا يعرف النبي أنه نبي وولي الله ، لجواز أن يكون ذلك استدراجا ، فلما لم يجز ذلك لأن فيه إبطال المعجزات لم يجز هذا ، لأن فيه إبطال الكرامات . وما روي من ظهور الكرامات على يدي بلعام وانسلاخه عن الدين بعدها لقوله : فانسلخ منها فليس في الآية أنه كان وليا ثم انسلخت عنه الولاية . وما نقل أنه ظهر على يديه ما يجري مجرى الكرامات هو أخبار آحاد لا توجب العلم ; والله أعلم .\nوالفرق بين المعجزة والكرامة أن الكرامة من شرطها الاستتار ، والمعجزة من شرطها الإظهار . وقيل : الكرامة ما تظهر من غير دعوى والمعجزة ما تظهر عند دعوى الأنبياء فيطالبون بالبرهان فيظهر أثر ذلك . وقد تقدم في مقدمة الكتاب شرائط المعجزة ، والحمد لله - تعالى - وحده لا شريك له . وأما الأحاديث الواردة في الدلالة على ثبوت الكرامات ، فمن ذلك ما خرجه البخاري من حديث أبي هريرة قال : بعث رسول الله - صلى الله عليه وسلم - عشرة رهط سرية وأمر عليهم عاصم بن ثابت الأنصاري وهو جد عاصم بن عمر بن الخطاب - رضي الله عنه - ، فانطلقوا حتى إذا كانوا بالهدأة وهي بين عسفان ومكة ذكروا لحي من هذيل يقال لهم بنو لحيان فنفروا إليهم قريبا من مائتي راجل كلهم رام ، فاقتصوا آثارهم حتى وجدوا مأكلهم تمرا تزودوه من المدينة ، فقالوا : هذا تمر يثرب ; فاقتصوا آثارهم ، فلما رآهم عاصم وأصحابه لجئوا إلى فدفد ، وأحاط بهم القوم ، فقالوا لهم : انزلوا فأعطونا أيديكم ولكم العهد والميثاق ألا نقتل منكم أحدا ; فقال عاصم بن ثابت أمير السرية : أما فوالله لا أنزل اليوم في ذمة الكافر ، اللهم أخبر عنا نبيك ، فرموا بالنبل فقتلواعاصما في سبعة ، فنزل إليهم ثلاثة رهط بالعهد والميثاق ، وهم خبيب الأنصاري وابن الدثنة ورجل آخر ، فلما استمكنوا منهم أطلقوا أوتار قسيهم فأوثقوهم ، فقال الرجل الثالث : هذا أول الغدر والله لا أصحبكم ; إن لي في هؤلاء لأسوة - يريد القتلى - فجرروه وعالجوه على أن يصحبهم فلم يفعل فقتلوه ; فانطلقوا بخبيب وابن الدثنة حتى باعوهما بمكة بعد وقعة بدر ، فابتاع خبيبا بنو الحارث بن عامر بن نوفل بن عبد مناف ، وكان خبيب هو الذي قتل الحارث بن عامر يوم بدر ، فلبث خبيب عندهم أسيرا ; فأخبر عبيد الله بن عياض أن بنت الحارث أخبرته أنهم حين اجتمعوا استعار منها موسى يستحد بها فأعارته ، فأخذ ابن لي وأنا غافلة حتى أتاه ، قالت : فوجدته مجلسه على فخذه والموسى بيده ، ففزعت فزعة عرفها خبيب في وجهي ; فقال : أتخشين أن أقتله ؟ ما كنت لأفعل ذلك . قالت : والله ما رأيت أسيرا قط خيرا من خبيب ; والله لقد وجدته يوما يأكل قطف عنب في يده ، وإنه لموثق بالحديد وما بمكة من ثمر ; وكانت تقول : إنه لرزق رزقه الله - تعالى - خبيبا ; فلما خرجوا به من الحرم ليقتلوه في الحل قال لهم خبيب : دعوني أركع ركعتين ; فتركوه فركع ركعتين ثم قال : لولا أن تظنوا أن ما بي جزع من الموت لزدت ; ثم قال : اللهم أحصهم عددا ، واقتلهم بددا ، ولا تبق منهم أحدا ; ثم قال :\nولست أبالي حين أقتل مسلما على أي شق كان لله مصرعي\nوذلك في ذات الإله وإن يشأ يبارك على أوصال شلو ممزع\nفقتله بنو الحارث ، وكان خبيب هو الذي سن الركعتين لكل امرئ مسلم قتل صبرا ; فاستجاب الله - تعالى - لعاصم يوم أصيب ; فأخبر النبي - عليه الصلاة والسلام - وأصحابه خبرهم وما أصيبوا . وبعث ناس من كفار قريش إلى عاصم حين حدثوا أنه قتل ليؤتوا بشيء منه يعرفونه ، وكان قد قتل رجلا من عظمائهم يوم بدر ; فبعث الله على عاصم مثل الظلة من الدبر فحمته من رسلهم ، فلم يقدروا على أن يقطعوا من لحمه شيئا . وقال ابن إسحاق في هذه القصة : وقد كانت هذيل حين قتل عاصم بن ثابت أرادوا رأسه ليبيعوه من سلافة بنت سعد بن شهيد ، وقد كانت نذرت حين أصاب ابنيها بأحد لئن قدرت على رأسه لتشربن في قحفه الخمر فمنعهم الدبر ، فلما حالت بينه وبينهم قالوا : دعوه حتى يمسي فتذهب عنه فنأخذه ، فبعث الله - تعالى - الوادي فاحتمل عاصما فذهب ، وقد كان عاصم أعطى الله - تعالى - عهدا ألا يمس مشركا ولا يمسه مشرك أبدا في حياته ، فمنعه الله - تعالى - بعد وفاته مما امتنع منه في حياته . وعن عمرو بن أمية الضمري : وكان رسول الله - صلى الله عليه وسلم - بعثه عينا وحده فقال : جئت إلى خشبة خبيب فرقيت فيها وأنا أتخوف العيون فأطلقته ، فوقع في الأرض ، ثم اقتحمت فانتبذت قليلا ، ثم التفت فكأنما ابتلعته الأرض . وفي رواية أخرى زيادة : فلم نذكر لخبيب رمة حتى الساعة ; ذكره البيهقي .\nالحادية عشرة : ولا ينكر أن يكون للولي مال وضيعة يصون بها ماله وعياله ، وحسبك بالصحابة وأموالهم مع ولايتهم وفضلهم ، وهم الحجة على غيرهم . وفي صحيح مسلم عن أبي هريرة عن النبي - صلى الله عليه وسلم - قال : بينما رجل بفلاة من الأرض فسمع صوتا في سحابة اسق حديقة فلان فتنحى ذلك السحاب فأفرغ ماءه في حرة فإذا شرجة من تلك الشراج قد استوعبت ذلك الماء كله فتتبع الماء فإذا رجل قائم في حديقته يحول الماء بمسحاته فقال يا عبد الله ما اسمك قال فلان الاسم الذي سمعه في السحابة فقال له يا عبد الله لم سألتني عن اسمي قال إني سمعت صوتا في السحاب الذي هذا ماؤه يقول اسق حديقة فلان لاسمك فما تصنع فيها قال أما إذ قلت هذا فإني أنظر إلى ما يخرج منها فأتصدق بثلثه وآكل أنا وعيالي ثلثا وأرد فيها ثلثه وفي رواية وأجعل ثلثه في المساكين والسائلين وابن السبيل .\nقلت : وهذا الحديث لا يناقضه قوله - عليه الصلاة والسلام - : لا تتخذوا الضيعة فتركنوا إلى الدنيا خرجه الترمذي من حديث ابن مسعود وقال فيه حديث حسن ; فإنه محمول على من اتخذها مستكثرا أو متنعما ومتمتعا بزهرتها ، وأما من اتخذها معاشا يصون بها دينه وعياله فاتخاذها بهذه النية من أفضل الأعمال ، وهي من أفضل الأموال ; قال - عليه الصلاة والسلام - : نعم المال الصالح للرجل الصالح . وقد أكثر الناس في كرامات الأولياء وما ذكرناه فيه كفاية ; والله الموفق للهداية .\nالثانية عشرة : قوله - تعالى - : لاتخذت عليه أجرا فيه دليل على صحة جواز الإجارة ، وهي سنة الأنبياء والأولياء على ما يأتي بيانه في سورة \" القصص \" إن شاء الله - تعالى - . وقرأ الجمهور لاتخذت وأبو عمرو \" لتخذت \" وهي قراءة ابن مسعود والحسن وقتادة ، وهما لغتان بمعنى واحد من الأخذ ، مثل قولك : تبع واتبع ، وتقى واتقى وأدغم بعض القراء الذال في التاء ، ولم يدغمها بعضهم وفي حديث أبي بن كعب : ( لو شئت لأوتيت أجرا ) وهذه صدرت من موسى سؤالا على جهة العرض لا الاعتراض .\nفعند ذلك قال له الخضر هذا فراق بيني وبينك بحكم ما شرطت على نفسك . وتكريره بيني وبينك وعدوله عن بيننا لمعنى التأكيد . قال سيبويه : كما يقال أخزى الله الكاذب مني ومنك ; أي منا . وقال ابن عباس : وكان قول موسى في السفينة والغلام لله ، وكان قوله في الجدار لنفسه لطلب شيء من الدنيا ، فكان سبب الفراق . وقال وهب بن منبه : كان ذلك الجدار جدارا طوله في السماء مائة ذراع .\nالثالثة عشرة : سأنبئك بتأويل ما لم تستطع عليه صبرا تأويل الشيء مآله أي قال له : إني أخبرك لم فعلت ما فعلت . وقيل في تفسير هذه الآيات التي وقعت لموسى مع الخضر : إنها حجة على موسى وعجبا له وذلك أنه لما أنكر أمر خرق السفينة نودي : يا موسى أين كان تدبيرك هذا وأنت في التابوت مطروحا في اليم فلما أنكر أمر الغلام قيل له : أين إنكارك هذا من وكزك القبطي وقضائك عليه فلما أنكر إقامة الجدار نودي : أين هذا من رفعك حجر البئر لبنات شعيب دون أجر .\n                                    ",
        "saadi": "فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا ٧٧\n                                        \n                                        \n                                        \n                                        { فَانْطَلَقَا حَتَّى إِذَا أَتَيَا أَهْلَ قَرْيَةٍ اسْتَطْعَمَا أَهْلَهَا ْ} أي: استضافاهم، فلم يضيفوهما { فَوَجَدَا فِيهَا جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ ْ} أي: قد عاب واستهدم { فَأَقَامَهُ ْ} الخضر أي: بناه وأعاده جديدا. فقال له موسى: { لَوْ شِئْتَ لَاتَّخَذْتَ عَلَيْهِ أَجْرًا ْ} أي: أهل هذه القرية، لم يضيفونا مع وجوب ذلك عليهم، وأنت تبنيه من دون أجرة، وأنت تقدر عليها؟. فحينئذ لم يف موسى عليه السلام بما قال، واستعذر الخضر منه\n                                    "
      },
      "originalText": "فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا ٧٧"
    },
    {
      "number": 2218,
      "text": "قَالَ هَٰذَا فِرَاقُ بَيْنِي وَبَيْنِكَ ۚ سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 78,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 261,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا ٨٧\n                                    \n                                    \n                                    ( قال هذا فراق بيني وبينك ) [ أي : لأنك شرطت عند قتل الغلام أنك إن سألتني عن شيء بعدها فلا تصاحبني ، فهو فراق بيني وبينك ] ، ( ، سأنبئك بتأويل ) أي : بتفسير ( ما لم تستطع عليه صبرا ) .\n                                    ",
        "qortoby": "قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا ٨٧\n                                    \n                                    \n                                    قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ\nفعند ذلك قال له الخضر \" هذا فراق بيني وبينك \" بحكم ما شرطت على نفسك .\nوتكريره \" بيني وبينك \" وعدوله عن بيننا لمعنى التأكيد .\nقال سيبويه : كما يقال أخزى الله الكاذب مني ومنك ; أي منا .\nوقال ابن عباس : وكان قول موسى في السفينة والغلام لله , وكان قوله في الجدار لنفسه لطلب شيء من الدنيا , فكان سبب الفراق .\nوقال وهب بن منبه : كان ذلك الجدار جدارا طوله في السماء مائة ذراع .سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا\nتأويل الشيء مآله أي قال له : إني أخبرك لم فعلت ما فعلت .\nوقيل في تفسير هذه الآيات التي وقعت لموسى مع الخضر : إنها حجة على موسى وعجبا له وذلك أنه لما أنكر أمر خرق السفينة نودي : يا موسى أين كان تدبيرك هذا وأنت في التابوت مطروحا في اليم فلما أنكر أمر الغلام قيل له : أين إنكارك هذا من وكزك القبطي وقضائك عليه فلما أنكر إقامة الجدار نودي : أين هذا من رفعك حجر البئر لبنات شعيب دون أجر .\n                                    ",
        "saadi": "قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا ٨٧\n                                        \n                                        \n                                        \n                                        { هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ ْ} فإنك شرطت ذلك على نفسك، فلم يبق الآن عذر، ولا موضع للصحبة، { سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِعْ عَلَيْهِ صَبْرًا ْ} أي: سأخبرك بما أنكرت عليَّ، وأنبئك بما لي في ذلك من المآرب، وما يئول إليه الأمر.\n                                    "
      },
      "originalText": "قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا ٨٧"
    },
    {
      "number": 2219,
      "text": "أَمَّا السَّفِينَةُ فَكَانَتْ لِمَسَاكِينَ يَعْمَلُونَ فِي الْبَحْرِ فَأَرَدْتُ أَنْ أَعِيبَهَا وَكَانَ وَرَاءَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ غَصْبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 79,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 261,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَمَّا ٱلسَّفِينَةُ فَكَانَتۡ لِمَسَٰكِينَ يَعۡمَلُونَ فِي ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِيبَهَا وَكَانَ وَرَآءَهُم مَّلِكٞ يَأۡخُذُ كُلَّ سَفِينَةٍ غَصۡبٗا ٩٧\n                                    \n                                    \n                                    هذا تفسير ما أشكل أمره على موسى ، عليه السلام ، وما كان أنكر ظاهره وقد أظهر الله الخضر ، عليه السلام ، على باطنة فقال إن : السفينة إنما خرقتها لأعيبها ؛ [ لأنهم كانوا يمرون بها على ملك من الظلمة ) يأخذ كل سفينة ) صالحة ، أي : جيدة ) غصبا ) فأردت أن أعيبها ] لأرده عنها لعيبها ، فينتفع بها أصحابها المساكين الذين لم يكن لهم شيء ينتفعون به غيرها . وقد قيل : إنهم أيتام .\nو [ قد ] روى ابن جريج عن وهب بن سليمان ، عن شعيب الجبائي ؛ أن اسم ذلك الملك هدد بن بدد ، وقد تقدم أيضا في رواية البخاري ، وهو مذكور في التوراة في ذرية \" العيص بن إسحاق \" وهو من الملوك المنصوص عليهم في التوراة ، والله أعلم\n                                    ",
        "qortoby": "أَمَّا ٱلسَّفِينَةُ فَكَانَتۡ لِمَسَٰكِينَ يَعۡمَلُونَ فِي ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِيبَهَا وَكَانَ وَرَآءَهُم مَّلِكٞ يَأۡخُذُ كُلَّ سَفِينَةٍ غَصۡبٗا ٩٧\n                                    \n                                    \n                                    قوله تعالى : أما السفينة فكانت لمساكين يعملون في البحر استدل بهذا من قال : إن المسكين أحسن حالا من الفقير ، وقد مضى هذا المعنى مستوفى من سورة \" براءة \" . وقد قيل : إنهم كانوا تجارا ولكن من حيث هم مسافرون عن قلة في لجة بحر ، وبحال ضعف عن مدافعة خطب عبر عنهم بمساكين ; إذ هم في حالة يشفق عليهم بسببها ، وهذا كما تقول لرجل غني وقع في وهلة أو خطب : مسكين . وقال كعب وغيره : كانت لعشرة إخوة من المساكين ورثوها من أبيهم خمسة زمنى ، وخمسة يعملون في البحر . وقيل : كانوا سبعة لكل واحد منهم زمانة ليست بالآخر . وقد ذكر النقاش أسماءهم ; فأما العمال منهم فأحدهم كان مجذوما ; والثاني أعور ، والثالث أعرج ، والرابع آدر ، والخامس محموما لا تنقطع عنه الحمى الدهر كله وهو أصغرهم ; والخمسة الذين لا يطيقون العمل : أعمى وأصم وأخرس ومقعد ومجنون ، وكان البحر الذي يعملون فيه ما بين فارس والروم ; ذكره الثعلبي . وقرأت فرقة : \" لمساكين \" بتشديد السين ، واختلف في ذلك فقيل : هم ملاحو السفينة ، وذلك أن المساك هو الذي يمسك رجل السفينة ، وكل الخدمة تصلح لإمساكه فسمي الجميع مساكين . وقالت فرقة : أراد بالمساكين دبغة المسوك وهي الجلود واحدها مسك . والأظهر قراءة مساكين بالتخفيف جمع مسكين ، وأن معناها : إن السفينة لقوم ضعفاء ينبغي أن يشفق عليهم . والله أعلم .\nقوله تعالى : فأردت أن أعيبها أي أجعلها ذات عيب ، يقال : عبت الشيء فعاب إذا صار ذا عيب ، فهو معيب وعائب .\nوقوله : وكان وراءهم ملك يأخذ كل سفينة غصبا قرأ ابن عباس وابن جبير ( صحيحة ) وقرأ أيضا ابن عباس وعثمان بن عفان ( صالحة ) . و ( وراء ) أصلها بمعنى خلف ; فقال بعض المفسرين : إنه كان خلفه وكان رجوعهم عليه . والأكثر على أن معنى ( وراء ) هنا أمام ; يعضده قراءة ابن عباس وابن جبير \" وكان أمامهم ملك يأخذ كل سفينة صحيحة غصبا \" . قال ابن عطية : وراءهم هو عندي على بابه ; وذلك أن هذه الألفاظ إنما تجيء مراعى بها الزمان وذلك أن الحدث المقدم الموجود هو الأمام ، والذي يأتي بعده هو الوراء وهو ما خلف ، وذلك بخلاف ما يظهر بادي الرأي ، وتأمل هذه الألفاظ في مواضعها حيث وردت تجدها تطرد ، فهذه الآية معناها : إن هؤلاء وعملهم وسعيهم يأتي بعده في الزمان غصب هذا الملك ; ومن قرأ \" أمامهم \" أراد في المكان ، أي كأنهم يسيرون إلى بلد ، وقوله - عليه الصلاة والسلام - : الصلاة أمامك يريد في المكان ، وإلا فكونهم في ذلك الوقت كان أمام الصلاة في الزمان ; وتأمل هذه المقالة فإنها مريحة من شغب هذه الألفاظ ; ووقع لقتادة في كتاب الطبري وكان وراءهم ملك قال قتادة : أمامهم ألا تراه يقول : من ورائهم جهنم وهي بين أيديهم ; وهذا القول غير مستقيم ، وهذه هي العجمة التي كان الحسن بن أبي الحسن يضج منها ; قاله الزجاج .\nقلت : وما اختاره هذا الإمام قد سبقه إليه في ذلك ابن عرفة ; قال الهروي قال ابن عرفة : يقول القائل كيف قال \" من ورائه \" وهي أمامه ؟ فزعم أبو عبيد وأبو علي قطرب أن هذا من الأضداد ، وأن وراء في معنى قدام ، وهذا غير محصل ; لأن أمام ضد وراء ، وإنما يصلح هذا في الأوقات ، كقولك للرجل إذا وعد وعدا في رجب لرمضان ثم قال : ومن ورائك شعبان لجاز وإن كان أمامه ، لأنه يخلفه إلى وقت وعده ; وأشار إلى هذا القول أيضا القشيري وقال : إنما يقال هذا في الأوقات ، ولا يقال للرجل أمامك إنه وراءك ; قال الفراء : وجوزه غيره ; والقوم ما كانوا عالمين بخبر الملك ، فأخبر الله - تعالى - الخضر حتى عيب السفينة ; وذكره الزجاج . وقال الماوردي : اختلف أهل العربية في استعمال وراء موضع أمام على ثلاثة أقوال : [ أحدها ] يجوز استعمالها بكل حال وفي كل مكان وهو من الأضداد قال الله - تعالى - : ومن ورائهم جهنم أي من أمامهم : وقال الشاعر :\nأترجو بنو مروان سمعي وطاعتي وقومي تميم والفلاة ورائيا\nيعني أمامي . [ والثاني ] أن وراء تستعمل في موضع أمام في المواقيت والأزمان لأن الإنسان يجوزها فتصير وراءه ولا يجوز في غيرها . [ الثالث ] أنه يجوز في الأجسام التي لا وجه لها كحجرين متقابلين كل واحد منهما وراء الآخر ولا يجوز في غيرهما ; وهذا قول علي بن عيسى .\nواختلف في اسم هذا الملك فقيل : هدد بن بدد . وقيل : الجلندي ; وقاله السهيلي . وذكر البخاري اسم الملك الآخذ لكل سفينة غصبا فقال : هو ( هدد بن بدد والغلام المقتول ) اسمه حيسور ، وهكذا قيدناه في الجامع من رواية يزيد المروزي ، وفي غير هذه الرواية حيسور بالحاء وعندي في حاشية الكتاب رواية ثالثة : وهي حيسون وكان يأخذ كل سفينة جيدة غصبا فلذلك عابها الخضر وخرقها ; ففي هذا من الفقه العمل بالمصالح إذا تحقق وجهها ، وجواز إصلاح كل المال بإفساد بعضه ، وقد تقدم . وفي صحيح مسلم وجه الحكمة بخرق السفينة وذلك قوله : ( فإذا جاء الذي يسخرها وجدها منخرقة فتجاوزها ، فأصلحوها بخشبة . . . ) الحديث . وتحصل من هذا الحض على الصبر في الشدائد ، فكم في ضمن ذلك المكروه من الفوائد ، وهذا معنى قوله : وعسى أن تكرهوا شيئا وهو خير لكم .\n                                    ",
        "saadi": "أَمَّا ٱلسَّفِينَةُ فَكَانَتۡ لِمَسَٰكِينَ يَعۡمَلُونَ فِي ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِيبَهَا وَكَانَ وَرَآءَهُم مَّلِكٞ يَأۡخُذُ كُلَّ سَفِينَةٍ غَصۡبٗا ٩٧\n                                        \n                                        \n                                        \n                                        { أَمَّا السَّفِينَةُ ْ} التي خرقتها { فَكَانَتْ لِمَسَاكِينَ يَعْمَلُونَ فِي الْبَحْرِ ْ} يقتضي ذلك الرقة عليهم، والرأفة بهم. { فَأَرَدْتُ أَنْ أَعِيبَهَا وَكَانَ وَرَاءَهُمْ مَلِكٌ يَأْخُذُ كُلَّ سَفِينَةٍ غَصْبًا ْ} أي: كان مرورهم على ذلك الملك الظالم، فكل سفينة صالحة تمر عليه ما فيها عيب غصبها وأخذها ظلما، فأردت أن أخرقها ليكون فيها عيب، فتسلم من ذلك الظالم.\n                                    "
      },
      "originalText": "أَمَّا ٱلسَّفِينَةُ فَكَانَتۡ لِمَسَٰكِينَ يَعۡمَلُونَ فِي ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِيبَهَا وَكَانَ وَرَآءَهُم مَّلِكٞ يَأۡخُذُ كُلَّ سَفِينَةٍ غَصۡبٗا ٩٧"
    },
    {
      "number": 2220,
      "text": "وَأَمَّا الْغُلَامُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَا أَنْ يُرْهِقَهُمَا طُغْيَانًا وَكُفْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 80,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 261,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَمَّا ٱلۡغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا ٠٨\n                                    \n                                    \n                                    قد تقدم أن هذا الغلام كان اسمه جيسور . وفي الحديث عن ابن عباس ، عن أبي بن كعب ، عن النبي صلى الله عليه وسلم قال : \" الغلام الذي قتله الخضر طبع يوم طبع كافرا \" . رواه ابن جرير من حديث ابن إسحاق ، عن سعيد ، عن ابن عباس ، به ؛ ولهذا قال : ( فكان أبواه مؤمنين فخشينا أن يرهقهما طغيانا وكفرا ) أي : يحملهما حبه على متابعته على الكفر .\nقال قتادة : قد فرح به أبواه حين ولد ، وحزنا عليه حين قتل ، ولو بقي كان فيه هلاكهما ، فليرض امرؤ بقضاء الله ، فإن قضاء الله للمؤمن فيما يكره خير له من قضائه فيما يحب .\nوصح في الحديث : \" لا يقضي الله للمؤمن قضاء إلا كان خيرا له \" . وقال تعالى : ( وعسى أن تكرهوا شيئا وهو خير لكم ) [ البقرة : 216 ] .\n                                    ",
        "qortoby": "وَأَمَّا ٱلۡغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا ٠٨\n                                    \n                                    \n                                    قوله تعالى : وأما الغلام فكان أبواه مؤمنين جاء في صحيح الحديث : أنه طبع يوم طبع كافرا وهذا يؤيد ظاهره أنه غير بالغ ، ويحتمل أن يكون خبرا عنه مع كونه بالغا ; وقد تقدم .\nقوله تعالى : فخشينا أن يرهقهما قيل : هو من كلام الخضر - عليه السلام - ، وهو الذي يشهد له سياق الكلام ، وهو قول كثير من المفسرين ; أي خفنا أن يرهقهما طغيانا وكفرا ، وكان الله قد أباح له الاجتهاد في قتل النفوس على هذه الجهة . وقيل : هو من كلام الله - تعالى - وعنه عبر الخضر ; قال الطبري : معناه فعلمنا ; وكذا قال ابن عباس أي فعلمنا ، وهذا كما كنى عن العلم بالخوف في قوله إلا أن يخافا ألا يقيما حدود الله . وحكي أن أبيا قرأ \" فعلم ربك \" وقيل : الخشية بمعنى الكراهة ; يقال : فرقت بينهما خشية أن يقتتلا ; أي كراهة ذلك . قال ابن عطية : والأظهر عندي في توجيه هذا التأويل وإن كان اللفظ يدافعه أنها استعارة ، أي على ظن المخلوقين والمخاطبين لو علموا حاله لوقعت منهم خشية الرهق للأبوين . وقرأ ابن مسعود \" فخاف ربك \" وهذا بين في الاستعارة ، وهذا نظير ما وقع في القرآن في جهة الله - تعالى - من لعل وعسى وأن جميع ما في هذا كله من ترج وتوقع وخوف وخشية إنما هو بحسبكم أيها المخاطبون . ويرهقهما يجشمهما ويكلفهما ; والمعنى أن يلقيهما حبه في اتباعه فيضلا ويتدينا بدينه .\n                                    ",
        "saadi": "وَأَمَّا ٱلۡغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا ٠٨\n                                        \n                                        \n                                        \n                                        { وَأَمَّا الْغُلَامُ ْ} الذي قتلته { فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَا أَنْ يُرْهِقَهُمَا طُغْيَانًا وَكُفْرًا ْ} وكان ذلك الغلام قد قدر عليه أنه لو بلغ لأرهق أبويه طغيانا وكفرا، أي: لحملهما على الطغيان والكفر، إما لأجل محبتهما إياه، أو للحاجة إليه أو يحدهما على ذلك، أي: فقتلته، لاطلاعي على ذلك، سلامة لدين أبويه المؤمنين، وأي فائدة أعظم من هذه الفائدة الجليلة؟\" وهو وإن كان فيه إساءة إليهما، وقطع لذريتهما، فإن الله تعالى سيعطيهما من الذرية، ما هو خير منه\n                                    "
      },
      "originalText": "وَأَمَّا ٱلۡغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا ٠٨"
    },
    {
      "number": 2221,
      "text": "فَأَرَدْنَا أَنْ يُبْدِلَهُمَا رَبُّهُمَا خَيْرًا مِنْهُ زَكَاةً وَأَقْرَبَ رُحْمًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 81,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 261,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَأَرَدۡنَآ أَن يُبۡدِلَهُمَا رَبُّهُمَا خَيۡرٗا مِّنۡهُ زَكَوٰةٗ وَأَقۡرَبَ رُحۡمٗا ١٨\n                                    \n                                    \n                                    وقوله [ تعالى ] ( فأردنا أن يبدلهما ربهما خيرا منه زكاة وأقرب رحما ) أي : ولدا أزكى من هذا ، وهما أرحم به منه ، قاله ابن جريج .\nوقال قتادة : أبر بوالديه .\nوقد تقدم أنهما بدلا جارية . وقيل لما قتله الخضر كانت أمه حاملا بغلام مسلم . قاله ابن جريح\n                                    ",
        "qortoby": "فَأَرَدۡنَآ أَن يُبۡدِلَهُمَا رَبُّهُمَا خَيۡرٗا مِّنۡهُ زَكَوٰةٗ وَأَقۡرَبَ رُحۡمٗا ١٨\n                                    \n                                    \n                                    قوله تعالى : فأردنا أن يبدلهما ربهما قرأ الجمهور بفتح الباء وشد الدال ، وقرأ عاصم بسكون الباء وتخفيف الدال ; أي أن يرزقهما الله ولدا . خيرا منه زكاة أي دينا وصلاحا .\nيقال : بدل وأبدل مثل مهل وأمهل ونزل وأنزل .\nوأقرب رحما قرأ ابن عباس \" رحما \" بالضم ، قال الشاعر :\nوكيف بظلم جارية ومنها اللين والرحم\nالباقون بسكونها ; ومنه قول رؤبة بن العجاج :\nيا منزل الرحم على إدريسا ومنزل اللعن على إبليسا\nواختلف عن أبي عمرو ، ورحما معطوف على \" زكاة \" أي رحمة ; يقال : رحمه رحمة ورحما ; وألفه للتأنيث ، ومذكره رحم . وقيل : الرحم هنا بمعنى الرحم ; قرأها ابن عباس \" وأوصل رحما \" أي رحما ، وقرأ أيضا \" أزكى منه \" . وعن ابن جبير وابن جريج أنهما بدلا جارية ; قال الكلبي فتزوجها نبي من الأنبياء فولدت له نبيا فهدى الله - تعالى - على يديه أمة من الأمم . قتادة : ولدت اثني عشر نبيا ، وعن ابن جريج أيضا أن أم الغلام يوم قتل كانت حاملا بغلام مسلم وكان المقتول كافرا . وعن ابن عباس : فولدت جارية ولدت نبيا ; وفي رواية : أبدلهما الله به جارية ولدت سبعين نبيا ; وقاله جعفر بن محمد عن أبيه ; قال علماؤنا : وهذا بعيد ولا تعرف كثرة الأنبياء إلا في بني إسرائيل ، وهذه المرأة لم تكن فيهم .\nويستفاد من هذه الآية تهوين المصائب بفقد الأولاد وإن كانوا قطعا من الأكباد ، ومن سلم للقضاء أسفرت عاقبته عن اليد البيضاء . قال قتادة : لقد فرح به أبواه حين ولد وحزنا عليه حين قتل ، ولو بقي كان فيه هلاكهما . فالواجب على كل امرئ الرضا بقضاء الله - تعالى - ، فإن قضاء الله للمؤمن فيما يكره خير له من قضائه له فيما يحب .\n                                    ",
        "saadi": "فَأَرَدۡنَآ أَن يُبۡدِلَهُمَا رَبُّهُمَا خَيۡرٗا مِّنۡهُ زَكَوٰةٗ وَأَقۡرَبَ رُحۡمٗا ١٨\n                                        \n                                        \n                                        \n                                        { فَأَرَدْنَا أَنْ يُبْدِلَهُمَا رَبُّهُمَا خَيْرًا مِنْهُ زَكَاةً وَأَقْرَبَ رُحْمًا ْ} أي: ولدا صالحا، زكيا، واصلا لرحمه، فإن الغلام الذي قتل لو بلغ لعقهما أشد العقوق بحملهما على الكفر والطغيان.\n                                    "
      },
      "originalText": "فَأَرَدۡنَآ أَن يُبۡدِلَهُمَا رَبُّهُمَا خَيۡرٗا مِّنۡهُ زَكَوٰةٗ وَأَقۡرَبَ رُحۡمٗا ١٨"
    },
    {
      "number": 2222,
      "text": "وَأَمَّا الْجِدَارُ فَكَانَ لِغُلَامَيْنِ يَتِيمَيْنِ فِي الْمَدِينَةِ وَكَانَ تَحْتَهُ كَنْزٌ لَهُمَا وَكَانَ أَبُوهُمَا صَالِحًا فَأَرَادَ رَبُّكَ أَنْ يَبْلُغَا أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنْزَهُمَا رَحْمَةً مِنْ رَبِّكَ ۚ وَمَا فَعَلْتُهُ عَنْ أَمْرِي ۚ ذَٰلِكَ تَأْوِيلُ مَا لَمْ تَسْطِعْ عَلَيْهِ صَبْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 82,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 261,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَٰمَيۡنِ يَتِيمَيۡنِ فِي ٱلۡمَدِينَةِ وَكَانَ تَحۡتَهُۥ كَنزٞ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحٗا فَأَرَادَ رَبُّكَ أَن يَبۡلُغَآ أَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةٗ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِيۚ ذَٰلِكَ تَأۡوِيلُ مَا لَمۡ تَسۡطِع عَّلَيۡهِ صَبۡرٗا ٢٨\n                                    \n                                    \n                                    في هذه الآية دليل على إطلاق القرية على المدينة; لأنه قال أولا ( حتى إذا أتيا أهل قرية ) [ الكهف : 77 ] وقال هاهنا : فكان لغلامين يتيمين في المدينة كما قال تعالى : ( وكأين من قرية هي أشد قوة من قريتك التي أخرجتك [ محمد : 13 ] ، وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم [ الزخرف : 31 ] يعني : مكة والطائف . ومعنى الآية : أن هذا الجدار إنما أصلحه لأنه كان لغلامين يتيمين في المدينة وكان تحته كنز لهما . قال عكرمة ، وقتادة ، وغير واحد : كان تحته مال مدفون لهما . وهذا ظاهر السياق من الآية ، وهو اختيار ابن جرير ، رحمه الله . وقال العوفي عن ابن عباس : كان تحته كنز علم . وكذا قال سعيد بن جبير ، وقال مجاهد : صحف فيها علم ، وقد ورد في حديث مرفوع ما يقوي ذلك ، قال الحافظ أبو بكر أحمد بن عمرو بن عبد الخالق البزار في مسنده المشهور : حدثنا إبراهيم بن سعيد الجوهري ، حدثنا بشر بن المنذر ، حدثنا الحارث بن عبد الله اليحصبي عن عياش بن عباس القتباني عن ابن حجيرة ، عن أبي ذر رضي الله عنه ، [ رفعه ] قال : \" إن الكنز الذي ذكر الله في كتابه : لوح من ذهب مصمت مكتوب فيه : عجبت لمن أيقن بالقدر لم نصب ؟ وعجبت لمن ذكر النار لم ضحك ؟ وعجبت لمن ذكر الموت لم غفل؟ لا إله إلا الله ، محمد رسول الله \" . بشر بن المنذر هذا يقال له : قاضي المصيصة . قال الحافظ أبو جعفر العقيلي : في حديثه وهم . وقد روي في هذا آثار عن السلف ، فقال ابن جرير في تفسيره : حدثني يعقوب ، حدثنا الحسن بن حبيب بن ندبة حدثنا سلمة ، عن نعيم العنبري - وكان من جلساء الحسن - قال : سمعت الحسن - يعني البصري - يقول في قوله : وكان تحته كنز لهما قال : لوح من ذهب مكتوب فيه : بسم الله الرحمن الرحيم ، عجبت لمن يؤمن بالقدر كيف يحزن؟ وعجبت لمن يوقن بالموت كيف يفرح؟ وعجبت لمن يعرف الدنيا وتقلبها بأهلها كيف يطمئن إليها؟ لا إله إلا الله ، محمد رسول الله . وحدثني يونس ، أخبرنا ابن وهب ، أخبرني عبد الله بن عياش عن عمر مولى غفرة قال : إن الكنز الذي قال الله في السورة التي يذكر فيها الكهف : وكان تحته كنز لهما قال : كان لوحا من ذهب مصمت مكتوبا فيه : بسم الله الرحمن الرحيم ، عجب لمن عرف النار ثم ضحك! عجب لمن أيقن بالقدر ثم نصب! عجب لمن أيقن بالموت ثم أمن! أشهد أن لا إله إلا الله ، وأشهد أن محمدا عبده ورسوله . وحدثني أحمد بن حازم الغفاري ، حدثنا هنادة بنت مالك الشيبانية قالت : سمعت صاحبي حماد بن الوليد الثقفي يقول : سمعت جعفر بن محمد يقول في قول الله تعالى وكان تحته كنز لهما قال : سطران ونصف لم يتم الثالث : عجبت للموقن بالرزق كيف يتعب وعجبت للموقن بالحساب كيف يغفل؟ وعجبت للموقن بالموت كيف يفرح؟ وقد قال تعالى : وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين [ الأنبياء : 47 ] قالت : وذكر أنهما حفظا بصلاح أبيهما ، ولم يذكر منهما صلاح ، وكان بينهما وبين الأب الذي حفظا به سبعة آباء ، وكان نساجا . وهذا الذي ذكره هؤلاء الأئمة ، وورد به الحديث المتقدم وإن صح ، لا ينافي قول عكرمة : أنه كان مالا لأنهم ذكروا أنه كان لوحا من ذهب ، وفيه مال جزيل ، أكثر ما زادوا أنه كان مودعا فيه علم ، وهو حكم ومواعظ ، والله أعلم . وقوله : وكان أبوهما صالحا فيه دليل على أن الرجل الصالح يحفظ في ذريته ، وتشمل بركة عبادته لهم في الدنيا والآخرة ، بشفاعته فيهم ورفع درجتهم إلى أعلى درجة في الجنة لتقر عينه بهم ، كما جاء في القرآن ووردت السنة به . قال سعيد بن جبير عن ابن عباس : حفظا بصلاح أبيهما ، ولم يذكر لهما صلاح ، وتقدم أنه كان الأب السابع . [ فالله أعلم ] وقوله : فأراد ربك أن يبلغا أشدهما ويستخرجا كنزهما : هاهنا أسند الإرادة إلى الله تعالى; لأن بلوغهما الحلم لا يقدر عليه إلا الله; وقال في الغلام : فأردنا أن يبدلهما ربهما خيرا منه وقال في السفينة : فأردت أن أعيبها ، فالله أعلم . وقوله : رحمة من ربك وما فعلته عن أمري أي : هذا الذي فعلته في هذه الأحوال الثلاثة ، إنما هو من رحمة الله بمن ذكرنا من أصحاب السفينة ، ووالدي الغلام ، وولدي الرجل الصالح ، وما فعلته عن أمري لكني أمرت به ووقفت عليه ، وفيه دلالة لمن قال بنبوة الخضر ، عليه السلام ، مع ما تقدم من قوله : فوجدا عبدا من عبادنا آتيناه رحمة من عندنا وعلمناه من لدنا علما . وقال آخرون : كان رسولا . وقيل بل كان ملكا . نقله الماوردي في تفسيره . وذهب كثيرون إلى أنه لم يكن نبيا . بل كان وليا . فالله أعلم . وذكر ابن قتيبة في المعارف أن اسم الخضر بليا بن ملكان بن فالغ بن عامر بن شالخ بن أرفخشذ بن سام بن نوح ، عليه السلام قالوا : وكان يكنى أبا العباس ، ويلقب بالخضر ، وكان من أبناء الملوك ، ذكره النووي في تهذيب الأسماء ، وحكى هو وغيره في كونه باقيا إلى الآن ثم إلى يوم القيامة قولين ، ومال هو وابن الصلاح إلى بقائه ، وذكروا في ذلك حكايات وآثارا عن السلف وغيرهم وجاء ذكره في بعض الأحاديث . ولا يصح شيء من ذلك ، وأشهرها أحاديث التعزية وإسناده ضعيف . ورجح آخرون من المحدثين وغيرهم خلاف ذلك ، واحتجوا بقوله تعالى : وما جعلنا لبشر من قبلك الخلد [ الأنبياء : 34 ] وبقول النبي صلى الله عليه وسلم يوم بدر : \" اللهم إن تهلك هذه العصابة لا تعبد في الأرض \" ، وبأنه لم ينقل أنه جاء إلى رسول الله صلى الله عليه وسلم [ ولا حضر عنده ، ولا قاتل معه . ولو كان حيا لكان من أتباع النبي صلى الله عليه وسلم ] وأصحابه; لأنه عليه السلام كان مبعوثا إلى جميع الثقلين : الجن والإنس ، وقد قال : \" لو كان موسى وعيسى حيين ما وسعهما إلا اتباعي \" وأخبر قبل موته بقليل : أنه لا يبقى ممن هو على وجه الأرض إلى مائة سنة من ليلته تلك عين تطرف ، إلى غير ذلك من الدلائل . قال الإمام أحمد : حدثنا يحيى بن آدم ، حدثنا ابن المبارك ، عن معمر ، عن همام بن منبه ، عن أبي هريرة ، رضي الله عنه ، عن النبي صلى الله عليه وسلم [ في الخضر قال ] إنما سمي \" خضرا \" ; لأنه جلس على فروة بيضاء ، فإذا هي تحته [ تهتز ] خضراء \" . ورواه أيضا عن عبد الرزاق . وقد ثبت أيضا في صحيح البخاري ، عن همام ، عن أبي هريرة ، أن رسول الله صلى الله عليه وسلم قال : \" إنما سمي الخضر ; لأنه جلس على فروة ، فإذا هي تهتز [ من خلفه ] خضراء \" والمراد بالفروة هاهنا الحشيش اليابس ، وهو الهشيم من النبات ، قاله عبد الرزاق . وقيل : المراد بذلك وجه الأرض . وقوله : ذلك تأويل ما لم تسطع عليه صبرا أي : هذا تفسير ما ضقت به ذرعا ، ولم تصبر حتى أخبرك به ابتداء ، ولما أن فسره له وبينه ووضحه وأزال المشكل قال : [ ما لم ] تسطع وقبل ذلك كان الإشكال قويا ثقيلا فقال : سأنبئك بتأويل ما لم تستطع عليه صبرا فقابل الأثقل بالأثقل ، والأخف بالأخف ، كما قال تعالى : فما اسطاعوا أن يظهروه وهو الصعود إلى أعلاه ، وما استطاعوا له نقبا [ الكهف : 97 ] ، وهو أشق من ذلك ، فقابل كلا بما يناسبه لفظا ومعنى والله أعلم . فإن قيل : فما بال فتى موسى ذكر في أول القصة ثم لم يذكر بعد ذلك؟ فالجواب : أن المقصود بالسياق إنما هو قصة موسى مع الخضر وذكر ما كان بينهما ، وفتى موسى معه تبع ، وقد صرح في الأحاديث المتقدمة في الصحاح وغيرها أنه يوشع بن نون ، وهو الذي كان يلي بني إسرائيل بعد موسى ، عليهما السلام . وهذا يدل على ضعف ما أورده ابن جرير في تفسيره حيث قال : حدثنا ابن حميد ، حدثنا سلمة ، حدثني ابن إسحاق ، عن الحسن بن عمارة ، عن أبيه ، عن عكرمة قال : قيل لابن عباس : لم نسمع لفتى موسى بذكر من حديث وقد كان معه؟ فقال ابن عباس فيما يذكر من حديث الفتى قال : شرب الفتى من الماء [ فخلد ، فأخذه ] العالم ، فطابق به سفينة ثم أرسله في البحر ، فإنها تموج به إلى يوم القيامة; وذلك أنه لم يكن له أن يشرب منه فشرب إسناد ضعيف ، والحسن متروك ، وأبوه غير معروف . . . . \"\n                                    ",
        "qortoby": "وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَٰمَيۡنِ يَتِيمَيۡنِ فِي ٱلۡمَدِينَةِ وَكَانَ تَحۡتَهُۥ كَنزٞ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحٗا فَأَرَادَ رَبُّكَ أَن يَبۡلُغَآ أَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةٗ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِيۚ ذَٰلِكَ تَأۡوِيلُ مَا لَمۡ تَسۡطِع عَّلَيۡهِ صَبۡرٗا ٢٨\n                                    \n                                    \n                                    قوله تعالى : وأما الجدار فكان لغلامين هذان الغلامان صغيران بقرينة وصفهما باليتم ، واسمهما أصرم وصريم . وقد قال - عليه الصلاة والسلام - : لا يتم بعد بلوغ هذا هو الظاهر . وقد يحتمل أن يبقى عليهما اسم اليتم بعد البلوغ إن كانا يتيمين ، على معنى الشفقة عليهما . وقد تقدم أن اليتم في الناس من قبل فقد الأب ، وفي غيرهم من الحيوان من قبل فقد الأم .\nودل قوله : في المدينة على أن القرية تسمى مدينة ; ومنه الحديث ( أمرت بقرية تأكل القرى . . . ) وفي حديث الهجرة ( لمن أنت ) فقال الرجل : من أهل المدينة ; يعني مكة .\nقوله تعالى : وكان تحته كنز لهما اختلف الناس في الكنز ; فقال عكرمة وقتادة : كان مالا جسيما وهو الظاهر من اسم الكنز إذ هو في اللغة المال المجموع ; وقد مضى القول فيه . وقال ابن عباس : ( كان علما في صحف مدفونة ) وعنه أيضا قال : ( كان لوحا من ذهب مكتوبا فيه بسم الله الرحمن الرحيم ، عجبت لمن يؤمن بالقدر كيف يحزن ، عجبت لمن يؤمن بالرزق كيف يتعب ، عجبت لمن يؤمن بالموت كيف يفرح ، عجبت لمن يؤمن بالحساب كيف يغفل ، عجبت لمن يؤمن بالدنيا وتقلبها بأهلها كيف يطمئن لها ، لا إله إلا الله محمد رسول الله ) وروي نحوه عن عكرمة وعمر مولى غفرة ، ورواه عثمان بن عفان - رضي الله عنه - عن النبي - صلى الله عليه وسلم - .\nقوله تعالى : وكان أبوهما صالحا ظاهر اللفظ والسابق منه أنه والدهما دنية . وقيل : هو الأب السابع ; قاله جعفر بن محمد . وقيل : العاشر فحفظا فيه وإن لم يذكر بصلاح ; وكان يسمى كاشحا ; قاله مقاتل . اسم أمهما دنيا ; ذكره النقاش . ففيه ما يدل على أن الله - تعالى - يحفظ الصالح في نفسه وفي ولده وإن بعدوا عنه وقد روي أن الله - تعالى - يحفظ الصالح في سبعة من ذريته ; وعلى هذا يدل قوله - تعالى - : إن وليي الله الذي نزل الكتاب وهو يتولى الصالحين\nقوله تعالى : وما فعلته عن أمري يقتضي أن الخضر نبي ; وقد تقدم الخلاف في ذلك .\nذلك تأويل أي تفسير .\nما لم تسطع عليه صبرا قرأت فرقة \" تستطع \" وقرأ الجمهور تسطع قال أبو حاتم : كذا نقرأ كما في خط المصحف . وهنا خمس مسائل :\nالأولى : إن قال قائل لم يسمع لفتى موسى ذكر في أول الآية ولا في آخرها ، قيل له : اختلف في ذلك ; فقال عكرمة لابن عباس : لم يسمع لفتى موسى بذكر وقد كان معه ؟ فقال : ( شرب الفتى من الماء فخلد ، وأخذه العالم فطبق عليه سفينة ثم أرسله في البحر ، وإنها لتموج به فيه إلى يوم القيامة وذلك أنه لم يكن له أن يشرب منه فشرب منه ) قال القشيري : وهذا إن ثبت فليس الفتى يوشع بن نون ; فإن يوشع بن نون قد عمر بعد موسى وكان خليفته ; والأظهر أن موسى صرف فتاه لما لقي الخضر . وقال شيخنا الإمام أبو العباس : يحتمل أن يكون اكتفي بذكر المتبوع عن التابع والله أعلم .\nالثانية : إن قال قائل : كيف أضاف الخضر قصة استخراج كنز الغلامين لله - تعالى - ، وقال في خرق السفينة : فأردت أن أعيبها فأضاف العيب إلى نفسه ؟ قيل له : إنما أسند الإرادة في الجدار إلى الله - تعالى - لأنها في أمر مستأنف في زمن طويل غيب من الغيوب ، فحسن إفراد هذا الموضع بذكر الله - تعالى - ، وإن كان الخضر قد أراد ذلك فالذي أعلمه الله - تعالى - أن يريده وقيل : لما كان ذلك خيرا كله أضافه إلى الله - تعالى - وأضاف عيب السفينة إلى نفسه رعاية للأدب لأنها لفظة عيب فتأدب بأن لم يسند الإرادة فيها إلا إلى نفسه ، كما تأدب إبراهيم - عليه السلام - في قوله : وإذا مرضت فهو يشفين فأسند الفعل قبل وبعد إلى الله - تعالى - ، وأسند إلى نفسه المرض ، إذ هو معنى نقص ومصيبة ، فلا يضاف إليه - سبحانه وتعالى - من الألفاظ إلا ما يستحسن منها دون ما يستقبح ، وهذا كما قال - تعالى - : بيدك الخير واقتصر عليه فلم ينسب الشر إليه ، وإن كان بيده الخير والشر والضر والنفع ، إذ هو على كل شيء قدير ، وهو بكل شيء خبير ، ولا اعتراض بما حكاه - عليه السلام - عن ربه - عز وجل - أنه يقول يوم القيامة : ( يا ابن آدم مرضت فلم تعدني واستطعمتك فلم تطعمني واستسقيتك فلم تسقني ) فإن ذلك تنزل في الخطاب وتلطف في العتاب مقتضاه التعريف بفضل ذي الجلال وبمقادير ثواب هذه الأعمال وقد تقدم هذا المعنى والله - تعالى - أعلم . ولله - تعالى - أن يطلق على نفسه ما يشاء ، ولا نطلق نحن إلا ما أذن لنا فيه من الأوصاف الجميلة والأفعال الشريفة جل وتعالى عن النقائص والآفات علوا كبيرا . وقال في الغلام : فأردنا فكأنه أضاف القتل إلى نفسه ، والتبديل إلى الله - تعالى - والأشد كمال الخلق والعقل . وقد مضى الكلام فيه في \" الأنعام \" والحمد لله .\nالثالثة : قال شيخنا الإمام أبو العباس : ذهب قوم من زنادقة الباطنية إلى سلوك طريق تلزم منه هذه الأحكام الشرعية ، فقالوا : هذه الأحكام الشرعية العامة إنما يحكم بها على الأنبياء والعامة ، وأما الأولياء وأهل الخصوص فلا يحتاجون إلى تلك النصوص ، بل إنما يراد منهم ما يقع في قلوبهم ، ويحكم عليهم بما يغلب عليهم من خواطرهم . وقالوا : وذلك لصفاء قلوبهم عن الأكدار ، وخلوها عن الأعيار ، فتتجلى لهم العلوم الإلهية ، والحقائق الربانية ، فيقفون على أسرار الكائنات ، ويعلمون أحكام الجزئيات ، فيستغنون بها عن أحكام الشرائع الكليات ، كما اتفق للخضر ; فإنه استغنى بما تجلى له من العلوم ، عما كان عند موسى من تلك الفهوم . وقد جاء فيما ينقلون : استفت قلبك وإن أفتاك المفتون . قال شيخنا - رضي الله عنه - : وهذا القول زندقة وكفر يقتل قائله ولا يستتاب ; لأنه إنكار ما علم من الشرائع ; فإن الله - تعالى - قد أجرى سنته ، وأنفذ حكمته ، بأن أحكامه لا تعلم إلا بواسطة رسله السفراء بينه وبين خلقه ، وهم المبلغون عنه رسالته وكلامه ، المبينون شرائعه وأحكامه ; اختارهم لذلك ، وخصهم بما هنالك ; كما قال - تعالى - : الله يصطفي من الملائكة رسلا ومن الناس إن الله سميع بصير وقال - تعالى - : الله أعلم حيث يجعل رسالته وقال - تعالى - : كان الناس أمة واحدة فبعث الله النبيين مبشرين ومنذرين إلى غير ذلك من الآيات . وعلى الجملة فقد حصل العلم القطعي ، واليقين الضروري ، واجتماع السلف والخلف على أن لا طريق لمعرفة أحكام الله - تعالى - التي هي راجعة إلى أمره ونهيه ، ولا يعرف شيء منها إلا من جهة الرسل ، فمن قال : إن هناك طريقا آخر يعرف بها أمره ونهيه غير الرسل بحيث يستغنى عن الرسل فهو كافر ، يقتل ولا يستتاب ، ولا يحتاج معه إلى سؤال ولا جواب ، ثم هو قول بإثبات أنبياء بعد نبينا - عليه الصلاة والسلام - ; الذي قد جعله الله خاتم أنبيائه ورسله ، فلا نبي بعده ولا رسول . وبيان ذلك أن من قال يأخذ عن قلبه وأن ما يقع فيه حكم الله - تعالى - وأنه يعمل بمقتضاه ، وأنه لا يحتاج مع ذلك إلى كتاب ولا سنة ، فقد أثبت لنفسه خاصة النبوة ، فإن هذا نحو ما قاله - عليه الصلاة والسلام - : إن روح القدس نفث في روعي . . . الحديث .\nالرابعة : ذهب الجمهور من الناس إلى أن الخضر مات - صلى الله عليه وسلم - . وقالت فرقة : حي لأنه شرب من عين الحياة ، وأنه باق في الأرض وأنه يحج البيت . قال ابن عطية : وقد أطنب النقاش في هذا المعنى ، وذكر في كتابه أشياء كثيرة عن علي بن أبي طالب وغيره ، وكلها لا تقوم على ساق . ولو كان الخضر - عليه السلام - حيا يحج لكان له في ملة الإسلام ظهور ; والله العليم بتفاصيل الأشياء لا رب غيره . ومما يقضي بموت الخضر - عليه السلام - الآن قوله - عليه الصلاة السلام - : أرأيتكم ليلتكم هذه فإنه على رأس مائة سنة منها لا يبقى ممن هو اليوم على ظهر الأرض أحد .\nقلت : إلى هذا ذهب البخاري واختاره القاضي أبو بكر بن العربي ، والصحيح القول الثاني وهو أنه حي على ما نذكره . والحديث خرجه مسلم في صحيحه عن عبد الله بن عمر قال صلى بنا رسول الله - صلي الله عليه وسلم - ذات ليلة صلاة العشاء في آخر حياته فلما سلم قام فقال : أرأيتكم ليلتكم هذه فإن على رأس مائة سنة منها لا يبقى ممن هو على ظهر الأرض أحد قال ابن عمر : فوهل الناس في مقالة رسول الله - صلى الله عليه وسلم - تلك فيما يتحدثون من هذه الأحاديث عن مائة سنة ; وإنما قال - عليه الصلاة والسلام - : لا يبقى ممن هو اليوم على ظهر الأرض أحد يريد بذلك أن ينخرم ذلك القرن . ورواه أيضا من حديث جابر بن عبد الله قال سمعت رسول الله - صلى الله عليه وسلم - يقول قبل أن يموت بشهر : تسألوني عن الساعة وإنما علمها عند الله وأقسم بالله ما على الأرض من نفس منفوسة تأتي عليها مائة سنة وفي أخرى قال سالم : تذاكرنا أنها هي مخلوقة يومئذ . وفي أخرى : ما من نفس منفوسة اليوم يأتي عليها مائة سنة وهي حية يومئذ . وفسرها عبد الرحمن صاحب السقاية قال : نقص العمر . وعن أبي سعيد الخدري نحو هذا الحديث قال علماؤنا : وحاصل ما تضمنه هذا الحديث أنه - عليه الصلاة والسلام - أخبر قبل موته بشهر أن كل من كان من بني آدم موجودا في ذلك لا يزيد عمره على مائة سنة ; لقوله - عليه الصلاة والسلام - : ما من نفس منفوسة وهذا اللفظ لا يتناول الملائكة ولا الجن إذ لم يصح عنهم أنهم كذلك ، ولا الحيوان غير العاقل ; لقوله : ممن هو على ظهر الأرض أحد وهذا إنما يقال بأصل وضعه على من يعقل ، فتعين أن المراد بنو آدم . وقد بين ابن عمر هذا المعنى ; فقال : يريد بذلك أن ينخرم ذلك القرن . ولا حجة لمن استدل به على بطلان قول من يقول : إن الخضر حي لعموم قوله : ما من نفس منفوسة لأن العموم وإن كان مؤكد الاستغراق فليس نصا فيه ، بل هو قابل للتخصيص . فكما لم يتناول عيسى - عليه السلام - ، فإنه لم يمت ولم يقتل فهو حي بنص القرآن ومعناه ، ولا يتناول الدجال مع أنه حي بدليل حديث الجساسة ، فكذلك لم يتناول الخضر - عليه السلام - وليس مشاهدا للناس ، ولا ممن يخالطهم حتى يخطر ببالهم حالة مخاطبة بعضهم بعضا ، فمثل هذا العموم لا يتناوله . وقد قيل : إن أصحاب الكهف أحياء ويحجون مع عيسى - عليه الصلاة والسلام - ، كما تقدم . وكذلك فتى موسى في قول ابن عباس كما ذكرنا . وقد ذكر أبو إسحاق الثعلبي في كتاب العرائس له : والصحيح أن الخضر نبي معمر محجوب عن الأبصار ; وروى محمد بن المتوكل عن ضمرة بن ربيعة عن عبد الله بن شوذب قال : الخضر - عليه السلام - من ولد فارس ، وإلياس من بني إسرائيل يلتقيان كل عام في الموسم . وعن عمرو بن دينار قال : إن الخضر وإلياس لا يزالان حيين في الأرض ما دام القرآن على الأرض ، فإذا رفع ماتا . وقد ذكر شيخنا الإمام أبو محمد عبد المعطي بن محمود بن عبد المعطي اللخمي في شرح الرسالة له للقشيري حكايات كثيرة عن جماعة من الصالحين والصالحات بأنهم رأوا الخضر - عليه السلام - ولقوه ، يفيد مجموعها غاية الظن بحياته مع ما ذكره النقاش والثعلبي وغيرهما . وقد جاء في صحيح مسلم : أن الدجال ينتهي إلى بعض السباخ التي تلي المدينة فيخرج إليه يومئذ رجل هو خير الناس - أو - من خير الناس . . . الحديث ; وفي آخره قال أبو إسحاق : يعني أن هذا الرجل هو الخضر . وذكر ابن أبي الدنيا في كتاب الهواتف : بسند يوقفه إلى علي بن أبي طالب - رضي الله تعالى عنه - ( أنه لقي الخضر وعلمه هذا الدعاء ، وذكر أن فيه ثوابا عظيما ومغفرة ورحمة لمن قاله في أثر كل صلاة ، وهو : يا من لا يشغله سمع عن سمع ، ويا من لا تغلطه المسائل ، ويا من لا يتبرم من إلحاح الملحين ، أذقني برد عفوك ، وحلاوة مغفرتك ) وذكر أيضا عن عمر بن الخطاب - رضي الله عنه - في هذا الدعاء بعينه نحوا مما ذكر عن علي بن أبي طالب - رضي الله تعالى عنه - في سماعه من الخضر . وذكر أيضا اجتماع إلياس مع النبي - عليه الصلاة والسلام - . وإذا جاز بقاء إلياس إلى عهد النبي - صلى الله عليه وسلم - جاز بقاء الخضر ، وقد ذكر أنهما يجتمعان عند البيت في كل حول ، وأنهما يقولان عند افتراقهما : ( ما شاء الله ما شاء الله ، لا يصرف السوء إلا الله ، ما شاء الله ما شاء الله ، ما يكون من نعمة فمن الله ، ما شاء الله ما شاء الله ، توكلت على الله ، حسبنا الله ونعم الوكيل ) وأما خبر إلياس فيأتي في \" الصافات \" إن شاء الله - تعالى - .\nوذكر أبو عمر بن عبد البر في كتاب التمهيد : عن علي - رضي الله تعالى عنه - قال : ( لما توفي النبي - صلى الله عليه وسلم - وسجي بثوب هتف هاتف من ناحية البيت يسمعون صوته ولا يرون شخصه : السلام عليكم ورحمة الله وبركاته ، السلام عليكم أهل البيت كل نفس ذائقة الموت - الآية - إن في الله خلفا من كل هالك ، وعوضا من كل تالف ، وعزاء من كل مصيبة ، فبالله فثقوا ، وإياه فارجوا ، فإن المصاب من حرم الثواب ) فكانوا يرون أنه الخضر - عليه الصلاة والسلام - . يعني أصحاب النبي - عليه الصلاة والسلام - . والألف واللام في قوله : على الأرض للعهد لا للجنس وهي أرض العرب ، بدليل تصرفهم فيها وإليها غالبا دون أرض يأجوج ومأجوج ، وأقاصي جزر الهند والسند مما لا يقرع السمع اسمه ، ولا يعلم علمه . ولا جواب عن الدجال .\nقال السهيلي : واختلف في اسم الخضر اختلافا متباينا ; فعن ابن منبه أنه قال : أبليا بن ملكان بن فالغ بن شالخ بن أرفخشذ بن سام بن نوح . وقيل : هو ابن عاميل بن سماقحين بن أريا بن علقما بن عيصو بن إسحاق ، وأن أباه كان ملكا ، وأن أمه كانت بنت فارس واسمها ألمى ، وأنها ولدته في مغارة ، وأنه وجد هنالك وشاة ترضعه في كل يوم من غنم رجل من القرية ، فأخذه الرجل فرباه ، فلما شب وطلب الملك - أبوه - كاتبا وجمع أهل المعرفة والنبالة ليكتب الصحف التي أنزلت على إبراهيم وشيث ، كان ممن أقدم عليه من الكتاب ابنه الخضر وهو لا يعرفه ، فلما استحسن خطه ومعرفته ، وبحث عن جلية أمره عرف أنه ابنه فضمه لنفسه وولاه أمر الناس ثم إن الخضر فر من الملك لأسباب يطول ذكرها إلى أن وجد عين الحياة فشرب منها ، فهو حي إلى أن يخرج الدجال ، وأنه الرجل الذي يقتله الدجال ويقطعه ثم يحييه الله - تعالى - . وقيل : لم يدرك زمن النبي - صلى الله عليه وسلم - ; وهذا لا يصح وقال البخاري وطائفة من أهل الحديث منهم شيخنا أبو بكر بن العربي - رحمه الله تعالى - : إنه مات قبل انقضاء المائة ، من قوله - عليه الصلاة والسلام - : إلى رأس مائة عام لا يبقى على هذه الأرض ممن هو عليها أحد يعني من كان حيا حين قال هذه المقالة\nقلت : قد ذكرنا هذا الحديث والكلام عليه ، وبينا حياة الخضر إلى الآن ، والله أعلم .\nالخامسة : قيل إن الخضر لما ذهب يفارق موسى قال له موسى : أوصني ; قال : كن بساما ولا تكن ضحاكا ، ودع اللجاجة ، ولا تمش في غير حاجة ، ولا تعب على الخطائين خطاياهم وابك على خطيئتك يا ابن عمران .\n                                    ",
        "saadi": "وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَٰمَيۡنِ يَتِيمَيۡنِ فِي ٱلۡمَدِينَةِ وَكَانَ تَحۡتَهُۥ كَنزٞ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحٗا فَأَرَادَ رَبُّكَ أَن يَبۡلُغَآ أَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةٗ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِيۚ ذَٰلِكَ تَأۡوِيلُ مَا لَمۡ تَسۡطِع عَّلَيۡهِ صَبۡرٗا ٢٨\n                                        \n                                        \n                                        \n                                        { وَأَمَّا الْجِدَارُ ْ} الذي أقمته { فَكَانَ لِغُلَامَيْنِ يَتِيمَيْنِ فِي الْمَدِينَةِ وَكَانَ تَحْتَهُ كَنْزٌ لَهُمَا وَكَانَ أَبُوهُمَا صَالِحًا ْ} أي: حالهما تقتضي الرأفة بهما ورحمتهما، لكونهما صغيرين عدما أباهما، وحفظهما الله أيضا بصلاح والدهما.\n{ فَأَرَادَ رَبُّكَ أَنْ يَبْلُغَا أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنْزَهُمَا ْ} أي: فلهذا هدمت الجدار، واستخرجت ما تحته من كنزهما، وأعدته مجانا.\n{ رَحْمَةً مِنْ رَبِّكَ ْ} أي: هذا الذي فعلته رحمة من الله، آتاها الله عبده الخضر { وَمَا فَعَلْتُهُ عَنْ أَمْرِي ْ} أي: أتيت شيئا من قبل نفسي، ومجرد إرادتي، وإنما ذلك من رحمة الله وأمره.\n{ ذَلِكَ ْ} الذي فسرته لك { تَأْوِيلُ مَا لَمْ تَسْطِعْ عَلَيْهِ صَبْرًا ْ} وفي هذه القصة العجيبة الجليلة، من الفوائد والأحكام والقواعد شيء كثير، ننبه على بعضه بعون الله. فمنها فضيلة العلم، والرحلة في طلبه، وأنه أهم الأمور، فإن موسى عليه السلام رحل مسافة طويلة، ولقي النصب في طلبه، وترك القعود عند بني إسرائيل، لتعليمهم وإرشادهم، واختار السفر لزيادة العلم على ذلك.\nومنها: البداءة بالأهم فالأهم، فإن زيادة العلم وعلم الإنسان أهم من ترك ذلك، والاشتغال بالتعليم من دون تزود من العلم، والجمع بين الأمرين أكمل.\nومنها: جواز أخذ الخادم في الحضر والسفر لكفاية المؤن، وطلب الراحة، كما فعل موسى.\nومنها: أن المسافر لطلب علم أو جهاد أو نحوه، إذا اقتضت المصلحة الإخبار بمطلبه، وأين يريده، فإنه أكمل من كتمه، فإن في إظهاره فوائد من الاستعداد له عدته، وإتيان الأمر على بصيرة، وإظهارًا لشرف هذه العبادة الجليلة، كما قال موسى: { لَا أَبْرَحُ حَتَّى أَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ أَوْ أَمْضِيَ حُقُبًا ْ}\nوكما أخبر النبي صلى الله عليه وسلم أصحابه حين غزا تبوك بوجهه، مع أن عادته التورية، وذلك تبع للمصلحة.\nومنها: إضافة الشر وأسبابه إلى الشيطان، على وجه التسويل والتزيين، وإن كان الكل بقضاء الله وقدره، لقول فتى موسى: { وَمَا أَنْسَانِيهُ إِلَّا الشَّيْطَانُ أَنْ أَذْكُرَهُ ْ}\nومنها: جواز إخبار الإنسان عما هو من مقتضى طبيعة النفس، من نصب أو جوع، أو عطش، إذا لم يكن على وجه التسخط وكان صدقا، لقول موسى: { لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا ْ}\nومنها: استحباب كون خادم الإنسان، ذكيا فطنا كيسا، ليتم له أمره الذي يريده.\nومنها: استحباب إطعام الإنسان خادمه من مأكله، وأكلهما جميعا، لأن ظاهر قوله: { آتِنَا غَدَاءَنَا ْ} إضافة إلى الجميع، أنه أكل هو وهو جميعا.\nومنها: أن المعونة تنزل على العبد على حسب قيامه بالمأمور به، وأن الموافق لأمر الله، يعان ما لا يعان غيره لقوله: { لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَذَا نَصَبًا ْ} والإشارة إلى السفر المجاوز، لمجمع البحرين، وأما الأول، فلم يشتك منه التعب، مع طوله، لأنه هو السفرعلى الحقيقة. وأما الأخير، فالظاهر أنه بعض يوم، لأنهم فقدوا الحوت حين أووا إلى الصخرة، فالظاهر أنهم باتوا عندها، ثم ساروا من الغد، حتى إذا جاء وقت الغداء قال موسى لفتاه { آتِنَا غَدَاءَنَا ْ} فحينئذ تذكر أنه نسيه في الموضع الذي إليه منتهى قصده.\nومنها: أن ذلك العبد الذي لقياه، ليس نبيا، بل عبدا صالحا، لأنه وصفه بالعبودية، وذكر منة الله عليه بالرحمة والعلم، ولم يذكر رسالته ولا نبوته، ولو كان نبيا، لذكر ذلك كما ذكره غيره.\nوأما قوله في آخر القصة: { وَمَا فَعَلْتُهُ عَنْ أَمْرِي ْ} فإنه لا يدل على أنه نبي وإنما يدل على الإلهام والتحديث، كما يكون لغير الأنبياء، كما قال تعالى { وَأَوْحَيْنَا إِلَى أُمِّ مُوسَى أَنْ أَرْضِعِيهِ ْ} { وَأَوْحَى رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا ْ}\nومنها: أن العلم الذي يعلمه الله [لعباده] نوعان:\nعلم مكتسب يدركه العبد بجده واجتهاده. ونوع علم لدني، يهبه الله لمن يمن عليه من عباده لقوله { وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا ْ}\nومنها: التأدب مع المعلم، وخطاب المتعلم إياه ألطف خطاب، لقول موسى عليه السلام:\n{ هَلْ أَتَّبِعُكَ عَلَى أَنْ تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا ْ} فأخرج الكلام بصورة الملاطفة والمشاورة، وأنك هل تأذن لي في ذلك أم لا، وإقراره بأنه يتعلم منه، بخلاف ما عليه أهل الجفاء أو الكبر، الذي لا يظهر للمعلم افتقارهم إلى علمه، بل يدعي أنه يتعاون هم وإياه، بل ربما ظن أنه يعلم معلمه، وهو جاهل جدا، فالذل للمعلم، وإظهار الحاجة إلى تعليمه، من أنفع شيء للمتعلم.\nومنها تواضع الفاضل للتعلم ممن دونه، فإن موسى -بلا شك- أفضل من الخضر.\nومنها: تعلم العالم الفاضل للعلم الذي لم يتمهر فيه، ممن مهر فيه، وإن كان دونه في العلم بدرجات كثيرة.\nفإن موسى عليه السلام من أولي العزم من المرسلين، الذين منحهم الله وأعطاهم من العلم ما لم يعط سواهم، ولكن في هذا العلم الخاص كان عند الخضر، ما ليس عنده، فلهذا حرص على التعلم منه.\nفعلى هذا، لا ينبغي للفقيه المحدث، إذا كان قاصرا في علم النحو، أو الصرف، أو نحوه من العلوم، أن لا يتعلمه ممن مهر فيه، وإن لم يكن محدثا ولا فقيها.\nومنها: إضافة العلم وغيره من الفضائل لله تعالى، والإقرار بذلك، وشكر الله عليها لقوله: { تُعَلِّمَنِ مِمَّا عُلِّمْتَ ْ} أي: مما علمك الله تعالى.\nومنها: أن العلم النافع، هو العلم المرشد إلى الخير، فكل علم يكون فيه رشد وهداية لطرق الخير، وتحذير عن طريق الشر، أو وسيلة لذلك، فإنه من العلم النافع، وما سوى ذلك، فإما أن يكون ضارا، أو ليس فيه فائدة لقوله: { أَنْ تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا ْ}\nومنها: أن من ليس له قوة الصبر على صحبة العالم والعلم، وحسن الثبات على ذلك، أنه يفوته بحسب عدم صبره كثير من العلم فمن لا صبر له لا يدرك العلم، ومن استعمل الصبر ولازمه، أدرك به كل أمر سعى فيه، لقول الخضر -يعتذر من موسى بذكر المانع لموسى في الأخذ عنه- إنه لا يصبر معه.\nومنها: أن السبب الكبير لحصول الصبر، إحاطة الإنسان علما وخبرة، بذلك الأمر، الذي أمر بالصبر عليه، وإلا فالذي لا يدريه، أو لا يدري غايته ولا نتيجته، ولا فائدته وثمرته ليس عنده سبب الصبر لقوله: { وَكَيْفَ تَصْبِرُ عَلَى مَا لَمْ تُحِطْ بِهِ خُبْرًا ْ} فجعل الموجب لعدم صبره، وعدم إحاطته خبرا بالأمر.\nومنها: الأمر بالتأني والتثبت، وعدم المبادرة إلى الحكم على الشيء، حتى يعرف ما يراد منه وما هو المقصود.\nومنها: تعليق الأمور المستقبلية التي من أفعال العباد بالمشيئة، وأن لا يقول الإنسان للشيء: إني فاعل ذلك في المستقبل، إلا أن يقول { إِنْ شَاءَ اللَّهُ ْ}\nومنها: أن العزم على فعل الشيء، ليس بمنزلة فعله، فإن موسى قال: { سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا ْ} فوطن نفسه على الصبر ولم يفعل.\nومنها: أن المعلم إذا رأى المصلحة في إيزاعه للمتعلم أن يترك الابتداء في السؤال عن بعض الأشياء، حتى يكون المعلم هو الذي يوقفه عليها، فإن المصلحة تتبع، كما إذا كان فهمه قاصرا، أو نهاه عن الدقيق في سؤال الأشياء التي غيرها أهم منها، أو لا يدركها ذهنه، أو يسأل سؤالا، لا يتعلق في موضع البحث.\nومنها: جواز ركوب البحر، في غير الحالة التي يخاف منها.\nومنها: أن الناسي غير مؤاخذ بنسيانه لا في حق الله، ولا في حقوق العباد لقوله: { لَا تُؤَاخِذْنِي بِمَا نَسِيتُ ْ}\nومنها: أنه ينبغي للإنسان أن يأخذ من أخلاق الناس ومعاملاتهم، العفو منها، وما سمحت به أنفسهم، ولا ينبغي له أن يكلفهم ما لا يطيقون، أو يشق عليهم ويرهقهم، فإن هذا مدعاة إلى النفور منه والسآمة، بل يأخذ المتيسر ليتيسر له الأمر.\nومنها: أن الأمور تجري أحكامها على ظاهرها، وتعلق بها الأحكام الدنيوية، في الأموال، والدماء وغيرها، فإن موسى عليه السلام، أنكر على الخضر خرقه السفينة، وقتل الغلام، وأن هذه الأمور ظاهرها، أنها من المنكر، وموسى عليه السلام لا يسعه السكوت عنها، في غير هذه الحال، التي صحب عليها الخضر، فاستعجل عليه السلام، وبادر إلى الحكم في حالتها العامة، ولم يلتفت إلى هذا العارض، الذي يوجب عليه الصبر، وعدم المبادرة إلى الإنكار.\nومنها: القاعدة الكبيرة الجليلة وهو أنه \" يدفع الشر الكبير بارتكاب الشر الصغير \" ويراعي أكبر المصلحتين، بتفويت أدناهما، فإن قتل الغلام شر، ولكن بقاءه حتى يفتن أبويه عن دينهما، أعظم شرا منه، وبقاء الغلام من دون قتل وعصمته، وإن كان يظن أنه خير، فالخير ببقاء دين أبويه، وإيمانهما خير من ذلك، فلذلك قتله الخضر، وتحت هذه القاعدة من الفروع والفوائد، ما لا يدخل تحت الحصر، فتزاحم المصالح والمفاسد كلها، داخل في هذا.\nومنها: القاعدة الكبيرة أيضا وهي أن \" عمل الإنسان في مال غيره، إذا كان على وجه المصلحة وإزالة المفسدة، أنه يجوز، ولو بلا إذن حتى ولو ترتب على عمله إتلاف بعض مال الغير \" كما خرق الخضر السفينة لتعيب، فتسلم من غصب الملك الظالم. فعلى هذا لو وقع حرق، أو غرق، أو نحوهما، في دار إنسان أو ماله، وكان إتلاف بعض المال، أو هدم بعض الدار، فيه سلامة للباقي، جاز للإنسان بل شرع له ذلك، حفظا لمال الغير، وكذلك لو أراد ظالم أخذ مال الغير، ودفع إليه إنسان بعض المال افتداء للباقي جاز، ولو من غير إذن.\nومنها: أن العمل يجوز في البحر، كما يجوز في البر لقوله: { يَعْمَلُونَ فِي الْبَحْرِ ْ} ولم ينكر عليهم عملهم.\nومنها: أن المسكين قد يكون له مال لا يبلغ كفايته، ولا يخرج بذلك عن اسم المسكنة، لأن الله أخبر أن هؤلاء المساكين، لهم سفينة.\nومنها: أن القتل من أكبر الذنوب لقوله في قتل الغلام { لَقَدْ جِئْتَ شَيْئًا نُكْرًا ْ}\nومنها: أن القتل قصاصا غير منكر لقوله { بِغَيْرِ نَفْسٍ ْ}\nومنها: أن العبد الصالح يحفظه الله في نفسه، وفي ذريته.\nومنها: أن خدمة الصالحين، أو من يتعلق بهم، أفضل من غيرها، لأنه علل استخراج كنزهما، وإقامة جدارهما، أن أباهما صالح.\nومنها: استعمال الأدب مع الله تعالى في الألفاظ، فإن الخضر أضاف عيب السفينة إلى نفسه بقوله { فَأَرَدْتُ أَنْ أَعِيبَهَا ْ} وأما الخير، فأضافه إلى الله تعالى لقوله: { فَأَرَادَ رَبُّكَ أَنْ يَبْلُغَا أَشُدَّهُمَا وَيَسْتَخْرِجَا كَنْزَهُمَا رَحْمَةً مِنْ رَبِّكَ ْ} كما قال إبراهيم عليه السلام { وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ ْ} وقالت الجن: { وَأَنَّا لَا نَدْرِي أَشَرٌّ أُرِيدَ بِمَنْ فِي الْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا ْ} مع أن الكل بقضاء الله وقدره.\nومنها: أنه ينبغي للصاحب أن لا يفارق صاحبه في حالة من الأحوال، ويترك صحبته، حتى يعتبه، ويعذر منه، كما فعل الخضر مع موسى.\nومنها: أن موافقة الصاحب لصاحبه، في غير الأمور المحذورة، مدعاة وسبب لبقاء الصحبة وتأكدها، كما أن عدم الموافقة سبب لقطع المرافقة.\nومنها: أن هذه القضايا التي أجراها الخضر هي قدر محض أجراها الله وجعلها على يد هذا العبد الصالح، ليستدل العباد بذلك على ألطافه في أقضيته، وأنه يقدر على العبد أمورا يكرهها جدا، وهي صلاح دينه، كما في قضية الغلام، أو وهي صلاح دنياه كما في قضية السفينة، فأراهم نموذجا من لطفه وكرمه، ليعرفوا ويرضوا غاية الرضا بأقداره المكروهة.\n                                    "
      },
      "originalText": "وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَٰمَيۡنِ يَتِيمَيۡنِ فِي ٱلۡمَدِينَةِ وَكَانَ تَحۡتَهُۥ كَنزٞ لَّهُمَا وَكَانَ أَبُوهُمَا صَٰلِحٗا فَأَرَادَ رَبُّكَ أَن يَبۡلُغَآ أَشُدَّهُمَا وَيَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةٗ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِيۚ ذَٰلِكَ تَأۡوِيلُ مَا لَمۡ تَسۡطِع عَّلَيۡهِ صَبۡرٗا ٢٨"
    },
    {
      "number": 2223,
      "text": "وَيَسْأَلُونَكَ عَنْ ذِي الْقَرْنَيْنِ ۖ قُلْ سَأَتْلُو عَلَيْكُمْ مِنْهُ ذِكْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 83,
      "juz": 16,
      "manzil": 4,
      "page": 302,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَسۡ‍َٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا ٣٨\n                                    \n                                    \n                                    يقول تعالى لنبيه صلى الله عليه وسلم : ( ويسألونك ) يا محمد ( عن ذي القرنين ) أي : عن خبره . وقد قدمنا أنه بعث كفار مكة إلى أهل الكتاب يسألون منهم ما يمتحنون به النبي صلى الله عليه وسلم ، فقالوا : سلوه عن رجل طواف في الأرض ، وعن فتية لا يدرى ما صنعوا ، وعن الروح ، فنزلت سورة الكهف .\nوقد أورد ابن جرير هاهنا ، والأموي في مغازيه ، حديثا أسنده وهو ضعيف ، عن عقبة بن عامر ، أن نفرا من اليهود جاءوا يسألون النبي صلى الله عليه وسلم عن ذي القرنين ، فأخبرهم بما جاءوا له ابتداء ، فكان فيما أخبرهم به : \" أنه كان شابا من الروم ، وأنه بنى الإسكندرية ، وأنه علا به ملك في السماء ، وذهب به إلى السد ، ورأى أقواما وجوههم مثل وجوه الكلاب \" . وفيه طول ونكارة ، ورفعه لا يصح ، وأكثر ما فيه أنه من أخبار بني إسرائيل . والعجب أن أبا زرعة الرازي ، مع جلالة قدره ، ساقه بتمامه في كتابه دلائل النبوة ، وذلك غريب منه ، وفيه من النكارة أنه من الروم ، وإنما الذي كان من الروم الإسكندر الثاني ابن فيليبس المقدوني ، الذي تؤرخ به الروم ، فأما الأول فقد ذكره الأزرقي وغيره أنه طاف بالبيت مع إبراهيم الخليل ، عليه السلام ، أول ما بناه وآمن به واتبعه ، وكان معه الخضر ، عليه السلام ، وأما الثاني فهو ، إسكندر بن فيليبس المقدوني اليوناني ، وكان وزيره أرسطاطاليس الفيلسوف المشهور ، والله أعلم . وهو الذي تؤرخ به من مملكته ملة الروم . وقد كان قبل المسيح ، عليه السلام ، بنحو من ثلاثمائة سنة ، فأما الأول المذكور في القرآن فكان في زمن الخليل ، كما ذكره الأزرقي وغيره ، وأنه طاف مع الخليل بالبيت العتيق لما بناه إبراهيم ، عليه السلام ، وقرب إلى الله قربانا ، وقد ذكرنا طرفا من أخباره في كتاب \" البداية والنهاية \" ، بما فيه كفاية ولله الحمد .\nوقال وهب بن منبه : كان ملكا ، وإنما سمي ذا القرنين ؛ لأن صفحتي رأسه كانتا من نحاس ، قال : وقال بعض أهل الكتاب : لأنه ملك الروم وفارس . وقال بعضهم : كان في رأسه شبه القرنين ، وقال سفيان الثوري عن حبيب بن أبي ثابت ، عن أبي الطفيل قال : سئل علي ، رضي الله عنه ، عن ذي القرنين ، فقال : كان عبدا ناصح الله فناصحه ، دعا قومه إلى الله فضربوه على قرنه فمات ، فأحياه الله ، فدعا قومه إلى الله فضربوه على قرنه فمات ، فسمي ذا القرنين .\nوكذا رواه شعبة ، عن القاسم بن أبي بزة عن أبي الطفيل ، سمع عليا يقول ذلك .\nويقال : إنه إنما سمي ذا القرنين ؛ لأنه بلغ المشارق والمغارب ، من حيث يطلع قرن الشمس ويغرب .\n                                    ",
        "qortoby": "وَيَسۡ‍َٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا ٣٨\n                                    \n                                    \n                                    قوله تعالى : ويسألونك عن ذي القرنين قل سأتلو عليكم منه ذكرا قال ابن إسحاق : وكان من خبر ذي القرنين أنه أوتي ما لم يؤت غيره ، فمدت له الأسباب حتى انتهى من البلاد إلى مشارق الأرض ومغاربها ، لا يطأ أرضا إلا سلط على أهلها ، حتى انتهى من المشرق والمغرب إلى ما ليس وراءه شيء من الخلق . قال ابن إسحاق : حدثني من يسوق الأحاديث عن الأعاجم فيما توارثوا من علم ذي القرنين أن ذا القرنين كان من أهل مصر اسمه مرزبان بن مردبة اليوناني من ولد يونان بن يافث بن نوح . قال ابن هشام : واسمه الإسكندر وهو الذي بنى الإسكندرية فنسبت إليه . قال ابن إسحاق : وقد حدثني ثور بن يزيد عن خالد بن معدان الكلاعي - وكان خالد رجلا قد أدرك الناس - أن رسول الله - صلى الله عليه وسلم - سئل عن ذي القرنين فقال : ملك مسح الأرض من تحتها بالأسباب وقال خالد : وسمع عمر بن الخطاب - رضي الله تعالى عنه - رجلا يقول يا ذا القرنين ، فقال : ( اللهم غفرا أما رضيتم أن تسموا بأسماء الأنبياء حتى تسميتم بأسماء الملائكة ) قال ابن إسحاق : فالله أعلم أي ذلك كان ؟ أقال رسول الله - صلى الله عليه وسلم - ذلك أم لا ؟ والحق ما قال .\nقلت : وقد روي عن علي بن أبي طالب - رضي الله تعالى عنه - مثل قول عمر ; سمع رجلا يدعو آخر يا ذا القرنين ، فقال علي : ( أما كفاكم أن تسميتم بأسماء الأنبياء حتى تسميتم بأسماء الملائكة ) وعنه أنه عبد ملك ( بكسر اللام ) صالح نصح الله فأيده . وقيل : هو نبي مبعوث فتح الله - تعالى - على يديه الأرض . وذكر الدارقطني في كتاب الأخبار أن ملكا يقال له رباقيل كان ينزل على ذي القرنين ، وذلك الملك هو الذي يطوي الأرض يوم القيامة ، وينقضها فتقع أقدام الخلائق كلهم بالساهرة ; فيما ذكر بعض أهل العلم . وقال السهيلي : وهذا مشاكل بتوكيله بذي القرنين الذي قطع الأرض مشارقها ومغاربها ; كما أن قصة خالد بن سنان في تسخير النار له مشاكلة بحال الملك الموكل بها ، وهو مالك - عليه السلام - وعلى جميع الملائكة أجمعين . ذكر ابن أبي خيثمة في كتاب البدء له خالد بن سنان العبسي وذكر نبوته ، وذكر أنه وكل به من الملائكة مالك خازن النار ، وكان من أعلام نبوته أن نارا يقال لها نار الحدثان ، كانت تخرج على الناس من مغارة فتأكل الناس ولا يستطيعون ردها ، فردها خالد بن سنان فلم تخرج بعد . واختلف في اسم ذي القرنين وفي السبب الذي سمي به بذلك اختلافا كثيرا ; فأما اسمه فقيل : هو الإسكندر الملك اليوناني المقدوني ، وقد تشدد قافه فيقال : المقدوني . وقيل : اسمه هرمس . ويقال : اسمه هرديس . وقال ابن هشام : هو الصعب بن ذي يزن الحميري من ولد وائل بن حمير ; وقد تقدم قول ابن إسحاق . وقال وهب بن منبه : هو رومي . وذكر الطبري حديثا عن النبي - عليه الصلاة والسلام - أن ذا القرنين شاب من الروم وهو حديث واهي السند ; قاله ابن عطية . قال السهيلي : والظاهر من علم الأخبار أنهما اثنان : أحدهما : كان على عهد إبراهيم - عليه السلام - ، ويقال : إنه الذي قضى لإبراهيم - عليه السلام - حين تحاكموا إليه في بئر السبع بالشام . والآخر : أنه كان قريبا من عهد عيسى - عليه السلام - . وقيل : إنه أفريدون الذي قتل بيوراسب بن أرونداسب الملك الطاغي على عهد إبراهيم - عليه السلام - ، أو قبله بزمان . وأما الاختلاف في السبب الذي سمي به ، فقيل : إنه كان ذا ضفيرتين من شعر فسمي بهما ; ذكره الثعلبي وغيره . والضفائر قرون الرأس ; ومنه قول الشاعر :\nفلثمت فاها آخذا بقرونها شرب النزيف ببرد ماء الحشرج\nوقيل : إنه رأى في أول ملكه كأنه قابض على قرني الشمس ، فقص ذلك ، ففسر أنه سيغلب ما ذرت عليه الشمس ، فسمي بذلك ذا القرنين . وقيل : إنما سمي بذلك لأنه بلغ المغرب والمشرق فكأنه حاز قرني الدنيا . وقالت طائفة : إنه لما بلغ مطلع الشمس كشف بالرؤية قرونها فسمي بذلك ذا القرنين ; أو قرني الشيطان بها . وقال وهب بن منبه : كان له قرنان تحت عمامته . وسأل ابن الكواء عليا - رضي الله تعالى عنه - عن ذي القرنين أنبيا كان أم ملكا ؟ فقال : ( لا ذا ولا ذا ، كان عبدا صالحا دعا قومه إلى الله - تعالى - فشجوه على قرنه ، ثم دعاهم فشجوه على قرنه الآخر ، فسمي ذا القرنين ) واختلفوا أيضا في وقت زمانه ، فقال قوم : كان بعد موسى . وقال قوم : كان في الفترة بعد عيسى وقيل : كان في وقت إبراهيم وإسماعيل . وكان الخضر - عليه السلام - صاحب لوائه الأعظم ; وقد ذكرناه في \" البقرة \" . وبالجملة فإن الله - تعالى - مكنه وملكه ودانت له الملوك ، فروي أن جميع ملوك الدنيا كلها أربعة : مؤمنان وكافران ; فالمؤمنان سليمان بن داود وإسكندر ، والكافران نمرود وبختنصر ; وسيملكها من هذه الأمة خامس لقوله - تعالى - : ليظهره على الدين كله وهو المهدي وقد قيل : إنما سمي ذا القرنين لأنه كان كريم الطرفين من أهل بيت شريف من قبل أبيه وأمه وقيل : لأنه انقرض في وقته قرنان من الناس وهو حي وقيل : لأنه كان إذا قاتل قاتل بيديه وركابيه جميعا . وقيل لأنه أعطي علم الظاهر والباطن . وقيل : لأنه دخل الظلمة والنور . وقيل : لأنه ملك فارس والروم .\n                                    ",
        "saadi": "وَيَسۡ‍َٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا ٣٨\n                                        \n                                        \n                                        \n                                        كان أهل الكتاب أو المشركون، سألوا رسول الله صلى الله عليه وسلم عن قصة ذي القرنين، فأمره الله أن يقول: { سَأَتْلُو عَلَيْكُمْ مِنْهُ ذِكْرًا ْ} فيه نبأ مفيد، وخطاب عجيب.\nأي: سأتلوا عليكم من أحواله، ما يتذكر فيه، ويكون عبرة، وأما ما سوى ذلك من أحواله، فلم يتله عليهم.\n                                    "
      },
      "originalText": "وَيَسۡ‍َٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا ٣٨"
    }
  ]
}