{
  "number": 303,
  "ayahsNumber": 14,
  "ayahs": [
    {
      "number": 2224,
      "text": "إِنَّا مَكَّنَّا لَهُ فِي الْأَرْضِ وَآتَيْنَاهُ مِنْ كُلِّ شَيْءٍ سَبَبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 84,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا ٤٨\n                                    \n                                    \n                                    وقوله ( إنا مكنا له في الأرض ) أي : أعطيناه ملكا عظيما متمكنا ، فيه له من جميع ما يؤتى الملوك ، من التمكين والجنود ، وآلات الحرب والحصارات ؛ ولهذا ملك المشارق والمغارب من الأرض ، ودانت له البلاد ، وخضعت له ملوك العباد ، وخدمته الأمم ، من العرب والعجم ؛ ولهذا ذكر بعضهم أنه إنما سمي ذا القرنين ؛ لأنه بلغ قرني الشمس مشرقها ومغربها .\nوقوله : ( وآتيناه من كل شيء سببا ) : قال ابن عباس ، ومجاهد ، وسعيد بن جبير ، وعكرمة ، والسدي ، وقتادة ، والضحاك ، وغيرهم : يعني علما .\nوقال قتادة أيضا في قوله : ( وآتيناه من كل شيء سببا ) قال : منازل الأرض وأعلامها .\nوقال عبد الرحمن بن زيد بن أسلم في قوله : ( وآتيناه من كل شيء سببا ) قال : تعليم الألسنة ، كان لا يغزو قوما إلا كلمهم بلسانهم .\nوقال ابن لهيعة : حدثني سالم بن غيلان ، عن سعيد بن أبي هلال ؛ أن معاوية بن أبي سفيان قال لكعب الأحبار : أنت تقول : إن ذا القرنين كان يربط خيله بالثريا ؟ فقال له كعب : إن كنت قلت ذلك ، فإن الله تعالى قال : ( وآتيناه من كل شيء سببا ) .\nوهذا الذي أنكره معاوية ، رضي الله عنه ، على كعب الأحبار هو الصواب ، والحق مع معاوية في الإنكار ؛ فإن معاوية كان يقول عن كعب : \" إن كنا لنبلو عليه الكذب \" يعني : فيما ينقله ، لا أنه كان يتعمد نقل ما ليس في صحيفته ، ولكن الشأن في صحيفته ، أنها من الإسرائيليات التي غالبها مبدل مصحف محرف مختلق ولا حاجة لنا مع خبر الله ورسول الله [ صلى الله عليه وسلم ] إلى شيء منها بالكلية ، فإنه دخل منها على الناس شر كثير وفساد عريض . وتأويل كعب قول الله : ( وآتيناه من كل شيء سببا ) واستشهاده في ذلك على ما يجده في صحيفته من أنه كان يربط خيله بالثريا غير صحيح ولا مطابق ؛ فإنه لا سبيل للبشر إلى شيء من ذلك ، ولا إلى الترقي في أسباب السماوات . وقد قال الله في حق بلقيس : ( وأوتيت من كل شيء ) [ النمل : 23 ] أي : مما يؤتى مثلها من الملوك ، وهكذا ذو القرنين يسر الله له الأسباب ، أي : الطرق والوسائل إلى فتح الأقاليم والرساتيق والبلاد والأراضي وكسر الأعداء ، وكبت ملوك الأرض ، وإذلال أهل الشرك . قد أوتي من كل شيء مما يحتاج إليه مثله سببا ، والله أعلم .\nوفي \" المختارة \" للحافظ الضياء المقدسي ، من طريق قتيبة ، عن أبي عوانة عن سماك بن حرب ، عن حبيب بن حماز قال : كنت عند علي ، رضي الله عنه ، وسأله رجل عن ذي القرنين : كيف بلغ المشارق والمغارب ؟ فقال سبحان الله سخر له السحاب ، وقدر له الأسباب ، وبسط له اليد .\n                                    ",
        "qortoby": "إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا ٤٨\n                                    \n                                    \n                                    قوله تعالى : إنا مكنا له في الأرض قال علي - رضي الله عنه - : ( سخر له السحاب ، ومدت له الأسباب ، وبسط له في النور ، فكان الليل والنهار عليه سواء ) وفي حديث عقبة بن عامر أن النبي - صلى الله عليه وسلم - قال لرجال من أهل الكتاب سألوه عن ذي القرنين فقال : إن أول أمره كان غلاما من الروم فأعطي ملكا فسار حتى أتى أرض مصر فابتنى بها مدينة يقال لها الإسكندرية فلما فرغ أتاه ملك فعرج به فقال له انظر ما تحتك قال أرى مدينتي وحدها لا أرى غيرها فقال له الملك تلك الأرض كلها وهذا السواد الذي تراه محيطا بها هو البحر وإنما أراد الله - تعالى - أن يريك الأرض وقد جعل لك سلطانا فيها فسر في الأرض فعلم الجاهل وثبت العالم الحديث .\nقوله تعالى : وآتيناه من كل شيء سببا قال ابن عباس : ( من كل شيء علما يتسبب به إلى ما يريد ) وقال الحسن : بلاغا إلى حيث أراد . وقيل : من كل شيء يحتاج إليه الخلق . وقيل : من كل شيء يستعين به الملوك من فتح المدائن وقهر الأعداء . وأصل السبب الحبل فاستعير لكل ما يتوصل به إلى شيء .\n                                    ",
        "saadi": "إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا ٤٨\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 84 و 85 :ـ\n{ إِنَّا مَكَّنَّا لَهُ فِي الْأَرْضِ ْ} أي: ملكه الله تعالى، ومكنه من النفوذ في أقطار الأرض، وانقيادهم له. { وَآتَيْنَاهُ مِنْ كُلِّ شَيْءٍ سَبَبًا فَأَتْبَعَ سَبَبًا ْ} أي: أعطاه الله من الأسباب الموصلة له لما وصل إليه، ما به يستعين على قهر البلدان، وسهولة الوصول إلى أقاصي العمران، وعمل بتلك الأسباب التي أعطاه الله إياها، أي: استعملها على وجهها، فليس كل من عنده شيء من الأسباب يسلكه، ولا كل أحد يكون قادرا على السبب، فإذا اجتمع القدرة على السبب الحقيقي والعمل به، حصل المقصود، وإن عدما أو أحدهما لم يحصل.\n                                    "
      },
      "originalText": "إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا ٤٨"
    },
    {
      "number": 2225,
      "text": "فَأَتْبَعَ سَبَبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 85,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَأَتۡبَعَ سَبَبًا ٥٨\n                                    \n                                    \n                                    قال ابن عباس : ( فأتبع سببا ) يعني : بالسبب المنزل ] . وقال مجاهد : ( فأتبع سببا ) : منزلا وطريقا ما بين المشرق والمغرب .\nوفي رواية عن مجاهد : ( سببا ) قال : طريقا في الأرض .\nوقال قتادة : أي أتبع منازل الأرض ومعالمها .\nوقال الضحاك : ( فأتبع سببا ) أي المنازل .\nوقال سعيد بن جبير في قوله : ( فأتبع سببا ) قال : علما . وهكذا قال عكرمة وعبيد بن يعلى ، والسدي .\nوقال مطر : معالم وآثار كانت قبل ذلك .\n                                    ",
        "qortoby": "فَأَتۡبَعَ سَبَبًا ٥٨\n                                    \n                                    \n                                    فأتبع سببا قرأ ابن عامر وعاصم وحمزة والكسائي فأتبع سببا مقطوعة الألف وقرأ أهل المدينة وأبو عمرو \" فاتبع سببا \" بوصلها ; أي اتبع سببا من الأسباب التي أوتيها . قال الأخفش : تبعته وأتبعته بمعنى ; مثل ردفته وأردفته ، ومنه قوله - تعالى - : إلا من خطف الخطفة فأتبعه شهاب ثاقب ومنه الإتباع في الكلام مثل حسن بسن وقبيح شقيح . قال النحاس : واختار أبو عبيد قراءة أهل الكوفة قال : لأنها من السير ، وحكى هو والأصمعي أنه يقال : تبعه واتبعه إذا سار ولم يلحقه ، وأتبعه إذا لحقه ; قال أبو عبيد : ومثله فأتبعوهم مشرقين قال النحاس : وهذا التفريق وإن كان الأصمعي قد حكاه لا يقبل إلا بعلة أو دليل . وقوله - عز وجل - : فأتبعوهم مشرقين ليس في الحديث أنهم لحقوهم ، وإنما الحديث : لما خرج موسى - عليه السلام - وأصحابه من البحر وحصل فرعون وأصحابه انطبق عليهم البحر والحق في هذا أن تبع واتبع وأتبع لغات بمعنى واحد ، وهي بمعنى السير ، فقد يجوز أن يكون معه لحاق وألا يكون .\n                                    ",
        "saadi": "فَأَتۡبَعَ سَبَبًا ٥٨\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 84 و 85 :ـ\n{ إِنَّا مَكَّنَّا لَهُ فِي الْأَرْضِ ْ} أي: ملكه الله تعالى، ومكنه من النفوذ في أقطار الأرض، وانقيادهم له. { وَآتَيْنَاهُ مِنْ كُلِّ شَيْءٍ سَبَبًا فَأَتْبَعَ سَبَبًا ْ} أي: أعطاه الله من الأسباب الموصلة له لما وصل إليه، ما به يستعين على قهر البلدان، وسهولة الوصول إلى أقاصي العمران، وعمل بتلك الأسباب التي أعطاه الله إياها، أي: استعملها على وجهها، فليس كل من عنده شيء من الأسباب يسلكه، ولا كل أحد يكون قادرا على السبب، فإذا اجتمع القدرة على السبب الحقيقي والعمل به، حصل المقصود، وإن عدما أو أحدهما لم يحصل.\n                                    "
      },
      "originalText": "فَأَتۡبَعَ سَبَبًا ٥٨"
    },
    {
      "number": 2226,
      "text": "حَتَّىٰ إِذَا بَلَغَ مَغْرِبَ الشَّمْسِ وَجَدَهَا تَغْرُبُ فِي عَيْنٍ حَمِئَةٍ وَوَجَدَ عِنْدَهَا قَوْمًا ۗ قُلْنَا يَا ذَا الْقَرْنَيْنِ إِمَّا أَنْ تُعَذِّبَ وَإِمَّا أَنْ تَتَّخِذَ فِيهِمْ حُسْنًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 86,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا ٦٨\n                                    \n                                    \n                                    وقوله : ( حتى إذا بلغ مغرب الشمس ) أي : فسلك طريقا حتى وصل إلى أقصى ما يسلك فيه من الأرض من ناحية المغرب ، وهو مغرب الأرض . وأما الوصول إلى مغرب الشمس من السماء فمتعذر ، وما يذكره أصحاب القصص والأخبار من أنه سار في الأرض مدة والشمس تغرب من ورائه فشيء لا حقيقة له . وأكثر ذلك من خرافات أهل الكتاب ، واختلاق زنادقتهم وكذبهم\nوقوله : ( وجدها تغرب في عين حمئة ) أي : رأى الشمس في منظره تغرب في البحر المحيط ، وهذا شأن كل من انتهى إلى ساحله ، يراها كأنها تغرب فيه ، وهي لا تفارق الفلك الرابع الذي هي مثبتة فيه لا تفارقه .\nوالحمئة مشتقة على إحدى القراءتين من \" الحمأة \" وهو الطين ، كما قال تعالى : ( إني خالق بشرا من صلصال من حمإ مسنون ) [ الحجر : 28 ] أي طين أملس . وقد تقدم بيانه .\nوقال ابن جرير : حدثني يونس ، أخبرنا ابن وهب حدثني نافع بن أبي نعيم ، سمعت عبد الرحمن الأعرج يقول : كان ابن عباس يقول ( في عين حمئة ) ثم فسرها : ذات حمأة . قال نافع : وسئل عنها كعب الأحبار فقال : أنتم أعلم بالقرآن مني ، ولكني أجدها في الكتاب تغيب في طينة سوداء .\nوكذا روى غير واحد عن ابن عباس ، وبه قال مجاهد وغير واحد .\nوقال أبو داود الطيالسي : حدثنا محمد بن دينار ، عن سعد بن أوس ، عن مصدع ، عن ابن عباس ، عن أبي بن كعب ؛ أن النبي صلى الله عليه وسلم أقرأه ( حمئة )\nوقال علي بن أبي طلحة عن ابن عباس : \" وجدها تغرب في عين حامية \" يعني حارة . وكذا قال الحسن البصري .\nوقال ابن جرير : والصواب أنهما قراءتان مشهورتان وأيهما قرأ القارئ فهو مصيب .\nقلت : ولا منافاة بين معنييهما ؛ إذ قد تكون حارة لمجاورتها وهج الشمس عند غروبها ، وملاقاتها الشعاع بلا حائل و ( حمئة ) في ماء وطين أسود ، كما قال كعب الأحبار وغيره .\nوقال ابن جرير : حدثنا محمد بن المثنى ، حدثنا يزيد بن هارون ، أخبرنا العوام ، حدثني مولى لعبد الله بن عمرو ، عن عبد الله قال : نظر رسول الله صلى الله عليه وسلم إلى الشمس حين غابت ، فقال : \" في نار الله الحامية [ في نار الله الحامية ] ، لولا ما يزعها من أمر الله ، لأحرقت ما على الأرض \" .\nقلت : ورواه الإمام أحمد ، عن يزيد بن هارون . وفي صحة رفع هذا الحديث نظر ، ولعله من كلام عبد الله بن عمرو ، من زاملتيه اللتين وجدهما يوم اليرموك ، والله أعلم .\nوقال ابن أبي حاتم : حدثنا حجاج بن حمزة ، حدثنا محمد - يعني ابن بشر - حدثنا عمرو بن ميمون ، أنبأنا ابن حاضر ، أن ابن عباس ذكر له أن معاوية بن أبي سفيان قرأ الآية التي في سورة الكهف \" تغرب في عين حامية \" قال ابن عباس لمعاوية ما نقرؤها إلا ( حمئة ) فسأل معاوية عبد الله بن عمرو كيف تقرؤها : فقال عبد الله : كما قرأتها . قال ابن عباس : فقلت لمعاوية : في بيتي نزل القرآن ؟ فأرسل إلى كعب فقال له : أين تجد الشمس تغرب في التوراة ؟ [ فقال له كعب : سل أهل العربية ، فإنهم أعلم بها ، وأما أنا فإني أجد الشمس تغرب في التوراة ] في ماء وطين . وأشار بيده إلى المغرب . قال ابن حاضر : لو أني عندكما أفدتك بكلام تزداد فيه بصيرة في حمئة . قال ابن عباس : وإذا ما هو ؟ قلت : فيما يؤثر من قول تبع ، فيما ذكر به ذا القرنين في تخلقه بالعلم واتباعه إياه :\nبلغ المشارق والمغارب يبتغي أسباب أمر من حكيم مرشد فرأى مغيب الشمس عند غروبها\nفي عين ذي خلب وثأط حرمد\nقال ابن عباس : ما الخلب ؟ قلت : الطين بكلامهم . [ يعني بكلام حمير ] . قال : ما الثاط ؟ قلت : الحمأة . قال : فما الحرمد ؟ قلت : الأسود . قال : فدعا ابن عباس رجلا أو غلاما فقال : اكتب ما يقول هذا الرجل .\nوقال سعيد بن جبير : بينا ابن عباس يقرأ سورة الكهف فقرأ : ( وجدها تغرب في عين حمئة ) فقال كعب : والذي نفس كعب بيده ما سمعت أحدا يقرؤها كما أنزلت في التوراة غير ابن عباس ، فإنا نجدها في التوراة : تغرب في مدرة سوداء .\nوقال أبو يعلى الموصلي : حدثنا إسحاق بن أبي إسرائيل ، حدثنا هشام بن يوسف قال : في تفسير ابن جريج ( ووجد عندها قوما ) قال : مدينة لها اثنا عشر ألف باب ، لولا أصوات أهلها لسمع الناس وجوب الشمس حين تجب .\nوقوله : ( ووجد عندها قوما ) أي أمة من الأمم ، ذكروا أنها كانت أمة عظيمة من بني آدم .\nوقوله : ( قلنا ياذا القرنين إما أن تعذب وإما أن تتخذ فيهم حسنا ) معنى هذا : أن الله تعالى مكنه منهم وحكمه فيهم ، وأظفره بهم وخيره : إن شاء قتل وسبى ، وإن شاء من أو فدى . فعرف عدله وإيمانه فيما أبداه عدله وبيانه\n                                    ",
        "qortoby": "حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا ٦٨\n                                    \n                                    \n                                    حتى إذا بلغ مغرب الشمس وجدها تغرب في عين حمئة قرأ ابن عاصم وعامر وحمزة والكسائي \" حامية \" أي حارة . الباقون حمئة أي كثيرة الحمأة وهي الطينة السوداء ، تقول : حمأت البئر حمأ ( بالتسكين ) إذا نزعت حمأتها . وحمئت البئر حمأ ( بالتحريك ) كثرت حمأتها . ويجوز أن تكون \" حامية \" من الحمأة فخففت الهمزة وقلبت ياء . وقد يجمع بين القراءتين فيقال : كانت حارة وذات حمأة . وقال عبد الله بن عمرو : نظر النبي - صلى الله عليه وسلم - إلى الشمس حين غربت ; فقال : نار الله الحامية لولا ما يزعها من أمر الله لأحرقت ما على الأرض . وقال ابن عباس : ( أقرأنيها أبي كما أقرأه رسول الله - صلى الله عليه وسلم - في عين حمئة ; وقال معاوية : هي \" حامية \" فقال عبد الله بن عمرو بن العاص : فأنا مع أمير المؤمنين ; فجعلوا كعبا بينهم حكما وقالوا : يا كعب كيف تجد هذا في التوراة ؟ فقال : أجدها تغرب في عين سوداء ، فوافق ابن عباس ) وقال الشاعر وهو تبع اليماني :\nقد كان ذو القرنين قبلي مسلما ملكا تدين له الملوك وتسجد\nبلغ المغارب والمشارق يبتغي أسباب أمر من حكيم مرشد\nفرأى مغيب الشمس عند غروبها في عين ذي خلب وثأط حرمد\nالخلب : الطين : والثأط : الحمأة . والحرمد : الأسود . وقال القفال قال بعض العلماء : ليس المراد أنه انتهى إلى الشمس مغربا ومشرقا وصل إلى جرمها ومسها ; لأنها تدور مع السماء حول الأرض من غير أن تلتصق بالأرض ، وهي أعظم من أن تدخل في عين من عيون الأرض ، بل هي أكبر من الأرض أضعافا مضاعفة ، بل المراد أنه انتهى إلى آخر العمارة من جهة المغرب ومن جهة المشرق ، فوجدها في رأي العين تغرب في عين حمئة ، كما أنا نشاهدها في الأرض الملساء كأنها تدخل في الأرض ; ولهذا قال : وجدها تطلع على قوم لم نجعل لهم من دونها سترا ولم يرد أنها تطلع عليهم بأن تماسهم وتلاصقهم ، بل أراد أنهم أول من تطلع عليهم . وقال القتبي : ويجوز أن تكون هذه العين من البحر ، ويجوز أن تكون الشمس تغيب وراءها أو معها أو عندها ، فيقام حرف الصفة مقام صاحبه والله أعلم .\nووجد عندها قوما أي عند العين ، أو عند نهاية العين ، وهم أهل جابرس ، ويقال لها بالسريانية : جرجيسا ; يسكنها قوم من نسل ثمود بقيتهم الذين آمنوا بصالح ; ذكره السهيلي . وقال وهب بن منبه : ( كان ذو القرنين رجلا من الروم ابن عجوز من عجائزهم ليس لها ولد غيره وكان اسمه الإسكندر ، فلما بلغ وكان عبدا صالحا قال الله - تعالى - : يا ذا القرنين إني باعثك إلى أمم الأرض وهم أمم مختلفة ألسنتهم ، وهم أمم جميع الأرض ، وهم أصناف : أمتان بينهما طول الأرض كله ، وأمتان بينهما عرض الأرض كله ، وأمم في وسط الأرض منهم الجن والإنس ويأجوج ومأجوج ; فأما اللتان بينهما طول الأرض فأمة عند مغرب الشمس يقال لها ناسك ، وأما الأخرى فعند مطلعها ويقال لها منسك . وأما اللتان بينهما عرض الأرض فأمة في قطر الأرض الأيمن يقال لها هاويل ; وأما الأخرى التي في قطر الأرض الأيسر يقال لها تاويل . فقال ذو القرنين : إلهي قد ندبتني لأمر عظيم لا يقدر قدره إلا أنت ; فأخبرني عن هذه الأمم بأي قوة أكاثرهم ؟ وبأي صبر أقاسيهم ؟ وبأي لسان أناطقهم ؟ فكيف لي بأن أفقه لغتهم وليس عندي قوة ؟ فقال الله - تعالى - : سأظفرك بما حملتك ; أشرح لك صدرك فتسمع كل شيء ، وأثبت لك فهمك فتفقه كل شيء ، وألبسك الهيبة فلا يروعك شيء ، وأسخر لك النور والظلمة فيكونان جندا من جنودك ، يهديك النور من أمامك ، وتحفظك الظلمة من ورائك ; فلما قيل له ذلك سار بمن اتبعه ، فانطلق إلى الأمة التي عند مغرب الشمس ; لأنها كانت أقرب الأمم منه وهي ناسك ، فوجد جموعا لا يحصيها إلا الله - تعالى - وقوة وبأسا لا يطيقه إلا الله . وألسنة مختلفة ، وأهواء متشتتة فكاثرهم بالظلمة ; فضرب حولهم ثلاث عساكر من جند الظلمة قدر ما أحاط بهم من كل مكان ، حتى جمعتهم في مكان واحد ، ثم دخل عليهم بالنور فدعاهم إلى الله - تعالى - وإلى عبادته ، فمنهم من آمن به ومنهم من كفر وصد عنه ، فأدخل على الذين تولوا الظلمة فغشيتهم من كل مكان ، فدخلت إلى أفواههم وأنوفهم وأعينهم وبيوتهم وغشيتهم من كل مكان ، فتحيروا وماجوا وأشفقوا أن يهلكوا ، فعجوا إلى الله - تعالى - بصوت واحد : إنا آمنا ; فكشفها عنهم ، وأخذهم عنوة ، ودخلوا في دعوته ، فجند من أهل المغرب أمما عظيمة فجعلهم جندا واحدا ، ثم انطلق بهم يقودهم ، والظلمة تسوقهم وتحرسه من خلفه ، والنور أمامهم يقوده ويدله ، وهو يسير في ناحية الأرض اليمنى يريد الأمة التي في قطر الأرض الأيمن وهي هاويل ، وسخر الله - تعالى - يده وقلبه وعقله ونظره فلا يخطئ إذا عمل عملا ، فإذا أتوا مخاضة أو بحرا بنى سفنا من ألواح صغار مثل النعال فنظمها في ساعة ، ثم جعل فيها جميع من معه من تلك الأمم ، فإذا قطع البحار والأنهار فتقها ودفع إلى كل رجل لوحا فلا يكترث بحمله ، فانتهى إلى هاويل وفعل بهم كفعله بناسك فآمنوا ، ففرغ منهم ، وأخذ جيوشهم وانطلق إلى ناحية الأرض الأخرى حتى انتهى إلى منسك عند مطلع الشمس ، فعمل فيها وجند منها جنودا كفعله في الأولى ، ثم كر مقبلا حتى أخذ ناحية الأرض اليسرى يريد تاويل ، وهي الأمة التي تقابل هاويل بينهما عرض الأرض ، ففعل فيها كفعله فيما قبلها ، ثم عطف إلى الأمم التي في وسط الأرض من الجن الإنس ويأجوج ومأجوج ، فلما كان في بعض الطريق مما يلي منقطع الترك من المشرق قالت له أمة صالحة من الإنس : يا ذا القرنين إن بين هذين الجبلين خلقا من خلق الله - تعالى - كثيرا ليس لهم عدد ، وليس فيهم مشابهة من الإنس ، وهم أشباه البهائم ; يأكلون العشب ، ويفترسون الدواب والوحش كما تفترسها السباع ، ويأكلون حشرات الأرض كلها من الحيات والعقارب والوزغ وكل ذي روح مما خلق الله - تعالى - في الأرض ، وليس لله - تعالى - خلق ينمو نماءهم في العام الواحد ، فإن طالت المدة فسيملئون الأرض ، ويجلون أهلها فهل نجعل لك خرجا على أن تجعل بيننا وبينهم سدا ؟ . . . ) وذكر الحديث ; وسيأتي من صفة يأجوج ومأجوج والترك إذ هم نوع منهم ما فيه كفاية .\nقوله تعالى : قلنا ياذا القرنين قال القشيري أبو نصر : إن كان نبيا فهو وحي ، وإن لم يكن نبيا فهو إلهام من الله - تعالى - .\nإما أن تعذب وإما أن تتخذ فيهم حسنا قال إبراهيم بن السري : خيره بين هذين كما خير محمدا - صلى الله عليه وسلم - فقال : فإن جاءوك فاحكم بينهم أو أعرض عنهم ونحوه . وقال أبو إسحاق الزجاج : المعنى أن الله - تعالى - خيره بين هذين الحكمين ; قال النحاس : ورد علي بن سليمان عليه قوله ; لأنه لم يصح أن ذا القرنين نبي فيخاطب بهذا ، فكيف يقول لربه - عز وجل - : ثم يرد إلى ربه ؟ وكيف يقول : فسوف نعذبه فيخاطب بالنون ؟ قال : التقدير ; قلنا يا محمد قالوا يا ذا القرنين . قال أبو جعفر النحاس : هذا الذي قاله أبو الحسن لا يلزم منه شيء . أما قوله : قلنا ياذا القرنين فيجوز أن يكون الله - عز وجل - خاطبه على لسان نبي في وقته ، ويجوز أن يكون قال له هذا كما قال لنبيه : فإما منا بعد وإما فداء ، وأما إشكال فسوف نعذبه ثم يرد إلى ربه فإن تقديره أن الله - تعالى - لما خيره بين القتل في قوله - تعالى - : إما أن تعذب وبين الاستبقاء في قوله جل وعز : وإما أن تتخذ فيهم حسنا قال لأولئك القوم : أما من ظلم أي من أقام على الكفر منكم .\nفسوف نعذبه أي بالقتل .\nثم يرد إلى ربه أي يوم القيامة .\nفيعذبه عذابا نكرا أي شديدا في جهنم .\nوأما من آمن وعمل صالحا أي تاب من الكفر .\n. قال أحمد بن يحيى : أن في موضع نصب في إما أن تعذب وإما أن تتخذ فيهم حسنا قال : ولو رفعت كان صوابا بمعنى فإما هو ، كما قال :\nفسيرا فإما حاجة تقضيانها وإما مقيل صالح وصديق\n                                    ",
        "saadi": "حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا ٦٨\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 86 حتى 88 :ـ\nوهذه الأسباب التي أعطاه الله إياها، لم يخبرنا الله ولا رسوله بها، ولم تتناقلها الأخبار على وجه يفيد العلم، فلهذا، لا يسعنا غير السكوت عنها، وعدم الالتفات لما يذكره النقلة للإسرائيليات ونحوها، ولكننا نعلم بالجملة أنها أسباب قوية كثيرة، داخلية وخارجية، بها صار له جند عظيم، ذو عدد وعدد ونظام، وبه تمكن من قهر الأعداء، ومن تسهيل الوصول إلى مشارق الأرض ومغاربها، وأنحائها، فأعطاه الله، ما بلغ به مغرب الشمس، حتى رأى الشمس في مرأى العين، كأنها تغرب في عين حمئة، أي: سوداء، وهذا هو المعتاد لمن كان بينه وبين أفق الشمس الغربي ماء، رآها تغرب في نفس الماء وإن كانت في غاية الارتفاع، ووجد عندها، أي: عند مغربها قوما. { قُلْنَا يَا ذَا الْقَرْنَيْنِ إِمَّا أَنْ تُعَذِّبَ وَإِمَّا أَنْ تَتَّخِذَ فِيهِمْ حُسْنًا ْ} أي: إما أن تعذبهم بقتل، أو ضرب، أو أسر ونحوه، وإما أن تحسن إليهم، فخير بين الأمرين، لأن الظاهر أنهم كفار أو فساق، أو فيهم شيء من ذلك، لأنهم لو كانوا مؤمنين غير فساق، لم يرخص في تعذيبهم، فكان عند ذي القرنين من السياسة الشرعية ما استحق به المدح والثناء، لتوفيق الله له لذلك، فقال: سأجعلهم قسمين: { أَمَّا مَنْ ظَلَمَ ْ} بالكفر { فَسَوْفَ نُعَذِّبُهُ ثُمَّ يُرَدُّ إِلَى رَبِّهِ فَيُعَذِّبُهُ عَذَابًا نُكْرًا ْ} أي: تحصل له العقوبتان، عقوبة الدنيا، وعقوبة الآخرة.\n{ وَأَمَّا مَنْ آمَنَ وَعَمِلَ صَالِحًا فَلَهُ جَزَاءً الْحُسْنَى ْ} أي: فله الجنة والحالة الحسنة عند الله جزاء يوم القيامة، { وَسَنَقُولُ لَهُ مِنْ أَمْرِنَا يُسْرًا ْ} أي: وسنحسن إليه، ونلطف له بالقول، ونيسر له المعاملة، وهذا يدل على كونه من الملوك الصالحين الأولياء، العادلين العالمين، حيث وافق مرضاة الله في معاملة كل أحد، بما يليق بحاله.\n                                    "
      },
      "originalText": "حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا ٦٨"
    },
    {
      "number": 2227,
      "text": "قَالَ أَمَّا مَنْ ظَلَمَ فَسَوْفَ نُعَذِّبُهُ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِ فَيُعَذِّبُهُ عَذَابًا نُكْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 87,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا ٧٨\n                                    \n                                    \n                                    في قوله : ( أما من ظلم ) أي : من استمر على كفره وشركه بربه ( فسوف نعذبه ) قال قتادة : بالقتل : وقال السدي : كان يحمي لهم بقر النحاس ويضعهم فيها حتى يذوبوا . وقال وهب بن منبه : كان يسلط الظلمة ، فتدخل أفواههم وبيوتهم ، وتغشاهم من جميع جهاتهم والله أعلم .\nوقوله : ( ثم يرد إلى ربه فيعذبه عذابا نكرا ) أي : شديدا بليغا وجيعا أليما . وفيه إثبات المعاد والجزاء .\n                                    ",
        "qortoby": "قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا ٧٨\n                                    \n                                    \n                                    قَالَ أَمَّا مَنْ ظَلَمَ\nأي من أقام على الكفر منكم .فَسَوْفَ نُعَذِّبُهُ\nأي بالقتل .ثُمَّ يُرَدُّ إِلَى رَبِّهِ\nأي يوم القيامة .فَيُعَذِّبُهُ عَذَابًا نُكْرًا\nأي شديدا في جهنم .\n                                    ",
        "saadi": "قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا ٧٨\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 86 حتى 88 :ـ\nوهذه الأسباب التي أعطاه الله إياها، لم يخبرنا الله ولا رسوله بها، ولم تتناقلها الأخبار على وجه يفيد العلم، فلهذا، لا يسعنا غير السكوت عنها، وعدم الالتفات لما يذكره النقلة للإسرائيليات ونحوها، ولكننا نعلم بالجملة أنها أسباب قوية كثيرة، داخلية وخارجية، بها صار له جند عظيم، ذو عدد وعدد ونظام، وبه تمكن من قهر الأعداء، ومن تسهيل الوصول إلى مشارق الأرض ومغاربها، وأنحائها، فأعطاه الله، ما بلغ به مغرب الشمس، حتى رأى الشمس في مرأى العين، كأنها تغرب في عين حمئة، أي: سوداء، وهذا هو المعتاد لمن كان بينه وبين أفق الشمس الغربي ماء، رآها تغرب في نفس الماء وإن كانت في غاية الارتفاع، ووجد عندها، أي: عند مغربها قوما. { قُلْنَا يَا ذَا الْقَرْنَيْنِ إِمَّا أَنْ تُعَذِّبَ وَإِمَّا أَنْ تَتَّخِذَ فِيهِمْ حُسْنًا ْ} أي: إما أن تعذبهم بقتل، أو ضرب، أو أسر ونحوه، وإما أن تحسن إليهم، فخير بين الأمرين، لأن الظاهر أنهم كفار أو فساق، أو فيهم شيء من ذلك، لأنهم لو كانوا مؤمنين غير فساق، لم يرخص في تعذيبهم، فكان عند ذي القرنين من السياسة الشرعية ما استحق به المدح والثناء، لتوفيق الله له لذلك، فقال: سأجعلهم قسمين: { أَمَّا مَنْ ظَلَمَ ْ} بالكفر { فَسَوْفَ نُعَذِّبُهُ ثُمَّ يُرَدُّ إِلَى رَبِّهِ فَيُعَذِّبُهُ عَذَابًا نُكْرًا ْ} أي: تحصل له العقوبتان، عقوبة الدنيا، وعقوبة الآخرة.\n{ وَأَمَّا مَنْ آمَنَ وَعَمِلَ صَالِحًا فَلَهُ جَزَاءً الْحُسْنَى ْ} أي: فله الجنة والحالة الحسنة عند الله جزاء يوم القيامة، { وَسَنَقُولُ لَهُ مِنْ أَمْرِنَا يُسْرًا ْ} أي: وسنحسن إليه، ونلطف له بالقول، ونيسر له المعاملة، وهذا يدل على كونه من الملوك الصالحين الأولياء، العادلين العالمين، حيث وافق مرضاة الله في معاملة كل أحد، بما يليق بحاله.\n                                    "
      },
      "originalText": "قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ فَيُعَذِّبُهُۥ عَذَابٗا نُّكۡرٗا ٧٨"
    },
    {
      "number": 2228,
      "text": "وَأَمَّا مَنْ آمَنَ وَعَمِلَ صَالِحًا فَلَهُ جَزَاءً الْحُسْنَىٰ ۖ وَسَنَقُولُ لَهُ مِنْ أَمْرِنَا يُسْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 88,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا ٨٨\n                                    \n                                    \n                                    وقوله : ( وأما من آمن ) أي : تابعنا على ما ندعوه إليه من عبادة الله وحده لا شريك له ( فله جزاء الحسنى ) أي : في الدار الآخرة عند الله - عز وجل - ( وسنقول له من أمرنا يسرا ) قال مجاهد : معروفا .\n                                    ",
        "qortoby": "وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا ٨٨\n                                    \n                                    \n                                    فله جزاء الحسنى قراءة أهل المدينة وأبي عمرو وعاصم فله جزاء الحسنى بالرفع على الابتداء أو بالاستقرار . و الحسنى في موضع خفض بالإضافة ويحذف التنوين للإضافة ; أي له جزاء الحسنى عند الله - تعالى - في الآخرة وهي الجنة ، فأضاف الجزاء إلى الجنة ، كقوله : حق اليقين ، ولدار الآخرة ; قاله الفراء . ويحتمل أن يريد ب الحسنى الأعمال الصالحة ويمكن أن يكون الجزاء من ذي القرنين ; أي أعطيه وأتفضل عليه ويجوز أن يحذف التنوين لالتقاء الساكنين ويكون الحسنى في موضع رفع على البدل عند البصريين ، وعلى الترجمة عند الكوفيين ، وعلى هذا قراءة ابن أبي إسحاق فله جزاء الحسنى إلا أنك لم تحذف التنوين ، وهو أجود . وقرأ سائر الكوفيين فله جزاء الحسنى منصوبا منونا ; أي فله الحسنى جزاء قال الفراء : جزاء منصوب على التمييز وقيل : على المصدر ; وقال الزجاج : هو مصدر في موضع الحال ; أي مجزيا بها جزاء وقرأ ابن عباس ومسروق فله جزاء الحسنى منصوبا غير منون وهي عند أبي حاتم على حذف التنوين لالتقاء الساكنين مثل فله جزاء الحسنى في أحد الوجهين . النحاس : وهذا عند غيره خطأ لأنه ليس موضع حذف تنوين لالتقاء الساكنين ويكون تقديره : فله الثواب جزاء الحسنى .\n                                    ",
        "saadi": "وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا ٨٨\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 86 حتى 88 :ـ\nوهذه الأسباب التي أعطاه الله إياها، لم يخبرنا الله ولا رسوله بها، ولم تتناقلها الأخبار على وجه يفيد العلم، فلهذا، لا يسعنا غير السكوت عنها، وعدم الالتفات لما يذكره النقلة للإسرائيليات ونحوها، ولكننا نعلم بالجملة أنها أسباب قوية كثيرة، داخلية وخارجية، بها صار له جند عظيم، ذو عدد وعدد ونظام، وبه تمكن من قهر الأعداء، ومن تسهيل الوصول إلى مشارق الأرض ومغاربها، وأنحائها، فأعطاه الله، ما بلغ به مغرب الشمس، حتى رأى الشمس في مرأى العين، كأنها تغرب في عين حمئة، أي: سوداء، وهذا هو المعتاد لمن كان بينه وبين أفق الشمس الغربي ماء، رآها تغرب في نفس الماء وإن كانت في غاية الارتفاع، ووجد عندها، أي: عند مغربها قوما. { قُلْنَا يَا ذَا الْقَرْنَيْنِ إِمَّا أَنْ تُعَذِّبَ وَإِمَّا أَنْ تَتَّخِذَ فِيهِمْ حُسْنًا ْ} أي: إما أن تعذبهم بقتل، أو ضرب، أو أسر ونحوه، وإما أن تحسن إليهم، فخير بين الأمرين، لأن الظاهر أنهم كفار أو فساق، أو فيهم شيء من ذلك، لأنهم لو كانوا مؤمنين غير فساق، لم يرخص في تعذيبهم، فكان عند ذي القرنين من السياسة الشرعية ما استحق به المدح والثناء، لتوفيق الله له لذلك، فقال: سأجعلهم قسمين: { أَمَّا مَنْ ظَلَمَ ْ} بالكفر { فَسَوْفَ نُعَذِّبُهُ ثُمَّ يُرَدُّ إِلَى رَبِّهِ فَيُعَذِّبُهُ عَذَابًا نُكْرًا ْ} أي: تحصل له العقوبتان، عقوبة الدنيا، وعقوبة الآخرة.\n{ وَأَمَّا مَنْ آمَنَ وَعَمِلَ صَالِحًا فَلَهُ جَزَاءً الْحُسْنَى ْ} أي: فله الجنة والحالة الحسنة عند الله جزاء يوم القيامة، { وَسَنَقُولُ لَهُ مِنْ أَمْرِنَا يُسْرًا ْ} أي: وسنحسن إليه، ونلطف له بالقول، ونيسر له المعاملة، وهذا يدل على كونه من الملوك الصالحين الأولياء، العادلين العالمين، حيث وافق مرضاة الله في معاملة كل أحد، بما يليق بحاله.\n                                    "
      },
      "originalText": "وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗا فَلَهُۥ جَزَآءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا يُسۡرٗا ٨٨"
    },
    {
      "number": 2229,
      "text": "ثُمَّ أَتْبَعَ سَبَبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 89,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ أَتۡبَعَ سَبَبًا ٩٨\n                                    \n                                    \n                                    يقول تعالى ثم سلك طريقًا فسار من مغرب الشمس إلى مطلعها وكان كلما مر بأمة قهرهم وغلبهم ودعاهم إلى الله عز وجل فإن أطاعوه وإلا أذلهم وأرغم آنافهم واستباح أموالهم وأمتعتهم واستخدم من كل أمة ما تستعين به جيوشه على قتال الإقليم المتاخم لهم.\n                                    ",
        "qortoby": "ثُمَّ أَتۡبَعَ سَبَبًا ٩٨\n                                    \n                                    \n                                    تقدم معناه أن أتبع واتبع بمعنى أي سلك طريقا ومنازل .\n                                    ",
        "saadi": "ثُمَّ أَتۡبَعَ سَبَبًا ٩٨\n                                        \n                                        \n                                        \n                                        أي لما وصل إلى مغرب الشمس كر راجعا، قاصدا مطلعها، متبعا للأسباب، التي أعطاه الله، فوصل إلى مطلع الشمس فـ { وَجَدَهَا تَطْلُعُ عَلَى قَوْمٍ لَمْ نَجْعَلْ لَهُمْ مِنْ دُونِهَا سِتْرًا ْ} أي: وجدها تطلع على أناس ليس لهم ستر من الشمس، إما لعدم استعدادهم في المساكن، وذلك لزيادة همجيتهم وتوحشهم، وعدم تمدنهم، وإما لكون الشمس دائمة عندهم، لا تغرب عنهم غروبا يذكر، كما يوجد ذلك في شرقي أفريقيا الجنوبي، فوصل إلى موضع انقطع عنه علم أهل الأرض، فضلا عن وصولهم إليه إياه بأبدانهم، ومع هذا، فكل هذا بتقدير الله له، وعلمه به ولهذا قال { كَذَلِكَ وَقَدْ أَحَطْنَا بِمَا لَدَيْهِ خُبَرًا ْ} أي: أحطنا بما عنده من الخير والأسباب العظيمة وعلمنا معه، حيثما توجه وسار.\n                                    "
      },
      "originalText": "ثُمَّ أَتۡبَعَ سَبَبًا ٩٨"
    },
    {
      "number": 2230,
      "text": "حَتَّىٰ إِذَا بَلَغَ مَطْلِعَ الشَّمْسِ وَجَدَهَا تَطْلُعُ عَلَىٰ قَوْمٍ لَمْ نَجْعَلْ لَهُمْ مِنْ دُونِهَا سِتْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 90,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا ٠٩\n                                    \n                                    \n                                    وذكر في أخبار بني إسرائيل أنه عاش ألفا وستمائة سنة يجوب الأرض طولها والعرض حتى بلغ المشارق والمغارب . ولما انتهى إلى مطلع الشمس من الأرض كما قال الله تعالى : ( وجدها تطلع على قوم ) أي أمة ( لم نجعل لهم من دونها سترا ) أي : ليس لهم بناء يكنهم ، ولا أشجار تظلهم وتسترهم من حر الشمس .\nقال سعيد بن جبير : كانوا حمرا قصارا ، مساكنهم الغيران ، أكثر معيشتهم من السمك .\nوقال أبو داود الطيالسي : حدثنا سهل بن أبي الصلت ، سمعت الحسن وسئل عن قوله تعالى : ( لم نجعل لهم من دونها سترا ) قال : إن أرضهم لا تحمل البناء فإذا طلعت الشمس تغوروا في المياه ، فإذا غربت خرجوا يتراعون كما ترعى البهائم . قال الحسن : هذا حديث سمرة .\nوقال قتادة : ذكر لنا أنهم بأرض لا تنبت لهم شيئا ، فهم إذا طلعت الشمس دخلوا في أسراب ، حتى إذا زالت الشمس خرجوا إلى حروثهم ومعايشهم .\nوعن سلمة بن كهيل أنه قال : ليس لهم أكنان ، إذا طلعت الشمس طلعت عليهم ، فلأحدهم أذنان يفترش إحداهما ويلبس الأخرى .\nقال عبد الرزاق : أخبرنا معمر ، عن قتادة في قوله : ( وجدها تطلع على قوم لم نجعل لهم من دونها سترا ) قال : هم الزنج .\nوقال ابن جريج في قوله : ( وجدها تطلع على قوم لم نجعل لهم من دونها سترا ) قال : لم يبنوا فيها بناء قط ، ولم يبن عليهم فيها بناء قط ، كانوا إذا طلعت الشمس دخلوا أسرابا لهم حتى تزول الشمس ، أو دخلوا البحر ، وذلك أن أرضهم ليس فيها جبل ، جاءهم جيش مرة فقال لهم أهلها : لا تطلعن عليكم الشمس وأنتم بها . قالوا : لا نبرح حتى تطلع الشمس ، ما هذه العظام ؟ قالوا : هذه جيف جيش طلعت عليهم الشمس هاهنا فماتوا . قال : فذهبوا هاربين في الأرض .\n                                    ",
        "qortoby": "حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا ٠٩\n                                    \n                                    \n                                    حتى إذا بلغ مطلع الشمس وقرأ مجاهد وابن محيصن بفتح الميم واللام ; يقال : طلعت الشمس والكواكب طلوعا ومطلعا . والمطلع والمطلع أيضا موضع طلوعها قاله الجوهري .\nوجدها تطلع على قوم المعنى أنه انتهى إلى موضع قوم لم يكن بينهم وبين مطلع الشمس أحد من الناس . والشمس تطلع وراء ذلك بمسافة بعيدة وقد اختلف فيهم ; فعن وهب بن منبه ما تقدم ، وأنها أمة يقال لها منسك وهي مقابلة ناسك ; وقاله مقاتل وقال قتادة : يقال لهما الزنج وقال الكلبي : هم تارس وهاويل ومنسك ; حفاة عراة عماة عن الحق ، يتسافدون مثل الكلاب ، ويتهارجون تهارج الحمر . وقيل : هم أهل جابلق وهم من نسل مؤمني عاد الذين آمنوا بهود ، ويقال لهم بالسريانية مرقيسا والذين عند مغرب الشمس هم أهل جابرس ; ولكل واحدة من المدينتين عشرة آلاف باب ، وبين كل باب فرسخ ووراء جابلق أمم وهم تافيل وتارس وهم يجاورون يأجوج ومأجوج وأهل جابرس وجابلق آمنوا بالنبي - عليه الصلاة والسلام - ( مر بهم ليلة الإسراء فدعاهم فأجابوه ، ودعا الأمم الآخرين فلم يجيبوه ) ; ذكره السهيلي وقال : اختصرت هذا كله من حديث طويل رواه مقاتل بن حيان عن عكرمة عن ابن عباس عن النبي - صلى الله عليه وسلم - ورواه الطبري مسندا إلى مقاتل يرفعه ; والله أعلم .\nقوله تعالى : لم نجعل لهم من دونها سترا أي حجابا يستترون منها عند طلوعها . قال قتادة : لم يكن بينهم وبين الشمس سترا ; كانوا في مكان لا يستقر عليه بناء ، وهم يكونون في أسراب لهم ، حتى إذا زالت الشمس عنهم رجعوا إلى معايشهم وحروثهم ; يعني لا يستترون منها بكهف جبل ولا بيت يكنهم منها . وقال أمية : وجدت رجالا بسمرقند يحدثون الناس ، فقال بعضهم : خرجت حتى جاوزت الصين ، فقيل لي : إن بينك وبينهم مسيرة يوم وليلة ، فاستأجرت رجلا يرينيهم حتى صبحتهم ، فوجدت أحدهم يفترش أذنه ويلتحف بالأخرى ، وكان صاحبي يحسن كلامهم ، فبتنا بهم ، فقالوا : فيم جئتم ؟ قلنا : جئنا ننظر كيف تطلع الشمس ; فبينا نحن كذلك إذ سمعنا كهيئة الصلصلة ، فغشي علي ، ثم أفقت وهم يمسحونني بالدهن ، فلما طلعت الشمس على الماء إذ هي على الماء كهيئة الزيت ، وإذا طرف السماء كهيئة الفسطاط ، فلما ارتفعت أدخلوني سربا لهم ، فلما ارتفع النهار وزالت الشمس عن رءوسهم خرجوا يصطادون السمك ، فيطرحونه في الشمس فينضج . وقال ابن جريج : جاءهم جيش مرة ، فقال لهم أهلها : لا تطلع الشمس وأنتم بها ، فقالوا : ما نبرح حتى تطلع الشمس . ثم قالوا : ما هذه العظام ؟ قالوا : هذه والله عظام جيش طلعت عليهم الشمس هاهنا فماتوا قال : فولوا هاربين في الأرض . وقال الحسن : كانت أرضهم لا جبل فيها ولا شجر ، وكانت لا تحمل البناء ، فإذا طلعت عليهم الشمس نزلوا في الماء ، فإذا ارتفعت عنهم خرجوا ، فيتراعون كما تتراعى البهائم .\nقلت : وهذه الأقوال تدل على أن لا مدينة هناك والله أعلم . وربما يكون منهم من يدخل في النهر . ومنهم من يدخل في السرب فلا تناقض بين قول الحسن وقتادة .\n                                    ",
        "saadi": "حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا ٠٩\n                                        \n                                        \n                                        \n                                        أي لما وصل إلى مغرب الشمس كر راجعا، قاصدا مطلعها، متبعا للأسباب، التي أعطاه الله، فوصل إلى مطلع الشمس فـ { وَجَدَهَا تَطْلُعُ عَلَى قَوْمٍ لَمْ نَجْعَلْ لَهُمْ مِنْ دُونِهَا سِتْرًا ْ} أي: وجدها تطلع على أناس ليس لهم ستر من الشمس، إما لعدم استعدادهم في المساكن، وذلك لزيادة همجيتهم وتوحشهم، وعدم تمدنهم، وإما لكون الشمس دائمة عندهم، لا تغرب عنهم غروبا يذكر، كما يوجد ذلك في شرقي أفريقيا الجنوبي، فوصل إلى موضع انقطع عنه علم أهل الأرض، فضلا عن وصولهم إليه إياه بأبدانهم، ومع هذا، فكل هذا بتقدير الله له، وعلمه به ولهذا قال\n                                    "
      },
      "originalText": "حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا ٠٩"
    },
    {
      "number": 2231,
      "text": "كَذَٰلِكَ وَقَدْ أَحَطْنَا بِمَا لَدَيْهِ خُبْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 91,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا ١٩\n                                    \n                                    \n                                    وقوله : ( كذلك وقد أحطنا بما لديه خبرا ) قال مجاهد ، والسدي : علما ، أي : نحن مطلعون على جميع أحواله وأحوال جيشه ، لا يخفى علينا منها شيء ، وإن تفرقت أممهم وتقطعت بهم الأرض ، فإنه تعالى : ( لا يخفى عليه شيء في الأرض ولا في السماء ) [ آل عمران : 5 ]\n                                    ",
        "qortoby": "كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا ١٩\n                                    \n                                    \n                                    كَذَٰلِكَ وَقَدْ أَحَطْنَا بِمَا لَدَيْهِ خُبْرًا\n                                    ",
        "saadi": "كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا ١٩\n                                        \n                                        \n                                        \n                                        ( كَذَلِكَ وَقَدْ أَحَطْنَا بِمَا لَدَيْهِ خُبْرًا ) أي: أحطنا بما عنده من الخير والأسباب العظيمة وعلمنا معه، حيثما توجه وسار.\n                                    "
      },
      "originalText": "كَذَٰلِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَيۡهِ خُبۡرٗا ١٩"
    },
    {
      "number": 2232,
      "text": "ثُمَّ أَتْبَعَ سَبَبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 92,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ أَتۡبَعَ سَبَبًا ٢٩\n                                    \n                                    \n                                    قول تعالى مخبرا عن ذي القرنين : ( ثم أتبع سببا ) أي : ثم سلك طريقا من مشارق الأرض .\n                                    ",
        "qortoby": "ثُمَّ أَتۡبَعَ سَبَبًا ٢٩\n                                    \n                                    \n                                    تقدم معناه أن أتبع واتبع بمعنى أي سلك طريقا ومنازل .\n                                    ",
        "saadi": "ثُمَّ أَتۡبَعَ سَبَبًا ٢٩\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 92 و 93 :ـ\n{ ثُمَّ أَتْبَعَ سَبَبًا حَتَّى إِذَا بَلَغَ بَيْنَ السَّدَّيْنِ ْ} قال المفسرون: ذهب متوجها من المشرق، قاصدا للشمال، فوصل إلى ما بين السدين، وهما سدان، كانا سلاسل جبال معروفين في ذلك الزمان، سدا بين يأجوج ومأجوج وبين الناس، وجد من دون السدين قوما، لا يكادون يفقهون قولا، لعجمة ألسنتهم، واستعجام أذهانهم وقلوبهم، وقد أعطى الله ذا القرنين من الأسباب العلمية، ما فقه به ألسنة أولئك القوم وفقههم، وراجعهم، وراجعوه، فاشتكوا إليه ضرر يأجوج ومأجوج، وهما أمتان عظيمتان من بني آدم\n                                    "
      },
      "originalText": "ثُمَّ أَتۡبَعَ سَبَبًا ٢٩"
    },
    {
      "number": 2233,
      "text": "حَتَّىٰ إِذَا بَلَغَ بَيْنَ السَّدَّيْنِ وَجَدَ مِنْ دُونِهِمَا قَوْمًا لَا يَكَادُونَ يَفْقَهُونَ قَوْلًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 93,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا ٣٩\n                                    \n                                    \n                                    ( حتى إذا بلغ بين السدين ) وهما جبلان متناوحان بينهما ثغرة يخرج منها يأجوج ومأجوج على بلاد الترك ، فيعيثون فيهم فسادا ، ويهلكون الحرث والنسل ، ويأجوج ومأجوج من سلالة آدم ، عليه السلام ، كما ثبت في الصحيحين : \" إن الله تعالى يقول : يا آدم . فيقول : لبيك وسعديك . فيقول : ابعث بعث النار . فيقول : وما بعث النار ؟ فيقول : من كل ألف تسعمائة وتسعة وتسعون إلى النار ، وواحد إلى الجنة ؟ فحينئذ يشيب الصغير ، وتضع كل ذات حمل حملها ، فيقال : إن فيكم أمتين ، ما كانتا في شيء إلا كثرتاه : يأجوج ومأجوج \" .\nوقد حكى النووي ، رحمه الله ، في شرح \" مسلم \" عن بعض الناس : أن يأجوج ومأجوج خلقوا من مني خرج من آدم فاختلط بالتراب ، فخلقوا من ذلك فعلى هذا يكونون مخلوقين من آدم ، وليسوا من حواء . وهذا قول غريب جدا ، [ ثم ] لا دليل عليه لا من عقل ولا [ من ] نقل ، ولا يجوز الاعتماد هاهنا على ما يحكيه بعض أهل الكتاب ؛ لما عندهم من الأحاديث المفتعلة ، والله أعلم .\nوفي مسند الإمام أحمد ، عن سمرة ؛ أن رسول الله صلى الله عليه وسلم قال : \" ولد نوح ثلاثة : سام أبو العرب ، وحام أبو السودان ، ويافث أبو الترك \" . قال بعض العلماء : هؤلاء من نسل يافث أبي الترك ، قال : [ إنما سموا هؤلاء تركا ؛ لأنهم تركوا من وراء السد من هذه الجهة ، وإلا فهم أقرباء أولئك ، ولكن كان في أولئك بغي وفساد وجراءة . وقد ذكر ابن جرير هاهنا عن وهب بن منبه أثرا طويلا عجيبا في سير ذي القرنين ، وبنائه السد ، وكيفية ما جرى له ، وفيه طول وغرابة ونكارة في أشكالهم وصفاتهم ، [ وطولهم ] وقصر بعضهم ، وآذانهم . وروى ابن أبي حاتم أحاديث غريبة في ذلك لا تصح أسانيدها ، والله أعلم .\nوقوله : ( وجد من دونهما قوما لا يكادون يفقهون قولا ) [ أي ] : لاستعجام كلامهم وبعدهم عن الناس .\n                                    ",
        "qortoby": "حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا ٣٩\n                                    \n                                    \n                                    حتى إذا بلغ بين السدين حتى إذا بلغ بين السدين وهما جبلان من قبل أرمينية وأذربيجان . روى عطاء الخراساني عن ابن عباس : بين السدين الجبلين أرمينية وأذربيجان .\nوجد من دونهما أي من ورائهما .\nقوما لا يكادون يفقهون قولا وقرأ حمزة والكسائي \" يفقهون \" بضم الياء وكسر القاف من أفقه إذا أبان أي لا يفقهون غيرهم كلاما . الباقون بفتح الياء والقاف ، أي يعلمون . والقراءتان صحيحتان ، فلا هم يفقهون من غيرهم ولا يفقهون غيرهم .\n                                    ",
        "saadi": "حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا ٣٩\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 92 و 93 :ـ\n{ ثُمَّ أَتْبَعَ سَبَبًا حَتَّى إِذَا بَلَغَ بَيْنَ السَّدَّيْنِ ْ} قال المفسرون: ذهب متوجها من المشرق، قاصدا للشمال، فوصل إلى ما بين السدين، وهما سدان، كانا سلاسل جبال معروفين في ذلك الزمان، سدا بين يأجوج ومأجوج وبين الناس، وجد من دون السدين قوما، لا يكادون يفقهون قولا، لعجمة ألسنتهم، واستعجام أذهانهم وقلوبهم، وقد أعطى الله ذا القرنين من الأسباب العلمية، ما فقه به ألسنة أولئك القوم وفقههم، وراجعهم، وراجعوه، فاشتكوا إليه ضرر يأجوج ومأجوج، وهما أمتان عظيمتان من بني آدم\n                                    "
      },
      "originalText": "حَتَّىٰٓ إِذَا بَلَغَ بَيۡنَ ٱلسَّدَّيۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمٗا لَّا يَكَادُونَ يَفۡقَهُونَ قَوۡلٗا ٣٩"
    },
    {
      "number": 2234,
      "text": "قَالُوا يَا ذَا الْقَرْنَيْنِ إِنَّ يَأْجُوجَ وَمَأْجُوجَ مُفْسِدُونَ فِي الْأَرْضِ فَهَلْ نَجْعَلُ لَكَ خَرْجًا عَلَىٰ أَنْ تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 94,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا ٤٩\n                                    \n                                    \n                                    ( قالوا ياذا القرنين إن يأجوج ومأجوج مفسدون في الأرض فهل نجعل لك خرجا ) قال ابن جريج عن عطاء ، عن ابن عباس : أجرا عظيما ، يعني أنهم أرادوا أن يجمعوا له من بينهم مالا يعطونه إياه ، حتى يجعل بينهم وبينهم سدا .\n                                    ",
        "qortoby": "قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا ٤٩\n                                    \n                                    \n                                    قالوا ياذا القرنين أي قالت له أمة من الإنس صالحة .\nإن يأجوج ومأجوج مفسدون في الأرض قال الأخفش : من همز يأجوج فجعل الألفين من الأصل يقول : يأجوج يفعول ومأجوج مفعول كأنه من أجيج النار . قال : ومن لا يهمز ويجعل الألفين زائدتين يقول : \" ياجوج \" من يججت وماجوج من مججت وهما غير مصروفين ; قال رؤبة :\nلو أن ياجوج وماجوج معا وعاد عاد واستجاشوا تبعا\nذكره الجوهري . وقيل : إنما لم ينصرفا لأنهما اسمان أعجميان ، مثل طالوت وجالوت غير مشتقين ; علتاهما في منع الصرف العجمة والتعريف والتأنيث . وقالت فرقة : هو معرب من أج وأجج علتاهما في منع الصرف التعريف والتأنيث . وقال أبو علي : يجوز أن يكونا عربيين ; فمن همز يأجوج فهو على وزن يفعول مثل يربوع ، من قولك أجت النار أي ضويت ، ومنه الأجيج ، ومنه ملح أجاج ، ومن لم يهمز أمكن أن يكون خفف الهمزة فقلبها ألفا مثل رأس ، وأما مأجوج فهو مفعول من أج ، والكلمتان من أصل واحد في الاشتقاق ومن لم يهمز فيجوز أن يكون خفف الهمزة ، ويجوز أن يكون فاعولا من مج ، وترك الصرف فيهما للتأنيث والتعريف كأنه اسم للقبيلة . واختلف في إفسادهم ; سعيد بن عبد العزيز : إفسادهم أكل بني آدم . وقالت فرقة : إفسادهم إنما كان متوقعا ، أي سيفسدون ، فطلبوا وجه التحرز منهم . وقالت فرقة : إفسادهم هو الظلم والغشم والقتل وسائر وجوه الإفساد المعلوم من البشر ، والله أعلم . وقد وردت أخبار بصفتهم وخروجهم وأنهم ولد يافث . روى أبو هريرة عن النبي - صلى الله عليه وسلم - قال : ولد لنوح سام وحام ويافث فولد سام العرب وفارس والروم والخير فيهم وولد يافث يأجوج ومأجوج والترك والصقالبة ولا خير فيهم وولد حام القبط والبربر والسودان . وقال كعب الأحبار : احتلم آدم - عليه السلام - فاختلط ماؤه بالتراب فأسف فخلقوا من ذلك الماء ، فهم متصلون بنا من جهة الأب لا من جهة الأم . وهذا فيه نظر ; لأن الأنبياء - صلوات الله عليهم - لا يحتلمون ، وإنما هم من ولد يافث ، وكذلك قال مقاتل وغيره . وروى أبو سعيد الخدري عن النبي - صلى الله عليه وسلم - أنه قال : لا يموت رجل منهم حتى يولد لصلبه ألف رجل . يعني يأجوج ومأجوج . وقال أبو سعيد : هم خمس وعشرون قبيلة من وراء يأجوج ومأجوج لا يموت الرجل من هؤلاء ومن يأجوج ومأجوج حتى يخرج من صلبه ألف رجل ذكره القشيري . وقال عبد الله بن مسعود : سألت النبي - صلى الله عليه وسلم - عن يأجوج ومأجوج ، فقال - عليه الصلاة والسلام - : يأجوج ومأجوج أمتان كل أمة أربعمائة ألف أمة كل أمة لا يعلم عددها إلا الله لا يموت الرجل منهم حتى يولد له ألف ذكر من صلبه كلهم قد حمل السلاح قيل : يا رسول الله صفهم لنا . قال : ( هم ثلاثة أصناف صنف منهم أمثال الأرز - شجر بالشام طول الشجرة عشرون ومائة ذراع - وصنف عرضه وطوله سواء نحوا من الذراع وصنف يفترش أذنه ويلتحف بالأخرى لا يمرون بفيل ولا وحش ولا خنزير إلا أكلوه ويأكلون من مات منهم مقدمتهم بالشام وساقتهم بخراسان يشربون أنهار الشرق وبحيرة طبرية فيمنعهم الله من مكة والمدينة وبيت المقدس . وقال علي - رضي الله - تعالى - عنه - : ( وصنف منهم في طول شبر ، لهم مخالب وأنياب السباع ، وتداعي الحمام ، وتسافد البهائم ، وعواء الذئاب ، وشعور تقيهم الحر والبرد ، وأذان عظام إحداها وبرة يشتون فيها ، والأخرى جلدة يصيفون فيها ، ويحفرون السد حتى كادوا ينقبونه فيعيده الله كما كان ، فيقولون : ننقبه غدا إن شاء الله - تعالى - فينقبونه ويخرجون ، ويتحصن الناس بالحصون ، فيرمون إلى السماء فيرد السهم عليهم ملطخا بالدم ، ثم يهلكهم الله - تعالى - بالنغف في رقابهم ) . ذكره الغزنوي . وقال علي عن النبي - صلى الله عليه وسلم - : يأجوج أمة لها أربعمائة أمير وكذا مأجوج لا يموت أحدهم حتى ينظر إلى ألف فارس من ولده .\nقلت : وقد جاء مرفوعا من حديث أبي هريرة ، خرجه ابن ماجه في السنن قال : قال رسول الله - صلى الله عليه وسلم - : إن يأجوج ومأجوج يحفران كل يوم حتى إذا كادوا يرون شعاع الشمس قال الذي عليهم ارجعوا فستحفرونه غدا فيعيده الله أشد ما كان حتى إذا بلغت مدتهم وأراد الله - تعالى - أن يبعثهم على الناس حفروا حتى إذا كادوا يرون شعاع الشمس قال ارجعوا فستحفرونه غدا إن شاء الله - تعالى - فاستثنوا فيعودون إليه وهو كهيئته حين تركوه فيحفرونه ويخرجون على الناس فينشفون الماء ويتحصن الناس منهم في حصونهم فيرمون بسهامهم إلى السماء فيرجع عليها الدم - الذي أحفظ - فيقولون قهرنا أهل الأرض وعلونا أهل السماء فيبعث الله - تعالى - عليهم نغفا في أقفائهم فيقتلهم بها قال رسول الله - صلى الله عليه وسلم - : والذي نفسي بيده إن دواب الأرض لتسمن وتشكر شكرا من لحومهم قال الجوهري شكرت الناقة تشكر شكرا فهي شكرة ; وأشكر الضرع امتلأ لبنا .\nوقال وهب بن منبه : رآهم ذو القرنين ، وطول الواحد منهم مثل نصف الرجل المربوع منا ، لهم مخاليب في مواضع الأظفار وأضراس وأنياب كالسباع ، وأحناك كأحناك الإبل ، وهم هلب عليهم من الشعر ما يواريهم ، ولكل واحد منهم أذنان عظيمتان ، يلتحف إحداهما ويفترش الأخرى ، وكل واحد منهم قد عرف أجله لا يموت حتى يخرج له من صلبه ألف رجل إن كان ذكرا ، ومن رحمها ألف أنثى إن كانت أنثى . وقال السدي والضحاك : الترك شرذمة من يأجوج ومأجوج خرجت تغير ، فجاء ذو القرنين فضرب السد فبقيت في هذا الجانب . قال السدي : بني السد على إحدى وعشرين قبيلة ، وبقيت منهم قبيلة واحدة دون السد فهم الترك . وقاله قتادة .\nقلت : وإذا كان هذا ، فقد نعت النبي - صلى الله عليه وسلم - الترك كما نعت يأجوج ومأجوج ، فقال - عليه الصلاة والسلام - : لا تقوم الساعة حتى يقاتل المسلمون الترك قوما وجوههم كالمجان المطرقة يلبسون الشعر ويمشون في الشعر في رواية ينتعلون الشعر خرجه مسلم وأبو داود وغيرهما . ولما علم النبي - صلى الله عليه وسلم - عددهم وكثرتهم وحدة شوكتهم قال - عليه الصلاة والسلام - : اتركوا الترك ما تركوكم . وقد خرج منهم في هذا الوقت أمم لا يحصيهم إلا الله - تعالى - ، ولا يردهم عن المسلمين إلا الله - تعالى - ، حتى كأنهم يأجوج ومأجوج أو مقدمتهم . وروى أبو داود عن أبي بكرة أن رسول الله - صلى الله عليه وسلم - قال : ينزل ناس من أمتي بغائط يسمونه البصرة عند نهر يقال له دجلة يكون عليه جسر يكثر أهلها وتكون من أمصار المهاجرين - قال ابن يحيى قال أبو معمر وتكون من أمصار المسلمين فإذا كان في آخر الزمان جاء بنو قنطوراء عراض الوجوه صغار الأعين حتى ينزلوا على شاطئ النهر فيتفرق أهلها ثلاث فرق فرقة يأخذون أذناب البقر والبرية وهلكوا وفرقة يأخذون لأنفسهم وكفروا وفرقة يجعلون ذراريهم خلف ظهورهم ويقاتلونهم وهم الشهداء الغائط المطمئن من الأرض والبصرة الحجارة الرخوة وبها سميت البصرة وبنو قنطوراء هم الترك يقال : إن قنطوراء اسم جارية كانت لإبراهيم - صلوات الله وسلامه عليه - ، ولدت له أولادا جاء من نسلهم الترك .\nقوله تعالى : فهل نجعل لك خرجا على أن تجعل بيننا وبينهم سدا\nفيه مسألتان :\nالأولى : قوله تعالى : فهل نجعل لك خرجا استفهام على جهة حسن الأدب خرجا أي جعلا وقرئ \" خراجا \" والخرج أخص من الخراج يقال : أد خرج رأسك وخراج مدينتك وقال الأزهري : الخراج يقع على الضريبة ، ويقع على مال الفيء ، ويقع على الجزية وعلى الغلة والخراج اسم لما يخرج من الفرائض في الأموال . والخرج : المصدر .\nوقوله تعالى : على أن تجعل بيننا وبينهم سدا أي ردما ; والردم ما جعل بعضه على بعض حتى يتصل وثوب مردم أي مرقع ، قاله الهروي يقال : ردمت الثلمة أردمها بالكسر ردما أي سددتها والردم أيضا الاسم وهو السد وقيل : الردم أبلغ من السد إذ السد كل ما يسد به والردم وضع الشيء على الشيء من حجارة أو تراب أو نحوه حتى يقوم من ذلك حجاب منيع ومنه ردم ثوبه إذا رقعه برقاع متكاثفة بعضها فوق بعض ومنه قول عنترة :\nهل غادر الشعراء من متردم\nأي من قول يركب بعضه على بعض . وقرئ سدا بالفتح في السين ، فقال الخليل وسيبويه : الضم هو الاسم والفتح المصدر . وقال الكسائي : الفتح والضم لغتان بمعنى واحد وقال عكرمة وأبو عمرو بن العلاء وأبو عبيدة : ما كان من خلقة الله لم يشاركه فيه أحد بعمل فهو بالضم ، وما كان من صنع البشر فهو بالفتح . ويلزم أهل هذه المقالة أن يقرءوا سدا بالفتح وقبله بين السدين بالضم ، وهي قراءة حمزة والكسائي . وقال أبو حاتم عن ابن عباس وعكرمة عكس ما قال أبو عبيدة . وقال ابن أبي إسحاق : ما رأته عيناك فهو سد بالضم وما لا ترى فهو سد بالفتح .\nالثانية : في هذه الآية دليل على اتخاذ السجون ، وحبس أهل الفساد فيها ، ومنعهم من التصرف لما يريدونه ، ولا يتركون وما هم عليه ، بل يوجعون ضربا ويحبسون أو يكلفون ويطلقون كما فعل عمر - رضي الله عنه - .\n                                    ",
        "saadi": "قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا ٤٩\n                                        \n                                        \n                                        \n                                        { إِنَّ يَأْجُوجَ وَمَأْجُوجَ مُفْسِدُونَ فِي الْأَرْضِ ْ} بالقتل وأخذ الأموال وغير ذلك. { فَهَلْ نَجْعَلُ لَكَ خَرْجًا ْ} أي جعلا { عَلَى أَنْ تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا ْ} ودل ذلك على عدم اقتدارهم بأنفسهم على بنيان السد، وعرفوا اقتدار ذي القرنين عليه، فبذلوا له أجرة، ليفعل ذلك، وذكروا له السبب الداعي، وهو: إفسادهم في الأرض، فلم يكن ذو القرنين ذا طمع، ولا رغبة في الدنيا، ولا تاركا لإصلاح أحوال الرعية، بل كان قصده الإصلاح، فلذلك أجاب طلبتهم لما فيها من المصلحة، ولم يأخذ منهم أجرة، وشكر ربه على تمكينه واقتداره\n                                    "
      },
      "originalText": "قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا ٤٩"
    },
    {
      "number": 2235,
      "text": "قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيْرٌ فَأَعِينُونِي بِقُوَّةٍ أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 95,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا ٥٩\n                                    \n                                    \n                                    فقال ذو القرنين بعفة وديانة وصلاح وقصد للخير : ( ما مكني فيه ربي خير ) أي : إن الذي أعطاني الله من الملك والتمكين خير لي من الذي تجمعونه ، كما قال سليمان عليه السلام : ( أتمدونن بمال فما آتاني الله خير مما آتاكم بل أنتم بهديتكم تفرحون ) [ النمل : 36 ] وهكذا قال ذو القرنين : الذي أنا فيه خير من الذي تبذلونه ، ولكن ساعدوني ) بقوة ) أي : بعملكم وآلات البناء ،\n                                    ",
        "qortoby": "قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا ٥٩\n                                    \n                                    \n                                    قوله تعالى : قال ما مكني فيه ربي خير فيه مسألتان :\n[ الأولى ] قوله - تعالى - : قال ما مكني فيه ربي خير المعنى قال لهم ذو القرنين : ما بسطه الله - تعالى - لي من القدرة والملك خير من خرجكم وأموالكم ولكن أعينوني بقوة الأبدان ، أي برجال وعمل منكم بالأبدان ، والآلة التي أبني بها الردم وهو السد وهذا تأييد من الله - تعالى - لذي القرنين في هذه المحاورة فإن القوم لو جمعوا له خرجا لم يعنه أحد ولوكلوه إلى البنيان ، ومعونته بأنفسهم أجمل به وأسرع في انقضاء هذا العمل وربما أربى ما ذكروه له على الخرج . وقرأ ابن كثير وحده \" ما مكنني \" بنونين . وقرأ الباقون ما مكني فيه ربي\n[ الثانية ] في هذه الآية دليل على أن الملك فرض عليه أن يقوم بحماية الخلق في حفظ بيضتهم ، وسد فرجتهم ، وإصلاح ثغورهم ، من أموالهم التي تفيء عليهم ، وحقوقهم التي تجمعها خزانتهم تحت يده ونظره ، حتى لو أكلتها الحقوق ، وأنفذتها المؤن ، لكان عليهم جبر ذلك من أموالهم ، وعليه حسن النظر لهم ; وذلك بثلاثة شروط : الأول : ألا يستأثر عليهم بشيء . الثاني : أن يبدأ بأهل الحاجة فيعينهم الثالث أن يسوي في العطاء بينهم على قدر منازلهم ، فإذا فنيت بعد هذا وبقيت صفرا فأطلعت الحوادث أمرا بذلوا أنفسهم قبل أموالهم ، فإن لم يغن ذلك فأموالهم تؤخذ منهم على تقدير ، وتصريف بتدبير ; فهذا ذو القرنين لما عرضوا عليه المال في أن يكف عنهم ما يحذرونه من عادية يأجوج ومأجوج قال : لست أحتاج إليه وإنما أحتاج إليكم فأعينوني بقوة أي اخدموا بأنفسكم معي ، فإن الأموال عندي والرجال عندكم ، ورأى أن الأموال لا تغني عنهم ، فإنه إن أخذها أجرة نقص ذلك مما يحتاج إليه ، فيعود بالأجر عليهم ، فكان التطوع بخدمة الأبدان أولى . وضابط الأمر أنه لا يحل مال أحد إلا لضرورة تعرض ، فيؤخذ ذلك المال جهرا لا سرا ، وينفق بالعدل لا بالاستئثار ، وبرأي الجماعة لا بالاستبداد بالأمر . والله - تعالى - الموفق للصواب .\n                                    ",
        "saadi": "قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا ٥٩\n                                        \n                                        \n                                        \n                                        فقال لهم: { مَا مَكَّنِّي فِيهِ رَبِّي خَيْرٌ ْ} أي: مما تبذلون لي وتعطوني، وإنما أطلب منكم أن تعينوني بقوة منكم بأيديكم { أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا ْ} أي: مانعا من عبورهم عليكم.\n                                    "
      },
      "originalText": "قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ رَدۡمًا ٥٩"
    },
    {
      "number": 2236,
      "text": "آتُونِي زُبَرَ الْحَدِيدِ ۖ حَتَّىٰ إِذَا سَاوَىٰ بَيْنَ الصَّدَفَيْنِ قَالَ انْفُخُوا ۖ حَتَّىٰ إِذَا جَعَلَهُ نَارًا قَالَ آتُونِي أُفْرِغْ عَلَيْهِ قِطْرًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 96,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا ٦٩\n                                    \n                                    \n                                    ( أجعل بينكم وبينهم ردما آتوني زبر الحديد ) والزبر : جمع زبرة ، وهي القطعة منه ؛ قاله ابن عباس ، ومجاهد ، وقتادة . وهي كاللبنة ، يقال : كل لبنة [ زنة ] قنطار بالدمشقي ، أو تزيد عليه .\n( حتى إذا ساوى بين الصدفين ) أي : وضع بعضه على بعض من الأساس حتى إذا حاذى به رءوس الجبلين طولا وعرضا . واختلفوا في مساحة عرضه وطوله على أقوال . ( قال انفخوا ) أي : أجج عليه النار حتى صار كله نارا ، ( قال آتوني أفرغ عليه قطرا ) قال ابن عباس ، ومجاهد ، وعكرمة ، والضحاك ، وقتادة ، والسدي : هو النحاس . وزاد بعضهم : المذاب . ويستشهد بقوله تعالى : ( وأسلنا له عين القطر ) [ سبإ : 12 ] ولهذا يشبه بالبرد المحبر .\nقال ابن جرير : حدثنا بشر ، حدثنا يزيد ، حدثنا سعيد ، عن قتادة قال : ذكر لنا أن رجلا قال : يا رسول الله ، قد رأيت سد يأجوج ومأجوج ، قال : \" انعته لي \" قال : كالبرد المحبر ، طريقة سوداء . وطريقة حمراء . قال : \" قد رأيته \" . هذا حديث مرسل .\nوقد بعث الخليفة الواثق في دولته بعض أمرائه ، ووجه معه جيشا سرية ، لينظروا إلى السد ويعاينوه وينعتوه له إذا رجعوا . فتوصلوا من بلاد إلى بلاد ، ومن ملك إلى ملك ، حتى وصلوا إليه ، ورأوا بناءه من الحديد ومن النحاس ، وذكروا أنهم رأوا فيه بابا عظيما ، وعليه أقفال عظيمة ، ورأوا بقية اللبن والعمل في برج هناك . وأن عنده حرسا من الملوك المتاخمة له ، وأنه منيف عال ، شاهق ، لا يستطاع ولا ما حوله من الجبال . ثم رجعوا إلى بلادهم ، وكانت غيبتهم أكثر من سنتين ، وشاهدوا أهوالا وعجائب .\nثم قال الله تعالى :\n                                    ",
        "qortoby": "ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا ٦٩\n                                    \n                                    \n                                    قوله تعالى : آتوني زبر الحديد أي أعطوني زبر الحديد وناولونيها أمرهم بنقل الآلة ، وهذا كله إنما هو استدعاء العطية التي بغير معنى الهبة ، وإنما هو استدعاء للمناولة ، لأنه قد ارتبط من قوله : إنه لا يأخذ منهم الخرج فلم يبق إلا استدعاء المناولة ، وأعمال الأبدان . و زبر الحديد قطع الحديد . وأصل الكلمة الاجتماع ، ومنه زبرة الأسد لما اجتمع من الشعر على كاهله . وزبرت الكتاب أي كتبته وجمعت حروفه . وقرأ أبو بكر والمفضل \" ردما ايتوني \" من الإتيان الذي هو المجيء ; أي جيئوني بزبر الحديد ، فلما سقط الخافض انتصب بالفعل على نحو قول الشاعر :\nأمرتك الخير . . .\nحذف الجار فنصب الفعل وقرأ الجمهور زبر بفتح الباء وقرأ الحسن بضمها ; وكل ذلك جمع زبرة وهي القطعة العظيمة منه .\nقوله تعالى : حتى إذا ساوى يعني البناء فحذف لقوة الكلام عليه .\nبين الصدفين قال أبو عبيدة : هما جانبا الجبل ، وسميا بذلك لتصادفهما أي لتلاقيهما . وقاله الزهري وابن عباس ; ( كأنه يعرض عن الآخر ) من الصدوف ; قال الشاعر :\nكلا الصدفين ينفذه سناها توقد مثل مصباح الظلام\nويقال للبناء المرتفع صدف تشبيه بجانب الجبل . وفي الحديث : كان إذا مر بصدف مائل أسرع المشي . قال أبو عبيد : الصدف والهدف كل بناء عظيم مرتفع . ابن عطية : الصدفان الجبلان المتناوحان ولا يقال للواحد صدف ، وإنما يقال صدفان للاثنين ; لأن أحدهما يصادف الآخر . وقرأ نافع وحمزة والكسائي الصدفين بفتح الصاد وشدها وفتح الدال ، وهي قراءة عمر بن الخطاب - رضي الله تعالى عنه - وعمر بن عبد العزيز ، وهي اختيار أبي عبيدة لأنها أشهر اللغات . وقرأ ابن كثير وابن عامر وأبو عمرو \" الصدفين \" بضم الصاد والدال وقرأ عاصم في رواية أبي بكر \" الصدفين \" بضم الصاد وسكون الدال ، نحو الجرف والجرف فهو تخفيف . وقرأ ابن الماجشون بفتح الصاد وضم الدال . وقرأ قتادة \" بين الصدفين \" بفتح الصاد وسكون الدال ، وكل ذلك بمعنى واحد وهما الجبلان المتناوحان .\nقوله تعالى : قال انفخوا إلى آخر الآية أي على زبر الحديد بالأكيار ، وذلك أنه كان يأمر بوضع طاقة من الزبر والحجارة ، ثم يوقد عليها الحطب والفحم بالمنافخ حتى تحمى ، والحديد إذا أوقد عليه صار كالنار ، فذلك قوله - تعالى - : حتى إذا جعله نارا ثم يؤتى بالنحاس المذاب أو بالرصاص أو بالحديد بحسب الخلاف في القطر ، فيفرغه على تلك الطاقة المنضدة ، فإذا التأم واشتد ولصق البعض بالبعض استأنف وضع طاقة أخرى ، إلى أن استوى العمل فصار جبلا صلدا . قال قتادة : هو كالبرد المحبر ، طريقة سوداء ، وطريقة حمراء . ويروى أن رسول الله - صلى الله عليه وسلم - : جاءه رجل فقال : يا رسول الله إني رأيت سد يأجوج ومأجوج ، قال : كيف رأيته قال : رأيته كالبرد المحبر ، طريقة صفراء ، وطريقة حمراء ، وطريقة سوداء ، فقال رسول الله - صلى الله عليه وسلم - قد رأيته . ومعنى حتى إذا جعله نارا أي كالنار .\nومعنى آتوني أفرغ عليه قطرا أي أعطوني قطرا أفرغ عليه ، على التقديم والتأخير . ومن قرأ \" ائتوني \" فالمعنى عنده تعالوا أفرغ عليه نحاسا . والقطر عند أكثر المفسرين النحاس المذاب ، وأصله من القطر ; لأنه إذا أذيب قطر كما يقطر الماء وقالت فرقة : القطر الحديد المذاب . وقالت فرقة منهم ابن الأنباري : الرصاص المذاب . وهو مشتق من قطر يقطر قطرا . ومنه وأسلنا له عين القطر .\n                                    ",
        "saadi": "ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا ٦٩\n                                        \n                                        \n                                        \n                                        { آتُونِي زُبَرَ الْحَدِيدِ ْ} أي: قطع الحديد، فأعطوه ذلك.\n{ حَتَّى إِذَا سَاوَى بَيْنَ الصَّدَفَيْنِ ْ} أي: الجبلين اللذين بني بينهما السد { قَالَ انْفُخُوا ْ} النار أي: أوقدوها إيقادا عظيما، واستعملوا لها المنافيخ لتشتد، فتذيب النحاس، فلما ذاب النحاس، الذي يريد أن يلصقه بين زبر الحديد { قَالَ آتُونِي أُفْرِغْ عَلَيْهِ قِطْرًا ْ} أي: نحاسا مذابا، فأفرغ عليه القطر، فاستحكم السد استحكاما هائلا، وامتنع من وراءه من الناس، من ضرر يأجوج ومأجوج.\n                                    "
      },
      "originalText": "ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا ٦٩"
    },
    {
      "number": 2237,
      "text": "فَمَا اسْطَاعُوا أَنْ يَظْهَرُوهُ وَمَا اسْتَطَاعُوا لَهُ نَقْبًا",
      "surah": {
        "number": 18,
        "name": "سورة الكهف",
        "englishName": "Al-Kahf",
        "englishNameTranslation": "The Cave",
        "revelationType": "Meccan",
        "numberOfAyahs": 110
      },
      "numberInSurah": 97,
      "juz": 16,
      "manzil": 4,
      "page": 303,
      "ruku": 262,
      "hizbQuarter": 121,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا ٧٩\n                                    \n                                    \n                                    يقول تعالى مخبرا عن يأجوج ومأجوج أنهم ما قدروا على أن يصعدوا فوق هذا السد ولا قدروا على نقبه من أسفله . ولما كان الظهور عليه أسهل من نقبه قابل كلا بما يناسبه فقال : ( فما اسطاعوا أن يظهروه وما استطاعوا له نقبا ) وهذا دليل على أنهم لم يقدروا على نقبه ، ولا على شيء منه .\nفأما الحديث الذي رواه الإمام أحمد :\nحدثنا روح ، حدثنا سعيد بن أبي عروبة ، عن قتادة ، حدثنا أبو رافع ، عن أبي هريرة ، عن رسول الله صلى الله عليه وسلم قال : \" إن يأجوج ومأجوج ليحفرون السد كل يوم ، حتى إذا كادوا يرون شعاع الشمس قال الذي عليهم : ارجعوا فستحفرونه غدا فيعودون إليه كأشد ما كان ، حتى إذا بلغت مدتهم وأراد الله أن يبعثهم على الناس [ حفروا حتى إذا كادوا يرون شعاع الشمس ] قال الذي عليهم : ارجعوا فستحفرونه غدا إن شاء الله . ويستثني ، فيعودون إليه وهو كهيئته حين تركوه ، فيحفرونه ويخرجون على الناس ، فينشفون المياه ، ويتحصن الناس منهم في حصونهم ، فيرمون بسهامهم إلى السماء ، [ فترجع وعليها هيئة الدم ، فيقولون : قهرنا أهل الأرض وعلونا أهل السماء ] . فيبعث الله عليهم نغفا في أقفائهم ، فيقتلهم بها . قال رسول الله صلى الله عليه وسلم : \" والذي نفسي بيده ، إن دواب الأرض لتسمن ، وتشكر شكرا من لحومهم ودمائهم \" .\nورواه أحمد أيضا عن حسن - هو ابن موسى الأشيب - عن سفيان ، عن قتادة ، به . وكذا رواه ابن ماجه ، عن أزهر بن مروان ، عن عبد الأعلى ، عن سعيد بن أبي عروبة ، عن قتادة قال : حدث رافع . وأخرجه الترمذي ، من حديث أبي عوانة ، عن قتادة . ثم قال : غريب لا نعرفه إلا من هذا الوجه .\nوهذا إسناده قوي ، ولكن في رفعه نكارة ؛ لأن ظاهر الآية يقتضي أنهم لم يتمكنوا من ارتقائه ولا من نقبه ، لإحكام بنائه وصلابته وشدته . ولكن هذا قد روي عن كعب الأحبار : أنهم قبل خروجهم يأتونه فيلحسونه حتى لا يبقى منه إلا القليل ، فيقولون : غدا نفتحه . فيأتون من الغد وقد عاد كما كان ، فيلحسونه حتى لا يبقى منه إلا القليل ، فيقولون كذلك ، ويصبحون وهو كما كان ، فيلحسونه ويقولون : غدا نفتحه . ويلهمون أن يقولوا : \" إن شاء الله \" ، فيصبحون وهو كما فارقوه ، فيفتحونه . وهذا متجه ، ولعل أبا هريرة تلقاه من كعب . فإنه كثيرا ما كان يجالسه ويحدثه ، فحدث به أبو هريرة ، فتوهم بعض الرواة عنه أنه مرفوع ، فرفعه ، والله أعلم .\nويؤكد ما قلناه - من أنهم لم يتمكنوا من نقبه ولا نقب شيء منه ، ومن نكارة هذا المرفوع - قول الإمام أحمد :\nحدثنا سفيان ، عن الزهري ، عن عروة ، عن [ زينب بنت أبي سلمة ، عن حبيبة بنت أم حبيبة بنت أبي سفيان ، عن أمها أم حبيبة ، عن ] زينب بنت جحش زوج النبي صلى الله عليه وسلم - قال سفيان أربع نسوة - قالت : استيقظ النبي صلى الله عليه وسلم من نومه . وهو محمر وجهه ، وهو يقول : \" لا إله إلا الله! ويل للعرب من شر قد اقترب ! فتح اليوم من ردم يأجوج ومأجوج مثل هذا \" . وحلق . قلت : يا رسول الله ، أنهلك وفينا الصالحون ؟ قال : \" نعم إذا كثر الخبث \" .\nهذا حديث صحيح ، اتفق البخاري ومسلم على إخراجه ، من حديث الزهري ، ولكن سقط في رواية البخاري ذكر حبيبة ، وأثبتها مسلم . وفيه أشياء عزيزة نادرة قليلة الوقوع في صناعة الإسناد ، منها رواية الزهري عن عروة ، وهما تابعيان ومنها اجتماع أربع نسوة في سنده ، كلهن يروي بعضهن عن بعض . ثم كل منهن صحابية ، ثم ثنتان ربيبتان وثنتان زوجتان ، رضي الله عنهن .\nوقد روي نحو هذا عن أبي هريرة أيضا ، فقال البزار : حدثنا محمد بن مرزوق ، حدثنا مؤمل بن إسماعيل ، حدثنا وهيب ، عن ابن طاوس ، عن أبيه ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم أنه قال : \" فتح اليوم من ردم يأجوج ومأجوج مثل هذا \" وعقد التسعين . وأخرجه البخاري ومسلم من حديث وهيب ، به .\n                                    ",
        "qortoby": "فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا ٧٩\n                                    \n                                    \n                                    قوله تعالى : فما اسطاعوا أن يظهروه أي ما استطاع يأجوج ومأجوج أن يعلوه ويصعدوا فيه ; لأنه أملس مستو مع الجبل والجبل عال لا يرام . وارتفاع السد مائتا ذراع وخمسون ذراعا . وروي : في طوله ما بين طرفي الجبلين مائة فرسخ ، وفي عرضه خمسون فرسخا ; قاله وهب بن منبه .\nوما استطاعوا له نقبا لبعد عرضه وقوته . وروي في الصحيح عن أبي هريرة عن النبي - صلى الله عليه وسلم - قال : فتح اليوم من ردم يأجوج ومأجوج مثل هذه وعقد وهب بن منبه بيده تسعين وفي رواية - وحلق بإصبعه الإبهام والتي تليها . . . وذكر الحديث . وذكر يحيى بن سلام عن سعد بن أبي عروبة عن قتادة عن أبي رافع عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : إن يأجوج ومأجوج يخرقون السد كل يوم حتى إذا كادوا يرون شعاع الشمس قال الذي عليهم ارجعوا فستخرقونه غدا فيعيده الله كأشد ما كان حتى إذا بلغت مدتهم وأراد الله أن يبعثهم على الناس حفروا حتى إذا كادوا يرون شعاع الشمس قال الذي عليهم ارجعوا فستحفرونه إن شاء الله فيعودون إليه وهو كهيئته حين تركوه فيخرقونه ويخرجون على الناس . . . الحديث وقد تقدم .\nقوله - تعالى - : فما اسطاعوا بتخفيف الطاء على قراءة الجمهور . وقيل : هي لغة بمعنى استطاعوا . وقيل : بل استطاعوا بعينه كثر في كلام العرب حتى حذف بعضهم منه التاء فقالوا : اسطاعوا . وحذف بعضهم منه الطاء فقال استاع يستيع بمعنى استطاع يستطيع ، وهي لغة مشهورة . وقرأ حمزة وحده \" فما اسطاعوا \" بتشديد الطاء كأنه أراد استطاعوا ، ثم أدغم التاء في الطاء فشددها ، وهي قراءة ضعيفة الوجه ; قال أبو علي : هي غير جائزة . وقرأ الأعمش \" فما استطاعوا أن يظهروه وما استطاعوا له نقبا \" بالتاء في الموضعين .\n                                    ",
        "saadi": "فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا ٧٩\n                                        \n                                        \n                                        \n                                        { فَمَا اسْطَاعُوا أَنْ يَظْهَرُوهُ وَمَا اسْتَطَاعُوا لَهُ نَقْبًا ْ} أي: فما لهم استطاعة، ولا قدرة على الصعود عليه لارتفاعه، ولا على نقبه لإحكامه وقوته.\n                                    "
      },
      "originalText": "فَمَا ٱسۡطَٰعُوٓاْ أَن يَظۡهَرُوهُ وَمَا ٱسۡتَطَٰعُواْ لَهُۥ نَقۡبٗا ٧٩"
    }
  ]
}