{
  "number": 305,
  "ayahsNumber": 11,
  "ayahs": [
    {
      "number": 2251,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ كهيعص",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 1,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كٓهيعٓصٓ ١\n                                    \n                                    \n                                    سورة مريم: وهي مكية .\nوقد روى محمد بن إسحاق في السيرة من حديث أم سلمة وأحمد بن حنبل عن ابن مسعود في قصة الهجرة إلى أرض الحبشة من مكة أن جعفر بن أبي طالب رضي الله عنه قرأ صدر هذه السورة على النجاشي وأصحابه.\nقد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذانى قال: قال عبدالله فذكر نحوه.\nوحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لايـ نقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فا ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شىء حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدىء بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\n                                    ",
        "qortoby": "كٓهيعٓصٓ ١\n                                    \n                                    \n                                    تفسير سورة مريم عليها السلام وهي مكية بإجماع ، وهي تسعون وثمان آيات\nولما كانت وقعة بدر ، وقتل الله فيها صناديد الكفار ، قال كفار قريش : إن ثأركم بأرض الحبشة ، فأهدوا إلى النجاشي ، وابعثوا إليه رجلين من ذوي رأيكم لعله يعطيكم من عنده من قريش ، فتقتلونهم بمن قتل منكم ببدر ؛ فبعث كفار قريش عمرو بن العاص وعبد الله بن أبي ربيعة ، فسمع رسول الله - صلى الله عليه وسلم - ببعثهما ، فبعث رسول الله - صلى الله عليه وسلم - عمرو بن أمية الضمري ، وكتب معه إلى النجاشي ، فقدم على النجاشي ، فقرأ كتاب رسول الله - صلى الله عليه وسلم - ، ثم دعا جعفر بن أبي طالب والمهاجرين ، وأرسل إلى الرهبان والقسيسين فجمعهم ، ثم أمر جعفرا أن يقرأ عليهم القرآن ، فقرأ سورة مريم كهيعص وقاموا تفيض أعينهم من الدمع ، فهم الذين أنزل الله تعالى فيهم ولتجدن أقربهم مودة للذين آمنوا الذين قالوا إنا نصارى ذلك بأن منهم قسيسين ورهبانا وأنهم لا يستكبرون . وقرأ إلى قوله : الشاهدين . ذكره أبو داود .\nوفي السيرة ؛ فقال النجاشي : هل معك مما جاء به عن الله شيء ؟ قال جعفر : نعم ؛ فقال له النجاشي : اقرأه علي . قال : فقرأ كهيعص فبكى والله النجاشي حتى أخضل لحيته ، وبكت أساقفتهم حتى أخضلوا لحاهم حين سمعوا ما يتلى عليهم ؛ فقال النجاشي : هذا والذي جاء به موسى ليخرج من مشكاة واحدة ، انطلقا فوالله لا أسلمهم إليكما أبدا ؛ وذكر تمام الخبر .\nكهيعص ذكر رحمة ربك عبده زكريا إذ نادى ربه نداء خفيا قال رب إني وهن العظم مني واشتعل الرأس شيبا ولم أكن بدعائك رب شقيا وإني خفت الموالي من ورائي وكانت امرأتي عاقرا فهب لي من لدنك وليا يرثني ويرث من آل يعقوب واجعله رب رضيا يازكريا إنا نبشرك بغلام اسمه يحيى لم نجعل له من قبل سميا قال رب أنى يكون لي غلام وكانت امرأتي عاقرا وقد بلغت من الكبر عتيا قال كذلك قال ربك هو علي هين وقد خلقتك من قبل ولم تك شيئا قال رب اجعل لي آية قال آيتك ألا تكلم الناس ثلاث ليال سويا فخرج على قومه من المحراب فأوحى إليهم أن سبحوا بكرة وعشيا يايحيى خذ الكتاب بقوة وآتيناه الحكم صبيا وحنانا من لدنا وزكاة وكان تقيا وبرا بوالديه ولم يكن جبارا عصيا وسلام عليه يوم ولد ويوم يموت ويوم يبعث حيا\nقوله تعالى : كهيعص تقدم الكلام في أوائل السور . وقال ابن عباس في كهيعص : إن الكاف من كاف ، والهاء من هاد ، والياء من حكيم ، والعين من عليم ، والصاد من صادق ، ذكره ابن عزيز القشيري عن ابن عباس ؛ معناه كاف لخلقه ، هاد لعباده ، يده فوق أيديهم ، عالم بهم ، صادق في وعده ؛ ذكره الثعلبي عن الكلبي و السدي ومجاهد والضحاك .\nوقال الكلبي أيضا : الكاف من كريم وكبير وكاف ، والهاء من هاد ، والياء من رحيم ، والعين من عليم وعظيم ، والصاد من صادق ؛ والمعنى واحد . وعن ابن عباس أيضا : هو اسم من أسماء الله تعالى ؛ وعن علي - رضي الله عنه - هو اسم الله - عز وجل - وكان يقول : يا كهيعص اغفر لي ؛ ذكره الغزنوي .\nالسدي : هو اسم الله الأعظم الذي إذا سئل به أعطى ، وإذا دعي به أجاب . وقتادة : هو اسم من أسماء القرآن ؛ ذكره عبد الرزاق . عن معمر عنه . وقيل : هو اسم للسورة ؛ وهو اختيار القشيري في أوائل الحروف ؛ وعلى هذا قيل : تمام الكلام عند قوله : كهيعص كأنه إعلام باسم السورة ، كما تقول : كتاب كذا أو باب كذا ثم تشرع في المقصود . وقرأ ابن جعفر هذه الحروف متقطعة ، ووصلها الباقون ، وأمال أبو عمرو الهاء وفتح الياء ، وابن عامر وحمزة بالعكس ، وأمالهما جميعا الكسائي وأبو بكر وخلف . وقرأهما بين اللفظين أهل المدينة نافع وغيره . وفتحهما الباقون . وعن خارجة أن الحسن كان يضم \" كاف \" ، وحكى غيره أنه كان يضم \" ها \" ، وحكى إسماعيل بن إسحاق أنه كان يضم \" يا \" . قال أبو حاتم : ولا يجوز ضم الكاف والهاء والياء ؛ قال النحاس : قراءة أهل المدينة من أحسن ما في هذا ، والإمالة جائزة في \" ها \" و \" يا \" . وأما قراءة الحسن فأشكلت على جماعة حتى قالوا : لا تجوز ؛ منهم أبو حاتم . والقول فيها ما بينه هارون القارئ ؛ قال : كان الحسن يشم الرفع ؛ فمعنى هذا أنه كان يومئ ؛ كما حكى سيبويه أن من العرب من يقول : الصلاة والزكاة يومئ إلى الواو ، ولهذا كتبها في المصحف بالواو . وأظهر الدال من هجاء ( ص ) نافع وابن كثير وعاصم ويعقوب ، وهو اختيار أبي عبيد ؛ وأدغمها الباقون .\n                                    ",
        "saadi": "كٓهيعٓصٓ ١\n                                        \n                                        \n                                        \n                                        تقدم الكلام عن الحروف المقطعة\n                                    "
      },
      "originalText": "كٓهيعٓصٓ ١"
    },
    {
      "number": 2252,
      "text": "ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 2,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذِكۡرُ رَحۡمَتِ رَبِّكَ عَبۡدَهُۥ زَكَرِيَّآ ٢\n                                    \n                                    \n                                    وقوله : ( ذكر رحمة ربك ) أي : هذا ذكر رحمة الله بعبده زكريا .\nوقرأ يحيى بن يعمر \" ذكر رحمة ربك عبده زكريا \" .\nو ( زكريا ) : يمد ويقصر قراءتان مشهورتان . وكان نبيا عظيما من أنبياء بني إسرائيل . وفي صحيح البخاري : أنه كان نجارا ، أي : كان يأكل من عمل يديه في النجارة .\n                                    ",
        "qortoby": "ذِكۡرُ رَحۡمَتِ رَبِّكَ عَبۡدَهُۥ زَكَرِيَّآ ٢\n                                    \n                                    \n                                    قوله تعالى : ذكر رحمة ربك عبده زكريا\nفيه :\nالأولى : قوله تعالى : ذكر رحمة ربك في رفع ذكر ثلاثة أقوال ؛ قال الفراء : هو مرفوع ب كهيعص ؛ قال الزجاج : هذا محال ؛ لأن كهيعص ليس هو مما أنبأنا الله - عز وجل - به عن زكريا ، وقد خبر الله تعالى عنه وعن ما بشر به ، وليس كهيعص من قصته . وقال الأخفش : التقدير ؛ فيما يقص عليكم ذكر رحمة ربك . والقول الثالث : أن المعنى هذا الذي يتلوه عليكم ذكر رحمة ربك . وقيل : ذكر رحمة ربك رفع بإضمار مبتدأ ؛ أي هذا ذكر رحمة ربك ؛ وقرأ الحسن ( ذكر رحمة ربك ) أي هذا المتلو من القرآن ذكر رحمة ربك . وقرئ ( ذكر ) على الأمر .\nورحمة تكتب ويوقف عليها بالهاء ، وكذلك كل ما كان مثلها ، لا اختلاف فيها بين النحويين ، واعتلوا في ذلك أن هذه الهاء لتأنيث الأسماء فرقا بينها وبين الأفعال .\nالثانية : قوله تعالى : عبده قال الأخفش : هو منصوب ب ( رحمة ) . زكريا بدل منه ، كما تقول : هذا ذكر ضرب زيد عمرا ؛ فعمرا منصوب بالضرب ؛ كما أن عبده منصوب بالرحمة . وقيل : هو على التقديم والتأخير ؛ معناه : ذكر ربك عبده زكريا برحمة ؛ ف ( عبده ) منصوب بالذكر ؛ ذكره الزجاج والفراء . وقرأ بعضهم ( عبده زكريا ) بالرفع ؛ وهي قراءة أبي العالية . وقرأ يحيى بن يعمر ( ذكر ) بالنصب على معنى : هذا القرآن ذكر رحمة عبده زكريا . وتقدمت اللغات والقراءة في زكريا في ( آل عمران ) .\n                                    ",
        "saadi": "ذِكۡرُ رَحۡمَتِ رَبِّكَ عَبۡدَهُۥ زَكَرِيَّآ ٢\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 2و 3 :ـ\nأي: هذا { ذِكْرُ رَحْمَةِ رَبِّكَ عَبْدَهُ زَكَرِيَّا ْ} سنقصه عليك، ونفصله تفصيلا يعرف به حالة نبيه زكريا، وآثاره الصالحة، ومناقبه الجميلة، فإن في قصها عبرة للمعتبرين، وأسوة للمقتدين، ولأن في تفصيل رحمته لأوليائه، وبأي: سبب حصلت لهم، مما يدعو إلى محبة الله تعالى، والإكثار من ذكره ومعرفته، والسبب الموصل إليه. وذلك أن الله تعالى اجتبى واصطفى زكريا عليه السلام لرسالته، وخصه بوحيه، فقام بذلك قيام أمثاله من المرسلين، ودعا العباد إلى ربه، وعلمهم ما علمه الله، ونصح لهم في حياته وبعد مماته، كإخوانه من المرسلين ومن اتبعهم، فلما رأى من نفسه الضعف، وخاف أن يموت، ولم يكن أحد ينوب منابه في دعوة الخلق إلى ربهم والنصح لهم، شكا إلى ربه ضعفه الظاهر والباطن، وناداه نداء خفيا، ليكون أكمل وأفضل وأتم إخلاصا.\n                                    "
      },
      "originalText": "ذِكۡرُ رَحۡمَتِ رَبِّكَ عَبۡدَهُۥ زَكَرِيَّآ ٢"
    },
    {
      "number": 2253,
      "text": "إِذْ نَادَىٰ رَبَّهُ نِدَاءً خَفِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 3,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيّٗا ٣\n                                    \n                                    \n                                    وقوله : ( إذ نادى ربه نداء خفيا ) : قال بعض المفسرين : إنما أخفى دعاءه ، لئلا ينسب في طلب الولد إلى الرعونة لكبره . حكاه الماوردي .\nوقال آخرون : إنما أخفاه لأنه أحب إلى الله . كما قال قتادة في هذه الآية ( إذ نادى ربه نداء خفيا ) : إن الله يعلم القلب التقي ، ويسمع الصوت الخفي .\nوقال بعض السلف : قام من الليل ، عليه السلام ، وقد نام أصحابه ، فجعل يهتف بربه يقول خفية : يا رب ، يا رب ، يا رب فقال الله : لبيك ، لبيك ، لبيك .\n                                    ",
        "qortoby": "إِذۡ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيّٗا ٣\n                                    \n                                    \n                                    قوله تعالى : إذ نادى ربه نداء خفيا مثل قوله : ادعوا ربكم تضرعا وخفية إنه لا يحب المعتدين وقد تقدم . والنداء الدعاء والرغبة ؛ أي ناجى ربه بذلك في محرابه . دليله قوله : فنادته الملائكة وهو قائم يصلي في المحراب فبين أنه استجاب له في صلاته ، كما نادى في الصلاة . واختلف في إخفائه هذا النداء ؛ فقيل : أخفاه من قومه لئلا يلام على مسألة الولد عند كبر السن ؛ ولأنه أمر دنيوي ، فإن أجيب فيه نال بغيته ، وإن لم يجب لم يعرف بذلك أحد .\nوقيل : مخلصا فيه لم يطلع عليه إلا الله تعالى . وقيل : لما كانت الأعمال الخفية أفضل وأبعد من الرياء أخفاه . وقيل : خفيا سرا من قومه في جوف الليل ؛ والكل محتمل والأول أظهر ؛ والله أعلم .\nوقد تقدم أن المستحب من الدعاء الإخفاء في سورة ( الأعراف ) وهذه الآية نص في ذلك ؛ لأنه سبحانه أثنى بذلك على زكريا . وروى إسماعيل قال حدثنا مسدد قال حدثنا يحيى بن سعيد عن أسامة بن زيد عن محمد بن عبد الرحمن ، وهو ابن أبي كبشة عن سعد بن أبي وقاص عن النبي - صلى الله عليه وسلم - قال : إن خير الذكر الخفي وخير الرزق ما يكفي وهذا عام . قال يونس بن عبيد : كان الحسن يرى أن يدعو الإمام في القنوت ويؤمن من خلفه من غير رفع صوت ، وتلا يونس إذ نادى ربه نداء خفيا . قال ابن العربي : وقد أسر مالك القنوت وجهر به الشافعي ، والجهر به أفضل ؛ لأن النبي - صلى الله عليه وسلم - كان يدعو به جهرا .\n                                    ",
        "saadi": "إِذۡ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيّٗا ٣\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 2و 3 :ـ\nأي: هذا { ذِكْرُ رَحْمَةِ رَبِّكَ عَبْدَهُ زَكَرِيَّا ْ} سنقصه عليك، ونفصله تفصيلا يعرف به حالة نبيه زكريا، وآثاره الصالحة، ومناقبه الجميلة، فإن في قصها عبرة للمعتبرين، وأسوة للمقتدين، ولأن في تفصيل رحمته لأوليائه، وبأي: سبب حصلت لهم، مما يدعو إلى محبة الله تعالى، والإكثار من ذكره ومعرفته، والسبب الموصل إليه. وذلك أن الله تعالى اجتبى واصطفى زكريا عليه السلام لرسالته، وخصه بوحيه، فقام بذلك قيام أمثاله من المرسلين، ودعا العباد إلى ربه، وعلمهم ما علمه الله، ونصح لهم في حياته وبعد مماته، كإخوانه من المرسلين ومن اتبعهم، فلما رأى من نفسه الضعف، وخاف أن يموت، ولم يكن أحد ينوب منابه في دعوة الخلق إلى ربهم والنصح لهم، شكا إلى ربه ضعفه الظاهر والباطن، وناداه نداء خفيا، ليكون أكمل وأفضل وأتم إخلاصا.\n                                    "
      },
      "originalText": "إِذۡ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيّٗا ٣"
    },
    {
      "number": 2254,
      "text": "قَالَ رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَلَمْ أَكُنْ بِدُعَائِكَ رَبِّ شَقِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 4,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ رَبِّ إِنِّي وَهَنَ ٱلۡعَظۡمُ مِنِّي وَٱشۡتَعَلَ ٱلرَّأۡسُ شَيۡبٗا وَلَمۡ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيّٗا ٤\n                                    \n                                    \n                                    ( قال رب إني وهن العظم مني ) أي : ضعفت وخارت القوى ، ( واشتعل الرأس شيبا ) أي اضطرم المشيب في السواد ، كما قال ابن دريد في مقصورته :\nإما ترى رأسي حاكي لونه طرة صبح تحت أذيال الدجى واشتعل المبيض في مسوده\nمثل اشتعال النار في جمر الغضا\nوالمراد من هذا : الإخبار عن الضعف والكبر ، ودلائله الظاهرة والباطنة .\nوقوله : ( ولم أكن بدعائك رب شقيا ) أي : ولم أعهد منك إلا الإجابة في الدعاء ، ولم تردني قط فيما سألتك .\n                                    ",
        "qortoby": "قَالَ رَبِّ إِنِّي وَهَنَ ٱلۡعَظۡمُ مِنِّي وَٱشۡتَعَلَ ٱلرَّأۡسُ شَيۡبٗا وَلَمۡ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيّٗا ٤\n                                    \n                                    \n                                    قوله تعالى : قال رب إني وهن العظم مني فيه مسألتان : الأولى : قوله تعالى : قال رب إني وهن قرئ وهن بالحركات الثلاث أي ضعف . يقال : وهن يهن وهنا إذا ضعف فهو واهن . وقال أبو زيد يقال : وهن يهن ووهن يوهن . وإنما ذكر العظم لأنه عمود البدن ، وبه قوامه ، وهو أصل بنائه ، فإذا وهن تداعى وتساقط سائر قوته ؛ ولأنه أشد ما فيه وأصلبه ؛ فإذا وهن كان ما وراءه أوهن منه . ووحده لأن الواحد هو الدال على معنى الجنسية ، وقصده إلى أن هذا الجنس الذي هو العمود والقوام ، وأشد ما تركب منه الجسد قد أصابه الوهن ، ولو جمع لكان قصد إلى معنى آخر ، وهو أنه لم يهن منه بعض عظامه ولكن كلها .\nالثانية : قوله تعالى : واشتعل الرأس شيبا أدغم السين في الشين أبو عمرو . وهذا من أحسن الاستعارة في كلام العرب . والاشتعال انتشار شعاع النار ؛ شبه به انتشار الشيب في الرأس ؛ يقول : شخت وضعفت ؛ وأضاف الاشتعال إلى مكان الشعر ومنبته وهو الرأس . ولم يضف الرأس اكتفاء بعلم المخاطب أنه رأس زكريا - عليه السلام - . و شيبا في نصبه وجهان : أحدهما : أنه مصدر ؛ لأن معنى اشتعل شاب ؛ وهذا قول الأخفش . وقال الزجاج : وهو منصوب على التمييز . النحاس : قول الأخفش أولى ؛ لأنه مشتق من فعل فالمصدر أولى به . والشيب مخالطة الشعر الأبيض الأسود .\nقال العلماء : يستحب للمرء أن يذكر في دعائه نعم الله تعالى عليه وما يليق بالخضوع ؛ لأن قوله تعالى : وهن العظم مني إظهار للخضوع . وقوله : ولم أكن بدعائك رب شقيا إظهار لعادات تفضله في إجابته أدعيته ؛ أي لم أكن بدعائي إياك شقيا ؛ أي لم تكن تخيب دعائي إذا دعوتك ؛ أي إنك عودتني الإجابة فيما مضى . يقال : شقي بكذا أي تعب فيه ولم يحصل مقصوده . وعن بعضهم أن محتاجا سأله ، وقال : أنا الذي أحسنت إليه في وقت كذا ؛ فقال : مرحبا بمن توسل بنا إلينا ؛ وقضى حاجته .\n                                    ",
        "saadi": "قَالَ رَبِّ إِنِّي وَهَنَ ٱلۡعَظۡمُ مِنِّي وَٱشۡتَعَلَ ٱلرَّأۡسُ شَيۡبٗا وَلَمۡ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيّٗا ٤\n                                        \n                                        \n                                        \n                                        { رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي ْ}\nأي: وهى وضعف، وإذا ضعف العظم، الذي هو عماد البدن، ضعف غيره، { وَاشْتَعَلَ الرَّأْسُ شَيْبًا ْ} لأن الشيب دليل الضعف والكبر، ورسول الموت ورائده، ونذيره، فتوسل إلى الله تعالى بضعفه وعجزه، وهذا من أحب الوسائل إلى الله، لأنه يدل على التبري من الحول والقوة، وتعلق القلب بحول الله وقوته.\n{ وَلَمْ أَكُنْ بِدُعَائِكَ رَبِّ شَقِيًّا ْ} أي: لم تكن يا رب تردني خائبا ولا محروما من الإجابة، بل لم تزل بي حفيا ولدعائي مجيبا، ولم تزل ألطافك تتوالى علي، وإحسانك واصلا إلي، وهذا توسل إلى الله بإنعامه عليه، وإجابة دعواته السابقة، فسأل الذي أحسن سابقا، أن يتمم إحسانه لاحقا.\n                                    "
      },
      "originalText": "قَالَ رَبِّ إِنِّي وَهَنَ ٱلۡعَظۡمُ مِنِّي وَٱشۡتَعَلَ ٱلرَّأۡسُ شَيۡبٗا وَلَمۡ أَكُنۢ بِدُعَآئِكَ رَبِّ شَقِيّٗا ٤"
    },
    {
      "number": 2255,
      "text": "وَإِنِّي خِفْتُ الْمَوَالِيَ مِنْ وَرَائِي وَكَانَتِ امْرَأَتِي عَاقِرًا فَهَبْ لِي مِنْ لَدُنْكَ وَلِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 5,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنِّي خِفۡتُ ٱلۡمَوَٰلِيَ مِن وَرَآءِي وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا فَهَبۡ لِي مِن لَّدُنكَ وَلِيّٗا ٥\n                                    \n                                    \n                                    وقوله : ( وإني خفت الموالي من ورائي ) : قرأ الأكثرون بنصب \" الياء \" من ( الموالي ) على أنه مفعول ، وعن الكسائي أنه سكن الياء ، كما قال الشاعر :\nكأن أيديهن في القاع الفرق أيدي جوار يتعاطين الورق\nوقال الآخر :\nفتى لو يباري الشمس ألقت قناعها أو القمر الساري لألقى المقالدا\nومنه قول أبي تمام حبيب بن أوس الطائي :\nتغاير الشعر فيه إذ سهرت له حتى ظننت قوافيه ستقتتل\nوقال مجاهد ، وقتادة ، والسدي : أراد بالموالي العصبة . وقال أبو صالح : الكلالة .\nوروي عن أمير المؤمنين عثمان بن عفان - رضي الله عنه - أنه كان يقرؤها : \" وإني خفت الموالي من ورائي \" بتشديد الفاء بمعنى : قلت عصباتي من بعدي .\nوعلى القراءة الأولى ، وجه خوفه أنه خشي أن يتصرفوا من بعده في الناس تصرفا سيئا ، فسأل الله ولدا ، يكون نبيا من بعده ، ليسوسهم بنبوته وما يوحى إليه . فأجيب في ذلك ، لا أنه خشي من وراثتهم له ماله ، فإن النبي أعظم منزلة وأجل قدرا من أن يشفق على ماله إلى ما هذا حده أن يأنف من وراثة عصباته له ، ويسأل أن يكون له ولد ، فيحوز ميراثه دونه دونهم . هذا وجه .\nالثاني : أنه لم يذكر أنه كان ذا مال ، بل كان نجارا يأكل من كسب يديه ، ومثل هذا لا يجمع مالا ، ولا سيما الأنبياء ، عليهم السلام ، فإنهم كانوا أزهد شيء في الدنيا .\nالثالث : أنه قد ثبت في الصحيحين من غير وجه : أن رسول الله صلى الله عليه وسلم قال : \" لا نورث ، ما تركنا فهو صدقة \" وفي رواية عند الترمذي بإسناد صحيح : \" نحن معشر الأنبياء لا نورث \" وعلى هذا فتعين حمل قوله : ( فهب لي من لدنك وليا يرثني ) على ميراث النبوة; ولهذا قال : ( ويرث من آل يعقوب ) ، كما قال تعالى : ( وورث سليمان داود ) [ النمل : 16 ] أي : في النبوة; إذ لو كان في المال لما خصه من بين إخوته بذلك ، ولما كان في الإخبار بذلك كبير فائدة ، إذ من المعلوم المستقر في جميع الشرائع والملل أن الولد يرث أباه ، فلولا أنها وراثة خاصة لما أخبر بها ، وكل هذا يقرره ويثبته ما صح في الحديث : \" نحن معاشر الأنبياء لا نورث ، ما تركنا فهو صدقة \" .\n                                    ",
        "qortoby": "وَإِنِّي خِفۡتُ ٱلۡمَوَٰلِيَ مِن وَرَآءِي وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا فَهَبۡ لِي مِن لَّدُنكَ وَلِيّٗا ٥\n                                    \n                                    \n                                    وإني خفت الموالي من ورائي وكانت امرأتي عاقرا فهب لي من لدنك وليا\nفيه سبع مسائل :\nالأولى : قوله تعالى : وإني خفت الموالي قرأ عثمان بن عفان ومحمد بن علي وعلي بن الحسين - رضي الله تعالى عنهما - ويحيى بن يعمر ( خفت ) بفتح الخاء وتشديد الفاء وكسر التاء وسكون الياء من الموالي لأنه في موضع رفع ( بخفت ) ومعناه انقطعت بالموت . وقرأ الباقون خفت بكسر الخاء وسكون الفاء وضم التاء ونصب الياء من الموالي لأنه في موضع نصب ب ( خفت ) و الموالي هنا الأقارب وبنو العم والعصبة الذين يلونه في النسب . والعرب تسمي بني العم الموالي . قال الشاعر :\nمهلا بني عمنا مهلا موالينا لا تنبشوا بيننا ما كان مدفونا\nقال ابن عباس ومجاهد وقتادة : خاف أن يرثوا ماله وأن ترثه الكلالة ، فأشفق أن يرثه غير الولد . وقالت طائفة : إنما كان مواليه مهملين للدين ، فخاف بموته أن يضيع الدين ، فطلب وليا يقوم بالدين بعده ؛ حكى هذا القول الزجاج ، وعليه فلم يسل من يرث ماله ؛ لأن الأنبياء لا تورث . وهذا هو الصحيح من القولين في تأويل الآية ، وأنه - عليه الصلاة والسلام - أراد وراثة العلم والنبوة لا وراثة المال ؛ لما ثبت عن النبي - صلى الله عليه وسلم - أنه قال : إنا معشر الأنبياء لا نورث ما تركنا صدقة وفي كتاب أبي داود : إن العلماء ورثة الأنبياء وإن الأنبياء لم يورثوا دينارا ولا درهما ورثوا العلم . وسيأتي في هذا مزيد بيان عند قوله : يرثني .\nالثانية : هذا الحديث يدخل في التفسير المسند ؛ لقوله تعالى : وورث سليمان داود وعبارة عن قول زكريا : فهب لي من لدنك وليا يرثني ويرث من آل يعقوب وتخصيص للعموم في ذلك ، وأن سليمان لم يرث من داود مالا خلفه داود بعده ؛ وإنما ورث منه الحكمة والعلم ، وكذلك ورث يحيى من آل يعقوب ؛ هكذا قال أهل العلم بتأويل القرآن ما عدا الروافض ، وإلا ما روي عن الحسن أنه قال : يرثني مالا ويرث من آل يعقوب النبوة والحكمة ؛ وكل قول يخالف قول النبي - صلى الله عليه وسلم - فهو مدفوع مهجور ؛ قال أبو عمر . قال ابن عطية : والأكثر من المفسرين على أن زكريا إنما أراد وراثة المال ؛ ويحتمل قول النبي - صلى الله عليه وسلم - إنا معشر الأنبياء لا نورث ألا يريد به العموم ، بل على أنه غالب أمرهم ؛ فتأمله . والأظهر الأليق بزكريا - عليه السلام - أن يريد وراثة العلم والدين ، فتكون الوراثة مستعارة . ألا ترى أنه لما طلب وليا ولم يخصص ولدا بلغه الله تعالى أمله على أكمل الوجوه . وقال أبو صالح وغيره : قوله من آل يعقوب يريد العلم والنبوة .\nالثالثة : قوله تعالى : من ورائي قرأ ابن كثير بالمد والهمز وفتح الياء . وعنه أنه قرأ أيضا مقصورا مفتوح الياء مثل عصاي . الباقون بالهمز والمد وسكون الياء . والقراء على قراءة ( خفت ) مثل نمت إلا ما ذكرنا عن عثمان . وهي قراءة شاذة بعيدة جدا ؛ حتى زعم بعض العلماء أنها لا تجوز . قال كيف يقول : خفت الموالي من بعدي أي من بعد موتي وهو حي ؟ ! . النحاس : والتأويل لها ألا يعني بقوله : من ورائي أي من بعد موتي ، ولكن من ورائي في ذلك الوقت ؛ وهذا أيضا بعيد يحتاج إلى دليل أنهم خفوا في ذلك الوقت وقلوا ، وقد أخبر الله تعالى بما يدل على الكثرة حين قالوا : أيهم يكفل مريم . ابن عطية : من ورائي من بعدي في الزمن ، فهو الوراء على ما تقدم في ( الكهف ) .\nالرابعة : قوله تعالى : وكانت امرأتي عاقرا امرأته هي إيشاع بنت فاقوذا بن قبيل ، وهي أخت حنة بنت فاقوذا ؛ قاله الطبري . وحنة هي أم مريم حسب ما تقدم في ( آل عمران ) بيانه . وقال القتبي : امرأة زكريا هي إيشاع بنت عمران ، فعلى هذا القول يكون يحيى ابن خالة عيسى - عليهما السلام - على الحقيقة . وعلى القول الآخر يكون ابن خالة أمه . وفي حديث الإسراء قال - عليه الصلاة والسلام - : فلقيت ابني الخالة يحيى وعيسى شاهدا للقول الأول . والله أعلم . والعاقر التي لا تلد لكبر سنها ؛ وقد مضى بيانه في ( آل عمران ) . والعاقر من النساء أيضا التي لا تلد من غير كبر . ومنه قوله تعالى : ويجعل من يشاء عقيما . وكذلك العاقر من الرجال ؛ ومنه قول عامر بن الطفيل :\nلبئس الفتى إن كنت أعور عاقرا جبانا فما عذري لدى كل محضر\nالخامسة : قوله تعالى : فهب لي من لدنك وليا سؤال ودعاء . ولم يصرح بولد لما علم من حاله وبعده عنه بسبب المرأة . قال قتادة : جرى له هذا الأمر وهو ابن بضع وسبعين سنة . مقاتل : خمس وتسعين سنة ؛ وهو أشبه ؛ فقد كان غلب على ظنه أنه لا يولد له لكبره ؛ ولذلك قال : وقد بلغت من الكبر عتيا . وقالت طائفة : بل طلب الولد ، ثم طلب أن تكون الإجابة في أن يعيش حتى يرثه ، تحفظا من أن تقع الإجابة في الولد ولكن يخترم ، ولا يتحصل منه الغرض .\nالسادسة . قال العلماء : دعاء زكريا - عليه السلام - في الولد إنما كان لإظهار دينه ، وإحياء نبوته ، ومضاعفة لأجره لا للدنيا ، وكان ربه قد عوده الإجابة ، ولذلك قال : ولم أكن بدعائك رب شقيا ، أي بدعائي إياك . وهذه وسيلة حسنة ؛ أن يتشفع إليه بنعمه ، يستدر فضله بفضله ؛ يروى أن حاتم الجود لقيه رجل فسأله ؛ فقال له حاتم : من أنت ؟ قال : أنا الذي أحسنت إليه عام أول ؛ فقال : مرحبا بمن تشفع إلينا بنا . فإن قيل : كيف أقدم زكريا على مسألة ما يخرق العادة دون إذن ؟ فالجواب أن ذلك جائز في زمان الأنبياء وفي القرآن ما يكشف عن هذا المعنى ؛ فإنه تعالى قال : كلما دخل عليها زكريا المحراب وجد عندها رزقا قال يا مريم أنى لك هذا قالت هو من عند الله إن الله يرزق من يشاء بغير حساب فلما رأى خارق العادة استحكم طمعه في إجابة دعوته ؛ فقال تعالى : هنالك دعا زكريا ربه قال رب هب لي من لدنك ذرية طيبة الآية .\nالسابعة : إن قال قائل : هذه الآية تدل على جواز الدعاء بالولد ، والله سبحانه وتعالى قد حذرنا من آفات الأموال والأولاد ، ونبه على المفاسد الناشئة من ذلك ؛ فقال : إنما أموالكم وأولادكم فتنة . وقال : إن من أزواجكم وأولادكم عدوا لكم فاحذروهم . فالجواب أن الدعاء بالولد معلوم من الكتاب والسنة حسب ما تقدم في ( آل عمران ) بيانه . ثم إن زكريا - عليه السلام - تحرز فقال : ذرية طيبة وقال : واجعله رب رضيا . والولد إذا كان بهذه الصفة نفع أبويه في الدنيا والآخرة ، وخرج من حد العداوة والفتنة إلى حد المسرة والنعمة . وقد دعا النبي - صلى الله عليه وسلم - لأنس خادمه فقال : اللهم أكثر ماله وولده وبارك له فيما أعطيته فدعا له بالبركة تحرزا مما يؤدي إليه الإكثار من الهلكة . وهكذا فليتضرع العبد إلى مولاه في هداية ولده ، ونجاته في أولاه وأخراه اقتداء بالأنبياء - عليهم الصلاة والسلام - والفضلاء ؛ وقد تقدم في ( آل عمران ) بيانه .\n                                    ",
        "saadi": "وَإِنِّي خِفۡتُ ٱلۡمَوَٰلِيَ مِن وَرَآءِي وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا فَهَبۡ لِي مِن لَّدُنكَ وَلِيّٗا ٥\n                                        \n                                        \n                                        \n                                        { وَإِنِّي خِفْتُ الْمَوَالِيَ مِنْ وَرَائِي ْ} أي: وإني خفت من يتولى على بني إسرائيل من بعد موتي، أن لا يقوموا بدينك حق القيام، ولا يدعوا عبادك إليك، وظاهر هذا، أنه لم ير فيهم أحدا فيه لياقة للإمامة في الدين، وهذا فيه شفقة زكريا عليه السلام ونصحه، وأن طلبه للولد، ليس كطلب غيره، قصده مجرد المصلحة الدنيوية، وإنما قصده مصلحة الدين، والخوف من ضياعه، ورأى غيره غير صالح لذلك، وكان بيته من البيوت المشهورة في الدين، ومعدن الرسالة، ومظنة للخير، فدعا الله أن يرزقه ولدا، يقوم بالدين من بعده، واشتكى أن امرأته عاقر، أي ليست تلد أصلا، وأنه قد بلغ من الكبر عتيا، أي: عمرا يندر معه وجود الشهوة والولد. { فَهَبْ لِي مِنْ لَدُنْكَ وَلِيًّا ْ} وهذه الولاية، ولاية الدين، وميراث النبوة والعلم والعمل\n                                    "
      },
      "originalText": "وَإِنِّي خِفۡتُ ٱلۡمَوَٰلِيَ مِن وَرَآءِي وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا فَهَبۡ لِي مِن لَّدُنكَ وَلِيّٗا ٥"
    },
    {
      "number": 2256,
      "text": "يَرِثُنِي وَيَرِثُ مِنْ آلِ يَعْقُوبَ ۖ وَاجْعَلْهُ رَبِّ رَضِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 6,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَرِثُنِي وَيَرِثُ مِنۡ ءَالِ يَعۡقُوبَۖ وَٱجۡعَلۡهُ رَبِّ رَضِيّٗا ٦\n                                    \n                                    \n                                    قال مجاهد في قوله : ( يرثني ويرث من آل يعقوب ) قال : كان وراثته علما وكان زكريا من ذرية يعقوب .\nوقال هشيم : أخبرنا إسماعيل بن أبي خالد ، عن أبي صالح في قوله : ( يرثني ويرث من آل يعقوب ) قال : قد يكون نبيا كما كانت آباؤه أنبياء .\nوقال عبد الرزاق ، عن معمر ، عن قتادة ، عن الحسن : يرث نبوته وعلمه .\nوقال السدي : يرث نبوتي ونبوة آل يعقوب .\nوعن مالك ، عن زيد بن أسلم : ( ويرث من آل يعقوب ) قال : نبوتهم .\nوقال جابر بن نوح ويزيد بن هارون ، كلاهما عن إسماعيل بن أبي خالد ، عن أبي صالح في قوله : ( يرثني ويرث من آل يعقوب ) قال : يرث مالي ، ويرث من آل يعقوب النبوة .\nوهذا اختيار ابن جرير في تفسيره .\nوقال عبد الرزاق : أخبرنا معمر ، عن قتادة : أن رسول الله صلى الله عليه وسلم قال : \" يرحم الله زكريا ، وما كان عليه من ورثة ، ويرحم الله لوطا ، إن كان ليأوي إلى ركن شديد \"\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا جابر بن نوح ، عن مبارك - هو ابن فضالة - عن الحسن قال : قال رسول الله صلى الله عليه وسلم : \" رحم الله أخي زكريا ، ما كان عليه من ورثة ماله حين يقول : ( فهب لي من لدنك وليا يرثني ويرث من آل يعقوب )\nوهذه مرسلات لا تعارض الصحاح ، والله أعلم .\nوقوله : ( واجعله رب رضيا ) أي مرضيا عندك وعند خلقك ، تحبه وتحببه إلى خلقك في دينه وخلقه .\n                                    ",
        "qortoby": "يَرِثُنِي وَيَرِثُ مِنۡ ءَالِ يَعۡقُوبَۖ وَٱجۡعَلۡهُ رَبِّ رَضِيّٗا ٦\n                                    \n                                    \n                                    قوله تعالى : يرثني ويرث من آل يعقوب واجعله رب رضيا فيه أربع مسائل :\nالأولى : قوله تعالى : يرثني قرأ أهل الحرمين والحسن وعاصم وحمزة ( يرثني ويرث ) بالرفع فيهما . وقرأ يحيى بن يعمر وأبو عمرو ويحيى بن وثاب والأعمش والكسائي بالجزم فيهما ، وليس هما جواب ( هب ) على مذهب سيبويه ، إنما تقديره إن تهبه يرثني ويرث ؛ والأول أصوب في المعنى لأنه طلب وارثا موصوفا ؛ أي هب لي من لدنك الولي الذي هذه حاله وصفته ؛ لأن الأولياء منهم من لا يرث ؛ فقال : هب لي الذي يكون وارثي ؛ قاله أبو عبيد ؛ ورد قراءة الجزم ؛ قال : لأن معناه إن وهبت ورث ، وكيف يخبر الله - عز وجل - بهذا وهو أعلم به منه ؟ ! النحاس : وهذه حجة متقصاة ؛ لأن جواب الأمر عند النحويين فيه معنى الشرط والمجازاة ؛ تقول : أطع الله يدخلك الجنة ؛ أي إن تطعه يدخلك الجنة .\nالثانية : قال النحاس : فأما معنى يرثني ويرث من آل يعقوب فللعلماء فيه ثلاثة أجوبة ؛ قيل : هي وراثة نبوة . وقيل : وراثة حكمة . وقيل : هي وراثة مال . فأما قولهم وراثة نبوة فمحال ؛ لأن النبوة لا تورث ، ولو كانت تورث لقال قائل : الناس ينتسبون إلى نوح - عليه السلام - وهو نبي مرسل . ووراثة العلم والحكمة مذهب حسن ؛ وفي الحديث العلماء ورثة الأنبياء . وأما وراثة المال فلا يمتنع ، وإن كان قوم قد أنكروه لقول النبي - صلى الله عليه وسلم - : لا نورث ، ما تركنا صدقة فهذا لا حجة فيه ؛ لأن الواحد يخبر عن نفسه بإخبار الجمع . وقد يؤول هذا بمعنى : لا نورث ، الذي تركناه صدقة ؛ لأن النبي - صلى الله عليه وسلم - لم يخلف شيئا يورث عنه ؛ وإنما كان الذي أباحه الله - عز وجل - إياه في حياته بقوله تبارك اسمه : واعلموا أنما غنمتم من شيء فأن لله خمسه وللرسول لأن معنى لله لسبيل الله ، ومن سبيل الله ما يكون في مصلحة الرسول - صلى الله عليه وسلم - ما دام حيا ؛ فإن قيل : ففي بعض الروايات إنا معاشر الأنبياء لا نورث ، ما تركنا صدقة ففيه التأويلان جميعا ؛ أن يكون ( ما ) بمعنى الذي .\nوالآخر لا يورث من كانت هذه حاله . وقال أبو عمر : واختلف العلماء في تأويل قوله - عليه السلام - : لا نورث ما تركنا صدقة على قولين : أحدهما : وهو الأكثر وعليه الجمهور أن النبي - صلى الله عليه وسلم - لا يورث وما ترك صدقة . والآخر : أن نبينا - عليه الصلاة والسلام - لم يورث ؛ لأن الله تعالى خصه بأن جعل ماله كله صدقة زيادة في فضيلته ، كما خص في النكاح بأشياء أباحها له وحرمها على غيره ؛ وهذا القول قاله بعض أهل البصرة منهم ابن علية ، وسائر علماء المسلمين على القول الأول .\nالثالثة : قوله تعالى : من آل يعقوب قيل : هو يعقوب بن إسرائيل ، وكان زكريا متزوجا بأخت مريم بنت عمران ، ويرجع نسبها إلى يعقوب ؛ لأنها من ولد سليمان بن داود وهو من ولد يهوذا بن يعقوب ، وزكريا من ولد هارون أخي موسى ، وهارون وموسى من ولد لاوي بن يعقوب ، وكانت النبوة في سبط يعقوب بن إسحاق . وقيل : المعني بيعقوب هاهنا يعقوب بن ماثان أخو عمران بن ماثان أبي مريم أخوان من نسل سليمان بن داود - عليهما السلام - ؛ لأن يعقوب وعمران ابنا ماثان ، وبنو ماثان رؤساء بني إسرائيل ؛ قاله مقاتل وغيره . وقال الكلبي : وكان آل يعقوب أخواله ، وهو يعقوب بن ماثان ، وكان فيهم الملك ، وكان زكريا من ولد هارون بن عمران أخي موسى . وروى قتادة أن النبي - صلى الله عليه وسلم - قال : يرحم الله - تعالى - زكريا ما كان عليه من ورثته . ولم ينصرف يعقوب لأنه أعجمي .\nالرابعة : قوله تعالى : واجعله رب رضيا أي مرضيا في أخلاقه وأفعاله . وقيل : راضيا بقضائك وقدرك . وقيل : رجلا صالحا ترضى عنه . وقال أبو صالح : نبيا كما جعلت أباه نبيا .\n                                    ",
        "saadi": "يَرِثُنِي وَيَرِثُ مِنۡ ءَالِ يَعۡقُوبَۖ وَٱجۡعَلۡهُ رَبِّ رَضِيّٗا ٦\n                                        \n                                        \n                                        \n                                        { يَرِثُنِي وَيَرِثُ مِنْ آلِ يَعْقُوبَ وَاجْعَلْهُ رَبِّ رَضِيًّا ْ}\nأي: عبدا صالحا ترضاه وتحببه إلى عبادك، والحاصل أنه سأل الله ولدا، ذكرا، صالحا، يبق بعد موته، ويكون وليا من بعده، ويكون نبيا مرضيا عند الله وعند خلقه، وهذا أفضل ما يكون من الأولاد، ومن رحمة الله بعبده، أن يرزقه ولدا صالحا، جامعا لمكارم الأخلاق ومحامد الشيم. فرحمه ربه واستجاب دعوته\n                                    "
      },
      "originalText": "يَرِثُنِي وَيَرِثُ مِنۡ ءَالِ يَعۡقُوبَۖ وَٱجۡعَلۡهُ رَبِّ رَضِيّٗا ٦"
    },
    {
      "number": 2257,
      "text": "يَا زَكَرِيَّا إِنَّا نُبَشِّرُكَ بِغُلَامٍ اسْمُهُ يَحْيَىٰ لَمْ نَجْعَلْ لَهُ مِنْ قَبْلُ سَمِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 7,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُۥ مِن قَبۡلُ سَمِيّٗا ٧\n                                    \n                                    \n                                    هذا الكلام يتضمن محذوفا ، وهو أنه أجيب إلى ما سأل في دعائه فقيل له : ( يا زكريا إنا نبشرك بغلام اسمه يحيى ) ، كما قال تعالى : ( هنالك دعا زكريا ربه قال رب هب لي من لدنك ذرية طيبة إنك سميع الدعاء فنادته الملائكة وهو قائم يصلي في المحراب أن الله يبشرك بيحيى مصدقا بكلمة من الله وسيدا وحصورا ونبيا من الصالحين ) [ آل عمران : 38 ، 39 ]\nوقوله : ( لم نجعل له من قبل سميا ) قال قتادة ، وابن جريج ، وابن زيد : أي لم يسم أحد قبله بهذا الاسم ، واختاره ابن جرير ، رحمه الله .\nوقال مجاهد : ( لم نجعل له من قبل سميا ) أي : شبيها .\nأخذه من معنى قوله : ( فاعبده واصطبر لعبادته هل تعلم له سميا ) [ مريم : 65 ] أي : شبيها .\nوقال علي بن أبي طلحة ، عن ابن عباس : أي لم تلد العواقر قبله مثله .\nوهذا دليل على أن زكريا عليه السلام ، كان لا يولد له ، وكذلك امرأته كانت عاقرا من أول عمرها ، بخلاف إبراهيم وسارة ، عليهما السلام ، فإنهما إنما تعجبا من البشارة بإسحاق على كبرهما لا لعقرهما ; ولهذا قال : ( أبشرتموني على أن مسني الكبر فبم تبشرون ) [ الحجر : 54 ] مع أنه كان قد ولد له قبله إسماعيل بثلاث عشرة سنة . وقالت امرأته : ( ياويلتى أألد وأنا عجوز وهذا بعلي شيخا إن هذا لشيء عجيب قالوا أتعجبين من أمر الله رحمة الله وبركاته عليكم أهل البيت إنه حميد مجيد ) [ هود : 72 ، 73  ]  .\n                                    ",
        "qortoby": "يَٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُۥ مِن قَبۡلُ سَمِيّٗا ٧\n                                    \n                                    \n                                    قوله تعالى : يا زكريا في الكلام حذف ؛ أي فاستجاب الله دعاءه فقال : يا زكريا إنا نبشرك بغلام اسمه يحيى فتضمنت هذه البشرى ثلاثة أشياء : أحدها : إجابة دعائه وهي كرامة . الثاني : إعطاؤه الولد وهو قوة . الثالث : أن يفرد بتسميته ؛ وقد تقدم معنى تسميته في ( آل عمران ) . وقال مقاتل : سماه يحيى لأنه حيي بين أب شيخ وأم عجوز ؛ وهذا فيه نظر ؛ لما تقدم من أن امرأته كانت عقيما لا تلد . والله أعلم .\nقوله تعالى : لم نجعل له من قبل سميا أي لم نسم أحدا قبل يحيى بهذا الاسم ؛ قاله ابن عباس وقتادة وابن أسلم والسدي . ومن عليه تعالى بأن لم يكل تسميته إلى الأبوين . وقال مجاهد وغيره : سميا معناه مثلا ونظيرا ، وهو مثل قوله تعالى : هل تعلم له سميا معناه مثلا ونظيرا كأنه من المساماة والسمو ؛ وهذا فيه بعد ؛ لأنه لا يفضل على إبراهيم ؛ وموسى ؛ اللهم إلا أن يفضل في خاص كالسؤدد والحصر حسب ما تقدم بيانه ( في آل عمران ) .\nوقال ابن عباس أيضا : معناه لم تلد العواقر مثله ولدا . قيل : إن الله تعالى اشترط القبل ، لأنه أراد أن يخلق بعده أفضل منه وهو محمد - صلى الله عليه وسلم - . وفي هذه الآية دليل وشاهد على أن الأسامي السنع جديرة بالأثرة ، وإياها كانت العرب تنتحي في التسمية لكونها أنبه وأنزه عن النبز حتى قال قائل :\nسنع الأسامي مسبلي أزر حمر تمس الأرض بالهدب\nوقال رؤبة للنسابة البكري وقد سأله عن نسبه : أنا ابن العجاج ؛ فقال : قصرت وعرفت .\n                                    ",
        "saadi": "يَٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُۥ مِن قَبۡلُ سَمِيّٗا ٧\n                                        \n                                        \n                                        \n                                        أي: بشره الله تعالى على يد الملائكة بــ \" يحيى \" وسماه الله له \" يحيى \" وكان اسما موافقا لمسماه: يحيا حياة حسية، فتتم به المنة، ويحيا حياة معنوية، وهي حياة القلب والروح، بالوحي والعلم والدين. { لَمْ نَجْعَلْ لَهُ مِنْ قَبْلُ سَمِيًّا ْ} أي: لم يسم هذا الاسم قبله أحد، ويحتمل أن المعنى: لم نجعل له من قبل مثيلا ومساميا، فيكون ذلك بشارة بكماله، واتصافه بالصفات الحميدة، وأنه فاق من قبله، ولكن على هذا الاحتمال، هذا العموم لا بد أن يكون مخصوصا بإبراهيم وموسى ونوح عليهم السلام، ونحوهم، ممن هو أفضل من يحيى قطعا\n                                    "
      },
      "originalText": "يَٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُۥ مِن قَبۡلُ سَمِيّٗا ٧"
    },
    {
      "number": 2258,
      "text": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَامٌ وَكَانَتِ امْرَأَتِي عَاقِرًا وَقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 8,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا وَقَدۡ بَلَغۡتُ مِنَ ٱلۡكِبَرِ عِتِيّٗا ٨\n                                    \n                                    \n                                    هذا تعجب من زكريا ، عليه السلام ، حين أجيب إلى ما سأل ، وبشر بالولد ، ففرح فرحا شديدا ، وسأل عن كيفية ما يولد له ، والوجه الذي يأتيه منه الولد ، مع أن امرأته كانت عاقرا لم تلد من أول عمرها مع كبرها ، ومع أنه قد كبر وعتا ، أي عسا عظمه ونحل ولم يبق فيه لقاح ولا جماع .\nتقول العرب للعود إذا يبس : \" عتا يعتو عتيا وعتوا ، وعسا يعسو عسوا وعسيا \" .\nوقال مجاهد : ( عتيا ) بمعنى : نحول العظم .\nوقال ابن عباس وغيره : ( عتيا ) يعني : الكبر .\nوالظاهر أنه أخص من الكبر .\nوقال ابن جرير : حدثنا يعقوب ، حدثنا هشيم ، أخبرنا حصين ، عن عكرمة ، عن ابن عباس قال : لقد علمت السنة كلها ، غير أني لا أدري أكان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر أم لا ؟ ولا أدري كيف كان يقرأ هذا الحرف : ( وقد بلغت من الكبر عتيا ) أو \" عسيا \" .\n                                    ",
        "qortoby": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا وَقَدۡ بَلَغۡتُ مِنَ ٱلۡكِبَرِ عِتِيّٗا ٨\n                                    \n                                    \n                                    قوله تعالى : قال رب أنى يكون لي غلام ليس على معنى الإنكار لما أخبر الله تعالى به ، بل على سبيل التعجب من قدرة الله تعالى أن يخرج ولدا من امرأة عاقر وشيخ كبير . وقيل غير هذا مما تقدم في ( آل عمران ) بيانه .\nوقد بلغت من الكبر عتيا يعني النهاية في الكبر واليبس والجفاف ؛ ومثله العسي ؛ قال الأصمعي : عسا الشيء يعسو عسوا وعساء ممدود أي يبس وصلب ، وقد عسا الشيخ يعسو عسيا ولى وكبر مثل عتا ؛ يقال : عتا الشيخ يعتو عتيا وعتيا كبر وولى ، وعتوت يا فلان تعتو عتوا وعتيا . والأصل عتو لأنه من ذوات الواو ، فأبدلوا من الواو ياء ؛ لأنها أختها وهي أخف منها ، والآيات على الياءات . ومن قال : عتيا كره الضمة مع الكسرة والياء ؛ وقال الشاعر :\nإنما يعذر الوليد ولا يع ذر من كان في الزمان عتيا\nوقرأ ابن عباس ( عسيا ) وهو كذلك في مصحف أبي . وقرأ يحيى بن وثاب وحمزة والكسائي وحفص عتيا بكسر العين وكذلك جثيا و صليا حيث كن . وضم حفص \" بكيا \" خاصة ، وكذلك الباقون في الجميع ، وهما لغتان . وقيل : عتيا قسيا ؛ يقال : ملك عات إذا كان قاسي القلب .\n                                    ",
        "saadi": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا وَقَدۡ بَلَغۡتُ مِنَ ٱلۡكِبَرِ عِتِيّٗا ٨\n                                        \n                                        \n                                        \n                                        ، فحينئذ لما جاءته البشارة بهذا المولود الذي طلبه استغرب وتعجب وقال: { رَبِّ أَنَّى يَكُونُ لِي غُلَامٌ ْ} والحال أن المانع من وجود الولد، موجود بي وبزوجتي؟ وكأنه وقت دعائه، لم يستحضر هذا المانع لقوة الوارد في قلبه، وشدة الحرص العظيم على الولد، وفي هذه الحال، حين قبلت دعوته، تعجب من ذلك\n                                    "
      },
      "originalText": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَكَانَتِ ٱمۡرَأَتِي عَاقِرٗا وَقَدۡ بَلَغۡتُ مِنَ ٱلۡكِبَرِ عِتِيّٗا ٨"
    },
    {
      "number": 2259,
      "text": "قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٌ وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 9,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٞ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡ‍ٔٗا ٩\n                                    \n                                    \n                                    ورواه الإمام أحمد عن سريج بن النعمان ، وأبو داود ، عن زياد بن أيوب ، كلاهما عن هشيم ، به .\n( قال ) أي الملك مجيبا لزكريا عما استعجب منه : ( كذلك قال ربك هو علي هين ) أي : إيجاد الولد منك ومن زوجتك هذه لا من غيرها ) هين ) أي : يسير سهل على الله .\nثم ذكر له ما هو أعجب مما سأل عنه ، فقال : ( وقد خلقتك من قبل ولم تك شيئا ) كما قال تعالى : ( هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا ) الإنسان : 1\n                                    ",
        "qortoby": "قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٞ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡ‍ٔٗا ٩\n                                    \n                                    \n                                    قوله تعالى : قال كذلك قال ربك هو علي هين أي قال له الملك كذلك قال ربك والكاف في موضع رفع ؛ أي الأمر كذلك ؛ أي كما قيل لك : هو علي هين . قال الفراء : خلقه علي هين .\nوقد خلقتك من قبل أي من قبل يحيى . وهذه قراءة أهل المدينة والبصرة وعاصم . وقرأ سائر الكوفيين ( وقد خلقناك ) بنون وألف بالجمع على التعظيم . والقراءة الأولى أشبه بالسواد .\nولم تك شيئا أي كما خلقك الله تعالى بعد العدم ولم تك شيئا موجودا ، فهو القادر على خلق يحيى وإيجاده .\n                                    ",
        "saadi": "قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٞ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡ‍ٔٗا ٩\n                                        \n                                        \n                                        \n                                        فأجابه الله بقوله: { كَذَلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٌ ْ}\nأي: الأمر مستغرب في العادة، وفي سنة الله في الخليقة، ولكن قدرة الله تعالى صالحة لإيجاد الأشياء بدون أسبابها فذلك هين عليه، ليس بأصعب من إيجاده قبل ولم يكن شيئا.\n                                    "
      },
      "originalText": "قَالَ كَذَٰلِكَ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٞ وَقَدۡ خَلَقۡتُكَ مِن قَبۡلُ وَلَمۡ تَكُ شَيۡ‍ٔٗا ٩"
    },
    {
      "number": 2260,
      "text": "قَالَ رَبِّ اجْعَلْ لِي آيَةً ۚ قَالَ آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَ لَيَالٍ سَوِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 10,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ رَبِّ ٱجۡعَل لِّيٓ ءَايَةٗۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَ لَيَالٖ سَوِيّٗا ٠١\n                                    \n                                    \n                                    يقول تعالى مخبرا عن زكريا ، عليه السلام ، أنه ( قال رب اجعل لي آية ) أي : علامة ودليلا على وجود ما وعدتني ، لتستقر نفسي ويطمئن قلبي بما وعدتني كما قال إبراهيم ، عليه السلام : ( رب أرني كيف تحي الموتى قال أولم تؤمن قال بلى ولكن ليطمئن قلبي ) الآية [ البقرة : 260 ] . ) قال آيتك ) أي : علامتك ( ألا تكلم الناس ثلاث ليال سويا ) أي : أن تحبس لسانك عن الكلام ثلاث ليال وأنت صحيح سوي من غير مرض ولا علة ).\nقال ابن عباس ، ومجاهد ، وعكرمة ، ووهب بن منبه ، والسدي وقتادة وغير واحد : اعتقل لسانه من غير مرض .\nوقال عبد الرحمن بن زيد بن أسلم : كان يقرأ ويسبح ولا يستطيع أن يكلم قومه إلا إشارة .\nوقال العوفي ، عن ابن عباس : ( ثلاث ليال سويا ) أي : متتابعات .\nوالقول الأول عنه وعن الجمهور أصح كما قال تعالى في أول [ آل عمران : ( قال رب اجعل لي آية قال آيتك ألا تكلم الناس ثلاثة أيام إلا رمزا واذكر ربك كثيرا وسبح بالعشي والإبكار ) [ آل عمران : 41 ]\nوقال مالك ، عن زيد بن أسلم : ( ثلاث ليال سويا ) من غير خرس .\nوهذا دليل على أنه لم يكن يكلم الناس في هذه الليالي الثلاث وأيامها ) إلا رمزا ) أي : إشارة\n                                    ",
        "qortoby": "قَالَ رَبِّ ٱجۡعَل لِّيٓ ءَايَةٗۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَ لَيَالٖ سَوِيّٗا ٠١\n                                    \n                                    \n                                    قوله تعالى : قال رب اجعل لي آية طلب آية على حملها بعد بشارة الملائكة إياه ، وبعد قوله تعالى : وقد خلقتك من قبل ولم تك شيئا زيادة طمأنينة ؛ أي تمم النعمة بأن تجعل لي آية ، وتكون تلك الآية زيادة نعمة وكرامة . وقيل : طلب آية تدله على أن البشرى منه بيحيى لا من الشيطان ؛ لأن إبليس أوهمه ذلك . قاله الضحاك وهو معنى قول السدي ؛ وهذا فيه نظر لإخبار الله تعالى بأن الملائكة نادته حسب ما تقدم في ( آل عمران ) . قال آيتك ألا تكلم الناس ثلاث ليال سويا تقدم في ( آل عمران ) بيانه فلا معنى للإعادة .\n                                    ",
        "saadi": "قَالَ رَبِّ ٱجۡعَل لِّيٓ ءَايَةٗۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَ لَيَالٖ سَوِيّٗا ٠١\n                                        \n                                        \n                                        \n                                        { قَالَ رَبِّ اجْعَلْ لِي آيَةً ْ} أي: يطمئن بها قلبي، وليس هذا شكا في خبر الله، وإنما هو، كما قال الخليل عليه السلام: { رَبِّ أَرِنِي كَيْفَ تُحْيِ الْمَوْتَى قَالَ أَوَلَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي ْ} فطلب زيادة العلم، والوصول إلى عين اليقين بعد علم اليقين، فأجابه الله إلى طلبته رحمة به، فـ { قَالَ آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَ لَيَالٍ سَوِيًّا ْ} وفي الآية الأخرى { ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا ْ} والمعنى واحد، لأنه تارة يعبر بالليالي، وتارة بالأيام ومؤداها واحد، وهذا من الآيات العجيبة، فإن منعه من الكلام مدة ثلاثة أيام، وعجزه عنه من غير خرس ولا آفة، بل كان سويا، لا نقص فيه، من الأدلة على قدرة الله الخارقة للعوائد، ومع هذا، ممنوع من الكلام الذي يتعلق بالآدميين وخطابهم،. وأما التسبيح والتهليل، والذكر ونحوه، فغير ممنوع منه، ولهذا قال في الآية الأخرى: { وَاذْكُرْ رَبَّكَ كَثِيرًا وَسَبِّحْ بِالْعَشِيِّ وَالْإِبْكَارِ ْ} فاطمأن قلبه، واستبشر بهذه البشارة العظيمة، وامتثل لأمر الله له بالشكر بعبادته وذكره، فعكف في محرابه،\n                                    "
      },
      "originalText": "قَالَ رَبِّ ٱجۡعَل لِّيٓ ءَايَةٗۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَ لَيَالٖ سَوِيّٗا ٠١"
    },
    {
      "number": 2261,
      "text": "فَخَرَجَ عَلَىٰ قَوْمِهِ مِنَ الْمِحْرَابِ فَأَوْحَىٰ إِلَيْهِمْ أَنْ سَبِّحُوا بُكْرَةً وَعَشِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 11,
      "juz": 16,
      "manzil": 4,
      "page": 305,
      "ruku": 264,
      "hizbQuarter": 122,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ مِنَ ٱلۡمِحۡرَابِ فَأَوۡحَىٰٓ إِلَيۡهِمۡ أَن سَبِّحُواْ بُكۡرَةٗ وَعَشِيّٗا ١١\n                                    \n                                    \n                                    ولهذا قال في هذه الآية الكريمة : ( فخرج على قومه من المحراب ) أي : الذي بشر فيه بالولد ، ( فأوحى إليهم ) أي : أشار إشارة خفية سريعة : ( أن سبحوا بكرة وعشيا ) أي : موافقة له فيما أمر به في هذه الأيام الثلاثة زيادة على أعماله ، وشكرا لله على ما أولاه .\nقال مجاهد : ( فأوحى إليهم ) أي : أشار . وبه قال وهب ، وقتادة .\nوقال مجاهد في رواية عنه : ( فأوحى إليهم ) أي : كتب لهم في الأرض ، كذا قال السدي .\n                                    ",
        "qortoby": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ مِنَ ٱلۡمِحۡرَابِ فَأَوۡحَىٰٓ إِلَيۡهِمۡ أَن سَبِّحُواْ بُكۡرَةٗ وَعَشِيّٗا ١١\n                                    \n                                    \n                                    قوله تعالى : فخرج على قومه من المحراب فأوحى إليهم أن سبحوا بكرة وعشيا فيه خمس مسائل :\nالأولى : قوله تعالى : فخرج على قومه من المحراب أي أشرف عليهم من المصلى . والمحراب أرفع المواضع ، وأشرف المجالس ، وكانوا يتخذون المحاريب فيما ارتفع من الأرض ؛ دليله محراب داود - عليه السلام - على ما يأتي . واختلف الناس في اشتقاقه ؛ فقالت فرقة : هو مأخوذ من الحرب كأن ملازمه يحارب الشيطان والشهوات . وقالت فرقة : هو مأخوذ من الحرب ( بفتح الراء ) كأن ملازمه يلقى منه حربا وتعبا ونصبا .\nالثانية : هذه الآية تدل على أن ارتفاع إمامهم على المأمومين كان مشروعا عندهم في صلاتهم . وقد اختلف في هذه المسألة فقهاء الأمصار ، فأجاز ذلك الإمام أحمد وغيره متمسكا بقصة المنبر . ومنع مالك ذلك في الارتفاع الكثير دون اليسير ، وعلل أصحابه المنع بخوف الكبر على الإمام .\nقلت : وهذا فيه نظر ؛ وأحسن ما فيه ما رواه أبو داود عن همام أن حذيفة أم الناس بالمدائن على دكان ، فأخذ أبو مسعود بقميصه فجبذه ، فلما فرغ من صلاته قال : ألم تعلم أنهم كانوا ينهون عن هذا - أو - ينهى عن ذلك ! قال : بلى ؛ قد ذكرت حين مددتني . وروي أيضا عن عدي بن ثابت الأنصاري قال : حدثني رجل أنه كان مع عمار بن ياسر بالمدائن ، فأقيمت الصلاة فتقدم عمار بن ياسر ، وقام على دكان يصلي والناس أسفل منه ، فتقدم حذيفة فأخذ على يديه فاتبعه عمار حتى أنزله حذيفة ، فلما فرغ عمار من صلاته ، قال له حذيفة : ألم تسمع رسول الله - صلى الله عليه وسلم - يقول : إذا أم الرجل القوم فلا يقم في مكان أرفع من مقامهم أو نحو ذلك ؛ فقال عمار : لذلك اتبعتك حين أخذت على يدي .\nقلت : فهؤلاء ثلاثة من الصحابة قد أخبروا بالنهي عن ذلك ، ولم يحتج أحد منهم على صاحبه بحديث المنبر فدل على أنه منسوخ ، ومما يدل على نسخه أن فيه عملا زائدا في الصلاة ، وهو النزول والصعود ، فنسخ كما نسخ الكلام والسلام . وهذا أولى مما اعتذر به أصحابنا من أن النبي - صلى الله عليه وسلم - كان معصوما من الكبر ؛ لأن كثيرا من الأئمة يوجد لا كبر عندهم ، ومنهم من علله بأن ارتفاع المنبر كان يسيرا ؛ والله أعلم .\n[ الثالثة ] قوله تعالى : فأوحى إليهم أن سبحوا بكرة وعشيا قال الكلبي وقتادة وابن منبه : أوحى إليهم أشار . القتبي : أومأ . مجاهد : كتب على الأرض . عكرمة : كتب في كتاب . والوحي في كلام العرب الكتابة ؛ ومنه قول ذي الرمة :\nسوى الأربع الدهم اللواتي كأنها بقية وحي في بطون الصحائف\nوقال عنترة :\nكوحي صحائف من عهد كسرى فأهداها لأعجم طمطمي\nو بكرة وعشيا ظرفان . وزعم الفراء أن العشي يؤنث ويجوز تذكيره إذا أبهمت ؛ قال : وقد يكون العشي جمع عشية .\nالرابعة : قد تقدم الحكم في الإشارة في ( آل عمران ) واختلف علماؤنا فيمن حلف ألا يكلم إنسانا فكتب إليه كتابا ، أو أرسل إليه رسولا ؛ فقال مالك : إنه يحنث إلا أن ينوي مشافهته ، ثم رجع فقال : لا ينوي في الكتاب ويحنث إلا أن يرتجع الكتاب قبل وصوله . قال ابن القاسم : إذا قرأ كتابه حنث ، وكذلك لو قرأ الحالف كتاب المحلوف عليه . وقال أشهب : لا يحنث إذا قرأه الحالف ؛ وهذا بين ؛ لأنه لم يكلمه ولا ابتدأه بكلام إلا أن يريد ألا يعلم معنى كلامه ، فإنه يحنث وعليه يخرج قول ابن القاسم . فإن حلف ليكلمنه لم يبر إلا بمشافهته ؛ وقال ابن الماجشون : وإن حلف لئن علم كذا ليعلمنه أو ليخبرنه إليه أو أرسل إليه رسولا بر ، ولو علماه جميعا لم يبر ، حتى يعلمه لأن علمهما مختلف .\nالخامسة : واتفق مالك والشافعي والكوفيون أن الأخرس إذا كتب الطلاق بيده لزمه ؛ قال الكوفيون : إلا أن يكون رجل أصمت أياما فكتب لم يجز من ذلك شيء . قال الطحاوي : الخرس مخالف للصمت العارض ، كما أن العجز عن الجماع العارض لمرض ونحوه يوما أو نحوه مخالف للعجز الميئوس منه الجماع ، نحو الجنون في باب خيار المرأة في الفرقة .\n                                    ",
        "saadi": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ مِنَ ٱلۡمِحۡرَابِ فَأَوۡحَىٰٓ إِلَيۡهِمۡ أَن سَبِّحُواْ بُكۡرَةٗ وَعَشِيّٗا ١١\n                                        \n                                        \n                                        \n                                        وخرج على قومه منه فأوحى إليهم، أي: بالإشارة والرمز { أَنْ سَبِّحُوا بُكْرَةً وَعَشِيًّا ْ} لأن البشارة بـ \" يحيى \" في حق الجميع، مصلحة دينية.\n                                    "
      },
      "originalText": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ مِنَ ٱلۡمِحۡرَابِ فَأَوۡحَىٰٓ إِلَيۡهِمۡ أَن سَبِّحُواْ بُكۡرَةٗ وَعَشِيّٗا ١١"
    }
  ]
}