{
  "number": 310,
  "ayahsNumber": 12,
  "ayahs": [
    {
      "number": 2315,
      "text": "رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهِ ۚ هَلْ تَعْلَمُ لَهُ سَمِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 65,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 267,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا فَٱعۡبُدۡهُ وَٱصۡطَبِرۡ لِعِبَٰدَتِهِۦۚ هَلۡ تَعۡلَمُ لَهُۥ سَمِيّٗا ٥٦\n                                    \n                                    \n                                    وقوله : ( رب السماوات والأرض وما بينهما ) أي : خالق ذلك ومدبره ، والحاكم فيه والمتصرف الذي لا معقب لحكمه ، ( فاعبده واصطبر لعبادته هل تعلم له سميا ) : قال علي بن أبي طلحة ، عن ابن عباس : هل تعلم للرب مثلا أو شبها .\nوكذلك قال مجاهد ، وسعيد بن جبير ، وقتادة ، وابن جريج وغيرهم .\nوقال عكرمة ، عن ابن عباس : ليس أحد يسمى الرحمن غيره تبارك وتعالى ، وتقدس اسمه .\n                                    ",
        "qortoby": "رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا فَٱعۡبُدۡهُ وَٱصۡطَبِرۡ لِعِبَٰدَتِهِۦۚ هَلۡ تَعۡلَمُ لَهُۥ سَمِيّٗا ٥٦\n                                    \n                                    \n                                    قوله تعالى : رب السماوات والأرض وما بينهما أي ربهما وخالقهما وخالق ما بينهما ومالكهما ومالك ما بينهما ؛ فكما إليه تدبير الأزمان كذلك إليه تدبير الأعيان . فاعبده أي وحده لذلك . وفي هذا دلالة على أن اكتسابات الخلق مفعولة لله تعالى كما يقوله أهل الحق ، وهو القول الحق لأن الرب في هذا الموضوع لا يمكن حمله على معنى من معانيه إلا على المالك ، وإذا ثبت أنه مالك ما بين السماء والأرض دخل في ذلك اكتساب الخلق ، ووجبت عبادته لما ثبت أنه المالك على الإطلاق ، وحقيقة العبادة الطاعة بغاية الخضوع ، ولا يستحقها أحد سوى المالك المعبود واصطبر لعبادته أي لطاعته ولا تحزن لتأخير الوحي عنك ، بل اشتغل بما أمرت به ، وأصل اصطبر اصتبر ، فثقل الجمع بين التاء والصاد لاختلافهما ، فأبدل من التاء طاء كما تقول من الصوم اصطام هل تعلم له سميا قال ابن عباس : يريد هل تعلم له ولدا أي نظيرا ؛ أو مثلا ؛ أو شبيها يستحق مثل اسمه الذي هو الرحمن . وقال مجاهد . مأخوذ من المساماة . وروى إسرائيل عن سماك عن عكرمة عن ابن عباس قال : هل تعلم له أحدا سمي الرحمن . قال النحاس وهذا أجل إسناد علمته روي في هذا الحرف وهو قول صحيح ولا يقال الرحمن إلا لله .\nقلت : وقد مضى هذا مبينا في البسملة و \" الحمد لله \" روى ابن أبي نجيح عن مجاهد هل تعلم له سميا قال : مثلا . ابن المسيب : عدلا . قتادة والكلبي : هل تعلم أحدا يسمى الله تعالى غير الله أو يقال له الله إلا الله ، وهل بمعنى لا أي لا تعلم والله تعالى أعلم .\n                                    ",
        "saadi": "رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا فَٱعۡبُدۡهُ وَٱصۡطَبِرۡ لِعِبَٰدَتِهِۦۚ هَلۡ تَعۡلَمُ لَهُۥ سَمِيّٗا ٥٦\n                                        \n                                        \n                                        \n                                        ثم علل إحاطة علمه، وعدم نسيانه، بأنه { رَبُّ السَّمَاوَاتِ وَالْأَرْضِ } فربوبيته للسماوات والأرض، وكونهما على أحسن نظام وأكمله، ليس فيه غفلة ولا إهمال، ولا سدى، ولا باطل، برهان قاطع على علمه الشامل، فلا تشغل نفسك بذلك، بل اشغلها بما ينفعك ويعود عليك طائله، وهو: عبادته وحده لا شريك له، { وَاصْطَبِرْ لِعِبَادَتِهِ } أي: اصبر نفسك عليها وجاهدها، وقم عليها أتم القيام وأكملها بحسب قدرتك، وفي الاشتغال بعبادة الله تسلية للعابد عن جميع التعلقات والمشتهيات، كما قال تعالى: { وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَى مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ } إلى أن قال: { وَأْمُرْ أَهْلَكَ بِالصَّلَاةِ وَاصْطَبِرْ عَلَيْهَا } الآية. { هَلْ تَعْلَمُ لَهُ سَمِيًّا } أي: هل تعلم لله مساميا ومشابها ومماثلا من المخلوقين. وهذا استفهام بمعنى النفي، المعلوم بالعقل. أي: لا تعلم له مساميا ولا مشابها، لأنه الرب، وغيره مربوب، الخالق، وغيره مخلوق، الغني من جميع الوجوه، وغيره فقير بالذات من كل وجه، الكامل الذي له الكمال المطلق من جميع الوجوه، وغيره ناقص ليس فيه من الكمال إلا ما أعطاه الله تعالى، فهذا برهان قاطع على أن الله هو المستحق لإفراده بالعبودية، وأن عبادته حق، وعبادة ما سواه باطل، فلهذا أمر بعبادته وحده، والاصطبار لها، وعلل ذلك بكماله وانفراده بالعظمة والأسماء الحسنى.\n                                    "
      },
      "originalText": "رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا فَٱعۡبُدۡهُ وَٱصۡطَبِرۡ لِعِبَٰدَتِهِۦۚ هَلۡ تَعۡلَمُ لَهُۥ سَمِيّٗا ٥٦"
    },
    {
      "number": 2316,
      "text": "وَيَقُولُ الْإِنْسَانُ أَإِذَا مَا مِتُّ لَسَوْفَ أُخْرَجُ حَيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 66,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَقُولُ ٱلۡإِنسَٰنُ أَءِذَا مَا مِتُّ لَسَوۡفَ أُخۡرَجُ حَيًّا ٦٦\n                                    \n                                    \n                                    يخبر تعالى عن الإنسان أنه يتعجب ويستبعد إعادته بعد موته ، كما قال تعالى : ( وإن تعجب فعجب قولهم أئذا كنا ترابا أئنا لفي خلق جديد ) [ الرعد : 5 ] ، وقال : ( أولم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم ) [ يس : 77 - 79 ] ، وقال هاهنا : ( ويقول الإنسان أئذا ما مت لسوف أخرج حيا)\n                                    ",
        "qortoby": "وَيَقُولُ ٱلۡإِنسَٰنُ أَءِذَا مَا مِتُّ لَسَوۡفَ أُخۡرَجُ حَيًّا ٦٦\n                                    \n                                    \n                                    قوله : ويقول الإنسان أئذا ما مت لسوف أخرج حيا الإنسان هنا أبي بن خلف وجد عظاما بالية ففتتها بيده وقال : زعم محمد أنا نبعث بعد الموت ، قاله الكلبي ؛ ذكره الواحدي والثعلبي والقشيري ، وقال المهدوي : نزلت في الوليد بن المغيرة وأصحابه وهو قول ابن عباس واللام في لسوف أخرج حيا للتأكيد كأنه قيل له إذا ما مت لسوف تبعث حيا فقال أئذا ما مت لسوف أخرج حيا ! قال ذلك منكرا فجاءت اللام في الجواب ، كما كانت في القول الأول ولو كان مبتدأ لم تدخل اللام ؛ لأنها للتأكيد والإيجاب وهو منكر للبعث وقرأ ابن ذكوان ( إذا ما مت ) على الخبر والباقون بالاستفهام على أصولهم بالهمز وقرأ الحسن وأبو حيوة لسوف أخرج حيا قاله استهزاء لأنهم لا يصدقون بالبعث والإنسان هاهنا الكافر .\n                                    ",
        "saadi": "وَيَقُولُ ٱلۡإِنسَٰنُ أَءِذَا مَا مِتُّ لَسَوۡفَ أُخۡرَجُ حَيًّا ٦٦\n                                        \n                                        \n                                        \n                                        المراد بالإنسان هاهنا، كل منكر للبعث، مستبعد لوقوعه، فيقول -مستفهما على وجه النفي والعناد والكفر- { أَئِذَا مَا مِتُّ لَسَوْفَ أُخْرَجُ حَيًّا } أي: كيف يعيدني الله حيا بعد الموت، وبعد ما كنت رميما؟\" هذا لا يكون ولا يتصور، وهذا بحسب عقله الفاسد ومقصده السيء، وعناده لرسل الله وكتبه، فلو نظر أدنى نظر، وتأمل أدنى تأمل، لرأى استبعاده للبعث، في غاية السخافة\n                                    "
      },
      "originalText": "وَيَقُولُ ٱلۡإِنسَٰنُ أَءِذَا مَا مِتُّ لَسَوۡفَ أُخۡرَجُ حَيًّا ٦٦"
    },
    {
      "number": 2317,
      "text": "أَوَلَا يَذْكُرُ الْإِنْسَانُ أَنَّا خَلَقْنَاهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْئًا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 67,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوَ لَا يَذۡكُرُ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن قَبۡلُ وَلَمۡ يَكُ شَيۡ‍ٔٗا ٧٦\n                                    \n                                    \n                                    يستدل ، تعالى ، بالبداءة على الإعادة ، يعني أنه تعالى قد خلق الإنسان ولم يك شيئا ، أفلا يعيده وقد صار شيئا ، كما قال تعالى : ( وهو الذي يبدأ الخلق ثم يعيده وهو أهون عليه ) [ الروم : 27 ] ، وفي الصحيح : \" يقول الله تعالى : كذبني ابن آدم ولم يكن له أن يكذبني ، وآذاني ابن آدم ولم يكن له أن يؤذيني ، أما تكذيبه إياي فقوله : لن يعيدني كما بدأني ، وليس أول الخلق بأهون علي من آخره ، وأما أذاه إياي فقوله : إن لي ولدا ، وأنا الأحد الصمد ، الذي لم يلد ولم يولد ولم يكن له كفوا أحد \" .\n                                    ",
        "qortoby": "أَوَ لَا يَذۡكُرُ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن قَبۡلُ وَلَمۡ يَكُ شَيۡ‍ٔٗا ٧٦\n                                    \n                                    \n                                    قوله تعالى : أولا يذكر الإنسان أي أولا يذكر هذا القائل أنا خلقناه من قبل أي من قبل سؤاله وقوله هذا القول ولم يك شيئا فالإعادة مثل الابتداء فلم يناقض وقرأ أهل الكوفة إلا عاصما وأهل مكة وأبو عمر وأبو جعفر ( أولا يذكر ) وقرأ شيبة ونافع وعاصم ( أولا يذكر ) بالتخفيف . والاختيار التشديد وأصله يتذكر لقوله تعالى : إنما يتذكر أولو الألباب وأخواتها . وفي حرف أبي ( أولا يتذكر ) وهذه القراءة على التفسير لأنها مخالفة لخط المصحف : ومعنى ( يتذكر ) يتفكر ومعنى يذكر يتنبه ويعلم قاله النحاس .\n                                    ",
        "saadi": "أَوَ لَا يَذۡكُرُ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن قَبۡلُ وَلَمۡ يَكُ شَيۡ‍ٔٗا ٧٦\n                                        \n                                        \n                                        \n                                        ذكر تعالى برهانا قاطعا، ودليلا واضحا، يعرفه كل أحد على إمكان البعث فقال: { أَوَلَا يَذْكُرُ الْإِنْسَانُ أَنَّا خَلَقْنَاهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْئًا } أي: أو لا يلفت نظره، ويستذكر حالته الأولى، وأن الله خلقه أول مرة، ولم يك شيئا، فمن قدر على خلقه من العدم، ولم يكن شيئا، مذكورا، أليس بقادر على إنشائه بعد ما تمزق، وجمعه بعد ما تفرق؟ وهذا كقوله: { وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ }\nوفي قوله: { أَوَلَا يَذْكُرُ الْإِنْسَانُ } دعوة للنظر، بالدليل العقلي، بألطف خطاب، وأن إنكار من أنكر ذلك، مبني على غفلة منه عن حاله الأولى، وإلا فلو تذكرها وأحضرها في ذهنه، لم ينكر ذلك.s\n                                    "
      },
      "originalText": "أَوَ لَا يَذۡكُرُ ٱلۡإِنسَٰنُ أَنَّا خَلَقۡنَٰهُ مِن قَبۡلُ وَلَمۡ يَكُ شَيۡ‍ٔٗا ٧٦"
    },
    {
      "number": 2318,
      "text": "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيَاطِينَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 68,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَوَرَبِّكَ لَنَحۡشُرَنَّهُمۡ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحۡضِرَنَّهُمۡ حَوۡلَ جَهَنَّمَ جِثِيّٗا ٨٦\n                                    \n                                    \n                                    وقوله : ( فوربك لنحشرنهم والشياطين ) أقسم الرب ، تبارك وتعالى ، بنفسه الكريمة ، أنه لا بد أن يحشرهم جميعا وشياطينهم الذين كانوا يعبدون من دون الله ، ( ثم لنحضرنهم حول جهنم جثيا ) .\nقال العوفي ، عن ابن عباس : يعني : قعودا كقوله : ( وترى كل أمة جاثية ) [ الجاثية : 28 ] .\nوقال السدي في قوله : ( ثم لنحضرنهم حول جهنم جثيا ) : يعني : قياما ، وروي عن مرة ، عن ابن مسعود مثله .\n                                    ",
        "qortoby": "فَوَرَبِّكَ لَنَحۡشُرَنَّهُمۡ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحۡضِرَنَّهُمۡ حَوۡلَ جَهَنَّمَ جِثِيّٗا ٨٦\n                                    \n                                    \n                                    قوله تعالى : فوربك لنحشرنهم أقسم بنفسه بعد إقامة الحجة بأنه يحشرهم من قبورهم إلى المعاد كما يحشر المؤمنين . والشياطين أي ولنحشرن الشياطين قرناء لهم قيل يحشر كل كافر مع شيطان في سلسلة كما قال : احشروا الذين ظلموا وأزواجهم الزمخشري والواو في والشياطين يجوز أن تكون للعطف وبمعنى مع وهي بمعنى مع أوقع والمعنى أنهم يحشرون مع قرنائهم من الشياطين الذين أغووهم ؛ يقرنون كل كافر مع شيطان في سلسلة . فإن قلت : هذا إذا أريد بالإنسان الكفرة خاصة فإن أريد الأناسي على العموم فكيف يستقيم حشرهم مع الشياطين ؟ قلت : إذا حشر جميع الناس حشرا واحدا وفيهم الكفرة مقرونين بالشياطين فقد حشروا مع الشياطين كما حشروا مع الكفرة فإن قلت : هلا عزل السعداء عن الأشقياء في الحشر كما عزلوا عنهم في الجزاء ؟ قلت لم يفرق بينهم في المحشر وأحضروا حيث تجاثوا حول جهنم وأوردوا معهم النار ليشاهد السعداء الأحوال التي نجاهم الله منها وخلصهم ، فيزدادوا لذلك غبطة وسرورا إلى سرور ويشمتوا بأعداء الله تعالى وأعدائهم فتزداد مساءتهم وحسرتهم وما يغيظهم من سعادة أولياء الله وشماتتهم بهم فإن قلت : ما معنى إحضارهم جثيا ؟ قلت : أما إذا فسر الإنسان بالخصوص فالمعنى أنهم يعتلون من المحشر إلى شاطئ جهنم عتلا على حالهم التي كانوا عليها في الموقف جثاة على ركبهم غير مشاة على أقدامهم وذلك أن أهل الموقف وصفوا بالجثو قال الله تعالى : وترى كل أمة جاثية على الحالة المعهودة في مواقف المقاولات والمناقلات ، من تجاثي أهلها على الركب لما في ذلك من الاستيفاز والقلق ، وإطلاق الحبا خلاف الطمأنينة أو لما يدهمهم من شدة الأمر التي لا يطيقون معها القيام على أرجلهم فيجثون على ركبهم جثوا . وإن فسر بالعموم فالمعنى أنهم يتجاثون عند موافاة شاطئ جهنم على أن جثيا حال مقدرة كما كانوا في الموقف متجاثين ؛ لأنه من توابع التواقف للحساب ، قبل التواصل إلى الثواب والعقاب ، ويقال : إن معنى لنحضرنهم حول جهنم جثيا أي جثيا على ركبهم ؛ عن مجاهد وقتادة أي أنهم لشدة ما هم فيه لا يقدرون على القيام . و حول جهنم يجوز أن يكون داخلها ؛ كما تقول : جلس القوم حول البيت أي داخله مطيفين به ، فقوله : حول جهنم على هذا يجوز أن يكون بعد الدخول ويجوز أن يكون قبل الدخول . و جثيا جمع جاث . يقال جثا على ركبتيه يجثو ويجثي جثوا وجثيا على فعول فيهما وأجثاه غيره ، وقوم جثي أيضا مثل جلس جلوسا وقوم جلوس ، وجثي أيضا بكسر الجيم لما بعدها من الكسر .\nوقال ابن عباس : جثيا جماعات ، وقال مقاتل : جمعا جمعا وهو على هذا التأويل جمع جثوة وجثوة وجثوة ثلاث لغات ، وهي الحجارة المجموعة والتراب المجموع ، فأهل الخمر على حدة ، وأهل الزنا على حدة ، وهكذا قال طرفة :\nترى جثوتين من تراب عليهما صفائح صم من صفيح منضد\nوقال الحسن والضحاك : جاثية على الركب . وهو على هذا التأويل جمع جاث على ما تقدم . وذلك لضيق المكان ؛ أي لا يمكنهم أن يجلسوا جلوسا تاما . وقيل : جثيا على ركبهم للتخاصم كقوله تعالى : ثم إنكم يوم القيامة عند ربكم تختصمون وقال الكميت :\nهم تركوا سراتهم جثيا وهم دون السراة مقرنينا\n                                    ",
        "saadi": "فَوَرَبِّكَ لَنَحۡشُرَنَّهُمۡ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحۡضِرَنَّهُمۡ حَوۡلَ جَهَنَّمَ جِثِيّٗا ٨٦\n                                        \n                                        \n                                        \n                                        أقسم الله تعالى وهو أصدق القائلين - بربوبيته، ليحشرن هؤلاء المنكرين للبعث، هم وشياطينهم فيجمعهم لميقات يوم معلوم، { ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا } أي: جاثين على ركبهم من شدة الأهوال، وكثرة الزلزال، وفظاعة الأحوال، منتظرين لحكم الكبير المتعال\n                                    "
      },
      "originalText": "فَوَرَبِّكَ لَنَحۡشُرَنَّهُمۡ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحۡضِرَنَّهُمۡ حَوۡلَ جَهَنَّمَ جِثِيّٗا ٨٦"
    },
    {
      "number": 2319,
      "text": "ثُمَّ لَنَنْزِعَنَّ مِنْ كُلِّ شِيعَةٍ أَيُّهُمْ أَشَدُّ عَلَى الرَّحْمَٰنِ عِتِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 69,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمۡ أَشَدُّ عَلَى ٱلرَّحۡمَٰنِ عِتِيّٗا ٩٦\n                                    \n                                    \n                                    وقوله : ( ثم لننزعن من كل شيعة ) يعني : من كل أمة قاله مجاهد ، ( أيهم أشد على الرحمن عتيا ) .\nقال الثوري ، عن علي بن الأقمر ، عن أبي الأحوص ، عن ابن مسعود قال : يحبس الأول على الآخر ، حتى إذا تكاملت العدة ، أتاهم جميعا ، ثم بدأ بالأكابر ، فالأكابر جرما ، وهو قوله : ( ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا ) .\nوقال قتادة : ( ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا ) قال : ثم لننزعن من أهل كل دين قادتهم ورؤساءهم في الشر . وكذا قال ابن جريج ، وغير واحد من السلف . وهذا كقوله تعالى : ( حتى إذا اداركوا فيها جميعا قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون وقالت أولاهم لأخراهم فما كان لكم علينا من فضل فذوقوا العذاب بما كنتم تكسبون ) [ الأعراف : 38 ، 39 ]\n                                    ",
        "qortoby": "ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمۡ أَشَدُّ عَلَى ٱلرَّحۡمَٰنِ عِتِيّٗا ٩٦\n                                    \n                                    \n                                    قوله تعالى : ثم لننزعن من كل شيعة أي لنستخرجن من كل أمة وأهل دين . أيهم أشد على الرحمن عتيا النحاس : وهذه آية مشكلة في الإعراب ؛ لأن القراء كلهم يقرءون أيهم بالرفع إلا هارون القارئ الأعور فإن سيبويه حكى عنه ( ثم لننزعن من كل شيعة أيهم ) بالنصب أوقع على أيهم لننزعن . قال أبو إسحاق في رفع أيهم ثلاثة أقوال ؛ قال الخليل بن أحمد حكاه عنه سيبويه : إنه مرفوع على الحكاية ، والمعنى ثم لننزعن من كل شيعة الذي يقال من أجل عتوه أيهم أشد على الرحمن عتيا ، وأنشد الخليل فقال :\nولقد أبيت من الفتاة بمنزل فأبيت لا حرج ولا محروم\nأي فأبيت بمنزلة الذي يقال له لا هو حرج ولا محروم . وقال أبو جعفر النحاس : ورأيت أبا إسحاق يختار هذا القول ويستحسنه ؛ قال : لأنه معنى قول أهل التفسير . وزعم أن معنى ثم لننزعن من كل شيعة ثم لننزعن من كل فرقة الأعتى فالأعتى . كأنه يبتدأ بالتعذيب بأشدهم عتيا ثم الذي يليه ؛ وهذا نص كلام أبي إسحاق في معنى الآية . وقال يونس : لننزعن بمنزلة الأفعال التي تلغى ورفع أيهم على الابتداء المهدوي . والفعل الذي هو لننزعن عند يونس معلق قال أبو علي : معنى ذلك أنه يعمل في موضع أيهم أشد لا أنه ملغى . ولا يعلق عند الخليل وسيبويه مثل لننزعن إنما يعلق بأفعال الشك وشبهها ما لم يتحقق وقوعه .\nوقال سيبويه : أيهم مبني على الضم لأنها خالفت أخواتها في الحذف ؛ لأنك لو قلت : رأيت الذي أفضل ومن أفضل كان قبيحا ، حتى تقول من هو أفضل ، والحذف في أيهم جائز . قال أبو جعفر : وما علمت أحدا من النحويين إلا وقد خطأ سيبويه في هذا وسمعت أبا إسحاق يقول : ما يبين لي أن سيبويه غلط في كتابه إلا في موضعين هذا أحدهما ؛ قال : وقد علمنا أن سيبويه أعرب أيا وهي مفردة لأنها تضاف ، فكيف يبنيها وهي مضافة ؟ ! ولم يذكر أبو إسحاق فيما علمت إلا هذه الثلاثة الأقوال . أبو علي : إنما وجب البناء على مذهب سيبويه ؛ لأنه حذف منه ما يتعرف به وهو الضمير مع افتقار إليه ، كما حذف في من قبل ومن بعد ما يتعرفان به مع افتقار المضاف إلى المضاف إليه ؛ لأن الصلة تبين الموصول وتوضحه كما أن المضاف إليه يبين المضاف ويخصصه .\nقال أبو جعفر : وفيه أربعة أقوال سوى هذه الثلاثة التي ذكرها أبو إسحاق قال الكسائي لننزعن واقعة على المعنى ، كما تقول : لبست من الثياب وأكلت من الطعام ، ولم يقع لننزعن على أيهم فينصبها . زاد المهدوي : وإنما الفعل عنده واقع على موضع من كل شيعة وقوله : أيهم أشد جملة مستأنفة مرتفعة بالابتداء ولا يرى سيبويه زيادة من في الواجب ، وقال الفراء المعنى ثم لننزعن بالنداء ومعنى لننزعن لننادين . المهدوي : ونادى فعل يعلق إذا كان بعده جملة كظننت فتعمل في المعنى ولا تعمل في اللفظ قال أبو جعفر وحكى أبو بكر بن شقير أن بعض الكوفيين يقول : في \" أيهم \" معنى الشرط والمجازاة فلذلك لم يعمل فيها ما قبلها والمعنى ثم لننزعن من كل فرقة إن تشايعوا أو لم يتشايعوا كما تقول ضربت القوم أيهم غضب والمعنى إن غضبوا أو لم يغضبوا قال أبو جعفر فهذه ستة أقوال وسمعت علي بن سليمان يحكي عن محمد بن يزيد قال : أيهم متعلق بشيعة فهو مرفوع بالابتداء ؛ والمعنى ثم لننزعن من الذين تشايعوا أيهم ؛ أي من الذين تعاونوا فنظروا ؛ أيهم أشد على الرحمن عتيا ؛ وهذا قول حسن وقد حكى الكسائي أن التشايع التعاون و ( عتيا ) نصب على البيان\n                                    ",
        "saadi": "ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمۡ أَشَدُّ عَلَى ٱلرَّحۡمَٰنِ عِتِيّٗا ٩٦\n                                        \n                                        \n                                        \n                                        { ثُمَّ لَنَنْزِعَنَّ مِنْ كُلِّ شِيعَةٍ أَيُّهُمْ أَشَدُّ عَلَى الرَّحْمَنِ عِتِيًّا } أي: ثم لننزعن من كل طائفة وفرقة من الظالمين المشتركين في الظلم والكفر والعتو أشدهم عتوا، وأعظمهم ظلما، وأكبرهم كفرا، فيقدمهم إلى العذاب، ثم هكذا يقدم إلى العذاب، الأغلظ إثما، فالأغلظ وهم في تلك الحال متلاعنون، يلعن بعضهم بعضا، ويقول أخراهم لأولاهم: { رَبَّنَا هَؤُلَاءِ أَضَلُّونَا فَآتِهِمْ عَذَابًا ضِعْفًا مِنَ النَّارِ قَالَ لِكُلٍّ ضِعْفٌ وَلَكِنْ لَا تَعْلَمُونَ* وَقَالَتْ أُولَاهُمْ لِأُخْرَاهُمْ فَمَا كَانَ لَكُمْ عَلَيْنَا مِنْ فَضْلٍ } وكل هذا تابع لعدله وحكمته وعلمه الواسع\n                                    "
      },
      "originalText": "ثُمَّ لَنَنزِعَنَّ مِن كُلِّ شِيعَةٍ أَيُّهُمۡ أَشَدُّ عَلَى ٱلرَّحۡمَٰنِ عِتِيّٗا ٩٦"
    },
    {
      "number": 2320,
      "text": "ثُمَّ لَنَحْنُ أَعْلَمُ بِالَّذِينَ هُمْ أَوْلَىٰ بِهَا صِلِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 70,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ لَنَحۡنُ أَعۡلَمُ بِٱلَّذِينَ هُمۡ أَوۡلَىٰ بِهَا صِلِيّٗا ٠٧\n                                    \n                                    \n                                    وقوله : ( ثم لنحن أعلم بالذين هم أولى بها صليا ) \" ثم \" هاهنا لعطف الخبر على الخبر ، والمراد أنه تعالى أعلم بمن يستحق من العباد أن يصلى بنار جهنم ويخلد فيها ، وبمن يستحق تضعيف العذاب ، كما قال في الآية المتقدمة : ( قال لكل ضعف ولكن لا تعلمون )\n                                    ",
        "qortoby": "ثُمَّ لَنَحۡنُ أَعۡلَمُ بِٱلَّذِينَ هُمۡ أَوۡلَىٰ بِهَا صِلِيّٗا ٠٧\n                                    \n                                    \n                                    ثم لنحن أعلم بالذين هم أولى بها صليا أي أحق بدخول النار . يقال : صلى يصلى صليا ، نحو مضى الشيء يمضي مضيا إذا ذهب وهوى يهوي هويا ، وقال الجوهري : ويقال صليت الرجل نارا إذا أدخلته النار ، وجعلته يصلاها ، فإن ألقيته فيها إلقاء كأنك تريد الإحراق قلت : أصليته بالألف وصليته تصلية وقرئ ( ويصلى سعيرا ) ومن خفف فهو من قولهم : صلي فلان بالنار ( بالكسر ) يصلى صليا احترق قال الله تعالى هم أولى بها صليا قال العجاج :\nوالله لولا النار أن نصلاها\nويقال أيضا : صلي بالأمر إذا قاسى حره وشدته . قال الطهوي :\nولا تبلى بسالتهم وإن هم صلوا بالحرب حينا بعد حين\nواصطليت بالنار وتصليت بها قال أبو زبيد :\nوقد تصليت حر حربهم كما تصلى المقرور من قرس\nوفلان لا يصطلى بناره إذا كان شجاعا لا يطاق .\n                                    ",
        "saadi": "ثُمَّ لَنَحۡنُ أَعۡلَمُ بِٱلَّذِينَ هُمۡ أَوۡلَىٰ بِهَا صِلِيّٗا ٠٧\n                                        \n                                        \n                                        \n                                        { ثُمَّ لَنَحْنُ أَعْلَمُ بِالَّذِينَ هُمْ أَوْلَى بِهَا صِلِيًّا } أي: علمنا محيط بمن هو أولى صليا بالنار، قد علمناهم، وعلمنا أعمالهم واستحقاقها وقسطها من العذاب.\n                                    "
      },
      "originalText": "ثُمَّ لَنَحۡنُ أَعۡلَمُ بِٱلَّذِينَ هُمۡ أَوۡلَىٰ بِهَا صِلِيّٗا ٠٧"
    },
    {
      "number": 2321,
      "text": "وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا ۚ كَانَ عَلَىٰ رَبِّكَ حَتْمًا مَقْضِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 71,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن مِّنكُمۡ إِلَّا وَارِدُهَاۚ كَانَ عَلَىٰ رَبِّكَ حَتۡمٗا مَّقۡضِيّٗا ١٧\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا سليمان بن حرب ، حدثنا خالد بن سليمان ، عن كثير بن زياد البرساني ، عن أبي سمية قال : اختلفنا في الورود ، فقال بعضنا : لا يدخلها مؤمن . وقال بعضهم : يدخلونها جميعا ، ثم ينجي الله الذين اتقوا . فلقيت جابر بن عبد الله فقلت له : إنا اختلفنا في الورود ، فقال : يردونها جميعا - وقال سليمان مرة يدخلونها جميعا - وأهوى بأصبعيه إلى أذنيه ، وقال : صمتا ، إن لم أكن سمعت رسول الله صلى الله عليه وسلم يقول : \" لا يبقى بر ولا فاجر إلا دخلها ، فتكون على المؤمن بردا وسلاما ، كما كانت على إبراهيم ، حتى إن للنار ضجيجا من بردهم ، ثم ينجي الله الذين اتقوا ، ويذر الظالمين فيها جثيا \" غريب ولم يخرجوه .\nوقال الحسن بن عرفة : حدثنا مروان بن معاوية ، عن بكار بن أبي مروان ، عن خالد بن معدان قال : قال أهل الجنة بعدما دخلوا الجنة : ألم يعدنا ربنا الورود على النار ؟ قال : قد مررتم عليها وهي خامدة .\nوقال عبد الرزاق ، عن ابن عيينة ، عن إسماعيل بن أبي خالد ، عن قيس بن أبي حازم قال : كان عبد الله بن رواحة واضعا رأسه في حجر امرأته ، فبكى ، فبكت امرأته فقال ما يبكيك ؟ فقالت : رأيتك تبكي فبكيت . قال : إني ذكرت قول الله عز وجل : ( وإن منكم إلا واردها ) ، فلا أدري أنجو منها أم لا ؟ وفي رواية : وكان مريضا .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا ابن يمان ، عن مالك بن مغول ، عن أبي إسحاق : كان أبو ميسرة إذا أوى إلى فراشه قال : يا ليت أمي لم تلدني ثم يبكي ، فقيل : ما يبكيك يا أبا ميسرة ؟ فقال : أخبرنا أنا واردوها ، ولم نخبر أنا صادرون عنها .\nوقال عبد الله بن المبارك ، عن الحسن البصري قال : قال رجل لأخيه : هل أتاك أنك وارد النار ؟ قال : نعم . قال : فهل أتاك أنك صادر عنها ؟ قال : لا . قال : ففيم الضحك ؟ قال : فما رئي ضاحكا حتى لحق بالله .\nوقال عبد الرزاق أيضا : أخبرنا ابن عيينة ، عن عمرو ، أخبرني من سمع ابن عباس يخاصم نافع بن الأزرق ، فقال ابن عباس : الورود الدخول ؟ فقال نافع : لا ، فقرأ ابن عباس : ( إنكم وما تعبدون من دون الله حصب جهنم أنتم لها واردون ) [ الأنبياء : 98 ] وردوا أم لا ؟ وقال : ( يقدم قومه يوم القيامة فأوردهم النار ) [ هود : 98 ] أورد هو أم لا ؟ أما أنا وأنت فسندخلها ، فانظر هل نخرج منها أم لا ؟ وما أرى الله مخرجك منها بتكذيبك فضحك نافع .\nوروى ابن جريج ، عن عطاء قال : قال أبو راشد الحروري - وهو نافع بن الأزرق - : ( لا يسمعون حسيسها ) [ الأنبياء : 102 ] فقال ابن عباس : ويلك : أمجنون أنت ؟ أين قوله : ( يقدم قومه يوم القيامة فأوردهم النار ) [ هود : 98 ] ، ( ونسوق المجرمين إلى جهنم وردا ) [ مريم : 86 ] ، ( وإن منكم إلا واردها ) ؟ والله إن كان دعاء من مضى : اللهم أخرجني من النار سالما ، وأدخلني الجنة غانما .\nوقال ابن جرير : حدثني محمد بن عبيد المحاربي ، حدثنا أسباط ، عن عبد الملك ، عن عبيد الله ، عن مجاهد قال : كنت عند ابن عباس ، فأتاه رجل يقال له : أبو راشد ، وهو نافع بن الأزرق ، فقال له : يا ابن عباس ، أرأيت قول الله : ( وإن منكم إلا واردها كان على ربك حتما مقضيا ) ؟ قال : أما أنا وأنت يا أبا راشد فسنردها ، فانظر : هل نصدر عنها أم لا .\nوقال أبو داود الطيالسي : قال شعبة ، أخبرني عبد الله بن السائب ، عمن سمع ابن عباس يقرؤها كذلك : \" وإن منهم إلا واردها \" يعني : الكفار\nوهكذا روى عمرو بن الوليد الشني ، أنه سمع عكرمة يقرؤها كذلك : \" وإن منهم إلا واردها \" ، قال : وهم الظلمة . كذلك كنا نقرؤها . رواه ابن أبي حاتم وابن جرير .\nوقال العوفي ، عن ابن عباس قوله : ( وإن منكم إلا واردها كان على ربك حتما مقضيا ) يعني : البر والفاجر ، ألا تسمع إلى قول الله لفرعون : ( يقدم قومه يوم القيامة فأوردهم النار وبئس الورد المورود ) ( ونسوق المجرمين إلى جهنم وردا ) ، فسمى الورود في النار دخولا وليس بصادر .\nوقال الإمام أحمد : حدثنا عبد الرحمن ، عن إسرائيل ، عن السدي ، عن مرة ، عن عبد الله - هو ابن مسعود - ( وإن منكم إلا واردها ) قال رسول الله صلى الله عليه وسلم : \" يرد الناس النار كلهم ، ثم يصدرون عنها بأعمالهم \" .\nورواه الترمذي عن عبد بن حميد ، عن عبيد الله ، عن إسرائيل ، عن السدي به . ورواه من طريق شعبة ، عن السدي ، عن مرة ، عن ابن مسعود موقوفا .\nهكذا وقع هذا الحديث هاهنا مرفوعا . وقد رواه أسباط ، عن السدي ، عن مرة عن عبد الله بن مسعود قال : يرد الناس جميعا الصراط ، وورودهم قيامهم حول النار ، ثم يصدرون عن الصراط بأعمالهم ، فمنهم من يمر مثل البرق ، ومنهم من يمر مثل الريح ، ومنهم من يمر مثل الطير ، ومنهم من يمر كأجود الخيل ، ومنهم من يمر كأجود الإبل ، ومنهم من يمر كعدو الرجل ، حتى إن آخرهم مرا رجل نوره على موضعي إبهامي قدميه ، يمر يتكفأ به الصراط ، والصراط دحض مزلة ، عليه حسك كحسك القتاد ، حافتاه ملائكة ، معهم كلاليب من نار ، يختطفون بها الناس . وذكر تمام الحديث . رواه ابن أبي حاتم .\nوقال ابن جرير : حدثنا خلاد بن أسلم ، حدثنا النضر ، حدثنا إسرائيل ، أخبرنا أبو إسحاق ، عن أبي الأحوص عن عبد الله : قوله : ( وإن منكم إلا واردها ) قال : الصراط على جهنم مثل حد السيف ، فتمر الطبقة الأولى كالبرق ، والثانية كالريح ، والثالثة كأجود الخيل ، والرابعة كأجود البهائم ، ثم يمرون والملائكة يقولون : اللهم سلم سلم .\nولهذا شواهد في الصحيحين وغيرهما ، من رواية أنس ، وأبي سعيد ، وأبي هريرة ، وجابر ، وغيرهم من الصحابة رضي الله عنهم .\nوقال ابن جرير : حدثني يعقوب ، حدثنا ابن علية عن الجريري ، عن أبي السليل عن غنيم بن قيس قال : ذكروا ورود النار ، فقال كعب : تمسك النار للناس كأنها متن إهالة حتى يستوي عليها أقدام الخلائق ، برهم وفاجرهم ، ثم يناديها مناد : أن امسكي أصحابك ، ودعي أصحابي ، قال : فتخسف بكل ولي لها ، ولهي أعلم بهم من الرجل بولده ، ويخرج المؤمنون ندية ثيابهم . قال كعب : ما بين منكبي الخازن من خزنتها مسيرة سنة ، مع كل واحد منهم عمود ذو شعبتين ، يدفع به الدفع فيصرع به في النار سبعمائة ألف .\nوقال الإمام أحمد : حدثنا أبو معاوية ، حدثنا الأعمش ، عن أبي سفيان ، عن جابر ، عن أم مبشر ، عن حفصة قالت : قال رسول الله صلى الله عليه وسلم : \" إني لأرجو ألا يدخل النار - إن شاء الله - أحد شهد بدرا والحديبية \" قالت فقلت : أليس الله يقول ( وإن منكم إلا واردها ) ؟ قالت : فسمعته يقول : ( ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا ) .\nوقال الإمام أحمد أيضا : حدثنا ابن إدريس ، حدثنا الأعمش ، عن أبي سفيان ، عن جابر ، عن أم مبشر - امرأة زيد بن حارثة - قالت : كان رسول الله صلى الله عليه وسلم في بيت حفصة ، فقال : \" لا يدخل النار أحد شهد بدرا والحديبية \" قالت حفصة : أليس الله يقول : ( وإن منكم إلا واردها ) ؟ فقال رسول الله صلى الله عليه وسلم : ( ثم ننجي الذين اتقوا ) .\nوفي الصحيحين ، من حديث الزهري ، عن سعيد ، عن أبي هريرة - رضي الله عنه - قال : قال رسول الله صلى الله عليه وسلم : \" لا يموت لأحد من المسلمين ثلاثة من الولد تمسه النار ، إلا تحلة القسم \" .\nوقال عبد الرزاق : قال معمر : أخبرني الزهري ، عن ابن المسيب ، عن أبي هريرة ، أن النبي صلى الله عليه وسلم قال : \" من مات له ثلاثة لم تمسه النار إلا تحلة القسم \" يعني الورود .\nوقال أبو داود الطيالسي : حدثنا زمعة ، عن الزهري ، عن سعيد بن المسيب ، عن أبي هريرة قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" لا يموت لمسلم ثلاثة من الولد ، تمسه النار إلا تحلة القسم \" . قال الزهري : كأنه يريد هذه الآية : ( وإن منكم إلا واردها كان على ربك حتما مقضيا ) .\nوقال ابن جرير : حدثني عمران بن بكار الكلاعي ، حدثنا أبو المغيرة ، حدثنا عبد الرحمن بن يزيد بن تميم ، حدثنا إسماعيل بن عبيد الله ، عن أبي صالح ، عن أبي هريرة ، قال : خرج رسول الله صلى الله عليه وسلم يعود رجلا من أصحابه وعكا ، وأنا معه ، ثم قال : \" إن الله تعالى يقول : هي ناري أسلطها على عبدي المؤمن ; لتكون حظه من النار في الآخرة \" غريب ولم يخرجوه من هذا الوجه .\nوحدثنا أبو كريب ، حدثنا ابن يمان ، عن عثمان بن الأسود ، عن مجاهد قال : الحمى حظ كل مؤمن من النار ، ثم قرأ : \" وإن منكم إلا واردها \" .\nوقال الإمام أحمد : حدثنا حسن ، حدثنا ابن لهيعة ، حدثنا زبان بن فائد ، عن سهل بن معاذ بن أنس الجهني ، عن أبيه ، عن رسول الله صلى الله عليه وسلم قال : \" من قرأ : ( قل هو الله أحد ) حتى يختمها عشر مرات ، بنى الله له قصرا في الجنة \" . فقال عمر : إذا نستكثر يا رسول الله ، فقال رسول الله صلى الله عليه وسلم : \" لله أكثر وأطيب \" .\nوقال رسول الله صلى الله عليه وسلم : \" من قرأ ألف آية في سبيل الله ، كتب يوم القيامة مع النبيين والصديقين والشهداء والصالحين ، وحسن أولئك رفيقا ، إن شاء الله . ومن حرس من وراء المسلمين في سبيل الله متطوعا لا بأجرة سلطان ، لم ير النار بعينيه إلا تحلة القسم ، قال الله تعالى : ( وإن منكم إلا واردها ) وإن الذكر في سبيل الله يضعف فوق النفقة بسبعمائة ضعف \" . وفي رواية : \" بسبعمائة ألف ضعف \"\nوروى أبو داود ، عن أبي الطاهر ، عن ابن وهب ، عن يحيى بن أيوب وسعيد بن أبي أيوب كلاهما عن زبان ، عن سهل ، عن أبيه ، عن رسول الله صلى الله عليه وسلم : \" إن الصلاة والصيام والذكر تضاعف على النفقة في سبيل الله بسبعمائة ضعف \" .\nوقال عبد الرزاق ، عن معمر ، عن قتادة قوله : ( وإن منكم إلا واردها ) قال : هو الممر عليها .\nوقال عبد الرحمن بن زيد بن أسلم في قوله : ( وإن منكم إلا واردها ) ، قال : ورود المسلمين المرور على الجسر بين ظهريها ، وورود المشركين : أن يدخلوها ، وقال النبي صلى الله عليه وسلم : \" الزالون والزالات يومئذ كثير ، وقد أحاط بالجسر يومئذ سماطان من الملائكة ، دعاؤهم : يا ألله سلم سلم \" .\nوقال السدي ، عن مرة ، عن ابن مسعود في قوله : ( كان على ربك حتما مقضيا ) قال : قسما واجبا . وقال مجاهد : حتما ، قال : قضاء . وكذا قال ابن جريج\n                                    ",
        "qortoby": "وَإِن مِّنكُمۡ إِلَّا وَارِدُهَاۚ كَانَ عَلَىٰ رَبِّكَ حَتۡمٗا مَّقۡضِيّٗا ١٧\n                                    \n                                    \n                                    قوله تعالى : وإن منكم إلا واردها كان على ربك حتما مقضيا فيه خمس مسائل :\nالأولى : قوله تعالى : وإن منكم هذا قسم والواو يتضمنه ، ويفسره حديث النبي - صلى الله عليه وسلم - لا يموت لأحد من المسلمين ثلاثة من الولد فتمسه النار إلا تحلة القسم قال الزهري : كأنه يريد هذه الآية وإن منكم إلا واردها ذكره أبو داود الطيالسي فقوله : إلا تحلة القسم يخرج في التفسير المسند ؛ لأن القسم المذكور في هذا الحديث معناه عند أهل العلم قوله تعالى : وإن منكم إلا واردها وقد قيل : إن المراد بالقسم قوله تعالى : والذاريات ذروا إلى قوله : إنما توعدون لصادق وإن الدين لواقع والأول أشهر ؛ والمعنى متقارب .\nالثانية : واختلف الناس في الورود فقيل : الورود الدخول روي عن جابر بن عبد الله قال سمعت رسول الله - صلى الله عليه وسلم - يقول ( الورود الدخول لا يبقى بر ولا فاجر إلا دخلها فتكون على المؤمنين بردا وسلاما كما كانت على إبراهيم ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا أسنده أبو عمر في كتاب ( التمهيد ) . وهو قول ابن عباس وخالد بن معدان وابن جريج وغيرهم وروي عن يونس أنه كان يقرأ وإن منكم إلا واردها الورود الدخول على التفسير للورود فغلط فيه بعض الرواة فألحقه بالقرآن وفي الدارمي عن عبد الله بن مسعود قال : قال رسول الله - صلى الله عليه وسلم - : يرد الناس النار ثم يصدرون منها بأعمالهم ، فمنهم كلمح البصر ، ثم كالريح ثم كحضر الفرس ، ثم كالراكب المجد في رحله ، ثم كشد الرجل في مشيته وروي عن ابن عباس أنه قال في هذه المسألة لنافع بن الأزرق الخارجي ( أما أنا وأنت فلا بد أن نردها أما أنا فينجيني الله منها وأما أنت فما أظنه ينجيك لتكذيبك ) وقد أشفق كثير من العلماء من تحقق الورود والجهل بالصدر وقد بيناه في ( التذكرة ) . وقالت فرقة : الورود الممر على الصراط وروي عن ابن عباس وابن مسعود وكعب الأحبار والسدي ورواه السدي عن ابن مسعود عن النبي - صلى الله عليه وسلم - وقاله الحسن أيضا ؛ قال : ليس الورود الدخول إنما تقول وردت البصرة ولم أدخلها قال : فالورود أن يمروا على الصراط ، قال أبو بكر الأنباري : وقد بنى على مذهب الحسن قوم من أهل اللغة ، واحتجوا بقول الله تعالى : إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون قالوا : فلا يدخل النار من ضمن الله أن يبعده منها وكان هؤلاء يقرءون ( ثم ) بفتح الثاء ننجي الذين اتقوا واحتج عليهم الآخرون أهل المقالة الأولى بأن معنى قوله : أولئك عنها مبعدون عن العذاب فيها ، والإحراق بها ، قالوا : فمن دخلها وهو لا يشعر بها ولا يحس منها وجعا ، ولا ألما فهو مبعد عنها في الحقيقة ويستدلون بقوله تعالى : ثم ننجي الذين اتقوا بضم الثاء ف ( ثم ) تدل على نجاء بعد الدخول . قلت : وفي صحيح مسلم ثم يضرب الجسر على جهنم وتحل الشفاعة فيقولون اللهم سلم سلم قيل : يا رسول الله وما الجسر ؟ قال : دحض مزلة فيه خطاطيف وكلاليب ، وحسك تكون بنجد فيها شويكة ، يقال لها السعدان ، فيمر المؤمنون كطرف العين وكالبرق وكالريح وكالطير ، وكأجاويد الخيل والركاب فناج مسلم ومخدوش مرسل ، ومكدوس في نار جهنم الحديث وبه احتج من قال إن الجواز على الصراط هو الورود الذي تضمنته هذه الآية لا الدخول فيها ، وقالت فرقة : بل هو ورود إشراف واطلاع وقرب ، وذلك أنه يحضرون موضع الحساب وهو بقرب جهنم فيرونها وينظرون إليها في حالة الحساب ، ثم ينجي الله الذين اتقوا مما نظروا إليه ويصار بهم إلى الجنة ونذر الظالمين أي يؤمر بهم إلى النار قال الله تعالى ولما ورد ماء مدين أي أشرف عليه لا أنه دخله ، وقال زهير :\nفلما وردن الماء زرقا جمامه وضعن عصي الحاضر المتخيم\nوروت حفصة أن رسول الله - صلى الله عليه وسلم - قال لا يدخل النار أحد من أهل بدر والحديبية قالت : فقلت يا رسول الله : وأين قول الله تعالى : وإن منكم إلا واردها فقال رسول الله - صلى الله عليه وسلم - فمه ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا أخرجه مسلم من حديث أم مبشر قالت سمعت النبي - صلى الله عليه وسلم - عند حفصة الحديث ورجح الزجاج هذا القول بقوله تعالى : إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون وقال مجاهد :\nورود المؤمنين النار هو الحمى التي تصيب المؤمن في دار الدنيا ، وهي حظ المؤمن من النار فلا يردها . روى أبو هريرة أن رسول الله - صلى الله عليه وسلم - عاد مريضا من وعك به فقال له النبي - صلى الله عليه وسلم - أبشر فإن الله تبارك وتعالى يقول ( هي ناري أسلطها على عبدي المؤمن لتكون حظه من النار ) أسنده أبو عمر قال : حدثنا عبد الوارث بن سفيان قال حدثنا قاسم بن أصبغ قال : حدثنا محمد بن إسماعيل الصائغ قال حدثنا أبو أسامة قال حدثنا عبد الرحمن بن يزيد بن جابر عن إسماعيل بن عبيد الله ( عن أبي صالح ) الأشعري عن أبي هريرة عن النبي - صلى الله عليه وسلم - عاد مريضا فذكره .\nوفي الحديث الحمى حظ المؤمن من النار وقالت فرقة : الورود النظر إليها في القبر فينجى منها الفائز ويصلاها من قدر عليه دخولها ، ثم يخرج منها بالشفاعة أو بغيرها من رحمة الله تعالى ، واحتجوا بحديث ابن عمر : إذا مات أحدكم عرض عليه مقعده بالغداة والعشي الحديث وروى وكيع عن شعبة عن عبد الله بن السائب عن رجل عن ابن عباس ، أنه قال في قول الله تعالى : وإن منكم إلا واردها قال : هذا خطاب للكفار . وروي عنه أنه كان يقرأ ( وإن منهم ) ردا على الآيات التي قبلها في الكفار : قوله : ( فوربك لنحشرنهم والشياطين ثم لنحضرنهم حول جهنم جثيا ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا ثم لنحن أعلم بالذين هم أولى بها صليا وإن منهم ) وكذلك قرأ عكرمة وجماعة وعليها فلا شعب في هذه القراءة وقالت فرقة المراد ب ( منكم ) الكفرة والمعنى قل لهم يا محمد وهذا التأويل أيضا سهل التناول والكاف في منكم راجعة إلى الهاء في لنحشرنهم والشياطين ثم لنحضرنهم حول جهنم جثيا فلا ينكر رجوع الكاف إلى الهاء ؛ فقد عرف ذلك في قوله - عز وجل - وسقاهم ربهم شرابا طهورا إن هذا كان لكم جزاء وكان سعيكم مشكورا معناه كان لهم ، فرجعت الكاف إلى الهاء .\nوقال الأكثر : المخاطب العالم كله ولا بد من ورود الجميع وعليه نشأ الخلاف في الورود وقد بينا أقوال العلماء فيه وظاهر الورود الدخول لقوله - عليه الصلاة والسلام - : فتمسه النار لأن المسيس حقيقته في اللغة المماسة إلا أنها تكون بردا وسلاما على المؤمنين وينجون منها سالمين قال خالد بن معدان : إذا دخل أهل الجنة الجنة قالوا ألم يقل ربنا إنا نرد النار ؟ فيقال لقد وردتموها فألفيتموها رمادا . قلت : وهذا القول يجمع شتات الأقوال ؛ فإن من وردها ، ولم تؤذه بلهبها وحرها ، فقد أبعد عنها ونجي منها . نجانا الله تعالى منها بفضله وكرمه ، وجعلنا ممن وردها فدخلها سالما وخرج منها غانما . فإن قيل : فهل يدخل الأنبياء النار ؟ قلنا : لا نطلق هذا ولكن نقول : إن الخلق جميعا يردونها ، كما دل عليه حديث جابر أول الباب فالعصاة يدخلونها بجرائمهم ، والأولياء والسعداء لشفاعتهم فبين الدخولين بون وقال ابن الأنباري محتجا لمصحف عثمان وقراءة العامة جائز في اللغة أن يرجع من خطاب الغيبة إلى لفظ المواجهة بالخطاب كما قال : وسقاهم ربهم شرابا طهورا إن هذا كان لكم جزاء وكان سعيكم مشكورا فأبدل الكاف من الهاء . وقد تقدم هذا المعنى في ( يونس ) . الثالثة : الاستثناء في قوله - عليه السلام - ( إلا تحلة القسم ) ، يحتمل أن يكون استثناء منقطعا ، لكن تحلة القسم ، وهذا معروف في كلام العرب ، والمعنى ألا تمسه النار أصلا ، وتم الكلام هنا ثم ابتدأ ( إلا تحلة القسم ) أي لكن تحلة القسم لا بد منها في قوله تعالى : وإن منكم إلا واردها وهو الجواز على الصراط أو الرؤية أو الدخول دخول سلامة ، فلا يكون في ذلك شيء من مسيس لقوله - عليه الصلاة والسلام - لا يموت لأحدكم ثلاثة من الولد فيحتسبهم إلا كانوا له جنة من النار والجنة الوقاية والستر ومن وقي النار ، وستر عنها فلن تمسه أصلا ولو مسته لما كان موقى .\nالرابعة : هذا الحديث يفسر الأول لأن فيه ذكر الحسبة ؛ ولذلك جعله مالك بأثره مفسرا له ويقيد هذا الحديث الثاني أيضا ما رواه البخاري عن أبي هريرة عن النبي - صلى الله عليه وسلم - من مات له ثلاثة من الولد لم يبلغوا الحنث كان له حجابا من النار أو دخل الجنة فقوله - عليه السلام - لم يبلغوا الحنث ومعناه عند أهل العلم لم يبلغوا الحلم ولم يبلغوا أن يلزمهم حنث دليل على أن أطفال المسلمين في الجنة والله أعلم لأن الرحمة إذا نزلت بآبائهم استحال أن يرحموا من أجل ( من ) ليس بمرحوم . وهذا إجماع من العلماء في أن أطفال المسلمين في الجنة ، ولم يخالف في ذلك إلا فرقة شذت من الجبرية فجعلتهم في المشيئة وهو قول مهجور مردود بإجماع الحجة الذين لا تجوز مخالفتهم ، ولا يجوز على مثلهم الغلط إلى ما روي عن النبي - صلى الله عليه وسلم - من أخبار الآحاد الثقات العدول ؛ وأن قوله - عليه الصلاة والسلام - : الشقي من شقي في بطن أمه ، والسعيد من سعد في بطن أمه وأن الملك ينزل فيكتب أجله وعمله ورزقه الحديث مخصوص ، وأن من مات من أطفال المسلمين قبل الاكتساب ، فهو ممن سعد في بطن أمه ، ولم يشق بدليل الأحاديث والإجماع .\nوكذلك قوله - صلى الله عليه وسلم - لعائشة - رضي الله تعالى عنها - : ( يا عائشة إن الله خلق الجنة وخلق لها أهلا وهم في أصلاب آبائهم ، وخلق النار وخلق لها أهلا وهم في أصلاب آبائهم ) ساقط ضعيف مردود بالإجماع والآثار ، وطلحة بن يحيى الذي يرويه ضعيف لا يحتج به ، وهذا الحديث مما انفرد به فلا يعرج عليه . وقد روى شعبة عن معاوية بن قرة بن إياس المزني عن أبيه عن النبي - صلى الله عليه وسلم - أن رجلا من الأنصار مات له ابن صغير فوجد عليه ، فقال له رسول الله - صلى الله عليه وسلم - : أما يسرك ألا تأتي بابا من أبواب الجنة إلا وجدته يستفتح لك فقالوا : يا رسول الله أله خاصة أم للمسلمين عامة ؟ قال بل للمسلمين عامة قال أبو عمر : هذا حديث ثابت صحيح يعني ما ذكرناه مع إجماع الجمهور ؛ وهو يعارض حديث يحيى ويدفعه قال أبو عمر : الوجه عندي في هذا الحديث وما أشبهه من الآثار أنها لمن حافظ على أداء فرائضه واجتنب الكبائر ، وصبر واحتسب في مصيبته ؛ فإن الخطاب لم يتوجه في ذلك العصر إلا إلى قوم الأغلب من أمرهم ما وصفنا وهم الصحابة - رضي الله تعالى عنهم أجمعين - وذكر النقاش عن بعضهم أنه قال : نسخ قوله تعالى : وإن منكم إلا واردها قوله : إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون وهذا ضعيف ، وهذا ليس موضع نسخ . وقد بينا أنه إذا لم تمسه النار فقد أبعد عنها وفي الخبر : ( تقول النار للمؤمن يوم القيامة جز يا مؤمن فقد أطفأ نورك لهبي ) .\nالخامسة : قوله تعالى : كان على ربك حتما مقضيا الحتم إيجاب القضاء أي كان ذلك حتما . مقضيا أي قضاه الله تعالى عليكم ، وقال ابن مسعود أي قسما واجبا .\n                                    ",
        "saadi": "وَإِن مِّنكُمۡ إِلَّا وَارِدُهَاۚ كَانَ عَلَىٰ رَبِّكَ حَتۡمٗا مَّقۡضِيّٗا ١٧\n                                        \n                                        \n                                        \n                                        وهذا خطاب لسائر الخلائق، برهم وفاجرهم، مؤمنهم وكافرهم، أنه ما منهم من أحد، إلا سيرد النار، حكما حتمه الله على نفسه، وأوعد به عباده، فلا بد من نفوذه، ولا محيد عن وقوعه.واختلف في معنى الورود، فقيل: ورودها، حضورها للخلائق كلهم، حتى يحصل الانزعاج من كل أحد، ثم بعد، ينجي الله المتقين. وقيل: ورودها، دخولها، فتكون على المؤمنين بردا وسلاما. وقيل: الورود، هو المرور على الصراط، الذي هو على متن جهنم، فيمر الناس على قدر أعمالهم، فمنهم من يمر كلمح البصر، وكالريح، وكأجاويد الخيل، وكأجاويد الركاب، ومنهم من يسعى، ومنهم من يمشي مشيا، ومنهم من يزحف زحفا، ومنهم من يخطف فيلقى في النار، كل بحسب تقواه\n                                    "
      },
      "originalText": "وَإِن مِّنكُمۡ إِلَّا وَارِدُهَاۚ كَانَ عَلَىٰ رَبِّكَ حَتۡمٗا مَّقۡضِيّٗا ١٧"
    },
    {
      "number": 2322,
      "text": "ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 72,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ نُنَجِّي ٱلَّذِينَ ٱتَّقَواْ وَّنَذَرُ ٱلظَّٰلِمِينَ فِيهَا جِثِيّٗا ٢٧\n                                    \n                                    \n                                    وقوله : ( ثم ننجي الذين اتقوا ) أي : إذا مر الخلائق كلهم على النار ، وسقط فيها من سقط من الكفار والعصاة ذوي المعاصي بحسبهم ، نجى الله تعالى المؤمنين المتقين منها بحسب أعمالهم . فجوازهم على الصراط وسرعتهم بقدر أعمالهم التي كانت في الدنيا ، ثم يشفعون في أصحاب الكبائر من المؤمنين ، فيشفع الملائكة والنبيون والمؤمنون ، فيخرجون خلقا كثيرا قد أكلتهم النار ، إلا دارات وجوههم - وهي مواضع السجود - وإخراجهم إياهم من النار بحسب ما في قلوبهم من الإيمان ، فيخرجون أولا من كان في قلبه مثقال دينار من إيمان ، ثم الذي يليه ، ثم الذي يليه ، ثم الذي يليه حتى يخرجوا من كان في قلبه أدنى أدنى أدنى مثقال ذرة من إيمان ثم يخرج الله من النار من قال يوما من الدهر : \" لا إله إلا الله \" وإن لم يعمل خيرا قط ، ولا يبقى في النار إلا من وجب عليه الخلود ، كما وردت بذلك الأحاديث الصحيحة عن رسول الله صلى الله عليه وسلم; ولهذا قال تعالى : ( ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا )\n                                    ",
        "qortoby": "ثُمَّ نُنَجِّي ٱلَّذِينَ ٱتَّقَواْ وَّنَذَرُ ٱلظَّٰلِمِينَ فِيهَا جِثِيّٗا ٢٧\n                                    \n                                    \n                                    قوله تعالى : ثم ننجي الذين اتقوا أي نخلصهم ونذر الظالمين فيها جثيا وهذا مما يدل على أن الورود الدخول ؛ لأنه لم يقل وندخل الظالمين وقد مضى هذا المعنى مستوفى ، والمذهب أن صاحب الكبيرة ، وإن دخلها فإنه يعاقب بقدر ذنبه ، ثم ينجو وقالت المرجئة : لا يدخل . وقالت الوعيدية : يخلد وقد مضى بيان هذا في غير موضع وقرأ عاصم الجحدري ومعاوية بن قرة ثم ننجي مخففة من أنجى وهي قراءة حميد ويعقوب والكسائي وثقل الباقون وقرأ ابن أبي ليلى ( ثمه ) بفتح الثاء أي هناك وثم ظرف إلا أنه مبني لأنه غير محصل فبني كما بني ذا ؛ والهاء يجوز أن تكون لبيان الحركة فتحذف في الوصل ، ويجوز أن تكون لتأنيث البقعة فتثبت في الوصل تاء .\n                                    ",
        "saadi": "ثُمَّ نُنَجِّي ٱلَّذِينَ ٱتَّقَواْ وَّنَذَرُ ٱلظَّٰلِمِينَ فِيهَا جِثِيّٗا ٢٧\n                                        \n                                        \n                                        \n                                        { ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا } الله تعالى بفعل المأمور، واجتناب المحظور { وَنَذَرُ الظَّالِمِينَ } أنفسهم بالكفر والمعاصي { فِيهَا جِثِيًّا } وهذا بسبب ظلمهم وكفرهم، وجب لهم الخلود، وحق عليهم العذاب، وتقطعت بهم الأسباب.\n                                    "
      },
      "originalText": "ثُمَّ نُنَجِّي ٱلَّذِينَ ٱتَّقَواْ وَّنَذَرُ ٱلظَّٰلِمِينَ فِيهَا جِثِيّٗا ٢٧"
    },
    {
      "number": 2323,
      "text": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَقَامًا وَأَحْسَنُ نَدِيًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 73,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَيُّ ٱلۡفَرِيقَيۡنِ خَيۡرٞ مَّقَامٗا وَأَحۡسَنُ نَدِيّٗا ٣٧\n                                    \n                                    \n                                    يخبر تعالى عن الكفار حين تتلى عليهم آيات الله ظاهرة الدلالة بينة الحجة واضحة البرهان : أنهم يصدون عن ذلك ، ويعرضون ويقولون عن الذين آمنوا مفتخرين عليهم ومحتجين على صحة ما هم عليه من الدين الباطل بأنهم : ( خير مقاما وأحسن نديا ) أي : أحسن منازل وأرفع دورا وأحسن نديا ، وهو مجمع الرجال للحديث ، أي : ناديهم أعمر وأكثر واردا وطارقا ، يعنون : فكيف نكون ونحن بهذه المثابة على باطل ، وأولئك الذين هم مختفون مستترون في دار الأرقم بن أبي الأرقم ونحوها من الدور على الحق ؟ كما قال تعالى مخبرا عنهم : ( وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه ) [ الأحقاف : 11 ] . وقال قوم نوح : ( أنؤمن لك واتبعك الأرذلون ) [ الشعراء : 111 ] ، وقال تعالى : ( وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا أليس الله بأعلم بالشاكرين ) [ الأنعام : 53 ]\n                                    ",
        "qortoby": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَيُّ ٱلۡفَرِيقَيۡنِ خَيۡرٞ مَّقَامٗا وَأَحۡسَنُ نَدِيّٗا ٣٧\n                                    \n                                    \n                                    قوله تعالى : وإذا تتلى عليهم آياتنا بينات أي على الكفار الذين سبق ذكرهم في قوله تعالى : أئذا ما مت لسوف أخرج حيا وقال فيهم : ونذر الظالمين فيها جثيا أي هؤلاء إذا قرئ عليهم القرآن تعززوا بالدنيا ، وقالوا : فما بالنا - إن كنا على باطل - أكثر أموالا وأعز نفرا . وغرضهم إدخال الشبهة على المستضعفين ، وإيهامهم أن من كثر ماله دل ذلك على أنه المحق في دينه ، وكأنهم لم يروا في الكفار فقيرا ولا في المسلمين غنيا ، ولم يعلموا أن الله تعالى نحى أولياءه عن الاغترار بالدنيا وفرط الميل إليها . وبينات معناه مرتلات الألفاظ ملخصة المعاني ، مبينات المقاصد ؛ إما محكمات ، أو متشابهات قد تبعها البيان بالمحكمات ، أو تبيين الرسول - صلى الله عليه وسلم - قولا أو فعلا أو ظاهرات الإعجاز تحدي بها فلم يقدر على معارضتها . أو حججا وبراهين . والوجه أن تكون حالا مؤكدة كقوله تعالى : وهو الحق مصدقا لأن آيات الله تعالى لا تكون إلا واضحة وحججا .\nقال الذين كفروا يريد مشركي قريش النضر بن الحارث وأصحابه . للذين آمنوا يعني فقراء أصحاب النبي - صلى الله عليه وسلم - وكانت فيهم قشافة ، وفي عيشهم خشونة وفي ثيابهم رثاثة وكان المشركون ، يرجلون شعورهم ويدهنون رءوسهم ، ويلبسون خير ثيابهم ، فقالوا للمؤمنين : أي الفريقين خير مقاما وأحسن نديا . قرأ ابن كثير وابن محيصن وحميد وشبل بن عباد مقاما بضم الميم وهو موضع الإقامة . ويجوز أن يكون مصدرا بمعنى الإقامة . الباقون مقاما بالفتح ؛ أي منزلا ومسكنا . وقيل : المقام الموضع الذي يقام فيه بالأمور الجليلة ؛ أي أي الفريقين أكثر جاها وأنصارا . وأحسن نديا أي مجلسا ؛ عن ابن عباس وعنه أيضا المنظر وهو المجلس في اللغة وهو النادي ومنه دار الندوة لأن المشركين كانوا يتشاورون فيها في أمورهم وناداه جالسه في النادي قال :\nأنادي به آل الوليد وجعفرا\nوالندي على فعيل : مجلس القوم ومتحدثهم ، وكذلك الندوة والنادي والمتندى ، فإن تفرق القوم فليس بندي قاله الجوهري .\n                                    ",
        "saadi": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَيُّ ٱلۡفَرِيقَيۡنِ خَيۡرٞ مَّقَامٗا وَأَحۡسَنُ نَدِيّٗا ٣٧\n                                        \n                                        \n                                        \n                                        أي: وإذا تتلى على هؤلاء الكفار آياتنا بينات، أي: واضحات الدلالة على وحدانية الله وصدق رسله، توجب لمن سمعها صدق الإيمان وشدة الإيقان، قابلوها بضد ما يجب لها، واستهزءوا بها وبمن آمن بها، واستدلوا بحسن حالهم في الدنيا، على أنهم خير من المؤمنين، فقالوا معارضين للحق: { أَيُّ الْفَرِيقَيْنِ } أي: نحن والمؤمنون { خَيْرٌ مَقَامًا } أي: في الدنيا، من كثرة الأموال والأولاد، وتوفر الشهوات { وَأَحْسَنُ نَدِيًّا } أي مجلسا. أي: فاستنتجوا من هذه المقدمة الفاسدة، أنهم أكثر مالا وأولادا، وقد حصلت لهم أكثر مطالبهم من الدنيا، ومجالسهم وأنديتهم مزخرفة مزوقة.والمؤمنون بخلاف هذه الحال، فهم خير من المؤمنين، وهذا دليل في غاية الفساد، وهو من باب قلب الحقائق، وإلا فكثرة الأموال والأولاد، وحسن المنظر، كثيرا ما يكون سببا لهلاك صاحبه، وشقائه، وشره\n                                    "
      },
      "originalText": "وَإِذَا تُتۡلَىٰ عَلَيۡهِمۡ ءَايَٰتُنَا بَيِّنَٰتٖ قَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُوٓاْ أَيُّ ٱلۡفَرِيقَيۡنِ خَيۡرٞ مَّقَامٗا وَأَحۡسَنُ نَدِيّٗا ٣٧"
    },
    {
      "number": 2324,
      "text": "وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هُمْ أَحْسَنُ أَثَاثًا وَرِئْيًا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 74,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هُمۡ أَحۡسَنُ أَثَٰثٗا وَرِءۡيٗا ٤٧\n                                    \n                                    \n                                    ولهذا قال تعالى رادا عليهم شبهتهم : ( وكم أهلكنا قبلهم من قرن ) أي : وكم من أمة وقرن من المكذبين قد أهلكناهم بكفرهم ، ( هم أحسن أثاثا ورئيا ) أي : كانوا أحسن من هؤلاء أموالا وأمتعة ومناظر وأشكالا .\nوقال الأعمش ، عن أبي ظبيان ، عن ابن عباس : ( خير مقاما وأحسن نديا ) قال : المقام المنزل ، والندي المجلس ، والأثاث المتاع ، والرئي المنظر .\nوقال العوفي ، عن ابن عباس : المقام المسكن ، والندي المجلس والنعمة والبهجة التي كانوا فيها ، وهو كما قال الله لقوم فرعون حين أهلكهم وقص شأنهم في القرآن : ( كم تركوا من جنات وعيون وزروع ومقام كريم ) [ الدخان : 25 ، 26 ] ، فالمقام المسكن والنعيم ، والندي المجلس والمجمع الذي كانوا يجتمعون فيه ، وقال الله فيما قص على رسوله من أمر قوم لوط : ( وتأتون في ناديكم المنكر ) [ العنكبوت : 29 ] ، والعرب تسمي المجلس : النادي .\nوقال قتادة : لما رأوا أصحاب محمد صلى الله عليه وسلم في عيشهم خشونة ، وفيهم قشافة ، تعرض أهل الشرك بما تسمعون : ( أي الفريقين خير مقاما وأحسن نديا ) وكذا قال مجاهد ، والضحاك .\nومنهم من قال في الأثاث : هو المال . ومنهم من قال : المتاع . ومنهم من قال : الثياب ، والرئي : المنظر كما قال ابن عباس ، ومجاهد وغير واحد .\nوقال الحسن البصري : يعني الصور ، وكذا قال مالك : ( أثاثا ورئيا ) : أكثر أموالا وأحسن صورا . والكل متقارب صحيح .\n                                    ",
        "qortoby": "وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هُمۡ أَحۡسَنُ أَثَٰثٗا وَرِءۡيٗا ٤٧\n                                    \n                                    \n                                    قوله تعالى : وكم أهلكنا قبلهم من قرن أي من أمة وجماعة . هم أحسن أثاثا ورئيا أي متاعا كثيرا ؛ قال : [ امرؤ القيس ] :\nوفرع يزين المتن أسود فاحم أثيث كقنو النخلة المتعثكل\nوالأثاث متاع البيت . وقيل : هو ما جد من الفرش ، والخرثي ما لبس منها ، وأنشد الحسن بن علي الطوسي فقال :\nتقادم العهد من أم الوليد بنا دهرا وصار أثاث البيت خرثيا\nوقال ابن عباس : هيئة . مقاتل : ثيابا ورئيا أي منظرا حسنا . وفيه خمس قراءات : قرأ أهل المدينة ( وريا ) بغير همز . وقرأ أهل الكوفة ( ورئيا ) بالهمز . وحكى يعقوب أن طلحة قرأ ( وريا ) بياء واحدة مخففة . وروى سفيان عن الأعمش عن أبي ظبيان عن ابن عباس ( هم أحسن أثاثا وزيا ) بالزاي ؛ فهذه أربع قراءات قال أبو إسحاق ويجوز ( هم أحسن أثاثا وريئا ) بياء بعدها همزة . النحاس : وقراءة أهل المدينة في هذا حسنة وفيها تقريران : أحدهما : أن تكون من رأيت ثم خففت الهمزة فأبدل منها ياء وأدغمت الياء في الياء . وكان هذا حسنا لتتفق رءوس الآيات لأنها غير مهموزات . وعلى هذا قال ابن عباس : ( الرئي المنظر ) فالمعنى : هم أحسن أثاثا ولباسا . والوجه الثاني : أن جلودهم مرتوية من النعمة ؛ فلا يجوز الهمز على هذا . وفي رواية ورش عن نافع وابن ذكوان عن ابن عامر ( ورئيا ) بالهمز تكون على الوجه الأول . وهي قراءة أهل الكوفة وأبي عمرو من رأيت على الأصل . وقراءة طلحة بن مصرف ( وريا ) بياء واحدة مخففة أحسبها غلطا . وقد زعم بعض النحويين أنه كان أصلها الهمز فقلبت الهمزة ياء ، ثم حذفت إحدى اليائين . المهدوي : ويجوز أن يكون ( ريئا ) فقلبت ياء فصارت رييا ثم نقلت حركة الهمزة على الياء وحذفت . وقد قرأ بعضهم ( وريا ) على القلب وهي القراءة الخامسة . وحكى سيبويه راء بمعنى رأى . الجوهري : من همزه جعله من المنظر من رأيت ، وهو ما رأته العين من حال حسنة وكسوة ظاهرة وأنشد أبو عبيدة لمحمد بن نمير الثقفي فقال :\nأشاقتك الظعائن يوم بانوا بذي الرئي الجميل من الأثاث\nومن لم يهمز إما أن يكون على تخفيف الهمزة أو يكون من رويت ألوانهم وجلودهم ريا ؛ أي امتلأت وحسنت . وأما قراءة ابن عباس وأبي بن كعب وسعيد بن جبير والأعسم المكي ويزيد البربري ( وزيا ) بالزاي فهو الهيئة والحسن . ويجوز أن يكون من زويت أي جمعت ؛ فيكون أصلها زويا فقلبت الواو ياء . ومنه قول النبي - صلى الله عليه وسلم - زويت لي الأرض أي جمعت ؛ أي فلم يغن ذلك عنهم شيئا من عذاب الله تعالى ؛ فليعش هؤلاء ما شاءوا فمصيرهم إلى الموت والعذاب وإن عمروا ؛ أو العذاب العاجل يأخذهم الله تعالى به .\n                                    ",
        "saadi": "وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هُمۡ أَحۡسَنُ أَثَٰثٗا وَرِءۡيٗا ٤٧\n                                        \n                                        \n                                        \n                                        { وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ هُمْ أَحْسَنُ أَثَاثًا } أي: متاعا، من أوان وفرش، وبيوت، وزخارف، وأحسن رئيا، أي: أحسن مرأى ومنظرا، من غضارة العيش، وسرور اللذات، وحسن الصور، فإذا كان هؤلاء المهلكون أحسن منهم أثاثا ورئيا، ولم يمنعهم ذلك من حلول العقاب بهم، فكيف يكون هؤلاء، وهم أقل منهم وأذل، معتصمين من العذاب { أَكُفَّارُكُمْ خَيْرٌ مِنْ أُولَئِكُمْ أَمْ لَكُمْ بَرَاءَةٌ فِي الزُّبُرِ } ؟ وعلم من هذا، أن الاستدلال على خير الآخرة بخير الدنيا من أفسد الأدلة، وأنه من طرق الكفار.\n                                    "
      },
      "originalText": "وَكَمۡ أَهۡلَكۡنَا قَبۡلَهُم مِّن قَرۡنٍ هُمۡ أَحۡسَنُ أَثَٰثٗا وَرِءۡيٗا ٤٧"
    },
    {
      "number": 2325,
      "text": "قُلْ مَنْ كَانَ فِي الضَّلَالَةِ فَلْيَمْدُدْ لَهُ الرَّحْمَٰنُ مَدًّا ۚ حَتَّىٰ إِذَا رَأَوْا مَا يُوعَدُونَ إِمَّا الْعَذَابَ وَإِمَّا السَّاعَةَ فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَكَانًا وَأَضْعَفُ جُنْدًا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 75,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ مَن كَانَ فِي ٱلضَّلَٰلَةِ فَلۡيَمۡدُدۡ لَهُ ٱلرَّحۡمَٰنُ مَدًّاۚ حَتَّىٰٓ إِذَا رَأَوۡاْ مَا يُوعَدُونَ إِمَّا ٱلۡعَذَابَ وَإِمَّا ٱلسَّاعَةَ فَسَيَعۡلَمُونَ مَنۡ هُوَ شَرّٞ مَّكَانٗا وَأَضۡعَفُ جُندٗا ٥٧\n                                    \n                                    \n                                    يقول تعالى : ( قل ) يا محمد ، لهؤلاء المشركين بربهم المدعين ، أنهم على الحق وأنكم على الباطل : ( من كان في الضلالة ) أي : منا ومنكم ، ( فليمدد له الرحمن مدا ) أي : فأمهله الرحمن فيما هو فيه ، حتى يلقى ربه وينقضي أجله ، ( إما العذاب ) يصيبه ، ( وإما الساعة ) بغتة تأتيه ، ( فسيعلمون ) حينئذ ( من هو شر مكانا وأضعف جندا ) أي : في مقابلة ما احتجوا به من خيرية المقام وحسن الندي .\nقال مجاهد في قوله : ( فليمدد له الرحمن مدا ) فليدعه الله في طغيانه . هكذا قرر ذلك أبو جعفر بن جرير ، رحمه الله .\nوهذه مباهلة للمشركين الذين يزعمون أنهم على هدى فيما هم فيه ، كما ذكر تعالى مباهلة اليهود في قوله : ( قل يا أيها الذين هادوا إن زعمتم أنكم أولياء لله من دون الناس فتمنوا الموت إن كنتم صادقين ) [ الجمعة : 6 ] أي : ادعوا على المبطل منا ومنكم بالموت إن كنتم تدعون أنكم على الحق ، فإنه لا يضركم الدعاء ، فنكلوا عن ذلك ، وقد تقدم تقرير ذلك في سورة \" البقرة \" مبسوطا ، ولله الحمد . وكما ذكر تعالى المباهلة مع النصارى في سورة \" آل عمران \" حين صمموا على الكفر ، واستمروا على الطغيان والغلو في دعواهم أن عيسى ولد الله ، وقد ذكر الله حججه وبراهينه على عبودية عيسى ، وأنه مخلوق كآدم ، قال بعد ذلك : ( فمن حاجك فيه من بعد ما جاءك من العلم فقل تعالوا ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم ثم نبتهل فنجعل لعنة الله على الكاذبين ) [ آل عمران : 61 ] فنكلوا أيضا عن ذلك .\n                                    ",
        "qortoby": "قُلۡ مَن كَانَ فِي ٱلضَّلَٰلَةِ فَلۡيَمۡدُدۡ لَهُ ٱلرَّحۡمَٰنُ مَدًّاۚ حَتَّىٰٓ إِذَا رَأَوۡاْ مَا يُوعَدُونَ إِمَّا ٱلۡعَذَابَ وَإِمَّا ٱلسَّاعَةَ فَسَيَعۡلَمُونَ مَنۡ هُوَ شَرّٞ مَّكَانٗا وَأَضۡعَفُ جُندٗا ٥٧\n                                    \n                                    \n                                    قوله تعالى : قل من كان في الضلالة أي في الكفر فليمدد له الرحمن مدا أي فليدعه في طغيان جهله وكفره ؛ فلفظه لفظ الأمر ومعناه الخبر أي من كان في الضلالة مده الرحمن مدا حتى يطول اغتراره ، فيكون ذلك أشد لعقابه ، نظيره إنما نملي لهم ليزدادوا إثما وقوله : ونذرهم في طغيانهم يعمهون ومثله كثير ؛ أي فليعش ما شاء ، وليوسع لنفسه في العمر ؛ فمصيره إلى الموت والعقاب . وهذا غاية في التهديد والوعيد . وقيل : هذا دعاء أمر به النبي - صلى الله عليه وسلم - ؛ تقول : من سرق مالي فليقطع الله تعالى يده ؛ فهو دعاء على السارق . وهو جواب الشرط وعلى هذا فليس قوله فليمدد خبرا .\nقوله تعالى : حتى إذا رأوا ما يوعدون قال رأوا لأن لفظ ما يصلح للواحد والجمع . وإذا مع الماضي بمعنى المستقبل ؛ أي حتى يروا ما يوعدون ، والعذاب هنا إما أن يكون بنصر المؤمنين عليهم فيعذبونهم بالسيف والأسر ؛ وإما أن تقوم الساعة فيصيرون إلى النار . فسيعلمون من هو شر مكانا وأضعف جندا أي تنكشف حينئذ الحقائق وهذا رد لقولهم : أي الفريقين خير مقاما وأحسن نديا .\n                                    ",
        "saadi": "قُلۡ مَن كَانَ فِي ٱلضَّلَٰلَةِ فَلۡيَمۡدُدۡ لَهُ ٱلرَّحۡمَٰنُ مَدًّاۚ حَتَّىٰٓ إِذَا رَأَوۡاْ مَا يُوعَدُونَ إِمَّا ٱلۡعَذَابَ وَإِمَّا ٱلسَّاعَةَ فَسَيَعۡلَمُونَ مَنۡ هُوَ شَرّٞ مَّكَانٗا وَأَضۡعَفُ جُندٗا ٥٧\n                                        \n                                        \n                                        \n                                        لما ذكر دليلهم الباطل، الدال على شدة عنادهم، وقوة ضلالهم، أخبر هنا، أن من كان في الضلالة، بأن رضيها لنفسه، وسعى فيها، فإن الله يمده منها، ويزيده فيها حبا، عقوبة له على اختيارها على الهدى، قال تعالى: { فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ } { وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ }\n{ حَتَّى إِذَا رَأَوْا } أي: القائلون: { أَيُّ الْفَرِيقَيْنِ خَيْرٌ مَقَامًا وَأَحْسَنُ نَدِيًّا } { مَا يُوعَدُونَ إِمَّا الْعَذَابَ } بقتل أو غيره { وَإِمَّا السَّاعَةَ } التي هي باب الجزاء على الأعمال { فَسَيَعْلَمُونَ مَنْ هُوَ شَرٌّ مَكَانًا وَأَضْعَفُ جُنْدًا } أي: فحينئذ يتبين لهم بطلان دعواهم، وأنها دعوى مضمحلة، ويتيقنون أنهم أهل الشر، { وَأَضْعَفُ جُنْدًا } ولكن لا يفيدهم هذا العلم شيئا، لأنه لا يمكنهم الرجوع إلى الدنيا، فيعملون غير عملهم الأول.\n                                    "
      },
      "originalText": "قُلۡ مَن كَانَ فِي ٱلضَّلَٰلَةِ فَلۡيَمۡدُدۡ لَهُ ٱلرَّحۡمَٰنُ مَدًّاۚ حَتَّىٰٓ إِذَا رَأَوۡاْ مَا يُوعَدُونَ إِمَّا ٱلۡعَذَابَ وَإِمَّا ٱلسَّاعَةَ فَسَيَعۡلَمُونَ مَنۡ هُوَ شَرّٞ مَّكَانٗا وَأَضۡعَفُ جُندٗا ٥٧"
    },
    {
      "number": 2326,
      "text": "وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى ۗ وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ مَرَدًّا",
      "surah": {
        "number": 19,
        "name": "سورة مريم",
        "englishName": "Maryam",
        "englishNameTranslation": "Mary",
        "revelationType": "Meccan",
        "numberOfAyahs": 98
      },
      "numberInSurah": 76,
      "juz": 16,
      "manzil": 4,
      "page": 310,
      "ruku": 268,
      "hizbQuarter": 124,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَزِيدُ ٱللَّهُ ٱلَّذِينَ ٱهۡتَدَوۡاْ هُدٗىۗ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٞ مَّرَدًّا ٦٧\n                                    \n                                    \n                                    لما ذكر الله تعالى إمداد من هو في الضلالة فيما هو فيه وزيادته على ما هو عليه ، أخبر بزيادة المهتدين هدى كما قال تعالى : ( وإذا ما أنزلت سورة فمنهم من يقول أيكم زادته هذه إيمانا فأما الذين آمنوا فزادتهم إيمانا وهم يستبشرون وأما الذين في قلوبهم مرض فزادتهم رجسا إلى رجسهم وماتوا وهم كافرون ) [ التوبة : 124 ، 125 ] .\nوقوله : ( والباقيات الصالحات ) قد تقدم تفسيرها ، والكلام عليها ، وإيراد الأحاديث المتعلقة بها في سورة \" الكهف \" .\n( خير عند ربك ثوابا ) أي : جزاء ( وخير مردا ) أي : عاقبة ومردا على صاحبها .\nوقال عبد الرزاق : أخبرنا عمر بن راشد ، عن يحيى بن أبي كثير ، عن أبي سلمة بن عبد الرحمن قال : جلس رسول الله صلى الله عليه وسلم ذات يوم ، فأخذ عودا يابسا فحط ورقه ثم قال : \" إن قول : لا إله إلا الله ، والله أكبر ، والحمد لله ، وسبحان الله ، تحط الخطايا كما تحط ورق هذه الشجرة الريح ، خذهن يا أبا الدرداء قبل أن يحال بينك وبينهن ، هن الباقيات الصالحات ، وهن من كنوز الجنة \" قال أبو سلمة : فكان أبو الدرداء إذا ذكر هذا الحديث قال : لأهللن الله ، ولأكبرن الله ، ولأسبحن الله ، حتى إذا رآني الجاهل حسب أني مجنون\nوهذا ظاهره أنه مرسل ، ولكن قد يكون من رواية أبي سلمة ، عن أبي الدرداء ، والله أعلم . وهكذا وقع في سنن ابن ماجه ، من حديث أبي معاوية ، عن عمر بن راشد ، عن يحيى ، عن أبي سلمة ، عن أبي الدرداء ، فذكر نحوه\n                                    ",
        "qortoby": "وَيَزِيدُ ٱللَّهُ ٱلَّذِينَ ٱهۡتَدَوۡاْ هُدٗىۗ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٞ مَّرَدًّا ٦٧\n                                    \n                                    \n                                    قوله : ويزيد الله الذين اهتدوا هدى والباقيات الصالحات خير عند ربك ثوابا وخير مردا\nقوله تعالى : ويزيد الله الذين اهتدوا هدى أي ويثبت الله المؤمنين على الهدى ويزيدهم في النصرة ، وينزل من الآيات ما يكون سبب زيادة اليقين مجازاة لهم . وقيل : يزيدهم هدى بتصديقهم بالناسخ والمنسوخ الذي كفر به غيرهم ، قال معناه الكلبي ومقاتل ويحتمل ثالثا أي ( ويزيد الله الذين اهتدوا ) إلى الطاعة ( هدى ) إلى الجنة والمعنى متقارب وقد تقدم القول في معنى زيادة الأعمال وزيادة الإيمان والهدى في ( آل عمران ) وغيرها . والباقيات الصالحات تقدم في ( الكهف ) القول فيها . خير عند ربك ثوابا أي جزاء وخير مردا أي في الآخرة مما افتخر به الكفار في الدنيا . و ( المرد ) مصدر كالرد ؛ أي وخير ردا على عاملها بالثواب ؛ يقال هذا أرد عليك أي أنفع لك . وقيل خير مردا أي مرجعا فكل أحد يرد إلى عمله الذي عمله .\n                                    ",
        "saadi": "وَيَزِيدُ ٱللَّهُ ٱلَّذِينَ ٱهۡتَدَوۡاْ هُدٗىۗ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٞ مَّرَدًّا ٦٧\n                                        \n                                        \n                                        \n                                        لما ذكر أنه يمد للظالمين في ضلالهم، ذكر أنه يزيد المهتدين هداية من فضله عليهم ورحمته، والهدى يشمل العلم النافع، والعمل الصالح. فكل من سلك طريقا في العلم والإيمان والعمل الصالح زاده الله منه، وسهله عليه ويسره له، ووهب له أمورا أخر، لا تدخل تحت كسبه، وفي هذا دليل على زيادة الإيمان ونقصه، كما قاله السلف الصالح، ويدل عليه قوله تعالى { وَيَزْدَادَ الَّذِينَ آمَنُوا إِيمَانًا } { وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا }\nويدل عليه أيضا الواقع، فإن الإيمان قول القلب واللسان، وعمل القلب واللسان والجوارح، والمؤمنون متفاوتون في هذه الأمور، أعظم تفاوت، ثم قال: { وَالْبَاقِيَاتُ الصَّالِحَاتُ } أي: الأعمال الباقية، التي لا تنقطع إذا انقطع غيرها، ولا تضمحل، هي الصالحات منها، من صلاة، وزكاة، وصوم، وحج، وعمرة، وقراءة، وتسبيح، وتكبير، وتحميد، وتهليل، وإحسان إلى المخلوقين، وأعمال قلبية وبدنية. فهذه الأعمال { خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْر مَرَدًّا } أي: خير عند الله، ثوابها وأجرها، وكثير للعاملين نفعها وردها، وهذا من باب استعمال أفعل التفضيل في غير بابه، فإنه ما ثم غير الباقيات الصالحات، عمل ينفع، ولا يبقى لصاحبه ثوابه ولا ينجع، ومناسبة ذكر الباقيات الصالحات-والله أعلم- أنه لما ذكر أن الظالمين جعلوا أحوال الدنيا من المال والولد، وحسن المقام ونحو ذلك، علامة لحسن حال صاحبها، أخبر هنا أن الأمر، ليس كما زعموا، بل العمل الذي هو عنوان السعادة ومنشور الفلاح، هو العمل بما يحبه الله ويرضاه.\n                                    "
      },
      "originalText": "وَيَزِيدُ ٱللَّهُ ٱلَّذِينَ ٱهۡتَدَوۡاْ هُدٗىۗ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٞ مَّرَدًّا ٦٧"
    }
  ]
}