{
  "number": 315,
  "ayahsNumber": 13,
  "ayahs": [
    {
      "number": 2400,
      "text": "قَالَ عِلْمُهَا عِنْدَ رَبِّي فِي كِتَابٍ ۖ لَا يَضِلُّ رَبِّي وَلَا يَنْسَى",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 52,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 271,
      "hizbQuarter": 125,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ عِلۡمُهَا عِندَ رَبِّي فِي كِتَٰبٖۖ لَّا يَضِلُّ رَبِّي وَلَا يَنسَى ٢٥\n                                    \n                                    \n                                    فقال له موسى في جواب ذلك : هم وإن لم يعبدوه فإن عملهم عند الله مضبوط عليهم ، وسيجزيهم بعملهم في كتاب الله ، وهو اللوح المحفوظ وكتاب الأعمال ، ( لا يضل ربي ولا ينسى ) أي : لا يشذ عنه شيء ، ولا يفوته صغير ولا كبير ، ولا ينسى شيئا . يصف علمه تعالى بأنه بكل شيء محيط ، وأنه لا ينسى شيئا ، تبارك وتعالى وتقدس ، فإن علم المخلوق يعتريه نقصانان : أحدهما : عدم الإحاطة بالشيء ، والآخر : نسيانه بعد علمه ، فنزه نفسه عن ذلك .\n                                    ",
        "qortoby": "قَالَ عِلۡمُهَا عِندَ رَبِّي فِي كِتَٰبٖۖ لَّا يَضِلُّ رَبِّي وَلَا يَنسَى ٢٥\n                                    \n                                    \n                                    هذه الآية ونظائرها مما تقدم ويأتي تدل على تدوين العلوم وكتبها لئلا تنسى . فإن الحفظ قد تعتريه الآفات من الغلط والنسيان . وقد لا يحفظ الإنسان ما يسمع فيقيده لئلا يذهب عنه . وروينا بالإسناد المتصل عن قتادة أنه قيل له : أنكتب ما نسمع منك ؟ قال : وما يمنعك أن تكتب وقد أخبرك اللطيف الخبير أنه يكتب ؛ فقال : علمها عند ربي في كتاب لا يضل ربي ولا ينسى . وفي صحيح مسلم عن أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : لما قضى الله الخلق كتب في كتابه على نفسه فهو موضوع عنده : إن رحمتي تغلب غضبي . وأسند الخطيب أبو بكر عن أبي هريرة قال : ( كان رجل من الأنصار يجلس إلى النبي - صلى الله عليه وسلم - يستمع منه الحديث ويعجبه ولا يحفظه ، فشكا ذلك إلى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله إني أسمع منك الحديث يعجبني ولا أحفظه ؛ فقال له رسول الله - صلى الله عليه وسلم - استعن بيمينك وأومأ إلى الخط وهذا نص . وعلى جواز كتب العلم وتدوينه جمهور الصحابة والتابعين ؛ وقد أمر - صلى الله عليه وسلم - بكتب الخطبة التي خطب بها في الحج لأبي شاه - رجل من اليمن - لما سأله كتبها . أخرجه مسلم . وروى عمرو بن شعيب عن أبيه عن جده عن النبي - صلى الله عليه وسلم - قال : قيدوا العلم بالكتابة . وقال معاوية بن قرة : من لم يكتب العلم لم يعد علمه علما . وقد ذهب قوم إلى المنع من الكتب ؛ فروى أبو نصرة قال : قيل لأبي سعيد : أنكتب حديثكم هذا ؟ قال : لم تجعلونه قرآنا ؟ ولكن احفظوا كما حفظنا . وممن كان لا يكتب الشعبي ويونس بن عبيد وخالد الحذاء - قال خالد ما كتبت شيئا قط إلا حديثا واحدا ، فلما حفظته محوته - وابن عون والزهري . وقد كان بعضهم يكتب فإذا حفظ محاه ؛ منهم محمد بن سيرين وعاصم بن ضمرة . وقال هشام بن حسان : ما كتبت حديثا قط إلا حديث الأعماق فلما حفظته محوته .\nقلت : وقد ذكرنا عن خالد الحذاء مثل هذا . وحديث الأعماق خرجه مسلم في آخر الكتاب : لا تقوم الساعة حتى ينزل الروم بالأعماق - أو - بدابق الحديث ذكره في كتاب الفتن . وكان بعضهم يحفظ ثم يكتب ما يحفظ ، منهم الأعمش وعبد الله بن إدريس وهشيم وغيرهم . وهذا احتياط على الحفظ . والكتب أولى على الجملة ، وبه وردت الآي والأحاديث ؛ وهو مروي عن عمر وعلي وجابر وأنس - رضي الله عنهم ، ومن يليهم من كبراء التابعين كالحسن وعطاء وطاوس وعروة بن الزبير ، ومن بعدهم من أهل العلم ؛ قال الله تعالى : وكتبنا له في الألواح من كل شيء . وقال تعالى : ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون . وقال تعالى : واكتب لنا في هذه الدنيا حسنة الآية . وقال تعالى : وكل شيء فعلوه في الزبر وكل صغير وكبير مستطر . قال علمها عند ربي في كتاب إلى غير هذا من الآي .\nوأيضا فإن العلم لا يضبط إلا بالكتاب ، ثم بالمقابلة والمدارسة والتعهد والتحفظ والمذاكرة والسؤال والفحص عن الناقلين والثقة بما نقلوا ، وإنما كره الكتب من كره من الصدر الأول لقرب العهد ، وتقارب الإسناد لئلا يعتمده الكاتب فيهمله ، أو يرغب عن حفظه والعمل به ؛ فأما والوقت متباعد ، والإسناد غير متقارب ، والطرق مختلفة ، والنقلة متشابهون ، وآفة النسيان معترضة ، والوهم غير مأمون ؛ فإن تقييد العلم بالكتاب أولى وأشفى ، والدليل على وجوبه أقوى ؛ فإن احتج محتج بحديث أبي سعيد عن النبي - صلى الله عليه وسلم - أنه قال : لا تكتبوا عني ومن كتب غير القرآن فليمحه خرجه مسلم ؛ فالجواب أن ذلك كان متقدما ؛ فهو منسوخ بأمره بالكتاب ، وإباحتها لأبي شاه وغيره . وأيضا كان ذلك لئلا يخلط بالقرآن ما ليس منه . وكذا ما روي عن أبي سعيد أيضا - حرصنا أن يأذن لنا النبي - صلى الله عليه وسلم - في الكتابة فأبى - إن كان محفوظا فهو قبل الهجرة ، وحين كان لا يؤمن الاشتغال به عن القرآن .\nقال أبو بكر الخطيب : ينبغي أن يكتب الحديث بالسواد ؛ ثم الحبر خاصة دون المداد لأن السواد أصبغ الألوان ، والحبر أبقاها على مر الدهور . وهو آلة ذوي العلم ، وعدة أهل المعرفة . ذكر عبد الله بن أحمد بن حنبل حدثني أبي قال : رآني الشافعي وأنا في مجلسه وعلى قميصي حبر وأنا أخفيه ؛ فقال لم تخفيه وتستره ؟ إن الحبر على الثوب من المروءة لأن صورته في الأبصار سواد ، وفي البصائر بياض . وقال خالد بن زيد : الحبر في ثوب صاحب الحديث مثل الخلوق في ثوب العروس . وأخذ هذا المعنى أبو عبد الله البلوي فقال :\nمداد المحابر طيب الرجال وطيب النساء من الزعفران\nفهذا يليق بأثواب ذا\nوهذا يليق بثوب الحصان\nوذكر الماوردي أن عبد الله بن سليمان فيما حكي ؛ رأى على بعض ثيابه أثر صفرة ؛ فأخذ من مداد الدواة وطلاه به ، ثم قال : المداد بنا أحسن من الزعفران ؛ وأنشد :\nإنما الزعفران عطر العذارى ومداد الدوي عطر الرجال\nقوله تعالى : لا يضل ربي ولا ينسى اختلف في معناه على أقوال خمسة : الأول : إنه ابتداء كلام ، تنزيه لله تعالى عن هاتين الصفتين ، وقد كان الكلام تم في قوله : في كتاب . وكذا قال الزجاج ، وأن معنى لا يضل لا يهلك من قوله : أئذا ضللنا في الأرض . ولا ينسى شيئا ؛ نزهه عن الهلاك والنسيان . القول الثاني : لا يضل لا يخطئ ؛ قاله ابن عباس ؛ أي لا يخطئ في التدبير ، فمن أنظره فلحكمة أنظره ، ومن عاجله فلحكمة عاجله . القول الثالث : لا يضل لا يغيب . قال ابن الأعرابي : أصل الضلال الغيبوبة ؛ يقال : ضل الناسي إذا غاب عنه حفظ الشيء . قال : ومعنى لا يضل ربي ولا ينسى أي لا يغيب عنه شيء ولا يغيب عن شيء . القول الرابع : قاله الزجاج أيضا وقال النحاس أشبهها بالمعنى : - أخبر الله - عز وجل - أنه لا يحتاج إلى كتاب ؛ والمعنى لا يضل عنه علم شيء من الأشياء ولا معرفتها ، ولا ينسى ما علمه منها .\nقلت : وهذا القول راجع إلى معنى قول ابن الأعرابي . وقول خامس : إن لا يضل ربي ولا ينسى في موضع الصفة ل ( كتاب ) أي الكتاب غير ضال عن الله - عز وجل - ؛ أي غير ذاهب عنه . ولا ينسى أي غير ناس له فهما نعتان ل \" كتاب \" . وعلى هذا يكون الكلام متصلا ، ولا يوقف على كتاب . تقول العرب . ضلني الشيء إذا لم أجده ، وأضللته أنا إذا تركته في موضع فلم أجده فيه . وقرأ الحسن وقتادة وعيسى بن عمر وابن محيصن وعاصم الجحدري وابن كثير فيما روى شبل عنه ( لا يضل ) بضم الياء على معنى لا يضيعه ربي ولا ينساه . قال ابن عرفة : الضلالة عند العرب سلوك سبيل غير القصد ؛ يقال : ضل عن الطريق ، وأضل الشيء إذا أضاعه . ومنه قرأ من قرأ لا يضل ربي أي لا يضيع ؛ هذا مذهب العرب .\n                                    ",
        "saadi": "قَالَ عِلۡمُهَا عِندَ رَبِّي فِي كِتَٰبٖۖ لَّا يَضِلُّ رَبِّي وَلَا يَنسَى ٢٥\n                                        \n                                        \n                                        \n                                        فقال موسى: { عِلْمُهَا عِنْدَ رَبِّي فِي كِتَابٍ لَا يَضِلُّ رَبِّي وَلَا يَنْسَى } أي: قد أحصى أعمالهم من خير وشر، وكتبه في كتاب، وهو اللوح المحفوظ، وأحاط به علما وخبرا، فلا يضل عن شيء منها، ولا ينسى ما علمه منها.\nومضمون ذلك، أنهم قدموا إلى ما قدموا، ولاقوا أعمالهم، وسيجازون عليها، فلا معنى لسؤالك واستفهامك يا فرعون عنهم، فتلك أمة قد خلت، لها ما كسبت،ولكم ما كسبتم، فإن كان الدليل الذي أوردناه عليك، والآيات التي أريناكها، قد تحققت صدقها ويقينها، وهو الواقع، فانقد إلى الحق، ودع عنك الكفر والظلم، وكثرة الجدال بالباطل، وإن كنت قد شككت فيها أو رأيتها غير مستقيمة، فالطريق مفتوح وباب البحث غير مغلق، فرد الدليل بالدليل، والبرهان بالبرهان، ولن تجد لذلك سبيلا، ما دام الملوان.\nكيف وقد أخبر الله عنه، أنه جحدها مع استيقانها، كما قال تعالى: { وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ ظُلْمًا وَعُلُوًّا } وقال موسى: { لَقَدْ عَلِمْتَ مَا أَنْزَلَ هَؤُلَاءِ إِلَّا رَبُّ السَّمَاوَاتِ وَالْأَرْضِ بَصَائِرَ } فعلم أنه ظالم في جداله، قصده العلو في الأرض.\n                                    "
      },
      "originalText": "قَالَ عِلۡمُهَا عِندَ رَبِّي فِي كِتَٰبٖۖ لَّا يَضِلُّ رَبِّي وَلَا يَنسَى ٢٥"
    },
    {
      "number": 2401,
      "text": "الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا وَسَلَكَ لَكُمْ فِيهَا سُبُلًا وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ أَزْوَاجًا مِنْ نَبَاتٍ شَتَّىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 53,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 271,
      "hizbQuarter": 125,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ مَهۡدٗا وَسَلَكَ لَكُمۡ فِيهَا سُبُلٗا وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّن نَّبَاتٖ شَتَّىٰ ٣٥\n                                    \n                                    \n                                    هذا من تمام كلام موسى فيما وصف به ربه - عز وجل - حين سأله فرعون عنه ، فقال : ( الذي أعطى كل شيء خلقه ثم هدى ) ، ثم اعترض الكلام بين ذلك ، ثم قال : ( الذي جعل لكم الأرض مهادا ) وفي قراءة بعضهم \" مهدا \" أي : قرارا تستقرون عليها وتقومون وتنامون عليها وتسافرون على ظهرها ، ( وسلك لكم فيها سبلا ) أي : جعل لكم طرقا تمشون في مناكبها ، كما قال تعالى : ( وجعلنا فيها فجاجا سبلا لعلهم يهتدون ) [ الأنبياء : 31 ] .\n( وأنزل من السماء ماء فأخرجنا به أزواجا من نبات شتى ) أي : من ألوان النباتات من زروع وثمار ، ومن حامض وحلو ، وسائر الأنواع .\n                                    ",
        "qortoby": "ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ مَهۡدٗا وَسَلَكَ لَكُمۡ فِيهَا سُبُلٗا وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّن نَّبَاتٖ شَتَّىٰ ٣٥\n                                    \n                                    \n                                    قوله تعالى : الذي جعل لكم الأرض مهدا الذي في موضع نعت لربي أي لا يضل ربي الذي جعل . ويجوز أن يكون خبر ابتداء مضمر أي هو الذي . ويجوز أن يكون منصوبا بإضمار أعني . وقرأ الكوفيون ( مهدا ) هنا وفي ( الزخرف ) بفتح الميم وإسكان الهاء . الباقون ( مهادا ) واختاره أبو عبيد وأبو حاتم لاتفاقهم على قراءة ( ألم نجعل الأرض مهادا ) . النحاس : والجمع أولى لأن مهدا مصدر وليس هذا موضع مصدر إلا على حذف ؛ أي ذات مهد . المهدوي : ومن قرأ مهدا جاز أن يكون مصدرا كالفرش أي مهد لكم الأرض مهدا ، وجاز أن يكون على تقدير حذف المضاف ؛ أي ذات مهد . ومن قرأ ( مهادا ) جاز أن يكون مفردا كالفراش . وجاز أن يكون جمع ( مهد ) استعمل استعمال الأسماء فكسر . ومعنى \" مهادا \" أي فراشا وقرارا تستقرون عليها .\nوسلك لكم فيها سبلا أي طرقا . نظيره والله جعل لكم الأرض بساطا لتسلكوا منها سبلا فجاجا . وقال تعالى : ( الذي جعل لكم الأرض مهادا وجعل لكم فيها سبلا لعلكم تهتدون ) . وأنزل من السماء ماء وهذا آخر كلام موسى ، ثم قال الله تعالى : فأخرجنا به وقيل : كله من كلام موسى . فأخرجنا به أي بالحرث والمعالجة ؛ لأن الماء المنزل سبب خروج النبات . أزواجا من نبات شتى ضروبا وأشباها ، أي أصنافا من النبات المختلفة الأزواج والألوان . وقال الأخفش التقدير أزواجا شتى من نبات . قال : وقد يكون النبات شتى ؛ ف ( شتى ) يجوز أن يكون نعتا لأزواج ، ويجوز أن يكون نعتا للنبات . وشتى مأخوذ من شت الشيء أي تفرق . يقال : أمر شت أي متفرق . وشت الأمر شتا وشتاتا تفرق ؛ واستشت مثله . وكذلك التشتت . وشتته تشتيتا فرقه . وأشت بي قومي أي فرقوا أمري . والشتيت المتفرق . قال رؤبة يصف إبلا :\nجاءت معا واطرقت شتيتا وهي تثير الساطع السختيتا\nوثغر شتيت أي مفلج . وقوم شتى ، وأشياء شتى ، وتقول : جاءوا أشتاتا ؛ أي متفرقين ؛ واحدهم شت ؛ قاله الجوهري .\n                                    ",
        "saadi": "ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ مَهۡدٗا وَسَلَكَ لَكُمۡ فِيهَا سُبُلٗا وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّن نَّبَاتٖ شَتَّىٰ ٣٥\n                                        \n                                        \n                                        \n                                        فقال: { الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا } أي: فراشا بحالة تتمكنون من السكون فيها، والقرار، والبناء، والغراس، وإثارتها للازدراع وغيره، وذللها لذلك، ولم يجعلها ممتنعة عن مصلحة من مصالحكم.\n{ وَسَلَكَ لَكُمْ فِيهَا سُبُلًا } أي: نفذ لكم الطرق الموصلة، من أرض إلى أرض، ومن قطر إلى قطر، حتى كان الآدميون يتمكنون من الوصول إلى جميع الأرض بأسهل ما يكون، وينتفعون بأسفارهم، أكثر مما ينتفعون بإقامتهم.{ وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ أَزْوَاجًا مِنْ نَبَاتٍ شَتَّى } أي: أنزل المطر { فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا } وأنبت بذلك جميع أصناف النوابت على اختلاف أنواعها، وتشتت أشكالها، وتباين أحوالها، فساقه، وقدره، ويسره، رزقا لنا ولأنعامنا، ولولا ذلك لهلك من عليها من آدمي وحيوان\n                                    "
      },
      "originalText": "ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ مَهۡدٗا وَسَلَكَ لَكُمۡ فِيهَا سُبُلٗا وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّن نَّبَاتٖ شَتَّىٰ ٣٥"
    },
    {
      "number": 2402,
      "text": "كُلُوا وَارْعَوْا أَنْعَامَكُمْ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِأُولِي النُّهَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 54,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 271,
      "hizbQuarter": 125,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كُلُواْ وَٱرۡعَوۡاْ أَنۡعَٰمَكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّأُوْلِي ٱلنُّهَىٰ ٤٥\n                                    \n                                    \n                                    ( كلوا وارعوا أنعامكم )\nأي : شيء لطعامكم وفاكهتكم ، وشيء لأنعامكم لأقواتها خضرا ويابسا .\n( إن في ذلك لآيات ) أي : لدلالات وحججا وبراهين ( لأولي النهى ) أي : لذوي العقول السليمة المستقيمة ، على أنه لا إله إلا الله ، ولا رب سواه .\n                                    ",
        "qortoby": "كُلُواْ وَٱرۡعَوۡاْ أَنۡعَٰمَكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّأُوْلِي ٱلنُّهَىٰ ٤٥\n                                    \n                                    \n                                    قوله تعالى : كلوا وارعوا أنعامكم أمر إباحة . وارعوا من رعت الماشية الكلأ ، ورعاها صاحبها رعاية ؛ أي أسامها وسرحها ؛ لازم ومتعد . إن في ذلك لآيات لأولي النهى أي العقول . الواحدة نهية . قال لهم ذلك ؛ لأنهم الذين ينتهى إلى رأيهم . وقيل : لأنهم ينهون النفس عن القبائح . وهذا كله من موسى احتجاج على فرعون في إثبات الصانع جوابا لقوله : فمن ربكما يا موسى . وبين أنه إنما يستدل على الصانع اليوم بأفعاله .\n                                    ",
        "saadi": "كُلُواْ وَٱرۡعَوۡاْ أَنۡعَٰمَكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّأُوْلِي ٱلنُّهَىٰ ٤٥\n                                        \n                                        \n                                        \n                                        { كُلُوا وَارْعَوْا أَنْعَامَكُمْ } وسياقها على وجه الامتنان، ليدل ذلك على أن الأصل في جميع النوابت الإباحة، فلا يحرم منهم إلا ما كان مضرا، كالسموم ونحوه.\n{ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِأُولِي النُّهَى } أي: لذوي العقول الرزينة، والأفكار المستقيمة على فضل الله وإحسانه، ورحمته، وسعة جوده، وتمام عنايته، وعلى أنه الرب المعبود، المالك المحمود، الذي لا يستحق العبادة سواه، ولا الحمد والمدح والثناء، إلا من امتن بهذه النعم، وعلى أنه على كل شيء قدير، فكما أحيا الأرض بعد موتها، إن ذلك لمحيي الموتى.\nوخص الله أولي النهى بذلك، لأنهم المنتفعون بها، الناظرون إليها نظر اعتبار، وأما من عداهم، فإنهم بمنزلة البهائم السارحة، والأنعام السائمة، لا ينظرون إليها نظر اعتبار، ولا تنفذ بصائرهم إلى المقصود منها، بل حظهم، حظ البهائم، يأكلون ويشربون، وقلوبهم لاهية، وأجسامهم معرضة. { وَكَأَيِّنْ مِنْ آيَةٍ فِي السَّمَاوَاتِ وَالْأَرْضِ يَمُرُّونَ عَلَيْهَا وَهُمْ عَنْهَا مُعْرِضُونَ }\n                                    "
      },
      "originalText": "كُلُواْ وَٱرۡعَوۡاْ أَنۡعَٰمَكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّأُوْلِي ٱلنُّهَىٰ ٤٥"
    },
    {
      "number": 2403,
      "text": "۞ مِنْهَا خَلَقْنَاكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 55,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ مِنۡهَا خَلَقۡنَٰكُمۡ وَفِيهَا نُعِيدُكُمۡ وَمِنۡهَا نُخۡرِجُكُمۡ تَارَةً أُخۡرَىٰ ٥٥\n                                    \n                                    \n                                    ( منها خلقناكم وفيها نعيدكم ومنها نخرجكم تارة أخرى )\nأي : من الأرض مبدؤكم ، فإن أباكم آدم مخلوق من تراب من أديم الأرض ، ( وفيها نعيدكم ) أي : وإليها تصيرون إذا متم وبليتم ، ومنها نخرجكم تارة أخرى . ( يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا ) [ الإسراء : 52 ] .\nوهذه الآية كقوله تعالى : ( قال فيها تحيون وفيها تموتون ومنها تخرجون ) [ الأعراف : 25 ] .\nوفي الحديث الذي في السنن أن رسول الله صلى الله عليه وسلم حضر جنازة ، فلما دفن الميت أخذ قبضة من التراب فألقاها في القبر ثم قال ( منها خلقناكم ) ثم أخذ أخرى وقال : ( وفيها نعيدكم ) . ثم أخذ أخرى وقال : ( ومنها نخرجكم تارة أخرى ) .\n                                    ",
        "qortoby": "۞ مِنۡهَا خَلَقۡنَٰكُمۡ وَفِيهَا نُعِيدُكُمۡ وَمِنۡهَا نُخۡرِجُكُمۡ تَارَةً أُخۡرَىٰ ٥٥\n                                    \n                                    \nقوله تعالى : منها خلقناكم يعني آدم - عليه السلام - لأنه خلق من الأرض ؛ قاله أبو إسحاق الزجاج وغيره .\n وقيل : كل نطفة مخلوقة من التراب ؛ على هذا يدل ظاهر القرآن . وروى أبو هريرة قال : قال رسول الله - صلى الله عليه وسلم - : ( ما من مولود إلا وقد ذر عليه من تراب حفرته ) أخرجه أبو نعيم الحافظ في باب ابن سيرين ، وقال : هذا حديث غريب من حديث عون لم نكتبه إلا من حديث أبي عاصم النبيل ، وهو أحد الثقات الأعلام من أهل البصرة . وقد مضى هذا المعنى مبينا في سورة ( الأنعام ) عن ابن مسعود . وقال عطاء الخراساني : إذا وقعت النطفة في الرحم انطلق الملك الموكل بالرحم فأخذ من تراب المكان الذي يدفن فيه فيذره على النطفة فيخلق الله النسمة من النطفة ومن التراب ؛ فذلك قوله تعالى : منها خلقناكم وفيها نعيدكم ومنها نخرجكم تارة أخرى .\nوفي حديث البراء عن النبي - صلى الله عليه وسلم - إن العبد المؤمن إذا خرجت روحه صعدت به الملائكة فلا يمرون بها على ملأ من الملائكة إلا قالوا ما هذه الروح الطيبة ، فيقولون : فلان بن فلان بأحسن أسمائه التي كانوا يسمونه بها في الدنيا فيستفتحون لها فيفتح فيشيعه من كل سماء مقربوها إلى السماء التي تليها ، حتى ينتهى بها إلى السماء السابعة ، فيقول الله - عز وجل - : اكتبوا لعبدي كتابا في عليين وأعيدوه إلى الأرض فإني منها خلقتهم وفيها أعيدهم ومنها أخرجهم تارة أخرى فتعاد روحه في جسده وذكر الحديث . وقد ذكرناه بتمامه في كتاب ( التذكرة ) وروي من حديث علي - رضي الله عنه - ؛ ذكره الثعلبي . ومعنى وفيها نعيدكم أي بعد الموت ومنها نخرجكم أي للبعث والحساب . تارة أخرى يرجع هذا إلى قوله : منها خلقناكم لا إلى نعيدكم . وهو كقولك اشتريت ناقة ودارا وناقة أخرى ؛ فالمعنى : من الأرض أخرجناكم ونخرجكم بعد الموت من الأرض تارة أخرى .\n                                    ",
        "saadi": "۞ مِنۡهَا خَلَقۡنَٰكُمۡ وَفِيهَا نُعِيدُكُمۡ وَمِنۡهَا نُخۡرِجُكُمۡ تَارَةً أُخۡرَىٰ ٥٥\n                                        \n                                        \n                                        \n                                        ولما ذكر كرم الأرض، وحسن شكرها لما ينزله الله عليها من المطر، وأنها بإذن ربها، تخرج النبات المختلف الأنواع، أخبر أنه خلقنا منها، وفيها يعيدنا إذا متنا فدفنا فيها، ومنها يخرجنا تارة أخرى، فكما أوجدنا منها من العدم، وقد علمنا ذلك وتحققناه، فسيعيدنا بالبعث منها بعد موتنا، ليجازينا بأعمالنا التي عملناها عليها.\nوهذان دليلان على الإعادة عقليان واضحان: إخراج النبات من الأرض بعد موتها، وإخراج المكلفين منها في إيجادهم.\n                                    "
      },
      "originalText": "۞ مِنۡهَا خَلَقۡنَٰكُمۡ وَفِيهَا نُعِيدُكُمۡ وَمِنۡهَا نُخۡرِجُكُمۡ تَارَةً أُخۡرَىٰ ٥٥"
    },
    {
      "number": 2404,
      "text": "وَلَقَدْ أَرَيْنَاهُ آيَاتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 56,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ أَرَيۡنَٰهُ ءَايَٰتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ ٦٥\n                                    \n                                    \n                                    وقوله ( ولقد أريناه آياتنا كلها فكذب وأبى ) ، يعني : فرعون أنه قامت عليه الحجج والآيات والدلالات وعاين ذلك وأبصره ، فكذب بها وأباها كفرا وعنادا وبغيا ، كما قال تعالى : ( وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا فانظر كيف كان عاقبة المفسدين ) [ النمل : 14 ] .\n                                    ",
        "qortoby": "وَلَقَدۡ أَرَيۡنَٰهُ ءَايَٰتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ ٦٥\n                                    \n                                    \n                                    وَلَقَدْ أَرَيْنَاهُ آيَاتِنَا كُلَّهَا\nأي المعجزات الدالة على نبوة موسى وقيل حجج الله الدالة على توحيدهفَكَذَّبَ وَأَبَى\nأي لم يؤمن وهذا يدل على أنه كفر عنادا لأنه رأى الآيات عيانا لا خبرا نظيره \" وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا \" [ النمل : 14 ]\n                                    ",
        "saadi": "وَلَقَدۡ أَرَيۡنَٰهُ ءَايَٰتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ ٦٥\n                                        \n                                        \n                                        \n                                        يخبر تعالى، أنه أرى فرعون من الآيات والعبر والقواطع، جميع أنواعها العيانية، والأفقية والنفسية، فما استقام ولا ارعوى، وإنما كذب وتولى، كذب الخبر، وتولى عن الأمر والنهي، وجعل الحق باطلا، والباطل حقا، وجادل بالباطل ليضل الناس\n                                    "
      },
      "originalText": "وَلَقَدۡ أَرَيۡنَٰهُ ءَايَٰتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ ٦٥"
    },
    {
      "number": 2405,
      "text": "قَالَ أَجِئْتَنَا لِتُخْرِجَنَا مِنْ أَرْضِنَا بِسِحْرِكَ يَا مُوسَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 57,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ أَجِئۡتَنَا لِتُخۡرِجَنَا مِنۡ أَرۡضِنَا بِسِحۡرِكَ يَٰمُوسَىٰ ٧٥\n                                    \n                                    \n                                    يقول تعالى مخبرا عن فرعون أنه قال لموسى حين أراه الآية الكبرى ، وهي إلقاء عصاه فصارت ثعبانا عظيما ونزع يده من تحت جناحه فخرجت بيضاء من غير سوء فقال : هذا سحر ، جئت به لتسحرنا وتستولي به على الناس ، فيتبعونك وتكاثرنا بهم ، ولا يتم هذا معك\n                                    ",
        "qortoby": "قَالَ أَجِئۡتَنَا لِتُخۡرِجَنَا مِنۡ أَرۡضِنَا بِسِحۡرِكَ يَٰمُوسَىٰ ٧٥\n                                    \n                                    \n                                    لما رأى الآيات التي أتاه بها موسى قال : إنها سحر ; والمعنى : جئت لتوهم الناس أنك جئت بآية توجب اتباعك والإيمان بك , حتى تغلب على أرضنا وعلينا .\n                                    ",
        "saadi": "قَالَ أَجِئۡتَنَا لِتُخۡرِجَنَا مِنۡ أَرۡضِنَا بِسِحۡرِكَ يَٰمُوسَىٰ ٧٥\n                                        \n                                        \n                                        \n                                        { أَجِئْتَنَا لِتُخْرِجَنَا مِنْ أَرْضِنَا بِسِحْرِكَ } زعم أن هذه الآيات التي أراه إياها موسى، سحر وتمويه، المقصود منها إخراجهم من أرضهم، والاستيلاء عليها، ليكون كلامه مؤثرا في قلوب قومه، فإن الطباع تميل إلى أوطانها، ويصعب عليها الخروج منها ومفارقتها.فأخبرهم أن موسى هذا قصده، ليبغضوه، ويسعوا في محاربته\n                                    "
      },
      "originalText": "قَالَ أَجِئۡتَنَا لِتُخۡرِجَنَا مِنۡ أَرۡضِنَا بِسِحۡرِكَ يَٰمُوسَىٰ ٧٥"
    },
    {
      "number": 2406,
      "text": "فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِثْلِهِ فَاجْعَلْ بَيْنَنَا وَبَيْنَكَ مَوْعِدًا لَا نُخْلِفُهُ نَحْنُ وَلَا أَنْتَ مَكَانًا سُوًى",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 58,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَلَنَأۡتِيَنَّكَ بِسِحۡرٖ مِّثۡلِهِۦ فَٱجۡعَلۡ بَيۡنَنَا وَبَيۡنَكَ مَوۡعِدٗا لَّا نُخۡلِفُهُۥ نَحۡنُ وَلَآ أَنتَ مَكَانٗا سُوٗى ٨٥\n                                    \n                                    \n                                    فإن عندنا سحرا مثل سحرك فلا يغرنك ما أنت فيه \"فاجعل بيننا وبينك موعدا\"أي يوما نجتمع نحن وأنت فيه فنعارض ما جئت به بما عندك من السحر في مكان معين ووقت معين.\n                                    ",
        "qortoby": "فَلَنَأۡتِيَنَّكَ بِسِحۡرٖ مِّثۡلِهِۦ فَٱجۡعَلۡ بَيۡنَنَا وَبَيۡنَكَ مَوۡعِدٗا لَّا نُخۡلِفُهُۥ نَحۡنُ وَلَآ أَنتَ مَكَانٗا سُوٗى ٨٥\n                                    \n                                    \n                                    فلنأتينك بسحر مثله أي لنعارضنك بمثل ما جئت به ليتبين للناس أن ما أتيت به ليس من عند الله . فاجعل بيننا وبينك موعدا هو مصدر ؛ أي وعدا . وقيل : الموعد اسم لمكان الوعد ؛ كما قال تعالى : وإن جهنم لموعدهم أجمعين فالموعد هاهنا مكان . وقيل : الموعد اسم لزمان الوعد ؛ كقوله تعالى : إن موعدهم الصبح فالمعنى : اجعل لنا يوما معلوما ، أو مكانا معروفا . قال القشيري : والأظهر أنه مصدر ولهذا قال : لا نخلفه . أي لا نخلف ذلك الوعد ، والإخلاف أن يعد شيئا ولا ينجزه . وقال الجوهري والميعاد المواعدة والوقت والموضع وكذلك الموعد . وقرأ أبو جعفر بن القعقاع وشيبة والأعرج ( لا نخلفه ) بالجزم جوابا لقوله : اجعل ومن رفع فهو نعت ل ( موعد ) والتقدير . موعدا غير مخلف . مكانا سوى قرأ ابن عامر وعاصم وحمزة ( سوى ) بضم السين . الباقون بكسرها ؛ وهما لغتان مثل عدا وعدا وطوى وطوى . واختار أبو عبيد وأبو حاتم كسر السين لأنها اللغة العالية الفصيحة . وقال النحاس والكسر أعرف وأشهر . وكلهم نونوا الواو ، وقد روي عن الحسن ، واختلف عنه ضم السين بغير تنوين . واختلف في معناه فقيل : سوى هذا المكان ؛ قاله الكلبي . وقيل مكانا مستويا يتبين للناس ما بينا فيه ؛ قال ابن زيد : ابن عباس : نصفا . مجاهد : منصفا ؛ وعنه أيضا وقتادة عدلا بيننا وبينك . قال النحاس : وأهل التفسير على أن معنى سوى نصف وعدل وهو قول حسن ؛ قال سيبويه يقال : سوى وسوى أي عدل ؛ يعني مكانا عدلا ؛ بين المكانين فيه النصفة ؛ وأصله من قولك : جلس في سواء الدار بالمد أي في وسطها ؛ ووسط كل شيء أعدله ؛ وفي الحديث عن النبي - صلى الله عليه وسلم - : وكذلك جعلناكم أمة وسطا أي عدلا ، وقال زهير :\nأرونا خطة لا ضيم فيها يسوي بيننا فيها السواء\nوقال أبو عبيدة والقتبي : وسطا بين الفريقين ؛ وأنشد أبو عبيدة لموسى بن جابر الحنفي :\nوإن أبانا كان حل ببلدة سوى بين قيس قيس عيلان والفزر\nوالفزر : سعد بن زيد مناة بن تميم . وقال الأخفش : ( سوى ) إذا كان بمعنى غير أو بمعنى العدل يكون فيه ثلاث لغات : إن ضممت السين أو كسرت قصرت فيهما جميعا . وإن فتحت مددت ، تقول : مكان سوى وسوى وسواء ؛ أي عدل ووسط فيما بين الفريقين . قال موسى بن جابر :\nوجدنا أبانا كان حل ببلدة\nالبيت . وقيل : مكانا سوى أي قصدا ؛ وأنشد صاحب هذا القول :\nلو تمنت حبيبتي ما عدتني أو تمنيت ما عدوت سواها\nوتقول : مررت برجل سواك وسواك وسوائك أي غيرك . وهما في هذا الأمر سواء وإن شئت سواءان . وهم سواء للجمع وهم أسواء ؛ وهم سواسية مثل ثمانية على غير قياس . وانتصب مكانا على المفعول الثاني ل ( جعل ) . ولا يحسن انتصابه بالموعد على أنه مفعول أو ظرف له ؛ لأن الموعد قد وصف ، والأسماء التي تعمل عمل الأفعال إذا وصفت أو صغرت لم يسغ أن تعمل لخروجها عن شبه الفعل ، ولم يحسن حمله على أنه ظرف وقع موقع المفعول الثاني ؛ لأن الموعد إذا وقع بعده ظرف لم تجره العرب مجرى المصادر مع الظروف ، لكنهم يتسعون فيه كقوله تعالى : إن موعدهم الصبح و موعدكم يوم الزينة .\n                                    ",
        "saadi": "فَلَنَأۡتِيَنَّكَ بِسِحۡرٖ مِّثۡلِهِۦ فَٱجۡعَلۡ بَيۡنَنَا وَبَيۡنَكَ مَوۡعِدٗا لَّا نُخۡلِفُهُۥ نَحۡنُ وَلَآ أَنتَ مَكَانٗا سُوٗى ٨٥\n                                        \n                                        \n                                        \n                                        فلنأتينك بسحر مثل سحرك فأمهلنا، واجعل لنا { مَوْعِدًا لَا نُخْلِفُهُ نَحْنُ وَلَا أَنْتَ مَكَانًا سُوًى } أي: مستو علمنا وعلمك به، أو مكانا مستويا معتدلا ليتمكن من رؤية ما فيه.\n                                    "
      },
      "originalText": "فَلَنَأۡتِيَنَّكَ بِسِحۡرٖ مِّثۡلِهِۦ فَٱجۡعَلۡ بَيۡنَنَا وَبَيۡنَكَ مَوۡعِدٗا لَّا نُخۡلِفُهُۥ نَحۡنُ وَلَآ أَنتَ مَكَانٗا سُوٗى ٨٥"
    },
    {
      "number": 2407,
      "text": "قَالَ مَوْعِدُكُمْ يَوْمُ الزِّينَةِ وَأَنْ يُحْشَرَ النَّاسُ ضُحًى",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 59,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ مَوۡعِدُكُمۡ يَوۡمُ ٱلزِّينَةِ وَأَن يُحۡشَرَ ٱلنَّاسُ ضُحٗى ٩٥\n                                    \n                                    \n                                    فعند ذلك ) قال ) لهم موسى ( موعدكم يوم الزينة ) وهو يوم عيدهم ونوروزهم وتفرغهم من أعمالهم واجتماعهم جميعهم ; ليشاهد الناس قدرة الله على ما يشاء ، ومعجزات الأنبياء ، وبطلان معارضة السحر لخوارق العادات النبوية ، ولهذا قال : ( وأن يحشر الناس ) أي : جميعهم ) ضحى ) أي : ضحوة من النهار ليكون أظهر وأجلى وأبين وأوضح ، وهكذا شأن الأنبياء ، كل أمرهم واضح ، بين ، ليس فيه خفاء ولا ترويج ; ولهذا لم يقل \" ليلا \" ولكن نهارا ضحى .\nقال ابن عباس : وكان يوم الزينة يوم عاشوراء .\nوقال السدي ، وقتادة ، وابن زيد : كان يوم عيدهم .\nوقال سعيد بن جبير : يوم سوقهم .\nولا منافاة . قلت : وفي مثله أهلك الله فرعون وجنوده ، كما ثبت في الصحيح .\nوقال وهب بن منبه : قال فرعون : يا موسى ، اجعل بيننا وبينك أجلا ننظر فيه . قال موسى : لم أومر بهذا ، إنما أمرت بمناجزتك ، إن أنت لم تخرج دخلت إليك . فأوحى الله إلى موسى أن اجعل بينك وبينه أجلا وقل له أن يجعل هو . قال فرعون : اجعله إلى أربعين يوما . ففعل .\nوقال مجاهد ، وقتادة : ( مكانا سوى ) منصفا . وقال السدي : عدلا . وقال عبد الرحمن بن زيد بن أسلم : ( مكانا سوى ) مستو يتبين الناس ما فيه ، لا يكون صوب ولا شيء يتغيب بعض ذلك عن بعض ، مستو حتى يرى .\n                                    ",
        "qortoby": "قَالَ مَوۡعِدُكُمۡ يَوۡمُ ٱلزِّينَةِ وَأَن يُحۡشَرَ ٱلنَّاسُ ضُحٗى ٩٥\n                                    \n                                    \n                                    واختلف في يوم الزينة ، فقيل هو يوم عيد كان لهم يتزينون ويجتمعون فيه ؛ قاله قتادة والسدي وغيرهما . وقال ابن عباس وسعيد بن جبير : كان يوم عاشوراء . وقال سعيد بن المسيب : يوم سوق كان لهم يتزينون فيها ؛ وقاله قتادة أيضا . وقال الضحاك : يوم السبت . وقيل : يوم النيروز ؛ ذكره الثعلبي . وقيل : يوم يكسر فيه الخليج ؛ وذلك أنهم كانوا يخرجون فيه يتفرجون ويتنزهون ؛ وعند ذلك تأمن الديار المصرية من قبل النيل . وقرأ الحسن والأعمش وعيسى الثقفي والسلمي وهبيرة عن حفص يوم الزينة بالنصب . ورويت عن أبي عمرو ؛ أي في يوم الزينة إنجاز موعدنا . الباقون بالرفع على أنه خبر الابتداء .\nوأن يحشر الناس ضحى أي وجمع الناس ؛ ف ( أن ) في موضع رفع على قراءة من قرأ ( يوم ) بالرفع . وعطف وأن يحشر يقوي قراءة الرفع ؛ لأن أن لا تكون ظرفا ، وإن كان المصدر الصريح يكون ظرفا كمقدم الحاج ؛ لأن من قال آتيك مقدم الحاج لم يقل آتيك أن يقدم الحاج . النحاس : وأولى من هذا أن يكون في موضع خفض عطفا على الزينة . والضحا مؤنثة تصغرها العرب بغير هاء لئلا يشبه تصغيرها ضحوة ؛ قاله النحاس . وقال الجوهري : ضحوة النهار بعد طلوع الشمس ، ثم بعده الضحى وهي حين تشرق الشمس ؛ مقصورة تؤنث وتذكر ؛ فمن أنث ذهب إلى أنها جمع ضحوة ؛ ومن ذكر ذهب إلى أنه اسم على فعل مثل صرد ونغر ؛ وهو ظرف غير متمكن مثل سحر ؛ تقول : لقيته ضحا ؛ وضحا إذا أردت به ضحا يومك لم تنونه ، ثم بعده الضحاء ممدود مذكر ، وهو عند ارتفاع النهار الأعلى . وخص الضحى لأنه أول النهار ، فلو امتد الأمر فيما بينهم كان في النهار متسع . وروي عن ابن مسعود والجحدري وغيرهما ( وأن يحشر الناس ضحا ) على معنى وأن يحشر الله الناس ونحوه . وعن بعض القراء ( وأن تحشر الناس ) والمعنى وأن تحشر أنت يا فرعون الناس وعن الجحدري أيضا ( وأن نحشر ) بالنون وإنما واعدهم ذلك اليوم ؛ ليكون علو كلمة الله ، وظهور دينه ، وكبت الكافر ، وزهوق الباطل على رءوس الأشهاد ، وفي المجمع الغاص لتقوى رغبة من رغب في الحق ، ويكل حد المبطلين وأشياعهم ، ويكثر المحدث بذلك الأمر العلم في كل بدو وحضر ، ويشيع في جمع أهل الوبر والمدر .\n                                    ",
        "saadi": "قَالَ مَوۡعِدُكُمۡ يَوۡمُ ٱلزِّينَةِ وَأَن يُحۡشَرَ ٱلنَّاسُ ضُحٗى ٩٥\n                                        \n                                        \n                                        \n                                        فقال موسى: { مَوْعِدُكُمْ يَوْمُ الزِّينَةِ } وهو عيدهم، الذي يتفرغون فيه ويقطعون شواغلهم، { وَأَنْ يُحْشَرَ النَّاسُ ضُحًى } أي: يجمعون كلهم في وقت الضحى، وإنما سأل موسى ذلك، لأن يوم الزينة ووقت الضحى فيه يحصل فيه من كثرة الاجتماع، ورؤية الأشياء على حقائقها، ما لا يحصل في غيره\n                                    "
      },
      "originalText": "قَالَ مَوۡعِدُكُمۡ يَوۡمُ ٱلزِّينَةِ وَأَن يُحۡشَرَ ٱلنَّاسُ ضُحٗى ٩٥"
    },
    {
      "number": 2408,
      "text": "فَتَوَلَّىٰ فِرْعَوْنُ فَجَمَعَ كَيْدَهُ ثُمَّ أَتَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 60,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَتَوَلَّىٰ فِرۡعَوۡنُ فَجَمَعَ كَيۡدَهُۥ ثُمَّ أَتَىٰ ٠٦\n                                    \n                                    \n                                    يقول تعالى مخبرا عن فرعون أنه لما تواعد هو بموسى عليه السلام ، إلى وقت ومكان معلومين ، تولى ، أي : شرع في جمع السحرة من مدائن مملكته ، كل من ينسب إلى سحر في ذلك الزمان . وقد كان السحر فيهم كثيرا نافقا جدا ، كما قال تعالى : ( وقال فرعون ائتوني بكل ساحر عليم ) [ يونس : 79 ] .\n( ثم أتى ) أي : اجتمع الناس لميقات يوم معلوم وهو يوم الزينة ، وجلس فرعون على سرير مملكته ، واصطف له أكابر دولته ، ووقفت الرعايا يمنة ويسرة وأقبل موسى ، عليه السلام ، يتوكأ على عصاه ، ومعه أخوه هارون ، ووقف السحرة بين يدي فرعون صفوفا ، وهو يحرضهم ويحثهم ، ويرغبهم في إجادة عملهم في ذلك اليوم ، ويتمنون عليه ، وهو يعدهم ويمنيهم ، فيقولون : ( أئن لنا لأجرا إن كنا نحن الغالبين قال نعم وإنكم إذا لمن المقربين ) [ الشعراء : 41 ، 42 ] .\n                                    ",
        "qortoby": "فَتَوَلَّىٰ فِرۡعَوۡنُ فَجَمَعَ كَيۡدَهُۥ ثُمَّ أَتَىٰ ٠٦\n                                    \n                                    \n                                    قوله تعالى : فتولى فرعون فجمع كيده أي حيله وسحره ؛ والمراد جمع السحرة . قال ابن عباس : كانوا اثنين وسبعين ساحرا ، مع كل ساحر منهم حبال وعصي . وقيل : كانوا أربعمائة . وقيل : كانوا اثني عشر ألفا . وقيل : أربعة عشر ألفا . وقال ابن المنكدر : كانوا ثمانين ألفا . وقيل : كانوا مجمعين على رئيس يقال له شمعون . وقيل كان اسمه يوحنا معه اثنا عشر نقيبا ، مع كل نقيب عشرون عريفا ، مع كل عريف ألف ساحر . وقيل كانوا ثلثمائة ألف ساحر من الفيوم ، وثلثمائة ألف ساحر من الصعيد ، وثلثمائة ألف ساحر من الريف ، فصاروا تسعمائة ألف وكان رئيسهم أعمى . ثم أتى أي أتى الميعاد .\n                                    ",
        "saadi": "فَتَوَلَّىٰ فِرۡعَوۡنُ فَجَمَعَ كَيۡدَهُۥ ثُمَّ أَتَىٰ ٠٦\n                                        \n                                        \n                                        \n                                        فقال موسى: { مَوْعِدُكُمْ يَوْمُ الزِّينَةِ } وهو عيدهم، الذي يتفرغون فيه ويقطعون شواغلهم، { وَأَنْ يُحْشَرَ النَّاسُ ضُحًى } أي: يجمعون كلهم في وقت الضحى، وإنما سأل موسى ذلك، لأن يوم الزينة ووقت الضحى فيه يحصل فيه من كثرة الاجتماع، ورؤية الأشياء على حقائقها، ما لا يحصل في غيره، { فَتَوَلَّى فِرْعَوْنُ فَجَمَعَ كَيْدَهُ } أي: جميع ما يقدر عليه، مما يكيد به موسى، فأرسل في مدائنه من يحشر السحرة الماهرين في سحرهم، وكان السحر إذ ذاك، متوفرا، وعلمه علما مرغوبا فيه، فجمع خلقا كثيرا من السحرة، ثم أتى كل منهما للموعد، واجتمع الناس للموعد.فكان الجمع حافلا، حضره الرجال والنساء، والملأ، والأشراف، والعوام، والصغار، والكبار، وحضوا الناس على الاجتماع، وقالوا للناس: { هَلْ أَنْتُمْ مُجْتَمِعُونَ* لَعَلَّنَا نَتَّبِعُ السَّحَرَةَ إِنْ كَانُوا هُمُ الْغَالِبِينَ }\n                                    "
      },
      "originalText": "فَتَوَلَّىٰ فِرۡعَوۡنُ فَجَمَعَ كَيۡدَهُۥ ثُمَّ أَتَىٰ ٠٦"
    },
    {
      "number": 2409,
      "text": "قَالَ لَهُمْ مُوسَىٰ وَيْلَكُمْ لَا تَفْتَرُوا عَلَى اللَّهِ كَذِبًا فَيُسْحِتَكُمْ بِعَذَابٍ ۖ وَقَدْ خَابَ مَنِ افْتَرَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 61,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ لَهُم مُّوسَىٰ وَيۡلَكُمۡ لَا تَفۡتَرُواْ عَلَى ٱللَّهِ كَذِبٗا فَيُسۡحِتَكُم بِعَذَابٖۖ وَقَدۡ خَابَ مَنِ ٱفۡتَرَىٰ ١٦\n                                    \n                                    \n                                    ( قال لهم موسى ويلكم لا تفتروا على الله كذبا ) أي : لا تخيلوا للناس بأعمالكم إيجاد أشياء لا حقائق لها ، وأنها مخلوقة ، وليست مخلوقة ، فتكونوا قد كذبتم على الله ، ( فيسحتكم بعذاب ) أي : يهلككم بعقوبة هلاكا لا بقية له ، ( وقد خاب من افترى)\n                                    ",
        "qortoby": "قَالَ لَهُم مُّوسَىٰ وَيۡلَكُمۡ لَا تَفۡتَرُواْ عَلَى ٱللَّهِ كَذِبٗا فَيُسۡحِتَكُم بِعَذَابٖۖ وَقَدۡ خَابَ مَنِ ٱفۡتَرَىٰ ١٦\n                                    \n                                    \n                                    قال لهم موسى أي قال لفرعون والسحرة ويلكم دعاء عليهم بالويل . وهو بمعنى المصدر . وقال أبو إسحاق الزجاج : هو منصوب بمعنى ألزمهم الله ويلا . قال : ويجوز أن يكون نداء كقوله تعالى : يا ويلنا من بعثنا لا تفتروا على الله كذبا أي لا تختلقوا عليه الكذب ، ولا تشركوا به ، ولا تقولوا للمعجزات إنها سحر . فيسحتكم بعذاب من عنده أي يستأصلكم بالإهلاك يقال فيه : سحت وأسحت بمعنى . وأصله من استقصاء الشعر . وقرأ الكوفيون ( فيسحتكم ) من أسحت ، الباقون ( فيسحتكم ) من سحت وهذه لغة أهل الحجاز و بني تميم . وانتصب على جواب النهي . وقال الفرزدق :\nوعض زمان يا ابن مروان لم يدع من المال إلا مسحتا أو مجلفا\nالزمخشري : وهذا بيت لا تزال الركب تصطك في تسوية إعرابه . وقد خاب من افترى أي خسر وهلك ، وخاب من الرحمة والثواب من ادعى على الله ما لم يأذن به .\n                                    ",
        "saadi": "قَالَ لَهُم مُّوسَىٰ وَيۡلَكُمۡ لَا تَفۡتَرُواْ عَلَى ٱللَّهِ كَذِبٗا فَيُسۡحِتَكُم بِعَذَابٖۖ وَقَدۡ خَابَ مَنِ ٱفۡتَرَىٰ ١٦\n                                        \n                                        \n                                        \n                                        فحين اجتمعوا من جميع البلدان، وعظهم موسى عليه السلام، وأقام عليهم الحجة، وقال لهم: { وَيْلَكُمْ لَا تَفْتَرُوا عَلَى اللَّهِ كَذِبًا فَيُسْحِتَكُمْ بِعَذَابٍ } أي: لا تنصروا ما أنتم عليه من الباطل بسحركم وتغالبون الحق، وتفترون على الله الكذب، فيستأصلكم بعذاب من عنده، ويخيب سعيكم وافتراؤكم، فلا تدركون ما تطلبون من النصر والجاه عند فرعون وملائه، ولا تسلمون من عذاب الله، وكلام الحق لا بد أن يؤثر في القلوب.\n                                    "
      },
      "originalText": "قَالَ لَهُم مُّوسَىٰ وَيۡلَكُمۡ لَا تَفۡتَرُواْ عَلَى ٱللَّهِ كَذِبٗا فَيُسۡحِتَكُم بِعَذَابٖۖ وَقَدۡ خَابَ مَنِ ٱفۡتَرَىٰ ١٦"
    },
    {
      "number": 2410,
      "text": "فَتَنَازَعُوا أَمْرَهُمْ بَيْنَهُمْ وَأَسَرُّوا النَّجْوَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 62,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَتَنَٰزَعُوٓاْ أَمۡرَهُم بَيۡنَهُمۡ وَأَسَرُّواْ ٱلنَّجۡوَىٰ ٢٦\n                                    \n                                    \n                                    قيل : معناه : أنهم تشاجروا فيما بينهم فقائل يقول : ليس هذا بكلام ساحر ، إنما هذا كلام نبي . وقائل يقول : بل هو ساحر . وقيل غير ذلك ، والله أعلم .\nوقوله : ( وأسروا النجوى ) أي : تناجوا فيما بينهم\n                                    ",
        "qortoby": "فَتَنَٰزَعُوٓاْ أَمۡرَهُم بَيۡنَهُمۡ وَأَسَرُّواْ ٱلنَّجۡوَىٰ ٢٦\n                                    \n                                    \n                                    قوله تعالى : فتنازعوا أمرهم بينهم أي تشاوروا ؛ يريد السحرة . وأسروا النجوى قال قتادة : قالوا إن كان ما جاء به سحرا فسنغلبه ، وإن كان من عند الله فسيكون له أمر ؛ وهذا الذي أسروه . وقيل الذي أسروا قولهم : إن هذان لساحران الآية قاله السدي ومقاتل . وقيل الذي أسروا قولهم : إن غلبنا اتبعناه ؛ قاله الكلبي ؛ دليله ما ظهر من عاقبة أمرهم . وقيل : كان سرهم أن قالوا حين قال لهم موسى : ويلكم لا تفتروا على الله كذبا : ما هذا بقول ساحر . و النجوى المناجاة يكون اسما ومصدرا . وقد تقدم في ( النساء ) بيانه .\n                                    ",
        "saadi": "فَتَنَٰزَعُوٓاْ أَمۡرَهُم بَيۡنَهُمۡ وَأَسَرُّواْ ٱلنَّجۡوَىٰ ٢٦\n                                        \n                                        \n                                        \n                                        لا جرم ارتفع الخصام والنزاع بين السحرة لما سمعوا كلام موسى، وارتبكوا، ولعل من جملة نزاعهم، الاشتباه في موسى، هل هو على الحق أم لا؟ ولكن هم إلى الآن، ما تم أمرهم، ليقضي الله أمرا كان مفعولا، { لِيَهْلِكَ مَنْ هَلَكَ عَنْ بَيِّنَةٍ وَيَحْيَا مَنْ حَيَّ عَنْ بَيِّنَةٍ } فحينئذ أسروا فيما بينهم النجوى، وأنهم يتفقون على مقالة واحدة، لينجحوا في مقالهم وفعالهم، وليتمسك الناس بدينهم\n                                    "
      },
      "originalText": "فَتَنَٰزَعُوٓاْ أَمۡرَهُم بَيۡنَهُمۡ وَأَسَرُّواْ ٱلنَّجۡوَىٰ ٢٦"
    },
    {
      "number": 2411,
      "text": "قَالُوا إِنْ هَٰذَانِ لَسَاحِرَانِ يُرِيدَانِ أَنْ يُخْرِجَاكُمْ مِنْ أَرْضِكُمْ بِسِحْرِهِمَا وَيَذْهَبَا بِطَرِيقَتِكُمُ الْمُثْلَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 63,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالُوٓاْ إِنۡ هَٰذَٰنِ لَسَٰحِرَٰنِ يُرِيدَانِ أَن يُخۡرِجَاكُم مِّنۡ أَرۡضِكُم بِسِحۡرِهِمَا وَيَذۡهَبَا بِطَرِيقَتِكُمُ ٱلۡمُثۡلَىٰ ٣٦\n                                    \n                                    \n                                    ( قالوا إن هذان لساحران ) هذه لغة لبعض العرب ، جاءت هذه القراءة على إعرابها ، ومنهم من قرأ : \" إن هذين لساحران \" وهذه اللغة المشهورة ، وقد توسع النحاة في الجواب عن القراءة الأولى بما ليس هذا موضعه .\nوالغرض أن السحرة قالوا فيما بينهم : تعلمون أن هذا الرجل وأخاه - يعنون : موسى وهارون - ساحران عالمان خبيران بصناعة السحر ، يريدان في هذا اليوم أن يغلباكم وقومكم ويستوليا على الناس ، وتتبعهما العامة ويقاتلا فرعون وجنوده ، فينتصرا عليه ويخرجاكم من أرضكم .\nوقوله : ( ويذهبا بطريقتكم المثلى ) أي : ويستبدا بهذه الطريقة ، وهي السحر ، فإنهم كانوا معظمين بسببها ، لهم أموال وأرزاق عليها ، يقولون : إذا غلب هذان أهلكاكم وأخرجاكم من الأرض ، وتفردا بذلك ، وتمحضت لهما الرياسة بها دونكم .\nوقد تقدم في حديث الفتون عن ابن عباس [ قال ] في قوله : ( ويذهبا بطريقتكم المثلى ) يعني : ملكهم الذي هم فيه والعيش .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا نعيم بن حماد ، حدثنا هشيم ، عن عبد الرحمن بن إسحاق ، سمع الشعبي يحدث عن علي في قوله : ( ويذهبا بطريقتكم المثلى ) قال : يصرفا وجوه الناس إليهما .\nوقال مجاهد : ( ويذهبا بطريقتكم المثلى ) قال : أولي الشرف والعقل والأسنان .\nوقال أبو صالح : ( بطريقتكم المثلى ) أشرافكم وسرواتكم . وقال عكرمة : بخيركم . وقال قتادة : وطريقتهم المثلى يومئذ بنو إسرائيل ، كانوا أكثر القوم عددا وأموالا فقال عدو الله : يريدان أن يذهبا بها لأنفسهما .\nوقال عبد الرحمن بن زيد : ( بطريقتكم المثلى ) بالذي أنتم عليه .\n                                    ",
        "qortoby": "قَالُوٓاْ إِنۡ هَٰذَٰنِ لَسَٰحِرَٰنِ يُرِيدَانِ أَن يُخۡرِجَاكُم مِّنۡ أَرۡضِكُم بِسِحۡرِهِمَا وَيَذۡهَبَا بِطَرِيقَتِكُمُ ٱلۡمُثۡلَىٰ ٣٦\n                                    \n                                    \n                                    قوله تعالى : قالوا إن هذان لساحران قرأ أبو عمر ( إن هذين لساحران ) . ورويت عن عثمان وعائشة - رضي الله عنهما - وغيرهما من الصحابة ؛ وكذلك قرأ الحسن وسعيد بن جبير وإبراهيم النخعي وغيرهم من التابعين ؛ ومن القراء عيسى بن عمر وعاصم الجحدري ؛ فيما ذكر النحاس . وهذه القراءة موافقة للإعراب مخالفة للمصحف . وقرأ الزهري والخليل بن أحمد والمفضل وأبان وابن محيصن وابن كثير وعاصم في رواية حفص عنه إن هذان بتخفيف ( إن ) ( لساحران ) وابن كثير يشدد نون ( هذان ) . وهذه القراءة سلمت من مخالفة المصحف ومن فساد الإعراب ، ويكون معناها ما هذان إلا ساحران . وقرأ المدنيون والكوفيون ( إن هذان ) بتشديد ( إن ) ( لساحران ) فوافقوا المصحف وخالفوا الإعراب . قال النحاس فهذه ثلاث قراءات قد رواها الجماعة عن الأئمة ، وروي عن عبد الله بن مسعود أنه قرأ ( إن هذان إلا ساحران ) وقال الكسائي في قراءة عبد الله : ( إن هذان ساحران ) بغير لام ؛ وقال الفراء في حرف أبي ( إن ذان إلا ساحران ) فهذه ثلاث قراءات أخرى تحمل على التفسير لا أنها جائز أن يقرأ بها لمخالفتها المصحف .\nقلت : وللعلماء في قراءة أهل المدينة والكوفة ستة أقوال ذكرها ابن الأنباري في آخر كتاب الرد له ، والنحاس في إعرابه ، والمهدوي في تفسيره ، وغيرهم أدخل كلام بعضهم في بعض . وقد خطأها قوم حتى قال أبو عمرو : إني لأستحي من الله أن أقرأ ( إن هذان ) وروى عروة عن عائشة - رضي الله عنها - أنها سئلت عن قوله تعالى : لكن الراسخون في العلم ثم قال : والمقيمين وفي ( المائدة ) إن الذين آمنوا والذين هادوا والصابئون و ( إن هذان لساحران ) فقالت يا ابن أختي ! هذا خطأ من الكاتب . وقال عثمان بن عفان - رضي الله عنه - : في المصحف لحن وستقيمه العرب بألسنتهم . وقال أبان بن عثمان : قرأت هذه الآية عند أبي عثمان بن عفان ، فقال لحن وخطأ ؛ فقال له قائل : ألا تغيروه ؟ فقال : دعوه فإنه لا يحرم حلالا ولا يحلل حراما . القول الأول من الأقوال الستة أنها لغة بني الحارث بن كعب وزبيد وخثعم وكنانة بن زيد يجعلون رفع الاثنين ونصبه وخفضه بالألف ؛ يقولون : جاء الزيدان ورأيت الزيدان ومررت بالزيدان ، ومنه قوله تعالى : ولا أدراكم به على ما تقدم . وأنشد الفراء لرجل من بني أسد - قال : وما رأيت أفصح منه :\nفأطرق إطراق الشجاع ولو يرى مساغا لناباه الشجاع لصمما\nويقولون : كسرت يداه وركبت علاه ؛ يديه وعليه ؛ قال شاعرهم [ هوبر الحارثي ] :\nتزود منا بين أذناه ضربة دعته إلى هابي التراب عقم\nوقال آخر :\nطاروا علاهن فطر علاها\nأي عليهن وعليها .\nوقال آخر :\nإن أباها وأبا أباها قد بلغا في المجد غايتاها\nأي إن أبا أبيها وغايتيها . قال أبو جعفر النحاس : وهذا القول من أحسن ما حملت عليه الآية ؛ إذ كانت هذه اللغة معروفة ، وقد حكاها من يرتضى بعلمه وأمانته ؛ منهم أبو زيد الأنصاري وهو الذي يقول : إذا قال سيبويه حدثني من أثق به فإنما يعنيني ؛ وأبو الخطاب الأخفش وهو رئيس من رؤساء اللغة ، والكسائي والفراء كلهم قالوا هذا على لغة بني الحارث بن كعب . وحكى أبو عبيدة عن أبي الخطاب أن هذه لغة بني كنانة . المهدوي : وحكى غيره أنها لغة لخثعم . قال النحاس ومن أبين ما في هذا قول سيبويه : واعلم أنك إذا ثنيت الواحد زدت عليه زائدتين ، الأولى منهما حرف مد ولين وهو حرف الإعراب ؛ قال أبو جعفر فقول سيبويه : وهو حرف الإعراب ، يوجب أن الأصل ألا يتغير ، فيكون ( إن هذان ) جاء على أصله ليعلم ذلك ، وقد قال تعالى : استحوذ عليهم الشيطان ولم يقل استحاذ ؛ فجاء هذا ليدل على الأصل ، وكذلك ( إن هذان ) ولا يفكر في إنكار من أنكر هذه اللغة إذا كان الأئمة قد رووها . القول الثاني أن يكون ( إن ) بمعنى نعم ؛ كما حكى الكسائي عن عاصم قال : العرب تأتي ب إن بمعنى نعم ، وحكى سيبويه أن ( إن ) تأتي بمعنى أجل ، وإلى هذا القول كان محمد بن يزيد وإسماعيل بن إسحاق القاضي يذهبان ؛ قال النحاس : ورأيت أبا إسحاق الزجاج وعلي بن سليمان يذهبان إليه . الزمخشري : وقد أعجب به أبو إسحاق . النحاس : وحدثنا علي بن سليمان ، قال حدثنا عبد الله بن أحمد بن عبد السلام النيسابوري ، ثم لقيت عبد الله بن أحمد فحدثني ، قال حدثني عمير بن المتوكل ، قال حدثنا محمد بن موسى النوفلي من ولد حارث بن عبد المطلب ، قال حدثنا عمر بن جميع الكوفي عن جعفر بن محمد عن أبيه عن علي - وهو ابن الحسين - عن أبيه عن علي بن أبي طالب رضوان الله عليهم أجمعين ، قال : لا أحصي كم سمعت رسول الله - صلى الله عليه وسلم - يقول على منبره : إن الحمد لله نحمده ونستعينه ثم يقول : أنا أفصح قريش كلها وأفصحها بعدي أبان بن سعيد بن العاص قال أبو محمد الخفاف قال عمير : إعرابه عند أهل العربية والنحو إن الحمد لله بالنصب إلا أن العرب تجعل ( إن ) في معنى نعم كأنه أراد - صلى الله عليه وسلم - ؛ نعم الحمد لله ؛ وذلك أن خطباء الجاهلية كانت تفتتح خطبها بنعم . وقال الشاعر في معنى نعم :\nقالوا غدرت فقلت إن وربما نال العلا وشفى الغليل الغادر\nوقال عبد الله بن قيس الرقيات :\nبكر العواذل في الصبا ح يلمنني وألومهنه\nويقلن شيب قد علا ك وقد كبرت فقلت إنه\nفعلى هذا جائز أن يكون قول الله - عز وجل - : إن هذان لساحران بمعنى نعم ولا تنصب . قال النحاس : أنشدني داود بن الهيثم ، قال : أنشدني ثعلب :\nليت شعري هل للمحب شفاء من جوى حبهن إن اللقاء\nقال النحاس : وهذا قول حسن إلا أن فيه شيئا لأنه إنما يقال : نعم زيد خارج ، ولا تكاد تقع اللام هاهنا ، وإن كان النحويون قد تكلموا في ذلك فقالوا : اللام ينوى بها التقديم ؛ كما قال :\nخالي لأنت ومن جرير خاله ينل العلاء ويكرم الأخوالا\nآخر :\nأم الحليس لعجوز شهربه ترضى من الشاة بعظم الرقبه\nأي لخالي ولأم الحليس ؛ وقال الزجاج : والمعنى في الآية إن هذان لهما ساحران ثم حذف المبتدأ . المهدوي : وأنكره أبو علي وأبو الفتح بن جني . قال أبو الفتح : ( هما ) المحذوف لم يحذف إلا بعد أن عرف ، وإذا كان معروفا فقد استغني بمعرفته عن تأكيده باللام ، ويقبح أن تحذف المؤكد وتترك المؤكد . القول الثالث قال الفراء أيضا : وجدت الألف دعامة ليست بلام الفعل فزدت عليها نونا ولم أغيرها كما قلت : ( الذي ) ثم زدت عليه نونا فقلت : جاءني الذين عندك ، ورأيت الذين عندك ، ومررت بالذين عندك القول الرابع قاله بعض الكوفيين قال : الألف في ( هذان ) مشبهة بالألف في يفعلان فلم تغير . القول الخامس : قال أبو إسحاق : النحويون القدماء يقولون الهاء هاهنا مضمرة ، والمعنى إنه هذان لساحران ؛ قال ابن الأنباري : فأضمرت الهاء التي هي منصوب ( إن ) و ( هذان ) خبر ( إن ) و ( ساحران ) يرفعها ( هما ) المضمر ، والتقدير : إنه هذان لهما ساحران . والأشبه عند أصحاب أهل هذا الجواب أن الهاء اسم ( إن ) و ( هذان ) رفع بالابتداء وما بعده خبر الابتداء . القول السادس قال أبو جعفر النحاس وسألت أبا الحسن بن كيسان عن هذه الآية ، فقال : إن شئت أجبتك بجواب النحويين ، وإن شئت أجبتك بقولي ؛ فقلت بقولك ؛ فقال : سألنيإسماعيل بن إسحاق عنها فقلت . القول عندي أنه لما كان يقال ( هذا ) في موضع الرفع والنصب والخفض على حال واحدة ، وكانت التثنية يجب ألا يغير لها الواحد أجريت التثنية مجرى الواحدة ؛ فقال ما أحسن هذا لو تقدمك أحد بالقول به حتى يؤنس به ؛ قال ابن كيسان : فقلت له : فيقول القاضي به حتى يؤنس به ؛ فتبسم .\nقوله تعالى : يريدان أن يخرجاكم من أرضكم بسحرهما ويذهبا بطريقتكم المثلى هذا من قول فرعون للسحرة ؛ أي غرضهما إفساد دينكم الذي أنتم عليه ؛ كما قال فرعون : إني أخاف أن يبدل دينكم أو أن يظهر في الأرض الفساد . ويقال : فلان حسن الطريقة أي حسن المذهب . وقيل : طريقة القوم أفضل القول ؛ وهذا الذي ينبغي أن يسلكوا طريقته ويقتدوا به ؛ فالمعنى : ويذهبا بسادتكم ورؤسائكم ؛ استمالة لهم . أو يذهبا ببني إسرائيل وهم الأماثل وإن كانوا خولا لكم لما يرجعون إليه من الانتساب إلى الأنبياء . أو يذهبا بأهل طريقتكم فحذف المضاف . و المثلى تأنيث الأمثل ؛ كما يقال الأفضل والفضلى . وأنث الطريقة على اللفظ ، وإن كان يراد بها الرجال . ويجوز أن يكون التأنيث على الجماعة . وقال الكسائي : بطريقتكم بسنتكم وسمتكم . والمثلى نعت كقولك امرأة كبرى . تقول العرب : فلان على الطريقة المثلى يعنون على الهدى المستقيم .\n                                    ",
        "saadi": "قَالُوٓاْ إِنۡ هَٰذَٰنِ لَسَٰحِرَٰنِ يُرِيدَانِ أَن يُخۡرِجَاكُم مِّنۡ أَرۡضِكُم بِسِحۡرِهِمَا وَيَذۡهَبَا بِطَرِيقَتِكُمُ ٱلۡمُثۡلَىٰ ٣٦\n                                        \n                                        \n                                        \n                                        والنجوى التي أسروها فسرها بقوله: { قَالُوا إِنْ هَذَانِ لَسَاحِرَانِ يُرِيدَانِ أَنْ يُخْرِجَاكُمْ مِنْ أَرْضِكُمْ بِسِحْرِهِمَا وَيَذْهَبَا بِطَرِيقَتِكُمُ الْمُثْلَى } كمقالة فرعون السابقة، فإما أن يكون ذلك توافقا من فرعون والسحرة على هذه المقالة من غير قصد، وإما أن يكون تلقينا منه لهم مقالته، التي صمم عليها وأظهرها للناس، وزادوا على قول فرعون أن قالوا: { وَيَذْهَبَا بِطَرِيقَتِكُمُ الْمُثْلَى } أي: طريقة السحر حسدكم عليها، وأراد أن يظهر عليكم، ليكون له الفخر والصيت والشهرة، ويكون هو المقصود بهذا العلم، الذي أشغلتم زمانكم فيه، ويذهب عنكم ما كنتم تأكلون بسببه، وما يتبع ذلك من الرياسة، وهذا حض من بعضهم على بعض على الاجتهاد في مغالبته\n                                    "
      },
      "originalText": "قَالُوٓاْ إِنۡ هَٰذَٰنِ لَسَٰحِرَٰنِ يُرِيدَانِ أَن يُخۡرِجَاكُم مِّنۡ أَرۡضِكُم بِسِحۡرِهِمَا وَيَذۡهَبَا بِطَرِيقَتِكُمُ ٱلۡمُثۡلَىٰ ٣٦"
    },
    {
      "number": 2412,
      "text": "فَأَجْمِعُوا كَيْدَكُمْ ثُمَّ ائْتُوا صَفًّا ۚ وَقَدْ أَفْلَحَ الْيَوْمَ مَنِ اسْتَعْلَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 64,
      "juz": 16,
      "manzil": 4,
      "page": 315,
      "ruku": 272,
      "hizbQuarter": 126,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَأَجۡمِعُواْ كَيۡدَكُمۡ ثُمَّ ٱئۡتُواْ صَفّٗاۚ وَقَدۡ أَفۡلَحَ ٱلۡيَوۡمَ مَنِ ٱسۡتَعۡلَىٰ ٤٦\n                                    \n                                    \n                                    وقوله ( فأجمعوا كيدكم ثم ائتوا صفا ) أي اجتمعوا كلكم صفا واحدا ، وألقوا ما في أيديكم مرة واحدة ، لتبهروا الأبصار ، وتغلبوا هذا وأخاه ، ( وقد أفلح اليوم من استعلى ) أي : منا ومنه ، أما نحن فقد وعدنا هذا الملك العطاء الجزيل ، وأما هو فينال الرياسة العظيمة .\n                                    ",
        "qortoby": "فَأَجۡمِعُواْ كَيۡدَكُمۡ ثُمَّ ٱئۡتُواْ صَفّٗاۚ وَقَدۡ أَفۡلَحَ ٱلۡيَوۡمَ مَنِ ٱسۡتَعۡلَىٰ ٤٦\n                                    \n                                    \n                                    قوله تعالى : فأجمعوا كيدكم الإجماع الإحكام والعزم على الشيء . تقول : أجمعت الخروج وعلى الخروج أي عزمت . وقراءة كل الأمصار فأجمعوا إلا أبا عمرو فإنه قرأ ( فاجمعوا ) بالوصل وفتح الميم . واحتج بقوله : فجمع كيده ثم أتى . قال النحاس وفيما حكي لي عن محمد بن يزيد أنه قال : يجب على أبي عمرو أن يقرأ بخلاف قراءته هذه ، وهي القراءة التي عليها أكثر الناس . قال : لأنه احتج ب ( جمع ) وقوله - عز وجل - : فجمع كيده قد ثبت هذا فيبعد أن يكون بعده ( فاجمعوا ) ويقرب أن يكون بعده فأجمعوا أي اعزموا وجدوا ؛ ولما تقدم ذلك وجب أن يكون هذا بخلاف معناه يقال : أمر مجمع ومجمع عليه . قال النحاس : ويصحح قراءة أبي عمرو ( فاجمعوا ) أي اجمعوا كل كيد لكم وكل حيلة فضموه مع أخيه . وقاله أبو إسحاق . الثعلبي : القراءة بقطع الألف وكسر الميم لها وجهان : أحدهما : بمعنى الجمع ، تقول : أجمعت الشيء جمعته بمعنى واحد ، وفي الصحاح : وأجمعت الشيء جعلته جميعا ؛ قال أبو ذؤيب يصف حمرا :\nفكأنها بالجزع بين نبايع وأولات ذي العرجاء نهب مجمع\nأي مجموع . والثاني : أنه بمعنى العزم والإحكام ؛ قال الشاعر :\nيا ليت شعري والمنى لا تنفع هل أغدون يوما وأمري مجمع\nأي محكم . ثم ائتوا صفا قال مقاتل والكلبي : جميعا . وقيل : صفوفا ليكون أشد لهيبتكم وهو منصوب بوقوع الفعل عليه على قول أبي عبيدة ؛ قال يقال : أتيت الصف يعني المصلى ؛ فالمعنى عنده ائتوا الموضع الذي تجتمعون فيه يوم العيد . وحكي عن بعض فصحاء العرب : ما قدرت أن آتي الصف ؛ يعني المصلى . وقال الزجاج : يجوز أن يكون المعنى ثم ائتوا والناس مصطفون ؛ فيكون على هذا مصدرا في موضع الحال . ولذلك لم يجمع . وقرئ ( ثم ايتوا ) بكسر الميم وياء . ومن ترك الهمزة أبدل من الهمزة ألفا . وقد أفلح اليوم من استعلى أي من غلب . وهذا كله من قول السحرة بعضهم لبعض . وقيل : من قول فرعون لهم .\n                                    ",
        "saadi": "فَأَجۡمِعُواْ كَيۡدَكُمۡ ثُمَّ ٱئۡتُواْ صَفّٗاۚ وَقَدۡ أَفۡلَحَ ٱلۡيَوۡمَ مَنِ ٱسۡتَعۡلَىٰ ٤٦\n                                        \n                                        \n                                        \n                                        { فَأَجْمِعُوا كَيْدَكُمْ } أي: أظهروه دفعة واحدة متظاهرين متساعدين فيه، متناصرين، متفقا رأيكم وكلمتكم، { ثُمَّ ائْتُوا صَفًّا } ليكون أمكن لعملكم، وأهيب لكم في القلوب، ولئلا يترك بعضكم بعض مقدوره من العمل، واعلموا أن من أفلح اليوم ونجح وغلب غيره، فإنه المفلح الفائز، فهذا يوم له ما بعده من الأيام\nفلله درهم ما أصلبهم في باطلهم، وأشدهم فيه، حيث أتوا بكل سبب، ووسيلة وممكن، ومكيدة يكيدون بها الحق، ويأبى الله إلا أن يتم نوره، ويظهر الحق على الباطل\n                                    "
      },
      "originalText": "فَأَجۡمِعُواْ كَيۡدَكُمۡ ثُمَّ ٱئۡتُواْ صَفّٗاۚ وَقَدۡ أَفۡلَحَ ٱلۡيَوۡمَ مَنِ ٱسۡتَعۡلَىٰ ٤٦"
    }
  ]
}