{
  "number": 32,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 210,
      "text": "۞ وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ ۚ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ ۚ لِمَنِ اتَّقَىٰ ۗ وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 203,
      "juz": 2,
      "manzil": 1,
      "page": 32,
      "ruku": 26,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱذۡكُرُواْ ٱللَّهَ فِيٓ أَيَّامٖ مَّعۡدُودَٰتٖۚ فَمَن تَعَجَّلَ فِي يَوۡمَيۡنِ فَلَآ إِثۡمَ عَلَيۡهِ وَمَن تَأَخَّرَ فَلَآ إِثۡمَ عَلَيۡهِۖ لِمَنِ ٱتَّقَىٰۗ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّكُمۡ إِلَيۡهِ تُحۡشَرُونَ ٣٠٢\n                                    \n                                    \n                                    قال ابن عباس : \" الأيام المعدودات \" أيام التشريق ، و \" الأيام المعلومات \" أيام العشر . وقال عكرمة : ( واذكروا الله في أيام معدودات ) يعني : التكبير أيام التشريق بعد الصلوات المكتوبات : الله أكبر ، الله أكبر .\nوقال الإمام أحمد : حدثنا وكيع ، حدثنا موسى بن علي ، عن أبيه ، قال : سمعت عقبة بن عامر قال : قال رسول الله صلى الله عليه وسلم : \" يوم عرفة ويوم النحر وأيام التشريق عيدنا أهل الإسلام ، وهي أيام أكل وشرب \" .\nوقال الإمام أحمد أيضا : حدثنا هشيم ، أخبرنا خالد ، عن أبي المليح ، عن نبيشة الهذلي قال : قال رسول الله صلى الله عليه وسلم : \" أيام التشريق أيام أكل وشرب وذكر الله \" . رواه مسلم أيضا وتقدم حديث جبير بن مطعم : \" عرفة كلها موقف ، وأيام التشريق كلها ذبح \" . وتقدم [ أيضا ] حديث عبد الرحمن بن يعمر الديلي \" وأيام منى ثلاثة ، فمن تعجل في يومين فلا إثم عليه ، ومن تأخر فلا إثم عليه \" .\nوقال ابن جرير : حدثنا يعقوب بن إبراهيم وخلاد بن أسلم ، قالا حدثنا هشيم ، عن عمرو بن أبي سلمة ، عن أبيه ، عن أبي هريرة : أن رسول الله صلى الله عليه وسلم قال : \" أيام التشريق أيام طعم وذكر \" .\nوحدثنا خلاد بن أسلم ، حدثنا روح ، حدثنا صالح ، حدثني ابن شهاب ، عن سعيد بن المسيب ، عن أبي هريرة أن رسول الله صلى الله عليه وسلم بعث عبد الله بن حذافة يطوف في منى : \" لا تصوموا هذه الأيام ، فإنها أيام أكل وشرب ، وذكر الله ، عز وجل \" .\nوحدثنا يعقوب ، حدثنا هشيم ، عن سفيان بن حسين ، عن الزهري ، قال : بعث رسول الله صلى الله عليه وسلم عبد الله بن حذافة ، فنادى في أيام التشريق فقال : \" إن هذه الأيام أيام أكل وشرب وذكر الله ، إلا من كان عليه صوم من هدي \" .\nزيادة حسنة ولكن مرسلة . وبه قال هشيم ، عن عبد الملك بن أبي سليمان ، عن عمرو بن دينار : أن رسول الله صلى الله عليه وسلم بعث بشر بن سحيم ، فنادى في أيام التشريق فقال : \" إن هذه الأيام أيام أكل وشرب وذكر الله \" .\nوقال هشيم ، عن ابن أبي ليلى ، عن عطاء ، عن عائشة قالت : نهى رسول الله صلى الله عليه وسلم عن صوم أيام التشريق ، قال : \" هي أيام أكل وشرب وذكر الله \" .\nوقال محمد بن إسحاق ، عن حكيم بن حكيم ، عن مسعود بن الحاكم الزرقي ، عن أمه قالت : لكأني أنظر إلى علي على بغلة رسول الله صلى الله عليه وسلم البيضاء ، حتى وقف على شعب الأنصار وهو يقول : \" يا أيها الناس ، إنها ليست بأيام صيام ، إنما هي أيام أكل وشرب وذكر \" .\nوقال مقسم عن ابن عباس : الأيام المعدودات : أيام التشريق ، أربعة أيام : يوم النحر ، وثلاثة [ أيام ] بعده ، وروي عن ابن عمر ، وابن الزبير ، وأبي موسى ، وعطاء ، ومجاهد ، وعكرمة ، وسعيد بن جبير ، وأبي مالك ، وإبراهيم النخعي ، [ ويحيى بن أبي كثير ] والحسن ، وقتادة ، والسدي ، والزهري ، والربيع بن أنس ، والضحاك ، ومقاتل بن حيان ، وعطاء الخراساني ، ومالك بن أنس ، وغيرهم مثل ذلك .\nوقال علي بن أبي طالب : هي ثلاثة ، يوم النحر ويومان بعده ، اذبح في أيهن شئت ، وأفضلها أولها .\nوالقول الأول هو المشهور وعليه دل ظاهر الآية الكريمة ، حيث قال : ( فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه ) فدل على ثلاثة بعد النحر .\nويتعلق بقوله : ( واذكروا الله في أيام معدودات ( ذكر الله على الأضاحي ، وقد تقدم ، وأن الراجح في ذلك مذهب الشافعي ، رحمه الله ، وهو أن وقت الأضحية من يوم النحر إلى آخر أيام التشريق . ويتعلق به أيضا الذكر المؤقت خلف الصلوات ، والمطلق في سائر الأحوال . وفي وقته أقوال للعلماء ، وأشهرها الذي عليه العمل أنه من صلاة الصبح يوم عرفة إلى صلاة العصر من آخر أيام التشريق ، وهو آخر النفر الآخر . وقد جاء فيه حديث رواه الدارقطني ، ولكن لا يصح مرفوعا والله أعلم . وقد ثبت أن عمر بن الخطاب ، رضي الله عنه ، كان يكبر في قبته ، فيكبر أهل السوق بتكبيره ، حتى ترتج منى تكبيرا .\nويتعلق بذلك أيضا التكبير وذكر الله عند رمي الجمرات كل يوم من أيام التشريق . وقد جاء في الحديث الذي رواه أبو داود وغيره : \" إنما جعل الطواف بالبيت ، والسعي بين الصفا والمروة ورمي الجمار ، لإقامة ذكر الله عز وجل \" .\nولما ذكر الله تعالى النفر الأول والثاني ، وهو تفرق الناس من موسم الحج إلى سائر الأقاليم والآفاق بعد اجتماعهم في المشاعر والمواقف ، قال : ( واتقوا الله واعلموا أنكم إليه تحشرون ) [ أي : تجتمعون يوم القيامة ] ، كما قال : ( وهو الذي ذرأكم في الأرض وإليه تحشرون ) [ المؤمنون : 79 ] .\n                                    ",
        "qortoby": "وَٱذۡكُرُواْ ٱللَّهَ فِيٓ أَيَّامٖ مَّعۡدُودَٰتٖۚ فَمَن تَعَجَّلَ فِي يَوۡمَيۡنِ فَلَآ إِثۡمَ عَلَيۡهِ وَمَن تَأَخَّرَ فَلَآ إِثۡمَ عَلَيۡهِۖ لِمَنِ ٱتَّقَىٰۗ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّكُمۡ إِلَيۡهِ تُحۡشَرُونَ ٣٠٢\n                                    \n                                    \n                                    واذكروا الله في أيام معدودات فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه لمن اتقى واتقوا الله واعلموا أنكم إليه تحشرون\nقوله تعالى : واذكروا الله في أيام معدودات فيه ست مسائل\nالأولى : قال الكوفيون : الألف والتاء في \" معدودات \" لأقل العدد . وقال البصريون : هما للقليل والكثير ، بدليل قوله تعالى : \" وهم في الغرفات آمنون \" ، والغرفات كثيرة . ولا خلاف بين العلماء أن الأيام المعدودات في هذه الآية هي أيام منى ، وهي أيام التشريق ، وأن هذه الثلاثة الأسماء واقعة عليها ، وهي أيام رمي الجمار ، وهي واقعة على الثلاثة الأيام التي يتعجل الحاج منها في يومين بعد يوم النحر ، فقف على ذلك . وقال الثعلبي وقال إبراهيم : الأيام المعدودات أيام العشر ، والأيام المعلومات أيام النحر ، وكذا حكى مكي والمهدوي أن الأيام المعدودات هي أيام العشر . ولا يصح لما ذكرناه من الإجماع على ما نقله أبو عمر بن عبد البر وغيره . قال ابن عطية : وهذا إما أن يكون من تصحيف النسخة ، وإما أن يريد العشر الذي بعد النحر ، وفى ذلك بعد .\nالثانية : أمر الله - سبحانه وتعالى - عباده بذكره في الأيام المعدودات ، وهي الثلاثة التي بعد يوم النحر ، وليس يوم النحر منها ؛ لإجماع الناس أنه لا ينفر أحد يوم النفر وهو ثاني يوم النحر ، ولو كان يوم النحر في المعدودات لساغ أن ينفر من شاء متعجلا يوم النفر ؛ لأنه قد أخذ يومين من المعدودات . خرج الدارقطني والترمذي وغيرهما عن عبد الرحمن بن يعمر الديلي أن ناسا من أهل نجد أتوا رسول الله صلى الله عليه وسلم وهو بعرفة فسألوه ، فأمر مناديا فنادى : الحج عرفة ، فمن جاء ليلة جمع قبل طلوع الفجر فقد أدرك ، أيام منى ثلاثة فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه ، أي من تعجل من الحاج في يومين من أيام منى صار مقامه بمنى ثلاثة أيام بيوم النحر ، ويصير جميع رميه بتسع وأربعين حصاة ، ويسقط عنه رمي يوم الثالث . ومن لم ينفر منها إلا في آخر اليوم الثالث حصل له بمنى مقام أربعة أيام من أجل يوم النحر ، واستوفى العدد في الرمي ، على ما يأتي بيانه . ومن الدليل على أن أيام منى ثلاثة - مع ما ذكرناه - قول العرجي :\nما نلتقي إلا ثلاث منى حتى يفرق بيننا النفر\nفأيام الرمي معدودات ، وأيام النحر معلومات . وروى نافع عن ابن عمر أن الأيام المعدودات والأيام المعلومات يجمعها أربعة أيام : يوم النحر وثلاثة أيام بعده ، فيوم النحر معلوم غير معدود ، واليومان بعده معلومان معدودان ، واليوم الرابع معدود لا معلوم ، وهذا مذهب مالك وغيره .\nوإنما كان كذلك لأن الأول ليس من الأيام التي تختص بمنى في قوله سبحانه وتعالى : واذكروا الله في أيام معدودات ولا من التي عين النبي صلى الله عليه وسلم بقوله : أيام منى ثلاثة فكان معلوما ؛ لأن الله تعالى قال : ويذكروا اسم الله في أيام معلومات على ما رزقهم من بهيمة الأنعام ولا خلاف أن المراد به النحر ، وكان النحر في اليوم الأول وهو يوم الأضحى والثاني والثالث ، ولم يكن في الرابع نحر بإجماع من علمائنا ، فكان الرابع غير مراد في قوله تعالى : \" معلومات \" لأنه لا ينحر فيه وكان مما يرمى فيه ، فصار معدودا لأجل الرمي ، غير معلوم لعدم النحر فيه . قال ابن العربي : والحقيقة فيه أن يوم النحر معدود بالرمي معلوم بالذبح ، لكنه عند علمائنا ليس مرادا في قوله تعالى : واذكروا الله في أيام معدودات فمن تعجل . وقال أبو حنيفة والشافعي : ( الأيام المعلومات العشر من أول يوم من ذي الحجة ، وآخرها يوم النحر ) ، لم يختلف قولهما في ذلك ، ورويا ذلك عن ابن عباس . وروى الطحاوي عن أبي يوسف أن الأيام المعلومات أيام النحر . قال أبو يوسف : روي ذلك عن عمر وعلي ، وإليه أذهب ؛ لأنه تعالى قال : ويذكروا اسم الله في أيام معلومات على ما رزقهم من بهيمة الأنعام . وحكى الكرخي عن محمد بن الحسن أن الأيام المعلومات أيام النحر الثلاثة : يوم الأضحى ويومان بعده . قال الكيا الطبري : فعلى قول أبي يوسف ومحمد لا فرق بين المعلومات والمعدودات ؛ لأن المعدودات المذكورة في القرآن أيام التشريق بلا خلاف ، ولا يشك أحد أن المعدودات لا تتناول أيام العشر ؛ لأن الله تعالى يقول : فمن تعجل في يومين فلا إثم عليه وليس في العشر حكم يتعلق بيومين دون الثالث . وقد روي عن ابن عباس ( أن المعلومات العشر ، والمعدودات أيام التشريق ) ، وهو قول الجمهور .\nقلت : وقال ابن زيد : الأيام المعلومات عشر ذي الحجة وأيام التشريق ، وفيه بعد ؛ لما ذكرناه ، وظاهر الآية يدفعه . وجعل الله الذكر في الأيام المعدودات والمعلومات يدل على خلاف قوله ، فلا معنى للاشتغال به .\nالثالثة : ولا خلاف أن المخاطب بهذا الذكر هو الحاج ، خوطب بالتكبير عند رمي الجمار ، وعلى ما رزق من بهيمة الأنعام في الأيام المعلومات وعند أدبار الصلوات دون تلبية ، وهل يدخل غير الحاج في هذا أم لا ؟ فالذي عليه فقهاء الأمصار والمشاهير من الصحابة والتابعين على أن المراد بالتكبير كل أحد - وخصوصا في أوقات الصلوات - فيكبر عند انقضاء كل صلاة - كان المصلي وحده أو في جماعة - تكبيرا ظاهرا في هذه الأيام ، اقتداء بالسلف رضي الله عنهم . وفي المختصر : ولا يكبر النساء دبر الصلوات ، والأول أشهر ؛ لأنه يلزمها حكم الإحرام كالرجل ، قاله في المدونة .\nالرابعة : ومن نسي التكبير بإثر صلاة كبر إن كان قريبا ، وإن تباعد فلا شيء عليه ، قاله ابن الجلاب . وقال مالك في المختصر : يكبر ما دام في مجلسه ، فإذا قام من مجلسه فلا شيء عليه . وفي المدونة من قول مالك : إن نسي الإمام التكبير فإن كان قريبا قعد فكبر ، وإن تباعد فلا شيء عليه ، وإن ذهب ولم يكبر والقوم جلوس فليكبروا .\nالخامسة : واختلف العلماء في طرفي مدة التكبير فقال عمر بن الخطاب وعلي بن أبي طالب وابن عباس : ( يكبر من صلاة الصبح يوم عرفة إلى العصر من آخر أيام التشريق ) . وقال ابن مسعود وأبو حنيفة : يكبر من غداة عرفة إلى صلاة العصر من يوم النحر ؛ وخالفه صاحباه فقالا بالقول الأول قول عمر وعلي وابن عباس رضي الله عنهم ، فاتفقوا في الابتداء دون الانتهاء . وقال مالك : يكبر من صلاة الظهر يوم النحر إلى صلاة الصبح من آخر أيام التشريق . وبه قال الشافعي ، وهو قول ابن عمر وابن عباس أيضا . وقال زيد بن ثابت : ( يكبر من ظهر يوم النحر إلى آخر أيام التشريق ) . قال ابن العربي : فأما من قال : يكبر يوم عرفة ويقطع العصر من يوم النحر فقد خرج عن الظاهر ؛ لأن الله تعالى قال : في أيام معدودات وأيامها ثلاثة ، وقد قال هؤلاء : يكبر في يومين ، فتركوا الظاهر لغير دليل . وأما من قال : يوم عرفة وأيام التشريق فقال : إنه قال : فإذا أفضتم من عرفات ، فذكر عرفات داخل في ذكر الأيام ، هذا كان يصح لو كان قال : يكبر من المغرب يوم عرفة ؛ لأن وقت الإفاضة حينئذ ، فأما قبل فلا يقتضيه ظاهر اللفظ ، ويلزمه أن يكون من يوم التروية عند الحلول بمنى .\nالسادسة : واختلفوا في لفظ التكبير ، فمشهور مذهب مالك أنه يكبر إثر كل صلاة ثلاث تكبيرات ، رواه زياد بن زياد عن مالك . وفي المذهب رواية : يقال بعد التكبيرات الثلاث : لا إله إلا الله ، والله أكبر ولله الحمد . وفي المختصر عن مالك : الله أكبر الله أكبر ، لا إله إلا الله ، والله أكبر ، الله أكبر ولله الحمد .\nقوله تعالى : فمن تعجل في يومين فلا إثم عليه فيه إحدى وعشرون مسألة : الأولى : قوله تعالى : فمن تعجل التعجيل أبدا لا يكون هنا إلا في آخر النهار ، وكذلك اليوم الثالث ؛ لأن الرمي في تلك الأيام إنما وقته بعد الزوال . وأجمعوا على أن يوم النحر لا يرمى فيه غير جمرة العقبة ؛ لأن رسول الله صلى الله عليه وسلم لم يرم يوم النحر من الجمرات غيرها ، ووقتها من طلوع الشمس إلى الزوال ، وكذلك أجمعوا أن وقت رمي الجمرات في أيام التشريق بعد الزوال إلى الغروب ، واختلفوا فيمن رمى جمرة العقبة قبل طلوع الفجر أو بعد طلوع الفجر قبل طلوع الشمس . فقال مالك وأبو حنيفة وأحمد وإسحاق : جائز رميها بعد الفجر قبل طلوع الشمس . وقال مالك : لم يبلغنا أن رسول الله صلى الله عليه وسلم رخص لأحد برمي قبل أن يطلع الفجر ، ولا يجوز رميها قبل الفجر ، فإن رماها قبل الفجر أعادها . وكذلك قال أبو حنيفة وأصحابه : لا يجوز رميها ، وبه قال أحمد وإسحاق . ورخصت طائفة في الرمي قبل طلوع الفجر ، روي عن أسماء بنت أبي بكر أنها كانت ترمي بالليل وتقول : إنا كنا نصنع هذا على عهد رسول الله صلى الله عليه وسلم ، أخرجه أبو داود . وروي هذا القول عن عطاء وابن أبي مليكة وعكرمة بن خالد ، وبه قال الشافعي إذا كان الرمي بعد نصف الليل . وقالت طائفة : لا يرمى حتى تطلع الشمس ، قاله مجاهد والنخعي والثوري . وقال أبو ثور : إن رماها قبل طلوع الشمس فإن اختلفوا فيه لم يجزه ، وإن أجمعوا أو كانت فيه سنة أجزأه . قال أبو عمر : أما قول الثوري ومن تابعه فحجته أن رسول الله صلى الله عليه وسلم رمى الجمرة بعد طلوع الشمس وقال : خذوا عني مناسككم . وقال ابن المنذر : السنة ألا ترمي إلا بعد طلوع الشمس ، ولا يجزئ الرمي قبل طلوع الفجر ، فإن رمى أعاد ، إذ فاعله مخالف لما سنه الرسول صلى الله عليه وسلم لأمته . ومن رماها بعد طلوع الفجر قبل طلوع الشمس فلا إعادة عليه ، إذ لا أعلم أحدا قال لا يجزئه .\nالثانية : روى معمر قال أخبرني هشام بن عروة عن أبيه قال : أمر رسول الله صلى الله عليه وسلم أم سلمة أن تصبح بمكة يوم النحر ، وكان يومها . قال أبو عمر : اختلف على هشام في هذا الحديث ، فروته طائفة عن هشام عن أبيه مرسلا ، كما رواه معمر ، ورواه آخرون عن هشام عن أبيه عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم أمر أم سلمة بذلك مسندا ، ورواه آخرون عن هشام عن أبيه عن زينب بنت أبي سلمة عن أم سلمة مسندا أيضا ، وكلهم ثقات . وهو يدل على أنها رمت الجمرة بمنى قبل الفجر ؛ لأن رسول الله صلى الله عليه وسلم أمرها أن تصبح بمكة يوم النحر ، وهذا لا يكون إلا وقد رمت الجمرة بمنى ليلا قبل الفجر ، والله أعلم . ورواه أبو داود قال حدثنا هارون بن عبد الله قال حدثنا ابن أبي فديك عن الضحاك بن عثمان عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها أنها قالت : أرسل رسول الله صلى الله عليه وسلم بأم سلمة ليلة النحر فرمت الجمرة قبل الفجر ثم مضت فأفاضت ، وكان ذلك اليوم اليوم الذي يكون رسول الله صلى الله عليه وسلم عندها . وإذا ثبت فالرمي بالليل جائز لمن فعله ، والاختيار من طلوع الشمس إلى زوالها . قال أبو عمر : أجمعوا على أن وقت الاختيار في رمي جمرة العقبة من طلوع الشمس إلى زوالها ، وأجمعوا أنه إن رماها قبل غروب الشمس من يوم النحر فقد أجزأ عنه ولا شيء عليه ، إلا مالكا فإنه قال : أستحب له إن ترك جمرة العقبة حتى أمسى أن يهريق دما يجيء به من الحل . واختلفوا فيمن لم يرمها حتى غابت الشمس فرماها من الليل أو من الغد ، فقال مالك : عليه دم ، واحتج بأن رسول الله صلى الله عليه وسلم وقت لرمي الجمرة وقتا ، وهو يوم النحر ، فمن رمى بعد غروب الشمس فقد رماها بعد خروج وقتها ، ومن فعل شيئا في الحج بعد وقته فعليه دم . وقال الشافعي : لا دم عليه ، وهو قول أبي يوسف ومحمد ، وبه قال أبو ثور ؛ لأن النبي صلى الله عليه وسلم قال له السائل : يا رسول الله ، رميت بعدما أمسيت فقال : لا حرج ، قال مالك : من نسي رمي الجمار حتى يمسي فليرم أية ساعة ذكر من ليل أو نهار ، كما يصلي أية ساعة ذكر ، ولا يرمي إلا ما فاته خاصة ، وإن كانت جمرة واحدة رماها ، ثم يرمي ما رمى بعدها من الجمار ، فإن الترتيب في الجمار واجب ، فلا يجوز أن يشرع في رمي جمرة حتى يكمل رمي الجمرة الأولى كركعات الصلاة ، هذا هو المشهور من المذهب . وقيل : ليس الترتيب بواجب في صحة الرمي ، بل إذا كان الرمي كله في وقت الأداء أجزأه .\nالثالثة : فإذا مضت أيام الرمي فلا رمي فإن ذكر بعدما يصدر وهو بمكة أو بعدما يخرج منها فعليه الهدي ، وسواء ترك الجمار كلها ، أو جمرة منها ، أو حصاة من جمرة حتى خرجت أيام منى فعليه دم . وقال أبو حنيفة : إن ترك الجمار كلها فعليه دم ، وإن ترك جمرة واحدة كان عليه بكل حصاة من الجمرة إطعام مسكين نصف صاع ، إلى أن يبلغ دما فيطعم ما شاء ، إلا جمرة العقبة فعليه دم . وقال الأوزاعي : يتصدق إن ترك حصاة . وقال الثوري : يطعم في الحصاة والحصاتين والثلاث ، فإن ترك أربعا فصاعدا فعليه دم . وقال الليث : في الحصاة الواحدة دم ، وهو أحد قولي الشافعي . والقول الآخر وهو المشهور : إن في الحصاة الواحدة مدا من طعام ، وفي حصاتين مدين ، وفي ثلاث حصيات دم .\nالرابعة : ولا سبيل عند الجميع إلى رمي ما فاته من الجمار في أيام التشريق حتى غابت الشمس من آخرها ، وذلك اليوم الرابع من يوم النحر ، وهو الثالث من أيام التشريق ، ولكن يجزئه الدم أو الإطعام على حسب ما ذكرنا .\nالخامسة : ولا تجوز البيتوتة بمكة وغيرها عن منى ليالي التشريق ، فإن ذلك غير جائز عند الجميع إلا للرعاء ، ولمن ولي السقاية من آل العباس . قال مالك : من ترك المبيت ليلة من ليالي منى من غير الرعاء وأهل السقاية فعليه دم . روى البخاري عن ابن عمر أن العباس استأذن النبي صلى الله عليه وسلم ليبيت بمكة ليالي منى من أجل سقايته فأذن له . قال ابن عبد البر : كان العباس ينظر في السقاية ويقوم بأمرها ، ويسقي الحاج شرابها أيام الموسم ، فلذلك أرخص له في المبيت عن منى ، كما أرخص لرعاء الإبل من أجل حاجتهم لرعي الإبل وضرورتهم إلى الخروج بها نحو المراعي التي تبعد عنمنى .\nوسميت منى \" منى \" لما يمنى فيها من الدماء ، أي يراق . وقال ابن عباس : ( إنما سميت منى لأن جبريل قال لآدم عليه السلام : تمن . قال : أتمنى الجنة ، فسميت منى . قال : وإنما سميت جمعا لأنه اجتمع بها حواء وآدم عليهما السلام ) ، والجمع أيضا هو المزدلفة ، وهو المشعر الحرام ، كما تقدم .\nالسادسة : وأجمع الفقهاء على أن المبيت للحاج - غير الذين رخص لهم - ليالي منى بمنى من شعائر الحج ونسكه ، والنظر يوجب على كل مسقط لنسكه دما ، قياسا على سائر الحج ونسكه . وفي الموطأ : مالك عن نافع عن ابن عمر قال : قال عمر : لا يبيتن أحد من الحاج ليالي منى من وراء العقبة . والعقبة التي منع عمر أن يبيت أحد وراءها هي العقبة التي عند الجمرة التي يرميها الناس يوم النحر مما يلي مكة . رواه ابن نافع عن مالك في المبسوط ، قال : وقال مالك : ومن بات وراءها ليالي منى فعليه الفدية ، وذلك أنه بات بغير منى ليالي منى ، وهو مبيت مشروع في الحج ، فلزم الدم بتركه كالمبيت بالمزدلفة ، ومعنى الفدية هنا عند مالك الهدي . قال مالك : هو هدي يساق من الحل إلى الحرم .\nالسابعة : روى مالك عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم عن أبيه أن أبا البداح بن عاصم بن عدي أخبره أن رسول الله صلى الله عليه وسلم أرخص لرعاء الإبل في البيتوتة عن منى يرمون يوم النحر ، ثم يرمون الغد ، ومن بعد الغد ليومين ، ثم يرمون يوم النفر .\nقال أبو عمر : لم يقل مالك بمقتضى هذا الحديث ، وكان يقول : يرمون يوم النحر - يعني جمرة العقبة - ثم لا يرمون من الغد ، فإذا كان بعد الغد وهو الثاني من أيام التشريق وهو اليوم الذي يتعجل فيه النفر من يريد التعجيل أو من يجوز له التعجيل رموا اليومين لذلك اليوم ولليوم الذي قبله ؛ لأنهم يقضون ما كان عليهم ، ولا يقضي أحد عنده شيئا إلا بعد أن يجب عليه ، هذا معنى ما فسر به مالك هذا الحديث في موطئه . وغيره يقول : لا بأس بذلك كله على ما في حديث مالك ؛ لأنها أيام رمي كلها ، وإنما لم يجز عند مالك للرعاء تقديم الرمي لأن غير الرعاء لا يجوز لهم أن يرموا في أيام التشريق شيئا من الجمار قبل الزوال ، فإن رمى قبل الزوال أعادها ، ليس لهم التقديم . وإنما رخص لهم في اليوم الثاني إلى الثالث . قال ابن عبد البر : الذي قاله مالك في هذه المسألة موجود في رواية ابن جريج قال : أخبرني محمد بن أبي بكر بن محمد بن عمرو بن حزم عن أبيه أن أبا البداح بن عاصم بن عدي أخبره أن النبي صلى الله عليه وسلم أرخص للرعاء أن يتعاقبوا ، فيرموا يوم النحر ، ثم يدعوا يوما وليلة ثم يرمون الغد . قال علماؤنا : ويسقط رمي الجمرة الثالثة عمن تعجل . قال ابن أبي زمنين يرميها يوم النفر الأول حين يريد التعجيل . قال ابن المواز : يرمي المتعجل في يومين بإحدى وعشرين حصاة ، كل جمرة بسبع حصيات ، فيصير جميع رميه بتسع وأربعين حصاة ؛ لأنه قد رمى جمرة العقبة يوم النحر بسبع . قال ابن المنذر : ويسقط رمي اليوم الثالث .\nالثامنة : روى مالك عن يحيى بن سعيد عن عطاء بن أبي رباح أنه سمعه يذكر أنه أرخص للرعاء أن يرموا بالليل ، يقول في الزمن الأول . قال الباجي : \" قوله في الزمن الأول يقتضي إطلاقه زمن النبي صلى الله عليه وسلم لأنه أول زمن هذه الشريعة ، فعلى هذا هو مرسل . ويحتمل أن يريد به أول زمن أدركه عطاء ، فيكون موقوفا مسندا \" . والله أعلم .\nقلت : هو مسند من حديث عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ، خرجه الدارقطني وغيره ، وقد ذكرناه في \" المقتبس في شرح موطأ مالك بن أنس \" ، وإنما أبيح لهم الرمي بالليل لأنه أرفق بهم وأحوط فيما يحاولونه من رعي الإبل ؛ لأن الليل وقت لا ترعى فيه ولا تنتشر ، فيرمون في ذلك الوقت . وقد اختلفوا فيمن فاته الرمي حتى غربت الشمس . فقال عطاء : لا رمي بالليل إلا لرعاء الإبل ، فأما التجار فلا . وروي عن ابن عمر أنه قال : من فاته الرمي حتى تغيب الشمس فلا يرم حتى تطلع الشمس من الغد ، وبه قال أحمد وإسحاق . وقال مالك : إذا تركه نهارا رماه ليلا ، وعليه دم في رواية ابن القاسم ، ولم يذكر في الموطأ أن عليه دما . وقال الشافعي وأبو ثور ويعقوب ومحمد : إذا نسي الرمي حتى أمسى يرمي ولا دم عليه . وكان الحسن البصري يرخص في رمي الجمار ليلا . وقال أبو حنيفة : يرمي ولا شيء عليه ، وإن لم يذكرها من الليل حتى يأتي الغد فعليه أن يرميها وعليه دم . وقال الثوري : إذا أخر الرمي إلى الليل ناسيا أو متعمدا أهرق دما .\nقلت : أما من رمى من رعاء الإبل أو أهل السقاية بالليل فلا دم يجب ؛ للحديث ، وإن كان من غيرهم فالنظر يوجب الدم لكن مع العمد ، والله أعلم . التاسعة : ثبت أن رسول الله صلى الله عليه وسلم رمى جمرة العقبة يوم النحر على راحلته . واستحب مالك وغيره أن يكون الذي يرميها راكبا . وقد كان ابن عمر وابن الزبير وسالم يرمونها وهم مشاة ، ويرمي في كل يوم من الثلاثة بإحدى وعشرين حصاة ، يكبر مع كل حصاة ، ويكون وجهه في حال رميه إلى الكعبة ، ويرتب الجمرات ويجمعهن ولا يفرقهن ولا ينكسهن ، يبدأ بالجمرة الأولى فيرميها بسبع حصيات رميا ولا يضعها وضعا ، كذلك قال مالك والشافعي وأبو ثور وأصحاب الرأي ، فإن طرحها طرحا جاز عند أصحاب الرأي . وقال ابن القاسم : لا تجزئ في الوجهين جميعا ، وهو الصحيح ؛ لأن النبي صلى الله عليه وسلم كان يرميها ، ولا يرمي عندهم بحصاتين أو أكثر في مرة ، فإن فعل عدها حصاة واحدة ، فإذا فرغ منها تقدم أمامها فوقف طويلا للدعاء بما تيسر . ثم يرمي الثانية وهي الوسطى وينصرف عنها ذات الشمال في بطن المسيل ، ويطيل الوقوف عندها للدعاء . ثم يرمي الثالثة بموضع جمرة العقبة بسبع حصيات أيضا ، يرميها من أسفلها ولا يقف عندها ، ولو رماها من فوقها أجزأه ، ويكبر في ذلك كله مع كل حصاة يرميها . وسنة الذكر في رمي الجمار التكبير دون غيره من الذكر ، ويرميها ماشيا بخلاف جمرة يوم النحر ، وهذا كله توقيف رفعه النسائي والدارقطني عن الزهري أن رسول الله صلى الله عليه وسلم كان إذا رمى الجمرة التي تلي المسجد - مسجد منى - يرميها بسبع حصيات ، يكبر كلما رمى بحصاة ، ثم تقدم أمامها فوقف مستقبل القبلة رافعا يديه يدعو ، وكان يطيل الوقوف . ثم يأتي الجمرة الثانية فيرميها بسبع حصيات ، يكبر كلما رمى بحصاة ، ثم ينحدر ذات اليسار مما يلي الوادي فيقف مستقبل القبلة رافعا يديه ثم يدعو . ثم يأتي الجمرة التي عند العقبة فيرميها بسبع حصيات ، يكبر كلما رمى بحصاة ثم ينصرف ولا يقف عندها . قال الزهري : سمعت سالم بن عبد الله يحدث بهذا عن أبيه عن النبي صلى الله عليه وسلم . قال : وكان ابن عمر يفعله ، لفظ الدارقطني .\nالعاشرة : وحكم الجمار أن تكون طاهرة غير نجسة ، ولا مما رمي به ، فإن رمى بما قد رمي به لم يجزه عند مالك ، وقد قال عنه ابن القاسم : إن كان ذلك في حصاة واحدة أجزأه ، ونزلت بابن القاسم فأفتاه بهذا .\nالحادية عشرة : واستحب أهل العلم أخذها من المزدلفة لا من حصى المسجد ، فإن أخذ زيادة على ما يحتاج وبقي ذلك بيده بعد الرمي دفنه ولم يطرحه ، قاله أحمد بن حنبل وغيره .\nالثانية عشرة : ولا تغسل عند الجمهور خلافا لطاوس ، وقد روي أنه لو لم يغسل الجمار النجسة أو رمى بما قد رمي به أنه أساء وأجزأ عنه . قال ابن المنذر : يكره أن يرمي بما قد رمي به ، ويجزئ إن رمى به ، إذ لا أعلم أحدا أوجب على من فعل ذلك الإعادة ، ولا نعلم في شيء من الأخبار التي جاءت عن النبي صلى الله عليه وسلم أنه غسل الحصى ولا أمر بغسله ، وقد روينا عن طاوس أنه كان يغسله .\nالثالثة عشرة : ولا يجزئ في الجمار المدر ولا شيء غير الحجر ، وهو قول الشافعي وأحمد وإسحاق . وقال أصحاب الرأي : يجوز بالطين اليابس ، وكذلك كل شيء رماها من الأرض فهو يجزئ . وقال الثوري : من رمى بالخزف والمدر لم يعد الرمي . قال ابن المنذر : لا يجزئ الرمي إلا بالحصى ؛ لأن النبي صلى الله عليه وسلم قال : عليكم بحصى الخذف . وبالحصى رمى رسول الله صلى الله عليه وسلم .\nالرابعة عشرة : واختلف في قدر الحصى ، فقال الشافعي : يكون أصغر من الأنملة طولا وعرضا . وقال أبو ثور وأصحاب الرأي : بمثل حصى الخذف ، وروينا عن ابن عمر أنه كان يرمي الجمرة بمثل بعر الغنم ، ولا معنى لقول مالك : أكبر من ذلك أحب إلي ؛ لأن النبي صلى الله عليه وسلم سن الرمي بمثل حصى الخذف ، ويجوز أن يرمى بما وقع عليه اسم حصاة ، واتباع السنة أفضل ، قاله ابن المنذر .\nقلت : وهو الصحيح الذي لا يجوز خلافه لمن اهتدى واقتدى . روى النسائي عن ابن عباس قال : قال لي رسول الله صلى الله عليه وسلم غداة العقبة وهو على راحلته : هات القط لي - فلقطت له حصيات هن حصى الخذف ، فلما وضعتهن في يده قال - : بأمثال هؤلاء ، وإياكم والغلو في الدين فإنما أهلك من كان قبلكم الغلو في الدين . فدل قوله : ( وإياكم والغلو في الدين ) على كراهة الرمي بالجمار الكبار ، وأن ذلك من الغلو ، والله أعلم .\nالخامسة عشرة : : ومن بقي في يده حصاة لا يدري من أي الجمار هي جعلها من الأولى ، ورمى بعدها الوسطى والآخرة ، فإن طال استأنف جميعا .\nالسادسة عشرة : قال مالك والشافعي وعبد الملك وأبو ثور وأصحاب الرأي فيمن قدم جمرة على جمرة : لا يجزئه إلا أن يرمي على الولاء . وقال الحسن ، وعطاء وبعض الناس : يجزئه . واحتج بعض الناس بقول النبي صلى الله عليه وسلم : من قدم نسكا بين يدي نسك فلا حرج وقال : ( لا يكون هذا بأكثر من رجل اجتمعت عليه صلوات أو صيام فقضى بعضا قبل بعض ) . والأول أحوط ، والله أعلم .\nالسابعة عشرة : واختلفوا في رمي المريض والرمي عنه ، فقال مالك : يرمى عن المريض والصبي اللذين لا يطيقان الرمي ، ويتحرى المريض حين رميهم فيكبر سبع تكبيرات لكل جمرة وعليه الهدي ، وإذا صح المريض في أيام الرمي رمى عن نفسه ، وعليه مع ذلك دم عند مالك . وقال الحسن والشافعي وأحمد وإسحاق وأصحاب الرأي : يرمى عن المريض ، ولم يذكروا هديا . ولا خلاف في الصبي الذي لا يقدر على الرمي أنه يرمى عنه ، وكان ابن عمر يفعل ذلك .\nالثامنة عشرة : روى الدارقطني عن أبي سعيد الخدري قال قلنا : يا رسول الله ، هذه الجمار التي يرمى بها كل عام فنحسب أنها تنقص ، فقال : إنه ما تقبل منها رفع ولولا ذلك لرأيتها أمثال الجبال .\nالتاسعة عشرة : قال ابن المنذر : وأجمع أهل العلم على أن لمن أراد الخروج من الحاج من منى شاخصا إلى بلده خارجا عن الحرم غير مقيم بمكة في النفر الأول أن ينفر بعد زوال الشمس إذا رمى في اليوم الذي يلي يوم النحر قبل أن يمسي ؛ لأن الله جل ذكره قال : فمن تعجل في يومين فلا إثم عليه فلينفر من أراد النفر ما دام في شيء من النهار . وقد روينا عن النخعي والحسن أنهما قالا : من أدركه العصر وهو بمنى من اليوم الثاني من أيام التشريق لم ينفر حتى الغد . قال ابن المنذر : وقد يحتمل أن يكونا قالا ذلك استحبابا ، والقول الأول به نقول ؛ لظاهر الكتاب والسنة .\nالموفية عشرين : واختلفوا في أهل مكة هل ينفرون النفر الأول ، فروينا عن عمر بن الخطاب رضي الله عنه أنه قال : من شاء من الناس كلهم أن ينفروا في النفر الأول ، إلا آل خزيمة فلا ينفرون إلا في النفر الآخر . وكان أحمد بن حنبل يقول : لا يعجبني لمن نفر النفر الأول أن يقيم بمكة ، وقال : أهل مكة أخف ، وجعل أحمد وإسحاق معنى قول عمر بن الخطاب : ( إلا آل خزيمة ) أي أنهم أهل حرم . وكان مالك يقول في أهل مكة : من كان له عذر فله أن يتعجل في يومين ، فإن أراد التخفيف عن نفسه مما هو فيه من أمر الحج فلا ، فرأى التعجيل لمن بعد قطره . وقالت طائفة : الآية على العموم ، والرخصة لجميع الناس ، أهل مكة وغيرهم ، أراد الخارج عن منى المقام بمكة أو الشخوص إلى بلده . وقال عطاء : هي للناس عامة . قال ابن المنذر : وهو يشبه مذهب الشافعي ، وبه نقول . وقال ابن عباس والحسن وعكرمة ومجاهد وقتادة والنخعي : ( من نفر في اليوم الثاني من الأيام المعدودات فلا حرج ، ومن تأخر إلى الثالث فلا حرج ) ، فمعنى الآية : كل ذلك مباح ، وعبر عنه بهذا التقسيم اهتماما وتأكيدا ، إذ كان من العرب من يذم المتعجل وبالعكس ، فنزلت الآية رافعة للجناح في كل ذلك . وقال علي بن أبي طالب وابن عباس وابن مسعود وإبراهيم النخعي أيضا : ( معنى من تعجل فقد غفر له ، ومن تأخر فقد غفر له ) ، واحتجوا بقوله عليه السلام : من حج هذا البيت فلم يرفث ولم يفسق خرج من خطاياه كيوم ولدته أمه . فقوله : فلا إثم عليه نفي عام وتبرئة مطلقة . وقال مجاهد أيضا : معنى الآية ، من تعجل أو تأخر فلا إثم عليه إلى العام المقبل . وأسند في هذا القول أثر . وقال أبو العالية في الآية : لا إثم عليه لمن اتقى بقية عمره ، والحاج مغفور له البتة ، أي ذهب إثمه كله إن اتقى الله فيما بقي من عمره . وقال أبو صالح وغيره : معنى الآية لا إثم عليه لمن اتقى قتل الصيد ، وما يجب عليه تجنبه في الحج . وقال أيضا : لمن اتقى في حجه فأتى به تاما حتى كان مبرورا .\nالحادية والعشرون : \" من \" في قوله : فمن تعجل رفع بالابتداء ، والخبر فلا إثم عليه . ويجوز في غير القرآن فلا إثم عليهم ؛ لأن معنى \" من \" جماعة ، كما قال جل وعز : ومنهم من يستمعون إليك وكذا ومن تأخر فلا إثم عليه . واللام من قوله : لمن اتقى متعلقة بالغفران ، التقدير المغفرة لمن اتقى ، وهذا على تفسير ابن مسعود وعلي . قال قتادة : ذكر لنا أن ابن مسعود قال : إنما جعلت المغفرة لمن اتقى بعد انصرافه من الحج عن جميع المعاصي . وقال الأخفش : التقدير ذلك لمن اتقى . وقال بعضهم : لمن اتقى يعني قتل الصيد في الإحرام وفي الحرم . وقيل التقدير الإباحة لمن اتقى ، روي هذا عن ابن عمر . وقيل : السلامة لمن اتقى . وقيل : هي متعلقة بالذكر الذي في قوله تعالى : واذكروا أي الذكر لمن اتقى . وقرأ سالم بن عبد الله فلا اثم عليه بوصل الألف تخفيفا ، والعرب قد تستعمله . قال الشاعر :\nإن لم أقاتل فالبسوني برقعا\nثم أمر الله تعالى بالتقوى وذكر بالحشر والوقوف .\n                                    ",
        "saadi": "وَٱذۡكُرُواْ ٱللَّهَ فِيٓ أَيَّامٖ مَّعۡدُودَٰتٖۚ فَمَن تَعَجَّلَ فِي يَوۡمَيۡنِ فَلَآ إِثۡمَ عَلَيۡهِ وَمَن تَأَخَّرَ فَلَآ إِثۡمَ عَلَيۡهِۖ لِمَنِ ٱتَّقَىٰۗ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّكُمۡ إِلَيۡهِ تُحۡشَرُونَ ٣٠٢\n                                        \n                                        \n                                        \n                                        ويدخل في ذكر الله فيها, ذكره عند رمي الجمار, وعند الذبح, والذكر المقيد عقب الفرائض، بل قال بعض العلماء: إنه يستحب فيها التكبير المطلق, كالعشر, وليس ببعيد. { فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ } أي: خرج من \" منى \" ونفر منها قبل غروب شمس اليوم الثاني { فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ } بأن بات بها ليلة الثالث ورمى من الغد { فَلَا إِثْمَ عَلَيْهِ } وهذا تخفيف من الله [تعالى] على عباده, في إباحة كلا الأمرين، ولكن من المعلوم أنه إذا أبيح كلا الأمرين, فالمتأخر أفضل, لأنه أكثر عبادة. ولما كان نفي الحرج قد يفهم منه نفي الحرج في ذلك المذكور وفي غيره, والحاصل أن الحرج منفي عن المتقدم، والمتأخر فقط قيده بقوله: { لِمَنِ اتَّقَى } أي: اتقى الله في جميع أموره, وأحوال الحج، فمن اتقى الله في كل شيء, حصل له نفي الحرج في كل شيء، ومن اتقاه في شيء دون شيء, كان الجزاء من جنس العمل. { وَاتَّقُوا اللَّهَ } بامتثال أوامره واجتناب معاصيه، { وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ } فمجازيكم بأعمالكم، فمن اتقاه, وجد جزاء التقوى عنده, ومن لم يتقه, عاقبه أشد العقوبة، فالعلم بالجزاء من أعظم الدواعي لتقوى الله, فلهذا حث تعالى على العلم بذلك.\n                                    "
      },
      "originalText": "۞ وَٱذۡكُرُواْ ٱللَّهَ فِيٓ أَيَّامٖ مَّعۡدُودَٰتٖۚ فَمَن تَعَجَّلَ فِي يَوۡمَيۡنِ فَلَآ إِثۡمَ عَلَيۡهِ وَمَن تَأَخَّرَ فَلَآ إِثۡمَ عَلَيۡهِۖ لِمَنِ ٱتَّقَىٰۗ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّكُمۡ إِلَيۡهِ تُحۡشَرُونَ ٣٠٢"
    },
    {
      "number": 211,
      "text": "وَمِنَ النَّاسِ مَنْ يُعْجِبُكَ قَوْلُهُ فِي الْحَيَاةِ الدُّنْيَا وَيُشْهِدُ اللَّهَ عَلَىٰ مَا فِي قَلْبِهِ وَهُوَ أَلَدُّ الْخِصَامِ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 204,
      "juz": 2,
      "manzil": 1,
      "page": 32,
      "ruku": 26,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِنَ ٱلنَّاسِ مَن يُعۡجِبُكَ قَوۡلُهُۥ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيُشۡهِدُ ٱللَّهَ عَلَىٰ مَا فِي قَلۡبِهِۦ وَهُوَ أَلَدُّ ٱلۡخِصَامِ ٤٠٢\n                                    \n                                    \n                                    قال السدي : نزلت في الأخنس بن شريق الثقفي ، جاء إلى رسول الله صلى الله عليه وسلم ، وأظهر الإسلام وفي باطنه خلاف ذلك . وعن ابن عباس : أنها نزلت في نفر من المنافقين تكلموا في خبيب وأصحابه الذين قتلوا بالرجيع وعابوهم ، فأنزل الله في ذم المنافقين ومدح خبيب وأصحابه : ( ومن الناس من يشري نفسه ابتغاء مرضاة الله )\nوقيل : بل ذلك عام في المنافقين كلهم وفي المؤمنين كلهم . وهذا قول قتادة ، ومجاهد ، والربيع بن أنس ، وغير واحد ، وهو الصحيح .\nوقال ابن جرير : حدثني يونس ، أخبرنا ابن وهب ، أخبرني الليث بن سعد ، عن خالد بن يزيد ، عن سعيد بن أبي هلال ، عن القرظي ، عن نوف وهو البكالي ، وكان ممن يقرأ الكتب قال : إني لأجد صفة ناس من هذه الأمة في كتاب الله المنزل : قوم يحتالون على الدنيا بالدين ، ألسنتهم أحلى من العسل ، وقلوبهم أمر من الصبر ، يلبسون للناس مسوك الضأن ، وقلوبهم قلوب الذئاب . يقول الله تعالى : فعلي يجترئون ! وبي يغترون ! حلفت بنفسي لأبعثن عليهم فتنة تترك الحليم فيها حيران . قال القرظي : تدبرتها في القرآن ، فإذا هم المنافقون ، فوجدتها : ( ومن الناس من يعجبك قوله في الحياة الدنيا ويشهد الله على ما في قلبه ) الآية .\nوحدثني محمد بن أبي معشر ، أخبرني أبي أبو معشر نجيح قال : سمعت سعيدا المقبري يذاكر محمد بن كعب القرظي ، فقال سعيد : إن في بعض الكتب : إن [ لله ] عبادا ألسنتهم أحلى من العسل ، وقلوبهم أمر من الصبر ، لبسوا للناس مسوك الضأن من اللين ، يجترون الدنيا بالدين . قال الله تعالى : علي تجترئون ! وبي تغترون ! . وعزتي لأبعثن عليهم فتنة تترك الحليم منهم حيران . فقال محمد بن كعب : هذا في كتاب الله . فقال سعيد : وأين هو من كتاب الله ؟ قال : قول الله : ( ومن الناس من يعجبك قوله في الحياة الدنيا ) الآية . فقال سعيد : قد عرفت فيمن أنزلت هذه الآية . فقال محمد بن كعب : إن الآية تنزل في الرجل ، ثم تكون عامة بعد . وهذا الذي قاله القرظي حسن صحيح .\nوأما قوله : ( ويشهد الله على ما في قلبه ) فقرأه ابن محيصن : \" ويشهد الله \" بفتح الياء ، وضم الجلالة ( على ما في قلبه ) ومعناها : أن هذا وإن أظهر لكم الحيل لكن الله يعلم من قلبه القبيح ، كقوله تعالى : ( إذا جاءك المنافقون قالوا نشهد إنك لرسول الله والله يعلم إنك لرسوله والله يشهد إن المنافقين لكاذبون ) [ المنافقون : 1 ] .\nوقراءة الجمهور بضم الياء ، ونصب الجلالة ( ويشهد الله على ما في قلبه ) ومعناه : أنه يظهر للناس الإسلام ويبارز الله بما في قلبه من الكفر والنفاق ، كقوله تعالى : ( يستخفون من الناس ولا يستخفون من الله ) الآية [ النساء : 108 ] هذا معنى ما رواه ابن إسحاق ، عن محمد بن أبي محمد ، عن عكرمة ، عن سعيد بن جبير ، عن ابن عباس .\nوقيل : معناه أنه إذا أظهر للناس الإسلام حلف وأشهد الله لهم : أن الذي في قلبه موافق للسانه . وهذا المعنى صحيح ، وقاله عبد الرحمن بن زيد بن أسلم ، واختاره ابن جرير ، وعزاه إلى ابن عباس ، وحكاه عن مجاهد ، والله أعلم .\nوقوله : ( وهو ألد الخصام ) الألد في اللغة : [ هو ] الأعوج ، ( وتنذر به قوما لدا ) [ مريم : 97 ] أي : عوجا . وهكذا المنافق في حال خصومته ، يكذب ، ويزور عن الحق ولا يستقيم معه ، بل يفتري ويفجر ، كما ثبت في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال : \" آية المنافق ثلاث : إذا حدث كذب ، وإذا عاهد غدر ، وإذا خاصم فجر \" .\nوقال البخاري : حدثنا قبيصة ، حدثنا سفيان ، عن ابن جريج ، عن ابن أبي مليكة ، عن عائشة ترفعه قال : \" أبغض الرجال إلى الله الألد الخصم \" .\nقال : وقال عبد الله بن يزيد : حدثنا سفيان ، حدثني ابن جريج ، عن ابن أبي مليكة ، عن عائشة ، عن النبي صلى الله عليه وسلم قال : \" إن أبغض الرجال إلى الله الألد الخصم \" .\nوهكذا رواه عبد الرزاق ، عن معمر في قوله : ( وهو ألد الخصام ) عن ابن جريج ، عن ابن أبي مليكة ، عن عائشة ، عن النبي صلى الله عليه وسلم قال : \" إن أبغض الرجال إلى الله الألد الخصم \" .\n                                    ",
        "qortoby": "وَمِنَ ٱلنَّاسِ مَن يُعۡجِبُكَ قَوۡلُهُۥ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيُشۡهِدُ ٱللَّهَ عَلَىٰ مَا فِي قَلۡبِهِۦ وَهُوَ أَلَدُّ ٱلۡخِصَامِ ٤٠٢\n                                    \n                                    \n                                    قوله تعالى : ومن الناس من يعجبك قوله في الحياة الدنيا ويشهد الله على ما في قلبه وهو ألد الخصام\nالأولى : قوله تعالى : ومن الناس من يعجبك قوله لما ذكر الذين قصرت همتهم على الدنيا - في قوله : فمن الناس من يقول ربنا آتنا في الدنيا - والمؤمنين الذين سألوا خير الدارين ذكر المنافقين لأنهم أظهروا الإيمان وأسروا الكفر . قال السدي وغيره من المفسرين : نزلت في الأخنس بن شريق ، واسمه أبي ، والأخنس لقب لقب به ؛ لأنه خنس يوم بدر بثلاثمائة رجل من حلفائه من بني زهرة عن قتال رسول الله صلى الله عليه وسلم ، على ما يأتي في \" آل عمران \" بيانه . وكان رجلا حلو القول والمنظر ، فجاء بعد ذلك إلى النبي صلى الله عليه وسلم فأظهر الإسلام وقال : الله يعلم أنى صادق ، ثم هرب بعد ذلك ، فمر بزرع لقوم من المسلمين وبحمر فأحرق الزرع وعقر الحمر . قال المهدوي : وفيه نزلت ولا تطع كل حلاف مهين . هماز مشاء بنميم و ويل لكل همزة لمزة . قال ابن عطية : ما ثبت قط أن الأخنس أسلم . وقال ابن عباس : ( نزلت في قوم من المنافقين تكلموا في الذين قتلوا في غزوة الرجيع : عاصم بن ثابت ، وخبيب ، وغيرهم ، وقالوا : ويح هؤلاء القوم ، لا هم قعدوا في بيوتهم ، ولا هم أدوا رسالة صاحبهم ) ، فنزلت هذه الآية في صفات المنافقين ، ثم ذكر المستشهدين في غزوة الرجيع في قوله : ومن الناس من يشري نفسه ابتغاء مرضات الله . وقال قتادة ومجاهد وجماعة من العلماء : نزلت في كل مبطن كفرا أو نفاقا أو كذبا أو إضرارا ، وهو يظهر بلسانه خلاف ذلك ، فهي عامة ، وهي تشبه ما ورد في الترمذي أن في بعض كتب الله تعالى : إن من عباد الله قوما ألسنتهم أحلى من العسل وقلوبهم أمر من الصبر ، يلبسون للناس جلود الضأن من اللين ، يشترون الدنيا بالدين ، يقول الله تعالى : أبي يغترون ، وعلي يجترئون ، فبي حلفت لأتيحن لهم فتنة تدع الحليم منهم حيرانا . ومعنى ويشهد الله أي يقول : الله يعلم أني أقول حقا . وقرأ ابن محيصن ويشهد الله على ما في قلبه بفتح الياء والهاء في \" يشهد \" ، \" الله \" بالرفع ، والمعنى يعجبك قوله ، والله يعلم منه خلاف ما قال . دليله قوله : والله يشهد إن المنافقين لكاذبون . وقراءة ابن عباس : \" والله يشهد على ما في قلبه \" . وقراءة الجماعة أبلغ في الذم ؛ لأنه قوي على نفسه التزام الكلام الحسن ، ثم ظهر من باطنه خلافه . وقرأ أبي وابن مسعود : \" ويستشهد الله على ما في قلبه \" وهي حجة لقراءة الجماعة .\nالثانية : قال علماؤنا : وفي هذه الآية دليل وتنبيه على الاحتياط فيما يتعلق بأمور الدين والدنيا ، واستبراء أحوال الشهود والقضاة ، وأن الحاكم لا يعمل على ظاهر أحوال الناس وما يبدو من إيمانهم وصلاحهم حتى يبحث عن باطنهم ؛ لأن الله تعالى بين أحوال الناس ، وأن منهم من يظهر قولا جميلا وهو ينوي قبيحا .\nفإن قيل : هذا يعارضه قوله عليه السلام : أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله الحديث ، وقوله : فأقضي له على نحو ما أسمع ، فالجواب أن هذا كان في صدر الإسلام ، حيث كان إسلامهم سلامتهم ، وأما وقد عم الفساد فلا ، قاله ابن العربي .\nقلت : والصحيح أن الظاهر يعمل عليه حتى يتبين خلافه ، لقول عمر بن الخطاب رضي الله عنه في صحيح البخاري : أيها الناس ، إن الوحي قد انقطع ، وإنما نأخذكم الآن بما ظهر لنا من أعمالكم ، فمن أظهر لنا خيرا أمناه وقربناه ، وليس لنا من سريرته شيء ، الله يحاسبه في سريرته ، ومن أظهر لنا سوءا لم نؤمنه ولم نصدقه ، وإن قال إن سريرته حسنة .\nالثالثة : قوله تعالى : وهو ألد الخصام الألد : الشديد الخصومة ، وهو رجل ألد ، وامرأة لداء ، وهم أهل لدد . وقد لددت - بكسر الدال - تلد - بالفتح - لددا ، أي صرت ألد . ولددته - بفتح الدال - ألده - بضمها - إذا جادلته فغلبته . والألد مشتق من اللديدين ، وهما صفحتا العنق ، أي في أي جانب أخذ من الخصومة غلب . قال الشاعر :\nوألد ذي حنق علي كأنما تغلي عداوة صدره في مرجل\nوقال آخر :\nإن تحت التراب عزما وحزما وخصيما ألد ذا مغلاق\nو الخصام في الآية مصدر خاصم ، قاله الخليل . وقيل : جمع خصم ، قاله الزجاج ، ككلب وكلاب ، وصعب وصعاب ، وضخم وضخام . والمعنى أشد المخاصمين خصومة ، أي هو ذو جدال ، إذا كلمك وراجعك رأيت لكلامه طلاوة وباطنه باطل . وهذا يدل على أن الجدال لا يجوز إلا بما ظاهره وباطنه سواء . وفي صحيح مسلم عن عائشة قالت : قال رسول الله صلى الله عليه وسلم : إن أبغض الرجال إلى الله الألد الخصم .\n                                    ",
        "saadi": "وَمِنَ ٱلنَّاسِ مَن يُعۡجِبُكَ قَوۡلُهُۥ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيُشۡهِدُ ٱللَّهَ عَلَىٰ مَا فِي قَلۡبِهِۦ وَهُوَ أَلَدُّ ٱلۡخِصَامِ ٤٠٢\n                                        \n                                        \n                                        \n                                        لما أمر تعالى بالإكثار من ذكره, وخصوصا في الأوقات الفاضلة الذي هو خير ومصلحة وبر, أخبر تعالى بحال من يتكلم بلسانه ويخالف فعله قوله, فالكلام إما أن يرفع الإنسان أو يخفضه فقال: { وَمِنَ النَّاسِ مَنْ يُعْجِبُكَ قَوْلُهُ فِي الْحَيَاةِ الدُّنْيَا } أي: إذا تكلم راق كلامه للسامع، وإذا نطق, ظننته يتكلم بكلام نافع, ويؤكد ما يقول بأنه { وَيُشْهِدُ اللَّهَ عَلَى مَا فِي قَلْبِهِ } بأن يخبر أن الله يعلم, أن ما في قلبه موافق لما نطق به, وهو كاذب في ذلك, لأنه يخالف قوله فعله. فلو كان صادقا, لتوافق القول والفعل, كحال المؤمن غير المنافق, فلهذا قال: { وَهُوَ أَلَدُّ الْخِصَامِ } أي: إذا خاصمته, وجدت فيه من اللدد والصعوبة والتعصب, وما يترتب على ذلك, ما هو من مقابح الصفات, ليس كأخلاق المؤمنين, الذين جعلوا السهولة مركبهم, والانقياد للحق وظيفتهم, والسماحة سجيتهم.\n                                    "
      },
      "originalText": "وَمِنَ ٱلنَّاسِ مَن يُعۡجِبُكَ قَوۡلُهُۥ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيُشۡهِدُ ٱللَّهَ عَلَىٰ مَا فِي قَلۡبِهِۦ وَهُوَ أَلَدُّ ٱلۡخِصَامِ ٤٠٢"
    },
    {
      "number": 212,
      "text": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِي الْأَرْضِ لِيُفْسِدَ فِيهَا وَيُهْلِكَ الْحَرْثَ وَالنَّسْلَ ۗ وَاللَّهُ لَا يُحِبُّ الْفَسَادَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 205,
      "juz": 2,
      "manzil": 1,
      "page": 32,
      "ruku": 26,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِي ٱلۡأَرۡضِ لِيُفۡسِدَ فِيهَا وَيُهۡلِكَ ٱلۡحَرۡثَ وَٱلنَّسۡلَۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡفَسَادَ ٥٠٢\n                                    \n                                    \n                                    وقوله : ( وإذا تولى سعى في الأرض ليفسد فيها ويهلك الحرث والنسل والله لا يحب الفساد ) أي : هو أعوج المقال ، سيئ الفعال ، فذلك قوله ، وهذا فعله : كلامه كذب ، واعتقاده فاسد ، وأفعاله قبيحة .\nوالسعي هاهنا هو : القصد . كما قال إخبارا عن فرعون : ( ثم أدبر يسعى فحشر فنادى فقال أنا ربكم الأعلى فأخذه الله نكال الآخرة والأولى إن في ذلك لعبرة لمن يخشى ) [ النازعات : 2226 ] ، وقال تعالى : ( يا أيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله ) [ الجمعة : 9 ] أي : اقصدوا واعمدوا ناوين بذلك صلاة الجمعة ، فإن السعي الحسي إلى الصلاة منهي عنه بالسنة النبوية : \" إذا أتيتم الصلاة فلا تأتوها وأنتم تسعون ، وأتوها وعليكم السكينة والوقار \" .\nفهذا المنافق ليس له همة إلا الفساد في الأرض ، وإهلاك الحرث ، وهو : محل نماء الزروع والثمار والنسل ، وهو : نتاج الحيوانات الذين لا قوام للناس إلا بهما .\nوقال مجاهد : إذا سعى في الأرض فسادا ، منع الله القطر ، فهلك الحرث والنسل . ( والله لا يحب الفساد ) أي : لا يحب من هذه صفته ، ولا من يصدر منه ذلك .\n                                    ",
        "qortoby": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِي ٱلۡأَرۡضِ لِيُفۡسِدَ فِيهَا وَيُهۡلِكَ ٱلۡحَرۡثَ وَٱلنَّسۡلَۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡفَسَادَ ٥٠٢\n                                    \n                                    \n                                    قوله تعالى : وإذا تولى سعى في الأرض ليفسد فيها ويهلك الحرث والنسل والله لا يحب الفساد\nوقوله تعالى : وإذا تولى سعى في الأرض ليفسد فيها قيل : \" تولى وسعى \" من فعل القلب ، فيجيء \" تولى \" بمعنى ضل وغضب وأنف في نفسه . و \" سعى \" أي سعى بحيلته وإرادته الدوائر على الإسلام وأهله ، عن ابن جريج وغيره . وقيل : هما فعل الشخص ، فيجيء تولى بمعنى أدبر وذهب عنك يا محمد . و سعى أي بقدميه فقطع الطريق وأفسدها ، عن ابن عباس وغيره . وكلا السعيين فساد . يقال : سعى الرجل يسعى سعيا ، أي عدا ، وكذلك إذا عمل وكسب . وفلان يسعى على عياله أي يعمل في نفعهم .\nقوله تعالى : \" ويهلك \" عطف على \" ليفسد \" . وفي قراءة أبي \" وليهلك \" . وقرأ الحسن وقتادة \" ويهلك \" بالرفع ، وفي رفعه أقوال : يكون معطوفا على \" يعجبك \" . وقال أبو حاتم : هو معطوف على \" سعى \" لأن معناه يسعى ويهلك ، وقال أبو إسحاق : وهو يهلك . وروي عن ابن كثير \" ويهلك \" بفتح الياء وضم الكاف ، \" الحرث والنسل \" مرفوعان ب \" يهلك \" ، وهي قراءة الحسن وابن أبي إسحاق وأبي حيوة وابن محيصن ، ورواه عبد الوارث عن أبي عمرو . وقرأ قوم \" ويهلك \" بفتح الياء واللام ، ورفع الحرث ؛ لغة هلك يهلك ، مثل ركن يركن ، وأبى يأبى ، وسلى يسلى ، وقلى يقلى ، وشبهه . والمعني في الآية الأخنس في إحراقه الزرع وقتله الحمر ، قاله الطبري . قال غيره : ولكنها صارت عامة لجميع الناس ، فمن عمل مثل عمله استوجب تلك اللعنة والعقوبة . قال بعض العلماء : إن من يقتل حمارا أو يحرق كدسا استوجب الملامة ، ولحقه الشين إلى يوم القيامة . وقال مجاهد : المراد أن الظالم يفسد في الأرض فيمسك الله المطر فيهلك الحرث والنسل . وقيل : الحرث النساء ، والنسل الأولاد ، وهذا لأن النفاق يؤدي إلى تفريق الكلمة ووقوع القتال ، وفيه هلاك الخلق ، قال معناه الزجاج . والسعي في الأرض المشي بسرعة ، وهذه عبارة عن إيقاع الفتنة والتضريب بين الناس ، والله أعلم .\nوفي الحديث : إن الناس إذا رأوا الظالم ولم يأخذوا على يديه أوشك أن يعمهم الله بعقاب من عنده . وسيأتي بيان هذا إن شاء الله تعالى .\nقوله تعالى : الحرث والنسل الحرث في اللغة : الشق ، ومنه المحراث لما يشق به الأرض . والحرث : كسب المال وجمعه ، وفى الحديث : احرث لدنياك كأنك تعيش أبدا . والحرث الزرع . والحراث الزراع . وقد حرث واحترث ، مثل زرع وازدرع ويقال : احرث القرآن ، أي ادرسه . وحرثت الناقة وأحرثتها ، أي سرت عليها حتى هزلت وحرثت النار حركتها . والمحراث : ما يحرك به نار التنور ، عن الجوهري . والنسل : ما خرج من كل أنثى من ولد . وأصله الخروج والسقوط ، ومنه نسل الشعر ، وريش الطائر ، والمستقبل ينسل ، ومنه إلى ربهم ينسلون ، من كل حدب ينسلون وقال امرؤ القيس :\nوإن كنت قد ساءتك مني خليقة فسلي ثيابي من ثيابك تنسل\nقلت : ودلت الآية على الحرث وزراعة الأرض ، وغرسها بالأشجار حملا على الزرع ، وطلب النسل ، وهو نماء الحيوان ، وبذلك يتم قوام الإنسان . وهو يرد على من قال بترك الأسباب ، وسيأتي بيانه في هذا الكتاب إن شاء الله تعالى .\nقوله تعالى : والله لا يحب الفساد قال العباس بن الفضل : الفساد هو الخراب . وقال سعيد بن المسيب : قطع الدراهم من الفساد في الأرض . وقال عطاء : إن رجلا يقال له عطاء بن منبه أحرم في جبة فأمره النبي صلى الله عليه وسلم أن ينزعها . قال قتادة : قلت لعطاء : إنا كنا نسمع أن يشقها ، فقال عطاء : إن الله لا يحب الفساد .\nقلت : والآية بعمومها تعم كل فساد كان في أرض أو مال أو دين ، وهو الصحيح إن شاء الله تعالى . قيل : معنى لا يحب الفساد أي لا يحبه من أهل الصلاح ، أو لا يحبه دينا . ويحتمل أن يكون المعنى لا يأمر به ، والله أعلم .\n                                    ",
        "saadi": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِي ٱلۡأَرۡضِ لِيُفۡسِدَ فِيهَا وَيُهۡلِكَ ٱلۡحَرۡثَ وَٱلنَّسۡلَۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡفَسَادَ ٥٠٢\n                                        \n                                        \n                                        \n                                        { وَإِذَا تَوَلَّى } هذا الذي يعجبك قوله إذا حضر عندك { سَعَى فِي الْأَرْضِ لِيُفْسِدَ فِيهَا } أي: يجتهد على أعمال المعاصي, التي هي إفساد في الأرض { وَيُهْلِكَ } بسبب ذلك { الْحَرْثَ وَالنَّسْلَ } فالزروع والثمار والمواشي, تتلف وتنقص, وتقل بركتها, بسبب العمل في المعاصي، { وَاللَّهُ لَا يُحِبُّ الْفَسَادَ } وإذا كان لا يحب الفساد, فهو يبغض العبد المفسد في الأرض, غاية البغض, وإن قال بلسانه قولا حسنا. ففي هذه الآية دليل على أن الأقوال التي تصدر من الأشخاص, ليست دليلا على صدق ولا كذب, ولا بر ولا فجور حتى يوجد العمل المصدق لها, المزكي لها وأنه ينبغي اختبار أحوال الشهود, والمحق والمبطل من الناس, بسبر أعمالهم, والنظر لقرائن أحوالهم, وأن لا يغتر بتمويههم وتزكيتهم أنفسهم.\n                                    "
      },
      "originalText": "وَإِذَا تَوَلَّىٰ سَعَىٰ فِي ٱلۡأَرۡضِ لِيُفۡسِدَ فِيهَا وَيُهۡلِكَ ٱلۡحَرۡثَ وَٱلنَّسۡلَۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡفَسَادَ ٥٠٢"
    },
    {
      "number": 213,
      "text": "وَإِذَا قِيلَ لَهُ اتَّقِ اللَّهَ أَخَذَتْهُ الْعِزَّةُ بِالْإِثْمِ ۚ فَحَسْبُهُ جَهَنَّمُ ۚ وَلَبِئْسَ الْمِهَادُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 206,
      "juz": 2,
      "manzil": 1,
      "page": 32,
      "ruku": 26,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا قِيلَ لَهُ ٱتَّقِ ٱللَّهَ أَخَذَتۡهُ ٱلۡعِزَّةُ بِٱلۡإِثۡمِۚ فَحَسۡبُهُۥ جَهَنَّمُۖ وَلَبِئۡسَ ٱلۡمِهَادُ ٦٠٢\n                                    \n                                    \n                                    وقوله : ( وإذا قيل له اتق الله أخذته العزة بالإثم ) أي : إذا وعظ هذا الفاجر في مقاله وفعاله ، وقيل له : اتق الله ، وانزع عن قولك وفعلك ، وارجع إلى الحق امتنع وأبى ، وأخذته الحمية والغضب بالإثم ، أي : بسبب ما اشتمل عليه من الآثام ، وهذه الآية شبيهة بقوله تعالى : ( وإذا تتلى عليهم آياتنا بينات تعرف في وجوه الذين كفروا المنكر يكادون يسطون بالذين يتلون عليهم آياتنا قل أفأنبئكم بشر من ذلكم النار وعدها الله الذين كفروا وبئس المصير ) [ الحج : 72 ] ، ولهذا قال في هذه الآية : ( فحسبه جهنم ولبئس المهاد ) أي : هي كافيته عقوبة في ذلك .\n                                    ",
        "qortoby": "وَإِذَا قِيلَ لَهُ ٱتَّقِ ٱللَّهَ أَخَذَتۡهُ ٱلۡعِزَّةُ بِٱلۡإِثۡمِۚ فَحَسۡبُهُۥ جَهَنَّمُۖ وَلَبِئۡسَ ٱلۡمِهَادُ ٦٠٢\n                                    \n                                    \n                                    قوله تعالى : وإذا قيل له اتق الله أخذته العزة بالإثم فحسبه جهنم ولبئس المهاد هذه صفة الكافر والمنافق الذاهب بنفسه زهوا ، ويكره للمؤمن أن يوقعه الحرج في بعض هذا . وقال عبد الله : كفى بالمرء إثما أن يقول له أخوه : اتق الله ، فيقول : عليك بنفسك ، مثلك يوصيني! والعزة : القوة والغلبة ، من عزه يعزه إذا غلبه . ومنه : وعزني في الخطاب وقيل : العزة هنا الحمية ، ومنه قول الشاعر :\nأخذته عزة من جهله فتولى مغضبا فعل الضجر\nوقيل : العزة هنا المنعة وشدة النفس ، أي اعتز في نفسه وانتحى فأوقعته تلك العزة في الإثم حين أخذته وألزمته إياه . وقال قتادة : المعنى إذا قيل له مهلا ازداد إقداما على المعصية ، والمعنى حملته العزة على الإثم . وقيل : أخذته العزة بما يؤثمه ، أي ارتكب الكفر للعزة وحمية الجاهلية . ونظيره : بل الذين كفروا في عزة وشقاق وقيل : الباء في بالإثم بمعنى اللام ، أي أخذته العزة والحمية عن قبول الوعظ للإثم الذي في قلبه ، وهو النفاق ، ومنه قول عنترة يصف عرق الناقة :\nوكأن ربا أو كحيلا معقدا حش الوقود به جوانب قمقم\nأي حش الوقود له وقيل : الباء بمعنى مع ، أي أخذته العزة مع الإثم ، فمعنى الباء يختلف بحسب التأويلات . وذكر أن يهوديا كانت له حاجة عند هارون الرشيد ، فاختلف إلى بابه سنة ، فلم يقض حاجته ، فوقف يوما على الباب ، فلما خرج هارون سعى حتى وقف بين يديه وقال : اتق الله يا أمير المؤمنين! فنزل هارون عن دابته وخر ساجدا ، فلما رفع رأسه أمر بحاجته فقضيت ، فلما رجع قيل له : يا أمير المؤمنين ، نزلت عن دابتك لقول يهودي! قال : لا ، ولكن تذكرت قول الله تعالى : وإذا قيل له اتق الله أخذته العزة بالإثم فحسبه جهنم ولبئس المهاد . حسبه أي كافيه معاقبة وجزاء ، كما تقول للرجل : كفاك ما حل بك! وأنت تستعظم وتعظم عليه ما حل . والمهاد جمع المهد ، وهو الموضع المهيأ للنوم ، ومنه مهد الصبي . وسمى جهنم مهادا لأنها مستقر الكفار . وقيل : لأنها بدل لهم من المهاد ، كقوله : فبشرهم بعذاب أليم ونظيره من الكلام قولهم : للشاعر معدي كرب\nوخيل قد دلفت لها بخيل تحية بينهم ضرب وجيع\n                                    ",
        "saadi": "وَإِذَا قِيلَ لَهُ ٱتَّقِ ٱللَّهَ أَخَذَتۡهُ ٱلۡعِزَّةُ بِٱلۡإِثۡمِۚ فَحَسۡبُهُۥ جَهَنَّمُۖ وَلَبِئۡسَ ٱلۡمِهَادُ ٦٠٢\n                                        \n                                        \n                                        \n                                        ثم ذكر أن هذا المفسد في الأرض بمعاصي الله, إذا أمر بتقوى الله تكبر وأنف، و { أَخَذَتْهُ الْعِزَّةُ بِالْإِثْمِ } فيجمع بين العمل بالمعاصي والكبر على الناصحين. { فَحَسْبُهُ جَهَنَّمُ } التي هي دار العاصين والمتكبرين، { وَلَبِئْسَ الْمِهَادُ } أي: المستقر والمسكن, عذاب دائم, وهم لا ينقطع, ويأس مستمر, لا يخفف عنهم العذاب, ولا يرجون الثواب, جزاء لجناياتهم ومقابلة لأعمالهم، فعياذا بالله من أحوالهم.\n                                    "
      },
      "originalText": "وَإِذَا قِيلَ لَهُ ٱتَّقِ ٱللَّهَ أَخَذَتۡهُ ٱلۡعِزَّةُ بِٱلۡإِثۡمِۚ فَحَسۡبُهُۥ جَهَنَّمُۖ وَلَبِئۡسَ ٱلۡمِهَادُ ٦٠٢"
    },
    {
      "number": 214,
      "text": "وَمِنَ النَّاسِ مَنْ يَشْرِي نَفْسَهُ ابْتِغَاءَ مَرْضَاتِ اللَّهِ ۗ وَاللَّهُ رَءُوفٌ بِالْعِبَادِ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 207,
      "juz": 2,
      "manzil": 1,
      "page": 32,
      "ruku": 26,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِنَ ٱلنَّاسِ مَن يَشۡرِي نَفۡسَهُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِۚ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ ٧٠٢\n                                    \n                                    \n                                    وقوله : ( ومن الناس من يشري نفسه ابتغاء مرضاة الله ) لما أخبر عن المنافقين بصفاتهم الذميمة ، ذكر صفات المؤمنين الحميدة ، فقال : ( ومن الناس من يشري نفسه ابتغاء مرضاة الله )\nقال ابن عباس ، وأنس ، وسعيد بن المسيب ، وأبو عثمان النهدي ، وعكرمة ، وجماعة : نزلت في صهيب بن سنان الرومي ، وذلك أنه لما أسلم بمكة وأراد الهجرة ، منعه الناس أن يهاجر بماله ، وإن أحب أن يتجرد منه ويهاجر ، فعل . فتخلص منهم وأعطاهم ماله ، فأنزل الله فيه هذه الآية ، فتلقاه عمر بن الخطاب وجماعة إلى طرف الحرة . فقالوا : ربح البيع . فقال : وأنتم فلا أخسر الله تجارتكم ، وما ذاك ؟ فأخبروه أن الله أنزل فيه هذه الآية . ويروى أن رسول الله صلى الله عليه وسلم قال له : \" ربح البيع صهيب ، ربح البيع صهيب \" .\nقال ابن مردويه : حدثنا محمد بن إبراهيم ، حدثنا محمد بن عبد الله بن رسته ، حدثنا سليمان بن داود ، حدثنا جعفر بن سليمان الضبعي ، حدثنا عوف ، عن أبي عثمان النهدي ، عن صهيب قال : لما أردت الهجرة من مكة إلى النبي صلى الله عليه وسلم قالت لي قريش : يا صهيب ، قدمت إلينا ولا مال لك ، وتخرج أنت ومالك ! والله لا يكون ذلك أبدا . فقلت لهم : أرأيتم إن دفعت إليكم مالي تخلون عني ؟ قالوا : نعم . فدفعت إليهم مالي ، فخلوا عني ، فخرجت حتى قدمت المدينة . فبلغ ذلك النبي صلى الله عليه وسلم فقال : \" ربح صهيب ، ربح صهيب \" مرتين .\nوقال حماد بن سلمة ، عن علي بن زيد ، عن سعيد بن المسيب قال : أقبل صهيب مهاجرا نحو النبي صلى الله عليه وسلم فاتبعه نفر من قريش ، فنزل عن راحلته ، وانتثل ما في كنانته . ثم قال يا معشر قريش ، قد علمتم أني من أرماكم رجلا ، وأنتم والله لا تصلون إلي حتى أرمي كل سهم في كنانتي ، ثم أضرب بسيفي ما بقي في يدي منه شيء ، ثم افعلوا ما شئتم ، وإن شئتم دللتكم على مالي وقنيتي بمكة وخليتم سبيلي ؟ قالوا : نعم . فلما قدم على النبي صلى الله عليه وسلم قال : \" ربح البيع ، ربح البيع \" . قال : ونزلت : ( ومن الناس من يشري نفسه ابتغاء مرضاة الله والله رءوف بالعباد )\nوأما الأكثرون فحملوا ذلك على أنها نزلت في كل مجاهد في سبيل الله ، كما قال تعالى : ( إن الله اشترى من المؤمنين أنفسهم وأموالهم بأن لهم الجنة يقاتلون في سبيل الله فيقتلون ويقتلون وعدا عليه حقا في التوراة والإنجيل والقرآن ومن أوفى بعهده من الله فاستبشروا ببيعكم الذي بايعتم به وذلك هو الفوز العظيم ) [ التوبة : 111 ] . ولما حمل هشام بن عامر بين الصفين ، أنكر عليه بعض الناس ، فرد عليهم عمر بن الخطاب وأبو هريرة وغيرهما ، وتلوا هذه الآية : ( ومن الناس من يشري نفسه ابتغاء مرضاة الله والله رءوف بالعباد )\n                                    ",
        "qortoby": "وَمِنَ ٱلنَّاسِ مَن يَشۡرِي نَفۡسَهُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِۚ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ ٧٠٢\n                                    \n                                    \n                                    قوله تعالى : ومن الناس من يشري نفسه ابتغاء مرضاة الله والله رءوف بالعباد\nابتغاء نصب على المفعول من أجله . ولما ذكر صنيع المنافقين ذكر بعده صنيع المؤمنين . قيل : نزلت في صهيب فإنه أقبل مهاجرا إلى رسول الله صلى الله عليه وسلم فاتبعه نفر من قريش ، فنزل عن راحلته ، وانتثل ما في كنانته ، وأخذ قوسه ، وقال : لقد علمتم أني من أرماكم ، وايم الله لا تصلون إلي حتى أرمي بما في كنانتي ، ثم أضرب بسيفي ما بقي في يدي منه شيء ، ثم افعلوا ما شئتم . فقالوا : لا نتركك تذهب عنا غنيا وقد جئتنا صعلوكا ، ولكن دلنا على مالك بمكة ونخلي عنك ، وعاهدوه على ذلك ففعل ، فلما قدم على رسول الله صلى الله عليه وسلم نزلت : ومن الناس من يشري نفسه ابتغاء مرضات الله الآية ، فقال له رسول الله صلى الله عليه وسلم : ربح البيع أبا يحيى ، وتلا عليه الآية ، أخرجه رزين ، وقاله سعيد بن المسيب رضي الله عنهما . وقال المفسرون : أخذ المشركون صهيبا فعذبوه ، فقال لهم صهيب : إني شيخ كبير ، لا يضركم أمنكم كنت أم من غيركم ، فهل لكم أن تأخذوا مالي وتذروني وديني ؟ ففعلوا ذلك ، وكان شرط عليهم راحلة ونفقة ، فخرج إلى المدينة فتلقاه أبو بكر وعمر رضي الله عنهما ورجال ، فقال له أبو بكر : ربح بيعك أبا يحيى . فقال له صهيب : وبيعك فلا يخسر ، فما ذاك ؟ فقال : أنزل الله فيك كذا ، وقرأ عليه الآية . وقال الحسن : أتدرون فيمن نزلت هذه الآية ، نزلت في المسلم لقي الكافر فقال له : قل لا إله إلا الله ، فإذا قلتها عصمت مالك ونفسك ، فأبى أن يقولها ، فقال المسلم : والله لأشرين نفسي لله ، فتقدم فقاتل حتى قتل . وقيل : نزلت فيمن أمر بالمعروف ونهى عن المنكر ، وعلى ذلك تأولها عمر وعلي وابن عباس رضي الله عنهم ، قال علي وابن عباس : ( اقتتل الرجلان ، أي قال المغير للمفسد : اتق الله ، فأبى المفسد وأخذته العزة ، فشرى المغير نفسه من الله وقاتله فاقتتلا ) . وقال أبو الخليل : سمع عمر بن الخطاب إنسانا يقرأ هذه الآية ، فقال عمر : إنا لله وإنا إليه راجعون ، قام رجل يأمر بالمعروف وينهى عن المنكر فقتل ) . وقيل : إن عمر سمع ابن عباس يقول : ( اقتتل الرجلان ) عند قراءة القارئ هذه الآية ، فسأله عما قال ففسر له هذا التفسير ، فقال له عمر ، ( لله تلادك يا ابن عباس ) ! وقيل : نزلت فيمن يقتحم القتال . حمل هشام بن عامر على الصف في القسطنطينية فقاتل حتى قتل ، فقرأ أبو هريرة : ومن الناس من يشري نفسه ابتغاء مرضات الله ، ومثله عن أبي أيوب . وقيل : نزلت في شهداء غزوة الرجيع . وقال قتادة : هم المهاجرون والأنصار . وقيل : نزلت في علي رضي الله عنه حين تركه النبي صلى الله عليه وسلم على فراشه ليلة خرج إلى الغار ، على ما يأتي بيانه في \" براءة \" إن شاء الله تعالى . وقيل : الآية عامة ، تتناول كل مجاهد في سبيل الله ، أو مستشهد في ذاته أو مغير منكر . وقد تقدم حكم من حمل على الصف ، ويأتي ذكر المغير للمنكر وشروطه وأحكامه في \" آل عمران \" إن شاء الله تعالى .\nو يشري معناه يبيع ، ومنه وشروه بثمن بخس أي باعوه ، وأصله الاستبدال ، ومنه قوله تعالى : إن الله اشترى من المؤمنين أنفسهم وأموالهم بأن لهم الجنة . ومنه قول الشاعر :\nوإن كان ريب الدهر أمضاك في الألى شروا هذه الدنيا بجناته الخلد\nوقال آخر :\nوشريت بردا ليتني من بعد\nبرد كنت هامه\nالبرد هنا اسم غلام . وقال آخر :\nيعطي بها ثمنا فيمنعها ويقول صاحبها ألا فأشر\nوبيع النفس هنا هو بذلها لأوامر الله . \" ابتغاء \" مفعول من أجله . ووقف الكسائي على \" مرضات \" بالتاء ، والباقون بالهاء . قال أبو علي : وقف الكسائي بالتاء إما على لغة من يقول : طلحت وعلقمت ، ومنه قول الشاعر :\nبل جوزتيهاء كظهر الحجفت\nوإما أنه لما كان هذا المضاف إليه في ضمن اللفظة ولابد أثبت التاء كما ثبتت في الوصل ليعلم أن المضاف إليه مراد . والمرضاة الرضا ، يقال : رضي يرضى رضا ومرضاة . وحكى قوم أنه يقال : شرى بمعنى اشترى ، ويحتاج إلى هذا من تأول الآية في صهيب ؛ لأنه اشترى نفسه بماله ولم يبعها ، اللهم إلا أن يقال : إن عرض صهيب على قتالهم بيع لنفسه من الله . فيستقيم اللفظ على معنى باع .\n                                    ",
        "saadi": "وَمِنَ ٱلنَّاسِ مَن يَشۡرِي نَفۡسَهُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِۚ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ ٧٠٢\n                                        \n                                        \n                                        \n                                        هؤلاء هم الموفقون الذين باعوا أنفسهم وأرخصوها وبذلوها طلبا لمرضاة الله ورجاء لثوابه، فهم بذلوا الثمن للمليء الوفي الرءوف بالعباد، الذي من رأفته ورحمته أن وفقهم لذلك، وقد وعد الوفاء بذلك، فقال: { إِنَّ اللَّهَ اشْتَرَى مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوَالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ } إلى آخر الآية. وفي هذه الآية أخبر أنهم اشتروا أنفسهم وبذلوها، وأخبر برأفته الموجبة لتحصيل ما طلبوا، وبذل ما به رغبوا، فلا تسأل بعد هذا عن ما يحصل لهم من الكريم، وما ينالهم من الفوز والتكريم\n                                    "
      },
      "originalText": "وَمِنَ ٱلنَّاسِ مَن يَشۡرِي نَفۡسَهُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِۚ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ ٧٠٢"
    },
    {
      "number": 215,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا ادْخُلُوا فِي السِّلْمِ كَافَّةً وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ ۚ إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 208,
      "juz": 2,
      "manzil": 1,
      "page": 32,
      "ruku": 26,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱدۡخُلُواْ فِي ٱلسِّلۡمِ كَآفَّةٗ وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ ٨٠٢\n                                    \n                                    \n                                    يقول تعالى آمرا عباده المؤمنين به المصدقين برسوله : أن يأخذوا بجميع عرى الإسلام وشرائعه ، والعمل بجميع أوامره ، وترك جميع زواجره ما استطاعوا من ذلك .\nقال العوفي ، عن ابن عباس ، ومجاهد ، وطاوس ، والضحاك ، وعكرمة ، وقتادة ، والسدي ، وابن زيد ، في قوله : ( ادخلوا في السلم ) يعني : الإسلام .\nوقال الضحاك ، عن ابن عباس ، وأبو العالية ، والربيع بن أنس : ( ادخلوا في السلم ) يعني : الطاعة . وقال قتادة أيضا : الموادعة .\nوقوله : ( كافة ) قال ابن عباس ، ومجاهد ، وأبو العالية ، وعكرمة ، والربيع ، والسدي ، ومقاتل بن حيان ، وقتادة والضحاك : جميعا ، وقال مجاهد : أي اعملوا بجميع الأعمال ووجوه البر .\nوزعم عكرمة أنها نزلت في نفر ممن أسلم من اليهود وغيرهم ، كعبد الله بن سلام ، وثعلبة وأسد بن عبيد وطائفة استأذنوا رسول الله صلى الله عليه وسلم في أن يسبتوا ، وأن يقوموا بالتوراة ليلا . فأمرهم الله بإقامة شعائر الإسلام والاشتغال بها عما عداها . وفي ذكر عبد الله بن سلام مع هؤلاء نظر ، إذ يبعد أن يستأذن في إقامة السبت ، وهو مع تمام إيمانه يتحقق نسخه ورفعه وبطلانه ، والتعويض عنه بأعياد الإسلام .\nومن المفسرين من يجعل قوله : ( كافة ) حالا من الداخلين ، أي : ادخلوا في الإسلام كلكم . والصحيح الأول ، وهو أنهم أمروا [ كلهم ] أن يعملوا بجميع شعب الإيمان وشرائع الإسلام ، وهي كثيرة جدا ما استطاعوا منها . وقال ابن أبي حاتم : أخبرنا علي بن الحسين ، أخبرنا أحمد بن الصباح ، أخبرني الهيثم بن يمان ، حدثنا إسماعيل بن زكريا ، حدثني محمد بن عون ، عن عكرمة ، عن ابن عباس : ( يا أيها الذين آمنوا ادخلوا في السلم كافة ) كذا قرأها بالنصب يعني مؤمني أهل الكتاب ، فإنهم كانوا مع الإيمان بالله مستمسكين ببعض أمر التوراة والشرائع التي أنزلت فيهم ، فقال الله : ( ادخلوا في السلم كافة ) يقول : ادخلوا في شرائع دين محمد صلى الله عليه وسلم ولا تدعوا منها شيئا وحسبكم بالإيمان بالتوراة وما فيها .\nوقوله : ( ولا تتبعوا خطوات الشيطان ) أي : اعملوا الطاعات ، واجتنبوا ما يأمركم به الشيطان ف ( إنما يأمركم بالسوء والفحشاء وأن تقولوا على الله ما لا تعلمون ) [ البقرة : 169 ] ، و ( إنما يدعو حزبه ليكونوا من أصحاب السعير ) [ فاطر : 6 ] ; ولهذا قال : ( إنه لكم عدو مبين ( قال مطرف : أغش عباد الله لعبيد الله الشيطان .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱدۡخُلُواْ فِي ٱلسِّلۡمِ كَآفَّةٗ وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ ٨٠٢\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا ادخلوا في السلم كافة ولا تتبعوا خطوات الشيطان إنه لكم عدو مبين\nلما بين الله سبحانه الناس إلى مؤمن وكافر ومنافق فقال : كونوا على ملة واحدة ، واجتمعوا على الإسلام واثبتوا عليه . فالسلم هنا بمعنى الإسلام ، قاله مجاهد ، ورواه أبو مالك عن ابن عباس . ومنه قول الشاعر الكندي :\nدعوت عشيرتي للسلم لما رأيتهم تولوا مدبرينا\nأي إلى الإسلام لما ارتدت كندة بعد وفاة النبي صلى الله عليه وسلم مع الأشعث بن قيس الكندي ، ولأن المؤمنين لم يؤمروا قط بالدخول في المسالمة التي هي الصلح ، وإنما قيل للنبي صلى الله عليه وسلم أن يجنح للسلم إذا جنحوا له ، وأما أن يبتدئ بها فلا ، قاله الطبري . وقيل : أمر من آمن بأفواههم أن يدخلوا فيه بقلوبهم . وقال طاوس ومجاهد : ادخلوا في أمر الدين . سفيان الثوري : في أنواع البر كلها . وقرئ السلم بكسر السين .\nقال الكسائي : السلم والسلم بمعنى واحد ، وكذا هو عند أكثر البصريين ، وهما جميعا يقعان للإسلام والمسالمة . وفرق أبو عمرو بن العلاء بينهما ، فقرأها هنا : ادخلوا في السلم وقال هو الإسلام . وقرأ التي في \" الأنفال \" والتي في سورة \" محمد \" صلى الله عليه وسلم \" السلم \" بفتح السين ، وقال : هي بالفتح المسالمة . وأنكر المبرد هذه التفرقة . وقال عاصم الجحدري : السلم الإسلام ، والسلم الصلح ، والسلم الاستسلام . وأنكر محمد بن يزيد هذه التفريقات وقال : اللغة لا تؤخذ هكذا ، وإنما تؤخذ بالسماع لا بالقياس ، ويحتاج من فرق إلى دليل . وقد حكى البصريون : بنو فلان سلم وسلم وسلم ، بمعنى واحد . قال الجوهري : والسلم الصلح ، يفتح ويكسر ، ويذكر ويؤنث ، وأصله من الاستسلام والانقياد ، ولذلك قيل للصلح : سلم . قال زهير :\nوقد قلتما إن ندرك السلم واسعا بمال ومعروف من الأمر نسلم\nورجح الطبري حمل اللفظة على معنى الإسلام بما تقدم . وقال حذيفة بن اليمان في هذه الآية : الإسلام ثمانية أسهم ؛ الصلاة سهم ، والزكاة سهم ، والصوم سهم ، والحج سهم ، والعمرة سهم ، والجهاد سهم ، والأمر بالمعروف سهم ، والنهي عن المنكر سهم ، وقد خاب من لا سهم له في الإسلام . وقال ابن عباس : ( نزلت الآية في أهل الكتاب ، والمعنى ، يا أيها الذين آمنوا بموسى وعيسى ادخلوا في الإسلام بمحمد صلى الله عليه وسلم كافة ) . وفي صحيح مسلم عن أبي هريرة عن رسول الله صلى الله عليه وسلم قال : والذي نفس محمد بيده لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني ثم يموت ولم يؤمن بالذي أرسلت به إلا كان من أصحاب النار . و \" كافة \" معناه جميعا ، فهو نصب على الحال من السلم أو من ضمير المؤمنين ، وهو مشتق من قولهم : كففت أي منعت ، أي لا يمتنع منكم أحد من الدخول في الإسلام . والكف المنع ، ومنه كفة القميص - بالضم - لأنها تمنع الثوب من الانتشار ، ومنه كفة الميزان - بالكسر - التي تجمع الموزون وتمنعه أن ينتشر ، ومنه كف الإنسان الذي يجمع منافعه ومضاره ، وكل مستدير كفة ، وكل مستطيل كفة . ورجل مكفوف البصر ، أي منع عن النظر ، فالجماعة تسمى كافة لامتناعهم عن التفرق .\nولا تتبعوا نهي . خطوات الشيطان مفعول ، وقد تقدم . وقال مقاتل : استأذن عبد الله بن سلام وأصحابه بأن يقرءوا التوراة في الصلاة ، وأن يعملوا ببعض ما في التوراة ، فنزلت : ولا تتبعوا خطوات الشيطان فإن اتباع السنة أولى بعدما بعث محمد صلى الله عليه وسلم من خطوات الشيطان . وقيل : لا تسلكوا الطريق الذي يدعوكم إليه الشيطان .\nإنه لكم عدو ظاهر العداوة ، وقد تقدم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱدۡخُلُواْ فِي ٱلسِّلۡمِ كَآفَّةٗ وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ ٨٠٢\n                                        \n                                        \n                                        \n                                        هذا أمر من الله تعالى للمؤمنين أن يدخلوا { فِي السِّلْمِ كَافَّةً } أي: في جميع شرائع الدين, ولا يتركوا منها شيئا, وأن لا يكونوا ممن اتخذ إلهه هواه, إن وافق الأمر المشروع هواه فعله, وإن خالفه, تركه، بل الواجب أن يكون الهوى, تبعا للدين, وأن يفعل كل ما يقدر عليه, من أفعال الخير, وما يعجز عنه, يلتزمه وينويه, فيدركه بنيته. ولما كان الدخول في السلم كافة, لا يمكن ولا يتصور إلا بمخالفة طرق الشيطان قال: { وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ } أي: في العمل بمعاصي الله { إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ } والعدو المبين, لا يأمر إلا بالسوء والفحشاء, وما به الضرر عليكم.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱدۡخُلُواْ فِي ٱلسِّلۡمِ كَآفَّةٗ وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ ٨٠٢"
    },
    {
      "number": 216,
      "text": "فَإِنْ زَلَلْتُمْ مِنْ بَعْدِ مَا جَاءَتْكُمُ الْبَيِّنَاتُ فَاعْلَمُوا أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 209,
      "juz": 2,
      "manzil": 1,
      "page": 32,
      "ruku": 26,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِن زَلَلۡتُم مِّنۢ بَعۡدِ مَا جَآءَتۡكُمُ ٱلۡبَيِّنَٰتُ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ ٩٠٢\n                                    \n                                    \n                                    وقوله : ( فإن زللتم من بعد ما جاءتكم البينات ) أي : عدلتم عن الحق بعد ما قامت عليكم الحجج ، فاعلموا أن الله عزيز [ أي ] في انتقامه ، لا يفوته هارب ، ولا يغلبه غالب . حكيم في أحكامه ونقضه وإبرامه ; ولهذا قال أبو العالية وقتادة والربيع بن أنس : عزيز في نقمته ، حكيم في أمره . وقال محمد بن إسحاق : العزيز في نصره ممن كفر به إذا شاء ، الحكيم في عذره وحجته إلى عباده .\n                                    ",
        "qortoby": "فَإِن زَلَلۡتُم مِّنۢ بَعۡدِ مَا جَآءَتۡكُمُ ٱلۡبَيِّنَٰتُ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ ٩٠٢\n                                    \n                                    \n                                    قوله تعالى : فإن زللتم من بعد ما جاءتكم البينات فاعلموا أن الله عزيز حكيم\nفإن زللتم أي تنحيتم عن طريق الاستقامة . وأصل الزلل في القدم ، ثم يستعمل في الاعتقادات والآراء وغير ذلك ، يقال : زل يزل زلا وزللا وزلولا ، أي دحضت قدمه . وقرأ أبو السمال العدوي \" زللتم \" بكسر اللام ، وهما لغتان . وأصل الحرف من الزلق ، والمعنى ضللتم وعجتم عن الحق .\nمن بعد ما جاءتكم البينات أي المعجزات وآيات القرآن ، إن كان الخطاب للمؤمنين ، فإن كان الخطاب لأهل الكتابين فالبينات ما ورد في شرعهم من الإعلام بمحمد صلى الله عليه وسلم والتعريف به . وفي الآية دليل على أن عقوبة العالم بالذنب أعظم من عقوبة الجاهل به ، ومن لم تبلغه دعوة الإسلام لا يكون كافرا بترك الشرائع . وحكى النقاش أن كعب الأحبار لما أسلم كان يتعلم القرآن ، فأقرأه الذي كان يعلمه \" فاعلموا أن الله غفور رحيم \" فقال كعب : إني لأستنكر أن يكون هكذا ، ومر بهما رجل فقال كعب : كيف تقرأ هذه الآية ؟ فقال الرجل : فاعلموا أن الله عزيز حكيم فقال كعب : هكذا ينبغي ؛ \" عزيز \" لا يمتنع عليه ما يريده ، \" حكيم \" فيما يفعله .\n                                    ",
        "saadi": "فَإِن زَلَلۡتُم مِّنۢ بَعۡدِ مَا جَآءَتۡكُمُ ٱلۡبَيِّنَٰتُ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ ٩٠٢\n                                        \n                                        \n                                        \n                                        ولما كان العبد لا بد أن يقع منه خلل وزلل, قال تعالى: { فَإِنْ زَلَلْتُمْ مِنْ بَعْدِ مَا جَاءَتْكُمُ الْبَيِّنَاتُ } أي: على علم ويقين { فَاعْلَمُوا أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ } وفيه من الوعيد الشديد, والتخويف, ما يوجب ترك الزلل, فإن العزيز القاهر الحكيم, إذا عصاه العاصي, قهره بقوته, وعذبه بمقتضى حكمته فإن من حكمته, تعذيب العصاة والجناة.\n                                    "
      },
      "originalText": "فَإِن زَلَلۡتُم مِّنۢ بَعۡدِ مَا جَآءَتۡكُمُ ٱلۡبَيِّنَٰتُ فَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ ٩٠٢"
    },
    {
      "number": 217,
      "text": "هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ اللَّهُ فِي ظُلَلٍ مِنَ الْغَمَامِ وَالْمَلَائِكَةُ وَقُضِيَ الْأَمْرُ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 210,
      "juz": 2,
      "manzil": 1,
      "page": 32,
      "ruku": 26,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هَلۡ يَنظُرُونَ إِلَّآ أَن يَأۡتِيَهُمُ ٱللَّهُ فِي ظُلَلٖ مِّنَ ٱلۡغَمَامِ وَٱلۡمَلَٰٓئِكَةُ وَقُضِيَ ٱلۡأَمۡرُۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ ٠١٢\n                                    \n                                    \n                                    يقول تعالى مهددا للكافرين بمحمد صلوات الله وسلامه عليه : ( هل ينظرون إلا أن يأتيهم الله في ظلل من الغمام والملائكة ) يعني : يوم القيامة ، لفصل القضاء بين الأولين والآخرين ، فيجزي كل عامل بعمله ، إن خيرا فخير ، وإن شرا فشر ، ولهذا قال : ( وقضي الأمر وإلى الله ترجع الأمور ) كما قال : ( كلا إذا دكت الأرض دكا دكا وجاء ربك والملك صفا صفا وجيء يومئذ بجهنم يومئذ يتذكر الإنسان وأنى له الذكرى ) [ الفجر : 21 23 ] ، وقال : ( هل ينظرون إلا أن تأتيهم الملائكة أو يأتي ربك أو يأتي بعض آيات ربك يوم يأتي بعض آيات ربك ) الآية [ الأنعام : 158 ] .\nوقد ذكر الإمام أبو جعفر بن جرير هاهنا حديث الصور بطوله من أوله ، عن أبي هريرة ، عن رسول الله صلى الله عليه وسلم . وهو حديث مشهور ساقه غير واحد من أصحاب المسانيد وغيرهم ، وفيه : \" أن الناس إذا اهتموا لموقفهم في العرصات تشفعوا إلى ربهم بالأنبياء واحدا واحدا ، من آدم فمن بعده ، فكلهم يحيد عنها حتى ينتهوا إلى محمد ، صلوات الله وسلامه عليه ، فإذا جاءوا إليه قال : أنا لها ، أنا لها . فيذهب فيسجد لله تحت العرش ، ويشفع عند الله في أن يأتي لفصل القضاء بين العباد ، فيشفعه الله ، ويأتي في ظلل من الغمام بعد ما تنشق السماء الدنيا ، وينزل من فيها من الملائكة ، ثم الثانية ، ثم الثالثة إلى السابعة ، وينزل حملة العرش والكروبيون ، قال : وينزل الجبار ، عز وجل ، في ظلل من الغمام والملائكة ، ولهم زجل من تسبيحهم يقولون : سبحان ذي الملك والملكوت ، سبحان رب العرش ذي الجبروت ، سبحان الحي الذي لا يموت ، سبحان الذي يميت الخلائق ولا يموت ، سبوح قدوس ، رب الملائكة والروح ، قدوس قدوس ، سبحان ربنا الأعلى ، سبحان ذي السلطان والعظمة ، سبحانه أبدا أبدا \" .\nوقد أورد الحافظ أبو بكر بن مردويه هاهنا أحاديث فيها غرابة والله أعلم ; فمنها ما رواه من حديث المنهال بن عمرو ، عن أبي عبيدة بن عبد الله بن مسعود ، عن مسروق ، عن ابن مسعود ، عن النبي صلى الله عليه وسلم قال : \" يجمع الله الأولين والآخرين لميقات يوم معلوم ، قياما شاخصة أبصارهم إلى السماء ، ينتظرون فصل القضاء ، وينزل الله في ظلل من الغمام من العرش إلى الكرسي \" .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا أبو بكر بن عطاء بن مقدم ، حدثنا معتمر بن سليمان ، سمعت عبد الجليل القيسي ، يحدث عن عبد الله بن عمرو : ( هل ينظرون إلا أن يأتيهم الله في ظلل من الغمام ) الآية ، قال : يهبط حين يهبط ، وبينه وبين خلقه سبعون ألف حجاب ، منها : النور ، والظلمة ، والماء . فيصوت الماء في تلك الظلمة صوتا تنخلع له القلوب .\nقال : وحدثنا أبي : حدثنا محمد بن الوزير الدمشقي ، حدثنا الوليد قال : سألت زهير بن محمد ، عن قول الله : ( هل ينظرون إلا أن يأتيهم الله في ظلل من الغمام ) قال : ظلل من الغمام ، منظوم من الياقوت مكلل بالجوهر والزبرجد .\nوقال ابن أبي نجيح ، عن مجاهد ( في ظلل من الغمام ) قال : هو غير السحاب ، ولم يكن قط إلا لبني إسرائيل في تيههم حين تاهوا .\nوقال أبو جعفر الرازي ، عن الربيع بن أنس ، عن أبي العالية : ( هل ينظرون إلا أن يأتيهم الله في ظلل من الغمام والملائكة )\n[ قال ] : يقول : والملائكة يجيئون في ظلل من الغمام ، والله تعالى يجيء فيما يشاء وهي في بعض القراءة : \" هل ينظرون إلا أن يأتيهم الله والملائكة في ظلل من الغمام \" وهي كقوله : ( ويوم تشقق السماء بالغمام ونزل الملائكة تنزيلا ) [ الفرقان : 25 ] .\n                                    ",
        "qortoby": "هَلۡ يَنظُرُونَ إِلَّآ أَن يَأۡتِيَهُمُ ٱللَّهُ فِي ظُلَلٖ مِّنَ ٱلۡغَمَامِ وَٱلۡمَلَٰٓئِكَةُ وَقُضِيَ ٱلۡأَمۡرُۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ ٠١٢\n                                    \n                                    \n                                    قوله تعالى : هل ينظرون إلا أن يأتيهم الله في ظلل من الغمام والملائكة وقضي الأمر وإلى الله ترجع الأمور هل ينظرون يعني التاركين الدخول في السلم ، و \" هل \" يراد به هنا الجحد ، أي ما ينتظرون . إلا أن يأتيهم الله في ظلل من الغمام والملائكة نظرته وانتظرته بمعنى . والنظر الانتظار . وقرأ قتادة وأبو جعفر يزيد بن القعقاع والضحاك \" في ظلال من الغمام \" . وقرأ أبو جعفر \" والملائكة \" بالخفض عطفا على الغمام ، وتقديره مع الملائكة ، تقول العرب : أقبل الأمير في العسكر ، أي مع العسكر . ( ظلل ) جمع ظلة في التكسير ، كظلمة وظلم وفي التسليم ظللات ، وأنشد سيبويه : - للشاعر الجعدي -\nإذا الوحش ضم الوحش في ظللاتها سواقط من حر وقد كان أظهرا\nوظلات وظلال ، جمع ظل في الكثير ، والقليل أظلال . ويجوز أن يكون ظلال جمع ظلة ، مثل قوله : قلة وقلال ، كما قال الشاعر :\nممزوجة بماء القلال\nقال الأخفش سعيد : و \" الملائكة \" بالخفض بمعنى وفي الملائكة . قال : والرفع أجود ، كما قال : هل ينظرون إلا أن تأتيهم الملائكة ، وجاء ربك والملك صفا صفا . قال الفراء : وفي قراءة عبد الله : \" هل ينظرون إلا أن يأتيهم الله والملائكة في ظلل من الغمام \" . قال قتادة : \" الملائكة \" يعني تأتيهم لقبض أرواحهم ، ويقال يوم القيامة ، وهو أظهر . قال أبو العالية والربيع : تأتيهم الملائكة في ظلل من الغمام ، ويأتيهم الله فيما شاء . وقال الزجاج : التقدير في ظلل من الغمام ومن الملائكة . وقيل : ليس الكلام على ظاهره في حقه سبحانه ، وإنما المعنى يأتيهم أمر الله وحكمه . وقيل : أي بما وعدهم من الحساب والعذاب في ظلل ، مثل : فأتاهم الله من حيث لم يحتسبوا ؛ أي بخذلانه إياهم ، هذا قول الزجاج ، والأول قول الأخفش سعيد . وقد يحتمل أن يكون معنى الإتيان راجعا إلى الجزاء ، فسمى الجزاء إتيانا كما سمى التخويف والتعذيب في قصة نمروذ إتيانا فقال : فأتى الله بنيانهم من القواعد فخر عليهم السقف من فوقهم . وقال في قصة النضير : فأتاهم الله من حيث لم يحتسبوا وقذف في قلوبهم الرعب ، وقال : وإن كان مثقال حبة من خردل أتينا بها . وإنما احتمل الإتيان هذه المعاني لأن أصل الإتيان عند أهل اللغة هو القصد إلى الشيء ، فمعنى الآية : هل ينظرون إلا أن يظهر الله تعالى فعلا من الأفعال مع خلق من خلقه يقصد إلى مجازاتهم ويقضي في أمرهم ما هو قاض ، وكما أنه سبحانه أحدث فعلا سماه نزولا واستواء كذلك يحدث فعلا يسميه إتيانا ، وأفعاله بلا آلة ولا علة ، سبحانه! وقال ابن عباس في رواية أبي صالح : هذا من المكتوم الذي لا يفسر . وقد سكت بعضهم عن تأويلها ، وتأولها بعضهم كما ذكرنا . وقيل : الفاء بمعنى الباء ، أي يأتيهم بظلل ، ومنه الحديث : يأتيهم الله في صورة أي بصورة امتحانا لهم ولا يجوز أن يحمل هذا وما أشبهه مما جاء في القرآن والخبر على وجه الانتقال والحركة والزوال ؛ لأن ذلك من صفات الأجرام والأجسام ، تعالى الله الكبير المتعال ، ذو الجلال والإكرام عن مماثلة الأجسام علوا كبيرا . \" والغمام \" : السحاب الرقيق الأبيض ، سمي بذلك لأنه يغم ، أي يستر ، كما تقدم . وقرأ معاذ بن جبل : \" وقضاء الأمر \" . وقرأ يحيى بن يعمر \" وقضي الأمور \" بالجمع . والجمهور وقضي الأمر فالمعنى وقع الجزاء وعذب أهل العصيان . وقرأ ابن عامر وحمزة والكسائي \" ترجع الأمور \" على بناء الفعل للفاعل ، وهو الأصل ، دليله ألا إلى الله تصير الأمور ، إلى الله مرجعكم . وقرأ الباقون ترجع على بنائه للمفعول ، وهي أيضا قراءة حسنة ، دليله ثم تردون ، ثم ردوا إلى الله ، ولئن رددت إلى ربي . والقراءتان حسنتان بمعنى ، والأصل الأولى ، وبناؤه للمفعول توسع وفرع ، والأمور كلها راجعة إلى الله قبل وبعد . وإنما نبه بذكر ذلك في يوم القيامة على زوال ما كان منها إلى الملوك في الدنيا .\n                                    ",
        "saadi": "هَلۡ يَنظُرُونَ إِلَّآ أَن يَأۡتِيَهُمُ ٱللَّهُ فِي ظُلَلٖ مِّنَ ٱلۡغَمَامِ وَٱلۡمَلَٰٓئِكَةُ وَقُضِيَ ٱلۡأَمۡرُۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ ٠١٢\n                                        \n                                        \n                                        \n                                        وهذا فيه من الوعيد الشديد والتهديد ما تنخلع له القلوب، يقول تعالى: هل ينتظر الساعون في الفساد في الأرض, المتبعون لخطوات الشيطان, النابذون لأمر الله إلا يوم الجزاء بالأعمال, الذي قد حشي من الأهوال والشدائد والفظائع, ما يقلقل قلوب الظالمين, ويحق به الجزاء السيئ على المفسدين. وذلك أن الله تعالى يطوي السماوات والأرض, وتنثر الكواكب, وتكور الشمس والقمر, وتنزل الملائكة الكرام, فتحيط بالخلائق, وينزل الباري [تبارك] تعالى: { فِي ظُلَلٍ مِنَ الْغَمَامِ } ليفصل بين عباده بالقضاء العدل. فتوضع الموازين, وتنشر الدواوين, وتبيض وجوه أهل السعادة وتسود وجوه أهل الشقاوة, ويتميز أهل الخير من أهل الشر، وكل يجازى بعمله، فهنالك يعض الظالم على يديه إذا علم حقيقة ما هو عليه. وهذه الآية وما أشبهها دليل لمذهب أهل السنة والجماعة, المثبتين للصفات الاختيارية, كالاستواء, والنزول, والمجيء, ونحو ذلك من الصفات التي أخبر بها تعالى, عن نفسه, أو أخبر بها عنه رسوله صلى الله عليه وسلم، فيثبتونها على وجه يليق بجلال الله وعظمته, من غير تشبيه ولا تحريف، خلافا للمعطلة على اختلاف أنواعهم, من الجهمية, والمعتزلة, والأشعرية ونحوهم, ممن ينفي هذه الصفات, ويتأول لأجلها الآيات بتأويلات ما أنزل الله عليها من سلطان, بل حقيقتها القدح في بيان الله وبيان رسوله, والزعم بأن كلامهم هو الذي تحصل به الهداية في هذا الباب، فهؤلاء ليس معهم دليل نقلي, بل ولا دليل عقلي، أما النقلي فقد اعترفوا أن النصوص الواردة في الكتاب والسنة, ظاهرها بل صريحها, دال على مذهب أهل السنة والجماعة, وأنها تحتاج لدلالتها على مذهبهم الباطل, أن تخرج عن ظاهرها ويزاد فيها وينقص، وهذا كما ترى لا يرتضيه من في قلبه مثقال ذرة من إيمان. وأما العقل فليس في العقل ما يدل على نفي هذه الصفات، بل العقل دل على أن الفاعل أكمل من الذي لا يقدر على الفعل, وأن فعله تعالى المتعلق بنفسه والمتعلق بخلقه هو كمال، فإن زعموا أن إثباتها يدل على التشبيه بخلقه، قيل لهم: الكلام على الصفات, يتبع الكلام على الذات، فكما أن لله ذاتا لا تشبهها الذوات, فلله صفات لا تشبهها الصفات، فصفاته تبع لذاته, وصفات خلقه, تبع لذواتهم, فليس في إثباتها ما يقتضي التشبيه بوجه. ويقال أيضا, لمن أثبت بعض الصفات, ونفى بعضا, أو أثبت الأسماء دون الصفات: إما أن تثبت الجميع كما أثبته الله لنفسه, وأثبته رسوله، وإما أن تنفي الجميع, وتكون منكرا لرب العالمين، وأما إثباتك بعض ذلك, ونفيك لبعضه, فهذا تناقض، ففرق بين ما أثبته, وما نفيته, ولن تجد إلى الفرق سبيلا، فإن قلت: ما أثبته لا يقتضي تشبيها، قال لك أهل السنة: والإثبات لما نفيته لا يقتضي تشبيها، فإن قلت: لا أعقل من الذي نفيته إلا التشبيه، قال لك النفاة: ونحن لا نعقل من الذي أثبته إلا التشبيه، فما أجبت به النفاة, أجابك به أهل السنة, لما نفيته. والحاصل أن من نفى شيئا وأثبت شيئا مما دل الكتاب والسنة على إثباته, فهو متناقض, لا يثبت له دليل شرعي ولا عقلي, بل قد خالف المعقول والمنقول.\n                                    "
      },
      "originalText": "هَلۡ يَنظُرُونَ إِلَّآ أَن يَأۡتِيَهُمُ ٱللَّهُ فِي ظُلَلٖ مِّنَ ٱلۡغَمَامِ وَٱلۡمَلَٰٓئِكَةُ وَقُضِيَ ٱلۡأَمۡرُۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ ٠١٢"
    }
  ]
}