{
  "number": 320,
  "ayahsNumber": 12,
  "ayahs": [
    {
      "number": 2462,
      "text": "فَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ ۗ وَلَا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضَىٰ إِلَيْكَ وَحْيُهُ ۖ وَقُلْ رَبِّ زِدْنِي عِلْمًا",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 114,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 275,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۗ وَلَا تَعۡجَلۡ بِٱلۡقُرۡءَانِ مِن قَبۡلِ أَن يُقۡضَىٰٓ إِلَيۡكَ وَحۡيُهُۥۖ وَقُل رَّبِّ زِدۡنِي عِلۡمٗا ٤١١\n                                    \n                                    \n                                    وقوله : ( ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه ) كقوله تعالى في سورة \" لا أقسم بيوم القيامة \" ( لا تحرك به لسانك لتعجل به إن علينا جمعه وقرآنه فإذا قرأناه فاتبع قرآنه ثم إن علينا بيانه ) [ القيامة : 16 - 19 ] ، وثبت في الصحيح عن ابن عباس ; أن رسول الله صلى الله عليه وسلم كان يعالج من الوحي شدة ، فكان مما يحرك لسانه ، فأنزل الله هذه الآية يعني : أنه ، عليه السلام ، كان إذا جاءه جبريل بالوحي ، كلما قال جبريل آية قالها معه ، من شدة حرصه على حفظ القرآن ، فأرشده الله تعالى إلى ما هو الأسهل والأخف في حقه; لئلا يشق عليه . فقال : ( لا تحرك به لسانك لتعجل به إن علينا جمعه وقرآنه ) أي : أن نجمعه في صدرك ، ثم تقرأه على الناس من غير أن تنسى منه شيئا ، ( فإذا قرأناه فاتبع قرآنه ثم إن علينا بيانه )\nوقال في هذه الآية : ( ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه ) أي : بل أنصت ، فإذا فرغ الملك من قراءته عليك فاقرأه بعده ، ( وقل رب زدني علما ) أي : زدني منك علما .\nقال ابن عيينة ، رحمه الله : ولم يزل صلى الله عليه وسلم في زيادة [ من العلم ] حتى توفاه الله عز وجل .\nولهذا جاء في الحديث : \" إن الله تابع الوحي على رسوله ، حتى كان الوحي أكثر ما كان يوم توفي رسول الله صلى الله عليه وسلم وقال ابن ماجه : حدثنا أبو بكر ابن أبى شيبة ، حدثنا عبد الله بن نمير ، عن موسى بن عبيدة ، عن محمد بن ثابت ، عن أبي هريرة ، رضي الله عنه ، قال : كان رسول الله صلى الله عليه وسلم يقول : \" اللهم انفعني بما علمتني ، وعلمني ما ينفعني ، وزدني علما ، والحمد لله على كل حال \" .\nوأخرجه الترمذي ، عن أبي كريب ، عن عبد الله بن نمير ، به . وقال : غريب من هذا الوجه . ورواه البزار عن عمرو بن علي الفلاس ، عن أبي عاصم ، عن موسى بن عبيدة ، به . وزاد في آخره : \" وأعوذ بالله من حال أهل النار \" .\n                                    ",
        "qortoby": "فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۗ وَلَا تَعۡجَلۡ بِٱلۡقُرۡءَانِ مِن قَبۡلِ أَن يُقۡضَىٰٓ إِلَيۡكَ وَحۡيُهُۥۖ وَقُل رَّبِّ زِدۡنِي عِلۡمٗا ٤١١\n                                    \n                                    \n                                    قوله تعالى : فتعالى الله الملك الحق لما عرف العباد عظيم نعمه ، وإنزال القرآن ، نزه نفسه عن الأولاد والأنداد فقال : فتعالى الله أي جل الله الملك الحق ؛ أي ذو الحق . ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه علم نبيه كيف يتلقى القرآن . قال ابن عباس كان - عليه السلام - يبادر جبريل فيقرأ قبل أن يفرغ جبريل من الوحي حرصا على الحفظ ، وشفقة على القرآن مخافة النسيان ، فنهاه الله عن ذلك وأنزل ولا تعجل بالقرآن وهذا كقوله : لا تحرك به لسانك لتعجل به على ما يأتي . وروى ابن أبي نجيح عن مجاهد قال : لا تتله قبل أن تتبينه . وقيل : ولا تعجل أي لا تسل إنزاله من قبل أن يقضى أي يأتيك وحيه . وقيل : المعنى لا تلقه إلى الناس قبل أن يأتيك بيان تأويله . قال الحسن : نزلت في رجل لطم وجه امرأته ؛ فجاءت إلى النبي - صلى الله عليه وسلم - تطلب القصاص ، فجعل النبي - صلى الله عليه وسلم - لها القصاص فنزل الرجال قوامون على النساء ولهذا قال : وقل رب زدني علما أي فهما ؛ لأنه - عليه السلام - حكم بالقصاص وأبى الله ذلك . وقرأ ابن مسعود وغيره ( من قبل أن نقضي ) بالنون وكسر الضاد ( وحيه ) بالنصب .\n                                    ",
        "saadi": "فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۗ وَلَا تَعۡجَلۡ بِٱلۡقُرۡءَانِ مِن قَبۡلِ أَن يُقۡضَىٰٓ إِلَيۡكَ وَحۡيُهُۥۖ وَقُل رَّبِّ زِدۡنِي عِلۡمٗا ٤١١\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى حكمه الجزائي في عباده، وحكمه الأمري الديني، الذي أنزله في كتابه، وكان هذا من آثار ملكه قال: { فَتَعَالَى اللَّهُ } أي: جل وارتفع وتقدس عن كل نقص وآفة، { الْمُلْكُ } الذي الملك وصفه، والخلق كلهم مماليك له، وأحكام الملك القدرية والشرعية، نافذة فيهم.\n{ الْحَقُّ } أي: وجوده وملكه وكماله حق، فصفات الكمال، لا تكون حقيقة إلا لذي الجلال، ومن ذلك: الملك، فإن غيره من الخلق، وإن كان له ملك في بعض الأوقات، على بعض الأشياء، فإنه ملك قاصر باطل يزول، وأما الرب، فلا يزال ولا يزول ملكا حيا قيوما جليلا.\n{ وَلَا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضَى إِلَيْكَ وَحْيُهُ } أي: لا تبادر بتلقف القرآن حين يتلوه عليك جبريل، واصبر حتى يفرغ منه، فإذا فرغ منه فاقرأه، فإن الله قد ضمن لك جمعه في صدرك وقراءتك إياه، كما قال تعالى: { لَا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ } ولما كانت عجلته صلى الله عليه وسلم، على تلقف الوحي ومبادرته إليه، تدل على محبته التامة للعلم وحرصه عليه، أمره الله تعالى أن يسأله زيادة العلم، فإن العلم خير، وكثرة الخير مطلوبة، وهي من الله، والطريق إليها الاجتهاد، والشوق للعلم، وسؤال الله، والاستعانة به، والافتقار إليه في كل وقت.\nويؤخذ من هذه الآية الكريمة، الأدب في تلقي العلم، وأن المستمع للعلم ينبغي له أن يتأنى ويصبر حتى يفرغ المملي والمعلم من كلامه المتصل بعضه ببعض، فإذا فرغ منه سأل إن كان عنده سؤال، ولا يبادر بالسؤال وقطع كلام ملقي العلم، فإنه سبب للحرمان، وكذلك المسئول، ينبغي له أن يستملي سؤال السائل، ويعرف المقصود منه قبل الجواب، فإن ذلك سبب لإصابة الصواب.\n                                    "
      },
      "originalText": "فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۗ وَلَا تَعۡجَلۡ بِٱلۡقُرۡءَانِ مِن قَبۡلِ أَن يُقۡضَىٰٓ إِلَيۡكَ وَحۡيُهُۥۖ وَقُل رَّبِّ زِدۡنِي عِلۡمٗا ٤١١"
    },
    {
      "number": 2463,
      "text": "وَلَقَدْ عَهِدْنَا إِلَىٰ آدَمَ مِنْ قَبْلُ فَنَسِيَ وَلَمْ نَجِدْ لَهُ عَزْمًا",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 115,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 275,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ عَهِدۡنَآ إِلَىٰٓ ءَادَمَ مِن قَبۡلُ فَنَسِيَ وَلَمۡ نَجِدۡ لَهُۥ عَزۡمٗا ٥١١\n                                    \n                                    \n                                    قال ابن أبي حاتم : حدثنا أحمد بن سنان ، حدثنا أسباط بن محمد ، حدثنا الأعمش ، عن سعيد بن جبير ، عن ابن عباس قال : إنما سمي الإنسان لأنه عهد إليه فنسي . وكذا رواه علي بن أبي طلحة ، عنه .\nوقال مجاهد والحسن : ترك .\n                                    ",
        "qortoby": "وَلَقَدۡ عَهِدۡنَآ إِلَىٰٓ ءَادَمَ مِن قَبۡلُ فَنَسِيَ وَلَمۡ نَجِدۡ لَهُۥ عَزۡمٗا ٥١١\n                                    \n                                    \n                                    قوله تعالى : ولقد عهدنا إلى آدم من قبل فنسي ولم نجد له عزما\nقوله تعالى : ولقد عهدنا إلى آدم من قبل فنسي قرأ الأعمش باختلاف عنه ( فنسي ) بإسكان الياء وله معنيان أحدهما : ترك ؛ أي ترك الأمر والعهد ؛ وهذا قول مجاهد وأكثر المفسرين ومنه نسوا الله فنسيهم . وثانيهما : قال ابن عباس ( نسي ) هنا من السهو والنسيان ، وإنما أخذ الإنسان منه لأنه عهد إليه فنسي . قال ابن زيد نسي ما عهد الله إليه في ذلك ، ولو كان له عزم ما أطاع عدوه إبليس . وعلى هذا القول يحتمل أن يكون آدم - عليه السلام - في ذلك الوقت مأخوذا بالنسيان ، وإن كان النسيان عنا اليوم مرفوعا . ومعنى من قبل أي من قبل أن يأكل من الشجرة ؛ لأنه نهي عنها . والمراد تسلية النبي - صلى الله عليه وسلم - ؛ أي طاعة بني آدم الشيطان أمر قديم ؛ أي إن نقض هؤلاء العهد فإن آدم أيضا عهدنا إليه فنسي ؛ حكاه القشيري وكذلك الطبري . أي وإن يعرض يا محمد هؤلاء الكفرة عن آياتي ، ويخالفوا رسلي ، ويطيعوا إبليس فقدما فعل ذلك أبوهم آدم . قال ابن عطية : وهذا التأويل ضعيف ، وذلك كون آدم مثالا للكفار الجاحدين بالله ليس بشيء وآدم إنما عصى بتأويل ، ففي هذا غضاضة عليه - صلى الله عليه وسلم - ؛ وإنما الظاهر في الآية إما أن يكون ابتداء قصص لا تعلق له بما قبله ، وإما أن يجعل تعلقه أنه لما عهد إلى محمد - صلى الله عليه وسلم - ألا يعجل بالقرآن ، مثل له بنبي قبله عهد إليه فنسي فعوقب ؛ ليكون أشد في التحذير ، وأبلغ في العهد إلى محمد - صلى الله عليه وسلم - ؛ والعهد هاهنا في معنى الوصية ؛ ( ونسي ) معناه ترك ؛ ونسيان الذهول لا يمكن هنا ؛ لأنه لا يتعلق بالناسي عقاب . والعزم المضي على المعتقد في أي شيء كان ؛ وآدم - عليه السلام - قد كان يعتقد ألا يأكل من الشجرة لكن لما وسوس إليه إبليس لم يعزم على معتقده . والشيء الذي عهد إلى آدم هو ألا يأكل من الشجرة ، وأعلم مع ذلك أن إبليس عدو له .\nواختلف في معنى قوله : ولم نجد له عزما فقال ابن عباس وقتادة : لم نجد له صبرا عن أكل الشجرة ، ومواظبة على التزام الأمر . قال النحاس وكذلك هو في اللغة ؛ يقال : لفلان عزم أي صبر وثبات على التحفظ من المعاصي حتى يسلم منها ، ومنه فاصبر كما صبر أولوا العزم من الرسل . وعن ابن عباس أيضا وعطية العوفي : حفظا لما أمر به ؛ أي لم يتحفظ مما نهيته حتى نسي وذهب عن علم ذلك بترك الاستدلال ؛ وذلك أن إبليس قال له : إن أكلتها خلدت في الجنة يعني عين تلك الشجرة ، فلم يطعه فدعاه إلى نظير تلك الشجرة مما دخل في عموم النهي وكان يجب أن يستدل عليه فلم يفعل ، وظن أنها لم تدخل في النهي فأكلها تأويلا ، ولا يكون ناسيا للشيء من يعلم أنه معصية . وقال ابن زيد : عزما محافظة على أمر الله . وقال الضحاك : عزيمة أمر . ابن كيسان : إصرارا ولا إضمارا للعود إلى الذنب . قال القشيري : والأول أقرب إلى تأويل الكلام ؛ ولهذا قال قوم : آدم لم يكن من أولي العزم من الرسل ؛ لأن الله تعالى قال : ولم نجد له عزما . وقال المعظم : كل الرسل أولو العزم ، وفي الخبر ( ما من نبي إلا وقد أخطأ أو هم بخطيئة ما خلا يحيى بن زكريا ) فلو خرج آدم بسبب خطيئته من جملة أولي العزم لخرج جميع الأنبياء سوى يحيى . وقد قال أبو أمامة : لو أن أحلام بني آدم جمعت منذ خلق الله الخلق إلى يوم القيامة ، ووضعت في كفة ميزان ، ووضع حلم آدم في كفة أخرى لرجحهم ؛ وقد قال الله تبارك وتعالى : ولم نجد له عزما .\n                                    ",
        "saadi": "وَلَقَدۡ عَهِدۡنَآ إِلَىٰٓ ءَادَمَ مِن قَبۡلُ فَنَسِيَ وَلَمۡ نَجِدۡ لَهُۥ عَزۡمٗا ٥١١\n                                        \n                                        \n                                        \n                                        أي: ولقد وصينا آدم وأمرناه، وعهدنا إليه عهدا ليقوم به، فالتزمه، وأذعن له وانقاد، وعزم على القيام به، ومع ذلك نسي ما أمر به، وانتقضت عزيمته المحكمة، فجرى عليه ما جرى، فصار عبرة لذريته، وصارت طبائعهم مثل طبيعته، نسي آدم فنسيت ذريته، وخطئ فخطئوا، ولم يثبت على العزم المؤكد، وهم كذلك، وبادر بالتوبة من خطيئته، وأقر بها واعترف، فغفرت له، ومن يشابه أباه فما ظلم.\n                                    "
      },
      "originalText": "وَلَقَدۡ عَهِدۡنَآ إِلَىٰٓ ءَادَمَ مِن قَبۡلُ فَنَسِيَ وَلَمۡ نَجِدۡ لَهُۥ عَزۡمٗا ٥١١"
    },
    {
      "number": 2464,
      "text": "وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 116,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ ٦١١\n                                    \n                                    \n                                    وقوله : ( وإذ قلنا للملائكة اسجدوا لآدم ) يذكر تعالى تشريف آدم وتكريمه ، وما فضله به على كثير ممن خلق تفضيلا .\nوقد تقدم الكلام على هذه القصة في سورة \" البقرة \" وفي \" الأعراف \" وفي \" الحجر \" و \" الكهف \" وسيأتي في آخر سورة \" ص \" [ إن شاء الله تعالى ] . يذكر فيها تعالى خلق آدم وأمره الملائكة بالسجود له تشريفا وتكريما ، ويبين عداوة إبليس لبني آدم ولأبيهم قديما; ولهذا قال تعالى : ( فسجدوا إلا إبليس أبى ) أي : امتنع واستكبر .\n                                    ",
        "qortoby": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ ٦١١\n                                    \n                                    \n                                    تقدم في ( البقرة ) مستوفى .\n                                    ",
        "saadi": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ ٦١١\n                                        \n                                        \n                                        \n                                        أي: لما أكمل خلق آدم بيده، وعلمه الأسماء، وفضله، وكرمه، أمر الملائكة بالسجود له، إكراما وتعظيما وإجلالا، فبادروا بالسجود ممتثلين، وكان بينهم إبليس، فاستكبر عن أمر ربه، وامتنع من السجود لآدم وقال: { أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ وَخَلَقْتَهُ مِنْ طِينٍ } فتبينت حينئذ، عداوته البليغة لآدم وزوجه، لما كان عدوا لله، وظهر من حسده، ما كان سبب العداوة\n                                    "
      },
      "originalText": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ ٦١١"
    },
    {
      "number": 2465,
      "text": "فَقُلْنَا يَا آدَمُ إِنَّ هَٰذَا عَدُوٌّ لَكَ وَلِزَوْجِكَ فَلَا يُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 117,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَقُلۡنَا يَٰٓـَٔادَمُ إِنَّ هَٰذَا عَدُوّٞ لَّكَ وَلِزَوۡجِكَ فَلَا يُخۡرِجَنَّكُمَا مِنَ ٱلۡجَنَّةِ فَتَشۡقَىٰٓ ٧١١\n                                    \n                                    \n                                    ( فقلنا يا آدم إن هذا عدو لك ولزوجك ) يعني : حواء ، عليهما السلام ( فلا يخرجنكما من الجنة فتشقى ) أي : إياك أن يسعى في إخراجك منها ، فتتعب وتعنى وتشقى في طلب رزقك ، فإنك هاهنا في عيش رغيد هنيء ، لا كلفة ولا مشقة .\n                                    ",
        "qortoby": "فَقُلۡنَا يَٰٓـَٔادَمُ إِنَّ هَٰذَا عَدُوّٞ لَّكَ وَلِزَوۡجِكَ فَلَا يُخۡرِجَنَّكُمَا مِنَ ٱلۡجَنَّةِ فَتَشۡقَىٰٓ ٧١١\n                                    \n                                    \n                                    فقلنا يا آدم إن هذا عدو لك ولزوجك فلا يخرجنكما من الجنة نهي ؛ ومجازه : لا تقبلا منه فيكون ذلك سببا لخروجكما من الجنة فتشقى يعني أنت وزوجك لأنهما في استواء العلة واحد ؛ ولم يقل : فتشقيا لأن المعنى معروف ، وآدم - عليه السلام - هو المخاطب ، وهو المقصود . وأيضا لما كان الكاد عليها والكاسب لها كان بالشقاء أخص . وقيل : الإخراج واقع عليهما والشقاوة على آدم وحده ، وهو شقاوة البدن ؛ ألا ترى أنه عقبه بقوله : إن لك ألا تجوع فيها ولا تعرى أي في الجنة وأنك لا تظمأ فيها ولا تضحى فأعلمه أن له في الجنة هذا كله : الكسوة والطعام والشراب والمسكن ؛ وأنك إن ضيعت الوصية ، وأطعت العدو أخرجكما من الجنة فشقيت تعبا ونصبا ، أي جعت وعريت وظمئت وأصابتك الشمس ؛ لأنك ترد إلى الأرض إذا أخرجت من الجنة . وإنما خصه بذكر الشقاء ولم يقل فتشقيان : يعلمنا أن نفقة الزوجة على الزوج ؛ فمن يومئذ جرت نفقة النساء على الأزواج ، فلما كانت نفقة حواء على آدم كذلك نفقات بناتها على بني آدم بحق الزوجية . وأعلمنا في هذه الآية أن النفقة التي تجب للمرأة على زوجها هذه الأربعة : الطعام والشراب والكسوة والمسكن ؛ فإذا أعطاها هذه الأربعة فقد خرج إليها من نفقتها ؛ فإن تفضل بعد ذلك فهو مأجور ، فأما هذه الأربعة فلا بد لها منها ؛ لأن بها إقامة المهجة . قال الحسن المراد بقوله : فتشقى شقاء الدنيا ، لا يرى ابن آدم إلا ناصبا . وقال الفراء هو أن يأكل من كد يديه . وقال سعيد بن جبير : أهبط إلى آدم ثور أحمر فكان يحرث عليه ، ويمسح العرق عن جبينه ، فهو شقاؤه الذي قال الله تبارك وتعالى . وقيل : لما أهبط من الجنة كان من أول شقائه أن جبريل أنزل عليه حبات من الجنة ؛ فقال يا آدم ازرع هذا ، فحرث وزرع ، ثم حصد ثم درس ثم نقى ثم طحن ثم عجن ثم خبز ، ثم جلس ليأكل بعد التعب ؛ فتدحرج رغيفه من يده حتى صار أسفل الجبل ، وجرى وراءه آدم حتى تعب وقد عرق جبينه ، قال يا آدم فكذلك رزقك بالتعب والشقاء ، ورزق ولدك من بعدك ما كنت في الدنيا .\n                                    ",
        "saadi": "فَقُلۡنَا يَٰٓـَٔادَمُ إِنَّ هَٰذَا عَدُوّٞ لَّكَ وَلِزَوۡجِكَ فَلَا يُخۡرِجَنَّكُمَا مِنَ ٱلۡجَنَّةِ فَتَشۡقَىٰٓ ٧١١\n                                        \n                                        \n                                        \n                                        فحذر الله آدم وزوجه منه، وقال { لَا يُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقَى } إذا أخرجت منها، فإن لك فيها الرزق الهني، والراحة التامة.\n                                    "
      },
      "originalText": "فَقُلۡنَا يَٰٓـَٔادَمُ إِنَّ هَٰذَا عَدُوّٞ لَّكَ وَلِزَوۡجِكَ فَلَا يُخۡرِجَنَّكُمَا مِنَ ٱلۡجَنَّةِ فَتَشۡقَىٰٓ ٧١١"
    },
    {
      "number": 2466,
      "text": "إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 118,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعۡرَىٰ ٨١١\n                                    \n                                    \n                                    ( إن لك ألا تجوع فيها ولا تعرى ) إنما قرن بين الجوع والعري; لأن الجوع ذل الباطن ، والعري ذل الظاهر .\n                                    ",
        "qortoby": "إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعۡرَىٰ ٨١١\n                                    \n                                    \n                                    \" إن لك ألا تجوع فيها \" أي في الجنة \" ولا تعرى \"\n                                    ",
        "saadi": "إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعۡرَىٰ ٨١١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 118 و119 :ـ\n{ إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَى وَأَنَّكَ لَا تَظْمَأُ فِيهَا وَلَا تَضْحَى } أي: تصيبك الشمس بحرها، فضمن له استمرار الطعام والشراب، والكسوة، والماء، وعدم التعب والنصب\n                                    "
      },
      "originalText": "إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعۡرَىٰ ٨١١"
    },
    {
      "number": 2467,
      "text": "وَأَنَّكَ لَا تَظْمَأُ فِيهَا وَلَا تَضْحَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 119,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَنَّكَ لَا تَظۡمَؤُاْ فِيهَا وَلَا تَضۡحَىٰ ٩١١\n                                    \n                                    \n                                    ( وأنك لا تظمأ فيها ولا تضحى ) وهذان أيضا متقابلان ، فالظمأ : حر الباطن ، وهو العطش . والضحى : حر الظاهر .\n                                    ",
        "qortoby": "وَأَنَّكَ لَا تَظۡمَؤُاْ فِيهَا وَلَا تَضۡحَىٰ ٩١١\n                                    \n                                    \n                                    وأنك لا تظمأ فيها أي لا تعطش . والظمأ العطش . ولا تضحى أي تبرز للشمس فتجد حرها . إذ ليس في الجنة شمس ، إنما هو ظل ممدود ، كما بين طلوع الفجر إلى طلوع الشمس . قال أبو العالية : نهار الجنة هكذا : وأشار إلى ساعة المصلين صلاة الفجر . قال أبو زيد : ضحا الطريق يضحو ضحوا إذا بدا لك وظهر . وضحيت وضحيت بالكسر ضحا عرقت . وضحيت أيضا للشمس ضحاء ممدود برزت وضحيت ( بالفتح ) مثله ، والمستقبل أضحى في اللغتين جميعا ؛ قال عمر بن أبي ربيعة :\nرأت رجلا أيما إذا الشمس عارضت فيضحى وأما بالعشي فيخصر\nفي الحديث أن ابن عمر رأى رجلا محرما قد استظل ، فقال : أضح لمن أحرمت له . هكذا يرويه المحدثون بفتح الألف وكسر الحاء من أضحيت . وقال الأصمعي : إنما هو إضح لمن أحرمت له ؛ بكسر الألف وفتح الحاء من ضحيت أضحى ؛ لأنه أمره بالبروز للشمس ؛ ومنه قوله تعالى : وأنك لا تظمأ فيها ولا تضحى وأنشد :\nضحيت له كي أستظل بظله إذا الظل أضحى في القيامة قالصا\nوقرأ أبو عمرو والكوفيون إلا عاصما في رواية أبي بكر عنه ( وأنك ) بفتح الهمزة عطفا على ألا تجوع . ويجوز أن يكون في موضع رفع عطفا على الموضع ، والمعنى : ولك أنك لا تظمأ فيها ، والباقون بالكسر على الاستئناف أو العطف على إن لك .\n                                    ",
        "saadi": "وَأَنَّكَ لَا تَظۡمَؤُاْ فِيهَا وَلَا تَضۡحَىٰ ٩١١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 118 و119 :ـ\n{ إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَى وَأَنَّكَ لَا تَظْمَأُ فِيهَا وَلَا تَضْحَى } أي: تصيبك الشمس بحرها، فضمن له استمرار الطعام والشراب، والكسوة، والماء، وعدم التعب والنصب\n                                    "
      },
      "originalText": "وَأَنَّكَ لَا تَظۡمَؤُاْ فِيهَا وَلَا تَضۡحَىٰ ٩١١"
    },
    {
      "number": 2468,
      "text": "فَوَسْوَسَ إِلَيْهِ الشَّيْطَانُ قَالَ يَا آدَمُ هَلْ أَدُلُّكَ عَلَىٰ شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَا يَبْلَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 120,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَوَسۡوَسَ إِلَيۡهِ ٱلشَّيۡطَٰنُ قَالَ يَٰٓـَٔادَمُ هَلۡ أَدُلُّكَ عَلَىٰ شَجَرَةِ ٱلۡخُلۡدِ وَمُلۡكٖ لَّا يَبۡلَىٰ ٠٢١\n                                    \n                                    \n                                    وقوله : ( فوسوس إليه الشيطان قال يا آدم هل أدلك على شجرة الخلد وملك لا يبلى ) قد تقدم أنه ( دلاهما بغرور ) [ الأعراف : 22 ] ; ( وقاسمهما إني لكما لمن الناصحين ) [ الأعراف : 21 ] . وقد تقدم أن الله تعالى أوحى إلى آدم وزوجته أن يأكلا من كل الثمار ، ولا يقربا هذه الشجرة المعينة في الجنة . فلم يزل بهما إبليس حتى أكلا منها ، وكانت شجرة الخلد - يعني : التي من أكل منها خلد ودام مكثه . وقد جاء في الحديث ذكر شجرة الخلد ، فقال أبو داود الطيالسي : حدثنا شعبة عن أبي الضحاك سمعت أبا هريرة يحدث ، عن النبي صلى الله عليه وسلم قال : \" إن في الجنة شجرة يسير الراكب في ظلها مائة عام ، ما يقطعها وهي شجرة الخلد \" . ورواه الإمام أحمد . .\n                                    ",
        "qortoby": "فَوَسۡوَسَ إِلَيۡهِ ٱلشَّيۡطَٰنُ قَالَ يَٰٓـَٔادَمُ هَلۡ أَدُلُّكَ عَلَىٰ شَجَرَةِ ٱلۡخُلۡدِ وَمُلۡكٖ لَّا يَبۡلَىٰ ٠٢١\n                                    \n                                    \n                                    قوله تعالى : فوسوس إليه الشيطان تقدم في ( الأعراف ) . قال يعني الشيطان يا آدم هل أدلك على شجرة الخلد وملك لا يبلى وهذا يدل على المشافهة ، وأنه دخل الجنة في جوف الحية . على ما تقدم في ( البقرة ) بيانه ، وتقدم هناك تعيين الشجرة ، وما للعلماء فيها فلا معنى للإعادة\n                                    ",
        "saadi": "فَوَسۡوَسَ إِلَيۡهِ ٱلشَّيۡطَٰنُ قَالَ يَٰٓـَٔادَمُ هَلۡ أَدُلُّكَ عَلَىٰ شَجَرَةِ ٱلۡخُلۡدِ وَمُلۡكٖ لَّا يَبۡلَىٰ ٠٢١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 120 و121 :ـ\nولكنه نهاه عن أكل شجرة معينة فقال: { وَلَا تَقْرَبَا هَذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ } فلم يزل الشيطان يسول لهما، ويزين أكل الشجرة، ويقول: { هَلْ أَدُلُّكَ عَلَى شَجَرَةِ الْخُلْدِ } أي: الشجرة التي من أكل منها خلد في الجنة. { وَمُلْكٍ لَا يَبْلَى } أي: لا ينقطع إذا أكلت منها، فأتاه بصورة ناصح، وتلطف له في الكلام، فاغتر به آدم، وأكلا من الشجرة فسقط في أيديهما، وسقطت كسوتهما، واتضحت معصيتهما، وبدا لكل منهما سوأة الآخر، بعد أن كانا مستورين، وجعلا يخصفان على أنفسهما من ورق أشجار الجنة ليستترا بذلك، وأصابهما من الخجل ما الله به عليم.\n                                    "
      },
      "originalText": "فَوَسۡوَسَ إِلَيۡهِ ٱلشَّيۡطَٰنُ قَالَ يَٰٓـَٔادَمُ هَلۡ أَدُلُّكَ عَلَىٰ شَجَرَةِ ٱلۡخُلۡدِ وَمُلۡكٖ لَّا يَبۡلَىٰ ٠٢١"
    },
    {
      "number": 2469,
      "text": "فَأَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْآتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِنْ وَرَقِ الْجَنَّةِ ۚ وَعَصَىٰ آدَمُ رَبَّهُ فَغَوَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 121,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَأَكَلَا مِنۡهَا فَبَدَتۡ لَهُمَا سَوۡءَٰتُهُمَا وَطَفِقَا يَخۡصِفَانِ عَلَيۡهِمَا مِن وَرَقِ ٱلۡجَنَّةِۚ وَعَصَىٰٓ ءَادَمُ رَبَّهُۥ فَغَوَىٰ ١٢١\n                                    \n                                    \n                                    وقول : ( فأكلا منها فبدت لهما سوآتهما ) قال ابن أبي حاتم :\nحدثنا علي بن الحسين بن إشكاب ، حدثنا علي بن عاصم ، عن سعيد بن أبي عروبة ، عن قتادة ، عن الحسن ، عن أبي بن كعب قال : قال رسول الله صلى الله عليه وسلم : \" إن الله خلق آدم رجلا طوالا كثير شعر الرأس ، كأنه نخلة سحوق . فلما ذاق الشجرة سقط عنه لباسه ، فأول ما بدا منه عورته . فلما نظر إلى عورته جعل يشتد في الجنة ، فأخذت شعره شجرة ، فنازعها ، فنادى الرحمن : يا آدم ، مني تفر؟ فلما سمع كلام الرحمن قال : يا رب ، لا ولكن استحياء أرأيت إن تبت ورجعت ، أعائدي إلى الجنة؟ قال : نعم \" فذلك قوله : ( فتلقى آدم من ربه كلمات فتاب عليه )\nوهذا منقطع بين الحسن وأبي بن كعب ، فلم يسمعه منه ، وفي رفعه نظر أيضا .\nوقوله : ( وطفقا يخصفان عليهما من ورق الجنة ) قال مجاهد : يرقعان كهيئة الثوب . وكذا قال قتادة ، والسدي .\nوقال ابن أبي حاتم : حدثنا جعفر ، عن عون ، حدثنا سفيان ، عن ابن أبي ليلى ، عن المنهال ، عن سعيد بن جبير ، عن ابن عباس : ( وطفقا يخصفان عليهما من ورق الجنة ) قال : ينزعان ورق التين ، فيجعلانه على سوآتهما .\n                                    ",
        "qortoby": "فَأَكَلَا مِنۡهَا فَبَدَتۡ لَهُمَا سَوۡءَٰتُهُمَا وَطَفِقَا يَخۡصِفَانِ عَلَيۡهِمَا مِن وَرَقِ ٱلۡجَنَّةِۚ وَعَصَىٰٓ ءَادَمُ رَبَّهُۥ فَغَوَىٰ ١٢١\n                                    \n                                    \n                                    فأكلا منها فبدت لهما سوآتهما وطفقا يخصفان عليهما من ورق الجنة وقال الفراء : وطفقا في العربية أقبلا ؛ قال وقيل : جعل يلصقان عليهما ورق التين .\nقوله تعالى : وعصى آدم ربه فغوى فيه ست مسائل :\nالأولى : قوله تعالى : وعصى تقدم في ( البقرة ) القول في ذنوب الأنبياء قال بعض المتأخرين من علمائنا : والذي ينبغي أن يقال : إن الله تعالى قد أخبر بوقوع ذنوب من بعضهم ، ونسبها إليهم ، وعاتبهم عليها ، وأخبروا بذلك عن نفوسهم وتنصلوا منها ، واستغفروا منها وتابوا ، وكل ذلك ورد في مواضع كثيرة لا يقبل التأويل جملتها ، وإن قبل ذلك آحادها ، وكل ذلك مما لا يزري بمناصبهم ، وإنما تلك الأمور التي وقعت منهم على جهة الندور ، وعلى جهة الخطأ والنسيان ، أو تأويل دعا إلى ذلك ، فهي بالنسبة إلى غيرهم حسنات ، وفى حقهم سيئات بالنسبة إلى مناصبهم ، وعلو أقدارهم ؛ إذ قد يؤاخذ الوزير بما يثاب عليه السائس ؛ فأشفقوا من ذلك في موقف القيامة ، مع علمهم بالأمن والأمان والسلامة . قال : وهذا هو الحق ولقد أحسن الجنيد حيث قال : حسنات الأبرار سيئات المقربين ؛ فهم صلوات الله وسلامه عليهم - وإن كانوا قد شهدت النصوص بوقوع ذنوب منهم ، فلم يخل ذلك بمناصبهم ، ولا قدح في رتبتهم ، بل قد تلافاهم ، واجتباهم وهداهم ، ومدحهم وزكاهم واختارهم واصطفاهم ؛ صلوات الله عليهم وسلامه .\nالثانية : قال القاضي أبو بكر بن العربي : لا يجوز لأحد منا اليوم أن يخبر بذلك عن آدم إلا إذا ذكرناه في أثناء قوله تعالى عنه ، أو قول نبيه ، فأما أن يبتدئ ذلك من قبل نفسه فليس بجائز لنا في آبائنا الأدنين إلينا ، المماثلين لنا ، فكيف في أبينا الأقدم الأعظم الأكرم النبي المقدم ، الذي عذره الله سبحانه وتعالى وتاب عليه وغفر له .\nقلت : وإذا كان هذا في المخلوق لا يجوز ، فالإخبار عن صفات الله - عز وجل - كاليد والرجل والإصبع والجنب والنزول إلى غير ذلك أولى بالمنع ، وأنه لا يجوز الابتداء بشيء من ذلك إلا في أثناء قراءة كتابه أو سنة رسوله ، ولهذا قال الإمام مالك بن أنس - رضي الله عنه - من وصف شيئا من ذات الله - عز وجل - مثل قوله : وقالت اليهود يد الله مغلولة فأشار بيده إلى عنقه قطعت يده ، وكذلك في السمع والبصر يقطع ذلك منه ؛ لأنه شبه الله تعالى بنفسه .\nالثالثة : روى الأئمة واللفظ عن أبي هريرة عن النبي - صلى الله عليه وسلم - قال : احتج آدم وموسى فقال موسى : يا آدم أنت أبونا خيبتنا وأخرجتنا من الجنة ، فقال آدم : يا موسى اصطفاك الله - عز وجل - بكلامه وخط لك بيده يا موسى : أتلومني على أمر قدره الله علي قبل أن يخلقني بأربعين سنة فحج آدم موسى ثلاثا قال المهلب قوله : فحج آدم موسى أي غلبه بالحجة . قال الليث بن سعد إنما صحت الحجة في هذه القصة لآدم على موسى عليهما السلام من أجل أن الله تعالى قد غفر لآدم خطيئته وتاب عليه ، فلم يكن لموسى أن يعيره بخطيئة قد غفرها الله تعالى له ، ولذلك قال آدم : أنت موسى الذي أتاك الله التوراة ، وفيها علم كل شيء ، فوجدت فيها أن الله قد قدر علي المعصية ، وقدر علي التوبة منها ، وأسقط بذلك اللوم عني أفتلومني أنت والله لا يلومني ، وبمثل هذا احتج ابن عمر على الذي قال له : إن عثمان فر يوم أحد ؛ فقال ابن عمر : ما على عثمان ذنب لأن الله تعالى قد عفا عنه بقوله : ولقد عفا الله عنهم وقد قيل : إن آدم - عليه السلام - أب وليس تعييره من بره أن لو كان مما يعير به غيره ؛ فإن الله تبارك وتعالى يقول في الأبوين الكافرين : وصاحبهما في الدنيا معروفا ولهذا إن إبراهيم - عليه السلام - لما قال له أبوه وهو كافر : لئن لم تنته لأرجمنك واهجرني مليا قال سلام عليك فكيف بأب هو نبي قد اجتباه ربه وتاب عليه وهدى .\nالرابعة : وأما من عمل الخطايا ولم تأته المغفرة ؛ فإن العلماء مجمعون على أنه لا يجوز له أن يحتج بمثل حجة آدم ، فيقول تلومني على أن قتلت أو زنيت أو سرقت وقد قدر الله علي ذلك ؛ والأمة مجمعة على جواز حمد المحسن على إحسانه ، ولوم المسيء على إساءته ، وتعديد ذنوبه عليه .\nالخامسة : قوله تعالى : فغوى أي ففسد عليه عيشه ، حكاه النقاش واختاره القشيري . وسمعت شيخنا الأستاذ المقرئ أبا جعفر القرطبي يقول فغوى ففسد عيشه بنزوله إلى الدنيا ، والغي الفساد ؛ وهو تأويل حسن وهو أولى من تأويل من يقول : فغوى معناه ضل ؛ من الغي الذي هو ضد الرشد . وقيل معناه جهل موضع رشده ؛ أي جهل أن تلك الشجرة هي التي نهي عنها ؛ والغي الجهل . وعن بعضهم فغوى فبشم من كثرة الأكل ؛ الزمخشري وهذا وإن صح على لغة من يقلب الياء المكسورة ما قبلها ألفا ؛ فيقول في فني وبقي فنى وبقى وهم بنو طيئ تفسير خبيث .\nالسادسة : قال القشيري أبو نصر قال قوم يقال : عصى آدم وغوى ولا يقال له عاص ولا غاو ، كما أن من خاط مرة يقال له : خاط ولا يقال له خياط ما لم يتكرر منه الخياطة . وقيل : يجوز للسيد أن يطلق في عبده عند معصيته ما لا يجوز لغيره أن يطلقه ، وهذا تكلف ؛ وما أضيف من هذا إلى الأنبياء فإما أن تكون صغائر ، أو ترك الأولى ، أو قبل النبوة .\nقلت : هذا حسن . قال الإمام أبو بكر بن فورك رحمه الله تعالى : كان هذا من آدم قبل النبوة ، ودليل ذلك قوله تعالى : ثم اجتباه ربه فتاب عليه وهدى\n                                    ",
        "saadi": "فَأَكَلَا مِنۡهَا فَبَدَتۡ لَهُمَا سَوۡءَٰتُهُمَا وَطَفِقَا يَخۡصِفَانِ عَلَيۡهِمَا مِن وَرَقِ ٱلۡجَنَّةِۚ وَعَصَىٰٓ ءَادَمُ رَبَّهُۥ فَغَوَىٰ ١٢١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 120 و121 :ـ\nولكنه نهاه عن أكل شجرة معينة فقال: { وَلَا تَقْرَبَا هَذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ } فلم يزل الشيطان يسول لهما، ويزين أكل الشجرة، ويقول: { هَلْ أَدُلُّكَ عَلَى شَجَرَةِ الْخُلْدِ } أي: الشجرة التي من أكل منها خلد في الجنة. { وَمُلْكٍ لَا يَبْلَى } أي: لا ينقطع إذا أكلت منها، فأتاه بصورة ناصح، وتلطف له في الكلام، فاغتر به آدم، وأكلا من الشجرة فسقط في أيديهما، وسقطت كسوتهما، واتضحت معصيتهما، وبدا لكل منهما سوأة الآخر، بعد أن كانا مستورين، وجعلا يخصفان على أنفسهما من ورق أشجار الجنة ليستترا بذلك، وأصابهما من الخجل ما الله به عليم.\n                                    "
      },
      "originalText": "فَأَكَلَا مِنۡهَا فَبَدَتۡ لَهُمَا سَوۡءَٰتُهُمَا وَطَفِقَا يَخۡصِفَانِ عَلَيۡهِمَا مِن وَرَقِ ٱلۡجَنَّةِۚ وَعَصَىٰٓ ءَادَمُ رَبَّهُۥ فَغَوَىٰ ١٢١"
    },
    {
      "number": 2470,
      "text": "ثُمَّ اجْتَبَاهُ رَبُّهُ فَتَابَ عَلَيْهِ وَهَدَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 122,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ ٱجۡتَبَٰهُ رَبُّهُۥ فَتَابَ عَلَيۡهِ وَهَدَىٰ ٢٢١\n                                    \n                                    \n                                    وقوله : ( وعصى آدم ربه فغوى ثم اجتباه ربه فتاب عليه وهدى ) قال البخاري : حدثنا قتيبة ، حدثنا أيوب بن النجار ، عن يحيى بن أبي كثير ، عن أبي سلمة ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم قال : \" حاج موسى آدم ، فقال له : أنت الذي أخرجت الناس من الجنة بذنبك وأشقيتهم؟ قال آدم : يا موسى ، أنت الذي اصطفاك الله برسالاته وبكلامه ، أتلومني على أمر قد كتبه الله علي قبل أن يخلقني - أو : قدره الله علي قبل أن يخلقني - \" قال رسول الله صلى الله عليه وسلم : \" فحج آدم موسى \" .\nوهذا الحديث له طرق في الصحيحين ، وغيرهما من المسانيد .\nوقال ابن أبي حاتم : حدثنا يونس بن عبد الأعلى ، أخبرنا ابن وهب ، أخبرني أنس بن عياض ، عن الحارث بن أبي ذباب ، عن يزيد بن هرمز قال : سمعت أبا هريرة يقول : قال رسول الله صلى الله عليه وسلم : \" حج آدم وموسى عند ربهما ، فحج آدم موسى ، قال موسى : أنت الذي خلقك الله بيده ، ونفخ فيك من روحه ، وأسجد لك ملائكته ، وأسكنك في جنته ، ثم أهبطت الناس إلى الأرض بخطيئتك؟ قال آدم : أنت موسى الذي اصطفاك الله برسالته وكلامه ، وأعطاك الألواح فيها تبيان كل شيء ، وقربك نجيا ، فبكم وجدت الله كتب التوراة [ قبل أن أخلق ] قال موسى : بأربعين عاما . قال آدم : فهل وجدت فيها ( وعصى آدم ربه فغوى ) قال : نعم . قال : أفتلومني على أن عملت عملا كتب الله علي أن أعمله قبل أن يخلقني بأربعين سنة \" . قال رسول الله صلى الله عليه وسلم : \" فحج آدم موسى \" .\nقال الحارث : وحدثني عبد الرحمن بن هرمز بذلك ، عن أبي هريرة ، عن رسول الله صلى الله عليه وسلم . .\n                                    ",
        "qortoby": "ثُمَّ ٱجۡتَبَٰهُ رَبُّهُۥ فَتَابَ عَلَيۡهِ وَهَدَىٰ ٢٢١\n                                    \n                                    \n                                    فذكر أن الاجتباء والهداية كانا بعد العصيان ، وإذا كان هذا قبل النبوة فجائز عليهم الذنوب وجها واحدا ؛ لأن قبل النبوة لا شرع علينا تصديقهم ، فإذا بعثهم الله تعالى إلى خلقه وكانوا مأمونين في الأداء معصومين لم يضر ما قد سلف منهم من الذنوب . وهذا نفيس والله أعلم .\n                                    ",
        "saadi": "ثُمَّ ٱجۡتَبَٰهُ رَبُّهُۥ فَتَابَ عَلَيۡهِ وَهَدَىٰ ٢٢١\n                                        \n                                        \n                                        \n                                        { وَعَصَى آدَمُ رَبَّهُ فَغَوَى } فبادرا إلى التوبة والإنابة، وقالا: { رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ } فاجتباه ربه، واختاره، ويسر له التوبة { فَتَابَ عَلَيْهِ وَهَدَى } فكان بعد التوبة أحسن منه قبلها، ورجع كيد العدو عليه، وبطل مكره، فتمت النعمة عليه وعلى ذريته، ووجب عليهم القيام بها والاعتراف، وأن يكونوا على حذر من هذا العدو المرابط الملازم لهم، ليلا ونهارا { يَا بَنِي آدَمَ لَا يَفْتِنَنَّكُمُ الشَّيْطَانُ كَمَا أَخْرَجَ أَبَوَيْكُمْ مِنَ الْجَنَّةِ يَنْزِعُ عَنْهُمَا لِبَاسَهُمَا لِيُرِيَهُمَا سَوْآتِهِمَا إِنَّهُ يَرَاكُمْ هُوَ وَقَبِيلُهُ مِنْ حَيْثُ لَا تَرَوْنَهُمْ إِنَّا جَعَلْنَا الشَّيَاطِينَ أَوْلِيَاءَ لِلَّذِينَ لَا يُؤْمِنُونَ }\n                                    "
      },
      "originalText": "ثُمَّ ٱجۡتَبَٰهُ رَبُّهُۥ فَتَابَ عَلَيۡهِ وَهَدَىٰ ٢٢١"
    },
    {
      "number": 2471,
      "text": "قَالَ اهْبِطَا مِنْهَا جَمِيعًا ۖ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۖ فَإِمَّا يَأْتِيَنَّكُمْ مِنِّي هُدًى فَمَنِ اتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشْقَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 123,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ ٱهۡبِطَا مِنۡهَا جَمِيعَۢاۖ بَعۡضُكُمۡ لِبَعۡضٍ عَدُوّٞۖ فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى فَمَنِ ٱتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشۡقَىٰ ٣٢١\n                                    \n                                    \n                                    يقول تعالى لآدم وحواء وإبليس : اهبطوا منها جميعا ، أي : من الجنة كلكم . وقد بسطنا ذلك في سورة البقرة \" .\n( بعضكم لبعض عدو ) قال : آدم وذريته ، وإبليس وذريته .\nوقوله : ( فإما يأتينكم مني هدى ) قال أبو العالية : الأنبياء والرسل والبيان .\n( فمن اتبع هداي فلا يضل ولا يشقى ) قال ابن عباس : لا يضل في الدنيا ، ولا يشقى في الآخرة .\n                                    ",
        "qortoby": "قَالَ ٱهۡبِطَا مِنۡهَا جَمِيعَۢاۖ بَعۡضُكُمۡ لِبَعۡضٍ عَدُوّٞۖ فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى فَمَنِ ٱتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشۡقَىٰ ٣٢١\n                                    \n                                    \n                                    قوله تعالى : قال اهبطا منها جميعا خطاب آدم وإبليس . منها أي من الجنة . وقد قال لإبليس : اخرج منها مذءوما مدحورا فلعله أخرج من الجنة إلى موضع من السماء ، ثم أهبط إلى الأرض . بعضكم لبعض عدو تقدم في ( البقرة ) أي أنت عدو للحية ولإبليس وهما عدوان لك . وهذا يدل على أن قوله : اهبطا ليس خطابا لآدم وحواء ؛ لأنهما ما كانا متعاديين ؛ وتضمن هبوط آدم هبوط حواء . فإما يأتينكم مني هدى أي رشدا وقولا حقا . وقد تقدم في ( البقرة ) . فمن اتبع هداي يعني الرسل والكتب . فلا يضل ولا يشقى قال ابن عباس : ضمن الله تعالى لمن قرأ القرآن وعمل بما فيه ألا يضل في الدنيا ، ولا يشقى في الآخرة ، وتلا الآية . من قرأ القرآن واتبع ما فيه هداه الله من الضلالة ، ووقاه يوم القيامة سوء الحساب ، ثم تلا الآية .\n                                    ",
        "saadi": "قَالَ ٱهۡبِطَا مِنۡهَا جَمِيعَۢاۖ بَعۡضُكُمۡ لِبَعۡضٍ عَدُوّٞۖ فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى فَمَنِ ٱتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشۡقَىٰ ٣٢١\n                                        \n                                        \n                                        \n                                        يخبر تعالى، أنه أمر آدم وإبليس أن يهبطا إلى الأرض، وأن يتخذوا [آدم وبنوه] الشيطان عدوا لهم، فيأخذوا الحذر منه، ويعدوا له عدته ويحاربوه، وأنه سينزل عليهم كتبا، ويرسل إليهم رسلا يبينون لهم الطريق المستقيم الموصلة إليه وإلى جنته، ويحذرونهم من هذا العدو المبين، وأنهم أي: وقت جاءهم ذلك الهدى، الذي هو الكتب والرسل، فإن من اتبعه اتبع ما أمر به، واجتنب ما نهي عنه، فإنه لا يضل في الدنيا ولا في الآخرة، ولا يشقى فيهما، بل قد هدي إلى صراط مستقيم، في الدنيا والآخرة، وله السعادة والأمن في الآخرة.\nوقد نفى عنه الخوف والحزن في آية أخرى، بقوله: { فَمَنْ تَبِعَ هُدَايَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ } واتباع الهدى، بتصديق الخبر، وعدم معارضته بالشبه، وامتثال الأمر بأن لا يعارضه بشهوة.\n                                    "
      },
      "originalText": "قَالَ ٱهۡبِطَا مِنۡهَا جَمِيعَۢاۖ بَعۡضُكُمۡ لِبَعۡضٍ عَدُوّٞۖ فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى فَمَنِ ٱتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشۡقَىٰ ٣٢١"
    },
    {
      "number": 2472,
      "text": "وَمَنْ أَعْرَضَ عَنْ ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنْكًا وَنَحْشُرُهُ يَوْمَ الْقِيَامَةِ أَعْمَىٰ",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 124,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَنۡ أَعۡرَضَ عَن ذِكۡرِي فَإِنَّ لَهُۥ مَعِيشَةٗ ضَنكٗا وَنَحۡشُرُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ أَعۡمَىٰ ٤٢١\n                                    \n                                    \n                                    ( ومن أعرض عن ذكري ) أي : خالف أمري ، وما أنزلته على رسولي ، أعرض عنه وتناساه وأخذ من غيره هداه ( فإن له معيشة ضنكا ) أي : في الدنيا ، فلا طمأنينة له ، ولا انشراح لصدره ، بل صدره [ ضيق ] حرج لضلاله ، وإن تنعم ظاهره ، ولبس ما شاء وأكل ما شاء ، وسكن حيث شاء ، فإن قلبه ما لم يخلص إلى اليقين والهدى ، فهو في قلق وحيرة وشك ، فلا يزال في ريبة يتردد . فهذا من ضنك المعيشة .\nقال علي بن أبي طلحة ، عن ابن عباس : ( فإن له معيشة ضنكا ) قال : الشقاء .\nوقال العوفي ، عن ابن عباس : ( فإن له معيشة ضنكا ) قال : كل مال أعطيته عبدا من عبادي ، قل أو كثر ، لا يتقيني فيه ، فلا خير فيه ، وهو الضنك في المعيشة . ويقال : إن قوما ضلالا أعرضوا عن الحق ، وكانوا في سعة من الدنيا متكبرين ، فكانت معيشتهم ضنكا; [ و ] ذلك أنهم كانوا يرون أن الله ليس مخلفا لهم معايشهم ، من سوء ظنهم بالله والتكذيب ، فإذا كان العبد يكذب بالله ، ويسيء الظن به والثقة به اشتدت عليه معيشته ، فذلك الضنك .\nوقال الضحاك : هو العمل السيئ ، والرزق الخبيث ، وكذا قال عكرمة ، ومالك بن دينار .\nوقال سفيان بن عيينة ، عن أبي حازم ، عن أبي سلمة ، عن أبي سعيد في قوله : ( معيشة ضنكا ) قال : يضيق عليه قبره ، حتى تختلف أضلاعه فيه . قال أبو حاتم الرازي : النعمان بن أبي عياش يكنى أبا سلمة .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا صفوان ، حدثنا الوليد ، حدثنا عبد الله ابن لهيعة ، عن دراج ، عن أبي الهيثم ، عن أبي سعيد قال : قال رسول الله صلى الله عليه وسلم في قول الله عز وجل : ( فإن له معيشة ضنكا ) قال : \" ضمة القبر \" الموقوف أصح .\nوقال ابن أبي حاتم أيضا : حدثنا الربيع بن سليمان ، حدثنا أسد بن موسى ، حدثنا ابن لهيعة ، حدثنا دراج أبو السمح ، عن ابن حجيرة - اسمه عبد الرحمن - عن أبي هريرة ، عن رسول الله صلى الله عليه وسلم قال : المؤمن في قبره في روضة خضراء ، ويرحب له في قبره سبعون ذراعا ، وينور له قبره كالقمر ليلة البدر ، أتدرون فيم أنزلت هذه الآية : ( فإن له معيشة ضنكا ) ؟ أتدرون ما المعيشة الضنك؟ \" قالوا : الله ورسوله أعلم . قال : عذاب الكافر في قبره ، والذي نفسي بيده ، إنه ليسلط عليه تسعة وتسعون تنينا ، أتدرون ما التنين؟ تسعة وتسعون حية ، لكل حية سبعة رؤوس ، ينفخون في جسمه ، ويلسعونه ويخدشونه إلى يوم يبعثون \" . .\nرفعه منكر جدا .\nوقال البزار : حدثنا محمد بن يحيى الأزدي ، حدثنا محمد بن عمرو حدثنا هشام بن سعد ، عن سعيد بن أبي هلال ، [ عن أبي حجيرة ] عن أبي هريرة ، عن النبي صلى الله عليه وسلم في قول الله عز وجل : ( فإن له معيشة ضنكا ) قال : \" المعيشة الضنك الذي قال الله تعالى : أنه يسلط عليه تسعة وتسعون حية ، ينهشون لحمه حتى تقوم الساعة \" .\nوقال أيضا : حدثنا أبو زرعة ، حدثنا أبو الوليد ، حدثنا حماد بن سلمة ، عن محمد بن عمرو ، عن أبي سلمة ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم : ( فإن له معيشة ضنكا ) قال : \" عذاب القبر \" . إسناد جيد .\nوقوله : ( ونحشره يوم القيامة أعمى ) قال مجاهد ، وأبو صالح ، والسدي : لا حجة له .\nوقال عكرمة : عمي عليه كل شيء إلا جهنم .\nويحتمل أن يكون المراد : أنه يحشر أو يبعث إلى النار أعمى البصر والبصيرة أيضا ، كما قال تعالى : ( ونحشرهم يوم القيامة على وجوههم عميا وبكما وصما مأواهم جهنم كلما خبت زدناهم سعيرا ) [ الإسراء : 97 ]\n                                    ",
        "qortoby": "وَمَنۡ أَعۡرَضَ عَن ذِكۡرِي فَإِنَّ لَهُۥ مَعِيشَةٗ ضَنكٗا وَنَحۡشُرُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ أَعۡمَىٰ ٤٢١\n                                    \n                                    \n                                    ومن أعرض عن ذكري أي ديني ، وتلاوة كتابي ، والعمل بما فيه . وقيل : عما أنزلت من الدلائل . ويحتمل أن يحمل الذكر على الرسول ؛ لأنه كان منه الذكر . فإن له معيشة ضنكا أي عيشا ضيقا ؛ يقال : منزل ضنك وعيش ضنك يستوي فيه الواحد والاثنان والمؤنث والجمع ؛ قال عنترة :\nإن يلحقوا أكرر وإن يستلحموا أشدد وإن يلفوا بضنك أنزل\nوقال أيضا :\nإن المنية لو تمثل مثلت مثلي إذا نزلوا بضنك المنزل\nوقرئ ( ضنكى ) على وزن فعلى : ومعنى ذلك أن الله - عز وجل - جعل مع الدين التسليم والقناعة والتوكل عليه وعلى قسمته ، فصاحبه ينفق مما رزقه الله - - عز وجل - - بسماح وسهولة ويعيش عيشا رافعا ؛ كما قال الله تعالى : فلنحيينه حياة طيبة . والمعرض عن الدين مستول عليه الحرص الذي لا يزال يطمح به إلى الازدياد من الدنيا ، مسلط عليه الشح ، الذي يقبض يده عن الإنفاق ، فعيشه ضنك ، وحاله مظلمة ، كما قال بعضهم : لا يعرض أحد عن ذكر ربه إلا أظلم عليه وقته وتشوش عليه رزقه ، وكان في عيشة ضنك . وقال عكرمة : ضنكا كسبا حراما . الحسن : طعام الضريع والزقوم . وقول رابع وهو الصحيح أنه عذاب القبر ؛ قاله أبو سعيد الخدري وعبد الله بن مسعود ، ورواه أبو هريرة مرفوعا عن النبي - صلى الله عليه وسلم - وقد ذكرناه في كتاب التذكرة ؛ قال أبو هريرة : يضيق على الكافر قبره حتى تختلف فيه أضلاعه ، وهو المعيشة الضنك .\nونحشره يوم القيامة أعمى قيل أعمى في حال وبصيرا في حال ؛ وقد تقدم في آخر ( سبحان ) وقيل : أعمى عن الحجة ؛ قاله مجاهد . وقيل : أعمى عن جهات الخير ، لا يهتدي لشيء منها . وقيل : عن الحيلة في دفع العذاب عن نفسه ، كالأعمى الذي لا حيلة له فيما لا يراه .\n                                    ",
        "saadi": "وَمَنۡ أَعۡرَضَ عَن ذِكۡرِي فَإِنَّ لَهُۥ مَعِيشَةٗ ضَنكٗا وَنَحۡشُرُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ أَعۡمَىٰ ٤٢١\n                                        \n                                        \n                                        \n                                        { وَمَنْ أَعْرَضَ عَنْ ذِكْرِي } أي: كتابي الذي يتذكر به جميع المطالب العالية، وأن يتركه على وجه الإعراض عنه، أو ما هو أعظم من ذلك، بأن يكون على وجه الإنكار له، والكفر به { فَإِنَّ لَهُ مَعِيشَةً ضَنْكًا } أي: فإن جزاءه، أن نجعل معيشته ضيقة مشقة، ولا يكون ذلك إلا عذابا.\nوفسرت المعيشة الضنك بعذاب القبر، وأنه يضيق عليه قبره، ويحصر فيه ويعذب، جزاء لإعراضه عن ذكر ربه، وهذه إحدى الآيات الدالة على عذاب القبر. والثانية قوله تعالى: { وَلَوْ تَرَى إِذِ الظَّالِمُونَ فِي غَمَرَاتِ الْمَوْتِ وَالْمَلَائِكَةُ بَاسِطُو أَيْدِيهِمْ } الآية. والثالثة قوله: { وَلَنُذِيقَنَّهُمْ مِنَ الْعَذَابِ الْأَدْنَى دُونَ الْعَذَابِ الْأَكْبَرِ } والرابعة قوله عن آل فرعون: { النَّارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا } الآية.\nوالذي أوجب لمن فسرها بعذاب القبر فقط من السلف، وقصرها على ذلك -والله أعلم- آخر الآية، وأن الله ذكر في آخرها عذاب يوم القيامة. وبعض المفسرين، يرى أن المعيشة الضنك، عامة في دار الدنيا، بما يصيب المعرض عن ذكر ربه، من الهموم والغموم والآلام، التي هي عذاب معجل، وفي دار البرزخ، وفي الدار الآخرة، لإطلاق المعيشة الضنك، وعدم تقييدها. { وَنَحْشُرُهُ } أي: هذا المعرض عن ذكر ربه { يَوْمَ الْقِيَامَةِ أَعْمَى } البصر على الصحيح، كما قال تعالى: { وَنَحْشُرُهُمْ يَوْمَ الْقِيَامَةِ عَلَى وُجُوهِهِمْ عُمْيًا وَبُكْمًا وَصُمًّا }\n                                    "
      },
      "originalText": "وَمَنۡ أَعۡرَضَ عَن ذِكۡرِي فَإِنَّ لَهُۥ مَعِيشَةٗ ضَنكٗا وَنَحۡشُرُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ أَعۡمَىٰ ٤٢١"
    },
    {
      "number": 2473,
      "text": "قَالَ رَبِّ لِمَ حَشَرْتَنِي أَعْمَىٰ وَقَدْ كُنْتُ بَصِيرًا",
      "surah": {
        "number": 20,
        "name": "سورة طه",
        "englishName": "Taa-Haa",
        "englishNameTranslation": "Taa-Haa",
        "revelationType": "Meccan",
        "numberOfAyahs": 135
      },
      "numberInSurah": 125,
      "juz": 16,
      "manzil": 4,
      "page": 320,
      "ruku": 276,
      "hizbQuarter": 128,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ رَبِّ لِمَ حَشَرۡتَنِيٓ أَعۡمَىٰ وَقَدۡ كُنتُ بَصِيرٗا ٥٢١\n                                    \n                                    \n                                    ولهذا يقول \"رب لم حشرتني أعمى وقد كنت بصيرا\" أي في الدنيا.s\n                                    ",
        "qortoby": "قَالَ رَبِّ لِمَ حَشَرۡتَنِيٓ أَعۡمَىٰ وَقَدۡ كُنتُ بَصِيرٗا ٥٢١\n                                    \n                                    \n                                    قال رب لم حشرتني أعمى أي بأي ذنب عاقبتني بالعمى . وقد كنت بصيرا أي في الدنيا ، وكأنه يظن أنه لا ذنب له . وقال ابن عباس ومجاهد : أي لم حشرتني أعمى عن حجتي وقد كنت بصيرا أي عالما بحجتي ؛ القشيري : وهو بعيد إذ ما كان للكافر حجة في الدنيا .s\n                                    ",
        "saadi": "قَالَ رَبِّ لِمَ حَشَرۡتَنِيٓ أَعۡمَىٰ وَقَدۡ كُنتُ بَصِيرٗا ٥٢١\n                                        \n                                        \n                                        \n                                        قال على وجه الذل والمراجعة والتألم والضجر من هذه الحالة: { رَبِّ لِمَ حَشَرْتَنِي أَعْمَى وَقَدْ كُنْتُ } في دار الدنيا { بَصِيرًا } فما الذي صيرني إلى هذه الحالة البشعة.\n                                    "
      },
      "originalText": "قَالَ رَبِّ لِمَ حَشَرۡتَنِيٓ أَعۡمَىٰ وَقَدۡ كُنتُ بَصِيرٗا ٥٢١"
    }
  ]
}