{
  "number": 34,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 223,
      "text": "كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 216,
      "juz": 2,
      "manzil": 1,
      "page": 34,
      "ruku": 27,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ وَهُوَ كُرۡهٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تَكۡرَهُواْ شَيۡ‍ٔٗا وَهُوَ خَيۡرٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تُحِبُّواْ شَيۡ‍ٔٗا وَهُوَ شَرّٞ لَّكُمۡۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ ٦١٢\n                                    \n                                    \n                                    هذا إيجاب من الله تعالى للجهاد على المسلمين : أن يكفوا شر الأعداء عن حوزة الإسلام .\nوقال الزهري : الجهاد واجب على كل أحد ، غزا أو قعد ; فالقاعد عليه إذا استعين أن يعين ، وإذا استغيث أن يغيث ، وإذا استنفر أن ينفر ، وإن لم يحتج إليه قعد .\nقلت : ولهذا ثبت في الصحيح \" من مات ولم يغز ، ولم يحدث نفسه بغزو مات ميتة جاهلية \" . وقال عليه السلام يوم الفتح : \" لا هجرة ، ولكن جهاد ونية ، إذا استنفرتم فانفروا \" .\nوقوله : ( وهو كره لكم ) أي : شديد عليكم ومشقة . وهو كذلك ، فإنه إما أن يقتل أو يجرح مع مشقة السفر ومجالدة الأعداء .\nثم قال تعالى : ( وعسى أن تكرهوا شيئا وهو خير لكم ) أي : لأن القتال يعقبه النصر والظفر على الأعداء ، والاستيلاء على بلادهم ، وأموالهم ، وذراريهم ، وأولادهم .\n( وعسى أن تحبوا شيئا وهو شر لكم ) وهذا عام في الأمور كلها ، قد يحب المرء شيئا ، وليس له فيه خيرة ولا مصلحة . ومن ذلك القعود عن القتال ، قد يعقبه استيلاء العدو على البلاد والحكم .\nثم قال تعالى : ( والله يعلم وأنتم لا تعلمون ) أي : هو أعلم بعواقب الأمور منكم ، وأخبر بما فيه صلاحكم في دنياكم وأخراكم ; فاستجيبوا له ، وانقادوا لأمره ، لعلكم ترشدون .\n                                    ",
        "qortoby": "كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ وَهُوَ كُرۡهٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تَكۡرَهُواْ شَيۡ‍ٔٗا وَهُوَ خَيۡرٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تُحِبُّواْ شَيۡ‍ٔٗا وَهُوَ شَرّٞ لَّكُمۡۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ ٦١٢\n                                    \n                                    \n                                    قوله تعالى : كتب عليكم القتال وهو كره لكم وعسى أن تكرهوا شيئا وهو خير لكم وعسى أن تحبوا شيئا وهو شر لكم والله يعلم وأنتم لا تعلمون\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : \" كتب \" معناه فرض ، وقد تقدم مثله . وقرأ قوم \" كتب عليكم القتل \" ، وقال الشاعر ( هو عمر بن أبي ربيعة ) :\nكتب القتل والقتال علينا وعلى الغانيات جر الذيول\nهذا هو فرض الجهاد ، بين سبحانه أن هذا مما امتحنوا به وجعل وصلة إلى الجنة . والمراد بالقتال قتال الأعداء من الكفار ، وهذا كان معلوما لهم بقرائن الأحوال ، ولم يؤذن للنبي صلى الله عليه وسلم في القتال مدة إقامته بمكة ، فلما هاجر أذن له في قتال من يقاتله من المشركين فقال تعالى : أذن للذين يقاتلون بأنهم ظلموا ثم أذن له في قتال المشركين عامة . واختلفوا من المراد بهذه الآية ، فقيل : أصحاب النبي صلى الله عليه وسلم خاصة ، فكان القتال مع النبي صلى الله عليه وسلم فرض عين عليهم ، فلما استقر الشرع صار على الكفاية ، قاله عطاء والأوزاعي . قال ابن جريج : قلت لعطاء : أواجب الغزو على الناس في هذه الآية ؟ فقال : لا ، إنما كتب على أولئك . وقال الجمهور من الأمة : أول فرضه إنما كان على الكفاية دون تعيين ، غير أن النبي صلى الله عليه وسلم كان إذا استنفرهم تعين عليهم النفير لوجوب طاعته . وقال سعيد بن المسيب : إن الجهاد فرض على كل مسلم في عينه أبدا ، حكاه الماوردي . قال ابن عطية : والذي استمر عليه الإجماع أن الجهاد على كل أمة محمد صلى الله عليه وسلم فرض كفاية ، فإذا قام به من قام من المسلمين سقط عن الباقين ، إلا أن ينزل العدو بساحة الإسلام فهو حينئذ فرض عين ، وسيأتي هذا مبينا في سورة \" براءة \" إن شاء الله تعالى . وذكر المهدوي وغيره عن الثوري أنه قال : الجهاد تطوع . قال ابن عطية : وهذه العبارة عندي إنما هي على سؤال سائل وقد قيم بالجهاد ، فقيل له : ذلك تطوع .\nالثانية : قوله تعالى : وهو كره لكم ابتداء وخبر ، وهو كره في الطباع . قال ابن عرفة : الكره ، المشقة والكره - بالفتح - ما أكرهت عليه ، هذا هو الاختيار ، ويجوز الضم في معنى الفتح فيكونان لغتين ، يقال : كرهت الشيء كرها وكرها وكراهة وكراهية ، وأكرهته عليه إكراها . وإنما كان الجهاد كرها لأن فيه إخراج المال ومفارقة الوطن والأهل ، والتعرض بالجسد للشجاج والجراح وقطع الأطراف وذهاب النفس ، فكانت كراهيتهم لذلك ، لا أنهم كرهوا فرض الله تعالى . وقال عكرمة في هذه الآية : إنهم كرهوه ثم أحبوه وقالوا : سمعنا وأطعنا ، وهذا لأن امتثال الأمر يتضمن مشقة ، لكن إذا عرف الثواب هان في جنبه مقاساة المشقات .\nقلت : ومثاله في الدنيا إزالة ما يؤلم الإنسان ويخاف منه كقطع عضو وقلع ضرس وفصد وحجامة ابتغاء العافية ودوام الصحة ، ولا نعيم أفضل من الحياة الدائمة في دار الخلد والكرامة في مقعد صدق .\nالثالثة : قوله تعالى : وعسى أن تكرهوا شيئا قيل : \" عسى \" : بمعنى قد ، قاله الأصم . وقيل : هي واجبة . و \" عسى \" من الله واجبة في جميع القرآن إلا قوله تعالى :عسى ربه إن طلقكن أن يبدله . وقال أبو عبيدة : \" عسى \" من الله إيجاب ، والمعنى عسى أن تكرهوا ما في الجهاد من المشقة وهو خير لكم في أنكم تغلبون وتظفرون وتغنمون وتؤجرون ، ومن مات مات شهيدا ، وعسى أن تحبوا الدعة وترك القتال وهو شر لكم في أنكم تغلبون وتذلون ويذهب أمركم .\nقلت : وهذا صحيح لا غبار عليه ، كما اتفق في بلاد الأندلس ، تركوا الجهاد وجبنوا عن القتال وأكثروا من الفرار ، فاستولى العدو على البلاد ، وأي بلاد ؟ ! وأسر وقتل وسبى واسترق ، فإنا لله وإنا إليه راجعون! ذلك بما قدمت أيدينا وكسبته! وقال الحسن في معنى الآية : لا تكرهوا الملمات الواقعة ، فلرب أمر تكرهه فيه نجاتك ، ولرب أمر تحبه فيه عطبك ، وأنشد أبو سعيد الضرير :\nرب أمر تتقيه جر أمرا ترتضيه\nخفي المحبوب منه وبدا المكروه فيه\n                                    ",
        "saadi": "كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ وَهُوَ كُرۡهٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تَكۡرَهُواْ شَيۡ‍ٔٗا وَهُوَ خَيۡرٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تُحِبُّواْ شَيۡ‍ٔٗا وَهُوَ شَرّٞ لَّكُمۡۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ ٦١٢\n                                        \n                                        \n                                        \n                                        هذه الآية, فيها فرض القتال في سبيل الله, بعد ما كان المؤمنون مأمورين بتركه, لضعفهم, وعدم احتمالهم لذلك، فلما هاجر النبي صلى الله عليه وسلم إلى المدينة, وكثر المسلمون, وقووا أمرهم الله تعالى بالقتال، وأخبر أنه مكروه للنفوس, لما فيه من التعب والمشقة, وحصول أنواع المخاوف والتعرض للمتالف، ومع هذا, فهو خير محض, لما فيه من الثواب العظيم, والتحرز من العقاب الأليم, والنصر على الأعداء والظفر بالغنائم, وغير ذلك, مما هو مرب, على ما فيه من الكراهة { وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ } وذلك مثل القعود عن الجهاد لطلب الراحة, فإنه شر, لأنه يعقب الخذلان, وتسلط الأعداء على الإسلام وأهله, وحصول الذل والهوان, وفوات الأجر العظيم وحصول العقاب. وهذه الآيات عامة مطردة, في أن أفعال الخير التي تكرهها النفوس لما فيها من المشقة أنها خير بلا شك، وأن أفعال الشر التي تحب النفوس لما تتوهمه فيها من الراحة واللذة فهي شر بلا شك. وأما أحوال الدنيا, فليس الأمر مطردا, ولكن الغالب على العبد المؤمن, أنه إذا أحب أمرا من الأمور, فقيض الله [له] من الأسباب ما يصرفه عنه أنه خير له, فالأوفق له في ذلك, أن يشكر الله, ويجعل الخير في الواقع, لأنه يعلم أن الله تعالى أرحم بالعبد من نفسه, وأقدر على مصلحة عبده منه, وأعلم بمصلحته منه كما قال [تعالى:] { وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ } فاللائق بكم أن تتمشوا مع أقداره, سواء سرتكم أو ساءتكم. ولما كان الأمر بالقتال, لو لم يقيد, لشمل الأشهر الحرم وغيرها.\n                                    "
      },
      "originalText": "كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ وَهُوَ كُرۡهٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تَكۡرَهُواْ شَيۡ‍ٔٗا وَهُوَ خَيۡرٞ لَّكُمۡۖ وَعَسَىٰٓ أَن تُحِبُّواْ شَيۡ‍ٔٗا وَهُوَ شَرّٞ لَّكُمۡۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ ٦١٢"
    },
    {
      "number": 224,
      "text": "يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ ۖ قُلْ قِتَالٌ فِيهِ كَبِيرٌ ۖ وَصَدٌّ عَنْ سَبِيلِ اللَّهِ وَكُفْرٌ بِهِ وَالْمَسْجِدِ الْحَرَامِ وَإِخْرَاجُ أَهْلِهِ مِنْهُ أَكْبَرُ عِنْدَ اللَّهِ ۚ وَالْفِتْنَةُ أَكْبَرُ مِنَ الْقَتْلِ ۗ وَلَا يَزَالُونَ يُقَاتِلُونَكُمْ حَتَّىٰ يَرُدُّوكُمْ عَنْ دِينِكُمْ إِنِ اسْتَطَاعُوا ۚ وَمَنْ يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وَهُوَ كَافِرٌ فَأُولَٰئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ ۖ وَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 217,
      "juz": 2,
      "manzil": 1,
      "page": 34,
      "ruku": 28,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَسۡ‍َٔلُونَكَ عَنِ ٱلشَّهۡرِ ٱلۡحَرَامِ قِتَالٖ فِيهِۖ قُلۡ قِتَالٞ فِيهِ كَبِيرٞۚ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفۡرُۢ بِهِۦ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَإِخۡرَاجُ أَهۡلِهِۦ مِنۡهُ أَكۡبَرُ عِندَ ٱللَّهِۚ وَٱلۡفِتۡنَةُ أَكۡبَرُ مِنَ ٱلۡقَتۡلِۗ وَلَا يَزَالُونَ يُقَٰتِلُونَكُمۡ حَتَّىٰ يَرُدُّوكُمۡ عَن دِينِكُمۡ إِنِ ٱسۡتَطَٰعُواْۚ وَمَن يَرۡتَدِدۡ مِنكُمۡ عَن دِينِهِۦ فَيَمُتۡ وَهُوَ كَافِرٞ فَأُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٧١٢\n                                    \n                                    \n                                    قال ابن أبي حاتم : حدثنا أبي ، حدثنا محمد بن أبي بكر المقدمي ، حدثنا المعتمر بن سليمان ، عن أبيه ، حدثني الحضرمي ، عن أبي السوار ، عن جندب بن عبد الله ، أن رسول الله صلى الله عليه وسلم بعث رهطا ، وبعث عليهم أبا عبيدة بن الجراح [ أو عبيدة بن الحارث ] فلما ذهب ينطلق ، بكى صبابة إلى رسول الله صلى الله عليه وسلم ، فجلس ، فبعث عليهم مكانه عبد الله بن جحش ، وكتب له كتابا ، وأمره ألا يقرأ الكتاب حتى يبلغ مكان كذا وكذا ، وقال : لا تكرهن أحدا على السير معك من أصحابك . فلما قرأ الكتاب استرجع ، وقال : سمعا وطاعة لله ولرسوله . فخبرهم الخبر ، وقرأ عليهم الكتاب ، فرجع رجلان ، وبقي بقيتهم ، فلقوا ابن الحضرمي فقتلوه ، ولم يدروا أن ذلك اليوم من رجب أو من جمادى . فقال المشركون للمسلمين : قتلتم في الشهر الحرام ! فأنزل الله : ( يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير ) الآية .\nوقال السدي ، عن أبي مالك ، وعن أبي صالح ، عن ابن عباس وعن مرة ، عن ابن مسعود : ( يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير ) وذلك أن رسول الله صلى الله عليه وسلم بعث سرية ، وكانوا سبعة نفر ، عليهم عبد الله بن جحش الأسدي ، وفيهم عمار بن ياسر ، وأبو حذيفة بن عتبة بن ربيعة ، وسعد بن أبي وقاص ، وعتبة بن غزوان السلمي حليف لبني نوفل وسهيل بن بيضاء ، وعامر بن فهيرة ، وواقد بن عبد الله اليربوعي ، حليف لعمر بن الخطاب . وكتب لابن جحش كتابا ، وأمره ألا يقرأه حتى ينزل بطن ملل فلما نزل بطن ملل فتح الكتاب ، فإذا فيه : أن سر حتى تنزل بطن نخلة . فقال لأصحابه : من كان يريد الموت فليمض وليوص ، فإنني موص وماض لأمر رسول الله صلى الله عليه وسلم . فسار ، فتخلف عنه سعد بن أبي وقاص ، وعتبة ، وأضلا راحلة لهما فأتيا بحران يطلبانها ، وسار ابن جحش إلى بطن نخلة ، فإذا هو بالحكم بن كيسان ، والمغيرة بن عثمان ، وعمرو بن الحضرمي ، وعبد الله بن المغيرة . وانفلت [ ابن ] المغيرة ، [ فأسروا الحكم بن كيسان والمغيرة ] وقتل عمرو ، قتله واقد بن عبد الله . فكانت أول غنيمة غنمها أصحاب النبي صلى الله عليه وسلم .\nفلما رجعوا إلى المدينة بالأسيرين وما أصابوا المال ، أراد أهل مكة أن يفادوا الأسيرين ، فقال النبي صلى الله عليه وسلم : \" حتى ننظر ما فعل صاحبانا \" فلما رجع سعد وصاحبه ، فادى بالأسيرين ، ففجر عليه المشركون وقالوا : إن محمدا يزعم أنه يتبع طاعة الله ، وهو أول من استحل الشهر الحرام ، وقتل صاحبنا في رجب . فقال المسلمون : إنما قتلناه في جمادى وقيل : في أول رجب ، وآخر ليلة من جمادى وغمد المسلمون سيوفهم حين دخل شهر رجب . فأنزل الله يعير أهل مكة : ( يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير ) لا يحل ، وما صنعتم أنتم يا معشر المشركين أكبر من القتل في الشهر الحرام ، حين كفرتم بالله ، وصددتم عنه محمدا صلى الله عليه وسلم وأصحابه ، وإخراج أهل المسجد الحرام منه ، حين أخرجوا محمدا صلى الله عليه وسلم أكبر من القتل عند الله .\nوقال العوفي ، عن ابن عباس : ( يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير ) وذلك أن المشركين صدوا رسول الله صلى الله عليه وسلم ، وردوه عن المسجد [ الحرام ] في شهر حرام ، ففتح الله على نبيه في شهر حرام من العام المقبل . فعاب المشركون على رسول الله صلى الله عليه وسلم القتال في شهر حرام . فقال الله : ( وصد عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر ) من القتال فيه . وأن محمدا صلى الله عليه وسلم بعث سرية فلقوا عمرو بن الحضرمي ، وهو مقبل من الطائف في آخر ليلة من جمادى ، وأول ليلة من رجب . وأن أصحاب محمد صلى الله عليه وسلم كانوا يظنون أن تلك الليلة من جمادى ، وكانت أول رجب ولم يشعروا ، فقتله رجل منهم وأخذوا ما كان معه . وأن المشركين أرسلوا يعيرونه بذلك . فقال الله : ( يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير ) وغير ذلك أكبر منه : صد عن سبيل الله ، وكفر به والمسجد الحرام ، وإخراج أهله منه ، إخراج أهل المسجد الحرام أكبر من الذي أصاب أصحاب محمد صلى الله عليه وسلم ، والشرك أشد منه .\nوهكذا روى أبو سعد البقال ، عن عكرمة ، عن ابن عباس أنها أنزلت في سرية عبد الله بن جحش ، وقتل عمرو بن الحضرمي .\nوقال محمد بن إسحاق : حدثني محمد بن السائب الكلبي ، عن أبي صالح ، عن ابن عباس قال : نزل فيما كان من مصاب عمرو بن الحضرمي : ( يسألونك عن الشهر الحرام قتال فيه ) إلى آخر الآية .\nوقال عبد الملك بن هشام راوي السيرة ، عن زياد بن عبد الله البكائي ، عن محمد بن إسحاق بن يسار المدني ، رحمه الله ، في كتاب السيرة له ، أنه قال : وبعث يعني رسول الله صلى الله عليه وسلم عبد الله بن جحش بن رئاب الأسدي في رجب ، مقفله من بدر الأولى ، وبعث معه ثمانية رهط من المهاجرين ، ليس فيهم من الأنصار أحد ، وكتب له كتابا ، وأمره ألا ينظر فيه حتى يسير يومين ثم ينظر فيه ، فيمضي لما أمره به ، ولا يستكره من أصحابه أحدا . وكان أصحاب عبد الله بن جحش من المهاجرين . ثم من بني عبد شمس بن عبد مناف : أبو حذيفة بن عتبة بن ربيعة بن عبد شمس بن عبد مناف ، ومن حلفائهم : عبد الله بن جحش ، وهو أمير القوم ، وعكاشة بن محصن بن حرثان ، أحد بني أسد بن خزيمة ، حليف لهم . ومن بني نوفل بن عبد مناف : عتبة بن غزوان بن جابر ، حليف لهم . ومن بني زهرة بن كلاب : سعد بن أبي وقاص . ومن بني عدي بن كعب : عامر بن ربيعة ، حليف لهم من عنز بن وائل ، وواقد بن عبد الله بن عبد مناف بن عرين بن ثعلبة بن يربوع ، أحد بني تميم ، حليف لهم . وخالد بن البكير أحد بني سعد بن ليث ، حليف لهم . ومن بني الحارث بن فهر : سهيل بن بيضاء .\nفلما سار عبد الله بن جحش يومين فتح الكتاب فنظر فيه فإذا فيه : \" إذا نظرت في كتابي هذا فامض حتى تنزل نخلة ، بين مكة والطائف ، ترصد بها قريشا ، وتعلم لنا من أخبارهم \" . فلما نظر عبد الله بن جحش في الكتاب قال : سمعا وطاعة . ثم قال لأصحابه : قد أمرني رسول الله صلى الله عليه وسلم أن أمضي إلى نخلة ، أرصد بها قريشا ، حتى آتيه منهم بخبر ، وقد نهاني أن أستكره أحدا منكم . فمن كان منكم يريد الشهادة ويرغب فيها فلينطلق ، ومن كره ذلك فليرجع ، فأما أنا فماض لأمر رسول الله صلى الله عليه وسلم ، فمضى ومضى معه أصحابه لم يتخلف عنه منهم أحد .\nفسلك على الحجاز ، حتى إذا كان بمعدن ، فوق الفرع ، يقال له : بحران أضل سعد بن أبي وقاص وعتبة بن غزوان بعيرا لهما ، كانا يعتقبانه ، فتخلفا عليه في طلبه ، ومضى عبد الله بن جحش وبقية أصحابه حتى نزل بنخلة ، فمرت به عير لقريش تحمل زبيبا وأدما وتجارة من تجارة قريش ، فيها : عمرو بن الحضرمي ، وعثمان بن عبد الله بن المغيرة ، وأخوه نوفل بن عبد الله المخزوميان ، والحكم بن كيسان ، مولى هشام بن المغيرة .\nفلما رآهم القوم هابوهم وقد نزلوا قريبا منهم ، فأشرف لهم عكاشة بن محصن ، وكان قد حلق رأسه ، فلما رأوه أمنوا وقالوا : عمار ، لا بأس عليكم منهم . وتشاور القوم فيهم ، وذلك في آخر يوم من رجب ، فقال القوم : والله لئن تركتم القوم هذه الليلة ليدخلن الحرم ، فليمتنعن منكم به ، ولئن قتلتموهم لتقتلنهم في الشهر الحرام . فتردد القوم ، وهابوا الإقدام عليهم ، ثم شجعوا أنفسهم عليهم ، وأجمعوا على قتل من قدروا عليه منهم ، وأخذ ما معهم . فرمى واقد بن عبد الله التميمي عمرو بن الحضرمي بسهم فقتله ، واستأسر عثمان بن عبد الله والحكم بن كيسان ، وأفلت القوم نوفل بن عبد الله فأعجزهم . وأقبل عبد الله بن جحش وأصحابه بالعير والأسيرين ، حتى قدموا على رسول الله صلى الله عليه وسلم المدينة .\nقال ابن إسحاق : وقد ذكر بعض آل عبد الله بن جحش : أن عبد الله قال لأصحابه : إن لرسول الله صلى الله عليه وسلم مما غنمنا الخمس ، وذلك قبل أن يفرض الله الخمس من المغانم ، فعزل لرسول الله صلى الله عليه وسلم خمس العير ، وقسم سائرها بين أصحابه .\nقال ابن إسحاق : فلما قدموا على رسول الله قال : \" ما أمرتكم بقتال في الشهر الحرام \" . فوقف العير والأسيرين ، وأبى أن يأخذ من ذلك شيئا ، فلما قال ذلك رسول الله صلى الله عليه وسلم أسقط في أيدي القوم ، وظنوا أنهم قد هلكوا ، وعنفهم إخوانهم من المسلمين فيما صنعوا . وقالت قريش : قد استحل محمد وأصحابه الشهر الحرام ، وسفكوا فيه الدم ، وأخذوا فيه الأموال ، وأسروا فيه الرجال . فقال من يرد عليهم من المسلمين ممن كان بمكة : إنما أصابوا ما أصابوا في شعبان .\nوقالت يهود تفاءل بذلك على رسول الله صلى الله عليه وسلم : عمرو بن الحضرمي قتله واقد بن عبد الله : عمرو : عمرت الحرب ، والحضرمي : حضرت الحرب ، وواقد بن عبد الله : وقدت الحرب . فجعل الله عليهم ذلك لا لهم .\nفلما أكثر الناس في ذلك أنزل الله على رسوله صلى الله عليه وسلم : ( يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير وصد عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر عند الله والفتنة أكبر من القتل ) أي : إن كنتم قتلتم في الشهر الحرام فقد صدوكم عن سبيل الله مع الكفر به ، وعن المسجد الحرام ، وإخراجكم منه وأنتم أهله أكبر عند الله من قتل من قتلتم منهم ، ( والفتنة أكبر من القتل ) أي : قد كانوا يفتنون المسلم في دينه ، حتى يردوه إلى الكفر بعد إيمانه فذلك أكبر عند الله من القتل :\n( ولا يزالون يقاتلونكم حتى يردوكم عن دينكم إن استطاعوا ) أي : ثم هم مقيمون على أخبث ذلك وأعظمه ، غير تائبين ولا نازعين .\nقال ابن إسحاق : فلما نزل القرآن بهذا من الأمر ، وفرج الله عن المسلمين ما كانوا فيه من الشفق قبض رسول الله صلى الله عليه وسلم العير والأسيرين ، وبعثت إليه قريش في فداء عثمان بن عبد الله ، والحكم بن كيسان ، فقال رسول الله صلى الله عليه وسلم : لا نفديكموهما حتى يقدم صاحبانا يعني سعد بن أبي وقاص وعتبة بن غزوان فإنا نخشاكم عليهما ، فإن تقتلوهما نقتل صاحبيكم . فقدم سعد وعتبة ، فأفداهما رسول الله صلى الله عليه وسلم منهم .\nفأما الحكم بن كيسان فأسلم وحسن إسلامه ، وأقام عند رسول الله صلى الله عليه وسلم حتى قتل يوم بئر معونة شهيدا . وأما عثمان بن عبد الله فلحق بمكة ، فمات بها كافرا .\n                                    ",
        "qortoby": "يَسۡ‍َٔلُونَكَ عَنِ ٱلشَّهۡرِ ٱلۡحَرَامِ قِتَالٖ فِيهِۖ قُلۡ قِتَالٞ فِيهِ كَبِيرٞۚ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفۡرُۢ بِهِۦ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَإِخۡرَاجُ أَهۡلِهِۦ مِنۡهُ أَكۡبَرُ عِندَ ٱللَّهِۚ وَٱلۡفِتۡنَةُ أَكۡبَرُ مِنَ ٱلۡقَتۡلِۗ وَلَا يَزَالُونَ يُقَٰتِلُونَكُمۡ حَتَّىٰ يَرُدُّوكُمۡ عَن دِينِكُمۡ إِنِ ٱسۡتَطَٰعُواْۚ وَمَن يَرۡتَدِدۡ مِنكُمۡ عَن دِينِهِۦ فَيَمُتۡ وَهُوَ كَافِرٞ فَأُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٧١٢\n                                    \n                                    \n                                    يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير وصد عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر عند الله والفتنة أكبر من القتل ولا يزالون يقاتلونكم حتى يردوكم عن دينكم إن استطاعوا ومن يرتدد منكم عن دينه فيمت وهو كافر فأولئك حبطت أعمالهم في الدنيا والآخرة وأولئك أصحاب النار هم فيها خالدون\nفيه احدى عشرة مسألة :\nالأولى : قوله تعالى : \" يسألونك \" تقدم القول فيه . وروى جرير بن عبد الحميد ومحمد بن فضيل عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس قال : ( ما رأيت قوما خيرا من أصحاب محمد صلى الله عليه وسلم ، ما سألوه إلا عن ثلاث عشرة مسألة كلهن في القرآن : يسألونك عن المحيض ، يسألونك عن الشهر الحرام ، يسألونك عن اليتامى ، ما كانوا يسألون إلا عما ينفعهم ) . قال ابن عبد البر : ليس في الحديث من الثلاث عشرة مسألة إلا ثلاث . وروى أبو اليسار عن جندب بن عبد الله أن النبي صلى الله عليه وسلم بعث رهطا وبعث عليهم أبا عبيدة بن الحارث أو عبيدة بن الحارث ، فلما ذهب لينطلق بكى صبابة إلى رسول الله صلى الله عليه وسلم ، فبعث عبد الله بن جحش ، وكتب له كتابا وأمره ألا يقرأ الكتاب حتى يبلغ مكان كذا وكذا ، وقال : ولا تكرهن أصحابك على المسير ، فلما بلغ المكان قرأ الكتاب فاسترجع وقال : سمعا وطاعة لله ولرسوله ، قال : فرجع رجلان ومضى بقيتهم ، فلقوا ابن الحضرمي فقتلوه ، ولم يدروا أن ذلك اليوم من رجب ، فقال المشركون : قتلتم في الشهر الحرام ، فأنزل الله تعالى : يسألونك عن الشهر الحرام الآية . وروي أن سبب نزولها أن رجلين من بني كلاب لقيا عمرو بن أمية الضمري وهو لا يعلم أنهما كانا عند النبي صلى الله عليه وسلم وذلك في أول يوم من رجب فقتلهما ، فقالت قريش : قتلهما في الشهر الحرام ، فنزلت الآية . والقول بأن نزولها في قصة عبد الله بن جحش أكثر وأشهر ، وأن النبي صلى الله عليه وسلم بعثه مع تسعة رهط ، وقيل ثمانية ، في جمادى الآخرة قبل بدر بشهرين ، وقيل في رجب . قال أبو عمر - في كتاب الدرر له - : ولما رجع رسول الله صلى الله عليه وسلم من طلب كرز بن جابر - وتعرف تلك الخرجة ببدر الأولى - أقام بالمدينة بقية جمادى الآخرة ورجب ، وبعث في رجب عبد الله بن جحش بن رئاب الأسدي ومعه ثمانية رجال من المهاجرين ، وهم أبو حذيفة بن عتبة ، وعكاشة بن محصن ، وعتبة بن غزوان ، وسهيل بن بيضاء الفهري ، وسعد بن أبي وقاص ، وعامر بن ربيعة ، وواقد بن عبد الله التميمي ، وخالد بن بكير الليثي . وكتب لعبد الله بن جحش كتابا ، وأمره ألا ينظر فيه حتى يسير يومين ثم ينظر فيه فيمضي لما أمره به ولا يستكره أحدا من أصحابه ، وكان أميرهم ، ففعل عبد الله بن جحش ما أمره به ، فلما فتح الكتاب وقرأه وجد فيه : ( إذا نظرت في كتابي هذا فامض حتى تنزل نخلة بين مكة والطائف فترصد بها قريشا ، وتعلم لنا من أخبارهم ) . فلما قرأ الكتاب قال : سمعا وطاعة ، ثم أخبر أصحابه بذلك ، وبأنه لا يستكره أحدا منهم ، وأنه ناهض لوجهه بمن أطاعه ، وأنه إن لم يطعه أحد مضى وحده ، فمن أحب الشهادة فلينهض ، ومن كره الموت فليرجع . فقالوا : كلنا نرغب فيما ترغب فيه ، وما منا أحد إلا وهو سامع مطيع لرسول الله صلى الله عليه وسلم ، ونهضوا معه ، فسلك على الحجاز ، وشرد لسعد بن أبي وقاص وعتبة بن غزوان جمل كانا يعتقبانه فتخلفا في طلبه ، ونفذ عبد الله بن جحش مع سائرهم لوجهه حتى نزل بنخلة ، فمرت بهم عير لقريش تحمل زبيبا وتجارة فيها عمرو بن الحضرمي - واسم الحضرمي عبد الله بن عباد من الصدف ، والصدف بطن من حضرموت - وعثمان بن عبد الله بن المغيرة ، وأخوه نوفل بن عبد الله بن المغيرة المخزوميان ، والحكم بن كيسان مولى بني المغيرة ، فتشاور المسلمون وقالوا : نحن في آخر يوم من رجب الشهر الحرام ، فإن نحن قاتلناهم هتكنا حرمة الشهر الحرام : وإن تركناهم الليلة دخلوا الحرم ، ثم اتفقوا على لقائهم ، فرمى واقد بن عبد الله التميمي عمرو بن الحضرمي فقتله ، وأسروا عثمان بن عبد الله والحكم بن كيسان ، وأفلت نوفل بن عبد الله ، ثم قدموا بالعير والأسيرين ، وقال لهم عبد الله بن جحش : اعزلوا مما غنمنا الخمس لرسول الله صلى الله عليه وسلم ففعلوا ، فكان أول خمس في الإسلام ، ثم نزل القرآن : واعلموا أنما غنمتم من شيء فأن لله خمسه فأقر الله ورسوله فعل عبد الله بن جحش ورضيه وسنه للأمة إلى يوم القيامة ، وهي أول غنيمة غنمت في الإسلام ، وأول أمير ، وعمرو بن الحضرمي أول قتيل . وأنكر رسول الله صلى الله عليه وسلم قتل ابن الحضرمي في الشهر الحرام ، فسقط في أيدي القوم ، فأنزل الله عز وجل : يسألونك عن الشهر الحرام قتال فيه إلى قوله : هم فيها خالدون . وقبل رسول الله صلى الله عليه وسلم الفداء في الأسيرين ، فأما عثمان بن عبد الله فمات بمكة كافرا ، وأما الحكم بن كيسان فأسلم وأقام مع رسول الله صلى الله عليه وسلم حتى استشهد ببئر معونة ، ورجع سعد وعتبة إلى المدينة سالمين . وقيل : إن انطلاق سعد بن أبي وقاص وعتبة في طلب بعيرهما كان عن إذن من عبد الله بن جحش ، وإن عمرو بن الحضرمي وأصحابه لما رأوا أصحاب رسول الله صلى الله عليه وسلم هابوهم ، فقال عبد الله بن جحش : إن القوم قد فزعوا منكم ، فاحلقوا رأس رجل منكم فليتعرض لهم ، فإذا رأوه محلوقا أمنوا وقالوا : قوم عمار لا بأس عليكم ، وتشاوروا في قتالهم ، الحديث . وتفاءلت اليهود وقالوا : واقد وقدت الحرب ، وعمرو عمرت الحرب ، والحضرمي حضرت الحرب . وبعث أهل مكة في فداء أسيريهم ، فقال : لا نفديهما حتى يقدم سعد وعتبة ، وإن لم يقدما قتلناهما بهما ، فلما قدما فاداهما ، فأما الحكم فأسلم وأقام بالمدينة حتى قتل يوم بئر معونة شهيدا ، وأما عثمان فرجع إلى مكة فمات بها كافرا ، وأما نوفل فضرب بطن فرسه يوم الأحزاب ليدخل الخندق على المسلمين فوقع في الخندق مع فرسه فتحطما جميعا فقتله الله تعالى ، وطلب المشركون جيفته بالثمن ، فقال رسول الله صلى الله عليه وسلم : خذوه فإنه خبيث الجيفة خبيث الدية فهذا سبب نزول قوله تعالى : يسألونك عن الشهر الحرام . وذكر ابن إسحاق أن قتل عمرو بن الحضرمي كان في آخر يوم من رجب ، على ما تقدم . وذكر الطبري عن السدي وغيره أن ذلك كان في آخر يوم من جمادى الآخرة ، والأول أشهر ، على أن ابن عباس قد ورد عنه أن ذلك كان في أول ليلة من رجب ، والمسلمون يظنونها من جمادى . قال ابن عطية : وذكر الصاحب بن عباد في رسالته المعروفة بالأسدية أن عبد الله بن جحش سمي أمير المؤمنين في ذلك الوقت لكونه مؤمرا على جماعة من المؤمنين .\nالثانية واختلف العلماء في نسخ هذه الآية ، فالجمهور على نسخها ، وأن قتال المشركين في الأشهر الحرم مباح . واختلفوا في ناسخها ، فقال الزهري : نسخها \" وقاتلوا المشركين كافة \" . وقيل نسخها غزو النبي صلى الله عليه وسلم ثقيفا في الشهر الحرام ، وإغزاؤه أبا عامر إلى أوطاس في الشهر الحرام . وقيل : نسخها بيعة الرضوان على القتال في ذي القعدة ، وهذا ضعيف ، فإن النبي صلى الله عليه وسلم لما بلغه قتل عثمان بمكة وأنهم عازمون على حربه بايع حينئذ المسلمين على دفعهم لا على الابتداء بقتالهم . وذكر البيهقي عن عروة بن الزبير من غير حديث محمد بن إسحاق في أثر قصة الحضرمي : فأنزل الله عز وجل : يسألونك عن الشهر الحرام قتال فيه الآية ، قال : فحدثهم الله في كتابه أن القتال في الشهر الحرام حرام كما كان ، وأن الذي يستحلون من المؤمنين هو أكبر من ذلك من صدهم عن سبيل الله حين يسجنونهم ويعذبونهم ويحبسونهم أن يهاجروا إلى رسول الله صلى الله عليه وسلم ، وكفرهم بالله وصدهم المسلمين عن المسجد الحرام في الحج والعمرة والصلاة فيه ، وإخراجهم أهل المسجد الحرام وهم سكانه من المسلمين ، وفتنتهم إياهم عن الدين ، فبلغنا أن النبي صلى الله عليه وسلم عقل ابن الحضرمي وحرم الشهر الحرام كما كان يحرمه ، حتى أنزل الله عز وجل : \" براءة من الله ورسوله \" . وكان عطاء يقول : الآية محكمة ، ولا يجوز القتال في الأشهر الحرم ، ويحلف على ذلك ؛ لأن الآيات التي وردت بعدها عامة في الأزمنة ، وهذا خاص والعام لا ينسخ الخاص باتفاق . وروى أبو الزبير عن جابر قال : كان رسول الله صلى الله عليه وسلم لا يقاتل في الشهر الحرام إلا أن يغزى .\nالثالثة : قوله تعالى : \" قتال فيه \" \" قتال \" بدل عند سيبويه بدل اشتمال ؛ لأن السؤال اشتمل على الشهر وعلى القتال ، أي يسألك الكفار تعجبا من هتك حرمة الشهر ، فسؤالهم عن الشهر إنما كان لأجل القتال فيه . قال الزجاج : المعنى يسألونك عن القتال في الشهر الحرام . وقال القتبي : يسألونك عن القتال في الشهر الحرام هل يجوز ؟ فأبدل قتالا من الشهر ، وأنشد سيبويه [ للشاعر عبدة بن الطيب ] :\nفما كان قيس هلكه هلك واحد ولكنه بنيان قوم تهدما\nوقرأ عكرمة : \" يسألونك عن الشهر الحرام قتل فيه قل قتل \" بغير ألف فيهما . وقيل : المعنى يسألونك عن الشهر الحرام وعن قتال فيه ، وهكذا قرأ ابن مسعود ، فيكون مخفوضا بعن على التكرير ، قاله الكسائي . وقال الفراء : هو مخفوض على نية عن . وقال أبو عبيدة : هو مخفوض على الجوار . قال النحاس : لا يجوز أن يعرب الشيء على الجوار في كتاب الله ولا في شيء من الكلام ، وإنما الجوار غلط ، وإنما وقع في شيء شاذ ، وهو قولهم : هذا جحر ضب خرب ، والدليل على أنه غلط قول العرب في التثنية : هذان : جحرا ضب خربان ، وإنما هذا بمنزلة الإقواء ، ولا يجوز أن يحمل شيء من كتاب الله على هذا ، ولا يكون إلا بأفصح اللغات وأصحها . قال ابن عطية : وقال أبو عبيدة : هو خفض على الجوار ، وقوله هذا خط . قال النحاس : ولا يجوز إضمار \" عن \" ، والقول فيه أنه بدل . وقرأ الأعرج : \" يسألونك عن الشهر الحرام قتال فيه \" بالرفع . قال النحاس : وهو غامض في العربية ، والمعنى فيه يسألونك عن الشهر الحرام أجائز قتال فيه ؟ فقوله : \" يسألونك \" يدل على الاستفهام ، كما قال امرؤ القيس :\nأصاح ترى برقا أريك وميضه كلمع اليدين في حبي مكلل\nوالمعنى : أترى برقا ، فحذف ألف الاستفهام ؛ لأن الألف التي في \" أصاح \" تدل عليها وإن كانت حرف نداء ، كما قال الشاعر :\nتروح من الحي أم تبتكر\nوالمعنى : أتروح ، فحذف الألف لأن \" أم \" تدل عليها .\nالرابعة : قوله تعالى : قل قتال فيه كبير ابتداء وخبر ، أي مستنكر ؛ لأن تحريم القتال في الشهر الحرام كان ثابتا يومئذ إذ كان الابتداء من المسلمين . والشهر في الآية اسم جنس ، وكانت العرب قد جعل الله لها الشهر الحرام قواما تعتدل عنده ، فكانت لا تسفك دما ، ولا تغير في الأشهر الحرم ، وهي رجب وذو القعدة وذو الحجة والمحرم ، ثلاثة سرد وواحد فرد . وسيأتي لهذا مزيد بيان في \" المائدة \" إن شاء الله تعالى .\nالخامسة : قوله تعالى : وصد عن سبيل الله ابتداء \" وكفر به \" عطف على \" صد \" \" والمسجد الحرام \" عطف على \" سبيل الله \" \" وإخراج أهله منه \" عطف على \" صد \" ، وخبر الابتداء \" أكبر عند الله \" أي أعظم إثما من القتال في الشهر الحرام ، قاله المبرد وغيره . وهو الصحيح ، لطول منع الناس عن الكعبة أن يطاف بها . \" وكفر به \" أي بالله ، وقيل : \" وكفر به \" أي بالحج والمسجد الحرام . \" وإخراج أهله منه أكبر \" أي أعظم عقوبة عند الله من القتال في الشهر الحرام . وقال الفراء : \" صد \" عطف على \" كبير \" . \" والمسجد \" عطف على الهاء في به ، فيكون الكلام نسقا متصلا غير منقطع . قال ابن عطية : وذلك خطأ ؛ لأن المعنى يسوق إلى أن قوله : \" وكفر به \" أي بالله عطف أيضا على \" كبير \" ، ويجيء من ذلك أن إخراج أهل المسجد منه أكبر من الكفر عند الله ، وهذا بين فساده . ومعنى الآية على قول الجمهور : إنكم يا كفار قريش تستعظمون علينا القتال في الشهر الحرام ، وما تفعلون أنتم من الصد عن سبيل الله لمن أراد الإسلام ، ومن كفركم بالله وإخراجكم أهل المسجد منه ، كما فعلتم برسول الله صلى الله عليه وسلم وأصحابه أكبر جرما عند الله . وقال عبد الله بن جحش رضي الله عنه :\nتعدون قتلا في الحرام عظيمة وأعظم منه لو يرى الرشد راشد\nصدودكم عما يقول محمد وكفر به والله راء وشاهد\nوإخراجكم من مسجد الله أهله لئلا يرى لله في البيت ساجد\nفإنا وإن غيرتمونا بقتله وأرجف بالإسلام باغ وحاسد\nسقينا من ابن الحضرمي رماحنا بنخلة لما أوقد الحرب واقد\nدما وابن عبد الله عثمان بيننا ينازعه غل من القد عاند\nوقال الزهري ومجاهد وغيرهما : قوله تعالى : قل قتال فيه كبير منسوخ بقوله : وقاتلوا المشركين كافة وبقوله : فاقتلوا المشركين . وقال عطاء : لم ينسخ ، ولا ينبغي القتال في الأشهر الحرم ، وقد تقدم .\nالسادسة : قوله تعالى : والفتنة أكبر من القتل قال مجاهد وغيره : الفتنة هنا الكفر ، أي كفركم أكبر من قتلنا أولئك . وقال الجمهور : معنى الفتنة هنا فتنتهم المسلمين عن دينهم حتى يهلكوا ، أي أن ذلك أشد اجتراما من قتلكم في الشهر الحرام .\nالسابعة : قوله تعالى : \" ولا يزالون \" ابتداء خبر من الله تعالى ، وتحذير منه للمؤمنين من شر الكفرة . قالمجاهد : يعني كفار قريش . \" يردوكم \" نصب بحتى ؛ لأنها غاية مجردة .\nالثامنة : قوله تعالى : \" ومن يرتدد \" أي يرجع عن الإسلام إلى الكفر . \" فأولئك حبطت \" أي بطلت وفسدت ، ومنه الحبط وهو فساد يلحق المواشي في بطونها من كثرة أكلها الكلأ فتنتفخ أجوافها ، وربما تموت من ذلك ، فالآية تهديد للمسلمين ليثبتوا على دين الإسلام .\nالتاسعة : واختلف العلماء في المرتد هل يستتاب أم لا ؟ وهل يحبط عمله بنفس الردة أم لا ، إلا على الموافاة على الكفر ؟ وهل يورث أم لا ؟ فهذه ثلاث مسائل :\nالأولى : قالت طائفة : يستتاب ، فإن تاب وإلا قتل ، وقال بعضهم : ساعة واحدة . وقال آخرون : يستتاب شهرا . وقال آخرون : يستتاب ثلاثا ، على ما روي عن عمر وعثمان ، وهو قول مالك رواه عنه ابن القاسم . وقال الحسن : يستتاب مائة مرة ، وقد روي عنه أنه يقتل دون استتابة ، وبه قال الشافعي في أحد قوليه ، وهو أحد قولي طاوس وعبيد بن عمير . وذكر سحنون أن عبد العزيز بن أبي سلمة الماجشون كان يقول : يقتل المرتد ولا يستتاب ، واحتج بحديث معاذ وأبي موسى ، وفيه أن النبي صلى الله عليه وسلم لما بعث أبا موسى إلى اليمن أتبعه معاذ بن جبل فلما قدم عليه قال : انزل ، وألقى إليه وسادة ، وإذا رجل عنده موثق قال : ما هذا ؟ قال : هذا كان يهوديا فأسلم ثم راجع دينه دين السوء فتهود . قال : لا أجلس حتى يقتل ، قضاء الله ورسوله ، فقال : اجلس . قال : نعم لا أجلس حتى يقتل ، قضاء الله ورسوله - ثلاث مرات - فأمر به فقتل ، خرجه مسلم وغيره . وذكر أبو يوسف عن أبي حنيفة أن المرتد يعرض عليه الإسلام فإن أسلم وإلا قتل مكانه ، إلا أن يطلب أن يؤجل ، فإن طلب ذلك أجل ثلاثة أيام ، والمشهور عنه وعن أصحابه أن المرتد لا يقتل حتى يستتاب . والزنديق عندهم والمرتد سواء . وقال مالك : وتقتل الزنادقة ولا يستتابون . وقد مضى هذا أول \" البقرة \" . واختلفوا فيمن خرج من كفر إلى كفر ، فقال مالك وجمهور الفقهاء : لا يتعرض له ؛ لأنه انتقل إلى ما لو كان عليه في الابتداء لأقر عليه . وحكى ابن عبد الحكم عن الشافعي أنه يقتل ، لقوله عليه السلام : من بدل دينه فاقتلوه ولم يخص مسلما من كافر . وقال مالك : معنى الحديث من خرج من الإسلام إلى الكفر ، وأما من خرج من كفر إلى كفر فلم يعن بهذا الحديث ، وهو قول جماعة من الفقهاء . والمشهور عن الشافعي ما ذكره المزني والربيع أن المبدل لدينه من أهل الذمة يلحقه الإمام بأرض الحرب ويخرجه من بلده ويستحل ماله مع أموال الحربيين إن غلب على الدار ؛ لأنه إنما جعل له الذمة على الدين الذي كان عليه في حين عقد العهد . واختلفوا في المرتدة ، فقال مالك والأوزاعي والشافعي والليث بن سعد : تقتل كما يقتل المرتد سواء ، وحجتهم ظاهر الحديث : من بدل دينه فاقتلوه . و \" من \" يصلح للذكر والأنثى . وقال الثوري وأبو حنيفة وأصحابه : لا تقتل المرتدة ، وهو قول ابن شبرمة ، وإليه ذهب ابن علية ، وهو قول عطاء والحسن . واحتجوا بأن ابن عباس روى عن النبي صلى الله عليه وسلم أنه قال : من بدل دينه فاقتلوه ثم إن ابن عباس لم يقتل المرتدة ، ومن روى حديثا كان أعلم بتأويله ، وروي عن علي مثله . ونهى صلى الله عليه وسلم عن قتل النساء والصبيان . واحتج الأولون بقوله عليه السلام : لا يحل دم امرئ مسلم إلا بإحدى ثلاث : كفر بعد إيمان . . . فعم كل من كفر بعد إيمانه ، وهو أصح .\nالعاشرة : قال الشافعي : إن من ارتد ثم عاد إلى الإسلام لم يحبط عمله ولا حجه الذي فرغ منه ، بل إن مات على الردة فحينئذ تحبط أعماله . وقال مالك : تحبط بنفس الردة ، ويظهر الخلاف في المسلم إذا حج ثم ارتد ثم أسلم ، فقال مالك : يلزمه الحج ؛ لأن الأول قد حبط بالردة . وقال الشافعي : لا إعادة عليه ؛ لأن عمله باق . واستظهر علماؤنا بقوله تعالى : لئن أشركت ليحبطن عملك . قالوا : وهو خطاب للنبي صلى الله عليه وسلم والمراد أمته ؛ لأنه عليه السلام يستحيل منه الردة شرعا . وقال أصحاب الشافعي : بل هو خطاب النبي صلى الله عليه وسلم على طريق التغليظ على الأمة ، وبيان أن النبي صلى الله عليه وسلم على شرف منزلته لو أشرك لحبط عمله ، فكيف أنتم! لكنه لا يشرك لفضل مرتبته ، كما قال : يا نساء النبي من يأت منكن بفاحشة مبينة يضاعف لها العذاب ضعفين ، وذلك لشرف منزلتهن ، وإلا فلا يتصور إتيانه منهن صيانة لزوجهن المكرم المعظم ؛ ابن العربي . وقال علماؤنا : إنما ذكر الله الموافاة شرطا هاهنا لأنه علق عليها الخلود في النار جزاء ، فمن وافى على الكفر خلده الله في النار بهذه الآية ، ومن أشرك حبط عمله بالآية الأخرى ، فهما آيتان مفيدتان لمعنيين ، وحكمين متغايرين . وما خوطب به عليه السلام فهو لأمته حتى يثبت اختصاصه ، وما ورد في أزواجه فإنما قيل ذلك فيهن ليبين أنه لو تصور لكان هتكان : أحدهما لحرمة الدين ، والثاني لحرمة النبي صلى الله عليه وسلم ، ولكل هتك حرمة عقاب ، وينزل ذلك منزلة من عصى في الشهر الحرام أو في البلد الحرام أو في المسجد الحرام ، يضاعف عليه العذاب بعدد ما هتك من الحرمات . والله أعلم .\nالحادية عشرة : وهي اختلاف العلماء في ميراث المرتد ، فقال علي بن أبي طالب والحسن والشعبي والحكم والليث وأبو حنيفة وإسحاق بن راهويه : ميراث المرتد لورثته من المسلمين . وقال مالك وربيعة وابن أبي ليلى والشافعي وأبو ثور : ميراثه في بيت المال . وقال ابن شبرمة وأبو يوسف ومحمد والأوزاعي في إحدى الروايتين : ما اكتسبه المرتد بعد الردة فهو لورثته المسلمين . وقال أبو حنيفة : ما اكتسبه المرتد في حال الردة فهو فيء ، وما كان مكتسبا في حالة الإسلام ثم ارتد يرثه ورثته المسلمون ، وأما ابن شبرمة وأبو يوسف ومحمد فلا يفصلون بين الأمرين ، ومطلق قوله عليه السلام : لا وراثة بين أهل ملتين يدل على بطلان قولهم . وأجمعوا على أن ورثته من الكفار لا يرثونه ، سوى عمر بن عبد العزيز فإنه قال : يرثونه .\n                                    ",
        "saadi": "يَسۡ‍َٔلُونَكَ عَنِ ٱلشَّهۡرِ ٱلۡحَرَامِ قِتَالٖ فِيهِۖ قُلۡ قِتَالٞ فِيهِ كَبِيرٞۚ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفۡرُۢ بِهِۦ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَإِخۡرَاجُ أَهۡلِهِۦ مِنۡهُ أَكۡبَرُ عِندَ ٱللَّهِۚ وَٱلۡفِتۡنَةُ أَكۡبَرُ مِنَ ٱلۡقَتۡلِۗ وَلَا يَزَالُونَ يُقَٰتِلُونَكُمۡ حَتَّىٰ يَرُدُّوكُمۡ عَن دِينِكُمۡ إِنِ ٱسۡتَطَٰعُواْۚ وَمَن يَرۡتَدِدۡ مِنكُمۡ عَن دِينِهِۦ فَيَمُتۡ وَهُوَ كَافِرٞ فَأُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٧١٢\n                                        \n                                        \n                                        \n                                        الجمهور على أن تحريم القتال في الأشهر الحرم, منسوخ بالأمر بقتال المشركين حيثما وجدوا، وقال بعض المفسرين: إنه لم ينسخ, لأن المطلق محمول على المقيد، وهذه الآية مقيدة لعموم الأمر بالقتال مطلقا؛ ولأن من جملة مزية الأشهر الحرم، بل أكبر مزاياها, تحريم القتال فيها, وهذا إنما هو في قتال الابتداء، وأما قتال الدفع فإنه يجوز في الأشهر الحرم, كما يجوز في البلد الحرام. ولما كانت هذه الآية نازلة بسبب ما حصل, لسرية عبد الله بن جحش, وقتلهم عمرو بن الحضرمي, وأخذهم أموالهم, وكان ذلك - على ما قيل - في شهر رجب، عيرهم المشركون بالقتال بالأشهر الحرم, وكانوا في تعييرهم ظالمين, إذ فيهم من القبائح ما بعضه أعظم مما عيروا به المسلمين, قال تعالى في بيان ما فيهم: { وَصَدٌّ عَنْ سَبِيلِ اللَّهِ } أي: صد المشركين من يريد الإيمان بالله وبرسوله, وفتنتهم من آمن به, وسعيهم في ردهم عن دينهم, وكفرهم الحاصل في الشهر الحرام, والبلد الحرام, الذي هو بمجرده, كاف في الشر، فكيف وقد كان في شهر حرام وبلد حرام؟! { وَإِخْرَاجُ أَهْلِهِ } أي: أهل المسجد الحرام, وهم النبي صلى الله عليه وسلم وأصحابه, لأنهم أحق به من المشركين, وهم عماره على الحقيقة, فأخرجوهم { مِنْهُ } ولم يمكنوهم من الوصول إليه, مع أن هذا البيت سواء العاكف فيه والباد، فهذه الأمور كل واحد منها { أَكْبَرُ مِنَ الْقَتْلِ } في الشهر الحرام, فكيف وقد اجتمعت فيهم؟! فعلم أنهم فسقة ظلمة, في تعييرهم المؤمنين. ثم أخبر تعالى أنهم لن يزالوا يقاتلون المؤمنين، وليس غرضهم في أموالهم وقتلهم, وإنما غرضهم أن يرجعوهم عن دينهم, ويكونوا كفارا بعد إيمانهم حتى يكونوا من أصحاب السعير، فهم باذلون قدرتهم في ذلك, ساعون بما أمكنهم, { ويأبى الله إلا أن يتم نوره ولو كره الكافرون } وهذا الوصف عام لكل الكفار, لا يزالون يقاتلون غيرهم, حتى يردوهم عن دينهم، وخصوصا, أهل الكتاب, من اليهود والنصارى, الذين بذلوا الجمعيات, ونشروا الدعاة, وبثوا الأطباء, وبنوا المدارس, لجذب الأمم إلى دينهم, وتدخيلهم عليهم, كل ما يمكنهم من الشبه, التي تشككهم في دينهم. ولكن المرجو من الله تعالى, الذي مَنّ على المؤمنين بالإسلام, واختار لهم دينه القيم, وأكمل لهم دينه، أن يتم عليهم نعمته بالقيام به أتم القيام, وأن يخذل كل من أراد أن يطفئ نوره, ويجعل كيدهم في نحورهم, وينصر دينه, ويعلي كلمته. وتكون هذه الآية صادقة على هؤلاء الموجودين من الكفار, كما صدقت على من قبلهم: { إِنَّ الَّذِينَ كَفَرُوا يُنْفِقُونَ أَمْوَالَهُمْ لِيَصُدُّوا عَنْ سَبِيلِ اللَّهِ فَسَيُنْفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ وَالَّذِينَ كَفَرُوا إِلَى جَهَنَّمَ يُحْشَرُونَ } ثم أخبر تعالى أن من ارتد عن الإسلام, بأن اختار عليه الكفر واستمر على ذلك حتى مات كافرا، { فَأُولَئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ } لعدم وجود شرطها وهو الإسلام، { وَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ } ودلت الآية بمفهومها, أن من ارتد ثم عاد إلى الإسلام, أنه يرجع إليه عمله الذي قبل ردته، وكذلك من تاب من المعاصي, فإنها تعود إليه أعماله المتقدمة.\n                                    "
      },
      "originalText": "يَسۡ‍َٔلُونَكَ عَنِ ٱلشَّهۡرِ ٱلۡحَرَامِ قِتَالٖ فِيهِۖ قُلۡ قِتَالٞ فِيهِ كَبِيرٞۚ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفۡرُۢ بِهِۦ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَإِخۡرَاجُ أَهۡلِهِۦ مِنۡهُ أَكۡبَرُ عِندَ ٱللَّهِۚ وَٱلۡفِتۡنَةُ أَكۡبَرُ مِنَ ٱلۡقَتۡلِۗ وَلَا يَزَالُونَ يُقَٰتِلُونَكُمۡ حَتَّىٰ يَرُدُّوكُمۡ عَن دِينِكُمۡ إِنِ ٱسۡتَطَٰعُواْۚ وَمَن يَرۡتَدِدۡ مِنكُمۡ عَن دِينِهِۦ فَيَمُتۡ وَهُوَ كَافِرٞ فَأُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٧١٢"
    },
    {
      "number": 225,
      "text": "إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ أُولَٰئِكَ يَرْجُونَ رَحْمَتَ اللَّهِ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 218,
      "juz": 2,
      "manzil": 1,
      "page": 34,
      "ruku": 28,
      "hizbQuarter": 13,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ أُوْلَٰٓئِكَ يَرۡجُونَ رَحۡمَتَ ٱللَّهِۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٨١٢\n                                    \n                                    \n                                    قال ابن إسحاق : فلما تجلى عن عبد الله بن جحش وأصحابه ما كانوا فيه حين نزل القرآن ، طمعوا في الأجر ، فقالوا : يا رسول الله ، أنطمع أن تكون لنا غزوة نعطى فيها أجر المجاهدين [ المهاجرين ] ؟ فأنزل الله عز وجل :\n( إن الذين آمنوا والذين هاجروا وجاهدوا في سبيل الله أولئك يرجون رحمة الله والله غفور رحيم ) فوضعهم الله من ذلك على أعظم الرجاء .\nقال ابن إسحاق : والحديث في هذا عن الزهري ، ويزيد بن رومان ، عن عروة .\nوقد روى يونس بن بكير ، عن محمد بن إسحاق ، عن يزيد بن رومان ، عن عروة بن الزبير قريبا من هذا السياق . وروى موسى بن عقبة عن الزهري نفسه ، نحو ذلك .\nوروى شعيب بن أبي حمزة ، عن الزهري ، عن عروة بن الزبير نحوا من هذا أيضا ، وفيه : فكان ابن الحضرمي أول قتيل قتل بين المسلمين والمشركين ، فركب وفد من كفار قريش حتى قدموا على رسول الله صلى الله عليه وسلم بالمدينة فقالوا : أيحل القتال في الشهر الحرام ؟ فأنزل الله : ( يسألونك عن الشهر الحرام [ قتال فيه ] ) الآية . وقد استقصى ذلك الحافظ أبو بكر البيهقي في كتاب \" دلائل النبوة \" .\nثم قال ابن هشام عن زياد ، عن ابن إسحاق : وقد ذكر عن بعض آل عبد الله [ بن جحش ] أن الله قسم الفيء حين أحله ، فجعل أربعة أخماس لمن أفاءه ، وخمسا إلى الله ورسوله . فوقع على ما كان عبد الله بن جحش صنع في تلك العير .\nقال ابن هشام : وهي أول غنيمة غنمها المسلمون . وعمرو بن الحضرمي أول من قتل المسلمون ، وعثمان بن عبد الله ، والحكم بن كيسان أول من أسر المسلمون .\nقال ابن إسحاق : فقال أبو بكر الصديق ، رضي الله عنه ، في غزوة عبد الله بن جحش ، ويقال : بل عبد الله بن جحش قالها ، حين قالت قريش : قد أحل محمد وأصحابه الشهر الحرام ، فسفكوا فيه الدم ، وأخذوا فيه المال ، وأسروا فيه الرجال . قال ابن هشام : هي لعبد الله بن جحش :\nتعدون قتلا في الحرام عظيمة وأعظم منه لو يرى الرشد راشد صدودكم عما يقول محمد\nوكفر به والله راء وشاهد وإخراجكم من مسجد الله أهله\nلئلا يرى لله في البيت ساجد فإنا وإن عيرتمونا بقتله\nوأرجف بالإسلام باغ وحاسد سقينا من ابن الحضرمي رماحنا\nبنخلة لما أوقد الحرب واقد دما وابن عبد الله عثمان بيننا\nينازعه غل من القد عاند\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ أُوْلَٰٓئِكَ يَرۡجُونَ رَحۡمَتَ ٱللَّهِۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٨١٢\n                                    \n                                    \n                                    قوله تعالى : إن الذين آمنوا والذين هاجروا الآية . قال جندب بن عبد الله وعروة بن الزبير وغيرهما : لما قتل واقد بن عبد الله التميمي عمرو بن الحضرمي في الشهر الحرام توقف رسول الله صلى الله عليه وسلم عن أخذ خمسه الذي وفق في فرضه له عبد الله بن جحش وفي الأسيرين ، فعنف المسلمون عبد الله بن جحش وأصحابه حتى شق ذلك عليهم ، فتلافاهم الله عز وجل بهذه الآية في الشهر الحرام وفرج عنهم ، وأخبر أن لهم ثواب من هاجر وغزا ، فالإشارة إليهم في قوله : \" إن الذين آمنوا \" ثم هي باقية في كل من فعل ما ذكره الله عز وجل . وقيل : إن لم يكونوا أصابوا وزرا فليس لهم أجر ، فأنزل الله : إن الذين آمنوا والذين هاجروا إلى آخر الآية .\nوالهجرة معناها الانتقال من موضع إلى موضع ، وقصد ترك الأول إيثارا للثاني . والهجر ضد الوصل . وقد هجره هجرا وهجرانا ، والاسم الهجرة . والمهاجرة من أرض إلى أرض ترك الأولى للثانية . والتهاجر التقاطع . ومن قال : المهاجرة الانتقال من البادية إلى الحاضرة فقد أوهم ، بسبب أن ذلك كان الأغلب في العرب ، وليس أهل مكة مهاجرين على قوله . وجاهد مفاعلة من جهد إذا استخرج الجهد ، مجاهدة وجهادا . والاجتهاد والتجاهد : بذل الوسع والمجهود . والجهاد ( بالفتح ) : الأرض الصلبة . و \" يرجون \" معناه يطمعون ويستقربون . وإنما قال \" يرجون \" وقد مدحهم لأنه لا يعلم أحد في هذه الدنيا أنه صائر إلى الجنة ولو بلغ في طاعة الله كل مبلغ ، لأمرين : أحدهما : لا يدري بما يختم له . والثاني : لئلا يتكل على عمله ، والرجاء ينعم ، والرجاء أبدا معه خوف ولابد ، كما أن الخوف معه رجاء . والرجاء من الأمل ممدود ، يقال : رجوت فلانا رجوا ورجاء ورجاوة ، يقال : ما أتيتك إلا رجاوة الخير . وترجيته وارتجيته ورجيته وكله بمعنى رجوته ، قال بشر يخاطب بنته :\nفرجي الخير وانتظري إيابي إذا ما القارظ العنزي آبا\nوما لي في فلان رجية ، أي ما أرجو . وقد يكون الرجو والرجاء بمعنى الخوف ، قال الله تعالى : ما لكم لا ترجون لله وقارا ؛ أي لا تخافون عظمة الله ، قال أبو ذؤيب :\nإذا لسعته النحل لم يرج لسعها وخالفها في بيت نوب عوامل\nأي لم يخف ولم يبال . والرجا - مقصور - : ناحية البئر وحافتاها ، وكل ناحية رجا . والعوام من الناس يخطئون في قولهم : يا عظيم الرجا ، فيقصرون ولا يمدون\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ أُوْلَٰٓئِكَ يَرۡجُونَ رَحۡمَتَ ٱللَّهِۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٨١٢\n                                        \n                                        \n                                        \n                                        هذه الأعمال الثلاثة, هي عنوان السعادة وقطب رحى العبودية, وبها يعرف ما مع الإنسان, من الربح والخسران، فأما الإيمان, فلا تسأل عن فضيلته, وكيف تسأل عن شيء هو الفاصل بين أهل السعادة وأهل الشقاوة, وأهل الجنة من أهل النار؟ وهو الذي إذا كان مع العبد, قبلت أعمال الخير منه, وإذا عدم منه لم يقبل له صرف ولا عدل, ولا فرض, ولا نفل. وأما الهجرة: فهي مفارقة المحبوب المألوف, لرضا الله تعالى، فيترك المهاجر وطنه وأمواله, وأهله, وخلانه, تقربا إلى الله ونصرة لدينه. وأما الجهاد: فهو بذل الجهد في مقارعة الأعداء, والسعي التام في نصرة دين الله, وقمع دين الشيطان، وهو ذروة الأعمال الصالحة, وجزاؤه, أفضل الجزاء، وهو السبب الأكبر, لتوسيع دائرة الإسلام وخذلان عباد الأصنام, وأمن المسلمين على أنفسهم وأموالهم وأولادهم. فمن قام بهذه الأعمال الثلاثة على لأوائها ومشقتها كان لغيرها أشد قياما به وتكميلا. فحقيق بهؤلاء أن يكونوا هم الراجون رحمة الله, لأنهم أتوا بالسبب الموجب للرحمة، وفي هذا دليل على أن الرجاء لا يكون إلا بعد القيام بأسباب السعادة، وأما الرجاء المقارن للكسل, وعدم القيام بالأسباب, فهذا عجز وتمن وغرور، وهو دال على ضعف همة صاحبه, ونقص عقله, بمنزلة من يرجو وجود ولد بلا نكاح, ووجود الغلة بلا بذر, وسقي, ونحو ذلك. وفي قوله: { أُولَئِكَ يَرْجُونَ رَحْمَةَ اللَّهِ } إشارة إلى أن العبد ولو أتى من الأعمال بما أتى به لا ينبغي له أن يعتمد عليها, ويعول عليها, بل يرجو رحمة ربه, ويرجو قبول أعماله ومغفرة ذنوبه, وستر عيوبه. ولهذا قال: { وَاللَّهُ غَفُورٌ } أي: لمن تاب توبة نصوحا { رَحِيمٌ } وسعت رحمته كل شيء, وعم جوده وإحسانه كل حي. وفي هذا دليل على أن من قام بهذه الأعمال المذكورة, حصل له مغفرة الله, إذ الحسنات يذهبن السيئات وحصلت له رحمة الله. وإذا حصلت له المغفرة, اندفعت عنه عقوبات الدنيا والآخرة، التي هي آثار الذنوب, التي قد غفرت واضمحلت آثارها، وإذا حصلت له الرحمة, حصل على كل خير في الدنيا والآخرة؛ بل أعمالهم المذكورة من رحمة الله بهم, فلولا توفيقه إياهم, لم يريدوها, ولولا إقدارهم عليها, لم يقدروا عليها, ولولا إحسانه لم يتمها ويقبلها منهم، فله الفضل أولا وآخرا, وهو الذي منّ بالسبب والمسبب.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ أُوْلَٰٓئِكَ يَرۡجُونَ رَحۡمَتَ ٱللَّهِۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٨١٢"
    },
    {
      "number": 226,
      "text": "۞ يَسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ ۖ قُلْ فِيهِمَا إِثْمٌ كَبِيرٌ وَمَنَافِعُ لِلنَّاسِ وَإِثْمُهُمَا أَكْبَرُ مِنْ نَفْعِهِمَا ۗ وَيَسْأَلُونَكَ مَاذَا يُنْفِقُونَ قُلِ الْعَفْوَ ۗ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَتَفَكَّرُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 219,
      "juz": 2,
      "manzil": 1,
      "page": 34,
      "ruku": 28,
      "hizbQuarter": 14,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَسۡ‍َٔلُونَكَ عَنِ ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِۖ قُلۡ فِيهِمَآ إِثۡمٞ كَبِيرٞ وَمَنَٰفِعُ لِلنَّاسِ وَإِثۡمُهُمَآ أَكۡبَرُ مِن نَّفۡعِهِمَاۗ وَيَسۡ‍َٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلِ ٱلۡعَفۡوَۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَتَفَكَّرُونَ ٩١٢\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا خلف بن الوليد ، حدثنا إسرائيل ، عن أبي إسحاق ، عن أبي ميسرة ، عن عمر أنه قال : لما نزل تحريم الخمر قال : اللهم بين لنا في الخمر بيانا شافيا . فنزلت هذه الآية التي في البقرة : ( يسألونك عن الخمر والميسر قل فيهما إثم كبير [ ومنافع للناس ] ) فدعي عمر فقرئت عليه ، فقال : اللهم بين لنا في الخمر بيانا شافيا . فنزلت الآية التي في النساء : ( يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى ) [ النساء : 43 ] ، فكان منادي رسول الله صلى الله عليه وسلم إذا أقام الصلاة نادى : ألا يقربن الصلاة سكران . فدعي عمر فقرئت عليه ، فقال : اللهم بين لنا في الخمر بيانا شافيا . فنزلت الآية التي في المائدة . فدعي عمر ، فقرئت عليه ، فلما بلغ : ( فهل أنتم منتهون ) [ المائدة : 91 ] ؟ قال عمر : انتهينا ، انتهينا .\nوهكذا رواه أبو داود ، والترمذي ، والنسائي من طرق ، عن إسرائيل ، عن أبي إسحاق . وكذا رواه ابن أبي حاتم وابن مردويه من طريق الثوري ، عن أبي إسحاق ، عن أبي ميسرة ، واسمه عمرو بن شرحبيل الهمداني الكوفي ، عن عمر . وليس له عنه سواه ، لكن قال أبو زرعة : لم يسمع منه . والله أعلم . وقال علي بن المديني : هذا الإسناد صالح وصححه الترمذي . وزاد ابن أبي حاتم بعد قوله : انتهينا : إنها تذهب المال وتذهب العقل . وسيأتي هذا الحديث أيضا مع ما رواه أحمد من طريق أبي هريرة أيضا عند قوله في سورة المائدة : ( إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون ) [ المائدة : 90 ] الآيات .\nفقوله : ( يسألونك عن الخمر والميسر ) أما الخمر فكما قال أمير المؤمنين عمر بن الخطاب : إنه كل ما خامر العقل . كما سيأتي بيانه في سورة المائدة ، وكذا الميسر ، وهو القمار .\nوقوله : ( قل فيهما إثم كبير ومنافع للناس ) أما إثمهما فهو في الدين ، وأما المنافع فدنيوية ، من حيث إن فيها نفع البدن ، وتهضيم الطعام ، وإخراج الفضلات ، وتشحيذ بعض الأذهان ، ولذة الشدة المطربة التي فيها ، كما قال حسان بن ثابت في جاهليته :\nونشربها فتتركنا ملوكا وأسدا لا ينهنهها اللقاء\nوكذا بيعها والانتفاع بثمنها . وما كان يقمشه بعضهم من الميسر فينفقه على نفسه أو عياله . ولكن هذه المصالح لا توازي مضرته ومفسدته الراجحة ، لتعلقها بالعقل والدين ، ولهذا قال : ( وإثمهما أكبر من نفعهما ) ; ولهذا كانت هذه الآية ممهدة لتحريم الخمر على البتات ، ولم تكن مصرحة بل معرضة ; ولهذا قال عمر ، رضي الله عنه ، لما قرئت عليه : اللهم بين لنا في الخمر بيانا شافيا ، حتى نزل التصريح بتحريمها في سورة المائدة : ( ياأيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر ويصدكم عن ذكر الله وعن الصلاة فهل أنتم منتهون ) [ المائدة : 90 ، 91 ] وسيأتي الكلام على ذلك في سورة المائدة إن شاء الله ، وبه الثقة .\nقال ابن عمر ، والشعبي ، ومجاهد ، وقتادة ، والربيع بن أنس ، وعبد الرحمن بن زيد بن أسلم : هذه أول آية نزلت في الخمر : ( يسألونك عن الخمر والميسر قل فيهما إثم كبير [ ومنافع للناس ] ) ثم نزلت الآية التي في سورة النساء ، ثم التي في المائدة ، فحرمت الخمر .\nوقوله : ( ويسألونك ماذا ينفقون قل العفو ) قرئ بالنصب وبالرفع وكلاهما حسن متجه قريب .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا موسى بن إسماعيل ، حدثنا أبان ، حدثنا يحيى أنه بلغه : أن معاذ بن جبل وثعلبة أتيا رسول الله صلى الله عليه وسلم فقالا : يا رسول الله ، إن لنا أرقاء وأهلين [ فما ننفق ] من أموالنا . فأنزل الله : ( ويسألونك ماذا ينفقون ) .\nوقال الحكم ، عن مقسم ، عن ابن عباس : ( ويسألونك ماذا ينفقون قل العفو ) قال : ما يفضل عن أهلك .\nوكذا روي عن ابن عمر ، ومجاهد ، وعطاء ، وعكرمة ، وسعيد بن جبير ، ومحمد بن كعب ، والحسن ، وقتادة ، والقاسم ، وسالم ، وعطاء الخراساني ، والربيع بن أنس ، وغير واحد : أنهم قالوا في قوله : ( قل العفو ) يعني الفضل .\nوعن طاوس : اليسير من كل شيء ، وعن الربيع أيضا : أفضل مالك ، وأطيبه .\nوالكل يرجع إلى الفضل .\nوقال عبد بن حميد في تفسيره : حدثنا هوذة بن خليفة ، عن عوف ، عن الحسن : ( ويسألونك ماذا ينفقون قل العفو ) قال : ذلك ألا تجهد مالك ثم تقعد تسأل الناس .\nويدل على ذلك ما رواه ابن جرير : حدثنا علي بن مسلم ، حدثنا أبو عاصم ، عن ابن عجلان ، عن المقبري ، عن أبي هريرة قال : قال رجل : يا رسول الله ، عندي دينار ؟ قال : \" أنفقه على نفسك \" . قال : عندي آخر ؟ قال : \" أنفقه على أهلك \" . قال : عندي آخر ؟ قال : \" أنفقه على ولدك \" . قال : عندي آخر ؟ قال : \" فأنت أبصر \" .\nوقد رواه مسلم في صحيحه . وأخرج مسلم أيضا عن جابر : أن رسول الله صلى الله عليه وسلم قال لرجل : \" ابدأ بنفسك فتصدق عليها ، فإن فضل شيء فلأهلك ، فإن فضل شيء عن أهلك فلذي قرابتك ، فإن فضل عن ذي قرابتك شيء فهكذا وهكذا \" .\nوعنده عن أبي هريرة ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" خير الصدقة ما كان عن ظهر غنى ، واليد العليا خير من اليد السفلى ، وابدأ بمن تعول \" .\nوفي الحديث أيضا : \" ابن آدم ، إنك إن تبذل الفضل خير لك ، وإن تمسكه شر لك ، ولا تلام على كفاف \" .\nثم قد قيل : إنها منسوخة بآية الزكاة ، كما رواه علي بن أبي طلحة ، والعوفي عن ابن عباس ، وقاله عطاء الخراساني والسدي ، وقيل : مبينة بآية الزكاة ، قاله مجاهد وغيره ، وهو أوجه .\n                                    ",
        "qortoby": "يَسۡ‍َٔلُونَكَ عَنِ ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِۖ قُلۡ فِيهِمَآ إِثۡمٞ كَبِيرٞ وَمَنَٰفِعُ لِلنَّاسِ وَإِثۡمُهُمَآ أَكۡبَرُ مِن نَّفۡعِهِمَاۗ وَيَسۡ‍َٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلِ ٱلۡعَفۡوَۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَتَفَكَّرُونَ ٩١٢\n                                    \n                                    \n                                    قوله تعالى : يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس وإثمهما أكبر من نفعهما ويسألونك ماذا ينفقون قل العفو كذلك يبين الله لكم الآيات لعلكم تتفكرون\nقوله تعالى : يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس وإثمهما أكبر من نفعهما فيه تسع مسائل : الأولى : قوله تعالى : يسألونك السائلون هم المؤمنون ، كما تقدم . والخمر مأخوذة من خمر إذا ستر ، ومنه خمار المرأة . وكل شيء غطى شيئا فقد خمره ، ومنه خمروا آنيتكم فالخمر تخمر العقل ، أي تغطيه وتستره ، ومن ذلك الشجر الملتف يقال له : الخمر ( بفتح الميم ) لأنه يغطي ما تحته ويستره ، يقال منه : أخمرت الأرض كثر خمرها ، قال الشاعر :\nألا يا زيد والضحاك سيرا فقد جاوزتما خمر الطريق\nأي سيرا مدلين فقد جاوزتما الوهدة التي يستتر بها الذئب وغيره . وقال العجاج يصف جيشا يمشي برايات وجيوش غير مستخف :\nفي لامع العقبان لا يمشي الخمر يوجه الأرض ويستاق الشجر\nومنه قولهم : دخل في غمار الناس وخمارهم ، أي هو في مكان خاف . فلما كانت الخمر تستر العقل وتغطيه سميت بذلك وقيل : إنما سميت الخمر خمرا لأنها تركت حتى أدركت ، كما يقال : قد اختمر العجين ، أي بلغ إدراكه . وخمر الرأي ، أي ترك حتى يتبين فيه الوجه . وقيل : إنما سميت الخمر خمرا لأنها تخالط العقل ، من المخامرة وهي المخالطة ، ومنه قولهم : دخلت في خمار الناس ، أي اختلطت بهم . فالمعاني الثلاثة متقاربة ، فالخمر تركت وخمرت حتى أدركت ، ثم خالطت العقل ، ثم خمرته ، والأصل الستر .\nوالخمر : ماء العنب الذي غلى أو طبخ ، وما خامر العقل من غيره فهو في حكمه ؛ لأن إجماع العلماء أن القمار كله حرام . وإنما ذكر الميسر من بينه فجعل كله قياسا على الميسر ، والميسر إنما كان قمارا في الجزر خاصة ، فكذلك كل ما كان كالخمر فهو بمنزلتها .\nالثانية : والجمهور من الأمة على أن ما أسكر كثيره من غير خمر العنب فمحرم قليله وكثيره ، والحد في ذلك واجب . وقال أبو حنيفة والثوري وابن أبي ليلى وابن شبرمة وجماعة من فقهاء الكوفة : ما أسكر كثيره من غير خمر العنب فهو حلال ، وإذا سكر منه أحد دون أن يتعمد الوصول إلى حد السكر فلا حد عليه ، وهذا ضعيف يرده النظر والخبر ، على ما يأتي بيانه في \" المائدة والنحل \" إن شاء الله تعالى .\nالثالثة : قال بعض المفسرين : إن الله تعالى لم يدع شيئا من الكرامة والبر إلا أعطاه هذه الأمة ، ومن كرامته وإحسانه أنه لم يوجب عليهم الشرائع دفعة واحدة ، ولكن أوجب عليهم مرة بعد مرة ، فكذلك تحريم الخمر . وهذه الآية أول ما نزل في أمر الخمر ، ثم بعده : لا تقربوا الصلاة وأنتم سكارى ثم قوله : إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر ويصدكم عن ذكر الله وعن الصلاة فهل أنتم منتهون ثم قوله : إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه على ما يأتي بيانه في \" المائدة \" .\nالرابعة : قوله تعالى : والميسر الميسر : قمار العرب بالأزلام . قال ابن عباس : ( كان الرجل في الجاهلية يخاطر الرجل على أهله وماله فأيهما قمر صاحبه ذهب بماله وأهله ) فنزلت الآية . وقال مجاهد ومحمد بن سيرين والحسن وابن المسيب وعطاء وقتادة ومعاوية بن صالح وطاوس وعلي بن أبي طالب رضي الله عنه وابن عباس أيضا : ( كل شيء فيه قمار من نرد وشطرنج فهو الميسر ، حتى لعب الصبيان بالجوز والكعاب ، إلا ما أبيح من الرهان في الخيل والقرعة في إفراز الحقوق ) ، على ما يأتي . وقال مالك : الميسر ميسران : ميسر اللهو ، وميسر القمار ، فمن ميسر اللهو النرد والشطرنج والملاهي كلها . وميسر القمار : ما يتخاطر الناس عليه . قال علي بن أبي طالب : الشطرنج ميسر العجم . وكل ما قومر به فهو ميسر عند مالك وغيره من العلماء . وسيأتي في \" يونس \" زيادة بيان لهذا الباب إن شاء الله تعالى .\nوالميسر مأخوذ من اليسر ، وهو وجوب الشيء لصاحبه ، يقال : يسر لي كذا إذا وجب فهو ييسر يسرا وميسرا . والياسر : اللاعب بالقداح ، وقد يسر ييسر ، قال الشاعر :\nفأعنهم وايسر بما يسروا به وإذا هم نزلوا بضنك فانزل\nوقال الأزهري : الميسر : الجزور الذي كانوا يتقامرون عليه ، سمي ميسرا لأنه يجزأ أجزاء ، فكأنه موضع التجزئة ، وكل شيء جزأته فقد يسرته . والياسر : الجازر ؛ لأنه يجزئ لحم الجزور . قال : وهذا الأصل في الياسر ، ثم يقال للضاربين بالقداح والمتقامرين على الجزور : ياسرون ؛ لأنهم جازرون إذ كانوا سببا لذلك . وفي الصحاح : ويسر القوم الجزور أي اجتزروها واقتسموا أعضاءها . قال سحيم بن وثيل اليربوعي :\nأقول لهم بالشعب إذ ييسرونني ألم تيأسوا أني ابن فارس زهدم\nكان قد وقع عليه سباء فضرب عليه بالسهام . ويقال : يسر القوم إذا قامروا . ورجل يسر وياسر بمعنى . والجمع أيسار ، قال النابغة :\nأني أتمم أيساري وأمنحهم مثنى الأيادي وأكسو الجفنة الأدما\nوقال طرفة :\nوهم أيسار لقمان إذا أغلت الشتوة أبداء الجزر\nوكان من تطوع بنحرها ممدوحا عندهم ، قال الشاعر :\nوناجية نحرت لقوم صدق وما ناديت أيسار الجزاء\nالخامسة : روى مالك في الموطأ عن داود بن حصين أنه سمع سعيد بن المسيب يقول : كان من ميسر أهل الجاهلية بيع اللحم بالشاة والشاتين ، وهذا محمول عند مالك وجمهور أصحابه في الجنس الواحد ، حيوانه بلحمه ، وهو عنده من باب المزابنة والغرر والقمار ؛ لأنه لا يدرى هل في الحيوان مثل اللحم الذي أعطى أو أقل أو أكثر ، وبيع اللحم باللحم لا يجوز متفاضلا ، فكان بيع الحيوان باللحم كبيع اللحم المغيب في جلده إذا كانا من جنس واحد ، والجنس الواحد عنده الإبل والبقر والغنم والظباء والوعول وسائر الوحوش ، وذوات الأربع المأكولات ، كلها عنده جنس واحد ، لا يجوز بيع شيء من حيوان هذا الصنف والجنس كله بشيء واحد من لحمه بوجه من الوجوه ؛ لأنه عنده من باب المزابنة ، كبيع الزبيب بالعنب والزيتون بالزيت والشيرج بالسمسم ، ونحو ذلك . والطير عنده كله جنس واحد ، وكذلك الحيتان من سمك وغيره . وروي عنه أن الجراد وحده صنف . وقال الشافعي وأصحابه والليث بن سعد : لا يجوز بيع اللحم بالحيوان على حال من الأحوال من جنس واحد كان أم من جنسين مختلفين ، على عموم الحديث . وروي عن ابن عباس ( أن جزورا نحرت على عهد أبي بكر الصديق فقسمت على عشرة أجزاء ، فقال رجل : أعطوني جزءا منها بشاة ، فقال أبو بكر : لا يصلح هذا ) . قال الشافعي : ولست أعلم لأبي بكر في ذلك مخالفا من الصحابة . قال أبو عمر : قد روي عن ابن عباس ( أنه أجاز بيع الشاة باللحم ، وليس بالقوي ) . وذكر عبد الرزاق عن الثوري عن يحيى بن سعيد عن سعيد بن المسيب أنه كره أن يباع حي بميت ، يعني الشاة المذبوحة بالقائمة . قال سفيان : ونحن لا نرى به بأسا . قال المزني : إن لم يصح الحديث في بيع الحيوان باللحم فالقياس أنه جائز ، وإن صح بطل القياس واتبع الأثر . قال أبو عمر : وللكوفيين في أنه جائز بيع اللحم بالحيوان حجج كثيرة من جهة القياس والاعتبار ، إلا أنه إذا صح الأثر بطل القياس والنظر . وروى مالك عن زيد بن أسلم عن سعيد بن المسيب أن رسول الله صلى الله عليه وسلم نهى عن بيع الحيوان باللحم . قال أبو عمر : ولا أعلمه يتصل عن النبي صلى الله عليه وسلم من وجه ثابت ، وأحسن أسانيده مرسل سعيد بن المسيب على ما ذكره مالك في موطئه ، وإليه ذهب الشافعي ، وأصله أنه لا يقبل المراسيل إلا أنه زعم أنه افتقد مراسيل سعيد فوجدها أو أكثرها صحاحا . فكره بيع أنواع الحيوان بأنواع اللحوم على ظاهر الحديث وعمومه ؛ لأنه لم يأت أثر يخصه ولا إجماع . ولا يجوز عنده أن يخص النص بالقياس . والحيوان عنده اسم لكل ما يعيش في البر والماء وإن اختلفت أجناسه ، كالطعام الذي هو اسم لكل مأكول أو مشروب ، فاعلم .\nالسادسة : قوله تعالى : قل فيهما يعني الخمر والميسر إثم كبير إثم الخمر ما يصدر عن الشارب من المخاصمة والمشاتمة وقول الفحش والزور ، وزوال العقل الذي يعرف به ما يجب لخالقه ، وتعطيل الصلوات والتعوق عن ذكر الله ، إلى غير ذلك . روى النسائي عن عثمان رضي الله عنه قال : اجتنبوا الخمر فإنها أم الخبائث ، إنه كان رجل ممن كان قبلكم تعبد فعلقته امرأة غوية ، فأرسلت إليه جاريتها فقالت له : إنا ندعوك للشهادة ، فانطلق مع جاريتها فطفقت كلما دخل بابا أغلقته دونه ، حتى أفضى إلى امرأة وضيئة عندها غلام وباطية خمر ، فقالت : إني والله ما دعوتك للشهادة ، ولكن دعوتك لتقع علي ، أو تشرب من هذه الخمر كأسا ، أو تقتل هذا الغلام . قال : فاسقيني من هذه الخمر كأسا ، فسقته كأسا . قال : زيدوني ، فلم يرم حتى وقع عليها ، وقتل النفس ، فاجتنبوا الخمر ، فإنها والله لا يجتمع الإيمان وإدمان الخمر ، إلا ليوشك أن يخرج أحدهما صاحبه ، وذكره أبو عمر في الاستيعاب . وروي أن الأعشى لما توجه إلى المدينة ليسلم فلقيه بعض المشركين في الطريق فقالوا له : أين تذهب ؟ فأخبرهم بأنه يريد محمدا صلى الله عليه وسلم ، فقالوا : لا تصل إليه ، فإنه يأمرك بالصلاة ، فقال : إن خدمة الرب واجبة . فقالوا : إنه يأمرك بإعطاء المال إلى الفقراء . فقال : اصطناع المعروف واجب . فقيل له : إنه ينهى عن الزنى . فقال : هو فحش وقبيح في العقل ، وقد صرت شيخا فلا أحتاج إليه . فقيل له : إنه ينهى عن شرب الخمر . فقال : أما هذا فإني لا أصبر عليه! فرجع ، وقال : أشرب الخمر سنة ثم أرجع إليه ، فلم يصل إلى منزله حتى سقط عن البعير فانكسرت عنقه فمات . وكان قيس بن عاصم المنقري شرابا لها في الجاهلية ثم حرمها على نفسه ، وكان سبب ذلك أنه غمز عكنة ابنته وهو سكران ، وسب أبويه ، ورأى القمر فتكلم بشيء ، وأعطى الخمار كثيرا من ماله ، فلما أفاق أخبر بذلك فحرمها على نفسه ، وفيها يقول :\nرأيت الخمر صالحة وفيها خصال تفسد الرجل الحليما\nفلا والله أشربها صحيحا ولا أشفى بها أبدا سقيما\nولا أعطي بها ثمنا حياتي ولا أدعو لها أبدا نديما\nفإن الخمر تفضح شاربيها وتجنيهم بها الأمر العظيما\nقال أبو عمر : وروى ابن الأعرابي عن المفضل الضبي أن هذه الأبيات لأبي محجن الثقفي قالها في تركه الخمر ، وهو القائل رضي الله عنه :\nإذا مت فادفني إلى جنب كرمة تروي عظامي بعد موتي عروقها\nولا تدفنني بالفلاة فإنني أخاف إذا ما مت أن لا أذوقها\nوجلده عمر الحد عليها مرارا ، ونفاه إلى جزيرة في البحر ، فلحق بسعد فكتب إليه عمر أن يحبسه ، فحبسه ، وكان أحد الشجعان البهم ، فلما كان من أمره في حرب القادسية ما هو معروف حل قيوده وقال : لا نجلدك على الخمر أبدا . قال أبو محجن : وأنا والله لا أشربها أبدا ، فلم يشربها بعد ذلك . وفي رواية : قد كنت أشربها إذ يقام علي الحد وأطهر منها ، وأما إذا بهرجتني فوالله لا أشربها أبدا . وذكر الهيثم بن عدي أنه أخبره من رأى قبر أبي محجن بأذربيجان ، أو قال : في نواحي جرجان ، وقد نبتت عليه ثلاث أصول كرم وقد طالت وأثمرت ، وهي معروشة على قبره ، ومكتوب على القبر \" هذا قبر أبي محجن \" قال : فجعلت أتعجب وأذكر قوله :\nإذا مت فادفني إلى جنب كرمة\nثم إن الشارب يصير ضحكة للعقلاء ، فيلعب ببوله وعذرته ، وربما يمسح وجهه ، حتى رئي بعضهم يمسح وجهه ببوله ويقول : اللهم اجعلني من التوابين واجعلني من المتطهرين ورئي بعضهم والكلب يلحس وجهه وهو يقول له : أكرمك الله . وأما القمار فيورث العداوة والبغضاء ؛ لأنه أكل مال الغير بالباطل .\nالسابعة : قوله تعالى : ومنافع للناس أما في الخمر فربح التجارة ، فإنهم كانوا يجلبونها من الشام برخص فيبيعونها في الحجاز بربح ، وكانوا لا يرون المماسكة فيها ، فيشتري طالب الخمر الخمر بالثمن الغالي . هذا أصح ما قيل في منفعتها ، وقد قيل في منافعها : إنها تهضم الطعام ، وتقوي الضعف ، وتعين على الباه ، وتسخي البخيل ، وتشجع الجبان ، وتصفي اللون ، إلى غير ذلك من اللذة بها . وقد قال حسان بن ثابت رضي الله عنه :\nونشربها فتتركنا ملوكا وأسدا ما ينهنهنا اللقاء\nإلى غير ذلك من أفراحها . وقال آخر :\nفإذا شربت فإنني رب الخورنق والسدير\nوإذا صحوت فإنني رب الشويهة والبعير\nومنفعة الميسر مصير الشيء إلى الإنسان في القمار بغير كد ولا تعب ، فكانوا يشترون الجزور ويضربون بسهامهم ، فمن خرج سهمه أخذ نصيبه من اللحم ولا يكون عليه من الثمن شيء ، ومن بقي سهمه آخرا كان عليه ثمن الجزور كله ولا يكون له من اللحم شيء . وقيل : منفعته التوسعة على المحاويج ، فإن من قمر منهم كان لا يأكل من الجزور وكان يفرقه في المحتاجين .\nوسهام الميسر أحد عشر سهما ، منها سبعة لها حظوظ وفيها فروض على عدد الحظوظ ، وهي : \" الفذ \" وفيه علامة واحدة له نصيب وعليه نصيب إن خاب . الثاني : \" التوأم \" وفيه علامتان وله وعليه نصيبان . الثالث : \" الرقيب \" وفيه ثلاث علامات على ما ذكرنا . الرابع : \" الحلس \" وله أربع . الخامس : \" النافز \" والنافس أيضا وله خمس . السادس : \" المسبل \" وله ست . السابع : \" المعلى \" وله سبع . فذلك ثمانية وعشرون فرضا ، وأنصباء الجزور كذلك في قول الأصمعي . وبقي من السهام أربعة ، وهي الأغفال لا فروض لها ولا أنصباء ، وهي : \" المصدر \" و \" المضعف \" و \" المنيح \" و \" السفيح \" . وقيل : الباقية الأغفال الثلاثة : \" السفيح \" و \" المنيح \" و \" الوغد \" تزاد هذه الثلاثة لتكثر السهام على الذي يجيلها فلا يجد إلى الميل مع أحد سبيلا . ويسمى المجيل المفيض والضارب والضريب والجمع الضرباء . وقيل : يجعل خلفه رقيب لئلا يحابي أحدا ، ثم يجثو الضريب على ركبتيه ، ويلتحف بثوب ويخرج رأسه ويدخل يده في الربابة فيخرج . وكانت عادة العرب أن تضرب الجزور بهذه السهام في الشتوة وضيق الوقت وكلب البرد على الفقراء ، يشترى الجزور ويضمن الأيسار ثمنها ويرضى صاحبها من حقه ، وكانوا يفتخرون بذلك ويذمون من لم يفعل ذلك منهم ، ويسمونه \" البرم \" قال متمم بن نويرة :\nولا برما تهدي النساء لعرسه إذا القشع من برد الشتاء تقعقعا\nثم تنحر وتقسم على عشرة أقسام . قال ابن عطية : وأخطأ الأصمعي في قسمة الجزور ، فذكر أنها على قدر حظوظ السهام ثمانية وعشرون قسما ، وليس كذلك ، ثم يضرب على العشرة فمن فاز سهمه بأن يخرج من الربابة متقدما أخذ أنصباءه وأعطاها الفقراء . والربابة ( بكسر الراء ) : شبيهة بالكنانة تجمع فيها سهام الميسر ، وربما سموا جميع السهام ربابة ، قال أبو ذؤيب يصف الحمار وأتنه :\nوكأنهن ربابة وكأنه يسر يفيض على القداح ويصدع\nوالربابة أيضا : العهد والميثاق ، قال الشاعر ( علقمة بن عبدة ) :\nوكنت امرأ أفضت إليك ربابتي وقبلك ربتني فضعت ربوب\nوفي أحيان ربما تقامروا لأنفسهم ثم يغرم الثمن من لم يفز سهمه ، كما تقدم . ويعيش بهذه السيرة فقراء الحي ، ومنه قول الأعشى :\nالمطعمو الضيف إذا ما شتوا والجاعلو القوت على الياسر\nومنه قول الآخر :\nبأيديهم مقرومة ومغالق يعود بأرزاق العفاة منيحها\nو \" المنيح \" في هذا البيت المستمنح ؛ لأنهم كانوا يستعيرون السهم الذي قد املس وكثر فوزه ، فذلك المنيح الممدوح . وأما المنيح الذي هو أحد الأغفال فذلك إنما يوصف بالكر ، وإياه أراد الأخطل بقوله :\nولقد عطفن على فزارة عطفة كر المنيح وجلن ثم مجالا\nوفي الصحاح : \" والمنيح سهم من سهام الميسر مما لا نصيب له إلا أن يمنح صاحبه شيئا \" . ومن الميسر قول لبيد :\nإذا يسروا لم يورث اليسر بينهم فواحش ينعى ذكرها بالمصايف\nفهذا كله نفع الميسر ، إلا أنه أكل المال بالباطل .\nالثامنة : قوله تعالى : وإثمهما أكبر من نفعهما أعلم الله جل وعز أن الإثم أكبر من النفع ، وأعود بالضرر في الآخرة ، فالإثم الكبير بعد التحريم ، والمنافع قبل التحريم . وقرأ حمزة والكسائي \" كثير \" بالثاء المثلثة ، وحجتهما أن النبي صلى الله عليه وسلم لعن الخمر ولعن معها عشرة : بائعها ومبتاعها والمشتراة له وعاصرها والمعصورة له وساقيها وشاربها وحاملها والمحمولة له وآكل ثمنها . وأيضا فجمع المنافع يحسن معه جمع الآثام . و \" كثير \" بالثاء المثلثة يعطي ذلك . وقرأ باقي القراء وجمهور الناس كبير بالباء الموحدة ، وحجتهم أن الذنب في القمار وشرب الخمر من الكبائر ، فوصفه بالكبير أليق . وأيضا فاتفاقهم على أكبر حجة ل كبير بالباء بواحدة . وأجمعوا على رفض \" أكثر \" بالثاء المثلثة ، إلا في مصحف عبد الله بن مسعود فإن فيه \" قل فيهما إثم كثير \" \" وإثمهما أكثر \" بالثاء مثلثة في الحرفين .\nالتاسعة : قال قوم من أهل النظر : حرمت الخمر بهذه الآية ؛ لأن الله تعالى قد قال : قل إنما حرم ربي الفواحش ما ظهر منها وما بطن والإثم ، فأخبر في هذه الآية أن فيها إثما فهو حرام . قال ابن عطية : ليس هذا النظر بجيد ؛ لأن الإثم الذي فيها هو الحرام ، لا هي بعينها على ما يقتضيه هذا النظر .\nقلت : وقال بعضهم : في هذه الآية ما دل على تحريم الخمر لأنه سماه إثما ، وقد حرم الإثم في آية أخرى ، وهو قوله عز وجل : قل إنما حرم ربي الفواحش ما ظهر منها وما بطن والإثم وقال بعضهم : الإثم أراد به الخمر ، بدليل قول الشاعر :\nشربت الإثم حتى ضل عقلي كذاك الإثم يذهب بالعقول\nقلت : وهذا أيضا ليس بجيد ؛ لأن الله تعالى لم يسم الخمر إثما في هذه الآية ، وإنما قال : قل فيهما إثم كبير ولم يقل : قل هما إثم كبير . وأما آية \" الأعراف \" وبيت الشعر فيأتي الكلام فيهما هناك مبينا ، إن شاء الله تعالى . وقد قال قتادة : إنما في هذه الآية ذم الخمر ، فأما التحريم فيعلم بآية أخرى وهي آية \" المائدة \" وعلى هذا أكثر المفسرين .\nقوله تعالى : ويسألونك ماذا ينفقون قل العفو كذلك يبين الله لكم الآيات لعلكم تتفكرون فيه ثلاث مسائل : الأولى : قوله تعالى : قل العفو قراءة الجمهور بالنصب . وقرأ أبو عمرو وحده بالرفع . واختلف فيه عن ابن كثير . وبالرفع قراءة الحسن وقتادة وابن أبي إسحاق . قال النحاس وغيره : إن جعلت \" ذا \" بمعنى الذي كان الاختيار الرفع ، على معنى : الذي ينفقون هو العفو ، وجاز النصب . وإن جعلت \" ما \" و \" ذا \" شيئا واحدا كان الاختيار النصب ، على معنى : قل ينفقون العفو ، وجاز الرفع . وحكى النحويون : ماذا تعلمت : أنحوا أم شعرا ؟ بالنصب والرفع ، على أنهما جيدان حسنان ، إلا أن التفسير في الآية على النصب .\nالثانية : قال العلماء : لما كان السؤال في الآية المتقدمة في قوله تعالى : ويسألونك ماذا ينفقون سؤالا عن النفقة إلى من تصرف ، كما بيناه ودل عليه الجواب ، والجواب خرج على وفق السؤال ، كان السؤال الثاني في هذه الآية عن قدر الإنفاق ، وهو في شأن عمرو بن الجموح - كما تقدم - فإنه لما نزل قل ما أنفقتم من خير فللوالدين ، قال : كم أنفق ؟ فنزل : قل العفو والعفو : ما سهل وتيسر وفضل ، ولم يشق على القلب إخراجه ، ومنه قول الشاعر :\nخذي العفو مني تستديمي مودتي ولا تنطقي في سورتي حين أغضب\nفالمعنى : أنفقوا ما فضل عن حوائجكم ، ولم تؤذوا فيه أنفسكم فتكونوا عالة ، هذا أولى ما قيل في تأويل الآية ، وهو معنى قول الحسن وقتادة وعطاء والسدي والقرظي محمد بن كعب وابن أبي ليلى وغيرهم ، قالوا : ( العفو ما فضل عن العيال ) ، ونحوه عن ابن عباس وقال مجاهد : صدقة عن ظهر غنى ، وكذا قال عليه السلام : خير الصدقة ما أنفقت عن غنى وفي حديث آخر : خير الصدقة ما كان عن ظهر غنى . وقال قيس بن سعد : هذه الزكاة المفروضة . وقال جمهور العلماء : بل هي نفقات التطوع . وقيل : هي منسوخة . وقال الكلبي : كان الرجل بعد نزول هذه الآية إذا كان له مال من ذهب أو فضة أو زرع أو ضرع نظر إلى ما يكفيه وعياله لنفقة سنة أمسكه وتصدق بسائره ، وإن كان ممن يعمل بيده أمسك ما يكفيه وعياله يوما وتصدق بالباقي ، حتى نزلت آية الزكاة المفروضة فنسخت هذه الآية وكل صدقة أمروا بها . وقال قوم : هي محكمة ، وفي المال حق سوى الزكاة . والظاهر يدل على القول الأول .\nالثالثة : قوله تعالى : كذلك يبين الله لكم الآيات قال المفضل بن سلمة : أي في أمر النفقة . لعلكم تتفكرون في الدنيا والآخرة فتحبسون من أموالكم ما يصلحكم في معاش الدنيا وتنفقون الباقي فيما ينفعكم في العقبى . وقيل : في الكلام تقديم وتأخير ، أي كذلك يبين الله لكم الآيات في أمر الدنيا والآخرة لعلكم تتفكرون في الدنيا وزوالها وفنائها فتزهدون فيها ، وفي إقبال الآخرة وبقائها فترغبون فيها .\n                                    ",
        "saadi": "يَسۡ‍َٔلُونَكَ عَنِ ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِۖ قُلۡ فِيهِمَآ إِثۡمٞ كَبِيرٞ وَمَنَٰفِعُ لِلنَّاسِ وَإِثۡمُهُمَآ أَكۡبَرُ مِن نَّفۡعِهِمَاۗ وَيَسۡ‍َٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلِ ٱلۡعَفۡوَۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَتَفَكَّرُونَ ٩١٢\n                                        \n                                        \n                                        \n                                        أي: يسألك - يا أيها الرسول - المؤمنون عن أحكام الخمر والميسر, وقد كانا مستعملين في الجاهلية وأول الإسلام, فكأنه وقع فيهما إشكال، فلهذا سألوا عن حكمهما، فأمر الله تعالى نبيه, أن يبين لهم منافعهما ومضارهما, ليكون ذلك مقدمة لتحريمهما, وتحتيم تركهما. فأخبر أن إثمهما ومضارهما, وما يصدر منهما من ذهاب العقل والمال, والصد عن ذكر الله, وعن الصلاة, والعداوة, والبغضاء - أكبر مما يظنونه من نفعهما, من كسب المال بالتجارة بالخمر, وتحصيله بالقمار والطرب للنفوس, عند تعاطيهما، وكان هذا البيان زاجرا للنفوس عنهما, لأن العاقل يرجح ما ترجحت مصلحته, ويجتنب ما ترجحت مضرته، ولكن لما كانوا قد ألفوهما, وصعب التحتيم بتركهما أول وهلة, قدم هذه الآية, مقدمة للتحريم, الذي ذكره في قوله: { يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالْأَنْصَابُ وَالْأَزْلَامُ رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ } إلى قوله: { مُنْتَهُونَ } وهذا من لطفه ورحمته وحكمته، ولهذا لما نزلت, قال عمر رضي الله عنه: انتهينا انتهينا. فأما الخمر: فهو كل مسكر خامر العقل وغطاه, من أي نوع كان، وأما الميسر: فهو كل المغالبات التي يكون فيها عوض من الطرفين, من النرد, والشطرنج, وكل مغالبة قولية أو فعلية, بعوض سوى مسابقة الخيل, والإبل, والسهام, فإنها مباحة, لكونها معينة على الجهاد, فلهذا رخص فيها الشارع. { وَيَسْأَلُونَكَ مَاذَا يُنْفِقُونَ قُلِ الْعَفْوَ كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَتَفَكَّرُونَ فِي الدُّنْيَا وَالْآخِرَةِ } وهذا سؤال عن مقدار ما ينفقونه من أموالهم، فيسر الله لهم الأمر, وأمرهم أن ينفقوا العفو, وهو المتيسر من أموالهم, الذي لا تتعلق به حاجتهم وضرورتهم، وهذا يرجع إلى كل أحد بحسبه, من غني وفقير ومتوسط, كل له قدرة على إنفاق ما عفا من ماله, ولو شق تمرة. ولهذا أمر الله رسوله صلى الله عليه وسلم, أن يأخذ العفو من أخلاق الناس وصدقاتهم, ولا يكلفهم ما يشق عليهم. ذلك بأن الله تعالى لم يأمرنا بما أمرنا به حاجة منه لنا, أو تكليفا لنا [بما يشق] بل أمرنا بما فيه سعادتنا, وما يسهل علينا, وما به النفع لنا ولإخواننا فيستحق على ذلك أتم الحمد. ولما بيّن تعالى هذا البيان الشافي, وأطلع العباد على أسرار شرعه قال: { كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ } أي: الدالات على الحق, المحصلات للعلم النافع والفرقان، { لَعَلَّكُمْ تَتَفَكَّرُونَ فِي الدُّنْيَا وَالْآخِرَةِ } أي: لكي تستعملوا أفكاركم في أسرار شرعه, وتعرفوا أن أوامره, فيها مصالح الدنيا والآخرة، وأيضا لكي تتفكروا في الدنيا وسرعة انقضائها, فترفضوها وفي الآخرة وبقائها, وأنها دار الجزاء فتعمروها.\n                                    "
      },
      "originalText": "۞ يَسۡ‍َٔلُونَكَ عَنِ ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِۖ قُلۡ فِيهِمَآ إِثۡمٞ كَبِيرٞ وَمَنَٰفِعُ لِلنَّاسِ وَإِثۡمُهُمَآ أَكۡبَرُ مِن نَّفۡعِهِمَاۗ وَيَسۡ‍َٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلِ ٱلۡعَفۡوَۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَتَفَكَّرُونَ ٩١٢"
    }
  ]
}