{
  "number": 38,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 241,
      "text": "وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ۖ فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَلَا جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِي أَنْفُسِهِنَّ بِالْمَعْرُوفِ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 234,
      "juz": 2,
      "manzil": 1,
      "page": 38,
      "ruku": 31,
      "hizbQuarter": 15,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ يُتَوَفَّوۡنَ مِنكُمۡ وَيَذَرُونَ أَزۡوَٰجٗا يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ أَرۡبَعَةَ أَشۡهُرٖ وَعَشۡرٗاۖ فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا فَعَلۡنَ فِيٓ أَنفُسِهِنَّ بِٱلۡمَعۡرُوفِۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ٤٣٢\n                                    \n                                    \n                                    هذا أمر من الله للنساء اللاتي يتوفى عنهن أزواجهن : أن يعتددن أربعة أشهر وعشر ليال وهذا الحكم يشمل الزوجات المدخول بهن وغير المدخول بهن بالإجماع ، ومستنده في غير المدخول بها عموم الآية الكريمة ، وهذا الحديث الذي رواه الإمام أحمد وأهل السنن وصححه الترمذي : أن ابن مسعود سئل عن رجل تزوج امرأة فمات ولم يدخل بها ، ولم يفرض لها ؟ فترددوا إليه مرارا في ذلك فقال : أقول فيها برأيي ، فإن يكن صوابا فمن الله ، وإن يكن خطأ فمني ومن الشيطان ، والله ورسوله بريئان منه : [ أرى ] لها الصداق كاملا . وفي لفظ : لها صداق مثلها ، لا وكس ، ولا شطط ، وعليها العدة ، ولها الميراث . فقام معقل بن سنان الأشجعي فقال : سمعت رسول الله صلى الله عليه وسلم قضى به في بروع بنت واشق . ففرح عبد الله بذلك فرحا شديدا . وفي رواية : فقام رجال من أشجع ، فقالوا : نشهد أن رسول الله صلى الله عليه وسلم قضى به في بروع بنت واشق .\nولا يخرج من ذلك إلا المتوفى عنها زوجها ، وهي حامل ، فإن عدتها بوضع الحمل ، ولو لم تمكث بعده سوى لحظة ; لعموم قوله : ( وأولات الأحمال أجلهن أن يضعن حملهن ) [ الطلاق : 4 ] . وكان ابن عباس يرى : أن عليها أن تتربص بأبعد الأجلين من الوضع ، أو أربعة أشهر وعشر ، للجمع بين الآيتين ، وهذا مأخذ جيد ومسلك قوي ، لولا ما ثبتت به السنة في حديث سبيعة الأسلمية ، المخرج في الصحيحين من غير وجه : أنه توفي عنها زوجها سعد بن خولة ، وهي حامل ، فلم تنشب أن وضعت حملها بعد وفاته ، وفي رواية : فوضعت حملها بعده بليال ، فلما تعلت من نفاسها تجملت للخطاب ، فدخل عليها أبو السنابل بن بعكك ، فقال لها : ما لي أراك متجملة ؟ لعلك ترجين النكاح . والله ما أنت بناكح حتى يمر عليك أربعة أشهر وعشرا . قالت سبيعة : فلما قال لي ذلك جمعت علي ثيابي حين أمسيت ، فأتيت رسول الله صلى الله عليه وسلم ، فسألته عن ذلك ، فأفتاني بأني قد حللت حين وضعت ، وأمرني بالتزويج إن بدا لي .\nقال أبو عمر بن عبد البر : وقد روي أن ابن عباس رجع إلى حديث سبيعة ، يعني لما احتج عليه به . قال : ويصحح ذلك عنه : أن أصحابه أفتوا بحديث سبيعة ، كما هو قول أهل العلم قاطبة .\nوكذلك يستثنى من ذلك الزوجة إذا كانت أمة ، فإن عدتها على النصف من عدة الحرة ، شهران وخمس ليال ، على قول الجمهور ; لأنها لما كانت على النصف من الحرة في الحد ، فكذلك فلتكن على النصف منها في العدة . ومن العلماء كمحمد بن سيرين وبعض الظاهرية من يسوي بين الزوجات الحرائر والإماء في هذا المقام ; لعموم الآية ، ولأن العدة من باب الأمور الجبلية التي تستوي فيها الخليقة . وقد ذكر سعيد بن المسيب ، وأبو العالية وغيرهما : أن الحكمة في جعل عدة الوفاة أربعة أشهر وعشرا ; لاحتمال اشتمال الرحم على حمل ، فإذا انتظر به هذه المدة ظهر إن كان موجودا ، كما جاء في حديث ابن مسعود الذي في الصحيحين وغيرهما : \" إن خلق أحدكم يجمع في بطن أمه أربعين يوما نطفة ، ثم يكون علقة مثل ذلك ، ثم يكون مضغة مثل ذلك ، ثم يبعث إليه الملك فينفخ فيه الروح \" . فهذه ثلاث أربعينات بأربعة أشهر ، والاحتياط بعشر بعدها لما قد ينقص بعض الشهور ، ثم لظهور الحركة بعد نفخ الروح فيه ، والله أعلم .\nقال سعيد بن أبي عروبة ، عن قتادة : سألت سعيد بن المسيب : ما بال العشرة ؟ قال : فيه ينفخ الروح . وقال الربيع بن أنس : قلت لأبي العالية : لم صارت هذه العشر مع الأشهر الأربعة ؟ قال : لأنه ينفخ فيها الروح . رواهما ابن جرير . ومن هاهنا ذهب الإمام أحمد ، في رواية عنه ، إلى أن عدة أم الولد عدة الحرة هاهنا ; لأنها صارت فراشا كالحرائر ، وللحديث الذي رواه الإمام أحمد ، عن يزيد بن هارون ، عن سعيد بن أبي عروبة ، عن قتادة ، عن رجاء بن حيوة ، عن قبيصة بن ذؤيب ، عن عمرو بن العاص أنه قال : لا تلبسوا علينا سنة نبينا ، عدة أم الولد إذا توفي عنها سيدها أربعة أشهر وعشر ورواه أبو داود ، عن قتيبة ، عن غندر وعن ابن المثنى ، عن عبد الأعلى . وابن ماجه ، عن علي بن محمد ، عن وكيع ثلاثتهم عن سعيد بن أبي عروبة ، عن مطر الوراق ، عن رجاء بن حيوة ، عن قبيصة ، عن عمرو بن العاص ، فذكره .\nوقد روي عن الإمام أحمد أنه أنكر هذا الحديث ، وقيل : إن قبيصة لم يسمع عمرا ، وقد ذهب إلى القول بهذا الحديث طائفة من السلف ، منهم : سعيد بن المسيب ، ومجاهد ، وسعيد بن جبير ، والحسن ، وابن سيرين ، وأبو عياض ، والزهري ، وعمر بن عبد العزيز . وبه كان يأمر يزيد بن عبد الملك بن مروان ، وهو أمير المؤمنين . وبه يقول الأوزاعي ، وإسحاق ابن راهويه ، وأحمد بن حنبل ، في رواية عنه . وقال طاوس وقتادة : عدة أم الولد إذا توفي عنها سيدها نصف عدة الحرة : شهران وخمس ليال . وقال أبو حنيفة وأصحابه ، والثوري ، والحسن بن صالح بن حي : تعتد بثلاث حيض . وهو قول علي ، وابن مسعود ، وعطاء ، وإبراهيم النخعي . وقال مالك ، والشافعي ، وأحمد في المشهور عنه : عدتها حيضة . وبه يقول ابن عمر ، والشعبي ، ومكحول ، والليث ، وأبو عبيد ، وأبو ثور ، والجمهور .\nقال الليث : ولو مات وهي حائض أجزأتها . وقال مالك : فلو كانت ممن لا تحيض فثلاثة أشهر . وقال الشافعي والجمهور : شهر ، وثلاثة أحب إلي . والله أعلم .\nوقوله : ( فإذا بلغن أجلهن فلا جناح عليكم فيما فعلن في أنفسهن بالمعروف والله بما تعملون خبير ) يستفاد من هذا وجوب الإحداد على المتوفى عنها زوجها مدة عدتها ، لما ثبت في الصحيحين ، من غير وجه ، عن أم حبيبة وزينب بنت جحش أمي المؤمنين ، أن رسول الله صلى الله عليه وسلم قال : \" لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ، إلا على زوج أربعة أشهر وعشرا \" . وفي الصحيحين أيضا ، عن أم سلمة : أن امرأة قالت : يا رسول الله ، إن ابنتي توفي عنها زوجها ، وقد اشتكت عينها ، أفنكحلها ؟ فقال : \" لا \" . كل ذلك يقول : \" لا \" مرتين أو ثلاثا . ثم قال : \" إنما هي أربعة أشهر وعشر ، وقد كانت إحداكن في الجاهلية تمكث سنة \" . قالت زينب بنت أم سلمة : كانت المرأة إذا توفي عنها زوجها دخلت حفشا ، ولبست شر ثيابها ، ولم تمس طيبا ولا شيئا ، حتى تمر بها سنة ، ثم تخرج فتعطى بعرة فترمي بها ، ثم تؤتى بدابة حمار أو شاة أو طير فتفتض به فقلما تفتض بشيء إلا مات .\nومن هاهنا ذهب كثير من العلماء إلى أن هذه الآية ناسخة للآية التي بعدها ، وهي قوله : ( والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج ) [ البقرة : 240 ] ، كما قاله ابن عباس وغيره ، وفي هذا نظر كما سيأتي تقريره .\nوالغرض أن الإحداد هو عبارة عن ترك الزينة من الطيب ، ولبس ما يدعوها إلى الأزواج من ثياب وحلي وغير ذلك وهو واجب في عدة الوفاة قولا واحدا ، ولا يجب في عدة الرجعية قولا واحدا ، وهل يجب في عدة البائن ؟ فيه قولان .\nويجب الإحداد على جميع الزوجات المتوفى عنهن أزواجهن ، سواء في ذلك الصغيرة والآيسة والحرة والأمة ، والمسلمة والكافرة ، لعموم الآية . وقال الثوري وأبو حنيفة وأصحابه : لا إحداد على الكافرة . وبه يقول أشهب ، وابن نافع من أصحاب مالك . وحجة قائل هذه المقالة قوله صلى الله عليه وسلم : \" لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ، إلا على زوج أربعة أشهر وعشرا \" : قالوا : فجعله تعبدا . وألحق أبو حنيفة وأصحابه والثوري الصغيرة بها ، لعدم التكليف . وألحق أبو حنيفة وأصحابه الأمة المسلمة لنقصها . ومحل تقرير ذلك كله في كتب الأحكام والفروع ، والله الموفق للصواب .\nوقوله : ( فإذا بلغن أجلهن ) أي : انقضت عدتهن . قاله الضحاك والربيع بن أنس ، ( فلا جناح عليكم ) قال الزهري : أي : على أوليائها ( فيما فعلن ) يعني : النساء اللاتي انقضت عدتهن . قال العوفي عن ابن عباس : إذا طلقت المرأة أو مات عنها زوجها ، فإذا انقضت عدتها فلا جناح عليها أن تتزين وتتصنع وتتعرض للتزويج ، فذلك المعروف . روي عن مقاتل بن حيان نحوه ، وقال ابن جريج عن مجاهد : ( فلا جناح عليكم فيما فعلن في أنفسهن بالمعروف ) قال : هو النكاح الحلال الطيب . وروي عن الحسن ، والزهري ، والسدي نحو ذلك .\n                                    ",
        "qortoby": "وَٱلَّذِينَ يُتَوَفَّوۡنَ مِنكُمۡ وَيَذَرُونَ أَزۡوَٰجٗا يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ أَرۡبَعَةَ أَشۡهُرٖ وَعَشۡرٗاۖ فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا فَعَلۡنَ فِيٓ أَنفُسِهِنَّ بِٱلۡمَعۡرُوفِۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ٤٣٢\n                                    \n                                    \n                                    قوله تعالى : والذين يتوفون منكم ويذرون أزواجا يتربصن بأنفسهن أربعة أشهر وعشرا فإذا بلغن أجلهن فلا جناح عليكم فيما فعلن في أنفسهن بالمعروف والله بما تعملون خبير فيه خمس وعشرون مسألة : الأولى : قوله تعالى : والذين يتوفون منكم لما ذكر عز وجل عدة الطلاق واتصل بذكرها ذكر الإرضاع ، ذكر عدة الوفاة أيضا ، لئلا يتوهم أن عدة الوفاة مثل عدة الطلاق . ( والذين ) أي والرجال الذين يموتون منكم . ويذرون أزواجا أي يتركون أزواجا ، أي ولهم زوجات ، فالزوجات يتربصن ، قال معناه الزجاج واختاره النحاس . وحذف المبتدإ في الكلام كثير ، كقوله تعالى : قل أفأنبئكم بشر من ذلكم النار ؛ أي هو النار . وقال أبو علي الفارسي : تقديره والذين يتوفون منكم ويذرون أزواجا يتربصن بعدهم ، وهو كقولك : السمن منوان بدرهم ، أي منوان منه بدرهم . وقيل : التقدير وأزواج الذين يتوفون منكم يتربصن ، فجاءت العبارة في غاية الإيجاز وحكى المهدوي عن سيبويه أن المعنى : وفيما يتلى عليكم الذين يتوفون . وقال بعض نحاة الكوفة : الخبر عن \" الذين \" متروك ، والقصد الإخبار عن أزواجهم بأنهن يتربصن ، وهذا اللفظ معناه الخبر عن المشروعية في أحد الوجهين كما تقدم .\nالثانية : هذه الآية في عدة المتوفى عنها زوجها ، وظاهرها العموم ومعناها الخصوص . وحكى المهدوي عن بعض العلماء أن الآية تناولت الحوامل ثم نسخ ذلك بقوله وأولات الأحمال أجلهن أن يضعن حملهن . وأكثر العلماء على أن هذه الآية ناسخة لقوله عز وجل : والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج ؛ لأن الناس أقاموا برهة من الإسلام إذا توفي الرجل وخلف امرأته حاملا أوصى لها زوجها بنفقة سنة وبالسكنى ما لم تخرج فتتزوج ، ثم نسخ ذلك بأربعة أشهر وعشر وبالميراث . وقال قوم : ليس في هذا نسخ وإنما هو نقصان من الحول ، كصلاة المسافر لما نقصت من الأربع إلى الاثنتين لم يكن هذا نسخا . وهذا غلط بين ؛ لأنه إذا كان حكمها أن تعتد سنة إذا لم تخرج ، فإن خرجت لم تمنع ، ثم أزيل هذا ولزمتها العدة أربعة أشهر وعشرا ، وهذا هو النسخ ، وليست صلاة المسافر من هذا في شيء . وقد قالت عائشة رضي الله عنها : فرضت الصلاة ركعتين ركعتين ، فزيد في صلاة الحضر وأقرت صلاة السفر بحالها ، وسيأتي .\nالثالثة : عدة الحامل المتوفى عنها زوجها وضع حملها عند جمهور العلماء . وروي عن علي بن أبي طالب وابن عباس أن تمام عدتها آخر الأجلين ، واختاره سحنون من علمائنا . وقد روي هذا عن ابن عباس أنه رجع عن هذا . والحجة لما روي عن علي وابن عباس روم الجمع بين قوله تعالى : والذين يتوفون منكم ويذرون أزواجا يتربصن بأنفسهن أربعة أشهر وعشرا وبين قوله : وأولات الأحمال أجلهن أن يضعن حملهن ، وذلك أنها إذا قعدت أقصى الأجلين فقد عملت بمقتضى الآيتين ، وإن اعتدت بوضع الحمل فقد تركت العمل بآية عدة الوفاة ، والجمع أولى من الترجيح باتفاق أهل الأصول . وهذا نظر حسن لولا ما يعكر عليه من حديث سبيعة الأسلمية وأنها نفست بعد وفاة زوجها بليال ، وأنها ذكرت ذلك لرسول الله صلى الله عليه وسلم فأمرها أن تتزوج ، أخرجه في الصحيح . فبين الحديث أن قوله تعالى : وأولات الأحمال أجلهن أن يضعن حملهن محمول على عمومه في المطلقات والمتوفى عنهن أزواجهن ، وأن عدة الوفاة مختصة بالحائل من الصنفين ، ويعتضد هذا بقول ابن مسعود : ومن شاء باهلته أن آية النساء القصرى نزلت بعد آية عدة الوفاة . قال علماؤنا : وظاهر كلامه أنها ناسخة لها وليس ذلك مراده . والله أعلم . وإنما يعني أنها مخصصة لها ، فإنها أخرجت منها بعض متناولاتها . وكذلك حديث سبيعة متأخر عن عدة الوفاة ؛ لأن قصة سبيعة كانت بعد حجة الوداع ، وزوجها هو سعد بن خولة وهو من بني عامر بن لؤي وهو ممن شهد بدرا ، توفي بمكة حينئذ وهي حامل ، وهو الذي رثى له رسول الله صلى الله عليه وسلم من أن توفي بمكة ، وولدت بعده بنصف شهر . وقال البخاري : بأربعين ليلة . وروى مسلم من حديث عمر بن عبد الله بن الأرقم أن سبيعة سألت رسول الله صلى الله عليه وسلم عن ذلك قالت : فأفتاني بأني قد حللت حين وضعت حملي ، وأمرني بالتزوج إن بدا لي . قال ابن شهاب : ولا أرى بأسا أن تتزوج حين وضعت وإن كانت في دمها ، غير أن زوجها لا يقربها حتى تطهر ، وعلى هذا جمهور العلماء وأئمة الفقهاء . وقال الحسن والشعبي والنخعي وحماد : لا تنكح النفساء ما دامت في دم نفاسها . فاشترطوا شرطين : وضع الحمل ، والطهر من دم النفاس . والحديث حجة عليهم ، ولا حجة لهم في قوله : فلما تعلت من نفاسها تجملت للخطاب كما في صحيح مسلم وأبي داود ؛ لأن ( تعلت ) وإن كان أصله طهرت من دم نفاسها - على ما قاله الخليل - فيحتمل أن يكون المراد به هاهنا تعلت من آلام نفاسها ، أي استقلت من أوجاعها . ولو سلم أن معناه ما قال الخليل فلا حجة فيه ، وإنما الحجة في قوله عليه السلام لسبيعة : قد حللت حين وضعت فأوقع الحل في حين الوضع وعلقه عليه ، ولم يقل إذا انقطع دمك ولا إذا طهرت ، فصح ما قاله الجمهور .\nالرابعة : ولا خلاف بين العلماء على أن أجل كل حامل مطلقة يملك الزوج رجعتها أو لا يملك ، حرة كانت أو أمة أو مدبرة أو مكاتبة أن تضع حملها .\nواختلفوا في أجل الحامل المتوفى عنها كما تقدم ، وقد أجمع الجميع بلا خلاف بينهم أن رجلا لو توفي وترك امرأة حاملا فانقضت أربعة أشهر وعشر أنها لا تحل حتى تلد ، فعلم أن المقصود الولادة .\nالخامسة : قوله تعالى : ( يتربصن ) التربص : التأني والتصبر عن النكاح ، وترك الخروج عن مسكن النكاح وذلك بألا تفارقه ليلا . ولم يذكر الله تعالى السكنى للمتوفى عنها في كتابه كما ذكرها للمطلقة بقوله تعالى : أسكنوهن وليس في لفظ العدة في كتاب الله تعالى ما يدل على الإحداد ، وإنما قال : يتربصن فبينت السنة جميع ذلك . والأحاديث عن النبي صلى الله عليه وسلم متظاهرة بأن التربص في الوفاة إنما هو بإحداد ، وهو الامتناع عن الزينة ولبس المصبوغ الجميل والطيب ونحوه ، وهذا قول جمهور العلماء . وقال الحسن بن أبي الحسن : ليس الإحداد بشيء ، إنما تتربص عن الزوج ، ولها أن تتزين وتتطيب ، وهذا ضعيف لأنه خلاف السنة على ما نبينه إن شاء الله تعالى . وثبت أن النبي صلى الله عليه وسلم قال للفريعة بنت مالك بن سنان وكانت متوفى عنها : امكثي في بيتك حتى يبلغ الكتاب أجله قالت : فاعتددت فيه أربعة أشهر وعشرا ، وهذا حديث ثابت أخرجه مالك عن سعيد بن إسحاق بن كعب بن عجرة ، رواه عنه مالك والثوري ووهيب بن خالد وحماد بن زيد وعيسى بن يونس وعدد كثير وابن عيينة والقطان وشعبة ، وقد رواه مالك عن ابن شهاب وحسبك ، قال الباجي : لم يرو عنه غيره ، وقد أخذ به عثمان بن عفان . قال أبو عمر : وقضى به في اعتداد المتوفى عنها في بيتها ، وهو حديث معروف مشهور عند علماء الحجاز والعراق أن المتوفى عنها زوجها عليها أن تعتد في بيتها ولا تخرج عنه ، وهو قول جماعة فقهاء الأمصار بالحجاز والشام والعراق ومصر . وكان داود يذهب إلى أن المتوفى عنها زوجها ليس عليها أن تعتد في بيتها وتعتد حيث شاءت ؛ لأن السكنى إنما ورد به القرآن في المطلقات ، ومن حجته أن المسألة مسألة خلاف . قالوا : وهذا الحديث إنما ترويه امرأة غير معروفة بحمل العلم ، وإيجاب السكنى إيجاب حكم ، والأحكام لا تجب إلا بنص كتاب الله أو سنة أو إجماع . قال أبو عمر : أما السنة فثابتة بحمد الله ، وأما الإجماع فمستغنى عنه بالسنة ؛ لأن الاختلاف إذا نزل في مسألة كانت الحجة في قول من وافقته السنة ، وبالله التوفيق : وروي عن علي وابن عباس وجابر وعائشة مثل قول داود ، وبه قال جابر بن زيد وعطاء والحسن البصري . قال ابن عباس : إنما قال الله تعالى : يتربصن بأنفسهن أربعة أشهر وعشرا ولم يقل يعتددن في بيوتهن ، ولتعتد حيث شاءت ، وروي عن أبي حنيفة . وذكر عبد الرزاق قال : حدثنا معمر عن الزهري عن عروة قال : خرجت عائشة بأختها أم كلثوم - حين قتل عنها زوجها طلحة بن عبيد الله - إلى مكة في عمرة ، وكانت تفتي المتوفى عنها زوجها بالخروج في عدتها . قال : وحدثنا الثوري عن عبيد الله بن عمر أنه سمع القاسم بن محمد يقول : أبى الناس ذلك عليها . قال : وحدثنا معمر عن الزهري قال : أخذ المترخصون في المتوفى عنها زوجها بقول عائشة ، وأخذ أهل الورع والعزم بقول ابن عمر . وفي الموطأ : أن عمر بن الخطاب كان يرد المتوفى عنهن أزواجهن من البيداء يمنعهن الحج . وهذا من عمر رضي الله عنه اجتهاد ؛ لأنه كان يرى اعتداد المرأة في منزل زوجها المتوفى عنها لازما لها ، وهو مقتضى القرآن والسنة ، فلا يجوز لها أن تخرج في حج ولا عمرة حتى تنقضي عدتها . وقال مالك : ترد ما لم تحرم .\nالسادسة : إذا كان الزوج يملك رقبة المسكن فإن للزوجة العدة فيه ، وعليه أكثر الفقهاء : مالك وأبو حنيفة والشافعي وأحمد وغيرهم لحديث الفريعة . وهل يجوز بيع الدار إذا كانت ملكا للمتوفى وأراد ذلك الورثة ، فالذي عليه جمهور أصحابنا أن ذلك جائز ، ويشترط فيه العدة للمرأة . قال ابن القاسم : لأنها أحق بالسكنى من الغرماء . وقال محمد بن الحكم : البيع فاسد ؛ لأنها قد ترتاب فتمتد عدتها . وجه قول ابن القاسم : أن الغالب السلامة ، والريبة نادرة وذلك لا يؤثر في فساد العقود ، فإن وقع البيع فيه بهذا الشرط فارتابت ، قال مالك في كتاب محمد : هي أحق بالمقام حتى تنقضي الريبة ، وأحب إلينا أن يكون للمشتري الخيار في فسخ البيع أو إمضائه ولا يرجع بشيء ؛ لأنه دخل على العدة المعتادة ، ولو وقع البيع بشرط زوال الريبة كان فاسدا . وقال سحنون : لا حجة للمشتري وإن تمادت الريبة إلى خمس سنين ؛ لأنه دخل على العدة والعدة قد تكون خمس سنين ، ونحو هذا روى أبو زيد عن ابن القاسم .\nالسابعة : فإن كان للزوج السكنى دون الرقبة ، فلها السكنى في مدة العدة ، خلافا لأبي حنيفة والشافعي ، لقوله عليه السلام للفريعة - وقد علم أن زوجها لا يملك رقبة المسكن - : امكثي في بيتك حتى يبلغ الكتاب أجله . لا يقال إن المنزل كان لها ، فلذلك قال لها : ( امكثي في بيتك ) فإن معمرا روى عن الزهري أنها ذكرت للنبي صلى الله عليه وسلم أن زوجها قتل ، وأنه تركها في مسكن ليس لها واستأذنته ، وذكر الحديث . ولنا من جهة المعنى أنه ترك دارا يملك سكناها ملكا لا تبعة عليه فيه ، فلزم أن تعتد الزوجة فيه ، أصل ذلك إذا ملك رقبتها .\nالثامنة : وهذا إذا كان قد أدى الكراء ، وأما إذا كان لم يؤد الكراء فالذي في المدونة : أنه لا سكنى لها في مال الميت وإن كان موسرا ؛ لأن حقها إنما يتعلق بما يملكه من السكنى ملكا تاما ، وما لم ينقد عوضه لم يملكه ملكا تاما ، وإنما ملك العوض الذي بيده ، ولا حق في ذلك للزوجة إلا بالميراث دون السكنى ؛ لأن ذلك مال وليس بسكنى . وروى محمد عن مالك أن الكراء لازم للميت في ماله .\nالتاسعة : قوله صلى الله عليه وسلم للفريعة : امكثي في بيتك حتى يبلغ الكتاب أجله يحتمل أنه أمرها بذلك لما كان زوجها قد أدى كراء المسكن ، أو كان أسكن فيه إلى وفاته ، أو أن أهل المنزل أباحوا لها العدة فيه بكراء أو غير كراء ، أو ما شاء الله تعالى من ذلك مما رأى به أن المقام لازم لها فيه حتى تنقضي عدتها .\nالعاشرة : واختلفوا في المرأة يأتيها نعي زوجها وهي في بيت غير بيت زوجها ، فأمرها بالرجوع إلى مسكنه وقراره مالك بن أنس ، وروي ذلك عن عمر بن عبد العزيز رضي الله عنه . وقال سعيد بن المسيب والنخعي : تعتد حيث أتاها الخبر ، لا تبرح منه حتى تنقضي العدة . قال ابن المنذر : قول مالك صحيح ، إلا أن يكون نقلها الزوج إلى مكان فتلزم ذلك المكان .\nالحادية عشرة : ويجوز لها أن تخرج في حوائجها من وقت انتشار الناس بكرة إلى وقت هدوئهم بعد العتمة ، ولا تبيت إلا في ذلك المنزل . وفي البخاري ومسلم عن أم عطية أن رسول الله صلى الله عليه وسلم قال : لا تحد امرأة على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ، ولا تلبس ثوبا مصبوغا إلا ثوب عصب ، ولا تكتحل ، ولا تمس طيبا إلا إذا طهرت نبذة من قسط أو أظفار . وفي حديث أم حبيبة : لا يحل لامرأة تؤمن بالله واليوم الآخر تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا الحديث . الإحداد : ترك المرأة الزينة كلها من اللباس والطيب والحلي والكحل والخضاب بالحناء ما دامت في عدتها ؛ لأن الزينة داعية إلى الأزواج ، فنهيت عن ذلك قطعا للذرائع ، وحماية لحرمات الله تعالى أن تنتهك ، وليس دهن المرأة رأسها بالزيت والشيرج من الطيب في شيء . يقال : امرأة حاد ومحد . قال الأصمعي : ولم نعرف ( حدت ) . وفاعل ( لا يحل ) المصدر الذي يمكن صياغته من ( تحد ) مع ( أن ) المرادة ، فكأنه قال : الإحداد .\nالثانية عشرة : وصفه عليه السلام المرأة بالإيمان يدل على صحة أحد القولين عندنا في الكتابية المتوفى عنها زوجها أنها لا إحداد عليها ، وهو قول ابن كنانة وابن نافع ، ورواه أشهب عن مالك ، وبه قال أبو حنيفة وابن المنذر ، وروي عن ابن القاسم أن عليها الإحداد كالمسلمة ، وبه قال الليث والشافعي وأبو ثور وعامة أصحابنا ؛ لأنه حكم من أحكام العدة فلزمت الكتابية للمسلم كلزوم المسكن والعدة .\nالثالثة عشرة : وفي قوله عليه السلام : ( فوق ثلاث إلا على زوج ) دليل على تحريم إحداد المسلمات على غير أزواجهن فوق ثلاث ، وإباحة الإحداد عليهم ثلاثا تبدأ بالعدد من الليلة التي تستقبلها إلى آخر ثالثها ، فإن مات حميمها في بقية يوم أو ليلة ألغته وحسبت من الليلة القابلة .\nالرابعة عشرة : هذا الحديث بحكم عمومه يتناول الزوجات كلهن المتوفى عنهن أزواجهن ، فيدخل فيه الإماء والحرائر والكبار والصغار ، وهو مذهب الجمهور من العلماء . وذهب أبو حنيفة إلى أنه لا إحداد على أمة ولا على صغيرة ، حكاه عنه القاضي أبو الوليد الباجي . قال ابن المنذر : أما الأمة الزوجة فهي داخلة في جملة الأزواج وفي عموم الأخبار ، وهو قول مالك والشافعي وأبي ثور وأصحاب الرأي ، ولا أحفظ في ذلك عن أحد خلافا ، ولا أعلمهم يختلفون في الإحداد على أم الولد إذا مات سيدها ؛ لأنها ليست بزوجة ، والأحاديث إنما جاءت في الأزواج . قال الباجي : الصغيرة إذا كانت ممن تعقل الأمر والنهي وتلتزم ما حد لها أمرت بذلك ، وإن كانت لا تدرك شيئا من ذلك لصغرها فروى ابن مزين عن عيسى يجنبها أهلها جميع ما تجتنبه الكبيرة ، وذلك لازم لها . والدليل على وجوب الإحداد على الصغيرة ما روي أن النبي صلى الله عليه وسلم سألته امرأة عن بنت لها توفي عنها زوجها فاشتكت عينها أفتكحلها ؟ فقال النبي صلى الله عليه وسلم ( لا ) مرتين أو ثلاثا ، كل ذلك يقول ( لا ) ولم يسأل عن سنها ، ولو كان الحكم يفترق بالصغر والكبر لسأل عن سنها حتى يبين الحكم ، وتأخير البيان في مثل هذا لا يجوز ، وأيضا فإن كل من لزمتها العدة بالوفاة لزمها الإحداد كالكبيرة .\nالخامسة عشرة : : قال ابن المنذر : ولا أعلم خلافا أن الخضاب داخل في جملة الزينة المنهي عنها . وأجمعوا على أنه لا يجوز لها لباس الثياب المصبغة والمعصفرة ، إلا ما صبغ بالسواد فإنه رخص فيه عروة بن الزبير ومالك والشافعي ، وكرهه الزهري . وقال الزهري : لا تلبس ثوب عصب ، وهو خلاف الحديث . وفي المدونة قال مالك : لا تلبس رقيق عصب اليمن ، ووسع في غليظه . قال ابن القاسم : لأن رقيقه بمنزلة الثياب المصبغة وتلبس رقيق الثياب وغليظه من الحرير والكتان والقطن . قال ابن المنذر : ورخص كل من أحفظ عنه في لباس البياض ، قال القاضي عياض : ذهب الشافعي إلى أن كل صبغ كان زينة لا تمسه الحاد رقيقا كان أو غليظا . ونحوه للقاضي عبد الوهاب قال : كل ما كان من الألوان تتزين به النساء لأزواجهن فلتمتنع منه الحاد . ومنع بعض مشايخنا المتأخرين جيد البياض الذي يتزين به ، وكذلك الرفيع من السواد . وروى ابن المواز عن مالك : لا تلبس حليا وإن كان حديدا ، وفي الجملة أن كل ما تلبسه المرأة على وجه ما يستعمل عليه الحلي من التجمل فلا تلبسه الحاد . ولم ينص أصحابنا على الجواهر واليواقيت والزمرد وهو داخل في معنى الحلي . والله أعلم .\nالسادسة عشرة : وأجمع الناس على وجوب الإحداد على المتوفى عنها زوجها ، إلا الحسن فإنه قال : ليس بواجب ، واحتج بما رواه عبد الله بن شداد بن الهاد عن أسماء بنت عميس قالت : لما أصيب جعفر بن أبي طالب قال لي رسول الله صلى الله عليه وسلم : تسلبي ثلاثا ثم اصنعي ما شئت . قال ابن المنذر : كان الحسن البصري من بين سائر أهل العلم لا يرى الإحداد ، وقال : المطلقة ثلاثا والمتوفى عنها زوجها تكتحلان وتختضبان وتصنعان ما شاءا . وقد ثبتت الأخبار عن النبي صلى الله عليه وسلم بالإحداد ، وليس لأحد بلغته إلا التسليم ، ولعل الحسن لم تبلغه ، أو بلغته فتأولها بحديث أسماء بنت عميس أنها استأذنت النبي صلى الله عليه وسلم أن تحد على جعفر وهى امرأته ، فأذن لها ثلاثة أيام ثم بعث إليها بعد ثلاثة أيام أن تطهري واكتحلي . قال ابن المنذر ، وقد دفع أهل العلم هذا الحديث بوجوه ، وكان أحمد بن حنبل يقول : هذا الشاذ من الحديث لا يؤخذ به ، وقاله إسحاق .\nالسابعة عشرة : ذهب مالك والشافعي إلى أن لا إحداد على مطلقة ، رجعية كانت أو بائنة واحدة أو أكثر ، وهو قول ربيعة وعطاء . وذهب الكوفيون : أبو حنيفة وأصحابه والثوري والحسن بن حي وأبو ثور وأبو عبيد إلى أن المطلقة ثلاثا عليها الإحداد ، وهو قول سعيد بن المسيب وسليمان بن يسار وابن سيرين والحكم بن عيينة . قال الحكم : هو عليها أوكد وأشد منه على المتوفى عنها زوجها ، ومن جهة المعنى أنهما جميعا في عدة يحفظ بها النسب . وقال الشافعي وأحمد وإسحاق : الاحتياط أن تتقي المطلقة الزينة . قال ابن المنذر : وفي قول النبي صلى الله عليه وسلم : لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا دليل على أن المطلقة ثلاثا والمطلق حي لا إحداد عليها .\nالثامنة عشرة : أجمع العلماء على أن من طلق زوجته طلاقا يملك رجعتها ثم توفي قبل انقضاء العدة أن عليها عدة الوفاة وترثه . واختلفوا في عدة المطلقة ثلاثا في المرض ، فقالت طائفة تعتد عدة الطلاق ، هذا قول مالك والشافعي ويعقوب وأبي عبيد وأبي ثور . قال ابن المنذر : وبه نقول ؛ لأن الله تعالى جعل عدة المطلقات الأقراء ، وقد أجمعوا على المطلقة ثلاثا لو ماتت لم يرثها المطلق ، وذلك لأنها غير زوجة ، وإذا كانت غير زوجة فهو غير زوج لها . وقال الثوري : تعتد بأقصى العدتين . وقال النعمان ومحمد : عليها أربعة أشهر وعشر تستكمل في ذلك ثلاث حيض .\nالتاسعة عشرة : واختلفوا في المرأة يبلغها وفاة زوجها أو طلاقه ، فقالت طائفة : العدة في الطلاق والوفاة من يوم يموت أو يطلق ، هذا قول ابن عمر وابن مسعود وابن عباس ، وبه قال مسروق وعطاء وجماعة من التابعين ، وإليه ذهب مالك والشافعي وأحمد وإسحاق وأبو عبيد والثوري وأبو ثور وأصحاب الرأي وابن المنذر . وفيه قول ثان وهو أن عدتها من يوم يبلغها الخبر ، روي هذا القول عن علي ، وبه قال الحسن البصري وقتادة وعطاء الخراساني وجلاس بن عمرو . وقال سعيد بن المسيب وعمر بن عبد العزيز : إن قامت بينة فعدتها من يوم مات أو طلق ، وإن لم تقم بينة فمن يوم يأتيها الخبر ، والصحيح الأول ؛ لأنه تعالى علق العدة بالوفاة أو الطلاق ، ولأنها لو علمت بموته فتركت الإحداد انقضت العدة ، فإذا تركته مع عدم العلم فهو أهون ، ألا ترى أن الصغيرة تنقضي عدتها ولا إحداد عليها . وأيضا فقد أجمع العلماء على أنها لو كانت حاملا لا تعلم طلاق الزوج أو وفاته ثم وضعت حملها أن عدتها منقضية . ولا فرق بين هذه المسألة وبين المسألة المختلف فيها . ووجه من قال بالعدة من يوم يبلغها الخبر ، أن العدة عبادة بترك الزينة وذلك لا يصح إلا بقصد ونية ، والقصد لا يكون إلا بعد العلم . والله أعلم .\nالموفية عشرين : عدة الوفاة تلزم الحرة والأمة والصغيرة والكبيرة والتي لم تبلغ المحيض ، والتي حاضت واليائسة من المحيض والكتابية - دخل بها أو لم يدخل بها إذا كانت غير حامل - وعدة جميعهن إلا الأمة أربعة أشهر وعشرة أيام ، لعموم الآية في قوله تعالى : يتربصن بأنفسهن أربعة أشهر وعشرا . وعدة الأمة المتوفى عنها زوجها شهران وخمس ليال . قال ابن العربي : نصف عدة الحرة إجماعا ، إلا ما يحكى عن الأصم فإنه سوى فيها بين الحرة والأمة وقد سبقه الإجماع ، لكن لصممه لم يسمع . قال الباجي : ولا نعلم في ذلك خلافا إلا ما يروى عن ابن سيرين ، وليس بالثابت عنه أنه قال : عدتها عدة الحرة .\nقلت : قول الأصم صحيح من حيث النظر ، فإن الآيات الواردة في عدة الوفاة والطلاق بالأشهر والأقراء عامة في حق الأمة والحرة ، فعدة الحرة والأمة سواء على هذا النظر ، فإن العمومات لا فصل فيها بين الحرة والأمة ، وكما استوت الأمة والحرة في النكاح فكذلك تستوي معها في العدة . والله أعلم . قال ابن العربي : وروي عن مالك أن الكتابية تعتد بثلاث حيض إذ يبرأ الرحم ، وهذا منه فاسد جدا ؛ لأنه أخرجها من عموم آية الوفاة وهي منها وأدخلها في عموم آية الطلاق وليست منها .\nقلت : وعليه بناء ما في المدونة لا عدة عليها إن كانت غير مدخول بها ؛ لأنه قد علم براءة رحمها ، هذا يقتضي أن تتزوج مسلما أو غيره إثر وفاته ؛ لأنه إذا لم يكن عليها عدة للوفاة ولا استبراء للدخول فقد حلت للزواج .\nالحادية والعشرون : واختلفوا في عدة أم الولد إذا توفي عنها سيدها ، فقالت طائفة : عدتها أربعة أشهر وعشر ، قاله جماعة من التابعين منهم سعيد والزهري والحسن البصري وغيرهم ، وبه قال الأوزاعي وإسحاق . وروى أبو داود والدارقطني عن قبيصة بن ذؤيب عن عمرو بن العاص قال : لا تلبسوا علينا سنة نبينا صلى الله عليه وسلم ، عدة المتوفى عنها زوجها أربعة أشهر وعشر ، يعني في أم الولد ، لفظ أبي داود . وقال الدارقطني : موقوف . وهو الصواب ، وهو مرسل لأن قبيصة لم يسمع من عمرو . قال ابن المنذر : وضعف أحمد وأبو عبيد هذا الحديث . وروي عن علي وابن مسعود أن عدتها ثلاث حيض ، وهو قول عطاء وإبراهيم النخعي وسفيان الثوري وأصحاب الرأي ، قالوا : لأنها عدة تجب في حال الحرية ، فوجب أن تكون عدة كاملة ، أصله عدة الحرة . وقال مالك والشافعي وأحمد وأبو ثور : عدتها حيضة ، وهو قول ابن عمر . وروي عن طاوس أن عدتها نصف عدة الحرة المتوفى عنها ، وبه قال قتادة . قال ابن المنذر : وبقول ابن عمر أقول ؛ لأنه الأقل مما قيل فيه وليس فيه سنة تتبع ولا إجماع يعتمد عليه . وذكر اختلافهم في عدتها في العتق كهو في الوفاة سواء ، إلا أن الأوزاعي جعل عدتها في العتق ثلاث حيض .\nقلت : أصح هذه الأقوال قول مالك ؛ لأن الله سبحانه قال : والمطلقات يتربصن بأنفسهن ثلاثة قروء فشرط في تربص الأقراء أن يكون عن طلاق ، فانتفى بذلك أن يكون عن غيره . وقال : والذين يتوفون منكم ويذرون أزواجا يتربصن بأنفسهن أربعة أشهر وعشرا فعلق وجوب ذلك بكون المتربصة زوجة ، فدل على أن الأمة بخلافها . وأيضا فإن هذه أمة موطوءة بملك اليمين فكان استبراؤها بحيضة ، أصل ذلك الأمة .\nالثانية والعشرون : إذا ثبت هذا فهل عدة أم الولد استبراء محض أو عدة ، فالذي ذكره أبو محمد في معونته أن الحيضة استبراء وليست بعدة . وفي المدونة أن أم الولد عليها العدة ، وأن عدتها حيضة كعدة الحرة ثلاث حيض . وفائدة الخلاف أنا إذا قلنا هي عدة فقد قال مالك : لا أحب أن تواعد أحدا ينكحها حتى تحيض حيضة . قال ابن القاسم : وبلغني عنه أنه قال : لا تبيت إلا في بيتها ، فأثبت لمدة استبرائها حكم العدة .\nالثالثة والعشرون : أجمع أهل العلم على أن نفقة المطلقة ثلاثا أو مطلقة للزوج عليها رجعة وهي حامل واجبة ، لقوله تعالى : وإن كن أولات حمل فأنفقوا عليهن حتى يضعن حملهن .\nواختلفوا في وجوب نفقة الحامل المتوفى عنها زوجها ، فقالت طائفة : لا نفقة لها ، كذلك قال جابر بن عبد الله وابن عباس وسعيد بن المسيب وعطاء والحسن وعكرمة وعبد الملك بن يعلى ويحيى الأنصاري وربيعة ومالك وأحمد وإسحاق ، وحكى أبو عبيد ذلك عن أصحاب الرأي . وفيه قول ثان وهو أن لها النفقة من جميع المال ، وروي هذا القول عن علي وعبد الله وبه قال ابن عمر وشريح وابن سيرين والشعبي وأبو العالية والنخعي وجلاس بن عمرو وحماد بن أبي سليمان وأيوب السختياني وسفيان الثوري وأبو عبيد . قال ابن المنذر : وبالقول الأول أقول ؛ لأنهم أجمعوا على أن نفقة كل من كان يجبر على نفقته وهو حي مثل أولاده الأطفال وزوجته ووالديه تسقط عنه ، فكذلك تسقط عنه نفقة الحامل من أزواجه . وقال القاضي أبو محمد : لأن نفقة الحمل ليست بدين ثابت فتتعلق بماله بعد موته ، بدليل أنها تسقط عنه بالإعسار فبأن تسقط بالموت أولى وأحرى .\nالرابعة والعشرون : قوله تعالى : أربعة أشهر وعشرا اختلف العلماء في الأربعة الأشهر والعشر التي جعلها الله ميقاتا لعدة المتوفى عنها زوجها ، هل تحتاج فيها إلى حيضة أم لا ، فقال بعضهم : لا تبرأ إذا كانت ممن توطأ إلا بحيضة تأتي بها في الأربعة الأشهر والعشر ، وإلا فهي مسترابة . وقال آخرون : ليس عليها أكثر من أربعة أشهر وعشر ، إلا أن تستريب نفسها ريبة بينة ؛ لأن هذه المدة لا بد فيها من الحيض في الأغلب من أمر النساء إلا أن تكون المرأة ممن لا تحيض أو ممن عرفت من نفسها أو عرف منها أن حيضتها لا تأتيها إلا في أكثر من هذه المدة .\nالخامسة والعشرون : قوله تعالى : وعشرا روى وكيع عن أبي جعفر الرازي عن الربيع بن أنس عن أبي العالية أنه سئل : لم ضمت العشر إلى الأربعة الأشهر ؟ قال : لأن الروح تنفخ فيها ، وسيأتي في الحج بيان هذا إن شاء الله تعالى . وقال الأصمعي : ويقال إن ولد كل حامل يرتكض في نصف حملها فهي مركض . وقال غيره : أركضت فهي مركضة وأنشد : ( للشاعر أوس بن علفاء الهجيمي ) :\nومركضة صريحي أبوها تهان لها الغلامة والغلام\nوقال الخطابي : قوله وعشرا يريد - والله أعلم - الأيام بلياليها . وقال المبرد : إنما أنث العشر لأن المراد به المدة . المعنى وعشر مدد ، كل مدة من يوم وليلة ، فالليلة مع يومها مدة معلومة من الدهر . وقيل : لم يقل عشرة تغليبا لحكم الليالي إذ الليلة أسبق من اليوم والأيام في ضمنها . ( وعشرا ) أخف في اللفظ ، فتغلب الليالي على الأيام إذا اجتمعت في التاريخ ؛ لأن ابتداء الشهور بالليل عند الاستهلال ، فلما كان أول الشهر الليلة غلب الليلة ، تقول : صمنا خمسا من الشهر ، فتغلب الليالي وإن كان الصوم بالنهار . وذهب مالك والشافعي والكوفيون إلى أن المراد بها الأيام والليالي . قال ابن المنذر : فلو عقد عاقد عليها النكاح على هذا القول وقد مضت أربعة أشهر وعشر ليال كان باطلا حتى يمضي اليوم العاشر . وذهب بعض الفقهاء إلى أنه إذا انقضى لها أربعة أشهر وعشر ليال حلت للأزواج ، وذلك لأنه رأى العدة مبهمة فغلب التأنيث وتأولها على الليالي . وإلى هذا ذهب الأوزاعي من الفقهاء وأبو بكر الأصم من المتكلمين . وروي عن ابن عباس أنه قرأ \" أربعة أشهر وعشر ليال \" .\nقوله تعالى : فإذا بلغن أجلهن فلا جناح عليكم فيما فعلن في أنفسهن بالمعروف والله بما تعملون خبير فيه ثلاث مسائل : الأولى : أضاف تعالى الأجل إليهن إذ هو محدود مضروب في أمرهن ، وهو عبارة عن انقضاء العدة .\nالثانية : قوله تعالى : فلا جناح عليكم خطاب لجميع الناس ، والتلبس بهذا الحكم هو للحكام والأولياء . فيما فعلن يريد به التزوج فما دونه من التزين واطراح الإحداد . ( بالمعروف ) أي بما أذن فيه الشرع من اختيار أعيان الأزواج وتقدير الصداق دون مباشرة العقد ؛ لأنه حق للأولياء كما تقدم .\nالثالثة : وفي هذه الآية دليل على أن للأولياء منعهن من التبرج والتشوف للزوج في زمان العدة . وفيها رد على إسحاق في قوله : إن المطلقة إذا طعنت في الحيضة الثالثة بانت وانقطعت رجعة الزوج الأول ، إلا أنه لا يحل لها أن تتزوج حتى تغتسل . وعن شريك أن لزوجها الرجعة ما لم تغتسل ولو بعد عشرين سنة ، قال الله تعالى : فإذا بلغن أجلهن فلا جناح عليكم فيما فعلن في أنفسهن وبلوغ الأجل هنا انقضاء العدة بدخولها في الدم من الحيضة الثالثة ولم يذكر غسلا ، فإذا انقضت عدتها حلت للأزواج ولا جناح عليها فيما فعلت من ذلك . والحديث عن ابن عباس لو صح يحتمل أن يكون منه على الاستحباب ، والله أعلم .\n                                    ",
        "saadi": "وَٱلَّذِينَ يُتَوَفَّوۡنَ مِنكُمۡ وَيَذَرُونَ أَزۡوَٰجٗا يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ أَرۡبَعَةَ أَشۡهُرٖ وَعَشۡرٗاۖ فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا فَعَلۡنَ فِيٓ أَنفُسِهِنَّ بِٱلۡمَعۡرُوفِۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ٤٣٢\n                                        \n                                        \n                                        \n                                        أي: إذا توفي الزوج, مكثت زوجته, متربصة أربعة أشهر وعشرة أيام وجوبا، والحكمة في ذلك, ليتبين الحمل في مدة الأربعة, ويتحرك في ابتدائه في الشهر الخامس، وهذا العام مخصوص بالحوامل, فإن عدتهن بوضع الحمل، وكذلك الأمة, عدتها على النصف من عدة الحرة, شهران وخمسة أيام. وقوله: { فَإِذَا بَلَغْنَ أَجَلَهُنَّ } أي: انقضت عدتهن { فَلَا جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِي أَنْفُسِهِنَّ } أي: من مراجعتها للزينة والطيب، { بِالْمَعْرُوفِ } أي: على وجه غير محرم ولا مكروه. وفي هذا وجوب الإحداد مدة العدة, على المتوفى عنها زوجها, دون غيرها من المطلقات والمفارقات, وهو مجمع عليه بين العلماء. { وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ } أي: عالم بأعمالكم, ظاهرها وباطنها, جليلها وخفيها, فمجازيكم عليها. وفي خطابه للأولياء بقوله: { فَلَا جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِي أَنْفُسِهِنَّ } دليل على أن الولي ينظر على المرأة, ويمنعها مما لا يجوز فعله ويجبرها على ما يجب, وأنه مخاطب بذلك, واجب عليه.\n                                    "
      },
      "originalText": "وَٱلَّذِينَ يُتَوَفَّوۡنَ مِنكُمۡ وَيَذَرُونَ أَزۡوَٰجٗا يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ أَرۡبَعَةَ أَشۡهُرٖ وَعَشۡرٗاۖ فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا فَعَلۡنَ فِيٓ أَنفُسِهِنَّ بِٱلۡمَعۡرُوفِۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ٤٣٢"
    },
    {
      "number": 242,
      "text": "وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُمْ بِهِ مِنْ خِطْبَةِ النِّسَاءِ أَوْ أَكْنَنْتُمْ فِي أَنْفُسِكُمْ ۚ عَلِمَ اللَّهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ وَلَٰكِنْ لَا تُوَاعِدُوهُنَّ سِرًّا إِلَّا أَنْ تَقُولُوا قَوْلًا مَعْرُوفًا ۚ وَلَا تَعْزِمُوا عُقْدَةَ النِّكَاحِ حَتَّىٰ يَبْلُغَ الْكِتَابُ أَجَلَهُ ۚ وَاعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ مَا فِي أَنْفُسِكُمْ فَاحْذَرُوهُ ۚ وَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ حَلِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 235,
      "juz": 2,
      "manzil": 1,
      "page": 38,
      "ruku": 31,
      "hizbQuarter": 15,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا عَرَّضۡتُم بِهِۦ مِنۡ خِطۡبَةِ ٱلنِّسَآءِ أَوۡ أَكۡنَنتُمۡ فِيٓ أَنفُسِكُمۡۚ عَلِمَ ٱللَّهُ أَنَّكُمۡ سَتَذۡكُرُونَهُنَّ وَلَٰكِن لَّا تُوَاعِدُوهُنَّ سِرًّا إِلَّآ أَن تَقُولُواْ قَوۡلٗا مَّعۡرُوفٗاۚ وَلَا تَعۡزِمُواْ عُقۡدَةَ ٱلنِّكَاحِ حَتَّىٰ يَبۡلُغَ ٱلۡكِتَٰبُ أَجَلَهُۥۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِيٓ أَنفُسِكُمۡ فَٱحۡذَرُوهُۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ ٥٣٢\n                                    \n                                    \n                                    يقول تعالى : ( ولا جناح عليكم ) أن تعرضوا بخطبة النساء في عدتهن من وفاة أزواجهن من غير تصريح . قال الثوري وشعبة وجرير وغيرهم ، عن منصور ، عن مجاهد ، عن ابن عباس في قوله : ( ولا جناح عليكم فيما عرضتم به من خطبة النساء ) قال : التعريض أن تقول : إني أريد التزويج ، وإني أحب امرأة من أمرها ومن أمرها يعرض لها بالقول بالمعروف وفي رواية : وددت أن الله رزقني امرأة ونحو هذا . ولا ينصب للخطبة . وفي رواية : إني لا أريد أن أتزوج غيرك إن شاء الله ، ولوددت أني وجدت امرأة صالحة ، ولا ينصب لها ما دامت في عدتها . ورواه البخاري تعليقا ، فقال : قال لي طلق بن غنام ، عن زائدة ، عن منصور ، عن مجاهد ، عن ابن عباس : ( ولا جناح عليكم فيما عرضتم به من خطبة النساء ) هو أن يقول : إني أريد التزويج ، وإن النساء لمن حاجتي ، ولوددت أنه تيسر لي امرأة صالحة .\nوهكذا قال مجاهد ، وطاوس ، وعكرمة ، وسعيد بن جبير ، وإبراهيم النخعي ، والشعبي ، والحسن ، وقتادة ، والزهري ، ويزيد بن قسيط ، ومقاتل بن حيان ، والقاسم بن محمد ، وغير واحد من السلف والأئمة في التعريض : أنه يجوز للمتوفى عنها زوجها من غير تصريح لها بالخطبة . وهكذا حكم المطلقة المبتوتة يجوز التعريض لها ، كما قال النبي صلى الله عليه وسلم لفاطمة بنت قيس ، حين طلقها زوجها أبو عمرو بن حفص : آخر ثلاث تطليقات . فأمرها أن تعتد في بيت ابن أم مكتوم ، وقال لها : \" فإذا حللت فآذنيني \" . فلما حلت خطب عليها أسامة بن زيد مولاه ، فزوجها إياه .\nفأما المطلقة الرجعية : فلا خلاف في أنه لا يجوز لغير زوجها التصريح بخطبتها ولا التعريض لها ، والله أعلم .\nوقوله : ( أو أكننتم في أنفسكم ) أي : أضمرتم في أنفسكم خطبتهن وهذا كقوله تعالى : ( وربك يعلم ما تكن صدورهم وما يعلنون ) [ القصص : 69 ] وكقوله : ( وأنا أعلم بما أخفيتم وما أعلنتم ) [ الممتحنة : 1 ] ولهذا قال : ( علم الله أنكم ستذكرونهن ) أي : في أنفسكم ، فرفع الحرج عنكم في ذلك ، ثم قال : ( ولكن لا تواعدوهن سرا ) قال أبو مجلز ، وأبو الشعثاء جابر بن زيد والحسن البصري ، وإبراهيم النخعي وقتادة ، والضحاك ، والربيع بن أنس ، وسليمان التيمي ، ومقاتل بن حيان ، والسدي : يعني الزنا . وهو معنى رواية العوفي عن ابن عباس ، واختاره ابن جرير .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( ولكن لا تواعدوهن سرا ) لا تقل لها : إني عاشق ، وعاهديني ألا تتزوجي غيري ، ونحو هذا . وكذا روي عن سعيد بن جبير ، والشعبي ، وعكرمة ، وأبي الضحى ، والضحاك ، والزهري ، ومجاهد ، والثوري : هو أن يأخذ ميثاقها ألا تتزوج غيره ، وعن مجاهد : هو قول الرجل للمرأة : لا تفوتيني بنفسك ، فإني ناكحك .\nوقال قتادة : هو أن يأخذ عهد المرأة ، وهي في عدتها ألا تنكح غيره ، فنهى الله عن ذلك وقدم فيه ، وأحل الخطبة والقول بالمعروف .\nوقال ابن زيد : ( ولكن لا تواعدوهن سرا ) هو أن يتزوجها في العدة سرا ، فإذا حلت أظهر ذلك .\nوقد يحتمل أن تكون الآية عامة في جميع ذلك ; ولهذا قال : ( إلا أن تقولوا قولا معروفا ) قال ابن عباس ، ومجاهد وسعيد بن جبير ، والسدي ، والثوري ، وابن زيد : يعني به : ما تقدم من إباحة التعريض . كقوله : إني فيك لراغب . ونحو ذلك .\nوقال محمد بن سيرين : قلت لعبيدة : ما معنى قوله : ( إلا أن تقولوا قولا معروفا ) ؟ قال : يقول لوليها : لا تسبقني بها ، يعني : لا تزوجها حتى تعلمني . رواه ابن أبي حاتم .\nوقوله : ( ولا تعزموا عقدة النكاح حتى يبلغ الكتاب أجله ) يعني : ولا تعقدوا العقد بالنكاح حتى تنقضي العدة . قال ابن عباس ، ومجاهد ، والشعبي ، وقتادة ، والربيع بن أنس ، وأبو مالك ، وزيد بن أسلم ، ومقاتل بن حيان ، والزهري ، وعطاء الخراساني ، والسدي ، والثوري ، والضحاك : ( حتى يبلغ الكتاب أجله ) يعني : حتى تنقضي العدة .\nوقد أجمع العلماء على أنه لا يصح العقد في مدة العدة . واختلفوا فيمن تزوج امرأة في عدتها فدخل بها ، فإنه يفرق بينهما ، وهل تحرم عليه أبدا ؟ على قولين : الجمهور على أنها لا تحرم عليه ، بل له أن يخطبها إذا انقضت عدتها . وذهب الإمام مالك إلى أنها تحرم عليه على التأبيد . واحتج في ذلك بما رواه عن ابن شهاب ، وسليمان بن يسار : أن عمر ، رضي الله عنه ، قال : أيما امرأة نكحت في عدتها ، فإن زوجها الذي تزوجها لم يدخل بها ، فرق بينهما ، ثم اعتدت بقية عدتها من زوجها الأول ، ثم كان الآخر خاطبا من الخطاب ، وإن كان دخل بها فرق بينهما ، ثم اعتدت بقية عدتها من الأول ثم اعتدت من الآخر ، ثم لم ينكحها أبدا .\nقالوا : ومأخذ هذا : أن الزوج لما استعجل ما أجل الله ، عوقب بنقيض قصده ، فحرمت عليه على التأبيد ، كالقاتل يحرم الميراث . وقد روى الشافعي هذا الأثر عن مالك . قال البيهقي : وذهب إليه في القديم ورجع عنه في الجديد ، لقول علي : إنها تحل له .\nقلت : ثم هو منقطع عن عمر . وقد روى الثوري ، عن أشعث ، عن الشعبي ، عن مسروق : أن عمر رجع عن ذلك وجعل لها مهرها ، وجعلهما يجتمعان .\nوقوله : ( واعلموا أن الله يعلم ما في أنفسكم فاحذروه ) توعدهم على ما يقع في ضمائرهم من أمور النساء ، وأرشدهم إلى إضمار الخير دون الشر ، ثم لم يؤيسهم من رحمته ، ولم يقنطهم من عائدته ، فقال : ( واعلموا أن الله غفور حليم ) .\n                                    ",
        "qortoby": "وَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا عَرَّضۡتُم بِهِۦ مِنۡ خِطۡبَةِ ٱلنِّسَآءِ أَوۡ أَكۡنَنتُمۡ فِيٓ أَنفُسِكُمۡۚ عَلِمَ ٱللَّهُ أَنَّكُمۡ سَتَذۡكُرُونَهُنَّ وَلَٰكِن لَّا تُوَاعِدُوهُنَّ سِرًّا إِلَّآ أَن تَقُولُواْ قَوۡلٗا مَّعۡرُوفٗاۚ وَلَا تَعۡزِمُواْ عُقۡدَةَ ٱلنِّكَاحِ حَتَّىٰ يَبۡلُغَ ٱلۡكِتَٰبُ أَجَلَهُۥۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِيٓ أَنفُسِكُمۡ فَٱحۡذَرُوهُۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ ٥٣٢\n                                    \n                                    \n                                    قوله تعالى : ولا جناح عليكم فيما عرضتم به من خطبة النساء أو أكننتم في أنفسكم علم الله أنكم ستذكرونهن ولكن لا تواعدوهن سرا إلا أن تقولوا قولا معروفا ولا تعزموا عقدة النكاح حتى يبلغ الكتاب أجله واعلموا أن الله يعلم ما في أنفسكم فاحذروه واعلموا أن الله غفور حليم\nقوله تعالى : ولا جناح عليكم فيما عرضتم به من خطبة النساء إلى قوله : ( معروفا ) فيه تسع مسائل :\nالأولى : قوله تعالى : ( ولا جناح ) أي لا إثم ، والجناح الإثم ، وهو أصح في الشرع وقيل : بل هو الأمر الشاق ، وهو أصح في اللغة ، قال الشماخ :\nإذا تعلو براكبها خليجا تذكر ما لديه من الجناح\nوقوله : عليكم فيما عرضتم المخاطبة لجميع الناس ، والمراد بحكمها هو الرجل الذي في نفسه تزوج معتدة ، أي لا وزر عليكم في التعريض بالخطبة في عدة الوفاة . والتعريض : ضد التصريح ، وهو إفهام المعنى بالشيء المحتمل له ولغيره وهو من عرض الشيء وهو جانبه ، كأنه يحوم به على الشيء ولا يظهره . وقيل ، هو من قولك عرضت الرجل ، أي أهديت إليه تحفة ، وفي الحديث : أن ركبا من المسلمين عرضوا رسول الله صلى الله عليه وسلم وأبا بكر ثيابا بيضاء ، أي أهدوا لهما . فالمعرض بالكلام يوصل إلى صاحبه كلاما يفهم معناه .\nالثانية : قال ابن عطية : أجمعت الأمة على أن الكلام مع المعتدة بما هو نص في تزوجها وتنبيه عليه لا يجوز ، وكذلك أجمعت الأمة على أن الكلام معها بما هو رفث وذكر جماع أو تحريض عليه لا يجوز ، وكذلك ما أشبهه ، وجوز ما عدا ذلك . ومن أعظمه قربا إلى التصريح قول النبي صلى الله عليه وسلم لفاطمة بنت قيس : كوني عند أم شريك ولا تسبقيني بنفسك . ولا يجوز التعريض لخطبة الرجعية إجماعا لأنها كالزوجة . وأما من كانت في عدة البينونة فالصحيح جواز التعريض لخطبتها والله أعلم . وروي في تفسير التعريض ألفاظ كثيرة جماعها يرجع إلى قسمين : الأول : أن يذكرها لوليها يقول له لا تسبقني بها . والثاني : أن يشير بذلك إليها دون واسطة ، فيقول لها : إني أريد التزويج ، أو إنك لجميلة ، إنك لصالحة ، إن الله لسائق إليك خيرا ، إني فيك لراغب ، ومن يرغب عنك ، إنك لنافقة ، وإن حاجتي في النساء ، وإن يقدر الله أمرا يكن . هذا هو تمثيل مالك وابن شهاب . وقال ابن عباس : لا بأس أن يقول : لا تسبقيني بنفسك ، ولا بأس أن يهدي إليها ، وأن يقوم بشغلها في العدة إذا كانت من شأنه ، قاله إبراهيم . وجائز أن يمدح نفسه ويذكر مآثره على وجه التعريض بالزواج ، وقد فعله أبو جعفر محمد بن علي بن حسين ، قالت سكينة بنت حنظلة استأذن علي محمد بن علي ولم تنقض عدتي من مهلك زوجي فقال : قد عرفت قرابتي من رسول الله صلى الله عليه وسلم وقرابتي من علي وموضعي في العرب . قلت غفر الله لك يا أبا جعفر ، إنك رجل يؤخذ عنك ، تخطبني في عدتي ، قال : إنما أخبرتك بقرابتي من رسول الله صلى الله عليه وسلم ومن علي . وقد دخل رسول الله صلى الله عليه وسلم على أم سلمة وهي متأيمة من أبي سلمة فقال : لقد علمت أني رسول الله وخيرته وموضعي في قومي كانت تلك خطبة ، أخرجه الدارقطني . والهدية إلى المعتدة جائزة ، وهى من التعريض ، قاله سحنون وكثير من العلماء وقاله إبراهيم . وكره مجاهد أن يقول لها : لا تسبقيني بنفسك ورآه من المواعدة سرا . قال القاضي أبو محمد بن عطية : وهذا عندي على أن يتأول قول النبي صلى الله عليه وسلم لفاطمة أنه على جهة الرأي لها فيمن يتزوجها لا أنه أرادها لنفسه وإلا فهو خلاف لقول النبي صلى الله عليه وسلم .\nالثالثة : قوله تعالى : من خطبة النساء الخطبة ( بكسر الخاء ) : فعل الخاطب من كلام وقصد واستلطاف بفعل أو قول . يقال : خطبها يخطبها خطبا وخطبة . ورجل خطاب كثير التصرف في الخطبة ، ومنه قول الشاعر :\nبرح بالعينين خطاب الكثب يقول إني خاطب وقد كذب\nوإنما يخطب عسا من حلب\nوالخطيب : الخاطب . والخطيبى : الخطبة ، قال : عدي بن زيد يذكر قصة جذيمة الأبرش لخطبة الزباء :\nلخطيبى التي غدرت وخانت وهن ذوات غائلة لحينا\nوالخطب ، الرجل الذي يخطب المرأة ، ويقال أيضا : هي خطبه وخطبته التي يخطبها . والخطبة فعلة كجلسة وقعدة : والخطبة ( بضم الخاء ) هي الكلام الذي يقال في النكاح وغيره . قال النحاس : والخطبة ما كان لها أول وآخر ، وكذا ما كان على فعلة نحو الأكلة والضغطة .\nالرابعة : قوله تعالى : أو أكننتم في أنفسكم معناه سترتم وأضمرتم من التزوج بها بعد انقضاء عدتها . والإكنان : الستر والإخفاء ، يقال : كننته وأكننته بمعنى واحد . وقيل : كننته أي صنته حتى لا تصيبه آفة وإن لم يكن مستورا ، ومنه بيض مكنون ودر مكنون . وأكننته أسررته وسترته . وقيل : كننت الشيء من الأجرام إذا سترته بثوب أو بيت أو أرض ونحوه . وأكننت الأمر في نفسي . ولم يسمع من العرب كننته في نفسي . ويقال : أكن البيت الإنسان ، ونحو هذا . فرفع الله الجناح عمن أراد تزوج المعتدة مع التعريض ومع الإكنان ، ونهى عن المواعدة التي هي تصريح بالتزويج وبناء عليه واتفاق على وعد . ورخص لعلمه تعالى بغلبة النفوس وطمحها وضعف البشر عن ملكها .\nالخامسة : استدلت الشافعية بهذه الآية على أن التعريض لا يجب فيه حد ، وقالوا : لما رفع الله تعالى الحرج في التعريض في النكاح دل على أن التعريض بالقذف لا يوجب الحد ؛ لأن الله سبحانه لم يجعل التعريض في النكاح مقام التصريح .\nقلنا : هذا ساقط لأن الله سبحانه وتعالى لم يأذن في التصريح بالنكاح في الخطبة ، وأذن في التعريض الذي يفهم منه النكاح ، فهذا دليل على أن التعريض يفهم منه القذف ، والأعراض يجب صيانتها ، وذلك يوجب حد المعرض ، لئلا يتطرق الفسقة إلى أخذ الأعراض بالتعريض الذي يفهم منه ما يفهم بالتصريح .\nالسادسة : قوله تعالى : علم الله أنكم ستذكرونهن أي إما سرا وإما إعلانا في نفوسكم وبألسنتكم ، فرخص في التعريض دون التصريح . الحسن : معناه ستخطبونهن .\nالسابعة : قوله تعالى : ولكن لا تواعدوهن سرا أي على سر فحذف الحرف ؛ لأنه مما يتعدى إلى مفعولين أحدهما بحرف جر .\nواختلف العلماء في معنى قوله تعالى : سرا فقيل ، معناه نكاحا ، أي لا يقل الرجل لهذه المعتدة تزوجيني ، بل يعرض إن أراد ، ولا يأخذ ميثاقها وعهدها ألا تنكح غيره في استسرار وخفية ، هذا قول ابن عباس وابن جبير ومالك وأصحابه والشعبي ومجاهد وعكرمة والسدي وجمهور أهل العلم . \" وسرا \" على هذا التأويل نصب على الحال ، أي مستسرين . وقيل : السر الزنا ، أي لا يكونن منكم مواعدة على الزنا في العدة ثم التزوج بعدها . قال معناه جابر بن زيد وأبو مجلز لاحق بن حميد ، والحسن بن أبي الحسن وقتادة والنخعي والضحاك ، وأن السر في هذه الآية الزنا ، أي لا تواعدوهن زنا ، واختاره الطبري ، ومنه قول الأعشى :\nفلا تقربن جارة إن سرها عليك حرام فانكحن أو تأبدا\nوقال الحطيئة :\nويحرم سر جارتهم عليهم ويأكل جارهم أنف القصاع\nوقيل : السر الجماع ، أي لا تصفوا أنفسكم لهن بكثرة الجماع ترغيبا لهن في النكاح فإن ذكر الجماع مع غير الزوج فحش ، هذا قول الشافعي . وقال امرؤ القيس :\nألا زعمت بسباسة اليوم أنني كبرت وألا يحسن السر أمثالي\nوقال رؤبة :\nفكف عن إسرارها بعد الغسق\nأي كف عن جماعها بعد ملازمته لذلك . وقد يكون السر عقدة النكاح ، سرا كان أو جهرا ، قال الأعشى :\nفلن يطلبوا سرها للغنى ولن يسلموها لإزهادها\nوأراد أن يطلبوا نكاحها لكثرة مالها ، ولن يسلموها لقلة مالها . وقال ابن زيد : معنى قوله ولكن لا تواعدوهن سرا أن لا تنكحوهن وتكتمون ذلك ، فإذا حلت أظهرتموه ودخلتم بهن ، وهذا هو معنى القول الأول ، فابن زيد على هذا قائل بالقول الأول ، وإنما شذ في أن سمى العقد مواعدة ، وذلك قلق . وحكى مكي والثعلبي عنه أنه قال : الآية منسوخة بقوله تعالى : ولا تعزموا عقدة النكاح .\nالثامنة : قال القاضي أبو محمد بن عطية : أجمعت الأمة على كراهة المواعدة في العدة للمرأة في نفسها ، وللأب في ابنته البكر ، وللسيد في أمته . قال ابن المواز : وأما الولي الذي لا يملك الجبر فأكرهه وإن نزل لم أفسخه . وقال مالك رحمه الله فيمن يواعد في العدة ثم يتزوج بعدها : فراقها أحب إلي ، دخل بها أو لم يدخل ، وتكون تطليقة واحدة ، فإذا حلت خطبها مع الخطاب ، هذه رواية ابن وهب . وروى أشهب عن مالك أنه يفرق بينهما إيجابا ، وقاله ابن القاسم . وحكى ابن الحارث مثله عن ابن الماجشون ، وزاد ما يقتضي أن التحريم يتأبد . وقال الشافعي : إن صرح بالخطبة وصرحت له بالإجابة ولم يعقد النكاح حتى تنقضي العدة فالنكاح ثابت والتصريح لهما مكروه لأن النكاح حادث بعد الخطبة ، قاله ابن المنذر .\nالتاسعة : قوله تعالى : إلا أن تقولوا قولا معروفا استثناء منقطع بمعنى لكن ، كقوله إلا خطأ ؛ أي لكن خطأ . والقول المعروف هو ما أبيح من التعريض . وقد ذكر الضحاك أن من القول المعروف أن يقول للمعتدة : احبسي علي نفسك فإن لي بك رغبة ، فتقول هي : وأنا مثل ذلك ، وهذا شبه المواعدة .\nقوله تعالى : ولا تعزموا عقدة النكاح حتى يبلغ الكتاب أجله فيه تسع مسائل :\nالأولى : قوله تعالى : ولا تعزموا قد تقدم القول في معنى العزم ، يقال : عزم الشيء وعزم عليه . والمعنى هنا : ولا تعزموا على عقدة النكاح . ومن الأمر البين أن القرآن أفصح كلام ، فما ورد فيه فلا معترض عليه ، ولا يشك في صحته وفصاحته ، وقد قال الله تعالى : وإن عزموا الطلاق ، وقال هنا : ولا تعزموا عقدة النكاح والمعنى : لا تعزموا على عقدة النكاح في زمان العدة ثم حذف على ما تقدم . وحكى سيبويه : ضرب فلان الظهر والبطن ، أي على . قال سيبويه : والحذف في هذه الأشياء لا يقاس عليه . قال النحاس : ويجوز أن يكون ( لا تعقدوا عقدة النكاح ) ؛ لأن معنى \" تعزموا \" وتعقدوا واحد . ويقال : \" تعزموا \" بضم الزاي .\nالثانية : قوله تعالى : حتى يبلغ الكتاب أجله يريد تمام العدة . والكتاب هنا هو الحد الذي جعل والقدر الذي رسم من المدة ، سماها كتابا إذ قد حده وفرضه كتاب الله كما قال كتاب الله عليكم وكما قال : إن الصلاة كانت على المؤمنين كتابا موقوتا . فالكتاب : الفرض ، أي حتى يبلغ الفرض أجله ، كتب عليكم الصيام ؛ أي فرض . وقيل : في الكلام حذف ، أي حتى يبلغ فرض الكتاب أجله ، فالكتاب على هذا التأويل بمعنى القرآن . وعلى الأول لا حذف فهو أولى ، والله أعلم .\nالثالثة : حرم الله تعالى عقد النكاح في العدة بقوله تعالى : ولا تعزموا عقدة النكاح حتى يبلغ الكتاب أجله وهذا من المحكم المجمع على تأويله ، أن بلوغ أجله انقضاء العدة . وأباح التعريض في العدة بقوله : ولا جناح عليكم فيما عرضتم به من خطبة النساء الآية . ولم يختلف العلماء في إباحة ذلك ، واختلفوا في ألفاظ التعريض على ما تقدم . واختلفوا في الرجل يخطب امرأة في عدتها جاهلا ، أو يواعدها ويعقد بعد العدة ، وقد تقدم هذا في الآية التي قبلها . واختلفوا إن عزم العقدة في العدة وعثر عليه ففسخ الحاكم نكاحه ، وذلك قبل الدخول وهي :\nالرابعة : فقول عمر بن الخطاب وجماعة من العلماء أن ذلك لا يؤبد تحريما ، وأنه يكون خاطبا من الخطاب ، وقاله مالك وابن القاسم في المدونة في آخر الباب الذي يليه ( ضرب أجل المفقود ) . وحكى ابن الجلاب عن مالك رواية أن التحريم يتأبد في العقد وإن فسخ قبل الدخول ، ووجهه أنه نكاح في العدة فوجب أن يتأبد به التحريم ، أصله إذا بنى بها . وأما إن عقد في العدة ودخل بعد انقضائها وهي :\nالخامسة : فقال قوم من أهل العلم : ذلك كالدخول في العدة ، يتأبد التحريم بينهما . وقال قوم من أهل العلم : لا يتأبد بذلك تحريم . وقال مالك : يتأبد التحريم . وقال مرة : وما التحريم بذلك بالبين ، والقولان له في المدونة في طلاق السنة . وأما إن دخل في العدة وهي :\nالسادسة : فقال مالك والليث والأوزاعي : يفرق بينهما ولا تحل له أبدا . قال مالك والليث : ولا بملك اليمين ، مع أنهم جوزوا التزويج بالمزني بها . واحتجوا بأن عمر بن الخطاب قال : لا يجتمعان أبدا . قال سعيد : ولها مهرها بما استحل من فرجها ، أخرجه مالك في موطئه وسيأتي . وقال الثوري والكوفيون والشافعي : يفرق بينهما ولا يتأبد التحريم بل يفسخ بينهما ثم تعتد منه ، ثم يكون خاطبا من الخطاب . واحتجوا بإجماع العلماء على أنه لو زنى بها لم يحرم عليه تزويجها ، فكذلك وطؤه إياها في العدة . قالوا : وهو قول علي . ذكره عبد الرزاق . وذكر عن ابن مسعود مثله ، وعن الحسن أيضا . وذكر عبد الرزاق عن الثوري عن أشعث عن الشعبي عن مسروق أن عمر رجع عن ذلك وجعلهما يجتمعان . وذكر القاضي أبو الوليد الباجي في المنتقى فقال : لا يخلو الناكح في العدة إذا بنى بها أن يبني بها في العدة أو بعدها ، فإن كان بنى بها في العدة فإن المشهور من المذهب أن التحريم يتأبد ، وبه قال أحمد بن حنبل . وروى الشيخ أبو القاسم في تفريعه أن في التي يتزوجها الرجل في عدة من طلاق أو وفاة عالما بالتحريم روايتين ، إحداهما : أن تحريمه يتأبد على ما قدمناه . والثانية : أنه زان وعليه الحد ، ولا يلحق به الولد ، وله أن يتزوجها إذا انقضت عدتها ، وبه قال الشافعي وأبو حنيفة . ووجه الرواية الأولى - وهي المشهورة - ما ثبت من قضاء عمر بذلك ، وقيامه بذلك في الناس ، وكانت قضاياه تسير وتنتشر وتنقل في الأمصار ، ولم يعلم له مخالف ، فثبت أنه إجماع . قال القاضي أبو محمد : وقد روي مثل ذلك عن علي بن أبي طالب ولا مخالف لهما مع شهرة ذلك وانتشاره ، وهذا حكم الإجماع . ووجه الرواية الثانية أن هذا وطء ممنوع فلم يتأبد تحريمه ، كما لو زوجت نفسها أو تزوجت متعة أو زنت . وقد قال القاضي أبو الحسن : إن مذهب مالك المشهور في ذلك ضعيف من جهة النظر . والله أعلم . وأسند أبو عمر : حدثنا عبد الوارث بن سفيان حدثنا قاسم بن أصبغ عن محمد بن إسماعيل عن نعيم بن حماد عن ابن المبارك عن أشعث عن الشعبي عن مسروق قال : بلغ عمر بن الخطاب أن امرأة من قريش تزوجها رجل من ثقيف في عدتها فأرسل إليهما ففرق بينهما وعاقبهما وقال : لا تنكحها أبدا وجعل صداقها في بيت المال ، وفشا ذلك في الناس فبلغ عليا فقال : يرحم الله أمير المؤمنين ، ما بال الصداق وبيت المال ، إنما جهلا فينبغي للإمام أن يردهما إلى السنة . قيل : فما تقول أنت فيهما ؟ فقال : لها الصداق بما استحل من فرجها ، ويفرق بينهما ولا جلد عليهما ، وتكمل عدتها من الأول ، ثم تعتد من الثاني عدة كاملة ثلاثة أقراء ثم يخطبها إن شاء . فبلغ عمر فخطب الناس فقال : أيها الناس ، ردوا الجهالات إلى السنة . قال الكيا الطبري : ولا خلاف بين الفقهاء أن من عقد على امرأة نكاحها وهي في عدة من غيره أن النكاح فاسد . وفي اتفاق عمر وعلي على نفي الحد عنهما ما يدل على أن النكاح الفاسد لا يوجب الحد ، إلا أنه مع الجهل بالتحريم متفق عليه ، ومع العلم به مختلف فيه . واختلفوا هل تعتد منهما جميعا وهذه مسألة العدتين وهي :\nالسابعة : فروى المدنيون عن مالك أنها تتم بقية عدتها من الأول ، وتستأنف عدة أخرى من الآخر ، وهو قول الليث والحسن بن حي والشافعي وأحمد وإسحاق . وروي عن علي كما ذكرنا ، وعن عمر على ما يأتي . وروى محمد بن القاسم وابن وهب عن مالك : أن عدتها من الثاني تكفيها من يوم فرق بينه وبينها ، سواء كانت بالحمل أو بالأقراء أو بالشهور ، وهو قول الثوري والأوزاعي وأبي حنيفة . وحجتهم الإجماع على أن الأول لا ينكحها في بقية العدة منه ، فدل على أنها في عدة من الثاني ، ولولا ذلك لنكحها في عدتها منه . أجاب الأولون فقالوا : هذا غير لازم لأن منع الأول من أن ينكحها في بقية عدتها إنما وجب لما يتلوها من عدة الثاني ، وهما حقان قد وجبا عليها لزوجين كسائر حقوق الآدميين ، لا يدخل أحدهما في صاحبه . وخرج مالك عن ابن شهاب عن سعيد بن المسيب وعن سليمان بن يسار أن طليحة الأسدية كانت تحت رشيد الثقفي فطلقها فنكحت في عدتها فضربها عمر بن الخطاب وضرب زوجها بالمخفقة ضربات وفرق بينهما ، ثم قال عمر بن الخطاب رضي الله عنه : أيما امرأة نكحت في عدتها فإن كان زوجها الذي تزوج بها لم يدخل بها فرق بينهما ثم اعتدت بقية عدتها من الزوج الأول ، ثم كان الآخر خاطبا من الخطاب ، وإن كان دخل بها فرق بينهما ثم اعتدت بقية عدتها من الأول ، ثم اعتدت من الآخر ثم لا يجتمعان أبدا . قال مالك : وقال سعيد بن المسيب : ولها مهرها بما استحل من فرجها . قال أبو عمر : وأما طليحة هذه فهي طليحة بنت عبيد الله أخت طلحة بن عبيد الله التيمي ، وفي بعض نسخ الموطأ من رواية يحيى : طليحة الأسدية وذلك خطأ وجهل ، ولا أعلم أحدا قاله .\nالثامنة : قوله ( فضربها عمر بالمخفقة وضرب زوجها ضربات ) يريد على وجه العقوبة لما ارتكباه من المحظور وهو النكاح في العدة . وقال الزهري : فلا أدري كم بلغ ذلك الجلد . قال : وجلد عبد الملك في ذلك كل واحد منهما أربعين جلدة . قال : فسئل عن ذلك قبيصة بن ذؤيب فقال : لو كنتم خففتم فجلدتم عشرين ، وقال ابن حبيب في التي تتزوج في العدة فيمسها الرجل أو يقبل أو يباشر أو يغمز أو ينظر على وجه اللذة أن على الزوجين العقوبة وعلى الولي وعلى الشهود ومن علم منهم أنها في عدة ، ومن جهل منهم ذلك فلا عقوبة عليه . وقال ابن المواز : يجلد الزوجان الحد إن كانا تعمدا ذلك ، فيحمل قول ابن حبيب على من علم بالعدة ، ولعله جهل التحريم ولم يتعمد ارتكاب المحظور فذلك الذي يعاقب ، وعلى ذلك كان ضرب عمر المرأة وزوجها بالمخفقة ضربات . وتكون العقوبة والأدب في ذلك بحسب حال المعاقب . ويحمل قول ابن المواز على أنهما علما التحريم واقتحما ارتكاب المحظور جرأة وإقداما . وقد قال الشيخ أبو القاسم : إنهما روايتان في التعمد ، إحداهما يحد ، والثانية يعاقب ولا يحد .\nالتاسعة : قوله تعالى : واعلموا أن الله يعلم ما في أنفسكم فاحذروه هذا نهاية التحذير من الوقوع فيما نهى عنه .\n                                    ",
        "saadi": "وَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا عَرَّضۡتُم بِهِۦ مِنۡ خِطۡبَةِ ٱلنِّسَآءِ أَوۡ أَكۡنَنتُمۡ فِيٓ أَنفُسِكُمۡۚ عَلِمَ ٱللَّهُ أَنَّكُمۡ سَتَذۡكُرُونَهُنَّ وَلَٰكِن لَّا تُوَاعِدُوهُنَّ سِرًّا إِلَّآ أَن تَقُولُواْ قَوۡلٗا مَّعۡرُوفٗاۚ وَلَا تَعۡزِمُواْ عُقۡدَةَ ٱلنِّكَاحِ حَتَّىٰ يَبۡلُغَ ٱلۡكِتَٰبُ أَجَلَهُۥۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِيٓ أَنفُسِكُمۡ فَٱحۡذَرُوهُۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ ٥٣٢\n                                        \n                                        \n                                        \n                                        هذا حكم المعتدة من وفاة, أو المبانة في الحياة، فيحرم على غير مبينها أن يصرح لها في الخطبة, وهو المراد بقوله: { وَلَكِنْ لَا تُوَاعِدُوهُنَّ سِرًّا } وأما التعريض, فقد أسقط تعالى فيه الجناح. والفرق بينهما: أن التصريح, لا يحتمل غير النكاح, فلهذا حرم, خوفا من استعجالها, وكذبها في انقضاء عدتها, رغبة في النكاح، ففيه دلالة على منع وسائل المحرم, وقضاء لحق زوجها الأول, بعدم مواعدتها لغيره مدة عدتها. وأما التعريض, وهو الذي يحتمل النكاح وغيره, فهو جائز للبائن كأن يقول لها: إني أريد التزوج, وإني أحب أن تشاوريني عند انقضاء عدتك, ونحو ذلك, فهذا جائز لأنه ليس بمنزلة الصريح, وفي النفوس داع قوي إليه. وكذلك إضمار الإنسان في نفسه أن يتزوج من هي في عدتها, إذا انقضت، ولهذا قال: { أَوْ أَكْنَنْتُمْ فِي أَنْفُسِكُمْ عَلِمَ اللَّهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ } هذا التفصيل كله في مقدمات العقد. وأما عقد النكاح فلا يحل { حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ } أي: تنقضي العدة. { وَاعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ مَا فِي أَنْفُسِكُمْ } أي: فانووا الخير, ولا تنووا الشر, خوفا من عقابه ورجاء لثوابه. { وَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ } لمن صدرت منه الذنوب, فتاب منها, ورجع إلى ربه { حَلِيمٌ } حيث لم يعاجل العاصين على معاصيهم, مع قدرته عليهم.\n                                    "
      },
      "originalText": "وَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا عَرَّضۡتُم بِهِۦ مِنۡ خِطۡبَةِ ٱلنِّسَآءِ أَوۡ أَكۡنَنتُمۡ فِيٓ أَنفُسِكُمۡۚ عَلِمَ ٱللَّهُ أَنَّكُمۡ سَتَذۡكُرُونَهُنَّ وَلَٰكِن لَّا تُوَاعِدُوهُنَّ سِرًّا إِلَّآ أَن تَقُولُواْ قَوۡلٗا مَّعۡرُوفٗاۚ وَلَا تَعۡزِمُواْ عُقۡدَةَ ٱلنِّكَاحِ حَتَّىٰ يَبۡلُغَ ٱلۡكِتَٰبُ أَجَلَهُۥۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِيٓ أَنفُسِكُمۡ فَٱحۡذَرُوهُۚ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ ٥٣٢"
    },
    {
      "number": 243,
      "text": "لَا جُنَاحَ عَلَيْكُمْ إِنْ طَلَّقْتُمُ النِّسَاءَ مَا لَمْ تَمَسُّوهُنَّ أَوْ تَفْرِضُوا لَهُنَّ فَرِيضَةً ۚ وَمَتِّعُوهُنَّ عَلَى الْمُوسِعِ قَدَرُهُ وَعَلَى الْمُقْتِرِ قَدَرُهُ مَتَاعًا بِالْمَعْرُوفِ ۖ حَقًّا عَلَى الْمُحْسِنِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 236,
      "juz": 2,
      "manzil": 1,
      "page": 38,
      "ruku": 32,
      "hizbQuarter": 15,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّا جُنَاحَ عَلَيۡكُمۡ إِن طَلَّقۡتُمُ ٱلنِّسَآءَ مَا لَمۡ تَمَسُّوهُنَّ أَوۡ تَفۡرِضُواْ لَهُنَّ فَرِيضَةٗۚ وَمَتِّعُوهُنَّ عَلَى ٱلۡمُوسِعِ قَدَرُهُۥ وَعَلَى ٱلۡمُقۡتِرِ قَدَرُهُۥ مَتَٰعَۢا بِٱلۡمَعۡرُوفِۖ حَقًّا عَلَى ٱلۡمُحۡسِنِينَ ٦٣٢\n                                    \n                                    \n                                    أباح تبارك وتعالى طلاق المرأة بعد العقد عليها وقبل الدخول بها . قال ابن عباس ، وطاوس ، وإبراهيم ، والحسن البصري : المس : النكاح . بل ويجوز أن يطلقها قبل الدخول بها ، والفرض لها إن كانت مفوضة ، وإن كان في هذا انكسار لقلبها ; ولهذا أمر تعالى بإمتاعها ، وهو تعويضها عما فاتها بشيء تعطاه من زوجها بحسب حاله ، على الموسع قدره وعلى المقتر قدره .\nوقال سفيان الثوري ، عن إسماعيل بن أمية ، عن عكرمة ، عن ابن عباس قال : متعة الطلاق أعلاه الخادم ، ودون ذلك الورق ، ودون ذلك الكسوة .\nوقال علي بن أبي طلحة ، عن ابن عباس : إن كان موسرا متعها بخادم ، أو شبه ذلك ، وإن كان معسرا أمتعها بثلاثة أثواب .\nوقال الشعبي : أوسط ذلك : درع وخمار وملحفة وجلباب . قال : وكان شريح يمتع بخمسمائة . وقال عبد الرزاق : أخبرنا معمر ، عن أيوب ، عن ابن سيرين قال : كان يمتع بالخادم ، أو بالنفقة ، أو بالكسوة ، قال : ومتع الحسن بن علي بعشرة آلاف ويروى أن المرأة قالت :\nمتاع قليل من حبيب مفارق\nوذهب أبو حنيفة ، رحمه الله ، إلى أنه متى تنازع الزوجان في مقدار المتعة وجب لها عليه نصف مهر مثلها . وقال الشافعي في الجديد : لا يجبر الزوج على قدر معلوم ، إلا على أقل ما يقع عليه اسم المتعة ، وأحب ذلك إلي أن يكون أقله ما تجزئ فيه الصلاة . وقال في القديم : لا أعرف في المتعة قدرا إلا أني أستحسن ثلاثين درهما ; لما روي عن ابن عمر ، رضي الله عنهما .\nوقد اختلف العلماء أيضا : هل تجب المتعة لكل مطلقة ، أو إنما تجب المتعة لغير المدخول بها التي لم يفرض لها ؟ على أقوال :\nأحدها : أنه تجب المتعة لكل مطلقة ، لعموم قوله تعالى : ( وللمطلقات متاع بالمعروف حقا على المتقين ) [ البقرة : 241 ] ولقوله تعالى : ( يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها فتعالين أمتعكن وأسرحكن سراحا جميلا ) [ الأحزاب : 28 ] وقد كن مفروضا لهن ومدخولا بهن ، وهذا قول سعيد بن جبير ، وأبي العالية ، والحسن البصري . وهو أحد قولي الشافعي ، ومنهم من جعله الجديد الصحيح ، فالله أعلم .\nوالقول الثاني : أنها تجب للمطلقة إذا طلقت قبل المسيس ، وإن كانت مفروضا لها لقوله تعالى : ( ياأيها الذين آمنوا إذا نكحتم المؤمنات ثم طلقتموهن من قبل أن تمسوهن فما لكم عليهن من عدة تعتدونها فمتعوهن وسرحوهن سراحا جميلا ) [ الأحزاب : 49 ] قال شعبة وغيره ، عن قتادة ، عن سعيد بن المسيب قال : نسخت هذه الآية التي في الأحزاب الآية التي في البقرة .\nوقد روى البخاري في صحيحه ، عن سهل بن سعد ، وأبي أسيد أنهما قالا تزوج رسول الله صلى الله عليه وسلم أميمة بنت شراحيل ، فلما أدخلت عليه بسط يده إليها فكأنما كرهت ذلك ، فأمر أبا أسيد أن يجهزها ويكسوها ثوبين رازقيين .\nوالقول الثالث : أن المتعة إنما تجب للمطلقة إذا لم يدخل بها ، ولم يفرض لها ، فإن كان قد دخل بها وجب لها مهر مثلها إذا كانت مفوضة ، وإن كان قد فرض لها وطلقها قبل الدخول ، وجب لها عليه شطره ، فإن دخل بها استقر الجميع ، وكان ذلك عوضا لها عن المتعة ، وإنما المصابة التي لم يفرض لها ولم يدخل بها فهذه التي دلت هذه الآية الكريمة على وجوب متعتها . وهذا قول ابن عمر ، ومجاهد . ومن العلماء : من استحبها لكل مطلقة ممن عدا المفوضة المفارقة قبل الدخول : وهذا ليس بمنكور وعليه تحمل آية التخيير في الأحزاب ; ولهذا قال تعالى : ( وللمطلقات متاع بالمعروف حقا على المتقين ) [ البقرة : 241 ] .\nومن العلماء من يقول : إنها مستحبة مطلقا . قال ابن أبي حاتم : حدثنا كثير بن شهاب القزويني ، حدثنا محمد بن سعيد بن سابق ، حدثنا عمرو يعني ابن أبي قيس عن أبي إسحاق ، عن الشعبي قال : ذكروا له المتعة ، أيحبس فيها ؟ فقرأ : ( على الموسع قدره وعلى المقتر قدره ) قال الشعبي : والله ما رأيت أحدا حبس فيها ، والله لو كانت واجبة لحبس فيها القضاة .\n                                    ",
        "qortoby": "لَّا جُنَاحَ عَلَيۡكُمۡ إِن طَلَّقۡتُمُ ٱلنِّسَآءَ مَا لَمۡ تَمَسُّوهُنَّ أَوۡ تَفۡرِضُواْ لَهُنَّ فَرِيضَةٗۚ وَمَتِّعُوهُنَّ عَلَى ٱلۡمُوسِعِ قَدَرُهُۥ وَعَلَى ٱلۡمُقۡتِرِ قَدَرُهُۥ مَتَٰعَۢا بِٱلۡمَعۡرُوفِۖ حَقًّا عَلَى ٱلۡمُحۡسِنِينَ ٦٣٢\n                                    \n                                    \n                                    قوله تعالى : لا جناح عليكم إن طلقتم النساء ما لم تمسوهن أو تفرضوا لهن فريضة ومتعوهن على الموسع قدره وعلى المقتر قدره متاعا بالمعروف حقا على المحسنين\nفيه إحدى عشرة مسألة :\nالأولى : قوله تعالى : لا جناح عليكم إن طلقتم النساء هذا أيضا من أحكام المطلقات ، وهو ابتداء إخبار برفع الحرج عن المطلق قبل البناء والجماع ، فرض مهرا أو لم يفرض ، ولما نهى رسول الله صلى الله عليه وسلم عن التزوج لمعنى الذوق وقضاء الشهوة ، وأمر بالتزوج لطلب العصمة والتماس ثواب الله وقصد دوام الصحبة وقع في نفوس المؤمنين أن من طلق قبل البناء قد واقع جزءا من هذا المكروه فنزلت الآية رافعة للجناح في ذلك إذا كان أصل النكاح على المقصد الحسن . وقال قوم : لا جناح عليكم معناه لا طلب لجميع المهر بل عليكم نصف المفروض لمن فرض لها ، والمتعة لمن لم يفرض لها . وقيل : لما كان أمر المهر مؤكدا في الشرع فقد يتوهم أنه لا بد من مهر إما مسمى وإما مهر المثل ، فرفع الحرج عن المطلق في وقت التطليق وإن لم يكن في النكاح مهر . وقال قوم : لا جناح عليكم معناه في أن ترسلوا الطلاق في وقت الحيض ، بخلاف المدخول بها إذ غير المدخول بها لا عدة عليها .\nالثانية : المطلقات أربع : مطلقة مدخول بها مفروض لها وقد ذكر الله حكمها قبل هذه الآية وأنه لا يسترد منها شيء من المهر ، وأن عدتها ثلاثة قروء . ومطلقة غير مفروض لها ولا مدخول بها فهذه الآية في شأنها ولا مهر لها بل أمر الرب تعالى بإمتاعها وبين في سورة ( الأحزاب ) أن غير المدخول بها إذا طلقت فلا عدة عليها ، وسيأتي . ومطلقة مفروض لها غير مدخول بها ذكرها بعد هذه الآية إذ قال : وإن طلقتموهن من قبل أن تمسوهن وقد فرضتم لهن فريضة ، ومطلقة مدخول بها غير مفروض لها ذكرها الله في قوله : فما استمتعتم به منهن فآتوهن أجورهن ، فذكر تعالى هذه الآية والتي بعدها مطلقة قبل المسيس وقبل الفرض ، ومطلقة قبل المسيس وبعد الفرض ، فجعل للأولى المتعة ، وجعل للثانية نصف الصداق لما لحق الزوجة من دحض العقد ، ووصم الحل الحاصل للزوج بالعقد ، وقابل المسيس بالمهر الواجب .\nالثالثة : لما قسم الله تعالى حال المطلقة هنا قسمين : مطلقة مسمى لها المهر ، ومطلقة لم يسم لها دل على أن نكاح التفويض جائز وهو كل نكاح عقد من غير ذكر الصداق ولا خلاف فيه ، ويفرض بعد ذلك الصداق فإن فرض التحق بالعقد وجاز وإن لم يفرض لها وكان الطلاق لم يجب صداق إجماعا قاله القاضي أبو بكر بن العربي . وحكى المهدوي عن حماد بن أبي سليمان أنه إذا طلقها ولم يدخل بها ولم يكن فرض لها أجبر على نصف صداق مثلها . وإن فرض بعد عقد النكاح وقبل وقوع الطلاق فقال أبو حنيفة : لا يتنصف بالطلاق لأنه لم يجب بالعقد وهذا خلاف الظاهر من قوله تعالى : وإن طلقتموهن من قبل أن تمسوهن وقد فرضتم لهن فريضة ، وخلاف القياس أيضا ، فإن الفرض بعد العقد يلحق بالعقد فوجب أن يتنصف بالطلاق ، أصله الفرض المقترن بالعقد .\nالرابعة : إن وقع الموت قبل الفرض فذكر الترمذي عن ابن مسعود ( أنه سئل عن رجل تزوج امرأة لم يفرض لها ولم يدخل بها حتى مات فقال ابن مسعود : لها مثل صداق نسائها لا وكس ولا شطط وعليها العدة ولها الميراث فقام معقل بن سنان الأشجعي فقال : قضى رسول الله صلى الله عليه وسلم في بروع بنت واشق امرأة منا مثل الذي قضيت ففرح بها ابن مسعود ) . قال الترمذي : حديث ابن مسعود حديث حسن صحيح ، وقد روي عنه من غير وجه ، والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ، وبه يقول الثوري وأحمد وإسحاق ، وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم علي بن أبي طالب وزيد بن ثابت وابن عباس وابن عمر : ( إذا تزوج الرجل امرأة ولم يدخل بها ولم يفرض لها صداقا حتى مات قالوا : لها الميراث ولا صداق لها وعليها العدة ) وهو قول الشافعي . وقال : ولو ثبت حديث بروع بنت واشق لكانت الحجة فيما روي عن النبي صلى الله عليه وسلم . ويروى عن الشافعي أنه رجع بمصر بعد عن هذا القول ، وقال بحديث بروع بنت واشق .\nقلت : اختلف في تثبيت حديث بروع ، فقال القاضي أبو محمد عبد الوهاب في شرح رسالة ابن أبي زيد : وأما حديث بروع بنت واشق فقد رده حفاظ الحديث وأئمة أهل العلم . وقال الواقدي : وقع هذا الحديث بالمدينة فلم يقبله أحد من العلماء وصححه الترمذي كما ذكرنا عنه وابن المنذر . قال ابن المنذر : وقد ثبت مثل قول عبد الله بن مسعود عن رسول الله صلى الله عليه وسلم وبه نقول . وذكر أنه قول أبي ثور وأصحاب الرأي . وذكر عن الزهري والأوزاعي ومالك والشافعي مثل قول علي وزيد وابن عباس وابن عمر . وفي المسألة قول ثالث وهو أنه لا يكون ميراث حتى يكون مهر ، قاله مسروق .\nقلت : ومن الحجة لما ذهب إليه مالك أنه فراق في نكاح قبل الفرض فلم يجب فيه صداق ، أصله الطلاق لكن إذا صح الحديث فالقياس في مقابلته فاسد . وقد حكى أبو محمد عبد الحميد عن المذهب ما يوافق الحديث والحمد لله . وقال أبو عمر : حديث بروع رواه عبد الرزاق عن الثوري عن منصور عن إبراهيم عن علقمة عن ابن مسعود الحديث . وفيه : فقام معقل بن سنان . وقال فيه ابن مهدي عن الثوري عن فراس عن الشعبي عن مسروق عن عبد الله فقال معقل بن يسار ، والصواب عندي قول من قال : معقل بن سنان لا معقل بن يسار لأن معقل بن يسار رجل من مزينة ، وهذا الحديث إنما جاء في امرأة من أشجع لا من مزينة وكذلك رواه داود عن الشعبي عن علقمة ، وفيه : فقال ناس من أشجع ومعقل بن سنان قتل يوم الحرة وفي يوم الحرة يقول الشاعر :\nألا تلكم الأنصار تبكي سراتها وأشجع تبكي معقل بن سنان\nالخامسة : قوله تعالى : ما لم تمسوهن \" ما \" بمعنى الذي أي إن طلقتم النساء اللاتي لم تمسوهن . و تمسوهن قرئ بفتح التاء من الثلاثي ، وهي قراءة نافع وابن كثير وأبي عمرو وعاصم وابن عامر . وقرأ حمزة والكسائي \" تماسوهن \" من المفاعلة ؛ لأن الوطء تم بهما ، وقد يرد في باب المفاعلة فاعل بمعنى فعل ، نحو طارقت النعل ، وعاقبت اللص . والقراءة الأولى تقتضي معنى المفاعلة في هذا الباب بالمعنى المفهوم من المس ، ورجحها أبو علي ؛ لأن أفعال هذا المعنى جاءت ثلاثية على هذا الوزن ، جاء : نكح وسفد وقرع ودفط وضرب الفحل ، والقراءتان حسنتان . و \" أو \" في أو تفرضوا قيل هو بمعنى الواو ، أي ما لم تمسوهن ولم تفرضوا لهن ، كقوله تعالى : وكم من قرية أهلكناها فجاءها بأسنا بياتا أو هم قائلون ؛ أي وهم قائلون . وقوله : وأرسلناه إلى مائة ألف أو يزيدون ؛ أي ويزيدون . وقوله : ولا تطع منهم آثما أو كفورا ؛ أي وكفورا . وقوله : وإن كنتم مرضى أو على سفر أو جاء أحد منكم من الغائط ؛ معناه وجاء أحد منكم من الغائط وأنتم مرضى أو مسافرون . وقوله : إلا ما حملت ظهورهما أو الحوايا أو ما اختلط بعظم ، وما كان مثله . ويعتضد هذا بأنه تعالى عطف عليها بعد ذلك المفروض لها فقال : وإن طلقتموهن من قبل أن تمسوهن وقد فرضتم لهن فريضة . فلو كان الأول لبيان طلاق المفروض لها قبل المسيس لما كرره .\nالسادسة : قوله تعالى : ( ومتعوهن ) معناه أعطوهن شيئا يكون متاعا لهن . وحمله ابن عمرو وعلي بن أبي طالب والحسن بن أبي الحسن وسعيد بن جبير وأبو قلابة والزهري وقتادة والضحاك بن مزاحم على الوجوب . وحمله أبو عبيد ومالك بن أنس وأصحابه والقاضي شريح وغيرهم على الندب . تمسك أهل القول الأول بمقتضى الأمر . وتمسك أهل القول الثاني بقوله تعالى : حقا على المحسنين و على المتقين ولو كانت واجبة لأطلقها على الخلق أجمعين . والقول الأول أولى ؛ لأن عمومات الأمر بالإمتاع في قوله ( ومتعوهن ) وإضافة الإمتاع إليهن بلام التمليك في قوله : وللمطلقات متاع أظهر في الوجوب منه في الندب . وقوله : على المتقين تأكيد لإيجابها ؛ لأن كل واحد يجب عليه أن يتقي الله في الإشراك به ومعاصيه ، وقد قال تعالى في القرآن : هدى للمتقين .\nالسابعة : واختلفوا في الضمير المتصل بقوله ( ومتعوهن ) من المراد به من النساء ؟ فقال ابن عباس وابن عمر وجابر بن زيد والحسن والشافعي وأحمد وعطاء وإسحاق وأصحاب الرأي : المتعة واجبة للمطلقة قبل البناء والفرض ، ومندوبة في حق غيرها . وقال مالك وأصحابه : المتعة مندوب إليها في كل مطلقة وإن دخل بها ، إلا في التي لم يدخل بها وقد فرض لها فحسبها ما فرض لها ولا متعة لها . وقال أبو ثور : لها المتعة ولكل مطلقة . وأجمع أهل العلم على أن التي لم يفرض لها ولم يدخل بها لا شيء لها غير المتعة . قال الزهري : يقضي لها بها القاضي . وقال جمهور الناس : لا يقضي بها لها .\nقلت : هذا الإجماع إنما هو في الحرة ، فأما الأمة إذا طلقت قبل الفرض والمسيس فالجمهور على أن لها المتعة . وقال الأوزاعي والثوري : لا متعة لها لأنها تكون لسيدها وهو لا يستحق مالا في مقابلة تأذي مملوكته بالطلاق . وأما ربط مذهب مالك فقال ابن شعبان : المتعة بإزاء غم الطلاق ، ولذلك ليس للمختلعة والمبارئة والملاعنة متعة قبل البناء ولا بعده ؛ لأنها هي التي اختارت الطلاق . وقال الترمذي وعطاء والنخعي : للمختلعة متعة . وقال أصحاب الرأي : للملاعنة متعة . قال ابن القاسم : ولا متعة في نكاح مفسوخ . قال ابن المواز : ولا فيما يدخله الفسخ بعد صحة العقد ، مثل ملك أحد الزوجين صاحبه . قال ابن القاسم : وأصل ذلك قوله تعالى : وللمطلقات متاع بالمعروف فكان هذا الحكم مختصا بالطلاق دون الفسخ . وروى ابن وهب عن مالك أن المخيرة لها المتعة بخلاف الأمة تعتق تحت العبد فتختار هي نفسها ، فهذه لا متعة لها . وأما الحرة تخير أو تملك أو يتزوج عليها أمة فتختار هي نفسها في ذلك كله فلها المتعة ؛ لأن الزوج سبب للفراق .\nالثامنة : قال مالك : ليس للمتعة عندنا حد معروف في قليلها ولا كثيرها . وقد اختلف الناس في هذا ، فقال ابن عمر : أدنى ما يجزئ في المتعة ثلاثون درهما أو شبهها . وقال ابن عباس : أرفع المتعة خادم ثم كسوة ثم نفقة . عطاء : أوسطها الدرع والخمار والملحفة . أبو حنيفة : ذلك أدناها . وقال ابن محيريز : على صاحب الديوان ثلاثة دنانير ، وعلى العبد المتعة . وقال الحسن : يمتع كل بقدره ، هذا بخادم وهذا بأثواب وهذا بثوب وهذا بنفقة ، وكذلك يقول مالك بن أنس ، وهو مقتضى القرآن فإن الله سبحانه لم يقدرها ولا حددها وإنما قال : على الموسع قدره وعلى المقتر قدره . ومتع الحسن بن علي بعشرين ألفا وزقاق من عسل . ومتع شريح بخمسمائة درهم . وقد قيل : إن حالة المرأة معتبرة أيضا ، قاله بعض الشافعية ، قالوا : لو اعتبرنا حال الرجل وحده لزم منه أنه لو تزوج امرأتين إحداهما شريفة والأخرى دنية ثم طلقهما قبل المسيس ولم يسم لهما أن يكونا متساويتين في المتعة فيجب للدنية ما يجب للشريفة وهذا خلاف ما قال الله تعالى : متاعا بالمعروف ويلزم منه أن الموسر العظيم اليسار إذا تزوج امرأة دنية أن يكون مثلها ؛ لأنه إذا طلقها قبل الدخول والفرض لزمته المتعة على قدر حاله ومهر مثلها ، فتكون المتعة على هذا أضعاف مهر مثلها ، فتكون قد استحقت قبل الدخول أضعاف ما تستحقه بعد الدخول من مهر المثل الذي فيه غاية الابتذال وهو الوطء . وقال أصحاب الرأي وغيرهم : متعة التي تطلق قبل الدخول والفرض نصف مهر مثلها لا غير ؛ لأن مهر المثل مستحق بالعقد ، والمتعة هي بعض مهر المثل ، فيجب لها كما يجب نصف المسمى إذا طلق قبل الدخول ، وهذا يرده قوله تعالى : على الموسع قدره وعلى المقتر قدره وهذا دليل على رفض التحديد ، والله بحقائق الأمور عليم . وقد ذكر الثعلبي حديثا قال : نزلت لا جناح عليكم إن طلقتم النساء الآية ، في رجل من الأنصار تزوج امرأة من بني حنيفة ولم يسم لها مهرا ثم طلقها قبل أن يمسها فنزلت الآية ، فقال النبي صلى الله عليه وسلم : متعها ولو بقلنسوتك . وروى الدارقطني عن سويد بن غفلة قال : كانت عائشة الخثعمية عند الحسن بن علي بن أبي طالب فلما أصيب علي وبويع الحسن بالخلافة قالت : لتهنك الخلافة يا أمير المؤمنين ، فقال : يقتل علي وتظهرين الشماتة ، اذهبي فأنت طالق ثلاثا . قال : فتلفعت بساجها وقعدت حتى انقضت عدتها فبعث إليها بعشرة آلاف متعة ، وبقية ما بقي لها من صداقها . فقالت :\nمتاع قليل من حبيب مفارق\nفلما بلغه قولها بكى وقال : لولا أني سمعت جدي - أو حدثني أبي أنه سمع جدي - يقول : أيما رجل طلق امرأته ثلاثا مبهمة أو ثلاثا عند الأقراء لم تحل له حتى تنكح زوجا غيره لراجعتها . وفي رواية : أخبره الرسول فبكى وقال : لولا أني أبنت الطلاق لها لراجعتها ، ولكني سمعت رسول الله صلى الله عليه وسلم يقول : أيما رجل طلق امرأته ثلاثا عند كل طهر تطليقة أو عند رأس كل شهر تطليقة أو طلقها ثلاثا جميعا لم تحل له حتى تنكح زوجا غيره .\nالتاسعة : من جهل المتعة حتى مضت أعوام فليدفع ذلك إليها وإن تزوجت ، وإلى ورثتها إن ماتت ، رواه ابن المواز عن ابن القاسم . وقال أصبغ : لا شيء عليه إن ماتت لأنها تسلية للزوجة عن الطلاق وقد فات ذلك . ووجه الأول أنه حق ثبت عليه وينتقل عنها إلى ورثتها كسائر الحقوق ، وهذا يشعر بوجوبها في المذهب ، والله أعلم .\nالعاشرة : قوله تعالى : على الموسع قدره وعلى المقتر قدره دليل على وجوب المتعة وقرأ الجمهور ( الموسع ) بسكون الواو وكسر السين ، وهو الذي اتسعت حاله ، يقال : فلان ينفق على قدره ، أي على وسعه . وقرأ أبو حيوة بفتح الواو وشد السين وفتحها . وقرأ ابن كثير ونافع وأبو عمرو وعاصم في رواية أبي بكر \" قدره \" بسكون الدال في الموضعين . وقرأ ابن عامر وحمزة والكسائي وعاصم في رواية حفص بفتح الدال فيهما . قال أبو الحسن الأخفش وغيره : هما بمعنى ، لغتان فصيحتان ، وكذلك حكى أبو زيد ، يقول : خذ قدر كذا وقدر كذا ، بمعنى . ويقرأ في كتاب الله : فسالت أودية بقدرها ، وقدرها ، وقال تعالى : وما قدروا الله حق قدره ولو حركت الدال لكان جائزا . و \" المقتر \" المقل القليل المال . و ( متاعا ) نصب على المصدر ، أي متعوهن متاعا بالمعروف أي بما عرف في الشرع من الاقتصاد .\nالحادية عشرة : قوله تعالى : حقا على المحسنين أي يحق ذلك عليهم حقا ، يقال : حققت عليه القضاء وأحققت ، أي أوجبت ، وفي هذا دليل على وجوب المتعة مع الأمر بها ، فقوله : ( حقا ) تأكيد للوجوب . ومعنى على المحسنين و على المتقين أي على المؤمنين ، إذ ليس لأحد أن يقول : لست بمحسن ولا متق ، والناس مأمورون بأن يكونوا جميعا محسنين متقين ، فيحسنون بأداء فرائض الله ويجتنبون معاصيه حتى لا يدخلوا النار ، فواجب على الخلق أجمعين أن يكونوا محسنين متقين . و ( حقا ) صفة لقوله متاعا أو نصب على المصدر ، وذلك أدخل في التأكيد للأمر ، والله أعلم .\n                                    ",
        "saadi": "لَّا جُنَاحَ عَلَيۡكُمۡ إِن طَلَّقۡتُمُ ٱلنِّسَآءَ مَا لَمۡ تَمَسُّوهُنَّ أَوۡ تَفۡرِضُواْ لَهُنَّ فَرِيضَةٗۚ وَمَتِّعُوهُنَّ عَلَى ٱلۡمُوسِعِ قَدَرُهُۥ وَعَلَى ٱلۡمُقۡتِرِ قَدَرُهُۥ مَتَٰعَۢا بِٱلۡمَعۡرُوفِۖ حَقًّا عَلَى ٱلۡمُحۡسِنِينَ ٦٣٢\n                                        \n                                        \n                                        \n                                        أي: ليس عليكم يا معشر الأزواج جناح وإثم, بتطليق النساء قبل المسيس, وفرض المهر, وإن كان في ذلك كسر لها, فإنه ينجبر بالمتعة، فعليكم أن تمتعوهن بأن تعطوهن شيئا من المال, جبرا لخواطرهن. { عَلَى الْمُوسِعِ قَدَرُهُ وَعَلَى الْمُقْتِرِ } أي: المعسر { قَدَرُهُ } وهذا يرجع إلى العرف, وأنه يختلف باختلاف الأحوال ولهذا قال: { مَتَاعًا بِالْمَعْرُوفِ } فهذا حق واجب { عَلَى الْمُحْسِنِينَ } ليس لهم أن يبخسوهن. فكما تسببوا لتشوفهن واشتياقهن, وتعلق قلوبهن, ثم لم يعطوهن ما رغبن فيه, فعليهم في مقابلة ذلك المتعة. فلله ما أحسن هذا الحكم الإلهي, وأدله على حكمة شارعه ورحمته\" ومن أحسن من الله حكما لقوم يوقنون؟\" فهذا حكم المطلقات قبل المسيس وقبل فرض المهر.\n                                    "
      },
      "originalText": "لَّا جُنَاحَ عَلَيۡكُمۡ إِن طَلَّقۡتُمُ ٱلنِّسَآءَ مَا لَمۡ تَمَسُّوهُنَّ أَوۡ تَفۡرِضُواْ لَهُنَّ فَرِيضَةٗۚ وَمَتِّعُوهُنَّ عَلَى ٱلۡمُوسِعِ قَدَرُهُۥ وَعَلَى ٱلۡمُقۡتِرِ قَدَرُهُۥ مَتَٰعَۢا بِٱلۡمَعۡرُوفِۖ حَقًّا عَلَى ٱلۡمُحۡسِنِينَ ٦٣٢"
    },
    {
      "number": 244,
      "text": "وَإِنْ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةً فَنِصْفُ مَا فَرَضْتُمْ إِلَّا أَنْ يَعْفُونَ أَوْ يَعْفُوَ الَّذِي بِيَدِهِ عُقْدَةُ النِّكَاحِ ۚ وَأَنْ تَعْفُوا أَقْرَبُ لِلتَّقْوَىٰ ۚ وَلَا تَنْسَوُا الْفَضْلَ بَيْنَكُمْ ۚ إِنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 237,
      "juz": 2,
      "manzil": 1,
      "page": 38,
      "ruku": 32,
      "hizbQuarter": 15,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيضَةٗ فَنِصۡفُ مَا فَرَضۡتُمۡ إِلَّآ أَن يَعۡفُونَ أَوۡ يَعۡفُوَاْ ٱلَّذِي بِيَدِهِۦ عُقۡدَةُ ٱلنِّكَاحِۚ وَأَن تَعۡفُوٓاْ أَقۡرَبُ لِلتَّقۡوَىٰۚ وَلَا تَنسَوُاْ ٱلۡفَضۡلَ بَيۡنَكُمۡۚ إِنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٌ ٧٣٢\n                                    \n                                    \n                                    وهذه الآية الكريمة مما يدل على اختصاص المتعة بما دلت عليه الآية الأولى حيث إنما أوجب في هذه الآية نصف المهر المفروض ، وإذا طلق الزوج قبل الدخول ، فإنه لو كان ثم واجب آخر من متعة لبينها لا سيما وقد قرنها بما قبلها من اختصاص المتعة بتلك الحالة والله أعلم .\nوتشطير الصداق والحالة هذه أمر مجمع عليه بين العلماء ، لا خلاف بينهم في ذلك ، فإنه متى كان قد سمى لها صداقا ثم فارقها قبل دخوله بها ، فإنه يجب لها نصف ما سمى من الصداق ، إلا أن عند الثلاثة أنه يجب جميع الصداق إذا خلا بها الزوج ، وإن لم يدخل بها ، وهو مذهب الشافعي في القديم ، وبه حكم الخلفاء الراشدون ، لكن قال الشافعي : أخبرنا مسلم بن خالد ، أخبرنا ابن جريج ، عن ليث بن أبي سليم ، عن طاوس ، عن ابن عباس أنه قال : في الرجل يتزوج المرأة فيخلو بها ولا يمسها ثم يطلقها ليس لها إلا نصف الصداق ; لأن الله يقول : ( وإن طلقتموهن من قبل أن تمسوهن وقد فرضتم لهن فريضة فنصف ما فرضتم ) قال الشافعي : هذا أقوى وهو ظاهر الكتاب .\nقال البيهقي : وليث بن أبي سليم وإن كان غير محتج به ، فقد رويناه من حديث ابن أبي طلحة ، عن ابن عباس فهو يقوله .\nوقوله : ( إلا أن يعفون ) أي : النساء عما وجب لها على زوجها من النصف ، فلا يجب لها عليه شيء .\nقال السدي ، عن أبي صالح ، عن ابن عباس في قوله : ( إلا أن يعفون ) قال : إلا أن تعفو الثيب فتدع حقها . قال الإمام أبو محمد بن أبي حاتم ، رحمه الله : وروي عن شريح ، وسعيد بن المسيب ، وعكرمة ، ومجاهد ، والشعبي ، والحسن ، ونافع ، وقتادة ، وجابر بن زيد ، وعطاء الخراساني ، والضحاك ، والزهري ، ومقاتل بن حيان ، وابن سيرين ، والربيع بن أنس ، والسدي ، نحو ذلك . قال : وخالفهم محمد بن كعب القرظي فقال : ( إلا أن يعفون ) يعني : الرجال ، وهو قول شاذ لم يتابع عليه . انتهى كلامه .\nوقوله : ( أو يعفو الذي بيده عقدة النكاح ) قال ابن أبي حاتم : ذكر عن ابن لهيعة ، حدثني عمرو بن شعيب ، عن أبيه ، عن جده ، عن النبي صلى الله عليه وسلم [ قال ] : \" ولي عقدة النكاح الزوج \" .\nوهكذا أسنده ابن مردويه من حديث عبد الله بن لهيعة ، به . وقد أسنده ابن جرير ، عن ابن لهيعة ، عن عمرو بن شعيب أن رسول الله صلى الله عليه وسلم ، فذكره ولم يقل : عن أبيه ، عن جده ، فالله أعلم .\nثم قال ابن أبي حاتم ، رحمه الله : وحدثنا يونس بن حبيب ، حدثنا أبو داود ، حدثنا جرير ، يعني ابن حازم ، عن عيسى يعني ابن عاصم قال : سمعت شريحا يقول : سألني علي بن أبي طالب عن الذي بيده عقدة النكاح . فقلت له : هو ولي المرأة . فقال علي : لا بل هو الزوج .\nثم قال : وفي إحدى الروايات عن ابن عباس ، وجبير بن مطعم ، وسعيد بن المسيب ، وشريح في أحد قوليه وسعيد بن جبير ، ومجاهد ، والشعبي ، وعكرمة ، ونافع ، ومحمد بن سيرين ، والضحاك ، ومحمد بن كعب القرظي ، وجابر بن زيد ، وأبي مجلز ، والربيع بن أنس ، وإياس بن معاوية ، ومكحول ، ومقاتل بن حيان : أنه الزوج .\nقلت : وهذا هو الجديد من قولي الشافعي ، ومذهب أبي حنيفة . وأصحابه ، والثوري ، وابن شبرمة ، والأوزاعي ، واختاره ابن جرير . ومأخذ هذا القول : أن الذي بيده عقدة النكاح حقيقة الزوج ، فإن بيده عقدها وإبرامها ونقضها وانهدامها ، وكما أنه لا يجوز للولي أن يهب شيئا من مال المولية للغير ، فكذلك في الصداق .\nقال : والوجه الثاني : حدثنا أبي ، حدثنا ابن أبي مريم ، حدثنا محمد بن مسلم ، حدثنا عمرو بن دينار ، عن ابن عباس في الذي ذكر الله بيده عقدة النكاح قال : ذلك أبوها أو أخوها ، أو من لا تنكح إلا بإذنه ، وروي عن علقمة ، والحسن ، وعطاء ، وطاوس ، والزهري ، وربيعة ، وزيد بن أسلم ، وإبراهيم النخعي ، وعكرمة في أحد قوليه ، ومحمد بن سيرين في أحد قوليه : أنه الولي . وهذا مذهب مالك ، وقول الشافعي في القديم ; ومأخذه أن الولي هو الذي أكسبها إياه ، فله التصرف فيه بخلاف سائر مالها .\nوقال ابن جرير : حدثنا سعيد بن الربيع الرازي ، حدثنا سفيان ، عن عمرو بن دينار ، عن عكرمة قال : أذن الله في العفو وأمر به ، فأي امرأة عفت جاز عفوها ، فإن شحت وضنت عفا وليها وجاز عفوه .\nوهذا يقتضي صحة عفو الولي ، وإن كانت رشيدة ، وهو مروي عن شريح . لكن أنكر عليه الشعبي ، فرجع عن ذلك ، وصار إلى أنه الزوج وكان يباهل عليه .\nوقوله : ( وأن تعفوا أقرب للتقوى ) قال ابن جرير : قال بعضهم : خوطب به الرجال ، والنساء . حدثني يونس ، أخبرنا ابن وهب ، سمعت ابن جريج يحدث عن عطاء بن أبي رباح ، عن ابن عباس : ( وأن تعفوا أقرب للتقوى ) قال : أقربهما للتقوى الذي يعفو .\nوكذا روي عن الشعبي وغيره ، وقال مجاهد ، والضحاك ، ومقاتل بن حيان ، والربيع بن أنس ، والثوري : الفضل هاهنا أن تعفو المرأة عن شطرها ، أو إتمام الرجل الصداق لها . ولهذا قال : ( ولا تنسوا الفضل [ بينكم ] ) أي : الإحسان ، قاله سعيد . وقال الضحاك ، وقتادة ، والسدي ، وأبو وائل : المعروف ، يعني : لا تهملوه بل استعملوه بينكم .\nوقد قال أبو بكر بن مردويه : حدثنا محمد بن أحمد بن إبراهيم ، حدثنا موسى بن إسحاق ، حدثنا عقبة بن مكرم ، حدثنا يونس بن بكير ، حدثنا عبيد الله بن الوليد الوصافي ، عن عبد الله بن عبيد ، عن علي بن أبي طالب ، أن رسول الله صلى الله عليه وسلم قال : \" ليأتين على الناس زمان عضوض ، يعض المؤمن على ما في يديه وينسى الفضل ، وقد قال الله تعالى : ( ولا تنسوا الفضل بينكم ) شرار يبايعون كل مضطر ، وقد نهى رسول الله صلى الله عليه وسلم عن بيع المضطر ، وعن بيع الغرر ، فإن كان عندك خير فعد به على أخيك ، ولا تزده هلاكا إلى هلاكه ، فإن المسلم أخو المسلم لا يحزنه ولا يحرمه \" .\nوقال سفيان ، عن أبي هارون قال : رأيت عون بن عبد الله في مجلس القرظي ، فكان عون يحدثنا ولحيته ترش من البكاء ويقول : صحبت الأغنياء فكنت من أكثرهم هما ، حين رأيتهم أحسن ثيابا ، وأطيب ريحا ، وأحسن مركبا [ مني ] . وجالست الفقراء فاسترحت بهم ، وقال : ( ولا تنسوا الفضل بينكم ) إذا أتاه السائل وليس عنده شيء فليدع له : رواه ابن أبي حاتم .\n( إن الله بما تعملون بصير ) أي : لا يخفى عليه شيء من أموركم وأحوالكم ، وسيجزي كل عامل بعمله .\n                                    ",
        "qortoby": "وَإِن طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيضَةٗ فَنِصۡفُ مَا فَرَضۡتُمۡ إِلَّآ أَن يَعۡفُونَ أَوۡ يَعۡفُوَاْ ٱلَّذِي بِيَدِهِۦ عُقۡدَةُ ٱلنِّكَاحِۚ وَأَن تَعۡفُوٓاْ أَقۡرَبُ لِلتَّقۡوَىٰۚ وَلَا تَنسَوُاْ ٱلۡفَضۡلَ بَيۡنَكُمۡۚ إِنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٌ ٧٣٢\n                                    \n                                    \n                                    قوله تعالى : وإن طلقتموهن من قبل أن تمسوهن وقد فرضتم لهن فريضة فنصف ما فرضتم إلا أن يعفون أو يعفو الذي بيده عقدة النكاح وأن تعفوا أقرب للتقوى ولا تنسوا الفضل بينكم إن الله بما تعملون بصير\nفيه ثمان مسائل :\nالأولى : اختلف الناس في هذه الآية ، فقالت فرقة منها مالك وغيره : إنها مخرجة المطلقة بعد الفرض من حكم التمتع ، إذ يتناولها قوله تعالى : ( ومتعوهن ) . وقال ابن المسيب : نسخت هذه الآية الآية التي في ( الأحزاب ) لأن تلك تضمنت تمتيع كل من لم يدخل بها . وقال قتادة : نسخت هذه الآية الآية التي قبلها .\nقلت : قول سعيد وقتادة فيه نظر ، إذ شروط النسخ غير موجودة والجمع ممكن . وقال ابن القاسم في المدونة : كان المتاع لكل مطلقة بقوله تعالى : وللمطلقات متاع بالمعروف ، ولغير المدخول بها بالآية التي في سورة ( الأحزاب ) فاستثنى الله تعالى المفروض لها قبل الدخول بها بهذه الآية ، وأثبت للمفروض لها نصف ما فرض فقط . وقال فريق من العلماء منهم أبو ثور : المتعة لكل مطلقة عموما ، وهذه الآية إنما بينت أن المفروض لها تأخذ نصف ما فرض لها ، ولم يعن بالآية إسقاط متعتها ، بل لها المتعة ونصف المفروض .\nالثانية : قوله تعالى : فنصف ما فرضتم أي فالواجب نصف ما فرضتم ، أي من المهر فالنصف للزوج والنصف للمرأة بإجماع . والنصف الجزء من اثنين ، فيقال : نصف الماء القدح أي بلغ نصفه . ونصف الإزار الساق ، وكل شيء بلغ نصف غيره فقد نصفه . وقرأ الجمهور ( فنصف ) بالرفع . وقرأت فرقة \" فنصف \" بنصب الفاء ، المعنى فادفعوا نصف . وقرأ علي بن أبي طالب وزيد بن ثابت \" فنصف \" بضم النون في جميع القرآن وهي لغة . وكذلك روى الأصمعي قراءة عن أبي عمرو بن العلاء يقال : نصف ونصف ونصيف ، ، لغات ثلاث في النصف ، وفي الحديث : لو أن أحدكم أنفق مثل أحد ذهبا ما بلغ مد أحدهم ولا نصيفه أي نصفه . والنصيف أيضا القناع .\n‌‌‌‌‌‌‌ الثالثة : إذا أصدقها ثم طلقها قبل الدخول ونما الصداق في يدها فقال مالك : كل عرض أصدقها أو عبد فنماؤهما لهما جميعا ونقصانه بينهما ، وتواه عليهما جميعا ليس على المرأة منه شيء . فإن أصدقها عينا ذهبا أو ورقا فاشترت به عبدا أو دارا أو اشترت به منه أو من غيره طيبا أو شوارا أو غير ذلك مما لها التصرف فيه لجهازها وصلاح شأنها في بقائها معه فذلك كله بمنزلة ما لو أصدقها إياه ، ونماؤه ونقصانه بينهما . وإن طلقها قبل الدخول لم يكن لها إلا نصفه ، وليس عليها أن تغرم له نصف ما قبضته منه ، وإن اشترت به أو منه شيئا تختص به فعليها أن تغرم له نصف صداقها الذي قبضت منه ، وكذلك لو اشترت من غيره عبدا أو دارا بالألف الذي أصدقها ثم طلقها قبل الدخول رجع عليها بنصف الألف .\nالرابعة : لا خلاف أن من دخل بزوجته ثم مات عنها وقد سمى لها أن لها ذلك المسمى كاملا والميراث ، وعليها العدة .\nواختلفوا في الرجل يخلو بالمرأة ولم يجامعها حتى فارقها ، فقال الكوفيون ومالك : عليه جميع المهر ، وعليها العدة ، لخبر ابن مسعود قال : قضى الخلفاء الراشدون فيمن أغلق بابا أو أرخى سترا أن لها الميراث وعليها العدة ، وروي مرفوعا خرجه الدارقطني وسيأتي في ( النساء ) . والشافعي لا يوجب مهرا كاملا ، ولا عدة إذا لم يكن دخول ، لظاهر القرآن . قال شريح : لم أسمع الله سبحانه وتعالى ذكر في كتابه بابا ولا سترا ، إذا زعم أنه لم يمسها فلها نصف الصداق ، وهو مذهب ابن عباس وسيأتي ما لعلمائنا في هذا في سورة ( النساء ) إن شاء الله تعالى عند قوله تعالى : وقد أفضى بعضكم إلى بعض .\nالخامسة : قوله تعالى : إلا أن يعفون أو يعفو الذي بيده عقدة النكاح الآية . إلا أن يعفون استثناء منقطع ؛ لأن عفوهن عن النصف ليس من جنس أخذهن . و يعفون معناه يتركن ويصفحن ، ووزنه يفعلن . والمعنى إلا أن يتركن النصف الذي وجب لهن عند الزوج ، ولم تسقط النون مع \" أن \" ؛ لأن جمع المؤنث في المضارع على حالة واحدة في الرفع والنصب والجزم ، فهي ضمير وليست بعلامة إعراب فلذلك لم تسقط ، ولأنه لو سقطت النون لاشتبه بالمذكر . والعافيات في هذه الآية كل امرأة تملك أمر نفسها ، فأذن الله سبحانه وتعالى لهن في إسقاطه بعد وجوبه ، إذ جعله خالص حقهن ، فيتصرفن فيه بالإمضاء والإسقاط كيف شئن ، إذا ملكن أمر أنفسهن وكن بالغات عاقلات راشدات . وقال ابن عباس وجماعة من الفقهاء والتابعين : ويجوز عفو البكر التي لا ولي لها ، وحكاه سحنون في المدونة عن غير ابن القاسم بعد أن ذكر لابن القاسم أن وضعها نصف الصداق لا يجوز . وأما التي في حجر أب أو وصي فلا يجوز وضعها لنصف صداقها قولا واحدا ، ولا خلاف فيه فيما أعلم .\nالسادسة : قوله تعالى : أو يعفو الذي بيده معطوف على الأول مبني ، وهذا معرب . وقرأ الحسن \" أو يعفو \" ساكنة الواو ، كأنه استثقل الفتحة في الواو . واختلف الناس في المراد بقوله تعالى : أو يعفو الذي بيده عقدة النكاح فروى الدارقطني عن جبير بن مطعم أنه تزوج امرأة من بني نصر فطلقها قبل أن يدخل بها ، فأرسل إليها بالصداق كاملا وقال : أنا أحق بالعفو منها ، قال الله تعالى : إلا أن يعفون أو يعفو الذي بيده عقدة النكاح وأنا أحق بالعفو منها . وتأول قوله تعالى : أو يعفو الذي بيده عقدة النكاح يعني نفسه في كل حال قبل الطلاق وبعده ، أي عقدة نكاحه ، فلما أدخل اللام حذف الهاء كقوله : فإن الجنة هي المأوى ؛ أي مأواه . قال النابغة :\nلهم شيمة لم يعطها الله غيرهم من الجود والأحلام غير عوازب\nأي أحلامهم . وكذلك قوله : عقدة النكاح أي عقدة نكاحه . وروى الدارقطني مرفوعا من حديث قتيبة بن سعيد حدثنا ابن لهيعة عن عمرو بن شعيب عن أبيه عن جده قال : قال رسول الله صلى الله عليه وسلم : ولي عقدة النكاح الزوج . وأسند هذا عن علي وابن عباس وسعيد بن المسيب وشريح . قال : وكذلك قال نافع بن جبير ومحمد بن كعب وطاوس ومجاهد والشعبي وسعيد بن جبير ، زاد غيره ومجاهد والثوري ، واختاره أبو حنيفة ، وهو الصحيح من قول الشافعي ، كلهم لا يرى سبيلا للولي على شيء من صداقها ، للإجماع على أن الولي لو أبرأ الزوج من المهر قبل الطلاق لم يجز فكذلك بعده . وأجمعوا على أن الولي لا يملك أن يهب شيئا من مالها ، والمهر مالها . وأجمعوا على أن من الأولياء من لا يجوز عفوهم وهم بنو العم وبنو الإخوة ، فكذلك الأب ، والله أعلم . ومنهم من قال هو الولي أسنده الدارقطني أيضا عن ابن عباس قال : وهو قول إبراهيم وعلقمة والحسن ، زاد غيره وعكرمة وطاوس وعطاء وأبي الزناد وزيد بن أسلم وربيعة ومحمد بن كعب وابن شهاب والأسود بن يزيد والشعبي وقتادة ومالك والشافعي في القديم . فيجوز للأب العفو عن نصف صداق ابنته البكر إذا طلقت ، بلغت المحيض أم لم تبلغه . قال عيسى بن دينار : ولا ترجع بشيء منه على أبيها ، والدليل على أن المراد الولي أن الله سبحانه وتعالى قال في أول الآية : وإن طلقتموهن من قبل أن تمسوهن وقد فرضتم لهن فريضة فنصف ما فرضتم فذكر الأزواج وخاطبهم بهذا الخطاب ، ثم قال : إلا أن يعفون فذكر النسوان ، أو يعفو الذي بيده عقدة النكاح فهو ثالث فلا يرد إلى الزوج المتقدم إلا لو لم يكن لغيره وجود ، وقد وجد وهو الولي فهو المراد . قال معناه مكي وذكره ابن العربي . وأيضا فإن الله تعالى قال : إلا أن يعفون ومعلوم أنه ليس كل امرأة تعفو ، فإن الصغيرة والمحجور عليها لا عفو لهما ، فبين الله القسمين فقال : إلا أن يعفون أي إن كن لذلك أهلا ، أو يعفو الذي بيده عقدة النكاح وهو الولي ؛ لأن الأمر فيه إليه . وكذلك روى ابن وهب وأشهب وابن عبد الحكم وابن القاسم عن مالك أنه الأب في ابنته البكر والسيد في أمته . وإنما يجوز عفو الولي إذا كان من أهل السداد ، ولا يجوز عفوه إذا كان سفيها . فإن قيل : لا نسلم أنه الولي بل هو الزوج ، وهذا الاسم أولى به ؛ لأنه أملك للعقد من الولي على ما تقدم . فالجواب - أنا لا نسلم أن الزوج أملك للعقد من الأب في ابنته البكر ، بل أب البكر يملكه خاصة دون الزوج ؛ لأن المعقود عليه هو بضع البكر ، ولا يملك الزوج أن يعقد على ذلك بل الأب يملكه . وقد أجاز شريح عفو الأخ عن نصف المهر ، وكذلك قال عكرمة : يجوز عفو الذي عقد عقدة النكاح بينهما ، كان عما أو أبا أو أخا ، وإن كرهت . وقرأ أبو نهيك والشعبي \" أو يعفو \" بإسكان الواو على التشبيه بالألف ، ومثله قول الشاعر :\nفما سودتني عامر عن وراثة أبى الله أن أسمو بأم ولا أب\nالسابعة : قوله تعالى : وأن تعفوا أقرب للتقوى ابتداء وخبر ، والأصل تعفووا أسكنت الواو الأولى لثقل حركتها ثم حذفت لالتقاء الساكنين ، وهو خطاب للرجال والنساء في قول ابن عباس فغلب الذكور ، واللام بمعنى إلى ، أي أقرب إلى التقوى . وقرأ الجمهور ( تعفو ) بالتاء باثنتين من فوق . وقرأ أبو نهيك والشعبي \" وأن يعفو \" بالياء ، وذلك راجع إلى الذي بيده عقدة النكاح .\nقلت : ولم يقرأ \" وأن تعفون \" بالتاء فيكون للنساء . وقرأ الجمهور ولا تنسوا الفضل بضم الواو ، وكسرها يحيى بن يعمر . وقرأ علي ومجاهد وأبو حيوة وابن أبي عبلة ( ولا تناسوا الفضل ) وهي قراءة متمكنة المعنى ؛ لأنه موضع تناس لا نسيان إلا على التشبيه . قال مجاهد : الفضل إتمام الرجل الصداق كله ، أو ترك المرأة النصف الذي لها .\nالثامنة : قوله تعالى : إن الله بما تعملون بصير خبر في ضمنه الوعد للمحسن والحرمان لغير المحسن ، أي لا يخفى عليه عفوكم واستقضاؤكم .\n                                    ",
        "saadi": "وَإِن طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيضَةٗ فَنِصۡفُ مَا فَرَضۡتُمۡ إِلَّآ أَن يَعۡفُونَ أَوۡ يَعۡفُوَاْ ٱلَّذِي بِيَدِهِۦ عُقۡدَةُ ٱلنِّكَاحِۚ وَأَن تَعۡفُوٓاْ أَقۡرَبُ لِلتَّقۡوَىٰۚ وَلَا تَنسَوُاْ ٱلۡفَضۡلَ بَيۡنَكُمۡۚ إِنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٌ ٧٣٢\n                                        \n                                        \n                                        \n                                        أي: إذا طلقتم النساء قبل المسيس, وبعد فرض المهر, فللمطلقات من المهر المفروض نصفه, ولكم نصفه. هذا هو الواجب ما لم يدخله عفو ومسامحة, بأن تعفو عن نصفها لزوجها, إذا كان يصح عفوها, { أَوْ يَعْفُوَ الَّذِي بِيَدِهِ عُقْدَةُ النِّكَاحِ } وهو الزوج على الصحيح لأنه الذي بيده حل عقدته؛ ولأن الولي لا يصح أن يعفو عن ما وجب للمرأة, لكونه غير مالك ولا وكيل. ثم رغب في العفو, وأن من عفا, كان أقرب لتقواه, لكونه إحسانا موجبا لشرح الصدر, ولكون الإنسان لا ينبغي أن يهمل نفسه من الإحسان والمعروف, وينسى الفضل الذي هو أعلى درجات المعاملة, لأن معاملة الناس فيما بينهم على درجتين: إما عدل وإنصاف واجب, وهو: أخذ الواجب, وإعطاء الواجب. وإما فضل وإحسان, وهو إعطاء ما ليس بواجب والتسامح في الحقوق, والغض مما في النفس، فلا ينبغي للإنسان أن ينسى هذه الدرجة, ولو في بعض الأوقات, وخصوصا لمن بينك وبينه معاملة, أو مخالطة, فإن الله مجاز المحسنين بالفضل والكرم، ولهذا قال: { إِنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ }.\n                                    "
      },
      "originalText": "وَإِن طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ وَقَدۡ فَرَضۡتُمۡ لَهُنَّ فَرِيضَةٗ فَنِصۡفُ مَا فَرَضۡتُمۡ إِلَّآ أَن يَعۡفُونَ أَوۡ يَعۡفُوَاْ ٱلَّذِي بِيَدِهِۦ عُقۡدَةُ ٱلنِّكَاحِۚ وَأَن تَعۡفُوٓاْ أَقۡرَبُ لِلتَّقۡوَىٰۚ وَلَا تَنسَوُاْ ٱلۡفَضۡلَ بَيۡنَكُمۡۚ إِنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٌ ٧٣٢"
    }
  ]
}