{
  "number": 391,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 3296,
      "text": "وَمَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ إِذْ قَضَيْنَا إِلَىٰ مُوسَى الْأَمْرَ وَمَا كُنْتَ مِنَ الشَّاهِدِينَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 44,
      "juz": 20,
      "manzil": 5,
      "page": 391,
      "ruku": 338,
      "hizbQuarter": 156,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِيِّ إِذۡ قَضَيۡنَآ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّٰهِدِينَ ٤٤\n                                    \n                                    \n                                    يقول تعالى منبها على برهان نبوة محمد ، صلوات الله وسلامه عليه ، حيث أخبر بالغيوب الماضية ، خبرا كأن سامعه شاهد وراء لما تقدم ، وهو رجل أمي لا يقرأ شيئا من الكتب ، نشأ بين قوم لا يعرفون شيئا من ذلك ، كما أنه لما أخبره عن مريم وما كان من أمرها ، قال تعالى : ( وما كنت لديهم إذ يلقون أقلامهم أيهم يكفل مريم وما كنت لديهم إذ يختصمون ) [ آل عمران : 44 ] ، أي : ما كنت حاضرا لذلك ، ولكن الله أوحاه إليك . وهكذا لما أخبره عن نوح وقومه ، وما كان من إنجاء الله له وإغراق قومه .\nثم قال تعالى : ( تلك من أنباء الغيب نوحيها إليك ما كنت تعلمها أنت ولا قومك من قبل هذا فاصبر إن العاقبة للمتقين ) [ هود : 49 ] وقال في آخر السورة ( ذلك من أنباء القرى نقصه عليك ) [ هود : 100 ] ، وقال بعد ذكر قصة يوسف : ( ذلك من أنباء الغيب نوحيه إليك وما كنت لديهم إذ أجمعوا أمرهم وهم يمكرون ) [ يوسف : 102 ] ، وقال في سورة طه : ( كذلك نقص عليك من أنباء ما قد سبق وقد آتيناك من لدنا ذكرا ) [ طه : 99 ] وقال هاهنا - بعدما أخبر عن قصة موسى من أولها إلى آخرها ، وكيف كان ابتداء إيحاء الله إليه وتكليمه له - : ( وما كنت بجانب الغربي إذ قضينا إلى موسى الأمر ) يعني : يا محمد ، ما كنت بجانب الجبل الغربي الذي كلم الله موسى من الشجرة التي هي شرقية على شاطئ الوادي ، ( وما كنت من الشاهدين ) لذلك\n                                    ",
        "qortoby": "وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِيِّ إِذۡ قَضَيۡنَآ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّٰهِدِينَ ٤٤\n                                    \n                                    \n                                    قوله تعالى : وما كنت بجانب الغربي إذ قضينا إلى موسى الأمر وما كنت من الشاهدين\nقوله تعالى : ( وما كنت ) أي ما كنت يا محمد بجانب الغربي أي بجانب الجبل الغربي . قال الشاعر :\nأعطاك من أعطى الهدى النبيا نورا يزين المنبر الغربيا\nإذ قضينا إلى موسى الأمر إذ كلفناه أمرنا ونهينا ، وألزمناه عهدنا وقيل : أي إذ قضينا إلى موسى أمرك وذكرناك بخير ذكر . وقال ابن عباس : إذ قضينا أي أخبرنا أن أمة محمد خير الأمم وما كنت من الشاهدين أي من الحاضرين .\n                                    ",
        "saadi": "وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِيِّ إِذۡ قَضَيۡنَآ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّٰهِدِينَ ٤٤\n                                        \n                                        \n                                        \n                                        ولما قص اللّه على رسوله ما قص من هذه الأخبار الغيبية، نبه العباد على أن هذا خبر إلهي محض، ليس للرسول، طريق إلى علمه إلا من جهة الوحي، ولهذا قال: { وَمَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ }\nأي: بجانب الطور الغربي وقت قضائنا لموسى الأمر { وَمَا كُنْتَ مِنَ الشَّاهِدِينَ } على ذلك، حتى يقال: إنه وصل إليك من هذا الطريق.\n                                    "
      },
      "originalText": "وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِيِّ إِذۡ قَضَيۡنَآ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّٰهِدِينَ ٤٤"
    },
    {
      "number": 3297,
      "text": "وَلَٰكِنَّا أَنْشَأْنَا قُرُونًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُ ۚ وَمَا كُنْتَ ثَاوِيًا فِي أَهْلِ مَدْيَنَ تَتْلُو عَلَيْهِمْ آيَاتِنَا وَلَٰكِنَّا كُنَّا مُرْسِلِينَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 45,
      "juz": 20,
      "manzil": 5,
      "page": 391,
      "ruku": 338,
      "hizbQuarter": 156,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَٰكِنَّآ أَنشَأۡنَا قُرُونٗا فَتَطَاوَلَ عَلَيۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِيٗا فِيٓ أَهۡلِ مَدۡيَنَ تَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرۡسِلِينَ ٥٤\n                                    \n                                    \n                                    ولكن الله سبحانه وتعالى أوحى إليك ذلك ، ليجعله حجة وبرهانا على قرون قد تطاول عهدها ، ونسوا حجج الله عليهم ، وما أوحاه إلى الأنبياء المتقدمين .\nوقوله : ( وما كنت ثاويا في أهل مدين تتلو عليهم آياتنا ) أي : وما كنت مقيما في أهل مدين تتلو عليهم آياتنا ، حين أخبرت عن نبيها شعيب ، وما قال لقومه ، وما ردوا عليه ، ( ولكنا كنا مرسلين ) أي : ولكن نحن أوحينا إليك ذلك ، وأرسلناك للناس رسولا .\n                                    ",
        "qortoby": "وَلَٰكِنَّآ أَنشَأۡنَا قُرُونٗا فَتَطَاوَلَ عَلَيۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِيٗا فِيٓ أَهۡلِ مَدۡيَنَ تَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرۡسِلِينَ ٥٤\n                                    \n                                    \n                                    ولكنا أنشأنا قرونا أي من بعد موسى فتطاول عليهم العمر حتى نسوا ذكر الله أي عهده وأمره . نظيره : فطال عليهم الأمد فقست قلوبهم . وظاهر هذا يوجب أن يكون جرى لنبينا عليه السلام ذكر في ذلك الوقت ، وأن الله سيبعثه ، ولكن طالت المدة ، وغلبت القسوة ، فنسي القوم ذلك وقيل : آتينا موسى الكتاب وأخذنا على قومه العهود ، ثم تطاول العهد فكفروا ، فأرسلنا محمدا مجددا للدين وداعيا الخلق إليه وما كنت ثاويا في أهل مدين أي مقيما كمقام موسى وشعيب بينهم قال العجاج :\nفبات حيث يدخل الثوي\nأي الضيف المقيم .\nتتلو عليهم آياتنا أي تذكرهم بالوعد والوعيد ( ولكنا كنا مرسلين ) أي أرسلناك في أهل مكة ، وآتيناك كتابا فيه هذه الأخبار ، ولولا ذلك لما علمتها .\n                                    ",
        "saadi": "وَلَٰكِنَّآ أَنشَأۡنَا قُرُونٗا فَتَطَاوَلَ عَلَيۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِيٗا فِيٓ أَهۡلِ مَدۡيَنَ تَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرۡسِلِينَ ٥٤\n                                        \n                                        \n                                        \n                                        { وَلَكِنَّا أَنْشَأْنَا قُرُونًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُ } فاندرس العلم، ونسيت آياته، فبعثناك في وقت اشتدت الحاجة إليك وإلى ما علمناك وأوحينا إليك. { وَمَا كُنْتَ ثَاوِيًا } أي: مقيما { فِي أَهْلِ مَدْيَنَ تَتْلُو عَلَيْهِمْ آيَاتِنَا } أي: تعلمهم وتتعلم منهم، حتى أخبرت بما أخبرت من شأن موسى في مدين، { وَلَكِنَّا كُنَّا مُرْسِلِينَ } أي: ولكن ذلك الخبر الذي جئت به عن موسى، أثر من آثار إرسالنا إياك، وَوَحْيٌ لا سبيل لك إلى علمه، بدون إرسالنا.\n                                    "
      },
      "originalText": "وَلَٰكِنَّآ أَنشَأۡنَا قُرُونٗا فَتَطَاوَلَ عَلَيۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِيٗا فِيٓ أَهۡلِ مَدۡيَنَ تَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرۡسِلِينَ ٥٤"
    },
    {
      "number": 3298,
      "text": "وَمَا كُنْتَ بِجَانِبِ الطُّورِ إِذْ نَادَيْنَا وَلَٰكِنْ رَحْمَةً مِنْ رَبِّكَ لِتُنْذِرَ قَوْمًا مَا أَتَاهُمْ مِنْ نَذِيرٍ مِنْ قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُونَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 46,
      "juz": 20,
      "manzil": 5,
      "page": 391,
      "ruku": 338,
      "hizbQuarter": 156,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَيۡنَا وَلَٰكِن رَّحۡمَةٗ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَتَذَكَّرُونَ ٦٤\n                                    \n                                    \n                                    وما كنت بجانب الطور إذ نادينا ) - قال أبو عبد الرحمن النسائي ، في التفسير من سننه : أخبرنا علي بن حجر ، أخبرنا عيسى - وهو ابن يونس - عن حمزة الزيات ، عن الأعمش ، عن علي بن مدرك ، عن أبي زرعة ، عن أبي هريرة ، رضي الله عنه ( وما كنت بجانب الطور إذ نادينا ) ، قال : نودوا : يا أمة محمد ، أعطيتكم قبل أن تسألوني ، وأجبتكم قبل أن تدعوني .\nوهكذا رواه ابن جرير وابن أبي حاتم ، من حديث جماعة ، عن حمزة - وهو ابن حبيب الزيات - عن الأعمش . ورواه ابن جرير من حديث وكيع ويحيى بن عيسى ، عن الأعمش ، عن علي بن مدرك ، عن أبي زرعة - وهو ابن عمرو بن جرير - أنه قال ذلك من كلامه ، والله أعلم .\nوقال مقاتل بن حيان : ( وما كنت بجانب الطور إذ نادينا ) : أمتك في أصلاب آبائهم أن يؤمنوا بك إذا بعثت .\nوقال قتادة : ( وما كنت بجانب الطور إذ نادينا ) موسى . وهذا - والله أعلم - أشبه بقوله تعالى : ( وما كنت بجانب الغربي إذ قضينا إلى موسى الأمر ) .\nثم أخبر هاهنا بصيغة أخرى أخص من ذلك ، وهو النداء ، كما قال تعالى : ( وإذ نادى ربك موسى ) [ الشعراء : 10 ] ، وقال : ( إذ ناداه ربه بالواد المقدس طوى ) [ النازعات : 16 ] ، وقال : ( وناديناه من جانب الطور الأيمن وقربناه نجيا ) [ مريم : 52 ] .\nوقوله : ( ولكن رحمة من ربك ) أي : ما كنت مشاهدا لشيء من ذلك ، ولكن الله أوحاه إليك وأخبرك به ، رحمة منه لك وبالعباد بإرسالك إليهم ، ( لتنذر قوما ما أتاهم من نذير من قبلك لعلهم يتذكرون ) أي : لعلهم يهتدون بما جئتهم به من الله عز وجل .\n                                    ",
        "qortoby": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَيۡنَا وَلَٰكِن رَّحۡمَةٗ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَتَذَكَّرُونَ ٦٤\n                                    \n                                    \n                                    قوله تعالى : وما كنت بجانب الطور إذ نادينا أي كما لم تحضر جانب المكان الغربي إذ أرسل الله موسى إلى فرعون ، فكذلك لم تحضر جانب الطور إذ نادينا موسى لما أتى الميقات مع السبعين . وروى عمرو بن دينار يرفعه قال : نودي يا أمة محمد أجبتكم قبل أن تدعوني وأعطيتكم قبل أن تسألوني . فذلك قوله : وما كنت بجانب الطور إذ نادينا وقال أبو هريرة - وفي رواية عن ابن عباس - إن الله قال : \" يا أمة محمد قد أجبتكم قبل أن تدعوني وأعطيتكم قبل أن تسألوني وغفرت لكم قبل أن تستغفروني ورحمتكم قبل أن تسترحموني \" قال وهب : وذلك أن موسى لما ذكر الله له فضل محمد وأمته قال : يا رب أرنيهم فقال الله : \" إنك لن تدركهم لئن شئت ناديتهم فأسمعتك صوتهم \" قال : بلى يا رب فقال الله تعالى : \" يا أمة محمد \" فأجابوا من أصلاب آبائهم فقال : \" قد أجبتكم قبل أن تدعوني \" ومعنى الآية على هذا : ما كنت بجانب الطور إذ كلمنا موسى فنادينا أمتك وأخبرناه بما كتبناه لك ولأمتك من الرحمة إلى آخر الدنيا ولكن فعلنا ذلك رحمة منا بكم . قال الأخفش : ( رحمة ) نصب على المصدر أي ولكن رحمناك رحمة ، وقال الزجاج : هو مفعول من أجله أي فعل ذلك بك لأجل الرحمة . النحاس : أي لم تشهد قصص الأنبياء ، ولا تليت عليك ، ولكنا بعثناك وأوحيناها إليك للرحمة ، وقال الكسائي : على خبر كان ; التقدير : ولكن كان رحمة . قال : ويجوز الرفع بمعنى هي رحمة الزجاج : الرفع بمعنى : ولكن فعل ذلك رحمة . لتنذر قوما ما أتاهم من نذير من قبلك يعني العرب أي لم تشاهد تلك الأخبار ، ولكن أوحيناها إليك رحمة بمن أرسلت إليهم لتنذرهم بها لعلهم يتذكرون .\n                                    ",
        "saadi": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَيۡنَا وَلَٰكِن رَّحۡمَةٗ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَتَذَكَّرُونَ ٦٤\n                                        \n                                        \n                                        \n                                        { وَمَا كُنْتَ بِجَانِبِ الطُّورِ إِذْ نَادَيْنَا } موسى، وَأمرناه أن يأتي القوم الظالمين، ويبلغهم رسالتنا، ويريهم من آياتنا وعجائبنا ما قصصنا عليك. والمقصود: أن الماجريات، التي جرت لموسى عليه الصلاة والسلام في هذه الأماكن، فقصصتها كما هي، من غير زيادة ولا نقص، لا يخلو من أحد أمرين.\nإما أن تكون حضرتها وشاهدتها، أو ذهبت إلى محالِّها فتعلمتها من أهلها، فحينئذ قد لا يدل ذلك على أنك رسول اللّه، إذ الأمور التي يخبر بها عن شهادة ودراسة، من الأمور المشتركة غير المختصة بالأنبياء، ولكن هذا قد عُلِمَ وتُيُقِّن أنه ما كان وما صار، فأولياؤك وأعداؤك يعلمون عدم ذلك.\nفتعين الأمر الثاني، وهو: أن هذا جاءك من قِبَلِ اللّه ووحيه وإرساله، فثبت بالدليل القطعي، صحة رسالتك، ورحمة اللّه بك للعباد، ولهذا قال: { وَلَكِنْ رَحْمَةً مِنْ رَبِّكَ لِتُنْذِرَ قَوْمًا مَا أَتَاهُمْ مِنْ نَذِيرٍ مِنْ قَبْلِكَ } أي: العرب، وقريش، فإن الرسالة [عندهم] لا تعرف وقت إرسال الرسول وقبله بأزمان متطاولة، { لَعَلَّهُمْ يَتَذَكَّرُونَ } تفصيل الخير فيفعلونه، والشر فيتركونه، فإذا كنت بهذه المنزلة، كان الواجب عليهم، المبادرة إلى الإيمان بك، وشكر هذه النعمة، التي لا يقادر قدرها، ولا يدرك شكرها.\nوإنذاره للعرب لا ينفي أن يكون مرسلا لغيرهم، فإنه عربي، والقرآن الذي أنزل عليه عربي، وأول من باشر بدعوته العرب، فكانت رسالته إليهم أصلا، ولغيرهم تبعا، كما قال تعالى { أَكَانَ لِلنَّاسِ عَجَبًا أَنْ أَوْحَيْنَا إِلَى رَجُلٍ مِنْهُمْ أَنْ أَنْذِرِ النَّاسَ } { قُلْ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا }\n                                    "
      },
      "originalText": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَيۡنَا وَلَٰكِن رَّحۡمَةٗ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَتَذَكَّرُونَ ٦٤"
    },
    {
      "number": 3299,
      "text": "وَلَوْلَا أَنْ تُصِيبَهُمْ مُصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَيَقُولُوا رَبَّنَا لَوْلَا أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ آيَاتِكَ وَنَكُونَ مِنَ الْمُؤْمِنِينَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 47,
      "juz": 20,
      "manzil": 5,
      "page": 391,
      "ruku": 338,
      "hizbQuarter": 156,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡلَآ أَن تُصِيبَهُم مُّصِيبَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَيَقُولُواْ رَبَّنَا لَوۡلَآ أَرۡسَلۡتَ إِلَيۡنَا رَسُولٗا فَنَتَّبِعَ ءَايَٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ ٧٤\n                                    \n                                    \n                                    ( ولولا أن تصيبهم مصيبة بما قدمت أيديهم فيقولوا ربنا لولا أرسلت إلينا رسولا فنتبع آياتك ونكون من المؤمنين ) أي : وأرسلناك إليهم لتقيم عليهم الحجة ولتقطع عذرهم إذا جاءهم عذاب من الله بكفرهم ، فيحتجوا بأنهم لم يأتهم رسول ولا نذير ، كما قال تعالى بعد ذكره إنزال كتابه المبارك وهو القرآن : ( أن تقولوا إنما أنزل الكتاب على طائفتين من قبلنا وإن كنا عن دراستهم لغافلين أو تقولوا لو أنا أنزل علينا الكتاب لكنا أهدى منهم فقد جاءكم بينة من ربكم وهدى ورحمة ) [ الأنعام : 156 ، 157 ] ، وقال : ( رسلا مبشرين ومنذرين لئلا يكون للناس على الله حجة بعد الرسل ) [ النساء : 165 ] ، وقال تعالى : ( يا أهل الكتاب قد جاءكم رسولنا يبين لكم على فترة من الرسل أن تقولوا ما جاءنا من بشير ولا نذير فقد جاءكم بشير ونذير والله على كل شيء قدير ) [ المائدة : 19 ] ، والآيات في هذا كثيرة [ والله أعلم ] .\n                                    ",
        "qortoby": "وَلَوۡلَآ أَن تُصِيبَهُم مُّصِيبَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَيَقُولُواْ رَبَّنَا لَوۡلَآ أَرۡسَلۡتَ إِلَيۡنَا رَسُولٗا فَنَتَّبِعَ ءَايَٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ ٧٤\n                                    \n                                    \n                                    قوله تعالى : ولولا أن تصيبهم يريد قريشا . وقيل : اليهود مصيبة أي عقوبة ونقمة . بما قدمت أيديهم من الكفر والمعاصي وخص الأيدي بالذكر ; لأن الغالب من الكسب إنما يقع بها وجواب ( لولا ) محذوف أي لولا أن يصيبهم عذاب بسبب معاصيهم المتقدمة فيقولوا ربنا لولا أي هلا أرسلت إلينا رسولا لما بعثنا الرسل . وقيل : لعاجلناهم بالعقوبة . وبعث الرسل إزاحة لعذر الكفار كما تقدم في ( سبحان ) وآخر ( طه ) . فنتبع آياتك نصب على جواب التحضيض . ونكون عطف عليه من المؤمنين من المصدقين . وقد احتج بهذه الآية من قال : إن العقل يوجب الإيمان والشكر ; لأنه قال : بما قدمت أيديهم وذلك موجب للعقاب ، إذ تقرر الوجوب قبل بعثه الرسل ، وإنما يكون ذلك بالعقل . قال القشيري : والصحيح أن المحذوف لولا كذا لما احتيج إلى تجديد الرسل ; أي هؤلاء الكفار غير معذورين إذ بلغتهم الشرائع السابقة والدعاء إلى التوحيد ، ولكن تطاول العهد ، فلو عذبناهم فقد يقول قائل منهم : طال العهد بالرسل ، ويظن أن ذلك عذر ولا عذر لهم بعد أن بلغهم خبر الرسل ، ولكن أكملنا إزاحة العذر ، وأكملنا البيان فبعثناك يا محمد إليهم وقد حكم الله بأنه لا يعاقب عبدا إلا بعد إكمال البيان والحجة وبعثة الرسل .\n                                    ",
        "saadi": "وَلَوۡلَآ أَن تُصِيبَهُم مُّصِيبَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَيَقُولُواْ رَبَّنَا لَوۡلَآ أَرۡسَلۡتَ إِلَيۡنَا رَسُولٗا فَنَتَّبِعَ ءَايَٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ ٧٤\n                                        \n                                        \n                                        \n                                        { وَلَوْلَا أَنْ تُصِيبَهُمْ مُصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ } من الكفر والمعاصي { فَيَقُولُوا رَبَّنَا لَوْلَا أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ آيَاتِكَ وَنَكُونَ مِنَ الْمُؤْمِنِينَ } أي: فأرسلناك يا محمد، لدفع حجتهم، وقطع مقالتهم.\n                                    "
      },
      "originalText": "وَلَوۡلَآ أَن تُصِيبَهُم مُّصِيبَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَيَقُولُواْ رَبَّنَا لَوۡلَآ أَرۡسَلۡتَ إِلَيۡنَا رَسُولٗا فَنَتَّبِعَ ءَايَٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ ٧٤"
    },
    {
      "number": 3300,
      "text": "فَلَمَّا جَاءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوا لَوْلَا أُوتِيَ مِثْلَ مَا أُوتِيَ مُوسَىٰ ۚ أَوَلَمْ يَكْفُرُوا بِمَا أُوتِيَ مُوسَىٰ مِنْ قَبْلُ ۖ قَالُوا سِحْرَانِ تَظَاهَرَا وَقَالُوا إِنَّا بِكُلٍّ كَافِرُونَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 48,
      "juz": 20,
      "manzil": 5,
      "page": 391,
      "ruku": 338,
      "hizbQuarter": 156,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُواْ لَوۡلَآ أُوتِيَ مِثۡلَ مَآ أُوتِيَ مُوسَىٰٓۚ أَوَ لَمۡ يَكۡفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبۡلُۖ قَالُواْ سِحۡرَانِ تَظَٰهَرَا وَقَالُوٓاْ إِنَّا بِكُلّٖ كَٰفِرُونَ ٨٤\n                                    \n                                    \n                                    قول تعالى مخبرا عن القوم الذين لو عذبهم قبل قيام الحجة عليهم ، لاحتجوا بأنهم لم يأتهم رسول : أنهم لما جاءهم الحق من عنده على لسان محمد ، صلوات الله وسلامه عليه قالوا على وجه التعنت والعناد والكفر والجهل والإلحاد : ( لولا أوتي مثل ما أوتي موسى أولم يكفروا بما أوتي موسى من قبل ) ، يعنون - والله أعلم - : من الآيات الكثيرة ، مثل العصا واليد ، والطوفان والجراد والقمل والضفادع والدم ، وتنقص الزروع والثمار ، مما يضيق على أعداء الله ، وكفلق البحر ، وتظليل الغمام ، وإنزال المن والسلوى ، إلى غير ذلك من الآيات الباهرة ، والحجج القاهرة ، التي أجراها الله على يدي موسى عليه السلام ، حجة وبراهين له على فرعون وملئه وبني إسرائيل ، ومع هذا كله لم ينجع في فرعون وملئه ، بل كفروا بموسى وأخيه هارون ، كما قالوا لهما : ( أجئتنا لتلفتنا عما وجدنا عليه آباءنا وتكون لكما الكبرياء في الأرض وما نحن لكما بمؤمنين ) [ يونس : 78 ] ، وقال تعالى : ( فكذبوهما فكانوا من المهلكين ) [ المؤمنون : 48 ] . ولهذا قال هاهنا : ( أولم يكفروا بما أوتي موسى من قبل ) أي : أولم يكفر البشر بما أوتي موسى من تلك الآيات العظيمة . ( قالوا سحران تظاهرا ، ) ، أي تعاونا ، ( وقالوا إنا بكل كافرون ) أي : بكل منهما كافرون . ولشدة التلازم والتصاحب والمقارنة بين موسى وهارون ، دل ذكر أحدهما على الآخر ، كما قال الشاعر :\nفما أدري إذا يممت أرضا أريد الخير أيهما يليني\nأي : فما أدري أيليني الخير أو الشر . قال مجاهد بن جبر : أمرت اليهود قريشا ا أن يقولوا لمحمد - صلى الله عليه وسلم - ذلك ، فقال الله : ( أولم يكفروا بما أوتي موسى من قبل قالوا سحران تظاهرا ) قال : يعني موسى وهارون - صلى الله عليه وسلم - ( تظاهرا ) أي : تعاونا وتناصرا وصدق كل منهما الآخر . وبهذا قال سعيد بن جبير وأبو رزين في قوله : ( ساحران ) يعنون : موسى وهارون . وهذا قول جيد قوي ، والله أعلم .\nوقال مسلم بن يسار ، عن ابن عباس ) قالوا ساحران تظاهرا ) يعني : موسى ومحمدا ، صلوات الله وسلامه عليهما وهذا رواية عن الحسن البصري .\nوقال الحسن وقتادة : يعني : عيسى ومحمدا ، صلى الله عليهما وسلم ، وهذا فيه بعد ; لأن عيسى لم يجر له ذكر هاهنا ، والله أعلم .\nوأما من قرأ ( سحران تظاهرا ) ، فقال علي بن أبي طلحة والعوفي ، عن ابن عباس . يعنون : التوراة والقرآن . وكذا قال عاصم الجندي ، والسدي ، وعبد الرحمن بن زيد بن أسلم ، قال السدي : يعني صدق كل واحد منهما الآخر .\nوقال عكرمة : يعنون : التوراة والإنجيل . وهو رواية عن أبي زرعة ، واختاره ابن جرير .\nوقال الضحاك وقتادة : الإنجيل والقرآن . والله سبحانه ، أعلم بالصواب . والظاهر على قراءة : ( سحران ) أنهم يعنون : التوراة والقرآن ; لأنه قال بعده : ( قل فأتوا بكتاب من عند الله هو أهدى منهما أتبعه ) ، وكثيرا ما يقرن الله بين التوراة والقرآن ، كما في قوله تعالى ( قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس ) إلى أن قال : ( وهذا كتاب أنزلناه مبارك ) [ الأنعام : 91 ، 92 ] ،\nوقال في آخر السورة : ( ثم آتينا موسى الكتاب تماما على الذي أحسن ) ، إلى أن قال : ( وهذا كتاب أنزلناه مبارك فاتبعوه واتقوا لعلكم ترحمون ) [ الأنعام : 155 ] ، وقالت الجن : ( إنا سمعنا كتابا أنزل من بعد موسى [ مصدقا لما بين يديه ] ) [ الأحقاف : 30 ] وقال ورقة بن نوفل : هذا الناموس الذي أنزل [ الله ] على موسى . وقد علم بالضرورة لذوي الألباب أن الله لم ينزل كتابا من السماء فيما أنزل من الكتب المتعددة على أنبيائه أكمل ولا أشمل ولا أفصح ولا أعظم ولا أشرف من الكتاب الذي أنزل على محمد - صلى الله عليه وسلم - وهو القرآن ، وبعده في الشرف والعظمة الكتاب الذي أنزله على موسى بن عمران ، عليه السلام ، وهو التوراة التي قال الله تعالى فيها : ( إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا للذين هادوا والربانيون والأحبار بما استحفظوا من كتاب الله وكانوا عليه شهداء ) [ المائدة : 44 ] . والإنجيل إنما نزل متمما للتوراة ومحلا لبعض ما حرم على بني إسرائيل .\n                                    ",
        "qortoby": "فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُواْ لَوۡلَآ أُوتِيَ مِثۡلَ مَآ أُوتِيَ مُوسَىٰٓۚ أَوَ لَمۡ يَكۡفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبۡلُۖ قَالُواْ سِحۡرَانِ تَظَٰهَرَا وَقَالُوٓاْ إِنَّا بِكُلّٖ كَٰفِرُونَ ٨٤\n                                    \n                                    \n                                    قوله تعالى : فلما جاءهم الحق من عندنا يعني محمدا صلى الله عليه وسلم قالوا يعني كفار مكة ( لولا ) أي هلا أوتي مثل ما أوتي موسى من العصا واليد البيضاء ، وأنزل عليه القرآن جملة واحدة كالتوراة ، وكان بلغهم ذلك من أمر موسى قبل محمد ; فقال الله تعالى : ( أولم يكفروا بما أوتي موسى من قبل قالوا ساحران تظاهرا ) أي موسى ومحمد تعاونا على السحر وقال الكلبي : بعثت قريش إلى اليهود وسألوهم عن بعث محمد وشأنه فقالوا : إنا نجده في التوراة بنعته وصفته فلما رجع الجواب إليهم ( قالوا ساحران تظاهرا ) وقال قوم : إن اليهود علموا المشركين ، وقالوا قولوا لمحمد لولا أوتيت مثل ما أوتي موسى ، فإنه أوتي التوراة دفعة واحدة فهذا الاحتجاج وارد على اليهود ، أي أولم يكفر هؤلاء اليهود بما أوتي موسى حين قالوا في موسى وهارون هما ساحران وإنا بكل كافرون أي وإنا كافرون بكل واحد منهما . وقرأ الكوفيون : ( سحران ) بغير ألف ، أي الإنجيل والقرآن وقيل : التوراة والفرقان ; قاله الفراء وقيل : التوراة والإنجيل ، قاله أبو رزين . الباقون ( ساحران ) بألف وفيه ثلاثة أقاويل : أحدها : موسى ومحمد عليهما السلام ، وهذا قول مشركي العرب . وبه قال ابن عباس والحسن . الثاني : موسى وهارون وهذا قول اليهود لهما في ابتداء الرسالة . وبه قال سعيد بن جبير ومجاهد وابن زيد فيكون الكلام احتجاجا عليهم . وهذا يدل على أن المحذوف في قوله : ولولا أن تصيبهم مصيبة لما جددنا بعثة الرسل ، لأن اليهود اعترفوا بالنبوات ولكنهم حرفوا وغيروا واستحقوا العقاب ، فقال : قد أكملنا إزاحة عذرهم ببعثة محمد صلى الله عليه وسلم . الثالث : عيسى ومحمد صلى الله عليهما وسلم ، وهذا قول اليهود اليوم ، وبه قال قتادة . وقيل : أولم يكفر جميع اليهود بما أوتي موسى في التوراة من ذكر المسيح ، وذكر الإنجيل والقرآن ، فرأوا موسى ومحمدا ساحرين والكتابين سحرين .\n                                    ",
        "saadi": "فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُواْ لَوۡلَآ أُوتِيَ مِثۡلَ مَآ أُوتِيَ مُوسَىٰٓۚ أَوَ لَمۡ يَكۡفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبۡلُۖ قَالُواْ سِحۡرَانِ تَظَٰهَرَا وَقَالُوٓاْ إِنَّا بِكُلّٖ كَٰفِرُونَ ٨٤\n                                        \n                                        \n                                        \n                                        { فَلَمَّا جَاءَهُمُ الْحَقُّ } الذي لا شك فيه { مِنْ عِنْدِنَا } وهو القرآن، الذي أوحيناه إليك { قَالُوا } مكذبين له، ومعترضين بما ليس يعترض به: { لَوْلَا أُوتِيَ مِثْلَ مَا أُوتِيَ مُوسَى } أي: أنزل عليه كتاب من السماء جملة واحدة. أي: فأما ما دام ينزل متفرقا، فإنه ليس من عند اللّه. وأي: دليل في هذا؟ وأي: شبهة أنه ليس من عند اللّه، حين نزل مفرقا ؟\nبل من كمال هذا القرآن، واعتناء اللّه بمن أنزل عليه، أن نزل متفرقا، ليثبت اللّه به فؤاد رسوله، ويحصل زيادة الإيمان للمؤمنين { وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا } وأيضا، فإن قياسهم على كتاب موسى، قياس قد نقضوه، فكيف يقيسونه على كتاب كفروا به ولم يؤمنوا؟ ولهذا قال { أَوَلَمْ يَكْفُرُوا بِمَا أُوتِيَ مُوسَى مِنْ قَبْلُ قَالُوا سِحْرَانِ تَظَاهَرَا } أي: القرآن والتوراة، تعاونا في سحرهما، وإضلال الناس { وَقَالُوا إِنَّا بِكُلٍّ كَافِرُونَ } فثبت بهذا أن القوم يريدون إبطال الحق بما ليس ببرهان، وينقضونه بما لا ينقض، ويقولون الأقوال المتناقضة المختلفة، وهذا شأن كل كافر. ولهذا صرح أنهم كفروا بالكتابين والرسولين، ولكن هل كفرهم بهما كان طلبا للحق، واتباعا لأمر عندهم خير منهما، أم مجرد هوى ؟.\n                                    "
      },
      "originalText": "فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُواْ لَوۡلَآ أُوتِيَ مِثۡلَ مَآ أُوتِيَ مُوسَىٰٓۚ أَوَ لَمۡ يَكۡفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبۡلُۖ قَالُواْ سِحۡرَانِ تَظَٰهَرَا وَقَالُوٓاْ إِنَّا بِكُلّٖ كَٰفِرُونَ ٨٤"
    },
    {
      "number": 3301,
      "text": "قُلْ فَأْتُوا بِكِتَابٍ مِنْ عِنْدِ اللَّهِ هُوَ أَهْدَىٰ مِنْهُمَا أَتَّبِعْهُ إِنْ كُنْتُمْ صَادِقِينَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 49,
      "juz": 20,
      "manzil": 5,
      "page": 391,
      "ruku": 338,
      "hizbQuarter": 156,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ فَأۡتُواْ بِكِتَٰبٖ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَآ أَتَّبِعۡهُ إِن كُنتُمۡ صَٰدِقِينَ ٩٤\n                                    \n                                    \n                                    ولهذا قال تعالى : ( قل فأتوا بكتاب من عند الله هو أهدى منهما أتبعه إن كنتم صادقين ) أي : فيما تدافعون به الحق وتعارضون به من الباطل .\n                                    ",
        "qortoby": "قُلۡ فَأۡتُواْ بِكِتَٰبٖ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَآ أَتَّبِعۡهُ إِن كُنتُمۡ صَٰدِقِينَ ٩٤\n                                    \n                                    \n                                    قوله تعالى : قل فأتوا بكتاب من عند الله هو أهدى منهما أتبعه أي قل يا محمد إذ كفرتم معاشر المشركين بهذين الكتابين فأتوا بكتاب من عند الله هو أهدى منهما أتبعه ليكون ذلك عذرا لكم في الكفر إن كنتم صادقين في أنهما سحران . أو فأتوا بكتاب هو أهدى من كتابي موسى ومحمد عليهما السلام . وهذا يقوي قراءة الكوفيين ( سحران ) . أتبعه . قال الفراء : بالرفع ; لأنه صفة للكتاب وكتاب نكرة . قال : وإذا جزمت - وهو الوجه - فعلى الشرط .\n                                    ",
        "saadi": "قُلۡ فَأۡتُواْ بِكِتَٰبٖ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَآ أَتَّبِعۡهُ إِن كُنتُمۡ صَٰدِقِينَ ٩٤\n                                        \n                                        \n                                        \n                                        قال تعالى ملزما لهم بذلك: { فَأْتُوا بِكِتَابٍ مِنْ عِنْدِ اللَّهِ هُوَ أَهْدَى مِنْهُمَا } أي: من التوراة والقرآن { أَتَّبِعْهُ إِنْ كُنْتُمْ صَادِقِينَ } ولا سبيل لهم ولا لغيرهم أن يأتوا بمثلهما، فإنه ما طرق العالم منذ خلقه اللّه، مثل هذين الكتابين، علما وهدى، وبيانا، ورحمة للخلق، وهذا من كمال الإنصاف من الداعي أن قال: أنا مقصودي الحق والهدى والرشد، وقد جئتكم بهذا الكتاب المشتمل على ذلك، الموافق لكتاب موسى، فيجب علينا جميعا الإذعان لهما واتباعهما، من حيث كونهما هدى وحقا، فإن جئتموني بكتاب من عند اللّه هو أهدى منهما اتبعته، وإلا، فلا أترك هدى وحقا قد علمته لغير هدى وحق .\n                                    "
      },
      "originalText": "قُلۡ فَأۡتُواْ بِكِتَٰبٖ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَآ أَتَّبِعۡهُ إِن كُنتُمۡ صَٰدِقِينَ ٩٤"
    },
    {
      "number": 3302,
      "text": "فَإِنْ لَمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ ۚ وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِنَ اللَّهِ ۚ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 50,
      "juz": 20,
      "manzil": 5,
      "page": 391,
      "ruku": 338,
      "hizbQuarter": 156,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِن لَّمۡ يَسۡتَجِيبُواْ لَكَ فَٱعۡلَمۡ أَنَّمَا يَتَّبِعُونَ أَهۡوَآءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيۡرِ هُدٗى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٠٥\n                                    \n                                    \n                                    قال الله تعالى : ( فإن لم يستجيبوا لك ) أي : فإن لم يجيبوك عما قلت لهم ولم يتبعوا الحق ( فاعلم أنما يتبعون أهواءهم ) أي : بلا دليل ولا حجة ( ومن أضل ممن اتبع هواه بغير هدى من الله ) أي : بغير حجة مأخوذة من كتاب الله ، ( إن الله لا يهدي القوم الظالمين ) .\n                                    ",
        "qortoby": "فَإِن لَّمۡ يَسۡتَجِيبُواْ لَكَ فَٱعۡلَمۡ أَنَّمَا يَتَّبِعُونَ أَهۡوَآءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيۡرِ هُدٗى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٠٥\n                                    \n                                    \n                                    قوله تعالى : فإن لم يستجيبوا لك يا محمد بأن يأتوا بكتاب من عند الله فاعلم أنما يتبعون أهواءهم أي آراء قلوبهم وما يستحسنونه ويحببه لهم الشيطان ، وإنه لا حجة لهم .\nومن أضل ممن اتبع هواه بغير هدى من الله أي لا أحد أضل منه إن الله لا يهدي القوم الظالمين .\n                                    ",
        "saadi": "فَإِن لَّمۡ يَسۡتَجِيبُواْ لَكَ فَٱعۡلَمۡ أَنَّمَا يَتَّبِعُونَ أَهۡوَآءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيۡرِ هُدٗى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٠٥\n                                        \n                                        \n                                        \n                                        فَإِنْ لَمْ يَسْتَجِيبُوا لَكَ } فلم يأتوا بكتاب أهدى منهما { فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ } أي: فاعلم أن تركهم اتباعك، ليسوا ذاهبين إلى حق يعرفونه، ولا إلى هدى، وإنما ذلك مجرد اتباع لأهوائهم. { وَمَنْ أَضَلُّ مِمَّنَ اتَّبَعَ هَوَاهُ بِغَيْرِ هُدًى مِنَ اللَّهِ } فهذا من أضل الناس، حيث عرض عليه الهدى، والصراط المستقيم، الموصل إلى اللّه وإلى دار كرامته، فلم يلتفت إليه ولم يقبل عليه، ودعاه هواه إلى سلوك الطرق الموصلة إلى الهلاك والشقاء فاتبعه وترك الهدى، فهل أحد أضل ممن هذا وصفه؟\" ولكن ظلمه وعدوانه، وعدم محبته للحق، هو الذي أوجب له: أن يبقى على ضلاله ولا يهديه اللّه، فلهذا قال: { إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ } أي: الذين صار الظلم لهم وصفا والعناد لهم نعتا، جاءهم الهدى فرفضوه، وعرض لهم الهوى، فتبعوه، سدوا على أنفسهم أبواب الهداية وطرقها، وفتحوا عليهم أبواب الغواية وسبلها، فهم في غيهم وظلمهم يعمهون، وفي شقائهم وهلاكهم يترددون.\nوفي قوله: { فَإِنْ لَمْ يَسْتَجِيبُوا لَكَ فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَاءَهُمْ } دليل على أن كل من لم يستجب للرسول، وذهب إلى قول مخالف لقول الرسول، فإنه لم يذهب إلى هدى، وإنما ذهب إلى هوى.\n                                    "
      },
      "originalText": "فَإِن لَّمۡ يَسۡتَجِيبُواْ لَكَ فَٱعۡلَمۡ أَنَّمَا يَتَّبِعُونَ أَهۡوَآءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَيۡرِ هُدٗى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٠٥"
    }
  ]
}