{
  "number": 395,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 3330,
      "text": "قَالَ إِنَّمَا أُوتِيتُهُ عَلَىٰ عِلْمٍ عِنْدِي ۚ أَوَلَمْ يَعْلَمْ أَنَّ اللَّهَ قَدْ أَهْلَكَ مِنْ قَبْلِهِ مِنَ الْقُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً وَأَكْثَرُ جَمْعًا ۚ وَلَا يُسْأَلُ عَنْ ذُنُوبِهِمُ الْمُجْرِمُونَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 78,
      "juz": 20,
      "manzil": 5,
      "page": 395,
      "ruku": 341,
      "hizbQuarter": 158,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمٍ عِندِيٓۚ أَوَ لَمۡ يَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةٗ وَأَكۡثَرُ جَمۡعٗاۚ وَلَا يُسۡ‍َٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ ٨٧\n                                    \n                                    \n                                    يقول تعالى مخبرا عن جواب قارون لقومه ، حين نصحوه وأرشدوه إلى الخير ( قال إنما أوتيته على علم عندي ) أي : أنا لا أفتقر إلى ما تقولون ، فإن الله تعالى إنما أعطاني هذا المال لعلمه بأني أستحقه ، ولمحبته لي فتقديره : إنما أعطيته لعلم الله في أني أهل له ، وهذا كقوله تعالى : ( فإذا مس الإنسان ضر دعانا ثم إذا خولناه نعمة منا قال إنما أوتيته على علم ) [ الزمر : 49 ] أي : على علم من الله بي ، وكقوله تعالى : ( ولئن أذقناه رحمة منا من بعد ضراء مسته ليقولن هذا لي ) [ فصلت : 50 ] أي : هذا أستحقه .\nوقد روي عن بعضهم أنه أراد : ( إنما أوتيته على علم عندي ) أي : إنه كان يعاني علم الكيمياء : وهذا القول ضعيف ; لأن علم الكيمياء في نفسه علم باطل ; لأن قلب الأعيان لا يقدر أحد عليها إلا الله عز وجل ، قال الله : ( يا أيها الناس ضرب مثل فاستمعوا له إن الذين تدعون من دون الله لن يخلقوا ذبابا ولو اجتمعوا له ) [ الحج : 73 ] ، وفي الصحيح عن النبي - صلى الله عليه وسلم - أنه قال : \" يقول الله تعالى : ومن أظلم ممن ذهب يخلق كخلقي ، فليخلقوا ذرة ، فليخلقوا شعيرة \" . وهذا ورد في المصورين الذين يشبهون بخلق الله في مجرد الصورة الظاهرة أو الشكل ، فكيف بمن يدعي أنه يحيل ماهية هذه الذات إلى ماهية ذات أخرى ، هذا زور ومحال ، وجهل وضلال . وإنما يقدرون على الصبغ في الصورة الظاهرة ، وهو كذب وزغل وتمويه ، وترويج أنه صحيح في نفس الأمر ، وليس كذلك قطعا لا محالة ، ولم يثبت بطريق شرعي أنه صح مع أحد من الناس من هذه الطريقة التي يتعاناها هؤلاء الجهلة الفسقة الأفاكون فأما ما يجريه الله تعالى من خرق العوائد على يدي بعض الأولياء من قلب بعض الأعيان ذهبا أو فضة أو نحو ذلك ، فهذا أمر لا ينكره مسلم ، ولا يرده مؤمن ، ولكن هذا ليس من قبيل الصناعات وإنما هذا عن مشيئة رب الأرض والسموات ، واختياره وفعله ، كما روي عن حيوة بن شريح المصري ، رحمه الله ، أنه سأله سائل ، فلم يكن عنده ما يعطيه ، ورأى ضرورته ، فأخذ حصاة من الأرض فأجالها في كفه ، ثم ألقاها إلى ذلك السائل فإذا هي ذهب أحمر . والأحاديث والآثار [ في هذا ] كثيرة جدا يطول ذكرها .\nوقال بعضهم : إن قارون كان يعلم الاسم الأعظم ، فدعا الله به ، فتمول بسببه ، والصحيح المعنى الأول ; ولهذا قال الله تعالى - رادا عليه فيما ادعاه من اعتناء الله به فيما أعطاه من المال ( أولم يعلم أن الله قد أهلك من قبله من القرون من هو أشد منه قوة وأكثر جمعا ) أي : قد كان من هو أكثر منه مالا وما كان ذلك عن محبة منا له ، وقد أهلكهم الله مع ذلك بكفرهم وعدم شكرهم ; ولهذا قال : ( ولا يسأل عن ذنوبهم المجرمون ) أي : لكثرة ذنوبهم .\nقال قتادة : ( على علم عندي ) : على خير عندي .\nوقال السدي : على علم أني أهل لذلك .\nوقد أجاد في تفسير هذه الآية الإمام عبد الرحمن بن زيد بن أسلم ، فإنه قال في قوله : ( قال إنما أوتيته على علم عندي ) قال : لولا رضا الله عني ، ومعرفته بفضلي ما أعطاني هذا المال ، وقرأ ( أولم يعلم أن الله قد أهلك من قبله من القرون من هو أشد منه قوة وأكثر جمعا ولا يسأل عن ذنوبهم المجرمون ) [ وهكذا يقول من قل علمه إذا رأى من وسع الله عليه يقول : لولا أنه يستحق ذلك لما أعطي ] .\n                                    ",
        "qortoby": "قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمٍ عِندِيٓۚ أَوَ لَمۡ يَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةٗ وَأَكۡثَرُ جَمۡعٗاۚ وَلَا يُسۡ‍َٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ ٨٧\n                                    \n                                    \n                                    قوله تعالى : قال إنما أوتيته على علم عندي يعني علم التوراة . وكان فيما روي من أقرأ الناس لها . ومن أعلمهم بها وكان أحد العلماء السبعين الذي اختارهم موسى للميقات . وقال ابن زيد : أي إنما أوتيته لعلمه بفضلي ورضاه عني . فقوله : عندي معناه إن عندي أن الله تعالى آتاني هذه الكنوز على علم منه باستحقاقي إياها لفضل في وقيل : أوتيته على علم من عندي بوجوه التجارة والمكاسب ; قاله علي بن عيسى . ولم يعلم أن الله لو لم يسهل له اكتسابها لما اجتمعت عنده . وقال ابن عباس : على علم عندي بصنعة الذهب وأشار إلى علم الكيمياء . وحكى النقاش : أن موسى عليه السلام علمه الثلث من صنعة الكيمياء ، ويوشع الثلث ، وهارون الثلث ، فخدعهما قارون - وكان على إيمانه - حتى علم ما عندهما وعمل الكيمياء ، فكثرت أمواله . وقيل : إن موسى علم الكيمياء ثلاثة ; يوشع بن نون ، وكالب بن يوفنا ، وقارون ، واختار الزجاج القول الأول ، وأنكر قول من قال إنه يعمل الكيمياء ; قال : لأن الكيمياء باطل لا حقيقة له . وقيل : إن موسى علم أخته علم الكيمياء ، وكانت زوجة قارون وعلمت أخت موسى قارون ; والله أعلم .\nقوله تعالى : أولم يعلم أن الله قد أهلك من قبله أي بالعذاب من القرون أي الأمم الخالية الكافرة من هو أشد منه قوة وأكثر جمعا أي للمال ، ولو كان المال يدل على فضل لما أهلكهم ، وقيل : القوة الآلات ، والجمع الأعوان والأنصار ، والكلام خرج مخرج التقريع من الله تعالى لقارون ; أي أولم يعلم قارون أن الله قد أهلك من قبله من القرون . ولا يسأل عن ذنوبهم المجرمون أي لا يسألون سؤال استعتاب كما قال : ولا هم يستعتبون فما هم من المعتبين وإنما يسألون سؤال تقريع وتوبيخ لقوله : فوربك لنسألنهم أجمعين قاله الحسن . وقال مجاهد : لا تسأل الملائكة غدا عن المجرمين ، فإنهم يعرفون بسيماهم ، فإنهم يحشرون سود الوجوه زرق العيون وقال قتادة : لا يسأل المجرمون عن ذنوبهم لظهورها وكثرتها ، بل يدخلون النار بلا حساب . وقيل : لا يسأل مجرمو هذه الأمة عن ذنوب الأمم الخالية الذين عذبوا في الدنيا . وقيل : أهلك من أهلك من القرون عن علم منه بذنوبهم فلم يحتج إلى مسألتهم عن ذنوبهم .\n                                    ",
        "saadi": "قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمٍ عِندِيٓۚ أَوَ لَمۡ يَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةٗ وَأَكۡثَرُ جَمۡعٗاۚ وَلَا يُسۡ‍َٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ ٨٧\n                                        \n                                        \n                                        \n                                        فـ { قَالَ } قارون -رادا لنصيحتهم، كافرا بنعمة ربه-: { إِنَّمَا أُوتِيتُهُ عَلَى عِلْمٍ عِنْدِي }\nأي: إنما أدركت هذه الأموال بكسبي ومعرفتي بوجوه المكاسب، وحذقي، أو على علم من اللّه بحالي، يعلم أني أهل لذلك، فلم تنصحوني على ما أعطاني للّه تعالى؟ قال تعالى مبينا أن عطاءه، ليس دليلا على حسن حالة المعطي: { أَوَلَمْ يَعْلَمْ أَنَّ اللَّهَ قَدْ أَهْلَكَ مِنْ قَبْلِهِ مِنَ الْقُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً وَأَكْثَرُ جَمْعًا } فما المانع من إهلاك قارون، مع مُضِيِّ عادتنا وسنتنا بإهلاك من هو مثله وأعظم، إذ فعل ما يوجب الهلاك؟.\n{ وَلَا يُسْأَلُ عَنْ ذُنُوبِهِمُ الْمُجْرِمُونَ } بل يعاقبهم اللّه، ويعذبهم على ما يعلمه منهم، فهم، وإن أثبتوا لأنفسهم حالة حسنة، وشهدوا لها بالنجاة، فليس قولهم مقبولا، وليس ذلك دافعا عنهم من العذاب شيئا، لأن ذنوبهم غير خفية، فإنكارهم لا محل له، فلم يزل قارون مستمرا على عناده وبغيه، وعدم قبول نصيحة قومه، فرحا بطرا قد أعجبته نفسه، وغره ما أوتيه من الأموال.\n                                    "
      },
      "originalText": "قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمٍ عِندِيٓۚ أَوَ لَمۡ يَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةٗ وَأَكۡثَرُ جَمۡعٗاۚ وَلَا يُسۡ‍َٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ ٨٧"
    },
    {
      "number": 3331,
      "text": "فَخَرَجَ عَلَىٰ قَوْمِهِ فِي زِينَتِهِ ۖ قَالَ الَّذِينَ يُرِيدُونَ الْحَيَاةَ الدُّنْيَا يَا لَيْتَ لَنَا مِثْلَ مَا أُوتِيَ قَارُونُ إِنَّهُ لَذُو حَظٍّ عَظِيمٍ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 79,
      "juz": 20,
      "manzil": 5,
      "page": 395,
      "ruku": 341,
      "hizbQuarter": 158,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِي زِينَتِهِۦۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا يَٰلَيۡتَ لَنَا مِثۡلَ مَآ أُوتِيَ قَٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٖ ٩٧\n                                    \n                                    \n                                    يقول تعالى مخبرا عن قارون : إنه خرج ذات يوم على قومه في زينة عظيمة ، وتجمل باهر ، من مراكب وملابس عليه وعلى خدمه وحشمه ، فلما رآه من يريد الحياة الدنيا ويميل إلى زخرفها وزينتها ، تمنوا أن لو كان لهم مثل الذي أعطي ، قالوا : ( يا ليت لنا مثل ما أوتي قارون إنه لذو حظ عظيم ) أي : ذو حظ وافر من الدنيا .\n                                    ",
        "qortoby": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِي زِينَتِهِۦۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا يَٰلَيۡتَ لَنَا مِثۡلَ مَآ أُوتِيَ قَٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٖ ٩٧\n                                    \n                                    \n                                    قوله تعالى : فخرج على قومه أي على بني إسرائيل فيما رآه زينة من متاع الحياة الدنيا من الثياب والدواب والتجمل في يوم عيد . قال الغزنوي : في يوم السبت . في زينته أي مع زينته قال الشاعر :\nإذا ما قلوب القوم طارت مخافة من الموت أرسوا بالنفوس المواجد\nأي مع النفوس كان خرج في سبعين ألفا من تبعه ، عليهم المعصفرات ، وكان أول من صبغ له الثياب المعصفرة قال السدي : مع ألف جوار بيض على بغال بيض بسروج من ذهب على قطف الأرجوان قال ابن عباس : خرج على البغال الشهب مجاهد : على براذين بيض عليها سروج الأرجوان ، وعليهم المعصفرات ، وكان ذلك أول يوم رئي فيه المعصفر قال قتادة : خرج على أربعة آلاف دابة عليهم ثياب حمر ، منها ألف بغل أبيض عليها قطف حمر . قال ابن جريج : خرج على بغلة شهباء عليها الأرجوان ، ومعه ثلاثمائة جارية على البغال الشهب عليهن الثياب الحمر وقال ابن زيد : خرج في سبعين ألفا عليهم المعصفرات الكلبي : خرج في ثوب أخضر كان الله أنزله على موسى من الجنة فسرقه منه قارون وقال جابر بن عبد الله رضي الله عنه : كانت زينته القرمز .\nقلت : القرمز : صبغ أحمر مثل الأرجوان ، والأرجوان في اللغة صبغ أحمر ; ذكره القشيري . قال الذين يريدون الحياة الدنيا يا ليت لنا مثل ما أوتي قارون إنه لذو حظ أي نصيب وافر من الدنيا . ثم قيل : هذا من قول مؤمني ذلك الوقت ، تمنوا مثل ماله رغبة في الدنيا وقيل : هو من قول أقوام لم يؤمنوا بالآخرة ولا رغبوا فيها ، وهم الكفار .\n                                    ",
        "saadi": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِي زِينَتِهِۦۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا يَٰلَيۡتَ لَنَا مِثۡلَ مَآ أُوتِيَ قَٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٖ ٩٧\n                                        \n                                        \n                                        \n                                        { فَخَرَجَ } ذات يوم { فِي زِينَتِهِ } أي: بحالة أرفع ما يكون من أحوال دنياه، قد كان له من الأموال ما كان، وقد استعد وتجمل بأعظم ما يمكنه، وتلك الزينة في العادة من مثله تكون هائلة، جمعت زينة الدنيا وزهرتها وبهجتها وغضارتها وفخرها، فرمقته في تلك الحالة العيون، وملأت بِزَّتُهُ القلوب، واختلبت زينته النفوس، فانقسم فيه الناظرون قسمين، كل تكلم بحسب ما عنده من الهمة والرغبة.\nفـ { قَالَ الَّذِينَ يُرِيدُونَ الْحَيَاةَ الدُّنْيَا } أي: الذين تعلقت إرادتهم فيها، وصارت منتهى رغبتهم، ليس لهم إرادة في سواها، { يَا لَيْتَ لَنَا مِثْلَ مَا أُوتِيَ قَارُونُ } من الدنيا ومتاعها وزهرتها { إِنَّهُ لَذُو حَظٍّ عَظِيمٍ } وصدقوا إنه لذو حظ عظيم، لو كان الأمر منتهيا إلى رغباتهم، وأنه ليس وراء الدنيا، دار أخرى، فإنه قد أعطي منها ما به غاية التنعم بنعيم الدنيا، واقتدر بذلك على جميع مطالبه، فصار هذا الحظ العظيم، بحسب همتهم، وإن همة جعلت هذا غاية مرادها ومنتهى مطلبها، لَمِنْ أدنى الهمم وأسفلها وأدناها، وليس لها أدنى صعود إلى المرادات العالية والمطالب الغالية.\n                                    "
      },
      "originalText": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِي زِينَتِهِۦۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا يَٰلَيۡتَ لَنَا مِثۡلَ مَآ أُوتِيَ قَٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٖ ٩٧"
    },
    {
      "number": 3332,
      "text": "وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ وَيْلَكُمْ ثَوَابُ اللَّهِ خَيْرٌ لِمَنْ آمَنَ وَعَمِلَ صَالِحًا وَلَا يُلَقَّاهَا إِلَّا الصَّابِرُونَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 80,
      "juz": 20,
      "manzil": 5,
      "page": 395,
      "ruku": 341,
      "hizbQuarter": 158,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَيۡلَكُمۡ ثَوَابُ ٱللَّهِ خَيۡرٞ لِّمَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗاۚ وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّٰبِرُونَ ٠٨\n                                    \n                                    \n                                    فلما سمع مقالتهم أهل العلم النافع قالوا لهم : ( ويلكم ثواب الله خير لمن آمن وعمل صالحا ) أي : جزاء الله لعباده المؤمنين الصالحين في الدار الآخرة خير مما ترون .\n[ كما في الحديث الصحيح : يقول الله تعالى : أعددت لعبادي الصالحين ما لا عين رأت ، ولا أذن سمعت ، ولا خطر على قلب بشر ، واقرؤوا إن شئتم : ( فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون ) [ السجدة : 17 ] .\nوقوله : ( ولا يلقاها إلا الصابرون ) : قال السدي : وما يلقى الجنة إلا الصابرون . كأنه جعل ذلك من تمام كلام الذين أوتوا العلم . قال ابن جرير : وما يلقى هذه الكلمة إلا الصابرون عن محبة الدنيا ، الراغبون في الدار الآخرة . وكأنه جعل ذلك مقطوعا من كلام أولئك ، وجعله من كلام الله عز وجل وإخباره بذلك .\n                                    ",
        "qortoby": "وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَيۡلَكُمۡ ثَوَابُ ٱللَّهِ خَيۡرٞ لِّمَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗاۚ وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّٰبِرُونَ ٠٨\n                                    \n                                    \n                                    قوله تعالى : وقال الذين أوتوا العلم ويلكم وهم أحبار بني إسرائيل قالوا للذين تمنوا مكانه ويلكم ثواب الله خير يعني الجنة . لمن آمن وعمل صالحا ولا يلقاها إلا الصابرون أي لا يؤتى الأعمال الصالحة أو لا يؤتى الجنة في الآخرة إلا الصابرون على طاعة الله وجاز ضميرها لأنها المعنية بقوله : ثواب الله .\n                                    ",
        "saadi": "وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَيۡلَكُمۡ ثَوَابُ ٱللَّهِ خَيۡرٞ لِّمَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗاۚ وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّٰبِرُونَ ٠٨\n                                        \n                                        \n                                        \n                                        { وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ } الذين عرفوا حقائق الأشياء، ونظروا إلى باطن الدنيا، حين نظر أولئك إلى ظاهرها: { وَيْلَكُمْ } متوجعين مما تمنوا لأنفسهم، راثين لحالهم، منكرين لمقالهم: { ثَوَابُ اللَّهِ } العاجل، من لذة العبادة ومحبته، والإنابة إليه، والإقبال عليه. والآجل من الجنة وما فيها، مما تشتهيه الأنفس وتلذ الأعين { خَيْرٌ } من هذا الذي تمنيتم ورغبتم فيه، فهذه حقيقة الأمر، ولكن ما كل من يعلم ذلك يؤثر الأعلى على الأدنى، فما يُلَقَّى ذلك ويوفق له { إِلَّا الصَّابِرُونَ } الذين حبسوا أنفسهم على طاعة اللّه، وعن معصيته، وعلى أقداره المؤلمة، وصبروا على جواذب الدنيا وشهواتها، أن تشغلهم عن ربهم، وأن تحول بينهم وبين ما خلقوا له، فهؤلاء الذين يؤثرون ثواب اللّه على الدنيا الفانية.\n                                    "
      },
      "originalText": "وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَيۡلَكُمۡ ثَوَابُ ٱللَّهِ خَيۡرٞ لِّمَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗاۚ وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّٰبِرُونَ ٠٨"
    },
    {
      "number": 3333,
      "text": "فَخَسَفْنَا بِهِ وَبِدَارِهِ الْأَرْضَ فَمَا كَانَ لَهُ مِنْ فِئَةٍ يَنْصُرُونَهُ مِنْ دُونِ اللَّهِ وَمَا كَانَ مِنَ الْمُنْتَصِرِينَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 81,
      "juz": 20,
      "manzil": 5,
      "page": 395,
      "ruku": 341,
      "hizbQuarter": 158,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةٖ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِينَ ١٨\n                                    \n                                    \n                                    لما ذكر تعالى اختيال قارون في زينته ، وفخره على قومه وبغيه عليهم ، عقب ذلك بأنه خسف به وبداره الأرض ، كما ثبت في الصحيح - عند البخاري من حديث الزهري ، عن سالم - أن أباه حدثه : أن رسول الله - صلى الله عليه وسلم - قال : \" بينا رجل يجر إزاره إذ خسف به ، فهو يتجلجل في الأرض إلى يوم القيامة \" .\nثم رواه من حديث جرير بن زيد ، عن سالم عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - نحوه .\nوقال الإمام أحمد : حدثنا النضر بن إسماعيل أبو المغيرة القاص ، حدثنا الأعمش ، عن عطية ، عن أبي سعيد قال : قال رسول الله - صلى الله عليه وسلم - : \" بينا رجل فيمن كان قبلكم ، خرج في بردين أخضرين يختال فيهما ، أمر الله الأرض فأخذته ، فإنه ليتجلجل فيها إلى يوم القيامة \" . تفرد به أحمد ، وإسناده حسن .\nوقال الحافظ أبو يعلى الموصلي : حدثنا أبو خيثمة ، حدثنا أبو معلى بن منصور ، أخبرني محمد بن مسلم ، سمعت زيادا النميري يحدث عن أنس بن مالك ، رضي الله عنه ، قال : قال رسول الله - صلى الله عليه وسلم - : \" بينا رجل فيمن كان قبلكم خرج في بردين فاختال فيهما ، فأمر الله الأرض فأخذته ، فهو يتجلجل فيها إلى يوم القيامة \" .\nوقد ذكر [ الحافظ ] محمد بن المنذر - شكر - في كتاب العجائب الغريبة بسنده عن نوفل بن مساحق قال : رأيت شابا في مسجد نجران ، فجعلت أنظر إليه وأتعجب من طوله وتمامه وجماله ، فقال : ما لك تنظر إلي ؟ فقلت : أعجب من جمالك وكمالك . فقال : إن الله ليعجب مني . قال : فما زال ينقص وينقص حتى صار بطول الشبر ، فأخذه بعض قرابته في كمه وذهب .\nوقد ذكر أن هلاك قارون كان عن دعوة نبي الله موسى عليه السلام واختلف في سببه ، فعن ابن عباس والسدي : أن قارون أعطى امرأة بغيا مالا على أن تبهت موسى بحضرة الملأ من بني إسرائيل ، وهو قائم فيهم يتلو عليهم كتاب الله ، فتقول : يا موسى ، إنك فعلت بي كذا وكذا . فلما قالت في الملأ ذلك لموسى عليه السلام ، أرعد من الفرق ، وأقبل عليها وصلى ركعتين ثم قال : أنشدك بالله الذي فرق البحر ، وأنجاكم من فرعون ، وفعل كذا و [ فعل ] كذا ، لما أخبرتني بالذي حملك على ما قلت ؟ فقالت : أما إذ نشدتني فإن قارون أعطاني كذا وكذا ، على أن أقول لك ، وأنا أستغفر الله وأتوب إليه . فعند ذلك خر موسى لله عز وجل ساجدا ، وسأل الله في قارون . فأوحى الله إليه أني قد أمرت الأرض أن تطيعك فيه ، فأمر موسى الأرض أن تبتلعه وداره فكان ذلك .\nوقيل : إن قارون لما خرج على قومه في زينته تلك ، وهو راكب على البغال الشهب ، وعليه وعلى خدمه الثياب الأرجوان الصبغة ، فمر في جحفله ذلك على مجلس نبي الله موسى عليه السلام ، وهو يذكرهم بأيام الله . فلما رأى الناس قارون انصرفت وجوه الناس حوله ، ينظرون إلى ما هو فيه . فدعاه موسى عليه السلام ، وقال : ما حملك على ما صنعت ؟ فقال : يا موسى ، أما لئن كنت فضلت علي بالنبوة ، فلقد فضلت عليك بالدنيا ، ولئن شئت لتخرجن ، فلتدعون علي وأدعو عليك . فخرج وخرج قارون في قومه ، فقال موسى : تدعو أو أدعو أنا ؟ قال : بل أنا أدعو . فدعا قارون فلم يجب له ، ثم قال موسى : أدعو ؟ قال : نعم . فقال موسى : اللهم مر الأرض أن تطيعني اليوم ، فأوحى الله إليه أني قد فعلت ، فقال موسى : يا أرض ، خذيهم . فأخذتهم إلى أقدامهم . ثم قال : خذيهم . فأخذتهم إلى ركبهم ، ثم إلى مناكبهم . ثم قال : أقبلي بكنوزهم وأموالهم . قال : فأقبلت بها حتى نظروا إليها . ثم أشار موسى بيده فقال : اذهبوا بني لاوى فاستوت بهم الأرض .\nوعن ابن عباس أنه قال : خسف بهم إلى الأرض السابعة .\nوقال قتادة : ذكر لنا أنه يخسف بهم كل يوم قامة ، فهم يتجلجلون فيها إلى يوم القيامة .\nوقد ذكر هاهنا إسرائيليات [ غريبة ] أضربنا عنها صفحا .\nوقوله : ( فما كان له من فئة ينصرونه من دون الله وما كان من المنتصرين ) أي : ما أغنى عنه ماله ، وما جمعه ، ولا خدمه و [ لا ] حشمه . ولا دفعوا عنه نقمة الله وعذابه ونكاله [ به ] ، ولا كان هو في نفسه منتصرا لنفسه ، فلا ناصر له [ لا ] من نفسه ، ولا من غيره .\n                                    ",
        "qortoby": "فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةٖ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِينَ ١٨\n                                    \n                                    \n                                    قوله تعالى : فخسفنا به وبداره الأرض قال مقاتل : لما أمر موسى الأرض فابتلعته قالت بنو إسرائيل : إنما أهلكه ليرث ماله ; لأنه كان ابن عمه ; أخي أبيه ، فخسف الله تعالى به وبداره الأرض وبجميع أمواله بعد ثلاثة أيام ، فأوحى الله إلى موسى إني لا أعيد طاعة الأرض إلى أحد بعدك أبدا . يقال : خسف المكان يخسف خسوفا : ذهب في الأرض ، وخسف الله به الأرض خسفا أي غاب به فيها ومنه قوله تعالى : فخسفنا به وبداره الأرض وخسف هو في الأرض وخسف به وخسوف القمر : كسوفه . قال ثعلب : كسفت الشمس وخسف القمر ; هذا أجود الكلام . والخسف : النقصان ; يقال : رضي فلان بالخسف أي بالنقيصة . فما كان له من فئة أي جماعة وعصابة ينصرونه من دون الله وما كان من المنتصرين لنفسه أي الممتنعين فيما نزل به من الخسف فيروى أن قارون يسفل كل يوم بقدر قامة ، حتى إذا بلغ قعر الأرض السفلى نفخ إسرافيل في الصور ; وقد تقدم ; والله أعلم .\n                                    ",
        "saadi": "فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةٖ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِينَ ١٨\n                                        \n                                        \n                                        \n                                        فلما انتهت بقارون حالة البغي والفخر، وازَّيَّنَتْت الدنيا عنده، وكثر بها إعجابه، بغته العذاب { فَخَسَفْنَا بِهِ وَبِدَارِهِ الْأَرْضَ } جزاء من جنس عمله، فكما رفع نفسه على عباد اللّه، أنزله اللّه أسفل سافلين، هو وما اغتر به، من داره وأثاثه، ومتاعه.\n{ فَمَا كَانَ لَهُ مِنْ فِئَةٍ } أي: جماعة، وعصبة، وخدم، وجنود { يَنْصُرُونَهُ مِنْ دُونِ اللَّهِ وَمَا كَانَ مِنَ الْمُنْتَصِرِينَ } أي: جاءه العذاب، فما نصر ولا انتصر.\n\n                                    "
      },
      "originalText": "فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةٖ يَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِينَ ١٨"
    },
    {
      "number": 3334,
      "text": "وَأَصْبَحَ الَّذِينَ تَمَنَّوْا مَكَانَهُ بِالْأَمْسِ يَقُولُونَ وَيْكَأَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ ۖ لَوْلَا أَنْ مَنَّ اللَّهُ عَلَيْنَا لَخَسَفَ بِنَا ۖ وَيْكَأَنَّهُ لَا يُفْلِحُ الْكَافِرُونَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 82,
      "juz": 20,
      "manzil": 5,
      "page": 395,
      "ruku": 341,
      "hizbQuarter": 158,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَصۡبَحَ ٱلَّذِينَ تَمَنَّوۡاْ مَكَانَهُۥ بِٱلۡأَمۡسِ يَقُولُونَ وَيۡكَأَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُۖ لَوۡلَآ أَن مَّنَّ ٱللَّهُ عَلَيۡنَا لَخَسَفَ بِنَاۖ وَيۡكَأَنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ ٢٨\n                                    \n                                    \n                                    وقوله تعالى : ( وأصبح الذين تمنوا مكانه بالأمس ) أي : الذين لما رأوه في زينته قالوا ( يا ليت لنا مثل ما أوتي قارون إنه لذو حظ عظيم ) ، فلما خسف به أصبحوا يقولون : ( ويكأن الله يبسط الرزق لمن يشاء من عباده ويقدر ) أي : ليس المال بدال على رضا الله عن صاحبه [ وعن عباده ] ; فإن الله يعطي ويمنع ، ويضيق ويوسع ، ويخفض ويرفع ، وله الحكمة التامة والحجة البالغة . وهذا كما في الحديث المرفوع عن ابن مسعود : \" إن الله قسم بينكم أخلاقكم ، كما قسم أرزاقكم وإن الله يعطي المال من يحب ، ومن لا يحب ، ولا يعطي الإيمان إلا من يحب \" .\n( لولا أن من الله علينا لخسف بنا ) أي : لولا لطف الله بنا وإحسانه إلينا لخسف بنا ، كما خسف به ، لأنا وددنا أن نكون مثله .\n( ويكأنه لا يفلح الكافرون ) يعنون : أنه كان كافرا ، ولا يفلح الكافر عند الله ، لا في الدنيا ولا في الآخرة .\nوقد اختلف النحاة في معنى قوله تعالى [ هاهنا ] : ( ويكأن ) ، فقال بعضهم : معناها : \" ويلك اعلم أن \" ، ولكن خففت فقيل : \" ويك \" ، ودل فتح \" أن \" على حذف \" اعلم \" . وهذا القول ضعفه ابن جرير ، والظاهر أنه قوي ، ولا يشكل على ذلك إلا كتابتها في المصاحف متصلة \" ويكأن \" . والكتابة أمر وضعي اصطلاحي ، والمرجع إلى اللفظ العربي ، والله أعلم .\nوقيل : معناها : ويكأن ، أي : ألم تر أن . قاله قتادة . وقيل : معناها \" وي كأن \" ، ففصلها وجعل حرف \" وي \" للتعجب أو للتنبيه ، و \" كأن \" بمعنى \" أظن وأحسب \" . قال ابن جرير : وأقوى الأقوال في هذا قول قتادة : إنها بمعنى : ألم تر أن ، واستشهد بقول الشاعر :\nسالتاني الطلاق أن رأتاني قل مالي ، وقد جئتماني بنكر ويكأن من يكن له نشب يح\nبب ومن يفتقر يعش عيش ضر\n                                    ",
        "qortoby": "وَأَصۡبَحَ ٱلَّذِينَ تَمَنَّوۡاْ مَكَانَهُۥ بِٱلۡأَمۡسِ يَقُولُونَ وَيۡكَأَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُۖ لَوۡلَآ أَن مَّنَّ ٱللَّهُ عَلَيۡنَا لَخَسَفَ بِنَاۖ وَيۡكَأَنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ ٢٨\n                                    \n                                    \n                                    قوله تعالى : وأصبح الذين تمنوا مكانه بالأمس أي صاروا يتندمون على ذلك التمني و يقولون ويكأن الله ( وي ) حرف تندم . قال النحاس : أحسن ما قيل في هذا قول الخليل وسيبويه ويونس والكسائي أن القوم تنبهوا أو نبهوا ; فقالوا ( وي ) والمتندم من العرب يقول في خلال تندمه : وي . قال الجوهري : ( وي ) كلمة تعجب ، ويقال : ويك ووي لعبد الله . وقد تدخل ( وي ) على ( كأن ) المخففة والمشددة ، تقول : ويكأن الله . قال الخليل : هي مفصولة ; تقول : ( وي ) ثم تبتدئ فتقول : ( كأن ) . قال الثعلبي : وقال الفراء هي كلمة تقرير ; كقولك : أما ترى إلى صنع الله وإحسانه ; وذكر أن أعرابية قالت لزوجها : أين ابنك ويك ؟ فقال : وي كأنه وراء البيت ; أي أما ترينه وقال ابن عباس والحسن : ( ويك ) كلمة ابتداء وتحقيق تقديره : إن الله يبسط الرزق وقيل : هو تنبيه بمنزلة ( ألا ) في قولك : ألا تفعل ، و ( أما ) في قولك : أما بعد . قال الشاعر :\nسالتاني الطلاق إذ رأتاني قل مالي قد جئتماني بنكر وي كأن من يكن له نشب يحب\nب ومن يفتقر يعش عيش ضر\nوقال قطرب : إنما هو ( ويلك ) وأسقطت لامه وضمت الكاف التي هي للخطاب إلى ( وي ) قال عنترة :\nولقد شفى نفسي وأبرأ سقمها قيل الفوارس ويك عنتر أقدم\nوأنكره النحاس وغيره ، وقالوا : إن المعنى لا يصح عليه ; لأن القوم لم يخاطبوا أحدا فيقولوا له : ويك ، ولو كان كذلك لكان ( إنه ) بالكسر . وأيضا فإن حذف اللام من ( ويلك ) لا يجوز . وقال بعضهم : التقدير : ويلك اعلم أنه ; فأضمر ( اعلم ) ابن الأعرابي : ( ويكأن الله ) أي اعلم . وقيل : معناه ألم تر أن الله . وقال القتبي : معناه رحمة لك ، بلغة حمير وقال الكسائي : ( وي ) فيه معنى التعجب ويروى عنه أيضا الوقف على ( وي ) وقال : كلمة تفجع . ومن قال : ( ويك ) فوقف على الكاف فمعناه : أعجب لأن الله يبسط الرزق وأعجب لأنه لا يفلح الكافرون . وينبغي أن تكون الكاف حرف خطاب لا اسما ; لأن ( وي ) ليست مما يضاف وإنما كتبت متصلة ; لأنها لما كثر استعمالها جعلت مع ما بعدها كشيء واحد . لولا أن من الله علينا بالإيمان والرحمة وعصمنا من مثل ما كان عليه قارون من البغي والبطر لخسف بنا وقرأ الأعمش : ( لولا من الله علينا ) . وقرأ حفص : لخسف بنا مسمى الفاعل الباقون : على ما لم يسم فاعله وهو اختيار أبي عبيد وفي حرف عبد الله ( لانخسف بنا ) كما تقول انطلق بنا . وكذلك قرأ الأعمش وطلحة بن مصرف . واختار قراءة الجماعة أبو حاتم لوجهين : أحدهما قوله : فخسفنا به وبداره الأرض والثاني قوله : لولا أن من الله علينا فهو بأن يضاف إلى الله تعالى لقرب اسمه منه أولى ويكأنه لا يفلح الكافرون عند الله .\n                                    ",
        "saadi": "وَأَصۡبَحَ ٱلَّذِينَ تَمَنَّوۡاْ مَكَانَهُۥ بِٱلۡأَمۡسِ يَقُولُونَ وَيۡكَأَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُۖ لَوۡلَآ أَن مَّنَّ ٱللَّهُ عَلَيۡنَا لَخَسَفَ بِنَاۖ وَيۡكَأَنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ ٢٨\n                                        \n                                        \n                                        \n                                        { وَأَصْبَحَ الَّذِينَ تَمَنَّوْا مَكَانَهُ بِالْأَمْسِ } أي: الذين يريدون الحياة الدنيا، الذين قالوا: { يَا لَيْتَ لَنَا مِثْلَ مَا أُوتِيَ قَارُونُ } { يَقُولُونَ } متوجعين ومعتبرين، وخائفين من وقوع العذاب بهم: { وَيْكَأَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ } أي: يضيق الرزق على من يشاء، فعلمنا حينئذ أن بسطه لقارون، ليس دليلا على خير فيه، وأننا غالطون في قولنا: { إِنَّهُ لَذُو حَظٍّ عَظِيمٍ } و { لَوْلَا أَنْ مَنَّ اللَّهُ عَلَيْنَا } فلم يعاقبنا على ما قلنا، فلولا فضله ومنته { لَخَسَفَ بِنَا } فصار هلاك قارون عقوبة له، وعبرة وموعظة لغيره، حتى إن الذين غبطوه، سمعت كيف ندموا، وتغير فكرهم الأول.\n{ وَيْكَأَنَّهُ لَا يُفْلِحُ الْكَافِرُونَ } أي: لا في الدنيا ولا في الآخرة.\n                                    "
      },
      "originalText": "وَأَصۡبَحَ ٱلَّذِينَ تَمَنَّوۡاْ مَكَانَهُۥ بِٱلۡأَمۡسِ يَقُولُونَ وَيۡكَأَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُۖ لَوۡلَآ أَن مَّنَّ ٱللَّهُ عَلَيۡنَا لَخَسَفَ بِنَاۖ وَيۡكَأَنَّهُۥ لَا يُفۡلِحُ ٱلۡكَٰفِرُونَ ٢٨"
    },
    {
      "number": 3335,
      "text": "تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِي الْأَرْضِ وَلَا فَسَادًا ۚ وَالْعَاقِبَةُ لِلْمُتَّقِينَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 83,
      "juz": 20,
      "manzil": 5,
      "page": 395,
      "ruku": 341,
      "hizbQuarter": 158,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تِلۡكَ ٱلدَّارُ ٱلۡأٓخِرَةُ نَجۡعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوّٗا فِي ٱلۡأَرۡضِ وَلَا فَسَادٗاۚ وَٱلۡعَٰقِبَةُ لِلۡمُتَّقِينَ ٣٨\n                                    \n                                    \n                                    يخبر تعالى أن الدار الآخرة ونعيمها المقيم الذي لا يحول ولا يزول ، جعلها لعباده المؤمنين المتواضعين ، الذين لا يريدون علوا في الأرض ، أي : ترفعا على خلق الله وتعاظما عليهم وتجبرا بهم ، ولا فسادا فيهم . كما قال عكرمة : العلو : التجبر .\nوقال سعيد بن جبير : العلو : البغي .\nوقال سفيان بن سعيد الثوري ، عن منصور ، عن مسلم البطين : العلو في الأرض : التكبر بغير حق . والفساد : أخذ المال بغير حق .\nوقال ابن جريج : ( لا يريدون علوا في الأرض ) تعظما وتجبرا ، ( ولا فسادا ) : عملا بالمعاصي .\nوقال ابن جرير : حدثنا ابن وكيع ، حدثنا أبي ، عن أشعث السمان ، عن أبى سلام الأعرج ، عن علي قال : إن الرجل ليعجبه من شراك نعله أن يكون أجود من شراك صاحبه ، فيدخل في قوله : ( تلك الدار الآخرة نجعلها للذين لا يريدون علوا في الأرض ولا فسادا والعاقبة للمتقين ) .\nوهذا محمول على ما إذا أراد [ بذلك ] الفخر [ والتطاول ] على غيره ; فإن ذلك مذموم ، كما ثبت في الصحيح ، عن النبي - صلى الله عليه وسلم - [ أنه قال ] إنه أوحي إلي أن تواضعوا ، حتى لا يفخر أحد على أحد ، ولا يبغي أحد على أحد \" ، وأما إذا أحب ذلك لمجرد التجمل فهذا لا بأس به ، فقد ثبت أن رجلا قال : يا رسول الله ، إني أحب أن يكون ردائي حسنا ونعلي حسنة ، أفمن الكبر ذلك ؟ فقال : \" لا إن الله جميل يحب الجمال \" .\n                                    ",
        "qortoby": "تِلۡكَ ٱلدَّارُ ٱلۡأٓخِرَةُ نَجۡعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوّٗا فِي ٱلۡأَرۡضِ وَلَا فَسَادٗاۚ وَٱلۡعَٰقِبَةُ لِلۡمُتَّقِينَ ٣٨\n                                    \n                                    \n                                    قوله تعالى : تلك الدار الآخرة يعني الجنة وقال ذلك على جهة التعظيم لها والتفخيم لشأنها يعني تلك التي سمعت بذكرها ، وبلغك وصفهانجعلها للذين لا يريدون علوا في الأرض أي رفعة وتكبرا على الإيمان والمؤمنين ولا فسادا عملا بالمعاصي ، قاله ابن جريج ومقاتل . وقال عكرمة ومسلم البطين : الفساد أخذ المال بغير حق وقال الكلبي الدعاء إلى غير عبادة الله وقال يحيى بن سلام : هو قتل الأنبياء والمؤمنين والعاقبة للمتقين قال الضحاك : الجنة . وقال أبو معاوية : الذي لا يريد علوا هو من لم يجزع من ذلها ، ولم ينافس في عزها ، وأرفعهم عند الله أشدهم تواضعا ، وأعزهم غدا ألزمهم لذل اليوم .\nوروى سفيان بن عيينة عن إسماعيل بن أبي خالد قال : مر علي بن الحسين وهو راكب على مساكين يأكلون كسرا لهم ، فسلم عليهم فدعوه إلى طعامهم ، فتلا هذه الآية : تلك الدار الآخرة نجعلها للذين لا يريدون علوا في الأرض ولا فسادا ثم نزل وأكل معهم ثم قال : قد أجبتكم فأجيبوني فحملهم إلى منزله فأطعمهم وكساهم وصرفهم خرجه أبو القاسم الطبراني سليمان بن أحمد قال : حدثنا عبد الله بن أحمد بن حنبل قال : حدثني أبي ، قال : حدثنا سفيان بن عيينة فذكره وقيل : لفظ الدار الآخرة يشمل الثواب والعقاب والمراد : إنما ينتفع بتلك الدار من اتقى ، ومن لم يتق فتلك الدار عليه لا له ، لأنها تضره ولا تنفعه .\n                                    ",
        "saadi": "تِلۡكَ ٱلدَّارُ ٱلۡأٓخِرَةُ نَجۡعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوّٗا فِي ٱلۡأَرۡضِ وَلَا فَسَادٗاۚ وَٱلۡعَٰقِبَةُ لِلۡمُتَّقِينَ ٣٨\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى، قارون وما أوتيه من الدنيا، وما صار إليه عاقبة أمره، وأن أهل العلم قالوا: { ثَوَابُ اللَّهِ خَيْرٌ لِمَنْ آمَنَ وَعَمِلَ صَالِحًا } رغب تعالى في الدار الآخرة، وأخبر بالسبب الموصل إليها فقال: { تِلْكَ الدَّارُ الْآخِرَةُ } التي أخبر اللّه بها في كتبه وأخبرت [بها] رسله، التي [قد] جمعت كل نعيم، واندفع عنها كل مكدر ومنغص، { نَجْعَلُهَا } دارا وقرارا { لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِي الْأَرْضِ وَلَا فَسَادًا } أي: ليس لهم إرادة، فكيف العمل للعلو في الأرض على عباد اللّه، والتكبر عليهم وعلى الحق { وَلَا فَسَادًا } وهذا شامل لجميع المعاصي، فإذا كانوا لا إرادة لهم في العلو في الأرض والإفساد، لزم من ذلك، أن تكون إرادتهم مصروفة إلى اللّه، وقصدهم الدار الآخرة، وحالهم التواضع لعباد اللّه، والانقياد للحق والعمل الصالح.\nوهؤلاء هم المتقون الذين لهم العاقبة، ولهذا قال: { وَالْعَاقِبَةُ } أي حالة الفلاح والنجاح، التي تستقر وتستمر، لمن اتقى اللّه تعالى، وغيرهم -وإن حصل لها بعض الظهور والراحة- فإنه لا يطول وقته، ويزول عن قريب. وعلم من هذا الحصر في الآية الكريمة، أن الذين يريدون العلو في الأرض، أو الفساد، ليس لهم في الدار الآخرة، نصيب، ولا لهم منها نصيب\n                                    "
      },
      "originalText": "تِلۡكَ ٱلدَّارُ ٱلۡأٓخِرَةُ نَجۡعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوّٗا فِي ٱلۡأَرۡضِ وَلَا فَسَادٗاۚ وَٱلۡعَٰقِبَةُ لِلۡمُتَّقِينَ ٣٨"
    },
    {
      "number": 3336,
      "text": "مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْهَا ۖ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ",
      "surah": {
        "number": 28,
        "name": "سورة القصص",
        "englishName": "Al-Qasas",
        "englishNameTranslation": "The Stories",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 84,
      "juz": 20,
      "manzil": 5,
      "page": 395,
      "ruku": 341,
      "hizbQuarter": 158,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَى ٱلَّذِينَ عَمِلُواْ ٱلسَّيِّ‍َٔاتِ إِلَّا مَا كَانُواْ يَعۡمَلُونَ ٤٨\n                                    \n                                    \n                                    وقال : ( من جاء بالحسنة ) أي : يوم القيامة ( فله خير منها ) أي : ثواب الله خير من حسنة العبد ، فكيف والله يضاعفه أضعافا كثيرة فهذا مقام الفضل .\nثم قال : ( ومن جاء بالسيئة فلا يجزى الذين عملوا السيئات إلا ما كانوا يعملون ) ، كما قال في الآية الأخرى : ( ومن جاء بالسيئة فكبت وجوههم في النار هل تجزون إلا ما كنتم تعملون ) [ النمل : 90 ] وهذا مقام الفصل والعدل .\n                                    ",
        "qortoby": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَى ٱلَّذِينَ عَمِلُواْ ٱلسَّيِّ‍َٔاتِ إِلَّا مَا كَانُواْ يَعۡمَلُونَ ٤٨\n                                    \n                                    \n                                    قوله تعالى : من جاء بالحسنة فله خير منها تقدم في ( النمل ) وقال عكرمة : ليس شيء خيرا من \" لا إله إلا الله \" وإنما المعنى من جاء ب \" لا إله إلا الله \" فله منها خير ومن جاء بالسيئة أي بالشرك فلا يجزى الذين عملوا السيئات إلا ما كانوا يعملون أي يعاقب بما يليق بعمله .\n                                    ",
        "saadi": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَى ٱلَّذِينَ عَمِلُواْ ٱلسَّيِّ‍َٔاتِ إِلَّا مَا كَانُواْ يَعۡمَلُونَ ٤٨\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن مضاعفة فضله، وتمام عدله فقال: { مَنْ جَاءَ بِالْحَسَنَةِ } شرط فيها أن يأتي بها العامل، لأنه قد يعملها، ولكن يقترن بها ما لا تقبل منه أو يبطلها، فهذا لم يجيء بالحسنة، والحسنة: اسم جنس يشمل جميع ما أمر اللّه به ورسوله، من الأقوال والأعمال الظاهرة والباطنة، المتعلقة بحق الله تعالى وحق عباده، { فَلَهُ خَيْرٌ مِنْهَا } [أي: أعظم وأجل، وفي الآية الأخرى { فَلَهُ عَشْرُ أَمْثَالِهَا } ]\nهذا التضعيف للحسنة، لا بد منه، وقد يقترن بذلك من الأسباب ما تزيد به المضاعفة، كما قال تعالى: { وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ } بحسب حال العامل وعمله، ونفعه ومحله ومكانه، { وَمَنْ جَاءَ بِالسَّيِّئَةِ } وهي كل ما نهى الشارع عنه، نَهْيَ تحريم. { فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ } كقوله تعالى: { مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى إِلَّا مِثْلَهَا وَهُمْ لَا يُظْلَمُونَ }\n                                    "
      },
      "originalText": "مَن جَآءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَيۡرٞ مِّنۡهَاۖ وَمَن جَآءَ بِٱلسَّيِّئَةِ فَلَا يُجۡزَى ٱلَّذِينَ عَمِلُواْ ٱلسَّيِّ‍َٔاتِ إِلَّا مَا كَانُواْ يَعۡمَلُونَ ٤٨"
    }
  ]
}