{
  "number": 40,
  "ayahsNumber": 3,
  "ayahs": [
    {
      "number": 253,
      "text": "أَلَمْ تَرَ إِلَى الْمَلَإِ مِنْ بَنِي إِسْرَائِيلَ مِنْ بَعْدِ مُوسَىٰ إِذْ قَالُوا لِنَبِيٍّ لَهُمُ ابْعَثْ لَنَا مَلِكًا نُقَاتِلْ فِي سَبِيلِ اللَّهِ ۖ قَالَ هَلْ عَسَيْتُمْ إِنْ كُتِبَ عَلَيْكُمُ الْقِتَالُ أَلَّا تُقَاتِلُوا ۖ قَالُوا وَمَا لَنَا أَلَّا نُقَاتِلَ فِي سَبِيلِ اللَّهِ وَقَدْ أُخْرِجْنَا مِنْ دِيَارِنَا وَأَبْنَائِنَا ۖ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ تَوَلَّوْا إِلَّا قَلِيلًا مِنْهُمْ ۗ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 246,
      "juz": 2,
      "manzil": 1,
      "page": 40,
      "ruku": 33,
      "hizbQuarter": 16,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَرَ إِلَى ٱلۡمَلَإِ مِنۢ بَنِيٓ إِسۡرَٰٓءِيلَ مِنۢ بَعۡدِ مُوسَىٰٓ إِذۡ قَالُواْ لِنَبِيّٖ لَّهُمُ ٱبۡعَثۡ لَنَا مَلِكٗا نُّقَٰتِلۡ فِي سَبِيلِ ٱللَّهِۖ قَالَ هَلۡ عَسَيۡتُمۡ إِن كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ أَلَّا تُقَٰتِلُواْۖ قَالُواْ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِي سَبِيلِ ٱللَّهِ وَقَدۡ أُخۡرِجۡنَا مِن دِيَٰرِنَا وَأَبۡنَآئِنَاۖ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ تَوَلَّوۡاْ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ ٦٤٢\n                                    \n                                    \n                                    قال عبد الرزاق عن معمر عن قتادة : هذا النبي هو يوشع بن نون . قال ابن جرير : يعني ابن أفراثيم بن يوسف بن يعقوب . وهذا القول بعيد ; لأن هذا كان بعد موسى بدهر طويل ، وكان ذلك في زمان داود عليه السلام ، كما هو مصرح به في القصة وقد كان بين داود وموسى ما ينيف عن ألف سنة والله أعلم .\nوقال السدي : هو شمعون وقال مجاهد : هو شمويل عليه السلام . وكذا قال محمد بن إسحاق عن وهب بن منبه وهو : شمويل بن بالي بن علقمة بن يرخام بن إليهو بن تهو بن صوف بن علقمة بن ماحث بن عموصا بن عزريا بن صفنيه بن علقمة بن أبي ياسف بن قارون بن يصهر بن قاهث بن لاوي بن يعقوب بن إسحاق بن إبراهيم الخليل عليه السلام .\nوقال وهب بن منبه وغيره : كان بنو إسرائيل بعد موسى عليه السلام على طريق الاستقامة مدة الزمان ، ثم أحدثوا الأحداث وعبد بعضهم الأصنام ، ولم يزل بين أظهرهم من الأنبياء من يأمرهم بالمعروف وينهاهم عن المنكر ويقيمهم على منهج التوراة إلى أن فعلوا ما فعلوا فسلط الله عليهم أعداءهم فقتلوا منهم مقتلة عظيمة ، وأسروا خلقا كثيرا وأخذوا منهم بلادا كثيرة ، ولم يكن أحد يقاتلهم إلا غلبوه وذلك أنهم كان عندهم التوراة والتابوت الذي كان في قديم الزمان وكان ذلك موروثا لخلفهم عن سلفهم إلى موسى الكليم عليه الصلاة والسلام فلم يزل بهم تماديهم على الضلال حتى استلبه منهم بعض الملوك في بعض الحروب وأخذ التوراة من أيديهم ولم يبق من يحفظها فيهم إلا القليل وانقطعت النبوة من أسباطهم ولم يبق من سبط لاوي الذي يكون فيه الأنبياء إلا امرأة حامل من بعلها وقد قتل فأخذوها فحبسوها في بيت واحتفظوا بها لعل الله يرزقها غلاما يكون نبيا لهم ولم تزل [ تلك ] المرأة تدعو الله عز وجل أن يرزقها غلاما فسمع الله لها ووهبها غلاما ، فسمته شمويل : أي : سمع الله . ومنهم من يقول : شمعون وهو بمعناه فشب ذلك الغلام ونشأ فيهم وأنبته الله نباتا حسنا فلما بلغ سن الأنبياء أوحى الله إليه وأمره بالدعوة إليه وتوحيده ، فدعا بني إسرائيل فطلبوا منه أن يقيم لهم ملكا يقاتلون معه أعداءهم وكان الملك أيضا قد باد فيهم فقال لهم النبي : فهل عسيتم إن أقام الله لكم ملكا ألا تفوا بما التزمتم من القتال معه ( قالوا وما لنا ألا نقاتل في سبيل الله وقد أخرجنا من ديارنا وأبنائنا ) أي : وقد أخذت منا البلاد وسبيت الأولاد ؟ قال الله تعالى : ( فلما كتب عليهم القتال تولوا إلا قليلا منهم والله عليم بالظالمين ) أي : ما وفوا بما وعدوا بل نكل عن الجهاد أكثرهم والله عليم بهم .\n                                    ",
        "qortoby": "أَلَمۡ تَرَ إِلَى ٱلۡمَلَإِ مِنۢ بَنِيٓ إِسۡرَٰٓءِيلَ مِنۢ بَعۡدِ مُوسَىٰٓ إِذۡ قَالُواْ لِنَبِيّٖ لَّهُمُ ٱبۡعَثۡ لَنَا مَلِكٗا نُّقَٰتِلۡ فِي سَبِيلِ ٱللَّهِۖ قَالَ هَلۡ عَسَيۡتُمۡ إِن كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ أَلَّا تُقَٰتِلُواْۖ قَالُواْ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِي سَبِيلِ ٱللَّهِ وَقَدۡ أُخۡرِجۡنَا مِن دِيَٰرِنَا وَأَبۡنَآئِنَاۖ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ تَوَلَّوۡاْ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ ٦٤٢\n                                    \n                                    \n                                    قوله تعالى : ألم تر إلى الملإ من بني إسرائيل من بعد موسى إذ قالوا لنبي لهم ابعث لنا ملكا نقاتل في سبيل الله قال هل عسيتم إن كتب عليكم القتال ألا تقاتلوا قالوا وما لنا ألا نقاتل في سبيل الله وقد أخرجنا من ديارنا وأبنائنا فلما كتب عليهم القتال تولوا إلا قليلا منهم والله عليم بالظالمين\nذكر في التحريض على القتال قصة أخرى جرت في بني إسرائيل . والملأ : الأشراف من الناس ، كأنهم ممتلئون شرفا . وقال الزجاج : سموا بذلك لأنهم ممتلئون مما يحتاجون إليه منهم . والملأ في هذه الآية القوم ؛ لأن المعنى يقتضيه . والملأ : اسم للجمع كالقوم والرهط . والملأ أيضا : حسن الخلق ، ومنه الحديث \" أحسنوا الملأ فكلكم سيروى \" خرجه مسلم .\nقوله تعالى : ( من بعد موسى ) : أي من بعد وفاته . إذ قالوا لنبي لهم ابعث لنا ملكا قيل : هو شمويل بن بال بن علقمة ويعرف بابن العجوز . ويقال فيه : شمعون ، قاله السدي : وإنما قيل : ابن العجوز لأن أمه كانت عجوزا فسألت الله الولد وقد كبرت وعقمت فوهبه الله تعالى لها . ويقال له : سمعون لأنها دعت الله أن يرزقها الولد فسمع دعاءها فولدت غلاما فسمته \" سمعون \" ، تقول : سمع الله دعائي ، والسين تصير شينا بلغة العبرانية ، وهو من ولد يعقوب . وقال مقاتل : هو من نسل هارون عليه السلام . وقال قتادة : هو يوشع بن نون . قال ابن عطية : وهذا ضعيف لأن مدة داود هي من بعد موسى بقرون من الناس ، ويوشع هو فتى موسى . وذكر المحاسبي أن اسمه إسماعيل ، والله أعلم . وهذه الآية هي خبر عن قوم من بني إسرائيل نالتهم ذلة وغلبة عدو فطلبوا الإذن في الجهاد وأن يؤمروا به ، فلما أمروا كع أكثرهم وصبر الأقل فنصرهم الله . وفي الخبر أن هؤلاء المذكورين هم الذين أميتوا ثم أحيوا ، والله أعلم .\nقوله تعالى ( نقاتل ) : بالنون والجزم ، وقراءة جمهور القراء على جواب الأمر . وقرأ الضحاك وابن أبي عبلة بالياء ورفع الفعل ، فهو في موضع الصفة للملك .\nقوله تعالى : قال هل عسيتم \" عسيتم \" بالفتح والكسر لغتان ، وبالثانية قرأ نافع ، والباقون بالأولى وهي الأشهر . قال أبو حاتم : وليس للكسر وجه ، وبه قرأ الحسن وطلحة . قال مكي في اسم الفاعل : عس ، فهذا يدل على كسر السين في الماضي . والفتح في السين هي اللغة الفاشية . قال أبو علي : ووجه الكسر قول العرب : هو عس بذلك ، مثل حر وشج ، وقد جاء فعل وفعل في نحو نعم ونعم ، وكذلك عسيت وعسيت ، فإن أسند الفعل إلى ظاهر فقياس عسيتم أن يقال : عسي زيد ، مثل رضي زيد ، فإن قيل فهو القياس وإن لم يقل ، فسائغ أن يؤخذ باللغتين فتستعمل إحداهما موضع الأخرى . ومعنى هذه المقالة : هل أنتم قريب من التولي والفرار ؟ . إن كتب عليكم القتال ألا تقاتلوا قال الزجاج : ألا تقاتلوا في موضع نصب ، أي هل عسيتم مقاتلة . قالوا وما لنا ألا نقاتل في سبيل الله قال الأخفش : \" أن \" زائدة . وقال الفراء : هو محمول على المعنى ، أي وما منعنا ، كما تقول : ما لك ألا تصلي ؟ أي ما منعك . وقيل : المعنى وأي شيء لنا في ألا نقاتل في سبيل الله! قال النحاس : وهذا أجودها . و \" أن \" في موضع نصب . وقد أخرجنا من ديارنا تعليل ، وكذلك ( وأبنائنا ) أي بسبب ذرارينا .\nقوله تعالى : ( فلما كتب عليهم ) أي فرض عليهم . ( القتال تولوا ) أخبر تعالى أنه لما فرض عليهم القتال ورأوا الحقيقة ورجعت أفكارهم إلى مباشرة الحرب وأن نفوسهم ربما قد تذهب تولوا أي اضطربت نياتهم وفترت عزائمهم ، وهذا شأن الأمم المتنعمة المائلة إلى الدعة تتمنى الحرب أوقات الأنفة فإذا حضرت الحرب كعت وانقادت لطبعها . وعن هذا المعنى نهى النبي صلى الله عليه وسلم بقوله : لا تتمنوا لقاء العدو وسلوا الله العافية فإذا لقيتموهم فاثبتوا رواه الأئمة . ثم أخبر الله تعالى عن قليل منهم أنهم ثبتوا على النية الأولى واستمرت عزيمتهم على القتال في سبيل الله تعالى .\n                                    ",
        "saadi": "أَلَمۡ تَرَ إِلَى ٱلۡمَلَإِ مِنۢ بَنِيٓ إِسۡرَٰٓءِيلَ مِنۢ بَعۡدِ مُوسَىٰٓ إِذۡ قَالُواْ لِنَبِيّٖ لَّهُمُ ٱبۡعَثۡ لَنَا مَلِكٗا نُّقَٰتِلۡ فِي سَبِيلِ ٱللَّهِۖ قَالَ هَلۡ عَسَيۡتُمۡ إِن كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ أَلَّا تُقَٰتِلُواْۖ قَالُواْ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِي سَبِيلِ ٱللَّهِ وَقَدۡ أُخۡرِجۡنَا مِن دِيَٰرِنَا وَأَبۡنَآئِنَاۖ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ تَوَلَّوۡاْ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ ٦٤٢\n                                        \n                                        \n                                        \n                                        يقص تعالى على نبيه قصة الملأ من بني إسرائيل وهم الأشراف والرؤساء، وخص الملأ بالذكر، لأنهم في العادة هم الذين يبحثون عن مصالحهم ليتفقوا فيتبعهم غيرهم على ما يرونه، وذلك أنهم أتوا إلى نبي لهم بعد موسى عليه السلام فقالوا له { ابعث لنا ملكا } أي: عيِّن لنا ملكا { نقاتل في سبيل الله } ليجتمع متفرقنا ويقاوم بنا عدونا، ولعلهم في ذلك الوقت ليس لهم رئيس يجمعهم، كما جرت عادة القبائل أصحاب البيوت، كل بيت لا يرضى أن يكون من البيت الآخر رئيس، فالتمسوا من نبيهم تعيين ملك يرضي الطرفين ويكون تعيينه خاصا لعوائدهم، وكانت أنبياء بني إسرائيل تسوسهم، كلما مات نبي خلفه نبي آخر، فلما قالوا لنبيهم تلك المقالة { قال } لهم نبيهم { هل عسيتم إن كتب عليكم القتال ألا تقاتلوا } أي: لعلكم تطلبون شيئا وهو إذا كتب عليكم لا تقومون به، فعرض عليهم العافية فلم يقبلوها، واعتمدوا على عزمهم ونيتهم، فقالوا: { وما لنا ألا نقاتل في سبيل الله وقد أخرجنا من ديارنا وأبنائنا } أي: أي شيء يمنعنا من القتال وقد ألجأنا إليه، بأن أخرجنا من أوطاننا وسبيت ذرارينا، فهذا موجب لكوننا نقاتل ولو لم يكتب علينا، فكيف مع أنه فرض علينا وقد حصل ما حصل، ولهذا لما لم تكن نياتهم حسنة ولم يقوَ توكلهم على ربهم { فلما كتب عليهم القتال تولوا } فجبنوا عن قتال الأعداء وضعفوا عن المصادمة، وزال ما كانوا عزموا عليه، واستولى على أكثرهم الخور والجبن { إلا قليلا منهم } فعصمهم الله وثبتهم وقوى قلوبهم فالتزموا أمر الله ووطنوا أنفسهم على مقارعة أعدائه، فحازوا شرف الدنيا والآخرة، وأما أكثرهم فظلموا أنفسهم وتركوا أمر الله، فلهذا قال: { والله عليم بالظالمين }ـ\n                                    "
      },
      "originalText": "أَلَمۡ تَرَ إِلَى ٱلۡمَلَإِ مِنۢ بَنِيٓ إِسۡرَٰٓءِيلَ مِنۢ بَعۡدِ مُوسَىٰٓ إِذۡ قَالُواْ لِنَبِيّٖ لَّهُمُ ٱبۡعَثۡ لَنَا مَلِكٗا نُّقَٰتِلۡ فِي سَبِيلِ ٱللَّهِۖ قَالَ هَلۡ عَسَيۡتُمۡ إِن كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ أَلَّا تُقَٰتِلُواْۖ قَالُواْ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِي سَبِيلِ ٱللَّهِ وَقَدۡ أُخۡرِجۡنَا مِن دِيَٰرِنَا وَأَبۡنَآئِنَاۖ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ تَوَلَّوۡاْ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ ٦٤٢"
    },
    {
      "number": 254,
      "text": "وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ اللَّهَ قَدْ بَعَثَ لَكُمْ طَالُوتَ مَلِكًا ۚ قَالُوا أَنَّىٰ يَكُونُ لَهُ الْمُلْكُ عَلَيْنَا وَنَحْنُ أَحَقُّ بِالْمُلْكِ مِنْهُ وَلَمْ يُؤْتَ سَعَةً مِنَ الْمَالِ ۚ قَالَ إِنَّ اللَّهَ اصْطَفَاهُ عَلَيْكُمْ وَزَادَهُ بَسْطَةً فِي الْعِلْمِ وَالْجِسْمِ ۖ وَاللَّهُ يُؤْتِي مُلْكَهُ مَنْ يَشَاءُ ۚ وَاللَّهُ وَاسِعٌ عَلِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 247,
      "juz": 2,
      "manzil": 1,
      "page": 40,
      "ruku": 33,
      "hizbQuarter": 16,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ٱللَّهَ قَدۡ بَعَثَ لَكُمۡ طَالُوتَ مَلِكٗاۚ قَالُوٓاْ أَنَّىٰ يَكُونُ لَهُ ٱلۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ أَحَقُّ بِٱلۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةٗ مِّنَ ٱلۡمَالِۚ قَالَ إِنَّ ٱللَّهَ ٱصۡطَفَىٰهُ عَلَيۡكُمۡ وَزَادَهُۥ بَسۡطَةٗ فِي ٱلۡعِلۡمِ وَٱلۡجِسۡمِۖ وَٱللَّهُ يُؤۡتِي مُلۡكَهُۥ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ ٧٤٢\n                                    \n                                    \n                                    اي : لما طلبوا من نبيهم أن يعين لهم ملكا منهم فعين لهم طالوت وكان رجلا من أجنادهم ولم يكن من بيت الملك فيهم ; لأن الملك فيهم كان في سبط يهوذا ، ولم يكن هذا من ذلك السبط فلهذا قالوا : ( أنى يكون له الملك علينا ) أي : كيف يكون ملكا علينا ( ونحن أحق بالملك منه ولم يؤت سعة من المال ) أي : ثم هو مع هذا فقير لا مال له يقوم بالملك ، وقد ذكر بعضهم أنه كان سقاء وقيل : دباغا . وهذا اعتراض منهم على نبيهم وتعنت وكان الأولى بهم طاعة وقول معروف ثم قد أجابهم النبي قائلا ( إن الله اصطفاه عليكم ) أي : اختاره لكم من بينكم والله أعلم به منكم . يقول : لست أنا الذي عينته من تلقاء نفسي بل الله أمرني به لما طلبتم مني ذلك ( وزاده بسطة في العلم والجسم ) أي : وهو مع هذا أعلم منكم ، وأنبل وأشكل منكم وأشد قوة وصبرا في الحرب ومعرفة بها أي : أتم علما وقامة منكم . ومن هاهنا ينبغي أن يكون الملك ذا علم وشكل حسن وقوة شديدة في بدنه ونفسه ثم قال : ( والله يؤتي ملكه من يشاء ) أي : هو الحاكم الذي ما شاء فعل ولا يسأل عما يفعل وهم يسألون لعلمه [ وحكمته ] ورأفته بخلقه ; ولهذا قال : ( والله واسع عليم ) أي : هو واسع الفضل يختص برحمته من يشاء عليم بمن يستحق الملك ممن لا يستحقه .\n                                    ",
        "qortoby": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ٱللَّهَ قَدۡ بَعَثَ لَكُمۡ طَالُوتَ مَلِكٗاۚ قَالُوٓاْ أَنَّىٰ يَكُونُ لَهُ ٱلۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ أَحَقُّ بِٱلۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةٗ مِّنَ ٱلۡمَالِۚ قَالَ إِنَّ ٱللَّهَ ٱصۡطَفَىٰهُ عَلَيۡكُمۡ وَزَادَهُۥ بَسۡطَةٗ فِي ٱلۡعِلۡمِ وَٱلۡجِسۡمِۖ وَٱللَّهُ يُؤۡتِي مُلۡكَهُۥ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ ٧٤٢\n                                    \n                                    \n                                    قوله تعالى : وقال لهم نبيهم إن الله قد بعث لكم طالوت ملكا قالوا أنى يكون له الملك علينا ونحن أحق بالملك منه ولم يؤت سعة من المال قال إن الله اصطفاه عليكم وزاده بسطة في العلم والجسم والله يؤتي ملكه من يشاء والله واسع عليم قوله تعالى : وقال لهم نبيهم إن الله قد بعث لكم طالوت ملكا أي أجابكم إلى ما سألتم ، وكان طالوت سقاء . وقيل : دباغا . وقيل : مكاريا ، وكان عالما فلذلك رفعه الله على ما يأتي : وكان من سبط بنيامين ولم يكن من سبط النبوة ولا من سبط الملك ، وكانت النبوة في بني لاوى ، والملك في سبط يهوذا فلذلك أنكروا . قال وهب بن منبه : لما قال الملأ من بني إسرائيل لشمويل بن بال ما قالوا ، سأل الله تعالى أن يبعث إليهم ملكا ويدله عليه ، فقال الله تعالى له : انظر إلى القرن الذي فيه الدهن في بيتك فإذا دخل عليك رجل فنش الدهن الذي في القرن ، فهو ملك بني إسرائيل فادهن رأسه منه وملكه عليهم . قال : وكان طالوت دباغا فخرج في ابتغاء دابة أضلها ، فقصد شمويل عسى أن يدعو له في أمر الدابة أو يجد عنده فرجا ، فنش الدهن على ما زعموا ، قال : فقام إليه شمويل فأخذه ودهن منه رأس طالوت ، وقال له : أنت ملك بني إسرائيل الذي أمرني الله تعالى بتقديمه ، ثم قال لبني إسرائيل : إن الله قد بعث لكم طالوت ملكا . وطالوت وجالوت اسمان أعجميان معربان ، ولذلك لم ينصرفا ، وكذلك داود ، والجمع طواليت وجواليت ودواويد ، ولو سميت رجلا بطاوس وراقود لصرفت وإن كانا أعجميين . والفرق بين هذا والأول أنك تقول : الطاوس ، فتدخل الألف واللام فيمكن في العربية ولا يمكن هذا في ذاك .\nقوله تعالى : أنى يكون له الملك علينا أي كيف يملكنا ونحن أحق بالملك منه . جروا على سنتهم في تعنيتهم الأنبياء وحيدهم عن أمر الله تعالى فقالوا : أنى أي من أي جهة ، ف \" أنى \" في موضع نصب على الظرف ، ونحن من سبط الملوك وهو ليس كذلك وهو فقير ، فتركوا السبب الأقوى وهو قدر الله تعالى وقضاؤه السابق حتى احتج عليهم نبيهم بقوله : إن الله اصطفاه أي اختاره وهو الحجة القاطعة ، وبين لهم مع ذلك تعليل اصطفاء طالوت ، وهو بسطته في العلم الذي هو ملاك الإنسان ، والجسم الذي هو معينه في الحرب وعدته عند اللقاء ، فتضمنت بيان صفة الإمام وأحوال الإمامة ، وأنها مستحقة بالعلم والدين والقوة لا بالنسب ، فلا حظ للنسب فيها مع العلم وفضائل النفس وأنها متقدمة عليه لأن الله تعالى أخبر أنه اختاره عليهم لعلمه وقوته ، وإن كانوا أشرف منتسبا . وقد مضى في أول السورة من ذكر الإمامة وشروطها ما يكفي ويغني . وهذه الآية أصل فيها . قال ابن عباس : كان طالوت يومئذ أعلم رجل في بني إسرائيل وأجمله وأتمه ، وزيادة الجسم مما يهيب العدو . وقيل : سمي طالوت لطوله . وقيل : زيادة الجسم كانت بكثرة معاني الخير والشجاعة ، ولم يرد عظم الجسم ، ألم تر إلى قول الشاعر ( هو عباس بن مرداس ) :\nترى الرجل النحيف فتزدريه وفي أثوابه أسد هصور ويعجبك الطرير فتبتليه\nفيخلف ظنك الرجل الطرير وقد عظم البعير بغير لب\nفلم يستغن بالعظم البعير\nقلت : ومن هذا المعنى قوله صلى الله عليه وسلم لأزواجه : أسرعكن لحاقا بي أطولكن يدا فكن يتطاولن ، فكانت زينب أولهن موتا ؛ لأنها كانت تعمل بيدها وتتصدق ، خرجه مسلم . وقال بعض المتأولين : المراد بالعلم علم الحرب ، وهذا تخصيص العموم من غير دليل . وقد قيل : زيادة العلم بأن أوحى الله إليه ، وعلى هذا كان طالوت نبيا ، وسيأتي .\nقوله تعالى : والله يؤتي ملكه من يشاء ذهب بعض المتأولين إلى أن هذا من قول الله عز وجل لمحمد صلى الله عليه وسلم . وقيل : هو من قول شمويل وهو الأظهر . قال لهم ذلك لما علم من تعنتهم وجدالهم في الحجج ، فأراد أن يتمم كلامه بالقطعي الذي لا اعتراض عليه فقال الله تعالى : والله يؤتي ملكه من يشاء . وإضافة ملك الدنيا إلى الله تعالى إضافة مملوك إلى ملك . ثم قال لهم على جهة التغبيط والتنبيه من غير سؤال منهم : ( إن آية ملكه ) . ويحتمل أن يكونوا سألوه الدلالة على صدقه في قوله : إن الله قد بعث لكم طالوت ملكا . قال ابن عطية : والأول أظهر بمساق الآية ، والثاني أشبه بأخلاق بني إسرائيل الذميمة ، وإليه ذهب الطبري .\n                                    ",
        "saadi": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ٱللَّهَ قَدۡ بَعَثَ لَكُمۡ طَالُوتَ مَلِكٗاۚ قَالُوٓاْ أَنَّىٰ يَكُونُ لَهُ ٱلۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ أَحَقُّ بِٱلۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةٗ مِّنَ ٱلۡمَالِۚ قَالَ إِنَّ ٱللَّهَ ٱصۡطَفَىٰهُ عَلَيۡكُمۡ وَزَادَهُۥ بَسۡطَةٗ فِي ٱلۡعِلۡمِ وَٱلۡجِسۡمِۖ وَٱللَّهُ يُؤۡتِي مُلۡكَهُۥ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ ٧٤٢\n                                        \n                                        \n                                        \n                                        { وقال لهم نبيهم } مجيبا لطلبهم { إن الله قد بعث لكم طالوت ملكا } فكان هذا تعيينا من الله الواجب عليهم فيه القبول والانقياد وترك الاعتراض، ولكن أبوا إلا أن يعترضوا، فقالوا: { أنى يكون له الملك علينا ونحن أحق بالملك منه ولم يؤت سعة من المال } أي: كيف يكون ملكا وهو دوننا في الشرف والنسب ونحن أحق بالملك منه. ومع هذا فهو فقير ليس عنده ما يقوم به الملك من الأموال، وهذا بناء منهم على ظن فاسد، وهو أن الملك ونحوه من الولايات مستلزم لشرف النسب وكثرة المال، ولم يعلموا أن الصفات الحقيقية التي توجب التقديم مقدمة عليها، فلهذا قال لهم نبيهم: { إن الله اصطفاه عليكم } فلزمكم الانقياد لذلك { وزاده بسطة في العلم والجسم } أي: فضله عليكم بالعلم والجسم، أي: بقوة الرأي والجسم اللذين بهما تتم أمور الملك، لأنه إذا تم رأيه وقوي على تنفيذ ما يقتضيه الرأي المصيب، حصل بذلك الكمال، ومتى فاته واحد من الأمرين اختل عليه الأمر، فلو كان قوي البدن مع ضعف الرأي، حصل في الملك خرق وقهر ومخالفة للمشروع، قوة على غير حكمة، ولو كان عالما بالأمور وليس له قوة على تنفيذها لم يفده الرأي الذي لا ينفذه شيئا { والله واسع } الفضل كثير الكرم، لا يخص برحمته وبره العام أحدا عن أحد، ولا شريفا عن وضيع، ولكنه مع ذلك { عليم } بمن يستحق الفضل فيضعه فيه، فأزال بهذا الكلام ما في قلوبهم من كل ريب وشك وشبهة لتبيينه أن أسباب الملك متوفرة فيه، وأن فضل الله يؤتيه من يشاء من عباده، ليس له راد، ولا لإحسانه صاد.\n                                    "
      },
      "originalText": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ٱللَّهَ قَدۡ بَعَثَ لَكُمۡ طَالُوتَ مَلِكٗاۚ قَالُوٓاْ أَنَّىٰ يَكُونُ لَهُ ٱلۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ أَحَقُّ بِٱلۡمُلۡكِ مِنۡهُ وَلَمۡ يُؤۡتَ سَعَةٗ مِّنَ ٱلۡمَالِۚ قَالَ إِنَّ ٱللَّهَ ٱصۡطَفَىٰهُ عَلَيۡكُمۡ وَزَادَهُۥ بَسۡطَةٗ فِي ٱلۡعِلۡمِ وَٱلۡجِسۡمِۖ وَٱللَّهُ يُؤۡتِي مُلۡكَهُۥ مَن يَشَآءُۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ ٧٤٢"
    },
    {
      "number": 255,
      "text": "وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ آيَةَ مُلْكِهِ أَنْ يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِنْ رَبِّكُمْ وَبَقِيَّةٌ مِمَّا تَرَكَ آلُ مُوسَىٰ وَآلُ هَارُونَ تَحْمِلُهُ الْمَلَائِكَةُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 248,
      "juz": 2,
      "manzil": 1,
      "page": 40,
      "ruku": 33,
      "hizbQuarter": 16,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ءَايَةَ مُلۡكِهِۦٓ أَن يَأۡتِيَكُمُ ٱلتَّابُوتُ فِيهِ سَكِينَةٞ مِّن رَّبِّكُمۡ وَبَقِيَّةٞ مِّمَّا تَرَكَ ءَالُ مُوسَىٰ وَءَالُ هَٰرُونَ تَحۡمِلُهُ ٱلۡمَلَٰٓئِكَةُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ ٨٤٢\n                                    \n                                    \n                                    يقول نبيهم لهم : إن علامة بركة ملك طالوت عليكم أن يرد الله عليكم التابوت الذي كان أخذ منكم .\n( فيه سكينة من ربكم ) قيل : معناه فيه وقار ، وجلالة .\nقال عبد الرزاق عن معمر عن قتادة ( فيه سكينة ) أي : وقار . وقال الربيع : رحمة . وكذا روي عن العوفي عن ابن عباس وقال ابن جريج : سألت عطاء عن قوله : ( فيه سكينة [ من ربكم ] ) قال : ما يعرفون من آيات الله فيسكنون إليه .\nوقيل : السكينة طست من ذهب كانت تغسل فيه قلوب الأنبياء ، أعطاها الله موسى عليه السلام فوضع فيها الألواح . ورواه السدي عن أبي مالك عن ابن عباس .\nوقال سفيان الثوري : عن سلمة بن كهيل عن أبي الأحوص عن علي قال : السكينة لها وجه كوجه الإنسان ثم هي روح هفافة .\nوقال ابن جرير : حدثني [ ابن ] المثنى حدثنا أبو داود حدثنا شعبة وحماد بن سلمة ، وأبو الأحوص كلهم عن سماك عن خالد بن عرعرة عن علي قال : السكينة ريح خجوج ولها رأسان .\nوقال مجاهد : لها جناحان وذنب . وقال محمد بن إسحاق عن وهب بن منبه : السكينة رأس هرة ميتة إذا صرخت في التابوت بصراخ هر ، أيقنوا بالنصر وجاءهم الفتح .\nوقال عبد الرزاق : أخبرنا بكار بن عبد الله أنه سمع وهب بن منبه يقول : السكينة روح من الله تتكلم إذا اختلفوا في شيء تكلم فأخبرهم ببيان ما يريدون .\nوقوله : ( وبقية مما ترك آل موسى وآل هارون ) قال ابن جرير : أخبرنا ابن المثنى حدثنا أبو الوليد حدثنا حماد عن داود بن أبي هند عن عكرمة عن ابن عباس في هذه الآية : ( وبقية مما ترك آل موسى وآل هارون ) قال : عصاه ورضاض الألواح . وكذا قال قتادة والسدي والربيع بن أنس وعكرمة وزاد : والتوراة .\nوقال أبو صالح ( وبقية ) يعني : عصا موسى وعصا هارون ولوحين من التوراة والمن .\nوقال عطية بن سعد : عصا موسى وعصا هارون وثياب موسى وثياب هارون ورضاض الألواح .\nوقال عبد الرزاق : سألت الثوري عن قوله : ( وبقية مما ترك آل موسى وآل هارون ) فقال : منهم من يقول قفيز من من ، ورضاض الألواح . ومنهم من يقول : العصا والنعلان .\nوقوله : ( تحمله الملائكة ) قال ابن جريج : قال ابن عباس : جاءت الملائكة تحمل التابوت بين السماء والأرض حتى وضعته بين يدي طالوت ، والناس ينظرون .\nوقال السدي : أصبح التابوت في دار طالوت فآمنوا بنبوة شمعون وأطاعوا طالوت .\nوقال عبد الرزاق عن الثوري عن بعض أشياخه : جاءت به الملائكة تسوقه على عجلة على بقرة وقيل : على بقرتين .\nوذكر غيره أن التابوت كان بأريحا وكان المشركون لما أخذوه وضعوه في بيت آلهتهم تحت صنمهم الكبير ، فأصبح التابوت على رأس الصنم فأنزلوه فوضعوه تحته فأصبح كذلك فسمروه تحته فأصبح الصنم مكسور القوائم ملقى بعيدا ، فعلموا أن هذا أمر من الله لا قبل لهم به فأخرجوا التابوت من بلدهم ، فوضعوه في بعض القرى فأصاب أهلها داء في رقابهم فأمرتهم جارية من سبي بني إسرائيل أن يردوه إلى بني إسرائيل حتى يخلصوا من هذا الداء ، فحملوه على بقرتين فسارتا به لا يقربه أحد إلا مات ، حتى اقتربتا من بلد بني إسرائيل فكسرتا النيرين ورجعتا وجاء بنو إسرائيل فأخذوه فقيل : إنه تسلمه داود عليه السلام وأنه لما قام إليهما حجل من فرحه بذلك . وقيل : شابان منهم فالله أعلم . وقيل : كان التابوت بقرية من قرى فلسطين يقال لها : أزدرد .\nوقوله : ( إن في ذلك لآية لكم ) أي : على صدقي فيما جئتكم به من النبوة ، وفيما أمرتكم به من\nطاعة طالوت : ( إن كنتم مؤمنين ) أي : بالله واليوم الآخر .\n                                    ",
        "qortoby": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ءَايَةَ مُلۡكِهِۦٓ أَن يَأۡتِيَكُمُ ٱلتَّابُوتُ فِيهِ سَكِينَةٞ مِّن رَّبِّكُمۡ وَبَقِيَّةٞ مِّمَّا تَرَكَ ءَالُ مُوسَىٰ وَءَالُ هَٰرُونَ تَحۡمِلُهُ ٱلۡمَلَٰٓئِكَةُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ ٨٤٢\n                                    \n                                    \n                                    قوله تعالى : وقال لهم نبيهم إن آية ملكه أن يأتيكم التابوت فيه سكينة من ربكم وبقية مما ترك آل موسى وآل هارون تحمله الملائكة إن في ذلك لآية لكم إن كنتم مؤمنين قوله تعالى : وقال لهم نبيهم إن آية ملكه أن يأتيكم التابوت أي إتيان التابوت ، والتابوت كان من شأنه فيما ذكر أنه أنزله الله على آدم عليه السلام ، فكان عنده إلى أن وصل إلى يعقوب عليه السلام ، فكان في بني إسرائيل يغلبون به من قاتلهم حتى عصوا فغلبوا على التابوت غلبهم عليه العمالقة : جالوت وأصحابه في قول السدي ، وسلبوا التابوت منهم .\nقلت : وهذا أدل دليل على أن العصيان سبب الخذلان ، وهذا بين . قال النحاس : والآية في التابوت على ما روي أنه كان يسمع فيه أنين ، فإذا سمعوا ذلك ساروا لحربهم ، وإذا هدأ الأنين لم يسيروا ولم يسر التابوت . وقيل : كانوا يضعونه في مأزق الحرب فلا تزال تغلب حتى عصوا فغلبوا وأخذ منهم التابوت وذل أمرهم ، فلما رأوا آية الاصطلام وذهاب الذكر ، أنف بعضهم وتكلموا في أمرهم حتى اجتمع ملؤهم أن قالوا لنبي الوقت : ابعث لنا ملكا ، فلما قال لهم : ملككم طالوت راجعوه فيه كما أخبر الله عنهم ، فلما قطعهم بالحجة سألوه البينة على ذلك ، في قول الطبري . فلما سألوا نبيهم البينة على ما قال ، دعا ربه فنزل بالقوم الذين أخذوا التابوت داء بسببه ، على خلاف في ذلك . قيل : وضعوه في كنيسة لهم فيها أصنام فكانت الأصنام تصبح منكوسة . وقيل : وضعوه في بيت أصنامهم تحت الصنم الكبير فأصبحوا وهو فوق الصنم ، فأخذوه وشدوه إلى رجليه فأصبحوا وقد قطعت يدا الصنم ورجلاه وألقيت تحت التابوت ، فأخذوه وجعلوه في قرية قوم فأصاب أولئك القوم أوجاع في أعناقهم . وقيل : جعلوه في مخرأة قوم فكانوا يصيبهم الباسور ، فلما عظم بلاؤهم كيفما كان ، قالوا : ما هذا إلا لهذا التابوت فلنرده إلى بني إسرائيل فوضعوه على عجلة بين ثورين وأرسلوهما في الأرض نحو بلاد بني إسرائيل ، وبعث الله ملائكة تسوق البقرتين حتى دخلتا على بني إسرائيل ، وهم في أمر طالوت فأيقنوا بالنصر ، وهذا هو حمل الملائكة للتابوت في هذه الرواية . وروي أن الملائكة جاءت به تحمله وكان يوشع بن نون قد جعله في البرية ، فروي أنهم رأوا التابوت في الهواء حتى نزل بينهم ، قاله الربيع بن خيثم . وقال وهب بن منبه : كان قدر التابوت نحوا من ثلاثة أذرع في ذراعين . الكلبي : وكان من عود شمسار الذي يتخذ منه الأمشاط . وقرأ زيد بن ثابت \" التابوه \" وهي لغته ، والناس على قراءته بالتاء وقد تقدم . وروي عنه \" التيبوت \" ذكره النحاس . وقرأ حميد بن قيس \" يحمله \" بالياء .\nقوله تعالى : فيه سكينة من ربكم اختلف الناس في السكينة والبقية ، فالسكينة فعيلة مأخوذة من السكون والوقار والطمأنينة . فقوله : \" فيه سكينة \" أي هو سبب سكون قلوبكم فيما اختلفتم فيه من أمر طالوت ، ونظيره \" فأنزل الله سكينته عليه \" ؛ أي أنزل عليه ما سكن به قلبه . وقيل : أراد أن التابوت كان سبب سكون قلوبهم ، فأينما كانوا سكنوا إليه ولم يفروا من التابوت إذا كان معهم في الحرب . وقال وهب بن منبه : السكينة روح من الله تتكلم ، فكانوا إذا اختلفوا في أمر نطقت ببيان ما يريدون ، وإذا صاحت في الحرب كان الظفر لهم . وقال علي بن أبي طالب : هي ريح هفافة لها وجه كوجه الإنسان . وروي عنه أنه قال : هي ريح خجوج لها رأسان . وقال مجاهد : حيوان كالهر له جناحان وذنب ولعينيه شعاع ، فإذا نظر إلى الجيش انهزم . وقال ابن عباس : طست من ذهب من الجنة ، كان يغسل فيه قلوب الأنبياء ، وقاله السدي . وقال ابن عطية : والصحيح أن التابوت كانت فيه أشياء فاضلة من بقايا الأنبياء وآثارهم ، فكانت النفوس تسكن إلى ذلك وتأنس به وتقوى .\nقلت : وفي صحيح مسلم عن البراء قال : كان رجل يقرأ سورة \" الكهف \" وعنده فرس مربوط بشطنين فتغشته سحابة فجعلت تدور وتدنو وجعل فرسه ينفر منها ، فلما أصبح أتى النبي صلى الله عليه وسلم فذكر ذلك له فقال : تلك السكينة تنزلت للقرآن . وفي حديث أبي سعيد الخدري : أن أسيد بن الحضير بينما هو ليلة يقرأ في مربده . الحديث ، وفيه : فقال رسول الله صلى الله عليه وسلم : تلك الملائكة كانت تستمع لك ولو قرأت لأصبحت يراها الناس ما تستتر منهم خرجه البخاري ومسلم . فأخبر صلى الله عليه وسلم عن نزول السكينة مرة ، ومرة عن نزول الملائكة ، فدل على أن السكينة كانت في تلك الظلة ، وأنها تنزل أبدا مع الملائكة . وفي هذا حجة لمن قال إن السكينة روح أو شيء له روح لأنه لا يصح استماع القرآن إلا لمن يعقل ، والله أعلم .\nقوله تعالى : ( وبقية ) اختلف في البقية على أقوال ، فقيل : عصا موسى وعصا هارون ورضاض الألواح ؛ لأنها انكسرت حين ألقاها موسى ، قاله ابن عباس . زاد عكرمة : التوراة . وقال أبو صالح : البقية : عصا موسى وثيابه وثياب هارون ولوحان من التوراة . وقال عطية بن سعد : وهي عصا موسى وعصا هارون وثيابهما ورضاض الألواح . وقال الثوري : من الناس من يقول : البقية قفيزا من في طست من ذهب وعصا موسى وعمامة هارون ورضاض الألواح . ومنهم من يقول : العصا والنعلان . ومعنى هذا ما روي من أن موسى لما جاء قومه بالألواح فوجدهم قد عبدوا العجل ، ألقى الألواح غضبا فتكسرت ، فنزع منها ما كان صحيحا وأخذ رضاض ما تكسر فجعله في التابوت . وقال الضحاك : البقية : الجهاد وقتال الأعداء . قال ابن عطية : أي الأمر بذلك في التابوت ، إما أنه مكتوب فيه ، وإما أن نفس الإتيان به هو كالأمر بذلك ، وأسند الترك إلى آل موسى وآل هارون من حيث كان الأمر مندرجا من قوم إلى قوم وكلهم آل موسى وآل هارون . وآل الرجل قرابته . وقد تقدم .\n                                    ",
        "saadi": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ءَايَةَ مُلۡكِهِۦٓ أَن يَأۡتِيَكُمُ ٱلتَّابُوتُ فِيهِ سَكِينَةٞ مِّن رَّبِّكُمۡ وَبَقِيَّةٞ مِّمَّا تَرَكَ ءَالُ مُوسَىٰ وَءَالُ هَٰرُونَ تَحۡمِلُهُ ٱلۡمَلَٰٓئِكَةُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ ٨٤٢\n                                        \n                                        \n                                        \n                                        ثم ذكر لهم نبيهم أيضا آية حسية يشاهدونها وهي إتيان التابوت الذي قد فقدوه زمانا طويلا وفي ذلك التابوت سكينة تسكن بها قلوبهم، وتطمئن لها خواطرهم، وفيه بقية مما ترك آل موسى وآل هارون، فأتت به الملائكة حاملة له وهم يرونه عيانا.\n                                    "
      },
      "originalText": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ءَايَةَ مُلۡكِهِۦٓ أَن يَأۡتِيَكُمُ ٱلتَّابُوتُ فِيهِ سَكِينَةٞ مِّن رَّبِّكُمۡ وَبَقِيَّةٞ مِّمَّا تَرَكَ ءَالُ مُوسَىٰ وَءَالُ هَٰرُونَ تَحۡمِلُهُ ٱلۡمَلَٰٓئِكَةُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ ٨٤٢"
    }
  ]
}