{
  "number": 402,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 3386,
      "text": "۞ وَلَا تُجَادِلُوا أَهْلَ الْكِتَابِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ ۖ وَقُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنَا وَأُنْزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَاحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ",
      "surah": {
        "number": 29,
        "name": "سورة العنكبوت",
        "englishName": "Al-Ankaboot",
        "englishNameTranslation": "The Spider",
        "revelationType": "Meccan",
        "numberOfAyahs": 69
      },
      "numberInSurah": 46,
      "juz": 21,
      "manzil": 5,
      "page": 402,
      "ruku": 346,
      "hizbQuarter": 161,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَلَا تُجَٰدِلُوٓاْ أَهۡلَ ٱلۡكِتَٰبِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡۖ وَقُولُوٓاْ ءَامَنَّا بِٱلَّذِيٓ أُنزِلَ إِلَيۡنَا وَأُنزِلَ إِلَيۡكُمۡ وَإِلَٰهُنَا وَإِلَٰهُكُمۡ وَٰحِدٞ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ٦٤\n                                    \n                                    \n                                    قال قتادة وغير واحد : هذه الآية منسوخة بآية السيف ، ولم يبق معهم مجادلة ، وإنما هو الإسلام أو الجزية أو السيف .\nوقال آخرون : بل هي باقية أو محكمة لمن أراد الاستبصار منهم في الدين ، فيجادل بالتي هي أحسن ، ليكون أنجع فيه ، كما قال تعالى : ( ادع إلى سبيل ربك بالحكمة والموعظة الحسنة وجادلهم بالتي هي أحسن إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بالمهتدين ) [ النحل : 125 ] ، وقال تعالى لموسى وهارون حين بعثهما إلى فرعون : ( فقولا له قولا لينا لعله يتذكر أو يخشى ) [ طه : 44 ] . وهذا القول اختاره ابن جرير ، وحكاه عن ابن زيد .\nوقوله : ( إلا الذين ظلموا منهم ) أي : حادوا عن وجه الحق ، وعموا عن واضح المحجة ، وعاندوا وكابروا ، فحينئذ ينتقل من الجدال إلى الجلاد ، ويقاتلون بما يردعهم ويمنعهم ، قال الله تعالى : ( لقد أرسلنا رسلنا بالبينات وأنزلنا معهم الكتاب والميزان ليقوم الناس بالقسط وأنزلنا الحديد فيه بأس شديد ومنافع للناس وليعلم الله من ينصره ورسله بالغيب إن الله قوي عزيز ) [ الحديد : 25 ] .\nقال جابر : أمرنا من خالف كتاب الله أن نضربه بالسيف .\nقال مجاهد : ( إلا الذين ظلموا منهم ) يعني : أهل الحرب ، ومن امتنع منهم عن أداء الجزية .\nوقوله : ( وقولوا آمنا بالذي أنزل إلينا وأنزل إليكم ) ، يعني : إذا أخبروا بما لا يعلم صدقه ولا كذبه ، فهذا لا نقدم على تكذيبه لأنه قد يكون حقا ، ولا على تصديقه ، فلعله أن يكون باطلا ولكن نؤمن به إيمانا مجملا معلقا على شرط وهو أن يكون منزلا لا مبدلا ولا مؤولا .\nوقال البخاري ، رحمه الله : حدثنا محمد بن بشار ، حدثنا عثمان بن عمر ، أخبرنا علي بن المبارك ، عن يحيى بن أبي كثير ، عن أبي سلمة ، عن أبي هريرة ، رضي الله عنه قال : كان أهل الكتاب يقرءون التوراة بالعبرانية ، ويفسرونها بالعربية لأهل الإسلام ، فقال رسول الله - صلى الله عليه وسلم - : \" لا تصدقوا أهل الكتاب ولا تكذبوهم ، وقولوا : آمنا بالله وما أنزل إلينا وما أنزل إليكم ، وإلهنا وإلهكم واحد ، ونحن له مسلمون \" . وهذا الحديث تفرد به البخاري .\nوقال الإمام أحمد : حدثنا عثمان بن عمر ، أخبرنا يونس ، عن الزهري ، أخبرني ابن أبي نملة أن أبا نملة الأنصاري أخبره ، أنه بينما هو جالس عند رسول الله - صلى الله عليه وسلم - جاءه رجل من اليهود ، فقال : يا محمد ، هل تتكلم هذه الجنازة ؟ قال رسول الله - صلى الله عليه وسلم - : \" الله أعلم \" . قال اليهودي : أنا أشهد أنها تتكلم . فقال رسول الله - صلى الله عليه وسلم - : \" إذا حدثكم أهل الكتاب فلا تصدقوهم ولا تكذبوهم ، وقولوا : آمنا بالله ورسله وكتبه ، فإن كان حقا لم تكذبوهم ، وإن كان باطلا لم تصدقوهم \"\nقلت : وأبو نملة هذا هو : عمارة . وقيل : عمار . وقيل : عمرو بن معاذ بن زرارة الأنصاري ، رضي الله عنه .\nثم ليعلم أن أكثر ما يحدثون به غالبه كذب وبهتان ; لأنه قد دخله تحريف وتبديل وتغيير وتأويل ، وما أقل الصدق فيه ، ثم ما أقل فائدة كثير منه لو كان صحيحا .\nقال ابن جرير : حدثنا ابن بشار ، حدثنا أبو عاصم ، حدثنا سفيان ، عن سليمان بن عامر ، عن عمارة بن عمير ، عن حريث بن ظهير ، عن عبد الله - هو ابن مسعود - قال : لا تسألوا أهل الكتاب عن شيء ، فإنهم لن يهدوكم وقد ضلوا ، إما أن تكذبوا بحق أو تصدقوا بباطل ، فإنه ليس أحد من أهل الكتاب إلا وفي قلبه تالية ، تدعوه إلى دينه كتالية المال .\nوقال البخاري : حدثنا موسى بن إسماعيل حدثنا إبراهيم بن سعد ، أخبرنا ابن شهاب ، عن عبيد الله بن عبد الله ، عن ابن عباس قال : كيف تسألون أهل الكتاب عن شيء ، وكتابكم الذي أنزل على رسوله - صلى الله عليه وسلم - أحدث تقرءونه محضا لم يشب ، وقد حدثكم أن أهل الكتاب بدلوا كتاب الله ، وغيروه وكتبوا بأيديهم الكتاب ، وقالوا : هو من عند الله ، ليشتروا به ثمنا قليلا ؟ ألا ينهاكم ما جاءكم من العلم عن مسألتهم ؟ لا والله ما رأينا منهم رجلا يسألكم عن الذي أنزل عليكم .\nوقال البخاري : وقال أبو اليمان : أخبرنا شعيب ، عن الزهري ، أخبرني حميد بن عبد الرحمن : أنه سمع معاوية يحدث رهطا من قريش بالمدينة - وذكر كعب الأحبار - فقال : إن كان من أصدق هؤلاء المحدثين الذين يحدثون عن أهل الكتاب ، وإن كنا مع ذلك لنبلو عليه الكذب .\nقلت : معناه أنه يقع منه الكذب لغة من غير قصد ; لأنه يحدث عن صحف هو يحسن بها الظن ، وفيها أشياء موضوعة ومكذوبة ; لأنهم لم يكن في ملتهم حفاظ متقنون كهذه الأمة العظيمة ، ومع ذلك وقرب العهد وضعت أحاديث كثيرة في هذه الأمة ، لا يعلمها إلا الله ، ومن منحه الله علما بذلك ، كل بحسبه ، ولله الحمد والمنة .\n                                    ",
        "qortoby": "۞ وَلَا تُجَٰدِلُوٓاْ أَهۡلَ ٱلۡكِتَٰبِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡۖ وَقُولُوٓاْ ءَامَنَّا بِٱلَّذِيٓ أُنزِلَ إِلَيۡنَا وَأُنزِلَ إِلَيۡكُمۡ وَإِلَٰهُنَا وَإِلَٰهُكُمۡ وَٰحِدٞ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ٦٤\n                                    \n                                    \n                                    قوله تعالى : ولا تجادلوا أهل الكتاب إلا بالتي هي أحسن إلا الذين ظلموا منهم وقولوا آمنا بالذي أنزل إلينا وأنزل إليكم وإلهنا وإلهكم واحد ونحن له مسلمون\nفيه مسألتان :\nالأولى : اختلف العلماء في قوله تعالى : ولا تجادلوا أهل الكتاب فقال مجاهد : هي محكمة فيجوز مجادلة أهل الكتاب بالتي هي أحسن على معنى الدعاء لهم إلى الله عز وجل والتنبيه على حججه وآياته ; رجاء إجابتهم إلى الإيمان ، لا على طريق الإغلاظ والمخاشنة . وقوله على هذا : إلا الذين ظلموا منهم معناه : ظلموكم ، وإلا فكلهم ظلمة على الإطلاق . وقيل : المعنى : لا تجادلوا من آمن بمحمد صلى الله عليه وسلم من أهل الكتاب المؤمنين كعبد الله بن سلام ومن آمن معه . إلا بالتي هي أحسن أي بالموافقة فيما حدثوكم به من أخبار أوائلهم وغير ذلك . وقوله على هذا التأويل : إلا الذين ظلموا يريد به من بقي على كفره منهم ، كمن كفر وغدر من قريظة والنضير وغيرهم . والآية على هذا أيضا محكمة . وقيل : هذه الآية منسوخة بآية القتال ; قوله تعالى : قاتلوا الذين لا يؤمنون بالله قاله قتادة إلا الذين ظلموا أي جعلوا لله ولدا ، وقالوا : يد الله مغلولة و إن الله فقير فهؤلاء المشركون الذين نصبوا الحرب ولم يؤدوا الجزية فانتصروا منهم . قال النحاس وغيره : من قال هي منسوخة احتج بأن الآية مكية ولم يكن في ذلك الوقت قتال مفروض ولا طلب جزية ولا غير ذلك وقول مجاهد حسن ; لأن أحكام الله عز وجل لا يقال فيها : إنها منسوخة ، إلا بخبر يقطع العذر أو حجة من معقول . واختار هذا القول ابن العربي .\nقال مجاهد وسعيد بن جبير : وقوله : إلا الذين ظلموا منهم معناه إلا الذين نصبوا للمؤمنين الحرب فجدالهم بالسيف حتى يؤمنوا أو يعطوا الجزية .\nالثانية : قوله تعالى : وقولوا آمنا بالذي أنزل إلينا وأنزل إليكم روى البخاري عن أبي هريرة قال : كان أهل الكتاب يقرءون التوراة بالعبرانية ويفسرونها بالعربية لأهل الإسلام ; فقال رسول الله صلى الله عليه وسلم : لا تصدقوا أهل الكتاب ولا تكذبوهم وقولوا آمنا بالذي أنزل إلينا وأنزل إليكم . وروى عبد الله بن مسعود أن النبي صلى الله عليه وسلم قال : لا تسألوا أهل الكتاب عن شيء فإنهم لن يهدوكم وقد ضلوا ، إما أن تكذبوا بحق وإما أن تصدقوا بباطل . وفي البخاري : عن حميد بن عبد الرحمن سمع معاوية يحدث رهطا من قريش بالمدينة وذكر كعب الأحبار فقال : إن كان من أصدق هؤلاء المحدثين الذين يحدثون عن أهل الكتاب وإن كنا مع ذلك لنبلو عليه الكذب .\n                                    ",
        "saadi": "۞ وَلَا تُجَٰدِلُوٓاْ أَهۡلَ ٱلۡكِتَٰبِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡۖ وَقُولُوٓاْ ءَامَنَّا بِٱلَّذِيٓ أُنزِلَ إِلَيۡنَا وَأُنزِلَ إِلَيۡكُمۡ وَإِلَٰهُنَا وَإِلَٰهُكُمۡ وَٰحِدٞ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ٦٤\n                                        \n                                        \n                                        \n                                        ينهى تعالى عن مجادلة أهل الكتاب، إذا كانت من غير بصيرة من المجادل، أو بغير قاعدة مرضية، وأن لا يجادلوا إلا بالتي هي أحسن، بحسن خلق ولطف ولين كلام، ودعوة إلى الحق وتحسينه، ورد عن الباطل وتهجينه، بأقرب طريق موصل لذلك، وأن لا يكون القصد منها مجرد المجادلة والمغالبة وحب العلو، بل يكون القصد بيان الحق وهداية الخلق، إلا من ظلم من أهل الكتاب، بأن ظهر من قصده وحاله، أنه لا إرادة له في الحق، وإنما يجادل على وجه المشاغبة والمغالبة، فهذا لا فائدة في جداله، لأن المقصود منها ضائع.\n{ وَقُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنَا وَأُنْزِلَ إِلَيْكُمْ وَإِلَهُنَا وَإِلَهُكُمْ وَاحِدٌ } أي: ولتكن مجادلتكم لأهل الكتاب مبنية على الإيمان بما أنزل إليكم وأنزل إليهم، وعلى الإيمان برسولكم ورسولهم، وعلى أن الإله واحد، ولا تكن مناظرتكم إياهم [على وجه] يحصل به القدح في شيء من الكتب الإلهية، أو بأحد من الرسل، كما يفعله الجاهل عند مناظرة الخصوم، يقدح بجميع ما معهم، من حق وباطل، فهذا ظلم، وخروج عن الواجب وآداب النظر، فإن الواجب، أن يرد ما مع الخصم من الباطل، ويقبل ما معه من الحق، ولا يرد الحق لأجل قوله، ولو كان كافرا. وأيضا، فإن بناء مناظرة أهل الكتاب، على هذا الطريق، فيه إلزام لهم بالإقرار بالقرآن، وبالرسول الذي جاء به، فإنه إذا تكلم في الأصول الدينية التي اتفقت عليها الأنبياء والكتب، وتقررت عند المتناظرين، وثبتت حقائقها عندهما، وكانت الكتب السابقة والمرسلون مع القرآن ومحمد صلى اللّه عليه وسلم قد بينتها ودلت عليها وأخبرت بها، فإنه يلزم التصديق بالكتب كلها، والرسل كلهم، وهذا من خصائص الإسلام.\nفأما أن يقال: نؤمن بما دل عليه الكتاب الفلاني، دون الكتاب الفلاني وهو الحق الذي صدق ما قبله، فهذا ظلم وجور، وهو يرجع إلى قوله بالتكذيب، لأنه إذا كذب القرآن الدال عليها، المصدق لما بين يديه من التوراة، فإنه مكذب لما زعم أنه به مؤمن.\nوأيضا، فإن كل طريق تثبت به نبوة أي: نبي كان، فإن مثلها وأعظم منها، دالة على نبوة محمد صلى اللّه عليه وسلم، وكل شبهة يقدح بها في نبوة محمد صلى اللّه عليه وسلم، فإن مثلها أو أعظم منها، يمكن توجيهها إلى نبوة غيره، فإذا ثبت بطلانها في غيره، فثبوت بطلانها في حقه صلى اللّه عليه وسلم أظهر وأظهر.\nوقوله: { وَنَحْنُ لَهُ مُسْلِمُونَ } أي: منقادون مستسلمون لأمره. ومن آمن به، واتخذه إلها، وآمن بجميع كتبه ورسله، وانقاد للّه واتبع رسله، فهو السعيد، ومن انحرف عن هذا الطريق، فهو الشقي.\n                                    "
      },
      "originalText": "۞ وَلَا تُجَٰدِلُوٓاْ أَهۡلَ ٱلۡكِتَٰبِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡۖ وَقُولُوٓاْ ءَامَنَّا بِٱلَّذِيٓ أُنزِلَ إِلَيۡنَا وَأُنزِلَ إِلَيۡكُمۡ وَإِلَٰهُنَا وَإِلَٰهُكُمۡ وَٰحِدٞ وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ٦٤"
    },
    {
      "number": 3387,
      "text": "وَكَذَٰلِكَ أَنْزَلْنَا إِلَيْكَ الْكِتَابَ ۚ فَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يُؤْمِنُونَ بِهِ ۖ وَمِنْ هَٰؤُلَاءِ مَنْ يُؤْمِنُ بِهِ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الْكَافِرُونَ",
      "surah": {
        "number": 29,
        "name": "سورة العنكبوت",
        "englishName": "Al-Ankaboot",
        "englishNameTranslation": "The Spider",
        "revelationType": "Meccan",
        "numberOfAyahs": 69
      },
      "numberInSurah": 47,
      "juz": 21,
      "manzil": 5,
      "page": 402,
      "ruku": 346,
      "hizbQuarter": 161,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَذَٰلِكَ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَۚ فَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يُؤۡمِنُونَ بِهِۦۖ وَمِنۡ هَٰٓؤُلَآءِ مَن يُؤۡمِنُ بِهِۦۚ وَمَا يَجۡحَدُ بِ‍َٔايَٰتِنَآ إِلَّا ٱلۡكَٰفِرُونَ ٧٤\n                                    \n                                    \n                                    قال ابن جرير : يقول الله تعالى : كما أنزلنا الكتب على من قبلك - يا محمد - من الرسل ، كذلك أنزلنا إليك هذا الكتاب .\nوهذا الذي قاله حسن ومناسبة وارتباط جيد .\nوقوله : ( فالذين آتيناهم الكتاب يؤمنون به ) أي : الذين أخذوه فتلوه حق تلاوته من أحبارهم العلماء الأذكياء ، كعبد الله بن سلام ، وسلمان الفارسي ، وأشباههما .\nوقوله : ( ومن هؤلاء من يؤمن به ) ، يعني العرب من قريش وغيرهم ، ( وما يجحد بآياتنا إلا الكافرون ) ، أي : ما يكذب بها ويجحد حقها إلا من يستر الحق بالباطل ، ويغطي ضوء الشمس بالوصائل ، وهيهات .\n                                    ",
        "qortoby": "وَكَذَٰلِكَ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَۚ فَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يُؤۡمِنُونَ بِهِۦۖ وَمِنۡ هَٰٓؤُلَآءِ مَن يُؤۡمِنُ بِهِۦۚ وَمَا يَجۡحَدُ بِ‍َٔايَٰتِنَآ إِلَّا ٱلۡكَٰفِرُونَ ٧٤\n                                    \n                                    \n                                    وَكَذَٰلِكَ أَنزَلْنَا إِلَيْكَ الْكِتَابَ ۚ فَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يُؤْمِنُونَ بِهِ ۖ وَمِنْ هَٰؤُلَاءِ مَن يُؤْمِنُ بِهِ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الْكَافِرُونَ\n                                    ",
        "saadi": "وَكَذَٰلِكَ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَۚ فَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يُؤۡمِنُونَ بِهِۦۖ وَمِنۡ هَٰٓؤُلَآءِ مَن يُؤۡمِنُ بِهِۦۚ وَمَا يَجۡحَدُ بِ‍َٔايَٰتِنَآ إِلَّا ٱلۡكَٰفِرُونَ ٧٤\n                                        \n                                        \n                                        \n                                        أي: { وَكَذَلِكَ أَنْزَلْنَا إِلَيْكَ } يا محمد، هذا { الْكِتَاب } الكريم، المبين كل نبأ عظيم، الداعي إلى كل خلق فاضل، وأمر كامل، المصدق للكتب السابقة، المخبر به الأنبياء الأقدمون.\n{ فَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ } فعرفوه حق معرفته، ولم يداخلهم حسد وهوى.\n{ يُؤْمِنُونَ بِهِ } لأنهم تيقنوا صدقه، بما لديهم من الموافقات، وبما عندهم من البشارات، وبما تميزوا به من معرفة الحسن والقبيح، والصدق والكذب.\n{ وَمِنْ هَؤُلَاءِ } الموجودين { مَنْ يُؤْمِنُ بِهِ } إيمانا عن بصيرة، لا عن رغبته ولا رهبته. { وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الْكَافِرُونَ } الذين دأبهم الجحود للحق والعناد له. وهذا حصر لمن كفر به، أنه لا يكون من أحد قصده متابعة الحق، وإلا، فكل من له قصد صحيح، فإنه لا بد أن يؤمن به، لما اشتمل عليه من البينات، لكل من له عقل، أو ألقى السمع وهو شهيد.\n                                    "
      },
      "originalText": "وَكَذَٰلِكَ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَۚ فَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يُؤۡمِنُونَ بِهِۦۖ وَمِنۡ هَٰٓؤُلَآءِ مَن يُؤۡمِنُ بِهِۦۚ وَمَا يَجۡحَدُ بِ‍َٔايَٰتِنَآ إِلَّا ٱلۡكَٰفِرُونَ ٧٤"
    },
    {
      "number": 3388,
      "text": "وَمَا كُنْتَ تَتْلُو مِنْ قَبْلِهِ مِنْ كِتَابٍ وَلَا تَخُطُّهُ بِيَمِينِكَ ۖ إِذًا لَارْتَابَ الْمُبْطِلُونَ",
      "surah": {
        "number": 29,
        "name": "سورة العنكبوت",
        "englishName": "Al-Ankaboot",
        "englishNameTranslation": "The Spider",
        "revelationType": "Meccan",
        "numberOfAyahs": 69
      },
      "numberInSurah": 48,
      "juz": 21,
      "manzil": 5,
      "page": 402,
      "ruku": 346,
      "hizbQuarter": 161,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كُنتَ تَتۡلُواْ مِن قَبۡلِهِۦ مِن كِتَٰبٖ وَلَا تَخُطُّهُۥ بِيَمِينِكَۖ إِذٗا لَّٱرۡتَابَ ٱلۡمُبۡطِلُونَ ٨٤\n                                    \n                                    \n                                    ثم قال تعالى : ( وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك ) ، أي : قد لبثت في قومك - يا محمد - ومن قبل أن تأتي بهذا القرآن عمرا لا تقرأ كتابا ولا تحسن الكتابة ، بل كل أحد من قومك وغيرهم يعرف أنك رجل أمي لا تقرأ ولا تكتب . وهكذا صفته في الكتب المتقدمة ، كما قال تعالى : ( الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل يأمرهم بالمعروف وينهاهم عن المنكر ) الآية [ الأعراف : 157 ] . وهكذا كان ، صلوات الله وسلامه عليه [ دائما أبدا ] إلى يوم القيامة ، لا يحسن الكتابة ولا يخط سطرا ولا حرفا بيده ، بل كان له كتاب يكتبون بين يديه الوحي والرسائل إلى الأقاليم . ومن زعم من متأخري الفقهاء ، كالقاضي أبي الوليد الباجي ومن تابعه أنه عليه السلام ، كتب يوم الحديبية : \" هذا ما قاضى عليه محمد بن عبد الله \" فإنما حمله على ذلك رواية في صحيح البخاري : \" ثم أخذ فكتب \" : وهذه محمولة على الرواية الأخرى : \" ثم أمر فكتب \" . ولهذا اشتد النكير بين فقهاء المغرب والمشرق على من قال بقول الباجي ، وتبرءوا منه ، وأنشدوا في ذلك أقوالا وخطبوا به في محافلهم : وإنما أراد الرجل - أعني الباجي ، فيما يظهر عنه - أنه كتب ذلك على وجه المعجزة ، لا أنه كان يحسن الكتابة ، كما قال ، عليه الصلاة والسلام إخبارا عن الدجال : \" مكتوب بين عينيه كافر \" وفي رواية : \" ك ف ر ، يقرؤها كل مؤمن \" ، وما أورده بعضهم من الحديث أنه لم يمت ، عليه السلام حتى تعلم الكتابة ، فضعيف لا أصل له ; قال الله تعالى : ( وما كنت تتلو ) أي : تقرأ ( من قبله من كتاب ) لتأكيد النفي ، ( ولا تخطه بيمينك ) تأكيد أيضا ، وخرج مخرج الغالب ، كقوله تعالى : ( ولا طائر يطير بجناحيه ) [ الأنعام : 38 ] .\nوقوله : ( إذا لارتاب المبطلون ) أي : لو كنت تحسنها لارتاب بعض الجهلة من الناس فيقول : إنما تعلم هذا من كتب قبله مأثورة عن الأنبياء ، مع أنهم قالوا ذلك مع علمهم بأنه أمي لا يحسن الكتابة : ( وقالوا أساطير الأولين اكتتبها فهي تملى عليه بكرة وأصيلا ) [ الفرقان : 5 ] ، قال الله تعالى : ( قل أنزله الذي يعلم السر في السموات والأرض إنه كان غفورا رحيما ) [ الفرقان : 6 ] ، وقال هاهنا : ( بل هو آيات بينات في صدور الذين أوتوا العلم ) أي : [ هذا ] القرآن آيات بينة واضحة في الدلالة على الحق ، أمرا ونهيا وخبرا ، يحفظه العلماء ، يسره الله عليهم حفظا وتلاوة وتفسيرا ، كما قال تعالى : ( ولقد يسرنا القرآن للذكر فهل من مدكر ) [ القمر : 17 ] ، وقال رسول الله - صلى الله عليه وسلم - : \" ما من نبي إلا وقد أعطي ما آمن على مثله البشر وإنما كان الذي أوتيته وحيا أوحاه الله إلي ، فأرجو أن أكون أكثرهم تابعا \" .\nوفي حديث عياض بن حمار ، في صحيح مسلم : \" يقول الله تعالى : إني مبتليك ومبتل بك ، ومنزل عليك كتابا لا يغسله الماء ، تقرؤه نائما ويقظان \" . أي : لو غسل الماء المحل المكتوب فيه لما احتيج إلى ذلك المحل ، كما جاء في الحديث الآخر : \" لو كان القرآن في إهاب ، ما أحرقته النار \" ، لأنه محفوظ في الصدور ، ميسر على الألسنة ، مهيمن على القلوب ، معجز لفظا ومعنى ; ولهذا جاء في الكتب المتقدمة ، في صفة هذه الأمة : \" أناجيلهم في صدورهم \" .\n                                    ",
        "qortoby": "وَمَا كُنتَ تَتۡلُواْ مِن قَبۡلِهِۦ مِن كِتَٰبٖ وَلَا تَخُطُّهُۥ بِيَمِينِكَۖ إِذٗا لَّٱرۡتَابَ ٱلۡمُبۡطِلُونَ ٨٤\n                                    \n                                    \n                                    قوله تعالى : وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك إذا لارتاب المبطلون .\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : وما كنت تتلو من قبله من كتاب الضمير في ( قبله ) عائد إلى الكتاب وهو القرآن المنزل على محمد صلى الله عليه وسلم ; أي وما كنت يا محمد تقرأ قبله ولا تختلف إلى أهل الكتاب ; بل أنزلناه إليك في غاية الإعجاز والتضمين للغيوب وغير ذلك فلو كنت ممن يقرأ كتابا ويخط حروفا لارتاب المبطلون أي من أهل الكتاب وكان لهم في ارتيابهم متعلق ، وقالوا : الذي نجده في كتبنا أنه أمي لا يكتب ولا يقرأ ، وليس به . قال مجاهد : كان أهل الكتاب يجدون في كتبهم أن محمدا صلى الله عليه وسلم لا يخط ولا يقرأ ; فنزلت هذه الآية ; قال النحاس : دليلا على نبوته لقريش ; لأنه لا يقرأ ولا يكتب ولا يخالط أهل الكتاب ، ولم يكن بمكة أهل الكتاب فجاءهم بأخبار الأنبياء والأمم وزالت الريبة والشك .\nالثانية : ذكر النقاش في تفسير هذه الآية عن الشعبي أنه قال : ما مات النبي صلى الله عليه وسلم حتى كتب . وأسند أيضا حديث أبي كبشة السلولي ; مضمنه : أنه صلى الله عليه وسلم قرأ صحيفة لعيينة بن حصن وأخبر بمعناها . قال ابن عطية : وهذا كله ضعيف ، وقول الباجي رحمه الله منه .\nقلت : وقع في صحيح مسلم من حديث البراء في صلح الحديبية أن النبي صلى الله عليه وسلم قال لعلي : اكتب الشرط بيننا : بسم الله الرحمن الرحيم هذا ما قاضى عليه محمد رسول الله . فقال له المشركون : لو نعلم أنك رسول الله تابعناك - وفي رواية : بايعناك - ولكن اكتب محمد بن عبد الله فأمر عليا أن يمحاها ، فقال علي : والله لا أمحاها . فقال رسول الله صلى الله عليه وسلم : أرني مكانها فأراه فمحاها ، وكتب : ابن عبد الله [ . . . . الحديث ] قال علماؤنا رضي الله عنهم : وظاهر هذا أنه عليه السلام محا تلك الكلمة التي هي رسول الله - صلى الله عليه وسلم - بيده وكتب مكانها : ابن عبد الله . وقد رواه البخاري بأظهر من هذا فقال : فأخذ رسول الله صلى الله عليه وسلم الكتاب فكتب . وزاد في طريق أخرى : ولا يحسن أن يكتب ، فقال جماعة بجواز هذا الظاهر عليه وأنه كتب بيده ، منهم السمناني وأبو ذر والباجي ، ورأوا أن ذلك غير قادح في كونه أميا ، ولا معارض بقوله : وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك ولا بقوله : إنا أمة أمية لا نكتب ولا نحسب بل رأوه زيادة في معجزاته واستظهارا على صدقه وصحة رسالته ; وذلك أنه كتب من غير تعلم لكتابة ولا تعاط لأسبابها ، وإنما أجرى الله تعالى على يده وقلمه حركات كانت عنها خطوط مفهومها : ابن عبد الله لمن قرأها ، فكان ذلك خارقا للعادة ; كما أنه عليه السلام علم علم الأولين والآخرين من غير تعلم ولا اكتساب فكان ذلك أبلغ في معجزاته وأعظم في فضائله ولا يزول عنه اسم الأمي بذلك ; ولذلك قال الراوي عنه في هذه الحالة : ولا يحسن أن يكتب فبقي عليه اسم الأمي مع كونه قال : كتب . قال شيخنا أبو العباس أحمد بن عمر : وقد أنكر هذا كثير من متفقهة الأندلس وغيرهم وشددوا النكير فيه ، ونسبوا قائله إلى الكفر وذلك دليل على عدم العلوم النظرية وعدم التوقف في تكفير المسلمين ولم يتفطنوا لأن تكفير المسلم كقتله على ما جاء عنه عليه السلام في الصحيح ، لا سيما رمي من شهد له أهل العصر بالعلم والفضل والإمامة ; على أن المسألة ليست قطعية بل مستندها ظواهر أخبار آحاد صحيحة غير أن العقل لا يحيلها وليس في الشريعة قاطع يحيل وقوعها .\nقلت : وقال بعض المتأخرين : من قال : هي آية خارقة فيقال له : كانت تكون آية لا تنكر لولا أنها مناقضة لآية أخرى وهي كونه أميا لا يكتب ; وبكونه أميا في أمة أمية قامت الحجة وأفحم الجاحدون وانحسمت الشبهة فكيف يطلق الله تعالى يده فيكتب وتكون آية وإنما الآية ألا يكتب والمعجزات يستحيل أن يدفع بعضها بعضا وإنما معنى ( كتب وأخذ القلم ) أي أمر من يكتب به من كتابه وكان من كتبة الوحي بين يديه صلى الله عليه وسلم ستة وعشرون كاتبا .\nالثالثة : ذكر القاضي عياض عن معاوية أنه كان يكتب بين يدي النبي صلى الله عليه وسلم فقال له : ألق الدواة وحرف القلم وأقم الباء وفرق السين ولا تعور الميم وحسن ( الله ) ومد ( الرحمن ) وجود ( الرحيم ) قال القاضي : وهذا وإن لم تصح الرواية أنه صلى الله عليه وسلم كتب فلا يبعد أن يرزق علم هذا ويمنع القراءة والكتابة .\nقلت : هذا هو الصحيح في الباب أنه ما كتب ولا حرفا واحدا وإنما أمر من يكتب وكذلك ما قرأ ولا تهجى . فإن قيل : فقد تهجى النبي صلى الله عليه وسلم حين ذكر الدجال فقال : مكتوب بين عينيه ك ا ف ر وقلتم : إن المعجزة قائمة في كونه أميا ; قال الله تعالى : وما كنت تتلو من قبله من كتاب الآية وقال : إنا أمة أمية لا نكتب ولا نحسب فكيف هذا ؟ فالجواب ما نص عليه صلى الله عليه وسلم في حديث حذيفة والحديث كالقرآن يفسر بعضه بعضا ، ففي حديث حذيفة يقرؤه كل مؤمن كاتب وغير كاتب فقد نص في ذلك على غير الكاتب ممن يكون أميا وهذا من أوضح ما يكون جليا .\n                                    ",
        "saadi": "وَمَا كُنتَ تَتۡلُواْ مِن قَبۡلِهِۦ مِن كِتَٰبٖ وَلَا تَخُطُّهُۥ بِيَمِينِكَۖ إِذٗا لَّٱرۡتَابَ ٱلۡمُبۡطِلُونَ ٨٤\n                                        \n                                        \n                                        \n                                        ومما يدل على صحته، أنه جاء به هذا النبي الأمين، الذي عرف قومه صدقه وأمانته ومدخله ومخرجه وسائر أحواله، وهو لا يكتب بيده خطا، ولا يقرأ خطا مكتوبا، فإتيانه به في هذه الحال، من أظهر البينات القاطعة، التي لا تقبل الارتياب، أنه من عند اللّه العزيز الحميد، ولهذا قال: { وَمَا كُنْتَ تَتْلُو } أي: تقرأ { مِنْ قَبْلِهِ مِنْ كِتَابٍ وَلَا تَخُطُّهُ بِيَمِينِكَ إِذًا } لو كنت بهذه الحال { لَارْتَابَ الْمُبْطِلُونَ } فقالوا: تعلمه من الكتب السابقة، أو استنسخه منها، فأما وقد نزل على قلبك، كتابا جليلا، تحديت به الفصحاء والبلغاء، الأعداء الألداء، أن يأتوا بمثله، أو بسورة من مثله، فعجزوا غاية العجز، بل ولا حدثتهم أنفسهم بالمعارضة، لعلمهم ببلاغته وفصاحته، وأن كلام أحد من البشر، لا يبلغ أن يكون مجاريا له أو على منواله، ولهذا قال:\n                                    "
      },
      "originalText": "وَمَا كُنتَ تَتۡلُواْ مِن قَبۡلِهِۦ مِن كِتَٰبٖ وَلَا تَخُطُّهُۥ بِيَمِينِكَۖ إِذٗا لَّٱرۡتَابَ ٱلۡمُبۡطِلُونَ ٨٤"
    },
    {
      "number": 3389,
      "text": "بَلْ هُوَ آيَاتٌ بَيِّنَاتٌ فِي صُدُورِ الَّذِينَ أُوتُوا الْعِلْمَ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الظَّالِمُونَ",
      "surah": {
        "number": 29,
        "name": "سورة العنكبوت",
        "englishName": "Al-Ankaboot",
        "englishNameTranslation": "The Spider",
        "revelationType": "Meccan",
        "numberOfAyahs": 69
      },
      "numberInSurah": 49,
      "juz": 21,
      "manzil": 5,
      "page": 402,
      "ruku": 346,
      "hizbQuarter": 161,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَلۡ هُوَ ءَايَٰتُۢ بَيِّنَٰتٞ فِي صُدُورِ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَۚ وَمَا يَجۡحَدُ بِ‍َٔايَٰتِنَآ إِلَّا ٱلظَّٰلِمُونَ ٩٤\n                                    \n                                    \n                                    واختار ابن جرير أن المعنى في قوله تعالى : ( بل هو آيات بينات في صدور الذين أوتوا العلم ) ، بل العلم بأنك ما كنت تتلو من قبل هذا الكتاب كتابا ولا تخطه بيمينك ، آيات بينات في صدور الذين أوتوا العلم من أهل الكتاب . ونقله عن قتادة ، وابن جريج . وحكى الأول عن الحسن [ البصري ] فقط .\nقلت : وهو الذي رواه العوفي عن عبد الله بن عباس ، وقاله الضحاك ، وهو الأظهر ، والله أعلم .\nوقوله : ( وما يجحد بآياتنا إلا الظالمون ) أي : ما يكذب بها ويبخس حقها ويردها إلا الظالمون ، أي : المعتدون المكابرون ، الذين يعلمون الحق ويحيدون عنه ، كما قال تعالى : ( إن الذين حقت عليهم كلمة ربك لا يؤمنون . ولو جاءتهم كل آية حتى يروا العذاب الأليم ) [ يونس : 96 ، 97 ] .\n                                    ",
        "qortoby": "بَلۡ هُوَ ءَايَٰتُۢ بَيِّنَٰتٞ فِي صُدُورِ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَۚ وَمَا يَجۡحَدُ بِ‍َٔايَٰتِنَآ إِلَّا ٱلظَّٰلِمُونَ ٩٤\n                                    \n                                    \n                                    قوله تعالى : بل هو آيات بينات في صدور الذين أوتوا العلم وما يجحد بآياتنا إلا الظالمون .\nقوله تعالى : بل هو آيات بينات يعني القرآن . قال الحسن : وزعم الفراء في قراءة عبد الله ( بل هي آيات بينات ) المعنى بل آيات القرآن آيات بينات . قال الحسن : ومثله ( هذا بصائر ) ولو كانت ( هذه ) لجاز . نظيره : هذا رحمة من ربي قال الحسن : أعطيت هذه الأمة الحفظ ، وكان من قبلها لا يقرءون كتابهم إلا نظرا فإذا أطبقوه لم يحفظوا ما فيه إلا النبيون ، فقال كعب في صفة هذه الأمة : إنهم حكماء علماء وهم في الفقه أنبياء . في صدور الذين أوتوا العلم أي ليس هذا القرآن كما يقوله المبطلون من أنه سحر أو شعر ، ولكنه علامات ودلائل يعرف بها دين الله وأحكامه ، وهي كذلك في صدور الذين أوتوا العلم وهم أصحاب محمد صلى الله عليه وسلم والمؤمنون به يحفظونه ويقرءونه . ووصفهم بالعلم لأنهم ميزوا بأفهامهم بين كلام الله وكلام البشر والشياطين . وقال قتادة وابن عباس : بل هو - يعني محمدا صلى الله عليه وسلم - آيات بينات في صدور اللذين أوتوا العلم من أهل الكتاب يجدونه مكتوبا عندهم في كتبهم بهذه الصفة أميا لا يقرأ ولا يكتب ، ولكنهم ظلموا أنفسهم وكتموا . وهذا اختيار الطبري . ودليل هذا القول قراءة ابن مسعود وابن السميقع : ( بل هذا آيات بينات ) وكان عليه السلام آيات لا آية واحدة ; لأنه دل على أشياء كثيرة من أمر الدين ; فلهذا قال : بل هو آيات بينات . وقيل : بل هو ذو آيات بينات فحذف المضاف . وما يجحد بآياتنا إلا الظالمون أي الكفار ; لأنهم جحدوا نبوته وما جاء به .\n                                    ",
        "saadi": "بَلۡ هُوَ ءَايَٰتُۢ بَيِّنَٰتٞ فِي صُدُورِ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَۚ وَمَا يَجۡحَدُ بِ‍َٔايَٰتِنَآ إِلَّا ٱلظَّٰلِمُونَ ٩٤\n                                        \n                                        \n                                        \n                                        أي: { بَلْ } هذا القرآن { آيَات بَيِّنَات } لا خفيات، { فِي صُدُورِ الَّذِينَ أُوتُوا الْعِلْمَ } وهم سادة الخلق، وعقلاؤهم، وأولو الألباب منهم، والكمل منهم.\nفإذا كان آيات بينات في صدور أمثال هؤلاء، كانوا حجة على غيرهم، وإنكار غيرهم لا يضر، ولا يكون ذلك إلا ظلما، ولهذا قال: { وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا الظَّالِمُونَ } لأنه لا يجحدها إلا جاهل تكلم بغير علم، ولم يقتد بأهل العلم، وهو متمكن من معرفته على حقيقته، وإما متجاهل عرف أنه حق فعانده، وعرف صدقه فخالفه.\n                                    "
      },
      "originalText": "بَلۡ هُوَ ءَايَٰتُۢ بَيِّنَٰتٞ فِي صُدُورِ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَۚ وَمَا يَجۡحَدُ بِ‍َٔايَٰتِنَآ إِلَّا ٱلظَّٰلِمُونَ ٩٤"
    },
    {
      "number": 3390,
      "text": "وَقَالُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَاتٌ مِنْ رَبِّهِ ۖ قُلْ إِنَّمَا الْآيَاتُ عِنْدَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ",
      "surah": {
        "number": 29,
        "name": "سورة العنكبوت",
        "englishName": "Al-Ankaboot",
        "englishNameTranslation": "The Spider",
        "revelationType": "Meccan",
        "numberOfAyahs": 69
      },
      "numberInSurah": 50,
      "juz": 21,
      "manzil": 5,
      "page": 402,
      "ruku": 346,
      "hizbQuarter": 161,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَٰتٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّمَا ٱلۡأٓيَٰتُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ ٠٥\n                                    \n                                    \n                                    يقول تعالى مخبرا عن المشركين في تعنتهم وطلبهم آيات - يعنون - ترشدهم إلى أن محمدا رسول الله كما جاء صالح بناقته ، قال الله تعالى : ( قل ) يا محمد : ( إنما الآيات عند الله ) أي : إنما أمر ذلك إلى الله ، فإنه لو علم أنكم تهتدون لأجابكم إلى سؤالكم ; لأن ذلك سهل عليه ، يسير لديه ، ولكنه يعلم منكم أنما قصدكم التعنت والامتحان ، فلا يجيبكم إلى ذلك ، كما قال تعالى : ( وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها ) [ الإسراء : 59 ] .\nوقوله : ( وإنما أنا نذير مبين ) أي : إنما بعثت نذيرا لكم بين النذارة فعلي أن أبلغكم رسالة الله و ( من يهد الله فهو المهتد ومن يضلل فلن تجد له وليا مرشدا ) [ الكهف : 17 ] ، وقال تعالى : ( ليس عليك هداهم ولكن الله يهدي من يشاء ) [ البقرة : 272 ] .\n                                    ",
        "qortoby": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَٰتٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّمَا ٱلۡأٓيَٰتُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ ٠٥\n                                    \n                                    \n                                    قوله تعالى : وقالوا لولا أنزل عليه آيات من ربه هذا قول المشركين لرسول الله صلى الله عليه وسلم ، ومعناه هلا أنزل عليه آية كآيات الأنبياء . قيل : كما جاء صالح بالناقة وموسى بالعصا وعيسى بإحياء الموتى ; أي قل لهم يا محمد : إنما الآيات عند الله فهو يأتي بها كما يريد إذا شاء أرسلها وليست عندي وإنما أنا نذير مبين . وقرأ ابن كثير وأبو بكر وحمزة والكسائي : ( آية ) بالتوحيد وجمع الباقون وهو اختيار أبي عبيد ; لقوله تعالى : قل إنما الآيات عند الله .\n                                    ",
        "saadi": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَٰتٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّمَا ٱلۡأٓيَٰتُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ ٠٥\n                                        \n                                        \n                                        \n                                        أي: واعترض هؤلاء الظالمون المكذبون للرسول ولما جاء به، واقترحوا عليه نزول آيات عينوها، كقولهم: { وَقَالُوا لَنْ نُؤْمِنَ لَكَ حَتَّى تَفْجُرَ لَنَا مِنَ الْأَرْضِ يَنْبُوعًا } الآيات. فتعيين الآيات ليس عندهم، ولا عند الرسول صلى اللّه عليه وسلم، فإن في ذلك تدبيرا مع اللّه، وأنه لو كان كذلك، وينبغي أن يكون كذلك، وليس لأحد من الأمر شيء.\nولهذا قال: { قُلْ إِنَّمَا الْآيَاتُ عِنْدَ اللَّهِ } إن شاء أنزلها أو منعها { وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ } وليس لي مرتبة فوق هذه المرتبة.\nوإذا كان القصد بيان الحق من الباطل، فإذا حصل المقصود -بأي: طريق- كان اقتراح الآيات المعينات على ذلك ظلما وجورا، وتكبرا على اللّه وعلى الحق.\nبل لو قدر أن تنزل تلك الآيات، ويكون في قلوبهم أنهم لا يؤمنون بالحق إلا بها، كان ذلك ليس بإيمان، وإنما ذلك شيء وافق أهواءهم، فآمنوا، لا لأنه حق، بل لتلك الآيات. فأي فائدة حصلت في إنزالها على التقدير الفرضي ؟\n                                    "
      },
      "originalText": "وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَٰتٞ مِّن رَّبِّهِۦۚ قُلۡ إِنَّمَا ٱلۡأٓيَٰتُ عِندَ ٱللَّهِ وَإِنَّمَآ أَنَا۠ نَذِيرٞ مُّبِينٌ ٠٥"
    },
    {
      "number": 3391,
      "text": "أَوَلَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَىٰ عَلَيْهِمْ ۚ إِنَّ فِي ذَٰلِكَ لَرَحْمَةً وَذِكْرَىٰ لِقَوْمٍ يُؤْمِنُونَ",
      "surah": {
        "number": 29,
        "name": "سورة العنكبوت",
        "englishName": "Al-Ankaboot",
        "englishNameTranslation": "The Spider",
        "revelationType": "Meccan",
        "numberOfAyahs": 69
      },
      "numberInSurah": 51,
      "juz": 21,
      "manzil": 5,
      "page": 402,
      "ruku": 346,
      "hizbQuarter": 161,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوَ لَمۡ يَكۡفِهِمۡ أَنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ يُتۡلَىٰ عَلَيۡهِمۡۚ إِنَّ فِي ذَٰلِكَ لَرَحۡمَةٗ وَذِكۡرَىٰ لِقَوۡمٖ يُؤۡمِنُونَ ١٥\n                                    \n                                    \n                                    ثم قال تعالى مبينا كثرة جهلهم ، وسخافة عقلهم ، حيث طلبوا آيات تدلهم على صدق محمد فيما جاءهم [ به ] - وقد جاءهم بالكتاب العزيز الذي لا يأتيه الباطل من بين يديه ، ولا من خلفه تنزيل من حكيم حميد ، الذي هو أعظم من كل معجزة ، إذ عجزت الفصحاء والبلغاء عن معارضته ، بل عن معارضة عشر سور من مثله ، بل عن معارضة سورة منه - فقال تعالى : ( أولم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم ) أي : أولم يكفهم آية أنا أنزلنا عليك هذا الكتاب العظيم ، الذي فيه خبر ما قبلهم ، ونبأ ما بعدهم ، وحكم ما بينهم ، وأنت رجل أمي لا تقرأ ولا تكتب ، ولم تخالط أحدا من أهل الكتاب ، فجئتهم بأخبار ما في الصحف الأولى ، ببيان الصواب مما اختلفوا فيه ، وبالحق الواضح البين الجلي ، كما قال تعالى : ( أولم يكن لهم آية أن يعلمه علماء بني إسرائيل ) [ الشعراء : 197 ] ، وقال تعالى : ( وقالوا لولا يأتينا بآية من ربه أولم تأتهم بينة ما في الصحف الأولى ) [ طه : 133 ] .\nوقال الإمام أحمد : حدثنا حجاج ، حدثنا ليث ، حدثني سعيد بن أبي سعيد ، عن أبيه عن أبي هريرة ، رضي الله عنه ، قال : قال رسول الله - صلى الله عليه وسلم - : \" ما من الأنبياء من نبي إلا قد أعطي من الآيات ما مثله آمن عليه البشر ، وإنما كان الذي أوتيته وحيا أوحاه الله إلي ، فأرجو أن أكون أكثرهم تابعا يوم القيامة \" . أخرجاه من حديث الليث .\nوقال الله تعالى : ( إن في ذلك لرحمة وذكرى لقوم يؤمنون ) أي : إن في هذا القرآن : ( لرحمة ) أي : بيانا للحق ، وإزاحة للباطل و ) ذكرى ) بما فيه حلول النقمات ونزول العقاب بالمكذبين والعاصين ، ( لرحمة وذكرى لقوم يؤمنون ) .\n                                    ",
        "qortoby": "أَوَ لَمۡ يَكۡفِهِمۡ أَنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ يُتۡلَىٰ عَلَيۡهِمۡۚ إِنَّ فِي ذَٰلِكَ لَرَحۡمَةٗ وَذِكۡرَىٰ لِقَوۡمٖ يُؤۡمِنُونَ ١٥\n                                    \n                                    \n                                    قوله تعالى : أولم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم هذا جواب لقولهم لولا أنزل عليه آيات من ربه أي أولم يكف المشركين من الآيات هذا الكتاب المعجز الذي قد تحديتهم بأن يأتوا بمثله أو بسورة منه فعجزوا ، ولو أتيتهم بآيات موسى وعيسى لقالوا : سحر ونحن لا نعرف السحر ; والكلام مقدور لهم ومع ذلك عجزوا عن المعارضة .\nوقيل : إن سبب نزول هذه الآيات ما رواه ابن عيينة عن عمرو بن دينار عن يحيى بن جعدة قال : أتي النبي صلى الله عليه وسلم بكتف فيه كتاب فقال كفى بقوم ضلالة أن يرغبوا عما جاء به نبيهم إلى ما جاء به نبي غير نبيهم أو كتاب غير كتابهم فأنزل الله تعالى : أولم يكفهم أنا أنزلنا عليك الكتاب أخرجه أبو محمد الدارمي في مسنده وذكره أهل التفسير في كتبهم . وفي مثل هذا قال صلى الله عليه وسلم لعمر رضي الله عنه : لو كان موسى بن عمران حيا لما وسعه إلا اتباعي وفي مثله قال صلى الله عليه وسلم ليس منا من لم يتغن بالقرآن أي يستغني به عن غيره . وهذا تأويل البخاري رحمه الله في الآية . وإذا كان لقاء ربه بكل حرف عشر حسنات فأكثر على ما ذكرناه في مقدمة الكتاب ; فالرغبة عنه إلى غيره ضلال وخسران وغبن ونقصان ( إن في ذلك ) أي في القرآن ( لرحمة ) في الدنيا والآخرة . وقيل : رحمة في الدنيا باستنفاذهم من الضلالة . ( وذكرى ) في الدنيا بإرشادهم به إلى الحق ( لقوم يؤمنون ) .\n                                    ",
        "saadi": "أَوَ لَمۡ يَكۡفِهِمۡ أَنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ يُتۡلَىٰ عَلَيۡهِمۡۚ إِنَّ فِي ذَٰلِكَ لَرَحۡمَةٗ وَذِكۡرَىٰ لِقَوۡمٖ يُؤۡمِنُونَ ١٥\n                                        \n                                        \n                                        \n                                        ولما كان المقصود بيان الحق، ذكر تعالى طريقه، فقال: { أَوَلَمْ يَكْفِهِمْ } في علمهم بصدقك وصدق ما جئت به { أَنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَى عَلَيْهِمْ } وهذا كلام مختصر جامع، فيه من الآيات البينات، والدلالات الباهرات، شيء كثير، فإنه كما تقدم إتيان الرسول به بمجرده وهو أمي، من أكبر الآيات على صدقه.\nثم عجزهم عن معارضته، وتحديه إياهم آية أخرى، ثم ظهوره، وبروزه جهرا علانية، يتلى عليهم، ويقال: هو من عند اللّه، قد أظهره الرسول، وهو في وقت قلَّ فيه أنصاره، وكثر مخالفوه وأعداؤه، فلم يخفه، ولم يثن ذلك عزمه، بل صرح به على رءوس الأشهاد، ونادى به بين الحاضر والباد، بأن هذا كلام ربي، فهل أحد يقدر على معارضته، أو ينطق بمباراته أو يستطيع مجاراته؟.\nثم إخباره عن قصص الأولين، وأنباء السابقين والغيوب المتقدمة والمتأخرة، مع مطابقته للواقع.\nثم هيمنته على الكتب المتقدمة، وتصحيحه للصحيح، ونَفْيُ ما أدخل فيها من التحريف والتبديل، ثم هدايته لسواء السبيل، في أمره ونهيه، فما أمر بشيء فقال العقل \"ليته لم يأمر به\" ولا نهى عن شيء فقال العقل: \"ليته لم ينه عنه\" بل هو مطابق للعدل والميزان، والحكمة المعقولة لذوي البصائر والعقول [ثم مسايرة إرشاداته وهدايته وأحكامه لكل حال وكل زمان بحيث لا تصلح الأمور إلا به]\nفجميع ذلك يكفي من أراد تصديق الحق، وعمل على طلب الحق، فلا كفى اللّه من لم يكفه القرآن، ولا شفى اللّه من لم يشفه الفرقان، ومن اهتدى به واكتفى، فإنه خير له فلذلك قال: { إِنَّ فِي ذَلِكَ لَرَحْمَةً وَذِكْرَى لِقَوْمٍ يُؤْمِنُونَ } وذلك لما يحصلون فيه من العلم الكثير، والخير الغزير، وتزكية القلوب والأرواح، وتطهير العقائد، وتكميل الأخلاق، والفتوحات الإلهية، والأسرار الربانية.\n                                    "
      },
      "originalText": "أَوَ لَمۡ يَكۡفِهِمۡ أَنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ يُتۡلَىٰ عَلَيۡهِمۡۚ إِنَّ فِي ذَٰلِكَ لَرَحۡمَةٗ وَذِكۡرَىٰ لِقَوۡمٖ يُؤۡمِنُونَ ١٥"
    },
    {
      "number": 3392,
      "text": "قُلْ كَفَىٰ بِاللَّهِ بَيْنِي وَبَيْنَكُمْ شَهِيدًا ۖ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۗ وَالَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ أُولَٰئِكَ هُمُ الْخَاسِرُونَ",
      "surah": {
        "number": 29,
        "name": "سورة العنكبوت",
        "englishName": "Al-Ankaboot",
        "englishNameTranslation": "The Spider",
        "revelationType": "Meccan",
        "numberOfAyahs": 69
      },
      "numberInSurah": 52,
      "juz": 21,
      "manzil": 5,
      "page": 402,
      "ruku": 347,
      "hizbQuarter": 161,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ كَفَىٰ بِٱللَّهِ بَيۡنِي وَبَيۡنَكُمۡ شَهِيدٗاۖ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱلَّذِينَ ءَامَنُواْ بِٱلۡبَٰطِلِ وَكَفَرُواْ بِٱللَّهِ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ ٢٥\n                                    \n                                    \n                                    ثم قال تعالى : قل : ( كفى بالله بيني وبينكم شهيدا ) أي : هو أعلم بما تفيضون فيه من التكذيب ، ويعلم ما أقول لكم من إخباري عنه ، بأنه أرسلني ، فلو كنت كاذبا عليه لانتقم مني ، كما قال تعالى : ( ولو تقول علينا بعض الأقاويل . لأخذنا منه باليمين . ثم لقطعنا منه الوتين . فما منكم من أحد عنه حاجزين ) [ الحاقة : 44 - 47 ] ، وإنما أنا صادق عليه فيما أخبرتكم به ، ولهذا أيدني بالمعجزات الواضحات ، والدلائل القاطعات .\n( يعلم ما في السموات والأرض ) [ أي ] : لا تخفى عليه خافية .\n( والذين آمنوا بالباطل وكفروا بالله أولئك هم الخاسرون ) أي : يوم معادهم سيجزيهم على ما فعلوا ، ويقابلهم على ما صنعوا ، من تكذيبهم بالحق واتباعهم الباطل ، كذبوا برسل الله مع قيام الأدلة على صدقهم ، وآمنوا بالطواغيت والأوثان بلا دليل ، سيجازيهم على ذلك ، إنه حكيم عليم .\n                                    ",
        "qortoby": "قُلۡ كَفَىٰ بِٱللَّهِ بَيۡنِي وَبَيۡنَكُمۡ شَهِيدٗاۖ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱلَّذِينَ ءَامَنُواْ بِٱلۡبَٰطِلِ وَكَفَرُواْ بِٱللَّهِ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ ٢٥\n                                    \n                                    \n                                    قوله تعالى : قل كفى بالله بيني وبينكم شهيدا أي قل للمكذبين لك كفى بالله شهيدا يشهد لي بالصدق فيما أدعيه من أني رسوله وأن هذا القرآن كتابه . يعلم ما في السماوات والأرض أي لا يخفى عليه شيء . وهذا احتجاج عليهم في صحة شهادته عليهم ; لأنهم قد أقروا بعلمه فلزمهم أن يقروا بشهادته والذين آمنوا بالباطل قال يحيى بن سلام : بإبليس . وقيل : بعبادة الأوثان والأصنام ; قاله ابن شجرة . وكفروا بالله أي لتكذيبهم برسله وجحدهم لكتابه . وقيل : بما أشركوا به من الأوثان وأضافوا إليه من الأولاد والأضداد أولئك هم الخاسرون أنفسهم وأعمالهم في الآخرة .\n                                    ",
        "saadi": "قُلۡ كَفَىٰ بِٱللَّهِ بَيۡنِي وَبَيۡنَكُمۡ شَهِيدٗاۖ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱلَّذِينَ ءَامَنُواْ بِٱلۡبَٰطِلِ وَكَفَرُواْ بِٱللَّهِ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ ٢٥\n                                        \n                                        \n                                        \n                                        { قُلْ كَفَى بِاللَّهِ بَيْنِي وَبَيْنَكُمْ شَهِيدًا } فأنا قد استشهدته، فإن كنت كاذبا، أَحَلَّ بي ما به تعتبرون، وإن كان إنما يؤيدني وينصرني وييسر لي الأمور، فلتكفكم هذه الشهادة الجليلة من اللّه، فإن وقع في قلوبكم أن شهادته -وأنتم لم تسمعوه ولم تروه- لا تكفي دليلا، فإنه { يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ }\nومن جملة معلوماته حالي وحالكم، ومقالي لكم فلو كنت متقولا عليه، مع علمه بذلك، وقدرته على عقوبتي، لكان [قدحا في علمه وقدرته وحكمته] كما قال تعالى: { وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْأَقَاوِيلِ لَأَخَذْنَا مِنْهُ بِالْيَمِينِ ثُمَّ لَقَطَعْنَا مِنْهُ الْوَتِينَ }\n{ وَالَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ أُولَئِكَ هُمُ الْخَاسِرُونَ } حيث هم خسروا الإيمان باللّه وملائكته وكتبه ورسله واليوم الآخر، وحيث فاتهم النعيم المقيم، وحيث حصل لهم في مقابلة الحق الصحيح كل باطل قبيح، وفي مقابلة النعيم كل عذاب أليم، فخسروا أنفسهم وأهليهم يوم القيامة.\n                                    "
      },
      "originalText": "قُلۡ كَفَىٰ بِٱللَّهِ بَيۡنِي وَبَيۡنَكُمۡ شَهِيدٗاۖ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱلَّذِينَ ءَامَنُواْ بِٱلۡبَٰطِلِ وَكَفَرُواْ بِٱللَّهِ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ ٢٥"
    }
  ]
}