{
  "number": 41,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 256,
      "text": "فَلَمَّا فَصَلَ طَالُوتُ بِالْجُنُودِ قَالَ إِنَّ اللَّهَ مُبْتَلِيكُمْ بِنَهَرٍ فَمَنْ شَرِبَ مِنْهُ فَلَيْسَ مِنِّي وَمَنْ لَمْ يَطْعَمْهُ فَإِنَّهُ مِنِّي إِلَّا مَنِ اغْتَرَفَ غُرْفَةً بِيَدِهِ ۚ فَشَرِبُوا مِنْهُ إِلَّا قَلِيلًا مِنْهُمْ ۚ فَلَمَّا جَاوَزَهُ هُوَ وَالَّذِينَ آمَنُوا مَعَهُ قَالُوا لَا طَاقَةَ لَنَا الْيَوْمَ بِجَالُوتَ وَجُنُودِهِ ۚ قَالَ الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو اللَّهِ كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصَّابِرِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 249,
      "juz": 2,
      "manzil": 1,
      "page": 41,
      "ruku": 34,
      "hizbQuarter": 16,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَلَمَّا فَصَلَ طَالُوتُ بِٱلۡجُنُودِ قَالَ إِنَّ ٱللَّهَ مُبۡتَلِيكُم بِنَهَرٖ فَمَن شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّي وَمَن لَّمۡ يَطۡعَمۡهُ فَإِنَّهُۥ مِنِّيٓ إِلَّا مَنِ ٱغۡتَرَفَ غُرۡفَةَۢ بِيَدِهِۦۚ فَشَرِبُواْ مِنۡهُ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ فَلَمَّا جَاوَزَهُۥ هُوَ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ قَالُواْ لَا طَاقَةَ لَنَا ٱلۡيَوۡمَ بِجَالُوتَ وَجُنُودِهِۦۚ قَالَ ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُواْ ٱللَّهِ كَم مِّن فِئَةٖ قَلِيلَةٍ غَلَبَتۡ فِئَةٗ كَثِيرَةَۢ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ ٩٤٢\n                                    \n                                    \n                                    يقول تعالى مخبرا عن طالوت ملك بني إسرائيل حين خرج في جنوده ومن أطاعه من ملأ بني إسرائيل وكان جيشه يومئذ فيما ذكره السدي ثمانين ألفا فالله أعلم ، أنه قال : ( إن الله مبتليكم [ بنهر ] ) قال ابن عباس وغيره : وهو نهر بين الأردن وفلسطين يعني : نهر الشريعة المشهور ( فمن شرب منه فليس مني ) أي : فلا يصحبني اليوم في هذا الوجه ( ومن لم يطعمه فإنه مني إلا من اغترف غرفة بيده ) أي : فلا بأس عليه قال الله تعالى ( فشربوا منه إلا قليلا منهم ) قال ابن جريج : قال ابن عباس : من اغترف منه بيده روي ، ومن شرب منه لم يرو . وكذا رواه السدي عن أبي مالك ، عن ابن عباس . وكذا قال قتادة وابن شوذب .\nوقال السدي : كان الجيش ثمانين ألفا فشرب ستة وسبعون ألفا وتبقى معه أربعة آلاف كذا قال .\nوقد روى ابن جرير من طريق إسرائيل وسفيان الثوري ومسعر بن كدام عن أبي إسحاق السبيعي ، عن البراء بن عازب قال : كنا نتحدث أن أصحاب محمد صلى الله عليه وسلم الذين كانوا يوم بدر ثلاثمائة وبضعة عشر على عدة أصحاب طالوت الذين جازوا معه النهر ، وما جازه معه إلا مؤمن . ورواه البخاري عن عبد الله بن رجاء عن إسرائيل بن يونس عن أبي إسحاق عن البراء قال : \" كنا أصحاب محمد صلى الله عليه وسلم نتحدث أن عدة أصحاب بدر على عدة أصحاب طالوت ، الذين جازوا معه النهر ، ولم يجاوز معه إلا مؤمن بضعة عشر وثلاثمائة \" .\nثم رواه من حديث سفيان الثوري وزهير ، عن أبي إسحاق عن البراء بنحوه ولهذا قال تعالى : ( فلما جاوزه هو والذين آمنوا معه قالوا لا طاقة لنا اليوم بجالوت وجنوده ) أي : استقلوا أنفسهم عن لقاء عدوهم لكثرتهم فشجعهم علماؤهم [ وهم ] العالمون بأن وعد الله حق فإن النصر من عند الله ليس عن كثرة عدد ولا عدد . ولهذا قالوا : ( كم من فئة قليلة غلبت فئة كثيرة بإذن الله والله مع الصابرين )\n                                    ",
        "qortoby": "فَلَمَّا فَصَلَ طَالُوتُ بِٱلۡجُنُودِ قَالَ إِنَّ ٱللَّهَ مُبۡتَلِيكُم بِنَهَرٖ فَمَن شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّي وَمَن لَّمۡ يَطۡعَمۡهُ فَإِنَّهُۥ مِنِّيٓ إِلَّا مَنِ ٱغۡتَرَفَ غُرۡفَةَۢ بِيَدِهِۦۚ فَشَرِبُواْ مِنۡهُ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ فَلَمَّا جَاوَزَهُۥ هُوَ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ قَالُواْ لَا طَاقَةَ لَنَا ٱلۡيَوۡمَ بِجَالُوتَ وَجُنُودِهِۦۚ قَالَ ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُواْ ٱللَّهِ كَم مِّن فِئَةٖ قَلِيلَةٍ غَلَبَتۡ فِئَةٗ كَثِيرَةَۢ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ ٩٤٢\n                                    \n                                    \n                                    فلما فصل طالوت بالجنود قال إن الله مبتليكم بنهر فمن شرب منه فليس مني ومن لم يطعمه فإنه مني إلا من اغترف غرفة بيده فشربوا منه إلا قليلا منهم فلما جاوزه هو والذين آمنوا معه قالوا لا طاقة لنا اليوم بجالوت وجنوده قال الذين يظنون أنهم ملاقو الله كم من فئة قليلة غلبت فئة كثيرة بإذن الله والله مع الصابرين فيه إحدى عشرة مسألة : الأولى : قوله تعالى : فلما فصل طالوت بالجنود \" فصل \" معناه خرج بهم . فصلت الشيء فانفصل ، أي قطعته فانقطع . قال وهب بن منبه : فلما فصل طالوت قالوا له : إن المياه لا تحملنا فادع الله أن يجري لنا نهرا فقال لهم طالوت : إن الله مبتليكم بنهر . وكان عدد الجنود - في قول السدي - ثمانين ألفا . وقال وهب : لم يتخلف عنه إلا ذو عذر من صغر أو كبر أو مرض . والابتلاء : الاختبار . والنهر والنهر لغتان . واشتقاقه من السعة ، ومنه النهار وقد تقدم . قال قتادة : النهر الذي ابتلاهم الله به هو نهر بين الأردن وفلسطين . وقرأ الجمهور \" بنهر \" بفتح الهاء . وقرأ مجاهد وحميد الأعرج \" بنهر \" بإسكان الهاء . ومعنى هذا الابتلاء أنه اختبار لهم ، فمن ظهرت طاعته في ترك الماء علم أنه مطيع فيما عدا ذلك ، ومن غلبته شهوته في الماء وعصى الأمر فهو في العصيان في الشدائد أحرى ، فروي أنهم أتوا النهر وقد نالهم عطش وهو في غاية العذوبة والحسن ، فلذلك رخص للمطيعين في الغرفة ليرتفع عنهم أذى العطش بعض الارتفاع وليكسروا نزاع النفس في هذه الحال . وبين أن الغرفة كافة ضرر العطش عند الحزمة الصابرين على شظف العيش الذين همهم في غير الرفاهية ، كما قال عروة :\nواحسوا قراح الماء والماء بارد\nقلت : ومن هذا المعنى قوله عليه السلام : حسب المرء لقيمات يقمن صلبه . وقاله بعض من يتعاطى غوامض المعاني : هذه الآية مثل ضربه الله للدنيا فشبهها الله بالنهر والشارب منه والمائل إليها والمستكثر منها والتارك لشربه بالمنحرف عنها والزاهد فيها ، والمغترف بيده غرفة بالآخذ منها قدر الحاجة ، وأحوال الثلاثة عند الله مختلفة .\nقلت : ما أحسن هذا لولا ما فيه من التحريف في التأويل والخروج عن الظاهر ، لكن معناه صحيح من غير هذا .\nالثانية : استدل من قال إن طالوت كان نبيا بقوله : \" إن الله مبتليكم \" وأن الله أوحى إليه بذلك وألهمه ، وجعل الإلهام ابتلاء من الله لهم . ومن قال لم يكن نبيا قال : أخبره نبيهم شمويل بالوحي حين أخبر طالوت قومه بهذا ، وإنما وقع هذا الابتلاء ليتميز الصادق من الكاذب . وقد ذهب قوم إلى أن عبد الله بن حذافة السهمي صاحب رسول الله صلى الله عليه وسلم إنما أمر أصحابه بإيقاد النار والدخول فيها تجربة لطاعتهم ؛ لكنه حمل مزاحه على تخشين الأمر الذي كلفهم ، وسيأتي بيانه في ( النساء ) إن شاء الله تعالى .\nالثالثة : قوله تعالى : فمن شرب منه فليس مني شرب قيل معناه كرع . ومعنى فليس مني أي ليس من أصحابي في هذه الحرب ، ولم يخرجهم بذلك عن الإيمان . قال السدي : كانوا ثمانين ألفا ، ولا محالة أنه كان فيهم المؤمن والمنافق والمجد والكسلان ، وفي الحديث من غشنا فليس منا أي ليس من أصحابنا ولا على طريقتنا وهدينا . قال ( هو النابغة الذبياني ) :\nإذا حاولت في أسد فجورا فإني لست منك ولست مني\nوهذا مهيع في كلام العرب ، يقول الرجل لابنه إذا سلك غير أسلوبه : لست مني .\nالرابعة : قوله تعالى : ومن لم يطعمه فإنه مني يقال : طعمت الشيء أي ذقته . وأطعمته الماء أي أذقته ، ولم يقل ومن لم يشربه لأن من عادة العرب إذا كرروا شيئا أن يكرروه بلفظ آخر ، ولغة القرآن أفصح اللغات ، فلا عبرة بقدح من يقول : لا يقال طعمت الماء .\nالخامسة : استدل علماؤنا بهذا على القول بسد الذرائع ؛ لأن أدنى الذوق يدخل في لفظ الطعم ، فإذا وقع النهي عن الطعم فلا سبيل إلى وقوع الشرب ممن يتجنب الطعم ، ولهذه المبالغة لم يأت الكلام \" ومن لم يشرب منه \" .\nالسادسة : لما قال تعالى : ومن لم يطعمه دل على أن الماء طعام وإذا كان طعاما كان قوتا لبقائه واقتيات الأبدان به فوجب أن يجري فيه الربا ، قال ابن العربي : وهو الصحيح من المذهب . قال أبو عمر قال مالك : لا بأس ببيع الماء على الشط بالماء متفاضلا وإلى أجل ، وهو قول أبي حنيفة وأبي يوسف . وقال محمد بن الحسن : هو مما يكال ويوزن ، فعلى هذا القول لا يجوز عند التفاضل ، وذلك عنده فيه ربا ؛ لأن علته في الربا الكيل والوزن . وقال الشافعي : لا يجوز بيع الماء متفاضلا ولا يجوز فيه الأجل ، وعلته في الربا أن يكون مأكولا جنسا .\nالسابعة : قال ابن العربي قال أبو حنيفة : من قال إن شرب عبدي فلان من الفرات فهو حر فلا يعتق إلا أن يكرع فيه ، والكرع أن يشرب الرجل بفيه من النهر ، فإن شرب بيده أو اغترف بالإناء منه لم يعتق ؛ لأن الله سبحانه فرق بين الكرع في النهر وبين الشرب باليد . قال : وهذا فاسد لأن شرب الماء يطلق على كل هيئة وصفة في لسان العرب من غرف باليد أو كرع بالفم انطلاقا واحدا ، فإذا وجد الشرب المحلوف عليه لغة وحقيقة حنث ، فاعلمه .\nقلت : قول أبي حنيفة أصح ، فإن أهل اللغة فرقوا بينهما كما فرق الكتاب والسنة . قال الجوهري وغيره : وكرع في الماء كروعا إذا تناوله بفيه من موضعه من غير أن يشرب بكفيه ولا بإناء ، وفيه لغة أخرى ( كرع ) بكسر الراء يكرع كرعا . والكرع : ماء السماء يكرع فيه . وأما السنة فذكر ابن ماجه في سننه : حدثنا واصل بن عبد الأعلى حدثنا ابن فضيل عن ليث عن سعيد بن عامر عن ابن عمر قال : مررنا على بركة فجعلنا نكرع فيها فقال رسول الله صلى الله عليه وسلم : لا تكرعوا ولكن اغسلوا أيديكم ثم اشربوا فيها فإنه ليس إناء أطيب من اليد وهذا نص . وليث بن أبي سليم خرج له مسلم وقد ضعف .\nالثامنة : قوله تعالى : إلا من اغترف غرفة بيده الاغتراف : الأخذ من الشيء باليد وبآلة ، ومنه المغرفة ، والغرف مثل الاغتراف . وقرئ \" غرفة \" بفتح الغين وهي مصدر ، ولم يقل ( اغترافة ) ؛ لأن معنى الغرف والاغتراف واحد . والغرفة المرة الواحدة . وقرئ \" غرفة \" بضم الغين وهي الشيء المغترف . وقال بعض المفسرين : الغرفة بالكف الواحد والغرفة بالكفين . وقال بعضهم : كلاهما لغتان بمعنى واحد . وقال علي رضي الله عنه : الأكف أنظف الآنية ، ومنه قول الحسن :\nلا يدلفون إلى ماء بآنية إلا اغترافا من الغدران بالراح\nالدليف : المشي الرويد .\nقلت : ومن أراد الحلال الصرف في هذه الأزمان دون شبهة ولا امتراء ولا ارتياب فليشرب بكفيه الماء من العيون والأنهار المسخرة بالجريان آناء الليل وآناء النهار ، مبتغيا بذلك من الله كسب الحسنات ووضع الأوزار واللحوق بالأئمة الأبرار ، قال رسول الله صلى الله عليه وسلم : من شرب بيده وهو يقدر على إناء يريد به التواضع كتب الله له بعدد أصابعه حسنات وهو إناء عيسى ابن مريم عليهما السلام إذ طرح القدح فقال أف هذا مع الدنيا . خرجه ابن ماجه من حديث ابن عمر قال : نهى رسول الله صلى الله عليه وسلم أن نشرب على بطوننا وهو الكرع ، ونهانا أن نغترف باليد الواحدة ، وقال : لا يلغ أحدكم كما يلغ الكلب ولا يشرب باليد الواحدة كما يشرب القوم الذين سخط الله عليهم ولا يشرب بالليل في إناء حتى يحركه إلا أن يكون إناء مخمرا ومن شرب بيده وهو يقدر على إناء . . . الحديث كما تقدم ، وفي إسناده بقية بن الوليد ، قال أبو حاتم : يكتب حديثه ولا يحتج به . وقال أبو زرعة : إذا حدث بقية عن الثقات فهو ثقة .\nالتاسعة : فشربوا منه إلا قليلا منهم قال ابن عباس : شربوا على قدر يقينهم فشرب الكفار شرب الهيم وشرب العاصون دون ذلك ، وانصرف من القوم ستة وسبعون ألفا وبقي بعض المؤمنين لم يشرب شيئا وأخذ بعضهم الغرفة ، فأما من شرب فلم يرو ، بل برح به العطش ، وأما من ترك الماء فحسنت حاله وكان أجلد ممن أخذ الغرفة .\nالعاشرة : قوله تعالى : فلما جاوزه هو الهاء تعود على النهر ، و \" هو \" توكيد . \" والذين \" في موضع رفع عطفا على المضمر في \" جاوزه \" يقال : جاوزت المكان مجاوزة وجوازا . والمجاز في الكلام ما جاز في الاستعمال ونفذ واستمر على وجهه . قال ابن عباس والسدي : جاز معه في النهر أربعة آلاف رجل فيهم من شرب ، فلما نظروا إلى جالوت وجنوده وكانوا مائة ألف كلهم شاكون في السلاح رجع منهم ثلاثة آلاف وستمائة وبضعة وثمانون ، فعلى هذا القول قال المؤمنون الموقنون بالبعث والرجوع إلى الله تعالى عند ذلك وهم عدة أهل بدر : كم من فئة قليلة غلبت فئة كثيرة بإذن الله . وأكثر المفسرين : على أنه إنما جاز معه النهر من لم يشرب جملة ، فقال بعضهم : كيف نطيق العدو مع كثرتهم! فقال أولو العزم منهم : كم من فئة قليلة غلبت فئة كثيرة بإذن الله . قال البراء بن عازب : كنا نتحدث أن عدة أهل بدر كعدة أصحاب طالوت الذين جاوزوا معه النهر ثلاثمائة وبضعة عشر رجلا - وفي رواية : وثلاثة عشر رجلا - وما جاز معه إلا مؤمن .\nالحادية عشرة : قوله تعالى : قال الذين يظنون والظن هنا بمعنى اليقين ، ويجوز أن يكون شكا لا علما ، أي قال الذين يتوهمون أنهم يقتلون مع طالوت فيلقون الله شهداء ، فوقع الشك في القتل .\nقوله تعالى : كم من فئة قليلة غلبت فئة كثيرة الفئة : الجماعة من الناس والقطعة منهم ، من فأوت رأسه بالسيف وفأيته أي قطعته . وفي قولهم رضي الله عنهم : ( كم من فئة قليلة ) الآية ، تحريض على القتال واستشعار للصبر واقتداء بمن صدق ربه .\nقلت : هكذا يجب علينا نحن أن نفعل ؟ لكن الأعمال القبيحة والنيات الفاسدة منعت من ذلك حتى ينكسر العدد الكبير منا قدام اليسير من العدو كما شاهدناه غير مرة ، وذلك بما كسبت أيدينا وفي البخاري : قال أبو الدرداء : إنما تقاتلون بأعمالكم . وفيه مسند أن النبي صلى الله عليه وسلم قال : هل ترزقون وتنصرون إلا بضعفائكم . فالأعمال فاسدة والضعفاء مهملون والصبر قليل والاعتماد ضعيف والتقوى زائلة . قال الله تعالى : اصبروا وصابروا ورابطوا واتقوا الله ، وقال : وعلى الله فتوكلوا ، وقال : إن الله مع الذين اتقوا والذين هم محسنون ، وقال : ولينصرن الله من ينصره ، وقال : إذا لقيتم فئة فاثبتوا واذكروا الله كثيرا لعلكم تفلحون . فهذه أسباب النصر وشروطه وهي معدومة عندنا غير موجودة فينا ، فإنا لله وإنا إليه راجعون على ما أصابنا وحل بنا بل لم يبق من الإسلام إلا ذكره ، ولا من الدين إلا رسمه لظهور الفساد ولكثرة الطغيان وقلة الرشاد حتى استولى العدو شرقا وغربا برا وبحرا ، وعمت الفتن وعظمت المحن ولا عاصم إلا من رحم .\n                                    ",
        "saadi": "فَلَمَّا فَصَلَ طَالُوتُ بِٱلۡجُنُودِ قَالَ إِنَّ ٱللَّهَ مُبۡتَلِيكُم بِنَهَرٖ فَمَن شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّي وَمَن لَّمۡ يَطۡعَمۡهُ فَإِنَّهُۥ مِنِّيٓ إِلَّا مَنِ ٱغۡتَرَفَ غُرۡفَةَۢ بِيَدِهِۦۚ فَشَرِبُواْ مِنۡهُ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ فَلَمَّا جَاوَزَهُۥ هُوَ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ قَالُواْ لَا طَاقَةَ لَنَا ٱلۡيَوۡمَ بِجَالُوتَ وَجُنُودِهِۦۚ قَالَ ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُواْ ٱللَّهِ كَم مِّن فِئَةٖ قَلِيلَةٍ غَلَبَتۡ فِئَةٗ كَثِيرَةَۢ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ ٩٤٢\n                                        \n                                        \n                                        \n                                        أي: لما تملَّك طالوت ببني إسرائيل واستقر له الملك تجهزوا لقتال عدوهم، فلما فصل طالوت بجنود بني إسرائيل وكانوا عددا كثيرا وجما غفيرا، امتحنهم بأمر الله ليتبين الثابت المطمئن ممن ليس كذلك فقال: { إن الله مبتليكم بنهر فمن شرب منه فليس مني } فهو عاص ولا يتبعنا لعدم صبره وثباته ولمعصيته { ومن لم يطعمه } أي: لم يشرب منه فإنه مني { إلا من اغترف غرفة بيده } فلا جناح عليه في ذلك، ولعل الله أن يجعل فيها بركة فتكفيه، وفي هذا الابتلاء ما يدل على أن الماء قد قل عليهم ليتحقق الامتحان، فعصى أكثرهم وشربوا من النهر الشرب المنهي عنه، ورجعوا على أعقابهم ونكصوا عن قتال عدوهم وكان في عدم صبرهم عن الماء ساعة واحدة أكبر دليل على عدم صبرهم على القتال الذي سيتطاول وتحصل فيه المشقة الكبيرة، وكان في رجوعهم عن باقي العسكر ما يزداد به الثابتون توكلا على الله، وتضرعا واستكانة وتبرؤا من حولهم وقوتهم، وزيادة صبر لقلتهم وكثرة عدوهم، فلهذا قال تعالى: { فلما جاوزه } أي: النهر { هو } أي: طالوت { والذين آمنوا معه } وهم الذين أطاعوا أمر الله ولم يشربوا من النهر الشرب المنهي عنه فرأوا... قلتهم وكثرة أعدائهم، قالوا أي: قال كثير منهم { لا طاقة لنا اليوم بجالوت وجنوده } لكثرتهم وعَددهم وعُددهم { قال الذين يظنون أنهم ملاقوا الله } أي: يستيقنون ذلك، وهم أهل الإيمان الثابت واليقين الراسخ، مثبتين لباقيهم ومطمئنين لخواطرهم، وآمرين لهم بالصبر { كم من فئة قليلة غلبت فئة كثيرة بإذن الله } أي: بإرادته ومشيئته فالأمر لله تعالى، والعزيز من أعزه الله، والذليل من أذله الله، فلا تغني الكثرة مع خذلانه، ولا تضر القلة مع نصره، { والله مع الصابرين } بالنصر والمعونة والتوفيق، فأعظم جالب لمعونة الله صبر العبد لله، فوقعت موعظته في قلوبهم وأثرت معهم.\n                                    "
      },
      "originalText": "فَلَمَّا فَصَلَ طَالُوتُ بِٱلۡجُنُودِ قَالَ إِنَّ ٱللَّهَ مُبۡتَلِيكُم بِنَهَرٖ فَمَن شَرِبَ مِنۡهُ فَلَيۡسَ مِنِّي وَمَن لَّمۡ يَطۡعَمۡهُ فَإِنَّهُۥ مِنِّيٓ إِلَّا مَنِ ٱغۡتَرَفَ غُرۡفَةَۢ بِيَدِهِۦۚ فَشَرِبُواْ مِنۡهُ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ فَلَمَّا جَاوَزَهُۥ هُوَ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ قَالُواْ لَا طَاقَةَ لَنَا ٱلۡيَوۡمَ بِجَالُوتَ وَجُنُودِهِۦۚ قَالَ ٱلَّذِينَ يَظُنُّونَ أَنَّهُم مُّلَٰقُواْ ٱللَّهِ كَم مِّن فِئَةٖ قَلِيلَةٍ غَلَبَتۡ فِئَةٗ كَثِيرَةَۢ بِإِذۡنِ ٱللَّهِۗ وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ ٩٤٢"
    },
    {
      "number": 257,
      "text": "وَلَمَّا بَرَزُوا لِجَالُوتَ وَجُنُودِهِ قَالُوا رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 250,
      "juz": 2,
      "manzil": 1,
      "page": 41,
      "ruku": 34,
      "hizbQuarter": 16,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَمَّا بَرَزُواْ لِجَالُوتَ وَجُنُودِهِۦ قَالُواْ رَبَّنَآ أَفۡرِغۡ عَلَيۡنَا صَبۡرٗا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٠٥٢\n                                    \n                                    \n                                    أي : لما واجه حزب الإيمان وهم قليل من أصحاب طالوت لعدوهم أصحاب جالوت وهم عدد كثير ( قالوا ربنا أفرغ علينا صبرا ) أي : أنزل علينا صبرا من عندك ( وثبت أقدامنا ) أي : في لقاء الأعداء وجنبنا الفرار والعجز ( وانصرنا على القوم الكافرين )\nقال الله تعالى : ( فهزموهم بإذن الله ) أي : غلبوهم وقهروهم بنصر الله لهم ( وقتل داود جالوت ) ذكروا في الإسرائيليات : أنه قتله بمقلاع كان في يده رماه به فأصابه فقتله ، وكان طالوت قد وعده إن قتل جالوت أن يزوجه ابنته ويشاطره نعمته ويشركه في أمره فوفى له ثم آل الملك إلى داود عليه السلام مع ما منحه الله به من النبوة العظيمة ; ولهذا قال تعالى : ( وآتاه الله الملك ) الذي كان بيد طالوت ( والحكمة ) أي : النبوة بعد شمويل ( وعلمه مما يشاء ) أي : مما يشاء الله من العلم الذي اختصه به صلى الله عليه وسلم ثم قال تعالى : ( ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض ) أي : لولاه يدفع عن قوم بآخرين ، كما دفع عن بني إسرائيل بمقاتلة طالوت وشجاعة داود لهلكوا كما قال : ( ولولا دفع الله الناس بعضهم ببعض لهدمت صوامع وبيع وصلوات ومساجد يذكر فيها اسم الله كثيرا ) الآية [ الحج : 40 ] .\nوقال ابن جرير ، رحمه الله : حدثني أبو حميد الحمصي أحمد بن المغيرة حدثنا يحيى بن سعيد حدثنا حفص بن سليمان عن محمد بن سوقة عن وبرة بن عبد الرحمن عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : \" إن الله ليدفع بالمسلم الصالح عن مائة أهل بيت من جيرانه البلاء \" . ثم قرأ ابن عمر : ( ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض ) وهذا إسناد ضعيف فإن يحيى بن سعيد [ هذا ] هو أبو زكريا العطار الحمصي وهو ضعيف جدا .\nثم قال ابن جرير : حدثنا أبو حميد الحمصي حدثنا يحيى بن سعيد حدثنا عثمان بن عبد الرحمن عن محمد بن المنكدر عن جابر بن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" إن الله ليصلح بصلاح الرجل المسلم ولده وولد ولده وأهل دويرته ودويرات حوله ، ولا يزالون في حفظ الله عز وجل ما دام فيهم \" .\nوهذا أيضا غريب ضعيف لما تقدم أيضا . وقال أبو بكر بن مردويه : حدثنا محمد بن أحمد بن إبراهيم أخبرنا علي بن إسماعيل بن حماد أخبرنا أحمد بن محمد بن يحيى بن سعيد أخبرنا زيد بن الحباب ، حدثني حماد بن زيد عن أيوب عن أبي قلابة عن أبي أسماء عن ثوبان رفع الحديث قال : \" لا يزال فيكم سبعة بهم تنصرون وبهم تمطرون وبهم ترزقون حتى يأتي أمر الله \" .\nوقال ابن مردويه أيضا : وحدثنا محمد بن أحمد حدثنا محمد بن جرير بن يزيد ، حدثنا أبو معاذ نهار بن عثمان الليثي أخبرنا زيد بن الحباب أخبرني عمر البزار ، عن عنبسة الخواص ، عن قتادة عن أبي قلابة عن أبي الأشعث الصنعاني عن عبادة بن الصامت قال : قال رسول الله صلى الله عليه وسلم : \" الأبدال في أمتي ثلاثون بهم تقوم الأرض ، وبهم تمطرون وبهم تنصرون \" قال قتادة : إني لأرجو أن يكون الحسن منهم .\nوقوله : ( ولكن الله ذو فضل على العالمين ) أي : من عليهم ورحمة بهم ، يدفع عنهم ببعضهم بعضا وله الحكم والحكمة والحجة على خلقه في جميع أفعاله وأقواله .\n                                    ",
        "qortoby": "وَلَمَّا بَرَزُواْ لِجَالُوتَ وَجُنُودِهِۦ قَالُواْ رَبَّنَآ أَفۡرِغۡ عَلَيۡنَا صَبۡرٗا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٠٥٢\n                                    \n                                    \n                                    قوله تعالى : ولما برزوا لجالوت وجنوده قالوا ربنا أفرغ علينا صبرا وثبت أقدامنا وانصرنا على القوم الكافرين\n\" برزوا \" صاروا في البراز وهو الأفيح من الأرض المتسع . وكان جالوت أمير العمالقة وملكهم ، ظله ميل . ويقال : إن البربر من نسله ، وكان فيما روي في ثلاثمائة ألف فارس . وقال عكرمة : في تسعين ألفا ، ولما رأى المؤمنون كثرة عدوهم تضرعوا إلى ربهم ، وهذا كقوله : وكأين من نبي قاتل معه ربيون كثير إلى قوله وما كان قولهم إلا أن قالوا ربنا اغفر لنا ذنوبنا الآية . وكان رسول الله صلى الله عليه وسلم إذا لقي العدو يقول في القتال : ( اللهم بك أصول وأجول ) وكان صلى الله عليه وسلم يقول إذا لقي العدو : اللهم إني أعوذ بك من شرورهم وأجعلك في نحورهم ودعا يوم بدر حتى سقط رداؤه عن منكبيه يستنجز الله وعده على ما يأتي بيانه في ( آل عمران ) إن شاء الله تعالى .\n                                    ",
        "saadi": "وَلَمَّا بَرَزُواْ لِجَالُوتَ وَجُنُودِهِۦ قَالُواْ رَبَّنَآ أَفۡرِغۡ عَلَيۡنَا صَبۡرٗا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٠٥٢\n                                        \n                                        \n                                        \n                                        ولهذا لما برزوا لجالوت وجنوده { قالوا } جميعهم { ربنا أفرغ علينا صبرا } أي: قو قلوبنا، وأوزعنا الصبر، وثبت أقدامنا عن التزلزل والفرار، وانصرنا على القوم الكافرين.\n                                    "
      },
      "originalText": "وَلَمَّا بَرَزُواْ لِجَالُوتَ وَجُنُودِهِۦ قَالُواْ رَبَّنَآ أَفۡرِغۡ عَلَيۡنَا صَبۡرٗا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٠٥٢"
    },
    {
      "number": 258,
      "text": "فَهَزَمُوهُمْ بِإِذْنِ اللَّهِ وَقَتَلَ دَاوُودُ جَالُوتَ وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهُ مِمَّا يَشَاءُ ۗ وَلَوْلَا دَفْعُ اللَّهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَفَسَدَتِ الْأَرْضُ وَلَٰكِنَّ اللَّهَ ذُو فَضْلٍ عَلَى الْعَالَمِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 251,
      "juz": 2,
      "manzil": 1,
      "page": 41,
      "ruku": 34,
      "hizbQuarter": 16,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَهَزَمُوهُم بِإِذۡنِ ٱللَّهِ وَقَتَلَ دَاوُۥدُ جَالُوتَ وَءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ وَٱلۡحِكۡمَةَ وَعَلَّمَهُۥ مِمَّا يَشَآءُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضٖ لَّفَسَدَتِ ٱلۡأَرۡضُ وَلَٰكِنَّ ٱللَّهَ ذُو فَضۡلٍ عَلَى ٱلۡعَٰلَمِينَ ١٥٢\n                                        \n                                        \n                                        قال الله تعالى : ( فهزموهم بإذن الله ) أي : غلبوهم وقهروهم بنصر الله لهم ( وقتل داود جالوت ) ذكروا في الإسرائيليات : أنه قتله بمقلاع كان في يده رماه به فأصابه فقتله ، وكان طالوت قد وعده إن قتل جالوت أن يزوجه ابنته ويشاطره نعمته ويشركه في أمره فوفى له ثم آل الملك إلى داود عليه السلام مع ما منحه الله به من النبوة العظيمة ; ولهذا قال تعالى : ( وآتاه الله الملك ) الذي كان بيد طالوت ( والحكمة ) أي : النبوة بعد شمويل ( وعلمه مما يشاء ) أي : مما يشاء الله من العلم الذي اختصه به صلى الله عليه وسلم ثم قال تعالى : ( ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض ) أي : لولاه يدفع عن قوم بآخرين ، كما دفع عن بني إسرائيل بمقاتلة طالوت وشجاعة داود لهلكوا كما قال : ( ولولا دفع الله الناس بعضهم ببعض لهدمت صوامع وبيع وصلوات ومساجد يذكر فيها اسم الله كثيرا ) الآية [ الحج : 40 ] .\nوقال ابن جرير ، رحمه الله : حدثني أبو حميد الحمصي أحمد بن المغيرة حدثنا يحيى بن سعيد حدثنا حفص بن سليمان عن محمد بن سوقة عن وبرة بن عبد الرحمن عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : \" إن الله ليدفع بالمسلم الصالح عن مائة أهل بيت من جيرانه البلاء \" . ثم قرأ ابن عمر : ( ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض ) وهذا إسناد ضعيف فإن يحيى بن سعيد [ هذا ] هو أبو زكريا العطار الحمصي وهو ضعيف جدا .\nثم قال ابن جرير : حدثنا أبو حميد الحمصي حدثنا يحيى بن سعيد حدثنا عثمان بن عبد الرحمن عن محمد بن المنكدر عن جابر بن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" إن الله ليصلح بصلاح الرجل المسلم ولده وولد ولده وأهل دويرته ودويرات حوله ، ولا يزالون في حفظ الله عز وجل ما دام فيهم \" .\nوهذا أيضا غريب ضعيف لما تقدم أيضا . وقال أبو بكر بن مردويه : حدثنا محمد بن أحمد بن إبراهيم أخبرنا علي بن إسماعيل بن حماد أخبرنا أحمد بن محمد بن يحيى بن سعيد أخبرنا زيد بن الحباب ، حدثني حماد بن زيد عن أيوب عن أبي قلابة عن أبي أسماء عن ثوبان رفع الحديث قال : \" لا يزال فيكم سبعة بهم تنصرون وبهم تمطرون وبهم ترزقون حتى يأتي أمر الله \" .\nوقال ابن مردويه أيضا : وحدثنا محمد بن أحمد حدثنا محمد بن جرير بن يزيد ، حدثنا أبو معاذ نهار بن عثمان الليثي أخبرنا زيد بن الحباب أخبرني عمر البزار ، عن عنبسة الخواص ، عن قتادة عن أبي قلابة عن أبي الأشعث الصنعاني عن عبادة بن الصامت قال : قال رسول الله صلى الله عليه وسلم : \" الأبدال في أمتي ثلاثون بهم تقوم الأرض ، وبهم تمطرون وبهم تنصرون \" قال قتادة : إني لأرجو أن يكون الحسن منهم .\nوقوله : ( ولكن الله ذو فضل على العالمين ) أي : من عليهم ورحمة بهم ، يدفع عنهم ببعضهم بعضا وله الحكم والحكمة والحجة على خلقه في جميع أفعاله وأقواله .\n                                    ",
        "qortoby": "فَهَزَمُوهُم بِإِذۡنِ ٱللَّهِ وَقَتَلَ دَاوُۥدُ جَالُوتَ وَءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ وَٱلۡحِكۡمَةَ وَعَلَّمَهُۥ مِمَّا يَشَآءُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضٖ لَّفَسَدَتِ ٱلۡأَرۡضُ وَلَٰكِنَّ ٱللَّهَ ذُو فَضۡلٍ عَلَى ٱلۡعَٰلَمِينَ ١٥٢\n                                        \n                                        \n                                        قوله تعالى : فهزموهم بإذن الله وقتل داود جالوت وآتاه الله الملك والحكمة وعلمه مما يشاء ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض ولكن الله ذو فضل على العالمين\nقوله تعالى : فهزموهم بإذن الله أي فأنزل الله عليهم النصر فهزموهم : فكسروهم . والهزم : الكسر ومنه سقاء متهزم ، أي انثنى بعضه على بعض مع الجفاف ، ومنه ما قيل في زمزم : إنها هزمة جبريل أي هزمها جبريل برجله فخرج الماء . والهزم : ما تكسر من يابس الحطب .\nقوله تعالى : وقتل داود جالوت وذلك أن طالوت الملك اختاره من بين قومه لقتال جالوت ، وكان رجلا قصيرا مسقاما مصفارا أصغر أزرق ، وكان جالوت من أشد الناس وأقواهم وكان يهزم الجيوش وحده ، وكان قتل جالوت وهو رأس العمالقة على يده . وهو داود بن إيشى - بكسر الهمزة ، ويقال : داود بن زكريا بن رشوى ، وكان من سبط يهوذا بن يعقوب بن إسحاق بن إبراهيم عليهم السلام ، وكان من أهل بيت المقدس جمع له بين النبوة والملك بعد أن كان راعيا وكان أصغر إخوته وكان يرعى غنما ، وكان له سبعة إخوة في أصحاب طالوت ، فلما حضرت الحرب قال في نفسه : لأذهبن إلى رؤية هذه الحرب ، فلما نهض في طريقه مر بحجر فناداه : يا داود خذني فبي تقتل جالوت ، ثم ناداه حجر آخر ثم آخر فأخذها وجعلها في مخلاته وسار ، فخرج جالوت يطلب مبارزا فكع الناس عنه حتى قال طالوت : من يبرز إليه ويقتله فأنا أزوجه ابنتي وأحكمه في مالي ، فجاء داود عليه السلام فقال : أنا أبرز إليه وأقتله ، فازدراه طالوت حين رآه لصغر سنه وقصره فرده ، وكان داود أزرق قصيرا ، ثم نادى ثانية وثالثة فخرج داود ، فقال طالوت له : هل جربت نفسك بشيء ؟ قال نعم ، قال بماذا ؟ قال : وقع ذئب في غنمي فضربته ثم أخذت رأسه فقطعته من جسده . قال طالوت : الذئب ضعيف ، هل جربت نفسك في غيره ؟ قال : نعم ، دخل الأسد في غنمي فضربته ثم أخذت بلحييه فشققتهما ، أفترى هذا أشد من الأسد ؟ قال لا ، وكان عند طالوت درع لا تستوي إلا على من يقتل جالوت ، فأخبره بها وألقاها عليه فاستوت ، فقال طالوت : فاركب فرسي وخذ سلاحي ففعل ، فلما مشى قليلا رجع فقال الناس : جبن الفتى فقال داود : إن الله إن لم يقتله لي ويعني عليه لم ينفعني هذا الفرس ولا هذا السلاح ، ولكني أحب أن أقاتله على عادتي . قال : وكان داود من أرمى الناس بالمقلاع ، فنزل وأخذ مخلاته فتقلدها وأخذ مقلاعه وخرج إلى جالوت ، وهو شاك في سلاحه على رأسه بيضة فيها ثلاثمائة رطل ، فيما ذكر الماوردي وغيره ، فقال له جالوت : أنت يا فتى تخرج إلي! قال نعم ، قال : هكذا كما تخرج إلى الكلب! قال نعم ، وأنت أهون . قال : لأطعمن لحمك اليوم للطير والسباع ، ثم تدانيا وقصد جالوت أن يأخذ داود بيده استخفافا به ، فأدخل داود يده إلى الحجارة ، فروي أنها التأمت فصارت حجرا واحدا ، فأخذه فوضعه في المقلاع وسمى الله وأداره ورماه فأصاب به رأس جالوت فقتله ، وحز رأسه وجعله في مخلاته ، واختلط الناس وحمل أصحاب طالوت فكانت الهزيمة . وقد قيل : إنما أصاب بالحجر من البيضة موضع أنفه ، وقيل : عينه وخرج من قفاه ، وأصاب جماعة من عسكره فقتلهم . وقيل : إن الحجر تفتت حتى أصاب كل من في العسكر شيء منه ، وكان كالقبضة التي رمى بها النبي صلى الله عليه وسلم هوازن يوم حنين ، والله أعلم . وقد أكثر الناس في قصص هذه الآي ، وقد ذكرت لك منها المقصود والله المحمود .\nقلت : وفي قول طالوت : ( من يبرز له ويقتله فإني أزوجه ابنتي وأحكمه في مالي ) معناه ثابت في شرعنا ، وهو أن يقول الإمام : من جاء برأس فله كذا ، أو أسير فله كذا على ما يأتي بيانه في ( الأنفال ) إن شاء الله تعالى . وفيه دليل على أن المبارزة لا تكون إلا بإذن الإمام ، كما يقوله أحمد وإسحاق وغيرهما . واختلف فيه عن الأوزاعي فحكي عنه أنه قال : لا يحمل أحد إلا بإذن إمامه . وحكي عنه أنه قال : لا بأس به ، فإن نهى الإمام عن البراز فلا يبارز أحد إلا بإذنه . وأباحت طائفة البراز ولم تذكر بإذن الإمام ولا بغير إذنه ، هذا قول مالك . سئل مالك عن الرجل يقول بين الصفين : من يبارز ؟ فقال : ذلك إلى نيته إن كان يريد بذلك الله فأرجو ألا يكون به بأس ، قد كان يفعل ذلك فيما مضى . وقال الشافعي : لا بأس بالمبارزة . قال ابن المنذر : المبارزة بإذن الإمام حسن ، وليس على من بارز بغير إذن الإمام حرج ، وليس ذلك بمكروه لأني لا أعلم خبرا يمنع منه .\nوآتاه الله الملك والحكمة قال السدي : أتاه الله ملك طالوت ونبوة شمعون . والذي علمه ، هو صنعة الدروع ومنطق الطير وغير ذلك من أنواع ما علمه صلى الله عليه وسلم . وقال ابن عباس : هو أن الله أعطاه سلسلة موصولة بالمجرة والفلك ورأسها عند صومعة داود ، فكان لا يحدث في الهواء حدث إلا صلصلت السلسلة فيعلم داود ما حدث ، ولا يمسها ذو عاهة إلا برئ ، وكانت علامة دخول قومه في الدين أن يمسوها بأيديهم ثم يمسحون أكفهم على صدورهم ، وكانوا يتحاكمون إليها بعد داود عليه السلام إلى أن رفعت .\nقوله تعالى : ( مما يشاء ) أي مما شاء ، وقد يوضع المستقبل موضع الماضي ، وقد تقدم .\nقوله تعالى : ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض ولكن الله ذو فضل على العالمين فيه مسألتان : الأولى : قوله تعالى : ولولا دفع الله الناس بعضهم ببعض كذا قراءة الجماعة ، إلا نافعا فإنه قرأ \" دفاع \" ويجوز أن يكون مصدرا لفعل كما يقال : حسبت الشيء حسابا ، وآب إيابا ، ولقيته لقاء ، ومثله كتبه كتابا ، ومنه \" كتاب الله عليكم \" . النحاس : وهذا حسن ، فيكون دفاع ودفع مصدرين لدفع وهو مذهب سيبويه . وقال أبو حاتم : دافع ودفع بمعنى واحد ، مثل طرقت النعل وطارقت ، أي خصفت إحداهما فوق الأخرى ، والخصف : الخرز . واختار أبو عبيدة قراءة الجمهور ولولا دفع الله . وأنكر أن يقرأ \" دفاع \" وقال : لأن الله عز وجل لا يغالبه أحد . قال مكي : هذا وهم توهم فيه باب المفاعلة وليس به ، واسم الله في موضع رفع بالفعل ، أي لولا أن يدفع الله . و \" دفاع \" مرفوع بالابتداء عند سيبويه . \" الناس \" مفعول ، \" بعضهم \" بدل من الناس ، \" ببعض \" في موضع المفعول الثاني عند سيبويه ، وهو عنده مثل قولك : ذهبت بزيد ، فزيد في موضع مفعول فاعلمه .\nالثانية : واختلف العلماء في الناس المدفوع بهم الفساد من هم ؟ فقيل : هم الأبدال وهم أربعون رجلا كلما مات واحد بدل الله آخر ، فإذا كان عند القيامة ماتوا كلهم ، اثنان وعشرون منهم بالشام وثمانية عشر بالعراق . وروي عن علي رضي الله عنه قال : سمعت رسول الله صلى الله عليه وسلم يقول : ( إن الأبدال يكونون بالشام وهم أربعون رجلا كلما مات منهم رجل أبدل الله مكانه رجلا ، يسقى بهم الغيث وينصر بهم على الأعداء ويصرف بهم عن أهل الأرض البلاء ) ذكره الترمذي الحكيم في \" نوادر الأصول \" . وخرج أيضا عن أبي الدرداء قال : إن الأنبياء كانوا أوتاد الأرض ، فلما انقطعت النبوة أبدل الله مكانهم قوما من أمة محمد صلى الله عليه وسلم يقال لهم الأبدال ، لم يفضلوا الناس بكثرة صوم ولا صلاة ولكن بحسن الخلق وصدق الورع وحسن النية وسلامة القلوب لجميع المسلمين والنصيحة لهم ابتغاء مرضاة الله بصبر وحلم ولب وتواضع في غير مذلة ، فهم خلفاء الأنبياء ، قوم اصطفاهم الله لنفسه واستخلصهم بعلمه لنفسه ، وهم أربعون صديقا منهم ثلاثون رجلا على مثل يقين إبراهيم خليل الرحمن ، يدفع الله بهم المكاره عن أهل الأرض والبلايا عن الناس ، وبهم يمطرون ويرزقون ، لا يموت الرجل منهم حتى يكون الله قد أنشأ من يخلفه . وقال ابن عباس : ولولا دفع الله العدو بجنود المسلمين لغلب المشركون فقتلوا المؤمنين وخربوا البلاد والمساجد . وقال سفيان الثوري : هم الشهود الذين تستخرج بهم الحقوق . وحكى مكي أن أكثر المفسرين على أن المعنى : لولا أن الله يدفع بمن يصلي عمن لا يصلي وبمن يتقي عمن لا يتقي لأهلك الناس بذنوبهم ، وكذا ذكر النحاس والثعلبي أيضا . قال الثعلبي وقال سائر المفسرين : ولولا دفاع الله المؤمنين الأبرار عن الفجار والكفار لفسدت الأرض ، أي هلكت وذكر حديثا أن النبي صلى الله عليه وسلم قال : إن الله يدفع العذاب بمن يصلي من أمتي عمن لا يصلي وبمن يزكي عمن لا يزكي وبمن يصوم عمن لا يصوم وبمن يحج عمن لا يحج وبمن يجاهد عمن لا يجاهد ، ولو اجتمعوا على ترك هذه الأشياء ما أنظرهم الله طرفة عين - ثم تلا رسول الله صلى الله عليه وسلم - ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض . وعن النبي صلى الله عليه وسلم قال : إن لله ملائكة تنادي كل يوم لولا عباد ركع وأطفال رضع وبهائم رتع لصب عليكم العذاب صبا خرجه أبو بكر الخطيب بمعناه من حديث الفضيل بن عياض . حدثنا منصور عن إبراهيم عن علقمة عن عبد الله قال : قال رسول الله صلى الله عليه وسلم : لولا فيكم رجال خشع وبهائم رتع وصبيان رضع لصب العذاب على المؤمنين صبا . أخذ بعضهم هذا المعنى فقال :\nلولا عباد للإله ركع وصبية من اليتامى رضع ومهملات في الفلاة رتع\nصب عليكم العذاب الأوجع\nوروى جابر أن رسول الله صلى الله عليه وسلم قال : إن الله ليصلح بصلاح الرجل ولده وولد ولده وأهل دويرته ودويرات حوله ولا يزالون في حفظ الله ما دام فيهم . وقال قتادة : يبتلي الله المؤمن بالكافر ويعافي الكافر بالمؤمن . وقال ابن عمر قال النبي صلى الله عليه وسلم : إن الله ليدفع بالمؤمن الصالح عن مائة من أهل بيته وجيرانه البلاء . ثم قرأ ابن عمر ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض . وقيل : هذا الدفع بما شرع على ألسنة الرسل من الشرائع ، ولولا ذلك لتسالب الناس وتناهبوا وهلكوا ، وهذا قول حسن فإنه عموم في الكف والدفع وغير ذلك فتأمله . ولكن الله ذو فضل على العالمين . بين سبحانه أن دفعه بالمؤمنين شر الكافرين فضل منه ونعمة .\n                                    ",
        "saadi": "فَهَزَمُوهُم بِإِذۡنِ ٱللَّهِ وَقَتَلَ دَاوُۥدُ جَالُوتَ وَءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ وَٱلۡحِكۡمَةَ وَعَلَّمَهُۥ مِمَّا يَشَآءُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضٖ لَّفَسَدَتِ ٱلۡأَرۡضُ وَلَٰكِنَّ ٱللَّهَ ذُو فَضۡلٍ عَلَى ٱلۡعَٰلَمِينَ ١٥٢\n                                        \n                                        \n                                        \n                                        من هاهنا نعلم أن جالوت وجنوده كانوا كفارا، فاستجاب الله لهم ذلك الدعاء لإتيانهم بالأسباب الموجبة لذلك، ونصرهم عليهم { فهزموهم بإذن الله وقتل داود } عليه السلام، وكان مع جنود طالوت، { جالوت } أي: باشر قتل ملك الكفار بيده لشجاعته وقوته وصبره { وآتاه الله } أي: آتى الله داود { الملك والحكمة } أي: منَّ عليه بتملكه على بني إسرائيل مع الحكمة، وهي النبوة المشتملة على الشرع العظيم والصراط المستقيم، ولهذا قال { وعلمه مما يشاء } من العلوم الشرعية والعلوم السياسية، فجمع الله له الملك والنبوة، وقد كان من قبله من الأنبياء يكون الملك لغيرهم، فلما نصرهم الله تعالى اطمأنوا في ديارهم وعبدوا الله آمنين مطمئنين لخذلان أعدائهم وتمكينهم من الأرض، وهذا كله من آثار الجهاد في سبيله، فلو لم يكن لم يحصل ذلك فلهذا قال تعالى: { ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض } أي: لولا أنه يدفع بمن يقاتل في سبيله كيد الفجار وتكالب الكفار لفسدت الأرض باستيلاء الكفار عليها وإقامتهم شعائر الكفر ومنعهم من عبادة الله تعالى، وإظهار دينه { ولكن الله ذو فضل على العالمين } حيث شرع لهم الجهاد الذي فيه سعادتهم والمدافعة عنهم ومكنهم من الأرض بأسباب يعلمونها، وأسباب لا يعلمونها.\n                                    "
      },
      "originalText": "فَهَزَمُوهُم بِإِذۡنِ ٱللَّهِ وَقَتَلَ دَاوُۥدُ جَالُوتَ وَءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ وَٱلۡحِكۡمَةَ وَعَلَّمَهُۥ مِمَّا يَشَآءُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضٖ لَّفَسَدَتِ ٱلۡأَرۡضُ وَلَٰكِنَّ ٱللَّهَ ذُو فَضۡلٍ عَلَى ٱلۡعَٰلَمِينَ ١٥٢"
    },
    {
      "number": 259,
      "text": "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۚ وَإِنَّكَ لَمِنَ الْمُرْسَلِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 252,
      "juz": 2,
      "manzil": 1,
      "page": 41,
      "ruku": 34,
      "hizbQuarter": 16,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۚ وَإِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ ٢٥٢\n                                        \n                                        \n                                        ثم قال تعالى : ( تلك آيات الله نتلوها عليك بالحق وإنك لمن المرسلين ) أي : هذه آيات الله التي قصصناها عليك من أمر الذين ذكرناهم بالحق أي : بالواقع الذي كان عليه الأمر ، المطابق لما بأيدي أهل الكتاب من الحق الذي يعلمه علماء بني إسرائيل ( وإنك ) يا محمد ( لمن المرسلين ) وهذا توكيد وتوطئة للقسم .\n                                    ",
        "qortoby": "تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۚ وَإِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ ٢٥٢\n                                        \n                                        \n                                        قوله تعالى : تلك آيات الله نتلوها عليك بالحق وإنك لمن المرسلين ( تلك ) ابتداء ( آيات الله ) خبره ، وإن شئت كان بدلا والخبر نتلوها عليك بالحق . وإنك لمن المرسلين خبر إن ؛ أي وإنك لمرسل . نبه الله تعالى نبيه صلى الله عليه وسلم أن هذه الآيات التي تقدم ذكرها لا يعلمها إلا نبي مرسل .\n\n                                    ",
        "saadi": "تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۚ وَإِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ ٢٥٢\n                                        \n                                        \n                                        \n                                        ثم قال تعالى: { تلك آيات الله نتلوها عليك بالحق } أي: بالصدق الذي لا ريب فيها المتضمن للاعتبار والاستبصار وبيان حقائق الأمور { وإنك لمن المرسلين } فهذه شهادة من الله لرسوله برسالته التي من جملة أدلتها ما قصه الله عليه من أخبار الأمم السالفين والأنبياء وأتباعهم وأعدائهم التي لولا خبر الله إياه لما كان عنده بذلك علم بل لم يكن في قومه من عنده شيء من هذه الأمور، فدل أنه رسول الله حقا ونبيه صدقا الذي بعثه بالحق ودين الحق ليظهره على الدين كله ولو كره المشركون. وفي هذه القصة من الآيات والعبر ما يتذكر به أولو الألباب، فمنها: أن اجتماع أهل الكلمة والحل والعقد وبحثهم في الطريق الذي تستقيم به أمورهم وفهمه، ثم العمل به، أكبر سبب لارتقائهم وحصول مقصودهم، كما وقع لهؤلاء الملأ حين راجعوا نبيهم في تعيين ملك تجتمع به كلمتهم ويلم متفرقهم، وتحصل له الطاعة منهم، ومنها: أن الحق كلما عورض وأوردت عليه الشبه ازداد وضوحا وتميز وحصل به اليقين التام كما جرى لهؤلاء، لما اعترضوا على استحقاق طالوت للملك أجيبوا بأجوبة حصل بها الإقناع وزوال الشبه والريب. ومنها: أن العلم والرأي: مع القوة المنفذة بهما كمال الولايات، وبفقدهما أو فقد أحدهما نقصانها وضررها. ومنها: أن الاتكال على النفس سبب الفشل والخذلان، والاستعانة بالله والصبر والالتجاء إليه سبب النصر، فالأول كما في قولهم لنبيهم { وما لنا ألا نقاتل في سبيل الله وقد أخرجنا من ديارنا وأبنائنا } فكأنه نتيجة ذلك أنه لما كتب عليهم القتال تولوا، والثاني في قوله: { ولما برزوا لجالوت وجنوده قالوا ربنا أفرغ علينا صبرا وثبت أقدامنا وانصرنا على القوم الكافرين فهزموهم بإذن الله } ومنها: أن من حكمة الله تعالى تمييز الخبيث من الطيب، والصادق من الكاذب، والصابر من الجبان، وأنه لم يكن ليذر العباد على ما هم عليه من الاختلاط وعدم التمييز. ومنها: أن من رحمته وسننه الجارية أن يدفع ضرر الكفار والمنافقين بالمؤمنين المقاتلين، وأنه لولا ذلك لفسدت الأرض باستيلاء الكفر وشعائره عليها\n                                    "
      },
      "originalText": "تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۚ وَإِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ ٢٥٢"
    }
  ]
}