{
  "number": 411,
  "ayahsNumber": 11,
  "ayahs": [
    {
      "number": 3470,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الم",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 1,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "الٓمٓ ١\n                                    \n                                    \n                                    سورة لقمان وهي مكية\nقد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه.\nوحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لا يـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وإن شرا ف ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شيء حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حم عسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\n                                    ",
        "qortoby": "الٓمٓ ١\n                                    \n                                    \n                                    وهي مكية , غير آيتين قال قتادة : أولهما \" ولو أن ما في الأرض من شجرة أقلام \" [ لقمان : 27 ] إلى آخر الآيتين .\nوقال ابن عباس : ثلاث آيات , أولهن \" ولو أن ما في الأرض \" [ لقمان : 27 ] .\nوهي أربع وثلاثون آية .\nاختلف أهل التأويل في الحروف التي في أوائل السورة ; فقال عامر الشعبي وسفيان الثوري وجماعة من المحدثين : هي سر الله في القرآن , ولله في كل كتاب من كتبه سر .\nفهي من المتشابه الذي انفرد الله تعالى بعلمه , ولا يجب أن يتكلم فيها , ولكن نؤمن بها ونقرؤها كما جاءت .\nوروي هذا القول عن أبي بكر الصديق وعن علي بن أبي طالب رضي الله عنهما .\nوذكر أبو الليث السمرقندي عن عمر وعثمان وابن مسعود أنهم قالوا : الحروف المقطعة من المكتوم الذي لا يفسر .\nوقال أبو حاتم : لم نجد الحروف المقطعة في القرآن إلا في أوائل السور , ولا ندري ما أراد الله جل وعز بها .\nقلت : ومن هذا المعنى ما ذكره أبو بكر الأنباري : حدثنا الحسن بن الحباب حدثنا أبو بكر بن أبي طالب حدثنا أبو المنذر الواسطي عن مالك بن مغول عن سعيد بن مسروق عن الربيع بن خثيم قال : إن الله تعالى أنزل هذا القران فاستأثر منه بعلم ما شاء , وأطلعكم على ما شاء , فأما ما استأثر به لنفسه فلستم بنائليه فلا تسألوا عنه , وأما الذي أطلعكم عليه فهو الذي تسألون عنه وتخبرون به , وما بكل القرآن تعلمون , ولا بكل ما تعلمون تعملون .\nقال أبو بكر : فهذا يوضح أن حروفا من القرآن سترت معانيها عن جميع العالم , اختبارا من الله عز وجل وامتحانا ; فمن آمن بها أثيب وسعد , ومن كفر وشك أثم وبعد .\nحدثنا أبو يوسف بن يعقوب القاضي حدثنا محمد بن أبي بكر حدثنا عبد الرحمن بن مهدي عن سفيان عن الأعمش عن عمارة عن حريث بن ظهير عن عبد الله قال : ما آمن مؤمن أفضل من إيمان بغيب , ثم قرأ : \" الذين يؤمنون بالغيب \" [ البقرة : 3 ] .\nقلت : هذا القول في المتشابه وحكمه , وهو الصحيح على ما يأتي بيانه في ( آل عمران ) إن شاء الله تعالى .\nوقال جمع من العلماء كبير : بل يجب أن نتكلم فيها , ونلتمس الفوائد التي تحتها , والمعاني التي تتخرج عليها ; واختلفوا في ذلك على أقوال عديدة ; فروي عن ابن عباس وعلي أيضا : أن الحروف المقطعة في القرآن اسم الله الأعظم , إلا أنا لا نعرف تأليفه منها .\nوقال قطرب والفراء وغيرهما : هي إشارة إلى حروف الهجاء أعلم الله بها العرب حين تحداهم بالقرآن أنه مؤتلف من حروف هي التي منها بناء كلامهم ; ليكون عجزهم عنه أبلغ في الحجة عليهم إذ لم يخرج عن كلامهم .\nقال قطرب : كانوا ينفرون عند استماع القرآن , فلما سمعوا : \" الم \" و \" المص \" استنكروا هذا اللفظ , فلما أنصتوا له صلى الله عليه وسلم أقبل عليهم بالقرآن المؤتلف ليثبته في أسماعهم وآذانهم ويقيم الحجة عليهم .\nوقال قوم : روي أن المشركين لما أعرضوا عن سماع القرآن بمكة وقالوا : \" لا تسمعوا لهذا القرآن والغوا فيه \" [ فصلت : 26 ] نزلت ليستغربوها فيفتحون لها أسماعهم فيسمعون القرآن بعدها فتجب عليهم الحجة .\nوقال جماعة : هي حروف دالة على أسماء أخذت منها وحذفت بقيتها ; كقول ابن عباس وغيره : الألف من الله , واللام من جبريل , والميم من محمد صلى الله عليه وسلم .\nوقيل : الألف مفتاح اسمه الله , واللام مفتاح اسمه لطيف , والميم مفتاح اسمه مجيد .\nوروى أبو الضحى عن ابن عباس في قوله : \" الم \" قال : أنا الله أعلم , \" الر \" أنا الله أرى , \" المص \" أنا الله أفضل .\nفالألف تؤدي عن معنى أنا , واللام تؤدي عن اسم الله , والميم تؤدي عن معنى أعلم .\nواختار هذا القول الزجاج وقال : أذهب إلى أن كل حرف منها يؤدي عن معنى ; وقد تكلمت العرب بالحروف المقطعة نظما لها ووضعا بدل الكلمات التي الحروف منها , كقوله : فقلت لها قفي فقالت قاف أراد : قالت وقفت .\nوقال زهير : بالخير خيرات وإن شرا فا ولا أريد الشر إلا أن تا أراد : وإن شرا فشر .\nوأراد : إلا أن تشاء .\nوقال آخر : نادوهم ألا الجموا ألا تا قالوا جميعا كلهم ألا فا أراد : ألا تركبون , قالوا : ألا فاركبوا .\nوفي الحديث : ( من أعان على قتل مسلم بشطر كلمة ) قال شقيق : هو أن يقول في اقتل : اق ; كما قال عليه السلام ( كفى بالسيف شا ) معناه : شافيا .\nوقال زيد بن أسلم : هي أسماء للسور .\nوقال الكلبي : هي أقسام أقسم الله تعالى بها لشرفها وفضلها , وهي من أسمائه ; عن ابن عباس أيضا ورد بعض العلماء هذا القول فقال : لا يصح أن يكون قسما لأن القسم معقود على حروف مثل : إن وقد ولقد وما ; ولم يوجد ها هنا حرف من هذه الحروف , فلا يجوز أن يكون يمينا .\nوالجواب أن يقال : موضع القسم قوله تعالى : \" لا ريب فيه \" فلو أن إنسانا حلف فقال : والله هذا الكتاب لا ريب فيه ; لكان الكلام سديدا , وتكون \" لا \" جواب القسم .\nفثبت أن قول الكلبي وما روي عن ابن عباس سديد صحيح .\nفإن قيل : ما الحكمة في القسم من الله تعالى , وكان القوم في ذلك الزمان على صنفين : مصدق , ومكذب ; فالمصدق يصدق بغير قسم , والمكذب لا يصدق مع القسم ؟ .\nقيل له : القرآن نزل بلغة العرب ; والعرب إذا أراد بعضهم أن يؤكد كلامه أقسم على كلامه ; والله تعالى أراد أن يؤكد عليهم الحجة فأقسم أن القرآن من عنده .\nوقال بعضهم : \" الم \" أي أنزلت عليك هذا الكتاب من اللوح المحفوظ .\nوقال قتادة في قوله : \" الم \" قال اسم من أسماء القرآن .\nوروي عن محمد بن علي الترمذي أنه قال : إن الله تعالى أودع جميع ما في تلك السورة من الأحكام والقصص في الحروف التي ذكرها في أول السورة , ولا يعرف ذلك إلا نبي أو ولي , ثم بين ذلك في جميع السورة ليفقه الناس .\nوقيل غير هذا من الأقوال ; فالله أعلم .\nوالوقف على هذه الحروف على السكون لنقصانها إلا إذا أخبرت عنها أو عطفتها فإنك تعربها .\nواختلف : هل لها محل من الإعراب ؟ فقيل : لا ; لأنها ليست أسماء متمكنة , ولا أفعالا مضارعة ; وإنما هي بمنزلة حروف التهجي فهي محكية .\nهذا مذهب الخليل وسيبويه .\nومن قال : إنها أسماء السور فموضعها عنده الرفع على أنها عنده خبر ابتداء مضمر ; أي هذه \" الم \" ; كما تقول : هذه سورة البقرة .\nأو تكون رفعا على الابتداء والخبر ذلك ; كما تقول : زيد ذلك الرجل .\nوقال ابن كيسان النحوي : \" الم \" في موضع نصب ; كما تقول : اقرأ \" الم \" أو عليك \" الم \" .\nوقيل : في موضع خفض بالقسم ; لقول ابن عباس : إنها أقسام أقسم الله بها .\n                                    ",
        "saadi": "الٓمٓ ١\n                                        \n                                        \n                                        \n                                        تقدم الكلام عن الحروف المقطعة\n                                    "
      },
      "originalText": "الٓمٓ ١"
    },
    {
      "number": 3471,
      "text": "تِلْكَ آيَاتُ الْكِتَابِ الْحَكِيمِ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 2,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ ٢\n                                    \n                                    \n                                    \"تلك آيات الكتاب الحكيم\" أي هذه آيات القرآن المحكم المبين وقال مجاهد \"الر تلك آيات الكتاب الحكيم\" وقال الحسن التوراة والزبور وقال قتادة \"تلك آيات الكتاب\" قال الكتب التي كانت قبل القرآن.\nوهذا القول لا أعرف وجهه ولا معناه.\n                                    ",
        "qortoby": "تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ ٢\n                                    \n                                    \n                                    و ( تلك ) في موضع رفع على إضمار مبتدأ ، أي هذه تلك . ويقال : ( تيك آيات الكتاب الحكيم ) بدلا من تلك . والكتاب : القرآن . والحكيم : المحكم ; أي لا خلل فيه ولا تناقض . وقيل ذو الحكمة . وقيل الحاكم\n                                    ",
        "saadi": "تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ ٢\n                                        \n                                        \n                                        \n                                        يشير تعالى إشارة دالة على التعظيم إلى { آيَاتُ الْكِتَابِ الْحَكِيمِ } أي: آياته محكمة، صدرت من حكيم خبير.\nمن إحكامها، أنها جاءت بأجل الألفاظ وأفصحها، وأبينها، الدالة على أجل المعاني وأحسنها.\nومن إحكامها، أنها محفوظة من التغيير والتبديل، والزيادة والنقص، والتحريف.\nومن إحكامها: أن جميع ما فيها من الأخبار السابقة واللاحقة، والأمور الغيبية كلها، مطابقة للواقع، مطابق لها الواقع، لم يخالفها كتاب من الكتب الإلهية، ولم يخبر بخلافها، نبي من الأنبياء، [ولم يأت ولن يأتي علم محسوس ولا معقول صحيح، يناقض ما دلت عليه]\nومن إحكامها: أنها ما أمرت بشيء، إلا وهو خالص المصلحة، أو راجحها، ولا نهت عن شيء، إلا وهو خالص المفسدة أو راجحها، وكثيرا ما يجمع بين الأمر بالشيء، مع ذكر [حكمته] فائدته، والنهي عن الشيء، مع ذكر مضرته.\nومن إحكامها: أنها جمعت بين الترغيب والترهيب، والوعظ البليغ، الذي تعتدل به النفوس الخيرة، وتحتكم، فتعمل بالحزم.\nومن إحكامها: أنك تجد آياته المتكررة، كالقصص، والأحكام ونحوها، قد اتفقت كلها وتواطأت، فليس فيها تناقض، ولا اختلاف. فكلما ازداد بها البصير تدبرا، وأعمل فيها العقل تفكرا، انبهر عقله، وذهل لبه من التوافق والتواطؤ، وجزم جزما لا يمترى فيه، أنه تنزيل من حكيم حميد.\nولكن - مع أنه حكيم - يدعو إلى كل خلق كريم، وينهى عن كل خلق لئيم، أكثر الناس محرومون الاهتداء به، معرضون عن الإيمان والعمل به، إلا من وفقه اللّه تعالى وعصمه، وهم المحسنون في عبادة ربهم والمحسنون إلى الخلق.\n                                    "
      },
      "originalText": "تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ ٢"
    },
    {
      "number": 3472,
      "text": "هُدًى وَرَحْمَةً لِلْمُحْسِنِينَ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 3,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُدٗى وَرَحۡمَةٗ لِّلۡمُحۡسِنِينَ ٣\n                                    \n                                    \n                                    تقدم في أول سورة البقرة عامة الكلام على ما يتعلق بصدر هذه السورة وهو أنه سبحانه وتعالى جعل هذا القرآن هدى وشفاء ورحمة للمحسنين.\n                                    ",
        "qortoby": "هُدٗى وَرَحۡمَةٗ لِّلۡمُحۡسِنِينَ ٣\n                                    \n                                    \n                                    وقيل الحاكم هدى ورحمة للمحسنين بالنصب على الحال ; مثل : هذه ناقة الله لكم آية وهذه قراءة المدنيين وأبي عمرو وعاصم والكسائي . وقرأ حمزة : ( هدى ورحمة ) بالرفع ، وهو من وجهين : أحدهما : على إضمار مبتدأ ; لأنه أول آية . والآخر : أن يكون خبر ( تلك ) . والمحسن : الذي يعبد الله كأنه يراه ، فإن لم يكن يراه فإنه يراه . وقيل : هم المحسنون في الدين وهو الإسلام ; قال الله تعالى : ومن أحسن دينا ممن أسلم وجهه لله الآية .\n                                    ",
        "saadi": "هُدٗى وَرَحۡمَةٗ لِّلۡمُحۡسِنِينَ ٣\n                                        \n                                        \n                                        \n                                        فإنه { هُدًى } لهم، يهديهم إلى الصراط المستقيم، ويحذرهم من طرق الجحيم، { وَرَحْمَة } لهم، تحصل لهم به السعادة في الدنيا والآخرة، والخير الكثير، والثواب الجزيل، والفرح والسرور، ويندفع عنهم الضلال والشقاء.\n                                    "
      },
      "originalText": "هُدٗى وَرَحۡمَةٗ لِّلۡمُحۡسِنِينَ ٣"
    },
    {
      "number": 3473,
      "text": "الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ يُوقِنُونَ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 4,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ ٤\n                                    \n                                    \n                                    وهم الذين أحسنوا العمل في اتباع الشريعة ، فأقاموا الصلاة المفروضة بحدودها وأوقاتها ، وما يتبعها من نوافل راتبة وغير راتبة ، وآتوا الزكاة المفروضة عليهم إلى مستحقيها ، ووصلوا قراباتهم وأرحامهم ، وأيقنوا بالجزاء في الدار الآخرة ، فرغبوا إلى الله في ثواب ذلك ، لم يراءوا به ، ولا أرادوا جزاء من الناس ولا شكورا ، فمن فعل ذلك كذلك فهو من الذين قال الله تعالى :\n                                    ",
        "qortoby": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ ٤\n                                    \n                                    \n                                    الذين يقيمون الصلاة في موضع الصفة ، ويجوز الرفع على القطع بمعنى : هم الذين ، والنصب بإضمار أعني . وقد مضى الكلام في هذه الآية والتي بعدها في ( البقرة ) وغيرها .\n\n                                    ",
        "saadi": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ ٤\n                                        \n                                        \n                                        \n                                        ثم وصف المحسنين بالعلم التام، وهو اليقين الموجب للعمل والخوف من عقاب اللّه، فيتركون معاصيه، ووصفهم بالعمل، وخص من العمل، عملين فاضلين: الصلاة المشتملة على الإخلاص، ومناجاة اللّه تعالى، والتعبد العام للقلب واللسان، والجوارح المعينة، على سائر الأعمال، والزكاة التي تزكي صاحبها من الصفات الرذيلة، وتنفع أخاه المسلم، وتسد حاجته، ويبين بها أن العبد يؤثر محبة اللّه على محبته للمال، فيخرجه محبوبه من المال، لما هو أحب إليه، وهو طلب مرضاة اللّه.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ ٤"
    },
    {
      "number": 3474,
      "text": "أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 5,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ ٥\n                                    \n                                    \n                                    ( أولئك على هدى من ربهم ) أي : على بصيرة وبينة ومنهج واضح وجلي ، ( وأولئك هم المفلحون ) أي : في الدنيا والآخرة .\n                                    ",
        "qortoby": "أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ ٥\n                                    \n                                    \n                                    قد مضى الكلام في هذه الآية في ( البقرة ) وغيرها\n                                    ",
        "saadi": "أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ ٥\n                                        \n                                        \n                                        \n                                        فـ { أُولَئِكَ } هم المحسنون الجامعون بين العلم التام، والعمل { عَلَى هُدًى } أي: عظيم كما يفيده التنكير، وذلك الهدى حاصل لهم، وواصل إليهم { مِنْ رَبِّهِمْ } الذي لم يزل يربيهم بالنعم; ويدفع عنهم النقم.\nوهذا الهدى الذي أوصله إليهم، من تربيته الخاصة بأوليائه، وهو أفضل أنواع التربية. { وَأُولَئِكَ هُمُ الْمُفْلِحُونَ } الذين أدركوا رضا ربهم، وثوابه الدنيوي والأخروي، وسلموا من سخطه وعقابه، وذلك لسلوكهم طريق الفلاح، الذي لا طريق له غيرها.\nولما ذكر تعالى المهتدين بالقرآن، المقبلين عليه، ذكر من أعرض عنه، ولم يرفع به رأسا، وأنه عوقب على ذلك، بأن تعوض عنه كل باطل من القول، فترك أعلى الأقوال، وأحسن الحديث، واستبدل به أسفل قول وأقبحه، فلذلك قال:\n                                    "
      },
      "originalText": "أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ ٥"
    },
    {
      "number": 3475,
      "text": "وَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّخِذَهَا هُزُوًا ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 6,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِنَ ٱلنَّاسِ مَن يَشۡتَرِي لَهۡوَ ٱلۡحَدِيثِ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّخِذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ ٦\n                                    \n                                    \n                                    ما ذكر تعالى حال السعداء ، وهم الذين يهتدون بكتاب الله وينتفعون بسماعه ، كما قال [ الله ] تعالى : ( الله نزل أحسن الحديث كتابا متشابها مثاني تقشعر منه جلود الذين يخشون ربهم ثم تلين جلودهم وقلوبهم إلى ذكر الله ذلك هدى الله يهدي به من يشاء ومن يضلل الله فما له من هاد ) [ الزمر : 23 ] ، عطف بذكر حال الأشقياء الذين أعرضوا عن الانتفاع بسماع كلام الله ، وأقبلوا على استماع المزامير والغناء بالألحان وآلات الطرب ، كما قال ابن مسعود في قوله تعالى : ( ومن الناس من يشتري لهو الحديث ) قال : هو - والله - الغناء .\nقال ابن جرير : حدثني يونس بن عبد الأعلى ، أخبرنا ابن وهب ، أخبرني يزيد بن يونس ، عن أبي صخر ، عن أبي معاوية البجلي ، عن سعيد بن جبير ، عن أبي الصهباء البكري ، أنه سمع عبد الله بن مسعود - وهو يسأل عن هذه الآية : ( ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله ) - فقال عبد الله : الغناء ، والله الذي لا إله إلا هو ، يرددها ثلاث مرات .\nحدثنا عمرو بن علي ، حدثنا صفوان بن عيسى ، أخبرنا حميد الخراط ، عن عمار ، عن سعيد بن جبير ، عن أبي الصهباء : أنه سأل ابن مسعود عن قول الله : ( ومن الناس من يشتري لهو الحديث ) قال : الغناء .\nوكذا قال ابن عباس ، وجابر ، وعكرمة ، وسعيد بن جبير ، ومجاهد ، ومكحول ، وعمرو بن شعيب ، وعلي بن بذيمة .\nوقال الحسن البصري : أنزلت هذه الآية : ( ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله بغير علم ) في الغناء والمزامير .\nوقال قتادة : قوله : ( ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله بغير علم ) : والله لعله لا ينفق فيه مالا ولكن شراؤه استحبابه ، بحسب المرء من الضلالة أن يختار حديث الباطل على حديث الحق ، وما يضر على ما ينفع .\nوقيل : عنى بقوله : ( يشتري لهو الحديث ) : اشتراء المغنيات من الجواري .\nقال ابن أبي حاتم : حدثنا محمد بن إسماعيل الأحمسي : حدثنا وكيع ، عن خلاد الصفار ، عن عبيد الله بن زحر ، عن علي بن يزيد ، عن القاسم بن عبد الرحمن عن أبي أمامة ، عن النبي صلى الله عليه وسلم قال : \" لا يحل بيع المغنيات ولا شراؤهن ، وأكل أثمانهن حرام ، وفيهن أنزل الله عز وجل علي : ( ومن الناس من يشتري لهو الحديث ) .\nوهكذا رواه الترمذي وابن جرير ، من حديث عبيد الله بن زحر بنحوه ، ثم قال الترمذي : هذا حديث غريب . وضعف علي بن يزيد المذكور .\nقلت : علي ، وشيخه ، والراوي عنه ، كلهم ضعفاء . والله أعلم .\nوقال الضحاك في قوله تعالى : ( ومن الناس من يشتري لهو الحديث ) يعني : الشرك . وبه قال عبد الرحمن بن زيد بن أسلم ; واختار ابن جرير أنه كل كلام يصد عن آيات الله واتباع سبيله .\nوقوله : ( ليضل عن سبيل الله ) أي : إنما يصنع هذا للتخالف للإسلام وأهله .\nوعلى قراءة فتح الياء ، تكون اللام لام العاقبة ، أو تعليلا للأمر القدري ، أي : قيضوا لذلك ليكونوا كذلك .\nوقوله : ( ويتخذها هزوا ) قال مجاهد : ويتخذ سبيل الله هزوا ، يستهزئ بها .\nوقال قتادة : يعني : ويتخذ آيات الله هزوا . وقول مجاهد أولى .\nوقوله تعالى : ( أولئك لهم عذاب مهين ) أي : كما استهانوا بآيات الله وسبيله ، أهينوا يوم القيامة في العذاب الدائم المستمر .\n                                    ",
        "qortoby": "وَمِنَ ٱلنَّاسِ مَن يَشۡتَرِي لَهۡوَ ٱلۡحَدِيثِ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّخِذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ ٦\n                                    \n                                    \n                                    قوله تعالى : ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله بغير علم ويتخذها هزوا أولئك لهم عذاب مهين .\nفيه خمس مسائل :\nالأولى : قوله تعالى : ومن الناس من يشتري لهو الحديث من في موضع رفع بالابتداء . و ( لهو الحديث ) : الغناء ; في قول ابن مسعود وابن عباس وغيرهما . النحاس : وهو ممنوع بالكتاب والسنة ; والتقدير : من يشتري ذا لهو أو ذات لهو ; مثل : واسأل القرية . أو يكون التقدير : لما كان إنما اشتراها يشتريها ويبالغ في ثمنها كأنه اشتراها للهو .\nقلت : هذه إحدى الآيات الثلاث التي استدل بها العلماء على كراهة الغناء والمنع منه . والآية الثانية قوله تعالى : وأنتم سامدون . قال ابن عباس : هو الغناء بالحميرية ; اسمدي لنا ; أي غني لنا .\nوالآية الثالثة قوله تعالى : واستفزز من استطعت منهم بصوتك قال مجاهد : الغناء والمزامير . وقد مضى في ( سبحان ) الكلام فيه . وروى الترمذي عن أبي أمامة عن رسول الله صلى الله عليه وسلم قال : لا تبيعوا القينات ولا تشتروهن ولا تعلموهن ، ولا خير في تجارة فيهن ، وثمنهن حرام في مثل هذا أنزلت هذه الآية : ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله إلى آخر الآية . قال أبو عيسى : هذا حديث غريب ، إنما يروى من حديث القاسم عن أبي أمامة ، والقاسم ثقة وعلي بن يزيد يضعف في الحديث ; قاله محمد بن إسماعيل . قال ابن عطية : وبهذا فسر ابن مسعود وابن عباس وجابر بن عبد الله ومجاهد ، وذكره أبو الفرج الجوزي عن الحسن وسعيد بن جبير وقتادة والنخعي .\nقلت : هذا أعلى ما قيل في هذه الآية ، وحلف على ذلك ابن مسعود بالله الذي لا إله إلا هو ثلاث مرات إنه الغناء . روى سعيد بن جبير عن أبي الصهباء البكري قال : سئل عبد الله بن مسعود عن قوله تعالى : ومن الناس من يشتري لهو الحديث فقال : الغناء والله الذي لا إله إلا هو ; يرددها ثلاث مرات . وعن ابن عمر أنه الغناء ; وكذلك قال عكرمة وميمون بن مهران ومكحول . وروى شعبة وسفيان عن الحكم وحماد عن إبراهيم قال : قال عبد الله بن مسعود : الغناء ينبت النفاق في القلب ; وقاله مجاهد ، وزاد : إن لهو الحديث في الآية الاستماع إلى الغناء وإلى مثله من الباطل . وقال الحسن : لهو الحديث المعازف والغناء . وقال القاسم بن محمد : الغناء باطل والباطل في النار . وقال ابن القاسم سألت مالكا عنه فقال : قال الله تعالى : فماذا بعد الحق إلا الضلال أفحق هو ؟ ! وترجم البخاري ( باب ) كل لهو باطل إذا شغل عن طاعة الله ، ومن قال لصاحبه تعالى أقامرك ، وقوله تعالى : ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله بغير علم ويتخذها هزوا فقوله : إذا شغل عن طاعة الله مأخوذ من قوله تعالى : ليضل عن سبيل الله . وعن الحسن أيضا : هو الكفر والشرك . وتأوله قوم على الأحاديث التي يتلهى بها أهل الباطل واللعب .\nوقيل : نزلت في النضر بن الحارث ; لأنه اشترى كتب الأعاجم : رستم ، وإسفنديار ; فكان يجلس بمكة ، فإذا قالت قريش إن محمدا قال كذا ضحك منه ، وحدثهم بأحاديث ملوك الفرس ويقول : حديثي هذا أحسن من حديث محمد ; حكاه الفراء والكلبي وغيرهما . وقيل : كان يشتري المغنيات فلا يظفر بأحد يريد الإسلام إلا انطلق به إلى قينته فيقول : أطعميه واسقيه وغنيه ; ويقول : هذا خير مما يدعوك إليه محمد من الصلاة والصيام وأن تقاتل بين يديه . وهذا القول والأول ظاهر في الشراء . وقالت طائفة : الشراء في هذه الآية مستعار ، وإنما نزلت الآية في أحاديث قريش وتلهيهم بأمر الإسلام وخوضهم في الباطل . قال ابن عطية : فكان ترك ما يجب فعله وامتثال هذه المنكرات شراء لها ; على حد قوله تعالى : أولئك الذين اشتروا الضلالة بالهدى ; اشتروا الكفر بالإيمان ، أي استبدلوه منه واختاروه عليه . وقال مطرف : شراء لهو الحديث استحبابه . قتادة : ولعله لا ينفق فيه مالا ، ولكن سماعه شراؤه .\nقلت : القول الأول أولى ما قيل به في هذا الباب ; للحديث المرفوع فيه ، وقول الصحابة والتابعين فيه . وقد زاد الثعلبي والواحدي في حديث أبي أمامة : ( وما من رجل يرفع صوته بالغناء إلا بعث الله عليه شيطانين أحدهما على هذا المنكب والآخر على هذا المنكب فلا يزالان يضربان بأرجلهما حتى يكون هو الذي يسكت ) . وروى الترمذي وغيره من حديث أنس وغيره عن النبي صلى الله عليه وسلم أنه قال : صوتان ملعونان فاجران أنهى عنهما : صوت مزمار ورنة شيطان عند نغمة ومرح ، ورنة عند مصيبة لطم خدود وشق جيوب . وروى جعفر بن محمد عن أبيه عن جده عن علي عليه السلام قال قال رسول الله صلى الله عليه وسلم : ( بعثت بكسر المزامير ) خرجه أبو طالب الغيلاني . وخرج ابن بشران عن عكرمة عن ابن عباس أن النبي صلى الله عليه وسلم قال : ( بعثت بهدم المزامير والطبل ) . وروى الترمذي من حديث علي رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : إذا فعلت أمتي خمس عشرة خصلة حل بها البلاء - فذكر منها : إذا اتخذت القينات والمعازف . وفي حديث أبي هريرة : وظهرت القيان والمعازف . وروى ابن المبارك عن مالك بن أنس عن محمد بن المنكدر عن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : من جلس إلى قينة يسمع منها صب في أذنه الآنك يوم القيامة . وروى أسد بن موسى عن عبد العزيز بن أبي سلمة عن محمد بن المنكدر قال : بلغنا أن الله تعالى يقول يوم القيامة : \" أين عبادي الذين كانوا ينزهون أنفسهم وأسماعهم عن اللهو ومزامير الشيطان أحلوهم رياض المسك وأخبروهم أني قد أحللت عليهم رضواني \" . وروى ابن وهب عن مالك عن محمد بن المنكدر مثله ، وزاد بعد قوله \" المسك \" : \" ثم يقول للملائكة أسمعوهم حمدي وشكري وثنائي ، وأخبروهم ألا خوف عليهم ولا هم يحزنون \" . وقد روي مرفوعا هذا المعنى من حديث أبي موسى الأشعري أنه قال : قال رسول الله صلى الله عليه وسلم : من استمع إلى صوت غناء لم يؤذن له أن يسمع الروحانيين . فقيل : ومن الروحانيون يا رسول الله ؟ قال : قراء أهل الجنة خرجه الترمذي الحكيم أبو عبد الله في نوادر الأصول ، وقد ذكرنا في كتاب التذكرة مع نظائره : فمن شرب الخمر في الدنيا لم يشربها في الآخرة ، ومن لبس الحرير في الدنيا لم يلبسه في الآخرة . إلى غير ذلك . وكل ذلك صحيح المعنى على ما بيناه هناك . ومن رواية مكحول عن عائشة قالت : قال رسول الله صلى الله عليه وسلم : من مات وعنده جارية مغنية فلا تصلوا عليه . ولهذه الآثار وغيرها قال العلماء بتحريم الغناء . وهي المسألة : -\nالثانية : وهو الغناء المعتاد عند المشتهرين به ، الذي يحرك النفوس ويبعثها على الهوى والغزل ، والمجون الذي يحرك الساكن ويبعث الكامن ; فهذا النوع إذا كان في شعر يشبب فيه بذكر النساء ووصف محاسنهن وذكر الخمور والمحرمات لا يختلف في تحريمه ; لأنه اللهو والغناء المذموم بالاتفاق . فأما ما سلم من ذلك فيجوز القليل منه في أوقات الفرح ; كالعرس والعيد وعند التنشيط على الأعمال الشاقة ، كما كان في حفر الخندق وحدو أنجشة وسلمة بن الأكوع . فأما ما ابتدعته الصوفية اليوم من الإدمان على سماع المغاني بالآلات المطربة من الشبابات والطار والمعازف والأوتار فحرام . قال ابن العربي : فأما طبل الحرب فلا حرج فيه ; لأنه يقيم النفوس ويرهب العدو . وفي اليراعة تردد . والدف مباح . الجوهري : وربما سموا قصبة الراعي التي يزمر بها هيرعة ويراعة . قال القشيري : ضرب بين يدي النبي صلى الله عليه وسلم يوم دخل المدينة ، فهم أبو بكر بالزجر فقال رسول الله صلى الله عليه وسلم : دعهن يا أبا بكر حتى تعلم اليهود أن ديننا فسيح ، فكن يضربن ويقلن :\nنحن بنات النجار ، حبذا محمد من جار\n. وقد قيل : إن الطبل في النكاح كالدف ، وكذلك الآلات المشهرة للنكاح يجوز استعمالها فيه بما يحسن من الكلام ولم يكن فيه رفث .\nالثالثة : الاشتغال بالغناء على الدوام سفه ترد به الشهادة ، فإن لم يدم لم ترد . وذكر إسحاق بن عيسى الطباع قال : سألت مالك بن أنس عما يرخص فيه أهل المدينة من الغناء فقال : إنما يفعله عندنا الفساق . وذكر أبو الطيب طاهر بن عبد الله الطبري قال : أما مالك بن أنس فإنه نهى عن الغناء وعن استماعه ، وقال : إذا اشترى جارية ووجدها مغنية كان له ردها بالعيب ; وهو مذهب سائر أهل المدينة ; إلا إبراهيم بن سعد فإنه حكى عنه زكريا الساجي أنه كان لا يرى به بأسا . وقال ابن خويز منداد : فأما مالك فيقال عنه : إنه كان عالما بالصناعة وكان مذهبه تحريمها . وروي عنه أنه قال : تعلمت هذه الصناعة وأنا غلام شاب ، فقالت لي أمي : أي بني ! إن هذه الصناعة يصلح لها من كان صبيح الوجه ولست كذلك ، فطلب العلوم الدينية ; فصحبت ربيعة فجعل الله في ذلك خيرا . قال أبو الطيب الطبري : وأما مذهب أبي حنيفة فإنه يكره الغناء مع إباحته شرب النبيذ ، ويجعل سماع الغناء من الذنوب . وكذلك مذهب سائر أهل الكوفة : إبراهيم والشعبي وحماد والثوري وغيرهم ، لا اختلاف بينهم في ذلك . وكذلك لا يعرف بين أهل البصرة خلاف في كراهية ذلك والمنع منه ; إلا ما روي عن عبيد الله بن الحسن العنبري أنه كان لا يرى به بأسا . قال : وأما مذهب الشافعي فقال : الغناء مكروه يشبه الباطل ، ومن استكثر منه فهو سفيه ترد شهادته .\nوذكر أبو الفرج الجوزي عن إمامه أحمد بن حنبل ثلاث روايات قال : وقد ذكر أصحابنا عن أبي بكر الخلال وصاحبه عبد العزيز إباحة الغناء ، وإنما أشاروا إلى ما كان في زمانهما من القصائد الزهديات ; قال : وعلى هذا يحمل ما لم يكرهه أحمد ; ويدل عليه أنه سئل عن رجل مات وخلف ولدا وجارية مغنية فاحتاج الصبي إلى بيعها ، فقال : تباع على أنها ساذجة لا على أنها مغنية . فقيل له : إنها تساوي ثلاثين ألفا ; ولعلها إن بيعت ساذجة تساوي عشرين ألفا ؟ فقال : لا تباع إلا على أنها ساذجة . قال أبو الفرج : وإنما قال أحمد هذا لأن هذه الجارية المغنية لا تغني بقصائد الزهد ، بل بالأشعار المطربة المثيرة إلى العشق .\nوهذا دليل على أن الغناء محظور ; إذ لو لم يكن محظورا ما جاز تفويت المال على اليتيم . وصار هذا كقول أبي طلحة للنبي صلى الله عليه وسلم : عندي خمر لأيتام ؟ فقال : أرقها . فلو جاز استصلاحها لما أمر بتضييع مال اليتامى . قال الطبري : فقد أجمع علماء الأمصار على كراهة الغناء والمنع منه . وإنما فارق الجماعة إبراهيم بن سعد وعبيد الله العنبري ; وقد قال رسول الله صلى الله عليه وسلم : عليكم بالسواد الأعظم . ومن فارق الجماعة مات ميتة جاهلية . قال أبو الفرج : وقال القفال من أصحابنا : لا تقبل شهادة المغني والرقاص .\nقلت : وإذ قد ثبت أن هذا الأمر لا يجوز فأخذ الأجرة عليه لا تجوز . وقد ادعى أبو عمر بن عبد البر الإجماع على تحريم الأجرة على ذلك . وقد مضى في الأنعام عند قوله : وعنده مفاتح الغيب وحسبك .\nالرابعة : قال القاضي أبو بكر ابن العربي : وأما سماع القينات فيجوز للرجل أن يسمع غناء جاريته ; إذ ليس شيء منها عليه حراما لا من ظاهرها ولا من باطنها ، فكيف يمنع من التلذذ بصوتها . أما إنه لا يجوز انكشاف النساء للرجال ولا هتك الأستار ولا سماع الرفث ، فإذا خرج ذلك إلى ما لا يحل ولا يجوز منع من أوله واجتث من أصله . وقال أبو الطيب الطبري : أما سماع الغناء من المرأة التي ليست بمحرم فإن أصحاب الشافعي قالوا لا يجوز ، سواء كانت حرة أو مملوكة . قال : وقال الشافعي : وصاحب الجارية إذا جمع الناس لسماعها فهو سفيه ترد شهادته ; ثم غلظ القول فيه فقال : فهي دياثة . وإنما جعل صاحبها سفيها لأنه دعا الناس إلى الباطل ، ومن دعا الناس إلى الباطل كان سفيها .\nالخامسة : قوله تعالى : ليضل عن سبيل الله قراءة العامة بضم الياء ; أي ليضل غيره عن طريق الهدى ، وإذا أضل غيره فقد ضل . وقرأ ابن كثير وابن محيصن وحميد وأبو عمرو ورويس وابن أبي إسحاق ( بفتح الياء ) على اللازم ; أي ليضل هو نفسه . ويتخذها هزوا قراءة المدنيين وأبي عمرو وعاصم بالرفع عطفا على من يشتري ويجوز أن يكون مستأنفا . وقرأ الأعمش وحمزة والكسائي : ويتخذها بالنصب عطفا على ليضل . ومن الوجهين جميعا لا يحسن الوقف على قوله : بغير علم والوقف على قوله : هزوا ، والهاء في ويتخذها كناية عن الآيات . ويجوز أن يكون كناية عن السبيل ; لأن السبيل يؤنث ويذكر . أولئك لهم عذاب مهين أي شديد يهينهم قال الشاعر [ جرير ] :\nولقد جزعت إلى النصارى بعد ما لقي الصليب من العذاب مهينا\n                                    ",
        "saadi": "وَمِنَ ٱلنَّاسِ مَن يَشۡتَرِي لَهۡوَ ٱلۡحَدِيثِ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّخِذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ ٦\n                                        \n                                        \n                                        \n                                        أي: { وَمِنَ النَّاسِ مَنْ } هو محروم مخذول { يَشْتَرِي } أي: يختار ويرغب رغبة من يبذل الثمن في الشيء. { لَهْوَ الْحَدِيثِ } أي: الأحاديث الملهية للقلوب، الصادَّة لها عن أجلِّ مطلوب. فدخل في هذا كل كلام محرم، وكل لغو، وباطل، وهذيان من الأقوال المرغبة في الكفر، والفسوق، والعصيان، ومن أقوال الرادين على الحق، المجادلين بالباطل ليدحضوا به الحق، ومن غيبة، ونميمة، وكذب، وشتم، وسب، ومن غناء ومزامير شيطان، ومن الماجريات الملهية، التي لا نفع فيها في دين ولا دنيا.\nفهذا الصنف من الناس، يشتري لهو الحديث، عن هدي الحديث { لِيُضِلَّ } الناس { بِغَيْرِ عِلْمٍ } أي: بعدما ضل بفعله، أضل غيره، لأن الإضلال، ناشئ عن الضلال.\nوإضلاله في هذا الحديث; صده عن الحديث النافع، والعمل النافع، والحق المبين، والصراط المستقيم.\nولا يتم له هذا، حتى يقدح في الهدى والحق، ويتخذ آيات اللّه هزوا ويسخر بها، وبمن جاء بها، فإذا جمع بين مدح الباطل والترغيب فيه، والقدح في الحق، والاستهزاء به وبأهله، أضل من لا علم عنده وخدعه بما يوحيه إليه، من القول الذي لا يميزه ذلك الضال، ولا يعرف حقيقته.\n{ أُولَئِكَ لَهُمْ عَذَابٌ مُهِينٌ } بما ضلوا وأضلوا، واستهزءوا [بآيات اللّه] وكذبوا الحق الواضح.\n                                    "
      },
      "originalText": "وَمِنَ ٱلنَّاسِ مَن يَشۡتَرِي لَهۡوَ ٱلۡحَدِيثِ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّخِذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ ٦"
    },
    {
      "number": 3476,
      "text": "وَإِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا وَلَّىٰ مُسْتَكْبِرًا كَأَنْ لَمْ يَسْمَعْهَا كَأَنَّ فِي أُذُنَيْهِ وَقْرًا ۖ فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 7,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا وَلَّىٰ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَا كَأَنَّ فِيٓ أُذُنَيۡهِ وَقۡرٗاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٍ ٧\n                                    \n                                    \n                                    ثم قال تعالى : ( وإذا تتلى عليه آياتنا ولى مستكبرا كأن لم يسمعها كأن في أذنيه وقرا ) أي : هذا المقبل على اللهو واللعب والطرب ، إذا تليت عليه الآيات القرآنية ، ولى عنها وأعرض وأدبر وتصام وما به من صمم ، كأنه ما يسمعها; لأنه يتأذى بسماعها ، إذ لا انتفاع له بها ، ولا أرب له فيها ، ( فبشره بعذاب أليم ) أي : يوم القيامة يؤلمه ، كما تألم بسماع كتاب الله وآياته .\n                                    ",
        "qortoby": "وَإِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا وَلَّىٰ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَا كَأَنَّ فِيٓ أُذُنَيۡهِ وَقۡرٗاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٍ ٧\n                                    \n                                    \n                                    قوله تعالى : وإذا تتلى عليه آياتنا ولى مستكبرا كأن لم يسمعها كأن في أذنيه وقرا فبشره بعذاب أليم .\nقوله تعالى : وإذا تتلى عليه آياتنا يعني القرآن . ولى أي أعرض . مستكبرا نصب على الحال . كأن لم يسمعها كأن في أذنيه وقرا ثقلا وصمما . وقد تقدم فبشره بعذاب أليم تقدم أيضا .\n                                    ",
        "saadi": "وَإِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا وَلَّىٰ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَا كَأَنَّ فِيٓ أُذُنَيۡهِ وَقۡرٗاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٍ ٧\n                                        \n                                        \n                                        \n                                        ولهذا قال { وَإِذَا تُتْلَى عَلَيْهِ آيَاتُنَا } ليؤمن بها وينقاد لها، { وَلَّى مُسْتَكْبِرًا } أي: أدبر إدبار مستكبر عنها، رادٍّ لها، ولم تدخل قلبه ولا أثرت فيه، بل أدبر عنها { كَأَنْ لَمْ يَسْمَعْهَا } بل { كَأَنَّ فِي أُذُنَيْهِ وَقْرًا } أي: صمما لا تصل إليه الأصوات; فهذا لا حيلة في هدايته.\n{ فَبَشِّرْهُ } بشارة تؤثر في قلبه الحزن والغم; وفي بشرته السوء والظلمة والغبرة. { بِعَذَابٍ أَلِيمٍ } مؤلم لقلبه; ولبدنه; لا يقادر قدره; ولا يدرى بعظيم أمره، وهذه بشارة أهل الشر، فلا نِعْمَتِ البشارة.\n                                    "
      },
      "originalText": "وَإِذَا تُتۡلَىٰ عَلَيۡهِ ءَايَٰتُنَا وَلَّىٰ مُسۡتَكۡبِرٗا كَأَن لَّمۡ يَسۡمَعۡهَا كَأَنَّ فِيٓ أُذُنَيۡهِ وَقۡرٗاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِيمٍ ٧"
    },
    {
      "number": 3477,
      "text": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتُ النَّعِيمِ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 8,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ جَنَّٰتُ ٱلنَّعِيمِ ٨\n                                    \n                                    \n                                    هذا ذكر مآل الأبرار من السعداء في الدار الآخرة ، الذين آمنوا بالله وصدقوا المرسلين ، وعملوا الأعمال الصالحة المتابعة لشريعة الله ( لهم جنات النعيم ) أي : يتنعمون فيها بأنواع الملاذ والمسار ، من المآكل والمشارب ، والملابس والمساكن ، والمراكب والنساء ، والنضرة والسماع الذي لم يخطر ببال أحد .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ جَنَّٰتُ ٱلنَّعِيمِ ٨\n                                    \n                                    \n                                    قوله تعالى : إن الذين آمنوا وعملوا الصالحات لهم جنات النعيم.\nقوله تعالى : إن الذين آمنوا وعملوا الصالحات لهم جنات النعيم لما ذكر عذاب الكفار ذكر نعيم المؤمنين .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ جَنَّٰتُ ٱلنَّعِيمِ ٨\n                                        \n                                        \n                                        \n                                        وأما بشارة أهل الخير فقال: { إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ } جمعوا بين عبادة الباطن بالإيمان، والظاهر بالإسلام، والعمل الصالح.\n{ لَهُمْ جَنَّاتُ النَّعِيمِ } بشارة لهم بما قدموه، وقرى لهم بما أسلفوه.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَهُمۡ جَنَّٰتُ ٱلنَّعِيمِ ٨ "
    },
    {
      "number": 3478,
      "text": "خَالِدِينَ فِيهَا ۖ وَعْدَ اللَّهِ حَقًّا ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 9,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "خَٰلِدِينَ فِيهَاۖ وَعۡدَ ٱللَّهِ حَقّٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٩\n                                    \n                                    \n                                    وهم في ذلك مقيمون دائما فيها ، لا يظعنون ، ولا يبغون عنها حولا .\nوقوله : ( وعد الله حقا ) أي : هذا كائن لا محالة; لأنه من وعد الله ، والله لا يخلف الميعاد; لأنه الكريم المنان ، الفعال لما يشاء ، القادر على كل شيء ، ( وهو العزيز ) ، الذي قد قهر كل شيء ، ودان له كل شيء ، ( الحكيم ) ، في أقواله وأفعاله ، الذي جعل القرآن هدى للمؤمنين ( قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى ) [ فصلت : 44 ] ، ( وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا ) [ الإسراء : 82 ] .\n                                    ",
        "qortoby": "خَٰلِدِينَ فِيهَاۖ وَعۡدَ ٱللَّهِ حَقّٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٩\n                                    \n                                    \n                                    خالدين فيها أي دائمين . وعد الله حقا أي وعدهم الله هذا وعدا حقا لا خلف فيه . وهو العزيز الحكيم تقدم أيضا .\n                                    ",
        "saadi": "خَٰلِدِينَ فِيهَاۖ وَعۡدَ ٱللَّهِ حَقّٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٩\n                                        \n                                        \n                                        \n                                        { خَالِدِينَ فِيهَا } أي: في جنات النعيم، نعيم القلب والروح، والبدن.\n{ وَعْدَ اللَّهِ حَقًّا } لا يمكن أن يخلف، ولا يغير، ولا يتبدل. { وَهُوَ الْعَزِيزُ الْحَكِيمُ } كامل العزة، كامل الحكمة، من عزته وحكمته، وفق من وفق، وخذل من خذل، بحسب ما اقتضاه علمه فيهم وحكمته.\n                                    "
      },
      "originalText": " خَٰلِدِينَ فِيهَاۖ وَعۡدَ ٱللَّهِ حَقّٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٩"
    },
    {
      "number": 3479,
      "text": "خَلَقَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ وَأَلْقَىٰ فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ ۚ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ كَرِيمٍ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 10,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "خَلَقَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا فِيهَا مِن كُلِّ زَوۡجٖ كَرِيمٍ ٠١\n                                    \n                                    \n                                    يبين سبحانه بهذا قدرته العظيمة على خلق السماوات والأرض ، وما فيهما وما بينهما ، فقال : ( خلق السماوات بغير عمد ) ، قال الحسن وقتادة : ليس لها عمد مرئية ولا غير مرئية .\nوقال ابن عباس ، وعكرمة ، ومجاهد : لها عمد لا ترونها . وقد تقدم تقرير هذه المسألة في أول سورة \" الرعد \" بما أغنى عن إعادته .\n( وألقى في الأرض رواسي ) يعني : الجبال أرست الأرض وثقلتها لئلا تضطرب بأهلها على وجه الماء; ولهذا قال : ( أن تميد بكم وبث فيها من كل دابة ) أي : وذرأ فيها من أصناف الحيوانات مما لا يعلم عدد أشكالها وألوانها إلا الذي خلقها .\nولما قرر أنه الخالق نبه على أنه الرازق بقوله تعالى ( وأنزلنا من السماء ماء فأنبتنا فيها من كل زوج كريم ) أي : من كل زوج من النبات كريم ، أي : حسن المنظر .\nوقال الشعبي : والناس - أيضا - من نبات الأرض ، فمن دخل الجنة فهو كريم ، ومن دخل النار فهو لئيم .\n                                    ",
        "qortoby": "خَلَقَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا فِيهَا مِن كُلِّ زَوۡجٖ كَرِيمٍ ٠١\n                                    \n                                    \n                                    قوله تعالى : خلق السماوات بغير عمد ترونها وألقى في الأرض رواسي أن تميد بكم وبث فيها من كل دابة وأنزلنا من السماء ماء فأنبتنا فيها من كل زوج كريم\nقوله تعالى : خلق السماوات بغير عمد ترونها تكون ترونها في موضع خفض على النعت ل ( عمد ) ، فيمكن أن يكون ثم عمد ، ولكن لا ترى . ويجوز أن تكون في موضع نصب على الحال من السماوات ولا عمد ثم البتة . النحاس : وسمعت علي بن سليمان يقول : الأولى أن يكون مستأنفا ، ولا عمد ثم ; قاله مكي . ويكون بغير عمد التمام . وقد مضى في ( الرعد ) الكلام في هذه الآية . وألقى في الأرض رواسي أي جبالا ثوابت . أن تميد بكم في موضع نصب ; أي كراهية أن تميد . والكوفيون يقدرونه بمعنى لئلا تميد . وبث فيها من كل دابة وأنزلنا من السماء ماء فأنبتنا فيها من كل زوج كريم عن ابن عباس : من كل لون حسن . وتأوله الشعبي على الناس ; لأنهم مخلوقون من الأرض ; قال : من كان منهم يصير إلى الجنة فهو الكريم ، ومن كان منهم يصير إلى النار فهو اللئيم . وقد تأول غيره أن النطفة مخلوقة من تراب ، وظاهر القرآن يدل على ذلك .\n                                    ",
        "saadi": "خَلَقَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا فِيهَا مِن كُلِّ زَوۡجٖ كَرِيمٍ ٠١\n                                        \n                                        \n                                        \n                                        يتلو تعالى على عباده، آثارا من آثار قدرته، وبدائع من بدائع حكمته، ونعما من آثار رحمته، فقال: { خَلْقِ السَّمَاوَاتِ } السبع على عظمها، وسعتها، وكثافتها، وارتفاعها الهائل. { بِغَيْرِ عَمَدٍ تَرَوْنَهَا } أي: ليس لها عمد، ولو كان لها عمد لرئيت، وإنما استقرت واستمسكت، بقدرة اللّه تعالى.\n{ وَأَلْقَى فِي الْأَرْضِ رَوَاسِيَ } أي: جبالا عظيمة، ركزها في أرجائها وأنحائها، لئلا { تَمِيدَ بِكُمْ } فلولا الجبال الراسيات لمادت الأرض، ولما استقرت بساكنيها.\n{ وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ } أي: نشر في الأرض الواسعة، من جميع أصناف الدواب، التي هي مسخرة لبني آدم، ولمصالحهم، ومنافعهم. ولما بثها في الأرض، علم تعالى أنه لا بد لها من رزق تعيش به، فأنزل من السماء ماء مباركا، { فَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ كَرِيمٍ } المنظر، نافع مبارك، فرتعت فيه الدواب المنبثة، وسكن إليه كل حيوان.\n                                    "
      },
      "originalText": "خَلَقَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا فِيهَا مِن كُلِّ زَوۡجٖ كَرِيمٍ ٠١"
    },
    {
      "number": 3480,
      "text": "هَٰذَا خَلْقُ اللَّهِ فَأَرُونِي مَاذَا خَلَقَ الَّذِينَ مِنْ دُونِهِ ۚ بَلِ الظَّالِمُونَ فِي ضَلَالٍ مُبِينٍ",
      "surah": {
        "number": 31,
        "name": "سورة لقمان",
        "englishName": "Luqman",
        "englishNameTranslation": "Luqman",
        "revelationType": "Meccan",
        "numberOfAyahs": 34
      },
      "numberInSurah": 11,
      "juz": 21,
      "manzil": 5,
      "page": 411,
      "ruku": 355,
      "hizbQuarter": 164,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هَٰذَا خَلۡقُ ٱللَّهِ فَأَرُونِي مَاذَا خَلَقَ ٱلَّذِينَ مِن دُونِهِۦۚ بَلِ ٱلظَّٰلِمُونَ فِي ضَلَٰلٖ مُّبِينٖ ١١\n                                    \n                                    \n                                    وقوله : ( هذا خلق الله ) أي : هذا الذي ذكره تعالى من خلق السماوات ، والأرض وما بينهما ، صادر عن فعل الله وخلقه وتقديره ، وحده لا شريك له في ذلك; ولهذا قال : ( فأروني ماذا خلق الذين من دونه ) أي : مما تعبدون وتدعون من الأصنام والأنداد ، ( بل الظالمون ) يعني : المشركين بالله العابدين معه غيره ) في ضلال ) أي : جهل وعمى ، ( مبين ) أي : واضح ظاهر لا خفاء به .\n                                    ",
        "qortoby": "هَٰذَا خَلۡقُ ٱللَّهِ فَأَرُونِي مَاذَا خَلَقَ ٱلَّذِينَ مِن دُونِهِۦۚ بَلِ ٱلظَّٰلِمُونَ فِي ضَلَٰلٖ مُّبِينٖ ١١\n                                    \n                                    \n                                    قوله تعالى : هذا خلق الله مبتدأ وخبر . والخلق بمعنى المخلوق ; أي هذا الذي ذكرته مما تعاينون خلق الله أي مخلوق الله ، أي خلقها من غير شريك . فأروني معاشر المشركين ماذا خلق الذين من دونه يعني الأصنام . بل الظالمون أي المشركون في ضلال مبين أي خسران ظاهر . ( وما ) استفهام في موضع رفع بالابتداء وخبره ( ذا ) وذا بمعنى الذي . و ( خلق ) واقع على هاء محذوفة ; تقديره فأروني أي شيء خلق الذين من دونه ; والجملة في موضع نصب ب ( أروني ) وتضمر الهاء مع ( خلق ) تعود على الذين ; أي فأروني الأشياء التي خلقها الذين من دونه . وعلى هذا القول تقول : ماذا تعلمت ؛ أنحوا أم شعرا . ويجوز أن تكون ( ما ) في موضع نصب ب ( أروني ) و ( ذا ) زائدة وعلى هذا القول يقول : ماذا تعلمت ، أنحوا أم شعرا ؟\n                                    ",
        "saadi": "هَٰذَا خَلۡقُ ٱللَّهِ فَأَرُونِي مَاذَا خَلَقَ ٱلَّذِينَ مِن دُونِهِۦۚ بَلِ ٱلظَّٰلِمُونَ فِي ضَلَٰلٖ مُّبِينٖ ١١\n                                        \n                                        \n                                        \n                                        { هَذَا } أي: خلق العالم العلوي والسفلي، من جماد، وحيوان، وسَوْقِ أرزاق الخلق إليهم { خَلق اللَّه } وحده لا شريك له، كل مقر بذلك حتى أنتم يا معشر المشركين.\n{ فَأَرُونِي مَاذَا خَلَقَ الَّذِينَ مِنْ دُونِهِ } أي: الذين جعلتموهم له شركاء، تدعونهم وتعبدونهم، يلزم على هذا، أن يكون لهم خلق كخلقه، ورزق كرزقه، فإن كان لهم شيء من ذلك فأرونيه، ليصح ما ادعيتم فيهم من استحقاق العبادة.\nومن المعلوم أنهم لا يقدرون أن يروه شيئا من الخلق لها، لأن جميع المذكورات، قد أقروا أنها خلق اللّه وحده، ولا ثَمَّ شيء يعلم غيرها، فثبت عجزهم عن إثبات شيء لها تستحق به أن تعبد.\nولكن عبادتهم إياها، عن غير علم وبصيرة، بل عن جهل وضلال، ولهذا قال: { بَلِ الظَّالِمُونَ فِي ضَلَالٍ مُبِينٍ } أي: جَلِيٍّ واضح حيث عبدوا من لا يملك نفعا ولا ضرا ولا موتا ولا حياة ولا نشورا، وتركوا الإخلاص للخالق الرازق المالك لكل الأمور.\n                                    "
      },
      "originalText": "هَٰذَا خَلۡقُ ٱللَّهِ فَأَرُونِي مَاذَا خَلَقَ ٱلَّذِينَ مِن دُونِهِۦۚ بَلِ ٱلظَّٰلِمُونَ فِي ضَلَٰلٖ مُّبِينٖ ١١"
    }
  ]
}