{
  "number": 419,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 3540,
      "text": "وَإِذْ أَخَذْنَا مِنَ النَّبِيِّينَ مِيثَاقَهُمْ وَمِنْكَ وَمِنْ نُوحٍ وَإِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَى ابْنِ مَرْيَمَ ۖ وَأَخَذْنَا مِنْهُمْ مِيثَاقًا غَلِيظًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 7,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 361,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ أَخَذۡنَا مِنَ ٱلنَّبِيِّ‍ۧنَ مِيثَٰقَهُمۡ وَمِنكَ وَمِن نُّوحٖ وَإِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبۡنِ مَرۡيَمَۖ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا ٧\n                                    \n                                    \n                                    يقول الله تعالى مخبراً عن أولي العزم الخمسة وبقية الأنبياء أنه أخذ عليهم العهد والميثاق في إِقامة دين الله تعالى، وإِبلاغ رسالته، والتعاون والتناصر والاتفاق كما قال تعالى\n{ وَإِذْ أَخَذَ ٱللَّهُ مِيثَـٰقَ ٱلنَّبِيِّيْنَ لَمَآ ءَاتَيْتُكُم مِّن كِتَـٰبٍ وَحِكْمَةٍ ثُمَّ جَآءَكُمْ رَسُولٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِ وَلَتَنصُرُنَّهُ قَالَ ءَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذٰلِكُمْ إِصْرِى قَالُوۤاْ أَقْرَرْنَا قَالَ فَٱشْهَدُواْ وَأَنَاْ مَعَكُمْ مِّنَ ٱلشَّـٰهِدِينَ }\nآل عمران 81 فهذا العهد والميثاق أخذ عليهم بعد إِرسالهم، وكذلك هذا، ونص من بينهم على هؤلاء الخمسة، وهم أولو العزم، وهو من باب عطف الخاص على العام، وقد صرح بذكرهم أيضاً في هذه الآية، وفي قوله تعالى\n{ شَرَعَ لَكُم مِّنَ ٱلدِّينِ مَا وَصَّىٰ بِهِ نُوحاً وَٱلَّذِيۤ أَوْحَيْنَآ إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَىٰ أَنْ أَقِيمُواْ ٱلدِّينَ وَلاَ تَتَفَرَّقُواْ فِيهِ }\nالشورى 13 فذكر الطرفين، والوسط الفاتح، والخاتم، ومن بينهما على الترتيب، فهذه هي الوصية التي أخذ عليهم الميثاق بها كما قال تعالى { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ مِيثَاقَهُمْ وَمِنْكَ وَمِن نُّوحٍ وَإِبْرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبْنِ مَرْيَمَ } فبدأ في هذه الآية بالخاتم لشرفه صلوات الله عليه، ثم رتبهم بحسب وجودهم صلوات الله عليهم. قال ابن أبي حاتم حدثنا أبو زرعة الدمشقي، حدثنا محمد بن بكار، حدثنا سعيد بن بشير، حدثني قتادة عن الحسن عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم في قوله تعالى { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ مِيثَاقَهُمْ وَمِنْكَ وَمِن نُّوحٍ } الآية. قال النبي صلى الله عليه وسلم \" كنت أول النبيين في الخلق، وآخرهم في البعث، فبدأ بي قبلهم \" سعيد بن بشير فيه ضعف، وقد رواه سعيد بن أبي عروبة عن قتادة به مرسلاً، وهو أشبه، ورواه بعضهم عن قتاده موقوفاً، والله علم. وقال أبو بكر البزار حدثنا عمرو بن علي، حدثنا أبو أحمد، حدثنا حمزة الزيات، حدثنا عدي بن ثابت عن أبي حازم عن أبي هريرة رضي الله عنه قال خيار ولد آدم خمسة نوح وإِبراهيم وموسى وعيسى ومحمد صلوات الله وسلامه عليهم أجمعين، وخيرهم محمد صلى الله عليه وسلم موقوف وحمزة فيه ضعف، وقد قيل إِن المراد بهذا الميثاق الذي أخذ منهم حين أخرجوا في صورة الذر من صلب آدم عليه الصلاة والسلام، كما قال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب قال ورفع أباهم آدم، فنظر إِليهم، يعني ذريته، وأن فيهم الغني والفقير، وحسن الصورة ودون ذلك، فقال رب لو سويت بين عبادك، فقال إِني أحببت أن أشكر، ورأى فيهم الأنبياء مثل السرج عليهم النور، وخصوا بميثاق آخر من الرسالة والنبوة، وهو الذي يقول الله تعالى { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ مِيثَاقَهُمْ وَمِنْكَ وَمِن نُّوحٍ وَإِبْرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبْنِ مَرْيَمَ } وهذا قول مجاهد أيضاً، وقال ابن عباس الميثاق الغليظ العهد.\n                                   وقوله تعالى { لِّيَسْأَلَ ٱلصَّـٰدِقِينَ عَن صِدْقِهِمْ } قال مجاهد المبلغين المؤدين عن الرسل. وقوله تعالى { عَن صِدْقِهِمْ } أي من أممهم { عَذَاباً أَلُيماً } أي موجعاً، فنحن نشهد أن الرسل قد بلغوا رسالات ربهم، ونصحوا الأمم، وأفصحوا لهم عن الحق الجلي الذي لا لبس فيه ولا شك ولا امتراء، وإِن كذبهم من كذبهم من الجهلة والمعاندين والمارقين والقاسطين، فما جاءت به الرسل هو الحق، ومن خالفهم فهو على الضلال كما يقول أهل الجنة { لَقَدْ جَآءَتْ رُسُلُ رَبِّنَا بِٱلْحَقِّ }.\n                                    ",
        "qortoby": "وَإِذۡ أَخَذۡنَا مِنَ ٱلنَّبِيِّ‍ۧنَ مِيثَٰقَهُمۡ وَمِنكَ وَمِن نُّوحٖ وَإِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبۡنِ مَرۡيَمَۖ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا ٧\n                                    \n                                    \n                                    قوله تعالى: { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ مِيثَاقَهُمْ } أي عهدهم على الوفاء بما حمّلوا، وأن يبشر بعضهم ببعض، ويصدّق بعضهم بعضاً؛ أي كان مسطوراً حين كتب الله ما هو كائن، وحين أخذ الله تعالى المواثيق من الأنبياء. { وَمِنْكَ } يا محمد { وَمِن نُّوحٍ وَإِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَى ٱبْنِ مَرْيَمَ } وإنما خصّ هؤلاء الخمسة وإن دخلوا في زمرة النبيّين تفضيلاً لهم. وقيل: لأنهم أصحاب الشرائع والكتب، وأولُو العزم من الرسل وأئمة الأمم. ويحتمل أن يكون هذا تعظيماً في قطع الولاية بين المسلمين والكافرين؛ أي هذا مما لم تختلف فيه الشرائع، أي شرائع الأنبياء عليهم الصلاة والسلام. أي كان في ابتداء الإسلام توارثٌ بالهجرة، والهجرة سبب متأكد في الدّيانة، ثم توارثوا بالقرابة مع الإيمان وهو سبب وكِيد؛ فأما التوارث بين مؤمن وكافر فلم يكن في دين أحد من الأنبياء الذين أخِذ عليهم المواثيق؛ فلا تُداهنوا في الدين ولا تمالئوا الكفار. ونظيره:\n{ شَرَعَ لَكُم مِّنَ ٱلدِّينِ مَا وَصَّىٰ بِهِ نُوحاً ـ إلى قوله ـ وَلاَ تَتَفَرَّقُواْ فِيهِ }\n[الشورى: 13]. ومِن ترك التفرق في الدين ترك موالاة الكفار. وقيل: أي النبي أوْلى بالمؤمنين من أنفسهم كان ذلك في الكتاب مسطوراً ومأخوذاً به المواثيق من الأنبياء. { وَأَخَذْنَا مِنْهُمْ مِّيثَاقاً غَلِيظاً } أي عهداً وثيقاً عظيماً على الوفاء بما التزموا من تبليغ الرسالة، وأن يصدق بعضهم بعضاً. والميثاق هو اليمين بالله تعالى؛ فالميثاق الثاني تأكيد للميثاق الأوّل باليمين. وقيل: الأوّل هو الإقرار بالله تعالى، والثاني في أمر النبوّة ونظير هذا قوله تعالى:\n{ وَإِذْ أَخَذَ ٱللَّهُ مِيثَاقَ ٱلنَّبِيِّيْنَ لَمَآ آتَيْتُكُم مِّن كِتَابٍ وَحِكْمَةٍ ثُمَّ جَآءَكُمْ رَسُولٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِ وَلَتَنصُرُنَّهُ قَالَ أَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذٰلِكُمْ إِصْرِي }\n[آل عمران: 81] الآية. أي أخذ عليهم أن يعلنوا أن محمداً رسول الله صلى الله عليه وسلم، ويعلن محمد صلى الله عليه وسلم أن لا نبيّ بعده. وقدّم محمداً في الذكر لما روى قتادة عن الحسن عن أبي هريرة: \" أن رسول الله صلى الله عليه وسلم سئل عن قوله تعالى: { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ مِيثَاقَهُمْ وَمِنْكَ وَمِن نُّوحٍ } قال: «كنت أوّلَهم في الخلق وآخرَهم في البعث» \" وقال مجاهد: هذا في ظهر آدم عليه الصلاة والسلام.\n                                    ",
        "saadi": "وَإِذۡ أَخَذۡنَا مِنَ ٱلنَّبِيِّ‍ۧنَ مِيثَٰقَهُمۡ وَمِنكَ وَمِن نُّوحٖ وَإِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبۡنِ مَرۡيَمَۖ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا ٧\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه أخذ من النبيين عموماً، ومن أولي العزم - وهم، هؤلاء الخمسة المذكورون - خصوصاً، ميثاقهم الغليظ وعهدهم الثقيل المؤكد، على القيام بدين اللّه والجهاد في سبيله، وأن هذا سبيل قد مشى الأنبياء المتقدمون، حتى ختموا بسيدهم وأفضلهم، محمد صلى اللّه عليه وسلم، وأمر الناس بالاقتداء بهم. وسيسأل اللّه الأنبياء وأتباعهم عن هذا العهد الغليظ، هل وفوا فيه، وصدقوا؟ فيثيبهم جنات النعيم؟ أم كفروا، فيعذبهم العذاب الأليم؟ قال تعالى:\n{ مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ }\n[الأحزاب: 23].\n                                    "
      },
      "originalText": "وَإِذۡ أَخَذۡنَا مِنَ ٱلنَّبِيِّ‍ۧنَ مِيثَٰقَهُمۡ وَمِنكَ وَمِن نُّوحٖ وَإِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبۡنِ مَرۡيَمَۖ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا ٧"
    },
    {
      "number": 3541,
      "text": "لِيَسْأَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ ۚ وَأَعَدَّ لِلْكَافِرِينَ عَذَابًا أَلِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 8,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 361,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لِّيَسۡ‍َٔلَ ٱلصَّٰدِقِينَ عَن صِدۡقِهِمۡۚ وَأَعَدَّ لِلۡكَٰفِرِينَ عَذَابًا أَلِيمٗا ٨\n                                    \n                                    \n                                    يقول الله تعالى مخبراً عن أولي العزم الخمسة وبقية الأنبياء أنه أخذ عليهم العهد والميثاق في إِقامة دين الله تعالى، وإِبلاغ رسالته، والتعاون والتناصر والاتفاق كما قال تعالى\n{ وَإِذْ أَخَذَ ٱللَّهُ مِيثَـٰقَ ٱلنَّبِيِّيْنَ لَمَآ ءَاتَيْتُكُم مِّن كِتَـٰبٍ وَحِكْمَةٍ ثُمَّ جَآءَكُمْ رَسُولٌ مُّصَدِّقٌ لِّمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِ وَلَتَنصُرُنَّهُ قَالَ ءَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذٰلِكُمْ إِصْرِى قَالُوۤاْ أَقْرَرْنَا قَالَ فَٱشْهَدُواْ وَأَنَاْ مَعَكُمْ مِّنَ ٱلشَّـٰهِدِينَ }\nآل عمران 81 فهذا العهد والميثاق أخذ عليهم بعد إِرسالهم، وكذلك هذا، ونص من بينهم على هؤلاء الخمسة، وهم أولو العزم، وهو من باب عطف الخاص على العام، وقد صرح بذكرهم أيضاً في هذه الآية، وفي قوله تعالى\n{ شَرَعَ لَكُم مِّنَ ٱلدِّينِ مَا وَصَّىٰ بِهِ نُوحاً وَٱلَّذِيۤ أَوْحَيْنَآ إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَىٰ أَنْ أَقِيمُواْ ٱلدِّينَ وَلاَ تَتَفَرَّقُواْ فِيهِ }\nالشورى 13 فذكر الطرفين، والوسط الفاتح، والخاتم، ومن بينهما على الترتيب، فهذه هي الوصية التي أخذ عليهم الميثاق بها كما قال تعالى { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ مِيثَاقَهُمْ وَمِنْكَ وَمِن نُّوحٍ وَإِبْرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبْنِ مَرْيَمَ } فبدأ في هذه الآية بالخاتم لشرفه صلوات الله عليه، ثم رتبهم بحسب وجودهم صلوات الله عليهم. قال ابن أبي حاتم حدثنا أبو زرعة الدمشقي، حدثنا محمد بن بكار، حدثنا سعيد بن بشير، حدثني قتادة عن الحسن عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم في قوله تعالى { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ مِيثَاقَهُمْ وَمِنْكَ وَمِن نُّوحٍ } الآية. قال النبي صلى الله عليه وسلم \" كنت أول النبيين في الخلق، وآخرهم في البعث، فبدأ بي قبلهم \" سعيد بن بشير فيه ضعف، وقد رواه سعيد بن أبي عروبة عن قتادة به مرسلاً، وهو أشبه، ورواه بعضهم عن قتاده موقوفاً، والله علم. وقال أبو بكر البزار حدثنا عمرو بن علي، حدثنا أبو أحمد، حدثنا حمزة الزيات، حدثنا عدي بن ثابت عن أبي حازم عن أبي هريرة رضي الله عنه قال خيار ولد آدم خمسة نوح وإِبراهيم وموسى وعيسى ومحمد صلوات الله وسلامه عليهم أجمعين، وخيرهم محمد صلى الله عليه وسلم موقوف وحمزة فيه ضعف، وقد قيل إِن المراد بهذا الميثاق الذي أخذ منهم حين أخرجوا في صورة الذر من صلب آدم عليه الصلاة والسلام، كما قال أبو جعفر الرازي عن الربيع بن أنس عن أبي العالية عن أبي بن كعب قال ورفع أباهم آدم، فنظر إِليهم، يعني ذريته، وأن فيهم الغني والفقير، وحسن الصورة ودون ذلك، فقال رب لو سويت بين عبادك، فقال إِني أحببت أن أشكر، ورأى فيهم الأنبياء مثل السرج عليهم النور، وخصوا بميثاق آخر من الرسالة والنبوة، وهو الذي يقول الله تعالى { وَإِذْ أَخَذْنَا مِنَ ٱلنَّبِيِّيْنَ مِيثَاقَهُمْ وَمِنْكَ وَمِن نُّوحٍ وَإِبْرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبْنِ مَرْيَمَ } وهذا قول مجاهد أيضاً، وقال ابن عباس الميثاق الغليظ العهد.\n                                   وقوله تعالى { لِّيَسْأَلَ ٱلصَّـٰدِقِينَ عَن صِدْقِهِمْ } قال مجاهد المبلغين المؤدين عن الرسل. وقوله تعالى { عَن صِدْقِهِمْ } أي من أممهم { عَذَاباً أَلُيماً } أي موجعاً، فنحن نشهد أن الرسل قد بلغوا رسالات ربهم، ونصحوا الأمم، وأفصحوا لهم عن الحق الجلي الذي لا لبس فيه ولا شك ولا امتراء، وإِن كذبهم من كذبهم من الجهلة والمعاندين والمارقين والقاسطين، فما جاءت به الرسل هو الحق، ومن خالفهم فهو على الضلال كما يقول أهل الجنة { لَقَدْ جَآءَتْ رُسُلُ رَبِّنَا بِٱلْحَقِّ }.\n                                    ",
        "qortoby": "لِّيَسۡ‍َٔلَ ٱلصَّٰدِقِينَ عَن صِدۡقِهِمۡۚ وَأَعَدَّ لِلۡكَٰفِرِينَ عَذَابًا أَلِيمٗا ٨\n                                    \n                                    \n                                    قوله تعالى: { لِّيَسْأَلَ ٱلصَّادِقِينَ عَن صِدْقِهِمْ } فيه أربعة أوجه:\n\nأحدها: ليسأل الأنبياء عن تبليغهم الرسالة إلى قومهم؛ حكاه النقاش. وفي هذا تنبيه؛ أي إذا كان الأنبياء يُسألون فكيف مَن سواهم.\n\nالثاني: ليسأل الأنبياء عما أجابهم به قومهم؛ حكاه عليّ بن عيسى.\n\nالثالث: ليسأل الأنبياء عليهم السلام عن الوفاء بالميثاق الذي أخذه عليهم؛ حكاه ابن شجرة.\n\nالرابع: ليسأل الأفواه الصادقة عن القلوب المخلصة، وفي التنزيل:\n{ فَلَنَسْأَلَنَّ ٱلَّذِينَ أُرْسِلَ إِلَيْهِمْ وَلَنَسْأَلَنَّ ٱلْمُرْسَلِينَ }\n[الأعراف: 6]. وقد تقدّم. وقيل: فائدة سؤالهم توبيخ الكفار؛ كما قال تعالى:\n{ أَأَنتَ قُلتَ لِلنَّاسِ }\n[المائدة: 116]. { وَأَعَدَّ لِلْكَافِرِينَ عَذَاباً أَلِيماً } وهو عذاب جهنم.\n                                    ",
        "saadi": "لِّيَسۡ‍َٔلَ ٱلصَّٰدِقِينَ عَن صِدۡقِهِمۡۚ وَأَعَدَّ لِلۡكَٰفِرِينَ عَذَابًا أَلِيمٗا ٨\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه أخذ من النبيين عموماً، ومن أولي العزم - وهم، هؤلاء الخمسة المذكورون - خصوصاً، ميثاقهم الغليظ وعهدهم الثقيل المؤكد، على القيام بدين اللّه والجهاد في سبيله، وأن هذا سبيل قد مشى الأنبياء المتقدمون، حتى ختموا بسيدهم وأفضلهم، محمد صلى اللّه عليه وسلم، وأمر الناس بالاقتداء بهم. وسيسأل اللّه الأنبياء وأتباعهم عن هذا العهد الغليظ، هل وفوا فيه، وصدقوا؟ فيثيبهم جنات النعيم؟ أم كفروا، فيعذبهم العذاب الأليم؟ قال تعالى:\n{ مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ }\n[الأحزاب: 23].\n                                    "
      },
      "originalText": "لِّيَسۡ‍َٔلَ ٱلصَّٰدِقِينَ عَن صِدۡقِهِمۡۚ وَأَعَدَّ لِلۡكَٰفِرِينَ عَذَابًا أَلِيمٗا ٨"
    },
    {
      "number": 3542,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ جَاءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا وَجُنُودًا لَمْ تَرَوْهَا ۚ وَكَانَ اللَّهُ بِمَا تَعْمَلُونَ بَصِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 9,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 362,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَآءَتۡكُمۡ جُنُودٞ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا وَجُنُودٗا لَّمۡ تَرَوۡهَاۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا ٩\n                                    \n                                    \n                                    يقول تعالى مخبراً عن نعمته وفضله وإِحسانه إِلى عباده المؤمنين في صرفه أعداءهم، وهزمه إِياهم عام تألبوا عليهم وتحزبوا، وذلك عام الخندق، وذلك في شوال سنة خمس من الهجرة على الصحيح المشهور. وقال موسى بن عقبة وغيره كان في سنة أربع. وكان سبب قدوم الأحزاب أن نفراً من أشراف يهود بن النضير الذين كانوا قد أجلاهم رسول الله صلى الله عليه وسلم من المدينة إِلى خيبر، منهم سلام بن أبي الحقيق، وسلام بن مشكم، وكنانة بن الربيع، خرجوا إِلى مكة، فاجتمعوا بأشراف قريش، وألبوهم على حرب النبي صلى الله عليه وسلم ووعدوهم من أنفسهم النصر والإعانة، فأجابوهم إِلى ذلك، ثم خرجوا إِلى غطفان، فدعوهم فاستجابوا لهم أيضاً، وخرجت قريش في أحابيشها ومن تابعها، وقائدها أبو سفيان صخر بن حرب، وعلى غطفان عيينة بن حصن بن بدر، والجميع قريب من عشرة آلاف، فلما سمع رسول الله صلى الله عليه وسلم بمسيرهم، أمر المسلمين بحفر الخندق حول المدينة ممايلي الشرق، وذلك بإِشارة سلمان الفارسي رضي الله عنه، فعمل المسلمون فيه واجتهدوا، ونقل معهم رسول الله صلى الله عليه وسلم التراب وحفر، وكان في حفره ذلك آيات بينات ودلائل واضحات. وجاء المشركون، فنزلوا شرقي المدينة قريباً من أحد، ونزلت طائفة منهم أعالي أرض المدينة، كما قال الله تعالى { إِذْ جَآءُوكُمْ مِّن فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنكُمْ } وخرج رسول الله صلى الله عليه وسلم ومن معه من المسلمين، وهم نحو ثلاثة آلاف، وقيل سبعمائة، فأسندوا ظهورهم إِلى سلع، ووجوههم إِلى نحو العدو، والخندق حفير ليس فيه ماء بينهم وبينهم، يحجب الخيالة والرجالة أن تصل إِليهم، وجعل النساء والذراري في آطام المدينة، وكانت بنو قريظة، وهم طائفة من اليهود لهم حصن شرقي المدينة، ولهم عهد من النبي صلى الله عليه وسلم وذمة، وهم قريب من ثمانمائة مقاتل، فذهب إِليهم حيي بن أخطب النضري، فلم يزل بهم حتى نقضوا العهد، ومالؤا الأحزاب على رسول الله صلى الله عليه وسلم فعظم الخطب، واشتد الأمر، وضاق الحال كما قال الله تبارك وتعالى { هُنَالِكَ ٱبْتُلِىَ ٱلْمُؤْمِنُونَ وَزُلْزِلُواْ زِلْزَالاً شَدِيداً } ومكثوا محاصرين للنبي صلى الله عليه وسلم وأصحابه قريباً من شهر، إِلا أنهم لا يصلون إِليهم، ولم يقع بينهم قتال، إِلا أن عمرو بن عبد ودّ العامري، وكان من الفرسان الشجعان المشهورين في الجاهلية، ركب ومعه فوارس، فاقتحموا الخندق، وخلصوا إِلى ناحية المسلمين، فندب رسول الله صلى الله عليه وسلم خيل المسلمين إِليه، فيقال إِنه لم يبرز أحد، فأمر علياً رضي الله عنه، فخرج إِليه، فتجاولا ساعة، ثم قتله علي رضي الله عنه، فكان علامة النصر.\n                                    ثم أرسل الله عز وجل على الأحزاب ريحاً شديدة الهبوب قوية، حتى لم يبق لهم خيمة ولا شيء، ولا توقد لهم نار، ولا يقر لهم قرار، حتى ارتحلوا خائبين خاسرين كما قال الله عز وجل { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ ٱذْكُرُواْ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ جَآءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحاً وَجُنُوداً } قال مجاهد وهي الصبا، ويؤيده الحديث الآخر \" نصرت بالصبا، وأهلكت عاد بالدبور \" وقال ابن جرير حدثني محمد بن المثنى، حدثنا عبد الأعلى، حدثنا داود عن عكرمة قال قالت الجنوب للشمال ليلة الأحزاب انطلقي ننصر رسول الله صلى الله عليه وسلم فقالت الشمال إِن الحرة لا تسري بالليل، قال فكانت الريح التي أرسلت عليهم الصبا. ورواه ابن أبي حاتم عن أبي سعيد الأشج، عن حفص بن غياث، عن داود عن عكرمة عن ابن عباس رضي الله عنهما، فذكره. وقال ابن جرير أيضاً حدثنا يونس حدثنا ابن وهب، حدثني عبيد الله بن عمر عن نافع عن عبد الله بن عمر رضي الله عنهما قال أرسلني خالي عثمان بن مظعون رضي الله عنه ليلة الخندق في برد شديد وريح إِلى المدينة، فقال أئتنا بطعام ولحاف، قال فاستأذنت رسول الله صلى الله عليه وسلم فأذن لي، وقال \" من أتيت من أصحابي، فمرهم يرجعوا \" قال فذهبت والريح تسفي كل شيء، فجعلت لاألقى أحداً إِلا أمرته بالرجوع إِلى النبي صلى الله عليه وسلم قال فما يلوي أحد منهم عنقه، قال وكان معي ترس لي، فكانت الريح تضربه علي، وكان فيه حديد، قال فضربته الريح حتى وقع بعض ذلك الحديد على كفي، فأبعدها إِلى الأرض. وقوله { وَجُنُوداً لَّمْ تَرَوْهَا } هم الملائكة، زلزلتهم وألقت في قلوبهم الرعب والخوف، فكان رئيس كل قبيلة يقول يا بني فلان إِلي، فيجتمعون إِليه، فيقول النجاء، النجاء لما ألقى الله عز وجل في قلوبهم من الرعب. وقال محمد بن إِسحاق عن يزيد بن زياد عن محمد بن كعب القرظي قال قال فتى من أهل الكوفة لحذيفة بن اليمان رضي الله عنه ياأبا عبد الله رأيتم رسول الله صلى الله عليه وسلم وصحبتموه؟ قال نعم يابن أخي قال وكيف كنتم تصنعون؟ قال والله لقد كنا نجهد، قال الفتى والله لو أدركناه ما تركناه يمشي على الأرض، ولحملناه على أعناقنا. قال قال حذيفة رضي الله عنه يابن أخي والله لو رأيتنا مع رسول الله صلى الله عليه وسلم بالخندق، وصلى رسول الله صلى الله عليه وسلم هوياً من الليل، ثم التفت فقال \" من رجل يقوم فينظر لنا ما فعل القوم؟ ــــ يشترط له النبي صلى الله عليه وسلم أن يرجع ــــ أدخله الله الجنة \"\n                                    قال فما قام رجل، ثم صلى رسول الله صلى الله عليه وسلم هوياً من الليل، ثم التفت إِلينا فقال مثله، فما قام منا رجل، ثم صلى رسول الله صلى الله عليه وسلم هوياً من الليل، ثم التفت إِلينا فقال \" من رجل يقوم فينظر لنا ما فعل القوم ثم يرجع؟ ــــ يشترط له رسول الله صلى الله عليه وسلم الرجعة ــــ أسأل الله تعالى أن يكون رفيقي في الجنة \" فما قام رجل من القوم من شدة الخوف وشدة الجوع وشدة البرد، فلما لم يقم أحد، دعاني رسول الله صلى الله عليه وسلم فلم يكن لي بد من القيام حين دعاني، فقال صلى الله عليه وسلم \" ياحذيفة اذهب فادخل في القوم، فانظر ما يفعلون، ولا تحدثنَّ شيئاً حتى تأتينا \". قال فذهبت فدخلت في القوم، والريح وجنود الله عز وجل تفعل بهم ما تفعل، لا تقر لهم قراراً ولا ناراً ولا بناء، فقام أبو سفيان فقال يا معشر قريش لينظر كل امرىء مَنْ جليسُه، قال حذيفة رضي الله عنه فأخذت بيد الرجل إِلى جنبي، فقلت من أنت؟ فقال أنا فلان بن فلان، ثم قال أبو سفيان يامعشر قريش إِنكم والله ما أصبحتم بدار مقام، لقد هلك الكراع والخف، وأخلفتنا بنو قريظة، وبلغنا عنهم الذي نكره، ولقينا من هذه الريح ما ترون، والله ما تطمئن لنا قدر، ولاتقوم لنا نار، ولا يستمسك لنا بناء، فارتحلوا فإِني مرتحل، ثم قام إِلى جمله وهو معقول، فجلس عليه، ثم ضربه فوثب به على ثلاث، فما أطلق عقاله إِلا وهو قائم، ولولا عهد رسول الله صلى الله عليه وسلم إِلي أن لاتحدث شيئاً حتى تأتيني لو شئت لقتلته بسهم. قال حذيفة رضي الله عنه فرجعت إِلى رسول الله صلى الله عليه وسلم وهو قائم يصلي في مرط لبعض نسائه مرحل، فلما رآني، أدخلني بين رجليه، وطرح علي طرف المرط، ثم ركع وسجد، وإِني لفيه، فلما سلم، أخبرته الخبر، وسمعت غطفان بما فعلت قريش، فانشمروا راجعين إِلى بلادهم. وقد رواه مسلم في صحيحه من حديث الأعمش عن إِبراهيم التيمي عن أبيه قال كنا عند حذيفة بن اليمان رضي الله عنه، فقال له رجال لو أدركت رسول الله صلى الله عليه وسلم قاتلت معه وأبليت، فقال له حذيفة أنت كنت تفعل ذلك؟ لقد رأيتنا مع رسول الله صلى الله عليه وسلم ليلة الأحزاب في ليلة ذات ريح شديدة وقر، فقال رسول الله صلى الله عليه وسلم \" ألا رجل يأتي بخبر القوم يكون معي يوم القيامة \" فلم يجبه منا أحد، ثم الثانية ثم الثالثة مثله، ثم قال صلى الله عليه وسلم\n                                    \" ياحذيفة قم فأتنا بخبر من القوم \" فلم أجد بداً إِذ دعاني باسمي أن أقوم، فقال \" ائتني بخبر القوم، ولاتذعرهم علي \" قال فمضيت كأنما أمشي في حمام حتى أتيتهم، فإِذا أبو سفيان يَصْلي ظهره بالنار، فوضعت سهماً في كبد قوسي، وأردت أن أرميه، ثم ذكرت قول رسول الله صلى الله عليه وسلم لا تذعرهم عليَّ، ولو رميته لأصبته، قال فرجعت كأنما أمشي في حمام، فأتيت رسول الله صلى الله عليه وسلم ثم أصابني البرد حين فرغت وقررت، فأخبرت رسول الله صلى الله عليه وسلم وألبسني من فضل عباءة كانت عليه يصلي فيها، فلم أزل نائماً حتى الصبح، فلما أصبحت قال رسول الله صلى الله عليه وسلم \" قم يانَوْمان \". ورواه يونس بن بكير عن هشام بن سعد، عن زيد بن أسلم قال إِن رجلاً قال لحذيفة رضي الله عنه نشكو إِلى الله صحبتكم لرسول الله صلى الله عليه وسلم إِنكم أدركتموه ولم ندركه، ورأيتموه ولم نره، فقال حذيفة رضي الله عنه ونحن نشكو إِلى الله إِيمانكم به ولم تروه، والله لا تدري يابن أخي لو أدركته كيف كنت تكون؟ لقد رأيتنا مع رسول الله صلى الله عليه وسلم ليلة الخندق في ليلة باردة مطيرة، ثم ذكر نحو ما تقدم مطولاً. وروى بلال بن يحيى العبسي عن حذيفة رضي الله عنه نحو ذلك أيضاً، وقد أخرج الحاكم والبيهقي في \" الدلائل \" من حديث عكرمة بن عمار عن محمد بن عبد الله الدؤلي عن عبد العزيز بن أخي حذيفة قال ذكر حذيفة رضي الله عنه مشاهدهم مع رسول الله صلى الله عليه وسلم فقال جلساؤه أما والله لو شاهدنا ذلك، كنا فعلنا وفعلنا، فقال حذيفة لا تمنوا ذلك، لقد رأيتنا ليلة الأحزاب ونحن صافون قعوداً، وأبو سفيان ومن معه من الأحزاب فوقنا، وقريظة لليهود أسفل منا نخافهم على ذرارينا، وما أتت علينا قط أشد ظلمة ولا أشد ريحاً، في أصوات ريحها أمثال الصواعق، وهي ظلمة ما يرى أحدنا أصبعه، فجعل المنافقون يستأذنون النبي صلى الله عليه وسلم ويقولون إِن بيوتنا عورة، وما هي بعورة، فما يستأذنه أحد منهم إِلا أذن له، ويأذن لهم فيتسللون، ونحن ثلثمائة أو نحو ذلك، إِذ استقبلنا رسول الله رجلاً رجلاً، حتى أتى علي، وما علي جنة من العدو ولا من البرد إِلا مرط لامرأتي ما يجاوز ركبتي، قال فأتاني صلى الله عليه وسلم وأنا جاث على ركبتي، فقال \" من هذا؟ \" فقلت حذيفة. قال \" حذيفة؟ \" قتقاصرت الأرض، فقلت بلى يارسول الله كراهية أن أقوم، فقمت فقال \" إِنه كائن في القوم خبر، فأتني بخبر القوم \"\n                                    قال وأنا من أشد الناس فزعاً وأشدهم قُرّاً. قال فخرجت، فقال رسول الله صلى الله عليه وسلم \" اللهم احفظه من بين يديه ومن خلفه، وعن يمينه وعن شماله، ومن فوقه ومن تحته \" قال فوالله ما خلق الله تعالى فزعاً ولا قرّاً في جوفي إِلا خرج من جوفي، فما أجد فيه شيئاً، قال فلما وليت، قال صلى الله عليه وسلم \" يا حذيفة لا تحدثن في القوم شيئاً حتى تأتيني \" قال فخرجت حتى إِذا دنوت من عسكر القوم، نظرت في ضوء نار لهم توقد، فإِذا رجل أدهم ضخم يقول بيده على النار، ويمسح خاصرته، ويقول الرحيل الرحيل، ولم أكن أعرف أبا سفيان قبل ذلك، فانتزعت سهماً من كنانتي أبيض الريش، فأضعه في كبد قوسي لأرميه به في ضوء النار، فذكرت قول رسول الله صلى الله عليه وسلم \" لا تحدثن فيهم شيئاً حتى تأتيني \" قال فأمسكت، ورددت سهمي إِلى كنانتي، ثم إِني شجعت نفسي حتى دخلت العسكر، فإِذا أدنى الناس مني بنو عامر يقولون يا آل عامر الرحيل الرحيل، لا مقام لكم. وإِذا الريح في عسكرهم ما تجاوز عسكرهم شبراً، فوالله إِني لأسمع صوت الحجارة في رحالهم وفَرَسَتْهم، الريح تضربهم بها، ثم خرجت نحو النبي صلى الله عليه وسلم فلما انتصفت في الطريق، أو نحواً من ذلك، إِذ أنا بنحو من عشرين فارساً أو نحو ذلك معتمين، فقالوا أخبر صاحبك أن الله تعالى كفاه القوم، فرجعت إِلى رسول الله صلى الله عليه وسلم وهو مشتمل في شملة يصلي، فوالله ما عدا أن رجعت راجعني القر، وجعلت أقرقف، فأومأ إِلي رسول الله صلى الله عليه وسلم بيده وهو يصلي، فدنوت منه، فأسبل عليّ شملة، وكان رسول الله صلى الله عليه وسلم إِذا حزبه أمر، صلى، فأخبرته خبر القوم، وأخبرته أني تركتهم يرتحلون، وأنزل الله تعالى { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ ٱذْكُرُواْ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ جَآءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحاً وَجُنُوداً لَّمْ تَرَوْهَا وَكَانَ ٱللَّهُ تَعْمَلُونَ بَصِيراً } وأخرج أبو داود في سننه منه وكان رسول الله صلى الله عليه وسلم إِذا حزبه أمر صلى، من حديث عكرمة بن عمار به. وقوله تعالى { إِذْ جَآءُوكُمْ مِّن فَوْقِكُمْ } أي الأحزاب، { وَمِنْ أَسْفَلَ مِنكُمْ } تقدم عن حذيفة رضي الله عنه أنهم بنو قريظة، { وَإِذْ زَاغَتِ ٱلأَبْصَـٰرُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ } أي شدة الخوف والفزع، { ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } قال ابن جرير ظن بعض من كان مع رسول الله صلى الله عليه وسلم أن الدائرة على المؤمنين، وأن الله سيفعل ذلك. وقال محمد بن إِسحاق في قوله تعالى { وَإِذْ زَاغَتِ ٱلأَبْصَـٰرُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } ظن المؤمنون كل ظن، ونجم النفاق، حتى قال معتب بن قشير أخو بني عمرو بن عوف كان محمد يعدنا أن نأكل كنوز كسرى وقيصر، وأحدنا لا يقدر على أن يذهب إِلى الغائط.\n                                    وقال الحسن في قوله عز وجل { وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } ظنون مختلفة، ظن المنافقون أن محمداً صلى الله عليه وسلم وأصحابه يستأصلون، وأيقن المؤمنون أن ما وعد الله ورسوله حق، وأنه سيظهره على الدين كله ولو كره المشركون. وقال ابن أبي حاتم حدثنا أحمد بن عاصم الأنصاري، حدثنا أبو عامر، ح وحدثنا أبي، حدثنا أبو عامرالعقدي، حدثنا الزبير، يعني ابن عبد الله مولى عثمان رضي الله عنه، عن رُتيج بن عبد الرحمن بن أبي سعيد عن أبيه عن أبي سعيد رضي الله عنه قال قلنا يوم الخندق يارسول الله هل من شيء نقول، فقد بلغت القلوب الحناجر؟ قال صلى الله عليه وسلم \" نعم، قولوا اللهم استر عوراتنا وآمن روعاتنا \" قال فضرب وجوه أعدائه بالريح، فهزمهم بالريح. وكذا رواه الإمام أحمد بن حنبل عن أبي عامر العقدي.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَآءَتۡكُمۡ جُنُودٞ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا وَجُنُودٗا لَّمۡ تَرَوۡهَاۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا ٩\n                                    \n                                    \n                                    يعني غزوة الخَنْدق والأحزاب وبني قُرَيظة، وكانت حالاً شديدة معقبة بنعمة ورخاء وغبطة، وتضمّنت أحكاماً كثيرة وآيات باهرات عزيزة، ونحن نذكر من ذلك بعون الله تعالى ما يكفي في عشر مسائل:\n\nالأولى: اختلف في أيّ سنة كانت؛ فقال ابن إسحاق: كانت في شوال من السنة الخامسة. وقال ابن وهب وابن القاسم عن مالك رحمه الله: كانت وقعة الخندق سنة أربع، وهي وبنو قُريظة في يوم واحد، وبين بني قريظة والنَّضير أربع سنين. قال ابن وهب وسمعت مالكاً يقول: أمر رسول الله صلى الله عليه وسلم بالقتال من المدينة، وذلك قوله تعالى: { إِذْ جَآءُوكُمْ مِّن فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنكُمْ وَإِذْ زَاغَتِ ٱلأَبْصَارُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ }. قال: ذلك يوم الخندق، جاءت قريش من هاهنا واليهود من هاهنا والنَّجدية من هاهنا. يريد مالك: إن الذين جاؤوا من فوقهم بنو قريظة، ومن أسفل منهم قريش وغَطَفان. وكان سببها: أن نفراً من اليهود منهم كنانة بن الربيع بن أبي الحُقَيق وسلام بن أبي الحُقَيق وسلام بن مِشْكم وحُيَيّ بن أخْطب النضرِيّون وهَوْذة بن قيس وأبو عمار من بني وائل، وهم كلهم يهود، هم الذين حزّبوا الأحزاب وألبّوا وجمعوا، خرجوا في نفر من بني النَّضير ونَفَر من بني وائل فأتوا مكة فدعوا إلى حرب رسول الله صلى الله عليه وسلم، وواعدوهم من أنفسهم بعون من انتدب إلى ذلك؛ فأجابهم أهل مكة إلى ذلك، ثم خرج اليهود المذكورون إلى غَطَفَان فدعوهم إلى مثل ذلك فأجابوهم؛ فخرجت قريش يقودهم أبو سفيان بن حرب، وخرجت غَطَفان وقائدهم عُيينة بن حصن بن حُذيفة بن بدر الفَزَاريّ على فَزارة، والحارث ابن عوف المُرِّي على بني مُرّة، ومسعود بن رُخَيلة على أشجع. فلما سمع رسول الله صلى الله عليه وسلم باجتماعهم وخروجهم شاور أصحابه، فأشار عليه سلمان بحفر الخندق فرضي رأيه. وقال المهاجرون يومئذٍ: سلمان منا. وقال الأنصار: سلمان منا! فقال رسول الله صلى الله عليه وسلم: \" سلمان منّا أهل البيت \" وكان الخندق أوّلَ مشهد شهده سلمان مع رسول الله صلى الله عليه وسلم وهو يومئذٍ حر. فقال: يا رسول الله، إنا كنا بفارس إذا حوصرنا خندقنا؛ فعمل المسلمون في الخندق مجتهدين، ونكص المنافقون وجعلوا يتسلّلْون لِواذاً فنزلت فيهم آيات من القرآن ذكرها ابن إسحاق وغيره. وكان مَن فرغ من المسلمين من حصّته عاد إلى غيره، حتى كمل الخندق. وكانت فيه آيات بيّنات وعلامات للنبوّات.\n\nقلت: ففي هذا الذي ذكرناه من هذا الخبر من الفقه وهي:\n\nالثانية: مشاورة السلطان أصحابَه وخاصّته في أمر القتال؛ وقد مضى ذلك في «آل عمران، والنمل».\n                                   وفيه التحصّن من العدوّ بما أمكن من الأسباب واستعمالها؛ وقد مضى ذلك في غير موضع. وفيه أن حفر الخندق يكون مقسوماً على الناس؛ فمن فرغ منهم عاون من لم يفرغ، فالمسلمون يدٌ على مَن سواهم؛ وفي البخاري ومسلم عن البَرَاء بن عازِب قال: لما كان يوم الأحزاب وخندق رسول الله صلى الله عليه وسلم رأيته ينقل من تراب الخندق حتى وارى عنّي الغبارُ جِلدة بطنه، وكان كثير الشعر، فسمعته يرتجِز بكلمات ابن رَواحة ويقول :\nاللَّهُمَّ لولا أنت ما اهتدينا\t   \tولا تصدّقنا ولا صَلّينا\nفأنزِلنْ سكِينةً عَلَيْنَا\t   \tوثَبّت الأقدام إن لاَقَيْنَا\nوأما ما كان فيه من الآيات وهي:\n\nالثالثة: فروى النسائي عن أبي سكينة رجلٍ من المحرَّرين عن رجل من أصحاب رسول الله صلى الله عليه وسلم قال: \" لما أمر رسول الله صلى الله عليه وسلم بحفر الخندق عرضت لهم صخرة حالت بينهم وبين الحفر، فقام رسول الله صلى الله عليه وسلم وأخذ المعْول ووضع ردائه ناحية الخندق وقال: { وَتَمَّتْ كَلِمَةُ رَبِّكَ صِدْقاً } [الأنعام: 115] الآية؛ فَنَدَرَ ثلث الحجر وسلمان الفارسي قائم ينظر، فَبَرَق مع ضربة رسول الله صلى الله عليه وسلم بَرْقَةٌ، ثم ضرب الثانية وقال: «وَتَمَّتْ» الآية؛ فَنَدَرَ الثلث الآخر؛ فبرقت برقة فرآها سلمان، ثم ضرب الثالثة وقال: { وَتَمَّتْ كَلِمَةُ رَبِّكَ صِدْقاً } [الأنعام: 115] الآية؛ فندر الثلث الباقي، وخرج رسول الله صلى الله عليه وسلم فأخذ رداءه وجلس. قال سلمان: يا رسول الله، رأيتك حين ضربت! ما تضرب ضربة إلا كانت معها برقة؟ قال له رسول الله صلى الله عليه وسلم: «رأيت ذلك يا سلمان؟» فقال: أيْ والذي بعثك بالحق يا رسول الله! قال: «فإني حين ضربت الضربة الأولى رُفعت لي مدائن كِسرى وما حولها ومدائن كثيرة حتى رأيتها بعينيّ» ـ قال له من حضره من أصحابه؛ يا رسول الله، ادع الله أن يفتحها علينا ويغنِّمَنا ذراريهم ويخرّب بأيدينا بلادهم؛ فدعا رسول الله صلى الله عليه وسلم ـ «ثم ضربتُ الضربة الثانية فرُفعت لي مدائن قَيْصر وما حولها حتى رأيتها بعينيّ» ـ قالوا: يا رسول الله، ادع الله تعالى أن يفتحها علينا ويغنمنا ذراريهم ويخرب بأيدينا بلادهم؛ فدعا رسول الله صلى الله عليه وسلم ـ «ثم ضربتُ الضربة الثالثة فرُفعت لي مدائن الحبشة وما حولها من القرى حتى رأيتها بعينيّ» ـ قال رسول الله صلى الله عليه وسلم عند ذلك: دعوا الحبشة ما وَدَعوكم واتركوا الترك ما تركوكم \" وخرجه أيضاً عن البَرَاء قال: \" لما أمرنا رسول الله صلى الله عليه وسلم أن نحفِر الخندق عرض لنا صخرة لا تأخذ فيها المعاول، فاشتكينا ذلك لرسول الله صلى الله عليه وسلم؛ فجاء رسول الله صلى الله عليه وسلم فألقى ثوبه وأخذ المِعْول وقال: «باسم الله» فضرب ضربة فكسر ثلث الصخرة ثم قال: «الله أكبر أُعْطيت مفاتيح الشام واللَّهِ إني لأبصر إلى قصورها الحمراء الآن من مكاني هذا» قال: ثم ضرب أخرى وقال: «باسم الله» فكسر ثلثاً آخر ثم قال: «الله أكبر أُعطِيت مفاتيح فارس والله إني لأبصر قصر المدائن الأبيض». ثم ضرب الثالثة وقال: «باسم الله» فقطع الحجر وقال: «الله أكبر أُعطيت مفاتيح اليمن والله إني لأبصر باب صنعاء» \"\n                                   صححه أبو محمد عبد الحق.\n\nالرابعة: فلما فرغ رسول الله صلى الله عليه وسلم من حفر الخندق أقبلت قريش في نحو عشرة آلاف بمن معهم من كنانة وأهلِ تِهامة، وأقبلت غَطفان بمن معها من أهل نجد حتى نزلوا إلى جانب أُحُد، وخرج رسول الله صلى الله عليه وسلم والمسلمون حتى نزلوا بظهر سَلْع في ثلاثة آلاف وضربوا عسكرهم والخندق بينهم وبين المشركين، واستعمل على المدينة ابنَ أُمّ مَكْتوم ـ في قول ابن شهاب ـ وخرج عدوّ الله حُيَيّ بن أخطْب النضري حتى أتى كعب بن أسد القُرَظِيّ، وكان صاحبَ عقد بني قريظة ورئيسَهم، وكان قد وادع رسول الله صلى الله عليه وسلم وعاقده وعاهده؛ فلما سمع كعب بن أسد حُيَيّ بن أخطب أغلق دونه باب حصنه وأبى أن يفتح له؛ فقال له: افتح لي يا أخي؛ فقال له: لا أفتح لك، فإنك رجل مشؤوم، تدعوني إلى خلاف محمد وأنا قد عاقدته وعاهدته، ولم أر منه إلا وفاءً وصدقاً، فلست بناقض ما بيني وبينه. فقال حُيَيّ: افتح لي حتى أكلمك وأنصرف عنك؛ فقال: لا أفعل؛ فقال: إنما تخاف أن آكل معك جشيشتك؛ فغضب كعب وفتح له؛ فقال: يا كعب! إنما جئتك بعزّ الدهر، جئتك بقريش وسادتها، وغَطَفان وقادتها؛ قد تعاقدوا على أن يستأصلوا محمداً ومن معه؛ فقال له كعب: جئتني والله بذل الدهر وبجهام لا غيث فيه! ويحك يا حُيَيّ؟ دَعْنِي فلستُ بفاعل ما تدعوني إليه؛ فلم يزل حُيَيّ بكَعْب يَعِده ويَغُرّه حتى رجع إليه وعاقده على خِذلان محمد صلى الله عليه وسلم وأصحابه وأن يسير معهم، وقال له حُيَيّ بن أخطب: إن انصرفت قريش وغَطفان دخلت عندك بمن معي من اليهود. فلما انتهى خبر كعب وحُيَيّ إلى النبي صلى الله عليه وسلم بعث سعد بن عُبادة وهو سيد الخزرج، وسيّد الأوْسِ سعد بن معاذ، وبعث معهما عبد الله بن رَواحة وخَوّات بن جُبير، وقال لهم رسول الله صلى الله عليه وسلم: \" انطلقوا إلى بني قُرَيظة فإن كان ما قيل لنا حقاً فالحْنوا لنا لَحْناً ولا تَفُتُّوا في أعضاد الناس. وإن كان كذباً فاجهروا به للناس \" فانطلقوا حتى أتوهم فوجدوهم على أخبث ما قيل لهم عنهم، ونالوا من رسول الله صلى الله عليه وسلم وقالوا: لا عهد له عندنا، فشاتمهم سعد بن معاذ وشاتموه؛ وكانت فيه حدّة فقال له سعد بن عُبادة: دع عنك مشاتمتهم، فالذي بيننا وبينهم أكثر من ذلك، ثم أقبل سعد وسعد حتى أتيا رسول الله صلى الله عليه وسلم في جماعة المسلمين فقالا: عَضَل والقَارَة ـ يعرّضان بغدر عَضَل والقارة بأصحاب الرَّجيعِ حُبيب وأصحابه ـ فقال النبيّ صلى الله عليه وسلم:\n                                   \" أبشروا يا معشر المسلمين \" وعظم عند ذلك البلاء واشتدّ الخوف، وأتى المسلمين عدوُّهم من فوقهم؛ يعني من فوق الوادي من قبل المشرق، ومن أسفل منهم من بطن الوادي من قبل المغرب، حتى ظنوا بالله الظنونا؛ وأظهر المنافقون كثيراً مما كانوا يسرّون، فمنهم من قال: إن بيوتنا عورة، فلننصرف إليها، فإنا نخاف عليها؛ وممن قال ذلك: أوْس بن قيظي. ومنهم من قال: يَعِدنا محمد أن يفتح كنوز كسرى وقَيصر، وأحدنا اليوم لا يأمن على نفسه يذهب إلى الغائط! وممن قال ذلك: مُعَتّب بن قُشير أحد بني عمرو ابن عوف. فأقام رسول الله صلى الله عليه وسلم وأقام المشركون بضعاً وعشرين ليلة قريباً من شهر لم يكن بينهم حَرْب إلا الرمي بالنَّبْل والحصى. فلما رأى رسول الله صلى الله عليه وسلم أنه اشتدّ على المسلمين البلاء بعث إلى عُيَيْنة بن حِصن الفَزَاري، وإلى الحارث بن عوف المرِّي، وهما قائدا غَطَفان، فأعطاهما ثلث ثمار المدينة لينصرفا بمن معهما من غَطفان ويخذلا قريشاً ويرجعا بقومهما عنهم. وكانت هذه المقالة مراوضة ولم تك\n                                   ن عقداً؛ فلما رأى رسول الله صلى الله عليه وسلم منهما أنهما قد أنابا ورضِيا أتى سعد بن معاذ وسعد بن عبادة فذكر ذلك لهما واستشارهما فقالا: يا رسول الله، هذا أمر تحبّه فنصنعه لك، أو شيء أمرك الله به فنسمع له ونطيع، أو أمر تصنعه لنا؟ قال: \" بل أمر أصنعه لكم، واللَّهِ ما أصنعه إلا أنّي قد رأيت العرب قد رمتكم عن قَوْس واحدة \" فقال له سعد بن معاذ: يا رسول الله، واللَّهِ لقد كنا نحن وهؤلاء القوم على الشرك بالله وعبادة الأوثان، لا نعبد الله ولا نعرفه، وما طمِعوا قَطّ أن ينالوا منا ثمرة إلا شِراء أو قِرًى، فحين أكرمنا الله بالإسلام وهدانا له وأعزّنا بك نعطيهم أموالنا! والله لا نعطيهم إلا السيف حتى يحكم الله بيننا وبينهم!! فسُرّ رسول الله صلى الله عليه وسلم بذلك وقال: \" أنتم وذاك \" وقال لعيينة والحارث: \" انصرفا فليس لكما عندنا إلا السيف \" وتناول سعد الصحيفة وليس فيها شهادة فمحاها.\n\nالخامسة: فأقام رسول الله صلى الله عليه وسلم والمسلمون على حالهم، والمشركون يحاصرونهم ولا قتال بينهم؛ إلا أن فوارس من قريش منهم عمرو بن عبد وُدّ العامريّ من بني عامر بن لُوَيّ، وعِكرمة بن أبي جهل، وهُبَيرة بن أبي وهب، وضِرار بن الخطاب الفهريّ، وكانوا فرسان قريش وشجعانهم، أقبلوا حتى وقفوا على الخندق، فلما رأوه قالوا: إن هذه لمكيدة، ما كانت العرب تكيدها.\n                                  ثم تيمموا مكاناً ضيقاً من الخندق، فضربوا خيلهم فاقتحمت بهم، وجاوزوا الخندق وصاروا بين الخندق وبين سَلْع، وخرج علي بن أبي طالب في نفر من المسلمين حتى أخذوا عليهم الثُّغرة التي اقتحموا منها، وأقبلت الفرسان نحوهم، وكان عمرو بن عبد ودّ قد أثبتته الجراح يوم بَدْر فلم يشهد أُحُداً، وأراد يوم الخندق أن يُري مكانُه فلما وقف هو وخيله؛ نادى: من يبارز؟ فبرز له عليّ بن أبي طالب وقال له: يا عمرو، إنك عاهدت الله فيما بلغنا أنك لا تُدْعَى إلى إحدى خَلّتين إلا أخذت إحداهما؟ قال: نعم. قال: فإني أدعوك إلى الله والإسلام. قال: لا حاجة لي بذلك. قال: فأدعوك إلى البراز. قال: يا ابن أخي، والله ما أحبّ أن أقتلك لما كان بيني وبين أبيك. فقال له عليّ: وأنا والله أحبّ أن أقتلك. فحَمِى عمرو بن عبد وُدّ ونزل عن فرسه، فعقره وصار نحو عليّ، فتنازلا وتجاولا وثار النقع بينهما حتى حال دونهما، فما انجلى النَّقْع حتى رُئِيَ عليّ على صدر عمرو يقطع رأسه، فلما رأى أصحابُه أنه قد قتله عليّ اقتحموا بخيلهم الثُّغْرة منهزمين هاربين. وقال عليّ رضي الله عنه في ذلك:\nنصر الحجارةَ من سفاهة رأيهِ\t   \tونصرتُ دِينَ محمد بِضراب\nنازلته فتركته متجدِّلا\t   \tكالجِذْع بين دَكادكٍ ورَوَابي\nوعففتُ عن أثوابه ولو أنني\t   \tكنت المقطَّرَ بَزَّنِي أثوابي\nلا تحسِبُنّ الله خاذلَ دينه\t   \tونبيِّه يا معشر الأحزاب\nقال ابن هشام: أكثر أهل العلم بالسير يشك فيها لعليّ. قال ابن هشام: وألقى عِكرمة بن أبي جهل رمحه يومئذٍ وهو منهزم عن عمرو؛ فقال حسان بن ثابت في ذلك :\nفرّ وألقَى لنا رُمْحَه\t   \tلعلّك عِكرِمَ لم تَفْعلِ\nوولّيت تَعْدُو كعَدْوِ الظَّلِـ\t   \tـيم ما إن تجور عن المَعْدِلِ\nولم تُلق ظهرك مستأنساً\t   \tكأن قَفاك قَفَا فُرْعُل\nقال ابن هشام: فرعل صغير الضباع. وكانت عائشة رضي الله عنها في حصن بني حارثة، وأُمُّ سعد بن معاذ معها، وعلى سعد درع مُقَلِّصة قد خرجت منها ذراعه، وفي يده حربته وهو يقول :\nلَبِّثْ قليلاً يلحق الهَيْجَا جَمَلْ\t   \tلا بأس بالموت إذا كان الأجَلْ\nورُمي يومئذٍ سعد بن معاذ بسهم فقطع منه الأكحل. واختلف فيمن رماه؛ فقيل: رماه حِبّان بن قيس ابن العَرِقة، أحد بني عامر بن لؤيّ، فلما أصابه قال له: خذها وأنا ابن العَرِقة. فقال له سعد؛ عرّق الله وجهك في النار. وقيل: إن الذي رماه خفاجة بن عاصم بن حبان. وقيل: بل الذي رماه أبو أسامة الجُشَمِيّ، حليف بني مخزوم.\n                                  ولحسان مع صفية بنت عبد المطلب خبر طريف يومئذٍ؛ ذكره ابن إسحاق وغيره.\n\nقالت صفية بنت عبد المطلب رضي الله عنها: كنا يوم الأحزاب في حِصن حسان بن ثابت، وحسان معنا في النساء والصبيان، والنبيّ صلى الله عليه وسلم وأصحابه في نحر العدوّ لا يستطيعون الانصراف إلينا، فإذا يهوديّ يدور، فقلت لحسان: انزل إليه فاقتله؛ فقال: ما أنا بصاحب هذا يا ابنة عبد المطلب! فأخذت عموداً ونزلت من الحصن فقتلته، فقلت: يا حسان، انزل فاسلبه، فلم يمنعني من سَلَبه إلا أنه رجل. فقال: مالي بسلبه حاجة يا ابنة عبد المطلب! قال: فنزلت فسلبته. قال أبو عمر بن عبد البر: وقد أنكر هذا عن حسان جماعة من أهل السِّيَر وقالوا: لو كان في حسان من الجبن ما وصفتم لهجاه بذلك الذين كان يهاجيهم في الجاهلية والإسلام، ولَهُجِيَ بذلك ابنه عبد الرحمن؛ فإنه كان كثيراً ما يهاجي الناس من شعراء العرب؛ مثل النجاشي وغيره.\n\nالسادسة: \" وأتى رسول الله صلى الله عليه وسلم نعيم بن مسعود بن عامر الأشجعيّ فقال: يا رسول الله، إني قد أسلمت ولم يعلم قومي بإسلامي، فمُرْني بما شئت؛ فقال له رسول الله صلى الله عليه وسلم: «إنما أنت رجل واحد من غَطَفان فلو خرجتَ فخذّلت عنّا إن استطعت كان أحبّ إلينا من بقائك معنا فاخرج فإن الحرب خدعة» \" فخرج نعيم بن مسعود حتى أتى بني قُريظة ـ وكان ينادمهم في الجاهلية ـ فقال: يا بني قريظة، قد عرفتم وِدّي إياكم، وخاصّة ما بيني وبينكم؛ قالوا: قل فلستَ عندنا بمتَّهَم؛ فقال لهم: إن قريشاً وغَطَفان ليسوا كأنتم، البلد بلدكم، فيه أموالكم وأبناؤكم ونساؤكم، وإن قريشاً وغَطَفان قد جاؤوا لحرب محمد وأصحابه، وقد ظاهرتموهم عليه فإن رأوا نُهْزة أصابوها، وإن كان غير ذلك لحِقوا ببلادهم وخلّوْا بينكم وبين الرجل، ولا طاقة لكم به، فلا تقاتلوا مع القوم حتى تأخذوا منهم رهناً. ثم خرج حتى أتى قريشاً فقال لهم: قد عرفتم وِدّي لكم معشرَ قريش، وفراقي محمداً، وقد بلغني أمرٌ أرى من الحق أن أبلِّغكموه نصحاً لكم، فاكتموا عليّ؛ قالوا نفعل؛ قال: تعلمون أن معشر يهودَ، قد نَدِموا على ما كان من خذلانهم محمداً، وقد أرسلوا إليه: إنا قد نَدِمنا على ما فعلنا، فهل يرضيك أن نأخذ من قريش وغَطَفان رجالاً من أشرافهم فنعطيكهم فتضرب أعناقهم، ثم نكون معك على ما بقي منهم حتى نستأصلهم. ثم أتى غَطَفان فقال مثل ذلك. فلما كان ليلة السبت وكان ذلك من صنع الله عز وجل لرسوله والمؤمنين، أرسل أبو سفيان إلى بني قُرَيظة عِكرمة بن أبي جهل في نفر من قريش وغطفان يقول لهم: إنا لسنا بدار مُقام، قد هلك الخُفّ والحافر، فاغدوا صبيحة غدٍ للقتال حتى نناجز محمداً؛ فأرسلوا إليهم: إن اليوم يوم السبت، وقد علمتم ما نال منّا مَن تعدّى في السبت، ومع ذلك فلا نقاتل معكم حتى تعطونا رُهُناً؛ فلما رجع الرسول بذلك قالوا: صَدَقنا واللَّهِ نعيم بن مسعود؛ فردّوا إليهم الرسل وقالوا: والله لا نعطيكم رهناً أبداً فاخرجوا معنا إن شئتم وإلا فلا عهد بيننا وبينكم.\n\n                                  فقال بنو قريظة: صدق واللَّهِ نعيم بن مسعود. وخذل الله بينهم، واختلفت كلمتهم، وبعث الله عليهم رِيحاً عاصفاً في ليالٍ شديدة البرد؛ فجعلت الريح تقلب آنيتهم وتكفَأ قدورهم.\n\nالسابعة: فلما اتصل برسول الله صلى الله عليه وسلم اختلاف أمرهم، بعث حذيفة بن اليمان ليأتيه بخبرهم، فأتاهم واستتر في غمارهم، وسمع أبا سفيان يقول: يا معشر قريش ليتعرّف كل امرىء جليسه. قال حذيفة: فأخذت بيد جليسي وقلت: ومن أنت؟ فقال: أنا فلان. ثم قال أبو سفيان: ويلكم يا معشر قريش! إنكم والله ما أصبحتم بدار مقام، ولقد هلك الكراع والخُفّ وأخلفتنا بنو قُريظة، ولقينا من هذه الريح ما ترون، ما يستمسك لنا بناء، ولا تثبت لنا قدر، ولا تقوم لنا نار، فارتحلوا فإني مرتحل؛ ووثب على جمله فما حلّ عقال يده إلا وهو قائم. قال حذيفة: ولولا عهد رسول الله صلى الله عليه وسلم لي إذ بعثني، قال لي: \" مُرّ إلى القوم فاعلم ما هم عليه ولا تحدِث شيئاً \" ـ لقتلته بسهم؛ ثم أتيت رسول الله صلى الله عليه وسلم عند رحيلهم، فوجدته قائماً يصلّي في مِرْطٍ لبعض نسائه مراجل ـ قال ابن هشام: المراجل ضرب من وَشْي اليمن ـ فأخبرته فحمِد الله.\n\nقلت: وخبر حذيفة هذا مذكور في صحيح مسلم، وفيه آيات عظيمة، رواه جرير عن الأعمش \" عن إبراهيم التيمِيّ عن أبيه قال: كنا عند حذيفة فقال رجل لو أدركتُ رسول الله صلى الله عليه وسلم قاتَلْت معه وأبلَيْت. فقال حذيفة: أنت كنت تفعل ذلك! لقد رأيتُنَا مع رسول الله صلى الله عليه وسلم ليلة الأحزاب وأخذتنا ريح شديدة وقرّ. فقال رسول الله صلى الله عليه وسلم: «ألاَ رجل يأتيني بخبر القوم جعله الله معي يوم القيامة؟» فسكتنا فلم يجبه منا أحد، ثم قال: «ألا رجل يأتينا بخبر القوم جعله الله معي يوم القيامة؟» فسكتنا فلم يجبه أحد. فقال: «قم يا حذيفة فأتنا خبر القوم» فلم أجد بُدًّا إذ دعاني باسمي أن أقوم. قال: «اذهب فأتني بخبر القوم ولا تَذْعَرْهم عليّ» قال: فلما وَلّيت من عنده جعلت كأنما أمشي في حَمّام حتى أتيتهم؛ فرأيت أبا سفيان يَصْلِي ظهره بالنار، فوضعت سهماً في كَبِد القَوس فأردت أن أرْمِيَه، فذكرت قول رسول الله صلى الله عليه وسلم: «وَلا تَذْعَرْهم عليّ» ولو رميته لأصبته: فرجعت وأنا أمشي في مثل الحَمّام، فلما أتيته فأخبرته بخبر القوم وفرغتُ قُرِرت، فألبسني رسول الله صلى الله عليه وسلم من فضل عباءة كانت عليه يصلّي فيها، فلم أزل نائماً حتى أصبحت، فلما أصبحت قال: «قم يا نَوْمَان» \"\n                                  ولما أصبح رسول الله صلى الله عليه وسلم وقد ذهب الأحزاب، رجع إلى المدينة ووضع المسلمون سلاحهم، فأتاه جبريل صلى الله عليه وسلم في صورة دِحْيَة بن خليفة الكلبيّ، على بغلة عليها قطيفة ديباج فقال له: يا محمد، إن كنتم قد وضعتم سلاحكم فما وضعت الملائكة سلاحها. إن الله يأمرك أن تخرج إلى بني قُريظة، وإني متقدم إليهم فمزلزل بهم حصونهم. فأمر رسول الله صلى الله عليه وسلم وهي:\n\nالثامنة: منادياً فنادى: لا يصلّيَنّ أحد العصر إلا في بني قُريظة؛ فتخوّف ناس فوت الوقت فصلوا دون بني قُريظة. وقال آخرون: لا نصلّي العصر إلا حيث أمرنا رسول الله صلى الله عليه وسلم وإن فاتنا الوقت. قال: فما عنّف واحداً من الفريقين. وفي هذا من الفقه تصويب المجتهدين. وقد مضى بيانه في «الأنبياء». وكان سعد بن معاذ إذْ أصابه السهم دعا ربه فقال: اللّهُم إن كنت أبقيْتَ من حرب قريش فأبقني لها؛ فإنه لا قوم أحب أن أجاهدهم من قوم كذّبوا رسولك وأخرجوه. اللَّهُمَّ وإن كنت وضعت الحرب بيننا وبينهم فاجعلها لي شهادة، ولا تُمِتْني حتى تقرّ عيني في بني قُريظة. وروى ابن وهب عن مالك قال: بلغني أن سعد بن معاذ مَرّ بعائشة رضي الله عنها ونساءٍ معها في الأَطُم (فارع)، وعليه دِرع مُقَلِّصة مشمرّ الكُمّين، وبه أثر صفرة وهو يرتجز:\nلَبِّثْ قليلاً يُدْرك الهَيْجَا جَمَلْ\t   \tلا بأس بالموت إذا حان الأَجَلْ\nفقالت عائشة رضي الله عنها: لست أخاف أن يصاب سعد اليوم إلا في أطرافه؛ فأصيب في أَكْحَله. وروى ابن وهب وابن القاسم عن مالك قالت عائشة رضي الله عنها: ما رأيت رجلاً أجمل من سعد ابن معاذ حاشا رسول الله صلى الله عليه وسلم. فأصيب في أكحله ثم قال: اللهم إن كان حرب قُريظة لم يبق منه شيء فاقبضني إليك، وإن كان قد بقيت منه بقية فأبقني حتى أجاهد مع رسولك أعداءه؛ فلما حُكّم في بني قُريظة تُوُفِّيَ؛ ففرح الناس وقالوا: نرجو أن يكون قد استجيبت دعوته.\n\nالتاسعة: ولما خرج المسلمون إلى بني قُريظة أعطى رسول الله صلى الله عليه وسلم الراية عليّ بن أبي طالب، واستخلف على المدينة ابن أمّ مَكْتوم، ونهض عليّ وطائفة معه حتى أتوا بني قريظة ونازلوهم، فسمعوا سبّ الرسول صلى الله عليه وسلم، فانصرف عليّ إلى رسول الله صلى الله عليه وسلم فقال له: يا رسول الله، لا تبلغ إليهم، وعَرّض له.\n                                  فقال له: \" أظنك سمعت منهم شتمي. لو رأوني لكفُّوا عن ذلك \" ونهض إليهم فلما رأوه أمسكوا. فقال لهم: \" نقضتم العهد يا إخوة القرود أخزاكم الله وأنزل بكم نقمته \" فقالوا: ما كنت جاهلاً يا محمد فلا تجهل علينا؛ ونزل رسول الله صلى الله عليه وسلم فحاصرهم بضعاً وعشرين ليلة. وعرض عليهم سيّدُهم كعب ثلاثَ خصال ليختاروا أيّها شاؤوا: إما أن يُسلموا ويتبعوا محمداً على ما جاء به فيسلَموا. قال: وتحرزوا أموالكم ونساءكم وأبناءكم، فوالله إنكم لتعلمون أنه الذي تجدونه مكتوباً في كتابكم. وإما أن يقتلوا أبناءهم ونساءهم ثم يتقدموا؛ فيقاتلون حتى يموتوا من آخرهم. وإما أن يبيّتوا المسلمين ليلة السبت في حين طمأنينتهم فيقتلوهم قتلاً. فقالوا له: أما الإسلام فلا نُسلم ولا نخالف حكم التوراة، وأما قتل أبنائنا ونسائنا فما جزاؤهم المساكين منا أن نقتلهم، ونحن لا نتعدّى في السبت. ثم بعثوا إلى أبي لُبابة، وكانوا حلفاء بني عمرو بن عوف وسائر الأوْس، فأتاهم فجمعوا إليه أبناءهم ونساءهم ورجالهم وقالوا له: يا أبا لبابة، أترى أن ننزل على حكم محمد؟ فقال: نعم، ـ وأشار بيده إلى حَلْقه ـ إنه الذبح إن فعلتم. ثم ندم أبو لبابة في الحين، وعلم أنه خان الله ورسوله، وأنه أمرٌ لا يستره الله عليه عن نبيّه صلى الله عليه وسلم. فانطلق إلى المدينة ولم يرجع إلى النبيّ صلى الله عليه وسلم فربط نفسه في سارِية وأقسم ألا يبرح من مكانه حتى يتوب الله عليه فكانت امرأته تَحُلّه لوقت كل صلاة. قال ابن عُيينة وغيره: فيه نزلت\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَخُونُواْ ٱللَّهَ وَٱلرَّسُولَ وَتَخُونُوۤاْ أَمَانَاتِكُمْ }\n[الأنفال: 27] الآية. وأقسم ألاّ يدخل أرض بني قُريظة أبداً مكاناً أصاب فيه الذنب. فلما بلغ ذلك النبيّ صلى الله عليه وسلم مِن فعل أبي لُبابة قال: \" أما إنه لو أتاني لاستغفرت له وأمّا إذْ فعل ما فعل فلا أطلقه حتى يطلقه الله تعالى \" فأنزل الله تعالى في أمر أبي لبابة:\n{ وَآخَرُونَ ٱعْتَرَفُواْ بِذُنُوبِهِمْ }\n[التوبة: 102] الآية. فلما نزل فيه القرآن أمر رسول الله صلى الله عليه وسلم بإطلاقه، فلما أصبح بنو قريظة نزلوا على حكم رسول الله صلى الله عليه وسلم، فتواثب الأوْس إلى رسول الله صلى الله عليه وسلم وقالوا: يا رسول الله، وقد علمتَ أنهم حلفاؤنا، وقد أسعفت عبد الله بن أبَيّ بن سلول في بني النَّضِير حلفاء الخَزْرج، فلا يكن حظُّنا أوْكَس وأنقص عندك من حَظّ غيرنا، فهم موالينا. فقال لهم رسول الله صلى الله عليه وسلم: \" يا معشر الأوس ألاَ ترضون أن يحكم فيهم رجل منكم ـ قالوا بلى. قال ـ: ـ فذلك إلى سعد بن معاذ \" وكان رسول الله صلى الله عليه وسلم قد ضرب له خيمة في المسجد، ليعوده من قريب في مرضه من جرحه الذي أصابه في الخندق.\n                                  فحكم فيهم بأن تُقتل المقاتِلة، وتُسْبَى الذرية والنساء، وتقسم أموالهم. فقال له رسول الله صلى الله عليه وسلم: \" لقد حكمت فيهم بحكم الله تعالى من فوق سبع أرقعة \" وأمر رسول الله صلى الله عليه وسلم فأخرجوا إلى موضع بسوق المدينة اليوم ـ زمن ابن إسحاق ـ فخندق بها خنادق، ثم أمر عليه السلام فضربت أعناقهم في تلك الخنادق، وقتل يومئذٍ حييّ بن أخْطب وكعب بن أسد، وكانا رأس القوم، وكانوا من الستمائة إلى السبعمائة. وكان على حُيَيّ حُلّة فُقّاحِيّة قد شققها عليه من كل ناحية كموضع الأنملة، أنملة أنملة لئلا يُسْلبَها. فلما نظر إلى رسول الله صلى الله عليه وسلم حين أتي به ويداه مجموعتان إلى عنقه بحبل قال: أمَا والله ما لُمتُ نفسي في عداوتك.\nولـكـنـه مـن يـخـذل الله يـخـذل\t   \t\nثم قال: يا أيها الناس، لا بأس بأمر الله كتاب وقَدَر ومَلْحمة كُتبت على بني إسرائيل، ثم جلس فضربت عنقه. وقتل من نسائهم امرأة، وهي بُنانة امرأة الحكم القُرَظِيّ التي طرحت الرّحَى على خَلاّد بن سُويد فقتلته. وأمر رسول الله صلى الله عليه وسلم بقتل كل من أنبت منهم وترك من لم يُنبت. وكان عطية القُرَظِيّ ممن لم ينبت، فاستحياه رسول الله صلى الله عليه وسلم، وهو مذكور في الصحابة. ووَهب رسول الله صلى الله عليه وسلم لثابت بن قيس بن شمّاس ولدَ الزّبِير بن باطا فاستحياهم؛ منهم عبد الرحمن بن الزّبير أسلم وله صحبة. وَوَهَب أيضاً عليه السلام رفاعة بن سَمَوْءل القرظي لأم المنذر سلمى بنت قيس، أخت سلَيط بن قيس من بني النجار، وكانت قد صلّت إلى القبلتين؛ فأسلم رفاعة وله صحبة ورواية. وروى ابن وهب وابن القاسم عن مالك قال: أتى ثابت بن قيس بن شمّاس إلى ابن باطا ـ وكانت له عنده يد ـ وقال: قد استوهبتك من رسول الله صلى الله عليه وسلم ليدك التي لك عندي، قال: ذلك يفعل الكريم بالكريم، ثم قال: وكيف يعيش رجل لا ولد له ولا أهل؟ قال: فأتى ثابت إلى رسول الله صلى الله عليه وسلم فذكر ذلك له، فأعطاه أهله وولده؛ فأتى فأعلمه فقال: كيف يعيش رجل لا مال له؟ فأتى ثابت النبيّ صلى الله عليه وسلم فطلبه فأعطاه ماله، فرجع إليه فأخبره؛ قال: ما فعل ابن أبي الحُقَيق الذي كأن وجهه مرآة صينية؟ قال: قتل. قال: فما فعل المجلسان، يعني بني كعب بن قريظة وبني عمرو بن قُريظة؟ قال: قتلوا. قال: فما فعلت الفئتان؟ قال: قتلتا. قال: برئت ذمتك، ولن أصبّ فيها دلواً أبداً، يعني النخل، فألحقني بهم، فأبى أن يقتله فقتله غيره.\n                                  واليد التي كانت لابن باطا عند ثابت أنه أسره يوم بُعاث فجز ناصيته وأطلقه.\n\nالعاشرة: وقسم صلى الله عليه وسلم أموال بني قُريظة فأسهم للفارس ثلاثة أسهم وللراجل سهماً. وقد قيل: للفارس سهمان وللراجل سهم. وكانت الخيل للمسلمين يومئذٍ ستة وثلاثين فرساً. ووقع للنبي صلى الله عليه وسلم من سَبْيهم ريحانة بنت عمرو بن جنافة أحد بني عمرو بن قُريظة، فلم تزل عنده إلى أن مات صلى الله عليه وسلم. وقيل: إن غَنيمة قريظة هي أوّل غنيمة قسم فيها للفارس والراجل، وأوّل غنيمة جعل فيها الخُمس. وقد تقدّم أن أوّل ذلك كان في بعث عبد الله بن جَحْش؛ فالله أعلم. قال: أبو عمر: وتهذيب ذلك أن تكون غنيمة قريظة أوّلَ غنيمة جرى فيها الخمس بعد نزول قوله:\n{ وَٱعْلَمُوۤا أَنَّمَا غَنِمْتُمْ مِّن شَيْءٍ فَأَنَّ للَّهِ خُمُسَهُ وَلِلرَّسُولِ }\n[الأنفال: 41] الآية. وكان عبد الله بن جَحش قد خمّس قبل ذلك في بعثه، ثم نزل القرآن بمثل ما فعله؛ وكان ذلك من فضائله رحمة الله عليه.\n\nوكان فتح قريظة في آخر ذي القعدة وأوّل ذي الحجة من السنة الخامسة من الهجرة. فلما تمّ أمر بني قريظة أجيبت دعوة الرجل الفاضل الصالح سعد بن معاذ، فانفجر جرحه، وانفتح عرقه، فجرى دمه ومات رضي الله عنه. وهو الذي أتى الحديث فيه: \" اهتَزّ لموته عَرْشُ الرّحمن \" يعني سكان العرش من الملائكة فرِحوا بقدوم روحه واهتزُّوا له. وقال ابن القاسم عن مالك: حدّثني يحيـى بن سعيد قال: لقد نزل لموت سعد بن معاذ سبعون ألف ملَك، ما نزلوا إلى الأرض قبلها. قال مالك: ولم يستشهد يوم الخَنْدق من المسلمين إلا أربعة أو خمسة.\n\nقلت: الذي اسْتُشْهِد يوم الخندق من المسلمين ستةُ نفرٍ فيما ذكر أهل العلم بالسِّيَر: سعد بن معاذ أبو عمرو من بني عبد الأشهل، وأنس بن أوْس بن عتيك، وعبد الله بن سهل، وكلاهما أيضاً من بني عبد الأشهل، والطّفيل بن النعمان، وثعلبة بن غَنَمَة، وكلاهما من بني سلمة، وكعب بن زيد من بني دينار بن النجار، أصابه سَهْمٌ غَرْبٌ فقتله، رضي الله عنهم. وقتل من الكفار ثلاثة: منبّه بن عثمان بن عبيد بن السباق بن عبد الدار، أصابه سهم مات منه بمكة. وقد قيل: إنما هو عثمان بن أمية بن منبه بن عبيد بن السباق. ونوفل بن عبد الله بن المغيرة المخزومي، اقتحم الخندق فتورّط فيه فقتِل، وغلب المسلمون على جسده؛ \" فروي عن الزهري أنهم أعطوا رسول الله صلى الله عليه وسلم في جسده عشرة آلاف درهم فقال: «لا حاجة لنا بجسده ولا بثمنه» فخلّى بينهم وبينه \" وعمرو بن (عبد) ودّ الذي قتله عليٌّ مبارزة، وقد تقدّم.\n\n                                  واستشهد يوم قُريظة من المسلمين خَلاْد بن سويد بن ثعلبة بن عمرو من بني الحارث بن الخزرج؛ طرحت عليه امرأةٌ من بني قُريظة رحى فقتلته. ومات في الحصار أبو سنان ابن مِحْصَن بن حُرْثان الأسدي، أخو عُكاشة بن مِحْصَن، فدفنه رسول الله صلى الله عليه وسلم في مقبرة بني قُريظة التي يتدافن فيها المسلمون السكان بها اليوم. ولم يُصب غير هذين، ولم يغزُ كفارُ قريش المؤمنين بعد الخندق. وأسند الدارِمِيّ أبو محمد في مسنده: أخبرنا يزيد بن هارون عن ابن أبي ذِئب عن المَقْبُرِيّ عن عبد الرحمن بن أبي سعيد الخُدْرِيّ عن أبيه قال: حُبسنا يوم الخندق حتى ذهب هَوِيّ من الليل حتى كفينا؛ وذلك قول الله عز وجل:\n{ وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً }\n[الأحزاب: 25] فأمر النبي صلى الله عليه وسلم بلالاً فأقام فصلّى الظهر فأحسن كما كان يصليها في وقتها، ثم أمره فأقام العصر فصلاّها، ثم أمره فأقام المغرب فصلاّها، ثم أمره فأقام العشاء فصلاّها، وذلك قبل أن ينزل:\n{ فَإنْ خِفْتُمْ فَرِجَالاً أَوْ رُكْبَاناً }\n[البقرة: 239] خرّجه النسائي أيضاً. وقد مضت هذه المسألة في «طه». وقد ذكرنا في هذه الغَزاة أحكاماً كثيرة لمن تأملها في مسائل عشر. ثم نرجع إلى أوّل الآي وهي تسع عشرة آية تضمّنت ما ذكرناه.\n\nقوله تعالى: { إِذْ جَآءَتْكُمْ جُنُودٌ } يعني الأحزاب. { فَأَرْسَلْنَا عَلَيْهِمْ رِيحاً } قال مجاهد: هي الصَّبا، أرسلت على الأحزاب يوم الخندق حتى ألقت قدورهم ونزعت فساطيطهم. قال: والجنود الملائكة ولم تقاتل يومئذٍ. وقال عِكْرمة: قالت الجَنوب للشَّمال ليلة الأحزاب: انطلقي لنصرة النبيّ صلى الله عليه وسلم، فقالت الشَّمال: إن مَحْوَةَ لا تسرِي بليل. فكانت الريح التي أرسلت عليهم الصَّبا. وروى سعيد بن جُبير عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم: \" نُصرت بالصَّبا وأهلِكت عادٌ بالدَّبور \" وكانت هذه الريح معجزة للنبيّ صلى الله عليه وسلم؛ لأن النبيّ صلى الله عليه وسلم والمسلمين كانوا قريباً منها، لم يكن بينهم وبينها إلا عرض الخندق، وكانوا في عافية منها، ولا خبر عندهم بها. { وَجُنُوداً لَّمْ تَرَوْهَا } وقرىء بالياء؛ أي لم يرها المشركون. قال المفسرون: بعث الله تعالى عليهم الملائكة فقلعت الأوتاد، وقطعت أطناب الفساطيط، وأطفأت النيران، وأكفأت القدور، وجالت الخيل بعضها في بعض، وأرسل الله عليهم الرُّعْب، وكثر تكبير الملائكة في جوانب العسكر؛ حتى كان سيَّدُ كل خباء يقول: يا بني فلان هُلُمّ إليّ فإذا اجتمعوا قال لهم: النّجاءَ النّجاءَ؛ لما بعث الله تعالى عليهم من الرعب. { وَكَانَ ٱللَّهُ بِمَا تَعْمَلُونَ بَصِيراً } وقرىء: «يعملون» بالياء على الخبر، وهي قراءة أبي عمرو. الباقون بالتاء؛ يعني من حفر الخندق والتحرز من العدوّ.\n                                   \n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَآءَتۡكُمۡ جُنُودٞ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا وَجُنُودٗا لَّمۡ تَرَوۡهَاۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا ٩\n                                        \n                                        \n                                        \n                                        يذكر تعالى عباده المؤمنين نعمته عليهم، ويحثهم على شكرها، حين جاءتهم جنود أهل مكة والحجاز، من فوقهم، وأهل نجد من أسفل منهم، وتعاقدوا وتعاهدوا على استئصال الرسول والصحابة، وذلك في وقعة الخندق. ومالأتهم [طوائف] اليهود الذين حوالي المدينة، فجاءوا بجنود عظيمة وأمم كثيرة. وخندق رسول اللّه صلى اللّه عليه وسلم على المدينة، فحصروا المدينة، واشتد الأمر، وبلغت القلوب الحناجر، حتى بلغ الظن من كثير من الناس كل مبلغ، لما رأوا من الأسباب المستحكمة، والشدائد الشديدة، فلم يزل الحصار على المدينة مدة طويلة، والأمر كما وصف اللّه: { وَإِذْ زَاغَتِ ٱلأَبْصَارُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } أي: الظنون السيئة، أن اللّه لا ينصر دينه ولا يتم كلمته. { هُنَالِكَ ٱبْتُلِيَ ٱلْمُؤْمِنُونَ } بهذه الفتنة العظيمة { وَزُلْزِلُواْ زِلْزَالاً شَدِيداً } بالخوف والقلق والجوع، ليتبين إيمانهم، ويزيد إيقانهم، فظهر - وللّه الحمد - من إيمانهم وشدة يقينهم، ما فاقوا فيه الأولين والآخرين. وعندما اشتد الكرب، وتفاقمت الشدائد، صار إيمانهم عين اليقين،\n{ وَلَمَّا رَأَى ٱلْمُؤْمِنُونَ ٱلأَحْزَابَ قَالُواْ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ وَصَدَقَ ٱللَّهُ وَرَسُولُهُ وَمَا زَادَهُمْ إِلاَّ إِيمَاناً وَتَسْلِيماً }\n[الأحزاب: 22]. وهنالك تبين نفاق المنافقين، وظهر ما كانوا يضمرون، قال تعالى: { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا... }.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَآءَتۡكُمۡ جُنُودٞ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا وَجُنُودٗا لَّمۡ تَرَوۡهَاۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا ٩"
    },
    {
      "number": 3543,
      "text": "إِذْ جَاءُوكُمْ مِنْ فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنْكُمْ وَإِذْ زَاغَتِ الْأَبْصَارُ وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ وَتَظُنُّونَ بِاللَّهِ الظُّنُونَا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 10,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 362,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ جَآءُوكُم مِّن فَوۡقِكُمۡ وَمِنۡ أَسۡفَلَ مِنكُمۡ وَإِذۡ زَاغَتِ ٱلۡأَبۡصَٰرُ وَبَلَغَتِ ٱلۡقُلُوبُ ٱلۡحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠ ٠١\n                                    \n                                    \n                                    يقول تعالى مخبراً عن نعمته وفضله وإِحسانه إِلى عباده المؤمنين في صرفه أعداءهم، وهزمه إِياهم عام تألبوا عليهم وتحزبوا، وذلك عام الخندق، وذلك في شوال سنة خمس من الهجرة على الصحيح المشهور. وقال موسى بن عقبة وغيره كان في سنة أربع. وكان سبب قدوم الأحزاب أن نفراً من أشراف يهود بن النضير الذين كانوا قد أجلاهم رسول الله صلى الله عليه وسلم من المدينة إِلى خيبر، منهم سلام بن أبي الحقيق، وسلام بن مشكم، وكنانة بن الربيع، خرجوا إِلى مكة، فاجتمعوا بأشراف قريش، وألبوهم على حرب النبي صلى الله عليه وسلم ووعدوهم من أنفسهم النصر والإعانة، فأجابوهم إِلى ذلك، ثم خرجوا إِلى غطفان، فدعوهم فاستجابوا لهم أيضاً، وخرجت قريش في أحابيشها ومن تابعها، وقائدها أبو سفيان صخر بن حرب، وعلى غطفان عيينة بن حصن بن بدر، والجميع قريب من عشرة آلاف، فلما سمع رسول الله صلى الله عليه وسلم بمسيرهم، أمر المسلمين بحفر الخندق حول المدينة ممايلي الشرق، وذلك بإِشارة سلمان الفارسي رضي الله عنه، فعمل المسلمون فيه واجتهدوا، ونقل معهم رسول الله صلى الله عليه وسلم التراب وحفر، وكان في حفره ذلك آيات بينات ودلائل واضحات. وجاء المشركون، فنزلوا شرقي المدينة قريباً من أحد، ونزلت طائفة منهم أعالي أرض المدينة، كما قال الله تعالى { إِذْ جَآءُوكُمْ مِّن فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنكُمْ } وخرج رسول الله صلى الله عليه وسلم ومن معه من المسلمين، وهم نحو ثلاثة آلاف، وقيل سبعمائة، فأسندوا ظهورهم إِلى سلع، ووجوههم إِلى نحو العدو، والخندق حفير ليس فيه ماء بينهم وبينهم، يحجب الخيالة والرجالة أن تصل إِليهم، وجعل النساء والذراري في آطام المدينة، وكانت بنو قريظة، وهم طائفة من اليهود لهم حصن شرقي المدينة، ولهم عهد من النبي صلى الله عليه وسلم وذمة، وهم قريب من ثمانمائة مقاتل، فذهب إِليهم حيي بن أخطب النضري، فلم يزل بهم حتى نقضوا العهد، ومالؤا الأحزاب على رسول الله صلى الله عليه وسلم فعظم الخطب، واشتد الأمر، وضاق الحال كما قال الله تبارك وتعالى { هُنَالِكَ ٱبْتُلِىَ ٱلْمُؤْمِنُونَ وَزُلْزِلُواْ زِلْزَالاً شَدِيداً } ومكثوا محاصرين للنبي صلى الله عليه وسلم وأصحابه قريباً من شهر، إِلا أنهم لا يصلون إِليهم، ولم يقع بينهم قتال، إِلا أن عمرو بن عبد ودّ العامري، وكان من الفرسان الشجعان المشهورين في الجاهلية، ركب ومعه فوارس، فاقتحموا الخندق، وخلصوا إِلى ناحية المسلمين، فندب رسول الله صلى الله عليه وسلم خيل المسلمين إِليه، فيقال إِنه لم يبرز أحد، فأمر علياً رضي الله عنه، فخرج إِليه، فتجاولا ساعة، ثم قتله علي رضي الله عنه، فكان علامة النصر.\n                                    ثم أرسل الله عز وجل على الأحزاب ريحاً شديدة الهبوب قوية، حتى لم يبق لهم خيمة ولا شيء، ولا توقد لهم نار، ولا يقر لهم قرار، حتى ارتحلوا خائبين خاسرين كما قال الله عز وجل { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ ٱذْكُرُواْ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ جَآءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحاً وَجُنُوداً } قال مجاهد وهي الصبا، ويؤيده الحديث الآخر \" نصرت بالصبا، وأهلكت عاد بالدبور \" وقال ابن جرير حدثني محمد بن المثنى، حدثنا عبد الأعلى، حدثنا داود عن عكرمة قال قالت الجنوب للشمال ليلة الأحزاب انطلقي ننصر رسول الله صلى الله عليه وسلم فقالت الشمال إِن الحرة لا تسري بالليل، قال فكانت الريح التي أرسلت عليهم الصبا. ورواه ابن أبي حاتم عن أبي سعيد الأشج، عن حفص بن غياث، عن داود عن عكرمة عن ابن عباس رضي الله عنهما، فذكره. وقال ابن جرير أيضاً حدثنا يونس حدثنا ابن وهب، حدثني عبيد الله بن عمر عن نافع عن عبد الله بن عمر رضي الله عنهما قال أرسلني خالي عثمان بن مظعون رضي الله عنه ليلة الخندق في برد شديد وريح إِلى المدينة، فقال أئتنا بطعام ولحاف، قال فاستأذنت رسول الله صلى الله عليه وسلم فأذن لي، وقال \" من أتيت من أصحابي، فمرهم يرجعوا \" قال فذهبت والريح تسفي كل شيء، فجعلت لاألقى أحداً إِلا أمرته بالرجوع إِلى النبي صلى الله عليه وسلم قال فما يلوي أحد منهم عنقه، قال وكان معي ترس لي، فكانت الريح تضربه علي، وكان فيه حديد، قال فضربته الريح حتى وقع بعض ذلك الحديد على كفي، فأبعدها إِلى الأرض. وقوله { وَجُنُوداً لَّمْ تَرَوْهَا } هم الملائكة، زلزلتهم وألقت في قلوبهم الرعب والخوف، فكان رئيس كل قبيلة يقول يا بني فلان إِلي، فيجتمعون إِليه، فيقول النجاء، النجاء لما ألقى الله عز وجل في قلوبهم من الرعب. وقال محمد بن إِسحاق عن يزيد بن زياد عن محمد بن كعب القرظي قال قال فتى من أهل الكوفة لحذيفة بن اليمان رضي الله عنه ياأبا عبد الله رأيتم رسول الله صلى الله عليه وسلم وصحبتموه؟ قال نعم يابن أخي قال وكيف كنتم تصنعون؟ قال والله لقد كنا نجهد، قال الفتى والله لو أدركناه ما تركناه يمشي على الأرض، ولحملناه على أعناقنا. قال قال حذيفة رضي الله عنه يابن أخي والله لو رأيتنا مع رسول الله صلى الله عليه وسلم بالخندق، وصلى رسول الله صلى الله عليه وسلم هوياً من الليل، ثم التفت فقال \" من رجل يقوم فينظر لنا ما فعل القوم؟ ــــ يشترط له النبي صلى الله عليه وسلم أن يرجع ــــ أدخله الله الجنة \"\n                                    قال فما قام رجل، ثم صلى رسول الله صلى الله عليه وسلم هوياً من الليل، ثم التفت إِلينا فقال مثله، فما قام منا رجل، ثم صلى رسول الله صلى الله عليه وسلم هوياً من الليل، ثم التفت إِلينا فقال \" من رجل يقوم فينظر لنا ما فعل القوم ثم يرجع؟ ــــ يشترط له رسول الله صلى الله عليه وسلم الرجعة ــــ أسأل الله تعالى أن يكون رفيقي في الجنة \" فما قام رجل من القوم من شدة الخوف وشدة الجوع وشدة البرد، فلما لم يقم أحد، دعاني رسول الله صلى الله عليه وسلم فلم يكن لي بد من القيام حين دعاني، فقال صلى الله عليه وسلم \" ياحذيفة اذهب فادخل في القوم، فانظر ما يفعلون، ولا تحدثنَّ شيئاً حتى تأتينا \". قال فذهبت فدخلت في القوم، والريح وجنود الله عز وجل تفعل بهم ما تفعل، لا تقر لهم قراراً ولا ناراً ولا بناء، فقام أبو سفيان فقال يا معشر قريش لينظر كل امرىء مَنْ جليسُه، قال حذيفة رضي الله عنه فأخذت بيد الرجل إِلى جنبي، فقلت من أنت؟ فقال أنا فلان بن فلان، ثم قال أبو سفيان يامعشر قريش إِنكم والله ما أصبحتم بدار مقام، لقد هلك الكراع والخف، وأخلفتنا بنو قريظة، وبلغنا عنهم الذي نكره، ولقينا من هذه الريح ما ترون، والله ما تطمئن لنا قدر، ولاتقوم لنا نار، ولا يستمسك لنا بناء، فارتحلوا فإِني مرتحل، ثم قام إِلى جمله وهو معقول، فجلس عليه، ثم ضربه فوثب به على ثلاث، فما أطلق عقاله إِلا وهو قائم، ولولا عهد رسول الله صلى الله عليه وسلم إِلي أن لاتحدث شيئاً حتى تأتيني لو شئت لقتلته بسهم. قال حذيفة رضي الله عنه فرجعت إِلى رسول الله صلى الله عليه وسلم وهو قائم يصلي في مرط لبعض نسائه مرحل، فلما رآني، أدخلني بين رجليه، وطرح علي طرف المرط، ثم ركع وسجد، وإِني لفيه، فلما سلم، أخبرته الخبر، وسمعت غطفان بما فعلت قريش، فانشمروا راجعين إِلى بلادهم. وقد رواه مسلم في صحيحه من حديث الأعمش عن إِبراهيم التيمي عن أبيه قال كنا عند حذيفة بن اليمان رضي الله عنه، فقال له رجال لو أدركت رسول الله صلى الله عليه وسلم قاتلت معه وأبليت، فقال له حذيفة أنت كنت تفعل ذلك؟ لقد رأيتنا مع رسول الله صلى الله عليه وسلم ليلة الأحزاب في ليلة ذات ريح شديدة وقر، فقال رسول الله صلى الله عليه وسلم \" ألا رجل يأتي بخبر القوم يكون معي يوم القيامة \" فلم يجبه منا أحد، ثم الثانية ثم الثالثة مثله، ثم قال صلى الله عليه وسلم\n                                    \" ياحذيفة قم فأتنا بخبر من القوم \" فلم أجد بداً إِذ دعاني باسمي أن أقوم، فقال \" ائتني بخبر القوم، ولاتذعرهم علي \" قال فمضيت كأنما أمشي في حمام حتى أتيتهم، فإِذا أبو سفيان يَصْلي ظهره بالنار، فوضعت سهماً في كبد قوسي، وأردت أن أرميه، ثم ذكرت قول رسول الله صلى الله عليه وسلم لا تذعرهم عليَّ، ولو رميته لأصبته، قال فرجعت كأنما أمشي في حمام، فأتيت رسول الله صلى الله عليه وسلم ثم أصابني البرد حين فرغت وقررت، فأخبرت رسول الله صلى الله عليه وسلم وألبسني من فضل عباءة كانت عليه يصلي فيها، فلم أزل نائماً حتى الصبح، فلما أصبحت قال رسول الله صلى الله عليه وسلم \" قم يانَوْمان \". ورواه يونس بن بكير عن هشام بن سعد، عن زيد بن أسلم قال إِن رجلاً قال لحذيفة رضي الله عنه نشكو إِلى الله صحبتكم لرسول الله صلى الله عليه وسلم إِنكم أدركتموه ولم ندركه، ورأيتموه ولم نره، فقال حذيفة رضي الله عنه ونحن نشكو إِلى الله إِيمانكم به ولم تروه، والله لا تدري يابن أخي لو أدركته كيف كنت تكون؟ لقد رأيتنا مع رسول الله صلى الله عليه وسلم ليلة الخندق في ليلة باردة مطيرة، ثم ذكر نحو ما تقدم مطولاً. وروى بلال بن يحيى العبسي عن حذيفة رضي الله عنه نحو ذلك أيضاً، وقد أخرج الحاكم والبيهقي في \" الدلائل \" من حديث عكرمة بن عمار عن محمد بن عبد الله الدؤلي عن عبد العزيز بن أخي حذيفة قال ذكر حذيفة رضي الله عنه مشاهدهم مع رسول الله صلى الله عليه وسلم فقال جلساؤه أما والله لو شاهدنا ذلك، كنا فعلنا وفعلنا، فقال حذيفة لا تمنوا ذلك، لقد رأيتنا ليلة الأحزاب ونحن صافون قعوداً، وأبو سفيان ومن معه من الأحزاب فوقنا، وقريظة لليهود أسفل منا نخافهم على ذرارينا، وما أتت علينا قط أشد ظلمة ولا أشد ريحاً، في أصوات ريحها أمثال الصواعق، وهي ظلمة ما يرى أحدنا أصبعه، فجعل المنافقون يستأذنون النبي صلى الله عليه وسلم ويقولون إِن بيوتنا عورة، وما هي بعورة، فما يستأذنه أحد منهم إِلا أذن له، ويأذن لهم فيتسللون، ونحن ثلثمائة أو نحو ذلك، إِذ استقبلنا رسول الله رجلاً رجلاً، حتى أتى علي، وما علي جنة من العدو ولا من البرد إِلا مرط لامرأتي ما يجاوز ركبتي، قال فأتاني صلى الله عليه وسلم وأنا جاث على ركبتي، فقال \" من هذا؟ \" فقلت حذيفة. قال \" حذيفة؟ \" قتقاصرت الأرض، فقلت بلى يارسول الله كراهية أن أقوم، فقمت فقال \" إِنه كائن في القوم خبر، فأتني بخبر القوم \"\n                                    قال وأنا من أشد الناس فزعاً وأشدهم قُرّاً. قال فخرجت، فقال رسول الله صلى الله عليه وسلم \" اللهم احفظه من بين يديه ومن خلفه، وعن يمينه وعن شماله، ومن فوقه ومن تحته \" قال فوالله ما خلق الله تعالى فزعاً ولا قرّاً في جوفي إِلا خرج من جوفي، فما أجد فيه شيئاً، قال فلما وليت، قال صلى الله عليه وسلم \" يا حذيفة لا تحدثن في القوم شيئاً حتى تأتيني \" قال فخرجت حتى إِذا دنوت من عسكر القوم، نظرت في ضوء نار لهم توقد، فإِذا رجل أدهم ضخم يقول بيده على النار، ويمسح خاصرته، ويقول الرحيل الرحيل، ولم أكن أعرف أبا سفيان قبل ذلك، فانتزعت سهماً من كنانتي أبيض الريش، فأضعه في كبد قوسي لأرميه به في ضوء النار، فذكرت قول رسول الله صلى الله عليه وسلم \" لا تحدثن فيهم شيئاً حتى تأتيني \" قال فأمسكت، ورددت سهمي إِلى كنانتي، ثم إِني شجعت نفسي حتى دخلت العسكر، فإِذا أدنى الناس مني بنو عامر يقولون يا آل عامر الرحيل الرحيل، لا مقام لكم. وإِذا الريح في عسكرهم ما تجاوز عسكرهم شبراً، فوالله إِني لأسمع صوت الحجارة في رحالهم وفَرَسَتْهم، الريح تضربهم بها، ثم خرجت نحو النبي صلى الله عليه وسلم فلما انتصفت في الطريق، أو نحواً من ذلك، إِذ أنا بنحو من عشرين فارساً أو نحو ذلك معتمين، فقالوا أخبر صاحبك أن الله تعالى كفاه القوم، فرجعت إِلى رسول الله صلى الله عليه وسلم وهو مشتمل في شملة يصلي، فوالله ما عدا أن رجعت راجعني القر، وجعلت أقرقف، فأومأ إِلي رسول الله صلى الله عليه وسلم بيده وهو يصلي، فدنوت منه، فأسبل عليّ شملة، وكان رسول الله صلى الله عليه وسلم إِذا حزبه أمر، صلى، فأخبرته خبر القوم، وأخبرته أني تركتهم يرتحلون، وأنزل الله تعالى { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ ٱذْكُرُواْ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ إِذْ جَآءَتْكُمْ جُنُودٌ فَأَرْسَلْنَا عَلَيْهِمْ رِيحاً وَجُنُوداً لَّمْ تَرَوْهَا وَكَانَ ٱللَّهُ تَعْمَلُونَ بَصِيراً } وأخرج أبو داود في سننه منه وكان رسول الله صلى الله عليه وسلم إِذا حزبه أمر صلى، من حديث عكرمة بن عمار به. وقوله تعالى { إِذْ جَآءُوكُمْ مِّن فَوْقِكُمْ } أي الأحزاب، { وَمِنْ أَسْفَلَ مِنكُمْ } تقدم عن حذيفة رضي الله عنه أنهم بنو قريظة، { وَإِذْ زَاغَتِ ٱلأَبْصَـٰرُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ } أي شدة الخوف والفزع، { ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } قال ابن جرير ظن بعض من كان مع رسول الله صلى الله عليه وسلم أن الدائرة على المؤمنين، وأن الله سيفعل ذلك. وقال محمد بن إِسحاق في قوله تعالى { وَإِذْ زَاغَتِ ٱلأَبْصَـٰرُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } ظن المؤمنون كل ظن، ونجم النفاق، حتى قال معتب بن قشير أخو بني عمرو بن عوف كان محمد يعدنا أن نأكل كنوز كسرى وقيصر، وأحدنا لا يقدر على أن يذهب إِلى الغائط.\n                                    وقال الحسن في قوله عز وجل { وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } ظنون مختلفة، ظن المنافقون أن محمداً صلى الله عليه وسلم وأصحابه يستأصلون، وأيقن المؤمنون أن ما وعد الله ورسوله حق، وأنه سيظهره على الدين كله ولو كره المشركون. وقال ابن أبي حاتم حدثنا أحمد بن عاصم الأنصاري، حدثنا أبو عامر، ح وحدثنا أبي، حدثنا أبو عامرالعقدي، حدثنا الزبير، يعني ابن عبد الله مولى عثمان رضي الله عنه، عن رُتيج بن عبد الرحمن بن أبي سعيد عن أبيه عن أبي سعيد رضي الله عنه قال قلنا يوم الخندق يارسول الله هل من شيء نقول، فقد بلغت القلوب الحناجر؟ قال صلى الله عليه وسلم \" نعم، قولوا اللهم استر عوراتنا وآمن روعاتنا \" قال فضرب وجوه أعدائه بالريح، فهزمهم بالريح. وكذا رواه الإمام أحمد بن حنبل عن أبي عامر العقدي.\n                                    ",
        "qortoby": "إِذۡ جَآءُوكُم مِّن فَوۡقِكُمۡ وَمِنۡ أَسۡفَلَ مِنكُمۡ وَإِذۡ زَاغَتِ ٱلۡأَبۡصَٰرُ وَبَلَغَتِ ٱلۡقُلُوبُ ٱلۡحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠ ٠١\n                                    \n                                    \n                                    قوله تعالى: { إِذْ جَآءُوكُمْ مِّن فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنكُمْ } «إِذْ» في موضع نصب بمعنى واذكر. وكذا «وَإِذْ قَالَتْ طَائِفَةٌ مِنْهُمْ». «مِنْ فَوْقِكُمْ» يعني من فوق الوادي، وهو أعلاه من قبل المشرق، جاء منه عَوْف بن مالك في بني نصر، وعيينة بن حِصْن في أهل نجد، وطُليحة بن خويلد الأسدي في بني أسد. «وَمِنْ أَسْفَلَ مِنْكُمْ» يعني من بطن الوادي من قبل المغرب، جاء منه أبو سفيان بن حرب على أهل مكة، ويزيد بن جَحْش على قريش، وجاء أبو الأعور السُّلَمي ومعه حُيَيُّ بن أخطب اليهودي في يهود بني قُريظة مع عامر بن الطُّفَيل من وجه الخندق. { وَإِذْ زَاغَتِ ٱلأَبْصَارُ } أي شَخُصت. وقيل: مالت؛ فلم تلتفت إلا إلى عدوّها دَهَشاً من فرط الهَوْل. { وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ } أي زالت عن أماكنها من الصدور حتى بلغت الحناجر وهي الحلاقيم، واحدها حنجرة؛ فلولا أن الحلوق ضاقت عنها لخرجت؛ قاله قتادة. وقيل: هو على معنى المبالغة على مذهب العرب على إضمار كاد؛ قال :\nإذا ما غَضِبْنَا غَضْبَةً مُضَرِيَّة\t   \tهتكنا حجاب الشمس أو قطرت دَمَا\nأي كادت تقطر. ويقال: إن الرئة تنفتح عند الخوف فيرتفع القلب حتى يكاد يبلغ الحنجرة مثلاً؛ ولهذا يقال للجبان: انتفخ سَحْره. وقيل: إنه مثل مضروب في شدّة الخوف ببلوغ القلوب الحناجر وإن لم تزل عن أماكنها مع بقاء الحياة. قال معناه عكرمة. روى حماد بن زيد عن أيوب عن عكرمة قال: بلغ فزعها. والأظهر أنه أراد اضطراب القلب وضربانه، أي كأنه لشدّة اضطرابه بلغ الحنجرة. والحنجرة والحُنجور (بزيادة النون) حرف الحلق. { وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } قال الحسن: ظن المنافقون أن المسلمين يُستأصلون، وظن المؤمنون أنهم يُنصرون. وقيل: هو خطاب للمنافقين؛ أي قلتم هلك محمد وأصحابه. واختلف القرّاء في قوله تعالى: «الظُّنُونَا، والرسولا، والسبيلا» آخر السورة؛ فأثبت ألفاتها في الوقف والوصل نافع وابن عامر. وروي عن أبي عمرو والكسائي تمسكا بخط المصحف، مصحف عثمان، وجميع المصاحف في جميع البلدان. واختاره أبو عبيد؛ إلا أنه قال: لا ينبغي للقارىء أن يدرج القراءة بعدهن لكن يقف عليهن. قالوا: ولأن العرب تفعل ذلك في قوافي أشعارهم ومصاريعها؛ قال :\nنحن جلبنا القُرّح القوافِلاَ\t   \tتستنفر الأواخرُ الأوائلا\nوقرأ أبو عمرو والجحدرِيّ ويعقوب وحمزة بحذفها في الوصل والوقف معاً. قالوا: هي زائدة في الخط كما زيدت الألف في قوله تعالى :\n{ ولأَوْضَعُواْ خِلاَلَكُمْ }\n[التوبة: 47] فكتبوها كذلك، وغير هذا. وأما الشعر فموضع ضرورة، بخلاف القرآن فإنه أفصح اللغات ولا ضرورة فيه. قال ابن الأنباري: ولم يخالف المصحف من قرأ: «الظنون. والسبيل. والرسول» بغير ألف في الحروف الثلاثة، وخطّهن في المصحف بألف لأن الألف التي في «أطعنا» والداخلة في أوّل «الرسول.\n                                   والظنون. والسبيل» كفى من الألف المتطرفة المتأخرة كما كَفَتْ ألفُ أبي جادٍ من ألف هوّاز. وفيه حجة أخرى: أن الألف أنزلت منزلة الفتحة وما يُلحق دِعامة للحركة التي تسبق والنية فيه السقوط؛ فلما عُمل على هذا كانت الألف مع الفتحة كالشيء الواحد يوجب الوقفُ سقوطَهما ويعمل على أن صورة الألف في الخط لا توجب موضعاً في اللفظ، وأنها كالألف في\n{ سٰحِران }\n[ طه: 63] وفي\n{ فٰطِر السموات والأرض }\n[فاطر:1] وفي \n{ وٰعَدْنَا مُوسى }\n[البقرة:51] وما يشبههن مما يُحذف من الخط وهو موجود في اللفظ، وهو مسقط من الخط. وفيه حجة ثالثة هي أنه كتب على لغة من يقول لقيت الرجلا. وقرىء على لغة من يقول: لقيت الرجل، بغير ألف. أخبرنا أحمد بن يحيـى عن جماعة من أهل اللغة أنهم رووا عن العرب قام الرّجلُو، بواو، ومررت بالرجلي، بياء، في الوصل والوقف. ولقيت الرجلا؛ بألف في الحالتين كلتيهما. قال الشاعر :\nأسائلةٌ عُميرةُ عن أبيها\t   \tخلالَ الجيش تَعْتَرِف الرّكابا\nفأثبت الألف في «الركاب» بناء على هذه اللغة. وقال الآخر :\nإذا الجوزاء أردفت الثريا\t   \tظننت بآل فاطمة الظنونا\nوعلى هذه اللغة بنى نافع وغيره. وقرأ ابن كثير وابن محيْصِن والكسائي بإثباتها في الوقف وحذفها في الوصل. قال ابن الأنباريّ: ومن وصل بغير ألف ووقف بألف فجائز أن يحتج بأن الألف احتاج إليها عند السكت حرصاً على بقاء الفتحة، وأن الألف تدعمها وتقوّيها.\n                                    ",
        "saadi": "إِذۡ جَآءُوكُم مِّن فَوۡقِكُمۡ وَمِنۡ أَسۡفَلَ مِنكُمۡ وَإِذۡ زَاغَتِ ٱلۡأَبۡصَٰرُ وَبَلَغَتِ ٱلۡقُلُوبُ ٱلۡحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠ ٠١\n                                        \n                                        \n                                        \n                                        يذكر تعالى عباده المؤمنين نعمته عليهم، ويحثهم على شكرها، حين جاءتهم جنود أهل مكة والحجاز، من فوقهم، وأهل نجد من أسفل منهم، وتعاقدوا وتعاهدوا على استئصال الرسول والصحابة، وذلك في وقعة الخندق. ومالأتهم [طوائف] اليهود الذين حوالي المدينة، فجاءوا بجنود عظيمة وأمم كثيرة. وخندق رسول اللّه صلى اللّه عليه وسلم على المدينة، فحصروا المدينة، واشتد الأمر، وبلغت القلوب الحناجر، حتى بلغ الظن من كثير من الناس كل مبلغ، لما رأوا من الأسباب المستحكمة، والشدائد الشديدة، فلم يزل الحصار على المدينة مدة طويلة، والأمر كما وصف اللّه: { وَإِذْ زَاغَتِ ٱلأَبْصَارُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } أي: الظنون السيئة، أن اللّه لا ينصر دينه ولا يتم كلمته. { هُنَالِكَ ٱبْتُلِيَ ٱلْمُؤْمِنُونَ } بهذه الفتنة العظيمة { وَزُلْزِلُواْ زِلْزَالاً شَدِيداً } بالخوف والقلق والجوع، ليتبين إيمانهم، ويزيد إيقانهم، فظهر - وللّه الحمد - من إيمانهم وشدة يقينهم، ما فاقوا فيه الأولين والآخرين. وعندما اشتد الكرب، وتفاقمت الشدائد، صار إيمانهم عين اليقين،\n{ وَلَمَّا رَأَى ٱلْمُؤْمِنُونَ ٱلأَحْزَابَ قَالُواْ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ وَصَدَقَ ٱللَّهُ وَرَسُولُهُ وَمَا زَادَهُمْ إِلاَّ إِيمَاناً وَتَسْلِيماً }\n[الأحزاب: 22]. وهنالك تبين نفاق المنافقين، وظهر ما كانوا يضمرون، قال تعالى: { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا... }.\n                                    "
      },
      "originalText": "إِذۡ جَآءُوكُم مِّن فَوۡقِكُمۡ وَمِنۡ أَسۡفَلَ مِنكُمۡ وَإِذۡ زَاغَتِ ٱلۡأَبۡصَٰرُ وَبَلَغَتِ ٱلۡقُلُوبُ ٱلۡحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَا۠ ٠١"
    },
    {
      "number": 3544,
      "text": "هُنَالِكَ ابْتُلِيَ الْمُؤْمِنُونَ وَزُلْزِلُوا زِلْزَالًا شَدِيدًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 11,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 362,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُنَالِكَ ٱبۡتُلِيَ ٱلۡمُؤۡمِنُونَ وَزُلۡزِلُواْ زِلۡزَالٗا شَدِيدٗا ١١\n                                    \n                                    \n                                    يقول الله تعالى مخبراً عن ذلك الحال حين نزلت الأحزاب حول المدينة، والمسلمون محصورون في غاية الجهد والضيق، ورسول الله صلى الله عليه وسلم بين أظهرهم أنهم ابتلوا واختبروا وزلزلوا زلزالاً شديداً، فحينئذ ظهر النفاق، وتكلم الذين في قلوبهم مرض بما في أنفسهم { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ إِلاَّ غُرُوراً } أما المنافق، فنجم نفاقه، والذي في قلبه شبهة أو حسيكة لضعف حاله، فتنفس بما يجده من الوسواس في نفسه لضعف إِيمانه وشدة ماهو فيه من ضيق الحال، وقوم آخرون قالوا كما قال الله تعالى { وَإِذْ قَالَت طَّآئِفَةٌ مِّنْهُمْ يٰأَهْلَ يَثْرِبَ } يعني المدينة. كما جاء في الصحيح \" أريت في المنام دار هجرتكم، أرض بين حرتين، فذهب وهلي أنها هجر، فإِذا هي يثرب \" وفي لفظ المدينة. فأما الحديث الذي رواه الإمام أحمد حدثنا إِبراهيم بن مهدي، حدثنا صالح بن عمر عن يزيد بن أبي زياد عن عبد الرحمن بن أبي ليلى، عن البراء رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" من سمى المدينة يثرب، فليستغفر الله تعالى، إِنما هي طابة هي طابة \" تفرد به الإمام أحمد، وفي إِسناده ضعف، والله أعلم. ويقال إنما كان أصل تسميتها يثرب برجل نزلها من العماليق يقال له يثرب بن عبيد بن مهلاييل بن عوص بن عملاق بن لاوذ بن إِرم بن سام بن نوح، قاله السهيلي. قال وروي عن بعضهم أنه قال إِن لها في التوراة أحد عشر اسماً المدينة وطابة وطيبة والمسكينة والجابرة والمحبة والمحبوبة والقاصمة والمجبورة والعذراء والمرحومة. وعن كعب الأحبار قال إِنا نجد في التوراة يقول الله تعالى للمدينة ياطيبة وياطابة ويامسكينة لا تُقلي الكنوز، أرفع أحاجرك على أحاجر القرى. وقوله { يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ } أي ههنا، يعنون عند النبي صلى الله عليه وسلم في مقام المرابطة، { فَٱرْجِعُواْ } أي إِلى بيوتكم ومنازلكم، { وَيَسْتَأْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ } قال العوفي عن ابن عباس رضي الله عنهما هم بنو حارثة قالوا بيوتنا نخاف عليها السراق، وكذا قال غير واحد، وذكر ابن إِسحاق أن القائل لذلك هو أوس بن قيظي، يعني اعتذروا في الرجوع إِلى منازلهم بأنها عورة، أي ليس دونها ما يحجبها من العدو، فهم يخشون عليها منهم، قال الله تعالى { وَمَا هِىَ بِعَوْرَةٍ } أي ليست كما يزعمون، { إِن يُرِيدُونَ إِلاَّ فِرَاراً } أي هرباً من الزحف.\n                                    ",
        "qortoby": "هُنَالِكَ ٱبۡتُلِيَ ٱلۡمُؤۡمِنُونَ وَزُلۡزِلُواْ زِلۡزَالٗا شَدِيدٗا ١١\n                                    \n                                    \n                                    «هنا» للقريب من المكان. و«هنالك» للبعيد. و«هناك» للوسط. ويشار به إلى الوقت؛ أي عند ذلك اختبر المؤمنون ليتبين المخلص من المنافق. وكان هذا الابتلاء بالخوف والقتال والجوع والحصر والنزال. { وَزُلْزِلُواْ زِلْزَالاً شَدِيداً } أي حرّكوا تحريكاً. قال الزجاج: كل مصدر من المضاعف على فِعلال يجوز فيه الكسر والفتح؛ نحو قلقلته قِلقالا وقَلقالاً، وزلزلوا زِلزالاً وزَلزالاً. والكسر أجود؛ لأن غير المضاعف على الكسر نحو دحرجته دِحراجاً. وقراءة العامة بكسر الزاي. وقرأ عاصم والجحدرِيّ «زَلزالا» بفتح الزاي. قال ابن سلام: أي حرّكوا بالخوف تحريكاً شديداً. وقال الضحاك: هو إزاحتهم عن أماكنهم حتى لم يكن لهم إلا موضع الخندق. وقيل: إنه اضطرابهم عما كانوا عليه؛ فمنهم من اضطرب في نفسه ومنهم من اضطرب في دينه. و«هنالِك» يجوز أن يكون العامل فيه «ابْتُلِيَ» فلا يوقف على «هنالك». ويجوز أن يكون «وَتَظُنُّونَ بِاللَّهِ الظُّنُّونَا» فيوقف على «هنالك».\n\n                                    ",
        "saadi": "هُنَالِكَ ٱبۡتُلِيَ ٱلۡمُؤۡمِنُونَ وَزُلۡزِلُواْ زِلۡزَالٗا شَدِيدٗا ١١\n                                        \n                                        \n                                        \n                                        يذكر تعالى عباده المؤمنين نعمته عليهم، ويحثهم على شكرها، حين جاءتهم جنود أهل مكة والحجاز، من فوقهم، وأهل نجد من أسفل منهم، وتعاقدوا وتعاهدوا على استئصال الرسول والصحابة، وذلك في وقعة الخندق. ومالأتهم [طوائف] اليهود الذين حوالي المدينة، فجاءوا بجنود عظيمة وأمم كثيرة. وخندق رسول اللّه صلى اللّه عليه وسلم على المدينة، فحصروا المدينة، واشتد الأمر، وبلغت القلوب الحناجر، حتى بلغ الظن من كثير من الناس كل مبلغ، لما رأوا من الأسباب المستحكمة، والشدائد الشديدة، فلم يزل الحصار على المدينة مدة طويلة، والأمر كما وصف اللّه: { وَإِذْ زَاغَتِ ٱلأَبْصَارُ وَبَلَغَتِ ٱلْقُلُوبُ ٱلْحَنَاجِرَ وَتَظُنُّونَ بِٱللَّهِ ٱلظُّنُونَاْ } أي: الظنون السيئة، أن اللّه لا ينصر دينه ولا يتم كلمته. { هُنَالِكَ ٱبْتُلِيَ ٱلْمُؤْمِنُونَ } بهذه الفتنة العظيمة { وَزُلْزِلُواْ زِلْزَالاً شَدِيداً } بالخوف والقلق والجوع، ليتبين إيمانهم، ويزيد إيقانهم، فظهر - وللّه الحمد - من إيمانهم وشدة يقينهم، ما فاقوا فيه الأولين والآخرين. وعندما اشتد الكرب، وتفاقمت الشدائد، صار إيمانهم عين اليقين،\n{ وَلَمَّا رَأَى ٱلْمُؤْمِنُونَ ٱلأَحْزَابَ قَالُواْ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ وَصَدَقَ ٱللَّهُ وَرَسُولُهُ وَمَا زَادَهُمْ إِلاَّ إِيمَاناً وَتَسْلِيماً }\n[الأحزاب: 22]. وهنالك تبين نفاق المنافقين، وظهر ما كانوا يضمرون، قال تعالى: { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا... }.\n                                    "
      },
      "originalText": "هُنَالِكَ ٱبۡتُلِيَ ٱلۡمُؤۡمِنُونَ وَزُلۡزِلُواْ زِلۡزَالٗا شَدِيدٗا ١١"
    },
    {
      "number": 3545,
      "text": "وَإِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ إِلَّا غُرُورًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 12,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 362,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورٗا ٢١\n                                    \n                                    \n                                    يقول الله تعالى مخبراً عن ذلك الحال حين نزلت الأحزاب حول المدينة، والمسلمون محصورون في غاية الجهد والضيق، ورسول الله صلى الله عليه وسلم بين أظهرهم أنهم ابتلوا واختبروا وزلزلوا زلزالاً شديداً، فحينئذ ظهر النفاق، وتكلم الذين في قلوبهم مرض بما في أنفسهم { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ إِلاَّ غُرُوراً } أما المنافق، فنجم نفاقه، والذي في قلبه شبهة أو حسيكة لضعف حاله، فتنفس بما يجده من الوسواس في نفسه لضعف إِيمانه وشدة ماهو فيه من ضيق الحال، وقوم آخرون قالوا كما قال الله تعالى { وَإِذْ قَالَت طَّآئِفَةٌ مِّنْهُمْ يٰأَهْلَ يَثْرِبَ } يعني المدينة. كما جاء في الصحيح \" أريت في المنام دار هجرتكم، أرض بين حرتين، فذهب وهلي أنها هجر، فإِذا هي يثرب \" وفي لفظ المدينة. فأما الحديث الذي رواه الإمام أحمد حدثنا إِبراهيم بن مهدي، حدثنا صالح بن عمر عن يزيد بن أبي زياد عن عبد الرحمن بن أبي ليلى، عن البراء رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" من سمى المدينة يثرب، فليستغفر الله تعالى، إِنما هي طابة هي طابة \" تفرد به الإمام أحمد، وفي إِسناده ضعف، والله أعلم. ويقال إنما كان أصل تسميتها يثرب برجل نزلها من العماليق يقال له يثرب بن عبيد بن مهلاييل بن عوص بن عملاق بن لاوذ بن إِرم بن سام بن نوح، قاله السهيلي. قال وروي عن بعضهم أنه قال إِن لها في التوراة أحد عشر اسماً المدينة وطابة وطيبة والمسكينة والجابرة والمحبة والمحبوبة والقاصمة والمجبورة والعذراء والمرحومة. وعن كعب الأحبار قال إِنا نجد في التوراة يقول الله تعالى للمدينة ياطيبة وياطابة ويامسكينة لا تُقلي الكنوز، أرفع أحاجرك على أحاجر القرى. وقوله { يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ } أي ههنا، يعنون عند النبي صلى الله عليه وسلم في مقام المرابطة، { فَٱرْجِعُواْ } أي إِلى بيوتكم ومنازلكم، { وَيَسْتَأْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ } قال العوفي عن ابن عباس رضي الله عنهما هم بنو حارثة قالوا بيوتنا نخاف عليها السراق، وكذا قال غير واحد، وذكر ابن إِسحاق أن القائل لذلك هو أوس بن قيظي، يعني اعتذروا في الرجوع إِلى منازلهم بأنها عورة، أي ليس دونها ما يحجبها من العدو، فهم يخشون عليها منهم، قال الله تعالى { وَمَا هِىَ بِعَوْرَةٍ } أي ليست كما يزعمون، { إِن يُرِيدُونَ إِلاَّ فِرَاراً } أي هرباً من الزحف.\n                                    ",
        "qortoby": "وَإِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورٗا ٢١\n                                    \n                                    \n                                    قوله تعالى: { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ } أي شك ونفاق. { مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ إِلاَّ غُرُوراً } أي باطلاً من القول. وذلك أن طُعْمة بن أُبَيْرِق ومُعَتِّب بن قُشير وجماعة نحو من سبعين رجلاً قالوا يوم الخندق: كيف يَعِدُنا كنوزَ كِسْرى وقَيْصر ولا يستطيع أحدنا أن يتبرّز؟ وإنما قالوا ذلك لمّا فَشَا في أصحاب النبيّ صلى الله عليه وسلم من قوله عند ضرب الصخرة، على ما تقدم في حديث النسائيّ؛ فأنزل الله تعالى هذه الآية.\n\n                                    ",
        "saadi": "وَإِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورٗا ٢١\n                                        \n                                        \n                                        \n                                        \n{ وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ إِلاَّ غُرُوراً }. وهذه عادة المنافق عند الشدة والمحنة، لا يثبت إيمانه، وينظر بعقله القاصر، إلى الحالة القاصرة، ويصدق ظنه. { وَإِذْ قَالَت طَّآئِفَةٌ } من المنافقين، بعد ما جزعوا وقلَّ صبرهم، وصاروا أيضاً من المُخْذَّلين، فلا صبروا بأنفسهم، ولا تركوا الناس من شرهم، فقالت هذه الطائفة: { يٰأَهْلَ يَثْرِبَ } يريدون: \" يا أهل المدينة \" ، فنادوهم باسم الوطن المنبئ [عن التسمية]، فيه إشارة إلى أن الدين والأخوة الإيمانية، ليس له في قلوبهم قدر، وأن الذي حملهم على ذلك، مجرد الخور الطبيعي. { يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ } أي: في موضعكم الذي خرجتم إليه خارج المدينة، وكانوا عسكروا دون الخندق وخارج المدينة، { فَٱرْجِعُواْ } إلى المدينة، فهذه الطائفة تخذل عن الجهاد، وتبين أنهم لا قوة لهم بقتال عدوهم، ويأمرونهم بترك القتال، فهذه الطائفة أشرّ الطوائف وأضرها، وطائفة أخرى دونهم، أصابهم الجبن والجزع، وأحبوا أن ينخزلوا عن الصفوف، فجعلوا يعتذرون بالأعذار الباطلة، وهم الذين قال اللّه فيهم: { وَيَسْتَئْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ } أي: عليها الخطر، ونخاف عليها أن يهجم عليها الأعداء، ونحن غُيَّبٌ عنها، فَأْذَنْ لنا نرجع إليها، فنحرسها، وهم كذبة في ذلك. { وَمَا هِيَ بِعَوْرَةٍ إِن يُرِيدُونَ } أي: ما قصدهم { إِلاَّ فِرَاراً } ولكن جعلوا هذا الكلام وسيلة وعذراً. [لهم] فهؤلاء قلَّ إيمانهم، وليس له ثبوت عند اشتداد المحن. { وَلَوْ دُخِلَتْ عَلَيْهِمْ } المدينة { مِّنْ أَقْطَارِهَا } أي: لو دخل الكفار إليها من نواحيها، واستولوا عليها - لا كان ذلك - { ثُمَّ } سئل هؤلاء { ٱلْفِتْنَةَ } أي: الانقلاب عن دينهم، والرجوع إلى دين المستولين المتغلبين { لآتَوْهَا } أي: لأعطوها مبادرين. { وَمَا تَلَبَّثُواْ بِهَآ إِلاَّ يَسِيراً } أي: ليس لهم منعة ولا تَصلُّبٌ على الدين، بل بمجرد ما تكون الدولة للأعداء، يعطونهم ما طلبوا، ويوافقونهم على كفرهم، هذه حالهم. والحال أنهم قد { عَاهَدُواْ ٱللَّهَ مِن قَبْلُ لاَ يُوَلُّونَ ٱلأَدْبَارَ وَكَانَ عَهْدُ ٱللَّهِ مَسْئُولاً } سيسألهم عن ذلك العهد، فيجدهم قد نقضوه، فما ظنهم إذًاً بربهم ؟\n                                    "
      },
      "originalText": "وَإِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُۥٓ إِلَّا غُرُورٗا ٢١"
    },
    {
      "number": 3546,
      "text": "وَإِذْ قَالَتْ طَائِفَةٌ مِنْهُمْ يَا أَهْلَ يَثْرِبَ لَا مُقَامَ لَكُمْ فَارْجِعُوا ۚ وَيَسْتَأْذِنُ فَرِيقٌ مِنْهُمُ النَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِيَ بِعَوْرَةٍ ۖ إِنْ يُرِيدُونَ إِلَّا فِرَارًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 13,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 362,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ قَالَت طَّآئِفَةٞ مِّنۡهُمۡ يَٰٓأَهۡلَ يَثۡرِبَ لَا مُقَامَ لَكُمۡ فَٱرۡجِعُواْۚ وَيَسۡتَ‍ٔۡذِنُ فَرِيقٞ مِّنۡهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوۡرَةٞ وَمَا هِيَ بِعَوۡرَةٍۖ إِن يُرِيدُونَ إِلَّا فِرَارٗا ٣١\n                                    \n                                    \n                                    يقول الله تعالى مخبراً عن ذلك الحال حين نزلت الأحزاب حول المدينة، والمسلمون محصورون في غاية الجهد والضيق، ورسول الله صلى الله عليه وسلم بين أظهرهم أنهم ابتلوا واختبروا وزلزلوا زلزالاً شديداً، فحينئذ ظهر النفاق، وتكلم الذين في قلوبهم مرض بما في أنفسهم { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ إِلاَّ غُرُوراً } أما المنافق، فنجم نفاقه، والذي في قلبه شبهة أو حسيكة لضعف حاله، فتنفس بما يجده من الوسواس في نفسه لضعف إِيمانه وشدة ماهو فيه من ضيق الحال، وقوم آخرون قالوا كما قال الله تعالى { وَإِذْ قَالَت طَّآئِفَةٌ مِّنْهُمْ يٰأَهْلَ يَثْرِبَ } يعني المدينة. كما جاء في الصحيح \" أريت في المنام دار هجرتكم، أرض بين حرتين، فذهب وهلي أنها هجر، فإِذا هي يثرب \" وفي لفظ المدينة. فأما الحديث الذي رواه الإمام أحمد حدثنا إِبراهيم بن مهدي، حدثنا صالح بن عمر عن يزيد بن أبي زياد عن عبد الرحمن بن أبي ليلى، عن البراء رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" من سمى المدينة يثرب، فليستغفر الله تعالى، إِنما هي طابة هي طابة \" تفرد به الإمام أحمد، وفي إِسناده ضعف، والله أعلم. ويقال إنما كان أصل تسميتها يثرب برجل نزلها من العماليق يقال له يثرب بن عبيد بن مهلاييل بن عوص بن عملاق بن لاوذ بن إِرم بن سام بن نوح، قاله السهيلي. قال وروي عن بعضهم أنه قال إِن لها في التوراة أحد عشر اسماً المدينة وطابة وطيبة والمسكينة والجابرة والمحبة والمحبوبة والقاصمة والمجبورة والعذراء والمرحومة. وعن كعب الأحبار قال إِنا نجد في التوراة يقول الله تعالى للمدينة ياطيبة وياطابة ويامسكينة لا تُقلي الكنوز، أرفع أحاجرك على أحاجر القرى. وقوله { يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ } أي ههنا، يعنون عند النبي صلى الله عليه وسلم في مقام المرابطة، { فَٱرْجِعُواْ } أي إِلى بيوتكم ومنازلكم، { وَيَسْتَأْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ } قال العوفي عن ابن عباس رضي الله عنهما هم بنو حارثة قالوا بيوتنا نخاف عليها السراق، وكذا قال غير واحد، وذكر ابن إِسحاق أن القائل لذلك هو أوس بن قيظي، يعني اعتذروا في الرجوع إِلى منازلهم بأنها عورة، أي ليس دونها ما يحجبها من العدو، فهم يخشون عليها منهم، قال الله تعالى { وَمَا هِىَ بِعَوْرَةٍ } أي ليست كما يزعمون، { إِن يُرِيدُونَ إِلاَّ فِرَاراً } أي هرباً من الزحف.\n                                    ",
        "qortoby": "وَإِذۡ قَالَت طَّآئِفَةٞ مِّنۡهُمۡ يَٰٓأَهۡلَ يَثۡرِبَ لَا مُقَامَ لَكُمۡ فَٱرۡجِعُواْۚ وَيَسۡتَ‍ٔۡذِنُ فَرِيقٞ مِّنۡهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوۡرَةٞ وَمَا هِيَ بِعَوۡرَةٍۖ إِن يُرِيدُونَ إِلَّا فِرَارٗا ٣١\n                                    \n                                    \n                                    قوله تعالى: { وَإِذْ قَالَت طَّآئِفَةٌ مِّنْهُمْ يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ فَٱرْجِعُواْ } الطائفة تقع على الواحد فما فوقه. وعُنِي به هنا أوْس بن قَيْظِيّ والد عَرَابة بن أوس؛ الذي يقول فيه الشماخ :\nإذا ما رايةٌ رُفعت لمَجْد\t   \tتلقّاها عَرابةُ باليمين\nو«يَثْرِب» هي المدينة؛ وسَمّاها رسول الله صلى الله عليه وسلم طَيْبة وطابة. وقال أبو عبيدة: يثرب اسم أرض، والمدينة ناحية منها. السُّهَيْلِيّ: وسميت يثرب لأن الذي نزلها من العماليق اسمه يثرب ابن عميل بن مهلائيل بن عوض بن عملاق بن لاوذ بن إرم. وفي بعض هذه الأسماء اختلاف. وبنو عميل هم الذين سكنوا الجُحْفَة فأجحفت بهم السيول فيها. وبها سميت الجحفة. { لاَ مُقَامَ لَكُمْ } بفتح الميم قراءة العامّة. وقرأ حفص والسُّلمي والجحدريّ وأبو حَيْوَة: بضم الميم؛ يكون مصدراً من أقام يقيم، أي لا إقامة، أو موضعاً يقيمون فيه. ومن فتح فهو اسم مكان؛ أي لا موضع لكم تقيمون فيه. { فَٱرْجِعُواْ } أي إلى منازلكم. أمروهم بالهروب من عسكر النبيّ صلى الله عليه وسلم. قال ابن عباس: قالت اليهود لعبدالله بن أُبَيّ بن سلول وأصحابه من المنافقين: ما الذي يحملكم على قتل أنفسكم بيد أبي سفيان وأصحابه! فارجعوا إلى المدينة فإنا مع القوم فأنتم آمنون.\n\nقوله تعالى: { وَيَسْتَأْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ } في الرجوع إلى منازلهم بالمدينة، وهم بنو حارثة بن الحارث، في قول ابن عباس. وقال يزيد بن رُومان: قال ذلك أوس بن قَيظِيّ عن ملإ من قومه. { يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ } أي سائبة ضائعة ليست بحصينة، وهي مما يلي العدوّ وقيل: مُمْكِنة للسّراق لخلوها من الرجال. يقال: دارٌ مُعْوِرة وذات عَوْرة إذا كان يسهل دخولها. يقال: عَوِر االمكان عَوَراً فهو عَوِر. وبيت عَوِرة. وأعْور فهو مُعوِر. وقيل: عَوِرة ذات عَوْرة. وكل مكان ليس بممنوع ولا مستور فهو عَوْرة؛ قاله الهرَوِيّ. وقرأ ابن عباس وعِكرمة ومجاهد وأبو رجاء العُطارِديّ: «عَوِرة» بكسر الواو؛ يعني قصيرة الجدران فيها خلل. تقول العرب: دار فلانٍ عَوِرة إذا لم تكن حصينة. وقد أعور الفارِس إذا بَدَا فيه خَلَل للضرب والطعن؛ قال الشاعر :\nمتى تَلْقَهم لم تَلْقَ في البيت مُعْوِراً\t   \tولا الضيفَ مفجوعاً ولا الجارَ مُرْمِلاَ\nالجوهريّ: والعَوْرة كل خلل يُتَخَوَّف منه في ثَغر أو حرب. النحاس: يقال أعور المكان إذا تُبُيِّنت فيه عورة، وأعور الفارس إذا تُبُيِّن فيه موضع الخلل. المهدوِيّ: ومن كسر الواو في «عورة» فهو شاذ؛ ومثله قولهم: رجل عوِر؛ أي لا شيء له، وكان القياس أن يُعَلَّ فيقال: عارٍ، كيوم راحٍ، ورجلٍ مالٍ؛ أصلهما روِح وموِل. ثم قال تعالى: { وَمَا هِيَ بِعَوْرَةٍ } تكذيباً لهم ورداً عليهم فيما ذكروه. { إِن يُرِيدُونَ إِلاَّ فِرَاراً } أي ما يريدون إلا الهرب. قيل: من القتل. وقيل: من الدِّين. وحكى النقاش أن هذه الآية نزلت في قبيلتين من الأنصار: بني حارِثة وبني سَلِمة؛ وهَموا أن يتركوا مراكزهم يوم الخندق، وفيهم أنزل الله تعالى :\n{ إِذْ هَمَّتْ طَّآئِفَتَانِ مِنكُمْ أَن تَفْشَلاَ }\n[آل عمران: 122] الآية. فلما نزلت هذه الآية قالوا: واللَّهِ ما ساءنا ما كنا هممنا به؛ إذ اللَّهُ ولِيُّنَا. وقال السدي: الذي استأذنه منهم رجلان من الأنصار من بني حارثة أحدهما: أبو عَرابة بن أوس، والآخر أوْس بن قيْظِيّ. قال الضحاك: ورجع ثمانون رجلاً بغير إذنه.\n                                    ",
        "saadi": "وَإِذۡ قَالَت طَّآئِفَةٞ مِّنۡهُمۡ يَٰٓأَهۡلَ يَثۡرِبَ لَا مُقَامَ لَكُمۡ فَٱرۡجِعُواْۚ وَيَسۡتَ‍ٔۡذِنُ فَرِيقٞ مِّنۡهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوۡرَةٞ وَمَا هِيَ بِعَوۡرَةٍۖ إِن يُرِيدُونَ إِلَّا فِرَارٗا ٣١\n                                        \n                                        \n                                        \n                                        { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ إِلاَّ غُرُوراً }. وهذه عادة المنافق عند الشدة والمحنة، لا يثبت إيمانه، وينظر بعقله القاصر، إلى الحالة القاصرة، ويصدق ظنه. { وَإِذْ قَالَت طَّآئِفَةٌ } من المنافقين، بعد ما جزعوا وقلَّ صبرهم، وصاروا أيضاً من المُخْذَّلين، فلا صبروا بأنفسهم، ولا تركوا الناس من شرهم، فقالت هذه الطائفة: { يٰأَهْلَ يَثْرِبَ } يريدون: \" يا أهل المدينة \" ، فنادوهم باسم الوطن المنبئ [عن التسمية]، فيه إشارة إلى أن الدين والأخوة الإيمانية، ليس له في قلوبهم قدر، وأن الذي حملهم على ذلك، مجرد الخور الطبيعي. { يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ } أي: في موضعكم الذي خرجتم إليه خارج المدينة، وكانوا عسكروا دون الخندق وخارج المدينة، { فَٱرْجِعُواْ } إلى المدينة، فهذه الطائفة تخذل عن الجهاد، وتبين أنهم لا قوة لهم بقتال عدوهم، ويأمرونهم بترك القتال، فهذه الطائفة أشرّ الطوائف وأضرها، وطائفة أخرى دونهم، أصابهم الجبن والجزع، وأحبوا أن ينخزلوا عن الصفوف، فجعلوا يعتذرون بالأعذار الباطلة، وهم الذين قال اللّه فيهم: { وَيَسْتَئْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ } أي: عليها الخطر، ونخاف عليها أن يهجم عليها الأعداء، ونحن غُيَّبٌ عنها، فَأْذَنْ لنا نرجع إليها، فنحرسها، وهم كذبة في ذلك. { وَمَا هِيَ بِعَوْرَةٍ إِن يُرِيدُونَ } أي: ما قصدهم { إِلاَّ فِرَاراً } ولكن جعلوا هذا الكلام وسيلة وعذراً. [لهم] فهؤلاء قلَّ إيمانهم، وليس له ثبوت عند اشتداد المحن. { وَلَوْ دُخِلَتْ عَلَيْهِمْ } المدينة { مِّنْ أَقْطَارِهَا } أي: لو دخل الكفار إليها من نواحيها، واستولوا عليها - لا كان ذلك - { ثُمَّ } سئل هؤلاء { ٱلْفِتْنَةَ } أي: الانقلاب عن دينهم، والرجوع إلى دين المستولين المتغلبين { لآتَوْهَا } أي: لأعطوها مبادرين. { وَمَا تَلَبَّثُواْ بِهَآ إِلاَّ يَسِيراً } أي: ليس لهم منعة ولا تَصلُّبٌ على الدين، بل بمجرد ما تكون الدولة للأعداء، يعطونهم ما طلبوا، ويوافقونهم على كفرهم، هذه حالهم. والحال أنهم قد { عَاهَدُواْ ٱللَّهَ مِن قَبْلُ لاَ يُوَلُّونَ ٱلأَدْبَارَ وَكَانَ عَهْدُ ٱللَّهِ مَسْئُولاً } سيسألهم عن ذلك العهد، فيجدهم قد نقضوه، فما ظنهم إذًاً بربهم ؟\n                                    "
      },
      "originalText": "وَإِذۡ قَالَت طَّآئِفَةٞ مِّنۡهُمۡ يَٰٓأَهۡلَ يَثۡرِبَ لَا مُقَامَ لَكُمۡ فَٱرۡجِعُواْۚ وَيَسۡتَ‍ٔۡذِنُ فَرِيقٞ مِّنۡهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوۡرَةٞ وَمَا هِيَ بِعَوۡرَةٍۖ إِن يُرِيدُونَ إِلَّا فِرَارٗا ٣١"
    },
    {
      "number": 3547,
      "text": "وَلَوْ دُخِلَتْ عَلَيْهِمْ مِنْ أَقْطَارِهَا ثُمَّ سُئِلُوا الْفِتْنَةَ لَآتَوْهَا وَمَا تَلَبَّثُوا بِهَا إِلَّا يَسِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 14,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 362,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ دُخِلَتۡ عَلَيۡهِم مِّنۡ أَقۡطَارِهَا ثُمَّ سُئِلُواْ ٱلۡفِتۡنَةَ لَأٓتَوۡهَا وَمَا تَلَبَّثُواْ بِهَآ إِلَّا يَسِيرٗا ٤١\n                                    \n                                    \n                                    يخبر تعالى عن هؤلاء الذين { مِّنْهُمُ ٱلنَّبِىَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِىَ بِعَوْرَةٍ إِن يُرِيدُونَ إِلاَّ فِرَاراً } أنهم لو دخل عليهم الأعداء من كل جانب من جوانب المدينة، وقطر من أقطارها، ثم سئلوا الفتنة، وهي الدخول في الكفر، لكفروا سريعاً، وهم لا يحافظون على الإيمان، ولا يستمسكون به مع أدنى خوف وفزع، هكذا فسرها قتادة وعبد الرحمن بن زيد وابن جرير، وهذا ذم لهم في غاية الذم، ثم قال تعالى يذكرهم بما كانوا عاهدوا الله من قبل هذا الخوف أن لا يولوا الأدبار، ولا يفرون من الزحف، { وَكَانَ عَهْدُ مَسْئُولاً } أي وإِن الله تعالى سيسألهم عن ذلك العهد، لا بد من ذلك، ثم أخبرهم أن فرارهم ذلك لا يؤخر آجالهم، ولا يطول أعمارهم، بل ربما كان ذلك سبباً في تعجيل أخذهم غرة، ولهذا قال تعالى { وَإِذاً لاَّ تُمَتَّعُونَ إِلاَّ قَلِيلاً } أي بعد هربكم وفراركم\n{ قُلْ مَتَـٰعُ ٱلدُّنْيَا قَلِيلٌ وَٱلأَخِرَةُ خَيْرٌ لِّمَنِ ٱتَّقَىٰ }\nالنساء 77 ثم قال تعالى { قُلْ مَن ذَا ٱلَّذِى يَعْصِمُكُمْ مِّنَ ٱللَّهِ }؟ أي يمنعكم { إِنْ أَرَادَ بِكُمْ سُوۤءاً أَوْ أَرَادَ بِكُمْ رَحْمَةً وَلاَ يَجِدُونَ لَهُمْ مِّن دُونِ ٱللَّهِ وَلِيّاً وَلاَ نَصِيراً } أي ليس لهم ولا لغيرهم من دون الله مجير ولا مغيث.\n                                    ",
        "qortoby": "وَلَوۡ دُخِلَتۡ عَلَيۡهِم مِّنۡ أَقۡطَارِهَا ثُمَّ سُئِلُواْ ٱلۡفِتۡنَةَ لَأٓتَوۡهَا وَمَا تَلَبَّثُواْ بِهَآ إِلَّا يَسِيرٗا ٤١\n                                    \n                                    \n                                    قوله تعالى: { وَلَوْ دُخِلَتْ عَلَيْهِمْ مِّنْ أَقْطَارِهَا } وهي البيوت أو المدينة؛ أي من نواحيها وجوانبها، الواحد قُطْر، وهو الجانب والناحية. وكذلك القُتْر لغة في القطر. { ثُمَّ سُئِلُواْ ٱلْفِتْنَةَ لآتَوْهَا } أي لجاؤوها؛ هذا على قراءة نافع وابن كثير بالقصر. وقرأ الباقون بالمدّ؛ أي لأعطوها من أنفسهم، وهو اختيار أبي عبيد وأبي حاتم. وقد جاء في الحديث: أن أصحاب النبيّ صلى الله عليه وسلم كانوا يعذَّبون في الله ويُسألون الشرك، فكلٌّ أعطى ما سألوه إلا بلالاً. وفيه دليل على قراءة المدّ، من الإعطاء. ويدل على قراءة القصر قوله: { وَلَقَدْ كَانُواْ عَاهَدُواْ ٱللَّهَ مِن قَبْلُ لاَ يُوَلُّونَ ٱلأَدْبَارَ }؛ فهذا يدل على «لأَتَوْهَا» مقصوراً. وفي «الفتنة» هنا وجهان: أحدهما سُئلوا القتال في العصبية لأسرعوا إليه؛ قاله الضحاك. الثاني: ثم سئلوا الشرك لأجابوا إليه مسرعين؛ قاله الحسن. { وَمَا تَلَبَّثُواْ بِهَآ } أي بالمدينة بعد إعطاء الكفر إلا قليلاً حتى يهلكوا؛ قاله السّدِّي والقُتَيبِيّ والحسن والفراء. وقال أكثر المفسرين: أي وما احتبسوا عن فتنة الشرك إلا قليلاً ولأجابوا بالشرك مسرعين؛ وذلك لضعف نياتهم ولفرط نفاقهم؛ فلو اختلطت بهم الأحزاب لأظهروا الكفر.\n                                    ",
        "saadi": "وَلَوۡ دُخِلَتۡ عَلَيۡهِم مِّنۡ أَقۡطَارِهَا ثُمَّ سُئِلُواْ ٱلۡفِتۡنَةَ لَأٓتَوۡهَا وَمَا تَلَبَّثُواْ بِهَآ إِلَّا يَسِيرٗا ٤١\n                                        \n                                        \n                                        \n                                        { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ إِلاَّ غُرُوراً }. وهذه عادة المنافق عند الشدة والمحنة، لا يثبت إيمانه، وينظر بعقله القاصر، إلى الحالة القاصرة، ويصدق ظنه. { وَإِذْ قَالَت طَّآئِفَةٌ } من المنافقين، بعد ما جزعوا وقلَّ صبرهم، وصاروا أيضاً من المُخْذَّلين، فلا صبروا بأنفسهم، ولا تركوا الناس من شرهم، فقالت هذه الطائفة: { يٰأَهْلَ يَثْرِبَ } يريدون: \" يا أهل المدينة \" ، فنادوهم باسم الوطن المنبئ [عن التسمية]، فيه إشارة إلى أن الدين والأخوة الإيمانية، ليس له في قلوبهم قدر، وأن الذي حملهم على ذلك، مجرد الخور الطبيعي. { يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ } أي: في موضعكم الذي خرجتم إليه خارج المدينة، وكانوا عسكروا دون الخندق وخارج المدينة، { فَٱرْجِعُواْ } إلى المدينة، فهذه الطائفة تخذل عن الجهاد، وتبين أنهم لا قوة لهم بقتال عدوهم، ويأمرونهم بترك القتال، فهذه الطائفة أشرّ الطوائف وأضرها، وطائفة أخرى دونهم، أصابهم الجبن والجزع، وأحبوا أن ينخزلوا عن الصفوف، فجعلوا يعتذرون بالأعذار الباطلة، وهم الذين قال اللّه فيهم: { وَيَسْتَئْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ } أي: عليها الخطر، ونخاف عليها أن يهجم عليها الأعداء، ونحن غُيَّبٌ عنها، فَأْذَنْ لنا نرجع إليها، فنحرسها، وهم كذبة في ذلك. { وَمَا هِيَ بِعَوْرَةٍ إِن يُرِيدُونَ } أي: ما قصدهم { إِلاَّ فِرَاراً } ولكن جعلوا هذا الكلام وسيلة وعذراً. [لهم] فهؤلاء قلَّ إيمانهم، وليس له ثبوت عند اشتداد المحن. { وَلَوْ دُخِلَتْ عَلَيْهِمْ } المدينة { مِّنْ أَقْطَارِهَا } أي: لو دخل الكفار إليها من نواحيها، واستولوا عليها - لا كان ذلك - { ثُمَّ } سئل هؤلاء { ٱلْفِتْنَةَ } أي: الانقلاب عن دينهم، والرجوع إلى دين المستولين المتغلبين { لآتَوْهَا } أي: لأعطوها مبادرين. { وَمَا تَلَبَّثُواْ بِهَآ إِلاَّ يَسِيراً } أي: ليس لهم منعة ولا تَصلُّبٌ على الدين، بل بمجرد ما تكون الدولة للأعداء، يعطونهم ما طلبوا، ويوافقونهم على كفرهم، هذه حالهم. والحال أنهم قد { عَاهَدُواْ ٱللَّهَ مِن قَبْلُ لاَ يُوَلُّونَ ٱلأَدْبَارَ وَكَانَ عَهْدُ ٱللَّهِ مَسْئُولاً } سيسألهم عن ذلك العهد، فيجدهم قد نقضوه، فما ظنهم إذًاً بربهم ؟\n                                    "
      },
      "originalText": "وَلَوۡ دُخِلَتۡ عَلَيۡهِم مِّنۡ أَقۡطَارِهَا ثُمَّ سُئِلُواْ ٱلۡفِتۡنَةَ لَأٓتَوۡهَا وَمَا تَلَبَّثُواْ بِهَآ إِلَّا يَسِيرٗا ٤١"
    },
    {
      "number": 3548,
      "text": "وَلَقَدْ كَانُوا عَاهَدُوا اللَّهَ مِنْ قَبْلُ لَا يُوَلُّونَ الْأَدْبَارَ ۚ وَكَانَ عَهْدُ اللَّهِ مَسْئُولًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 15,
      "juz": 21,
      "manzil": 5,
      "page": 419,
      "ruku": 362,
      "hizbQuarter": 167,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ كَانُواْ عَٰهَدُواْ ٱللَّهَ مِن قَبۡلُ لَا يُوَلُّونَ ٱلۡأَدۡبَٰرَۚ وَكَانَ عَهۡدُ ٱللَّهِ مَسۡ‍ُٔولٗا ٥١\n                                    \n                                    \n                                    يخبر تعالى عن هؤلاء الذين { مِّنْهُمُ ٱلنَّبِىَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِىَ بِعَوْرَةٍ إِن يُرِيدُونَ إِلاَّ فِرَاراً } أنهم لو دخل عليهم الأعداء من كل جانب من جوانب المدينة، وقطر من أقطارها، ثم سئلوا الفتنة، وهي الدخول في الكفر، لكفروا سريعاً، وهم لا يحافظون على الإيمان، ولا يستمسكون به مع أدنى خوف وفزع، هكذا فسرها قتادة وعبد الرحمن بن زيد وابن جرير، وهذا ذم لهم في غاية الذم، ثم قال تعالى يذكرهم بما كانوا عاهدوا الله من قبل هذا الخوف أن لا يولوا الأدبار، ولا يفرون من الزحف، { وَكَانَ عَهْدُ مَسْئُولاً } أي وإِن الله تعالى سيسألهم عن ذلك العهد، لا بد من ذلك، ثم أخبرهم أن فرارهم ذلك لا يؤخر آجالهم، ولا يطول أعمارهم، بل ربما كان ذلك سبباً في تعجيل أخذهم غرة، ولهذا قال تعالى { وَإِذاً لاَّ تُمَتَّعُونَ إِلاَّ قَلِيلاً } أي بعد هربكم وفراركم\n{ قُلْ مَتَـٰعُ ٱلدُّنْيَا قَلِيلٌ وَٱلأَخِرَةُ خَيْرٌ لِّمَنِ ٱتَّقَىٰ }\nالنساء 77 ثم قال تعالى { قُلْ مَن ذَا ٱلَّذِى يَعْصِمُكُمْ مِّنَ ٱللَّهِ }؟ أي يمنعكم { إِنْ أَرَادَ بِكُمْ سُوۤءاً أَوْ أَرَادَ بِكُمْ رَحْمَةً وَلاَ يَجِدُونَ لَهُمْ مِّن دُونِ ٱللَّهِ وَلِيّاً وَلاَ نَصِيراً } أي ليس لهم ولا لغيرهم من دون الله مجير ولا مغيث.\n                                    ",
        "qortoby": "وَلَقَدۡ كَانُواْ عَٰهَدُواْ ٱللَّهَ مِن قَبۡلُ لَا يُوَلُّونَ ٱلۡأَدۡبَٰرَۚ وَكَانَ عَهۡدُ ٱللَّهِ مَسۡ‍ُٔولٗا ٥١\n                                    \n                                    \n                                    قوله تعالى: { وَلَقَدْ كَانُواْ عَاهَدُواْ ٱللَّهَ مِن قَبْلُ } أي من قبل غزوة الخندق وبعد بدر. قال قتادة: وذلك أنهم غابوا عن بدر ورأوا ما أعطى الله أهل بدر من الكرامة والنصر، فقالوا لئن أشهدنا الله قتالاً لنقاتلنّ. وقال يزيد بن رُومان: هم بنو حارثة، هَمُّوا يوم أُحُد أن يفشلوا مع بني سَلِمة، فلما نزل فيهم ما نزل عاهدوا الله ألا يعودوا لمثلها فذكر الله لهم الذي أعطوه من أنفسهم. { وَكَانَ عَهْدُ ٱللَّهِ مَسْئُولاً } أي مسؤولاً عنه. قال مقاتل والكَلْبي :\n                                     \" هم سبعون رجلاً بايعوا النبيّ صلى الله عليه وسلم ليلة العقبة وقالوا: اشترط لنفسك ولربّك ما شئت. فقال: «أشترط لربي أن تعبدوه ولا تشركوا به شيئاً وأشترط لنفسي أن تمنعوني مما تمنعون منه نساءكم وأموالكم وأولادكم» فقالوا: فما لنا إذا فعلنا ذلك يا نبيّ الله؟ قال: «لكم النصر في الدنيا والجنة في الآخرة » \"\n                                      فذلك قوله تعالى: { وَكَانَ عَهْدُ ٱللَّهِ مَسْئُولاً } أي أن الله ليسألهم عنه يوم القيامة.\n                                    ",
        "saadi": "وَلَقَدۡ كَانُواْ عَٰهَدُواْ ٱللَّهَ مِن قَبۡلُ لَا يُوَلُّونَ ٱلۡأَدۡبَٰرَۚ وَكَانَ عَهۡدُ ٱللَّهِ مَسۡ‍ُٔولٗا ٥١\n                                        \n                                        \n                                        \n                                        { وَإِذْ يَقُولُ ٱلْمُنَافِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ مَّا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ إِلاَّ غُرُوراً }. وهذه عادة المنافق عند الشدة والمحنة، لا يثبت إيمانه، وينظر بعقله القاصر، إلى الحالة القاصرة، ويصدق ظنه. { وَإِذْ قَالَت طَّآئِفَةٌ } من المنافقين، بعد ما جزعوا وقلَّ صبرهم، وصاروا أيضاً من المُخْذَّلين، فلا صبروا بأنفسهم، ولا تركوا الناس من شرهم، فقالت هذه الطائفة: { يٰأَهْلَ يَثْرِبَ } يريدون: \" يا أهل المدينة \" ، فنادوهم باسم الوطن المنبئ [عن التسمية]، فيه إشارة إلى أن الدين والأخوة الإيمانية، ليس له في قلوبهم قدر، وأن الذي حملهم على ذلك، مجرد الخور الطبيعي. { يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ } أي: في موضعكم الذي خرجتم إليه خارج المدينة، وكانوا عسكروا دون الخندق وخارج المدينة، { فَٱرْجِعُواْ } إلى المدينة، فهذه الطائفة تخذل عن الجهاد، وتبين أنهم لا قوة لهم بقتال عدوهم، ويأمرونهم بترك القتال، فهذه الطائفة أشرّ الطوائف وأضرها، وطائفة أخرى دونهم، أصابهم الجبن والجزع، وأحبوا أن ينخزلوا عن الصفوف، فجعلوا يعتذرون بالأعذار الباطلة، وهم الذين قال اللّه فيهم: { وَيَسْتَئْذِنُ فَرِيقٌ مِّنْهُمُ ٱلنَّبِيَّ يَقُولُونَ إِنَّ بُيُوتَنَا عَوْرَةٌ } أي: عليها الخطر، ونخاف عليها أن يهجم عليها الأعداء، ونحن غُيَّبٌ عنها، فَأْذَنْ لنا نرجع إليها، فنحرسها، وهم كذبة في ذلك. { وَمَا هِيَ بِعَوْرَةٍ إِن يُرِيدُونَ } أي: ما قصدهم { إِلاَّ فِرَاراً } ولكن جعلوا هذا الكلام وسيلة وعذراً. [لهم] فهؤلاء قلَّ إيمانهم، وليس له ثبوت عند اشتداد المحن. { وَلَوْ دُخِلَتْ عَلَيْهِمْ } المدينة { مِّنْ أَقْطَارِهَا } أي: لو دخل الكفار إليها من نواحيها، واستولوا عليها - لا كان ذلك - { ثُمَّ } سئل هؤلاء { ٱلْفِتْنَةَ } أي: الانقلاب عن دينهم، والرجوع إلى دين المستولين المتغلبين { لآتَوْهَا } أي: لأعطوها مبادرين. { وَمَا تَلَبَّثُواْ بِهَآ إِلاَّ يَسِيراً } أي: ليس لهم منعة ولا تَصلُّبٌ على الدين، بل بمجرد ما تكون الدولة للأعداء، يعطونهم ما طلبوا، ويوافقونهم على كفرهم، هذه حالهم. والحال أنهم قد { عَاهَدُواْ ٱللَّهَ مِن قَبْلُ لاَ يُوَلُّونَ ٱلأَدْبَارَ وَكَانَ عَهْدُ ٱللَّهِ مَسْئُولاً } سيسألهم عن ذلك العهد، فيجدهم قد نقضوه، فما ظنهم إذًاً بربهم ؟\n                                    "
      },
      "originalText": "وَلَقَدۡ كَانُواْ عَٰهَدُواْ ٱللَّهَ مِن قَبۡلُ لَا يُوَلُّونَ ٱلۡأَدۡبَٰرَۚ وَكَانَ عَهۡدُ ٱللَّهِ مَسۡ‍ُٔولٗا ٥١"
    }
  ]
}