{
  "number": 42,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 260,
      "text": "۞ تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۘ مِنْهُمْ مَنْ كَلَّمَ اللَّهُ ۖ وَرَفَعَ بَعْضَهُمْ دَرَجَاتٍ ۚ وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ ۗ وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلَ الَّذِينَ مِنْ بَعْدِهِمْ مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ وَلَٰكِنِ اخْتَلَفُوا فَمِنْهُمْ مَنْ آمَنَ وَمِنْهُمْ مَنْ كَفَرَ ۚ وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلُوا وَلَٰكِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 253,
      "juz": 3,
      "manzil": 1,
      "page": 42,
      "ruku": 34,
      "hizbQuarter": 17,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تِلۡكَ ٱلرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۘ مِّنۡهُم مَّن كَلَّمَ ٱللَّهُۖ وَرَفَعَ بَعۡضَهُمۡ دَرَجَٰتٖۚ وَءَاتَيۡنَا عِيسَى ٱبۡنَ مَرۡيَمَ ٱلۡبَيِّنَٰتِ وَأَيَّدۡنَٰهُ بِرُوحِ ٱلۡقُدُسِۗ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلَ ٱلَّذِينَ مِنۢ بَعۡدِهِم مِّنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ وَلَٰكِنِ ٱخۡتَلَفُواْ فَمِنۡهُم مَّنۡ ءَامَنَ وَمِنۡهُم مَّن كَفَرَۚ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلُواْ وَلَٰكِنَّ ٱللَّهَ يَفۡعَلُ مَا يُرِيدُ ٣٥٢\n                                        \n                                        \n                                        يخبر تعالى أنه فضل بعض الرسل على بعض كما قال : ( ولقد فضلنا بعض النبيين على بعض وآتينا داود زبورا ) [ الإسراء : 55 ] وقال هاهنا : ( تلك الرسل فضلنا بعضهم على بعض منهم من كلم الله ) يعني : موسى ومحمدا صلى الله عليه وسلم وكذلك آدم ، كما ورد به الحديث المروي في صحيح ابن حبان عن أبي ذر رضي الله عنه ( ورفع بعضهم درجات ) كما ثبت في حديث الإسراء حين رأى النبي صلى الله عليه وسلم الأنبياء في السماوات بحسب تفاوت منازلهم عند الله عز وجل .\nفإن قيل : فما الجمع بين هذه الآية وبين الحديث الثابت في الصحيحين عن أبي هريرة قال : استب رجل من المسلمين ورجل من اليهود فقال اليهودي في قسم يقسمه : لا والذي اصطفى موسى على العالمين . فرفع المسلم يده فلطم بها وجه اليهودي فقال : أي خبيث وعلى محمد صلى الله عليه وسلم ! فجاء اليهودي إلى رسول الله صلى الله عليه وسلم فاشتكى على المسلم ، فقال رسول الله صلى الله عليه وسلم : \" لا تفضلوني على الأنبياء ؛ فإن الناس يصعقون يوم القيامة فأكون أول من يفيق فأجد موسى باطشا بقائمة العرش فلا أدري أفاق قبلي أم جوزي بصعقة الطور ؟ فلا تفضلوني على الأنبياء \" وفي رواية : \" لا تفضلوا بين الأنبياء \" .\nفالجواب من وجوه :\nأحدها : أن هذا كان قبل أن يعلم بالتفضيل ، وفي هذا نظر .\nالثاني : أن هذا قاله من باب الهضم والتواضع .\nالثالث : أن هذا نهي عن التفضيل في مثل هذه الحال التي تحاكموا فيها عند التخاصم والتشاجر .\nالرابع : لا تفضلوا بمجرد الآراء والعصبية .\nالخامس : ليس مقام التفضيل إليكم وإنما هو إلى الله عز وجل ، وعليكم الانقياد والتسليم له والإيمان به .\nوقوله : ( وآتينا عيسى ابن مريم البينات ) أي : الحجج والدلائل القاطعات على صحة ما جاء بني إسرائيل به ، من أنه عبد الله ورسوله إليهم ( وأيدناه بروح القدس ) يعني : أن الله أيده بجبريل عليه السلام ثم قال تعالى : ( ولو شاء الله ما اقتتل الذين من بعدهم من بعد ما جاءتهم البينات ولكن اختلفوا فمنهم من آمن ومنهم من كفر ولو شاء الله ما اقتتلوا ) أي : بل كل ذلك عن قضاء الله وقدره ; ولهذا قال : ( ولكن الله يفعل ما يريد )\n                                    ",
        "qortoby": "تِلۡكَ ٱلرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۘ مِّنۡهُم مَّن كَلَّمَ ٱللَّهُۖ وَرَفَعَ بَعۡضَهُمۡ دَرَجَٰتٖۚ وَءَاتَيۡنَا عِيسَى ٱبۡنَ مَرۡيَمَ ٱلۡبَيِّنَٰتِ وَأَيَّدۡنَٰهُ بِرُوحِ ٱلۡقُدُسِۗ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلَ ٱلَّذِينَ مِنۢ بَعۡدِهِم مِّنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ وَلَٰكِنِ ٱخۡتَلَفُواْ فَمِنۡهُم مَّنۡ ءَامَنَ وَمِنۡهُم مَّن كَفَرَۚ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلُواْ وَلَٰكِنَّ ٱللَّهَ يَفۡعَلُ مَا يُرِيدُ ٣٥٢\n                                        \n                                        \n                                        تلك الرسل فضلنا بعضهم على بعض منهم من كلم الله ورفع بعضهم درجات وآتينا عيسى ابن مريم البينات وأيدناه بروح القدس ولو شاء الله ما اقتتل الذين من بعدهم من بعد ما جاءتهم البينات ولكن اختلفوا فمنهم من آمن ومنهم من كفر ولو شاء الله ما اقتتلوا ولكن الله يفعل ما يريد\nقوله تعالى : تلك الرسل قال : ( تلك ) ولم يقل : ذلك مراعاة لتأنيث لفظ الجماعة ، وهي رفع بالابتداء . و ( الرسل ) نعته ، وخبر الابتداء الجملة . وقيل : ( الرسل ) عطف بيان ، و ( فضلنا ) الخبر . وهذه آية مشكلة ، والأحاديث ثابتة بأن النبي صلى الله عليه وسلم قال : لا تخيروا بين الأنبياء و لا تفضلوا بين أنبياء الله رواها الأئمة الثقات ، أي لا تقولوا : فلان خير من فلان ، ولا فلان أفضل من فلان . يقال : خير فلان بين فلان وفلان ، وفضل ( مشددا ) إذا قال ذلك . وقد اختلف العلماء في تأويل هذا المعنى ، فقال قوم : إن هذا كان قبل أن يوحى إليه بالتفضيل ، وقبل أن يعلم أنه سيد ولد آدم ، وإن القرآن ناسخ للمنع من التفضيل . وقال ابن قتيبة : إنما أراد بقوله : ( أنا سيد ولد آدم يوم القيامة ) ؛ لأنه الشافع يومئذ وله لواء الحمد والحوض ، وأراد بقوله : \" لا تخيروني على موسى \" على طريق التواضع ، كما قال أبو بكر : وليتكم ولست بخيركم . وكذلك معنى قوله : لا يقل أحد أنا خير من يونس بن متى على معنى التواضع . وفي قوله تعالى : ولا تكن كصاحب الحوت ما يدل على أن رسول الله صلى الله عليه وسلم أفضل منه ؛ لأن الله تعالى يقول : ولا تكن مثله ، فدل على أن قوله : ( لا تفضلوني عليه ) من طريق التواضع . ويجوز أن يريد لا تفضلوني عليه في العمل فلعله أفضل عملا مني ، ولا في البلوى والامتحان فإنه أعظم محنة مني . وليس ما أعطاه الله لنبينا محمد صلى الله عليه وسلم من السؤدد والفضل يوم القيامة على جميع الأنبياء والرسل بعمله بل بتفضيل الله إياه واختصاصه له ، وهذا التأويل اختاره المهلب . ومنهم من قال : إنما نهى عن الخوض في ذلك ؛ لأن الخوض في ذلك ذريعة إلى الجدال وذلك يؤدي إلى أن يذكر منهم ما لا ينبغي أن يذكر ويقل احترامهم عند المماراة . قال شيخنا : فلا يقال : النبي أفضل من الأنبياء كلهم ولا من فلان ولا خير ، كما هو ظاهر النهي لما يتوهم من النقص في المفضول ؛ لأن النهي اقتضى منع إطلاق اللفظ لا منع اعتقاد ذلك المعنى ، فإن الله تعالى أخبر بأن الرسل متفاضلون ، فلا تقول : نبينا خير من الأنبياء ولا من فلان النبي اجتنابا لما نهي عنه وتأدبا به وعملا باعتقاد ما تضمنه القرآن من التفضيل ، والله بحقائق الأمور عليم .\nقلت : وأحسن من هذا قول من قال : إن المنع من التفضيل إنما هو من جهة النبوة التي هي خصلة واحدة لا تفاضل فيها ، وإنما التفضيل في زيادة الأحوال والخصوص والكرامات والألطاف والمعجزات المتباينات ، وأما النبوة في نفسها فلا تتفاضل وإنما تتفاضل بأمور أخر زائدة عليها ، ولذلك منهم رسل وأولو عزم ، ومنهم من اتخذ خليلا ، ومنهم من كلم الله ورفع بعضهم درجات ، قال الله تعالى : ولقد فضلنا بعض النبيين على بعض وآتينا داود زبورا ، وقال : تلك الرسل فضلنا بعضهم على بعض .\nقلت : وهذا قول حسن ، فإنه جمع بين الآي والأحاديث من غير نسخ ، والقول بتفضيل بعضهم على بعض إنما هو بما منح من الفضائل وأعطي من الوسائل ، وقد أشار ابن عباس إلى هذا فقال : إن الله فضل محمدا على الأنبياء وعلى أهل السماء ، فقالوا : بم يا ابن عباس فضله على أهل السماء ؟ فقال : إن الله تعالى قال : ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين . وقال لمحمد صلى الله عليه وسلم : إنا فتحنا لك فتحا مبينا . ليغفر لك الله ما تقدم من ذنبك وما تأخر . قالوا : فما فضله على الأنبياء ؟ . قال : قال الله تعالى : وما أرسلنا من رسول إلا بلسان قومه ليبين لهم ، وقال الله عز وجل لمحمد صلى الله عليه وسلم : وما أرسلناك إلا كافة للناس فأرسله إلى الجن والإنس ، ذكره أبو محمد الدارمي في مسنده . وقال أبو هريرة : خير بني آدم : نوح وإبراهيم وموسى ومحمد صلى الله عليه وسلم ، وهم أولو العزم من الرسل ، وهذا نص من ابن عباس وأبي هريرة في التعيين ، ومعلوم أن من أرسل أفضل ممن لم يرسل ، فإن من أرسل فضل على غيره بالرسالة واستووا في النبوة إلى ما يلقاه الرسل من تكذيب أممهم وقتلهم إياهم ، وهذا مما لا خفاء فيه ، إلا أن ابن عطية أبا محمد عبد الحق قال : إن القرآن يقتضي التفضيل ، وذلك في الجملة دون تعيين أحد مفضول ، وكذلك هي الأحاديث ، ولذلك قال النبي صلى الله عليه وسلم : أنا أكرم ولد آدم على ربي وقال : أنا سيد ولد آدم ولم يعين ، وقال عليه السلام : لا ينبغي لأحد أن يقول أنا خير من يونس بن متى وقال : لا تفضلوني على موسى . وقال ابن عطية : وفي هذا نهي شديد عن تعيين المفضول ؛ لأن يونس عليه السلام كان شابا وتفسخ تحت أعباء النبوة . فإذا كان التوقيف لمحمد صلى الله عليه وسلم فغيره أحرى .\nقلت : ما اخترناه أولى إن شاء الله تعالى ، فإن الله تعالى لما أخبر أنه فضل بعضهم على بعض جعل يبين بعض المتفاضلين ويذكر الأحوال التي فضلوا بها فقال : منهم من كلم الله ورفع بعضهم درجات وآتينا عيسى ابن مريم البينات ، وقال وآتينا داود زبورا ، وقال تعالى : وآتيناه الإنجيل ، ولقد آتينا موسى وهارون الفرقان وضياء وذكرا للمتقين ، وقال تعالى : ولقد آتينا داود وسليمان علما ، وقال : وإذ أخذنا من النبيين ميثاقهم ومنك ومن نوح . فعم ثم خص وبدأ بمحمد صلى الله عليه وسلم ، وهذا ظاهر .\nقلت : وهكذا القول في الصحابة إن شاء الله تعالى ، اشتركوا في الصحبة ثم تباينوا في الفضائل بما منحهم الله من المواهب والوسائل ، فهم متفاضلون بتلك مع أن الكل شملتهم الصحبة والعدالة والثناء عليهم ، وحسبك بقوله الحق : محمد رسول الله والذين معه أشداء على الكفار إلى آخر السورة . وقال : وألزمهم كلمة التقوى وكانوا أحق بها وأهلها ثم قال : لا يستوي منكم من أنفق من قبل الفتح وقاتل ( الحديد : 10 ) وقال : لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة فعم وخص ، ونفى عنهم الشين والنقص ، رضي الله عنهم أجمعين ونفعنا بحبهم آمين .\nقوله تعالى : منهم من كلم الله المكلم موسى عليه السلام ، وقد سئل رسول الله صلى الله عليه وسلم عن آدم أنبي مرسل هو ؟ فقال : نعم نبي مكلم . قال ابن عطية : وقد تأول بعض الناس أن تكليم آدم كان في الجنة ، فعلى هذا تبقى خاصية موسى . وحذفت الهاء لطول الاسم ، والمعنى من كلمه الله .\nقوله تعالى : ورفع بعضهم درجات قال النحاس : ( بعضهم ) هنا على قول ابن عباس والشعبي ومجاهد محمد صلى الله عليه وسلم ، قال صلى الله عليه وسلم : بعثت إلى الأحمر والأسود وجعلت لي الأرض مسجدا وطهورا ونصرت بالرعب مسيرة شهر وأحلت لي الغنائم وأعطيت الشفاعة . ومن ذلك القرآن وانشقاق القمر وتكليمه الشجر وإطعامه الطعام خلقا عظيما من تميرات ودرور شاة أم معبد بعد جفاف . وقال ابن عطية معناه ، وزاد : وهو أعظم الناس أمة وختم به النبيون إلى غير ذلك من الخلق العظيم الذي أعطاه الله . ويحتمل اللفظ أن يراد به محمد صلى الله عليه وسلم وغيره ممن عظمت آياته ، ويكون الكلام تأكيدا . ويحتمل أن يريد به رفع إدريس المكان العلي ، ومراتب الأنبياء في السماء كما في حديث الإسراء ، وسيأتي .\nوبينات عيسى هي إحياء الموتى وإبراء الأكمه والأبرص وخلق الطير من الطين كما نص عليه في التنزيل . ( وأيدناه ) قويناه . ( بروح القدس ) جبريل عليه السلام ، وقد تقدم .\nقوله تعالى : ولو شاء الله ما اقتتل الذين من بعدهم أي من بعد الرسل . وقيل : الضمير لموسى وعيسى ، والاثنان جمع . وقيل : من بعد جميع الرسل ، وهو ظاهر اللفظ . وقيل : إن القتال إنما وقع من الذين جاءوا بعدهم وليس كذلك المعنى ، بل المراد ما اقتتل الناس بعد كل نبي ، وهذا كما تقول : اشتريت خيلا ثم بعتها ، فجائز لك هذه العبارة وأنت إنما اشتريت فرسا وبعته ثم آخر وبعته ثم آخر وبعته ، وكذلك هذه النوازل إنما اختلف الناس بعد كل نبي فمنهم من آمن ومنهم من كفر بغيا وحسدا وعلى حطام الدنيا ، وذلك كله بقضاء وقدر وإرادة من الله تعالى ، ولو شاء خلاف ذلك لكان ولكنه المستأثر بسر الحكمة في ذلك الفعل لما يريد . وكسرت النون من ( ولكن اختلفوا ) لالتقاء الساكنين ، ويجوز حذفها في غير القرآن ، وأنشد سيبويه :\nفلست بآتيه ولا أستطيعه ولاك اسقني إن كان ماؤك ذا فضل\nفمنهم من آمن ومنهم من كفر \" من \" في موقع رفع بالابتداء والصفة .\n                                    ",
        "saadi": "تِلۡكَ ٱلرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۘ مِّنۡهُم مَّن كَلَّمَ ٱللَّهُۖ وَرَفَعَ بَعۡضَهُمۡ دَرَجَٰتٖۚ وَءَاتَيۡنَا عِيسَى ٱبۡنَ مَرۡيَمَ ٱلۡبَيِّنَٰتِ وَأَيَّدۡنَٰهُ بِرُوحِ ٱلۡقُدُسِۗ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلَ ٱلَّذِينَ مِنۢ بَعۡدِهِم مِّنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ وَلَٰكِنِ ٱخۡتَلَفُواْ فَمِنۡهُم مَّنۡ ءَامَنَ وَمِنۡهُم مَّن كَفَرَۚ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلُواْ وَلَٰكِنَّ ٱللَّهَ يَفۡعَلُ مَا يُرِيدُ ٣٥٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه فضل بعض الرسل على بعض بما خصهم من بين سائر الناس بإيحائه وإرسالهم إلى الناس، ودعائهم الخلق إلى الله، ثم فضل بعضهم على بعض بما أودع فيهم من الأوصاف الحميدة والأفعال السديدة والنفع العام، فمنهم من كلمه الله كموسى بن عمران خصه بالكلام، ومنهم من رفعه على سائرهم درجات كنبينا صلى الله عليه وسلم الذي اجتمع فيه من الفضائل ما تفرق في غيره، وجمع الله له من المناقب ما فاق به الأولين والآخرين { وآتينا عيسى ابن مريم البينات } الدالات على نبوته وأنه عبد الله ورسوله وكلمته ألقاها إلى مريم وروح منه { وأيدناه بروح القدس } أي: بالإيمان واليقين الذي أيده به الله وقواه على ما أمر به، وقيل أيده بجبريل عليه السلام يلازمه في أحواله { ولو شاء الله ما اقتتل الذين من بعدهم من بعد ما جاءتهم البينات } الموجبة للاجتماع على الإيمان { ولكن اختلفوا فمنهم من آمن ومنهم من كفر } فكان موجب هذا الاختلاف التفرق والمعاداة والمقاتلة، ومع هذا فلو شاء الله بعد هذا الاختلاف ما اقتتلوا، فدل ذلك على أن مشيئة الله نافذة غالبة للأسباب، وإنما تنفع الأسباب مع عدم معارضة المشيئة، فإذا وجدت اضمحل كل سبب، وزال كل موجب، فلهذا قال { ولكن الله يفعل ما يريد } فإرادته غالبة ومشيئته نافذة، وفي هذا ونحوه دلالة على أن الله تعالى لم يزل يفعل ما اقتضته مشيئته وحكمته، ومن جملة ما يفعله ما أخبر به عن نفسه وأخبر به عنه رسوله صلى الله عليه وسلم من الاستواء والنزول والأقوال، والأفعال التي يعبرون عنها بالأفعال الاختيارية. فائدة: كما يجب على المكلف معرفته بربه، فيجب عليه معرفته برسله، ما يجب لهم ويمتنع عليهم ويجوز في حقهم، ويؤخذ جميع ذلك مما وصفهم الله به في آيات متعددة، منها: أنهم رجال لا نساء، من أهل القرى لا من أهل البوادي، وأنهم مصطفون مختارون، جمع الله لهم من الصفات الحميدة ما به الاصطفاء والاختيار، وأنهم سالمون من كل ما يقدح في رسالتهم من كذب وخيانة وكتمان وعيوب مزرية، وأنهم لا يقرون على خطأ فيما يتعلق بالرسالة والتكليف، وأن الله تعالى خصهم بوحيه، فلهذا وجب الإيمان بهم وطاعتهم ومن لم يؤمن بهم فهو كافر، ومن قدح في واحد منهم أو سبه فهو كافر يتحتم قتله، ودلائل هذه الجمل كثيرة، من تدبر القرآن تبين له الحق\n                                    "
      },
      "originalText": "۞ تِلۡكَ ٱلرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۘ مِّنۡهُم مَّن كَلَّمَ ٱللَّهُۖ وَرَفَعَ بَعۡضَهُمۡ دَرَجَٰتٖۚ وَءَاتَيۡنَا عِيسَى ٱبۡنَ مَرۡيَمَ ٱلۡبَيِّنَٰتِ وَأَيَّدۡنَٰهُ بِرُوحِ ٱلۡقُدُسِۗ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلَ ٱلَّذِينَ مِنۢ بَعۡدِهِم مِّنۢ بَعۡدِ مَا جَآءَتۡهُمُ ٱلۡبَيِّنَٰتُ وَلَٰكِنِ ٱخۡتَلَفُواْ فَمِنۡهُم مَّنۡ ءَامَنَ وَمِنۡهُم مَّن كَفَرَۚ وَلَوۡ شَآءَ ٱللَّهُ مَا ٱقۡتَتَلُواْ وَلَٰكِنَّ ٱللَّهَ يَفۡعَلُ مَا يُرِيدُ ٣٥٢"
    },
    {
      "number": 261,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَنْفِقُوا مِمَّا رَزَقْنَاكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا بَيْعٌ فِيهِ وَلَا خُلَّةٌ وَلَا شَفَاعَةٌ ۗ وَالْكَافِرُونَ هُمُ الظَّالِمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 254,
      "juz": 3,
      "manzil": 1,
      "page": 42,
      "ruku": 35,
      "hizbQuarter": 17,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَنفِقُواْ مِمَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا بَيۡعٞ فِيهِ وَلَا خُلَّةٞ وَلَا شَفَٰعَةٞۗ وَٱلۡكَٰفِرُونَ هُمُ ٱلظَّٰلِمُونَ ٤٥٢\n                                        \n                                        \nيأمر تعالى عباده بالإنفاق مما رزقهم في سبيله سبيل الخير ليدخروا ثواب ذلك عند ربهم ومليكهم وليبادروا إلى ذلك في هذه الحياة الدنيا ( من قبل أن يأتي يوم ) يعني : يوم القيامة ( لا بيع فيه ولا خلة ولا شفاعة ) أي : لا يباع أحد من نفسه ولا يفادى بمال لو بذله ، ولو جاء بملء الأرض ذهبا ولا تنفعه خلة أحد ، يعني : صداقته بل ولا نسابته كما قال : ( فإذا نفخ في الصور فلا أنساب بينهم يومئذ ولا يتساءلون ) [ المؤمنون : 101 ] ( ولا شفاعة ) أي : ولا تنفعهم شفاعة الشافعين .\nوقوله : ( والكافرون هم الظالمون ) مبتدأ محصور في خبره أي : ولا ظالم أظلم ممن وافى الله يومئذ كافرا . وقد روى ابن أبي حاتم عن عطاء بن دينار أنه قال : الحمد لله الذي قال : ( والكافرون هم الظالمون ) ولم يقل : والظالمون هم الكافرون .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَنفِقُواْ مِمَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا بَيۡعٞ فِيهِ وَلَا خُلَّةٞ وَلَا شَفَٰعَةٞۗ وَٱلۡكَٰفِرُونَ هُمُ ٱلظَّٰلِمُونَ ٤٥٢\n                                        \n                                        \n                                        قوله تعالى : يا أيها الذين آمنوا أنفقوا مما رزقناكم من قبل أن يأتي يوم لا بيع فيه ولا خلة ولا شفاعة والكافرون هم الظالمون\nقال الحسن : هي الزكاة المفروضة . وقال ابن جريج وسعيد بن جبير : هذه الآية تجمع الزكاة المفروضة والتطوع . قال ابن عطية . وهذا صحيح ، ولكن ما تقدم من الآيات في ذكر القتال وأن الله يدفع بالمؤمنين في صدور الكافرين يترجح منه أن هذا الندب إنما هو في سبيل الله ، ويقوي ذلك في آخر الآية قوله : والكافرون هم الظالمون أي فكافحوهم بالقتال بالأنفس وإنفاق الأموال .\nقلت : وعلى هذا التأويل يكون إنفاق الأموال مرة واجبا ومرة ندبا بحسب تعين الجهاد وعدم تعينه . وأمر تعالى عباده بالإنفاق مما رزقهم الله وأنعم به عليهم وحذرهم من الإمساك إلى أن يجيء يوم لا يمكن فيه بيع ولا شراء ولا استدراك نفقة ، كما قال : فيقول رب لولا أخرتني إلى أجل قريب فأصدق . والخلة : خالص المودة ، مأخوذة من تخلل الأسرار بين الصديقين . والخلالة والخلالة والخلالة : الصداقة والمودة ، قال الشاعر : ( هو النابغة الجعدي )\nوكيف تواصل من أصبحت خلالته كأبي مرحب\nوأبو مرحب كنية الظل ، ويقال : هو كنية عرقوب الذي قيل فيه : مواعيد عرقوب . والخلة بالضم أيضا : ما خلا من النبت ، يقال : الخلة خبز الإبل والحمض فاكهتها . والخلة بالفتح : الحاجة والفقر . والخلة : ابن مخاض ، عن الأصمعي . يقال : أتاهم بقرص كأنه فرسن خلة . والأنثى خلة أيضا . ويقال للميت : اللهم أصلح خلته ، أي الثلمة التي ترك . والخلة : الخمرة الحامضة . والخلة ( بالكسر ) : واحدة خلل السيوف ، وهي بطائن كانت تغشى بها أجفان السيوف منقوشة بالذهب وغيره ، وهي أيضا سيور تلبس ظهر سيتي القوس . والخلة أيضا : ما يبقى بين الأسنان . وسيأتي في ( النساء ) اشتقاق الخليل ومعناه . فأخبر الله تعالى ألا خلة في الآخرة ولا شفاعة إلا بإذن الله . وحقيقتها رحمة منه تعالى شرف بها الذي أذن له في أن يشفع . وقرأ ابن كثير وأبو عمرو \" لا بيع فيه ولا خلة ولا شفاعة \" بالنصب من غير تنوين ، وكذلك في سورة ( إبراهيم ) \" لا بيع فيه ولا خلال \" وفي الطور \" لا لغو فيها ولا تأثيم \" وأنشد حسان بن ثابت :\nألا طعان ولا فرسان عادية إلا تجشؤكم عند التنانير\nوألف الاستفهام غير مغيرة عمل \" لا \" كقولك : ألا رجل عندك ، ويجوز ألا رجل ولا امرأة كما جاز في غير الاستفهام فاعلمه . وقرأ الباقون جميع ذلك بالرفع والتنوين ، كما قال الراعي :\nوما صرمتك حتى قلت معلنة لا ناقة لي في هذا ولا جمل\nويروى \" وما هجرتك \" فالفتح على النفي العام المستغرق لجميع الوجوه من ذلك الصنف ، كأنه جواب لمن قال : هل فيه من بيع ؟ فسأل سؤالا عاما فأجيب جوابا عاما بالنفي . و \" لا \" مع الاسم المنفي بمنزلة اسم واحد في موضع رفع بالابتداء ، والخبر \" فيه \" . وإن شئت جعلته صفة ليوم ، ومن رفع جعل \" لا \" بمنزلة ليس . وجعل الجواب غير عام ، وكأنه جواب من قال : هل فيه بيع ؟ بإسقاط من ، فأتى الجواب غير مغير عن رفعه ، والمرفوع مبتدأ أو اسم ليس و \" فيه \" الخبر . قال مكي : والاختيار الرفع ؛ لأن أكثر القراء عليه ، ويجوز في غير القرآن لا بيع فيه ولا خلة ، وأنشد سيبويه لرجل من مذحج :\nهذا لعمركم الصغار بعينه لا أم لي إن كان ذاك ولا أب\nويجوز أن تبني الأول وتنصب الثاني وتنونه فتقول : لا رجل فيه ولا امرأة ، وأنشد سيبويه :\nلا نسب اليوم ولا خلة اتسع الخرق على الراقع\nف \" لا \" زائدة في الموضعين ، الأول عطف على الموضع والثاني على اللفظ ووجه خامس أن ترفع الأول وتبني الثاني كقولك : لا رجل فيها ولا امرأة ، قال أمية :\nفلا لغو ولا تأثيم فيها وما فاهوا به أبدا مقيم\nوهذه الخمسة الأوجه جائزة في قولك : لا حول ولا قوة إلا بالله ، وقد تقدم هذا والحمد لله . ( والكافرون ) ابتداء . ( هم ) ابتداء ثان ، ( الظالمون ) خبر الثاني ، وإن شئت كانت \" هم \" زائدة للفصل و \" الظالمون \" خبر \" الكافرون \" . قال عطاء بن دينار : والحمد لله الذي قال : والكافرون هم الظالمون ولم يقل والظالمون هم الكافرون .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَنفِقُواْ مِمَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا بَيۡعٞ فِيهِ وَلَا خُلَّةٞ وَلَا شَفَٰعَةٞۗ وَٱلۡكَٰفِرُونَ هُمُ ٱلظَّٰلِمُونَ ٤٥٢\n                                        \n                                        \n                                        \n                                        وهذا من لطف الله بعباده أن أمرهم بتقديم شيء مما رزقهم الله، من صدقة واجبة ومستحبة، ليكون لهم ذخرا وأجرا موفرا في يوم يحتاج فيه العاملون إلى مثقال ذرة من الخير، فلا بيع فيه ولو افتدى الإنسان نفسه بملء الأرض ذهبا ليفتدي به من عذاب يوم القيامة ما تقبل منه، ولم ينفعه خليل ولا صديق لا بوجاهة ولا بشفاعة، وهو اليوم الذي فيه يخسر المبطلون ويحصل الخزي على الظالمين، وهم الذين وضعوا الشيء في غير موضعه، فتركوا الواجب من حق الله وحق عباده وتعدوا الحلال إلى الحرام، وأعظم أنواع الظلم الكفر بالله الذي هو وضع العبادة التي يتعين أن تكون لله فيصرفها الكافر إلى مخلوق مثله، فلهذا قال تعالى: { والكافرون هم الظالمون } وهذا من باب الحصر، أي: الذين ثبت لهم الظلم التام، كما قال تعالى: { إن الشرك لظلم عظيم }\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَنفِقُواْ مِمَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا بَيۡعٞ فِيهِ وَلَا خُلَّةٞ وَلَا شَفَٰعَةٞۗ وَٱلۡكَٰفِرُونَ هُمُ ٱلظَّٰلِمُونَ ٤٥٢"
    },
    {
      "number": 262,
      "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 255,
      "juz": 3,
      "manzil": 1,
      "page": 42,
      "ruku": 35,
      "hizbQuarter": 17,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَ‍ُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ ٥٥٢\n                                        \n                                        \n                                        هذه آية الكرسي ولها شأن عظيم قد صح الحديث عن رسول الله صلى الله عليه وسلم بأنها أفضل آية في كتاب الله . قال الإمام أحمد : حدثنا عبد الرزاق حدثنا سفيان عن سعيد الجريري عن أبي السليل عن عبد الله بن رباح ، عن أبي هو ابن كعب أن النبي صلى الله عليه وسلم سأله : \" أي آية في كتاب الله أعظم \" ؟ قال : الله ورسوله أعلم . فرددها مرارا ثم قال أبي : آية الكرسي . قال : \" ليهنك العلم أبا المنذر ، والذي نفسي بيده إن لها لسانا وشفتين تقدس الملك عند ساق العرش \" وقد رواه مسلم عن أبي بكر بن أبي شيبة عن عبد الأعلى بن عبد الأعلى عن الجريري به ، وليس عنده زيادة : \" والذي نفسي بيده . . . \" إلخ .\nحديث آخر : عن أبي أيضا في فضل آية الكرسي ، قال الحافظ أبو يعلى الموصلي : حدثنا أحمد بن إبراهيم الدورقي حدثنا مبشر عن الأوزاعي عن يحيى بن أبي كثير عن عبدة بن أبي لبابة عن عبد الله بن أبي بن كعب : أن أباه أخبره : أنه كان له جرن فيه تمر قال : فكان أبي يتعاهده فوجده ينقص قال : فحرسه ذات ليلة فإذا هو بدابة شبيه الغلام المحتلم قال : فسلمت عليه فرد السلام . قال : فقلت : ما أنت ، جني أم إنسي ؟ قال : جني . قلت : ناولني يدك . قال : فناولني ، فإذا يد كلب وشعر كلب . فقلت : هكذا خلق الجن ؟ قال : لقد علمت الجن ما فيهم أشد مني ، قلت : فما حملك على ما صنعت ؟ قال : بلغني أنك رجل تحب الصدقة فأحببنا أن نصيب من طعامك . قال : فقال له فما الذي يجيرنا منكم ؟ قال : هذه الآية : آية الكرسي . ثم غدا إلى النبي صلى الله عليه وسلم فأخبره فقال النبي صلى الله عليه وسلم : \" صدق الخبيث \" .\nوهكذا رواه الحاكم في مستدركه من حديث أبي داود الطيالسي عن حرب بن شداد عن يحيى بن أبي كثير عن الحضرمي بن لاحق ، عن محمد بن عمرو بن أبي بن كعب عن جده به . وقال : صحيح الإسناد ولم يخرجاه .\nطريق أخرى : قال الإمام أحمد : حدثنا محمد بن جعفر حدثنا عثمان بن غياث قال : سمعت أبا السليل قال : كان رجل من أصحاب النبي صلى الله عليه وسلم يحدث الناس حتى يكثروا عليه فيصعد على سطح بيت فيحدث الناس قال : قال رسول الله صلى الله عليه وسلم : \" أي آية في القرآن أعظم ؟ \" فقال رجل :\n( الله لا إله إلا هو ) قال : فوضع يده بين كتفي فوجدت بردها بين ثديي ، أو قال : فوضع يده بين ثديي فوجدت بردها بين كتفي وقال : \" ليهنك العلم يا أبا المنذر \" .\nحديث آخر : عن الأسفع البكري . قال الحافظ أبو القاسم الطبراني : حدثنا أبو يزيد القراطيسي حدثنا يعقوب بن أبي عباد المكي حدثنا مسلم بن خالد ، عن ابن جريج أخبرني عمر بن عطاء أن مولى ابن الأسفع رجل صدق أخبره عن الأسفع البكري : أنه سمعه يقول : إن النبي صلى الله عليه وسلم جاءهم في صفة المهاجرين فسأله إنسان : أي آية في القرآن أعظم ؟ فقال النبي صلى الله عليه وسلم : ( الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم ) حتى انقضت الآية . .\nحديث آخر : عن أنس قال الإمام أحمد : حدثنا عبد الله بن الحارث حدثني سلمة بن وردان أن أنس بن مالك حدثه أن رسول الله صلى الله عليه وسلم سأل رجلا من صحابته فقال : \" أي فلان هل تزوجت \" ؟ قال : لا وليس عندي ما أتزوج به . قال : \" أوليس معك : ( قل هو الله أحد ) \" ؟ قال : بلى . قال : \" ربع القرآن . أليس معك : ( قل ياأيها الكافرون ) \" ؟ قال : بلى . قال : \" ربع القرآن . أليس معك ( إذا زلزلت ) \" ؟ قال : بلى . قال : \" ربع القرآن . أليس معك : ( إذا جاء نصر الله [ والفتح ] ) \" ؟ قال : بلى . قال : \" ربع القرآن . أليس معك آية الكرسي : ( الله لا إله إلا هو ) \" ؟ قال : بلى . قال : \" ربع القرآن \" .\nحديث آخر : عن أبي ذر جندب بن جنادة قال الإمام أحمد : حدثنا وكيع بن الجراح حدثنا المسعودي أنبأني أبو عمر الدمشقي عن عبيد بن الخشخاش عن أبي ذر رضي الله عنه قال : أتيت النبي صلى الله عليه وسلم وهو في المسجد فجلست . فقال : \" يا أبا ذر هل صليت ؟ \" قلت : لا . قال : \" قم فصل \" قال : فقمت فصليت ثم جلست فقال : \" يا أبا ذر تعوذ بالله من شر شياطين الإنس والجن \" قال : قلت : يا رسول الله أوللإنس شياطين ؟ قال : \" نعم \" قال : قلت : يا رسول الله الصلاة ؟ قال : \" خير موضوع ، من شاء أقل ومن شاء أكثر \" . قال : قلت : يا رسول الله فالصوم ؟ قال : \" فرض مجزئ وعند الله مزيد \" قلت : يا رسول الله فالصدقة ؟ قال : \" أضعاف مضاعفة \" . قلت : يا رسول الله فأيها أفضل ؟ قال : \" جهد من مقل أو سر إلى فقير \" قلت : يا رسول الله أي الأنبياء كان أول ؟ قال : \" آدم \" قلت : يا رسول الله ونبي كان ؟ قال : \" نعم نبي مكلم \" قال : قلت : يا رسول الله كم المرسلون ؟ قال : \" ثلاثمائة وبضعة عشر جما غفيرا \" وقال مرة : \" وخمسة عشر \" قال : قلت : يا رسول الله أيما أنزل عليك أعظم ؟ قال : \" آية الكرسي : ( الله لا إله إلا هو الحي القيوم ) \" ورواه النسائي .\nحديث آخر : عن أبي أيوب خالد بن زيد الأنصاري ، رضي الله عنه وأرضاه قال الإمام أحمد : حدثنا سفيان عن ابن أبي ليلى عن أخيه عبد الرحمن بن أبي ليلى عن أبي أيوب : أنه كان في سهوة له ، وكانت الغول تجيء فتأخذ فشكاها إلى النبي صلى الله عليه وسلم : فقال : \" فإذا رأيتها فقل : باسم الله أجيبي رسول الله \" . قال : فجاءت فقال لها : فأخذها فقالت : إني لا أعود . فأرسلها فجاء فقال له النبي صلى الله عليه وسلم : \" ما فعل أسيرك ؟ \" قال : أخذتها فقالت لي : إني لا أعود ، إني لا أعود . فأرسلتها ، فقال : \" إنها عائدة \" فأخذتها مرتين أو ثلاثا كل ذلك تقول : لا أعود . وأجيء إلى النبي صلى الله عليه وسلم فيقول : \" ما فعل أسيرك ؟ \" فأقول : أخذتها فتقول : لا أعود . فيقول : \" إنها عائدة \" فأخذتها فقالت : أرسلني وأعلمك شيئا تقوله فلا يقربك شيء : آية الكرسي ، فأتى النبي صلى الله عليه وسلم فأخبره فقال : \" صدقت وهي كذوب \" .\nورواه الترمذي في فضائل القرآن عن بندار عن أبي أحمد الزبيري به ، وقال : حسن غريب .\nوقد ذكر البخاري هذه القصة عن أبي هريرة فقال في كتاب \" فضائل القرآن \" وفي كتاب \" الوكالة \" وفي \" صفة إبليس \" من صحيحه : قال عثمان بن الهيثم أبو عمرو حدثنا عوف عن محمد بن سيرين عن أبي هريرة قال : وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان فأتاني آت فجعل يحثو من الطعام فأخذته وقلت : لأرفعنك إلى رسول الله صلى الله عليه وسلم . قال : إني محتاج وعلي عيال ولي حاجة شديدة . قال : فخليت عنه . فأصبحت فقال النبي صلى الله عليه وسلم : \" يا أبا هريرة ما فعل أسيرك البارحة ؟ \" قال : قلت : يا رسول الله شكا حاجة شديدة وعيالا فرحمته وخليت سبيله . قال : \" أما إنه قد كذبك وسيعود \" فعرفت أنه سيعود لقول رسول الله صلى الله عليه وسلم : \" إنه سيعود \" فرصدته فجاء يحثو من الطعام فأخذته فقلت : لأرفعنك إلى رسول الله صلى الله عليه وسلم قال : دعني فإني محتاج وعلي عيال لا أعود . فرحمته وخليت سبيله فأصبحت فقال لي رسول الله صلى الله عليه وسلم : \" يا أبا هريرة ما فعل أسيرك البارحة ؟ \" قلت : يا رسول الله شكا حاجة وعيالا فرحمته فخليت سبيله . قال : \" أما إنه قد كذبك وسيعود \" فرصدته الثالثة فجاء يحثو من الطعام فأخذته فقلت : لأرفعنك إلى رسول الله صلى الله عليه وسلم . وهذا آخر ثلاث مرات أنك تزعم أنك لا تعود ثم تعود . فقال : دعني أعلمك كلمات ينفعك الله بها . قلت : ما هن . قال : إذا أويت إلى فراشك فاقرأ آية الكرسي : ( الله لا إله إلا هو الحي القيوم ) حتى تختم الآية فإنك لن يزال عليك من الله حافظ ولا يقربك شيطان حتى تصبح . فخليت سبيله فأصبحت فقال لي رسول الله صلى الله عليه وسلم : \" ما فعل أسيرك البارحة ؟ \" قلت : يا رسول الله زعم أنه يعلمني كلمات ينفعني الله بها فخليت سبيله . قال : \" ما هي ؟ \" قال : قال لي : إذا أويت إلى فراشك فاقرأ آية الكرسي من أولها حتى تختم الآية : ( الله لا إله إلا هو الحي القيوم ) وقال لي : لن يزال عليك من الله حافظ ولا يقربك شيطان حتى تصبح . وكانوا أحرص شيء على الخير ، فقال النبي صلى الله عليه وسلم : \" أما إنه صدقك وهو كذوب . تعلم من تخاطب مذ ثلاث ليال يا أبا هريرة ؟ \" قلت : لا قال : \" ذاك شيطان \" .\nكذا رواه البخاري معلقا بصيغة الجزم وقد رواه النسائي في \" اليوم والليلة \" عن إبراهيم بن يعقوب عن عثمان بن الهيثم فذكره وقد روي من وجه آخر عن أبي هريرة بسياق آخر قريب من هذا فقال الحافظ أبو بكر بن مردويه في تفسيره :\nحدثنا محمد بن عبد الله بن عمرويه الصفار ، حدثنا أحمد بن زهير بن حرب أخبرنا مسلم بن إبراهيم أخبرنا إسماعيل بن مسلم العبدي أخبرنا أبو المتوكل الناجي : أن أبا هريرة كان معه مفتاح بيت الصدقة وكان فيه تمر فذهب يوما ففتح الباب فوجد التمر قد أخذ منه ملء كف ودخل يوما آخر فإذا قد أخذ منه ملء كف ثم دخل يوما آخر ثالثا فإذا قد أخذ منه مثل ذلك . فشكا ذلك أبو هريرة إلى النبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم : \" تحب أن تأخذ صاحبك هذا ؟ \" قال : نعم . قال : \" فإذا فتحت الباب فقل : سبحان من سخرك لمحمد \" فذهب ففتح الباب فقال : سبحان من سخرك لمحمد . فإذا هو قائم بين يديه قال : يا عدو الله أنت صاحب هذا ؟ قال : نعم دعني فإني لا أعود ما كنت آخذا إلا لأهل بيت من الجن فقراء ، فخلى عنه ثم عاد الثانية ثم عاد الثالثة . فقلت : أليس قد عاهدتني ألا تعود ؟ لا أدعك اليوم حتى أذهب بك إلى النبي صلى الله عليه وسلم قال : لا تفعل ، فإنك إن تدعني علمتك كلمات إذا أنت قلتها لم يقربك أحد من الجن صغير ولا كبير ذكر ولا أنثى قال له : لتفعلن ؟ قال : نعم . قال : ما هن ؟ قال : ( الله لا إله إلا هو الحي القيوم ) قرأ آية الكرسي حتى ختمها فتركه فذهب فأبعد فذكر ذلك أبو هريرة للنبي صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم : \" أما علمت أن ذلك كذلك ؟ \" .\nوقد رواه النسائي عن أحمد بن محمد بن عبيد الله عن شعيب بن حرب عن إسماعيل بن مسلم عن أبي المتوكل عن أبي هريرة به ، وقد تقدم لأبي بن كعب كائنة مثل هذه أيضا فهذه ثلاث وقائع .\nقصة أخرى : قال أبو عبيد في كتاب \" الغريب \" : حدثنا أبو معاوية عن أبي عاصم الثقفي عن الشعبي عن عبد الله بن مسعود قال : خرج رجل من الإنس فلقيه رجل من الجن فقال : هل لك أن تصارعني ؟ فإن صرعتني علمتك آية إذا قرأتها حين تدخل بيتك لم يدخل شيطان ؟ فصارعه فصرعه فقال : إني أراك ضئيلا شخيتا كأن ذراعيك ذراعا كلب ، أفهكذا أنتم أيها الجن كلكم أم أنت من بينهم ؟ فقال : إني بينهم لضليع فعاودني ، فصارعه فصرعه الإنسي . فقال : تقرأ آية الكرسي فإنه لا يقرؤها أحد إذا دخل بيته إلا خرج الشيطان وله خبج كخبج الحمار .\nفقيل لابن مسعود : أهو عمر ؟ فقال : من عسى أن يكون إلا عمر .\nقال أبو عبيد : الضئيل : النحيف الجسم ، والخبج بالخاء المعجمة ويقال : بالحاء المهملة : الضراط .\nحديث آخر عن أبي هريرة : قال الحاكم أبو عبد الله في مستدركه : حدثنا علي بن حمشاذ ، حدثنا بشر بن موسى ، حدثنا الحميدي ، حدثنا سفيان ، حدثني حكيم بن جبير الأسدي ، عن أبي صالح ، عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : \" سورة البقرة فيها آية سيدة آي القرآن لا تقرأ في بيت فيه شيطان إلا خرج منه ! آية الكرسي \" .\nوكذا رواه من طريق أخرى عن زائدة عن حكيم بن جبير ثم قال : صحيح الإسناد ولم يخرجاه . كذا قال ، وقد رواه الترمذي من حديث زائدة [ به ] ولفظه : \" لكل شيء سنام ، وسنام القرآن سورة البقرة ، وفيها آية هي سيدة آي القرآن : آية الكرسي \" . ثم قال : غريب لا نعرفه إلا من حديث حكيم بن جبير ، وقد تكلم فيه شعبة وضعفه .\nقلت : وكذا ضعفه أحمد ويحيى بن معين وغير واحد من الأئمة وتركه ابن مهدي وكذبه السعدي .\nحديث آخر : قال ابن مردويه : حدثنا عبد الباقي بن نافع ، أخبرنا عيسى بن محمد المروزي ، أخبرنا عمر بن محمد البخاري ، أخبرنا أبي ، أخبرنا عيسى بن موسى غنجار ، عن عبد الله بن كيسان ، أخبرنا يحيى بن عقيل ، عن يحيى بن يعمر ، عن ابن عمر ، عن عمر بن الخطاب : أنه خرج ذات يوم إلى الناس وهم سماطات فقال : أيكم يخبرني بأعظم آية في القرآن ؟ فقال ابن مسعود : على الخبير سقطت ، سمعت رسول الله صلى الله عليه وسلم يقول : \" أعظم آية في القرآن : ( الله لا إله إلا هو الحي القيوم ) .\nحديث آخر في اشتماله على اسم الله الأعظم : قال الإمام أحمد : حدثنا محمد بن بكر ، أخبرنا عبيد الله بن أبي زياد ، حدثنا شهر بن حوشب عن أسماء بنت يزيد بن السكن قالت : سمعت رسول الله صلى الله عليه وسلم يقول في هاتين الآيتين ( الله لا إله إلا هو الحي القيوم ) و ( الم الله لا إله إلا هو الحي القيوم ) [ آل عمران : 1 ، 2 ] \" إن فيهما اسم الله الأعظم \" .\nوكذا رواه أبو داود عن مسدد ، والترمذي عن علي بن خشرم ، وابن ماجه عن أبي بكر بن أبي شيبة ، ثلاثتهم عن عيسى بن يونس عن عبيد الله بن أبي زياد به ، وقال الترمذي : حسن صحيح .\nحديث آخر في معنى هذا عن أبي أمامة رضي الله عنه : قال ابن مردويه : أخبرنا عبد الرحمن بن نمير ، أخبرنا إسحاق بن إبراهيم بن إسماعيل ، أخبرنا هشام بن عمار ، أخبرنا الوليد بن مسلم ، أخبرنا عبد الله بن العلاء بن زيد : أنه سمع القاسم بن عبد الرحمن يحدث عن أبي أمامة يرفعه قال : \" اسم الله الأعظم الذي إذا دعي به أجاب في ثلاث : سورة البقرة وآل عمران وطه \" وقال هشام وهو ابن عمار خطيب دمشق : أما البقرة ف ( الله لا إله إلا هو الحي القيوم ) وفي آل عمران : ( الم الله لا إله إلا هو الحي القيوم ) وفي طه : ( وعنت الوجوه للحي القيوم ) [ طه : 111 ] .\nحديث آخر عن أبي أمامة في فضل قراءتها بعد الصلاة المكتوبة : قال أبو بكر بن مردويه : حدثنا محمد بن محرز بن مساور الأدمي ، أخبرنا جعفر بن محمد بن الحسن ، أخبرنا الحسين بن بشر بطرسوس ، أخبرنا محمد بن حمير ، أخبرنا محمد بن زياد ، عن أبي أمامة قال : قال رسول الله صلى الله عليه وسلم : \" من قرأ دبر كل صلاة مكتوبة آية الكرسي لم يمنعه من دخول الجنة إلا أن يموت \" .\nوهكذا رواه النسائي في \" اليوم والليلة \" عن الحسين بن بشر به ، وأخرجه ابن حبان في صحيحه من حديث محمد بن حمير وهو الحمصي من رجال البخاري أيضا ، فهو إسناد على شرط البخاري ، وقد زعم أبو الفرج بن الجوزي أنه حديث موضوع فالله أعلم . وقد روى ابن مردويه من حديث علي والمغيرة بن شعبة وجابر بن عبد الله نحو هذا الحديث . ولكن في إسناد كل منها ضعف .\nوقال ابن مردويه أيضا : حدثنا محمد بن الحسن بن زياد المقري ، أخبرنا يحيى بن درستويه المروزي ، أخبرنا زياد بن إبراهيم ، أخبرنا أبو حمزة السكري ، عن المثنى ، عن قتادة ، عن الحسن ، عن أبي موسى الأشعري ، عن النبي صلى الله عليه وسلم قال : \" أوحى الله إلى موسى بن عمران عليه السلام أن اقرأ آية الكرسي في دبر كل صلاة مكتوبة ؛ فإنه من يقرأها في دبر كل صلاة مكتوبة أجعل له قلب الشاكرين ولسان الذاكرين وثواب المنيبين وأعمال الصديقين ، ولا يواظب على ذلك إلا نبي أو صديق أو عبد امتحنت قلبه للإيمان أو أريد قتله في سبيل الله \" وهذا حديث منكر جدا .\nحديث آخر في أنها تحفظ من قرأها أول النهار وأول الليل : قال أبو عيسى الترمذي : حدثنا يحيى بن المغيرة أبو سلمة المخزومي المديني ، أخبرنا ابن أبي فديك ، عن عبد الرحمن المليكي ، عن زرارة بن مصعب ، عن أبي سلمة عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" من قرأ : ( حم ) المؤمن إلى : ( إليه المصير ) وآية الكرسي حين يصبح حفظ بهما حتى يمسي ، ومن قرأهما حين يمسي حفظ بهما حتى يصبح \" ثم قال : هذا حديث غريب ، وقد تكلم بعض أهل العلم في عبد الرحمن بن أبي بكر بن أبي مليكة المليكي من قبل حفظه .\nوقد ورد في فضيلتها أحاديث أخر تركناها اختصارا لعدم صحتها وضعف أسانيدها كحديث على قراءتها عند الحجامة : أنها تقوم مقام حجامتين ، وحديث أبي هريرة في كتابتها في اليد اليسرى بالزعفران سبع مرات وتلحس للحفظ وعدم النسيان ، أوردهما ابن مردويه وغير ذلك . وهذه الآية مشتملة على عشر جمل مستقلة .\nفقوله : ( الله لا إله إلا هو ) إخبار بأنه المتفرد بالإلهية لجميع الخلائق ) الحي القيوم ) أي : الحي في نفسه الذي لا يموت أبدا القيم لغيره ، وكان عمر يقرأ : \" القيام \" فجميع الموجودات مفتقرة إليه وهو غني عنها ، ولا قوام لها بدون أمره كقوله : ( ومن آياته أن تقوم السماء والأرض بأمره ) [ الروم : 25 ] وقوله : ( لا تأخذه سنة ولا نوم ) أي : لا يعتريه نقص ولا غفلة ولا ذهول عن خلقه بل هو قائم على كل نفس بما كسبت شهيد على كل شيء لا يغيب عنه شيء ولا يخفى عليه خافية ، ومن تمام القيومية أنه لا يعتريه سنة ولا نوم ، فقوله : ( لا تأخذه ) أي : لا تغلبه سنة وهي الوسن والنعاس ولهذا قال : ( ولا نوم ) لأنه أقوى من السنة . وفي الصحيح عن أبي موسى قال : قام فينا رسول الله صلى الله عليه وسلم بأربع كلمات فقال : \" إن الله لا ينام ولا ينبغي له أن ينام ، يخفض القسط ويرفعه ، يرفع إليه عمل النهار قبل عمل الليل ، وعمل الليل قبل عمل النهار ، حجابه النور أو النار لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه \" .\nوقال عبد الرزاق : أخبرنا معمر ، أخبرني الحكم بن أبان ، عن عكرمة مولى ابن عباس في قوله : ( لا تأخذه سنة ولا نوم ) أن موسى عليه السلام سأل الملائكة هل ينام الله عز وجل ؟ فأوحى الله إلى الملائكة وأمرهم أن يؤرقوه ثلاثا فلا يتركوه ينام ففعلوا ثم أعطوه قارورتين فأمسكهما ثم تركوه وحذروه أن يكسرهما . قال : فجعل ينعس وهما في يده في كل يد واحدة قال : فجعل ينعس وينبه وينعس وينبه حتى نعس نعسة فضرب إحداهما بالأخرى فكسرهما . قال معمر : إنما هو مثل ضربه الله عز وجل يقول : فكذلك السماوات والأرض في يديه .\nوهكذا رواه ابن جرير عن الحسن بن يحيى عن عبد الرزاق فذكره ، وهو من أخبار بني إسرائيل ، وهو مما يعلم أن موسى عليه السلام لا يخفى عليه مثل هذا من أمر الله عز وجل وأنه منزه عنه .\nوأغرب من هذا كله الحديث الذي رواه ابن جرير :\nحدثنا إسحاق بن أبي إسرائيل ، حدثنا هشام بن يوسف ، عن أمية بن شبل ، عن الحكم بن أبان ، عن عكرمة ، عن أبي هريرة قال : سمعت رسول الله صلى الله عليه وسلم يحكي عن موسى عليه السلام على المنبر ، قال : \" وقع في نفس موسى : هل ينام الله ؟ فأرسل الله إليه ملكا فأرقه ثلاثا ثم أعطاه قارورتين في كل يد قارورة وأمره أن يحتفظ بهما \" . قال : \" فجعل ينام تكاد يداه تلتقيان فيستيقظ فيحبس إحداهما على الأخرى ، حتى نام نومة فاصطفقت يداه فانكسرت القارورتان \" قال : \" ضرب الله له مثلا عز وجل : أن الله لو كان ينام لم تستمسك السماء والأرض \" .\nوهذا حديث غريب جدا والأظهر أنه إسرائيلي لا مرفوع ، والله أعلم .\nوقال ابن أبي حاتم : حدثنا أحمد بن القاسم بن عطية ، حدثنا أحمد بن عبد الرحمن الدشتكي ، حدثني أبي ، عن أبيه ، حدثنا أشعث بن إسحاق ، عن جعفر بن أبي المغيرة ، عن سعيد بن جبير ، عن ابن عباس : أن بني إسرائيل قالوا : يا موسى هل ينام ربك ؟ قال : اتقوا الله . فناداه ربه عز وجل : يا موسى سألوك : هل ينام ربك فخذ زجاجتين في يديك فقم الليلة ففعل موسى فلما ذهب من الليل ثلث نعس فوقع لركبتيه ، ثم انتعش فضبطهما حتى إذا كان آخر الليل نعس فسقطت الزجاجتان فانكسرتا . فقال : يا موسى ، لو كنت أنام لسقطت السماوات والأرض فهلكن كما هلكت الزجاجتان في يديك . وأنزل الله على نبيه صلى الله عليه وسلم آية الكرسي .\nوقوله : ( له ما في السماوات وما في الأرض ) إخبار بأن الجميع عبيده وفي ملكه وتحت قهره وسلطانه كقوله :\n( إن كل من في السماوات والأرض إلا آتي الرحمن عبدا لقد أحصاهم وعدهم عدا وكلهم آتيه يوم القيامة فردا ) [ مريم : 9395 ] .\nوقوله : ( من ذا الذي يشفع عنده إلا بإذنه ) كقوله : ( وكم من ملك في السماوات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى ) [ النجم : 26 ] وكقوله : ( ولا يشفعون إلا لمن ارتضى ) [ الأنبياء : 28 ] وهذا من عظمته وجلاله وكبريائه عز وجل أنه لا يتجاسر أحد على أن يشفع عنده إلا بإذنه له في الشفاعة كما في حديث الشفاعة : \" آتي تحت العرش فأخر ساجدا فيدعني ما شاء الله أن يدعني ثم يقال : ارفع رأسك ، وقل تسمع ، واشفع تشفع \" قال : \" فيحد لي حدا فأدخلهم الجنة \" .\nوقوله : ( يعلم ما بين أيديهم وما خلفهم ) دليل على إحاطة علمه بجميع الكائنات : ماضيها وحاضرها ومستقبلها كقوله إخبارا عن الملائكة : ( وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا وما بين ذلك وما كان ربك نسيا ) [ مريم : 64 ] .\nوقوله : ( ولا يحيطون بشيء من علمه إلا بما شاء ) أي : لا يطلع أحد من علم الله على شيء إلا بما أعلمه الله عز وجل وأطلعه عليه . ويحتمل أن يكون المراد لا يطلعون على شيء من علم ذاته وصفاته إلا بما أطلعهم الله عليه كقوله : ( ولا يحيطون به علما ) [ طه : 110 ] .\nوقوله : ( وسع كرسيه السماوات والأرض ) قال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا ابن إدريس ، عن مطرف بن طريف ، عن جعفر بن أبي المغيرة ، عن سعيد بن جبير ، عن ابن عباس في قوله : ( وسع كرسيه ) قال : علمه ، وكذا رواه ابن جرير من حديث عبد الله بن إدريس وهشيم كلاهما عن مطرف بن طريف به .\nقال ابن أبي حاتم : وروي عن سعيد بن جبير مثله . ثم قال ابن جرير : وقال آخرون : الكرسي موضع القدمين . ثم رواه عن أبي موسى والسدي والضحاك ومسلم البطين .\nوقال شجاع بن مخلد في تفسيره : أخبرنا أبو عاصم عن سفيان عن عمار الدهني عن مسلم البطين عن سعيد بن جبير عن ابن عباس قال : سئل النبي صلى الله عليه وسلم عن قول الله : ( وسع كرسيه السماوات والأرض ) قال : \" كرسيه موضع قدميه ، والعرش لا يقدر قدره إلا الله عز وجل \" .\nكذا أورد هذا الحديث الحافظ أبو بكر بن مردويه من طريق شجاع بن مخلد الفلاس ، فذكره وهو غلط ، وقد رواه وكيع في تفسيره : حدثنا سفيان عن عمار الدهني عن مسلم البطين عن سعيد بن جبير عن ابن عباس قال : الكرسي موضع القدمين ، والعرش لا يقدر أحد قدره . وقد رواه الحاكم في مستدركه عن أبي العباس محمد بن أحمد المحبوبي عن محمد بن معاذ عن أبي عاصم عن سفيان وهو الثوري بإسناده عن ابن عباس موقوفا مثله وقال : صحيح على شرط الشيخين ولم يخرجاه ، وقد رواه ابن مردويه من طريق الحاكم بن ظهير الفزاري الكوفي وهو متروك عن السدي عن أبيه عن أبي هريرة مرفوعا ولا يصح أيضا .\nوقال السدي عن أبي مالك : الكرسي تحت العرش . وقال السدي : السماوات والأرض في جوف الكرسي ، والكرسي بين يدي العرش . وقال الضحاك عن ابن عباس : لو أن السماوات السبع والأرضين السبع بسطن ثم وصلن بعضهن إلى بعض ما كن في سعة الكرسي إلا بمنزلة الحلقة في المفازة .\nورواه ابن جرير وابن أبي حاتم .\nوقال ابن جرير : حدثني يونس أخبرني ابن وهب قال : قال ابن زيد : حدثني أبي قال : قال رسول الله صلى الله عليه وسلم : \" ما السماوات السبع في الكرسي إلا كدراهم سبعة ألقيت في ترس \" . قال : وقال أبو ذر : سمعت رسول الله صلى الله عليه وسلم يقول : \" ما الكرسي في العرش إلا كحلقة من حديد ألقيت بين ظهري فلاة من الأرض \" .\nوقال أبو بكر بن مردويه : أخبرنا سليمان بن أحمد أخبرنا عبد الله بن وهيب الغزي أخبرنا محمد بن أبي السري العسقلاني أخبرنا محمد بن عبد الله التميمي عن القاسم بن محمد الثقفي عن أبي إدريس الخولاني عن أبي ذر الغفاري ، أنه سأل النبي صلى الله عليه وسلم عن الكرسي فقال رسول الله صلى الله عليه وسلم : \" والذي نفسي بيده ما السماوات السبع والأرضون السبع عند الكرسي إلا كحلقة ملقاة بأرض فلاة ، وإن فضل العرش على الكرسي كفضل الفلاة على تلك الحلقة \" .\nوقال الحافظ أبو يعلى الموصلي في مسنده : حدثنا زهير حدثنا ابن أبي بكير حدثنا إسرائيل عن أبي إسحاق عن عبد الله بن خليفة عن عمر ، رضي الله عنه قال : أتت امرأة إلى رسول الله صلى الله عليه وسلم فقالت : ادع الله أن يدخلني الجنة . قال : فعظم الرب تبارك وتعالى وقال : \" إن كرسيه وسع السماوات والأرض ، وإن له أطيطا كأطيط الرحل الجديد من ثقله \" .\nوقد رواه الحافظ البزار في مسنده المشهور ، وعبد بن حميد وابن جرير في تفسيريهما ، والطبراني وابن أبي عاصم في كتابي السنة لهما ، والحافظ الضياء في كتاب \" المختار \" من حديث أبي إسحاق السبيعي عن عبد الله بن خليفة وليس بذاك المشهور وفي سماعه من عمر نظر ، ثم منهم من يرويه عنه عن عمر موقوفا ، ومنهم من يرويه عنه مرسلا ، ومنهم من يزيد في متنه زيادة غريبة ، ومنهم من يحذفها .\nوأغرب من هذا حديث جبير بن مطعم في صفة العرش كما رواه أبو داود في كتابه السنة من سننه ، والله أعلم .\nوقد روى ابن مردويه وغيره أحاديث عن بريدة وجابر وغيرهما في وضع الكرسي يوم القيامة لفصل القضاء ، والظاهر أن ذلك غير المذكور في هذه الآية .\nوقد زعم بعض المتكلمين على علم الهيئة من الإسلاميين : أن الكرسي عندهم هو الفلك الثامن وهو فلك الثوابت الذي فوقه الفلك التاسع وهو الفلك الأثير ويقال له : الأطلس . وقد رد ذلك عليهم آخرون .\nوروى ابن جرير من طريق جويبر عن الحسن البصري أنه كان يقول : الكرسي هو العرش . والصحيح أن الكرسي غير العرش ، والعرش أكبر منه ، كما دلت على ذلك الآثار والأخبار ، وقد اعتمد ابن جرير على حديث عبد الله بن خليفة ، عن عمر في ذلك ، وعندي في صحته نظر ، والله أعلم .\nوقوله : ( ولا يئوده حفظهما ) أي : لا يثقله ولا يكرثه حفظ السماوات والأرض ومن فيهما ومن بينهما ، بل ذلك سهل عليه يسير لديه وهو القائم على كل نفس بما كسبت ، الرقيب على جميع الأشياء ، فلا يعزب عنه شيء ولا يغيب عنه شيء والأشياء كلها حقيرة بين يديه متواضعة ذليلة صغيرة بالنسبة إليه ، محتاجة فقيرة وهو الغني الحميد الفعال لما يريد ، الذي لا يسأل عما يفعل وهم يسألون . وهو القاهر لكل شيء الحسيب على كل شيء الرقيب العلي العظيم لا إله غيره ولا رب سواه . فقوله : ( وهو العلي العظيم ) كقوله : ( وهو [ العلي الكبير ) وكقوله ] : ( الكبير المتعال ) [ الرعد : 9 ] .\nوهذه الآيات وما في معناها من الأحاديث الصحاح الأجود فيها طريقة السلف الصالح إمرارها كما جاءت من غير تكييف ولا تشبيه .\n                                    ",
        "qortoby": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَ‍ُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ ٥٥٢\n                                        \n                                        \n                                        قوله تعالى : الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم\nقوله تعالى : الله لا إله إلا هو الحي القيوم هذه آية الكرسي سيدة آي القرآن وأعظم آية ، كما تقدم بيانه في الفاتحة ، ونزلت ليلا ودعا النبي صلى الله عليه وسلم زيدا فكتبها . روي عن محمد ابن الحنفية أنه قال : لما نزلت آية الكرسي خر كل صنم في الدنيا ، وكذلك خر كل ملك في الدنيا وسقطت التيجان عن رءوسهم ، وهربت الشياطين يضرب بعضهم على بعض إلى أن أتوا إبليس فأخبروه بذلك فأمرهم أن يبحثوا عن ذلك ، فجاءوا إلى المدينة فبلغهم أن آية الكرسي قد نزلت . وروى الأئمة عن أبي بن كعب قال : قال رسول الله صلى الله عليه وسلم : يا أبا المنذر أتدري أي آية من كتاب الله معك أعظم ؟ قال قلت : الله ورسوله أعلم ، قال : يا أبا المنذر أتدري أي آية من كتاب الله معك أعظم ؟ قال قلت : الله لا إله إلا هو الحي القيوم فضرب في صدري وقال : ليهنك العلم يا أبا المنذر . زاد الترمذي الحكيم أبو عبد الله : فوالذي نفسي بيده إن لهذه الآية للسانا وشفتين تقدس الملك عند ساق العرش . قال أبو عبد الله : فهذه آية أنزلها الله جل ذكره ، وجعل ثوابها لقارئها عاجلا وآجلا ، فأما في العاجل فهي حارسة لمن قرأها من الآفات ، وروي لنا عن نوف البكالي أنه قال : آية الكرسي تدعى في التوراة ولية الله . يريد يدعى قارئها في ملكوت السماوات والأرض عزيزا ، قال : فكان عبد الرحمن بن عوف إذا دخل بيته قرأ آية الكرسي في زوايا بيته الأربع ، معناه كأنه يلتمس بذلك أن تكون له حارسا من جوانبه الأربع ، وأن تنفي عنه الشيطان من زوايا بيته . وروي عن عمر أنه صارع جنيا فصرعه عمر رضي الله عنه ، فقال له الجني : خل عني حتى أعلمك ما تمتنعون به منا ، فخلى عنه وسأله فقال : إنكم تمتنعون منا بآية الكرسي .\nقلت : هذا صحيح ، وفي الخبر : من قرأ الكرسي دبر كل صلاة كان الذي يتولى قبض روحه ذو الجلال والإكرام ، وكان كمن قاتل مع أنبياء الله حتى يستشهد . وعن علي رضي الله عنه قال : سمعت نبيكم صلى الله عليه وسلم يقول وهو على أعواد المنبر : من قرأ آية الكرسي دبر كل صلاة لم يمنعه من دخول الجنة إلا الموت ولا يواظب عليها إلا صديق أو عابد ، ومن قرأها إذا أخذ مضجعه آمنه الله على نفسه وجاره وجار جاره والأبيات حوله . وفي البخاري عن أبي هريرة قال : وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان ، وذكر قصة وفيها : فقلت يا رسول الله ، زعم أنه يعلمني كلمات ينفعني الله بها فخليت سبيله ، قال : ( ما هي ) ؟ قلت قال لي : إذا آويت إلى فراشك فاقرأ آية الكرسي من أولها حتى تختم الله لا إله إلا هو الحي القيوم . وقال لي : لن يزال عليك من الله حافظ ولا يقربك شيطان حتى تصبح ، وكانوا أحرص شيء على الخير . فقال النبي صلى الله عليه وسلم : ( أما إنه قد صدقك وهو كذوب تعلم من تخاطب منذ ثلاث ليال يا أبا هريرة ) ؟ قال : لا ، قال : ( ذاك شيطان ) . وفي مسند الدارمي أبي محمد قال الشعبي قال عبد الله بن مسعود : لقي رجل من أصحاب محمد صلى الله عليه وسلم رجلا من الجن فصارعه فصرعه الإنسي ، فقال له الإنسي : إني لأراك ضئيلا شخيتا كأن ذريعتيك ذريعتا كلب فكذلك أنتم معشر الجن ، أم أنت من بينهم كذلك ؟ قال : لا والله إني منهم لضليع ولكن عاودني الثانية فإن صرعتني علمتك شيئا ينفعك ، قال نعم ، فصرعه ، قال : تقرأ آية الكرسي : الله لا إله إلا هو الحي القيوم ؟ قال : نعم ، قال : فإنك لا تقرأها في بيت إلا خرج منه الشيطان له خبج كخبج الحمار ثم لا يدخله حتى يصبح . أخرجه أبو نعيم عن أبي عاصم الثقفي عن الشعبي . وذكره أبو عبيدة في غريب حديث عمر حدثناه أبو معاوية عن أبي عاصم الثقفي عن الشعبي عن عبد الله قال : فقيل لعبد الله : أهو عمر ؟ فقال : ما عسى أن يكون إلا عمر . قال أبو محمد الدارمي : الضئيل : الدقيق ، والشخيت : المهزول ، والضليع : جيد الأضلاع ، والخبج : الريح . وقال أبو عبيدة : الخبج : الضراط ، وهو الحبج أيضا بالحاء . وفي الترمذي عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : من قرأ حم - المؤمن - إلى إليه المصير وآية الكرسي حين يصبح حفظ بهما حتى يمسي ، ومن قرأهما حين يمسي حفظ بهما حتى يصبح قال : حديث غريب . وقال أبو عبد الله الترمذي الحكيم : وروي أن المؤمنين ندبوا إلى المحافظة على قراءتها دبر كل صلاة . عن أنس رفع الحديث إلى النبي صلى الله عليه وسلم قال : أوحى الله إلى موسى عليه السلام من داوم على قراءة آية الكرسي دبر كل صلاة أعطيته فوق ما أعطي الشاكرين وأجر النبيين وأعمال الصديقين وبسطت عليه يميني بالرحمة ولم يمنعه أن أدخله الجنة إلا أن يأتيه ملك الموت ) قال موسى عليه السلام : يا رب من سمع بهذا لا يداوم عليه ؟ قال : ( إني لا أعطيه من عبادي إلا لنبي أو صديق أو رجل أحبه أو رجل أريد قتله في سبيلي . وعن أبي بن كعب قال : قال الله تعالى : ( يا موسى من قرأ آية الكرسي في دبر كل صلاة أعطيته ثواب الأنبياء ) قال أبو عبد الله : معناه عندي أعطيته ثواب عمل الأنبياء ، فأما ثواب النبوة فليس لأحد إلا للأنبياء . وهذه الآية تضمنت التوحيد والصفات العلا ، وهي خمسون كلمة ، وفي كل كلمة خمسون بركة ، وهي تعدل ثلث القرآن ، ورد بذلك الحديث ، ذكره ابن عطية . و ( الله ) مبتدأ ، و ( لا إله ) مبتدأ ثان وخبره محذوف تقديره معبود أو موجود . و ( إلا هو ) بدل من موضع لا إله . وقيل : الله لا إله إلا هو ابتداء وخبر ، وهو مرفوع محمول على المعنى ، أي ما إله إلا هو ، ويجوز في غير القرآن لا إله إلا إياه ، نصب على الاستثناء . قال أبو ذر في حديثه الطويل : سألت رسول الله صلى الله عليه وسلم أي آية أنزل الله عليك من القرآن أعظم ؟ فقال : الله لا إله إلا هو الحي القيوم . وقال ابن عباس : أشرف آية في القرآن آية الكرسي . قال بعض العلماء : لأنه يكرر فيها اسم الله تعالى بين مضمر وظاهر ثماني عشرة مرة .\n( الحي القيوم ) نعت لله عز وجل ، وإن شئت كان بدلا من هو ، وإن شئت كان خبرا بعد خبر ، وإن شئت على إضمار مبتدإ . ويجوز في غير القرآن النصب على المدح . و ( الحي ) اسم من أسمائه الحسنى يسمى به ، ويقال : إنه اسم الله تعالى الأعظم . ويقال : إن عيسى ابن مريم عليه السلام كان إذا أراد أن يحيي الموتى يدعو بهذا الدعاء : يا حي يا قيوم . ويقال : إن آصف بن برخيا لما أراد أن يأتي بعرش بلقيس إلى سليمان دعا بقوله يا حي يا قيوم . ويقال : إن بني إسرائيل سألوا موسى عن اسم الله الأعظم فقال لهم : أيا هيا شرا هيا ، يعني يا حي يا قيوم . ويقال : هو دعاء أهل البحر إذا خافوا الغرق يدعون به . قال الطبري عن قوم : إنه يقال حي قيوم كما وصف نفسه ، ويسلم ذلك دون أن ينظر فيه . وقيل : سمى نفسه حيا لصرفه الأمور مصاريفها وتقديره الأشياء مقاديرها . وقال قتادة : الحي الذي لا يموت . وقال السدي : المراد بالحي الباقي . قال لبيد :\nفإما تريني اليوم أصبحت سالما فلست بأحيا من كلاب وجعفر\nوقد قيل : إن هذا الاسم هو اسم الله الأعظم . القيوم من قام ، أي القائم بتدبير ما خلق ، عن قتادة . وقال الحسن : معناه القائم على كل نفس بما كسبت حتى يجازيها بعملها ، من حيث هو عالم بها لا يخفى عليه شيء منها . وقال ابن عباس : معناه الذي لا يحول ولا يزول ، قال أمية بن أبي الصلت :\nلم تخلق السماء والنجوم والشمس معها قمر يقوم\nقدره مهيمن قيوم والحشر والجنة والنعيم\nإلا لأمر شأنه عظيم\nقال البيهقي : ورأيت في \" عيون التفسير \" لإسماعيل الضرير في تفسير \" القيوم \" قال : ويقال هو الذي لا ينام ، وكأنه أخذه من قوله عز وجل عقيبه في آية الكرسي : لا تأخذه سنة ولا نوم . وقال الكلبي : القيوم الذي لا بديء له ، ذكره أبو بكر الأنباري . وأصل قيوم قيووم اجتمعت الواو والياء وسبقت إحداهما بالسكون فأدغمت الأولى في الثانية بعد قلب الواو ياء ، ولا يكون قيوم فعولا ؛ لأنه من الواو فكان يكون قووما . وقرأ ابن مسعود وعلقمة والأعمش والنخعي \" الحي القيام \" بالألف ، وروي ذلك عن عمر . ولا خلاف بين أهل اللغة في أن القيوم أعرف عند العرب وأصح بناء وأثبت علة . و \" القيام \" منقول عن القوام إلى القيام ، صرف عن الفعال إلى الفيعال ، كما قيل للصواغ الصياغ ، قال الشاعر :\nإن ذا العرش للذي يرزق النا س وحي عليهم قيوم\nثم نفى عز وجل أن تأخذه سنة ولا نوم . والسنة : النعاس في قول الجميع . والنعاس ما كان من العين فإذا صار في القلب صار نوما ، قال عدي بن الرقاع يصف امرأة بفتور النظر :\nوسنان أقصده النعاس فرنقت في عينه سنة وليس بنائم\nوفرق المفضل بينهما فقال : السنة من الرأس ، والنعاس في العين ، والنوم في القلب . وقال ابن زيد : الوسنان الذي يقوم من النوم وهو لا يعقل ، حتى ربما جرد السيف على أهله . قال ابن عطية : وهذا الذي قاله ابن زيد فيه نظر ، وليس ذلك بمفهوم من كلام العرب . وقال السدي : السنة : ريح النوم الذي يأخذ في الوجه فينعس الإنسان .\nقلت : وبالجملة فهو فتور يعتري الإنسان ولا يفقد معه عقله . والمراد بهذه الآية أن الله تعالى لا يدركه خلل ولا يلحقه ملل بحال من الأحوال . والأصل في \" سنة \" وسنة حذفت الواو كما حذفت من يسن . والنوم هو المستثقل الذي يزول معه الذهن في حق البشر . والواو للعطف و ( لا ) توكيد .\nقلت : والناس يذكرون في هذا الباب عن أبي هريرة قال : سمعت رسول الله صلى الله عليه وسلم يحكي عن موسى على المنبر قال : ( وقع في نفس موسى هل ينام الله جل ثناؤه فأرسل الله إليه ملكا فأرقه ثلاثا ثم أعطاه قارورتين في كل يد قارورة وأمره أن يحتفظ بهما قال فجعل ينام وتكاد يداه تلتقيان ثم يستيقظ فينحي أحديهما عن الأخرى حتى نام نومة فاصطفقت يداه فانكسرت القارورتان - قال - ضرب الله له مثلا أن لو كان ينام لم تتمسك السماء والأرض ) ولا يصح هذا الحديث ، ضعفه غير واحد منهم البيهقي .\nقوله تعالى : له ما في السماوات وما في الأرض أي بالملك فهو مالك الجميع وربه وجاءت العبارة ب \" ما \" وإن كان في الجملة من يعقل من حيث المراد الجملة والموجود . قال الطبري : نزلت هذه الآية لما قال الكفار : ما نعبد أوثانا إلا ليقربونا إلى الله زلفى .\nقوله تعالى : من ذا الذي يشفع عنده إلا بإذنه \" من \" رفع بالابتداء و \" ذا \" خبره ، و \" الذي \" نعت ل \" ذا \" ، وإن شئت بدل ، ولا يجوز أن تكون \" ذا \" زائدة كما زيدت مع \" ما \" لأن \" ما \" مبهمة فزيدت \" ذا \" معها لشبهها بها . وتقرر في هذه الآية أن الله يأذن لمن يشاء في الشفاعة ، وهم الأنبياء والعلماء والمجاهدون والملائكة وغيرهم ممن أكرمهم وشرفهم الله ، ثم لا يشفعون إلا لمن ارتضى ، كما قال : ولا يشفعون إلا لمن ارتضى قال ابن عطية : والذي يظهر أن العلماء والصالحين يشفعون فيمن لم يصل إلى النار وهو بين المنزلتين ، أو وصل ولكن له أعمال صالحة . وفي البخاري في \" باب بقية من أبواب الرؤية \" : إن المؤمنين يقولون : ربنا إن إخواننا كانوا يصلون معنا ويصومون معنا . وهذه شفاعة فيمن يقرب أمره ، وكما يشفع الطفل المحبنطئ على باب الجنة . وهذا إنما هو في قراباتهم ومعارفهم . وإن الأنبياء يشفعون فيمن حصل في النار من عصاة أممهم بذنوب دون قربى ولا معرفة إلا بنفس الإيمان ، ثم تبقى شفاعة أرحم الراحمين في المستغرقين في الخطايا والذنوب الذين لم تعمل فيهم شفاعة الأنبياء . وأما شفاعة محمد صلى الله عليه وسلم في تعجيل الحساب فخاصة له .\nقلت : قد بين مسلم في صحيحه كيفية الشفاعة بيانا شافيا ، وكأنه رحمه الله لم يقرأه وأن الشافعين يدخلون النار ويخرجون منها أناسا استوجبوا العذاب ، فعلى هذا لا يبعد أن يكون للمؤمنين شفاعتان : شفاعة فيمن لم يصل إلى النار ، وشفاعة فيمن وصل إليها ودخلها ، أجارنا الله منها . فذكر من حديث أبي سعيد الخدري : ( ثم يضرب الجسر على جهنم وتحل الشفاعة ويقولون اللهم سلم سلم - قيل : يا رسول الله وما الجسر ؟ قال : دحض مزلة فيها خطاطيف وكلاليب وحسكة تكون بنجد فيها شويكة يقال لها السعدان فيمر المؤمنون كطرف العين وكالبرق وكالريح وكالطير وكأجاويد الخيل والركاب فناج مسلم ومخدوش مرسل ومكدوس في نار جهنم حتى إذا خلص المؤمنون من النار فوالذي نفسي بيده ما من أحد منكم بأشد مناشدة لله في استيفاء الحق من المؤمنين لله يوم القيامة لإخوانهم الذين في النار ، يقولون ربنا كانوا يصومون معنا ويصلون ويحجون ، فيقال لهم أخرجوا من عرفتم ، فتحرم صورهم على النار فيخرجون خلقا كثيرا قد أخذت النار إلى نصف ساقيه وإلى ركبتيه ثم يقولون ربنا ما بقي فيها أحد ممن أمرتنا به ، فيقول عز وجل ارجعوا فمن وجدتم في قلبه مثقال دينار من خير فأخرجوه ، فيخرجون خلقا كثيرا ، ثم يقولون ربنا لم نذر فيها أحدا ممن أمرتنا به ، ثم يقول ارجعوا فمن وجدتم في قلبه مثقال نصف دينار من خير فأخرجوه ، فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها أحدا ممن أمرتنا به ، ثم يقول ارجعوا فمن وجدتم في قلبه مثقال ذرة من خير فأخرجوه ، فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها خيرا - وكان أبو سعيد يقول : إن لم تصدقوني بهذا الحديث فاقرءوا إن شئتم إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما ( فيقول الله تعالى : شفعت الملائكة وشفع النبيون وشفع المؤمنون ولم يبق إلا أرحم الراحمين فيقبض قبضة من النار فيخرج منها قوما لم يعملوا خيرا قط قد عادوا حمما ) وذكر الحديث . وذكر من حديث أنس عن النبي صلى الله عليه وسلم : ( فأقول يا رب ائذن لي فيمن قال لا إله إلا الله قال ليس ذلك لك - أو قال ليس ذلك إليك - وعزتي وكبريائي وعظمتي وجبريائي لأخرجن من قال لا إله إلا الله ) . وذكر من حديث أبي هريرة عنه عليه الصلاة والسلام : ( حتى إذا فرغ الله من القضاء بين العباد وأراد أن يخرج برحمته من أراد من أهل النار أمر الملائكة أن يخرجوا من النار من كان لا يشرك بالله شيئا ممن أراد الله تعالى أن يرحمه ممن يقول لا إله إلا الله فيعرفونهم في النار يعرفونهم بأثر السجود تأكل النار ابن آدم إلا أثر السجود حرم الله على النار أن تأكل أثر السجود ) الحديث بطوله .\nقلت : فدلت هذه الأحاديث على أن شفاعة المؤمنين وغيرهم إنما هي لمن دخل النار وحصل فيها ، أجارنا الله منها وقول ابن عطية : \" ممن لم يصل أو وصل \" يحتمل أن يكون أخذه من أحاديث أخر ، والله أعلم . وقد خرج ابن ماجه في سننه عن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : يصف الناس يوم القيامة صفوفا - وقال ابن نمير أهل الجنة - فيمر الرجل من أهل النار على الرجل فيقول يا فلان أما تذكر يوم استسقيت فسقيتك شربة ؟ قال فيشفع له ويمر الرجل على الرجل فيقول أما تذكر يوم ناولتك طهورا ؟ فيشفع له - قال ابن نمير - ويقول يا فلان أما تذكر يوم بعثتني لحاجة كذا وكذا فذهبت لك ؟ فيشفع له .\nوأما شفاعات نبينا محمد صلى الله عليه وسلم فاختلف فيها ، فقيل ثلاث ، وقيل اثنتان ، وقيل : خمس ، يأتي بيانها في \" سبحان \" إن شاء الله تعالى . وقد أتينا عليها في كتاب \" التذكرة \" والحمد لله .\nقوله تعالى : يعلم ما بين أيديهم وما خلفهم الضميران عائدان على كل من يعقل ممن تضمنه قوله : له ما في السماوات وما في الأرض . وقال مجاهد ) ما بين أيديهم ) الدنيا ( وما خلفهم ) الآخرة . قال ابن عطية : وكل هذا صحيح في نفسه لا بأس به ؛ لأن ما بين اليد هو كل ما تقدم الإنسان ، وما خلفه هو كل ما يأتي بعده ، وبنحو قول مجاهد قال السدي وغيره .\nقوله تعالى : ولا يحيطون بشيء من علمه إلا بما شاء العلم هنا بمعنى المعلوم ، أي ولا يحيطون بشيء من معلوماته ، وهذا كقول الخضر لموسى عليه السلام حين نقر العصفور في البحر : ما نقص علمي وعلمك من علم الله إلا كما نقص هذا العصفور من هذا البحر . فهذا وما شاكله راجع إلى المعلومات لأن علم الله سبحانه وتعالى الذي هو صفة ذاته لا يتبعض . ومعنى الآية لا معلوم لأحد إلا ما شاء الله أن يعلمه .\nقوله تعالى : وسع كرسيه السماوات والأرض ذكر ابن عساكر في تاريخه عن علي رضي الله عنه قال قال رسول الله صلى الله عليه وسلم : ( الكرسي لؤلؤة والقلم لؤلؤة وطول القلم سبعمائة سنة وطول الكرسي حيث لا يعلمه إلا الله ) . وروى حماد بن سلمة عن عاصم بن بهدلة - وهو عاصم بن أبي النجود - عن زر بن حبيش عن ابن مسعود قال : بين كل سماءين مسيرة خمسمائة عام وبين السماء السابعة وبين الكرسي خمسمائة عام ، وبين الكرسي وبين العرش مسيرة خمسمائة عام ، والعرش فوق الماء والله فوق العرش يعلم ما أنتم فيه وعليه . يقال كرسي وكرسي والجمع الكراسي . وقال ابن عباس : كرسيه علمه . ورجحه الطبري ، قال : ومنه الكراسة التي تضم العلم ، ومنه قيل للعلماء : الكراسي ؛ لأنهم المعتمد عليهم ، كما يقال : أوتاد الأرض قال الشاعر :\nيحف بهم بيض الوجوه وعصبة كراسي بالأحداث حين تنوب\nأي علماء بحوادث الأمور . وقيل : كرسيه قدرته التي يمسك بها السماوات والأرض ، كما تقول : اجعل لهذا الحائط كرسيا ، أي ما يعمده . وهذا قريب من قول ابن عباس في قوله وسع كرسيه . قال البيهقي : وروينا عن ابن مسعود وسعيد بن جبير عن ابن عباس في قوله وسع كرسيه قال : علمه . وسائر الروايات عن ابن عباس وغيره تدل على أن المراد به الكرسي المشهور مع العرش . وروى إسرائيل عن السدي عن أبي مالك في قوله وسع كرسيه السماوات والأرض قال : إن الصخرة التي عليها الأرض السابعة ومنتهى الخلق على أرجائها ، عليها أربعة من الملائكة لكل واحد منهم أربعة وجوه : وجه إنسان ووجه أسد ووجه ثور ووجه نسر ، فهم قيام عليها قد أحاطوا بالأرضين والسماوات ، ورءوسهم تحت الكرسي والكرسي تحت العرش والله واضع كرسيه فوق العرش . قال البيهقي : في هذا إشارة إلى كرسيين : أحدهما تحت العرش ، والآخر موضوع على العرش . وفي رواية أسباط عن السدي عن أبي مالك ، وعن أبي صالح عن ابن عباس ، وعن مرة الهمداني عن ابن مسعود عن ناس من أصحاب رسول الله صلى الله عليه وسلم في قوله وسع كرسيه السماوات والأرض فإن السماوات والأرض في جوف الكرسي والكرسي بين يدي العرش . وأرباب الإلحاد يحملونها على عظم الملك وجلالة السلطان ، وينكرون وجود العرش والكرسي وليس بشيء . وأهل الحق يجيزونهما ، إذ في قدرة الله متسع فيجب الإيمان بذلك . قال أبو موسى الأشعري : الكرسي موضع القدمين وله أطيط كأطيط الرحل . قال البيهقي : قد روينا أيضا في هذا عن ابن عباس وذكرنا أن معناه فيما يرى أنه موضوع من العرش موضع القدمين من السرير ، وليس فيه إثبات المكان لله تعالى . وعن ابن بريدة عن أبيه قال : لما قدم جعفر من الحبشة قال له رسول الله صلى الله عليه وسلم : ( ما أعجب شيء رأيته ) ؟ قال : رأيت امرأة على رأسها مكتل طعام فمر فارس فأذراه فقعدت تجمع طعامها ، ثم التفتت إليه فقالت له : ويل لك يوم يضع الملك كرسيه فيأخذ للمظلوم من الظالم فقال رسول الله صلى الله عليه وسلم تصديقا لقولها : ( لا قدست أمة - أو كيف تقدس أمة - لا يأخذ ضعيفها حقه من شديدها ) . قال ابن عطية : في قول أبي موسى \" الكرسي موضع القدمين \" يريد هو من عرش الرحمن كموضع القدمين من أسرة الملوك ، فهو مخلوق عظيم بين يدي العرش نسبته إليه كنسبة الكرسي إلى سرير الملك . وقال الحسن بن أبي الحسن : الكرسي هو العرش نفسه ، وهذا ليس بمرضي ، والذي تقتضيه الأحاديث أن الكرسي مخلوق بين يدي العرش والعرش أعظم منه . وروى أبو إدريس الخولاني عن أبي ذر قال : قلت يا رسول الله ، أي ما أنزل عليك أعظم ؟ قال : ( آية الكرسي - ثم قال - يا أبا ذر ما السماوات السبع مع الكرسي إلا كحلقة ملقاة في أرض فلاة وفضل العرش على الكرسي كفضل الفلاة على الحلقة ) . أخرجه الآجري وأبو حاتم البستي في صحيح مسنده والبيهقي وذكر أنه صحيح . وقال مجاهد : ما السماوات والأرض في الكرسي إلا بمنزلة حلقة ملقاة في أرض فلاة . وهذه الآية منبئة عن عظم مخلوقات الله تعالى ، ويستفاد من ذلك عظم قدرة الله عز وجل إذ لا يؤوده حفظ هذا الأمر العظيم .\nو ( يؤوده ) معناه يثقله ، يقال : آدني الشيء بمعنى أثقلني وتحملت منه المشقة ، وبهذا فسر اللفظة ابن عباس والحسن وقتادة وغيرهم . قال الزجاج : فجائز أن تكون الهاء لله عز وجل ، وجائز أن تكون للكرسي ، وإذا كانت للكرسي ، فهو من أمر الله تعالى . و ( العلي ) يراد به علو القدر والمنزلة لا علو المكان ؛ لأن الله منزه عن التحيز . وحكى الطبري عن قوم أنهم قالوا : هو العلي عن خلقه بارتفاع مكانه عن أماكن خلقه . قال ابن عطية : وهذا قول جهلة مجسمين ، وكان الوجه ألا يحكى . وعن عبد الرحمن بن قرط أن رسول الله صلى الله عليه وسلم ليلة أسري به سمع تسبيحا في السماوات العلى : سبحان الله العلي الأعلى سبحانه وتعالى . والعلي والعالي : القاهر الغالب للأشياء ، تقول العرب : علا فلان فلانا أي غلبه وقهره ، قال الشاعر :\nفلما علونا واستوينا عليهم تركناهم صرعى لنسر وكاسر\nومنه قوله تعالى : إن فرعون علا في الأرض . و ( العظيم ) صفة بمعنى عظيم القدر والخطر والشرف ، لا على معنى عظم الأجرام . وحكى الطبري عن قوم أن العظيم معناه المعظم ، كما يقال : العتيق بمعنى المعتق ، وأنشد بيت الأعشى :\nفكأن الخمر العتيق من الإس فنط ممزوجة بماء زلال\nوحكي عن قوم أنهم أنكروا ذلك وقالوا : لو كان بمعنى معظم لوجب ألا يكون عظيما قبل أن يخلق الخلق وبعد فنائهم ، إذ لا معظم له حينئذ .\n                                    ",
        "saadi": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَ‍ُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ ٥٥٢\n                                        \n                                        \n                                        \n                                        هذه الآية الكريمة أعظم آيات القرآن وأفضلها وأجلها، وذلك لما اشتملت عليه من الأمور العظيمة والصفات الكريمة، فلهذا كثرت الأحاديث في الترغيب في قراءتها وجعلها وردا للإنسان في أوقاته صباحا ومساء وعند نومه وأدبار الصلوات المكتوبات، فأخبر تعالى عن نفسه الكريمة بأن { لا إله إلا هو } أي: لا معبود بحق سواه، فهو الإله الحق الذي تتعين أن تكون جميع أنواع العبادة والطاعة والتأله له تعالى، لكماله وكمال صفاته وعظيم نعمه، ولكون العبد مستحقا أن يكون عبدا لربه، ممتثلا أوامره مجتنبا نواهيه، وكل ما سوى الله تعالى باطل، فعبادة ما سواه باطلة، لكون ما سوى الله مخلوقا ناقصا مدبرا فقيرا من جميع الوجوه، فلم يستحق شيئا من أنواع العبادة، وقوله: { الحي القيوم } هذان الاسمان الكريمان يدلان على سائر الأسماء الحسنى دلالة مطابقة وتضمنا ولزوما، فالحي من له الحياة الكاملة المستلزمة لجميع صفات الذات، كالسمع والبصر والعلم والقدرة، ونحو ذلك، والقيوم: هو الذي قام بنفسه وقام بغيره، وذلك مستلزم لجميع الأفعال التي اتصف بها رب العالمين من فعله ما يشاء من الاستواء والنزول والكلام والقول والخلق والرزق والإماتة والإحياء، وسائر أنواع التدبير، كل ذلك داخل في قيومية الباري، ولهذا قال بعض المحققين: إنهما الاسم الأعظم الذي إذا دعي الله به أجاب، وإذا سئل به أعطى، ومن تمام حياته وقيوميته أن { لا تأخذه سنة ولا نوم } والسنة النعاس { له ما في السماوات وما في الأرض } أي: هو المالك وما سواه مملوك وهو الخالق الرازق المدبر وغيره مخلوق مرزوق مدبر لا يملك لنفسه ولا لغيره مثقال ذرة في السماوات ولا في الأرض فلهذا قال: { من ذا الذي يشفع عنده إلا بإذنه } أي: لا أحد يشفع عنده بدون إذنه، فالشفاعة كلها لله تعالى، ولكنه تعالى إذا أراد أن يرحم من يشاء من عباده أذن لمن أراد أن يكرمه من عباده أن يشفع فيه، لا يبتدئ الشافع قبل الإذن، ثم قال { يعلم ما بين أيديهم } أي: ما مضى من جميع الأمور { وما خلفهم } أي: ما يستقبل منها، فعلمه تعالى محيط بتفاصيل الأمور، متقدمها ومتأخرها، بالظواهر والبواطن، بالغيب والشهادة، والعباد ليس لهم من الأمر شيء ولا من العلم مثقال ذرة إلا ما علمهم تعالى، ولهذا قال: { ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض } وهذا يدل على كمال عظمته وسعة سلطانه، إذا كان هذه حالة الكرسي أنه يسع السماوات والأرض على عظمتهما وعظمة من فيهما، والكرسي ليس أكبر مخلوقات الله تعالى، بل هنا ما هو أعظم منه وهو العرش، وما لا يعلمه إلا هو، وفي عظمة هذه المخلوقات تحير الأفكار وتكل الأبصار، وتقلقل الجبال وتكع عنها فحول الرجال، فكيف بعظمة خالقها ومبدعها، والذي أودع فيها من الحكم والأسرار ما أودع، والذي قد أمسك السماوات والأرض أن تزولا من غير تعب ولا نصب، فلهذا قال: { ولا يؤوده } أي: يثقله { حفظهما وهو العلي } بذاته فوق عرشه، العلي بقهره لجميع المخلوقات، العلي بقدره لكمال صفاته { العظيم } الذي تتضائل عند عظمته جبروت الجبابرة، وتصغر في جانب جلاله أنوف الملوك القاهرة، فسبحان من له العظمة العظيمة والكبرياء الجسيمة والقهر والغلبة لكل شيء، فقد اشتملت هذه الآية على توحيد الإلهية وتوحيد الربوبية وتوحيد الأسماء والصفات، وعلى إحاطة ملكه وإحاطة علمه وسعة سلطانه وجلاله ومجده، وعظمته وكبريائه وعلوه على جميع مخلوقاته، فهذه الآية بمفردها عقيدة في أسماء الله وصفاته، متضمنة لجميع الأسماء الحسنى والصفات العلا\n                                    "
      },
      "originalText": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ وَلَا يُحِيطُونَ بِشَيۡءٖ مِّنۡ عِلۡمِهِۦٓ إِلَّا بِمَا شَآءَۚ وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ وَلَا يَ‍ُٔودُهُۥ حِفۡظُهُمَاۚ وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ ٥٥٢"
    },
    {
      "number": 263,
      "text": "لَا إِكْرَاهَ فِي الدِّينِ ۖ قَدْ تَبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِنْ بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ لَا انْفِصَامَ لَهَا ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 256,
      "juz": 3,
      "manzil": 1,
      "page": 42,
      "ruku": 35,
      "hizbQuarter": 17,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَآ إِكۡرَاهَ فِي ٱلدِّينِۖ قَد تَّبَيَّنَ ٱلرُّشۡدُ مِنَ ٱلۡغَيِّۚ فَمَن يَكۡفُرۡ بِٱلطَّٰغُوتِ وَيُؤۡمِنۢ بِٱللَّهِ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰ لَا ٱنفِصَامَ لَهَاۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٦٥٢\n                                        \n                                        \n                                        يقول تعالى : ( لا إكراه في الدين ) أي : لا تكرهوا أحدا على الدخول في دين الإسلام فإنه بين واضح جلي دلائله وبراهينه لا يحتاج إلى أن يكره أحد على الدخول فيه ، بل من هداه الله للإسلام وشرح صدره ونور بصيرته دخل فيه على بينة ، ومن أعمى الله قلبه وختم على سمعه وبصره فإنه لا يفيده الدخول في الدين مكرها مقسورا . وقد ذكروا أن سبب نزول هذه الآية في قوم من الأنصار ، وإن كان حكمها عاما .\nوقال ابن جرير : حدثنا ابن بشار حدثنا ابن أبي عدي عن شعبة عن أبي بشر ، عن سعيد بن جبير عن ابن عباس قال : كانت المرأة تكون مقلاتا فتجعل على نفسها إن عاش لها ولد أن تهوده ، فلما أجليت بنو النضير كان فيهم من أبناء الأنصار فقالوا : لا ندع أبناءنا فأنزل الله عز وجل : ( لا إكراه في الدين قد تبين الرشد من الغي )\nوقد رواه أبو داود والنسائي جميعا عن بندار به ومن وجوه أخر عن شعبة به نحوه . وقد رواه ابن أبي حاتم وابن حبان في صحيحه من حديث شعبة به ، وهكذا ذكر مجاهد وسعيد بن جبير والشعبي والحسن البصري وغيرهم : أنها نزلت في ذلك .\nوقال محمد بن إسحاق عن محمد بن أبي محمد الجرشي عن زيد بن ثابت عن عكرمة أو عن سعيد [ بن جبير ] عن ابن عباس قوله : ( لا إكراه في الدين ) قال : نزلت في رجل من الأنصار من بني سالم بن عوف يقال له : الحصيني كان له ابنان نصرانيان ، وكان هو رجلا مسلما فقال للنبي صلى الله عليه وسلم : ألا أستكرههما فإنهما قد أبيا إلا النصرانية ؟ فأنزل الله فيه ذلك .\nرواه ابن جرير وروى السدي نحو ذلك وزاد : وكانا قد تنصرا على يدي تجار قدموا من الشام يحملون زيتا فلما عزما على الذهاب معهم أراد أبوهما أن يستكرههما ، وطلب من رسول الله صلى الله عليه وسلم أن يبعث في آثارهما ، فنزلت هذه الآية .\nوقال ابن أبي حاتم : حدثنا أبي حدثنا عمرو بن عوف أخبرنا شريك عن أبي هلال عن أسق قال : كنت في دينهم مملوكا نصرانيا لعمر بن الخطاب فكان يعرض علي الإسلام فآبى فيقول : ( لا إكراه في الدين ) ويقول : يا أسق لو أسلمت لاستعنا بك على بعض أمور المسلمين .\nوقد ذهب طائفة كثيرة من العلماء أن هذه محمولة على أهل الكتاب ومن دخل في دينهم قبل النسخ والتبديل إذا بذلوا الجزية . وقال آخرون : بل هي منسوخة بآية القتال وأنه يجب أن يدعى جميع الأمم إلى الدخول في الدين الحنيف دين الإسلام ، فإن أبى أحد منهم الدخول فيه ولم ينقد له أو يبذل الجزية ، قوتل حتى يقتل . وهذا معنى الإكراه قال الله تعالى : ( ستدعون إلى قوم أولي بأس شديد تقاتلونهم أو يسلمون ) [ الفتح : 16 ] وقال تعالى : ( يا أيها النبي جاهد الكفار والمنافقين واغلظ عليهم ) [ التحريم : 9 ] وقال تعالى : ( يا أيها الذين آمنوا قاتلوا الذين يلونكم من الكفار وليجدوا فيكم غلظة واعلموا أن الله مع المتقين ) [ التوبة : 123 ] وفي الصحيح : \" عجب ربك من قوم يقادون إلى الجنة في السلاسل \" يعني : الأسارى الذين يقدم بهم بلاد الإسلام في الوثائق والأغلال والقيود والأكبال ثم بعد ذلك يسلمون وتصلح أعمالهم وسرائرهم فيكونون من أهل الجنة .\nفأما الحديث الذي رواه الإمام أحمد : حدثنا يحيى عن حميد عن أنس : أن رسول الله صلى الله عليه وسلم قال لرجل : \" أسلم \" قال : إني أجدني كارها . قال : \" وإن كنت كارها \" فإنه ثلاثي صحيح ، ولكن ليس من هذا القبيل ، فإنه لم يكرهه النبي صلى الله عليه وسلم على الإسلام بل دعاه إليه فأخبر أن نفسه ليست قابلة له بل هي كارهة فقال له : \" أسلم وإن كنت كارها ؛ فإن الله سيرزقك حسن النية والإخلاص \" .\nوقوله : ( فمن يكفر بالطاغوت ويؤمن بالله فقد استمسك بالعروة الوثقى لا انفصام لها والله سميع عليم ) أي : من خلع الأنداد والأوثان وما يدعو إليه الشيطان من عبادة كل ما يعبد من دون الله ، ووحد الله فعبده وحده وشهد أن لا إله إلا هو ( فقد استمسك بالعروة الوثقى ) أي : فقد ثبت في أمره واستقام على الطريقة المثلى والصراط المستقيم .\nقال أبو القاسم البغوي : حدثنا أبو روح البلدي حدثنا أبو الأحوص سلام بن سليم ، عن أبي إسحاق عن حسان هو ابن فائد العبسي قال : قال عمر رضي الله عنه : إن الجبت : السحر ، والطاغوت : الشيطان ، وإن الشجاعة والجبن غرائز تكون في الرجال ، يقاتل الشجاع عمن لا يعرف ويفر الجبان من أمه ، وإن كرم الرجل دينه ، وحسبه خلقه ، وإن كان فارسيا أو نبطيا . وهكذا رواه ابن جرير وابن أبي حاتم من حديث الثوري عن أبي إسحاق عن حسان بن فائد العبسي عن عمر فذكره .\nومعنى قوله في الطاغوت : إنه الشيطان قوي جدا فإنه يشمل كل شر كان عليه أهل الجاهلية ، من عبادة الأوثان والتحاكم إليها والاستنصار بها .\nوقوله : ( فقد استمسك بالعروة الوثقى لا انفصام لها ) أي : فقد استمسك من الدين بأقوى سبب ، وشبه ذلك بالعروة الوثقى التي لا تنفصم فهي في نفسها محكمة مبرمة قوية وربطها قوي شديد ولهذا قال : ( فقد استمسك بالعروة الوثقى لا انفصام لها والله سميع عليم ) .\nقال مجاهد : ( فقد استمسك بالعروة الوثقى ) يعني : الإيمان . وقال السدي : هو الإسلام . وقال سعيد بن جبير والضحاك : يعني لا إله إلا الله . وعن أنس بن مالك : ( بالعروة الوثقى ) : القرآن . وعن سالم بن أبي الجعد قال : هو الحب في الله والبغض في الله .\nوكل هذه الأقوال صحيحة ولا تنافي بينها .\nوقال معاذ بن جبل في قوله : ( لا انفصام لها ) أي : لا انقطاع لها دون دخول الجنة .\nوقال مجاهد وسعيد بن جبير : ( فقد استمسك بالعروة الوثقى لا انفصام لها ) ثم قرأ : ( إن الله لا يغير ما بقوم حتى يغيروا ما بأنفسهم ) [ الرعد : 11 ] .\nوقال الإمام أحمد : حدثنا إسحاق بن يوسف حدثنا ابن عون عن محمد عن قيس بن عباد قال : كنت في المسجد فجاء رجل في وجهه أثر من خشوع ، فدخل فصلى ركعتين أوجز فيهما فقال القوم : هذا رجل من أهل الجنة . فلما خرج اتبعته حتى دخل منزله فدخلت معه فحدثته فلما استأنس قلت له : إن القوم لما دخلت قبل المسجد قالوا كذا وكذا . قال : سبحان الله ما ينبغي لأحد أن يقول ما لا يعلم ، وسأحدثك لم : إني رأيت رؤيا على عهد رسول الله صلى الله عليه وسلم فقصصتها عليه : رأيت كأني في روضة خضراء - قالابن عون : فذكر من خضرتها وسعتها - وسطها عمود حديد أسفله في الأرض وأعلاه في السماء في أعلاه عروة ، فقيل لي : اصعد عليه فقلت : لا أستطيع . فجاءني منصف قال ابن عون : هو الوصيف ، فرفع ثيابي من خلفي ، فقال : اصعد . فصعدت حتى أخذت بالعروة فقال : استمسك بالعروة . فاستيقظت وإنها لفي يدي ، فأتيت رسول الله صلى الله عليه وسلم فقصصتها عليه . فقال : \" أما الروضة فروضة الإسلام ، وأما العمود فعمود الإسلام ، وأما العروة فهي العروة الوثقى ، أنت على الإسلام حتى تموت \" .\nقال : وهو عبد الله بن سلام أخرجاه في الصحيحين من حديث عبد الله بن عون وأخرجه البخاري من وجه آخر ، عن محمد بن سيرين به .\nطريق أخرى وسياق آخر : قال الإمام أحمد : حدثنا حسن بن موسى وعفان قالا : حدثنا حماد بن سلمة ، عن عاصم بن بهدلة عن المسيب بن رافع عن خرشة بن الحر قال : قدمت المدينة فجلست إلى مشيخة في مسجد النبي صلى الله عليه وسلم . فجاء شيخ يتوكأ على عصا له فقال القوم : من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا . فقام خلف سارية فصلى ركعتين فقمت إليه ، فقلت له : قال بعض القوم : كذا وكذا . فقال : الجنة لله يدخلها من يشاء ، وإني رأيت على عهد رسول الله صلى الله عليه وسلم رؤيا ، رأيت كأن رجلا أتاني فقال : انطلق . فذهبت معه فسلك بي منهجا عظيما فعرضت لي طريق عن يساري ، فأردت أن أسلكها . فقال : إنك لست من أهلها . ثم عرضت لي طريق عن يميني فسلكتها حتى انتهت إلى جبل زلق فأخذ بيدي فزجل فإذا أنا على ذروته ، فلم أتقار ولم أتماسك فإذا عمود حديد في ذروته حلقة من ذهب فأخذ بيدي فزجل حتى أخذت بالعروة فقال : استمسك . فقلت : نعم . فضرب العمود برجله فاستمسكت بالعروة ، فقصصتها على رسول الله صلى الله عليه وسلم فقال : \" رأيت خيرا ، أما المنهج العظيم فالمحشر ، وأما الطريق التي عرضت عن يسارك فطريق أهل النار ، ولست من أهلها ، وأما الطريق التي عرضت عن يمينك فطريق أهل الجنة ، وأما الجبل الزلق فمنزل الشهداء ، وأما العروة التي استمسكت بها فعروة الإسلام ، فاستمسك بها حتى تموت \" . قال : فإنما أرجو أن أكون من أهل الجنة . قال : وإذا هو عبد الله بن سلام .\nوهكذا رواه النسائي عن أحمد بن سليمان عن عفان ، وابن ماجه عن أبي بكر بن أبي شيبة ، عن الحسن بن موسى الأشيب كلاهما عن حماد بن سلمة به نحوه . وأخرجه مسلم في صحيحه من حديث الأعمش عن سليمان بن مسهر عن خرشة بن الحر الفزاري به .\n                                    ",
        "qortoby": "لَآ إِكۡرَاهَ فِي ٱلدِّينِۖ قَد تَّبَيَّنَ ٱلرُّشۡدُ مِنَ ٱلۡغَيِّۚ فَمَن يَكۡفُرۡ بِٱلطَّٰغُوتِ وَيُؤۡمِنۢ بِٱللَّهِ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰ لَا ٱنفِصَامَ لَهَاۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٦٥٢\n                                        \n                                        \n                                        قوله تعالى : لا إكراه في الدين قد تبين الرشد من الغي فمن يكفر بالطاغوت ويؤمن بالله فقد استمسك بالعروة الوثقى لا انفصام لها والله سميع عليم\nقوله تعالى : لا إكراه في الدين فيه مسألتان :\n الأولى : قوله تعالى : لا إكراه في الدين الدين في هذه الآية المعتقد والملة بقرينة قوله : قد تبين الرشد من الغي . والإكراه الذي في الأحكام من الإيمان والبيوع والهبات وغيرها ليس هذا موضعه ، وإنما يجيء في تفسير قوله : إلا من أكره . وقرأ أبو عبد الرحمن \" قد تبين الرشد من الغي \" وكذا روي عن الحسن والشعبي ، يقال : رشد يرشد رشدا ، ورشد يرشد رشدا : إذا بلغ ما يحب . وغوى ضده ، عن النحاس . وحكى ابن عطية عن أبي عبد الرحمن السلمي أنه قرأ \" الرشاد \" بالألف . وروي عن الحسن أيضا \" الرشد \" بضم الراء والشين . \" الغي \" مصدر من غوى يغوي إذا ضل في معتقد أو رأي ، ولا يقال الغي في الضلال على الإطلاق .\nالثانية : اختلف العلماء في معنى هذه الآية على ستة أقوال :\n( الأول ) قيل إنها منسوخة ؛ لأن النبي صلى الله عليه وسلم قد أكره العرب على دين الإسلام وقاتلهم ولم يرض منهم إلا بالإسلام ، قاله سليمان بن موسى ، قال : نسختها يا أيها النبي جاهد الكفار والمنافقين . وروي هذا عن ابن مسعود وكثير من المفسرين .\n( الثاني ) ليست بمنسوخة وإنما نزلت في أهل الكتاب خاصة ، وأنهم لا يكرهون على الإسلام إذا أدوا الجزية ، والذين يكرهون أهل الأوثان فلا يقبل منهم إلا الإسلام فهم الذين نزل فيهم يا أيها النبي جاهد الكفار والمنافقين . هذا قول الشعبي وقتادة والحسن والضحاك . والحجة لهذا القول ما رواه زيد بن أسلم عن أبيه قال : سمعت عمر بن الخطاب يقول لعجوز نصرانية : أسلمي أيتها العجوز تسلمي ، إن الله بعث محمدا بالحق . قالت : أنا عجوز كبيرة والموت إلي قريب! فقال عمر : اللهم اشهد ، وتلا لا إكراه في الدين .\n( الثالث ) ما رواه أبو داود عن ابن عباس قال : نزلت هذه في الأنصار ، كانت تكون المرأة مقلاتا فتجعل على نفسها إن عاش لها ولد أن تهوده ، فلما أجليت بنو النضير كان فيهم كثير من أبناء الأنصار فقالوا : لا ندع أبناءنا فأنزل الله تعالى : لا إكراه في الدين قد تبين الرشد من الغي . قال أبو داود : والمقلات التي لا يعيش لها ولد . في رواية : إنما فعلنا ما فعلنا ونحن نرى أن دينهم أفضل مما نحن عليه ، وأما إذا جاء الله بالإسلام فنكرههم عليه فنزلت : لا إكراه في الدين من شاء التحق بهم ومن شاء دخل في الإسلام . وهذا قول سعيد بن جبير والشعبي ومجاهد إلا أنه قال : كان سبب كونهم في بني النضير الاسترضاع . قال النحاس : قول ابن عباس في هذه الآية أولى الأقوال لصحة إسناده ، وأن مثله لا يؤخذ بالرأي .\n( الرابع ) قال السدي : نزلت الآية في رجل من الأنصار يقال له أبو حصين كان له ابنان ، فقدم تجار من الشام إلى المدينة يحملون الزيت ، فلما أرادوا الخروج أتاهم ابنا الحصين فدعوهما إلى النصرانية فتنصرا ومضيا معهم إلى الشام ، فأتى أبوهما رسول الله صلى الله عليه وسلم مشتكيا أمرهما ، ورغب في أن يبعث رسول الله صلى الله عليه وسلم من يردهما فنزلت : لا إكراه في الدين ولم يؤمر يومئذ بقتال أهل الكتاب ، وقال : ( أبعدهما الله هما أول من كفر ) فوجد أبو الحصين في نفسه على النبي صلى الله عليه وسلم حين لم يبعث في طلبهما فأنزل الله جل ثناؤه فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم الآية ثم إنه نسخ لا إكراه في الدين فأمر بقتال أهل الكتاب في سورة ( براءة ) . والصحيح في سبب قوله تعالى : فلا وربك لا يؤمنون حديث الزبير مع جاره الأنصاري في السقي ، على ما يأتي في ( النساء ) بيانه إن شاء الله تعالى .\n( وقيل ) معناها لا تقولوا لمن أسلم تحت السيف مجبرا مكرها ، وهو القول الخامس .\n( وقول سادس ) وهو أنها وردت في السبي متى كانوا من أهل الكتاب لم يجبروا إذا كانوا كبارا ، وإن كانوا مجوسا صغارا أو كبارا أو وثنيين فإنهم يجبرون على الإسلام ؛ لأن من سباهم لا ينتفع بهم مع كونهم وثنيين ، ألا ترى أنه لا تؤكل ذبائحهم ولا توطأ نساؤهم ، ويدينون بأكل الميتة والنجاسات وغيرهما ، ويستقذرهم المالك لهم ويتعذر عليه الانتفاع بهم من جهة الملك فجاز له الإجبار . ونحو هذا روى ابن القاسم عن مالك . وأما أشهب فإنه قال : هم على دين من سباهم ، فإذا امتنعوا أجبروا على الإسلام ، والصغار لا دين لهم فلذلك أجبروا على الدخول في دين الإسلام لئلا يذهبوا إلى دين باطل . فأما سائر أنواع الكفر متى بذلوا الجزية لم نكرههم على الإسلام سواء كانوا عربا أم عجما قريشا أو غيرهم . وسيأتي بيان هذا وما للعلماء في الجزية ومن تقبل منه في ( براءة ) إن شاء الله تعالى .\nقوله تعالى : فمن يكفر بالطاغوت ويؤمن بالله جزم بالشرط . والطاغوت مؤنثة من طغى يطغى . - وحكى الطبري يطغو - إذا جاوز الحد بزيادة عليه . ووزنه فعلوت ، ومذهب سيبويه أنه اسم مذكر مفرد كأنه اسم جنس يقع للقليل والكثير . ومذهب أبي علي أنه مصدر كرهبوت وجبروت ، وهو يوصف به الواحد والجمع ، وقلبت لامه إلى موضع العين وعينه موضع اللام كجبذ وجذب ، فقلبت الواو ألفا لتحركها وتحرك ما قبلها فقيل طاغوت ، واختار هذا القول النحاس . وقيل : أصل طاغوت في اللغة مأخوذة من الطغيان يؤدي معناه من غير اشتقاق ، كما قيل : لآل من اللؤلؤ . وقال المبرد : هو جمع . وقال ابن عطية : وذلك مردود . قال الجوهري : والطاغوت الكاهن والشيطان ، وكله رأس في الضلال ، وقد يكون واحدا ، قال الله تعالى : يريدون أن يتحاكموا إلى الطاغوت وقد أمروا أن يكفروا به . وقد يكون جمعا ، قال الله تعالى : أولياؤهم الطاغوت والجمع الطواغيت . ( ويؤمن بالله ) عطف . فقد استمسك بالعروة الوثقى جواب الشرط ، وجمع الوثقى الوثق مثل الفضلى والفضل ، فالوثقى فعلى من الوثاقة ، وهذه الآية تشبيه . واختلفت عبارة المفسرين في الشيء المشبه به ، فقال مجاهد : العروة الإيمان . وقال السدي : الإسلام . وقال ابن عباس وسعيد بن جبير والضحاك ، لا إله إلا الله ، وهذه عبارات ترجع إلى معنى واحد . ثم قال : لا انفصام لها قال مجاهد : أي لا يغير ما بقوم حتى يغيروا ما بأنفسهم ، أي لا يزيل عنهم اسم الإيمان حتى يكفروا . والانفصام : الانكسار من غير بينونة . والقصم : كسر ببينونة ، وفي صحيح الحديث فيفصم عنه الوحي وإن جبينه ليتفصد عرقا أي يقلع . قال الجوهري : فصم الشيء كسره من غير أن يبين ، تقول : فصمته فانفصم ، قال الله تعالى : لا انفصام لها وتفصم مثله ، قاله ذو الرمة يذكر غزالا يشبهه بدملج فضة :\nكأنه دملج من فضة نبه في ملعب من جواري الحي مفصوم\nوإنما جعله مفصوما لتثنيه وانحنائه إذا نام . ولم يقل \" مقصوم \" بالقاف فيكون بائنا باثنين . وأفصم المطر : أقلع . وأفصمت عنه الحمى ولما كان الكفر بالطاغوت والإيمان بالله مما ينطق به اللسان ويعتقده القلب حسن في الصفات \" سميع \" من أجل النطق \" عليم \" من أجل المعتقد .\n                                    ",
        "saadi": "لَآ إِكۡرَاهَ فِي ٱلدِّينِۖ قَد تَّبَيَّنَ ٱلرُّشۡدُ مِنَ ٱلۡغَيِّۚ فَمَن يَكۡفُرۡ بِٱلطَّٰغُوتِ وَيُؤۡمِنۢ بِٱللَّهِ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰ لَا ٱنفِصَامَ لَهَاۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٦٥٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه لا إكراه في الدين لعدم الحاجة إلى الإكراه عليه، لأن الإكراه لا يكون إلا على أمر خفية أعلامه، غامضة أثاره، أو أمر في غاية الكراهة للنفوس، وأما هذا الدين القويم والصراط المستقيم فقد تبينت أعلامه للعقول، وظهرت طرقه، وتبين أمره، وعرف الرشد من الغي، فالموفق إذا نظر أدنى نظر إليه آثره واختاره، وأما من كان سيئ القصد فاسد الإرادة، خبيث النفس يرى الحق فيختار عليه الباطل، ويبصر الحسن فيميل إلى القبيح، فهذا ليس لله حاجة في إكراهه على الدين، لعدم النتيجة والفائدة فيه، والمكره ليس إيمانه صحيحا، ولا تدل الآية الكريمة على ترك قتال الكفار المحاربين، وإنما فيها أن حقيقة الدين من حيث هو موجب لقبوله لكل منصف قصده اتباع الحق، وأما القتال وعدمه فلم تتعرض له، وإنما يؤخذ فرض القتال من نصوص أخر، ولكن يستدل في الآية الكريمة على قبول الجزية من غير أهل الكتاب، كما هو قول كثير من العلماء، فمن يكفر بالطاغوت فيترك عبادة ما سوى الله وطاعة الشيطان، ويؤمن بالله إيمانا تاما أوجب له عبادة ربه وطاعته { فقد استمسك بالعروة الوثقى } أي: بالدين القويم الذي ثبتت قواعده ورسخت أركانه، وكان المتمسك به على ثقة من أمره، لكونه استمسك بالعروة الوثقى التي { لا انفصام لها } وأما من عكس القضية فكفر بالله وآمن بالطاغوت، فقد أطلق هذه العروة الوثقى التي بها العصمة والنجاة، واستمسك بكل باطل مآله إلى الجحيم { والله سميع عليم } فيجازي كلا منهما بحسب ما علمه منهم من الخير والشر، وهذا هو الغاية لمن استمسك بالعروة الوثقى ولمن لم يستمسك بها.\n                                    "
      },
      "originalText": "لَآ إِكۡرَاهَ فِي ٱلدِّينِۖ قَد تَّبَيَّنَ ٱلرُّشۡدُ مِنَ ٱلۡغَيِّۚ فَمَن يَكۡفُرۡ بِٱلطَّٰغُوتِ وَيُؤۡمِنۢ بِٱللَّهِ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰ لَا ٱنفِصَامَ لَهَاۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٦٥٢"
    }
  ]
}