{
  "number": 421,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 3556,
      "text": "مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ ۖ فَمِنْهُمْ مَنْ قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ ۖ وَمَا بَدَّلُوا تَبْدِيلًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 23,
      "juz": 21,
      "manzil": 5,
      "page": 421,
      "ruku": 363,
      "hizbQuarter": 168,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مِّنَ ٱلۡمُؤۡمِنِينَ رِجَالٞ صَدَقُواْ مَا عَٰهَدُواْ ٱللَّهَ عَلَيۡهِۖ فَمِنۡهُم مَّن قَضَىٰ نَحۡبَهُۥ وَمِنۡهُم مَّن يَنتَظِرُۖ وَمَا بَدَّلُواْ تَبۡدِيلٗا ٣٢\n                                    \n                                    \n                                    لما ذكر عز وجل عن المنافقين أنهم نقضوا العهد الذي كانوا عاهدوا الله عليه لا يولون الأدبار، وصف المؤمنين بأنهم استمروا على العهد والميثاق { صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } قال بعضهم أجله. وقال البخاري عهده، وهو يرجع إِلى الأول، { وَمِنْهُمْ مَّن يَنتَظِرُ وَمَا بَدَّلُواْ تَبْدِيلاً } أي وما غيروا عهد الله، ولا نقضوه ولا بدلوه. قال البخاري حدثنا أبو اليمان، أخبرنا شعيب عن الزهري قال أخبرني خارجة بن زيد بن ثابت عن أبيه قال لما نسخنا المصحف، فقدت آية من سورة الأحزاب كنت أسمع رسول الله صلى الله عليه وسلم يقرؤها، لم أجدها مع أحد إِلا مع خزيمة بن ثابت الأنصاري رضي الله عنه، الذي جعل رسول الله صلى الله عليه وسلم شهادته بشهادة رجلين { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ } تفرد به البخاري دون مسلم، وأخرجه أحمد في مسنده، والترمذي والنسائي في التفسير من سننهما من حديث الزهري به. وقال الترمذي حسن صحيح. وقال البخاري أيضاً حدثنا محمد بن بشار، حدثنا محمد بن عبد الله الأنصاري، حدثني أبي عن ثمامة عن أنس بن مالك رضي الله عنه قال نرى هذه الآية نزلت في أنس بن النضر رضي الله عنه { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ } الآية، انفرد به البخاري من هذا الوجه، ولكن له شواهد من طرق أخر. قال الإمام أحمد حدثنا هاشم بن القاسم، حدثنا سليمان بن المغيرة عن ثابت قال قال أنس عمي أنس بن النضر رضي الله عنه سميت به لم يشهد مع رسول الله صلى الله عليه وسلم يوم بدر، فشق عليه، وقال أول مشهد شهده رسول الله صلى الله عليه وسلم غبت عنه، لئن أراني الله تعالى مشهداً فيما بعد مع رسول الله صلى الله عليه وسلم ليرين الله عز وجل ما أصنع. قال فهاب أن يقول غيرها، فشهد مع رسول الله صلى الله عليه وسلم يوم أحد، فاستقبل سعد بن معاذ رضي الله عنه، فقال له أنس رضي الله عنه يا أبا عمرو أين واهاً لريح الجنة، إِني أجده دون أحد، قال فقاتلهم حتى قتل رضي الله عنه، قال فوجد في جسده بضع وثمانون بين ضربة وطعنة ورمية، فقالت أخته عمتي الربيّع بنة النضر فما عرفت أخي إِلا ببنانه، قال فنزلت هذه الآية { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَّن يَنتَظِرُ وَمَا بَدَّلُواْ تَبْدِيلاً } قال فكانوا يرون أنها نزلت فيه، وفي أصحابه رضي الله عنهم. ورواه مسلم والترمذي والنسائي من حديث سليمان بن المغيرة به.\n                                    ورواه النسائي أيضاً وابن جرير من حديث حماد بن سلمة عن ثابت عن أنس رضي الله عنه به نحوه. وقال ابن أبي حاتم حدثنا أحمد بن سنان، حدثنا يزيد بن هارون حدثنا حميد عن أنس، رضي الله عنه قال إِن عمه، يعني أنس بن النضر رضي الله عنه، غاب عن قتال بدر، قال غُيِّبت عن أول قتال قاتله رسول الله صلى الله عليه وسلم المشركين، لئن الله أشهدني قتالاً للمشركين، ليرين الله تعالى ما أصنع، قال فلما كان يوم أحد، انكشف المسلمون، فقال اللهم إِني أعتذر إِليك مما صنع هؤلاء ــــ يعني أصحابه ــــ وأبرأ إِليك مما جاء به هؤلاء ــــ يعني المشركين ــــ ثم تقدم، فلقيه سعد بن معاذ رضي الله عنه دون أحد، فقال أنا معك. قال سعد رضي الله عنه فلم أستطع أن أصنع ما صنع، فلما قتل قال فوجد فيه بضع وثمانون ضربة سيف وطعنة رمح ورمية سهم، وكانوا يقولون فيه وفي أصحابه نزلت { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَّن يَنتَظِرُ }. وأخرجه الترمذي في التفسير عن عبد بن حميد، والنسائي فيه أيضاً عن إِسحاق بن إِبراهيم، كلاهما عن يزيد بن هارون به. وقال الترمذي حسن. وقد رواه البخاري في المغازي عن حسان بن حسان، عن محمد بن طلحة عن مصرف عن حميد عن أنس رضي الله عنه به، ولم يذكر نزول الآية. ورواه ابن جرير من حديث المعتمر بن سليمان عن حميد عن أنس رضي الله عنه به. وقال ابن أبي حاتم حدثنا أحمد بن الفضل العسقلاني، حدثنا سليمان بن أيوب بن سلملن، بن عيسى بن موسى بن طلحة بن عبيد الله، حدثني أبي عن جدي عن موسى بن طلحة عن أبيه طلحة رضي الله عنه قال لما أن رجع رسول الله صلى الله عليه وسلم من أحد، صعد المنبر، فحمد الله تعالى، وأثنى عليه، وعزى المسلمين بما أصابهم، وأخبرهم بما لهم فيه من الأجر والذخر، ثم قرأ هذه الآية { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } الآية كلها، فقام إِليه رجل من المسلمين فقال يارسول الله من هؤلاء؟ فأقبلت، وعلي ثوبان أخضران حضرميان، فقال \" أيها السائل هذا منهم \" وكذا رواه ابن جرير من حديث سليمان بن أيوب الطلحي به. وأخرجه الترمذي في التفسير والمناقب أيضاً، وابن جرير من حديث يونس بن بكير عن طلحة بن يحيى عن موسى وعيسى ابني طلحة عن أبيهما رضي الله عنه به. وقال حديث غريب، لا نعرفه إلا من حديث يونس. وقال أيضاً حدثنا أحمد بن عصام الأنصاري حدثنا أبو عامر ــــ يعني العقدي ــــ حدثني إسحاق ــــ يعني ابن طلحة بن عبيد الله ــــ عن موسى بن طلحة قال دخلت على معاوية رضي الله عنه، فلما خرجت، دعاني فقال ألا أضع عندك يابن أخي حديثاً سمعته من رسول الله صلى الله عليه وسلم أشهد لسمعت رسول الله صلى الله عليه وسلم يقول :\n                                    \" طلحة ممن قضى نحبه \". ورواه ابن جرير حدثنا أبو كريب، حدثنا عبد الحميد الحماني عن إسحاق بن يحيى بن طلحة الطلحي عن موسى بن طلحة قال قام معاوية بن أبي سفيان رضي الله عنه، فقال إني سمعت رسول الله صلى الله عليه وسلم يقول \" طلحة ممن قضى نحبه \" ولهذا قال مجاهد في قوله تعالى { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } يعني عهده { وَمِنْهُمْ مَّن يَنتَظِرُ } قال يوماً فيه القتال، فيصدق في اللقاء. وقال الحسن { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } يعني موته على الصدق والوفاء، ومنهم من ينتظر الموت على مثل ذلك، ومنهم من لم يبدل تبديلاً، وكذا قال قتادة وابن زيد. وقال بعضهم نحبه نذره. وقوله تعالى { وَمَا بَدَّلُواْ تَبْدِيلاً } أي وما غيروا عهدهم، وبدلوا الوفاء بالغدر، بل استمروا على ما عاهدوا عليه، وما نقضوه كفعل المنافقين الذين قالوا { إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِىَ بِعَوْرَةٍ إِن يُرِيدُونَ إِلاَّ فِرَاراً وَلَوْ دُخِلَتْ عَلَيْهِمْ مِّنْ أَقْطَارِهَا ثُمَّ سُئِلُواْ ٱلْفِتْنَةَ لأَتَوْهَا وَمَا تَلَبَّثُواْ بِهَآ إِلاَّ يَسِيراً وَلَقَدْ كَانُواْ عَـٰهَدُواْ ٱللَّهَ مِن قَبْلُ لاَ يُوَلُّونَ ٱلأَدْبَـٰرَ }. وقوله تعالى { لِّيَجْزِىَ ٱللَّهُ ٱلصَّـٰدِقِينَ بِصِدْقِهِمْ وَيُعَذِّبَ ٱلْمُنَـٰفِقِينَ إِن شَآءَ أَوْ يَتُوبَ عَلَيْهِمْ } أي إنما يختبر عباده بالخوف والزلزال ليميز الخبيث من الطيب، فيظهر أمر هذا بالفعل، وأمر هذا بالفعل، مع أنه تعالى يعلم الشيء قبل كونه، ولكن لا يعذب الخلق بعلمه فيهم، حتى يعملوا بما يعلمه منهم كما قال تعالى :\n{ وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ ٱلْمُجَـٰهِدِينَ مِنكُمْ وَٱلصَّـٰبِرِينَ وَنَبْلُوَ أَخْبَـٰرَكُمْ }\nمحمد 31 فهذا علم بالشيء بعد كونه، وإن كان العلم السابق حاصلاً به قبل وجوده، وكذا قال الله تعالى\n{ مَّا كَانَ ٱللَّهُ لِيَذَرَ ٱلْمُؤْمِنِينَ عَلَىٰ مَآ أَنتُمْ عَلَيْهِ حَتَّىٰ يَمِيزَ ٱلْخَبِيثَ مِنَ ٱلطَّيِّبِ وَمَا كَانَ ٱللَّهُ لِيُطْلِعَكُمْ عَلَى ٱلْغَيْبِ }\nآل عمران 179 ولهذا قال تعالى ههنا { لِّيَجْزِىَ ٱللَّهُ ٱلصَّـٰدِقِينَ بِصِدْقِهِمْ } أي بصبرهم على ما عاهدوا الله عليه، وقيامهم به، ومحافظتهم عليه، { وَيُعَذِّبَ ٱلْمُنَـٰفِقِينَ } وهم الناقضون لعهد الله، المخالفون لأوامره، فاستحقوا بذلك عقابه، وعذابه، ولكن هم تحت مشيئته في الدنيا، إن شاء استمر بهم على ما فعلوا حتى يلقوه فيعذبهم عليه، وإن شاء تاب عليهم بأن أرشدهم إلى النزوع عن النفاق إلى الإيمان، والعمل الصالح بعد الفسوق والعصيان. ولما كانت رحمته ورأفته تبارك وتعالى بخلقه هي الغالبة لغضبه قال { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً }.\n                                    ",
        "qortoby": "مِّنَ ٱلۡمُؤۡمِنِينَ رِجَالٞ صَدَقُواْ مَا عَٰهَدُواْ ٱللَّهَ عَلَيۡهِۖ فَمِنۡهُم مَّن قَضَىٰ نَحۡبَهُۥ وَمِنۡهُم مَّن يَنتَظِرُۖ وَمَا بَدَّلُواْ تَبۡدِيلٗا ٣٢\n                                    \n                                    \n                                    قوله تعالى: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ } رفع بالابتداء، وصَلُح الابتداء بالنكرة لأن «صَدَقُوا» في موضع النعت. { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ }. «مَن» في موضع رفع بالابتداء. وكذا «وَمِنْهُمْ مَنْ يَنْتَظِرُ» والخبر في المجرور. والنَّحْب: النذر والعهد؛ تقول منه: نَحَبت أَنْحُب؛ بالضم. قال الشاعر :\nوإذا نحبت كَلْبٌ على الناس إنهم\t   \tأحق بتاج الماجد المتكرم\nوقال آخر :\nقـد نحـب المجـدُ علـيـنا نَحْـبَـا\t   \t\nوقال آخر :\nأَنَحْـبٌ فيـقـضَـى أم ضـلالٌ وبـاطـلُ\t   \t\nوروى البخاريّ ومسلم والترمذي عن أنس قال: قال عمّي أنس بن النَّضْر ـ سُمِّيت به ـ ولم يشهد بدراً مع رسول الله صلى الله عليه وسلم فكَبُر عليه فقال: أوّل مشهد شهده رسول الله صلى الله عليه وسلم غِبتُ عنه، أما واللَّهِ لئن أرانِي الله مشهداً مع رسول الله صلى الله عليه وسلم فيما بعد لَيَرَيَنّ الله ما أصنع. قال: فهاب أن يقول غيرها؛ فشهد مع رسول الله صلى الله عليه وسلم يوم أُحُد من العام القابل، فاستقبله سعد بن مالك فقال: يا أبا عمرو أين؟ قال: واهاً لريح الجنة! أجدها دون أُحُد؛ فقاتل حتى قُتل، فوجِد في جسده بضع وثمانون ما بين ضربة وطعنة ورَمْية. فقالت عَمّتي الرُّبَيِّع بنت النضر: فما عرفت أخي إلا بَبَنانه. ونزلت هذه الآية: { رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَّن يَنتَظِرُ وَمَا بَدَّلُواْ تَبْدِيلاً } لفظ الترمذيّ، وقال: هذا حديث حسن صحيح. وقالت عائشة رضي الله عنها في قوله تعالى :\n{ مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ }\n[الأحزاب: 23] الآية: منهم طلحة بن عبيد الله ثبت مع رسول الله صلى الله عليه وسلم حتى أصيبت يده؛ فقال النبيّ صلى الله عليه وسلم: \" أوجب طلحة الجنة \" وفي الترمذيّ عنه: \" أن أصحاب رسول الله صلى الله عليه وسلم قالوا لأعرابيّ جاهل: سله عمن قضى نحبه من هو؟ وكانوا لا يجترئون على مسألته، يوقّرونه ويهابونه؛ فسأله الأعرابي فأعرض عنه، ثم سأله فأعرض عنه؛ ثم إني اطّلعت من باب المسجد وعليّ ثياب خضر، فلما رآني النبيّ صلى الله عليه وسلم قال: «أين السائل عمن قضى نحبه؟» قال الأعرابي: أنا يا رسول الله. قال: «هذا ممن قضى نَحْبَه» \" قال: هذا حديث حسن غريب لا نعرفه إلا من حديث يونس بن بكير. وروى البيهقي عن أبي هريرة: \" أن رسول الله صلى الله عليه وسلم حين انصرف من أُحُد، مرّ على مصعب بن عُمير وهو مقتول على طريقه، فوقف عليه ودَعَا له، ثم تلا هذه الآية: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ ـ إلى ـ تَبْدِيلاً } ثم قال رسول الله صلى الله عليه وسلم: «أشهد أن هؤلاء شهداء عند الله يوم القيامة فأْتُوهم وزوروهم والذي نفسي بيده لا يسلّم عليهم أحد إلى يوم القيامة إلا ردّوا عليه» \"\n                                   وقيل: النحب الموت؛ أي مات على ما عاهد عليه؛ عن ابن عباس. والنحب أيضاً الوقت والمدّة. يقال: قضى فلان نحبه إذا مات. وقال ذو الرمّة :\nعشِيّةَ فرّ الحارِثيّون بعد ما\t   \tقَضَى نَحْبه في ملتَقَى الخيل هَوْبَرُ\nوالنَّحْب أيضاً الحاجة والهِمة؛ يقول قائلهم: مالي عندهم نحب؛ وليس المراد بالآية. والمعنى في هذا الموضع بالنحب النذر كما قدّمنا أوّلاً؛ أي منهم من بذل جهده على الوفاء بعهده حتى قتل؛ مثل حمزة وسعد بن معاذ وأنس بن النضر وغيرهم. ومنهم من ينتظر الشهادة وما بدّلوا عهدهم ونذرهم. وقد روي عن ابن عباس أنه قرأ «فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَّن يَنتَظِرُ ومنهم من بدّل تَبْديلاً» قال أبو بكر الأنباريّ: وهذا الحديث عند أهل العلم مردود؛ لخلافه الإجماع، ولأن فيه طعناً على المؤمنين والرجال الذين مدحهم الله وشرفهم بالصدق والوفاء؛ فما يعرف فيهم مغيّر وما وجد من جماعتهم مبدّل؛ رضي الله عنهم. { لِّيَجْزِيَ ٱللَّهُ ٱلصَّادِقِينَ بِصِدْقِهِمْ } أي أمر الله بالجهاد ليجزي الصادقين في الآخرة بصدقهم. { وَيُعَذِّبَ ٱلْمُنَافِقِينَ } في الآخرة { إِن شَآءَ } أي إن شاء أن يعذبهم لم يوفقهم للتوبة؛ وإن لم يشأ أن يعذبهم تاب عليهم قبل الموت. { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً }.\n\n                                    ",
        "saadi": "مِّنَ ٱلۡمُؤۡمِنِينَ رِجَالٞ صَدَقُواْ مَا عَٰهَدُواْ ٱللَّهَ عَلَيۡهِۖ فَمِنۡهُم مَّن قَضَىٰ نَحۡبَهُۥ وَمِنۡهُم مَّن يَنتَظِرُۖ وَمَا بَدَّلُواْ تَبۡدِيلٗا ٣٢\n                                        \n                                        \n                                        \n                                        { قُل } لهم، لائماً على فرارهم، ومخبراً أنهم لا يفيدهم ذلك شيئاً { لَّن يَنفَعَكُمُ ٱلْفِرَارُ إِن فَرَرْتُمْ مِّنَ ٱلْمَوْتِ أَوِ ٱلْقَتْلِ } فلو كنتم في بيوتكم، لبرز الذين كتب عليهم القتل إلى مضاجعهم. والأسباب تنفع، إذا لم يعارضها القضاء والقدر، فإذا جاء القضاء والقدر، تلاشى كل سبب، وبطلت كل وسيلة ظنها الإنسان تنجيه. { وَإِذاً } حين فررتم لتسلموا من الموت والقتل، ولتنعموا في الدنيا فإنكم { لاَّ تُمَتَّعُونَ إِلاَّ قَلِيلاً } متاعاً لا يسوى فراركم، وترككم أمر اللّه، وتفويتكم على أنفسكم التمتع الأبدي، في النعيم السرمدي. ثم بيَّن أن الأسباب كلها لا تغني عن العبد شيئاً إذا أراده اللّه بسوء، فقال: { قُلْ مَن ذَا ٱلَّذِي يَعْصِمُكُمْ } أي: يمنعكم { مِّنَ ٱللَّهِ إِنْ أَرَادَ بِكُمْ سُوۤءاً } أي: شراً، { أَوْ أَرَادَ بِكُمْ رَحْمَةً } فإنه هو المعطي المانع، الضار النافع، الذي لا يأتي بالخير إلا هو، ولا يدفع السوء إلاّ هو. { وَلاَ يَجِدُونَ لَهُمْ مِّن دُونِ ٱللَّهِ وَلِيّاً } يتولاهم، فيجلب لهم النفع { وَلاَ نَصِيراً } أي: ينصرهم، فيدفع عنهم المضار. فَلْيَمْتَثِلُوا طاعة المنفرد بالأمور كلها، الذي نفذت مشيئته، ومضى قدره، ولم ينفع مع ترك ولايته ونصرته، وَلِيٌّ ولا ناصر. ثم توَّعد تعالى المخذلين المعوقين، وتهددهم فقال: { قَدْ يَعْلَمُ ٱللَّهُ ٱلْمُعَوِّقِينَ مِنكُمْ } عن الخروج لمن [لم] يخرجوا { وَٱلْقَآئِلِينَ لإِخْوَانِهِمْ } الذين خرجوا: { هَلُمَّ إِلَيْنَا } أي: ارجعوا، كما تقدم من قولهم :\n{ يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ فَٱرْجِعُواْ }\n[الأحزاب: 13]. وهم مع تعويقهم وتخذيلهم { وَلاَ يَأْتُونَ ٱلْبَأْسَ } القتال والجهاد بأنفسهم { إِلاَّ قَلِيلاً } فهم أشد الناس حرصاً على التخلف، لعدم الداعي لذلك من الإيمان والصبر، ووجود المقتضى للجبن، من النفاق وعدم الإيمان. { أَشِحَّةً عَلَيْكُمْ } بأبدانهم عند القتال، وبأموالهم عند النفقة فيه، فلا يجاهدون بأموالهم وأنفسهم. { فَإِذَا جَآءَ ٱلْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ } نظر المغشى عليه { مِنَ ٱلْمَوْتِ } من شدة الجبن، الذي خلع قلوبهم، والقلق الذي أذهلهم، وخوفاً من إجبارهم على ما يكرهون من القتال. { فَإِذَا ذَهَبَ ٱلْخَوْفُ } وصاروا في حال الأمن والطمأنينة، { سَلَقُوكُمْ بِأَلْسِنَةٍ } أي: خاطبوكم وتكلموا معكم، بكلام حديد، ودعاوى غير صحيحة. وحين تسمعهم، تظنهم أهل الشجاعة والإقدام، { أَشِحَّةً عَلَى ٱلْخَيْرِ } الذي يراد منهم، وهذا شر ما في الإنسان، أن يكون شحيحاً بما أمر به، شحيحاً بماله أن ينفقه في وجهه، شحيحاً في بدنه أن يجاهد أعداء اللّه، أو يدعو إلى سبيل اللّه، شحيحاً بجاهه، شحيحاً بعلمه ونصيحته ورأيه. { أوْلَـٰئِكَ } الذين بتلك الحالة { لَمْ يُؤْمِنُواْ } بسبب عدم إيمانهم أحبط الله أعمالهم، { وَكَانَ ذَلِكَ عَلَى ٱللَّهِ يَسِيراً }. وأما المؤمنون، فقد وقاهم اللّه شح أنفسهم، ووفقهم لبذل ما أمروا به، من بذلٍ لأبدانهم في القتال في سبيله، وإعلاء كلمته، وأموالهم للنفقة في طرق الخير، وجاههم وعلمهم.\n                                   \n                                   { يَحْسَبُونَ ٱلأَحْزَابَ لَمْ يَذْهَبُواْ } أي: يظنون أن هؤلاء الأحزاب، الذين تحزبوا على حرب رسول اللّه صلى اللّه عليه وسلم وأصحابه لم يذهبوا حتى يستأصلوهم، فخاب ظنهم، وبطل حسبانهم. { وَإِن يَأْتِ ٱلأَحْزَابُ } مرة أخرى { يَوَدُّواْ لَوْ أَنَّهُمْ بَادُونَ فِي ٱلأَعْرَابِ يَسْأَلُونَ عَنْ أَنبَآئِكُمْ } أي: لو أتى الأحزاب مرة ثانية مثل هذه المرة، ودَّ هؤلاء المنافقون، أنهم ليسوا في المدينة ولا في القرب منها، وأنهم مع الأعراب في البادية، يستخبرون عن أخباركم، ويسألون عن أنبائكم، ماذا حصل عليكم؟ فتباً لهم، وبعداً فليسوا ممن يبالى بحضورهم { وَلَوْ كَانُواْ فِيكُمْ مَّا قَاتَلُوۤاْ إِلاَّ قَلِيلاً } فلا تبالوهم، ولا تأسوا عليهم. { لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ ٱللَّهِ أُسْوَةٌ حَسَنَةٌ } حيث حضر الهيجاء بنفسه الكريمة، وباشر موقف الحرب، وهو الشريف الكامل، والبطل الباسل، فكيف تشحون بأنفسكم عن أمر جاد رسول اللّه صلى اللّه عليه وسلم بنفسه فيه؟!! فَتأَسُّوْا به في هذا الأمر وغيره. واستدل الأصوليون في هذه الآية، على الاحتجاج بأفعال الرسول صلى اللّه عليه وسلم، وأن الأصل، أن أمته أسوته في الأحكام، إلاّ ما دلَّ الدليل الشرعي على الاختصاص به. فالأسوة نوعان: أسوة حسنة، وأسوة سيئة. فالأسوة الحسنة في الرسول صلى اللّه عليه وسلم، فإن المتأسِّي به، سالك الطريق الموصل إلى كرامة اللّه، وهو الصراط المستقيم. وأما الأسوة بغيره إذا خالفه، فهو الأسوة السيئة، كقول الكفار حين دعتهم الرسل للتأسِّي [بهم]: { بَلْ قَالُوۤاْ إِنَّا وَجَدْنَآ ءَابَآءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ ءَاثَارِهِم مُّهْتَدُونَ }. وهذه الأسوة الحسنة، إنما يسلكها ويوفق لها، من كان يرجو اللّه واليوم الآخر، فإن ما معه من الإيمان، وخوف اللّه، ورجاء ثوابه، وخوف عقابه، يحثه على التأسي بالرسول صلى اللّه عليه وسلم. لما ذكر حالة المنافقين عند الخوف، ذكر حال المؤمنين، فقال: { وَلَمَّا رَأَى ٱلْمُؤْمِنُونَ ٱلأَحْزَابَ } الذين تحزبوا، ونزلوا منازلهم، وانتهى الخوف، { قَالُواْ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ } في قوله :\n{ أَمْ حَسِبْتُمْ أَن تَدْخُلُواْ ٱلْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ ٱلَّذِينَ خَلَوْاْ مِن قَبْلِكُم مَّسَّتْهُمُ ٱلْبَأْسَآءُ وَٱلضَّرَّآءُ وَزُلْزِلُواْ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ آمَنُواْ مَعَهُ مَتَىٰ نَصْرُ ٱللَّهِ أَلاۤ إِنَّ نَصْرَ ٱللَّهِ قَرِيبٌ }\n[البقرة: 214]. { وَصَدَقَ ٱللَّهُ وَرَسُولُهُ } فإنا رأينا، ما أخبرنا به { وَمَا زَادَهُمْ } ذلك الأمر { إِلاَّ إِيمَاناً } في قلوبهم { وَتَسْلِيماً } في جوارحهم، وانقياداً لأمر اللّه. ولما ذكر أن المنافقين عاهدوا اللّه، لا يولون الأدبار، ونقضوا ذلك العهد، ذكر وفاء المؤمنين به، فقال: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ } أي: وفوا به، وأتموه، وأكملوه، فبذلوا مهجهم في مرضاته، وسبَّلوا أنفسهم في طاعته. { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } أي: إرادته ومطلوبه وما عليه من الحق، فقُتل في سبيل اللّه، أو مات مؤدياً لحقه لم ينقصه شيئاً. { وَمِنْهُمْ مَّن يَنتَظِرُ } تكميل ما عليه، فهو شارع في قضاء ما عليه، ووفاء نحبه ولما يكمله، وهو في رجاء تكميله، ساع في ذلك مجد.\n                                   \n{ وَمَا بَدَّلُواْ تَبْدِيلاً } كما بدَّل غيرهم، بل لم يزالوا على العهد، لا يلوون ولا يتغيرون، فهؤلاء الرجال على الحقيقة، ومن عداهم فصورهم صور رجال، وأما الصفات فقد قصرت عن صفات الرجال. { لِّيَجْزِيَ ٱللَّهُ ٱلصَّادِقِينَ بِصِدْقِهِمْ } أي: بسبب صدقهم، في أقوالهم وأحوالهم، ومعاملتهم مع اللّه، واستواء ظاهرهم وباطنهم، قال اللّه تعالى :\n{ هَـٰذَا يَوْمُ يَنفَعُ ٱلصَّادِقِينَ صِدْقُهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ خَالِدِينَ فِيهَآ أَبَداً }\nالآية [المائدة: 119]. أي: قدرنا ما قدرنا من هذه الفتن والمحن والزلازل، ليتبين الصادق من الكاذب، فيجزي الصادقين بصدقهم { وَيُعَذِّبَ ٱلْمُنَافِقِينَ } الذين تغيرت قلوبهم وأعمالهم عند حلول الفتن، ولم يفوا بما عاهدوا اللّه عليه. { إِن شَآءَ } تعذيبهم، بأن لم يشأ هدايتهم، بل علم أنهم لا خير فيهم فلم يوفقهم. { أَوْ يَتُوبَ عَلَيْهِمْ } بأن يوفقهم للتوبة والإنابة، وهذا هو الغالب على كرم الكريم، ولهذا ختم الآية باسمين دالين على المغفرة، والفضل والإحسان فقال: { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً } غفوراً لذنوب المسرفين على أنفسهم، ولو أكثروا من العصيان إذا أتوا بالمتاب. { رَّحِيماً } بهم، حيث وفقهم للتوبة، ثم قبلها منهم وستر عليهم ما اجترحوه. { وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيْظِهِمْ لَمْ يَنَالُواْ خَيْراً } أي: ردهم خائبين، لم يحصل لهم الأمر الذي كانوا حنقين عليه، مغتاظين قادرين [عليه] جازمين، بأن لهم الدائرة، قد غرتهم جموعهم، وأعجبوا بتحزبهم، وفرحوا بِعَدَدِهمْ وعُدَدِهِمْ. فأرسل اللّه عليهم ريحاً عظيمة، وهي ريح الصبا، فزعزعت مراكزهم، وقوَّضت خيامهم، وكفأت قدورهم وأزعجتهم، وضربهم اللّه بالرعب، فانصرفوا بغيظهم، وهذا من نصر اللّه لعباده المؤمنين. { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } بما صنع لهم من الأسباب العادية والقدرية، { وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً } لا يغالبه أحد إلا غُلِبَ، ولا يستنصره أحد إلا غَلَبَ، ولا يعجزه أمر أراده، ولا ينفع أهل القوة والعزة قوتهم وعزتهم، إن لم يعنهم بقوته وعزته. { وَأَنزَلَ ٱلَّذِينَ ظَاهَرُوهُم } أي عاونوهم { مِّنْ أَهْلِ ٱلْكِتَابِ } أي: اليهود { مِن صَيَاصِيهِمْ } أي: أنزلهم من حصونهم، نزولا مظفوراً بهم، مجعولين تحت حكم الإسلام. { وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعْبَ } فلم يقووا على القتال، بل استسلموا وخضعوا وذلوا. { فَرِيقاً تَقْتُلُونَ } وهم الرجال المقاتلون { وَتَأْسِرُونَ فَرِيقاً } مَنْ عداهم من النساء والصبيان. { وَأَوْرَثَكُمْ } أي: غنَّمكم { أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضاً لَّمْ تَطَئُوهَا } أي: أرضاً كانت من قبل، من شرفها وعزتها عند أهلها، لا تتمكنون من وطئها، فمكَّنكم اللّه وخذلهم، وغنمتم أموالهم، وقتلتموهم وأسرتموهم. { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيراً } لا يعجزه شيء، ومن قدرته قدَّر لكم ما قدر. وكانت هذه الطائفة من أهل الكتاب، هم بنو قريظة من اليهود، في قرية خارج المدينة غير بعيدة، وكان النبي صلى اللّه عليه وسلم [حين] هاجر إلى المدينة وادعهم وهادنهم، فلم يقاتلهم ولم يقاتلوه، وهم باقون على دينهم، لم يغير عليهم شيئاً.\n                                   فلما رأوا يوم الخندق، الأحزاب الذين تحزبوا على رسول اللّه وكثرتهم، وقلة المسلمين، وظنوا أنهم سيستأصلون الرسول والمؤمنين، وساعد على ذلك، [تدجيل] بعض رؤسائهم عليهم، فنقضوا العهد الذي بينهم وبين رسول اللّه صلى اللّه عليه وسلم ومالؤوا المشركين على قتاله. فلما خذل اللّه المشركين، تفرغ رسول اللّه صلى اللّه عليه وسلم لقتالهم، فحاصرهم في حصنهم، فنزلوا على حكم سعد بن معاذ رضي اللّه عنه، فحكم فيهم، أن تقتل مقاتلتهم، وتسبى ذراريهم، وتغنم أموالهم. فأتم اللّه لرسوله والمؤمنين، المنة، وأسبغ عليهم النعمة، وأَقَرَّ أعينهم بخذلان مَنْ انخذل من أعدائهم، وقتل مَنْ قتلوا، وأسر مَنْ أسروا، ولم يزل لطف اللّه بعباده المؤمنين مستمراً.\n\n                                    "
      },
      "originalText": "مِّنَ ٱلۡمُؤۡمِنِينَ رِجَالٞ صَدَقُواْ مَا عَٰهَدُواْ ٱللَّهَ عَلَيۡهِۖ فَمِنۡهُم مَّن قَضَىٰ نَحۡبَهُۥ وَمِنۡهُم مَّن يَنتَظِرُۖ وَمَا بَدَّلُواْ تَبۡدِيلٗا ٣٢"
    },
    {
      "number": 3557,
      "text": "لِيَجْزِيَ اللَّهُ الصَّادِقِينَ بِصِدْقِهِمْ وَيُعَذِّبَ الْمُنَافِقِينَ إِنْ شَاءَ أَوْ يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 24,
      "juz": 21,
      "manzil": 5,
      "page": 421,
      "ruku": 363,
      "hizbQuarter": 168,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لِّيَجۡزِيَ ٱللَّهُ ٱلصَّٰدِقِينَ بِصِدۡقِهِمۡ وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ إِن شَآءَ أَوۡ يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا ٤٢\n                                    \n                                    \n                                    لما ذكر عز وجل عن المنافقين أنهم نقضوا العهد الذي كانوا عاهدوا الله عليه لا يولون الأدبار، وصف المؤمنين بأنهم استمروا على العهد والميثاق { صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } قال بعضهم أجله. وقال البخاري عهده، وهو يرجع إِلى الأول، { وَمِنْهُمْ مَّن يَنتَظِرُ وَمَا بَدَّلُواْ تَبْدِيلاً } أي وما غيروا عهد الله، ولا نقضوه ولا بدلوه. قال البخاري حدثنا أبو اليمان، أخبرنا شعيب عن الزهري قال أخبرني خارجة بن زيد بن ثابت عن أبيه قال لما نسخنا المصحف، فقدت آية من سورة الأحزاب كنت أسمع رسول الله صلى الله عليه وسلم يقرؤها، لم أجدها مع أحد إِلا مع خزيمة بن ثابت الأنصاري رضي الله عنه، الذي جعل رسول الله صلى الله عليه وسلم شهادته بشهادة رجلين { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ } تفرد به البخاري دون مسلم، وأخرجه أحمد في مسنده، والترمذي والنسائي في التفسير من سننهما من حديث الزهري به. وقال الترمذي حسن صحيح. وقال البخاري أيضاً حدثنا محمد بن بشار، حدثنا محمد بن عبد الله الأنصاري، حدثني أبي عن ثمامة عن أنس بن مالك رضي الله عنه قال نرى هذه الآية نزلت في أنس بن النضر رضي الله عنه { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ } الآية، انفرد به البخاري من هذا الوجه، ولكن له شواهد من طرق أخر. قال الإمام أحمد حدثنا هاشم بن القاسم، حدثنا سليمان بن المغيرة عن ثابت قال قال أنس عمي أنس بن النضر رضي الله عنه سميت به لم يشهد مع رسول الله صلى الله عليه وسلم يوم بدر، فشق عليه، وقال أول مشهد شهده رسول الله صلى الله عليه وسلم غبت عنه، لئن أراني الله تعالى مشهداً فيما بعد مع رسول الله صلى الله عليه وسلم ليرين الله عز وجل ما أصنع. قال فهاب أن يقول غيرها، فشهد مع رسول الله صلى الله عليه وسلم يوم أحد، فاستقبل سعد بن معاذ رضي الله عنه، فقال له أنس رضي الله عنه يا أبا عمرو أين واهاً لريح الجنة، إِني أجده دون أحد، قال فقاتلهم حتى قتل رضي الله عنه، قال فوجد في جسده بضع وثمانون بين ضربة وطعنة ورمية، فقالت أخته عمتي الربيّع بنة النضر فما عرفت أخي إِلا ببنانه، قال فنزلت هذه الآية { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَّن يَنتَظِرُ وَمَا بَدَّلُواْ تَبْدِيلاً } قال فكانوا يرون أنها نزلت فيه، وفي أصحابه رضي الله عنهم. ورواه مسلم والترمذي والنسائي من حديث سليمان بن المغيرة به.\n                                    ورواه النسائي أيضاً وابن جرير من حديث حماد بن سلمة عن ثابت عن أنس رضي الله عنه به نحوه. وقال ابن أبي حاتم حدثنا أحمد بن سنان، حدثنا يزيد بن هارون حدثنا حميد عن أنس، رضي الله عنه قال إِن عمه، يعني أنس بن النضر رضي الله عنه، غاب عن قتال بدر، قال غُيِّبت عن أول قتال قاتله رسول الله صلى الله عليه وسلم المشركين، لئن الله أشهدني قتالاً للمشركين، ليرين الله تعالى ما أصنع، قال فلما كان يوم أحد، انكشف المسلمون، فقال اللهم إِني أعتذر إِليك مما صنع هؤلاء ــــ يعني أصحابه ــــ وأبرأ إِليك مما جاء به هؤلاء ــــ يعني المشركين ــــ ثم تقدم، فلقيه سعد بن معاذ رضي الله عنه دون أحد، فقال أنا معك. قال سعد رضي الله عنه فلم أستطع أن أصنع ما صنع، فلما قتل قال فوجد فيه بضع وثمانون ضربة سيف وطعنة رمح ورمية سهم، وكانوا يقولون فيه وفي أصحابه نزلت { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَّن يَنتَظِرُ }. وأخرجه الترمذي في التفسير عن عبد بن حميد، والنسائي فيه أيضاً عن إِسحاق بن إِبراهيم، كلاهما عن يزيد بن هارون به. وقال الترمذي حسن. وقد رواه البخاري في المغازي عن حسان بن حسان، عن محمد بن طلحة عن مصرف عن حميد عن أنس رضي الله عنه به، ولم يذكر نزول الآية. ورواه ابن جرير من حديث المعتمر بن سليمان عن حميد عن أنس رضي الله عنه به. وقال ابن أبي حاتم حدثنا أحمد بن الفضل العسقلاني، حدثنا سليمان بن أيوب بن سلملن، بن عيسى بن موسى بن طلحة بن عبيد الله، حدثني أبي عن جدي عن موسى بن طلحة عن أبيه طلحة رضي الله عنه قال لما أن رجع رسول الله صلى الله عليه وسلم من أحد، صعد المنبر، فحمد الله تعالى، وأثنى عليه، وعزى المسلمين بما أصابهم، وأخبرهم بما لهم فيه من الأجر والذخر، ثم قرأ هذه الآية { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَـٰهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } الآية كلها، فقام إِليه رجل من المسلمين فقال يارسول الله من هؤلاء؟ فأقبلت، وعلي ثوبان أخضران حضرميان، فقال \" أيها السائل هذا منهم \" وكذا رواه ابن جرير من حديث سليمان بن أيوب الطلحي به. وأخرجه الترمذي في التفسير والمناقب أيضاً، وابن جرير من حديث يونس بن بكير عن طلحة بن يحيى عن موسى وعيسى ابني طلحة عن أبيهما رضي الله عنه به. وقال حديث غريب، لا نعرفه إلا من حديث يونس. وقال أيضاً حدثنا أحمد بن عصام الأنصاري حدثنا أبو عامر ــــ يعني العقدي ــــ حدثني إسحاق ــــ يعني ابن طلحة بن عبيد الله ــــ عن موسى بن طلحة قال دخلت على معاوية رضي الله عنه، فلما خرجت، دعاني فقال ألا أضع عندك يابن أخي حديثاً سمعته من رسول الله صلى الله عليه وسلم أشهد لسمعت رسول الله صلى الله عليه وسلم يقول :\n                                    \" طلحة ممن قضى نحبه \". ورواه ابن جرير حدثنا أبو كريب، حدثنا عبد الحميد الحماني عن إسحاق بن يحيى بن طلحة الطلحي عن موسى بن طلحة قال قام معاوية بن أبي سفيان رضي الله عنه، فقال إني سمعت رسول الله صلى الله عليه وسلم يقول \" طلحة ممن قضى نحبه \" ولهذا قال مجاهد في قوله تعالى { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } يعني عهده { وَمِنْهُمْ مَّن يَنتَظِرُ } قال يوماً فيه القتال، فيصدق في اللقاء. وقال الحسن { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } يعني موته على الصدق والوفاء، ومنهم من ينتظر الموت على مثل ذلك، ومنهم من لم يبدل تبديلاً، وكذا قال قتادة وابن زيد. وقال بعضهم نحبه نذره. وقوله تعالى { وَمَا بَدَّلُواْ تَبْدِيلاً } أي وما غيروا عهدهم، وبدلوا الوفاء بالغدر، بل استمروا على ما عاهدوا عليه، وما نقضوه كفعل المنافقين الذين قالوا { إِنَّ بُيُوتَنَا عَوْرَةٌ وَمَا هِىَ بِعَوْرَةٍ إِن يُرِيدُونَ إِلاَّ فِرَاراً وَلَوْ دُخِلَتْ عَلَيْهِمْ مِّنْ أَقْطَارِهَا ثُمَّ سُئِلُواْ ٱلْفِتْنَةَ لأَتَوْهَا وَمَا تَلَبَّثُواْ بِهَآ إِلاَّ يَسِيراً وَلَقَدْ كَانُواْ عَـٰهَدُواْ ٱللَّهَ مِن قَبْلُ لاَ يُوَلُّونَ ٱلأَدْبَـٰرَ }. وقوله تعالى { لِّيَجْزِىَ ٱللَّهُ ٱلصَّـٰدِقِينَ بِصِدْقِهِمْ وَيُعَذِّبَ ٱلْمُنَـٰفِقِينَ إِن شَآءَ أَوْ يَتُوبَ عَلَيْهِمْ } أي إنما يختبر عباده بالخوف والزلزال ليميز الخبيث من الطيب، فيظهر أمر هذا بالفعل، وأمر هذا بالفعل، مع أنه تعالى يعلم الشيء قبل كونه، ولكن لا يعذب الخلق بعلمه فيهم، حتى يعملوا بما يعلمه منهم كما قال تعالى :\n{ وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ ٱلْمُجَـٰهِدِينَ مِنكُمْ وَٱلصَّـٰبِرِينَ وَنَبْلُوَ أَخْبَـٰرَكُمْ }\nمحمد 31 فهذا علم بالشيء بعد كونه، وإن كان العلم السابق حاصلاً به قبل وجوده، وكذا قال الله تعالى\n{ مَّا كَانَ ٱللَّهُ لِيَذَرَ ٱلْمُؤْمِنِينَ عَلَىٰ مَآ أَنتُمْ عَلَيْهِ حَتَّىٰ يَمِيزَ ٱلْخَبِيثَ مِنَ ٱلطَّيِّبِ وَمَا كَانَ ٱللَّهُ لِيُطْلِعَكُمْ عَلَى ٱلْغَيْبِ }\nآل عمران 179 ولهذا قال تعالى ههنا { لِّيَجْزِىَ ٱللَّهُ ٱلصَّـٰدِقِينَ بِصِدْقِهِمْ } أي بصبرهم على ما عاهدوا الله عليه، وقيامهم به، ومحافظتهم عليه، { وَيُعَذِّبَ ٱلْمُنَـٰفِقِينَ } وهم الناقضون لعهد الله، المخالفون لأوامره، فاستحقوا بذلك عقابه، وعذابه، ولكن هم تحت مشيئته في الدنيا، إن شاء استمر بهم على ما فعلوا حتى يلقوه فيعذبهم عليه، وإن شاء تاب عليهم بأن أرشدهم إلى النزوع عن النفاق إلى الإيمان، والعمل الصالح بعد الفسوق والعصيان. ولما كانت رحمته ورأفته تبارك وتعالى بخلقه هي الغالبة لغضبه قال { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً }.\n                                    ",
        "qortoby": "لِّيَجۡزِيَ ٱللَّهُ ٱلصَّٰدِقِينَ بِصِدۡقِهِمۡ وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ إِن شَآءَ أَوۡ يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا ٤٢\n                                    \n                                    \n                                    قوله تعالى: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ } رفع بالابتداء، وصَلُح الابتداء بالنكرة لأن «صَدَقُوا» في موضع النعت. { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ }. «مَن» في موضع رفع بالابتداء. وكذا «وَمِنْهُمْ مَنْ يَنْتَظِرُ» والخبر في المجرور. والنَّحْب: النذر والعهد؛ تقول منه: نَحَبت أَنْحُب؛ بالضم. قال الشاعر :\nوإذا نحبت كَلْبٌ على الناس إنهم\t   \tأحق بتاج الماجد المتكرم\nوقال آخر :\nقـد نحـب المجـدُ علـيـنا نَحْـبَـا\t   \t\nوقال آخر :\nأَنَحْـبٌ فيـقـضَـى أم ضـلالٌ وبـاطـلُ\t   \t\nوروى البخاريّ ومسلم والترمذي عن أنس قال: قال عمّي أنس بن النَّضْر ـ سُمِّيت به ـ ولم يشهد بدراً مع رسول الله صلى الله عليه وسلم فكَبُر عليه فقال: أوّل مشهد شهده رسول الله صلى الله عليه وسلم غِبتُ عنه، أما واللَّهِ لئن أرانِي الله مشهداً مع رسول الله صلى الله عليه وسلم فيما بعد لَيَرَيَنّ الله ما أصنع. قال: فهاب أن يقول غيرها؛ فشهد مع رسول الله صلى الله عليه وسلم يوم أُحُد من العام القابل، فاستقبله سعد بن مالك فقال: يا أبا عمرو أين؟ قال: واهاً لريح الجنة! أجدها دون أُحُد؛ فقاتل حتى قُتل، فوجِد في جسده بضع وثمانون ما بين ضربة وطعنة ورَمْية. فقالت عَمّتي الرُّبَيِّع بنت النضر: فما عرفت أخي إلا بَبَنانه. ونزلت هذه الآية: { رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَّن يَنتَظِرُ وَمَا بَدَّلُواْ تَبْدِيلاً } لفظ الترمذيّ، وقال: هذا حديث حسن صحيح. وقالت عائشة رضي الله عنها في قوله تعالى :\n{ مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ }\n[الأحزاب: 23] الآية: منهم طلحة بن عبيد الله ثبت مع رسول الله صلى الله عليه وسلم حتى أصيبت يده؛ فقال النبيّ صلى الله عليه وسلم: \" أوجب طلحة الجنة \" وفي الترمذيّ عنه: \" أن أصحاب رسول الله صلى الله عليه وسلم قالوا لأعرابيّ جاهل: سله عمن قضى نحبه من هو؟ وكانوا لا يجترئون على مسألته، يوقّرونه ويهابونه؛ فسأله الأعرابي فأعرض عنه، ثم سأله فأعرض عنه؛ ثم إني اطّلعت من باب المسجد وعليّ ثياب خضر، فلما رآني النبيّ صلى الله عليه وسلم قال: «أين السائل عمن قضى نحبه؟» قال الأعرابي: أنا يا رسول الله. قال: «هذا ممن قضى نَحْبَه» \" قال: هذا حديث حسن غريب لا نعرفه إلا من حديث يونس بن بكير. وروى البيهقي عن أبي هريرة: \" أن رسول الله صلى الله عليه وسلم حين انصرف من أُحُد، مرّ على مصعب بن عُمير وهو مقتول على طريقه، فوقف عليه ودَعَا له، ثم تلا هذه الآية: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ ـ إلى ـ تَبْدِيلاً } ثم قال رسول الله صلى الله عليه وسلم: «أشهد أن هؤلاء شهداء عند الله يوم القيامة فأْتُوهم وزوروهم والذي نفسي بيده لا يسلّم عليهم أحد إلى يوم القيامة إلا ردّوا عليه» \"\n                                   وقيل: النحب الموت؛ أي مات على ما عاهد عليه؛ عن ابن عباس. والنحب أيضاً الوقت والمدّة. يقال: قضى فلان نحبه إذا مات. وقال ذو الرمّة :\nعشِيّةَ فرّ الحارِثيّون بعد ما\t   \tقَضَى نَحْبه في ملتَقَى الخيل هَوْبَرُ\nوالنَّحْب أيضاً الحاجة والهِمة؛ يقول قائلهم: مالي عندهم نحب؛ وليس المراد بالآية. والمعنى في هذا الموضع بالنحب النذر كما قدّمنا أوّلاً؛ أي منهم من بذل جهده على الوفاء بعهده حتى قتل؛ مثل حمزة وسعد بن معاذ وأنس بن النضر وغيرهم. ومنهم من ينتظر الشهادة وما بدّلوا عهدهم ونذرهم. وقد روي عن ابن عباس أنه قرأ «فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ وَمِنْهُمْ مَّن يَنتَظِرُ ومنهم من بدّل تَبْديلاً» قال أبو بكر الأنباريّ: وهذا الحديث عند أهل العلم مردود؛ لخلافه الإجماع، ولأن فيه طعناً على المؤمنين والرجال الذين مدحهم الله وشرفهم بالصدق والوفاء؛ فما يعرف فيهم مغيّر وما وجد من جماعتهم مبدّل؛ رضي الله عنهم. { لِّيَجْزِيَ ٱللَّهُ ٱلصَّادِقِينَ بِصِدْقِهِمْ } أي أمر الله بالجهاد ليجزي الصادقين في الآخرة بصدقهم. { وَيُعَذِّبَ ٱلْمُنَافِقِينَ } في الآخرة { إِن شَآءَ } أي إن شاء أن يعذبهم لم يوفقهم للتوبة؛ وإن لم يشأ أن يعذبهم تاب عليهم قبل الموت. { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً }.\n\n                                    ",
        "saadi": "لِّيَجۡزِيَ ٱللَّهُ ٱلصَّٰدِقِينَ بِصِدۡقِهِمۡ وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ إِن شَآءَ أَوۡ يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا ٤٢\n                                        \n                                        \n                                        \n                                        { قُل } لهم، لائماً على فرارهم، ومخبراً أنهم لا يفيدهم ذلك شيئاً { لَّن يَنفَعَكُمُ ٱلْفِرَارُ إِن فَرَرْتُمْ مِّنَ ٱلْمَوْتِ أَوِ ٱلْقَتْلِ } فلو كنتم في بيوتكم، لبرز الذين كتب عليهم القتل إلى مضاجعهم. والأسباب تنفع، إذا لم يعارضها القضاء والقدر، فإذا جاء القضاء والقدر، تلاشى كل سبب، وبطلت كل وسيلة ظنها الإنسان تنجيه. { وَإِذاً } حين فررتم لتسلموا من الموت والقتل، ولتنعموا في الدنيا فإنكم { لاَّ تُمَتَّعُونَ إِلاَّ قَلِيلاً } متاعاً لا يسوى فراركم، وترككم أمر اللّه، وتفويتكم على أنفسكم التمتع الأبدي، في النعيم السرمدي. ثم بيَّن أن الأسباب كلها لا تغني عن العبد شيئاً إذا أراده اللّه بسوء، فقال: { قُلْ مَن ذَا ٱلَّذِي يَعْصِمُكُمْ } أي: يمنعكم { مِّنَ ٱللَّهِ إِنْ أَرَادَ بِكُمْ سُوۤءاً } أي: شراً، { أَوْ أَرَادَ بِكُمْ رَحْمَةً } فإنه هو المعطي المانع، الضار النافع، الذي لا يأتي بالخير إلا هو، ولا يدفع السوء إلاّ هو. { وَلاَ يَجِدُونَ لَهُمْ مِّن دُونِ ٱللَّهِ وَلِيّاً } يتولاهم، فيجلب لهم النفع { وَلاَ نَصِيراً } أي: ينصرهم، فيدفع عنهم المضار. فَلْيَمْتَثِلُوا طاعة المنفرد بالأمور كلها، الذي نفذت مشيئته، ومضى قدره، ولم ينفع مع ترك ولايته ونصرته، وَلِيٌّ ولا ناصر. ثم توَّعد تعالى المخذلين المعوقين، وتهددهم فقال: { قَدْ يَعْلَمُ ٱللَّهُ ٱلْمُعَوِّقِينَ مِنكُمْ } عن الخروج لمن [لم] يخرجوا { وَٱلْقَآئِلِينَ لإِخْوَانِهِمْ } الذين خرجوا: { هَلُمَّ إِلَيْنَا } أي: ارجعوا، كما تقدم من قولهم :\n{ يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ فَٱرْجِعُواْ }\n[الأحزاب: 13]. وهم مع تعويقهم وتخذيلهم { وَلاَ يَأْتُونَ ٱلْبَأْسَ } القتال والجهاد بأنفسهم { إِلاَّ قَلِيلاً } فهم أشد الناس حرصاً على التخلف، لعدم الداعي لذلك من الإيمان والصبر، ووجود المقتضى للجبن، من النفاق وعدم الإيمان. { أَشِحَّةً عَلَيْكُمْ } بأبدانهم عند القتال، وبأموالهم عند النفقة فيه، فلا يجاهدون بأموالهم وأنفسهم. { فَإِذَا جَآءَ ٱلْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ } نظر المغشى عليه { مِنَ ٱلْمَوْتِ } من شدة الجبن، الذي خلع قلوبهم، والقلق الذي أذهلهم، وخوفاً من إجبارهم على ما يكرهون من القتال. { فَإِذَا ذَهَبَ ٱلْخَوْفُ } وصاروا في حال الأمن والطمأنينة، { سَلَقُوكُمْ بِأَلْسِنَةٍ } أي: خاطبوكم وتكلموا معكم، بكلام حديد، ودعاوى غير صحيحة. وحين تسمعهم، تظنهم أهل الشجاعة والإقدام، { أَشِحَّةً عَلَى ٱلْخَيْرِ } الذي يراد منهم، وهذا شر ما في الإنسان، أن يكون شحيحاً بما أمر به، شحيحاً بماله أن ينفقه في وجهه، شحيحاً في بدنه أن يجاهد أعداء اللّه، أو يدعو إلى سبيل اللّه، شحيحاً بجاهه، شحيحاً بعلمه ونصيحته ورأيه. { أوْلَـٰئِكَ } الذين بتلك الحالة { لَمْ يُؤْمِنُواْ } بسبب عدم إيمانهم أحبط الله أعمالهم، { وَكَانَ ذَلِكَ عَلَى ٱللَّهِ يَسِيراً }. وأما المؤمنون، فقد وقاهم اللّه شح أنفسهم، ووفقهم لبذل ما أمروا به، من بذلٍ لأبدانهم في القتال في سبيله، وإعلاء كلمته، وأموالهم للنفقة في طرق الخير، وجاههم وعلمهم.\n                                   \n                                   { يَحْسَبُونَ ٱلأَحْزَابَ لَمْ يَذْهَبُواْ } أي: يظنون أن هؤلاء الأحزاب، الذين تحزبوا على حرب رسول اللّه صلى اللّه عليه وسلم وأصحابه لم يذهبوا حتى يستأصلوهم، فخاب ظنهم، وبطل حسبانهم. { وَإِن يَأْتِ ٱلأَحْزَابُ } مرة أخرى { يَوَدُّواْ لَوْ أَنَّهُمْ بَادُونَ فِي ٱلأَعْرَابِ يَسْأَلُونَ عَنْ أَنبَآئِكُمْ } أي: لو أتى الأحزاب مرة ثانية مثل هذه المرة، ودَّ هؤلاء المنافقون، أنهم ليسوا في المدينة ولا في القرب منها، وأنهم مع الأعراب في البادية، يستخبرون عن أخباركم، ويسألون عن أنبائكم، ماذا حصل عليكم؟ فتباً لهم، وبعداً فليسوا ممن يبالى بحضورهم { وَلَوْ كَانُواْ فِيكُمْ مَّا قَاتَلُوۤاْ إِلاَّ قَلِيلاً } فلا تبالوهم، ولا تأسوا عليهم. { لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ ٱللَّهِ أُسْوَةٌ حَسَنَةٌ } حيث حضر الهيجاء بنفسه الكريمة، وباشر موقف الحرب، وهو الشريف الكامل، والبطل الباسل، فكيف تشحون بأنفسكم عن أمر جاد رسول اللّه صلى اللّه عليه وسلم بنفسه فيه؟!! فَتأَسُّوْا به في هذا الأمر وغيره. واستدل الأصوليون في هذه الآية، على الاحتجاج بأفعال الرسول صلى اللّه عليه وسلم، وأن الأصل، أن أمته أسوته في الأحكام، إلاّ ما دلَّ الدليل الشرعي على الاختصاص به. فالأسوة نوعان: أسوة حسنة، وأسوة سيئة. فالأسوة الحسنة في الرسول صلى اللّه عليه وسلم، فإن المتأسِّي به، سالك الطريق الموصل إلى كرامة اللّه، وهو الصراط المستقيم. وأما الأسوة بغيره إذا خالفه، فهو الأسوة السيئة، كقول الكفار حين دعتهم الرسل للتأسِّي [بهم]: { بَلْ قَالُوۤاْ إِنَّا وَجَدْنَآ ءَابَآءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ ءَاثَارِهِم مُّهْتَدُونَ }. وهذه الأسوة الحسنة، إنما يسلكها ويوفق لها، من كان يرجو اللّه واليوم الآخر، فإن ما معه من الإيمان، وخوف اللّه، ورجاء ثوابه، وخوف عقابه، يحثه على التأسي بالرسول صلى اللّه عليه وسلم. لما ذكر حالة المنافقين عند الخوف، ذكر حال المؤمنين، فقال: { وَلَمَّا رَأَى ٱلْمُؤْمِنُونَ ٱلأَحْزَابَ } الذين تحزبوا، ونزلوا منازلهم، وانتهى الخوف، { قَالُواْ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ } في قوله :\n{ أَمْ حَسِبْتُمْ أَن تَدْخُلُواْ ٱلْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ ٱلَّذِينَ خَلَوْاْ مِن قَبْلِكُم مَّسَّتْهُمُ ٱلْبَأْسَآءُ وَٱلضَّرَّآءُ وَزُلْزِلُواْ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ آمَنُواْ مَعَهُ مَتَىٰ نَصْرُ ٱللَّهِ أَلاۤ إِنَّ نَصْرَ ٱللَّهِ قَرِيبٌ }\n[البقرة: 214]. { وَصَدَقَ ٱللَّهُ وَرَسُولُهُ } فإنا رأينا، ما أخبرنا به { وَمَا زَادَهُمْ } ذلك الأمر { إِلاَّ إِيمَاناً } في قلوبهم { وَتَسْلِيماً } في جوارحهم، وانقياداً لأمر اللّه. ولما ذكر أن المنافقين عاهدوا اللّه، لا يولون الأدبار، ونقضوا ذلك العهد، ذكر وفاء المؤمنين به، فقال: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ } أي: وفوا به، وأتموه، وأكملوه، فبذلوا مهجهم في مرضاته، وسبَّلوا أنفسهم في طاعته. { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } أي: إرادته ومطلوبه وما عليه من الحق، فقُتل في سبيل اللّه، أو مات مؤدياً لحقه لم ينقصه شيئاً. { وَمِنْهُمْ مَّن يَنتَظِرُ } تكميل ما عليه، فهو شارع في قضاء ما عليه، ووفاء نحبه ولما يكمله، وهو في رجاء تكميله، ساع في ذلك مجد.\n                                   \n{ وَمَا بَدَّلُواْ تَبْدِيلاً } كما بدَّل غيرهم، بل لم يزالوا على العهد، لا يلوون ولا يتغيرون، فهؤلاء الرجال على الحقيقة، ومن عداهم فصورهم صور رجال، وأما الصفات فقد قصرت عن صفات الرجال. { لِّيَجْزِيَ ٱللَّهُ ٱلصَّادِقِينَ بِصِدْقِهِمْ } أي: بسبب صدقهم، في أقوالهم وأحوالهم، ومعاملتهم مع اللّه، واستواء ظاهرهم وباطنهم، قال اللّه تعالى :\n{ هَـٰذَا يَوْمُ يَنفَعُ ٱلصَّادِقِينَ صِدْقُهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ خَالِدِينَ فِيهَآ أَبَداً }\nالآية [المائدة: 119]. أي: قدرنا ما قدرنا من هذه الفتن والمحن والزلازل، ليتبين الصادق من الكاذب، فيجزي الصادقين بصدقهم { وَيُعَذِّبَ ٱلْمُنَافِقِينَ } الذين تغيرت قلوبهم وأعمالهم عند حلول الفتن، ولم يفوا بما عاهدوا اللّه عليه. { إِن شَآءَ } تعذيبهم، بأن لم يشأ هدايتهم، بل علم أنهم لا خير فيهم فلم يوفقهم. { أَوْ يَتُوبَ عَلَيْهِمْ } بأن يوفقهم للتوبة والإنابة، وهذا هو الغالب على كرم الكريم، ولهذا ختم الآية باسمين دالين على المغفرة، والفضل والإحسان فقال: { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً } غفوراً لذنوب المسرفين على أنفسهم، ولو أكثروا من العصيان إذا أتوا بالمتاب. { رَّحِيماً } بهم، حيث وفقهم للتوبة، ثم قبلها منهم وستر عليهم ما اجترحوه. { وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيْظِهِمْ لَمْ يَنَالُواْ خَيْراً } أي: ردهم خائبين، لم يحصل لهم الأمر الذي كانوا حنقين عليه، مغتاظين قادرين [عليه] جازمين، بأن لهم الدائرة، قد غرتهم جموعهم، وأعجبوا بتحزبهم، وفرحوا بِعَدَدِهمْ وعُدَدِهِمْ. فأرسل اللّه عليهم ريحاً عظيمة، وهي ريح الصبا، فزعزعت مراكزهم، وقوَّضت خيامهم، وكفأت قدورهم وأزعجتهم، وضربهم اللّه بالرعب، فانصرفوا بغيظهم، وهذا من نصر اللّه لعباده المؤمنين. { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } بما صنع لهم من الأسباب العادية والقدرية، { وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً } لا يغالبه أحد إلا غُلِبَ، ولا يستنصره أحد إلا غَلَبَ، ولا يعجزه أمر أراده، ولا ينفع أهل القوة والعزة قوتهم وعزتهم، إن لم يعنهم بقوته وعزته. { وَأَنزَلَ ٱلَّذِينَ ظَاهَرُوهُم } أي عاونوهم { مِّنْ أَهْلِ ٱلْكِتَابِ } أي: اليهود { مِن صَيَاصِيهِمْ } أي: أنزلهم من حصونهم، نزولا مظفوراً بهم، مجعولين تحت حكم الإسلام. { وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعْبَ } فلم يقووا على القتال، بل استسلموا وخضعوا وذلوا. { فَرِيقاً تَقْتُلُونَ } وهم الرجال المقاتلون { وَتَأْسِرُونَ فَرِيقاً } مَنْ عداهم من النساء والصبيان. { وَأَوْرَثَكُمْ } أي: غنَّمكم { أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضاً لَّمْ تَطَئُوهَا } أي: أرضاً كانت من قبل، من شرفها وعزتها عند أهلها، لا تتمكنون من وطئها، فمكَّنكم اللّه وخذلهم، وغنمتم أموالهم، وقتلتموهم وأسرتموهم. { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيراً } لا يعجزه شيء، ومن قدرته قدَّر لكم ما قدر. وكانت هذه الطائفة من أهل الكتاب، هم بنو قريظة من اليهود، في قرية خارج المدينة غير بعيدة، وكان النبي صلى اللّه عليه وسلم [حين] هاجر إلى المدينة وادعهم وهادنهم، فلم يقاتلهم ولم يقاتلوه، وهم باقون على دينهم، لم يغير عليهم شيئاً.\n                                   فلما رأوا يوم الخندق، الأحزاب الذين تحزبوا على رسول اللّه وكثرتهم، وقلة المسلمين، وظنوا أنهم سيستأصلون الرسول والمؤمنين، وساعد على ذلك، [تدجيل] بعض رؤسائهم عليهم، فنقضوا العهد الذي بينهم وبين رسول اللّه صلى اللّه عليه وسلم ومالؤوا المشركين على قتاله. فلما خذل اللّه المشركين، تفرغ رسول اللّه صلى اللّه عليه وسلم لقتالهم، فحاصرهم في حصنهم، فنزلوا على حكم سعد بن معاذ رضي اللّه عنه، فحكم فيهم، أن تقتل مقاتلتهم، وتسبى ذراريهم، وتغنم أموالهم. فأتم اللّه لرسوله والمؤمنين، المنة، وأسبغ عليهم النعمة، وأَقَرَّ أعينهم بخذلان مَنْ انخذل من أعدائهم، وقتل مَنْ قتلوا، وأسر مَنْ أسروا، ولم يزل لطف اللّه بعباده المؤمنين مستمراً.\n\n                                    "
      },
      "originalText": "لِّيَجۡزِيَ ٱللَّهُ ٱلصَّٰدِقِينَ بِصِدۡقِهِمۡ وَيُعَذِّبَ ٱلۡمُنَٰفِقِينَ إِن شَآءَ أَوۡ يَتُوبَ عَلَيۡهِمۡۚ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا ٤٢"
    },
    {
      "number": 3558,
      "text": "وَرَدَّ اللَّهُ الَّذِينَ كَفَرُوا بِغَيْظِهِمْ لَمْ يَنَالُوا خَيْرًا ۚ وَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ ۚ وَكَانَ اللَّهُ قَوِيًّا عَزِيزًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 25,
      "juz": 21,
      "manzil": 5,
      "page": 421,
      "ruku": 363,
      "hizbQuarter": 168,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيۡظِهِمۡ لَمۡ يَنَالُواْ خَيۡرٗاۚ وَكَفَى ٱللَّهُ ٱلۡمُؤۡمِنِينَ ٱلۡقِتَالَۚ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزٗا ٥٢\n                                    \n                                    \n                                    يقول تعالى مخبراً عن الأحزاب لما أجلاهم عن المدينة بما أرسل عليهم من الريح والجنود الإلهية، ولولا أن الله جعل رسوله رحمة للعالمين، لكانت هذه الريح عليهم أشد من الريح العقيم التي أرسلها على عاد، ولكن قال تعالى\n{ وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ }\nالأنفال 33 فسلط عليهم هواء فرق شملهم كما كان سبب اجتماعهم من الهوى، وهم أخلاط من قبائل شتى أحزاب وآراء، فناسب أن يرسل عليهم الهواء الذي فرق جماعاتهم، وردهم خائبين خاسرين بغيظهم وحنقهم، ولم ينالوا خيراً لا في الدنيا مما كان في أنفسهم من الظفر والمغنم، ولا في الآخرة بما تحملوه من الآثام في مبارزة الرسول صلى الله عليه وسلم بالعداوة، وهمهم بقتله، واستئصال جيشه، ومن هم بشيء وصدق همه بفعله، فهو في الحقيقة كفاعله. وقوله تبارك وتعالى { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } أي لم يحتاجوا إِلى منازلتهم ومبارزتهم حتى يجلوهم عن بلادهم، بل كفى الله وحده، ونصر عبده، وأعز جنده، ولهذا كان رسول الله صلى الله عليه وسلم يقول \" لا إله إلا الله وحده، صدق وعده، ونصر عبده، وأعز جنده، وهزم الأحزاب وحده، فلا شيء بعده \" أخرجاه من حديث أبي هريرة رضي الله عنه. وفي الصحيحين من حديث إسماعيل بن أبي خالد عن عبد الله بن أبي أوفى رضي الله عنه قال دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال \" اللهم منزل الكتاب، سريع الحساب، اهزم الأحزاب، اللهم اهزمهم وزلزلهم \" وفي قوله عز وجل { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } إشارة إلى وضع الحرب بينهم وبين قريش، وهكذا وقع بعدها، لم يغزهم المشركون، بل غزاهم المسلمون في بلادهم. قال محمد بن إسحاق لما انصرف أهل الخندق عن الخندق، قال رسول الله صلى الله عليه وسلم فيما بلغنا \" لن تغزوكم قريش بعد عامكم هذا، ولكنكم تغزونهم \" فلم تغز قريش بعد ذلك، وكان رسول الله صلى الله عليه وسلم هو يغزوهم بعد ذلك، حتى فتح الله تعالى مكة، وهذا الحديث الذي ذكره محمد بن إسحاق حديث صحيح، كما قال الإمام أحمد حدثنا يحيى عن سفيان، حدثني أبو إسحاق قال سمعت سليمان بن صرد رضي الله عنه يقول قال رسول الله صلى الله عليه وسلم يوم الأحزاب \" الآن نغزوهم ولا يغزوننا \" وهكذا رواه البخاري في \" صحيحه \" من حديث الثوري، وإسرائيل عن أبي إسحاق به، وقوله تعالى { وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً } أي بحوله وقوته ردهم خائبين، لم ينالوا خيراً، وأعز الله الإسلام وأهله، وصدق وعده، ونصر رسوله وعبده، فله الحمد والمنة.\n                                    ",
        "qortoby": "وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيۡظِهِمۡ لَمۡ يَنَالُواْ خَيۡرٗاۚ وَكَفَى ٱللَّهُ ٱلۡمُؤۡمِنِينَ ٱلۡقِتَالَۚ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزٗا ٥٢\n                                    \n                                    \n                                    قوله تعالى: { وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيْظِهِمْ لَمْ يَنَالُواْ خَيْراً } قال محمد بن عمرو يرفعه إلى عائشة: قالت: «الَّذِينَ كَفَرُوا» هاهنا أبو سفيان وعُيينة بن بدر، رجع أبو سفيان إلى تِهامة، ورجع عُيينة إلى نجد. { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } بأن أرسل عليهم ريحاً وجنوداً حتى رجعوا ورجعت بنو قُريظة إلى صياصِيهم؛ فكفى أمَر قريظة بالرعب. { وَكَانَ ٱللَّهُ قَوِيّاً } أمره { عَزِيزاً } لا يُغلَب.\n                                    ",
        "saadi": "وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيۡظِهِمۡ لَمۡ يَنَالُواْ خَيۡرٗاۚ وَكَفَى ٱللَّهُ ٱلۡمُؤۡمِنِينَ ٱلۡقِتَالَۚ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزٗا ٥٢\n                                        \n                                        \n                                        \n                                        { قُل } لهم، لائماً على فرارهم، ومخبراً أنهم لا يفيدهم ذلك شيئاً { لَّن يَنفَعَكُمُ ٱلْفِرَارُ إِن فَرَرْتُمْ مِّنَ ٱلْمَوْتِ أَوِ ٱلْقَتْلِ } فلو كنتم في بيوتكم، لبرز الذين كتب عليهم القتل إلى مضاجعهم. والأسباب تنفع، إذا لم يعارضها القضاء والقدر، فإذا جاء القضاء والقدر، تلاشى كل سبب، وبطلت كل وسيلة ظنها الإنسان تنجيه. { وَإِذاً } حين فررتم لتسلموا من الموت والقتل، ولتنعموا في الدنيا فإنكم { لاَّ تُمَتَّعُونَ إِلاَّ قَلِيلاً } متاعاً لا يسوى فراركم، وترككم أمر اللّه، وتفويتكم على أنفسكم التمتع الأبدي، في النعيم السرمدي. ثم بيَّن أن الأسباب كلها لا تغني عن العبد شيئاً إذا أراده اللّه بسوء، فقال: { قُلْ مَن ذَا ٱلَّذِي يَعْصِمُكُمْ } أي: يمنعكم { مِّنَ ٱللَّهِ إِنْ أَرَادَ بِكُمْ سُوۤءاً } أي: شراً، { أَوْ أَرَادَ بِكُمْ رَحْمَةً } فإنه هو المعطي المانع، الضار النافع، الذي لا يأتي بالخير إلا هو، ولا يدفع السوء إلاّ هو. { وَلاَ يَجِدُونَ لَهُمْ مِّن دُونِ ٱللَّهِ وَلِيّاً } يتولاهم، فيجلب لهم النفع { وَلاَ نَصِيراً } أي: ينصرهم، فيدفع عنهم المضار. فَلْيَمْتَثِلُوا طاعة المنفرد بالأمور كلها، الذي نفذت مشيئته، ومضى قدره، ولم ينفع مع ترك ولايته ونصرته، وَلِيٌّ ولا ناصر. ثم توَّعد تعالى المخذلين المعوقين، وتهددهم فقال: { قَدْ يَعْلَمُ ٱللَّهُ ٱلْمُعَوِّقِينَ مِنكُمْ } عن الخروج لمن [لم] يخرجوا { وَٱلْقَآئِلِينَ لإِخْوَانِهِمْ } الذين خرجوا: { هَلُمَّ إِلَيْنَا } أي: ارجعوا، كما تقدم من قولهم :\n{ يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ فَٱرْجِعُواْ }\n[الأحزاب: 13]. وهم مع تعويقهم وتخذيلهم { وَلاَ يَأْتُونَ ٱلْبَأْسَ } القتال والجهاد بأنفسهم { إِلاَّ قَلِيلاً } فهم أشد الناس حرصاً على التخلف، لعدم الداعي لذلك من الإيمان والصبر، ووجود المقتضى للجبن، من النفاق وعدم الإيمان. { أَشِحَّةً عَلَيْكُمْ } بأبدانهم عند القتال، وبأموالهم عند النفقة فيه، فلا يجاهدون بأموالهم وأنفسهم. { فَإِذَا جَآءَ ٱلْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ } نظر المغشى عليه { مِنَ ٱلْمَوْتِ } من شدة الجبن، الذي خلع قلوبهم، والقلق الذي أذهلهم، وخوفاً من إجبارهم على ما يكرهون من القتال. { فَإِذَا ذَهَبَ ٱلْخَوْفُ } وصاروا في حال الأمن والطمأنينة، { سَلَقُوكُمْ بِأَلْسِنَةٍ } أي: خاطبوكم وتكلموا معكم، بكلام حديد، ودعاوى غير صحيحة. وحين تسمعهم، تظنهم أهل الشجاعة والإقدام، { أَشِحَّةً عَلَى ٱلْخَيْرِ } الذي يراد منهم، وهذا شر ما في الإنسان، أن يكون شحيحاً بما أمر به، شحيحاً بماله أن ينفقه في وجهه، شحيحاً في بدنه أن يجاهد أعداء اللّه، أو يدعو إلى سبيل اللّه، شحيحاً بجاهه، شحيحاً بعلمه ونصيحته ورأيه. { أوْلَـٰئِكَ } الذين بتلك الحالة { لَمْ يُؤْمِنُواْ } بسبب عدم إيمانهم أحبط الله أعمالهم، { وَكَانَ ذَلِكَ عَلَى ٱللَّهِ يَسِيراً }. وأما المؤمنون، فقد وقاهم اللّه شح أنفسهم، ووفقهم لبذل ما أمروا به، من بذلٍ لأبدانهم في القتال في سبيله، وإعلاء كلمته، وأموالهم للنفقة في طرق الخير، وجاههم وعلمهم.\n                                   \n                                   { يَحْسَبُونَ ٱلأَحْزَابَ لَمْ يَذْهَبُواْ } أي: يظنون أن هؤلاء الأحزاب، الذين تحزبوا على حرب رسول اللّه صلى اللّه عليه وسلم وأصحابه لم يذهبوا حتى يستأصلوهم، فخاب ظنهم، وبطل حسبانهم. { وَإِن يَأْتِ ٱلأَحْزَابُ } مرة أخرى { يَوَدُّواْ لَوْ أَنَّهُمْ بَادُونَ فِي ٱلأَعْرَابِ يَسْأَلُونَ عَنْ أَنبَآئِكُمْ } أي: لو أتى الأحزاب مرة ثانية مثل هذه المرة، ودَّ هؤلاء المنافقون، أنهم ليسوا في المدينة ولا في القرب منها، وأنهم مع الأعراب في البادية، يستخبرون عن أخباركم، ويسألون عن أنبائكم، ماذا حصل عليكم؟ فتباً لهم، وبعداً فليسوا ممن يبالى بحضورهم { وَلَوْ كَانُواْ فِيكُمْ مَّا قَاتَلُوۤاْ إِلاَّ قَلِيلاً } فلا تبالوهم، ولا تأسوا عليهم. { لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ ٱللَّهِ أُسْوَةٌ حَسَنَةٌ } حيث حضر الهيجاء بنفسه الكريمة، وباشر موقف الحرب، وهو الشريف الكامل، والبطل الباسل، فكيف تشحون بأنفسكم عن أمر جاد رسول اللّه صلى اللّه عليه وسلم بنفسه فيه؟!! فَتأَسُّوْا به في هذا الأمر وغيره. واستدل الأصوليون في هذه الآية، على الاحتجاج بأفعال الرسول صلى اللّه عليه وسلم، وأن الأصل، أن أمته أسوته في الأحكام، إلاّ ما دلَّ الدليل الشرعي على الاختصاص به. فالأسوة نوعان: أسوة حسنة، وأسوة سيئة. فالأسوة الحسنة في الرسول صلى اللّه عليه وسلم، فإن المتأسِّي به، سالك الطريق الموصل إلى كرامة اللّه، وهو الصراط المستقيم. وأما الأسوة بغيره إذا خالفه، فهو الأسوة السيئة، كقول الكفار حين دعتهم الرسل للتأسِّي [بهم]: { بَلْ قَالُوۤاْ إِنَّا وَجَدْنَآ ءَابَآءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ ءَاثَارِهِم مُّهْتَدُونَ }. وهذه الأسوة الحسنة، إنما يسلكها ويوفق لها، من كان يرجو اللّه واليوم الآخر، فإن ما معه من الإيمان، وخوف اللّه، ورجاء ثوابه، وخوف عقابه، يحثه على التأسي بالرسول صلى اللّه عليه وسلم. لما ذكر حالة المنافقين عند الخوف، ذكر حال المؤمنين، فقال: { وَلَمَّا رَأَى ٱلْمُؤْمِنُونَ ٱلأَحْزَابَ } الذين تحزبوا، ونزلوا منازلهم، وانتهى الخوف، { قَالُواْ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ } في قوله :\n{ أَمْ حَسِبْتُمْ أَن تَدْخُلُواْ ٱلْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ ٱلَّذِينَ خَلَوْاْ مِن قَبْلِكُم مَّسَّتْهُمُ ٱلْبَأْسَآءُ وَٱلضَّرَّآءُ وَزُلْزِلُواْ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ آمَنُواْ مَعَهُ مَتَىٰ نَصْرُ ٱللَّهِ أَلاۤ إِنَّ نَصْرَ ٱللَّهِ قَرِيبٌ }\n[البقرة: 214]. { وَصَدَقَ ٱللَّهُ وَرَسُولُهُ } فإنا رأينا، ما أخبرنا به { وَمَا زَادَهُمْ } ذلك الأمر { إِلاَّ إِيمَاناً } في قلوبهم { وَتَسْلِيماً } في جوارحهم، وانقياداً لأمر اللّه. ولما ذكر أن المنافقين عاهدوا اللّه، لا يولون الأدبار، ونقضوا ذلك العهد، ذكر وفاء المؤمنين به، فقال: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ } أي: وفوا به، وأتموه، وأكملوه، فبذلوا مهجهم في مرضاته، وسبَّلوا أنفسهم في طاعته. { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } أي: إرادته ومطلوبه وما عليه من الحق، فقُتل في سبيل اللّه، أو مات مؤدياً لحقه لم ينقصه شيئاً. { وَمِنْهُمْ مَّن يَنتَظِرُ } تكميل ما عليه، فهو شارع في قضاء ما عليه، ووفاء نحبه ولما يكمله، وهو في رجاء تكميله، ساع في ذلك مجد.\n                                   \n{ وَمَا بَدَّلُواْ تَبْدِيلاً } كما بدَّل غيرهم، بل لم يزالوا على العهد، لا يلوون ولا يتغيرون، فهؤلاء الرجال على الحقيقة، ومن عداهم فصورهم صور رجال، وأما الصفات فقد قصرت عن صفات الرجال. { لِّيَجْزِيَ ٱللَّهُ ٱلصَّادِقِينَ بِصِدْقِهِمْ } أي: بسبب صدقهم، في أقوالهم وأحوالهم، ومعاملتهم مع اللّه، واستواء ظاهرهم وباطنهم، قال اللّه تعالى :\n{ هَـٰذَا يَوْمُ يَنفَعُ ٱلصَّادِقِينَ صِدْقُهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ خَالِدِينَ فِيهَآ أَبَداً }\nالآية [المائدة: 119]. أي: قدرنا ما قدرنا من هذه الفتن والمحن والزلازل، ليتبين الصادق من الكاذب، فيجزي الصادقين بصدقهم { وَيُعَذِّبَ ٱلْمُنَافِقِينَ } الذين تغيرت قلوبهم وأعمالهم عند حلول الفتن، ولم يفوا بما عاهدوا اللّه عليه. { إِن شَآءَ } تعذيبهم، بأن لم يشأ هدايتهم، بل علم أنهم لا خير فيهم فلم يوفقهم. { أَوْ يَتُوبَ عَلَيْهِمْ } بأن يوفقهم للتوبة والإنابة، وهذا هو الغالب على كرم الكريم، ولهذا ختم الآية باسمين دالين على المغفرة، والفضل والإحسان فقال: { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً } غفوراً لذنوب المسرفين على أنفسهم، ولو أكثروا من العصيان إذا أتوا بالمتاب. { رَّحِيماً } بهم، حيث وفقهم للتوبة، ثم قبلها منهم وستر عليهم ما اجترحوه. { وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيْظِهِمْ لَمْ يَنَالُواْ خَيْراً } أي: ردهم خائبين، لم يحصل لهم الأمر الذي كانوا حنقين عليه، مغتاظين قادرين [عليه] جازمين، بأن لهم الدائرة، قد غرتهم جموعهم، وأعجبوا بتحزبهم، وفرحوا بِعَدَدِهمْ وعُدَدِهِمْ. فأرسل اللّه عليهم ريحاً عظيمة، وهي ريح الصبا، فزعزعت مراكزهم، وقوَّضت خيامهم، وكفأت قدورهم وأزعجتهم، وضربهم اللّه بالرعب، فانصرفوا بغيظهم، وهذا من نصر اللّه لعباده المؤمنين. { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } بما صنع لهم من الأسباب العادية والقدرية، { وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً } لا يغالبه أحد إلا غُلِبَ، ولا يستنصره أحد إلا غَلَبَ، ولا يعجزه أمر أراده، ولا ينفع أهل القوة والعزة قوتهم وعزتهم، إن لم يعنهم بقوته وعزته. { وَأَنزَلَ ٱلَّذِينَ ظَاهَرُوهُم } أي عاونوهم { مِّنْ أَهْلِ ٱلْكِتَابِ } أي: اليهود { مِن صَيَاصِيهِمْ } أي: أنزلهم من حصونهم، نزولا مظفوراً بهم، مجعولين تحت حكم الإسلام. { وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعْبَ } فلم يقووا على القتال، بل استسلموا وخضعوا وذلوا. { فَرِيقاً تَقْتُلُونَ } وهم الرجال المقاتلون { وَتَأْسِرُونَ فَرِيقاً } مَنْ عداهم من النساء والصبيان. { وَأَوْرَثَكُمْ } أي: غنَّمكم { أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضاً لَّمْ تَطَئُوهَا } أي: أرضاً كانت من قبل، من شرفها وعزتها عند أهلها، لا تتمكنون من وطئها، فمكَّنكم اللّه وخذلهم، وغنمتم أموالهم، وقتلتموهم وأسرتموهم. { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيراً } لا يعجزه شيء، ومن قدرته قدَّر لكم ما قدر. وكانت هذه الطائفة من أهل الكتاب، هم بنو قريظة من اليهود، في قرية خارج المدينة غير بعيدة، وكان النبي صلى اللّه عليه وسلم [حين] هاجر إلى المدينة وادعهم وهادنهم، فلم يقاتلهم ولم يقاتلوه، وهم باقون على دينهم، لم يغير عليهم شيئاً.\n                                   فلما رأوا يوم الخندق، الأحزاب الذين تحزبوا على رسول اللّه وكثرتهم، وقلة المسلمين، وظنوا أنهم سيستأصلون الرسول والمؤمنين، وساعد على ذلك، [تدجيل] بعض رؤسائهم عليهم، فنقضوا العهد الذي بينهم وبين رسول اللّه صلى اللّه عليه وسلم ومالؤوا المشركين على قتاله. فلما خذل اللّه المشركين، تفرغ رسول اللّه صلى اللّه عليه وسلم لقتالهم، فحاصرهم في حصنهم، فنزلوا على حكم سعد بن معاذ رضي اللّه عنه، فحكم فيهم، أن تقتل مقاتلتهم، وتسبى ذراريهم، وتغنم أموالهم. فأتم اللّه لرسوله والمؤمنين، المنة، وأسبغ عليهم النعمة، وأَقَرَّ أعينهم بخذلان مَنْ انخذل من أعدائهم، وقتل مَنْ قتلوا، وأسر مَنْ أسروا، ولم يزل لطف اللّه بعباده المؤمنين مستمراً.\n\n                                    "
      },
      "originalText": "وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيۡظِهِمۡ لَمۡ يَنَالُواْ خَيۡرٗاۚ وَكَفَى ٱللَّهُ ٱلۡمُؤۡمِنِينَ ٱلۡقِتَالَۚ وَكَانَ ٱللَّهُ قَوِيًّا عَزِيزٗا ٥٢"
    },
    {
      "number": 3559,
      "text": "وَأَنْزَلَ الَّذِينَ ظَاهَرُوهُمْ مِنْ أَهْلِ الْكِتَابِ مِنْ صَيَاصِيهِمْ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ فَرِيقًا تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 26,
      "juz": 21,
      "manzil": 5,
      "page": 421,
      "ruku": 363,
      "hizbQuarter": 168,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا ٦٢\n                                    \n                                    \n                                    قد تقدم أن بني قريظة لما قدمت جنود الأحزاب، ونزلوا على المدينة، نقضوا ما كان بينهم وبين رسول الله صلى الله عليه وسلم من العهد، وكان ذلك بسفارة حيي بن أخطب النضري لعنه الله، دخل حصنهم، ولم يزل بسيدهم كعب بن أسد حتى نقض العهد، وقال له فيما قال ويحك قد جئتك بعز الدهر، أتيتك بقريش وأحابيشها، وغطفان وأتباعها، ولا يزالون ههنا حتى يستأصلوا محمداً وأصحابه، فقال له كعب بل والله أتيتني بذل الدهر، ويحك ياحيي إنك مشؤوم، فدعنا منك، فلم يزل يفتل في الذروة والغارب حتى أجابه، واشترط له حيي إن ذهب الأحزاب، ولم يكن من أمرهم شيء، أن يدخل معهم في الحصن، فيكون له أسوتهم، فلما نقضت قريظة، وبلغ ذلك رسول الله صلى الله عليه وسلم ساءه، وشق عليه وعلى المسلمين جداً، فلما أيده الله تعالى ونصره، وكبت الأعداء وردهم خائبين بأخسر صفقة، ورجع رسول الله صلى الله عليه وسلم إلى المدينة مؤيداً منصوراً، ووضع الناس السلاح، فبينما رسول الله صلى الله عليه وسلم يغتسل من وعثاء تلك المرابطة في بيت أم سلمة رضي الله عنها، إذ تبدى له جبريل عليه الصلاة والسلام معتجراً بعمامة من إستبرق على بغلة عليها قطيفة من ديباج، فقال أوضعت السلاح يارسول الله؟ قال صلى الله عليه وسلم \" نعم \" قال لكن الملائكة لم تضع أسلحتها، وهذا الآن رجوعي من طلب القوم، ثم قال إن الله تبارك وتعالى يأمرك أن تنهض إلى بني قريظة، وفي رواية فقال له عذيرك من مقاتل، أوضعتم السلاح؟ قال \" نعم \" قال لكنا لم نضع أسلحتنا بعد، انهض إلى هؤلاء، قال صلى الله عليه وسلم \" أين؟ \" قال بني قريظة فإن الله تعالى أمرني أن أزلزل عليهم، فنهض رسول الله صلى الله عليه وسلم من فوره، وأمر الناس بالمسير إلى بني قريظة، وكانت على أميال من المدينة، وذلك بعد صلاة الظهر، وقال صلى الله عليه وسلم \" لا يصلين أحد منكم العصر إلا في بني قريظة \" فسار الناس، فأدركتهم الصلاة في الطريق، فصلى بعضهم في الطريق، وقالوا لم يرد منا رسول الله صلى الله عليه وسلم إلا تعجيل المسير، وقال آخرون لا نصليها إلا في بني قريظة، فلم يعنف واحداً من الفريقين، وتبعهم رسول الله صلى الله عليه وسلم وقد استخلف على المدينة ابن أم مكتوم رضي الله عنه، وأعطى الراية لعلي بن أبي طالب رضي الله عنه، ثم نازلهم رسول الله صلى الله عليه وسلم وحاصرهم خمساً وعشرين ليلة، فلما طال عليه الحال، نزلوا على حكم سعد ين معاذ سيد الأوس رضي الله عنه لأنهم كانوا حلفاءهم في الجاهلية، واعتقدوا أنه يحسن إليهم في ذلك، كما فعل عبد الله ابن أبي ابن سلول في مواليه بني قينقاع، حين استطلقهم من رسول الله صلى الله عليه وسلم فظن هؤلاء أن سعداً سيفعل فيهم كما فعل ابن أبي في أولئك، ولم يعلموا أن سعداً رضي الله عنه كان قد أصابه سهم في أكحله أيام الخندق، فكواه رسول الله صلى الله عليه وسلم في أكحله، وأنزله في قبة المسجد ليعوده من قريب، وقال سعد رضي الله عنه فيما دعا به اللهم إن كنت أبقيت من حرب قريش شيئاً، فأبقني لها، وإن كنت وضعت الحرب بيننا وبينهم فافجرها، ولا تمتني حتى تقر عيني من بني قريظة، فاستجاب الله تعالى دعاءه، وقدر عليهم أن نزلوا على حكمه باختيارهم طلباً من تلقاء أنفسهم، فعند ذلك استدعاه رسول الله صلى الله عليه وسلم من المدينة ليحكم فيهم، فلما أقبل، وهو راكب على حمار قد وطَّؤوا له عليه، جعل الأوس يلوذون به ويقولون ياسعد إنهم مواليك، فأحسن فيهم، ويرققونه عليهم ويعطفونه، وهو ساكت لا يرد عليهم، فلما أكثروا عليه قال رضي الله عنه لقد آن لسعد أن لا تأخذه في الله لومة لائم.\n                                    فعرفوا أنه غير مستبقيهم، فلما دنا من الخيمة التي فيها رسول الله صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم \" قوموا إلى سيدكم \" فقام إليه المسلمون، فأنزلوه إعظاماً وإكراماً واحتراماً له في محل ولايته ليكون أنفذ لحكمه فيهم، فلما جلس، قال له رسول الله صلى الله عليه وسلم \" إن هؤلاء ــــ وأشار إليهم ــــ قد نزلوا على حكمك، فاحكم فيهم بما شئت \" فقال رضي الله عنه وحكمي نافذ عليهم؟ قال صلى الله عليه وسلم \" نعم \" قال وعلى من في هذه الخيمة؟ قال \" نعم \" قال وعلى من ههنا؟ وأشار إلى الجانب الذي فيه رسول الله، وهو معرض بوجهه عن رسول الله صلى الله عليه وسلم إجلالاً وإكراماً وإعظاماً، فقال له رسول الله صلى الله عليه وسلم \" نعم \" فقال رضي الله عنه إني أحكم أن تقتل مقاتلتهم، وتسبى ذريتهم وأموالهم، فقال له رسول الله صلى الله عليه وسلم \" لقد حكمت بحكم الله تعالى من فوق سبع أرقعة \" ، وفي رواية \" لقد حكمت بحكم الملك \" ، ثم أمر رسول الله صلى الله عليه وسلم بالأخاديد فخدت في الأرض، وجيء بهم مكتفين، فضرب أعناقهم، وكانوا ما بين السبعمائة إلى الثمانمائة، وسبى من لم ينبت منهم مع النساء، وأموالهم، وهذا كله مقرر مفصل بأدلته وأحاديثه وبسطه في كتاب \" السيرة \" الذي أفردناه موجزاً وبسيطاً، ولله الحمد والمنة.\n                                    ولهذا قال تعالى { وَأَنزَلَ ٱلَّذِينَ ظَـٰهَرُوهُم } أي عاونوا الأحزاب، وساعدوهم على حرب رسول الله صلى الله عليه وسلم { مِنْ أَهْلِ ٱلْكِتَـٰبِ } يعني بني قريظة من اليهود من بعض أسباط بني إسرائيل، كان قد نزل آباؤهم الحجاز قديماً طمعاً في اتباع النبي الأمي الذين يجدونه مكتوباً عندهم في التوراة والإنجيل،\n{ فَلَمَّا جَآءَهُم مَّا عَرَفُواْ كَفَرُواْ بِهِ }\nالبقرة 89 فعليهم لعنة الله. وقوله تعالى { مِن صَيَاصِيهِمْ } يعني حصونهم، كذا قال مجاهد وعكرمة وعطاء وقتادة والسدي وغيرهم من السلف، ومنه سمي صياصي البقر، وهي قرونها لأنها أعلى شيء فيها، { وَقَذَفَ فِى قُلُوبِهِمُ ٱلرُّعْبَ } وهو الخوف، لأنهم كانوا مالؤوا المشركين على حرب النبي صلى الله عليه وسلم وليس من يعلم كمن لا يعلم، فأخافوا المسلمين، وراموا قتالهم ليعزوا في الدنيا، فانعكس عليهم الحال، وانقلبت إليهم القال، انشمر المشركون، ففازوا بصفقة المغبون، فكما راموا العز، ذلوا، وأرادوا استئصال المسلمين، فاستؤصلوا، وأضيف إلى ذلك شقاوة الآخرة، فصارت الجملة أن هذه هي الصفقة الخاسرة، ولهذا قال تعالى { فَرِيقاً تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقاً } فالذين قتلوا هم المقاتلة، والأسراء هم الأصاغر والنساء. وقال الإمام أحمد حدثنا هشيم بن بشير، أخبرنا عبد الملك بن عمير عن عطية القرظي قال عرضت على النبي صلى الله عليه وسلم يوم قريظة، فشكوا في، فأمر بي النبي صلى الله عليه وسلم أن ينظروا هل أنبت بعد؟ فنظروني، فلم يجدوني أنبت، فخلي عني، وألحقني بالسبي، وكذا رواه أهل السنن كلهم من طرق عن عبد الملك بن عمير به. وقال الترمذي حسن صحيح، ورواه النسائي أيضاً من حديث ابن جريج عن ابن أبي نجيح عن مجاهد عن عطية بنحوه. وقوله تعالى { وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَـٰرَهُمْ وَأَمْوَٰلَهُمْ } أي جعلها لكم من قتلكم لهم، { وَأَرْضاً لَّمْ تَطَئُوهَا } قيل خيبر، وقيل مكة، رواه مالك عن زيد بن أسلم، وقيل فارس والروم، وقال ابن جرير يجوز أن يكون الجميع مراداً، { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيراً }. قال الإمام أحمد حدثنا يزيد، أخبرنا محمد بن عمرو عن أبيه عن جده علقمة بن وقاص قال أخبرتني عائشة رضي الله عنها قالت خرجت يوم الخندق أقفو الناس، فسمعت وئيد الأرض ورائي، فإذا أنا بسعد بن معاذ رضي الله عنه، ومعه ابن أخيه الحارث بن أوس يحمل مجنة، قالت فجلست إلى الأرض، فمر سعد رضي الله عنه، وعليه درع من حديد قد خرجت منه أطرافه، فأنا أتخوف على أطراف سعد، قالت وكان سعد رضي الله عنه من أعظم الناس وأطولهم، فمر وهو يرتجز ويقول\nلَبِّثْ قَليلاً يَشْهَدِ الهَيْجا حَمَلْ ما أَحْسَنَ المَوْتَ إذا حانَ الأَجَلْ\t   \t\nقالت فقمت فاقتحمت حديقة، فإذا فيها نفر من المسلمين، وإذا فيها عمر بن الخطاب رضي الله عنه، وفيهم رجل عليه تسبغة له، تعني المغفر، فقال عمر رضي الله عنه ما جاء بك؟ لعمري والله إنك لجريئة، وما يؤمنك أن يكون بلاء أو يكون تحوز؟ قالت فما زال يلومني حتى تمنيت أن الأرض انشقت بي ساعتئذ، فدخلت فيها، فرفع الرجل التسبغة عن وجهه، فإذا هو طلحة بن عبيد الله رضي الله عنه، فقال ياعمر ويحك إنك قد أكثرت منذ اليوم، وأين التحوز أو الفرار إلا إلى الله تعالى؟ قالت ورمى سعداً رضي الله عنه رجل من قريش يقال له ابن العرقة بسهم له، وقال له خذها وأنا ابن العرقة، فأصاب أكحله، فقطعه، فدعا الله تعالى سعد رضي الله عنه فقال اللهم لا تمتني حتى تقر عيني من بني قريظة، قالت وكانوا حلفاءه ومواليه في الجاهلية، قالت فرقأ كَلْمه، وبعث الله تعالى الريح على المشركين { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً } ، فلحق أبو سفيان ومن معه بتهامة، ولحق عيينة بن بدر ومن معه بنجد، ورجعت بنو قريظة فتحصنوا في صياصيهم، ورجع رسول الله صلى الله عليه وسلم إلى المدينة، وأمر بقبة من أدم فضربت على سعد رضي الله عنه في المسجد، قالت فجاءه جبريل عليه السلام، وإن على ثناياه لنقع الغبار، فقال أوقد وضعت السلاح؟ لا والله ما وضعت الملائكة بعد السلاح، اخرج إلى بني قريظة فقاتلهم، قالت فلبس رسول الله صلى الله عليه وسلم لأمته، وأذن في الناس بالرحيل أن يخرجوا، فمر على بني تميم، وهم جيران المسجد، فقال\n                                    \" من مر بكم؟ \" قالوا مر بنا دحية الكلبي، وكان دحية الكلبي يشبه لحيته وسنه ووجهه جبريل عليه الصلاة والسلام، فأتاهم رسول الله صلى الله عليه وسلم فحاصرهم خمساً وعشرين ليلة، فلما اشتد حصارهم، واشتد البلاء، قيل لهم انزلوا على حكم رسول الله صلى الله عليه وسلم فاستشاروا أبا لبابة بن عبد المنذر، فأشار إليهم إنه الذبح، قالوا ننزل على حكم سعد بن معاذ رضي الله عنه، فقال رسول الله صلى الله عليه وسلم \" انزلوا على حكم سعد بن معاذ \" فنزلوا، وبعث رسول الله صلى الله عليه وسلم إلى سعد بن معاذ رضي الله عنه، فأتى به على حمار عليه إكاف من ليف قد حمل عليه، وحف به قومه، فقالوا ياأبا عمرو حلفاؤك ومواليك، وأهل النكاية، ومن قد علمت، قالت فلا يرجع إليهم شيئاً، ولا يلتفت إليهم، حتى إذا دنا من دورهم، التفت إلى قومه فقال قد آن لي أن لا أبالي في الله لومة لائم. قال قال أبو سعيد فلما طلع، قال رسول الله صلى الله عليه وسلم \" قوموا إلى سيدكم فأنزلوه \"\n                                    فقال عمر رضي الله عنه سيدنا الله، قال \" أنزلوه \" فأنزلوه، قال رسول الله صلى الله عليه وسلم \" احكم فيهم \" قال سعد رضي الله عنه فإني أحكم فيهم أن تقتل مقاتلتهم، وتسبى ذراريهم، وتقسم أموالهم، فقال رسول الله صلى الله عليه وسلم \" لقد حكمت فيهم بحكم الله وحكم رسوله \" ثم دعا سعد رضي الله عنه، فقال اللهم إن كنت أبقيت على نبيك من حرب قريش شيئاً، فأبقني لها، وإن كنت قطعت الحرب بينه وبينهم، فاقبضني إليك. قال فانفجر كلمه، وكان قد برىء منه إلا مثل الخرص، ورجع إلى قبته التي ضرب عليه رسول الله، قالت عائشة رضي الله عنها فحضره رسول الله صلى الله عليه وسلم وأبو بكر وعمر رضي الله عنهما، قالت فوالذي نفس محمد بيده إني لأعرف بكاء أبي بكر رضي الله عنه، من بكاء عمر رضي الله عنه وأنا في حجرتي، وكانوا كما قال الله تعالى\n{ رُحَمَآءُ بَيْنَهُمْ }\nالفتح 29 قال علقمة فقلت أي أمه فكيف كان رسول الله صلى الله عليه وسلم يصنع؟ قالت كانت عينه لاتدمع على أحد، ولكنه كان إذا وجد، فإنما هو آخذ بلحيته صلى الله عليه وسلم وقد أخرج البخاري ومسلم من حديث عبد الله بن نمير عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها نحواً من هذا، ولكنه أخصر منه، وفيه دعا سعد رضي الله عنه.\n\n                                    ",
        "qortoby": "وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا ٦٢\n                                    \n                                    \n                                    قوله تعالى: { وَأَنزَلَ ٱلَّذِينَ ظَاهَرُوهُم مِّنْ أَهْلِ ٱلْكِتَابِ } يعني الذين عاونوا الأحزاب: قريشاً وغَطَفان؛ وهم بنو قُريظة. وقد مضى خبرهم. { مِن صَيَاصِيهِمْ } أي حصونهم؛ واحدها صِيصَة. قال الشاعر :\nفأصبحت الثِّيران صَرْعَى وأصبحتْ\t   \tنساء تميم يبتدِرْن الصياصِيا\nومنه قيل لشوكة الحائك التي بها يُسوّى السَّداة واللُّحْمة: صِيصة. قال دريدُ بن الصِّمَّة :\nفجئتُ إليه والرماحُ تَنُوشُه\t   \tكوقع الصَّياصِي في النسيج الممدّد\nومنه: صيصَة الديك التي في رجله. وصَياصِي البقر قرونها؛ لأنها تمتنع بها. وربما كانت تركّب في الرماح مكان الأسنة؛ ويقال: جَذّ اللَّهُ صِئْصِئه؛ أي أصله. { وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعْبَ فَرِيقاً تَقْتُلُونَ } وهم الرجال. { وَتَأْسِرُونَ فَرِيقاً } وهم النساء والذّرّية؛ على ما تقدّم. { وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضاً لَّمْ تَطَئُوهَا } بعدُ. قال يزيد بن رُومان وابن زيد ومقاتل: يعني حُنَين؛ ولم يكونوا نالوها، فوعدهم الله إياها. وقال قتادة: كنا نتحدّث أنها مكة. وقال الحسن: هي فارس والرّوم. وقال عِكرمة: كل أرض تفتح إلى يوم القيامة. { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيراً } فيه وجهان: أحدهما: على ما أراد بعباده من نقمة أو عفوٍ قديرٌ؛ قاله محمد بن إسحاق. الثاني: على ما أراد أن يفتحه من الحصون والقُرَى قدير؛ قاله النقاش. وقيل: { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ } مما وَعَدَكُمُوه { قَدِيراً } لا تردّ قدرته ولا يجوز عليه العجز تعالى. ويقال: تأسِرون وتأسُرون (بكسر السين وضمها) حكاه الفراء.\n                                    ",
        "saadi": "وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا ٦٢\n                                        \n                                        \n                                        \n                                        { قُل } لهم، لائماً على فرارهم، ومخبراً أنهم لا يفيدهم ذلك شيئاً { لَّن يَنفَعَكُمُ ٱلْفِرَارُ إِن فَرَرْتُمْ مِّنَ ٱلْمَوْتِ أَوِ ٱلْقَتْلِ } فلو كنتم في بيوتكم، لبرز الذين كتب عليهم القتل إلى مضاجعهم. والأسباب تنفع، إذا لم يعارضها القضاء والقدر، فإذا جاء القضاء والقدر، تلاشى كل سبب، وبطلت كل وسيلة ظنها الإنسان تنجيه. { وَإِذاً } حين فررتم لتسلموا من الموت والقتل، ولتنعموا في الدنيا فإنكم { لاَّ تُمَتَّعُونَ إِلاَّ قَلِيلاً } متاعاً لا يسوى فراركم، وترككم أمر اللّه، وتفويتكم على أنفسكم التمتع الأبدي، في النعيم السرمدي. ثم بيَّن أن الأسباب كلها لا تغني عن العبد شيئاً إذا أراده اللّه بسوء، فقال: { قُلْ مَن ذَا ٱلَّذِي يَعْصِمُكُمْ } أي: يمنعكم { مِّنَ ٱللَّهِ إِنْ أَرَادَ بِكُمْ سُوۤءاً } أي: شراً، { أَوْ أَرَادَ بِكُمْ رَحْمَةً } فإنه هو المعطي المانع، الضار النافع، الذي لا يأتي بالخير إلا هو، ولا يدفع السوء إلاّ هو. { وَلاَ يَجِدُونَ لَهُمْ مِّن دُونِ ٱللَّهِ وَلِيّاً } يتولاهم، فيجلب لهم النفع { وَلاَ نَصِيراً } أي: ينصرهم، فيدفع عنهم المضار. فَلْيَمْتَثِلُوا طاعة المنفرد بالأمور كلها، الذي نفذت مشيئته، ومضى قدره، ولم ينفع مع ترك ولايته ونصرته، وَلِيٌّ ولا ناصر. ثم توَّعد تعالى المخذلين المعوقين، وتهددهم فقال: { قَدْ يَعْلَمُ ٱللَّهُ ٱلْمُعَوِّقِينَ مِنكُمْ } عن الخروج لمن [لم] يخرجوا { وَٱلْقَآئِلِينَ لإِخْوَانِهِمْ } الذين خرجوا: { هَلُمَّ إِلَيْنَا } أي: ارجعوا، كما تقدم من قولهم :\n{ يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ فَٱرْجِعُواْ }\n[الأحزاب: 13]. وهم مع تعويقهم وتخذيلهم { وَلاَ يَأْتُونَ ٱلْبَأْسَ } القتال والجهاد بأنفسهم { إِلاَّ قَلِيلاً } فهم أشد الناس حرصاً على التخلف، لعدم الداعي لذلك من الإيمان والصبر، ووجود المقتضى للجبن، من النفاق وعدم الإيمان. { أَشِحَّةً عَلَيْكُمْ } بأبدانهم عند القتال، وبأموالهم عند النفقة فيه، فلا يجاهدون بأموالهم وأنفسهم. { فَإِذَا جَآءَ ٱلْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ } نظر المغشى عليه { مِنَ ٱلْمَوْتِ } من شدة الجبن، الذي خلع قلوبهم، والقلق الذي أذهلهم، وخوفاً من إجبارهم على ما يكرهون من القتال. { فَإِذَا ذَهَبَ ٱلْخَوْفُ } وصاروا في حال الأمن والطمأنينة، { سَلَقُوكُمْ بِأَلْسِنَةٍ } أي: خاطبوكم وتكلموا معكم، بكلام حديد، ودعاوى غير صحيحة. وحين تسمعهم، تظنهم أهل الشجاعة والإقدام، { أَشِحَّةً عَلَى ٱلْخَيْرِ } الذي يراد منهم، وهذا شر ما في الإنسان، أن يكون شحيحاً بما أمر به، شحيحاً بماله أن ينفقه في وجهه، شحيحاً في بدنه أن يجاهد أعداء اللّه، أو يدعو إلى سبيل اللّه، شحيحاً بجاهه، شحيحاً بعلمه ونصيحته ورأيه. { أوْلَـٰئِكَ } الذين بتلك الحالة { لَمْ يُؤْمِنُواْ } بسبب عدم إيمانهم أحبط الله أعمالهم، { وَكَانَ ذَلِكَ عَلَى ٱللَّهِ يَسِيراً }. وأما المؤمنون، فقد وقاهم اللّه شح أنفسهم، ووفقهم لبذل ما أمروا به، من بذلٍ لأبدانهم في القتال في سبيله، وإعلاء كلمته، وأموالهم للنفقة في طرق الخير، وجاههم وعلمهم.\n                                   \n                                   { يَحْسَبُونَ ٱلأَحْزَابَ لَمْ يَذْهَبُواْ } أي: يظنون أن هؤلاء الأحزاب، الذين تحزبوا على حرب رسول اللّه صلى اللّه عليه وسلم وأصحابه لم يذهبوا حتى يستأصلوهم، فخاب ظنهم، وبطل حسبانهم. { وَإِن يَأْتِ ٱلأَحْزَابُ } مرة أخرى { يَوَدُّواْ لَوْ أَنَّهُمْ بَادُونَ فِي ٱلأَعْرَابِ يَسْأَلُونَ عَنْ أَنبَآئِكُمْ } أي: لو أتى الأحزاب مرة ثانية مثل هذه المرة، ودَّ هؤلاء المنافقون، أنهم ليسوا في المدينة ولا في القرب منها، وأنهم مع الأعراب في البادية، يستخبرون عن أخباركم، ويسألون عن أنبائكم، ماذا حصل عليكم؟ فتباً لهم، وبعداً فليسوا ممن يبالى بحضورهم { وَلَوْ كَانُواْ فِيكُمْ مَّا قَاتَلُوۤاْ إِلاَّ قَلِيلاً } فلا تبالوهم، ولا تأسوا عليهم. { لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ ٱللَّهِ أُسْوَةٌ حَسَنَةٌ } حيث حضر الهيجاء بنفسه الكريمة، وباشر موقف الحرب، وهو الشريف الكامل، والبطل الباسل، فكيف تشحون بأنفسكم عن أمر جاد رسول اللّه صلى اللّه عليه وسلم بنفسه فيه؟!! فَتأَسُّوْا به في هذا الأمر وغيره. واستدل الأصوليون في هذه الآية، على الاحتجاج بأفعال الرسول صلى اللّه عليه وسلم، وأن الأصل، أن أمته أسوته في الأحكام، إلاّ ما دلَّ الدليل الشرعي على الاختصاص به. فالأسوة نوعان: أسوة حسنة، وأسوة سيئة. فالأسوة الحسنة في الرسول صلى اللّه عليه وسلم، فإن المتأسِّي به، سالك الطريق الموصل إلى كرامة اللّه، وهو الصراط المستقيم. وأما الأسوة بغيره إذا خالفه، فهو الأسوة السيئة، كقول الكفار حين دعتهم الرسل للتأسِّي [بهم]: { بَلْ قَالُوۤاْ إِنَّا وَجَدْنَآ ءَابَآءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ ءَاثَارِهِم مُّهْتَدُونَ }. وهذه الأسوة الحسنة، إنما يسلكها ويوفق لها، من كان يرجو اللّه واليوم الآخر، فإن ما معه من الإيمان، وخوف اللّه، ورجاء ثوابه، وخوف عقابه، يحثه على التأسي بالرسول صلى اللّه عليه وسلم. لما ذكر حالة المنافقين عند الخوف، ذكر حال المؤمنين، فقال: { وَلَمَّا رَأَى ٱلْمُؤْمِنُونَ ٱلأَحْزَابَ } الذين تحزبوا، ونزلوا منازلهم، وانتهى الخوف، { قَالُواْ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ } في قوله :\n{ أَمْ حَسِبْتُمْ أَن تَدْخُلُواْ ٱلْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ ٱلَّذِينَ خَلَوْاْ مِن قَبْلِكُم مَّسَّتْهُمُ ٱلْبَأْسَآءُ وَٱلضَّرَّآءُ وَزُلْزِلُواْ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ آمَنُواْ مَعَهُ مَتَىٰ نَصْرُ ٱللَّهِ أَلاۤ إِنَّ نَصْرَ ٱللَّهِ قَرِيبٌ }\n[البقرة: 214]. { وَصَدَقَ ٱللَّهُ وَرَسُولُهُ } فإنا رأينا، ما أخبرنا به { وَمَا زَادَهُمْ } ذلك الأمر { إِلاَّ إِيمَاناً } في قلوبهم { وَتَسْلِيماً } في جوارحهم، وانقياداً لأمر اللّه. ولما ذكر أن المنافقين عاهدوا اللّه، لا يولون الأدبار، ونقضوا ذلك العهد، ذكر وفاء المؤمنين به، فقال: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ } أي: وفوا به، وأتموه، وأكملوه، فبذلوا مهجهم في مرضاته، وسبَّلوا أنفسهم في طاعته. { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } أي: إرادته ومطلوبه وما عليه من الحق، فقُتل في سبيل اللّه، أو مات مؤدياً لحقه لم ينقصه شيئاً. { وَمِنْهُمْ مَّن يَنتَظِرُ } تكميل ما عليه، فهو شارع في قضاء ما عليه، ووفاء نحبه ولما يكمله، وهو في رجاء تكميله، ساع في ذلك مجد.\n                                   \n{ وَمَا بَدَّلُواْ تَبْدِيلاً } كما بدَّل غيرهم، بل لم يزالوا على العهد، لا يلوون ولا يتغيرون، فهؤلاء الرجال على الحقيقة، ومن عداهم فصورهم صور رجال، وأما الصفات فقد قصرت عن صفات الرجال. { لِّيَجْزِيَ ٱللَّهُ ٱلصَّادِقِينَ بِصِدْقِهِمْ } أي: بسبب صدقهم، في أقوالهم وأحوالهم، ومعاملتهم مع اللّه، واستواء ظاهرهم وباطنهم، قال اللّه تعالى :\n{ هَـٰذَا يَوْمُ يَنفَعُ ٱلصَّادِقِينَ صِدْقُهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ خَالِدِينَ فِيهَآ أَبَداً }\nالآية [المائدة: 119]. أي: قدرنا ما قدرنا من هذه الفتن والمحن والزلازل، ليتبين الصادق من الكاذب، فيجزي الصادقين بصدقهم { وَيُعَذِّبَ ٱلْمُنَافِقِينَ } الذين تغيرت قلوبهم وأعمالهم عند حلول الفتن، ولم يفوا بما عاهدوا اللّه عليه. { إِن شَآءَ } تعذيبهم، بأن لم يشأ هدايتهم، بل علم أنهم لا خير فيهم فلم يوفقهم. { أَوْ يَتُوبَ عَلَيْهِمْ } بأن يوفقهم للتوبة والإنابة، وهذا هو الغالب على كرم الكريم، ولهذا ختم الآية باسمين دالين على المغفرة، والفضل والإحسان فقال: { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً } غفوراً لذنوب المسرفين على أنفسهم، ولو أكثروا من العصيان إذا أتوا بالمتاب. { رَّحِيماً } بهم، حيث وفقهم للتوبة، ثم قبلها منهم وستر عليهم ما اجترحوه. { وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيْظِهِمْ لَمْ يَنَالُواْ خَيْراً } أي: ردهم خائبين، لم يحصل لهم الأمر الذي كانوا حنقين عليه، مغتاظين قادرين [عليه] جازمين، بأن لهم الدائرة، قد غرتهم جموعهم، وأعجبوا بتحزبهم، وفرحوا بِعَدَدِهمْ وعُدَدِهِمْ. فأرسل اللّه عليهم ريحاً عظيمة، وهي ريح الصبا، فزعزعت مراكزهم، وقوَّضت خيامهم، وكفأت قدورهم وأزعجتهم، وضربهم اللّه بالرعب، فانصرفوا بغيظهم، وهذا من نصر اللّه لعباده المؤمنين. { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } بما صنع لهم من الأسباب العادية والقدرية، { وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً } لا يغالبه أحد إلا غُلِبَ، ولا يستنصره أحد إلا غَلَبَ، ولا يعجزه أمر أراده، ولا ينفع أهل القوة والعزة قوتهم وعزتهم، إن لم يعنهم بقوته وعزته. { وَأَنزَلَ ٱلَّذِينَ ظَاهَرُوهُم } أي عاونوهم { مِّنْ أَهْلِ ٱلْكِتَابِ } أي: اليهود { مِن صَيَاصِيهِمْ } أي: أنزلهم من حصونهم، نزولا مظفوراً بهم، مجعولين تحت حكم الإسلام. { وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعْبَ } فلم يقووا على القتال، بل استسلموا وخضعوا وذلوا. { فَرِيقاً تَقْتُلُونَ } وهم الرجال المقاتلون { وَتَأْسِرُونَ فَرِيقاً } مَنْ عداهم من النساء والصبيان. { وَأَوْرَثَكُمْ } أي: غنَّمكم { أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضاً لَّمْ تَطَئُوهَا } أي: أرضاً كانت من قبل، من شرفها وعزتها عند أهلها، لا تتمكنون من وطئها، فمكَّنكم اللّه وخذلهم، وغنمتم أموالهم، وقتلتموهم وأسرتموهم. { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيراً } لا يعجزه شيء، ومن قدرته قدَّر لكم ما قدر. وكانت هذه الطائفة من أهل الكتاب، هم بنو قريظة من اليهود، في قرية خارج المدينة غير بعيدة، وكان النبي صلى اللّه عليه وسلم [حين] هاجر إلى المدينة وادعهم وهادنهم، فلم يقاتلهم ولم يقاتلوه، وهم باقون على دينهم، لم يغير عليهم شيئاً.\n                                   فلما رأوا يوم الخندق، الأحزاب الذين تحزبوا على رسول اللّه وكثرتهم، وقلة المسلمين، وظنوا أنهم سيستأصلون الرسول والمؤمنين، وساعد على ذلك، [تدجيل] بعض رؤسائهم عليهم، فنقضوا العهد الذي بينهم وبين رسول اللّه صلى اللّه عليه وسلم ومالؤوا المشركين على قتاله. فلما خذل اللّه المشركين، تفرغ رسول اللّه صلى اللّه عليه وسلم لقتالهم، فحاصرهم في حصنهم، فنزلوا على حكم سعد بن معاذ رضي اللّه عنه، فحكم فيهم، أن تقتل مقاتلتهم، وتسبى ذراريهم، وتغنم أموالهم. فأتم اللّه لرسوله والمؤمنين، المنة، وأسبغ عليهم النعمة، وأَقَرَّ أعينهم بخذلان مَنْ انخذل من أعدائهم، وقتل مَنْ قتلوا، وأسر مَنْ أسروا، ولم يزل لطف اللّه بعباده المؤمنين مستمراً.\n\n                                    "
      },
      "originalText": "وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا ٦٢"
    },
    {
      "number": 3560,
      "text": "وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضًا لَمْ تَطَئُوهَا ۚ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 27,
      "juz": 21,
      "manzil": 5,
      "page": 421,
      "ruku": 363,
      "hizbQuarter": 168,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَوۡرَثَكُمۡ أَرۡضَهُمۡ وَدِيَٰرَهُمۡ وَأَمۡوَٰلَهُمۡ وَأَرۡضٗا لَّمۡ تَطَ‍ُٔوهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ٧٢\n                                    \n                                    \n                                    قد تقدم أن بني قريظة لما قدمت جنود الأحزاب، ونزلوا على المدينة، نقضوا ما كان بينهم وبين رسول الله صلى الله عليه وسلم من العهد، وكان ذلك بسفارة حيي بن أخطب النضري لعنه الله، دخل حصنهم، ولم يزل بسيدهم كعب بن أسد حتى نقض العهد، وقال له فيما قال ويحك قد جئتك بعز الدهر، أتيتك بقريش وأحابيشها، وغطفان وأتباعها، ولا يزالون ههنا حتى يستأصلوا محمداً وأصحابه، فقال له كعب بل والله أتيتني بذل الدهر، ويحك ياحيي إنك مشؤوم، فدعنا منك، فلم يزل يفتل في الذروة والغارب حتى أجابه، واشترط له حيي إن ذهب الأحزاب، ولم يكن من أمرهم شيء، أن يدخل معهم في الحصن، فيكون له أسوتهم، فلما نقضت قريظة، وبلغ ذلك رسول الله صلى الله عليه وسلم ساءه، وشق عليه وعلى المسلمين جداً، فلما أيده الله تعالى ونصره، وكبت الأعداء وردهم خائبين بأخسر صفقة، ورجع رسول الله صلى الله عليه وسلم إلى المدينة مؤيداً منصوراً، ووضع الناس السلاح، فبينما رسول الله صلى الله عليه وسلم يغتسل من وعثاء تلك المرابطة في بيت أم سلمة رضي الله عنها، إذ تبدى له جبريل عليه الصلاة والسلام معتجراً بعمامة من إستبرق على بغلة عليها قطيفة من ديباج، فقال أوضعت السلاح يارسول الله؟ قال صلى الله عليه وسلم \" نعم \" قال لكن الملائكة لم تضع أسلحتها، وهذا الآن رجوعي من طلب القوم، ثم قال إن الله تبارك وتعالى يأمرك أن تنهض إلى بني قريظة، وفي رواية فقال له عذيرك من مقاتل، أوضعتم السلاح؟ قال \" نعم \" قال لكنا لم نضع أسلحتنا بعد، انهض إلى هؤلاء، قال صلى الله عليه وسلم \" أين؟ \" قال بني قريظة فإن الله تعالى أمرني أن أزلزل عليهم، فنهض رسول الله صلى الله عليه وسلم من فوره، وأمر الناس بالمسير إلى بني قريظة، وكانت على أميال من المدينة، وذلك بعد صلاة الظهر، وقال صلى الله عليه وسلم \" لا يصلين أحد منكم العصر إلا في بني قريظة \" فسار الناس، فأدركتهم الصلاة في الطريق، فصلى بعضهم في الطريق، وقالوا لم يرد منا رسول الله صلى الله عليه وسلم إلا تعجيل المسير، وقال آخرون لا نصليها إلا في بني قريظة، فلم يعنف واحداً من الفريقين، وتبعهم رسول الله صلى الله عليه وسلم وقد استخلف على المدينة ابن أم مكتوم رضي الله عنه، وأعطى الراية لعلي بن أبي طالب رضي الله عنه، ثم نازلهم رسول الله صلى الله عليه وسلم وحاصرهم خمساً وعشرين ليلة، فلما طال عليه الحال، نزلوا على حكم سعد ين معاذ سيد الأوس رضي الله عنه لأنهم كانوا حلفاءهم في الجاهلية، واعتقدوا أنه يحسن إليهم في ذلك، كما فعل عبد الله ابن أبي ابن سلول في مواليه بني قينقاع، حين استطلقهم من رسول الله صلى الله عليه وسلم فظن هؤلاء أن سعداً سيفعل فيهم كما فعل ابن أبي في أولئك، ولم يعلموا أن سعداً رضي الله عنه كان قد أصابه سهم في أكحله أيام الخندق، فكواه رسول الله صلى الله عليه وسلم في أكحله، وأنزله في قبة المسجد ليعوده من قريب، وقال سعد رضي الله عنه فيما دعا به اللهم إن كنت أبقيت من حرب قريش شيئاً، فأبقني لها، وإن كنت وضعت الحرب بيننا وبينهم فافجرها، ولا تمتني حتى تقر عيني من بني قريظة، فاستجاب الله تعالى دعاءه، وقدر عليهم أن نزلوا على حكمه باختيارهم طلباً من تلقاء أنفسهم، فعند ذلك استدعاه رسول الله صلى الله عليه وسلم من المدينة ليحكم فيهم، فلما أقبل، وهو راكب على حمار قد وطَّؤوا له عليه، جعل الأوس يلوذون به ويقولون ياسعد إنهم مواليك، فأحسن فيهم، ويرققونه عليهم ويعطفونه، وهو ساكت لا يرد عليهم، فلما أكثروا عليه قال رضي الله عنه لقد آن لسعد أن لا تأخذه في الله لومة لائم.\n                                    فعرفوا أنه غير مستبقيهم، فلما دنا من الخيمة التي فيها رسول الله صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم \" قوموا إلى سيدكم \" فقام إليه المسلمون، فأنزلوه إعظاماً وإكراماً واحتراماً له في محل ولايته ليكون أنفذ لحكمه فيهم، فلما جلس، قال له رسول الله صلى الله عليه وسلم \" إن هؤلاء ــــ وأشار إليهم ــــ قد نزلوا على حكمك، فاحكم فيهم بما شئت \" فقال رضي الله عنه وحكمي نافذ عليهم؟ قال صلى الله عليه وسلم \" نعم \" قال وعلى من في هذه الخيمة؟ قال \" نعم \" قال وعلى من ههنا؟ وأشار إلى الجانب الذي فيه رسول الله، وهو معرض بوجهه عن رسول الله صلى الله عليه وسلم إجلالاً وإكراماً وإعظاماً، فقال له رسول الله صلى الله عليه وسلم \" نعم \" فقال رضي الله عنه إني أحكم أن تقتل مقاتلتهم، وتسبى ذريتهم وأموالهم، فقال له رسول الله صلى الله عليه وسلم \" لقد حكمت بحكم الله تعالى من فوق سبع أرقعة \" ، وفي رواية \" لقد حكمت بحكم الملك \" ، ثم أمر رسول الله صلى الله عليه وسلم بالأخاديد فخدت في الأرض، وجيء بهم مكتفين، فضرب أعناقهم، وكانوا ما بين السبعمائة إلى الثمانمائة، وسبى من لم ينبت منهم مع النساء، وأموالهم، وهذا كله مقرر مفصل بأدلته وأحاديثه وبسطه في كتاب \" السيرة \" الذي أفردناه موجزاً وبسيطاً، ولله الحمد والمنة.\n                                    ولهذا قال تعالى { وَأَنزَلَ ٱلَّذِينَ ظَـٰهَرُوهُم } أي عاونوا الأحزاب، وساعدوهم على حرب رسول الله صلى الله عليه وسلم { مِنْ أَهْلِ ٱلْكِتَـٰبِ } يعني بني قريظة من اليهود من بعض أسباط بني إسرائيل، كان قد نزل آباؤهم الحجاز قديماً طمعاً في اتباع النبي الأمي الذين يجدونه مكتوباً عندهم في التوراة والإنجيل،\n{ فَلَمَّا جَآءَهُم مَّا عَرَفُواْ كَفَرُواْ بِهِ }\nالبقرة 89 فعليهم لعنة الله. وقوله تعالى { مِن صَيَاصِيهِمْ } يعني حصونهم، كذا قال مجاهد وعكرمة وعطاء وقتادة والسدي وغيرهم من السلف، ومنه سمي صياصي البقر، وهي قرونها لأنها أعلى شيء فيها، { وَقَذَفَ فِى قُلُوبِهِمُ ٱلرُّعْبَ } وهو الخوف، لأنهم كانوا مالؤوا المشركين على حرب النبي صلى الله عليه وسلم وليس من يعلم كمن لا يعلم، فأخافوا المسلمين، وراموا قتالهم ليعزوا في الدنيا، فانعكس عليهم الحال، وانقلبت إليهم القال، انشمر المشركون، ففازوا بصفقة المغبون، فكما راموا العز، ذلوا، وأرادوا استئصال المسلمين، فاستؤصلوا، وأضيف إلى ذلك شقاوة الآخرة، فصارت الجملة أن هذه هي الصفقة الخاسرة، ولهذا قال تعالى { فَرِيقاً تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقاً } فالذين قتلوا هم المقاتلة، والأسراء هم الأصاغر والنساء. وقال الإمام أحمد حدثنا هشيم بن بشير، أخبرنا عبد الملك بن عمير عن عطية القرظي قال عرضت على النبي صلى الله عليه وسلم يوم قريظة، فشكوا في، فأمر بي النبي صلى الله عليه وسلم أن ينظروا هل أنبت بعد؟ فنظروني، فلم يجدوني أنبت، فخلي عني، وألحقني بالسبي، وكذا رواه أهل السنن كلهم من طرق عن عبد الملك بن عمير به. وقال الترمذي حسن صحيح، ورواه النسائي أيضاً من حديث ابن جريج عن ابن أبي نجيح عن مجاهد عن عطية بنحوه. وقوله تعالى { وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَـٰرَهُمْ وَأَمْوَٰلَهُمْ } أي جعلها لكم من قتلكم لهم، { وَأَرْضاً لَّمْ تَطَئُوهَا } قيل خيبر، وقيل مكة، رواه مالك عن زيد بن أسلم، وقيل فارس والروم، وقال ابن جرير يجوز أن يكون الجميع مراداً، { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيراً }. قال الإمام أحمد حدثنا يزيد، أخبرنا محمد بن عمرو عن أبيه عن جده علقمة بن وقاص قال أخبرتني عائشة رضي الله عنها قالت خرجت يوم الخندق أقفو الناس، فسمعت وئيد الأرض ورائي، فإذا أنا بسعد بن معاذ رضي الله عنه، ومعه ابن أخيه الحارث بن أوس يحمل مجنة، قالت فجلست إلى الأرض، فمر سعد رضي الله عنه، وعليه درع من حديد قد خرجت منه أطرافه، فأنا أتخوف على أطراف سعد، قالت وكان سعد رضي الله عنه من أعظم الناس وأطولهم، فمر وهو يرتجز ويقول\nلَبِّثْ قَليلاً يَشْهَدِ الهَيْجا حَمَلْ ما أَحْسَنَ المَوْتَ إذا حانَ الأَجَلْ\t   \t\nقالت فقمت فاقتحمت حديقة، فإذا فيها نفر من المسلمين، وإذا فيها عمر بن الخطاب رضي الله عنه، وفيهم رجل عليه تسبغة له، تعني المغفر، فقال عمر رضي الله عنه ما جاء بك؟ لعمري والله إنك لجريئة، وما يؤمنك أن يكون بلاء أو يكون تحوز؟ قالت فما زال يلومني حتى تمنيت أن الأرض انشقت بي ساعتئذ، فدخلت فيها، فرفع الرجل التسبغة عن وجهه، فإذا هو طلحة بن عبيد الله رضي الله عنه، فقال ياعمر ويحك إنك قد أكثرت منذ اليوم، وأين التحوز أو الفرار إلا إلى الله تعالى؟ قالت ورمى سعداً رضي الله عنه رجل من قريش يقال له ابن العرقة بسهم له، وقال له خذها وأنا ابن العرقة، فأصاب أكحله، فقطعه، فدعا الله تعالى سعد رضي الله عنه فقال اللهم لا تمتني حتى تقر عيني من بني قريظة، قالت وكانوا حلفاءه ومواليه في الجاهلية، قالت فرقأ كَلْمه، وبعث الله تعالى الريح على المشركين { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً } ، فلحق أبو سفيان ومن معه بتهامة، ولحق عيينة بن بدر ومن معه بنجد، ورجعت بنو قريظة فتحصنوا في صياصيهم، ورجع رسول الله صلى الله عليه وسلم إلى المدينة، وأمر بقبة من أدم فضربت على سعد رضي الله عنه في المسجد، قالت فجاءه جبريل عليه السلام، وإن على ثناياه لنقع الغبار، فقال أوقد وضعت السلاح؟ لا والله ما وضعت الملائكة بعد السلاح، اخرج إلى بني قريظة فقاتلهم، قالت فلبس رسول الله صلى الله عليه وسلم لأمته، وأذن في الناس بالرحيل أن يخرجوا، فمر على بني تميم، وهم جيران المسجد، فقال\n                                    \" من مر بكم؟ \" قالوا مر بنا دحية الكلبي، وكان دحية الكلبي يشبه لحيته وسنه ووجهه جبريل عليه الصلاة والسلام، فأتاهم رسول الله صلى الله عليه وسلم فحاصرهم خمساً وعشرين ليلة، فلما اشتد حصارهم، واشتد البلاء، قيل لهم انزلوا على حكم رسول الله صلى الله عليه وسلم فاستشاروا أبا لبابة بن عبد المنذر، فأشار إليهم إنه الذبح، قالوا ننزل على حكم سعد بن معاذ رضي الله عنه، فقال رسول الله صلى الله عليه وسلم \" انزلوا على حكم سعد بن معاذ \" فنزلوا، وبعث رسول الله صلى الله عليه وسلم إلى سعد بن معاذ رضي الله عنه، فأتى به على حمار عليه إكاف من ليف قد حمل عليه، وحف به قومه، فقالوا ياأبا عمرو حلفاؤك ومواليك، وأهل النكاية، ومن قد علمت، قالت فلا يرجع إليهم شيئاً، ولا يلتفت إليهم، حتى إذا دنا من دورهم، التفت إلى قومه فقال قد آن لي أن لا أبالي في الله لومة لائم. قال قال أبو سعيد فلما طلع، قال رسول الله صلى الله عليه وسلم \" قوموا إلى سيدكم فأنزلوه \"\n                                    فقال عمر رضي الله عنه سيدنا الله، قال \" أنزلوه \" فأنزلوه، قال رسول الله صلى الله عليه وسلم \" احكم فيهم \" قال سعد رضي الله عنه فإني أحكم فيهم أن تقتل مقاتلتهم، وتسبى ذراريهم، وتقسم أموالهم، فقال رسول الله صلى الله عليه وسلم \" لقد حكمت فيهم بحكم الله وحكم رسوله \" ثم دعا سعد رضي الله عنه، فقال اللهم إن كنت أبقيت على نبيك من حرب قريش شيئاً، فأبقني لها، وإن كنت قطعت الحرب بينه وبينهم، فاقبضني إليك. قال فانفجر كلمه، وكان قد برىء منه إلا مثل الخرص، ورجع إلى قبته التي ضرب عليه رسول الله، قالت عائشة رضي الله عنها فحضره رسول الله صلى الله عليه وسلم وأبو بكر وعمر رضي الله عنهما، قالت فوالذي نفس محمد بيده إني لأعرف بكاء أبي بكر رضي الله عنه، من بكاء عمر رضي الله عنه وأنا في حجرتي، وكانوا كما قال الله تعالى\n{ رُحَمَآءُ بَيْنَهُمْ }\nالفتح 29 قال علقمة فقلت أي أمه فكيف كان رسول الله صلى الله عليه وسلم يصنع؟ قالت كانت عينه لاتدمع على أحد، ولكنه كان إذا وجد، فإنما هو آخذ بلحيته صلى الله عليه وسلم وقد أخرج البخاري ومسلم من حديث عبد الله بن نمير عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها نحواً من هذا، ولكنه أخصر منه، وفيه دعا سعد رضي الله عنه.\n\n                                    ",
        "qortoby": "وَأَوۡرَثَكُمۡ أَرۡضَهُمۡ وَدِيَٰرَهُمۡ وَأَمۡوَٰلَهُمۡ وَأَرۡضٗا لَّمۡ تَطَ‍ُٔوهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ٧٢\n                                    \n                                    \n                                    قوله تعالى: { وَأَنزَلَ ٱلَّذِينَ ظَاهَرُوهُم مِّنْ أَهْلِ ٱلْكِتَابِ } يعني الذين عاونوا الأحزاب: قريشاً وغَطَفان؛ وهم بنو قُريظة. وقد مضى خبرهم. { مِن صَيَاصِيهِمْ } أي حصونهم؛ واحدها صِيصَة. قال الشاعر :\nفأصبحت الثِّيران صَرْعَى وأصبحتْ\t   \tنساء تميم يبتدِرْن الصياصِيا\nومنه قيل لشوكة الحائك التي بها يُسوّى السَّداة واللُّحْمة: صِيصة. قال دريدُ بن الصِّمَّة :\nفجئتُ إليه والرماحُ تَنُوشُه\t   \tكوقع الصَّياصِي في النسيج الممدّد\nومنه: صيصَة الديك التي في رجله. وصَياصِي البقر قرونها؛ لأنها تمتنع بها. وربما كانت تركّب في الرماح مكان الأسنة؛ ويقال: جَذّ اللَّهُ صِئْصِئه؛ أي أصله. { وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعْبَ فَرِيقاً تَقْتُلُونَ } وهم الرجال. { وَتَأْسِرُونَ فَرِيقاً } وهم النساء والذّرّية؛ على ما تقدّم. { وَأَوْرَثَكُمْ أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضاً لَّمْ تَطَئُوهَا } بعدُ. قال يزيد بن رُومان وابن زيد ومقاتل: يعني حُنَين؛ ولم يكونوا نالوها، فوعدهم الله إياها. وقال قتادة: كنا نتحدّث أنها مكة. وقال الحسن: هي فارس والرّوم. وقال عِكرمة: كل أرض تفتح إلى يوم القيامة. { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيراً } فيه وجهان: أحدهما: على ما أراد بعباده من نقمة أو عفوٍ قديرٌ؛ قاله محمد بن إسحاق. الثاني: على ما أراد أن يفتحه من الحصون والقُرَى قدير؛ قاله النقاش. وقيل: { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ } مما وَعَدَكُمُوه { قَدِيراً } لا تردّ قدرته ولا يجوز عليه العجز تعالى. ويقال: تأسِرون وتأسُرون (بكسر السين وضمها) حكاه الفراء.\n                                    ",
        "saadi": "وَأَوۡرَثَكُمۡ أَرۡضَهُمۡ وَدِيَٰرَهُمۡ وَأَمۡوَٰلَهُمۡ وَأَرۡضٗا لَّمۡ تَطَ‍ُٔوهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ٧٢\n                                        \n                                        \n                                        \n                                        { قُل } لهم، لائماً على فرارهم، ومخبراً أنهم لا يفيدهم ذلك شيئاً { لَّن يَنفَعَكُمُ ٱلْفِرَارُ إِن فَرَرْتُمْ مِّنَ ٱلْمَوْتِ أَوِ ٱلْقَتْلِ } فلو كنتم في بيوتكم، لبرز الذين كتب عليهم القتل إلى مضاجعهم. والأسباب تنفع، إذا لم يعارضها القضاء والقدر، فإذا جاء القضاء والقدر، تلاشى كل سبب، وبطلت كل وسيلة ظنها الإنسان تنجيه. { وَإِذاً } حين فررتم لتسلموا من الموت والقتل، ولتنعموا في الدنيا فإنكم { لاَّ تُمَتَّعُونَ إِلاَّ قَلِيلاً } متاعاً لا يسوى فراركم، وترككم أمر اللّه، وتفويتكم على أنفسكم التمتع الأبدي، في النعيم السرمدي. ثم بيَّن أن الأسباب كلها لا تغني عن العبد شيئاً إذا أراده اللّه بسوء، فقال: { قُلْ مَن ذَا ٱلَّذِي يَعْصِمُكُمْ } أي: يمنعكم { مِّنَ ٱللَّهِ إِنْ أَرَادَ بِكُمْ سُوۤءاً } أي: شراً، { أَوْ أَرَادَ بِكُمْ رَحْمَةً } فإنه هو المعطي المانع، الضار النافع، الذي لا يأتي بالخير إلا هو، ولا يدفع السوء إلاّ هو. { وَلاَ يَجِدُونَ لَهُمْ مِّن دُونِ ٱللَّهِ وَلِيّاً } يتولاهم، فيجلب لهم النفع { وَلاَ نَصِيراً } أي: ينصرهم، فيدفع عنهم المضار. فَلْيَمْتَثِلُوا طاعة المنفرد بالأمور كلها، الذي نفذت مشيئته، ومضى قدره، ولم ينفع مع ترك ولايته ونصرته، وَلِيٌّ ولا ناصر. ثم توَّعد تعالى المخذلين المعوقين، وتهددهم فقال: { قَدْ يَعْلَمُ ٱللَّهُ ٱلْمُعَوِّقِينَ مِنكُمْ } عن الخروج لمن [لم] يخرجوا { وَٱلْقَآئِلِينَ لإِخْوَانِهِمْ } الذين خرجوا: { هَلُمَّ إِلَيْنَا } أي: ارجعوا، كما تقدم من قولهم :\n{ يٰأَهْلَ يَثْرِبَ لاَ مُقَامَ لَكُمْ فَٱرْجِعُواْ }\n[الأحزاب: 13]. وهم مع تعويقهم وتخذيلهم { وَلاَ يَأْتُونَ ٱلْبَأْسَ } القتال والجهاد بأنفسهم { إِلاَّ قَلِيلاً } فهم أشد الناس حرصاً على التخلف، لعدم الداعي لذلك من الإيمان والصبر، ووجود المقتضى للجبن، من النفاق وعدم الإيمان. { أَشِحَّةً عَلَيْكُمْ } بأبدانهم عند القتال، وبأموالهم عند النفقة فيه، فلا يجاهدون بأموالهم وأنفسهم. { فَإِذَا جَآءَ ٱلْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ } نظر المغشى عليه { مِنَ ٱلْمَوْتِ } من شدة الجبن، الذي خلع قلوبهم، والقلق الذي أذهلهم، وخوفاً من إجبارهم على ما يكرهون من القتال. { فَإِذَا ذَهَبَ ٱلْخَوْفُ } وصاروا في حال الأمن والطمأنينة، { سَلَقُوكُمْ بِأَلْسِنَةٍ } أي: خاطبوكم وتكلموا معكم، بكلام حديد، ودعاوى غير صحيحة. وحين تسمعهم، تظنهم أهل الشجاعة والإقدام، { أَشِحَّةً عَلَى ٱلْخَيْرِ } الذي يراد منهم، وهذا شر ما في الإنسان، أن يكون شحيحاً بما أمر به، شحيحاً بماله أن ينفقه في وجهه، شحيحاً في بدنه أن يجاهد أعداء اللّه، أو يدعو إلى سبيل اللّه، شحيحاً بجاهه، شحيحاً بعلمه ونصيحته ورأيه. { أوْلَـٰئِكَ } الذين بتلك الحالة { لَمْ يُؤْمِنُواْ } بسبب عدم إيمانهم أحبط الله أعمالهم، { وَكَانَ ذَلِكَ عَلَى ٱللَّهِ يَسِيراً }. وأما المؤمنون، فقد وقاهم اللّه شح أنفسهم، ووفقهم لبذل ما أمروا به، من بذلٍ لأبدانهم في القتال في سبيله، وإعلاء كلمته، وأموالهم للنفقة في طرق الخير، وجاههم وعلمهم.\n                                   \n                                   { يَحْسَبُونَ ٱلأَحْزَابَ لَمْ يَذْهَبُواْ } أي: يظنون أن هؤلاء الأحزاب، الذين تحزبوا على حرب رسول اللّه صلى اللّه عليه وسلم وأصحابه لم يذهبوا حتى يستأصلوهم، فخاب ظنهم، وبطل حسبانهم. { وَإِن يَأْتِ ٱلأَحْزَابُ } مرة أخرى { يَوَدُّواْ لَوْ أَنَّهُمْ بَادُونَ فِي ٱلأَعْرَابِ يَسْأَلُونَ عَنْ أَنبَآئِكُمْ } أي: لو أتى الأحزاب مرة ثانية مثل هذه المرة، ودَّ هؤلاء المنافقون، أنهم ليسوا في المدينة ولا في القرب منها، وأنهم مع الأعراب في البادية، يستخبرون عن أخباركم، ويسألون عن أنبائكم، ماذا حصل عليكم؟ فتباً لهم، وبعداً فليسوا ممن يبالى بحضورهم { وَلَوْ كَانُواْ فِيكُمْ مَّا قَاتَلُوۤاْ إِلاَّ قَلِيلاً } فلا تبالوهم، ولا تأسوا عليهم. { لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ ٱللَّهِ أُسْوَةٌ حَسَنَةٌ } حيث حضر الهيجاء بنفسه الكريمة، وباشر موقف الحرب، وهو الشريف الكامل، والبطل الباسل، فكيف تشحون بأنفسكم عن أمر جاد رسول اللّه صلى اللّه عليه وسلم بنفسه فيه؟!! فَتأَسُّوْا به في هذا الأمر وغيره. واستدل الأصوليون في هذه الآية، على الاحتجاج بأفعال الرسول صلى اللّه عليه وسلم، وأن الأصل، أن أمته أسوته في الأحكام، إلاّ ما دلَّ الدليل الشرعي على الاختصاص به. فالأسوة نوعان: أسوة حسنة، وأسوة سيئة. فالأسوة الحسنة في الرسول صلى اللّه عليه وسلم، فإن المتأسِّي به، سالك الطريق الموصل إلى كرامة اللّه، وهو الصراط المستقيم. وأما الأسوة بغيره إذا خالفه، فهو الأسوة السيئة، كقول الكفار حين دعتهم الرسل للتأسِّي [بهم]: { بَلْ قَالُوۤاْ إِنَّا وَجَدْنَآ ءَابَآءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ ءَاثَارِهِم مُّهْتَدُونَ }. وهذه الأسوة الحسنة، إنما يسلكها ويوفق لها، من كان يرجو اللّه واليوم الآخر، فإن ما معه من الإيمان، وخوف اللّه، ورجاء ثوابه، وخوف عقابه، يحثه على التأسي بالرسول صلى اللّه عليه وسلم. لما ذكر حالة المنافقين عند الخوف، ذكر حال المؤمنين، فقال: { وَلَمَّا رَأَى ٱلْمُؤْمِنُونَ ٱلأَحْزَابَ } الذين تحزبوا، ونزلوا منازلهم، وانتهى الخوف، { قَالُواْ هَـٰذَا مَا وَعَدَنَا ٱللَّهُ وَرَسُولُهُ } في قوله :\n{ أَمْ حَسِبْتُمْ أَن تَدْخُلُواْ ٱلْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ ٱلَّذِينَ خَلَوْاْ مِن قَبْلِكُم مَّسَّتْهُمُ ٱلْبَأْسَآءُ وَٱلضَّرَّآءُ وَزُلْزِلُواْ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ آمَنُواْ مَعَهُ مَتَىٰ نَصْرُ ٱللَّهِ أَلاۤ إِنَّ نَصْرَ ٱللَّهِ قَرِيبٌ }\n[البقرة: 214]. { وَصَدَقَ ٱللَّهُ وَرَسُولُهُ } فإنا رأينا، ما أخبرنا به { وَمَا زَادَهُمْ } ذلك الأمر { إِلاَّ إِيمَاناً } في قلوبهم { وَتَسْلِيماً } في جوارحهم، وانقياداً لأمر اللّه. ولما ذكر أن المنافقين عاهدوا اللّه، لا يولون الأدبار، ونقضوا ذلك العهد، ذكر وفاء المؤمنين به، فقال: { مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَاهَدُواْ ٱللَّهَ عَلَيْهِ } أي: وفوا به، وأتموه، وأكملوه، فبذلوا مهجهم في مرضاته، وسبَّلوا أنفسهم في طاعته. { فَمِنْهُمْ مَّن قَضَىٰ نَحْبَهُ } أي: إرادته ومطلوبه وما عليه من الحق، فقُتل في سبيل اللّه، أو مات مؤدياً لحقه لم ينقصه شيئاً. { وَمِنْهُمْ مَّن يَنتَظِرُ } تكميل ما عليه، فهو شارع في قضاء ما عليه، ووفاء نحبه ولما يكمله، وهو في رجاء تكميله، ساع في ذلك مجد.\n                                   \n{ وَمَا بَدَّلُواْ تَبْدِيلاً } كما بدَّل غيرهم، بل لم يزالوا على العهد، لا يلوون ولا يتغيرون، فهؤلاء الرجال على الحقيقة، ومن عداهم فصورهم صور رجال، وأما الصفات فقد قصرت عن صفات الرجال. { لِّيَجْزِيَ ٱللَّهُ ٱلصَّادِقِينَ بِصِدْقِهِمْ } أي: بسبب صدقهم، في أقوالهم وأحوالهم، ومعاملتهم مع اللّه، واستواء ظاهرهم وباطنهم، قال اللّه تعالى :\n{ هَـٰذَا يَوْمُ يَنفَعُ ٱلصَّادِقِينَ صِدْقُهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ خَالِدِينَ فِيهَآ أَبَداً }\nالآية [المائدة: 119]. أي: قدرنا ما قدرنا من هذه الفتن والمحن والزلازل، ليتبين الصادق من الكاذب، فيجزي الصادقين بصدقهم { وَيُعَذِّبَ ٱلْمُنَافِقِينَ } الذين تغيرت قلوبهم وأعمالهم عند حلول الفتن، ولم يفوا بما عاهدوا اللّه عليه. { إِن شَآءَ } تعذيبهم، بأن لم يشأ هدايتهم، بل علم أنهم لا خير فيهم فلم يوفقهم. { أَوْ يَتُوبَ عَلَيْهِمْ } بأن يوفقهم للتوبة والإنابة، وهذا هو الغالب على كرم الكريم، ولهذا ختم الآية باسمين دالين على المغفرة، والفضل والإحسان فقال: { إِنَّ ٱللَّهَ كَانَ غَفُوراً رَّحِيماً } غفوراً لذنوب المسرفين على أنفسهم، ولو أكثروا من العصيان إذا أتوا بالمتاب. { رَّحِيماً } بهم، حيث وفقهم للتوبة، ثم قبلها منهم وستر عليهم ما اجترحوه. { وَرَدَّ ٱللَّهُ ٱلَّذِينَ كَفَرُواْ بِغَيْظِهِمْ لَمْ يَنَالُواْ خَيْراً } أي: ردهم خائبين، لم يحصل لهم الأمر الذي كانوا حنقين عليه، مغتاظين قادرين [عليه] جازمين، بأن لهم الدائرة، قد غرتهم جموعهم، وأعجبوا بتحزبهم، وفرحوا بِعَدَدِهمْ وعُدَدِهِمْ. فأرسل اللّه عليهم ريحاً عظيمة، وهي ريح الصبا، فزعزعت مراكزهم، وقوَّضت خيامهم، وكفأت قدورهم وأزعجتهم، وضربهم اللّه بالرعب، فانصرفوا بغيظهم، وهذا من نصر اللّه لعباده المؤمنين. { وَكَفَى ٱللَّهُ ٱلْمُؤْمِنِينَ ٱلْقِتَالَ } بما صنع لهم من الأسباب العادية والقدرية، { وَكَانَ ٱللَّهُ قَوِيّاً عَزِيزاً } لا يغالبه أحد إلا غُلِبَ، ولا يستنصره أحد إلا غَلَبَ، ولا يعجزه أمر أراده، ولا ينفع أهل القوة والعزة قوتهم وعزتهم، إن لم يعنهم بقوته وعزته. { وَأَنزَلَ ٱلَّذِينَ ظَاهَرُوهُم } أي عاونوهم { مِّنْ أَهْلِ ٱلْكِتَابِ } أي: اليهود { مِن صَيَاصِيهِمْ } أي: أنزلهم من حصونهم، نزولا مظفوراً بهم، مجعولين تحت حكم الإسلام. { وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعْبَ } فلم يقووا على القتال، بل استسلموا وخضعوا وذلوا. { فَرِيقاً تَقْتُلُونَ } وهم الرجال المقاتلون { وَتَأْسِرُونَ فَرِيقاً } مَنْ عداهم من النساء والصبيان. { وَأَوْرَثَكُمْ } أي: غنَّمكم { أَرْضَهُمْ وَدِيَارَهُمْ وَأَمْوَالَهُمْ وَأَرْضاً لَّمْ تَطَئُوهَا } أي: أرضاً كانت من قبل، من شرفها وعزتها عند أهلها، لا تتمكنون من وطئها، فمكَّنكم اللّه وخذلهم، وغنمتم أموالهم، وقتلتموهم وأسرتموهم. { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيراً } لا يعجزه شيء، ومن قدرته قدَّر لكم ما قدر. وكانت هذه الطائفة من أهل الكتاب، هم بنو قريظة من اليهود، في قرية خارج المدينة غير بعيدة، وكان النبي صلى اللّه عليه وسلم [حين] هاجر إلى المدينة وادعهم وهادنهم، فلم يقاتلهم ولم يقاتلوه، وهم باقون على دينهم، لم يغير عليهم شيئاً.\n                                   فلما رأوا يوم الخندق، الأحزاب الذين تحزبوا على رسول اللّه وكثرتهم، وقلة المسلمين، وظنوا أنهم سيستأصلون الرسول والمؤمنين، وساعد على ذلك، [تدجيل] بعض رؤسائهم عليهم، فنقضوا العهد الذي بينهم وبين رسول اللّه صلى اللّه عليه وسلم ومالؤوا المشركين على قتاله. فلما خذل اللّه المشركين، تفرغ رسول اللّه صلى اللّه عليه وسلم لقتالهم، فحاصرهم في حصنهم، فنزلوا على حكم سعد بن معاذ رضي اللّه عنه، فحكم فيهم، أن تقتل مقاتلتهم، وتسبى ذراريهم، وتغنم أموالهم. فأتم اللّه لرسوله والمؤمنين، المنة، وأسبغ عليهم النعمة، وأَقَرَّ أعينهم بخذلان مَنْ انخذل من أعدائهم، وقتل مَنْ قتلوا، وأسر مَنْ أسروا، ولم يزل لطف اللّه بعباده المؤمنين مستمراً.\n\n                                    "
      },
      "originalText": "وَأَوۡرَثَكُمۡ أَرۡضَهُمۡ وَدِيَٰرَهُمۡ وَأَمۡوَٰلَهُمۡ وَأَرۡضٗا لَّمۡ تَطَ‍ُٔوهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ٧٢"
    },
    {
      "number": 3561,
      "text": "يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 28,
      "juz": 21,
      "manzil": 5,
      "page": 421,
      "ruku": 364,
      "hizbQuarter": 168,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ إِن كُنتُنَّ تُرِدۡنَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا فَتَعَالَيۡنَ أُمَتِّعۡكُنَّ وَأُسَرِّحۡكُنَّ سَرَاحٗا جَمِيلٗا ٨٢\n                                    \n                                    \n                                    هذا أمر من الله تبارك وتعالى لرسوله صلى الله عليه وسلم بأن يخير نساءه بين أن يفارقهن، فيذهبن إلى غيره ممن يحصل لهن عنده الحياة الدنيا وزينتها، وبين الصبر على ما عنده من ضيق الحال، ولهن عند الله تعالى في ذلك الثواب الجزيل، فاخترن رضي الله عنهنّ وأرضاهن الله ورسوله والدار الآخرة، فجمع الله تعالى لهن بعد ذلك بين خير الدنيا وسعادة الآخرة. قال البخاري حدثنا أبو اليمان، أخبرنا شعيب عن الزهري قال أخبرني أبو سلمة بن عبد الرحمن أن عائشة رضي الله عنها زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم جاءها حين أمره الله تعالى أن يخير أزواجه، قالت فبدأ بي رسول الله صلى الله عليه وسلم فقال \" إني ذاكر لك أمراً، فلا عليك أن تستعجلي حتى تستأمري أبويك \" وقد علم أن أبوي لم يكونا يأمراني بفراقه، قالت ثم قال \" إن الله تعالى قال { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ } \" إلى تمام الآيتين، فقلت له ففي أي هذا أستأمر أبوي؟ فإني أريد الله ورسوله والدار الآخرة. وكذا رواه معلقاً عن الليث حدثني يونس عن الزهري عن أبي سلمة عن عائشة رضي الله عنها، فذكره، وزاد قالت ثم فعل أزواج النبي صلى الله عليه وسلم مثل مافعلت، وقد حكى البخاري أن معمراً اضطرب فيه، فتارة رواه عن الزهري عن أبي سلمة، وتارة رواه عن الزهري عن عروة عن عائشة رضي الله عنها. وقال ابن جرير حدثنا أحمد بن عبدة الضبي، حدثنا أبو عوانة عن عمر بن أبي سلمة عن أبيه قال قالت عائشة رضي الله عنها لما نزل الخيار، قال لي رسول الله صلى الله عليه وسلم \" إني أريد أن أذكر لك أمراً، فلا تقضي فيه شيئاً حتى تستأمري أبويك \" قالت قلت وما هو يارسول الله؟ قالت فرده عليها، فقالت وما هو يارسول الله؟ قالت فرده عليها، فقالت وما هو يارسول الله؟ قالت فقرأ صلى الله عليه وسلم عليها { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ } إلى آخر الآية، قالت فقلت بل نختار الله ورسوله والدار الآخرة، قالت ففرح بذلك النبي صلى الله عليه وسلم وحدثنا ابن وكيع، حدثنا محمد بن بشر عن محمد بن عمرو عن أبي سلمة عن عائشة رضي الله عنها قالت لما نزلت آية التخيير، بدأ بي رسول الله صلى الله عليه وسلم فقال \" ياعائشة إني عارض عليك أمراً، فلا تفتاتي فيه بشيء حتى تعرضيه على أبويك أبي بكر وأم رومان رضي الله عنهما \"\n                                    ، فقالت يارسول الله وما هو؟ قال صلى الله عليه وسلم \" قال الله عز وجل { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحاً جَمِيلاً وَإِن كُنتُنَّ تُرِدْنَ ٱللَّهَ وَرَسُولَهُ وَٱلدَّارَ ٱلأَخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلْمُحْسِنَـٰتِ مِنكُنَّ أَجْرًا عَظِيمًا } \" قالت فإني أريد الله ورسوله والدار الآخرة، ولا أؤامر في ذلك أبوي أبا بكر وأم رومان رضي الله عنهما. فضحك رسول الله صلى الله عليه وسلم ثم استقرأ الحجر، فقال \" إن عائشة، رضي الله عنها ــــ قالت كذا وكذا \" ، فقلن ونحن نقول مثلما قالت عائشة. رضي الله عنهن كلهن. رواه ابن أبي حاتم عن أبي سعيد الأشج عن أبي أسامة عن محمد بن عمرو به. قال ابن جرير وحدثنا سعيد بن يحيى الأموي، حدثنا أبي حدثنا محمد بن إِسحاق عن عبد الله بن أبي بكر عن عمرة عن عائشة رضي الله عنها قالت إِن رسول الله صلى الله عليه وسلم لما نزل ـــ إلى نسائه أمر أن يخيرهن، فدخل علي فقال \" سأذكر لك أمراً، فلا تعجلي حتى تستشيري أباك \" فقلت وما هو يارسول الله؟ قال \" إِني أمرت أن أخيركن \" وتلا عليها آية التخيير إِلى آخر الآيتين، قالت فقلت وما الذي تقول لاتعجلي حتى تستشيري أباك؟ فإِني أختار الله ورسوله. فسر صلى الله عليه وسلم بذلك، وعرض على نسائه، فتتابعن كلهن، فاخترن الله ورسوله صلى الله عليه وسلم وقال ابن أبي حاتم حدثنا يزيد بن سنان البصري، حدثنا أبو صالح عبد الله بن صالح، حدثني الليث، حدثني عقيل عن الزهري، أخبرني عبد الله بن عبد الله بن أبي ثور عن ابن عباس رضي الله عنهما قال قالت عائشة رضي الله عنها أنزلت آية التخيير، فبدأ بي أول امرأة من نسائه، فقال صلى الله عليه وسلم \" إِني ذاكر لك أمراً، فلا عليك أن تعجلي حتى تستأمري أبويك \" قالت وقد علم أن أبوي لم يكونا يأمراني بفراقه، قالت ثم قال \" إِن الله تبارك وتعالى قال { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ } \" الآيتين، قالت عائشة رضي الله عنها فقلت أفي هذا أستأمر أبوي؟ فإِني أريد الله ورسوله والدار الآخرة. ثم خير نساءه كلهن، فقلن مثل ما قالت عائشة رضي الله عنهن، وأخرجه البخاري ومسلم جميعاً عن قتيبة عن الليث عن الزهري عن عروة عن عائشة رضي الله عنها مثله. وقال الإمام أحمد حدثنا أبو معاوية، حدثنا الأعمش عن مسلم بن صبيح عن مسروق عن عائشة رضي الله عنها قالت خيرنا رسول الله صلى الله عليه وسلم فاخترناه، فلم يعدها علينا شيئاً، أخرجاه من حديث الأعمش.\n                                    وقال الإمام أحمد حدثنا أبو عامر عبد الملك بن عمرو، حدثنا زكريا بن إِسحاق عن أبي الزبير عن جابر رضي الله عنه قال أقبل أبو بكر رضي الله عنه يستأذن رسول الله صلى الله عليه وسلم والناس ببابه جلوس، والنبي صلى الله عليه وسلم جالس، فلم يؤذن له، ثم أقبل عمر رضي الله عنه، فاستأذن فلم يؤذن له، ثم أذن لأبي بكر وعمر رضي الله عنهما، فدخلا والنبي صلى الله عليه وسلم جالس، وحوله نساؤه، وهو صلى الله عليه وسلم ساكت، فقال عمر رضي الله عنه لأكلمن النبي صلى الله عليه وسلم لعله يضحك، فقال عمر رضي الله عنه يارسول الله لو رأيت ابنة زيد ــــ امرأة عمر ــــ سألتني النفقة آنفاً، فوجأت عنقها، فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه، وقال \" هن حولي يسألنني النفقة \" فقام أبو بكر رضي الله عنه إِلى عائشة ليضربها، وقام عمر رضي الله عنه إِلى حفصة، كلاهما يقولان تسألان النبي صلى الله عليه وسلم ما ليس عنده، فنهاهما رسول الله صلى الله عليه وسلم فقلن والله لانسأل رسول الله صلى الله عليه وسلم بعد هذا المجلس ما ليس عنده، قال وأنزل الله عز وجل الخيار، فبدأ بعائشة رضي الله عنها فقال \" إِني أذكر لك أمراً ما أحب أن تعجلي فيه حتى تستأمري أبويك \" قالت وما هو؟ قال فتلا عليها { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ } الآية، قالت عائشة رضي الله عنها أفيك أستأمر أبوي؟ بل أختار الله تعالى ورسوله، وأسألك أن لا تذكر لامرأة من نسائك ما اخترت، فقال صلى الله عليه وسلم \" إِن الله تعالى لم يبعثني معنفاً، ولكن بعثني معلماً ميسراً، لا تسألني امرأة منهن عما اخترت إِلا أخبرتها \" انفرد بإِخراجه مسلم دون البخاري، فرواه هو والنسائي من حديث زكريا بن إِسحاق المكي به. وقال عبد الله بن الإمام أحمد حدثنا سريج بن يونس، حدثنا علي بن هشام بن البريد عن محمد بن عبيد الله ابن علي بن أبي رافع، عن عثمان بن علي بن الحسين عن أبيه عن علي رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم خير نساءه الدنيا والآخرة، ولم يخيرهن الطلاق، وهذا منقطع. وقد روي عن الحسن وقتادة وغيرهما نحو ذلك، وهو خلاف الظاهر من الآية، فإِنه قال { فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحاً جَمِيلاً } أي أعطيكن حقوقكن، وأطلق سراحكن، وقد اختلف العلماء في جواز تزوج غيره لهن، لو طلقهن، على قولين، أصحهما نعم، لو وقع ليحصل المقصود من السراح، والله أعلم. قال عكرمة وكان تحته يومئذ تسع نسوة خمس من قريش عائشة وحفصة وأم حبيبة وسودة وأم سلمة رضي الله عنهن، وكانت تحته صلى الله عليه وسلم صفية بنت حيي النضيرية، وميمونة بنت الحارث الهلالية، وزينب بنت جحش الأسدية، وجويرية بنت الحارث المصطلقية، رضي الله عنهن وأرضاهن جميعاً.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ إِن كُنتُنَّ تُرِدۡنَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا فَتَعَالَيۡنَ أُمَتِّعۡكُنَّ وَأُسَرِّحۡكُنَّ سَرَاحٗا جَمِيلٗا ٨٢\n                                    \n                                    \n                                    فيه ثماني مسائل:\n\nالأولى: قوله تعالى: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ } قال علماؤنا: هذه الآية متصلة بمعنى ما تقدّم من المنع من إيذاء النبيّ صلى الله عليه وسلم؛ وكان قد تأذى ببعض الزوجات. قيل: سألنَه شيئاً من عرَض الدنيا. وقيل: زيادة في النفقة. وقيل: آذَيْنَه بغيْرة بعضهنّ على بعض. وقيل: أمِر صلى الله عليه وسلم بتلاوة هذه الآية عليهنّ وتخييرهنّ بين الدنيا والآخرة. وقال الشافعيّ رحمه الله تعالى: إن مَنْ مَلَك زوجة فليس عليه تخييرها. أمِر صلى الله عليه وسلم أن يخيّر نساءه فاخترنه. وجملة ذلك أن الله سبحانه خيّر النبيّ صلى الله عليه وسلم بين أن يكون نبيًّا ملِكاً وعرض عليه مفاتيح خزائن الدنيا، وبين أن يكون نبيًّا مِسكيناً؛ فشاور جبريل فأشار عليه بالمسكنة فاختارها؛ فلما اختارها وهي أعلى المنزلتين، أمره الله عز وجل أن يخيّر زوجاته؛ فربما كان فيهنّ من يكره المقام معه على الشدّة تنزيهاً له. وقيل: إن السبب الذي أُوجِب التخيير لأجله، أن امرأة من أزواجه سألته أن يصوغ لها حَلْقة من ذهب، فصاغ لها حلقة من فضة وطلاها بالذهب ـ وقيل بالزعفران ـ فأبت إلا أن تكون من ذهب؛ فنزلت آية التخيير فخيَّرهنّ، فقلن اخترنا الله ورسوله. وقيل: إن واحدة منهنّ اختارت الفراق. فالله أعلم. روى البخاريّ ومسلم ـ واللفظ لمسلم ـ \" عن جابر بن عبد الله قال: دخل أبو بكر يستأذن على رسول الله صلى الله عليه وسلم، فوجد الناس جلوساً ببابه لم يؤذن لأحد منهم، قال: ـ فأذِن لأبي بكر فدخل، ثم جاء عمر فاستأذن فأذِن له، فوجد النبيّ صلى الله عليه وسلم جالساً حوله نساؤه واجماً ساكتاً ـ قال: ـ فقال والله لأقولنّ شيئاً أضحك رسولَ الله صلى الله عليه وسلم، فقال: يا رسول الله، لو رأيت بنت خارجة سألتني النفقة فقمتُ إليها فَوَجَأْتُ عنقها؛ فضحك رسول الله صلى الله عليه وسلم وقال: «هنّ حولي كما ترى يسألنَني النفقة» فقام أبو بكر إلى عائشة يَجَأُ عنقها، وقام عمر إلى حفصة يَجَأ عنقها؛ كلاهما يقول: تسألن رسول الله صلى الله عليه وسلم ما ليس عنده!! فقلن: واللَّهِ لا نسأل رسول الله صلى الله عليه وسلم شيئاً أبداً ليس عنده. ثم اعتزلهنّ شهراً أو تسعاً وعشرين. ثم نزلت عليه هذه الآية: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ ـ حتى بلغ ـ لِلْمُحْسِنَاتِ مِنكُنَّ أَجْراً عَظِيماً }. قال: فبدأ بعائشة فقال: «يا عائشة، إني أريد أن أعرِض عليك أمراً أحِبُّ ألا تعجلي فيه حتى تستشيري أبويك» قالت: وما هو يا رسول الله؟ فتلا عليها الآية. قالت: أفيك يا رسول الله أستشير أبوي! بل أختار الله ورسوله والدار الآخرة، وأسألك ألا تخبر امرأة من نسائك بالذي قلت. قال: «لا تسألني امرأة منهن إلا أخبرتها، إنّ الله لم يبعثني مُعَنتاً ولا مُتَعنِّتاً ولكن بعثني معلماً مُيَسِّراً» \"\n                                   وروى الترمذي \" عن عائشة رضي الله عنها قالت: أمِر رسول الله صلى الله عليه وسلم بتخيير أزواجه بدأ بي فقال: «يا عائشة، إني ذاكر لكِ أمراً فلا عليكِ ألا تستعجلي حتى تستأمري أبويْك» قالت: وقد عَلم أن أبويّ لم يكونا ليأمراني بفراقه؛ قالت ثم قال: «إنّ الله يقول: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَاةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحاً جَمِيلاً ـ حتى بلغ ـ لِلْمُحْسِنَاتِ مِنكُنَّ أَجْراً عَظِيماً } » فقلت: أفي هذا أستأمر أبوي فإني أريد الله ورسوله والدار الآخرة، وفعل أزواج النبيّ صلى الله عليه وسلم مثل ما فعلت \" قال: هذا حديث حسن صحيح. قال العلماء: وأما أمر النبيّ صلى الله عليه وسلم عائشة أن تشاور أبويها لأنه كان يحبها، وكان يخاف أن يحملها فرط الشباب على أن تختار فِراقه، ويعلم من أبويها أنهما لا يشيران عليها بفراقه.\n\nالثانية: قوله تعالى: { قُل لأَزْوَاجِكَ } كان للنبيّ صلى الله عليه وسلم أزواج، منهن من دخل بها، ومنهن من عقد عليها ولم يدخل بها، ومنهن من خطبها فلم يتم نكاحه معها.\n\nفأوّلهنّ: خديجة بنت خُوَيلد بن أسد بن عبد العُزّى بن قُصَيّ بن كِلاب. وكانت قبله عند أبي هالة واسمه زرارة بن النبّاش الأسدي، وكانت قبله عند عتيق بن عائذ، وَلدت منه غلاماً اسمه عبد مناف. وولدت من أبي هالة هند بن أبي هالة، وعاش إلى زمن الطاعون فمات فيه. ويقال: إن الذي عاش إلى زمن الطاعون هند بن هند، وسُمعت نادبته تقول حين مات: واهندُ ابن هنداه، واربِيبَ رسول الله. ولم يتزوج رسول الله صلى الله عليه وسلم على خديجة غيرها حتى ماتت. وكانت يوم تزوّجها رسول الله صلى الله عليه وسلم بنت أربعين سنة، وتوفيت بعد أن مضى من النبوّة سبع سنين، وقيل: عشر. وكان لها حين توفيت خمس وستون سنة. وهي أول امرأة آمنت به. وجميع أولاده منها غير إبراهيم. قال حكيم بن حزام: توفيت خديجة فخرجنا بها من منزلها حتى دفنّاها بالحَجُون؛ ونزل رسول الله صلى الله عليه وسلم في حفرتها، ولم تكن يومئذٍ سُنَّةُ الجنازة الصلاةَ عليها.\n\nومنهن: سَوْدة بنت زَمْعة بن قيس بن عبد شمس العامرية، أسلمت قديماً وبايعت، وكانت عند ابن عمّ لها يقال له السكران بن عمرو؛ وأسلم أيضاً، وهاجرا جميعاً إلى أرض الحبشة في الهجرة الثانية، فلما قدما مكة مات زوجها. وقيل: مات بالحبشة؛ فلما حلّت خطبها رسول الله صلى الله عليه وسلم، فتزوّجها ودخل بها بمكة، وهاجر بها إلى المدينة؛ فلما كبرت أراد طلاقها فسألته ألاّ يفعل وأن يدعها في نسائه، وجعلت ليلتها لعائشة ـ حسبما هو مذكور في الصحيح ـ فأمسكها، وتوفيت بالمدينة في شوّال سنة أربع وخمسين.\n                                   ومنهن: عائشة بنت أبي بكر الصدّيق، وكانت مسماة لجُبير بن مطعِم، فخطبها رسول الله صلى الله عليه وسلم؛ فقال أبو بكر: يا رسول الله، دَعْني أسُلّها من جُبير سَلاًّ رفِيقاً؛ فتزوّجها رسول الله صلى الله عليه وسلم بمكة قبل الهجرة بسنتين، وقيل بثلاث سنين؛ وبنى بها بالمدينة وهي بنت تسع، وبقيت عنده تسع سنين، ومات رسول الله صلى الله عليه وسلم وهي بنت ثمان عشرة، ولم يتزوج بِكراً غيرها، وماتت سنة تسع وخمسين، وقيل ثمان وخمسين.\n\nومنهن: حفصة بنت عمر بن الخطاب القُرَشِية العدويّة، تزوّجها رسول الله صلى الله عليه وسلم ثم طلقها، فأتاه جبريل فقال: «إن الله يأمرك أن تراجع حفصة فإنها صوّامة قوّامة» فراجعها. قال الواقديّ: وتوفيت في شعبان سنة خمس وأربعين في خلافة معاوية، وهي ابنة ستين سنة. وقيل: ماتت في خلافة عثمان بالمدينة.\n\nومنهن: أم سلمة، واسمها هند بنت أبي أميّة المخزومية ـ واسم أبي أمية سُهيل ـ تزوّجها رسول الله صلى الله عليه وسلم في ليال بقين من شوّال سنة أربع، زوّجها منه ابنها سلمة على الصحيح، وكان عُمَرُ ابنُها صغيراً، وتوفيت في سنة تسع وخمسين. وقيل: سنة ثنتين وستين؛ والأول أصح. وصلّى عليها سعيد بن زيد. وقيل أبو هريرة. وقُبِرت بالبقِيع وهي ابنة أربع وثمانين سنة.\n\nومنهنّ: أم حبيبة، واسمها رَمْلة بنت أبي سفيان. بعث رسول الله صلى الله عليه وسلم عمرو بن أمية الضَّمْريّ إلى النجاشيّ، ليخطب عليه أم حبيبة فزوجه إياها، وذلك سنة سبع من الهجرة، وأصدق النجاشيّ عن رسول الله صلى الله عليه وسلم أربعمائة دينار، وبعث بها مع شُرحبيل بن حَسَنة، وتوفيت سنة أربع وأربعين. وقال الدَّارَقُطْنِيّ: كانت أم حبيبة تحت عبيد الله بن جحش فمات بأرض الحبشة على النصرانية، فزوّجها النجاشيّ النبيّ صلى الله عليه وسلم، وأمهرها عنه أربعة آلاف، وبعث بها إليه مع شُرحبيل بن حسنة.\n\nومنهنّ: \" زينب بنت جَحْش بن رِئاب الأسديّة؛ وكان اسمها بَرّة فسماها رسول الله صلى الله عليه وسلم زينب، وكان اسم أبيها بُرّة؛ فقالت: يا رسول الله، بدّل اسم أبي فإن البُرّة حقيرة؛ فقال لها النبيّ صلى الله عليه وسلم: «لو كان أبوك مؤمناً سميناه باسم رجل منا أهل البيت ولكني قد سميته جحشاً والجحش من البُرّة» \" ذكر هذا الحديث الدَّارَقُطْنِيّ. تزوّجها رسول الله صلى الله عليه وسلم بالمدينة في سنة خمس من الهجرة، وتوفيت سنة عشرين، وهي بنت ثلاث وخمسين.\n\nومنهنّ: زينب بنت خُذيمة بن الحارث (ابن عبد الله) بن عمرو بن عبد مناف بن هلال بن عامر بن صَعْصعة الهلالية، كانت تسمى في الجاهلية أمّ المساكين؛ لإطعامها إياهم.\n                                   تزوّجها رسول الله صلى الله عليه وسلم في رمضان على رأس واحد وثلاثين شهراً من الهجرة، فمكثت عنده ثمانية أشهر، وتوفيت في حياته في آخر ربيع الأوّل على رأس تسعة وثلاثين شهراً؛ ودفنت بالبقيع.\n\nومنهنّ: جُوَيرية بنت الحارث بن أبي ضِرار الخُزاعية المُصْطَلِقيّة، أصابها في غزوة بني المُصْطَلِق فوقعت في سهم ثابت بن قيس بن شَمّاس فكاتبها؛ فقضى رسول الله صلى الله عليه وسلم كتابتها وتزوّجها، وذلك في شعبان سنة ست، وكان اسمها بُرّة فسمّاها رسول الله صلى الله عليه وسلم جُوَيرية، وتوفيت في ربيع الأول سنة ست وخمسين. وقيل: سنة خمسين، وهي ابنة خمس وستين.\n\nومنهن: صفية بنت حُيَيّ بن أخْطَب الهارونية، سباها النبيّ صلى الله عليه وسلم يوم خَيْبر واصطفاها لنفسه، وأسلمت وأعتقها، وجعل عتقها صداقها. وفي الصحيح: أنها وقعت في سهم دِحْيَة الكَلْبيّ فاشتراها رسول الله صلى الله عليه وسلم بسبعة أرؤس، وماتت في سنة خمسين. وقيل: سنة اثنتين وخمسين، ودفنت بالبقيع.\n\nومنهن: رَيحانة بنت زيد بن عمرو بن خُنافة من بني النَّضير، سباها رسول الله صلى الله عليه وسلم وأعتقها، وتزوّجها في سنة ست، وماتت مرْجِعَه من حَجة الوَداع، فدفنها بالبقيع. وقال الواقديّ: ماتت سنة ست عشرة وصلّى عليها عمر. قال أبو الفرج الجَوْزِيّ: وقد سمعت من يقول: إنه كان يطؤها بمِلْك اليمين ولم يعتقها.\n\nقلت: ولهذا والله أعلم لم يذكرها أبو القاسم عبد الرحمن السُّهَيْلِي في عداد أزواج النبيّ صلى الله عليه وسلم.\n\nومنهن: ميمونة بنت الحارث الهلالِية، تزوّجها رسول الله صلى الله عليه وسلم بسَرِف على عشرة أميال من مكة، وذلك في سنة سبع من الهجرة في عُمْرة القَضِيّة، وهي آخر امرأة تزوّجها رسول الله صلى الله عليه وسلم، وقدّر الله تعالى أنها ماتت في المكان الذي بنى فيه رسول الله صلى الله عليه وسلم بها، ودفنت هنالك، وذلك في سنة إحدى وستين. وقيل: ثلاث وستين. وقيل ثمان وستين.\n\nفهؤلاء المشهورات من أزواج النبيّ صلى الله عليه وسلم، وهنّ اللاتي دخل بهن؛ رضي الله عنهن.\n\nفأما من تزوّجهن ولم يدخل بهن؛ فمنهن: الكلابِية. واختلفوا في اسمها؛ فقيل فاطمة. وقيل عَمْرة. وقيل العالية. قال الزهريّ: تزوّج فاطمة بنت الضحاك الكلابية فاستعاذت منه فطلقها، وكانت تقول: أنا الشقيّة. تزوّجها في ذي القعدة سنة ثمان من الهجرة، وتوفيت سنة ستين.\n\nومنهن: أسماء بنت النعمان بن الجَوْن بن الحارث الكِنْدية، وهي الجونية. قال قتادة: لما دخل عليها دعاها فقالت: تعال أنت، فطلّقها. وقال غيره: هي التي استعاذت منه. وفي البخاريّ قال: \" تزوج رسول الله صلى الله عليه وسلم أميمة بنت شَراحيل، فلما أدخلت عليه بسط يده إليها فكأنها كرهت ذلك، فأمر أبا أسيد أن يجهزها ويكسوها ثوبين \"\n                                   وفي لفظ آخر قال أبو أُسيد: \" أتِي رسول الله صلى الله عليه وسلم بالجَوْنية، فلما دخل عليها قال: «هبِي لي نفسك» فقالت: وهل تهب الملِكة نفسها للسُّوقة! فأهوى بيده ليضعها عليها لتسكن؛ فقالت: أعوذ بالله منك! فقال: «قد عُذتِ بمعَاذ» ثم خرج علينا فقال: «يا أبا أسَيد، أكْسها رازِقِيين وألحقها بأهلها» \". ومنهنّ: قُتَيْلة بنت قيس، أخت الأشعث بن قيس، زوّجها إياه الأشعث، ثم انصرف إلى حَضْرمَوْت، فحملها إليه فبلغه وفاة النبيّ صلى الله عليه وسلم. فردّها إلى بلاده، فارتدّ وارتدت معه. ثم تزوّجها عِكرمة بن أبي جَهْل، فوجد من ذلك أبو بكر وَجْداً شديداً. فقال له عمر: إنها والله ما هي من أزواجه، ما خيّرها ولا حجبها. ولقد برّأها الله منه بالارتداد. وكان عروة ينكر أن يكون تزوّجها.\n\nومنهنّ: أم شريك الأزدية، واسمها غُزَيَّة بنت جابر بن حكيم، وكانت قبله عند أبي بكر بن أبي سلمى، فطلقها النبيّ صلى الله عليه وسلم ولم يدخل بها. وهي التي وهبت نفسها. وقيل: إن التي وهبت نفسها للنبيّ صلى الله عليه وسلم خَوْلة بنت حكيم.\n\nومنهنّ: خَوْلة بنت الهُذَيل ابن هُبَيرة، تزوّجها رسول الله صلى الله عليه وسلم، فهلكت قبل أن تصل إليه.\n\nومنهنّ: شَرَافُ بنت خليفة، أخت دِحْية، تزوّجها ولم يدخل بها.\n\nومنهنّ: ليلى بنت الخَطِيم، أخت قيس، تزوّجها وكانت غيوراً فاستقالته فأقالها.\n\nومنهنّ: عمرة بنت معاوية الكِندية، تزوّجها النبي صلى الله عليه وسلم. قال الشعبيّ: تزوّج امرأة من كِنْدة فجيء بها بعد ما مات.\n\nومنهنّ: ابنة جندب بن ضمرة الجُنْدُعِية. قال بعضهم: تزوّجها رسول الله صلى الله عليه وسلم. وأنكر بعضهم وجود ذلك.\n\nومنهنّ: \" الغِفارِيّة. قال بعضهم؛ تزوّج امرأة من غِفار، فأمرها فنزعت ثيابها فرأى بياضاً فقال: «الْحَقِي بأهلك» \" ويقال: إنما رأى البياض بالكلابية. فهؤلاء اللاتي عقد عليهنّ ولم يدخل بهنّ؛ صلى الله عليه وسلم.\n\nفأما من خطبهنّ فلم يتم نكاحه معهنّ؛ ومن وهبت له نفسها:\n\nفمنهنّ: أم هانىء بنت أبي طالب، واسمها فاختة. خطبها النبيّ صلى الله عليه وسلم فقالت: إني امرأة مُصْبِيَة واعتذرت إليه فعذرها.\n\nومنهنّ: ضُباعة بنت عامر.\n\nومنهنّ: \" صفِية بنت بَشامة بن نضلة، خطبها النبيّ صلى الله عليه وسلم وكان أصابها سِباء، فخيّرها النبيّ صلى الله عليه وسلم، فقال: «إن شئت أنا وإن شئت زوجك؟» قالت: زوجي. فأرسلها؛ فلعنتها بنو تميم \" ؛ قاله ابن عباس.\n\nومنهنّ: أم شريك. وقد تقدّم ذكرها.\n\nومنهنّ: ليلى بنت الخَطِيم؛ وقد تقدّم ذكرها.\n\nومنهنّ: خولة بنت حكيم بن أمية؛ وهبت نفسها للنبيّ صلى الله عليه وسلم فأرجأها، فتزوّجها عثمان بن مظعون.\n                                   ومنهنّ: جَمْرة بنت الحارث بن عَوف المرّي؛ خطبها النبيّ صلى الله عليه وسلم فقال أبوها: إن بها سوءاً ولم يكن بها، فرجع إليها أبوها وقد برِصَت، وهي أم شبيب بن البرصاء الشاعر.\n\nومنهنّ: سودة القرشية؛ خطبها رسول الله صلى الله عليه وسلم وكانت مصبِية. فقالت: أخاف أن يَضْغُوَ صِبْيَتِي عند رأسك. فحمِدها ودعا لها.\n\nومنهنّ: امرأة لم يُذكر اسمها. قال مجاهد: \" خطب رسول الله صلى الله عليه وسلم امرأة فقالت: أستأمر أبي. فلقِيت أباها فأذن لها، فلقِيت رسول الله صلى الله عليه وسلم فقال: «قد التحفنا لحافاً غيرك» \". فهؤلاء جميع أزواج النبي صلى الله عليه وسلم.\n\nوكان له من السَّراري سُرِّيتان: مارِية القبطية، ورَيْحانة؛ في قول قتادة. وقال غيره: كان له أربع: مارية، ورَيحانة، وأخرى جميلة أصابها في السَّبْي، وجاريةٌ وهبتها له زينب بنت جحش.\n\nالثالثة: قوله تعالى: { إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَاةَ ٱلدُّنْيَا وَزِينَتَهَا } «إِنْ» شرط، وجوابه «فَتَعَالَيْنَ»؛ فعلق التخيير على شرط. وهذا يدل على أن التخيير والطلاق المعلقين على شرط صحيحان، فينفذان ويمضيان؛ خلافاً للجهال المبتدعة الذين يزعمون أن الرجل إذا قال لزوجته: أنتِ طالق إن دخلتِ الدار، أنه لا يقع الطلاق إن دخلت الدار؛ لأن الطلاق الشرعيّ هو المنجَّز في الحال لا غير.\n\nالرابعة: قوله تعالى: { فَتَعَالَيْنَ } هو جواب الشرط، وهو فعل جماعة النساء، من قولك تعالى؛ وهو دعاء إلى الإقبال إليه يقال: تعالى بمعنى أقبل، وُضع لمن له جلالة ورفعة، ثم صار في الاستعمال لكل داع إلى الإقبال، وأما في هذا الموضع فهو على أصله؛ فإن الداعي هو رسول الله صلى الله عليه وسلم. { أُمَتِّعْكُنَّ } قد تقدّم الكلام في المُتْعة في «البقرة». وقرىء «أُمَتِّعُكُنَّ» بضم العين. وكذا «وَأُسَرِّحُكُنّ» بضم الحاء على الاستئناف. والسراح الجميل؛ هو أن يكون طلاقاً للسنة من غير ضرار ولا منع واجب لها.\n\nالخامسة: اختلف العلماء في كيفية تخيير النبيّ صلى الله عليه وسلم أزواجه على قولين: الأوّل: أنه خيّرهنّ بإذن الله تعالى في البقاء على الزوجية أو الطلاق، فاخترن البقاء؛ قالته عائشة ومجاهد وعكرمة والشعبِيّ وابن شهاب وربيعة. ومنهم من قال: إنما خيرهنّ بين الدنيا فيفارقهنّ، وبين الآخرة فيمسكهنّ؛ لتكون لهنّ المنزلة العليا كما كانت لزوجهنّ؛ ولم يخيرهنّ في الطلاق؛ ذكره الحسن وقتادة. ومن الصحابة عليّ فيما رواه عنه أحمد بن حنبل أنه قال: لم يخيّر رسول الله صلى الله عليه وسلم نساءه إلا بين الدنيا والآخرة.\n\nقلت: القول الأوّل أصح؛ لقول عائشة رضي الله عنها لما سئلت عن الرجل يخير امرأته فقالت: قد خيّرنا رسول الله صلى الله عليه وسلم أفكان طلاقا! في رواية: فاخترناه فلم يعدّه طلاقاً.\n\n                                   ولم يثبت عن رسول الله صلى الله عليه وسلم إلا التخيير المأمور بين البقاء والطلاق؛ لذلك قال: \" يا عائشة إني ذاكر لكِ أمراً فلا عليك ألاّ تعجلي فيه حتى تستأمري أبويك \" الحديث. ومعلوم أنه لم يرد الاستئمار في اختيار الدنيا وزينتها على الآخرة. فثبت أن الاستئمار إنما وقع في الفرقة، أو النكاح. والله أعلم.\n\nالسادسة: اختلف العلماء في المخيَّرة إذا اختارت زوجها؛ فقال جمهور العلماء من السلف وغيرهم وأئمة الفتوى: إنه لا يلزمه طلاق، لا واحدة ولا أكثر؛ هذا قول عمر بن الخطاب وعليّ وابن مسعود وزيد بن ثابت وابن عباس وعائشة. ومن التابعين عطاء ومسروق وسليمان بن يسار وربيعة وابن شهاب. وروي عن عليّ وزيد أيضاً: إن اختارت زوجها فواحدة بائنة؛ وهو قول الحسن البصريّ والليث، وحكاه الخطابي والنقاش عن مالك. وتعلقوا بأن قوله: اختاري، كناية عن إيقاع الطلاق، فإذا أضافه إليها وقعت طلقة؛ كقوله: أنتِ بائن. والصحيح الأوّل؛ لقول عائشة: خيّرنا رسول الله صلى الله عليه وسلم فاخترناه فلم يعدّه علينا طلاقاً. أخرجه الصحيحان. قال ابن المنذر: وحديث عائشة يدل على أن المخيّرة إذا اختارت زوجها لم يكن ذلك طلاقاً، ويدل على أن اختيارها نفسها يوجب الطلاق، ويدل على معنى ثالث، وهو أن المخيَّرة إذا اختارت نفسها أنها تطليقة يملك زوجها رجعتها؛ إذ غير جائز أن يطلق رسول الله صلى الله عليه وسلم بخلاف ما أمره الله. وروي هذا عن عمر وابن مسعود وابن عباس. وبه قال ابن أبي ليلى والثوريّ والشافعيّ. وروي عن عليّ أنها إذا اختارت نفسها أنها واحدة بائنة. وهو قول أبي حنيفة وأصحابه. ورواه ابن خُوَيْزِمَنْدَاد عن مالك. وروي عن زيد بن ثابت أنها إذا اختارت نفسها أنها ثلاث. وهو قول الحسن البصريّ، وبه قال مالك والليث؛ لأن المِلك إنما يكون بذلك. وروي عن عليّ رضي الله عنه أنها إذا اختارت نفسها فليس بشيء. وروي عنه أنها إذا اختارت زوجها فواحدة رجعية.\n\nالسابعة: ذهب جماعة من المدنيّين وغيرهم إلى أن التمليك والتخيير سواء، والقضاء ما قضت فيهما جميعاً؛ وهو قول عبد العزيز بن أبي سلمة. قال ابن شعبان: وقد اختاره كثير من أصحابنا، وهو قول جماعة من أهل المدينة. قال أبو عمر: وعلى هذا القول أكثر الفقهاء. والمشهور من مذهب مالك الفرق بينهما؛ وذلك أن التمليك عند مالك هو قول الرجل لامرأته: قد ملّكتك؛ أي قد ملّكتك ما جعل الله لي من الطلاق واحدة أو اثنتين أو ثلاثاً؛ فلما جاز أن يملّكها بعض ذلك دون بعض وادعى ذلك، كان القولُ قولَه مع يمينه إذا ناكرها. وقالت طائفة من أهل المدينة: له المناكرة في التمليك وفي التخيير سواء في المدخول بها. والأوّل قول مالك في المشهور.\n\n                                   وروى ابن خُوَيْزِمَنْدَاد عن مالك أن للزوج أن يناكر المخيَّرة في الثلاث، وتكون طلقة بائنة كما قال أبو حنيفة. وبه قال أبو الجَهْم. قال سُحْنون: وعليه أكثر أصحابنا.\n\nوتحصيل مذهب مالك: أن المخيّرة إذا اختارت نفسها وهي مدخول بها فهو الطلاق كله، وإن أنكر زوجها فلا نكرة له. وإن اختارت واحدة فليس بشيء، وإنما الخيار البتات، إما أخذته وإما تركته؛ لأن معنى التخيير التسريح، قال الله تعالى في آية التخيير:\n{ فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحاً جَمِيلاً }\n[الأحزاب: 28] فمعنى التسريح البتات، قال الله تعالى:\n{ ٱلطَّلاَقُ مَرَّتَانِ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ }\n[البقرة: 229]. والتسريح بإحسان هو الطلقة الثالثة؛ روي ذلك عن النبيّ صلى الله عليه وسلم كما تقدّم. ومن جهة المعنى أن قوله: اختاريني أو اختاري نفسك يقتضي ألاّ يكون له عليها سبيل إذا اختارت نفسها، ولا يملك منها شيئاً؛ إذ قد جعل إليها أن تخرج ما يملكه منها أو تقيم معه إذا اختارته، فإذا اختارت البعض من الطلاق لم تعمل بمقتضى اللفظ، وكانت بمنزل من خُيّر بين شيئين فاختار غيرهما. وأما التي لم يدخل بها فله مناكرتها في التخيير والتمليك إذا زادت على واحدة؛ لأنها تبِين في الحال.\n\nالثامنة: اختلفت الرواية عن مالك متى يكون لها الخيار؛ فقال مرة: لها الخيار ما دامت في المجلس قبل القيام أو الاشتغال بما يدل على الإعراض. فإن لم تختر ولم تقض شيئاً حتى افترقا من مجلسهما بطل ما كان من ذلك إليها؛ وعلى هذا أكثر الفقهاء. وقال مرة: لها الخيار أبداً ما لم يعلم أنها تركت؛ وذلك يُعلم بأن تمكّنه من نفسها بوطء أو مباشرة؛ فعلى هذا إن منعت نفسها ولم تختر شيئاً كان له رفعهاإلى الحاكم لتوقع أو تسقط، فإن أبت أسقط الحاكم تمليكها. وعلى القول الأول إذا أخذت في غير ذلك من حديث أو عمل أو مشي أو ما ليس في التخيير بشيء كما ذكرنا سقط تخييرها. واحتج بعض أصحابنا لهذا القول بقوله تعالى :\n{ فَلاَ تَقْعُدُواْ مَعَهُمْ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيْرِهِ }\n[النساء: 140]. وأيضاً فإن الزوج أطلق لها القول ليعرف الخيار منها، فصار كالعقد بينهما، فإن قبلته وإلا سقط؛ كالذي يقول: قد وهبت لك أو بايعتك، فإن قبل وإلا كان الملك باقياً بحاله. هذا قول الثوريّ والكوفيين والأوزاعيّ والليث والشافعي وأبي ثور، وهو اختيار ابن القاسم. ووجه الرواية الثانية أن ذلك قد صار في يدها وملَكَته على زوجها بتمليكه إياها فلما ملكت ذلك وجب أن يبقى في يدها كبقائه في يد زوجها.\n\nقلت: وهذا هو الصحيح \" لقوله عليه السلام لعائشة: «إني ذاكر لك أمراً فلا عليك ألا تستعجلي حتى تستأمري أبويك» \" رواه الصحيح، وخرّجه البخاريّ، وصححه الترمذيّ. وقد تقدم في أول الباب. وهو حجة لمن قال: إنه إذا خيّر الرجل امرأته أو ملّكها أن لها أن تقضي في ذلك وإن افترقا من مجلسهما؛ روي هذا عن الحسن والزُّهريّ، وقاله مالك في إحدى روايتيه. قال أبو عبيد: والذي عندنا في هذا الباب، اتباع السنة في عائشة في هذا الحديث، حين جعل لها التخيير إلى أن تستأمر أبويها، ولم يجعل قيامها من مجلسها خروجاً من الأمر. قال المَرْوزِيّ: هذا أصح الأقاويل عندي، وقاله ابن المنذر والطّحاويّ.\n\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ إِن كُنتُنَّ تُرِدۡنَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا فَتَعَالَيۡنَ أُمَتِّعۡكُنَّ وَأُسَرِّحۡكُنَّ سَرَاحٗا جَمِيلٗا ٨٢\n                                        \n                                        \n                                        \n                                        لما اجتمع نساء رسول اللّه صلى اللّه عليه وسلم في الغيرة، وطلبن منه النفقة والكسوة، طلبن منه أمراً لا يقدر عليه في كل وقت، ولم يزلن في طلبهن متفقات، في مرادهن متعنتات، فشَقَّ ذلك على الرسول، حتى وصلت به الحال إلى أنه آلى منهن شهراً. فأراد اللّه أن يسهل الأمر على رسوله، وأن يرفع درجة زوجاته، ويُذْهِبَ عنهن كل أمر ينقص أجرهن، فأمر رسوله أن يخيرهن فقال: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَاةَ ٱلدُّنْيَا } أي: ليس لكن في غيرها مطلب، وصرتن ترضين لوجودها، وتغضبن لفقدها، فليس لي فيكن أرب وحاجة، وأنتن بهذه الحال. { فَتَعَالَيْنَ أُمَتِّعْكُنَّ } شيئاً مما عندي من الدنيا { وَأُسَرِّحْكُنَّ } أي: أفارقكن { سَرَاحاً جَمِيلاً } من دون مغاضبة ولا مشاتمة، بل بسعة صدر، وانشراح بال، قبل أن تبلغ الحال إلى ما لا ينبغي. { وَإِن كُنتُنَّ تُرِدْنَ ٱللَّهَ وَرَسُولَهُ وَٱلدَّارَ ٱلآخِرَةَ } أي: هذه الأشياء مرادكن، وغاية مقصودكن، وإذا حصل لَكُنَّ اللّه ورسوله والجنة، لم تبالين بسعة الدنيا وضيقها، ويسرها وعسرها، وقنعتن من رسول اللّه بما تيسر، ولم تطلبن منه ما يشق عليه، { فَإِنَّ ٱللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنكُنَّ أَجْراً عَظِيماً } رتب الأجر على وصفهن بالإحسان، لأنه السبب الموجب لذلك، لا لكونهن زوجات للرسول، فإن مجرد ذلك لا يكفي، بل لا يفيد شيئاً مع عدم الإحسان، فخيَّرهن رسول اللّه صلى اللّه عليه وسلم في ذلك، فاخترن اللّه ورسوله والدار الآخرة كلهن، ولم يتخلف منهن واحدة، رضي اللّه عنهن. وفي هذا التخيير فوائد عديدة: منها: الاعتناء برسوله وغيرته عليه، أن يكون بحالة يشق عليه كثرة مطالب زوجاته الدنيوية. ومنها: سلامته صلى اللّه عليه وسلم بهذا التخيير من تبعة حقوق الزوجات، وأنه يبقى في حرية نفسه، إن شاء أعطى، وإن شاء منع\n{ مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ ٱللَّهُ لَهُ }\n[الأحزاب: 38]. ومنها: تنزيهه عما لو كان فيهن من تؤثر الدنيا على اللّه ورسوله والدار الآخرة عنها، وعن مقارنتها. ومنها: سلامة زوجاته رضي اللّه عنهن عن الإثم والتعرض لسخط اللّه ورسوله. فحسم اللّه بهذا التخيير عنهن التسخط على الرسول، الموجب لسخطه، المسخط لربه، الموجب لعقابه. ومنها: إظهار رفعتهن وعلو درجتهن، وبيان علو هممهن، أن كان اللّه ورسوله والدار الآخرة، مرادهن ومقصودهن، دون الدنيا وحطامها. ومنها: استعدادهن بهذا الاختيار، للأمر الخيار، للوصول إلى خيار درجات الجنة، وأن يكُنَّ زوجاته في الدنيا والآخرة. ومنها: ظهور المناسبة بينه وبينهن، فإنه أكمل الخلق، وأراد اللّه أن تكون نساؤه كاملات مكملات، طيبات مطيبات\n{ ٱلطَّيِّبَاتُ لِلطَّيِّبِينَ وَٱلطَّيِّبُونَ لِلْطَّيِّبَاتِ }\n[النور: 26]. ومنها: أن هذا التخيير داع، وموجب للقناعة التي يطمئن لها القلب، وينشرح لها الصدر، ويزول عنهن جشع الحرص، وعدم الرضا الموجب لقلق القلب واضطرابه، وهمه وغمه. ومنها: أن يكون اختيارهن هذا، سبباً لزيادة أجرهن ومضاعفته، وأن يَكُنَّ بمرتبة ليس فيها أحد من النساء، ولهذا قال: { يٰنِسَآءَ ٱلنَّبِيِّ مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ يُضَاعَفْ... }.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ إِن كُنتُنَّ تُرِدۡنَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا فَتَعَالَيۡنَ أُمَتِّعۡكُنَّ وَأُسَرِّحۡكُنَّ سَرَاحٗا جَمِيلٗا ٨٢"
    },
    {
      "number": 3562,
      "text": "وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الْآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 29,
      "juz": 21,
      "manzil": 5,
      "page": 421,
      "ruku": 364,
      "hizbQuarter": 168,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن كُنتُنَّ تُرِدۡنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلۡأٓخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلۡمُحۡسِنَٰتِ مِنكُنَّ أَجۡرًا عَظِيمٗا ٩٢\n                                    \n                                    \n                                    هذا أمر من الله تبارك وتعالى لرسوله صلى الله عليه وسلم بأن يخير نساءه بين أن يفارقهن، فيذهبن إلى غيره ممن يحصل لهن عنده الحياة الدنيا وزينتها، وبين الصبر على ما عنده من ضيق الحال، ولهن عند الله تعالى في ذلك الثواب الجزيل، فاخترن رضي الله عنهنّ وأرضاهن الله ورسوله والدار الآخرة، فجمع الله تعالى لهن بعد ذلك بين خير الدنيا وسعادة الآخرة. قال البخاري حدثنا أبو اليمان، أخبرنا شعيب عن الزهري قال أخبرني أبو سلمة بن عبد الرحمن أن عائشة رضي الله عنها زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم جاءها حين أمره الله تعالى أن يخير أزواجه، قالت فبدأ بي رسول الله صلى الله عليه وسلم فقال \" إني ذاكر لك أمراً، فلا عليك أن تستعجلي حتى تستأمري أبويك \" وقد علم أن أبوي لم يكونا يأمراني بفراقه، قالت ثم قال \" إن الله تعالى قال { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ } \" إلى تمام الآيتين، فقلت له ففي أي هذا أستأمر أبوي؟ فإني أريد الله ورسوله والدار الآخرة. وكذا رواه معلقاً عن الليث حدثني يونس عن الزهري عن أبي سلمة عن عائشة رضي الله عنها، فذكره، وزاد قالت ثم فعل أزواج النبي صلى الله عليه وسلم مثل مافعلت، وقد حكى البخاري أن معمراً اضطرب فيه، فتارة رواه عن الزهري عن أبي سلمة، وتارة رواه عن الزهري عن عروة عن عائشة رضي الله عنها. وقال ابن جرير حدثنا أحمد بن عبدة الضبي، حدثنا أبو عوانة عن عمر بن أبي سلمة عن أبيه قال قالت عائشة رضي الله عنها لما نزل الخيار، قال لي رسول الله صلى الله عليه وسلم \" إني أريد أن أذكر لك أمراً، فلا تقضي فيه شيئاً حتى تستأمري أبويك \" قالت قلت وما هو يارسول الله؟ قالت فرده عليها، فقالت وما هو يارسول الله؟ قالت فرده عليها، فقالت وما هو يارسول الله؟ قالت فقرأ صلى الله عليه وسلم عليها { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ } إلى آخر الآية، قالت فقلت بل نختار الله ورسوله والدار الآخرة، قالت ففرح بذلك النبي صلى الله عليه وسلم وحدثنا ابن وكيع، حدثنا محمد بن بشر عن محمد بن عمرو عن أبي سلمة عن عائشة رضي الله عنها قالت لما نزلت آية التخيير، بدأ بي رسول الله صلى الله عليه وسلم فقال \" ياعائشة إني عارض عليك أمراً، فلا تفتاتي فيه بشيء حتى تعرضيه على أبويك أبي بكر وأم رومان رضي الله عنهما \"\n                                    ، فقالت يارسول الله وما هو؟ قال صلى الله عليه وسلم \" قال الله عز وجل { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحاً جَمِيلاً وَإِن كُنتُنَّ تُرِدْنَ ٱللَّهَ وَرَسُولَهُ وَٱلدَّارَ ٱلأَخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلْمُحْسِنَـٰتِ مِنكُنَّ أَجْرًا عَظِيمًا } \" قالت فإني أريد الله ورسوله والدار الآخرة، ولا أؤامر في ذلك أبوي أبا بكر وأم رومان رضي الله عنهما. فضحك رسول الله صلى الله عليه وسلم ثم استقرأ الحجر، فقال \" إن عائشة، رضي الله عنها ــــ قالت كذا وكذا \" ، فقلن ونحن نقول مثلما قالت عائشة. رضي الله عنهن كلهن. رواه ابن أبي حاتم عن أبي سعيد الأشج عن أبي أسامة عن محمد بن عمرو به. قال ابن جرير وحدثنا سعيد بن يحيى الأموي، حدثنا أبي حدثنا محمد بن إِسحاق عن عبد الله بن أبي بكر عن عمرة عن عائشة رضي الله عنها قالت إِن رسول الله صلى الله عليه وسلم لما نزل ـــ إلى نسائه أمر أن يخيرهن، فدخل علي فقال \" سأذكر لك أمراً، فلا تعجلي حتى تستشيري أباك \" فقلت وما هو يارسول الله؟ قال \" إِني أمرت أن أخيركن \" وتلا عليها آية التخيير إِلى آخر الآيتين، قالت فقلت وما الذي تقول لاتعجلي حتى تستشيري أباك؟ فإِني أختار الله ورسوله. فسر صلى الله عليه وسلم بذلك، وعرض على نسائه، فتتابعن كلهن، فاخترن الله ورسوله صلى الله عليه وسلم وقال ابن أبي حاتم حدثنا يزيد بن سنان البصري، حدثنا أبو صالح عبد الله بن صالح، حدثني الليث، حدثني عقيل عن الزهري، أخبرني عبد الله بن عبد الله بن أبي ثور عن ابن عباس رضي الله عنهما قال قالت عائشة رضي الله عنها أنزلت آية التخيير، فبدأ بي أول امرأة من نسائه، فقال صلى الله عليه وسلم \" إِني ذاكر لك أمراً، فلا عليك أن تعجلي حتى تستأمري أبويك \" قالت وقد علم أن أبوي لم يكونا يأمراني بفراقه، قالت ثم قال \" إِن الله تبارك وتعالى قال { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ } \" الآيتين، قالت عائشة رضي الله عنها فقلت أفي هذا أستأمر أبوي؟ فإِني أريد الله ورسوله والدار الآخرة. ثم خير نساءه كلهن، فقلن مثل ما قالت عائشة رضي الله عنهن، وأخرجه البخاري ومسلم جميعاً عن قتيبة عن الليث عن الزهري عن عروة عن عائشة رضي الله عنها مثله. وقال الإمام أحمد حدثنا أبو معاوية، حدثنا الأعمش عن مسلم بن صبيح عن مسروق عن عائشة رضي الله عنها قالت خيرنا رسول الله صلى الله عليه وسلم فاخترناه، فلم يعدها علينا شيئاً، أخرجاه من حديث الأعمش.\n                                    وقال الإمام أحمد حدثنا أبو عامر عبد الملك بن عمرو، حدثنا زكريا بن إِسحاق عن أبي الزبير عن جابر رضي الله عنه قال أقبل أبو بكر رضي الله عنه يستأذن رسول الله صلى الله عليه وسلم والناس ببابه جلوس، والنبي صلى الله عليه وسلم جالس، فلم يؤذن له، ثم أقبل عمر رضي الله عنه، فاستأذن فلم يؤذن له، ثم أذن لأبي بكر وعمر رضي الله عنهما، فدخلا والنبي صلى الله عليه وسلم جالس، وحوله نساؤه، وهو صلى الله عليه وسلم ساكت، فقال عمر رضي الله عنه لأكلمن النبي صلى الله عليه وسلم لعله يضحك، فقال عمر رضي الله عنه يارسول الله لو رأيت ابنة زيد ــــ امرأة عمر ــــ سألتني النفقة آنفاً، فوجأت عنقها، فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه، وقال \" هن حولي يسألنني النفقة \" فقام أبو بكر رضي الله عنه إِلى عائشة ليضربها، وقام عمر رضي الله عنه إِلى حفصة، كلاهما يقولان تسألان النبي صلى الله عليه وسلم ما ليس عنده، فنهاهما رسول الله صلى الله عليه وسلم فقلن والله لانسأل رسول الله صلى الله عليه وسلم بعد هذا المجلس ما ليس عنده، قال وأنزل الله عز وجل الخيار، فبدأ بعائشة رضي الله عنها فقال \" إِني أذكر لك أمراً ما أحب أن تعجلي فيه حتى تستأمري أبويك \" قالت وما هو؟ قال فتلا عليها { يٰأَيُّهَا ٱلنَّبِىُّ قُل لأَِزْوَٰجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَوٰةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ } الآية، قالت عائشة رضي الله عنها أفيك أستأمر أبوي؟ بل أختار الله تعالى ورسوله، وأسألك أن لا تذكر لامرأة من نسائك ما اخترت، فقال صلى الله عليه وسلم \" إِن الله تعالى لم يبعثني معنفاً، ولكن بعثني معلماً ميسراً، لا تسألني امرأة منهن عما اخترت إِلا أخبرتها \" انفرد بإِخراجه مسلم دون البخاري، فرواه هو والنسائي من حديث زكريا بن إِسحاق المكي به. وقال عبد الله بن الإمام أحمد حدثنا سريج بن يونس، حدثنا علي بن هشام بن البريد عن محمد بن عبيد الله ابن علي بن أبي رافع، عن عثمان بن علي بن الحسين عن أبيه عن علي رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم خير نساءه الدنيا والآخرة، ولم يخيرهن الطلاق، وهذا منقطع. وقد روي عن الحسن وقتادة وغيرهما نحو ذلك، وهو خلاف الظاهر من الآية، فإِنه قال { فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحاً جَمِيلاً } أي أعطيكن حقوقكن، وأطلق سراحكن، وقد اختلف العلماء في جواز تزوج غيره لهن، لو طلقهن، على قولين، أصحهما نعم، لو وقع ليحصل المقصود من السراح، والله أعلم. قال عكرمة وكان تحته يومئذ تسع نسوة خمس من قريش عائشة وحفصة وأم حبيبة وسودة وأم سلمة رضي الله عنهن، وكانت تحته صلى الله عليه وسلم صفية بنت حيي النضيرية، وميمونة بنت الحارث الهلالية، وزينب بنت جحش الأسدية، وجويرية بنت الحارث المصطلقية، رضي الله عنهن وأرضاهن جميعاً.\n                                    ",
        "qortoby": "وَإِن كُنتُنَّ تُرِدۡنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلۡأٓخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلۡمُحۡسِنَٰتِ مِنكُنَّ أَجۡرًا عَظِيمٗا ٩٢\n                                    \n                                    \n                                    فيه ثماني مسائل:\n\nالأولى: قوله تعالى: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ } قال علماؤنا: هذه الآية متصلة بمعنى ما تقدّم من المنع من إيذاء النبيّ صلى الله عليه وسلم؛ وكان قد تأذى ببعض الزوجات. قيل: سألنَه شيئاً من عرَض الدنيا. وقيل: زيادة في النفقة. وقيل: آذَيْنَه بغيْرة بعضهنّ على بعض. وقيل: أمِر صلى الله عليه وسلم بتلاوة هذه الآية عليهنّ وتخييرهنّ بين الدنيا والآخرة. وقال الشافعيّ رحمه الله تعالى: إن مَنْ مَلَك زوجة فليس عليه تخييرها. أمِر صلى الله عليه وسلم أن يخيّر نساءه فاخترنه. وجملة ذلك أن الله سبحانه خيّر النبيّ صلى الله عليه وسلم بين أن يكون نبيًّا ملِكاً وعرض عليه مفاتيح خزائن الدنيا، وبين أن يكون نبيًّا مِسكيناً؛ فشاور جبريل فأشار عليه بالمسكنة فاختارها؛ فلما اختارها وهي أعلى المنزلتين، أمره الله عز وجل أن يخيّر زوجاته؛ فربما كان فيهنّ من يكره المقام معه على الشدّة تنزيهاً له. وقيل: إن السبب الذي أُوجِب التخيير لأجله، أن امرأة من أزواجه سألته أن يصوغ لها حَلْقة من ذهب، فصاغ لها حلقة من فضة وطلاها بالذهب ـ وقيل بالزعفران ـ فأبت إلا أن تكون من ذهب؛ فنزلت آية التخيير فخيَّرهنّ، فقلن اخترنا الله ورسوله. وقيل: إن واحدة منهنّ اختارت الفراق. فالله أعلم. روى البخاريّ ومسلم ـ واللفظ لمسلم ـ \" عن جابر بن عبد الله قال: دخل أبو بكر يستأذن على رسول الله صلى الله عليه وسلم، فوجد الناس جلوساً ببابه لم يؤذن لأحد منهم، قال: ـ فأذِن لأبي بكر فدخل، ثم جاء عمر فاستأذن فأذِن له، فوجد النبيّ صلى الله عليه وسلم جالساً حوله نساؤه واجماً ساكتاً ـ قال: ـ فقال والله لأقولنّ شيئاً أضحك رسولَ الله صلى الله عليه وسلم، فقال: يا رسول الله، لو رأيت بنت خارجة سألتني النفقة فقمتُ إليها فَوَجَأْتُ عنقها؛ فضحك رسول الله صلى الله عليه وسلم وقال: «هنّ حولي كما ترى يسألنَني النفقة» فقام أبو بكر إلى عائشة يَجَأُ عنقها، وقام عمر إلى حفصة يَجَأ عنقها؛ كلاهما يقول: تسألن رسول الله صلى الله عليه وسلم ما ليس عنده!! فقلن: واللَّهِ لا نسأل رسول الله صلى الله عليه وسلم شيئاً أبداً ليس عنده. ثم اعتزلهنّ شهراً أو تسعاً وعشرين. ثم نزلت عليه هذه الآية: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ ـ حتى بلغ ـ لِلْمُحْسِنَاتِ مِنكُنَّ أَجْراً عَظِيماً }. قال: فبدأ بعائشة فقال: «يا عائشة، إني أريد أن أعرِض عليك أمراً أحِبُّ ألا تعجلي فيه حتى تستشيري أبويك» قالت: وما هو يا رسول الله؟ فتلا عليها الآية. قالت: أفيك يا رسول الله أستشير أبوي! بل أختار الله ورسوله والدار الآخرة، وأسألك ألا تخبر امرأة من نسائك بالذي قلت. قال: «لا تسألني امرأة منهن إلا أخبرتها، إنّ الله لم يبعثني مُعَنتاً ولا مُتَعنِّتاً ولكن بعثني معلماً مُيَسِّراً» \"\n                                   وروى الترمذي \" عن عائشة رضي الله عنها قالت: أمِر رسول الله صلى الله عليه وسلم بتخيير أزواجه بدأ بي فقال: «يا عائشة، إني ذاكر لكِ أمراً فلا عليكِ ألا تستعجلي حتى تستأمري أبويْك» قالت: وقد عَلم أن أبويّ لم يكونا ليأمراني بفراقه؛ قالت ثم قال: «إنّ الله يقول: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَاةَ ٱلدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحاً جَمِيلاً ـ حتى بلغ ـ لِلْمُحْسِنَاتِ مِنكُنَّ أَجْراً عَظِيماً } » فقلت: أفي هذا أستأمر أبوي فإني أريد الله ورسوله والدار الآخرة، وفعل أزواج النبيّ صلى الله عليه وسلم مثل ما فعلت \" قال: هذا حديث حسن صحيح. قال العلماء: وأما أمر النبيّ صلى الله عليه وسلم عائشة أن تشاور أبويها لأنه كان يحبها، وكان يخاف أن يحملها فرط الشباب على أن تختار فِراقه، ويعلم من أبويها أنهما لا يشيران عليها بفراقه.\n\nالثانية: قوله تعالى: { قُل لأَزْوَاجِكَ } كان للنبيّ صلى الله عليه وسلم أزواج، منهن من دخل بها، ومنهن من عقد عليها ولم يدخل بها، ومنهن من خطبها فلم يتم نكاحه معها.\n\nفأوّلهنّ: خديجة بنت خُوَيلد بن أسد بن عبد العُزّى بن قُصَيّ بن كِلاب. وكانت قبله عند أبي هالة واسمه زرارة بن النبّاش الأسدي، وكانت قبله عند عتيق بن عائذ، وَلدت منه غلاماً اسمه عبد مناف. وولدت من أبي هالة هند بن أبي هالة، وعاش إلى زمن الطاعون فمات فيه. ويقال: إن الذي عاش إلى زمن الطاعون هند بن هند، وسُمعت نادبته تقول حين مات: واهندُ ابن هنداه، واربِيبَ رسول الله. ولم يتزوج رسول الله صلى الله عليه وسلم على خديجة غيرها حتى ماتت. وكانت يوم تزوّجها رسول الله صلى الله عليه وسلم بنت أربعين سنة، وتوفيت بعد أن مضى من النبوّة سبع سنين، وقيل: عشر. وكان لها حين توفيت خمس وستون سنة. وهي أول امرأة آمنت به. وجميع أولاده منها غير إبراهيم. قال حكيم بن حزام: توفيت خديجة فخرجنا بها من منزلها حتى دفنّاها بالحَجُون؛ ونزل رسول الله صلى الله عليه وسلم في حفرتها، ولم تكن يومئذٍ سُنَّةُ الجنازة الصلاةَ عليها.\n\nومنهن: سَوْدة بنت زَمْعة بن قيس بن عبد شمس العامرية، أسلمت قديماً وبايعت، وكانت عند ابن عمّ لها يقال له السكران بن عمرو؛ وأسلم أيضاً، وهاجرا جميعاً إلى أرض الحبشة في الهجرة الثانية، فلما قدما مكة مات زوجها. وقيل: مات بالحبشة؛ فلما حلّت خطبها رسول الله صلى الله عليه وسلم، فتزوّجها ودخل بها بمكة، وهاجر بها إلى المدينة؛ فلما كبرت أراد طلاقها فسألته ألاّ يفعل وأن يدعها في نسائه، وجعلت ليلتها لعائشة ـ حسبما هو مذكور في الصحيح ـ فأمسكها، وتوفيت بالمدينة في شوّال سنة أربع وخمسين.\n                                   ومنهن: عائشة بنت أبي بكر الصدّيق، وكانت مسماة لجُبير بن مطعِم، فخطبها رسول الله صلى الله عليه وسلم؛ فقال أبو بكر: يا رسول الله، دَعْني أسُلّها من جُبير سَلاًّ رفِيقاً؛ فتزوّجها رسول الله صلى الله عليه وسلم بمكة قبل الهجرة بسنتين، وقيل بثلاث سنين؛ وبنى بها بالمدينة وهي بنت تسع، وبقيت عنده تسع سنين، ومات رسول الله صلى الله عليه وسلم وهي بنت ثمان عشرة، ولم يتزوج بِكراً غيرها، وماتت سنة تسع وخمسين، وقيل ثمان وخمسين.\n\nومنهن: حفصة بنت عمر بن الخطاب القُرَشِية العدويّة، تزوّجها رسول الله صلى الله عليه وسلم ثم طلقها، فأتاه جبريل فقال: «إن الله يأمرك أن تراجع حفصة فإنها صوّامة قوّامة» فراجعها. قال الواقديّ: وتوفيت في شعبان سنة خمس وأربعين في خلافة معاوية، وهي ابنة ستين سنة. وقيل: ماتت في خلافة عثمان بالمدينة.\n\nومنهن: أم سلمة، واسمها هند بنت أبي أميّة المخزومية ـ واسم أبي أمية سُهيل ـ تزوّجها رسول الله صلى الله عليه وسلم في ليال بقين من شوّال سنة أربع، زوّجها منه ابنها سلمة على الصحيح، وكان عُمَرُ ابنُها صغيراً، وتوفيت في سنة تسع وخمسين. وقيل: سنة ثنتين وستين؛ والأول أصح. وصلّى عليها سعيد بن زيد. وقيل أبو هريرة. وقُبِرت بالبقِيع وهي ابنة أربع وثمانين سنة.\n\nومنهنّ: أم حبيبة، واسمها رَمْلة بنت أبي سفيان. بعث رسول الله صلى الله عليه وسلم عمرو بن أمية الضَّمْريّ إلى النجاشيّ، ليخطب عليه أم حبيبة فزوجه إياها، وذلك سنة سبع من الهجرة، وأصدق النجاشيّ عن رسول الله صلى الله عليه وسلم أربعمائة دينار، وبعث بها مع شُرحبيل بن حَسَنة، وتوفيت سنة أربع وأربعين. وقال الدَّارَقُطْنِيّ: كانت أم حبيبة تحت عبيد الله بن جحش فمات بأرض الحبشة على النصرانية، فزوّجها النجاشيّ النبيّ صلى الله عليه وسلم، وأمهرها عنه أربعة آلاف، وبعث بها إليه مع شُرحبيل بن حسنة.\n\nومنهنّ: \" زينب بنت جَحْش بن رِئاب الأسديّة؛ وكان اسمها بَرّة فسماها رسول الله صلى الله عليه وسلم زينب، وكان اسم أبيها بُرّة؛ فقالت: يا رسول الله، بدّل اسم أبي فإن البُرّة حقيرة؛ فقال لها النبيّ صلى الله عليه وسلم: «لو كان أبوك مؤمناً سميناه باسم رجل منا أهل البيت ولكني قد سميته جحشاً والجحش من البُرّة» \" ذكر هذا الحديث الدَّارَقُطْنِيّ. تزوّجها رسول الله صلى الله عليه وسلم بالمدينة في سنة خمس من الهجرة، وتوفيت سنة عشرين، وهي بنت ثلاث وخمسين.\n\nومنهنّ: زينب بنت خُذيمة بن الحارث (ابن عبد الله) بن عمرو بن عبد مناف بن هلال بن عامر بن صَعْصعة الهلالية، كانت تسمى في الجاهلية أمّ المساكين؛ لإطعامها إياهم.\n                                   تزوّجها رسول الله صلى الله عليه وسلم في رمضان على رأس واحد وثلاثين شهراً من الهجرة، فمكثت عنده ثمانية أشهر، وتوفيت في حياته في آخر ربيع الأوّل على رأس تسعة وثلاثين شهراً؛ ودفنت بالبقيع.\n\nومنهنّ: جُوَيرية بنت الحارث بن أبي ضِرار الخُزاعية المُصْطَلِقيّة، أصابها في غزوة بني المُصْطَلِق فوقعت في سهم ثابت بن قيس بن شَمّاس فكاتبها؛ فقضى رسول الله صلى الله عليه وسلم كتابتها وتزوّجها، وذلك في شعبان سنة ست، وكان اسمها بُرّة فسمّاها رسول الله صلى الله عليه وسلم جُوَيرية، وتوفيت في ربيع الأول سنة ست وخمسين. وقيل: سنة خمسين، وهي ابنة خمس وستين.\n\nومنهن: صفية بنت حُيَيّ بن أخْطَب الهارونية، سباها النبيّ صلى الله عليه وسلم يوم خَيْبر واصطفاها لنفسه، وأسلمت وأعتقها، وجعل عتقها صداقها. وفي الصحيح: أنها وقعت في سهم دِحْيَة الكَلْبيّ فاشتراها رسول الله صلى الله عليه وسلم بسبعة أرؤس، وماتت في سنة خمسين. وقيل: سنة اثنتين وخمسين، ودفنت بالبقيع.\n\nومنهن: رَيحانة بنت زيد بن عمرو بن خُنافة من بني النَّضير، سباها رسول الله صلى الله عليه وسلم وأعتقها، وتزوّجها في سنة ست، وماتت مرْجِعَه من حَجة الوَداع، فدفنها بالبقيع. وقال الواقديّ: ماتت سنة ست عشرة وصلّى عليها عمر. قال أبو الفرج الجَوْزِيّ: وقد سمعت من يقول: إنه كان يطؤها بمِلْك اليمين ولم يعتقها.\n\nقلت: ولهذا والله أعلم لم يذكرها أبو القاسم عبد الرحمن السُّهَيْلِي في عداد أزواج النبيّ صلى الله عليه وسلم.\n\nومنهن: ميمونة بنت الحارث الهلالِية، تزوّجها رسول الله صلى الله عليه وسلم بسَرِف على عشرة أميال من مكة، وذلك في سنة سبع من الهجرة في عُمْرة القَضِيّة، وهي آخر امرأة تزوّجها رسول الله صلى الله عليه وسلم، وقدّر الله تعالى أنها ماتت في المكان الذي بنى فيه رسول الله صلى الله عليه وسلم بها، ودفنت هنالك، وذلك في سنة إحدى وستين. وقيل: ثلاث وستين. وقيل ثمان وستين.\n\nفهؤلاء المشهورات من أزواج النبيّ صلى الله عليه وسلم، وهنّ اللاتي دخل بهن؛ رضي الله عنهن.\n\nفأما من تزوّجهن ولم يدخل بهن؛ فمنهن: الكلابِية. واختلفوا في اسمها؛ فقيل فاطمة. وقيل عَمْرة. وقيل العالية. قال الزهريّ: تزوّج فاطمة بنت الضحاك الكلابية فاستعاذت منه فطلقها، وكانت تقول: أنا الشقيّة. تزوّجها في ذي القعدة سنة ثمان من الهجرة، وتوفيت سنة ستين.\n\nومنهن: أسماء بنت النعمان بن الجَوْن بن الحارث الكِنْدية، وهي الجونية. قال قتادة: لما دخل عليها دعاها فقالت: تعال أنت، فطلّقها. وقال غيره: هي التي استعاذت منه. وفي البخاريّ قال: \" تزوج رسول الله صلى الله عليه وسلم أميمة بنت شَراحيل، فلما أدخلت عليه بسط يده إليها فكأنها كرهت ذلك، فأمر أبا أسيد أن يجهزها ويكسوها ثوبين \"\n                                   وفي لفظ آخر قال أبو أُسيد: \" أتِي رسول الله صلى الله عليه وسلم بالجَوْنية، فلما دخل عليها قال: «هبِي لي نفسك» فقالت: وهل تهب الملِكة نفسها للسُّوقة! فأهوى بيده ليضعها عليها لتسكن؛ فقالت: أعوذ بالله منك! فقال: «قد عُذتِ بمعَاذ» ثم خرج علينا فقال: «يا أبا أسَيد، أكْسها رازِقِيين وألحقها بأهلها» \". ومنهنّ: قُتَيْلة بنت قيس، أخت الأشعث بن قيس، زوّجها إياه الأشعث، ثم انصرف إلى حَضْرمَوْت، فحملها إليه فبلغه وفاة النبيّ صلى الله عليه وسلم. فردّها إلى بلاده، فارتدّ وارتدت معه. ثم تزوّجها عِكرمة بن أبي جَهْل، فوجد من ذلك أبو بكر وَجْداً شديداً. فقال له عمر: إنها والله ما هي من أزواجه، ما خيّرها ولا حجبها. ولقد برّأها الله منه بالارتداد. وكان عروة ينكر أن يكون تزوّجها.\n\nومنهنّ: أم شريك الأزدية، واسمها غُزَيَّة بنت جابر بن حكيم، وكانت قبله عند أبي بكر بن أبي سلمى، فطلقها النبيّ صلى الله عليه وسلم ولم يدخل بها. وهي التي وهبت نفسها. وقيل: إن التي وهبت نفسها للنبيّ صلى الله عليه وسلم خَوْلة بنت حكيم.\n\nومنهنّ: خَوْلة بنت الهُذَيل ابن هُبَيرة، تزوّجها رسول الله صلى الله عليه وسلم، فهلكت قبل أن تصل إليه.\n\nومنهنّ: شَرَافُ بنت خليفة، أخت دِحْية، تزوّجها ولم يدخل بها.\n\nومنهنّ: ليلى بنت الخَطِيم، أخت قيس، تزوّجها وكانت غيوراً فاستقالته فأقالها.\n\nومنهنّ: عمرة بنت معاوية الكِندية، تزوّجها النبي صلى الله عليه وسلم. قال الشعبيّ: تزوّج امرأة من كِنْدة فجيء بها بعد ما مات.\n\nومنهنّ: ابنة جندب بن ضمرة الجُنْدُعِية. قال بعضهم: تزوّجها رسول الله صلى الله عليه وسلم. وأنكر بعضهم وجود ذلك.\n\nومنهنّ: \" الغِفارِيّة. قال بعضهم؛ تزوّج امرأة من غِفار، فأمرها فنزعت ثيابها فرأى بياضاً فقال: «الْحَقِي بأهلك» \" ويقال: إنما رأى البياض بالكلابية. فهؤلاء اللاتي عقد عليهنّ ولم يدخل بهنّ؛ صلى الله عليه وسلم.\n\nفأما من خطبهنّ فلم يتم نكاحه معهنّ؛ ومن وهبت له نفسها:\n\nفمنهنّ: أم هانىء بنت أبي طالب، واسمها فاختة. خطبها النبيّ صلى الله عليه وسلم فقالت: إني امرأة مُصْبِيَة واعتذرت إليه فعذرها.\n\nومنهنّ: ضُباعة بنت عامر.\n\nومنهنّ: \" صفِية بنت بَشامة بن نضلة، خطبها النبيّ صلى الله عليه وسلم وكان أصابها سِباء، فخيّرها النبيّ صلى الله عليه وسلم، فقال: «إن شئت أنا وإن شئت زوجك؟» قالت: زوجي. فأرسلها؛ فلعنتها بنو تميم \" ؛ قاله ابن عباس.\n\nومنهنّ: أم شريك. وقد تقدّم ذكرها.\n\nومنهنّ: ليلى بنت الخَطِيم؛ وقد تقدّم ذكرها.\n\nومنهنّ: خولة بنت حكيم بن أمية؛ وهبت نفسها للنبيّ صلى الله عليه وسلم فأرجأها، فتزوّجها عثمان بن مظعون.\n                                   ومنهنّ: جَمْرة بنت الحارث بن عَوف المرّي؛ خطبها النبيّ صلى الله عليه وسلم فقال أبوها: إن بها سوءاً ولم يكن بها، فرجع إليها أبوها وقد برِصَت، وهي أم شبيب بن البرصاء الشاعر.\n\nومنهنّ: سودة القرشية؛ خطبها رسول الله صلى الله عليه وسلم وكانت مصبِية. فقالت: أخاف أن يَضْغُوَ صِبْيَتِي عند رأسك. فحمِدها ودعا لها.\n\nومنهنّ: امرأة لم يُذكر اسمها. قال مجاهد: \" خطب رسول الله صلى الله عليه وسلم امرأة فقالت: أستأمر أبي. فلقِيت أباها فأذن لها، فلقِيت رسول الله صلى الله عليه وسلم فقال: «قد التحفنا لحافاً غيرك» \". فهؤلاء جميع أزواج النبي صلى الله عليه وسلم.\n\nوكان له من السَّراري سُرِّيتان: مارِية القبطية، ورَيْحانة؛ في قول قتادة. وقال غيره: كان له أربع: مارية، ورَيحانة، وأخرى جميلة أصابها في السَّبْي، وجاريةٌ وهبتها له زينب بنت جحش.\n\nالثالثة: قوله تعالى: { إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَاةَ ٱلدُّنْيَا وَزِينَتَهَا } «إِنْ» شرط، وجوابه «فَتَعَالَيْنَ»؛ فعلق التخيير على شرط. وهذا يدل على أن التخيير والطلاق المعلقين على شرط صحيحان، فينفذان ويمضيان؛ خلافاً للجهال المبتدعة الذين يزعمون أن الرجل إذا قال لزوجته: أنتِ طالق إن دخلتِ الدار، أنه لا يقع الطلاق إن دخلت الدار؛ لأن الطلاق الشرعيّ هو المنجَّز في الحال لا غير.\n\nالرابعة: قوله تعالى: { فَتَعَالَيْنَ } هو جواب الشرط، وهو فعل جماعة النساء، من قولك تعالى؛ وهو دعاء إلى الإقبال إليه يقال: تعالى بمعنى أقبل، وُضع لمن له جلالة ورفعة، ثم صار في الاستعمال لكل داع إلى الإقبال، وأما في هذا الموضع فهو على أصله؛ فإن الداعي هو رسول الله صلى الله عليه وسلم. { أُمَتِّعْكُنَّ } قد تقدّم الكلام في المُتْعة في «البقرة». وقرىء «أُمَتِّعُكُنَّ» بضم العين. وكذا «وَأُسَرِّحُكُنّ» بضم الحاء على الاستئناف. والسراح الجميل؛ هو أن يكون طلاقاً للسنة من غير ضرار ولا منع واجب لها.\n\nالخامسة: اختلف العلماء في كيفية تخيير النبيّ صلى الله عليه وسلم أزواجه على قولين: الأوّل: أنه خيّرهنّ بإذن الله تعالى في البقاء على الزوجية أو الطلاق، فاخترن البقاء؛ قالته عائشة ومجاهد وعكرمة والشعبِيّ وابن شهاب وربيعة. ومنهم من قال: إنما خيرهنّ بين الدنيا فيفارقهنّ، وبين الآخرة فيمسكهنّ؛ لتكون لهنّ المنزلة العليا كما كانت لزوجهنّ؛ ولم يخيرهنّ في الطلاق؛ ذكره الحسن وقتادة. ومن الصحابة عليّ فيما رواه عنه أحمد بن حنبل أنه قال: لم يخيّر رسول الله صلى الله عليه وسلم نساءه إلا بين الدنيا والآخرة.\n\nقلت: القول الأوّل أصح؛ لقول عائشة رضي الله عنها لما سئلت عن الرجل يخير امرأته فقالت: قد خيّرنا رسول الله صلى الله عليه وسلم أفكان طلاقا! في رواية: فاخترناه فلم يعدّه طلاقاً.\n\n                                   ولم يثبت عن رسول الله صلى الله عليه وسلم إلا التخيير المأمور بين البقاء والطلاق؛ لذلك قال: \" يا عائشة إني ذاكر لكِ أمراً فلا عليك ألاّ تعجلي فيه حتى تستأمري أبويك \" الحديث. ومعلوم أنه لم يرد الاستئمار في اختيار الدنيا وزينتها على الآخرة. فثبت أن الاستئمار إنما وقع في الفرقة، أو النكاح. والله أعلم.\n\nالسادسة: اختلف العلماء في المخيَّرة إذا اختارت زوجها؛ فقال جمهور العلماء من السلف وغيرهم وأئمة الفتوى: إنه لا يلزمه طلاق، لا واحدة ولا أكثر؛ هذا قول عمر بن الخطاب وعليّ وابن مسعود وزيد بن ثابت وابن عباس وعائشة. ومن التابعين عطاء ومسروق وسليمان بن يسار وربيعة وابن شهاب. وروي عن عليّ وزيد أيضاً: إن اختارت زوجها فواحدة بائنة؛ وهو قول الحسن البصريّ والليث، وحكاه الخطابي والنقاش عن مالك. وتعلقوا بأن قوله: اختاري، كناية عن إيقاع الطلاق، فإذا أضافه إليها وقعت طلقة؛ كقوله: أنتِ بائن. والصحيح الأوّل؛ لقول عائشة: خيّرنا رسول الله صلى الله عليه وسلم فاخترناه فلم يعدّه علينا طلاقاً. أخرجه الصحيحان. قال ابن المنذر: وحديث عائشة يدل على أن المخيّرة إذا اختارت زوجها لم يكن ذلك طلاقاً، ويدل على أن اختيارها نفسها يوجب الطلاق، ويدل على معنى ثالث، وهو أن المخيَّرة إذا اختارت نفسها أنها تطليقة يملك زوجها رجعتها؛ إذ غير جائز أن يطلق رسول الله صلى الله عليه وسلم بخلاف ما أمره الله. وروي هذا عن عمر وابن مسعود وابن عباس. وبه قال ابن أبي ليلى والثوريّ والشافعيّ. وروي عن عليّ أنها إذا اختارت نفسها أنها واحدة بائنة. وهو قول أبي حنيفة وأصحابه. ورواه ابن خُوَيْزِمَنْدَاد عن مالك. وروي عن زيد بن ثابت أنها إذا اختارت نفسها أنها ثلاث. وهو قول الحسن البصريّ، وبه قال مالك والليث؛ لأن المِلك إنما يكون بذلك. وروي عن عليّ رضي الله عنه أنها إذا اختارت نفسها فليس بشيء. وروي عنه أنها إذا اختارت زوجها فواحدة رجعية.\n\nالسابعة: ذهب جماعة من المدنيّين وغيرهم إلى أن التمليك والتخيير سواء، والقضاء ما قضت فيهما جميعاً؛ وهو قول عبد العزيز بن أبي سلمة. قال ابن شعبان: وقد اختاره كثير من أصحابنا، وهو قول جماعة من أهل المدينة. قال أبو عمر: وعلى هذا القول أكثر الفقهاء. والمشهور من مذهب مالك الفرق بينهما؛ وذلك أن التمليك عند مالك هو قول الرجل لامرأته: قد ملّكتك؛ أي قد ملّكتك ما جعل الله لي من الطلاق واحدة أو اثنتين أو ثلاثاً؛ فلما جاز أن يملّكها بعض ذلك دون بعض وادعى ذلك، كان القولُ قولَه مع يمينه إذا ناكرها. وقالت طائفة من أهل المدينة: له المناكرة في التمليك وفي التخيير سواء في المدخول بها. والأوّل قول مالك في المشهور.\n\n                                   وروى ابن خُوَيْزِمَنْدَاد عن مالك أن للزوج أن يناكر المخيَّرة في الثلاث، وتكون طلقة بائنة كما قال أبو حنيفة. وبه قال أبو الجَهْم. قال سُحْنون: وعليه أكثر أصحابنا.\n\nوتحصيل مذهب مالك: أن المخيّرة إذا اختارت نفسها وهي مدخول بها فهو الطلاق كله، وإن أنكر زوجها فلا نكرة له. وإن اختارت واحدة فليس بشيء، وإنما الخيار البتات، إما أخذته وإما تركته؛ لأن معنى التخيير التسريح، قال الله تعالى في آية التخيير:\n{ فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحاً جَمِيلاً }\n[الأحزاب: 28] فمعنى التسريح البتات، قال الله تعالى:\n{ ٱلطَّلاَقُ مَرَّتَانِ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ }\n[البقرة: 229]. والتسريح بإحسان هو الطلقة الثالثة؛ روي ذلك عن النبيّ صلى الله عليه وسلم كما تقدّم. ومن جهة المعنى أن قوله: اختاريني أو اختاري نفسك يقتضي ألاّ يكون له عليها سبيل إذا اختارت نفسها، ولا يملك منها شيئاً؛ إذ قد جعل إليها أن تخرج ما يملكه منها أو تقيم معه إذا اختارته، فإذا اختارت البعض من الطلاق لم تعمل بمقتضى اللفظ، وكانت بمنزل من خُيّر بين شيئين فاختار غيرهما. وأما التي لم يدخل بها فله مناكرتها في التخيير والتمليك إذا زادت على واحدة؛ لأنها تبِين في الحال.\n\nالثامنة: اختلفت الرواية عن مالك متى يكون لها الخيار؛ فقال مرة: لها الخيار ما دامت في المجلس قبل القيام أو الاشتغال بما يدل على الإعراض. فإن لم تختر ولم تقض شيئاً حتى افترقا من مجلسهما بطل ما كان من ذلك إليها؛ وعلى هذا أكثر الفقهاء. وقال مرة: لها الخيار أبداً ما لم يعلم أنها تركت؛ وذلك يُعلم بأن تمكّنه من نفسها بوطء أو مباشرة؛ فعلى هذا إن منعت نفسها ولم تختر شيئاً كان له رفعهاإلى الحاكم لتوقع أو تسقط، فإن أبت أسقط الحاكم تمليكها. وعلى القول الأول إذا أخذت في غير ذلك من حديث أو عمل أو مشي أو ما ليس في التخيير بشيء كما ذكرنا سقط تخييرها. واحتج بعض أصحابنا لهذا القول بقوله تعالى :\n{ فَلاَ تَقْعُدُواْ مَعَهُمْ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيْرِهِ }\n[النساء: 140]. وأيضاً فإن الزوج أطلق لها القول ليعرف الخيار منها، فصار كالعقد بينهما، فإن قبلته وإلا سقط؛ كالذي يقول: قد وهبت لك أو بايعتك، فإن قبل وإلا كان الملك باقياً بحاله. هذا قول الثوريّ والكوفيين والأوزاعيّ والليث والشافعي وأبي ثور، وهو اختيار ابن القاسم. ووجه الرواية الثانية أن ذلك قد صار في يدها وملَكَته على زوجها بتمليكه إياها فلما ملكت ذلك وجب أن يبقى في يدها كبقائه في يد زوجها.\n\nقلت: وهذا هو الصحيح \" لقوله عليه السلام لعائشة: «إني ذاكر لك أمراً فلا عليك ألا تستعجلي حتى تستأمري أبويك» \" رواه الصحيح، وخرّجه البخاريّ، وصححه الترمذيّ. وقد تقدم في أول الباب. وهو حجة لمن قال: إنه إذا خيّر الرجل امرأته أو ملّكها أن لها أن تقضي في ذلك وإن افترقا من مجلسهما؛ روي هذا عن الحسن والزُّهريّ، وقاله مالك في إحدى روايتيه. قال أبو عبيد: والذي عندنا في هذا الباب، اتباع السنة في عائشة في هذا الحديث، حين جعل لها التخيير إلى أن تستأمر أبويها، ولم يجعل قيامها من مجلسها خروجاً من الأمر. قال المَرْوزِيّ: هذا أصح الأقاويل عندي، وقاله ابن المنذر والطّحاويّ.\n\n                                    ",
        "saadi": "وَإِن كُنتُنَّ تُرِدۡنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلۡأٓخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلۡمُحۡسِنَٰتِ مِنكُنَّ أَجۡرًا عَظِيمٗا ٩٢\n                                        \n                                        \n                                        \n                                        لما اجتمع نساء رسول اللّه صلى اللّه عليه وسلم في الغيرة، وطلبن منه النفقة والكسوة، طلبن منه أمراً لا يقدر عليه في كل وقت، ولم يزلن في طلبهن متفقات، في مرادهن متعنتات، فشَقَّ ذلك على الرسول، حتى وصلت به الحال إلى أنه آلى منهن شهراً. فأراد اللّه أن يسهل الأمر على رسوله، وأن يرفع درجة زوجاته، ويُذْهِبَ عنهن كل أمر ينقص أجرهن، فأمر رسوله أن يخيرهن فقال: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ إِن كُنتُنَّ تُرِدْنَ ٱلْحَيَاةَ ٱلدُّنْيَا } أي: ليس لكن في غيرها مطلب، وصرتن ترضين لوجودها، وتغضبن لفقدها، فليس لي فيكن أرب وحاجة، وأنتن بهذه الحال. { فَتَعَالَيْنَ أُمَتِّعْكُنَّ } شيئاً مما عندي من الدنيا { وَأُسَرِّحْكُنَّ } أي: أفارقكن { سَرَاحاً جَمِيلاً } من دون مغاضبة ولا مشاتمة، بل بسعة صدر، وانشراح بال، قبل أن تبلغ الحال إلى ما لا ينبغي. { وَإِن كُنتُنَّ تُرِدْنَ ٱللَّهَ وَرَسُولَهُ وَٱلدَّارَ ٱلآخِرَةَ } أي: هذه الأشياء مرادكن، وغاية مقصودكن، وإذا حصل لَكُنَّ اللّه ورسوله والجنة، لم تبالين بسعة الدنيا وضيقها، ويسرها وعسرها، وقنعتن من رسول اللّه بما تيسر، ولم تطلبن منه ما يشق عليه، { فَإِنَّ ٱللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنكُنَّ أَجْراً عَظِيماً } رتب الأجر على وصفهن بالإحسان، لأنه السبب الموجب لذلك، لا لكونهن زوجات للرسول، فإن مجرد ذلك لا يكفي، بل لا يفيد شيئاً مع عدم الإحسان، فخيَّرهن رسول اللّه صلى اللّه عليه وسلم في ذلك، فاخترن اللّه ورسوله والدار الآخرة كلهن، ولم يتخلف منهن واحدة، رضي اللّه عنهن. وفي هذا التخيير فوائد عديدة: منها: الاعتناء برسوله وغيرته عليه، أن يكون بحالة يشق عليه كثرة مطالب زوجاته الدنيوية. ومنها: سلامته صلى اللّه عليه وسلم بهذا التخيير من تبعة حقوق الزوجات، وأنه يبقى في حرية نفسه، إن شاء أعطى، وإن شاء منع\n{ مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ ٱللَّهُ لَهُ }\n[الأحزاب: 38]. ومنها: تنزيهه عما لو كان فيهن من تؤثر الدنيا على اللّه ورسوله والدار الآخرة عنها، وعن مقارنتها. ومنها: سلامة زوجاته رضي اللّه عنهن عن الإثم والتعرض لسخط اللّه ورسوله. فحسم اللّه بهذا التخيير عنهن التسخط على الرسول، الموجب لسخطه، المسخط لربه، الموجب لعقابه. ومنها: إظهار رفعتهن وعلو درجتهن، وبيان علو هممهن، أن كان اللّه ورسوله والدار الآخرة، مرادهن ومقصودهن، دون الدنيا وحطامها. ومنها: استعدادهن بهذا الاختيار، للأمر الخيار، للوصول إلى خيار درجات الجنة، وأن يكُنَّ زوجاته في الدنيا والآخرة. ومنها: ظهور المناسبة بينه وبينهن، فإنه أكمل الخلق، وأراد اللّه أن تكون نساؤه كاملات مكملات، طيبات مطيبات\n{ ٱلطَّيِّبَاتُ لِلطَّيِّبِينَ وَٱلطَّيِّبُونَ لِلْطَّيِّبَاتِ }\n[النور: 26]. ومنها: أن هذا التخيير داع، وموجب للقناعة التي يطمئن لها القلب، وينشرح لها الصدر، ويزول عنهن جشع الحرص، وعدم الرضا الموجب لقلق القلب واضطرابه، وهمه وغمه. ومنها: أن يكون اختيارهن هذا، سبباً لزيادة أجرهن ومضاعفته، وأن يَكُنَّ بمرتبة ليس فيها أحد من النساء، ولهذا قال: { يٰنِسَآءَ ٱلنَّبِيِّ مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ يُضَاعَفْ... }.\n                                    "
      },
      "originalText": "وَإِن كُنتُنَّ تُرِدۡنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلۡأٓخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلۡمُحۡسِنَٰتِ مِنكُنَّ أَجۡرًا عَظِيمٗا ٩٢"
    },
    {
      "number": 3563,
      "text": "يَا نِسَاءَ النَّبِيِّ مَنْ يَأْتِ مِنْكُنَّ بِفَاحِشَةٍ مُبَيِّنَةٍ يُضَاعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 30,
      "juz": 21,
      "manzil": 5,
      "page": 421,
      "ruku": 364,
      "hizbQuarter": 168,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰنِسَآءَ ٱلنَّبِيِّ مَن يَأۡتِ مِنكُنَّ بِفَٰحِشَةٖ مُّبَيِّنَةٖ يُضَٰعَفۡ لَهَا ٱلۡعَذَابُ ضِعۡفَيۡنِۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا ٠٣\n                                    \n                                    \n                                    يقول الله تعالى واعظاً نساء النبي صلى الله عليه وسلم اللاتي اخترن الله ورسوله والدار الآخرة، واستقر أمرهن تحت رسول الله صلى الله عليه وسلم فناسب أن يخبرهن بحكمهن وتخصيصهن دون سائر النساء بأن من يأت منهن بفاحشة مبينة. قال ابن عباس رضي الله عنهما وهي النشوز وسوء الخلق، وعلى كل تقدير فهو شرط، والشرط لا يقتضي الوقوع كقوله تعالى\n{ وَلَقَدْ أُوْحِيَ إِلَيْكَ وَإِلَى ٱلَّذِينَ مِن قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ }\nالزمر 65 وكقوله عز وجل\n{ وَلَوْ أَشْرَكُواْ لَحَبِطَ عَنْهُمْ مَّا كَانُواْ يَعْمَلُونَ }\nالأنعام 88\n{ قُلْ إِن كَانَ لِلرَّحْمَـٰنِ وَلَدٌ فَأَنَاْ أَوَّلُ ٱلْعَـٰبِدِينَ }\nالزخرف 81\n{ لَّوْ أَرَادَ ٱللَّهُ أَن يَتَّخِذَ وَلَداً لاَّصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَآءُ سُبْحَـٰنَهُ هُوَ ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ }\nالزمر 4 فلما كانت محلتهن رفيعة، ناسب أن يجعل الذنب لو وقع منهن مغلظاً صيانة لجنابهن وحجابهن الرفيع، ولهذا قال تعالى { مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ يُضَاعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ } قال مالك عن زيد بن أسلم { يُضَاعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ } قال في الدنيا والآخرة، وعن ابن أبي نجيح عن مجاهد مثله، { وَكَانَ ذٰلِكَ عَلَى ٱللَّهِ يَسِيراً } أي سهلاً هيناً، ثم ذكر عدله وفضله في قوله { وَمَن يَقْنُتْ مِنكُنَّ للَّهِ وَرَسُولِهِ } أي يطع الله ورسوله ويستجب، { نُّؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقاً كَرِيماً } أي في الجنة فإِنهن في منازل رسول الله صلى الله عليه وسلم في أعلى عليين، فوق منازل جميع الخلائق، في الوسيلة التي هي أقرب منازل الجنة إِلى العرش.\n                                    ",
        "qortoby": "يَٰنِسَآءَ ٱلنَّبِيِّ مَن يَأۡتِ مِنكُنَّ بِفَٰحِشَةٖ مُّبَيِّنَةٖ يُضَٰعَفۡ لَهَا ٱلۡعَذَابُ ضِعۡفَيۡنِۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا ٠٣\n                                    \n                                    \n                                    قوله تعالى: { يٰنِسَآءَ ٱلنَّبِيِّ مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ } فيه ثلاث مسائل :\n\nالأولى: قال العلماء: لما اختار نساءُ النبيّ صلى الله عليه وسلم رسولَ الله صلى الله عليه وسلم شكرهنّ الله على ذلك فقال تكرمة لهن :\n{ لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ }\n[الأحزاب: 52] الآية. وبين حكمهن عن غيرهن فقال:\n{ وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً }\n[الأحزاب: 53]. وجعل ثواب طاعتهنّ وعقاب معصيتهنّ أكثر مما لغيرهنّ فقال: { يٰنِسَآءَ ٱلنَّبِيِّ مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ يُضَاعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ }. فأخبر تعالى أن من جاء من نساء النبيّ صلى الله عليه وسلم بفاحشة ـ والله عاصم رسوله عليه السلام من ذلك كما مر في حديث الإفك ـ «يضاعف لها العذاب ضعفين»؛ لشرف منزلتهنّ وفضل درجتهنّ، وتقدّمهنّ على سائر النساء أجمع. وكذلك بيّنت الشريعة في غير ما موضع حسبما تقدّم بيانه غير مرة ـ أنه كلما تضاعفت الحُرُمات فهتِكت تضاعفت العقوبات؛ ولذلك ضُوعف حدّ الحرّ على العبد والثّيب على البكر. وقيل: لما كان أزواج النبيّ صلى الله عليه وسلم في مهبط الوحي وفي منزل أوامر الله ونواهيه، قوِي الأمر عليهن ولزمهن بسبب مكانتهن أكثر مما يلزم غيرهن؛ فضوعف لهنّ الأجر والعذاب. وقيل: إنما ذلك لعظم الضرر في جرائمهن بإيذاء رسول الله صلى الله عليه وسلم؛ فكانت العقوبة على قدر عظم الجريمة في إيذاء رسول الله صلى الله عليه وسلم؛ وقال تعالى:\n{ إِنَّ ٱلَّذِينَ يُؤْذُونَ ٱللَّهَ وَرَسُولَهُ لَعَنَهُمُ ٱللَّهُ فِي ٱلدُّنْيَا وَٱلآخِرَةِ }\n[الأحزاب: 57]. واختار هذا القول الكِيَا الطبري.\n\nالثانية : قال قوم: لو قُدّر الزنى من واحدة منهن ـ وقد أعاذهنّ الله من ذلك ـ لكانت تُحدّ حدّين لعظم قدرها، كما يزاد حدّ الحرة على الأمَة. والعذاب بمعنى الحدّ، قال الله تعالى :\n{ وَلْيَشْهَدْ عَذَابَهُمَا طَآئِفَةٌ مِّنَ ٱلْمُؤْمِنِينَ }\n[النور: 2]. وعلى هذا فمعنى الضعفين معنى المِثلين أو المرتين. وقال أبو عبيدة: ضِعف الشيء شيئان حتى يكون ثلاثة. وقاله أبو عمرو فيما حكى الطبريّ عنه؛ فيضاعف إليه عذابان مثله فيكون ثلاثة أعذبة. وضعّفه الطبري. وكذلك هو غير صحيح وإن كان له باللفظ تعلّق الاحتمال. وكون الأجر مرتين مما يفسد هذا القول؛ لأن العذاب في الفاحشة بإزاء الأجر في الطاعة؛ قاله ابن عطية. وقال النحاس: فرق أبو عمرو بين «يُضَاعف ويضعَّف» قال: «يُضَاعَف» للمرار الكثيرة. و«يضعّف» مرتين. وقرأ «يضعَّف» لهذا. وقال أبو عبيدة: «يُضَاعَفْ لَهَا الْعَذَابُ» يجعل ثلاثة أعذبة. قال النحاس: التفريق الذي جاء به أبو عمرو وأبو عبيدة لا يعرفه أحد من أهل اللغة علِمته، والمعنى في «يضاعف ويضعَّف» واحد؛ أي يجعل ضعفين؛ كما تقول: إن دفعت إليّ درهماً دفعت إليك ضِعْفَيه أي مِثْلَيه؛ يعني درهمين.\n                                   ويدل على هذا { نُؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ } ولا يكون العذاب أكثر من الأجر. وقال في موضع آخر\n{ آتِهِمْ ضِعْفَيْنِ مِنَ ٱلْعَذَابِ }\n[الأحزاب: 68] أي مثلين. وروى معمر عن قتادة «يُضَاعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ» قال: عذابُ الدنيا وعذاب الآخرة. قال القشيري أبو نصر: الظاهر أنه أراد بالضعفين المثلين؛ لأنه قال: { نُؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ }. فأما في الوصايا، لو أوصى لإنسان بضعفي نصيب ولده فهو وصية بأن يعطَى مِثل نصيبه ثلاث مرات؛ فإن الوصايا تجري على العرف فيما بين الناس، وكلام الله يردُّ تفسيره إلى كَلام العرب، والضعف في كلام العرب المِثل إلى ما زاد، وليس بمقصور على مثلين. يقال: هذا ضعف هذا؛ أي مثله. وهذا ضعفاه، أي مثلاه؛ فالضعف في الأصل زيادة غير محصورة؛ قال الله تعالى:\n{ فَأُوْلَـٰئِكَ لَهُمْ جَزَآءُ ٱلضِّعْفِ }\n[سبأ: 37] ولم يردِ مِثلاً ولا مِثلين. كل هذا قول الأزهري. وقد تقدم في «النور» الاختلاف في حد من قذف واحدة منهن؛ والحمد لله.\n\nالثالثة : قال أبو رافع: كان عمر رضي الله عنه كثيراً ما يقرأ سورة يوسف وسورة الأحزاب في الصبح، وكان إذا بلغ «يَا نِسَاءَ النَّبِيِّ» رفع بها صوته؛ فقيل له في ذلك فقال: «أذكِّرهن العهد». قرأ الجمهور: «مَنْ يَأْتِ» بالياء. وكذلك «مَنْ يَقْنُتْ» حملاً على لفظ «مَن». والقنوت الطاعة؛ وقد تقدم. وقرأ يعقوب: «من تأت» و«تقنت» بالتاء من فوق، حملاً على المعنى. وقال قوم: الفاحشة إذا وردت معرفة فهي الزنى واللواط. وإذا وردت منكرة فهي سائر المعاصي. وإذا وردت منعوتة فهي عقوق الزوج وفساد عشرته. وقالت فرقة: بل قوله: { بِفَاحِشَةٍ مُّبَيِّنَةٍ } تعم جميع المعاصي. وكذلك الفاحشة كيف وردت. وقرأ ابن كثِير «مبيَّنةٍ» بفتح الياء. وقرأ نافع وأبو عمرو بكسرها. وقرأت فرقة: «يُضَاعِفْ» بكسر العين على إسناد الفعل إلى الله تعالى. وقرأ أبو عمرو فيما روى خارجة «نضاعِف» بالنون المضمومة ونصب «العذاب» وهذه قراءة ابن مُحَيْصِن. وهذه مفاعلة من واحد؛ كطارقت النعل وعاقبت اللص. وقرأ نافع وحمزة والكسائيّ «يضاعَف» بالياء وفتح العين، «العذابُ» رفعاً. وهي قراءة الحسن وابن كثير وعيسى. وقرأ ابن كثير وابن عامر «نُضَعِّف» بالنون وكسر العين المشددة؛ «العذابَ» نصباً. قال مقاتل: هذا التضعيف في العذاب إنما هو في الآخرة؛ لأن إيتاء الأجر مرتين أيضاً في الآخرة. وهذا حسن؛ لأن نساء النبيّ صلى الله عليه وسلم لا يأتين بفاحشة توجب حدًّا. وقد قال ابن عباس: ما بَغَت امرأة نبيّ قط، وإنما خانت في الإيمان والطاعة. وقال بعض المفسرين: العذاب الذي تُوُعِّدْن به «ضعفين» هو عذاب الدنيا وعذاب الآخرة؛ فكذلك الأجر. قال ابن عطية: وهذا ضعيف، اللهم إلا أن يكون أزواج النبي صلى الله عليه وسلم لا ترفع عنهن حدودُ الدنيا عذابَ الآخرة، على ما هي حال الناس عليه؛ بحكم حديث عُبادة بن الصّامت. وهذا أمر لم يُرْوَ في أزواج النبيّ صلى الله عليه وسلم ولا حفظ تقرره. وأهل التفسير على أن الرزق الكريم الجنة؛ ذكره النحاس.\n\n                                    ",
        "saadi": "يَٰنِسَآءَ ٱلنَّبِيِّ مَن يَأۡتِ مِنكُنَّ بِفَٰحِشَةٖ مُّبَيِّنَةٖ يُضَٰعَفۡ لَهَا ٱلۡعَذَابُ ضِعۡفَيۡنِۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا ٠٣\n                                        \n                                        \n                                        \n                                        لما اخترن اللّه ورسوله والدار الآخرة، ذكر مضاعفة أجرهن، ومضاعفة وزرهن وإثمهن لو جرى منهن، ليزداد حذرهن، وشكرهن اللّه تعالى، فجعل من أتى منهن بفاحشة ظاهرة لها العذاب ضعفين. { وَمَن يَقْنُتْ مِنكُنَّ } أي: تطيع { للَّهِ وَرَسُولِهِ وَتَعْمَلْ صَالِحاً } قليلاً أو كثيراً، { نُؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ } أي: مثل ما نعطي غيرها مرتين، { وَأَعْتَدْنَا لَهَا رِزْقاً كَرِيماً } وهي الجنة، فقنتن للّه ورسوله، وعملن صالحاً، فعلم بذلك أجرهن.\n                                    "
      },
      "originalText": "يَٰنِسَآءَ ٱلنَّبِيِّ مَن يَأۡتِ مِنكُنَّ بِفَٰحِشَةٖ مُّبَيِّنَةٖ يُضَٰعَفۡ لَهَا ٱلۡعَذَابُ ضِعۡفَيۡنِۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا ٠٣"
    }
  ]
}