{
  "number": 422,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 3564,
      "text": "۞ وَمَنْ يَقْنُتْ مِنْكُنَّ لِلَّهِ وَرَسُولِهِ وَتَعْمَلْ صَالِحًا نُؤْتِهَا أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 31,
      "juz": 22,
      "manzil": 5,
      "page": 422,
      "ruku": 364,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ وَمَن يَقۡنُتۡ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعۡمَلۡ صَٰلِحٗا نُّؤۡتِهَآ أَجۡرَهَا مَرَّتَيۡنِ وَأَعۡتَدۡنَا لَهَا رِزۡقٗا كَرِيمٗا ١٣\n                                    \n                                    \n                                    يقول الله تعالى واعظاً نساء النبي صلى الله عليه وسلم اللاتي اخترن الله ورسوله والدار الآخرة، واستقر أمرهن تحت رسول الله صلى الله عليه وسلم فناسب أن يخبرهن بحكمهن وتخصيصهن دون سائر النساء بأن من يأت منهن بفاحشة مبينة. قال ابن عباس رضي الله عنهما وهي النشوز وسوء الخلق، وعلى كل تقدير فهو شرط، والشرط لا يقتضي الوقوع كقوله تعالى\n{ وَلَقَدْ أُوْحِيَ إِلَيْكَ وَإِلَى ٱلَّذِينَ مِن قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ }\nالزمر 65 وكقوله عز وجل\n{ وَلَوْ أَشْرَكُواْ لَحَبِطَ عَنْهُمْ مَّا كَانُواْ يَعْمَلُونَ }\nالأنعام 88\n{ قُلْ إِن كَانَ لِلرَّحْمَـٰنِ وَلَدٌ فَأَنَاْ أَوَّلُ ٱلْعَـٰبِدِينَ }\nالزخرف 81\n{ لَّوْ أَرَادَ ٱللَّهُ أَن يَتَّخِذَ وَلَداً لاَّصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَآءُ سُبْحَـٰنَهُ هُوَ ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ }\nالزمر 4 فلما كانت محلتهن رفيعة، ناسب أن يجعل الذنب لو وقع منهن مغلظاً صيانة لجنابهن وحجابهن الرفيع، ولهذا قال تعالى { مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ يُضَاعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ } قال مالك عن زيد بن أسلم { يُضَاعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ } قال في الدنيا والآخرة، وعن ابن أبي نجيح عن مجاهد مثله، { وَكَانَ ذٰلِكَ عَلَى ٱللَّهِ يَسِيراً } أي سهلاً هيناً، ثم ذكر عدله وفضله في قوله { وَمَن يَقْنُتْ مِنكُنَّ للَّهِ وَرَسُولِهِ } أي يطع الله ورسوله ويستجب، { نُّؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقاً كَرِيماً } أي في الجنة فإِنهن في منازل رسول الله صلى الله عليه وسلم في أعلى عليين، فوق منازل جميع الخلائق، في الوسيلة التي هي أقرب منازل الجنة إِلى العرش.\n                                    ",
        "qortoby": "۞ وَمَن يَقۡنُتۡ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعۡمَلۡ صَٰلِحٗا نُّؤۡتِهَآ أَجۡرَهَا مَرَّتَيۡنِ وَأَعۡتَدۡنَا لَهَا رِزۡقٗا كَرِيمٗا ١٣\n                                    \n                                    \n                                    قوله تعالى: { يٰنِسَآءَ ٱلنَّبِيِّ مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ } فيه ثلاث مسائل :\n\nالأولى: قال العلماء: لما اختار نساءُ النبيّ صلى الله عليه وسلم رسولَ الله صلى الله عليه وسلم شكرهنّ الله على ذلك فقال تكرمة لهن :\n{ لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ }\n[الأحزاب: 52] الآية. وبين حكمهن عن غيرهن فقال:\n{ وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً }\n[الأحزاب: 53]. وجعل ثواب طاعتهنّ وعقاب معصيتهنّ أكثر مما لغيرهنّ فقال: { يٰنِسَآءَ ٱلنَّبِيِّ مَن يَأْتِ مِنكُنَّ بِفَاحِشَةٍ مُّبَيِّنَةٍ يُضَاعَفْ لَهَا ٱلْعَذَابُ ضِعْفَيْنِ }. فأخبر تعالى أن من جاء من نساء النبيّ صلى الله عليه وسلم بفاحشة ـ والله عاصم رسوله عليه السلام من ذلك كما مر في حديث الإفك ـ «يضاعف لها العذاب ضعفين»؛ لشرف منزلتهنّ وفضل درجتهنّ، وتقدّمهنّ على سائر النساء أجمع. وكذلك بيّنت الشريعة في غير ما موضع حسبما تقدّم بيانه غير مرة ـ أنه كلما تضاعفت الحُرُمات فهتِكت تضاعفت العقوبات؛ ولذلك ضُوعف حدّ الحرّ على العبد والثّيب على البكر. وقيل: لما كان أزواج النبيّ صلى الله عليه وسلم في مهبط الوحي وفي منزل أوامر الله ونواهيه، قوِي الأمر عليهن ولزمهن بسبب مكانتهن أكثر مما يلزم غيرهن؛ فضوعف لهنّ الأجر والعذاب. وقيل: إنما ذلك لعظم الضرر في جرائمهن بإيذاء رسول الله صلى الله عليه وسلم؛ فكانت العقوبة على قدر عظم الجريمة في إيذاء رسول الله صلى الله عليه وسلم؛ وقال تعالى:\n{ إِنَّ ٱلَّذِينَ يُؤْذُونَ ٱللَّهَ وَرَسُولَهُ لَعَنَهُمُ ٱللَّهُ فِي ٱلدُّنْيَا وَٱلآخِرَةِ }\n[الأحزاب: 57]. واختار هذا القول الكِيَا الطبري.\n\nالثانية : قال قوم: لو قُدّر الزنى من واحدة منهن ـ وقد أعاذهنّ الله من ذلك ـ لكانت تُحدّ حدّين لعظم قدرها، كما يزاد حدّ الحرة على الأمَة. والعذاب بمعنى الحدّ، قال الله تعالى :\n{ وَلْيَشْهَدْ عَذَابَهُمَا طَآئِفَةٌ مِّنَ ٱلْمُؤْمِنِينَ }\n[النور: 2]. وعلى هذا فمعنى الضعفين معنى المِثلين أو المرتين. وقال أبو عبيدة: ضِعف الشيء شيئان حتى يكون ثلاثة. وقاله أبو عمرو فيما حكى الطبريّ عنه؛ فيضاعف إليه عذابان مثله فيكون ثلاثة أعذبة. وضعّفه الطبري. وكذلك هو غير صحيح وإن كان له باللفظ تعلّق الاحتمال. وكون الأجر مرتين مما يفسد هذا القول؛ لأن العذاب في الفاحشة بإزاء الأجر في الطاعة؛ قاله ابن عطية. وقال النحاس: فرق أبو عمرو بين «يُضَاعف ويضعَّف» قال: «يُضَاعَف» للمرار الكثيرة. و«يضعّف» مرتين. وقرأ «يضعَّف» لهذا. وقال أبو عبيدة: «يُضَاعَفْ لَهَا الْعَذَابُ» يجعل ثلاثة أعذبة. قال النحاس: التفريق الذي جاء به أبو عمرو وأبو عبيدة لا يعرفه أحد من أهل اللغة علِمته، والمعنى في «يضاعف ويضعَّف» واحد؛ أي يجعل ضعفين؛ كما تقول: إن دفعت إليّ درهماً دفعت إليك ضِعْفَيه أي مِثْلَيه؛ يعني درهمين.\n                                   ويدل على هذا { نُؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ } ولا يكون العذاب أكثر من الأجر. وقال في موضع آخر\n{ آتِهِمْ ضِعْفَيْنِ مِنَ ٱلْعَذَابِ }\n[الأحزاب: 68] أي مثلين. وروى معمر عن قتادة «يُضَاعَفْ لَهَا الْعَذَابُ ضِعْفَيْنِ» قال: عذابُ الدنيا وعذاب الآخرة. قال القشيري أبو نصر: الظاهر أنه أراد بالضعفين المثلين؛ لأنه قال: { نُؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ }. فأما في الوصايا، لو أوصى لإنسان بضعفي نصيب ولده فهو وصية بأن يعطَى مِثل نصيبه ثلاث مرات؛ فإن الوصايا تجري على العرف فيما بين الناس، وكلام الله يردُّ تفسيره إلى كَلام العرب، والضعف في كلام العرب المِثل إلى ما زاد، وليس بمقصور على مثلين. يقال: هذا ضعف هذا؛ أي مثله. وهذا ضعفاه، أي مثلاه؛ فالضعف في الأصل زيادة غير محصورة؛ قال الله تعالى:\n{ فَأُوْلَـٰئِكَ لَهُمْ جَزَآءُ ٱلضِّعْفِ }\n[سبأ: 37] ولم يردِ مِثلاً ولا مِثلين. كل هذا قول الأزهري. وقد تقدم في «النور» الاختلاف في حد من قذف واحدة منهن؛ والحمد لله.\n\nالثالثة : قال أبو رافع: كان عمر رضي الله عنه كثيراً ما يقرأ سورة يوسف وسورة الأحزاب في الصبح، وكان إذا بلغ «يَا نِسَاءَ النَّبِيِّ» رفع بها صوته؛ فقيل له في ذلك فقال: «أذكِّرهن العهد». قرأ الجمهور: «مَنْ يَأْتِ» بالياء. وكذلك «مَنْ يَقْنُتْ» حملاً على لفظ «مَن». والقنوت الطاعة؛ وقد تقدم. وقرأ يعقوب: «من تأت» و«تقنت» بالتاء من فوق، حملاً على المعنى. وقال قوم: الفاحشة إذا وردت معرفة فهي الزنى واللواط. وإذا وردت منكرة فهي سائر المعاصي. وإذا وردت منعوتة فهي عقوق الزوج وفساد عشرته. وقالت فرقة: بل قوله: { بِفَاحِشَةٍ مُّبَيِّنَةٍ } تعم جميع المعاصي. وكذلك الفاحشة كيف وردت. وقرأ ابن كثِير «مبيَّنةٍ» بفتح الياء. وقرأ نافع وأبو عمرو بكسرها. وقرأت فرقة: «يُضَاعِفْ» بكسر العين على إسناد الفعل إلى الله تعالى. وقرأ أبو عمرو فيما روى خارجة «نضاعِف» بالنون المضمومة ونصب «العذاب» وهذه قراءة ابن مُحَيْصِن. وهذه مفاعلة من واحد؛ كطارقت النعل وعاقبت اللص. وقرأ نافع وحمزة والكسائيّ «يضاعَف» بالياء وفتح العين، «العذابُ» رفعاً. وهي قراءة الحسن وابن كثير وعيسى. وقرأ ابن كثير وابن عامر «نُضَعِّف» بالنون وكسر العين المشددة؛ «العذابَ» نصباً. قال مقاتل: هذا التضعيف في العذاب إنما هو في الآخرة؛ لأن إيتاء الأجر مرتين أيضاً في الآخرة. وهذا حسن؛ لأن نساء النبيّ صلى الله عليه وسلم لا يأتين بفاحشة توجب حدًّا. وقد قال ابن عباس: ما بَغَت امرأة نبيّ قط، وإنما خانت في الإيمان والطاعة. وقال بعض المفسرين: العذاب الذي تُوُعِّدْن به «ضعفين» هو عذاب الدنيا وعذاب الآخرة؛ فكذلك الأجر. قال ابن عطية: وهذا ضعيف، اللهم إلا أن يكون أزواج النبي صلى الله عليه وسلم لا ترفع عنهن حدودُ الدنيا عذابَ الآخرة، على ما هي حال الناس عليه؛ بحكم حديث عُبادة بن الصّامت. وهذا أمر لم يُرْوَ في أزواج النبيّ صلى الله عليه وسلم ولا حفظ تقرره. وأهل التفسير على أن الرزق الكريم الجنة؛ ذكره النحاس.\n\n                                    ",
        "saadi": "۞ وَمَن يَقۡنُتۡ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعۡمَلۡ صَٰلِحٗا نُّؤۡتِهَآ أَجۡرَهَا مَرَّتَيۡنِ وَأَعۡتَدۡنَا لَهَا رِزۡقٗا كَرِيمٗا ١٣\n                                        \n                                        \n                                        \n                                        لما اخترن اللّه ورسوله والدار الآخرة، ذكر مضاعفة أجرهن، ومضاعفة وزرهن وإثمهن لو جرى منهن، ليزداد حذرهن، وشكرهن اللّه تعالى، فجعل من أتى منهن بفاحشة ظاهرة لها العذاب ضعفين. { وَمَن يَقْنُتْ مِنكُنَّ } أي: تطيع { للَّهِ وَرَسُولِهِ وَتَعْمَلْ صَالِحاً } قليلاً أو كثيراً، { نُؤْتِهَـآ أَجْرَهَا مَرَّتَيْنِ } أي: مثل ما نعطي غيرها مرتين، { وَأَعْتَدْنَا لَهَا رِزْقاً كَرِيماً } وهي الجنة، فقنتن للّه ورسوله، وعملن صالحاً، فعلم بذلك أجرهن.\n                                    "
      },
      "originalText": "۞ وَمَن يَقۡنُتۡ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعۡمَلۡ صَٰلِحٗا نُّؤۡتِهَآ أَجۡرَهَا مَرَّتَيۡنِ وَأَعۡتَدۡنَا لَهَا رِزۡقٗا كَرِيمٗا ١٣"
    },
    {
      "number": 3565,
      "text": "يَا نِسَاءَ النَّبِيِّ لَسْتُنَّ كَأَحَدٍ مِنَ النِّسَاءِ ۚ إِنِ اتَّقَيْتُنَّ فَلَا تَخْضَعْنَ بِالْقَوْلِ فَيَطْمَعَ الَّذِي فِي قَلْبِهِ مَرَضٌ وَقُلْنَ قَوْلًا مَعْرُوفًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 32,
      "juz": 22,
      "manzil": 5,
      "page": 422,
      "ruku": 364,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا ٢٣\n                                    \n                                    \n                                    هذه آداب أمر الله تعالى بها نساء النبي صلى الله عليه وسلم ونساءُ الأمة تبع لهن في ذلك، فقال تعالى مخاطباً لنساء النبي صلى الله عليه وسلم بأنهن إِذا اتقين الله عز وجل كما أمرهن، فإِنه لا يشبههن أحد من النساء، ولا يلحقهن في الفضيلة والمنزلة، ثم قال تعالى { فَلاَ تَخْضَعْنَ بِٱلْقَوْلِ } قال السدي وغيره يعني بذلك ترقيق الكلام إِذا خاطبن الرجال، ولهذا قال تعالى { فَيَطْمَعَ ٱلَّذِى فِى قَلْبِهِ مَرَضٌ } أي دغل، { وَقُلْنَ قَوْلاً مَّعْرُوفاً } قال ابن زيد قولاً حسناً جميلاً معروفاً في الخير، ومعنى هذا أنها تخاطب الأجانب بكلام ليس فيه ترخيم، أي لاتخاطب المرأة الأجانب كما تخاطب زوجها. وقوله تعالى { وَقَرْنَ فِى بُيُوتِكُنَّ } أي إلزمن بيوتكن، فلا تخرجن لغير حاجة، ومن الحوائج الشرعية الصلاة في المسجد بشرطه كما قال رسول الله صلى الله عليه وسلم \" لا تمنعوا إِماء الله مساجد الله، وليخرجن وهن تفلات \" وفي رواية \" وبيوتهن خير لهن \" وقال الحافظ أبو بكر البزار حدثنا حميد بن مسعدة، حدثنا أبو رجاء الكلبي روح بن المسيب ثقة، حدثنا ثابت البناني عن أنس رضي الله عنه قال جئن النساء إِلى رسول الله، فقلن يارسول الله ذهب الرجال بالفضل والجهاد في سبيل الله تعالى، فما لنا عمل ندرك به عمل المجاهدين في سبيل الله تعالى، فقال رسول الله صلى الله عليه وسلم \" من قعدت ــــ أو كلمة نحوها ــــ منكن في بيتها، فإِنها تدرك عمل المجاهدين في سبيل الله تعالى \" ثم قال لا نعلم رواه عن ثابت إِلا روح بن المسيب، وهو رجل من أهل البصرة مشهور. وقال البزار أيضاً حدثنا محمد بن المثنى، حدثني عمرو بن عاصم، حدثنا همام عن قتادة عن مورّق عن أبي الأحوص عن عبد الله رضي الله عنه، عن النبي صلى الله عليه وسلم قال \" إِن المرأة عورة، فإِذا خرجت، استشرفها الشيطان، وأقرب ما تكون بروحة ربها، وهي في قعر بيتها \" رواه الترمذي عن بندار عن عمرو بن عاصم به نحوه. وروى البزار بإِسناده المتقدم، وأبو داوود أيضاً عن النبي صلى الله عليه وسلم قال \" صلاة المرأة في مخدعها أفضل من صلاتها في بيتها، وصلاتها في بيتها أفضل من صلاتها في حجرتها \" وهذا إِسناد جيد. وقوله تعالى { وَلاَ تَبَرَّجْنَ تَبَرُّجَ وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } قال مجاهد كانت المرأة تخرج تمشي بين يدي الرجال، فذلك تبرج الجاهلية. وقال قتادة { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } يقول إِذا خرجتن من بيوتكن، وكانت لهن مشية وتكسر وتغنج، فنهى الله تعالى عن ذلك.\n\n                                   وقال مقاتل بن حيان { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } والتبرج أنها تلقي الخمار على رأسها، ولا تشده، فيواري قلائدها وقرطها وعنقها، ويبدو ذلك كله منها، وذلك التبرج، ثم عمت نساء المؤمنين في التبرج. وقال ابن جرير حدثني ابن زهير، حدثنا موسى بن إسماعيل، حدثنا داود يعني بن أبي الفرات، حدثنا علي بن أحمر عن عكرمة عن ابن عباس رضي الله عنهما قال تلا هذه الآية { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } قال كانت فيما بين نوح وإِدريس، وكانت ألف سنة، وإِن بطنين من ولد آدم كان أحدهما يسكن السهل، والآخر يسكن الجبل، وكان رجال الجبل صِباحاً، وفي النساء دَمامة. وكان نساء السهل صِباحاً وفي الرجال دَمامة، وإِن إِبليس لعنه الله أتى رجلاً من أهل السهل في صورة غلام، فآجر نفسه منه، فكان يخدمه، فاتخذ إِبليس شيئاً من مثل الذي يزمر فيه الرعاء، فجاء فيه بصوت لم يسمع الناس مثله، فبلغ ذلك من حوله، فانتابوهم يسمعون إِليه، واتخذوا عيداً يجتمعون إِليه في السنة، فيتبرج النساء للرجال، قال ويتزين الرجال لهن، وإِن رجلاً من أهل الجبل هجم عليهم في عيدهم ذلك، فرأى النساء وصباحتهن، فأتى أصحابه، فأخبرهم بذلك، فتحولوا إِليهن، فنزلوا معهن، وظهرت الفاحشة فيهن، فهو قول الله تعالى { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ }. وقوله تعالى { وَأَقِمْنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَـوٰةَ وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } نهاهن أولاً عن الشر، ثم أمرهن بالخير من إِقامة الصلاة، وهي عبادة الله وحده لا شريك له، وإِيتاء الزكاة، وهي الإحسان إِلى المخلوقين، { وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } وهذا من باب عطف العام على الخاص. وقوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } وهذا نص في دخول أزواج النبي صلى الله عليه وسلم في أهل البيت ههنا لأنهن سبب نزول هذه الآية، وسبب النزول داخل فيه قولاً واحداً، إِما وحده على قول، أو مع غيره على الصحيح. وروى ابن جرير عن عكرمة أنه كان ينادي في السوق { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ } نزلت في نساء النبي صلى الله عليه وسلم خاصة. وهكذا روى ابن أبي حاتم قال حدثنا علي بن حرب الموصلي، حدثنا زيد بن الحباب حدثنا حسين بن واقد عن يزيد النحوي عن عكرمة عن ابن عباس رضي الله عنهما في قوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ } قال نزلت في نساء النبي صلى الله عليه وسلم خاصة. وقال عكرمة من شاء باهلته أنها نزلت في شأن نساء النبي صلى الله عليه وسلم فإِن كان المراد أنهن كن سبب النزول دون غيرهن، فصحيح، وإِن أريد أنهن المراد فقط دون غيرهن، ففيه نظر، فإِنه قد وردت أحاديث تدل على أن المراد أعم من ذلك الحديث الأول قال الإمام أحمد حدثنا عفان، حدثنا حماد، أخبرنا علي بن زيد عن أنس بن مالك رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم كان يمر بباب فاطمة رضي الله عنها ستة أشهر إِذا خرج إِلى صلاة الفجر يقول\n\n                                   \" الصلاة يا أهل البيت إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيراً \" رواه الترمذي عن عبد بن حميد عن عفان به. وقال حسن غريب. حديث آخر قال ابن جرير حدثنا ابن وكيع، حدثنا أبو نعيم، حدثنا يونس عن أبي إِسحاق، أخبرني أبو داود عن أبي الحمراء قال رابطت المدينة سبعة أشهر على عهد رسول الله صلى الله عليه وسلم قال رأيت رسول الله صلى الله عليه وسلم إِذا طلع الفجر، جاء إِلى باب علي وفاطمة رضي الله عنهما، فقال \" الصلاة الصلاة، إِنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيراً \" أبو داود الأعمى هو نفيع بن الحارث كذاب. حديث آخر وقال الإمام أحمد أيضاً حدثنا محمد بن مصعب، حدثنا الأوزاعي، حدثنا شداد أبو عمار قال دخلت على واثلة بن الأسقع رضي الله عنه، وعنده قوم، فذكروا علياً رضي الله عنه فشتموه، فشتمته معهم، فلما قاموا قال لي شتمت هذا الرجل؟ قلت قد شتموه فشتمته معهم، ألا أخبرك بما رأيت من رسول الله صلى الله عليه وسلم قلت بلى، قال أتيت فاطمة رضي الله عنها أسألها عن علي رضي الله عنه، فقالت توجه إِلى رسول الله صلى الله عليه وسلم فجلست أنتظره حتى جاء رسول الله صلى الله عليه وسلم ومعه علي وحسن وحسين رضي الله عنهم، آخذ كل واحدٍ منهما بيده حتى دخل، فأدنى علياً وفاطمة رضي الله عنهما، وأجلسهما بين يديه، وأجلس حسناً وحسيناً رضي الله عنهما كل واحد منها على فخذه، ثم لف عليهم ثوبه، أو قال كساءه، ثم تلا صلى الله عليه وسلم هذه الآية { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } وقال \" اللهم هؤلاء أهل بيتي، وأهل بيتي أحق \". وقد رواه أبو جعفر بن جرير عن عبد الكريم بن أبي عمير عن الوليد بن مسلم، عن أبي عمرو الأوزاعي بسنده نحوه، زاد في آخره قال واثلة رضي الله عنه فقلت وأنا يا رسول الله صلى الله عليك من أهلك؟ قال صلى الله عليه وسلم \" وأنت من أهلي \" قال واثلة رضي الله عنه وإِنها من أرجى ما أرتجي. ثم رواه أيضاً عن عبد الأعلى بن واصل عن الفضل بن دكين، عن عبد السلام بن حرب عن كلثوم المحاربي عن شداد أبي عمار قال إِني لجالس عند واثلة بن الأسقع رضي الله عنه، إِذ ذكروا علياً رضي الله عنه، فشتموه، فلما قاموا، قال اجلس حتى أخبرك عن هذا الذي شتموه إِني عند رسول الله صلى الله عليه وسلم إِذ جاء علي وفاطمة وحسن وحسين رضي الله عنهم، فألقى صلى الله عليه وسلم عليهم كساء له، ثم قال لهم\n                                   \n                                   \" اللهم هؤلاء أهل بيتي، اللهم أذهب عنهم الرجس وطهرهم تطهيراً \" قلت يارسول الله وأنا؟ قال صلى الله عليه وسلم \" وأنت \" قال فوالله إِنها لأوثق عمل عندي. حديث آخر قال الإمام أحمد حدثنا عبد الله بن نمير، حدثنا عبد الملك بن أبي سليمان عن عطاء بن أبي رباح، حدثني من سمع أم سلمة رضي الله عنها تذكر أن النبي صلى الله عليه وسلم كان في بيتها، فأتته فاطمة رضي الله عنها ببرمة فيها خزيرة، فدخلت عليه بها، فقال صلى الله عليه وسلم لها \" ادعي زوجك وابنيك \" قالت فجاء علي وحسن وحسين رضي الله عنهم، فدخلوا عليه، فجلسوا يأكلون من تلك الخزيرة، وهو على منامة له، وكان تحته صلى الله عليه وسلم كساء خيبري، قالت وأنا في الحجرة أصلي، فأنزل الله عز وجل هذه الآية { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت رضي الله عنها فأخذ صلى الله عليه وسلم فضل الكساء، فغطاهم به، ثم أخرج يده، فألوى بها إِلى السماء ثم قال \" اللهم هؤلاء أهل بيتي وخاصتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" قالت فأدخلت رأسي البيت، فقلت وأنا معكم يارسول الله؟ فقال صلى الله عليه وسلم \" إِنك إِلى خير، إِنك إِلى خير \" في إِسناده من لم يسم، وهو شيخ عطاء، وبقية رجاله ثقات. طريق أخرى قال ابن جرير حدثنا أبو كريب، حدثنا مصعب بن المقداد، حدثنا سعيد بن زربي عن محمد بن سيرين عن أبي هريرة عن أم سلمة رضي الله عنها قالت جاءت فاطمة رضي الله عنها إِلى رسول الله صلى الله عليه وسلم ببرمة لها قد صنعت فيها عصيدة، تحملها على طبق، فوضعتها بين يديه صلى الله عليه وسلم فقال \" أين ابن عمك وابناك؟ \" فقالت رضي الله عنها في البيت، فقال صلى الله عليه وسلم \" ادعيهم \" ، فجاءت إِلى علي رضي الله عنه فقالت أجب رسول الله صلى الله عليه وسلم أنت وابناك، قالت أم سلمة رضي الله عنها فلما رآهم مقبلين، مد صلى الله عليه وسلم يده إِلى كساء كان على المنامة، فمده وبسطه، وأجلسهم عليه، ثم أخذ بأطراف الكساء الأربعة بشماله، فضمه فوق رؤوسهم، وأومأ بيده اليمنى إِلى ربه فقال :\n                                   \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \". طريق أخرى قال ابن جرير حدثنا ابن حميد حدثنا عبد الله بن عبد القدوس، عن الأعمش عن حكيم بن سعد قال ذكرنا علي بن أبي طالب رضي الله عنه عند أم سلمة رضي الله عنها، فقالت في بيتي نزلت { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت أم سلمة جاء رسول الله صلى الله عليه وسلم إِلى بيتي، فقال \" لاتأذني لأحد \" فجاءت فاطمة رضي الله عنها، فلم أستطع أن أحجبها عن أبيها، ثم جاء الحسن رضي الله عنه، فلم أستطع أن أمنعه أن يدخل على جده وأمه، ثم جاء الحسين، فلم أستطع أن أحجبه عن جده صلى الله عليه وسلم وأمه رضي الله عنها، ثم جاء علي رضي الله عنه، فلم أستطع أن أحجبه، فاجتمعوا، فجللهم رسول الله صلى الله عليه وسلم بكساء كان عليه، ثم قال \" هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" فنزلت هذه الآية حين اجتمعوا على البساط، قالت فقلت يارسول الله وأنا؟ قالت فوالله ماأنعم، وقال \" إِنك إِلى خير \". طريق أخرى قال الإمام أحمد حدثنا محمد بن جعفر، حدثنا عوف عن أبي المعدل عن عطية الطفاوي عن أبيه قال إِن أم سلمة رضي الله عنها حدثته قالت بينما رسول الله صلى الله عليه وسلم في بيتي يوماً، إِذ قالت الخادم إِن فاطمة وعلياً رضي الله عنهما بالسدة، قالت فقال لي رسول الله صلى الله عليه وسلم \" قومي فتنحي عن أهل بيتي \" قالت فقمت فتنحيت في البيت قريباً، فدخل علي وفاطمة ومعهما الحسن والحسين رضي الله عنهم، وهما صبيان صغيران، فأخذ الصبيين فوضعهما في حجره فقبلهما، واعتنق علياً رضي الله عنه بإِحدى يديه، وفاطمة رضي الله عنها باليد الأخرى، وقبل فاطمة، وقبل علياً، وأغدق عليهم خميصة سوداء، وقال \" اللهم إِليك لا إِلى النار أنا وأهل بيتي \" قالت فقلت وأنا يارسول الله؟ فقال صلى الله عليه وسلم \" وأنت \". طريق أخرى قال ابن جرير حدثنا أبو كريب، حدثنا الحسن بن عطية، حدثنا فضيل بن مرزوق عن عطية عن أبي سعيد عن أم سلمة رضي الله عنها قالت إِن هذه الآية نزلت في بيتي { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت وأنا جالسة على باب البيت، فقلت يارسول الله ألست من أهل البيت؟ فقال صلى الله عليه وسلم \" إِنك إِلى خير، أنت من أزواج النبي صلى الله عليه وسلم \" قالت وفي البيت رسول الله صلى الله عليه وسلم وعلي وفاطمة والحسن والحسين رضي الله عنهم.\n                                   طريق أخرى رواها ابن جرير أيضاً عن أبي كريب عن وكيع عن عبد الحميد بن بهرام عن شهر بن حوشب عن أم سلمة رضي الله عنها بنحوه. طريق أخرى قال ابن جرير حدثنا أبو كريب حدثنا خالد بن مخلد، حدثني موسى بن يعقوب، حدثني هاشم بن هاشم بن عتبة بن أبي وقاص، عن عبد الله بن وهب بن زمعة قال أخبرتني أم سلمة رضي الله عنها قالت إِن رسول الله صلى الله عليه وسلم جمع علياً وفاطمة والحسن والحسين رضي الله عنهم، ثم أدخلهم تحت ثوبه، ثم جأر إِلى الله عز وجل ثم قال \" هؤلاء أهل بيتي \" قالت أم سلمة رضي الله عنها فقلت يارسول الله أدخلني معهم، فقال صلى الله عليه وسلم \" أنت من أهلي \". طريق أخرى رواه ابن جرير أيضاً عن أحمد بن محمد الطوسي، عن عبد الرحمن بن صالح، عن محمد بن سليمان الأصبهاني، عن يحيى بن عبيد المكي عن عطاء، عن عمر بن أبي سلمة عن أمه رضي الله عنها، بنحو ذلك. طريق أخرى قال ابن جرير حدثنا أبو كُرَيْب، حدثنا مصعب بن المقداد، حدثنا سعيد بن زربي، عن محمد بن سيرين، عن أبي هريرة، عن أم سلمة قالت جاءت فاطمة إِلى رسول الله صلى الله عليه وسلم ببرمة لها قد صنعت فيها عصيدة، تحملها على طبق، فوضعتها بين يديه فقال \" أين ابن عمك وابناك؟ \" فقالت في البيت، فقال \" ادعيهم \" ، فجاءت إِلى علي فقالت أجبْ رسول الله أنت وابناك. قالت أم سلمة فلما رآهم مقبلين، مد يده إِلي كساء كان على المنامة، فَمده، وبسطه، وأجلسهم عليه، ثم أخذ بأطراف الكساء الأربعة بشماله، فضمه فوق رؤوسهم، وأومأ بيده اليمنى إِلى ربه، فقال \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \". طريق أخرى قال ابن جرير حدثنا ابن حميد حدثنا عبد الله بن عبد القدوس، عن الأعمش، عن حكيم بن سعد قال ذكرنا علي بن أبي طالب عند أم سلمة، فقالت في بيتي نزلت { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت أم سلمة جاء رسول الله صلى الله عليه وسلم إِلي بيتي، فقال \" لا تأذني لأحد \" فجاءت فاطمة، فلم أستطع أن أحجبها عن أبيها، ثم جاء الحسن، فلم أستطع أن أحجبه عن أمه وجده، ثم جاء الحسين فلم أستطع أن أحجبه، ثم جاء علي، فلم أستطع أن أحجبه، فاجتمعوا، فجَلّلهم رسول الله صلى الله عليه وسلم بكساء كان عليه، ثم قال : \n                                   \" هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" فنزلت هذه الآية حين اجتمعوا على البساط، قالت فقلت يارسول الله، وأنا؟ قالت فوالله ما أنعم، وقال \" إِنك إِلى خير \". حديث آخر قال ابن جرير حدثنا ابن وكيع محمد بن بشير عن زكريا عن مصعب بن شيبة عن صفية بنت شيبة قالت قالت عائشة رضي الله عنها خرج النبي صلى الله عليه وسلم ذات غداة، وعليه مرطٌ مرحل من شعر أسود، فجاء الحسن رضي الله عنه، فأدخله معه، ثم جاء الحسين، فأدخله معه، ثم جاءت فاطمة، فأدخلها معه، ثم جاء علي رضي الله عنه، فأدخله معه، ثم قال صلى الله عليه وسلم \" { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } \" رواه مسلم عن أبي بكر بن أبي شيبة عن محمد بن بشر به. طريق أخرى قال ابن أبي حاتم حدثنا أبي، حدثنا سريج بن يونس أبو الحارث، حدثنا محمد بن يزيد عن العوام، يعني ابن حوشب رضي الله عنه، عن عم له قال دخلت مع أبي على عائشة رضي الله عنها، فسألتها عن علي رضي الله عنه، فقالت رضي الله عنها تسألني عن رجل كان من أحب الناس إِلى رسول الله صلى الله عليه وسلم وكانت تحته ابنته، وأحب الناس إِليه؟ لقد رأيت رسول الله صلى الله عليه وسلم دعا علياً وفاطمة وحسناً وحسيناً رضي الله عنهم، فألقى عليهم ثوباً فقال \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس، وطهرهم تطهيراً \" قالت فدنوت منهم فقلت يارسول الله وأنا من أهل بيتك؟ فقال صلى الله عليه وسلم \" تنحي فإِنك على خير \". حديث آخر قال ابن جرير حدثنا ابن المثنى، حدثنا بكر بن يحيى بن زبان العنزي، حدثنا مندل عن الأعمش عن عطية عن أبي سعيد رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" نزلت هذه الآية في خمسة فيّ وفي علي وحسن وحسين وفاطمة { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } \" قد تقدم أن فضيل بن مرزوق رواه عن عطية عن أبي سعيد عن أم سلمة رضي الله عنها كما تقدم. وروى ابن أبي حاتم من حديث هارون بن سعد العجلي عن عطية عن أبي سعيد رضي الله عنه موقوفاً، والله سبحانه وتعالى أعلم. حديث آخر قال ابن جرير حدثنا ابن المثنى، حدثنا أبو بكر الحنفي، حدثنا بكير بن مسمار قال سمعت عامر بن سعد رضي الله عنه قال قال سعد رضي الله عنه قال رسول الله صلى الله عليه وسلم حين نزل عليه الوحي، فأخذ علياً وابنيه وفاطمة رضي الله عنهم، فأدخلهم تحت ثوبه ثم قال\n                                   \n\" رب هؤلاء أهلي وأهل بيتي \". حديث آخر وقال مسلم في \" صحيحه \" حدثني زهير بن حرب وشجاع بن مخلد جميعاً عن ابن علية، قال زهير حدثنا إِسماعيل بن إِبراهيم، حدثني أبو حيان، حدثني يزيد بن حبان قال انطلقت أنا وحصين بن سبرة وعمر بن مسلم إِلى زيد بن أرقم رضي الله عنه، فلما جلسنا إِليه، قال له حصين لقد لقيت يازيد خيراً كثيراً رأيت رسول الله صلى الله عليه وسلم وسمعت حديثه، وغزوت معه، وصليت خلفه، لقد لقيت يا زيد خيراً كثيراً، حدثنا يا زيد ما سمعت من رسول الله صلى الله عليه وسلم قال يابن أخي والله لقد كبرت سني، وقدم عهدي، ونسيت بعض الذي كنت أعي من رسول الله صلى الله عليه وسلم فما حدثتكم فاقبلوا، ومالا فلا تكلفونيه، ثم قال قام فينا رسول الله صلى الله عليه وسلم يوماً خطيباً بماء يدعى خماً، بين مكة والمدينة، فحمد الله تعالى وأثنى عليه، ووعظ وذكر، ثم قال \" أما بعد، ألا أيها الناس فإِنما أنا بشر يوشك أن يأتيني رسول ربي فأجيب، وأنا تارك فيكم ثقلين أولهما كتاب الله تعالى، فيه الهدى والنور، فخذوا بكتاب الله، واستمسكوا به \" فحث على كتاب الله عز وجل، ورغب فيه، ثم قال \" وأهل بيتي، أذكركم الله في أهل بيتي، أذكركم الله في أهل بيتي \" ثلاثاً، فقال له حصين ومن أهل بيته يازيد؟ أليس نساؤه من أهل بيته؟ قال نساؤه من أهل بيته، ولكن أهل بيته من حرم الصدقة بعده، قال ومن هم؟ قال هم آل علي وآل عقيل وآل جعفر وآل العباس رضي الله عنهم، قال كل هؤلاء حرم الصدقة بعده؟ قال نعم. ثم رواه عن محمد بن بكار بن الريان عن حسان بن إِبراهيم عن سعيد بن مسروق عن يزيد بن حيان عن زيد بن أرقم رضي الله عنه، فذكر الحديث بنحو ما تقدم، وفيه فقلت له من أهل بيته، نساؤه؟ قال لا، وايم الله إِن المرأة تكون مع الرجل العصر من الدهر، ثم يطلقها، فترجع إِلى أبيها وقومها، أهل بيته أصله وعصبته الذين حرموا الصدقة بعده. هكذا وقع في هذه الرواية، والأولى أولى، والأخذ بها أحرى. وهذه الثانية تحتمل أنه أراد تفسير الأهل المذكورين في الحديث الذي رواه، إِنما المراد بهم آله الذين حرموا الصدقة، أو أنه ليس المراد بالأهل الأزواج فقط، بل هم مع آله، وهذا الاحتمال أرجح جمعاً بينها وبين الرواية التي قبلها، وجمعاً أيضاً بين القرآن والأحاديث المتقدمة إِن صحت، فإِن في بعض أسانيدها نظراً، والله أعلم، ثم الذي لا يشك فيه من تدبر القرآن أن نساء النبي صلى الله عليه وسلم داخلات في قوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } فإِن سياق الكلام معهن، ولهذا قال تعالى بعد هذا كله { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِى بُيُوتِكُـنَّ مِنْ ءَايَـٰتِ ٱللَّهِ وَٱلْحِكْــمَةِ } أي واعملن بما ينزل الله تبارك وتعالى على رسوله صلى الله عليه وسلم في بيوتكن من الكتاب والسنة، قاله قتادة وغير واحد، واذكرن هذه النعمة التي خصصتن بها من بين الناس، أن الوحي ينزل في بيوتكن دون سائر الناس، وعائشة الصديقة بنت الصديق رضي الله عنهما أولاهن بهذه النعمة، وأحظاهن بهذه الغنيمة، وأخصهن من هذه الرحمة العميمة، فإِنه لم ينزل على رسول الله صلى الله عليه وسلم الوحي في فراش امرأة سواها، كما نص على ذلك صلوات الله وسلامه عليه.\n                                   \nقال بعض العلماء رحمه الله لأنه لم يتزوج بكراً سواها، ولم ينم معها رجل في فراشها سواه صلى الله عليه وسلم ورضي الله عنها، فناسب أن تخصص بهذه المزية، وأن تفرد بهذه المرتبة العليا، ولكن إِذا كان أزواجه من أهل بيته، فقرابته أحق بهذه التسمية كما تقدم في الحديث \" وأهل بيتي أحق \" وهذا مايشبه ماثبت في \" صحيح مسلم \" أن رسول الله صلى الله عليه وسلم لما سئل عن المسجد الذي أسس على التقوى من أول يوم، فقال \" هو مسجدي هذا \" فهذا من هذا القبيل، فإِن الآية إِنما نزلت في مسجد قباء كما ورد في الأحاديث الأخر، ولكن إِذا كان ذاك أسس على التقوى من أول يوم، فمسجد رسول الله صلى الله عليه وسلم أولى بتسميته بذلك، والله أعلم. وقد قال ابن أبي حاتم حدثنا أبي، حدثنا أبو الوليد، حدثنا أبو عوانة عن حصين بن عبد الرحمن عن أبي جميلة قال إِن الحسن بن علي رضي الله عنهما استخلف حين قتل علي رضي الله عنهما، قال فبينما هو يصلي، إِذ وثب عليه رجل، فطعنه بخنجره، وزعم حصين أنه بلغه أن الذي طعنه رجل من بني أسد، وحسن رضي الله عنه ساجد. قال فيزعمون أن الطعنة وقعت في وركه، فمرض منها أشهراً، ثم برأ، فقعد على المنبر فقال يا أهل العراق اتقوا الله فينا، فإِنا أمراؤكم وضيفانكم، ونحن أهل البيت الذي قال الله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قال فما زال يقولها حتى ما بقي أحد من أهل المسجد إِلا وهو يحن بكاءً. وقال السدي عن أبي الديلم قال قال علي بن الحسين رضي الله عنهما لرجل من أهل الشام أما قرأت في الأحزاب { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً }؟ فقال نعم، ولأنتم هم؟ قال نعم.\n                                   وقوله تعالى { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } أي بلطفه بكن بلغتن هذه المنزلة، وبخبرته بكن وأنكن أهل لذلك أعطاكن ذلك، وخصكن بذلك. قال ابن جرير رحمه الله واذكرن نعمة الله عليكن بأن جعلكن في بيوت تتلى فيها آيات الله والحكمة، فاشكرن الله تعالى على ذلك واحمدنه، { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } أي ذا لطف بكن، إِذ جعلكن في البيوت التي تتلى فيها آيات الله والحكمة، وهي السنة. خبيراً بكن، إِذ اختاركن لرسوله أزواجاً. وقال قتادة { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِى بُيُوتِكُـنَّ مِنْ ءَايَـٰتِ ٱللَّهِ وَٱلْحِكْــمَةِ } قال يمتن عليهن بذلك، رواه ابن جرير. وقال عطية العوفي في قوله تعالى { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } يعني لطيفاً باستخراجها، خبيراً بموضعها، رواه ابن أبي حاتم، ثم قال وكذا روي عن الربيع بن أنس عن قتادة.\n                                    ",
        "qortoby": "يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا ٢٣\n                                    \n                                    \n                                    قوله تعالى: { يٰنِسَآءَ ٱلنَّبِيِّ لَسْتُنَّ كَأَحَدٍ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيْتُنَّ } يعني في الفضل والشرف. وقال: «كَأَحَدٍ» ولم يقل كواحدة؛ لأن أحداً نفي من المذكر والمؤنث والواحد والجماعة. وقد يقال على ما ليس بآدميّ؛ يقال: ليس فيها أحد، لا شاة ولا بعير. وإنما خصص النساء بالذكر لأن فيمن تقدم آسية ومريم. وقد أشار إلى هذا قتادة؛ وقد تقدّم في «آل عمران» الاختلاف في التفضيل بينهن، فتأمله هناك. ثم قال: { إِنِ ٱتَّقَيْتُنَّ } أي خفتن الله. فبيّن أن الفضيلة إنما تتم لهن بشرط التقوى؛ لما منحهن الله من صحبة الرسول وعظيم المحل منه، ونزول القرآن في حقهن.\n\nقوله تعالى: { فَلاَ تَخْضَعْنَ بِٱلْقَوْلِ } في موضع جزم بالنهي؛ إلا أنه مبنيّ كما بني الماضي، هذا مذهب سيبويه؛ أي لا تلنّ القول. أمرهن الله أن يكون قولهن جزلاً وكلامهن فصلاً، ولا يكون على وجه يُظهر في القلب علاقة بما يَظهر عليه من اللين؛ كما كانت الحال عليه في نساء العرب من مكالمة الرجال بترخيم الصوت ولينه؛ مثل كلام المريبات والمومسات. فنهاهن عن مثل هذا.\n\nقوله تعالى: { فَيَطْمَعَ } بالنصب على جواب النهي. { ٱلَّذِي فِي قَلْبِهِ مَرَضٌ } أي شك ونفاق؛ عن قتادة والسُّدِّي. وقيل: تشوف لفجور، وهو الفسق والغَزَل؛ قاله عكرمة. وهذا أصوب، وليس للنفاق مدخل في هذه الآية. وحكى أبو حاتم أن الأعرج قرأ «فَيَطْمِع» بفتح الياء وكسر الميم. النحاس: أحسب هذا غلطاً، وأن يكون قرأ «فيطمَعِ» بفتح الميم وكسر العين بعطفه على «تَخْضَعْنَ» فهذا وجه جيد حسن. ويجوز «فيُطْمِع» بمعنى فيطمع الخضوع أو القول.\n\nقوله تعالى: { وَقُلْنَ قَوْلاً مَّعْرُوفاً } قال ابن عباس: أمرهن بالأمر بالمعروف والنهي عن المنكر. والمرأة تندب إذا خاطبت الأجانب وكذا المحرّمات عليها بالمصاهرة إلى الغلظة في القول من غير رفع صوت؛ فإن المرأة مأمورة بخفض الكلام. وعلى الجملة فالقول المعروف: هو الصواب الذي لا تنكره الشريعة ولا النفوس.\n                                    ",
        "saadi": "يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا ٢٣\n                                        \n                                        \n                                        \n                                        يقول تعالى: { يٰنِسَآءَ ٱلنَّبِيِّ } خطاب لهن كلهن { لَسْتُنَّ كَأَحَدٍ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيْتُنَّ } اللّه، فإنكن بذلك تفقن النساء، ولا يلحقكن أحد من النساء، فكملن التقوى بجميع وسائلها ومقاصدها. فلهذا أرشدهن إلى قطع وسائل المحرم، فقال: { فَلاَ تَخْضَعْنَ بِٱلْقَوْلِ } أي: في مخاطبة الرجال، أو بحيث يسمعون فتَلِنَّ في ذلك، وتتكلمن بكلام رقيق يدعو ويطمع { ٱلَّذِي فِي قَلْبِهِ مَرَضٌ } أي: مرض شهوة الزنا، فإنه مستعد، ينظر أدنى محرك يحركه، لأن قلبه غير صحيح، [فإن القلب الصحيح]، ليس فيه شهوة لما حرم اللّه، فإن ذلك لا تكاد تُمِيلُه ولا تحركه الأسباب، لصحة قلبه وسلامته من المرض. بخلاف مريض القلب، الذي لا يتحمل ما يتحمل الصحيح، ولا يصبر على ما يصبر عليه، فأدنى سبب يوجد، يدعوه إلى الحرام، يجيب دعوته، ولا يتعاصى عليه، فهذا دليل على أن الوسائل لها أحكام المقاصد. فإن الخضوع بالقول واللين فيه، في الأصل مباح، ولكن لما كان وسيلة إلى المحرم، منع منه، ولهذا ينبغي للمرأة في مخاطبة الرجال، أن لا تلِين لهم القول. ولما نهاهن عن الخضوع في القول، فربما توهم أنهن مأمورات بإغلاظ القول، دفع هذا بقوله: { وَقُلْنَ قَوْلاً مَّعْرُوفاً } أي: غير غليظ ولا جاف، كما أنه ليس بِلَيِّنٍ خاضع. وتأمل كيف قال: { فَلاَ تَخْضَعْنَ بِٱلْقَوْلِ } ولم يقل: \" فلا تلِنَّ بالقول \" وذلك لأن المنهي عنه القول اللين، الذي فيه خضوع المرأة للرجل، وانكسارها عنده، والخاضع هو الذي يطمع فيه، بخلاف من تكلم كلاماً ليناً ليس فيه خضوع، بل ربما صار فيه ترفع وقهر للخصم، فإن هذا لا يطمع فيه خصمه، ولهذا مدح اللّه رسوله باللين، فقال:\n{ فَبِمَا رَحْمَةٍ مِّنَ ٱللَّهِ لِنتَ لَهُمْ }\n[آل عمران: 159] وقال لموسى وهارون:\n{ ٱذْهَبَآ إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ* فَقُولاَ لَهُ قَوْلاً لَّيِّناً لَّعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَىٰ }\n[طه: 43-44]. ودلَّ قوله: { فَيَطْمَعَ ٱلَّذِي فِي قَلْبِهِ مَرَضٌ } مع أمره بحفظ الفرج وثنائه على الحافظين لفروجهم والحافظات، ونهيه عن قربان الزنا، أنه ينبغي للعبد إذا رأى من نفسه هذه الحالة، وأنه يهش لفعل المحرم عندما يرى أو يسمع كلام مَنْ يهواه، ويجد دواعي طمعه قد انصرفت إلى الحرام، فَلْيَعْرِفْ أن ذلك مرض. فَلْيَجْتَهِدْ في إضعاف هذا المرض وحسم الخواطر الردية، ومجاهدة نفسه على سلامتها من هذا المرض الخطر، وسؤال اللّه العصمة والتوفيق، وأن ذلك من حفظ الفرج المأمور به. { وَقَرْنَ فِي بُيُوتِكُنَّ } أي: اقررن فيها، لأنه أسلم وأحفظ لَكُنَّ، { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَاهِلِيَّةِ ٱلأُولَىٰ } أي: لا تكثرن الخروج متجملات أو متطيبات، كعادة أهل الجاهلية الأولى، الذين لا علم عندهم ولا دين، فكل هذا دفع للشر وأسبابه. ولما أمرهن بالتقوى عموماً، وبجزئيات من التقوى، نص عليها [لحاجة] النساء إليها، كذلك أمرهن بالطاعة، خصوصاً الصلاة والزكاة، اللتان يحتاجهما ويضطر إليهما كل أحد، وهما أكبر العبادات، وأجل الطاعات، وفي الصلاة الإخلاص للمعبود، وفي الزكاة الإحسان إلى العبيد.\n                                   ثم أمرهن بالطاعة عموماً، فقال: { وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } يدخل في طاعة اللّه ورسوله، كل أمر أمرا به أمر إيجاب أو استحباب. { إِنَّمَا يُرِيدُ ٱللَّهُ } بأمركن بما أَمَرَكُنَّ به، ونهيكن بما نهاكُنَّ عنه، { لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ } أي: الأذى والشر والخبث، يا { أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } حتى تكونوا طاهرين مطهرين. أي: فاحمدوا ربكم واشكروه على هذه الأوامر والنواهي، التي أخبركم بمصلحتها وأنها محض مصلحتكم، لم يرد اللّه أن يجعل عليكم بذلك حرجاً ولا مشقة، بل لتتزكى نفوسكم، ولتتطهر أخلاقكم، وتحسن أعمالكم، ويعظم بذلك أجركم. ولما أمرهن بالعمل الذي هو فعل وترك، أمرهن بالعلم، وبيَّن لهن طريقه، فقال: { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِي بُيُوتِكُـنَّ مِنْ آيَاتِ ٱللَّهِ وَٱلْحِكْـمَةِ } والمراد بآيات اللّه، القرآن. والحكمة، أسراره. أو سُنّة رسوله. وأمرهن بذكره، يشمل ذكر لفظه، بتلاوته، وذكر معناه، بتدبره والتفكر فيه، واستخراج أحكامه وحكمه، وذكر العمل به وتأويله. { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } يدرك أسرار الأمور، وخفايا الصدور، وخبايا السماوات والأرض، والأعمال التي تبين وتسر. فلطفه وخبرته، يقتضي حثهن على الإخلاص وإسرار الأعمال، ومجازاة اللّه على تلك الأعمال. ومن معاني \" اللطيف \" الذي يسوق عبده إلى الخير، ويعصمه من الشر، بطرق خفية لا يشعر بها، ويسوق إليه من الرزق ما لا يدريه، ويريه من الأسباب التي تكرهها النفوس ما يكون ذلك طريقاً [له] إلى أعلى الدرجات، وأرفع المنازل.\n                                    "
      },
      "originalText": "يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا ٢٣"
    },
    {
      "number": 3566,
      "text": "وَقَرْنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجْنَ تَبَرُّجَ الْجَاهِلِيَّةِ الْأُولَىٰ ۖ وَأَقِمْنَ الصَّلَاةَ وَآتِينَ الزَّكَاةَ وَأَطِعْنَ اللَّهَ وَرَسُولَهُ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 33,
      "juz": 22,
      "manzil": 5,
      "page": 422,
      "ruku": 364,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَرۡنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ ٱلۡجَٰهِلِيَّةِ ٱلۡأُولَىٰۖ وَأَقِمۡنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعۡنَ ٱللَّهَ وَرَسُولَهُۥٓۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذۡهِبَ عَنكُمُ ٱلرِّجۡسَ أَهۡلَ ٱلۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيرٗا ٣٣\n                                    \n                                    \n                                    هذه آداب أمر الله تعالى بها نساء النبي صلى الله عليه وسلم ونساءُ الأمة تبع لهن في ذلك، فقال تعالى مخاطباً لنساء النبي صلى الله عليه وسلم بأنهن إِذا اتقين الله عز وجل كما أمرهن، فإِنه لا يشبههن أحد من النساء، ولا يلحقهن في الفضيلة والمنزلة، ثم قال تعالى { فَلاَ تَخْضَعْنَ بِٱلْقَوْلِ } قال السدي وغيره يعني بذلك ترقيق الكلام إِذا خاطبن الرجال، ولهذا قال تعالى { فَيَطْمَعَ ٱلَّذِى فِى قَلْبِهِ مَرَضٌ } أي دغل، { وَقُلْنَ قَوْلاً مَّعْرُوفاً } قال ابن زيد قولاً حسناً جميلاً معروفاً في الخير، ومعنى هذا أنها تخاطب الأجانب بكلام ليس فيه ترخيم، أي لاتخاطب المرأة الأجانب كما تخاطب زوجها. وقوله تعالى { وَقَرْنَ فِى بُيُوتِكُنَّ } أي إلزمن بيوتكن، فلا تخرجن لغير حاجة، ومن الحوائج الشرعية الصلاة في المسجد بشرطه كما قال رسول الله صلى الله عليه وسلم \" لا تمنعوا إِماء الله مساجد الله، وليخرجن وهن تفلات \" وفي رواية \" وبيوتهن خير لهن \" وقال الحافظ أبو بكر البزار حدثنا حميد بن مسعدة، حدثنا أبو رجاء الكلبي روح بن المسيب ثقة، حدثنا ثابت البناني عن أنس رضي الله عنه قال جئن النساء إِلى رسول الله، فقلن يارسول الله ذهب الرجال بالفضل والجهاد في سبيل الله تعالى، فما لنا عمل ندرك به عمل المجاهدين في سبيل الله تعالى، فقال رسول الله صلى الله عليه وسلم \" من قعدت ــــ أو كلمة نحوها ــــ منكن في بيتها، فإِنها تدرك عمل المجاهدين في سبيل الله تعالى \" ثم قال لا نعلم رواه عن ثابت إِلا روح بن المسيب، وهو رجل من أهل البصرة مشهور. وقال البزار أيضاً حدثنا محمد بن المثنى، حدثني عمرو بن عاصم، حدثنا همام عن قتادة عن مورّق عن أبي الأحوص عن عبد الله رضي الله عنه، عن النبي صلى الله عليه وسلم قال \" إِن المرأة عورة، فإِذا خرجت، استشرفها الشيطان، وأقرب ما تكون بروحة ربها، وهي في قعر بيتها \" رواه الترمذي عن بندار عن عمرو بن عاصم به نحوه. وروى البزار بإِسناده المتقدم، وأبو داوود أيضاً عن النبي صلى الله عليه وسلم قال \" صلاة المرأة في مخدعها أفضل من صلاتها في بيتها، وصلاتها في بيتها أفضل من صلاتها في حجرتها \" وهذا إِسناد جيد. وقوله تعالى { وَلاَ تَبَرَّجْنَ تَبَرُّجَ وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } قال مجاهد كانت المرأة تخرج تمشي بين يدي الرجال، فذلك تبرج الجاهلية. وقال قتادة { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } يقول إِذا خرجتن من بيوتكن، وكانت لهن مشية وتكسر وتغنج، فنهى الله تعالى عن ذلك.\n\n                                   وقال مقاتل بن حيان { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } والتبرج أنها تلقي الخمار على رأسها، ولا تشده، فيواري قلائدها وقرطها وعنقها، ويبدو ذلك كله منها، وذلك التبرج، ثم عمت نساء المؤمنين في التبرج. وقال ابن جرير حدثني ابن زهير، حدثنا موسى بن إسماعيل، حدثنا داود يعني بن أبي الفرات، حدثنا علي بن أحمر عن عكرمة عن ابن عباس رضي الله عنهما قال تلا هذه الآية { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } قال كانت فيما بين نوح وإِدريس، وكانت ألف سنة، وإِن بطنين من ولد آدم كان أحدهما يسكن السهل، والآخر يسكن الجبل، وكان رجال الجبل صِباحاً، وفي النساء دَمامة. وكان نساء السهل صِباحاً وفي الرجال دَمامة، وإِن إِبليس لعنه الله أتى رجلاً من أهل السهل في صورة غلام، فآجر نفسه منه، فكان يخدمه، فاتخذ إِبليس شيئاً من مثل الذي يزمر فيه الرعاء، فجاء فيه بصوت لم يسمع الناس مثله، فبلغ ذلك من حوله، فانتابوهم يسمعون إِليه، واتخذوا عيداً يجتمعون إِليه في السنة، فيتبرج النساء للرجال، قال ويتزين الرجال لهن، وإِن رجلاً من أهل الجبل هجم عليهم في عيدهم ذلك، فرأى النساء وصباحتهن، فأتى أصحابه، فأخبرهم بذلك، فتحولوا إِليهن، فنزلوا معهن، وظهرت الفاحشة فيهن، فهو قول الله تعالى { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ }. وقوله تعالى { وَأَقِمْنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَـوٰةَ وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } نهاهن أولاً عن الشر، ثم أمرهن بالخير من إِقامة الصلاة، وهي عبادة الله وحده لا شريك له، وإِيتاء الزكاة، وهي الإحسان إِلى المخلوقين، { وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } وهذا من باب عطف العام على الخاص. وقوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } وهذا نص في دخول أزواج النبي صلى الله عليه وسلم في أهل البيت ههنا لأنهن سبب نزول هذه الآية، وسبب النزول داخل فيه قولاً واحداً، إِما وحده على قول، أو مع غيره على الصحيح. وروى ابن جرير عن عكرمة أنه كان ينادي في السوق { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ } نزلت في نساء النبي صلى الله عليه وسلم خاصة. وهكذا روى ابن أبي حاتم قال حدثنا علي بن حرب الموصلي، حدثنا زيد بن الحباب حدثنا حسين بن واقد عن يزيد النحوي عن عكرمة عن ابن عباس رضي الله عنهما في قوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ } قال نزلت في نساء النبي صلى الله عليه وسلم خاصة. وقال عكرمة من شاء باهلته أنها نزلت في شأن نساء النبي صلى الله عليه وسلم فإِن كان المراد أنهن كن سبب النزول دون غيرهن، فصحيح، وإِن أريد أنهن المراد فقط دون غيرهن، ففيه نظر، فإِنه قد وردت أحاديث تدل على أن المراد أعم من ذلك الحديث الأول قال الإمام أحمد حدثنا عفان، حدثنا حماد، أخبرنا علي بن زيد عن أنس بن مالك رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم كان يمر بباب فاطمة رضي الله عنها ستة أشهر إِذا خرج إِلى صلاة الفجر يقول\n\n                                   \" الصلاة يا أهل البيت إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيراً \" رواه الترمذي عن عبد بن حميد عن عفان به. وقال حسن غريب. حديث آخر قال ابن جرير حدثنا ابن وكيع، حدثنا أبو نعيم، حدثنا يونس عن أبي إِسحاق، أخبرني أبو داود عن أبي الحمراء قال رابطت المدينة سبعة أشهر على عهد رسول الله صلى الله عليه وسلم قال رأيت رسول الله صلى الله عليه وسلم إِذا طلع الفجر، جاء إِلى باب علي وفاطمة رضي الله عنهما، فقال \" الصلاة الصلاة، إِنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيراً \" أبو داود الأعمى هو نفيع بن الحارث كذاب. حديث آخر وقال الإمام أحمد أيضاً حدثنا محمد بن مصعب، حدثنا الأوزاعي، حدثنا شداد أبو عمار قال دخلت على واثلة بن الأسقع رضي الله عنه، وعنده قوم، فذكروا علياً رضي الله عنه فشتموه، فشتمته معهم، فلما قاموا قال لي شتمت هذا الرجل؟ قلت قد شتموه فشتمته معهم، ألا أخبرك بما رأيت من رسول الله صلى الله عليه وسلم قلت بلى، قال أتيت فاطمة رضي الله عنها أسألها عن علي رضي الله عنه، فقالت توجه إِلى رسول الله صلى الله عليه وسلم فجلست أنتظره حتى جاء رسول الله صلى الله عليه وسلم ومعه علي وحسن وحسين رضي الله عنهم، آخذ كل واحدٍ منهما بيده حتى دخل، فأدنى علياً وفاطمة رضي الله عنهما، وأجلسهما بين يديه، وأجلس حسناً وحسيناً رضي الله عنهما كل واحد منها على فخذه، ثم لف عليهم ثوبه، أو قال كساءه، ثم تلا صلى الله عليه وسلم هذه الآية { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } وقال \" اللهم هؤلاء أهل بيتي، وأهل بيتي أحق \". وقد رواه أبو جعفر بن جرير عن عبد الكريم بن أبي عمير عن الوليد بن مسلم، عن أبي عمرو الأوزاعي بسنده نحوه، زاد في آخره قال واثلة رضي الله عنه فقلت وأنا يا رسول الله صلى الله عليك من أهلك؟ قال صلى الله عليه وسلم \" وأنت من أهلي \" قال واثلة رضي الله عنه وإِنها من أرجى ما أرتجي. ثم رواه أيضاً عن عبد الأعلى بن واصل عن الفضل بن دكين، عن عبد السلام بن حرب عن كلثوم المحاربي عن شداد أبي عمار قال إِني لجالس عند واثلة بن الأسقع رضي الله عنه، إِذ ذكروا علياً رضي الله عنه، فشتموه، فلما قاموا، قال اجلس حتى أخبرك عن هذا الذي شتموه إِني عند رسول الله صلى الله عليه وسلم إِذ جاء علي وفاطمة وحسن وحسين رضي الله عنهم، فألقى صلى الله عليه وسلم عليهم كساء له، ثم قال لهم\n                                   \n                                   \" اللهم هؤلاء أهل بيتي، اللهم أذهب عنهم الرجس وطهرهم تطهيراً \" قلت يارسول الله وأنا؟ قال صلى الله عليه وسلم \" وأنت \" قال فوالله إِنها لأوثق عمل عندي. حديث آخر قال الإمام أحمد حدثنا عبد الله بن نمير، حدثنا عبد الملك بن أبي سليمان عن عطاء بن أبي رباح، حدثني من سمع أم سلمة رضي الله عنها تذكر أن النبي صلى الله عليه وسلم كان في بيتها، فأتته فاطمة رضي الله عنها ببرمة فيها خزيرة، فدخلت عليه بها، فقال صلى الله عليه وسلم لها \" ادعي زوجك وابنيك \" قالت فجاء علي وحسن وحسين رضي الله عنهم، فدخلوا عليه، فجلسوا يأكلون من تلك الخزيرة، وهو على منامة له، وكان تحته صلى الله عليه وسلم كساء خيبري، قالت وأنا في الحجرة أصلي، فأنزل الله عز وجل هذه الآية { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت رضي الله عنها فأخذ صلى الله عليه وسلم فضل الكساء، فغطاهم به، ثم أخرج يده، فألوى بها إِلى السماء ثم قال \" اللهم هؤلاء أهل بيتي وخاصتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" قالت فأدخلت رأسي البيت، فقلت وأنا معكم يارسول الله؟ فقال صلى الله عليه وسلم \" إِنك إِلى خير، إِنك إِلى خير \" في إِسناده من لم يسم، وهو شيخ عطاء، وبقية رجاله ثقات. طريق أخرى قال ابن جرير حدثنا أبو كريب، حدثنا مصعب بن المقداد، حدثنا سعيد بن زربي عن محمد بن سيرين عن أبي هريرة عن أم سلمة رضي الله عنها قالت جاءت فاطمة رضي الله عنها إِلى رسول الله صلى الله عليه وسلم ببرمة لها قد صنعت فيها عصيدة، تحملها على طبق، فوضعتها بين يديه صلى الله عليه وسلم فقال \" أين ابن عمك وابناك؟ \" فقالت رضي الله عنها في البيت، فقال صلى الله عليه وسلم \" ادعيهم \" ، فجاءت إِلى علي رضي الله عنه فقالت أجب رسول الله صلى الله عليه وسلم أنت وابناك، قالت أم سلمة رضي الله عنها فلما رآهم مقبلين، مد صلى الله عليه وسلم يده إِلى كساء كان على المنامة، فمده وبسطه، وأجلسهم عليه، ثم أخذ بأطراف الكساء الأربعة بشماله، فضمه فوق رؤوسهم، وأومأ بيده اليمنى إِلى ربه فقال :\n                                   \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \". طريق أخرى قال ابن جرير حدثنا ابن حميد حدثنا عبد الله بن عبد القدوس، عن الأعمش عن حكيم بن سعد قال ذكرنا علي بن أبي طالب رضي الله عنه عند أم سلمة رضي الله عنها، فقالت في بيتي نزلت { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت أم سلمة جاء رسول الله صلى الله عليه وسلم إِلى بيتي، فقال \" لاتأذني لأحد \" فجاءت فاطمة رضي الله عنها، فلم أستطع أن أحجبها عن أبيها، ثم جاء الحسن رضي الله عنه، فلم أستطع أن أمنعه أن يدخل على جده وأمه، ثم جاء الحسين، فلم أستطع أن أحجبه عن جده صلى الله عليه وسلم وأمه رضي الله عنها، ثم جاء علي رضي الله عنه، فلم أستطع أن أحجبه، فاجتمعوا، فجللهم رسول الله صلى الله عليه وسلم بكساء كان عليه، ثم قال \" هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" فنزلت هذه الآية حين اجتمعوا على البساط، قالت فقلت يارسول الله وأنا؟ قالت فوالله ماأنعم، وقال \" إِنك إِلى خير \". طريق أخرى قال الإمام أحمد حدثنا محمد بن جعفر، حدثنا عوف عن أبي المعدل عن عطية الطفاوي عن أبيه قال إِن أم سلمة رضي الله عنها حدثته قالت بينما رسول الله صلى الله عليه وسلم في بيتي يوماً، إِذ قالت الخادم إِن فاطمة وعلياً رضي الله عنهما بالسدة، قالت فقال لي رسول الله صلى الله عليه وسلم \" قومي فتنحي عن أهل بيتي \" قالت فقمت فتنحيت في البيت قريباً، فدخل علي وفاطمة ومعهما الحسن والحسين رضي الله عنهم، وهما صبيان صغيران، فأخذ الصبيين فوضعهما في حجره فقبلهما، واعتنق علياً رضي الله عنه بإِحدى يديه، وفاطمة رضي الله عنها باليد الأخرى، وقبل فاطمة، وقبل علياً، وأغدق عليهم خميصة سوداء، وقال \" اللهم إِليك لا إِلى النار أنا وأهل بيتي \" قالت فقلت وأنا يارسول الله؟ فقال صلى الله عليه وسلم \" وأنت \". طريق أخرى قال ابن جرير حدثنا أبو كريب، حدثنا الحسن بن عطية، حدثنا فضيل بن مرزوق عن عطية عن أبي سعيد عن أم سلمة رضي الله عنها قالت إِن هذه الآية نزلت في بيتي { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت وأنا جالسة على باب البيت، فقلت يارسول الله ألست من أهل البيت؟ فقال صلى الله عليه وسلم \" إِنك إِلى خير، أنت من أزواج النبي صلى الله عليه وسلم \" قالت وفي البيت رسول الله صلى الله عليه وسلم وعلي وفاطمة والحسن والحسين رضي الله عنهم.\n                                   طريق أخرى رواها ابن جرير أيضاً عن أبي كريب عن وكيع عن عبد الحميد بن بهرام عن شهر بن حوشب عن أم سلمة رضي الله عنها بنحوه. طريق أخرى قال ابن جرير حدثنا أبو كريب حدثنا خالد بن مخلد، حدثني موسى بن يعقوب، حدثني هاشم بن هاشم بن عتبة بن أبي وقاص، عن عبد الله بن وهب بن زمعة قال أخبرتني أم سلمة رضي الله عنها قالت إِن رسول الله صلى الله عليه وسلم جمع علياً وفاطمة والحسن والحسين رضي الله عنهم، ثم أدخلهم تحت ثوبه، ثم جأر إِلى الله عز وجل ثم قال \" هؤلاء أهل بيتي \" قالت أم سلمة رضي الله عنها فقلت يارسول الله أدخلني معهم، فقال صلى الله عليه وسلم \" أنت من أهلي \". طريق أخرى رواه ابن جرير أيضاً عن أحمد بن محمد الطوسي، عن عبد الرحمن بن صالح، عن محمد بن سليمان الأصبهاني، عن يحيى بن عبيد المكي عن عطاء، عن عمر بن أبي سلمة عن أمه رضي الله عنها، بنحو ذلك. طريق أخرى قال ابن جرير حدثنا أبو كُرَيْب، حدثنا مصعب بن المقداد، حدثنا سعيد بن زربي، عن محمد بن سيرين، عن أبي هريرة، عن أم سلمة قالت جاءت فاطمة إِلى رسول الله صلى الله عليه وسلم ببرمة لها قد صنعت فيها عصيدة، تحملها على طبق، فوضعتها بين يديه فقال \" أين ابن عمك وابناك؟ \" فقالت في البيت، فقال \" ادعيهم \" ، فجاءت إِلى علي فقالت أجبْ رسول الله أنت وابناك. قالت أم سلمة فلما رآهم مقبلين، مد يده إِلي كساء كان على المنامة، فَمده، وبسطه، وأجلسهم عليه، ثم أخذ بأطراف الكساء الأربعة بشماله، فضمه فوق رؤوسهم، وأومأ بيده اليمنى إِلى ربه، فقال \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \". طريق أخرى قال ابن جرير حدثنا ابن حميد حدثنا عبد الله بن عبد القدوس، عن الأعمش، عن حكيم بن سعد قال ذكرنا علي بن أبي طالب عند أم سلمة، فقالت في بيتي نزلت { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت أم سلمة جاء رسول الله صلى الله عليه وسلم إِلي بيتي، فقال \" لا تأذني لأحد \" فجاءت فاطمة، فلم أستطع أن أحجبها عن أبيها، ثم جاء الحسن، فلم أستطع أن أحجبه عن أمه وجده، ثم جاء الحسين فلم أستطع أن أحجبه، ثم جاء علي، فلم أستطع أن أحجبه، فاجتمعوا، فجَلّلهم رسول الله صلى الله عليه وسلم بكساء كان عليه، ثم قال : \n                                   \" هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" فنزلت هذه الآية حين اجتمعوا على البساط، قالت فقلت يارسول الله، وأنا؟ قالت فوالله ما أنعم، وقال \" إِنك إِلى خير \". حديث آخر قال ابن جرير حدثنا ابن وكيع محمد بن بشير عن زكريا عن مصعب بن شيبة عن صفية بنت شيبة قالت قالت عائشة رضي الله عنها خرج النبي صلى الله عليه وسلم ذات غداة، وعليه مرطٌ مرحل من شعر أسود، فجاء الحسن رضي الله عنه، فأدخله معه، ثم جاء الحسين، فأدخله معه، ثم جاءت فاطمة، فأدخلها معه، ثم جاء علي رضي الله عنه، فأدخله معه، ثم قال صلى الله عليه وسلم \" { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } \" رواه مسلم عن أبي بكر بن أبي شيبة عن محمد بن بشر به. طريق أخرى قال ابن أبي حاتم حدثنا أبي، حدثنا سريج بن يونس أبو الحارث، حدثنا محمد بن يزيد عن العوام، يعني ابن حوشب رضي الله عنه، عن عم له قال دخلت مع أبي على عائشة رضي الله عنها، فسألتها عن علي رضي الله عنه، فقالت رضي الله عنها تسألني عن رجل كان من أحب الناس إِلى رسول الله صلى الله عليه وسلم وكانت تحته ابنته، وأحب الناس إِليه؟ لقد رأيت رسول الله صلى الله عليه وسلم دعا علياً وفاطمة وحسناً وحسيناً رضي الله عنهم، فألقى عليهم ثوباً فقال \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس، وطهرهم تطهيراً \" قالت فدنوت منهم فقلت يارسول الله وأنا من أهل بيتك؟ فقال صلى الله عليه وسلم \" تنحي فإِنك على خير \". حديث آخر قال ابن جرير حدثنا ابن المثنى، حدثنا بكر بن يحيى بن زبان العنزي، حدثنا مندل عن الأعمش عن عطية عن أبي سعيد رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" نزلت هذه الآية في خمسة فيّ وفي علي وحسن وحسين وفاطمة { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } \" قد تقدم أن فضيل بن مرزوق رواه عن عطية عن أبي سعيد عن أم سلمة رضي الله عنها كما تقدم. وروى ابن أبي حاتم من حديث هارون بن سعد العجلي عن عطية عن أبي سعيد رضي الله عنه موقوفاً، والله سبحانه وتعالى أعلم. حديث آخر قال ابن جرير حدثنا ابن المثنى، حدثنا أبو بكر الحنفي، حدثنا بكير بن مسمار قال سمعت عامر بن سعد رضي الله عنه قال قال سعد رضي الله عنه قال رسول الله صلى الله عليه وسلم حين نزل عليه الوحي، فأخذ علياً وابنيه وفاطمة رضي الله عنهم، فأدخلهم تحت ثوبه ثم قال\n                                   \n\" رب هؤلاء أهلي وأهل بيتي \". حديث آخر وقال مسلم في \" صحيحه \" حدثني زهير بن حرب وشجاع بن مخلد جميعاً عن ابن علية، قال زهير حدثنا إِسماعيل بن إِبراهيم، حدثني أبو حيان، حدثني يزيد بن حبان قال انطلقت أنا وحصين بن سبرة وعمر بن مسلم إِلى زيد بن أرقم رضي الله عنه، فلما جلسنا إِليه، قال له حصين لقد لقيت يازيد خيراً كثيراً رأيت رسول الله صلى الله عليه وسلم وسمعت حديثه، وغزوت معه، وصليت خلفه، لقد لقيت يا زيد خيراً كثيراً، حدثنا يا زيد ما سمعت من رسول الله صلى الله عليه وسلم قال يابن أخي والله لقد كبرت سني، وقدم عهدي، ونسيت بعض الذي كنت أعي من رسول الله صلى الله عليه وسلم فما حدثتكم فاقبلوا، ومالا فلا تكلفونيه، ثم قال قام فينا رسول الله صلى الله عليه وسلم يوماً خطيباً بماء يدعى خماً، بين مكة والمدينة، فحمد الله تعالى وأثنى عليه، ووعظ وذكر، ثم قال \" أما بعد، ألا أيها الناس فإِنما أنا بشر يوشك أن يأتيني رسول ربي فأجيب، وأنا تارك فيكم ثقلين أولهما كتاب الله تعالى، فيه الهدى والنور، فخذوا بكتاب الله، واستمسكوا به \" فحث على كتاب الله عز وجل، ورغب فيه، ثم قال \" وأهل بيتي، أذكركم الله في أهل بيتي، أذكركم الله في أهل بيتي \" ثلاثاً، فقال له حصين ومن أهل بيته يازيد؟ أليس نساؤه من أهل بيته؟ قال نساؤه من أهل بيته، ولكن أهل بيته من حرم الصدقة بعده، قال ومن هم؟ قال هم آل علي وآل عقيل وآل جعفر وآل العباس رضي الله عنهم، قال كل هؤلاء حرم الصدقة بعده؟ قال نعم. ثم رواه عن محمد بن بكار بن الريان عن حسان بن إِبراهيم عن سعيد بن مسروق عن يزيد بن حيان عن زيد بن أرقم رضي الله عنه، فذكر الحديث بنحو ما تقدم، وفيه فقلت له من أهل بيته، نساؤه؟ قال لا، وايم الله إِن المرأة تكون مع الرجل العصر من الدهر، ثم يطلقها، فترجع إِلى أبيها وقومها، أهل بيته أصله وعصبته الذين حرموا الصدقة بعده. هكذا وقع في هذه الرواية، والأولى أولى، والأخذ بها أحرى. وهذه الثانية تحتمل أنه أراد تفسير الأهل المذكورين في الحديث الذي رواه، إِنما المراد بهم آله الذين حرموا الصدقة، أو أنه ليس المراد بالأهل الأزواج فقط، بل هم مع آله، وهذا الاحتمال أرجح جمعاً بينها وبين الرواية التي قبلها، وجمعاً أيضاً بين القرآن والأحاديث المتقدمة إِن صحت، فإِن في بعض أسانيدها نظراً، والله أعلم، ثم الذي لا يشك فيه من تدبر القرآن أن نساء النبي صلى الله عليه وسلم داخلات في قوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } فإِن سياق الكلام معهن، ولهذا قال تعالى بعد هذا كله { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِى بُيُوتِكُـنَّ مِنْ ءَايَـٰتِ ٱللَّهِ وَٱلْحِكْــمَةِ } أي واعملن بما ينزل الله تبارك وتعالى على رسوله صلى الله عليه وسلم في بيوتكن من الكتاب والسنة، قاله قتادة وغير واحد، واذكرن هذه النعمة التي خصصتن بها من بين الناس، أن الوحي ينزل في بيوتكن دون سائر الناس، وعائشة الصديقة بنت الصديق رضي الله عنهما أولاهن بهذه النعمة، وأحظاهن بهذه الغنيمة، وأخصهن من هذه الرحمة العميمة، فإِنه لم ينزل على رسول الله صلى الله عليه وسلم الوحي في فراش امرأة سواها، كما نص على ذلك صلوات الله وسلامه عليه.\n                                   \nقال بعض العلماء رحمه الله لأنه لم يتزوج بكراً سواها، ولم ينم معها رجل في فراشها سواه صلى الله عليه وسلم ورضي الله عنها، فناسب أن تخصص بهذه المزية، وأن تفرد بهذه المرتبة العليا، ولكن إِذا كان أزواجه من أهل بيته، فقرابته أحق بهذه التسمية كما تقدم في الحديث \" وأهل بيتي أحق \" وهذا مايشبه ماثبت في \" صحيح مسلم \" أن رسول الله صلى الله عليه وسلم لما سئل عن المسجد الذي أسس على التقوى من أول يوم، فقال \" هو مسجدي هذا \" فهذا من هذا القبيل، فإِن الآية إِنما نزلت في مسجد قباء كما ورد في الأحاديث الأخر، ولكن إِذا كان ذاك أسس على التقوى من أول يوم، فمسجد رسول الله صلى الله عليه وسلم أولى بتسميته بذلك، والله أعلم. وقد قال ابن أبي حاتم حدثنا أبي، حدثنا أبو الوليد، حدثنا أبو عوانة عن حصين بن عبد الرحمن عن أبي جميلة قال إِن الحسن بن علي رضي الله عنهما استخلف حين قتل علي رضي الله عنهما، قال فبينما هو يصلي، إِذ وثب عليه رجل، فطعنه بخنجره، وزعم حصين أنه بلغه أن الذي طعنه رجل من بني أسد، وحسن رضي الله عنه ساجد. قال فيزعمون أن الطعنة وقعت في وركه، فمرض منها أشهراً، ثم برأ، فقعد على المنبر فقال يا أهل العراق اتقوا الله فينا، فإِنا أمراؤكم وضيفانكم، ونحن أهل البيت الذي قال الله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قال فما زال يقولها حتى ما بقي أحد من أهل المسجد إِلا وهو يحن بكاءً. وقال السدي عن أبي الديلم قال قال علي بن الحسين رضي الله عنهما لرجل من أهل الشام أما قرأت في الأحزاب { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً }؟ فقال نعم، ولأنتم هم؟ قال نعم.\n                                   وقوله تعالى { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } أي بلطفه بكن بلغتن هذه المنزلة، وبخبرته بكن وأنكن أهل لذلك أعطاكن ذلك، وخصكن بذلك. قال ابن جرير رحمه الله واذكرن نعمة الله عليكن بأن جعلكن في بيوت تتلى فيها آيات الله والحكمة، فاشكرن الله تعالى على ذلك واحمدنه، { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } أي ذا لطف بكن، إِذ جعلكن في البيوت التي تتلى فيها آيات الله والحكمة، وهي السنة. خبيراً بكن، إِذ اختاركن لرسوله أزواجاً. وقال قتادة { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِى بُيُوتِكُـنَّ مِنْ ءَايَـٰتِ ٱللَّهِ وَٱلْحِكْــمَةِ } قال يمتن عليهن بذلك، رواه ابن جرير. وقال عطية العوفي في قوله تعالى { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } يعني لطيفاً باستخراجها، خبيراً بموضعها، رواه ابن أبي حاتم، ثم قال وكذا روي عن الربيع بن أنس عن قتادة.\n                                    ",
        "qortoby": "وَقَرۡنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ ٱلۡجَٰهِلِيَّةِ ٱلۡأُولَىٰۖ وَأَقِمۡنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعۡنَ ٱللَّهَ وَرَسُولَهُۥٓۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذۡهِبَ عَنكُمُ ٱلرِّجۡسَ أَهۡلَ ٱلۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيرٗا ٣٣\n                                    \n                                    \n                                    قوله تعالى : { وَقَرْنَ فِي بُيُوتِكُنَّ وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَاهِلِيَّةِ ٱلأُولَىٰ } فيه أربع مسائل :\n\nالأولى: قوله تعالى: { وَقَرْنَ } قرأ الجمهور «وَقِرن» بكسر القاف. وقرأ عاصم ونافع بفتحها. فأما القراءة الأولى فتحتمل وجهين: أحدهما: أن يكون من الوقار؛ تقول؛ وقَرَ يَقِر وَقاراً أي سكن، والأمر قِرْ، وللنساء قِرْن، مثل عِدْن وزِنّ. والوجه الثاني: وهو قول المبرد، أن يكون من القرار؛ تقول: قَرَرَت بالمكان (بفتح الراء) أقِرّ، والأصل أقْرِرن، بكسر الراء، فحذفت الراء الأولى تخفيفاً؛ كما قالوا في ظَلَلت: ظِلت، ومَسَسْت: مِسْت، ونقلوا حركتها إلى القاف، واستغنى عن ألف الوصل لتحرك القاف. قال أبو عليّ: بل على أن أبدلت الراء ياء كراهة التضعيف؛ كما أبدلت في قيراط ودينار، ويصير للياء حركة الحرف المبدل منه؛ فالتقدير: إقْيِرْن، ثم تلقى حركة الياء على القاف كراهة تحرك الياء بالكسر، فتسقط الياء لاجتماع الساكنين، وتسقط همزة الوصل لتحرك ما بعدها فيصير «قِرْن». وأما قراءة أهل المدينة وعاصم، فعلى لغة العرب: قرِرت في المكان إذا أقمت فيه (بكسر الراء) أَقَرّ (بفتح القاف)؛ من باب حمِد يَحْمَد، وهي لغة أهل الحجاز ذكرها أبو عبيد في «الغريب المصنف» عن الكسائي، وهو من أجلّ مشايخه، وذكرها الزجاج وغيره، والأصل «إِقْرَرْن» حذفت الراء الأولى لثقل التضعيف، وألقيت حركتها على القاف فتقول: قَرْن. قال الفراء: هو كما تقول: أَحَسْتَ صاحبك؛ أي هل أَحْسَسْت. وقال أبو عثمان المازني: قَرِرت به عيناً (بالكسر لا غير)، من قُرّة العين. ولا يجوز قَرِرت في المكان (بالكسر) وإنما هو قَرَرت (بفتح الراء)، وما أنكره من هذا لا يقدح في القراءة إذا ثبتت عن النبيّ صلى الله عليه وسلم؛ فيستدلّ بما ثبت عنه من القراءة على صحة اللغة. وذهب أبو حاتم أيضاً أن «قَرْن» لا مذهب له في كلام العرب. قال النحاس: وأمّا قول أبي حاتم: «لا مذهب له» فقد خولف فيه، وفيه مذهبان: أحدهما ما حكاه الكِسائي، والآخر ما سمعت عليّ بن سليمان يقول، قال: وهو من قَرِرْتُ به عَيْناً أَقَر، والمعنى: واقررن به عَيْناً في بيوتكن. وهو وجه حسن؛ إلا أن الحديث يدلّ على أنه من الأول. كما روي أن عماراً قال لعائشة رضي الله عنها: إن الله قد أمرك أن تَقَرِّي في منزلك؛ فقالت: يا أبا اليَقْظان، ما زلتَ قوّالاً بالحق! فقال: الحمد لله الذي جعلني كذلك على لسانك. وقرأ ابن أبي عَبْلة «واقْرِرن» بألف وصل وراءين، الأولى مكسورة.\n\nالثانية: معنى هذه الآية الأمر بلزوم البيت، وإن كان الخطاب لنساء النبي صلى الله عليه وسلم فقد دخل غيرهن فيه بالمعنى. هذا لو لم يرد دليل يخص جميع النساء؛ كيف والشريعة طافحة بلزوم النساء بيوتهن، والانكفاف عن الخروج منها إلا لضرورة؛ على ما تقدم في غير موضع.\n                                   فأمر الله تعالى نساء النبيّ صلى الله عليه وسلم بملازمة بيوتهنّ، وخاطبهنّ بذلك تشريفاً لهنّ، ونهاهنّ عن التبرج، وأعلم أنه فعل الجاهلية الأولى فقال: { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَاهِلِيَّةِ ٱلأُولَىٰ }. وقد تقدّم معنى التبرج في «النور». وحقيقته إظهار ما ستره أحسن؛ وهو مأخوذ من السَّعة، يقال: في أسنانه بَرَج إذا كانت متفرّقة؛ قاله المبرد. واختلف الناس في «الْجَاهِلِيَّةِ الأُولَى»؛ فقيل: هي الزمن الذي ولد فيه إبراهيم عليه السلام، كانت المرأة تلبس الدّرع من اللؤلؤ، فتمشي وسط الطريق تعرض نفسها على الرجال. وقال الحكم بن عُيينة: ما بين آدم ونوح، وهي ثمانمائة سنة، وحُكيت لهم سِير ذميمة. وقال ابن عباس: ما بين نوح وإدريس. الكلبيّ: ما بين نوح وإبراهيم. قيل: إن المرأة كانت تلبس الدّرع من اللؤلؤ غير مَخِيط الجانبين، وتلبس الثياب الرقاق ولا تواري بدنها. وقالت فرقة: ما بين موسى وعيسى. الشعبي: ما بين عيسى ومحمد صلى الله عليه وسلم. أبو العالية: هي زمان داود وسليمان؛ كان فيه للمرأة قميص من الدرّ غير مخيط الجانبين. وقال أبو العباس المبرد: والجاهلية الأولى كما تقول الجاهلية الجهلاء، قال: وكان النساء في الجاهلية الجهلاء يُظهرن ما يقبح إظهاره، حتى كانت المرأة تجلس مع زوجها وخِلّها، فينفرد خِلّها بما فوق الإزار إلى الأعلى، وينفرد زوجها بما دون الإزار إلى الأسفل، وربما سأل أحدهما صاحبه البدل. وقال مجاهد: كان النساء يتمشّين بين الرجال، فذلك التبرج. قال ابن عطية: والذي يظهر عندي أنه أشار للجاهلية التي لحِقنها، فأمِرْن بالنّقلة عن سيرتهنّ فيها، وهي ما كان قبل الشرع من سيرة الكفرة؛ لأنهم كانوا لا غَيْرة عندهم؛ وكان أمر النساء دون حجاب، وجَعْلُهَا أولى بالنسبة إلى ما كنّ عليه؛ وليس المعنى أن ثَمّ جاهلية أخرى. وقد أوقِع اسم الجاهلية على تلك المدّة التي قبل الإسلام، فقالوا: جاهليّ في الشعراء. وقال ابن عباس في البخاريّ: سمعت أبي في الجاهلية يقول؛ إلى غير هذا.\n\nقلت: وهذا قول حسن. ويعترض بأن العرب كانت أهل قَشَف وضَنْك في الغالب، وأن التنعم وإظهارَ الزينة إنما جرى في الأزمان السابقة، وهي المراد بالجاهلية الأولى، وأن المقصود من الآية مخالفة من قبلهنّ من المِشية على تَغْنيج وتكسير وإظهار المحاسن للرجال، إلى غير ذلك مما لا يجوز شرعاً. وذلك يشمل الأقوال كلّها ويعمّها فيلزمن البيوت، فإن مست الحاجة إلى الخروج فليكنّ على تبذُّل وتستُّر تام. والله الموفق.\n\nالثالثة: ذكر الثعلبيّ وغيره: أن عائشة ـ رضي الله عنها ـ كانت إذا قرأت هذه الآية تبكي حتى تَبُلّ خمارها. وذكر أن سَوْدة قيل لها: لم لا تحجّين ولا تَعْتَمرين كما يفعل أخواتك؟ فقالت: قد حججت واعتمرت، وأمرني الله أن أقرّ في بيتي.\n                                   قال الراوي: فوالله ما خرجت من باب حجرتها حتى أخرجت جنازتها. رضوان لله عليها! قال ابن العربي: لقد دخلت نَيِّفاً على ألف قرية، فما رأيت نساء أصْون عيالاً ولا أعفّ نساء من نساء نابلس، التي رُمي بها الخليل صلى الله عليه وسلم بالنار؛ فإن أقمت فيها فما رأيت امرأة في طريق نهاراً إلا يوم الجمعة فإنهنّ يخرجن إليها حتى يمتلىء المسجد منهنَّ، فإذا قُضيت الصلاة وانقلبن إلى منازلهنّ لم تقع عيني على واحدة منهنّ إلى الجمعة الأخرى. وقد رأيت بالمسجد الأقصى عفائف ما خرجن من معتكفهنّ حتى استشهدن فيه.\n\nالرابعة: قال ابن عطية: بكاء عائشة رضي الله عنها إنما كان بسبب سفرها أيام الجمل، وحينئذٍ قال لها عمّار: إن الله قد أمرك أن تَقرِّي في بيتك. قال ابن العربي: تعلق الرافضة ـ لعنهم الله ـ بهذه الآية على أمّ المؤمنين عائشة رضي الله عنها إذ قالوا: إنها خالفت أمر رسول الله صلى الله عليه وسلم حين خرجت تقود الجيوش، وتباشر الحروب، وتقتحم مأزق الطعن والضرب فيما لم يفرض عليها ولا يجوز لها. قالوا: ولقد حُصر عثمان، فلما رأت ذلك أمرت برواحلها فقرّبت لتخرج إلى مكة؛ فقال لها مَرْوان: أقيمي هنا يا أمّ المؤمنين، وردّي هؤلاء الرّعاع؛ فإن الإصلاح بين الناس خير من حَجّك. قال ابن العربي قال علماؤنا رحمة الله عليهم: إن عائشة رضي الله عنها، نذرت الحج قبل الفتنة، فلم تر التخلف عن نذرها؛ ولو خرجت في تلك الثائرة لكان ذلك صواباً لها. وأما خروجها إلى حرب الجمل فما خرجت لحرب، ولكن تعلق الناس بها، وشكَوْا إليها ما صاروا إليه من عظيم الفتنة وتهارج الناس، ورجَوْا بركتها، وطمِعوا في الاستحياء منها إذا وقفت إلى الخلق، وظنّت هي ذلك فخرجت مقتدية بالله في قوله :\n{ لاَّ خَيْرَ فِي كَثِيرٍ مِّن نَّجْوَاهُمْ إِلاَّ مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلاَحٍ بَيْنَ ٱلنَّاسِ }\n[النساء : 114]، وقوله :\n{ وَإِن طَآئِفَتَانِ مِنَ ٱلْمُؤْمِنِينَ ٱقْتَتَلُواْ فَأَصْلِحُواْ بَيْنَهُمَا }\n[الحجرات: 9]. والأمر بالإصلاح مخاطب به جميع الناس من ذكر وأنثى؛ حُرّ أو عبد. فلم يرد الله تعالى بسابق قضائه ونافذ حكمه أن يقع إصلاح، ولكن جرت مطاعنات وجراحات حتى كاد يفنى الفريقان، فعمَد بعضهم إلى الجمل فعرقبه، فلما سقط الجمل لجنبه أدرك محمد بن أبي بكر عائشة رضي الله تعالى عنها، فاحتملها إلى البصرة، وخرجت في ثلاثين امرأة، قَرَنَهُنّ عليٌّ بها حتى أوصلوها إلى المدينة بَرَّةً تقيّة مجتهدة، مصيبة مثابة فيما تأوّلت، مأجورة فيما فعلت؛ إذ كل مجتهد في الأحكام مصيب. وقد تقدّم في «النحل» اسم هذا الجمل، وبه يعرف ذلك اليوم.\n\nقوله تعالى: { وَأَقِمْنَ ٱلصَّلاَةَ وَآتِينَ ٱلزَّكَـاةَ وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } أي فيما أمر ونهى. { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ } قال الزجاج: قيل يراد به نساء النبيّ صلى الله عليه وسلم. وقيل: يراد به نساؤه وأهله الذين هم أهل بيته؛ على ما يأتي بيانه بعدُ. و«أَهْلَ الْبَيْتِ» نصب على المدح. قال: وإن شئت على البدل. قال: ويجوز الرفع والخفض. قال النحاس: إن خفض على أنه بدل من الكاف والميم لم يجز عند أبي العباس محمد بن يزيد، قال لا يبدل من المخاطبة ولا من المخاطب؛ لأنهما لا يحتاجان إلى تبيين. { وَيُطَهِّرَكُمْ تَطْهِيـراً } مصدر فيه معنى التوكيد.\n                                    ",
        "saadi": "وَقَرۡنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ ٱلۡجَٰهِلِيَّةِ ٱلۡأُولَىٰۖ وَأَقِمۡنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعۡنَ ٱللَّهَ وَرَسُولَهُۥٓۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذۡهِبَ عَنكُمُ ٱلرِّجۡسَ أَهۡلَ ٱلۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيرٗا ٣٣\n                                        \n                                        \n                                        \n                                        يقول تعالى: { يٰنِسَآءَ ٱلنَّبِيِّ } خطاب لهن كلهن { لَسْتُنَّ كَأَحَدٍ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيْتُنَّ } اللّه، فإنكن بذلك تفقن النساء، ولا يلحقكن أحد من النساء، فكملن التقوى بجميع وسائلها ومقاصدها. فلهذا أرشدهن إلى قطع وسائل المحرم، فقال: { فَلاَ تَخْضَعْنَ بِٱلْقَوْلِ } أي: في مخاطبة الرجال، أو بحيث يسمعون فتَلِنَّ في ذلك، وتتكلمن بكلام رقيق يدعو ويطمع { ٱلَّذِي فِي قَلْبِهِ مَرَضٌ } أي: مرض شهوة الزنا، فإنه مستعد، ينظر أدنى محرك يحركه، لأن قلبه غير صحيح، [فإن القلب الصحيح]، ليس فيه شهوة لما حرم اللّه، فإن ذلك لا تكاد تُمِيلُه ولا تحركه الأسباب، لصحة قلبه وسلامته من المرض. بخلاف مريض القلب، الذي لا يتحمل ما يتحمل الصحيح، ولا يصبر على ما يصبر عليه، فأدنى سبب يوجد، يدعوه إلى الحرام، يجيب دعوته، ولا يتعاصى عليه، فهذا دليل على أن الوسائل لها أحكام المقاصد. فإن الخضوع بالقول واللين فيه، في الأصل مباح، ولكن لما كان وسيلة إلى المحرم، منع منه، ولهذا ينبغي للمرأة في مخاطبة الرجال، أن لا تلِين لهم القول. ولما نهاهن عن الخضوع في القول، فربما توهم أنهن مأمورات بإغلاظ القول، دفع هذا بقوله: { وَقُلْنَ قَوْلاً مَّعْرُوفاً } أي: غير غليظ ولا جاف، كما أنه ليس بِلَيِّنٍ خاضع. وتأمل كيف قال: { فَلاَ تَخْضَعْنَ بِٱلْقَوْلِ } ولم يقل: \" فلا تلِنَّ بالقول \" وذلك لأن المنهي عنه القول اللين، الذي فيه خضوع المرأة للرجل، وانكسارها عنده، والخاضع هو الذي يطمع فيه، بخلاف من تكلم كلاماً ليناً ليس فيه خضوع، بل ربما صار فيه ترفع وقهر للخصم، فإن هذا لا يطمع فيه خصمه، ولهذا مدح اللّه رسوله باللين، فقال:\n{ فَبِمَا رَحْمَةٍ مِّنَ ٱللَّهِ لِنتَ لَهُمْ }\n[آل عمران: 159] وقال لموسى وهارون:\n{ ٱذْهَبَآ إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ* فَقُولاَ لَهُ قَوْلاً لَّيِّناً لَّعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَىٰ }\n[طه: 43-44]. ودلَّ قوله: { فَيَطْمَعَ ٱلَّذِي فِي قَلْبِهِ مَرَضٌ } مع أمره بحفظ الفرج وثنائه على الحافظين لفروجهم والحافظات، ونهيه عن قربان الزنا، أنه ينبغي للعبد إذا رأى من نفسه هذه الحالة، وأنه يهش لفعل المحرم عندما يرى أو يسمع كلام مَنْ يهواه، ويجد دواعي طمعه قد انصرفت إلى الحرام، فَلْيَعْرِفْ أن ذلك مرض. فَلْيَجْتَهِدْ في إضعاف هذا المرض وحسم الخواطر الردية، ومجاهدة نفسه على سلامتها من هذا المرض الخطر، وسؤال اللّه العصمة والتوفيق، وأن ذلك من حفظ الفرج المأمور به. { وَقَرْنَ فِي بُيُوتِكُنَّ } أي: اقررن فيها، لأنه أسلم وأحفظ لَكُنَّ، { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَاهِلِيَّةِ ٱلأُولَىٰ } أي: لا تكثرن الخروج متجملات أو متطيبات، كعادة أهل الجاهلية الأولى، الذين لا علم عندهم ولا دين، فكل هذا دفع للشر وأسبابه. ولما أمرهن بالتقوى عموماً، وبجزئيات من التقوى، نص عليها [لحاجة] النساء إليها، كذلك أمرهن بالطاعة، خصوصاً الصلاة والزكاة، اللتان يحتاجهما ويضطر إليهما كل أحد، وهما أكبر العبادات، وأجل الطاعات، وفي الصلاة الإخلاص للمعبود، وفي الزكاة الإحسان إلى العبيد.\n                                   ثم أمرهن بالطاعة عموماً، فقال: { وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } يدخل في طاعة اللّه ورسوله، كل أمر أمرا به أمر إيجاب أو استحباب. { إِنَّمَا يُرِيدُ ٱللَّهُ } بأمركن بما أَمَرَكُنَّ به، ونهيكن بما نهاكُنَّ عنه، { لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ } أي: الأذى والشر والخبث، يا { أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } حتى تكونوا طاهرين مطهرين. أي: فاحمدوا ربكم واشكروه على هذه الأوامر والنواهي، التي أخبركم بمصلحتها وأنها محض مصلحتكم، لم يرد اللّه أن يجعل عليكم بذلك حرجاً ولا مشقة، بل لتتزكى نفوسكم، ولتتطهر أخلاقكم، وتحسن أعمالكم، ويعظم بذلك أجركم. ولما أمرهن بالعمل الذي هو فعل وترك، أمرهن بالعلم، وبيَّن لهن طريقه، فقال: { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِي بُيُوتِكُـنَّ مِنْ آيَاتِ ٱللَّهِ وَٱلْحِكْـمَةِ } والمراد بآيات اللّه، القرآن. والحكمة، أسراره. أو سُنّة رسوله. وأمرهن بذكره، يشمل ذكر لفظه، بتلاوته، وذكر معناه، بتدبره والتفكر فيه، واستخراج أحكامه وحكمه، وذكر العمل به وتأويله. { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } يدرك أسرار الأمور، وخفايا الصدور، وخبايا السماوات والأرض، والأعمال التي تبين وتسر. فلطفه وخبرته، يقتضي حثهن على الإخلاص وإسرار الأعمال، ومجازاة اللّه على تلك الأعمال. ومن معاني \" اللطيف \" الذي يسوق عبده إلى الخير، ويعصمه من الشر، بطرق خفية لا يشعر بها، ويسوق إليه من الرزق ما لا يدريه، ويريه من الأسباب التي تكرهها النفوس ما يكون ذلك طريقاً [له] إلى أعلى الدرجات، وأرفع المنازل.\n                                    "
      },
      "originalText": "وَقَرۡنَ فِي بُيُوتِكُنَّ وَلَا تَبَرَّجۡنَ تَبَرُّجَ ٱلۡجَٰهِلِيَّةِ ٱلۡأُولَىٰۖ وَأَقِمۡنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَوٰةَ وَأَطِعۡنَ ٱللَّهَ وَرَسُولَهُۥٓۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذۡهِبَ عَنكُمُ ٱلرِّجۡسَ أَهۡلَ ٱلۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيرٗا ٣٣"
    },
    {
      "number": 3567,
      "text": "وَاذْكُرْنَ مَا يُتْلَىٰ فِي بُيُوتِكُنَّ مِنْ آيَاتِ اللَّهِ وَالْحِكْمَةِ ۚ إِنَّ اللَّهَ كَانَ لَطِيفًا خَبِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 34,
      "juz": 22,
      "manzil": 5,
      "page": 422,
      "ruku": 364,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱذۡكُرۡنَ مَا يُتۡلَىٰ فِي بُيُوتِكُنَّ مِنۡ ءَايَٰتِ ٱللَّهِ وَٱلۡحِكۡمَةِۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا ٤٣\n                                    \n                                    \n                                    هذه آداب أمر الله تعالى بها نساء النبي صلى الله عليه وسلم ونساءُ الأمة تبع لهن في ذلك، فقال تعالى مخاطباً لنساء النبي صلى الله عليه وسلم بأنهن إِذا اتقين الله عز وجل كما أمرهن، فإِنه لا يشبههن أحد من النساء، ولا يلحقهن في الفضيلة والمنزلة، ثم قال تعالى { فَلاَ تَخْضَعْنَ بِٱلْقَوْلِ } قال السدي وغيره يعني بذلك ترقيق الكلام إِذا خاطبن الرجال، ولهذا قال تعالى { فَيَطْمَعَ ٱلَّذِى فِى قَلْبِهِ مَرَضٌ } أي دغل، { وَقُلْنَ قَوْلاً مَّعْرُوفاً } قال ابن زيد قولاً حسناً جميلاً معروفاً في الخير، ومعنى هذا أنها تخاطب الأجانب بكلام ليس فيه ترخيم، أي لاتخاطب المرأة الأجانب كما تخاطب زوجها. وقوله تعالى { وَقَرْنَ فِى بُيُوتِكُنَّ } أي إلزمن بيوتكن، فلا تخرجن لغير حاجة، ومن الحوائج الشرعية الصلاة في المسجد بشرطه كما قال رسول الله صلى الله عليه وسلم \" لا تمنعوا إِماء الله مساجد الله، وليخرجن وهن تفلات \" وفي رواية \" وبيوتهن خير لهن \" وقال الحافظ أبو بكر البزار حدثنا حميد بن مسعدة، حدثنا أبو رجاء الكلبي روح بن المسيب ثقة، حدثنا ثابت البناني عن أنس رضي الله عنه قال جئن النساء إِلى رسول الله، فقلن يارسول الله ذهب الرجال بالفضل والجهاد في سبيل الله تعالى، فما لنا عمل ندرك به عمل المجاهدين في سبيل الله تعالى، فقال رسول الله صلى الله عليه وسلم \" من قعدت ــــ أو كلمة نحوها ــــ منكن في بيتها، فإِنها تدرك عمل المجاهدين في سبيل الله تعالى \" ثم قال لا نعلم رواه عن ثابت إِلا روح بن المسيب، وهو رجل من أهل البصرة مشهور. وقال البزار أيضاً حدثنا محمد بن المثنى، حدثني عمرو بن عاصم، حدثنا همام عن قتادة عن مورّق عن أبي الأحوص عن عبد الله رضي الله عنه، عن النبي صلى الله عليه وسلم قال \" إِن المرأة عورة، فإِذا خرجت، استشرفها الشيطان، وأقرب ما تكون بروحة ربها، وهي في قعر بيتها \" رواه الترمذي عن بندار عن عمرو بن عاصم به نحوه. وروى البزار بإِسناده المتقدم، وأبو داوود أيضاً عن النبي صلى الله عليه وسلم قال \" صلاة المرأة في مخدعها أفضل من صلاتها في بيتها، وصلاتها في بيتها أفضل من صلاتها في حجرتها \" وهذا إِسناد جيد. وقوله تعالى { وَلاَ تَبَرَّجْنَ تَبَرُّجَ وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } قال مجاهد كانت المرأة تخرج تمشي بين يدي الرجال، فذلك تبرج الجاهلية. وقال قتادة { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } يقول إِذا خرجتن من بيوتكن، وكانت لهن مشية وتكسر وتغنج، فنهى الله تعالى عن ذلك.\n\n                                   وقال مقاتل بن حيان { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } والتبرج أنها تلقي الخمار على رأسها، ولا تشده، فيواري قلائدها وقرطها وعنقها، ويبدو ذلك كله منها، وذلك التبرج، ثم عمت نساء المؤمنين في التبرج. وقال ابن جرير حدثني ابن زهير، حدثنا موسى بن إسماعيل، حدثنا داود يعني بن أبي الفرات، حدثنا علي بن أحمر عن عكرمة عن ابن عباس رضي الله عنهما قال تلا هذه الآية { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ } قال كانت فيما بين نوح وإِدريس، وكانت ألف سنة، وإِن بطنين من ولد آدم كان أحدهما يسكن السهل، والآخر يسكن الجبل، وكان رجال الجبل صِباحاً، وفي النساء دَمامة. وكان نساء السهل صِباحاً وفي الرجال دَمامة، وإِن إِبليس لعنه الله أتى رجلاً من أهل السهل في صورة غلام، فآجر نفسه منه، فكان يخدمه، فاتخذ إِبليس شيئاً من مثل الذي يزمر فيه الرعاء، فجاء فيه بصوت لم يسمع الناس مثله، فبلغ ذلك من حوله، فانتابوهم يسمعون إِليه، واتخذوا عيداً يجتمعون إِليه في السنة، فيتبرج النساء للرجال، قال ويتزين الرجال لهن، وإِن رجلاً من أهل الجبل هجم عليهم في عيدهم ذلك، فرأى النساء وصباحتهن، فأتى أصحابه، فأخبرهم بذلك، فتحولوا إِليهن، فنزلوا معهن، وظهرت الفاحشة فيهن، فهو قول الله تعالى { وَلاَ تَبَرَّجْنَ تَبَرُّجَ ٱلْجَـٰهِلِيَّةِ ٱلأُولَىٰ }. وقوله تعالى { وَأَقِمْنَ ٱلصَّلَوٰةَ وَءَاتِينَ ٱلزَّكَـوٰةَ وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } نهاهن أولاً عن الشر، ثم أمرهن بالخير من إِقامة الصلاة، وهي عبادة الله وحده لا شريك له، وإِيتاء الزكاة، وهي الإحسان إِلى المخلوقين، { وَأَطِعْنَ ٱللَّهَ وَرَسُولَهُ } وهذا من باب عطف العام على الخاص. وقوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } وهذا نص في دخول أزواج النبي صلى الله عليه وسلم في أهل البيت ههنا لأنهن سبب نزول هذه الآية، وسبب النزول داخل فيه قولاً واحداً، إِما وحده على قول، أو مع غيره على الصحيح. وروى ابن جرير عن عكرمة أنه كان ينادي في السوق { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ } نزلت في نساء النبي صلى الله عليه وسلم خاصة. وهكذا روى ابن أبي حاتم قال حدثنا علي بن حرب الموصلي، حدثنا زيد بن الحباب حدثنا حسين بن واقد عن يزيد النحوي عن عكرمة عن ابن عباس رضي الله عنهما في قوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ } قال نزلت في نساء النبي صلى الله عليه وسلم خاصة. وقال عكرمة من شاء باهلته أنها نزلت في شأن نساء النبي صلى الله عليه وسلم فإِن كان المراد أنهن كن سبب النزول دون غيرهن، فصحيح، وإِن أريد أنهن المراد فقط دون غيرهن، ففيه نظر، فإِنه قد وردت أحاديث تدل على أن المراد أعم من ذلك الحديث الأول قال الإمام أحمد حدثنا عفان، حدثنا حماد، أخبرنا علي بن زيد عن أنس بن مالك رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم كان يمر بباب فاطمة رضي الله عنها ستة أشهر إِذا خرج إِلى صلاة الفجر يقول\n\n                                   \" الصلاة يا أهل البيت إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيراً \" رواه الترمذي عن عبد بن حميد عن عفان به. وقال حسن غريب. حديث آخر قال ابن جرير حدثنا ابن وكيع، حدثنا أبو نعيم، حدثنا يونس عن أبي إِسحاق، أخبرني أبو داود عن أبي الحمراء قال رابطت المدينة سبعة أشهر على عهد رسول الله صلى الله عليه وسلم قال رأيت رسول الله صلى الله عليه وسلم إِذا طلع الفجر، جاء إِلى باب علي وفاطمة رضي الله عنهما، فقال \" الصلاة الصلاة، إِنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيراً \" أبو داود الأعمى هو نفيع بن الحارث كذاب. حديث آخر وقال الإمام أحمد أيضاً حدثنا محمد بن مصعب، حدثنا الأوزاعي، حدثنا شداد أبو عمار قال دخلت على واثلة بن الأسقع رضي الله عنه، وعنده قوم، فذكروا علياً رضي الله عنه فشتموه، فشتمته معهم، فلما قاموا قال لي شتمت هذا الرجل؟ قلت قد شتموه فشتمته معهم، ألا أخبرك بما رأيت من رسول الله صلى الله عليه وسلم قلت بلى، قال أتيت فاطمة رضي الله عنها أسألها عن علي رضي الله عنه، فقالت توجه إِلى رسول الله صلى الله عليه وسلم فجلست أنتظره حتى جاء رسول الله صلى الله عليه وسلم ومعه علي وحسن وحسين رضي الله عنهم، آخذ كل واحدٍ منهما بيده حتى دخل، فأدنى علياً وفاطمة رضي الله عنهما، وأجلسهما بين يديه، وأجلس حسناً وحسيناً رضي الله عنهما كل واحد منها على فخذه، ثم لف عليهم ثوبه، أو قال كساءه، ثم تلا صلى الله عليه وسلم هذه الآية { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } وقال \" اللهم هؤلاء أهل بيتي، وأهل بيتي أحق \". وقد رواه أبو جعفر بن جرير عن عبد الكريم بن أبي عمير عن الوليد بن مسلم، عن أبي عمرو الأوزاعي بسنده نحوه، زاد في آخره قال واثلة رضي الله عنه فقلت وأنا يا رسول الله صلى الله عليك من أهلك؟ قال صلى الله عليه وسلم \" وأنت من أهلي \" قال واثلة رضي الله عنه وإِنها من أرجى ما أرتجي. ثم رواه أيضاً عن عبد الأعلى بن واصل عن الفضل بن دكين، عن عبد السلام بن حرب عن كلثوم المحاربي عن شداد أبي عمار قال إِني لجالس عند واثلة بن الأسقع رضي الله عنه، إِذ ذكروا علياً رضي الله عنه، فشتموه، فلما قاموا، قال اجلس حتى أخبرك عن هذا الذي شتموه إِني عند رسول الله صلى الله عليه وسلم إِذ جاء علي وفاطمة وحسن وحسين رضي الله عنهم، فألقى صلى الله عليه وسلم عليهم كساء له، ثم قال لهم\n                                   \n                                   \" اللهم هؤلاء أهل بيتي، اللهم أذهب عنهم الرجس وطهرهم تطهيراً \" قلت يارسول الله وأنا؟ قال صلى الله عليه وسلم \" وأنت \" قال فوالله إِنها لأوثق عمل عندي. حديث آخر قال الإمام أحمد حدثنا عبد الله بن نمير، حدثنا عبد الملك بن أبي سليمان عن عطاء بن أبي رباح، حدثني من سمع أم سلمة رضي الله عنها تذكر أن النبي صلى الله عليه وسلم كان في بيتها، فأتته فاطمة رضي الله عنها ببرمة فيها خزيرة، فدخلت عليه بها، فقال صلى الله عليه وسلم لها \" ادعي زوجك وابنيك \" قالت فجاء علي وحسن وحسين رضي الله عنهم، فدخلوا عليه، فجلسوا يأكلون من تلك الخزيرة، وهو على منامة له، وكان تحته صلى الله عليه وسلم كساء خيبري، قالت وأنا في الحجرة أصلي، فأنزل الله عز وجل هذه الآية { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت رضي الله عنها فأخذ صلى الله عليه وسلم فضل الكساء، فغطاهم به، ثم أخرج يده، فألوى بها إِلى السماء ثم قال \" اللهم هؤلاء أهل بيتي وخاصتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" قالت فأدخلت رأسي البيت، فقلت وأنا معكم يارسول الله؟ فقال صلى الله عليه وسلم \" إِنك إِلى خير، إِنك إِلى خير \" في إِسناده من لم يسم، وهو شيخ عطاء، وبقية رجاله ثقات. طريق أخرى قال ابن جرير حدثنا أبو كريب، حدثنا مصعب بن المقداد، حدثنا سعيد بن زربي عن محمد بن سيرين عن أبي هريرة عن أم سلمة رضي الله عنها قالت جاءت فاطمة رضي الله عنها إِلى رسول الله صلى الله عليه وسلم ببرمة لها قد صنعت فيها عصيدة، تحملها على طبق، فوضعتها بين يديه صلى الله عليه وسلم فقال \" أين ابن عمك وابناك؟ \" فقالت رضي الله عنها في البيت، فقال صلى الله عليه وسلم \" ادعيهم \" ، فجاءت إِلى علي رضي الله عنه فقالت أجب رسول الله صلى الله عليه وسلم أنت وابناك، قالت أم سلمة رضي الله عنها فلما رآهم مقبلين، مد صلى الله عليه وسلم يده إِلى كساء كان على المنامة، فمده وبسطه، وأجلسهم عليه، ثم أخذ بأطراف الكساء الأربعة بشماله، فضمه فوق رؤوسهم، وأومأ بيده اليمنى إِلى ربه فقال :\n                                   \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \". طريق أخرى قال ابن جرير حدثنا ابن حميد حدثنا عبد الله بن عبد القدوس، عن الأعمش عن حكيم بن سعد قال ذكرنا علي بن أبي طالب رضي الله عنه عند أم سلمة رضي الله عنها، فقالت في بيتي نزلت { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت أم سلمة جاء رسول الله صلى الله عليه وسلم إِلى بيتي، فقال \" لاتأذني لأحد \" فجاءت فاطمة رضي الله عنها، فلم أستطع أن أحجبها عن أبيها، ثم جاء الحسن رضي الله عنه، فلم أستطع أن أمنعه أن يدخل على جده وأمه، ثم جاء الحسين، فلم أستطع أن أحجبه عن جده صلى الله عليه وسلم وأمه رضي الله عنها، ثم جاء علي رضي الله عنه، فلم أستطع أن أحجبه، فاجتمعوا، فجللهم رسول الله صلى الله عليه وسلم بكساء كان عليه، ثم قال \" هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" فنزلت هذه الآية حين اجتمعوا على البساط، قالت فقلت يارسول الله وأنا؟ قالت فوالله ماأنعم، وقال \" إِنك إِلى خير \". طريق أخرى قال الإمام أحمد حدثنا محمد بن جعفر، حدثنا عوف عن أبي المعدل عن عطية الطفاوي عن أبيه قال إِن أم سلمة رضي الله عنها حدثته قالت بينما رسول الله صلى الله عليه وسلم في بيتي يوماً، إِذ قالت الخادم إِن فاطمة وعلياً رضي الله عنهما بالسدة، قالت فقال لي رسول الله صلى الله عليه وسلم \" قومي فتنحي عن أهل بيتي \" قالت فقمت فتنحيت في البيت قريباً، فدخل علي وفاطمة ومعهما الحسن والحسين رضي الله عنهم، وهما صبيان صغيران، فأخذ الصبيين فوضعهما في حجره فقبلهما، واعتنق علياً رضي الله عنه بإِحدى يديه، وفاطمة رضي الله عنها باليد الأخرى، وقبل فاطمة، وقبل علياً، وأغدق عليهم خميصة سوداء، وقال \" اللهم إِليك لا إِلى النار أنا وأهل بيتي \" قالت فقلت وأنا يارسول الله؟ فقال صلى الله عليه وسلم \" وأنت \". طريق أخرى قال ابن جرير حدثنا أبو كريب، حدثنا الحسن بن عطية، حدثنا فضيل بن مرزوق عن عطية عن أبي سعيد عن أم سلمة رضي الله عنها قالت إِن هذه الآية نزلت في بيتي { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت وأنا جالسة على باب البيت، فقلت يارسول الله ألست من أهل البيت؟ فقال صلى الله عليه وسلم \" إِنك إِلى خير، أنت من أزواج النبي صلى الله عليه وسلم \" قالت وفي البيت رسول الله صلى الله عليه وسلم وعلي وفاطمة والحسن والحسين رضي الله عنهم.\n                                   طريق أخرى رواها ابن جرير أيضاً عن أبي كريب عن وكيع عن عبد الحميد بن بهرام عن شهر بن حوشب عن أم سلمة رضي الله عنها بنحوه. طريق أخرى قال ابن جرير حدثنا أبو كريب حدثنا خالد بن مخلد، حدثني موسى بن يعقوب، حدثني هاشم بن هاشم بن عتبة بن أبي وقاص، عن عبد الله بن وهب بن زمعة قال أخبرتني أم سلمة رضي الله عنها قالت إِن رسول الله صلى الله عليه وسلم جمع علياً وفاطمة والحسن والحسين رضي الله عنهم، ثم أدخلهم تحت ثوبه، ثم جأر إِلى الله عز وجل ثم قال \" هؤلاء أهل بيتي \" قالت أم سلمة رضي الله عنها فقلت يارسول الله أدخلني معهم، فقال صلى الله عليه وسلم \" أنت من أهلي \". طريق أخرى رواه ابن جرير أيضاً عن أحمد بن محمد الطوسي، عن عبد الرحمن بن صالح، عن محمد بن سليمان الأصبهاني، عن يحيى بن عبيد المكي عن عطاء، عن عمر بن أبي سلمة عن أمه رضي الله عنها، بنحو ذلك. طريق أخرى قال ابن جرير حدثنا أبو كُرَيْب، حدثنا مصعب بن المقداد، حدثنا سعيد بن زربي، عن محمد بن سيرين، عن أبي هريرة، عن أم سلمة قالت جاءت فاطمة إِلى رسول الله صلى الله عليه وسلم ببرمة لها قد صنعت فيها عصيدة، تحملها على طبق، فوضعتها بين يديه فقال \" أين ابن عمك وابناك؟ \" فقالت في البيت، فقال \" ادعيهم \" ، فجاءت إِلى علي فقالت أجبْ رسول الله أنت وابناك. قالت أم سلمة فلما رآهم مقبلين، مد يده إِلي كساء كان على المنامة، فَمده، وبسطه، وأجلسهم عليه، ثم أخذ بأطراف الكساء الأربعة بشماله، فضمه فوق رؤوسهم، وأومأ بيده اليمنى إِلى ربه، فقال \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \". طريق أخرى قال ابن جرير حدثنا ابن حميد حدثنا عبد الله بن عبد القدوس، عن الأعمش، عن حكيم بن سعد قال ذكرنا علي بن أبي طالب عند أم سلمة، فقالت في بيتي نزلت { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قالت أم سلمة جاء رسول الله صلى الله عليه وسلم إِلي بيتي، فقال \" لا تأذني لأحد \" فجاءت فاطمة، فلم أستطع أن أحجبها عن أبيها، ثم جاء الحسن، فلم أستطع أن أحجبه عن أمه وجده، ثم جاء الحسين فلم أستطع أن أحجبه، ثم جاء علي، فلم أستطع أن أحجبه، فاجتمعوا، فجَلّلهم رسول الله صلى الله عليه وسلم بكساء كان عليه، ثم قال : \n                                   \" هؤلاء أهل بيتي، فأذهب عنهم الرجس وطهرهم تطهيراً \" فنزلت هذه الآية حين اجتمعوا على البساط، قالت فقلت يارسول الله، وأنا؟ قالت فوالله ما أنعم، وقال \" إِنك إِلى خير \". حديث آخر قال ابن جرير حدثنا ابن وكيع محمد بن بشير عن زكريا عن مصعب بن شيبة عن صفية بنت شيبة قالت قالت عائشة رضي الله عنها خرج النبي صلى الله عليه وسلم ذات غداة، وعليه مرطٌ مرحل من شعر أسود، فجاء الحسن رضي الله عنه، فأدخله معه، ثم جاء الحسين، فأدخله معه، ثم جاءت فاطمة، فأدخلها معه، ثم جاء علي رضي الله عنه، فأدخله معه، ثم قال صلى الله عليه وسلم \" { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } \" رواه مسلم عن أبي بكر بن أبي شيبة عن محمد بن بشر به. طريق أخرى قال ابن أبي حاتم حدثنا أبي، حدثنا سريج بن يونس أبو الحارث، حدثنا محمد بن يزيد عن العوام، يعني ابن حوشب رضي الله عنه، عن عم له قال دخلت مع أبي على عائشة رضي الله عنها، فسألتها عن علي رضي الله عنه، فقالت رضي الله عنها تسألني عن رجل كان من أحب الناس إِلى رسول الله صلى الله عليه وسلم وكانت تحته ابنته، وأحب الناس إِليه؟ لقد رأيت رسول الله صلى الله عليه وسلم دعا علياً وفاطمة وحسناً وحسيناً رضي الله عنهم، فألقى عليهم ثوباً فقال \" اللهم هؤلاء أهل بيتي، فأذهب عنهم الرجس، وطهرهم تطهيراً \" قالت فدنوت منهم فقلت يارسول الله وأنا من أهل بيتك؟ فقال صلى الله عليه وسلم \" تنحي فإِنك على خير \". حديث آخر قال ابن جرير حدثنا ابن المثنى، حدثنا بكر بن يحيى بن زبان العنزي، حدثنا مندل عن الأعمش عن عطية عن أبي سعيد رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" نزلت هذه الآية في خمسة فيّ وفي علي وحسن وحسين وفاطمة { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } \" قد تقدم أن فضيل بن مرزوق رواه عن عطية عن أبي سعيد عن أم سلمة رضي الله عنها كما تقدم. وروى ابن أبي حاتم من حديث هارون بن سعد العجلي عن عطية عن أبي سعيد رضي الله عنه موقوفاً، والله سبحانه وتعالى أعلم. حديث آخر قال ابن جرير حدثنا ابن المثنى، حدثنا أبو بكر الحنفي، حدثنا بكير بن مسمار قال سمعت عامر بن سعد رضي الله عنه قال قال سعد رضي الله عنه قال رسول الله صلى الله عليه وسلم حين نزل عليه الوحي، فأخذ علياً وابنيه وفاطمة رضي الله عنهم، فأدخلهم تحت ثوبه ثم قال\n                                   \n\" رب هؤلاء أهلي وأهل بيتي \". حديث آخر وقال مسلم في \" صحيحه \" حدثني زهير بن حرب وشجاع بن مخلد جميعاً عن ابن علية، قال زهير حدثنا إِسماعيل بن إِبراهيم، حدثني أبو حيان، حدثني يزيد بن حبان قال انطلقت أنا وحصين بن سبرة وعمر بن مسلم إِلى زيد بن أرقم رضي الله عنه، فلما جلسنا إِليه، قال له حصين لقد لقيت يازيد خيراً كثيراً رأيت رسول الله صلى الله عليه وسلم وسمعت حديثه، وغزوت معه، وصليت خلفه، لقد لقيت يا زيد خيراً كثيراً، حدثنا يا زيد ما سمعت من رسول الله صلى الله عليه وسلم قال يابن أخي والله لقد كبرت سني، وقدم عهدي، ونسيت بعض الذي كنت أعي من رسول الله صلى الله عليه وسلم فما حدثتكم فاقبلوا، ومالا فلا تكلفونيه، ثم قال قام فينا رسول الله صلى الله عليه وسلم يوماً خطيباً بماء يدعى خماً، بين مكة والمدينة، فحمد الله تعالى وأثنى عليه، ووعظ وذكر، ثم قال \" أما بعد، ألا أيها الناس فإِنما أنا بشر يوشك أن يأتيني رسول ربي فأجيب، وأنا تارك فيكم ثقلين أولهما كتاب الله تعالى، فيه الهدى والنور، فخذوا بكتاب الله، واستمسكوا به \" فحث على كتاب الله عز وجل، ورغب فيه، ثم قال \" وأهل بيتي، أذكركم الله في أهل بيتي، أذكركم الله في أهل بيتي \" ثلاثاً، فقال له حصين ومن أهل بيته يازيد؟ أليس نساؤه من أهل بيته؟ قال نساؤه من أهل بيته، ولكن أهل بيته من حرم الصدقة بعده، قال ومن هم؟ قال هم آل علي وآل عقيل وآل جعفر وآل العباس رضي الله عنهم، قال كل هؤلاء حرم الصدقة بعده؟ قال نعم. ثم رواه عن محمد بن بكار بن الريان عن حسان بن إِبراهيم عن سعيد بن مسروق عن يزيد بن حيان عن زيد بن أرقم رضي الله عنه، فذكر الحديث بنحو ما تقدم، وفيه فقلت له من أهل بيته، نساؤه؟ قال لا، وايم الله إِن المرأة تكون مع الرجل العصر من الدهر، ثم يطلقها، فترجع إِلى أبيها وقومها، أهل بيته أصله وعصبته الذين حرموا الصدقة بعده. هكذا وقع في هذه الرواية، والأولى أولى، والأخذ بها أحرى. وهذه الثانية تحتمل أنه أراد تفسير الأهل المذكورين في الحديث الذي رواه، إِنما المراد بهم آله الذين حرموا الصدقة، أو أنه ليس المراد بالأهل الأزواج فقط، بل هم مع آله، وهذا الاحتمال أرجح جمعاً بينها وبين الرواية التي قبلها، وجمعاً أيضاً بين القرآن والأحاديث المتقدمة إِن صحت، فإِن في بعض أسانيدها نظراً، والله أعلم، ثم الذي لا يشك فيه من تدبر القرآن أن نساء النبي صلى الله عليه وسلم داخلات في قوله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } فإِن سياق الكلام معهن، ولهذا قال تعالى بعد هذا كله { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِى بُيُوتِكُـنَّ مِنْ ءَايَـٰتِ ٱللَّهِ وَٱلْحِكْــمَةِ } أي واعملن بما ينزل الله تبارك وتعالى على رسوله صلى الله عليه وسلم في بيوتكن من الكتاب والسنة، قاله قتادة وغير واحد، واذكرن هذه النعمة التي خصصتن بها من بين الناس، أن الوحي ينزل في بيوتكن دون سائر الناس، وعائشة الصديقة بنت الصديق رضي الله عنهما أولاهن بهذه النعمة، وأحظاهن بهذه الغنيمة، وأخصهن من هذه الرحمة العميمة، فإِنه لم ينزل على رسول الله صلى الله عليه وسلم الوحي في فراش امرأة سواها، كما نص على ذلك صلوات الله وسلامه عليه.\n                                   \nقال بعض العلماء رحمه الله لأنه لم يتزوج بكراً سواها، ولم ينم معها رجل في فراشها سواه صلى الله عليه وسلم ورضي الله عنها، فناسب أن تخصص بهذه المزية، وأن تفرد بهذه المرتبة العليا، ولكن إِذا كان أزواجه من أهل بيته، فقرابته أحق بهذه التسمية كما تقدم في الحديث \" وأهل بيتي أحق \" وهذا مايشبه ماثبت في \" صحيح مسلم \" أن رسول الله صلى الله عليه وسلم لما سئل عن المسجد الذي أسس على التقوى من أول يوم، فقال \" هو مسجدي هذا \" فهذا من هذا القبيل، فإِن الآية إِنما نزلت في مسجد قباء كما ورد في الأحاديث الأخر، ولكن إِذا كان ذاك أسس على التقوى من أول يوم، فمسجد رسول الله صلى الله عليه وسلم أولى بتسميته بذلك، والله أعلم. وقد قال ابن أبي حاتم حدثنا أبي، حدثنا أبو الوليد، حدثنا أبو عوانة عن حصين بن عبد الرحمن عن أبي جميلة قال إِن الحسن بن علي رضي الله عنهما استخلف حين قتل علي رضي الله عنهما، قال فبينما هو يصلي، إِذ وثب عليه رجل، فطعنه بخنجره، وزعم حصين أنه بلغه أن الذي طعنه رجل من بني أسد، وحسن رضي الله عنه ساجد. قال فيزعمون أن الطعنة وقعت في وركه، فمرض منها أشهراً، ثم برأ، فقعد على المنبر فقال يا أهل العراق اتقوا الله فينا، فإِنا أمراؤكم وضيفانكم، ونحن أهل البيت الذي قال الله تعالى { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً } قال فما زال يقولها حتى ما بقي أحد من أهل المسجد إِلا وهو يحن بكاءً. وقال السدي عن أبي الديلم قال قال علي بن الحسين رضي الله عنهما لرجل من أهل الشام أما قرأت في الأحزاب { إِنَّمَا يُرِيدُ ٱللَّهُ لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيـراً }؟ فقال نعم، ولأنتم هم؟ قال نعم.\n                                   وقوله تعالى { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } أي بلطفه بكن بلغتن هذه المنزلة، وبخبرته بكن وأنكن أهل لذلك أعطاكن ذلك، وخصكن بذلك. قال ابن جرير رحمه الله واذكرن نعمة الله عليكن بأن جعلكن في بيوت تتلى فيها آيات الله والحكمة، فاشكرن الله تعالى على ذلك واحمدنه، { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } أي ذا لطف بكن، إِذ جعلكن في البيوت التي تتلى فيها آيات الله والحكمة، وهي السنة. خبيراً بكن، إِذ اختاركن لرسوله أزواجاً. وقال قتادة { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِى بُيُوتِكُـنَّ مِنْ ءَايَـٰتِ ٱللَّهِ وَٱلْحِكْــمَةِ } قال يمتن عليهن بذلك، رواه ابن جرير. وقال عطية العوفي في قوله تعالى { إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } يعني لطيفاً باستخراجها، خبيراً بموضعها، رواه ابن أبي حاتم، ثم قال وكذا روي عن الربيع بن أنس عن قتادة.\n                                    ",
        "qortoby": "وَٱذۡكُرۡنَ مَا يُتۡلَىٰ فِي بُيُوتِكُنَّ مِنۡ ءَايَٰتِ ٱللَّهِ وَٱلۡحِكۡمَةِۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا ٤٣\n                                    \n                                    \n                                    فيه ثلاث مسائل:\n\nالأولى: قوله تعالى: { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِي بُيُوتِكُـنَّ مِنْ آيَاتِ ٱللَّهِ وَٱلْحِكْـمَةِ } هذه الألفاظ تعطي أن أهل البيت نساؤه. وقد اختلف أهل العلم في أهل البيت، من هم؟ فقال عطاء وعِكرمة وابن عباس: هم زوجاته خاصّةً، لا رجل معهن. وذهبوا إلى أن البيت أريد به مساكن النبيّ صلى الله عليه وسلم؛ لقوله تعالى: { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِي بُيُوتِكُـنَّ }. وقالت فرقة منهم الكَلْبِيّ: هم عليّ وفاطمة والحسن والحسين خاصة؛ وفي هذا أحاديث عن النبيّ عليه السلام، واحتجُّوا بقوله تعالى: { لِيُذْهِبَ عَنكُـمُ ٱلرِّجْسَ أَهْلَ ٱلْبَيْتِ وَيُطَهِّرَكُمْ } بالميم، ولو كان للنساء خاصة لكان «عنكنّ ويطهركنّ»؛ إلا أنه يحتمل أن يكون خرج على لفظ الأهل؛ كما يقول الرجل لصاحبه : كيف أهلك؛ أي امرأتك ونساؤك؛ فيقول: هم بخير؛ قال الله تعالى :\n{ أَتَعْجَبِينَ مِنْ أَمْرِ ٱللَّهِ رَحْمَةُ ٱللَّهِ وَبَرَكَاتُهُ عَلَيْكُمْ أَهْلَ ٱلْبَيْتِ }\n[هود: 73].\n\nوالذي يظهر من الآية أنها عامة في جميع أهل البيت من الأزواج وغيرهم. وإنما قال: { وَيُطَهِّرَكُمْ } لأن رسول الله صلى الله عليه وسلم وعَلِيًّا وحَسَناً وحُسَيْناً كان فيهم، وإذا اجتمع المذكر والمؤنث غُلّب المذكر؛ فاقتضت الآية أن الزوجات من أهل البيت، لأن الآية فيهنّ، والمخاطبة لهنّ، يدلّ عليه سياق الكلام. والله أعلم. أما أن \" أمّ سلمة قالت: نزلت هذه الآية في بيتي، فدعا رسول الله صلى الله عليه وسلم عليًّا وفاطمة وحَسَناً وحُسَيْناً، فدخل معهم تحت كساءٍ خَيْبَرِيّ وقال: «هؤلاء أهل بيتي» ـ وقرأ الآية ـ وقال: «اللهم أذهب عنهم الرجس وطهّرهم تطهيراً» فقالت أمّ سلمة: وأنا معهم يا رسول الله؟ قال: «أنتِ على مكانك وأنتِ على خير» \" أخرجه الترمذي وغيره وقال: هذا حديث غريب. وقال القشيري: \" وقالت أمّ سلمة أدخلت رأسي في الكساء وقلت: أنا منهم يا رسول الله؟ قال: «نعم» \" وقال الثعلبي: هم بنو هاشم، فهذا يدل على أن البيت يراد به بيت النسب، فيكون العباس وأعمامه وبنو أعمامه منهم. وروي نحوه عن زيد بن أرقم رضي الله عنهم أجمعين. وعلى قول الكَلْبي يكون قوله: { وَٱذْكُـرْنَ } ابتداء مخاطبة الله تعالى، أي مخاطبة أمر الله عز وجل أزواج النبي صلى الله عليه وسلم، على جهة الموعظة وتعديد النعمة بذكر ما يتلى في بيوتهنّ من آيات الله تعالى والحكمة. قال أهل العلم بالتأويل: «آيَاتِ اللَّهِ» القرآن. «وَالْحِكْمَة» السنة. والصحيح أن قوله: { وَٱذْكُـرْنَ } منسوق على ما قبله. وقال: «عنكم» لقوله: «أهل» فالأهل مذكر؛ فسماهنّ ـ وإن كنّ إناثاً ـ باسم التذكير فلذلك صار «عنكم». ولا اعتبار بقول الكلبي وأشباهه، فإنه توجد له أشياء في هذا التفسير ما لو كان في زمن السلف الصالح لمنعوه من ذلك وحجروا عليه.\n                                   فالآيات كلها من قوله: { يٰأَيُّهَا ٱلنَّبِيُّ قُل لأَزْوَاجِكَ ـ إلى قوله ـ إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } منسوق بعضها على بعض، فكيف صار في الوسط كلاماً منفصلاً لغيرهن! وإنما هذا شيء جرى في الأخبار \" أن النبي عليه السلام لما نزلت عليه هذه الآية دعا عليًّا وفاطمة والحسن والحسين، فعمَد النبي صلى الله عليه وسلم إلى كساء فلفّها عليهم، ثم ألوى بيده إلى السماء فقال: «اللَّهُم هؤلاء أهل بيتي اللَّهُمَّ أذهب عنهم الرجس وطهرهم تطهيراً» \" فهذه دعوة من النبي صلى الله عليه وسلم لهم بعد نزول الآية، أحبَّ أن يدخلهم في الآية التي خوطب بها الأزواج، فذهب الكلبي ومن وافقه فصيّرها لهم خاصّة، وهي دعوة لهم خارجة من التنزيل.\n\nالثانية: لفظ الذِّكْر يحتمل ثلاثة معان: أحدها: أي اذكرن موضع النعمة، إذ صيّركن الله في بيوت تُتلى فيها آيات الله والحكمة. الثاني: اذكرن آيات الله واقدرن قدرها، وفكِّرن فيها حتى تكون منكن على بالٍ لتتعِظن بمواعظ الله تعالى، ومن كان هذا حاله ينبغي أن تحسن أفعاله. الثالث: «اذكرن» بمعنى احفظن واقرأْن والزمنه الألسنة، فكأنه يقول: احفظن أوامر الله تعالى ونواهيه، وذلك هو الذي يُتلى في بيوتكن من آيات الله. فأمر الله سبحانه وتعالى أن يخبرن بما ينزل من القرآن في بيوتهن، وما يرين من أفعال النبي عليه الصلاة والسلام، ويسمعن من أقواله حتى يبلغن ذلك إلى الناس، فيعملوا ويقتدوا. وهذا يدل على جواز قبول خبر الواحد من الرجال والنساء في الدِّين.\n\nالثالثة: قال ابن العربي: في هذه الآية مسألة بديعة، وهي أن الله تعالى أمر نبيّه عليه الصلاة والسلام بتبليغ ما أنزل عليه من القرآن؛ وتعليم ما علِمه من الدين؛ فكان إذا قرأ على واحد أو ما اتفق سقط عنه الفرض، وكان على من سمعه أن يبلغه إلى غيره، ولا يلزمه أن يذكره لجميع الصحابة، ولا كان عليه إذا علم ذلك أزواجه أن يخرج إلى الناس فيقول لهم نزل كذا ولا كان كذا؛ ولهذا قلنا: يجوز العمل بخبر بُسْرة في إيجاب الوضوء من مسّ الذكر؛ لأنها رَوَت ما سمعت وبلّغت ما وَعَت. ولا يلزم أن يبلغ ذلك الرجال، كما قال أبو حنيفة، على أنه قد نقل عن سعد بن أبي وقاص وابن عمر.\n                                    ",
        "saadi": "وَٱذۡكُرۡنَ مَا يُتۡلَىٰ فِي بُيُوتِكُنَّ مِنۡ ءَايَٰتِ ٱللَّهِ وَٱلۡحِكۡمَةِۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا ٤٣\n                                        \n                                        \n                                        \n                                        وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِي بُيُوتِكُـنَّ مِنْ آيَاتِ ٱللَّهِ وَٱلْحِكْـمَةِ إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً\n                                    "
      },
      "originalText": "وَٱذۡكُرۡنَ مَا يُتۡلَىٰ فِي بُيُوتِكُنَّ مِنۡ ءَايَٰتِ ٱللَّهِ وَٱلۡحِكۡمَةِۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا ٤٣"
    },
    {
      "number": 3568,
      "text": "إِنَّ الْمُسْلِمِينَ وَالْمُسْلِمَاتِ وَالْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْقَانِتِينَ وَالْقَانِتَاتِ وَالصَّادِقِينَ وَالصَّادِقَاتِ وَالصَّابِرِينَ وَالصَّابِرَاتِ وَالْخَاشِعِينَ وَالْخَاشِعَاتِ وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ وَالصَّائِمِينَ وَالصَّائِمَاتِ وَالْحَافِظِينَ فُرُوجَهُمْ وَالْحَافِظَاتِ وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 35,
      "juz": 22,
      "manzil": 5,
      "page": 422,
      "ruku": 365,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلۡمُسۡلِمِينَ وَٱلۡمُسۡلِمَٰتِ وَٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ وَٱلۡقَٰنِتِينَ وَٱلۡقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلۡخَٰشِعِينَ وَٱلۡخَٰشِعَٰتِ وَٱلۡمُتَصَدِّقِينَ وَٱلۡمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلۡحَٰفِظِينَ فُرُوجَهُمۡ وَٱلۡحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرٗا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمٗا ٥٣\n                                    \n                                    \n                                    قال الإمام أحمد حدثنا عفان حدثنا عبد الواحد بن زياد، حدثنا عثمان بن حكيم، حدثنا عبد الرحمن بن شيبة قال سمعت أم سلمة رضي الله عنها زوج النبي صلى الله عليه وسلم تقول قلت للنبي صلى الله عليه وسلم مالنا لا نذكر في القرآن كما يذكر الرجال؟ قالت فلم يرعني منه ذات يوم إِلا ونداؤه على المنبر، وأنا أسرح شعري، فلففت شعري، ثم خرجت إِلى حجرتي حجرة بيتي، فجعلت سمعي عند الجريد، فإِذا هو يقول عند المنبر \" يا أيها الناس إِن الله تعالى يقول { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَـٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ وَٱلْقَـٰنِتِينَ وَٱلْقَـٰنِتَـٰتِ وَٱلصَّـٰدِقِينَ وَٱلصَّـٰدِقَـٰتِ وَٱلصَّـٰبِرِينَ وَٱلصَّـٰبِرَٰتِ وَٱلْخَـٰشِعِينَ وَٱلْخَـٰشِعَـٰتِ } \" إِلى آخر الآية، وهكذا رواه النسائي وابن جرير من حديث عبد الواحد بن زياد به مثله. طريق أخرى عنها قال النسائي أيضاً حدثنا محمد بن حاتم، حدثنا سويد، أخبرنا عبد الله بن شريك عن محمد بن عمرو عن أبي سلمة عن أم سلمة رضي الله عنها أنها قالت للنبي صلى الله عليه وسلم يانبي الله مالي أسمع الرجال يذكرون في القرآن، والنساء لا يذكرن؟ فأنزل الله تعالى { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَـٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ وَٱلْقَـٰنِتِينَ وَٱلْقَـٰنِتَـٰتِ وَٱلصَّـٰدِقِينَ وَٱلصَّـٰدِقَـٰتِ وَٱلصَّـٰبِرِينَ وَٱلصَّـٰبِرَٰتِ وَٱلْخَـٰشِعِينَ وَٱلْخَـٰشِعَـٰتِ } وقد رواه ابن جرير عن أبي كريب عن أبي معاوية، عن محمد بن عمرو عن أبي سلمة أن يحيى بن عبد الرحمن بن حاطب حدثه عن أم سلمة رضي الله عنها قالت قلت يا رسول الله أيذكر الرجال في كل شيء ولا نذكر؟ فأنزل الله تعالى { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَـٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ وَٱلْقَـٰنِتِينَ وَٱلْقَـٰنِتَـٰتِ وَٱلصَّـٰدِقِينَ وَٱلصَّـٰدِقَـٰتِ وَٱلصَّـٰبِرِينَ وَٱلصَّـٰبِرَٰتِ وَٱلْخَـٰشِعِينَ وَٱلْخَـٰشِعَـٰتِ } الآية. طريق أخرى قال سفيان الثوري عن ابن أبي نجيح عن مجاهد قال قالت أم سلمة رضي الله عنها يارسول الله يذكر الرجال ولانذكر، فأنزل الله تعالى { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَـٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ وَٱلْقَـٰنِتِينَ وَٱلْقَـٰنِتَـٰتِ وَٱلصَّـٰدِقِينَ وَٱلصَّـٰدِقَـٰتِ وَٱلصَّـٰبِرِينَ وَٱلصَّـٰبِرَٰتِ وَٱلْخَـٰشِعِينَ وَٱلْخَـٰشِعَـٰتِ } الآية. حديث آخر قال ابن جرير حدثنا أبو كريب قال حدثنا سيار بن مظاهر العنزي، حدثنا أبو كدينة يحيى بن المهلب عن قابوس بن أبي ظبيان عن أبيه عن ابن عباس رضي الله عنهما قال قال النساء للنبي صلى الله عليه وسلم ماله يذكر المؤمنين ولايذكر المؤمنات؟ فأنزل الله تعالى { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَـٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ وَٱلْقَـٰنِتِينَ وَٱلْقَـٰنِتَـٰتِ وَٱلصَّـٰدِقِينَ وَٱلصَّـٰدِقَـٰتِ وَٱلصَّـٰبِرِينَ وَٱلصَّـٰبِرَٰتِ وَٱلْخَـٰشِعِينَ وَٱلْخَـٰشِعَـٰتِ } الآية، وحدثنا بشر حدثنا يزيد، حدثنا سعيد عن قتادة قال دخل نساء على نساء النبي صلى الله عليه وسلم فقلن قد ذكركن الله تعالى في القرآن، ولم نذكر بشيء، أما فينا ما يذكر؟ فأنزل الله تعالى { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَـٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ وَٱلْقَـٰنِتِينَ وَٱلْقَـٰنِتَـٰتِ وَٱلصَّـٰدِقِينَ وَٱلصَّـٰدِقَـٰتِ وَٱلصَّـٰبِرِينَ وَٱلصَّـٰبِرَٰتِ وَٱلْخَـٰشِعِينَ وَٱلْخَـٰشِعَـٰتِ } الآية، فقوله تعالى { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَـٰتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ } دليل على أن الإيمان غير الإسلام، وهو أخص منه لقوله تعالى\n{ قَالَتِ ٱلأَعْرَابُ ءَامَنَّا قُل لَّمْ تُؤْمِنُواْ وَلَـٰكِن قُولُوۤاْ أَسْلَمْنَا وَلَمَّا يَدْخُلِ ٱلإِيمَـٰنُ فِى قُلُوبِكُمْ }\nالحجرات 14. وفي \" الصحيحين \" \" لا يزني الزاني حين يزني وهو مؤمن \" فيسلبه الإيمان، ولايلزم من ذلك كفره بإِجماع المسلمين، فدل على أنه أخص منه كما قررناه أولاً في شرح البخاري. وقوله تعالى { وَٱلْقَـٰنِتِينَ وَٱلْقَـٰنِتَـٰتِ } القنوت هو الطاعة في سكون\n{ أَمَّنْ هُوَ قَانِتٌ ءَانَآءَ ٱلَّيْلِ سَـٰجِداً وَقَآئِماً يَحْذَرُ ٱلأَخِرَةَ وَيَرْجُواْ رَحْمَةَ رَبِّهِ }\nالزمر 9 وقال تعالى\n{ وَلَهُ مَن فِى ٱلسَّمَـٰوَٰتِ وَٱلأَرْضِ كُلٌّ لَّهُ قَـٰنِتُونَ }\nالروم 26\n{ يٰمَرْيَمُ ٱقْنُتِى لِرَبِّكِ وَٱسْجُدِى وَٱرْكَعِى مَعَ ٱلرَٰكِعِينَ }\nآل عمران 43\n{ وَقُومُواْ لِلَّهِ قَـٰنِتِينَ }\nالبقرة 238 فالإسلام بعده مرتبة يرتقى إِليها، وهو الإيمان، ثم القنوت ناشىء عنهما، { وَٱلصَّـٰدِقِينَ وَٱلصَّـٰدِقَـٰتِ } هذا في الأقوال، فإِن الصدق خصلة محمودة، ولهذا كان بعض الصحابة رضي الله عنهم لم تجرب عليهم كذبة، لا في الجاهلية ولا في الإسلام، وهو علامة على الإيمان، كما أن الكذب أمارة على النفاق، ومن صدق نجا، \" عليكم بالصدق فإِن الصدق يهدي إِلى البر، وإِن البر يهدي إِلى الجنة، وإِياكم والكذب، فإِن الكذب يهدي إِلى الفجور، وإِن الفجور يهدي إِلى النار، ولا يزال الرجل يصدق ويتحرى الصدق حتى يكتب عند الله صديقاً، ولا يزال الرجل يكذب ويتحرى الكذب حتى يكتب عند الله كذاباً \". والأحاديث فيه كثيرة جداً، { وَٱلصَّـٰبِرِينَ وَٱلصَّـٰبِرَٰتِ } هذه سجية الأثبات، وهي الصبر على المصائب، والعلم بأن المقدر كائن لا محالة، وتلقي ذلك بالصبر والثبات وإنما الصبر عند الصدمة الأولى، أي أصعبه في أول وهلة، ثم مابعده أسهل منه، وهو صدق السجية وثباتها، { وَٱلْخَـٰشِعِينَ وَٱلْخَـٰشِعَـٰتِ } الخشوع السكون والطمأنينة، والتؤدة والوقار، والتواضع، والحامل عليه الخوف من الله تعالى ومراقبته كما في الحديث \" اعبد الله كأنك تراه، فإِن لم تكن تراه، فإِنه يراك \" ، { وَٱلْمُتَصَدِّقِينَ وَٱلْمُتَصَدِّقَـٰتِ } الصدقة هي الإحسان إِلى الناس المحاويج الضعفاء الذين لا كسب لهم، ولا كاسب، يعطون من فضول الأموال طاعة لله، وإِحساناً إِلى خلقه. وقد ثبت في \" الصحيحين \" \" سبعة يظلهم الله في ظله يوم لا ظل إِلا ظله ــــ فذكر منهم ــــ ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه \" وفي الحديث الآخر \" والصدقة تطفىء الخطيئة كما يطفىء الماء النار \" والأحاديث في الحث عليها كثيرة جداً له موضع بذاته، { وٱلصَّائِمِينَ وٱلصَّائِمَاتِ } وفي الحديث الذي رواه ابن ماجه \" والصوم زكاة البدن \" أي يزكيه ويطهره، وينقيه من الأخلاط الرديئة طبعاً وشرعاً كما قال سعيد بن جبير من صام رمضان وثلاثة أيام من كل شهر، دخل في قوله تعالى { وٱلصَّـٰئِمِينَ وٱلصَّـٰئِمَـٰتِ } ولما كان الصوم من أكبر العون على كسر الشهوة كما قال رسول الله صلى الله عليه وسلم\n                                   \" يامعشر الشباب من استطاع منكم الباءة فليتزوج، فإِنه أغض للبصر، وأحصن للفرج، ومن لم يستطع، فعليه بالصوم فإِنه له وجاء \" ناسب أن يذكر بعده { وٱلصَّائِمِينَ وٱلصَّائِمَاتِ وَٱلْحَافِظِينَ فُرُوجَهُمْ وَٱلْحَافِـظَاتِ } أي عن المحارم والمآثم، إِلا عن المباح كما قال عز وجل\n{ وَٱلَّذِينَ هُمْ لِفُرُوجِهِمْ حَـٰفِظُونَ إِلاَّ عَلَىٰ أَزْوَٰجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَـٰنُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ فَمَنِ ٱبْتَغَىٰ وَرَآءَ ذٰلِكَ فَأُوْلَـٰئِكَ هُمُ ٱلْعَادُونَ }\nالمؤمنون 5 ــــ 7. وقوله تعالى { وَٱلذَّاكِـرِينَ ٱللَّهَ كَثِيراً وَٱلذَّاكِرَاتِ } قال ابن أبي حاتم حدثنا أبي، حدثنا هشام بن عبيد الله، حدثنا محمد بن جابر عن علي بن الأقمر عن الأغر أبي مسلم، عن أبي سعيد الخدري رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم قال \" إِذا أيقظ الرجل امرأته من الليل، فصليا ركعتين، كُتبا تلك الليلة من الذاكرين الله كثيراً والذاكرات \" وقد رواه أبو داود والنسائي وابن ماجه من حديث الأعمش عن علي بن الأقمر عن الأغر أبي مسلم عن أبي سعيد وأبي هريرة رضي الله عنهما عن النبي صلى الله عليه وسلم بمثله. وقال الإمام أحمد حدثنا حسن، حدثنا ابن لهيعة، حدثنا دراج عن أبي الهيثم عن أبي سعيد الخدري رضي الله عنه أنه قال قلت يارسول الله أي العباد أفضل درجة عند الله تعالى يوم القيامة؟ قال صلى الله عليه وسلم \" الذاكرون الله كثيراً والذاكرات \" قال قلت يارسول الله ومن الغازي في سبيل الله تعالى؟ قال \" لو ضرب بسيفه في الكفار والمشركين حتى ينكسر ويتخضب دماً، لكان الذاكرون الله تعالى أفضل منه \". وقال الإمام أحمد حدثنا عفان، حدثنا عبد الرحمن بن إِبراهيم عن العلاء عن أبيه عن أبي هريرة رضي الله عنه قال كان رسول الله صلى الله عليه وسلم يسير في طريق مكة، فأتى على جمدان، فقال \" هذا جمدان، سيروا، فقد سبق المفردون \" قالوا وما المفردون؟ قال صلى الله عليه وسلم \" الذاكرون الله كثيراً والذاكرات \" ثم قال صلى الله عليه وسلم \" اللهم اغفر للمحلقين \" قالوا والمقصرين؟ قال صلى الله عليه وسلم \" اللهم اغفر للمحلقين \" قالوا والمقصرين؟ قال \" والمقصرين \" تفرد به من هذا الوجه، ورواه مسلم دون آخره. وقال الإمام أحمد حدثنا حجين بن المثنى، حدثنا عبد العزيز بن أبي سلمة عن زياد بن أبي زياد مولى عبد الله بن عياش بن أبي ربيعة قال إِنه بلغني عن معاذ بن جبل رضي الله عنه أنه قال قال رسول الله صلى الله عليه وسلم\n                                   \n\" ماعمل آدمي عملاً قط أنجى له من عذاب الله تعالى من ذكر الله عز وجل \" وقال معاذ رضي الله عنه قال رسول الله صلى الله عليه وسلم \" ألا أخبركم بخير أعمالكم، وأزكاها عند مليككم، وأرفعها في درجاتكم، وخير لكم من تعاطي الذهب والفضة، ومن أن تلقوا عدوكم غداً فتضربوا أعناقهم ويضربوا أعناقكم؟ \" قالوا بلى يارسول الله، قال صلى الله عليه وسلم \" ذكر الله عز وجل \". وقال الإمام أحمد حدثنا حسن، حدثنا ابن لهيعة، حدثنا زبان بن فائد عن سهل بن معاذ بن أنس الجهني عن أبيه رضي الله عنه، عن رسول الله صلى الله عليه وسلم قال إِن رجلاً سأله فقال أي المجاهدين أعظم أجراً يارسول الله؟ قال صلى الله عليه وسلم \" أكثرهم لله تعالى ذكراً \" قال فأي الصائمين أكثر أجراً؟ قال صلى الله عليه وسلم \" أكثرهم لله عزّ وجل ذكراً \" ثم ذكر الصلاة والزكاة والحج والصدقة، كل ذلك يقول رسول الله \" أكثرهم لله ذكراً \" فقال أبو بكر لعمر رضي الله عنهما ذهب الذاكرون بكل خير، فقال رسول الله صلى الله عليه وسلم \" أجل \" وسنذكر إِن شاء الله تعالى بقية الأحاديث الواردة في كثرة الذكر عند قوله تعالى في هذه السورة\n{ يٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذْكُرُواْ ٱللَّهَ ذِكْراً كَثِيراً وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً }\nالأحزاب 41 ــــ 42 الآية، إِن شاء الله تعالى. وقوله تعالى { أَعَدَّ ٱللَّهُ لَهُم مَّغْفِرَةً وَأَجْراً عَظِيماً } خبر عن هؤلاء المذكورين كلهم، أي إن الله تعالى قد أعد لهم، أي هيأ لهم مغفرة منه لذنوبهم، وأجراً عظيماً، وهو الجنة.\n\n                                    ",
        "qortoby": "إِنَّ ٱلۡمُسۡلِمِينَ وَٱلۡمُسۡلِمَٰتِ وَٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ وَٱلۡقَٰنِتِينَ وَٱلۡقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلۡخَٰشِعِينَ وَٱلۡخَٰشِعَٰتِ وَٱلۡمُتَصَدِّقِينَ وَٱلۡمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلۡحَٰفِظِينَ فُرُوجَهُمۡ وَٱلۡحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرٗا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمٗا ٥٣\n                                    \n                                    \n                                    فيه مسألتان:\n\nالأولى: روى الترمذي عن أمّ عُمارة الأنصارية أنها أتت النبي صلى الله عليه وسلم فقالت: ما أرى كل شيء إلا للرجال، وما أرى النساء يذكرن بشيء! فنزلت هذه الآية: { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَاتِ وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ } الآية. هذا حديث حسن غريب. و«الْمُسْلِمِينَ» اسم «إنّ». «وَالْمُسْلِمَاتِ» عطف عليه. ويجوز رفعهن عند البصريين، فأما الفرّاء فلا يجوز عنده إلا فيما لا يتبين فيه الإعراب.\n\nالثانية: بدأ تعالى في هذه الآية بذكر الإسلام الذي يعمّ الإيمان وعمل الجوارح، ثم ذكر الإيمان تخصيصاً له وتنبيهاً على أنه عُظْم الإسلام ودِعامته. والقانت: العابد المطيع. والصادق: معناه فيما عُوهِدَ عليه أن يفي به. والصابر عن الشهوات وعلى الطاعات في المَكْره والمَنْشَط. والخاشع: الخائف لله. والمتصدّق بالفرض والنفل. وقيل: بالفرض خاصّة؛ والأوّل أمدح. والصائم كذلك. { وَٱلْحَافِظِينَ فُرُوجَهُمْ وَٱلْحَافِـظَاتِ } أي عما لا يحلّ من الزنى وغيره. وفي قوله: { وَٱلْحَافِـظَاتِ } حذف يدل عليه المتقدّم، تقديره: والحافظاتها، فاكتفى بما تقدّم. وفي { وَٱلذَّاكِرَاتِ } أيضاً مثله، ونظيره قول الشاعر:\nوكُمْتاً مُدَمّاة كأن متونها\t   \tجرى فوقها واستشعرتْ لَوْنُ مُذْهَبِ\nوروى سيبويه: «لَوْنَ مُذْهَبِ» بالنصب. وإنما يجوز الرفع على حذف الهاء، كأنه قال: واستشعرته؛ فيمن رفع لوناً. والذاكر قيل في أدبار الصلوات وغُدُوًّا وعَشِيًّا، وفي المضاجع وعند الانتباه من النوم. وقد تقدّم هذا كله مفصلاً في مواضعه، وما يترتب عليه من الفوائد والأحكام، فأغنى عن الإعادة. والحمد للَّهِ رب العالمين. قال مجاهد: لا يكون ذاكراً للَّهِ تعالى كثيراً حتى يذكره قائماً وجالساً ومضطجعاً. وقال أبو سعيد الخدريّ رضي الله عنه: من أيقظ أهله بالليل وصلّيَا أربع ركعات كُتبا من الذاكرين الله كثيراً والذاكرات.\n                                    ",
        "saadi": "إِنَّ ٱلۡمُسۡلِمِينَ وَٱلۡمُسۡلِمَٰتِ وَٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ وَٱلۡقَٰنِتِينَ وَٱلۡقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلۡخَٰشِعِينَ وَٱلۡخَٰشِعَٰتِ وَٱلۡمُتَصَدِّقِينَ وَٱلۡمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلۡحَٰفِظِينَ فُرُوجَهُمۡ وَٱلۡحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرٗا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمٗا ٥٣\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى ثواب زوجات الرسول صلى اللّه عليه وسلم وعقابهن [لو قدر عدم الامتثال] وأنه ليس مثلهن أحد من النساء، ذكر بقية النساء غيرهن. ولما كان حكمهن والرجال واحداً، جعل الحكم مشتركاً، فقال: { إِنَّ ٱلْمُسْلِمِينَ وَٱلْمُسْلِمَاتِ } وهذا في الشرائع الظاهرة، إذا كانوا قائمين بها. { وَٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ } وهذا في الأمور الباطنة، من عقائد القلب وأعماله. { وَٱلْقَانِتِينَ } أي: المطيعين للّه ولرسوله { وَٱلْقَانِتَاتِ وَٱلصَّادِقِينَ } في مقالهم وفعالهم { وَٱلصَّادِقَاتِ } { وَٱلصَّابِرِينَ } على الشدائد والمصائب { وَٱلصَّابِرَاتِ وَٱلْخَاشِعِينَ } في جميع أحوالهم، خصوصاً في عباداتهم، خصوصاً في صلواتهم، { وَٱلْخَاشِعَاتِ } { وَٱلْمُتَصَدِّقِينَ } فرضاً ونفلاً { وَٱلْمُتَصَدِّقَاتِ وٱلصَّائِمِينَ وٱلصَّائِمَاتِ } شمل ذلك الفرض والنفل. { وَٱلْحَافِظِينَ فُرُوجَهُمْ } عن الزنا ومقدماته { وَٱلْحَافِـظَاتِ } { وَٱلذَّاكِـرِينَ ٱللَّهَ [كَثِيراً } أي:] في أكثر الأوقات، خصوصاً أوقات الأوراد المقيدة، كالصباح والمساء، وأدبار الصلوات المكتوبات { وَٱلذَّاكِرَاتِ }. { أَعَدَّ ٱللَّهُ لَهُم } أي: لهؤلاء الموصوفين بتلك الصفات الجميلة، والمناقب الجليلة، التي هي ما بين اعتقادات، وأعمال قلوب، وأعمال جوارح، وأقوال لسان، ونفع متعد وقاصر، وما بين أفعال الخير، وترك الشر، الذي من قام بهن، فقد قام بالدين كله، ظاهره وباطنه، بالإسلام والإيمان والإحسان. فجازاهم على عملهم بالمغفرة لذنوبهم، لأن الحسنات يذهبن السيئات. { وَأَجْراً عَظِيماً } لا يقدر قدره، إلا الذي أعطاه، مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر، نسأل اللّه أن يجعلنا منهم.\n                                    "
      },
      "originalText": "إِنَّ ٱلۡمُسۡلِمِينَ وَٱلۡمُسۡلِمَٰتِ وَٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ وَٱلۡقَٰنِتِينَ وَٱلۡقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلۡخَٰشِعِينَ وَٱلۡخَٰشِعَٰتِ وَٱلۡمُتَصَدِّقِينَ وَٱلۡمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلۡحَٰفِظِينَ فُرُوجَهُمۡ وَٱلۡحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرٗا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمٗا ٥٣"
    }
  ]
}