{
  "number": 423,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 3569,
      "text": "وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ ۗ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُبِينًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 36,
      "juz": 22,
      "manzil": 5,
      "page": 423,
      "ruku": 365,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كَانَ لِمُؤۡمِنٖ وَلَا مُؤۡمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمۡرًا أَن يَكُونَ لَهُمُ ٱلۡخِيَرَةُ مِنۡ أَمۡرِهِمۡۗ وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ ضَلَّ ضَلَٰلٗا مُّبِينٗا ٦٣\n                                    \n                                    \n                                    قال العوفي عن ابن عباس رضي الله عنهما قوله تعالى { وَمَا كَانَ لِمُؤْمِنٍ وَلاَ مُؤْمِنَةٍ } الآية، وذلك أن رسول الله صلى الله عليه وسلم انطلق ليخطب على فتاه زيد بن حارثة رضي الله عنه، فدخل على زينب بنت جحش الأسدية رضي الله عنها، فخطبها، فقالت لست بناكحته، فقال رسول الله صلى الله عليه وسلم \" بلى فانكحيه \" قالت يارسول الله أؤامر في نفسي؟ فبينما هما يتحدثان، أنزل الله هذه الآية على رسول الله صلى الله عليه وسلم { وَمَا كَانَ لِمُؤْمِنٍ وَلاَ مُؤْمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُ أَمْراً } الآية، قالت قد رضيته لي يارسول الله منكحاً؟ قال رسول الله صلى الله عليه وسلم \" نعم \" قالت إِذاً لا أعصي رسول الله صلى الله عليه وسلم قد أنكحته نفسي. وقال ابن لهيعة عن ابن أبي عمرة عن عكرمة عن ابن عباس رضي الله عنهما قال خطب رسول الله صلى الله عليه وسلم زينب بنت جحش لزيد بن حارثة رضي الله عنه، فاستنكفت منه وقالت أنا خير منه حسباً، وكانت امرأة فيها حدة، فأنزل الله تعالى { وَمَا كَانَ لِمُؤْمِنٍ وَلاَ مُؤْمِنَةٍ } الآية كلها، وهكذا قال مجاهد وقتادة ومقاتل بن حيان إنها نزلت في زينب بنت جحش رضي الله عنها حين خطبها رسول الله صلى الله عليه وسلم على مولاه زيد بن حارثة رضي الله عنه، فامتنعت ثم أجابت. وقال عبد الرحمن ابن زيد بن أسلم نزلت في أم كلثوم بنت عقبة بن أبي معيط رضي الله عنها، وكانت أول من هاجر من النساء، يعني بعد صلح الحديبية، فوهبت نفسها للنبي صلى الله عليه وسلم فقال قد قبلت، فزوجها زيد ابن حارثة رضي الله عنه، بعد فراقه زينب، فسخطت هي وأخوها، وقالا إِنما أردنا رسول الله صلى الله عليه وسلم فزوجنا عبده، قال فنزل القرآن { وَمَا كَانَ لِمُؤْمِنٍ وَلاَ مُؤْمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُ أَمْراً } إِلى آخر الآية، قال وجاء أمر أجمع من هذا\n{ ٱلنَّبِيُّ أَوْلَىٰ بِٱلْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ }\nالأحزاب 6 قال فذاك خاص، وهذا أجمع. وقال الإمام أحمد حدثنا عبد الرزاق، أخبرنا معمر عن ثابت البناني عن أنس رضي الله عنه، قال خطب النبي صلى الله عليه وسلم على جليبيب امرأة من الأنصار إِلى أبيها، فقال حتى أستأمر أمها، فقال النبي صلى الله عليه وسلم \" فنعم إِذاً \" قال فانطلق الرجل إِلى امرأته، فذكر ذلك لها، قالت لاها الله إذن، ما وجد رسول الله صلى الله عليه وسلم إِلا جليبيباً، وقد منعناها من فلان وفلان؟ قال والجارية في سترها تسمع، قال فانطلق الرجل يريد أن يخبر رسول الله صلى الله عليه وسلم بذلك، فقالت الجارية أتريدون أن تردوا على رسول الله صلى الله عليه وسلم أمره، إِن كان قد رضيه لكم، فأنكحوه، قال فكأنها جلت عن أبويها، وقالا صدقت، فذهب أبوها إِلى رسول الله صلى الله عليه وسلم فقال إِن كنت رضيته، فقد رضيناه، قال صلى الله عليه وسلم\n                                   \" فإِني قد رضيته \" قال فزوجها، ثم فزع أهل المدينة، فركب جليبيب، فوجدوه قد قتل وحوله ناس من المشركين قد قتلهم، قال أنس رضي الله عنه فلقد رأيتها وإِنها لمن أنفق بيت بالمدينة. وقال الإمام أحمد حدثنا عفان، حدثنا حماد، يعني ابن سلمة، عن ثابت عن كنانة بن نعيم العدوي، عن أبي برزة الأسلمي قال إِن جليبيباً كان امرأ يدخل على النساء، يمر بهن ويلاعبهن، فقلت لامرأتي لا تدخلن اليوم عليكن جليبيباً، فإِنه إِن دخل عليكن، لأفعلن ولأفعلن، قالت وكانت الأنصار إِذا كان لأحدهم أيم، لم يزوجها حتى يعلم هل للنبي صلى الله عليه وسلم فيها حاجة أم لا، فقال النبي صلى الله عليه وسلم لرجل من الأنصار \" زوجني ابنتك \" قال نعم وكرامة يارسول الله ونعمة عين، فقال صلى الله عليه وسلم \" إِني لست أريدها لنفسي \" قال فلمن يارسول الله؟ قال صلى الله عليه وسلم \" لجليبيب \" فقال يارسول الله أشاور أمها، فأتى أمها، فقال رسول الله صلى الله عليه وسلم يخطب ابنتك؟ فقالت نعم ونعمة عين، فقال إِنه ليس يخطبها لنفسه، إِنما يخطبها لجليبيب، قالت أجليبيب إنيه؟ أجليبيب إنيه؟! لا لعمر الله لا نزوجه، فلما أراد أن يقوم ليأتي رسول الله صلى الله عليه وسلم فيخبره بما قالت أمها، قالت الجارية من خطبني إِليكم؟ فأخبرتها أمها، قالت أتردون على رسول الله صلى الله عليه وسلم أمره؟ ادفعوني إِليه، فإِنه لن يضيعني، فانطلق أبوها إِلى رسول الله صلى الله عليه وسلم فقال شأنك بها، فزوجها جليبيباً، قال فخرج رسول الله صلى الله عليه وسلم في غزوة له، فلما أفاء الله عليه، قال لأصحابه رضي الله عنهم \" هل تفقدون من أحد؟ \" قالوا نفقد فلاناً، ونفقد فلاناً، قال صلى الله عليه وسلم \" انظروا هل تفقدون من أحد \" قالوا لا. قال صلى الله عليه وسلم \" لكنني أفقد جليبيباً \" قال صلى الله عليه وسلم \" فاطلبوه في القتلى \" فطلبوه، فوجدوه إِلى جنب سبعة قد قتلهم، ثم قتلوه، فقالوا يارسول الله هاهوذا إِلى جنب سبعة قد قتلهم، ثم قتلوه، فأتاه رسول الله صلى الله عليه وسلم فقام عليه فقال \" قتل سبعة وقتلوه، هذا مني وأنا منه \"\n                                   مرتين أو ثلاثاً، ثم وضعه رسول الله صلى الله عليه وسلم على ساعديه، وحفر له، ما له سرير إِلا ساعد النبي صلى الله عليه وسلم ثم وضعه في قبره، ولم يذكر أنه غسله رضي الله عنه، قال ثابت رضي الله عنه فما كان في الأنصار أيم أنفق منها. وحديث إِسحاق بن عبد الله بن أبي طلحة ثابتاً هل تعلم ما دعا لها رسول الله صلى الله عليه وسلم فقال قال \" اللهم صب عليها الخير صباً، ولا تجعل عيشها كداً \" وكذا كان، فما كان في الأنصار أيم أنفق منها، هكذا أورده الإمام أحمد بطوله، وأخرج منه مسلم والنسائي في الفضائل قصة قتله. وذكر الحافظ أبو عمر بن عبد البر في \" الاستيعاب \" أن الجارية لما قالت في خدرها أتردون على رسول الله صلى الله عليه وسلم أمره؟ نزلت هذه الآية { وَمَا كَانَ لِمُؤْمِنٍ وَلاَ مُؤْمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُ أَمْراً أَن يَكُونَ لَهُمُ ٱلْخِيَرَةُ مِنْ أَمْرِهِمْ }. وقال ابن جريج أخبرني عامر بن مصعب عن طاوس قال إِنه سأل ابن عباس عن ركعتين بعد العصر، فنهاه، وقرأ ابن عباس رضي الله عنه { وَمَا كَانَ لِمُؤْمِنٍ وَلاَ مُؤْمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُ أَمْراً أَن يَكُونَ لَهُمُ ٱلْخِيَرَةُ مِنْ أَمْرِهِمْ } فهذه الآية عامة في جميع الأمور، وذلك أنه إِذا حكم الله ورسوله بشيء، فليس لأحد مخالفته، ولا اختيار لأحد هنا، ولا رأي ولا قول كما قال تبارك وتعالى\n{ فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لاَ يَجِدُواْ فِيۤ أَنفُسِهِمْ حَرَجاً مِّمَّا قَضَيْتَ وَيُسَلِّمُواْ تَسْلِيماً }\nالنساء 65 وفي الحديث \" والذي نفسي بيده لا يؤمن أحدكم حتى يكون هواه تبعاً لما جئت به \" ولهذا شدد في خلاف ذلك، فقال { وَمَن يَعْصِ ٱللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلاَلاً مُّبِيناًَ } كقوله تعالى\n{ فَلْيَحْذَرِ ٱلَّذِينَ يُخَـٰلِفُونَ عَنْ أَمْرِهِ أَن تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌ }\nالنور 63.\n                                    ",
        "qortoby": "وَمَا كَانَ لِمُؤۡمِنٖ وَلَا مُؤۡمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمۡرًا أَن يَكُونَ لَهُمُ ٱلۡخِيَرَةُ مِنۡ أَمۡرِهِمۡۗ وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ ضَلَّ ضَلَٰلٗا مُّبِينٗا ٦٣\n                                    \n                                    \n                                    فيه أربع مسائل:\n\nالأولى: روى قتادة وابن عباس ومجاهد في سبب نزول هذه الآية: أن رسول الله صلى الله عليه وسلم خطب زينب بنت جحش، وكانت بنت عمته، فظنّت أن الخطبة لنفسه، فلما تبيّن أنه يريدها لزيد، كرهت وأبت وامتنعت؛ فنزلت الآية. فأذعنت زينب حينئذٍ وتزوّجته. في رواية: فامتنعت وامتنع أخوها عبد الله لنسبها من قريش، وأن زيداً كان بالأمس عبداً، إلى أن نزلت هذه الآية، فقال له أخوها: مُرْني بما شئت، فزوّجها من زيد. وقيل: إنها نزلت في أمّ كلثوم بنت عقبة بن أبي مُعَيط، وكانت وهبت نفسها للنبي صلى الله عليه وسلم، فزوّجها من زيد بن حارثة؛ فكرهت ذلك هي وأخوها وقالا: إنما أردنا رسول الله صلى الله عليه وسلم فزوّجَنا غيره؛ فنزلت الآية بسبب ذلك، فأجابا إلى تزويج زيد؛ قاله ابن زيد. وقال الحسن: ليس لمؤمن ولا مؤمنة إذا أمر الله عز وجل ورسوله صلى الله عليه وسلم بأمر أن يعصياه.\n\nالثانية: لفظ «ما كان، وما ينبغي» ونحوهما، معناها الحظر والمنع. فتجيء لحظر الشيء والحكم بأنه لا يكون؛ كما في هذه الآية. وربما كان امتناع ذلك الشيء عقلاً كقوله تعالى:\n{ مَّا كَانَ لَكُمْ أَن تُنبِتُواْ شَجَرَهَا }\n[النمل: 60]. وربما كان العلم بامتناعه شرعاً كقوله تعالى:\n{ مَا كَانَ لِبَشَرٍ أَن يُؤْتِيهُ ٱللَّهُ ٱلْكِتَابَ وَٱلْحُكْمَ وَٱلنُّبُوَّةَ }\n[آل عمران : 79]، وقوله تعالى :\n{ وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ ٱللَّهُ إِلاَّ وَحْياً أَوْ مِن وَرَآءِ حِجَابٍ }\n[الشورى: 51]. وربما كان في المندوبات؛ كما تقول: ما كان لك يا فلان أن تترك النوافل، ونحو هذا.\n\nالثالثة: في هذه الآية دليل بل نص في أن الكفاءة لا تعتبر في الأحساب وإنما تعتبر في الأديان؛ خلافاً لمالك والشافعيّ والمغيرة وسُحْنون. وذلك أن الموالي تزوّجت في قريش؛ تزوّج زيد زينب بنت جحش. وتزوّج المِقداد بن الأسود ضباعة بنت الزبير. وزوّج أبو حذيفة سالماً من فاطمة بنت الوليد بن عُتبة. وتزوّج بلال أخت عبد الرحمن بن عوف. وقد تقدّم هذا المعنى في غير موضع.\n\nالرابعة: قوله تعالى: { أَن يَكُونَ لَهُمُ ٱلْخِيَرَةُ مِنْ أَمْرِهِمْ } قرأ الكوفيون: «أَنْ يَكُونَ» بالياء. وهو اختيار أبي عبيد؛ لأنه قد فرق بين المؤنث وبين فعله. الباقون بالتاء؛ لأن اللفظ مؤنث (فتأنيث) فعله حسن. والتذكير على أن الخِيرة بمعنى التخيير؛ فالخِيرة مصدر بمعنى الاختيار. وقرأ ابن السَّمَيْقعَ «الخِيْرة» بإسكان الياء. وهذه الآية في ضمن قوله تعالى:\n{ ٱلنَّبِيُّ أَوْلَىٰ بِٱلْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ }\n[الأحزاب: 6]. ثم توعد تعالى وأخبر أن من يعص الله ورسوله فقد ضل. وهذا أدل دليل على ما ذهب إليه الجمهور من فقهائنا، وفقهاء أصحاب الإمام الشافعي وبعض الأصوليين، من أن صيغة «أفعل» للوجوب في أصل وضعها؛ لأن الله تبارك وتعالى نفى خيرة المكلّف عند سماع أمره وأمر رسوله صلى الله عليه وسلم، ثم أطلق على من بقيت له خيرة عند صدور الأمر اسم المعصية، ثم علّق على المعصية بذلك الضلالَ، فلزم حمل الأمر على الوجوب. والله أعلم.\n\n                                    ",
        "saadi": "وَمَا كَانَ لِمُؤۡمِنٖ وَلَا مُؤۡمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمۡرًا أَن يَكُونَ لَهُمُ ٱلۡخِيَرَةُ مِنۡ أَمۡرِهِمۡۗ وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ ضَلَّ ضَلَٰلٗا مُّبِينٗا ٦٣\n                                        \n                                        \n                                        \n                                        أي: لا ينبغي ولا يليق ممن اتصف بالإيمان، إلاّ الإسراع في مرضاة اللّه ورسوله، والهرب من سخط اللّه ورسوله، وامتثال أمرهما، واجتناب نهيهما، فلا يليق بمؤمن ولا مؤمنة { إِذَا قَضَى ٱللَّهُ وَرَسُولُهُ أَمْراً } من الأمور، وحتَّما به وألزما به { أَن يَكُونَ لَهُمُ ٱلْخِيَرَةُ مِنْ أَمْرِهِمْ } أي: الخيار، هل يفعلونه أم لا؟ بل يعلم المؤمن والمؤمنة، أن الرسول أولى به من نفسه، فلا يجعل بعض أهواء نفسه حجاباً بينه وبين أمر اللّه ورسوله. { وَمَن يَعْصِ ٱللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلاَلاً مُّبِيناً } أي: بَيِّناً، لأنه ترك الصراط المستقيم الموصلة إلى كرامة اللّه، إلى غيرها من الطرق الموصلة للعذاب الأليم، فذكر أولاً السبب الموجب لعدم معارضته أمر اللّه ورسوله، وهو الإيمان، ثم ذكر المانع من ذلك، وهو التخويف بالضلال، الدال على العقوبة والنكال.\n                                    "
      },
      "originalText": "وَمَا كَانَ لِمُؤۡمِنٖ وَلَا مُؤۡمِنَةٍ إِذَا قَضَى ٱللَّهُ وَرَسُولُهُۥٓ أَمۡرًا أَن يَكُونَ لَهُمُ ٱلۡخِيَرَةُ مِنۡ أَمۡرِهِمۡۗ وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ فَقَدۡ ضَلَّ ضَلَٰلٗا مُّبِينٗا ٦٣"
    },
    {
      "number": 3570,
      "text": "وَإِذْ تَقُولُ لِلَّذِي أَنْعَمَ اللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَاتَّقِ اللَّهَ وَتُخْفِي فِي نَفْسِكَ مَا اللَّهُ مُبْدِيهِ وَتَخْشَى النَّاسَ وَاللَّهُ أَحَقُّ أَنْ تَخْشَاهُ ۖ فَلَمَّا قَضَىٰ زَيْدٌ مِنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا ۚ وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 37,
      "juz": 22,
      "manzil": 5,
      "page": 423,
      "ruku": 365,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا ٧٣\n                                    \n                                    \n                                    يقول تعالى مخبراً عن نبيه صلى الله عليه وسلم أنه قال لمولاه زيد بن حارثة رضي الله عنه، وهو الذي أنعم الله عليه، أي بالإسلام ومتابعة الرسول صلى الله عليه وسلم { وَأَنْعَمْتَ عَلَيْهِ } أي بالعتق من الرق، وكان سيداً كبير الشأن، جليل القدر، حبيباً إِلى النبي صلى الله عليه وسلم يقال له الحب، ويقال لابنه أسامة الحب بن الحب، قالت عائشة رضي الله عنها ما بعثه رسول الله صلى الله عليه وسلم في سرية إِلا أمره عليهم، ولو عاش بعده لاستخلفه، رواه الإمام أحمد عن سعيد بن محمد الوراق ومحمد ابن عبيد عن وائل بن داود عن عبد الله البهي عنها. وقال البزار حدثنا خالد بن يوسف، حدثنا أبو عوانة، \" ح \" وحدثنا محمد بن معمر، حدثنا أبو داود، حدثنا أبو عوانة، أخبرني عمر بن أبي سلمة عن أبيه قال حدثني أسامة بن زيد رضي الله عنهما قال كنت في المسجد، فأتاني العباس وعلي بن أبي طالب رضي الله عنهما، فقالا ياأسامة استأذن لنا على رسول الله صلى الله عليه وسلم قال فأتيت رسول الله صلى الله عليه وسلم فأخبرته فقلت علي والعباس يستأذنان، فقال صلى الله عليه وسلم \" أتدري ما حاجتهما؟ \" قلت لا يا رسول الله قال صلى الله عليه وسلم \" لكني أدري \" قال فأذن لهما، قالا يارسول الله جئناك لتخبرنا أي أهلك أحب إِليك؟ قال صلى الله عليه وسلم \" أحب أهلي إِلي فاطمة بنت محمد \" قالا يا رسول الله ما نسألك عن فاطمة، قال صلى الله عليه وسلم \" فأسامة بن زيد بن حارثة الذي أنعم الله عليه، وأنعمت عليه \" وكان رسول الله صلى الله عليه وسلم قد زوجه بابنة عمته زينب بنت جحش الأسدية رضي الله عنها، وأمها أميمة بنت عبد المطلب، وأصدقها عشرة دنانير وستين درهماً، وخماراً وملحفة ودرعاً، وخمسين مداً من طعام، وعشرة أمداد من تمر، قاله مقاتل بن حيان، فمكثتُ عنده قريباً من سنة أو فوقها، ثم وقع بينهما، فجاء زيد يشكوها إِلى رسول الله صلى الله عليه وسلم فجعل رسول الله صلى الله عليه وسلم يقول له \" أمسك عليك زوجك، واتق الله \" قال الله تعالى { وَتُخْفِي فِي نِفْسِكَ مَا ٱللَّهُ مُبْدِيهِ وَتَخْشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخْشَاهُ } ذكر ابن أبي حاتم وابن جرير ههنا آثاراً عن بعض السلف رضي الله عنهم، أحببنا أن نضرب عنها صفحاً لعدم صحتها، فلا نوردها. وقد روى الإمام أحمد ههنا أيضاً حديثاً من رواية حماد بن زيد عن ثابت، عن أنس رضي الله عنه فيه غرابة تركنا سياقه أيضاً.\n                                    وقد روى البخاري أيضاً بعضه مختصراً فقال حدثنا محمد بن عبد الرحيم، حدثنا معلى بن منصور عن حماد بن زيد، حدثنا ثابت عن أنس بن مالك رضي الله عنه قال إِن هذه الآية { وَتُخْفِي فِي نِفْسِكَ مَا ٱللَّهُ مُبْدِيهِ } نزلت في زيد، حدثنا ثابت عن أنس بن مالك رضي الله عنه قال إن هذه الآية { وَٱتَّقِ ٱللَّهَ وَتُخْفِى فِى نِفْسِكَ مَا } نزلت في شأن زينب بنت حجش وزيد بن حارثة رضي الله عنهما. قال ابن أبي حاتم حدثنا أبي، حدثنا علي بن هاشم بن مرزوق، حدثنا ابن عيينة عن علي بن زيد بن جدعان قال سألني علي بن الحسين رضي الله عنهما ما يقول الحسن في قوله تعالى { وَتُخْفِي فِي نِفْسِكَ مَا ٱللَّهُ مُبْدِيهِ } فذكرت له، فقال لا، ولكن الله تعالى أعلم نبيه أنها ستكون من أزواجه قبل أن يتزوجها، فلما أتاه زيد رضي الله عنه ليشكوها إِليه، قال \" اتق الله وأمسك عليك زوجك \" فقال قد أخبرتك أني مزوجكها، وتخفي في نفسك ما الله مبديه. وهكذا روي عن السدي أنه قال نحو ذلك. وقال ابن جرير حدثنا إِسحاق بن شاهين، حدثني خالد عن داود عن عامر عن عائشة رضي الله عنها أنها قالت لو كتم محمد صلى الله عليه وسلم شيئاً مما أوحي إِليه من كتاب الله تعالى، لكتم { وَتُخْفِي فِي نِفْسِكَ مَا ٱللَّهُ مُبْدِيهِ وَتَخْشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخْشَاهُ } وقوله تعالى { فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَراً زَوَّجْنَاكَهَا } الوطر هو الحاجة والأرب، أي لما فرغ منها وفارقها، زوجناكها، وكان الذي ولي تزويجها منه هو الله عز وجل، بمعنى أنه أوحى إِليه أن يدخل عليها بلا ولي ولا عقد ولامهر ولا شهود من البشر. قال الإمام أحمد حدثنا هاشم، يعني ابن القاسم، أبو النضر، حدثنا سليمان بن المغيرة عن ثابت عن أنس رضي الله عنه قال لما انقضت عدة زينب رضي الله عنها، قال رسول الله صلى الله عليه وسلم لزيد بن حارثة \" اذهب فاذكرها علي \" فانطلق حتى أتاها، وهي تخمر عجينها، قال فلما رأيتها، عظمت في صدري، حتى ما أستطيع أن أنظر إِليها وأقول إِن رسول الله صلى الله عليه وسلم ذكرها، فوليتها ظهري، ونكصت على عقبي، وقلت يازينب أبشري، أرسلني رسول الله صلى الله عليه وسلم يذكرك، قالت ما أنا بصانعة شيئاً حتى أؤامر ربي عز وجل، فقامت إِلى مسجدها، ونزل القرآن، وجاء رسول الله صلى الله عليه وسلم فدخل عليها بغير إِذن، ولقد رأيتنا حين دخلت على رسول الله صلى الله عليه وسلم وأطعمنا عليها الخبز واللحم، فخرج الناس، وبقي رجال يتحدثون في البيت بعد الطعام، فخرج رسول الله صلى الله عليه وسلم واتبعته، فجعل صلى الله عليه وسلم يتتبع حجر نسائه يسلم عليهن، ويقلن يارسول الله كيف وجدت أهلك؟ فما أدري أنا أخبرته أن القوم قد خرجوا، أو أخبر، فانطلق حتى دخل البيت، فذهبت أدخل معه، فألقى الستر بيني وبينه، ونزل الحجاب، ووعظ القوم بما وعظوا به\n                                    { لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ }\nالأحزاب 53 الآية كلها، ورواه مسلم والنسائي من طرق عن سليمان بن المغيرة به. وقد روى البخاري رحمه الله عن أنس بن مالك رضي الله عنه قال إِن زينب بنت جحش رضي الله عنها كانت تفخر على أزواج النبي، فتقول زوجكن أهاليكن، وزوجني الله تعالى من فوق سبع سمٰوات، وقد قدمنا في سورة النور عن محمد بن عبد الله بن جحش قال تفاخرت زينب وعائشة رضي الله عنهما، فقالت زينب رضي الله عنها أنا الذي نزل تزويجي من السماء، وقالت عائشة رضي الله عنها أنا التي نزل عذري من السماء، فاعترفت لها زينب رضي الله عنها. وقال ابن جرير حدثنا ابن حميد، حدثنا جرير عن المغيرة عن الشعبي قال كانت زينب رضي الله عنها تقول للنبي صلى الله عليه وسلم إِني لأدل عليك بثلاث، وما من نسائك امرأة تدل بهن إِن جدي وجدك واحد، وإِني أنكحنيك الله عز وجل من السماء، وإِن السفير جبريل عليه الصلاة والسلام. وقوله تعالى { لِكَيْ لاَ يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ فِيۤ أَزْوَاجِ أَدْعِيَآئِهِمْ إِذَا قَضَوْاْ مِنْهُنَّ وَطَراً } أي إِنما أبحنا لك تزويجها، وفعلنا ذلك لئلا يبقى حرج على المؤمنين في تزويج مطلقات الأدعياء، وذلك أن رسول الله صلى الله عليه وسلم كان قبل النبوة قد تبنى زيد بن حارثة رضي الله عنه، فكان يقال له زيد بن محمد، فلما قطع الله تعالى هذه النسبة بقوله تعالى { وَمَا جَعَلَ أَدْعِيَآءَكُمْ أَبْنَآءَكُمَْ } ــــ إِلى قوله تعالى ــــ { ٱدْعُوهُمْ لآبَآئِهِمْ هُوَ أَقْسَطُ عِندَ ٱللَّهِ } ثم زاد ذلك بياناً وتأكيداً بوقوع تزويج رسول الله صلى الله عليه وسلم بزينب بنت جحش رضي الله عنها، لما طلقها زيد بن حارثة رضي الله عنه، ولهذا قال تعالى في آية التحريم\n{ وَحَلاَئِلُ أَبْنَائِكُمُ ٱلَّذِينَ مِنْ أَصْلاَبِكُمْ }\nالنساء 23 ليحترز من الابن الدعي، فإِن ذلك كان كثيراً فيهم. وقوله تعالى { وَكَانَ أَمْرُ ٱللَّهِ مَفْعُولاً } أي وكان هذا الأمر الذي وقع قد قدره الله تعالى وحتمه، وهو كائن لامحالة، كانت زينب رضي الله عنها في علم الله ستصير من أزواج النبي صلى الله عليه وسلم.\n                                    ",
        "qortoby": "وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا ٧٣\n                                    \n                                    \n                                    فيه تسع مسائل :\n\nالأولى : روى الترمذيّ قال: حدّثنا عليّ بن حجر قال: حدثنا داود بن الزِّبْرقان عن داود بن أبي هند عن الشعبيّ عن عائشة رضي الله تعالى عنها قالت: لو كان رسول الله صلى الله عليه وسلم كاتماً شيئاً من الوحي لكتم هذه الآية: { وَإِذْ تَقُولُ لِلَّذِيۤ أَنعَمَ ٱللَّهُ عَلَيْهِ } يعني بالإسلام { وَأَنْعَمْتَ عَلَيْهِ } بالعتق فأعتقته. { أَمْسِكْ عَلَيْكَ زَوْجَكَ وَٱتَّقِ ٱللَّهَ وَتُخْفِي فِي نِفْسِكَ مَا ٱللَّهُ مُبْدِيهِ وَتَخْشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخْشَاهُ ـ إلى قوله ـ وَكَانَ أَمْرُ ٱللَّهِ مَفْعُولاً } وأن رسول الله صلى الله عليه وسلم لما تزوّجها قالوا: تزوّج حلِيلة ابنه، فأنزل الله تعالى: { مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ وَلَـٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّينَ }. وكان رسول الله صلى الله عليه وسلم تبنَّاه وهو صغير، فلبث حتى صار رجلاً يقال له زيد بن محمد، فأنزل الله تبارك وتعالى { ٱدْعُوهُمْ لآبَآئِهِمْ هُوَ أَقْسَطُ عِندَ ٱللَّهِ فَإِن لَّمْ تَعْلَمُوۤاْ آبَاءَهُمْ فَإِخوَانُكُمْ فِي ٱلدِّينِ وَمَوَالِيكُمْ } فلان مولى فلان، وفلان أخو فلان، هو أقسط عند الله يعني أعدل. قال أبو عيسى: هذا حديث غريب قد روي عن داود بن أبي هند عن الشعبي عن مسروق عن عائشة رضي الله عنها. قالت: لو كان النبيّ صلى الله عليه وسلم كاتماً شيئاً من الوحي لكتم هذه الآية: { وَإِذْ تَقُولُ لِلَّذِيۤ أَنعَمَ ٱللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ } هذا الحرف لم يُرْوَ بطوله.\n\nقلت: هذا القدر الذي أخرجه مسلم في صحيحه، وهو الذي صححه الترمذي في جامعه. وفي البخاريّ عن أنس بن مالك: أن هذه الآية: { وَتُخْفِي فِي نِفْسِكَ مَا ٱللَّهُ مُبْدِيهِ } نزلت في شأن زينب بنت جحش وزيد بن حارثة وقال عمر وابن مسعود وعائشة والحسن: ما أنزل الله على رسوله آية أشدّ عليه من هذه الآية. وقال الحسن وعائشة: لو كان رسول الله صلى الله عليه وسلم كاتماً شيئاً من الوحي لكتم هذه الآية لشدّتها عليه. وروي في الخبر أنه: أمسى زيد فأوى إلى فراشه، قالت زينب: ولم يستطعني زيد، وما أمتنع منه غير ما منعه الله مني، فلا يقدر عليّ. هذه رواية أبي عِصْمة نوح بن أبي مريم، رفع الحديث إلى زينب أنها قالت ذلك. وفي بعض الروايات: \" أن زيداً تورّم ذلك منه حين أراد أن يقربها؛ فهذا قريب من ذلك. وجاء زيد إلى رسول الله صلى الله عليه وسلم فقال: إن زينب تؤذيني بلسانها وتفعل وتفعل! وإني أريد أن أطلقها، فقال له: { أَمْسِكْ عَلَيْكَ زَوْجَكَ وَٱتَّقِ ٱللَّهَ } الآية. فطلّقها زيد فنزلت: { وَإِذْ تَقُولُ لِلَّذِيۤ أَنعَمَ ٱللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ } الآية \".\n                                   واختلف الناس في تأويل هذه الآية، فذهب قتادة وابن زيد وجماعة من المفسرين، منهم الطبري وغيره ـ إلى \" أن النبيّ صلى الله عليه وسلم وقع منه استحسان لزينب بنت جحش، وهي في عِصْمة زيد، وكان حريصاً على أن يطلّقها زيد فيتزوّجها هو؛ ثم إن زيداً لما أخبره بأنه يريد فراقها، ويشكو منها غِلظةَ قولٍ وعصيان أمرٍ، وأذًى باللسان وتعظُّماً بالشرف، قال له: «اتق الله ـ أي فيما تقول عنها ـ وأمسك عليك زوجك» \" وهو يخفي الحرص على طلاق زيد إيّاها. وهذا الذي كان يخفي في نفسه، ولكنه لزم ما يجب من الأمر بالمعروف. وقال مقاتل: \" زوّج النبيّ صلى الله عليه وسلم زينب بنت جحش من زيد فمكثت عنده حيناً، ثم إنه عليه السلام أتى زيداً يوماً يطلبه، فأبصر زينب قائمة، كانت بيضاء جميلة جسيمة من أتمّ نساء قريش، فهوِيَها وقال: «سبحان الله مقلّبِ القلوب»! فسمعت زينب بالتسبيحة فذكرتها لزيد، ففطِن زيد فقال: يا رسول الله، ائذن لي في طلاقها، فإن فيها كبراً، تعظُم عليّ وتؤذيني بلسانها، فقال عليه السلام: «أمسك عليك زوجك واتقِ الله». وقيل: إن الله بعث ريحاً فرفعت الستر وزينب مُتَفَضِّلة في منزلها، فرأى زينب فوقعت في نفسه، ووقع في نفس زينب أنها وقعت في نفس النبي صلى الله عليه وسلم، وذلك لما جاء يطلب زيداً، فجاء زيد فأخبرته بذلك، فوقع في نفس زيد أن يطلقها \" وقال ابن عباس: { وَتُخْفِي فِي نِفْسِكَ } الحبَّ لها. { وَتَخْشَى ٱلنَّاسَ } أي تستحييهم. وقيل: تخاف وتكره لائمة المسلمين لو قلتَ طلِّقها، ويقولون أمر رجلاً بطلاق امرأته ثم نكحها حين طلقها. { وَٱللَّهُ أَحَقُّ أَن تَخْشَاهُ } في كل الأحوال. وقيل: والله أحق أن تستحيي منه، ولا تأمر زيداً بإمساك زوجته بعد أن أعلمك الله أنها ستكون زوجتك، فعاتبه الله على جميع هذا. وروي عن عليّ بن الحسين: \" أن النبيّ صلى الله عليه وسلم كان قد أوحى الله تعالى إليه أن زيداً يطلق زينب، وأنه يتزوّجها بتزويج الله إياها، فلما تشكّى زيد للنبيّ صلى الله عليه وسلم خُلُقَ زينب، وأنها لا تطيعه، وأعلمه أنه يريد طلاقها، قال له رسول الله صلى الله عليه وسلم على جهة الأدب والوصية: «اتق الله في قولك وأمسك عليك زوجك» \" وهو يعلم أنه سيفارقها ويتزوّجها، وهذا هو الذي أخفى في نفسه، ولم يرد أن يأمره بالطلاق لِما علم أنه سيتزوّجها؛ وخشي رسول الله صلى الله عليه وسلم أن يلحقه قول من الناس في أن يتزوّج زينب بعد زيد، وهو مولاه، وقد أمره بطلاقها، فعاتبه الله تعالى على هذا القدر من أن خشِي الناس في شيء قد أباحه الله له؛ بأن قال: \" أَمْسِكْ \" مع علمه بأنه يطلّق.\n                                   وأعلمه أن الله أحق بالخشية، أي في كل حال. قال علماؤنا رحمة الله عليهم: وهذا القول أحسن ما قيل في تأويل هذه الآية، وهو الذي عليه أهل التحقيق من المفسرين والعلماء الراسخين؛ كالزهريّ والقاضي بكر بن العلاء القشيريّ، والقاضي أبي بكر بن العربيّ وغيرهم. والمراد بقوله تعالى: { وَتَخْشَى ٱلنَّاسَ } إنما هو إرجاف المنافقين بأنه نَهَى عن تزويج نساء الأبناء وتزوج بزوجة ابنه. فأما ما روي أن النبيّ صلى الله عليه وسلم هَوِي زينب امرأة زيد ـ وربما أطلق بعض المُجّان لفظ عَشِق ـ فهذا إنما يصدر عن جاهل بعصمة النبيّ صلى الله عليه وسلم عن مثل هذا، أو مستخِفّ بحرمته. قال الترمذيّ الحكيم في نوادر الأصول، وأسند إلى عليّ ابن الحسين قولَه: فعليّ بن الحسين جاء بهذا من خزانة العلم جوهراً من الجواهر، ودُرًّا من الدّرَر، أنه إنما عَتَبَ الله عليه في أنه قد أعلمه أن ستكون هذه من أزواجك، فكيف قال بعد ذلك لزيد: \" أمسك عليك زوجك \" وأخذتك خشية الناس أن يقولوا: تزوّج امرأة ابنه؛ والله أحق أن تخشاه. وقال النحاس: قال بعض العلماء: ليس هذا من النبيّ صلى الله عليه وسلم خطيئة؛ ألا ترى أنه لم يؤمر بالتوبة ولا بالاستغفار منه. وقد يكون الشيء ليس بخطيئة إلا أن غيره أحسن منه، وأخفى ذلك في نفسه خشية أن يفتتن الناس.\n\nالثانية : قال ابن العربيّ: فإن قيل لأيّ معنى قال له: \" أمسِك عليك زوجك \" وقد أخبره الله أنها زوجه. قلنا: أراد أن يختبر منه ما لم يعلمه الله من رغبته فيها أو رغبته عنها؛ فأبدى له زيد من النُّفرة عنها والكراهة فيها ما لم يكن علمه منه في أمرها. فإن قيل: كيف يأمره بالتمسك بها وقد علم أن الفراق لا بدّ منه؟ وهذا تناقض. قلنا: بل هو صحيح للمقاصد الصحيحة؛ لإقامة الحجة ومعرفة العاقبة؛ ألا ترى أن الله تعالى يأمر العبد بالإيمان وقد علم أنه لا يؤمن، فليس في مخالفة متعلَّق الأمر لمتعلّق العلم ما يمنع من الأمر به عقلاً وحكماً. وهذا من نفيس العلم فتيقنوه وتقبلوه وقوله: \" وَاتَّقِ اللَّهَ \" أي في طلاقها، فلا تطلّقها. وأراد نهي تنزيه لا نهي تحريم، لأن الأولى ألا يطلق. وقيل: \" اتَّقِ اللَّهَ \" فلا تذمّها بالنسبة إلى الكِبْر وأذى الزوج. { وَتُخْفِي فِي نِفْسِكَ } قيل تعلّق قلبه. وقيل: مفارقة زيد إياها. وقيل: علمه بأن زيداً سيطلقها؛ لأن الله قد أعلمه بذلك.\n\nالثالثة : روي \" عن النبيّ صلى الله عليه وسلم أنه قال لزيد: «ما أجد في نفسي أوثق منك فاخطب زينب عليّ» قال: فذهبت وولّيتها ظهري توقيراً للنبيّ صلى الله عليه وسلم، وخطبتها ففرحت وقالت: ما أنا بصانعة شيئاً حتى أوامِرَ ربيّ، فقامت إلى مسجدها ونزل القرآن، فتزوّجها النبيّ صلى الله عليه وسلم ودخل بها \".\n                                   قلت: معنى هذا الحديث ثابت في الصحيح. وترجم له النسائي (صلاة المرأة إذا خُطبت واستخارتها ربّها) روى الأئمة ـ واللفظ لمسلم ـ عن أنس قال: \" لما انقضت عدة زينب قال رسول الله صلى الله عليه وسلم لزيد: «فاذكرها عليّ» قال: فانطلق زيد حتى أتاها وهي تُخَمّر عجينها. قال: فلما رأيتها عَظُمت في صدري، حتى ما أستطيع أن أنظر إليها، أنّ رسول الله صلى الله عليه وسلم ذكرها فولّيتها ظهري، ونَكَصْتُ على عقبي، فقلت: يا زينب، أرسل رسول الله صلى الله عليه وسلم يذكرك؛ قالت: ما أنا بصانعة شيئاً حتى أوامِر ربّي؛ فقامت إلى مسجدها ونزل القرآن. وجاء رسول الله صلى الله عليه وسلم فدخل عليها بغير إذن. قال: فقال ولقد رأيتُنا أن رسول الله صلى الله عليه وسلم أطعمنا الخبز واللحم حين امتدّ النهار... \" الحديث. في رواية «حتى تركوه». وفي رواية \" عن أنس أيضاً قال: ما رأيت رسول الله صلى الله عليه وسلم أَوْلَم على امرأة من نسائه ما أوْلَمَ على زينب؛ فإنه ذبح شاة \" قال علماؤنا: فقوله عليه السلام لزيد: \" فاذكرها عليّ \" أي اخطبها؛ كما بيَّنه الحديث الأول. وهذا امتحان لزيد واختبار له، حتى يظهر صبره وانقياده وطوعه.\n\nقلت: وقد يستنبط من هذا أن يقول الإنسان لصاحبه: اخطب عليّ فلانة، لزوجه المطلقة منه، ولا حرج في ذلك. والله أعلم.\n\nالرابعة : لمّا وكَلَت أمرها إلى الله وصحّ تفويضها إليه تولّى الله إنكاحها؛ ولذلك قال: { فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَراً زَوَّجْنَاكَهَا }. وروى الإمام جعفر بن محمد عن آبائه عن النبي صلى الله عليه وسلم \" وَطَراً زَوَّجْتُكَها \" ولما أعلمه الله بذلك دخل عليها بغير إذن، ولا تجديد عقد ولا تقرير صداق، ولا شيء مما يكون شرطاً في حقوقنا ومشروعاً لنا. وهذا من خصوصياته صلى الله عليه وسلم، التي لا يشاركه فيها أحد بإجماع من المسلمين. ولهذا كانت زينب تفاخر نساء النبي صلى الله عليه وسلم وتقول: زوجكنّ آباؤكنّ وزوّجني الله تعالى. أخرجه النسائي عن أنس بن مالك قال: كانت زينب تَفْخَر على نساء النبي صلى الله عليه وسلم تقول: إن الله عز وجل أنكحني من السماء. وفيها نزلت آية الحجاب؛ وسيأتي.\n\nالخامسة : المُنْعَم عليه في هذه الآية هو زيد بن حارثة، كما بيناه؛ وقد تقدّم خبره في أوّل السورة. \" وروي أن عمّه لقيَه يوماً وكان قد ورد مكة في شغل له، فقال: ما اسمك يا غلام؟ قال: زيد؛ قال: ابن من؟ قال: ابن حارثة. قال ابن من؟ قال: ابن شراحيل الكلبي. قال: فما اسم أمّك؟ قال: سُعْدَى، وكنت في أخوالي طيّ؛ فضمّه إلى صدره. وأرسل إلى أخيه وقومه فحضروا، وأرادوا منه أن يقيم معهم؛ فقالوا: لمن أنت؟ قال: لمحمد بن عبد الله؛ فأتَوْه وقالوا: هذا ابننا فردّه علينا. فقال: «أعْرِضُ عليه فإن اختاركم فخذوا بيده» فبعث إلى زيد وقال: «هل تعرف هؤلاء؟» قال: نعم! هذا أبي، وهذا أخي، وهذا عمي. فقال له النبي صلى الله عليه وسلم: «فأيّ صاحب كنتُ لك؟» فبكى وقال: لِمَ سألتني عن ذلك؟ قال: «أخيّرك فإن أحببت أن تلحق بهم فالحق وإن أردت أن تقيم فأنَا من قد عرفتَ» فقال: ما أختار عليك أحداً. فجذَبه عمّه وقال: يا زيد، اخترت العبوديّة على أبيك وعمك! فقال: أيْ واللَّهِ العبودية عند محمد أحبّ إليّ من أن أكون عندكم. فقال رسول الله صلى الله عليه وسلم: «اشهدوا أني وارث وموروث» \"\n                                   فلم يزل يقال: زيد بن محمد إلى أن نزل قوله تعالى: { ٱدْعُوهُمْ لآبَآئِهِمْ } ونزل { مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ }.\n\nالسادسة : قال الإمام أبو القاسم عبد الرحمن السُّهَيْلي رضي الله عنه: كان يقال زيد بن محمد حتى نزل: { ٱدْعُوهُمْ لآبَآئِهِمْ } فقال: أنا زيد بن حارثة. وحرم عليه أن يقول: أنا زيد بن محمد. فلما نُزِع عنه هذا الشرف وهذا الفخر، وعلِم الله وحشته من ذلك شّرفه بخِصِّيصة لم يكن يَخُصّ بها أحداً من أصحاب النبي صلى الله عليه وسلم، وهي أنه سماه في القرآن؛ فقال تعالى: { فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَراً } يعني من زينب. ومَن ذكره الله تعالى باسمه في الذكر الحكيم حتى صار اسمه قرآناً يُتْلَى في المحاريب، نوّه به غاية التنويه؛ فكان في هذا تأنيس له وعِوض من الفخر بأبوّة محمد صلى الله عليه وسلم له. ألا ترى إلى قول أُبَيّ بن كعب حين قال له النبي صلى الله عليه وسلم: \" إن الله أمرني أن أقرأ عليك سورة كذا \" فبكى وقال: أوَذُكِرتُ هنالك؟ وكان بكاؤه من الفرح حين أخبر أن الله تعالى ذكره؛ فكيف بمن صار اسمه قرآناً يُتلى مخلَّداً لا يبيد، يتلوه أهل الدنيا إذا قرؤوا القرآن، وأهل الجنة كذلك أبداً، لا يزال على ألسنة المؤمنين، كما لم يزل مذكوراً على الخصوص عند رب العالمين؛ إذ القرآن كلام الله القديم، وهو باق لا يبيد؛ فاسم زَيْد هذا في الصحف المكرّمة المرفوعة المطهرة، تذكره في التلاوة السّفَرةُ الكرام البَرَرَة. وليس ذلك لاسم من أسماء المؤمنين إلا لنبيّ من الأنبياء، ولزيد بن حارثة تعويضاً من الله تعالى له مما نُزع عنه. وزاد في الآية أن قال: { وَإِذْ تَقُولُ لِلَّذِيۤ أَنعَمَ ٱللَّهُ عَلَيْهِ } أي بالإيمان؛ فدلّ على أنه من أهل الجنة، علِم ذلك قبل أن يموت، وهذه فضيلة أخرى.\n                                   السابعة : قوله تعالى: { وَطَراً } الوَطَر كل حاجة للمرء له فيها همّة؛ والجمع الأوطار. قال ابن عباس: أي بلغ ما أراد من حاجته؛ يعني الجماع. وفيه إضمار؛ أي لما قضى وطره منها وطلّقها «زَوّجْناكَها» وقراءة أهل البيت «زوّجْتُكها». وقيل: الوطر عبارة عن الطلاق؛ قاله قتادة.\n\nالثامنة : ذهب بعض الناس من هذه الآية، ومن قول شعيب :\n{ إِنِّيۤ أُرِيدُ أَنْ أُنكِحَكَ }\n[القصص: 27] إلى أن ترتيب هذا المعنى في المهور ينبغي أن يكون: «أنكحه إياها» فتقدّم ضمير الزوج كما في الآيتين. وكذلك \" قوله عليه السلام لصاحب الرداء: «اذهب فقد أَنْكَحتُكها بما معك من القرآن» \" قال ابن عطية: وهذا غير لازم؛ لأن الزوج في الآية مخاطب فحسن تقديمه، وفي المهور الزوجان (سواء)، فقدّم من شئت، ولم يبق ترجيح إلا بدرجة الرجال، وأنهم القوّامون.\n\nالتاسعة: قوله تعالى: { زَوَّجْنَاكَهَا } دليل على ثبوت الوليّ في النكاح؛ وقد تقدّم الخلاف في ذلك. روي أن عائشة وزينب تفاخرتا، فقالت عائشة: أنا التي جاء بي المَلَك إلى النبيّ صلى الله عليه وسلم في سَرَقة من حرير فيقول: «هذه امرأتك» خرّجه الصحيح. وقالت زينب: أنا التي زوّجني الله من فوق سبع سموات. وقال الشعبي: كانت زينب تقول لرسول الله صلى الله عليه وسلم إني لأَدِلّ عليك بثلاث، ما من نسائك امرأة تَدِلّ بهنّ ـ إن جَدّي وجدَّك واحد، وإن الله أنكحك إيّاي من السماء، وإن السّفير في ذلك جبريل. وروي عن زينب أنها قالت: لما وقعت في قلب رسول الله صلى الله عليه وسلم لم يستطعني زيد، وما أمتنع منه غير ما يمنعه الله تعالى منّي فلا يقدر عليّ.\n\n                                    ",
        "saadi": "وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا ٧٣\n                                        \n                                        \n                                        \n                                        وكان سبب نزول هذه الآيات، أن اللّه تعالى أراد أن يشرع شرعاً عاماً للمؤمنين، أن الأدعياء ليسوا في حكم الأبناء حقيقة، من جميع الوجوه وأن أزواجهم لا جناح على مَنْ تبناهم، في نكاحهن. وكان هذا من الأمور المعتادة، التي لا تكاد تزول إلا بحادث كبير، فأراد أن يكون هذا الشرع قولاً من رسوله وفعلاً، وإذا أراد اللّه أمراً جعل له سبباً، وكان زيد بن حارثة يدعى \" زيد بن محمد \" قد تبناه النبي صلى اللّه عليه وسلم، فصار يدعى إليه حتى نزل:\n{ ٱدْعُوهُمْ لآبَآئِهِمْ }\n[الأحزاب: 5] فقيل له: \" زيد بن حارثة \". وكانت تحته زينب بنت جحش، ابنة عمة رسول اللّه صلى اللّه عليه وسلم، وكان قد وقع في قلب الرسول، لو طلقها زيد، لتزوَّجها، فقدر اللّه أن يكون بينها وبين زيد ما اقتضى أن جاء زيد بن حارثة يستأذن النبي صلى اللّه عليه وسلم في فراقها. قال اللّه: { وَإِذْ تَقُولُ لِلَّذِيۤ أَنعَمَ ٱللَّهُ عَلَيْهِ } أي: بالإسلام { وَأَنْعَمْتَ عَلَيْهِ } بالعتق، حين جاءك مشاوراً في فراقها: فقلت له ناصحاً له ومخبراً بمصلحته، مع وقوعها في قلبك: { أَمْسِكْ عَلَيْكَ زَوْجَكَ } أي: لا تفارقها، واصبر على ما جاءك منها، { وَٱتَّقِ ٱللَّهَ } تعالى في أمورك عامة، وفي أمر زوجك خاصة، فإن التقوى تحث على الصبر، وتأمر به. { وَتُخْفِي فِي نَفْسِكَ مَا ٱللَّهُ مُبْدِيهِ } والذي أخفاه، أنه لو طلقها زيد لتزوجها صلى اللّه عليه وسلم. { وَتَخْشَى ٱلنَّاسَ } في عدم إبداء ما في نفسك { وَٱللَّهُ أَحَقُّ أَن تَخْشَاهُ } وأن لا تباليهم شيئاً، { فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَراً } أي: طابت نفسه، ورغب عنها، وفارقها. { زَوَّجْنَاكَهَا } وإنما فعلنا ذلك لفائدة عظيمة، وهي: { لِكَيْ لاَ يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ فِيۤ أَزْوَاجِ أَدْعِيَآئِهِمْ } حيث رأوك تزوجت زوج زيد بن حارثة، الذي كان من قبل ينتسب إليك. ولما كان قوله: { لِكَيْ لاَ يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ فِيۤ أَزْوَاجِ أَدْعِيَآئِهِمْ } عاماً في جميع الأحوال وكان من الأحوال، ما لا يجوز ذلك، وهي قبل انقضاء وطره منها، قيد ذلك بقوله: { إِذَا قَضَوْاْ مِنْهُنَّ وَطَراً وَكَانَ أَمْرُ ٱللَّهِ مَفْعُولاً } أي: لا بد من فعله، ولا عائق له ولا مانع. وفي هذه الآيات المشتملات على هذه القصة فوائد، منها: الثناء على زيد بن حارثة، وذلك من وجهين: أحدهما: أن اللّه سماه في القرآن، ولم يسم من الصحابة باسمه غيره. والثاني: أن اللّه أخبر أنه أنعم عليه، أي: بنعمة الإسلام والإيمان. وهذه شهادة من اللّه له أنه مسلم مؤمن، ظاهراً وباطناً، وإلا فلا وجه لتخصيصه بالنعمة، لولا أن المراد بها النعمة الخاصة. ومنها: أن المُعْتق في نعمة الْمُعْتِق.\n                                    "
      },
      "originalText": "وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا ٧٣"
    },
    {
      "number": 3571,
      "text": "مَا كَانَ عَلَى النَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ اللَّهُ لَهُ ۖ سُنَّةَ اللَّهِ فِي الَّذِينَ خَلَوْا مِنْ قَبْلُ ۚ وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 38,
      "juz": 22,
      "manzil": 5,
      "page": 423,
      "ruku": 365,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنۡ حَرَجٖ فِيمَا فَرَضَ ٱللَّهُ لَهُۥۖ سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۚ وَكَانَ أَمۡرُ ٱللَّهِ قَدَرٗا مَّقۡدُورًا ٨٣\n                                    \n                                    \n                                    يقول تعالى { مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنْ حَرَجٍ فِيمَا فَرَضَ ٱللَّهُ لَهُ } أي فيما أحل له، وأمره به من تزويج زينب رضي الله عنها التي طلقها دعيه زيد بن حارثة رضي الله عنه. وقوله تعالى { سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوْاْ مِن قَبْلُ } أي هذا حكم الله تعالى في الأنبياء قبله، لم يكن ليأمرهم بشيء وعليهم في ذلك حرج، وهذا رد على من توهم من المنافقين نقصاً في تزويجه امرأة زيد مولاه ودعيه الذي كان قد تبناه، { وَكَانَ أَمْرُ ٱللَّهِ قَدَراً مَّقْدُوراً } أي وكان أمره الذي يقدره كائناً لا محالة، وواقعاً لا محيد عنه ولا معدل، فما شاء كان، وما لم يشأ لم يكن.\n                                    ",
        "qortoby": "مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنۡ حَرَجٖ فِيمَا فَرَضَ ٱللَّهُ لَهُۥۖ سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۚ وَكَانَ أَمۡرُ ٱللَّهِ قَدَرٗا مَّقۡدُورًا ٨٣\n                                    \n                                    \n                                    قوله تعالى: { سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوْاْ مِن قَبْلُ } هذه مخاطبة من الله تعالى لجميع الأمة. أعلمهم أن هذا ونحوه هو السَّنن الأقدم في الأنبياء أن ينالوا ما أحلّه لهم؛ أي سَنّ لمحمد صلى الله عليه وسلم التوسعة عليه في النكاح سُنّة الأنبياء الماضية؛ كداود وسليمان. فكان لداود مائة امرأة وثلاثمائة سُرِّية، ولسليمان ثلاثمائة امرأة وسبعمائة سُرِّية. وذكر الثعلبيّ عن مقاتل وابن الكلبيّ أن الإشارة إلى داود عليه السلام؛ حيث جمع الله بينه وبين من فُتن بها. و«سُنَّةَ» نصب على المصدر؛ أي سَنّ الله له سُنة واسعة. و«الَّذِينَ خَلَوْا» هم الأنبياء؛ بدليل وصفهم بعدُ بقوله: { ٱلَّذِينَ يُبَلِّغُونَ رِسَالاَتِ ٱللَّهِ }.\n                                    ",
        "saadi": "مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنۡ حَرَجٖ فِيمَا فَرَضَ ٱللَّهُ لَهُۥۖ سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۚ وَكَانَ أَمۡرُ ٱللَّهِ قَدَرٗا مَّقۡدُورًا ٨٣\n                                        \n                                        \n                                        \n                                        هذا دفع لطعن من طعن في الرسول صلى اللّه عليه وسلم، في كثرة أزواجه، وأنه طعن بما لا مطعن فيه، فقال: { مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنْ حَرَجٍ } أي: إثم وذنب. { فِيمَا فَرَضَ ٱللَّهُ لَهُ } أي: قدر له من الزوجات، فإن هذا قد أباحه اللّه للأنبياء قبله، ولهذا قال: { سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوْاْ مِن قَبْلُ وَكَانَ أَمْرُ ٱللَّهِ قَدَراً مَّقْدُوراً } أي: لا بد من وقوعه. ثم ذكر مَنْ هم الذين من قبل قد خلوا، وهذه سنتهم وعادتهم، وأنهم { ٱلَّذِينَ يُبَلِّغُونَ رِسَالاَتِ ٱللَّهِ } فيتلون على العباد آيات اللّه وحججه وبراهينه، ويدعونهم إلى اللّه { وَيَخْشَوْنَهُ } وحده لا شريك له { وَلاَ يَخْشَوْنَ أَحَداً } إلا اللّه. فإذا كان هذا سُنّة في الأنبياء المعصومين، الذين وظيفتهم قد أدوها وقاموا بها أتم القيام، وهو دعوة الخلق إلى اللّه، والخشية منه وحده، التي تقتضي فعل كل مأمور، وترك كل محظور، دلّ ذلك على أنه لا نقص فيه بوجه. { وَكَفَىٰ بِٱللَّهِ حَسِيباً } محاسباً عباده، مراقباً أعمالهم. وعلم من هذا، أن النكاح من سنن المرسلين.\n                                    "
      },
      "originalText": "مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنۡ حَرَجٖ فِيمَا فَرَضَ ٱللَّهُ لَهُۥۖ سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلُۚ وَكَانَ أَمۡرُ ٱللَّهِ قَدَرٗا مَّقۡدُورًا ٨٣"
    },
    {
      "number": 3572,
      "text": "الَّذِينَ يُبَلِّغُونَ رِسَالَاتِ اللَّهِ وَيَخْشَوْنَهُ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا اللَّهَ ۗ وَكَفَىٰ بِاللَّهِ حَسِيبًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 39,
      "juz": 22,
      "manzil": 5,
      "page": 423,
      "ruku": 365,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يُبَلِّغُونَ رِسَٰلَٰتِ ٱللَّهِ وَيَخۡشَوۡنَهُۥ وَلَا يَخۡشَوۡنَ أَحَدًا إِلَّا ٱللَّهَۗ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا ٩٣\n                                    \n                                    \n                                    يمدح تبارك وتعالى { ٱلَّذِينَ يُبَلِّغُونَ رِسَالـٰتِ } أي إلى خلقه، ويؤدونها بأماناتها، { وَيَخْشَوْنَهُ } أي يخافونه، ولا يخافون أحداً سواه، فلا تمنعهم سطوة أحد عن إِبلاغ رسالات الله تعالى، { وَكَفَىٰ بِٱللَّهِ حَسِيباً } أي وكفى بالله ناصراً ومعيناً، وسيد الناس في هذا المقام، بل وفي كل مقام، محمد رسول الله صلى الله عليه وسلم فإِنه قام بأداء الرسالة، وإِبلاغها إِلى أهل المشارق والمغارب، إِلى جميع أنواع بني آدم، وأظهر الله تعالى كلمته ودينه وشرعه على جميع الأديان والشرائع، فإِنه قد كان النبي قبله إِنما يبعث إِلى قومه خاصة، وأما هو صلى الله عليه وسلم فإِنه بعث إِلى جميع الخلق عربهم وعجمهم\n{ قُلْ يَٰأَيُّهَا ٱلنَّاسُ إِنِّي رَسُولُ ٱللَّهِ إِلَيْكُمْ جَمِيعًا }\nالأعراف 151 ثم ورث مقام البلاغ عنه أمته من بعده، فكان أعلى من قام بها بعده أصحابه رضي الله عنهم، بلغوا عنه كما أمرهم به في جميع أقواله وأفعاله وأحواله، في ليله ونهاره، وحضره وسفره، وسره وعلانيته، فرضي الله عنهم وأرضاهم، ثم ورثه كل خلف عن سلفهم إِلى زماننا هذا، فبنورهم يقتدي المهتدون، وعلى منهجهم يسلك الموفقون، فنسأل الله الكريم المنان أن يجعلنا من خلفهم. قال الإمام أحمد حدثنا ابن نمير، أخبرنا الأعمش عن عمرو بن مرة عن أبي البختري عن أبي سعيد الخدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" لا يحقرن أحدكم نفسه أن يرى أمر الله فيه مقال، ثم لا يقول، فيقول الله ما يمنعك أن تقول فيه؟ فيقول رب خشيت الناس، فيقول فأنا أحق أن يخشى \" ورواه أيضاً عن عبد الرزاق عن الثوري عن زبيد عن عمرو بن مرة. ورواه ابن ماجه عن أبي كريب عن عبد الله بن نمير وأبي معاوية، كلاهما عن الأعمش به. وقوله تعالى { مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مّن رِّجَالِكُمْ } نهى أن يقال بعد هذا زيد بن محمد، أي لم يكن أباه، وإِن كان قد تبناه، فإنه صلى الله عليه وسلم لم يعش له ولد ذكر حتى بلغ الحلم، فإِنه صلى الله عليه وسلم ولد له القاسم والطيب والطاهر من خديجة رضي الله عنها، فماتوا صغاراً، وولد له صلى الله عليه وسلم إبراهيم من مارية القبطية، فمات أيضاً رضيعاً، وكان له صلى الله عليه وسلم من خديجة أربع بنات زينب ورقية وأم كلثوم وفاطمة رضي الله عنهم أجمعين، فمات في حياته صلى الله عليه وسلم ثلاث، وتأخرت فاطمة رضي الله عنها حتى أصيبت به صلى الله عليه وسلم ثم ماتت بعده لستة أشهر. وقوله تعالى { وَلَـٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّينَ وَكَانَ ٱللَّهُ بِكُلِّ شَيْءٍ عَلِيماً } كقوله عز وجل\n                                   { ٱللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ }\nالأنعام 124 فهذه الآية نص في أنه لا نبي بعده، وإِذا كان لانبي بعده، فلا رسول بعده بالطريق الأولى والأحرى لأن مقام الرسالة أخص من مقام النبوة، فإِن كل رسول نبي، ولا ينعكس، وبذلك وردت الأحاديث المتواترة عن رسول الله صلى الله عليه وسلم من حديث جماعة من الصحابة رضي الله عنهم. قال الإمام أحمد حدثنا أبو عامر الأزدي، حدثنا زهير بن محمد عن عبد الله بن محمد بن عقيل، عن الطفيل بن أبي بن كعب عن أبيه رضي الله عنه، عن النبي صلى الله عليه وسلم قال \" مثلي في النبيين كمثل رجل بنى داراً، فأحسنها وأكملها، وترك فيها موضع لبنة لم يضعها، فجعل الناس يطوفون بالبنيان، ويعجبون منه ويقولون لو تم موضع هذه اللبنة، فأنا في النبيين موضع تلك اللبنة \" ورواه الترمذي عن بندار عن أبي عامر العقدي به، وقال حسن صحيح. حديث آخر قال الإمام أحمد حدثنا عفان، حدثنا عبد الواحد بن زياد، حدثنا المختار بن فلفل، حدثنا أنس بن مالك رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" إِن الرسالة والنبوة قد انقطعت، فلا رسول بعد، ولا نبي \" قال فشق ذلك على الناس، فقال \" ولكن المبشرات \" قالوا يارسول الله وما المبشرات؟ قال \" رؤيا الرجل المسلم، وهي جزء من أجزاء النبوة \" وهكذا رواه الترمذي عن الحسن بن محمد الزعفراني عن عفان بن مسلم به، وقال صحيح غريب من حديث المختار بن فلفل. حديث آخر قال أبو داود الطيالسي حدثنا سليم بن حيان عن سعيد بن ميناء عن جابر بن عبد الله رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" مثلي ومثل الأنبياء كمثل رجل بنى داراً، فأكملها وأحسنها، إِلا موضع لبنة، فكان من دخلها، فنظر إِليها قال ما أحسنها إِلا موضع هذه اللبنة، فأنا موضع اللبنة، ختم بي الأنبياء عليهم الصلاة والسلام \" ورواه البخاري ومسلم والترمذي من طرق عن سليم بن حيان به، وقال الترمذي صحيح غريب من هذا الوجه. حديث آخر قال الإمام أحمد حدثنا أبو معاوية، حدثنا الأعمش عن أبي صالح عن أبي سعيد الخدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" مثلي ومثل النبيين كمثل رجل بنى داراً، فأتمها إِلا لبنة واحدة، فجئت أنا، فأتممت تلك اللبنة \" انفرد به مسلم من رواية الأعمش به. حديث آخر قال الإمام أحمد حدثنا يونس بن محمد، حدثنا حماد بن زيد، حدثنا عثمان بن عبيد الراسبي قال سمعت أبا الطفيل رضي الله عنه يقول قال رسول الله صلى الله عليه وسلم\n\n                                   \" لا نبوة بعدي إِلا المبشرات \" قيل وما المبشرات يا رسول الله؟ قال \" الرؤيا الحسنة \" ــــ أو قال ــــ \" الرؤيا الصالحة \". حديث آخر قال الإمام أحمد حدثنا عبد الرزاق، أخبرنا معمر عن همام بن منبه قال هذا ما حدثنا أبو هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" إِن مثلي ومثل الأنبياء من قبلي كمثل رجل ابتنى بيوتاً، فأكملها وأحسنها وأجملها، إِلا موضع لبنة من زاوية من زواياها، فجعل الناس يطوفون ويعجبهم البنيان ويقولون ألا وضعت ههنا لبنة فيتم بنيانك؟ ــــ قال رسول الله صلى الله عليه وسلم ــــ فكنت أنا اللبنة \" أخرجاه من حديث عبد الرزاق. حديث آخر عن أبي هريرة رضي الله عنه أيضاً. قال الإمام مسلم حدثنا يحيى بن أيوب وقتيبة وعلي بن حجر قالوا حدثنا إِسماعيل بن جعفر عن العلاء عن أبيه عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \" فضلت على الأنبياء بست أعطيت جوامع الكلم، ونصرت بالرعب، وأحلت لي الغنائم، وجعلت لي الأرض مسجداً وطهوراً، وأرسلت إِلى الخلق كافة، وختم بي النبيون \" ورواه الترمذي وابن ماجه من حديث إِسماعيل بن جعفر، وقال الترمذي حسن صحيح. حديث آخر وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن أبي صالح عن أبي سعيد الخدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" مثلي ومثل الأنبياء من قبلي كمثل رجل بنى داراً فأتمها، إِلا موضع لبنة واحدة، فجئت أنا، فأتممت تلك اللبنة \" ورواه مسلم عن أبي بكر بن أبي شيبة وأبي كريب، كلاهما عن أبي معاوية به. حديث آخر قال الإمام أحمد حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، حدثنا سعيد بن سويد الكلبي عن عبد الأعلى بن هلال السلمي، عن العرباض بن سارية رضي الله عنه قال قال لي النبي صلى الله عليه وسلم \" إِني عند الله لخاتم النبيين، وإِن آدم لمنجدل في طينته \". حديث آخر قال الزهري أخبرني محمد بن جبير بن مطعم عن أبيه رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول \" إِن لي أسماء أنا محمد، وأنا أحمد، وأنا الماحي الذي يمحو الله تعالى بي الكفر، وأنا الحاشر الذي يحشر الناس على قدمي، وأنا العاقب الذي ليس بعده نبي \" أخرجاه في \" الصحيحين \". وقال الإمام أحمد حدثنا يحيى بن إِسحاق، حدثنا ابن لهيعة عن عبدالله بن هبيرة عن عبد الرحمن بن جبير قال سمعت عبد الله بن عمرو يقول خرج علينا رسول الله صلى الله عليه وسلم يوماً كالمودّع، فقال\n\n                                   \" أنا محمد النبي الأمي ــــ ثلاثاً ــــ ولا نبي بعدي، أوتيت فواتح الكلم وجوامعه وخواتمه، وعلمت كم خزنة النار وحملة العرش، وتجوز بي، وعوفيت وعوفيت أمتي، فاسمعوا وأطيعوا ما دمت فيكم، فإِذا ذهب بي، فعليكم بكتاب الله تعالى أحلوا حلاله، وحرموا حرامه \" تفرد به الإمام أحمد. ورواه الإمام أحمد أيضاً عن يحيى بن إِسحاق عن ابن لهيعة عن عبد الله بن هبيرة عن عبد الله بن سريج الخولاني عن أبي قيس مولى عمرو بن العاص، عن عبد الله بن عمرو رضي الله عنهما، فذكر مثله سواء، والأحاديث في هذا كثيرة، فمن رحمة الله تعالى بالعباد إِرسال محمد صلى الله عليه وسلم إِليهم، ثم من تشريفه لهم ختم الأنبياء والمرسلين به، وإِكمال الدين الحنيف له، وقد أخبر الله تبارك وتعالى في كتابه، ورسوله صلى الله عليه وسلم في السنة المتواترة عنه أنه لا نبي بعده ليعلموا أن كل من ادعى هذا المقام بعده، فهو كذاب وأفاك دجال ضال مضل، لو تحرق وشعبذ، وأتى بأنواع السحر والطلاسم والنيرجيات، فكلها محال وضلال عند أولي الألباب كما أجرى الله سبحانه وتعالى على يد الأسود العنسي باليمن، ومسيلمة الكذاب باليمامة من الأحوال الفاسدة والأقوال الباردة ما علم كل ذي لب وفهم وحجى أنهما كاذبان ضالان، لعنهما الله، وكذلك كل مدع لذلك إِلى يوم القيامة، حتى يختموا بالمسيح الدجال، فكل واحد من هؤلاء الكذابين يخلق الله تعالى معه من الأمور ما يشهد العلماء والمؤمنون بكذب من جاء بها، وهذا من تمام لطف الله تعالى بخلقه، فإِنهم بضرورة الواقع لا يأمرون بمعروف، ولاينهون عن منكر، إِلا على سبيل الاتفاق، أو لما لهم فيه من المقاصد إِلى غيره، ويكون في غاية الإفك والفجور في أقوالهم وأفعالهم، كما قال تعالى\n{ هَلْ أُنَبِّئُكُمْ عَلَىٰ مَن تَنَزَّلُ ٱلشَّيَـٰطِينُ تَنَزَّلُ عَلَىٰ كُلِّ أَفَّاكٍ أَثِيمٍ }\nالشعراء 221 ــــ 222 الآية، وهذا بخلاف حال الأنبياء عليهم الصلاة والسلام، فإِنهم في غاية البر والصدق والرشد والاستقامة والعدل فيما يقولونه ويفعلونه، ويأمرون به وينهون عنه، مع ما يؤيدون به من الخوارق للعادات، والأدلة الواضحات، والبراهين الباهرات، فصلوات الله وسلامه عليهم دائماً مستمراً ما دامت الأرض والسموات.\n                                    ",
        "qortoby": "ٱلَّذِينَ يُبَلِّغُونَ رِسَٰلَٰتِ ٱللَّهِ وَيَخۡشَوۡنَهُۥ وَلَا يَخۡشَوۡنَ أَحَدًا إِلَّا ٱللَّهَۗ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا ٩٣\n                                    \n                                    \n                                    قوله تعالى: { سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوْاْ مِن قَبْلُ } هذه مخاطبة من الله تعالى لجميع الأمة. أعلمهم أن هذا ونحوه هو السَّنن الأقدم في الأنبياء أن ينالوا ما أحلّه لهم؛ أي سَنّ لمحمد صلى الله عليه وسلم التوسعة عليه في النكاح سُنّة الأنبياء الماضية؛ كداود وسليمان. فكان لداود مائة امرأة وثلاثمائة سُرِّية، ولسليمان ثلاثمائة امرأة وسبعمائة سُرِّية. وذكر الثعلبيّ عن مقاتل وابن الكلبيّ أن الإشارة إلى داود عليه السلام؛ حيث جمع الله بينه وبين من فُتن بها. و«سُنَّةَ» نصب على المصدر؛ أي سَنّ الله له سُنة واسعة. و«الَّذِينَ خَلَوْا» هم الأنبياء؛ بدليل وصفهم بعدُ بقوله: { ٱلَّذِينَ يُبَلِّغُونَ رِسَالاَتِ ٱللَّهِ }.\n                                    ",
        "saadi": "ٱلَّذِينَ يُبَلِّغُونَ رِسَٰلَٰتِ ٱللَّهِ وَيَخۡشَوۡنَهُۥ وَلَا يَخۡشَوۡنَ أَحَدًا إِلَّا ٱللَّهَۗ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا ٩٣\n                                        \n                                        \n                                        \n                                        هذا دفع لطعن من طعن في الرسول صلى اللّه عليه وسلم، في كثرة أزواجه، وأنه طعن بما لا مطعن فيه، فقال: { مَّا كَانَ عَلَى ٱلنَّبِيِّ مِنْ حَرَجٍ } أي: إثم وذنب. { فِيمَا فَرَضَ ٱللَّهُ لَهُ } أي: قدر له من الزوجات، فإن هذا قد أباحه اللّه للأنبياء قبله، ولهذا قال: { سُنَّةَ ٱللَّهِ فِي ٱلَّذِينَ خَلَوْاْ مِن قَبْلُ وَكَانَ أَمْرُ ٱللَّهِ قَدَراً مَّقْدُوراً } أي: لا بد من وقوعه. ثم ذكر مَنْ هم الذين من قبل قد خلوا، وهذه سنتهم وعادتهم، وأنهم { ٱلَّذِينَ يُبَلِّغُونَ رِسَالاَتِ ٱللَّهِ } فيتلون على العباد آيات اللّه وحججه وبراهينه، ويدعونهم إلى اللّه { وَيَخْشَوْنَهُ } وحده لا شريك له { وَلاَ يَخْشَوْنَ أَحَداً } إلا اللّه. فإذا كان هذا سُنّة في الأنبياء المعصومين، الذين وظيفتهم قد أدوها وقاموا بها أتم القيام، وهو دعوة الخلق إلى اللّه، والخشية منه وحده، التي تقتضي فعل كل مأمور، وترك كل محظور، دلّ ذلك على أنه لا نقص فيه بوجه. { وَكَفَىٰ بِٱللَّهِ حَسِيباً } محاسباً عباده، مراقباً أعمالهم. وعلم من هذا، أن النكاح من سنن المرسلين.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يُبَلِّغُونَ رِسَٰلَٰتِ ٱللَّهِ وَيَخۡشَوۡنَهُۥ وَلَا يَخۡشَوۡنَ أَحَدًا إِلَّا ٱللَّهَۗ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا ٩٣"
    },
    {
      "number": 3573,
      "text": "مَا كَانَ مُحَمَّدٌ أَبَا أَحَدٍ مِنْ رِجَالِكُمْ وَلَٰكِنْ رَسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ ۗ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 40,
      "juz": 22,
      "manzil": 5,
      "page": 423,
      "ruku": 365,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّ‍ۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا ٠٤\n                                    \n                                    \n                                    يمدح تبارك وتعالى { ٱلَّذِينَ يُبَلِّغُونَ رِسَالـٰتِ } أي إلى خلقه، ويؤدونها بأماناتها، { وَيَخْشَوْنَهُ } أي يخافونه، ولا يخافون أحداً سواه، فلا تمنعهم سطوة أحد عن إِبلاغ رسالات الله تعالى، { وَكَفَىٰ بِٱللَّهِ حَسِيباً } أي وكفى بالله ناصراً ومعيناً، وسيد الناس في هذا المقام، بل وفي كل مقام، محمد رسول الله صلى الله عليه وسلم فإِنه قام بأداء الرسالة، وإِبلاغها إِلى أهل المشارق والمغارب، إِلى جميع أنواع بني آدم، وأظهر الله تعالى كلمته ودينه وشرعه على جميع الأديان والشرائع، فإِنه قد كان النبي قبله إِنما يبعث إِلى قومه خاصة، وأما هو صلى الله عليه وسلم فإِنه بعث إِلى جميع الخلق عربهم وعجمهم\n{ قُلْ يَٰأَيُّهَا ٱلنَّاسُ إِنِّي رَسُولُ ٱللَّهِ إِلَيْكُمْ جَمِيعًا }\nالأعراف 151 ثم ورث مقام البلاغ عنه أمته من بعده، فكان أعلى من قام بها بعده أصحابه رضي الله عنهم، بلغوا عنه كما أمرهم به في جميع أقواله وأفعاله وأحواله، في ليله ونهاره، وحضره وسفره، وسره وعلانيته، فرضي الله عنهم وأرضاهم، ثم ورثه كل خلف عن سلفهم إِلى زماننا هذا، فبنورهم يقتدي المهتدون، وعلى منهجهم يسلك الموفقون، فنسأل الله الكريم المنان أن يجعلنا من خلفهم. قال الإمام أحمد حدثنا ابن نمير، أخبرنا الأعمش عن عمرو بن مرة عن أبي البختري عن أبي سعيد الخدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" لا يحقرن أحدكم نفسه أن يرى أمر الله فيه مقال، ثم لا يقول، فيقول الله ما يمنعك أن تقول فيه؟ فيقول رب خشيت الناس، فيقول فأنا أحق أن يخشى \" ورواه أيضاً عن عبد الرزاق عن الثوري عن زبيد عن عمرو بن مرة. ورواه ابن ماجه عن أبي كريب عن عبد الله بن نمير وأبي معاوية، كلاهما عن الأعمش به. وقوله تعالى { مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٍ مّن رِّجَالِكُمْ } نهى أن يقال بعد هذا زيد بن محمد، أي لم يكن أباه، وإِن كان قد تبناه، فإنه صلى الله عليه وسلم لم يعش له ولد ذكر حتى بلغ الحلم، فإِنه صلى الله عليه وسلم ولد له القاسم والطيب والطاهر من خديجة رضي الله عنها، فماتوا صغاراً، وولد له صلى الله عليه وسلم إبراهيم من مارية القبطية، فمات أيضاً رضيعاً، وكان له صلى الله عليه وسلم من خديجة أربع بنات زينب ورقية وأم كلثوم وفاطمة رضي الله عنهم أجمعين، فمات في حياته صلى الله عليه وسلم ثلاث، وتأخرت فاطمة رضي الله عنها حتى أصيبت به صلى الله عليه وسلم ثم ماتت بعده لستة أشهر. وقوله تعالى { وَلَـٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّينَ وَكَانَ ٱللَّهُ بِكُلِّ شَيْءٍ عَلِيماً } كقوله عز وجل\n                                   { ٱللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ }\nالأنعام 124 فهذه الآية نص في أنه لا نبي بعده، وإِذا كان لانبي بعده، فلا رسول بعده بالطريق الأولى والأحرى لأن مقام الرسالة أخص من مقام النبوة، فإِن كل رسول نبي، ولا ينعكس، وبذلك وردت الأحاديث المتواترة عن رسول الله صلى الله عليه وسلم من حديث جماعة من الصحابة رضي الله عنهم. قال الإمام أحمد حدثنا أبو عامر الأزدي، حدثنا زهير بن محمد عن عبد الله بن محمد بن عقيل، عن الطفيل بن أبي بن كعب عن أبيه رضي الله عنه، عن النبي صلى الله عليه وسلم قال \" مثلي في النبيين كمثل رجل بنى داراً، فأحسنها وأكملها، وترك فيها موضع لبنة لم يضعها، فجعل الناس يطوفون بالبنيان، ويعجبون منه ويقولون لو تم موضع هذه اللبنة، فأنا في النبيين موضع تلك اللبنة \" ورواه الترمذي عن بندار عن أبي عامر العقدي به، وقال حسن صحيح. حديث آخر قال الإمام أحمد حدثنا عفان، حدثنا عبد الواحد بن زياد، حدثنا المختار بن فلفل، حدثنا أنس بن مالك رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" إِن الرسالة والنبوة قد انقطعت، فلا رسول بعد، ولا نبي \" قال فشق ذلك على الناس، فقال \" ولكن المبشرات \" قالوا يارسول الله وما المبشرات؟ قال \" رؤيا الرجل المسلم، وهي جزء من أجزاء النبوة \" وهكذا رواه الترمذي عن الحسن بن محمد الزعفراني عن عفان بن مسلم به، وقال صحيح غريب من حديث المختار بن فلفل. حديث آخر قال أبو داود الطيالسي حدثنا سليم بن حيان عن سعيد بن ميناء عن جابر بن عبد الله رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" مثلي ومثل الأنبياء كمثل رجل بنى داراً، فأكملها وأحسنها، إِلا موضع لبنة، فكان من دخلها، فنظر إِليها قال ما أحسنها إِلا موضع هذه اللبنة، فأنا موضع اللبنة، ختم بي الأنبياء عليهم الصلاة والسلام \" ورواه البخاري ومسلم والترمذي من طرق عن سليم بن حيان به، وقال الترمذي صحيح غريب من هذا الوجه. حديث آخر قال الإمام أحمد حدثنا أبو معاوية، حدثنا الأعمش عن أبي صالح عن أبي سعيد الخدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" مثلي ومثل النبيين كمثل رجل بنى داراً، فأتمها إِلا لبنة واحدة، فجئت أنا، فأتممت تلك اللبنة \" انفرد به مسلم من رواية الأعمش به. حديث آخر قال الإمام أحمد حدثنا يونس بن محمد، حدثنا حماد بن زيد، حدثنا عثمان بن عبيد الراسبي قال سمعت أبا الطفيل رضي الله عنه يقول قال رسول الله صلى الله عليه وسلم\n\n                                   \" لا نبوة بعدي إِلا المبشرات \" قيل وما المبشرات يا رسول الله؟ قال \" الرؤيا الحسنة \" ــــ أو قال ــــ \" الرؤيا الصالحة \". حديث آخر قال الإمام أحمد حدثنا عبد الرزاق، أخبرنا معمر عن همام بن منبه قال هذا ما حدثنا أبو هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" إِن مثلي ومثل الأنبياء من قبلي كمثل رجل ابتنى بيوتاً، فأكملها وأحسنها وأجملها، إِلا موضع لبنة من زاوية من زواياها، فجعل الناس يطوفون ويعجبهم البنيان ويقولون ألا وضعت ههنا لبنة فيتم بنيانك؟ ــــ قال رسول الله صلى الله عليه وسلم ــــ فكنت أنا اللبنة \" أخرجاه من حديث عبد الرزاق. حديث آخر عن أبي هريرة رضي الله عنه أيضاً. قال الإمام مسلم حدثنا يحيى بن أيوب وقتيبة وعلي بن حجر قالوا حدثنا إِسماعيل بن جعفر عن العلاء عن أبيه عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال \" فضلت على الأنبياء بست أعطيت جوامع الكلم، ونصرت بالرعب، وأحلت لي الغنائم، وجعلت لي الأرض مسجداً وطهوراً، وأرسلت إِلى الخلق كافة، وختم بي النبيون \" ورواه الترمذي وابن ماجه من حديث إِسماعيل بن جعفر، وقال الترمذي حسن صحيح. حديث آخر وقال الإمام أحمد حدثنا أبو معاوية حدثنا الأعمش عن أبي صالح عن أبي سعيد الخدري رضي الله عنه قال قال رسول الله صلى الله عليه وسلم \" مثلي ومثل الأنبياء من قبلي كمثل رجل بنى داراً فأتمها، إِلا موضع لبنة واحدة، فجئت أنا، فأتممت تلك اللبنة \" ورواه مسلم عن أبي بكر بن أبي شيبة وأبي كريب، كلاهما عن أبي معاوية به. حديث آخر قال الإمام أحمد حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، حدثنا سعيد بن سويد الكلبي عن عبد الأعلى بن هلال السلمي، عن العرباض بن سارية رضي الله عنه قال قال لي النبي صلى الله عليه وسلم \" إِني عند الله لخاتم النبيين، وإِن آدم لمنجدل في طينته \". حديث آخر قال الزهري أخبرني محمد بن جبير بن مطعم عن أبيه رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول \" إِن لي أسماء أنا محمد، وأنا أحمد، وأنا الماحي الذي يمحو الله تعالى بي الكفر، وأنا الحاشر الذي يحشر الناس على قدمي، وأنا العاقب الذي ليس بعده نبي \" أخرجاه في \" الصحيحين \". وقال الإمام أحمد حدثنا يحيى بن إِسحاق، حدثنا ابن لهيعة عن عبدالله بن هبيرة عن عبد الرحمن بن جبير قال سمعت عبد الله بن عمرو يقول خرج علينا رسول الله صلى الله عليه وسلم يوماً كالمودّع، فقال\n\n                                   \" أنا محمد النبي الأمي ــــ ثلاثاً ــــ ولا نبي بعدي، أوتيت فواتح الكلم وجوامعه وخواتمه، وعلمت كم خزنة النار وحملة العرش، وتجوز بي، وعوفيت وعوفيت أمتي، فاسمعوا وأطيعوا ما دمت فيكم، فإِذا ذهب بي، فعليكم بكتاب الله تعالى أحلوا حلاله، وحرموا حرامه \" تفرد به الإمام أحمد. ورواه الإمام أحمد أيضاً عن يحيى بن إِسحاق عن ابن لهيعة عن عبد الله بن هبيرة عن عبد الله بن سريج الخولاني عن أبي قيس مولى عمرو بن العاص، عن عبد الله بن عمرو رضي الله عنهما، فذكر مثله سواء، والأحاديث في هذا كثيرة، فمن رحمة الله تعالى بالعباد إِرسال محمد صلى الله عليه وسلم إِليهم، ثم من تشريفه لهم ختم الأنبياء والمرسلين به، وإِكمال الدين الحنيف له، وقد أخبر الله تبارك وتعالى في كتابه، ورسوله صلى الله عليه وسلم في السنة المتواترة عنه أنه لا نبي بعده ليعلموا أن كل من ادعى هذا المقام بعده، فهو كذاب وأفاك دجال ضال مضل، لو تحرق وشعبذ، وأتى بأنواع السحر والطلاسم والنيرجيات، فكلها محال وضلال عند أولي الألباب كما أجرى الله سبحانه وتعالى على يد الأسود العنسي باليمن، ومسيلمة الكذاب باليمامة من الأحوال الفاسدة والأقوال الباردة ما علم كل ذي لب وفهم وحجى أنهما كاذبان ضالان، لعنهما الله، وكذلك كل مدع لذلك إِلى يوم القيامة، حتى يختموا بالمسيح الدجال، فكل واحد من هؤلاء الكذابين يخلق الله تعالى معه من الأمور ما يشهد العلماء والمؤمنون بكذب من جاء بها، وهذا من تمام لطف الله تعالى بخلقه، فإِنهم بضرورة الواقع لا يأمرون بمعروف، ولاينهون عن منكر، إِلا على سبيل الاتفاق، أو لما لهم فيه من المقاصد إِلى غيره، ويكون في غاية الإفك والفجور في أقوالهم وأفعالهم، كما قال تعالى\n{ هَلْ أُنَبِّئُكُمْ عَلَىٰ مَن تَنَزَّلُ ٱلشَّيَـٰطِينُ تَنَزَّلُ عَلَىٰ كُلِّ أَفَّاكٍ أَثِيمٍ }\nالشعراء 221 ــــ 222 الآية، وهذا بخلاف حال الأنبياء عليهم الصلاة والسلام، فإِنهم في غاية البر والصدق والرشد والاستقامة والعدل فيما يقولونه ويفعلونه، ويأمرون به وينهون عنه، مع ما يؤيدون به من الخوارق للعادات، والأدلة الواضحات، والبراهين الباهرات، فصلوات الله وسلامه عليهم دائماً مستمراً ما دامت الأرض والسموات.\n                                    ",
        "qortoby": "مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّ‍ۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا ٠٤\n                                    \n                                    \n                                    فيه ثلاث مسائل:\n\nالأولى: لما تزوج زينب قال الناس: تزوّج امرأة ابنه؛ فنزلت الآية؛ أي ليس هو بابنه حتى تحرم عليه حليلته، ولكنه أبو أمّته في التبجيل والتعظيم، وأن نساءه عليهم حرام. فأذهب الله بهذه الآية ما وقع في نفوس المنافقين وغيرهم، وأعلم أن محمداً لم يكن أبا أحد من الرجال المعاصرين له في الحقيقة. ولم يقصد بهذه الآية أن النبيّ صلى الله عليه وسلم لم يكن له ولد، فقد ولد له ذكور: إبراهيم، والقاسم، والطيّب، والمطهّر؛ ولكن لم يعش له ابن حتى يصير رجلاً. وأما الحسن والحسين فكانا طفلين، ولم يكونا رجلين معاصرَيْنِ له.\n\nالثانية: قوله تعالى: { وَلَـٰكِن رَّسُولَ ٱللَّهِ } قال الأخفش والفرّاء: أي ولكن كان رسول الله. وأجازا «ولكنْ رسولُ الله وخاتَمُ» بالرفع. وكذلك قرأ ابن أبي عَبْلة وبعض الناس «ولكِنْ رسولُ اللَّهِ» بالرفع؛ على معنى هو رسول الله وخاتم النبيين. وقرأت فرقة «ولكنّ» بتشديد النون، ونصب «رسول الله» على أنه اسم «لكنّ» والخبر محذوف. «وَخَاتَمَ» قرأ عاصم وحده بفتح التاء، بمعنى أنهم به خُتموا؛ فهو كالخاتَم والطابَع لهم. وقرأ الجمهور بكسر التاء بمعنى أنه ختمهم؛ أي جاء آخرهم. وقيل: الخاتم والخاتِم لغتان؛ مثل طابَع وطابِع، ودانَق ودانِق، وطابَق من اللحم وطابِق.\n\nالثالثة: قال ابن عطية: هذه الألفاظ عند جماعة علماء الأمّة خَلَفاً وسلَفاً متلقّاةً على العموم التام مقتضية نصًّا أنه لا نبيّ بعده صلى الله عليه وسلم. وما ذكره القاضي أبو الطيِّب في كتابه المسمّى بالهداية: من تجويز الاحتمال في ألفاظ هذه الآية ضعيف. وما ذكره الغزالي في هذه الآية، وهذا المعنى في كتابه الذي سمّاه بالاقتصاد، إلحاد عندي، وتطرّق خبيث إلى تشويش عقيدة المسلمين في ختم محمد صلى الله عليه وسلم النبوّة؛ فالحذرَ الحذَر منه! والله الهادي برحمته.\n\nقلت: وقد روي عن النبيّ صلى الله عليه وسلم أنه قال: \" لا نبوّة بعدي إلا ما شاء الله \" قال أبو عمر: يعني الرؤيا ـ والله أعلم ـ التي هي جزء منها؛ كما قال عليه السلام: \" ليس يبقى بعدي من النبوّة إلا الرؤيا الصالحة \" وقرأ ابن مسعود «من رجالكم ولكن نبيًّا ختم النبيين». قال الرُّمّاني: ختم به عليه الصلاة والسلام الاستصلاح، فمن لم يصلح به فميؤوس من صلاحه.\n\nقلت: ومن هذا المعنى قوله عليه السلام: \" بعثت لأتمِّم مَكارم الأخلاق \" وفي صحيح مسلم عن جابر قال: قال رسول الله صلى الله عليه وسلم: \" مَثَلي ومَثَلُ الأنبياء كمَثَل رجل بنى داراً فأتمها وأكملها إلا موضع لَبِنة فجعل الناس يدخلونها ويتعجبّون منها ويقولون لولا موضِعُ اللَّبِنة! ـ قال رسول الله صلى الله عليه وسلم ـ فأنا موضع اللّبِنة جئت فختمتُ الأنبياء \" ونحوه عن أبي هريرة، \" غير أنه قال: فأنا اللّبِنة وأنا خاتَم النبيين \". \n                                    ",
        "saadi": "مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّ‍ۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا ٠٤\n                                        \n                                        \n                                        \n                                        أي: لم يكن الرسول { مُحَمَّدٌ } صلى اللّه عليه وسلم { أَبَآ أَحَدٍ مِّن رِّجَالِكُمْ } أيها الأمة فقطع انتساب زيد بن حارثة منه، من هذا الباب. ولما كان هذا النفي عاماً في جميع الأحوال، إن حمل ظاهر اللفظ على ظاهره، أي: لا أبوة نسب، ولا أبوة ادعاء، وقد كان تقرر فيما تقدم أن الرسول صلى اللّه عليه وسلم أب للمؤمنين كلهم، وأزواجه أمهاتهم، فاحترز أن يدخل في هذا النوع بعموم النهي المذكور، فقال: { وَلَـٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّينَ } أي: هذه مرتبته مرتبة المطاع المتبوع، المهتدى به، المؤمن له، الذي يجب تقديم محبته، على محبة كل أحد، الناصح الذي لهم، أي: للمؤمنين، من بره [ونصحه]، كأنه أبٌ لهم. { وَكَانَ ٱللَّهُ بِكُلِّ شَيْءٍ عَلِيماً } أي: قد أحاط علمه بجميع الأشياء، ويعلم حيث يجعل رسالاته، ومَنْ يصلح لفضله ومَنْ لا يصلح.\n                                    "
      },
      "originalText": "مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّ‍ۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا ٠٤"
    },
    {
      "number": 3574,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 41,
      "juz": 22,
      "manzil": 5,
      "page": 423,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ ٱللَّهَ ذِكۡرٗا كَثِيرٗا ١٤\n                                    \n                                    \n                                    يقول تعالى آمراً عباده المؤمنين بكثرة ذكرهم لربهم تبارك وتعالى المنعم عليهم بأنواع النعم، وصنوف المنن لما لهم في ذلك من جزيل الثواب، وجميل المآب. قال الإمام أحمد حدثنا يحيى بن سعيد عن عبد الله بن سعيد، حدثني مولى ابن عياش عن أبي بحرية عن أبي الدرداء رضي الله عنه، قال قال رسول الله صلى الله عليه وسلم \" ألا أنبئكم بخير أعمالكم، وأزكاها عند مليككم، وأرفعها في درجاتكم، وخير لكم من إِعطاء الذهب والورق، وخير لكم من أن تلقوا عدوكم، فتضربوا أعناقهم ويضربوا أعناقكم؟ \" قالوا وما هو يا رسول الله؟ قال صلى الله عليه وسلم \" ذكر الله عز وجل \" وهكذا رواه الترمذي وابن ماجه من حديث عبد الله بن سعيد بن أبي هند عن زياد مولى ابن عياش عن أبي بحرية - واسمه عبد الله بن قيس التراغمي - عن أبي الدرداء رضي الله عنه به، قال الترمذي رواه بعضهم عنه فأرسله. قلت وقد تقدم هذا الحديث عند قوله تعالى\n{ وَٱلذَّاكِـرِينَ ٱللَّهَ كَثِيراً وَٱلذَّاكِرَاتِ }\nالأحزاب 35 في مسند الإمام أحمد من حديث زياد بن أبي زياد مولى عبد الله بن عياش أنه بلغه عن معاذ بن جبل رضي الله عنه عن رسول الله صلى الله عليه وسلم بنحوه، فالله أعلم. وقال الإمام أحمد حدثنا وكيع، حدثنا فرج بن فضالة عن أبي سعيد الحمصي قال سمعت أبا هريرة رضي الله عنه يقول دعاء سمعته من رسول الله صلى الله عليه وسلم لا أدعه \" اللهم اجعلني أعظم شكرك، وأتبع نصيحتك، وأكثر ذكرك، وأحفظ وصيتك \" ورواه الترمذي عن يحيى بن موسى عن وكيع عن أبي فضالة الفرج بن فضالة عن أبي سعيد الحمصي عن أبي هريرة رضي الله عنه، فذكر مثله، وقال غريب، وهكذا رواه الإمام أحمد أيضاً عن أبي النضر هاشم بن القاسم عن فرج بن فضالة عن أبي سعيد المري عن أبي هريرة رضي الله عنه، فذكره. وقال الإمام أحمد حدثنا عبد الرحمن بن مهدي عن معاوية بن صالح عن عمرو بن قيس قال سمعت عبد الله بن بسر يقول جاء أعرابيان إِلى رسول الله صلى الله عليه وسلم فقال أحدهما يارسول الله أي الناس خير؟ قال صلى الله عليه وسلم \" من طال عمره، وحسن عمله \" وقال الآخر يا رسول الله إِن شرائع الإسلام قد كثرت علينا، فمرني بأمر أتشبث به، قال صلى الله عليه وسلم \" لايزال لسانك رطباً بذكر الله تعالى \" وروى الترمذي وابن ماجه الفصل الثاني من حديث معاوية بن صالح به، وقال الترمذي حديث حسن غريب.\n                                   وقال الإمام أحمد حدثنا سريج، حدثنا ابن وهب عن عمرو بن الحارث قال إِن دراجاً أبا السمح حدثه عن أبي الهيثم عن أبي سعيد الخدري رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم قال \" أكثروا ذكر الله تعالى حتى يقولوا مجنون \" وقال الطبراني حدثنا عبد الله بن أحمد، حدثنا عقبة بن مكرم العمي، حدثنا سعيد بن سفيان الجحدري، حدثنا الحسن بن أبي جعفر عن عقبة بن أبي ثبيت الراسبي عن أبي الجوزاء عن ابن عباس رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" اذكروا الله ذكراً كثيراً حتى يقول المنافقون إِنكم تراؤون \". وقال الإمام أحمد حدثنا أبو سعيد مولى بني هاشم، حدثنا شداد أبو طلحة الراسبي، سمعت أبا الوازع جابر بن عمرو يحدث عن عبد الله بن عمرو رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" ما من قوم جلسوا مجلساً لم يذكروا الله تعالى فيه، إلا رأوه حسرة يوم القيامة \" وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما في قوله تعالى { ٱذْكُرُواْ ٱللَّهَ ذِكْراً كَثِيراً } إن الله تعالى لم يفرض على عباده فريضة إلا جعل لها حداً معلوماً، ثم عذر أهلها في حال العذر، غير الذكر، فإن الله تعالى لم يجعل له حداً ينتهي إليه، ولم يعذر أحداً في تركه، إلا مغلوباً على تركه، فقال\n{ فَٱذْكُرُواْ ٱللَّهَ قِيَاماً وَقُعُوداً وَعَلَىٰ جُنُوبِكُمْ }\nالنساء103 بالليل والنهار، في البر والبحر، وفي السفر والحضر، والغنى والفقر، والسقم والصحة، والسر والعلانية، وعلى كل حال. وقال عز وجل { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } فإذا فعلتم ذلك، صلى عليكم هو وملائكته، والأحاديث والآيات والآثار في الحث على ذكر الله تعالى كثيرة جداً، وفي هذه الآية الكريمة الحث على الإكثار من ذلك. وقد صنف الناس في الأذكار المتعلقة بآناء الليل والنهار كالنسائي والمعمري وغيرهما. ومن أحسن الكتب المؤلفة في ذلك كتاب \" الأذكار \" للشيخ محيي الدين النووي رحمه الله. وقوله تعالى { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } أي عند الصباح والمساء كقوله عز وجل\n{ فَسُبْحَانَ ٱللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ وَلَهُ ٱلْحَمْدُ فِى ٱلسَّمَـٰوَٰتِ وَٱلأَرْضِ وَعَشِيّاً وَحِينَ تُظْهِرُونَ }\nالروم 17 ــــ 18 وقوله تعالى { هُوَ ٱلَّذِي يُصَلِّي عَلَيْكُمْ وَمَلاَئِكَتُهُ } هذا تهييج إلى الذكر، أي إنه سبحانه يذكركم، فاذكروه أنتم كقوله عز وجل\n{ فَٱذْكُرُونِىۤ أَذْكُرْكُمْ وَٱشْكُرُواْ لِي وَلاَ تَكْفُرُونِ }\nالبقرة152 وقال النبي صلى الله عليه وسلم \" يقول الله تعالى من ذكرني في نفسه، ذكرته في نفسي، ومن ذكرني في ملأ، ذكرته في ملأ خير منه \" والصلاة من الله تعالى ثناؤه على العبد عند الملائكة، حكاه البخاري عن أبي العالية، ورواه أبو جعفر الرازي عن الربيع بن أنس عنه، وقال غيره الصلاة من الله عز وجل الرحمة.\n                                   وقد يقال لا منافاة بين القولين، والله أعلم. وأما الصلاة من الملائكة، فبمعنى الدعاء للناس والاستغفار كقوله تبارك وتعالى\n{ ٱلَّذِينَ يَحْمِلُونَ ٱلْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ ءَامَنُواْ رَبَّنَا وَسِعْتَ كُـلَّ شَىْءٍ رَّحْمَةً وَعِلْماً فَٱغْفِرْ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ رَبَّنَا وَأَدْخِلْهُمْ جَنَّـٰتِ عَدْنٍ ٱلَّتِى وَعَدْتَّهُمْ وَمَن صَـلَحَ مِنْ ءَابَآئِهِمْ وَأَزْوَٰجِهِمْ وَذُرِّيَّـٰتِهِمْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ وَقِهِمُ ٱلسَّيِّئَـٰتِ }\nغافر 7 ــــ 9 الآية. وقوله تعالى { لِيُخْرِجَكُمْ مِّنَ ٱلظُّلُمَاتِ إِلَى ٱلنُّورِ } أي بسبب رحمته بكم، وثنائه عليكم، ودعاء ملائكته لكم، يخرجكم من ظلمات الجهل والضلال إلى نور الهدى واليقين { وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيماً } أي في الدنيا والآخرة، أما في الدنيا، فإنه هداهم إلى الحق الذي جهله غيرهم، وبصرهم الطريق الذي ضل عنه وحاد عنه مَنْ سواهم من الدعاة إلى الكفر أو البدعة، وأتباعهم من الطغاة، وأما رحمته بهم في الآخرة، فآمنهم من الفزع الأكبر، وأمر ملائكته يتلقونهم بالبشارة بالفوز بالجنة، والنجاة من النار، وما ذاك إلا لمحبته لهم، ورأفته بهم. وقال الإمام أحمد حدثنا محمد بن أبي عدي عن حميد عن أنس رضي الله عنه قال مر رسول الله صلى الله عليه وسلم في نفر من أصحابه رضي الله عنهم، وصبي في الطريق، فلما رأت أمه القوم، خشيت على ولدها أن يوطأ، فأقبلت تسعى، وتقول ابني، ابني، وسعت فأخذته، فقال القوم يا رسول الله ما كانت هذه لتلقي ابنها في النار، قال فخفضهم رسول الله صلى الله عليه وسلم وقال \" لا، واللّهُ لايلقي حبيبه في النار \" إسناده على شرط \" الصحيحين \" ، ولم يخرجه أحد من أصحاب الكتب الستة، ولكن في \" صحيح \" الإمام البخاري عن أمير المؤمنين عمر بن الخطاب رضي الله عنه أن رسول الله صلى الله عليه وسلم رأى امرأة من السبي قد أخذت صبياً لها، فألصقته إلى صدرها وأرضعته، فقال رسول الله صلى الله عليه وسلم \" أترون هذه تلقي ولدها في النار، وهي تقدر على ذلك؟ \" قالوا لا. قال رسول الله صلى الله عليه وسلم \" فوالله للّهُ أرحم بعباده من هذه بولدها \" وقوله تعالى { تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَـٰمٌ } الظاهر أن المراد ــــ والله أعلم ــــ تحيتهم، أي من الله تعالى يوم يلقونه سلام، أي يوم يسلم عليهم كما قال عز وجل\n{ سَلاَمٌ قَوْلاً مِّن رَّبٍّ رَّحِيمٍ }\nيس 58 وزعم قتادة أن المراد أنهم يحيي بعضهم بعضاً بالسلام يوم يلقون الله في الدار الآخرة، واختاره ابن جرير. قلت وقد يستدل له بقوله تعالى\n{ دَعْوَٰهُمْ فِيهَا سُبْحَـٰنَكَ ٱللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلاَمٌ وَءَاخِرُ دَعْوَاهُمْ أَنِ ٱلْحَمْدُ للَّهِ رَبِّ ٱلْعَـٰلَمِينَ }\nيونس 10. وقوله تعالى { وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا } يعني الجنة وما فيها من المآكل والمشارب، والملابس والمساكن، والمناكح والملاذ والمناظر، مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ ٱللَّهَ ذِكۡرٗا كَثِيرٗا ١٤\n                                    \n                                    \n                                    أمر الله تعالى عباده بأن يذكروه ويشكروه، ويكثروا من ذلك على ما أنعم به عليهم. وجعل تعالى ذلك دون حدّ لسهولته على العبد. ولعظم الأجر فيه قال ابن عباس: لم يُعذر أحد في ترك ذكر الله إلا من غُلب على عقله. وروى أبو سعيد عن النبيّ صلى الله عليه وسلم: \" أكثروا ذكر الله حتى يقولوا مجنون \" وقيل: الذكر الكثير ما جرى على الإخلاص من القلب، والقليل ما يقع على حكم النفاق كالذكر باللسان.\n\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ ٱللَّهَ ذِكۡرٗا كَثِيرٗا ١٤\n                                        \n                                        \n                                        \n                                        يأمر تعالى المؤمنين بذكره ذكراً كثيراً، من تهليل وتحميد وتسبيح وتكبير وغير ذلك، من كل قول فيه قربة إلى اللّه، وأقل ذلك، أن يلازم الإنسان أوراد الصباح، والمساء، وأدبار الصلوات الخمس، وعند العوارض والأسباب. وينبغي مداومة ذلك في جميع الأوقات، على جميع الأحوال، فإن ذلك عبادة يسبق بها العامل وهو مستريح، وداع إلى محبة اللّه ومعرفته، وعون على الخير، وكف اللسان عن الكلام القبيح. { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } أي: أول النهار وآخره، لفضلها وشرفها، وسهولة العمل فيها. أي: من رحمته بالمؤمنين ولطفه بهم، أن جعل من صلاته عليهم وثنائه، وصلاة ملائكته ودعائهم، ما يخرجهم من ظلمات الذنوب والجهل، إلى نور الإيمان والتوفيق والعلم والعمل، فهذه أعظم نعمة أنعم بها على العباد الطائعين، تستدعي منهم شكرها، والإكثار من ذكر اللّه، الذي لطف بهم ورحمهم، وجعل حملة عرشه أفضل الملائكة، ومن حوله يسبحون بحمد ربهم ويستغفرون للذين آمنوا فيقولون:\n{ رَبَّنَا وَسِعْتَ كُـلَّ شَيْءٍ رَّحْمَةً وَعِلْماً فَٱغْفِرْ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ * رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ ٱلَّتِي وَعَدْتَّهُمْ وَمَن صَـلَحَ مِنْ آبَآئِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ * وَقِهِمُ ٱلسَّيِّئَاتِ وَمَن تَقِ ٱلسَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ }\n[غافر: 7-9]. فهذه رحمته ونعمته عليهم في الدنيا. وأما رحمته بهم في الآخرة، فأجل رحمة، وأفضل ثواب، وهو الفوز برضا ربهم، وتحيته، واستماع كلامه الجليل، ورؤية وجهه الجميل، وحصول الأجر الكبير، الذي لا يدري ولا يعرف كنهه، إلا مَنْ أعطاهم إياه، ولهذا قال: { تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلاَمٌ وَأَعَدَّ لَهُمْ أَجْراً كَرِيماً }.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ ٱللَّهَ ذِكۡرٗا كَثِيرٗا ١٤"
    },
    {
      "number": 3575,
      "text": "وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 42,
      "juz": 22,
      "manzil": 5,
      "page": 423,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا ٢٤\n                                    \n                                    \n                                    يقول تعالى آمراً عباده المؤمنين بكثرة ذكرهم لربهم تبارك وتعالى المنعم عليهم بأنواع النعم، وصنوف المنن لما لهم في ذلك من جزيل الثواب، وجميل المآب. قال الإمام أحمد حدثنا يحيى بن سعيد عن عبد الله بن سعيد، حدثني مولى ابن عياش عن أبي بحرية عن أبي الدرداء رضي الله عنه، قال قال رسول الله صلى الله عليه وسلم \" ألا أنبئكم بخير أعمالكم، وأزكاها عند مليككم، وأرفعها في درجاتكم، وخير لكم من إِعطاء الذهب والورق، وخير لكم من أن تلقوا عدوكم، فتضربوا أعناقهم ويضربوا أعناقكم؟ \" قالوا وما هو يا رسول الله؟ قال صلى الله عليه وسلم \" ذكر الله عز وجل \" وهكذا رواه الترمذي وابن ماجه من حديث عبد الله بن سعيد بن أبي هند عن زياد مولى ابن عياش عن أبي بحرية - واسمه عبد الله بن قيس التراغمي - عن أبي الدرداء رضي الله عنه به، قال الترمذي رواه بعضهم عنه فأرسله. قلت وقد تقدم هذا الحديث عند قوله تعالى\n{ وَٱلذَّاكِـرِينَ ٱللَّهَ كَثِيراً وَٱلذَّاكِرَاتِ }\nالأحزاب 35 في مسند الإمام أحمد من حديث زياد بن أبي زياد مولى عبد الله بن عياش أنه بلغه عن معاذ بن جبل رضي الله عنه عن رسول الله صلى الله عليه وسلم بنحوه، فالله أعلم. وقال الإمام أحمد حدثنا وكيع، حدثنا فرج بن فضالة عن أبي سعيد الحمصي قال سمعت أبا هريرة رضي الله عنه يقول دعاء سمعته من رسول الله صلى الله عليه وسلم لا أدعه \" اللهم اجعلني أعظم شكرك، وأتبع نصيحتك، وأكثر ذكرك، وأحفظ وصيتك \" ورواه الترمذي عن يحيى بن موسى عن وكيع عن أبي فضالة الفرج بن فضالة عن أبي سعيد الحمصي عن أبي هريرة رضي الله عنه، فذكر مثله، وقال غريب، وهكذا رواه الإمام أحمد أيضاً عن أبي النضر هاشم بن القاسم عن فرج بن فضالة عن أبي سعيد المري عن أبي هريرة رضي الله عنه، فذكره. وقال الإمام أحمد حدثنا عبد الرحمن بن مهدي عن معاوية بن صالح عن عمرو بن قيس قال سمعت عبد الله بن بسر يقول جاء أعرابيان إِلى رسول الله صلى الله عليه وسلم فقال أحدهما يارسول الله أي الناس خير؟ قال صلى الله عليه وسلم \" من طال عمره، وحسن عمله \" وقال الآخر يا رسول الله إِن شرائع الإسلام قد كثرت علينا، فمرني بأمر أتشبث به، قال صلى الله عليه وسلم \" لايزال لسانك رطباً بذكر الله تعالى \" وروى الترمذي وابن ماجه الفصل الثاني من حديث معاوية بن صالح به، وقال الترمذي حديث حسن غريب.\n                                   وقال الإمام أحمد حدثنا سريج، حدثنا ابن وهب عن عمرو بن الحارث قال إِن دراجاً أبا السمح حدثه عن أبي الهيثم عن أبي سعيد الخدري رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم قال \" أكثروا ذكر الله تعالى حتى يقولوا مجنون \" وقال الطبراني حدثنا عبد الله بن أحمد، حدثنا عقبة بن مكرم العمي، حدثنا سعيد بن سفيان الجحدري، حدثنا الحسن بن أبي جعفر عن عقبة بن أبي ثبيت الراسبي عن أبي الجوزاء عن ابن عباس رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" اذكروا الله ذكراً كثيراً حتى يقول المنافقون إِنكم تراؤون \". وقال الإمام أحمد حدثنا أبو سعيد مولى بني هاشم، حدثنا شداد أبو طلحة الراسبي، سمعت أبا الوازع جابر بن عمرو يحدث عن عبد الله بن عمرو رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" ما من قوم جلسوا مجلساً لم يذكروا الله تعالى فيه، إلا رأوه حسرة يوم القيامة \" وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما في قوله تعالى { ٱذْكُرُواْ ٱللَّهَ ذِكْراً كَثِيراً } إن الله تعالى لم يفرض على عباده فريضة إلا جعل لها حداً معلوماً، ثم عذر أهلها في حال العذر، غير الذكر، فإن الله تعالى لم يجعل له حداً ينتهي إليه، ولم يعذر أحداً في تركه، إلا مغلوباً على تركه، فقال\n{ فَٱذْكُرُواْ ٱللَّهَ قِيَاماً وَقُعُوداً وَعَلَىٰ جُنُوبِكُمْ }\nالنساء103 بالليل والنهار، في البر والبحر، وفي السفر والحضر، والغنى والفقر، والسقم والصحة، والسر والعلانية، وعلى كل حال. وقال عز وجل { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } فإذا فعلتم ذلك، صلى عليكم هو وملائكته، والأحاديث والآيات والآثار في الحث على ذكر الله تعالى كثيرة جداً، وفي هذه الآية الكريمة الحث على الإكثار من ذلك. وقد صنف الناس في الأذكار المتعلقة بآناء الليل والنهار كالنسائي والمعمري وغيرهما. ومن أحسن الكتب المؤلفة في ذلك كتاب \" الأذكار \" للشيخ محيي الدين النووي رحمه الله. وقوله تعالى { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } أي عند الصباح والمساء كقوله عز وجل\n{ فَسُبْحَانَ ٱللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ وَلَهُ ٱلْحَمْدُ فِى ٱلسَّمَـٰوَٰتِ وَٱلأَرْضِ وَعَشِيّاً وَحِينَ تُظْهِرُونَ }\nالروم 17 ــــ 18 وقوله تعالى { هُوَ ٱلَّذِي يُصَلِّي عَلَيْكُمْ وَمَلاَئِكَتُهُ } هذا تهييج إلى الذكر، أي إنه سبحانه يذكركم، فاذكروه أنتم كقوله عز وجل\n{ فَٱذْكُرُونِىۤ أَذْكُرْكُمْ وَٱشْكُرُواْ لِي وَلاَ تَكْفُرُونِ }\nالبقرة152 وقال النبي صلى الله عليه وسلم \" يقول الله تعالى من ذكرني في نفسه، ذكرته في نفسي، ومن ذكرني في ملأ، ذكرته في ملأ خير منه \" والصلاة من الله تعالى ثناؤه على العبد عند الملائكة، حكاه البخاري عن أبي العالية، ورواه أبو جعفر الرازي عن الربيع بن أنس عنه، وقال غيره الصلاة من الله عز وجل الرحمة.\n                                   وقد يقال لا منافاة بين القولين، والله أعلم. وأما الصلاة من الملائكة، فبمعنى الدعاء للناس والاستغفار كقوله تبارك وتعالى\n{ ٱلَّذِينَ يَحْمِلُونَ ٱلْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ ءَامَنُواْ رَبَّنَا وَسِعْتَ كُـلَّ شَىْءٍ رَّحْمَةً وَعِلْماً فَٱغْفِرْ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ رَبَّنَا وَأَدْخِلْهُمْ جَنَّـٰتِ عَدْنٍ ٱلَّتِى وَعَدْتَّهُمْ وَمَن صَـلَحَ مِنْ ءَابَآئِهِمْ وَأَزْوَٰجِهِمْ وَذُرِّيَّـٰتِهِمْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ وَقِهِمُ ٱلسَّيِّئَـٰتِ }\nغافر 7 ــــ 9 الآية. وقوله تعالى { لِيُخْرِجَكُمْ مِّنَ ٱلظُّلُمَاتِ إِلَى ٱلنُّورِ } أي بسبب رحمته بكم، وثنائه عليكم، ودعاء ملائكته لكم، يخرجكم من ظلمات الجهل والضلال إلى نور الهدى واليقين { وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيماً } أي في الدنيا والآخرة، أما في الدنيا، فإنه هداهم إلى الحق الذي جهله غيرهم، وبصرهم الطريق الذي ضل عنه وحاد عنه مَنْ سواهم من الدعاة إلى الكفر أو البدعة، وأتباعهم من الطغاة، وأما رحمته بهم في الآخرة، فآمنهم من الفزع الأكبر، وأمر ملائكته يتلقونهم بالبشارة بالفوز بالجنة، والنجاة من النار، وما ذاك إلا لمحبته لهم، ورأفته بهم. وقال الإمام أحمد حدثنا محمد بن أبي عدي عن حميد عن أنس رضي الله عنه قال مر رسول الله صلى الله عليه وسلم في نفر من أصحابه رضي الله عنهم، وصبي في الطريق، فلما رأت أمه القوم، خشيت على ولدها أن يوطأ، فأقبلت تسعى، وتقول ابني، ابني، وسعت فأخذته، فقال القوم يا رسول الله ما كانت هذه لتلقي ابنها في النار، قال فخفضهم رسول الله صلى الله عليه وسلم وقال \" لا، واللّهُ لايلقي حبيبه في النار \" إسناده على شرط \" الصحيحين \" ، ولم يخرجه أحد من أصحاب الكتب الستة، ولكن في \" صحيح \" الإمام البخاري عن أمير المؤمنين عمر بن الخطاب رضي الله عنه أن رسول الله صلى الله عليه وسلم رأى امرأة من السبي قد أخذت صبياً لها، فألصقته إلى صدرها وأرضعته، فقال رسول الله صلى الله عليه وسلم \" أترون هذه تلقي ولدها في النار، وهي تقدر على ذلك؟ \" قالوا لا. قال رسول الله صلى الله عليه وسلم \" فوالله للّهُ أرحم بعباده من هذه بولدها \" وقوله تعالى { تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَـٰمٌ } الظاهر أن المراد ــــ والله أعلم ــــ تحيتهم، أي من الله تعالى يوم يلقونه سلام، أي يوم يسلم عليهم كما قال عز وجل\n{ سَلاَمٌ قَوْلاً مِّن رَّبٍّ رَّحِيمٍ }\nيس 58 وزعم قتادة أن المراد أنهم يحيي بعضهم بعضاً بالسلام يوم يلقون الله في الدار الآخرة، واختاره ابن جرير. قلت وقد يستدل له بقوله تعالى\n{ دَعْوَٰهُمْ فِيهَا سُبْحَـٰنَكَ ٱللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلاَمٌ وَءَاخِرُ دَعْوَاهُمْ أَنِ ٱلْحَمْدُ للَّهِ رَبِّ ٱلْعَـٰلَمِينَ }\nيونس 10. وقوله تعالى { وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا } يعني الجنة وما فيها من المآكل والمشارب، والملابس والمساكن، والمناكح والملاذ والمناظر، مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.\n                                    ",
        "qortoby": "وَسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا ٢٤\n                                    \n                                    \n                                    أي اشغلوا ألسنتكم في معظم أحوالكم بالتسبيح والتهليل والتحميد والتكبير. قال مجاهد: وهذه كلمات يقولهن الطاهر والمحدِث والجنب. وقيل: ادعوه. قال جرير :\nفلا تنس تسبيح الضُّحى إن يوسفاً\t   \tدَعَا ربّه فاختاره حين سبَّحا\nوقيل: المراد صلوا لله بكرة وأصِيلاً؛ والصلاة تسمّى تسبيحاً. وخص الفجر والمغرب والعشاء بالذكر لأنها أحق بالتحريض عليها، لاتصالها بأطراف الليل. وقال قتادة والطبري: الإشارة إلى صلاة الغداة وصلاة العصر. والأصِيل: العشيّ وجمعه أصائل. والأصُل بمعنى الأصيل، وجمعه آصال؛ قاله المبرد. وقال غيره: أُصُل جمع أصيل؛ كرغيف ورغف. وقد تقدم.\n\nمسألة: هذه الآية مدنيّة، فلا تعلّق بها لمن زعم أن الصلاة إنما فرضت أوّلاً صلاتين في طرفي النهار. والرواية بذلك ضعيفة فلا التفات إليها ولا معوّل عليها. وقد مضى الكلام في كيفية فرض الصلاة وما للعلماء في ذلك في «سبحان» والحمد لله.\n\nقوله تعالى: { هُوَ ٱلَّذِي يُصَلِّي عَلَيْكُمْ } قال ابن عباس: لما نزل { إِنَّ ٱللَّهَ وَمَلاَئِكَـتَهُ يُصَلُّونَ عَلَى ٱلنَّبِيِّ } قال المهاجرون والأنصار: هذا لك يا رسول الله خاصّةً، وليس لنا فيه شيء؛ فأنزل الله تعالى هذه الآية.\n\nقلت: وهذه نعمة من الله تعالى على هذه الأمة من أكبر النعم؛ ودليل على فضلها على سائر الأمم. وقد قال:\n{ كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ }\n[آل عمران: 110]. والصلاة من الله على العبد هي رحمته له وبركته لديه. وصلاة الملائكة: دعاؤهم للمؤمنين واستغفارهم لهم؛ كما قال:\n{ وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُواْ }\n[غافر: 7] وسيأتي. وفي الحديث: أن بني إسرائيل سألوا موسى عليه السلام؛ أيُصلّي ربك جل وعز؟ فأعظم ذلك؛ فأوحى الله جل وعز: \" إن صلاتي بأن رحمتي سبقت غضبي \" ذكره النحاس. وقال ابن عطية: \" وروت فرقة أن النبي صلى الله عليه وسلم قيل له: يا رسول الله، كيف صلاة الله على عباده. قال: «سُبُّوح قُدّوس ـ رحمتي سبقت غضبي» \" واختلف في تأويل هذا القول؛ فقيل: إنه كلمة من كلام الله تعالى وهي صلاته على عباده. وقيل: سُبُّوح قُدّوس من كلام محمد صلى الله عليه وسلم، وقدّمه بين يدي نطقه باللفظ الذي هو صلاة الله وهو \" رحمتي سبقت غضبي \" من حيث فهم من السائل أنه توهّم في صلاة الله على عباده وجهاً لا يليق بالله عز وجل؛ فقدّم التنزيه والتعظيم بين يدي إخباره.\n\nقوله تعالى: { لِيُخْرِجَكُمْ مِّنَ ٱلظُّلُمَاتِ إِلَى ٱلنُّورِ } أي من الضلالة إلى الهدى. ومعنى هذا التثبيت على الهداية؛ لأنهم كانوا في وقت الخطاب على الهداية. ثم أخبر تعالى برحمته بالمؤمنين تأنيساً لهم فقال: { وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيماً }.\n                                    ",
        "saadi": "وَسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا ٢٤\n                                        \n                                        \n                                        \n                                        يأمر تعالى المؤمنين بذكره ذكراً كثيراً، من تهليل وتحميد وتسبيح وتكبير وغير ذلك، من كل قول فيه قربة إلى اللّه، وأقل ذلك، أن يلازم الإنسان أوراد الصباح، والمساء، وأدبار الصلوات الخمس، وعند العوارض والأسباب. وينبغي مداومة ذلك في جميع الأوقات، على جميع الأحوال، فإن ذلك عبادة يسبق بها العامل وهو مستريح، وداع إلى محبة اللّه ومعرفته، وعون على الخير، وكف اللسان عن الكلام القبيح. { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } أي: أول النهار وآخره، لفضلها وشرفها، وسهولة العمل فيها. أي: من رحمته بالمؤمنين ولطفه بهم، أن جعل من صلاته عليهم وثنائه، وصلاة ملائكته ودعائهم، ما يخرجهم من ظلمات الذنوب والجهل، إلى نور الإيمان والتوفيق والعلم والعمل، فهذه أعظم نعمة أنعم بها على العباد الطائعين، تستدعي منهم شكرها، والإكثار من ذكر اللّه، الذي لطف بهم ورحمهم، وجعل حملة عرشه أفضل الملائكة، ومن حوله يسبحون بحمد ربهم ويستغفرون للذين آمنوا فيقولون:\n{ رَبَّنَا وَسِعْتَ كُـلَّ شَيْءٍ رَّحْمَةً وَعِلْماً فَٱغْفِرْ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ * رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ ٱلَّتِي وَعَدْتَّهُمْ وَمَن صَـلَحَ مِنْ آبَآئِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ * وَقِهِمُ ٱلسَّيِّئَاتِ وَمَن تَقِ ٱلسَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ }\n[غافر: 7-9]. فهذه رحمته ونعمته عليهم في الدنيا. وأما رحمته بهم في الآخرة، فأجل رحمة، وأفضل ثواب، وهو الفوز برضا ربهم، وتحيته، واستماع كلامه الجليل، ورؤية وجهه الجميل، وحصول الأجر الكبير، الذي لا يدري ولا يعرف كنهه، إلا مَنْ أعطاهم إياه، ولهذا قال: { تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلاَمٌ وَأَعَدَّ لَهُمْ أَجْراً كَرِيماً }.\n                                    "
      },
      "originalText": "وَسَبِّحُوهُ بُكۡرَةٗ وَأَصِيلًا ٢٤"
    },
    {
      "number": 3576,
      "text": "هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 43,
      "juz": 22,
      "manzil": 5,
      "page": 423,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱلَّذِي يُصَلِّي عَلَيۡكُمۡ وَمَلَٰٓئِكَتُهُۥ لِيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗا ٣٤\n                                    \n                                    \n                                    يقول تعالى آمراً عباده المؤمنين بكثرة ذكرهم لربهم تبارك وتعالى المنعم عليهم بأنواع النعم، وصنوف المنن لما لهم في ذلك من جزيل الثواب، وجميل المآب. قال الإمام أحمد حدثنا يحيى بن سعيد عن عبد الله بن سعيد، حدثني مولى ابن عياش عن أبي بحرية عن أبي الدرداء رضي الله عنه، قال قال رسول الله صلى الله عليه وسلم \" ألا أنبئكم بخير أعمالكم، وأزكاها عند مليككم، وأرفعها في درجاتكم، وخير لكم من إِعطاء الذهب والورق، وخير لكم من أن تلقوا عدوكم، فتضربوا أعناقهم ويضربوا أعناقكم؟ \" قالوا وما هو يا رسول الله؟ قال صلى الله عليه وسلم \" ذكر الله عز وجل \" وهكذا رواه الترمذي وابن ماجه من حديث عبد الله بن سعيد بن أبي هند عن زياد مولى ابن عياش عن أبي بحرية - واسمه عبد الله بن قيس التراغمي - عن أبي الدرداء رضي الله عنه به، قال الترمذي رواه بعضهم عنه فأرسله. قلت وقد تقدم هذا الحديث عند قوله تعالى\n{ وَٱلذَّاكِـرِينَ ٱللَّهَ كَثِيراً وَٱلذَّاكِرَاتِ }\nالأحزاب 35 في مسند الإمام أحمد من حديث زياد بن أبي زياد مولى عبد الله بن عياش أنه بلغه عن معاذ بن جبل رضي الله عنه عن رسول الله صلى الله عليه وسلم بنحوه، فالله أعلم. وقال الإمام أحمد حدثنا وكيع، حدثنا فرج بن فضالة عن أبي سعيد الحمصي قال سمعت أبا هريرة رضي الله عنه يقول دعاء سمعته من رسول الله صلى الله عليه وسلم لا أدعه \" اللهم اجعلني أعظم شكرك، وأتبع نصيحتك، وأكثر ذكرك، وأحفظ وصيتك \" ورواه الترمذي عن يحيى بن موسى عن وكيع عن أبي فضالة الفرج بن فضالة عن أبي سعيد الحمصي عن أبي هريرة رضي الله عنه، فذكر مثله، وقال غريب، وهكذا رواه الإمام أحمد أيضاً عن أبي النضر هاشم بن القاسم عن فرج بن فضالة عن أبي سعيد المري عن أبي هريرة رضي الله عنه، فذكره. وقال الإمام أحمد حدثنا عبد الرحمن بن مهدي عن معاوية بن صالح عن عمرو بن قيس قال سمعت عبد الله بن بسر يقول جاء أعرابيان إِلى رسول الله صلى الله عليه وسلم فقال أحدهما يارسول الله أي الناس خير؟ قال صلى الله عليه وسلم \" من طال عمره، وحسن عمله \" وقال الآخر يا رسول الله إِن شرائع الإسلام قد كثرت علينا، فمرني بأمر أتشبث به، قال صلى الله عليه وسلم \" لايزال لسانك رطباً بذكر الله تعالى \" وروى الترمذي وابن ماجه الفصل الثاني من حديث معاوية بن صالح به، وقال الترمذي حديث حسن غريب.\n                                   وقال الإمام أحمد حدثنا سريج، حدثنا ابن وهب عن عمرو بن الحارث قال إِن دراجاً أبا السمح حدثه عن أبي الهيثم عن أبي سعيد الخدري رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم قال \" أكثروا ذكر الله تعالى حتى يقولوا مجنون \" وقال الطبراني حدثنا عبد الله بن أحمد، حدثنا عقبة بن مكرم العمي، حدثنا سعيد بن سفيان الجحدري، حدثنا الحسن بن أبي جعفر عن عقبة بن أبي ثبيت الراسبي عن أبي الجوزاء عن ابن عباس رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" اذكروا الله ذكراً كثيراً حتى يقول المنافقون إِنكم تراؤون \". وقال الإمام أحمد حدثنا أبو سعيد مولى بني هاشم، حدثنا شداد أبو طلحة الراسبي، سمعت أبا الوازع جابر بن عمرو يحدث عن عبد الله بن عمرو رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" ما من قوم جلسوا مجلساً لم يذكروا الله تعالى فيه، إلا رأوه حسرة يوم القيامة \" وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما في قوله تعالى { ٱذْكُرُواْ ٱللَّهَ ذِكْراً كَثِيراً } إن الله تعالى لم يفرض على عباده فريضة إلا جعل لها حداً معلوماً، ثم عذر أهلها في حال العذر، غير الذكر، فإن الله تعالى لم يجعل له حداً ينتهي إليه، ولم يعذر أحداً في تركه، إلا مغلوباً على تركه، فقال\n{ فَٱذْكُرُواْ ٱللَّهَ قِيَاماً وَقُعُوداً وَعَلَىٰ جُنُوبِكُمْ }\nالنساء103 بالليل والنهار، في البر والبحر، وفي السفر والحضر، والغنى والفقر، والسقم والصحة، والسر والعلانية، وعلى كل حال. وقال عز وجل { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } فإذا فعلتم ذلك، صلى عليكم هو وملائكته، والأحاديث والآيات والآثار في الحث على ذكر الله تعالى كثيرة جداً، وفي هذه الآية الكريمة الحث على الإكثار من ذلك. وقد صنف الناس في الأذكار المتعلقة بآناء الليل والنهار كالنسائي والمعمري وغيرهما. ومن أحسن الكتب المؤلفة في ذلك كتاب \" الأذكار \" للشيخ محيي الدين النووي رحمه الله. وقوله تعالى { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } أي عند الصباح والمساء كقوله عز وجل\n{ فَسُبْحَانَ ٱللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ وَلَهُ ٱلْحَمْدُ فِى ٱلسَّمَـٰوَٰتِ وَٱلأَرْضِ وَعَشِيّاً وَحِينَ تُظْهِرُونَ }\nالروم 17 ــــ 18 وقوله تعالى { هُوَ ٱلَّذِي يُصَلِّي عَلَيْكُمْ وَمَلاَئِكَتُهُ } هذا تهييج إلى الذكر، أي إنه سبحانه يذكركم، فاذكروه أنتم كقوله عز وجل\n{ فَٱذْكُرُونِىۤ أَذْكُرْكُمْ وَٱشْكُرُواْ لِي وَلاَ تَكْفُرُونِ }\nالبقرة152 وقال النبي صلى الله عليه وسلم \" يقول الله تعالى من ذكرني في نفسه، ذكرته في نفسي، ومن ذكرني في ملأ، ذكرته في ملأ خير منه \" والصلاة من الله تعالى ثناؤه على العبد عند الملائكة، حكاه البخاري عن أبي العالية، ورواه أبو جعفر الرازي عن الربيع بن أنس عنه، وقال غيره الصلاة من الله عز وجل الرحمة.\n                                   وقد يقال لا منافاة بين القولين، والله أعلم. وأما الصلاة من الملائكة، فبمعنى الدعاء للناس والاستغفار كقوله تبارك وتعالى\n{ ٱلَّذِينَ يَحْمِلُونَ ٱلْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ ءَامَنُواْ رَبَّنَا وَسِعْتَ كُـلَّ شَىْءٍ رَّحْمَةً وَعِلْماً فَٱغْفِرْ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ رَبَّنَا وَأَدْخِلْهُمْ جَنَّـٰتِ عَدْنٍ ٱلَّتِى وَعَدْتَّهُمْ وَمَن صَـلَحَ مِنْ ءَابَآئِهِمْ وَأَزْوَٰجِهِمْ وَذُرِّيَّـٰتِهِمْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ وَقِهِمُ ٱلسَّيِّئَـٰتِ }\nغافر 7 ــــ 9 الآية. وقوله تعالى { لِيُخْرِجَكُمْ مِّنَ ٱلظُّلُمَاتِ إِلَى ٱلنُّورِ } أي بسبب رحمته بكم، وثنائه عليكم، ودعاء ملائكته لكم، يخرجكم من ظلمات الجهل والضلال إلى نور الهدى واليقين { وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيماً } أي في الدنيا والآخرة، أما في الدنيا، فإنه هداهم إلى الحق الذي جهله غيرهم، وبصرهم الطريق الذي ضل عنه وحاد عنه مَنْ سواهم من الدعاة إلى الكفر أو البدعة، وأتباعهم من الطغاة، وأما رحمته بهم في الآخرة، فآمنهم من الفزع الأكبر، وأمر ملائكته يتلقونهم بالبشارة بالفوز بالجنة، والنجاة من النار، وما ذاك إلا لمحبته لهم، ورأفته بهم. وقال الإمام أحمد حدثنا محمد بن أبي عدي عن حميد عن أنس رضي الله عنه قال مر رسول الله صلى الله عليه وسلم في نفر من أصحابه رضي الله عنهم، وصبي في الطريق، فلما رأت أمه القوم، خشيت على ولدها أن يوطأ، فأقبلت تسعى، وتقول ابني، ابني، وسعت فأخذته، فقال القوم يا رسول الله ما كانت هذه لتلقي ابنها في النار، قال فخفضهم رسول الله صلى الله عليه وسلم وقال \" لا، واللّهُ لايلقي حبيبه في النار \" إسناده على شرط \" الصحيحين \" ، ولم يخرجه أحد من أصحاب الكتب الستة، ولكن في \" صحيح \" الإمام البخاري عن أمير المؤمنين عمر بن الخطاب رضي الله عنه أن رسول الله صلى الله عليه وسلم رأى امرأة من السبي قد أخذت صبياً لها، فألصقته إلى صدرها وأرضعته، فقال رسول الله صلى الله عليه وسلم \" أترون هذه تلقي ولدها في النار، وهي تقدر على ذلك؟ \" قالوا لا. قال رسول الله صلى الله عليه وسلم \" فوالله للّهُ أرحم بعباده من هذه بولدها \" وقوله تعالى { تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَـٰمٌ } الظاهر أن المراد ــــ والله أعلم ــــ تحيتهم، أي من الله تعالى يوم يلقونه سلام، أي يوم يسلم عليهم كما قال عز وجل\n{ سَلاَمٌ قَوْلاً مِّن رَّبٍّ رَّحِيمٍ }\nيس 58 وزعم قتادة أن المراد أنهم يحيي بعضهم بعضاً بالسلام يوم يلقون الله في الدار الآخرة، واختاره ابن جرير. قلت وقد يستدل له بقوله تعالى\n{ دَعْوَٰهُمْ فِيهَا سُبْحَـٰنَكَ ٱللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلاَمٌ وَءَاخِرُ دَعْوَاهُمْ أَنِ ٱلْحَمْدُ للَّهِ رَبِّ ٱلْعَـٰلَمِينَ }\nيونس 10. وقوله تعالى { وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا } يعني الجنة وما فيها من المآكل والمشارب، والملابس والمساكن، والمناكح والملاذ والمناظر، مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.\n                                    ",
        "qortoby": "هُوَ ٱلَّذِي يُصَلِّي عَلَيۡكُمۡ وَمَلَٰٓئِكَتُهُۥ لِيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗا ٣٤\n                                    \n                                    \n                                    أي اشغلوا ألسنتكم في معظم أحوالكم بالتسبيح والتهليل والتحميد والتكبير. قال مجاهد: وهذه كلمات يقولهن الطاهر والمحدِث والجنب. وقيل: ادعوه. قال جرير :\nفلا تنس تسبيح الضُّحى إن يوسفاً\t   \tدَعَا ربّه فاختاره حين سبَّحا\nوقيل: المراد صلوا لله بكرة وأصِيلاً؛ والصلاة تسمّى تسبيحاً. وخص الفجر والمغرب والعشاء بالذكر لأنها أحق بالتحريض عليها، لاتصالها بأطراف الليل. وقال قتادة والطبري: الإشارة إلى صلاة الغداة وصلاة العصر. والأصِيل: العشيّ وجمعه أصائل. والأصُل بمعنى الأصيل، وجمعه آصال؛ قاله المبرد. وقال غيره: أُصُل جمع أصيل؛ كرغيف ورغف. وقد تقدم.\n\nمسألة: هذه الآية مدنيّة، فلا تعلّق بها لمن زعم أن الصلاة إنما فرضت أوّلاً صلاتين في طرفي النهار. والرواية بذلك ضعيفة فلا التفات إليها ولا معوّل عليها. وقد مضى الكلام في كيفية فرض الصلاة وما للعلماء في ذلك في «سبحان» والحمد لله.\n\nقوله تعالى: { هُوَ ٱلَّذِي يُصَلِّي عَلَيْكُمْ } قال ابن عباس: لما نزل { إِنَّ ٱللَّهَ وَمَلاَئِكَـتَهُ يُصَلُّونَ عَلَى ٱلنَّبِيِّ } قال المهاجرون والأنصار: هذا لك يا رسول الله خاصّةً، وليس لنا فيه شيء؛ فأنزل الله تعالى هذه الآية.\n\nقلت: وهذه نعمة من الله تعالى على هذه الأمة من أكبر النعم؛ ودليل على فضلها على سائر الأمم. وقد قال:\n{ كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ }\n[آل عمران: 110]. والصلاة من الله على العبد هي رحمته له وبركته لديه. وصلاة الملائكة: دعاؤهم للمؤمنين واستغفارهم لهم؛ كما قال:\n{ وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُواْ }\n[غافر: 7] وسيأتي. وفي الحديث: أن بني إسرائيل سألوا موسى عليه السلام؛ أيُصلّي ربك جل وعز؟ فأعظم ذلك؛ فأوحى الله جل وعز: \" إن صلاتي بأن رحمتي سبقت غضبي \" ذكره النحاس. وقال ابن عطية: \" وروت فرقة أن النبي صلى الله عليه وسلم قيل له: يا رسول الله، كيف صلاة الله على عباده. قال: «سُبُّوح قُدّوس ـ رحمتي سبقت غضبي» \" واختلف في تأويل هذا القول؛ فقيل: إنه كلمة من كلام الله تعالى وهي صلاته على عباده. وقيل: سُبُّوح قُدّوس من كلام محمد صلى الله عليه وسلم، وقدّمه بين يدي نطقه باللفظ الذي هو صلاة الله وهو \" رحمتي سبقت غضبي \" من حيث فهم من السائل أنه توهّم في صلاة الله على عباده وجهاً لا يليق بالله عز وجل؛ فقدّم التنزيه والتعظيم بين يدي إخباره.\n\nقوله تعالى: { لِيُخْرِجَكُمْ مِّنَ ٱلظُّلُمَاتِ إِلَى ٱلنُّورِ } أي من الضلالة إلى الهدى. ومعنى هذا التثبيت على الهداية؛ لأنهم كانوا في وقت الخطاب على الهداية. ثم أخبر تعالى برحمته بالمؤمنين تأنيساً لهم فقال: { وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيماً }.\n                                    ",
        "saadi": "هُوَ ٱلَّذِي يُصَلِّي عَلَيۡكُمۡ وَمَلَٰٓئِكَتُهُۥ لِيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗا ٣٤\n                                        \n                                        \n                                        \n                                        يأمر تعالى المؤمنين بذكره ذكراً كثيراً، من تهليل وتحميد وتسبيح وتكبير وغير ذلك، من كل قول فيه قربة إلى اللّه، وأقل ذلك، أن يلازم الإنسان أوراد الصباح، والمساء، وأدبار الصلوات الخمس، وعند العوارض والأسباب. وينبغي مداومة ذلك في جميع الأوقات، على جميع الأحوال، فإن ذلك عبادة يسبق بها العامل وهو مستريح، وداع إلى محبة اللّه ومعرفته، وعون على الخير، وكف اللسان عن الكلام القبيح. { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } أي: أول النهار وآخره، لفضلها وشرفها، وسهولة العمل فيها. أي: من رحمته بالمؤمنين ولطفه بهم، أن جعل من صلاته عليهم وثنائه، وصلاة ملائكته ودعائهم، ما يخرجهم من ظلمات الذنوب والجهل، إلى نور الإيمان والتوفيق والعلم والعمل، فهذه أعظم نعمة أنعم بها على العباد الطائعين، تستدعي منهم شكرها، والإكثار من ذكر اللّه، الذي لطف بهم ورحمهم، وجعل حملة عرشه أفضل الملائكة، ومن حوله يسبحون بحمد ربهم ويستغفرون للذين آمنوا فيقولون:\n{ رَبَّنَا وَسِعْتَ كُـلَّ شَيْءٍ رَّحْمَةً وَعِلْماً فَٱغْفِرْ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ * رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ ٱلَّتِي وَعَدْتَّهُمْ وَمَن صَـلَحَ مِنْ آبَآئِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ * وَقِهِمُ ٱلسَّيِّئَاتِ وَمَن تَقِ ٱلسَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ }\n[غافر: 7-9]. فهذه رحمته ونعمته عليهم في الدنيا. وأما رحمته بهم في الآخرة، فأجل رحمة، وأفضل ثواب، وهو الفوز برضا ربهم، وتحيته، واستماع كلامه الجليل، ورؤية وجهه الجميل، وحصول الأجر الكبير، الذي لا يدري ولا يعرف كنهه، إلا مَنْ أعطاهم إياه، ولهذا قال: { تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلاَمٌ وَأَعَدَّ لَهُمْ أَجْراً كَرِيماً }.\n                                    "
      },
      "originalText": "هُوَ ٱلَّذِي يُصَلِّي عَلَيۡكُمۡ وَمَلَٰٓئِكَتُهُۥ لِيُخۡرِجَكُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۚ وَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗا ٣٤"
    }
  ]
}