{
  "number": 424,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 3577,
      "text": "تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَامٌ ۚ وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 44,
      "juz": 22,
      "manzil": 5,
      "page": 424,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تَحِيَّتُهُمۡ يَوۡمَ يَلۡقَوۡنَهُۥ سَلَٰمٞۚ وَأَعَدَّ لَهُمۡ أَجۡرٗا كَرِيمٗا ٤٤\n                                    \n                                    \n                                    يقول تعالى آمراً عباده المؤمنين بكثرة ذكرهم لربهم تبارك وتعالى المنعم عليهم بأنواع النعم، وصنوف المنن لما لهم في ذلك من جزيل الثواب، وجميل المآب. قال الإمام أحمد حدثنا يحيى بن سعيد عن عبد الله بن سعيد، حدثني مولى ابن عياش عن أبي بحرية عن أبي الدرداء رضي الله عنه، قال قال رسول الله صلى الله عليه وسلم \" ألا أنبئكم بخير أعمالكم، وأزكاها عند مليككم، وأرفعها في درجاتكم، وخير لكم من إِعطاء الذهب والورق، وخير لكم من أن تلقوا عدوكم، فتضربوا أعناقهم ويضربوا أعناقكم؟ \" قالوا وما هو يا رسول الله؟ قال صلى الله عليه وسلم \" ذكر الله عز وجل \" وهكذا رواه الترمذي وابن ماجه من حديث عبد الله بن سعيد بن أبي هند عن زياد مولى ابن عياش عن أبي بحرية - واسمه عبد الله بن قيس التراغمي - عن أبي الدرداء رضي الله عنه به، قال الترمذي رواه بعضهم عنه فأرسله. قلت وقد تقدم هذا الحديث عند قوله تعالى\n{ وَٱلذَّاكِـرِينَ ٱللَّهَ كَثِيراً وَٱلذَّاكِرَاتِ }\nالأحزاب 35 في مسند الإمام أحمد من حديث زياد بن أبي زياد مولى عبد الله بن عياش أنه بلغه عن معاذ بن جبل رضي الله عنه عن رسول الله صلى الله عليه وسلم بنحوه، فالله أعلم. وقال الإمام أحمد حدثنا وكيع، حدثنا فرج بن فضالة عن أبي سعيد الحمصي قال سمعت أبا هريرة رضي الله عنه يقول دعاء سمعته من رسول الله صلى الله عليه وسلم لا أدعه \" اللهم اجعلني أعظم شكرك، وأتبع نصيحتك، وأكثر ذكرك، وأحفظ وصيتك \" ورواه الترمذي عن يحيى بن موسى عن وكيع عن أبي فضالة الفرج بن فضالة عن أبي سعيد الحمصي عن أبي هريرة رضي الله عنه، فذكر مثله، وقال غريب، وهكذا رواه الإمام أحمد أيضاً عن أبي النضر هاشم بن القاسم عن فرج بن فضالة عن أبي سعيد المري عن أبي هريرة رضي الله عنه، فذكره. وقال الإمام أحمد حدثنا عبد الرحمن بن مهدي عن معاوية بن صالح عن عمرو بن قيس قال سمعت عبد الله بن بسر يقول جاء أعرابيان إِلى رسول الله صلى الله عليه وسلم فقال أحدهما يارسول الله أي الناس خير؟ قال صلى الله عليه وسلم \" من طال عمره، وحسن عمله \" وقال الآخر يا رسول الله إِن شرائع الإسلام قد كثرت علينا، فمرني بأمر أتشبث به، قال صلى الله عليه وسلم \" لايزال لسانك رطباً بذكر الله تعالى \" وروى الترمذي وابن ماجه الفصل الثاني من حديث معاوية بن صالح به، وقال الترمذي حديث حسن غريب.\n                                   وقال الإمام أحمد حدثنا سريج، حدثنا ابن وهب عن عمرو بن الحارث قال إِن دراجاً أبا السمح حدثه عن أبي الهيثم عن أبي سعيد الخدري رضي الله عنه قال إِن رسول الله صلى الله عليه وسلم قال \" أكثروا ذكر الله تعالى حتى يقولوا مجنون \" وقال الطبراني حدثنا عبد الله بن أحمد، حدثنا عقبة بن مكرم العمي، حدثنا سعيد بن سفيان الجحدري، حدثنا الحسن بن أبي جعفر عن عقبة بن أبي ثبيت الراسبي عن أبي الجوزاء عن ابن عباس رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" اذكروا الله ذكراً كثيراً حتى يقول المنافقون إِنكم تراؤون \". وقال الإمام أحمد حدثنا أبو سعيد مولى بني هاشم، حدثنا شداد أبو طلحة الراسبي، سمعت أبا الوازع جابر بن عمرو يحدث عن عبد الله بن عمرو رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" ما من قوم جلسوا مجلساً لم يذكروا الله تعالى فيه، إلا رأوه حسرة يوم القيامة \" وقال علي بن أبي طلحة عن ابن عباس رضي الله عنهما في قوله تعالى { ٱذْكُرُواْ ٱللَّهَ ذِكْراً كَثِيراً } إن الله تعالى لم يفرض على عباده فريضة إلا جعل لها حداً معلوماً، ثم عذر أهلها في حال العذر، غير الذكر، فإن الله تعالى لم يجعل له حداً ينتهي إليه، ولم يعذر أحداً في تركه، إلا مغلوباً على تركه، فقال\n{ فَٱذْكُرُواْ ٱللَّهَ قِيَاماً وَقُعُوداً وَعَلَىٰ جُنُوبِكُمْ }\nالنساء103 بالليل والنهار، في البر والبحر، وفي السفر والحضر، والغنى والفقر، والسقم والصحة، والسر والعلانية، وعلى كل حال. وقال عز وجل { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } فإذا فعلتم ذلك، صلى عليكم هو وملائكته، والأحاديث والآيات والآثار في الحث على ذكر الله تعالى كثيرة جداً، وفي هذه الآية الكريمة الحث على الإكثار من ذلك. وقد صنف الناس في الأذكار المتعلقة بآناء الليل والنهار كالنسائي والمعمري وغيرهما. ومن أحسن الكتب المؤلفة في ذلك كتاب \" الأذكار \" للشيخ محيي الدين النووي رحمه الله. وقوله تعالى { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } أي عند الصباح والمساء كقوله عز وجل\n{ فَسُبْحَانَ ٱللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ وَلَهُ ٱلْحَمْدُ فِى ٱلسَّمَـٰوَٰتِ وَٱلأَرْضِ وَعَشِيّاً وَحِينَ تُظْهِرُونَ }\nالروم 17 ــــ 18 وقوله تعالى { هُوَ ٱلَّذِي يُصَلِّي عَلَيْكُمْ وَمَلاَئِكَتُهُ } هذا تهييج إلى الذكر، أي إنه سبحانه يذكركم، فاذكروه أنتم كقوله عز وجل\n{ فَٱذْكُرُونِىۤ أَذْكُرْكُمْ وَٱشْكُرُواْ لِي وَلاَ تَكْفُرُونِ }\nالبقرة152 وقال النبي صلى الله عليه وسلم \" يقول الله تعالى من ذكرني في نفسه، ذكرته في نفسي، ومن ذكرني في ملأ، ذكرته في ملأ خير منه \" والصلاة من الله تعالى ثناؤه على العبد عند الملائكة، حكاه البخاري عن أبي العالية، ورواه أبو جعفر الرازي عن الربيع بن أنس عنه، وقال غيره الصلاة من الله عز وجل الرحمة.\n                                   وقد يقال لا منافاة بين القولين، والله أعلم. وأما الصلاة من الملائكة، فبمعنى الدعاء للناس والاستغفار كقوله تبارك وتعالى\n{ ٱلَّذِينَ يَحْمِلُونَ ٱلْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ ءَامَنُواْ رَبَّنَا وَسِعْتَ كُـلَّ شَىْءٍ رَّحْمَةً وَعِلْماً فَٱغْفِرْ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ رَبَّنَا وَأَدْخِلْهُمْ جَنَّـٰتِ عَدْنٍ ٱلَّتِى وَعَدْتَّهُمْ وَمَن صَـلَحَ مِنْ ءَابَآئِهِمْ وَأَزْوَٰجِهِمْ وَذُرِّيَّـٰتِهِمْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ وَقِهِمُ ٱلسَّيِّئَـٰتِ }\nغافر 7 ــــ 9 الآية. وقوله تعالى { لِيُخْرِجَكُمْ مِّنَ ٱلظُّلُمَاتِ إِلَى ٱلنُّورِ } أي بسبب رحمته بكم، وثنائه عليكم، ودعاء ملائكته لكم، يخرجكم من ظلمات الجهل والضلال إلى نور الهدى واليقين { وَكَانَ بِٱلْمُؤْمِنِينَ رَحِيماً } أي في الدنيا والآخرة، أما في الدنيا، فإنه هداهم إلى الحق الذي جهله غيرهم، وبصرهم الطريق الذي ضل عنه وحاد عنه مَنْ سواهم من الدعاة إلى الكفر أو البدعة، وأتباعهم من الطغاة، وأما رحمته بهم في الآخرة، فآمنهم من الفزع الأكبر، وأمر ملائكته يتلقونهم بالبشارة بالفوز بالجنة، والنجاة من النار، وما ذاك إلا لمحبته لهم، ورأفته بهم. وقال الإمام أحمد حدثنا محمد بن أبي عدي عن حميد عن أنس رضي الله عنه قال مر رسول الله صلى الله عليه وسلم في نفر من أصحابه رضي الله عنهم، وصبي في الطريق، فلما رأت أمه القوم، خشيت على ولدها أن يوطأ، فأقبلت تسعى، وتقول ابني، ابني، وسعت فأخذته، فقال القوم يا رسول الله ما كانت هذه لتلقي ابنها في النار، قال فخفضهم رسول الله صلى الله عليه وسلم وقال \" لا، واللّهُ لايلقي حبيبه في النار \" إسناده على شرط \" الصحيحين \" ، ولم يخرجه أحد من أصحاب الكتب الستة، ولكن في \" صحيح \" الإمام البخاري عن أمير المؤمنين عمر بن الخطاب رضي الله عنه أن رسول الله صلى الله عليه وسلم رأى امرأة من السبي قد أخذت صبياً لها، فألصقته إلى صدرها وأرضعته، فقال رسول الله صلى الله عليه وسلم \" أترون هذه تلقي ولدها في النار، وهي تقدر على ذلك؟ \" قالوا لا. قال رسول الله صلى الله عليه وسلم \" فوالله للّهُ أرحم بعباده من هذه بولدها \" وقوله تعالى { تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَـٰمٌ } الظاهر أن المراد ــــ والله أعلم ــــ تحيتهم، أي من الله تعالى يوم يلقونه سلام، أي يوم يسلم عليهم كما قال عز وجل\n{ سَلاَمٌ قَوْلاً مِّن رَّبٍّ رَّحِيمٍ }\nيس 58 وزعم قتادة أن المراد أنهم يحيي بعضهم بعضاً بالسلام يوم يلقون الله في الدار الآخرة، واختاره ابن جرير. قلت وقد يستدل له بقوله تعالى\n{ دَعْوَٰهُمْ فِيهَا سُبْحَـٰنَكَ ٱللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلاَمٌ وَءَاخِرُ دَعْوَاهُمْ أَنِ ٱلْحَمْدُ للَّهِ رَبِّ ٱلْعَـٰلَمِينَ }\nيونس 10. وقوله تعالى { وَأَعَدَّ لَهُمْ أَجْرًا كَرِيمًا } يعني الجنة وما فيها من المآكل والمشارب، والملابس والمساكن، والمناكح والملاذ والمناظر، مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.\n                                    ",
        "qortoby": "تَحِيَّتُهُمۡ يَوۡمَ يَلۡقَوۡنَهُۥ سَلَٰمٞۚ وَأَعَدَّ لَهُمۡ أَجۡرٗا كَرِيمٗا ٤٤\n                                    \n                                    \n                                    اختلف في الضمير الذي في «يَلْقَوْنَهُ» على من يعود؛ فقيل على الله تعالى، أي كان بالمؤمنين رحيماً، فهو يؤمنهم من عذاب الله يوم القيامة. وفي ذلك اليوم يلقونه. و { تَحِيَّتُهُمْ } أي تحية بعضهم لبعض. { سَلاَمٌ } أي سلامة لنا ولكم من عذاب الله. وقيل: هذه التحية من الله تعالى؛ المعنى: فيسلّمهم من الآفات، أو يبشرهم بالأمن من المخافات { يَوْمَ يَلْقَوْنَهُ } أي يوم القيامة بعد دخول الجنة. قال معناه الزجاج؛ واستشهد بقوله جل وعز :\n{ وَتَحِيَّتُهُمْ فِيهَا سَلاَمٌ }\n[يونس: 10]. وقيل: «يَوْمَ يَلْقَوْنَهُ» أي يومَ يلقَوْن مَلَك الموت؛ وقد ورد أنه لا يقبض روح مؤمن إلا سلّم عليه. روي عن البَراء بن عازِب قال: «تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلاَمٌ» فيسلّم ملك الموت على المؤمن عند قبض روحه، لا يقبض روحه حتى يسلّم عليه.\n\n                                    ",
        "saadi": "تَحِيَّتُهُمۡ يَوۡمَ يَلۡقَوۡنَهُۥ سَلَٰمٞۚ وَأَعَدَّ لَهُمۡ أَجۡرٗا كَرِيمٗا ٤٤\n                                        \n                                        \n                                        \n                                        يأمر تعالى المؤمنين بذكره ذكراً كثيراً، من تهليل وتحميد وتسبيح وتكبير وغير ذلك، من كل قول فيه قربة إلى اللّه، وأقل ذلك، أن يلازم الإنسان أوراد الصباح، والمساء، وأدبار الصلوات الخمس، وعند العوارض والأسباب. وينبغي مداومة ذلك في جميع الأوقات، على جميع الأحوال، فإن ذلك عبادة يسبق بها العامل وهو مستريح، وداع إلى محبة اللّه ومعرفته، وعون على الخير، وكف اللسان عن الكلام القبيح. { وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً } أي: أول النهار وآخره، لفضلها وشرفها، وسهولة العمل فيها. أي: من رحمته بالمؤمنين ولطفه بهم، أن جعل من صلاته عليهم وثنائه، وصلاة ملائكته ودعائهم، ما يخرجهم من ظلمات الذنوب والجهل، إلى نور الإيمان والتوفيق والعلم والعمل، فهذه أعظم نعمة أنعم بها على العباد الطائعين، تستدعي منهم شكرها، والإكثار من ذكر اللّه، الذي لطف بهم ورحمهم، وجعل حملة عرشه أفضل الملائكة، ومن حوله يسبحون بحمد ربهم ويستغفرون للذين آمنوا فيقولون:\n{ رَبَّنَا وَسِعْتَ كُـلَّ شَيْءٍ رَّحْمَةً وَعِلْماً فَٱغْفِرْ لِلَّذِينَ تَابُواْ وَٱتَّبَعُواْ سَبِيلَكَ وَقِهِمْ عَذَابَ ٱلْجَحِيمِ * رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ ٱلَّتِي وَعَدْتَّهُمْ وَمَن صَـلَحَ مِنْ آبَآئِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ * وَقِهِمُ ٱلسَّيِّئَاتِ وَمَن تَقِ ٱلسَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ }\n[غافر: 7-9]. فهذه رحمته ونعمته عليهم في الدنيا. وأما رحمته بهم في الآخرة، فأجل رحمة، وأفضل ثواب، وهو الفوز برضا ربهم، وتحيته، واستماع كلامه الجليل، ورؤية وجهه الجميل، وحصول الأجر الكبير، الذي لا يدري ولا يعرف كنهه، إلا مَنْ أعطاهم إياه، ولهذا قال: { تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلاَمٌ وَأَعَدَّ لَهُمْ أَجْراً كَرِيماً }.\n                                    "
      },
      "originalText": "تَحِيَّتُهُمۡ يَوۡمَ يَلۡقَوۡنَهُۥ سَلَٰمٞۚ وَأَعَدَّ لَهُمۡ أَجۡرٗا كَرِيمٗا ٤٤"
    },
    {
      "number": 3578,
      "text": "يَا أَيُّهَا النَّبِيُّ إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 45,
      "juz": 22,
      "manzil": 5,
      "page": 424,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا ٥٤\n                                    \n                                    \n                                    قال الإمام أحمد حدثنا موسى بن داود، حدثنا فليح بن سليمان، حدثنا هلال بن علي عن عطاء بن يسار قال لقيت عبد الله بن عمرو بن العاص رضي الله عنهما، فقلت أخبرني عن صفة رسول الله صلى الله عليه وسلم في التوراة، قال أجل، والله إنه لموصوف في التوراة ببعض صفته في القرآن { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } وحرزاً للأميين، أنت عبدي ورسولي، سميتك المتوكل، لست بفظ ولا غليظ، ولا سخاب في الأسواق، ولا يدفع السيئة بالسيئة، ولكن يعفو ويصفح ويغفر، ولن يقبضه الله حتى يقيم به الملّة العوجاء، بأن يقولوا لا إله إلا الله، فيفتح بها أعيناً عمياً، وآذاناً صماً، وقلوباً غلفاً وقد رواه البخاري في البيوع عن محمد بن سنان عن فليح بن سليمان عن هلال بن علي به. ورواه في التفسير عن عبد الله ــــ قيل ابن رجاء، وقيل ابن صالح ــــ عن عبد العزيز بن أبي سلمة عن هلال عن عطاء بن يسار عن عبد الله بن عمرو به. ورواه ابن أبي حاتم عن أبيه عن عبد الله بن رجاء عن عبد العزيز بن أبي سلمة الماجشون به. وقال البخاري في البيوع وقال سعيد عن هلال عن عطاء عن عبد الله بن سلام رضي الله عنه وقال وهب بن منبه إِن الله تعالى أوحى إلى نبي من أنبياء بني إسرائيل يقال له شعياء أن قم في قومك بني إسرائيل، فإني منطق لسانك بوحي، وأبعث أمياً من الأميين، أبعثه مبشراً ليس بفظ ولا غليظ ولا صخاب في الأسواق، لو يمر إلى جنب سراج لم يطفئه من سكينته، ولو يمشي على القصب لم يسمع من تحت قدميه، أبعثه مبشراً ونذيراً، لا يقول الخنا، أفتح به أعيناً كمهاً، وآذاناً صماً، وقلوباً غلفاً، أسدده لكل أمر جميل، وأهب له كل خلق كريم، وأجعل السكينة لباسه، والبر شعاره، والتقوى ضميره، والحكمة منطقه، والصدق والوفاء طبيعته، والعفو والمعروف خلقه، والحق شريعته، والعدل سيرته، والهدى إمامه، والإسلام ملته، وأحمد اسمه، أهدي به بعد الضلال، وأعلم به بعد الجهالة، وأرفع به بعد الخمالة، وأعرف به بعد النكرة، وأكثر به بعد القلة، وأغني به بعد العيلة، وأجمع به بعد الفرقة، وأؤلف به بين أمم متفرقة وقلوب مختلفة، وأهواء متشتتة، وأستنقذ به فئاماً من الناس عظيمة من الهلكة، وأجعل أمته خير أمة أخرجت للناس، يأمرون بالمعروف وينهون عن المنكر، موحدين مؤمنين مخلصين مصدقين لما جاءت به رسلي، ألهمهم التسبيح والتحميد، والثناء والتكبير والتوحيد، في مساجدهم ومجالسهم ومضاجعهم ومنقلبهم ومثواهم، يصلون لي قياماً وقعوداً، ويقاتلون في سبيل الله صفوفاً وزحوفاً، ويخرجون من ديارهم ابتغاء مرضاتي ألوفاً، يطهرون الوجوه والأطراف، ويشدون الثياب في الأنصاف، قربانهم دماؤهم، وأناجيلهم في صدورهم، رهبان بالليل، ليوث بالنهار، وأجعل في أهل بيته وذريته السابقين والصديقين والشهداء والصالحين، أمته من بعده يهدون بالحق، وبه يعدلون، وأعز من نصرهم، وأؤيد من دعا لهم، وأجعل دائرة السوء على من خالفهم، أو بغى عليهم، أو أراد أن ينتزع شيئاً مما في أيديهم، أجعلهم ورثة لنبيهم، والداعية إلى ربهم، يأمرون بالمعروف وينهون عن المنكر، ويقيمون الصلاة، ويؤتون الزكاة، ويوفون بعهدهم، أختم بهم الخير الذي بدأته بأولهم، ذلك فضلي أوتيه من أشاء، وأنا ذو الفضل العظيم.\n\n                                   هكذا رواه ابن أبي حاتم عن وهب بن منبه اليماني رحمه الله. ثم قال ابن أبي حاتم حدثنا أبي، حدثنا عبد الرحمن بن صالح، حدثنا عبد الرحمن بن محمد بن عبيد الله العرزمي عن شيبان النحوي، أخبرني قتادة عن عكرمة عن ابن عباس رضي الله عنهما قال لما نزلت { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } وقد كان أمر علياً ومعاذاً رضي الله عنهما أن يسيرا إلى اليمن فقال \" انطلقا، فبشرا ولا تنفرا، ويسرا ولا تعسرا، إنه قد أنزل علي { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } \" ورواه الطبراني عن محمد بن نصر بن حميد البزاز البغدادي، عن عبد الرحمن بن صالح الأزدي، عن عبد الرحمن بن محمد بن عبيد الله العرزمي بإسناده مثله، وقال في آخره \" فإنه قد أنزل علي يا أيها النبي إنا أرسلناك شاهداً على أمتك، ومبشراً بالجنة، ونذيراً من النار، وداعياً إلى شهادة أن لا إله إلا الله بإذنه وسراجاً منيراً بالقرآن \" فقوله تعالى { شَاهِداً } أي لله بالوحدانية، وأنه لا إله غيره، وعلى الناس بأعمالهم يوم القيامة، وجئنا بك على هؤلاء شهيداً كقوله\n{ لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيدًا }\nالبقرة 143. وقوله عز وجل { وَمُبَشِّراً وَنَذِيراً } أي بشيراً للمؤمنين بجزيل الثواب، ونذيراً للكافرين من وبيل العقاب. وقوله جلت عظمته { وَدَاعِياً إِلَى ٱللَّهِ بِإِذْنِهِ } أي داعياً للخلق إلى عبادة ربهم، عن أمره لك بذلك، { وَسِرَاجاً مُّنِيراً } أي وأمرك ظاهر فيما جئت به من الحق كالشمس في إشراقها وإضاءتها، لا يجحدها إلا معاند. وقوله جل وعلا { وَلاَ تُطِعِ ٱلْكَـٰفِرِينَ وَٱلْمُنَـٰفِقِينَ وَدَعْ أَذَاهُمْ } أي لا تطعهم وتسمع منهم في الذي يقولونه، { وَدَعْ أَذَاهُمْ } أي اصفح وتجاوز عنهم، وكل أمرهم إلى الله تعالى، فإن فيه كفاية لهم، ولهذا قال جل جلاله { وَتَوَكَّلْ عَلَى ٱللَّهِ وَكَفَىٰ بِٱللَّهِ وَكِيلاً }.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا ٥٤\n                                    \n                                    \n                                    هذه الآية فيها تأنيس للنبيّ صلى الله عليه وسلم وللمؤمنين، وتكريم لجميعهم. وهذه الآية تضمنت من أسمائه صلى الله عليه وسلم ستة أسماء ولنبيّنا صلى الله عليه وسلم أسماء كثيرة وسمات جليلة، ورد ذكرها في الكتاب والسنة والكتب المتقدّمة. وقد سماه الله في كتابه محمداً وأحمد. وقال صلى الله عليه وسلم فيما روى عنه الثقات العدول: \" لِي خمسة أسماء أنا محمد وأنا أحمد وأنا الماحي الذي يمحو الله بي الكفر وأنا الحاشر الذي يحشر الناس على قدمي وأنا العاقب \" وفي صحيح مسلم من حديث جُبير بن مُطْعِم: وقد سماه الله «رَأُوفاً رَحِيماً». وفيه أيضاً عن أبي موسى الأشعريّ قال: كان رسول الله صلى الله عليه وسلم يسمِّي لنا نفسه أسماء، فيقول: \" أنا محمد وأحمد والمُقَفِّي والحاشر ونبيّ التوبة ونبيّ الرحمة \" وقد تتبع القاضي أبو الفضل عِياض في كتابه المسمّى (بالشِّفا) ما جاء في كتاب الله وفي سنة رسوله صلى الله عليه وسلم، ومما نقل في الكتب المتقدّمة، وإطلاق الأمة أسماء كثيرة وصفاتٍ عديدة، قد صدقت عليه صلى الله عليه وسلم مُسَمَّياتها، ووجدت فيه معانيها. وقد ذكر القاضي أبو بكر بن العربيّ في أحكامه في هذه الآية من أسماء النبيّ صلى الله عليه وسلم سبعة وستين اسماً. وذكر صاحب (وسيلة المتعبدين إلى متابعة سيد المرسلين) عن ابن عباس أن لمحمد صلى الله عليه وسلم مائة وثمانين اسماً، من أرادها وجدها هناك. وقال ابن عباس: لما نزلت هذه الآية \" دعا رسول الله صلى الله عليه وسلم عليًّا ومعاذاً، فبعثهما إلى اليمن، وقال: «اذهبا فبشِّرا ولا تُنَفِّرا، ويَسِّرَا ولا تُعَسِّرا فإنه قد أنزل عليّ...» وقرأ هذه الآية \". قوله تعالى: { شَاهِداً } قال سعيد عن قتادة: «شاهداً» على أمّته بالتبليغ إليهم، وعلى سائر الأمم بتبليغ أنبيائهم؛ ونحو ذلك. { وَمُبَشِّراً } معناه للمؤمنين برحمة الله وبالجنة. { وَنَذِيراً } معناه للعصاة والمكذبين من النار وعذاب الخلد. { وَدَاعِياً إِلَى ٱللَّهِ } الدعاء إلى الله هو تبليغ التوحيد والأخذ به، ومكافحة الكفرة. و { بِإِذْنِهِ } هنا معناه: بأمره إياك، وتقديره ذلك في وقته وأوانه. { وَسِرَاجاً مُّنِيراً } هنا استعارة للنور الذي يتضمنه شرعه. وقيل: «وَسِرَاجاً» أي هادياً من ظلم الضلالة؛ وأنت كالمصباح المضيء. ووصفه بالإنارة لأن من السُّرُج ما لا يضيء، إذا قَلّ سلِيطه ودَقّت فتيلته. وفي كلام بعضهم: ثلاثة تُضْنِي: رسول بطيء، وسراج لا يضيء، ومائدة ينتظر لها من يجيء. وسئل بعضهم عن الموحشَيْن فقال: ظلام ساتر وسراج فاتر، وأسند النحاس قال: حدّثنا محمد بن إبراهيم الرازي قال حدّثنا عبد الرحمن بن صالح الأزدي قال: حدّثنا عبد الرحمن بن محمد المحاربي عن شَيبان النحوي قال حدّثنا قتادة عن عكرمة\n                                    \" عن ابن عباس قال: لما نزلت { يٰأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرْسَلْنَاكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً * وَدَاعِياً إِلَى ٱللَّهِ بِإِذْنِهِ وَسِرَاجاً مُّنِيراً } دعا رسول الله صلى الله عليه وسلم عليًّا ومعاذاً فقال: «انطلقا فبشِّرا ولا تُعَسِّرَا فإنه قد نزل عليّ الليلة آية { يٰأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرْسَلْنَاكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً ـ من النار ـ وَدَاعِياً إِلَى ٱللَّهِ ـ قال ـ شهادة أن لا إلٰه إلا الله ـ بِإِذْنِهِ ـ بأمره ـ وَسِرَاجاً مُّنِيراً } ـ قال ـ بالقرآن» \" وقال الزجاج: «وسِرَاجاً» أي وذا سراج مُنير؛ أي كتاب نَيّر. وأجاز أيضاً أن يكون بمعنى: وتالياً كتاب الله.\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا ٥٤\n                                        \n                                        \n                                        \n                                        هذه الأشياء التي وصف الله بها رسوله محمداً صلى اللّه عليه وسلم، هي المقصود من رسالته وزبدتها وأصولها التي اختص بها، وهي خمسة أشياء: أحدها: كونه { شَٰهِداً } أي: شاهداً على أمته بما عملوه من خير وشر، كما قال تعالى :\n{ لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيداً }\n[ البقرة: 143 ]\n{ فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلاۤءِ شَهِيداً }\n[النساء: 41] فهو صلى اللّه عليه وسلم شاهد عدل مقبول. الثاني، والثالث: كونه { وَمُبَشِّراً وَنَذِيراً } وهذا يستلزم ذكر المبشر والمنذر، وما يبشر به وينذر، والأعمال الموجبة لذلك. فالمبشَّر هم: المؤمنون المتقون، الذين جمعوا بين الإيمان والعمل الصالح، وترك المعاصي، لهم البشرى في الحياة الدنيا، بكل ثواب دنيوي وديني، رتب على الإيمان والتقوى، وفي الأخرى بالنعيم المقيم. وذلك كله يستلزم ذكر تفصيل المذكور، من تفاصيل الأعمال، وخصال التقوى، وأنواع الثواب. والمنْذَر هم: المجرمون الظالمون، أهل الظلم والجهل، لهم النذارة في الدنيا، من العقوبات الدنيوية والدينية المترتبة على الجهل والظلم، وفي الأخرى، بالعقاب الوبيل، والعذاب الطويل. وهذه الجملة تفصيلها، ما جاء به صلى اللّه عليه وسلم من الكتاب والسُنّة، المشتمل على ذلك. الرابع: كونه { دَاعِياً إِلَى ٱللَّهِ } أي: أرسله اللّه يدعو الخلق إلى ربهم، ويسوقهم لكرامته، ويأمرهم بعبادته التي خلقوا لها، وذلك يستلزم استقامته على ما يدعو إليه، وذكر تفاصيل ما يدعو إليه، بتعريفهم لربهم بصفاته المقدسة، وتنزيهه عمّا لا يليق بجلاله، وذكر أنواع العبودية، والدعوة إلى اللّه بأقرب طريق موصل إليه، وإعطاء كل ذي حق حقه، وإخلاص الدعوة إلى اللّه، لا إلى نفسه وتعظيمها، كما قد يعرض ذلك لكثير من النفوس في هذا المقام، وذلك كله بِإِذْنِ الله تعالى له في الدعوة وأمره وإرادته وقدره. الخامس: كونه { وَسِرَاجاً مُّنِيراً } وذلك يقتضي أن الخلق في ظلمة عظيمة، لا نور، يهتدى به في ظلماتها، ولا علم يستدل به في جهالاتها، حتى جاء اللّه بهذا النبي الكريم، فأضاء اللّه به تلك الظلمات، وعلم به من الجهالات، وهدى به ضُلالاً إلى الصراط المستقيم. فأصبح أهل الاستقامة قد وضح لهم الطريق، فمشوا خلف هذا الإمام وعرفوا به الخير والشر، وأهل السعادة من أهل الشقاوة، واستناروا به، لمعرفة معبودهم، وعرفوه بأوصافه الحميدة، وأفعاله السديدة، وأحكامه الرشيدة. وقوله: { وَبَشِّرِ ٱلْمُؤْمِنِينَ بِأَنَّ لَهُمْ مِّنَ ٱللَّهِ فَضْلاً كَبِيراً } ذكر في هذه الجملة المبشَّر، وهم المؤمنون، وعند ذكر الإيمان بمفرده، تدخل فيه الأعمال الصالحة. وذكر المبشَّر به، وهو الفضل الكبير، أي: العظيم الجليل، الذي لا يقادر قدره، من النصر في الدنيا، وهداية القلوب، وغفران الذنوب، وكشف الكروب، وكثرة الأرزاق الدَّارَّة، وحصول النِعَم السارة، والفوز برضا ربهم وثوابه، والنجاة من سخطه وعقابه.\n\n                                   وهذا مما ينشط العاملين، أن يذكر لهم من ثواب اللّه على أعمالهم، ما به يستعينون على سلوك الصراط المستقيم، وهذا من جملة حكم الشرع، كما أن من حكمه، أن يذكر في مقام الترهيب، العقوبات المترتبة على ما يرهب منه، ليكون عوناً على الكف عمّا حرّم اللّه. ولما كان ثَمَّ طائفة من الناس، مستعدة للقيام بصد الداعين إلى اللّه من الرسل وأتباعهم، وهم المنافقون، الذين أظهروا الموافقة في الإيمان، وهم كفرة فجرة في الباطن، والكفار ظاهراً وباطناً، نهى اللّه رسوله عن طاعتهم، وحذره ذلك، فقال: { وَلاَ تُطِعِ ٱلْكَافِرِينَ وَٱلْمُنَافِقِينَ } أي: في كل أمر يصد عن سبيل اللّه، ولكن لا يقتضي هذا أذاهم، [بل لا تطعهم { وَدَعْ أَذَاهُمْ } ] فإن ذلك، جالب لهم، وداع إلى قبول الإسلام، وإلى كف كثير من أذيتهم له ولأهله. { وَتَوَكَّـلْ عَلَى ٱللَّهِ } في إتمام أمرك، وخذلان عدوك، { وَكَفَىٰ بِٱللَّهِ وَكِـيلاً } تُوكَلُ إليه الأمور المهمة، فيقوم بها، ويسهلها على عبده.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرۡسَلۡنَٰكَ شَٰهِدٗا وَمُبَشِّرٗا وَنَذِيرٗا ٥٤"
    },
    {
      "number": 3579,
      "text": "وَدَاعِيًا إِلَى اللَّهِ بِإِذْنِهِ وَسِرَاجًا مُنِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 46,
      "juz": 22,
      "manzil": 5,
      "page": 424,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَدَاعِيًا إِلَى ٱللَّهِ بِإِذۡنِهِۦ وَسِرَاجٗا مُّنِيرٗا ٦٤\n                                    \n                                    \n                                    قال الإمام أحمد حدثنا موسى بن داود، حدثنا فليح بن سليمان، حدثنا هلال بن علي عن عطاء بن يسار قال لقيت عبد الله بن عمرو بن العاص رضي الله عنهما، فقلت أخبرني عن صفة رسول الله صلى الله عليه وسلم في التوراة، قال أجل، والله إنه لموصوف في التوراة ببعض صفته في القرآن { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } وحرزاً للأميين، أنت عبدي ورسولي، سميتك المتوكل، لست بفظ ولا غليظ، ولا سخاب في الأسواق، ولا يدفع السيئة بالسيئة، ولكن يعفو ويصفح ويغفر، ولن يقبضه الله حتى يقيم به الملّة العوجاء، بأن يقولوا لا إله إلا الله، فيفتح بها أعيناً عمياً، وآذاناً صماً، وقلوباً غلفاً وقد رواه البخاري في البيوع عن محمد بن سنان عن فليح بن سليمان عن هلال بن علي به. ورواه في التفسير عن عبد الله ــــ قيل ابن رجاء، وقيل ابن صالح ــــ عن عبد العزيز بن أبي سلمة عن هلال عن عطاء بن يسار عن عبد الله بن عمرو به. ورواه ابن أبي حاتم عن أبيه عن عبد الله بن رجاء عن عبد العزيز بن أبي سلمة الماجشون به. وقال البخاري في البيوع وقال سعيد عن هلال عن عطاء عن عبد الله بن سلام رضي الله عنه وقال وهب بن منبه إِن الله تعالى أوحى إلى نبي من أنبياء بني إسرائيل يقال له شعياء أن قم في قومك بني إسرائيل، فإني منطق لسانك بوحي، وأبعث أمياً من الأميين، أبعثه مبشراً ليس بفظ ولا غليظ ولا صخاب في الأسواق، لو يمر إلى جنب سراج لم يطفئه من سكينته، ولو يمشي على القصب لم يسمع من تحت قدميه، أبعثه مبشراً ونذيراً، لا يقول الخنا، أفتح به أعيناً كمهاً، وآذاناً صماً، وقلوباً غلفاً، أسدده لكل أمر جميل، وأهب له كل خلق كريم، وأجعل السكينة لباسه، والبر شعاره، والتقوى ضميره، والحكمة منطقه، والصدق والوفاء طبيعته، والعفو والمعروف خلقه، والحق شريعته، والعدل سيرته، والهدى إمامه، والإسلام ملته، وأحمد اسمه، أهدي به بعد الضلال، وأعلم به بعد الجهالة، وأرفع به بعد الخمالة، وأعرف به بعد النكرة، وأكثر به بعد القلة، وأغني به بعد العيلة، وأجمع به بعد الفرقة، وأؤلف به بين أمم متفرقة وقلوب مختلفة، وأهواء متشتتة، وأستنقذ به فئاماً من الناس عظيمة من الهلكة، وأجعل أمته خير أمة أخرجت للناس، يأمرون بالمعروف وينهون عن المنكر، موحدين مؤمنين مخلصين مصدقين لما جاءت به رسلي، ألهمهم التسبيح والتحميد، والثناء والتكبير والتوحيد، في مساجدهم ومجالسهم ومضاجعهم ومنقلبهم ومثواهم، يصلون لي قياماً وقعوداً، ويقاتلون في سبيل الله صفوفاً وزحوفاً، ويخرجون من ديارهم ابتغاء مرضاتي ألوفاً، يطهرون الوجوه والأطراف، ويشدون الثياب في الأنصاف، قربانهم دماؤهم، وأناجيلهم في صدورهم، رهبان بالليل، ليوث بالنهار، وأجعل في أهل بيته وذريته السابقين والصديقين والشهداء والصالحين، أمته من بعده يهدون بالحق، وبه يعدلون، وأعز من نصرهم، وأؤيد من دعا لهم، وأجعل دائرة السوء على من خالفهم، أو بغى عليهم، أو أراد أن ينتزع شيئاً مما في أيديهم، أجعلهم ورثة لنبيهم، والداعية إلى ربهم، يأمرون بالمعروف وينهون عن المنكر، ويقيمون الصلاة، ويؤتون الزكاة، ويوفون بعهدهم، أختم بهم الخير الذي بدأته بأولهم، ذلك فضلي أوتيه من أشاء، وأنا ذو الفضل العظيم.\n\n                                   هكذا رواه ابن أبي حاتم عن وهب بن منبه اليماني رحمه الله. ثم قال ابن أبي حاتم حدثنا أبي، حدثنا عبد الرحمن بن صالح، حدثنا عبد الرحمن بن محمد بن عبيد الله العرزمي عن شيبان النحوي، أخبرني قتادة عن عكرمة عن ابن عباس رضي الله عنهما قال لما نزلت { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } وقد كان أمر علياً ومعاذاً رضي الله عنهما أن يسيرا إلى اليمن فقال \" انطلقا، فبشرا ولا تنفرا، ويسرا ولا تعسرا، إنه قد أنزل علي { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } \" ورواه الطبراني عن محمد بن نصر بن حميد البزاز البغدادي، عن عبد الرحمن بن صالح الأزدي، عن عبد الرحمن بن محمد بن عبيد الله العرزمي بإسناده مثله، وقال في آخره \" فإنه قد أنزل علي يا أيها النبي إنا أرسلناك شاهداً على أمتك، ومبشراً بالجنة، ونذيراً من النار، وداعياً إلى شهادة أن لا إله إلا الله بإذنه وسراجاً منيراً بالقرآن \" فقوله تعالى { شَاهِداً } أي لله بالوحدانية، وأنه لا إله غيره، وعلى الناس بأعمالهم يوم القيامة، وجئنا بك على هؤلاء شهيداً كقوله\n{ لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيدًا }\nالبقرة 143. وقوله عز وجل { وَمُبَشِّراً وَنَذِيراً } أي بشيراً للمؤمنين بجزيل الثواب، ونذيراً للكافرين من وبيل العقاب. وقوله جلت عظمته { وَدَاعِياً إِلَى ٱللَّهِ بِإِذْنِهِ } أي داعياً للخلق إلى عبادة ربهم، عن أمره لك بذلك، { وَسِرَاجاً مُّنِيراً } أي وأمرك ظاهر فيما جئت به من الحق كالشمس في إشراقها وإضاءتها، لا يجحدها إلا معاند. وقوله جل وعلا { وَلاَ تُطِعِ ٱلْكَـٰفِرِينَ وَٱلْمُنَـٰفِقِينَ وَدَعْ أَذَاهُمْ } أي لا تطعهم وتسمع منهم في الذي يقولونه، { وَدَعْ أَذَاهُمْ } أي اصفح وتجاوز عنهم، وكل أمرهم إلى الله تعالى، فإن فيه كفاية لهم، ولهذا قال جل جلاله { وَتَوَكَّلْ عَلَى ٱللَّهِ وَكَفَىٰ بِٱللَّهِ وَكِيلاً }.\n                                    ",
        "qortoby": "وَدَاعِيًا إِلَى ٱللَّهِ بِإِذۡنِهِۦ وَسِرَاجٗا مُّنِيرٗا ٦٤\n                                    \n                                    \n                                    هذه الآية فيها تأنيس للنبيّ صلى الله عليه وسلم وللمؤمنين، وتكريم لجميعهم. وهذه الآية تضمنت من أسمائه صلى الله عليه وسلم ستة أسماء ولنبيّنا صلى الله عليه وسلم أسماء كثيرة وسمات جليلة، ورد ذكرها في الكتاب والسنة والكتب المتقدّمة. وقد سماه الله في كتابه محمداً وأحمد. وقال صلى الله عليه وسلم فيما روى عنه الثقات العدول: \" لِي خمسة أسماء أنا محمد وأنا أحمد وأنا الماحي الذي يمحو الله بي الكفر وأنا الحاشر الذي يحشر الناس على قدمي وأنا العاقب \" وفي صحيح مسلم من حديث جُبير بن مُطْعِم: وقد سماه الله «رَأُوفاً رَحِيماً». وفيه أيضاً عن أبي موسى الأشعريّ قال: كان رسول الله صلى الله عليه وسلم يسمِّي لنا نفسه أسماء، فيقول: \" أنا محمد وأحمد والمُقَفِّي والحاشر ونبيّ التوبة ونبيّ الرحمة \" وقد تتبع القاضي أبو الفضل عِياض في كتابه المسمّى (بالشِّفا) ما جاء في كتاب الله وفي سنة رسوله صلى الله عليه وسلم، ومما نقل في الكتب المتقدّمة، وإطلاق الأمة أسماء كثيرة وصفاتٍ عديدة، قد صدقت عليه صلى الله عليه وسلم مُسَمَّياتها، ووجدت فيه معانيها. وقد ذكر القاضي أبو بكر بن العربيّ في أحكامه في هذه الآية من أسماء النبيّ صلى الله عليه وسلم سبعة وستين اسماً. وذكر صاحب (وسيلة المتعبدين إلى متابعة سيد المرسلين) عن ابن عباس أن لمحمد صلى الله عليه وسلم مائة وثمانين اسماً، من أرادها وجدها هناك. وقال ابن عباس: لما نزلت هذه الآية \" دعا رسول الله صلى الله عليه وسلم عليًّا ومعاذاً، فبعثهما إلى اليمن، وقال: «اذهبا فبشِّرا ولا تُنَفِّرا، ويَسِّرَا ولا تُعَسِّرا فإنه قد أنزل عليّ...» وقرأ هذه الآية \". قوله تعالى: { شَاهِداً } قال سعيد عن قتادة: «شاهداً» على أمّته بالتبليغ إليهم، وعلى سائر الأمم بتبليغ أنبيائهم؛ ونحو ذلك. { وَمُبَشِّراً } معناه للمؤمنين برحمة الله وبالجنة. { وَنَذِيراً } معناه للعصاة والمكذبين من النار وعذاب الخلد. { وَدَاعِياً إِلَى ٱللَّهِ } الدعاء إلى الله هو تبليغ التوحيد والأخذ به، ومكافحة الكفرة. و { بِإِذْنِهِ } هنا معناه: بأمره إياك، وتقديره ذلك في وقته وأوانه. { وَسِرَاجاً مُّنِيراً } هنا استعارة للنور الذي يتضمنه شرعه. وقيل: «وَسِرَاجاً» أي هادياً من ظلم الضلالة؛ وأنت كالمصباح المضيء. ووصفه بالإنارة لأن من السُّرُج ما لا يضيء، إذا قَلّ سلِيطه ودَقّت فتيلته. وفي كلام بعضهم: ثلاثة تُضْنِي: رسول بطيء، وسراج لا يضيء، ومائدة ينتظر لها من يجيء. وسئل بعضهم عن الموحشَيْن فقال: ظلام ساتر وسراج فاتر، وأسند النحاس قال: حدّثنا محمد بن إبراهيم الرازي قال حدّثنا عبد الرحمن بن صالح الأزدي قال: حدّثنا عبد الرحمن بن محمد المحاربي عن شَيبان النحوي قال حدّثنا قتادة عن عكرمة\n                                    \" عن ابن عباس قال: لما نزلت { يٰأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرْسَلْنَاكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً * وَدَاعِياً إِلَى ٱللَّهِ بِإِذْنِهِ وَسِرَاجاً مُّنِيراً } دعا رسول الله صلى الله عليه وسلم عليًّا ومعاذاً فقال: «انطلقا فبشِّرا ولا تُعَسِّرَا فإنه قد نزل عليّ الليلة آية { يٰأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَرْسَلْنَاكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً ـ من النار ـ وَدَاعِياً إِلَى ٱللَّهِ ـ قال ـ شهادة أن لا إلٰه إلا الله ـ بِإِذْنِهِ ـ بأمره ـ وَسِرَاجاً مُّنِيراً } ـ قال ـ بالقرآن» \" وقال الزجاج: «وسِرَاجاً» أي وذا سراج مُنير؛ أي كتاب نَيّر. وأجاز أيضاً أن يكون بمعنى: وتالياً كتاب الله.\n                                    ",
        "saadi": "وَدَاعِيًا إِلَى ٱللَّهِ بِإِذۡنِهِۦ وَسِرَاجٗا مُّنِيرٗا ٦٤\n                                        \n                                        \n                                        \n                                        هذه الأشياء التي وصف الله بها رسوله محمداً صلى اللّه عليه وسلم، هي المقصود من رسالته وزبدتها وأصولها التي اختص بها، وهي خمسة أشياء: أحدها: كونه { شَٰهِداً } أي: شاهداً على أمته بما عملوه من خير وشر، كما قال تعالى :\n{ لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيداً }\n[ البقرة: 143 ]\n{ فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلاۤءِ شَهِيداً }\n[النساء: 41] فهو صلى اللّه عليه وسلم شاهد عدل مقبول. الثاني، والثالث: كونه { وَمُبَشِّراً وَنَذِيراً } وهذا يستلزم ذكر المبشر والمنذر، وما يبشر به وينذر، والأعمال الموجبة لذلك. فالمبشَّر هم: المؤمنون المتقون، الذين جمعوا بين الإيمان والعمل الصالح، وترك المعاصي، لهم البشرى في الحياة الدنيا، بكل ثواب دنيوي وديني، رتب على الإيمان والتقوى، وفي الأخرى بالنعيم المقيم. وذلك كله يستلزم ذكر تفصيل المذكور، من تفاصيل الأعمال، وخصال التقوى، وأنواع الثواب. والمنْذَر هم: المجرمون الظالمون، أهل الظلم والجهل، لهم النذارة في الدنيا، من العقوبات الدنيوية والدينية المترتبة على الجهل والظلم، وفي الأخرى، بالعقاب الوبيل، والعذاب الطويل. وهذه الجملة تفصيلها، ما جاء به صلى اللّه عليه وسلم من الكتاب والسُنّة، المشتمل على ذلك. الرابع: كونه { دَاعِياً إِلَى ٱللَّهِ } أي: أرسله اللّه يدعو الخلق إلى ربهم، ويسوقهم لكرامته، ويأمرهم بعبادته التي خلقوا لها، وذلك يستلزم استقامته على ما يدعو إليه، وذكر تفاصيل ما يدعو إليه، بتعريفهم لربهم بصفاته المقدسة، وتنزيهه عمّا لا يليق بجلاله، وذكر أنواع العبودية، والدعوة إلى اللّه بأقرب طريق موصل إليه، وإعطاء كل ذي حق حقه، وإخلاص الدعوة إلى اللّه، لا إلى نفسه وتعظيمها، كما قد يعرض ذلك لكثير من النفوس في هذا المقام، وذلك كله بِإِذْنِ الله تعالى له في الدعوة وأمره وإرادته وقدره. الخامس: كونه { وَسِرَاجاً مُّنِيراً } وذلك يقتضي أن الخلق في ظلمة عظيمة، لا نور، يهتدى به في ظلماتها، ولا علم يستدل به في جهالاتها، حتى جاء اللّه بهذا النبي الكريم، فأضاء اللّه به تلك الظلمات، وعلم به من الجهالات، وهدى به ضُلالاً إلى الصراط المستقيم. فأصبح أهل الاستقامة قد وضح لهم الطريق، فمشوا خلف هذا الإمام وعرفوا به الخير والشر، وأهل السعادة من أهل الشقاوة، واستناروا به، لمعرفة معبودهم، وعرفوه بأوصافه الحميدة، وأفعاله السديدة، وأحكامه الرشيدة. وقوله: { وَبَشِّرِ ٱلْمُؤْمِنِينَ بِأَنَّ لَهُمْ مِّنَ ٱللَّهِ فَضْلاً كَبِيراً } ذكر في هذه الجملة المبشَّر، وهم المؤمنون، وعند ذكر الإيمان بمفرده، تدخل فيه الأعمال الصالحة. وذكر المبشَّر به، وهو الفضل الكبير، أي: العظيم الجليل، الذي لا يقادر قدره، من النصر في الدنيا، وهداية القلوب، وغفران الذنوب، وكشف الكروب، وكثرة الأرزاق الدَّارَّة، وحصول النِعَم السارة، والفوز برضا ربهم وثوابه، والنجاة من سخطه وعقابه.\n\n                                   وهذا مما ينشط العاملين، أن يذكر لهم من ثواب اللّه على أعمالهم، ما به يستعينون على سلوك الصراط المستقيم، وهذا من جملة حكم الشرع، كما أن من حكمه، أن يذكر في مقام الترهيب، العقوبات المترتبة على ما يرهب منه، ليكون عوناً على الكف عمّا حرّم اللّه. ولما كان ثَمَّ طائفة من الناس، مستعدة للقيام بصد الداعين إلى اللّه من الرسل وأتباعهم، وهم المنافقون، الذين أظهروا الموافقة في الإيمان، وهم كفرة فجرة في الباطن، والكفار ظاهراً وباطناً، نهى اللّه رسوله عن طاعتهم، وحذره ذلك، فقال: { وَلاَ تُطِعِ ٱلْكَافِرِينَ وَٱلْمُنَافِقِينَ } أي: في كل أمر يصد عن سبيل اللّه، ولكن لا يقتضي هذا أذاهم، [بل لا تطعهم { وَدَعْ أَذَاهُمْ } ] فإن ذلك، جالب لهم، وداع إلى قبول الإسلام، وإلى كف كثير من أذيتهم له ولأهله. { وَتَوَكَّـلْ عَلَى ٱللَّهِ } في إتمام أمرك، وخذلان عدوك، { وَكَفَىٰ بِٱللَّهِ وَكِـيلاً } تُوكَلُ إليه الأمور المهمة، فيقوم بها، ويسهلها على عبده.\n                                    "
      },
      "originalText": "وَدَاعِيًا إِلَى ٱللَّهِ بِإِذۡنِهِۦ وَسِرَاجٗا مُّنِيرٗا ٦٤"
    },
    {
      "number": 3580,
      "text": "وَبَشِّرِ الْمُؤْمِنِينَ بِأَنَّ لَهُمْ مِنَ اللَّهِ فَضْلًا كَبِيرًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 47,
      "juz": 22,
      "manzil": 5,
      "page": 424,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَبَشِّرِ ٱلۡمُؤۡمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضۡلٗا كَبِيرٗا ٧٤\n                                    \n                                    \n                                    قال الإمام أحمد حدثنا موسى بن داود، حدثنا فليح بن سليمان، حدثنا هلال بن علي عن عطاء بن يسار قال لقيت عبد الله بن عمرو بن العاص رضي الله عنهما، فقلت أخبرني عن صفة رسول الله صلى الله عليه وسلم في التوراة، قال أجل، والله إنه لموصوف في التوراة ببعض صفته في القرآن { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } وحرزاً للأميين، أنت عبدي ورسولي، سميتك المتوكل، لست بفظ ولا غليظ، ولا سخاب في الأسواق، ولا يدفع السيئة بالسيئة، ولكن يعفو ويصفح ويغفر، ولن يقبضه الله حتى يقيم به الملّة العوجاء، بأن يقولوا لا إله إلا الله، فيفتح بها أعيناً عمياً، وآذاناً صماً، وقلوباً غلفاً وقد رواه البخاري في البيوع عن محمد بن سنان عن فليح بن سليمان عن هلال بن علي به. ورواه في التفسير عن عبد الله ــــ قيل ابن رجاء، وقيل ابن صالح ــــ عن عبد العزيز بن أبي سلمة عن هلال عن عطاء بن يسار عن عبد الله بن عمرو به. ورواه ابن أبي حاتم عن أبيه عن عبد الله بن رجاء عن عبد العزيز بن أبي سلمة الماجشون به. وقال البخاري في البيوع وقال سعيد عن هلال عن عطاء عن عبد الله بن سلام رضي الله عنه وقال وهب بن منبه إِن الله تعالى أوحى إلى نبي من أنبياء بني إسرائيل يقال له شعياء أن قم في قومك بني إسرائيل، فإني منطق لسانك بوحي، وأبعث أمياً من الأميين، أبعثه مبشراً ليس بفظ ولا غليظ ولا صخاب في الأسواق، لو يمر إلى جنب سراج لم يطفئه من سكينته، ولو يمشي على القصب لم يسمع من تحت قدميه، أبعثه مبشراً ونذيراً، لا يقول الخنا، أفتح به أعيناً كمهاً، وآذاناً صماً، وقلوباً غلفاً، أسدده لكل أمر جميل، وأهب له كل خلق كريم، وأجعل السكينة لباسه، والبر شعاره، والتقوى ضميره، والحكمة منطقه، والصدق والوفاء طبيعته، والعفو والمعروف خلقه، والحق شريعته، والعدل سيرته، والهدى إمامه، والإسلام ملته، وأحمد اسمه، أهدي به بعد الضلال، وأعلم به بعد الجهالة، وأرفع به بعد الخمالة، وأعرف به بعد النكرة، وأكثر به بعد القلة، وأغني به بعد العيلة، وأجمع به بعد الفرقة، وأؤلف به بين أمم متفرقة وقلوب مختلفة، وأهواء متشتتة، وأستنقذ به فئاماً من الناس عظيمة من الهلكة، وأجعل أمته خير أمة أخرجت للناس، يأمرون بالمعروف وينهون عن المنكر، موحدين مؤمنين مخلصين مصدقين لما جاءت به رسلي، ألهمهم التسبيح والتحميد، والثناء والتكبير والتوحيد، في مساجدهم ومجالسهم ومضاجعهم ومنقلبهم ومثواهم، يصلون لي قياماً وقعوداً، ويقاتلون في سبيل الله صفوفاً وزحوفاً، ويخرجون من ديارهم ابتغاء مرضاتي ألوفاً، يطهرون الوجوه والأطراف، ويشدون الثياب في الأنصاف، قربانهم دماؤهم، وأناجيلهم في صدورهم، رهبان بالليل، ليوث بالنهار، وأجعل في أهل بيته وذريته السابقين والصديقين والشهداء والصالحين، أمته من بعده يهدون بالحق، وبه يعدلون، وأعز من نصرهم، وأؤيد من دعا لهم، وأجعل دائرة السوء على من خالفهم، أو بغى عليهم، أو أراد أن ينتزع شيئاً مما في أيديهم، أجعلهم ورثة لنبيهم، والداعية إلى ربهم، يأمرون بالمعروف وينهون عن المنكر، ويقيمون الصلاة، ويؤتون الزكاة، ويوفون بعهدهم، أختم بهم الخير الذي بدأته بأولهم، ذلك فضلي أوتيه من أشاء، وأنا ذو الفضل العظيم.\n\n                                   هكذا رواه ابن أبي حاتم عن وهب بن منبه اليماني رحمه الله. ثم قال ابن أبي حاتم حدثنا أبي، حدثنا عبد الرحمن بن صالح، حدثنا عبد الرحمن بن محمد بن عبيد الله العرزمي عن شيبان النحوي، أخبرني قتادة عن عكرمة عن ابن عباس رضي الله عنهما قال لما نزلت { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } وقد كان أمر علياً ومعاذاً رضي الله عنهما أن يسيرا إلى اليمن فقال \" انطلقا، فبشرا ولا تنفرا، ويسرا ولا تعسرا، إنه قد أنزل علي { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } \" ورواه الطبراني عن محمد بن نصر بن حميد البزاز البغدادي، عن عبد الرحمن بن صالح الأزدي، عن عبد الرحمن بن محمد بن عبيد الله العرزمي بإسناده مثله، وقال في آخره \" فإنه قد أنزل علي يا أيها النبي إنا أرسلناك شاهداً على أمتك، ومبشراً بالجنة، ونذيراً من النار، وداعياً إلى شهادة أن لا إله إلا الله بإذنه وسراجاً منيراً بالقرآن \" فقوله تعالى { شَاهِداً } أي لله بالوحدانية، وأنه لا إله غيره، وعلى الناس بأعمالهم يوم القيامة، وجئنا بك على هؤلاء شهيداً كقوله\n{ لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيدًا }\nالبقرة 143. وقوله عز وجل { وَمُبَشِّراً وَنَذِيراً } أي بشيراً للمؤمنين بجزيل الثواب، ونذيراً للكافرين من وبيل العقاب. وقوله جلت عظمته { وَدَاعِياً إِلَى ٱللَّهِ بِإِذْنِهِ } أي داعياً للخلق إلى عبادة ربهم، عن أمره لك بذلك، { وَسِرَاجاً مُّنِيراً } أي وأمرك ظاهر فيما جئت به من الحق كالشمس في إشراقها وإضاءتها، لا يجحدها إلا معاند. وقوله جل وعلا { وَلاَ تُطِعِ ٱلْكَـٰفِرِينَ وَٱلْمُنَـٰفِقِينَ وَدَعْ أَذَاهُمْ } أي لا تطعهم وتسمع منهم في الذي يقولونه، { وَدَعْ أَذَاهُمْ } أي اصفح وتجاوز عنهم، وكل أمرهم إلى الله تعالى، فإن فيه كفاية لهم، ولهذا قال جل جلاله { وَتَوَكَّلْ عَلَى ٱللَّهِ وَكَفَىٰ بِٱللَّهِ وَكِيلاً }.\n                                    ",
        "qortoby": "\n                                    \n                                    \n                                    قوله تعالى: { وَبَشِّرِ ٱلْمُؤْمِنِينَ } الواو عاطفة جملة على جملة؛ والمعنى منقطع من الذي قبله. أمره تعالى أن يبشر المؤمنين بالفضل الكبير من الله تعالى. وعلى قول الزجاج: ذا سراج منير، أو وتالياً سراجاً منيراً، يكون معطوفاً على الكاف لا في «أَرْسَلْنَاكَ». قال ابن عطية: قال لنا أُبَيّ رضي الله عنه: هذه من أرجى آية عندي في كتاب الله تعالى؛ لأن الله عز وجل قد أمر نبيّه أن يبشّر المؤمنين بأن لهم عنده فضلاً كبيراً؛ وقد بيّن تعالى الفضل الكبير في قوله تعالى :\n{ وَٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ فِي رَوْضَاتِ ٱلْجَنَّاتِ لَهُمْ مَّا يَشَآءُونَ عِندَ رَبِّهِمْ ذَلِكَ هُوَ ٱلْفَضْلُ ٱلْكَبِيرُ }\n[الشورى: 22]. فالآية التي في هذه السورة خبر، والتي في «حۤم. عۤسۤقۤ» تفسير لها. { وَلاَ تُطِعِ ٱلْكَافِرِينَ وَٱلْمُنَافِقِينَ } أي لا تطعهم فيما يشيرون عليك من المداهنة في الدين ولا تمالئهم. «الْكَافِرِينَ»: أبي سفيان وعكرمة وأبي الأعْوَر السُّلَمِيّ؛ قالوا: يا محمد، لا تذكر آلهتنا بسوء نتبعك. «وَالْمُنَافِقِينَ»: عبد الله بن أُبَيّ وعبد الله بن سعد وطُعْمة بن أُبَيْرِق، حَثُّوا النبيّ صلى الله عليه وسلم على إجابتهم بتعِلّة المصلحة. { وَدَعْ أَذَاهُمْ } أي دع أن تؤذيهم مجازاةً على إذايتهم إياك. فأمره تبارك وتعالى بترك معاقبتهم، والصفح عن زللهم؛ فالمصدر على هذا مضاف إلى المفعول. ونُسخ من الآية على هذا التأويل ما يخصّ الكافرين، وناسخه آية السيف. وفيه معنى ثانٍ: أي أعرض عن أقوالهم وما يؤذونك، ولا تشتغل به؛ فالمصدر على هذا التأويل مضاف إلى الفاعل. وهذا تأويل مجاهد، والآية منسوخة بآية السيف. { وَتَوَكَّـلْ عَلَى ٱللَّهِ } أمره بالتوكل عليه وآنسه بقوله: { وَكَفَىٰ بِٱللَّهِ وَكِـيلاً } وفي قوّة الكلام وعدٌ بنصر. والوكيل: الحافظ القائم على الأمر.\n                                    ",
        "saadi": "وَبَشِّرِ ٱلۡمُؤۡمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضۡلٗا كَبِيرٗا ٧٤\n                                        \n                                        \n                                        \n                                        هذه الأشياء التي وصف الله بها رسوله محمداً صلى اللّه عليه وسلم، هي المقصود من رسالته وزبدتها وأصولها التي اختص بها، وهي خمسة أشياء: أحدها: كونه { شَٰهِداً } أي: شاهداً على أمته بما عملوه من خير وشر، كما قال تعالى :\n{ لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيداً }\n[ البقرة: 143 ]\n{ فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلاۤءِ شَهِيداً }\n[النساء: 41] فهو صلى اللّه عليه وسلم شاهد عدل مقبول. الثاني، والثالث: كونه { وَمُبَشِّراً وَنَذِيراً } وهذا يستلزم ذكر المبشر والمنذر، وما يبشر به وينذر، والأعمال الموجبة لذلك. فالمبشَّر هم: المؤمنون المتقون، الذين جمعوا بين الإيمان والعمل الصالح، وترك المعاصي، لهم البشرى في الحياة الدنيا، بكل ثواب دنيوي وديني، رتب على الإيمان والتقوى، وفي الأخرى بالنعيم المقيم. وذلك كله يستلزم ذكر تفصيل المذكور، من تفاصيل الأعمال، وخصال التقوى، وأنواع الثواب. والمنْذَر هم: المجرمون الظالمون، أهل الظلم والجهل، لهم النذارة في الدنيا، من العقوبات الدنيوية والدينية المترتبة على الجهل والظلم، وفي الأخرى، بالعقاب الوبيل، والعذاب الطويل. وهذه الجملة تفصيلها، ما جاء به صلى اللّه عليه وسلم من الكتاب والسُنّة، المشتمل على ذلك. الرابع: كونه { دَاعِياً إِلَى ٱللَّهِ } أي: أرسله اللّه يدعو الخلق إلى ربهم، ويسوقهم لكرامته، ويأمرهم بعبادته التي خلقوا لها، وذلك يستلزم استقامته على ما يدعو إليه، وذكر تفاصيل ما يدعو إليه، بتعريفهم لربهم بصفاته المقدسة، وتنزيهه عمّا لا يليق بجلاله، وذكر أنواع العبودية، والدعوة إلى اللّه بأقرب طريق موصل إليه، وإعطاء كل ذي حق حقه، وإخلاص الدعوة إلى اللّه، لا إلى نفسه وتعظيمها، كما قد يعرض ذلك لكثير من النفوس في هذا المقام، وذلك كله بِإِذْنِ الله تعالى له في الدعوة وأمره وإرادته وقدره. الخامس: كونه { وَسِرَاجاً مُّنِيراً } وذلك يقتضي أن الخلق في ظلمة عظيمة، لا نور، يهتدى به في ظلماتها، ولا علم يستدل به في جهالاتها، حتى جاء اللّه بهذا النبي الكريم، فأضاء اللّه به تلك الظلمات، وعلم به من الجهالات، وهدى به ضُلالاً إلى الصراط المستقيم. فأصبح أهل الاستقامة قد وضح لهم الطريق، فمشوا خلف هذا الإمام وعرفوا به الخير والشر، وأهل السعادة من أهل الشقاوة، واستناروا به، لمعرفة معبودهم، وعرفوه بأوصافه الحميدة، وأفعاله السديدة، وأحكامه الرشيدة. وقوله: { وَبَشِّرِ ٱلْمُؤْمِنِينَ بِأَنَّ لَهُمْ مِّنَ ٱللَّهِ فَضْلاً كَبِيراً } ذكر في هذه الجملة المبشَّر، وهم المؤمنون، وعند ذكر الإيمان بمفرده، تدخل فيه الأعمال الصالحة. وذكر المبشَّر به، وهو الفضل الكبير، أي: العظيم الجليل، الذي لا يقادر قدره، من النصر في الدنيا، وهداية القلوب، وغفران الذنوب، وكشف الكروب، وكثرة الأرزاق الدَّارَّة، وحصول النِعَم السارة، والفوز برضا ربهم وثوابه، والنجاة من سخطه وعقابه.\n\n                                   وهذا مما ينشط العاملين، أن يذكر لهم من ثواب اللّه على أعمالهم، ما به يستعينون على سلوك الصراط المستقيم، وهذا من جملة حكم الشرع، كما أن من حكمه، أن يذكر في مقام الترهيب، العقوبات المترتبة على ما يرهب منه، ليكون عوناً على الكف عمّا حرّم اللّه. ولما كان ثَمَّ طائفة من الناس، مستعدة للقيام بصد الداعين إلى اللّه من الرسل وأتباعهم، وهم المنافقون، الذين أظهروا الموافقة في الإيمان، وهم كفرة فجرة في الباطن، والكفار ظاهراً وباطناً، نهى اللّه رسوله عن طاعتهم، وحذره ذلك، فقال: { وَلاَ تُطِعِ ٱلْكَافِرِينَ وَٱلْمُنَافِقِينَ } أي: في كل أمر يصد عن سبيل اللّه، ولكن لا يقتضي هذا أذاهم، [بل لا تطعهم { وَدَعْ أَذَاهُمْ } ] فإن ذلك، جالب لهم، وداع إلى قبول الإسلام، وإلى كف كثير من أذيتهم له ولأهله. { وَتَوَكَّـلْ عَلَى ٱللَّهِ } في إتمام أمرك، وخذلان عدوك، { وَكَفَىٰ بِٱللَّهِ وَكِـيلاً } تُوكَلُ إليه الأمور المهمة، فيقوم بها، ويسهلها على عبده.\n                                    "
      },
      "originalText": "وَبَشِّرِ ٱلۡمُؤۡمِنِينَ بِأَنَّ لَهُم مِّنَ ٱللَّهِ فَضۡلٗا كَبِيرٗا ٧٤"
    },
    {
      "number": 3581,
      "text": "وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ وَدَعْ أَذَاهُمْ وَتَوَكَّلْ عَلَى اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 48,
      "juz": 22,
      "manzil": 5,
      "page": 424,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَ وَدَعۡ أَذَىٰهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا ٨٤\n                                    \n                                    \n                                    قال الإمام أحمد حدثنا موسى بن داود، حدثنا فليح بن سليمان، حدثنا هلال بن علي عن عطاء بن يسار قال لقيت عبد الله بن عمرو بن العاص رضي الله عنهما، فقلت أخبرني عن صفة رسول الله صلى الله عليه وسلم في التوراة، قال أجل، والله إنه لموصوف في التوراة ببعض صفته في القرآن { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } وحرزاً للأميين، أنت عبدي ورسولي، سميتك المتوكل، لست بفظ ولا غليظ، ولا سخاب في الأسواق، ولا يدفع السيئة بالسيئة، ولكن يعفو ويصفح ويغفر، ولن يقبضه الله حتى يقيم به الملّة العوجاء، بأن يقولوا لا إله إلا الله، فيفتح بها أعيناً عمياً، وآذاناً صماً، وقلوباً غلفاً وقد رواه البخاري في البيوع عن محمد بن سنان عن فليح بن سليمان عن هلال بن علي به. ورواه في التفسير عن عبد الله ــــ قيل ابن رجاء، وقيل ابن صالح ــــ عن عبد العزيز بن أبي سلمة عن هلال عن عطاء بن يسار عن عبد الله بن عمرو به. ورواه ابن أبي حاتم عن أبيه عن عبد الله بن رجاء عن عبد العزيز بن أبي سلمة الماجشون به. وقال البخاري في البيوع وقال سعيد عن هلال عن عطاء عن عبد الله بن سلام رضي الله عنه وقال وهب بن منبه إِن الله تعالى أوحى إلى نبي من أنبياء بني إسرائيل يقال له شعياء أن قم في قومك بني إسرائيل، فإني منطق لسانك بوحي، وأبعث أمياً من الأميين، أبعثه مبشراً ليس بفظ ولا غليظ ولا صخاب في الأسواق، لو يمر إلى جنب سراج لم يطفئه من سكينته، ولو يمشي على القصب لم يسمع من تحت قدميه، أبعثه مبشراً ونذيراً، لا يقول الخنا، أفتح به أعيناً كمهاً، وآذاناً صماً، وقلوباً غلفاً، أسدده لكل أمر جميل، وأهب له كل خلق كريم، وأجعل السكينة لباسه، والبر شعاره، والتقوى ضميره، والحكمة منطقه، والصدق والوفاء طبيعته، والعفو والمعروف خلقه، والحق شريعته، والعدل سيرته، والهدى إمامه، والإسلام ملته، وأحمد اسمه، أهدي به بعد الضلال، وأعلم به بعد الجهالة، وأرفع به بعد الخمالة، وأعرف به بعد النكرة، وأكثر به بعد القلة، وأغني به بعد العيلة، وأجمع به بعد الفرقة، وأؤلف به بين أمم متفرقة وقلوب مختلفة، وأهواء متشتتة، وأستنقذ به فئاماً من الناس عظيمة من الهلكة، وأجعل أمته خير أمة أخرجت للناس، يأمرون بالمعروف وينهون عن المنكر، موحدين مؤمنين مخلصين مصدقين لما جاءت به رسلي، ألهمهم التسبيح والتحميد، والثناء والتكبير والتوحيد، في مساجدهم ومجالسهم ومضاجعهم ومنقلبهم ومثواهم، يصلون لي قياماً وقعوداً، ويقاتلون في سبيل الله صفوفاً وزحوفاً، ويخرجون من ديارهم ابتغاء مرضاتي ألوفاً، يطهرون الوجوه والأطراف، ويشدون الثياب في الأنصاف، قربانهم دماؤهم، وأناجيلهم في صدورهم، رهبان بالليل، ليوث بالنهار، وأجعل في أهل بيته وذريته السابقين والصديقين والشهداء والصالحين، أمته من بعده يهدون بالحق، وبه يعدلون، وأعز من نصرهم، وأؤيد من دعا لهم، وأجعل دائرة السوء على من خالفهم، أو بغى عليهم، أو أراد أن ينتزع شيئاً مما في أيديهم، أجعلهم ورثة لنبيهم، والداعية إلى ربهم، يأمرون بالمعروف وينهون عن المنكر، ويقيمون الصلاة، ويؤتون الزكاة، ويوفون بعهدهم، أختم بهم الخير الذي بدأته بأولهم، ذلك فضلي أوتيه من أشاء، وأنا ذو الفضل العظيم.\n\n                                   هكذا رواه ابن أبي حاتم عن وهب بن منبه اليماني رحمه الله. ثم قال ابن أبي حاتم حدثنا أبي، حدثنا عبد الرحمن بن صالح، حدثنا عبد الرحمن بن محمد بن عبيد الله العرزمي عن شيبان النحوي، أخبرني قتادة عن عكرمة عن ابن عباس رضي الله عنهما قال لما نزلت { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } وقد كان أمر علياً ومعاذاً رضي الله عنهما أن يسيرا إلى اليمن فقال \" انطلقا، فبشرا ولا تنفرا، ويسرا ولا تعسرا، إنه قد أنزل علي { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَرْسَلْنَـٰكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً } \" ورواه الطبراني عن محمد بن نصر بن حميد البزاز البغدادي، عن عبد الرحمن بن صالح الأزدي، عن عبد الرحمن بن محمد بن عبيد الله العرزمي بإسناده مثله، وقال في آخره \" فإنه قد أنزل علي يا أيها النبي إنا أرسلناك شاهداً على أمتك، ومبشراً بالجنة، ونذيراً من النار، وداعياً إلى شهادة أن لا إله إلا الله بإذنه وسراجاً منيراً بالقرآن \" فقوله تعالى { شَاهِداً } أي لله بالوحدانية، وأنه لا إله غيره، وعلى الناس بأعمالهم يوم القيامة، وجئنا بك على هؤلاء شهيداً كقوله\n{ لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيدًا }\nالبقرة 143. وقوله عز وجل { وَمُبَشِّراً وَنَذِيراً } أي بشيراً للمؤمنين بجزيل الثواب، ونذيراً للكافرين من وبيل العقاب. وقوله جلت عظمته { وَدَاعِياً إِلَى ٱللَّهِ بِإِذْنِهِ } أي داعياً للخلق إلى عبادة ربهم، عن أمره لك بذلك، { وَسِرَاجاً مُّنِيراً } أي وأمرك ظاهر فيما جئت به من الحق كالشمس في إشراقها وإضاءتها، لا يجحدها إلا معاند. وقوله جل وعلا { وَلاَ تُطِعِ ٱلْكَـٰفِرِينَ وَٱلْمُنَـٰفِقِينَ وَدَعْ أَذَاهُمْ } أي لا تطعهم وتسمع منهم في الذي يقولونه، { وَدَعْ أَذَاهُمْ } أي اصفح وتجاوز عنهم، وكل أمرهم إلى الله تعالى، فإن فيه كفاية لهم، ولهذا قال جل جلاله { وَتَوَكَّلْ عَلَى ٱللَّهِ وَكَفَىٰ بِٱللَّهِ وَكِيلاً }.\n                                    ",
        "qortoby": "وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَ وَدَعۡ أَذَىٰهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا ٨٤\n                                    \n                                    \n                                    قوله تعالى: { وَبَشِّرِ ٱلْمُؤْمِنِينَ } الواو عاطفة جملة على جملة؛ والمعنى منقطع من الذي قبله. أمره تعالى أن يبشر المؤمنين بالفضل الكبير من الله تعالى. وعلى قول الزجاج: ذا سراج منير، أو وتالياً سراجاً منيراً، يكون معطوفاً على الكاف لا في «أَرْسَلْنَاكَ». قال ابن عطية: قال لنا أُبَيّ رضي الله عنه: هذه من أرجى آية عندي في كتاب الله تعالى؛ لأن الله عز وجل قد أمر نبيّه أن يبشّر المؤمنين بأن لهم عنده فضلاً كبيراً؛ وقد بيّن تعالى الفضل الكبير في قوله تعالى :\n{ وَٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ فِي رَوْضَاتِ ٱلْجَنَّاتِ لَهُمْ مَّا يَشَآءُونَ عِندَ رَبِّهِمْ ذَلِكَ هُوَ ٱلْفَضْلُ ٱلْكَبِيرُ }\n[الشورى: 22]. فالآية التي في هذه السورة خبر، والتي في «حۤم. عۤسۤقۤ» تفسير لها. { وَلاَ تُطِعِ ٱلْكَافِرِينَ وَٱلْمُنَافِقِينَ } أي لا تطعهم فيما يشيرون عليك من المداهنة في الدين ولا تمالئهم. «الْكَافِرِينَ»: أبي سفيان وعكرمة وأبي الأعْوَر السُّلَمِيّ؛ قالوا: يا محمد، لا تذكر آلهتنا بسوء نتبعك. «وَالْمُنَافِقِينَ»: عبد الله بن أُبَيّ وعبد الله بن سعد وطُعْمة بن أُبَيْرِق، حَثُّوا النبيّ صلى الله عليه وسلم على إجابتهم بتعِلّة المصلحة. { وَدَعْ أَذَاهُمْ } أي دع أن تؤذيهم مجازاةً على إذايتهم إياك. فأمره تبارك وتعالى بترك معاقبتهم، والصفح عن زللهم؛ فالمصدر على هذا مضاف إلى المفعول. ونُسخ من الآية على هذا التأويل ما يخصّ الكافرين، وناسخه آية السيف. وفيه معنى ثانٍ: أي أعرض عن أقوالهم وما يؤذونك، ولا تشتغل به؛ فالمصدر على هذا التأويل مضاف إلى الفاعل. وهذا تأويل مجاهد، والآية منسوخة بآية السيف. { وَتَوَكَّـلْ عَلَى ٱللَّهِ } أمره بالتوكل عليه وآنسه بقوله: { وَكَفَىٰ بِٱللَّهِ وَكِـيلاً } وفي قوّة الكلام وعدٌ بنصر. والوكيل: الحافظ القائم على الأمر.\n                                    ",
        "saadi": "وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَ وَدَعۡ أَذَىٰهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا ٨٤\n                                        \n                                        \n                                        \n                                        هذه الأشياء التي وصف الله بها رسوله محمداً صلى اللّه عليه وسلم، هي المقصود من رسالته وزبدتها وأصولها التي اختص بها، وهي خمسة أشياء: أحدها: كونه { شَٰهِداً } أي: شاهداً على أمته بما عملوه من خير وشر، كما قال تعالى :\n{ لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيْكُمْ شَهِيداً }\n[ البقرة: 143 ]\n{ فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلاۤءِ شَهِيداً }\n[النساء: 41] فهو صلى اللّه عليه وسلم شاهد عدل مقبول. الثاني، والثالث: كونه { وَمُبَشِّراً وَنَذِيراً } وهذا يستلزم ذكر المبشر والمنذر، وما يبشر به وينذر، والأعمال الموجبة لذلك. فالمبشَّر هم: المؤمنون المتقون، الذين جمعوا بين الإيمان والعمل الصالح، وترك المعاصي، لهم البشرى في الحياة الدنيا، بكل ثواب دنيوي وديني، رتب على الإيمان والتقوى، وفي الأخرى بالنعيم المقيم. وذلك كله يستلزم ذكر تفصيل المذكور، من تفاصيل الأعمال، وخصال التقوى، وأنواع الثواب. والمنْذَر هم: المجرمون الظالمون، أهل الظلم والجهل، لهم النذارة في الدنيا، من العقوبات الدنيوية والدينية المترتبة على الجهل والظلم، وفي الأخرى، بالعقاب الوبيل، والعذاب الطويل. وهذه الجملة تفصيلها، ما جاء به صلى اللّه عليه وسلم من الكتاب والسُنّة، المشتمل على ذلك. الرابع: كونه { دَاعِياً إِلَى ٱللَّهِ } أي: أرسله اللّه يدعو الخلق إلى ربهم، ويسوقهم لكرامته، ويأمرهم بعبادته التي خلقوا لها، وذلك يستلزم استقامته على ما يدعو إليه، وذكر تفاصيل ما يدعو إليه، بتعريفهم لربهم بصفاته المقدسة، وتنزيهه عمّا لا يليق بجلاله، وذكر أنواع العبودية، والدعوة إلى اللّه بأقرب طريق موصل إليه، وإعطاء كل ذي حق حقه، وإخلاص الدعوة إلى اللّه، لا إلى نفسه وتعظيمها، كما قد يعرض ذلك لكثير من النفوس في هذا المقام، وذلك كله بِإِذْنِ الله تعالى له في الدعوة وأمره وإرادته وقدره. الخامس: كونه { وَسِرَاجاً مُّنِيراً } وذلك يقتضي أن الخلق في ظلمة عظيمة، لا نور، يهتدى به في ظلماتها، ولا علم يستدل به في جهالاتها، حتى جاء اللّه بهذا النبي الكريم، فأضاء اللّه به تلك الظلمات، وعلم به من الجهالات، وهدى به ضُلالاً إلى الصراط المستقيم. فأصبح أهل الاستقامة قد وضح لهم الطريق، فمشوا خلف هذا الإمام وعرفوا به الخير والشر، وأهل السعادة من أهل الشقاوة، واستناروا به، لمعرفة معبودهم، وعرفوه بأوصافه الحميدة، وأفعاله السديدة، وأحكامه الرشيدة. وقوله: { وَبَشِّرِ ٱلْمُؤْمِنِينَ بِأَنَّ لَهُمْ مِّنَ ٱللَّهِ فَضْلاً كَبِيراً } ذكر في هذه الجملة المبشَّر، وهم المؤمنون، وعند ذكر الإيمان بمفرده، تدخل فيه الأعمال الصالحة. وذكر المبشَّر به، وهو الفضل الكبير، أي: العظيم الجليل، الذي لا يقادر قدره، من النصر في الدنيا، وهداية القلوب، وغفران الذنوب، وكشف الكروب، وكثرة الأرزاق الدَّارَّة، وحصول النِعَم السارة، والفوز برضا ربهم وثوابه، والنجاة من سخطه وعقابه.\n\n                                   وهذا مما ينشط العاملين، أن يذكر لهم من ثواب اللّه على أعمالهم، ما به يستعينون على سلوك الصراط المستقيم، وهذا من جملة حكم الشرع، كما أن من حكمه، أن يذكر في مقام الترهيب، العقوبات المترتبة على ما يرهب منه، ليكون عوناً على الكف عمّا حرّم اللّه. ولما كان ثَمَّ طائفة من الناس، مستعدة للقيام بصد الداعين إلى اللّه من الرسل وأتباعهم، وهم المنافقون، الذين أظهروا الموافقة في الإيمان، وهم كفرة فجرة في الباطن، والكفار ظاهراً وباطناً، نهى اللّه رسوله عن طاعتهم، وحذره ذلك، فقال: { وَلاَ تُطِعِ ٱلْكَافِرِينَ وَٱلْمُنَافِقِينَ } أي: في كل أمر يصد عن سبيل اللّه، ولكن لا يقتضي هذا أذاهم، [بل لا تطعهم { وَدَعْ أَذَاهُمْ } ] فإن ذلك، جالب لهم، وداع إلى قبول الإسلام، وإلى كف كثير من أذيتهم له ولأهله. { وَتَوَكَّـلْ عَلَى ٱللَّهِ } في إتمام أمرك، وخذلان عدوك، { وَكَفَىٰ بِٱللَّهِ وَكِـيلاً } تُوكَلُ إليه الأمور المهمة، فيقوم بها، ويسهلها على عبده.\n                                    "
      },
      "originalText": "وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَ وَدَعۡ أَذَىٰهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا ٨٤"
    },
    {
      "number": 3582,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نَكَحْتُمُ الْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِنْ قَبْلِ أَنْ تَمَسُّوهُنَّ فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا ۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحًا جَمِيلًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 49,
      "juz": 22,
      "manzil": 5,
      "page": 424,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَكَحۡتُمُ ٱلۡمُؤۡمِنَٰتِ ثُمَّ طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمۡ عَلَيۡهِنَّ مِنۡ عِدَّةٖ تَعۡتَدُّونَهَاۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحٗا جَمِيلٗا ٩٤\n                                    \n                                    \n                                    هذه الآية الكريمة فيها أحكام كثيرة منها إطلاق النكاح على العقد وحده، وليس في القرآن آية أصرح في ذلك منها، وقد اختلفوا في النكاح هل هو حقيقة في العقد وحده، أو في الوطء، أو فيهما؟ على ثلاثة أقوال، واستعمال القرآن إنما هو في العقد والوطء بعده، إلا في هذه الآية، فإنه استعمل في العقد وحده لقوله تبارك وتعالى { إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ } وفيها دلالة لإباحة طلاق المرأة قبل الدخول بها. وقوله تعالى { ٱلْمُؤْمِنَـٰتِ } خرج مخرج الغالب، إذ لا فرق في الحكم بين المؤمنة والكتابية في ذلك بالاتفاق، وقد استدل ابن عباس رضي الله عنهما وسعيد بن المسيب والحسن البصري وعلي بن الحسين زين العابدين وجماعة من السلف بهذه الآية على أن الطلاق لا يقع إلا إذا تقدمه نكاح لأن الله تعالى قال { إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ } فعقب النكاح بالطلاق، فدل على أنه لا يصح ولا يقع قبله، وهذا مذهب الشافعي وأحمد بن حنبل وطائفة كثيرة من السلف والخلف رحمهم الله تعالى، وذهب مالك وأبو حنيفة رحمهما الله تعالى إلى صحة الطلاق قبل النكاح فيما إذا قال إن تزوجت فلانة فهي طالق، فعندهما متى تزوجها، طلقت منه، واختلفا فيما إذا قال كل امرأة أتزوجها، فهي طالق، فقال مالك لا تطلق حتى يعين المرأة. وقال أبو حنيفة رحمه الله كل امرأة يتزوجها بعد هذا الكلام تطلق منه، فأما الجمهور، فاحتجوا على عدم وقوع الطلاق بهذه الآية. قال ابن أبي حاتم حدثنا أحمد بن منصور المروزي، حدثنا النضر بن شميل، حدثنا يونس، يعني ابن أبي إسحاق، قال سمعت آدم مولى خالد عن سعيد بن جبير عن ابن عباس رضي الله تعالى عنهما قال إذا قال كل امرأة أتزوجها، فهي طالق، قال ليس بشيء من أجل أن الله تعالى يقول { إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ } الآية. وحدثنا محمد بن إسماعيل الأحمسي، حدثنا وكيع عن مطر عن الحسن بن مسلم بن يناق عن ابن عباس رضي الله عنهما قال إنما قال الله عز وجل { إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ } ألا ترى أن الطلاق بعد النكاح، وهكذا روى محمد بن إسحاق عن داود بن الحصين عن عكرمة عن ابن عباس رضي الله عنهما قال قال الله تعالى { إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ } فلا طلاق قبل النكاح. وقد ورد الحديث بذلك عن عمرو بن شعيب عن أبيه عن جده قال قال رسول الله صلى الله عليه وسلم \" لا طلاق لابن آدم فيما لا يملك \" رواه أحمد وأبو داود والترمذي وابن ماجه.\n                                    وقال الترمذي هذا حديث حسن، وهو أحسن شيء روي في هذا الباب، وهكذا روى ابن ماجه عن علي والمسور بن مخرمة رضي الله عنهما، عن رسول الله صلى الله عليه وسلم أنه قال \" لا طلاق قبل نكاحٍ \". وقوله عز وجل { فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ تَعْتَدُّونَهَا } هذا أمر مجمع عليه بين العلماء، أن المرأة إذا طلقت قبل الدخول بها، لا عدة عليها، فتذهب فتتزوج في فورها من شاءت، ولا يستثنى من هذا إلا المتوفى عنها زوجها، فإنها تعتد منه أربعة أشهر وعشراً، وإن لم يكن دخل بها، بالإجماع أيضاً. وقوله تعالى { فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحاً جَمِيلاً } المتعة ههنا أعم من أن تكون نصف الصداق المسمى، أو المتعة الخاصة إن لم يكن قد سمي لها. قال الله تعالى\n{ وَإِن طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةً فَنِصْفُ مَا فَرَضْتُمْ }\nالبقرة 237 وقال عز وجل\n{ لاَّ جُنَاحَ عَلَيْكُمْ إِن طَلَّقْتُمُ ٱلنِّسَآءَ مَا لَمْ تَمَسُّوهُنَّ أَوْ تَفْرِضُواْ لَهُنَّ فَرِيضَةً وَمَتِّعُوهُنَّ عَلَى ٱلْمُوسِعِ قَدَرُهُ وَعَلَى ٱلْمُقْتِرِ قَدْرُهُ مَتَـٰعاً بِٱلْمَعْرُوفِ حَقًّا عَلَى ٱلْمُحْسِنِينَ }\nالبقرة 236 وفي \" صحيح البخاري \" عن سهل بن سعد وأبي أسيد رضي الله عنهما قالا إن رسول الله صلى الله عليه وسلم تزوج أميمة بنت شراحيل، فلما أن دخلت عليه صلى الله عليه وسلم بسط يده إليها، فكأنها كرهت ذلك، فأمر أبا أسيد أن يجهزها ويكسوها ثوبين رازقيين، قال علي بن أبي طلحة عن ابن عباس رضي الله عنهما إن كان سمى لها صداقاً، فليس لها إلا النصف، وإن لم يكن سمى لها صداقاً، أمتعها على قدر عسره ويسره، وهو السراح الجميل.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَكَحۡتُمُ ٱلۡمُؤۡمِنَٰتِ ثُمَّ طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمۡ عَلَيۡهِنَّ مِنۡ عِدَّةٖ تَعۡتَدُّونَهَاۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحٗا جَمِيلٗا ٩٤\n                                    \n                                    \n                                    فيه سبع مسائل:\n\nالأولى: قوله تعالى: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ } لما جرت قصة زيد وتطليقه زينب، وكانت مدخولاً بها، وخطبها النبيّ صلى الله عليه وسلم بعد انقضاء عدّتها ـ كما بيّناه ـ خاطب الله المؤمنين بحكم الزوجة تطلق قبل البناء، وبيّن ذلك الحكم للأمة؛ فالمطلّقة إذا لم تكن ممسوسةً لا عدّة عليها بنص الكتاب وإجماع الأمّة على ذلك. فإن دخل بها فعليها العدّة إجماعاً.\n\nالثانية: النكاح حقيقة في الوطء، وتسمية العقد نكاحاً لملابسته له من حيث إنه طريق إليه. ونظيره تسميتهم الخمر إثماً لأنه سبب في اقتراف الإثم. ولم يرد لفظ النكاح في كتاب الله إلا في معنى العقد، لأنه في معنى الوطء، وهو من آداب القرآن، الكناية عنه بلفظ: الملامسة والمماسّة والقُربان والتغشّي والإتيان.\n\nالثالثة: استدل بعض العلماء بقوله تعالى: { ثُمَّ طَلَّقْتُمُوهُنَّ } وبمهلة «ثُمَّ» على أن الطلاق لا يكون إلا بعد نكاح، وأن من طلّق المرأة قبل نكاحها وإن عَيّنها، فإن ذلك لا يلزمه. وقال هذا نَيِّفٌ على ثلاثين مِن صاحبٍ وتابِع وإمامٍ. سَمّى البخاريّ منهم اثنين وعشرين. وقد روي عن النبي صلى الله عليه وسلم: \" لا طلاق قبل نكاح \" ومعناه: أن الطلاق لا يقع حتى يحصل النكاح. قال حبيب بن أبي ثابت: سئل علي بن الحسين رضي الله عنهما عن رجل قال لامرأة: إن تزوجتك فأنت طالق؟ فقال: ليس بشيء؛ ذكر الله عز وجل النكاح قبل الطلاق. وقالت طائفة من أهل العلم: إن طلاق المعيّنة الشخص أو القبيلة أو البلد لازم قبل النكاح؛ منهم مالك وجميع أصحابه، وجمع عظيم من علماء الأمة. وقد مضى في «براءة» الكلام فيها ودليل الفريقين. والحمد لله. فإذا قال: كل امرأة أتزوّجها (طالق) وكل عبد أشتريه حرّ؛ لم يلزمه شيء. وإن قال: كلّ امرأة أتزوّجها إلى عشرين سنة، أو إن تزوّجت من بلد فلان أو من بني فلان فهي طالق، لزمه الطلاق ما لم يخف العَنَت على نفسه في طول السنين، أو يكون عمره في الغالب لا يبلغ ذلك، فله أن يتزوّج. وإنما لم يلزمه الطلاق إذا عمّم لأنه ضّيق على نفسه المناكح، فلو منعناه ألاّ يتزوّج لحرِج وخيف عليه العنت. وقد قال بعض أصحابنا: إنه إن وجد ما يتسرر به لم ينكِح؛ وليس بشيء، وذلك أن الضرورات والأعذار ترفع الأحكام، فيصير هذا من حيث الضرورة كمن لم يحلف، قاله ابن خُوَيْزِمَنْدَاد.\n\nالرابعة: استدلّ داود ـ ومن قال بقوله ـ إن المطلقة الرجعية إذا راجعها زوجها قبل أن تنقضي عدّتها ثم فارقها قبل أن يَمَسها، أنه ليس عليها أن تتم عدّتها ولا عدّةً مستقبلة؛ لأنها مطلقة قبل الدخول بها.\n                                   وقال عطاء بن أبي رباح وفرقة: تمضي في عدّتها من طلاقها الأوّل ـ وهو أحد قولي الشافعي ـ؛ لأن طلاقه لها إذا لم يمسها في حكم من طلقها في عدّتها قبل أن يراجعها. ومن طلّق امرأته في كل طُهر مرّة بنت ولم تستأنف. وقال مالك: إذا فارقها قبل أن يمسها إنها لا تبني على ما مضى من عدّتها، وإنها تنشىء من يوم طلقها عدّة مستقبلة. وقد ظلم زوجها نفسه وأخطأ إن كان ارتجعها ولا حاجة له بها. وعلى هذا أكثر أهل العلم؛ لأنها في حكم الزوجات المدخول بهن في النفقة والسكنى وغير ذلك؛ ولذلك تستأنف العدّة من يوم طلقت، وهو قول جمهور فقهاء البصرة والكوفة ومكة والمدينة والشام. وقال الثوريّ: أجمع الفقهاء عندنا على ذلك.\n\nالخامسة: فلو كانت بائنة غير مبتوتة فتزوّجها في العدّة ثم طلّقها قبل الدخول فقد اختلفوا في ذلك أيضاً، فقال مالك والشافعيّ وزفر وعثمان البَتِّي: لها نصف الصداق وتتم بقية العدّة الأولى. وهو قول الحسن وعطاء وعكرمة وابن شهاب. وقال أبو حنيفة وأبو يوسف والثَّوريّ والأوزاعيّ: لها مهر كامل للنكاح الثاني وعدّة مستقبلة. جعلوها في حكم المدخول بها لاعتدادها من مائه. وقال داود: لها نصف الصداق، وليس عليها بقية العدّة الأولى ولا عدّة مستقبلة. والأولى ما قاله مالك والشافعيّ، والله أعلم.\n\nالسادسة: هذه الآية مخصصة لقوله تعالى:\n{ وَٱلْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ ثَلاَثَةَ قُرُوۤءٍ }\n[البقرة: 228]، ولقوله:\n{ وَٱللاَّئِي يَئِسْنَ مِنَ ٱلْمَحِيضِ مِن نِّسَآئِكُمْ إِنِ ٱرْتَبْتُمْ فَعِدَّتُهُنَّ ثَلاَثَةُ أَشْهُرٍ }\n[الطلاق: 4]. وقد مضى في «البقرة»، ومضى فيها الكلام في المُتعة، فأغنى عن الإعادة هنا. { وَسَرِّحُوهُنَّ سَرَاحاً جَمِيلاً } فيه وجهان: أحدهما: أنه دفع المتعة بحسب المَيْسرة والعُسْرة، قاله ابن عباس. الثاني: أنه طلاقها طاهراً من غير جماع؛ قاله قتادة. وقيل: فسرحوهنّ بعد الطلاق إلى أهلهنّ، فلا يجتمع الرجل والمطلّقة في موضع واحد.\n\nالسابعة: قوله تعالى: { فَمَتِّعُوهُنَّ } قال سعيد: هي منسوخة بالآية التي في البقرة، وهي قوله:\n{ وَإِن طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةً فَنِصْفُ مَا فَرَضْتُمْ }\n[البقرة: 237] أي فلم يذكر المتعة. وقد مضى الكلام في هذا في «البقرة» مسوفى. وقوله: { وَسَرِّحُوهُنَّ } طلّقوهنّ. والتسريح كناية عن الطلاق عند أبي حنيفة، لأنه يستعمل في غيره فيحتاج إلى النية. وعند الشافعي صريح. وقد مضى في «البقرة» القول فيه فلا معنى للإعادة. { جَمِيلاً } سُنّة، غير بِدْعة.\n\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَكَحۡتُمُ ٱلۡمُؤۡمِنَٰتِ ثُمَّ طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمۡ عَلَيۡهِنَّ مِنۡ عِدَّةٖ تَعۡتَدُّونَهَاۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحٗا جَمِيلٗا ٩٤\n                                        \n                                        \n                                        \n                                        يخبر تعالى المؤمنين، أنهم إذا نكحوا المؤمنات، ثم طلقوهن من قبل أن يمسوهن، فليس عليهن في ذلك عدة يعتدها أزواجهن عليهن، وأمرهم بتمتيعهن بهذه الحالة، بشيء من متاع الدنيا، الذي يكون فيه جبر لخواطرهن، لأجل فراقهن، وأن يفارقوهن فراقًاً جميلاً من غير مخاصمة ولا مشاتمة ولا مطالبة، ولا غير ذلك. ويستدل بهذه الآية، على أن الطلاق لا يكون إلاّ بعد النكاح. فلو طلقها قبل أن ينكحها، أو علق طلاقها على نكاحها، لم يقع، لقوله: { إِذَا نَكَحْتُمُ ٱلْمُؤْمِنَاتِ ثُمَّ طَلَّقْتُمُوهُنَّ } فجعل الطلاق بعد النكاح، فدلّ على أنه قبل ذلك، لا محل له. وإذا كان الطلاق الذي هو فرقة تامة وتحريم تام، لا يقع قبل النكاح، فالتحريم الناقص، لظهار أو إيلاء ونحوه، من باب أولى وأحرى، أن لا يقع قبل النكاح، كما هو أصح قَوْلي العلماء. ويدل على جواز الطلاق، لأن اللّه أخبر به عن المؤمنين، على وجه لم يلمهم عليه، ولم يؤنبهم، مع تصدير الآية بخطاب المؤمنين. وعلى جوازه قبل المسيس، كما قال في الآية الأخرى:\n{ لاَّ جُنَاحَ عَلَيْكُمْ إِن طَلَّقْتُمُ ٱلنِّسَآءَ مَا لَمْ تَمَسُّوهُنَّ }\n[البقرة: 236] وعلى أن المطلقة قبل الدخول لا عدة عليها، بل بمجرد طلاقها يجوز لها التزوج، حيث لا مانع، وعلى أن عليها العدة بعد الدخول. وهل المراد بالدخول والمسيس الوطء، كما هو مُجمَع عليه؟ أو وكذلك الخلوة، ولو لم يحصل معها وطء، كما أفتى بذلك الخلفاء الراشدون، وهو الصحيح. فمن دخل عليها، وطئها أم لا، إذا خلا بها، وجب عليها العدة. وعلى أن المطلقة قبل المسيس تمتع على الموسع قدره، وعلى المقتر قدره، ولكن هذا، إذا لم يفرض لها مهر، فإن كان لها مهر مفروض، فإنه إذا طلق قبل الدخول تَنَصَّف المهر، وكفى عن المتعة، وعلى أنه ينبغي لمن فارق زوجته قبل الدخول أو بعده، أن يكون الفراق جميلاً، يحمد فيه كل منهما الآخر. ولا يكون غير جميل، فإن في ذلك من الشر المرتب عليه، من قدح كل منهما بالآخر، شيء كثير. وعلى أن العدة حق للزوج، لقوله: { فَمَا لَكُمْ عَلَيْهِنَّ مِنْ عِدَّةٍ } دل مفهومه، أنه لو طلقها بعد المسيس، كان له عليها عدة [وعلى أن المفارقة بالوفاة، تعتد مطلقاً، لقوله: { ثُمَّ طَلَّقْتُمُوهُنَّ } الآية]. وعلى أن من عدا غير المدخول بها، من المفارقات من الزوجات، بموت أو حياة، عليهن العدة.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا نَكَحۡتُمُ ٱلۡمُؤۡمِنَٰتِ ثُمَّ طَلَّقۡتُمُوهُنَّ مِن قَبۡلِ أَن تَمَسُّوهُنَّ فَمَا لَكُمۡ عَلَيۡهِنَّ مِنۡ عِدَّةٖ تَعۡتَدُّونَهَاۖ فَمَتِّعُوهُنَّ وَسَرِّحُوهُنَّ سَرَاحٗا جَمِيلٗا ٩٤"
    },
    {
      "number": 3583,
      "text": "يَا أَيُّهَا النَّبِيُّ إِنَّا أَحْلَلْنَا لَكَ أَزْوَاجَكَ اللَّاتِي آتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّا أَفَاءَ اللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالَاتِكَ اللَّاتِي هَاجَرْنَ مَعَكَ وَامْرَأَةً مُؤْمِنَةً إِنْ وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ إِنْ أَرَادَ النَّبِيُّ أَنْ يَسْتَنْكِحَهَا خَالِصَةً لَكَ مِنْ دُونِ الْمُؤْمِنِينَ ۗ قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِي أَزْوَاجِهِمْ وَمَا مَلَكَتْ أَيْمَانُهُمْ لِكَيْلَا يَكُونَ عَلَيْكَ حَرَجٌ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 50,
      "juz": 22,
      "manzil": 5,
      "page": 424,
      "ruku": 366,
      "hizbQuarter": 169,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحۡلَلۡنَا لَكَ أَزۡوَٰجَكَ ٱلَّٰتِيٓ ءَاتَيۡتَ أُجُورَهُنَّ وَمَا مَلَكَتۡ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيۡكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِي هَاجَرۡنَ مَعَكَ وَٱمۡرَأَةٗ مُّؤۡمِنَةً إِن وَهَبَتۡ نَفۡسَهَا لِلنَّبِيِّ إِنۡ أَرَادَ ٱلنَّبِيُّ أَن يَسۡتَنكِحَهَا خَالِصَةٗ لَّكَ مِن دُونِ ٱلۡمُؤۡمِنِينَۗ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَيۡهِمۡ فِيٓ أَزۡوَٰجِهِمۡ وَمَا مَلَكَتۡ أَيۡمَٰنُهُمۡ لِكَيۡلَا يَكُونَ عَلَيۡكَ حَرَجٞۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٠٥\n                                    \n                                    \n                                    يقول تعالى مخاطباً نبيه صلى الله عليه وسلم بأنه قد أحل له من النساء أزواجه اللاتي أعطاهن مهورهن، وهي الأجور ههنا، كما قاله مجاهد وغير واحد. وقد كان مهره لنسائه اثنتي عشرة أوقية ونشّاً وهو نصف أوقية، فالجميع خمسمائة درهم، إلا أم حبيبة بنت أبي سفيان فإنه أمهرها عنه النجاشي رحمه الله تعالى أربعمائة دينار، وإلا صفية بنت حيــــي فإنه اصطفاها من سبي خيبر، ثم أعتقها، وجعل عتقها صداقها، كذلك جويرية بنت الحارث المصطلقية، أدى عنها كتابتها إلى ثابت ابن قيس بن شماس، وتزوجها ــــ رضي الله عنهن أجمعين ــــ. وقوله تعالى { آتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيْكَ } أي وأباح لك التسري مما أخذت من المغانم، وقد ملك صفية وجويرية، فأعتقهما وتزوجهما، وملك ريحانة بنت شمعون النضرية ومارية القبطية أم ابنه إبراهيم عليهما السلام، وكانتا من السراري رضي الله عنهما. وقوله تعالى { وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالاَتِكَ } الآية، هذا عدل وسط بين الإفراط والتفريط، فإن النصارى لا يتزوجون المرأة، إلا إذا كان الرجل بينه وبينها سبعة أجداد فصاعداً، واليهود يتزوج أحدهم بنت أخيه وبنت أخته، فجاءت هذه الشريعة الكاملة الطاهرة بهدم إفراط النصارى، فأباح بنت العم والعمة، وبنت الخال والخالة، وتحريم ما فرطت فيه اليهود من إباحة بنت الأخ والأخت، وهذا شنيع فظيع، وإنما قال { وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالاَتِكَ } فوحد لفظ الذكر لشرفه، وجمع الإناث لنقصهن كقوله\n{ عَنِ ٱلْيَمِينِ وَٱلْشَّمَآئِلِ }\nالنحل 48\n{ يُخْرِجُهُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ }\nالبقرة 297\n{ وَجَعَلَ ٱلظُّلُمَـٰتِ وَٱلنُّورَ }\nالأنعام 1 وله نظائر كثيرة. وقوله تعالى { ٱللاَّتِى هَـٰجَرْنَ مَعَكَ } قال ابن أبي حاتم رحمه الله حدثنا محمد بن عمار بن الحارث الرازي، حدثنا عبيد الله بن موسى، حدثنا إسرائيل عن السدي عن أبي صالح عن أم هانىء قالت خطبني رسول الله صلى الله عليه وسلم فاعتذرت إليه، فعذرني، ثم أنزل الله تعالى { يٰأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحْلَلْنَا لَكَ أَزْوَاجَكَ ٱللاَّتِيۤ آتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالاَتِكَ ٱللاَّتِي هَاجَرْنَ مَعَكَ } قالت فلم أكن أحل له، ولم أكن ممن هاجر معه، كنت من الطلقاء. ورواه ابن جرير عن أبي كريب عن عبيد الله بن موسى به، ثم رواه ابن أبي حاتم من حديث إسماعيل بن أبي خالد عن أبي صالح عنها بنحوه، ورواه الترمذي في جامعه. وهكذا قال أبو رزين وقتادة إن المراد من هاجر معه إلى المدينة. وفي رواية عن قتادة { ٱللاَّتِى هَـٰجَرْنَ مَعَكَ } أي أسلمن، وقال الضحاك قرأ ابن مسعود { وَٱمْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ إِنْ أَرَادَ ٱلنَّبِيُّ أَن يَسْتَنكِحَهَا خَالِصَةً لَّكَ } الآية، أي ويحل لك أيها النبي المرأة المؤمنة إن وهبت نفسها لك أن تتزوجها بغير مهر، إن شئت ذلك.\n\n                                   وهذه الآية توالى فيها شرطان كقوله تعالى إخباراً عن نوح عليه السلام أنه قال لقومه\n{ وَلاَ يَنفَعُكُمْ نُصْحِىۤ إِنْ أَرَدْتُّ أَنْ أَنصَحَ لَكُمْ إِن كَانَ ٱللَّهُ يُرِيدُ أَن يُغْوِيَكُمْ }\nهود 34 وكقول موسى عليه السلام\n{ يٰقَوْمِ إِن كُنتُمْ ءَامَنْتُمْ بِٱللَّهِ فَعَلَيْهِ تَوَكَّلُوۤاْ إِن كُنْتُم مُّسْلِمِينَ }\nيونس 84 وقال ههنا { وَٱمْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ } الآية. وقد قال الإمام أحمد حدثنا إسحاق، أخبرنا مالك عن أبي حازم عن سهل بن سعد الساعدي أن رسول الله صلى الله عليه وسلم جاءته امرأة فقالت يا رسول الله إني قد وهبت نفسي لك، فقامت قياماً طويلاً، فقام رجل فقال يا رسول الله زوجنيها إن لم يكن لك بها حاجة، فقال رسول الله صلى الله عليه وسلم \" هل عندك من شيء تصدقها إياه؟ \" فقال ما عندي إلا إزاري هذا، فقال رسول الله صلى الله عليه وسلم \" إن أعطيتها إزارك، جلست لا إزار لك، فالتمس شيئاً \" فقال لا أجد شيئاً، فقال \" التمس، ولو خاتماً من حديد \" فالتمس فلم يجد شيئاً، فقال له النبي صلى الله عليه وسلم \" هل معك من القرآن شيء؟ \" قال نعم سورة كذا، وسورة كذا ــــ لسور يسميها ــــ فقال له النبي صلى الله عليه وسلم \" زوجتكها بما معك من القرآن \" أخرجاه من حديث مالك. وقال الإمام أحمد حدثنا عفان، حدثنا مرحوم، سمعت ثابتاً يقول كنت مع أنس جالساً، وعنده ابنة له، فقال أنس جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت يا نبي الله هل لك فِيَّ حاجة؟ فقالت ابنته ما كان أقل حياءها فقال \" هي خير منك، رغبت في النبي، فعرضت عليه نفسها \" انفرد بإخراجه البخاري من حديث مرحوم بن عبد العزيز عن ثابت البناني عن أنس به. وقال أحمد أيضاً حدثنا عبد الله بن بكر، حدثنا سنان بن ربيعة عن الحضرمي عن أنس بن مالك أن امرأة أتت النبي صلى الله عليه وسلم فقالت يا رسول الله ابنة لي كذا وكذا ــــ فذكرت من حسنها وجمالها ــــ فآثرتك بها، فقال \" قد قبلتها \" فلم تزل تمدحها حتى ذكرت أنها لم تصدع، ولم تشك شيئاً قط، فقال \" لا حاجة لي في ابتنك \" لم يخرجوه. وقال ابن أبي حاتم حدثنا أبي، حدثنا منصور بن أبي مزاحم، حدثنا ابن أبي الوضاح، يعني محمد بن مسلم، عن هشام بن عروة عن أبيه عن عائشة قالت التي وهبت نفسها للنبي صلى الله عليه وسلم خولة بنت حكيم.\n                                   وقال ابن وهب عن سعيد بن عبد الرحمن وابن أبي الزناد عن هشام بن عروة عن أبيه أن خولة بنت حكيم بن الأوقص من بني سليم كانت من اللاتي وهبن أنفسهن لرسول الله صلى الله عليه وسلم وفي رواية له عن سعيد بن عبد الرحمن عن هشام عن أبيه كنا نتحدث أن خولة بنت حكيم كانت وهبت نفسها لرسول الله صلى الله عليه وسلم وكانت امرأة صالحة. فيحتمل أن أم سليم هي خولة بنت حكيم، أو هي امرأة أخرى. وقال ابن أبي حاتم حدثنا محمد بن إسماعيل الأحمسي، حدثنا وكيع، حدثنا موسى بن عبيدة عن محمد بن كعب وعمربن الحكم وعبد الله بن عبيدة، قالوا تزوج رسول الله صلى الله عليه وسلم ثلاث عشرة امرأة، ستاً من قريش خديجة وعائشة وحفصة وأم حبيبة وسودة وأم سلمة، وثلاثاً من بني عامر بن صعصعة، وامرأتين من بني هلال بن عامر ميمونة بنت الحارث، وهي التي وهبت نفسها للنبي صلى الله عليه وسلم وزينب أم المساكين، وامرأة من بني بكر بن كلاب من القرظيات، وهي التي اختارت الدنيا، وامرأة من بني الجون، وهي التي استعاذت منه، وزينب بنت جحش الأسدية، والسبيتين صفية بنت حيي بن أخطب، وجويرية بنت الحارث بن عمرو بن المصطلق الخزاعية. وقال سعيد بن أبي عروبة عن قتادة عن ابن عباس { وَٱمْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ } قال هي ميمونة بنت الحارث، فيه انقطاع، هذا مرسل، والمشهور أن زينب التي كانت تدعى أم المساكين هي زينب بنت خزيمة الأنصارية، وقد ماتت عند النبي صلى الله عليه وسلم في حياته، فالله أعلم. والغرض من هذا أن اللاتي وهبن أنفسهن للنبي صلى الله عليه وسلم كثير، كما قال البخاري حدثنا زكريا بن يحيى، حدثنا أبو أسامة قال حدثنا هشام بن عروة عن أبيه عن عائشة قالت كنت أغار من اللاتي وهبن أنفسهن للنبي صلى الله عليه وسلم وأقول أتهب المرأة نفسها؟ فلما أنزل الله تعالى { تُرْجِى مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِىۤ إِلَيْكَ مَن تَشَآءُ وَمَنِ ٱبْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلاَ جُنَاحَ عَلَيْكَ } قلت ما أرى ربك إلا يسارع في هواك. وقد قال ابن أبي حاتم حدثنا علي بن الحسين، حدثنا محمد بن منصور الجعفي، حدثنا يونس بن بكير عن عنبسة بن الأزهر عن سماك عن عكرمة عن ابن عباس قال لم يكن عند رسول الله صلى الله عليه وسلم امرأة وهبت نفسها له. ووراه ابن جرير عن أبي كريب عن يونس بن بكير، أي أنه لم يقبل واحدة ممن وهبت نفسها له وإن كان ذلك مباحاً له ومخصوصاً به لأنه مردود إلى مشيئته كما قال الله تعالى { إِنْ أَرَادَ ٱلنَّبِىُّ أَن يَسْتَنكِحَهَا } أي إن اختار ذلك.\n                                   وقوله تعالى { خَالِصَةً لَّكَ مِن دُونِ ٱلْمُؤْمِنِينَ } قال عكرمة أي لا تحل الموهوبة لغيرك، ولو أن امرأة وهبت نفسها لرجل، لم تحل له حتى يعطيها شيئاً، وكذا قال مجاهد والشعبي وغيرهما، أي إنها إذا فوضت المرأة نفسها إلى رجل، فإنه متى دخل بها، وجب عليه لها مهر مثلها، كما حكم به رسول الله صلى الله عليه وسلم في بروع بنت واشق، لما فوضت، فحكم لها رسول الله صلى الله عليه وسلم بصداق مثلها لما توفي عنها زوجها، والموت والدخول سواء في تقرير المهر، وثبوت مهر المثل في المفوضة لغير النبي صلى الله عليه وسلم فأما هو عليه الصلاة والسلام، فإنه لا يجب عليه للمفوضة شيء، ولو دخل بها، لأن له أن يتزوج بغير صداق ولا ولي، ولا شهود، كما في قصة زينب بنت جحش رضي الله عنها، ولهذا قال قتادة في قوله { خَالِصَةً لَّكَ مِن دُونِ ٱلْمُؤْمِنِينَ } يقول ليس لا مرأة تهب نفسها لرجل بغير ولي ولا مهر إلا للنبي صلى الله عليه وسلم وقوله تعالى { قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِىۤ أَزْوَٰجِهِـمْ وَمَا مَلَكَتْ أَيْمَـٰنُهُمْ } قال أبي بن كعب ومجاهد والحسن وقتادة وابن جرير في قوله { قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِىۤ أَزْوَٰجِهِـمْ } أي من حصرهم في أربع نسوة حرائر، وما شاؤوا من الإماء، واشتراط الولي والمهر والشهود عليهم، وهم الأمة، وقد رخصنا لك في ذلك، فلم نوجب عليك شيئاً منه { لِكَيْلاَ يَكُونَ عَلَيْكَ حَرَجٌ وَكَانَ ٱللَّهُ غَفُوراً رَّحِيماً }.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحۡلَلۡنَا لَكَ أَزۡوَٰجَكَ ٱلَّٰتِيٓ ءَاتَيۡتَ أُجُورَهُنَّ وَمَا مَلَكَتۡ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيۡكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِي هَاجَرۡنَ مَعَكَ وَٱمۡرَأَةٗ مُّؤۡمِنَةً إِن وَهَبَتۡ نَفۡسَهَا لِلنَّبِيِّ إِنۡ أَرَادَ ٱلنَّبِيُّ أَن يَسۡتَنكِحَهَا خَالِصَةٗ لَّكَ مِن دُونِ ٱلۡمُؤۡمِنِينَۗ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَيۡهِمۡ فِيٓ أَزۡوَٰجِهِمۡ وَمَا مَلَكَتۡ أَيۡمَٰنُهُمۡ لِكَيۡلَا يَكُونَ عَلَيۡكَ حَرَجٞۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٠٥\n                                    \n                                    \n                                    فيه تسع عشرة مسألة:\n\nالأولى: روى السّدّي عن أبي صالح عن أم هانىء بنت أبي طالب قالت: خطبني رسول الله صلى الله عليه وسلم فاعتذرت إليه فعذرني؛ ثم أنزل الله تعالى: { إِنَّآ أَحْلَلْنَا لَكَ أَزْوَاجَكَ ٱللاَّتِيۤ آتَيْتَ أُجُورَهُنَّ وَمَا مَلَكَتْ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيْكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالاَتِكَ ٱللاَّتِي هَاجَرْنَ مَعَكَ } قالت: فلم أكن أحل له؛ لأني لم أهاجر، كنت من الطُّلقاء. خرّجه أبو عيسى وقال: هذا حديث حسن لا نعرفه إلا من هذا الوجه. قال ابن العربيّ: وهو ضعيف جداً، ولم يأتِ هذا الحديث من طريق صحيح يُحتجّ بها.\n\nالثانية: لما خير رسول الله صلى الله عليه وسلم نساءه فاخترنه، حَرُم عليه التزوّج بغيرهن والاستبدال بهنّ، مكافأة لهن على فعلهن. والدليل على ذلك قوله تعالى: { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } الآية. وهل كان يحلّ له أن يطلق واحدة منهن بعد ذلك؟ فقيل: لا يحل له ذلك جزاءً لهن على اختيارهن له. وقيل: كان يَحِلّ له ذلك كغيره من الناس ولكن لا يتزوّج بدلها. ثم نسخ هذا التحريم فأباح له أن يتزوّج بمن شاء عليهن من النساء، والدليل عليه قوله تعالى: { إِنَّآ أَحْلَلْنَا لَكَ أَزْوَاجَكَ } والإحلال يقتضي تقدّم حَظْر. وزوجاته اللاتي في حياته لم يكنّ محرمات عليه، وإنما كان حرم عليه التزويج بالأجنبيات فانصرف الإحلال إليهن، ولأنه قال في سياق الآية { وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ } الآية. ومعلوم أنه لم يكن تحته أحد من بنات عمه ولا من بنات عماته ولا من بنات خاله ولا من بنات خالاته، فثبت أنه أحلّ له التزويج بهذا ابتداء. وهذه الآية وإن كانت مقدمة في التلاوة فهي متأخرة النزول على الآية المنسوخة بها، كآيتي الوفاة في «البقرة».\n\nوقد اختلف الناس في تأويل قوله تعالى: { إِنَّآ أَحْلَلْنَا لَكَ أَزْوَاجَكَ } فقيل: المراد بها أن الله تعالى أحلّ له أن يتزوّج كل امرأة يؤتيها مهرها، قاله ابن زيد والضحاك. فعلى هذا تكون الآية مبيحة جميع النساء حاشا ذوات المحارم. وقيل: المراد أحلَلْنا لك أزواجك، أي الكائنات عندك، لأنهن قد اخترنك على الدنيا والآخرة، قاله الجمهور من العلماء. وهو الظاهر، لأن قوله: { آتَيْتَ أُجُورَهُنَّ } ماضٍ، ولا يكون الفعل الماضي بمعنى الاستقبال إلا بشروط. ويجيء الأمر على هذا التأويل ضيّقاً على النبيّ صلى الله عليه وسلم. ويؤيد هذا التأويل ما قاله ابن عباس: كان رسول الله صلى الله عليه وسلم يتزوج في أيّ الناس شاء، وكان يشقّ ذلك على نسائه، فلما نزلت هذه الآية وحرم عليه بها النساء إلا مَن سُمِّيَ، سُرّ نساؤه بذلك.\n\nقلت: والقول الأوّل أصح لما ذكرناه.\n                                   ويدلّ أيضاً على صحته ما خرّجه الترمذيّ عن عطاء قال: قالت عائشة رضي الله عنها: ما مات رسول الله صلى الله عليه وسلم حتى أحلّ الله تعالى له النساء. قال: هذا حديث حسن صحيح.\n\nالثالثة: قوله تعالى: { وَمَا مَلَكَتْ يَمِينُكَ } أحلّ الله تعالى السراري لنبيّه صلى الله عليه وسلم ولأمّته مطلقاً، وأحل الأزواج لنبيّه عليه الصلاة والسلام مطلقاً، وأحلّه للخلق بعدَدٍ. وقوله: { مِمَّآ أَفَآءَ ٱللَّهُ عَلَيْكَ } أي ردّه عليك من الكفار. والغنيمة قد تسمى فيئاً؛ أي مما أفاء الله عليك من النساء بالمأخوذ على وجه القهر والغلبة.\n\nالرابعة: قوله تعالى: { وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ } أي أحللنا لك ذلك زائداً من الأزواج اللاتي آتيت أجورهن وما ملكت يمينك، على قول الجمهور؛ لأنه لو أراد أحللنا لك كل امرأة تزوجتَ وآتيت أجرها، لما قال بعد ذلك: «وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ» لأن ذلك داخل فيما تقدّم.\n\nقلت: وهذا لا يلزم، وإنما خصّ هؤلاء بالذكر تشريفاً؛ كما قال تعالى:\n{ فِيهِمَا فَاكِهَةٌ وَنَخْلٌ وَرُمَّانٌ }\n[الرحمن: 68]. والله أعلم.\n\nالخامسة: قوله تعالى: { ٱللاَّتِي هَاجَرْنَ مَعَكَ } فيه قولان: الأوّل: لا يحلّ لك من قرابتك كبنات عمك العباس وغيره من أولاد عبد المطلب، وبنات أولاد بنات عبد المطلب، وبنات الخال من ولد بنات عبد مناف بن زُهْرة إلا من أسلم؛ لقوله صلى الله عليه وسلم: \" المسلم من سلم المسلمون من لسانه ويده والمهاجِر من هجر ما نهى الله تعالى عنه \" الثاني: لا يحلّ لك منهن إلا من هاجر إلى المدينة؛ لقوله تعالى:\n{ وَٱلَّذِينَ آمَنُواْ وَلَمْ يُهَاجِرُواْ مَا لَكُمْ مِّن وَلاَيَتِهِم مِّن شَيْءٍ حَتَّىٰ يُهَاجِرُواْ }\n[الأنفال: 72] ومن لم يهاجر لم يَكْمُل، ومَن لم يكمل لم يصلح للنبيّ صلى الله عليه وسلم الذي كَمُل وشَرُف وعَظُم، صلى الله عليه وسلم.\n\nالسادسة: قوله تعالى: { مَعَكَ } المَعِيّة هنا الاشتراك في الهجرة لا في الصحبة فيها؛ فمن هاجر حلّ له، كان في صحبته إذ هاجر أو لم يكن. يقال: دخل فلان معي وخرج معي؛ أي كان عمله كعملي وإن لم يقترن فيه عَمَلُكما. ولو قلت: خرجنا معاً لاقتضى ذلك المعنيين جميعاً: الاشتراك في الفعل، والاقتران (فيه).\n\nالسابعة: ذكر الله تبارك وتعالى العمّ فَرْداً والعمّات جمعاً. وكذلك قال: «خَالِكَ»، «وَخَالاَتِكَ» والحكمة في ذلك: أن العمّ والخال في الإطلاق اسم جنس كالشاعر والراجز؛ وليس كذلك العمة والخالة. وهذا عُرْف لغويّ، فجاء الكلام عليه بغاية البيان لرفع الإشكال، وهذا دقيق فتأملوه؛ قاله ابن العربي.\n\nالثامنة: قوله تعالى: { وَٱمْرَأَةً مُّؤْمِنَةً } عطف على «أَحْلَلْنَا». المعنى وأحللنا لك امرأة تَهَب نفسها من غير صداق. وقد اختلف في هذا المعنى؛ فروي عن ابن عباس أنه قال؛ لم تكن عند رسول الله صلى الله عليه وسلم امرأة إلا بعقد نكاح أو مِلك يمين.\n                                   فأما الهبة فلم يكن عنده منهن أحد. وقال قوم: كانت عنده موهوبة.\n\nقلت: والذي في الصحيحين يقوّي هذا القول ويَعْضُدُه؛ روى مسلم عن عائشة رضي الله عنها أنها قالت: كنت أغار على اللاتي وَهَبْنَ أنفسهن لرسول الله صلى الله عليه وسلم وأقول: أما تستحيي امرأة تَهَب نفسها لرجل! حتى أنزل الله تعالى: { تُرْجِي مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِيۤ إِلَيْكَ مَن تَشَآءُ } فقلت: والله ما أرى رَبَّكَ إلا يسارع في هواك. وروى البخاريّ عن عائشة أنها قالت: كانت خَوْلة بنت حكيم من اللائي وهبن أنفسهنّ لرسول الله صلى الله عليه وسلم. فدلّ هذا على أنهن كنّ غير واحدة. والله تعالى أعلم. الزَّمَخْشَرِيّ: وقيل الموهبات أربع: ميمونة بنت الحارث، وزينب بنت خزيمة أم المساكين الأنصارية، وأم شريك بنت جابر، وخَوْلة بنت حكيم.\n\nقلت: وفي بعض هذا اختلاف. قال قتادة: هي ميمونة بنت الحارث. وقال الشعبيّ: هي زينب بنت خزيمة أم المساكين امرأة من الأنصار. وقال عليّ بن الحسين والضحاك ومقاتل: هي أم شريك بنت جابر الأسدية. وقال عروة ابن الزبير: أم حكيم بنت الأوقص السلمية.\n\nالتاسعة: وقد اختلف في اسم الواهبة نفسها؛ فقيل هي أم شريك الأنصارية، اسمها غُزِيّة. وقيل غُزَيلة. وقيل ليلى بنت حكيم. وقيل: هي ميمونة بنت الحارث حين خطبها النبيّ صلى الله عليه وسلم، فجاءها الخاطب وهي على بعيرها فقالت: البعير وما عليه لرسول الله صلى الله عليه وسلم. وقيل: هي أم شريك العامرية، وكانت عند أبي العكر الأزدي. وقيل: عند الطُّفيل بن الحارث فولدت له شريكاً. وقيل: إن رسول الله صلى الله عليه وسلم تزوّجها؛ ولم يثبت ذلك. والله تعالى أعلم؛ ذكره أبو عمر بن عبد البر. وقال الشعبيّ وعروة: هي زينب بنت خزيمة أم المساكين. والله تعالى أعلم.\n\nالعاشرة: قرأ جمهور الناس «إِنْ وَهَبَتْ» بكسر الألف، وهذا يقتضي استئناف الأمر؛ أي إن وقع فهو حلال له. وقد روي عن ابن عباس ومجاهد أنهما قالا: لم يكن عند النبيّ صلى الله عليه وسلم امرأة موهوبة؛ وقد دللنا على خلافه. وروى الأئمة من طريق سهل وغيره في الصحاح: أن امرأة قالت لرسول الله صلى الله عليه وسلم: جئت أهب لك نفسي، فسكت حتى قام رجل فقال: زوجْنيها إن لم يكن لك بها حاجة. فلو كانت هذه الهبة غير جائزة لما سكت رسول الله صلى الله عليه وسلم؛ لأنه لا يقرّ على الباطل إذا سمعه؛ غير أنه يحتمل أن يكون سكوته منتظراً بياناً؛ فنزلت الآية بالتحليل والتخيير، فاختار تركها وزوّجها من غيره. ويحتمل أن يكون سكت ناظراً في ذلك حتى قام الرجل لها طالباً. وقرأ الحسن البصريّ وأُبَيّ بن كعب والشعبيّ «أنْ» بفتح الألف. وقرأ الأعمش «وَامْرَأَةً مُؤْمِنَةً وَهَبَتْ».\n                                   قال النحاس: وكسر «إنْ» أجمع للمعاني؛ لأنه قيل إنهن نساء. وإذا فتح كان المعنى على واحدة بعينها؛ لأن الفتح على البدل من امرأة، أو بمعنى لأن.\n\nالحادية عشرة: قوله تعالى: { مُّؤْمِنَةً } يدلّ على أن الكافرة لا تحلّ له. قال إمام الحرمين: وقد اختلف في تحريم الحرّة الكافرة عليه. قال ابن العربيّ: والصحيح عندي تحريمها عليه. وبهذا يتميز علينا؛ فإنه ما كان من جانب الفضائل والكرامة فحظه فيه أكثر، وما كان من جانب النقائص فجانبه عنها أطهر؛ فجوّز لنا نكاح الحرائر الكتابيات، وقصر هو صلى الله عليه وسلم لجلالته على المؤمنات. وإذا كان لا يحلّ له من لم تهاجر لنقصان فضل الهجرة فأحْرَى ألاّ تحل له الكافرة الكتابية لنقصان الكفر.\n\nالثانية عشرة: قوله تعالى: { إِن وَهَبَتْ نَفْسَهَا } دليل على أن النكاح عقد معاوضة على صفات مخصوصة، قد تقدمت في «النساء» وغيرها. وقال الزجاج: معنى: «إِنْ وَهَبَتْ نَفْسَهَا لِلنَّبِيّ» حلّت. وقرأ الحسن: «أن وهبت» بفتح الهمزة. و«أن» في موضع نصب. قال الزجاج: أي لأن. وقال غيره: «أن وهبت» بدل اشتمال من «امرأة».\n\nالثالثة عشرة: قوله تعالى: { إِنْ أَرَادَ ٱلنَّبِيُّ أَن يَسْتَنكِحَهَا } أي إذا وهبت المرأة نفسها وقبلها النبيّ صلى الله عليه وسلم حلت له، وإن لم يقبلها لم يلزم ذلك. كما إذا وهبت لرجل شيئاً فلا يجب عليه القبول؛ بَيْد أن من مكارم أخلاق نبيّنا أن يقبل من الواهب هبته. ويرى الأكارم أن ردّها هُجْنة في العادة، ووصمة على الواهب وأَذِيّة لقلبه؛ فبيّن الله ذلك في حق رسوله صلى الله عليه وسلم وجعله قرآنا يتلى؛ ليرفع عنه الحرج، ويبطل بُطْل الناس في عادتهم وقولهم.\n\nالرابعة عشرة: قوله تعالى: { خَالِصَةً لَّكَ } أي هبة النساء أنفسهن خالصة ومزية لا تجوز؛ فلا يجوز أن تَهَب المرأة نفسها لرجل. ووجه الخاصيّة أنها لو طلبت فرض المهر قبل الدخول لم يكن لها ذلك. فأما فيما بيننا فللمفوّضة طلب المهر قبل الدخول، ومهر المثل بعد الدخول.\n\nالخامسة عشرة: أجمع العلماء على أن هبة المرأة نفسها غير جائز، وأن هذا اللفظ من الهبة لا يتم عليه نكاح؛ إلا ما روي عن أبي حنيفة وصاحبيه فإنهم قالوا: إذا وهبت فأشهد هو على نفسه بمهر فذلك جائز. قال ابن عطية: فليس في قولهم إلا تجويز العبارة ولفظة الهبة، وإلا فالأفعال التي اشترطوها هي أفعال النكاح بعينه، وقد تقدمت هذه المسألة في «القصص» مستوفاة. والحمد لله.\n\nالسادسة عشرة: خصّ الله تعالى رسوله في أحكام الشريعة بمعان لم يشاركه فيها أحد ـ في باب الفرض والتحريم والتحليل ـ مزيّةً على الأمة وهبت له، ومرتبة خصّ بها؛ ففرِضت عليه أشياء ما فرضت على غيره، وحَرُمت عليه أفعال لم تحرم عليهم، وحللت له أشياء لم تحلل لهم؛ منها متفَق عليه ومختلف فيه.\n\n                                   فأما ما فُرض عليه فتسعة: الأوّل: التهجد بالليل؛ يقال: إن قيام الليل كان واجِباً عليه إلى أن مات؛ لقوله تعالى:\n{ يٰأَيُّهَا ٱلْمُزَّمِّلُ قُمِ ٱلْلَّيْلَ }\n[المزمل: 1 ـ 2] الآية. والمنصوص أنه كان واجباً عليه ثم نسخ بقوله تعالى:\n{ وَمِنَ ٱلْلَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَّكَ }\n[الإسراء: 79] وسيأتي. الثاني: الضُّحَا. الثالث: الأَضْحى. الرابع: الوتر؛ وهو يدخل في قسم التهجُّد. الخامس: السواك. السادس: قضاء دين من مات معسِرا. السابع: مشاورة ذوي الأحلام في غير الشرائع. الثامن: تخيير النساء. التاسع: إذا عمل عملاً أثبته. زاد غيره: وكان يجب عليه إذا رأى منكراً أنكره وأظهره، لأن إقراره لغيره على ذلك يدلّ على جوازه، ذكره صاحب البيان.\n\nوأما ما حرم عليه فجملته عشرة: الأوّل: تحريم الزكاة عليه وعلى آله. الثاني: صدقة التطوّع عليه، وفي آله تفصيل باختلاف. الثالث: خائنة الأعين، وهو أن يظهر خلاف ما يضمر، أو ينخدع عما يجب. وقد ذمّ بعضَ الكفار عند إذنه ثم ألان له القول عند دخوله. الرابع: حَرّم الله عليه إذا لبس لأْمته أن يخلعها عنه أو يحكم الله بينه وبين محاربه. الخامس: الأكل متّكئاً. السادس: أكل الأطعمة الكريهة الرائحة. السابع: التبدّل بأزواجه؛ وسيأتي. الثامن: نكاح امرأة تكره صحبته. التاسع: نكاح الحرّة الكتابية. العاشر: نكاح الأمة.\n\nوحرّم الله عليه أشياء لم يحرمها على غيره تنزيهاً له وتطهيراً. فحرّم الله عليه الكتابة وقول الشعر وتعليمه؛ تأكيداً لحجته وبياناً لمعجزته؛ قال الله تعالى:\n{ وَمَا كُنتَ تَتْلُواْ مِن قَبْلِهِ مِن كِتَابٍ وَلاَ تَخُطُّهُ بِيَمِينِكَ }\n[العنكبوت: 48]. وذكر النقاش أن النبيّ صلى الله عليه وسلم ما مات حتى كتب؛ والأوّل هو المشهور. وحرم عليه أن يمدّ عينيه إلى ما متّع به الناس؛ قال الله تعالى:\n{ لاَ تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِ أَزْوَاجاً مِّنْهُمْ }\n[الحجر: 88] الآية.\n\nوأما ما أحِلّ له صلى الله عليه وسلم فجملته ستة عشر: الأوّل: صَفِيّ المغنم. الثاني: الاستبداد بخمس الخمس أو الخمس. الثالث: الوصال. الرابع: الزيادة على أربع نسوة. الخامس: النكاح بلفظ الهبة. السادس: النكاح بغير ولِيّ. السابع: النكاح بغير صداق. الثامن: نكاحه في حالة الإحرام. التاسع: سقوط القَسْم بين الأزواج عنه؛ وسيأتي. العاشر: إذا وقع بصره على امرأة وجب على زوجها طلاقها؛ وحلّ له نكاحها. قال ابن العربي: هكذا قال إمام الحرمين، وقد مضى ما للعلماء في قصة زيد من هذا المعنى. الحادي عشر: أنه أعتق صفيّة وجعل عتقها صداقها. الثاني عشر: دخوله مكة بغير إحرام، وفي حقنا فيه اختلاف. الثالث عشر: القتال بمكة. الرابع عشر: أنه لا يورث. وإنما ذكر هذا في قسم التحليل لأن الرجل إذا قارب الموت بالمرض زال عنه أكثر ملكه، ولم يبق له إلا الثلث خالصاً، وبقي ملك رسول الله صلى الله عليه وسلم، على ما تقرّر بيانه في آية المواريث، وسورة «مريم» بيانه أيضاً.\n                                   الخامس عشر: بقاء زوجيّته من بعد الموت. السادس عشر: إذا طلّق امرأة تبقى حرمته عليها فلا تُنكح. وهذه الأقسام الثلاثة تقدّم معظمها مفصلاً في مواضعها. وسيأتي إن شاء الله تعالى.\n\nوأبيح له عليه الصلاة والسلام أخذ الطعام والشراب من الجائع والعطشان، وإن كان من هو معه يخاف على نفسه الهلاك، لقوله تعالى: { ٱلنَّبِيُّ أَوْلَىٰ بِٱلْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ }. وعلى كل أحد من المسلمين أن يَقِيَ النبي صلى الله عليه وسلم بنفسه. وأبيح له أن يحمي لِنفسه. وأكرمه الله بتحليل الغنائم. وجعلت الأرض له ولأمته مسجداً وطهوراً. وكان من الأنبياء (مَن) لا تصح صلاتهم إلا في المساجد. ونُصِر بالرُّعْب؛ فكان يخافه العدوّ من مسيرة شهر. وبُعث إلى كافة الخلق، وقد كان مَن قبله من الأنبياء يُبعث الواحد إلى بعض الناس دون بعض. وجُعلت معجزاته كمعجزات الأنبياء قبله وزيادة. وكانت معجزة موسى عليه السلام العصا وانفجارَ الماء من الصخرة. وقد انشق القمر للنبي صلى الله عليه وسلم، وخرج الماء من بين أصابعه صلى الله عليه وسلم. وكانت معجزة عيسى صلى الله عليه وسلم إحياء الموتى وإبراء الأكْمَه والأبرص. وقد سبّح الحصى في يد النبي صلى الله عليه وسلم، وحنّ الجِذع إليه؛ وهذا أبلغ. وفضّله الله عليهم بأن جعل القرآن معجزة له، وجعل معجزته فيه باقية إلى يوم القيامة، ولهذا جُعلت نبوَّته مؤبّدة لا تُنسخ إلى يوم القيامة.\n\nالسابعة عشرة: قوله تعالى: { أَن يَسْتَنكِحَهَا } أي ينكحها، يقال: نَكَح واستنكح؛ مثل عَجِب واستعجب، وعجِل واستعجل. ويجوز أن يَردِ الاستنكاح بمعنى طلب النكاح، أو طلب الوطء. و«خَالِصَةً» نصب على الحال، قاله الزجاج. وقيل: حال من ضمير متصل بفعل مضمر دلّ عليه المضمر، تقديره: أحللنا لك أزواجك، وأحللنا لك امرأة مؤمنة أحللناها خالصة، بلفظ الهبة وبغير صداق وبغير ولِيّ.\n\nالثامنة عشرة: قوله تعالى: { مِن دُونِ ٱلْمُؤْمِنِينَ } فائدته أن الكفار وإن كانوا مخاطبين بفروع الشريعة عندنا فليس لهم في ذلك دخول، لأن تصريف الأحكام إنما يكون فيهم على تقدير الإسلام.\n\nقوله تعالى: { قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِيۤ أَزْوَاجِهِـمْ } أي ما أوجبنا على المؤمنين، وهو ألا يتزوّجوا إلا أربع نسوة بمهر وبيّنة ووَلِيّ. قال معناه أُبَيّ بن كعب وقتادة وغيرهما.\n\nالتاسعة عشرة: قوله تعالى: { لِكَيْلاَ يَكُونَ عَلَيْكَ حَرَجٌ } أي ضيق في أمر أنت فيه محتاج إلى السّعة، أي بيّنا هذا البيان وشرحنا هذا الشرح «لِكَيْلاَ يَكُونَ عَلَيْكَ حَرَجٌ» فـ«ـلكيلا» متعلق بقوله: { إِنَّآ أَحْلَلْنَا لَكَ أَزْوَاجَكَ } أي فلا يضيق قلبك حتى يظهر منك أنك قد أثمت عند ربّك في شيء. ثم آنس تعالى جميع المؤمنين بغفرانه ورحمته فقال تعالى: { وَكَانَ ٱللَّهُ غَفُوراً رَّحِيماً }.\n\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحۡلَلۡنَا لَكَ أَزۡوَٰجَكَ ٱلَّٰتِيٓ ءَاتَيۡتَ أُجُورَهُنَّ وَمَا مَلَكَتۡ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيۡكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِي هَاجَرۡنَ مَعَكَ وَٱمۡرَأَةٗ مُّؤۡمِنَةً إِن وَهَبَتۡ نَفۡسَهَا لِلنَّبِيِّ إِنۡ أَرَادَ ٱلنَّبِيُّ أَن يَسۡتَنكِحَهَا خَالِصَةٗ لَّكَ مِن دُونِ ٱلۡمُؤۡمِنِينَۗ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَيۡهِمۡ فِيٓ أَزۡوَٰجِهِمۡ وَمَا مَلَكَتۡ أَيۡمَٰنُهُمۡ لِكَيۡلَا يَكُونَ عَلَيۡكَ حَرَجٞۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٠٥\n                                        \n                                        \n                                        \n                                        يقول تعالى، ممتناً على رسوله بإحلاله له ما أحل مما يشترك، هو والمؤمنون، وما ينفرد به ويختص: { يٰأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحْلَلْنَا لَكَ أَزْوَاجَكَ ٱللاَّتِيۤ آتَيْتَ أُجُورَهُنَّ } أي: أعطيتهن مهورهن، من الزوجات، وهذا من الأمور المشتركة بينه وبين المؤمنين [فإن المؤمنين]، كذلك يباح لهم ما آتوهن أجورهن من الأزواج. { وَ } كذلك أحللنا لك { مَا مَلَكَتْ يَمِينُكَ } أي: الإماء التي ملكت { مِمَّآ أَفَآءَ ٱللَّهُ عَلَيْكَ } من غنيمة الكفار من عبيدهم، والأحرار من لهن زوج منهم، ومَنْ لا زوج لهن، وهذا أيضاً مشترك. وكذلك من المشترك، قوله { وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّاتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَالاَتِكَ } شمل العم والعمة، والخال والخالة، القريبين والبعيدين، وهذا حصر المحللات. يؤخذ من مفهومه أن ما عداهن من الأقارب غير محلل، كما تقدم في سورة النساء، فإنه لا يباح من الأقارب من النساء، غير هؤلاء الأربع، وما عداهن من الفروع مطلقاً، والأصول مطلقاً، وفروع الأب والأم، وإن نزلوا، وفروع مَنْ فوقهم لصلبه، فإنه لا يباح. وقوله { ٱللاَّتِي هَاجَرْنَ مَعَكَ } قيد لحل هؤلاء للرسول، كما هو الصواب من القولين في تفسير هذه الآية، وأما غيره عليه الصلاة والسلام، فقد علم أن هذا قيد لغير الصحة. { وَ } أحللنا لك { ٱمْرَأَةً مُّؤْمِنَةً إِن وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ } بمجرد هبتها نفسها. { إِنْ أَرَادَ ٱلنَّبِيُّ أَن يَسْتَنكِحَهَا } أي: هذا تحت الإرادة والرغبة، { خَالِصَةً لَّكَ مِن دُونِ ٱلْمُؤْمِنِينَ } يعني: إباحة المُوَهِبَةِ. وأما المؤمنون، فلا يحل لهم أن يتزوجوا امرأة بمجرد هبتها نفسها لهم. { قَدْ عَلِمْنَا مَا فَرَضْنَا عَلَيْهِمْ فِيۤ أَزْوَاجِهِـمْ وَمَا مَلَكَتْ أَيْمَانُهُمْ } أي: قد علمنا ما على المؤمنين، وما يحل لهم، وما لا يحل من الزوجات وملك اليمين. وقد علمناهم بذلك، وبينا فرائضه. فما في هذه الآية، مما يخالف ذلك، فإنه خاص لك، لكون اللّه جعله خطاباً للرسول وحده بقوله: { يٰأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحْلَلْنَا لَكَ } إلى آخر الآية. وقوله: { خَالِصَةً لَّكَ مِن دُونِ ٱلْمُؤْمِنِينَ } وأبحنا لك يا أيها النبي ما لم نبح لهم، ووسعنا لك ما لم نوسع على غيرك، { لِكَيْلاَ يَكُونَ عَلَيْكَ حَرَجٌ } وهذا من زيادة اعتناء اللّه تعالى برسوله صلى اللّه عليه وسلم. { وَكَانَ ٱللَّهُ غَفُوراً رَّحِيماً } أي: لم يزل متصفاً بالمغفرة والرحمة، وينزل على عباده من مغفرته ورحمته وجوده وإحسانه، ما اقتضته حكمته، ووجدت منهم أسبابه.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِنَّآ أَحۡلَلۡنَا لَكَ أَزۡوَٰجَكَ ٱلَّٰتِيٓ ءَاتَيۡتَ أُجُورَهُنَّ وَمَا مَلَكَتۡ يَمِينُكَ مِمَّآ أَفَآءَ ٱللَّهُ عَلَيۡكَ وَبَنَاتِ عَمِّكَ وَبَنَاتِ عَمَّٰتِكَ وَبَنَاتِ خَالِكَ وَبَنَاتِ خَٰلَٰتِكَ ٱلَّٰتِي هَاجَرۡنَ مَعَكَ وَٱمۡرَأَةٗ مُّؤۡمِنَةً إِن وَهَبَتۡ نَفۡسَهَا لِلنَّبِيِّ إِنۡ أَرَادَ ٱلنَّبِيُّ أَن يَسۡتَنكِحَهَا خَالِصَةٗ لَّكَ مِن دُونِ ٱلۡمُؤۡمِنِينَۗ قَدۡ عَلِمۡنَا مَا فَرَضۡنَا عَلَيۡهِمۡ فِيٓ أَزۡوَٰجِهِمۡ وَمَا مَلَكَتۡ أَيۡمَٰنُهُمۡ لِكَيۡلَا يَكُونَ عَلَيۡكَ حَرَجٞۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا ٠٥"
    }
  ]
}