{
  "number": 425,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 3584,
      "text": "۞ تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ ۖ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ۚ ذَٰلِكَ أَدْنَىٰ أَنْ تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَا آتَيْتَهُنَّ كُلُّهُنَّ ۚ وَاللَّهُ يَعْلَمُ مَا فِي قُلُوبِكُمْ ۚ وَكَانَ اللَّهُ عَلِيمًا حَلِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 51,
      "juz": 22,
      "manzil": 5,
      "page": 425,
      "ruku": 366,
      "hizbQuarter": 170,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُ‍ٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا ١٥\n                                    \n                                    \n                                    قال الإمام أحمد حدثنا محمد بن بشر، حدثنا هشام بن عروة عن أبيه عن عائشة رضي الله عنها أنها كانت تغير من النساء اللاتي وهبن أنفسهن لرسول الله صلى الله عليه وسلم قالت ألا تستحي المرأة أن تعرض نفسها بغير صداق؟ فأنزل الله عز وجل { تُرْجِى مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِىۤ إِلَيْكَ مَن تَشَآءُ } الآية، قالت إني أرى ربك يسارع لك في هواك. وقد تقدم أن البخاري رواه من حديث أبي أسامة عن هشام بن عروة، فدل هذا على أن المراد بقوله { تُرْجِى } أي تؤخر { مَن تَشَآءُ مِنْهُنَّ } أي من الواهبات { وَتُؤْوِىۤ إِلَيْكَ مَن تَشَآءُ } أي من شئت قبلتها، ومن شئت رددتها، ومن رددتها، فأنت فيها أيضاً بالخيار بعد ذلك، إن شئت عدت فيها فآويتها، ولهذا قال { وَمَنِ ٱبْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلاَ جُنَاحَ عَلَيْكَ }. قال عامر الشعبي في قوله تعالى { تُرْجِى مَن تَشَآءُ مِنْهُنَّ } الآية، كن نساء وهبن أنفسهن للنبي صلى الله عليه وسلم فدخل ببعضهن، وأرجأ بعضهن لم ينكحن بعده، منهن أم شريك. وقال آخرون بل المراد بقوله { تُرْجِى مَن تَشَآءُ مِنْهُنَّ } الآية، أي من أزواجك، لا حرج عليك أن تترك القسم لهن، فتقدم من شئت، وتؤخر من شئت، وتجامع من شئت، وتترك من شئت، هكذا يروى عن ابن عباس ومجاهد والحسن وقتادة وأبي رزين وعبد الرحمن بن زيد بن أسلم وغيرهم، ومع هذا كان النبي صلى الله عليه وسلم يقسم لهن، ولهذا ذهب طائفة من الفقهاء من الشافعية وغيرهم إلى أنه لم يكن القسم واجباً عليه صلى الله عليه وسلم واحتجوا بهذه الآية الكريمة. وقال البخاري حدثنا حبان بن موسى، حدثنا عبد الله، هو ابن المبارك، وأخبرنا عاصم الأحول عن معاذ عن عائشة أن رسول الله صلى الله عليه وسلم كان يستأذن في اليوم المرأة منا بعد أن أنزلت هذه الآية { تُرْجِى مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِىۤ إِلَيْكَ مَن تَشَآءُ وَمَنِ ٱبْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلاَ جُنَاحَ عَلَيْكَ } فقلت لها ما كنت تقولين؟ فقالت كنت أقول إن كان ذلك إلي، فإني لا أريد يا رسول الله أن أوثر عليك أحداً، فهذا الحديث عنها يدل على أن المراد من ذلك عدم وجود القسم، وحديثها الأول يقتضي أن الآية نزلت في الواهبات، ومن ههنا اختار ابن جرير أن الآية عامة في الواهبات، وفي النساء اللاتي عنده أنه مخير فيهن، إن شاء قسم، وإن شاء لم يقسم، وهذا الذي اختاره حسن جيد قوي، وفيه جمع بين الأحاديث، ولهذا قال تعالى { ذَلِكَ أَدْنَىٰ أَن تَقَرَّ أَعْيُنُهُنَّ وَلاَ يَحْزَنَّ وَيَرْضَيْنَ بِمَآ ءَاتَيْتَهُنَّ كُلُّهُنَّ } أي إذا علمن أن الله قد وضع عنك الحرج في القسم، فإن شئت قسمت، وإن شئت لم تقسم، لا جناح عليك في أي ذلك فعلت، ثم مع هذا إن تقسم لهن اختياراً منك، لا أنه على سبيل الوجوب، فرحن بذلك، واستبشرن به، وحملن جميلك في ذلك، واعترفن بمنتك عليهن في قسمتك لهن، وتسويتك بينهن، وإنصافك لهن، وعدلك فيهن.\n\n                                   وقوله تعالى { وَٱللَّهُ يَعْلَمُ مَا فِى قلُوبِكُمْ } أي من الميل إلى بعضهن دون بعض مما لا يمكن دفعه كما قال الإمام أحمد حدثنا يزيد، حدثنا حماد بن سلمة عن أيوب عن أبي قلابة عن عبد الله بن يزيد عن عائشة قالت كان رسول الله صلى الله عليه وسلم يقسم بين نسائه فيعدل، ثم يقول \" اللهم هذا فعلي فيما أملك، فلا تلمني فيما تملك ولا أملك \" ورواه أهل السنن الأربعة من حديث حماد بن سلمة، وزاد أبو داود بعد قوله \" فلا تلمني فيما تملك ولا أملك \" يعني القلب. وإسناده صحيح، ورجاله كلهم ثقات، ولهذا عقب ذلك بقوله تعالى { وَكَانَ ٱللَّهُ عَلِيماً } أي بضمائر السرائر { حَلِيماً } أي يحلم ويغفر.\n                                    ",
        "qortoby": "۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُ‍ٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا ١٥\n                                    \n                                    \n                                    فيه إحدى عشرة مسألة:\n\nالأولى: قوله تعالى: { تُرْجِي مَن تَشَآءُ } قرىء مهموزاً وغير مهموز، وهما لغتان، يقال: أرجيت الأمر وأرجأته إذا أخرته. { وَتُؤْوِيۤ } تَضُمّ، يقال: آوى إليه (ممدودة الألف) ضمّ إليه. وأوى (مقصورة الألف) انضمّ إليه.\n\nالثانية: واختلف العلماء في تأويل هذه الآية، وأصح ما قيل فيها. التوسعة على النبيّ صلى الله عليه وسلم في ترك القَسْم، فكان لا يجب عليه القَسْم بين زوجاته. وهذا القول هو الذي يناسب ما مضى، وهو الذي ثبت معناه في الصحيح عن عائشة رضي الله عنها؛ قالت: كنت أغار على اللائي وهبن أنفُسَهُن لرسول الله صلى الله عليه وسلم وأقول: أوتهب المرأة نفسها لرجل؟ فلما أنزل الله عز وجل: { تُرْجِي مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِيۤ إِلَيْكَ مَن تَشَآءُ وَمَنِ ٱبْتَغَيْتَ مِمَّنْ عَزَلْتَ } قالت: قلت والله ما أرى ربك إلا يسارع في هواك. قال ابن العربيّ: هذا الذي ثبت في الصحيح هو الذي ينبغي أن يعوّل عليه. والمعنى المراد: هو أن النبيّ صلى الله عليه وسلم كان مخيَّراً في أزواجه، إن شاء أن يَقْسِم قَسَم، وإن شاء أن يترك القَسم ترك. فخص النبيّ صلى الله عليه وسلم بأن جعل الأمر إليه فيه؛ لكنه كان يقسم من قِبل نفسه دون أن فرض ذلك عليه، تطييباً لنفوسهنّ، وصوناً لهنّ عن أقوال الغَيْرة التي تؤدي إلى ما لا ينبغي. وقيل: كان القَسْم واجباً على النبي صلى الله عليه وسلم ثم نسخ الوجوب عنه بهذا الآية. قال أبو رَزين: كان رسول الله صلى الله عليه وسلم قد همّ بطلاق بعض نسائه فقلن له: اقسم لنا ما شئت. فكان ممن آوى عائشة وحفصة وأم سلمة وزينب، فكان قسمتهنّ من نفسه وماله سواء بينهنّ. وكان ممن أرجى سودة وجُوَيْرِية وأم حبيبة وميمونة وصفية؛ فكان يقسم لهنّ ما شاء. وقيل: المراد الواهبات. روى هشام بن عروة عن أبيه عن عائشة في قوله: «تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ» قالت: هذا في الواهبات أنفسهنّ. قال الشعبيّ: هنّ الواهبات أنفسهنّ؛ تزوّج رسول الله صلى الله عليه وسلم منهنّ وترك منهنّ. وقال الزُّهْري: ما علمنا أن رسول الله صلى الله عليه وسلم أرجأ أحداً من أزواجه، بل آواهن كلهن. وقال ابن عباس وغيره: المعنى في طلاق من شاء ممن حصل في عصمته، وإمساك من شاء. وقيل غير هذا. وعلى كلّ معنًى فالآية معناها التوسعة على رسول الله صلى الله عليه وسلم والإباحة. وما اخترناه أصح والله أعلم.\n\nالثالثة: ذهب هبة الله في الناسخ والمنسوخ إلى أن قوله: { تُرْجِي مَن تَشَآءُ } الآية، ناسخ لقوله:\n{ لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ }\n[الأحزاب: 52] الآية.\nوقال: ليس في كتاب الله ناسخ تقدّم المنسوخَ سوى هذا. وكلامه يضعف من جهات. وفي «البقرة» عدّة المتوفى عنها أربعة أشهر وعشر، وهو ناسخ للحول وقد تقدّم عليه.\n\nالرابعة: قوله تعالى: { وَمَنِ ٱبْتَغَيْتَ مِمَّنْ عَزَلْتَ } «ابْتَغَيْت» طلبت؛ والابتغاء الطلب. و«عَزَلْت» أزلت؛ والعزلة الإزالة، أي إن أردت أن تؤوي إليك امرأة ممن عزلتهن من القسمة وتضمّها إليك فلا بأس عليك في ذلك. وكذلك حكم الإرجاء، فدلّ أحد الطرفين على الثاني.\n\nالخامسة: قوله تعالى: { فَلاَ جُنَاحَ عَلَيْكَ } أي لا ميل، يقال: جنحت السفينة أي مالت إلى الأرض. أي لا ميل عليك باللوم والتوبيخ.\n\nالسادسة: قوله تعالى: { ذَلِكَ أَدْنَىٰ أَن تَقَرَّ أَعْيُنُهُنَّ } قال قتادة وغيره: أي ذلك التخيير الذي خيّرناك في صحبتهن أدنى إلى رضاهن إذ كان من عندنا؛ لأنهن إذا علمن أن الفعل من الله قرّت أعينهن بذلك ورضين؛ لأن المرء إذا علم أنه لا حق له في شيء كان راضياً بما أوتي منه وإن قلّ. وإن علم أن له حقًّا لم يقنعه ما أوتي منه، واشتدت غَيْرته عليه وعَظُمَ حرصه فيه. فكان ما فعل الله لرسوله من تفويض الأمر إليه في أحوال أزواجه أقرب إلى رضاهن معه، وإلى استقرار أعينهن بما يسمح به لهن، دون أن تتعلق قلوبهن بأكثر منه. وقرىء: «تُقِرّ أعينَهن» بضم التاء ونصب الأعين. «وتُقَرّ أعينُهن» على البناء للمفعول. وكان عليه السلام مع هذا يشدد على نفسه في رعاية التسوية بينهن، تطييباً لقلوبهن ـ كما قدّمناه ـ ويقول: \" اللهم هذه قدرتي فيما أملك فلا تلمني فيما تملك ولا أملك \" يعني قلبه؛ لإيثاره عائشة رضي الله عنها دون أن يكون يظهر ذلك في شيء من فعله. وكان في مرضه الذي توفي فيه يطاف به محمولاً على بيوت أزواجه، إلى أن استأذنهن أن يقيم في بيت عائشة. قالت عائشة: \" أوّل ما اشتكى رسول الله صلى الله عليه وسلم في بيت ميمونة، فاستأذن أزواجه أن يمرّض في بيتها ـ يعني بيت عائشة ـ فأذِنّ له... \" الحديث، خرجه الصحيح. وفي الصحيح أيضاً \" عن عائشة رضي الله عنها قالت: إن كان رسول الله صلى الله عليه وسلم ليتفقد، يقول: «أين أنا اليوم أين أنا غداً» استبطاء ليوم عائشة رضي الله عنها. قالت: فلما كان يومي قبضه الله تعالى بين سَحْري ونَحْري؛ صلى الله عليه وسلم \".\n                                     السابعة: على الرجل أن يعدِل بين نسائه لكل واحدة منهن يوماً وليلة؛ هذا قول عامة العلماء. وذهب بعضهم إلى وجوب ذلك في الليل دون النهار. ولا يُسقِط حقّ الزوجة مرضُها ولا حَيضُها، ويلزمه المقام عندها في يومها وليلتها. وعليه أن يعدل بينهن في مرضه كما يفعل في صحته؛ إلا أن يَعْجِز عن الحركة فيقيم حيث غلب عليه المرض، فإذا صحَّ استأنف القَسم.\n                                     والإماء والحرائر والكتابيات والمسلمات في ذلك سواء. قال عبد الملك: للحُرّة ليلتان وللأمة ليلة. وأما السراري فلا قَسْم بينهن وبين الحرائر، ولا حظّ لهن فيه.\n\nالثامنة: ولا يجمع بينهن في منزل واحد إلا برضاهن، ولا يدخل لإحداهن في يوم الأخرى وليلتها لغير حاجة. واختلف في دخوله لحاجة وضرورة؛ فالأكثرون على جوازه؛ مالك وغيره. وفي كتاب ابن حبيب منعه. وروى ابن بكير عن مالك عن يحيـى بن سعيد أن معاذ بن جبل كانت له امرأتان، فإذا كان يوم هذه لم يشرب من بيت الأخرى الماء. قال ابن بكير: وحدّثنا مالك عن يحيـى بن سعيد أن معاذ بن جبل كانت له امرأتان ماتتا في الطاعون. فأسهم بينهما أيهما تدلى أوّل.\n\nالتاسعة: قال مالك: ويعدل بينهن في النفقة والكسوة إذا كن معتدلات الحال، ولا يلزم ذلك في المختلفات المناصب. وأجاز مالك أن يفضل إحداهما في الكسوة على غير وجه الميل. فأما الحُبّ والبغض فخارجان عن الكسب فلا يتأتّى العدل فيهما، وهو المعنيّ بقوله صلى الله عليه وسلم في قَسْمه: \" اللهم هذا فِعلي فيما أملك فلا تلمني فيما تملك ولا أملك \" أخرجه النسائي وأبو داود عن عائشة رضي الله عنها. وفي كتاب أبي داود «يعني القلب»، وإليه الإشارة بقوله تعالى:\n{ وَلَن تَسْتَطِيعُوۤاْ أَن تَعْدِلُواْ بَيْنَ ٱلنِّسَآءِ وَلَوْ حَرَصْتُمْ }\n[النساء: 129]، وقوله تعالى: { وَٱللَّهُ يَعْلَمُ مَا فِي قلُوبِكُمْ }. وهذا هو وجه تخصيصه بالذكر هنا، تنبيهاً منه لنا على أنه يعلم ما في قلوبنا من ميل بعضنا إلى بعض مَن عندنا من النساء دون بعض، وهو العالِم بكل شيء\n{ لاَ يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي ٱلأَرْضِ وَلاَ فِي ٱلسَّمَآءِ }\n[آل عمران: 5]\n{ يَعْلَمُ ٱلسِّرَّ وَأَخْفَى }\n[طه: 7] لكنه سَمَح في ذلك، إذ لا يستطيع العبد أن يصرف قلبه عن ذلك الميل، وإلى ذلك يعود قوله: { وَكَانَ ٱللَّهُ غَفُوراً رَّحِيماً }. وقد قيل في قوله: { ذَلِكَ أَدْنَىٰ أَن تَقَرَّ أَعْيُنُهُنَّ } وهي:\n\nالعاشرة: أي ذلك أقرب ألاّ يحزنّ إذا لم يجمع إحداهن مع الأخرى ويعاين الأثَرَة والميل. وروى أبو داود عن أبي هريرة عن النبي صلى الله عليه وسلم قال: \" من كانت له امرأتان فمال إلى إحداهما جاء يوم القيامة وشِقه مائل \" { وَيَرْضَيْنَ بِمَآ آتَيْتَهُنَّ كُلُّهُنَّ } توكيد للضمير، أي ويرضين كلهن. وأجاز أبو حاتم والزجاج «وَيَرْضَيْنَ بِمَا آتَيْتَهُنَّ كُلُّهُنَّ» على التوكيد للمضمر الذي في «آتيتهن». والفراء لا يجيزه، لأن المعنى ليس عليه، إذ كان المعنى وترضى كل واحدة منهن، وليس المعنى بما أعطيتهن كلهن. النحاس: والذي قاله حسن.\n\nالحادية عشرة: قوله تعالى: { وَٱللَّهُ يَعْلَمُ مَا فِي قلُوبِكُمْ } خبر عام، والإشارة إلى ما في قلب رسول الله صلى الله عليه وسلم من محبة شخص دون شخص.\n                                    وكذلك يدخل في المعنى أيضاً المؤمن. وفي البخاريّ \" عن عمرو بن العاص: أن النبيّ صلى الله عليه وسلم بعثه على جيش ذات السلاسل، فأتيته فقلت: أيّ الناس أحبّ إليك؟ فقال: «عائشة» فقلت: من الرجال؟ قال: «أبوها» قلت: ثم مَن؟ قال: «عمر بن الخطاب...» فعدّ رجالاً \" وقد تقدّم القول في القلب بما فيه كفاية في أوّل «البقرة»، وفي أول هذه السورة. يروى أن لقمان الحكيم كان عبداً نجاراً قال له سيّده: اذبح شاة وائتني بأطيبها بَضْعتين، فأتاه باللسان والقلب. ثم أمره بذبح شاة أخرى فقال له: ألق أخبثها بَضْعتين، فألقى اللسان والقلب. فقال: أمرتك أن تأتيني بأطيبها بَضْعتين فأتيتني باللسان والقلب، وأمرتك أن تُلقي بأخبثها بَضْعتين فألقيت اللسان والقلب!؟ فقال: ليس شيء أطيب منهما إذا طابا، ولا أخبث منهما إذا خَبُثا.\n\n\n                                    ",
        "saadi": "۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُ‍ٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا ١٥\n                                        \n                                        \n                                        \n                                        وهذا أيضاً من توسعة اللّه على رسوله ورحمته به، أن أباح له ترك القسم بين زوجاته على وجه الوجوب، وأنه إن فعل ذلك فهو تبرع منه، ومع ذلك، فقد كان صلى اللّه عليه وسلم يجتهد في القسم بينهن في كل شيء، ويقول: \" اللهم هذا قسمي فيما أملك، فلا تلمني فيما لا أملك \". فقال هنا: { تُرْجِي مَن تَشَآءُ مِنْهُنَّ } [أي: تؤخر من أردت من زوجاتك فلا تؤويها إليك، ولا تبيت عندها] { وَتُؤْوِيۤ إِلَيْكَ مَن تَشَآءُ } أي: تضمها وتبيت عندها. { وَ } مع ذلك لا يتعين هذا الأمر { مَنِ ٱبْتَغَيْتَ } أي: تؤويها { فَلاَ جُنَاحَ عَلَيْكَ } والمعنى أن الخيرة بيدك في ذلك كله [وقال كثير من المفسرين إن هذا خاص بالواهبات له أن يرجي من يشاء ويؤوي من يشاء، أي: إن شاء قبل من وهبت نفسها له وإن شاء لم يقبلها واللّه أعلم]. ثم بيّن الحكمة في ذلك فقال: { ذَلِكَ } أي: التوسعة عليك، وكون الأمر راجعاً إليك وبيدك، وكون ما جاء منك إليهن تبرعاً منك { أَدْنَىٰ أَن تَقَرَّ أَعْيُنُهُنَّ وَلاَ يَحْزَنَّ وَيَرْضَيْنَ بِمَآ آتَيْتَهُنَّ كُلُّهُنَّ } لعلمهن أنك لم تترك واجباً، ولم تفرط في حق لازم. { وَٱللَّهُ يَعْلَمُ مَا فِي قلُوبِكُمْ } أي: ما يعرض لها عند أداء الحقوق الواجبة والمستحبة، وعند المزاحمة في الحقوق، فلذلك شرع لك التوسعة يا رسول اللّه، لتطمئن قلوب زوجاتك. { وَكَانَ ٱللَّهُ عَلِيماً حَلِيماً } أي: واسع العلم، كثير الحلم. ومن علمه، أن شرع لكم ما هو أصلح لأموركم، وأكثر لأجوركم. ومن حلمه، أن لم يعاقبكم بما صدر منكم، وما أصرت عليه قلوبكم من الشر.\n                                    "
      },
      "originalText": "۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُ‍ٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا ١٥"
    },
    {
      "number": 3585,
      "text": "لَا يَحِلُّ لَكَ النِّسَاءُ مِنْ بَعْدُ وَلَا أَنْ تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا مَا مَلَكَتْ يَمِينُكَ ۗ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ رَقِيبًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 52,
      "juz": 22,
      "manzil": 5,
      "page": 425,
      "ruku": 366,
      "hizbQuarter": 170,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعۡدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنۡ أَزۡوَٰجٖ وَلَوۡ أَعۡجَبَكَ حُسۡنُهُنَّ إِلَّا مَا مَلَكَتۡ يَمِينُكَۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ رَّقِيبٗا ٢٥\n                                    \n                                    \n                                    ذكر غير واحد من العلماء كابن عباس ومجاهد والضحاك وقتادة وابن زيد وابن جرير وغيرهم، أن هذه الآية نزلت مجازاة لأزواج النبي صلى الله عليه وسلم ورضاً عنهن على حسن صنيعهن في اختيارهن الله ورسوله والدار الآخرة لما خيرهن رسول الله صلى الله عليه وسلم كما تقدم في الآية، فلما اخترن رسول الله صلى الله عليه وسلم كان جزاؤهن أن الله تعالى قصره عليهن، وحرم عليه أن يتزوج بغيرهن، أو يستبدل بهن أزواجاً غيرهن، ولو أعجبه حسنهن، إلا الإماء والسراري، فلا حرج عليه فيهن، ثم إنه تعالى رفع عنه الحرج في ذلك، ونسخ حكم هذه الآية، وأباح له التزوج، ولكن لم يقع منه بعد ذلك تزوج لتكون المنة لرسول الله صلى الله عليه وسلم عليهن. قال الإمام أحمد حدثنا سفيان عن عمرو عن عطاء عن عائشة رضي الله عنها قالت ما مات رسول الله صلى الله عليه وسلم حتى أحل الله له النساء، ورواه أيضاً من حديث ابن جريج عن عطاء عن عبيد بن عمير عن عائشة، ورواه الترمذي والنسائي في سننيهما، وقال ابن أبي حاتم حدثنا أبو زرعة، حدثنا عبد الرحمن بن عبد الملك بن شيبة، حدثني عمر بن أبي بكر، حدثني المغيرة بن عبد الرحمن الحزامي عن أبي النضر مولى عمر بن عبيد الله عن عبد الله بن وهب بن زمعة عن أم سلمة أنها قالت لم يمت رسول الله صلى الله عليه وسلم حتى أحل الله له أن يتزوج من النساء ما شاء، إلا ذات محرم، وذلك قول الله تعالى { تُرْجِى مَن تَشَآءُ مِنْهُنَّ } الآية، فجعلت هذه ناسخة للتي بعدها في التلاوة كآيتي عدة الوفاة في البقرة، الأولى ناسخة للتي بعدها، والله أعلم. وقال آخرون بل معنى الآية { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } أي من بعد ما ذكرنا لك من صفة النساء اللاتي أحللنا لك من نسائك اللاتي آتيت أجورهن، وما ملكت يمينك، وبنات العم والعمات، والخال والخالات، والواهبة، وما سوى ذلك من أصناف النساء، فلا يحل لك، وهذا ما روي عن أبي بن كعب ومجاهد في رواية عنه، وعكرمة والضحاك في رواية، وأبي رزين في رواية عنه، وأبي صالح والحسن وقتادة في رواية، والسدي وغيرهم، قال ابن جرير حدثنا يعقوب، حدثنا ابن علية عن داود بن أبي هند، حدثني محمد بن أبي موسى عن زياد عن رجل من الأنصار قال قلت لأبي بن كعب أرأيت لو أن أزواج النبي صلى الله عليه وسلم توفين، أما كان له أن يتزوج؟ فقال وما يمنعه من ذلك؟ قال قلت قول الله تعالى { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } فقال إنما أحل الله له ضرباً من النساء، فقال تعالى { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَحْلَلْنَا لَكَ أَزْوَٰجَكَ } ــــ إلى قوله تعالى ــــ { إِن وَهَبَتْ نَفْسَهَا لِلنَّبِىِّ } ثم قيل له { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } ورواه عبد الله بن أحمد من طرق عن داود به.\n                                    وروى الترمذي عن ابن عباس قال نهي رسول الله صلى الله عليه وسلم عن أصناف النساء، إلا ما كان من المؤمنات المهاجرات بقوله تعالى { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلاَّ مَا مَلَكَتْ يَمِينُكَ } فأحل الله فتياتكم المؤمنات، وامرأة مؤمنة إن وهبت نفسها للنبي، وحرم كل ذات دين غير الإسلام، ثم قال\n{ وَمَن يَكْفُرْ بِٱلإِيمَـٰنِ فَقَدْ حَبِطَ عَمَلُهُ }\nالمائدة 5 الآية. وقال تعالى { يٰأَيُّهَا ٱلنَّبِىُّ إِنَّآ أَحْلَلْنَا لَكَ أَزْوَٰجَكَ ٱللاَّتِىۤ ءَاتَيْتَ أُجُورَهُنَّ } ــــ إلى قوله تعالى ــــ { خَالِصَةً لَّكَ مِن دُونِ ٱلْمُؤْمِنِينَ } وحرم ما سوى ذلك من أصناف النساء، وقال مجاهد { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } أي من بعد ما سمي لك من مسلمة ولا يهودية ولا نصرانية ولا كافرة. وقال أبو صالح { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } أمر أن لا يتزوج أعرابية ولا عربية، ويتزوج بعد من نساء تهامة، وما شاء من بنات العم والعمة، والخال والخالة، إن شاء ثلاثمائة. وقال عكرمة { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } أي التي سمى الله. واختار ابن جرير رحمه الله أن الآية عامة فيمن ذكر من أصناف النساء، وفي النساء اللواتي في عصمته، وكن تسعاً، وهذا الذي قاله جيد، ولعله مراد كثير ممن حكينا عنه من السلف، فإن كثيراً منهم روى عنه هذا وهذا، ولا منافاة، والله أعلم. ثم أورد ابن جرير على نفسه ما روي أن رسول الله صلى الله عليه وسلم طلق حفصة، ثم راجعها وعزم على فراق سودة حتى وهبت يومها لعائشة، ثم أجاب بأن هذا كان قبل نزول قوله تعالى { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ } الآية، وهذا الذي قاله من أن هذا كان قبل نزول الآية صحيح، ولكن لا يحتاج إلى ذلك، فإن الآية إنما دلت على أنه لا يتزوج بمن عدا اللواتي في عصمته، وأنه لا يستبدل بهن غيرهن، ولا يدل ذلك على أنه لا يطلق واحدة منهن من غير استبدال، فالله أعلم، فأما قضية سودة، ففي الصحيح عن عائشة رضي الله تبارك وتعالى عنها، وهي سبب نزول قوله تعالى\n{ وَإِنِ ٱمْرَأَةٌ خَـٰفَتْ مِن بَعْلِهَا نُشُوزاً أَوْ إِعْرَاضاً فَلاَ جُنَاْحَ عَلَيْهِمَآ أَن يُصْلِحَا بَيْنَهُمَا صُلْحاً }\nالنساء 128 الآية. وأما قضية حفصة، فروى أبو داود والنسائي وابن ماجه وابن حبان في \" صحيحه \" من طرق عن يحيى بن زكريا بن أبي زائدة، عن صالح بن صالح بن حيي عن سلمة بن كهيل عن سعيد بن جبير، عن ابن عباس عن عمر أن رسول الله صلى الله عليه وسلم طلق حفصة، ثم راجعها، وهذا إسناد قوي.\n                                   وقال الحافظ أبو يعلى حدثنا أبو كريب، حدثنا يونس بن بكير عن الأعمش عن أبي صالح عن ابن عمر قال دخل عمر على حفصة وهي تبكي، فقال ما يبكيك؟ لعل رسول الله صلى الله عليه وسلم طلقك، إنه قد كان طلقك مرة، ثم راجعك من أجلي، والله لئن كان طلقك مرة أخرى، لا أكلمك أبداً، ورجاله على شرط \" الصحيحين \". وقوله تعالى { وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ } فنهاه عن الزيادة عليهن إن طلق واحدة منهن، واستبدال غيرها بها، إلا ما ملكت يمينه، وقد روى الحافظ أبو بكر البزار حديثاً مناسباً ذكره ههنا، فقال حدثنا إبراهيم بن نصر، حدثنا مالك بن إسماعيل، حدثنا عبد السلام بن حرب عن إسحاق بن عبد الله القرشي، عن زيد بن أسلم عن عطاء بن يسار عن أبي هريرة قال كان البدل في الجاهلية أن يقول الرجل للرجل بادلني امرأتك، وأبادلك بامرأتي، أي تنزل لي عن امرأتك، وأنزل لك عن امرأتي، فأنزل الله { وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ } قال فدخل عيينة بن حصن الفزاري على النبي صلى الله عليه وسلم وعنده عائشة، فدخل بغير إذن، فقال له رسول الله صلى الله عليه وسلم \" فأين الاستئذان؟ \" فقال يارسول الله ما استأذنت على رجل من مضر منذ أدركت، ثم قال من هذه الحميراء إلى جنبك؟ فقال رسول الله صلى الله عليه وسلم \" هذه عائشة أم المؤمنين \" قال أفلا أنزل لك عن أحسن الخلق؟ قال \" يا عيينة إن الله قد حرم ذلك \" فلما أن خرج، قالت عائشة من هذا؟ قال \" هذا أحمق مطاع، وإنه على ما ترين لسيد قومه \" ثم قال البزار إسحاق بن عبد الله لين الحديث جداً، وإنما ذكرناه لأنا لم نحفظه إلا من هذا الوجه، وبينا العلة فيه.\n\n                                    ",
        "qortoby": "لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعۡدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنۡ أَزۡوَٰجٖ وَلَوۡ أَعۡجَبَكَ حُسۡنُهُنَّ إِلَّا مَا مَلَكَتۡ يَمِينُكَۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ رَّقِيبٗا ٢٥\n                                    \n                                    \n                                    فيه سبع مسائل:\n\nالأولى: اختلف العلماء في تأويل قوله: { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } على أقوال سبعة:\n\nالأولى: أنها منسوخة بالسُّنة، والناسخ لها حديث عائشة، قالت: ما مات رسول الله صلى الله عليه وسلم حتى أحلّ له النساء. وقد تقدّم.\n\nالثاني: أنها منسوخة بآية أخرى، روى الطحاويّ عن أم سلمة قالت: لم يمت رسول الله صلى الله عليه وسلم حتى أحلّ الله له أن يتزوج من النساء من شاء؛ إلا ذات مَحْرم، وذلك قوله عز وجل: { تُرْجِي مَن تَشَآءُ مِنْهُنَّ وَتُؤْوِيۤ إِلَيْكَ مَن تَشَآءُ }. قال النحاس: وهذا والله أعلم أولى ما قيل في الآية؛ وهو قول عائشة واحد في النسخ. وقد يجوز أن تكون عائشة أرادت أحلّ له ذلك بالقرآن. وهو مع هذا قول عليّ بن أبي طالب وابن عباس وعليّ بن الحسين والضحاك. وقد عارض بعض فقهاء الكوفيين فقال؛ محال أن تنسخ هذه الآية يعني: { تُرْجِي مَن تَشَآءُ مِنْهُنَّ } { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } وهي قبلها في المصحف الذي أجمع عليه المسلمون. ورجح قول من قال نسخت بالسُّنّة. قال النحاس: وهذه المعارضة لا تلزم وقائلها غالط؛ لأن القرآن بمنزلة سورة واحدة، كما صحّ عن ابن عباس: أنزل الله القرآن جملة واحدة إلى السماء الدنيا في شهر رمضان. ويبين لك أن اعتراض هذا (المعترض) لا يلزم (أن) قوله عز وجل:\n{ وَٱلَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَاجاً وَصِيَّةً لأَزْوَاجِهِمْ مَّتَاعاً إِلَى ٱلْحَوْلِ غَيْرَ إِخْرَاجٍ }\n[البقرة: 240] منسوخة على قول أهل التأويل ـ لا نعلم بينهم خلافاً ـ بالآية التي قبلها\n{ وَٱلَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَاجاً يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْراً }\n[البقرة: 234]\n\nالثالث: أنه صلى الله عليه وسلم حظر عليه أن يتزوّج على نسائه؛ لأنهن اخترن الله ورسوله والدار الآخرة؛ هذا قول الحسن وابن سيرين وأبي بكر بن عبد الرحمن بن الحارث بن هشام. قال النحاس: وهذا القول يجوز أن يكون هكذا ثم نسخ.\n\nالرابع: أنه لما حرم عليهن أن يتزوّجن بعده حُرم عليه أن يتزوج غيرهن؛ قاله أبو أمامة بن سهل بن حُنَيف.\n\nالخامس: { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } أي من بعد الأصناف التي سُميّت؛ قاله أُبَيّ بن كعب وعكرمة وأبو رَزين، وهو اختيار محمد بن جرير. ومن قال إن الإباحة كانت له مطلقة قال هنا: «لاَ يَحِلُّ لَكَ النِّسَاءُ» معناه لا تحل لك اليهوديات ولا النصرانيات. وهذا تأويل فيه بُعْدٌ. وروي عن مجاهد وسعيد بن جُبير وعكرمة أيضاً. وهو القول السادس. قال مجاهد: لئلا تكون كافرة أمَّا للمؤمنين. وهذا القول يبعد؛ لأنه يقدّره: من بعد المسلمات، ولم يجر للمسلمات ذكر. وكذلك قدّر «وَلاَ أَنْ تبَدَّلَ بِهِنَّ» أي ولا أن تطلق مسلمة لتستبدل بها كتابية.\n                                   السابع: أن النبيّ صلى الله عليه وسلم كان له حلال أن يتزوّج من شاء ثم نسخ ذلك. قال: وكذلك كانت الأنبياء قبله صلى الله عليه وسلم؛ قاله محمد بن كعب القُرَظِي.\n\nالثانية: قوله تعالى: { وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ } قال ابن زيد: هذا شيء كانت العرب تفعله، يقول أحدهم: خذ زوجتي وأعطني زوجتك، روى الدَّارَقُطْنِيّ عن أبي هريرة قال: \" كان البدل في الجاهلية أن يقول الرجل للرجل: انزل لي عن امرأتك وأنزل لك عن امرأتي وأزيدك؛ فأنزل الله عز وجل: { وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ } قال:فدخل عُيينة بن حِصْن الفَزَارِيّ على رسول الله صلى الله عليه وسلم وعنده عائشة، فدخل بغير إذن، فقال له رسول الله صلى الله عليه وسلم: «يا عُيينة فأين الاستئذان؟» فقال: يا رسول الله، ما استأذنت على رجل من مُضَرَ منذ أدركت. قال: مَن هذه الحميراء إلى جنبك؟ قال رسول الله صلى الله عليه وسلم: «هذه عائشة أم المؤمنين» قال: أفلا أنزل لك عن أحسن الخلق. فقال: «يا عُيينة، إن الله قد حرّم ذلك». قال فلما خرج قالت عائشة: «يا رسول الله، مَن هذا؟ قال: «أحمق مطاعٌ وإنه على ما ترين لَسَيّدُ قومه» \" وقد أنكر الطبريّ والنحاس وغيرهما ما حكاه ابن زيد عن العرب، من أنها كانت تبادل بأزواجها. قال الطبريّ: وما فعلت العرب قط هذا، وما روي من حديث عيينة بن حِصن من أنه دخل على رسول الله صلى الله عليه وسلم وعنده عائشة... الحديث؛ فليس بتبديل، ولا أراد ذلك، وإنما احتقر عائشة لأنها كانت صبية فقال هذا القول.\n\nقلت: وما ذكرناه من حديث زيد بن أسلم عن عطاء بن يسار عن أبي هريرة من أن البدل كان في الجاهلية يدلّ على خلاف ما أنكر من ذلك، والله أعلم. قال المبرد: وقرىء «لاَ يَحِل» بالياء والتاء. فمن قرأ بالتاء فعلى معنى جماعة النساء، وبالياء من تحت على معنى جميع النساء. وزعم الفراء قال: اجتمعت القراء على القراءة بالياء؛ وهذا غلط، وكيف يقال: اجتمعت القراء وقد قرأ أبو عمرو بالتاء بلا اختلاف عنه!\n\nالثالثة: قوله تعالى: { وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ } قال ابن عباس: نزل ذلك بسبب أسماء بنت عُمَيس؛ أعجب رسولَ الله صلى الله عليه وسلم حين مات عنها جعفر بن أبي طالب حُسنها، فأراد أن يتزوّجها، فنزلت الآية؛ وهذا حديث ضعيف قاله ابن العربيّ.\n\nالرابعة: في هذه الآية دليل على جواز أن ينظر الرجل إلى من يريد زواجها. \" وقد أراد المغيرة بن شُعبة زواج امرأة، فقال له النبيّ صلى الله عليه وسلم: «انظر إليها فإنه أجدر أن يُؤْدم بينكما». وقال عليه السلام لآخر: «انظر إليها فإن في أعين الأنصار شيئاً» \"\n                                   أخرجه الصحيح. قال الحميديّ وأبو الفرج الجوزيّ. يعني صفراء أو زرقاء. وقيل رمصاء.\n\nالخامسة: الأمر بالنظر إلى المخطوبة إنما هو على جهة الإرشاد إلى المصلحة؛ فإنه إذا نظر إليها فلعله يرى منها ما يرغبّه في نكاحها. ومما يدلّ على أن الأمر على جهة الإرشاد ما ذكره أبو داود من حديث جابر عن النبيّ صلى الله عليه وسلم أنه قال: \" إذا خطب أحدكم المرأة فإن استطاع أن ينظر منها إلى ما يدعوه إلى نكاحها فليفعل \" فقوله: \" فإن استطاع فليفعل \" لا يقال مثله في الواجب. وبهذا قال جمهور الفقهاء مالك والشافعيّ والكوفيون وغيرهم وأهل الظاهر. وقد كره ذلك قوم لا مبالاة بقولهم؛ للأحاديث الصحيحة، وقوله تعالى: { وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ }. وقال سهل بن أبي حثمة: رأيت محمد بن مسلمة يطارد ثُبَيْتَة بنت الضحاك على إجَّار من أجاجير المدينة فقلت له: أتفعل هذا؟ فقال: نعم! قال النبيّ صلى الله عليه وسلم: \" إذا ألقى الله في قلب أحدكم خِطْبة امرأة فلا بأس أن ينظر إليها \" الإجّار: السطح، بلغة أهل الشام والحجاز. قال أبو عبيد: وجمع الإجار أجاجير وأجاجرة.\n\nالسادسة: اختلف فيما يجوز أن ينظر منها؛ فقال مالك: ينظر إلى وجهها وكفيّها، ولا ينظر إلا بإذنها. وقال الشافعيّ وأحمد: بإذنها وبغير إذنها إذا كانت مستترة. وقال الأوزاعيّ: ينظر إليها ويجتهد وينظر مواضع اللحم منها. قال داود: ينظر إلى سائر جسدها؛ تمسكاً بظاهر اللفظ. وأصولُ الشريعة تردّ عليه في تحريم الاطلاع على العورة. والله أعلم.\n\nالسابعة: قوله تعالى: { إِلاَّ مَا مَلَكَتْ يَمِينُكَ } اختلف العلماء في إحلال الأَمَة الكافرة للنبيّ صلى الله عليه وسلم على قولين: تحلّ لعموم قوله: { إِلاَّ مَا مَلَكَتْ يَمِينُكَ }؛ قاله مجاهد وسعيد بن جبير وعطاء والحكم. قالوا: قوله تعالى: { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } أي لا تحلّ لك النساء من غير المسلمات، فأما اليهوديات والنّصرانيات والمشركات فحرام عليك؛ أي لا يحلّ لك أن تتزوّج كافرة فتكون أُمًّا للمؤمنين ولو أعجبك حسنها؛ إلا ما ملكت يمينك، فإن له أن يتسرّى بها. القول الثاني: لا تحلّ؛ تنزيهاً لقدره عن مباشرة الكافرة، وقد قال الله تعالى:\n{ وَلاَ تُمْسِكُواْ بِعِصَمِ ٱلْكَوَافِرِ }\n[الممتحنة: 10] فكيف به صلى الله عليه وسلم. و«ما» في قوله: { إِلاَّ مَا مَلَكَتْ يَمِينُكَ } في موضع رفع بدل من «النساء». ويجوز أن يكون في موضع نصب على استثناء، وفيه ضعف. ويجوز أن تكون مصدرية، والتقدير: إلا ملك يمينك، ومِلك بمعنى مملوك، وهو في موضع نصب لأنه استثناء من غير الجنس الأول.\n\n                                    ",
        "saadi": "لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعۡدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنۡ أَزۡوَٰجٖ وَلَوۡ أَعۡجَبَكَ حُسۡنُهُنَّ إِلَّا مَا مَلَكَتۡ يَمِينُكَۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ رَّقِيبٗا ٢٥\n                                        \n                                        \n                                        \n                                        وهذا شكر من اللّه، الذي لم يزل شكوراً لزوجات رسوله، رضي اللّه عنهن، حيث اخترن اللّه ورسوله والدار الآخرة، أن رحمهن، وقصر رسوله عليهن، فقال: { لاَّ يَحِلُّ لَكَ ٱلنِّسَآءُ مِن بَعْدُ } زوجاتك الموجودات { وَلاَ أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ } أي: ولا تطلق بعضهن، فتأخذ بدلها. فحصل بهذا أمنهن من الضرائر، ومن الطلاق، لأن اللّه قضى أنهن زوجاته في الدنيا والآخرة، لا يكون بينه وبينهن فرقة. { وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ } أي: حسن غيرهن، فلا يحللن لك { إِلاَّ مَا مَلَكَتْ يَمِينُكَ } أي: السراري، فذلك جائز لك، لأن المملوكات في كراهة الزوجات، لسن بمنزلة الزوجات في الإضرار للزوجات. { وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ رَّقِيباً } أي: مراقباً للأمور، وعالماً بما إليه تؤول، وقائماً بتدبيرها على أكمل نظام وأحسن إحكام.\n                                    "
      },
      "originalText": "لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعۡدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنۡ أَزۡوَٰجٖ وَلَوۡ أَعۡجَبَكَ حُسۡنُهُنَّ إِلَّا مَا مَلَكَتۡ يَمِينُكَۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ رَّقِيبٗا ٢٥"
    },
    {
      "number": 3586,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلَّا أَنْ يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَٰكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلَا مُسْتَأْنِسِينَ لِحَدِيثٍ ۚ إِنَّ ذَٰلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ ۖ وَاللَّهُ لَا يَسْتَحْيِي مِنَ الْحَقِّ ۚ وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعًا فَاسْأَلُوهُنَّ مِنْ وَرَاءِ حِجَابٍ ۚ ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ ۚ وَمَا كَانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ وَلَا أَنْ تَنْكِحُوا أَزْوَاجَهُ مِنْ بَعْدِهِ أَبَدًا ۚ إِنَّ ذَٰلِكُمْ كَانَ عِنْدَ اللَّهِ عَظِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 53,
      "juz": 22,
      "manzil": 5,
      "page": 425,
      "ruku": 367,
      "hizbQuarter": 170,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلَّآ أَن يُؤۡذَنَ لَكُمۡ إِلَىٰ طَعَامٍ غَيۡرَ نَٰظِرِينَ إِنَىٰهُ وَلَٰكِنۡ إِذَا دُعِيتُمۡ فَٱدۡخُلُواْ فَإِذَا طَعِمۡتُمۡ فَٱنتَشِرُواْ وَلَا مُسۡتَ‍ٔۡنِسِينَ لِحَدِيثٍۚ إِنَّ ذَٰلِكُمۡ كَانَ يُؤۡذِي ٱلنَّبِيَّ فَيَسۡتَحۡيِۦ مِنكُمۡۖ وَٱللَّهُ لَا يَسۡتَحۡيِۦ مِنَ ٱلۡحَقِّۚ وَإِذَا سَأَلۡتُمُوهُنَّ مَتَٰعٗا فَسۡ‍َٔلُوهُنَّ مِن وَرَآءِ حِجَابٖۚ ذَٰلِكُمۡ أَطۡهَرُ لِقُلُوبِكُمۡ وَقُلُوبِهِنَّۚ وَمَا كَانَ لَكُمۡ أَن تُؤۡذُواْ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓاْ أَزۡوَٰجَهُۥ مِنۢ بَعۡدِهِۦٓ أَبَدًاۚ إِنَّ ذَٰلِكُمۡ كَانَ عِندَ ٱللَّهِ عَظِيمًا ٣٥\n                                    \n                                    \n                                    هذه آية الحجاب وفيها أحكام وآداب شرعية، وهي مما وافق تنزيلها قول عمر بن الخطاب رضي الله عنه، كما ثبت ذلك في الصحيحين عنه أنه قال وافقت ربي عز وجل في ثلاث، قلت يا رسول الله لو اتخذت من مقام إبراهيم مصلى، فأنزل الله تعالى\n{ وَٱتَّخِذُواْ مِن مَّقَامِ إِبْرَٰهِيمَ مُصَلًّى }\nالبقرة 125 وقلت يا رسول الله إن نساءك يدخل عليهن البر والفاجر، فلو حجبتهن، فأنزل الله آية الحجاب، وقلت لأزواج النبي صلى الله عليه وسلم لما تمالأن عليه في الغيرة\n{ عَسَىٰ رَبُّهُ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُ أَزْوَٰجاً خَيْراً مِّنكُنَّ }\nالتحريم 5 فنزلت كذلك، وفي رواية لمسلم ذكر أسارى بدر، وهي قضية رابعة. وقد قال البخاري حدثنا مسدد عن يحيى عن حميد عن أنس بن مالك قال قال عمر بن الخطاب يا رسول الله يدخل عليك البر والفاجر، فلو أمرت أمهات المؤمنين بالحجاب، فأنزل الله آية الحجاب، وكان وقت نزولها في صبيحة عرس رسول الله صلى الله عليه وسلم بزينب بنت جحش الأسدية التي تولى الله تعالى تزويجها بنفسه، وكان ذلك في ذي القعدة من السنة الخامسة في قول قتادة والواقدي وغيرهما، وزعم أبو عبيدة معمر بن المثنى وخليفة بن خياط أن ذلك كان في سنة ثلاث، فالله أعلم. قال البخاري حدثنا محمد بن عبد الله الرقاشي، حدثنا معتمر بن سليمان، سمعت أبي، حدثنا أبو مجلز عن أنس بن مالك رضي الله عنه قال لما تزوج رسول الله صلى الله عليه وسلم زينب بنت جحش، دعا القوم فطعموا، ثم جلسوا يتحدثون، فإذا هو يتهيأ للقيام، فلم يقوموا، فلما رأى ذلك، قام، فلما قام، قام من قام، وقعد ثلاثة نفر، فجاء النبي صلى الله عليه وسلم ليدخل، فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا، فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل، فذهبت أدخل، فألقى الحجاب بيني وبينه، فأنزل الله تعالى { يٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِىِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَـٰظِرِينَ إِنَـٰهُ وَلَـكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ } الآية، وقد رواه أيضا في موضع آخر، ومسلم والنسائي من طرق عن معتمر بن سليمان به. ثم رواه البخاري منفرداً به من حديث أيوب عن أبي قلابة، عن أنس بن مالك رضي الله عنه بنحوه، ثم قال حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب عن أنس بن مالك قال بنى النبي صلى الله عليه وسلم زينت بنت جحش بخبز ولحم، فأرسلت على الطعام داعياً، فيجيء قوم فيأكلون ويخرجون، ثم يجيء قوم فيأكلون ويخرجون، فدعوت حتى ما أجد أحداً أدعوه، فقلت يا رسول الله ما أجد أحداً أدعوه، قال\n                                   \" ارفعوا طعامكم \" ، وبقي ثلاثة رهط يتحدثون في البيت، فخرج النبي صلى الله عليه وسلم فانطلق إلى حجرة عائشة رضي الله عنها فقال \" السلام عليكم أهل البيت ورحمة الله وبركاته \" قالت وعليك السلام ورحمة الله، كيف وجدت أهلك يا رسول الله؟ بارك الله لك؟ فتقرى حجر نسائه كلهن، يقول لهن كما يقول لعائشة، ويقلن له كما قالت عائشة، ثم رجع النبي صلى الله عليه وسلم فإذا ثلاثة رهط في البيت يتحدثون، وكان النبي صلى الله عليه وسلم شديد الحياء، فخرج منطلقاً نحو حجرة عائشة، فما أدري أخبرته أم أخبر أن القوم خرجوا، فرجع حتى إذا وضع رجله في أسكفة الباب داخله، والأخرى خارجة، أرخى الستر بيني وبينه، وأنزل آية الحجاب. انفرد به البخاري من بين أصحاب الكتب الستة سوى النسائي في اليوم والليلة من حديث عبد الوارث، ثم رواه عن إسحاق، هو ابن منصور، عن عبد الله بن بكر السهمي عن حميد عن أنس بنحو ذلك، وقال رجلان انفرد به من هذا الوجه، وقد تقدم في أفراد مسلم من حديث سليمان بن المغيرة عن ثابت عن أنس. وقال ابن أبي حاتم حدثنا أبي، حدثنا أبو المظفر، حدثنا جعفر بن سليمان عن الجعد أبي عثمان اليشكري عن أنس بن مالك قال أعرس رسول الله صلى الله عليه وسلم ببعض نسائه، فصنعت أم سليم حيساً، ثم جعلته في تور، فقالت اذهب بهذا إلى رسول الله صلى الله عليه وسلم وأقرئه مني السلام، وأخبره أن هذا منا له قليل، قال أنس والناس يومئذ في جهد، فجئت به فقلت يا رسول الله بعثت بهذا أم سليم إليك، وهي تقرئك السلام وتقول أخبره أن هذا منا له قليل، فنظر إليه ثم قال \" ضعه \" فوضعته في ناحية البيت، ثم قال \" اذهب فادع لي فلاناً وفلاناً \" فسمى رجالاً كثيراً، وقال \" ومن لقيت من المسلمين \" فدعوت من قال لي، ومن لقيت من المسلمين، فجئت والبيت والصفة والحجرة ملأى من الناس، فقلت يا أبا عثمان كم كانوا؟ فقال كانوا زهاء ثلاثمائة. قال أنس فقال لي رسول الله صلى الله عليه وسلم \" جىء به \" فجئت به إليه، فوضع يده عليه، ودعا وقال \" ما شاء الله \" ثم قال \" ليتحلق عشرة عشرة، وليسموا، وليأكل كل إنسان مما يليه \" فجعلوا يسمون ويأكلون حتى أكلوا كلهم، فقال لي رسول الله صلى الله عليه وسلم \" ارفعه \" قال فجئت فأخذت التور، فنظرت فيه، فما أدري أهو حين وضعت أكثر، أم حين أخذت؟ قال وتخلف رجال يتحدثون في بيت رسول الله صلى الله عليه وسلم وزوج رسول الله صلى الله عليه وسلم التي دخل بها معهم مولية وجهها إلى الحائط، فأطالوا الحديث، فشقوا على رسول الله صلى الله عليه وسلم وكان أشد الناس حياء، ولو أعلموا، كان ذلك عليهم عزيزاً، فقام رسول الله صلى الله عليه وسلم فخرج فسلم على حجره وعلى نسائه، فلما رأوه قد جاء، ظنوا أنهم قد ثقلوا عليه، ابتدروا الباب فخرجوا، وجاء رسول الله صلى الله عليه وسلم حتى أرخى الستر ودخل البيت، وأنا في الحجرة، فمكث رسول الله صلى الله عليه وسلم في بيته يسيراً، وأنزل الله عليه القرآن، فخرج وهو يتلو هذا الآية { يٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِىِّ } الآيات، قال أنس فقرأهن علي قبل الناس، فأنا أحدث الناس بهن عهداً، وقد رواه مسلم والترمذي والنسائي جميعاً عن قتيبة عن جعفر بن سليمان به، وقال الترمذي حسن صحيح، وعلقه البخاري في كتاب النكاح، فقال وقال إبراهيم بن طهمان عن الجعد أبي عثمان عن أنس، فذكر نحوه.\n                                   ورواه مسلم أيضاً عن محمد بن رافع عن عبد الرزاق عن معمر عن الجعد به، وقد روى هذا الحديث عبد الله بن المبارك عن شريك عن بيان بن بشر عن أنس بنحوه، ورواه البخاري والترمذي من طريقين آخرين عن بيان بن بشر الأحمسي الكوفي عن أنس بنحوه، ورواه ابن أبي حاتم أيضاً من حديث أبي نضرة العبدي عن أنس بن مالك بنحو ذلك، ولم يخرجوه، ورواه ابن جرير من حديث عمرو بن سعيد، ومن حديث الزهري عن أنس بنحو ذلك. وقال الإمام أحمد حدثنا بهز وهاشم بن القاسم قالا حدثنا سليمان بن المغيرة عن ثابت عن أنس قال لما انقضت عدة زينب، قال رسول الله صلى الله عليه وسلم لزيد \" اذهب فاذكرها علي \" قال فانطلق زيد حتى أتاها ــــ قال ــــ وهي تخمر عجينها، فلما رأيتها، عظمت في صدري، وذكر تمام الحديث كما قدمناه عند قوله تعالى { أَن تَخْشَـٰهُ فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَراً } وزاد في آخره بعد قوله ووعظ القوم بما وعظوا به قال هاشم في حديثه { لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِىِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ } الآية. وقد أخرجه مسلم والنسائي من حديث سليمان بن المغيرة، به. وقال ابن جرير حدثني أحمد بن عبد الرحمن ابن أخي ابن وهب، حدثني عمي عبد الله بن وهب، حدثني يونس عن الزهري عن عروة عن عائشة قالت إن أزواج النبي صلى الله عليه وسلم كن يخرجن بالليل إذا تبرزن إلى المناصع ــــ وهو صعيد أفيح ــــ وكان عمر يقول لرسول الله صلى الله عليه وسلم احجب نساءك، فلم يكن رسول الله صلى الله عليه وسلم ليفعل، فخرجت سودة بنت زمعة زوج رسول الله صلى الله عليه وسلم وكانت امرأة طويلة، فناداها عمر بصوته الأعلى قد عرفناك يا سودة حرصاً على أن ينزل الحجاب، قالت فأنزل الله الحجاب، هكذا وقع في هذه الرواية، والمشهور أن هذا كان بعد نزول الحجاب.\n                                   كما رواه الإمام أحمد والبخاري ومسلم من حديث هشام بن عروة عن أبيه عن عائشة رضي الله عنها قالت خرجت سودة بعدما ضرب الحجاب لحاجتها، وكانت امرأة جسيمة، لا تخفى على من يعرفها، فرأها عمر بن الخطاب، فقال ياسودة أما والله ما تخفين علينا، فانظري كيف تخرجين؟ قالت فانكفأت راجعة، ورسول الله صلى الله عليه وسلم في بيتي، وإنه ليتعشى وفي يده عرق، فدخلت فقالت يا رسول الله إني خرجت لبعض حاجتي، فقال لي عمر كذا وكذا، قالت فأوحى الله إليه، ثم رفع عنه، وإن العرق في يده ما وضعه، فقال \" إنه قد أذن لكن أن تخرجن لحاجتكن \" لفظ البخاري، فقوله تعالى { لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ } حظر على المؤمنين أن يدخلوا منازل رسول الله صلى الله عليه وسلم بغير إذن كما كانوا قبل ذلك يصنعون في بيوتهم في الجاهلية وابتداء الإسلام، حتى غار الله لهذه الأمة، فأمرهم بذلك، وذلك من إكرامه تعالى هذه الأمة، ولهذا قال رسول الله صلى الله عليه وسلم \" إياكم والدخول على النساء \" الحديث، ثم استثنى من ذلك، فقال تعالى { إِلاَّ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَـٰظِرِينَ إِنَـٰهُ } قال مجاهد وقتادة وغيرهما أي غير متحينين نضجه واستواءه، أي لا ترقبوا الطعام إذا طبخ، حتى إذا قارب الاستواء، تعرضتم للدخول، فإن هذا مما يكرهه الله ويذمه، وهذا دليل على تحريم التطفيل، وهو الذي تسميه العرب الضيفن، وقد صنف الخطيب البغدادي في ذلك كتاباً في ذم الطفيليين، وذكر من أخبارهم أشياء يطول إيرادها. ثم قال تعالى { وَلَـٰكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ } وفي \" صحيح مسلم \" عن ابن عمر رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" إذا دعا أحدكم أخاه، فليجب، عرساً كان أو غيره \" وأصله في \" الصحيحين \" ، وفي الصحيح أيضاً عن رسول الله صلى الله عليه وسلم \" لو دعيت إلى ذراع لأجبت، ولو أهدي إلى كراع لقبلت، فإذا فرغتم من الذي دعيتم إليه، فخففوا عن أهل المنزل، وانتشروا في الأرض \" ولهذا قال تعالى { طَعِمْتُمْ فَٱنْتَشِرُواْ وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ } أي كما وقع لأولئك النفر الثلاثة الذين استرسل بهم الحديث، ونسوا أنفسهم، حتى شق ذلك على رسول الله صلى الله عليه وسلم كما قال تعالى { إِنَّ ذَلِكُمْ كَانَ يُؤْذِى ٱلنَّبِىِّ فَيَسْتَحْيِى مِنكُمْ } وقيل المراد إن دخولكم منزله بغير إذنه كان يشق عليه، ويتأذى به، ولكن كان يكره أن ينهاهم عن ذلك من شدة حيائه عليه السلام، حتى أنزل الله عليه النهي عن ذلك، ولهذا قال تعالى { وَٱللَّهُ لاَ يَسْتَحْىِ مِنَ ٱلْحَقِّ } أي ولهذا نهاكم عن ذلك، وزجركم عنه.\n                                   ثم قال تعالى { وَإِذَا سَأَلْتُمُوهُنَّ مَتَـٰعاً فَٱسْـأَلُوهُنَّ مِن وَرَآءِ حِجَابٍ } أي وكما نهيتكم عن الدخول عليهن، كذلك لا تنظروا إليهن بالكلية، ولو كان لأحدكم حاجة يريد تناولها منهن، فلا ينظر إليهن، ولا يسألهن حاجة إلا من وراء حجاب. وقال ابن أبي حاتم حدثنا أبي، حدثنا ابن أبي عمر، حدثنا سفيان عن مسعر عن موسى بن أبي كثير عن مجاهد عن عائشة قالت كنت آكل مع النبي صلى الله عليه وسلم حيساً في قعب، فمر عمر، فدعاه فأكل، فأصابت إصبعه إصبعي، فقال حَسِّ، أو أوه، لو أطاع فيكن، ما رأتكن عين، فنزل الحجاب. { ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ } أي هذا الذي أمرتكم به، وشرعته لكم من الحجاب، أطهر وأطيب. وقوله تعالى { وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً إِنَّ ذَٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً } قال ابن أبي حاتم حدثنا علي بن الحسين، حدثنا محمد بن أبي حماد، حدثنا مهران عن سفيان عن داود بن أبي هند عن عكرمة عن ابن عباس في قوله تعالى { وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ } قال نزلت في رجل هم أن يتزوج بعض نساء النبي صلى الله عليه وسلم بعده، قال رجل لسفيان أهي عائشة؟ قال قد ذكروا ذلك، وكذا قال مقاتل بن حيان وعبد الرحمن بن زيد بن أسلم، وذكر بسنده عن السدي أن الذي عزم على ذلك طلحة بن عبيد الله رضي الله عنه، حتى نزل التنبيه على تحريم ذلك، ولهذا أجمع العلماء قاطبة على أن من توفي عنها رسول الله صلى الله عليه وسلم من أزواجه أنه يحرم على غيره تزوجها من بعده لأنهن أزواجه في الدنيا والآخرة، وأمهات المؤمنين كما تقدم، واختلفوا فيمن دخل بها ثم طلقها في حياته هل يحل لغيره أن يتزوجها؟ على قولين، مأخذهما هل دخلت هذه في عموم قوله { مِن بَعْدِهِ } أم لا؟ فأما من تزوجها ثم طلقها قبل أن يدخل بها، فما نعلم في حلها لغيره والحالة هذه نزاعاً، والله أعلم. وقال ابن جرير حدثني محمد بن المثنى، حدثنا عبد الوهاب، حدثنا داود عن عامر أن نبي الله صلى الله عليه وسلم مات وقد ملك قيلة بنة الأشعث ــــ يعني ابن قيس ــــ فتزوجها عكرمة بن أبي جهل بعد ذلك، فشق ذلك على أبي بكر مشقة شديدة، فقال له عمر ياخليفة رسول الله إنها ليست من نسائه، إنها لم يخيرها رسول الله، ولم يحجبها، وقد برأها الله منه بالردة التي ارتدت مع قومها قال فاطمأن أبو بكر رضي الله عنه، وسكن، وقد عظم الله تبارك وتعالى ذلك، وشدد فيه، وتوعد عليه بقوله { إِنَّ ذَٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً } ثم قوله تعالى { إِن تُبْدُواْ شَيْئاً أَوْ تُخْفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيماً } أي مهما تكنه ضمائركم، وتنطوي عليه سرائركم، فإن الله يعلمه، فإنه لا تخفى عليه خافية\n{ يَعْلَمُ خَآئِنَةَ ٱلأَعْيُنِ وَمَا تُخْفِى ٱلصُّدُورُ }\nغافر 19.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلَّآ أَن يُؤۡذَنَ لَكُمۡ إِلَىٰ طَعَامٍ غَيۡرَ نَٰظِرِينَ إِنَىٰهُ وَلَٰكِنۡ إِذَا دُعِيتُمۡ فَٱدۡخُلُواْ فَإِذَا طَعِمۡتُمۡ فَٱنتَشِرُواْ وَلَا مُسۡتَ‍ٔۡنِسِينَ لِحَدِيثٍۚ إِنَّ ذَٰلِكُمۡ كَانَ يُؤۡذِي ٱلنَّبِيَّ فَيَسۡتَحۡيِۦ مِنكُمۡۖ وَٱللَّهُ لَا يَسۡتَحۡيِۦ مِنَ ٱلۡحَقِّۚ وَإِذَا سَأَلۡتُمُوهُنَّ مَتَٰعٗا فَسۡ‍َٔلُوهُنَّ مِن وَرَآءِ حِجَابٖۚ ذَٰلِكُمۡ أَطۡهَرُ لِقُلُوبِكُمۡ وَقُلُوبِهِنَّۚ وَمَا كَانَ لَكُمۡ أَن تُؤۡذُواْ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓاْ أَزۡوَٰجَهُۥ مِنۢ بَعۡدِهِۦٓ أَبَدًاۚ إِنَّ ذَٰلِكُمۡ كَانَ عِندَ ٱللَّهِ عَظِيمًا ٣٥\n                                    \n                                    \n                                    فيه ست عشرة مسألة:\n\nالأولى: قوله تعالى: { لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ } «أنْ» في موضع نصب على معنى: إلا بأن يؤذن لكم، ويكون الاستثناء ليس من الأول. { إِلَىٰ طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ } نصب على الحال، أي لا تدخلوا في هذه الحال. ولا يجوز في «غَيْر» الخفض على النعت للطعام، لأنه لو كان نعتاً لم يكن بدّ من إظهار الفاعلين، وكان يقول: غير ناظرين إناه أنتم. ونظير هذا من النحو: هذا رجلٌ مع رجل ملازمٌ له، وإن شئت قلت: هذا رجلٌ مع رجلٍ ملازمٍ له هو.\n\nوهذه الآية تضمّنت قصتين: إحداهما: الأدب في أمر الطعام والجلوس. والثانية: أمر الحجاب. وقال حماد بن زيد: هذه الآية نزلت في الثقلاء. فأما القصة الأولى فالجمهور من المفسرين على أن سببها: أن رسول الله صلى الله عليه وسلم لما تزوّج زينب بنت جحش امرأة زيد أوْلَم عليها، فدعا الناس، فلما طعموا جلس طوائف منهم يتحدّثون في بيت رسول الله صلى الله عليه وسلم وزوجته موَلّية وجهها إلى الحائط، فثَقُلُوا على رسول الله صلى الله عليه وسلم. قال أنس: فما أدري أأنا أخبرت النبيّ صلى الله عليه وسلم أن القوم قد خرجوا أو أخبرني. قال: فانطلق حتى دخل البيت، فذهبت أدخل معه فألقى الستر بيني وبينه ونزل الحجاب. قال: ووعظ القومَ بما وُعظوا به، وأنزل الله عز وجل: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ ـ إلى قوله ـ إِنَّ ذٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً } أخرجه الصحيح. وقال قتادة ومقاتل في كتاب الثعلبيّ: إن هذا السبب جرى في بيت أم سلمة. والأوّل الصحيح، كما رواه الصحيح. وقال ابن عباس: نزلت في ناس من المؤمنين كانوا يتحينون طعام النبيّ صلى الله عليه وسلم فيدخلون قبل أن يدرِك الطعام، فيقعدون إلى أن يدرِك، ثم يأكلون ولا يخرجون. وقال إسماعيل بن أبي حكيم: وهذا أدب أدّب الله به الثقلاء. وقال ابن أبي عائشة في كتاب الثعلبيّ: حسبك من الثقلاء أن الشرع لم يحتملهم. وأما قصة الحجاب فقال أنس بن مالك وجماعة: سببها أمر القعود في بيت زينب، القصة المذكورة آنفاً. وقالت عائشة رضي الله عنها وجماعة: سببها أن عمر قال قلت: يا رسول الله، إن نساءك يدخل عليهنّ البَرّ والفاجر، فلو أمرتهنّ أن يحتجبن؛ فنزلت الآية. وروى الصحيح عن ابن عمر قال: قال عمر وافقت ربّي في ثلاث: في مقام إبراهيم، وفي الحجاب، وفي أسارى بدر. هذا أصح ما قيل في أمر الحجاب، وما عدا هذين القولين من الأقوال والروايات فواهية، لا يقوم شيء منها على ساق، وأضعفها ما روي عن ابن مسعود: أن عمر أمر نساء النبيّ صلى الله عليه وسلم بالحجاب، فقالت زينب بنت جحش: يا ابن الخطاب، إنك تَغَار علينا والوحي ينزل في بيوتنا! فأنزل الله تعالى: { وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعاً فَٱسْأَلُوهُنَّ مِن وَرَآءِ حِجَابٍ ذٰلِكُمْ } وهذا باطل، لأن الحجاب نزل يوم البناء بزينب، كما بيّناه.\n                                   أخرجه البخاريّ ومسلم والترمذي وغيرهم. وقيل: إن رسول الله صلى الله عليه وسلم كان يَطْعَم ومعه بعض أصحابه، فأصاب يَدُ رجل منهم يدَ عائشة، فكره النبيّ صلى الله عليه وسلم فنزلت آية الحجاب. قال ابن عطية: وكانت سيرة القوم إذا كان لهم طعام وليمة أو نحوه أن يبكر من شاء إلى الدعوة ينتظرون طبخ الطعام ونُضْجَه. وكذلك إذا فرغوا منه جلسوا كذلك، فنهى الله المؤمنين عن أمثال ذلك في بيت النبيّ صلى الله عليه وسلم، ودخل في النهي سائر المؤمنين، والتزم الناس أدب الله تعالى لهم في ذلك، فمنعهم من الدخول إلا بإذن عند الأكل، لا قبله لانتظار نُضْج الطعام.\n\nالثانية: قوله تعالى: { بُيُوتَ ٱلنَّبِيِّ } دليل على أن البيت للرجل، ويحكم له به، فإن الله تعالى أضافه إليه. فإن قيل: فقد قال الله تعالى: { وَٱذْكُـرْنَ مَا يُتْـلَىٰ فِي بُيُوتِكُـنَّ مِنْ آيَاتِ ٱللَّهِ وَٱلْحِكْـمَةِ إِنَّ ٱللَّهَ كَانَ لَطِيفاً خَبِيراً } قلنا: إضافة البيوت إلى النبيّ صلى الله عليه وسلم إضافة مِلك، وإضافة البيوت إلى الأزواج إضافة محل، بدليل أنه جعل فيها الإذن للنبيّ صلى الله عليه وسلم، والإذن إنما يكون للمالك.\n\nالثالثة: واختلف العلماء في بيوت النبيّ صلى الله عليه وسلم إذ كان يسكن فيها أهله بعد موته، هل هي ملك لهنّ أم لا على قولين: فقالت طائفة: كانت ملكاً لهنّ، بدليل أنهنّ سكنّ فيها بعد موت النبيّ صلى الله عليه وسلم إلى وفاتهنّ، وذلك أن النبيّ صلى الله عليه وسلم وهب ذلك لهنَّ في حياته. الثاني: أن ذلك كان إسكاناً كما يسكن الرجل أهله ولم يكن هبة، وتمادى سكناهنّ بها إلى الموت. وهذا هو الصحيح، وهو الذي ارتضاه أبو عمر بن عبد البر وابن العربيّ وغيرهم، فإن ذلك من مئونتهنّ التي كان رسول الله صلى الله عليه وسلم استثناها لهنّ، كما استثنى لهنّ نفقاتهنّ حين قال: \" لا تَقْتَسم ورثتي ديناراً ولا درهماً، ما تركت بعد نفقة أهلي ومئونة عاملي فهو صدقة \" هكذا قال أهل العلم، قالوا: ويدلّ على ذلك أن مساكنهنّ لم يرثها عنهنّ ورثتهنّ. قالوا: ولو كان ذلك ملكاً لهنّ كان لا شك قد ورثه عنهنّ ورثتهنّ. قالوا: وفي ترك ورثتهنّ ذلك دليل على أنها لم تكن لهنّ ملكاً، وإنما كان لهنّ سكنى حياتهنّ، فلما تَوفَّين جعل ذلك زيادة في المسجد الذي يعم المسلمين نفعه، كما جعل ذلك الذي كان لهنّ من النفقات في تركة رسول الله صلى الله عليه وسلم لما مضين لسبيلهنّ، فزيد إلى أصل المال فصرف في منافع المسلمين مما يعمّ جميعَهم نفعُه.\n\n                                   والله الموفق.\n\nقوله تعالى: { غَيْرَ نَاظِرِينَ إِنَاهُ } أي غير منتظرين وقت نُضْجه. و«إنَاهُ» مقصور، وفيه لغات: «إنَى» بكسر الهمزة. قال الشيباني:\nوكِسْرَى إذ تقسّمه بَنُوه\t   \tبأسياف كما اقْتُسِم اللِّحام\nتمخّضت المَنون له بيوم\t   \tأنَى ولكل حاملة تمام\nوقرأ ابن أبي عبلة: «غَيِر نَاظِرِينَ إِنَاه» مجروراً صفة لـ«ـطعام». الزمخشريّ: وليس بالوجه، لأنه جرى على غير ما هو له، فمن حق ضمير ما هو له أن يبرز إلى اللفظ، فيقال: غيرِ ناظرين إناه أنتم، كقولك: هندٌ زيدٌ ضاربته هي. وأنى (بفتحها)، وأناء (بفتح الهمزة والمد) قال الحطيئة:\nوأخّرت العَشاء إلى سُهَيْل\t   \tأو الشِّعْرَى فطال بِيَ الأناءُ\nيعني إلى طلوع سهيل. وإناه مصدر أنى الشيء يأنى إذا فرغ وحان وأدرك.\n\nالرابعة: قوله تعالى: { وَلَـكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ } فأكّد المنع، وخصّ وقت الدخول بأن يكون عند الإذن على جهة الأدب، وحفظ الحضرة الكريمة من المباسطة المكروهة. قال ابن العربيّ: وتقدير الكلام: ولكن إذا دعيتم وأذن لكم في الدخول فادخلوا، وإلا فنفس الدعوة لا تكون إذناً كافياً في الدخول. والفاء في جواب «إذا» لازمة لما فيها من معنى المجازاة.\n\nالخامسة: قوله تعالى: { فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ } أَمر تعالى بعد الإطعام بأن يتفرّق جميعهم وينتشروا. والمراد إلزام الخروج من المنزل عند انقضاء المقصود من الأكل. والدليل على ذلك أن الدخول حرام، وإنما جاز لأجل الأكل، فإذا انقضى الأكل زال السبب المبيح وعاد التحريم إلى أصله.\n\nالسادسة: في هذه الآية دليل على أن الضيف يأكل على ملك المضيف لا على ملك نفسه؛ لأنه قال: { فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ } فلم يجعل له أكثر من الأكل، ولا أضاف إليه سواه، وبقي الملك على أصله.\n\nالسابعة: قوله تعالى: { وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ } عطف على قوله: { غَيْرَ نَاظِرِينَ } و«غَيْرَ» منصوبة على الحال من الكاف والميم في «لكم» أي غير ناظرين ولا مستأنسين؛ والمعنى المقصود: لا تمكثوا مستأنسين بالحديث كما فعل أصحاب رسول الله صلى الله عليه وسلم في وليمة زينب. { إِنَّ ذَلِكُمْ كَانَ يُؤْذِي ٱلنَّبِيَّ فَيَسْتَحْيِ مِنكُمْ وَٱللَّهُ لاَ يَسْتَحْيِ مِنَ ٱلْحَقِّ } أي لا يمتنع من بيانه وإظهاره. ولما كان ذلك يقع من البشر لعلة الاستحياء نفى عن الله تعالى العلة الموجبة لذلك في البشر. وفي الصحيح عن أم سلَمة قالت: \" جاءت أم سُليم إلى النبيّ صلى الله عليه وسلم فقالت: يا رسول الله، إن الله لا يستحيي من الحق، فهل على المرأة من غسل إذا احتلمت؟ فقال رسول الله صلى الله عليه وسلم: «إذا رأت الماء» \". \n                                  الثامنة: قوله تعالى: { وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعاً } الآية.\n                                   روى أبو داود الطيالسي عن أنس بن مالك قال: قال عمر: وافقت ربي في أربع...؛ الحديث. وفيه: قلت يا رسول الله، لو ضربتَ على نسائك الحجاب، فإنه يدخل عليهنّ البرّ والفاجر؛ فأنزل الله عز وجل { وَإِذَا سَأَلْتُمُوهُنَّ مَتَاعاً فَٱسْأَلُوهُنَّ مِن وَرَآءِ حِجَابٍ }.\n\nواختلف في المتاع؛ فقيل: ما يتمتع به من العواريّ. وقيل فَتْوَى. وقيل صحف القرآن. والصواب أنه عام في جميع ما يمكن أن يطلب من المواعين وسائر المرافق للدين والدنيا.\n\nالتاسعة: في هذه الآية دليل على أن الله تعالى أذن في مسألتهنّ من وراء حجاب في حاجة تَعْرِض، أو مسألة يُستفتين فيها؛ ويدخل في ذلك جميع النساء بالمعنى، وبما تضمنته أصول الشريعة من أن المرأة كلها عورة، بدنها وصوتها؛ كما تقدّم، فلا يجوز كشف ذلك إلا لحاجة كالشهادة عليها، أو داء يكون ببدنها، أو سؤالها عما يعرض وتعيَّن عندها.\n\nالعاشرة: استدلّ بعض العلماء بأخذ الناس عن أزواج النبيّ صلى الله عليه وسلم من وراء حجاب على جواز شهادة الأعمى، وبأن الأعمى يطأ زوجته بمعرفته بكلامها. وعلى إجازة شهادته أكثر العلماء، ولم يجزها أبو حنيفة والشافعيّ وغيرهما. قال أبو حنيفة: تجوز في الأنساب. وقال الشافعيّ: لا تجوز إلا فيما رآه قبل ذهاب بصره.\n\nالحادية عشرة: قوله تعالى: { ذٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ } يريد من الخواطر التي تعرض للرجال في أمر النساء، وللنساء في أمر الرجال؛ أي ذلك أنفى للريبة وأبعد للتهمة وأقوى في الحماية. وهذا يدلّ على أنه لا ينبغي لأحد أن يثق بنفسه في الخلوة مع من لا تحل له؛ فإن مجانبة ذلك أحسن لحاله وأحصن لنفسه وأتم لعصمته.\n\nالثانية عشرة: قوله تعالى: { وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ } الآية. هذا تكرار للعلة وتأكيد لحكمها؛ وتأكيد العلل أقوى في الأحكام.\n\nالثالثة عشرة: قوله تعالى: { وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً } روى إسماعيل بن إسحاق قال حدثنا محمد بن عبيد قال: حدثنا محمد بن ثور عن معمر عن قتادة أن رجلاً قال: لو قُبض رسول الله صلى الله عليه وسلم تزوجتُ عائشة؛ فأنزل الله تعالى: { وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ } الآية. ونزلت: { وَأَزْوَاجُهُ أُمَّهَاتُهُمْ }. وقال القشيري أبو نصر عبد الرحمن: قال ابن عباس قال رجل من سادات قريش من العشرة الذين كانوا مع رسول الله صلى الله عليه وسلم على حِراء ـ في نفسه ـ لو توفي رسول الله صلى الله عليه وسلم لتزوَّجت عائشة، وهي بنت عمي. قال مقاتل: هو طلحة بن عبيد الله. قال ابن عباس: وندم هذا الرجل على ما حدّث به في نفسه، فمشى إلى مكة على رجليه وحمل على عشرة أفراس في سبيل الله، وأعتق رقيقاً فكفّر الله عنه. وقال ابن عطية: روي أنها نزلت بسبب أن بعض الصحابة قال: لو مات رسول الله صلى الله عليه وسلم لتزوَّجت عائشة؛ فبلغ ذلك رسول الله صلى الله عليه وسلم فتأذّى به؛ هكذا كنَّى عنه ابن عباس ببعض الصحابة.\n                                   وحكى مكيّ عن معمر أنه قال: هو طلحة بن عبيد الله.\n\nقلت: وكذا حكى النحاس عن معمر أنه طلحة؛ ولا يصح. قال ابن عطية: لله درّ ابن عباس! وهذا عندي لا يصح على طلحة بن عبيد الله. قال شيخنا الإمام أبو العباس: وقد حكي هذا القول عن بعض فضلاء الصحابة، وحاشاهم عن مثله! والكذب في نقله؛ وإنما يليق مثل هذا القول بالمنافقين الجهال. يروى أن رجلاً من المنافقين قال حين تزوّج رسول الله صلى الله عليه وسلم أمّ سلمة بعد أبي سلمة، وحفصة بعد خُنيس بن حُذافة: ما بال محمد يتزوّج نساءنا! والله لو قد مات لأجَلْنا السهام على نسائه؛ فنزلت الآية في هذا؛ فحرم الله نكاح أزواجه من بعده، وجعل لهن حكم الأمهات. وهذا من خصائصه تمييزاً لشرفه وتنبيهاً على مرتبته صلى الله عليه وسلم. قال الشافعيّ رحمه الله: وأزواجه صلى الله عليه وسلم اللاتي مات عنهن لا يحلّ لأحد نكاحهن، ومن استحلّ ذلك كان كافراً؛ لقوله تعالى: { وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً }. وقد قيل: إنما منع من التزوّج بزوجاته؛ لأنهن أزواجه في الجنة، وأن المرأة في الجنة لآخر أزواجها. قال حذيفة لامرأته: إن سرّك أن تكوني زوجتي في الجنة إن جمعنا الله فيها فلا تزوّجي من بعدي؛ فإن المرأة لآخر أزواجها. وقد ذكرنا ما للعلماء في هذا في (كتاب التذكرة) من أبواب الجنة.\n\nالرابعة عشرة: اختلف العلماء في أزواج النبيّ صلى الله عليه وسلم بعد موته؛ هل بقين أزواجاً أم زال النكاح بالموت، وإذا زال النكاح بالموت فهل عليهن عدة أم لا؟ فقيل: عليهن العدة؛ لأنه تُوُفّي عنهن، والعدة عبادة. وقيل: لا عدة عليهن؛ لأنها مدة تربص لا ينتظر بها الإباحة. وهو الصحيح؛ لقوله عليه السلام: \" ما تركت بعد نفقة عيالي \" وروي \" أهلي \" وهذا اسم خاص بالزوجية؛ فأبقى عليهن النفقة والسكنى مدة حياتهن لكونهن نساءه، وحرمن على غيره؛ وهذا هو معنى بقاء النكاح. وإنما جعل الموت في حقه عليه السلام لهن بمنزلة المغيب في حق غيره؛ لكونهن أزواجاً له في الآخرة قطعاً بخلاف سائر الناس؛ لأن الرجل لا يعلم كونه مع أهله في دار واحدة، فربما كان أحدهما في الجنة والآخر في النار؛ فبهذا انقطع السبب في حق الخلق وبقي في حق النبيّ صلى الله عليه وسلم؛ وقد قال عليه السلام: \" زوجاتي في الدنيا هن زوجاتي في الآخرة \"\n                                   وقال عليه السلام: \" كل سبب ونسب ينقطع إلا سببي ونسبي فإنه باق إلى يوم القيامة \". فرع: فأما زوجاته عليه السلام اللاتي فارقهن في حياته مثل الكَلْبية وغيرها؛ فهل كان يحلّ لغيره نكاحهن؟ فيه خلاف. والصحيح جواز ذلك؛ لما روي أن الكلبية التي فارقها رسول الله صلى الله عليه وسلم تزوجها عكرمة بن أبي جهل على ما تقدّم. وقيل: إن الذي تزوّجها الأشعث بن قيس الكندي. قال القاضي أبو الطيّب: الذي تزوّجها مهاجر بن أبي أميّة، ولم ينكر ذلك أحد؛ فدلّ على أنه إجماع.\n\nالخامسة عشرة: قوله تعالى: { إِنَّ ذٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً } يعني أَذِيَّة رسول الله صلى الله عليه وسلم أو نكاح أزواجه؛ فجعل ذلك من جملة الكبائر ولا ذنب أعظم منه.\n\nالسادسة عشرة: قد بيّنا سبب نزول الحجاب من حديث أنس وقول عمر، وكان يقول لسَوْدة إذا خرجت وكانت امرأة طويلة: قد رأيناك يا سودة، حرصاً على أن ينزل الحجاب، فأنزل الله آية الحجاب. ولا بُعْد في نزول الآية عند هذه الأسباب كلها ـ والله أعلم ـ بَيْدَ أنه لما ماتت زينب بنت جحش قال: لا يشهد جنازتها إلا ذو محرم منها؛ مراعاةً للحجاب الذي نزل بسببها. فدلته أسماء بنت عُميس على سترها في النعش في القُبّة، وأعلمته أنها رأت ذلك في بلاد الحبشة فصنعه عمر. وروي أن ذلك صُنع في جنازة فاطمة بنت النبي صلى الله عليه وسلم.\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلَّآ أَن يُؤۡذَنَ لَكُمۡ إِلَىٰ طَعَامٍ غَيۡرَ نَٰظِرِينَ إِنَىٰهُ وَلَٰكِنۡ إِذَا دُعِيتُمۡ فَٱدۡخُلُواْ فَإِذَا طَعِمۡتُمۡ فَٱنتَشِرُواْ وَلَا مُسۡتَ‍ٔۡنِسِينَ لِحَدِيثٍۚ إِنَّ ذَٰلِكُمۡ كَانَ يُؤۡذِي ٱلنَّبِيَّ فَيَسۡتَحۡيِۦ مِنكُمۡۖ وَٱللَّهُ لَا يَسۡتَحۡيِۦ مِنَ ٱلۡحَقِّۚ وَإِذَا سَأَلۡتُمُوهُنَّ مَتَٰعٗا فَسۡ‍َٔلُوهُنَّ مِن وَرَآءِ حِجَابٖۚ ذَٰلِكُمۡ أَطۡهَرُ لِقُلُوبِكُمۡ وَقُلُوبِهِنَّۚ وَمَا كَانَ لَكُمۡ أَن تُؤۡذُواْ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓاْ أَزۡوَٰجَهُۥ مِنۢ بَعۡدِهِۦٓ أَبَدًاۚ إِنَّ ذَٰلِكُمۡ كَانَ عِندَ ٱللَّهِ عَظِيمًا ٣٥\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده المؤمنين بالتأدب مع رسول اللّه صلى اللّه عليه وسلم في دخول بيوته، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ } أي: لا تدخلوها بغير إذن للدخول فيها لأجل الطعام. وأيضاً لا تكونوا { نَاظِرِينَ إِنَاهُ } أي: منتظرين ومتأنين لانتظار نضجه، أو سعة صدر بعد الفراغ منه. والمعنى: أنكم لا تدخلوا بيوت النبي إلا بشرطين: الإذن لكم بالدخول، وأن يكون جلوسكم بمقدار الحاجة، ولهذا قال: { وَلَـكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ } أي: قبل الطعام وبعده. ثم بيَّن حكمة النهي وفائدته فقال: { إِنَّ ذَٰلِكُمْ } أي: انتظاركم الزائد على الحاجة، { كَانَ يُؤْذِي ٱلنَّبِيَّ } أي: يتكلف منه ويشق عليه حبسكم إياه عن شؤون بيته، واشتغاله فيه { فَيَسْتَحْيِي مِنكُمْ } أن يقول لكم: \" اخرجوا \" كما هو جاري العادة، أن الناس - وخصوصاً أهل الكرم منهم - يستحيون أن يخرجوا الناس من مساكنهم، { وَ } لكن { ٱللَّهُ لاَ يَسْتَحْيِي مِنَ ٱلْحَقِّ }. فالأمر الشرعي، ولو كان يتوهم أن في تركه أدباً وحياءً، فإن الحزم كل الحزم، اتباع الأمر الشرعي، وأن يجزم أن ما خالفه ليس من الأدب في شيء. واللّه تعالى لا يستحي أن يأمركم بما فيه الخير لكم، والرفق لرسوله كائناً ما كان. فهذا أدبهم في الدخول في بيوته، وأما أدبهم معه في خطاب زوجاته، فإنه إما أن يحتاج إلى ذلك، أو لا يحتاج إليه، فإن لم يحتج إليه فلا حاجة إليه، والأدب تركه، وإن احتيج إليه، كأن يُسألن متاعاً، أو غيره من أواني البيت أو نحوها، فإنهن يُسألن { مِن وَرَآءِ حِجَابٍ } أي: يكون بينكم وبينهن ستر يستر عن النظر، لعدم الحاجة إليه. فصار النظر إليهن ممنوعاً بكل حال، وكلامهن فيه التفصيل الذي ذكره اللّه، ثم ذكر حكمة ذلك بقوله: { ذٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ } لأنه أبعد عن الريبة، وكلما بعد الإنسان عن الأسباب الداعية إلى الشر، فإنه أسلم له، وأطهر لقلبه. فلهذا، من الأمور الشرعية التي بيَّن اللّه كثيراً من تفاصيلها، أن جميع وسائل الشر وأسبابه ومقدماته، ممنوعة، وأنه مشروع البعد عنها بكل طريق. ثم قال كلمة جامعة وقاعدة عامة: { وَمَا كَانَ لَكُمْ } يا معشر المؤمنين، أي: غير لائق ولا مستحسن منكم، بل هو أقبح شيء { أَن تؤْذُواْ رَسُولَ ٱللَّهِ } أي: أذية قولية أو فعلية، بجميع ما يتعلق به، { وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً } هذا من جملة ما يؤذيه، فإنه صلى اللّه عليه وسلم له مقام التعظيم والرفعة والإكرام، وتزوج زوجاته [بعده] مخل بهذا المقام. وأيضاً، فإنهن زوجاته في الدنيا والآخرة، والزوجية باقية بعد موته، فلذلك لا يحل نكاح زوجاته بعده لأحد من أمته. { إِنَّ ذٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً } وقد امتثلت هذه الأمة هذا الأمر، واجتنبت ما نهى اللّه عنه منه، وللّه الحمد والشكر. ثم قال تعالى: { إِن تُبْدُواْ شَيْئاً } أي: تظهروه { أَوْ تُخْفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيماً } يعلم ما في قلوبكم وما أظهرتموه، فيجازيكم عليه.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلَّآ أَن يُؤۡذَنَ لَكُمۡ إِلَىٰ طَعَامٍ غَيۡرَ نَٰظِرِينَ إِنَىٰهُ وَلَٰكِنۡ إِذَا دُعِيتُمۡ فَٱدۡخُلُواْ فَإِذَا طَعِمۡتُمۡ فَٱنتَشِرُواْ وَلَا مُسۡتَ‍ٔۡنِسِينَ لِحَدِيثٍۚ إِنَّ ذَٰلِكُمۡ كَانَ يُؤۡذِي ٱلنَّبِيَّ فَيَسۡتَحۡيِۦ مِنكُمۡۖ وَٱللَّهُ لَا يَسۡتَحۡيِۦ مِنَ ٱلۡحَقِّۚ وَإِذَا سَأَلۡتُمُوهُنَّ مَتَٰعٗا فَسۡ‍َٔلُوهُنَّ مِن وَرَآءِ حِجَابٖۚ ذَٰلِكُمۡ أَطۡهَرُ لِقُلُوبِكُمۡ وَقُلُوبِهِنَّۚ وَمَا كَانَ لَكُمۡ أَن تُؤۡذُواْ رَسُولَ ٱللَّهِ وَلَآ أَن تَنكِحُوٓاْ أَزۡوَٰجَهُۥ مِنۢ بَعۡدِهِۦٓ أَبَدًاۚ إِنَّ ذَٰلِكُمۡ كَانَ عِندَ ٱللَّهِ عَظِيمًا ٣٥"
    },
    {
      "number": 3587,
      "text": "إِنْ تُبْدُوا شَيْئًا أَوْ تُخْفُوهُ فَإِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا",
      "surah": {
        "number": 33,
        "name": "سورة الأحزاب",
        "englishName": "Al-Ahzaab",
        "englishNameTranslation": "The Clans",
        "revelationType": "Medinan",
        "numberOfAyahs": 73
      },
      "numberInSurah": 54,
      "juz": 22,
      "manzil": 5,
      "page": 425,
      "ruku": 367,
      "hizbQuarter": 170,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن تُبۡدُواْ شَيۡ‍ًٔا أَوۡ تُخۡفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا ٤٥\n                                    \n                                    \n                                    هذه آية الحجاب وفيها أحكام وآداب شرعية، وهي مما وافق تنزيلها قول عمر بن الخطاب رضي الله عنه، كما ثبت ذلك في الصحيحين عنه أنه قال وافقت ربي عز وجل في ثلاث، قلت يا رسول الله لو اتخذت من مقام إبراهيم مصلى، فأنزل الله تعالى\n{ وَٱتَّخِذُواْ مِن مَّقَامِ إِبْرَٰهِيمَ مُصَلًّى }\nالبقرة 125 وقلت يا رسول الله إن نساءك يدخل عليهن البر والفاجر، فلو حجبتهن، فأنزل الله آية الحجاب، وقلت لأزواج النبي صلى الله عليه وسلم لما تمالأن عليه في الغيرة\n{ عَسَىٰ رَبُّهُ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُ أَزْوَٰجاً خَيْراً مِّنكُنَّ }\nالتحريم 5 فنزلت كذلك، وفي رواية لمسلم ذكر أسارى بدر، وهي قضية رابعة. وقد قال البخاري حدثنا مسدد عن يحيى عن حميد عن أنس بن مالك قال قال عمر بن الخطاب يا رسول الله يدخل عليك البر والفاجر، فلو أمرت أمهات المؤمنين بالحجاب، فأنزل الله آية الحجاب، وكان وقت نزولها في صبيحة عرس رسول الله صلى الله عليه وسلم بزينب بنت جحش الأسدية التي تولى الله تعالى تزويجها بنفسه، وكان ذلك في ذي القعدة من السنة الخامسة في قول قتادة والواقدي وغيرهما، وزعم أبو عبيدة معمر بن المثنى وخليفة بن خياط أن ذلك كان في سنة ثلاث، فالله أعلم. قال البخاري حدثنا محمد بن عبد الله الرقاشي، حدثنا معتمر بن سليمان، سمعت أبي، حدثنا أبو مجلز عن أنس بن مالك رضي الله عنه قال لما تزوج رسول الله صلى الله عليه وسلم زينب بنت جحش، دعا القوم فطعموا، ثم جلسوا يتحدثون، فإذا هو يتهيأ للقيام، فلم يقوموا، فلما رأى ذلك، قام، فلما قام، قام من قام، وقعد ثلاثة نفر، فجاء النبي صلى الله عليه وسلم ليدخل، فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا، فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل، فذهبت أدخل، فألقى الحجاب بيني وبينه، فأنزل الله تعالى { يٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِىِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَـٰظِرِينَ إِنَـٰهُ وَلَـكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ } الآية، وقد رواه أيضا في موضع آخر، ومسلم والنسائي من طرق عن معتمر بن سليمان به. ثم رواه البخاري منفرداً به من حديث أيوب عن أبي قلابة، عن أنس بن مالك رضي الله عنه بنحوه، ثم قال حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب عن أنس بن مالك قال بنى النبي صلى الله عليه وسلم زينت بنت جحش بخبز ولحم، فأرسلت على الطعام داعياً، فيجيء قوم فيأكلون ويخرجون، ثم يجيء قوم فيأكلون ويخرجون، فدعوت حتى ما أجد أحداً أدعوه، فقلت يا رسول الله ما أجد أحداً أدعوه، قال\n                                   \" ارفعوا طعامكم \" ، وبقي ثلاثة رهط يتحدثون في البيت، فخرج النبي صلى الله عليه وسلم فانطلق إلى حجرة عائشة رضي الله عنها فقال \" السلام عليكم أهل البيت ورحمة الله وبركاته \" قالت وعليك السلام ورحمة الله، كيف وجدت أهلك يا رسول الله؟ بارك الله لك؟ فتقرى حجر نسائه كلهن، يقول لهن كما يقول لعائشة، ويقلن له كما قالت عائشة، ثم رجع النبي صلى الله عليه وسلم فإذا ثلاثة رهط في البيت يتحدثون، وكان النبي صلى الله عليه وسلم شديد الحياء، فخرج منطلقاً نحو حجرة عائشة، فما أدري أخبرته أم أخبر أن القوم خرجوا، فرجع حتى إذا وضع رجله في أسكفة الباب داخله، والأخرى خارجة، أرخى الستر بيني وبينه، وأنزل آية الحجاب. انفرد به البخاري من بين أصحاب الكتب الستة سوى النسائي في اليوم والليلة من حديث عبد الوارث، ثم رواه عن إسحاق، هو ابن منصور، عن عبد الله بن بكر السهمي عن حميد عن أنس بنحو ذلك، وقال رجلان انفرد به من هذا الوجه، وقد تقدم في أفراد مسلم من حديث سليمان بن المغيرة عن ثابت عن أنس. وقال ابن أبي حاتم حدثنا أبي، حدثنا أبو المظفر، حدثنا جعفر بن سليمان عن الجعد أبي عثمان اليشكري عن أنس بن مالك قال أعرس رسول الله صلى الله عليه وسلم ببعض نسائه، فصنعت أم سليم حيساً، ثم جعلته في تور، فقالت اذهب بهذا إلى رسول الله صلى الله عليه وسلم وأقرئه مني السلام، وأخبره أن هذا منا له قليل، قال أنس والناس يومئذ في جهد، فجئت به فقلت يا رسول الله بعثت بهذا أم سليم إليك، وهي تقرئك السلام وتقول أخبره أن هذا منا له قليل، فنظر إليه ثم قال \" ضعه \" فوضعته في ناحية البيت، ثم قال \" اذهب فادع لي فلاناً وفلاناً \" فسمى رجالاً كثيراً، وقال \" ومن لقيت من المسلمين \" فدعوت من قال لي، ومن لقيت من المسلمين، فجئت والبيت والصفة والحجرة ملأى من الناس، فقلت يا أبا عثمان كم كانوا؟ فقال كانوا زهاء ثلاثمائة. قال أنس فقال لي رسول الله صلى الله عليه وسلم \" جىء به \" فجئت به إليه، فوضع يده عليه، ودعا وقال \" ما شاء الله \" ثم قال \" ليتحلق عشرة عشرة، وليسموا، وليأكل كل إنسان مما يليه \" فجعلوا يسمون ويأكلون حتى أكلوا كلهم، فقال لي رسول الله صلى الله عليه وسلم \" ارفعه \" قال فجئت فأخذت التور، فنظرت فيه، فما أدري أهو حين وضعت أكثر، أم حين أخذت؟ قال وتخلف رجال يتحدثون في بيت رسول الله صلى الله عليه وسلم وزوج رسول الله صلى الله عليه وسلم التي دخل بها معهم مولية وجهها إلى الحائط، فأطالوا الحديث، فشقوا على رسول الله صلى الله عليه وسلم وكان أشد الناس حياء، ولو أعلموا، كان ذلك عليهم عزيزاً، فقام رسول الله صلى الله عليه وسلم فخرج فسلم على حجره وعلى نسائه، فلما رأوه قد جاء، ظنوا أنهم قد ثقلوا عليه، ابتدروا الباب فخرجوا، وجاء رسول الله صلى الله عليه وسلم حتى أرخى الستر ودخل البيت، وأنا في الحجرة، فمكث رسول الله صلى الله عليه وسلم في بيته يسيراً، وأنزل الله عليه القرآن، فخرج وهو يتلو هذا الآية { يٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِىِّ } الآيات، قال أنس فقرأهن علي قبل الناس، فأنا أحدث الناس بهن عهداً، وقد رواه مسلم والترمذي والنسائي جميعاً عن قتيبة عن جعفر بن سليمان به، وقال الترمذي حسن صحيح، وعلقه البخاري في كتاب النكاح، فقال وقال إبراهيم بن طهمان عن الجعد أبي عثمان عن أنس، فذكر نحوه.\n                                   ورواه مسلم أيضاً عن محمد بن رافع عن عبد الرزاق عن معمر عن الجعد به، وقد روى هذا الحديث عبد الله بن المبارك عن شريك عن بيان بن بشر عن أنس بنحوه، ورواه البخاري والترمذي من طريقين آخرين عن بيان بن بشر الأحمسي الكوفي عن أنس بنحوه، ورواه ابن أبي حاتم أيضاً من حديث أبي نضرة العبدي عن أنس بن مالك بنحو ذلك، ولم يخرجوه، ورواه ابن جرير من حديث عمرو بن سعيد، ومن حديث الزهري عن أنس بنحو ذلك. وقال الإمام أحمد حدثنا بهز وهاشم بن القاسم قالا حدثنا سليمان بن المغيرة عن ثابت عن أنس قال لما انقضت عدة زينب، قال رسول الله صلى الله عليه وسلم لزيد \" اذهب فاذكرها علي \" قال فانطلق زيد حتى أتاها ــــ قال ــــ وهي تخمر عجينها، فلما رأيتها، عظمت في صدري، وذكر تمام الحديث كما قدمناه عند قوله تعالى { أَن تَخْشَـٰهُ فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَراً } وزاد في آخره بعد قوله ووعظ القوم بما وعظوا به قال هاشم في حديثه { لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِىِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ } الآية. وقد أخرجه مسلم والنسائي من حديث سليمان بن المغيرة، به. وقال ابن جرير حدثني أحمد بن عبد الرحمن ابن أخي ابن وهب، حدثني عمي عبد الله بن وهب، حدثني يونس عن الزهري عن عروة عن عائشة قالت إن أزواج النبي صلى الله عليه وسلم كن يخرجن بالليل إذا تبرزن إلى المناصع ــــ وهو صعيد أفيح ــــ وكان عمر يقول لرسول الله صلى الله عليه وسلم احجب نساءك، فلم يكن رسول الله صلى الله عليه وسلم ليفعل، فخرجت سودة بنت زمعة زوج رسول الله صلى الله عليه وسلم وكانت امرأة طويلة، فناداها عمر بصوته الأعلى قد عرفناك يا سودة حرصاً على أن ينزل الحجاب، قالت فأنزل الله الحجاب، هكذا وقع في هذه الرواية، والمشهور أن هذا كان بعد نزول الحجاب.\n                                   كما رواه الإمام أحمد والبخاري ومسلم من حديث هشام بن عروة عن أبيه عن عائشة رضي الله عنها قالت خرجت سودة بعدما ضرب الحجاب لحاجتها، وكانت امرأة جسيمة، لا تخفى على من يعرفها، فرأها عمر بن الخطاب، فقال ياسودة أما والله ما تخفين علينا، فانظري كيف تخرجين؟ قالت فانكفأت راجعة، ورسول الله صلى الله عليه وسلم في بيتي، وإنه ليتعشى وفي يده عرق، فدخلت فقالت يا رسول الله إني خرجت لبعض حاجتي، فقال لي عمر كذا وكذا، قالت فأوحى الله إليه، ثم رفع عنه، وإن العرق في يده ما وضعه، فقال \" إنه قد أذن لكن أن تخرجن لحاجتكن \" لفظ البخاري، فقوله تعالى { لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ } حظر على المؤمنين أن يدخلوا منازل رسول الله صلى الله عليه وسلم بغير إذن كما كانوا قبل ذلك يصنعون في بيوتهم في الجاهلية وابتداء الإسلام، حتى غار الله لهذه الأمة، فأمرهم بذلك، وذلك من إكرامه تعالى هذه الأمة، ولهذا قال رسول الله صلى الله عليه وسلم \" إياكم والدخول على النساء \" الحديث، ثم استثنى من ذلك، فقال تعالى { إِلاَّ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ غَيْرَ نَـٰظِرِينَ إِنَـٰهُ } قال مجاهد وقتادة وغيرهما أي غير متحينين نضجه واستواءه، أي لا ترقبوا الطعام إذا طبخ، حتى إذا قارب الاستواء، تعرضتم للدخول، فإن هذا مما يكرهه الله ويذمه، وهذا دليل على تحريم التطفيل، وهو الذي تسميه العرب الضيفن، وقد صنف الخطيب البغدادي في ذلك كتاباً في ذم الطفيليين، وذكر من أخبارهم أشياء يطول إيرادها. ثم قال تعالى { وَلَـٰكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ } وفي \" صحيح مسلم \" عن ابن عمر رضي الله عنهما قال قال رسول الله صلى الله عليه وسلم \" إذا دعا أحدكم أخاه، فليجب، عرساً كان أو غيره \" وأصله في \" الصحيحين \" ، وفي الصحيح أيضاً عن رسول الله صلى الله عليه وسلم \" لو دعيت إلى ذراع لأجبت، ولو أهدي إلى كراع لقبلت، فإذا فرغتم من الذي دعيتم إليه، فخففوا عن أهل المنزل، وانتشروا في الأرض \" ولهذا قال تعالى { طَعِمْتُمْ فَٱنْتَشِرُواْ وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ } أي كما وقع لأولئك النفر الثلاثة الذين استرسل بهم الحديث، ونسوا أنفسهم، حتى شق ذلك على رسول الله صلى الله عليه وسلم كما قال تعالى { إِنَّ ذَلِكُمْ كَانَ يُؤْذِى ٱلنَّبِىِّ فَيَسْتَحْيِى مِنكُمْ } وقيل المراد إن دخولكم منزله بغير إذنه كان يشق عليه، ويتأذى به، ولكن كان يكره أن ينهاهم عن ذلك من شدة حيائه عليه السلام، حتى أنزل الله عليه النهي عن ذلك، ولهذا قال تعالى { وَٱللَّهُ لاَ يَسْتَحْىِ مِنَ ٱلْحَقِّ } أي ولهذا نهاكم عن ذلك، وزجركم عنه.\n                                   ثم قال تعالى { وَإِذَا سَأَلْتُمُوهُنَّ مَتَـٰعاً فَٱسْـأَلُوهُنَّ مِن وَرَآءِ حِجَابٍ } أي وكما نهيتكم عن الدخول عليهن، كذلك لا تنظروا إليهن بالكلية، ولو كان لأحدكم حاجة يريد تناولها منهن، فلا ينظر إليهن، ولا يسألهن حاجة إلا من وراء حجاب. وقال ابن أبي حاتم حدثنا أبي، حدثنا ابن أبي عمر، حدثنا سفيان عن مسعر عن موسى بن أبي كثير عن مجاهد عن عائشة قالت كنت آكل مع النبي صلى الله عليه وسلم حيساً في قعب، فمر عمر، فدعاه فأكل، فأصابت إصبعه إصبعي، فقال حَسِّ، أو أوه، لو أطاع فيكن، ما رأتكن عين، فنزل الحجاب. { ذَٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ } أي هذا الذي أمرتكم به، وشرعته لكم من الحجاب، أطهر وأطيب. وقوله تعالى { وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً إِنَّ ذَٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً } قال ابن أبي حاتم حدثنا علي بن الحسين، حدثنا محمد بن أبي حماد، حدثنا مهران عن سفيان عن داود بن أبي هند عن عكرمة عن ابن عباس في قوله تعالى { وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ } قال نزلت في رجل هم أن يتزوج بعض نساء النبي صلى الله عليه وسلم بعده، قال رجل لسفيان أهي عائشة؟ قال قد ذكروا ذلك، وكذا قال مقاتل بن حيان وعبد الرحمن بن زيد بن أسلم، وذكر بسنده عن السدي أن الذي عزم على ذلك طلحة بن عبيد الله رضي الله عنه، حتى نزل التنبيه على تحريم ذلك، ولهذا أجمع العلماء قاطبة على أن من توفي عنها رسول الله صلى الله عليه وسلم من أزواجه أنه يحرم على غيره تزوجها من بعده لأنهن أزواجه في الدنيا والآخرة، وأمهات المؤمنين كما تقدم، واختلفوا فيمن دخل بها ثم طلقها في حياته هل يحل لغيره أن يتزوجها؟ على قولين، مأخذهما هل دخلت هذه في عموم قوله { مِن بَعْدِهِ } أم لا؟ فأما من تزوجها ثم طلقها قبل أن يدخل بها، فما نعلم في حلها لغيره والحالة هذه نزاعاً، والله أعلم. وقال ابن جرير حدثني محمد بن المثنى، حدثنا عبد الوهاب، حدثنا داود عن عامر أن نبي الله صلى الله عليه وسلم مات وقد ملك قيلة بنة الأشعث ــــ يعني ابن قيس ــــ فتزوجها عكرمة بن أبي جهل بعد ذلك، فشق ذلك على أبي بكر مشقة شديدة، فقال له عمر ياخليفة رسول الله إنها ليست من نسائه، إنها لم يخيرها رسول الله، ولم يحجبها، وقد برأها الله منه بالردة التي ارتدت مع قومها قال فاطمأن أبو بكر رضي الله عنه، وسكن، وقد عظم الله تبارك وتعالى ذلك، وشدد فيه، وتوعد عليه بقوله { إِنَّ ذَٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً } ثم قوله تعالى { إِن تُبْدُواْ شَيْئاً أَوْ تُخْفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيماً } أي مهما تكنه ضمائركم، وتنطوي عليه سرائركم، فإن الله يعلمه، فإنه لا تخفى عليه خافية\n{ يَعْلَمُ خَآئِنَةَ ٱلأَعْيُنِ وَمَا تُخْفِى ٱلصُّدُورُ }\nغافر 19.\n                                    ",
        "qortoby": "إِن تُبۡدُواْ شَيۡ‍ًٔا أَوۡ تُخۡفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا ٤٥\n                                    \n                                    \n                                    البارىء سبحانه وتعالى عالم بما بدا وما خفي وما كان وما لم يكن، لا يخفى عليه ماضٍ تَقَضَّى، ولا مستقبَلٌ يأتي. وهذا على العموم تمدّح به، وهو أهل المدح والحمد. والمراد به هاهنا التوبيخ والوعيد لمن تقدّم التعريض به في الآية قبلها، ممن أشير إليه بقوله: { ذٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ } ، ومن أشير إليه في قوله: { وَمَا كَانَ لَكُمْ أَن تؤْذُواْ رَسُولَ ٱللَّهِ وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً } فقيل لهم في هذه الآية: إن الله تعالى يعلم ما تخفونه من هذه المعتقدات والخواطر المكروهة ويجازيكم عليها. فصارت هذه الآية منعطفة على ما قبلها مبينة لها. والله أعلم.\n                                    ",
        "saadi": "إِن تُبۡدُواْ شَيۡ‍ًٔا أَوۡ تُخۡفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا ٤٥\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده المؤمنين بالتأدب مع رسول اللّه صلى اللّه عليه وسلم في دخول بيوته، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَدْخُلُواْ بُيُوتَ ٱلنَّبِيِّ إِلاَّ أَن يُؤْذَنَ لَكُمْ إِلَىٰ طَعَامٍ } أي: لا تدخلوها بغير إذن للدخول فيها لأجل الطعام. وأيضاً لا تكونوا { نَاظِرِينَ إِنَاهُ } أي: منتظرين ومتأنين لانتظار نضجه، أو سعة صدر بعد الفراغ منه. والمعنى: أنكم لا تدخلوا بيوت النبي إلا بشرطين: الإذن لكم بالدخول، وأن يكون جلوسكم بمقدار الحاجة، ولهذا قال: { وَلَـكِنْ إِذَا دُعِيتُمْ فَٱدْخُلُواْ فَإِذَا طَعِمْتُمْ فَٱنْتَشِرُواْ وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ } أي: قبل الطعام وبعده. ثم بيَّن حكمة النهي وفائدته فقال: { إِنَّ ذَٰلِكُمْ } أي: انتظاركم الزائد على الحاجة، { كَانَ يُؤْذِي ٱلنَّبِيَّ } أي: يتكلف منه ويشق عليه حبسكم إياه عن شؤون بيته، واشتغاله فيه { فَيَسْتَحْيِي مِنكُمْ } أن يقول لكم: \" اخرجوا \" كما هو جاري العادة، أن الناس - وخصوصاً أهل الكرم منهم - يستحيون أن يخرجوا الناس من مساكنهم، { وَ } لكن { ٱللَّهُ لاَ يَسْتَحْيِي مِنَ ٱلْحَقِّ }. فالأمر الشرعي، ولو كان يتوهم أن في تركه أدباً وحياءً، فإن الحزم كل الحزم، اتباع الأمر الشرعي، وأن يجزم أن ما خالفه ليس من الأدب في شيء. واللّه تعالى لا يستحي أن يأمركم بما فيه الخير لكم، والرفق لرسوله كائناً ما كان. فهذا أدبهم في الدخول في بيوته، وأما أدبهم معه في خطاب زوجاته، فإنه إما أن يحتاج إلى ذلك، أو لا يحتاج إليه، فإن لم يحتج إليه فلا حاجة إليه، والأدب تركه، وإن احتيج إليه، كأن يُسألن متاعاً، أو غيره من أواني البيت أو نحوها، فإنهن يُسألن { مِن وَرَآءِ حِجَابٍ } أي: يكون بينكم وبينهن ستر يستر عن النظر، لعدم الحاجة إليه. فصار النظر إليهن ممنوعاً بكل حال، وكلامهن فيه التفصيل الذي ذكره اللّه، ثم ذكر حكمة ذلك بقوله: { ذٰلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ } لأنه أبعد عن الريبة، وكلما بعد الإنسان عن الأسباب الداعية إلى الشر، فإنه أسلم له، وأطهر لقلبه. فلهذا، من الأمور الشرعية التي بيَّن اللّه كثيراً من تفاصيلها، أن جميع وسائل الشر وأسبابه ومقدماته، ممنوعة، وأنه مشروع البعد عنها بكل طريق. ثم قال كلمة جامعة وقاعدة عامة: { وَمَا كَانَ لَكُمْ } يا معشر المؤمنين، أي: غير لائق ولا مستحسن منكم، بل هو أقبح شيء { أَن تؤْذُواْ رَسُولَ ٱللَّهِ } أي: أذية قولية أو فعلية، بجميع ما يتعلق به، { وَلاَ أَن تَنكِحُوۤاْ أَزْوَاجَهُ مِن بَعْدِهِ أَبَداً } هذا من جملة ما يؤذيه، فإنه صلى اللّه عليه وسلم له مقام التعظيم والرفعة والإكرام، وتزوج زوجاته [بعده] مخل بهذا المقام. وأيضاً، فإنهن زوجاته في الدنيا والآخرة، والزوجية باقية بعد موته، فلذلك لا يحل نكاح زوجاته بعده لأحد من أمته. { إِنَّ ذٰلِكُمْ كَانَ عِندَ ٱللَّهِ عَظِيماً } وقد امتثلت هذه الأمة هذا الأمر، واجتنبت ما نهى اللّه عنه منه، وللّه الحمد والشكر. ثم قال تعالى: { إِن تُبْدُواْ شَيْئاً } أي: تظهروه { أَوْ تُخْفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيماً } يعلم ما في قلوبكم وما أظهرتموه، فيجازيكم عليه.\n                                    "
      },
      "originalText": "إِن تُبۡدُواْ شَيۡ‍ًٔا أَوۡ تُخۡفُوهُ فَإِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا ٤٥"
    }
  ]
}