{
  "number": 43,
  "ayahsNumber": 3,
  "ayahs": [
    {
      "number": 264,
      "text": "اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ ۖ وَالَّذِينَ كَفَرُوا أَوْلِيَاؤُهُمُ الطَّاغُوتُ يُخْرِجُونَهُمْ مِنَ النُّورِ إِلَى الظُّلُمَاتِ ۗ أُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 257,
      "juz": 3,
      "manzil": 1,
      "page": 43,
      "ruku": 35,
      "hizbQuarter": 17,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ يُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۖ وَٱلَّذِينَ كَفَرُوٓاْ أَوۡلِيَآؤُهُمُ ٱلطَّٰغُوتُ يُخۡرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَٰتِۗ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٧٥٢\n                                        \n                                        \n                                        يخبر تعالى أنه يهدي من اتبع رضوانه سبل السلام فيخرج عباده المؤمنين من ظلمات الكفر والشك والريب إلى نور الحق الواضح الجلي المبين السهل المنير ، وأن الكافرين إنما وليهم الشياطين تزين لهم ما هم فيه من الجهالات والضلالات ، ويخرجونهم ويحيدون بهم عن طريق الحق إلى الكفر والإفك ( أولئك أصحاب النار هم فيها خالدون )\nولهذا وحد تعالى لفظ النور وجمع الظلمات ; لأن الحق واحد والكفر أجناس كثيرة وكلها باطلة كما قال : ( وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله ذلكم وصاكم به لعلكم تتقون ) [ الأنعام : 153 ] وقال تعالى : ( وجعل الظلمات والنور ) [ الأنعام : 1 ] وقال تعالى : ( عن اليمين والشمائل ) [ النحل : 48 ] إلى غير ذلك من الآيات التي في لفظها إشعار بتفرد الحق ، وانتشار الباطل وتفرده وتشعبه .\nوقال ابن أبي حاتم : حدثنا أبي حدثنا علي بن ميسرة حدثنا عبد العزيز بن أبي عثمان عن موسى بن عبيدة عن أيوب بن خالد قال : يبعث أهل الأهواء أو قال : يبعث أهل الفتن ، فمن كان هواه الإيمان كانت فتنته بيضاء مضيئة ، ومن كان هواه الكفر كانت فتنته سوداء مظلمة ، ثم قرأ هذه الآية : ( الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات أولئك أصحاب النار هم فيها خالدون )\n                                    ",
        "qortoby": "ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ يُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۖ وَٱلَّذِينَ كَفَرُوٓاْ أَوۡلِيَآؤُهُمُ ٱلطَّٰغُوتُ يُخۡرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَٰتِۗ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٧٥٢\n                                        \n                                        \n                                        قوله تعالى : الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات أولئك أصحاب النار هم فيها خالدون\nقوله تعالى : الله ولي الذين آمنوا الولي فعيل بمعنى فاعل . قال الخطابي : الولي الناصر ينصر عباده المؤمنين ، قال الله عز وجل : الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور ، وقال ذلك بأن الله مولى الذين آمنوا وأن الكافرين لا مولى لهم ، قال قتادة : الظلمات الضلالة ، والنور الهدى ، وبمعناه قال الضحاك والربيع . وقال مجاهد وعبدة بن أبي لبابة : قوله الله ولي الذين آمنوا نزلت في قوم آمنوا بعيسى فلما جاء محمد صلى الله عليه وسلم كفروا به ، فذلك إخراجهم من النور إلى الظلمات . قال ابن عطية : فكأن هذا المعتقد أحرز نورا في المعتقد خرج منه إلى الظلمات ، ولفظ الآية مستغن عن هذا التخصيص ، بل هو مترتب في كل أمة كافرة آمن بعضها كالعرب ، وذلك أن من آمن منهم فالله وليه أخرجه من ظلمة الكفر إلى نور الإيمان ، ومن كفر بعد وجود النبي صلى الله عليه وسلم الداعي المرسل فشيطانه مغويه ، كأنه أخرجه من الإيمان إذ هو معه معد وأهل للدخول فيه ، وحكم عليهم بالدخول في النار لكفرهم ، عدلا منه ، لا يسأل عما يفعل . وقرأ الحسن \" أولياؤهم الطواغيت \" يعني الشياطين ، والله أعلم .\n                                    ",
        "saadi": "ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ يُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۖ وَٱلَّذِينَ كَفَرُوٓاْ أَوۡلِيَآؤُهُمُ ٱلطَّٰغُوتُ يُخۡرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَٰتِۗ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٧٥٢\n                                        \n                                        \n                                        \n                                        ثم ذكر السبب الذي أوصلهم إلى ذلك فقال: { الله ولي الذين آمنوا } وهذا يشمل ولايتهم لربهم، بأن تولوه فلا يبغون عنه بدلا ولا يشركون به أحدا، قد اتخذوه حبيبا ووليا، ووالوا أولياءه وعادوا أعداءه، فتولاهم بلطفه ومنَّ عليهم بإحسانه، فأخرجهم من ظلمات الكفر والمعاصي والجهل إلى نور الإيمان والطاعة والعلم، وكان جزاؤهم على هذا أن سلمهم من ظلمات القبر والحشر والقيامة إلى النعيم المقيم والراحة والفسحة والسرور { والذين كفروا أولياؤهم الطاغوت } فتولوا الشيطان وحزبه، واتخذوه من دون الله وليا ووالوه وتركوا ولاية ربهم وسيدهم، فسلطهم عليهم عقوبة لهم فكانوا يؤزونهم إلى المعاصي أزا، ويزعجونهم إلى الشر إزعاجا، فيخرجونهم من نور الإيمان والعلم والطاعة إلى ظلمة الكفر والجهل والمعاصي، فكان جزاؤهم على ذلك أن حرموا الخيرات، وفاتهم النعيم والبهجة والمسرات، وكانوا من حزب الشيطان وأولياءه في دار الحسرة، فلهذا قال تعالى: { أولئك أصحاب النار هم فيها خالدون }\n                                    "
      },
      "originalText": "ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ يُخۡرِجُهُم مِّنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِۖ وَٱلَّذِينَ كَفَرُوٓاْ أَوۡلِيَآؤُهُمُ ٱلطَّٰغُوتُ يُخۡرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَٰتِۗ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٧٥٢"
    },
    {
      "number": 265,
      "text": "أَلَمْ تَرَ إِلَى الَّذِي حَاجَّ إِبْرَاهِيمَ فِي رَبِّهِ أَنْ آتَاهُ اللَّهُ الْمُلْكَ إِذْ قَالَ إِبْرَاهِيمُ رَبِّيَ الَّذِي يُحْيِي وَيُمِيتُ قَالَ أَنَا أُحْيِي وَأُمِيتُ ۖ قَالَ إِبْرَاهِيمُ فَإِنَّ اللَّهَ يَأْتِي بِالشَّمْسِ مِنَ الْمَشْرِقِ فَأْتِ بِهَا مِنَ الْمَغْرِبِ فَبُهِتَ الَّذِي كَفَرَ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 258,
      "juz": 3,
      "manzil": 1,
      "page": 43,
      "ruku": 36,
      "hizbQuarter": 17,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَرَ إِلَى ٱلَّذِي حَآجَّ إِبۡرَٰهِ‍ۧمَ فِي رَبِّهِۦٓ أَنۡ ءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ إِذۡ قَالَ إِبۡرَٰهِ‍ۧمُ رَبِّيَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُ قَالَ أَنَا۠ أُحۡيِۦ وَأُمِيتُۖ قَالَ إِبۡرَٰهِ‍ۧمُ فَإِنَّ ٱللَّهَ يَأۡتِي بِٱلشَّمۡسِ مِنَ ٱلۡمَشۡرِقِ فَأۡتِ بِهَا مِنَ ٱلۡمَغۡرِبِ فَبُهِتَ ٱلَّذِي كَفَرَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٨٥٢\n                                        \n                                        \n                                        هذا الذي حاج إبراهيم في ربه وهو ملك بابل : نمروذ بن كنعان بن كوش بن سام بن نوح . ويقال : نمرود بن فالخ بن عابر بن شالخ بن أرفخشذ بن سام بن نوح والأول قول مجاهد وغيره .\nقال مجاهد : وملك الدنيا مشارقها ومغاربها أربعة : مؤمنان وكافران ، فالمؤمنان : سليمان بن داود وذو القرنين . والكافران : نمرود [ بن كنعان ] وبختنصر . فالله أعلم .\nومعنى قوله : ( ألم تر ) أي : بقلبك يا محمد ( إلى الذي حاج إبراهيم في ربه ) أي : [ في ] وجود ربه . وذلك أنه أنكر أن يكون ثم إله غيره كما قال بعده فرعون لملئه : ( ما علمت لكم من إله غيري ) [ القصص : 38 ] وما حمله على هذا الطغيان والكفر الغليظ والمعاندة الشديدة إلا تجبره ، وطول مدته في الملك ; وذلك أنه يقال : إنه مكث أربعمائة سنة في ملكه ; ولهذا قال : ( أن آتاه الله الملك ) وكأنه طلب من إبراهيم دليلا على وجود الرب الذي يدعو إليه فقال إبراهيم : ( ربي الذي يحيي ويميت ) أي : الدليل على وجوده حدوث هذه الأشياء المشاهدة بعد عدمها ، وعدمها بعد وجودها . وهذا دليل على وجود الفاعل المختار ضرورة ; لأنها لم تحدث بنفسها فلا بد لها من موجد أوجدها وهو الرب الذي أدعو إلى عبادته وحده لا شريك له . فعند ذلك قال المحاج وهو النمروذ : ( أنا أحيي وأميت )\nقال قتادة ومحمد بن إسحاق والسدي وغير واحد : وذلك أني أوتى بالرجلين قد استحقا القتل فآمر بقتل أحدهما فيقتل ، وبالعفو عن الآخر فلا يقتل . فذلك معنى الإحياء والإماتة .\nوالظاهر والله أعلم أنه ما أراد هذا ; لأنه ليس جوابا لما قال إبراهيم ولا في معناه ; لأنه غير مانع لوجود الصانع . وإنما أراد أن يدعي لنفسه هذا المقام عنادا ومكابرة ويوهم أنه الفاعل لذلك وأنه هو الذي يحيي ويميت ، كما اقتدى به فرعون في قوله : ( ما علمت لكم من إله غيري ) ولهذا قال له إبراهيم لما ادعى هذه المكابرة : ( فإن الله يأتي بالشمس من المشرق فأت بها من المغرب ) أي : إذا كنت كما تدعي من أنك [ أنت الذي ] تحيي وتميت فالذي يحيي ويميت هو الذي يتصرف في الوجود في خلق ذواته وتسخير كواكبه وحركاته ، فهذه الشمس تبدو كل يوم من المشرق ، فإن كنت إلها كما ادعيت تحيي وتميت فأت بها من المغرب . فلما علم عجزه وانقطاعه ، وأنه لا يقدر على المكابرة في هذا المقام بهت أي : أخرس فلا يتكلم ، وقامت عليه الحجة . قال الله تعالى ( والله لا يهدي القوم الظالمين ) أي : لا يلهمهم حجة ولا برهانا بل حجتهم داحضة عند ربهم ، وعليهم غضب ولهم عذاب شديد .\nوهذا التنزيل على هذا المعنى أحسن مما ذكره كثير من المنطقيين : أن عدول إبراهيم عن المقام الأول إلى المقام الثاني انتقال من دليل إلى أوضح منه ، ومنهم من قد يطلق عبارة ردية . وليس كما قالوه بل المقام الأول يكون كالمقدمة للثاني ويبين بطلان ما ادعاه نمروذ في الأول والثاني ، ولله الحمد والمنة .\nوقد ذكر السدي أن هذه المناظرة كانت بين إبراهيم ونمروذ بعد خروج إبراهيم من النار ولم يكن اجتمع بالملك إلا في ذلك اليوم فجرت بينهما هذه المناظرة .\nوروى عبد الرزاق عن معمر عن زيد بن أسلم : أن النمروذ كان عنده طعام وكان الناس يغدون إليه للميرة فوفد إبراهيم في جملة من وفد للميرة فكان بينهما هذه المناظرة ولم يعط إبراهيم من الطعام كما أعطى الناس بل خرج وليس معه شيء من الطعام ، فلما قرب من أهله عمد إلى كثيب من التراب فملأ منه عدليه وقال : أشغل أهلي عني إذا قدمت عليهم ، فلما قدم وضع رحاله وجاء فاتكأ فنام . فقامت امرأته سارة إلى العدلين فوجدتهما ملآنين طعاما طيبا فعملت منه طعاما . فلما استيقظ إبراهيم وجد الذي قد أصلحوه فقال : أنى لكم هذا ؟ قالت : من الذي جئت به . فعرف أنه رزق رزقهموه الله عز وجل . قال زيد بن أسلم : وبعث الله إلى ذلك الملك الجبار ملكا يأمره بالإيمان بالله فأبى عليه ثم دعاه الثانية فأبى ثم الثالثة فأبى وقال : اجمع جموعك وأجمع جموعي . فجمع النمروذ جيشه وجنوده وقت طلوع الشمس ، وأرسل الله عليهم بابا من البعوض بحيث لم يروا عين الشمس وسلطها الله عليهم فأكلت لحومهم ودماءهم وتركتهم عظاما بادية ، ودخلت واحدة منها في منخري الملك فمكثت في منخريه أربعمائة سنة ، عذبه الله بها فكان يضرب رأسه بالمرازب في هذه المدة كلها حتى أهلكه الله بها .\n                                    ",
        "qortoby": "أَلَمۡ تَرَ إِلَى ٱلَّذِي حَآجَّ إِبۡرَٰهِ‍ۧمَ فِي رَبِّهِۦٓ أَنۡ ءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ إِذۡ قَالَ إِبۡرَٰهِ‍ۧمُ رَبِّيَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُ قَالَ أَنَا۠ أُحۡيِۦ وَأُمِيتُۖ قَالَ إِبۡرَٰهِ‍ۧمُ فَإِنَّ ٱللَّهَ يَأۡتِي بِٱلشَّمۡسِ مِنَ ٱلۡمَشۡرِقِ فَأۡتِ بِهَا مِنَ ٱلۡمَغۡرِبِ فَبُهِتَ ٱلَّذِي كَفَرَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٨٥٢\n                                        \n                                        \n                                        ألم تر إلى الذي حاج إبراهيم في ربه أن آتاه الله الملك إذ قال إبراهيم ربي الذي يحيي ويميت قال أنا أحيي وأميت قال إبراهيم فإن الله يأتي بالشمس من المشرق فأت بها من المغرب فبهت الذي كفر والله لا يهدي القوم الظالمين فيه مسألتان : الأولى : قوله تعالى : ( ألم تر ) هذه ألف التوقيف ، وفي الكلام معنى التعجب ، أي اعجبوا له . وقال الفراء : ألم تر بمعنى هل رأيت ، أي هل رأيت الذي حاج إبراهيم ، وهل رأيت الذي مر على قرية ، وهو النمروذ بن كوش بن كنعان بن سام بن نوح ملك زمانه وصاحب النار والبعوضة هذا قول ابن عباس ومجاهد وقتادة والربيع والسدي وابن إسحاق وزيد بن أسلم وغيرهم . وكان إهلاكه لما قصد المحاربة مع الله تعالى بأن فتح الله تعالى عليه بابا من البعوض فستروا عين الشمس وأكلوا عسكره ولم يتركوا إلا العظام ، ودخلت واحدة منها في دماغه فأكلته حتى صارت مثل الفأرة ، فكان أعز الناس عنده بعد ذلك من يضرب دماغه بمطرقة عتيدة لذلك ، فبقي في البلاء أربعين يوما . قال ابن جريج : هو أول ملك في الأرض . قال ابن عطية : وهذا مردود . وقال قتادة : هو أول من تجبر وهو صاحب الصرح ببابل . وقيل : إنه ملك الدنيا بأجمعها ، وهو أحد الكافرين ، والآخر بختنصر . وقيل : إن الذي حاج إبراهيم نمروذ بن فالخ بن عابر بن شالخ بن أرفخشد بن سام ، حكى جميعه ابن عطية . وحكى السهيلي أنه النمروذ بن كوش بن كنعان بن حام بن نوح وكان ملكا على السواد وكان ملكه الضحاك الذي يعرف بالازدهاق واسمه بيوراسب بن أندراست وكان ملك الأقاليم كلها ، وهو الذي قتله أفريدون بن أثفيان ، وفيه يقول حبيب بن ( أوس ، أبو تمام ) :\nوكأنه الضحاك من فتكاته في العالمين وأنت أفريدون\nوكان الضحاك طاغيا جبارا ودام ملكه ألف عام فيما ذكروا . وهو أول من صلب وأول من قطع الأيدي والأرجل ، وللنمروذ ابن لصلبه يسمى ( كوشا ) أو نحو هذا الاسم ، وله ابن يسمى نمروذ الأصغر . وكان ملك نمروذ الأصغر عاما واحدا ، وكان ملك نمروذ الأكبر أربعمائة عام فيما ذكروا . وفي قصص هذه المحاجة روايتان : إحداهما أنهم خرجوا إلى عيد لهم فدخل إبراهيم على أصنامهم فكسرها ، فلما رجعوا قال لهم : أتعبدون ما تنحتون ؟ فقالوا : فمن تعبد ؟ قال : أعبد ربي الذي يحيي ويميت . وقال بعضهم : إن نمروذ كان يحتكر الطعام فكانوا إذا احتاجوا إلى الطعام يشترونه منه ، فإذا دخلوا عليه سجدوا له ، فدخل إبراهيم فلم يسجد له ، فقال : ما لك لا تسجد لي! قال : أنا لا أسجد إلا لربي . فقال له نمروذ : من ربك ؟ قال إبراهيم : ربي الذي يحيي ويميت . وذكر زيد بن أسلم أن النمروذ هذا قعد يأمر الناس بالميرة ، فكلما جاء قوم يقول : من ربكم وإلهكم ؟ فيقولون أنت ، فيقول : ميروهم . وجاء إبراهيم عليه السلام يمتار فقال له : من ربك وإلهك ؟ قال إبراهيم : ربي الذي يحيي ويميت ، فلما سمعها نمروذ قال : أنا أحيي وأميت ، فعارضه إبراهيم بأمر الشمس فبهت الذي كفر ، وقال لا تميروه ، فرجع إبراهيم إلى أهله دون شيء فمر على كثيب رمل كالدقيق فقال في نفسه : لو ملأت غرارتي من هذا فإذا دخلت به فرح الصبيان حتى أنظر لهم ، فذهب بذلك فلما بلغ منزله فرح الصبيان وجعلوا يلعبون فوق الغرارتين ونام هو من الإعياء ، فقالت امرأته : لو صنعت له طعاما يجده حاضرا إذا انتبه ، ففتحت إحدى الغرارتين فوجدت أحسن ما يكون من الحوارى فخبزته ، فلما قام وضعته بين يديه فقال : من أين هذا ؟ فقالت : من الدقيق الذي سقت . فعلم إبراهيم أن الله تعالى يسر لهم ذلك .\nقلت : وذكر أبو بكر بن أبي شيبة عن أبي صالح قال : انطلق إبراهيم النبي عليه السلام يمتار فلم يقدر على الطعام ، فمر بسهلة حمراء فأخذ منها ثم رجع إلى أهله فقالوا : ما هذا ؟ فقال : حنطة حمراء ، ففتحوها فوجدوها حنطة حمراء ، قال : وكان إذا زرع منها شيئا جاء سنبله من أصلها إلى فرعها حبا متراكبا . وقال الربيع وغيره في هذا القصص : إن النمروذ لما قال أنا أحيي وأميت أحضر رجلين فقتل أحدهما وأرسل الآخر فقال : قد أحييت هذا وأمت هذا ، فلما رد عليه بأمر الشمس بهت . وروي في الخبر : أن الله تعالى قال وعزتي وجلالي لا تقوم الساعة حتى آتي بالشمس من المغرب ليعلم أني أنا القادر على ذلك . ثم أمر نمروذ بإبراهيم فألقي في النار ، وهكذا عادة الجبابرة فإنهم إذا عورضوا بشيء وعجزوا عن الحجة اشتغلوا بالعقوبة ، فأنجاه الله من النار ، على ما يأتي . وقال السدي : إنه لما خرج إبراهيم من النار أدخلوه على الملك - ولم يكن قبل ذلك دخل عليه - فكلمه وقال له : من ربك ؟ فقال : ربي الذي يحيي ويميت . قال النمروذ : أنا أحيي وأميت ، وأنا آخذ أربعة نفر فأدخلهم بيتا ولا يطعمون شيئا ولا يسقون حتى إذا جاعوا أخرجتهم فأطعمت اثنين فحييا وتركت اثنين فماتا . فعارضه إبراهيم بالشمس فبهت . وذكر الأصوليون في هذه الآية أن إبراهيم عليه السلام لما وصف ربه تعالى بما هو صفة له من الإحياء والإماتة لكنه أمر له حقيقة ومجاز ، قصد إبراهيم عليه السلام إلى الحقيقة ، وفزع نمروذ إلى المجاز وموه على قومه ، فسلم له إبراهيم تسليم الجدل وانتقل معه من المثال وجاءه بأمر لا مجاز فيه ( فبهت الذي كفر ) أي انقطعت حجته ولم يمكنه أن يقول أنا الآتي بها من المشرق ؛ لأن ذوي الألباب يكذبونه .\nالثانية : هذه الآية تدل على جواز تسمية الكافر ملكا إذا آتاه الله الملك والعز والرفعة في الدنيا ، وتدل على إثبات المناظرة والمجادلة وإقامة الحجة . وفي القرآن والسنة من هذا كثير لمن تأمله ، قال الله تعالى : قل هاتوا برهانكم إن كنتم صادقين . إن عندكم من سلطان ؛ أي من حجة . وقد وصف خصومة إبراهيم عليه السلام قومه ورده عليهم في عبادة الأوثان كما في سورة ( الأنبياء ) وغيرها . وقال في قصة نوح عليه السلام : قالوا يا نوح قد جادلتنا فأكثرت جدالنا الآيات إلى قوله : وأنا بريء مما تجرمون . وكذلك مجادلة موسى مع فرعون إلى غير ذلك من الآي . فهو كله تعليم من الله عز وجل السؤال والجواب والمجادلة في الدين ؛ لأنه لا يظهر الفرق بين الحق والباطل إلا بظهور حجة الحق ودحض حجة الباطل . وجادل رسول الله صلى الله عليه وسلم أهل الكتاب وباهلهم بعد الحجة ، على ما يأتي بيانه في ( آل عمران ) . وتحاج آدم وموسى فغلبه آدم بالحجة . وتجادل أصحاب رسول الله صلى الله عليه وسلم يوم السقيفة وتدافعوا وتقرروا وتناظروا حتى صدر الحق في أهله ، وتناظروا بعد مبايعة أبي بكر في أهل الردة ، إلى غير ذلك مما يكثر إيراده . وفي قول الله عز وجل : فلم تحاجون فيما ليس لكم به علم ؛ دليل على أن الاحتجاج بالعلم مباح شائع لمن تدبر . قال المزني صاحب الشافعي : ومن حق المناظرة أن يراد بها الله عز وجل وأن يقبل منها ما تبين . وقالوا : لا تصح المناظرة ويظهر الحق بين المتناظرين حتى يكونوا متقاربين أو مستويين في مرتبة واحدة من الدين والعقل والفهم والإنصاف ، وإلا فهو مراء ومكابرة .\nقراءات - قرأ علي بن أبي طالب \" ألم تر \" بجزم الراء ، والجمهور بتحريكها ، وحذفت الياء للجزم . أن آتاه الله الملك في موضع نصب ، أي لأن آتاه الله ، أو من أجل أن آتاه الله . وقرأ جمهور القراء \" أن أحيي \" بطرح الألف التي بعد النون من \" أنا \" في الوصل ، وأثبتها نافع وابن أبي أويس ، إذا لقيتها همزة في كل القرآن إلا في قوله تعالى : إن أنا إلا نذير فإنه يطرحها في هذا الموضع مثل سائر القراء لقلة ذلك ، فإنه لم يقع منه في القرآن إلا ثلاثة مواضع أجراها مجرى ما ليس بعده همزة لقلته فحذف الألف في الوصل . قال النحويون : ضمير المتكلم الاسم فيه الهمزة والنون ، فإذا قلت : أنا أو أنه فالألف والهاء لبيان الحركة في الوقف ، فإذا اتصلت الكلمة بشيء سقطتا ؛ لأن الشيء الذي تتصل به الكلمة يقوم مقام الألف ، فلا يقال : أنا فعلت بإثبات الألف إلا شاذا في الشعر كما قال الشاعر :\nأنا سيف العشيرة فاعرفوني حميدا قد تذريت السناما\nقال النحاس : على أن نافعا قد أثبت الألف فقرأ \" أنا أحيي وأميت \" ولا وجه له . قال مكي : والألف زائدة عند البصريين ، والاسم المضمر عندهم الهمزة والنون وزيدت الألف للتقوية . وقيل : زيدت للوقف لتظهر حركة النون . والاسم عند الكوفيين \" أنا \" بكماله ، فنافع في إثبات الألف على قولهم على الأصل ، وإنما حذف الألف من حذفها تخفيفا ؛ ولأن الفتحة تدل عليها . قال الجوهري : وأما قولهم \" أنا \" فهو اسم مكني وهو للمتكلم وحده ، وإنما بني على الفتح فرقا بينه وبين \" أن \" التي هي حرف ناصب للفعل ، والألف الأخيرة إنما هي لبيان الحركة في الوقف ، فإن توسطت الكلام سقطت إلا في لغة رديئة ، كما قال :\nأنا سيف العشيرة فاعرفوني حميدا قد تذريت السناما\nوبهت الرجل وبهت وبهت إذا انقطع وسكت متحيرا ، عن النحاس وغيره . وقال الطبري : وحكي عن بعض العرب في هذا المعنى \" بهت \" بفتح الباء والهاء . قال ابن جني قرأ أبو حيوة : \" فبهت الذي كفر \" بفتح الباء وضم الهاء ، وهي لغة في \" بهت \" بكسر الهاء . قال : وقرأ ابن السميقع \" فبهت \" بفتح الباء والهاء على معنى فبهت إبراهيم الذي كفر ، فالذي في موضع نصب . قال : وقد يجوز أن يكون بهت بفتحها لغة في بهت . قال : وحكى أبو الحسن الأخفش قراءة \" فبهت \" بكسر الهاء كغرق ودهش . قال : والأكثرون بالضم في الهاء . قال ابن عطية : وقد تأول قوم في قراءة من قرأ \" فبهت \" بفتحها أنه بمعنى سب وقذف ، وأن نمروذ هو الذي سب حين انقطع ولم تكن له حيلة .\n                                    ",
        "saadi": "أَلَمۡ تَرَ إِلَى ٱلَّذِي حَآجَّ إِبۡرَٰهِ‍ۧمَ فِي رَبِّهِۦٓ أَنۡ ءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ إِذۡ قَالَ إِبۡرَٰهِ‍ۧمُ رَبِّيَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُ قَالَ أَنَا۠ أُحۡيِۦ وَأُمِيتُۖ قَالَ إِبۡرَٰهِ‍ۧمُ فَإِنَّ ٱللَّهَ يَأۡتِي بِٱلشَّمۡسِ مِنَ ٱلۡمَشۡرِقِ فَأۡتِ بِهَا مِنَ ٱلۡمَغۡرِبِ فَبُهِتَ ٱلَّذِي كَفَرَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٨٥٢\n                                        \n                                        \n                                        \n                                        يقول تعالى: { ألم تر إلى الذي حاج إبراهيم في ربه } أي: إلى جرائته وتجاهله وعناده ومحاجته فيما لا يقبل التشكيك، وما حمله على ذلك إلا { أن آتاه الله الملك } فطغى وبغى ورأى نفسه مترئسا على رعيته، فحمله ذلك على أن حاج إبراهيم في ربوبية الله فزعم أنه يفعل كما يفعل الله، فقال إبراهيم { ربي الذي يحيي ويميت } أي: هو المنفرد بأنواع التصرف، وخص منه الإحياء والإماتة لكونهما أعظم أنواع التدابير، ولأن الإحياء مبدأ الحياة الدنيا والإماتة مبدأ ما يكون في الآخرة، فقال ذلك المحاج: { أنا أحيي وأميت } ولم يقل أنا الذي أحيي وأميت، لأنه لم يدع الاستقلال بالتصرف، وإنما زعم أنه يفعل كفعل الله ويصنع صنعه، فزعم أنه يقتل شخصا فيكون قد أماته، ويستبقي شخصا فيكون قد أحياه، فلما رآه إبراهيم يغالط في مجادلته ويتكلم بشيء لا يصلح أن يكون شبهة فضلا عن كونه حجة، اطرد معه في الدليل فقال إبراهيم: { فإن الله يأتي بالشمس من المشرق } أي: عيانا يقر به كل أحد حتى ذلك الكافر { فأت بها من المغرب } وهذا إلزام له بطرد دليله إن كان صادقا في دعواه، فلما قال له أمرا لا قوة له في شبهة تشوش دليله، ولا قادحا يقدح في سبيله { بهت الذي كفر } أي: تحير فلم يرجع إليه جوابا وانقطعت حجته وسقطت شبهته، وهذه حالة المبطل المعاند الذي يريد أن يقاوم الحق ويغالبه، فإنه مغلوب مقهور، فلذلك قال تعالى: { والله لا يهدي القوم الظالمين } بل يبقيهم على كفرهم وضلالهم، وهم الذين اختاروا لأنفسهم ذلك، وإلا فلو كان قصدهم الحق والهداية لهداهم إليه ويسر لهم أسباب الوصول إليه، ففي هذه الآية برهان قاطع على تفرد الرب بالخلق والتدبير، ويلزم من ذلك أن يفرد بالعبادة والإنابة والتوكل عليه في جميع الأحوال، قال ابن القيم رحمه الله: وفي هذه المناظرة نكتة لطيفة جدا، وهي أن شرك العالم إنما هو مستند إلى عبادة الكواكب والقبور، ثم صورت الأصنام على صورها، فتضمن الدليلان اللذان استدل بهما إبراهيم إبطال إلهية تلك جملة بأن الله وحده هو الذي يحيي ويميت، ولا يصلح الحي الذي يموت للإلهية لا في حال حياته ولا بعد موته، فإن له ربا قادرا قاهرا متصرفا فيه إحياء وإماتة، ومن كان كذلك فكيف يكون إلها حتى يتخذ الصنم على صورته، ويعبد من دونه، وكذلك الكواكب أظهرها وأكبرها للحس هذه الشمس وهي مربوبة مدبرة مسخرة، لا تصرف لها بنفسها بوجه ما، بل ربها وخالقها سبحانه يأتي بها من مشرقها فتنقاد لأمره ومشيئته، فهي مربوبة مسخرة مدبرة، لا إله يعبد من دون الله. \" من مفتاح دار السعادة\n\n                                    "
      },
      "originalText": "أَلَمۡ تَرَ إِلَى ٱلَّذِي حَآجَّ إِبۡرَٰهِ‍ۧمَ فِي رَبِّهِۦٓ أَنۡ ءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ إِذۡ قَالَ إِبۡرَٰهِ‍ۧمُ رَبِّيَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُ قَالَ أَنَا۠ أُحۡيِۦ وَأُمِيتُۖ قَالَ إِبۡرَٰهِ‍ۧمُ فَإِنَّ ٱللَّهَ يَأۡتِي بِٱلشَّمۡسِ مِنَ ٱلۡمَشۡرِقِ فَأۡتِ بِهَا مِنَ ٱلۡمَغۡرِبِ فَبُهِتَ ٱلَّذِي كَفَرَۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ ٨٥٢"
    },
    {
      "number": 266,
      "text": "أَوْ كَالَّذِي مَرَّ عَلَىٰ قَرْيَةٍ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحْيِي هَٰذِهِ اللَّهُ بَعْدَ مَوْتِهَا ۖ فَأَمَاتَهُ اللَّهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهُ ۖ قَالَ كَمْ لَبِثْتَ ۖ قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍ ۖ قَالَ بَلْ لَبِثْتَ مِائَةَ عَامٍ فَانْظُرْ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ ۖ وَانْظُرْ إِلَىٰ حِمَارِكَ وَلِنَجْعَلَكَ آيَةً لِلنَّاسِ ۖ وَانْظُرْ إِلَى الْعِظَامِ كَيْفَ نُنْشِزُهَا ثُمَّ نَكْسُوهَا لَحْمًا ۚ فَلَمَّا تَبَيَّنَ لَهُ قَالَ أَعْلَمُ أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 259,
      "juz": 3,
      "manzil": 1,
      "page": 43,
      "ruku": 36,
      "hizbQuarter": 17,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوۡ كَٱلَّذِي مَرَّ عَلَىٰ قَرۡيَةٖ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحۡيِۦ هَٰذِهِ ٱللَّهُ بَعۡدَ مَوۡتِهَاۖ فَأَمَاتَهُ ٱللَّهُ مِاْئَةَ عَامٖ ثُمَّ بَعَثَهُۥۖ قَالَ كَمۡ لَبِثۡتَۖ قَالَ لَبِثۡتُ يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۖ قَالَ بَل لَّبِثۡتَ مِاْئَةَ عَامٖ فَٱنظُرۡ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡۖ وَٱنظُرۡ إِلَىٰ حِمَارِكَ وَلِنَجۡعَلَكَ ءَايَةٗ لِّلنَّاسِۖ وَٱنظُرۡ إِلَى ٱلۡعِظَامِ كَيۡفَ نُنشِزُهَا ثُمَّ نَكۡسُوهَا لَحۡمٗاۚ فَلَمَّا تَبَيَّنَ لَهُۥ قَالَ أَعۡلَمُ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩٥٢\n                                        \n                                        \n                                        تقدم قوله تعالى : ( ألم تر إلى الذي حاج إبراهيم في ربه [ أن آتاه الله الملك ] ) وهو في قوة قوله : هل رأيت مثل الذي حاج إبراهيم في ربه ؟ ولهذا عطف عليه بقوله : ( أو كالذي مر على قرية وهي خاوية على عروشها ) اختلفوا في هذا المار من هو ؟ فروى ابن أبي حاتم عن عصام بن رواد عن آدم بن أبي إياس عن إسرائيل عن أبي إسحاق عن ناجية بن كعب عن علي بن أبي طالب أنه قال : هو عزير .\nورواه ابن جرير عن ناجية نفسه . وحكاه ابن جرير وابن أبي حاتم عن ابن عباس والحسن وقتادة والسدي وسليمان بن بريدة وهذا القول هو المشهور .\nوقال وهب بن منبه وعبد الله بن عبيد بن عمير : هو أرميا بن حلقيا . قال محمد بن إسحاق ; عمن لا يتهم عن وهب بن منبه أنه قال : وهو اسم الخضر عليه السلام .\nوقال ابن أبي حاتم : حدثنا أبي قال : سمعت سليمان بن محمد اليساري الجاري من أهل الجار ، ابن عم مطر فقال : سمعت رجلا من أهل الشام يقول : إن الذي أماته الله مائة عام ثم بعثه اسمه : حزقيل بن بورا .\nوقال مجاهد بن جبر : هو رجل من بني إسرائيل .\n[ وذكر غير واحد أنه مات وهو ابن أربعين سنة ; فبعثه الله وهو كذلك ، وكان له ابن فبلغ من السن مائة وعشرين سنة ، وبلغ ابن ابنه تسعين وكان الجد شابا وابنه وابن ابنه شيخان كبيران قد بلغا الهرم ، وأنشدني به بعض الشعراء :\nواسود رأس شاب من قبل ابنه ومن قبله ابن ابنه فهو أكبر يرى أنه شيخا يدب على عصا\nولحيته سوداء والرأس أشعر وما لابنه حبل ولا فضل قوة\nيقوم كما يمشي الصغير فيعثر وعمر ابنه أربعون أمرها\nولابن ابنه في الناس تسعين غبر\n]\nوأما القرية : فالمشهور أنها بيت المقدس مر عليها بعد تخريب بختنصر لها وقتل أهلها . ( وهي خاوية ) أي : ليس فيها أحد من قولهم : خوت الدار تخوي خواء وخويا .\nوقوله : ( على عروشها ) أي : ساقطة سقوفها وجدرانها على عرصاتها ، فوقف متفكرا فيما آل أمرها إليه بعد العمارة العظيمة وقال : ( أنى يحيي هذه الله بعد موتها ) وذلك لما رأى من دثورها وشدة خرابها وبعدها عن العود إلى ما كانت عليه . قال الله تعالى : ( فأماته الله مائة عام ثم بعثه ) قال : وعمرت البلدة بعد مضي سبعين سنة من موته وتكامل ساكنوها وتراجعت بنو إسرائيل إليها . فلما بعثه الله عز وجل بعد موته كان أول شيء أحيا الله فيه عينيه لينظر بهما إلى صنع الله فيه كيف يحيي بدنه ؟ فلما استقل سويا قال الله له أي بواسطة الملك : ( كم لبثت قال لبثت يوما أو بعض يوم ) قالوا : وذلك أنه مات أول النهار ثم بعثه الله في آخر نهار ، فلما رأى الشمس باقية ظن أنها شمس ذلك اليوم فقال : ( أو بعض يوم قال بل لبثت مائة عام فانظر إلى طعامك وشرابك لم يتسنه ) وذلك : أنه كان معه فيما ذكر عنب وتين وعصير فوجده كما فقده لم يتغير منه شيء ، لا العصير استحال ولا التين حمض ولا أنتن ولا العنب تعفن ( وانظر إلى حمارك ) أي : كيف يحييه الله عز وجل وأنت تنظر ( ولنجعلك آية للناس ) أي : دليلا على المعاد ( وانظر إلى العظام كيف ننشزها ) أي : نرفعها فتركب بعضها على بعض .\nوقد روى الحاكم في مستدركه من حديث نافع بن أبي نعيم عن إسماعيل بن أبي حكيم عن خارجة بن زيد بن ثابت عن أبيه : أن رسول الله صلى الله عليه وسلم قرأ : ( كيف ننشزها ) بالزاي ثم قال : صحيح الإسناد ولم يخرجاه .\nوقرئ : ( ننشرها ) أي : نحييها قاله مجاهد ( ثم نكسوها لحما ) .\nوقال السدي وغيره : تفرقت عظام حماره حوله يمينا ويسارا فنظر إليها وهي تلوح من بياضها فبعث الله ريحا فجمعتها من كل موضع من تلك المحلة ، ثم ركب كل عظم في موضعه حتى صار حمارا قائما من عظام لا لحم عليها ثم كساها الله لحما وعصبا وعروقا وجلدا ، وبعث الله ملكا فنفخ في منخري الحمار فنهق ، كله بإذن الله عز وجل وذلك كله بمرأى من العزير ، فعند ذلك لما تبين له هذا كله ( قال أعلم أن الله على كل شيء قدير ) أي : أنا عالم بهذا وقد رأيته عيانا فأنا أعلم أهل زماني بذلك ، وقرأ آخرون : \" قال اعلم \" على أنه أمر له بالعلم .\n                                    ",
        "qortoby": "أَوۡ كَٱلَّذِي مَرَّ عَلَىٰ قَرۡيَةٖ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحۡيِۦ هَٰذِهِ ٱللَّهُ بَعۡدَ مَوۡتِهَاۖ فَأَمَاتَهُ ٱللَّهُ مِاْئَةَ عَامٖ ثُمَّ بَعَثَهُۥۖ قَالَ كَمۡ لَبِثۡتَۖ قَالَ لَبِثۡتُ يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۖ قَالَ بَل لَّبِثۡتَ مِاْئَةَ عَامٖ فَٱنظُرۡ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡۖ وَٱنظُرۡ إِلَىٰ حِمَارِكَ وَلِنَجۡعَلَكَ ءَايَةٗ لِّلنَّاسِۖ وَٱنظُرۡ إِلَى ٱلۡعِظَامِ كَيۡفَ نُنشِزُهَا ثُمَّ نَكۡسُوهَا لَحۡمٗاۚ فَلَمَّا تَبَيَّنَ لَهُۥ قَالَ أَعۡلَمُ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩٥٢\n                                        \n                                        \n                                        أو كالذي مر على قرية وهي خاوية على عروشها قال أنى يحيي هذه الله بعد موتها فأماته الله مائة عام ثم بعثه قال كم لبثت قال لبثت يوما أو بعض يوم قال بل لبثت مائة عام فانظر إلى طعامك وشرابك لم يتسنه وانظر إلى حمارك ولنجعلك آية للناس وانظر إلى العظام كيف ننشزها ثم نكسوها لحما فلما تبين له قال أعلم أن الله على كل شيء قدير\nقوله تعالى : أو كالذي مر على قرية وهي خاوية على عروشها \" أو \" للعطف حملا على المعنى والتقدير عند الكسائي والفراء : هل رأيت كالذي حاج إبراهيم في ربه ، أو كالذي مر على قرية . وقال المبرد : المعنى ألم تر إلى الذي حاج إبراهيم في ربه ، ألم تر من مر! كالذي مر على قرية . فأضمر في الكلام من هو . وقرأ أبو سفيان بن حسين \" أو كالذي مر \" بفتح الواو ، وهي واو العطف دخل عليها ألف الاستفهام الذي معناه التقرير . وسميت القرية قرية لاجتماع الناس فيها ، من قولهم : قريت الماء أي جمعته ، وقد تقدم . قال سليمان بن بريدة وناجية بن كعب وقتادة وابن عباس والربيع وعكرمة والضحاك : الذي مر على القرية هو عزير . وقال وهب بن منبه وعبد الله بن عبيد بن عمير وعبد الله بن بكر بن مضر : هو إرمياء وكان نبيا . وقال ابن إسحاق : إرمياء هو الخضر ، وحكاه النقاش عن وهب بن منبه . قال ابن عطية : وهذا كما تراه ، إلا أن يكون اسما وافق اسما ؛ لأن الخضر معاصر لموسى ، وهذا الذي مر على القرية هو بعده بزمان من سبط هارون فيما رواه وهب بن منبه .\nقلت : إن كان الخضر هو إرمياء فلا يبعد أن يكون هو ؛ لأن الخضر لم يزل حيا من وقت موسى حتى الآن على الصحيح في ذلك ، على ما يأتي بيانه في سورة \" الكهف \" . وإن كان مات قبل هذه القصة فقول ابن عطية صحيح ، والله أعلم . وحكى النحاس ومكي عن مجاهد أنه رجل من بني إسرائيل غير مسمى . قال النقاش : ويقال هو غلام لوط عليه السلام . وحكى السهيلي عن القتبي هو شعيا في أحد قوليه . والذي أحياها بعد خرابها كوشك الفارسي . والقرية المذكورة هي بيت المقدس في قول وهب بن منبه وقتادة والربيع بن أنس وغيرهم . قال : وكان مقبلا من مصر وطعامه وشرابه المذكوران تين أخضر وعنب وركوة من خمر . وقيل من عصير . وقيل : قلة ماء هي شرابه . والذي أخلى بيت المقدس حينئذ بختنصر وكان واليا على العراق للهراسب ثم ليستاسب بن لهراسب والد اسبندياد . وحكى النقاش أن قوما قالوا : هي المؤتفكة . وقال ابن عباس في رواية أبي صالح : إن بختنصر غزا بني إسرائيل فسبى منهم أناسا كثيرة فجاء بهم وفيهم عزير بن شرخيا وكان من علماء بني إسرائيل فجاء بهم إلى بابل ، فخرج ذات يوم في حاجة له إلى دير هزقل على شاطئ الدجلة . فنزل تحت ظل شجرة وهو على حمار له ، فربط الحمار تحت ظل الشجرة ثم طاف بالقرية فلم ير بها ساكنا وهي خاوية على عروشها فقال : أنى يحيي هذه الله بعد موتها وقيل : إنها القرية التي خرج منها الألوف حذر الموت ، قاله ابن زيد . وعن ابن زيد أيضا أن القوم الذين خرجوا من ديارهم وهم ألوف حذر الموت فقال لهم الله موتوا ، مر رجل عليهم وهم عظام نخرة تلوح فوقف ينظر فقال : أنى يحيي هذه الله بعد موتها فأماته الله مائة عام . قال : ابن عطية : وهذا القول من ابن زيد مناقض لألفاظ الآية ، إذ الآية إنما تضمنت قرية خاوية لا أنيس فيها ، والإشارة ب \" هذه \" إنما هي إلى القرية . وإحياؤها إنما هو بالعمارة ووجود البناء والسكان . وقال وهب بن منبه وقتادة والضحاك والربيع وعكرمة : القرية بيت المقدس لما خربها بختنصر البابلي . وفي الحديث الطويل حين أحدثت بنو إسرائيل الأحداث وقف إرمياء أو عزير على القرية وهي كالتل العظيم وسط بيت المقدس ؛ لأن بختنصر أمر جنده بنقل التراب إليه حتى جعله كالجبل ، ورأى إرمياء البيوت قد سقطت حيطانها على سقفها فقال : أنى يحيي هذه الله بعد موتها .\nوالعريش : سقف البيت . وكل ما يتهيأ ليظل أو يكن فهو عريش ، ومنه عريش الدالية ، ومنه قوله تعالى : ومما يعرشون . قال السدي : يقول هي ساقطة على سقفها ، أي سقطت السقف ثم سقطت الحيطان عليها ، واختاره الطبري . وقال غير السدي : معناه خاوية من الناس والبيوت قائمة ، وخاوية معناها خالية ، وأصل الخواء الخلو ، يقال : خوت الدار وخويت تخوى خواء ( ممدود ) وخويا : أقوت ، وكذلك إذا سقطت ، ومنه قوله تعالى : فتلك بيوتهم خاوية بما ظلموا ؛ أي خالية ، ويقال ساقطة ، كما يقال : فهي خاوية على عروشها أي ساقطة على سقفها . والخواء الجوع لخلو البطن من الغذاء . وخوت المرأة وخويت أيضا خوى أي خلا جوفها عند الولادة . وخويت لها تخوية إذا عملت لها خوية تأكلها وهي طعام . والخوي البطن السهل من الأرض على فعيل . وخوى البعير إذا جافى بطنه عن الأرض في بروكه ، وكذلك الرجل في سجوده .\nقوله تعالى : قال أنى يحيي هذه الله بعد موتها معناه من أي طريق وبأي سبب ، وظاهر اللفظ السؤال عن إحياء القرية بعمارة وسكان ، كما يقال الآن في المدن الخربة التي يبعد أن تعمر وتسكن : أنى تعمر هذه بعد خرابها . فكأن هذا تلهف من الواقف المعتبر على مدينته التي عهد فيها أهله وأحبته . وضرب له المثل في نفسه بما هو أعظم مما سأل عنه ، والمثال الذي ضرب له في نفسه يحتمل أن يكون على أن سؤاله إنما كان على إحياء الموتى من بني آدم ، أي أنى يحيي الله موتاها . وقد حكى الطبري عن بعضهم أنه قال : كان هذا القول شكا في قدرة الله تعالى على الإحياء ، فلذلك ضرب له المثل في نفسه . قال ابن عطية : وليس يدخل شك في قدرة الله تعالى على إحياء قرية بجلب العمارة إليها وإنما يتصور الشك من جاهل في الوجه الآخر ، والصواب ألا يتأول في الآية شك .\nقوله تعالى : فأماته الله مائة عام \" مائة \" نصب على الظرف . والعام : السنة ، يقال : سنون عوم وهو تأكيد للأول ، كما يقال : بينهم شغل شاغل . وقال العجاج :\nمن مر أعوام السنين العوم\nوهو في التقدير جمع عائم ، إلا أنه لا يفرد بالذكر ؛ لأنه ليس باسم وإنما هو توكيد ، قاله الجوهري . وقال النقاش : العام مصدر كالعوم ، سمي به هذا القدر من الزمان لأنها عومة من الشمس في الفلك . والعوم كالسبح ، وقال الله تعالى : كل في فلك يسبحون . قال ابن عطية : هذا بمعنى قول النقاش ، والعام على هذا كالقول والقال ، وظاهر هذه الإماتة أنها بإخراج الروح من الجسد . وروي في قصص هذه الآية أن الله تعالى بعث لها ملكا من الملوك يعمرها ويجد في ذلك حتى كان كمال عمارتها عند بعث القائل . وقد قيل : إنه لما مضى لموته سبعون سنة أرسل الله ملكا من ملوك فارس عظيما يقال له \" كوشك \" فعمرها في ثلاثين سنة .\nقوله تعالى : ثم بعثه معناه أحياه ، وقد تقدم الكلام فيه .\nقوله تعالى : قال كم لبثت اختلف في القائل له كم لبثت ، فقيل . الله جل وعز ، ولم يقل له إن كنت صادقا كما قال للملائكة على ما تقدم . وقيل : سمع هاتفا من السماء يقول له ذلك . وقيل : خاطبه جبريل . وقيل : نبي . وقيل : رجل مؤمن ممن شاهده من قومه عند موته وعمر إلى حين إحيائه فقال له : كم لبثت .\nقلت : والأظهر أن القائل هو الله تعالى ، لقوله : وانظر إلى العظام كيف ننشزها ثم نكسوها لحما والله أعلم . وقرأ أهل الكوفة \" كم لبت \" بإدغام الثاء في التاء لقربها منها في المخرج . فإن مخرجهما من طرف اللسان وأصول الثنايا وفي أنهما مهموستان . قال النحاس : والإظهار أحسن لتباين مخرج الثاء من مخرج التاء . ويقال : كان هذا السؤال بواسطة الملك على جهة التقرير . و \" كم \" في موضع نصب على الظرف .\nقال لبثت يوما أو بعض يوم إنما قال هذا على ما عنده وفي ظنه ، وعلى هذا لا يكون كاذبا فيما أخبر به ، ومثله قول أصحاب الكهف قالوا لبثنا يوما أو بعض يوم ، وإنما لبثوا ثلاثمائة سنة وتسع سنين - على ما يأتي - ولم يكونوا كاذبين لأنهم أخبروا عما عندهم ، كأنهم قالوا : الذي عندنا وفي ظنوننا أننا لبثنا يوما أو بعض يوم . ونظيره قول النبي صلى الله عليه وسلم في قصة ذي اليدين : لم أقصر ولم أنس . ومن الناس من يقول : إنه كذب على معنى وجود حقيقة الكذب فيه ولكنه لا مؤاخذة به ، وإلا فالكذب الإخبار عن الشيء على خلاف ما هو عليه وذلك لا يختلف بالعلم والجهل ، وهذا بين في نظر الأصول . فعلى هذا يجوز أن يقال : إن الأنبياء لا يعصمون عن الإخبار عن الشيء على خلاف ما هو عليه إذا لم يكن عن قصد ، كما لا يعصمون عن السهو والنسيان . فهذا ما يتعلق بهذه الآية ، والقول الأول أصح . قال ابن جريج وقتادة والربيع : أماته الله غدوة يوم ثم بعث قبل الغروب فظن هذا اليوم واحدا فقال : لبثت يوما ، ثم رأى بقية من الشمس فخشي أن يكون كاذبا فقال : أو بعض يوم . فقيل : بل لبثت مائة عام ، ورأى من عمارة القرية وأشجارها ومبانيها ما دله على ذلك .\nقوله تعالى : فانظر إلى طعامك وهو التين الذي جمعه من أشجار القرية التي مر عليها . وشرابك لم يتسنه قرأ ابن مسعود \" وهذا طعامك وشرابك لم يتسنه \" . وقرأ طلحة بن مصرف وغيره \" وانظر لطعامك وشرابك لمائة سنة \" . وقرأ الجمهور بإثبات الهاء في الوصل إلا الأخوان فإنهما يحذفانها ، ولا خلاف أن الوقف عليها بالهاء . وقرأ طلحة بن مصرف أيضا \" لم يسن \" \" وانظر \" أدغم التاء في السين ، فعلى قراءة الجمهور الهاء أصلية ، وحذفت الضمة للجزم ، ويكون \" يتسنه \" من السنة أي لم تغيره السنون . قال الجوهري : ويقال سنون ، والسنة واحدة السنين ، وفي نقصانها قولان : أحدهما الواو ، والآخر الهاء . وأصلها سنهة مثل الجبهة ؛ لأنه من سنهت النخلة وتسنهت إذا أتت عليها السنون . ونخلة سناء أي تحمل سنة ولا تحمل أخرى ، وسنهاء أيضا ، قال بعض الأنصار :\nفليست بسنهاء ولا رجبية ولكن عرايا في السنين الجوائح\nوأسنهت عند بني فلان أقمت عندهم ، وتسنيت أيضا . واستأجرته مساناة ومسانهة أيضا . وفي التصغير سنية وسنيهة . قال النحاس : من قرأ \" لم يتسن \" و \" انظر \" قال في التصغير : سنية وحذفت الألف للجزم ، ويقف على الهاء فيقول : \" لم يتسنه \" تكون الهاء لبيان الحركة . قال المهدوي : ويجوز أن يكون أصله من سانيته مساناة ، أي عاملته سنة بعد سنة ، أو من سانهت بالهاء ، فإن كان من سانيت فأصله يتسنى فسقطت الألف للجزم ، وأصله من الواو بدليل قولهم \" سنوات \" والهاء فيه للسكت ، وإن كان من سانهت فالهاء لام الفعل ، وأصل سنة على هذا سنهة . وعلى القول الأول سنوة . وقيل : هو من أسن الماء إذا تغير ، وكان يجب أن يكون على هذا يتأسن . أبو عمرو الشيباني : هو من قوله حمإ مسنون فالمعنى لم يتغير . الزجاج ، ليس كذلك ؛ لأن قوله ( مسنون ) ليس معناه ( متغير ) وإنما معناه ( مصبوب ) على سنة الأرض . قال المهدوي : وأصله على قول الشيباني \" يتسنن \" فأبدلت إحدى النونين ياء كراهة التضعيف فصار يتسنى ، ثم سقطت الألف للجزم ودخلت الهاء للسكت . وقال مجاهد : لم يتسنه لم ينتن . قال النحاس : أصح ما قيل فيه إنه من السنة ، أي لم تغيره السنون . ويحتمل أن يكون من السنة وهي الجدب ، ومنه قوله تعالى : ولقد أخذنا آل فرعون بالسنين ، وقوله عليه السلام اللهم اجعلها عليهم سنين كسني يوسف . يقال منه : أسنت القوم أي أجدبوا ، فيكون المعنى لم يغير طعامك القحوط والجدوب ، أو لم تغيره السنون والأعوام ، أي هو باق على طراوته وغضارته .\nقوله تعالى : وانظر إلى حمارك قال وهب بن منبه وغيره : وانظر إلى اتصال عظامه وإحيائه جزءا جزءا . ويروى أنه أحياه الله كذلك حتى صار عظاما ملتئمة ، ثم كساه لحما حتى كمل حمارا ، ثم جاءه ملك فنفخ فيه الروح فقام الحمار ينهق ، على هذا أكثر المفسرين . وروي عن الضحاك ووهب بن منبه أيضا أنهما قالا : بل قيل له : وانظر إلى حمارك قائما في مربطه لم يصبه شيء مائة عام ، وإنما العظام التي نظر إليها عظام نفسه بعد أن أحيا الله منه عينيه ورأسه ، وسائر جسده ميت ، قالا : وأعمى الله العيون عن إرمياء وحماره طول هذه المدة .\nقوله تعالى : ولنجعلك آية للناس قال الفراء : إنما أدخل الواو في قوله ( ولنجعلك ) دلالة على أنها شرط لفعل بعده ، معناه ولنجعلك آية للناس ودلالة على البعث بعد الموت جعلنا ذلك . وإن شئت جعلت الواو مقحمة زائدة . وقال الأعمش : موضع كونه آية هو أنه جاء شابا على حاله يوم مات ، فوجد الأبناء والحفدة شيوخا . عكرمة : وكان يوم مات ابن أربعين سنة . وروي عن علي رضوان الله عليه أن عزيرا خرج من أهله وخلف امرأته حاملا ، وله خمسون سنة فأماته الله مائة عام ، ثم بعثه فرجع إلى أهله وهو ابن خمسين سنة وله ولد من مائة سنة فكان ابنه أكبر منه بخمسين سنة . وروي عن ابن عباس قال : لما أحيا الله عزيرا ركب حماره فأتى محلته فأنكر الناس وأنكروه ، فوجد في منزله عجوزا عمياء كانت أمة لهم ، خرج عنهم عزير وهي بنت عشرين سنة ، فقال لها : أهذا منزل عزير ؟ فقالت نعم! ثم بكت وقالت : فارقنا عزير منذ كذا وكذا سنة قال : فأنا عزير ، قالت : إن عزيرا فقدناه منذ مائة سنة . قال : فالله أماتني مائة سنة ثم بعثني . قالت : فعزير كان مستجاب الدعوة للمريض وصاحب البلاء فيفيق ، فادع الله يرد علي بصري ، فدعا الله ومسح على عينيها بيده فصحت مكانها كأنها أنشطت من عقال . قالت : أشهد أنك عزير ثم انطلقت إلى ملإ بني إسرائيل وفيهم ابن لعزير شيخ ابن مائة وثمان وعشرين سنة ، وبنو بنيه شيوخ ، فقالت : يا قوم ، هذا والله عزير فأقبل إليه ابنه مع الناس فقال ابنه : كانت لأبي شامة سوداء مثل الهلال بين كتفيه ، فنظرها فإذا هو عزير . وقيل : جاء وقد هلك كل من يعرف ، فكان آية لمن كان حيا من قومه إذ كانوا موقنين بحاله سماعا . قال ابن عطية : وفي إماتته هذه المدة ثم إحيائه بعدها أعظم آية ، وأمره كله آية غابر الدهر ، ولا يحتاج إلى تخصيص بعض ذلك دون بعض .\nقوله تعالى : وانظر إلى العظام كيف ننشزها قرأ الكوفيون وابن عامر بالزاي والباقون بالراء ، وروى أبان عن عاصم \" ننشرها \" بفتح النون وضم الشين والراء ، وكذلك قرأ ابن عباس والحسن وأبو حيوة ، فقيل : هما لغتان في الإحياء بمعنى ، كما يقال رجع ورجعته ، وغاض الماء وغضته ، وخسرت الدابة وخسرتها ، إلا أن المعروف في اللغة أنشر الله الموتى فنشروا ، أي أحياهم الله فحيوا ، قال الله تعالى : ثم إذا شاء أنشره ويكون نشرها مثلا ( نشر الثوب ) . نشر الميت ينشر نشورا أي عاش بعد الموت ، قال الأعشى :\nحتى يقول الناس مما رأوا يا عجبا للميت الناشر\nفكأن الموت طي للعظام والأعضاء ، وكأن الإحياء وجمع الأعضاء بعضها إلى بعض نشر . وأما قراءة ننشزها بالزاي فمعناه نرفعها . والنشز : المرتفع من الأرض ، قال :\nترى الثعلب الحولي فيها كأنه إذا ما علا نشزا حصان مجلل\nقال مكي : المعنى : انظر إلى العظام كيف نرفع بعضها على بعض في التركيب للإحياء ؛ لأن النشز الارتفاع ، ومنه المرأة النشوز ، وهي المرتفعة عن موافقة زوجها ، ومنه قوله تعالى : وإذا قيل انشزوا فانشزوا ؛ أي ارتفعوا وانضموا . وأيضا فإن القراءة بالراء بمعنى الإحياء ، والعظام لا تحيا على الانفراد حتى ينضم بعضها إلى بعض ، والزاي أولى بذلك المعنى ، إذ هو بمعنى الانضمام دون الإحياء . فالموصوف بالإحياء هو الرجل دون العظام على انفرادها ، ولا يقال : هذا عظم حي ، وإنما المعنى فانظر إلى العظام كيف نرفعها من أماكنها من الأرض إلى جسم صاحبها للإحياء . وقرأ النخعي \" ننشزها \" بفتح النون وضم الشين والزاي ، وروي ذلك عن ابن عباس وقتادة . وقرأ أبي بن كعب \" ننشيها \" بالياء .\nوالكسوة : ما وارى من الثياب ، وشبه اللحم بها . وقد استعاره لبيد للإسلام فقال :\nالحمد لله إذ لم يأتني أجلي حتى اكتسيت من الإسلام سربالا\nوقد تقدم أول السورة .\nقوله تعالى : فلما تبين له قال أعلم أن الله على كل شيء قدير بقطع الألف . وقد روي أن الله جل ذكره أحيا بعضه ثم أراه كيف أحيا باقي جسده . قال قتادة : إنه جعل ينظر كيف يوصل بعض عظامه إلى بعض ؛ لأن أول ما خلق الله منه رأسه وقيل له : انظر ، فقال عند ذلك : ( أعلم ) بقطع الألف ، أي أعلم هذا . وقال الطبري : المعنى في قوله فلما تبين له أي لما اتضح له عيانا ما كان مستنكرا في قدرة الله عنده قبل عيانه قال : أعلم . قال ابن عطية : وهذا خطأ ؛ لأنه ألزم ما لا يقتضيه اللفظ ، وفسر على القول الشاذ والاحتمال الضعيف ، وهذا عندي ليس بإقرار بما كان قبل ينكره كما زعم الطبري ، بل هو قول بعثه الاعتبار ، كما يقول الإنسان المؤمن إذا رأى شيئا غريبا من قدرة الله تعالى : لا إله إلا الله ونحو هذا . وقال أبو علي : معناه أعلم هذا الضرب من العلم الذي لم أكن علمته .\nقلت : وقد ذكرنا هذا المعنى عن قتادة ، وكذلك قال مكي رحمه الله ، قال مكي : إنه أخبر عن نفسه عندما عاين من قدرة الله تعالى في إحيائه الموتى ، فتيقن ذلك بالمشاهدة ، فأقر أنه يعلم أن الله على كل شيء قدير ، أي أعلم أنا هذا الضرب من العلم الذي لم أكن أعلمه على معاينة ، وهذا على قراءة من قرأ ( أعلم ) بقطع الألف وهم الأكثر من القراء . وقرأ حمزة والكسائي بوصل الألف ، ويحتمل وجهين : أحدهما قال له الملك : اعلم ، والآخر هو أن ينزل نفسه منزلة المخاطب الأجنبي المنفصل ، فالمعنى فلما تبين له قال لنفسه : اعلمي يا نفس هذا العلم اليقين الذي لم تكوني تعلمين معاينة ، وأنشد أبو علي في مثل هذا المعنى ( للشاعر الأعشى :\nودع هريرة إن الركب مرتحل وهل تطيق وداعا أيها الرجل\nألم تغتمض عيناك ليلة أرمدا وعاك ما عاد السليم المسهدا\nقال ابن عطية : وتأنس أبو علي في هذا الشعر بقول الشاعر :\nتذكر من أنى ومن أين شربه يؤامر نفسيه كذي الهجمة الإبل\nقال مكي : ويبعد أن يكون ذلك أمرا من الله جل ذكره له بالعلم ؛ لأنه قد أظهر إليه قدرته ، وأراه أمرا أيقن صحته وأقر بالقدرة فلا معنى لأن يأمره الله بعلم ذلك ، بل هو يأمر نفسه بذلك وهو جائز حسن . وفي حرف عبد الله ما يدل على أنه أمر من الله تعالى له بالعلم على معنى الزم هذا العلم لما عاينت وتيقنت ، وذلك أن في حرفه : قيل اعلم . وأيضا فإنه موافق لما قبله من الأمر في قوله انظر إلى طعامك و انظر إلى حمارك و انظر إلى العظام فكذلك واعلم أن الله وقد كان ابن عباس يقرؤها \" قيل اعلم \" ويقول أهو خير أم إبراهيم ؟ إذ قيل له : واعلم أن الله عزيز حكيم . فهذا يبين أنه من قول الله سبحانه له لما عاين من الإحياء .\n                                    ",
        "saadi": "أَوۡ كَٱلَّذِي مَرَّ عَلَىٰ قَرۡيَةٖ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحۡيِۦ هَٰذِهِ ٱللَّهُ بَعۡدَ مَوۡتِهَاۖ فَأَمَاتَهُ ٱللَّهُ مِاْئَةَ عَامٖ ثُمَّ بَعَثَهُۥۖ قَالَ كَمۡ لَبِثۡتَۖ قَالَ لَبِثۡتُ يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۖ قَالَ بَل لَّبِثۡتَ مِاْئَةَ عَامٖ فَٱنظُرۡ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡۖ وَٱنظُرۡ إِلَىٰ حِمَارِكَ وَلِنَجۡعَلَكَ ءَايَةٗ لِّلنَّاسِۖ وَٱنظُرۡ إِلَى ٱلۡعِظَامِ كَيۡفَ نُنشِزُهَا ثُمَّ نَكۡسُوهَا لَحۡمٗاۚ فَلَمَّا تَبَيَّنَ لَهُۥ قَالَ أَعۡلَمُ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩٥٢\n                                        \n                                        \n                                        \n                                        وهذا أيضا دليل آخر على توحد الله بالخلق والتدبير والإماتة والإحياء، فقال: ( أو كالذي مر على قرية وهي خاوية على عروشها ) أي: قد باد أهلها وفني سكانها وسقطت حيطانها على عروشها، فلم يبق بها أنيس بل بقيت موحشة من أهلها مقفرة، فوقف عليها ذلك الرجل متعجبا و ( قال أنى يحيي هذه الله بعد موتها ) استبعادا لذلك وجهلا بقدرة الله تعالى، فلما أراد الله به خيرا أراه آية في نفسه وفي حماره، وكان معه طعام وشراب، ( فأماته الله مائة عام ثم بعثه قال كم لبثت قال لبثت يوما أو بعض يوم ) استقصارا لتلك المدة التي مات فيها لكونه قد زالت معرفته وحواسه وكان عهد حاله قبل موته، فقيل له ( بل لبثت مائة عام فانظر إلى طعامك وشرابك لم يتسنه ) أي: لم يتغير بل بقي على حاله على تطاول السنين واختلاف الأوقات عليه، ففيه أكبر دليل على قدرته حيث أبقاه وحفظه عن التغير والفساد، مع أن الطعام والشراب من أسرع الأشياء فسادا ( وانظر إلى حمارك ) وكان قد مات وتمزق لحمه وجلده وانتثرت عظامه، وتفرقت أوصاله ( ولنجعلك آية للناس ) على قدرة الله وبعثه الأموات من قبورهم، لتكون أنموذجا محسوسا مشاهدا بالأبصار، فيعلموا بذلك صحة ما أخبرت به الرسل ( وانظر إلى العظام كيف ننشزها ) أي: ندخل بعضها في بعض، ونركب بعضها ببعض ( ثم نكسوها لحما ) فنظر إليها عيانا كما وصفها الله تعالى، ( فلما تبين له ) ذلك وعلم قدرة الله تعالى ( قال أعلم أن الله على كل شيء قدير ) والظاهر من سياق الآية أن هذا رجل منكر للبعث أراد الله به خيرا، وأن يجعله آية ودليلا للناس لثلاثة أوجه أحدها قوله ( أنى يحيي هذه الله بعد موتها ) ولو كان نبيا أو عبدا صالحا لم يقل ذلك، والثاني: أن الله أراه آية في طعامه وشرابه وحماره ونفسه ليراه بعينه فيقر بما أنكره، ولم يذكر في الآية أن القرية المذكورة عمرت وعادت إلى حالتها، ولا في السياق ما يدل على ذلك، ولا في ذلك كثير فائدة، ما الفائدة الدالة على إحياء الله للموتى في قرية خربت ثم رجع إليها أهلها أو غيرهم فعمروها؟! وإنما الدليل الحقيقي في إحيائه وإحياء حماره وإبقاء طعامه وشرابه بحاله، والثالث في قوله: ( فلما تبين له ) أي: تبين له أمر كان يجهله ويخفى عليه، فعلم بذلك صحة ما ذكرناه، والله أعلم.\n                                    "
      },
      "originalText": "أَوۡ كَٱلَّذِي مَرَّ عَلَىٰ قَرۡيَةٖ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحۡيِۦ هَٰذِهِ ٱللَّهُ بَعۡدَ مَوۡتِهَاۖ فَأَمَاتَهُ ٱللَّهُ مِاْئَةَ عَامٖ ثُمَّ بَعَثَهُۥۖ قَالَ كَمۡ لَبِثۡتَۖ قَالَ لَبِثۡتُ يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۖ قَالَ بَل لَّبِثۡتَ مِاْئَةَ عَامٖ فَٱنظُرۡ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡۖ وَٱنظُرۡ إِلَىٰ حِمَارِكَ وَلِنَجۡعَلَكَ ءَايَةٗ لِّلنَّاسِۖ وَٱنظُرۡ إِلَى ٱلۡعِظَامِ كَيۡفَ نُنشِزُهَا ثُمَّ نَكۡسُوهَا لَحۡمٗاۚ فَلَمَّا تَبَيَّنَ لَهُۥ قَالَ أَعۡلَمُ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩٥٢"
    }
  ]
}