{
  "number": 453,
  "ayahsNumber": 16,
  "ayahs": [
    {
      "number": 3971,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ ص ۚ وَالْقُرْآنِ ذِي الذِّكْرِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 1,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ ١\n                                    \n                                    \n                                    تفسير سورة ص [ وهي ] مكية .\n* قد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسيره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال: الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذاني قال: قال عبدالله فذكر نحوه.\nوحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس: الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب: فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لا يـ ينقد عنه جلده إذا يـ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وان شرا فـ ولا أريد الشر إلا أن تـ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك: نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال: فسبحان الذي دقت في كل شيء حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال: لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حم عسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال: لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\nوقوله تعالى \"والقرآن ذي الذكر\" أي والقرآن المشتمل على ما فيه ذكر للعباد ونفع لهم في المعاش والمعاد قال الضحاك في قوله تعالى \" ذي الذكر\" كقوله تعالى \" لقد أنزلنا إليكم كتابا فيه ذكركم\" أي تذكيركم وكذا قال قتادة وأختاره ابن جرير.\nوقال ابن عباس رضي الله عنهما وسعيد بن جبير وإسماعيل بن أبي خالد وابن عيينة وأبو حصين وأبو صالح والسدي \"ذي الذكر\" ذي الشرف أي ذي الشأن والمكانة ولا منافاة بين القولين فإنه كتاب شريف مشتمل على التذكير والإعذار والإنذار واختلفوا في جواب هذا القسم فقال بعضهم هو قوله تعالى \"إن كل إلا كذب الرسل فحق عقاب \" وقيل قوله تعالى \"إن ذلك لحق تخاصم أهل النار \" حكاهما ابن جرير وهذا الثاني فيه بعد كبير وضعفه ابن جرير وقال قتادة جوابه \"بل الذين كفروا في عزة وشقاق \" واختاره ابن جرير ثم حكى ابن جرير عن بعض أهل العربية أنه قال جوابه \"ص\" بمعنى صدق حق \"والقرآن ذي الذكر \" وقيل جوابه ما تضمنه سياق السورة بكمالها والله أعلم.\n                                    ",
        "qortoby": "صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ ١\n                                    \n                                    \n                                    سورة ص\nسورة ص .\nمكية في قول الجميع ، وهي ست وثمانون آية . وقيل ثمان وثمانون آية .\nبسم الله الرحمن الرحيم .\nص والقرآن ذي الذكر\nقوله تعالى : ص قراءة العامة \" ص \" بجزم الدال على الوقف ; لأنه حرف من حروف الهجاء مثل : الم و المر . وقرأ أبي بن كعب والحسن وابن أبي إسحاق ونصر بن عاصم \" صاد \" بكسر الدال بغير تنوين . ولقراءته مذهبان : أحدهما أنه من صادى يصادي إذا عارض ، ومنه فأنت له تصدى أي تعرض . والمصاداة المعارضة ، ومنه الصدى وهو ما يعارض الصوت في الأماكن الخالية . فالمعنى صاد القرآن بعملك ، أي : عارضه بعملك وقابله به ، فاعمل بأوامره ، وانته عن نواهيه . النحاس : وهذا المذهب يروى عن الحسن أنه فسر به قراءته رواية صحيحة . وعنه أن المعنى اتله وتعرض لقراءته . والمذهب الآخر : أن تكون الدال مكسورة لالتقاء الساكنين . وقرأ عيسى بن عمر \" صاد \" بفتح الدال مثله : \" قاف \" و \" نون \" بفتح آخرها . وله في ذلك ثلاثة مذاهب : أحدهن : أن يكون بمعنى اتل . والثاني : أن يكون فتح لالتقاء الساكنين واختار الفتح للإتباع ، ولأنه أخف الحركات . والثالث : أن يكون منصوبا على القسم بغير حرف ، كقولك : الله لأفعلن ، وقيل : نصب على الإغراء . وقيل : معناه صاد محمد قلوب الخلق واستمالها حتى آمنوا به . وقرأ ابن أبي إسحاق أيضا \" صاد \" بكسر الدال والتنوين على أن يكون مخفوضا على حذف حرف القسم ، وهذا بعيد وإن كان سيبويه قد أجاز مثله . ويجوز أن يكون مشبها بما لا يتمكن من الأصوات وغيرها . وقرأ هارون الأعور ومحمد بن السميقع : \" صاد \" و \" قاف \" و \" نون \" بضم آخرهن : لأنه المعروف بالبناء في غالب الحال ، نحو منذ وقط وقبل وبعد . و \" ص \" إذا جعلته اسما للسورة لم ينصرف ، كما أنك إذا سميت مؤنثا بمذكر لا ينصرف وإن قلت حروفه . وقال ابن عباس وجابر بن عبد الله وقد سئلا عن ص فقالا : لا ندري ما هي . وقال عكرمة : سأل نافع بن الأزرق ابن عباس عن ص فقال : ص كان بحرا بمكة وكان عليه عرش الرحمن إذ لا ليل ولا نهار . وقال سعيد بن جبير : ص بحر يحيي الله به الموتى بين النفختين . وقال الضحاك : معناه صدق الله . وعنه أن ص قسم أقسم الله به وهو من أسمائه تعالى . وقال السدي ، وروي عن ابن عباس . وقال محمد بن كعب : هو مفتاح أسماء الله تعالى : صمد ، وصانع المصنوعات ، وصادق الوعد . وقال قتادة : هو اسم من أسماء الرحمن . وعنه أنه اسم من أسماء القرآن . وقال مجاهد : هو فاتحة السورة . وقيل : هو مما استأثر الله تعالى بعلمه وهو معنى القول الأول . وقد تقدم جميع هذا في [ البقرة ] .\nقوله تعالى : والقرآن خفض بواو القسم ، والواو بدل من الباء ، أقسم بالقرآن تنبيها على جلالة قدره ، فإن فيه بيان كل شيء ، وشفاء لما في الصدور ، ومعجزة للنبي صلى الله عليه وسلم .\nذي الذكر خفض على النعت ، وعلامة خفضه الياء ، وهو اسم معتل ، والأصل فيه ذوى على فعل . قال ابن عباس : ومقاتل معنى ذي الذكر ذي البيان . الضحاك : ذي الشرف أي : من آمن به كان شرفا له في الدارين ، كما قال تعالى : لقد أنزلنا إليكم كتابا فيه ذكركم أي : شرفكم . وأيضا القرآن شريف في نفسه لإعجازه واشتماله على ما لا يشتمل عليه غيره . وقيل : ذي الذكر أي : فيه ذكر ما يحتاج إليه من أمر الدين . وقيل : ذي الذكر أي : فيه ذكر أسماء الله وتمجيده . وقيل : أي : ذي الموعظة والذكر . وجواب القسم محذوف . واختلف فيه على أوجه : فقيل جواب القسم ص ; لأن معناه حق ، فهي جواب لقوله : والقرآن كما تقول : حقا والله ، نزل والله ، وجب والله ، فيكون الوقف من هذا الوجه على قوله : والقرآن ذي الذكر حسنا ، وعلى في عزة وشقاق تماما . قال ابن الأنباري . وحكى معناه الثعلبي عن الفراء . وقيل : الجواب بل الذين كفروا في عزة وشقاق لأن بل نفي لأمر سبق وإثبات لغيره ، قاله القتبي ، فكأنه قال : والقرآن ذي الذكر بل الذين كفروا في عزة وشقاق عن قبول الحق وعداوة لمحمد صلى الله عليه وسلم . أو والقرآن ذي الذكر ما الأمر كما يقولون من أنك ساحر كذاب ; لأنهم يعرفونك بالصدق والأمانة بل هم في تكبر عن قبول الحق . وهو كقوله : ق والقرآن المجيد . بل عجبوا . وقيل : الجواب كم أهلكنا كأنه قال : والقرآن لكم أهلكنا ، فلما تأخرت كم حذفت اللام منها ، كقوله تعالى : والشمس وضحاها ثم قال : قد أفلح أي : لقد أفلح . قال المهدوي : وهذا مذهب الفراء . ابن الأنباري : فمن هذا الوجه لا يتم الوقف على قوله : في عزة وشقاق . وقال الأخفش : جواب القسم إن كل إلا كذب الرسل فحق عقاب ونحو منه قوله تعالى : تالله إن كنا لفي ضلال مبين وقوله : والسماء والطارق إلى قوله إن كل نفس ابن الأنباري : وهذا قبيح ; لأن الكلام قد طال فيما بينهما وكثرت الآيات والقصص . وقال الكسائي : جواب القسم قوله : إن ذلك لحق تخاصم أهل النار . ابن الأنباري : وهذا أقبح من الأول ; لأن الكلام أشد طولا فيما بين القسم وجوابه . وقيل : الجواب قوله : إن هذا لرزقنا ما له من نفاد . وقال قتادة : الجواب محذوف تقديره والقرآن ذي الذكر لتبعثن ونحوه .\n                                    ",
        "saadi": "صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ ١\n                                        \n                                        \n                                        \n                                        هذا بيان من اللّه تعالى لحال القرآن، وحال المكذبين به معه ومع من جاء به، فقال: { ص وَالْقُرْآنِ ذِي الذِّكْرِ } أي: ذي القدر العظيم والشرف، المُذَكِّرِ للعباد كل ما يحتاجون إليه من العلم، بأسماء اللّه وصفاته وأفعاله، ومن العلم بأحكام اللّه الشرعية، ومن العلم بأحكام المعاد والجزاء، فهو مذكر لهم في أصول دينهم وفروعه.\nوهنا لا يحتاج إلى ذكر المقسم عليه، فإن حقيقة الأمر، أن المقسم به وعليه شيء واحد، وهو هذا القرآن، الموصوف بهذا الوصف الجليل، فإذا كان القرآن بهذا الوصف، علم ضرورة العباد إليه، فوق كل ضرورة، وكان الواجب عليهم تَلقِّيه بالإيمان والتصديق، والإقبال على استخراج ما يتذكر به منه.\n                                    "
      },
      "originalText": "صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ ١"
    },
    {
      "number": 3972,
      "text": "بَلِ الَّذِينَ كَفَرُوا فِي عِزَّةٍ وَشِقَاقٍ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 2,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ ٢\n                                    \n                                    \n                                    وقوله : ( بل الذين كفروا في عزة وشقاق ) أي : إن في هذا القرآن لذكرا لمن يتذكر ، وعبرة لمن يعتبر . وإنما لم ينتفع به الكافرون ؛ لأنهم ) في عزة ) أي : استكبار عنه وحمية ) وشقاق ) أي : مخالفة له ومعاندة ومفارقة .\n                                    ",
        "qortoby": "بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ ٢\n                                    \n                                    \n                                    قوله تعالى : بل الذين كفروا في عزة أي في تكبر وامتناع من قبول الحق ، كما قال - جل وعز - : وإذا قيل له اتق الله أخذته العزة بالإثم والعزة عند العرب : الغلبة والقهر . يقال : من عز بز ، يعني من غلب سلب . ومنه : وعزني في الخطاب أراد غلبني . وقال جرير :\nيعز على الطريق بمنكبيه كما ابترك الخليع على القداح\nأراد يغلب .\nقوله تعالى : وشقاق أي في إظهار خلاف ومباينة . وهو من الشق ، كأن هذا في شق وذلك في شق . وقد مضى في [ البقرة ] مستوفى .\n                                    ",
        "saadi": "بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ ٢\n                                        \n                                        \n                                        \n                                        فهدى اللّه من هدى لهذا، وأبى الكافرون به وبمن أنزله، وصار معهم { عِزَّةٍ وَشِقَاقٍ } عزة وامتناع عن الإيمان به، واستكبار وشقاق له، أي: مشاقة ومخاصمة في رده وإبطاله، وفي القدح بمن جاء به.\n                                    "
      },
      "originalText": "بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ ٢"
    },
    {
      "number": 3973,
      "text": "كَمْ أَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ فَنَادَوْا وَلَاتَ حِينَ مَنَاصٍ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 3,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ ٣\n                                    \n                                    \n                                    ثم خوفهم ما أهلك به الأمم المكذبة قبلهم بسبب مخالفتهم للرسل وتكذيبهم الكتب المنزلة من السماء فقال : ( كم أهلكنا من قبلهم من قرن ) أي : من أمة مكذبة ، ( فنادوا ) أي : حين جاءهم العذاب استغاثوا وجأروا إلى الله . وليس ذلك بمجد عنهم شيئا . كما قال تعالى : ( فلما أحسوا بأسنا إذا هم منها يركضون ) ] الأنبياء : 12 [ أي : يهربون ، ( لا تركضوا وارجعوا إلى ما أترفتم فيه ومساكنكم لعلكم تسألون ) ] الأنبياء : 13 [\nقال أبو داود الطيالسي : حدثنا شعبة عن أبي إسحاق عن التميمي قال : سألت ابن عباس عن قول الله : ( فنادوا ولات حين مناص ) قال : ليس بحين نداء ، ولا نزو ولا فرار\nوقال علي بن أبي طلحة ، عن ابن عباس : ليس بحين مغاث .\nوقال شبيب بن بشر عن عكرمة عن ابن عباس : نادوا النداء حين لا ينفعهم وأنشد :\nتذكر ليلى لات حين تذكر\n.\nوقال محمد بن كعب في قوله : ( فنادوا ولات حين مناص ) يقول : نادوا بالتوحيد حين تولت الدنيا عنهم ، واستناصوا للتوبة حين تولت الدنيا عنهم .\nوقال قتادة : لما رأوا العذاب أرادوا التوبة في غير حين النداء .\nوقال مجاهد : ( فنادوا ولات حين مناص ) ليس بحين فرار ولا إجابة .\nوقد روي نحو هذا عن عكرمة ، وسعيد بن جبير وأبي مالك والضحاك وزيد بن أسلم والحسن وقتادة .\nوعن مالك ، عن زيد بن أسلم : ( ولات حين مناص ) ولا نداء في غير حين النداء .\nوهذه الكلمة وهي \" لات \" هي \" لا \" التي للنفي ، زيدت معها \" التاء \" كما تزاد في \" ثم \" فيقولون : \" ثمت \" ، و \" رب \" فيقولون : \" ربت \" . وهي مفصولة والوقف عليها . ومنهم من حكى عن المصحف الإمام فيما ذكره [ ابن جرير ] أنها متصلة بحين : \" ولا تحين مناص \" . والمشهور الأول . ثم قرأ الجمهور بنصب \" حين \" تقديره : وليس الحين حين مناص . ومنهم من جوز النصب بها ، وأنشد :\nتذكر حب ليلى لات حينا وأضحى الشيب قد قطع القرينا\nومنهم من جوز الجر بها ، وأنشد :\nطلبوا صلحنا ولات أوان فأجبنا أن ليس حين بقاء\nوأنشد بعضهم أيضا :\nولات ساعة مندم\nبخفض الساعة ، وأهل اللغة يقولون : النوص : التأخر ، والبوص : التقدم . ولهذا قال تعالى : ( ولات حين مناص ) أي : ليس الحين حين فرار ولا ذهاب .\n\n                                    ",
        "qortoby": "كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ ٣\n                                    \n                                    \n                                    قوله تعالى : كم أهلكنا من قبلهم من قرن أي قوم كانوا أمنع من هؤلاء . و \" كم \" لفظة التكثير\nفنادوا أي بالاستغاثة والتوبة . والنداء رفع الصوت ، ومنه الخبر : ( ألقه على بلال فإنه أندى منك صوتا ) أي : أرفع .\nولات حين مناص قال الحسن : نادوا بالتوبة وليس حين التوبة ولا حين ينفع العمل . النحاس : وهذا تفسير منه لقوله - عز وجل - : ولات حين مناص فأما إسرائيل فروى عن أبي إسحاق عن التميمي عن ابن عباس : ولات حين مناص قال : ليس بحين نزو ولا فرار ، قال : ضبط القوم جميعا قال الكلبي : كانوا إذا قاتلوا فاضطروا قال بعضهم لبعض : مناص ، أي : عليكم بالفرار والهزيمة ، فلما أتاهم العذاب قالوا مناص ، فقال الله - عز وجل - : ولات حين مناص قال القشيري : وعلى هذا فالتقدير : فنادوا مناص فحذف لدلالة بقية الكلام عليه ، أي : ليس الوقت وقت ما تنادون به . وفي هذا نوع تحكم ، إذ يبعد أن يقال : كل من هلك من القرون كانوا يقولون مناص عند الاضطرار . وقيل : المعنى ولات حين مناص أي : لا خلاص ، وهو نصب بوقوع \" لا \" عليه . قال القشيري : وفيه نظر لأنه لا معنى على هذا للواو في ولات حين مناص وقال الجرجاني : أي : فنادوا حين لا مناص ، أي : ساعة لا منجى ولا فوت . فلما قدم \" لا \" وأخر \" حين \" اقتضى ذلك الواو ، كما يقتضي الحال إذا جعل ابتداء وخبرا ، مثل قولك : جاء زيد راكبا ، فإذا جعلته مبتدأ وخبرا اقتضى الواو مثل : جاءني زيد وهو راكب ، فحين ظرف لقوله : فنادوا . والمناص بمعنى التأخر والفرار والخلاص ، أي : نادوا لطلب الخلاص في وقت لا يكون لهم فيه خلاص . قال الفراء : .\nأمن ذكر ليلى إذ نأتك تنوص\nيقال : ناص عن قرنه ينوص نوصا ومناصا أي : فر وزاغ . النحاس : ويقال : ناص ينوص إذا تقدم .\nقلت : فعلى هذا يكون من الأضداد ، والنوص الحمار الوحشي . واستناص أي : تأخر ، قاله الجوهري . وتكلم النحويون في ولات حين وفي الوقف عليه ، وكثر فيه أبو عبيدة القاسم بن سلام في كتاب القراءات وكل ما جاء به إلا يسيرا مردود . فقال سيبويه : لات مشبهة بليس والاسم فيها مضمر ، أي : ليست أحياننا حين مناص . وحكى أن من العرب من يرفع بها فيقول : ولات حين مناص . وحكى أن الرفع قليل ، ويكون الخبر محذوفا كما كان الاسم محذوفا في النصب ، أي : ولات حين مناص لنا . والوقف عليها عند سيبويه والفراء ولات بالتاء ثم تبتدئ حين مناص هو قول ابن كيسان والزجاج . قال أبو الحسن بن كيسان : والقول كما قال سيبويه ; لأنه شبهها بليس ، فكما يقال ليست يقال لات . والوقوف عليها عند الكسائي بالهاء : ولاه . وهو قول المبرد محمد بن يزيد . وحكى عنه علي بن سليمان أن الحجة في ذلك أنها دخلت عليها الهاء لتأنيث الكلمة ، كما يقال ثمه وربه . وقال القشيري : وقد يقال ثمت بمعنى ثم ، وربت بمعنى رب ، فكأنهم زادوا في لا هاء فقالوا : لاه ، كما قالوا في ثمه عند الوصل صارت تاء . وقال الثعلبي : وقال أهل اللغة : و \" لات حين \" مفتوحتان كأنهما كلمة واحدة ، وإنما هي \" لا \" زيدت فيها التاء نحو رب وربت ، وثم وثمت . قال أبو زبيد الطائي :\nطلبوا صلحنا ولات أوان فأجبنا أن ليس حين بقاء\nوقال آخر :\nتذكر حب ليلى لات حينا وأمسى الشيب قد قطع القرينا\nومن العرب من يخفض بها ، وأنشد الفراء :\nفلتعرفن خلائقا مشمولة ولتندمن ولات ساعة مندم\nوكان الكسائي والفراء والخليل وسيبويه والأخفش يذهبون إلى أن \" ولات حين \" التاء منقطعة من حين ، ويقولون معناها وليست . وكذلك هو في المصاحف الجدد والعتق بقطع التاء من حين . وإلى هذا كان يذهب أبو عبيدة معمر بن المثنى . وقال أبو عبيد القاسم بن سلام : الوقف عندي على هذا الحرف \" ولا \" والابتداء \" تحين مناص \" فتكون التاء مع حين . وقال بعضهم : \" لات \" ثم يبتدئ فيقول : \" حين مناص \" . قال المهدوي : وذكر أبو عبيد أن التاء في المصحف متصلة بحين ، وهو غلط عند النحويين ، وهو خلاف قول المفسرين . ومن حجة أبي عبيد أن قال : إنا لم نجد العرب تزيد هذه التاء إلا في حين وأوان والآن ، وأنشد لأبي وجزة السعدي :\nالعاطفون تحين ما من عاطف والمطعمون زمان أين المطعم\nوأنشد لأبي زبيد الطائي :\nطلبوا صلحنا ولا تأوان فأجبنا أن ليس حين بقاء\nفأدخل التاء في \" أوان \" . قال أبو عبيد : ومن إدخالهم التاء في الآن ، حديث ابن عمر وسأله رجل عن عثمان بن عفان - رضي الله عنه - ، فذكر مناقبه ثم قال : اذهب بها تلان معك . وكذلك قول الشاعر :\nنولي قبل نأي داري جمانا وصلينا كما زعمت تلانا\nقال أبو عبيد : ثم مع هذا كله إني تعمدت النظر في الذي يقال له الإمام - مصحف عثمان - فوجدت التاء متصلة مع \" حين \" قد كتبت \" تحين \" . قال أبو جعفر النحاس : أما البيت الأول الذي أنشده لأبي وجزة فرواه العلماء باللغة على أربعة أوجه ، كلها على خلاف ما أنشده ، وفي أحدها تقديران ، رواه أبو العباس محمد بن يزيد :\nالعاطفون ولات ما من عاطف\nوالرواية الثانية :\nالعاطفون ولات حين تعاطف\nوالرواية الثالثة رواها ابن كيسان :\nالعاطفونة حين ما من عاطف\nجعلها هاء في الوقف وتاء في الإدراج ، وزعم أنها لبيان الحركة ، شبهت بهاء التأنيث . الرواية الرابعة :\nالعاطفونه حين ما من عاطف\nوفي هذه الرواية تقديران ، أحدهما وهو مذهب إسماعيل بن إسحاق أن الهاء في موضع نصب ، كما تقول : الضاربون زيدا ، فإذا كنيت قلت : الضاربوه . وأجاز سيبويه في الشعر الضاربونه ، فجاء إسماعيل بالتأنيث على مذهب سيبويه في إجازته مثله . والتقدير الآخر : العاطفونه على أن الهاء لبيان الحركة ، كما تقول : مر بنا المسلمونه في الوقف ، ثم أجريت في الوصل مجراها في الوقف ، كما قرأ أهل المدينة : ما أغنى عني ماليه هلك عني سلطانيه وأما البيت الثاني فلا حجة له فيه ; لأنه يوقف عليه : \" ولات أوان \" غير أن فيه شيئا مشكلا ; لأنه يروى : \" ولات أوان \" بالخفض ، وإنما يقع ما بعد لات مرفوعا أو منصوبا . وإن كان قد روي عن عيسى بن عمر أنه قرأ \" ولات حين مناص \" بكسر التاء من لات والنون من حين ، فإن الثبت عنه أنه قرأ \" ولات حين مناص \" فبنى \" لات \" على الكسر ونصب \" حين \" . فأما : ولات أوان ففيه تقديران ، قال الأخفش : فيه مضمر ، أي : ولات حين أوان . قال النحاس : وهذا القول بين الخطأ . والتقدير الآخر عن أبي إسحاق قال : تقديره ولات أواننا ، فحذف المضاف إليه فوجب ألا يعرب ، وكسره لالتقاء الساكنين . وأنشده محمد بن يزيد ولات أوان بالرفع . وأما البيت الثالث فبيت مولد لا يعرف قائله ولا تصح به حجة . على أن محمد بن يزيد رواه : كما زعمت الآن . وقال غيره : المعنى كما زعمت أنت الآن . فأسقط الهمزة من أنت والنون . وأما احتجاجه بحديث ابن عمر ، لما ذكر للرجل مناقب عثمان فقال له : اذهب بها تلان إلى أصحابك ، فلا حجة فيه ; لأن المحدث إنما يروي هذا على المعنى . والدليل على هذا أن مجاهدا يروي عن ابن عمر هذا الحديث وقال فيه : اذهب فاجهد جهدك . ورواه آخر : اذهب بها الآن معك . وأما احتجاجه بأنه وجدها في الإمام \" تحين \" . فلا حجة فيه ; لأن معنى الإمام أنه إمام المصاحف ، فإن كان مخالفا لها فليس بإمام لها ، وفي المصاحف كلها \" ولات \" فلو لم يكن في هذا إلا هذا الاحتجاج لكان مقنعا . وجمع مناص مناوص .\n                                    ",
        "saadi": "كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ ٣\n                                        \n                                        \n                                        \n                                        فتوعدهم بإهلاك القرون الماضية المكذبة بالرسل، وأنهم حين جاءهم الهلاك، نادوا واستغاثوا في صرف العذاب عنهم ولكن { وَلَاتَ حِينَ مَنَاصٍ } أى: وليس الوقت، وقت خلاص مما وقعوا فيه، ولا فرج لما أصابهم، فَلْيَحْذَرْ هؤلاء أن يدوموا على عزتهم وشقاقهم، فيصيبهم ما أصابهم.\n                                    "
      },
      "originalText": "كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنٖ فَنَادَواْ وَّلَاتَ حِينَ مَنَاصٖ ٣"
    },
    {
      "number": 3974,
      "text": "وَعَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ ۖ وَقَالَ الْكَافِرُونَ هَٰذَا سَاحِرٌ كَذَّابٌ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 4,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَعَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ ٤\n                                    \n                                    \n                                    يقول تعالى مخبرا عن المشركين في تعجبهم من بعثة الرسول بشرا ، كما قال تعالى : ( أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس وبشر الذين آمنوا أن لهم قدم صدق عند ربهم قال الكافرون إن هذا لساحر مبين ) وقال هاهنا : ( وعجبوا أن جاءهم منذر منهم ) أي : بشر مثلهم ، ( وقال الكافرون هذا ساحر كذاب أجعل الآلهة إلها واحدا ) أي : أزعم أن المعبود واحد لا إله إلا هو ؟ ! أنكر المشركون ذلك - قبحهم الله تعالى - وتعجبوا من ترك الشرك بالله ، فإنهم كانوا قد تلقوا عن آبائهم عبادة الأوثان وأشربته قلوبهم فلما دعاهم الرسول - صلى الله عليه وسلم - إلى خلع ذلك من قلوبهم وإفراد الله بالوحدانية أعظموا ذلك وتعجبوا وقالوا :\n                                    ",
        "qortoby": "وَعَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ ٤\n                                    \n                                    \n                                    قوله تعالى : وعجبوا أن جاءهم منذر منهم أن في موضع نصب ، والمعنى من أن جاءهم . قيل : هو متصل بقوله : في عزة وشقاق أي : في عزة وشقاق وعجبوا ، وقوله : كم أهلكنا معترض . وقيل : لا بل هذا ابتداء كلام ، أي : ومن جهلهم أنهم أظهروا التعجب من أن جاءهم منذر منهم .\nفقال الكافرون هذا ساحر أي يجيء بالكلام المموه الذي يخدع به الناس ، وقيل : يفرق بسحره بين الوالد وولده والرجل وزوجته\nكذاب أي في دعوى النبوة .\n                                    ",
        "saadi": "وَعَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ ٤\n                                        \n                                        \n                                        \n                                        { وَعَجِبُوا أَنْ جَاءَهُمْ مُنْذِرٌ مِنْهُمْ } أي: عجب هؤلاء المكذبون في أمر ليس محل عجب، أن جاءهم منذر منهم، ليتمكنوا من التلقي عنه، وليعرفوه حق المعرفة، ولأنه من قومهم، فلا تأخذهم النخوة القومية عن اتباعه، فهذا مما يوجب الشكر عليهم، وتمام الانقياد له.\nولكنهم عكسوا القضية، فتعجبوا تعجب إنكار وَقَالُوا من كفرهم وظلمهم: { هَذَا سَاحِرٌ كَذَّابٌ }\n                                    "
      },
      "originalText": "وَعَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا سَٰحِرٞ كَذَّابٌ ٤"
    },
    {
      "number": 3975,
      "text": "أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا ۖ إِنَّ هَٰذَا لَشَيْءٌ عُجَابٌ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 5,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ ٥\n                                    \n                                    \n                                    \"أجعل الآلهة إلها واحدا\"أي : أزعم أن المعبود واحد لا إله إلا هو ؟ ! أنكر المشركون ذلك - قبحهم الله تعالى - وتعجبوا من ترك الشرك بالله ، فإنهم كانوا قد تلقوا عن آبائهم عبادة الأوثان وأشربته قلوبهم فلما دعاهم الرسول - صلى الله عليه وسلم - إلى خلع ذلك من قلوبهم وإفراد الله بالوحدانية أعظموا ذلك وتعجبوا وقالوا : ( أجعل الآلهة إلها واحدا إن هذا لشيء عجاب).\n                                    ",
        "qortoby": "أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ ٥\n                                    \n                                    \n                                    قوله تعالى : أجعل الآلهة إلها واحدا مفعولان أي : صير الآلهة إلها واحدا .\nإن هذا لشيء عجاب أي عجيب . وقرأ السلمي : \" عجاب \" بالتشديد . والعجاب والعجاب والعجب سواء . وقد فرق الخليل بين عجيب وعجاب فقال : العجيب العجب ، والعجاب الذي قد تجاوز حد العجب ، والطويل الذي فيه طول ، والطوال ، الذي قد تجاوز حد الطول . وقال الجوهري : العجيب الأمر الذي يتعجب منه ، وكذلك العجاب بالضم ، والعجاب بالتشديد أكثر منه ، وكذلك الأعجوبة . وقال مقاتل : \" عجاب \" لغة أزد شنوءة . وروى سعيد بن جبير عن ابن عباس قال : مرض أبو طالب فجاءت قريش إليه ، وجاء النبي - صلى الله عليه وسلم - ، وعند رأس أبي طالب مجلس رجل ، فقام أبو جهل كي يمنعه ، قال : وشكوه إلى أبي طالب ، فقال : يا ابن أخي ما تريد من قومك ؟ فقال : يا عم ، إنما أريد منهم كلمة تذل لهم بها العرب ، وتؤدي إليهم بها الجزية العجم ، فقال : وما هي ؟ قال : لا إله إلا الله . قال : فقالوا أجعل الآلهة إلها واحدا قال : فنزل فيهم القرآن : ص والقرآن ذي الذكر . بل الذين كفروا في عزة وشقاق حتى بلغ إن هذا إلا اختلاق خرجه الترمذي أيضا بمعناه . وقال : هذا حديث حسن صحيح . وقيل : لما أسلم عمر بن الخطاب - رضي الله عنه - شق على قريش إسلامه فاجتمعوا إلى أبي طالب وقالوا : اقض بيننا وبين ابن أخيك . فأرسل أبو طالب إلى النبي - صلى الله عليه وسلم - فقال : يا ابن أخي ، هؤلاء قومك يسألونك السواء ، فلا تمل كل الميل على قومك . قال : وماذا يسألونني ؟ قالوا : ارفضنا وارفض ذكر آلهتنا وندعك وإلهك . فقال النبي - صلى الله عليه وسلم - : أتعطونني كلمة واحدة وتملكون بها العرب ، وتدين لكم بها العجم ، فقال أبو جهل : لله أبوك لنعطينكها وعشر أمثالها . فقال النبي - صلى الله عليه وسلم - : قولوا لا إله إلا الله . فنفروا من ذلك وقاموا ، فقالوا : أجعل الآلهة إلها واحدا فكيف يسع الخلق كلهم إله واحد . فأنزل الله فيهم هذه الآيات إلى قوله : كذبت قبلهم قوم نوح .\n                                    ",
        "saadi": "أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ ٥\n                                        \n                                        \n                                        \n                                        وذنبه -عندهم- أنه { أَجَعَلَ الْآلِهَةَ إِلَهًا وَاحِدًا } أى: كيف ينهى عن اتخاذ الشركاء والأنداد، ويأمر بإخلاص العبادة للّه وحده. { إِنَّ هَذَا } الذي جاء به { لَشَيْءٌ عُجَابٌ } أي: يقضي منه العجب لبطلانه وفساده.\n                                    "
      },
      "originalText": "أَجَعَلَ ٱلۡأٓلِهَةَ إِلَٰهٗا وَٰحِدًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عُجَابٞ ٥"
    },
    {
      "number": 3976,
      "text": "وَانْطَلَقَ الْمَلَأُ مِنْهُمْ أَنِ امْشُوا وَاصْبِرُوا عَلَىٰ آلِهَتِكُمْ ۖ إِنَّ هَٰذَا لَشَيْءٌ يُرَادُ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 6,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ هَٰذَا لَشَيۡءٞ يُرَادُ ٦\n                                    \n                                    \n                                    وهم سادتهم وقادتهم ورؤساؤهم وكبراؤهم قائلين : ( [ أن ] امشوا ) أي : استمروا على دينكم ( واصبروا على آلهتكم ) ولا تستجيبوا لما يدعوكم إليه محمد من التوحيد .\nوقوله : ( إن هذا لشيء يراد ) قال ابن جرير : إن هذا الذي يدعونا إليه محمد - صلى الله عليه وسلم - من التوحيد لشيء يريد به الشرف عليكم والاستعلاء ، وأن يكون له منكم أتباع ولسنا مجيبيه إليه .\nذكر سبب نزول هذه الآيات :\nقال السدي : إن أناسا من قريش اجتمعوا فيهم : أبو جهل بن هشام والعاص بن وائل ، والأسود بن المطلب والأسود بن عبد يغوث في نفر من مشيخة قريش ، فقال بعضهم لبعض : انطلقوا بنا إلى أبي طالب فلنكلمه فيه ، فلينصفنا منه فليكف عن شتم آلهتنا وندعه وإلهه الذي يعبده ; فإنا نخاف أن يموت هذا الشيخ فيكون منا إليه شيء ، فتعيرنا [ به ] العرب يقولون : تركوه حتى إذا مات عنه تناولوه \" . فبعثوا رجلا منهم يقال له المطلب \" فاستأذن لهم على أبي طالب فقال : هؤلاء مشيخة قومك وسراتهم يستأذنون عليك . قال : أدخلهم . فلما دخلوا عليه قالوا : يا أبا طالب أنت كبيرنا وسيدنا فأنصفنا من ابن أخيك فمره فليكف عن شتم آلهتنا وندعه وإلهه . قال : فبعث إليه أبو طالب فلما دخل عليه رسول الله - صلى الله عليه وسلم - قال : يا ابن أخي هؤلاء مشيخة قومك وسراتهم وقد سألوك أن تكف عن شتم آلهتهم ويدعوك وإلهك . قال : \" يا عم أفلا أدعوهم إلى ما هو خير لهم ؟ \" قال : وإلام تدعوهم ؟ قال : \" أدعوهم [ إلى ] أن يتكلموا بكلمة تدين لهم بها العرب ويملكون بها العجم \" . فقال أبو جهل من بين القوم : ما هي وأبيك ؟ لنعطينها وعشرة أمثالها ، قال : تقولون : \" لا إله إلا الله \" . فنفر وقال : سلنا غير هذا ، قال : \" لو جئتموني بالشمس حتى تضعوها في يدي ما سألتكم غيرها \" فقاموا من عنده غضابا ، وقالوا : والله لنشتمنك وإلهك الذي أمرك بهذا . ( وانطلق الملأ منهم أن امشوا واصبروا على آلهتكم إن هذا لشيء يراد )\nرواه ابن أبي حاتم وابن جرير وزاد : فلما خرجوا دعا رسول الله - صلى الله عليه وسلم - عمه إلى قول : \" لا إله إلا الله \" فأبى وقال : بل على دين الأشياخ . ونزلت : ( إنك لا تهدي من أحببت ) [ القصص : 56 ]\nوقال أبو جعفر بن جرير : حدثنا أبو كريب وابن وكيع قالا : حدثنا أبو أسامة حدثنا الأعمش حدثنا عباد عن سعيد بن جبير عن ابن عباس قال : لما مرض أبو طالب دخل عليه رهط من قريش فيهم أبو جهل فقالوا : إن ابن أخيك يشتم آلهتنا ويفعل ويفعل ويقول ويقول فلو بعثت إليه فنهيته ؟ فبعث إليه فجاء النبي - صلى الله عليه وسلم - فدخل البيت وبينهم وبين أبي طالب قدر مجلس رجل قال : فخشي أبو جهل إن جلس إلى جنب أبي طالب أن يكون أرق له عليه . فوثب فجلس في ذلك المجلس ولم يجد رسول الله - صلى الله عليه وسلم - مجلسا قرب عمه فجلس عند الباب . فقال له أبو طالب : أي ابن أخي ما بال قومك يشكونك ، يزعمون أنك تشتم آلهتهم وتقول وتقول ؟ قال : وأكثروا عليه من القول وتكلم رسول الله - صلى الله عليه وسلم - فقال : \" يا عم إني أريدهم على كلمة واحدة ! يقولونها تدين لهم بها العرب وتؤدي إليهم بها العجم الجزية \" ففزعوا لكلمته ولقوله وقالوا كلمة واحدة ! نعم وأبيك عشرا فقالوا : وما هي ؟ وقال أبو طالب وأي كلمة هي يا ابن أخي ؟ فقال : \" لا إله إلا الله \" فقاموا فزعين ينفضون ثيابهم وهم يقولون : ( أجعل الآلهة إلها واحدا إن هذا لشيء عجاب ) قال : ونزلت من هذا الموضع إلى قوله : ( لما يذوقوا عذاب ) لفظ أبي كريب\nوهكذا رواه الإمام أحمد والنسائي من حديث محمد بن عبد الله بن نمير ، كلاهما عن أبي أسامة عن الأعمش عن عباد - غير منسوب - به نحوه . ورواه الترمذي ، والنسائي وابن أبي حاتم وابن جرير أيضا كلهم في تفاسيرهم من حديث سفيان الثوري عن الأعمش عن يحيى بن عمارة الكوفي عن سعيد بن جبير عن ابن عباس فذكر نحوه . وقال الترمذي : حسن .\n                                    ",
        "qortoby": "وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ هَٰذَا لَشَيۡءٞ يُرَادُ ٦\n                                    \n                                    \n                                    قوله تعالى : وانطلق الملأ منهم أن امشوا الملأ الأشراف ، والانطلاق الذهاب بسرعة ، أي : انطلق هؤلاء الكافرون من عند الرسول - عليه السلام - يقول بعضهم لبعض : أن امشوا أي : امضوا على ما كنتم عليه ولا تدخلوا في دينه واصبروا على آلهتكم . وقيل : هو إشارة إلى مشيهم إلى أبي طالب في مرضه كما سبق . وفي رواية محمد بن إسحاق أنهم أبو جهل بن هشام ، وشيبة وعتبة أبناء ربيعة بن عبد شمس ، وأمية بن خلف ، والعاص بن وائل ، وأبو معيط ، وجاءوا إلى أبي طالب فقالوا : أنت سيدنا وأنصفنا في أنفسنا ، فاكفنا أمر ابن أخيك وسفهاء معه ، فقد تركوا آلهتنا وطعنوا في ديننا ، فأرسل أبو طالب إلى النبي - صلى الله عليه وسلم - فقال له : إن قومك يدعونك إلى السواء والنصفة . فقال النبي - صلى الله عليه وسلم - : إنما أدعوهم إلى كلمة واحدة . فقال أبو جهل : وعشرا . قال : تقولون لا إله إلا الله . فقاموا وقالوا : أجعل الآلهة إلها واحدا الآيات . \" أن امشوا \" أن في موضع نصب ، والمعنى بأن امشوا . وقيل : أن بمعنى أي : أي : وانطلق الملأ منهم أي : امشوا ، وهذا تفسير انطلاقهم لا أنهم تكلموا بهذا اللفظ .\nوقيل : المعنى انطلق الأشراف منهم فقالوا للعوام : امشوا واصبروا على آلهتكم أي : على عبادة آلهتكم .\nإن هذا أي هذا الذي جاء به محمد - عليه السلام -\nلشيء يراد أي يراد بأهل الأرض من زوال نعم قوم وغير تنزل بهم . وقيل : إن هذا لشيء يراد كلمة تحذير ، أي : إنما يريد محمد بما يقول الانقياد له ليعلو علينا ، ونكون له أتباعا فيتحكم فينا بما يريد ، فاحذروا أن تطيعوه . وقال مقاتل : إن عمر لما أسلم وقوي به الإسلام شق ذلك على قريش فقالوا : إن إسلام عمر في قوة الإسلام لشيء يراد .\n                                    ",
        "saadi": "وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ هَٰذَا لَشَيۡءٞ يُرَادُ ٦\n                                        \n                                        \n                                        \n                                        { وَانْطَلَقَ الْمَلَأُ مِنْهُمْ } المقبول قولهم، محرضين قومهم على التمسك بما هم عليه من الشرك. { أَنِ امْشُوا وَاصْبِرُوا عَلَى آلِهَتِكُمْ } أى: استمروا عليها، وجاهدوا نفوسكم في الصبر عليها وعلى عبادتها، ولا يردكم عنها راد، ولا يصدنكم عن عبادتها، صاد. { إِنَّ هَذَا } الذي جاء به محمد، من النهي عن عبادتها { لَشَيْءٌ يُرَادُ } أي: يقصد، أي: له قصد ونية غير صالحة في ذلك، وهذه شبهة لا تروج إلا على السفهاء، فإن من دعا إلى قول حق أو غير حق، لا يرد قوله بالقدح في نيته، فنيته وعمله له، وإنما يرد بمقابلته بما يبطله ويفسده، من الحجج والبراهين، وهم قصدهم، أن محمدا، ما دعاكم إلى ما دعاكم، إلا ليرأس فيكم، ويكون معظما عندكم، متبوعا.\n                                    "
      },
      "originalText": "وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُواْ وَٱصۡبِرُواْ عَلَىٰٓ ءَالِهَتِكُمۡۖ إِنَّ هَٰذَا لَشَيۡءٞ يُرَادُ ٦"
    },
    {
      "number": 3977,
      "text": "مَا سَمِعْنَا بِهَٰذَا فِي الْمِلَّةِ الْآخِرَةِ إِنْ هَٰذَا إِلَّا اخْتِلَاقٌ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 7,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَا سَمِعۡنَا بِهَٰذَا فِي ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ ٧\n                                    \n                                    \n                                    وقولهم : ( ما سمعنا بهذا في الملة الآخرة ) أي : ما سمعنا بهذا الذي يدعونا إليه محمد من التوحيد في الملة الآخرة .\nقال مجاهد وقتادة وابن زيد : يعنون دين قريش .\nوقال غيرهم : يعنون النصرانية ، قاله محمد بن كعب والسدي .\nوقال العوفي عن ابن عباس : ( ما سمعنا بهذا في الملة الآخرة ) يعني : النصرانية . قالوا : لو كان هذا القرآن حقا أخبرتنا به النصارى .\n( إن هذا إلا اختلاق ) قال مجاهد ، وقتادة كذب ، وقال ابن عباس : تخرص .\n                                    ",
        "qortoby": "مَا سَمِعۡنَا بِهَٰذَا فِي ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ ٧\n                                    \n                                    \n                                    قوله تعالى : ما سمعنا بهذا في الملة الآخرة قال ابن عباس والقرظي وقتادة ومقاتل والكلبي والسدي : يعنون ملة عيسى النصرانية وهي آخر الملل . والنصارى يجعلون مع الله إلها . وقال مجاهد وقتادة أيضا : يعنون ملة قريش . وقال الحسن : ما سمعنا أن هذا يكون في آخر الزمان . وقيل : أي : ما سمعنا من أهل الكتاب أن محمدا رسول حق .\nإن هذا إلا اختلاق أي كذب وتخرص ، عن ابن عباس وغيره . يقال : خلق واختلق أي : ابتدع . وخلق الله - عز وجل - الخلق من هذا ، أي : ابتدعهم على غير مثال .\n\n                                    ",
        "saadi": "مَا سَمِعۡنَا بِهَٰذَا فِي ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ ٧\n                                        \n                                        \n                                        \n                                        { مَا سَمِعْنَا بِهَذَا } القول الذي قاله، والدين الذي دعا إليه { فِي الْمِلَّةِ الْآخِرَةِ } أي: في الوقت الأخير، فلا أدركنا عليه آباءنا، ولا آباؤنا أدركوا آباءهم عليه، فامضوا على الذي مضى عليه آباؤكم، فإنه الحق، وما هذا الذي دعا إليه محمد إلا اختلاق اختلقه، وكذب افتراه، وهذه أيضا شبهة من جنس شبهتهم الأولى، حيث ردوا الحق بما ليس بحجة لرد أدنى قول، وهو أنه قول مخالف لما عليه آباؤهم الضالون، فأين في هذا ما يدل على بطلانه ؟.\n                                    "
      },
      "originalText": "مَا سَمِعۡنَا بِهَٰذَا فِي ٱلۡمِلَّةِ ٱلۡأٓخِرَةِ إِنۡ هَٰذَآ إِلَّا ٱخۡتِلَٰقٌ ٧"
    },
    {
      "number": 3978,
      "text": "أَأُنْزِلَ عَلَيْهِ الذِّكْرُ مِنْ بَيْنِنَا ۚ بَلْ هُمْ فِي شَكٍّ مِنْ ذِكْرِي ۖ بَلْ لَمَّا يَذُوقُوا عَذَابِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 8,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ ٨\n                                    \n                                    \n                                    وقولهم : ( أؤنزل عليه الذكر من بيننا ) يعني : أنهم يستبعدون تخصيصه بإنزال القرآن عليه من بينهم كلهم كما قالوا في الآية الأخرى : ( لولا نزل هذا القرآن على رجل من القريتين عظيم ) [ الزخرف : 31 ] قال الله تعالى : ( أهم يقسمون رحمة ربك نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات ) [ الزخرف : 32 ] ولهذا لما قالوا هذا الذي دل على جهلهم وقلة عقلهم في استبعادهم إنزال القرآن على الرسول من بينهم ، قال الله تعالى : ( بل لما يذوقوا عذاب ) أي : إنما يقولون هذا ؛ لأنهم ما ذاقوا إلى حين قولهم ذلك عذاب الله ونقمته سيعلمون غب ما قالوا ، وما كذبوا به يوم يدعون إلى نار جهنم دعا .\n                                    ",
        "qortoby": "أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ ٨\n                                    \n                                    \n                                    قوله تعالى : أأنزل عليه الذكر من بيننا هو استفهام إنكار ، والذكر هاهنا القرآن . أنكروا اختصاصه بالوحي من بينهم . فقال الله تعالى : بل هم في شك من ذكري أي : من وحيي وهو القرآن . أي : قد علموا أنك لم تزل صدوقا فيما بينهم ، وإنما شكوا فيما أنزلته عليك هل هو من عندي أم لا .\nبل لما يذوقوا عذاب أي إنما اغتروا بطول الإمهال ، ولو ذاقوا عذابي على الشرك لزال عنهم الشك ، ولما قالوا ذلك ، ولكن لا ينفع الإيمان حينئذ . و \" لما \" بمعنى لم ، وما زائدة كقوله : عما قليل و فبما نقضهم ميثاقهم\n                                    ",
        "saadi": "أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ ٨\n                                        \n                                        \n                                        \n                                        { أَءُنزِلَ عَلَيْهِ الذِّكْرُ مِنْ بَيْنِنَا } أي: ما الذي فضله علينا، حتى ينزل الذكر عليه من دوننا، ويخصه اللّه به؟ وهذه أيضا شبهة، أين البرهان فيها على رد ما قاله؟ وهل جميع الرسل إلا بهذا الوصف، يَمُنُّ اللّه عليهم برسالته، ويأمرهم بدعوة الخلق إلى اللّه، ولهذا، لما كانت هذه الأقوال الصادرة منهم لا يصلح شيء منها لرد ما جاء به الرسول، أخبر تعالى من أين صدرت، وأنهم { فِي شَكٍّ مِنْ ذِكْرِي } ليس عندهم علم ولا بينة.\nفلما وقعوا في الشك وارتضوا به، وجاءهم الحق الواضح، وكانوا جازمين بإقامتهم على شكهم، قالوا ما قالوا من تلك الأقوال لدفع الحق، لا عن بينة من أمرهم، وإنما ذلك من باب الائتفاك منهم.\nومن المعلوم، أن من هو بهذه الصفة يتكلم عن شك وعناد، إن قوله غير مقبول، ولا قادح أدنى قدح في الحق، وأنه يتوجه عليه الذم واللوم بمجرد كلامه، ولهذا توعدهم بالعذاب فقال: { بَلْ لَمَّا يَذُوقُوا عَذَابِ } أي: قالوا هذه الأقوال، وتجرأوا عليها، حيث كانوا ممتعين في الدنيا، لم يصبهم من عذاب اللّه شيء، فلو ذاقوا عذابه، لم يتجرأوا.\n                                    "
      },
      "originalText": "أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ ٨"
    },
    {
      "number": 3979,
      "text": "أَمْ عِنْدَهُمْ خَزَائِنُ رَحْمَةِ رَبِّكَ الْعَزِيزِ الْوَهَّابِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 9,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ ٩\n                                    \n                                    \n                                    ثم قال مبينا أنه المتصرف في ملكه الفعال لما يشاء ، الذي يعطي من يشاء ما يشاء ، ويعز من يشاء ويذل من يشاء ، ويهدي من يشاء ويضل من يشاء ، وينزل الروح من أمره على من يشاء من عباده ، ويختم على قلب من يشاء ، فلا يهديه أحد من بعد الله وإن العباد لا يملكون شيئا من الأمر وليس إليهم من التصرف في الملك ولا مثقال ذرة وما يملكون من قطمير ; ولهذا قال تعالى منكرا عليهم : ( أم عندهم خزائن رحمة ربك العزيز الوهاب ) أي : العزيز الذي لا يرام جنابه ، الوهاب الذي يعطي ما يريد لمن يريد .\nوهذه الآية شبيهة بقوله : ( أم لهم نصيب من الملك فإذا لا يؤتون الناس نقيرا أم يحسدون الناس على ما آتاهم الله من فضله فقد آتينا آل إبراهيم الكتاب والحكمة وآتيناهم ملكا عظيما فمنهم من آمن به ومنهم من صد عنه وكفى بجهنم سعيرا ) [ النساء : 53 : 55 ] وقوله ( قل لو أنتم تملكون خزائن رحمة ربي إذا لأمسكتم خشية الإنفاق وكان الإنسان قتورا ) [ الإسراء : 10 ] وذلك بعد الحكاية عن الكفار أنهم أنكروا بعثة الرسول البشري وكما أخبر تعالى عن قوم صالح [ عليه السلام ] حين قالوا : ( أؤلقي الذكر عليه من بيننا بل هو كذاب أشر سيعلمون غدا من الكذاب الأشر ) [ القمر : 25 : 26 ]\n                                    ",
        "qortoby": "أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ ٩\n                                    \n                                    \n                                    قوله تعالى : أم عندهم خزائن رحمة ربك العزيز الوهاب قيل : أم لهم هذا فيمنعوا محمدا - عليه السلام - مما أنعم الله - عز وجل - به عليه من النبوة . و \" أم \" قد ترد بمعنى التقريع إذا كان الكلام متصلا بكلام قبله ، كقوله تعالى : الم تنزيل الكتاب لا ريب فيه من رب العالمين أم يقولون افتراه وقد قيل إن قوله : أم عندهم خزائن رحمة ربك متصل بقوله : وعجبوا أن جاءهم منذر منهم فالمعنى أن الله - عز وجل - يرسل من يشاء ; لأن خزائن السماوات والأرض له .\n                                    ",
        "saadi": "أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ ٩\n                                        \n                                        \n                                        \n                                        { أَمْ عِنْدَهُمْ خَزَائِنُ رَحْمَةِ رَبِّكَ الْعَزِيزِ الْوَهَّابِ } فيعطون منها من شاءوا، ويمنعون منها من شاءوا، حيث قالوا: { أَءُنزِلَ عَلَيْهِ الذِّكْرُ مِنْ بَيْنِنَا } أي: هذا فضله تعالى ورحمته، وليس ذلك بأيديهم حتى يتحجروا على اللّه.\n                                    "
      },
      "originalText": "أَمۡ عِندَهُمۡ خَزَآئِنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِيزِ ٱلۡوَهَّابِ ٩"
    },
    {
      "number": 3980,
      "text": "أَمْ لَهُمْ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ فَلْيَرْتَقُوا فِي الْأَسْبَابِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 10,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَمۡ لَهُم مُّلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي ٱلۡأَسۡبَٰبِ ٠١\n                                    \n                                    \n                                    وقوله : ( أم لهم ملك السماوات والأرض وما بينهما فليرتقوا في الأسباب ) أي : إن كان لهم ذلك فليصعدوا في الأسباب .\nقال ابن عباس ، ومجاهد وسعيد بن جبير وقتادة وغيرهم : يعني طرق السماء .\nوقال الضحاك : فليصعدوا إلى السماء السابعة .\n                                    ",
        "qortoby": "أَمۡ لَهُم مُّلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي ٱلۡأَسۡبَٰبِ ٠١\n                                    \n                                    \n                                    أم لهم ملك السماوات والأرض وما بينهما أي فإن ادعوا ذلك : فليرتقوا في الأسباب أي فليصعدوا إلى السماوات ، وليمنعوا الملائكة من إنزال الوحي على محمد . يقال : رقي يرقى وارتقى إذا صعد . ورقى يرقي رقيا مثل رمى يرمي رميا من الرقية . قال الربيع بن أنس : الأسباب أرق من الشعر ، وأشد من الحديد ، ولكن لا ترى . والسبب في اللغة كل ما يوصل به إلى المطلوب من حبل أو غيره . وقيل : الأسباب أبواب السماوات التي تنزل الملائكة منها ، قاله مجاهد وقتادة . قال زهير :\nولو رام أسباب السماء بسلم\nوقيل : الأسباب السماوات نفسها ، أي : فليصعدوا سماء سماء . وقال السدي في الأسباب في الفضل والدين . وقيل : أي : فليعلوا في أسباب القوة إن ظنوا أنها مانعة . وهو معنى قول أبي عبيدة . وقيل : الأسباب الحبال ، يعني إن وجدوا حبلا أو سببا يصعدون فيه إلى السماء فليرتقوا ، وهذا أمر توبيخ وتعجيز .\n                                    ",
        "saadi": "أَمۡ لَهُم مُّلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي ٱلۡأَسۡبَٰبِ ٠١\n                                        \n                                        \n                                        \n                                        { أَمْ لَهُمْ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا } بحيث يكونون قادرين على ما يريدون. { فَلْيَرْتَقُوا فِي الْأَسْبَابِ } الموصلة لهم إلى السماء، فيقطعوا الرحمة عن رسول اللّه، فكيف يتكلمون، وهم أعجز خلق اللّه وأضعفهم بما تكلموا به؟! أم قصدهم التحزب والتجند، والتعاون على نصر الباطل وخذلان الحق؟ وهو الواقع فإن هذا المقصود لا يتم لهم، بل سعيهم خائب، وجندهم مهزوم، ولهذا قال: { جُنْدٌ مَا هُنَالِكَ مَهْزُومٌ مِنَ الْأَحْزَابِ }\n                                    "
      },
      "originalText": "أَمۡ لَهُم مُّلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ فَلۡيَرۡتَقُواْ فِي ٱلۡأَسۡبَٰبِ ٠١"
    },
    {
      "number": 3981,
      "text": "جُنْدٌ مَا هُنَالِكَ مَهْزُومٌ مِنَ الْأَحْزَابِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 11,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "جُندٞ مَّا هُنَالِكَ مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ ١١\n                                    \n                                    \n                                    ثم قال : ( جند ما هنالك مهزوم من الأحزاب ) أي : هؤلاء الجند المكذبون الذين هم في عزة وشقاق سيهزمون ويغلبون ويكبتون كما كبت الذين من قبلهم من الأحزاب المكذبين وهذه كقوله : ( أم يقولون نحن جميع منتصر سيهزم الجمع ويولون الدبر ) وكان ذلك يوم بدر ( بل الساعة موعدهم والساعة أدهى وأمر ) [ القمر : 44 : 46 ] .\n                                    ",
        "qortoby": "جُندٞ مَّا هُنَالِكَ مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ ١١\n                                    \n                                    \n                                    ثم وعد نبيه - صلى الله عليه وسلم - النصر عليهم فقال : جند ما هنالك \" ما \" صلة وتقديره : هم جند ، ف \" جند \" خبر ابتداء محذوف . مهزوم أي : مقموع ذليل قد انقطعت حجتهم ; لأنهم لا يصلون إلى أن يقولوا هذا لنا . ويقال : تهزمت القربة إذا انكسرت ، وهزمت الجيش كسرته . والكلام مرتبط بما قبل ، أي : بل الذين كفروا في عزة وشقاق وهم جند من الأحزاب مهزومون ، فلا تغمك عزتهم وشقاقهم ، فإني أهزم جمعهم وأسلب عزهم . وهذا تأنيس للنبي صلى الله عليه وسلم ، وقد فعل بهم هذا في يوم بدر . قال قتادة : وعد الله أنه سيهزمهم وهم بمكة فجاء تأويلها يوم بدر . و \" هنالك \" إشارة لبدر وهو موضع تحزبهم لقتال محمد صلى الله عليه وسلم . وقيل : المراد بالأحزاب الذين أتوا المدينة وتحزبوا على النبي صلى الله عليه وسلم . وقد مضى ذلك في [ الأحزاب ] . والأحزاب الجند ، كما يقال : جند من قبائل شتى . وقيل : أراد بالأحزاب القرون الماضية من الكفار . أي : هؤلاء جند على طريقة أولئك ، كقوله تعالى : فمن شرب منه فليس مني ومن لم يطعمه فإنه مني أي : على ديني ومذهبي . وقال الفراء : المعنى هم جند مغلوب ، أي : ممنوع عن أن يصعد إلى السماء . وقال القتبي : يعني أنهم جند لهذه الآلهة مهزوم ، فهم لا يقدرون على أن يدعوا لشيء من آلهتهم ، ولا لأنفسهم شيئا من خزائن رحمة الله ، ولا من ملك السماوات والأرض .\n                                    ",
        "saadi": "جُندٞ مَّا هُنَالِكَ مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ ١١\n                                        \n                                        \n                                        \n                                        { أَمْ لَهُمْ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا } بحيث يكونون قادرين على ما يريدون. { فَلْيَرْتَقُوا فِي الْأَسْبَابِ } الموصلة لهم إلى السماء، فيقطعوا الرحمة عن رسول اللّه، فكيف يتكلمون، وهم أعجز خلق اللّه وأضعفهم بما تكلموا به؟! أم قصدهم التحزب والتجند، والتعاون على نصر الباطل وخذلان الحق؟ وهو الواقع فإن هذا المقصود لا يتم لهم، بل سعيهم خائب، وجندهم مهزوم، ولهذا قال: { جُنْدٌ مَا هُنَالِكَ مَهْزُومٌ مِنَ الْأَحْزَابِ }\n                                    "
      },
      "originalText": "جُندٞ مَّا هُنَالِكَ مَهۡزُومٞ مِّنَ ٱلۡأَحۡزَابِ ١١"
    },
    {
      "number": 3982,
      "text": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو الْأَوْتَادِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 12,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ ٢١\n                                    \n                                    \n                                    يقول تعالى مخبرا عن هؤلاء القرون الماضية ، وما حل بهم من العذاب والنكال والنقمات في مخالفة الرسل وتكذيب الأنبياء وقد تقدمت قصصهم مبسوطة في أماكن متعددة .\n                                    ",
        "qortoby": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ ٢١\n                                    \n                                    \n                                    قوله تعالى : كذبت قبلهم قوم نوح ذكرها تعزية للنبي - صلى الله عليه وسلم - وتسلية له ، أي : هؤلاء من قومك يا محمد جند من الأحزاب المتقدمين الذين تحزبوا على أنبيائهم ، وقد كانوا أقوى من هؤلاء فأهلكوا . وذكر الله تعالى القوم بلفظ التأنيث ، واختلف أهل العربية في ذلك على قولين : أحدهما : أنه قد يجوز فيه التذكير والتأنيث . الثاني : أنه مذكر اللفظ لا يجوز تأنيثه ، إلا أن يقع المعنى على العشيرة والقبيلة ، فيغلب في اللفظ حكم المعنى المضمر تنبيها عليه ، كقوله تعالى : كلا إنها تذكرة فمن شاء ذكره ولم يقل ذكرها ; لأنه لما كان المضمر فيه مذكرا ذكره ، وإن كان اللفظ مقتضيا للتأنيث . ووصف فرعون بأنه ذو الأوتاد . وقد اختلف في تأويل ذلك ، فقال ابن عباس : المعنى ذو البناء المحكم . وقال الضحاك : كان كثير البنيان ، والبنيان يسمى أوتادا . وعن ابن عباس أيضا وقتادة وعطاء : أنه كانت له أوتاد وأرسان وملاعب يلعب له عليها . وعن الضحاك أيضا : ذو القوة والبطش . وقال الكلبي ومقاتل : كان يعذب الناس بالأوتاد ، وكان إذا غضب على أحد مده مستلقيا بين أربعة أوتاد في الأرض ، ويرسل عليه العقارب والحيات حتى يموت . وقيل : كان يشبح المعذب بين أربع سوار ، كل طرف من أطرافه إلى سارية مضروب فيه وتد من حديد ويتركه حتى يموت . وقيل : ذو الأوتاد أي : ذو الجنود الكثيرة ، فسميت الجنود أوتادا ; لأنهم يقوون أمره كما يقوي الوتد البيت . وقال ابن قتيبة : العرب تقول : هم في عز ثابت الأوتاد ، يريدون دائما شديدا . وأصل هذا أن البيت من بيوت الشعر إنما يثبت ويقوم بالأوتاد . وقال الأسود بن يعفر :\nولقد غنوا فيها بأنعم عيشة في ظل ملك ثابت الأوتاد\nوواحد الأوتاد وتد بالكسر ، وبالفتح لغة . وقال الأصمعي : يقال وتد واتد كما يقال : شغل شاغل . وأنشد [ للشاعر أبي محمد الفقعسي ] :\nلاقت على الماء جذيلا واتدا ولم يكن يخلفها المواعدا\nقال : شبه الرجل بالجذل .\n                                    ",
        "saadi": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ ٢١\n                                        \n                                        \n                                        \n                                        يحذرهم تعالى أن يفعل بهم ما فعل بالأمم من قبلهم، الذين كانوا أعظم قوة منهم وتحزبا على الباطل، { قَوْم نُوحٍ وَعَاد } قوم هود { وَفِرْعَوْنُ ذُو الْأَوْتَادِ } أى: الجنود العظيمة، والقوة الهائلة.\n                                    "
      },
      "originalText": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ ٢١"
    },
    {
      "number": 3983,
      "text": "وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَابُ الْأَيْكَةِ ۚ أُولَٰئِكَ الْأَحْزَابُ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 13,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَثَمُودُ وَقَوۡمُ لُوطٖ وَأَصۡحَٰبُ لۡ‍َٔيۡكَةِۚ أُوْلَٰٓئِكَ ٱلۡأَحۡزَابُ ٣١\n                                    \n                                    \n                                    وقوله : ( أولئك الأحزاب ) أي : كانوا أكثر منكم وأشد قوة وأكثر أموالا وأولادا فما دافع ذلك عنهم من عذاب الله من شيء لما جاء أمر ربك ولهذا قال :\n                                    ",
        "qortoby": "وَثَمُودُ وَقَوۡمُ لُوطٖ وَأَصۡحَٰبُ لۡ‍َٔيۡكَةِۚ أُوْلَٰٓئِكَ ٱلۡأَحۡزَابُ ٣١\n                                    \n                                    \n                                    وثمود وقوم لوط وأصحاب الأيكة أي الغيضة . وقد مضى ذكرها في [ الشعراء ] . وقرأ نافع وابن كثير وابن عامر : \" ليكة \" بفتح اللام والتاء من غير همز . وهمز الباقون وكسروا التاء . وقد تقدم هذا .\nأولئك الأحزاب أي هم الموصوفون بالقوة والكثرة ، كقولك : فلان هو الرجل .\n                                    ",
        "saadi": "وَثَمُودُ وَقَوۡمُ لُوطٖ وَأَصۡحَٰبُ لۡ‍َٔيۡكَةِۚ أُوْلَٰٓئِكَ ٱلۡأَحۡزَابُ ٣١\n                                        \n                                        \n                                        \n                                        { وَثَمُود } قوم صالح، { وَقَوْمُ لُوطٍ وَأَصْحَابُ الْأَيْكَةِ } أي: الأشجار والبساتين الملتفة، وهم قوم شعيب، { أُولَئِكَ الْأَحْزَابُ } الذين اجتمعوا بقوتهم وعَدَدِهمْ وعُدَدِهمْ على رد الحق، فلم تغن عنهم شيئا.\n                                    "
      },
      "originalText": "وَثَمُودُ وَقَوۡمُ لُوطٖ وَأَصۡحَٰبُ لۡ‍َٔيۡكَةِۚ أُوْلَٰٓئِكَ ٱلۡأَحۡزَابُ ٣١"
    },
    {
      "number": 3984,
      "text": "إِنْ كُلٌّ إِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 14,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 391,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ ٤١\n                                    \n                                    \n                                    ( إن كل إلا كذب الرسل فحق عقاب ) فجعل علة هلاكهم هو تكذيبهم بالرسل فليحذر المخاطبون من ذلك أشد الحذر .\n                                    ",
        "qortoby": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ ٤١\n                                    \n                                    \n                                    إن كل بمعنى ما كل . إلا كذب الرسل فحق عقاب أي : فنزل بهم العذاب لذلك التكذيب . وأثبت يعقوب الياء في \" عذابي \" و \" عقابي \" في الحالين وحذفها الباقون في الحالين . ونظير هذه الآية قوله - عز وجل - : وقال الذي آمن يا قوم إني أخاف عليكم مثل يوم الأحزاب مثل دأب قوم نوح وعاد وثمود فسمى هذه الأمم أحزابا .\n                                    ",
        "saadi": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ ٤١\n                                        \n                                        \n                                        \n                                        { إِنْ كُلُّ } من هؤلاء { إِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ } عليهم { عِقَابِ } اللّه، وهؤلاء، ما الذي يطهرهم ويزكيهم، أن لا يصيبهم ما أصاب أولئك.\n                                    "
      },
      "originalText": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ ٤١"
    },
    {
      "number": 3985,
      "text": "وَمَا يَنْظُرُ هَٰؤُلَاءِ إِلَّا صَيْحَةً وَاحِدَةً مَا لَهَا مِنْ فَوَاقٍ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 15,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 392,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا يَنظُرُ هَٰٓؤُلَآءِ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ ٥١\n                                    \n                                    \n                                    وقوله : ( وما ينظر هؤلاء إلا صيحة واحدة ما لها من فواق ) قال مالك عن زيد بن أسلم : أي ليس لها مثنوية أي : ما ينظرون إلا الساعة أن تأتيهم بغتة فقد جاء أشراطها أي : فقد اقتربت ودنت وأزفت وهذه الصيحة هي نفخة الفزع التي يأمر الله إسرافيل أن يطولها ، فلا يبقى أحد من أهل السماوات والأرض إلا فزع إلا من استثنى الله - عز وجل - .\n                                    ",
        "qortoby": "وَمَا يَنظُرُ هَٰٓؤُلَآءِ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ ٥١\n                                    \n                                    \n                                    قوله تعالى : وما ينظر هؤلاء إلا صيحة واحدة ينظر بمعنى ينتظر ، ومنه قوله تعالى : انظرونا نقتبس من نوركم هؤلاء يعني كفار مكة . إلا صيحة واحدة أي : نفخة القيامة . أي : ما ينتظرون بعد ما أصيبوا ببدر إلا صيحة القيامة . وقيل : ما ينتظر أحياؤهم الآن إلا الصيحة التي هي النفخة في الصور ، كما قال تعالى : ما ينظرون إلا صيحة واحدة تأخذهم وهو يخصمون فلا يستطيعون توصية وهذا إخبار عن قرب القيامة والموت . وقيل : أي : ما ينتظر كفار آخر هذه الأمة المتدينين بدين أولئك إلا صيحة واحدة وهي النفخة . وقال عبد الله بن عمرو : لم تكن صيحة في السماء إلا بغضب من الله - عز وجل - على أهل الأرض .\nما لها من فواق أي من ترداد ، عن ابن عباس . مجاهد : ما لها رجوع . قتادة : ما لها من مثنوية . السدي : ما لها من إفاقة . وقرأ حمزة والكسائي : \" ما لها من فواق \" بضم الفاء . الباقون بالفتح . الجوهري : والفواق والفواق ما بين الحلبتين من الوقت ; لأنها تحلب ثم تترك سويعة يرضعها الفصيل لتدر ثم تحلب . يقال : ما أقام عنده إلا فواقا ، وفي الحديث : ( العيادة قدر فواق الناقة ) . وقوله تعالى : ما لها من فواق يقرأ بالفتح والضم أي : ما لها من نظرة وراحة وإفاقة . والفيقة بالكسر اسم اللبن الذي يجتمع بين الحلبتين : صارت الواو ياء لكسر ما قبلها ، قال الأعشى يصف بقرة :\nحتى إذا فيقة في ضرعها اجتمعت جاءت لترضع شق النفس لو رضعا\nوالجمع فيق ثم أفواق ، مثل : شبر وأشبار ، ثم أفاويق . قال ابن همام السلولي :\nوذموا لنا الدنيا وهم يرضعونها أفاويق حتى ما يدر لها ثعل\nوالأفاويق أيضا ما اجتمع في السحاب من ماء ، فهو يمطر ساعة بعد ساعة . وأفاقت الناقة إفاقة أي : اجتمعت الفيقة في ضرعها ، فهي مفيق ومفيقة - عن أبي عمرو - والجمع مفاويق . وقال الفراء وأبو عبيدة وغيرهما : من فواق بفتح الفاء أي : راحة لا يفيقون فيها ، كما يفيق المريض والمغشي عليه . و \" من فواق \" بضم الفاء : من انتظار . وقد تقدم أنهما بمعنى وهو ما بين الحلبتين .\nقلت : والمعنى المراد أنها ممتدة لا تقطيع فيها . وروى أبو هريرة قال : حدثنا رسول الله - صلى الله عليه وسلم - ونحن في طائفة من أصحابه . . . الحديث . وفيه : يأمر الله - عز وجل - إسرافيل بالنفخة الأولى فيقول : انفخ نفخة الفزع ، فيفزع أهل السماوات وأهل الأرض إلا من شاء الله ، ويأمره فيمدها ويديمها ويطولها . يقول الله - عز وجل - : ما ينظر هؤلاء إلا صيحة واحدة ما لها من فواق . . . وذكر الحديث ، خرجه علي بن معبد وغيره كما ذكرناه في كتاب التذكرة .\n                                    ",
        "saadi": "وَمَا يَنظُرُ هَٰٓؤُلَآءِ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ ٥١\n                                        \n                                        \n                                        \n                                        فلينتظروا { صَيْحَةً وَاحِدَةً مَا لَهَا مِنْ فَوَاقٍ } أي: من رجوع ورد، تهلكهم وتستأصلهم إن أقاموا على ما هم عليه.\n                                    "
      },
      "originalText": "وَمَا يَنظُرُ هَٰٓؤُلَآءِ إِلَّا صَيۡحَةٗ وَٰحِدَةٗ مَّا لَهَا مِن فَوَاقٖ ٥١"
    },
    {
      "number": 3986,
      "text": "وَقَالُوا رَبَّنَا عَجِّلْ لَنَا قِطَّنَا قَبْلَ يَوْمِ الْحِسَابِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 16,
      "juz": 23,
      "manzil": 6,
      "page": 453,
      "ruku": 392,
      "hizbQuarter": 181,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُواْ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ ٦١\n                                    \n                                    \n                                    وقوله : ( وقالوا ربنا عجل لنا قطنا قبل يوم الحساب ) هذا إنكار من الله على المشركين في دعائهم على أنفسهم بتعجيل العذاب ، فإن القط هو الكتاب وقيل : هو الحظ والنصيب .\nقال ابن عباس ومجاهد والضحاك والحسن وغير واحد : سألوا تعجيل العذاب - زاد قتادة كما قالوا : ( اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم ) [ الأنفال : 32 ]\nوقيل : سألوا تعجيل نصيبهم من الجنة إن كانت موجودة أن يلقوا ذاك في الدنيا . وإنما خرج هذا منهم مخرج الاستبعاد والتكذيب .\nوقال ابن جرير : سألوا تعجيل ما يستحقونه من الخير أو الشر في الدنيا وهذا الذي قاله جيد ، وعليه يدور كلام الضحاك وإسماعيل بن أبي خالد والله أعلم .\n                                    ",
        "qortoby": "وَقَالُواْ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ ٦١\n                                    \n                                    \n                                    قوله تعالى : وقالوا ربنا عجل لنا قطنا قبل يوم الحساب قال مجاهد : عذابنا . وكذا قال قتادة : نصيبنا من العذاب . الحسن : نصيبنا من الجنة لنتنعم به في الدنيا . وقال سعيد بن جبير . ومعروف في اللغة أن يقال للنصيب قط ، وللكتاب المكتوب بالجائزة قط . قال الفراء : القط في كلام العرب الحظ والنصيب . ومنه قيل للصك قط . وقال أبو عبيدة والكسائي : القط الكتاب بالجوائز ، والجمع القطوط ، قال الأعشى :\nولا الملك النعمان يوم لقيته بغبطته يعطي القطوط ويأفق\nيعني كتب الجوائز . ويروى : بأمته بدل بغبطته ، أي : بنعمته وحاله الجليلة ، ويأفق : يصلح . ويقال : في جمع قط أيضا قططة ، وفي القليل أقط وأقطاط . ذكره النحاس . وقال السدي : سألوا أن يمثل لهم منازلهم من الجنة ليعلموا حقيقة ما يوعدون به . وقال إسماعيل بن أبي خالد : المعنى عجل لنا أرزاقنا . وقيل : معناه عجل لنا ما يكفينا ، من قولهم : قطني ، أي : يكفيني . وقيل : إنهم قالوا ذلك استعجالا لكتبهم التي يعطونها بأيمانهم وشمائلهم حين تلي عليهم بذلك القرآن . وهو قوله تعالى : فأما من أوتي كتابه بيمينه وأما من أوتي كتابه وراء ظهره وأصل القط القط وهو القطع ، ومنه قط القلم ، فالقط اسم للقطعة من الشيء كالقسم والقسم ، فأطلق على النصيب والكتاب والرزق لقطعه عن غيره ، إلا أنه في الكتاب أكثر استعمالا وأقوى حقيقة . قال أمية بن أبي الصلت :\nقوم لهم ساحة العراق وما يجبى إليه والقط والقلم\nقبل يوم الحساب أي قبل يوم القيامة في الدنيا إن كان الأمر كما يقول محمد . وكل هذا استهزاء منهم .\n                                    ",
        "saadi": "وَقَالُواْ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ ٦١\n                                        \n                                        \n                                        \n                                        أي: قال هؤلاء المكذبون، من جهلهم ومعاندتهم الحق، مستعجلين للعذاب: { رَبَّنَا عَجِّلْ لَنَا قِطَّنَا } أي: قسطنا وما قسم لنا من العذاب عاجلا { قَبْلَ يَوْمِ الْحِسَابِ } ولَجُّوا في هذا القول، وزعموا أنك يا محمد، إن كنت صادقا، فعلامة صدقك أن تأتينا بالعذاب\n                                    "
      },
      "originalText": "وَقَالُواْ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ يَوۡمِ ٱلۡحِسَابِ ٦١"
    }
  ]
}