{
  "number": 455,
  "ayahsNumber": 16,
  "ayahs": [
    {
      "number": 3997,
      "text": "وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا ۚ ذَٰلِكَ ظَنُّ الَّذِينَ كَفَرُوا ۚ فَوَيْلٌ لِلَّذِينَ كَفَرُوا مِنَ النَّارِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 27,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ ٧٢\n                                    \n                                    \n                                    يخبر تعالى أنه ما خلق الخلق عبثا وإنما خلقهم ليعبدوه ويوحدوه ثم يجمعهم ليوم الجمع فيثيب المطيع ويعذب الكافر ولهذا قال تعالى : ( وما خلقنا السماء والأرض وما بينهما باطلا ذلك ظن الذين كفروا ) أي : الذين لا يرون بعثا ولا معادا وإنما يعتقدون هذه الدار فقط ، ( فويل للذين كفروا من النار ) أي : ويل لهم يوم معادهم ونشورهم من النار المعدة لهم .\n                                    ",
        "qortoby": "وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ ٧٢\n                                    \n                                    \n                                    قوله تعالى وما خلقنا السماء والأرض وما بينهما باطلا أي هزلا ولعبا . أي : ما خلقناهما إلا لأمر صحيح وهو الدلالة على قدرتنا . ذلك ظن الذين كفروا أي حسبان الذين كفروا أن الله خلقهما باطلا فويل للذين كفروا من النار\n                                    ",
        "saadi": "وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ ٧٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن تمام حكمته في خلقه السماوات والأرض، وأنه لم يخلقهما باطلا، أي: عبثا ولعبا من غير فائدة ولا مصلحة.\n{ ذَلِكَ ظَنُّ الَّذِينَ كَفَرُوا } بربهم، حيث ظنوا ما لا يليق بجلاله. { فَوَيْلٌ لِلَّذِينَ كَفَرُوا مِنَ النَّارِ } فإنها التي تأخذ الحق منهم، وتبلغ منهم كل مبلغ.\nوإنما خلق اللّه السماوات والأرض بالحق وللحق، فخلقهما ليعلم العباد كمال علمه وقدرته وسعة سلطانه، وأنه تعالى وحده المعبود، دون من لم يخلق مثقال ذرة من السماوات والأرض، وأن البعث حق، وسيفصل اللّه بين أهل الخير والشر.\n                                    "
      },
      "originalText": "وَمَا خَلَقۡنَا ٱلسَّمَآءَ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا بَٰطِلٗاۚ ذَٰلِكَ ظَنُّ ٱلَّذِينَ كَفَرُواْۚ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِنَ ٱلنَّارِ ٧٢"
    },
    {
      "number": 3998,
      "text": "أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 28,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ ٨٢\n                                    \n                                    \n                                    ثم بين تعالى أنه من عدله وحكمته لا يساوي بين المؤمن والكافر فقال : ( أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار ) أي : لا نفعل ذلك ولا يستوون عند الله ، وإذا كان الأمر كذلك فلا بد من دار أخرى يثاب فيها هذا المطيع ويعاقب فيها هذا الفاجر . وهذا الإرشاد يدل العقول السليمة والفطر المستقيمة على أنه لا بد من معاد وجزاء فإنا نرى الظالم الباغي يزداد ماله وولده ونعيمه ويموت كذلك ونرى المطيع المظلوم يموت بكمده فلا بد في حكمة الحكيم العليم العادل الذي لا يظلم مثقال ذرة من إنصاف هذا من هذا . وإذا لم يقع هذا في هذه الدار فتعين أن هناك دارا أخرى لهذا الجزاء والمواساة . ولما كان القرآن يرشد إلى المقاصد الصحيحة والمآخذ العقلية الصريحة\n                                    ",
        "qortoby": "أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ ٨٢\n                                    \n                                    \n                                    ثم وبخهم فقال : أم نجعل الذين آمنوا وعملوا الصالحات والميم صلة ، تقديره : أنجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض فكان في هذا رد على المرجئة ; لأنهم يقولون : يجوز أن يكون المفسد كالصالح أو أرفع درجة منه . وبعده أيضا : نجعل المتقين كالفجار أي أنجعل أصحاب محمد - عليه السلام - كالكفار ، قاله ابن عباس . وقيل : هو عام في المسلمين المتقين والفجار الكافرين ، وهو أحسن ، وهو رد على منكري البعث الذين جعلوا مصير المطيع والعاصي إلى شيء واحد .\n                                    ",
        "saadi": "أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ ٨٢\n                                        \n                                        \n                                        \n                                        ولا يظن الجاهل بحكمة اللّه أن يسوي اللّه بينهما في حكمه، ولهذا قال: { أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ } هذا غير لائق بحكمتنا وحكمنا.\n                                    "
      },
      "originalText": "أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ ٨٢"
    },
    {
      "number": 3999,
      "text": "كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِيَدَّبَّرُوا آيَاتِهِ وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 29,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ ٩٢\n                                    \n                                    \n                                    قال : ( كتاب أنزلناه إليك مبارك ليدبروا آياته وليتذكر أولو الألباب ) أي : ذوو العقول وهي الألباب ، جمع لب ، وهو العقل .\nقال الحسن البصري : والله ما تدبره بحفظ حروفه وإضاعة حدوده ، حتى إن أحدهم ليقول : قرأت القرآن [ كله ] ما يرى له القرآن في خلق ولا عمل . رواه ابن أبي حاتم .\n                                    ",
        "qortoby": "كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ ٩٢\n                                    \n                                    \n                                    قوله تعالى : كتاب أي هذا كتاب أنزلناه إليك مبارك يا محمد ليدبروا آياته أي ليتدبروا ، فأدغمت التاء في الدال . وفي هذا دليل على وجوب معرفة معاني القرآن ، ودليل على أن الترتيل أفضل من الهذ ، إذ لا يصح التدبر مع الهذ على ما بيناه في كتاب التذكار . وقال الحسن : تدبر آيات الله اتباعها . وقراءة العامة \" ليدبروا \" . وقرأ أبو حنيفة وشيبة : \" لتدبروا \" بتاء وتخفيف الدال ، وهي قراءة علي - رضي الله عنه - ، والأصل لتتدبروا ، فحذف إحدى التاءين تخفيفا\nوليتذكر أولو الألباب أي أصحاب العقول ، واحدها لب ، وقد جمع على ألب ، كما جمع بؤس على أبؤس ، ونعم على أنعم ، قال أبو طالب :\nقلبي إليه مشرف الألب\nوربما أظهروا التضعيف في ضرورة الشعر ، قال الكميت :\nإليكم ذوي آل النبي تطلعت نوازع من قلبي ظماء وألبب\n                                    ",
        "saadi": "كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ ٩٢\n                                        \n                                        \n                                        \n                                        { كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ مُبَارَكٌ } فيه خير كثير، وعلم غزير، فيه كل هدى من ضلالة، وشفاء من داء، ونور يستضاء به في الظلمات، وكل حكم يحتاج إليه المكلفون، وفيه من الأدلة القطعية على كل مطلوب، ما كان به أجل كتاب طرق العالم منذ أنشأه اللّه.\n{ لِيَدَّبَّرُوا آيَاتِهِ } أي: هذه الحكمة من إنزاله، ليتدبر الناس آياته، فيستخرجوا علمها ويتأملوا أسرارها وحكمها، فإنه بالتدبر فيه والتأمل لمعانيه، وإعادة الفكر فيها مرة بعد مرة، تدرك بركته وخيره، وهذا يدل على الحث على تدبر القرآن، وأنه من أفضل الأعمال، وأن القراءة المشتملة على التدبر أفضل من سرعة التلاوة التي لا يحصل بها هذا المقصود.\n{ وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ } أي: أولو العقول الصحيحة، يتذكرون بتدبرهم لها كل علم ومطلوب، فدل هذا على أنه بحسب لب الإنسان وعقله يحصل له التذكر والانتفاع بهذا الكتاب.\n                                    "
      },
      "originalText": "كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ مُبَٰرَكٞ لِّيَدَّبَّرُوٓاْ ءَايَٰتِهِۦ وَلِيَتَذَكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ ٩٢"
    },
    {
      "number": 4000,
      "text": "وَوَهَبْنَا لِدَاوُودَ سُلَيْمَانَ ۚ نِعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 30,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَوَهَبۡنَا لِدَاوُۥدَ سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ ٠٣\n                                    \n                                    \n                                    يقول تعالى مخبرا أنه وهب لداود سليمان ، أي : نبيا كما قال : ( وورث سليمان داود ) أي : في النبوة وإلا فقد كان له بنون غيره ، فإنه قد كان عنده مائة امرأة حرائر .\nوقوله : ( نعم العبد إنه أواب ) ثناء على سليمان - عليه السلام - بأنه كثير الطاعة والعبادة والإنابة إلى الله - عز وجل - .\nقال ابن أبي حاتم : حدثنا أبي حدثنا محمود بن خالد حدثنا الوليد حدثنا مكحول قال : لما وهب الله لداود سليمان - عليه السلام - قال له : يا بني ما أحسن ؟ قال : سكينة الله وإيمان . قال : فما أقبح ؟ قال : كفر بعد إيمان . قال : فما أحلى ؟ قال : روح الله بين عباده . قال : فما أبرد ؟ قال : عفو الله عن الناس وعفو الناس بعضهم عن بعض . قالداود - عليه السلام - : فأنت نبي .\n                                    ",
        "qortoby": "وَوَهَبۡنَا لِدَاوُۥدَ سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ ٠٣\n                                    \n                                    \n                                    قوله تعالى : ووهبنا لداود سليمان نعم العبد إنه أواب . لما ذكر داود ذكر سليمان و \" أواب \" معناه مطيع\n                                    ",
        "saadi": "وَوَهَبۡنَا لِدَاوُۥدَ سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ ٠٣\n                                        \n                                        \n                                        \n                                        لما أثنى تعالى على داود، وذكر ما جرى له ومنه، أثنى على ابنه سليمان عليهما السلام فقال: { وَوَهَبْنَا لِدَاوُدَ سُلَيْمَانَ } أي: أنعمنا به عليه، وأقررنا به عينه.\n{ نِعْمَ الْعَبْدُ } سليمان عليه السلام، فإنه اتصف بما يوجب المدح، وهو { إِنَّهُ أَوَّابٌ } أي: رجَّاع إلى اللّه في جميع أحواله، بالتأله والإنابة، والمحبة والذكر والدعاء والتضرع، والاجتهاد في مرضاة اللّه، وتقديمها على كل شيء.\n                                    "
      },
      "originalText": "وَوَهَبۡنَا لِدَاوُۥدَ سُلَيۡمَٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٌ ٠٣"
    },
    {
      "number": 4001,
      "text": "إِذْ عُرِضَ عَلَيْهِ بِالْعَشِيِّ الصَّافِنَاتُ الْجِيَادُ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 31,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ عُرِضَ عَلَيۡهِ بِٱلۡعَشِيِّ ٱلصَّٰفِنَٰتُ ٱلۡجِيَادُ ١٣\n                                    \n                                    \n                                    وقوله : ( إذ عرض عليه بالعشي الصافنات الجياد ) أي : إذ عرض على سليمان في حال مملكته وسلطانه الخيل الصافنات .\nقال مجاهد : وهي التي تقف على ثلاث وطرف حافر الرابعة ، والجياد : السراع . وكذا قال غير واحد من السلف .\nوقال ابن جرير : حدثنا محمد بن بشار حدثنا مؤمل حدثنا سفيان عن أبيه سعيد بن مسروق عن إبراهيم التيمي في قوله : ( إذ عرض عليه بالعشي الصافنات الجياد ) قال : كانت عشرين فرسا ذات أجنحة . كذا رواه ابن جرير .\nوقال ابن أبي حاتم : حدثنا أبو زرعة حدثنا إبراهيم بن موسى حدثنا ابن أبي زائدة أخبرني إسرائيل عن سعيد بن مسروق عن إبراهيم التيمي قال : كانت الخيل التي شغلت سليمان ، عليه الصلاة والسلام عشرين ألف فرس ، فعقرها وهذا أشبه والله أعلم .\nوقال أبو داود : حدثنا محمد بن عوف ، حدثنا سعيد بن أبي مريم أخبرنا يحيى بن أيوب حدثني عمارة بن غزية : أن محمد بن إبراهيم حدثه عن أبي سلمة بن عبد الرحمن عن عائشة - رضي الله عنها - قالت : قدم رسول الله - صلى الله عليه وسلم - من غزوة تبوك - أو خيبر - وفي سهوتها ستر فهبت الريح فكشفت ناحية الستر عن بنات لعائشة - لعب - فقال : \" ما هذا يا عائشة ؟ \" قالت : بناتي . ورأى بينهن فرسا له جناحان من رقاع فقال : \" ما هذا الذي أرى وسطهن ؟ \" قالت : فرس . قال : \" وما هذا الذي عليه ؟ \" قالت : جناحان قال : \" فرس له جناحان ؟ ! \" قالت : أما سمعت أن لسليمان خيل لها أجنحة ؟ قالت : فضحك حتى رأيت نواجذه - صلى الله عليه وسلم -\n                                    ",
        "qortoby": "إِذۡ عُرِضَ عَلَيۡهِ بِٱلۡعَشِيِّ ٱلصَّٰفِنَٰتُ ٱلۡجِيَادُ ١٣\n                                    \n                                    \n                                    . إذ عرض عليه بالعشي الصافنات الجياد يعني الخيل ، جمع جواد ، للفرس إذا كان شديد الحضر ، كما يقال للإنسان جواد إذا كان كثير العطية غزيرها ، يقال : قوم أجواد وخيل جياد ، جاد الرجل بماله يجود جودا فهو جواد ، وقوم جود مثال قذال وقذل ، وإنما سكنت الواو لأنها حرف علة ، وأجواد وأجاود وجوداء ، وكذلك امرأة جواد ونسوة جود مثل نوار ونور ، قال الشاعر : [ هو أبو شهاب الهذلي ]\nصناع بإشفاها حصان بشكرها جواد بقوت البطن والعرق زاخر\nوتقول : سرنا عقبة جوادا ، وعقبتين جوادين ، وعقبا جيادا . وجاد الفرس أي : صار رائعا يجود جودة بالضم فهو جواد للذكر والأنثى ، من خيل جياد وأجياد وأجاويد . وقيل : إنها الطوال الأعناق مأخوذ من الجيد وهو العنق ; لأن طول الأعناق في الخيل من صفات فراهتها . وفي الصافنات أيضا وجهان : أحدهما أن صفونها قيامها . قال القتبي والفراء : الصافن في كلام العرب الواقف من الخيل أو غيرها . ومنه ما روي عن النبي - صلى الله عليه وسلم - أنه قال : من سره أن يقوم له الرجال صفونا فليتبوأ مقعده من النار أي : يديمون له القيام ، حكاه قطرب أيضا وأنشد قول النابغة :\nلنا قبة مضروبة بفنائها عتاق المهارى والجياد الصوافن\nوهذا قول قتادة . الثاني : أن صفونها رفع إحدى اليدين على طرف الحافر حتى يقوم على ثلاث ، كما قال الشاعر :\nألف الصفون فما يزال كأنه مما يقوم على الثلاث كسيرا\nوقال عمرو بن كلثوم :\nتركنا الخيل عاكفة عليه مقلدة أعنتها صفونا\nوهذا قول مجاهد . قال الكلبي : غزا سليمان أهل دمشق ونصيبين فأصاب منهم ألف فرس . وقال مقاتل : ورث سليمان من أبيه داود ألف فرس ، وكان أبوه أصابها من العمالقة . وقال الحسن : بلغني أنها كانت خيلا خرجت من البحر لها أجنحة . وقاله الضحاك . وأنها كانت خيلا أخرجت لسليمان من البحر منقوشة ذات أجنحة . ابن زيد : أخرج الشيطان لسليمان الخيل من البحر من مروج البحر ، وكانت لها أجنحة . وكذلك قال علي - رضي الله عنه - : كانت عشرين فرسا ذوات أجنحة . وقيل : كانت مائة فرس . وفي الخبر عن إبراهيم التيمي : أنها كانت عشرين ألفا ، فالله أعلم .\n                                    ",
        "saadi": "إِذۡ عُرِضَ عَلَيۡهِ بِٱلۡعَشِيِّ ٱلصَّٰفِنَٰتُ ٱلۡجِيَادُ ١٣\n                                        \n                                        \n                                        \n                                        لما عرضت عليه الخيل الجياد السبق الصافنات أي: التي من وصفها الصفون، وهو رفع إحدى قوائمها عند الوقوف، وكان لها منظر رائق، وجمال معجب، خصوصا للمحتاج إليها كالملوك، فما زالت تعرض عليه حتى غابت الشمس في الحجاب، فألهته عن صلاة المساء وذكره.\n                                    "
      },
      "originalText": "إِذۡ عُرِضَ عَلَيۡهِ بِٱلۡعَشِيِّ ٱلصَّٰفِنَٰتُ ٱلۡجِيَادُ ١٣"
    },
    {
      "number": 4002,
      "text": "فَقَالَ إِنِّي أَحْبَبْتُ حُبَّ الْخَيْرِ عَنْ ذِكْرِ رَبِّي حَتَّىٰ تَوَارَتْ بِالْحِجَابِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 32,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَقَالَ إِنِّيٓ أَحۡبَبۡتُ حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ ٢٣\n                                    \n                                    \n                                    وقوله : ( فقال إني أحببت حب الخير عن ذكر ربي حتى توارت بالحجاب ) ذكر غير واحد من السلف والمفسرين أنه اشتغل بعرضها حتى فات وقت صلاة العصر والذي يقطع به أنه لم يتركها عمدا بل نسيانا كما شغل النبي - صلى الله عليه وسلم - يوم الخندق عن صلاة العصر حتى صلاها بعد الغروب وذلك ثابت في الصحيحين من غير وجه ، من ذلك عن جابر قال : جاء عمر ، رضي الله عنه يوم الخندق بعد ما غربت الشمس فجعل يسب كفار قريش ، ويقول : يا رسول الله ، والله ما كدت أصلي العصر حتى كادت الشمس تغرب . فقال رسول الله - صلى الله عليه وسلم - : \" والله ما صليتها \" فقال : فقمنا إلى بطحان فتوضأ للصلاة وتوضأنا لها فصلى العصر بعد ما غربت الشمس ثم صلى بعدها المغرب\nويحتمل أنه كان سائغا في ملتهم تأخير الصلاة لعذر الغزو والقتال . والخيل تراد للقتال . وقد ادعى طائفة من العلماء أن هذا كان مشروعا فنسخ ذلك بصلاة الخوف ومنهم من ذهب إلى ذلك في حال المسايفة والمضايقة ، حيث لا يمكن صلاة ولا ركوع ولا سجود كما فعل الصحابة رضي الله عنهم في فتح تستر ، وهو منقول عن مكحول والأوزاعي وغيرهما والأول أقرب ; لأنه قال بعدها : ( ردوها علي فطفق مسحا بالسوق والأعناق )\nقال الحسن البصري . قال : لا والله لا تشغليني عن عبادة ربي آخر ما عليك . ثم أمر بها فعقرت . وكذا قال قتادة .\nوقال السدي : ضرب أعناقها وعراقيبها بالسيوف .\nوقال علي بن أبي طلحة عن ابن عباس : جعل يمسح أعراف الخيل ، وعراقيبها حبالها . وهذا القول اختاره ابن جرير قال : لأنه لم يكن ليعذب حيوانا بالعرقبة ويهلك مالا من ماله بلا سبب سوى أنه اشتغل عن صلاته بالنظر إليها ولا ذنب لها . وهذا الذي رجح به ابن جرير فيه نظر ; لأنه قد يكون في شرعهم جواز مثل هذا ولا سيما إذا كان غضبا لله - عز وجل - بسبب أنه اشتغل بها حتى خرج وقت الصلاة ; ولهذا لما خرج عنها لله تعالى عوضه الله تعالى ما هو خير منها وهي الريح التي تجري بأمره رخاء حيث أصاب غدوها شهر ورواحها شهر فهذا أسرع وخير من الخيل\nوقال الإمام أحمد : حدثنا إسماعيل حدثنا سليمان بن المغيرة عن حميد بن هلال عن أبي قتادة وأبي الدهماء - وكانا يكثران السفر نحو البيت - قالا أتينا على رجل من أهل البادية ، فقال البدوي : أخذ بيدي رسول الله - صلى الله عليه وسلم - فجعل يعلمني مما علمه الله تعالى وقال : \" إنك لا تدع شيئا اتقاء الله - عز وجل - إلا أعطاك الله خيرا منه \"\n                                    ",
        "qortoby": "فَقَالَ إِنِّيٓ أَحۡبَبۡتُ حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ ٢٣\n                                    \n                                    \n                                    فقال إني أحببت حب الخير عن ذكر ربي يعني بالخير الخيل ، والعرب تسميها كذلك ، وتعاقب بين الراء واللام ، فتقول : انهملت العين وانهمرت ، وختلت وخترت إذا خدعت . قال الفراء : الخير في كلام العرب والخيل واحد . النحاس : في الحديث : الخيل معقود في نواصيها الخير إلى يوم القيامة فكأنها سميت خيرا لهذا . وفي الحديث : لما وفد زيد الخيل على النبي - صلى الله عليه وسلم - ، قال له : أنت زيد الخير وهو زيد بن مهلهل الشاعر . وقيل : إنما سميت خيرا لما فيها من المنافع . وفي الخبر : إن الله تعالى عرض على آدم جميع الدواب ، وقيل له : اختر منها واحدا ، فاختار الفرس ، فقيل له : اخترت عزك ، فصار اسمه الخير من هذا الوجه . وسمي خيلا ; لأنها موسومة بالعز . وسمي فرسا لأنه يفترس مسافات الجو افتراس الأسد وثبانا ، ويقطعها كالالتهام بيديه على كل شيء خبطا وتناولا . وسمي عربيا لأنه جيء به من بعد آدم لإسماعيل جزاء عن رفع قواعد البيت ، وإسماعيل عربي ، فصارت له نحلة من الله ، فسمي عربيا . و \" حب \" مفعول في قول الفراء . والمعنى إني آثرت حب الخير . وغيره يقدره مصدرا أضيف إلى المفعول ، أي : أحببت الخير حبا فألهاني عن ذكر ربي . وقيل : إن معنى أحببت قعدت وتأخرت ، من قولهم : أحب البعير إذا برك وتأخر . وأحب فلان أي : طأطأ رأسه . قال أبو زيد : يقال : بعير محب ، وقد أحب إحبابا ، وهو أن يصيبه مرض أو كسر فلا يبرح مكانه حتى يبرأ أو يموت . وقال ثعلب : يقال أيضا للبعير الحسير محب ، فالمعنى قعدت عن ذكر ربي . و \" حب \" على هذا مفعول له . وذكر أبو الفتح الهمداني في كتاب التبيان : أحببت بمعنى لزمت ، من قوله :\nمثل بعير السوء إذ أحبا\nحتى توارت بالحجاب يعني الشمس ، كناية عن غير مذكور ، مثل قوله تعالى : ما ترك على ظهرها من دابة أي على ظهر الأرض ، وتقول العرب : هاجت باردة أي : هاجت الريح باردة . وقال الله تعالى : فلولا إذا بلغت الحلقوم أي : بلغت النفس الحلقوم . وقال تعالى : إنها ترمي بشرر كالقصر ولم يتقدم للنار ذكر . وقال الزجاج : إنما يجوز الإضمار إذا جرى ذكر الشيء أو دليل الذكر ، وقد جرى هاهنا الدليل وهو قوله : بالعشي . والعشي ما بعد الزوال ، والتواري الاستتار عن الأبصار ، والحجاب جبل أخضر محيط بالخلائق ، قاله قتادة وكعب . وقيل : هو جبل قاف . وقيل : جبل دون قاف . والحجاب الليل ، سمي حجابا لأنه يستر ما فيه . وقيل : حتى توارت أي : الخيل في المسابقة . وذلك أن سليمان كان له ميدان مستدير يسابق فيه بين الخيل ، حتى توارت عنه وتغيب عن عينه في المسابقة ; لأن الشمس لم يجر لها ذكر . وذكر النحاس أن سليمان - عليه السلام - كان في صلاة فجيء إليه بخيل لتعرض عليه قد غنمت فأشار بيده لأنه كان يصلي حتى توارت الخيل وسترتها جدر الإصطبلات .\n                                    ",
        "saadi": "فَقَالَ إِنِّيٓ أَحۡبَبۡتُ حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ ٢٣\n                                        \n                                        \n                                        \n                                        فقال ندما على ما مضى منه، وتقربا إلى اللّه بما ألهاه عن ذكره، وتقديما لحب اللّه على حب غيره: { إِنِّي أَحْبَبْتُ حُبَّ الْخَيْرِ } وضمن { أحببت } معنى { آثرت } أي: آثرت حب الخير، الذي هو المال عموما، وفي هذا الموضع المراد الخيل { عَنْ ذِكْرِ رَبِّي حَتَّى تَوَارَتْ بِالْحِجَابِ }\n                                    "
      },
      "originalText": "فَقَالَ إِنِّيٓ أَحۡبَبۡتُ حُبَّ ٱلۡخَيۡرِ عَن ذِكۡرِ رَبِّي حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ ٢٣"
    },
    {
      "number": 4003,
      "text": "رُدُّوهَا عَلَيَّ ۖ فَطَفِقَ مَسْحًا بِالسُّوقِ وَالْأَعْنَاقِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 33,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ ٣٣\n                                    \n                                    \n                                    وقوله : ( فقال إني أحببت حب الخير عن ذكر ربي حتى توارت بالحجاب ) ذكر غير واحد من السلف والمفسرين أنه اشتغل بعرضها حتى فات وقت صلاة العصر والذي يقطع به أنه لم يتركها عمدا بل نسيانا كما شغل النبي - صلى الله عليه وسلم - يوم الخندق عن صلاة العصر حتى صلاها بعد الغروب وذلك ثابت في الصحيحين من غير وجه ، من ذلك عن جابر قال : جاء عمر ، رضي الله عنه يوم الخندق بعد ما غربت الشمس فجعل يسب كفار قريش ، ويقول : يا رسول الله ، والله ما كدت أصلي العصر حتى كادت الشمس تغرب . فقال رسول الله - صلى الله عليه وسلم - : \" والله ما صليتها \" فقال : فقمنا إلى بطحان فتوضأ للصلاة وتوضأنا لها فصلى العصر بعد ما غربت الشمس ثم صلى بعدها المغرب\nويحتمل أنه كان سائغا في ملتهم تأخير الصلاة لعذر الغزو والقتال . والخيل تراد للقتال . وقد ادعى طائفة من العلماء أن هذا كان مشروعا فنسخ ذلك بصلاة الخوف ومنهم من ذهب إلى ذلك في حال المسايفة والمضايقة ، حيث لا يمكن صلاة ولا ركوع ولا سجود كما فعل الصحابة رضي الله عنهم في فتح تستر ، وهو منقول عن مكحول والأوزاعي وغيرهما والأول أقرب ; لأنه قال بعدها : ( ردوها علي فطفق مسحا بالسوق والأعناق )\nقال الحسن البصري . قال : لا والله لا تشغليني عن عبادة ربي آخر ما عليك . ثم أمر بها فعقرت . وكذا قال قتادة .\nوقال السدي : ضرب أعناقها وعراقيبها بالسيوف .\nوقال علي بن أبي طلحة عن ابن عباس : جعل يمسح أعراف الخيل ، وعراقيبها حبالها . وهذا القول اختاره ابن جرير قال : لأنه لم يكن ليعذب حيوانا بالعرقبة ويهلك مالا من ماله بلا سبب سوى أنه اشتغل عن صلاته بالنظر إليها ولا ذنب لها . وهذا الذي رجح به ابن جرير فيه نظر ; لأنه قد يكون في شرعهم جواز مثل هذا ولا سيما إذا كان غضبا لله - عز وجل - بسبب أنه اشتغل بها حتى خرج وقت الصلاة ; ولهذا لما خرج عنها لله تعالى عوضه الله تعالى ما هو خير منها وهي الريح التي تجري بأمره رخاء حيث أصاب غدوها شهر ورواحها شهر فهذا أسرع وخير من الخيل\nوقال الإمام أحمد : حدثنا إسماعيل حدثنا سليمان بن المغيرة عن حميد بن هلال عن أبي قتادة وأبي الدهماء - وكانا يكثران السفر نحو البيت - قالا أتينا على رجل من أهل البادية ، فقال البدوي : أخذ بيدي رسول الله - صلى الله عليه وسلم - فجعل يعلمني مما علمه الله تعالى وقال : \" إنك لا تدع شيئا اتقاء الله - عز وجل - إلا أعطاك الله خيرا منه \"\n                                    ",
        "qortoby": "رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ ٣٣\n                                    \n                                    \n                                    فلما فرغ من صلاته قال : ردوها علي فطفق مسحا أي : فأقبل يمسحها مسحا . وفي معناه قولان : أحدهما أنه أقبل يمسح سوقها وأعناقها بيده إكراما منه لها ، وليري أن الجليل لا يقبح أن يفعل مثل هذا بخيله . وقال قائل هذا القول : كيف يقتلها وفي ذلك إفساد المال ومعاقبة من لا ذنب له ؟ . وقيل : المسح هاهنا هو القطع ، أذن له في قتلها . قال الحسن والكلبي ومقاتل : صلى سليمان الصلاة الأولى وقعد على كرسيه وهي تعرض عليه ، وكانت ألف فرس ، فعرض عليه منها تسعمائة فتنبه لصلاة العصر ، فإذا الشمس قد غربت وفاتت الصلاة ، ولم يعلم بذلك هيبة له فاغتم ، فقال : ردوها علي فردت فعقرها بالسيف قربة لله ، وبقي منها مائة ، فما في أيدي الناس من الخيل العتاق اليوم فهي من نسل تلك الخيل . قال القشيري : وقيل : ما كان في ذلك الوقت صلاة الظهر ولا صلاة العصر ، بل كانت تلك الصلاة نافلة فشغل عنها . وكان سليمان - عليه السلام - رجلا مهيبا ، فلم يذكره أحد ما نسي من الفرض أو النفل وظنوا التأخر مباحا ، فتذكر سليمان تلك الصلاة الفائتة ، وقال على سبيل التلهف : إني أحببت حب الخير عن ذكر ربي أي : عن الصلاة ، وأمر برد الأفراس إليه ، وأمر بضرب عراقيبها وأعناقها ، ولم يكن ذلك معاقبة للأفراس ، إذ ذبح البهائم جائز إذا كانت مأكولة ، بل عاقب نفسه حتى لا تشغله الخيل بعد ذلك عن الصلاة . ولعله عرقبها ليذبحها فحبسها بالعرقبة عن النفار ، ثم ذبحها في الحال ، ليتصدق بلحمها ، أو لأن ذلك كان مباحا في شرعه فأتلفها لما شغلته عن ذكر الله ، حتى يقطع عن نفسه ما يشغله عن الله ، فأثنى الله عليه بهذا ، وبين أنه أثابه بأن سخر له الريح ، فكان يقطع عليها من المسافة في يوم ما يقطع مثله على الخيل في شهرين غدوا ورواحا . وقد قيل : إن الهاء في قوله : ردوها علي للشمس لا للخيل . قال ابن عباس : سألت عليا عن هذه الآية فقال : ما بلغك فيها ؟ فقلت : سمعت كعبا يقول : إن سليمان لما اشتغل بعرض الأفراس حتى توارت الشمس بالحجاب وفاتته الصلاة ، قال : إني أحببت حب الخير عن ذكر ربي أي : آثرت حب الخير عن ذكر ربي الآية ردوها علي يعني الأفراس ، وكانت أربع عشرة ، فضرب سوقها وأعناقها بالسيف ، وأن الله سلبه ملكه أربعة عشر يوما ; لأنه ظلم الخيل . فقال علي بن أبي طالب : كذب كعب لكن سليمان اشتغل بعرض الأفراس للجهاد حتى توارت أي : غربت الشمس بالحجاب ، فقال بأمر الله للملائكة الموكلين بالشمس : ردوها يعني الشمس ، فردوها حتى صلى العصر في وقتها ، وأن أنبياء الله لا يظلمون لأنهم معصومون .\nقلت : الأكثر في التفسير أن التي توارت بالحجاب هي الشمس ، وتركها لدلالة السامع عليها بما ذكر مما يرتبط بها ويتعلق بذكرها ، حسب ما تقدم بيانه . وكثيرا ما يضمرون الشمس ، قال لبيد :\nحتى إذا ألقت يدا في كافر وأجن عورات الثغور ظلامها\nوالهاء في ردوها للخيل ، ومسحها قال الزهري وابن كيسان : كان يمسح سوقها وأعناقها ، ويكشف الغبار عنها حبا لها . وقال الحسن وقتادة وابن عباس . وفي الحديث أن النبي - صلى الله عليه وسلم - رئي وهو يمسح فرسه بردائه . وقال : إني عوتبت الليلة في الخيل خرجه الموطأ عن يحيى بن سعيد مرسلا . وهو في غير الموطأ مسند متصل عن مالك عن يحيى بن سعيد عن أنس . وقد مضى في [ الأنفال ] قوله - عليه السلام - : وامسحوا بنواصيها وأكفالها وروى ابن وهب عن مالك أنه مسح أعناقها وسوقها بالسيوف .\nقلت : وقد استدل الشبلي وغيره من الصوفية في تقطيع ثيابهم وتخريقها بفعل سليمان هذا . وهو استدلال فاسد ; لأنه لا يجوز أن ينسب إلى نبي معصوم أنه فعل الفساد . والمفسرون اختلفوا في معنى الآية ، فمنهم من قال : مسح على أعناقها وسوقها إكراما لها ، وقال : أنت في سبيل الله ، فهذا إصلاح . ومنهم من قال : عرقبها ثم ذبحها ، وذبح الخيل وأكل لحمها جائز .\nوقد مضى في [ النحل ] بيانه . وعلى هذا فما فعل شيئا عليه فيه جناح . فأما إفساد ثوب صحيح لا لغرض صحيح فإنه لا يجوز . ومن الجائز أن يكون في شريعة سليمان جواز ما فعل ، ولا يكون في شرعنا . وقد قيل : إنما فعل بالخيل ما فعل بإباحة الله - جل وعز - له ذلك . وقد قيل : إن مسحه إياها وسمها بالكي وجعلها في سبيل الله ، فالله أعلم . وقد ضعف هذا القول من حيث إن السوق ليست بمحل للوسم بحال . وقد يقال : الكي على الساق علاط ، وعلى العنق وثاق . والذي في الصحاح للجوهري : علط البعير علطا كواه في عنقه بسمة العلاط . والعلاطان جانبا العنق .\nقلت : ومن قال إن الهاء في ردوها ترجع للشمس فذلك من معجزاته . وقد اتفق مثل ذلك لنبينا صلى الله عليه وسلم . خرج الطحاوي في مشكل الحديث عن أسماء بنت عميس من طريقين أن النبي - صلى الله عليه وسلم - كان يوحى إليه ورأسه في حجر علي ، فلم يصل العصر حتى غربت الشمس ، فقال رسول الله - صلى الله عليه وسلم - : أصليت يا علي قال : لا . فقال رسول الله - صلى الله عليه وسلم - : اللهم إنه كان في طاعتك وطاعة رسولك فاردد عليه الشمس . قالت أسماء : فرأيتها غربت ثم رأيتها بعدما غربت طلعت على الجبال والأرض ، وذلك بالصهباء في خيبر . قال الطحاوي : وهذان الحديثان ثابتان ، ورواتهما ثقات .\nقلت : وضعف أبو الفرج ابن الجوزي هذا الحديث فقال : وغلو الرافضة في حب علي - عليه السلام - حملهم على أن وضعوا أحاديث كثيرة في فضائله ، منها أن الشمس غابت ففاتت عليا - عليه السلام - العصر فردت له الشمس ، وهذا من حيث النقل محال ، ومن حيث المعنى فإن الوقت قد فات وعودها طلوع متجدد لا يرد الوقت . ومن قال : إن الهاء ترجع إلى الخيل ، وأنها كانت تبعد عن عين سليمان في السباق ، ففيه دليل على المسابقة بالخيل ، وهو أمر مشروع . وقد مضى القول فيه في [ يوسف ] .\n                                    ",
        "saadi": "رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ ٣٣\n                                        \n                                        \n                                        \n                                        { رُدُّوهَا عَلَيَّ } فردوها { فَطَفِقَ } فيها { مَسْحًا بِالسُّوقِ وَالْأَعْنَاقِ } أي: جعل يعقرها بسيفه، في سوقها وأعناقها.\n                                    "
      },
      "originalText": "رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ ٣٣"
    },
    {
      "number": 4004,
      "text": "وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ جَسَدًا ثُمَّ أَنَابَ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 34,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ ٤٣\n                                    \n                                    \n                                    يقول تعالى : ( ولقد فتنا سليمان ) أي : اختبرناه بأن سلبناه الملك مرة ، ( وألقينا على كرسيه جسدا ) قال ابن عباس ، ومجاهد وسعيد بن جبير والحسن وقتادة وغيرهم : يعني شيطانا . ( ثم أناب ) أي : رجع إلى ملكه وسلطانه وأبهته .\nقال ابن جرير : وكان اسم ذلك الشيطان صخرا . قاله ابن عباس ، وقتادة . وقيل : آصف . قاله مجاهد وقيل : آصروا . قاله مجاهد أيضا . وقيل : حبقيق . قاله السدي . وقد ذكروا هذه القصة مبسوطة ومختصرة .\nوقد قال سعيد بن أبي عروبة عن قتادة : قال أمر سليمان - عليه السلام - ببناء بيت المقدس فقيل له : ابنه ولا يسمع فيه صوت حديد . فقال : فطلب ذلك فلم يقدر عليه . فقيل له : إن شيطانا في البحر يقال له : \" صخر \" شبه المارد . قال : فطلبه وكانت عين في البحر يردها في كل سبعة أيام مرة فنزح ماؤها وجعل فيها خمر ، فجاء يوم ورده فإذا هو بالخمر فقال : إنك لشراب طيب إلا أنك تصبين الحليم ، وتزيدين الجاهل جهلا . ثم رجع حتى عطش عطشا شديدا ثم أتاها فقال : إنك لشراب طيب إلا أنك تصبين الحليم ، وتزيدين الجاهل جهلا . ثم شربها حتى غلبت على عقله ، قال : فأري الخاتم أو ختم به بين كتفيه فذل . قال : وكان ملكه في خاتمه فأتي به سليمان فقال : إنه قد أمرنا ببناء هذا البيت وقيل لنا : لا يسمعن فيه صوت حديد . قال : فأتى ببيض الهدهد فجعل عليه زجاجة فجاء الهدهد فدار حولها ، فجعل يرى بيضه ولا يقدر عليه فذهب فجاء بالماس فوضعه عليه فقطعها به حتى أفضى إلى بيضه . فأخذ الماس فجعلوا يقطعون به الحجارة . وكان سليمان [ عليه السلام ] إذا أراد أن يدخل الخلاء - أو : الحمام - لم يدخل بخاتمه فانطلق يوما إلى الحمام وذلك الشيطان صخر معه ، وذلك عند مقارفة قارف فيه بعض نسائه . قال : فدخل الحمام وأعطى الشيطان خاتمه فألقاه في البحر فالتقمته سمكة ، ونزع ملك سليمان منه وألقي على الشيطان شبه سليمان . قال : فجاء فقعد على كرسيه وسريره وسلط على ملك سليمان كله غير نسائه . قال : فجعل يقضي بينهم ، وجعلوا ينكرون منه أشياء حتى قالوا : لقد فتن نبي الله . وكان فيهم رجل يشبهونه بعمر بن الخطاب في القوة فقال : والله لأجربنه . قال : فقال : يا نبي الله - وهو لا يرى إلا أنه نبي الله - أحدنا تصيبه الجنابة في الليلة الباردة فيدع الغسل عمدا حتى تطلع الشمس أترى عليه بأسا ؟ فقال : لا . قال : فبينا هو كذلك أربعين ليلة حتى وجد نبي الله خاتمه في بطن سمكة فأقبل فجعل لا يستقبله جني ولا طير إلا سجد له حتى انتهى إليهم ، ( وألقينا على كرسيه جسدا ) قال : هو الشيطان صخر\nوقال السدي : ( ولقد فتنا سليمان ) أي : ابتلينا سليمان ، ( وألقينا على كرسيه جسدا ) قال : جلس الشيطان على كرسيه أربعين يوما . قال : وكان لسليمان - عليه السلام - مائة امرأة وكانت امرأة منهن يقال لها : \" جرادة \" ، وهي آثر نسائه وآمنهن عنده وكان إذا أجنب أو أتى حاجة نزع خاتمه ولم يأتمن عليه أحدا من الناس غيرها فأعطاها يوما خاتمه ودخل الخلاء فخرج الشيطان في صورته فقال : هاتي الخاتم . فأعطته فجاء حتى جلس على مجلس سليمان وخرج سليمان بعد ذلك فسألها أن تعطيه خاتمه ، فقالت : ألم تأخذه قبل ؟ قال : لا . وخرج مكانه تائها . قال : ومكث الشيطان يحكم بين الناس أربعين يوما ، قال : فأنكر الناس أحكامه فاجتمع قراء بني إسرائيل وعلماؤهم فجاءوا حتى دخلوا على نسائه فقالوا : إنا قد أنكرنا هذا فإن كان سليمان فقد ذهب عقله وأنكرنا أحكامه . قال : فبكى النساء عند ذلك قال : فأقبلوا يمشون حتى أتوا فأحدقوا به ثم نشروا التوراة فقرءوا . قال : فطار من بين أيديهم حتى وقع على شرفة والخاتم معه . ثم طار حتى ذهب إلى البحر فوقع الخاتم منه في البحر فابتلعه حوت من حيتان البحر . قال : وأقبل سليمان في حاله التي كان فيها حتى انتهى إلى صياد من صيادي البحر وهو جائع وقد اشتد جوعه . فاستطعمهم من صيدهم وقال : إني أنا سليمان . فقام إليه بعضهم فضربه بعصا فشجه فجعل يغسل دمه وهو على شاطئ البحر فلام الصيادون صاحبهم الذي ضربه فقالوا بئس ما صنعت حيث ضربته . قال : إنه زعم أنه سليمان . قال : فأعطوه سمكتين مما قد مذر عندهم فلم يشغله ما كان به من الضرب حتى قام إلى شط البحر فشق بطونهما فجعل يغسل [ دمه ] فوجد خاتمه في بطن إحداهما فأخذه فلبسه فرد الله عليه بهاءه وملكه ، وجاءت الطير حتى حامت عليه فعرف القوم أنه سليمان - عليه السلام - فقام القوم يعتذرون مما صنعوا [ به ] فقال : ما أحمدكم على عذركم ولا ألومكم على ما كان منكم ، كان هذا الأمر لا بد منه . قال : فجاء حتى أتى ملكه وأرسل إلى الشيطان فجيء به فأمر به فجعل في صندوق من حديد ، ثم أطبق عليه وقفل عليه بقفل وختم عليه بخاتمه ثم أمر به فألقي في البحر فهو فيه حتى تقوم الساعة . وكان اسمه حبقيق قال : وسخر له الريح ولم تكن سخرت له قبل ذلك وهو قوله : ( وهب لي ملكا لا ينبغي لأحد من بعدي إنك أنت الوهاب )\nوقال ابن أبي نجيح ، عن مجاهد قوله : ( وألقينا على كرسيه جسدا ) قال : شيطانا يقال له : آصف . فقال له سليمان : كيف تفتنون الناس ؟ قال : أرني خاتمك أخبرك . فلما أعطاه إياه نبذه آصف في البحر فساح سليمان وذهب ملكه ، وقعد آصف على كرسيه ومنعه الله نساء سليمان فلم يقربهن - ولم يقربنه وأنكرنه . قال : فكان سليمان يستطعم فيقول : أتعرفوني ؟ أطعموني أنا سليمان فيكذبونه ، حتى أعطته امرأة يوما حوتا فجعل يطيب بطنه ، فوجد خاتمه في بطنه فرجع إليه ملكه وفر آصف فدخل البحر فارا .\nوهذه كلها من الإسرائيليات ومن أنكرها ما قاله ابن أبي حاتم :\nحدثنا علي بن الحسين حدثنا محمد بن العلاء وعثمان بن أبي شيبة وعلي بن محمد قالوا : حدثنا أبو معاوية أخبرنا الأعمش عن المنهال بن عمرو عن سعيد بن جبير عن ابن عباس [ رضي الله عنهما ] ( وألقينا على كرسيه جسدا ثم أناب ) قال : أراد سليمان أن يدخل الخلاء فأعطى الجرادة خاتمه - وكانت الجرادة امرأته وكانت أحب نسائه إليه - فجاء الشيطان في صورة سليمان فقال لها : هاتي خاتمي . فأعطته إياه . فلما لبسه دانت له الإنس والجن والشياطين فلما خرج سليمان من الخلاء قال لها : هاتي خاتمي . قالت : قد أعطيته سليمان . قال : أنا سليمان . قالت : كذبت لست سليمان فجعل لا يأتي أحدا يقول له : \" أنا سليمان \" ، إلا كذبه حتى جعل الصبيان يرمونه بالحجارة . فلما رأى ذلك عرف أنه من أمر الله - عز وجل - . قال : وقام الشيطان يحكم بين الناس فلما أراد الله أن يرد على سليمان سلطانه ألقى في قلوب الناس إنكار ذلك الشيطان . قال : فأرسلوا إلى نساء سليمان فقالوا لهن : أتنكرن من سليمان شيئا ؟ قلن : نعم إنه يأتينا ونحن حيض وما كان يأتينا قبل ذلك . فلما رأى الشيطان أنه قد فطن له ظن أن أمره قد انقطع فكتبوا كتبا فيها سحر وكفر ، فدفنوها تحت كرسي سليمان ثم أثاروها وقرءوها على الناس . وقالوا : بهذا كان يظهر سليمان على الناس [ ويغلبهم ] فأكفر الناس سليمان - عليه السلام - فلم يزالوا يكفرونه وبعث ذلك الشيطان بالخاتم فطرحه في البحر فتلقته سمكة فأخذته . وكان سليمان يحمل على شط البحر بالأجر فجاء رجل فاشترى سمكا فيه تلك السمكة التي في بطنها الخاتم فدعا سليمان فقال : تحمل لي هذا السمك ؟ فقال : نعم . قال : بكم ؟ قال بسمكة من هذا السمك . قال : فحمل سليمان - عليه السلام - السمك ثم انطلق به إلى منزله فلما انتهى الرجل إلى بابه أعطاه تلك السمكة التي في بطنها الخاتم فأخذها سليمان فشق بطنها ، فإذا الخاتم في جوفها فأخذه فلبسه . قال : فلما لبسه دانت له الجن والإنس والشياطين وعاد إلى حاله وهرب الشيطان حتى دخل جزيرة من جزائر البحر فأرسل سليمان في طلبه وكان شيطانا مريدا فجعلوا يطلبونه ولا يقدرون عليه حتى وجدوه يوما نائما فجاءوا فبنوا عليه بنيانا من رصاص فاستيقظ فوثب فجعل لا يثب في مكان من البيت إلا انماط معه الرصاص قال : فأخذوه فأوثقوه وجاءوا به إلى سليمان ، فأمر به فنقر له تخت من رخام ثم أدخل في جوفه ثم سد بالنحاس ثم أمر به فطرح في البحر فذلك قوله : ( ولقد فتنا سليمان وألقينا على كرسيه جسدا ثم أناب ) قال : يعني الشيطان الذي كان سلط عليه .\nإسناده إلى ابن عباس قوي ولكن الظاهر أنه إنما تلقاه ابن عباس - إن صح عنه - من أهل الكتاب ، وفيهم طائفة لا يعتقدون نبوة سليمان - عليه السلام - فالظاهر أنهم يكذبون عليه ولهذا كان في السياق منكرات من أشدها ذكر النساء فإن المشهور أن ذلك الجني لم يسلط على نساء سليمان بل عصمهن الله منه تشريفا وتكريما لنبيه - صلى الله عليه وسلم - وقد رويت هذه القصة مطولة عن جماعة من السلف ، كسعيد بن المسيب وزيد بن أسلم وجماعة آخرين وكلها متلقاة من قصص أهل الكتاب والله أعلم بالصواب .\nوقال يحيى بن أبي عمرو السيباني : وجد سليمان خاتمه في عسقلان ، فمشى في خرقة إلى بيت المقدس تواضعا لله - عز وجل - رواه ابن أبي حاتم .\nوقد روى ابن أبي حاتم عن كعب الأحبار في صفة كرسي سليمان عليه الصلاة والسلام خبرا عجيبا فقال : حدثنا أبي رحمه الله ، حدثنا أبو صالح كاتب الليث أخبرني أبو إسحاق المصري عن كعب الأحبار ; أنه لما فرغ من حديث \" إرم ذات العماد \" قال له معاوية : يا أبا إسحاق أخبرني عن كرسي سليمان بن داود وما كان عليه ; ومن أي شيء هو ؟ فقال : كان كرسي سليمان من أنياب الفيلة مفصصا بالدر والياقوت والزبرجد واللؤلؤ . وقد جعل له درجة منها مفصصة بالدر والياقوت والزبرجد ثم أمر بالكرسي فحف من جانبيه بالنخل ، نخل من ذهب شماريخها من ياقوت وزبرجد ولؤلؤ . وجعل على رءوس النخل التي عن يمين الكرسي طواويس من ذهب ، ثم جعل على رءوس النخل التي على يسار الكرسي نسور من ذهب مقابلة الطواويس ، وجعل على يمين الدرجة الأولى شجرتا صنوبر من ذهب ، وعن يسارها أسدان من ذهب وعلى رءوس الأسدين عمودان من زبرجد وجعل من جانبي الكرسي شجرتا كرم من ذهب قد أظلتا الكرسي وجعل عناقيدهما درا وياقوتا أحمر . ثم جعل فوق درج الكرسي أسدان عظيمان من ذهب مجوفان محشوان مسكا وعنبرا . فإذا أراد سليمان أن يصعد على كرسيه استدار الأسدان ساعة ثم يقعان فينضحان ما في أجوافهما من المسك والعنبر حول كرسي سليمان - عليه السلام - ثم يوضع منبران من ذهب واحد لخليفته والآخر لرئيس أحبار بني إسرائيل ذلك الزمان . ثم يوضع أمام كرسيه سبعون منبرا من ذهب يقعد عليها سبعون قاضيا من بني إسرائيل وعلمائهم وأهل الشرف منهم والطول ومن خلف تلك المنابر كلها خمسة وثلاثون منبرا من ذهب ليس عليها أحد ، فإذا أراد أن يصعد على كرسيه وضع قدميه على الدرجة السفلى فاستدار الكرسي كله بما فيه وما عليه ، ويبسط الأسد يده اليمنى وينشر النسر جناحه الأيسر ثم يصعد [ سليمان ] على الدرجة الثانية فيبسط الأسد يده اليسرى وينشر النسر جناحه الأيمن فإذا استوى سليمان على الدرجة الثالثة وقعد على الكرسي أخذ نسر من تلك النسور عظيم تاج سليمان فوضعه على رأسه فإذا وضعه على رأسه استدار الكرسي بما فيه كما تدور الرحى المسرعة . فقال معاوية رضي الله عنه : وما الذي يديره يا أبا إسحاق ؟ قال : تنين من ذهب ذلك الكرسي عليه وهو عظيم مما عمله صخر الجني فإذا أحست بدورانه تلك النسور والأسد والطواويس التي في أسفل الكرسي درن إلى أعلاه فإذا وقف وقفن كلهن منكسات رءوسهن على رأس سليمان [ ابن داود ] - عليه السلام - وهو جالس ثم ينضحن جميعا ما في أجوافهن من المسك والعنبر على رأس سليمان - عليه السلام - . ثم تتناول حمامة من ذهب واقفة على عمود من جوهر التوراة فتجعلها في يده فيقرؤها سليمان على الناس .\nوذكر تمام الخبر وهو غريب جدا .\n                                    ",
        "qortoby": "وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ ٤٣\n                                    \n                                    \n                                    قوله تعالى : ولقد فتنا سليمان قيل : فتن سليمان بعد ما ملك عشرين سنة ، وملك بعد الفتنة عشرين سنة ، ذكره الزمخشري . و \" فتنا \" أي : ابتلينا وعاقبنا . وسبب ذلك ما رواه سعيد بن جبير عن ابن عباس قال : اختصم إلى سليمان - عليه السلام - فريقان أحدهما من أهل جرادة امرأة سليمان ، وكان يحبها فهوى أن يقع القضاء لهم ، ثم قضى بينهما بالحق ، فأصابه الذي أصابه عقوبة لذلك الهوى . وقال سعيد بن المسيب : إن سليمان - عليه السلام - احتجب عن الناس ثلاثة أيام لا يقضي بين أحد ، ولا ينصف مظلوما من ظالم ، فأوحى الله تعالى إليه : \" إني لم أستخلفك لتحتجب عن عبادي ولكن لتقضي بينهم وتنصف مظلومهم \" .\nوقال شهر بن حوشب ووهب بن منبه : إن سليمان - عليه السلام - سبى بنت ملك غزاه في البحر ، في جزيرة من جزائر البحر يقال لها صيدون . فألقيت عليه محبتها ، وهي تعرض عنه ، لا تنظر إليه إلا شزرا ، ولا تكلمه إلا نزرا ، وكان لا يرقأ لها دمع حزنا على أبيها ، وكانت في غاية من الجمال ، ثم إنها سألته أن يصنع لها تمثالا على صورة أبيها حتى تنظر إليه ، فأمر فصنع لها فعظمته وسجدت له ، وسجدت معها جواريها ، وصار صنما معبودا في داره وهو لا يعلم ، حتى مضت أربعون ليلة ، وفشا خبره في بني إسرائيل وعلم به سليمان فكسره ، وحرقه ثم ذراه في البحر . وقيل : إن سليمان لما أصاب ابنة ملك صيدون واسمها جرادة - فيما ذكر الزمخشري - أعجب بها ، فعرض عليها الإسلام فأبت ، فخوفها فقالت : اقتلني ولا أسلم ، فتزوجها وهي مشركة فكانت تعبد صنما لها من ياقوت أربعين يوما في خفية من سليمان إلى أن أسلمت ، فعوقب سليمان بزوال ملكه أربعين يوما . وقال كعب الأحبار : إنه لما ظلم الخيل بالقتل سلب ملكه . وقال الحسن : إنه قارب بعض نسائه في شيء من حيض أو غيره . وقيل : إنه أمر ألا يتزوج امرأة إلا من بني إسرائيل ، فتزوج امرأة من غيرهم ، فعوقب على ذلك ، والله أعلم .\nقوله تعالى : وألقينا على كرسيه جسدا قيل : شيطان في قول أكثر أهل التفسير ، ألقى الله شبه سليمان - عليه السلام - عليه ، واسمه صخر بن عمير صاحب البحر ، وهو الذي دل سليمان على الماس حين أمر سليمان ببناء بيت المقدس ، فصوتت الحجارة لما صنعت بالحديد ، فأخذوا الماس فجعلوا يقطعون به الحجارة والفصوص وغيرها ولا تصوت . قال ابن عباس : كان ماردا لا يقوى عليه جميع الشياطين ، ولم يزل يحتال حتى ظفر بخاتم سليمان بن داود ، وكان سليمان لا يدخل الكنيف بخاتمه ، فجاء صخر في صورة سليمان حتى أخذ الخاتم من امرأة من نساء سليمان أم ولد له يقال لها الأمينة ، قاله شهر ووهب .\nوقال ابن عباس وابن جبير : اسمها جرادة . فقام أربعين يوما على ملك سليمان وسليمان هارب ، حتى رد الله عليه الخاتم والملك . وقال سعيد بن المسيب : كان سليمان قد وضع خاتمه تحت فراشه ، فأخذه الشيطان من تحته . وقال مجاهد : أخذه الشيطان من يد سليمان ; لأن سليمان سأل الشيطان وكان اسمه آصف : كيف تضلون الناس ؟ فقال له الشيطان : أعطني خاتمك حتى أخبرك . فأعطاه خاتمه ، فلما أخذ الشيطان الخاتم جلس على كرسي سليمان ، متشبها بصورته ، داخلا على نسائه ، يقضي بغير الحق ، ويأمر بغير الصواب . واختلف في إصابته لنساء سليمان ، فحكي عن ابن عباس ووهب بن منبه : أنه كان يأتيهن في حيضهن . وقال مجاهد : منع من إتيانهن ، وزال عن سليمان ملكه ، فخرج هاربا إلى ساحل البحر يتضيف الناس ، ويحمل سموك الصيادين بالأجر ، وإذا أخبر الناس أنه سليمان أكذبوه . قال قتادة : ثم إن سليمان بعد أن استنكر بنو إسرائيل حكم الشيطان أخذ حوته من صياد . قيل : إنه استطعمها . وقال ابن عباس : أخذها أجرة في حمل حوت . وقيل : إن سليمان صادها ، فلما شق بطنها وجد خاتمه فيها ، وذلك بعد أربعين يوما من زوال ملكه ، وهي عدد الأيام التي عبد فيها الصنم في داره ، وإنما وجد الخاتم في بطن الحوت ; لأن الشيطان الذي أخذه ألقاه في البحر . وقال علي بن أبي طالب - رضي الله عنه - : بينما سليمان على شاطئ البحر وهو يعبث بخاتمه ، إذ سقط منه في البحر وكان ملكه في خاتمه . وقال جابر بن عبد الله : قال النبي - صلى الله عليه وسلم - : كان نقش خاتم سليمان بن داود لا إله إلا الله محمد رسول الله .\nوحكى يحيى بن أبي عمرو الشيباني أن سليمان وجد خاتمه بعسقلان ، فمشى منها إلى بيت المقدس تواضعا لله تعالى . قال ابن عباس وغيره : ثم إن سليمان لما رد الله عليه ملكه ، أخذ صخرا الذي أخذ خاتمه ، ونقر له صخرة وأدخله فيها ، وسد عليه بأخرى وأوثقها بالحديد والرصاص ، وختم عليها بخاتمه وألقاها في البحر ، وقال : هذا محبسك إلى يوم القيامة . وقال علي - رضي الله عنه - : لما أخذ سليمان الخاتم ، أقبلت إليه الشياطين والجن والإنس والطير والوحش والريح ، وهرب الشيطان الذي خلف في أهله ، فأتى جزيرة في البحر ، فبعث إليه الشياطين فقالوا : لا نقدر عليه ، ولكنه يرد عينا في الجزيرة في كل سبعة أيام يوما ، ولا نقدر عليه حتى يسكر! قال : فنزح سليمان ماءها وجعل فيها خمرا ، فجاء يوم وروده فإذا هو بالخمر ، فقال : والله إنك لشراب طيب إلا أنك تطيشين الحليم ، وتزيدين الجاهل جهلا . ثم عطش عطشا شديدا ثم أتاه فقال مثل مقالته ، ثم شربها فغلبت على عقله ، فأروه الخاتم فقال : سمعا وطاعة . فأتوا به سليمان فأوثقه وبعث به إلى جبل ، فذكروا أنه جبل الدخان ، فقالوا : إن الدخان الذي ترون من نفسه ، والماء الذي يخرج من الجبل من بوله . وقال مجاهد : اسم ذلك الشيطان آصف . وقال السدي اسمه حبقيق ، فالله أعلم .\nوقد ضعف هذا القول من حيث إن الشيطان لا يتصور بصورة الأنبياء ، ثم من المحال أن يلتبس على أهل مملكة سليمان الشيطان بسليمان حتى يظنوا أنهم مع نبيهم في حق ، وهم مع الشيطان في باطل . وقيل : إن الجسد ولد ولد لسليمان ، وأنه لما ولد اجتمعت الشياطين ، وقال بعضهم لبعض : إن عاش له ابن لم ننفك مما نحن فيه من البلاء والسخرة ، فتعالوا نقتل ولده أو نخبله . فعلم سليمان بذلك فأمر الريح حتى حملته إلى السحاب ، وغدا ابنه في السحاب خوفا من مضرة الشياطين ، فعاقبه الله بخوفه من الشياطين ، فلم يشعر إلا وقد وقع على كرسيه ميتا . قال معناه الشعبي . فهو الجسد الذي قال الله تعالى : وألقينا على كرسيه جسدا .\nوحكى النقاش وغيره : إن أكثر ما وطئ سليمان جواريه طلبا للولد ، فولد له نصف إنسان ، فهو كان الجسد الملقى على كرسيه ، جاءت به القابلة فألقته هناك . وفي صحيح البخاري ومسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : قال سليمان لأطوفن الليلة على تسعين امرأة ، كلهن تأتي بفارس يجاهد في سبيل الله ، فقال له صاحبه : قل إن شاء الله ، فلم يقل إن شاء الله ، فطاف عليهن جميعا فلم تحمل منهن إلا امرأة واحدة جاءت بشق رجل ، وايم الذي نفس محمد بيده لو قال : إن شاء الله ، لجاهدوا في سبيل الله فرسانا أجمعون . وقيل : إن الجسد هو آصف بن برخيا الصديق كاتب سليمان ، وذلك أن سليمان لما فتن سقط الخاتم من يده وكان فيه ملكه ، فأعاده إلى يده فسقط فأيقن بالفتنة ، فقال له آصف : إنك مفتون ، ولذلك لا يتماسك في يدك ، ففر إلى الله تعالى تائبا من ذلك ، وأنا أقوم مقامك في عالمك إلى أن يتوب الله عليك ، ولك من حين فتنت أربعة عشر يوما . ففر سليمان هاربا إلى ربه ، وأخذ آصف الخاتم فوضعه في يده فثبت ، وكان عنده علم من الكتاب . وقام آصف في ملك سليمان وعياله ، يسير بسيره ويعمل بعمله ، إلى أن رجع سليمان إلى منزله تائبا إلى الله تعالى ، ورد الله عليه ملكه ، فأقام آصف في مجلسه ، وجلس على كرسيه وأخذ الخاتم . وقيل : إن الجسد كان سليمان نفسه ، وذلك أنه مرض مرضا شديدا حتى صار جسدا . وقد يوصف به المريض المضنى فيقال : كالجسد الملقى .\nصفة كرسي سليمان وملكه : روي عن ابن عباس قال : كان سليمان يوضع له ستمائة كرسي ، ثم يجيء أشراف الناس فيجلسون مما يليه ، ثم يأتي أشراف الجن فيجلسون مما يلي الإنس ، ثم يدعو الطير فتظلهم ، ثم يدعو الريح فتقلهم ، وتسير بالغداة الواحدة مسيرة شهر . وقال وهب وكعب وغيرهما : إن سليمان - عليه السلام - لما ملك بعد أبيه ، أمر باتخاذ كرسي ليجلس عليه للقضاء ، وأمر أن يعمل بديعا مهولا بحيث إذا رآه مبطل أو شاهد زور ارتدع وتهيب ، فأمر أن يعمل من أنياب الفيلة مفصصة بالدر والياقوت والزبرجد ، وأن يحف بنخيل الذهب ، فحف بأربع نخلات من ذهب ، شماريخها الياقوت الأحمر والزمرد الأخضر ، على رأس نخلتين منهما طاووسان من ذهب ، وعلى رأس نخلتين نسران من ذهب بعضها مقابل لبعض ، وجعلوا من جنبي الكرسي أسدين من ذهب ، على رأس كل واحد منهما عمود من الزمرد الأخضر . وقد عقدوا على النخلات أشجار كروم من الذهب الأحمر ، واتخذوا عناقيدها من الياقوت الأحمر ، بحيث أظل عريش الكروم النخل والكرسي . وكان سليمان - عليه السلام - إذا أراد صعوده وضع قدميه على الدرجة السفلى ، فيستدير الكرسي كله بما فيه دوران الرحى المسرعة ، وتنشر تلك النسور والطواويس أجنحتها ، ويبسط الأسدان أيديهما ، ويضربان الأرض بأذنابهما . وكذلك يفعل في كل درجة يصعدها سليمان ، فإذا استوى بأعلاه أخذ النسران اللذان على النخلتين تاج سليمان فوضعاه على رأسه ، ثم يستدير الكرسي بما فيه ، ويدور معه النسران والطاووسان والأسدان مائلان برءوسهما إلى سليمان ، وينضحن عليه من أجوافهن المسك والعنبر ، ثم تناوله حمامة من ذهب قائمة على عمود من أعمدة الجواهر فوق الكرسي التوراة ، فيفتحها سليمان - عليه السلام - ويقرأها على الناس ويدعوهم إلى فصل القضاء .\nقالوا : ويجلس عظماء بني إسرائيل على كراسي الذهب المفصصة بالجواهر ، وهي ألف كرسي عن يمينه ، ويجلس عظماء الجن على كراسي الفضة عن يساره ، وهي ألف كرسي ، ثم تحف بهم الطير تظلهم ، ويتقدم الناس لفصل القضاء . فإذا تقدمت الشهود للشهادات ، دار الكرسي بما فيه وعليه دوران الرحى المسرعة ، ويبسط الأسدان أيديهما ويضربان الأرض بأذنابهما ، وينشر النسران والطاووسان أجنحتهما ، فتفزع الشهود فلا يشهدون إلا بالحق .\nوقيل : إن الذي كان يدور بذلك الكرسي تنين من ذهب ذلك الكرسي عليه ، وهو عظم مما عمله له صخر الجني ، فإذا أحست بدورانه تلك النسور والأسد والطواويس التي في أسفل الكرسي إلى أعلاه درن معه ، فإذا وقفن وقفن كلهن على رأس سليمان ، وهو جالس ، ثم ينضحن جميعا على رأسه ما في أجوافهن من المسك والعنبر . فلما توفي سليمان بعث بختنصر فأخذ الكرسي فحمله إلى أنطاكية ، فأراد أن يصعد إليه ولم يكن له علم كيف يصعد إليه ، فلما وضع رجله ضرب الأسد رجله فكسرها ، وكان سليمان إذا صعد وضع قدميه جميعا . ومات بختنصر وحمل الكرسي إلى بيت المقدس ، فلم يستطع قط ملك أن يجلس عليه ، ولكن لم يدر أحد عاقبة أمره ، ولعله رفع .\nقوله تعالى : ثم أناب أي رجع إلى الله وتاب . وقد تقدم .\n                                    ",
        "saadi": "وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ ٤٣\n                                        \n                                        \n                                        \n                                        { وَلَقَدْ فَتَنَّا سُلَيْمَانَ } أي: ابتليناه واختبرناه بذهاب ملكه وانفصاله عنه بسبب خلل اقتضته الطبيعة البشرية، { وَأَلْقَيْنَا عَلَى كُرْسِيِّهِ جَسَدًا } أي: شيطانا قضى اللّه وقدر أن يجلس على كرسي ملكه، ويتصرف في الملك في مدة فتنة سليمان، { ثُمَّ أَنَابَ } سليمان إلى اللّه تعالى وتاب.\n                                    "
      },
      "originalText": "وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ ٤٣"
    },
    {
      "number": 4005,
      "text": "قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي ۖ إِنَّكَ أَنْتَ الْوَهَّابُ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 35,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٥٣\n                                    \n                                    \n                                    ( قال رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي إنك أنت الوهاب ) قال بعضهم : معناه : لا ينبغي لأحد من بعدي أي : لا يصلح لأحد أن يسلبنيه كما كان من قضية الجسد الذي ألقي على كرسيه لا أنه يحجر على من بعده من الناس . والصحيح أنه سأل من الله تعالى ملكا لا يكون لأحد من بعده من البشر مثله ، وهذا هو ظاهر السياق من الآية وبه وردت الأحاديث الصحيحة من طرق عن رسول الله - صلى الله عليه وسلم - .\nقال البخاري عند تفسير هذه الآية : حدثنا إسحاق بن إبراهيم أخبرنا روح ومحمد بن جعفر عن شعبة عن محمد بن زياد عن أبي هريرة رضي الله عنه عن النبي - صلى الله عليه وسلم - قال : \" إن عفريتا من الجن تفلت علي البارحة - أو كلمة نحوها - ليقطع علي الصلاة فأمكنني الله منه وأردت أن أربطه إلى سارية من سواري المسجد حتى تصبحوا وتنظروا إليه كلكم فذكرت قول أخي سليمان : ( رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي )\nقال روح : فرده خاسئا\nوكذا رواه مسلم والنسائي من حديث شعبة به\nوقال مسلم في صحيحه : حدثنا محمد بن سلمة المرادي حدثنا عبد الله بن وهب عن معاوية بن صالح حدثني ربيعة بن يزيد عن أبي إدريس الخولاني عن أبي الدرداء قال : قام رسول الله - صلى الله عليه وسلم - يصلي فسمعناه يقول : \" أعوذ بالله منك \" . ثم قال : \" ألعنك بلعنة الله \" - ثلاثا - وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا : يا رسول الله ، قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ؟ قال : \" إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت : أعوذ بالله منك - ثلاث مرات - ثم قلت : ألعنك بلعنة الله التامة . فلم يستأخر ثلاث مرات ثم أردت أخذه والله لولا دعوة أخينا سليمان لأصبح موثقا يلعب به صبيان أهل المدينة \"\nوقال الإمام أحمد : حدثنا أبو أحمد حدثنا ميسرة بن معبد حدثنا أبو عبيد حاجب سليمان قال : رأيت عطاء بن يزيد الليثي قائما يصلي ، فذهبت أمر بين يديه فردني ثم قال حدثني أبو سعيد الخدري أن رسول الله - صلى الله عليه وسلم - قام يصلي صلاة الصبح وهو خلفه فقرأ فالتبست عليه القراءة فلما فرغ من صلاته قال : \" لو رأيتموني وإبليس فأهويت بيدي فما زلت أخنقه حتى وجدت برد لعابه بين أصبعي هاتين - الإبهام والتي تليها - ولولا دعوة أخي سليمان لأصبح مربوطا بسارية من سواري المسجد ، يتلاعب به صبيان المدينة فمن استطاع منكم ألا يحول بينه وبين القبلة أحد فليفعل \" .\nوقد روى أبو داود منه : \" من استطاع منكم ألا يحول بينه وبين القبلة أحد فليفعل \" عن أحمد بن أبي سريج عن أبي أحمد الزبيري به\nوقال الإمام أحمد : حدثنا معاوية بن عمرو حدثنا إبراهيم بن محمد الفزاري حدثنا الأوزاعي ، حدثني ربيعة بن يزيد عن عبد الله الديلمي قال : دخلت على عبد الله بن عمرو ، وهو في حائط له بالطائف يقال له : \" الوهط \" ، وهو مخاصر فتى من قريش يزن بشرب الخمر ، فقلت : بلغني عنك حديث أنه \" من شرب شربة خمر لم يقبل الله - عز وجل - له توبة أربعين صباحا ، وإن الشقي من شقي في بطن أمه وإنه من أتى بيت المقدس لا ينهزه إلا الصلاة فيه ، خرج من خطيئته مثل يوم ولدته أمه ، فلما سمع الفتى ذكر الخمر اجتذب يده من يده ثم انطلق . فقال عبد الله بن عمرو إني لا أحل لأحد أن يقول علي ما لم أقل سمعت رسول الله - صلى الله عليه وسلم - يقول : \" من شرب من الخمر شربة لم تقبل له صلاة أربعين صباحا فإن تاب تاب الله عليه فإن عاد لم تقبل له صلاة أربعين صباحا فإن تاب تاب الله عليه . فإن عاد - قال فلا أدري في الثالثة أو الرابعة - فإن عاد كان حقا على الله أن يسقيه من ردغة الخبال يوم القيامة \" قال : وسمعت رسول الله - صلى الله عليه وسلم - يقول : \" إن الله خلق خلقه في ظلمة ثم ألقى عليهم من نوره فمن أصابه من نوره يومئذ اهتدى ومن أخطأه ضل فلذلك أقول جف القلم على علم الله - عز وجل - \" وسمعت رسول الله - صلى الله عليه وسلم - يقول : \" إن سليمان سأل الله تعالى ثلاثا فأعطاه اثنتين ونحن نرجو أن تكون لنا الثالثة : سأله حكما يصادف حكمه فأعطاه إياه وسأله ملكا لا ينبغي لأحد من بعده فأعطاه إياه وسأله أيما رجل خرج من بيته لا يريد إلا الصلاة في هذا المسجد خرج من خطيئته كيوم ولدته أمه فنحن نرجو أن يكون الله تعالى قد أعطانا إياها \"\nوقد روى هذا الفصل الأخير من هذا الحديث النسائي وابن ماجه من طرق عن عبد الله بن فيروز الديلمي عن عبد الله بن عمرو قال : قال رسول الله - صلى الله عليه وسلم - : \" إن سليمان لما بنى بيت المقدس سأل ربه - عز وجل - خلالا ثلاثا . . . \" وذكره\nوقد روي من حديث رافع بن عمير رضي الله عنه ، بإسناد وسياق غريبين فقال الطبراني :\nحدثنا محمد بن الحسن بن قتيبة العسقلاني حدثنا محمد بن أيوب بن سويد حدثني أبي حدثنا إبراهيم بن أبي عبلة عن أبي الزاهرية عن رافع بن عمير قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" قال الله - عز وجل - لداود - عليه السلام - : ابن لي بيتا في الأرض . فبنى داود بيتا لنفسه قبل البيت الذي أمر به فأوحى الله إليه : يا داود نصبت بيتك قبل بيتي ؟ قال : يا رب هكذا قضيت من ملك استأثر ثم أخذ في بناء المسجد فلما تم السور سقط ثلاثا فشكا ذلك إلى الله - عز وجل - فقال : يا داود إنك لا تصلح أن تبني لي بيتا قال : ولم يا رب ؟ قال : لما جرى على يديك من الدماء . قال : يا رب أو ما كان ذلك في هواك ومحبتك ؟ قال : بلى ولكنهم عبادي وأنا أرحمهم فشق ذلك عليه فأوحى الله إليه : لا تحزن فإني سأقضي بناءه على يدي ابنك سليمان . فلما مات داود أخذ سليمان في بنائه فلما تم قرب القرابين وذبح الذبائح وجمع بني إسرائيل فأوحى الله إليه : قد أرى سرورك ببنيان بيتي فسلني أعطك . قال : أسألك ثلاث خصال حكما يصادف حكمك وملكا لا ينبغي لأحد من بعدي ومن أتى هذا البيت لا يريد إلا الصلاة فيه خرج من ذنوبه كيوم ولدته أمه \" . قال رسول الله - صلى الله عليه وسلم - : \" أما ثنتان فقد أعطيهما وأنا أرجو أن يكون قد أعطي الثالثة \"\nوقال الإمام أحمد : حدثنا عبد الصمد حدثنا عمر بن راشد اليمامي ، حدثنا إياس بن سلمة بن الأكوع عن أبيه قال : ما سمعت رسول الله - صلى الله عليه وسلم - دعا دعاء إلا استفتحه ب \" سبحان الله ربي الأعلى العلي الوهاب \"\nوقد قال أبو عبيد : حدثنا علي بن ثابت عن جعفر بن برقان عن صالح بن مسمار قال : لما مات نبي الله داود أوحى الله إلى ابنه سليمان عليهما السلام : أن سلني حاجتك . قال : أسألك أن تجعل لي قلبا يخشاك كما كان قلب أبي وأن تجعل قلبي يحبك كما كان قلب أبي . فقال الله : أرسلت إلى عبدي وسألته حاجته فكانت [ حاجته ] أن أجعل قلبه يخشاني وأن أجعل قلبه يحبني لأهبن له ملكا لا ينبغي لأحد من بعده .\n                                    ",
        "qortoby": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٥٣\n                                    \n                                    \n                                    قوله تعالى : قال رب اغفر لي أي اغفر لي ذنبي وهب لي ملكا لا ينبغي لأحد من بعدي يقال : كيف أقدم سليمان على طلب الدنيا ، مع ذمها من الله تعالى ، وبغضه لها ، وحقارتها لديه ؟ . فالجواب : أن ذلك محمول عند العلماء على أداء حقوق الله تعالى وسياسة ملكه ، وترتيب منازل خلقه ، وإقامة حدوده ، والمحافظة على رسومه ، وتعظيم شعائره ، وظهور عبادته ، ولزوم طاعته ، ونظم قانون الحكم النافذ عليهم منه ، وتحقيق الوعود في أنه يعلم ما لا يعلم أحد من خلقه حسب ما صرح بذلك لملائكته فقال : إني أعلم ما لا تعلمون وحاشا سليمان - عليه السلام - أن يكون سؤاله طلبا لنفس الدنيا ; لأنه هو والأنبياء أزهد خلق الله فيها ، وإنما سأل مملكتها لله ، كما سأل نوح دمارها وهلاكها لله ، فكانا محمودين مجابين إلى ذلك ، فأجيب نوح فأهلك من عليها ، وأعطي سليمان المملكة . وقد قيل : إن ذلك كان بأمر من الله - جل وعز - على الصفة التي علم الله أنه لا يضبطه إلا هو وحده دون سائر عباده ، أو أراد أن يقول ملكا عظيما فقال : لا ينبغي لأحد من بعدي وهذا فيه نظر . والأول أصح . ثم قال له : هذا عطاؤنا فامنن أو أمسك بغير حساب قال الحسن : ما من أحد إلا ولله عليه تبعة في نعمه غير سليمان بن داود - عليه السلام - فإنه قال : هذا عطاءنا الآية .\nقلت : وهذا يرد ما روي في الخبر : إن آخر الأنبياء دخولا الجنة سليمان بن داود - عليه السلام - لمكان ملكه في الدنيا . وفي بعض الأخبار : يدخل الجنة بعد الأنبياء بأربعين خريفا ، ذكره صاحب القوت ، وهو حديث لا أصل له ; لأنه سبحانه إذا كان عطاءه لا تبعة فيه ; لأنه من طريق المنة ، فكيف يكون آخر الأنبياء دخولا الجنة ، وهو سبحانه يقول : وإن له عندنا لزلفى وحسن مآب . وفي الصحيح : لكل نبي دعوة مستجابة ، فتعجل كل نبي دعوته . . . الحديث . وقد تقدم فجعل له من قبل السؤال حاجة مقضية ، فلذلك لم تكن عليه تبعة . ومعنى قوله : لا ينبغي لأحد من بعدي أي : أن يسأله . فكأنه سأل منع السؤال بعده ، حتى لا يتعلق به أمل أحد ، ولم يسأل منع الإجابة . وقيل : إن سؤاله ملكا لا ينبغي لأحد من بعده ، ليكون محله وكرامته من الله ظاهرا في خلق السماوات والأرض ، فإن الأنبياء عليهم السلام لهم تنافس في المحل عنده ، فكل يحب أن تكون له خصوصية يستدل بها على محله عنده ، ولهذا لما أخذ النبي - صلى الله عليه وسلم - العفريت الذي أراد أن يقطع عليه صلاته وأمكنه الله منه ، أراد ربطه ثم تذكر قول أخيه سليمان : رب اغفر لي وهب لي ملكا لا ينبغي لأحد من بعدي فرده خاسئا . فلو أعطي أحد بعده مثله ذهبت الخصوصية ، فكأنه كره - صلى الله عليه وسلم - أن يزاحمه في تلك الخصوصية ، بعد أن علم أنه شيء هو الذي خص به من سخرة الشياطين ، وأنه أجيب إلى ألا يكون لأحد بعده . والله أعلم .\n                                    ",
        "saadi": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٥٣\n                                        \n                                        \n                                        \n                                        فـ { قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي إِنَّكَ أَنْتَ الْوَهَّابُ } فاستجاب اللّه له وغفر له، ورد عليه ملكه، وزاده ملكا لم يحصل لأحد من بعده، وهو تسخير الشياطين له، يبنون ما يريد، ويغوصون له في البحر، يستخرجون الدر والحلي، ومن عصاه منهم قرنه في الأصفاد وأوثقه.\n                                    "
      },
      "originalText": "قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٥٣"
    },
    {
      "number": 4006,
      "text": "فَسَخَّرْنَا لَهُ الرِّيحَ تَجْرِي بِأَمْرِهِ رُخَاءً حَيْثُ أَصَابَ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 36,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَسَخَّرۡنَا لَهُ ٱلرِّيحَ تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ ٦٣\n                                    \n                                    \n                                    قال الله تعالى : ( فسخرنا له الريح تجري بأمره رخاء حيث أصاب ) والتي بعدها ، قال : فأعطاه [ الله ] ما أعطاه وفي الآخرة لا حساب عليه .\nهكذا أورده أبو القاسم بن عساكر في ترجمة سليمان - عليه السلام - في تاريخه\nوروي عن بعض السلف أنه قال : بلغني عن داود [ عليه السلام ] أنه قال : \" إلهي كن لسليمان كما كنت لي \" : فأوحى الله إليه : أن قل لسليمان : يكون لي كما كنت لي ، أكون له كما كنت لك .\nوقوله : ( فسخرنا له الريح تجري بأمره رخاء حيث أصاب ) قال الحسن البصري رحمه الله : لما عقر سليمان الخيل غضبا لله - عز وجل - عوضه الله ما هو خير منها وأسرع الريح التي غدوها شهر ورواحها شهر .\nوقوله : ( حيث أصاب ) أي : حيث أراد من البلاد .\n\n                                    ",
        "qortoby": "فَسَخَّرۡنَا لَهُ ٱلرِّيحَ تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ ٦٣\n                                    \n                                    \n                                    قوله تعالى : فسخرنا له الريح تجري بأمره رخاء أي لينة مع قوتها وشدتها حتى لا تضر بأحد ، وتحمله بعسكره وجنوده وموكبه . وكان موكبه فيما روي فرسخا في فرسخ ، مائة درجة بعضها فوق بعض ، كل درجة صنف من الناس ، وهو في أعلى درجة مع جواريه وحشمه وخدمه ، صلوات الله وسلامه عليه . وذكر أبو نعيم الحافظ قال : حدثنا أحمد بن جعفر ، قال حدثنا عبد الله بن أحمد بن حنبل ، قال حدثنا أحمد بن محمد بن أيوب ، قال حدثنا أبو بكر بن عياش عن إدريس بن وهب بن منبه ، قال حدثني أبي قال : كان لسليمان بن داود - عليه السلام - ألف بيت ، أعلاه قوارير وأسفله حديد ، فركب الريح يوما فمر بحراث فنظر إليه الحراث فقال : لقد أوتي آل داود ملكا عظيما ، فحملت الريح كلامه فألقته في أذن سليمان ، قال فنزل حتى أتى الحراث فقال : إني سمعت قولك ، وإنما مشيت إليك لئلا تتمنى ما لا تقدر عليه ، لتسبيحة واحدة يقبلها الله منك لخير مما أوتي آل داود . فقال الحراث : أذهب الله همك كما أذهبت همي .\nقوله تعالى : حيث أصاب أي أراد ، قاله مجاهد . والعرب تقول : أصاب الصواب وأخطأ الجواب . أي : أراد الصواب وأخطأ الجواب ، قاله ابن الأعرابي . وقال الشاعر :\nأصاب الكلام فلم يستطع فأخطا الجواب لدى المفصل\nوقيل : أصاب أراد بلغة حمير . وقال قتادة : هو بلسان هجر . وقيل : حيث أصاب : حينما قصد ، وهو مأخوذ من إصابة السهم الغرض المقصود .\n                                    ",
        "saadi": "فَسَخَّرۡنَا لَهُ ٱلرِّيحَ تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ ٦٣\n                                        \n                                        \n                                        \n                                        فـ { قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي إِنَّكَ أَنْتَ الْوَهَّابُ } فاستجاب اللّه له وغفر له، ورد عليه ملكه، وزاده ملكا لم يحصل لأحد من بعده، وهو تسخير الشياطين له، يبنون ما يريد، ويغوصون له في البحر، يستخرجون الدر والحلي، ومن عصاه منهم قرنه في الأصفاد وأوثقه.\n                                    "
      },
      "originalText": "فَسَخَّرۡنَا لَهُ ٱلرِّيحَ تَجۡرِي بِأَمۡرِهِۦ رُخَآءً حَيۡثُ أَصَابَ ٦٣"
    },
    {
      "number": 4007,
      "text": "وَالشَّيَاطِينَ كُلَّ بَنَّاءٍ وَغَوَّاصٍ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 37,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلشَّيَٰطِينَ كُلَّ بَنَّآءٖ وَغَوَّاصٖ ٧٣\n                                    \n                                    \n                                    وقوله : ( والشياطين كل بناء وغواص ) أي : منهم من هو مستعمل في الأبنية الهائلة من محاريب وتماثيل وجفان كالجواب وقدور راسيات إلى غير ذلك من الأعمال الشاقة التي لا يقدر عليها البشر وطائفة غواصون في البحار يستخرجون مما فيها من اللآلئ والجواهر والأشياء النفيسة التي لا توجد إلا فيها\n                                    ",
        "qortoby": "وَٱلشَّيَٰطِينَ كُلَّ بَنَّآءٖ وَغَوَّاصٖ ٧٣\n                                    \n                                    \n                                    \" والشياطين \" أي وسخرنا له الشياطين ، وما سخرت لأحد قبله . \" كل بناء \" بدل من الشياطين ، أي : كل بناء منهم ، فهم يبنون له ما يشاء . قال [ النابغة الذبياني ] :\nإلا سليمان إذ قال الإله له قم في البرية فاحددها عن الفند\nوخيس الجن إني قد أذنت لهم يبنون تدمر بالصفاح والعمد\n\" وغواص \" يعني في البحر يستخرجون له الدر . فسليمان أول من استخرج له اللؤلؤ من البحر .\n                                    ",
        "saadi": "وَٱلشَّيَٰطِينَ كُلَّ بَنَّآءٖ وَغَوَّاصٖ ٧٣\n                                        \n                                        \n                                        \n                                        فـ { قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي إِنَّكَ أَنْتَ الْوَهَّابُ } فاستجاب اللّه له وغفر له، ورد عليه ملكه، وزاده ملكا لم يحصل لأحد من بعده، وهو تسخير الشياطين له، يبنون ما يريد، ويغوصون له في البحر، يستخرجون الدر والحلي، ومن عصاه منهم قرنه في الأصفاد وأوثقه.\n                                    "
      },
      "originalText": "وَٱلشَّيَٰطِينَ كُلَّ بَنَّآءٖ وَغَوَّاصٖ ٧٣"
    },
    {
      "number": 4008,
      "text": "وَآخَرِينَ مُقَرَّنِينَ فِي الْأَصْفَادِ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 38,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَءَاخَرِينَ مُقَرَّنِينَ فِي ٱلۡأَصۡفَادِ ٨٣\n                                    \n                                    \n                                    ( وآخرين مقرنين في الأصفاد ) أي : موثقون في الأغلال والأكبال ممن قد تمرد وعصى وامتنع من العمل وأبى أو قد أساء في صنيعه واعتدى .\n                                    ",
        "qortoby": "وَءَاخَرِينَ مُقَرَّنِينَ فِي ٱلۡأَصۡفَادِ ٨٣\n                                    \n                                    \n                                    وآخرين مقرنين في الأصفاد أي وسخرنا له مردة الشياطين حتى قرنهم في سلاسل الحديد وقيود الحديد ، قال قتادة . السدي : الأغلال . ابن عباس : في وثاق . ومنه قول الشاعر [ عمرو بن كلثوم ] :\nفآبوا بالنهاب وبالسبايا وأبنا بالملوك مصفدينا\nقال يحيى بن سلام : ولم يكن يفعل ذلك إلا بكفارهم ، فإذا آمنوا أطلقهم ولم يسخرهم .\n                                    ",
        "saadi": "وَءَاخَرِينَ مُقَرَّنِينَ فِي ٱلۡأَصۡفَادِ ٨٣\n                                        \n                                        \n                                        \n                                        فـ { قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي إِنَّكَ أَنْتَ الْوَهَّابُ } فاستجاب اللّه له وغفر له، ورد عليه ملكه، وزاده ملكا لم يحصل لأحد من بعده، وهو تسخير الشياطين له، يبنون ما يريد، ويغوصون له في البحر، يستخرجون الدر والحلي، ومن عصاه منهم قرنه في الأصفاد وأوثقه.\n                                    "
      },
      "originalText": "وَءَاخَرِينَ مُقَرَّنِينَ فِي ٱلۡأَصۡفَادِ ٨٣"
    },
    {
      "number": 4009,
      "text": "هَٰذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 39,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هَٰذَا عَطَآؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ ٩٣\n                                    \n                                    \n                                    وقوله : ( هذا عطاؤنا فامنن أو أمسك بغير حساب ) أي : هذا الذي أعطيناك من الملك التام والسلطان الكامل كما سألتنا فأعط من شئت واحرم من شئت ، لا حساب عليك ، أي : مهما فعلت فهو جائز لك احكم بما شئت فهو صواب . وقد ثبت في الصحيحين أن رسول الله - صلى الله عليه وسلم - لما خير بين أن يكون عبدا رسولا - وهو الذي يفعل ما يؤمر به وإنما هو قاسم يقسم بين الناس ما أمره الله به - وبين أن يكون ملكا نبيا يعطي من يشاء ويمنع من يشاء بلا حساب ولا جناح ، اختار المنزلة الأولى بعد ما استشار جبريل فقال له : تواضع فاختار المنزلة الأولى لأنها أرفع قدرا عند الله وأعلى منزلة في المعاد وإن كانت المنزلة الثانية وهي النبوة مع الملك عظيمة أيضا في الدنيا والآخرة ولهذا لما ذكر تبارك وتعالى ما أعطى سليمان في الدنيا نبه على أنه ذو حظ عظيم عند الله يوم القيامة أيضا ،\n                                    ",
        "qortoby": "هَٰذَا عَطَآؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ ٩٣\n                                    \n                                    \n                                    قوله تعالى : هذا عطاؤنا الإشارة بهذا إلى الملك ، أي : هذا الملك عطاءنا فأعط من شئت أو امنع من شئت لا حساب عليك ، عن الحسن والضحاك وغيرهما . قال الحسن : ما أنعم الله على أحد نعمة إلا عليه فيها تبعة إلا سليمان عليه السلام ، فإن الله تعالى يقول : هذا عطاؤنا فامنن أو أمسك بغير حساب . وقال قتادة : الإشارة في قوله تعالى : هذا عطاؤنا إلى ما أعطيه من القوة على الجماع ، وكانت له ثلاثمائة امرأة وسبعمائة سرية ، وكان في ظهره ماء مائة رجل ، رواه عكرمة عن ابن عباس . ومعناه في البخاري .\nفامنن من المني ، يقال : أمنى يمني ومنى يمني لغتان ، فإذا أمرت من أمنى قلت : أمن ، ويقال : من منى يمني في الأمر : امن ، فإذا جئت بنون الفعل نون الخفيفة قلت : امنن . ومن ذهب به إلى المنة قال : من عليه ، فإذا أخرجه مخرج الأمر أبرز النونين ; لأنه كان مضاعفا فقال امنن . فيروى في الخبر أنه سخر له الشياطين ، فمن شاء من عليه بالعتق والتخلية ، ومن شاء أمسكه ، قال قتادة والسدي . وعلى ما روى عكرمة عن ابن عباس : أي : جامع من شئت من نسائك ، واترك جماع من شئت منهن لا حساب عليك .\n                                    ",
        "saadi": "هَٰذَا عَطَآؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ ٩٣\n                                        \n                                        \n                                        \n                                        وقلنا له: { هَذَا عَطَاؤُنَا } فَقَرَّ به عينا { فَامْنُنْ } على من شئت، { أَوْ أَمْسِكْ } من شئت { بِغَيْرِ حِسَابٍ } أي: لا حرج عليك في ذلك ولا حساب، لعلمه تعالى بكمال عدله، وحسن أحكامه، ولا تحسبن هذا لسليمان في الدنيا دون الآخرة، بل له في الآخرة خير عظيم.\n                                    "
      },
      "originalText": "هَٰذَا عَطَآؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَيۡرِ حِسَابٖ ٩٣"
    },
    {
      "number": 4010,
      "text": "وَإِنَّ لَهُ عِنْدَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 40,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 393,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَ‍َٔابٖ ٠٤\n                                    \n                                    \n                                    فقال : ( وإن له عندنا لزلفى وحسن مآب ) أي : في الدار الآخرة .\n                                    ",
        "qortoby": "وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَ‍َٔابٖ ٠٤\n                                    \n                                    \n                                    وإن له عندنا لزلفى وحسن مآب أي إن أنعمنا عليه في الدنيا فله عندنا في الآخرة قربة وحسن مرجع .\n                                    ",
        "saadi": "وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَ‍َٔابٖ ٠٤\n                                        \n                                        \n                                        \n                                        ولهذا قال: { وَإِنَّ لَهُ عِنْدَنَا لَزُلْفَى وَحُسْنَ مَآبٍ } أي: هو من المقربين عند اللّه المكرمين بأنواع الكرامات للّه.\nفصل فيما تبين لنا من الفوائد والحكم في قصة داود وسليمان عليهما السلام\nفمنها: أن اللّه تعالى يقص على نبيه محمد صلى اللّه عليه وسلم أخبار من قبله، ليثبت فؤاده وتطمئن نفسه، ويذكر له من عباداتهم وشدة صبرهم وإنابتهم، ما يشوقه إلى منافستهم، والتقرب إلى اللّه الذي تقربوا له، والصبر على أذى قومه، ولهذا - في هذا الموضع - لما ذكر اللّه ما ذكر من أذية قومه وكلامهم فيه وفيما جاء به، أمره بالصبر، وأن يذكر عبده داود فيتسلى به.\nومنها: أن اللّه تعالى يمدح ويحب القوة في طاعته، قوة القلب والبدن، فإنه يحصل منها من آثار الطاعة وحسنها وكثرتها، ما لا يحصل مع الوهن وعدم القوة، وأن العبد ينبغي له تعاطي أسبابها، وعدم الركون إلى الكسل والبطالة المخلة بالقوى المضعفة للنفس.\nومنها: أن الرجوع إلى اللّه في جميع الأمور، من أوصاف أنبياء اللّه وخواص خلقه، كما أثنى اللّه على داود وسليمان بذلك، فليقتد بهما المقتدون، وليهتد بهداهم السالكون { أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهِ }\nومنها: ما أكرم اللّه به نبيه داود عليه السلام، من حسن الصوت العظيم، الذي جعل اللّه بسببه الجبال الصم، والطيور البهم، يجاوبنه إذا رجَّع صوته بالتسبيح، ويسبحن معه بالعشي والإشراق.\nومنها: أن من أكبر نعم اللّه على عبده، أن يرزقه العلم النافع، ويعرف الحكم والفصل بين الناس، كما امتن اللّه به على عبده داود عليه السلام.\nومنها: اعتناء اللّه تعالى بأنبيائه وأصفيائه عندما يقع منهم بعض الخلل بفتنته إياهم وابتلائهم بما به يزول عنهم المحذور، ويعودون إلى أكمل من حالتهم الأولى، كما جرى لداود وسليمان عليهما السلام.\nومنها: أن الأنبياء صلوات اللّه وسلامه عليهم معصومون من الخطأ فيما يبلغون عن اللّه تعالى، لأن مقصود الرسالة لا يحصل إلا بذلك، وأنه قد يجري منهم بعض مقتضيات الطبيعة من المعاصي، ولكن اللّه يتداركهم ويبادرهم بلطفه.\nومنها: أن داود عليه السلام، [كان] في أغلب أحواله ملازما محرابه لخدمة ربه، ولهذا تسور الخصمان عليه المحراب، لأنه كان إذا خلا في محرابه لا يأتيه أحد، فلم يجعل كل وقته للناس، مع كثرة ما يرد عليه من الأحكام، بل جعل له وقتا يخلو فيه بربه، وتقر عينه بعبادته، وتعينه على الإخلاص في جميع أموره.\nومنها: أنه ينبغي استعمال الأدب في الدخول على الحكام وغيرهم، فإن الخصمين لما دخلا على داود في حالة غير معتادة ومن غير الباب المعهود، فزع منهم، واشتد عليه ذلك، ورآه غير لائق بالحال.\nومنها: أنه لا يمنع الحاكم من الحكم بالحق سوء أدب الخصم وفعله ما لا ينبغي.\nومنها: كمال حلم داود عليه السلام، فإنه ما غضب عليهما حين جاءاه بغير استئذان، وهو الملك، ولا انتهرهما، ولا وبخهما.\nومنها: جواز قول المظلوم لمن ظلمه \"أنت ظلمتني\" أو \"يا ظالم\" ونحو ذلك أو باغ علي لقولهما: { خَصْمَانِ بَغَى بَعْضُنَا عَلَى بَعْضٍ }\nومنها: أن الموعوظ والمنصوح، ولو كان كبير القدر، جليل العلم، إذا نصحه أحد، أو وعظه، لا يغضب، ولا يشمئز، بل يبادره بالقبول والشكر، فإن الخصمين نصحا داود فلم يشمئز ولم يغضب ولم يثنه ذلك عن الحق، بل حكم بالحق الصرف.\nومنها: أن المخالطة بين الأقارب والأصحاب، وكثرة التعلقات الدنيوية المالية، موجبة للتعادي بينهم، وبغي بعضهم على بعض، وأنه لا يرد عن ذلك إلا استعمال تقوى اللّه، والصبر على الأمور، بالإيمان والعمل الصالح، وأن هذا من أقل شيء في الناس.\nومنها: أن الاستغفار والعبادة، خصوصا الصلاة، من مكفرات الذنوب، فإن اللّه، رتب مغفرة ذنب داود على استغفاره وسجوده.\nومنها: إكرام اللّه لعبده داود وسليمان، بالقرب منه، وحسن الثواب، وأن لا يظن أن ما جرى لهما منقص لدرجتهما عند اللّه تعالى، وهذا من تمام لطفه بعباده المخلصين، أنه إذا غفر لهم وأزال أثر ذنوبهم، أزال الآثار المترتبة عليه كلها، حتى ما يقع في قلوب الخلق، فإنهم إذا علموا ببعض ذنوبهم، وقع في قلوبهم نزولهم عن درجتهم الأولى، فأزال اللّه تعالى هذه الآثار، وما ذاك بعزيز على الكريم الغفار.\nومنها: أن الحكم بين الناس مرتبة دينية، تولاها رسل اللّه وخواص خلقه، وأن وظيفة القائم بها الحكم بالحق ومجانبة الهوى، فالحكم بالحق يقتضي العلم بالأمور الشرعية، والعلم بصورة القضية المحكوم بها، وكيفية إدخالها في الحكم الشرعي، فالجاهل بأحد الأمرين لا يصلح للحكم، ولا يحل له الإقدام عليه.\nومنها: أنه ينبغي للحاكم أن يحذر الهوى، ويجعله منه على بال، فإن النفوس لا تخلو منه، بل يجاهد نفسه بأن يكون الحق مقصوده، وأن يلقي عنه وقت الحكم كل محبة أو بغض لأحد الخصمين.\nومنها: أن سليمان عليه السلام من فضائل داود، ومن منن اللّه عليه حيث وهبه له، وأن من أكبر نعم اللّه على عبده، أن يهب له ولدا صالحا، فإن كان عالما، كان نورا على نور.\nومنها: ثناء اللّه تعالى على سليمان ومدحه في قوله { نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ }\nومنها: كثرة خير اللّه وبره بعبيده، أن يمن عليهم بصالح الأعمال ومكارم الأخلاق، ثم يثني عليهم بها، وهو المتفضل الوهاب.\nومنها: تقديم سليمان محبة اللّه تعالى على محبة كل شيء.\nومنها: أن كل ما أشغل العبد عن اللّه، فإنه مشئوم مذموم، فَلْيُفَارِقْه ولْيُقْبِلْ على ما هو أنفع له.\nومنها: القاعدة المشهورة \"من ترك شيئا لله عوضه اللّه خيرا منه\" فسليمان عليه السلام عقر الجياد الصافنات المحبوبة للنفوس، تقديما لمحبة اللّه، فعوضه اللّه خيرا من ذلك، بأن سخر له الريح الرخاء اللينة، التي تجري بأمره إلى حيث أراد وقصد، غدوها شهر، ورواحها شهر، وسخر له الشياطين، أهل الاقتدار على الأعمال التي لا يقدر عليها الآدميون.\nومنها: أن تسخير الشياطين لا يكون لأحد بعد سليمان عليه السلام.\nومنها: أن سليمان عليه السلام، كان ملكا نبيا، يفعل ما أراد، ولكنه لا يريد إلا العدل، بخلاف النبي العبد، فإنه تكون إرادته تابعة لأمر اللّه، فلا يفعل ولا يترك إلا بالأمر، كحال نبينا محمد صلى اللّه عليه وسلم، وهذه الحال أكمل.\n                                    "
      },
      "originalText": "وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَ‍َٔابٖ ٠٤"
    },
    {
      "number": 4011,
      "text": "وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 41,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 394,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ ١٤\n                                    \n                                    \n                                    يذكر تعالى عبده ورسوله أيوب - عليه السلام - وما كان ابتلاه تعالى به من الضر في جسده وماله وولده حتى لم يبق من جسده مغرز إبرة سليما سوى قلبه ولم يبق له من حال الدنيا شيء يستعين به على مرضه وما هو فيه غير أن زوجته حفظت وده لإيمانها بالله ورسوله فكانت تخدم الناس بالأجرة وتطعمه وتخدمه نحوا من ثماني عشرة سنة . وقد كان قبل ذلك في مال جزيل وأولاد وسعة طائلة من الدنيا فسلب جميع ذلك حتى آل به الحال إلى أن ألقي على مزبلة من مزابل البلدة هذه المدة بكمالها ورفضه القريب والبعيد سوى زوجته - رضي الله عنها - فإنها كانت لا تفارقه صباحا و [ لا ] مساء إلا بسبب خدمة الناس ثم تعود إليه قريبا . فلما طال المطال واشتد الحال وانتهى القدر المقدور وتم الأجل المقدر تضرع إلى رب العالمين وإله المرسلين فقال : ( أني مسني الضر وأنت أرحم الراحمين ) [ الأنبياء : 83 ] وفي هذه الآية الكريمة قال : رب ، إني مسني الشيطان بنصب وعذاب ، قيل : بنصب في بدني وعذاب في مالي وولدي . فعند ذلك استجاب له أرحم الراحمين وأمره أن يقوم من مقامه وأن يركض الأرض برجله . ففعل فأنبع الله عينا وأمره أن يغتسل منها فأذهب جميع ما كان في بدنه من الأذى ثم أمره فضرب الأرض في مكان آخر فأنبع له عينا أخرى وأمره أن يشرب منها فأذهبت ما كان في باطنه من السوء وتكاملت العافية ظاهرا وباطنا ولهذا قال تعالى : ( اركض برجلك هذا مغتسل بارد وشراب )\nقال ابن جرير ، وابن أبي حاتم جميعا : حدثنا يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني نافع بن يزيد عن عقيل عن ابن شهاب عن أنس بن مالك رضي الله عنه ، أن رسول الله - صلى الله عليه وسلم - قال : \" إن نبي الله أيوب - عليه السلام - لبث به بلاؤه ثماني عشرة سنة فرفضه القريب والبعيد إلا رجلين كانا من أخص إخوانه به كانا يغدوان إليه ويروحان فقال أحدهما لصاحبه : تعلم - والله - لقد أذنب أيوب ذنبا ما أذنبه أحد من العالمين . قال له صاحبه : وما ذاك ؟ قال : من ثماني عشرة سنة لم يرحمه الله ، فيكشف ما به فلما راحا إليه لم يصبر الرجل حتى ذكر ذلك له . فقال أيوب : لا أدري ما تقول غير أن الله يعلم أني كنت أمر على الرجلين يتنازعان فيذكران الله - عز وجل - فأرجع إلى بيتي فأكفر عنهما ، كراهية أن يذكرا الله إلا في حق . قال : وكان يخرج إلى حاجته فإذا قضاها أمسكت امرأته بيده حتى يبلغ فلما كان ذات يوم أبطأ عليها وأوحى الله تعالى إلى أيوب - عليه السلام - أن ( اركض برجلك هذا مغتسل بارد وشراب ) فاستبطأته فتلقته تنظر فأقبل عليها قد أذهب الله ما به من البلاء وهو على أحسن ما كان . فلما رأته قالت : أي بارك الله فيك هل رأيت نبي الله هذا المبتلى . فوالله على ذلك ما رأيت رجلا أشبه به منك إذ كان صحيحا . قال : فإني أنا هو . قال : وكان له أندران أندر للقمح وأندر للشعير فبعث الله سحابتين فلما كانت إحداهما على أندر القمح أفرغت فيه الذهب حتى فاض وأفرغت الأخرى في أندر الشعير حتى فاض . هذا لفظ ابن جرير رحمه الله\nوقال الإمام أحمد : حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه قال : هذا ما حدثنا أبو هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" بينما أيوب يغتسل عريانا خر عليه جراد من ذهب فجعل أيوب يحثو في ثوبه فناداه ربه يا أيوب ألم أكن أغنيتك عما ترى ؟ قال : بلى يا رب ولكن لا غنى بي عن بركتك \" .\nانفرد بإخراجه البخاري من حديث عبد الرزاق به\n                                    ",
        "qortoby": "وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ ١٤\n                                    \n                                    \n                                    قوله تعالى : واذكر عبدنا أيوب أمر للنبي - صلى الله عليه وسلم - بالاقتداء بهم في الصبر على المكاره . أيوب بدل . إذ نادى ربه أني مسني الشيطان بنصب وعذاب وقرأ عيسى بن عمر \" إني \" بكسر الهمزة أي : قال . قال الفراء : وأجمعت القراء على أن قرءوا \" بنصب \" بضم النون والتخفيف . النحاس : وهذا غلط وبعده مناقضة وغلط أيضا ; لأنه قال : أجمعت القراء على هذا ، وحكى بعده أنهم ذكروا عن يزيد بن القعقاع أنه قرأ : \" بنصب \" بفتح النون والصاد ، فغلط على أبي جعفر ، وإنما قرأ أبو جعفر : \" بنصب \" بضم النون والصاد ، كذا حكاه أبو عبيد وغيره ، وهو مروي عن الحسن . فأما \" بنصب \" فقراءة عاصم الجحدري ويعقوب الحضرمي . وقد رويت هذه القراءة عن الحسن ، وقد حكي \" بنصب \" بفتح النون وسكون الصاد عن أبي جعفر . وهذا كله عند أكثر النحويين بمعنى النصب ، فنصب ونصب كحزن وحزن . وقد يجوز أن يكون نصب جمع نصب كوثن ووثن . ويجوز أن يكون نصب بمعنى نصب حذفت منه الضمة ، فأما وما ذبح على النصب فقيل : إنه جمع نصاب . وقال أبو عبيدة وغيره : النصب الشر والبلاء . والنصب التعب والإعياء . وقد قيل في معنى : أني مسني الشيطان بنصب وعذاب أي : ما يلحقه من وسوسته لا غير . والله أعلم . ذكره النحاس . وقيل : إن النصب ما أصابه في بدنه ، والعذاب ما أصابه في ماله ، وفيه بعد . وقال المفسرون : إن أيوب كان روميا من البثنية وكنيته أبو عبد الله في قول الواقدي ، اصطفاه الله بالنبوة ، وآتاه جملة عظيمة من الثروة في أنواع الأموال والأولاد . وكان شاكرا لأنعم الله ، مواسيا لعباد الله ، برا رحيما . ولم يؤمن به إلا ثلاثة نفر . وكان لإبليس موقف من السماء السابعة في يوم من الأيام ، فوقف به إبليس على عادته ، فقال الله له أو قيل له عنه : أقدرت من عبدي أيوب على شيء ؟ فقال : يا رب وكيف أقدر منه على شيء ، وقد ابتليته بالمال والعافية ، فلو ابتليته بالبلاء والفقر ونزعت منه ما أعطيته لحال عن حاله ، ولخرج عن طاعتك . قال الله : قد سلطتك على أهله وماله . فانحط عدو الله فجمع عفاريت الجن فأعلمهم ، وقال قائل منهم : أكون إعصارا فيه نار أهلك ماله ، فكان . فجاء أيوب في صورة قيم ماله فأعلمه بما جرى ، فقال : الحمد لله هو أعطاه وهو منعه . ثم جاء قصره بأهله وولده ، فاحتمل القصر من نواحيه حتى ألقاه على أهله وولده ، ثم جاء إليه وأعلمه فألقى التراب على رأسه ، وصعد إبليس إلى السماء فسبقته توبة أيوب . قال : يا رب سلطني على بدنه . قال : قد سلطتك على بدنه إلا على لسانه وقلبه وبصره ، فنفخ في جسده نفخة اشتعل منها فصار في جسده ثآليل فحكها بأظفاره حتى دميت ، ثم بالفخار حتى تساقط لحمه . وقال عند ذلك : مسني الشيطان . ولم يخلص إلى شيء من حشوة البطن ; لأنه لا بقاء للنفس إلا بها ، فهو يأكل ويشرب ، فمكث كذلك ثلاث سنين . فلما غلبه أيوب اعترض لامرأته في هيئة أعظم من هيئة بني آدم في القدر والجمال ، وقال لها : أنا إله الأرض ، وأنا الذي صنعت بصاحبك ما صنعت ، ولو سجدت لي سجدة واحدة لرددت عليه أهله وماله ، وهم عندي . وعرض لها في بطن الوادي ذلك كله في صورته ، أي : أظهره لها ، فأخبرت أيوب فأقسم أن يضربها إن عافاه الله . وذكروا كلاما طويلا في سبب بلائه ومراجعته لربه ، وتبرمه من البلاء الذي نزل به ، وأن النفر الثلاثة الذين آمنوا به نهوه عن ذلك واعترضوا عليه ، وقيل : استعان به مظلوم فلم ينصره فابتلي بسبب ذلك . وقيل : استضاف يوما الناس فمنع فقيرا الدخول فابتلي بذلك . وقيل : كان أيوب يغزو ملكا وكان له غنم في ولايته ، فداهنه لأجلها بترك غزوه فابتلي . وقيل : كان الناس يتعدون امرأته ويقولون : نخشى العدوى ، وكانوا يستقذرونها ، فلهذا قال . مسني الشيطان . وامرأته ليا بنت يعقوب . وكان أيوب في زمن يعقوب وكانت أمه ابنة لوط . وقيل : كانت زوجة أيوب رحمة بنت إفرائيم بن يوسف بن يعقوب عليهم السلام . ذكر القولين الطبري رحمه الله . قال ابن العربي : ما ذكره المفسرون من أن إبليس كان له مكان في السماء السابعة يوما من العام فقول باطل ; لأنه أهبط منها بلعنة وسخط إلى الأرض ، فكيف يرقى إلى محل الرضا ، ويجول في مقامات الأنبياء ، ويخترق السماوات العلى ، ويعلو إلى السماء السابعة إلى منازل الأنبياء ، فيقف موقف الخليل ؟ ! إن هذا لخطب من الجهالة عظيم . وأما قولهم : إن الله تعالى قال له : هل قدرت من عبدي أيوب على شيء ، فباطل قطعا ; لأن الله - عز وجل - لا يكلم الكفار الذين هم من جند إبليس الملعون ، فكيف يكلم من تولى إضلالهم ؟ ! وأما قولهم : إن الله قال : قد سلطتك على ماله وولده ، فذلك ممكن في القدرة ، ولكنه بعيد في هذه القصة . وكذلك قولهم : إنه نفخ في جسده حين سلطه عليه ، فهو أبعد ، والباري سبحانه قادر على أن يخلق ذلك كله من غير أن يكون للشيطان فيه كسب حتى تقر له - لعنة الله عليه - عين بالتمكن من الأنبياء في أموالهم وأهليهم وأنفسهم . وأما قولهم : إنه قال لزوجته : أنا إله الأرض ، ولو تركت ذكر الله وسجدت أنت لي لعافيته ، فاعلموا وإنكم لتعلمون أنه لو عرض لأحدكم وبه ألم وقال هذا الكلام ما جاز عنده أن يكون إلها في الأرض ، وأنه يسجد له ، وأنه يعافي من البلاء ، فكيف أن تستريب زوجة نبي ؟ ! ولو كانت زوجة سوادي أو فدم بربري ما ساغ ذلك عندها . وأما تصويره الأموال والأهل في واد للمرأة فذلك ما لا يقدر عليه إبليس بحال ، ولا هو في طريق السحر فيقال إنه من جنسه . ولو تصور لعلمت المرأة أنه سحر كما نعلمه نحن ، وهي فوقنا في المعرفة بذلك ، فإنه لم يخل زمان قط من السحر وحديثه وجريه بين الناس وتصويره . قال القاضي : والذي جرأهم على ذلك وتذرعوا به إلى ذكر هذا قوله تعالى : إذ نادى ربه أني مسني الشيطان بنصب وعذاب فلما رأوه قد شكا مس الشيطان أضافوا إليه من رأيهم ما سبق من التفسير في هذه الأقوال . وليس الأمر كما زعموا والأفعال كلها خيرها وشرها . في إيمانها وكفرها ، طاعتها وعصيانها ، خالقها هو الله لا شريك له في خلقه ، ولا في خلق شيء غيرها ، ولكن الشر لا ينسب إليه ذكرا ، وإن كان موجودا منه خلقا ، أدبا أدبنا به ، وتحميدا علمناه . وكان من ذكر محمد - صلى الله عليه وسلم - لربه به قول من جملته : والخير في يديك والشر ليس إليك ، على هذا المعنى . ومنه قول إبراهيم : وإذا مرضت فهو يشفين وقال الفتى للكليم : وما أنسانيه إلا الشيطان .\nوأما قولهم : إنه استعان به مظلوم فلم ينصره ، فمن لنا بصحة هذا القول . ولا يخلو أن يكون قادرا على نصره ، فلا يحل لأحد تركه فيلام على أنه عصى وهو منزه عن ذلك . أو كان عاجزا فلا شيء عليه في ذلك ، وكذلك قولهم : إنه منع فقيرا من الدخول ، إن كان علم به فهو باطل عليه ، وإن لم يعلم به فلا شيء عليه فيه . وأما قولهم : إنه داهن على غنمه الملك الكافر ، فلا تقل داهن ، ولكن قل : دارى . ودفع الكافر والظالم عن النفس أو المال بالمال جائز ، نعم ويحسن الكلام . قال ابن العربي القاضي أبو بكر - رضي الله عنه - : ولم يصح عن أيوب في أمره إلا ما أخبرنا الله عنه في كتابه في آيتين ، الأولى قوله تعالى : وأيوب إذ نادى ربه أني مسني الضر والثانية في : [ ص ] أني مسني الشيطان بنصب وعذاب . وأما النبي - صلى الله عليه وسلم - فلم يصح عنه أنه ذكره بحرف واحد إلا قوله : بينا أيوب يغتسل إذ خر عليه رجل من جراد من ذهب . . . الحديث . وإذ لم يصح عنه فيه قرآن ولا سنة إلا ما ذكرناه ، فمن الذي يوصل السامع إلى أيوب خبره ، أم على أي لسان سمعه ؟ والإسرائيليات مرفوضة عند العلماء على البتات ، فأعرض عن سطورها بصرك ، وأصمم عن سماعها أذنيك ، فإنها لا تعطي فكرك إلا خيالا ، ولا تزيد فؤادك إلا خبالا . وفي الصحيح واللفظ للبخاري أن ابن عباس قال : يا معشر المسلمين ، تسألون أهل الكتاب وكتابكم الذي أنزل على نبيكم أحدث الأخبار بالله ، تقرءونه محضا لم يشب ، وقد حدثكم أن أهل الكتاب قد بدلوا من كتب الله وغيروا وكتبوا بأيديهم الكتب ، فقالوا : هذا من عند الله ليشتروا به ثمنا قليلا ولا ينهاكم ما جاءكم من العلم عن مسألتهم ، فلا والله ما رأينا رجلا منهم يسألكم عن الذي أنزل عليكم ، وقد أنكر النبي - صلى الله عليه وسلم - في حديث الموطأ على عمر قراءته التوراة .\n                                    ",
        "saadi": "وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ ١٤\n                                        \n                                        \n                                        \n                                        أي: { وَاذْكُرْ } في هذا الكتاب ذي الذكر { عَبْدَنَا أَيُّوبَ } بأحسن الذكر، وأثن عليه بأحسن الثناء، حين أصابه الضر، فصبر على ضره، فلم يشتك لغير ربه، ولا لجأ إلا إليه.\nفـ { نَادَى رَبَّهُ } داعيا، وإليه لا إلى غيره شاكيا، فقال: رب { أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ } أي: بأمر مشق متعب معذب، وكان سلط على جسده فنفخ فيه حتى تقرح، ثم تقيح بعد ذلك واشتد به الأمر، وكذلك هلك أهله وماله.\n                                    "
      },
      "originalText": "وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ ١٤"
    },
    {
      "number": 4012,
      "text": "ارْكُضْ بِرِجْلِكَ ۖ هَٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ",
      "surah": {
        "number": 38,
        "name": "سورة ص",
        "englishName": "Saad",
        "englishNameTranslation": "The letter Saad",
        "revelationType": "Meccan",
        "numberOfAyahs": 88
      },
      "numberInSurah": 42,
      "juz": 23,
      "manzil": 6,
      "page": 455,
      "ruku": 394,
      "hizbQuarter": 182,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ ٢٤\n                                    \n                                    \n                                    يذكر تعالى عبده ورسوله أيوب - عليه السلام - وما كان ابتلاه تعالى به من الضر في جسده وماله وولده حتى لم يبق من جسده مغرز إبرة سليما سوى قلبه ولم يبق له من حال الدنيا شيء يستعين به على مرضه وما هو فيه غير أن زوجته حفظت وده لإيمانها بالله ورسوله فكانت تخدم الناس بالأجرة وتطعمه وتخدمه نحوا من ثماني عشرة سنة . وقد كان قبل ذلك في مال جزيل وأولاد وسعة طائلة من الدنيا فسلب جميع ذلك حتى آل به الحال إلى أن ألقي على مزبلة من مزابل البلدة هذه المدة بكمالها ورفضه القريب والبعيد سوى زوجته - رضي الله عنها - فإنها كانت لا تفارقه صباحا و [ لا ] مساء إلا بسبب خدمة الناس ثم تعود إليه قريبا . فلما طال المطال واشتد الحال وانتهى القدر المقدور وتم الأجل المقدر تضرع إلى رب العالمين وإله المرسلين فقال : ( أني مسني الضر وأنت أرحم الراحمين ) [ الأنبياء : 83 ] وفي هذه الآية الكريمة قال : رب ، إني مسني الشيطان بنصب وعذاب ، قيل : بنصب في بدني وعذاب في مالي وولدي . فعند ذلك استجاب له أرحم الراحمين وأمره أن يقوم من مقامه وأن يركض الأرض برجله . ففعل فأنبع الله عينا وأمره أن يغتسل منها فأذهب جميع ما كان في بدنه من الأذى ثم أمره فضرب الأرض في مكان آخر فأنبع له عينا أخرى وأمره أن يشرب منها فأذهبت ما كان في باطنه من السوء وتكاملت العافية ظاهرا وباطنا ولهذا قال تعالى : ( اركض برجلك هذا مغتسل بارد وشراب )\nقال ابن جرير ، وابن أبي حاتم جميعا : حدثنا يونس بن عبد الأعلى أخبرنا ابن وهب أخبرني نافع بن يزيد عن عقيل عن ابن شهاب عن أنس بن مالك رضي الله عنه ، أن رسول الله - صلى الله عليه وسلم - قال : \" إن نبي الله أيوب - عليه السلام - لبث به بلاؤه ثماني عشرة سنة فرفضه القريب والبعيد إلا رجلين كانا من أخص إخوانه به كانا يغدوان إليه ويروحان فقال أحدهما لصاحبه : تعلم - والله - لقد أذنب أيوب ذنبا ما أذنبه أحد من العالمين . قال له صاحبه : وما ذاك ؟ قال : من ثماني عشرة سنة لم يرحمه الله ، فيكشف ما به فلما راحا إليه لم يصبر الرجل حتى ذكر ذلك له . فقال أيوب : لا أدري ما تقول غير أن الله يعلم أني كنت أمر على الرجلين يتنازعان فيذكران الله - عز وجل - فأرجع إلى بيتي فأكفر عنهما ، كراهية أن يذكرا الله إلا في حق . قال : وكان يخرج إلى حاجته فإذا قضاها أمسكت امرأته بيده حتى يبلغ فلما كان ذات يوم أبطأ عليها وأوحى الله تعالى إلى أيوب - عليه السلام - أن ( اركض برجلك هذا مغتسل بارد وشراب ) فاستبطأته فتلقته تنظر فأقبل عليها قد أذهب الله ما به من البلاء وهو على أحسن ما كان . فلما رأته قالت : أي بارك الله فيك هل رأيت نبي الله هذا المبتلى . فوالله على ذلك ما رأيت رجلا أشبه به منك إذ كان صحيحا . قال : فإني أنا هو . قال : وكان له أندران أندر للقمح وأندر للشعير فبعث الله سحابتين فلما كانت إحداهما على أندر القمح أفرغت فيه الذهب حتى فاض وأفرغت الأخرى في أندر الشعير حتى فاض . هذا لفظ ابن جرير رحمه الله\nوقال الإمام أحمد : حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه قال : هذا ما حدثنا أبو هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" بينما أيوب يغتسل عريانا خر عليه جراد من ذهب فجعل أيوب يحثو في ثوبه فناداه ربه يا أيوب ألم أكن أغنيتك عما ترى ؟ قال : بلى يا رب ولكن لا غنى بي عن بركتك \" .\nانفرد بإخراجه البخاري من حديث عبد الرزاق به\n                                    ",
        "qortoby": "ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ ٢٤\n                                    \n                                    \n                                    قوله تعالى : اركض برجلك الركض الدفع بالرجل . يقال : ركض الدابة وركض ثوبه برجله . وقال المبرد : الركض التحريك ، ولهذا قال الأصمعي : يقال ركضت الدابة ولا يقال ركضت هي ; لأن الركض إنما هو تحريك راكبها رجليه ، ولا فعل لها في ذلك . وحكى سيبويه : ركضت الدابة فركضت مثل جبرت العظم فجبر ، وحزنته فحزن ، وفي الكلام إضمار أي : قلنا له : اركض . قال الكسائي : وهذا لما عافاه الله . هذا مغتسل بارد وشراب أي فركض فنبعت عين ماء فاغتسل به ، فذهب الداء من ظاهره ، ثم شرب منه فذهب الداء من باطنه . وقال قتادة : هما عينان بأرض الشام في أرض يقال لها الجابية ، فاغتسل من إحداهما فأذهب الله تعالى ظاهر دائه ، وشرب من الأخرى فأذهب الله تعالى باطن دائه . ونحوه عن الحسن ومقاتل ، قال مقاتل : نبعت عين حارة واغتسل فيها فخرج صحيحا ، ثم نبعت عين أخرى فشرب منها ماء عذبا . وقيل : أمر بالركض بالرجل ليتناثر عنه كل داء في جسده . والمغتسل الماء الذي يغتسل به ، قال القتبي : وقيل : إنه الموضع الذي يغتسل فيه ، قال مقاتل . الجوهري : واغتسلت بالماء ، والغسول : الماء الذي يغتسل به ، وكذلك المغتسل ، قال الله تعالى : هذا مغتسل بارد وشراب والمغتسل أيضا الذي يغتسل فيه ، والمغسل والمغسل بكسر السين وفتحها مغسل الموتى والجمع المغاسل . واختلف كم بقي أيوب في البلاء ، فقال ابن عباس : سبع سنين وسبعة أشهر وسبعة أيام وسبع ساعات . وقال وهب بن منبه : أصاب أيوب البلاء سبع سنين ، وترك يوسف ، في السجن سبع سنين ، وعذب بختنصر وحول في السباع سبع سنين . ذكره أبو نعيم . وقيل : عشر سنين . وقيل : ثمان عشرة سنة . رواه أنس مرفوعا فيما ذكر الماوردي : قلت : وذكره ابن المبارك ، أخبرنا يونس بن يزيد ، عن عقيل عن ابن شهاب أن رسول الله - صلى الله عليه وسلم - ذكر يوما أيوب ، وما أصابه من البلاء ، وذكر أن البلاء الذي أصابه كان به ثمان عشرة سنة . وذكر الحديث القشيري . وقيل : أربعين سنة .\n\n                                    ",
        "saadi": "ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ ٢٤\n                                        \n                                        \n                                        \n                                        فقيل له: { ارْكُضْ بِرِجْلِكَ } أي: اضرب الأرض بها، لينبع لك منها عين تغتسل منها وتشرب، فيذهب عنك الضر والأذى، ففعل ذلك، فذهب عنه الضر، وشفاه اللّه تعالى.\n                                    "
      },
      "originalText": "ٱرۡكُضۡ بِرِجۡلِكَۖ هَٰذَا مُغۡتَسَلُۢ بَارِدٞ وَشَرَابٞ ٢٤"
    }
  ]
}