{
  "number": 46,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 277,
      "text": "وَمَا أَنْفَقْتُمْ مِنْ نَفَقَةٍ أَوْ نَذَرْتُمْ مِنْ نَذْرٍ فَإِنَّ اللَّهَ يَعْلَمُهُ ۗ وَمَا لِلظَّالِمِينَ مِنْ أَنْصَارٍ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 270,
      "juz": 3,
      "manzil": 1,
      "page": 46,
      "ruku": 38,
      "hizbQuarter": 18,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَآ أَنفَقۡتُم مِّن نَّفَقَةٍ أَوۡ نَذَرۡتُم مِّن نَّذۡرٖ فَإِنَّ ٱللَّهَ يَعۡلَمُهُۥۗ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٍ ٠٧٢\n                                        \n                                        \n                                        يخبر تعالى بأنه عالم بجميع ما يفعله العاملون من الخيرات من النفقات والمنذورات وتضمن ذلك مجازاته على ذلك أوفر الجزاء للعاملين لذلك ابتغاء وجهه ورجاء موعوده . وتوعد من لا يعمل بطاعته ، بل خالف أمره وكذب خبره وعبد معه غيره ، فقال : ( وما للظالمين من أنصار ) أي : يوم القيامة ينقذونهم من عذاب الله ونقمته .\n                                    ",
        "qortoby": "وَمَآ أَنفَقۡتُم مِّن نَّفَقَةٍ أَوۡ نَذَرۡتُم مِّن نَّذۡرٖ فَإِنَّ ٱللَّهَ يَعۡلَمُهُۥۗ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٍ ٠٧٢\n                                        \n                                        \n                                        قوله تعالى : وما أنفقتم من نفقة أو نذرتم من نذر فإن الله يعلمه وما للظالمين من أنصار\nشرط وجوابه ، وكانت النذور من سيرة العرب تكثر منها ، فذكر الله تعالى النوعين ، ما يفعله المرء متبرعا ، وما يفعله بعد إلزامه لنفسه . وفي الآية معنى الوعد والوعيد ، أي من كان خالص النية فهو مثاب ، ومن أنفق رياء أو لمعنى آخر مما يكسبه المن والأذى ونحو ذلك فهو ظالم ، يذهب فعله باطلا ولا يجد له ناصرا فيه . ومعنى ( يعلمه ) يحصيه ، قاله مجاهد . ووحد الضمير وقد ذكر شيئين ، فقال النحاس : التقدير \" وما أنفقتم من نفقة \" فإن الله يعلمها ، \" أو نذرتم من نذر فإن الله يعلمه \" ثم حذف . ويجوز أن يكون التقدير : وما أنفقتم فإن الله يعلمه وتعود الهاء على \" ما \" كما أنشد سيبويه لامرئ القيس :\nفتوضح فالمقراة لم يعف رسمها لما نسجتها من جنوب وشمأل\nويكون أو نذرتم من نذر معطوفا عليه . قال ابن عطية : ووحد الضمير في يعلمه وقد ذكر شيئين من حيث أراد ما ذكر أو نص .\nقلت : وهذا حسن : فإن الضمير قد يراد به جميع المذكور وإن كثر . والنذر حقيقة العبارة عنه أن تقول : هو ما أوجبه المكلف على نفسه من العبادات مما لو لم يوجبه لم يلزمه ، تقول : نذر الرجل كذا إذا التزم فعله ، ينذر - بضم الذال - وينذر - بكسرها - . وله أحكام يأتي بيانها في غير هذا الموضع إن شاء الله تعالى .\n                                    ",
        "saadi": "وَمَآ أَنفَقۡتُم مِّن نَّفَقَةٍ أَوۡ نَذَرۡتُم مِّن نَّذۡرٖ فَإِنَّ ٱللَّهَ يَعۡلَمُهُۥۗ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٍ ٠٧٢\n                                        \n                                        \n                                        \n                                        وهذا فيه المجازاة على النفقات، واجبها ومستحبها، قليلها وكثيرها، التي أمر الله بها، والنذور التي ألزمها المكلف نفسه، وإن الله تعالى يعلمها فلا يخفى عليه منها شيء، ويعلم ما صدرت عنه، هل هو الإخلاص أو غيره، فإن صدرت عن إخلاص وطلب لمرضاة الله جازى عليها بالفضل العظيم والثواب الجسيم، وإن لم ينفق العبد ما وجب عليه من النفقات ولم يوف ما أوجبه على نفسه من المنذورات، أو قصد بذلك رضى المخلوقات، فإنه ظالم قد وضع الشيء في غير موضعه، واستحق العقوبة البليغة، ولم ينفعه أحد من الخلق ولم ينصره، فلهذا قال: { وما للظالمين من أنصار }\n                                    "
      },
      "originalText": "وَمَآ أَنفَقۡتُم مِّن نَّفَقَةٍ أَوۡ نَذَرۡتُم مِّن نَّذۡرٖ فَإِنَّ ٱللَّهَ يَعۡلَمُهُۥۗ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٍ ٠٧٢"
    },
    {
      "number": 278,
      "text": "إِنْ تُبْدُوا الصَّدَقَاتِ فَنِعِمَّا هِيَ ۖ وَإِنْ تُخْفُوهَا وَتُؤْتُوهَا الْفُقَرَاءَ فَهُوَ خَيْرٌ لَكُمْ ۚ وَيُكَفِّرُ عَنْكُمْ مِنْ سَيِّئَاتِكُمْ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 271,
      "juz": 3,
      "manzil": 1,
      "page": 46,
      "ruku": 38,
      "hizbQuarter": 18,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن تُبۡدُواْ ٱلصَّدَقَٰتِ فَنِعِمَّا هِيَۖ وَإِن تُخۡفُوهَا وَتُؤۡتُوهَا ٱلۡفُقَرَآءَ فَهُوَ خَيۡرٞ لَّكُمۡۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّ‍َٔاتِكُمۡۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ١٧٢\n                                        \n                                        \n                                        وقوله : ( إن تبدوا الصدقات فنعما هي ) أي : إن أظهرتموها فنعم شيء هي .\nوقوله : ( وإن تخفوها وتؤتوها الفقراء فهو خير لكم ) فيه دلالة على أن إسرار الصدقة أفضل من إظهارها ; لأنه أبعد عن الرياء ، إلا أن يترتب على الإظهار مصلحة راجحة ، من اقتداء الناس به ، فيكون أفضل من هذه الحيثية ، وقال رسول الله صلى الله عليه وسلم : \" الجاهر بالقرآن كالجاهر بالصدقة والمسر بالقرآن كالمسر بالصدقة \" .\nوالأصل أن الإسرار أفضل ، لهذه الآية ، ولما ثبت في الصحيحين ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" سبعة يظلهم الله في ظله يوم لا ظل إلا ظله : إمام عادل ، وشاب نشأ في عبادة الله ، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه ، ورجل قلبه معلق بالمسجد إذا خرج منه حتى يرجع إليه ، ورجل ذكر الله خاليا ففاضت عيناه ، ورجل دعته امرأة ذات منصب وجمال فقال : إني أخاف الله ، ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه \" .\nوقال الإمام أحمد : حدثنا يزيد بن هارون ، أخبرنا العوام بن حوشب ، عن سليمان بن أبي سليمان ، عن أنس بن مالك ، عن النبي صلى الله عليه وآله وسلم قال : \" لما خلق الله الأرض جعلت تميد ، فخلق الجبال فألقاها عليها فاستقرت ، فتعجبت الملائكة من خلق الجبال ، فقالت : يا رب ، فهل من خلقك شيء أشد من الجبال ؟ قال : نعم ، الحديد . قالت : يا رب ، فهل من خلقك شيء أشد من الحديد ؟ قال : نعم ، النار . قالت : يا رب ، فهل من خلقك شيء أشد من النار ؟ قال : نعم ، الماء . قالت : يا رب ، فهل من خلقك شيء أشد من الماء ؟ قال : نعم ، الريح . قالت : يا رب ، فهل من خلقك شيء أشد من الريح ؟ قال : نعم ، ابن آدم يتصدق بيمينه فيخفيها من شماله \" .\nوقد ذكرنا في فضل آية الكرسي ، عن أبي ذر قال : قلت : يا رسول الله ، أي الصدقة أفضل ؟ قال : \" سر إلى فقير ، أو جهد من مقل \" . رواه أحمد .\nورواه ابن أبي حاتم من طريق علي بن يزيد ، عن القاسم ، عن أبي أمامة ، عن أبي ذر فذكره . وزاد : ثم نزع بهذه الآية : ( إن تبدوا الصدقات فنعما هي وإن تخفوها وتؤتوها الفقراء فهو خير لكم ) الآية .\nوفي الحديث المروي : \" صدقة السر تطفئ غضب الرب ، عز وجل \" .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا الحسين بن زياد المحاربي مؤدب محارب ، أخبرنا موسى بن عمير ، عن عامر الشعبي في قوله : ( إن تبدوا الصدقات فنعما هي وإن تخفوها وتؤتوها الفقراء فهو خير لكم ) قال : أنزلت في أبي بكر وعمر ، رضي الله عنهما ، فأما عمر فجاء بنصف ماله حتى دفعه إلى النبي صلى الله عليه وسلم : فقال له النبي صلى الله عليه وسلم : \" ما خلفت وراءك لأهلك يا عمر ؟ \" . قال : خلفت لهم نصف مالي ، وأما أبو بكر فجاء بماله كله يكاد أن يخفيه من نفسه ، حتى دفعه إلى النبي صلى الله عليه وسلم . فقال له النبي صلى الله عليه وسلم : \" ما خلفت وراءك لأهلك يا أبا بكر ؟ \" . فقال : عدة الله وعدة رسوله . فبكى عمر ، رضي الله عنه ، وقال : بأبي أنت يا أبا بكر ، والله ما استبقنا إلى باب خير قط إلا كنت سابقا .\nوهذا الحديث مروي من وجه آخر ، عن عمر ، رضي الله عنه . وإنما أوردناه هاهنا لقول الشعبي : إن الآية نزلت في ذلك ، ثم إن الآية عامة في أن إخفاء الصدقة أفضل ، سواء كانت مفروضة أو مندوبة . لكن روى ابن جرير من طريق علي بن أبي طلحة ، عن ابن عباس ، في تفسير هذه الآية ، قال : جعل الله صدقة السر في التطوع تفضل علانيتها ، فقال : بسبعين ضعفا . وجعل صدقة الفريضة علانيتها أفضل من سرها ، فقال : بخمسة وعشرين ضعفا .\nوقوله : ( ويكفر عنكم من سيئاتكم ) أي : بدل الصدقات ، ولا سيما إذا كانت سرا يحصل لكم الخير في رفع الدرجات ويكفر عنكم السيئات ، وقد قرئ : \" ويكفر عنكم \" بالضم ، وقرئ : \" ونكفر \" بالجزم ، عطفا على جواب الشرط ، وهو قوله : ( فنعما هي ) كقوله : \" فأصدق وأكون \" ( وأكن ) .\nوقوله ( والله بما تعملون خبير ) أي : لا يخفى عليه من ذلك شيء ، وسيجزيكم عليه [ سبحانه وبحمده ] .\n                                    ",
        "qortoby": "إِن تُبۡدُواْ ٱلصَّدَقَٰتِ فَنِعِمَّا هِيَۖ وَإِن تُخۡفُوهَا وَتُؤۡتُوهَا ٱلۡفُقَرَآءَ فَهُوَ خَيۡرٞ لَّكُمۡۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّ‍َٔاتِكُمۡۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ١٧٢\n                                        \n                                        \n                                        قوله تعالى : إن تبدوا الصدقات فنعما هي وإن تخفوها وتؤتوها الفقراء فهو خير لكم ويكفر عنكم من سيئاتكم والله بما تعملون خبير\nذهب جمهور المفسرين إلى أن هذه الآية في صدقة التطوع ؛ لأن الإخفاء فيها أفضل من الإظهار ، وكذلك سائر العبادات الإخفاء أفضل في تطوعها لانتفاء الرياء عنها ، وليس كذلك الواجبات . قال الحسن : إظهار الزكاة أحسن ، وإخفاء التطوع أفضل ؛ لأنه أدل على أنه يراد الله عز وجل به وحده . قال ابن عباس : جعل الله صدقة السر في التطوع تفضل علانيتها يقال بسبعين ضعفا ، وجعل صدقة الفريضة علانيتها أفضل من سرها يقال بخمسة وعشرين ضعفا . قال : وكذلك جميع الفرائض والنوافل في الأشياء كلها .\nقلت : مثل هذا لا يقال من جهة الرأي وإنما هو توقيف ، وفي صحيح مسلم عن النبي صلى الله عليه وسلم أنه قال : أفضل صلاة المرء في بيته إلا المكتوبة وذلك أن الفرائض لا يدخلها رياء والنوافل عرضة لذلك . وروى النسائي عن عقبة بن عامر أن رسول الله صلى الله عليه وسلم : إن الذي يجهر بالقرآن كالذي يجهر بالصدقة والذي يسر بالقرآن كالذي يسر بالصدقة . وفي الحديث : صدقة السر تطفئ غضب الرب .\nقال ابن العربي : وليس في تفضيل صدقة العلانية على السر ، ولا تفضيل صدقة السر على العلانية حديث صحيح ولكنه الإجماع الثابت ، فأما صدقة النفل فالقرآن ورد مصرحا ، بأنها في السر أفضل منها في الجهر ، بيد أن علماءنا قالوا : إن هذا على الغالب مخرجه ، والتحقيق فيه أن الحال في الصدقة تختلف بحال المعطي لها والمعطى إياها والناس الشاهدين لها . أما المعطي فله فيها فائدة إظهار السنة وثواب القدوة .\nقلت : هذا لمن قويت حاله وحسنت نيته وأمن على نفسه الرياء ، وأما من ضعف عن هذه المرتبة فالسر له أفضل . وأما المعطى إياها فإن السر له أسلم من احتقار الناس له ، أو نسبته إلى أنه أخذها مع الغنى عنها وترك التعفف ، وأما حال الناس فالسر عنهم أفضل من العلانية لهم ، من جهة أنهم ربما طعنوا على المعطي لها بالرياء وعلى الآخذ لها بالاستغناء ، ولهم فيها تحريك القلوب إلى الصدقة ، لكن هذا اليوم قليل .\nوقال يزيد بن أبي حبيب : إنما نزلت هذه الآية في الصدقة على اليهود والنصارى ، فكان يأمر بقسم الزكاة في السر . قال ابن عطية : وهذا مردود ، لا سيما عند السلف الصالح ، فقد قال الطبري : أجمع الناس على أن إظهار الواجب أفضل .\nقلت : ذكر الكيا الطبري أن في هذه الآية دلالة على قول إخفاء الصدقات مطلقا أولى ، وأنها حق الفقير وأنه يجوز لرب المال تفريقها بنفسه ، على ما هو أحد قولي الشافعي . وعلى القول الآخر ذكروا أن المراد بالصدقات هاهنا التطوع دون الفرض الذي إظهاره أولى لئلا يلحقه تهمة ، ولأجل ذلك قيل : صلاة النفل فرادى أفضل ، والجماعة في الفرض أبعد عن التهمة . وقال المهدوي : المراد بالآية فرض الزكاة وما تطوع به ، فكان الإخفاء أفضل في مدة النبي صلى الله عليه وسلم ، ثم ساءت ظنون الناس بعد ذلك ، فاستحسن العلماء إظهار الفرائض لئلا يظن بأحد المنع . قال ابن عطية : وهذا القول مخالف للآثار ، ويشبه في زماننا أن يحسن التستر بصدقة الفرض ، فقد كثر المانع لها وصار إخراجها عرضة للرياء . وقال ابن خويزمنداد : وقد يجوز أن يراد بالآية الواجبات من الزكاة والتطوع ؛ لأنه ذكر الإخفاء ، ومدحه والإظهار ومدحه ، فيجوز أن يتوجه إليهما جميعا . وقال النقاش : إن هذه الآية نسخها قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية الآية .\nقوله تعالى : فنعما هي ثناء على إبداء الصدقة ، ثم حكم على أن الإخفاء خير من ذلك . ولذلك قال بعض الحكماء : إذا اصطنعت المعروف فاستره ، وإذا اصطنع إليك فانشره . قال دعبل الخزاعي :\nإذا انتقموا أعلنوا أمرهم وإن أنعموا أنعموا باكتتام\nوقال سهل بن هارون :\nخل إذا جئته يوما لتسأله أعطاك ما ملكت كفاه واعتذرا\nيخفي صنائعه والله يظهرها إن الجميل إذا أخفيته ظهرا\nوقال العباس بن عبد المطلب رضي الله عنه : لا يتم المعروف إلا بثلاث خصال : تعجيله وتصغيره وستره ، فإذا أعجلته هنيته ، وإذا صغرته عظمته ، وإذا سترته أتممته . وقال بعض الشعراء فأحسن :\nزاد معروفك عندي عظما أنه عندك مستور حقير\nتتناساه كأن لم تأته وهو عند الناس مشهور خطير\nواختلف القراء في قوله فنعما هي فقرأ أبو عمرو ونافع في رواية ورش وعاصم في رواية حفص وابن كثير فنعما هي بكسر النون والعين . وقرأ أبو عمرو أيضا ونافع في غير رواية ورش وعاصم في رواية أبي بكر والمفضل \" فنعما \" بكسر النون وسكون العين . وقرأ الأعمش وابن عامر وحمزة والكسائي \" فنعما \" بفتح النون وكسر العين ، وكلهم سكن الميم . ويجوز في غير القرآن فنعم ما هي . قال النحاس : ولكنه في السواد متصل فلزم الإدغام . وحكى النحويون في \" نعم \" أربع لغات : نعم الرجل زيد ، هذا الأصل . ونعم الرجل ، بكسر النون لكسر العين . ونعم الرجل ، بفتح النون وسكون العين ، والأصل نعم حذفت الكسرة لأنها ثقيلة . ونعم الرجل ، وهذا أفصح اللغات ، والأصل فيها نعم . وهي تقع في كل مدح ، فخففت وقلبت كسرة العين على النون وأسكنت العين ، فمن قرأ فنعما هي فله تقديران : أحدهما أن يكون جاء به على لغة من يقول نعم . والتقدير الآخر أن يكون على اللغة الجيدة ، فيكون الأصل نعم ، ثم كسرت العين لالتقاء الساكنين . قال النحاس : فأما الذي حكي عن أبي عمرو ونافع من إسكان العين فمحال . حكي عن محمد بن يزيد أنه قال : أما إسكان العين والميم مشددة فلا يقدر أحد أن ينطق به ، وإنما يروم الجمع بين ساكنين ويحرك ولا يأبه . وقال أبو علي : من قرأ بسكون العين لم يستقم قوله ؛ لأنه جمع بين ساكنين الأول منهما ليس بحرف مد ولين وإنما يجوز ذلك عند النحويين إذا كان الأول حرف مد ، إذ المد يصير عوضا من الحركة ، وهذا نحو دابة وضوال ونحوه . ولعل أبا عمرو أخفى الحركة واختلسها كأخذه بالإخفاء في بارئكم - و - يأمركم فظن السامع الإخفاء إسكانا للطف ذلك في السمع وخفائه . قال أبو علي : وأما من قرأ \" نعما \" بفتح النون وكسر العين فإنما جاء بالكلمة على أصلها ومنه قول الشاعر :\nما أقلت قدماي إنهم نعم الساعون في الأمر المبر\nقال أبو علي : و \" ما \" من قوله تعالى : نعما في موضع نصب ، وقوله ( هي ) تفسير للفاعل المضمر قبل الذكر ، والتقدير نعم شيئا إبداؤها ، والإبداء هو المخصوص بالمدح إلا أن المضاف حذف وأقيم المضاف إليه مقامه . ويدلك على هذا قوله ( فهو خير لكم ) أي الإخفاء خير . فكما أن الضمير هنا للإخفاء لا للصدقات فكذلك ، أولا الفاعل هو الإبداء وهو الذي اتصل به الضمير ، فحذف الإبداء وأقيم ضمير الصدقات مثله . ( وإن تخفوها ) شرط ، فلذلك حذفت النون . \" وتؤتوها \" عطف عليه . والجواب \" فهو خير لكم \" .\n\" ويكفر \" اختلف القراء في قراءته ، فقرأ أبو عمرو وابن كثير وعاصم في رواية أبي بكر وقتادة وابن أبي إسحاق \" ونكفر \" بالنون ورفع الراء . وقرأ نافع وحمزة والكسائي بالنون والجزم في الراء ، وروي مثل ذلك أيضا عن عاصم . وروى الحسين بن علي الجعفي عن الأعمش \" يكفر \" بنصب الراء . وقرأ ابن عامر بالياء ورفع الراء ، ورواه حفص عن عاصم ، وكذلك روي عن الحسن ، وروي عنه بالياء والجزم . وقرأ ابن عباس \" وتكفر \" بالتاء وكسر الفاء وجزم الراء . وقرأ ، عكرمة \" وتكفر \" بالتاء وفتح الفاء وجزم الراء . وحكى المهدوي عن ابن هرمز أنه قرأ \" وتكفر \" بالتاء ورفع الراء . وحكي عن عكرمة وشهر بن حوشب أنهما قرأا بتاء ونصب الراء . فهذه تسع قراءات أبينها \" ونكفر \" بالنون والرفع . هذا قول الخليل وسيبويه . قال النحاس : قال سيبويه : والرفع هاهنا الوجه وهو الجيد ؛ لأن الكلام الذي بعد الفاء يجري مجراه في غير الجزاء . وأجاز الجزم بحمله على المعنى ؛ لأن المعنى وإن تخفوها وتؤتوها الفقراء يكن خيرا لكم ونكفر عنكم . وقال أبو حاتم : قرأ الأعمش \" يكفر \" بالياء دون واو قبلها . قال النحاس : والذي حكاه أبو حاتم عن الأعمش بغير واو جزما يكون على البدل كأنه في موضع الفاء . والذي روي عن عاصم ( ويكفر ) بالياء والرفع يكون معناه ويكفر الله ، هذا قول أبي عبيد . وقال أبو حاتم : معناه يكفر الإعطاء . وقرأ ابن عباس \" وتكفر \" يكون معناه وتكفر الصدقات . وبالجملة فما كان من هذه القراءات بالنون فهي نون العظمة ، وما كان منها بالتاء فهي الصدقة فاعلمه ، إلا ما روي عن عكرمة من فتح الفاء فإن التاء في تلك القراءة إنما هي للسيئات ، وما كان منها بالياء فالله تعالى هو المكفر ، والإعطاء في خفاء مكفر أيضا كما ذكرنا ، وحكاه مكي . وأما رفع الراء فهو على وجهين : أحدهما أن يكون الفعل خبر ابتداء تقديره ونحن نكفر أو وهي تكفر ، أعني الصدقة ، أو والله يكفر . والثاني القطع والاستئناف لا تكون الواو العاطفة للاشتراك لكن تعطف جملة كلام على جملة . وقد ذكرنا معنى قراءة الجزم . فأما نصب \" ونكفر \" فضعيف وهو على إضمار أن وجاز على بعد . قال المهدوي : وهو مشبه بالنصب في جواب الاستفهام ، إذ الجزاء يجب به الشيء لوجوب غيره كالاستفهام . والجزم في الراء أفصح هذه القراءات ؛ لأنها تؤذن بدخول التكفير في الجزاء وكونه مشروطا إن وقع الإخفاء . وأما الرفع فليس فيه هذا المعنى .\nقلت : هذا خلاف ما اختاره الخليل وسيبويه . و \" من \" في قوله من سيئاتكم للتبعيض المحض . وحكى الطبري عن فرقة أنها زائدة . قال ابن عطية : وذلك منهم خطأ . ( والله بما تعملون خبير ) وعد ووعيد .\n                                    ",
        "saadi": "إِن تُبۡدُواْ ٱلصَّدَقَٰتِ فَنِعِمَّا هِيَۖ وَإِن تُخۡفُوهَا وَتُؤۡتُوهَا ٱلۡفُقَرَآءَ فَهُوَ خَيۡرٞ لَّكُمۡۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّ‍َٔاتِكُمۡۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ١٧٢\n                                        \n                                        \n                                        \n                                        أي: { إن تبدوا الصدقات } فتظهروها وتكون علانية حيث كان القصد بها وجه الله { فنعما هي } أي: فنعم الشيء { هي } لحصول المقصود بها { وإن تخفوها } أي: تسروها { وتؤتوها الفقراء فهو خير لكم } ففي هذا أن صدقة السر على الفقير أفضل من صدقة العلانية، وأما إذا لم تؤت الصدقات الفقراء فمفهوم الآية أن السر ليس خيرا من العلانية، فيرجع في ذلك إلى المصلحة، فإن كان في إظهارها إظهار شعائر الدين وحصول الاقتداء ونحوه، فهو أفضل من الإسرار، ودل قوله: { وتؤتوها الفقراء } على أنه ينبغي للمتصدق أن يتحرى بصدقته المحتاجين، ولا يعطي محتاجا وغيره أحوج منه، ولما ذكر تعالى أن الصدقة خير للمتصدق ويتضمن ذلك حصول الثواب قال: { ويكفر عنكم من سيئاتكم } ففيه دفع العقاب { والله بما تعملون خبير } من خير وشر، قليل وكثير والمقصود من ذلك المجازاة.\n                                    "
      },
      "originalText": "إِن تُبۡدُواْ ٱلصَّدَقَٰتِ فَنِعِمَّا هِيَۖ وَإِن تُخۡفُوهَا وَتُؤۡتُوهَا ٱلۡفُقَرَآءَ فَهُوَ خَيۡرٞ لَّكُمۡۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّ‍َٔاتِكُمۡۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ١٧٢"
    },
    {
      "number": 279,
      "text": "۞ لَيْسَ عَلَيْكَ هُدَاهُمْ وَلَٰكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ ۗ وَمَا تُنْفِقُوا مِنْ خَيْرٍ فَلِأَنْفُسِكُمْ ۚ وَمَا تُنْفِقُونَ إِلَّا ابْتِغَاءَ وَجْهِ اللَّهِ ۚ وَمَا تُنْفِقُوا مِنْ خَيْرٍ يُوَفَّ إِلَيْكُمْ وَأَنْتُمْ لَا تُظْلَمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 272,
      "juz": 3,
      "manzil": 1,
      "page": 46,
      "ruku": 38,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": " لَّيۡسَ عَلَيۡكَ هُدَىٰهُمۡ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَلِأَنفُسِكُمۡۚ وَمَا تُنفِقُونَ إِلَّا ٱبۡتِغَآءَ وَجۡهِ ٱللَّهِۚ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ ٢٧٢\n                                        \n                                        \n                                        قال أبو عبد الرحمن النسائي : أخبرنا محمد بن عبد الله بن عبد الرحيم ، أخبرنا الفريابي ، حدثنا سفيان ، عن الأعمش ، عن جعفر بن إياس ، عن سعيد بن جبير ، عن ابن عباس قال : كانوا يكرهون أن يرضخوا لأنسابهم من المشركين فسألوا ، فرخص لهم ، فنزلت هذه الآية : ( ليس عليك هداهم ولكن الله يهدي من يشاء وما تنفقوا من خير فلأنفسكم وما تنفقون إلا ابتغاء وجه الله وما تنفقوا من خير يوف إليكم وأنتم لا تظلمون ) .\nوكذا رواه أبو حذيفة ، وابن المبارك ، وأبو أحمد الزبيري ، وأبو داود الحفري ، عن سفيان وهو الثوري به .\nوقال ابن أبي حاتم : أخبرنا أحمد بن القاسم بن عطية ، حدثني أحمد بن عبد الرحمن يعني الدشتكي حدثني أبي ، عن أبيه ، حدثنا أشعث بن إسحاق ، عن جعفر بن أبي المغيرة ، عن سعيد بن جبير ، عن ابن عباس ، عن النبي صلى الله عليه وسلم : أنه كان يأمر بألا يتصدق إلا على أهل الإسلام ، حتى نزلت هذه الآية : ( ليس عليك هداهم ) إلى آخرها ، فأمر بالصدقة بعدها على كل من سألك من كل دين . وسيأتي عند قوله تعالى : ( لا ينهاكم الله عن الذين لم يقاتلوكم في الدين ولم يخرجوكم من دياركم ) الآية [ الممتحنة : 8 ] حديث أسماء بنت الصديق في ذلك [ إن شاء الله تعالى ] .\nوقوله : ( وما تنفقوا من خير فلأنفسكم ) كقوله ( من عمل صالحا فلنفسه ) [ فصلت : 46 ، الجاثية : 15 ] ونظائرها في القرآن كثيرة .\nوقوله : ( وما تنفقون إلا ابتغاء وجه الله ) قال الحسن البصري : نفقة المؤمن لنفسه ، ولا ينفق المؤمن إذا أنفق إلا ابتغاء وجه الله .\nوقال عطاء الخراساني : يعني إذا أعطيت لوجه الله ، فلا عليك ما كان عمله ، وهذا معنى حسن ، وحاصله أن المتصدق إذا تصدق ابتغاء وجه الله فقد وقع أجره على الله ، ولا عليه في نفس الأمر لمن أصاب : ألبر أو فاجر أو مستحق أو غيره ، هو مثاب على قصده ، ومستند هذا تمام الآية : ( وما تنفقوا من خير يوف إليكم وأنتم لا تظلمون ) والحديث المخرج في الصحيحين ، من طريق أبي الزناد ، عن الأعرج ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" قال رجل : لأتصدقن الليلة بصدقة ، فخرج بصدقته فوضعها في يد زانية ، فأصبح الناس يتحدثون : تصدق على زانية ! فقال : اللهم لك الحمد على زانية ، لأتصدقن الليلة بصدقة ، فخرج بصدقته فوضعها في يد غني ، فأصبحوا يتحدثون : تصدق الليلة على غني ! فقال : اللهم لك الحمد على غني ، لأتصدقن الليلة بصدقة ، فخرج بصدقته فوضعها في يد سارق ، فأصبحوا يتحدثون : تصدق الليلة على سارق ! فقال : اللهم لك الحمد على زانية ، وعلى غني ، وعلى سارق ، فأتي فقيل له : أما صدقتك فقد قبلت ; وأما الزانية فلعلها أن تستعف بها عن زناها ، ولعل الغني يعتبر فينفق مما أعطاه الله ، ولعل السارق أن يستعف بها عن سرقته \" .\n                                    ",
        "qortoby": " لَّيۡسَ عَلَيۡكَ هُدَىٰهُمۡ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَلِأَنفُسِكُمۡۚ وَمَا تُنفِقُونَ إِلَّا ٱبۡتِغَآءَ وَجۡهِ ٱللَّهِۚ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ ٢٧٢\n                                        \n                                        \n                                        قوله تعالى : ليس عليك هداهم ولكن الله يهدي من يشاء وما تنفقوا من خير فلأنفسكم وما تنفقون إلا ابتغاء وجه الله وما تنفقوا من خير يوف إليكم وأنتم لا تظلمون\nقوله تعالى : ليس عليك هداهم ولكن الله يهدي من يشاء فيه ثلاث مسائل :\nالأولى : قوله تعالى : ليس عليك هداهم هذا الكلام متصل بذكر الصدقات ، فكأنه بين فيه جواز الصدقة على المشركين . روى سعيد بن جبير مرسلا عن النبي صلى الله عليه وسلم في سبب نزول هذه الآية أن المسلمين كانوا يتصدقون على فقراء أهل الذمة ، فلما كثر فقراء المسلمين قال رسول الله صلى الله عليه وسلم لا تتصدقوا إلا على أهل دينكم . فنزلت هذه الآية مبيحة للصدقة على من ليس من دين الإسلام . وذكر النقاش أن النبي صلى الله عليه وسلم أتي بصدقات فجاءه يهودي فقال : أعطني . فقال النبي صلى الله عليه وسلم : ليس لك من صدقة المسلمين شيء . فذهب اليهودي غير بعيد فنزلت : ليس عليك هداهم فدعاه رسول الله صلى الله عليه وسلم فأعطاه ، ثم نسخ الله ذلك بآية الصدقات . وروى ابن عباس أنه قال : كان ناس من الأنصار لهم قرابات من بني قريظة والنضير ، وكانوا لا يتصدقون عليهم رغبة منهم في أن يسلموا إذا احتاجوا ، فنزلت الآية بسبب أولئك . وحكى بعض المفسرين أن أسماء ابنة أبي بكر الصديق أرادت أن تصل جدها أبا قحافة ثم امتنعت من ذلك لكونه كافرا فنزلت الآية في ذلك . وحكى الطبري أن مقصد النبي صلى الله عليه وسلم بمنع الصدقة إنما كان ليسلموا ويدخلوا في الدين ، فقال الله تعالى : ليس عليك هداهم . وقيل : \" ليس عليك هداهم \" ليس متصلا بما قبل ، فيكون ظاهرا في الصدقات وصرفها إلى الكفار ، بل يحتمل أن يكون معناه ابتداء كلام .\nالثانية : قال علماؤنا : هذه الصدقة التي أبيحت لهم حسب ما تضمنته هذه الآثار هي صدقة التطوع . وأما المفروضة فلا يجزئ دفعها لكافر ، لقوله عليه السلام : أمرت أن آخذ الصدقة من أغنيائكم وأردها في فقرائكم . قال ابن المنذر : أجمع كل من أحفظ عنه ، من أهل العلم أن الذمي لا يعطى من زكاة الأموال شيئا ، ثم ذكر جماعة ممن نص على ذلك ولم يذكر خلافا . وقال المهدوي : رخص للمسلمين أن يعطوا المشركين من قراباتهم من صدقة الفريضة لهذه الآية . قال ابن عطية : وهذا مردود بالإجماع . والله أعلم . وقال أبو حنيفة : تصرف إليهم زكاة الفطر . ابن العربي : وهذا ضعيف لا أصل له . ودليلنا أنها صدقة طهرة واجبة فلا تصرف إلى الكافر كصدقة الماشية والعين ، وقد قال النبي صلى الله عليه وسلم : أغنوهم عن سؤال هذا اليوم يعني يوم الفطر .\nقلت : وذلك لتشاغلهم بالعيد وصلاة العيد وهذا لا يتحقق في المشركين . وقد يجوز صرفها إلى غير المسلم في قول من جعلها سنة ، وهو أحد القولين عندنا ، وهو قول أبي حنيفة على ما ذكرنا ، نظرا إلى عموم الآية في البر وإطعام الطعام وإطلاق الصدقات . قال ابن عطية : وهذا الحكم متصور للمسلمين مع أهل ذمتهم ومع المسترقين من الحربيين .\nقلت : وفي التنزيل ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا والأسير في دار الإسلام لا يكون إلا مشركا . وقال تعالى : لا ينهاكم الله عن الذين لم يقاتلوكم في الدين ولم يخرجوكم من دياركم أن تبروهم وتقسطوا إليهم . فظواهر هذه الآيات تقتضي جواز صرف الصدقات إليهم جملة ، إلا أن النبي صلى الله عليه وسلم خص منها الزكاة المفروضة ، لقوله عليه السلام لمعاذ : خذ الصدقة من أغنيائهم وردها على فقرائهم واتفق العلماء على ذلك على ما تقدم . فيدفع إليهم من صدقة التطوع إذا احتاجوا ، والله أعلم . قال ابن العربي : فأما المسلم العاصي فلا خلاف أن صدقة الفطر تصرف إليه إلا إذا كان يترك أركان الإسلام من الصلاة والصيام فلا تدفع إليه الصدقة حتى يتوب . وسائر أهل المعاصي تصرف الصدقة إلى مرتكبيها لدخولهم في اسم المسلمين . وفي صحيح مسلم أن رجلا تصدق على غني وسارق وزانية وتقبلت صدقته ، على ما يأتي بيانه في آية \" الصدقات \" .\nالثالثة : قوله تعالى : ولكن الله يهدي من يشاء أي يرشد من يشاء . وفي هذا رد على القدرية وطوائف من المعتزلة ، كما تقدم .\nقوله تعالى : وما تنفقوا من خير فلأنفسكم وما تنفقون إلا ابتغاء وجه الله شرط وجوابه . والخير في هذه الآية المال ؛ لأنه قد اقترن بذكر الإنفاق فهذه القرينة تدل على أنه المال ، ومتى لم تقترن بما يدل على أنه المال فلا يلزم أن يكون بمعنى المال ، نحو قوله تعالى : خير مستقرا ، وقوله مثقال ذرة خيرا يره . إلى غير ذلك . وهذا تحرز من قول عكرمة : كل خير في كتاب الله تعالى فهو المال . وحكي أن بعض العلماء كان يصنع كثيرا من المعروف ثم يحلف أنه ما فعل مع أحد خيرا ، فقيل له في ذلك فيقول : إنما فعلت مع نفسي ، ويتلو وما تنفقوا من خير فلأنفسكم . ثم بين تعالى أن النفقة المعتد بقبولها إنما هي ما كان ابتغاء وجهه . و ( ابتغاء ) هو على المفعول له . وقيل : إنه شهادة من الله تعالى للصحابة رضي الله عنهم أنهم إنما ينفقون ابتغاء وجهه ، فهذا خرج مخرج التفضيل والثناء عليهم . وعلى التأويل الأول هو اشتراط عليهم ، ويتناول الاشتراط غيرهم من الأمة . قال رسول الله صلى الله عليه وسلم لسعد بن أبي وقاص : إنك لن تنفق نفقة تبتغي بها وجه الله تعالى إلا أجرت بها حتى ما تجعل في في امرأتك .\nقوله تعالى : وما تنفقوا من خير يوف إليكم وأنتم لا تظلمون يوف إليكم تأكيد وبيان لقوله : وما تنفقوا من خير فلأنفسكم وأن ثواب الإنفاق يوفى إلى المنفقين ولا يبخسون منه شيئا فيكون ذلك البخس ظلما لهم .\n                                    ",
        "saadi": " لَّيۡسَ عَلَيۡكَ هُدَىٰهُمۡ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَلِأَنفُسِكُمۡۚ وَمَا تُنفِقُونَ إِلَّا ٱبۡتِغَآءَ وَجۡهِ ٱللَّهِۚ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ ٢٧٢\n                                        \n                                        \n                                        \n                                        يقول تعالى لنبيه صلى الله عليه وسلم ليس عليك هدى الخلق، وإنما عليك البلاغ المبين، والهداية بيد الله تعالى، ففيها دلالة على أن النفقة كما تكون على المسلم تكون على الكافر ولو لم يهتد، فلهذا قال: { وما تنفقوا من خير } أي: قليل أو كثير على أي شخص كان من مسلم وكافر { فلأنفسكم } أي: نفعه راجع إليكم { وما تنفقون إلا ابتغاء وجه الله } هذا إخبار عن نفقات المؤمنين الصادرة عن إيمانهم أنها لا تكون إلا لوجه الله تعالى، لأن إيمانهم يمنعهم عن المقاصد الردية ويوجب لهم الإخلاص { وما تنفقوا من خير يوف إليكم } يوم القيامة تستوفون أجوركم { وأنتم لا تظلمون } أي: تنقصون من أعمالكم شيئا ولا مثقال ذرة، كما لا يزاد في سيئاتكم.\n                                    "
      },
      "originalText": "۞ لَّيۡسَ عَلَيۡكَ هُدَىٰهُمۡ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَلِأَنفُسِكُمۡۚ وَمَا تُنفِقُونَ إِلَّا ٱبۡتِغَآءَ وَجۡهِ ٱللَّهِۚ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ يُوَفَّ إِلَيۡكُمۡ وَأَنتُمۡ لَا تُظۡلَمُونَ ٢٧٢"
    },
    {
      "number": 280,
      "text": "لِلْفُقَرَاءِ الَّذِينَ أُحْصِرُوا فِي سَبِيلِ اللَّهِ لَا يَسْتَطِيعُونَ ضَرْبًا فِي الْأَرْضِ يَحْسَبُهُمُ الْجَاهِلُ أَغْنِيَاءَ مِنَ التَّعَفُّفِ تَعْرِفُهُمْ بِسِيمَاهُمْ لَا يَسْأَلُونَ النَّاسَ إِلْحَافًا ۗ وَمَا تُنْفِقُوا مِنْ خَيْرٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 273,
      "juz": 3,
      "manzil": 1,
      "page": 46,
      "ruku": 38,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لِلۡفُقَرَآءِ ٱلَّذِينَ أُحۡصِرُواْ فِي سَبِيلِ ٱللَّهِ لَا يَسۡتَطِيعُونَ ضَرۡبٗا فِي ٱلۡأَرۡضِ يَحۡسَبُهُمُ ٱلۡجَاهِلُ أَغۡنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعۡرِفُهُم بِسِيمَٰهُمۡ لَا يَسۡ‍َٔلُونَ ٱلنَّاسَ إِلۡحَافٗاۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ ٣٧٢\n                                        \n                                        \n                                        وقوله : ( للفقراء الذين أحصروا في سبيل الله ) يعني : المهاجرين الذين قد انقطعوا إلى الله وإلى رسوله ، وسكنوا المدينة وليس لهم سبب يردون به على أنفسهم ما يغنيهم و ( لا يستطيعون ضربا في الأرض ) يعني : سفرا للتسبب في طلب المعاش . والضرب في الأرض : هو السفر ; قال الله تعالى : ( وإذا ضربتم في الأرض فليس عليكم جناح أن تقصروا من الصلاة ) [ النساء : 101 ] ، وقال تعالى : ( علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله ) الآية [ المزمل : 20 ] .\nوقوله : ( يحسبهم الجاهل أغنياء من التعفف ) أي : الجاهل بأمرهم وحالهم يحسبهم أغنياء ، من تعففهم في لباسهم وحالهم ومقالهم . وفي هذا المعنى الحديث المتفق على صحته ، عن أبي هريرة قال :\nقال رسول الله صلى الله عليه وسلم : \" ليس المسكين بهذا الطواف الذي ترده التمرة والتمرتان ، واللقمة واللقمتان ، والأكلة والأكلتان ، ولكن المسكين الذي لا يجد غنى يغنيه ، ولا يفطن له فيتصدق عليه ، ولا يسأل الناس شيئا \" . وقد رواه أحمد ، من حديث ابن مسعود أيضا .\nوقوله : ( تعرفهم بسيماهم ) أي : بما يظهر لذوي الألباب من صفاتهم ، كما قال [ الله ] تعالى : ( سيماهم في وجوههم ) [ الفتح : 29 ] ، وقال : ( ولتعرفنهم في لحن القول ) [ محمد : 30 ] . وفي الحديث الذي في السنن : \" اتقوا فراسة المؤمن ، فإنه ينظر بنور الله \" ، ثم قرأ : ( إن في ذلك لآيات للمتوسمين ) [ الحجر : 75 ] . .\nوقوله : ( لا يسألون الناس إلحافا ) أي : لا يلحون في المسألة ويكلفون الناس ما لا يحتاجون إليه ، فإن من سأل وله ما يغنيه عن السؤال ، فقد ألحف في المسألة ; قال البخاري :\nحدثنا ابن أبي مريم ، حدثنا محمد بن جعفر ، حدثنا شريك بن أبي نمر : أن عطاء بن يسار وعبد الرحمن بن أبي عمرة الأنصاري قالا : سمعنا أبا هريرة يقول : قال رسول الله صلى الله عليه وسلم : \" ليس المسكين الذي ترده التمرة والتمرتان ، ولا اللقمة واللقمتان ، إنما المسكين الذي يتعفف ; اقرؤوا إن شئتم يعني قوله : ( لا يسألون الناس إلحافا ) .\nوقد رواه مسلم ، من حديث إسماعيل بن جعفر المديني ، عن شريك بن عبد الله بن أبي نمر ، عن عطاء بن يسار وحده عن أبي هريرة ، به .\nوقال أبو عبد الرحمن النسائي : أخبرنا علي بن حجر ، حدثنا إسماعيل ، أخبرنا شريك وهو ابن أبي نمر عن عطاء بن يسار ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم قال : \" ليس المسكين الذي ترده التمرة والتمرتان ، واللقمة واللقمتان ، إنما المسكين المتعفف ; اقرؤوا إن شئتم : ( لا يسألون الناس إلحافا ) \" .\nوروى البخاري من حديث شعبة ، عن محمد بن زياد ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم ، نحوه .\nوقال ابن أبي حاتم : أخبرنا يونس بن عبد الأعلى ، أخبرنا ابن وهب ، أخبرني ابن أبي ذئب ، عن أبي الوليد ، عن أبي هريرة : أن رسول الله صلى الله عليه وسلم قال : \" ليس المسكين بالطواف عليكم ، فتطعمونه لقمة لقمة ، إنما المسكين المتعفف الذي لا يسأل الناس إلحافا \" .\nوقال ابن جرير : حدثني معتمر ، عن الحسن بن ماتك عن صالح بن سويد ، عن أبي هريرة قال : ليس المسكين الطواف الذي ترده الأكلة والأكلتان ، ولكن المسكين المتعفف في بيته ، لا يسأل الناس شيئا تصيبه الحاجة ; اقرؤوا إن شئتم : ( لا يسألون الناس إلحافا )\nوقال الإمام أحمد أيضا : حدثنا أبو بكر الحنفي ، حدثنا عبد الحميد بن جعفر ، عن أبيه ، عن رجل من مزينة ، أنه قالت له أمه : ألا تنطلق فتسأل رسول الله صلى الله عليه سلم كما يسأله الناس ؟ فانطلقت أسأله ، فوجدته قائما يخطب ، وهو يقول : \" ومن استعف أعفه الله ، ومن استغنى أغناه الله ، ومن يسأل الناس وله عدل خمس أواق فقد سأل الناس إلحافا \" . فقلت بيني وبين نفسي : لناقة لي خير من خمس أواق ، ولغلامه ناقة أخرى فهي خير من خمس أواق فرجعت ولم أسأل .\nوقال الإمام أحمد : حدثنا قتيبة ، حدثنا عبد الرحمن بن أبي الرجال ، عن عمارة بن غزية ، عن عبد الرحمن بن أبي سعيد ، عن أبيه قال : سرحتني أمي إلى رسول الله صلى الله عليه وسلم ، أسأله ، فأتيته فقعدت ، قال : فاستقبلني فقال : \" من استغنى أغناه الله ، ومن استعف أعفه الله ، ومن استكف كفاه الله ، ومن سأل وله قيمة أوقية فقد ألحف \" . قال : فقلت : ناقتي الياقوتة خير من أوقية . فرجعت ولم أسأله .\nوهكذا رواه أبو داود والنسائي ، كلاهما عن قتيبة . زاد أبو داود : وهشام بن عمار كلاهما عن عبد الرحمن بن أبي الرجال بإسناده ، نحوه .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا أبو الجماهير ، حدثنا عبد الرحمن بن أبي الرجال ، عن عمارة بن غزية ، عن عبد الرحمن بن أبي سعيد قال : قال أبو سعيد الخدري : قال رسول الله صلى الله عليه وسلم : \" من سأل وله قيمة وقية فهو ملحف \" والوقية : أربعون درهما .\nوقال أحمد : حدثنا وكيع ، حدثنا سفيان ، عن زيد بن أسلم ، عن عطاء بن يسار ، عن رجل من بني أسد قال : قال رسول الله صلى الله عليه وسلم : \" من سأل وله أوقية أو عدلها فقد سأل إلحافا \" .\nوقال الإمام أحمد أيضا : حدثنا وكيع ، حدثنا سفيان ، عن حكيم بن جبير ، عن محمد بن عبد الرحمن بن يزيد ، عن أبيه ، عن عبد الله بن مسعود قال : قال رسول الله صلى الله عليه وسلم : \" من سأل وله ما يغنيه ، جاءت مسألته يوم القيامة خدوشا أو كدوحا في وجهه \" . قالوا : يا رسول الله ، وما غناه ؟ قال : \" خمسون درهما ، أو حسابها من الذهب \" .\nوقد رواه أهل السنن الأربعة ، من حديث حكيم بن جبير الأسدي الكوفي . وقد تركه شعبة بن الحجاج ، وضعفه غير واحد من الأئمة من جراء هذا الحديث .\nوقال الحافظ أبو القاسم الطبراني : حدثنا محمد بن عبد الله الحضرمي ، حدثنا أبو حصين عبد الله بن أحمد بن يونس ، حدثني أبي ، حدثنا أبو بكر بن عياش ، عن هشام بن حسان ، عن محمد بن سيرين قال : بلغ الحارث رجلا كان بالشام من قريش أن أبا ذر كان به عوز ، فبعث إليه ثلاثمائة دينار ، فقال : ما وجد عبد الله رجلا هو أهون عليه مني ، سمعت رسول الله صلى الله عليه وسلم يقول : \" من سأل وله أربعون فقد ألحف \" ولآل أبي ذر أربعون درهما وأربعون شاة وماهنان . قال أبو بكر بن عياش : يعني خادمين .\nوقال ابن مردويه : حدثنا محمد بن أحمد بن إبراهيم ، أخبرنا إبراهيم بن محمد ، أنبأنا عبد الجبار ، أخبرنا سفيان ، عن داود بن سابور ، عن عمرو بن شعيب ، عن أبيه ، عن جده ، عن النبي صلى الله عليه وسلم قال : \" من سأل وله أربعون درهما فهو ملحف ، وهو مثل سف الملة \" يعني : الرمل .\nورواه النسائي ، عن أحمد بن سليمان ، عن يحيى بن آدم ، عن سفيان وهو ابن عيينة بإسناده نحوه .\nقوله : ( وما تنفقوا من خير فإن الله به عليم ) أي : لا يخفى عليه شيء منه ، وسيجزي عليه أوفر الجزاء وأتمه يوم القيامة ، أحوج ما يكونون إليه .\n                                    ",
        "qortoby": "لِلۡفُقَرَآءِ ٱلَّذِينَ أُحۡصِرُواْ فِي سَبِيلِ ٱللَّهِ لَا يَسۡتَطِيعُونَ ضَرۡبٗا فِي ٱلۡأَرۡضِ يَحۡسَبُهُمُ ٱلۡجَاهِلُ أَغۡنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعۡرِفُهُم بِسِيمَٰهُمۡ لَا يَسۡ‍َٔلُونَ ٱلنَّاسَ إِلۡحَافٗاۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ ٣٧٢\n                                        \n                                        \n                                        قوله تعالى : للفقراء الذين أحصروا في سبيل الله لا يستطيعون ضربا في الأرض يحسبهم الجاهل أغنياء من التعفف تعرفهم بسيماهم لا يسألون الناس إلحافا وما تنفقوا من خير فإن الله به عليم\nفيه عشر مسائل :\nالأولى : قوله تعالى : ( للفقراء ) اللام متعلقة بقوله وما تنفقوا من خير وقيل : بمحذوف تقديره الإنفاق أو الصدقة للفقراء . قال السدي ومجاهد وغيرهما : المراد بهؤلاء الفقراء فقراء المهاجرين من قريش وغيرهم ، ثم تتناول الآية كل من دخل تحت صفة الفقراء غابر الدهر . وإنما خص فقراء المهاجرين بالذكر لأنه لم يكن هناك سواهم وهم أهل الصفة وكانوا نحوا من أربعمائة رجل ، وذلك أنهم كانوا يقدمون فقراء على رسول الله صلى الله عليه وسلم ، وما لهم أهل ولا مال فبنيت لهم صفة في مسجد رسول الله صلى الله عليه وسلم ، فقيل لهم : أهل الصفة . قال أبو ذر : كنت من أهل الصفة وكنا إذا أمسينا حضرنا باب رسول الله صلى الله عليه وسلم فيأمر كل رجل فينصرف برجل ويبقى من بقي من أهل الصفة عشرة أو أقل فيؤتى النبي صلى الله عليه وسلم بعشائه ونتعشى معه . فإذا فرغنا قال رسول الله صلى الله عليه وسلم : ناموا في المسجد . وخرج الترمذي عن البراء بن عازب ولا تيمموا الخبيث منه تنفقون قال : نزلت فينا معشر الأنصار كنا أصحاب نخل ، قال : فكان الرجل يأتي من نخله على قدر كثرته وقلته ، وكان الرجل يأتي بالقنو والقنوين فيعلقه في المسجد ، وكان أهل الصفة ليس لهم طعام ، فكان أحدهم إذا جاع أتى القنو فيضربه بعصاه فيسقط من البسر والتمر فيأكل ، وكان ناس ممن لا يرغب في الخير يأتي بالقنو فيه الشيص والحشف ، وبالقنو قد انكسر فيعلقه في المسجد ، فأنزل الله تعالى يا أيها الذين آمنوا أنفقوا من طيبات ما كسبتم ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون ولستم بآخذيه إلا أن تغمضوا فيه . قال : ولو أن أحدكم أهدي إليه مثل ما أعطاه لم يأخذه إلا على إغماض وحياء . قال : فكنا بعد ذلك يأتي الرجل بصالح ما عنده . قال : هذا حديث حسن غريب صحيح . قال علماؤنا : وكانوا رضي الله عنهم في المسجد ضرورة ، وأكلوا من الصدقة ضرورة ، فلما فتح الله على المسلمين استغنوا عن تلك الحال وخرجوا ثم ملكوا وتأمروا . ثم بين الله سبحانه من أحوال أولئك الفقراء المهاجرين ما يوجب الحنو عليهم بقوله تعالى : الذين أحصروا في سبيل الله والمعنى حبسوا ومنعوا . قال قتادة وابن زيد : معنى أحصروا في سبيل الله حبسوا أنفسهم عن التصرف في معايشهم خوف العدو ، ولهذا قال تعالى : لا يستطيعون ضربا في الأرض لكون البلاد كلها كفرا مطبقا . ، وهذا في صدر الإسلام ، فعلتهم تمنع من الاكتساب بالجهاد ، وإنكار الكفار عليهم إسلامهم يمنع من التصرف في التجارة فبقوا فقراء . وقيل : معنى لا يستطيعون ضربا في الأرض أي لما قد ألزموا أنفسهم من الجهاد . والأول أظهر . والله أعلم .\nالثانية : قوله تعالى : يحسبهم الجاهل أغنياء من التعفف أي إنهم من الانقباض وترك المسألة والتوكل على الله بحيث يظنهم الجاهل بهم أغنياء . وفيه دليل على أن اسم الفقر يجوز أن يطلق على من له كسوة ذات قيمة ولا يمنع ذلك من إعطاء الزكاة إليه . وقد أمر الله تعالى بإعطاء هؤلاء القوم ، وكانوا من المهاجرين الذين يقاتلون مع رسول الله صلى الله عليه وسلم غير مرضى ولا عميان . والتعفف تفعل ، وهو بناء مبالغة من عف عن الشيء إذا أمسك عنه وتنزه عن طلبه ، وبهذا المعنى فسر قتادة وغيره . وفتح السين وكسرها في يحسبهم لغتان . قال أبو علي : والفتح أقيس ؛ لأن العين من الماضي مكسورة فبابها أن تأتي في المضارع مفتوحة . والقراءة بالكسر حسنة ، لمجيء السمع به وإن كان شاذا عن القياس . و \" من \" في قوله من التعفف لابتداء الغاية . وقيل لبيان الجنس .\nالثالثة : قوله تعالى : تعرفهم بسيماهم فيه دليل على أن للسيما أثرا في اعتبار من يظهر عليه ذلك ، حتى إذا رأينا ميتا في دار الإسلام وعليه زنار وهو غير مختون لا يدفن في مقابر المسلمين ، ويقدم ذلك على حكم الدار في قول أكثر العلماء ، ومنه قوله تعالى : ولتعرفنهم في لحن القول . فدلت الآية على جواز صرف الصدقة إلى من له ثياب وكسوة وزي في التجمل . واتفق العلماء على ذلك ، وإن اختلفوا بعده في مقدار ما يأخذه إذا احتاج فأبو حنيفة اعتبر مقدار ما تجب فيه الزكاة ، والشافعي اعتبر قوت سنة ، ومالك اعتبر أربعين درهما ، والشافعي لا يصرف الزكاة إلى المكتسب .\nوالسيما ( مقصورة ) : العلامة ، وقد تمد فيقال السيماء . وقد اختلف العلماء في تعيينها هنا ، فقال مجاهد : هي الخشوع والتواضع . السدي : أثر الفاقة والحاجة في وجوههم وقلة النعمة . ابن زيد : رثاثة ثيابهم . وقال قوم وحكاه مكي : أثر السجود . ابن عطية : وهذا حسن ، وذلك لأنهم كانوا متفرغين متوكلين لا شغل لهم في الأغلب إلا الصلاة ، فكان أثر السجود عليهم .\nقلت : وهذه السيما التي هي أثر السجود اشترك فيها جميع الصحابة رضوان الله عليهم بإخبار الله تعالى في آخر \" الفتح \" بقوله : سيماهم في وجوههم من أثر السجود فلا فرق بينهم وبين غيرهم ، فلم يبق إلا أن تكون السيماء أثر الخصاصة والحاجة ، أو يكون أثر السجود أكثر ، فكانوا يعرفون بصفرة الوجوه من قيام الليل وصوم النهار . والله أعلم . وأما الخشوع فذلك محله القلب ويشترك فيه الغني والفقير ، فلم يبق إلا ما اخترناه ، والموفق الإله .\nالرابعة : قوله تعالى : لا يسألون الناس إلحافا مصدر في موضع الحال أي ملحفين يقال : ألحف وأحفى وألح في المسألة سواء ويقال ( هو للشاعر بشار بن برد ) :\nالحر يلحى والعصا للعبد وليس للملحف مثل الرد\nواشتقاق الإلحاف من اللحاف ، سمي بذلك لاشتماله على وجوه الطلب في المسألة كاشتمال اللحاف من التغطية ، أي هذا السائل يعم الناس بسؤاله فيلحفهم ذلك ، ومنه قول ابن أحمر :\nفظل يحفهن بقفقفيه ويلحفهن هفهافا ثخينا\nيصف ذكر النعام يحضن بيضا بجناحيه ويجعل جناحه لها كاللحاف وهو رقيق مع ثخنه . وروى النسائي ومسلم عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : ليس المسكين الذي ترده التمرة والتمرتان واللقمة واللقمتان إنما المسكين المتعفف اقرءوا إن شئتم لا يسألون الناس إلحافا .\nالخامسة : واختلف العلماء في معنى قوله لا يسألون الناس إلحافا على قولين ، فقال قوم منهم الطبري والزجاج : إن المعنى لا يسألون البتة ، وهذا على أنهم متعففون عن المسألة عفة تامة ، وعلى هذا جمهور المفسرين ، ويكون التعفف صفة ثابتة لهم ، أي لا يسألون الناس إلحاحا ولا غير إلحاح . وقال قوم : إن المراد نفي الإلحاف ، أي إنهم يسألون غير إلحاف ، وهذا هو السابق للفهم ، أي يسألون غير ملحفين . وفي هذا تنبيه على سوء حالة من يسأل الناس إلحافا روى الأئمة واللفظ لمسلم عن معاوية بن أبي سفيان قال : قال رسول الله صلى الله عليه وسلم : لا تلحفوا في المسألة فوالله لا يسألني أحد منكم شيئا فتخرج له مسألته مني شيئا وأنا له كاره فيبارك له فيما أعطيته . وفي الموطأ عن زيد بن أسلم عن عطاء بن يسار عن رجل من بني أسد أنه قال : نزلت أنا وأهلي ببقيع الغرقد فقال لي أهلي : اذهب إلى رسول الله صلى الله عليه وسلم فاسأله لنا شيئا نأكله ، وجعلوا يذكرون من حاجتهم ، فذهبت إلى رسول الله صلى الله عليه وسلم فوجدت عنده رجلا يسأله ورسول الله صلى الله عليه وسلم يقول : ( لا أجد ما أعطيك ) فتولى الرجل عنه وهو مغضب وهو يقول : لعمري إنك لتعطي من شئت! فقال رسول الله صلى الله عليه وسلم : إنه يغضب علي ألا أجد ما أعطيه من سأل منكم وله أوقية أو عدلها فقد سأل إلحافا . قال الأسدي : فقلت للقحة لنا خير من أوقية - قال مالك : والأوقية أربعون درهما - قال : فرجعت ولم أسأله ، فقدم على رسول الله صلى الله عليه وسلم بعد ذلك بشعير وزبيب فقسم لنا منه حتى أغنانا الله . قال ابن عبد البر : هكذا رواه مالك وتابعه هشام بن سعد وغيره ، وهو حديث صحيح ، وليس حكم الصحابي إذا لم يسم كحكم من دونه إذا لم يسم عند العلماء ، لارتفاع الجرحة عن جميعهم وثبوت العدالة لهم . وهذا الحديث يدل على أن السؤال مكروه لمن له أوقية من فضة ، فمن سأل وله هذا الحد والعدد والقدر من الفضة أو ما يقوم مقامها ويكون عدلا منها فهو ملحف ، وما علمت أحدا من أهل العلم إلا وهو يكره السؤال لمن له هذا المقدار من الفضة أو عدلها من الذهب على ظاهر هذا الحديث . وما جاءه من غير مسألة فجائز له أن يأكله ، إن كان من غير الزكاة ، وهذا مما لا أعلم فيه خلافا ، فإن كان من الزكاة ففيه خلاف يأتي بيانه في آية الصدقات إن شاء الله تعالى .\nالسادسة : قال ابن عبد البر : من أحسن ما روي من أجوبة الفقهاء في معاني السؤال وكراهيته ومذهب أهل الورع فيه ما حكاه الأثرم عن أحمد بن حنبل وقد سئل عن المسألة متى تحل قال : إذا لم يكن ما يغذيه ويعشيه على حديث سهل بن الحنظلية . قيل لأبي عبد الله : فإن اضطر إلى المسألة ؟ قال : هي مباحة له إذا اضطر . قيل له : فإن تعفف ؟ قال : ذلك خير له . ثم قال : ما أظن أحدا يموت من الجوع! الله يأتيه برزقه . ثم ذكر حديث أبي سعيد الخدري من استعف أعفه الله . وحديث أبي ذر عن النبي صلى الله عليه وسلم قال له : ( تعفف ) . قال أبو بكر : وسمعته يسأل عن الرجل لا يجد شيئا أيسأل الناس أم يأكل الميتة ؟ فقال : أيأكل الميتة وهو يجد من يسأله ، هذا شنيع . قال : وسمعته يسأله هل يسأل الرجل لغيره ؟ قال لا ، ولكن يعرض ، كما قال النبي صلى الله عليه وسلم حين جاءه قوم حفاة عراة مجتابي النمار فقال : ( تصدقوا ) ولم يقل أعطوهم . قال أبو عمر : قد قال النبي صلى الله عليه وسلم اشفعوا تؤجروا . وفيه إطلاق السؤال لغيره . والله أعلم . وقال : ألا رجل يتصدق على هذا ؟ قال أبو بكر : قيل له - يعني أحمد بن حنبل - فالرجل يذكر الرجل فيقول : إنه محتاج ؟ فقال : هذا تعريض وليس به بأس ، إنما المسألة أن يقول أعطه . ثم قال : لا يعجبني أن يسأل المرء لنفسه فكيف لغيره ؟ والتعريض هنا أحب إلي .\nقلت : قد روى أبو داود والنسائي وغيرهما أن الفراسي قال لرسول الله صلى الله عليه وسلم : أسأل يا رسول الله ؟ قال : لا وإن كنت سائلا لا بد فاسأل الصالحين . فأباح صلى الله عليه وسلم سؤال أهل الفضل والصلاح عند الحاجة إلى ذلك ، وإن أوقع حاجته ، بالله فهو أعلى . قال إبراهيم بن أدهم : سؤال الحاجات من الناس هي الحجاب بينك وبين الله تعالى ، فأنزل حاجتك بمن يملك الضر والنفع ، وليكن مفزعك إلى الله تعالى يكفيك الله ما سواه وتعيش مسرورا .\nالسابعة : فإن جاءه شيء من غير سؤال فله أن يقبله ولا يرده ، إذ هو رزق رزقه الله . روى مالك عن زيد بن أسلم عن عطاء بن يسار أن رسول الله صلى الله عليه وسلم أرسل إلى عمر بن الخطاب بعطاء فرده ، فقال له رسول الله صلى الله عليه وسلم : ( لم رددته ) ؟ فقال : يا رسول الله ، أليس أخبرتنا أن أحدنا خير له ألا يأخذ شيئا ؟ فقال رسول الله صلى الله عليه وسلم : ( إنما ذاك عن المسألة فأما ما كان من غير مسألة فإنما هو رزق رزقكه الله ) . فقال عمر بن الخطاب : والذي نفسي بيده لا أسأل أحدا شيئا ولا يأتيني بشيء من غير مسألة إلا أخذته . وهذا نص . وخرج مسلم في صحيحه والنسائي في سننه وغيرهما عن ابن عمر قال سمعت عمر يقول : كان النبي صلى الله عليه وسلم يعطيني العطاء فأقول : أعطه أفقر إليه مني ، حتى أعطاني مرة مالا فقلت : أعطه أفقر إليه مني ، فقال رسول الله صلى الله عليه وسلم : خذه وما جاءك من هذا المال وأنت غير مشرف ولا سائل فخذه ومالا فلا تتبعه نفسك . زاد النسائي - بعد قوله ( خذه - فتموله أو تصدق به ) . وروى مسلم من حديث عبد الله بن السعدي المالكي عن عمر فقال لي رسول الله صلى الله عليه وسلم : إذا أعطيت شيئا من غير أن تسأل فكل وتصدق . وهذا يصحح لك حديث مالك المرسل . قال الأثرم : سمعت أبا عبد الله أحمد بن حنبل يسأل عن قول النبي صلى الله عليه وسلم : ( ما أتاك من غير مسألة ولا إشراف ) أي الإشراف أراد ؟ فقال : أن تستشرفه وتقول : لعله يبعث إلي بقلبك . قيل له : وإن لم يتعرض ، قال نعم إنما هو بالقلب . قيل له : هذا شديد قال : وإن كان شديدا فهو هكذا . قيل له : فإن كان الرجل لم يعودني أن يرسل إلي شيئا إلا أنه قد عرض بقلبي فقلت : عسى أن يبعث إلي . قال : هذا إشراف ، فأما إذا جاءك من غير أن تحتسبه ولا خطر على قلبك فهذا الآن ليس فيه إشراف . قال أبو عمر : الإشراف في اللغة رفع الرأس إلى المطموع ، عنده والمطموع فيه ، وأن يهش الإنسان ويتعرض . وما قاله أحمد في تأويل الإشراف تضييق وتشديد وهو عندي بعيد ؛ لأن الله عز وجل تجاوز لهذه الأمة عما حدثت به أنفسها ما لم ينطق به لسان أو تعمله جارحة . وأما ما اعتقده القلب من المعاصي ما خلا الكفر فليس بشيء حتى يعمل به ، وخطرات النفس متجاوز عنها بإجماع .\nالثامنة : الإلحاح في المسألة والإلحاف فيها مع الغنى عنها حرام لا يحل . قال رسول الله صلى الله عليه وسلم : من سأل الناس أموالهم تكثرا فإنما يسأل جمرا فليستقل أو ليستكثر رواه أبو هريرة خرجه مسلم . وعن ابن عمر أن النبي صلى الله عليه وسلم قال : لا تزال المسألة بأحدكم حتى يلقى الله وليس في وجهه مزعة لحم رواه مسلم أيضا .\nالتاسعة : السائل إذا كان محتاجا فلا بأس أن يكرر المسألة ثلاثا إعذارا وإنذارا والأفضل تركه . فإن كان المسئول يعلم بذلك وهو قادر على ما سأله وجب عليه الإعطاء ، وإن كان جاهلا به فيعطيه مخافة أن يكون صادقا في سؤاله فلا يفلح في رده .\nالعاشرة : فإن كان محتاجا إلى ما يقيم به سنة كالتجمل بثوب يلبسه في العيد والجمعة فذكر ابن العربي : سمعت بجامع الخليفة ببغداد رجلا يقول : هذا أخوكم يحضر الجمعة معكم وليس عنده ثياب يقيم بها سنة الجمعة . فلما كان في الجمعة الأخرى رأيت عليه ثيابا أخر ، فقيل لي : كساه إياها أبو الطاهر البرسني أخذ الثناء\n                                    ",
        "saadi": "لِلۡفُقَرَآءِ ٱلَّذِينَ أُحۡصِرُواْ فِي سَبِيلِ ٱللَّهِ لَا يَسۡتَطِيعُونَ ضَرۡبٗا فِي ٱلۡأَرۡضِ يَحۡسَبُهُمُ ٱلۡجَاهِلُ أَغۡنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعۡرِفُهُم بِسِيمَٰهُمۡ لَا يَسۡ‍َٔلُونَ ٱلنَّاسَ إِلۡحَافٗاۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ ٣٧٢\n                                        \n                                        \n                                        \n                                        ثم ذكر مصرف النفقات الذين هم أولى الناس بها فوصفهم بست صفات أحدها الفقر، والثاني قوله: { أحصروا في سبيل الله } أي: قصروها على طاعة الله من جهاد وغيره، فهم مستعدون لذلك محبوسون له، الثالث عجزهم عن الأسفار لطلب الرزق فقال: { لا يستطيعون ضربا في الأرض } أي: سفرا للتكسب، الرابع قوله: { يحسبهم الجاهل أغنياء من التعفف } وهذا بيان لصدق صبرهم وحسن تعففهم. الخامس: أنه قال: { تعرفهم بسيماهم } أي: بالعلامة التي ذكرها الله في وصفهم، وهذا لا ينافي قوله: { يحسبهم الجاهل أغنياء } فإن الجاهل بحالهم ليس له فطنة يتفرس بها ما هم عليه، وأما الفطن المتفرس فمجرد ما يراهم يعرفهم بعلامتهم، السادس قوله: { لا يسألون الناس إلحافا } أي: لا يسألونهم سؤال إلحاف، أي: إلحاح، بل إن صدر منهم سؤال إذا احتاجوا لذلك لم يلحوا على من سألوا، فهؤلاء أولى الناس وأحقهم بالصدقات لما وصفهم به من جميل الصفات، وأما النفقة من حيث هي على أي شخص كان، فهي خير وإحسان وبر يثاب عليها صاحبها ويؤجر، فلهذا قال: { وما تنفقوا من خير فإن الله به عليم }\n                                    "
      },
      "originalText": "لِلۡفُقَرَآءِ ٱلَّذِينَ أُحۡصِرُواْ فِي سَبِيلِ ٱللَّهِ لَا يَسۡتَطِيعُونَ ضَرۡبٗا فِي ٱلۡأَرۡضِ يَحۡسَبُهُمُ ٱلۡجَاهِلُ أَغۡنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعۡرِفُهُم بِسِيمَٰهُمۡ لَا يَسۡ‍َٔلُونَ ٱلنَّاسَ إِلۡحَافٗاۗ وَمَا تُنفِقُواْ مِنۡ خَيۡرٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ ٣٧٢"
    },
    {
      "number": 281,
      "text": "الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلَانِيَةً فَلَهُمْ أَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 274,
      "juz": 3,
      "manzil": 1,
      "page": 46,
      "ruku": 39,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُم بِٱلَّيۡلِ وَٱلنَّهَارِ سِرّٗا وَعَلَانِيَةٗ فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٤٧٢\n                                        \n                                        \n                                        وقوله : ( الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون ) هذا مدح منه تعالى للمنفقين في سبيله ، وابتغاء مرضاته في جميع الأوقات من ليل أو نهار ، والأحوال من سر وجهار ، حتى إن النفقة على الأهل تدخل في ذلك أيضا ، كما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال لسعد بن أبي وقاص حين عاده مريضا عام الفتح ، وفي رواية عام حجة الوداع : \" وإنك لن تنفق نفقة تبتغي بها وجه الله إلا ازددت بها درجة ورفعة ، حتى ما تجعل في في امرأتك \" .\nوقال الإمام أحمد : حدثنا محمد بن جعفر وبهز قالا : حدثنا شعبة ، عن عدي بن ثابت قال : سمعت عبد الله بن يزيد الأنصاري ، يحدث عن أبي مسعود ، رضي الله عنه ، عن النبي صلى الله عليه وسلم ، أنه قال : \" إن المسلم إذا أنفق على أهله نفقة يحتسبها كانت له صدقة \" أخرجاه من حديث شعبة ، به .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا سليمان بن عبد الرحمن ، حدثنا محمد بن شعيب ، قال : سمعت سعيد بن يسار ، عن يزيد بن عبد الله بن عريب المليكي ، عن أبيه ، عن جده ، عن النبي صلى الله عليه وسلم قال : \" نزلت هذه الآية : ( الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربهم [ ولا خوف عليهم ولا هم يحزنون ] ) في أصحاب الخيل \" .\nوقال حنش الصنعاني : عن ابن عباس في هذه الآية ، قال : هم الذين يعلفون الخيل في سبيل الله . رواه ابن أبي حاتم ، ثم قال : وكذا روي عن أبي أمامة ، وسعيد بن المسيب ، ومكحول .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، أخبرنا يحيى بن يمان ، عن عبد الوهاب بن مجاهد بن جبر ، عن أبيه قال : كان لعلي أربعة دراهم ، فأنفق درهما ليلا ودرهما نهارا ، ودرهما سرا ، ودرهما علانية ، فنزلت : ( الذين ينفقون أموالهم بالليل والنهار سرا وعلانية )\nوكذا رواه ابن جرير من طريق عبد الوهاب بن مجاهد ، وهو ضعيف . ولكن رواه ابن مردويه من وجه آخر ، عن ابن عباس أنها نزلت في علي بن أبي طالب .\nوقوله : ( فلهم أجرهم عند ربهم ) أي : يوم القيامة على ما فعلوا من الإنفاق في الطاعات ( ولا خوف عليهم ولا هم يحزنون ) تقدم تفسيره .\n                                    ",
        "qortoby": "ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُم بِٱلَّيۡلِ وَٱلنَّهَارِ سِرّٗا وَعَلَانِيَةٗ فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٤٧٢\n                                        \n                                        \n                                        قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون فيه مسألة واحدة روي عن ابن عباس وأبي ذر وأبي أمامة وأبي الدرداء وعبد الله بن بشر الغافقي والأوزاعي أنها نزلت في علف الخيل المربوطة في سبيل الله . وذكر ابن سعد في الطبقات قال : أخبرت عن محمد بن شعيب بن شابور قال : أنبأنا سعيد بن سنان عن يزيد بن عبد الله بن عريب عن أبيه عن جده عريب أن رسول الله صلى الله عليه وسلم سئل عن قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون قال : ( هم أصحاب الخيل ) . وبهذا الإسناد قال : قال رسول الله صلى الله عليه وسلم : المنفق على الخيل كباسط يده بالصدقة لا يقبضها وأبوالها وأرواثها عند الله يوم القيامة كذكي المسك ) . وروي عن ابن عباس أنه قال : نزلت في علي بن أبي طالب رضي الله عنه ، كانت معه أربعة دراهم فتصدق بدرهم ليلا وبدرهم نهارا وبدرهم سرا وبدرهم جهرا ، ذكره عبد الرزاق قال : أخبرنا عبد الوهاب بن مجاهد عن أبيه عن ابن عباس . ابن جريج : نزلت في رجل فعل ذلك ، ولم يسم عليا ولا غيره . وقال قتادة . هذه الآية نزلت في المنفقين من غير تبذير ولا تقتير . ومعنى ( بالليل والنهار ) في الليل والنهار ، ودخلت الفاء في قوله تعالى : ( فلهم ) لأن في الكلام معنى الجزاء . وقد تقدم . ولا يجوز زيد فمنطلق .\n                                    ",
        "saadi": "ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُم بِٱلَّيۡلِ وَٱلنَّهَارِ سِرّٗا وَعَلَانِيَةٗ فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٤٧٢\n                                        \n                                        \n                                        \n                                        ثم ذكر حالة المتصدقين في جميع الأوقات على جميع الأحوال فقال: { الذين ينفقون أموالهم في سبيل الله } أي: طاعته وطريق مرضاته، لا في المحرمات والمكروهات وشهوات أنفسهم { بالليل والنهار سرا وعلانية فلهم أجرهم عند ربهم } أي: أجر عظيم من خير عند الرب الرحيم { ولا خوف عليهم } إذا خاف المقصرون { ولا هم يحزنون } إذا حزن المفرطون، ففازوا بحصول المقصود المطلوب، ونجوا من الشرور والمرهوب، ولما كمل تعالى حالة المحسنين إلى عباده بأنواع النفقات ذكر حالة الظالمين المسيئين إليهم غاية الإساءة.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُم بِٱلَّيۡلِ وَٱلنَّهَارِ سِرّٗا وَعَلَانِيَةٗ فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٤٧٢"
    }
  ]
}