{
  "number": 466,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 4126,
      "text": "وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ ۖ ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ",
      "surah": {
        "number": 39,
        "name": "سورة الزمر",
        "englishName": "Az-Zumar",
        "englishNameTranslation": "The Groups",
        "revelationType": "Meccan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 68,
      "juz": 24,
      "manzil": 6,
      "page": 466,
      "ruku": 402,
      "hizbQuarter": 186,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَنُفِخَ فِي ٱلصُّورِ فَصَعِقَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۖ ثُمَّ نُفِخَ فِيهِ أُخۡرَىٰ فَإِذَا هُمۡ قِيَامٞ يَنظُرُونَ ٨٦\n                                    \n                                    \n                                    يقول تعالى مخبرا عن هول يوم القيامة ، وما يكون فيه من الآيات العظيمة والزلازل الهائلة ، فقوله : ( ونفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله ) ، هذه النفخة هي الثانية ، وهي نفخة الصعق ، وهي التي يموت بها الأحياء من أهل السماوات والأرض ، إلا من شاء الله كما هو مصرح به مفسرا في حديث الصور المشهور . ثم يقبض أرواح الباقين حتى يكون آخر من يموت ملك الموت ، وينفرد الحي القيوم الذي كان أولا وهو الباقي آخرا بالديمومة والبقاء ، ويقول : ( لمن الملك اليوم ) [ غافر : 16 ] ثلاث مرات . ثم يجيب نفسه بنفسه فيقول : ( لله الواحد القهار ) أي : الذي هو واحد وقد قهر كل شيء ، وحكم بالفناء على كل شيء . ثم يحيي أول من يحيي إسرافيل ، ويأمره أن ينفخ في الصور أخرى ، وهي النفخة الثالثة نفخة البعث ، قال تعالى : ( ثم نفخ فيه أخرى فإذا هم قيام ينظرون ) أي : أحياء بعد ما كانوا عظاما ورفاتا ، صاروا أحياء ينظرون إلى أهوال يوم القيامة ، كما قال تعالى : ( فإنما هي زجرة واحدة فإذا هم بالساهرة ) [ النازعات : 14 ، 13 ] ، وقال تعالى : ( يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا ) [ الإسراء : 52 ] ، وقال تعالى : ( ومن آياته أن تقوم السماء والأرض بأمره ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون ) [ الروم : 25 ] .\nقال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن النعمان بن سالم قال : سمعت يعقوب بن عاصم بن عروة بن مسعود قال : سمعت رجلا قال لعبد الله بن عمرو : إنك تقول : الساعة تقوم إلى كذا وكذا ؟ قال : لقد هممت ألا أحدثكم شيئا ، إنما قلت : سترون بعد قليل أمرا عظيما . ثم قال عبد الله بن عمرو : قال رسول الله - صلى الله عليه وسلم - : \" يخرج الدجال في أمتي ، فيمكث فيهم أربعين - لا أدري أربعين يوما أو أربعين عاما أو أربعين شهرا أو أربعين ليلة - فيبعث الله عيسى ابن مريم ، كأنه عروة بن مسعود الثقفي ، فيظهر فيهلكه الله . ثم يلبث الناس بعده سنين سبعا ليس بين اثنين عداوة ، ثم يرسل الله ريحا باردة من قبل الشام ، فلا يبقى أحد في قلبه مثقال ذرة من إيمان إلا قبضته ، حتى لو أن أحدهم كان في كبد جبل لدخلت عليه \" . قال : سمعتها من رسول الله - صلى الله عليه وسلم - : \" ويبقى شرار الناس في خفة الطير ، وأحلام السباع ، لا يعرفون معروفا ، ولا ينكرون منكرا \" . قال : \" فيتمثل لهم الشيطان فيقول : ألا تستجيبون ؟ فيأمرهم بالأوثان فيعبدونها ، وهم في ذلك دارة أرزاقهم ، حسن عيشهم . ثم ينفخ في الصور فلا يسمعه أحد إلا أصغى له ، وأول من يسمعه رجل يلوط حوضه ، فيصعق ، ثم لا يبقى أحد إلا صعق . ثم يرسل الله - أو : ينزل الله مطرا كأنه الطل - أو الظل شك نعمان - فتنبت منه أجساد الناس . ثم ينفخ فيه أخرى فإذا هم قيام ينظرون ، ثم يقال : يا أيها الناس ، هلموا إلى ربكم : ( وقفوهم إنهم مسئولون ) [ الصافات : 24 ] ، قال : \" ثم يقال : أخرجوا بعث النار \" . قال : \" فيقال : كم ؟ فيقال : من كل ألف تسعمائة وتسعة وتسعين فيومئذ تبعث الولدان شيبا ، ويومئذ يكشف عن ساق \" .\nانفرد بإخراجه مسلم في صحيحه .\nوقال البخاري : حدثنا عمر بن حفص بن غياث ، حدثنا أبي ، حدثنا الأعمش قال : سمعت أبا صالح قال : سمعت أبا هريرة [ رضي الله عنه ] عن النبي - صلى الله عليه وسلم - قال : \" بين النفختين أربعون \" . قالوا : يا أبا هريرة ، أربعون يوما ؟ قال : أبيت ، قالوا : أربعون سنة ؟ قال : أبيت ، قالوا : أربعون شهرا ؟ قال : أبيت ، ويبلى كل شيء من الإنسان إلا عجب ذنبه فيه يركب الخلق .\nوقال أبو يعلى : حدثنا يحيى بن معين ، حدثنا أبو اليمان ، حدثنا إسماعيل بن عياش ، عن عمر بن محمد ، عن زيد بن أسلم ، عن أبيه ، عن أبي هريرة [ رضي الله عنه ] ، عن النبي - صلى الله عليه وسلم - قال : \" سألت جبريل ، - عليه السلام - عن هذه الآية : ( ونفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله ) من الذين لم يشأ الله أن يصعقهم ؟ قال : هم الشهداء ، مقلدون أسيافهم حول عرشه ، تتلقاهم ملائكة يوم القيامة إلى المحشر بنجائب من ياقوت نمارها ألين من الحرير ، مد خطاها مد أبصار الرجال ، يسيرون في الجنة يقولون عند طول النزهة : انطلقوا بنا إلى ربنا - عز وجل - لننظر كيف يقضي بين خلقه ، يضحك إليهم إلهي ، وإذا ضحك إلى عبد في موطن فلا حساب عليه \" . رجاله كلهم ثقات إلا شيخ إسماعيل بن عياش ، فإنه غير معروف والله أعلم .\n                                    ",
        "qortoby": "وَنُفِخَ فِي ٱلصُّورِ فَصَعِقَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۖ ثُمَّ نُفِخَ فِيهِ أُخۡرَىٰ فَإِذَا هُمۡ قِيَامٞ يَنظُرُونَ ٨٦\n                                    \n                                    \n                                    قوله تعالى : ونفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله ثم نفخ فيه أخرى فإذا هم قيام ينظرون بين ما يكون بعد قبض الأرض وطي السماء وهو النفخ في الصور ، وإنما هما نفختان ، يموت الخلق في الأولى منهما ويحيون في الثانية ، وقد مضى الكلام في هذا في [ النمل ] و [ الأنعام ] أيضا . والذي ينفخ في الصور هو إسرافيل عليه السلام . وقد قيل : إنه يكون معه جبريل لحديث أبي سعيد الخدري قال : قال رسول الله - صلى الله عليه وسلم - : إن صاحبي الصور بأيديهما - أو في أيديهما - قرنان يلاحظان النظر متى يؤمران خرجه ابن ماجه في السنن . وفي كتاب أبي داود عن أبي سعيد الخدري قال : ذكر رسول الله - صلى الله عليه وسلم - صاحب الصور ، وقال : عن يمينه جبرائيل وعن يساره ميكائيل . واختلف في المستثنى من هم ؟ فقيل : هم الشهداء متقلدين أسيافهم حول العرش . روي مرفوعا من حديث أبي هريرة فيما ذكر القشيري ، ومن حديث عبد الله بن عمر فيما ذكر الثعلبي . وقيل : جبريل وميكائيل وإسرافيل وملك الموت عليهم السلام . وروي من حديث أنس أن النبي - صلى الله عليه وسلم - تلا : ونفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله فقالوا : يا نبي الله ، من هم الذين استثنى الله تعالى ؟ قال : هم جبريل وميكائيل وإسرافيل وملك الموت فيقول الله تعالى لملك الموت : يا ملك الموت من بقي من خلقي ؟ وهو أعلم ، فيقول : يا رب بقي جبريل وميكائيل وإسرافيل وعبدك الضعيف ملك الموت . فيقول الله تعالى : خذ نفس إسرافيل وميكائيل ، فيخران ميتين كالطودين العظيمين ، فيقول : مت يا ملك الموت ، فيموت فيقول الله تعالى لجبريل : يا جبريل ، من بقي ؟ فيقول : تباركت وتعاليت ذا الجلال والإكرام ، وجهك الباقي الدائم ، وجبريل الميت الفاني . فيقول الله تعالى : يا جبريل لا بد من موتك ، فيقع ساجدا يخفق بجناحيه يقول : سبحانك ربي تباركت وتعاليت يا ذا الجلال والإكرام . قال النبي - صلى الله عليه وسلم - : إن فضل خلقه على خلق ميكائيل كالطود العظيم على الظرب من الظراب ذكره الثعلبي . وذكره النحاس أيضا من حديث محمد بن إسحاق ، عن يزيد الرقاشي ، عن أنس بن مالك ، عن النبي - صلى الله عليه وسلم - في قوله - جل وعز - : فصعق من في السماوات ومن في الأرض إلا من شاء الله قال : جبريل وميكائيل وحملة العرش وملك الموت وإسرافيل وفي هذا الحديث : إن آخرهم موتا جبريل عليه وعليهم السلام وحديث أبي هريرة في الشهداء أصح على ما تقدم في [ النمل ] . وقال الضحاك : هو رضوان والحور ومالك والزبانية . وقيل : عقارب أهل النار وحياتها . وقال الحسن : هو الله الواحد القهار ، وما يدع أحدا من أهل السماء والأرض إلا أذاقه الموت . وقال قتادة : الله أعلم بثنياه . وقيل : الاستئناء في قوله : إلا من شاء الله يرجع إلى من مات قبل النفخة الأولى ، أي : فيموت من في السماوات والأرض إلا من سبق موته لأنهم كانوا قد ماتوا . وفي الصحيحين وابن ماجه واللفظ له عن أبي هريرة قال : قال رجل من اليهود بسوقي المدينة : والذي اصطفى موسى على البشر ، فرفع رجل من الأنصار يده فلطمه ، قال : تقول هذا وفينا رسول الله صلى الله عليه وسلم . فذكرت ذلك لرسول الله - صلى الله عليه وسلم - فقال : قال الله - عز وجل - : ونفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله ثم نفخ فيه أخرى فإذا هم قيام ينظرون فأكون أول من رفع رأسه فإذا أنا بموسى آخذ بقائمة من قوائم العرش ، فلا أدري أرفع رأسه قبلي أو كان ممن استثنى الله ، ومن قال أنا خير من يونس بن متى فقد كذب وخرجه الترمذي أيضا ، وقال فيه : حديث حسن صحيح . قال القشيري : ومن حمل الاستثناء على موسى والشهداء فهؤلاء قد ماتوا غير أنهم أحياء عند الله . فيجوز أن تكون الصعقة بزوال العقل زوال الحياة ، ويجوز أن تكون بالموت ، ولا يبعد أن يكون الموت والحياة ، فكل ذلك مما يجوزه العقل ، والأمر في وقوعه موقوف على خبر صدق .\nقلت : جاء في بعض طرق أبي هريرة أنه - عليه السلام - قال : لا تخيروني على موسى ؛ فإن الناس يصعقون فأكون أول من يفيق ، فإذا موسى باطش بجانب العرش فلا أدري أكان فيمن صعق فأفاق قبلي أم كان ممن استثنى الله خرجه مسلم . ونحوه عن أبي سعيد الخدري ، والإفاقة إنما تكون عن غشية وزوال عقل لا عن موت برد الحياة . والله أعلم .\nقوله تعالى : فإذا هم قيام ينظرون أي فإذا الأموات من أهل الأرض والسماء أحياء بعثوا من قبورهم ، وأعيدت إليهم أبدانهم وأرواحهم ، فقاموا ينظرون ماذا يؤمرون . وقيل : قيام على أرجلهم ينظرون إلى البعث الذي وعدوا به . وقيل : هذا النظر بمعنى الانتظار ، أي : ينتظرون ما يفعل بهم . وأجاز الكسائي قياما بالنصب ، كما تقول : خرجت فإذا زيد جالسا .\n                                    ",
        "saadi": "وَنُفِخَ فِي ٱلصُّورِ فَصَعِقَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۖ ثُمَّ نُفِخَ فِيهِ أُخۡرَىٰ فَإِذَا هُمۡ قِيَامٞ يَنظُرُونَ ٨٦\n                                        \n                                        \n                                        \n                                        لما خوفهم تعالى من عظمته، خوفهم بأحوال يوم القيامة، ورغَّبهم ورهَّبهم فقال: { وَنُفِخَ فِي الصُّورِ } وهو قرن عظيم، لا يعلم عظمته إلا خالقه، ومن أطلعه اللّه على علمه من خلقه،. فينفخ فيه إسرافيل عليه السلام،. أحد الملائكة المقربين، وأحد حملة عرش الرحمن.\n{ فَصَعِقَ } أي: غشي أو مات، على اختلاف القولين: { مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ } أي: كلهم، لما سمعوا نفخة الصور أزعجتهم من شدتها وعظمها، وما يعلمون أنها مقدمة له. { إِلَّا مَنْ شَاءَ اللَّهُ } ممن ثبته اللّه عند النفخة، فلم يصعق، كالشهداء أو بعضهم، وغيرهم. وهذه النفخة الأولى، نفخة الصعق، ونفخة الفزع.\n{ ثُمَّ نُفِخَ فِيهِ } النفخة الثانية نفخة البعث { فَإِذَا هُمْ قِيَامٌ ينظرون } أي: قد قاموا من قبورهم لبعثهم وحسابهم، قد تمت منهم الخلقة الجسدية والأرواح، وشخصت أبصارهم { يَنْظُرُونَ } ماذا يفعل اللّه بهم.\n                                    "
      },
      "originalText": "وَنُفِخَ فِي ٱلصُّورِ فَصَعِقَ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۖ ثُمَّ نُفِخَ فِيهِ أُخۡرَىٰ فَإِذَا هُمۡ قِيَامٞ يَنظُرُونَ ٨٦"
    },
    {
      "number": 4127,
      "text": "وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ الْكِتَابُ وَجِيءَ بِالنَّبِيِّينَ وَالشُّهَدَاءِ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ",
      "surah": {
        "number": 39,
        "name": "سورة الزمر",
        "englishName": "Az-Zumar",
        "englishNameTranslation": "The Groups",
        "revelationType": "Meccan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 69,
      "juz": 24,
      "manzil": 6,
      "page": 466,
      "ruku": 402,
      "hizbQuarter": 186,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَشۡرَقَتِ ٱلۡأَرۡضُ بِنُورِ رَبِّهَا وَوُضِعَ ٱلۡكِتَٰبُ وَجِاْيٓءَ بِٱلنَّبِيِّ‍ۧنَ وَٱلشُّهَدَآءِ وَقُضِيَ بَيۡنَهُم بِٱلۡحَقِّ وَهُمۡ لَا يُظۡلَمُونَ ٩٦\n                                    \n                                    \n                                    وقوله : ( وأشرقت الأرض بنور ربها ) أي : أضاءت يوم القيامة إذا تجلى الحق ، تبارك وتعالى ، للخلائق لفصل القضاء ، ( ووضع الكتاب ) قال قتادة : كتاب الأعمال ، ( وجيء بالنبيين ) قال ابن عباس : يشهدون على الأمم بأنهم بلغوهم رسالات الله إليهم ، ( والشهداء ) أي : الشهداء من الملائكة الحفظة على أعمال العباد من خير وشر ، ( وقضي بينهم بالحق ) أي : بالعدل ( وهم لا يظلمون ) قال الله [ تعالى ] : ( ونضع الموازين القسط ليوم القيامة فلا تظلم نفس شيئا وإن كان مثقال حبة من خردل أتينا بها وكفى بنا حاسبين ) [ الأنبياء : 47 ] ، وقال [ الله ] تعالى : ( وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما ) [ النساء : 40 ] ، ولهذا قال :\n                                    ",
        "qortoby": "وَأَشۡرَقَتِ ٱلۡأَرۡضُ بِنُورِ رَبِّهَا وَوُضِعَ ٱلۡكِتَٰبُ وَجِاْيٓءَ بِٱلنَّبِيِّ‍ۧنَ وَٱلشُّهَدَآءِ وَقُضِيَ بَيۡنَهُم بِٱلۡحَقِّ وَهُمۡ لَا يُظۡلَمُونَ ٩٦\n                                    \n                                    \n                                    قوله تعالى : وأشرقت الأرض بنور ربها إشراقها إضاءتها ، يقال : أشرقت الشمس إذا أضاءت وشرقت إذا طلعت . ومعنى : بنور ربها بعدل ربها ، قاله الحسن وغيره . وقال الضحاك : بحكم ربها ، والمعنى واحد ، أي : أنارت وأضاءت بعدل الله وقضائه بالحق بين عباده . والظلم ظلمات والعدل نور . وقيل : إن الله يخلق نورا يوم القيامة يلبسه وجه الأرض فتشرق الأرض به . وقال ابن عباس : النور المذكور هاهنا ليس من نور الشمس والقمر ، بل هو نور يخلقه الله فيضيء به الأرض . وروي أن الأرض يومئذ من فضة تشرق بنور الله تعالى حين يأتي لفصل القضاء . والمعنى أنها أشرقت بنور خلقه الله تعالى ، فأضاف النور إليه على حد إضافة الملك إلى المالك . وقيل : إنه اليوم الذي يقضي فيه بين خلقه ; لأنه نهار لا ليل معه . وقرأ ابن عباس وعبيد بن عمير : \" وأشرقت الأرض \" على ما لم يسم فاعله ، وهي قراءة على التفسير . وقد ضل قوم هاهنا فتوهموا أن الله - عز وجل - من جنس النور والضياء المحسوس ، وهو متعال عن مشابهة المحسوسات ، بل هو منور السماوات والأرض ، فمنه كل نور خلقا وإنشاء . وقال أبو جعفر النحاس : وقوله - عز وجل - : وأشرقت الأرض بنور ربها يبين هذا الحديث المرفوع من طرق كثيرة صحاح تنظرون إلى الله - عز وجل - لا تضامون في رؤيته وهو يروى على أربعة أوجه : لا تضامون ، ولا تضارون ، ولا تضامون ، ولا تضارون ، فمعنى \" لا تضامون \" : لا يلحقكم ضيم كما يلحقكم في الدنيا في النظر إلى الملوك . و \" لا تضارون \" : لا يلحقكم ضير . و \" لا تضامون \" : لا ينضم بعضكم إلى بعض ليسأله أن يريه . و \" لا تضارون \" لا يخالف بعضكم بعضا . يقال : ضاره مضارة وضرارا أي : خالفه .\nقوله تعالى : ووضع الكتاب قال ابن عباس : يريد اللوح المحفوظ . وقال قتادة : يريد الكتاب والصحف التي فيها أعمال بني آدم ، فآخذ بيمينه وآخذ بشماله . وجيء بالنبيين أي جيء بهم فسألهم عما أجابتهم به أممهم . والشهداء الذين شهدوا على الأمم من أمة محمد صلى الله عليه وسلم ، كما قال تعالى : وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس وقيل : المراد بالشهداء الذين استشهدوا في سبيل الله ، فيشهدون يوم القيامة لمن ذب عن دين الله ، قاله السدي . قال ابن زيد : هم الحفظة الذين يشهدون على الناس بأعمالهم . قال الله تعالى : وجاءت كل نفس معها سائق وشهيد فالسائق يسوقها إلى الحساب ، والشهيد يشهد عليها ، وهو الملك الموكل بالإنسان على ما يأتي بيانه في [ ق ] .\nوقضي بينهم بالحق أي بالصدق والعدل . وهم لا يظلمون قال سعيد بن جبير : لا ينقص من حسناتهم ولا يزاد على سيئاتهم .\n                                    ",
        "saadi": "وَأَشۡرَقَتِ ٱلۡأَرۡضُ بِنُورِ رَبِّهَا وَوُضِعَ ٱلۡكِتَٰبُ وَجِاْيٓءَ بِٱلنَّبِيِّ‍ۧنَ وَٱلشُّهَدَآءِ وَقُضِيَ بَيۡنَهُم بِٱلۡحَقِّ وَهُمۡ لَا يُظۡلَمُونَ ٩٦\n                                        \n                                        \n                                        \n                                        { وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا } علم من هذا، أن الأنوار الموجودة تذهب يوم القيامة وتضحمل، وهو كذلك، فإن اللّه أخبر أن الشمس تكور، والقمر يخسف، والنجوم تندثر، ويكون الناس في ظلمة، فتشرق عند ذلك الأرض بنور ربها، عندما يتجلى وينزل للفصل بينهم، وذلك اليوم يجعل اللّه للخلق قوة، وينشئهم نشأة يَقْوَوْنَ على أن لا يحرقهم نوره، ويتمكنون أيضا من رؤيته، وإلا، فنوره تعالى عظيم، لو كشفه، لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه.\n{ وَوُضِعَ الْكِتَابُ } أي: كتاب الأعمال وديوانه، وضع ونشر، ليقرأ ما فيه من الحسنات والسيئات، كما قال تعالى: { وَوُضِعَ الْكِتَابُ فَتَرَى الْمُجْرِمِينَ مُشْفِقِينَ مِمَّا فِيهِ وَيَقُولُونَ يَا وَيْلَتَنَا مَا لِهَذَا الْكِتَابِ لَا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّا أَحْصَاهَا وَوَجَدُوا مَا عَمِلُوا حَاضِرًا وَلَا يَظْلِمُ رَبُّكَ أَحَدًا } ويقال للعامل من تمام العدل والإنصاف: { اقْرَأْ كِتَابَكَ كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا }\n{ وَجِيءَ بِالنَّبِيِّينَ } ليسألوا عن التبليغ، وعن أممهم، ويشهدوا عليهم. { وَالشُّهَدَاءِ } من الملائكة، والأعضاء والأرض. { وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ } أي: العدل التام والقسط العظيم، لأنه حساب صادر ممن لا يظلم مثقال ذرة، ومن هو محيط بكل شيء، وكتابه الذي هو اللوح المحفوظ، محيط بكل ما عملوه، والحفظة الكرام، والذين لا يعصون ربهم، قد كتبت عليهم ما عملوه، وأعدل الشهداء قد شهدوا على ذلك الحكم، فحكم بذلك من يعلم مقادير الأعمال ومقادير استحقاقها للثواب والعقاب.\n                                    "
      },
      "originalText": "وَأَشۡرَقَتِ ٱلۡأَرۡضُ بِنُورِ رَبِّهَا وَوُضِعَ ٱلۡكِتَٰبُ وَجِاْيٓءَ بِٱلنَّبِيِّ‍ۧنَ وَٱلشُّهَدَآءِ وَقُضِيَ بَيۡنَهُم بِٱلۡحَقِّ وَهُمۡ لَا يُظۡلَمُونَ ٩٦"
    },
    {
      "number": 4128,
      "text": "وَوُفِّيَتْ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ",
      "surah": {
        "number": 39,
        "name": "سورة الزمر",
        "englishName": "Az-Zumar",
        "englishNameTranslation": "The Groups",
        "revelationType": "Meccan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 70,
      "juz": 24,
      "manzil": 6,
      "page": 466,
      "ruku": 402,
      "hizbQuarter": 186,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُوَ أَعۡلَمُ بِمَا يَفۡعَلُونَ ٠٧\n                                    \n                                    \n                                    أي من خير أو شر \"وهو أعلم بما يفعلون\".\n                                    ",
        "qortoby": "وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُوَ أَعۡلَمُ بِمَا يَفۡعَلُونَ ٠٧\n                                    \n                                    \n                                    ووفيت كل نفس ما عملت من خير أو شر . وهو أعلم بما يفعلون في الدنيا ولا حاجة به - عز وجل - إلى كتاب ولا إلى شاهد ، ومع ذلك فتشهد الكتب والشهود إلزاما للحجة .\n                                    ",
        "saadi": "وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُوَ أَعۡلَمُ بِمَا يَفۡعَلُونَ ٠٧\n                                        \n                                        \n                                        \n                                        فيحصل حكم يقر به الخلق، ويعترفون للّه بالحمد والعدل، ويعرفون به من عظمته وعلمه وحكمته ورحمته ما لم يخطر بقلوبهم، ولا تعبر عنه ألسنتهم، ولهذا قال: { وَوُفِّيَتْ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ }\n                                    "
      },
      "originalText": "وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ وَهُوَ أَعۡلَمُ بِمَا يَفۡعَلُونَ ٠٧"
    },
    {
      "number": 4129,
      "text": "وَسِيقَ الَّذِينَ كَفَرُوا إِلَىٰ جَهَنَّمَ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا فُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا ۚ قَالُوا بَلَىٰ وَلَٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكَافِرِينَ",
      "surah": {
        "number": 39,
        "name": "سورة الزمر",
        "englishName": "Az-Zumar",
        "englishNameTranslation": "The Groups",
        "revelationType": "Meccan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 71,
      "juz": 24,
      "manzil": 6,
      "page": 466,
      "ruku": 403,
      "hizbQuarter": 186,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَسِيقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا فُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَآ أَلَمۡ يَأۡتِكُمۡ رُسُلٞ مِّنكُمۡ يَتۡلُونَ عَلَيۡكُمۡ ءَايَٰتِ رَبِّكُمۡ وَيُنذِرُونَكُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَاۚ قَالُواْ بَلَىٰ وَلَٰكِنۡ حَقَّتۡ كَلِمَةُ ٱلۡعَذَابِ عَلَى ٱلۡكَٰفِرِينَ ١٧\n                                    \n                                    \n                                    يخبر تعالى عن حال الأشقياء الكفار كيف يساقون إلى النار ؟ وإنما يساقون سوقا عنيفا بزجر وتهديد ووعيد ، كما قال تعالى : ( يوم يدعون إلى نار جهنم دعا ) [ الطور : 13 ] أي : يدفعون إليها دفعا . هذا وهم عطاش ظماء ، كما قال في الآية الأخرى : ( يوم نحشر المتقين إلى الرحمن وفدا ونسوق المجرمين إلى جهنم وردا ) [ مريم : 86 ، 85 ] . وهم في تلك الحال صم وبكم وعمي ، منهم من يمشي على وجهه ، ( ونحشرهم يوم القيامة على وجوههم عميا وبكما وصما مأواهم جهنم كلما خبت زدناهم سعيرا ) [ الإسراء : 97 ] .\nوقوله : ( حتى إذا جاءوها فتحت أبوابها ) أي : بمجرد وصولهم إليها فتحت لهم أبوابها سريعا ، لتعجل لهم العقوبة ، ثم يقول لهم خزنتها من الزبانية - الذين هم غلاظ الأخلاق ، شداد القوى على وجه التقريع والتوبيخ والتنكيل - : ( ألم يأتكم رسل منكم ) أي : من جنسكم تتمكنون من مخاطبتهم والأخذ عنهم ، ( يتلون عليكم آيات ربكم ) أي : يقيمون عليكم الحجج والبراهين على صحة ما دعوكم إليه ، ( وينذرونكم لقاء يومكم هذا ) أي : ويحذرونكم من شر هذا اليوم ؟ فيقول الكفار لهم : ( بلى ) أي : قد جاءونا وأنذرونا ، وأقاموا علينا الحجج والبراهين ، ( ولكن حقت كلمة العذاب على الكافرين ) أي : ولكن كذبناهم وخالفناهم ، لما سبق إلينا من الشقوة التي كنا نستحقها حيث عدلنا عن الحق إلى الباطل ، كما قال تعالى مخبرا عنهم في الآية الأخرى : ( كلما ألقي فيها فوج سألهم خزنتها ألم يأتكم نذير قالوا بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شيء إن أنتم إلا في ضلال كبير وقالوا لو كنا نسمع أو نعقل ما كنا في أصحاب السعير ) [ الملك : 8 - 10 ] ، أي : رجعوا على أنفسهم بالملامة والندامة ( فاعترفوا بذنبهم فسحقا لأصحاب السعير ) [ الملك : 11 ] أي : بعدا لهم وخسارا .\n                                    ",
        "qortoby": "وَسِيقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا فُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَآ أَلَمۡ يَأۡتِكُمۡ رُسُلٞ مِّنكُمۡ يَتۡلُونَ عَلَيۡكُمۡ ءَايَٰتِ رَبِّكُمۡ وَيُنذِرُونَكُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَاۚ قَالُواْ بَلَىٰ وَلَٰكِنۡ حَقَّتۡ كَلِمَةُ ٱلۡعَذَابِ عَلَى ٱلۡكَٰفِرِينَ ١٧\n                                    \n                                    \n                                    قوله تعالى : وسيق الذين كفروا إلى جهنم زمرا هذا بيان توفية كل نفس عملها ، فيساق الكافر إلى النار والمؤمن إلى الجنة . والزمر : الجماعات واحدتها زمرة كظلمة وغرفة . وقال الأخفش وأبو عبيدة : زمرا : جماعات متفرقة بعضها إثر بعض . قال الشاعر :\nوترى الناس إلى منزله زمرا تنتابه بعد زمر\nوقال آخر :\nحتى احزألت زمر بعد زمر\nوقيل : دفعا وزجرا بصوت كصوت المزمار .\nحتى إذا جاءوها فتحت أبوابها جواب إذا ، وهي سبعة أبواب . وقد مضى في [ الحجر ] . وقال لهم خزنتها واحدهم خازن نحو سدنة وسادن ، يقولون لهم تقريعا وتوبيخا . ألم يأتكم رسل منكم يتلون عليكم آيات ربكم أي الكتب المنزلة على الأنبياء . وينذرونكم أي يخوفونكم لقاء يومكم هذا قالوا بلى أي قد جاءتنا ، وهذا اعتراف منهم بقيام الحجة عليهم ولكن حقت كلمة العذاب على الكافرين وهي قوله تعالى : لأملأن جهنم من الجنة والناس أجمعين .\n                                    ",
        "saadi": "وَسِيقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا فُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَآ أَلَمۡ يَأۡتِكُمۡ رُسُلٞ مِّنكُمۡ يَتۡلُونَ عَلَيۡكُمۡ ءَايَٰتِ رَبِّكُمۡ وَيُنذِرُونَكُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَاۚ قَالُواْ بَلَىٰ وَلَٰكِنۡ حَقَّتۡ كَلِمَةُ ٱلۡعَذَابِ عَلَى ٱلۡكَٰفِرِينَ ١٧\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى حكمه بين عباده، الذين جمعهم في خلقه ورزقه وتدبيره، واجتماعهم في الدنيا، واجتماعهم في موقف القيامة، فرقهم تعالى عند جزائهم، كما افترقوا في الدنيا بالإيمان والكفر، والتقوى والفجور، فقال: { وَسِيقَ الَّذِينَ كَفَرُوا إِلَى جَهَنَّمَ } أي: سوقا عنيفا، يضربون بالسياط الموجعة، من الزبانية الغلاظ الشداد، إلى شر محبس وأفظع موضع، وهي جهنم التي قد جمعت كل عذاب، وحضرها كل شقاء، وزال عنها كل سرور، كما قال تعالى: { يَوْمَ يُدَعُّونَ إِلَى نَارِ جَهَنَّمَ دَعًّا } أي: يدفعون إليها دفعا، وذلك لامتناعهم من دخولها.\nويساقون إليها { زُمَرًا } أي: فرقا متفرقة، كل زمرة مع الزمرة التي تناسب عملها، وتشاكل سعيها، يلعن بعضهم بعضا، ويبرأ بعضهم من بعض. { حَتَّى إِذَا جَاءُوهَا } أي: وصلوا إلى ساحتها { فُتِحَتْ } لهم أي: لأجلهم { أَبْوَابُهَا } لقدومهم وقِرًى لنزولهم.\n{ وَقَالَ لَهُمْ خَزَنَتُهَا } مهنئين لهم بالشقاء الأبدي، والعذاب السرمدي، وموبخين لهم على الأعمال التي أوصلتهم إلى هذا المحل الفظيع: { أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ } أي: من جنسكم تعرفونهم وتعرفون صدقهم، وتتمكنون من التلقي عنهم؟. { يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ } التي أرسلهم اللّه بها، الدالة على الحق اليقين بأوضح البراهين.\n{ وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَذَا } أي: وهذا يوجب عليكم اتباعهم والحذر من عذاب هذا اليوم، باستعمال تقواه، وقد كانت حالكم بخلاف هذه الحال ؟\n{ قَالُوا } مقرين بذنبهم، وأن حجة اللّه قامت عليهم: { بَلَى } قد جاءتنا رسل ربنا بآياته وبيناته، وبينوا لنا غاية التبيين، وحذرونا من هذا اليوم. { وَلَكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكَافِرِينَ } أي: بسبب كفرهم وجبت عليهم كلمة العذاب، التي هي لكل من كفر بآيات اللّه، وجحد ما جاءت به المرسلون، فاعترفوا بذنبهم وقيام الحجة عليهم.\n                                    "
      },
      "originalText": "وَسِيقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا فُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَآ أَلَمۡ يَأۡتِكُمۡ رُسُلٞ مِّنكُمۡ يَتۡلُونَ عَلَيۡكُمۡ ءَايَٰتِ رَبِّكُمۡ وَيُنذِرُونَكُمۡ لِقَآءَ يَوۡمِكُمۡ هَٰذَاۚ قَالُواْ بَلَىٰ وَلَٰكِنۡ حَقَّتۡ كَلِمَةُ ٱلۡعَذَابِ عَلَى ٱلۡكَٰفِرِينَ ١٧"
    },
    {
      "number": 4130,
      "text": "قِيلَ ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ",
      "surah": {
        "number": 39,
        "name": "سورة الزمر",
        "englishName": "Az-Zumar",
        "englishNameTranslation": "The Groups",
        "revelationType": "Meccan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 72,
      "juz": 24,
      "manzil": 6,
      "page": 466,
      "ruku": 403,
      "hizbQuarter": 186,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قِيلَ ٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ ٢٧\n                                    \n                                    \n                                    وقوله هاهنا : ( قيل ادخلوا أبواب جهنم خالدين فيها ) أي : كل من رآهم وعلم حالهم يشهد عليهم بأنهم مستحقون للعذاب ; ولهذا لم يسند هذا القول إلى قائل معين ، بل أطلقه ليدل على أن الكون شاهد عليهم بأنهم مستحقون ما هم فيه بما حكم العدل الخبير عليهم به ; ولهذا قال جل وعلا ( قيل ادخلوا أبواب جهنم خالدين فيها ) أي : ماكثين فيها لا خروج لكم منها ، ولا زوال لكم عنها ، ( فبئس مثوى المتكبرين ) أي : فبئس المصير وبئس المقيل لكم ، بسبب تكبركم في الدنيا ، وإبائكم عن اتباع الحق ، فهو الذي صيركم إلى ما أنتم فيه ، فبئس الحال وبئس المآل .\n                                    ",
        "qortoby": "قِيلَ ٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ ٢٧\n                                    \n                                    \n                                    قيل ادخلوا أبواب جهنم خالدين فيها أي يقال لهم : ادخلوا جهنم . وقد مضى الكلام في أبوابها . قال وهب : تستقبلهم الزبانية بمقامع من نار فيدفعونهم بمقامعهم ، فإنه ليقع في الدفعة الواحدة إلى النار بعدد ربيعة ومضر . فبئس مثوى المتكبرين تقدم بيانه .\n                                    ",
        "saadi": "قِيلَ ٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ ٢٧\n                                        \n                                        \n                                        \n                                        فـ { قِيلَ } لهم على وجه الإهانة والإذلال: { ادْخُلُوا أَبْوَابَ جَهَنَّمَ } كل طائفة تدخل من الباب الذي يناسبها ويوافق عملها. { خَالِدِينَ فِيهَا } أبدا، لا يظعنون عنها، ولا يفتر عنهم العذاب ساعة ولا ينظرون. { فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ } أي: بئس المقر، النار مقرهم، وذلك لأنهم تكبروا على الحق، فجازاهم اللّه من جنس عملهم، بالإهانة والذل، والخزي.\n                                    "
      },
      "originalText": "قِيلَ ٱدۡخُلُوٓاْ أَبۡوَٰبَ جَهَنَّمَ خَٰلِدِينَ فِيهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِينَ ٢٧"
    },
    {
      "number": 4131,
      "text": "وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا ۖ حَتَّىٰ إِذَا جَاءُوهَا وَفُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ",
      "surah": {
        "number": 39,
        "name": "سورة الزمر",
        "englishName": "Az-Zumar",
        "englishNameTranslation": "The Groups",
        "revelationType": "Meccan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 73,
      "juz": 24,
      "manzil": 6,
      "page": 466,
      "ruku": 403,
      "hizbQuarter": 186,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ إِلَى ٱلۡجَنَّةِ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَا سَلَٰمٌ عَلَيۡكُمۡ طِبۡتُمۡ فَٱدۡخُلُوهَا خَٰلِدِينَ ٣٧\n                                    \n                                    \n                                    وهذا إخبار عن حال السعداء المؤمنين حين يساقون على النجائب وفدا إلى الجنة ) زمرا ) أي : جماعة بعد جماعة : المقربون ، ثم الأبرار ، ثم الذين يلونهم ، ثم الذين يلونهم كل طائفة مع من يناسبهم : الأنبياء مع الأنبياء والصديقون مع أشكالهم ، والشهداء مع أضرابهم ، والعلماء مع أقرانهم ، وكل صنف مع صنف ، كل زمرة تناسب بعضها بعضا .\n( حتى إذا جاءوها ) أي : وصلوا إلى أبواب الجنة بعد مجاوزة الصراط حبسوا على قنطرة بين الجنة والنار ، فاقتص لهم مظالم كانت بينهم في الدنيا ، حتى إذا هذبوا ونقوا أذن لهم في دخول الجنة ، وقد ورد في حديث الصور أن المؤمنين إذا انتهوا إلى أبواب الجنة تشاوروا فيمن يستأذن لهم بالدخول ، فيقصدون ، آدم ، ثم نوحا ، ثم إبراهيم ، ثم موسى ، ثم عيسى ، ثم محمدا ، صلوات الله وسلامه عليهم أجمعين ، كما فعلوا في العرصات عند استشفاعهم إلى الله - عز وجل - أن يأتي لفصل القضاء ، ليظهر شرف محمد - صلى الله عليه وسلم - على سائر البشر في المواطن كلها .\nوقد ثبت في صحيح مسلم عن أنس - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" أنا أول شفيع في الجنة \" وفي لفظ لمسلم : \" وأنا أول من يقرع باب الجنة \" . .\nوقال الإمام أحمد : حدثنا هاشم ، حدثنا سليمان ، عن ثابت ، عن أنس بن مالك ، رضي الله عنه ، قال : قال رسول الله - صلى الله عليه وسلم - : \" آتي باب الجنة يوم القيامة فأستفتح ، فيقول الخازن : من أنت ؟ فأقول : محمد . قال : يقول : بك أمرت ألا أفتح لأحد قبلك \" .\nورواه مسلم عن عمرو الناقد وزهير بن حرب ، كلاهما عن أبي النضر هاشم بن القاسم ، عن سليمان - وهو ابن المغيرة القيسي - عن ثابت ، عن أنس ، به .\nوقال الإمام أحمد : حدثنا عبد الرزاق حدثنا معمر عن همام بن منبه ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" أول زمرة تلج الجنة صورهم على صورة القمر ليلة البدر ، لا يبصقون فيها ، ولا يمتخطون فيها ، ولا يتغوطون فيها . آنيتهم وأمشاطهم الذهب والفضة ، ومجامرهم الألوة ، ورشحهم المسك ، ولكل واحد منهم زوجتان ، يرى مخ ساقهما من وراء اللحم من الحسن . لا اختلاف بينهم ولا تباغض ، قلوبهم على قلب واحد يسبحون الله بكرة وعشيا \" .\nرواه البخاري عن محمد بن مقاتل ، عن ابن المبارك . ورواه مسلم ، عن محمد بن رافع ، عن عبد الرزاق ، كلاهما عن معمر بإسناده نحوه . وكذا رواه أبو الزناد ، عن الأعرج ، عن أبي هريرة [ رضي الله عنه ] ، عن رسول الله - صلى الله عليه وسلم - .\nوقال الحافظ أبو يعلى : حدثنا أبو خيثمة ، حدثنا جرير ، عن عمارة بن القعقاع ، عن أبي زرعة ، عن أبي هريرة [ رضي الله عنه ] قال : قال رسول الله - صلى الله عليه وسلم - : \" أول زمرة يدخلون الجنة على صورة القمر ليلة البدر ، والذين يلونهم على ضوء أشد كوكب دري في السماء إضاءة ، لا يبولون ولا يتغوطون ولا يتفلون ولا يمتخطون ، أمشاطهم الذهب ورشحهم المسك ، ومجامرهم الألوة ، وأزواجهم الحور العين ، أخلاقهم على خلق رجل واحد ، على صورة أبيهم آدم ، ستون ذراعا في السماء \" .\nوأخرجاه أيضا من حديث جرير .\nوقال الزهري ، عن سعيد ، عن أبي هريرة - رضي الله عنه - عن رسول الله - صلى الله عليه وسلم - قال : \" يدخل الجنة من أمتي زمرة ، هم سبعون ألفا ، تضيء وجوههم إضاءة القمر ليلة البدر \" . فقام عكاشة بن محصن فقال : يا رسول الله ادع الله ، أن يجعلني منهم : فقال : \" اللهم اجعله منهم \" . ثم قام رجل من الأنصار فقال : يا رسول الله ، ادع الله أن يجعلني منهم . فقال - صلى الله عليه وسلم - : \" سبقك بها عكاشة \" .\nأخرجاه وقد روى هذا الحديث - في السبعين ألفا يدخلون الجنة بغير حساب - البخاري ومسلم ، عن ابن عباس ، وجابر بن عبد الله ، وعمران بن حصين ، وابن مسعود ، ورفاعة بن عرابة الجهني ، وأم قيس بنت محصن .\nولهما عن أبي حازم ، عن سهل بن سعد ، أن رسول الله - صلى الله عليه وسلم - قال : \" ليدخلن الجنة من أمتي سبعون ألفا - أو : سبعمائة ألف - آخذ بعضهم ببعض ، حتى يدخل أولهم وآخرهم الجنة ، وجوههم على صورة القمر ليلة البدر \" . .\nوقال أبو بكر بن أبي شيبة : حدثنا إسماعيل بن عياش ، عن محمد بن زياد قال : سمعت أبا أمامة الباهلي يقول : سمعت رسول الله - صلى الله عليه وسلم - يقول : وعدني ربي - عز وجل - أن يدخل الجنة من أمتي سبعون ألفا ، مع كل ألف سبعون ألفا ، ولا حساب عليهم ولا عذاب ، وثلاث حثيات من حثيات ربي - عز وجل - \" .\nوكذا رواه الوليد بن مسلم ، عن صفوان بن عمرو ، عن سليم بن عامر [ و ] أبي اليمان عامر بن عبد الله بن لحي عن أبي أمامة [ رضي الله عنه ] .\nورواه الطبراني ، عن عتبة بن عبد السلمي : \" ثم يشفع كل ألف في سبعين ألفا \" .\nوروي مثله ، عن ثوبان وأبي سعيد الأنماري ، وله شواهد من وجوه كثيرة .\nوقوله : ( حتى إذا جاءوها وفتحت أبوابها وقال لهم خزنتها سلام عليكم طبتم فادخلوها خالدين ) لم يذكر الجواب هاهنا ، وتقديره : حتى إذا جاءوها ، وكانت هذه الأمور من فتح الأبواب لهم إكراما وتعظيما ، وتلقتهم الملائكة الخزنة بالبشارة والسلام والثناء ، لا كما تلقى الزبانية الكفرة بالتثريب والتأنيب ، فتقديره : إذا كان هذا سعدوا وطابوا ، وسروا وفرحوا ، بقدر كل ما يكون لهم فيه نعيم . وإذا حذف الجواب هاهنا ذهب الذهن كل مذهب في الرجاء والأمل .\nومن زعم أن \" الواو \" في قوله : ( وفتحت أبوابها ) واو الثمانية ، واستدل به على أن أبواب الجنة ثمانية ، فقد أبعد النجعة وأغرق في النزع . وإنما يستفاد كون أبواب الجنة ثمانية من الأحاديث الصحيحة .\nقال الإمام أحمد : حدثنا عبد الرزاق : أخبرنا معمر ، عن الزهري عن حميد بن عبد الرحمن ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" من أنفق زوجين من ماله في سبيل الله ، دعي من أبواب الجنة ، وللجنة أبواب ، فمن كان من أهل الصلاة دعي من باب الصلاة ، ومن كان من أهل الصدقة دعي من باب الصدقة ، ومن كان من أهل الجهاد دعي من باب الجهاد ، ومن كان من أهل الصيام دعي من باب الريان \" فقال أبو بكر ، رضي الله تعالى عنه : يا رسول الله ، ما على أحد من ضرورة دعي ، من أيها دعي ، فهل يدعى منها كلها أحد يا رسول الله ؟ قال : \" نعم ، وأرجو أن تكون منهم \" .\nورواه البخاري ومسلم ، من حديث الزهري ، بنحوه .\nوفيهما من حديث أبي حازم سلمة بن دينار ، عن سهل بن سعد أن رسول الله - صلى الله عليه وسلم - قال : \" إن في الجنة ثمانية أبواب ، باب منها يسمى الريان ، لا يدخله إلا الصائمون \" .\nوفي صحيح مسلم ، عن عمر بن الخطاب - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" ما منكم من أحد يتوضأ فيبلغ - أو : فيسبغ الوضوء - ثم يقول : أشهد أن لا إله إلا الله ، وأن محمدا عبده ورسوله ، إلا فتحت له أبواب الجنة الثمانية ، يدخل من أيها شاء \" . .\nوقال الحسن بن عرفة : حدثنا إسماعيل بن عياش ، عن عبد الله بن عبد الرحمن بن أبي حسين ، عن شهر بن حوشب ، عن معاذ - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : \" مفتاح الجنة : لا إله إلا الله \" .\nذكر سعة أبواب الجنة - نسأل الله العظيم من فضله أن يجعلنا من أهلها - :\nفي الصحيحين من حديث أبي زرعة ، عن أبي هريرة [ رضي الله عنه ] في حديث الشفاعة الطويل : \" فيقول الله يا محمد ، أدخل من لا حساب عليه .\nمن أمتك من الباب الأيمن ، وهم شركاء الناس في الأبواب الأخر . والذي نفس محمد بيده ، إن ما بين المصراعين من مصاريع الجنة - ما بين عضادتي الباب - لكما بين مكة وهجر - أو هجر ومكة \" . وفي رواية : \" مكة وبصرى \" .\nوفي صحيح مسلم ، عن عتبة بن غزوان أنه خطبهم خطبة فقال فيها : \" ولقد ذكر لنا أن ما بين مصراعين من مصاريع الجنة ، مسيرة أربعين سنة ، وليأتين عليه يوم وهو كظيظ من الزحام \" .\nوفي المسند عن حكيم بن معاوية ، عن أبيه ، عن رسول الله - صلى الله عليه وسلم - مثله .\nوقال عبد بن حميد : حدثنا الحسن بن موسى ، حدثنا ابن لهيعة ، حدثنا دراج ، عن أبي الهيثم ، عن أبي سعيد ، عن رسول الله - صلى الله عليه وسلم - قال : \" إن ما بين مصراعين في الجنة مسيرة أربعين سنة \" .\nوقوله : ( وقال لهم خزنتها سلام عليكم طبتم ) أي : طابت أعمالكم وأقوالكم ، وطاب سعيكم فطاب جزاؤكم ، كما أمر رسول الله - صلى الله عليه وسلم - أن ينادى بين المسلمين في بعض الغزوات : \" إن الجنة لا يدخلها إلا نفس مسلمة \" وفي رواية : \" مؤمنة \" . .\nوقوله : ( فادخلوها خالدين ) أي : ماكثين فيها أبدا ، لا يبغون عنها حولا .\n                                    ",
        "qortoby": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ إِلَى ٱلۡجَنَّةِ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَا سَلَٰمٌ عَلَيۡكُمۡ طِبۡتُمۡ فَٱدۡخُلُوهَا خَٰلِدِينَ ٣٧\n                                    \n                                    \n                                    قوله تعالى : وسيق الذين اتقوا ربهم إلى الجنة زمرا يعني من الشهداء والزهاد والعلماء والقراء وغيرهم ، ممن اتقى الله تعالى وعمل بطاعته . وقال في حق الفريقين : وسيق بلفظ واحد ، فسوق أهل النار طردهم إليها بالخزي والهوان ، كما يفعل بالأسارى والخارجين على السلطان إذا سيقوا إلى حبس أو قتل ، وسوق أهل الجنان سوق مراكبهم إلى دار الكرامة والرضوان ; لأنه لا يذهب بهم إلا راكبين كما يفعل بمن يشرف ويكرم من الوافدين على بعض الملوك ، فشتان ما بين السوقين .\nحتى إذا جاءوها وفتحت أبوابها قيل : الواو هنا للعطف عطف على جملة والجواب محذوف . قال المبرد : أي : سعدوا وفتحت ، وحذف الجواب بليغ في كلام العرب . وأنشد :\nفلو أنها نفس تموت جميعة ولكنها نفس تساقط أنفسا\nفحذف جواب لو ، والتقدير : لكان أروح . وقال الزجاج : حتى إذا جاءوها دخلوها وهو قريب من الأول . وقيل : الواو زائدة . قال الكوفيون : وهو خطأ عند البصريين . وقد قيل : إن زيادة الواو دليل على أن الأبواب فتحت لهم قبل أن يأتوا لكرامتهم على الله تعالى ، والتقدير : حتى إذا جاءوها وأبوابها مفتحة ، بدليل قوله : جنات عدن مفتحة لهم الأبواب وحذف الواو في قصة أهل النار ; لأنهم وقفوا على النار وفتحت بعد وقوفهم إذلالا وترويعا لهم . ذكره المهدوي وحكى معناه النحاس قبله . قال النحاس : فأما الحكمة في إثبات الواو في الثاني وحذفها من الأول ، فقد تكلم فيه بعض أهل العلم بقول لا أعلم أنه سبقه إليه أحد ، وهو أنه لما قال الله - عز وجل - في أهل النار : حتى إذا جاءوها فتحت أبوابها دل بهذا على أنها كانت مغلقة ، ولما قال في أهل الجنة : حتى إذا جاءوها وفتحت أبوابها دل بهذا على أنها كانت مفتحة قبل أن يجيئوها ، والله أعلم . وقيل : إنها واو الثمانية . وذلك من عادة قريش أنهم يعدون من الواحد فيقولون : خمسة ستة سبعة وثمانية ، فإذا بلغوا السبعة قالوا : وثمانية . قال أبو بكر بن عياش . قال الله تعالى : سخرها عليهم سبع ليال وثمانية أيام وقال : التائبون العابدون ثم قال في الثامن : والناهون عن المنكر وقال : ويقولون سبعة وثامنهم وقال ثيبات وأبكارا وقد مضى القول في هذا في [ براءة ] مستوفى وفي [ الكهف ] أيضا .\nقلت : وقد استدل بهذا من قال إن أبواب الجنة ثمانية ، وذكروا حديث عمر بن الخطاب ، قال : قال رسول الله - صلى الله عليه وسلم - : ما منكم من أحد يتوضأ فيبلغ - أو فيسبغ الوضوء - ثم قال أشهد أن لا إله إلا الله وأن محمدا عبده ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء خرجه مسلم وغيره . وقد خرج الترمذي حديث عمر هذا وقال فيه : فتح له من أبواب الجنة ثمانية أبواب يوم القيامة . بزيادة من ، وهو يدل على أن أبواب الجنة أكثر من ثمانية . وقد ذكرنا ذلك في كتاب التذكرة وانتهى عددها إلى ثلاثة عشر بابا ، وذكرنا هناك عظم أبوابها وسعتها حسب ما ورد في الحديث من ذلك ، فمن أراده وقف عليه هناك .\nوقال لهم خزنتها قيل : الواو ملغاة تقديره : حتى إذا جاءوها وفتحت أبوابها قال لهم خزنتها سلام عليكم طبتم أي : في الدنيا . قال مجاهد : بطاعة الله . وقيل : بالعمل الصالح . حكاه النقاش ، والمعنى واحد . وقال مقاتل : إذا قطعوا جسر جهنم حبسوا على قنطرة بين الجنة والنار ، فيقص لبعضهم من بعض مظالم كانت بينهم في الدنيا ، حتى إذا هذبوا وطيبوا قال لهم رضوان وأصحابه : سلام عليكم بمعنى التحية طبتم فادخلوها خالدين .\nقلت : خرج البخاري حديث القنطرة هذا في جامعه من حديث أبي سعيد الخدري قال : قال رسول الله - صلى الله عليه وسلم - : يخلص المؤمنون من النار فيحبسون على قنطرة بين الجنة والنار فيقص لبعضهم من بعض مظالم كانت بينهم في الدنيا ، حتى إذا هذبوا ونقوا أذن لهم في دخول الجنة ، فوالذي نفس محمد بيده لأحدهم أهدى بمنزله في الجنة منه بمنزله كان في الدنيا وحكى النقاش : إن على باب الجنة شجرة ينبع من ساقها عينان يشرب المؤمنون من إحداهما فتطهر أجوافهم ، وذلك قوله تعالى : وسقاهم ربهم شرابا طهورا ثم يغتسلون من الأخرى فتطيب أبشارهم فعندها يقول لهم خزنتها : سلام عليكم طبتم فادخلوها خالدين وهذا يروى معناه عن علي - رضي الله عنه - .\n                                    ",
        "saadi": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ إِلَى ٱلۡجَنَّةِ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَا سَلَٰمٌ عَلَيۡكُمۡ طِبۡتُمۡ فَٱدۡخُلُوهَا خَٰلِدِينَ ٣٧\n                                        \n                                        \n                                        \n                                        ثم قال عن أهل الجنة: { وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ } بتوحيده والعمل بطاعته، سوق إكرام وإعزاز، يحشرون وفدا على النجائب. { إِلَى الْجَنَّةِ زُمَرًا } فرحين مستبشرين، كل زمرة مع الزمرة، التي تناسب عملها وتشاكله. { حَتَّى إِذَا جَاءُوهَا } أي: وصلوا لتلك الرحاب الرحيبة والمنازل الأنيقة، وهبَّ عليهم ريحها ونسيمها، وآن خلودها ونعيمها. { وَفُتِحَتْ } لهم { أَبْوَابُهَا } فتح إكرام، لكرام الخلق، ليكرموا فيها. { وَقَالَ لَهُمْ خَزَنَتُهَا } تهنئة لهم وترحيبا: { سَلَامٌ عَلَيْكُمْ } أي: سلام من كل آفة وشر حال.عليكم { طِبْتُمْ } أي: طابت قلوبكم بمعرفة اللّه ومحبته وخشيته، وألسنتكم بذكره، وجوارحكم بطاعته. { فـ } بسبب طيبكم { ادْخُلُوهَا خَالِدِينَ } لأنها الدار الطيبة، ولا يليق بها إلا الطيبون.\nوقال في النار { فُتِحَتْ أَبْوَابُهَا } وفي الجنة { وَفُتِحَتْ } بالواو، إشارة إلى أن أهل النار، بمجرد وصولهم إليها، فتحت لهم أبوابها من غير إنظار ولا إمهال، وليكون فتحها في وجوههم، وعلى وصولهم، أعظم لحرها، وأشد لعذابها.\nوأما الجنة، فإنها الدار العالية الغالية، التي لا يوصل إليها ولا ينالها كل أحد، إلا من أتى بالوسائل الموصلة إليها، ومع ذلك، فيحتاجون لدخولها لشفاعة أكرم الشفعاء عليه، فلم تفتح لهم بمجرد ما وصلوا إليها، بل يستشفعون إلى اللّه بمحمد صلى اللّه عليه وسلم، حتى يشفع، فيشفعه اللّه تعالى.\nوفي الآيات دليل على أن النار والجنة لهما أبواب تفتح وتغلق، وأن لكل منهما خزنة، وهما الداران الخالصتان، اللتان لا يدخل فيهما إلا من استحقهما، بخلاف سائر الأمكنة والدور.\n                                    "
      },
      "originalText": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ إِلَى ٱلۡجَنَّةِ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَا سَلَٰمٌ عَلَيۡكُمۡ طِبۡتُمۡ فَٱدۡخُلُوهَا خَٰلِدِينَ ٣٧"
    },
    {
      "number": 4132,
      "text": "وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ وَأَوْرَثَنَا الْأَرْضَ نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ ۖ فَنِعْمَ أَجْرُ الْعَامِلِينَ",
      "surah": {
        "number": 39,
        "name": "سورة الزمر",
        "englishName": "Az-Zumar",
        "englishNameTranslation": "The Groups",
        "revelationType": "Meccan",
        "numberOfAyahs": 75
      },
      "numberInSurah": 74,
      "juz": 24,
      "manzil": 6,
      "page": 466,
      "ruku": 403,
      "hizbQuarter": 186,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي صَدَقَنَا وَعۡدَهُۥ وَأَوۡرَثَنَا ٱلۡأَرۡضَ نَتَبَوَّأُ مِنَ ٱلۡجَنَّةِ حَيۡثُ نَشَآءُۖ فَنِعۡمَ أَجۡرُ ٱلۡعَٰمِلِينَ ٤٧\n                                    \n                                    \n                                    ( وقالوا الحمد لله الذي صدقنا وعده ) أي : يقول المؤمنون إذا عاينوا في الجنة ذلك الثواب الوافر ، والعطاء العظيم ، والنعيم المقيم ، والملك الكبير ، يقولون عند ذلك : ( الحمد لله الذي صدقنا وعده ) أي : الذي كان وعدنا على ألسنة رسله الكرام ، كما دعوا في الدنيا : ( ربنا وآتنا ما وعدتنا على رسلك ولا تخزنا يوم القيامة إنك لا تخلف الميعاد ) [ آل عمران : 194 ] ، ( وقالوا الحمد لله الذي هدانا لهذا وما كنا لنهتدي لولا أن هدانا الله لقد جاءت رسل ربنا بالحق ) [ الأعراف : 43 ] ، ( وقالوا الحمد لله الذي أذهب عنا الحزن إن ربنا لغفور شكور الذي أحلنا دار المقامة من فضله لا يمسنا فيها نصب ولا يمسنا فيها لغوب ) [ فاطر : 35 ، 34 ] .\nوقولهم : ( وأورثنا الأرض نتبوأ من الجنة حيث نشاء فنعم أجر العاملين ) قال أبو العالية ، وأبو صالح ، وقتادة ، والسدي ، وابن زيد : أي أرض الجنة .\nوهذه الآية كقوله : ( ولقد كتبنا في الزبور من بعد الذكر أن الأرض يرثها عبادي الصالحون ) [ الأنبياء : 105 ] ، ولهذا قالوا : ( نتبوأ من الجنة حيث نشاء ) أي : أين شئنا حللنا ، فنعم الأجر أجرنا على عملنا .\nوفي الصحيحين من حديث الزهري ، عن أنس في قصة المعراج قال النبي - صلى الله عليه وسلم - : \" أدخلت الجنة ، فإذا فيها جنابذ اللؤلؤ ، وإذا ترابها المسك \" .\nوقال عبد بن حميد : حدثنا روح بن عبادة ، حدثنا حماد بن سلمة ، حدثنا الجريري ، عن أبي نضرة ، عن أبي سعيد [ رضي الله عنه ] أن رسول الله - صلى الله عليه وسلم - سأل ابن صائد عن تربة الجنة ؟ فقال : درمكة بيضاء مسك خالص : فقال رسول الله - صلى الله عليه وسلم - : \" صدق \" .\nوكذا رواه مسلم ، من حديث أبي مسلمة ، عن أبي نضرة ، عن أبي سعيد ، به .\nورواه مسلم [ أيضا ] عن أبي بكر بن أبي شيبة ، عن أبي أسامة ، عن الجريري ، عن أبي نضرة ، عن أبي سعيد ; أن ابن صائد سأل رسول الله - صلى الله عليه وسلم - عن تربة الجنة ، فقال : \" درمكة بيضاء مسك خالص \" .\nوقول ابن أبي حاتم : حدثنا أبي ، حدثنا أبو غسان مالك بن إسماعيل ، حدثنا إسرائيل ، عن أبي إسحاق ، عن عاصم بن ضمرة ، عن علي بن أبي طالب - رضي الله عنه - في قوله تعالى : ( وسيق الذين اتقوا ربهم إلى الجنة زمرا ) ، قال : سيقوا حتى انتهوا إلى باب من أبواب الجنة ، فوجدوا عندها شجرة يخرج من تحت ساقها عينان ، فعمدوا إلى إحداهما فتطهروا منها ، فجرت عليهم نضرة النعيم ، فلم تغير أبشارهم بعدها أبدا ، ولم تشعث أشعارهم أبدا بعدها ، كأنما دهنوا بالدهان ، ثم عمدوا إلى الأخرى كأنما أمروا بها ، فشربوا منها ، فأذهبت ما كان في بطونهم من أذى أو قذى ، وتلقتهم الملائكة على أبواب الجنة : ( سلام عليكم طبتم فادخلوها خالدين ) . ويلقى كل غلمان صاحبهم يطيفون به ، فعل الولدان بالحميم جاء من الغيبة : أبشر ، قد أعد الله لك من الكرامة كذا وكذا ، قد أعد الله لك من الكرامة كذا وكذا . وقال : وينطلق غلام من غلمانه إلى أزواجه من الحور العين ، فيقول : هذا فلان - باسمه في الدنيا - فيقلن : أنت رأيته ؟ فيقول : نعم . فيستخفهن الفرح حتى تخرج إلى أسكفة الباب . قال : فيجيء فإذا هو بنمارق مصفوفة ، وأكواب موضوعة ، وزرابي مبثوثة . قال : ثم ينظر إلى تأسيس بنيانه ، فإذا هو قد أسس على جندل اللؤلؤ ، بين أحمر وأخضر وأصفر [ وأبيض ] ، ومن كل لون . ثم يرفع طرفه إلى سقفه ، فلولا أن الله قدره له ، لألم أن يذهب ببصره ، إنه لمثل البرق . ثم ينظر إلى أزواجه من الحور العين ، ثم يتكئ على أريكة من أرائكه ، ثم يقول : ( الحمد لله الذي هدانا لهذا وما كنا لنهتدي لولا أن هدانا الله ) [ الأعراف : 43 ] الآية .\nثم قال : حدثنا ، أبي حدثنا أبو غسان مالك بن إسماعيل النهدي ، حدثنا مسلمة بن جعفر البجلي قال : سمعت أبا معاذ البصري يقول : إن عليا - رضي الله عنه - كان ذات يوم عند رسول الله - صلى الله عليه وسلم - فقال النبي - صلى الله عليه وسلم - : \" والذي نفسي ، بيده إنهم إذا خرجوا من قبورهم يستقبلون - أو : يؤتون - بنوق لها أجنحة ، وعليها رحال الذهب ، شراك نعالهم نور يتلألأ كل خطوة منها مد البصر ، فينتهون إلى شجرة ينبع من أصلها عينان ، فيشربون من إحداهما فيغسل ما في بطونهم من دنس ، ويغتسلون من الأخرى ، فلا تشعث أبشارهم ولا أشعارهم بعدها أبدا ، وتجري عليهم نضرة النعيم ، فينتهون - أو : فيأتون - باب الجنة ، فإذا حلقة من ياقوتة حمراء على صفائح الذهب ، فيضربون بالحلقة على الصفيحة ، فيسمع لها طنين يا علي ، فيبلغ كل حوراء أن زوجها قد أقبل ، فتبعث قيمها فيفتح له ، فإذا رآه خر له - قال مسلمة : أراه قال : ساجدا - فيقول : ارفع رأسك ، فإنما أنا قيمك ، وكلت بأمرك . فيتبعه ويقفو أثره ، فتستخف الحوراء العجلة ، فتخرج من خيام الدر والياقوت حتى تعتنقه ، ثم تقول : أنت حبي ، وأنا حبك ، وأنا الخالدة التي لا أموت ، وأنا الناعمة التي لا أبأس ، وأنا الراضية التي لا أسخط ، وأنا المقيمة التي لا أظعن \" . فيدخل بيتا من أسه إلى سقفه مائة ألف ذراع ، بناؤه على جندل اللؤلؤ ، طرائق أصفر وأخضر وأحمر ، ليس فيها طريق تشاكل صاحبتها ، في البيت سبعون سريرا ، على كل سرير سبعون حشية ، على كل حشية سبعون زوجة ، على كل زوجة سبعون حلة ، يرى مخ ساقها من باطن الحلل ، يقضي جماعها في مقدار ليلة من لياليكم هذه . الأنهار من تحتهم تطرد ، أنهار من ماء غير آسن - قال : صاف ، لا كدر فيه - وأنهار من لبن لم يتغير طعمه - قال : لم يخرج من ضروع الماشية - وأنهار من خمر لذة للشاربين - قال : لم تعصرها الرجال بأقدامهم - وأنهار من عسل مصفى - قال : لم يخرج من بطون النحل . يستجني الثمار ، فإن شاء قائما ، وإن شاء قاعدا ، وإن شاء متكئا - ثم تلا ( ودانية عليهم ظلالها وذللت قطوفها تذليلا ) [ الإنسان : 14 ] - فيشتهي الطعام فيأتيه طير أبيض - قال : وربما قال : أخضر . قال : - فترفع أجنحتها ، فيأكل من جنوبها ، أي الألوان شاء ، ثم يطير فيذهب ، فيدخل الملك فيقول : سلام عليكم ، تلكم الجنة أورثتموها بما كنتم تعملون . ولو أن شعرة من شعر الحوراء وقعت لأهل الأرض ، لأضاءت الشمس معها سوادا في نور \" .\nهذا حديث غريب ، وكأنه مرسل ، والله أعلم .\n                                    ",
        "qortoby": "وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي صَدَقَنَا وَعۡدَهُۥ وَأَوۡرَثَنَا ٱلۡأَرۡضَ نَتَبَوَّأُ مِنَ ٱلۡجَنَّةِ حَيۡثُ نَشَآءُۖ فَنِعۡمَ أَجۡرُ ٱلۡعَٰمِلِينَ ٤٧\n                                    \n                                    \n                                    وقالوا الحمد لله الذي صدقنا وعده أي إذا دخلوا الجنة قالوا هذا . وأورثنا الأرض نتبوأ من الجنة حيث نشاء أي أرض الجنة . قيل : إنهم ورثوا الأرض التي كانت تكون لأهل النار لو كانوا مؤمنين ، قاله أبو العالية وأبو صالح وقتادة والسدي وأكثر المفسرين . وقيل : إنها أرض الدنيا على التقديم والتأخير . فنعم أجر العاملين قيل : هو من قولهم أي : نعم الثواب هذا . وقيل : هو من قول الله تعالى ، أي : نعم ثواب المحسنين هذا الذي أعطيتهم .\n                                    ",
        "saadi": "وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي صَدَقَنَا وَعۡدَهُۥ وَأَوۡرَثَنَا ٱلۡأَرۡضَ نَتَبَوَّأُ مِنَ ٱلۡجَنَّةِ حَيۡثُ نَشَآءُۖ فَنِعۡمَ أَجۡرُ ٱلۡعَٰمِلِينَ ٤٧\n                                        \n                                        \n                                        \n                                        { وَقَالُوا } عند دخولهم فيها واستقرارهم، حامدين ربهم على ما أولاهم ومنَّ عليهم وهداهم: { الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ } أي: وعدنا الجنة على ألسنة رسله، إن آمنا وصلحنا، فوفَّى لنا بما وعدنا، وأنجز لنا ما منَّانا. { وَأَوْرَثَنَا الْأَرْضَ } أي: أرض الجنة { نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ } أي: ننزل منها أي مكان شئنا، ونتناول منها أي نعيم أردنا، ليس ممنوعا عنا شيء نريده. { فَنِعْمَ أَجْرُ الْعَامِلِينَ } الذين اجتهدوا بطاعة ربهم، في زمن قليل منقطع، فنالوا بذلك خيرا عظيما باقيا مستمرا.\nوهذه الدار التي تستحق المدح على الحقيقة، التي يكرم اللّه فيها خواص خلقه،.ورضيها الجواد الكريم لهم نزلا، وبنى أعلاها وأحسنها، وغرسها بيده، وحشاها من رحمته وكرامته ما ببعضه يفرح الحزين، ويزول الكدر، ويتم الصفاء.\n                                    "
      },
      "originalText": "وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي صَدَقَنَا وَعۡدَهُۥ وَأَوۡرَثَنَا ٱلۡأَرۡضَ نَتَبَوَّأُ مِنَ ٱلۡجَنَّةِ حَيۡثُ نَشَآءُۖ فَنِعۡمَ أَجۡرُ ٱلۡعَٰمِلِينَ ٤٧"
    }
  ]
}