{
  "number": 468,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 4141,
      "text": "رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۚ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 8,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 404,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٨\n                                    \n                                    \n                                    ( ربنا وأدخلهم جنات عدن التي وعدتهم ومن صلح من آبائهم وأزواجهم وذرياتهم ) أي : اجمع بينهم وبينهم ، لتقر بذلك أعينهم بالاجتماع في منازل متجاورة ، كما قال [ تعالى ] ( والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء ) [ الطور : 21 ] أي : ساوينا بين الكل في المنزلة ، لتقر أعينهم ، وما نقصنا العالي حتى يساوي الداني ، بل رفعنا الناقص في العمل ، فساويناه بكثير العمل ، تفضلا منا ومنة .\nقال سعيد بن جبير : إن المؤمن إذا دخل الجنة سأل عن أبيه وابنه وأخيه ، وأين هم ؟ فيقال : إنهم لم يبلغوا طبقتك في العمل فيقول : إني إنما عملت لي ولهم . فيلحقون به في الدرجة ، ثم تلا سعيد بن جبير هذه الآية : ( ربنا وأدخلهم جنات عدن التي وعدتهم ومن صلح من آبائهم وأزواجهم وذرياتهم إنك أنت العزيز الحكيم ) .\nقال مطرف بن عبد الله بن الشخير : أنصح عباد الله للمؤمنين الملائكة ، ثم تلا هذه الآية : ( ربنا وأدخلهم جنات عدن التي وعدتهم ) وأغش عباد الله للمؤمنين الشياطين .\nوقوله : ( إنك أنت العزيز الحكيم ) أي : الذي لا يمانع ولا يغالب ، وما شاء كان وما لم يشأ لم يكن ، الحكيم في أقوالك وأفعالك ، من شرعك وقدرك\n                                    ",
        "qortoby": "رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٨\n                                    \n                                    \n                                    قوله تعالى : ربنا وأدخلهم جنات عدن يروى أن عمر بن الخطاب قال لكعب الأحبار : ما جنات عدن ؟ . قال : قصور من ذهب في الجنة يدخلها النبيون والصديقون والشهداء وأئمة العدل . التي وعدتهم التي في محل نصب نعتا للجنات .\nومن صلح من في محل نصب عطفا على الهاء والميم في قوله : وأدخلهم . ومن صلح \" بالإيمان من آبائهم وأزواجهم وذرياتهم وقد مضى في [ الرعد ] نظير هذه الآية . قال سعيد بن جبير : يدخل الرجل الجنة ، فيقول : يا رب أين أبي وجدي وأمي ؟ وأين ولدي وولد ولدي ؟ وأين زوجاتي ؟ فيقال : إنهم لم يعملوا كعملك ، فيقول : يا رب كنت أعمل لي ولهم ، فيقال : أدخلوهم الجنة . ثم تلا : الذين يحملون العرش ومن حوله إلى قوله : ومن صلح من آبائهم وأزواجهم وذرياتهم . ويقرب من هذه الآية قوله : والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم .\n                                    ",
        "saadi": "رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٨\n                                        \n                                        \n                                        \n                                        { رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ } على ألسنة رسلك { وَمَنْ صَلَحَ } أي: صلح بالإيمان والعمل الصالح { مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ } زوجاتهم وأزواجهن وأصحابهم ورفقائهم { وَذُرِّيَّاتِهِمْ } { إِنَّكَ أَنْتَ الْعَزِيزُ } القاهر لكل شيء، فبعزتك تغفر ذنوبهم، وتكشف عنهم المحذور، وتوصلهم بها إلى كل خير { الْحَكِيمُ } الذي يضع الأشياء مواضعها، فلا نسألك يا ربنا أمرا تقتضي حكمتك خلافه، بل من حكمتك التي أخبرت بها على ألسنة رسلك، واقتضاها فضلك، المغفرة للمؤمنين.\n                                    "
      },
      "originalText": "رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٨"
    },
    {
      "number": 4142,
      "text": "وَقِهِمُ السَّيِّئَاتِ ۚ وَمَنْ تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 9,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 404,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقِهِمُ ٱلسَّيِّ‍َٔاتِۚ وَمَن تَقِ ٱلسَّيِّ‍َٔاتِ يَوۡمَئِذٖ فَقَدۡ رَحِمۡتَهُۥۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٩\n                                    \n                                    \n                                    ( وقهم السيئات ) أي : فعلها أو وبالها ممن وقعت منه ، ( ومن تق السيئات يومئذ ) أي : يوم القيامة ، ( فقد رحمته ) أي : لطفت به ونجيته من العقوبة ، ( وذلك هو الفوز العظيم ) .\n                                    ",
        "qortoby": "وَقِهِمُ ٱلسَّيِّ‍َٔاتِۚ وَمَن تَقِ ٱلسَّيِّ‍َٔاتِ يَوۡمَئِذٖ فَقَدۡ رَحِمۡتَهُۥۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٩\n                                    \n                                    \n                                    قوله تعالى : وقهم السيئات قال قتادة : أي : وقهم ما يسوءهم ، وقيل : التقدير وقهم عذاب السيئات ، وهو أمر من : وقاه الله يقيه وقاية بالكسر ، أي : حفظه . ومن تق السيئات يومئذ فقد رحمته أي بدخول الجنة\nوذلك هو الفوز العظيم أي النجاة الكبيرة .\n                                    ",
        "saadi": "وَقِهِمُ ٱلسَّيِّ‍َٔاتِۚ وَمَن تَقِ ٱلسَّيِّ‍َٔاتِ يَوۡمَئِذٖ فَقَدۡ رَحِمۡتَهُۥۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٩\n                                        \n                                        \n                                        \n                                        { وَقِهِمُ السَّيِّئَاتِ } أي: الأعمال السيئة وجزاءها، لأنها تسوء صاحبها. { وَمَنْ تَقِ السَّيِّئَاتِ يَوْمَئِذٍ } أي: يوم القيامة { فَقَدْ رَحِمْتَهُ } لأن رحمتك لم تزل مستمرة على العباد، لا يمنعها إلا ذنوب العباد وسيئاتهم، فمن وقيته السيئات وفقته للحسنات وجزائها الحسن. { وَذَلِكَ } أي: زوال المحذور بوقاية السيئات، وحصول المحبوب بحصول الرحمة، { هُوَ الْفَوْزُ الْعَظِيمُ } الذي لا فوز مثله، ولا يتنافس المتنافسون بأحسن منه.\nوقد تضمن هذا الدعاء من الملائكة كمال معرفتهم بربهم، والتوسل إلى الله بأسمائه الحسنى، التي يحب من عباده التوسل بها إليه، والدعاء بما يناسب ما دعوا الله فيه، فلما كان دعاؤهم بحصول الرحمة، وإزالة أثر ما اقتضته النفوس البشرية التي علم الله نقصها واقتضاءها لما اقتضته من المعاصي، ونحو ذلك من المبادئ والأسباب التي قد أحاط الله بها علمًا توسلوا بالرحيم العليم.\nوتضمن كمال أدبهم مع الله تعالى بإقرارهم بربوبيته لهم الربوبية العامة والخاصة، وأنه ليس لهم من الأمر شيء وإنما دعاؤهم لربهم صدر من فقير بالذات من جميع الوجوه، لا يُدْلِي على ربه بحالة من الأحوال، إن هو إلا فضل الله وكرمه وإحسانه.\nوتضمن موافقتهم لربهم تمام الموافقة، بمحبة ما يحبه من الأعمال التي هي العبادات التي قاموا بها، واجتهدوا اجتهاد المحبين، ومن العمال الذين هم المؤمنون الذين يحبهم الله تعالى من بين خلقه، فسائر الخلق المكلفين يبغضهم الله إلا المؤمنين منهم، فمن محبة الملائكة لهم دعوا الله، واجتهدوا في صلاح أحوالهم، لأن الدعاء للشخص من أدل الدلائل على محبته، لأنه لا يدعو إلا لمن يحبه.\nوتضمن ما شرحه الله وفصله من دعائهم بعد قوله: { وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا } التنبيه اللطيف على كيفية تدبر كتابه، وأن لا يكون المتدبر مقتصرًا على مجرد معنى اللفظ بمفرده، بل ينبغي له أن يتدبر معنى اللفظ، فإذا فهمه فهمًا صحيحًا على وجهه، نظر بعقله إلى ذلك الأمر والطرق الموصلة إليه وما لا يتم إلا به وما يتوقف عليه، وجزم بأن الله أراده، كما يجزم أنه أراد المعنى الخاص، الدال عليه اللفظ.\nوالذي يوجب له الجزم بأن الله أراده أمران:\nأحدهما: معرفته وجزمه بأنه من توابع المعنى والمتوقف عليه.\nوالثاني: علمه بأن الله بكل شيء عليم، وأن الله أمر عباده بالتدبر والتفكر في كتابه.\nوقد علم تعالى ما يلزم من تلك المعاني. وهو المخبر بأن كتابه هدى ونور وتبيان لكل شيء، وأنه أفصح الكلام وأجله إيضاحًا، فبذلك يحصل للعبد من العلم العظيم والخير الكثير، بحسب ما وفقه الله له وقد كان في تفسيرنا هذا، كثير من هذا من به الله علينا.\nوقد يخفى في بعض الآيات مأخذه على غير المتأمل صحيح الفكرة، ونسأله تعالى أن يفتح علينا من خزائن رحمته ما يكون سببًا لصلاح أحوالنا وأحوال المسلمين، فليس لنا إلا التعلق بكرمه، والتوسل بإحسانه، الذي لا نزال نتقلب فيه في كل الآنات، وفي جميع اللحظات، ونسأله من فضله، أن يقينا شر أنفسنا المانع والمعوق لوصول رحمته، إنه الكريم الوهاب، الذي تفضل بالأسباب ومسبباتها.\nوتضمن ذلك، أن المقارن من زوج وولد وصاحب، يسعد بقرينه، ويكون اتصاله به سببًا لخير يحصل له، خارج عن عمله وسبب عمله كما كانت الملائكة تدعو للمؤمنين ولمن صلح من آبائهم وأزواجهم وذرياتهم، وقد يقال: إنه لا بد من وجود صلاحهم لقوله: { وَمَنْ صَلَحَ } فحينئذ يكون ذلك من نتيجة عملهم والله أعلم.\n                                    "
      },
      "originalText": "وَقِهِمُ ٱلسَّيِّ‍َٔاتِۚ وَمَن تَقِ ٱلسَّيِّ‍َٔاتِ يَوۡمَئِذٖ فَقَدۡ رَحِمۡتَهُۥۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٩"
    },
    {
      "number": 4143,
      "text": "إِنَّ الَّذِينَ كَفَرُوا يُنَادَوْنَ لَمَقْتُ اللَّهِ أَكْبَرُ مِنْ مَقْتِكُمْ أَنْفُسَكُمْ إِذْ تُدْعَوْنَ إِلَى الْإِيمَانِ فَتَكْفُرُونَ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 10,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 405,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ كَفَرُواْ يُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِيمَٰنِ فَتَكۡفُرُونَ ٠١\n                                    \n                                    \n                                    يقول تعالى مخبرا عن الكفار : أنهم ينادون يوم القيامة وهم في غمرات النيران يتلظون ، وذلك عندما باشروا من عذاب الله ما لا قبل لأحد به ، فمقتوا عند ذلك أنفسهم وأبغضوها غاية البغض ، بسبب ما أسلفوا من الأعمال السيئة ، التي كانت سبب دخولهم إلى النار ، فأخبرتهم الملائكة عند ذلك إخبارا عاليا ، نادوهم [ به ] نداء بأن مقت الله لهم في الدنيا حين كان يعرض عليهم الإيمان ، فيكفرون ، أشد من مقتكم أيها المعذبون أنفسكم اليوم في هذه الحالة .\nقال قتادة في قوله : ( لمقت الله أكبر من مقتكم أنفسكم إذ تدعون إلى الإيمان فتكفرون ) يقول : لمقت الله أهل الضلالة حين عرض عليهم الإيمان في الدنيا ، فتركوه وأبوا أن يقبلوه ، أكبر مما مقتوا أنفسهم حين عاينوا عذاب الله يوم القيامة .\nوهكذا قال الحسن البصري ومجاهد والسدي وذر بن عبد الله الهمداني ، وعبد الرحمن بن زيد بن أسلم ، وابن جرير الطبري ، رحمهم الله .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ كَفَرُواْ يُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِيمَٰنِ فَتَكۡفُرُونَ ٠١\n                                    \n                                    \n                                    قوله تعالى : إن الذين كفروا ينادون لمقت الله أكبر من مقتكم أنفسكم قال الأخفش : \" لمقت \" هذه لام الابتداء وقعت بعد ينادون لأن معناه : يقال لهم ، والنداء قول . وقال غيره : المعنى : يقال لهم : لمقت الله إياكم في الدنيا إذ تدعون إلى الإيمان فتكفرون أكبر من مقتكم أنفسكم اليوم . وقال معناه مجاهد . وقال قتادة : المعنى لمقت الله لكم إذ تدعون إلى الإيمان فتكفرون أكبر من مقتكم أنفسكم إذ عاينتم النار . فإن قيل : كيف يصح أن يمقتوا أنفسهم ؟ ففيه وجهان : أحدهما : أنهم أحلوها بالذنوب محل الممقوت . الثاني : أنهم لما صاروا إلى حال زال عنهم الهوى ، وعلموا أن نفوسهم هي التي أبقتهم في المعاصي مقتوها . وقال محمد بن كعب القرظي : إن أهل النار لما يئسوا مما عند الخزنة وقال لهم مالك : إنكم ماكثون على ما يأتي . قال بعضهم لبعض : يا هؤلاء إنه قد نزل بكم من العذاب والبلاء ما قد ترون ، فهلم فلنصبر فلعل الصبر ينفعنا ، كما صبر أهل الطاعة على طاعة الله فنفعهم الصبر إذ صبروا ، فأجمعوا رأيهم على الصبر فصبروا فطال صبرهم ، ثم جزعوا فنادوا سواء علينا أجزعنا أم صبرنا ما لنا من محيص أي : من ملجأ ، فقال إبليس عند ذلك : إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلى قوله : ما أنا بمصرخكم وما أنتم بمصرخي يقول : بمغن عنكم شيئا إني كفرت بما أشركتمون من قبل فلما سمعوا مقالته مقتوا أنفسهم . قال : فنودوا لمقت الله أكبر من مقتكم أنفسكم إذ تدعون إلى الإيمان فتكفرون إلى قوله : فهل إلى خروج من سبيل قال فرد عليهم : ذلكم بأنه إذا دعي الله وحده كفرتم وإن يشرك به تؤمنوا فالحكم لله العلي الكبير ذكره ابن المبارك .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ كَفَرُواْ يُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِيمَٰنِ فَتَكۡفُرُونَ ٠١\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن الفضيحة والخزي الذي يصيب الكافرين، وسؤالهم الرجعة، والخروج من النار، وامتناع ذلك عليهم وتوبيخهم، فقال: { إِنَّ الَّذِينَ كَفَرُوا } أطلقه ليشمل أنواع الكفر كلها، من الكفر بالله، أو بكتبه، أو برسله، أو باليوم الآخر، حين يدخلون النار، ويقرون أنهم مستحقونها، لما فعلوه من الذنوب والأوزار، فيمقتون أنفسهم لذلك أشد المقت، ويغضبون عليها غاية الغضب، فينادون عند ذلك، ويقال لهم: { لَمَقْتُ اللَّهِ } أي: إياكم { إِذْ تُدْعَوْنَ إِلَى الْإِيمَانِ فَتَكْفُرُونَ } أي: حين دعتكم الرسل وأتباعهم إلى الإيمان، وأقاموا لكم من البينات ما تبين به الحق، فكفرتم وزهدتم في الإيمان الذي خلقكم الله له، وخرجتم من رحمته الواسعة، فمقتكم وأبغضكم، فهذا { أَكْبَرُ مِنْ مَقْتِكُمْ أَنْفُسَكُمْ } أي: فلم يزل هذا المقت مستمرًا عليكم، والسخط من الكريم حَالَّا بكم، حتى آلت بكم الحال إلى ما آلت، فاليوم حلَّ عليكم غضب الله وعقابه حين نال المؤمنون رضوان الله وثوابه.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ كَفَرُواْ يُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِيمَٰنِ فَتَكۡفُرُونَ ٠١"
    },
    {
      "number": 4144,
      "text": "قَالُوا رَبَّنَا أَمَتَّنَا اثْنَتَيْنِ وَأَحْيَيْتَنَا اثْنَتَيْنِ فَاعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَىٰ خُرُوجٍ مِنْ سَبِيلٍ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 11,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 405,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ ١١\n                                    \n                                    \n                                    وقوله : ( قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين ) قال الثوري ، عن أبي إسحاق ، عن أبي الأحوص ، عن ابن مسعود [ رضي الله عنه ] : هذه الآية كقوله تعالى : ( كيف تكفرون بالله وكنتم أمواتا فأحياكم ثم يميتكم ثم يحييكم ثم إليه ترجعون ) [ البقرة : 28 ] وكذا قال ابن عباس ، والضحاك ، وقتادة ، وأبو مالك . وهذا هو الصواب الذي لا شك فيه ولا مرية .\nوقال السدي : أميتوا في الدنيا ثم أحيوا في قبورهم فخوطبوا ، ثم أميتوا ثم أحيوا يوم القيامة .\nوقال ابن زيد : أحيوا حين أخذ عليهم الميثاق من صلب آدم ، ثم خلقهم في الأرحام ثم أماتهم [ ثم أحياهم ] يوم القيامة .\nوهذان القولان - من السدي وابن زيد - ضعيفان ; لأنه يلزمهما على ما قالا ثلاث إحياءات وإماتات . والصحيح قول ابن مسعود وابن عباس ومن تابعهما . والمقصود من هذا كله : أن الكفار يسألون الرجعة وهم وقوف بين يدي الله - عز وجل - في عرصات القيامة ، كما قال : ( ولو ترى إذ المجرمون ناكسو رءوسهم عند ربهم ربنا أبصرنا وسمعنا فارجعنا نعمل صالحا إنا موقنون ) [ السجدة : 12 ] ، فلا يجابون . ثم إذا رأوا النار وعاينوها ووقفوا عليها ، ونظروا إلى ما فيها من العذاب والنكال ، سألوا الرجعة أشد مما سألوا أول مرة ، فلا يجابون ، قال الله تعالى : ( ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين بل بدا لهم ما كانوا يخفون من قبل ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون ) [ الأنعام : 27 ، 28 ] فإذا دخلوا النار وذاقوا مسها وحسيسها ومقامعها وأغلالها ، كان سؤالهم للرجعة أشد وأعظم ، ( وهم يصطرخون فيها ربنا أخرجنا نعمل صالحا غير الذي كنا نعمل أولم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير فذوقوا فما للظالمين من نصير ) [ فاطر : 37 ] ، ( ربنا أخرجنا منها فإن عدنا فإنا ظالمون . قال اخسئوا فيها ولا تكلمون ) [ المؤمنون : 107 ، 108 ] ، وفي هذه الآية الكريمة تلطفوا في السؤال ، وقدموا بين يدي كلامهم مقدمة ، وهي قولهم : ( ربنا أمتنا اثنتين وأحييتنا اثنتين ) أي : قدرتك عظيمة ، فإنك أحييتنا بعد ما كنا أمواتا ، ثم أمتنا ثم أحييتنا ، فأنت قادر على ما تشاء ، وقد اعترفنا بذنوبنا ، وإننا كنا ظالمين لأنفسنا في الدار الدنيا ، ( فهل إلى خروج من سبيل ) أي فهل أنت مجيبنا إلى أن تعيدنا إلى الدار الدنيا ؟ فإنك قادر على ذلك ; لنعمل غير الذي كنا نعمل ، فإن عدنا إلى ما كنا فيه فإنا ظالمون . فأجيبوا ألا سبيل إلى عودكم ومرجعكم إلى الدار الدنيا . ثم علل المنع من ذلك بأن سجاياكم لا تقبل الحق ولا تقتضيه بل تجحده وتنفيه ; ولهذا قال تعالى :\n                                    ",
        "qortoby": "قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ ١١\n                                    \n                                    \n                                    قوله تعالى : قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين اختلف أهل التأويل في معنى قولهم : أمتنا اثنتين وأحييتنا اثنتين فقال ابن مسعود وابن عباس وقتادة والضحاك : كانوا أمواتا في أصلاب آبائهم ، ثم أحياهم ثم أماتهم الموتة التي لا بد منها في الدنيا ، ثم أحياهم للبعث والقيامة ، فهاتان حياتان وموتتان ، وهو قوله تعالى : كيف تكفرون بالله وكنتم أمواتا فأحياكم ثم يميتكم ثم يحييكم وقال السدي : أميتوا في الدنيا ثم أحياهم في القبور للمسألة ، ثم أميتوا ثم أحيوا في الآخرة . وإنما صار إلى هذا ; لأن لفظ الميت لا ينطلق في العرف على النطفة . واستدل العلماء من هذا فيإثبات سؤال القبر ، ولو كان الثواب والعقاب للروح دون الجسد فما معنى الإحياء والإماتة ؟ والروح عند من يقصر أحكام الآخرة على الأرواح لا تموت ولا تتغير ولا تفسد ، وهو حي لنفسه لا يتطرق إليه موت ولا غشية ولا فناء . وقال ابن زيد في قوله : ربنا أمتنا اثنتين . . . الآية قال : خلقهم في ظهر آدم وأخرجهم وأحياهم وأخذ عليهم الميثاق ، ثم أماتهم ثم أحياهم في الدنيا ثم أماتهم . وقد مضى هذا في [ البقرة ] .\nفاعترفنا بذنوبنا اعترفوا حيث لا ينفعهم الاعتراف ، وندموا حيث لا ينفعهم الندم . فهل إلى خروج من سبيل أي هل نرد إلى الدنيا لنعمل بطاعتك ، نظيره : هل إلى مرد من سبيل وقوله : فارجعنا نعمل صالحا وقوله : يا ليتنا نرد الآية .\n                                    ",
        "saadi": "قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ ١١\n                                        \n                                        \n                                        \n                                        فتمنوا الرجوع و { قَالُوا رَبَّنَا أَمَتَّنَا اثْنَتَيْنِ } يريدون الموتة الأولى وما بين النفختين على ما قيل أو العدم المحض قبل إيجادهم، ثم أماتهم بعدما أوجدهم، { وَأَحْيَيْتَنَا اثْنَتَيْنِ } الحياة الدنيا والحياة الأخرى، { فَاعْتَرَفْنَا بِذُنُوبِنَا فَهَلْ إِلَى خُرُوجٍ مِنْ سَبِيلٍ } أي: تحسروا وقالوا ذلك، فلم يفد ولم ينجع، ووبخوا على عدم فعل أسباب النجاة.\n                                    "
      },
      "originalText": "قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ ١١"
    },
    {
      "number": 4145,
      "text": "ذَٰلِكُمْ بِأَنَّهُ إِذَا دُعِيَ اللَّهُ وَحْدَهُ كَفَرْتُمْ ۖ وَإِنْ يُشْرَكْ بِهِ تُؤْمِنُوا ۚ فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 12,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 405,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِيَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن يُشۡرَكۡ بِهِۦ تُؤۡمِنُواْۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِيِّ ٱلۡكَبِيرِ ٢١\n                                    \n                                    \n                                    ( ذلكم بأنه إذا دعي الله وحده كفرتم وإن يشرك به تؤمنوا ) أي : أنتم هكذا تكونون ، وإن رددتم إلى الدنيا ، كما قال تعالى : ( ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون ) [ الأنعام : 28 ] .\nوقوله : ( فالحكم لله العلي الكبير ) أي : هو الحاكم في خلقه ، العادل الذي لا يجور ، فيهدي من يشاء ، ويضل من يشاء ، ويرحم من يشاء ، ويعذب من يشاء ، لا إله إلا هو .\n                                    ",
        "qortoby": "ذَٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِيَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن يُشۡرَكۡ بِهِۦ تُؤۡمِنُواْۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِيِّ ٱلۡكَبِيرِ ٢١\n                                    \n                                    \n                                    قوله تعالى : ذلكم بأنه إذا دعي الله وحده كفرتم ذلكم في موضع رفع أي : الأمر ذلكم أو ذلكم العذاب الذي أنتم فيه بكفركم . وفي الكلام متروك تقديره : فأجيبوا بأن لا سبيل إلى الرد . وذلك لأنكم إذا دعي الله أي : وحد الله وحده كفرتم وأنكرتم أن تكون الألوهية له خاصة ، وإن أشرك به مشرك صدقتموه وآمنتم بقوله . قال الثعلبي : وسمعت بعض العلماء يقول : وإن يشرك به بعد الرد إلى الدنيا لو كان به تؤمنوا تصدقوا المشرك ، نظيره : \" ولو ردوا لعادوا لما نهوا عنه \" . فالحكم لله العلي الكبير عن أن تكون له صاحبة أو ولد .\n                                    ",
        "saadi": "ذَٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِيَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن يُشۡرَكۡ بِهِۦ تُؤۡمِنُواْۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِيِّ ٱلۡكَبِيرِ ٢١\n                                        \n                                        \n                                        \n                                        { ذَلِكُمْ بِأَنَّهُ إِذَا دُعِيَ اللَّهُ وَحْدَهُ } أي: إذا دعي لتوحيده، وإخلاص العمل له، ونهي عن الشرك به { كَفَرْتُمْ } به واشمأزت لذلك قلوبكم ونفرتم غاية النفور.\n{ وَإِنْ يُشْرَكْ بِهِ تُؤْمِنُوا } أي: هذا الذي أنزلكم هذ المنزل وبوأكم هذا المقيل والمحل، أنكم تكفرون بالإيمان، وتؤمنون بالكفر، ترضون بما هو شر وفساد في الدنيا والآخرة، وتكرهون ما هو خير وصلاح في الدنيا والآخرة.\nتؤثرون سبب الشقاوة والذل والغضب وتزهدون بما هو سبب الفوز والفلاح والظفر { وَإِنْ يَرَوْا سَبِيلَ الرُّشْدِ لَا يَتَّخِذُوهُ سَبِيلًا وَإِنْ يَرَوْا سَبِيلَ الْغَيِّ يَتَّخِذُوهُ سَبِيلًا }\n{ فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ } العلي: الذي له العلو المطلق من جميع الوجوه، علو الذات، وعلو القدر، وعلو القهر ومن علو قدره، كمال عدله تعالى، وأنه يضع الأشياء مواضعها، ولا يساوي بين المتقين والفجار.\n{ الْكَبِيرُ } الذي له الكبرياء والعظمة والمجد، في أسمائه وصفاته وأفعاله المتنزه عن كل آفة وعيب ونقص، فإذا كان الحكم له تعالى، وقد حكم عليكم بالخلود الدائم، فحكمه لا يغير ولا يبدل.\n                                    "
      },
      "originalText": "ذَٰلِكُم بِأَنَّهُۥٓ إِذَا دُعِيَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن يُشۡرَكۡ بِهِۦ تُؤۡمِنُواْۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِيِّ ٱلۡكَبِيرِ ٢١"
    },
    {
      "number": 4146,
      "text": "هُوَ الَّذِي يُرِيكُمْ آيَاتِهِ وَيُنَزِّلُ لَكُمْ مِنَ السَّمَاءِ رِزْقًا ۚ وَمَا يَتَذَكَّرُ إِلَّا مَنْ يُنِيبُ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 13,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 405,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱلَّذِي يُرِيكُمۡ ءَايَٰتِهِۦ وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ رِزۡقٗاۚ وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ ٣١\n                                    \n                                    \n                                    وقوله : ( هو الذي يريكم آياته ) أي : يظهر قدرته لخلقه بما يشاهدونه في خلقه العلوي والسفلي من الآيات العظيمة الدالة على كمال خالقها ومبدعها ومنشئها ، ( وينزل لكم من السماء رزقا ) ، وهو المطر الذي يخرج به من الزروع والثمار ما هو مشاهد بالحس ، من اختلاف ألوانه وطعومه ، وروائحه وأشكاله وألوانه ، وهو ماء واحد ، فبالقدرة العظيمة فاوت بين هذه الأشياء ، ( وما يتذكر ) أي : يعتبر ويتفكر في هذه الأشياء ويستدل بها على عظمة خالقها ( إلا من ينيب ) أي : من هو بصير منيب إلى الله - عز وجل - .\n                                    ",
        "qortoby": "هُوَ ٱلَّذِي يُرِيكُمۡ ءَايَٰتِهِۦ وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ رِزۡقٗاۚ وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ ٣١\n                                    \n                                    \n                                    قوله تعالى : هو الذي يريكم آياته أي دلائل توحيده وقدرته وينزل لكم من السماء رزقا جمع بين إظهار الآيات وإنزال الرزق ; لأن بالآيات قوام الأديان ، وبالرزق قوام الأبدان . وهذه الآيات هي السماوات والأرضون وما فيهما وما بينهما من الشمس والقمر والنجوم والرياح والسحاب والبحار والأنهار والعيون والجبال والأشجار وآثار قوم هلكوا .\nوما يتذكر أي ما يتعظ بهذه الآيات فيوحد الله إلا من ينيب أي يرجع إلى طاعة الله .\n                                    ",
        "saadi": "هُوَ ٱلَّذِي يُرِيكُمۡ ءَايَٰتِهِۦ وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ رِزۡقٗاۚ وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ ٣١\n                                        \n                                        \n                                        \n                                        يذكر تعالى نعمه العظيمة على عباده، بتبيين الحق من الباطل، بما يُرِي عباده من آياته النفسية والآفاقية والقرآنية، الدالة على كل مطلوب مقصود، الموضحة للهدى من الضلال، بحيث لا يبقى عند الناظر فيها والمتأمل لها أدنى شك في معرفة الحقائق، وهذا من أكبر نعمه على عباده، حيث لم يُبْقِ الحق مشتبهًا ولا الصواب ملتبسًا، بل نوَّع الدلالات ووضح الآيات، ليهلك من هلك عن بينة، ويحيا من حي عن بينة وكلما كانت المسائل أجل وأكبر، كانت الدلائل عليها أكثر وأيسر، فانظر إلى التوحيد لما كانت مسألته من أكبر المسائل، بل أكبرها، كثرت الأدلة عليها العقلية والنقلية وتنوعت، وضرب الله لها الأمثال وأكثر لها من الاستدلال، ولهذا ذكرها في هذا الموضع، ونبه على جملة من أدلتها فقال: { فَادْعُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ }\nولما ذكر أنه يُرِي عباده آياته، نبه على آية عظيمة فقال: { وينزل لكم من السماء رزقا } أي: مطرًا به ترزقون وتعيشون أنتم وبهائمكم، وذلك يدل على أن النعم كلها منه، فمنه نعم الدين، وهي المسائل الدينية والأدلة عليها، وما يتبع ذلك من العمل بها. والنعم الدنيوية كلها، كالنعم الناشئة عن الغيث، الذي تحيا به البلاد والعباد. وهذا يدل دلالة قاطعة أنه وحده هو المعبود، الذي يتعين إخلاص الدين له، كما أنه -وحده- المنعم.\n{ وَمَا يَتَذَكَّرُ } بالآيات حين يذكر بها { إِلَّا مَنْ يُنِيبُ } إلى الله تعالى، بالإقبال على محبته وخشيته وطاعته والتضرع إليه، فهذا الذي ينتفع بالآيات، وتصير رحمة في حقه، ويزداد بها بصيرة.\n                                    "
      },
      "originalText": "هُوَ ٱلَّذِي يُرِيكُمۡ ءَايَٰتِهِۦ وَيُنَزِّلُ لَكُم مِّنَ ٱلسَّمَآءِ رِزۡقٗاۚ وَمَا يَتَذَكَّرُ إِلَّا مَن يُنِيبُ ٣١"
    },
    {
      "number": 4147,
      "text": "فَادْعُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 14,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 405,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَٱدۡعُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ ٤١\n                                    \n                                    \n                                    وقوله : ( فادعوا الله مخلصين له الدين ولو كره الكافرون ) أي : فأخلصوا لله وحده العبادة والدعاء ، وخالفوا المشركين في مسلكهم ومذهبهم .\nقال الإمام أحمد : حدثنا عبد الله بن نمير ، حدثنا هشام - يعني ابن عروة بن الزبير - عن أبي الزبير محمد بن مسلم بن تدرس المكي قال : كان عبد الله بن الزبير يقول في دبر كل صلاة حين يسلم : لا إله إلا الله ، وحده لا شريك له ، له الملك وله الحمد ، وهو على كل شيء قدير ، لا حول ولا قوة إلا بالله ، لا إله إلا الله ، ولا نعبد إلا إياه ، له النعمة وله الفضل ، وله الثناء الحسن ، لا إله إلا الله ، مخلصين له الدين ولو كره الكافرون \" قال : وكان رسول الله - صلى الله عليه وسلم - يهلل بهن دبر كل صلاة .\nورواه مسلم وأبو داود والنسائي ، من طرق ، عن هشام بن عروة ، وحجاج بن أبي عثمان ، وموسى بن عقبة ، ثلاثتهم عن أبي الزبير ، عن عبد الله بن الزبير قال : كان رسول الله - صلى الله عليه وسلم - يقول في دبر الصلاة : \" لا إله إلا الله وحده لا شريك له وذكر تمامه .\nوقد ثبت في الصحيح عن ابن الزبير ; أن رسول الله - صلى الله عليه وسلم - كان يقول عقب الصلوات المكتوبات : \" لا إله إلا الله ، وحده لا شريك له ، له الملك وله الحمد ، وهو على كل شيء قدير . لا حول ولا قوة إلا بالله ، لا إله إلا الله ولا نعبد إلا إياه ، له النعمة وله الفضل ، وله الثناء الحسن ، لا إله إلا الله مخلصين له الدين ولو كره الكافرون \" .\nوقال ابن أبي حاتم : حدثنا الربيع حدثنا الخصيب بن ناصح ، حدثنا صالح - يعني المري - عن هشام بن حسان ، عن ابن سيرين عن أبي هريرة - رضي الله عنه - عن النبي - صلى الله عليه وسلم - قال : \" ادعوا الله وأنتم موقنون بالإجابة ، واعلموا أن الله لا يستجيب دعاء من قلب غافل لاه \" .\n                                    ",
        "qortoby": "فَٱدۡعُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ ٤١\n                                    \n                                    \n                                    فادعوا الله أي اعبدوه مخلصين له الدين أي العبادة . وقيل : الطاعة . ولو كره الكافرون عبادة الله فلا تعبدوا أنتم غيره .\n                                    ",
        "saadi": "فَٱدۡعُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ ٤١\n                                        \n                                        \n                                        \n                                        ولما كانت الآيات تثمر التذكر، والتذكر يوجب الإخلاص للّه، رتب الأمر على ذلك بالفاء الدالة على السببية فقال: { فَادْعُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ } وهذا شامل لدعاء العبادة ودعاء المسألة، والإخلاص معناه: تخليص القصد للّه تعالى في جميع العبادات الواجبه والمستحبة، حقوق الله وحقوق عباده. أي: أخلصوا للّه تعالى في كل ما تدينونه به وتتقربون به إليه.\n{ وَلَوْ كَرِهَ الْكَافِرُونَ } لذلك، فلا تبالوا بهم، ولا يثنكم ذلك عن دينكم، ولا تأخذكم بالله لومة لائم، فإن الكافرين يكرهون الإخلاص لله وحده غاية الكراهة، كما قال تعالى: { وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ وَإِذَا ذُكِرَ الَّذِينَ مِنْ دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ }\n                                    "
      },
      "originalText": "فَٱدۡعُواْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ ٤١"
    },
    {
      "number": 4148,
      "text": "رَفِيعُ الدَّرَجَاتِ ذُو الْعَرْشِ يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ لِيُنْذِرَ يَوْمَ التَّلَاقِ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 15,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 405,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَفِيعُ ٱلدَّرَجَٰتِ ذُو ٱلۡعَرۡشِ يُلۡقِي ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦ لِيُنذِرَ يَوۡمَ ٱلتَّلَاقِ ٥١\n                                    \n                                    \n                                    يقول تعالى [ مخبرا ] عن عظمته وكبريائه ، وارتفاع عرشه العظيم العالي على جميع مخلوقاته كالسقف لها ، كما قال تعالى : ( من الله ذي المعارج تعرج الملائكة والروح إليه في يوم كان مقداره خمسين ألف سنة [ فاصبر ] ) [ المعارج : 3 ، 4 ] ، وسيأتي بيان أن هذه مسافة ما بين العرش إلى الأرض السابعة ، في قول جماعة من السلف والخلف ، وهو الأرجح إن شاء الله [ تعالى ] . وقد ذكر غير واحد أن العرش من ياقوتة حمراء ، اتساع ما بين قطريه مسيرة خمسين ألف سنة . وارتفاعه عن الأرض السابعة مسيرة خمسين ألف سنة . وقد تقدم في حديث \" الأوعال \" ما يدل على ارتفاعه عن السماوات السبع بشيء عظيم .\nوقوله : ( يلقي الروح من أمره على من يشاء من عباده ) كقوله تعالى : ( ينزل الملائكة بالروح من أمره على من يشاء من عباده أن أنذروا أنه لا إله إلا أنا [ فاتقون ] ) [ النحل : 2 ] ، وكقوله : ( وإنه لتنزيل رب العالمين . نزل به الروح الأمين . على قلبك لتكون من المنذرين . [ بلسان عربي مبين ] ) [ الشعراء : 192 - 194 ] ; ولهذا قال : ( لينذر يوم التلاق ) قال علي بن أبي طلحة ، عن ابن عباس : ( يوم التلاق ) اسم من أسماء يوم القيامة ، حذر منه عباده .\nوقال ابن جريج : قال ابن عباس : يلتقي فيه آدم وآخر ولده .\nوقال ابن زيد : يلتقي فيه العباد .\nوقال قتادة ، والسدي ، وبلال بن سعد ، وسفيان بن عيينة : يلتقي فيه أهل السماء وأهل الأرض .\nوقال قتادة أيضا : يلتقي فيه أهل السماء وأهل الأرض ، والخالق والخلق .\nوقال ميمون بن مهران : يلتقي [ فيه ] الظالم والمظلوم .\nوقد يقال : إن يوم القيامة هو يشمل هذا كله ، ويشمل أن كل عامل سيلقى ما عمل من خير وشر . كما قاله آخرون .\n                                    ",
        "qortoby": "رَفِيعُ ٱلدَّرَجَٰتِ ذُو ٱلۡعَرۡشِ يُلۡقِي ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦ لِيُنذِرَ يَوۡمَ ٱلتَّلَاقِ ٥١\n                                    \n                                    \n                                    قوله تعالى : رفيع الدرجات ذو العرش ذو العرش على إضمار مبتدأ . قال الأخفش : ويجوز نصبه على المدح . ومعنى رفيع الدرجات أي : رفيع الصفات . وقال ابن عباس والكلبي وسعيد بن جبير : رفيع السماوات السبع . وقال يحيى بن سلام : هو رفعة درجة أوليائه في الجنة ف \" رفيع \" على هذا بمعنى رافع فعيل بمعنى فاعل . وهو على القول الأول من صفات الذات ، ومعناه الذي لا أرفع قدرا منه ، وهو المستحق لدرجات المدح والثناء ، وهي أصنافها وأبوابها لا مستحق لها غيره . قاله الحليمي . وقد ذكرناه في الكتاب الأسنى في شرح أسماء الله الحسنى والحمد لله . ذو العرش أي : خالقه ومالكه لا أنه محتاج إليه . وقيل : هو من قولهم : ثل عرش فلان أي : زال ملكه وعزه ، فهو سبحانه ذو العرش بمعنى ثبوت ملكه وسلطانه ، وقد بيناه في الأسنى في شرح أسماء الله الحسنى .\nيلقي الروح أي الوحي والنبوة على من يشاء من عباده ، وسمي ذلك روحا لأن الناس يحيون به ، أي : يحيون من موت الكفر كما تحيا الأبدان بالأرواح . وقال ابن زيد : الروح القرآن ، قال الله تعالى : وكذلك أوحينا إليك روحا من أمرنا . وقيل : الروح جبريل ، قال الله تعالى : نزل به الروح الأمين على قلبك وقال : قل نزله روح القدس من ربك بالحق . من أمره أي من قوله . وقيل : من قضائه . وقيل : من بمعنى الباء أي : بأمره . على من يشاء من عباده وهم الأنبياء ، يشاء هو أن يكونوا أنبياء وليس لأحد فيهم مشيئة . لينذر يوم التلاق أي إنما يبعث الرسول لإنذار يوم البعث . فقوله : لينذر يرجع إلى الرسول . وقيل : أي : لينذر الله ببعثه الرسل إلى الخلائق يوم التلاق . وقرأ ابن عباس والحسن وابن السميقع \" لتنذر \" بالتاء خطابا للنبي عليه السلام . يوم التلاق قال ابن عباس وقتادة : يوم تلتقي أهل السماء وأهل الأرض . وقال قتادة أيضا وأبو العالية ومقاتل : يلتقي فيه الخلق والخالق . وقيل : العابدون والمعبودون . وقيل : الظالم والمظلوم . وقيل : يلقى كل إنسان جزاء عمله . وقيل : يلتقي الأولون والآخرون على صعيد واحد ، روي معناه عن ابن عباس . وكله صحيح المعنى .\n                                    ",
        "saadi": "رَفِيعُ ٱلدَّرَجَٰتِ ذُو ٱلۡعَرۡشِ يُلۡقِي ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦ لِيُنذِرَ يَوۡمَ ٱلتَّلَاقِ ٥١\n                                        \n                                        \n                                        \n                                        ثم ذكر من جلاله وكماله ما يقتضي إخلاص العبادة له فقال: { رَفِيعُ الدَّرَجَاتِ ذُو الْعَرْشِ } أي: العلي الأعلى، الذي استوى على العرش واختص به، وارتفعت درجاته ارتفاعًا باين به مخلوقاته، وارتفع به قدره، وجلت أوصافه، وتعالت ذاته، أن يتقرب إليه إلا بالعمل الزكي الطاهر المطهر، وهو الإخلاص، الذي يرفع درجات أصحابه ويقربهم إليه ويجعلهم فوق خلقه، ثم ذكر نعمته على عباده بالرسالة والوحي، فقال: { يُلْقِي الرُّوحَ } أي: الوحي الذي للأرواح والقلوب بمنزلة الأرواح للأجساد، فكما أن الجسد بدون الروح لا يحيا ولا يعيش، فالروح والقلب بدون روح الوحي لا يصلح ولا يفلح، فهو تعالى { يُلْقِي الرُّوحَ مِنْ أَمْرِهِ } الذي فيه نفع العباد ومصلحتهم.\n{ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ } وهم الرسل الذين فضلهم الله واختصهم الله لوحيه ودعوة عباده.\nوالفائدة في إرسال الرسل، هو تحصيل سعادة العباد في دينهم ودنياهم وآخرتهم، وإزالة الشقاوة عنهم في دينهم ودنياهم وآخرتهم، ولهذا قال: { لِيُنْذِرَ } من ألقى الله إليه الوحي { يَوْمَ التَّلَاقِ } أي: يخوف العباد بذلك، ويحثهم على الاستعداد له بالأسباب المنجية مما يكون فيه.\nوسماه { يوم التلاق } لأنه يلتقي فيه الخالق والمخلوق والمخلوقون بعضهم مع بعض، والعاملون وأعمالهم وجزاؤهم.\n                                    "
      },
      "originalText": "رَفِيعُ ٱلدَّرَجَٰتِ ذُو ٱلۡعَرۡشِ يُلۡقِي ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦ لِيُنذِرَ يَوۡمَ ٱلتَّلَاقِ ٥١"
    },
    {
      "number": 4149,
      "text": "يَوْمَ هُمْ بَارِزُونَ ۖ لَا يَخْفَىٰ عَلَى اللَّهِ مِنْهُمْ شَيْءٌ ۚ لِمَنِ الْمُلْكُ الْيَوْمَ ۖ لِلَّهِ الْوَاحِدِ الْقَهَّارِ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 16,
      "juz": 24,
      "manzil": 6,
      "page": 468,
      "ruku": 405,
      "hizbQuarter": 187,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَوۡمَ هُم بَٰرِزُونَۖ لَا يَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَيۡءٞۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡيَوۡمَۖ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ ٦١\n                                    \n                                    \n                                    وقوله : ( يوم هم بارزون ) أي : ظاهرون بادون كلهم ، لا شيء يكنهم ولا يظلهم ولا يسترهم . ولهذا قال : ( يوم هم بارزون لا يخفى على الله منهم شيء ) أي : الجميع في علمه على السواء .\nوقوله : ( لمن الملك اليوم لله الواحد القهار ) قد تقدم في حديث ابن عمر : أنه تعالى يطوي السماوات والأرض بيده ، ثم يقول : أنا الملك ، أنا الجبار ، أنا المتكبر ، أين ملوك الأرض ؟ أين الجبارون ؟ أين المتكبرون ؟ .\nوفي حديث الصور : أنه تعالى إذا قبض أرواح جميع خلقه ، فلم يبق سواه وحده لا شريك له ، حينئذ يقول : لمن الملك اليوم ؟ ثلاث مرات ، ثم يجيب نفسه قائلا ( لله الواحد القهار ) أي : الذي هو وحده قد قهر كل شيء وغلبه .\nوقد قال ابن أبي حاتم : حدثنا محمد بن غالب الدقاق ، حدثنا عبيد بن عبيدة ، حدثنا معتمر ، عن أبيه ، حدثنا أبو نضرة ، عن ابن عباس [ رضي الله عنهما ] قال : ينادي مناد بين يدي الساعة : يا أيها الناس ، أتتكم الساعة . فيسمعها الأحياء والأموات ، قال : وينزل الله [ عز وجل ] إلى سماء الدنيا ويقول : ( لمن الملك اليوم لله الواحد القهار ) .\n                                    ",
        "qortoby": "يَوۡمَ هُم بَٰرِزُونَۖ لَا يَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَيۡءٞۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡيَوۡمَۖ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ ٦١\n                                    \n                                    \n                                    يوم هم بارزون يكون بدلا من \" يوم \" الأول . وقيل : هم في موضع رفع بالابتداء و \" بارزون \" خبره ، والجملة في موضع خفض بالإضافة ، فلذلك حذف التنوين من \" يوم \" وإنما يكون هذا عند سيبويه إذا كان الظرف بمعنى إذ ، تقول لقيتك يوم زيد أمير . فإن كان بمعنى إذا لم يجز نحو أنا ألقاك يوم زيد أمير . ومعنى : بارزون خارجون من قبورهم لا يسترهم شيء ; لأن الأرض يومئذ قاع صفصف لا عوج فيها ولا أمتا على ما تقدم في [ طه ] بيانه .\nلا يخفى على الله منهم شيء قيل : إن هذا هو العامل في \" يوم هم بارزون \" أي : لا يخفى عليه شيء منهم ومن أعمالهم يوم هم بارزون .\nلمن الملك اليوم وذلك عند فناء الخلق . وقال الحسن : هو السائل تعالى وهو المجيب ; لأنه يقول ذلك حين لا أحد يجيبه فيجيب نفسه سبحانه فيقول : لله الواحد القهار . النحاس : وأصح ما قيل فيه ما رواه أبو وائل عن ابن مسعود قال : ( يحشر الناس على أرض بيضاء مثل الفضة لم يعص الله - جل وعز - عليها ، فيؤمر مناد ينادي : لمن الملك اليوم ؟ فيقول العباد مؤمنهم وكافرهم : لله الواحد القهار ، فيقول المؤمنون هذا الجواب سرورا وتلذذا ، ويقوله الكافرون غما وانقيادا وخضوعا . فأما أن يكون هذا والخلق غير موجودين فبعيد ; لأنه لا فائدة فيه ، والقول صحيح عن ابن مسعود وليس هو مما يؤخذ بالقياس ولا بالتأويل .\nقلت : والقول الأول ظاهر جدا ; لأن المقصود إظهار انفراده تعالى بالملك عند انقطاع دعاوى المدعين وانتساب المنتسبين ، إذ قد ذهب كل ملك وملكه ومتكبر وملكه ، وانقطعت نسبهم ودعاويهم ، ودل على هذا قوله الحق عند قبض الأرض والأرواح وطي السماء : أنا الملك أين ملوك الأرض كما تقدم في حديث أبي هريرة وفي حديث ابن عمر ، ثم يطوي الأرض بشماله والسموات بيمينه ، ثم يقول : أنا الملك ، أين الجبارون ، أين المتكبرون . وعنه قوله سبحانه : لمن الملك اليوم هو انقطاع زمن الدنيا وبعده يكون البعث والنشر . قال محمد بن كعب قوله سبحانه : لمن الملك اليوم يكون بين النفختين حين فني الخلائق وبقي الخالق فلا يرى غير نفسه مالكا ولا مملوكا فيقول : لمن الملك اليوم فلا يجيبه أحد ; لأن الخلق أموات ، فيجيب نفسه فيقول : لله الواحد القهار لأنه بقي وحده وقهر خلقه . وقيل : إنه ينادي مناد فيقول : لمن الملك اليوم فيجيبه أهل الجنة : لله الواحد القهار فالله أعلم . ذكره الزمخشري .\n                                    ",
        "saadi": "يَوۡمَ هُم بَٰرِزُونَۖ لَا يَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَيۡءٞۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡيَوۡمَۖ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ ٦١\n                                        \n                                        \n                                        \n                                        { يَوْمَ هُمْ بَارِزُونَ } أي: ظاهرون على الأرض، قد اجتمعوا في صعيد واحد لا عوج ولا أمت فيه، يسمعهم الداعي وينفذهم البصر.\n{ لَا يَخْفَى عَلَى اللَّهِ مِنْهُمْ شَيْءٌ } لا من ذواتهم ولا من أعمالهم، ولا من جزاء تلك الأعمال.\n{ لِمَنِ الْمُلْكُ الْيَوْمَ } أي: من هو المالك لذلك اليوم العظيم الجامع للأولين والآخرين، أهل السماوات وأهل الأرض، الذي انقطعت فيه الشركة في الملك، وتقطعت الأسباب، ولم يبق إلا الأعمال الصالحة أو السيئة؟ الملك { لِلَّهِ الْوَاحِدِ الْقَهَّارِ } أي: المنفرد في ذاته وأسمائه وصفاته وأفعاله، فلا شريك له في شيء منها بوجه من الوجوه. { الْقَهَّارِ } لجميع المخلوقات، الذي دانت له المخلوقات وذلت وخضعت، خصوصًا في ذلك اليوم الذي عنت فيه الوجوه للحي القيوم، يومئذ لا تَكَلَّمُ نفس إلا بإذنه.\n                                    "
      },
      "originalText": "يَوۡمَ هُم بَٰرِزُونَۖ لَا يَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَيۡءٞۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡيَوۡمَۖ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ ٦١"
    }
  ]
}