{
  "number": 47,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 282,
      "text": "الَّذِينَ يَأْكُلُونَ الرِّبَا لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنَ الْمَسِّ ۚ ذَٰلِكَ بِأَنَّهُمْ قَالُوا إِنَّمَا الْبَيْعُ مِثْلُ الرِّبَا ۗ وَأَحَلَّ اللَّهُ الْبَيْعَ وَحَرَّمَ الرِّبَا ۚ فَمَنْ جَاءَهُ مَوْعِظَةٌ مِنْ رَبِّهِ فَانْتَهَىٰ فَلَهُ مَا سَلَفَ وَأَمْرُهُ إِلَى اللَّهِ ۖ وَمَنْ عَادَ فَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 275,
      "juz": 3,
      "manzil": 1,
      "page": 47,
      "ruku": 39,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَأۡكُلُونَ ٱلرِّبَوٰاْ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيۡطَٰنُ مِنَ ٱلۡمَسِّۚ ذَٰلِكَ بِأَنَّهُمۡ قَالُوٓاْ إِنَّمَا ٱلۡبَيۡعُ مِثۡلُ ٱلرِّبَوٰاْۗ وَأَحَلَّ ٱللَّهُ ٱلۡبَيۡعَ وَحَرَّمَ ٱلرِّبَوٰاْۚ فَمَن جَآءَهُۥ مَوۡعِظَةٞ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمۡرُهُۥٓ إِلَى ٱللَّهِۖ وَمَنۡ عَادَ فَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥٧٢\n                                        \n                                        \n                                        لما ذكر تعالى الأبرار المؤدين النفقات ، المخرجين الزكوات ، المتفضلين بالبر والصلات لذوي الحاجات والقرابات في جميع الأحوال والآنات شرع في ذكر أكلة الربا وأموال الناس بالباطل وأنواع الشبهات ، فأخبر عنهم يوم خروجهم من قبورهم وقيامهم منها إلى بعثهم ونشورهم ، فقال : ( الذين يأكلون الربا لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس ) أي : لا يقومون من قبورهم يوم القيامة إلا كما يقوم المصروع حال صرعه وتخبط الشيطان له ; وذلك أنه يقوم قياما منكرا . وقال ابن عباس : آكل الربا يبعث يوم القيامة مجنونا يخنق . رواه ابن أبي حاتم ، قال : وروي عن عوف بن مالك ، وسعيد بن جبير ، والسدي ، والربيع بن أنس ، ومقاتل بن حيان ، نحو ذلك .\nوحكي عن عبد الله بن عباس ، وعكرمة ، وسعيد بن جبير ، والحسن ، وقتادة ، ومقاتل بن حيان أنهم قالوا في قوله : ( الذين يأكلون الربا لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس ) يعني : لا يقومون يوم القيامة . وكذا قال ابن أبي نجيح ، عن مجاهد ، والضحاك ، وابن زيد .\nوروى ابن أبي حاتم ، من حديث أبي بكر بن أبي مريم ، عن ضمرة بن حبيب ، عن ابن عبد الله بن مسعود ، عن أبيه أنه كان يقرأ : \" الذين يأكلون الربا لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس يوم القيامة \"\nوقال ابن جرير : حدثني المثنى ، حدثنا مسلم بن إبراهيم ، حدثنا ربيعة بن كلثوم ، حدثنا أبي ، عن سعيد بن جبير ، عن ابن عباس قال : يقال يوم القيامة لآكل الربا : خذ سلاحك للحرب . وقرأ : ( لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس ) قال : وذلك حين يقوم من قبره .\nوفي حديث أبي سعيد في الإسراء ، كما هو مذكور في سورة سبحان : أنه ، عليه السلام مر ليلتئذ بقوم لهم أجواف مثل البيوت ، فسأل عنهم ، فقيل : هؤلاء أكلة الربا . رواه البيهقي مطولا .\nوقال ابن ماجه : حدثنا أبو بكر بن أبي شيبة ، حدثنا الحسن بن موسى ، عن حماد بن سلمة ، عن علي بن زيد ، عن أبي الصلت ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" أتيت ليلة أسري بي على قوم بطونهم كالبيوت ، فيها الحيات ترى من خارج بطونهم . فقلت : من هؤلاء يا جبريل ؟ قال : هؤلاء أكلة الربا \" .\nورواه الإمام أحمد ، عن حسن وعفان ، كلاهما عن حماد بن سلمة ، به . وفي إسناده ضعف .\nوقد روى البخاري ، عن سمرة بن جندب في حديث المنام الطويل : \" فأتينا على نهر حسبت أنه كان يقول : أحمر مثل الدم وإذا في النهر رجل سابح يسبح ، وإذا على شط النهر رجل قد جمع عنده حجارة كثيرة ، وإذا ذلك السابح يسبح ، [ ما يسبح ] ثم يأتي ذلك الذي قد جمع الحجارة عنده فيفغر له فاه فيلقمه حجرا \" وذكر في تفسيره : أنه آكل الربا .\nوقوله : ( ذلك بأنهم قالوا إنما البيع مثل الربا وأحل الله البيع وحرم الربا ) أي : إنما جوزوا بذلك لاعتراضهم على أحكام الله في شرعه ، وليس هذا قياسا منهم للربا على البيع ; لأن المشركين لا يعترفون بمشروعية أصل البيع الذي شرعه الله في القرآن ، ولو كان هذا من باب القياس لقالوا : إنما الربا مثل البيع ، وإنما قالوا : ( إنما البيع مثل الربا ) أي : هو نظيره ، فلم حرم هذا وأبيح هذا ؟ وهذا اعتراض منهم على الشرع ، أي : هذا مثل هذا ، وقد أحل هذا وحرم هذا !\nوقوله تعالى : ( وأحل الله البيع وحرم الربا ) يحتمل أن يكون من تمام الكلام ردا عليهم ، أي : قالوا : ما قالوه من الاعتراض ، مع علمهم بتفريق الله بين هذا وهذا حكما ، وهو الحكيم العليم الذي لا معقب لحكمه ، ولا يسأل عما يفعل وهم يسألون ، وهو العالم بحقائق الأمور ومصالحها ، وما ينفع عباده فيبيحه لهم ، وما يضرهم فينهاهم عنه ، وهو أرحم بهم من الوالدة بولدها الطفل ; ولهذا قال : ( فمن جاءه موعظة من ربه فانتهى فله ما سلف وأمره إلى الله ) أي : من بلغه نهي الله عن الربا فانتهى حال وصول الشرع إليه . فله ما سلف من المعاملة ، لقوله : ( عفا الله عما سلف ) [ المائدة : 95 ] وكما قال النبي صلى الله عليه وسلم يوم فتح مكة : \" وكل ربا في الجاهلية موضوع تحت قدمي هاتين ، وأول ربا أضع ربا العباس \" ولم يأمرهم برد الزيادات المأخوذة في حال الجاهلية ، بل عفا عما سلف ، كما قال\nتعالى : ( فله ما سلف وأمره إلى الله )\nقال سعيد بن جبير والسدي : ( فله ما سلف ) فإنه ما كان أكل من الربا قبل التحريم .\nوقال ابن أبي حاتم : قرئ على محمد بن عبد الله بن عبد الحكم ، أخبرنا ابن وهب ، أخبرني جرير بن حازم ، عن أبي إسحاق الهمداني ، عن أم يونس يعني امرأته العالية بنت أيفع أن عائشة زوج النبي صلى الله عليه وسلم قالت لها أم محبة أم ولد لزيد بن أرقم : يا أم المؤمنين ، أتعرفين زيد بن أرقم ؟ قالت : نعم . قالت : فإني بعته عبدا إلى العطاء بثمانمائة ، فاحتاج إلى ثمنه ، فاشتريته قبل محل الأجل بستمائة . فقالت : بئس ما شريت ! وبئس ما اشتريت ! أبلغي زيدا أنه قد أبطل جهاده مع رسول الله صلى الله عليه وسلم إن لم يتب . قالت : فقلت : أرأيت إن تركت المائتين وأخذت الستمائة ؟ قالت : نعم ، ( فمن جاءه موعظة من ربه فانتهى فله ما سلف ) .\nوهذا الأثر مشهور ، وهو دليل لمن حرم مسألة العينة ، مع ما جاء فيها من الأحاديث المقررة في كتاب الأحكام ، ولله الحمد والمنة .\nثم قال تعالى : ( ومن عاد ) أي : إلى الربا ففعله بعد بلوغ نهي الله له عنه ، فقد استوجب العقوبة ، وقامت عليه الحجة ; ولهذا قال : ( فأولئك أصحاب النار هم فيها خالدون )\nوقد قال أبو داود : حدثنا يحيى بن معين ، أخبرنا عبد الله بن رجاء المكي ، عن عبد الله بن عثمان بن خثيم ، عن أبي الزبير ، عن جابر قال : لما نزلت : ( الذين يأكلون الربا لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس ) قال رسول الله صلى الله عليه وسلم : \" من لم يذر المخابرة ، فليأذن بحرب من الله ورسوله \" .\nورواه الحاكم في مستدركه ، من حديث ابن خثيم ، وقال : صحيح على شرط مسلم ، ولم يخرجه .\nوإنما حرمت المخابرة وهي : المزارعة ببعض ما يخرج من الأرض ، والمزابنة وهي : اشتراء الرطب في رؤوس النخل بالتمر على وجه الأرض ، والمحاقلة وهي : اشتراء الحب في سنبله في الحقل بالحب على وجه الأرض إنما حرمت هذه الأشياء وما شاكلها ، حسما لمادة الربا ; لأنه لا يعلم التساوي بين الشيئين قبل الجفاف . ولهذا قال الفقهاء : الجهل بالمماثلة كحقيقة المفاضلة . ومن هذا حرموا أشياء بما فهموا من تضييق المسالك المفضية إلى الربا ، والوسائل الموصلة إليه ، وتفاوت نظرهم بحسب ما وهب الله لكل منهم من العلم ، وقد قال تعالى : ( وفوق كل ذي علم عليم ) [ يوسف : 76 ] .\nوباب الربا من أشكل الأبواب على كثير من أهل العلم ، وقد قال أمير المؤمنين عمر بن الخطاب ، رضي الله عنه : ثلاث وددت أن رسول الله صلى الله عليه وسلم عهد إلينا فيهن عهدا ننتهي إليه : الجد ، والكلالة ، وأبواب من أبواب الربا ، يعني بذلك بعض المسائل التي فيها شائبة الربا . والشريعة شاهدة بأن كل حرام فالوسيلة إليه مثله ; لأن ما أفضى إلى الحرام حرام ، كما أن ما لا يتم الواجب إلا به فهو واجب . وقد ثبت في الصحيحين ، عن النعمان بن بشير ، قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" إن الحلال بين وإن الحرام بين ، وبين ذلك أمور مشتبهات ، فمن اتقى الشبهات استبرأ لدينه وعرضه ، ومن وقع في الشبهات وقع في الحرام ، كالراعي يرعى حول الحمى يوشك أن يرتع فيه \" .\nوفي السنن عن الحسن بن علي ، رضي الله عنهما ، قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" دع ما يريبك إلى ما لا يريبك \" . وفي الحديث الآخر : \" الإثم ما حاك في القلب وترددت فيه النفس ، وكرهت أن يطلع عليه الناس \" . وفي رواية : \" استفت قلبك ، وإن أفتاك الناس وأفتوك \" .\nوقال الثوري : عن عاصم ، عن الشعبي ، عن ابن عباس قال : آخر ما نزل على رسول الله صلى الله عليه وسلم آية الربا . رواه [ البخاري ] عن قبيصة ، عنه .\nوقال أحمد ، عن يحيى ، عن سعيد بن أبي عروبة ، عن قتادة ، عن سعيد بن المسيب أن عمر قال : من آخر ما نزل آية الربا ، وإن رسول الله صلى الله عليه وسلم قبض قبل أن يفسرها لنا ، فدعوا الربا والريبة .\nرواه ابن ماجه وابن مردويه .\nوروى ابن مردويه من طريق هياج بن بسطام ، عن داود بن أبي هند ، عن أبي نضرة عن أبي سعيد الخدري قال : خطبنا عمر بن الخطاب ، رضي الله عنه ، فقال : إني لعلي أنهاكم عن أشياء تصلح لكم وآمركم بأشياء لا تصلح لكم ، وإن من آخر القرآن نزولا آية الربا ، وإنه قد مات رسول الله صلى الله عليه وسلم ولم يبينه لنا ، فدعوا ما يريبكم إلى ما لا يريبكم .\nوقد قال ابن ماجه : حدثنا عمرو بن علي الصيرفي ، حدثنا ابن أبي عدي ، عن شعبة ، عن زبيد ، عن إبراهيم ، عن مسروق ، عن عبد الله هو ابن مسعود عن النبي صلى الله عليه وسلم قال : \" الربا ثلاثة وسبعون بابا \" .\nورواه الحاكم في مستدركه ، من حديث عمرو بن علي الفلاس ، بإسناد مثله ، وزاد : \" أيسرها أن ينكح الرجل أمه ، وإن أربى الربا عرض الرجل المسلم \" . وقال : صحيح على شرط الشيخين ، ولم يخرجاه .\nوقال ابن ماجه : حدثنا عبد الله بن سعيد ، حدثنا عبد الله بن إدريس ، عن أبي معشر ، عن سعيد المقبري ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" الربا سبعون حوبا ، أيسرها أن ينكح الرجل أمه \" .\nوقال الإمام أحمد : حدثنا هشيم ، عن عباد بن راشد ، عن سعيد بن أبي خيرة حدثنا الحسن منذ نحو من أربعين أو خمسين سنة عن أبي هريرة ، أن رسول الله صلى الله عليه وسلم قال : \" يأتي على الناس زمان يأكلون فيه الربا \" قال : قيل له : الناس كلهم ؟ قال : \" من لم يأكله منهم ناله من غباره \"وكذا رواه أبو داود ، والنسائي ، وابن ماجه من غير وجه ، عن سعيد بن أبي خيرة عن الحسن ، به .\nومن هذا القبيل ، وهو تحريم الوسائل المفضية إلى المحرمات الحديث الذي رواه الإمام أحمد : حدثنا أبو معاوية ، حدثنا الأعمش ، عن مسلم بن صبيح ، عن مسروق ، عن عائشة قالت : لما نزلت الآيات من آخر البقرة في الربا خرج رسول الله صلى الله عليه وسلم إلى المسجد ، فقرأهن ، فحرم التجارة في الخمر .\nوقد أخرجه الجماعة سوى الترمذي ، من طرق ، عن الأعمش به وهكذا لفظ رواية البخاري ، عند تفسير الآية : فحرم التجارة ، وفي لفظ له ، عن عائشة قالت : لما نزلت الآيات من آخر سورة البقرة في الربا قرأها رسول الله صلى الله عليه وسلم على الناس ، ثم حرم التجارة في الخمر . قال بعض من تكلم على هذا الحديث من الأئمة : لما حرم الربا ووسائله حرم الخمر وما يفضي إليه من تجارة ونحو ذلك ، كما قال ، عليه السلام في الحديث المتفق عليه : \" لعن الله اليهود ، حرمت عليهم الشحوم فجملوها فباعوها وأكلوا أثمانها \" .\nوقد تقدم في حديث علي وابن مسعود وغيرهما ، عند لعن المحلل في تفسير قوله : ( حتى تنكح زوجا غيره ) [ البقرة : 230 ] قوله صلى الله عليه وسلم : \" لعن الله آكل الربا وموكله ، وشاهديه وكاتبه \" . قالوا : وما يشهد عليه ويكتب إلا إذا أظهر في صورة عقد شرعي ويكون داخله فاسدا ، فالاعتبار بمعناه لا بصورته ; لأن الأعمال بالنيات ، وفي الصحيح : \" إن الله لا ينظر إلى صوركم ولا إلى أموالكم ، وإنما ينظر إلى قلوبكم وأعمالكم \" .\nوقد صنف الإمام ، العلامة أبو العباس ابن تيمية كتابا في \" إبطال التحليل \" تضمن النهي عن تعاطي الوسائل المفضية إلى كل باطل ، وقد كفى في ذلك وشفى ، فرحمه الله ورضي عنه .\n                                    ",
        "qortoby": "ٱلَّذِينَ يَأۡكُلُونَ ٱلرِّبَوٰاْ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيۡطَٰنُ مِنَ ٱلۡمَسِّۚ ذَٰلِكَ بِأَنَّهُمۡ قَالُوٓاْ إِنَّمَا ٱلۡبَيۡعُ مِثۡلُ ٱلرِّبَوٰاْۗ وَأَحَلَّ ٱللَّهُ ٱلۡبَيۡعَ وَحَرَّمَ ٱلرِّبَوٰاْۚ فَمَن جَآءَهُۥ مَوۡعِظَةٞ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمۡرُهُۥٓ إِلَى ٱللَّهِۖ وَمَنۡ عَادَ فَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥٧٢\n                                        \n                                        \n                                        الذين يأكلون الربا لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس ذلك بأنهم قالوا إنما البيع مثل الربا وأحل الله البيع وحرم الربا فمن جاءه موعظة من ربه فانتهى فله ما سلف وأمره إلى الله ومن عاد فأولئك أصحاب النار هم فيها خالدون يمحق الله الربا ويربي الصدقات والله لا يحب كل كفار أثيم إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون يا أيها الذين آمنوا اتقوا الله وذروا ما بقي من الربا إن كنتم مؤمنين فإن لم تفعلوا فأذنوا بحرب من الله ورسوله وإن تبتم فلكم رءوس أموالكم لا تظلمون ولا تظلمون\nالآيات الثلاث تضمنت أحكام الربا وجواز عقود المبايعات ، والوعيد لمن استحل الربا وأصر على فعله ، وفي ذلك مسائل :\nالأولى : قوله تعالى : الذين يأكلون الربا ( يأكلون ) يأخذون ، فعبر عن الأخذ بالأكل ؛ لأن الأخذ إنما يراد للأكل . والربا في اللغة الزيادة مطلقا ، يقال : ربا الشيء يربو إذا زاد ، ومنه الحديث : فلا والله ما أخذنا من لقمة إلا ربا من تحتها يعني الطعام الذي دعا فيه النبي صلى الله عليه وسلم بالبركة ، خرج الحديث مسلم رحمه الله . وقياس كتابته بالياء للكسرة في أوله ، وقد كتبوه في القرآن بالواو . ثم إن الشرع قد تصرف في هذا الإطلاق فقصره على بعض موارده ، فمرة أطلقه على كسب الحرام ، كما قال الله تعالى في اليهود : وأخذهم الربا وقد نهوا عنه . ولم يرد به الربا الشرعي الذي حكم بتحريمه علينا وإنما أراد المال الحرام ، كما قال تعالى : سماعون للكذب أكالون للسحت ؛ يعني به المال الحرام من الرشا ، وما استحلوه من أموال الأميين حيث قالوا : ليس علينا في الأميين سبيل . وعلى هذا فيدخل فيه النهي عن كل مال حرام بأي وجه اكتسب . والربا الذي عليه عرف الشرع شيئان : تحريم النساء ، والتفاضل في العقود وفي المطعومات على ما نبينه . وغالبه ما كانت العرب تفعله ، من قولها للغريم : أتقضي أم تربي ؟ فكان الغريم يزيد في عدد المال ويصبر الطالب عليه . وهذا كله محرم باتفاق الأمة .\nالثانية : أكثر البيوع الممنوعة إنما تجد منعها لمعنى زيادة إما في عين مال ، وإما في منفعة لأحدهما من تأخير ونحوه . ومن البيوع ما ليس فيه معنى الزيادة ، كبيع الثمرة قبل بدو صلاحها ، وكالبيع ساعة النداء يوم الجمعة ، فإن قيل لفاعلها ، آكل الربا فتجوز وتشبيه .\nالثالثة : روى الأئمة واللفظ لمسلم عن أبي سعيد الخدري قال : قال رسول الله صلى الله عليه وسلم : الذهب بالذهب والفضة بالفضة والبر بالبر والشعير بالشعير والتمر بالتمر والملح بالملح مثلا بمثل يدا بيد فمن زاد أو استزاد فقد أربى الآخذ والمعطي فيه سواء . وفي حديث عبادة بن الصامت : فإذا اختلفت هذه الأصناف فبيعوا كيف شئتم إذا كان يدا بيد . وروى أبو داود عن عبادة بن الصامت أن رسول الله صلى الله عليه وسلم قال : الذهب بالذهب تبرها وعينها والفضة بالفضة تبرها وعينها والبر بالبر مدي بمدي والشعير بالشعير مدي بمدي والتمر بالتمر مدي بمدي والملح بالملح مدي بمدي فمن زاد أو ازداد فقد أربى ولا بأس ببيع الذهب بالفضة والفضة ، أكثرهما يدا بيد وأما نسيئة فلا ولا بأس ببيع البر بالشعير والشعير ، أكثرهما يدا بيد وأما نسيئة فلا . وأجمع العلماء على القول بمقتضى هذه السنة وعليها جماعة فقهاء المسلمين إلا في البر والشعير فإن مالكا جعلهما صنفا واحدا ، فلا يجوز منهما اثنان بواحد ، وهو قول الليث والأوزاعي ومعظم علماء المدينة والشام ، وأضاف مالك إليهما السلت . وقال الليث : السلت والدخن والذرة صنف واحد ، وقاله ابن وهب .\nقلت : وإذا ثبتت السنة فلا قول معها . وقال عليه السلام : ( فإذا اختلفت هذه الأصناف فبيعوا كيف شئتم إذا كان يدا بيد ) . وقوله : ( البر بالبر والشعير بالشعير ) دليل على أنهما نوعان مختلفان كمخالفة البر للتمر ، ولأن صفاتهما مختلفة وأسماؤهما مختلفة ، ولا اعتبار بالمنبت والمحصد إذا لم يعتبره الشرع ، بل فصل وبين ، وهذا مذهب الشافعي وأبي حنيفة والثوري وأصحاب الحديث .\nالرابعة : كان معاوية بن أبي سفيان يذهب إلى أن النهي والتحريم إنما ورد من النبي صلى الله عليه وسلم في الدينار المضروب والدرهم المضروب لا في التبر من الذهب والفضة بالمضروب ، ولا في المصوغ بالمضروب . وقد قيل إن ذلك إنما كان منه في المصوغ خاصة ، حتى وقع له مع عبادة ما خرجه مسلم وغيره ، قال : غزونا وعلى الناس معاوية فغنمنا غنائم كثيرة ، فكان مما غنمنا آنية من فضة فأمر معاوية رجلا ببيعها في أعطيات الناس ، فتنازع الناس في ذلك فبلغ عبادة بن الصامت ذلك فقام فقال : إني سمعت رسول الله صلى الله عليه وسلم ينهى عن بيع الذهب بالذهب والفضة بالفضة والبر بالبر والشعير بالشعير والتمر بالتمر والملح بالملح إلا سواء بسواء عينا بعين من زاد أو ازداد فقد أربى ، فرد الناس ما أخذوا ، فبلغ ذلك معاوية فقام خطيبا فقال : ألا ما بال رجال يتحدثون عن رسول الله صلى الله عليه وسلم أحاديث قد كنا نشهده ونصحبه فلم نسمعها منه فقام عبادة بن الصامت فأعاد القصة ثم قال : لنحدثن بما سمعنا من رسول الله صلى الله عليه وسلم وإن كره معاوية - أو قال وإن رغم - ما أبالي ألا أصحبه في جنده في ليلة سوداء . قال حماد هذا أو نحوه . قال ابن عبد البر : وقد روي أن هذه القصة إنما كانت لأبي الدرداء مع معاوية . ويحتمل أن يكون وقع ذلك لهما معه ، ولكن الحديث في العرف محفوظ لعبادة ، وهو الأصل الذي عول عليه العلماء في باب ( الربا ) . ولم يختلفوا أن فعل معاوية في ذلك غير جائز ، وغير نكير أن يكون معاوية خفي عليه ما قد علمه أبو الدرداء وعبادة فإنهما جليلان من فقهاء الصحابة وكبارهم ، وقد خفي على أبي بكر وعمر ما وجد عند غيرهم ممن هو دونهم ، فمعاوية أحرى . ويحتمل أن يكون مذهبه كمذهب ابن عباس ، فقد كان وهو بحر في العلم لا يرى الدرهم بالدرهمين بأسا حتى صرفه عن ذلك أبو سعيد . وقصة معاوية هذه مع عبادة كانت في ولاية عمر . قال قبيصة بن ذؤيب : إن عبادة أنكر شيئا على معاوية فقال : لا أساكنك بأرض أنت بها ودخل المدينة . فقال له عمر : ما أقدمك ؟ فأخبره . فقال : ارجع إلى مكانك ، فقبح الله أرضا لست فيها ولا أمثالك! وكتب إلى معاوية \" لا إمارة لك عليه \" .\nالخامسة : روى الأئمة واللفظ للدارقطني عن علي رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : الدينار بالدينار والدرهم بالدرهم لا فضل بينهما من كانت له حاجة بورق فليصرفها بذهب وإن كانت له حاجة بذهب فليصرفها بورق هاء وهاء . قال العلماء فقوله ، عليه السلام : ( الدينار بالدينار والدرهم بالدرهم لا فضل بينهما ) إشارة إلى جنس الأصل المضروب ، بدليل قوله : ( الفضة بالفضة والذهب بالذهب ) الحديث . والفضة البيضاء والسوداء والذهب الأحمر والأصفر كل ذلك لا يجوز بيع بعضه ببعض إلا مثلا بمثل سواء بسواء على كل حال ، على هذا جماعة أهل العلم على ما بينا . واختلفت الرواية عن مالك في الفلوس فألحقها بالدراهم من حيث كانت ثمنا للأشياء ، ومنع من إلحاقها مرة من حيث إنها ليست ثمنا في كل بلد وإنما يختص بها بلد دون بلد .\nالسادسة : لا اعتبار بما قد روي عن كثير من أصحاب مالك وبعضهم يرويه عن مالك في التاجر يحفزه الخروج وبه حاجة إلى دراهم مضروبة أو دنانير مضروبة ، فيأتي دار الضرب بفضته أو ذهبه فيقول للضراب ، خذ فضتي هذه أو ذهبي وخذ قدر عمل يدك وادفع إلي دنانير مضروبة في ذهبي أو دراهم مضروبة في فضتي هذه لأني محفوز للخروج وأخاف أن يفوتني من أخرج معه ، أن ذلك جائز للضرورة ، وأنه قد عمل به بعض الناس . وحكاه ابن العربي في قبسه عن مالك في غير التاجر ، وإن مالكا خفف في ذلك ، فيكون في الصورة قد باع فضته التي زنتها مائة وخمسة دراهم أجره بمائة وهذا محض الربا . والذي أوجب جواز ذلك أنه لو قال له : اضرب لي هذه وقاطعه على ذلك بأجرة ، فلما ضربها قبضها منه وأعطاه أجرتها ، فالذي فعل مالك أولا هو الذي يكون آخرا ، ومالك إنما نظر إلى المال فركب عليه حكم الحال ، وأباه سائر الفقهاء . قال ابن العربي : والحجة فيه لمالك بينة . قال أبو عمر رحمه الله : وهذا هو عين الربا الذي حرمه رسول الله صلى الله عليه وسلم بقوله : ( من زاد أو ازداد فقد أربى ) . وقد رد ابن وهب هذه المسألة على مالك وأنكرها . وزعم الأبهري أن ذلك من باب الرفق لطلب التجارة ولئلا يفوت السوق ، وليس الربا إلا على من أراد أن يربي ممن يقصد إلى ذلك ويبتغيه . ونسي الأبهري أصله في قطع الذرائع ، وقوله ، فيمن باع ثوبا بنسيئة وهو لا نية له في شرائه ثم يجده في السوق يباع : إنه لا يجوز له ابتياعه منه بدون ما باعه به وإن لم يقصد إلى ذلك ولم يبتغه ، ومثله كثير ، ولو لم يكن الربا إلا على من قصده ما حرم إلا على الفقهاء . وقد قال عمر : لا يتجر في سوقنا إلا من فقه وإلا أكل الربا . وهذا بين لمن رزق الإنصاف وألهم رشده .\nقلت : وقد بالغ مالك رحمه الله في منع الزيادة حتى جعل المتوهم كالمتحقق ، فمنع دينارا ودرهما بدينار ودرهم سدا للذريعة وحسما للتوهمات ، إذ لولا توهم الزيادة لما تبادلا . وقد علل منع ذلك بتعذر المماثلة عند التوزيع ، فإنه يلزم منه ذهب وفضة بذهب . وأوضح من هذا منعه التفاضل المعنوي ، وذلك أنه منع دينارا من الذهب العالي ودينارا من الذهب الدون في مقابلة العالي وألغى الدون ، وهذا من دقيق نظره رحمه الله ، فدل أن تلك الرواية عنه منكرة ولا تصح . والله أعلم .\nالسابعة : قال الخطابي : التبر قطع الذهب والفضة قبل أن تضرب وتطبع دراهم أو دنانير ، واحدتها تبرة . والعين : المضروب من الدراهم أو الدنانير . وقد حرم رسول الله صلى الله عليه وسلم أن يباع مثقال ذهب عين بمثقال وشيء من تبر غير مضروب . وكذلك حرم التفاوت بين المضروب من الفضة وغير المضروب منها ، وذلك معنى قوله : ( تبرها وعينها سواء ) .\nالثامنة : أجمع العلماء على أن التمر بالتمر ولا يجوز إلا مثلا بمثل . واختلفوا في بيع التمرة الواحدة بالتمرتين ، والحبة الواحدة من القمح بحبتين ، فمنعه الشافعي وأحمد وإسحاق والثوري ، وهو قياس قول مالك وهو الصحيح ؛ لأن ما جرى الربا فيه بالتفاضل في كثيره دخل قليله في ذلك قياسا ونظرا . احتج من أجاز ذلك بأن مستهلك التمرة والتمرتين لا تجب عليه القيمة ، قال : لأنه لا مكيل ولا موزون فجاز فيه التفاضل .\nالتاسعة : اعلم رحمك الله أن مسائل هذا الباب كثيرة وفروعه منتشرة ، والذي يربط لك ذلك أن تنظر إلى ما اعتبره كل واحد من العلماء في علة الربا ، فقال أبو حنيفة : علة ذلك كونه مكيلا أو موزونا جنسا ، فكل ما يدخله الكيل أو الوزن عنده من جنس واحد ، فإن بيع بعضه ببعض متفاضلا أو نسيئا لا يجوز ، فمنع بيع التراب بعضه ببعض متفاضلا ؛ لأنه يدخله الكيل ، وأجاز الخبز قرصا بقرصين ؛ لأنه لم يدخل عنده في الكيل الذي هو أصله ، فخرج من الجنس الذي يدخله الربا إلى ما عداه . وقال الشافعي : العلة كونه مطعوما جنسا . هذا قوله في الجديد ، فلا يجوز عنده بيع الدقيق بالخبز ولا بيع الخبز بالخبز متفاضلا ولا نسيئا ، وسواء أكان الخبز خميرا أو فطيرا . ولا يجوز عنده بيضة ببيضتين ، ولا رمانة برمانتين ، ولا بطيخة ببطيختين لا يدا بيد ولا نسيئة ؛ لأن ذلك كله طعام مأكول . وقال في القديم : كونه مكيلا أو موزونا . واختلفت عبارات أصحابنا المالكية في ذلك ، وأحسن ما في ذلك كونه مقتاتا مدخرا للعيش غالبا جنسا ، كالحنطة والشعير والتمر والملح المنصوص عليها ، وما في معناها كالأرز والذرة والدخن والسمسم ، والقطاني كالفول والعدس واللوبياء والحمص ، وكذلك اللحوم والألبان والخلول والزيوت ، والثمار كالعنب والزبيب والزيتون ، واختلف في التين ، ويلحق بها العسل والسكر . فهذا كله يدخله الربا من جهة النساء . وجائز فيه التفاضل لقوله عليه السلام إذا اختلفت هذه الأصناف فبيعوا كيف شئتم إذا كان يدا بيد . ولا ربا في رطب الفواكه التي لا تبقى كالتفاح والبطيخ والرمان والكمثرى والقثاء والخيار والباذنجان وغير ذلك من الخضراوات . قال مالك : لا يجوز بيع البيض بالبيض متفاضلا ؛ لأنه مما يدخر ، ويجوز عنده مثلا بمثل . وقال محمد بن عبد الله بن عبد الحكم : جائز بيضة ببيضتين وأكثر ؛ لأنه مما لا يدخر ، وهو قول الأوزاعي .\nالعاشرة : اختلف النحاة في لفظ \" الربا \" فقال البصريون : هو من ذوات الواو ؛ لأنك تقول في تثنيته : ربوان ، قاله سيبويه . وقال الكوفيون : يكتب بالياء ، وتثنيته بالياء ، لأجل الكسرة التي في أوله . قال الزجاج : ما رأيت خطأ أقبح من هذا ولا أشنع لا يكفيهم الخطأ في الخط حتى يخطئوا في التثنية وهم يقرءون : وما آتيتم من ربا ليربو في أموال الناس قال محمد بن يزيد : كتب \" الربا \" في المصحف بالواو فرقا بينه وبين الزنا ، وكان الربا أولى منه بالواو ؛ لأنه من ربا يربو .\nالحادية عشرة : قوله تعالى : لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس الجملة خبر الابتداء وهو ( الذين ) . والمعنى من قبورهم ، قاله ابن عباس ومجاهد وابن جبير وقتادة والربيع والضحاك والسدي وابن زيد . وقال بعضهم : يجعل معه شيطان يخنقه . وقالوا كلهم : يبعث كالمجنون عقوبة له وتمقيتا عند جميع أهل المحشر . ويقوي هذا التأويل المجمع عليه أن في قراءة ابن مسعود \" لا يقومون يوم القيامة إلا كما يقوم \" . قال ابن عطية : وأما ألفاظ الآية فكانت تحتمل تشبيه حال القائم بحرص وجشع إلى تجارة الدنيا بقيام المجنون ؛ لأن الطمع والرغبة تستفزه حتى تضطرب أعضاؤه ، وهذا كما تقول لمسرع في مشيه يخلط في هيئة حركاته إما من فزع أو غيره : قد جن هذا! وقد شبه الأعشى ناقته في نشاطها بالجنون في قوله :\nوتصبح عن غب السرى وكأنما ألم بها من طائف الجن أولق\nوقال آخر :\nلعمرك بي من حب أسماء أولق\nلكن ما جاءت به قراءة ابن مسعود وتظاهرت به أقوال المفسرين يضعف هذا التأويل . و ( يتخبطه ) يتفعله من خبط يخبط ، كما تقول : تملكه وتعبده . فجعل الله هذه العلامة لأكلة الربا ، وذلك أنه أرباه في بطونهم فأثقلهم ، فهم إذا خرجوا من قبورهم يقومون ويسقطون . ويقال : إنهم يبعثون يوم القيامة قد انتفخت بطونهم كالحبالى ، وكلما قاموا سقطوا والناس يمشون عليهم . وقال بعض العلماء : إنما ذلك شعار لهم يعرفون به يوم القيامة ثم العذاب من وراء ذلك ، كما أن الغال يجيء بما غل يوم القيامة بشهرة يشهر بها ثم العذاب من وراء ذلك . وقال تعالى : ( يأكلون ) والمراد يكسبون الربا ويفعلونه . وإنما خص الأكل بالذكر لأنه أقوى مقاصد الإنسان في المال ، ولأنه دال على الجشع وهو أشد الحرص ، يقال : رجل جشع بين الجشع وقوم جشعون ، قاله في المجمل . فأقيم هذا البعض من توابع الكسب مقام الكسب كله ، فاللباس والسكنى والادخار والإنفاق على العيال داخل في قوله : ( الذين يأكلون ) .\nالثانية عشرة : في هذه الآية دليل على فساد إنكار من أنكر الصرع من جهة الجن ، وزعم أنه من فعل الطبائع ، وأن الشيطان لا يسلك في الإنسان ولا يكون منه مس ، وقد مضى الرد عليهم فيما تقدم من هذا الكتاب . وقد روى النسائي عن أبي اليسر قال : كان رسول الله صلى الله عليه وسلم يدعو فيقول : اللهم إني أعوذ بك من التردي والهدم والغرق والحريق وأعوذ بك أن يتخبطني الشيطان عند الموت وأعوذ بك أن أموت في سبيلك مدبرا وأعوذ بك أن أموت لديغا . وروي من حديث محمد بن المثنى حدثنا أبو داود حدثنا همام عن قتادة عن أنس عن النبي صلى الله عليه وسلم أنه كان يقول : اللهم إني أعوذ بك من الجنون والجذام والبرص وسيئ الأسقام . والمس : الجنون ، يقال : مس الرجل وألس ، فهو ممسوس ومألوس إذا كان مجنونا ، وذلك علامة الربا في الآخرة . وروي في حديث الإسراء : فانطلق بي جبريل فمررت برجال كثير كل رجل منهم بطنه مثل البيت الضخم متصدين على سابلة آل فرعون وآل فرعون يعرضون على النار بكرة وعشيا فيقبلون مثل الإبل المهيومة يتخبطون الحجارة والشجر لا يسمعون ولا يعقلون فإذا أحس بهم أصحاب تلك البطون قاموا فتميل بهم بطونهم فيصرعون ثم يقوم أحدهم فيميل به بطنه فيصرع فلا يستطيعون براحا حتى يغشاهم آل فرعون فيطئونهم مقبلين ومدبرين فذلك عذابهم في البرزخ بين الدنيا والآخرة وآل فرعون يقولون اللهم لا تقم الساعة أبدا ، فإن الله تعالى يقول : ويوم تقوم الساعة أدخلوا آل فرعون أشد العذاب - قلت - يا جبريل من هؤلاء ؟ قال : ( هؤلاء الذين يأكلون الربا لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس ) . والمس : الجنون ، وكذلك الأولق والألس والرود .\nالثالثة عشرة : ذلك بأنهم قالوا إنما البيع مثل الربا معناه عند جميع المتأولين في الكفار ، ولهم قيل : فله ما سلف ولا يقال ذلك لمؤمن عاص بل ينقض بيعه ، ويرد فعله وإن كان جاهلا ، فلذلك قال صلى الله عليه وسلم : من عمل عملا ليس عليه أمرنا فهو رد . لكن قد يأخذ العصاة في الربا بطرف من وعيد هذه الآية .\nالرابعة عشرة : إنما البيع مثل الربا أي إنما الزيادة عند حلول الأجل آخرا كمثل أصل الثمن في أول العقد ، وذلك أن العرب كانت لا تعرف ربا إلا ذلك ، فكانت إذا حل دينها قالت للغريم : إما أن تقضي وإما أن تربي ، أي تزيد في الدين . فحرم الله سبحانه ذلك ورد عليهم قولهم بقوله الحق : وأحل الله البيع وحرم الربا وأوضح أن الأجل إذا حل ولم يكن عنده ما يؤدي أنظر إلى الميسرة . وهذا الربا هو الذي نسخه النبي صلى الله عليه وسلم بقوله يوم عرفة لما قال : ألا إن كل ربا موضوع وإن أول ربا أضعه ربانا ربا عباس بن عبد المطلب فإنه موضوع كله . فبدأ صلى الله عليه وسلم بعمه وأخص الناس به . وهذا من سنن العدل للإمام أن يفيض العدل على نفسه وخاصته فيستفيض حينئذ في الناس .\nالخامسة عشرة : : قوله تعالى : وأحل الله البيع هذا من عموم القرآن ، والألف واللام للجنس لا للعهد إذ لم يتقدم بيع مذكور يرجع إليه ، كما قال تعالى : والعصر إن الإنسان لفي خسر ثم استثنى إلا الذين آمنوا وعملوا الصالحات . وإذا ثبت أن البيع عام فهو مخصص بما ذكرناه من الربا وغير ذلك مما نهي عنه ومنع العقد عليه ، كالخمر والميتة وحبل الحبلة وغير ذلك مما هو ثابت في السنة وإجماع الأمة النهي عنه . ونظيره فاقتلوا المشركين وسائر الظواهر التي تقتضي العمومات ويدخلها التخصيص وهذا مذهب أكثر الفقهاء . وقال بعضهم : هو من مجمل القرآن الذي فسر بالمحلل من البيع وبالمحرم فلا يمكن أن يستعمل في إحلال البيع وتحريمه إلا أن يقترن به بيان من سنة الرسول صلى الله عليه وسلم ، وإن دل على إباحة البيوع في الجملة دون التفصيل . وهذا فرق ما بين العموم والمجمل . ، فالعموم يدل على إباحة البيوع في الجملة ، والتفصيل ما لم يخص بدليل . والمجمل لا يدل على إباحتها في التفصيل حتى يقترن به بيان . والأول أصح . والله أعلم .\nالسادسة عشرة : البيع في اللغة مصدر باع كذا بكذا ، أي دفع عوضا وأخذ معوضا . وهو يقتضي بائعا وهو المالك أو من ينزل منزلته ، ومبتاعا وهو الذي يبذل الثمن ، ومبيعا وهو المثمون وهو الذي يبذل في مقابلته الثمن . وعلى هذا فأركان البيع أربعة : البائع والمبتاع والثمن والمثمن . ثم المعاوضة عند العرب تختلف بحسب اختلاف ما يضاف إليه ، فإن كان أحد المعوضين في مقابلة الرقبة سمي بيعا ، وإن كان في مقابلة منفعة رقبة فإن كانت منفعة بضع سمي نكاحا ، وإن كانت منفعة غيرها سمي إجارة ، وإن كان عينا بعين فهو بيع النقد وهو الصرف ، وإن كان بدين مؤجل فهو السلم ، وسيأتي بيانه في آية الدين . وقد مضى حكم الصرف ، ويأتي حكم الإجارة في \" القصص \" وحكم المهر في النكاح في ( النساء ) كل في موضعه إن شاء الله تعالى .\nالسابعة عشرة : البيع قبول وإيجاب يقع باللفظ المستقبل والماضي ، فالماضي فيه حقيقة والمستقبل كناية ، ويقع بالصريح والكناية المفهوم منها نقل الملك . فسواء قال : بعتك هذه السلعة بعشرة فقال : اشتريتها ، أو قال المشتري : اشتريتها وقال البائع : بعتكها ، أو قال البائع : أنا أبيعك بعشرة فقال المشتري : أنا أشتري أو قد اشتريت ، وكذلك لو قال : خذها بعشرة أو أعطيتكها أو دونكها أو بورك لك فيها بعشرة أو سلمتها إليك - وهما يريدان البيع - فذلك كله بيع لازم . ولو قال البائع : بعتك بعشرة ثم رجع قبل أن يقبل المشتري فقد قال : ليس له أن يرجع حتى يسمع قبول المشتري أو رده ؛ لأنه قد بذل ذلك من نفسه وأوجبه عليها ، وقد قال ذلك له ؛ لأن العقد لم يتم عليه . ولو قال البائع : كنت لاعبا ، فقد اختلفت الرواية عنه ، فقال مرة : يلزمه البيع ولا يلتفت إلى قوله وقال مرة : ينظر إلى قيمة السلعة . فإن كان الثمن يشبه قيمتها فالبيع لازم ، وإن كان متفاوتا كعبد بدرهم ودار بدينار ، علم أنه لم يرد به البيع ، وإنما كان هازلا فلم يلزمه .\nالثامنة عشرة : قوله تعالى : وحرم الربا الألف واللام هنا للعهد ، وهو ما كانت العرب تفعله كما بيناه ، ثم تتناول ما حرمه رسول الله صلى الله عليه وسلم ونهى عنه من البيع الذي يدخله الربا وما في معناه من البيوع المنهي عنها .\nالتاسعة عشرة : عقد الربا مفسوخ لا يجوز بحال ، لما رواه الأئمة واللفظ لمسلم عن أبي سعيد الخدري قال : جاء بلال بتمر برني فقال له رسول الله صلى الله عليه وسلم : ( من أين هذا ) ؟ فقال بلال : من تمر كان عندنا رديء ، فبعت منه صاعين بصاع لمطعم النبي صلى الله عليه وسلم ، فقال رسول الله صلى الله عليه وسلم عند ذلك : أوه عين الربا لا تفعل ولكن إذا أردت أن تشتري التمر فبعه ببيع آخر ثم اشتر به وفي رواية ( هذا الربا فردوه ثم بيعوا تمرنا واشتروا لنا من هذا ) . قال علماؤنا : فقوله ( أوه عين الربا ) أي هو الربا المحرم نفسه لا ما يشبهه . وقوله : ( فردوه ) يدل على وجوب فسخ صفقة الربا وأنها لا تصح بوجه ، وهو قول الجمهور ، خلافا لأبي حنيفة حيث يقول : إن بيع الربا جائز بأصله من حيث هو بيع ، ممنوع بوصفه من حيث هو ربا ، فيسقط الربا ويصح البيع . ولو كان على ما ذكر لما فسخ النبي صلى الله عليه وسلم هذه الصفقة ، ولأمره برد الزيادة على الصاع ولصحح الصفقة في مقابلة الصاع .\nالموفية عشرين : كل ما كان من حرام بين ففسخ فعلى المبتاع رد السلعة بعينها . فإن تلفت بيده رد القيمة فيما له القيمة ، وذلك كالعقار والعروض والحيوان ، والمثل فيما له مثل من موزون أو مكيل من طعام أو عرض . قال مالك : يرد الحرام البين فات أو لم يفت ، وما كان مما كره الناس رد إلا أن يفوت فيترك .\nالحادية والعشرون : قوله تعالى : فمن جاءه موعظة من ربه قال جعفر بن محمد الصادق رحمهما الله : حرم الله الربا ليتقارض الناس . وعن ابن مسعود عن النبي صلى الله عليه وسلم قال : قرض مرتين يعدل صدقة مرة أخرجه البزار ، وقد تقدم هذا المعنى مستوفى . وقال بعض الناس : حرمه الله لأنه متلفة للأموال مهلكة للناس . وسقطت علامة التأنيث في قوله تعالى : ( فمن جاءه ) لأن تأنيث \" الموعظة \" غير حقيقي وهو بمعنى وعظ . وقرأ الحسن \" فمن جاءته \" بإثبات العلامة .\nهذه الآية تلتها عائشة لما أخبرت بفعل زيد بن أرقم . روى الدارقطني عن العالية بنت أنفع قالت : خرجت أنا وأم محبة إلى مكة فدخلنا على عائشة رضي الله عنها فسلمنا عليها ، فقالت لنا : ممن أنتن ؟ قلنا من أهل الكوفة ، قالت : فكأنها أعرضت عنا ، فقالت لها أم محبة : يا أم المؤمنين! كانت لي جارية وإني بعتها من زيد بن أرقم الأنصاري بثمانمائة درهم إلى عطائه وإنه أراد بيعها فابتعتها منه بستمائة درهم نقدا . قالت : فأقبلت علينا فقالت : بئسما شريت وما اشتريت! فأبلغي زيدا أنه قد أبطل جهاده مع رسول الله صلى الله عليه وسلم إلا أن يتوب . فقالت لها : أرأيت إن لم آخذ منه إلا رأس مالي ؟ قالت : فمن جاءه موعظة من ربه فانتهى فله ما سلف . العالية هي زوج أبي إسحاق الهمداني الكوفي السبيعي أم يونس بن أبي إسحاق . وهذا الحديث أخرجه مالك من رواية ابن وهب عنه في بيوع الآجال ، فإن كان منها ما يؤدي إلى الوقوع في المحظور منع منه وإن كان ظاهره بيعا جائزا . وخالف مالكا في هذا الأصل جمهور الفقهاء وقالوا : الأحكام مبنية على الظاهر لا على الظنون . ودليلنا القول بسد الذرائع ، فإن سلم وإلا استدللنا على صحته . وقد تقدم . وهذا الحديث نص ولا تقول عائشة ( أبلغي زيدا أنه قد أبطل جهاده إلا أن يتوب ) إلا بتوقيف ، إذ مثله لا يقال بالرأي فإن إبطال الأعمال لا يتوصل إلى معرفتها إلا بالوحي كما تقدم . وفي صحيح مسلم عن النعمان بن بشير قال : سمعت رسول الله صلى الله عليه وسلم يقول : إن الحلال بين والحرام بين وبينهما أمور مشتبهات لا يعلمهن كثير من الناس فمن اتقى الشبهات استبرأ لدينه وعرضه ومن وقع في الشبهات وقع في الحرام كالراعي يرعى ، حول الحمى يوشك أن يوقع فيه ألا وإن لكل ملك حمى ألا وإن حمى الله محارمه . وجه دلالته أنه منع من الإقدام على المتشابهات مخافة الوقوع في المحرمات وذلك سد للذريعة . وقال صلى الله عليه وسلم : إن من الكبائر شتم الرجل والديه قالوا : وكيف يشتم الرجل والديه ؟ قال : يسب أبا الرجل فيسب أباه ويسب أمه فيسب أمه . فجعل التعريض لسب الآباء كسب الآباء . ولعن صلى الله عليه وسلم اليهود إذ أكلوا ثمن ما نهوا عن أكله . وقال أبو بكر في كتابه : لا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة . ونهى ابن عباس عن دراهم بدراهم بينهما جريرة . واتفق العلماء على منع الجمع بين بيع وسلف ، وعلى تحريم قليل الخمر وإن كان لا يسكر ، وعلى تحريم الخلوة بالأجنبية وإن كان عنينا ، وعلى تحريم النظر إلى وجه المرأة الشابة إلى غير ذلك مما يكثر ويعلم على القطع والثبات أن الشرع حكم فيها بالمنع ؛ لأنها ذرائع المحرمات . والربا أحق ما حميت مراتعه وسدت طرائقه ، ومن أباح هذه الأسباب فليبح حفر البئر ونصب الحبالات لهلاك المسلمين والمسلمات ، وذلك لا يقوله أحد . وأيضا فقد اتفقنا على منع من باع بالعينة إذا عرف بذلك وكانت عادته ، وهي في معنى هذا الباب . والله الموفق للصواب .\nالثانية والعشرون : روى أبو داود عن ابن عمر قال : سمعت رسول الله صلى الله عليه وسلم يقول : إذا تبايعتم بالعينة وأخذتم أذناب البقر ورضيتم بالزرع وتركتم الجهاد سلط الله عليكم ذلا لا ينزعه عنكم حتى ترجعوا إلى دينكم . في إسناده أبو عبد الرحمن الخراساني . ليس بمشهور . وفسر أبو عبيد الهروي العينة فقال : هي أن يبيع من رجل سلعة بثمن معلوم إلى أجل مسمى ، ثم يشتريها منه بأقل من الثمن الذي باعها به . قال : فإن اشترى بحضرة طالب العينة سلعة من آخر بثمن معلوم وقبضها ثم باعها من طالب العينة بثمن أكثر مما اشتراه إلى أجل مسمى ، ثم باعها المشتري من البائع الأول بالنقد بأقل من الثمن ، فهذه أيضا عينة ، وهي أهون من الأولى ، وهو جائز عند بعضهم . وسميت عينة لحضور النقد لصاحب العينة ، وذلك أن العين هو المال الحاضر والمشتري إنما يشتريها ليبيعها بعين حاضر يصل إليه من فوره .\nالثالثة والعشرون : قال علماؤنا : فمن باع سلعة بثمن إلى أجل ثم ابتاعها بثمن من جنس الثمن الذي باعها به ، فلا يخلو أن يشتريها منه بنقد ، أو إلى أجل دون الأجل الذي باعها إليه ، أو إلى أبعد منه ، بمثل الثمن أو بأقل منه أو بأكثر ، فهذه ثلاث مسائل : وأما الأولى والثانية فإن كان بمثل الثمن أو أكثر جاز ، ولا يجوز بأقل على مقتضى حديث عائشة ؛ لأنه أعطى ستمائة ليأخذ ثمانمائة والسلعة لغو ، وهذا هو الربا بعينه . وأما الثالثة إلى أبعد من الأجل ، فإن كان اشتراها وحدها أو زيادة فيجوز بمثل الثمن أو أقل منه ، ولا يجوز بأكثر ، فإن اشترى بعضها فلا يجوز على كل حال لا بمثل الثمن ولا بأقل ولا بأكثر . ومسائل هذا الباب حصرها علماؤنا في سبع وعشرين مسألة ، ومدارها على ما ذكرناه فاعلم .\nالرابعة والعشرون : فله ما سلف أي من أمر الربا لا تباعة عليه منه في الدنيا ولا في الآخرة ، قاله السدي وغيره . وهذا حكم من الله تعالى لمن أسلم من كفار قريش وثقيف ومن كان يتجر هنالك . وسلف : معناه تقدم في الزمن وانقضى .\nالخامسة والعشرون : قوله تعالى : وأمره إلى الله فيه أربع تأويلات : أحدها أن الضمير عائد إلى الربا ، بمعنى وأمر الربا إلى الله في إمرار تحريمه أو غير ذلك . والآخر أن يكون الضمير عائدا على ما سلف أي أمره إلى الله تعالى في العفو عنه وإسقاط التبعة فيه . والثالث أن يكون الضمير عائدا على ذي الربا ، بمعنى أمره إلى الله في أن يثبته على الانتهاء أو يعيده إلى المعصية في الربا . واختار هذا القول النحاس ، قال : وهذا قول حسن بين ، أي وأمره إلى الله في المستقبل إن شاء ثبته على التحريم وإن شاء أباحه . والرابع أن يعود الضمير على المنتهى ، ولكن بمعنى التأنيس له وبسط أمله في الخير ، كما تقول : وأمره إلى طاعة وخير ، وكما تقول : وأمره في نمو وإقبال إلى الله تعالى وإلى طاعته .\nالسادسة والعشرون : ومن عاد يعني إلى فعل الربا حتى يموت ، قاله سفيان . وقال غيره : من عاد فقال إنما البيع مثل الربا فقد كفر . قال ابن عطية : إن قدرنا الآية في كافر فالخلود خلود تأبيد حقيقي ، وإن لحظناها في مسلم عاص فهذا خلود مستعار على معنى المبالغة ، كما تقول العرب : ملك خالد ، عبارة عن دوام ما لا يبقى على التأبيد الحقيقي .\n                                    ",
        "saadi": "ٱلَّذِينَ يَأۡكُلُونَ ٱلرِّبَوٰاْ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيۡطَٰنُ مِنَ ٱلۡمَسِّۚ ذَٰلِكَ بِأَنَّهُمۡ قَالُوٓاْ إِنَّمَا ٱلۡبَيۡعُ مِثۡلُ ٱلرِّبَوٰاْۗ وَأَحَلَّ ٱللَّهُ ٱلۡبَيۡعَ وَحَرَّمَ ٱلرِّبَوٰاْۚ فَمَن جَآءَهُۥ مَوۡعِظَةٞ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمۡرُهُۥٓ إِلَى ٱللَّهِۖ وَمَنۡ عَادَ فَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥٧٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن أكلة الربا وسوء مآلهم وشدة منقلبهم، أنهم لا يقومون من قبورهم ليوم نشورهم { إلا كما يقوم الذي يتخبطه الشيطان من المس } أي: يصرعه الشيطان بالجنون، فيقومون من قبورهم حيارى سكارى مضطربين، متوقعين لعظيم النكال وعسر الوبال، فكما تقلبت عقولهم و { قالوا إنما البيع مثل الربا } وهذا لا يكون إلا من جاهل عظيم جهله، أو متجاهل عظيم عناده، جازاهم الله من جنس أحوالهم فصارت أحوالهم أحوال المجانين، ويحتمل أن يكون قوله: { لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس } أنه لما انسلبت عقولهم في طلب المكاسب الربوية خفت أحلامهم وضعفت آراؤهم، وصاروا في هيئتهم وحركاتهم يشبهون المجانين في عدم انتظامها وانسلاخ العقل الأدبي عنهم، قال الله تعالى رادا عليهم ومبينا حكمته العظيمة { وأحل الله البيع } أي: لما فيه من عموم المصلحة وشدة الحاجة وحصول الضرر بتحريمه، وهذا أصل في حل جميع أنواع التصرفات الكسبية حتى يرد ما يدل على المنع { وحرم الربا } لما فيه من الظلم وسوء العاقبة، والربا نوعان: ربا نسيئة كبيع الربا بما يشاركه في العلة نسيئة، ومنه جعل ما في الذمة رأس مال، سلم، وربا فضل، وهو بيع ما يجري فيه الربا بجنسه متفاضلا، وكلاهما محرم بالكتاب والسنة، والإجماع على ربا النسيئة، وشذ من أباح ربا الفضل وخالف النصوص المستفيضة، بل الربا من كبائر الذنوب وموبقاتها { فمن جاءه موعظة من ربه } أي: وعظ وتذكير وترهيب عن تعاطي الربا على يد من قيضه الله لموعظته رحمة من الله بالموعوظ، وإقامة للحجة عليه { فانتهى } عن فعله وانزجر عن تعاطيه { فله ما سلف } أي: ما تقدم من المعاملات التي فعلها قبل أن تبلغه الموعظة جزاء لقبوله للنصيحة، دل مفهوم الآية أن من لم ينته جوزي بالأول والآخر { وأمره إلى الله } في مجازاته وفيما يستقبل من أموره { ومن عاد } إلى تعاطي الربا ولم تنفعه الموعظة، بل أصر على ذلك { فأولئك أصحاب النار هم فيها خالدون } اختلف العلماء رحمهم الله في نصوص الوعيد التي ظاهرها تخليد أهل الكبائر من الذنوب التي دون الشرك بالله، والأحسن فيها أن يقال هذه الأمور التي رتب الله عليها الخلود في النار موجبات ومقتضيات لذلك، ولكن الموجب إن لم يوجد ما يمنعه ترتب عليه مقتضاه، وقد علم بالكتاب والسنة وإجماع سلف الأمة أن التوحيد والإيمان مانع من الخلود في النار، فلولا ما مع الإنسان من التوحيد لصار عمله صالحا للخلود فيها بقطع النظر عن كفره.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَأۡكُلُونَ ٱلرِّبَوٰاْ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيۡطَٰنُ مِنَ ٱلۡمَسِّۚ ذَٰلِكَ بِأَنَّهُمۡ قَالُوٓاْ إِنَّمَا ٱلۡبَيۡعُ مِثۡلُ ٱلرِّبَوٰاْۗ وَأَحَلَّ ٱللَّهُ ٱلۡبَيۡعَ وَحَرَّمَ ٱلرِّبَوٰاْۚ فَمَن جَآءَهُۥ مَوۡعِظَةٞ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمۡرُهُۥٓ إِلَى ٱللَّهِۖ وَمَنۡ عَادَ فَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ ٥٧٢"
    },
    {
      "number": 283,
      "text": "يَمْحَقُ اللَّهُ الرِّبَا وَيُرْبِي الصَّدَقَاتِ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 276,
      "juz": 3,
      "manzil": 1,
      "page": 47,
      "ruku": 39,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَمۡحَقُ ٱللَّهُ ٱلرِّبَوٰاْ وَيُرۡبِي ٱلصَّدَقَٰتِۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ ٦٧٢\n                                        \n                                        \n                                        يخبر الله تعالى أنه يمحق الربا ، أي : يذهبه ، إما بأن يذهبه بالكلية من يد صاحبه ، أو يحرمه بركة ماله فلا ينتفع به ، بل يعذبه به في الدنيا ويعاقبه عليه يوم القيامة . كما قال تعالى : ( قل لا يستوي الخبيث والطيب ولو أعجبك كثرة الخبيث ) [ المائدة : 100 ] ، وقال تعالى : ( ويجعل الخبيث بعضه على بعض فيركمه جميعا فيجعله في جهنم ) [ الأنفال : 37 ] ، وقال : ( وما آتيتم من ربا ليربو في أموال الناس فلا يربو عند الله ) [ الآية ] [ الروم : 39 ] .\nوقال ابن جرير : في قوله : ( يمحق الله الربا ) وهذا نظير الخبر الذي روي عن عبد الله بن مسعود ، عن النبي صلى الله عليه وسلم ، أنه قال : \" الربا وإن كثر فإلى قل \" .\nوهذا الحديث قد رواه الإمام أحمد في مسنده ، فقال : حدثنا حجاج [ قال ] حدثنا شريك عن الركين بن الربيع [ بن عميلة الفزاري ] عن أبيه ، عن ابن مسعود ، عن النبي صلى الله عليه وسلم قال : \" إن الربا وإن كثر فإن عاقبته تصير إلى قل \" وقد رواه ابن ماجه ، عن العباس بن جعفر ، عن عمرو بن عون ، عن يحيى بن أبي زائدة ، عن إسرائيل ، عن الركين بن الربيع بن عميلة الفزاري ، عن أبيه ، عن ابن مسعود ، عن رسول الله صلى الله عليه وسلم أنه قال : \" ما أحد أكثر من الربا إلا كان عاقبة أمره إلى قلة \" .\nوهذا من باب المعاملة بنقيض المقصود ، كما قال الإمام أحمد : حدثنا أبو سعيد مولى بني هاشم ، حدثنا الهيثم بن رافع الطاطري ، حدثني أبو يحيى رجل من أهل مكة عن فروخ مولى عثمان : أن عمر وهو يومئذ أمير المؤمنين خرج إلى المسجد ، فرأى طعاما منثورا . فقال : ما هذا الطعام ؟ فقالوا : طعام جلب إلينا . قال : بارك الله فيه وفيمن جلبه . قيل : يا أمير المؤمنين ، إنه قد احتكر . قال : ومن احتكره ؟ قالوا : فروخ مولى عثمان ، وفلان مولى عمر . فأرسل إليهما فدعاهما فقال : ما حملكما على احتكار طعام المسلمين ؟ قالا : يا أمير المؤمنين ، نشتري بأموالنا ونبيع ! ! فقال عمر : سمعت رسول الله صلى الله عليه وسلم يقول : \" من احتكر على المسلمين طعامهم ضربه الله بالإفلاس أو بجذام \" . فقال فروخ عند ذلك : أعاهد الله وأعاهدك ألا أعود في طعام أبدا . وأما مولى عمر فقال : إنما نشتري بأموالنا ونبيع . قال أبو يحيى : فلقد رأيت مولى عمر مجذوما .\nورواه ابن ماجه من حديث الهيثم بن رافع ، به . ولفظه : \" من احتكر على المسلمين طعامهم ضربه الله بالجذام والإفلاس \" .\nوقوله : ( ويربي الصدقات ) قرئ بضم الياء والتخفيف ، من \" ربا الشيء يربو \" و \" أرباه يربيه \"\nأي : كثره ونماه ينميه . وقرئ : \" ويربي \" بالضم والتشديد ، من التربية ، كما قال البخاري : حدثنا عبد الله بن منير ، سمع أبا النضر ، حدثنا عبد الرحمن بن عبد الله بن دينار ، عن أبيه ، عن أبي صالح ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" من تصدق بعدل تمرة من كسب طيب ، ولا يقبل الله إلا الطيب ، وإن الله ليقبلها بيمينه ، ثم يربيها لصاحبه كما يربي أحدكم فلوه ، حتى يكون مثل الجبل \" .\nكذا رواه في كتاب الزكاة . وقال في كتاب التوحيد : وقال خالد بن مخلد ، عن سليمان بن بلال ، عن عبد الله بن دينار ، فذكر بإسناده ، نحوه .\nوقد رواه مسلم في الزكاة عن أحمد بن عثمان بن حكيم ، عن خالد بن مخلد ، فذكره . قال البخاري : ورواه مسلم بن أبي مريم ، وزيد بن أسلم ، وسهيل ، عن أبي صالح ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم .\nقلت : أما رواية مسلم بن أبي مريم : فقد تفرد البخاري بذكرها ، وأما طريق زيد بن أسلم : فرواها مسلم في صحيحه ، عن أبي الطاهر بن السرح ، عن ابن وهب ، عن هشام بن سعد ، عن زيد بن أسلم ، به . وأما حديث سهيل فرواه مسلم ، عن قتيبة ، عن يعقوب بن عبد الرحمن ، عن سهيل ، به . والله أعلم .\nقال البخاري : وقال ورقاء عن ابن دينار ، عن سعيد بن يسار عن أبي هريرة ، عن النبي صلى الله عليه وسلم .\nوقد أسند هذا الحديث من هذا الوجه الحافظ أبو بكر البيهقي ، عن الحاكم وغيره ، عن الأصم ، عن العباس المروزي عن أبي النضر هاشم بن القاسم ، عن ورقاء وهو ابن عمر اليشكري عن عبد الله بن دينار ، عن سعيد بن يسار عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم : \" من تصدق بعدل تمرة من كسب طيب ، ولا يصعد إلى الله إلا الطيب ، فإن الله يقبلها بيمينه ، فيربيها لصاحبها ، كما يربي أحدكم فلوه ، حتى تكون مثل أحد \" .\nوهكذا روى هذا الحديث مسلم ، والترمذي ، والنسائي جميعا ، عن قتيبة ، عن الليث بن سعد ، عن سعيد المقبري . وأخرجه النسائي من رواية مالك ، عن يحيى بن سعيد الأنصاري ومن طريق يحيى القطان ، عن محمد بن عجلان ، ثلاثتهم عن سعيد بن يسار أبي الحباب المدني ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم ، فذكره .\nوقد روي عن أبي هريرة من وجه آخر ، فقال ابن أبي حاتم : حدثنا عمرو بن عبد الله الأودي ، حدثنا وكيع ، عن عباد بن منصور ، حدثنا القاسم بن محمد قال : سمعت أبا هريرة يقول : قال رسول الله صلى الله عليه وسلم : \" إن الله عز وجل يقبل الصدقة ويأخذها بيمينه ، فيربيها لأحدكم كما يربي أحدكم مهره أو فلوه حتى إن اللقمة لتصير مثل أحد \" . وتصديق ذلك في كتاب الله : ( يمحق الله الربا ويربي الصدقات ) .\nوكذا رواه أحمد ، عن وكيع ، وهو في تفسير وكيع . ورواه الترمذي ، عن أبي كريب ، عن وكيع ، به وقال : حسن صحيح ، وكذا رواه الثوري عن عباد بن منصور ، به . ورواه أحمد أيضا ، عن خلف بن الوليد ، عن ابن المبارك ، عن عبد الواحد بن ضمرة وعباد بن منصور كلاهما عن أبي نضرة ، عن القاسم ، به .\nوقد رواه ابن جرير ، عن محمد بن عبد الملك بن إسحاق عن عبد الرزاق ، عن معمر ، عن أيوب ، عن القاسم بن محمد ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" إن العبد إذا تصدق من طيب ، يقبلها الله منه ، فيأخذها بيمينه ، ويربيها كما يربي أحدكم مهره أو فصيله ، وإن الرجل ليتصدق باللقمة فتربو في يد الله أو قال : في كف الله حتى تكون مثل أحد ، فتصدقوا \" .\nوهكذا رواه أحمد ، عن عبد الرزاق . وهذا طريق غريب صحيح الإسناد ، ولكن لفظه عجيب ، والمحفوظ ما تقدم . وروي عن عائشة أم المؤمنين ، فقال الإمام أحمد :\nحدثنا عبد الصمد ، حدثنا حماد ، عن ثابت ، عن القاسم بن محمد ، عن عائشة أن رسول الله صلى الله عليه وسلم قال : \" إن الله ليربي لأحدكم التمرة واللقمة ، كما يربي أحدكم فلوه أو فصيله ، حتى يكون مثل أحد \" . تفرد به أحمد من هذا الوجه .\nوقال البزار : حدثنا يحيى بن المعلى بن منصور ، حدثنا إسماعيل ، حدثني أبي ، عن يحيى بن سعيد ، عن عمرة ، عن عائشة ، عن النبي صلى الله عليه وسلم ، وعن الضحاك بن عثمان ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم قال : \" إن الرجل ليتصدق بالصدقة من الكسب الطيب ، ولا يقبل الله إلا الطيب ، فيتلقاها الرحمن بيده فيربيها ، كما يربي أحدكم فلوه أو وصيفه أو قال : فصيله \" ثم قال : لا نعلم أحدا رواه عن يحيى بن سعيد بن عمرة إلا أبو أويس .\nوقوله : ( والله لا يحب كل كفار أثيم ) أي : لا يحب كفور القلب أثيم القول والفعل ، ولا بد من مناسبة في ختم هذه الآية بهذه الصفة ، وهي أن المرابي لا يرضى بما قسم الله له من الحلال ، ولا يكتفي بما شرع له من التكسب المباح ، فهو يسعى في أكل أموال الناس بالباطل ، بأنواع المكاسب\nالخبيثة ، فهو جحود لما عليه من النعمة ، ظلوم آثم بأكل أموال الناس بالباطل .\n                                    ",
        "qortoby": "يَمۡحَقُ ٱللَّهُ ٱلرِّبَوٰاْ وَيُرۡبِي ٱلصَّدَقَٰتِۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ ٦٧٢\n                                        \n                                        \n                                        قوله تعالى : يمحق الله الربا يعني في الدنيا أي يذهب بركته وإن كان كثيرا . روى ابن مسعود عن النبي صلى الله عليه وسلم أنه قال : إن الربا وإن كثر فعاقبته إلى قل . وقيل : يمحق الله الربا يعني في الآخرة . وعن ابن عباس في قوله تعالى : يمحق الله الربا قال : لا يقبل منه صدقة ولا حجا ولا جهادا ولا صلة . والمحق : النقص والذهاب ، ومنه محاق القمر وهو انتقاصه .\nويربي الصدقات أي ينميها في الدنيا بالبركة ويكثر ثوابها بالتضعيف في الآخرة . وفي صحيح مسلم : إن صدقة أحدكم لتقع في يد الله فيربيها له كما يربي أحدكم فلوه أو فصيله حتى يجيء يوم القيامة وإن اللقمة لعلى قدر أحد . وقرأ ابن الزبير \" يمحق \" بضم الياء وكسر الحاء مشددة \" يربي \" بفتح الراء وتشديد الباء ، ورويت عن النبي صلى الله عليه وسلم كذلك .\n- قوله تعالى : والله لا يحب كل كفار أثيم ووصف ( كفار ) بأثيم مبالغة ، من حيث اختلف اللفظان . وقيل : لإزالة الاشتراك في ( كفار ) إذ قد يقع على الزارع الذي يستر الحب في الأرض : قاله ابن فورك .\n                                    ",
        "saadi": "يَمۡحَقُ ٱللَّهُ ٱلرِّبَوٰاْ وَيُرۡبِي ٱلصَّدَقَٰتِۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ ٦٧٢\n                                        \n                                        \n                                        \n                                        ثم قال تعالى: { يمحق الله الربا } أي: يذهبه ويذهب بركته ذاتا ووصفا، فيكون سببا لوقوع الآفات فيه ونزع البركة عنه، وإن أنفق منه لم يؤجر عليه بل يكون زادا له إلى النار { ويربي الصدقات } أي: ينميها وينزل البركة في المال الذي أخرجت منه وينمي أجر صاحبها وهذا لأن الجزاء من جنس العمل، فإن المرابي قد ظلم الناس وأخذ أموالهم على وجه غير شرعي، فجوزي بذهاب ماله، والمحسن إليهم بأنواع الإحسان ربه أكرم منه، فيحسن عليه كما أحسن على عباده { والله لا يحب كل كفار } لنعم الله، لا يؤدي ما أوجب عليه من الصدقات، ولا يسلم منه ومن شره عباد الله { أثيم } أي: قد فعل ما هو سبب لإثمه وعقوبته.\n                                    "
      },
      "originalText": "يَمۡحَقُ ٱللَّهُ ٱلرِّبَوٰاْ وَيُرۡبِي ٱلصَّدَقَٰتِۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ ٦٧٢"
    },
    {
      "number": 284,
      "text": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ لَهُمْ أَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 277,
      "juz": 3,
      "manzil": 1,
      "page": 47,
      "ruku": 39,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٧٧٢\n                                        \n                                        \n                                        ثم قال تعالى مادحا للمؤمنين بربهم ، المطيعين أمره ، المؤدين شكره ، المحسنين إلى خلقه في إقامة الصلاة وإيتاء الزكاة ، مخبرا عما أعد لهم من الكرامة ، وأنهم يوم القيامة من التبعات آمنون ، فقال : ( إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون )\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٧٧٢\n                                        \n                                        \n                                        وقد تقدم القول في قوله تعالى : إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة وخص الصلاة والزكاة بالذكر وقد تضمنها عمل الصالحات تشريفا لهما وتنبيها على قدرهما إذ هما رأس الأعمال ؛ الصلاة في أعمال البدن ، والزكاة في أعمال المال .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٧٧٢\n                                        \n                                        \n                                        \n                                        لما ذكر أكلة الربا وكان من المعلوم أنهم لو كانوا مؤمنين إيمانا ينفعهم لم يصدر منهم ما صدر ذكر حالة المؤمنين وأجرهم، وخاطبهم بالإيمان، ونهاهم عن أكل الربا إن كانوا مؤمنين\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ ٧٧٢"
    },
    {
      "number": 285,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَذَرُوا مَا بَقِيَ مِنَ الرِّبَا إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 278,
      "juz": 3,
      "manzil": 1,
      "page": 47,
      "ruku": 39,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَذَرُواْ مَا بَقِيَ مِنَ ٱلرِّبَوٰٓاْ إِن كُنتُم مُّؤۡمِنِينَ ٨٧٢\n                                        \n                                        \n                                        يقول تعالى آمرا عباده المؤمنين بتقواه ، ناهيا لهم عما يقربهم إلى سخطه ويبعدهم عن رضاه ، فقال : ( يا أيها الذين آمنوا اتقوا الله ) أي : خافوه وراقبوه فيما تفعلون ( وذروا ما بقي من الربا ) أي : اتركوا ما لكم على الناس من الزيادة على رؤوس الأموال ، بعد هذا الإنذار ( إن كنتم مؤمنين ) أي : بما شرع الله لكم من تحليل البيع ، وتحريم الربا وغير ذلك .\nوقد ذكر زيد بن أسلم ، وابن جريج ، ومقاتل بن حيان ، والسدي : أن هذا السياق نزل في بني عمرو بن عمير من ثقيف ، وبني المغيرة من بني مخزوم ، كان بينهم ربا في الجاهلية ، فلما جاء الإسلام ودخلوا فيه ، طلبت ثقيف أن تأخذه منهم ، فتشاوروا وقالت بنو المغيرة : لا نؤدي الربا في الإسلام . فكتب في ذلك عتاب بن أسيد نائب مكة إلى رسول الله صلى الله عليه وسلم ، فنزلت هذه الآية فكتب بها رسول الله صلى الله عليه وسلم إليه : ( ياأيها الذين آمنوا اتقوا الله وذروا ما بقي من الربا إن كنتم مؤمنين فإن لم تفعلوا فأذنوا بحرب من الله ورسوله ) فقالوا : نتوب إلى الله ، ونذر ما بقي من الربا ، فتركوه كلهم .\nوهذا تهديد شديد ووعيد أكيد ، لمن استمر على تعاطي الربا بعد الإنذار ، قال ابن جريج : قال ابن عباس : ( فأذنوا بحرب ) أي : استيقنوا بحرب من الله ورسوله .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَذَرُواْ مَا بَقِيَ مِنَ ٱلرِّبَوٰٓاْ إِن كُنتُم مُّؤۡمِنِينَ ٨٧٢\n                                        \n                                        \n                                        يا أيها الذين آمنوا اتقوا الله وذروا ما بقي من الربا إن كنتم مؤمنين ظاهره أنه أبطل من الربا ما لم يكن مقبوضا وإن كان معقودا قبل نزول آية التحريم ، ولا يتعقب بالفسخ ما كان مقبوضا . وقد قيل : إن الآية نزلت بسبب ثقيف ، وكانوا عاهدوا النبي صلى الله عليه وسلم على أن ما لهم من الربا على الناس فهو لهم ، وما للناس عليهم فهو موضوع عنهم ، فلما أن جاءت آجال رباهم بعثوا إلى مكة للاقتضاء ، وكانت الديون لبني عبدة وهم بنو عمرو بن عمير من ثقيف ، وكانت على بني المغيرة المخزوميين . فقال بنو المغيرة : لا نعطي شيئا فإن الربا قد رفع ورفعوا أمرهم إلى عتاب بن أسيد ، فكتب به إلى رسول الله صلى الله عليه وسلم ، ونزلت الآية فكتب بها رسول الله صلى الله عليه وسلم إلى عتاب ، فعلمت بها ثقيف فكفت . هذا سبب الآية على اختصار مجموع ما روى ابن إسحاق وابن جريج والسدي وغيرهم . والمعنى اجعلوا بينكم وبين عذاب الله وقاية بترككم ما بقي لكم من الربا وصفحكم عنه .\n- قوله تعالى : \" إن كنتم مؤمنين \" شرط محض في ثقيف على بابه لأنه كان في أول دخولهم في الإسلام . وإذا قدرنا الآية فيمن قد تقرر إيمانه فهو شرط مجازي على جهة المبالغة ، كما تقول لمن تريد إقامة نفسه : إن كنت رجلا فافعل كذا . وحكى النقاش عن مقاتل بن سليمان أنه قال : إن \" إن \" في هذه الآية بمعنى \" إذ \" . قال ابن عطية : وهذا مردود لا يعرف في اللغة . وقال ابن فورك : يحتمل أن يريد يا أيها الذين آمنوا بمن قبل محمد عليه السلام من الأنبياء ذروا ما بقي من الربا إن كنتم مؤمنين بمحمد صلى الله عليه وسلم إذ لا ينفع الأول إلا بهذا . وهذا مردود بما روي في سبب الآية .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَذَرُواْ مَا بَقِيَ مِنَ ٱلرِّبَوٰٓاْ إِن كُنتُم مُّؤۡمِنِينَ ٨٧٢\n                                        \n                                        \n                                        \n                                        لما ذكر أكلة الربا وكان من المعلوم أنهم لو كانوا مؤمنين إيمانا ينفعهم لم يصدر منهم ما صدر ذكر حالة المؤمنين وأجرهم، وخاطبهم بالإيمان، ونهاهم عن أكل الربا إن كانوا مؤمنين، وهؤلاء هم الذين يقبلون موعظة ربهم وينقادون لأمره، وأمرهم أن يتقوه، ومن جملة تقواه أن يذروا ما بقي من الربا أي: المعاملات الحاضرة الموجودة، وأما ما سلف، فمن اتعظ عفا الله عنه ما سلف،\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَذَرُواْ مَا بَقِيَ مِنَ ٱلرِّبَوٰٓاْ إِن كُنتُم مُّؤۡمِنِينَ ٨٧٢"
    },
    {
      "number": 286,
      "text": "فَإِنْ لَمْ تَفْعَلُوا فَأْذَنُوا بِحَرْبٍ مِنَ اللَّهِ وَرَسُولِهِ ۖ وَإِنْ تُبْتُمْ فَلَكُمْ رُءُوسُ أَمْوَالِكُمْ لَا تَظْلِمُونَ وَلَا تُظْلَمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 279,
      "juz": 3,
      "manzil": 1,
      "page": 47,
      "ruku": 39,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِن لَّمۡ تَفۡعَلُواْ فَأۡذَنُواْ بِحَرۡبٖ مِّنَ ٱللَّهِ وَرَسُولِهِۦۖ وَإِن تُبۡتُمۡ فَلَكُمۡ رُءُوسُ أَمۡوَٰلِكُمۡ لَا تَظۡلِمُونَ وَلَا تُظۡلَمُونَ ٩٧٢\n                                        \n                                        \n                                        وتقدم من رواية ربيعة بن كلثوم ، عن أبيه ، عن سعيد بن جبير ، عن ابن عباس قال : يقال يوم القيامة لآكل الربا : خذ سلاحك للحرب .ثم قرأ : ( فإن لم تفعلوا فأذنوا بحرب من الله ورسوله )\nوقال علي بن أبي طلحة ، عن ابن عباس : ( فإن لم تفعلوا فأذنوا بحرب من الله ورسوله ) فمن كان مقيما على الربا لا ينزع عنه فحق على إمام المسلمين أن يستتيبه ، فإن نزع وإلا ضرب عنقه .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا محمد بن بشار ، حدثنا عبد الأعلى ، حدثنا هشام بن حسان ، عن الحسن وابن سيرين ، أنهما قالا : والله إن هؤلاء الصيارفة لأكلة الربا ، وإنهم قد أذنوا بحرب من الله ورسوله ، ولو كان على الناس إمام عادل لاستتابهم ، فإن تابوا وإلا وضع فيهم السلاح . وقال قتادة : أوعدهم الله بالقتل كما تسمعون ، وجعلهم بهرجا أينما أتوا ، فإياكم وما خالط هذه البيوع من الربا ; فإن الله قد أوسع الحلال وأطابه ، فلا تلجئنكم إلى معصيته فاقة . رواه ابن أبي حاتم .\nوقال الربيع بن أنس : أوعد الله آكل الربا بالقتل . رواه ابن جرير .\nوقال السهيلي : ولهذا قالت عائشة لأم محبة ، مولاة زيد بن أرقم ، في مسألة العينة : أخبريه أن جهاده مع رسول الله صلى الله عليه وسلم قد بطل ، إلا أن يتوب ، فخصت الجهاد ; لأنه ضد قوله : ( فأذنوا بحرب من الله ورسوله ) قال : وهذا المعنى ذكره كثير . قال : ولكن هذا إسناده إلى عائشة ضعيف .\nثم قال تعالى : ( وإن تبتم فلكم رءوس أموالكم لا تظلمون ) أي : بأخذ الزيادة ( ولا تظلمون ) أي : بوضع رؤوس الأموال أيضا ، بل لكم ما بذلتم من غير زيادة عليه ولا نقص منه .\nوقال ابن أبي حاتم : حدثنا محمد بن الحسين بن إشكاب ، حدثنا عبيد الله بن موسى ، عن شيبان ، عن شبيب بن غرقدة البارقي ، عن سليمان بن الأحوص عن أبيه قال : خطب رسول الله صلى الله عليه وسلم في حجة الوداع فقال : \" ألا إن كل ربا كان في الجاهلية موضوع عنكم كله ، لكم رؤوس أموالكم لا تظلمون ولا تظلمون ، وأول ربا موضوع ربا العباس بن عبد المطلب ، موضوع كله \" كذا وجدته : سليمان بن الأحوص .\nوقد قال ابن مردويه : حدثنا الشافعي ، حدثنا معاذ بن المثنى ، أخبرنا مسدد ، أخبرنا أبو الأحوص ، حدثنا شبيب بن غرقدة ، عن سليمان بن عمرو ، عن أبيه قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" ألا إن كل ربا من ربا الجاهلية موضوع ، فلكم رؤوس أموالكم لا تظلمون ولا تظلمون \" .\nوكذا رواه من حديث حماد بن سلمة ، عن علي بن زيد ، عن أبي حرة الرقاشي ، عن عمرو هو ابن خارجة فذكره .\n                                    ",
        "qortoby": "فَإِن لَّمۡ تَفۡعَلُواْ فَأۡذَنُواْ بِحَرۡبٖ مِّنَ ٱللَّهِ وَرَسُولِهِۦۖ وَإِن تُبۡتُمۡ فَلَكُمۡ رُءُوسُ أَمۡوَٰلِكُمۡ لَا تَظۡلِمُونَ وَلَا تُظۡلَمُونَ ٩٧٢\n                                        \n                                        \n                                        -فإن لم تفعلوا فأذنوا بحرب من الله ورسوله هذا وعيد إن لم يذروا الربا ، والحرب داعية القتل . وروى ابن عباس أنه يقال يوم القيامة لآكل الربا : خذ سلاحك للحرب . وقال ابن عباس أيضا : من كان مقيما على الربا لا ينزع عنه فحق على إمام المسلمين أن يستتيبه ، فإن نزع وإلا ضرب عنقه . وقال قتادة : أوعد الله أهل الربا بالقتل فجعلهم بهرجا أينما ثقفوا . وقيل : المعنى إن لم تنتهوا فأنتم حرب لله ولرسوله ، أي : أعداء . وقال ابن خويزمنداد : ولو أن أهل بلد اصطلحوا على الربا استحلالا كانوا مرتدين ، والحكم فيهم كالحكم في أهل الردة ، وإن لم يكن ذلك منهم استحلالا جاز للإمام محاربتهم ، ألا ترى أن الله تعالى قد أذن في ذلك فقال : فأذنوا بحرب من الله ورسوله . وقرأ أبو بكر عن عاصم \" فآذنوا \" على معنى فأعلموا غيركم أنكم على حربهم .\n- ذكر ابن بكير قال : جاء رجل إلى مالك بن أنس فقال : يا أبا عبد الله ، إني رأيت رجلا سكرانا يتعاقر يريد أن يأخذ القمر ، فقلت : امرأتي طالق إن كان يدخل جوف ابن آدم أشر من الخمر . فقال : ارجع حتى أنظر في مسألتك . فأتاه من الغد فقال له : ارجع حتى أنظر في مسألتك فأتاه من الغد فقال له : امرأتك طالق ، إني تصفحت كتاب الله وسنة نبيه فلم أر شيئا أشر من الربا ؛ لأن الله أذن فيه بالحرب .\n- دلت هذه الآية على أن أكل الربا والعمل به من الكبائر ، ولا خلاف في ذلك على ما نبينه . وروي عن النبي صلى الله عليه وسلم أنه قال : يأتي على الناس زمان لا يبقى أحد إلا أكل الربا ومن لم يأكل الربا أصابه غباره وروى الدارقطني عن عبد الله بن حنظلة غسيل الملائكة أن النبي صلى الله عليه وسلم قال : لدرهم ربا أشد عند الله تعالى من ست وثلاثين زنية في الخطيئة وروي عنه عليه السلام أنه قال : الربا تسعة وتسعون بابا أدناها كإتيان الرجل بأمه يعني الزنا بأمه . وقال ابن مسعود آكل الربا وموكله وكاتبه وشاهده ملعون على لسان محمد صلى الله عليه وسلم . وروى البخاري عن أبي جحيفة قال : نهى رسول الله صلى الله عليه وسلم عن ثمن الدم وثمن الكلب وكسب البغي ولعن آكل الربا وموكله والواشمة والمستوشمة والمصور . وفي صحيح مسلم عن أبي هريرة أن رسول الله صلى الله عليه وسلم ، قال : اجتنبوا السبع الموبقات . . . - وفيها - وآكل الربا . وفي مصنف أبي داود عن ابن مسعود قال : لعن رسول الله صلى الله عليه وسلم آكل الربا وموكله وكاتبه وشاهده .\n- قوله تعالى : وإن تبتم فلكم رءوس أموالكم الآية . روى أبو داود عن سليمان بن عمرو عن أبيه قال سمعت رسول الله صلى الله عليه وسلم يقول في حجة الوداع : ألا إن كل ربا من ربا الجاهلية موضوع ، لكم رءوس أموالكم لا تظلمون ولا تظلمون وذكر الحديث . فردهم تعالى مع التوبة إلى رءوس أموالهم وقال لهم : لا تظلمون في أخذ الربا ولا تظلمون في أن يتمسك بشيء من رءوس أموالكم فتذهب أموالكم . ويحتمل أن يكون لا تظلمون في مطل ؛ لأن مطل الغني ظلم ، فالمعنى أنه يكون القضاء مع وضع الربا ، وهكذا سنة الصلح ، وهذا أشبه شيء بالصلح . ألا ترى أن النبي صلى الله عليه وسلم لما أشار إلى كعب بن مالك في دين ابن أبي حدرد بوضع الشطر فقال كعب : نعم ، فقال رسول الله صلى الله عليه وسلم للآخر : ( قم فاقضه ) . فتلقى العلماء أمره بالقضاء سنة في المصالحات . وسيأتي في ( النساء ) بيان الصلح وما يجوز منه وما لا يجوز ، إن شاء الله تعالى .\n- قوله تعالى : وإن تبتم فلكم رءوس أموالكم تأكيد لإبطال ما لم يقبض منه وأخذ رأس المال الذي لا ربا فيه . فاستدل بعض العلماء بذلك على أن كل ما طرأ على البيع قبل القبض مما يوجب تحريم العقد أبطل العقد ، كما إذا اشترى مسلم صيدا ثم أحرم المشتري أو البائع قبل القبض بطل البيع ؛ لأنه طرأ عليه قبل القبض ما أوجب تحريم العقد ، كما أبطل الله تعالى ما لم يقبض ؛ لأنه طرأ عليه ما أوجب تحريمه قبل القبض ، ولو كان مقبوضا لم يؤثر . هذا مذهب أبي حنيفة ، وهو قول لأصحاب الشافعي . ويستدل به على أن هلاك المبيع قبل القبض في يد البائع وسقوط القبض فيه يوجب بطلان العقد خلافا لبعض السلف ، ويروى هذا الخلاف عن أحمد . وهذا إنما يتمشى على قول من يقول : إن العقد في الربا كان في الأصل منعقدا ، وإنما بطل بالإسلام الطارئ قبل القبض . وأما من منع انعقاد الربا في الأصل لم يكن هذا الكلام صحيحا ، وذلك أن الربا كان محرما في الأديان ، والذي فعلوه في الجاهلية كان عادة المشركين ، وأن ما قبضوه منه كان بمثابة أموال وصلت إليهم بالغصب والسلب فلا يتعرض له . فعلى هذا لا يصح الاستشهاد على ما ذكروه من المسائل . واشتمال شرائع الأنبياء قبلنا على تحريم الربا مشهور مذكور في كتاب الله تعالى ، كما حكي عن اليهود في قوله تعالى وأخذهم الربا وقد نهوا عنه . وذكر في قصة شعيب أن قومه أنكروا عليه وقالوا : أصلاتك تأمرك أن نترك ما يعبد آباؤنا أو أن نفعل في أموالنا ما نشاء فعلى هذا لا يستقيم الاستدلال به . نعم ، يفهم من هذا أن العقود الواقعة في دار الحرب إذا ظهر عليها الإمام لا يعترض عليها بالفسخ إن كانت معقودة على فساد .\n- ذهب بعض الغلاة من أرباب الورع إلى أن المال الحلال إذا خالطه حرام حتى لم يتميز ثم أخرج منه مقدار الحرام المختلط به لم يحل ولم يطب لأنه يمكن أن يكون الذي أخرج هو الحلال والذي بقي هو الحرام . قال ابن العربي : وهذا غلو في الدين فإن كل ما لم يتميز فالمقصود منه ماليته لا عينه ولو تلف لقام المثل مقامه والاختلاط إتلاف لتمييزه كما أن الإهلاك إتلاف لعينه والمثل قائم مقام الذاهب وهذا بين حسا بين معنى . والله أعلم .\nقلت : قال علماؤنا إن سبيل التوبة مما بيده من الأموال الحرام إن كانت من ربا فليردها على من أربى عليه ويطلبه إن لم يكن حاضرا فإن أيس من وجوده فليتصدق بذلك عنه . وإن أخذه بظلم فليفعل كذلك في أمر من ظلمه . فإن التبس عليه الأمر ولم يدر كم الحرام من الحلال مما بيده فإنه يتحرى قدر ما بيده مما يجب عليه رده حتى لا يشك أن ما يبقى قد خلص له فيرده من ذلك الذي أزال عن يده إلى من عرف ممن ظلمه أو أربى عليه . فإن أيس من وجوده تصدق به عنه . فإن أحاطت المظالم بذمته وعلم أنه وجب عليه من ذلك ما لا يطيق أداءه أبدا لكثرته فتوبته أن يزيل ما بيده أجمع إما إلى المساكين وإما إلى ما فيه صلاح المسلمين حتى لا يبقى في يده إلا أقل ما يجزئه في الصلاة من اللباس وهو ما يستر العورة وهو من سرته إلى ركبتيه وقوت يومه لأنه الذي يجب له أن يأخذه من مال غيره إذا اضطر إليه وإن كره ذلك من يأخذه منه وفارق هاهنا المفلس في قول أكثر العلماء لأن المفلس لم يصر إليه أموال الناس باعتداء بل هم الذين صيروها إليه ، فيترك له ما يواريه وما هو هيئة لباسه . وأبو عبيد وغيره يرى ألا يترك للمفلس اللباس إلا أقل ما يجزئه في الصلاة وهو ما يواريه من سرته إلى ركبته ، ثم كلما وقع بيد هذا شيء أخرجه عن يده ولم يمسك منه إلا ما ذكرنا ، حتى يعلم هو ومن يعلم حاله أنه أدى ما عليه .\nهذا الوعيد الذي وعد الله به في الربا من المحاربة ، قد ورد عن النبي صلى الله عليه وسلم مثله في المخابرة . وروى أبو داود قال : أخبرنا يحيى بن معين قال : أخبرنا ابن رجاء قال ابن خيثم : حدثني عن أبي الزبير عن جابر بن عبد الله قال : سمعت رسول الله صلى الله عليه وسلم يقول : من لم يذر المخابرة فليؤذن بحرب من الله ورسوله . وهذا دليل على منع المخابرة وهي أخذ الأرض بنصف أو ثلث أو ربع ، ويسمى المزارعة . وأجمع أصحاب مالك كلهم والشافعي وأبو حنيفة وأتباعهم وداود ، على أنه لا يجوز دفع الأرض على الثلث والربع ، ولا على جزء مما تخرج ؛ لأنه مجهول ، إلا أن الشافعي وأصحابه وأبا حنيفة قالوا بجواز كراء الأرض بالطعام إذا كان معلوما ، لقوله عليه السلام : فأما شيء معلوم مضمون فلا بأس به خرجه مسلم . وإليه ذهب محمد بن عبد الله بن عبد الحكم ، ومنعه مالك وأصحابه ، لما رواه مسلم أيضا عن رافع بن خديج قال : ( كنا نحاقل بالأرض على عهد رسول الله صلى الله عليه وسلم ، فنكريها بالثلث والربع والطعام المسمى ، فجاءنا ذات يوم رجل من عمومتي فقال : نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا ، وطواعية الله ورسوله أنفع لنا ، نهانا أن نحاقل بالأرض فنكتريها على الثلث والربع والطعام المسمى ، وأمر رب الأرض أن يزرعها أو يزارعها . وكره كراءها وما سوى ذلك ) . قالوا : فلا يجوز كراء الأرض بشيء من الطعام مأكولا كان أو مشروبا على حال ؛ لأن ذلك في معنى بيع الطعام بالطعام نسيئا . وكذلك لا يجوز عندهم كراء الأرض بشيء مما يخرج منها وإن لم يكن طعاما مأكولا ولا مشروبا ، سوى الخشب والقصب والحطب ؛ لأنه عندهم في معنى المزابنة . هذا هو المحفوظ عن مالك وأصحابه . وقد ذكر ابن سحنون عن المغيرة بن عبد الرحمن المخزومي المدني أنه قال : لا بأس بإكراء الأرض بطعام لا يخرج منها . وروى يحيى بن عمر عن المغيرة أن ذلك لا يجوز ، كقول سائر أصحاب مالك . وذكر ابن حبيب ، أن ابن كنانة كان يقول : لا تكرى الأرض بشيء إذا أعيد فيها نبت ، ولا بأس أن تكرى بما سوى ذلك من جميع الأشياء مما يؤكل ومما لا يؤكل خرج منها أو لم يخرج منها ، وبه قال يحيى بن يحيى ، وقال : إنه من قول مالك . قال : وكان ابن نافع يقول : لا بأس بأن تكرى الأرض بكل شيء من طعام وغيره خرج منها أو لم يخرج ، ما عدا الحنطة وأخواتها فإنها المحاقلة المنهي عنها . وقال مالك في الموطأ : فأما الذي يعطي أرضه البيضاء بالثلث والربع مما يخرج منها فذلك مما يدخله الغرر ؛ لأن الزرع يقل مرة ويكثر أخرى ، وربما هلك رأسا فيكون صاحب الأرض قد ترك كراء معلوما ، وإنما مثل ذلك مثل رجل استأجر أجيرا لسفر بشيء معلوم ، ثم قال الذي استأجر للأجير : هل لك أن أعطيك عشر ما أربح في سفري هذا إجارة لك . فهذا لا يحل ولا ينبغي . قال مالك : ولا ينبغي لرجل أن يؤاجر نفسه ولا أرضه ولا سفينته ولا دابته إلا بشيء معلوم لا يزول . وبه يقول الشافعي وأبو حنيفة وأصحابهما . وقال أحمد بن حنبل والليث والثوري والأوزاعي والحسن بن حي وأبو يوسف ومحمد : لا بأس أن يعطي الرجل أرضه على جزء ، مما تخرجه نحو الثلث والربع ، وهو قول ابن عمر وطاوس . واحتجوا بقصة خيبر وأن رسول الله صلى الله عليه وسلم عامل أهلها على شطر ما تخرجه أرضهم وثمارهم . قال أحمد : حديث رافع بن خديج في النهي عن كراء المزارع مضطرب الألفاظ ولا يصح ، والقول بقصة خيبر أولى وهو حديث صحيح . وقد أجاز طائفة من التابعين ومن بعدهم أن يعطي الرجل سفينته ودابته ، كما يعطي أرضه بجزء مما يرزقه الله في العلاج بها . وجعلوا أصلهم في ذلك القراض المجمع عليه على ما يأتي بيانه في \" المزمل \" إن شاء الله تعالى عند قوله تعالى : وآخرون يضربون في الأرض يبتغون من فضل الله وقال الشافعي في قول ابن عمر : كنا نخابر ولا نرى بذلك بأسا حتى أخبرنا رافع بن خديج أن رسول الله صلى الله عليه وسلم نهى عنها ، أي كنا نكري الأرض ببعض ما يخرج منها . قال : وفي ذلك نسخ لسنة خيبر .\nقلت : ومما يصحح قول الشافعي في النسخ ما رواه الأئمة واللفظ للدارقطني عن جابر أن النبي صلى الله عليه وسلم نهى عن المحاقلة والمزابنة والمخابرة وعن الثنيا إلا أن تعلم . صحيح . وروى أبو داود عن زيد بن ثابت قال : نهى رسول الله صلى الله عليه وسلم عن المخابرة . قلت : وما المخابرة ؟ قال : أن تأخذ الأرض بنصف أو ثلث أو ربع .\n: في القراءات . قرأ الجمهور \" ما بقي \" بتحريك الياء ، وسكنها الحسن ، ومثله قول جرير :\nهو الخليفة فارضوا ما رضي لكم ماضي العزيمة ما في حكمه جنف\nوقال عمر بن أبي ربيعة :\nكم قد ذكرتك لو أجزى بذكركم يا أشبه الناس كل الناس بالقمر\nإني لأجذل أن أمسي مقابله حبا لرؤية من أشبهت في الصور\n، أصله \" ما رضي \" و \" أن أمسي \" فأسكنها ، وهو في الشعر كثير . ووجهه أنه شبه الياء بالألف فكما لا تصل الحركة إلى الألف فكذلك لا تصل هنا إلى الياء . ومن هذه اللغة ( أحب أن أدعوك ) ، ( وأشتهي أن أقضيك ) ، بإسكان الواو والياء . وقرأ الحسن \" ما بقى \" بالألف ، وهي لغة طيئ ، يقولون للجارية : جاراة ، وللناصية : ناصاة ، وقال الشاعر :\nلعمرك لا أخشى التصعلك ما بقى على الأرض قيسي يسوق الأباعرا\nوقرأ أبو السمال من بين جميع القراء \" من الربو \" بكسر الراء المشددة وضم الباء وسكون الواو . وقال أبو الفتح عثمان بن جني : شذ هذا الحرف من أمرين ، أحدهما الخروج من الكسر إلى الضم ، والآخر وقوع الواو بعد الضم في آخر الاسم . وقال المهدوي . وجهها أنه فخم الألف فانتحى بها نحو الواو التي الألف منها ، ولا ينبغي أن يحمل على غير هذا الوجه ، إذ ليس في الكلام اسم آخره واو ساكنة قبلها ضمة . وأمال الكسائي وحمزة \" الربا \" لمكان الكسرة في الراء . الباقون بالتفخيم لفتحة الباء .\nوقرأ أبو بكر عن عاصم وحمزة \" فآذنوا \" على معنى فآذنوا غيركم ، فحذف المفعول . وقرأ الباقون فأذنوا أي كونوا على إذن ، من قولك : إني على علم ، حكاه أبو عبيد عن الأصمعي . وحكى أهل اللغة أنه يقال : أذنت به إذنا ، أي علمت به . وقال ابن عباس وغيره من المفسرين : معنى فأذنوا فاستيقنوا الحرب من الله تعالى ، وهو بمعنى الإذن . ورجح أبو علي وغيره قراءة المد قال : لأنهم إذا أمروا بإعلام غيرهم ممن لم ينته عن ذلك علموا هم لا محالة . قال : ففي إعلامهم علمهم وليس في علمهم إعلامهم . ورجح الطبري قراءة القصر ؛ لأنها تختص بهم . وإنما أمروا على قراءة المد بإعلام غيرهم\nوقرأ جميع القراء ( لا تظلمون ) بفتح التاء ( ولا تظلمون ) بضمها . وروى المفضل عن عاصم \" لا تظلمون \" \" ولا تظلمون \" بضم التاء في الأولى وفتحها في الثانية على العكس . وقال أبو علي : تترجح قراءة الجماعة بأنها تناسب قوله : ( وإن تبتم ) في إسناد الفعلين إلى الفاعل ، فيجيء \" تظلمون \" بفتح التاء أشكل بما قبله .\n                                    ",
        "saadi": "فَإِن لَّمۡ تَفۡعَلُواْ فَأۡذَنُواْ بِحَرۡبٖ مِّنَ ٱللَّهِ وَرَسُولِهِۦۖ وَإِن تُبۡتُمۡ فَلَكُمۡ رُءُوسُ أَمۡوَٰلِكُمۡ لَا تَظۡلِمُونَ وَلَا تُظۡلَمُونَ ٩٧٢\n                                        \n                                        \n                                        \n                                        وأما من لم ينزجر بموعظة الله ولم يقبل نصيحته فإنه مشاق لربه محارب له، وهو عاجز ضعيف ليس له يدان في محاربة العزيز الحكيم الذي يمهل للظالم ولا يهمله حتى إذا أخذه، أخذه أخذ عزيز مقتدر { وإن تبتم } عن الربا { فلكم رءوس أموالكم } أي: أنزلوا عليها { لا تظلمون } من عاملتموه بأخذ الزيادة التي هي الربا { ولا تظلمون } بنقص رءوس أموالكم.\n                                    "
      },
      "originalText": "فَإِن لَّمۡ تَفۡعَلُواْ فَأۡذَنُواْ بِحَرۡبٖ مِّنَ ٱللَّهِ وَرَسُولِهِۦۖ وَإِن تُبۡتُمۡ فَلَكُمۡ رُءُوسُ أَمۡوَٰلِكُمۡ لَا تَظۡلِمُونَ وَلَا تُظۡلَمُونَ ٩٧٢"
    },
    {
      "number": 287,
      "text": "وَإِنْ كَانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍ ۚ وَأَنْ تَصَدَّقُوا خَيْرٌ لَكُمْ ۖ إِنْ كُنْتُمْ تَعْلَمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 280,
      "juz": 3,
      "manzil": 1,
      "page": 47,
      "ruku": 39,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن كَانَ ذُو عُسۡرَةٖ فَنَظِرَةٌ إِلَىٰ مَيۡسَرَةٖۚ وَأَن تَصَدَّقُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ ٠٨٢\n                                        \n                                        \n                                        وقوله : ( وإن كان ذو عسرة فنظرة إلى ميسرة وأن تصدقوا خير لكم إن كنتم تعلمون ) : يأمر تعالى بالصبر على المعسر الذي لا يجد وفاء ، فقال : ( وإن كان ذو عسرة فنظرة إلى ميسرة ) [ أي ] : لا كما كان أهل الجاهلية يقول أحدهم لمدينه إذا حل عليه الدين : إما أن تقضي وإما أن تربي .\nثم يندب إلى الوضع عنه ، ويعد على ذلك الخير والثواب الجزيل ، فقال : ( وأن تصدقوا خير لكم إن كنتم تعلمون ) أي : وأن تتركوا رأس المال بالكلية وتضعوه عن المدين . وقد وردت الأحاديث من طرق متعددة عن النبي صلى الله عليه وسلم ، بذلك :\nفالحديث الأول : عن أبي أمامة أسعد بن زرارة [ النقيب ] ، قال الطبراني : حدثنا عبد الله بن محمد بن شعيب الرجاني حدثنا يحيى بن حكيم المقوم ، حدثنا محمد بن بكر البرساني ، حدثنا عبد الله بن أبي زياد ، حدثني عاصم بن عبيد الله ، عن أبي أمامة أسعد بن زرارة قال : قال رسول الله صلى الله عليه وسلم : \" من سره أن يظله الله يوم لا ظل إلا ظله ، فلييسر على معسر أو ليضع عنه \" .\nحديث آخر : عن بريدة ، قال الإمام أحمد : حدثنا عفان ، حدثنا عبد الوارث ، حدثنا محمد بن جحادة ، عن سليمان بن بريدة ، عن أبيه قال : سمعت النبي صلى الله عليه وسلم يقول : \" من أنظر معسرا فله بكل يوم مثله صدقة \" . قال : ثم سمعته يقول : \" من أنظر معسرا فله بكل يوم مثلاه صدقة \" . قلت : سمعتك يا رسول الله تقول : \" من أنظر معسرا فله بكل يوم مثله صدقة \" . ثم سمعتك تقول : \" من أنظر معسرا فله بكل يوم مثلاه صدقة \" ؟ ! قال : \" له بكل يوم مثله صدقة قبل أن يحل الدين ، فإذا حل الدين فأنظره ، فله بكل يوم مثلاه صدقة \" .\nحديث آخر : عن أبي قتادة الحارث بن ربعي الأنصاري ، قال [ الإمام ] أحمد : حدثنا عفان حدثنا حماد بن سلمة ، أخبرنا أبو جعفر الخطمي ، عن محمد بن كعب القرظي : أن أبا قتادة كان له دين على رجل ، وكان يأتيه يتقاضاه ، فيختبئ منه ، فجاء ذات يوم فخرج صبي فسأله عنه ، فقال : نعم ، هو في البيت يأكل خزيرة فناداه : يا فلان ، اخرج ، فقد أخبرت أنك هاهنا فخرج إليه ، فقال : ما يغيبك عني ؟ فقال : إني معسر ، وليس عندي . قال : آلله إنك معسر ؟ قال : نعم . فبكى أبو قتادة ، ثم قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" من نفس عن غريمه أو محا عنه كان في ظل العرش يوم القيامة \" . ورواه مسلم في صحيحه .\nحديث آخر : عن حذيفة بن اليمان ، قال الحافظ أبو يعلى الموصلي : حدثنا الأخنس أحمد بن عمران حدثنا محمد بن فضيل ، حدثنا أبو مالك الأشجعي ، عن ربعي بن حراش ، عن حذيفة قال : قال رسول الله صلى الله عليه وسلم : \" أتى الله بعبد من عبيده يوم القيامة ، قال : ماذا عملت لي في الدنيا ؟ فقال : ما عملت لك يا رب مثقال ذرة في الدنيا أرجوك بها ، قالها ثلاث مرات ، قال العبد عند آخرها : يا رب ، إنك أعطيتني فضل مال ، وكنت رجلا أبايع الناس وكان من خلقي الجواز ، فكنت أيسر على الموسر ، وأنظر المعسر . قال : فيقول الله ، عز وجل : أنا أحق من ييسر ، ادخل الجنة \" .\nوقد أخرجه البخاري ، ومسلم ، وابن ماجه من طرق عن ربعي بن حراش ، عن حذيفة . زاد مسلم : وعقبة بن عامر وأبي مسعود البدري عن النبي صلى الله عليه وسلم بنحوه . ولفظ البخاري .\nحدثنا هشام بن عمار ، حدثنا يحيى بن حمزة ، حدثنا الزهري ، عن عبد الله بن عبد الله أنه سمع أبا هريرة رضي الله عنه ، عن النبي صلى الله عليه وسلم قال : \" كان تاجر يداين الناس ، فإذا رأى معسرا قال لفتيانه : تجاوزوا عنه ، لعل الله يتجاوز عنا ، فتجاوز الله عنه \" .\nحديث آخر : عن سهل بن حنيف ، قال الحاكم في مستدركه : حدثنا أبو عبد الله محمد بن يعقوب ، حدثنا يحيى بن محمد بن يحيى ، حدثنا أبو الوليد هشام بن عبد الملك ، حدثنا عمرو بن ثابت ، حدثنا عبد الله بن محمد بن عقيل ، عن عبد الله بن سهل بن حنيف ، أن سهلا حدثه ، أن رسول الله صلى الله عليه وسلم قال : \" من أعان مجاهدا في سبيل الله أو غازيا ، أو غارما في عسرته ، أو مكاتبا في رقبته ، أظله الله يوم لا ظل إلا ظله \" ثم قال : صحيح الإسناد ، ولم يخرجاه .\nحديث آخر : عن عبد الله بن عمر ، قال الإمام أحمد : حدثنا محمد بن عبيد ، عن يوسف بن صهيب ، عن زيد العمي ، عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : \" من أراد أن تستجاب دعوته ، وأن تكشف كربته ، فليفرج عن معسر \" ، انفرد به أحمد .\nحديث آخر : عن أبي مسعود عقبة بن عمرو ، قال الإمام أحمد : حدثنا يزيد بن هارون ، أخبرنا أبو مالك ، عن ربعي بن حراش ، عن حذيفة ، أن رجلا أتى به الله عز وجل ، فقال : ماذا عملت في الدنيا ؟ فقال له الرجل : ما عملت مثقال ذرة من خير أرجوك بها ، فقالها له ثلاثا ، وقال في الثالثة : أي رب كنت أعطيتني فضلا من المال في الدنيا ، فكنت أبايع الناس ، فكنت أتيسر على الموسر ، وأنظر المعسر . فقال تبارك وتعالى : نحن أولى بذلك منك ، تجاوزوا عن عبدي . فغفر له . قال أبو مسعود : هكذا سمعت من النبي صلى الله عليه وسلم ، وهكذا رواه مسلم من حديث أبي مالك سعد بن طارق به .\nحديث آخر : عن عمران بن حصين ، قال الإمام أحمد : حدثنا أسود بن عامر ، أخبرنا أبو بكر ، عن الأعمش ، عن أبي داود ، عن عمران بن حصين قال : قال رسول الله صلى الله عليه وسلم : \" من كان له على رجل حق فأخره كان له بكل يوم صدقة \" .\nغريب من هذا الوجه وقد تقدم عن بريدة نحوه .\nحديث آخر : عن أبي اليسر كعب بن عمرو ، قال الإمام أحمد : حدثنا معاوية بن عمرو ، حدثنا زائدة ، عن عبد الملك بن عمير ، عن ربعي ، قال : حدثني أبو اليسر ، أن رسول الله صلى الله عليه وسلم قال : \" من أنظر معسرا أو وضع عنه أظله الله ، عز وجل ، في ظله يوم لا ظل إلا ظله \" .\nوقد أخرجه مسلم في صحيحه من وجه آخر ، من حديث عبادة بن الوليد بن عبادة بن الصامت ، قال : خرجت أنا وأبي نطلب العلم في هذا الحي من الأنصار قبل أن يهلكوا ، فكان أول من لقينا أبا اليسر صاحب رسول الله صلى الله عليه وسلم ، ومعه غلام له معه ضمامة من صحف ، وعلى أبي اليسر بردة ومعافري ، وعلى غلامه بردة ومعافري فقال له أبي : يا عم ، إني أرى في وجهك سفعة من غضب ؟ قال أجل ، كان لي على فلان بن فلان الحرامي مال ، فأتيت أهله فسلمت ، فقلت : أثم هو ؟ قالوا : لا فخرج علي ابن له جفر فقلت : أين أبوك ؟ فقال : سمع صوتك فدخل أريكة أمي . فقلت : اخرج إلي فقد علمت أين أنت ؟ فخرج ، فقلت : ما حملك على أن اختبأت مني ؟ قال : أنا والله أحدثك ثم لا أكذبك ; خشيت والله أن أحدثك فأكذبك ، وأن أعدك فأخلفك ، وكنت صاحب رسول الله صلى الله عليه وسلم ، وكنت - والله - معسرا قال : قلت : آلله ؟ قال : قلت : آلله ، قال : الله . قلت : آلله ؟ قال : الله . قال : فأتى بصحيفته فمحاها بيده ، ثم قال : فإن وجدت قضاء فاقضني ، وإلا فأنت في حل ، فأشهد بصر عيني ووضع أصبعيه على عينيه وسمع أذني هاتين ، ووعاه قلبي وأشار إلى مناط قلبه رسول الله صلى الله عليه وسلم وهو يقول : \" من أنظر معسرا ، أو وضع عنه أظله الله في ظله \" . وذكر تمام الحديث .\nحديث آخر : عن أمير المؤمنين عثمان بن عفان ، قال عبد الله بن الإمام أحمد [ في مسند أبيه ] حدثني أبو يحيى البزاز محمد بن عبد الرحيم ، حدثنا الحسن بن بشر بن سلم الكوفي ، حدثنا العباس بن الفضل الأنصاري ، عن هشام بن زياد القرشي ، عن أبيه ، عن محجن مولى عثمان ، عن عثمان ، قال : سمعت رسول الله ، صلى الله عليه وسلم ، يقول : \" أظل الله عينا في ظله ، يوم لا ظل إلا ظله من أنظر معسرا ، أو ترك لغارم \" .\nحديث آخر : عن ابن عباس ، قال الإمام أحمد : حدثنا عبد الله بن يزيد ، حدثنا نوح بن جعونة السلمي الخراساني ، عن مقاتل بن حيان ، عن عطاء ، عن ابن عباس ، قال : خرج رسول الله صلى الله عليه وسلم إلى المسجد ، وهو يقول بيده هكذا وأومأ عبد الرحمن بيده إلى الأرض : \" من أنظر معسرا أو وضع له ، وقاه الله من فيح جهنم ، ألا إن عمل الجنة حزن بربوة ثلاثا ، ألا إن عمل النار سهل بسهوة ، والسعيد من وقي الفتن ، وما من جرعة أحب إلى الله من جرعة غيظ يكظمها عبد ، ما كظمها عبد لله إلا ملأ الله جوفه إيمانا \" تفرد به أحمد .\nطريق أخرى : قال الطبراني : حدثنا أحمد بن محمد البوراني قاضي الحديثة من ديار ربيعة ، حدثنا الحسين بن علي الصدائي ، حدثنا الحكم بن الجارود ، حدثنا ابن أبي المتئد خال ابن عيينة عن أبيه ، عن عطاء ، عن ابن عباس ، قال : قال رسول الله صلى الله عليه وسلم : \" من أنظر معسرا إلى ميسرته أنظره الله بذنبه إلى توبته \" .\n                                    ",
        "qortoby": "وَإِن كَانَ ذُو عُسۡرَةٖ فَنَظِرَةٌ إِلَىٰ مَيۡسَرَةٖۚ وَأَن تَصَدَّقُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ ٠٨٢\n                                        \n                                        \n                                        قوله تعالى : وإن كان ذو عسرة فنظرة إلى ميسرة وأن تصدقوا خير لكم إن كنتم تعلمون\nفيه تسع مسائل :\nالأولى : قوله تعالى : وإن كان ذو عسرة لما حكم جل وعز لأرباب الربا برءوس أموالهم عند الواجدين للمال ، حكم في ذي العسرة بالنظرة إلى حال الميسرة ، وذلك أن ثقيفا لما طلبوا أموالهم التي لهم على بني المغيرة شكوا العسرة - يعني بني المغيرة - وقالوا : ليس لنا شيء ، وطلبوا الأجل إلى وقت ثمارهم ، فنزلت هذه الآية وإن كان ذو عسرة .\nالثانية : قوله تعالى : وإن كان ذو عسرة مع قوله وإن تبتم فلكم رءوس أموالكم يدل على ثبوت المطالبة لصاحب الدين على المدين وجواز أخذ ماله بغير رضاه . ويدل على أن الغريم متى امتنع من أداء الدين مع الإمكان كان ظالما ، فإن الله تعالى يقول : فلكم رءوس أموالكم فجعل له المطالبة برأس ماله . فإذا كان له حق المطالبة فعلى من عليه الدين لا محالة وجوب قضائه .\nالثالثة : قال المهدوي وقال بعض العلماء : هذه الآية ناسخة لما كان في الجاهلية من بيع من أعسر . وحكى مكي أن النبي صلى الله عليه وسلم أمر به في صدر الإسلام . قال ابن عطية : فإن ثبت فعل النبي صلى الله عليه وسلم فهو نسخ وإلا فليس بنسخ . قال الطحاوي : كان الحر يباع في الدين أول الإسلام إذا لم يكن له مال يقضيه عن نفسه حتى نسخ الله ذلك فقال جل وعز : وإن كان ذو عسرة فنظرة إلى ميسرة . واحتجوا بحديث رواه الدارقطني من حديث مسلم بن خالد الزنجي أخبرنا زيد بن أسلم عن ابن البيلماني عن سرق قال : كان لرجل علي مال - أو قال دين - فذهب بي إلى رسول الله صلى الله عليه وسلم فلم يصب لي مالا فباعني منه ، أو باعني له . أخرجه البزار بهذا الإسناد أطول منه . ومسلم بن خالد الزنجي وعبد الرحمن بن البيلماني لا يحتج بهما . وقال جماعة من أهل العلم : قوله تعالى : فنظرة إلى ميسرة عامة في جميع الناس ، فكل من أعسر أنظر ، وهذا قول أبي هريرة والحسن وعامة الفقهاء . قال النحاس : وأحسن ما قيل في هذه الآية قول عطاء والضحاك والربيع بن خيثم . قال : هي لكل معسر ينظر في الربا والدين كله . فهذا قول يجمع الأقوال ؛ لأنه يجوز أن تكون ناسخة عامة نزلت في الربا ثم صار حكم غيره كحكمه . ولأن القراءة بالرفع بمعنى وإن وقع ذو عسرة من الناس أجمعين . ولو كان في الربا خاصة لكان النصب الوجه ، بمعنى وإن كان الذي عليه الربا ذا عسرة . وقال ابن عباس وشريح : ذلك في الربا خاصة ، فأما الديون وسائر المعاملات فليس فيها نظرة بل يؤدي إلى أهلها أو يحبس فيه حتى يوفيه ، وهو قول إبراهيم . واحتجوا بقول الله تعالى : إن الله يأمركم أن تؤدوا الأمانات إلى أهلها الآية . قال ابن عطية : فكان هذا القول يترتب إذا لم يكن فقر مدقع ، وأما مع العدم والفقر الصريح فالحكم هو النظرة ضرورة .\nالرابعة : من كثرت ديونه وطلب غرماؤه مالهم فللحاكم أن يخلعه عن كل ماله ويترك له ما كان من ضرورته . روى ابن نافع عن مالك أنه لا يترك له إلا ما يواريه . والمشهور أنه يترك له كسوته المعتادة ما لم يكن فيها فضل ، ولا ينزع منه رداؤه إن كان ذلك مزريا به . وفي ترك كسوة زوجته وفي بيع كتبه إن كان عالما خلاف . ولا يترك له مسكن ولا خادم ولا ثوب جمعة ما لم تقل قيمتها ، وعند هذا يحرم حبسه . والأصل في هذا قوله تعالى : وإن كان ذو عسرة فنظرة إلى ميسرة . روى الأئمة واللفظ لمسلم عن أبي سعيد الخدري قال : أصيب رجل في عهد رسول الله صلى الله عليه وسلم في ثمار ابتاعها فكثر دينه ، فقال رسول الله صلى الله عليه وسلم ( تصدقوا عليه ) فتصدق الناس عليه فلم يبلغ ذلك وفاء دينه . فقال رسول الله صلى الله عليه وسلم لغرمائه : ( خذوا ما وجدتم وليس لكم إلا ذلك ) . وفي مصنف أبي داود : فلم يزد رسول الله صلى الله عليه وسلم غرماءه على أن خلع لهم ماله . وهذا نص ، فلم يأمر رسول الله صلى الله عليه وسلم بحبس الرجل ، وهو معاذ بن جبل كما قال شريح ، ولا بملازمته ، خلافا لأبي حنيفة فإنه قال : يلازم لإمكان أن يظهر له مال ، ولا يكلف أن يكتسب لما ذكرنا . وبالله توفيقنا .\nالخامسة : ويحبس المفلس في قول مالك والشافعي وأبي حنيفة وغيرهم حتى يتبين عدمه . ولا يحبس عند مالك إن لم يتهم أنه غيب ماله ولم يتبين لدده . وكذلك لا يحبس إن صح عسره على ما ذكرنا .\nالسادسة : فإن جمع مال المفلس ثم تلف قبل وصوله إلى أربابه وقبل البيع ، فعلى المفلس ضمانه ، ودين الغرماء ثابت في ذمته . فإن باع الحاكم ماله وقبض ثمنه ثم تلف الثمن قبل قبض الغرماء له ، كان عليهم ضمانه وقد برئ المفلس منه . وقال محمد بن عبد الحكم : ضمانه من المفلس أبدا حتى يصل إلى الغرماء .\nالسابعة : العسرة ضيق الحال من جهة عدم المال ، ومنه جيش العسرة . والنظرة التأخير والميسرة مصدر بمعنى اليسر . وارتفع \" ذو \" بكان التامة التي بمعنى وجد وحدث ، هذا قول سيبويه وأبي علي وغيرهما . وأنشد سيبويه :\nفدى لبني ذهل بن شيبان ناقتي إذا كان يوم ذو كواكب أشهب\nويجوز النصب . وفي مصحف أبي بن كعب \" وإن كان ذا عسرة \" على معنى وإن كان المطلوب ذا عسرة . وقرأ الأعمش \" وإن كان معسرا فنظرة \" . قال أبو عمرو الداني عن أحمد بن موسى : وكذلك في مصحف أبي بن كعب . قال النحاس ومكي والنقاش : وعلى هذا يختص لفظ الآية بأهل الربا ، وعلى من قرأ ذو فهي عامة في جميع من عليه دين ، وقد تقدم . وحكى المهدوي أن في مصحف عثمان \" فإن كان - بالفاء - ذو عسرة \" . وروى المعتمر عن حجاج الوراق قال : في مصحف عثمان \" وإن كان ذا عسرة \" ذكره النحاس . وقراءة الجماعة نظرة بكسر الظاء . وقرأ مجاهد وأبو رجاء والحسن \" فنظرة \" بسكون الظاء ، وهي لغة تميمية وهم الذين يقولون : في كرم زيد بمعنى كرم زيد ، ويقولون كبد في كبد . وقرأ نافع ، وحده \" ميسرة \" بضم السين ، والجمهور بفتحها . وحكى النحاس عن مجاهد وعطاء \" فناظره - على الأمر - إلى ميسرهي \" بضم السين وكسر الراء وإثبات الياء في الإدراج . وقرئ \" فناظرة \" قال أبو حاتم لا يجوز فناظرة ، إنما ذلك في \" النمل \" لأنها امرأة تكلمت بهذا لنفسها ، من نظرت تنظر فهي ناظرة ، وما في \" البقرة \" فمن التأخير ، من قولك : أنظرتك بالدين ، أي أخرتك به . ومنه قوله : أنظرني إلى يوم يبعثون وأجاز ذلك أبو إسحاق الزجاج وقال : هي من أسماء المصادر ، كقوله تعالى : ليس لوقعتها كاذبة . وكقوله تعالى : تظن أن يفعل بها فاقرة وك خائنة الأعين وغيره .\nالثامنة : قوله تعالى : ( وأن تصدقوا ) ابتداء ، وخبره خير . ندب الله تعالى بهذه الألفاظ إلى الصدقة على المعسر وجعل ذلك خيرا من إنظاره ، قاله السدي وابن زيد والضحاك . وقال الطبري : وقال آخرون : معنى الآية وأن تصدقوا على الغني والفقير خير لكم . والصحيح الأول ، وليس في الآية مدخل للغني .\nالتاسعة : روى أبو جعفر الطحاوي عن بريدة بن الخصيب قال قال رسول الله صلى الله عليه وسلم : من أنظر معسرا كان له بكل يوم صدقة . ثم قلت : بكل يوم مثله صدقة ، قال فقال : بكل يوم صدقة ما لم يحل الدين فإذا أنظره بعد الحل فله بكل يوم مثله صدقة . وروى مسلم عن أبي مسعود قال قال رسول الله صلى الله عليه وسلم : حوسب رجل ممن كان قبلكم فلم يوجد له من الخير شيء إلا أنه كان يخالط الناس وكان موسرا فكان يأمر غلمانه أن يتجاوزوا عن المعسر قال : قال الله عز وجل نحن أحق بذلك منه تجاوزوا عنه . وروي عن أبي قتادة أنه طلب غريما له فتوارى عنه ثم وجده فقال : إني معسر . فقال : آلله ؟ قال : آلله . قال : فإني سمعت رسول الله صلى الله عليه وسلم يقول : من سره أن ينجيه الله من كرب يوم القيامة فلينفس عن معسر أو يضع عنه ، وفي حديث أبي اليسر الطويل - واسمه ، كعب بن عمرو - أنه سمع رسول الله صلى الله عليه وسلم يقول : من أنظر معسرا أو وضع عنه أظله الله في ظله . ففي هذه الأحاديث من الترغيب ما هو منصوص فيها . وحديث أبي قتادة يدل على أن رب الدين إذا علم عسرة غريمه أو ظنها حرمت عليه مطالبته ، وإن لم تثبت عسرته عند الحاكم . وإنظار المعسر تأخيره إلى أن يوسر . والوضع عنه إسقاط الدين عن ذمته . وقد جمع المعنيين أبو اليسر لغريمه حيث محا عنه الصحيفة وقال له : إن وجدت قضاء فاقض وإلا فأنت في حل .\n                                    ",
        "saadi": "وَإِن كَانَ ذُو عُسۡرَةٖ فَنَظِرَةٌ إِلَىٰ مَيۡسَرَةٖۚ وَأَن تَصَدَّقُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ ٠٨٢\n                                        \n                                        \n                                        \n                                        { وإن كان } المدين { ذو عسرة } لا يجد وفاء { فنظرة إلى ميسرة } وهذا واجب عليه أن ينظره حتى يجد ما يوفي به { وأن تصدقوا خير لكم إن كنتم تعلمون } إما بإسقاطها أو بعضها.\n                                    "
      },
      "originalText": "وَإِن كَانَ ذُو عُسۡرَةٖ فَنَظِرَةٌ إِلَىٰ مَيۡسَرَةٖۚ وَأَن تَصَدَّقُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ ٠٨٢"
    },
    {
      "number": 288,
      "text": "وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 281,
      "juz": 3,
      "manzil": 1,
      "page": 47,
      "ruku": 39,
      "hizbQuarter": 19,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱتَّقُواْ يَوۡمٗا تُرۡجَعُونَ فِيهِ إِلَى ٱللَّهِۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١٨٢\n                                        \n                                        \n                                        ثم قال تعالى يعظ عباده ويذكرهم زوال الدنيا وفناء ما فيها من الأموال وغيرها ، وإتيان الآخرة والرجوع إليه تعالى ومحاسبته تعالى خلقه على ما عملوا ، ومجازاته إياهم بما كسبوا من خير وشر ، ويحذرهم عقوبته ، فقال : ( واتقوا يوما ترجعون فيه إلى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون )\nوقد روي أن هذه الآية آخر آية نزلت من القرآن العظيم ، فقال ابن لهيعة : حدثني عطاء بن دينار ، عن سعيد بن جبير ، قال : آخر ما نزل من القرآن كله ( واتقوا يوما ترجعون فيه إلى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون ) وعاش النبي صلى الله عليه وسلم بعد نزول هذه الآية تسع ليال ، ثم مات يوم الاثنين ، لليلتين خلتا من ربيع الأول . رواه ابن أبي حاتم .\nوقد رواه ابن مردويه من حديث المسعودي ، عن حبيب بن أبي ثابت ، عن سعيد بن جبير ، عن ابن عباس ، قال : آخر آية نزلت : ( واتقوا يوما ترجعون فيه إلى الله )\nوقد رواه النسائي ، من حديث يزيد النحوي ، عن عكرمة ، عن عبد الله بن عباس ، قال : آخر شيء نزل من القرآن : ( واتقوا يوما ترجعون فيه إلى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون ) .\nوكذا رواه الضحاك ، والعوفي ، عن ابن عباس ، وروى الثوري ، عن الكلبي ، عن أبي صالح ، عن ابن عباس ، قال : آخر آية أنزلت : ( واتقوا يوما ترجعون فيه إلى الله ) فكان بين نزولها [ وبين ] موت النبي صلى الله عليه وسلم واحد وثلاثون يوما .\nوقال ابن جريج : قال ابن عباس : آخر آية نزلت : ( واتقوا يوما ترجعون فيه إلى الله ) الآية .\nقال ابن جريج : يقولون : إن النبي صلى الله عليه وسلم عاش بعدها تسع ليال ، وبدئ يوم السبت ومات يوم الاثنين ، رواه ابن جرير .\nورواه عطية عن أبي سعيد ، قال : آخر آية أنزلت : ( واتقوا يوما ترجعون فيه إلى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون ) .\n                                    ",
        "qortoby": "وَٱتَّقُواْ يَوۡمٗا تُرۡجَعُونَ فِيهِ إِلَى ٱللَّهِۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١٨٢\n                                        \n                                        \n                                        قوله تعالى : واتقوا يوما ترجعون فيه إلى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون\nقيل : إن هذه الآية نزلت قبل موت النبي صلى الله عليه وسلم بتسع ليال ثم لم ينزل بعدها شيء ، قاله ابن جريج . وقال ابن جبير ومقاتل : بسبع ليال . وروي بثلاث ليال . وروي أنها نزلت قبل موته بثلاث ساعات ، وأنه عليه السلام قال : اجعلوها بين آية الربا وآية الدين . وحكى مكي أن النبي صلى الله عليه وسلم قال : جاءني جبريل فقال اجعلها على رأس مائتين وثمانين آية .\nقلت : وحكي عن أبي بن كعب وابن عباس وقتادة أن آخر ما نزل : لقد جاءكم رسول من أنفسكم إلى آخر الآية . والقول الأول أعرف وأكثر وأصح وأشهر . ورواه أبو صالح عن ابن عباس قال : آخر ما نزل من القرآن واتقوا يوما ترجعون فيه إلى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون فقال جبريل للنبي صلى الله عليه وسلم ( يا محمد ضعها على رأس ثمانين ومائتين من البقرة ) . ذكره أبو بكر الأنباري في \" كتاب الرد \" له ، وهو قول ابن عمر رضي الله عنه أنها آخر ما نزل ، وأنه عليه السلام عاش بعدها أحدا وعشرين يوما ، على ما يأتي بيانه في آخر سورة إذا جاء نصر الله والفتح إن شاء تعالى . والآية وعظ لجميع الناس وأمر يخص كل إنسان . و ( يوما ) منصوب على المفعول لا على الظرف . ترجعون فيه إلى الله من نعته . وقرأ أبو عمرو بفتح التاء وكسر الجيم ، مثل إن إلينا إيابهم واعتبارا بقراءة أبي \" يوما تصيرون فيه إلى الله \" . والباقون بضم التاء وفتح الجيم ، مثل ثم ردوا إلى الله . ولئن رددت إلى ربي واعتبارا بقراءة عبد الله \" يوما تردون فيه إلى الله \" وقرأ الحسن \" يرجعون \" بالياء ، على معنى يرجع جميع الناس . قال ابن جني : كأن الله تعالى رفق بالمؤمنين على أن يواجههم بذكر الرجعة ، إذ هي مما ينفطر لها القلوب فقال لهم : واتقوا يوما ثم رجع في ذكر الرجعة إلى الغيبة رفقا بهم . وجمهور العلماء على أن هذا اليوم المحذر منه هو يوم القيامة والحساب والتوفية . وقال قوم : هو يوم الموت . قال ابن عطية : والأول أصح بحكم الألفاظ في الآية . وفي قوله ( إلى الله ) مضاف محذوف ، تقديره إلى حكم الله وفصل قضائه . ( وهم ) رد على معنى ( كل ) لا على اللفظ ، إلا على قراءة الحسن \" يرجعون \" فقوله \" وهم \" رد على ضمير الجماعة في \" يرجعون \" . وفي هذه الآية نص على أن الثواب والعقاب متعلق بكسب الأعمال ، وهو رد على الجبرية ، وقد تقدم .\n                                    ",
        "saadi": "وَٱتَّقُواْ يَوۡمٗا تُرۡجَعُونَ فِيهِ إِلَى ٱللَّهِۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١٨٢\n                                        \n                                        \n                                        \n                                        ( واتقوا يوما ترجعون فيه إلى الله ثم توفى كل نفس ما كسبت وهم لا يظلمون ) وهذه الآية من آخر ما نزل من القرآن، وجعلت خاتمة لهذه الأحكام والأوامر والنواهي، لأن فيها الوعد على الخير، والوعيد على فعل الشر، وأن من علم أنه راجع إلى الله فمجازيه على الصغير والكبير والجلي والخفي، وأن الله لا يظلمه مثقال ذرة، أوجب له الرغبة والرهبة، وبدون حلول العلم في ذلك في القلب لا سبيل إلى ذلك.\n                                    "
      },
      "originalText": "وَٱتَّقُواْ يَوۡمٗا تُرۡجَعُونَ فِيهِ إِلَى ٱللَّهِۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١٨٢"
    }
  ]
}