{
  "number": 471,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 4167,
      "text": "وَلَقَدْ جَاءَكُمْ يُوسُفُ مِنْ قَبْلُ بِالْبَيِّنَاتِ فَمَا زِلْتُمْ فِي شَكٍّ مِمَّا جَاءَكُمْ بِهِ ۖ حَتَّىٰ إِذَا هَلَكَ قُلْتُمْ لَنْ يَبْعَثَ اللَّهُ مِنْ بَعْدِهِ رَسُولًا ۚ كَذَٰلِكَ يُضِلُّ اللَّهُ مَنْ هُوَ مُسْرِفٌ مُرْتَابٌ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 34,
      "juz": 24,
      "manzil": 6,
      "page": 471,
      "ruku": 407,
      "hizbQuarter": 188,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ جَآءَكُمۡ يُوسُفُ مِن قَبۡلُ بِٱلۡبَيِّنَٰتِ فَمَا زِلۡتُمۡ فِي شَكّٖ مِّمَّا جَآءَكُم بِهِۦۖ حَتَّىٰٓ إِذَا هَلَكَ قُلۡتُمۡ لَن يَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفٞ مُّرۡتَابٌ ٤٣\n                                    \n                                    \n                                    وقوله : ( ولقد جاءكم يوسف من قبل بالبينات ) يعني : أهل مصر ، قد بعث الله فيهم رسولا من قبل موسى ، وهو يوسف - عليه السلام - كان عزيز أهل مصر ، وكان رسولا يدعو إلى الله أمته القبط ، فما أطاعوه تلك الساعة إلا لمجرد الوزارة والجاه الدنيوي ; ولهذا قال : ( فما زلتم في شك مما جاءكم به حتى إذا هلك قلتم لن يبعث الله من بعده رسولا ) أي : يئستم فقلتم طامعين : ( لن يبعث الله من بعده رسولا ) وذلك لكفرهم وتكذيبهم ( كذلك يضل الله من هو مسرف مرتاب ) أي : كحالكم هذا .\n                                    ",
        "qortoby": "وَلَقَدۡ جَآءَكُمۡ يُوسُفُ مِن قَبۡلُ بِٱلۡبَيِّنَٰتِ فَمَا زِلۡتُمۡ فِي شَكّٖ مِّمَّا جَآءَكُم بِهِۦۖ حَتَّىٰٓ إِذَا هَلَكَ قُلۡتُمۡ لَن يَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفٞ مُّرۡتَابٌ ٤٣\n                                    \n                                    \n                                    قوله تعالى : ولقد جاءكم يوسف من قبل بالبينات قيل : إن هذا من قول موسى . وقيل : هو من تمام وعظ مؤمن آل فرعون ، ذكرهم قديم عتوهم على الأنبياء ، وأراد يوسف بن يعقوب جاءهم بالبينات أأرباب متفرقون خير أم الله الواحد القهار قال ابن جريج : هو يوسف بن يعقوب بعثه الله تعالى رسولا إلى القبط بعد موت الملك من قبل موسى بالبينات وهي الرؤيا . وقال ابن عباس : هو يوسف بن إفرائيم بن يوسف بن يعقوب أقام فيهم نبيا عشرين سنة . وحكى النقاش عن الضحاك : أن الله تعالى بعث إليهم رسولا من الجن يقال له يوسف . وقال وهب بن منبه : إن فرعون موسى هو فرعون يوسف عمر . وغيره يقول : هو آخر . النحاس : وليس في الآية ما يدل على أنه هو ; لأنه إذا أتى بالبينات نبي لمن معه ولمن بعده فقد جاءهم جميعا بها وعليهم أن يصدقوه بها .\nفما زلتم في شك مما جاءكم به أي أسلافكم كانوا في شك . حتى إذا هلك قلتم لن يبعث الله من بعده رسولا أي من يدعي الرسالة كذلك يضل الله أي مثل ذلك الضلال يضل الله من هو مسرف مرتاب شاك في وحدانية الله تعالى .\n\n                                    ",
        "saadi": "وَلَقَدۡ جَآءَكُمۡ يُوسُفُ مِن قَبۡلُ بِٱلۡبَيِّنَٰتِ فَمَا زِلۡتُمۡ فِي شَكّٖ مِّمَّا جَآءَكُم بِهِۦۖ حَتَّىٰٓ إِذَا هَلَكَ قُلۡتُمۡ لَن يَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفٞ مُّرۡتَابٌ ٤٣\n                                        \n                                        \n                                        \n                                        { وَلَقَدْ جَاءَكُمْ يُوسُفُ } بن يعقوب عليهما السلام { مِنْ قَبْلُ } إتيان موسى بالبينات الدالة على صدقه، وأمركم بعبادة ربكم وحده لا شريك له، { فَمَا زِلْتُمْ فِي شَكٍّ مِمَّا جَاءَكُمْ بِهِ } في حياته { حَتَّى إِذَا هَلَكَ } ازداد شككم وشرككم، و { قُلْتُمْ لَنْ يَبْعَثَ اللَّهُ مِنْ بَعْدِهِ رَسُولًا } أي: هذا ظنكم الباطل، وحسبانكم الذي لا يليق بالله تعالى، فإنه تعالى لا يترك خلقه سدى، لا يأمرهم وينهاهم، ويرسل إليهم رسله، وظن أن الله لا يرسل رسولا ظن ضلال، ولهذا قال: { كَذَلِكَ يُضِلُّ اللَّهُ مَنْ هُوَ مُسْرِفٌ مُرْتَابٌ } وهذا هو وصفهم الحقيقي الذي وصفوا به موسى ظلمًا وعلوا، فهم المسرفون بتجاوزهم الحق وعدولهم عنه إلى الضلال، وهم الكذبة، حيث نسبوا ذلك إلى الله، وكذبوا رسوله.\nفالذي وصفه السرف والكذب، لا ينفك عنهما، لا يهديه الله، ولا يوفقه للخير، لأنه رد الحق بعد أن وصل إليه وعرفه، فجزاؤه أن يعاقبه الله، بأن يمنعه الهدى، كما قال تعالى: { فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ } { وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ وَنَذَرُهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ } { وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ }\n                                    "
      },
      "originalText": "وَلَقَدۡ جَآءَكُمۡ يُوسُفُ مِن قَبۡلُ بِٱلۡبَيِّنَٰتِ فَمَا زِلۡتُمۡ فِي شَكّٖ مِّمَّا جَآءَكُم بِهِۦۖ حَتَّىٰٓ إِذَا هَلَكَ قُلۡتُمۡ لَن يَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفٞ مُّرۡتَابٌ ٤٣"
    },
    {
      "number": 4168,
      "text": "الَّذِينَ يُجَادِلُونَ فِي آيَاتِ اللَّهِ بِغَيْرِ سُلْطَانٍ أَتَاهُمْ ۖ كَبُرَ مَقْتًا عِنْدَ اللَّهِ وَعِنْدَ الَّذِينَ آمَنُوا ۚ كَذَٰلِكَ يَطْبَعُ اللَّهُ عَلَىٰ كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 35,
      "juz": 24,
      "manzil": 6,
      "page": 471,
      "ruku": 407,
      "hizbQuarter": 188,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرٖ جَبَّارٖ ٥٣\n                                    \n                                    \n                                    ثم قال : ( الذين يجادلون في آيات الله بغير سلطان أتاهم ) أي : الذين يدفعون الحق بالباطل ، ويجادلون الحجج بغير دليل وحجة معهم من الله ، فإن الله يمقت على ذلك أشد المقت ; ولهذا قال تعالى : ( كبر مقتا عند الله وعند الذين آمنوا ) أي : والمؤمنون أيضا يبغضون من تكون هذه صفته ، فإن من كانت هذه صفته ، يطبع الله على قلبه ، فلا يعرف بعد ذلك معروفا ، ولا ينكر منكرا ; ولهذا قال : ( كذلك يطبع الله على كل قلب متكبر ) أي : على اتباع الحق ) جبار ) .\nوروى ابن أبي حاتم عن عكرمة - وحكي عن الشعبي - أنهما قالا : لا يكون الإنسان جبارا حتى يقتل نفسين .\nوقال أبو عمران الجوني وقتادة : آية الجبابرة القتل بغير حق .\n                                    ",
        "qortoby": "ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرٖ جَبَّارٖ ٥٣\n                                    \n                                    \n                                    قوله تعالى : الذين يجادلون في آيات الله أي في حججه الظاهرة بغير سلطان أتاهم أي بغير حجة وبرهان و \" الذين \" في موضع نصب على البدل من \" من \" وقال الزجاج : أي : كذلك يضل الله الذين يجادلون في آيات الله ف \" الذين \" نصب . قال : ويجوز أن يكون رفعا على معنى هم الذين ، أو على الابتداء والخبر كبر مقتا . ثم قيل : هذا من كلام مؤمن آل فرعون . وقيل : ابتداء خطاب من الله تعالى .\nمقتا على البيان أي : كبر جدالهم مقتا ، كقوله : كبرت كلمة ومقت الله تعالى ذمه لهم ولعنه إياهم وإحلال العذاب بهم . كذلك أي كما طبع الله على قلوب هؤلاء المجادلين فكذلك يطبع الله أي يختم على كل قلب متكبر جبار حتى لا يعقل الرشاد ولا يقبل الحق . وقراءة العامة على كل قلب متكبر بإضافة \" قلب \" إلى المتكبر ، واختاره أبو حاتم وأبو عبيد . وفي الكلام حذف ، والمعنى : كذلك يطبع الله على كل قلب على كل متكبر جبار فحذف \" كل \" الثانية لتقدم ما يدل عليها . وإذا لم يقدر حذف \" كل \" لم يستقم المعنى ; لأنه يصير معناه أنه يطبع على جميع قلبه وليس المعنى عليه . وإنما المعنى أنه يطبع على قلوب المتكبرين الجبارين قلبا قلبا . ومما يدل على حذف \" كل \" قول أبي دواد :\nأكل امرئ تحسبين امرأ ونار توقد بالليل نارا\nيريد : وكل نار . وفي قراءة ابن مسعود \" على قلب كل متكبر \" فهذه قراءة على التفسير والإضافة . وقرأ أبو عمرو وابن محيصن وابن ذكوان عن أهل الشام \" قلب \" منون على أن \" متكبر \" نعت للقلب فكنى بالقلب عن الجملة ; لأن القلب هو الذي يتكبر وسائر الأعضاء تبع له ، ولهذا قال النبي - صلى الله عليه وسلم - : إن في الجسد مضغة إذا صلحت صلح الجسد كله ، وإذا فسدت فسد الجسد كله ، ألا وهي القلب ويجوز أن يكون على حذف المضاف ، أي : على كل ذي قلب متكبر ، تجعل الصفة لصاحب القلب .\n                                    ",
        "saadi": "ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرٖ جَبَّارٖ ٥٣\n                                        \n                                        \n                                        \n                                        ثم ذكر وصف المسرف الكذاب فقال: { الَّذِينَ يُجَادِلُونَ فِي آيَاتِ اللَّهِ } التي بينت الحق من الباطل، وصارت -من ظهورها- بمنزلة الشمس للبصر، فهم يجادلون فيها على وضوحها، ليدفعوها ويبطلوها { بِغَيْرِ سُلْطَانٍ أَتَاهُمْ } أي: بغير حجة وبرهان، وهذا وصف لازم لكل من جادل في آيات الله، فإنه من المحال أن يجادل بسلطان، لأن الحق لا يعارضه معارض، فلا يمكن أن يعارض بدليل شرعي أو عقلي أصلا، { كَبُرَ } ذلك القول المتضمن لرد الحق بالباطل { مَقْتًا عِنْدَ اللَّهِ وَعِنْدَ الَّذِينَ آمَنُوا } فالله أشد بغضًا لصاحبه، لأنه تضمن التكذيب بالحق والتصديق بالباطل ونسبته إليه، وهذه أمور يشتد بغض الله لها ولمن اتصف بها، وكذلك عباده المؤمنون يمقتون على ذلك أشد المقت موافقة لربهم، وهؤلاء خواص خلق الله تعالى، فمقتهم دليل على شناعة من مقتوه، { كَذَلِكَ } أي: كما طبع على قلوب آل فرعون{ يَطْبَعُ اللَّهُ عَلَى كُلِّ قَلْبِ مُتَكَبِّرٍ جَبَّارٍ } متكبر في نفسه على الحق برده وعلى الخلق باحتقارهم، جبار بكثرة ظلمه وعدوانه.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يُجَٰدِلُونَ فِيٓ ءَايَٰتِ ٱللَّهِ بِغَيۡرِ سُلۡطَٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِينَ ءَامَنُواْۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرٖ جَبَّارٖ ٥٣"
    },
    {
      "number": 4169,
      "text": "وَقَالَ فِرْعَوْنُ يَا هَامَانُ ابْنِ لِي صَرْحًا لَعَلِّي أَبْلُغُ الْأَسْبَابَ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 36,
      "juz": 24,
      "manzil": 6,
      "page": 471,
      "ruku": 407,
      "hizbQuarter": 188,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ فِرۡعَوۡنُ يَٰهَٰمَٰنُ ٱبۡنِ لِي صَرۡحٗا لَّعَلِّيٓ أَبۡلُغُ ٱلۡأَسۡبَٰبَ ٦٣\n                                    \n                                    \n                                    يقول تعالى مخبرا عن فرعون ، وعتوه ، وتمرده ، وافترائه في تكذيبه موسى - عليه السلام - أنه أمر وزيره هامان أن يبني له صرحا ، وهو : القصر العالي المنيف الشاهق . وكان اتخاذه من الآجر المضروب من الطين المشوي ، كما قال : ( فأوقد لي يا هامان على الطين فاجعل لي صرحا ) [ القصص : 38 ] ، ولهذا قال إبراهيم النخعي : كانوا يكرهون البناء بالآجر ، وأن يجعلوه في قبورهم . رواه ابن أبي حاتم .\n                                    ",
        "qortoby": "وَقَالَ فِرۡعَوۡنُ يَٰهَٰمَٰنُ ٱبۡنِ لِي صَرۡحٗا لَّعَلِّيٓ أَبۡلُغُ ٱلۡأَسۡبَٰبَ ٦٣\n                                    \n                                    \n                                    قوله تعالى : وقال فرعون يا هامان ابن لي صرحا لما قال مؤمن آل فرعون ما قال ، وخاف فرعون أن يتمكن كلام هذا المؤمن في قلوب القوم ، أوهم أنه يمتحن ما جاء به موسى من التوحيد ، فإن بان له صوابه لم يخفه عنهم ، وإن لم يصح ثبتهم على دينهم ، فأمر وزيره هامان ببناء الصرح . وقد مضى في [ القصص ] ذكره .\n                                    ",
        "saadi": "وَقَالَ فِرۡعَوۡنُ يَٰهَٰمَٰنُ ٱبۡنِ لِي صَرۡحٗا لَّعَلِّيٓ أَبۡلُغُ ٱلۡأَسۡبَٰبَ ٦٣\n                                        \n                                        \n                                        \n                                        { وَقَالَ فِرْعَوْنُ } معارضًا لموسى ومكذبًا له في دعوته إلى الإقرار برب العالمين، الذي على العرش استوى، وعلى الخلق اعتلى: { يَا هَامَانُ ابْنِ لِي صَرْحًا } أي: بناء عظيمًا مرتفعًا، والقصد منه لعلي أطلع { إلى إله موسى وإني لأظنه كاذبًا }\n                                    "
      },
      "originalText": "وَقَالَ فِرۡعَوۡنُ يَٰهَٰمَٰنُ ٱبۡنِ لِي صَرۡحٗا لَّعَلِّيٓ أَبۡلُغُ ٱلۡأَسۡبَٰبَ ٦٣"
    },
    {
      "number": 4170,
      "text": "أَسْبَابَ السَّمَاوَاتِ فَأَطَّلِعَ إِلَىٰ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُ كَاذِبًا ۚ وَكَذَٰلِكَ زُيِّنَ لِفِرْعَوْنَ سُوءُ عَمَلِهِ وَصُدَّ عَنِ السَّبِيلِ ۚ وَمَا كَيْدُ فِرْعَوْنَ إِلَّا فِي تَبَابٍ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 37,
      "juz": 24,
      "manzil": 6,
      "page": 471,
      "ruku": 407,
      "hizbQuarter": 188,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَسۡبَٰبَ ٱلسَّمَٰوَٰتِ فَأَطَّلِعَ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ كَٰذِبٗاۚ وَكَذَٰلِكَ زُيِّنَ لِفِرۡعَوۡنَ سُوٓءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِيلِۚ وَمَا كَيۡدُ فِرۡعَوۡنَ إِلَّا فِي تَبَابٖ ٧٣\n                                    \n                                    \n                                    وقوله : ( لعلي أبلغ الأسباب أسباب السماوات ) قال سعيد بن جبير ، وأبو صالح : أبواب السماوات . وقيل : طرق السماوات ( فأطلع إلى إله موسى وإني لأظنه كاذبا ) ، وهذا من كفره وتمرده ، أنه كذب موسى في أن الله - عز وجل - أرسله إليه ، قال الله تعالى : ( وكذلك زين لفرعون سوء عمله وصد عن السبيل ) أي : بصنيعه هذا الذي أراد أن يوهم به الرعية أنه يعمل شيئا يتوصل به إلى تكذيب موسى - عليه السلام - ولهذا قال تعالى : ( وما كيد فرعون إلا في تباب ) قال ابن عباس [ رضي الله عنهما ] ، ومجاهد : يعني إلا في خسار .\n                                    ",
        "qortoby": "أَسۡبَٰبَ ٱلسَّمَٰوَٰتِ فَأَطَّلِعَ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ كَٰذِبٗاۚ وَكَذَٰلِكَ زُيِّنَ لِفِرۡعَوۡنَ سُوٓءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِيلِۚ وَمَا كَيۡدُ فِرۡعَوۡنَ إِلَّا فِي تَبَابٖ ٧٣\n                                    \n                                    \n                                    لعلي أبلغ الأسباب أسباب السماوات أسباب السماوات بدل من الأول . وأسباب السماء أبوابها في قول قتادة والزهري والسدي والأخفش ، وأنشد [ زهير بن أبي سلمى ] :\nومن هاب أسباب المنايا ينلنه ولو رام أسباب السماء بسلم\nوقال أبو صالح : أسباب السماوات طرقها . وقيل : الأمور التي تستمسك بها السموات . وكرر \" أسباب \" تفخيما ; لأن الشيء إذا أبهم ثم أوضح كان تفخيما لشأنه . والله أعلم .\nفأطلع إلى إله موسى فأنظر إليه نظر مشرف عليه . توهم أنه جسم تحويه الأماكن . وكان فرعون يدعي الألوهية ويرى تحقيقها بالجلوس في مكان مشرف . وقراءة العامة \" فأطلع \" بالرفع نسقا على قوله : \" أبلغ \" وقرأ الأعرج والسلمي وعيسى وحفص فأطلع بالنصب ، قال أبو عبيدة : على جواب \" لعل \" بالفاء . النحاس : ومعنى النصب خلاف معنى الرفع ; لأن معنى النصب متى بلغت الأسباب اطلعت . ومعنى الرفع لعلي أبلغ الأسباب ثم لعلي أطلع بعد ذلك ، إلا أن ثم أشد تراخيا من الفاء .\nوإني لأظنه كاذبا أي وإني لأظن موسى كاذبا في ادعائه إلها دوني ، وإنما أفعل ما أفعل لإزاحة العلة . وهذا يوجب شك فرعون في أمر الله . وقيل : إن الظن بمعنى اليقين أي : وأنا أتيقن أنه كاذب ، وإنما أقول ما أقول لإزالة الشبهة عمن لا يتيقن ما أتيقنه .\nقوله تعالى : وكذلك زين لفرعون سوء عمله أي كما قال هذه المقالة وارتاب زين له الشيطان أو زين الله سوء عمله أي : الشرك والتكذيب . وصد عن السبيل قراءة الكوفيين وصد على ما لم يسم فاعله ، وهو اختيار أبي عبيد وأبي حاتم ، ويجوز على هذه القراءة \" وصد \" بكسر الصاد نقلت كسرة الدال على الصاد ، وهي قراءة يحيى بن وثاب وعلقمة . وقرأ ابن أبي إسحاق وعبد الرحمن بن بكرة \" وصد عن السبيل \" بالرفع والتنوين . الباقون \" وصد \" بفتح الصاد والدال . أي : صد فرعون الناس عن السبيل .\nوما كيد فرعون إلا في تباب أي في خسران وضلال ، ومنه : تبت يدا أبي لهب وقوله : وما زادوهم غير تتبيب وفي موضع غير تخسير فهد الله صرحه وغرقه هو وقومه على ما تقدم .\n                                    ",
        "saadi": "أَسۡبَٰبَ ٱلسَّمَٰوَٰتِ فَأَطَّلِعَ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ كَٰذِبٗاۚ وَكَذَٰلِكَ زُيِّنَ لِفِرۡعَوۡنَ سُوٓءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِيلِۚ وَمَا كَيۡدُ فِرۡعَوۡنَ إِلَّا فِي تَبَابٖ ٧٣\n                                        \n                                        \n                                        \n                                        { إلى إله موسى وإني لأظنه كاذبًا } في دعواه أن لنا ربًا، وأنه فوق السماوات.\nولكنه يريد أن يحتاط فرعون، ويختبر الأمر بنفسه، قال الله تعالى في بيان الذي حمله على هذا القول: { وَكَذَلِكَ زُيِّنَ لِفِرْعَوْنَ سُوءُ عَمَلِهِ } فزين له العمل السيئ، فلم يزل الشيطان يزينه، وهو يدعو إليه ويحسنه، حتى رآه حسنًا ودعا إليه وناظر مناظرة المحقين، وهو من أعظم المفسدين، { وَصُدَّ عَنِ السَّبِيلِ } الحق، بسبب الباطل الذي زين له. { وَمَا كَيْدُ فِرْعَوْنَ } الذي أراد أن يكيد به الحق، ويوهم به الناس أنه محق، وأن موسى مبطل { إِلَّا فِي تَبَابٍ } أي: خسار وبوار، لا يفيده إلا الشقاء في الدنيا والآخرة.\n                                    "
      },
      "originalText": "أَسۡبَٰبَ ٱلسَّمَٰوَٰتِ فَأَطَّلِعَ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ كَٰذِبٗاۚ وَكَذَٰلِكَ زُيِّنَ لِفِرۡعَوۡنَ سُوٓءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِيلِۚ وَمَا كَيۡدُ فِرۡعَوۡنَ إِلَّا فِي تَبَابٖ ٧٣"
    },
    {
      "number": 4171,
      "text": "وَقَالَ الَّذِي آمَنَ يَا قَوْمِ اتَّبِعُونِ أَهْدِكُمْ سَبِيلَ الرَّشَادِ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 38,
      "juz": 24,
      "manzil": 6,
      "page": 471,
      "ruku": 408,
      "hizbQuarter": 188,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِيلَ ٱلرَّشَادِ ٨٣\n                                    \n                                    \n                                    يقول المؤمن لقومه ممن تمرد وطغى وآثر الحياة الدنيا ، ونسي الجبار الأعلى ، فقال لهم : ( يا قوم اتبعون أهدكم سبيل الرشاد ) لا كما كذب فرعون في قوله : ( وما أهديكم إلا سبيل الرشاد ) .\n                                    ",
        "qortoby": "وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِيلَ ٱلرَّشَادِ ٨٣\n                                    \n                                    \n                                    قوله تعالى : وقال الذي آمن يا قوم اتبعون هذا من تمام ما قاله مؤمن آل فرعون ، أي : اقتدوا بي في الدين . أهدكم سبيل أي طريق الهدى وهو الجنة . وقيل : من قول موسى . وقرأ معاذ بن جبل \" الرشاد \" بتشديد الشين وهو لحن عند أكثر أهل العربية ; لأنه إنما يقال أرشد يرشد ولا يكون فعال من أفعل ، إنما يكون من الثلاثي ، فإن أردت التكثير من الرباعي قلت : مفعال . قال النحاس : يجوز أن يكون رشاد بمعنى يرشد لا على أنه مشتق منه ، ولكن كما يقال لآل من اللؤلؤ فهو بمعناه وليس جاريا عليه . ويجوز أن يكون رشاد من رشد يرشد أي : صاحب رشاد ، كما قال [ النابغة ] :\nكليني لهم يا أميمة ناصب\nالزمخشري : وقرئ \" الرشاد \" فعال من رشد بالكسر كعلام أو من رشد بالفتح كعباد . وقيل : من أرشد كجبار من أجبر وليس بذاك ; لأن فعالا من أفعل لم يجئ إلا في عدة أحرف ، نحو دراك وسئار وقصار وجبار . ولا يصح القياس على هذا القليل . ويجوز أن يكون نسبته إلى الرشد كعواج وبتات غير منظور فيه إلى فعل . ووقع في المصحف \" اتبعون \" بغير ياء . وقرأها يعقوب وابن كثير بالإثبات في الوصل والوقف . وحذفها أبو عمرو ونافع في الوقف وأثبتوها في الوصل ، إلا ورشا حذفها في الحالين ، وكذلك الباقون ; لأنها وقعت في المصحف بغير ياء ومن أثبتها فعلى الأصل .\n\n                                    ",
        "saadi": "وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِيلَ ٱلرَّشَادِ ٨٣\n                                        \n                                        \n                                        \n                                        { وَقَالَ الَّذِي آمَنَ } معيدًا نصيحته لقومه: { يَا قَوْمِ اتَّبِعُونِ أَهْدِكُمْ سَبِيلَ الرَّشَادِ } لا كما يقول لكم فرعون، فإنه لا يهديكم إلا طريق الغي والفساد.\n\n                                    "
      },
      "originalText": "وَقَالَ ٱلَّذِيٓ ءَامَنَ يَٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِيلَ ٱلرَّشَادِ ٨٣"
    },
    {
      "number": 4172,
      "text": "يَا قَوْمِ إِنَّمَا هَٰذِهِ الْحَيَاةُ الدُّنْيَا مَتَاعٌ وَإِنَّ الْآخِرَةَ هِيَ دَارُ الْقَرَارِ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 39,
      "juz": 24,
      "manzil": 6,
      "page": 471,
      "ruku": 408,
      "hizbQuarter": 188,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰقَوۡمِ إِنَّمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا مَتَٰعٞ وَإِنَّ ٱلۡأٓخِرَةَ هِيَ دَارُ ٱلۡقَرَارِ ٩٣\n                                    \n                                    \n                                    ثم زهدهم في الدنيا التي [ قد ] آثروها على الأخرى ، وصدتهم عن التصديق برسول الله موسى [ صلى الله عليه وسلم ] ، فقال : ( يا قوم إنما هذه الحياة الدنيا متاع ) أي : قليلة زائلة فانية عن قريب تذهب [ وتزول ] وتضمحل ، ( وإن الآخرة هي دار القرار ) أي : الدار التي لا زوال لها ، ولا انتقال منها ولا ظعن عنها إلى غيرها ، بل إما نعيم وإما جحيم ، ولهذا قال\n                                    ",
        "qortoby": "يَٰقَوۡمِ إِنَّمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا مَتَٰعٞ وَإِنَّ ٱلۡأٓخِرَةَ هِيَ دَارُ ٱلۡقَرَارِ ٩٣\n                                    \n                                    \n                                    قوله تعالى : ياقوم إنما هذه الحياة الدنيا متاع أي يتمتع بها قليلا ثم تنقطع وتزول . وإن الآخرة هي دار القرار أي الاستقرار والخلود . ومراده بالدار الآخرة الجنة والنار لأنهما لا يفنيان . بين ذلك بقوله :\n                                    ",
        "saadi": "يَٰقَوۡمِ إِنَّمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا مَتَٰعٞ وَإِنَّ ٱلۡأٓخِرَةَ هِيَ دَارُ ٱلۡقَرَارِ ٩٣\n                                        \n                                        \n                                        \n                                        { يَا قَوْمِ إِنَّمَا هَذِهِ الْحَيَاةُ الدُّنْيَا مَتَاعٌ } يتمتع بها ويتنعم قليلاً، ثم تنقطع وتضمحل، فلا تغرنكم وتخدعنكم عما خلقتم له { وَإِنَّ الْآخِرَةَ هِيَ دَارُ الْقَرَارِ } التي هي محل الإقامة، ومنزل السكون والاستقرار، فينبغي لكم أن تؤثروها، وتعملوا لها عملا يسعدكم فيها.\n                                    "
      },
      "originalText": "يَٰقَوۡمِ إِنَّمَا هَٰذِهِ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا مَتَٰعٞ وَإِنَّ ٱلۡأٓخِرَةَ هِيَ دَارُ ٱلۡقَرَارِ ٩٣"
    },
    {
      "number": 4173,
      "text": "مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزَىٰ إِلَّا مِثْلَهَا ۖ وَمَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَىٰ وَهُوَ مُؤْمِنٌ فَأُولَٰئِكَ يَدْخُلُونَ الْجَنَّةَ يُرْزَقُونَ فِيهَا بِغَيْرِ حِسَابٍ",
      "surah": {
        "number": 40,
        "name": "سورة غافر",
        "englishName": "Ghafir",
        "englishNameTranslation": "The Forgiver",
        "revelationType": "Meccan",
        "numberOfAyahs": 85
      },
      "numberInSurah": 40,
      "juz": 24,
      "manzil": 6,
      "page": 471,
      "ruku": 408,
      "hizbQuarter": 188,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَنۡ عَمِلَ سَيِّئَةٗ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ يُرۡزَقُونَ فِيهَا بِغَيۡرِ حِسَابٖ ٠٤\n                                    \n                                    \n                                    ( من عمل سيئة فلا يجزى إلا مثلها ) أي : واحدة مثلها ( ومن عمل صالحا من ذكر أو أنثى وهو مؤمن فأولئك يدخلون الجنة يرزقون فيها بغير حساب ) أي : لا يتقدر بجزاء بل يثيبه الله ثوابا كثيرا لا انقضاء له ولا نفاد .\n                                    ",
        "qortoby": "مَنۡ عَمِلَ سَيِّئَةٗ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ يُرۡزَقُونَ فِيهَا بِغَيۡرِ حِسَابٖ ٠٤\n                                    \n                                    \n                                    من عمل سيئة يعني الشرك فلا يجزى إلا مثلها وهو العذاب . ومن عمل صالحا من ذكر أو أنثى قال ابن عباس : يعني لا إله إلا الله . وهو مؤمن مصدق بقلبه لله وللأنبياء . \" فأولئك يدخلون الجنة يرزقون فيها بغير حساب \" بضم الياء على ما لم يسم فاعله . وهي قراءة ابن كثير وابن محيصن وأبي عمرو ويعقوب وأبي بكر عن عاصم ، يدل عليه يرزقون فيها بغير حساب الباقون يدخلون بفتح الياء .\n                                    ",
        "saadi": "مَنۡ عَمِلَ سَيِّئَةٗ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ يُرۡزَقُونَ فِيهَا بِغَيۡرِ حِسَابٖ ٠٤\n                                        \n                                        \n                                        \n                                        { مَنْ عَمِلَ سَيِّئَةً } من شرك أو فسوق أو عصيان { فَلَا يُجْزَى إِلَّا مِثْلَهَا } أي: لا يجازى إلا بما يسوؤه ويحزنه لأن جزاء السيئة السوء.\n{ وَمَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَى } من أعمال القلوب والجوارح، وأقوال اللسان { فَأُولَئِكَ يَدْخُلُونَ الْجَنَّةَ يُرْزَقُونَ فِيهَا بِغَيْرِ حِسَابٍ } أي: يعطون أجرهم بلا حد ولا عد، بل يعطيهم الله ما لا تبلغه أعمالهم.\n                                    "
      },
      "originalText": "مَنۡ عَمِلَ سَيِّئَةٗ فَلَا يُجۡزَىٰٓ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَٰلِحٗا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنٞ فَأُوْلَٰٓئِكَ يَدۡخُلُونَ ٱلۡجَنَّةَ يُرۡزَقُونَ فِيهَا بِغَيۡرِ حِسَابٖ ٠٤"
    }
  ]
}