{
  "number": 49,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 290,
      "text": "۞ وَإِنْ كُنْتُمْ عَلَىٰ سَفَرٍ وَلَمْ تَجِدُوا كَاتِبًا فَرِهَانٌ مَقْبُوضَةٌ ۖ فَإِنْ أَمِنَ بَعْضُكُمْ بَعْضًا فَلْيُؤَدِّ الَّذِي اؤْتُمِنَ أَمَانَتَهُ وَلْيَتَّقِ اللَّهَ رَبَّهُ ۗ وَلَا تَكْتُمُوا الشَّهَادَةَ ۚ وَمَنْ يَكْتُمْهَا فَإِنَّهُ آثِمٌ قَلْبُهُ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 283,
      "juz": 3,
      "manzil": 1,
      "page": 49,
      "ruku": 40,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن كُنتُمۡ عَلَىٰ سَفَرٖ وَلَمۡ تَجِدُواْ كَاتِبٗا فَرِهَٰنٞ مَّقۡبُوضَةٞۖ فَإِنۡ أَمِنَ بَعۡضُكُم بَعۡضٗا فَلۡيُؤَدِّ ٱلَّذِي ٱؤۡتُمِنَ أَمَٰنَتَهُۥ وَلۡيَتَّقِ ٱللَّهَ رَبَّهُۥۗ وَلَا تَكۡتُمُواْ ٱلشَّهَٰدَةَۚ وَمَن يَكۡتُمۡهَا فَإِنَّهُۥٓ ءَاثِمٞ قَلۡبُهُۥۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ عَلِيمٞ ٣٨٢\n                                        \n                                        \n                                        يقول تعالى : ( وإن كنتم على سفر ) أي : مسافرين وتداينتم إلى أجل مسمى ( ولم تجدوا كاتبا ) يكتب لكم . قال ابن عباس : أو وجدوه ولم يجد قرطاسا أو دواة أو قلما فرهن مقبوضة ، أي : فليكن بدل الكتابة رهان مقبوضة في يد صاحب الحق .\nوقد استدل بقوله : ( فرهان مقبوضة ) على أن الرهن لا يلزم إلا بالقبض ، كما هو مذهب الشافعي والجمهور ، واستدل بها آخرون على أنه لا بد أن يكون الرهن مقبوضا في يد المرتهن ، وهو رواية عن الإمامأحمد ، وذهب إليه طائفة .\nواستدل آخرون من السلف بهذه الآية على أنه لا يكون الرهن مشروعا إلا في السفر ، قاله مجاهد وغيره .\nوقد ثبت في الصحيحين ، عن أنس ، أن رسول الله صلى الله عليه وسلم توفي ودرعه مرهونة عند يهودي على ثلاثين وسقا من شعير ، رهنها قوتا لأهله . وفي رواية : من يهود المدينة . وفي رواية الشافعي : عند أبي الشحم اليهودي . وتقرير هذه المسائل في كتاب \" الأحكام الكبير \" ، ولله الحمد والمنة ، وبه المستعان .\nوقوله : ( فإن أمن بعضكم بعضا فليؤد الذي اؤتمن أمانته ) روى ابن أبي حاتم بإسناد جيد ، عن أبي سعيد الخدري أنه قال : هذه نسخت ما قبلها .\nوقال الشعبي : إذا ائتمن بعضكم بعضا فلا بأس ألا تكتبوا أو لا تشهدوا .\nوقوله : ( وليتق الله ربه ) يعنى : المؤتمن ، كما جاء في الحديث الذي رواه الإمام أحمد وأهل السنن ، من رواية قتادة ، عن الحسن ، عن سمرة : أن رسول الله صلى الله عليه وسلم قال : \" على اليد ما أخذت حتى تؤديه \" .\nوقوله : ( ولا تكتموا الشهادة ) أي : لا تخفوها وتغلوها ولا تظهروها . قال ابن عباس وغيره : شهادة الزور من أكبر الكبائر ، وكتمانها كذلك . ولهذا قال : ( ومن يكتمها فإنه آثم قلبه ) قال السدي : يعني : فاجر قلبه ، وهذه كقوله تعالى : ( ولا نكتم شهادة الله إنا إذا لمن الآثمين ) [ المائدة : 106 ] ، وقال تعالى : ( يا أيها الذين آمنوا كونوا قوامين بالقسط شهداء لله ولو على أنفسكم أو الوالدين والأقربين إن يكن غنيا أو فقيرا فالله أولى بهما فلا تتبعوا الهوى أن تعدلوا وإن تلووا أو تعرضوا فإن الله كان بما تعملون خبيرا ) [ النساء : 135 ] ، وهكذا قال هاهنا : ( ولا تكتموا الشهادة ومن يكتمها فإنه آثم قلبه والله بما تعملون عليم )\n                                    ",
        "qortoby": "وَإِن كُنتُمۡ عَلَىٰ سَفَرٖ وَلَمۡ تَجِدُواْ كَاتِبٗا فَرِهَٰنٞ مَّقۡبُوضَةٞۖ فَإِنۡ أَمِنَ بَعۡضُكُم بَعۡضٗا فَلۡيُؤَدِّ ٱلَّذِي ٱؤۡتُمِنَ أَمَٰنَتَهُۥ وَلۡيَتَّقِ ٱللَّهَ رَبَّهُۥۗ وَلَا تَكۡتُمُواْ ٱلشَّهَٰدَةَۚ وَمَن يَكۡتُمۡهَا فَإِنَّهُۥٓ ءَاثِمٞ قَلۡبُهُۥۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ عَلِيمٞ ٣٨٢\n                                        \n                                        \n                                        قوله تعالى : وإن كنتم على سفر ولم تجدوا كاتبا فرهان مقبوضة فإن أمن بعضكم بعضا فليؤد الذي اؤتمن أمانته وليتق الله ربه ولا تكتموا الشهادة ومن يكتمها فإنه آثم قلبه والله بما تعملون عليم\nفيه أربع وعشرون مسألة :\nالأولى : لما ذكر الله تعالى الندب إلى الإشهاد والكتب لمصلحة حفظ الأموال والأديان ، عقب ذلك بذكر حال الأعذار المانعة من الكتب ، وجعل لها الرهن ، ونص من أحوال العذر على السفر الذي هو غالب الأعذار ، لا سيما في ذلك الوقت لكثرة الغزو ، ويدخل في ذلك بالمعنى كل عذر . فرب وقت يتعذر فيه الكاتب في الحضر كأوقات أشغال الناس وبالليل ، وأيضا فالخوف على خراب ذمة الغريم عذر يوجب طلب الرهن . وقد رهن النبي صلى الله عليه وسلم درعه عند يهودي طلب منه سلف الشعير فقال : إنما يريد محمد أن يذهب بمالي . فقال النبي صلى الله عليه وسلم : كذب إني لأمين في الأرض أمين في السماء ولو ائتمنني لأديت اذهبوا إليه بدرعي فمات ودرعه مرهونة صلى الله عليه وسلم ، على ما يأتي بيانه آنفا .\nالثانية : قال جمهور من العلماء : الرهن في السفر بنص التنزيل ، وفي الحضر ثابت بسنة الرسول صلى الله عليه وسلم ، وهذا صحيح . وقد بينا جوازه في الحضر من الآية بالمعنى ، إذ قد تترتب الأعذار في الحضر ، ولم يرو عن أحد منعه في الحضر سوى مجاهد والضحاك وداود ، متمسكين بالآية . ولا حجة فيها ؛ لأن هذا الكلام وإن كان خرج مخرج الشرط فالمراد به غالب الأحوال . وليس كون الرهن في الآية في السفر مما يحظر في غيره . وفي الصحيحين وغيرهما عن عائشة أن النبي صلى الله عليه وسلم اشترى من يهودي طعاما إلى أجل ورهنه درعا له من حديد . وأخرجه النسائي من حديث ابن عباس قال : توفي رسول الله صلى الله عليه وسلم ودرعه مرهونة عند يهودي بثلاثين صاعا من شعير لأهله .\nالثالثة : قوله تعالى : ولم تجدوا كاتبا قرأ الجمهور \" كاتبا \" بمعنى رجل يكتب . وقرأ ابن عباس وأبي ومجاهد والضحاك وعكرمة وأبو العالية \" ولم تجدوا كتابا \" . قال أبو بكر الأنباري : فسره مجاهد فقال : معناه فإن لم تجدوا مدادا يعني في الأسفار . وروي عن ابن عباس \" كتابا \" . قال النحاس : هذه القراءة شاذة والعامة على خلافها . وقلما يخرج شيء عن قراءة العامة إلا وفيه مطعن ، ونسق الكلام على كاتب ، قال الله عز وجل قبل هذا : وليكتب بينكم كاتب بالعدل و \" كتاب \" يقتضي جماعة . قال ابن عطية : كتابا يحسن من حيث لكل نازلة كاتب ، فقيل للجماعة : ولم تجدوا كتابا . وحكى المهدوي عن أبي العالية أنه قرأ \" كتبا \" وهذا جمع كتاب من حيث النوازل مختلفة . وأما قراءة أبي وابن عباس \" كتابا \" فقال النحاس ومكي : هو جمع كاتب كقائم وقيام . مكي : المعنى وإن عدمت الدواة والقلم والصحيفة . ونفي وجود الكاتب يكون بعدم أي آلة اتفق ، ونفي الكاتب أيضا يقتضي نفي الكتاب ، فالقراءتان حسنتان إلا من جهة خط المصحف .\nالرابعة : قوله تعالى : فرهان مقبوضة وقرأ أبو عمرو وابن كثير \" فرهن \" بضم الراء والهاء ، وروي عنهما تخفيف الهاء . وقال الطبري : تأول قوم أن \" رهنا \" بضم الراء والهاء جمع رهان ، فهو جمع جمع ، وحكاه الزجاج عن الفراء . وقال المهدوي : فرهان ابتداء والخبر محذوف . والمعنى فرهان مقبوضة يكفي من ذلك . قال النحاس : وقرأ عاصم بن أبي النجود \" فرهن \" بإسكان الهاء ، ويروى عن أهل مكة . والباب في هذا \" رهان \" ، كما يقال : بغل وبغال ، وكبش وكباش ، ورهن سبيله أن يكون جمع رهان ، مثل كتاب وكتب . وقيل : هو جمع رهن ، مثل سقف وسقف ، وحلق وحلق ، وفرش وفرش ، ونشر ونشر ، وشبهه . \" ورهن \" بإسكان الهاء سبيله أن تكون الضمة حذفت لثقلها . وقيل : هو جمع رهن ، مثل سهم حشر أي دقيق ، وسهام حشر . والأول أولى ؛ لأن الأول ليس بنعت وهذا نعت . وقال أبو علي الفارسي : وتكسير \" رهن \" على أقل العدد لم أعلمه جاء ، فلو جاء كان قياسه أفعلا ككلب وأكلب ، وكأنهم استغنوا بالقليل عن الكثير ، كما استغني ببناء الكثير عن بناء القليل في قولهم : ثلاثة شسوع ، وقد استغني ببناء القليل عن الكثير في رسن وأرسان ، فرهن يجمع على بناءين وهما فعل وفعال . الأخفش : فعل على فعل قبيح وهو قليل شاذ ، قال : وقد يكون \" رهن \" جمعا للرهان ، كأنه يجمع رهن على رهان ، ثم يجمع رهان على رهن ، مثل فراش وفرش .\nالخامسة : معنى الرهن : احتباس العين وثيقة بالحق ليستوفى الحق من ثمنها أو من ثمن منافعها عند تعذر أخذه من الغريم ، وهكذا حده العلماء ، وهو في كلام العرب بمعنى الدوام والاستمرار . وقال ابن سيده : ورهنه أي أدامه ، ومن رهن بمعنى دام قول الشاعر :\nالخبز واللحم لهم راهن وقهوة راووقها ساكب\nقال الجوهري : ورهن الشيء رهنا أي دام . وأرهنت لهم الطعام والشراب أدمته لهم ، وهو طعام راهن . والراهن : الثابت ، والراهن : المهزول من الإبل والناس ، قال :\nإما تري جسمي خلا قد رهن هزلا وما مجد الرجال في السمن\nقال ابن عطية : ويقال في معنى الرهن الذي هو الوثيقة من الرهن : أرهنت إرهانا ، حكاه بعضهم . وقال أبو علي : أرهنت في المغالاة ، وأما في القرض والبيع فرهنت . وقال أبو زيد : أرهنت في السلعة إرهانا : غاليت بها ، وهو في الغلاء خاصة . قال ( مهرة بن حيدان أبو قبيلة ) :\nيطوي ابن سلمة بها من راكب بعرا عيدية أرهنت فيها الدنانير\nيصف ناقة . والعيد بطن من مهرة ، وإبل مهرة موصوفة بالنجابة . وقال الزجاج : يقال في الرهن : رهنت وأرهنت ، وقاله ابن الأعرابي والأخفش . قال عبد الله بن همام السلولي :\nفلما خشيت أظافيرهم نجوت وأرهنتهم مالكا\nقال ثعلب : الرواة كلهم على ( أرهنتهم ) ، على أنه يجوز رهنته وأرهنته ، إلا الأصمعي فإنه رواه وأرهنهم ، على أنه عطف بفعل مستقبل على فعل ماض ، وشبهه بقولهم : قمت وأصك وجهه ، وهو مذهب حسن ؛ لأن الواو واو الحال ، فجعل أصك حالا للفعل الأول على معنى قمت صاكا وجهه ، أي تركته مقيما عندهم ؛ لأنه لا يقال : أرهنت الشيء ، وإنما يقال : رهنته . وتقول : رهنت لساني بكذا ، ولا يقال فيه : أرهنت . وقال ابن السكيت : أرهنت فيها بمعنى أسلفت . والمرتهن : الذي يأخذ الرهن . والشيء مرهون ورهين ، والأنثى رهينة . وراهنت فلانا على كذا مراهنة : خاطرته . وأرهنت به ولدي إرهانا : أخطرتهم به خطرا . والرهينة واحدة الرهائن ، كله عن الجوهري . ابن عطية : ويقال بلا خلاف في البيع والقرض : رهنت رهنا ، ثم سمي بهذا المصدر الشيء المدفوع تقول : رهنت رهنا ، كما تقول رهنت ثوبا .\nالسادسة : قال أبو علي : ولما كان الرهن بمعنى الثبوت والدوام ؛ فمن ثم بطل الرهن عند الفقهاء إذا خرج من يد المرتهن إلى الراهن بوجه من الوجوه ؛ لأنه فارق ما جعل باختيار المرتهن له .\nقلت : هذا هو المعتمد عندنا في أن الرهن متى رجع إلى الراهن باختيار المرتهن بطل الرهن ، وقاله أبو حنيفة ، غير أنه قال : إن رجع بعارية أو وديعة لم يبطل . وقال الشافعي : إن رجوعه إلى يد الراهن مطلقا لا يبطل حكم القبض المتقدم ، ودليلنا فرهان مقبوضة ، فإذا خرج عن يد القابض لم يصدق ذلك اللفظ عليه لغة ، فلا يصدق عليه حكما ، وهذا واضح .\nالسابعة : إذا رهنه قولا ولم يقبضه فعلا لم يوجب ذلك ، حكما ، لقوله تعالى : فرهان مقبوضة قال الشافعي : لم يجعل الله الحكم إلا برهن موصوف بالقبض ، فإذا عدمت الصفة وجب أن يعدم الحكم ، وهذا ظاهر جدا . وقالت المالكية : يلزم الرهن بالعقد ويجبر الراهن على دفع الرهن ليحوزه المرتهن ، لقوله تعالى : أوفوا بالعقود وهذا عقد ، وقوله ( بالعهد ) وهذا عهد . وقوله عليه السلام : المؤمنون عند شروطهم وهذا شرط ، فالقبض عندنا شرط في كمال فائدته . وعندهما شرط في لزومه وصحته .\nالثامنة : قوله تعالى : مقبوضة يقتضي بينونة المرتهن بالرهن . وأجمع الناس على صحة قبض المرتهن ، وكذلك على قبض وكيله . واختلفوا في قبض عدل يوضع الرهن على يديه ، فقال مالك وجميع أصحابه وجمهور العلماء : قبض العدل قبض . وقال ابن أبي ليلى وقتادة والحكم وعطاء : ليس بقبض ، ولا يكون مقبوضا إلا إذا كان عند المرتهن ، ورأوا ذلك تعبدا . وقول الجمهور أصح من جهة المعنى ؛ لأنه إذا صار عند العدل صار مقبوضا لغة وحقيقة ؛ لأن العدل نائب عن صاحب الحق وبمنزلة الوكيل ، وهذا ظاهر .\nالتاسعة : ولو وضع الرهن على يدي عدل فضاع لم يضمن المرتهن ولا الموضوع على يده ؛ لأن المرتهن لم يكن في يده شيء يضمنه . والموضوع على يده أمين والأمين غير ضامن .\nالعاشرة : لما قال تعالى : ( مقبوضة ) قال علماؤنا : فيه ما يقتضي بظاهره ومطلقه جواز رهن المشاع . خلافا لأبي حنيفة وأصحابه ، لا يجوز عندهم أن يرهنه ثلث دار ولا نصفا من عبد ولا سيف ، ثم قالوا : إذا كان لرجلين على رجل مال هما فيه شريكان فرهنهما بذلك أرضا فهو جائز إذا قبضاها . قال ابن المنذر : وهذا إجازة رهن المشاع ؛ لأن كل واحد منهما مرتهن نصف دار . قال ابن المنذر : رهن المشاع جائز كما يجوز بيعه .\nالحادية عشرة : ورهن ما في الذمة جائز عند علمائنا ؛ لأنه مقبوض خلافا لمن منع ذلك ، ومثاله رجلان تعاملا لأحدهما على الآخر دين فرهنه دينه الذي عليه . قال ابن خويزمنداد : وكل عرض جاز بيعه جاز رهنه ، ولهذه العلة جوزنا رهن ما في الذمة ؛ لأن بيعه جائز ، ولأنه مال تقع الوثيقة به فجاز أن يكون رهنا ، قياسا على سلعة موجودة . وقال من منع ذلك : لأنه لا يتحقق إقباضه والقبض شرط في لزوم الرهن ؛ لأنه لابد أن يستوفى الحق منه عند المحل ، ويكون الاستيفاء من ماليته لا من عينه ولا يتصور ذلك في الدين .\nالثانية عشرة : روى البخاري عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : الظهر يركب بنفقته إذا كان مرهونا ، ولبن الدر يشرب بنفقته إذا كان مرهونا وعلى الذي يركب ويشرب النفقة . وأخرجه أبو داود وقال بدل ( يشرب ) في الموضعين : ( يحلب ) . قال الخطابي : هذا كلام مبهم ليس في نفس اللفظ بيان من يركب ويحلب ، هل الراهن أو المرتهن أو العدل الموضوع على يده الرهن ؟ .\nقلت : قد جاء ذلك مبينا مفسرا في حديثين ، وبسببهما اختلف العلماء في ذلك ، فروى الدارقطني من حديث أبي هريرة ذكر النبي صلى الله عليه وسلم قال : إذا كانت الدابة مرهونة فعلى المرتهن علفها ، ولبن الدر يشرب وعلى الذي يشرب نفقته . أخرجه عن أحمد بن علي بن العلاء حدثنا زياد بن أيوب حدثنا هشيم حدثنا زكريا عن الشعبي عن أبي هريرة . وهو قول أحمد وإسحاق : أن المرتهن ينتفع من الرهن بالحلب والركوب بقدر النفقة . وقال أبو ثور : إذا كان الراهن ينفق عليه لم ينتفع به المرتهن . وإن كان الراهن لا ينفق عليه وتركه في يد المرتهن فأنفق عليه فله ركوبه واستخدام العبد . وقاله الأوزاعي والليث . الحديث الثاني خرجه الدارقطني أيضا ، وفي إسناده مقال ويأتي بيانه - من حديث إسماعيل بن عياش عن ابن أبي ذئب عن الزهري عن المقبري عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : لا يغلق الرهن ولصاحبه غنمه وعليه غرمه . وهو قول الشافعي والشعبي وابن سيرين . وهو قول مالك وأصحابه . قال الشافعي : منفعة الرهن للراهن ، ونفقته عليه ، والمرتهن لا ينتفع بشيء من الرهن خلا الإحفاظ للوثيقة . قال الخطابي : وهو أولى الأقوال وأصحها ، بدليل قوله عليه السلام : لا يغلق الرهن من صاحبه الذي رهنه ، له غنمه وعليه غرمه . قال الخطابي : وقوله : ( من صاحبه ) : أي لصاحبه . والعرب تضع \" من \" موضع اللام ، كقولهم ( زهير ) :\nأمن أم أوفى دمنة لم تكلم\nقلت : قد جاء صريحا ( لصاحبه ) فلا حاجة للتأويل . وقال الطحاوي : كان ذلك وقت كون الربا مباحا ، ولم ينه عن قرض جر منفعة ، ولا عن أخذ الشيء بالشيء وإن كانا غير متساويين ، ثم حرم الربا بعد ذلك . وقد أجمعت الأمة على أن الأمة المرهونة لا يجوز للراهن أن يطأها ، فكذلك لا يجوز له خدمتها . وقد قال الشعبي : لا ينتفع من الرهن بشيء . فهذا الشعبي روى الحديث وأفتى بخلافه ، ولا يجوز عنده ذلك إلا وهو منسوخ . وقال ابن عبد البر وقد أجمعوا أن لبن الرهن وظهره للراهن . ولا يخلو من أن يكون احتلاب المرتهن له بإذن الراهن أو بغير إذنه ، فإن كان بغير إذنه ففي حديث ابن عمر عن النبي صلى الله عليه وسلم : لا يحتلبن أحد ماشية أحد إلا بإذنه ما يرده ويقضي بنسخه . وإن كان بإذنه ففي الأصول المجتمع عليها في تحريم المجهول والغرر وبيع ما ليس عندك وبيع ما لم يخلق ، ما يرده أيضا ، فإن ذلك كان قبل نزول تحريم الربا . والله أعلم .\nوقال ابن خويزمنداد : ولو شرط المرتهن الانتفاع بالرهن فلذلك حالتان : إن كان من قرض لم يجز ، وإن كان من بيع أو إجارة جاز ؛ لأنه يصير بائعا للسلعة بالثمن المذكور ومنافع الرهن مدة معلومة فكأنه بيع وإجارة ، وأما في القرض فلأنه يصير قرضا جر منفعة ، ولأن موضوع القرض أن يكون قربة ، فإذا دخله نفع صار زيادة في الجنس وذلك ربا .\nالثالثة عشرة : لا يجوز غلق الرهن ، وهو أن يشترط المرتهن أنه له بحقه إن لم يأته به عند أجله . وكان هذا من فعل الجاهلية فأبطله النبي صلى الله عليه وسلم بقوله : ( لا يغلق الرهن ) هكذا قيدناه برفع القاف على الخبر ، أي ليس يغلق الرهن . تقول : أغلقت الباب فهو مغلق . وغلق الرهن في يد مرتهنه إذا لم يفتك ، قال الشاعر :\nأجارتنا من يجتمع يتفرق ومن يك رهنا للحوادث يغلق\nوقال زهير :\nوفارقتك برهن لا فكاك له يوم الوداع فأمسى الرهن قد غلقا\nالرابعة عشرة : روى الدارقطني من حديث سفيان بن عيينة عن زياد بن سعد عن الزهري عن سعيد بن المسيب عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : لا يغلق الرهن له غنمه وعليه غرمه . زياد بن سعد أحد الحفاظ الثقات ، وهذا إسناد حسن . وأخرجه مالك عن ابن شهاب عن سعيد بن المسيب مرسلا أن رسول الله صلى الله عليه وسلم قال : ( لا يغلق الرهن ) . قال أبو عمر : وهكذا رواه كل من روى الموطأ عن مالك فيما علمت ، إلا معن بن عيسى فإنه وصله ، ومعن ثقة ، إلا أني أخشى أن يكون الخطأ فيه من علي بن عبد الحميد الغضائري عن مجاهد بن موسى عن معن بن عيسى . وزاد فيه أبو عبد الله عمروس عن الأبهري بإسناده : ( له غنمه وعليه غرمه ) . وهذه اللفظة قد اختلف الرواة في رفعها ، فرفعها ابن أبي ذئب ومعمر وغيرهما . ورواه ابن وهب وقال : قال يونس قال ابن شهاب : وكان سعيد بن المسيب يقول : الرهن ممن رهنه ، له غنمه وعليه غرمه ، فأخبر ابن شهاب أن هذا من قول سعيد لا عن النبي صلى الله عليه وسلم . إلا أن معمرا ذكره عن ابن شهاب مرفوعا ، ومعمر أثبت الناس في ابن شهاب . وتابعه على رفعه يحيى بن أبي أنيسة ويحيى ليس بالقوي . وأصل هذا الحديث عند أهل العلم بالنقل مرسل ، وإن كان قد وصل من جهات كثيرة فإنهم يعللونها . وهو مع هذا حديث لا يرفعه أحد منهم وإن اختلفوا في تأويله ومعناه . ورواه الدارقطني أيضا عن إسماعيل بن عياش عن ابن أبي ذئب عن الزهري عن سعيد عن أبي هريرة مرفوعا . قال أبو عمر : لم يسمعه إسماعيل من ابن أبي ذئب وإنما سمعه من عباد بن كثير عن ابن أبي ذئب ، وعباد عندهم ضعيف لا يحتج به . وإسماعيل عندهم أيضا غير مقبول الحديث إذا حدث عن غير أهل بلده ، فإذا حدث عن الشاميين فحديثه مستقيم ، وإذا حدث عن المدنيين وغيرهم ففي حديثه خطأ كثير واضطراب .\nالخامسة عشرة : : نماء الرهن داخل معه إن كان لا يتميز كالسمن ، أو كان نسلا كالولادة والنتاج ، وفي معناه فسيل النخل ، وما عدا ذلك من غلة وثمرة ولبن وصوف فلا يدخل فيه إلا أن يشترطه . والفرق بينهما أن الأولاد تبع في الزكاة للأمهات ، وليس كذلك الأصواف والألبان وثمر الأشجار ؛ لأنها ليست تبعا للأمهات في الزكاة ولا هي في صورها ولا في معناها ولا تقوم معها ، فلها حكم نفسها لا حكم الأصل خلاف الولد والنتاج . والله أعلم بصواب ذلك .\nالسادسة عشرة : ورهن من أحاط الدين بماله جائز ما لم يفلس ، ويكون المرتهن أحق بالرهن من الغرماء ، قاله مالك وجماعة من الناس . وروي عن مالك خلاف هذا - وقاله عبد العزيز بن أبي سلمة - إن الغرماء يدخلون معه في ذلك وليس بشيء ؛ لأن من لم يحجر عليه فتصرفاته صحيحة في كل أحواله من بيع وشراء ، والغرماء عاملوه على أنه يبيع ويشتري ويقضي ، لم يختلف قول مالك في هذا الباب ، فكذلك الرهن . والله أعلم .\nالسابعة عشرة : فإن أمن بعضكم بعضا الآية شرط ربط به وصية الذي عليه الحق بالأداء وترك المطل . يعني إن كان الذي عليه الحق أمينا عند صاحب الحق وثقة فليؤد له ما عليه اؤتمن .\nوقوله : ( فليؤد ) من الأداء مهموز ، وهو جواب الشرط ويجوز تخفيف همزه فتقلب الهمزة واوا ولا تقلب ألفا ولا تجعل بين بين ؛ لأن الألف لا يكون ما قبلها إلا مفتوحا . وهو أمر معناه الوجوب ، بقرينة الإجماع على وجوب أداء الديون ، وثبوت حكم الحاكم به وجبره الغرماء عليه ، وبقرينة الأحاديث الصحاح في تحريم مال الغير .\nالثامنة عشرة : قوله تعالى : ( أمانته ) : الأمانة مصدر سمي به الشيء الذي في الذمة ، وأضافها إلى الذي عليه الدين من حيث لها إليه نسبة ، كما قال تعالى : ولا تؤتوا السفهاء أموالكم .\nالتاسعة عشرة : قوله تعالى : وليتق الله ربه أي في ألا يكتم من الحق شيئا . ولا تكتموا الشهادة تفسير لقوله : \" ولا يضارر \" بكسر العين . نهى الشاهد عن أن يضر بكتمان الشهادة ، وهو نهي على الوجوب بعدة قرائن منها الوعيد . وموضع النهي هو حيث يخاف الشاهد ضياع حق . وقال ابن عباس : على الشاهد أن يشهد حيثما استشهد ، ويخبر حيثما استخبر ، قال : ولا تقل أخبر بها عند الأمير بل أخبره بها لعله يرجع ويرعوي . وقرأ أبو عبد الرحمن \" ولا يكتموا \" بالياء ، جعله نهيا للغائب .\nالموفية عشرين : إذا كان على الحق شهود تعين عليهم أداؤها على الكفاية ، فإن أداها اثنان واجتزأ الحاكم بهما سقط الفرض عن الباقين ، وإن لم يجتزأ بها تعين المشي إليه حتى يقع الإثبات . وهذا يعلم بدعاء صاحبها ، فإذا قال له : أحيي حقي بأداء ما عندك لي من الشهادة تعين ذلك عليه .\nالحادية والعشرون : قوله تعالى : ومن يكتمها فإنه آثم قلبه خص القلب بالذكر إذ الكتم من أفعاله ، وإذ هو المضغة التي بصلاحها يصلح الجسد كله كما قال عليه السلام فعبر بالبعض عن الجملة ، وقد تقدم في أول السورة . وقال الكيا : لما عزم على ألا يؤديها وترك أداءها باللسان رجع المأثم إلى الوجهين جميعا . فقوله آثم قلبه مجاز ، وهو آكد من الحقيقة في الدلالة على الوعيد ، وهو من بديع البيان ولطيف الإعراب عن المعاني . يقال : إثم القلب سبب مسخه ، والله تعالى إذا مسخ قلبا جعله منافقا وطبع عليه ، نعوذ بالله منه وقد تقدم في أول السورة . و ( قلبه ) رفع ب ( آثم ) و ( آثم ) خبر ، \" إن \" ، وإن شئت رفعت آثما بالابتداء ، و ( قلبه ) فاعل يسد مسد الخبر والجملة خبر إن . وإن شئت رفعت آثما على أنه خبر الابتداء تنوي به التأخير . وإن شئت كان ( قلبه ) بدلا من ( آثم ) بدل البعض من الكل . وإن شئت كان بدلا من المضمر الذي في ( آثم ) .\nوتعرضت هنا ثلاث مسائل تتمة أربع وعشرين :\nالأولى : اعلم أن الذي أمر الله تعالى به من الشهادة والكتابة لمراعاة صلاح ذات البين ونفي التنازع المؤدي إلى فساد ذات البين ، لئلا يسول له الشيطان جحود الحق وتجاوز ما حد له الشرع ، أو ترك الاقتصار على المقدار المستحق ، ولأجله حرم الشرع البياعات المجهولة التي اعتيادها يؤدي إلى الاختلاف وفساد ذات البين وإيقاع التضاغن والتباين . فمن ذلك ما حرمه الله من الميسر والقمار وشرب الخمر بقوله تعالى : إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر الآية . فمن تأدب بأدب الله في أوامره وزواجره حاز صلاح الدنيا والدين ، قال الله تعالى : ولو أنهم فعلوا ما يوعظون به لكان خيرا لهم الآية .\nالثانية : روى البخاري عن أبي هريرة عن النبي صلى الله عليه وسلم قال : من أخذ أموال الناس يريد أداءها أدى الله عنه ومن أخذها يريد إتلافها أتلفه الله وروى النسائي عن ميمونة زوج النبي صلى الله عليه وسلم أنها استدانت ، فقيل : يا أم المؤمنين ، تستدينين وليس عندك وفاء ؟ قالت : إني سمعت رسول الله صلى الله عليه وسلم يقول : من أخذ دينا وهو يريد أن يؤديه أعانه الله عليه . وروى الطحاوي وأبو جعفر الطبري والحارث بن أبي أسامة في مسنده عن عقبة بن عامر أن رسول الله صلى الله عليه وسلم قال : لا تخيفوا الأنفس بعد أمنها قالوا : يا رسول الله ، وما ذاك ؟ قال : ( الدين ) . وروى البخاري عن أنس عن النبي صلى الله عليه وسلم في دعاء ذكره : اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والجبن والبخل وضلع الدين وغلبة الرجال . قال العلماء : ضلع الدين هو الذي لا يجد دائنه من حيث يؤديه . وهو مأخوذ من قول العرب : حمل مضلع أي ثقيل ، ودابة مضلع لا تقوى على الحمل ، قاله صاحب العين . وقال صلى الله عليه وسلم : الدين شين الدين . وروي عنه أنه قال : الدين هم بالليل ومذلة بالنهار . قال علماؤنا : وإنما كان شينا ومذلة لما فيه من شغل القلب والبال والهم اللازم في قضائه ، والتذلل للغريم عند لقائه ، وتحمل منته بالتأخير إلى حين أوانه . وربما يعد من نفسه القضاء فيخلف ، أو يحدث الغريم بسببه فيكذب ، أو يحلف له فيحنث ، إلى غير ذلك . ولهذا كان عليه السلام يتعوذ من المأثم والمغرم ، وهو الدين . فقيل له : يا رسول الله ، ما أكثر ما تتعوذ من المغرم ؟ فقال : إن الرجل إذا غرم حدث فكذب ووعد فأخلف . وأيضا فربما قد مات ولم يقض الدين فيرتهن به ، كما قال عليه السلام : نسمة المؤمن مرتهنة في قبره بدينه حتى يقضى عنه . وكل هذه الأسباب مشائن في الدين تذهب جماله وتنقص كماله . والله أعلم\nالثالثة : لما أمر الله تعالى بالكتب والإشهاد وأخذ الرهان كان ذلك نصا قاطعا على مراعاة حفظ الأموال وتنميتها ، وردا على الجهلة المتصوفة ورعاعها الذين لا يرون ذلك ، فيخرجون عن جميع أموالهم ولا يتركون كفاية لأنفسهم وعيالهم ، ثم إذا احتاج وافتقر عياله فهو إما أن يتعرض لمنن الإخوان أو لصدقاتهم ، أو أن يأخذ من أرباب الدنيا وظلمتهم ، وهذا الفعل مذموم منهي عنه . قال أبو الفرج الجوزي : ولست أعجب من المتزهدين الذين فعلوا هذا مع قلة علمهم ، إنما أتعجب من أقوام لهم علم وعقل كيف حثوا على هذا ، وأمروا به مع مضادته للشرع والعقل . فذكر المحاسبي في هذا كلاما كثيرا ، وشيده أبو حامد الطوسي ونصره . والحارث عندي أعذر من أبي حامد ؛ لأن أبا حامد كان أفقه ، غير أن دخوله في التصوف أوجب عليه نصرة ما دخل فيه . قال المحاسبي في كلام طويل له : ولقد بلغني أنه لما توفي عبد الرحمن بن عوف قال ناس من أصحاب رسول الله صلى الله عليه وسلم إنما نخاف على عبد الرحمن فيما ترك . فقال كعب : سبحان الله! وما تخافون على عبد الرحمن ؟ كسب طيبا وأنفق طيبا وترك طيبا . فبلغ ذلك أبا ذر فخرج مغضبا يريد كعبا ، فمر بلحى بعير فأخذه بيده ، ثم انطلق يطلب كعبا ، فقيل لكعب : إن أبا ذر يطلبك . فخرج هاربا حتى ، دخل على عثمان يستغيث به وأخبره الخبر . فأقبل أبو ذر يقص الأثر في طلب كعب حتى انتهى إلى دار عثمان ، فلما دخل قام كعب فجلس خلف عثمان هاربا من أبي ذر ، فقال له أبو ذر : يا ابن اليهودية ، تزعم ألا بأس بما تركه عبد الرحمن ! لقد خرج رسول الله صلى الله عليه وسلم يوما فقال : الأكثرون هم الأقلون يوم القيامة إلا من قال هكذا وهكذا . قال المحاسبي : فهذا عبد الرحمن مع فضله يوقف في عرصة يوم القيامة بسبب ما كسبه من حلال ، للتعفف وصنائع المعروف فيمنع السعي إلى الجنة مع الفقراء وصار يحبو في آثارهم حبوا ، إلى غير ذلك من كلامه . ذكره أبو حامد وشيده وقواه بحديث ثعلبة ، وأنه أعطي المال فمنع الزكاة . قال أبو حامد : فمن راقب أحوال الأنبياء والأولياء وأقوالهم لم يشك في أن فقد المال أفضل من وجوده ، وإن صرف إلى الخيرات ، إذ أقل ما فيه اشتغال الهمة بإصلاحه عن ذكر الله . فينبغي للمريد أن يخرج عن ماله حتى لا يبقى له إلا قدر ضرورته ، فما بقي له درهم يلتفت إليه قلبه فهو محجوب عن الله تعالى . قال الجوزي : وهذا كله خلاف الشرع والعقل ، وسوء فهم المراد بالمال ، وقد شرفه الله وعظم قدره وأمر بحفظه ، إذ جعله قواما للآدمي وما جعل قواما للآدمي الشريف فهو شريف ، فقال تعالى : ولا تؤتوا السفهاء أموالكم التي جعل الله لكم قياما ونهى جل وعز أن يسلم المال إلى غير رشيد فقال : فإن آنستم منهم رشدا فادفعوا إليهم أموالهم . ونهى النبي صلى الله عليه وسلم عن إضاعة المال ، قال لسعد : إنك أن تذر ورثتك أغنياء خير من أن تذرهم عالة يتكففون الناس . وقال : ما نفعني مال كمال أبي بكر . وقال لعمرو بن العاص : نعم المال الصالح للرجل الصالح . ودعا لأنس ، وكان في آخر دعائه : اللهم أكثر ماله وولده وبارك له فيه . وقال كعب : يا رسول الله ، إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله . فقال : أمسك عليك بعض مالك فهو خير لك . قال الجوزي : هذه الأحاديث مخرجة في الصحاح ، وهي على خلاف ما تعتقده المتصوفة من أن إكثار المال حجاب وعقوبة ، وأن حبسه ينافي التوكل ، ولا ينكر أنه يخاف من فتنته ، وأن خلقا كثيرا اجتنبوه لخوف ذلك ، وأن جمعه من وجهه ليعز ، وأن سلامة القلب من الافتتان به تقل ، واشتغال القلب مع وجوده بذكر الآخرة يندر ، فلهذا خيف فتنته . فأما كسب المال فإن من اقتصر على كسب البلغة من حلها فذلك أمر لا بد منه وأما من قصد جمعه والاستكثار منه من الحلال نظر في مقصوده ، فإن قصد نفس المفاخرة والمباهاة فبئس المقصود ، وإن قصد إعفاف نفسه وعائلته ، وادخر لحوادث زمانه وزمانهم ، وقصد التوسعة على الإخوان وإغناء الفقراء وفعل المصالح أثيب على قصده ، وكان جمعه بهذه النية أفضل من كثير من الطاعات . وقد كانت نيات خلق كثير من الصحابة في جمع المال سليمة لحسن مقاصدهم بجمعه ، فحرصوا عليه وسألوا زيادته . ولما أقطع النبي صلى الله عليه وسلم الزبير حضر فرسه أجرى الفرس حتى قام ثم رمى سوطه ، فقال : أعطوه حيث بلغ سوطه . وكان سعد بن عبادة يقول في دعائه : اللهم وسع علي . وقال إخوة يوسف : ونزداد كيل بعير . وقال شعيب لموسى : فإن أتممت عشرا فمن عندك . وإن أيوب لما عوفي نثر عليه رجل من جراد من ذهب ، فأخذ يحثي في ثوبه ويستكثر منه ، فقيل له : أما شبعت ؟ فقال : يا رب فقير يشبع من فضلك ؟ . وهذا أمر مركوز في الطباع . وأما كلام المحاسبي فخطأ يدل على الجهل بالعلم ، وما ذكره من حديث كعب وأبي ذر فمحال . من وضع الجهال وخفيت عدم صحته عنه للحوقه بالقوم . وقد روي بعض هذا وإن كان طريقه لا يثبت ؛ لأن في سنده ابن لهيعة وهو مطعون فيه . قال يحيى : لا يحتج بحديثه . والصحيح في التاريخ أن أبا ذر توفي سنة خمس وعشرين ، وعبد الرحمن بن عوف توفي سنة اثنتين وثلاثين ، فقد عاش بعد أبي ذر سبع سنين . ثم لفظ ما ذكروه من حديثهم يدل على أن حديثهم موضوع ، ثم كيف تقول الصحابة : إنا نخاف على عبد الرحمن ! أوليس الإجماع منعقدا على إباحة جمع المال من حله ، فما وجه الخوف مع الإباحة ؟ أويأذن الشرع في شيء ثم يعاقب عليه ؟ هذا قلة فهم وفقه . ثم أينكر أبو ذر على عبد الرحمن ، وعبد الرحمن خير من أبي ذر بما لا يتقارب ؟ ثم تعلقه بعبد الرحمن وحده دليل على أنه لم يسبر سير الصحابة ، فإنه قد خلف طلحة ثلاثمائة بهار في كل بهار ثلاثة قناطير . والبهار الحمل . وكان مال الزبير خمسين ألفا ومائتي ألف . وخلف ابن مسعود تسعين ألفا . وأكثر الصحابة كسبوا الأموال وخلفوها ولم ينكر أحد منهم على أحد . وأما قوله : \" إن عبد الرحمن يحبو حبوا يوم القيامة \" فهذا دليل على أنه ما عرف الحديث ، وأعوذ بالله أن يحبو عبد الرحمن في القيامة ، أفترى من سبق وهو أحد العشرة ، المشهود لهم بالجنة ومن أهل بدر والشورى يحبو ؟ ثم الحديث يرويه عمارة بن زاذان ، وقال البخاري : ربما اضطرب حديثه . وقال أحمد : يروي عن أنس أحاديث مناكير ، وقال أبو حاتم الرازي : لا يحتج به . وقال الدارقطني : ضعيف . وقوله : \" ترك المال الحلال أفضل من جمعه \" ليس كذلك ، ومتى صح القصد فجمعه أفضل بلا خلاف عند العلماء . وكان سعيد بن المسيب يقول : لا خير فيمن لا يطلب المال ، يقضي به دينه ويصون به عرضه ، فإن مات تركه ميراثا لمن بعده . وخلف ابن المسيب أربعمائة دينار ، وخلف سفيان الثوري مائتين ، وكان يقول : المال في هذا الزمان سلاح . وما زال السلف يمدحون المال ويجمعونه للنوائب وإعانة الفقراء ، وإنما تحاماه قوم منهم إيثارا للتشاغل بالعبادات ، وجمع الهم فقنعوا باليسير . فلو قال هذا القائل : إن التقليل منه أولى قرب الأمر ولكنه زاحم به مرتبة الإثم .\nقلت : ومما يدل على حفظ الأموال ومراعاتها إباحة القتال دونها وعليها ، قال صلى الله عليه وسلم : من قتل دون ماله فهو شهيد . وسيأتي بيانه في \" المائدة \" إن شاء الله تعالى .\n                                    ",
        "saadi": "وَإِن كُنتُمۡ عَلَىٰ سَفَرٖ وَلَمۡ تَجِدُواْ كَاتِبٗا فَرِهَٰنٞ مَّقۡبُوضَةٞۖ فَإِنۡ أَمِنَ بَعۡضُكُم بَعۡضٗا فَلۡيُؤَدِّ ٱلَّذِي ٱؤۡتُمِنَ أَمَٰنَتَهُۥ وَلۡيَتَّقِ ٱللَّهَ رَبَّهُۥۗ وَلَا تَكۡتُمُواْ ٱلشَّهَٰدَةَۚ وَمَن يَكۡتُمۡهَا فَإِنَّهُۥٓ ءَاثِمٞ قَلۡبُهُۥۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ عَلِيمٞ ٣٨٢\n                                        \n                                        \n                                        \n                                        أي: إن كنتم مسافرين { ولم تجدوا كاتبا } يكتب بينكم ويحصل به التوثق { فرهان مقبوضة } أي: يقبضها صاحب الحق وتكون وثيقة عنده حتى يأتيه حقه، ودل هذا على أن الرهن غير المقبوضة لا يحصل منها التوثق، ودل أيضا على أن الراهن والمرتهن لو اختلفا في قدر ما رهنت به، كان القول قول المرتهن، ووجه ذلك أن الله جعل الرهن عوضا عن الكتابة في توثق صاحب الحق، فلولا أن قول المرتهن مقبول في قدر الذي رهنت به لم يحصل المعنى المقصود، ولما كان المقصود بالرهن التوثق جاز حضرا وسفرا، وإنما نص الله على السفر، لأنه في مظنة الحاجة إليه لعدم الكاتب فيه، هذا كله إذا كان صاحب الحق يحب أن يتوثق لحقه، فما كان صاحب الحق آمنا من غريمه وأحب أن يعامله من دون رهن فعلى من عليه الحق أن يؤدي إليه كاملا غير ظالم له ولا باخس حقه { وليتق الله ربه } في أداء الحق ويجازي من أحسن به الظن بالإحسان { ولا تكتموا الشهادة } لأن الحق مبني عليها لا يثبت بدونها، فكتمها من أعظم الذنوب، لأنه يترك ما وجب عليه من الخبر الصدق ويخبر بضده وهو الكذب، ويترتب على ذلك فوات حق من له الحق، ولهذا قال تعالى: { ومن يكتمها فإنه آثم قلبه والله بما تعملون عليم } وقد اشتملت هذه الأحكام الحسنة التي أرشد الله عباده إليها على حكم عظيمة ومصالح عميمة دلت على أن الخلق لو اهتدوا بإرشاد الله لصلحت دنياهم مع صلاح دينهم، لاشتمالها على العدل والمصلحة، وحفظ الحقوق وقطع المشاجرات والمنازعات، وانتظام أمر المعاش، فلله الحمد كما ينبغي لجلال وجهه وعظيم سلطانه لا نحصي ثناء عليه.\n                                    "
      },
      "originalText": "۞ وَإِن كُنتُمۡ عَلَىٰ سَفَرٖ وَلَمۡ تَجِدُواْ كَاتِبٗا فَرِهَٰنٞ مَّقۡبُوضَةٞۖ فَإِنۡ أَمِنَ بَعۡضُكُم بَعۡضٗا فَلۡيُؤَدِّ ٱلَّذِي ٱؤۡتُمِنَ أَمَٰنَتَهُۥ وَلۡيَتَّقِ ٱللَّهَ رَبَّهُۥۗ وَلَا تَكۡتُمُواْ ٱلشَّهَٰدَةَۚ وَمَن يَكۡتُمۡهَا فَإِنَّهُۥٓ ءَاثِمٞ قَلۡبُهُۥۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ عَلِيمٞ ٣٨٢"
    },
    {
      "number": 291,
      "text": "لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ ۖ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 284,
      "juz": 3,
      "manzil": 1,
      "page": 49,
      "ruku": 41,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لِّلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَإِن تُبۡدُواْ مَا فِيٓ أَنفُسِكُمۡ أَوۡ تُخۡفُوهُ يُحَاسِبۡكُم بِهِ ٱللَّهُۖ فَيَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٤٨٢\n                                        \n                                        \n                                        يخبر تعالى أن له ملك السماوات والأرض وما فيهن وما بينهن ، وأنه المطلع على ما فيهن ، لا تخفى عليه الظواهر ولا السرائر والضمائر ، وإن دقت وخفيت ، وأخبر أنه سيحاسب عباده على ما فعلوه وما أخفوه في صدورهم كما قال : ( قل إن تخفوا ما في صدوركم أو تبدوه يعلمه الله ويعلم ما في السماوات وما في الأرض والله على كل شيء قدير ) [ آل عمران : 29 ] ، وقال : ( يعلم السر وأخفى ) [ طه : 7 ] ، والآيات في ذلك كثيرة جدا ، وقد أخبر في هذه بمزيد على العلم ، وهو : المحاسبة على ذلك ، ولهذا لما نزلت هذه الآية اشتد ذلك على الصحابة ، رضي الله عنهم ، وخافوا منها ، ومن محاسبة الله لهم على جليل الأعمال وحقيرها ، وهذا من شدة إيمانهم وإيقانهم .\nقال الإمام أحمد : حدثنا عفان ، حدثنا عبد الرحمن بن إبراهيم ، حدثني أبو عبد الرحمن\nيعني العلاء عن أبيه ، عن أبي هريرة ، قال : لما نزلت على رسول الله صلى الله عليه وسلم : ( لله ما في السماوات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير ) اشتد ذلك على أصحاب رسول الله صلى الله عليه وسلم ، فأتوا رسول الله صلى الله عليه وسلم ، ثم جثوا على الركب ، وقالوا : يا رسول الله ، كلفنا من الأعمال ما نطيق : الصلاة والصيام والجهاد والصدقة ، وقد أنزل عليك هذه الآية ولا نطيقها . فقال رسول الله صلى الله عليه وسلم \" أتريدون أن تقولوا كما قال أهل الكتابين من قبلكم : سمعنا وعصينا ؟ بل قولوا : سمعنا وأطعنا ، غفرانك ربنا وإليك المصير \" . فلما أقر بها القوم وذلت بها ألسنتهم ، أنزل الله في أثرها : ( آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ) فلما فعلوا ذلك نسخها الله فأنزل : ( لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ) إلى آخره .\nورواه مسلم منفردا به ، من حديث يزيد بن زريع ، عن روح بن القاسم ، عن العلاء ، عن أبيه ، عن أبي هريرة ، فذكر مثله ، ولفظه : \" فلما فعلوا [ ذلك ] نسخها الله ، فأنزل : ( لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ) قال : نعم ، ( ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ) قال : نعم ، ( ربنا ولا تحملنا ما لا طاقة لنا به ) قال : نعم ، ( واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين ) قال : نعم .\nحديث ابن عباس في ذلك : قال الإمام أحمد : حدثنا وكيع ، حدثنا سفيان ، عن آدم بن سليمان ، سمعت سعيد بن جبير ، عن ابن عباس قال : لما نزلت هذه الآية : ( وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله ) قال : دخل قلوبهم منها شيء لم يدخل قلوبهم من شيء ، قال : فقال رسول الله ، صلى الله عليه وسلم : \" قولوا سمعنا وأطعنا وسلمنا \" . فألقى الله الإيمان في قلوبهم ، فأنزل الله . ( آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ) إلى قوله : ( فانصرنا على القوم الكافرين )\nوهكذا رواه مسلم ، عن أبي بكر بن أبي شيبة ، وأبي كريب ، وإسحاق بن إبراهيم ، ثلاثتهم عن وكيع ، به وزاد : ( ربنا لا تؤاخذنا إن نسينا أو أخطأنا ) قال : قد فعلت ( ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ) قال : قد فعلت ، ( ربنا ولا تحملنا ما لا طاقة لنا به ) قال : قد فعلت ( واعف عنا واغفر لنا وارحمنا أنت مولانا [ فانصرنا ] ) قال : قد فعلت .\nطريق أخرى عن ابن عباس : قال الإمام أحمد : حدثنا عبد الرزاق ، أخبرنا معمر ، عن حميد الأعرج ، عن مجاهد ، قال : دخلت على ابن عباس فقلت : يا أبا عباس ، كنت عند ابن عمر فقرأ\nهذه الآية فبكى . قال : أية آية ؟ قلت : ( وإن تبدوا ما في أنفسكم أو تخفوه ) قال ابن عباس ، إن هذه الآية حين أنزلت غمت أصحاب رسول الله صلى الله عليه وسلم غما شديدا ، وغاظتهم غيظا شديدا ، يعني ، وقالوا : يا رسول الله ، هلكنا ، إن كنا نؤاخذ بما تكلمنا وبما نعمل ، فأما قلوبنا فليست بأيدينا ، فقال لهم رسول الله ، صلى الله عليه وسلم : \" قولوا : سمعنا وأطعنا \" . قالوا : سمعنا وأطعنا . قال : فنسختها هذه الآية : ( آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله ) إلى ( لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ) فتجوز لهم عن حديث النفس وأخذوا بالأعمال .\nطريق أخرى عنه : قال ابن جرير : حدثني يونس ، أخبرنا ابن وهب ، أخبرني يونس بن يزيد ، عن ابن شهاب ، عن سعيد بن مرجانة ، سمعه يحدث أنه بينما هو جالس مع عبد الله بن عمر تلا هذه الآية : ( لله ما في السماوات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ) الآية . فقال : والله لئن واخذنا الله بهذا لنهلكن ، ثم بكى ابن عمر حتى سمع نشيجه . قال ابن مرجانة : فقمت حتى أتيت ابن عباس ، فذكرت له ما قال ابن عمر ، وما فعل حين تلاها ، فقال عبد الله بن عباس : يغفر الله لأبي عبد الرحمن . لعمري لقد وجد المسلمون منها حين أنزلت مثل ما وجد عبد الله بن عمر ، فأنزل الله بعدها : ( لا يكلف الله نفسا إلا وسعها ) إلى آخر السورة ، قال ابن عباس : فكانت هذه الوسوسة مما لا طاقة للمسلمين بها ، وصار الأمر إلى أن قضى الله ، عز وجل ، أن للنفس ما كسبت وعليها ما اكتسبت في القول والفعل .\nطريق أخرى : قال ابن جرير : حدثني المثنى ، حدثنا إسحاق ، حدثنا يزيد بن هارون ، عن سفيان بن حسين ، عن الزهري ، عن سالم : أن أباه قرأ : ( وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله ) فدمعت عيناه ، فبلغ صنيعه ابن عباس ، فقال : يرحم الله أبا عبد الرحمن ، لقد صنع كما صنع أصحاب رسول الله صلى الله عليه وسلم حين أنزلت ، فنسختها الآية التي بعدها : ( لا يكلف الله نفسا إلا وسعها ) .\nفهذه طرق صحيحة عن ابن عباس ، وقد ثبت عن ابن عمر كما ثبت عن ابن عباس .\nقال البخاري : حدثنا إسحاق ، حدثنا روح ، حدثنا شعبة ، عن خالد الحذاء ، عن مروان الأصفر ، عن رجل من أصحاب النبي صلى الله عليه وسلم أحسبه ابن عمر ( وإن تبدوا ما في أنفسكم أو تخفوه ) قال : نسختها الآية التي بعدها .\nوهكذا روي عن علي ، وابن مسعود ، وكعب الأحبار ، والشعبي ، والنخعي ، ومحمد بن كعب القرظي ، وعكرمة ، وسعيد بن جبير ، وقتادة : أنها منسوخة بالتي بعدها .\nوقد ثبت بما رواه الجماعة في كتبهم الستة من طريق قتادة ، عن زرارة بن أوفى ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" إن الله تجاوز لي عن أمتي ما حدثت به أنفسها ، ما لم تكلم أو تعمل \" .\nوفي الصحيحين ، من حديث سفيان بن عيينة ، عن أبي الزناد ، عن الأعرج ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" قال الله : إذا هم عبدي بسيئة فلا تكتبوها عليه ، فإن عملها فاكتبوها سيئة ، وإذا هم بحسنة فلم يعملها فاكتبوها حسنة ، فإن عملها فاكتبوها عشرا \" . لفظ مسلم وهو في أفراده من طريق إسماعيل بن جعفر ، عن العلاء ، عن أبيه ، عن أبي هريرة ، عن رسول الله صلى الله عليه وسلم قال : \" قال الله : إذا هم عبدي بحسنة ولم يعملها كتبتها له حسنة ، فإن عملها كتبتها عشر حسنات إلى سبعمائة ضعف ، وإذا هم بسيئة فلم يعملها لم أكتبها عليه ، فإن عملها كتبتها سيئة واحدة \" .\nوقال عبد الرزاق : أخبرنا معمر ، عن همام بن منبه قال : هذا ما حدثنا أبو هريرة ، عن محمد رسول الله صلى الله عليه وسلم قال : قال رسول الله صلى الله عليه وسلم : \" قال الله : إذا تحدث عبدي بأن يعمل حسنة ، فأنا أكتبها له حسنة ما لم يعمل ، فإذا عملها فأنا أكتبها بعشر أمثالها ، وإذا تحدث بأن يعمل سيئة فأنا أغفرها له ، ما لم يعملها ، فإن عملها فأنا أكتبها له بمثلها \" . وقال رسول الله صلى الله عليه وسلم : \" قالت الملائكة : رب ، وإن عبدك يريد أن يعمل سيئة وهو أبصر به فقال : ارقبوه ، فإن عملها فاكتبوها له بمثلها ، وإن تركها فاكتبوها له حسنة ، وإنما تركها من جراي \" . وقال رسول الله صلى الله عليه وسلم : \" إذا أحسن أحد إسلامه ، فكل حسنة يعملها تكتب بعشر أمثالها إلى سبعمائة ضعف ، وكل سيئة تكتب بمثلها حتى يلقى الله عز وجل \" .\nتفرد به مسلم عن محمد بن رافع ، عن عبد الرزاق بهذا السياق واللفظ وبعضه في صحيح البخاري .\nوقال مسلم أيضا : حدثنا أبو كريب ، حدثنا أبو خالد الأحمر ، عن هشام ، عن ابن سيرين ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" من هم بحسنة فلم يعملها كتبت له حسنة ، ومن هم بحسنة فعملها كتبت له [ عشرا ] إلى سبعمائة ضعف ، ومن هم بسيئة فلم يعملها لم تكتب ، وإن عملها كتبت \" . تفرد به مسلم دون غيره من أصحاب الكتب .\n[ وقال مسلم ] حدثنا شيبان بن فروخ ، حدثنا عبد الوارث ، عن الجعد أبي عثمان ، حدثنا أبو رجاء العطاردي ، عن ابن عباس ، عن رسول الله صلى الله عليه وسلم فيما يروي عن ربه تعالى قال : \" إن الله كتب الحسنات والسيئات ، ثم بين ذلك ، فمن هم بحسنة فلم يعملها كتبها الله عنده حسنة كاملة ، وإن هم بها فعملها كتبها الله عنده عشر حسنات إلى سبعمائة ضعف ، إلى أضعاف كثيرة . وإن هم بسيئة فلم\nيعملها كتبها الله عنده حسنة كاملة ، وإن هم بها فعملها كتبها الله سيئة واحدة \" .\nثم رواه مسلم ، عن يحيى بن يحيى ، عن جعفر بن سليمان ، عن الجعد أبي عثمان في هذا الإسناد بمعنى حديث عبد الوارث وزاد : \" ومحاها الله ، ولا يهلك على الله إلا هالك \" .\nوفي حديث سهيل ، عن أبيه ، عن أبي هريرة قال : جاء ناس من أصحاب رسول الله صلى الله عليه وسلم ، فسألوه : إنا نجد في أنفسنا ما يتعاظم أحدنا أن يتكلم به . قال : \" وقد وجدتموه ؟ \" قالوا : نعم . قال : \" ذاك صريح الإيمان \" .\nلفظ مسلم وهو عند مسلم أيضا من طريق الأعمش ، عن أبي صالح ، عن أبي هريرة ، عن رسول الله صلى الله عليه وسلم ، به . وروى مسلم [ أيضا ] من حديث مغيرة ، عن إبراهيم ، عن علقمة ، عن عبد الله ، قال : سئل رسول الله صلى الله عليه وسلم عن الوسوسة ، قال : \" تلك صريح الإيمان \" . وقال علي بن أبي طلحة ، عن ابن عباس : ( وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله ) فإنها لم تنسخ ، ولكن الله إذا جمع الخلائق يوم القيامة يقول : إني أخبركم بما أخفيتم في أنفسكم ، مما لم يطلع عليه ملائكتي ، فأما المؤمنون فيخبرهم ويغفر لهم ما حدثوا به أنفسهم ، وهو قوله : ( يحاسبكم به الله ) يقول : يخبركم ، وأما أهل الشك والريب فيخبرهم بما أخفوا من التكذيب وهو قوله : ( فيغفر لمن يشاء ويعذب من يشاء ) وهو قوله : ( ولكن يؤاخذكم بما كسبت قلوبكم ) [ البقرة : 225 ] أي : من الشك والنفاق . وقد روى العوفي والضحاك عنه قريبا من هذا .\nوروى ابن جرير ، عن مجاهد والضحاك ، نحوه . وعن الحسن البصري أنه قال : هي محكمة لم تنسخ . واختار ابن جرير ذلك ، واحتج على أنه لا يلزم من المحاسبة المعاقبة ، وأنه تعالى قد يحاسب ويغفر ، وقد يحاسب ويعاقب بالحديث الذي رواه عند هذه الآية ، قائلا : حدثنا ابن بشار ، حدثنا ابن أبي عدي ، عن سعيد وهشام ، ( ح ) وحدثني يعقوب بن إبراهيم ، حدثنا ابن علية ، حدثنا هشام ، قالا جميعا في حديثهما : عن قتادة ، عن صفوان بن محرز ، قال : بينما نحن نطوف بالبيت مع عبد الله بن عمر ، وهو يطوف ، إذ عرض له رجل فقال : يا ابن عمر ، ما سمعت رسول الله صلى الله عليه وسلم يقول في النجوى ؟ فقال : سمعت نبي الله صلى الله عليه وسلم يقول : \" يدنو المؤمن من ربه ، عز وجل ، حتى يضع عليه كنفه ، فيقرره بذنوبه فيقول : هل تعرف كذا ؟ فيقول : رب أعرف مرتين حتى إذا بلغ به ما شاء الله أن يبلغ قال : فإني قد سترتها عليك في الدنيا وأنا أغفرها لك اليوم \" . قال : \" فيعطى صحيفة حسناته أو كتابه بيمينه ، وأما الكفار والمنافقون فينادى بهم على رؤوس الأشهاد : ( هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين ) [ هود : 18 ] .\nوهذا الحديث مخرج في الصحيحين وغيرهما من طرق متعددة ، عن قتادة ، به .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا سليمان بن حرب ، حدثنا حماد بن سلمة ، عن علي بن زيد ، عن أمية قالت : سألت عائشة عن هذه الآية : ( وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله ) فقالت : ما سألني عنها أحد منذ سألت رسول الله صلى الله عليه وسلم عنها فقال : \" هذه مبايعة الله العبد ، وما يصيبه من الحمى ، والنكبة ، والبضاعة يضعها في يد كمه ، فيفتقدها فيفزع لها ، ثم يجدها في ضبنه ، حتى إن المؤمن ليخرج من ذنوبه كما يخرج التبر الأحمر [ من الكير ] \" .\nوكذا رواه الترمذي ، وابن جرير من طريق حماد بن سلمة ، به . وقال الترمذي : غريب لا نعرفه إلا من حديثه .\nقلت : وشيخه علي بن زيد بن جدعان ضعيف ، يغرب في رواياته وهو يروي هذا الحديث عن امرأة أبيه : أم محمد أمية بنت عبد الله ، عن عائشة ، وليس لها عنها في الكتب سواه .\n                                    ",
        "qortoby": "لِّلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَإِن تُبۡدُواْ مَا فِيٓ أَنفُسِكُمۡ أَوۡ تُخۡفُوهُ يُحَاسِبۡكُم بِهِ ٱللَّهُۖ فَيَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٤٨٢\n                                        \n                                        \n                                        قوله تعالى : لله ما في السماوات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير\nقوله تعالى : لله ما في السماوات وما في الأرض تقدم معناه .\nقوله تعالى : وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيه مسألتان :\nالأولى : اختلف الناس في معنى قوله تعالى : وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله على أقوال خمسة :\n( الأول ) أنها منسوخة ، قاله ابن عباس وابن مسعود وعائشة وأبو هريرة والشعبي وعطاء ومحمد بن سيرين ومحمد بن كعب وموسى بن عبيدة وجماعة من الصحابة والتابعين ، وأنه بقي هذا التكليف حولا حتى أنزل الله الفرج بقوله : لا يكلف الله نفسا إلا وسعها . وهو قول ابن مسعود وعائشة وعطاء ومحمد بن سيرين ومحمد بن كعب وغيرهم . وفي صحيح مسلم عن ابن عباس قال : لما نزلت وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله قال : دخل قلوبهم منها شيء لم يدخل قلوبهم من شيء ، فقال النبي صلى الله عليه وسلم : قولوا سمعنا وأطعنا وسلمنا قال : فألقى الله الإيمان في قلوبهم فأنزل الله تعالى : لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا قال : ( قد فعلت ) ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا قال : ( قد فعلت ) ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرينقال : ( قد فعلت ) : في رواية فلما فعلوا ذلك نسخها الله ثم أنزل تعالى : لا يكلف الله نفسا إلا وسعها وسيأتي .\n( الثاني ) قال ابن عباس وعكرمة والشعبي ومجاهد : إنها محكمة مخصوصة ، وهي في معنى الشهادة التي نهى عن كتمها ، ثم أعلم في هذه الآية أن الكاتم لها المخفي ما في نفسه محاسب .\n( الثالث ) أن الآية فيما يطرأ على النفوس من الشك واليقين ، وقاله مجاهد أيضا .\n( الرابع ) أنها محكمة عامة غير منسوخة ، والله محاسب خلقه على ما عملوا من عمل وعلى ما لم يعملوه مما ثبت في نفوسهم وأضمروه ونووه وأرادوه ، فيغفر للمؤمنين ويأخذ به أهل الكفر والنفاق ، ذكره الطبري عن قوم ، وأدخل عن ابن عباس ما يشبه هذا . روي عن علي بن أبي طلحة عن ابن عباس أنه قال : لم تنسخ ، ولكن إذا جمع الله الخلائق يقول : ( إني أخبركم بما أكننتم في أنفسكم ) فأما المؤمنون فيخبرهم ثم يغفر لهم ، وأما أهل الشك والريب فيخبرهم بما أخفوه من التكذيب ، فذلك قوله : يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء وهو قوله عز وجل : ولكن يؤاخذكم بما كسبت قلوبكم من الشك والنفاق . وقال الضحاك : يعلمه الله يوم القيامة بما كان يسره ليعلم أنه لم يخف عليه . وفي الخبر : ( إن الله تعالى يقول يوم القيامة هذا يوم تبلى فيه السرائر وتخرج الضمائر وأن كتابي لم يكتبوا إلا ما ظهر من أعمالكم وأنا المطلع على ما لم يطلعوا عليه ولم يخبروه ولا كتبوه فأنا أخبركم بذلك وأحاسبكم عليه فأغفر لمن أشاء وأعذب من أشاء ) فيغفر للمؤمنين ويعذب الكافرين ، وهذا أصح ما في الباب ، يدل عليه حديث النجوى على ما يأتي بيانه ، لا يقال : فقد ثبت عن النبي صلى الله عليه وسلم إن الله تجاوز لأمتي عما حدثت به أنفسها ما لم يتكلموا أو يعملوا به . فإنا نقول : ذلك محمول على أحكام الدنيا ، مثل الطلاق والعتاق والبيع التي لا يلزمه حكمها ما لم يتكلم به ، والذي ذكر في الآية فيما يؤاخذ العبد به بينه وبين الله تعالى في الآخرة . وقال الحسن : الآية محكمة ليست بمنسوخة . قال الطبري : وقال آخرون نحو هذا المعنى الذي ذكر عن ابن عباس ، إلا أنهم قالوا : إن العذاب الذي يكون جزاء لما خطر في النفوس وصحبه الفكر إنما هو بمصائب الدنيا وآلامها وسائر مكارهها . ثم أسند عن عائشة نحو هذا المعنى ، وهو ( القول الخامس ) : ورجح الطبري أن الآية محكمة غير منسوخة : قال ابن عطية : وهذا هو الصواب ، وذلك أن قوله تعالى : وإن تبدوا ما في أنفسكم أو تخفوه معناه مما هو في وسعكم وتحت كسبكم ، وذلك استصحاب المعتقد والفكر ، فلما كان اللفظ مما يمكن أن تدخل فيه الخواطر أشفق الصحابة والنبي صلى الله عليه وسلم ، فبين الله لهم ما أراد بالآية الأخرى ، وخصصها ونص على حكمه أنه لا يكلف نفسا إلا وسعها ، والخواطر ليست هي ولا دفعها في الوسع ، بل هي أمر غالب وليست مما يكتسب ، فكان في هذا البيان فرجهم وكشف كربهم ، وباقي الآية محكمة لا نسخ فيها : ومما يدفع أمر النسخ أن الآية خبر والأخبار لا يدخلها النسخ ، فإن ذهب ذاهب إلى تقدير النسخ فإنما يترتب له في الحكم الذي لحق الصحابة حين فزعوا من الآية ، وذلك أن قول النبي صلى الله عليه وسلم لهم : ( قولوا سمعنا وأطعنا ) يجيء منه الأمر بأن يثبتوا على هذا ويلتزموه وينتظروا لطف الله في الغفران . فإذا قرر هذا الحكم فصحيح وقوع النسخ فيه ، وتشبه الآية حينئذ قوله تعالى : إن يكن منكم عشرون صابرون يغلبوا مائتين فهذا لفظه الخبر ولكن معناه التزموا هذا واثبتوا عليه واصبروا بحسبه ، ثم نسخ بعد ذلك . وأجمع الناس فيما علمت على أن هذه الآية في الجهاد منسوخة بصبر المائة للمائتين . قال ابن عطية : وهذه الآية في \" البقرة \" أشبه شيء بها . وقيل : في الكلام إضمار وتقييد ، تقديره يحاسبكم به الله إن شاء ، وعلى هذا فلا نسخ . وقال النحاس : ومن أحسن ما قيل في الآية - وأشبه بالظاهر - قول ابن عباس : إنها عامة ، ثم أدخل حديث ابن عمر في النجوى ، أخرجه البخاري ومسلم وغيرهما ، واللفظ لمسلم قال : سمعت رسول الله صلى الله عليه وسلم يقول يدنى المؤمن يوم القيامة من ربه جل وعز حتى يضع عليه كنفه فيقرره بذنوبه ؛ فيقول : هل تعرف ؟ فيقول : أي رب أعرف ، قال : فإني قد سترتها عليك في الدنيا وإني أغفرها لك اليوم فيعطى صحيفة حسناته ، وأما الكفار والمنافقون فينادى بهم على رءوس الخلائق هؤلاء الذين كذبوا على الله . وقد قيل : إنها نزلت في الذين يتولون الكافرين من المؤمنين ، أي وإن تعلنوا ما في أنفسكم أيها المؤمنون من ولاية الكفار أو تسروها يحاسبكم به الله ، قاله الواقدي ومقاتل ، واستدلوا بقوله تعالى في ( آل عمران ) قل إن تخفوا ما في صدوركم أو تبدوه من ولاية الكفار يعلمه الله يدل عليه ما قبله من قوله : لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين .\nقلت : وهذا فيه بعد ؛ لأن سياق الآية لا يقتضيه ، وإنما ذلك بين في \" آل عمران \" والله أعلم . وقد قال سفيان بن عيينة : بلغني أن الأنبياء عليهم السلام كانوا يأتون قومهم بهذه الآية لله ما في السماوات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله .\nقوله تعالى : فيغفر لمن يشاء ويعذب من يشاء قرأ ابن كثير ونافع وأبو عمرو وحمزة والكسائي \" فيغفر ويعذب \" بالجزم - عطف - على الجواب . وقرأ ابن عامر وعاصم بالرفع فيهما على القطع ، أي فهو يغفر ويعذب . وروي عن ابن عباس والأعرج وأبي العالية وعاصم الجحدري بالنصب فيهما على إضمار \" أن \" . وحقيقته أنه عطف على المعنى ، كما في قوله تعالى : فيضاعفه له وقد تقدم . والعطف على اللفظ أجود للمشاكلة ، كما قال الشاعر :\nومتى ما يع منك كلاما يتكلم فيجبك بعقل\nقال النحاس : وروي عن طلحة بن مصرف \" يحاسبكم به الله يغفر \" بغير فاء على البدل . ابن عطية : وبها قرأ الجعفي وخلاد . وروي أنها كذلك في مصحف ابن مسعود . قال ابن جني : هي على البدل من \" يحاسبكم \" وهي تفسير المحاسبة ، وهذا كقول الشاعر :\nرويدا بني شيبان بعض وعيدكم تلاقوا غدا خيلي على سفوان\nتلاقوا جيادا لا تحيد عن الوغى إذا ما غدت في المأزق المتداني\nفهذا على البدل . وكرر الشاعر الفعل ؛ لأن الفائدة فيما يليه من القول . قال النحاس : وأجود من الجزم - لو كان بلا فاء - الرفع ، يكون في موضع الحال ، كما قال الشاعر :\nمتى تأته تعشو إلى ضوء ناره تجد خير نار عندها خير موقد\n                                    ",
        "saadi": "لِّلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَإِن تُبۡدُواْ مَا فِيٓ أَنفُسِكُمۡ أَوۡ تُخۡفُوهُ يُحَاسِبۡكُم بِهِ ٱللَّهُۖ فَيَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٤٨٢\n                                        \n                                        \n                                        \n                                        هذا إخبار من الله أنه له ما في السماوات وما في الأرض، الجميع خلقهم ورزقهم ودبرهم لمصالحهم الدينية والدنيوية، فكانوا ملكا له وعبيدا، لا يملكون لأنفسهم ضرا ولا نفعا ولا موتا ولا حياة ولا نشورا، وهو ربهم ومالكهم الذي يتصرف فيهم بحكمته وعدله وإحسانه، وقد أمرهم ونهاهم وسيحاسبهم على ما أسروه وأعلنوه، { فيغفر لمن يشاء } وهو لمن أتى بأسباب المغفرة، ويعذب من يشاء بذنبه الذي لم يحصل له ما يكفره { والله على كل شيء قدير } لا يعجزه شيء، بل كل الخلق طوع قهره ومشيئته وتقديره وجزائه\n                                    "
      },
      "originalText": "لِّلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَإِن تُبۡدُواْ مَا فِيٓ أَنفُسِكُمۡ أَوۡ تُخۡفُوهُ يُحَاسِبۡكُم بِهِ ٱللَّهُۖ فَيَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٤٨٢"
    },
    {
      "number": 292,
      "text": "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 285,
      "juz": 3,
      "manzil": 1,
      "page": 49,
      "ruku": 41,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّن رُّسُلِهِۦۚ وَقَالُواْ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٥٨٢\n                                        \n                                        \n                                        كر الأحاديث الواردة في فضل هاتين الآيتين الكريمتين نفعنا الله بهما .\nالحديث الأول : قال البخاري : حدثنا محمد بن كثير ، أخبرنا شعبة ، عن سليمان ، عن إبراهيم ، عن عبد الرحمن ، عن أبي مسعود ، عن النبي صلى الله عليه وسلم قال : \" من قرأ بالآيتين \" ، وحدثنا أبو نعيم ، حدثنا سفيان ، عن منصور ، عن إبراهيم ، عن عبد الرحمن بن يزيد ، عن أبي مسعود ، قال : قال رسول الله صلى الله عليه وسلم : \" من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه \" .\nوقد أخرجه بقية الجماعة من طريق سليمان بن مهران الأعمش ، بإسناده ، مثله . وهو في الصحيحين من طريق الثوري ، عن منصور ، عن إبراهيم ، عن عبد الرحمن ، عنه ، به . وهو في الصحيحين أيضا عن عبد الرحمن ، عن علقمة عن أبي مسعود قال عبد الرحمن : ثم لقيت أبا مسعود ، فحدثني به .\nوهكذا رواه أحمد بن حنبل : حدثنا يحيى بن آدم ، حدثنا شريك ، عن عاصم ، عن المسيب بن رافع ، عن علقمة ، عن أبي مسعود ، عن النبي صلى الله عليه وسلم ، قال : \" من قرأ الآيتين من آخر سورة البقرة في ليلته كفتاه \" .\nالحديث الثاني : قال الإمام أحمد : حدثنا حسين ، حدثنا شيبان ، عن منصور ، عن ربعي ، عن خرشة بن الحر ، عن المعرور بن سويد ، عن أبي ذر ، قال : قال رسول الله صلى الله عليه وسلم : \" أعطيت خواتيم سورة البقرة من كنز تحت العرش ، لم يعطهن نبي قبلي \" .\nوقد رواه ابن مردويه ، من حديث الأشجعي ، عن الثوري ، عن منصور ، عن ربعي ، عن زيد بن ظبيان ، عن أبي ذر قال : قال رسول الله صلى الله عليه وسلم : \" أعطيت خواتيم سورة البقرة من كنز تحت العرش \" .\nالحديث الثالث : قال مسلم : حدثنا أبو بكر بن أبي شيبة ، حدثنا أبو أسامة ، حدثنا مالك بن مغول ( ح ) وحدثنا ابن نمير ، وزهير بن حرب جميعا ، عن عبد الله بن نمير وألفاظهم متقاربة قال ابن نمير : حدثنا أبي ، حدثنا مالك بن مغول ، عن الزبير بن عدي عن طلحة ، عن مرة ، عن عبد الله ، قال : لما أسري برسول الله صلى الله عليه وسلم انتهي به إلى سدرة المنتهى ، وهي في السماء السادسة إليها ينتهي ما يعرج به من الأرض فيقبض منها ، وإليها ينتهي ما يهبط به من فوقها فيقبض منها ، قال : ( إذ يغشى السدرة ما يغشى ) [ النجم : 16 ] ، قال : فراش من ذهب . قال : وأعطي رسول الله صلى الله عليه وسلم ثلاثا : أعطي الصلوات الخمس ، وأعطي خواتيم سورة البقرة ، وغفر لمن لم يشرك بالله من أمته شيئا المقحمات .\nالحديث الرابع : قال أحمد : حدثنا إسحاق بن إبراهيم الرازي ، حدثنا سلمة بن الفضل ، حدثني محمد بن إسحاق ، عن يزيد بن أبي حبيب ، عن مرثد بن عبد الله اليزني ، عن عقبة بن عامر الجهني قال : قال لي رسول الله صلى الله عليه وسلم : \" اقرأ الآيتين من آخر سورة البقرة فإني أعطيتهما من تحت العرش \" . هذا إسناد حسن ، ولم يخرجوه في كتبهم .\nالحديث الخامس : قال ابن مردويه : حدثنا أحمد بن كامل ، حدثنا إبراهيم بن إسحاق الحربي ، أخبرنا مسدد أخبرنا أبو عوانة ، عن أبي مالك ، عن ربعي ، عن حذيفة ، قال : قال رسول الله صلى الله عليه وسلم : \" فضلنا على الناس بثلاث ، أوتيت هؤلاء الآيات من آخر سورة البقرة من بيت كنز تحت العرش ، لم يعطها أحد قبلي ، ولا يعطاها أحد بعدي \" .\nثم رواه من حديث نعيم بن أبي هندي ، عن ربعي ، عن حذيفة ، بنحوه .\nالحديث السادس : قال ابن مردويه : حدثنا عبد الباقي بن نافع ، أنبأنا إسماعيل بن الفضل ، أخبرنا محمد بن حاتم بن بزيع ، أخبرنا جعفر بن عون ، عن مالك بن مغول ، عن أبي إسحاق ، عن الحارث ، عن علي قال : لا أرى أحدا عقل الإسلام ينام حتى يقرأ خواتيم سورة البقرة ، فإنها كنز أعطيه نبيكم صلى الله عليه وسلم من تحت العرش .\nورواه وكيع عن إسرائيل ، عن أبي إسحاق ، عن عمير بن عمرو الخارفي ، عن علي قال : ما أرى أحدا يعقل ، بلغه الإسلام ، ينام حتى يقرأ آية الكرسي وخواتيم سورة البقرة ، فإنها من كنز تحت العرش .\nالحديث السابع : قال أبو عيسى الترمذي : حدثنا بندار ، حدثنا عبد الرحمن بن مهدي ، حدثنا حماد بن سلمة ، عن أشعث بن عبد الرحمن الجرمي عن أبي قلابة ، عن أبي الأشعث الصنعاني ، عن النعمان بن بشير ، عن النبي صلى الله عليه وسلم قال : \" إن الله كتب كتابا قبل أن يخلق السماوات والأرض بألفي عام ، أنزل منه آيتين ختم بهما سورة البقرة ، ولا يقرأن في دار ثلاث ليال فيقربها شيطان \" . ثم قال : هذا حديث غريب . وهكذا رواه الحاكم في مستدركه من حديث حماد بن سلمة به ، وقال : صحيح على شرط مسلم ، ولم يخرجاه .\nالحديث الثامن : قال ابن مردويه : حدثنا عبد الرحمن بن محمد بن مدين ، أخبرنا الحسن بن الجهم ، أخبرنا إسماعيل بن عمرو ، أخبرنا ابن أبي مريم ، حدثني يوسف بن أبي الحجاج ، عن سعيد ، عن ابن عباس قال : كان رسول الله صلى الله عليه وسلم إذا قرأ آخر سورة البقرة وآية الكرسي ضحك ، وقال : \" إنهما من كنز الرحمن تحت العرش \" . وإذا قرأ : ( من يعمل سوءا يجز به ) [ النساء : 123 ] ، ( وأن ليس للإنسان إلا ما سعى وأن سعيه سوف يرى ثم يجزاه الجزاء الأوفى ) [ النجم : 3941 ] ، استرجع واستكان .\nالحديث التاسع : قال ابن مردويه : حدثنا عبد الله بن محمد بن كوفي ، حدثنا أحمد بن يحيى بن حمزة ، حدثنا محمد بن بكر حدثنا مكي بن إبراهيم ، حدثنا عبد الله بن أبي حميد ، عن أبي مليح ، عن معقل بن يسار ، قال : قال رسول الله صلى الله عليه وسلم : \" أعطيت فاتحة الكتاب ، وخواتيم سورة البقرة من تحت العرش ، والمفصل نافلة \" .\nالحديث العاشر : قد تقدم في فضائل الفاتحة ، من رواية عبد الله بن عيسى بن عبد الرحمن بن أبي ليلى ، عن سعيد بن جبير ، عن ابن عباس قال : بينا رسول الله صلى الله عليه وسلم وعنده جبريل ; إذ سمع نقيضا فوقه ، فرفع جبريل بصره إلى السماء ، فقال : هذا باب قد فتح من السماء ما فتح قط . قال : فنزل منه ملك ، فأتى النبي صلى الله عليه وسلم فقال : أبشر بنورين قد أوتيتهما ، لم يؤتهما نبي قبلك : فاتحة الكتاب ، وخواتيم سورة البقرة ، لن تقرأ حرفا منهما إلا أوتيته ، رواه مسلم والنسائي ، وهذا لفظه .\n[ الحديث الحادي عشر : قال أبو محمد عبد الله بن عبد الرحمن الدارمي في مسنده : حدثنا أبو المغيرة ، حدثنا صفوان ، حدثنا أيفع بن عبد الله الكلاعي قال : قال رجل : يا رسول الله ، أي آية في كتاب الله أعظم ؟ قال : \" آية الكرسي : ( الله لا إله إلا هو الحي القيوم ) قال : فأي آية في كتاب الله تحب أن تصيبك وأمتك ؟ قال : \" آخر سورة البقرة ، ولم يترك خيرا في الدنيا والآخرة إلا اشتملت عليه \" ] .\nفقوله تعالى : ( آمن الرسول بما أنزل إليه من ربه ) إخبار عن النبي صلى الله عليه وسلم بذلك .\nقال ابن جرير : حدثنا بشر ، حدثنا يزيد ، حدثنا سعيد ، عن قتادة ، قال : ذكر لنا أن رسول الله صلى الله عليه وسلم قال لما نزلت هذه الآية : \" ويحق له أن يؤمن \" .\nوقد روى الحاكم في مستدركه : حدثنا أبو النضر الفقيه : حدثنا معاذ بن نجدة القرشي ، حدثنا خلاد بن يحيى ، حدثنا أبو عقيل ، عن يحيى بن أبي كثير ، عن أنس بن مالك ، قال : لما نزلت هذه الآية على النبي صلى الله عليه وسلم ( آمن الرسول بما أنزل إليه من ربه ) قال النبي صلى الله عليه وسلم : \" حق له أن يؤمن \" . ثم قال الحاكم : صحيح الإسناد ، ولم يخرجاه . .\nوقوله : ( والمؤمنون ) عطف على ) الرسول ) ثم أخبر عن الجميع فقال : ( كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله ) فالمؤمنون يؤمنون بأن الله واحد أحد ، فرد صمد ، لا إله غيره ، ولا رب سواه . ويصدقون بجميع الأنبياء والرسل والكتب المنزلة من السماء على عباد الله المرسلين والأنبياء ، لا يفرقون بين أحد منهم ، فيؤمنون ببعض ويكفرون ببعض ، بل الجميع عندهم صادقون بارون راشدون مهديون هادون إلى سبل الخير ، وإن كان بعضهم ينسخ شريعة بعض بإذن الله ، حتى نسخ الجميع بشرع محمد صلى الله عليه وسلم خاتم الأنبياء والمرسلين ، الذي تقوم الساعة على شريعته ، ولا تزال طائفة من أمته على الحق ظاهرين .\nوقوله : ( وقالوا سمعنا وأطعنا ) أي : سمعنا قولك يا ربنا ، وفهمناه ، وقمنا به ، وامتثلنا العمل بمقتضاه ، ( غفرانك ربنا ) سؤال للغفر والرحمة واللطف .\nقال ابن أبي حاتم : حدثنا علي بن حرب الموصلي ، حدثنا ابن فضيل ، عن عطاء بن السائب ،\nعن سعيد بن جبير ، عن ابن عباس في قول الله : ( آمن الرسول بما أنزل إليه من ربه والمؤمنون ) إلى قوله : ( غفرانك ربنا ) قال : قد غفرت لكم ، ( وإليك المصير ) أي : إليك المرجع والمآب يوم يقوم الحساب .\nقال ابن جرير : حدثنا ابن حميد ، حدثنا جرير ، عن بيان ، عن حكيم عن جابر قال : لما نزلت على رسول الله صلى الله عليه وسلم ( آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير ) قال جبريل : إن الله قد أحسن الثناء عليك وعلى أمتك ، فسل تعطه . فسأل : ( لا يكلف الله نفسا إلا وسعها ) إلى آخر الآية .\n                                    ",
        "qortoby": "ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّن رُّسُلِهِۦۚ وَقَالُواْ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٥٨٢\n                                        \n                                        \n                                        قوله : آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير\nفيه مسائل : الأولى : قوله تعالى : آمن الرسول بما أنزل إليه من ربه روي عن الحسن ومجاهد والضحاك : أن هذه الآية كانت في قصة المعراج ، وهكذا روي في بعض الروايات عن ابن عباس ، وقال بعضهم : جميع القرآن نزل به جبريل عليه السلام على محمد صلى الله عليه وسلم إلا هذه الآية فإن النبي صلى الله عليه وسلم هو الذي سمع ليلة المعراج . وقال بعضهم : لم يكن ذلك في قصة المعراج ؛ لأن ليلة المعراج كانت بمكة وهذه السورة كلها مدنية ، فأما من قال إنها كانت ليلة المعراج قال : لما صعد النبي صلى الله عليه وسلم وبلغ في السماوات في مكان مرتفع ومعه جبريل حتى جاوز سدرة المنتهى فقال له جبريل : إني لم أجاوز هذا الموضع ولم يؤمر بالمجاوزة أحد هذا الموضع غيرك فجاوز النبي صلى الله عليه وسلم حتى بلغ الموضع الذي شاء الله ، فأشار إليه جبريل بأن سلم على ربك ، فقال النبي صلى الله عليه وسلم : التحيات لله والصلوات والطيبات . قال الله تعالى : السلام عليك أيها النبي ورحمة الله وبركاته ، فأراد النبي صلى الله عليه وسلم أن يكون لأمته حظ في السلام فقال : السلام علينا وعلى عباد الله الصالحين ، فقال جبريل وأهل السماوات كلهم : أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله . قال الله تعالى : آمن الرسول على معنى الشكر أي صدق الرسول بما أنزل إليه من ربه فأراد النبي صلى الله عليه وسلم أن يشارك أمته في الكرامة والفضيلة فقال : والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله يعني يقولون آمنا بجميع الرسل ولا نكفر بأحد منهم ولا نفرق بينهم كما فرقت اليهود والنصارى ، فقال له ربه كيف قبولهم بآي الذي أنزلتها ؟ وهو قوله : إن تبدوا ما في أنفسكم فقال رسول الله صلى الله عليه وسلم ( قالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير يعني المرجع . فقال الله تعالى عند ذلك : لا يكلف الله نفسا إلا وسعها يعني طاقتها ويقال : إلا دون طاقتها . لها ما كسبت من الخير وعليها ما اكتسبت من الشر ، فقال جبريل عند ذلك : سل تعطه ، فقال النبي صلى الله عليه وسلم : ربنا لا تؤاخذنا إن نسينا يعني إن جهلنا أو أخطأنا يعني إن تعمدنا ، ويقال : إن عملنا بالنسيان ، والخطأ . فقال له جبريل : قد أعطيت ذلك قد رفع عن أمتك الخطأ والنسيان . فسل شيئا آخر فقال : ربنا ولا تحمل علينا إصرا يعني ثقلا كما حملته على الذين من قبلنا وهو أنه حرم عليهم الطيبات بظلمهم ، وكانوا إذا أذنبوا بالليل وجدوا ذلك مكتوبا على بابهم ، وكانت الصلوات عليهم خمسين ، فخفف الله عن هذه الأمة وحط عنهم بعدما فرض خمسين صلاة . ثم قال : ربنا ولا تحملنا ما لا طاقة لنا به يقول : لا تثقلنا من العمل ما لا نطيق فتعذبنا . ويقال : ما تشق علينا ؛ لأنهم لو أمروا بخمسين صلاة لكانوا يطيقون ذلك ولكنه يشق عليهم ولا يطيقون الإدامة عليه واعف عنا من ذلك كله واغفر لنا وتجاوز عنا ، ويقال : واعف عنا من المسخ واغفر لنا من الخسف وارحمنا من القذف ؛ لأن الأمم الماضية بعضهم أصابهم المسخ وبعضهم أصابهم الخسف وبعضهم القذف ثم قال : أنت مولانا يعني : ولينا وحافظنا فانصرنا على القوم الكافرين فاستجيبت دعوته . وروي عن النبي صلى الله عليه وسلم أنه قال : نصرت بالرعب مسيرة شهر ويقال إن الغزاة : إذا خرجوا من ديارهم بالنية الخالصة وضربوا بالطبل وقع الرعب والهيبة في قلوب الكفار مسيرة شهر في شهر ، علموا بخروجهم أو لم يعلموا ، ثم إن النبي صلى الله عليه وسلم لما رجع أوحى الله هذه الآيات ، ليعلم أمته بذلك . ولهذه الآية تفسير آخر ، قال الزجاج : لما ذكر الله تعالى في هذه السورة فرض الصلاة والزكاة وبين أحكام الحج وحكم الحيض والطلاق والإيلاء وأقاصيص الأنبياء وبين حكم الربا ، ذكر تعظيمه سبحانه بقوله سبحانه وتعالى : لله ما في السماوات وما في الأرض ثم ذكر تصديق نبيه صلى الله عليه وسلم ثم ذكر تصديق المؤمنين بجميع ذلك فقال : آمن الرسول بما أنزل إليه من ربه أي صدق الرسول بجميع هذه الأشياء التي جرى ذكرها وكذلك المؤمنون كلهم صدقوا بالله وملائكته وكتبه ورسله .\nوقيل سبب نزولها الآية التي قبلها وهي : لله ما في السماوات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير فإنه لما أنزل هذا على النبي صلى الله عليه وسلم اشتد ذلك على أصحاب رسول الله صلى الله عليه وسلم فأتوا رسول الله صلى الله عليه وسلم ثم بركوا على الركب فقالوا : أي رسول الله ، كلفنا من الأعمال ما نطيق : الصلاة والصيام والجهاد والصدقة ، وقد أنزل الله عليكم هذه الآية ولا نطيقها . قال رسول الله صلى الله عليه وسلم : أتريدون أن تقولوا كما قال أهل الكتابين من قبلكم سمعنا وعصينا بل قولوا سمعنا وأطعنا غفرانك ربنا وإليك المصير فقالوا : سمعنا وأطعنا غفرانك ربنا وإليك المصير . فلما اقترأها القوم ذلت بها ألسنتهم فأنزل الله في إثرها : آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير . فلما فعلوا ذلك نسخها الله ، فأنزل الله عز وجل : لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا قال : \" نعم \" ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا قال : ( نعم ) ربنا ولا تحملنا ما لا طاقة لنا به قال : ( نعم ) واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين قال : ( نعم ) . أخرجه مسلم عن أبي هريرة .\nقال علماؤنا : قوله في الرواية الأولى ( قد فعلت ) وهنا قال : ( نعم ) دليل على نقل الحديث بالمعنى ، وقد تقدم . ولما تقرر الأمر على أن قالوا : سمعنا وأطعنا ، مدحهم الله وأثنى عليهم في هذه الآية ، ورفع المشقة في أمر الخواطر عنهم ، وهذه ثمرة الطاعة والانقطاع إلى الله تعالى ، كما جرى لبني إسرائيل ضد ذلك من ذمهم وتحميلهم المشقات من الذلة والمسكنة والانجلاء إذ قالوا : سمعنا وعصينا ، وهذه ثمرة العصيان والتمرد على الله تعالى ، أعاذنا الله من نقمه بمنه وكرمه . وفي الحديث أن النبي صلى الله عليه وسلم قيل له : إن بيت ثابت بن قيس بن شماس يزهر كل ليلة بمصابيح ؟ قال : ( فلعله يقرأ سورة البقرة ) فسئل ثابت قال : قرأت من سورة البقرة \" آمن الرسول \" نزلت حين شق على أصحاب النبي صلى الله عليه وسلم ما توعدهم الله تعالى به من محاسبتهم على ما أخفته نفوسهم ، فشكوا ذلك إلى النبي صلى الله عليه وسلم فقال : ( فلعلكم تقولون سمعنا وعصينا كما قالت بنو إسرائيل ) قالوا : بل سمعنا وأطعنا ، فأنزل الله تعالى ثناء عليهم : آمن الرسول بما أنزل إليه من ربه فقال صلى الله عليه وسلم : ( وحق لهم أن يؤمنوا ) .\nالثانية : قوله تعالى : \" آمن \" : أي صدق ، وقد تقدم . والذي أنزل هو القرآن . وقرأ ابن مسعود \" وآمن المؤمنون كل آمن بالله \" على اللفظ ، ويجوز في غير القرآن \" آمنوا \" على المعنى . وقرأ نافع وابن كثير وعاصم في رواية أبي بكر وابن عامر ( وكتبه ) على الجمع . وقرءوا في \" التحريم \" \" كتابه \" على التوحيد . وقرأ أبو عمرو هنا وفي \" التحريم \" و \" كتبه \" على الجمع . وقرأ حمزة والكسائي \" وكتابه \" على التوحيد فيهما . فمن جمع أراد جمع كتاب ، ومن أفرد أراد المصدر الذي يجمع كل مكتوب كان نزوله من عند الله . ويجوز في قراءة من وحد أن يراد به الجمع ، يكون الكتاب اسما للجنس فتستوي القراءتان ، قال الله تعالى : فبعث الله النبيين مبشرين ومنذرين وأنزل معهم الكتاب قرأت الجماعة ( ورسله ) بضم السين ، وكذلك \" رسلنا ورسلكم ورسلك \" إلا أبا عمرو فروي عنه تخفيف \" رسلنا ورسلكم \" ، وروي عنه في \" رسلك \" التثقيل والتخفيف . قال أبو علي : من قرأ \" رسلك \" بالتثقيل فذلك أصل الكلمة ، ومن خفف فكما يخفف في الآحاد مثل : عنق وطنب . وإذا خفف في الآحاد فذلك أحرى في الجمع الذي هو أثقل ، وقال معناه مكي . وقرأ جمهور الناس ( لا نفرق ) بالنون ، والمعنى يقولون لا نفرق ، فحذف القول ، وحذف القول كثير ، قال الله تعالى : والملائكة يدخلون عليهم من كل باب سلام عليكم ؛ أي يقولون سلام عليكم . وقال : ويتفكرون في خلق السماوات والأرض ربنا ما خلقت هذا باطلا ؛ أي يقولون : ربنا ، وما كان مثله . وقرأ سعيد بن جبير ويحيى بن يعمر وأبو زرعة بن عمرو بن جرير ويعقوب \" لا يفرق \" بالياء ، وهذا على لفظ ( كل ) . قال هارون : وهي في حرف ابن مسعود \" لا يفرقون \" . وقال ( بين أحد ) على الإفراد ولم يقل آحاد ؛ لأن الأحد يتناول الواحد والجميع ، كما قال تعالى : فما منكم من أحد عنه حاجزين ف \" حاجزين \" صفة لأحد ؛ لأن معناه الجمع . وقال صلى الله عليه وسلم : ما أحلت الغنائم لأحد سود الرءوس غيركم وقال رؤبة :\nإذا أمور الناس دينت دينكا لا يرهبون أحدا من دونكا\nومعنى هذه الآية : أن المؤمنين ليسوا كاليهود والنصارى في أنهم يؤمنون ببعض ويكفرون ببعض .\nالثالثة : قوله تعالى : وقالوا سمعنا وأطعنا فيه حذف ، أي سمعنا سماع قابلين . وقيل : سمع بمعنى قبل ، كما يقال : سمع الله لمن حمده فلا يكون فيه حذف . وعلى الجملة فهذا القول يقتضي المدح لقائله . والطاعة قبول الأمر . وقوله : ( غفرانك ) مصدر كالكفران والخسران ، والعامل فيه فعل مقدر ، تقديره : اغفر غفرانك ، قاله الزجاج . وغيره : نطلب أو أسأل غفرانك .\n( وإليك المصير ) إقرار بالبعث والوقوف بين يدي الله تعالى . وروي أن النبي صلى الله عليه وسلم لما نزلت عليه هذه الآية قال له جبريل : ( إن الله قد أحل الثناء عليك وعلى أمتك فسل تعطه ) فسأل إلى آخر السورة .\n                                    ",
        "saadi": "ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّن رُّسُلِهِۦۚ وَقَالُواْ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٥٨٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن إيمان الرسول والمؤمنين معه، وانقيادهم وطاعتهم وسؤالهم مع ذلك المغفرة، فأخبر أنهم آمنوا بالله وملائكته وكتبه ورسله، وهذا يتضمن الإيمان بجميع ما أخبر الله به عن نفسه، وأخبرت به عنه رسله من صفات كماله ونعوت جلاله على وجه الإجمال والتفصيل، وتنزيهه عن التمثيل والتعطيل وعن جميع صفات النقص، ويتضمن الإيمان بالملائكة الذين نصت عليهم الشرائع جملة وتفصيلا وعلى الإيمان بجميع الرسل والكتب، أي: بكل ما أخبرت به الرسل وتضمنته الكتب من الأخبار والأوامر والنواهي، وأنهم لا يفرقون بين أحد من رسله، بل يؤمنون بجميعهم، لأنهم وسائط بين الله وبين عباده، فالكفر ببعضهم كفر بجميعهم بل كفر بالله ( وقالوا سمعنا ) ما أمرتنا به ونهيتنا ( وأطعنا ) لك في ذلك، ولم يكونوا ممن قالوا سمعنا وعصينا، ولما كان العبد لا بد أن يحصل منه تقصير في حقوق الله تعالى وهو محتاج إلى مغفرته على الدوام، قالوا ( غفرانك ) أي: نسألك مغفرة لما صدر منا من التقصير والذنوب، ومحو ما اتصفنا به من العيوب ( وإليك المصير ) أي: المرجع لجميع الخلائق فتجزيهم بما عملوا من خير وشر.\n                                    "
      },
      "originalText": "ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّن رُّسُلِهِۦۚ وَقَالُواْ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٥٨٢"
    },
    {
      "number": 293,
      "text": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 286,
      "juz": 3,
      "manzil": 1,
      "page": 49,
      "ruku": 41,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَآ إِن نَّسِينَآ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٦٨٢\n                                        \n                                        \n                                        وقوله : ( لا يكلف الله نفسا إلا وسعها ) أي : لا يكلف أحدا فوق طاقته ، وهذا من لطفه تعالى بخلقه ورأفته بهم وإحسانه إليهم ، وهذه هي الناسخة الرافعة لما كان أشفق منه الصحابة ، في قوله : ( وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله ) أي : هو وإن حاسب وسأل لكن لا يعذب إلا بما يملك الشخص دفعه ، فأما ما لا يمكن دفعه من وسوسة النفس وحديثها ، فهذا لا يكلف به الإنسان ، وكراهية الوسوسة السيئة من الإيمان .\nوقوله : ( لها ما كسبت ) أي : من خير ، ( وعليها ما اكتسبت ) أي : من شر ، وذلك في الأعمال التي تدخل تحت التكليف ، ثم قال تعالى مرشدا عباده إلى سؤاله ، وقد تكفل لهم بالإجابة ، كما أرشدهم وعلمهم أن يقولوا : ( ربنا لا تؤاخذنا إن [ نسينا ] ) أي : إن تركنا فرضا على جهة النسيان ، أو فعلنا حراما كذلك ، ( أو أخطأنا ) أي : الصواب في العمل ، جهلا منا بوجهه الشرعي .\nوقد تقدم في صحيح مسلم لحديث أبي هريرة : \" قال الله : نعم \" ولحديث ابن عباس قال الله : \" قد فعلت \" .\nوروى ابن ماجه في سننه ، وابن حبان في صحيحه من حديث أبي عمرو الأوزاعي ، عن عطاء قال ابن ماجه في روايته : عن ابن عباس . وقال الطبراني وابن حبان : عن عطاء ، عن عبيد بن عمير ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : \" إن الله وضع عن أمتي الخطأ والنسيان ، وما استكرهوا عليه \" . وقد روي من طرق أخر وأعله أحمد وأبو حاتم والله أعلم . وقال ابن أبي حاتم : حدثنا أبي ، حدثنا مسلم بن إبراهيم ، حدثنا أبو بكر الهذلي ، عن شهر ، عن أم الدرداء ، عن النبي صلى الله عليه وسلم قال : \" إن الله تجاوز لأمتي عن ثلاث : عن الخطأ ، والنسيان ، والاستكراه \" قال أبو بكر : فذكرت ذلك للحسن ، فقال : أجل ، أما تقرأ بذلك قرآنا : ( ربنا لا تؤاخذنا إن نسينا أو أخطأنا ) .\nوقوله : ( ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ) أي : لا تكلفنا من الأعمال الشاقة وإن أطقناها ، كما شرعته للأمم الماضية قبلنا من الأغلال والآصار التي كانت عليهم ، التي بعثت نبيك محمدا صلى الله عليه وسلم نبي الرحمة بوضعه في شرعه الذي أرسلته به ، من الدين الحنيف السهل السمح .\nوقد ثبت في صحيح مسلم ، عن أبي هريرة ، عن رسول الله صلى الله عليه وسلم قال : \" قال الله : نعم \" .\nوعن ابن عباس ، عن رسول الله صلى الله عليه وسلم قال : \" قال الله : قد فعلت \" . وجاء الحديث من طرق ، عن رسول الله صلى الله عليه وسلم أنه قال : \" بعثت بالحنيفية السمحة \" .\nوقوله : ( ربنا ولا تحملنا ما لا طاقة لنا به ) أي : من التكليف والمصائب والبلاء ، لا تبتلينا بما لا قبل لنا به .\nوقد قال مكحول في قوله : ( ربنا ولا تحملنا ما لا طاقة لنا به ) قال : الغربة والغلمة ، رواه ابن أبي حاتم ، \" قال الله : نعم \" وفي الحديث الآخر : \" قال الله : قد فعلت \" .\nوقوله : ( واعف عنا ) أي : فيما بيننا وبينك مما تعلمه من تقصيرنا وزللنا ، ( واغفر لنا ) أي : فيما بيننا وبين عبادك ، فلا تظهرهم على مساوينا وأعمالنا القبيحة ، ( وارحمنا ) أي : فيما يستقبل ، فلا توقعنا بتوفيقك في ذنب آخر ، ولهذا قالوا : إن المذنب محتاج إلى ثلاثة أشياء : أن يعفو الله عنه فيما بينه وبينه ، وأن يستره عن عباده فلا يفضحه به بينهم ، وأن يعصمه فلا يوقعه في نظيره . وقد تقدم في الحديث أن الله قال : نعم . وفي الحديث الآخر : \" قال الله : قد فعلت \" .\nوقوله : ( أنت مولانا ) أي : أنت ولينا وناصرنا ، وعليك توكلنا ، وأنت المستعان ، وعليك التكلان ، ولا حول ولا قوة لنا إلا بك ( فانصرنا على القوم الكافرين ) أي : الذين جحدوا دينك ، وأنكروا وحدانيتك ، ورسالة نبيك ، وعبدوا غيرك ، وأشركوا معك من عبادك ، فانصرنا عليهم ، واجعل لنا العاقبة عليهم في الدنيا والآخرة ، قال الله : نعم . وفي الحديث الذي رواه مسلم ، عن ابن عباس : \" قال الله : قد فعلت \" .\nوقال ابن جرير : حدثني المثنى بن إبراهيم ، حدثنا أبو نعيم ، حدثنا سفيان ، عن أبي إسحاق ، أن معاذا ، رضي الله عنه ، كان إذا فرغ من هذه السورة ( فانصرنا على القوم الكافرين ) قال : آمين .\nورواه وكيع عن سفيان ، عن أبي إسحاق ، عن رجل ، عن معاذ بن جبل : أنه كان إذا ختم البقرة قال : آمين .\n                                    ",
        "qortoby": "لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَآ إِن نَّسِينَآ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٦٨٢\n                                        \n                                        \n                                        قوله تعالى : لا يكلف الله نفسا إلا وسعها التكليف هو الأمر بما يشق عليه وتكلفت الأمر تجشمته ، حكاه الجوهري . والوسع : الطاقة والجدة . وهذا خبر جزم . نص الله تعالى على أنه لا يكلف العباد من وقت نزول الآية عبادة من أعمال القلب أو الجوارح إلا وهي في وسع المكلف وفي مقتضى إدراكه وبنيته ، وبهذا انكشفت الكربة عن المسلمين في تأولهم أمر الخواطر . وفي معنى هذه الآية ما حكاه أبو هريرة رضي الله عنه قال : ما وددت أن أحدا ولدتني أمه إلا جعفر بن أبي طالب فإني تبعته يوما وأنا جائع فلما بلغ منزله لم يجد فيه سوى نحي سمن قد بقي فيه أثارة فشقه بين أيدينا ، فجعلنا نلعق ما فيه من السمن والرب وهو يقول :\nما كلف الله نفسا فوق طاقتها ولا تجود يد إلا بما تجد\n- اختلف الناس في جواز تكليف ما لا يطاق في الأحكام التي هي في الدنيا ، بعد اتفاقهم على أنه ليس واقعا في الشرع ، وأن هذه الآية أذنت بعدمه ، قال أبو الحسن الأشعري وجماعة من المتكلمين : تكليف ما لا يطاق جائز عقلا ، ولا يخرم ذلك شيئا من عقائد الشرع ، ويكون ذلك أمارة على تعذيب المكلف وقطعا به ، وينظر إلى هذا تكليف المصور أن يعقد شعيرة . واختلف القائلون بجوازه هل وقع في رسالة محمد صلى الله عليه وسلم أو لا ؟ فقال فرقة : وقع في نازلة أبي لهب ؛ لأنه كلفه بالإيمان بجملة الشريعة ، ومن جملتها أنه لا يؤمن ؛ لأنه حكم عليه بتب اليدين وصلي النار وذلك مؤذن بأنه لا يؤمن ، فقد كلفه بأن يؤمن بأنه لا يؤمن . وقالت فرقة : لم يقع قط . وقد حكي الإجماع على ذلك . وقوله تعالى : سيصلى نارا معناه إن وافى ، حكاه ابن عطية . و ( يكلف ) يتعدى إلى مفعولين أحدهما محذوف ، تقديره عبادة أو شيئا . فالله سبحانه بلطفه وإنعامه علينا - وإن كان قد كلفنا بما يشق ويثقل كثبوت الواحد للعشرة ، وهجرة الإنسان وخروجه من وطنه ومفارقة أهله ووطنه وعادته - لكنه لم يكلفنا بالمشقات المثقلة ولا بالأمور المؤلمة ، كما كلف من قبلنا بقتل أنفسهم وقرض موضع البول من ثيابهم وجلودهم ، بل سهل ورفق ووضع عنا الإصر والأغلال التي وضعها على من كان قبلنا . فلله الحمد والمنة ، والفضل والنعمة .\n- قوله تعالى : لها ما كسبت وعليها ما اكتسبت يريد من الحسنات والسيئات قاله السدي . وجماعة المفسرين لا خلاف بينهم في ذلك ، قاله ابن عطية . وهو مثل قوله : ولا تزر وازرة وزر أخرى ولا تكسب كل نفس إلا عليها . والخواطر ونحوها ليست من كسب الإنسان . وجاءت العبارة في الحسنات ب \" لها \" من حيث هي مما يفرح المرء بكسبه ويسر بها ، فتضاف إلى ملكه وجاءت في السيئات ب \" عليها \" من حيث هي أثقال وأوزار ومتحملات صعبة ، وهذا كما تقول : لي مال وعلي دين . وكرر فعل الكسب فخالف بين التصريف حسنا لنمط الكلام ، كما قال : فمهل الكافرين أمهلهم رويدا . قال ابن عطية : ويظهر لي في هذا أن الحسنات هي مما تكتسب دون تكلف ، إذ كاسبها على جادة أمر الله تعالى ورسم شرعه ، والسيئات تكتسب ببناء المبالغة ، إذ كاسبها يتكلف في أمرها خرق حجاب نهي الله تعالى ويتخطاه إليها ، فيحسن في الآية مجيء التصريفين إحرازا ، لهذا المعنى .\n- في هذه الآية دليل على صحة إطلاق أئمتنا على أفعال العباد كسبا واكتسابا ، ولذلك لم يطلقوا على ذلك لا خلق ولا خالق ، خلافا لمن أطلق ذلك من مجترئة المبتدعة . ومن أطلق من أئمتنا ذلك على العبد ، وأنه فاعل فبالمجاز المحض . وقال المهدوي وغيره : وقيل معنى الآية لا يؤاخذ أحد بذنب أحد . قال ابن عطية : وهذا صحيح في نفسه ولكن من غير هذه الآية .\n- قال الكيا الطبري : قوله تعالى : لها ما كسبت وعليها ما اكتسبت يستدل به على أن من قتل غيره بمثقل أو بخنق أو تغريق فعليه ضمانه قصاصا أو دية ، فخلافا لمن جعل ديته على العاقلة ، وذلك يخالف الظاهر ، ويدل على أن سقوط القصاص عن الأب لا يقتضي سقوطه عن شريكه . ويدل على وجوب الحد على العاقلة إذا مكنت مجنونا من نفسها . وقال القاضي أبو بكر بن العربي : \" ذكر علماؤنا هذه الآية في أن القود واجب على شريك الأب خلافا لأبي حنيفة ، وعلى شريك الخاطئ خلافا للشافعي وأبي حنيفة ؛ لأن كل واحد منهما قد اكتسب القتل . وقالوا : إن اشتراك من لا يجب عليه القصاص مع من يجب عليه القصاص لا يكون شبهة في درء ما يدرأ بالشبهة \" .\n- ربنا لا تؤاخذنا إن نسينا أو أخطأنا المعنى : اعف عن إثم ما يقع منا على هذين الوجهين أو أحدهما ، كقوله عليه السلام : رفع عن أمتي الخطأ والنسيان ، وما استكرهوا عليه أي إثم ذلك . وهذا لم يختلف فيه أن الإثم مرفوع ، وإنما اختلف فيما يتعلق على ذلك من الأحكام ، هل ذلك مرفوع لا يلزم منه شيء أو يلزم أحكام ذلك كله ؟ اختلف فيه . والصحيح أن ذلك يختلف بحسب الوقائع ، فقسم لا يسقط باتفاق كالغرامات والديات والصلوات المفروضات . وقسم يسقط باتفاق كالقصاص والنطق بكلمة الكفر . وقسم ثالث يختلف فيه كمن أكل ناسيا في رمضان أو حنث ساهيا ، وما كان مثله مما يقع خطأ ونسيانا ، ويعرف ذلك في الفروع .\n- قوله تعالى : ربنا ولا تحمل علينا إصرا أي ثقلا قال مالك والربيع : الإصر الأمر الغليظ الصعب . وقال سعيد بن جبير : الإصر شدة العمل . وما غلظ على بني إسرائيل من البول ونحوه ، قال الضحاك : كانوا يحملون أمورا شدادا ، وهذا نحو قول مالك والربيع ، ومنه قول النابغة :\nيا مانع الضيم أن يغشى سراتهم والحامل الإصر عنهم بعدما عرفوا\nعطاء : الإصر : المسخ قردة وخنازير ، وقاله ابن زيد أيضا . وعنه أيضا أنه الذنب الذي ليس فيه توبة ولا كفارة . والإصر في اللغة : العهد ، ومنه قوله تعالى : وأخذتم على ذلكم إصري . والإصر : الضيق والذنب والثقل . والإصار : الحبل الذي تربط به الأحمال ونحوها ، يقال : أصر يأصر أصرا حبسه . والإصر - بكسر الهمزة - من ذلك قال الجوهري : والموضع مأصر ومأصر والجمع مآصر ، والعامة تقول معاصر . قال ابن خويزمنداد : ويمكن أن يستدل بهذا الظاهر في كل عبادة ادعى الخصم تثقيلها ، فهو نحو قوله تعالى : وما جعل عليكم في الدين من حرج ، وكقول النبي صلى الله عليه وسلم : الدين يسر فيسروا ولا تعسروا . اللهم شق على من شق على أمة محمد صلى الله عليه وسلم . قلت : ونحوه قال الكيا الطبري قال : يحتج به في نفي الحرج والضيق المنافي ظاهره للحنيفية السمحة ، وهذا بين .\n- قوله تعالى : ولا تحملنا ما لا طاقة لنا به قال قتادة : معناه لا تشدد علينا كما شددت على من كان قبلنا . الضحاك : لا تحملنا من الأعمال ما لا نطيق ، وقال نحوه ابن زيد . ابن جريج : لا تمسخنا قردة ولا خنازير . وقال سلام بن سابور : الذي لا طاقة لنا به : الغلمة وحكاه النقاش عن مجاهد وعطاء . وروى أن أبا الدرداء كان يقول في دعائه : وأعوذ بك من غلمة ليس لها عدة . وقال السدي : هو التغليظ والأغلال التي كانت على بني إسرائيل .\nقوله تعالى : \" واعف عنا \" أي عن ذنوبنا . عفوت عن ذنبه إذا تركته ولم تعاقبه . \" واغفر لنا \" : أي استر على ذنوبنا . والغفر : الستر . وارحمنا ، أي تفضل برحمة مبتدئا منك علينا . \" أنت مولانا \" : أي ولينا وناصرنا . وخرج هذا مخرج التعليم للخلق كيف يدعون . روي عن معاذ بن جبل أنه كان إذا فرغ من قراءة هذه السورة قال : آمين . قال ابن عطية : هذا يظن به أنه رواه عن النبي صلى الله عليه وسلم ، فإن كان ذلك فكمال ، وإن كان بقياس على سورة الحمد من حيث هنالك دعاء وهنا دعاء فحسن . وقال علي بن أبي طالب : ما أظن أن أحدا عقل وأدرك الإسلام ينام حتى يقرأهما .\nقلت : قد روى مسلم في هذا المعنى عن أبي مسعود الأنصاري قال : قال رسول الله صلى الله عليه وسلم من قرأ هاتين الآيتين من آخر سورة البقرة في ليلة كفتاه . قيل : من قيام الليل ؛ كما روي عن ابن عمر قال : سمعت النبي صلى الله عليه وسلم يقول : أنزل الله علي آيتين من كنوز الجنة ختم بهما سورة البقرة كتبهما الرحمن بيده قبل أن يخلق الخلق بألف عام من قرأهما بعد العشاء مرتين أجزأتاه من قيام الليل آمن الرسول إلى آخر البقرة وقيل : كفتاه من شر الشيطان فلا يكون له عليه سلطان . وأسند أبو عمرو الداني عن حذيفة بن اليمان قال : قال رسول الله صلى الله عليه وسلم إن الله جل وعز كتب كتابا قبل أن يخلق السماوات والأرض بألفي عام فأنزل منه هذه الثلاث آيات التي ختم بهن البقرة من قرأهن في بيته لم يقرب الشيطان بيته ثلاث ليال وروي أن النبي صلى الله عليه وسلم قال : أوتيت هذه الآيات من آخر سورة البقرة من كنز تحت العرش لم يؤتهن نبي قبلي وقد تقدم في الفاتحة نزول الملك بها مع الفاتحة . والحمد لله .\nتم الجزء الثالث من تفسير القرطبي يتلوه إن شاء الله الجزء الرابع وأوله سورة آل عمران\n                                    ",
        "saadi": "لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَآ إِن نَّسِينَآ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٦٨٢\n                                        \n                                        \n                                        \n                                        لما نزل قوله تعالى { وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله } شق ذلك على المسلمين لما توهموا أن ما يقع في القلب من الأمور اللازمة والعارضة المستقرة وغيرها مؤاخذون به، فأخبرهم بهذه الآية أنه لا يكلف نفسا إلا وسعها أي: أمرا تسعه طاقتها، ولا يكلفها ويشق عليها، كما قال تعالى { ما جعل عليكم في الدين من حرج } فأصل الأوامر والنواهي ليست من الأمور التي تشق على النفوس، بل هي غذاء للأرواح ودواء للأبدان، وحمية عن الضرر، فالله تعالى أمر العباد بما أمرهم به رحمة وإحسانا، ومع هذا إذا حصل بعض الأعذار التي هي مظنة المشقة حصل التخفيف والتسهيل، إما بإسقاطه عن المكلف، أو إسقاط بعضه كما في التخفيف عن المريض والمسافر وغيرهم، ثم أخبر تعالى أن لكل نفس ما كسبت من الخير، وعليها ما اكتسبت من الشر، فلا تزر وازرة وزر أخرى ولا تذهب حسنات العبد لغيره، وفي الإتيان بـ \" كسب \" في الخير الدال على أن عمل الخير يحصل للإنسان بأدنى سعي منه بل بمجرد نية القلب وأتى بـ \" اكتسب \" في عمل الشر للدلالة على أن عمل الشر لا يكتب على الإنسان حتى يعمله ويحصل سعيه، ولما أخبر تعالى عن إيمان الرسول والمؤمنين معه وأن كل عامل سيجازى بعمله، وكان الإنسان عرضة للتقصير والخطأ والنسيان، وأخبر أنه لا يكلفنا إلا ما نطيق وتسعه قوتنا، أخبر عن دعاء المؤمنين بذلك، وقد أخبر النبي صلى الله عليه وسلم أن الله قال: قد فعلت. إجابة لهذا الدعاء، فقال { ربنا لا تؤاخذنا إن نسينا أو أخطأنا } والفرق بينهما: أن النسيان: ذهول القلب عن ما أمر به فيتركه نسيانا، والخطأ: أن يقصد شيئا يجوز له قصده ثم يقع فعله على ما لا يجوز له فعله: فهذان قد عفا الله عن هذه الأمة ما يقع بهما رحمة بهم وإحسانا، فعلى هذا من صلى في ثوب مغصوب، أو نجس، أو قد نسي نجاسة على بدنه، أو تكلم في الصلاة ناسيا، أو فعل مفطرا ناسيا، أو فعل محظورا من محظورات الإحرام التي ليس فيها إتلاف ناسيا، فإنه معفو عنه، وكذلك لا يحنث من فعل المحلوف عليه ناسيا، وكذلك لو أخطأ فأتلف نفسا أو مالا فليس عليه إثم، وإنما الضمان مرتب على مجرد الإتلاف، وكذلك المواضع التي تجب فيها التسمية إذا تركها الإنسان ناسيا لم يضر. { ربنا ولا تحمل علينا إصرا } أي: تكاليف مشقة { كما حملته على الذين من قبلنا } وقد فعل تعالى فإن الله خفف عن هذه الأمة في الأوامر من الطهارات وأحوال العبادات ما لم يخففه على غيرها { ربنا ولا تحملنا ما لا طاقة لنا به } وقد فعل وله الحمد { واعف عنا واغفر لنا وارحمنا } فالعفو والمغفرة يحصل بهما دفع المكاره والشرور، والرحمة يحصل بها صلاح الأمور { أنت مولانا } أي: ربنا ومليكنا وإلهنا الذي لم تزل ولايتك إيانا منذ أوجدتنا وأنشأتنا فنعمك دارة علينا متصلة عدد الأوقات، ثم أنعمت علينا بالنعمة العظيمة والمنحة الجسيمة، وهي نعمة الإسلام التي جميع النعم تبع لها، فنسألك يا ربنا ومولانا تمام نعمتك بأن تنصرنا على القوم الكافرين، الذين كفروا بك وبرسلك، وقاوموا أهل دينك ونبذوا أمرك، فانصرنا عليهم بالحجة والبيان والسيف والسنان، بأن تمكن لنا في الأرض وتخذلهم وترزقنا الإيمان والأعمال التي يحصل بها النصر، والحمد لله رب العالمين.\nتم تفسير سورة البقرة بعون الله وتوفيقه وصلى الله على محمد وسلم\n                                    "
      },
      "originalText": "لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَيۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَآ إِن نَّسِينَآ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٦٨٢"
    }
  ]
}