{
  "number": 50,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 294,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الم",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 1,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "الٓمٓ ١\n                                    \n                                    \n                                    وصدرها إلى ثلاث وثمانين آية منها نزل في وفد نجران وكان قدومهم في سنة تسع من الهجرة كما سيأتى بيان ذلك عند تفسير آية المباهلة منها إن شاء الله تعالى وقد ذكر ما ورد من فضلها مع سورة البقرة أول البقرة.\nقد اختلف المفسرون في الحروف المقطعة التي في أوائل السور فمنهم من قال هي مما استأثر الله بعلمه فردوا علمها إلى الله ولم يفسرها حكاه القرطبي في تفسـره عن أبي بكر وعمر وعثمان وعلي وابن مسعود رضي الله عنهم أجمعين وقاله عامر الشعبي وسفيان الثوري والربيع بن خيثم واختاره أبو حاتم بن حبان.\nومنهم من فسرها واختلف هؤلاء في معناها فقال عبدالرحمن بن زيد بن أسلم إنما هي أسماء السور.\nقال العلامة أبو القاسم محمود بن عمر الزمخشري في تفسيره وعليه إطباق الأكثر ونقل عن سيبويه أنه نص عليه ويعتضد لهذا بما ورد في الصحيحين عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الصبح يوم الجمعة \"الم\" السجدة و \"هل أتى على الإنسان\" وقال سفيان الثوري عن ابن أبي نجيح عن مجاهد أنه قال:الم وحم والمص وص.\nفواتح افتتح الله بها القرآن وكذا قال غيره عن مجاهد وقال مجاهد في رواية أبي حذيفة موسى بن مسعود عن شبل عن ابن أبي نجيح عنه أنه قال الم اسم من أسماء القرآن وهكذا وقال قتادة وزيد بن أسلم ولعل هذا يرجع إلى معنى قول عبدالرحمن بن زيد بن أسلم أنه اسم من أسماء السور فإن كل سورة يطلق عليها اسم القرآن فإنه يبعد أن يكون المص اسما للقرآن كله لأن المتبادر إلى فهم سامع من يقول قرأت المص إنما ذلك عبارة عن سورة الأعراف لا لمجموع القرآن والله أعلم.\nوقيل هي اسم من أسماء الله تعالى فقال عنها في فواتح السور من أسماء الله تعالى وكذلك قال سالم بن عبدالله وإسماعيل بن عبدالرحمن السدي الكبير وقال شعبة عن السدي بلغني أن ابن عباس قال الم اسم من أسماء الله الأعظم.\nهكذا رواه ابن أبي حاتم من حديث شعبة ورواه ابن جرير عن بندار عن ابن مهدي عن شعبة قال سألت السدي عن حم وطس والم فقال قال ابن عباس هي اسم الله الأعظم وقال ابن جرير وحدثنا محمد بن المثنى حدثنا أبو النعمان حدثنا شعبة عن إسماعيل السدي عن مرة الهمذانى قال: قال عبدالله فذكر نحوه.\nوحُكي مثله عن علي وابن عباس وقال علي بن أبي طلحة عن ابن عباس هو قسم أقسم الله به وهو من أسماء الله تعالى وروى ابن أبي حاتم وابن جرير من حديث ابن علية عن خالد الحذاء عن عكرمة أنه قال الم قسم.\nوروينا أيضا من حديث شريك بن عبدالله بن عطاء بن السائب عن أبى الضحى عن ابن عباس:الم قال أنا الله أعلم وكذا قال سعيد بن جبير وقال السدي عن أبي مالك وعن أبي صالح عن ابن عباس وعن مرة الهمذاني عن ابن مسعود وعن ناس من أصحاب النبي صلى الله عليه وسلم الم قال أما الم فهي حروف استفتحت من حروف هجاء أسماء الله تعالى.\nقال وأبو جعفر الرازي عن الربيع بن أنس عن أبي العالية في قوله تعالى الم قال هذه الأحرف الثلاثة من التسعة والعشرين حرفا دارت فيها الألسن كلها ليس منها حرف إلا وهو مفتاح اسم من أسمائه وليس منها حرف إلا وهو من آلائه وبلألائه ليس منها حرف إلا وهو في مدة أقوام وآجالهم.\nقال عيسى ابن مريم عليه السلام وعجب:فقال أعجب أنهم يظنون بأسمائه ويعيشون في رزقه فكيف يكفرون به فالألف مفتاح الله واللام مفتاح اسمه لطيف والميم مفتاح اسمه مجيد فالألف آلاء الله واللام لطف الله والميم مجد الله والألف سنة واللام ثلاثون سنة والميم أربعون سنة.\nهذا لفظ ابن أبي حاتم ونحوه رواه ابن جرير ثم شرع يوجه كل واحد من هذه الأقوال ويوفق بينها وأنه لا منافاة بين كل واحد منها وبين الآخر وأن الجمع ممكن فهي أسماء للسور ومن أسماء الله تعالى يفتتح بها السور فكل حرف منها دل على اسم من أسمائه وصفة من صفاته كما افتتح سورا كثيرة بتحميده وتسبيحه وتعظيمه قال ولا مانع من دلالة الحرف منها على اسم من أسماء الله وعلى صفة من صفاته وعلى مدة وغير ذلك كما ذكره الربيع بن أنس عن أبي العالية لأن الكلمة الواحدة تطلق على معاني كثيرة كلفظة الأمة فإنها تطلق ويراد به الدين كقوله تعالى \"إنا وجدنا آباءنا على أمة\" وتطلق ويراد بها الرجل المطيع لله كقوله تعالى \"إن إبراهيم كان أمة قانتا لله حنيفا ولم يك من المشركين\" وتطلق ويراد بها الجماعة كقوله تعالى \"وجد عليه أمة من الناس يسقون\" وقوله تعالى \"ولقد بعثنا في كل أمة رسولا\" وتطلق ويراد بها الحين من الدهر كقوله تعالى \"وقال الذي نجا منهما وادكر بعد أمة\" أي بعد حين على أصح القولين قال فكذلك هذا.\nهذا حاصل كلامه موجها ولكن هذا ليس كما ذكره أبو العالية فإن أبا العالية زعم أن الحرف دل على هذا وعلى هذا وعلى هذا معا ولفظة الأمة وما أشبهها من الألفاظ المشتركة في الاصطلاح إنما دل في القرآن في كل موطن على معنى واحد دل عليه سياق الكلام فأما حمله على مجموع محامله إذا أمكن فمسألة مختلف فيها بين علماء الأصول ليس هذا موضع البحث فيها والله أعلم.\nثم إن لفظة الأمة تدل على كل من معانيها في سياق الكلام بدلالة الوضع فأما دلالة الحرف الواحد على اسم يمكن أن يدل على اسم آخر من غير أن يكون أحدهما أولى من الآخر في التقدير أو الإضمار بوضع ولا بغيره فهذا مما لا يفهم إلا بتوقيف والمسألة مختلف فيها وليس فيها إجماع حتى يحكم به وما أنشدوه من الشواهد على صحة إطلاق الحرف الواحد على بقية الكلمة فإن في السياق ما يدل على ما حذف بخلاف هذا كما قال الشاعر: قلنا قفي لنا فقالت قاف لا تحسبي أنا نسينا الإيجاف تعني وقفت.\nوقال الآخر: ما للظليم عال كيف لايـ ينقد عنه جلده إذا يـــــــ فقال ابن جرير كأنه أراد أن يقول إذا يفعل كذا وكذا فاكتفى بالياء من يفعل وقال الآخر: بالخير خيرات وإن شرا فــ ولا أريد الشر إلا أن تـــــ يقول وإن شرا فشرا ولا أريد الشر إلا أن تشاء فاكتفى بالفاء والتاء من الكلمتين عن بقيتهما ولكن هذا ظاهر من سياق الكلام والله أعلم.\nقال القرطبي وفي الحديث \"من أعان على قتل مسلم بشطر كلمة\" الحديث قال سفيان هو أن يقول في اقتل\"ا قـ\" وقال خصيف عن مجاهد أنه قال فواتح السور كلها\"ق وص وحم وطسم والر\" وغير ذلك هجاء موضوع وقال بعض أهل العربية هي حروف من حروف المعجم استغنى بذكر ما ذكر منها في أوائل السور عن ذكر بواقيها التي هي تتمة الثمانية والعشرين حرفا كما يقول القائل ابني يكتب في - ا ب ت ث - أي في حروف المعجم الثمانية والعشرين فيستغني بذكر بعضها عن مجموعها حكاه ابن جرير.\nقلت مجموع الحروف المذكورة في أوائل السور بحذف المكرر منها أربعة عشر حرفا وهي - ال م ص ر ك ه ي ع ط س ح ق ن- يجمعها قولك:نص حكيم قاطع له سر.\nوهي نصف الحروف عددا والمذكور منها أشرف من المتروك وبيان ذلك من صناعة التصريف.\nقال الزمخشري وهذه الحروف الأربعة عشر مشتملة على أصناف أجناس الحروف يعني من المهموسة والمجهورة ومن الرخوة والشديدة ومن المطبقة والمفتوحة ومن المستعلية والمنخفضة ومن حروف القلقلة.\nوقد سردها مفصلة ثم قال:فسبحان الذي دقت في كل شىء حكمته.\nوهذه الأجناس المعدودة مكثورة بالمذكورة منها وقد علمت أن معظم الشيء وجله ينزل منزلة كله وههنا ههنا لخص بعضهم في هذا المقام كلاما فقال:لا شك أن هذه الحروف لم ينزلها سبحانه وتعالى عبثا ولا سدى ومن قال من الجهلة إن في القرآن ما هو تعبد لا معنى له بالكلمة فقد أخطأ خطأ كبيرا فتعين أن لها معنى في نفس الأمر فإن صح لنا فيها عن المعصوم شيء قلنا به وإلا وقفنا حيث وقفنا وقلنا \"آمنا به كل من عند ربنا\" ولم يجمع العلماء فيها على شيء معين وإنما اختلفوا فمن ظهر له بعض الأقوال بدليل فعليه اتباعه وإلا فالوقف حتى يتبين هذا المقام.\nالمقام الآخر في الحكمة التي اقتضت إيراد هذه الحروف في أوائل السور ما هي مع قطع النظر عن معانيها في أنفسها فقال بعضهم إنما ذكرت ليعرف بها أوائل السور حكاه ابن جرير وهذا ضعيف لأن الفصل حاصل بدونها فيما لم تذكر فيه وفيما ذكرت فيه البسملة تلاوة وكتابة وقال آخرون بل ابتدئ بها لتفتح لاستماعها أسماع المشركين إذ تواصوا بالإعراض عن القرآن حتى إذا استمعوا له تلا عليهم المؤلف منه حكاه ابن جرير أيضا وهو ضعيف أيضا لأنه لو كان كذلك لكان ذلك في جميع السور لا يكون في بعضها بل غالبها ليس كذلك ولو كـان كذلك أيضا لانبغى الابتداء بها في أوائل الكلام معهم سواء كان افتتاح سورة أو غير ذلك ثم إن هذه السورة والتي تليها أعني البقرة وآل عمران مدنيتان ليستا خطابا للمشركين فانتقض ما ذكروه بهذه الوجوه.\nوقال آخرون بل إنما ذكرت هذه الحروف في أوائل السور التي ذكرت فيها بيانا لإعجاز القرآن وأن الخلق عاجزون عن معارضته بمثله هذا مع أنه مركب من هذه الحروف المقطعة التي يتخاطبون بها وقد حكى هذا المذهب الرازي في تفسيره عن المبرد وجمع من المحققين وحكى القرطبي عن الفراء وقطرب نحو هذا وقرره الزمخشري فى كشافه ونصره أتم نصر وإليه ذهب الشيخ الإمام العلامة أبو العباس ابن تيمية وشيخنا الحافظ المجتهد أبو الحجاج المزي وحكاه لي عن ابن تيمية.\nقال الزمخشري ولم ترد كلها مجموعة في أول القرآن وإنما كررت ليكون أبلغ في التحدي والتبكيت كما كررت قصص كثيرة وكرر التحدي بالصريح في أماكن قال وجاء منها على حرف واحد كقوله - ص ن ق- وحرفين مثل \"حم\" وثلاثة مثل \"الم\" وأربعة مثل \"المر\" و \"المص\" وخمسة مثل \"كهيعص- و- حمعسق\" لأن أساليب كلامهم على هذا من الكلمات ما هو على حرف وعلى حرفين وعلى ثلاثة وعلى أربعة وعلى خمسة لا أكثر من ذلك \"قلت\" ولهذا كل سورة افتتحت بالحروف فلا بد أن يذكر فيها الانتصار للقرآن وبيان إعجازه وعظمته وهذا معلوم بالاستقراء وهو الواقع في تسع وعشرين سورة ولهذا يقول تعالى \"الم ذلك الكتاب لا ريب فيه\" \"الم الله لا إله إلا هو الحي القيوم نزل عليك الكتاب بالحق مصدقا لما بين يديه\" \"المص كتاب أنزل إليك فلا يكن في صدرك حرج منه\" \"الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم\" \"الم تنزيل الكتاب لا ريب فيه من رب العالمين\" \"حم تنزيل من الرحمن الرحيم\" \"حم عسق كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم\" وغير ذلك من الآيات الدالة على صحة ما ذهب إليه هؤلاء لمن أمعن النظر والله أعلم.\nوأما من زعم أنها دالة على معرفة المدد وأنه يستخرج من ذلك أوقات الحوادث والفتن والملاحم فقد ادعى ما ليس له وطار في غير مطاره وقد ورد في ذلك حديث ضعيف وهو مع ذلك أدل على بطلان هذا المسلك من التمسك به على صحته وهو ما رواه محمد بن إسحق بن يسار صاحب المغازي حدثني الكلبي عن أبي صالح عن ابن عباس عن جابر بن عبدالله بن رباب قال مر أبو ياسر بن أخطب في رجال من يهود برسول الله صلى الله عليه وسلم وهو يتلو فاتحة سورة البقرة \"الم ذلك الكتاب لا ريب فيه\" فأتى أخاه بن أخطب في رجال من اليهود فقال تعلمون والله لقد سمعت محمدا يتلو فيما أنزل الله تعالى عليه \"الم ذلك الكتاب لا ريب فيه\" فقال أنت سمعته قال نعم قال فمشى حي بن أخطب في أولئك النفر من اليهود إلى رسول الله صلى الله عليه وسلم فقالوا يا محمد ألم يذكر أنك تتلوا فيما أنزل الله عليك \"الم ذلك الكتاب\"؟ فقال رسول الله صلى الله عليه وسلم \"بلى\" فقالوا جاءك بهذا جبريل من عند الله؟ فقال \"نعم\" قالوا لقد بعث الله قبلك أنبياء ما نعلمه بين لنبي منهم ما مدة ملكه وما أجل أمته غيرك.\nفقام حي بن أخطب وأقبل على من كان معه فقال لهم الألف واحدة واللام ثلاثون والميم أربعون فهذه إحدى وسبعون سنة أفتدخلون في دين نبي إنما مدة ملكه وأجل أمته إحدى وسبعون سنة؟ ثم أقبل على رسول الله صلى الله عليه وسلم فقال يا محمد هل مع هذا غيره فقال \"نعم\" قال ما ذاك؟ قال \"المص\" قال هذا أثقل وأطول الألف واحد واللام ثلاثون والميم أربعون والصاد تسعون فهذه إحدى وثلاثون ومائة سنة.\nهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ما ذاك؟ قال \"الر\" قال هذا أثقل وأطول الألف واحدة واللام ثلاثون والراء مائتان فهذه إحدى وثلاثون ومائتا سنة.\nفهل مع هذا يا محمد غيره؟ قال \"نعم\" قال ماذا قال \"المر\" قال هذه أثقل وأطول الألف واحدة واللام ثلاثون والميم أربعون والراء مائتان فهذه إحدى وسبعون ومائتان ثم قال:لقد لبس علينا أمرك يا محمد حتى ما ندري أقليلا أعطيت أم كثيرا.\nثم قال قوموا عنه ثم قال أبو ياسر لأخيه حي بن أخطب ولمن معه من الأحبار ما يدريكم لعله قد جمع هذا لمحمد كله إحدى وسبعون وإحدى وثلاثون ومائة وإحدى وثلاثون ومائتان وإحدى وسبعون ومائتان فذلك سبعمائة وأربع سنين؟ فقالوا لقد تشابه علينا أمره فيزعمون أن هؤلاء الآيات نزلت فيهم \"هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات\" فهذا الحديث مداره على محمد بن السائب الكلبي وهو ممن لا يحتج بما انفرد به ثم كان مقتضى هذا المسلك إن كان صحيحا أن يحسب ما لكل حرف من الحروف الأربعة عشر التي ذكرناها وذلك يبلغ منه جملة كثيرة وإن حسبت مع التكرر فأطم وأعظم والله أعلم.\n                                    ",
        "qortoby": "الٓمٓ ١\n                                    \n                                    \n                                    اختلف أهل التأويل في الحروف التي في أوائل السورة ; فقال عامر الشعبي وسفيان الثوري وجماعة من المحدثين : هي سر الله في القرآن , ولله في كل كتاب من كتبه سر .\nفهي من المتشابه الذي انفرد الله تعالى بعلمه , ولا يجب أن يتكلم فيها , ولكن نؤمن بها ونقرأ كما جاءت .\nوروي هذا القول عن أبي بكر الصديق وعن علي بن أبي طالب رضي الله عنهما .\nوذكر أبو الليث السمرقندي عن عمر وعثمان وابن مسعود أنهم قالوا : الحروف المقطعة من المكتوم الذي لا يفسر .\nوقال أبو حاتم : لم نجد الحروف المقطعة في القرآن إلا في أوائل السور , ولا ندري ما أراد الله جل وعز بها .\nقلت : ومن هذا المعنى ما ذكره أبو بكر الأنباري : حدثنا الحسن بن الحباب حدثنا أبو بكر بن أبي طالب حدثنا أبو المنذر الواسطي عن مالك بن مغول عن سعيد بن مسروق عن الربيع بن خثيم قال : إن الله تعالى أنزل هذا القرآن فاستأثر منه بعلم ما شاء , وأطلعكم على ما شاء , فأما ما استأثر به لنفسه فلستم بنائليه فلا تسألوا عنه , وأما الذي أطلعكم عليه فهو الذي تسألون عنه وتخبرون به , وما بكل القرآن تعلمون , ولا بكل ما تعلمون تعملون .\nقال أبو بكر : فهذا يوضح أن حروفا من القرآن سترت معانيها عن جميع العالم , اختبارا من الله عز وجل وامتحانا ; فمن آمن بها أثيب وسعد , ومن كفر وشك أثم وبعد .\nحدثنا أبو يوسف بن يعقوب القاضي حدثنا محمد بن أبي بكر حدثنا عبد الرحمن بن مهدي عن سفيان عن الأعمش عن عمارة عن حريث بن ظهير عن عبد الله قال : ما آمن مؤمن أفضل من إيمان بغيب , ثم قرأ : \" الذين يؤمنون بالغيب \" [ البقرة : 3 ] .\nقلت : هذا القول في المتشابه وحكمه , وهو الصحيح على ما يأتي بيانه في ( آل عمران ) إن شاء الله تعالى .\nوقال جمع من العلماء كبير : بل يجب أن نتكلم فيها , ونلتمس الفوائد التي تحتها , والمعاني التي تتخرج عليها ; واختلفوا في ذلك على أقوال عديدة ; فروي عن ابن عباس وعلي أيضا أن الحروف المقطعة في القرآن اسم الله الأعظم , إلا أنا لا نعرف تأليفه منها .\nوقال قطرب والفراء وغيرهما : هي إشارة إلى حروف الهجاء أعلم الله بها العرب حين تحداهم بالقرآن أنه مؤتلف من حروف هي التي منها بناء كلامهم ; ليكون عجزهم عنه أبلغ في الحجة عليهم إذ لم يخرج عن كلامهم .\nقال قطرب : كانوا ينفرون عند استماع القرآن , فلما سمعوا : \" الم \" و \" المص \" استنكروا هذا اللفظ , فلما أنصتوا له صلى الله عليه وسلم أقبل عليهم بالقرآن المؤتلف ليثبته في أسماعهم وآذانهم ويقيم الحجة عليهم .\nوقال قوم : روي أن المشركين لما أعرضوا عن سماع القرآن بمكة وقالوا : \" لا تسمعوا لهذا القرآن والغوا فيه \" [ فصلت : 26 ] نزلت ليستغربوها فيفتحون لها أسماعهم فيسمعون القرآن بعدها فتجب عليهم الحجة .\nوقال جماعة : هي حروف دالة على أسماء أخذت منها وحذفت بقيتها ; كقول ابن عباس وغيره : الألف من الله , واللام من جبريل , والميم من محمد صلى الله عليه وسلم .\nوقيل : الألف مفتاح اسمه الله , واللام مفتاح اسمه لطيف , والميم مفتاح اسمه مجيد .\nوروى أبو الضحى عن ابن عباس في قوله : \" الم \" قال : أنا الله أعلم , \" الر \" أنا الله أرى , \" المص \" أنا الله أفضل .\nفالألف تؤدي عن معنى أنا , واللام تؤدي عن اسم الله , والميم تؤدي عن معنى أعلم .\nواختار هذا القول الزجاج وقال : أذهب إلى أن كل حرف منها يؤدي عن معنى ; وقد تكلمت العرب بالحروف المقطعة نظما لها ووضعا بدل الكلمات التي الحروف منها , كقوله : فقلت لها قفي فقالت قاف أراد : قالت وقفت .\nوقال زهير : بالخير خيرات وإن شرا فا ولا أريد الشر إلا أن تا أراد : وإن شرا فشر .\nوأراد : إلا أن تشاء .\nوقال آخر : نادوهم ألا الجموا ألا تا قالوا جميعا كلهم ألا فا أراد : ألا تركبون , قالوا : ألا فاركبوا .\nوفي الحديث : ( من أعان على قتل مسلم بشطر كلمة ) قال شقيق : هو أن يقول في اقتل : اق ; كما قال عليه السلام ( كفى بالسيف شا ) معناه : شافيا .\nوقال زيد بن أسلم : هي أسماء للسور .\nوقال الكلبي : هي أقسام أقسم الله تعالى بها لشرفها وفضلها , وهي من أسمائه ; عن ابن عباس أيضا ورد بعض العلماء هذا القول فقال : لا يصح أن يكون قسما لأن القسم معقود على حروف مثل : إن وقد ولقد وما ; ولم يوجد ها هنا حرف من هذه الحروف , فلا يجوز أن يكون يمينا .\nوالجواب أن يقال : موضع القسم قوله تعالى : \" لا ريب فيه \" فلو أن إنسانا حلف فقال : والله هذا الكتاب لا ريب فيه ; لكان الكلام سديدا , وتكون \" لا \" جواب القسم .\nفثبت أن قول الكلبي وما روي عن ابن عباس سديد صحيح .\nفإن قيل : ما الحكمة في القسم من الله تعالى , وكان القوم في ذلك الزمان على صنفين : مصدق , ومكذب ; فالمصدق يصدق بغير قسم , والمكذب لا يصدق مع القسم ؟ .\nقيل له : القرآن نزل بلغة العرب ; والعرب إذا أراد بعضهم أن يؤكد كلامه أقسم على كلامه ; والله تعالى أراد أن يؤكد عليهم الحجة فأقسم أن القرآن من عنده .\nوقال بعضهم : \" الم \" أي أنزلت عليك هذا الكتاب من اللوح المحفوظ .\nوقال قتادة في قوله : \" الم \" قال اسم من أسماء القرآن .\nوروي عن محمد بن علي الترمذي أنه قال : إن الله تعالى أودع جميع ما في تلك السورة من الأحكام والقصص في الحروف التي ذكرها في أول السورة , ولا يعرف ذلك إلا نبي أو ولي , ثم بين ذلك في جميع السورة ليفقه الناس .\nوقيل غير هذا من الأقوال ; فالله أعلم .\nوالوقف على هذه الحروف على السكون لنقصانها إلا إذا أخبرت عنها أو عطفتها فإنك تعربها .\nواختلف : هل لها محل من الإعراب ؟ فقيل : لا ; لأنها ليست أسماء متمكنة , ولا أفعالا مضارعة ; وإنما هي بمنزلة حروف التهجي فهي محكية .\nهذا مذهب الخليل وسيبويه .\nومن قال : إنها أسماء السور فموضعها عنده الرفع على أنها عنده خبر ابتداء مضمر ; أي هذه \" الم \" ; كما تقول : هذه سورة البقرة .\nأو تكون رفعا على الابتداء والخبر ذلك ; كما تقول : زيد ذلك الرجل .\nوقال ابن كيسان النحوي : \" الم \" في موضع نصب ; كما تقول : اقرأ \" الم \" أو عليك \" الم \" .\nوقيل : في موضع خفض بالقسم ; لقول ابن عباس : إنها أقسام أقسم الله بها .\n                                    ",
        "saadi": "الٓمٓ ١\n                                        \n                                        \n                                        \n                                        وهي مدنية\nنزل صدرها إلى بضع وثمانين آية في مخاصمة النصارى وإبطال مذهبهم ودعوتهم إلى الدخول في الدين الحق دين الإسلام كما نزل صدر البقرة في محاجة اليهود كما تقدم.\nتقدم تفسيرها\n                                    "
      },
      "originalText": "الٓمٓ ١"
    },
    {
      "number": 295,
      "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 2,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُ ٢\n                                    \n                                    \n                                    وقد ذكرنا الحديث الوارد في أن اسم الله الأعظم في هاتين الآيتين : ( الله لا إله إلا هو الحي القيوم ) و ( الم الله لا إله إلا هو الحي القيوم ) عند تفسير آية الكرسي ، وتقدم الكلام على قوله تعالى : ( الم ) في أول سورة البقرة ، بما أغنى عن إعادته ، وتقدم أيضا الكلام على قوله : ( الله لا إله إلا هو الحي القيوم ) في تفسير آية الكرسي .\n                                    ",
        "qortoby": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُ ٢\n                                    \n                                    \n                                    قوله تعالى : الم الله لا إله إلا هو الحي القيوم\nفيه خمس مسائل ( الأولى ) : قوله : الله لا إله إلا هو الحي القيوم هذه السورة مدنية بإجماع . وحكى النقاش أن اسمها في التوراة طيبة ، وقرأ الحسن وعمرو بن عبيد وعاصم بن أبي النجود وأبو جعفر الرؤاسي ( الم الله ) بقطع ألف الوصل ، على تقدير الوقف على ( الم ) كما يقدرون الوقف على أسماء الأعداد في نحو : واحد ، اثنان ، ثلاثة ، أربعة ، وهم واصلون . قال الأخفش سعيد : ويجوز ( الم الله ) بكسر الميم لالتقاء الساكنين . قال الزجاج : هذا خطأ ، ولا تقوله العرب لثقله . قال النحاس : القراءة الأولى قراءة العامة ، وقد تكلم فيها النحويون القدماء . فمذهب سيبويه أن الميم فتحت لالتقاء الساكنين ، واختاروا لها الفتح لئلا يجمع بين كسرة وياء وكسرة قبلها . وقال الكسائي : حروف التهجي إذا لقيتها ألف وصل فحذفت ألف الوصل حركتها بحركة الألف فقلت : الم الله ، والم اذكر ، والم اقتربت . وقال الفراء : الأصل ( الم الله ) كما قرأ الرؤاسي فألقيت حركة الهمزة على الميم . وقرأ عمر بن الخطاب ( الحي القيام ) . وقال خارجة : في مصحف عبد الله ( الحي القيم ) . وقد تقدم ما للعلماء من آراء في الحروف التي في أوائل السور في أول ( البقرة ) . ومن حيث جاء في هذه السورة : الله لا إله إلا هو الحي القيوم جملة قائمة بنفسها فتتصور تلك الأقوال كلها .\n( الثانية ) : روى الكسائي أن عمر بن الخطاب - رضي الله عنه - صلى العشاء فاستفتح ( آل عمران ) فقرأ ( الم الله لا إله إلا هو الحي القيام ) فقرأ في الركعة الأولى بمائة آية ، وفي الثانية بالمائة الباقية . قال علماؤنا : ولا يقرأ سورة في ركعتين ، فإن فعل أجزأه . وقال مالك في المجموعة : لا بأس به ، وما هو بالشأن .\nقلت : الصحيح جواز ذلك . وقد قرأ النبي - صلى الله عليه وسلم - بالأعراف في المغرب فرقها في ركعتين . خرجه النسائي أيضا ، وصححه أبو محمد عبد الحق ، وسيأتي .\n( الثالثة ) : هذه السورة ورد في فضلها آثار وأخبار فمن ذلك ما جاء أنها أمان من الحيات ، وكنز للصعلوك ، وأنها تحاج عن قارئها في الآخرة ، ويكتب لمن قرأ آخرها في ليلة كقيام ليلة ، إلى غير ذلك . ذكر الدارمي أبو محمد في مسنده حدثنا أبو عبيد القاسم بن سلام قال حدثني عبيد الله الأشجعي قال : حدثني مسعر قال حدثني جابر ، قبل أن يقع فيما وقع فيه ، عن الشعبي قال : قال عبد الله : ( نعم كنز الصعلوك سورة ( آل عمران ) يقوم بها في آخر الليل ) حدثنا محمد بن سعيد حدثنا عبد السلام عن الجريري عن أبي السليل قال : أصاب رجل دما قال : فأوى إلى وادي مجنة : واد لا يمشي فيه أحد إلا أصابته حية ، وعلى شفير الوادي راهبان ، فلما أمسى قال أحدهما لصاحبه : هلك والله الرجل ! قال : فافتتح سورة ( آل عمران ) قالا : فقرأ سورة طيبة لعله سينجو . قال : فأصبح سليما . وأسند عن مكحول قال : ( من قرأ سورة ( آل عمران ) يوم الجمعة صلت عليه الملائكة إلى الليل ) وأسند عن عثمان بن عفان قال : ( من قرأ آخر سورة ( آل عمران ) في ليلة كتب له قيام ليلة ) في طريقه ابن لهيعة . وخرج مسلم عن النواس بن سمعان الكلابي قال : سمعت النبي - صلى الله عليه وسلم - يقول : يؤتى بالقرآن يوم القيامة وأهله الذين كانوا يعملون به تقدمه سورة البقرة وآل عمران ، وضرب لهما رسول الله - صلى الله عليه وسلم - ثلاثة أمثال ما نسيتهن بعد ، قال : كأنهما غمامتان أو ظلتان سوداوان بينهما شرق ، أو كأنهما حزقان من طير صواف تحاجان عن صاحبهما . وخرج أيضا عن أبي أمامة قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : اقرءوا القرآن فإنه يأتي يوم القيامة شفيعا لأصحابه اقرءوا الزهراوين البقرة وسورة آل عمران فإنهما يأتيان يوم القيامة كأنهما غمامتان أو كأنهما غيايتان أو كأنهما فرقان من طير صواف تحاجان عن أصحابهما اقرءوا سورة البقرة فإن أخذها بركة وتركها حسرة ولا يستطيعها البطلة . قال معاوية : وبلغني أن البطلة السحرة .\n( الرابعة ) : للعلماء في تسمية ( البقرة وآل عمران ) بالزهراوين ثلاثة أقوال :\nالأول : إنهما النيرتان ، مأخوذ من الزهر والزهرة ; فإما لهدايتهما قارئهما بما يزهر له من أنوارهما ، أي من معانيهما ، وإما لما يترتب على قراءتهما من النور التام يوم القيامة ، وهو القول الثاني .\nالثالث : سميتا بذلك لأنهما اشتركتا فيما تضمنه اسم الله الأعظم ، كما ذكره أبو داود وغيره عن أسماء بنت يزيد أن رسول الله - صلى الله عليه وسلم - قال : إن اسم الله الأعظم في هاتين الآيتين وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم والتي في آل عمران الله لا إله إلا هو الحي القيوم أخرجه ابن ماجه أيضا . والغمام : السحاب الملتف ، وهو الغياية إذا كانت قريبا من الرأس ، وهي الظلة أيضا . والمعنى : إن قارئهما في ظل ثوابهما ، كما جاء ( الرجل في ظل صدقته ) . وقوله : ( تحاجان ) أي يخلق الله من يجادل عنه بثوابهما ملائكة كما جاء في بعض الحديث : ( إن من قرأ شهد الله أنه لا إله إلا هو . . . ) الآية ، خلق الله سبعين ملكا يستغفرون له إلى يوم القيامة . وقوله : ( بينهما شرق ) قيد بسكون الراء وفتحها وهو تنبيه على الضياء ; لأنه لما قال : ( سوداوان ) قد يتوهم أنهما مظلمتان ، فنفى ذلك بقوله : ( بينهما شرق ) . ويعني بكونهما سوداوان أي من كثافتهما التي بسببها حالتا بين من تحتهما وبين حرارة الشمس وشدة اللهب ، والله أعلم .\n( الخامسة ) : صدر هذه السورة نزل بسبب وفد نجران فيما ذكر محمد بن إسحاق عن محمد بن جعفر بن الزبير ، وكانوا نصارى وفدوا على رسول الله - صلى الله عليه وسلم - بالمدينة في ستين راكبا ، فيهم من أشرافهم أربعة عشر رجلا ، في الأربعة عشر ثلاثة نفر إليهم يرجع أمرهم : العاقب أمير القوم وذو آرائهم واسمه عبد المسيح ، والسيد ثمالهم وصاحب مجتمعهم واسمه الأيهم ، وأبو حارثة بن علقمة أحد بكر بن وائل أسقفهم وعالمهم ، فدخلوا على رسول الله - صلى الله عليه وسلم - إثر صلاة العصر ، عليهم ثياب الحبرات جبب وأردية ، فقال أصحاب النبي - صلى الله عليه وسلم - : ما رأينا وفدا مثلهم جمالا وجلالة . وحانت صلاتهم فقاموا فصلوا في مسجد النبي - صلى الله عليه وسلم - إلى المشرق . فقال النبي - صلى الله عليه وسلم - : ( دعوهم ) . ثم أقاموا بها أياما يناظرون رسول الله - صلى الله عليه وسلم - في عيسى ويزعمون أنه ابن الله ، إلى غير ذلك من أقوال شنيعة مضطربة ، ورسول الله - صلى الله عليه وسلم - يرد عليهم بالبراهين الساطعة وهم لا يبصرون ، ونزل فيهم صدر هذه السورة إلى نيف وثمانين آية ، إلى أن آل أمرهم إلى أن دعاهم رسول الله - صلى الله عليه وسلم - إلى المباهلة ، حسب ما هو مذكور في سيرة ابن إسحاق وغيره .\n                                    ",
        "saadi": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُ ٢\n                                        \n                                        \n                                        \n                                        افتتحها تبارك وتعالى بالإخبار بألوهيته، وأنه الإله الذي لا إله إلا هو الذي لا ينبغي التأله والتعبد إلا لوجهه، فكل معبود سواه فهو باطل، والله هو الإله الحق المتصف بصفات الألوهية التي مرجعها إلى الحياة والقيومية، فالحي من له الحياة العظيمة الكاملة المستلزمة لجميع الصفات التي لا تتم ولا تكمل الحياة إلا بها كالسمع والبصر والقدرة والقوة والعظمة والبقاء والدوام والعز الذي لا يرام { القيوم } الذي قام بنفسه فاستغنى عن جميع مخلوقاته، وقام بغيره فافتقرت إليه جميع مخلوقاته في الإيجاد والإعداد والإمداد، فهو الذي قام بتدبير الخلائق وتصريفهم، تدبير للأجسام وللقلوب والأرواح.\n                                    "
      },
      "originalText": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُ ٢"
    },
    {
      "number": 296,
      "text": "نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ وَأَنْزَلَ التَّوْرَاةَ وَالْإِنْجِيلَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 3,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "نَزَّلَ عَلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ وَأَنزَلَ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ ٣\n                                    \n                                    \n                                    وقوله تعالى ( نزل عليك الكتاب بالحق ) يعني : نزل عليك القرآن يا محمد ) بالحق ) أي : لا شك فيه ولا ريب ، بل هو منزل من عند الله [ عز وجل ] أنزله بعلمه والملائكة يشهدون ، وكفى بالله شهيدا .\nوقوله : ( مصدقا لما بين يديه ) أي : من الكتب المنزلة قبله من السماء على عباد الله الأنبياء ، فهي تصدقه بما أخبرت به وبشرت في قديم الزمان ، وهو يصدقها ، لأنه طابق ما أخبرت به وبشرت ، من الوعد من الله بإرسال محمد صلى الله عليه وسلم ، وإنزال القرآن العظيم عليه .\nوقوله : ( وأنزل التوراة ) أي : على موسى بن عمران [ عليه السلام ] ) والإنجيل ) أي : على عيسى ابن مريم .\n                                    ",
        "qortoby": "نَزَّلَ عَلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ وَأَنزَلَ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ ٣\n                                    \n                                    \n                                    قوله تعالى : نزل عليك الكتاب يعني القرآن بالحق أي بالصدق ، وقيل : بالحجة البالغة . والقرآن نزل نجوما : شيئا بعد شيء ، فلذلك قال ( نزل ) والتنزيل مرة بعد مرة . والتوراة والإنجيل نزلا دفعة واحدة فلذلك قال أنزل ، والباء في قوله ( بالحق ) في موضع الحال من الكتاب ، والباء متعلقة بمحذوف ، التقدير : آتيا بالحق ولا تتعلق ب نزل لأنه قد تعدى إلى مفعولين أحدهما بحرف جر ، ولا يتعدى إلى ثالث .\nومصدقا حال مؤكدة غير منتقلة ; لأنه لا يمكن أن يكون غير مصدق ، أي غير موافق ; هذا قول الجمهور . وقدر فيه بعضهم الانتقال على معنى أنه مصدق لنفسه ومصدق لغيره .\nقوله تعالى : لما بين يديه يعني من الكتب المنزلة . والتوراة معناها الضياء والنور مشتقة من : ورى الزند ووري لغتان إذا خرجت ناره وأصلها تورية على وزن تفعلة ، التاء زائدة وتحركت الياء وقبلها فتحة فقلبت ألفا ، ويجوز أن تكون تفعلة فتنقل الراء من الكسر إلى الفتح كما قالوا في جارية جاراة وفي ناصية ناصاة كلاهما عن الفراء . وقال الخليل : أصلها فوعلة فالأصل وورية قلبت الواو الأولى تاء كما قلبت في تولج والأصل وولج فوعل من : ولجت ، وقلبت الياء ألفا لحركتها وانفتاح ما قبلها ، وبناء فوعلة أكثر من تفعلة . وقيل : التوراة مأخوذة من التورية ، وهي التعريض بالشيء والكتمان لغيره ، فكأن أكثر التوراة معاريض وتلويحات من غير تصريح وإيضاح ، هذا قول المؤرج . والجمهور على القول الأول لقوله تعالى : ولقد آتينا موسى وهارون الفرقان وضياء وذكرا للمتقين يعني التوراة . والإنجيل إفعيل من النجل وهو الأصل ، ويجمع على أناجيل وتوراة على توار . فالإنجيل أصل لعلوم وحكم . ويقال : لعن الله ناجليه ، يعني والديه ، إذ كانا أصله . وقيل : هو من نجلت الشيء إذا استخرجته ; فالإنجيل مستخرج به علوم وحكم ، ومنه سمي الولد والنسل نجلا لخروجه ، كما قال :\nإلى معشر لم يورث اللؤم جدهم أصاغرهم وكل فحل لهم نجل\nوالنجل الماء الذي يخرج من النز . واستنجلت الأرض ، وبها نجال إذا خرج منها الماء ، فسمي الإنجيل به ; لأن الله تعالى أخرج به دارسا من الحق عافيا . وقيل : هو من النجل في العين ( بالتحريك ) وهو سعتها ، وطعنة نجلاء أي واسعة ، قال :\nربما ضربة بسيف صقيل بين بصرى وطعنة نجلاء\nفسمي الإنجيل بذلك ; لأنه أصل أخرجه لهم ووسعه عليهم ونورا وضياء . وقيل : التناجل التنازع ، وسمي إنجيلا لتنازع الناس فيه . وحكى شمر عن بعضهم : الإنجيل كل كتاب مكتوب وافر السطور . وقيل : نجل عمل وصنع ، قال :\nوأنجل في ذاك الصنيع كما نجل\nأي اعمل واصنع . وقيل : التوراة والإنجيل من اللغة السريانية . وقيل : الإنجيل بالسريانية إنكليون ، حكاه الثعلبي . قال الجوهري : الإنجيل كتاب عيسى - عليه السلام - يذكر ويؤنث ، فمن أنث أراد الصحيفة ، ومن ذكر أراد الكتاب . قال غيره : وقد يسمى القرآن إنجيلا أيضا ، كما روي في قصة مناجاة موسى - عليه السلام - أنه قال : ( يا رب أرى في الألواح أقواما أناجيلهم في صدورهم فاجعلهم أمتي ) ، فقال الله تعالى له : ( تلك أمة أحمد ) - صلى الله عليه وسلم - وإنما أراد بالأناجيل القرآن . وقرأ الحسن : ( والأنجيل ) بفتح الهمزة ، والباقون بالكسر مثل الإكليل ، لغتان . ويحتمل - إن سمع - أن يكون مما عربته العرب من الأسماء الأعجمية ، ولا مثال له في كلامها .\n                                    ",
        "saadi": "نَزَّلَ عَلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ وَأَنزَلَ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ ٣\n                                        \n                                        \n                                        \n                                        ومن قيامه تعالى بعباده ورحمته بهم أن نزل على رسوله محمد صلى الله عليه وسلم الكتاب، الذي هو أجل الكتب وأعظمها المشتمل على الحق في إخباره وأوامره ونواهيه، فما أخبر به صدق، وما حكم به فهو العدل، وأنزله بالحق ليقوم الخلق بعبادة ربهم ويتعلموا كتابه { مصدقا لما بين يديه } من الكتب السابقة، فهو المزكي لها، فما شهد له فهو المقبول، وما رده فهو المردود، وهو المطابق لها في جميع المطالب التي اتفق عليها المرسلون، وهي شاهدة له بالصدق، فأهل الكتاب لا يمكنهم التصديق بكتبهم إن لم يؤمنوا به، فإن كفرهم به ينقض إيمانهم بكتبهم، ثم قال تعالى { وأنزل التوراة } أي: على موسى { والإنجيل } على عيسى.\n                                    "
      },
      "originalText": "نَزَّلَ عَلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ وَأَنزَلَ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ ٣"
    },
    {
      "number": 297,
      "text": "مِنْ قَبْلُ هُدًى لِلنَّاسِ وَأَنْزَلَ الْفُرْقَانَ ۗ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ ۗ وَاللَّهُ عَزِيزٌ ذُو انْتِقَامٍ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 4,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مِن قَبۡلُ هُدٗى لِّلنَّاسِ وَأَنزَلَ ٱلۡفُرۡقَانَۗ إِنَّ ٱلَّذِينَ كَفَرُواْ بِ‍َٔايَٰتِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدٞۗ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ ٤\n                                    \n                                    \n                                    ( من قبل ) أي : من قبل هذا القرآن . ) هدى للناس ) أي : في زمانهما ( وأنزل الفرقان ) وهو الفارق بين الهدى والضلال ، والحق والباطل ، والغي والرشاد ، بما يذكره الله تعالى من الحجج والبينات ، والدلائل الواضحات ، والبراهين القاطعات ، ويبينه ويوضحه ويفسره ويقرره ، ويرشد إليه وينبه عليه من ذلك .\nوقال قتادة والربيع بن أنس : الفرقان هاهنا القرآن . واختار ابن جرير أنه مصدر هاهنا ، لتقدم ذكر القرآن في قوله : ( نزل عليك الكتاب بالحق مصدقا لما بين يديه ) وهو القرآن . وأما ما رواه ابن أبي حاتم عن أبي صالح أن المراد هاهنا بالفرقان : التوراة فضعيف أيضا ، لتقدم ذكرها ، والله أعلم\nوقوله تعالى : ( إن الذين كفروا بآيات الله ) أي : جحدوا بها وأنكروها ، وردوها بالباطل ( لهم عذاب شديد ) أي : يوم القيامة ) والله عزيز ) أي : منيع الجناب عظيم السلطان ) ذو انتقام ) أي : ممن كذب بآياته وخالف رسله الكرام ، وأنبياءه العظام .\n                                    ",
        "qortoby": "مِن قَبۡلُ هُدٗى لِّلنَّاسِ وَأَنزَلَ ٱلۡفُرۡقَانَۗ إِنَّ ٱلَّذِينَ كَفَرُواْ بِ‍َٔايَٰتِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدٞۗ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ ٤\n                                    \n                                    \n                                    قوله تعالى : من قبل يعني القرآن هدى للناس قال ابن فورك : التقدير هدى للناس المتقين ، دليله في البقرة هدى للمتقين فرد هذا العام إلى ذلك الخاص . و ( هدى ) في موضع نصب على الحال . و الفرقان القرآن وقد تقدم .\nإِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ وَاللَّهُ عَزِيزٌ ذُو انْتِقَامٍ\n                                    ",
        "saadi": "مِن قَبۡلُ هُدٗى لِّلنَّاسِ وَأَنزَلَ ٱلۡفُرۡقَانَۗ إِنَّ ٱلَّذِينَ كَفَرُواْ بِ‍َٔايَٰتِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدٞۗ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ ٤\n                                        \n                                        \n                                        \n                                        { من قبل } إنزال القرآن { هدى للناس } الظاهر أن هذا راجع لكل ما تقدم، أي: أنزل الله القرآن والتوراة والإنجيل هدى للناس من الضلال، فمن قبل هدى الله فهو المهتدي، ومن لم يقبل ذلك بقي على ضلاله { وأنزل الفرقان } أي: الحجج والبينات والبراهين القاطعات الدالة على جميع المقاصد والمطالب، وكذلك فصل وفسر ما يحتاج إليه الخلق حتى بقيت الأحكام جلية ظاهرة، فلم يبق لأحد عذر ولا حجة لمن لم يؤمن به وبآياته، فلهذا قال { إن الذين كفروا بآيات الله } أي: بعد ما بينها ووضحها وأزاح العلل { لهم عذاب شديد } لا يقدر قدره ولا يدرك وصفه { والله عزيز } أي: قوي لا يعجزه شيء { ذو انتقام } ممن عصاه.\n                                    "
      },
      "originalText": "مِن قَبۡلُ هُدٗى لِّلنَّاسِ وَأَنزَلَ ٱلۡفُرۡقَانَۗ إِنَّ ٱلَّذِينَ كَفَرُواْ بِ‍َٔايَٰتِ ٱللَّهِ لَهُمۡ عَذَابٞ شَدِيدٞۗ وَٱللَّهُ عَزِيزٞ ذُو ٱنتِقَامٍ ٤"
    },
    {
      "number": 298,
      "text": "إِنَّ اللَّهَ لَا يَخْفَىٰ عَلَيْهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 5,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱللَّهَ لَا يَخۡفَىٰ عَلَيۡهِ شَيۡءٞ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ ٥\n                                    \n                                    \n                                    يخبر تعالى أنه يعلم غيب السماوات والأرض ، [ و ] لا يخفى عليه شيء من ذلك .\n                                    ",
        "qortoby": "إِنَّ ٱللَّهَ لَا يَخۡفَىٰ عَلَيۡهِ شَيۡءٞ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ ٥\n                                    \n                                    \n                                    قوله تعالى : إن الله لا يخفى عليه شيء في الأرض ولا في السماء هذا خبر عن علمه تعالى بالأشياء على التفصيل ، ومثله في القرآن كثير . فهو العالم بما كان وما يكون وما لا يكون ، فكيف يكون عيسى إلها أو ابن إله وهو تخفى عليه الأشياء .\n                                    ",
        "saadi": "إِنَّ ٱللَّهَ لَا يَخۡفَىٰ عَلَيۡهِ شَيۡءٞ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ ٥\n                                        \n                                        \n                                        \n                                        { إن الله لا يخفى عليه شيء في الأرض ولا في السماء } وهذا فيه تقرير إحاطة علمه بالمعلومات كلها، جليها وخفيها، ظاهرها وباطنها، ومن جملة ذلك الأجنة في البطون التي لا يدركها بصر المخلوقين، ولا ينالها علمهم، وهو تعالى يدبرها بألطف تدبير، ويقدرها بكل تقدير، فلهذا قال { هو الذي يصوركم في الأرحام كيف يشاء }\n                                    "
      },
      "originalText": "إِنَّ ٱللَّهَ لَا يَخۡفَىٰ عَلَيۡهِ شَيۡءٞ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ ٥"
    },
    {
      "number": 299,
      "text": "هُوَ الَّذِي يُصَوِّرُكُمْ فِي الْأَرْحَامِ كَيْفَ يَشَاءُ ۚ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 6,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱلَّذِي يُصَوِّرُكُمۡ فِي ٱلۡأَرۡحَامِ كَيۡفَ يَشَآءُۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٦\n                                    \n                                    \n                                    ( هو الذي يصوركم في الأرحام كيف يشاء ) أي : يخلقكم كما يشاء في الأرحام من ذكر وأنثى ، [ و ] حسن وقبيح ، وشقي وسعيد ( لا إله إلا هو العزيز الحكيم ) أي : هو الذي خلق ، وهو المستحق للإلهية وحده لا شريك له ، وله العزة التي لا ترام ، والحكمة والأحكام .\nوهذه الآية فيها تعريض بل تصريح بأن عيسى ابن مريم عبد مخلوق ، كما خلق الله سائر البشر ، لأن الله [ تعالى ] صوره في الرحم وخلقه كما يشاء ، فكيف يكون إلها كما زعمته النصارى - عليهم لعائن الله - وقد تقلب في الأحشاء ، وتنقل من حال إلى حال ، كما قال تعالى : ( يخلقكم في بطون أمهاتكم خلقا من بعد خلق في ظلمات ثلاث ذلكم الله ربكم له الملك لا إله إلا هو فأنى تصرفون ) [ الزمر : 6 ]\n                                    ",
        "qortoby": "هُوَ ٱلَّذِي يُصَوِّرُكُمۡ فِي ٱلۡأَرۡحَامِ كَيۡفَ يَشَآءُۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٦\n                                    \n                                    \n                                    قوله تعالى : هو الذي يصوركم في الأرحام كيف يشاء لا إله إلا هو العزيز الحكيم فيه مسألتان :\nالأولى : قوله تعالى : هو الذي يصوركم أخبر تعالى عن تصويره للبشر في أرحام الأمهات ، وأصل الرحم من الرحمة ؛ لأنها مما يتراحم به . واشتقاق الصورة من صاره إلى كذا إذا أماله ، فالصورة مائلة إلى شبه وهيئة . وهذه الآية تعظيم لله تعالى ، وفي ضمنها الرد على نصارى نجران ، وأن عيسى من المصورين ، وذلك مما لا ينكره عاقل . وأشار تعالى إلى شرح التصوير في سورة ( الحج ) و ( المؤمنون ) . وكذلك شرحه النبي - صلى الله عليه وسلم - في حديث ابن مسعود ، على ما يأتي هناك بيانه إن شاء الله تعالى . وفيها الرد على الطبائعيين أيضا إذ يجعلونها فاعلة مستبدة ، وقد مضى الرد عليهم في آية التوحيد . وفي مسند ابن سنجر - واسمه محمد بن سنجر - حديث : ( إن الله تعالى يخلق عظام الجنين وغضاريفه من مني الرجل وشحمه ولحمه من مني المرأة ) . وفي هذا أدل دليل على أن الولد يكون من ماء الرجل والمرأة ، وهو صريح في قوله تعالى : يا أيها الناس إنا خلقناكم من ذكر وأنثى . وفي صحيح مسلم من حديث ثوبان وفيه أن اليهودي قال للنبي - صلى الله عليه وسلم - : وجئت أسألك عن شيء لا يعلمه أحد من أهل الأرض إلا نبي أو رجل أو رجلان ، قال : ( ينفعك إن حدثتك ) ؟ قال : أسمع بأذني ، قال : جئتك أسألك عن الولد . فقال النبي - صلى الله عليه وسلم - : ( ماء الرجل أبيض وماء المرأة أصفر فإذا اجتمعا فعلا مني الرجل مني المرأة أذكرا بإذن الله تعالى ، وإذا علا مني المرأة مني الرجل آنثا بإذن الله . . . ) الحديث . وسيأتي بيانه آخر ( الشورى ) إن شاء الله تعالى .\nالثانية : قوله تعالى : كيف يشاء يعني من حسن وقبح وسواد وبياض وطول وقصر وسلامة وعاهة ، إلى غير ذلك من الشقاء والسعادة . وذكر عن إبراهيم بن أدهم أن القراء اجتمعوا إليه ليسمعوا ما عنده من الأحاديث ، فقال لهم : إني مشغول عنكم بأربعة أشياء ، فلا أتفرغ لرواية الحديث . فقيل له : وما ذاك الشغل ؟ قال : أحدها إني أتفكر في يوم الميثاق حيث قال : ( هؤلاء في الجنة ولا أبالي وهؤلاء في النار ولا أبالي ) فلا أدري من أي الفريقين كنت في ذلك الوقت ، والثاني حيث صورت في الرحم فقال الملك الذي هو موكل على الأرحام : ( يا رب شقي هو أم سعيد ) فلا أدري كيف كان الجواب في ذلك الوقت ، والثالث حين يقبض ملك الموت روحي فيقول : ( يا رب مع الكفر أم مع الإيمان ) فلا أدري كيف يخرج الجواب ، والرابع حيث يقول : وامتازوا اليوم أيها المجرمون فلا أدري في أي الفريقين أكون .\nثم قال تعالى : لا إله إلا هو أي لا خالق ولا مصور سواه ، وذلك دليل على وحدانيته ، فكيف يكون عيسى إلها مصورا وهو مصور . العزيز الذي لا يغالب . الحكيم ذو الحكمة أو المحكم ، وهذا أخص بما ذكر من التصوير .\n                                    ",
        "saadi": "هُوَ ٱلَّذِي يُصَوِّرُكُمۡ فِي ٱلۡأَرۡحَامِ كَيۡفَ يَشَآءُۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٦\n                                        \n                                        \n                                        \n                                        { هو الذي يصوركم في الأرحام كيف يشاء } من كامل الخلق وناقصه، وحسن وقبيح، وذكر وأنثى { لا إله إلا هو العزيز الحكيم } تضمنت هذه الآيات تقرير إلهية الله وتعينها، وإبطال إلهية ما سواه، وفي ضمن ذلك رد على النصارى الذين يزعمون إلهية عيسى ابن مريم عليه السلام، وتضمنت إثبات حياته الكاملة وقيوميته التامة، المتضمنتين جميع الصفات المقدسة كما تقدم، وإثبات الشرائع الكبار، وأنها رحمة وهداية للناس، وتقسيم الناس إلى مهتد وغيره، وعقوبة من لم يهتد بها، وتقرير سعة علم الباري ونفوذ مشيئته وحكمته.\n                                    "
      },
      "originalText": "هُوَ ٱلَّذِي يُصَوِّرُكُمۡ فِي ٱلۡأَرۡحَامِ كَيۡفَ يَشَآءُۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٦"
    },
    {
      "number": 300,
      "text": "هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُحْكَمَاتٌ هُنَّ أُمُّ الْكِتَابِ وَأُخَرُ مُتَشَابِهَاتٌ ۖ فَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ ابْتِغَاءَ الْفِتْنَةِ وَابْتِغَاءَ تَأْوِيلِهِ ۗ وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ ۗ وَالرَّاسِخُونَ فِي الْعِلْمِ يَقُولُونَ آمَنَّا بِهِ كُلٌّ مِنْ عِنْدِ رَبِّنَا ۗ وَمَا يَذَّكَّرُ إِلَّا أُولُو الْأَلْبَابِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 7,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱلَّذِيٓ أَنزَلَ عَلَيۡكَ ٱلۡكِتَٰبَ مِنۡهُ ءَايَٰتٞ مُّحۡكَمَٰتٌ هُنَّ أُمُّ ٱلۡكِتَٰبِ وَأُخَرُ مُتَشَٰبِهَٰتٞۖ فَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِمۡ زَيۡغٞ فَيَتَّبِعُونَ مَا تَشَٰبَهَ مِنۡهُ ٱبۡتِغَآءَ ٱلۡفِتۡنَةِ وَٱبۡتِغَآءَ تَأۡوِيلِهِۦۖ وَمَا يَعۡلَمُ تَأۡوِيلَهُۥٓ إِلَّا ٱللَّهُۗ وَٱلرَّٰسِخُونَ فِي ٱلۡعِلۡمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلّٞ مِّنۡ عِندِ رَبِّنَاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ ٧\n                                    \n                                    \n                                    خبر تعالى أن في القرآن آيات محكمات هن أم الكتاب ، أي : بينات واضحات الدلالة ، لا التباس فيها على أحد من الناس ، ومنه آيات أخر فيها اشتباه في الدلالة على كثير من الناس أو بعضهم ، فمن رد ما اشتبه عليه إلى الواضح منه ، وحكم محكمه على متشابهه عنده ، فقد اهتدى . ومن عكس انعكس ، ولهذا قال تعالى : ( هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب ) أي : أصله الذي يرجع إليه عند الاشتباه ( وأخر متشابهات ) أي : تحتمل دلالتها موافقة المحكم ، وقد تحتمل شيئا آخر من حيث اللفظ والتركيب ، لا من حيث المراد .\nوقد اختلفوا في المحكم والمتشابه ، فروي عن السلف عبارات كثيرة ، فقال علي بن أبي طلحة ، عن ابن عباس [ أنه قال ] المحكمات ناسخه ، وحلاله وحرامه ، وحدوده وفرائضه ، وما يؤمر به ويعمل به .\nوكذا روي عن عكرمة ، ومجاهد ، وقتادة ، والضحاك ، ومقاتل بن حيان ، والربيع بن أنس ، والسدي أنهم قالوا : المحكم الذي يعمل به .\nوعن ابن عباس أيضا أنه قال : المحكمات [ في ] قوله تعالى : ( قل تعالوا أتل ما حرم ربكم عليكم ألا تشركوا به شيئا ) [ الأنعام : 151 ] والآيتان بعدها ، وقوله تعالى : ( وقضى ربك ألا تعبدوا إلا إياه ) [ الإسراء : 23 ] إلى ثلاث آيات بعدها . رواه ابن أبي حاتم ، وحكاه عن سعيد بن جبير [ ثم ] قال : حدثنا أبي ، حدثنا سليمان بن حرب ، حدثنا حماد بن زيد ، عن إسحاق بن سويد أن يحيى بن يعمر وأبا فاختة تراجعا في هذه الآية : ( هن أم الكتاب ) فقال أبو فاختة : فواتح السور . وقال يحيى بن يعمر : الفرائض ، والأمر والنهي ، والحلال والحرام .\nوقال ابن لهيعة ، عن عطاء بن دينار ، عن سعيد بن جبير : ( هن أم الكتاب ) يقول : أصل الكتاب ، وإنما سماهن أم الكتاب ، لأنهن مكتوبات في جميع الكتب .\nوقال مقاتل بن حيان : لأنه ليس من أهل دين إلا يرضى بهن .\nوقيل في المتشابهات : إنهن المنسوخة ، والمقدم منه والمؤخر ، والأمثال فيه والأقسام ، وما يؤمن به ولا يعمل به . رواه علي بن أبي طلحة عن ابن عباس .\nوقيل : هي الحروف المقطعة في أوائل السور ، قاله مقاتل بن حيان .\nوعن مجاهد : المتشابهات يصدق بعضهن بعضا . وهذا إنما هو في تفسير قوله : ( كتابا متشابها مثاني ) [ الزمر : 23 ] هناك ذكروا : أن المتشابه هو الكلام الذي يكون في سياق واحد ، والمثاني هو الكلام في شيئين متقابلين كصفة الجنة وصفة النار ، وذكر حال الأبرار ثم حال الفجار ، ونحو ذلك ، فأما هاهنا فالمتشابه هو الذي يقابل المحكم .\nوأحسن ما قيل فيه الذي قدمناه ، وهو الذي نص عليه محمد بن إسحاق بن يسار ، رحمه الله ، حيث قال : ( منه آيات محكمات هن أم الكتاب ) فيهن حجة الرب ، وعصمة العباد ، ودفع الخصوم والباطل ، ليس لهن تصريف ولا تحريف عما وضعن عليه .\nقال : والمتشابهات في الصدق ، لهن تصريف وتحريف وتأويل ، ابتلى الله فيهن العباد ، كما ابتلاهم في الحلال والحرام ألا يصرفن إلى الباطل ، ولا يحرفن عن الحق .\nولهذا قال تعالى : ( فأما الذين في قلوبهم زيغ ) أي : ضلال وخروج عن الحق إلى الباطل ( فيتبعون ما تشابه منه ) أي : إنما يأخذون منه بالمتشابه الذي يمكنهم أن يحرفوه إلى مقاصدهم الفاسدة ، وينزلوه عليها ، لاحتمال لفظه لما يصرفونه ، فأما المحكم فلا نصيب لهم فيه ، لأنه دامغ لهم وحجة عليهم ، ولهذا قال : ( ابتغاء الفتنة ) أي : الإضلال لأتباعهم ، إيهاما لهم أنهم يحتجون على بدعتهم بالقرآن ، وهذا حجة عليهم لا لهم ، كما لو احتج النصارى بأن القرآن قد نطق بأن عيسى هو روح الله وكلمته ألقاها إلى مريم ، وتركوا الاحتجاج بقوله [ تعالى ] ( إن هو إلا عبد أنعمنا عليه ) [ الزخرف : 59 ] وبقوله : ( إن مثل عيسى عند الله كمثل آدم خلقه من تراب ثم قال له كن فيكون ) [ آل عمران : 59 ] وغير ذلك من الآيات المحكمة المصرحة بأنه خلق من مخلوقات الله ، وعبد ورسول من رسل الله .\nوقوله : ( وابتغاء تأويله ) أي : تحريفه على ما يريدون ، وقال مقاتل والسدي : يبتغون أن يعلموا ما يكون وما عواقب الأشياء من القرآن .\nوقد قال الإمام أحمد : حدثنا إسماعيل ، حدثنا أيوب عن عبد الله بن أبي مليكة ، عن عائشة قالت : قرأ رسول الله صلى الله عليه وسلم : ( هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات [ فأما الذين في قلوبهم زيغ ] ) إلى قوله : ( أولو الألباب ) فقال : \" فإذا رأيتم الذين يجادلون فيه فهم الذين عنى الله فاحذروهم .\nهكذا وقع هذا الحديث في مسند الإمام أحمد ، رحمه الله ، من رواية ابن أبي مليكة ، عن عائشة ، ليس بينهما أحد .\nوهكذا رواه ابن ماجه من طريق إسماعيل ابن علية وعبد الوهاب الثقفي ، كلاهما عن أيوب ، عن عبد الله بن عبيد الله بن أبي مليكة ، عنها .\nورواه محمد بن يحيى العبدي في مسنده عن عبد الوهاب الثقفي ، عن أيوب ، به . وكذا رواه عبد الرزاق ، عن معمر عن أيوب . وكذا رواه غير واحد عن أيوب . وقد رواه ابن حبان في صحيحه ، من حديث أيوب ، به .\nوتابع أيوب أبو عامر الخزاز وغيره عن ابن أبي مليكة ، فرواه الترمذي عن بندار ، عن أبي داود الطيالسي ، عن أبي عامر الخزاز ، فذكره . وهكذا رواه سعيد بن منصور في سننه ، عن حماد بن يحيى الأبح ، عن عبد الله بن أبي مليكة ، عن عائشة . ورواه ابن جرير ، من حديث روح بن القاسم ونافع بن عمر الجمحي ، كلاهما عن ابن أبي مليكة ، عن عائشة ، به . وقال نافع في روايته عن ابن أبي مليكة : حدثتني عائشة ، فذكره .\nوقد روى هذا الحديث البخاري ، رحمه الله ، عند تفسير هذه الآية ، ومسلم في كتاب القدر من صحيحه ، وأبو داود في السنة من سننه ، ثلاثتهم ، عن القعنبي ، عن يزيد بن إبراهيم التستري ، عن ابن أبي مليكة ، عن القاسم بن محمد ، عن عائشة ، رضي الله عنها ، قالت : تلا رسول الله صلى الله عليه وسلم : ( هو الذي أنزل عليك الكتاب منه آيات محكمات [ هن أم الكتاب وأخر متشابهات ] ) إلى قوله : ( وما يذكر إلا أولو الألباب ) قالت : قال رسول الله صلى الله عليه وسلم : \" فإذا رأيت الذين يتبعون ما تشابه منه فأولئك الذين سمى الله فاحذروهم \" لفظ البخاري .\nوكذا رواه الترمذي أيضا ، عن بندار ، عن أبي داود الطيالسي ، عن يزيد بن إبراهيم التستري ، به . وقال : حسن صحيح . وذكر أن يزيد بن إبراهيم التستري تفرد بذكر القاسم في هذا الإسناد ، وقد رواه غير واحد عن ابن أبي مليكة ، عن عائشة ، ولم يذكروا القاسم . كذا قال .\nورواه ابن المنذر في تفسيره من طريقين عن النعمان بن محمد بن الفضل السدوسي - ولقبه عارم - حدثنا حماد بن زيد ، حدثنا أيوب ، عن ابن أبي مليكة ، عن عائشة ، به .\nوقد رواه ابن أبي حاتم فقال : حدثنا أبي ، حدثنا أبو الوليد الطيالسي ، حدثنا يزيد بن إبراهيم التستري وحماد بن سلمة ، عن ابن أبي مليكة ، عن القاسم بن محمد ، عن عائشة قالت : سئل رسول الله صلى الله عليه وسلم عن قول الله عز وجل : ( فأما الذين في قلوبهم زيغ فيتبعون ما تشابه منه ) فقال رسول الله صلى الله عليه وسلم : \" إذا رأيتم الذين يتبعون ما تشابه منه فأولئك الذين سمى الله ، فاحذروهم \" .\nوقال ابن جرير : حدثنا علي بن سهل حدثنا الوليد بن مسلم ، عن حماد بن سلمة ، عن عبد الرحمن بن القاسم ، عن أبيه ، عن عائشة قالت : نزع رسول الله صلى الله عليه وسلم بهذه الآية : ( فيتبعون ما تشابه منه ابتغاء الفتنة ) فقال رسول الله صلى الله عليه وسلم : \" قد حذركم الله ، فإذا رأيتموهم فاعرفوهم \" . ورواه ابن مردويه من طريق أخرى ، عن القاسم ، عن عائشة به .\nوقال الإمام أحمد : حدثنا أبو كامل ، حدثنا حماد ، عن أبي غالب قال : سمعت أبا أمامة يحدث ، عن النبي صلى الله عليه وسلم في قوله : ( فأما الذين في قلوبهم زيغ فيتبعون ما تشابه منه ) قال : \" هم الخوارج \" ، وفي قوله : ( يوم تبيض وجوه وتسود وجوه ) . [ آل عمران : 106 ] قال : \" هم الخوارج \" .\nوقد رواه ابن مردويه من غير وجه ، عن أبي غالب ، عن أبي أمامة مرفوعا ، فذكره .\nوهذا الحديث أقل أقسامه أن يكون موقوفا من كلام الصحابي ، ومعناه صحيح ، فإن أول بدعة وقعت في الإسلام فتنة الخوارج ، وكان مبدؤهم بسبب الدنيا حين قسم رسول الله صلى الله عليه وسلم غنائم حنين ، فكأنهم رأوا في عقولهم الفاسدة أنه لم يعدل في القسمة ، ففاجئوه بهذه المقالة ، فقال قائلهم - وهو ذو الخويصرة - بقر الله خاصرته - اعدل فإنك لم تعدل ، فقال له رسول الله صلى الله عليه وسلم : \" لقد خبت وخسرت إن لم أكن أعدل ، أيأمنني على أهل الأرض ولا تأمنوني \" . فلما قفا الرجل استأذن عمر بن الخطاب - وفي رواية : خالد بن الوليد - [ ولا بعد في الجمع ] - رسول الله في قتله ، فقال : \" دعه فإنه يخرج من ضئضئ هذا - أي : من جنسه - قوم يحقر أحدكم صلاته مع صلاتهم ، وصيامه مع صيامهم ، وقراءته مع قراءتهم ، يمرقون من الدين كما يمرق السهم من الرمية ، فأينما لقيتموهم فاقتلوهم ، فإن في قتلهم أجرا لمن قتلهم .\nثم كان ظهورهم أيام علي بن أبي طالب ، وقتلهم بالنهروان ، ثم تشعبت منهم شعوب وقبائل وآراء وأهواء ومقالات ونحل كثيرة منتشرة ، ثم نبعت القدرية ، ثم المعتزلة ، ثم الجهمية ، وغير ذلك من البدع التي أخبر عنها الصادق المصدوق في قوله : \" وستفترق هذه الأمة على ثلاث وسبعين فرقة ، كلها في النار إلا واحدة \" قالوا : [ من ] هم يا رسول الله ؟ قال : \" من كان على ما أنا عليه وأصحابي \" أخرجه الحاكم في مستدركه بهذه الزيادة .\nوقال الحافظ أبو يعلى : حدثنا أبو موسى ، حدثنا عمرو بن عاصم ، حدثنا المعتمر ، عن أبيه ، عن قتادة ، عن الحسن عن جندب بن عبد الله أنه بلغه ، عن حذيفة - أو سمعه منه - يحدث عن رسول الله صلى الله عليه وسلم أنه ذكر : \" إن في أمتي قوما يقرءون القرآن ينثرونه نثر الدقل ، يتأولونه على غير تأويله \" . [ لم ] يخرجوه .\n[ وقوله ] ( وما يعلم تأويله إلا الله ) اختلف القراء في الوقف هاهنا ، فقيل : على الجلالة ، كما تقدم عن ابن عباس أنه قال : التفسير على أربعة أنحاء : فتفسير لا يعذر أحد في فهمه ، وتفسير تعرفه العرب من لغاتها ، وتفسير يعلمه الراسخون في العلم ، وتفسير لا يعلمه إلا الله عز وجل . ويروى هذا القول عن عائشة ، وعروة ، وأبي الشعثاء ، وأبي نهيك ، وغيرهم .\nوقد قال الحافظ أبو القاسم في المعجم الكبير : حدثنا هاشم بن مرثد حدثنا محمد بن إسماعيل بن عياش ، حدثني أبي ، حدثني ضمضم بن زرعة ، عن شريح بن عبيد ، عن أبي مالك الأشعري أنه سمع رسول الله صلى الله عليه وسلم يقول : \" لا أخاف على أمتي إلا ثلاث خلال : أن يكثر لهم المال فيتحاسدوا فيقتتلوا ، وأن يفتح لهم الكتاب فيأخذه المؤمن يبتغي تأويله ، ( وما يعلم تأويله إلا الله والراسخون في العلم يقولون آمنا به [ كل من عند ربنا وما يذكر إلا أولو الألباب ] ) الآية ، وأن يزداد علمهم فيضيعوه ولا يبالون عليه \" غريب جدا . وقال الحافظ أبو بكر بن مردويه : حدثنا محمد بن أحمد بن إبراهيم ، أخبرنا أحمد بن عمرو ، أخبرنا هشام بن عمار ، أخبرنا ابن أبي حاتم عن أبيه ، عن عمرو بن شعيب ، عن أبيه ، عن ابن العاص ، عن رسول الله صلى الله عليه وسلم قال : \" إن القرآن لم ينزل ليكذب بعضه بعضا ، فما عرفتم منه فاعملوا به ، وما تشابه منه فآمنوا به \" .\nوقال عبد الرزاق : أنبأنا معمر ، عن ابن طاوس ، عن أبيه قال : كان ابن عباس يقرأ : \" وما يعلم تأويله إلا الله ، ويقول الراسخون : آمنا به \" وكذا رواه ابن جرير ، عن عمر بن عبد العزيز ، ومالك بن أنس : أنهم يؤمنون به ولا يعلمون تأويله . وحكى ابن جرير أن في قراءة عبد الله بن مسعود : \" إن تأويله إلا عند الله والراسخون في العلم يقولون آمنا به \" . وكذا عن أبي بن كعب . واختار ابن جرير هذا القول .\nومنهم من يقف على قوله : ( والراسخون في العلم ) وتبعهم كثير من المفسرين وأهل الأصول ، وقالوا : الخطاب بما لا يفهم بعيد .\nوقد روى ابن أبي نجيح ، عن مجاهد ، عن ابن عباس أنه قال : أنا من الراسخين الذين يعلمون تأويله . وقال ابن أبي نجيح ، عن مجاهد : والراسخون في العلم يعلمون تأويله ويقولون آمنا به . وكذا قال الربيع بن أنس .\nوقال محمد بن إسحاق ، عن محمد بن جعفر بن الزبير : ( وما يعلم تأويله ) الذي أراد ما أراد ( إلا الله والراسخون في العلم يقولون آمنا به ) ثم ردوا تأويل المتشابه على ما عرفوا من تأويل المحكمة التي لا تأويل لأحد فيها إلا تأويل واحد ، فاتسق بقولهم الكتاب ، وصدق بعضه بعضا ، فنفذت الحجة ، وظهر به العذر ، وزاح به الباطل ، ودفع به الكفر .\nوفي الحديث أن رسول الله صلى الله عليه وسلم دعا لابن عباس فقال : \" اللهم فقهه في الدين وعلمه التأويل \" .\nومن العلماء من فصل في هذا المقام ، فقال : التأويل يطلق ويراد به في القرآن معنيان ، أحدهما : التأويل بمعنى حقيقة الشيء ، وما يئول أمره إليه ، ومنه قوله تعالى : ( ورفع أبويه على العرش وخروا له سجدا وقال يا أبت هذا تأويل رؤياي من قبل قد جعلها ربي حقا ) [ يوسف : 100 ] وقوله ( هل ينظرون إلا تأويله يوم يأتي تأويله ) [ الأعراف : 53 ] أي : حقيقة ما أخبروا به من أمر المعاد ، فإن أريد بالتأويل هذا ، فالوقف على الجلالة ، لأن حقائق الأمور وكنهها لا يعلمه على الجلية إلا الله عز وجل ، ويكون قوله : ( والراسخون في العلم ) مبتدأ و ( يقولون آمنا به ) خبره . وأما إن أريد بالتأويل المعنى الآخر وهو التفسير والتعبير والبيان عن الشيء كقوله تعالى : ( نبئنا بتأويله ) [ يوسف : 36 ] أي : بتفسيره ، فإن أريد به هذا المعنى ، فالوقف على : ( والراسخون في العلم ) لأنهم يعلمون ويفهمون ما خوطبوا به بهذا الاعتبار ، وإن لم يحيطوا علما بحقائق الأشياء على كنه ما هي عليه ، وعلى هذا فيكون قوله : ( يقولون آمنا به ) حالا منهم ، وساغ هذا ، وهو أن يكون من المعطوف دون المعطوف عليه ، كقوله : ( للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم ) إلى قوله : ( [ والذين جاءوا من بعدهم ] يقولون ربنا اغفر لنا ولإخواننا [ الذين سبقونا بالإيمان ] ) الآية [ الحشر : 8 - 10 ] ، وكقوله تعالى : ( وجاء ربك والملك صفا صفا ) [ الفجر : 22 ] أي : وجاءت الملائكة صفوفا صفوفا .\nوقوله إخبارا عنهم أنهم ( يقولون آمنا به ) أي : بالمتشابه ( كل من عند ربنا ) أي : الجميع من المحكم والمتشابه حق وصدق ، وكل واحد منهما يصدق الآخر ويشهد له ، لأن الجميع من عند الله وليس شيء من عند الله بمختلف ولا متضاد لقوله : ( أفلا يتدبرون القرآن ولو كان من عند غير الله لوجدوا فيه اختلافا كثيرا ) [ النساء : 82 ] ولهذا قال تعالى : ( وما يذكر إلا أولو الألباب ) أي : إنما يفهم ويعقل ويتدبر المعاني على وجهها أولو العقول السليمة والفهوم المستقيمة .\nوقد قال ابن أبي حاتم : حدثنا محمد بن عوف الحمصي ، حدثنا نعيم بن حماد ، حدثنا فياض الرقي ، حدثنا عبد الله بن يزيد - وكان قد أدرك أصحاب النبي صلى الله عليه وسلم : أنسا ، وأبا أمامة ، وأبا الدرداء ، رضي الله عنهم ، قال : حدثنا أبو الدرداء ، أن رسول الله صلى الله عليه وسلم سئل عن الراسخين في العلم ، فقال : \" من برت يمينه ، وصدق لسانه ، واستقام قلبه ، ومن أعف بطنه وفرجه ، فذلك من الراسخين في العلم \" .\nوقال الإمام أحمد : حدثنا عبد الرزاق ، حدثنا معمر ، عن الزهري ، عن عمرو بن شعيب عن أبيه ، عن جده قال : سمع رسول الله صلى الله عليه وسلم قوما يتدارءون فقال : \" إنما هلك من كان قبلكم بهذا ، ضربوا كتاب الله بعضه ببعض ، وإنما أنزل كتاب الله ليصدق بعضه بعضا ، فلا تكذبوا بعضه ببعض ، فما علمتم منه فقولوا ، وما جهلتم فكلوه إلى عالمه \" .\nو [ قد ] تقدم رواية ابن مردويه لهذا الحديث ، من طريق هشام بن عمار ، عن ابن أبي حازم عن أبيه ، عن عمرو بن شعيب ، به .\nوقد قال الحافظ أبو يعلى أحمد بن علي بن المثنى الموصلي في مسنده ، حدثنا زهير بن حرب ، حدثنا أنس بن عياض ، عن أبي حازم ، عن أبي سلمة قال : لا أعلمه إلا عن أبي هريرة ، أن رسول الله صلى الله عليه وسلم قال : \" نزل القرآن على سبعة أحرف ، والمراء في القرآن كفر - ثلاثا - ما عرفتم منه فاعملوا به ، وما جهلتم منه فردوه إلى عالمه \" .\nوهذا إسناد صحيح ، ولكن فيه علة بسبب قول الراوي : \" لا أعلمه إلا عن أبي هريرة \" .\nوقال ابن المنذر في تفسيره : أخبرنا محمد بن عبد الله بن عبد الحكم ، أخبرنا ابن وهب قال : أخبرني نافع بن يزيد قال : يقال : الراسخون في العلم المتواضعون لله ، المتذللون لله في مرضاته ، لا يتعاطون من فوقهم ، ولا يحقرون من دونهم . [ ولهذا قال تعالى : ( وما يذكر إلا أولو الألباب ) أي : إنما يفهم ويعقل ويتدبر المعاني على وجهها أولو العقول السليمة أو الفهوم المستقيمة ] .\n                                    ",
        "qortoby": "هُوَ ٱلَّذِيٓ أَنزَلَ عَلَيۡكَ ٱلۡكِتَٰبَ مِنۡهُ ءَايَٰتٞ مُّحۡكَمَٰتٌ هُنَّ أُمُّ ٱلۡكِتَٰبِ وَأُخَرُ مُتَشَٰبِهَٰتٞۖ فَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِمۡ زَيۡغٞ فَيَتَّبِعُونَ مَا تَشَٰبَهَ مِنۡهُ ٱبۡتِغَآءَ ٱلۡفِتۡنَةِ وَٱبۡتِغَآءَ تَأۡوِيلِهِۦۖ وَمَا يَعۡلَمُ تَأۡوِيلَهُۥٓ إِلَّا ٱللَّهُۗ وَٱلرَّٰسِخُونَ فِي ٱلۡعِلۡمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلّٞ مِّنۡ عِندِ رَبِّنَاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ ٧\n                                    \n                                    \n                                    قوله : هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات هو الذي يصوركم في الأرحام كيف يشاء لا إله إلا هو العزيز الحكيم\nفيه تسع مسائل :\nالأولى : خرج مسلم عن عائشة - رضي الله عنها - قالت : تلا رسول الله - صلى الله عليه وسلم - هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات فأما الذين في قلوبهم زيغ فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله وما يعلم تأويله إلا الله والراسخون في العلم يقولون آمنا به كل من عند ربنا وما يذكر إلا أولو الألباب قالت : قال رسول الله - صلى الله عليه وسلم - : إذا رأيتم الذين يتبعون ما تشابه منه فأولئك الذين سماهم الله فاحذروهم . وعن أبي غالب قال : كنت أمشي مع أبي أمامة وهو على حمار له ، حتى إذا انتهى إلى درج مسجد دمشق فإذا رءوس منصوبة ، فقال : ما هذه الرءوس ؟ قيل : هذه رءوس خوارج يجاء بهم من العراق فقال أبو أمامة : ( كلاب النار ، كلاب النار ، كلاب النار ، شر قتلى تحت ظل السماء ، طوبى لمن قتلهم وقتلوه - يقولها ثلاثا - ثم بكى ) فقلت : ما يبكيك يا أبا أمامة ؟ قال : رحمة لهم ( إنهم كانوا من أهل الإسلام فخرجوا منه ، ثم قرأ هو الذي أنزل عليك الكتاب منه آيات محكمات . . . \" إلى آخر الآيات . ثم قرأ ولا تكونوا كالذين تفرقوا واختلفوا من بعد ما جاءهم البينات . فقلت : يا أبا أمامة هم هؤلاء ؟ قال نعم . قلت : أشيء تقوله برأيك أم شيء سمعته من رسول الله - صلى الله عليه وسلم - ؟ فقال : إني إذا لجريء إني إذا لجريء بل سمعته من رسول الله - صلى الله عليه وسلم - غير مرة ولا مرتين ولا ثلاث ولا أربع ولا خمس ولا ست ولا سبع ، ووضع أصبعيه في أذنيه ، قال : وإلا فصمتا - قالها ثلاثا - ) ثم قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : تفرقت بنو إسرائيل على إحدى وسبعين فرقة واحدة في الجنة وسائرهم في النار ، ولتزيدن عليهم هذه الأمة واحدة واحدة في الجنة وسائرهم في النار .\nالثانية : اختلف العلماء في المحكمات والمتشابهات على أقوال عديدة ; فقال جابر بن عبد الله - وهو مقتضى قول الشعبي وسفيان الثوري وغيرهما - : ( المحكمات من آي القرآن ما عرف تأويله وفهم معناه وتفسيره ، والمتشابه ما لم يكن لأحد إلى علمه سبيل مما استأثر الله تعالى بعلمه دون خلقه . قال بعضهم : وذلك مثل وقت قيام الساعة ، وخروج يأجوج ومأجوج والدجال وعيسى ، ونحو الحروف المقطعة في أوائل السور )\nقلت : هذا أحسن ما قيل في المتشابه . وقد قدمنا في أوائل سورة البقرة عن الربيع بن خثيم ( إن الله تعالى أنزل هذا القرآن فاستأثر منه بعلم ما شاء . . . ) الحديث . وقال أبو عثمان : المحكم فاتحة الكتاب التي لا تجزئ الصلاة إلا بها . وقال محمد بن الفضل : سورة الإخلاص ؛ لأنه ليس فيها إلا التوحيد فقط . وقد قيل : القرآن كله محكم ؛ لقوله تعالى : كتاب أحكمت آياته . وقيل : كله متشابه ; لقوله : كتابا متشابها .\nقلت : وليس هذا من معنى الآية في شيء ، فإن قوله تعالى : كتاب أحكمت آياته أي في النظم والرصف وأنه حق من عند الله ، ومعنى كتابا متشابها أي يشبه بعضه بعضا ويصدق بعضه بعضا . وليس المراد بقوله : آيات محكمات هن أم الكتاب وأخر متشابهات هذا المعنى ، وإنما المتشابه في هذه الآية من باب الاحتمال والاشتباه من قوله : إن البقر تشابه علينا أي التبس علينا ، أي يحتمل أنواعا كثيرة من البقر . والمراد بالمحكم ما في مقابلة هذا ، وهو ما لا التباس فيه ولا يحتمل إلا وجها واحدا . وقيل : إن المتشابه ما يحتمل وجوها ، ثم إذا ردت الوجوه إلى وجه واحد وأبطل الباقي صار المتشابه محكما . فالمحكم أبدا أصل ترد إليه الفروع ، والمتشابه هو الفرع . وقال ابن عباس : ( المحكمات هو قوله في سورة الأنعام قل تعالوا أتل ما حرم ربكم عليكم إلى ثلاث آيات ، وقوله في بني إسرائيل : وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا قال ابن عطية : وهذا عندي مثال أعطاه في المحكمات . وقال ابن عباس أيضا : ( المحكمات ناسخه وحرامه وفرائضه وما يؤمن به ويعمل به ، والمتشابهات المنسوخات ومقدمه ومؤخره وأمثاله وأقسامه وما يؤمن به ولا يعمل به ) وقال ابن مسعود وغيره : ( المحكمات الناسخات ، والمتشابهات المنسوخات ) وقاله قتادة والربيع والضحاك . وقال محمد بن جعفر بن الزبير : المحكمات هي التي فيها حجة الرب وعصمة العباد ودفع الخصوم والباطل ، ليس لها تصريف ولا تحريف عما وضعن عليه . والمتشابهات لهن تصريف وتحريف وتأويل ، ابتلى الله فيهن العباد ، وقاله مجاهد وابن إسحاق . قال ابن عطية : وهذا أحسن الأقوال في هذه الآية . قال النحاس : أحسن ما قيل في المحكمات والمتشابهات : أن المحكمات ما كان قائما بنفسه لا يحتاج أن يرجع فيه إلى غيره نحو لم يكن له كفوا أحد وإني لغفار لمن تاب . والمتشابهات نحو إن الله يغفر الذنوب جميعا يرجع فيه إلى قوله جل وعلا : وإني لغفار لمن تاب وإلى قوله عز وجل : إن الله لا يغفر أن يشرك به .\nقلت : ما قاله النحاس يبين ما اختاره ابن عطية ، وهو الجاري على وضع اللسان ؛ وذلك أن المحكم اسم مفعول من أحكم ، والإحكام الإتقان ، ولا شك في أن ما كان واضح المعنى - لا إشكال فيه ولا تردد - إنما يكون كذلك لوضوح مفردات كلماته وإتقان تركيبها ، ومتى اختل أحد الأمرين جاء التشابه والإشكال ، والله أعلم . وقال ابن خويزمنداد : للمتشابه وجوه ، والذي يتعلق به الحكم ما اختلف فيه العلماء : أي الآيتين نسخت الأخرى كقول علي وابن عباس في الحامل المتوفى عنها زوجها ( تعتد أقصى الأجلين ) فكان عمر وزيد بن ثابت وابن مسعود وغيرهم يقولون ( وضع الحمل ) ويقولون : ( سورة النساء القصرى نسخت أربعة أشهر وعشرا ) وكان علي وابن عباس يقولان لم تنسخ . وكاختلافهم في الوصية للوارث هل نسخت أم لم تنسخ . وكتعارض الآيتين أيهما أولى أن تقدم إذا لم يعرف النسخ ولم توجد شرائطه ، كقوله تعالى : وأحل لكم ما وراء ذلكم يقتضي الجمع بين الأقارب من ملك اليمين ، وقوله تعالى : وأن تجمعوا بين الأختين إلا ما قد سلف يمنع ذلك . ومنه أيضا تعارض الأخبار عن النبي - صلى الله عليه وسلم - وتعارض الأقيسة ، فذلك المتشابه . وليس من المتشابه أن تقرأ الآية بقراءتين ويكون الاسم محتملا أو مجملا يحتاج إلى تفسير ؛ لأن الواجب منه قدر ما يتناول الاسم أو جميعه . والقراءتان كالآيتين يجب العمل بموجبهما جميعا كما قرئ : وامسحوا برؤوسكم وأرجلكم بالفتح والكسر ، على ما يأتي بيانه \" في المائدة \" إن شاء الله تعالى .\nالثالثة : روى البخاري عن سعيد بن جبير قال : قال رجل لابن عباس : إني أجد في القرآن أشياء تختلف علي ، قال : ما هو ؟ قال : فلا أنساب بينهم يومئذ ولا يتساءلون وقال : وأقبل بعضهم على بعض يتساءلون وقال : ولا يكتمون الله حديثا وقال : والله ربنا ما كنا مشركين فقد كتموا في هذه الآية ، وفي النازعات أم السماء بناها إلى قوله دحاها فذكر خلق السماء قبل خلق الأرض ، ثم قال : أئنكم لتكفرون بالذي خلق الأرض في يومين . . . إلى : طائعين فذكر في هذا خلق الأرض قبل خلق السماء . وقال : وكان الله غفورا رحيما وكان الله عزيزا حكيما . وكان الله سميعا بصيرا فكأنه كان ثم مضى . فقال ابن عباس : ( فلا أنساب بينهم في النفخة الأولى ، ثم ينفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله ، فلا أنساب بينهم عند ذلك ولا يتساءلون ، ثم في النفخة الآخرة أقبل بعضهم على بعض يتساءلون . وأما قوله : ما كنا مشركين ولا يكتمون الله حديثا فإن الله يغفر لأهل الإخلاص ذنوبهم ، وقال المشركون : تعالوا نقول : لم نكن مشركين ; فختم الله على أفواههم فتنطق جوارحهم بأعمالهم ، فعند ذلك عرف أن الله لا يكتم حديثا ، وعنده يود الذين كفروا لو كانوا مسلمين . وخلق الله الأرض في يومين ، ثم استوى إلى السماء فسواهن سبع سماوات في يومين ، ثم دحا الأرض أي بسطها فأخرج منها الماء والمرعى ، وخلق فيها الجبال والأشجار والآكام وما بينها في يومين آخرين ; فذلك قوله : والأرض بعد ذلك دحاها . فخلقت الأرض وما فيها في أربعة أيام ، وخلقت السماء في يومين . وقوله : وكان الله غفورا رحيما يعني نفسه ذلك ، أي لم يزل ولا يزال كذلك ; فإن الله لم يرد شيئا إلا أصاب به الذي أراد . ويحك فلا يختلف عليك القرآن ؛ فإن كلا من عند الله )\nالرابعة : قوله تعالى : وأخر متشابهات لم تصرف ( أخر ) لأنها عدلت عن الألف واللام ; لأن أصلها أن تكون صفة بالألف واللام كالكبر والصغر ، فلما عدلت عن مجرى الألف واللام منعت الصرف . أبو عبيد : لم يصرفوها لأن واحدها لا ينصرف في معرفة ولا نكرة . وأنكر ذلك المبرد وقال : يجب على هذا ألا ينصرف غضاب وعطاش . الكسائي : لم تنصرف لأنها صفة ، وأنكره المبرد أيضا وقال : إن لبدا وحطما صفتان وهما منصرفان . سيبويه : لا يجوز أن تكون أخر معدولة عن الألف واللام ; لأنها لو كانت معدولة عن الألف واللام لكان معرفة ، ألا ترى أن سحر معرفة في جميع الأقاويل لما كانت معدولة عن السحر ، وأمس في قول من قال : ذهب أمس معدولا عن الأمس ; فلو كان أخر معدولا أيضا عن الألف واللام لكان معرفة ، وقد وصفه الله تعالى بالنكرة .\nالخامسة : قوله تعالى : فأما الذين في قلوبهم زيغ الذين رفع بالابتداء ، والخبر فيتبعون ما تشابه منه ، والزيغ الميل ، ومنه زاغت الشمس ، وزاغت الأبصار . ويقال : زاغ يزيغ زيغا إذا ترك القصد ، ومنه قوله تعالى : فلما زاغوا أزاغ الله قلوبهم . وهذه الآية تعم كل طائفة من كافر وزنديق وجاهل وصاحب بدعة ، وإن كانت الإشارة بها في ذلك الوقت إلى نصارى نجران . وقال قتادة في تفسير قوله تعالى : فأما الذين في قلوبهم زيغ : إن لم يكونوا الحرورية وأنواع الخوارج فلا أدري من هم .\nقلت : قد مر هذا التفسير عن أبي أمامة مرفوعا ، وحسبك .\nالسادسة قوله تعالى : فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله قال شيخنا أبو العباس رحمة الله عليه : متبعو المتشابه لا يخلو أن يتبعوه ويجمعوه طلبا للتشكيك في القرآن وإضلال العوام ، كما فعلته الزنادقة والقرامطة الطاعنون في القرآن ، أو طلبا لاعتقاد ظواهر المتشابه ، كما فعلته المجسمة الذين جمعوا ما في الكتاب والسنة مما ظاهره الجسمية حتى اعتقدوا أن البارئ تعالى جسم مجسم وصورة مصورة ذات وجه وعين ويد وجنب ورجل وأصبع ، تعالى الله عن ذلك ، أو يتبعوه على جهة إبداء تأويلاتها وإيضاح معانيها ، أو كما فعل صبيغ حين أكثر على عمر فيه السؤال . فهذه أربعة أقسام : ( الأول ) لا شك في كفرهم ، وأن حكم الله فيهم القتل من غير استتابة . ( الثاني ) الصحيح : القول بتكفيرهم ، إذ لا فرق بينهم وبين عباد الأصنام والصور ، ويستتابون فإن تابوا وإلا قتلوا كما يفعل بمن ارتد . ( الثالث ) اختلفوا في جواز ذلك بناءا على الخلاف في جواز تأويلها . وقد عرف أن مذهب السلف ترك التعرض لتأويلها مع قطعهم باستحالة ظواهرها ، فيقولون أمروها كما جاءت . وذهب بعضهم إلى إبداء تأويلاتها وحملها على ما يصح حمله في اللسان عليها من غير قطع بتعيين مجمل منها .\n( الرابع ) الحكم فيه الأدب البليغ ، كما فعله عمر بصبيغ . وقال أبو بكر الأنباري : وقد كان الأئمة من السلف يعاقبون من يسأل عن تفسير الحروف المشكلات في القرآن ؛ لأن السائل إن كان يبغي بسؤاله تخليد البدعة وإثارة الفتنة فهو حقيق بالنكير وأعظم التعزير ، وإن لم يكن ذلك مقصده فقد استحق العتب بما اجترم من الذنب ، إذ أوجد للمنافقين الملحدين في ذلك الوقت سبيلا إلى أن يقصدوا ضعفة المسلمين بالتشكيك والتضليل في تحريف القرآن عن مناهج التنزيل وحقائق التأويل . فمن ذلك ما حدثنا إسماعيل بن إسحاق القاضي أنبأنا سليمان بن حرب عن حماد بن زيد عن يزيد بن حازم عن سليمان بن يسار أن صبيغ بن عسل قدم المدينة فجعل يسأل عن متشابه القرآن وعن أشياء ، فبلغ ذلك عمر - رضي الله عنه - فبعث إليه عمر فأحضره وقد أعد له عراجين من عراجين النخل . فلما حضر قال له عمر : من أنت ؟ قال : أنا عبد الله صبيغ . فقال عمر - رضي الله عنه - : وأنا عبد الله عمر ، ثم قام إليه فضرب رأسه بعرجون فشجه ، ثم تابع ضربه حتى سال دمه على وجهه ، فقال : حسبك يا أمير المؤمنين فقد والله ذهب ما كنت أجد في رأسي . وقد اختلفت الروايات في أدبه ، وسيأتي ذكرها في ( الذاريات ) . ثم إن الله تعالى ألهمه التوبة وقذفها في قلبه فتاب وحسنت توبته .\nومعنى ابتغاء الفتنة طلب الشبهات واللبس على المؤمنين حتى يفسدوا ذات بينهم ، ويردوا الناس إلى زيغهم .\nوقال أبو إسحاق الزجاج : معنى وابتغاء تأويله أنهم طلبوا تأويل بعثهم وإحيائهم ، فأعلم الله جل وعز أن تأويل ذلك ووقته لا يعلمه إلا الله . قال : والدليل على ذلك قوله تعالى : هل ينظرون إلا تأويله يوم يأتي تأويله أي يوم يرون ما يوعدون من البعث والنشور والعذاب يقول الذين نسوه من قبل أي تركوه - قد جاءت رسل ربنا بالحق أي قد رأينا تأويل ما أنبأتنا به الرسل . قال : فالوقف على قوله تعالى : وما يعلم تأويله إلا الله أي لا يعلم أحد متى البعث إلا الله .\nالسابعة : وما يعلم تأويله إلا الله يقال : إن جماعة من اليهود منهم حيي بن أخطب دخلوا على رسول الله - صلى الله عليه وسلم - وقالوا : بلغنا أنه نزل عليك الم فإن كنت صادقا في مقالتك فإن ملك أمتك يكون إحدى وسبعين سنة ; لأن الألف في حساب الجمل واحد ، واللام ثلاثون ، والميم أربعون ، فنزل وما يعلم تأويله إلا الله . والتأويل يكون بمعنى التفسير ، كقولك : تأويل هذه الكلمة على كذا . ويكون بمعنى ما يئول الأمر إليه . واشتقاقه من آل الأمر إلى كذا يئول إليه ، أي صار . وأولته تأويلا أي صيرته . وقد حده بعض الفقهاء فقالوا : هو إبداء احتمال في اللفظ مقصود بدليل خارج عنه . فالتفسير بيان اللفظ ، كقوله لا ريب فيه أي لا شك . وأصله من الفسر وهو البيان ، يقال : فسرت الشيء ( مخففا ) أفسره ( بالكسر ) فسرا . والتأويل بيان المعنى ، كقوله لا شك فيه عند المؤمنين أو لأنه حق في نفسه فلا يقبل ذاته الشك وإنما الشك وصف الشاك . وكقول ابن عباس في الجد أبا لأنه تأول قول الله عز وجل : يابني آدم .\nالثامنة قوله تعالى : والراسخون في العلم اختلف العلماء في والراسخون في العلم هل هو ابتداء كلام مقطوع مما قبله ، أو هو معطوف على ما قبله فتكون الواو للجمع . فالذي عليه الأكثر أنه مقطوع مما قبله ، وأن الكلام تم عند قوله إلا الله هذا قول ابن عمر وابن عباس وعائشة وعروة بن الزبير وعمر بن عبد العزيز وغيرهم ، وهو مذهب الكسائي والأخفش والفراء وأبي عبيد وغيرهم . قال أبو نهيك الأسدي : إنكم تصلون هذه الآية وإنها مقطوعة . وما انتهى علم الراسخين إلا إلى قولهم آمنا به كل من عند ربنا . وقال مثل هذا عمر بن عبد العزيز ، وحكى الطبري نحوه عن يونس عن أشهب عن مالك بن أنس . و ( يقولون ) على هذا خبر ( الراسخون ) . قال الخطابي : وقد جعل الله تعالى آيات كتابه الذي أمرنا بالإيمان به والتصديق بما فيه قسمين : محكما ومتشابها ، فقال عز من قائل : هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات . . . إلى قوله : كل من عند ربنا فاعلم أن المتشابه من الكتاب قد استأثر الله بعلمه ، فلا يعلم تأويله أحد غيره ، ثم أثنى الله عز وجل على الراسخين في العلم بأنهم يقولون آمنا به . ولولا صحة الإيمان منهم لم يستحقوا الثناء عليه . ومذهب أكثر العلماء أن الوقف التام في هذه الآية إنما هو عند قوله تعالى : وما يعلم تأويله إلا الله وأن ما بعده استئناف كلام آخر ، وهو قوله والراسخون في العلم يقولون آمنا به . وروي ذلك عن ابن مسعود وأبي بن كعب وابن عباس وعائشة . وإنما روي عن مجاهد أنه نسق الراسخون على ما قبله وزعم أنهم يعلمونه . واحتج له بعض أهل اللغة فقال : معناه والراسخون في العلم يعلمونه قائلين آمنا ، وزعم أن موضع يقولون نصب على الحال . وعامة أهل اللغة ينكرونه ويستبعدونه ; لأن العرب لا تضمر الفعل والمفعول معا ، ولا تذكر حالا إلا مع ظهور الفعل ، فإذا لم يظهر فعل فلا يكون حال . ولو جاز ذلك لجاز أن يقال : عبد الله راكبا ، بمعنى أقبل عبد الله راكبا ; وإنما يجوز ذلك مع ذكر الفعل كقوله : عبد الله يتكلم يصلح بين الناس ، فكان ( يصلح ) حالا ، كقول الشاعر - أنشدنيه أبو عمر قال أنشدنا أبو العباس ثعلب - :\nأرسلت فيها قطما لكالكا يقصر يمشي ويطول باركا\nأي يقصر ماشيا ، فكان قول عامة العلماء مع مساعدة مذاهب النحويين له أولى من قول مجاهد وحده . وأيضا فإنه لا يجوز أن ينفي الله سبحانه شيئا عن الخلق ويثبته لنفسه ثم يكون له في ذلك شريك . ألا ترى قوله عز وجل : قل لا يعلم من في السماوات والأرض الغيب إلا الله وقوله : لا يجليها لوقتها إلا هو وقوله : كل شيء هالك إلا وجهه فكان هذا كله مما استأثر الله سبحانه بعلمه لا يشركه فيه غيره . وكذلك قوله تبارك وتعالى : وما يعلم تأويله إلا الله . ولو كانت الواو في قوله : والراسخون للنسق لم يكن لقوله : كل من عند ربنا فائدة ، والله أعلم .\nقلت : ما حكاه الخطابي من أنه لم يقل بقول مجاهد غيره فقد روي عن ابن عباس أن الراسخين معطوف على اسم الله عز وجل ، وأنهم داخلون في علم المتشابه ، وأنهم مع علمهم به يقولون آمنا به . وقال الربيع ومحمد بن جعفر بن الزبير والقاسم بن محمد وغيرهم : و يقولون على هذا التأويل نصب على الحال من الراسخين ، كما قال :\nالريح تبكي شجوها والبرق يلمع في الغمامه\nوهذا البيت يحتمل المعنيين ; فيجوز أن يكون ( والبرق ) مبتدأ ، والخبر ( يلمع ) على التأويل الأول ، فيكون مقطوعا مما قبله ، ويجوز أن يكون معطوفا على الريح ، و ( يلمع ) في موضع الحال على التأويل الثاني أي لامعا . واحتج قائلو هذه المقالة أيضا بأن الله سبحانه مدحهم بالرسوخ في العلم ، فكيف يمدحهم وهم جهال وقد قال ابن عباس : ( أنا ممن يعلم تأويله ) وقرأ مجاهد هذه الآية وقال : أنا ممن يعلم تأويله ، حكاه عنه إمام الحرمين أبو المعالي .\nقلت : وقد رد بعض العلماء هذا القول إلى القول الأول فقال : وتقدير تمام الكلام ( عند الله ) أن معناه وما يعلم تأويله إلا الله يعني تأويل المتشابهات ، والراسخون في العلم يعلمون بعضه قائلين آمنا به كل من عند ربنا بما نصب من الدلائل في المحكم ومكن من رده إليه . فإذا علموا تأويل بعضه ولم يعلموا البعض قالوا آمنا بالجميع كل من عند ربنا ، وما لم يحط به علمنا من الخفايا مما في شرعه الصالح فعلمه عند ربنا . فإن قال قائل : قد أشكل على الراسخين بعض تفسيره حتى قال ابن عباس : ( لا أدري ما الأواه ولا ما غسلين ) قيل له : هذا لا يلزم ; لأن ابن عباس قد علم بعد ذلك ففسر ما وقف عليه . وجواب أقطع من هذا وهو أنه سبحانه لم يقل : وكل راسخ فيجب هذا ، فإذا لم يعلمه أحد علمه الآخر . ورجح ابن فورك أن الراسخين يعلمون التأويل وأطنب في ذلك . وفي قوله عليه السلام لابن عباس : اللهم فقهه في الدين وعلمه التأويل ما يبين لك ذلك ، أي علمه معاني كتابك .\nوالوقف على هذا يكون عند قوله والراسخون في العلم . قال شيخنا أبو العباس أحمد بن عمر : وهو الصحيح ; فإن تسميتهم راسخين يقتضي أنهم يعلمون أكثر من المحكم الذي يستوي في علمه جميع من يفهم كلام العرب . وفي أي شيء هو رسوخهم إذا لم يعلموا إلا ما يعلم الجميع .\nلكن المتشابه يتنوع ، فمنه ما لا يعلم البتة كأمر الروح والساعة مما استأثر الله بغيبه ، وهذا لا يتعاطى علمه أحد لا ابن عباس ولا غيره . فمن قال من العلماء الحذاق بأن الراسخين لا يعلمون علم المتشابه فإنما أراد هذا النوع ، وأما ما يمكن حمله على وجوه في اللغة ومناح في كلام العرب فيتأول ويعلم تأويله المستقيم ، ويزال ما فيه مما عسى أن يتعلق من تأويل غير مستقيم ، كقوله في عيسى : وروح منه إلى غير ذلك فلا يسمى أحد راسخا إلا أن يعلم من هذا النوع كثيرا بحسب ما قدر له .\nوأما من يقول : إن المتشابه هو المنسوخ فيستقيم على قوله إدخال الراسخين في علم التأويل ، لكن تخصيصه المتشابهات بهذا النوع غير صحيح .\nوالرسوخ : الثبوت في الشيء ، وكل ثابت راسخ . وأصله في الأجرام أن يرسخ الجبل والشجر في الأرض ، قال الشاعر :\nلقد رسخت في الصدر مني مودة لليلى أبت آياتها أن تغيرا\nورسخ الإيمان في قلب فلان يرسخ رسوخا . وحكى بعضهم : رسخ الغدير : نضب ماؤه ، حكاه ابن فارس فهو من الأضداد . ورسخ ورضخ ورصن ورسب كله ثبت فيه . وسئل النبي - صلى الله عليه وسلم - عن الراسخين في العلم فقال : هو من برت يمينه وصدق لسانه واستقام قلبه . فإن قيل : كيف كان في القرآن متشابه والله يقول : وأنزلنا إليك الذكر لتبين للناس ما نزل إليهم فكيف لم يجعله كله واضحا ؟ قيل له : الحكمة في ذلك - والله أعلم - أن يظهر فضل العلماء ; لأنه لو كان كله واضحا لم يظهر فضل بعضهم على بعض . وهكذا يفعل من يصنف تصنيفا يجعل بعضه واضحا وبعضه مشكلا ، ويترك للجثوة موضعا ; لأن ما هان وجوده قل بهاؤه ، والله أعلم .\nالتاسعة : قوله تعالى : كل من عند ربنا فيه ضمير عائد على كتاب الله تعالى محكمه ومتشابهه ; والتقدير : كله من عند ربنا . وحذف الضمير لدلالة ( كل ) عليه ; إذ هي لفظة تقتضي الإضافة . ثم قال : وما يذكر إلا أولو الألباب أي ما يقول هذا ويؤمن ويقف حيث وقف ويدع اتباع المتشابه إلا ذو لب ، وهو العقل . ولب كل شيء خالصه ; فلذلك قيل للعقل لب . و أولو جمع ذو .\n                                    ",
        "saadi": "هُوَ ٱلَّذِيٓ أَنزَلَ عَلَيۡكَ ٱلۡكِتَٰبَ مِنۡهُ ءَايَٰتٞ مُّحۡكَمَٰتٌ هُنَّ أُمُّ ٱلۡكِتَٰبِ وَأُخَرُ مُتَشَٰبِهَٰتٞۖ فَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِمۡ زَيۡغٞ فَيَتَّبِعُونَ مَا تَشَٰبَهَ مِنۡهُ ٱبۡتِغَآءَ ٱلۡفِتۡنَةِ وَٱبۡتِغَآءَ تَأۡوِيلِهِۦۖ وَمَا يَعۡلَمُ تَأۡوِيلَهُۥٓ إِلَّا ٱللَّهُۗ وَٱلرَّٰسِخُونَ فِي ٱلۡعِلۡمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلّٞ مِّنۡ عِندِ رَبِّنَاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ ٧\n                                        \n                                        \n                                        \n                                        القرآن العظيم كله محكم كما قال تعالى { كتاب أحكمت آياته ثم فصلت من لدن حكيم خبير } فهو مشتمل على غاية الإتقان والإحكام والعدل والإحسان { ومن أحسن من الله حكما لقوم يوقنون } وكله متشابه في الحسن والبلاغة وتصديق بعضه لبعضه ومطابقته لفظا ومعنى، وأما الإحكام والتشابه المذكور في هذه الآية فإن القرآن كما ذكره الله { منه آيات محكمات } أي: واضحات الدلالة، ليس فيها شبهة ولا إشكال { هن أم الكتاب } أي: أصله الذي يرجع إليه كل متشابه، وهي معظمه وأكثره، { و } منه آيات { أخر متشابهات } أي: يلتبس معناها على كثير من الأذهان: لكون دلالتها مجملة، أو يتبادر إلى بعض الأفهام غير المراد منها، فالحاصل أن منها آيات بينة واضحة لكل أحد، وهي الأكثر التي يرجع إليها، ومنه آيات تشكل على بعض الناس، فالواجب في هذا أن يرد المتشابه إلى المحكم والخفي إلى الجلي، فبهذه الطريق يصدق بعضه بعضا ولا يحصل فيه مناقضة ولا معارضة، ولكن الناس انقسموا إلى فرقتين { فأما الذين في قلوبهم زيغ } أي: ميل عن الاستقامة بأن فسدت مقاصدهم، وصار قصدهم الغي والضلال وانحرفت قلوبهم عن طريق الهدى والرشاد { فيتبعون ما تشابه منه } أي: يتركون المحكم الواضح ويذهبون إلى المتشابه، ويعكسون الأمر فيحملون المحكم على المتشابه { ابتغاء الفتنة } لمن يدعونهم لقولهم، فإن المتشابه تحصل به الفتنة بسبب الاشتباه الواقع فيه، وإلا فالمحكم الصريح ليس محلا للفتنة، لوضوح الحق فيه لمن قصده اتباعه، وقوله { وابتغاء تأويله وما يعلم تأويله إلا الله } للمفسرين في الوقوف على { الله } من قوله { وما يعلم تأويله إلا الله } قولان، جمهورهم يقفون عندها، وبعضهم يعطف عليها { والراسخون في العلم } وذلك كله محتمل، فإن التأويل إن أريد به علم حقيقة الشيء وكنهه كان الصواب الوقوف على { إلا الله } لأن المتشابه الذي استأثر الله بعلم كنهه وحقيقته، نحو حقائق صفات الله وكيفيتها، وحقائق أوصاف ما يكون في اليوم الآخر ونحو ذلك، فهذه لا يعلمها إلا الله، ولا يجوز التعرض للوقوف عليها، لأنه تعرض لما لا يمكن معرفته، كما سئل الإمام مالك رحمه الله عن قوله { الرحمن على العرش [استوى ] } فقال السائل: كيف استوى؟ فقال مالك: الاستواء معلوم، والكيف مجهول، والإيمان به واجب، والسؤال عنه بدعة، فهكذا يقال في سائر الصفات لمن سأل عن كيفيتها أن يقال كما قال الإمام مالك، تلك الصفة معلومة، وكيفيتها مجهولة، والإيمان بها واجب، والسؤال عنها بدعة، وقد أخبرنا الله بها ولم يخبرنا بكيفيتها، فيجب علينا الوقوف على ما حد لنا، فأهل الزيغ يتبعون هذه الأمور المشتبهات تعرضا لما لا يعني، وتكلفا لما لا سبيل لهم إلى علمه، لأنه لا يعلمها إلا الله، وأما الراسخون في العلم فيؤمنون بها ويكلون المعنى إلى الله فيسلمون ويسلمون، وإن أريد بالتأويل التفسير والكشف والإيضاح، كان الصواب عطف { الراسخون } على { الله } فيكون الله قد أخبر أن تفسير المتشابه ورده إلى المحكم وإزالة ما فيه من الشبهة لا يعلمها إلا هو تعالى والراسخون في العلم يعلمون أيضا، فيؤمنون بها ويردونها للمحكم ويقولون { كل } من المحكم والمتشابه { من عند ربنا } وما كان من عنده فليس فيه تعارض ولا تناقض بل هو متفق يصدق بعضه بعضا ويشهد بعضه لبعض وفيه تنبيه على الأصل الكبير، وهو أنهم إذا علموا أن جميعه من عند الله، وأشكل عليهم مجمل المتشابه، علموا يقينا أنه مردود إلى المحكم، وإن لم يفهموا وجه ذلك. ولما رغب تعالى في التسليم والإيمان بأحكامه وزجر عن اتباع المتشابه قال { وما يذكر } أي: يتعظ بمواعظ الله ويقبل نصحه وتعليمه إلا { أولوا الألباب } أي: أهل العقول الرزينة لب العالم وخلاصة بني آدم يصل التذكير إلى عقولهم، فيتذكرون ما ينفعهم فيفعلونه، وما يضرهم فيتركونه، وأما من عداهم فهم القشور الذي لا حاصل له ولا نتيجة تحته، لا ينفعهم الزجر والتذكير لخلوهم من العقول النافعة.\n                                    "
      },
      "originalText": "هُوَ ٱلَّذِيٓ أَنزَلَ عَلَيۡكَ ٱلۡكِتَٰبَ مِنۡهُ ءَايَٰتٞ مُّحۡكَمَٰتٌ هُنَّ أُمُّ ٱلۡكِتَٰبِ وَأُخَرُ مُتَشَٰبِهَٰتٞۖ فَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِمۡ زَيۡغٞ فَيَتَّبِعُونَ مَا تَشَٰبَهَ مِنۡهُ ٱبۡتِغَآءَ ٱلۡفِتۡنَةِ وَٱبۡتِغَآءَ تَأۡوِيلِهِۦۖ وَمَا يَعۡلَمُ تَأۡوِيلَهُۥٓ إِلَّا ٱللَّهُۗ وَٱلرَّٰسِخُونَ فِي ٱلۡعِلۡمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلّٞ مِّنۡ عِندِ رَبِّنَاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ ٧"
    },
    {
      "number": 301,
      "text": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 8,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَا لَا تُزِغۡ قُلُوبَنَا بَعۡدَ إِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِن لَّدُنكَ رَحۡمَةًۚ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٨\n                                    \n                                    \n                                    ثم قال تعالى عنهم مخبرا أنهم دعوا ربهم قائلين : ( ربنا لا تزغ قلوبنا بعد إذ هديتنا ) أي : لا تملها عن الهدى بعد إذ أقمتها عليه ولا تجعلنا كالذين في قلوبهم زيغ ، الذين يتبعون ما تشابه من القرآن ولكن ثبتنا على صراطك المستقيم ، ودينك القويم ( وهب لنا من لدنك ) أي : من عندك ) رحمة ) تثبت بها قلوبنا ، وتجمع بها شملنا ، وتزيدنا بها إيمانا وإيقانا ( إنك أنت الوهاب )\nقال ابن أبي حاتم : حدثنا عمرو بن عبد الله الأودي - وقال ابن جرير : حدثنا أبو كريب - قالا جميعا : حدثنا وكيع ، عن عبد الحميد بن بهرام ، عن شهر بن حوشب ، عن أم سلمة ، رضي الله عنها ، أن النبي صلى الله عليه وسلم كان يقول : \" يا مقلب القلوب ثبت قلبي على دينك \" ثم قرأ : ( ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب ) رواه ابن مردويه من طريق محمد بن بكار ، عن عبد الحميد بن بهرام ، عن شهر بن حوشب ، عن أم سلمة ، وهي أسماء بنت يزيد بن السكن ، سمعها تحدث أن رسول الله صلى الله عليه وسلم كان يكثر في دعائه : \" اللهم مقلب القلوب ، ثبت قلبي على دينك \" قالت : قلت : يا رسول الله ، وإن القلب ليتقلب ؟ قال : \" نعم ، ما خلق الله من بني آدم من بشر إلا أن قلبه بين أصبعين من أصابع الله عز وجل ، فإن شاء أقامه ، وإن شاء أزاغه \" . فنسأل الله ربنا ألا يزيغ قلوبنا بعد إذ هدانا ، ونسأله أن يهب لنا من لدنه رحمة ، إنه هو الوهاب .\nوهكذا رواه ابن جرير من حديث أسد بن موسى ، عن عبد الحميد بن بهرام ، به مثله . ورواه أيضا عن المثنى ، عن الحجاج بن منهال ، عن عبد الحميد بن بهرام ، به مثله ، وزاد : \" قلت يا رسول الله ، ألا تعلمني دعوة أدعو بها لنفسي ؟ قال : \" بلى قولي : اللهم رب النبي محمد ، اغفر لي ذنبي ، وأذهب غيظ قلبي ، وأجرني من مضلات الفتن \" .\nثم قال ابن مردويه : حدثنا سليمان بن أحمد ، حدثنا محمد بن هارون بن بكار الدمشقي ، أخبرنا العباس بن الوليد الخلال ، أخبرنا يزيد بن يحيى بن عبيد الله ، أخبرنا سعيد بن بشير ، عن قتادة ، عن أبي حسان الأعرج عن عائشة ، رضي الله عنها ، قالت : كان رسول الله صلى الله عليه وسلم كثيرا ما يدعو : \" يا مقلب القلوب ، ثبت قلبي على دينك \" ، قلت : يا رسول الله ، ما أكثر ما تدعو بهذا الدعاء . فقال : \" ليس من قلب إلا وهو بين أصبعين من أصابع الرحمن ، إذا شاء أن يقيمه أقامه ، وإذا شاء أن يزيغه أزاغه ، أما تسمعين قوله : ( ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب ) . غريب من هذا الوجه ، ولكن أصله ثابت في الصحيحين وغيرهما من طرق كثيرة بدون زيادة ذكر هذه الآية الكريمة .\nوقد روى أبو داود والنسائي وابن مردويه ، من حديث أبي عبد الرحمن المقرئ - زاد النسائي وابن حبان : وعبد الله بن وهب ، كلاهما عن سعيد بن أبي أيوب حدثني عبد الله بن الوليد التجيبي ، عن سعيد بن المسيب ، عن عائشة ، رضي الله عنها ، أن رسول الله صلى الله عليه وسلم كان إذا استيقظ من الليل قال : \" لا إله إلا أنت سبحانك ، اللهم إني أستغفرك لذنبي ، وأسألك رحمة ، اللهم زدني علما ، ولا تزغ قلبي بعد إذ هديتني ، وهب لي من لدنك رحمة إنك أنت الوهاب \" لفظ ابن مردويه .\nوقال عبد الرزاق ، عن مالك ، عن أبي عبيد - مولى سليمان بن عبد الملك - عن عبادة بن نسي ، أنه أخبره ، أنه سمع قيس بن الحارث يقول : أخبرني أبو عبد الله الصنابحي ، أنه صلى وراء أبي بكر الصديق المغرب ، فقرأ أبو بكر في الركعتين الأوليين بأم القرآن وسورتين من قصار المفصل ، وقرأ في الركعة الثالثة ، قال : فدنوت منه حتى إن ثيابي لتكاد تمس ثيابه ، فسمعته يقرأ بأم القرآن وهذه الآية : ( ربنا لا تزغ قلوبنا بعد إذ هديتنا [ وهب لنا من لدنك رحمة إنك أنت الوهاب ] ) .\nقال أبو عبيد : وأخبرني عبادة بن نسي : أنه كان عند عمر بن عبد العزيز في خلافته ، فقال عمر لقيس : كيف أخبرتني عن أبي عبد الله الصنابحي فأخبره بما سمع أبا عبد الله ثانيا . قال عمر : فما تركناها منذ سمعناها منه ، وإن كنت قبل ذلك لعلى غير ذلك . فقال له رجل : على أي شيء كان أمير المؤمنين قبل ذلك ؟ قال : كنت أقرأ ( قل هو الله أحد ) [ الإخلاص : 1 ] وقد روى هذا الأثر الوليد بن مسلم ، عن مالك والأوزاعي ، كلاهما عن أبي عبيد ، به . ورواه الوليد أيضا ، عن ابن جابر ، عن يحيى بن يحيى الغساني ، عن محمود بن لبيد ، عن الصنابحي : أنه صلى خلف أبي بكر - رضي الله عنه - المغرب فقرأ في الأوليين بفاتحة الكتاب وسورة قصيرة ، يجهر بالقراءة ، فلما قام إلى الثالثة ابتدأ القراءة فدنوت منه حتى إن ثيابي لتمس ثيابه ، فقرأ هذه الآية : ( ربنا لا تزغ قلوبنا [ بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب ] ) .\n                                    ",
        "qortoby": "رَبَّنَا لَا تُزِغۡ قُلُوبَنَا بَعۡدَ إِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِن لَّدُنكَ رَحۡمَةًۚ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٨\n                                    \n                                    \n                                    قوله تعالى : ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب فيه مسألتان\nالأولى : قوله تعالى : ربنا لا تزغ قلوبنا في الكلام حذف تقديره يقولون . وهذا حكاية عن الراسخين . ويجوز أن يكون المعنى قل يا محمد ، ويقال : إزاغة القلب فساد وميل عن الدين ، أفكانوا يخافون وقد هدوا أن ينقلهم الله إلى الفساد ؟ فالجواب أن يكونوا سألوا إذ هداهم الله ألا يبتليهم بما يثقل عليهم من الأعمال فيعجزوا عنه ; نحو ولو أنا كتبنا عليهم أن اقتلوا أنفسكم أو اخرجوا من دياركم . . . . قال ابن كيسان : سألوا ألا يزيغوا فيزيغ الله قلوبهم ; نحو فلما زاغوا أزاغ الله قلوبهم . . . ; أي ثبتنا على هدايتك إذ هديتنا وألا نزيغ فنستحق أن تزيغ قلوبنا . وقيل : هو منقطع مما قبل ; وذلك أنه تعالى لما ذكر أهل الزيغ . عقب ذلك بأن علم عباده الدعاء إليه في ألا يكونوا من الطائفة الذميمة التي ذكرت وهي أهل الزيغ .\nوفي الموطأ عن أبي عبد الله الصنابحي أنه قال : قدمت المدينة في خلافة أبي بكر الصديق فصليت وراءه المغرب ، فقرأ في الركعتين الأوليين بأم القرآن وسورة من قصار المفصل ، ثم قام في الثالثة ، فدنوت منه حتى إن ثيابي لتكاد تمس ثيابه ، فسمعته يقرأ بأم القرآن وهذه الآية ربنا لا تزغ قلوبنا الآية . قال العلماء : قراءته بهذه الآية ضرب من القنوت والدعاء لما كان فيه من أمر أهل الردة . والقنوت جائز في المغرب عند جماعة من أهل العلم ، وفي كل صلاة أيضا إذا دهم المسلمين أمر عظيم يفزعهم ويخافون منه على أنفسهم .\nوروى الترمذي من حديث شهر بن حوشب قال : قلت لأم سلمة : يا أم المؤمنين ، ما كان أكثر دعاء رسول الله - صلى الله عليه وسلم - إذا كان عندك ؟ قالت : كان أكثر دعائه ( يا مقلب القلوب ثبت قلبي على دينك ) . فقلت : يا رسول الله ، ما أكثر دعاءك يا مقلب القلوب ثبت قلبي على دينك قال : يا أم سلمة إنه ليس آدمي إلا وقلبه بين أصبعين من أصابع الله فمن شاء أقام ومن شاء أزاغ . فتلا معاذ ربنا لا تزغ قلوبنا بعد إذ هديتنا . قال : حديث حسن . وهذه الآية حجة على المعتزلة في قولهم : إن الله لا يضل العباد . ولو لم تكن الإزاغة من قبله لما جاز أن يدعى في دفع ما لا يجوز عليه فعله . وقرأ أبو واقد الجراح \" لا تزغ قلوبنا \" بإسناد الفعل إلى القلوب ، وهذه رغبة إلى الله تعالى . ومعنى الآية على القراءتين ألا يكون منك خلق الزيغ فيها فتزيغ .\nالثانية : قوله تعالى : وهب لنا من لدنك رحمة أي من عندك ومن قبلك تفضلا لا عن سبب منا ولا عمل . وفي هذا استسلام وتطارح . وفي \" لدن \" أربع لغات : لدن بفتح اللام وضم الدال وجزم النون ، وهي أفصحها ، وبفتح اللام وضم الدال وحذف النون ; وبضم اللام وجزم الدال وفتح النون ; وبفتح اللام وسكون الدال وفتح النون .\nولعل جهال المتصوفة وزنادقة الباطنية يتشبثون بهذه الآية وأمثالها فيقولون : العلم ما وهبه الله ابتداء من غير كسب ، والنظر في الكتب والأوراق حجاب . وهذا مردود على ما يأتي بيانه في هذا الموضع .\nومعنى الآية : هب لنا نعيما صادرا عن الرحمة ; لأن الرحمة راجعة إلى صفة الذات فلا يتصور فيها الهبة يقال وهب يهب ; والأصل يوهب بكسر الهاء . ومن قال : الأصل يوهب بفتح الهاء فقد أخطأ لأنه لو كان كما قال لم تحذف الواو كما لم تحذف في يوجل وإنما حذفت الواو لوقوعها بين ياء وكسرة ثم فتح بعد حذفها لأن فيه حرفا من حروف الحلق .\n                                    ",
        "saadi": "رَبَّنَا لَا تُزِغۡ قُلُوبَنَا بَعۡدَ إِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِن لَّدُنكَ رَحۡمَةًۚ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٨\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى عن الراسخين في العلم أنهم يدعون ويقولون { ربنا لا تزغ قلوبنا بعد إذ هديتنا } أي: لا تملها عن الحق جهلا وعنادا منا، بل اجعلنا مستقيمين هادين مهتدين، فثبتنا على هدايتك وعافنا مما ابتليت به الزائغين { وهب لنا من لدنك رحمة } أي: عظيمة توفقنا بها للخيرات وتعصمنا بها من المنكرات { إنك أنت الوهاب } أي: واسع العطايا والهبات، كثير الإحسان الذي عم جودك جميع البريات.\n                                    "
      },
      "originalText": "رَبَّنَا لَا تُزِغۡ قُلُوبَنَا بَعۡدَ إِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِن لَّدُنكَ رَحۡمَةًۚ إِنَّكَ أَنتَ ٱلۡوَهَّابُ ٨"
    },
    {
      "number": 302,
      "text": "رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَا رَيْبَ فِيهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 9,
      "juz": 3,
      "manzil": 1,
      "page": 50,
      "ruku": 42,
      "hizbQuarter": 20,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوۡمٖ لَّا رَيۡبَ فِيهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ٩\n                                    \n                                    \n                                    وقوله : ( ربنا إنك جامع الناس ليوم لا ريب فيه إن الله لا يخلف الميعاد ) أي : يقولون في دعائهم : إنك - يا ربنا - ستجمع بين خلقك يوم معادهم ، وتفصل بينهم وتحكم فيهم فيما اختلفوا فيه ، وتجزي كلا بعمله ، وما كان عليه في الدنيا من خير وشر .\n                                    ",
        "qortoby": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوۡمٖ لَّا رَيۡبَ فِيهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ٩\n                                    \n                                    \n                                    قوله تعالى : ربنا إنك جامع الناس ليوم لا ريب فيه إن الله لا يخلف الميعاد\nأي باعثهم ومحييهم بعد تفرقهم ، وفي هذا إقرار بالبعث ليوم القيامة . قال الزجاج : هذا هو التأويل الذي علمه الراسخون وأقروا به ، وخالف الذين اتبعوا ما تشابه عليهم من أمر البعث حتى أنكروه . والريب الشك ، وقد تقدمت محامله في البقرة . والميعاد مفعال من الوعد .\n                                    ",
        "saadi": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوۡمٖ لَّا رَيۡبَ فِيهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ٩\n                                        \n                                        \n                                        \n                                        { ربنا إنك جامع الناس ليوم لا ريب فيه إنك لا تخلف الميعاد } فمجازيهم بأعمالهم حسنها وسيئها، وقد أثنى الله تعالى على الراسخين في العلم بسبع صفات هي عنوان سعادة العبد: إحداها: العلم الذي هو الطريق الموصل إلى الله، المبين لأحكامه وشرائعه، الثانية: الرسوخ في العلم وهذا قدر زائد على مجرد العلم، فإن الراسخ في العلم يقتضي أن يكون عالما محققا، وعارفا مدققا، قد علمه الله ظاهر العلم وباطنه، فرسخ قدمه في أسرار الشريعة علما وحالا وعملا، الثالثة: أنه وصفهم بالإيمان بجميع كتابه ورد لمتشابهه إلى محكمه، بقوله { يقولون آمنا به كل من عند ربنا } الرابعة: أنهم سألوا الله العفو والعافية مما ابتلي به الزائغون المنحرفون، الخامسة: اعترافهم بمنة الله عليهم بالهداية وذلك قوله { ربنا لا تزغ قلوبنا بعد إذ هديتنا } السادسة: أنهم مع هذا سألوه رحمته المتضمنة حصول كل خير واندفاع كل شر، وتوسلوا إليه باسمه الوهاب، السابعة: أنه أخبر عن إيمانهم وإيقانهم بيوم القيامة وخوفهم منه، وهذا هو الموجب للعمل الرادع عن الزلل\n                                    "
      },
      "originalText": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوۡمٖ لَّا رَيۡبَ فِيهِۚ إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ٩"
    }
  ]
}