{
  "number": 513,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 4599,
      "text": "قُلْ لِلْمُخَلَّفِينَ مِنَ الْأَعْرَابِ سَتُدْعَوْنَ إِلَىٰ قَوْمٍ أُولِي بَأْسٍ شَدِيدٍ تُقَاتِلُونَهُمْ أَوْ يُسْلِمُونَ ۖ فَإِنْ تُطِيعُوا يُؤْتِكُمُ اللَّهُ أَجْرًا حَسَنًا ۖ وَإِنْ تَتَوَلَّوْا كَمَا تَوَلَّيْتُمْ مِنْ قَبْلُ يُعَذِّبْكُمْ عَذَابًا أَلِيمًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 16,
      "juz": 26,
      "manzil": 6,
      "page": 513,
      "ruku": 447,
      "hizbQuarter": 204,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا ٦١\n                                    \n                                    \n                                    اختلف المفسرون في هؤلاء القوم الذين يدعون إليهم ، الذين هم أولو بأس شديد ، على أقوال :\nأحدها : أنهم هوازن . رواه شعبة عن أبي بشر ، عن سعيد بن جبير - أو عكرمة ، أو جميعا - ورواه هشيم عن أبي بشر ، عنهما . وبه يقول قتادة في رواية عنه .\nالثاني : ثقيف ، قاله الضحاك .\nالثالث : بنو حنيفة ، قاله جويبر . ورواه محمد بن إسحاق ، عن الزهري . وروي مثله عن سعيد وعكرمة .\nالرابع : هم أهل فارس . رواه علي بن أبي طلحة ، عن ابن عباس ، وبه يقول عطاء ، ومجاهد ، وعكرمة - في إحدى الروايات عنه .\nوقال كعب الأحبار : هم الروم . وعن ابن أبي ليلى ، وعطاء ، والحسن ، وقتادة : هم فارس والروم . وعن مجاهد : هم أهل الأوثان . وعنه أيضا : هم رجال أولو بأس شديد ، ولم يعين فرقة . وبه يقول ابن جريج ، وهو اختيار ابن جرير .\nوقال ابن أبي حاتم : حدثنا الأشج ، حدثنا عبد الرحمن بن الحسن القواريري ، عن معمر ، عن الزهري ، في قوله : ( ستدعون إلى قوم أولي بأس شديد ) قال : لم يأت أولئك بعد .\nوحدثنا أبي ، حدثنا ابن أبي عمر ، حدثنا سفيان ، عن ابن أبي خالد ، عن أبيه ، عن أبي هريرة في قوله : ( ستدعون إلى قوم أولي بأس شديد ) قال : هم البارزون .\nقال : وحدثنا سفيان ، عن الزهري ، عن سعيد بن المسيب ، عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - قال : \" لا تقوم الساعة حتى تقاتلوا قوما صغار الأعين ، ذلف الآنف ، كأن وجوههم المجان المطرقة \" . قال سفيان : هم الترك .\nقال ابن أبي عمر : وجدت في مكان آخر : ابن أبي خالد عن أبيه قال : نزل علينا أبو هريرة ففسر قول رسول الله - صلى الله عليه وسلم - : \" تقاتلون قوما نعالهم الشعر \" قال : هم البارزون ، يعني الأكراد .\nوقوله : ( تقاتلونهم أو يسلمون ) يعني : يشرع لكم جهادهم وقتالهم ، فلا يزال ذلك مستمرا عليهم ، ولكم النصرة عليهم ، أو يسلمون فيدخلون في دينكم بلا قتال بل باختيار .\nثم قال : ( فإن تطيعوا ) أي : تستجيبوا وتنفروا في الجهاد وتؤدوا الذي عليكم فيه ، ( يؤتكم الله أجرا حسنا وإن تتولوا كما توليتم من قبل ) يعني : زمن الحديبية ، حيث دعيتم فتخلفتم ، ( يعذبكم عذابا أليما )\n                                    ",
        "qortoby": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا ٦١\n                                    \n                                    \n                                    قوله تعالى : قل للمخلفين من الأعراب ستدعون إلى قوم أولي بأس شديد تقاتلونهم أو يسلمون فإن تطيعوا يؤتكم الله أجرا حسنا وإن تتولوا كما توليتم من قبل يعذبكم عذابا أليما .\nفيه أربع مسائل : الأولى : قوله تعالى : قل للمخلفين من الأعراب أي قل لهؤلاء الذين تخلفوا عن الحديبية . ستدعون إلى قوم أولي بأس شديد قال ابن عباس وعطاء بن أبي رباح ومجاهد وابن أبي ليلى وعطاء الخراساني : هم فارس . وقال كعب والحسن وعبد الرحمن بن أبي ليلى : الروم . وعن الحسن أيضا : فارس والروم . وقال ابن جبير : هوازن وثقيف . وقال عكرمة : هوازن . وقال قتادة : هوازن وغطفان يوم حنين . وقال الزهري ومقاتل : بنو حنيفة أهل اليمامة أصحاب مسيلمة . وقال رافع بن خديج : والله لقد كنا نقرأ هذه الآية فيما مضى ستدعون إلى قوم أولي بأس شديد فلا نعلم من هم حتى دعانا أبو بكر إلى قتال بني حنيفة فعلمنا أنهم هم . وقال أبو هريرة : لم تأت هذه الآية بعد . وظاهر الآية يرده .\nالثانية : في هذه الآية دليل على صحة إمامة أبي بكر وعمر - رضي الله عنهما - ; لأن أبا بكر دعاهم إلى قتال بني حنيفة ، وعمر دعاهم إلى قتال فارس والروم . وأما قول عكرمة وقتادة إن ذلك في هوازن وغطفان يوم حنين فلا ; لأنه يمتنع أن يكون الداعي لهم الرسول - عليه السلام - ; لأنه قال : لن تخرجوا معي أبدا ولن تقاتلوا معي عدوا فدل على أن المراد بالداعي غير النبي - صلى الله عليه وسلم - . ومعلوم أنه لم يدع هؤلاء القوم بعد النبي - صلى الله عليه وسلم - إلا أبو بكر وعمر - رضي الله عنهما - . الزمخشري : فإن صح ذلك عن قتادة فالمعنى لن تخرجوا معي أبدا ما دمتم على ما أنتم عليه من مرض القلوب والاضطراب في الدين . أو على قول مجاهد كان الموعد أنهم لا يتبعون رسول الله - صلى الله عليه وسلم - إلا متطوعين لا نصيب لهم في المغنم . والله أعلم .\nالثالثة : قوله تعالى : تقاتلونهم أو يسلمون هذا حكم من لا تؤخذ منهم الجزية ، وهو معطوف على تقاتلونهم أي : يكون أحد الأمرين : إما المقاتلة وإما الإسلام ، لا ثالث لهما . وفي حرف أبي ( أو يسلموا ) بمعنى حتى يسلموا ، كما تقول : كل أو تشبع ، أي : حتى تشبع . قال [ امرؤ القيس ] :\nفقلت له لا تبك عينك إنما نحاول ملكا أو نموت فنعذرا\nوقال الزجاج : قال أو يسلمون لأن المعنى أو هم يسلمون من غير قتال . وهذا في قتال المشركين لا في أهل الكتاب .\nالرابعة : قوله تعالى : فإن تطيعوا يؤتكم الله أجرا حسنا الغنيمة والنصر في الدنيا ، والجنة في الآخرة . وإن تتولوا كما توليتم من قبل عام الحديبية . يعذبكم عذابا أليما وهو عذاب النار .\n                                    ",
        "saadi": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا ٦١\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى أن المخلفين من الأعراب يتخلفون عن الجهاد في سبيله، ويعتذرون بغير عذر، وأنهم يطلبون الخروج معهم إذا لم يكن شوكة ولا قتال، بل لمجرد الغنيمة، قال تعالى ممتحنا لهم: { قُلْ لِلْمُخَلَّفِينَ مِنَ الْأَعْرَابِ سَتُدْعَوْنَ إِلَى قَوْمٍ أُولِي بَأْسٍ شَدِيدٍ } أي: سيدعوكم الرسول ومن ناب منابه من الخلفاء الراشدين والأئمة، وهؤلاء القوم فارس والروم ومن نحا نحوهم وأشبههم. { تُقَاتِلُونَهُمْ أَوْ يُسْلِمُونَ } أي: إما هذا وإما هذا، وهذا هو الأمر الواقع، فإنهم في حال قتالهم ومقاتلتهم لأولئك الأقوام، إذ كانت شدتهم وبأسهم معهم، فإنهم في تلك الحال لا يقبلون أن يبذلوا الجزية، بل إما أن يدخلوا في الإسلام، وإما أن يقاتلوا على ما هم عليه، فلما أثخنهم المسلمون، وضعفوا وذلوا، ذهب بأسهم، فصاروا إما أن يسلموا، وإما أن يبذلوا الجزية، { فَإِنْ تُطِيعُوا } الداعي لكم إلى قتال هؤلاء { يُؤْتِكُمُ اللَّهُ أَجْرًا حَسَنًا } وهو الأجر الذي رتبه الله ورسوله على الجهاد في سبيل الله، { وَإِنْ تَتَوَلَّوْا كَمَا تَوَلَّيْتُمْ مِنْ قَبْلُ } عن قتال من دعاكم الرسول إلى قتاله، { يُعَذِّبْكُمْ عَذَابًا أَلِيمًا } ودلت هذه الآية على فضيلة الخلفاء الراشدين، الداعين لجهاد أهل البأس من الناس، وأنه تجب طاعتهم في ذلك.\n                                    "
      },
      "originalText": "قُل لِّلۡمُخَلَّفِينَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُوْلِي بَأۡسٖ شَدِيدٖ تُقَٰتِلُونَهُمۡ أَوۡ يُسۡلِمُونَۖ فَإِن تُطِيعُواْ يُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنٗاۖ وَإِن تَتَوَلَّوۡاْ كَمَا تَوَلَّيۡتُم مِّن قَبۡلُ يُعَذِّبۡكُمۡ عَذَابًا أَلِيمٗا ٦١"
    },
    {
      "number": 4600,
      "text": "لَيْسَ عَلَى الْأَعْمَىٰ حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ ۗ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ وَمَنْ يَتَوَلَّ يُعَذِّبْهُ عَذَابًا أَلِيمًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 17,
      "juz": 26,
      "manzil": 6,
      "page": 513,
      "ruku": 447,
      "hizbQuarter": 204,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا ٧١\n                                    \n                                    \n                                    ثم ذكر الأعذار في ترك الجهاد ، فمنها لازم كالعمى والعرج المستمر ، وعارض كالمرض الذي يطرأ أياما ثم يزول ، فهو في حال مرضه ملحق بذوي الأعذار اللازمة حتى يبرأ .\nثم قال تعالى مرغبا في الجهاد وطاعة الله ورسوله : ( ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار ومن يتول ) أي : ينكل عن الجهاد ، ويقبل على المعاش ( يعذبه عذابا أليما ) في الدنيا بالمذلة ، وفي الآخرة بالنار .\n                                    ",
        "qortoby": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا ٧١\n                                    \n                                    \n                                    قوله تعالى : ليس على الأعمى حرج ولا على الأعرج حرج ولا على المريض حرج ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار ومن يتول يعذبه عذابا أليما .\nقال ابن عباس : لما نزلت : وإن تتولوا كما توليتم من قبل يعذبكم عذابا أليما قال أهل الزمانة : كيف بنا يا رسول الله ؟ فنزلت ليس على الأعمى حرج ولا على الأعرج حرج ولا على المريض حرج أي : لا إثم عليهم في التخلف عن الجهاد لعماهم وزمانتهم وضعفهم . وقد مضى في ( براءة ) وغيرها الكلام فيه مبينا . والعرج : آفة تعرض لرجل واحدة ، وإذا كان ذلك مؤثرا فخلل الرجلين أولى أن يؤثر . وقال مقاتل : هم أهل الزمانة الذين تخلفوا عن الحديبية وقد عذرهم . أي : من شاء أن يسير منهم معكم إلى خيبر فليفعل .\nومن يطع الله ورسوله فيما أمره . يدخله جنات تجري من تحتها الأنهار قرأ نافع وابن عامر ( ندخله ) بالنون على التعظيم . الباقون بالياء ، واختاره أبو عبيد وأبو حاتم لتقدم اسم الله أولا . ومن يتول يعذبه عذابا أليما\n                                    ",
        "saadi": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا ٧١\n                                        \n                                        \n                                        \n                                        ثم ذكر الأعذار التي يعذر بها العبد عن الخروج إلى الجهاد، فقال: { لَيْسَ عَلَى الْأَعْمَى حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ } أي: في التخلف عن الجهاد لعذرهم المانع.\n{ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ } في امتثال أمرهما، واجتناب نهيهما { يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ } فيها ما تشتهيه الأنفس، وتلذ الأعين، { وَمَنْ يَتَوَلَّ } عن طاعة الله ورسوله { يُعَذِّبْهُ عَذَابًا أَلِيمًا } فالسعادة كلها في طاعة الله، والشقاوة في معصيته ومخالفته.\n                                    "
      },
      "originalText": "لَّيۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجٞ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجٞ وَلَا عَلَى ٱلۡمَرِيضِ حَرَجٞۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ وَمَن يَتَوَلَّ يُعَذِّبۡهُ عَذَابًا أَلِيمٗا ٧١"
    },
    {
      "number": 4601,
      "text": "۞ لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 18,
      "juz": 26,
      "manzil": 6,
      "page": 513,
      "ruku": 448,
      "hizbQuarter": 205,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا ٨١\n                                    \n                                    \n                                    يخبر تعالى عن رضاه عن المؤمنين الذين بايعوا رسول الله - صلى الله عليه وسلم - تحت الشجرة ، وقد تقدم ذكر عدتهم ، وأنهم كانوا ألفا وأربعمائة ، وأن الشجرة كانت سمرة بأرض الحديبية .\nقال البخاري : حدثنا محمود ، حدثنا عبيد الله ، عن إسرائيل ، عن طارق بن عبد الرحمن قال : انطلقت حاجا فمررت بقوم يصلون ، فقلت ما هذا المسجد ؟ قالوا : هذه الشجرة ، حيث بايع رسول الله - صلى الله عليه وسلم - بيعة الرضوان ، فأتيت سعيد بن المسيب فأخبرته ، فقال سعيد : حدثني أبي أنه كان فيمن بايع رسول الله - صلى الله عليه وسلم - تحت الشجرة . قال : فلما خرجنا من العام المقبل نسيناها فلم نقدر عليها ، فقال سعيد : إن أصحاب محمد - صلى الله عليه وسلم - لم يعلموها وعلمتموها أنتم ، فأنتم أعلم .\nوقوله : ( فعلم ما في قلوبهم ) أي : من الصدق والوفاء ، والسمع والطاعة ، ( فأنزل السكينة ) : وهي الطمأنينة ، ( عليهم وأثابهم فتحا قريبا ) : وهو ما أجرى الله على أيديهم من الصلح بينهم وبين أعدائهم ، وما حصل بذلك من الخير العام المستمر المتصل بفتح خيبر وفتح مكة ، ثم فتح سائر البلاد والأقاليم عليهم ، وما حصل لهم من العز والنصر والرفعة في الدنيا والآخرة ; ولهذا قال :\n                                    ",
        "qortoby": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا ٨١\n                                    \n                                    \n                                    قوله تعالى : لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة فعلم ما في قلوبهم فأنزل السكينة عليهم وأثابهم فتحا قريبا\nقوله تعالى : لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة هذه بيعة الرضوان ، وكانت بالحديبية ، وهذا خبر الحديبية على اختصار : وذلك أن النبي - صلى الله عليه وسلم - أقام منصرفه من غزوة بني المصطلق في شوال ، وخرج في ذي القعدة معتمرا ، واستنفر الأعراب الذين حول المدينة فأبطأ عنه أكثرهم ، وخرج النبي - صلى الله عليه وسلم - بمن معه من المهاجرين والأنصار ومن اتبعه من العرب ، وجميعهم نحو ألف وأربعمائة . وقيل : ألف وخمسمائة . وقيل : غير هذا ، على ما يأتي . وساق معه الهدي ، فأحرم رسول الله - صلى الله عليه وسلم - ليعلم الناس أنه لم يخرج لحرب ، فلما بلغ خروجه قريشا خرج جمعهم صادين لرسول الله - صلى الله عليه وسلم - عن المسجد الحرام ودخول مكة ، وإنه إن قاتلهم قاتلوه دون ذلك ، وقدموا خالد بن الوليد في خيل إلى ( كراع الغميم ) فورد الخبر بذلك على رسول الله - صلى الله عليه وسلم - وهو ( بعسفان ) وكان المخبر له بشر بن سفيان الكعبي ، فسلك طريقا يخرج به في ظهورهم ، وخرج إلى الحديبية من أسفل مكة ، وكان دليله فيهم رجل من أسلم ، فلما بلغ ذلك خيل قريش التي مع خالد جرت إلى قريش تعلمهم بذلك ، فلما وصل رسول الله - صلى الله عليه وسلم - إلى الحديبية بركت ناقته - صلى الله عليه وسلم - فقال الناس : خلأت خلأت فقال النبي - صلى الله عليه وسلم - : ما خلأت وما هو لها بخلق ولكن حبسها حابس الفيل عن مكة ، لا تدعوني قريش اليوم إلى خطة يسألوني فيها صلة رحم إلا أعطيتهم إياها . ثم نزل - صلى الله عليه وسلم - هناك ، فقيل : يا رسول الله ، ليس بهذا الوادي ماء فأخرج عليه الصلاة والسلام سهما من كنانته فأعطاه رجلا من أصحابه ، فنزل في قليب من تلك القلب فغرزه في جوفه فجاش بالماء الرواء حتى كفى جميع الجيش . وقيل : إن الذي نزل بالسهم في القليب ناجية بن جندب بن عمير الأسلمي وهو سائق بدن النبي - صلى الله عليه وسلم - يومئذ .\nوقيل : نزل بالسهم في القليب البراء بن عازب ، ثم جرت السفراء بين رسول الله - صلى الله عليه وسلم - وبين كفار قريش ، وطال التراجع والتنازع إلى أن جاء سهيل بن عمرو العامري ، فقاضاه على أن ينصرف - عليه الصلاة والسلام - عامه ذلك ، فإذا كان من قابل أتى معتمرا ودخل هو وأصحابه مكة بغير سلاح ، حاشا السيوف في قربها فيقيم بها ثلاثا ويخرج ، وعلى أن يكون بينه وبينهم صلح عشرة أعوام ، يتداخل فيها الناس ويأمن بعضهم بعضا ، وعلى أن من جاء من الكفار إلى المسلمين مسلما من رجل أو امرأة رد إلى الكفار ، ومن جاء من المسلمين إلى الكفار مرتدا لم يردوه إلى المسلمين ، فعظم ذلك على المسلمين حتى كان لبعضهم فيه كلام ، وكان رسول الله - صلى الله عليه وسلم - أعلم بما علمه الله من أنه سيجعل للمسلمين فرجا ، فقال لأصحابه اصبروا فإن الله يجعل هذا الصلح سببا إلى ظهور دينه فأنس الناس إلى قوله هذا بعد نفار منهم ، وأبى سهيل بن عمرو أن يكتب في صدر صحيفة الصلح : من محمد رسول الله ، وقالوا له : لو صدقناك بذلك ما دفعناك عما تريد فلا بد أن تكتب : باسمك اللهم . فقال لعلي وكان يكتب صحيفة الصلح : امح يا علي ، واكتب باسمك اللهم فأبى علي أن يمحو بيده ( محمد رسول الله ) فقال له رسول الله - صلى الله عليه وسلم - : اعرضه علي فأشار إليه فمحاه رسول الله - صلى الله عليه وسلم - بيده ، وأمره أن يكتب [ من محمد بن عبد الله ] .\nوأتى أبو جندل بن سهيل يومئذ بأثر كتاب الصلح وهو يرسف في قيوده ، فرده رسول الله - صلى الله عليه وسلم - إلى أبيه ، فعظم ذلك على المسلمين ، فأخبرهم رسول الله - صلى الله عليه وسلم - وأخبر أبا جندل [ أن الله سيجعل له فرجا ومخرجا ] . وكان رسول الله - صلى الله عليه وسلم - قبل الصلح قد بعث عثمان بن عفان إلى مكة رسولا ، فجاء خبر إلى رسول الله - صلى الله عليه وسلم - بأن أهل مكة قتلوه ، فدعا رسول الله - صلى الله عليه وسلم - حينئذ إلى المبايعة له على الحرب والقتال لأهل مكة ، فروي أنه بايعهم على الموت . وروي أنه بايعهم على ألا يفروا . وهي بيعة الرضوان تحت الشجرة ، التي أخبر الله تعالى أنه رضي عن المبايعين لرسول الله - صلى الله عليه وسلم - تحتها . وأخبر رسول الله - صلى الله عليه وسلم - أنهم لا يدخلون النار . وضرب رسول الله - صلى الله عليه وسلم - بيمينه في شماله لعثمان ، فهو كمن شهدها . وذكر وكيع عن إسماعيل بن أبي خالد عن الشعبي قال : أول من بايع رسول الله - صلى الله عليه وسلم - يوم الحديبية أبو سفيان الأسدي . وفي صحيح مسلم عن أبي الزبير عن جابر قال : كنا يوم الحديبية ألفا وأربعمائة ، فبايعناه وعمر آخذ بيده تحت الشجرة وهي سمرة ، وقال : بايعناه على ألا نفر ولم نبايعه على الموت وعنه أنه سمع جابرا يسأل : كم كانوا يوم الحديبية ؟ قال : كنا أربع عشرة مائة ، فبايعناه وعمر آخذ بيده تحت الشجرة وهي سمرة ، فبايعناه ، غير جد بن قيس الأنصاري اختبأ تحت بطن بعيره . وعن سالم بن أبي الجعد قال : سألت جابر بن عبد الله عن أصحاب الشجرة . فقال : لو كنا مائة ألف لكفانا ، كنا ألفا وخمسمائة . وفي رواية : كنا خمس عشرة مائة . وعن عبد الله بن أبي أوفى قال : كان أصحاب الشجرة ألفا وثلاثمائة ، وكانت أسلم ثمن المهاجرين . وعن يزيد بن أبي عبيد قال : قلت لسلمة : على أي شيء بايعتم رسول الله - صلى الله عليه وسلم - يوم الحديبية ؟ قال : على الموت . وعن البراء بن عازب قال : كتب علي - رضي الله عنه - الصلح بين النبي - صلى الله عليه وسلم - وبين المشركين يوم الحديبية ، فكتب : هذا ما كاتب عليه محمد رسول الله - صلى الله عليه وسلم - فقالوا : لا تكتب رسول الله ، فلو نعلم أنك رسول الله لم نقاتلك . فقال النبي - صلى الله عليه وسلم - لعلي : [ امحه ] . فقال : ما أنا بالذي أمحاه ، فمحاه النبي - صلى الله عليه وسلم - بيده . وكان فيما اشترطوا : أن يدخلوا مكة فيقيموا فيها ثلاثا ، ولا يدخلها بسلاح إلا جلبان السلاح . قلت لأبي إسحاق وما جلبان السلاح ؟ قال : القراب وما فيه . وعن أنس : أن قريشا صالحوا النبي - صلى الله عليه وسلم - فيهم سهيل بن عمرو ، فقال النبي - صلى الله عليه وسلم - لعلي : [ اكتب بسم الله الرحمن الرحيم ] فقال سهيل بن عمرو : أما بسم الله ، فما ندري ما بسم الله الرحمن الرحيم ولكن اكتب ما نعرف : باسمك اللهم . فقال : [ اكتب من محمد رسول الله ] قالوا : لو علمنا أنك رسوله لاتبعناك ولكن اكتب اسمك واسم أبيك . فقال النبي - صلى الله عليه وسلم - : [ اكتب من محمد بن عبد الله ] فاشترطوا على النبي - صلى الله عليه وسلم - : أن من جاء منكم لم نرده عليكم ، ومن جاءكم منا رددتموه علينا . فقالوا : يا رسول الله ، أنكتب هذا قال : [ نعم إنه من ذهب منا إليهم فأبعده الله ومن جاءنا منهم فسيجعل الله له فرجا ومخرجا ] .\nوعن أبي وائل قال : قام سهل بن حنيف يوم صفين فقال يا أيها الناس ، اتهموا أنفسكم ، لقد كنا مع رسول الله - صلى الله عليه وسلم - يوم الحديبية ولو نرى قتالا لقاتلنا ، وذلك في الصلح الذي كان بين رسول الله - صلى الله عليه وسلم - وبين المشركين . فجاء عمر بن الخطاب - - رضي الله عنه - فأتى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله ، ألسنا على حق وهم على باطل ؟ قال [ بلى ] قال : أليس قتلانا في الجنة وقتلاهم في النار ؟ قال [ بلى ] قال ففيم نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا وبينهم ؟ فقال [ يا بن الخطاب إني رسول الله ولن يضيعني الله أبدا ] قال : فانطلق عمر ، فلم يصبر متغيظا فأتى أبا بكر فقال : يا أبا بكر ، ألسنا على حق وهم على باطل ؟ قال بلى ، قال : أليس قتلانا في الجنة وقتلاهم في النار ؟ قال بلى . قال : فعلام نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا وبينهم ؟ فقال : يا بن الخطاب ، إنه رسول الله ولن يضيعه الله أبدا . قال : فنزل القرآن على رسول الله - صلى الله عليه وسلم - بالفتح ، فأرسل إلى عمر فأقرأه إياه ، فقال : يا رسول الله ، أوفتح هو ؟ قال [ نعم ] . فطابت نفسه ورجع .\nقوله تعالى : فعلم ما في قلوبهم من الصدق والوفاء ، قاله الفراء . وقال ابن جريج وقتادة : من الرضا بأمر البيعة على ألا يفروا . وقال مقاتل : من كراهة البيعة على أن يقاتلوا معه على الموت . فأنزل السكينة عليهم حتى بايعوا . وقيل : فعلم ما في قلوبهم من الكآبة بصد المشركين إياهم وتخلف رؤيا النبي - صلى الله عليه وسلم - عنهم ، إذ رأى أنه يدخل الكعبة ، حتى قال رسول الله - صلى الله عليه وسلم - : [ إنما ذلك رؤيا منام ] . وقال الصديق : لم يكن فيها الدخول في هذا العام .\nوالسكينة : الطمأنينة وسكون النفس إلى صدق الوعد . وقيل : الصبر . وأثابهم فتحا قريبا قال قتادة وابن أبي ليلى : فتح خيبر . وقيل : فتح مكة . وقرئ ( وآتاهم )\n                                    ",
        "saadi": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا ٨١\n                                        \n                                        \n                                        \n                                        يخبر تعالى بفضله ورحمته، برضاه عن المؤمنين إذ يبايعون الرسول صلى الله عليه وسلم تلك المبايعة التي بيضت وجوههم، واكتسبوا بها سعادة الدنيا والآخرة، وكان سبب هذه البيعة -التي يقال لها \"بيعة الرضوان\" لرضا الله عن المؤمنين فيها، ويقال لها \"بيعة أهل الشجرة\" - أن رسول الله صلى الله عليه وسلم لما دار الكلام بينه وبين المشركين يوم الحديبية في شأن مجيئه، وأنه لم يجئ لقتال أحد، وإنما جاء زائرا هذا البيت، معظما له، فبعث رسول الله صلى الله عليه وسلم عثمان بن عفان لمكة في ذلك، فجاء خبر غير صادق، أن عثمان قتله المشركون، فجمع رسول الله صلى الله عليه وسلم من معه من المؤمنين، وكانوا نحوا من ألف وخمسمائة، فبايعوه تحت شجرة على قتال المشركين، وأن لا يفروا حتى يموتوا، فأخبر تعالى أنه رضي عن المؤمنين في تلك الحال، التي هي من أكبر الطاعات وأجل القربات، { فَعَلِمَ مَا فِي قُلُوبِهِمْ } من الإيمان، { فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ } شكرا لهم على ما في قلوبهم، زادهم هدى، وعلم ما في قلوبهم من الجزع من تلك الشروط التي شرطها المشركون على رسوله، فأنزل عليهم السكينة تثبتهم، وتطمئن بها قلوبهم، { وَأَثَابَهُمْ فَتْحًا قَرِيبًا } وهو: فتح خيبر، لم يحضره سوى أهل الحديبية، فاختصوا بخيبر وغنائمها، جزاءا لهم، وشكرا على ما فعلوه من طاعة الله تعالى والقيام بمرضاته.\n                                    "
      },
      "originalText": "۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا ٨١"
    },
    {
      "number": 4602,
      "text": "وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا ۗ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 19,
      "juz": 26,
      "manzil": 6,
      "page": 513,
      "ruku": 448,
      "hizbQuarter": 205,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا ٩١\n                                    \n                                    \n                                    ( ومغانم كثيرة يأخذونها وكان الله عزيزا حكيما )\nقال ابن أبي حاتم : حدثنا أحمد بن محمد بن يحيى بن سعيد القطان ، حدثنا عبيد الله بن موسى ، أخبرنا موسى ، أخبرنا موسى - يعني ابن عبيدة - حدثني إياس بن سلمة ، عن أبيه ، قال : بينما نحن قائلون . إذ نادى منادي رسول الله - صلى الله عليه وسلم - : أيها الناس ، البيعة البيعة ، نزل روح القدس . قال : فثرنا إلى رسول الله - صلى الله عليه وسلم - وهو تحت شجرة سمرة فبايعناه ، فذلك قول الله تعالى : ( لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة ) [ قال ] : فبايع لعثمان بإحدى يديه على الأخرى ، فقال الناس : هنيئا لابن عفان ، طوف بالبيت ونحن هاهنا . فقال رسول الله - صلى الله عليه وسلم - : \" لو مكث كذا كذا سنة ما طاف حتى أطوف \" .\n                                    ",
        "qortoby": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا ٩١\n                                    \n                                    \n                                    ومغانم كثيرة يأخذونها يعني أموال خيبر ، وكانت خيبر ذات عقار وأموال ، وكانت بين الحديبية ومكة . ف ( مغانم ) على هذا بدل من ( فتحا قريبا ) والواو مقحمة . وقيل : ومغانم فارس والروم .\n                                    ",
        "saadi": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا ٩١\n                                        \n                                        \n                                        \n                                        { وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا } أي: له العزة والقدرة، التي قهر بها الأشياء، فلو شاء لانتصر من الكفار في كل وقعة تكون بينهم وبين المؤمنين، ولكنه حكيم، يبتلي بعضهم ببعض، ويمتحن المؤمن بالكافر.\n                                    "
      },
      "originalText": "وَمَغَانِمَ كَثِيرَةٗ يَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا ٩١"
    },
    {
      "number": 4603,
      "text": "وَعَدَكُمُ اللَّهُ مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا فَعَجَّلَ لَكُمْ هَٰذِهِ وَكَفَّ أَيْدِيَ النَّاسِ عَنْكُمْ وَلِتَكُونَ آيَةً لِلْمُؤْمِنِينَ وَيَهْدِيَكُمْ صِرَاطًا مُسْتَقِيمًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 20,
      "juz": 26,
      "manzil": 6,
      "page": 513,
      "ruku": 448,
      "hizbQuarter": 205,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٠٢\n                                    \n                                    \n                                    قال مجاهد في قوله : ( وعدكم الله مغانم كثيرة تأخذونها ) : هي جميع المغانم إلى اليوم ، ( فعجل لكم هذه ) يعني : فتح خيبر .\nوروى العوفي عن ابن عباس : ( فعجل لكم هذه ) يعني : صلح الحديبية .\n( وكف أيدي الناس عنكم ) أي : لم ينلكم سوء مما كان أعداؤكم أضمروه لكم من المحاربة والقتال . وكذلك كف أيدي الناس [ عنكم ] الذين خلفتموهم وراء أظهركم عن عيالكم وحريمكم ، ( ولتكون آية للمؤمنين ) أي : يعتبرون بذلك ، فإن الله حافظهم وناصرهم على سائر الأعداء ، مع قلة عددهم ، وليعلموا بصنيع الله هذا بهم أنه العليم بعواقب الأمور ، وأن الخيرة فيما يختاره لعباده المؤمنين وإن كرهوه في الظاهر ، كما قال : ( وعسى أن تكرهوا شيئا وهو خير لكم ) [ البقرة : 216 ] .\n( ويهديكم صراطا مستقيما ) أي : بسبب انقيادكم لأمره واتباعكم طاعته ، وموافقتكم رسوله .\n                                    ",
        "qortoby": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٠٢\n                                    \n                                    \n                                    قوله تعالى : وعدكم الله مغانم كثيرة تأخذونها قال ابن عباس ومجاهد . إنها المغانم التي تكون إلى يوم القيامة . وقال ابن زيد : هي مغانم خيبر . فعجل لكم هذه أي خيبر ، قاله مجاهد . وقال ابن عباس : عجل لكم صلح الحديبية . وكف أيدي الناس عنكم يعني أهل مكة ، كفهم عنكم بالصلح . وقال قتادة : كف أيدي اليهود عن المدينة بعد خروج النبي - صلى الله عليه وسلم - إلى الحديبية وخيبر . وهو اختيار الطبري ; لأن كف أيدي المشركين بالحديبية مذكور في قوله : وهو الذي كف أيديهم عنكم . وقال ابن عباس : في كف أيدي الناس عنكم يعني عيينة بن حصن الفزاري وعوف بن مالك النضري ومن كان معهما ، إذ جاءوا لينصروا أهل خيبر والنبي - صلى الله عليه وسلم - محاصر لهم ، فألقى الله - عز وجل - في قلوبهم الرعب وكفهم عن المسلمين ولتكون آية للمؤمنين أي ولتكون هزيمتهم وسلامتكم آية للمؤمنين ، فيعلموا أن الله يحرسهم في مشهدهم ومغيبهم . وقيل : أي : لتكون كف أيديهم عنكم آية للمؤمنين . وقيل : أي : ولتكون هذه التي عجلها لكم آية للمؤمنين على صدقك حيث وعدتهم أن يصيبوها . والواو في ( ولتكون ) مقحمة عند الكوفيين . وقال البصريون : عاطفة على مضمر ، أي : وكف أيدي الناس عنكم لتشكروه ولتكون آية للمؤمنين . ويهديكم صراطا مستقيما أي يزيدكم هدى ، أو يثبتكم على الهداية .\n                                    ",
        "saadi": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٠٢\n                                        \n                                        \n                                        \n                                        { وَعَدَكُمُ اللَّهُ مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا } وهذا يشمل كل غنيمة غنمها المسلمين إلى يوم القيامة، { فَعَجَّلَ لَكُمْ هَذِهِ } أي: غنيمة خيبر أي: فلا تحسبوها وحدها، بل ثم شيء كثير من الغنائم سيتبعها، { و } احمدوا الله إذ { كف أَيْدِي النَّاسِ } القادرين على قتالكم، الحريصين عليه { عَنْكُمْ } فهي نعمة، وتخفيف عنكم.\n{ وَلِتَكُونَ } هذه الغنيمة { آيَةً لِلْمُؤْمِنِينَ } يستدلون بها على خبر الله الصادق، ووعده الحق، وثوابه للمؤمنين، وأن الذي قدرها سيقدر غيرها، { وَيَهْدِيَكُمْ } بما يقيض لكم من الأسباب { صِرَاطًا مُسْتَقِيمًا } من العلم والإيمان والعمل.\n                                    "
      },
      "originalText": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِيرَةٗ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَٰذِهِۦ وَكَفَّ أَيۡدِيَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَايَةٗ لِّلۡمُؤۡمِنِينَ وَيَهۡدِيَكُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٠٢"
    },
    {
      "number": 4604,
      "text": "وَأُخْرَىٰ لَمْ تَقْدِرُوا عَلَيْهَا قَدْ أَحَاطَ اللَّهُ بِهَا ۚ وَكَانَ اللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 21,
      "juz": 26,
      "manzil": 6,
      "page": 513,
      "ruku": 448,
      "hizbQuarter": 205,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ١٢\n                                    \n                                    \n                                    وقوله : ( وأخرى لم تقدروا عليها قد أحاط الله بها وكان الله على كل شيء قديرا ) أي : وغنيمة أخرى وفتحا آخر معينا لم تكونوا تقدرون عليها ، قد يسرها الله عليكم ، وأحاط بها لكم ، فإنه تعالى يرزق عباده المتقين له من حيث لا يحتسبون .\nوقد اختلف المفسرون في هذه الغنيمة ، ما المراد بها ؟ فقال العوفي عن ابن عباس : هي خيبر . وهذا على قوله في قوله تعالى : ( فعجل لكم هذه ) إنها صلح الحديبية . وقاله الضحاك ، وابن إسحاق ، وعبد الرحمن بن زيد بن أسلم .\nوقال قتادة : هي مكة . واختاره ابن جرير .\nوقال ابن أبي ليلى ، والحسن البصري : هي فارس والروم .\nوقال مجاهد : هي كل فتح وغنيمة إلى يوم القيامة .\nوقال أبو داود الطيالسي : حدثنا شعبة ، عن سماك الحنفي ، عن ابن عباس : ( وأخرى لم تقدروا عليها قد أحاط الله بها ) قال : هذه الفتوح التي تفتح إلى اليوم .\n                                    ",
        "qortoby": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ١٢\n                                    \n                                    \n                                    قوله تعالى : وأخرى لم تقدروا عليها قد أحاط الله بها وكان الله على كل شيء قديرا .\nقوله تعالى : ( وأخرى ) أخرى معطوفة على هذه ، أي : فعجل لكم هذه المغانم ومغانم أخرى . لم تقدروا عليها قد أحاط الله بها قال ابن عباس : هي الفتوح التي فتحت على المسلمين ، كأرض فارس والروم ، وجميع ما فتحه المسلمون . وهو قول الحسن ومقاتل وابن أبي ليلى . وعن ابن عباس أيضا والضحاك وابن زيد وابن إسحاق : هي خيبر ، وعدها الله نبيه قبل أن يفتحها ، ولم يكونوا يرجونها حتى أخبرهم الله بها . وعن الحسن أيضا وقتادة : هو فتح مكة . وقال عكرمة : حنين ; لأنه قال : لم تقدروا عليها وهذا يدل على تقدم محاولة لها وفوات درك المطلوب في الحال كما كان في مكة ، قاله القشيري . وقال مجاهد : هي ما يكون إلى يوم القيامة . ومعنى قد أحاط الله بها : أي : أعدها لكم . فهي كالشيء الذي قد أحيط به من جوانبه ، فهو محصور لا يفوت ، فأنتم وإن لم تقدروا عليها في الحال فهي محبوسة عليكم لا تفوتكم . وقيل : أحاط الله بها علم أنها ستكون لكم ، كما قال : وأن الله قد أحاط بكل شيء علما . وقيل : حفظها الله عليكم . ليكون فتحها لكم . وكان الله على كل شيء قديرا\n\n                                    ",
        "saadi": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ١٢\n                                        \n                                        \n                                        \n                                        { وَأُخْرَى } أي: وعدكم أيضا غنيمة أخرى { لَمْ تَقْدِرُوا عَلَيْهَا } وقت هذا الخطاب، { قَدْ أَحَاطَ اللَّهُ بِهَا } أي: هو قادر عليها، وتحت تدبيره وملكه، وقد وعدكموها، فلا بد من وقوع ما وعد به، لكمال اقتدار الله تعالى، ولهذا قال: { وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرًا }\n                                    "
      },
      "originalText": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا ١٢"
    },
    {
      "number": 4605,
      "text": "وَلَوْ قَاتَلَكُمُ الَّذِينَ كَفَرُوا لَوَلَّوُا الْأَدْبَارَ ثُمَّ لَا يَجِدُونَ وَلِيًّا وَلَا نَصِيرًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 22,
      "juz": 26,
      "manzil": 6,
      "page": 513,
      "ruku": 448,
      "hizbQuarter": 205,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا ٢٢\n                                    \n                                    \n                                    وقوله : ( ولو قاتلكم الذين كفروا لولوا الأدبار ثم لا يجدون وليا ولا نصيرا ) يقول تعالى مبشرا لعباده المؤمنين : بأنه لو ناجزهم المشركون لنصر الله رسوله وعباده المؤمنين عليهم ، ولانهزم جيش الكفار فارا مدبرا لا يجدون وليا ولا نصيرا ; لأنهم محاربون لله ولرسوله ولحزبه المؤمنين .\n                                    ",
        "qortoby": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا ٢٢\n                                    \n                                    \n                                    قوله تعالى : ولو قاتلكم الذين كفروا لولوا الأدبار قال قتادة : يعني كفار قريش في الحديبية . وقيل : ولو قاتلكم غطفان وأسد والذين أرادوا نصرة أهل خيبر ، لكانت الدائرة عليهم . ثم لا يجدون وليا ولا نصيرا\n                                    ",
        "saadi": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا ٢٢\n                                        \n                                        \n                                        \n                                        هذه بشارة من الله لعباده المؤمنين، بنصرهم على أعدائهم الكافرين، وأنهم لو قابلوهم وقاتلوهم { لَوَلَّوُا الْأَدْبَارَ ثُمَّ لَا يَجِدُونَ وَلِيًّا } يتولى أمرهم، { وَلَا نَصِيرًا } ينصرهم ويعينهم على قتالكم، بل هم مخذولون مغلوبون.\n                                    "
      },
      "originalText": "وَلَوۡ قَٰتَلَكُمُ ٱلَّذِينَ كَفَرُواْ لَوَلَّوُاْ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يَجِدُونَ وَلِيّٗا وَلَا نَصِيرٗا ٢٢"
    },
    {
      "number": 4606,
      "text": "سُنَّةَ اللَّهِ الَّتِي قَدْ خَلَتْ مِنْ قَبْلُ ۖ وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 23,
      "juz": 26,
      "manzil": 6,
      "page": 513,
      "ruku": 448,
      "hizbQuarter": 205,
      "sajda": false,
      "tafsier": {
        "ibnkther": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا ٣٢\n                                    \n                                    \n                                    ثم قال : ( سنة الله التي قد خلت من قبل ولن تجد لسنة الله تبديلا ) أي : هذه سنة الله وعادته في خلقه ، ما تقابل الكفر والإيمان في موطن فيصل إلى نصر الله الإيمان على الكفر ، فرفع الحق ووضع الباطل ، كما فعل تعالى يوم بدر بأوليائه المؤمنين نصرهم على أعدائه من المشركين ، مع قلة عدد المسلمين وعددهم ، وكثرة المشركين وعددهم .\n                                    ",
        "qortoby": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا ٣٢\n                                    \n                                    \n                                    سنة الله التي قد خلت من قبل يعني طريقة الله وعاداته السالفة نصر أوليائه على أعدائه . وانتصب ( سنة ) على المصدر . وقيل : سنة الله أي : كسنة الله . والسنة الطريقة والسيرة . قال :\nفلا تجزعن من سيرة أنت سرتها فأول راض سنة من يسيرها\nوالسنة أيضا : ضرب من تمر المدينة . ولن تجد لسنة الله تبديلا\n                                    ",
        "saadi": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا ٣٢\n                                        \n                                        \n                                        \n                                        وهذه سنة الله في الأمم السابقة، أن جند الله هم الغالبون، { وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا }\n                                    "
      },
      "originalText": "سُنَّةَ ٱللَّهِ ٱلَّتِي قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِيلٗا ٣٢"
    }
  ]
}