{
  "number": 515,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 4612,
      "text": "مُحَمَّدٌ رَسُولُ اللَّهِ ۚ وَالَّذِينَ مَعَهُ أَشِدَّاءُ عَلَى الْكُفَّارِ رُحَمَاءُ بَيْنَهُمْ ۖ تَرَاهُمْ رُكَّعًا سُجَّدًا يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا ۖ سِيمَاهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ ۚ ذَٰلِكَ مَثَلُهُمْ فِي التَّوْرَاةِ ۚ وَمَثَلُهُمْ فِي الْإِنْجِيلِ كَزَرْعٍ أَخْرَجَ شَطْأَهُ فَآزَرَهُ فَاسْتَغْلَظَ فَاسْتَوَىٰ عَلَىٰ سُوقِهِ يُعْجِبُ الزُّرَّاعَ لِيَغِيظَ بِهِمُ الْكُفَّارَ ۗ وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنْهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا",
      "surah": {
        "number": 48,
        "name": "سورة الفتح",
        "englishName": "Al-Fath",
        "englishNameTranslation": "The Victory",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 29,
      "juz": 26,
      "manzil": 6,
      "page": 515,
      "ruku": 449,
      "hizbQuarter": 205,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡ‍َٔهُۥ فَ‍َٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا ٩٢\n                                    \n                                    \n                                    يخبر تعالى عن محمد صلوات الله عليه ، أنه رسوله حقا بلا شك ولا ريب ، فقال : ( محمد رسول الله ) ، وهذا مبتدأ وخبر ، وهو مشتمل على كل وصف جميل ، ثم ثنى بالثناء على أصحابه فقال : ( والذين معه أشداء على الكفار رحماء بينهم ) ، كما قال تعالى : ( فسوف يأتي الله بقوم يحبهم ويحبونه أذلة على المؤمنين أعزة على الكافرين ) [ المائدة : 54 ] وهذه صفة المؤمنين أن يكون أحدهم شديدا عنيفا على الكفار ، رحيما برا بالأخيار ، غضوبا عبوسا في وجه الكافر ، ضحوكا بشوشا في وجه أخيه المؤمن ، كما قال تعالى : ( يا أيها الذين آمنوا قاتلوا الذين يلونكم من الكفار وليجدوا فيكم غلظة ) [ التوبة : 123 ] ، وقال النبي - صلى الله عليه وسلم - : \" مثل المؤمنين في توادهم وتراحمهم كمثل الجسد الواحد ، إذا اشتكى منه عضو تداعى له سائر الجسد بالحمى والسهر \" ، وقال : \" المؤمن للمؤمن كالبنيان يشد بعضه بعضا \" وشبك بين أصابعه كلا الحديثين في الصحيح .\nوقوله : ( تراهم ركعا سجدا يبتغون فضلا من الله ورضوانا ) : وصفهم بكثرة العمل وكثرة الصلاة ، وهي خير الأعمال ، ووصفهم بالإخلاص فيها لله - عز وجل - والاحتساب عند الله جزيل الثواب ، وهو الجنة المشتملة على فضل الله ، وهو سعة الرزق عليهم ، ورضاه تعالى ، عنهم وهو أكبر من الأول ، كما قال : ( ورضوان من الله أكبر ) [ التوبة : 72 ] .\nوقوله : ( سيماهم في وجوههم من أثر السجود ) : قال علي بن أبي طلحة ، عن ابن عباس : ( سيماهم في وجوههم ) يعني : السمت الحسن .\nوقال مجاهد وغير واحد : يعني الخشوع والتواضع .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا علي بن محمد الطنافسي ، حدثنا حسين الجعفي ، عن زائدة ، عن منصور عن مجاهد : ( سيماهم في وجوههم من أثر السجود ) قال : الخشوع ، قلت : ما كنت أراه إلا هذا الأثر في الوجه ، فقال : ربما كان بين عيني من هو أقسى قلبا من فرعون .\nوقال السدي : الصلاة تحسن وجوههم .\nوقال بعض السلف : من كثرت صلاته بالليل حسن وجهه بالنهار .\nوقد أسنده ابن ماجه في سننه ، عن إسماعيل بن محمد الطلحي ، عن ثابت بن موسى ، عن شريك ، عن الأعمش ، عن أبي سفيان ، عن جابر قال : قال رسول الله - صلى الله عليه وسلم - : \" من كثرت صلاته بالليل حسن وجهه بالنهار \" والصحيح أنه موقوف .\nوقال بعضهم : إن للحسنة نورا في القلب ، وضياء في الوجه ، وسعة في الرزق ، ومحبة في قلوب الناس .\nوقال أمير المؤمنين عثمان : ما أسر أحد سريرة إلا أبداها الله على صفحات وجهه ، وفلتات لسانه .\nوالغرض أن الشيء الكامن في النفس يظهر على صفحات الوجه ، فالمؤمن إذا كانت سريرته صحيحة مع الله أصلح الله ظاهره للناس ، كما روي عن عمر بن الخطاب - رضي الله عنه - أنه قال : من أصلح سريرته أصلح الله علانيته .\nوقال أبو القاسم الطبراني : حدثنا محمود بن محمد المروزي ، حدثنا حامد بن آدم المروزي ، حدثنا الفضل بن موسى ، عن محمد بن عبيد الله العرزمي ، عن سلمة بن كهيل ، عن جندب بن سفيان البجلي قال : قال النبي - صلى الله عليه وسلم - : \" ما أسر أحد سريرة إلا ألبسه الله رداءها ، إن خيرا فخير ، وإن شرا فشر \" ، العرزمي متروك .\nوقال الإمام أحمد : حدثنا حسن بن موسى ، حدثنا ابن لهيعة ، حدثنا دراج ، عن أبي الهيثم ، عن أبي سعيد ، عن رسول الله - صلى الله عليه وسلم - أنه قال : \" لو أن أحدكم يعمل في صخرة صماء ليس لها باب ولا كوة ، لخرج عمله للناس كائنا ما كان \" .\nوقال الإمام أحمد [ أيضا ] : حدثنا حسن ، حدثنا زهير ، حدثنا قابوس بن أبي ظبيان : أن أباه حدثه عن ابن عباس ، عن النبي - صلى الله عليه وسلم - قال : \" إن الهدي الصالح ، والسمت الصالح ، والاقتصاد جزء من خمسة وعشرين جزءا من النبوة \" ورواه أبو داود عن عبد الله بن محمد النفيلي ، عن زهير ، به .\nفالصحابة [ رضي الله عنهم ] خلصت نياتهم وحسنت أعمالهم ، فكل من نظر إليهم أعجبوه في سمتهم وهديهم .\nوقال مالك ، رحمه الله : بلغني أن النصارى كانوا إذا رأوا الصحابة الذين فتحوا الشام يقولون : \" والله لهؤلاء خير من الحواريين فيما بلغنا \" . وصدقوا في ذلك ، فإن هذه الأمة معظمة في الكتب المتقدمة ، وأعظمها وأفضلها أصحاب رسول الله - صلى الله عليه وسلم - وقد نوه الله بذكرهم في الكتب المنزلة والأخبار المتداولة ; ولهذا قال هاهنا : ( ذلك مثلهم في التوراة ) ، ثم قال : ( ومثلهم في الإنجيل كزرع أخرج شطأه [ فآزره فاستغلظ فاستوى على سوقه ) : ( أخرج شطأه ] ) أي : فراخه ، ( فآزره ) أي : شده ( فاستغلظ ) أي : شب وطال ، ( فاستوى على سوقه يعجب الزراع ) أي : فكذلك أصحاب محمد - صلى الله عليه وسلم - آزروه وأيدوه ونصروه فهم معه كالشطء مع الزرع ، ( ليغيظ بهم الكفار ) .\nومن هذه الآية انتزع الإمام مالك - رحمه الله ، في رواية عنه - بتكفير الروافض الذين يبغضون الصحابة ، قال : لأنهم يغيظونهم ، ومن غاظ الصحابة فهو كافر لهذه الآية . ووافقه طائفة من العلماء على ذلك . والأحاديث في فضائل الصحابة والنهي عن التعرض لهم بمساءة كثيرة ، ويكفيهم ثناء الله عليهم ، ورضاه عنهم .\nثم قال : ( وعد الله الذين آمنوا وعملوا الصالحات منهم ) من \" هذه لبيان الجنس ، ( مغفرة ) أي : لذنوبهم . ( وأجرا عظيما ) أي : ثوابا جزيلا ورزقا كريما ، ووعد الله حق وصدق ، لا يخلف ولا يبدل ، وكل من اقتفى أثر الصحابة فهو في حكمهم ، ولهم الفضل والسبق والكمال الذي لا يلحقهم فيه أحد من هذه الأمة رضي الله عنهم وأرضاهم ، وجعل جنات الفردوس مأواهم ، وقد فعل .\nقال مسلم في صحيحه : حدثنا يحيى بن يحيى ، حدثنا أبو معاوية ، عن الأعمش ، عن أبي صالح ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" لا تسبوا أصحابي ، فوالذي نفسي بيده لو أن أحدكم أنفق مثل أحد ذهبا ما أدرك مد أحدهم ولا نصيفه \" .\nآخر تفسير سورة الفتح ، ولله الحمد والمنة .\n                                    ",
        "qortoby": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡ‍َٔهُۥ فَ‍َٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا ٩٢\n                                    \n                                    \n                                    قوله تعالى : محمد رسول الله والذين معه أشداء على الكفار رحماء بينهم تراهم ركعا سجدا يبتغون فضلا من الله ورضوانا سيماهم في وجوههم من أثر السجود ذلك مثلهم في التوراة ومثلهم في الإنجيل كزرع أخرج شطأه فآزره فاستغلظ فاستوى على سوقه يعجب الزراع ليغيظ بهم الكفار وعد الله الذين آمنوا وعملوا الصالحات منهم مغفرة وأجرا عظيما .\nفيه خمس مسائل : الأولى : قوله تعالى : محمد رسول الله محمد مبتدأ و ( رسول ) خبره . وقيل : محمد ابتداء و ( رسول ) الله نعته .\nوالذين معه عطف على المبتدأ ، والخبر فيما بعده ، فلا يوقف على هذا التقدير على رسول الله وعلى الأول يوقف على رسول الله ; لأن صفاته - عليه السلام - تزيد على ما وصف أصحابه ، فيكون محمد ابتداء ورسول الله الخبر والذين معه ابتداء ثان . وأشداء خبره ورحماء خبر ثان . وكون الصفات في جملة أصحاب النبي - صلى الله عليه وسلم - هو الأشبه . وقيل : المراد بالذين معه جميع المؤمنين .\nرحماء بينهم أي يرحم بعضهم بعضا . وقيل : متعاطفون متوادون . وقرأ الحسن أشداء على الكفار رحماء بينهم بالنصب على الحال ، كأنه قال : والذين معه في حال شدتهم على الكفار وتراحمهم بينهم . تراهم ركعا سجدا إخبار عن كثرة صلاتهم . يبتغون فضلا من الله ورضوانا أي يطلبون الجنة ورضا الله تعالى .\nالثانية : قوله تعالى : سيماهم في وجوههم من أثر السجود السيما العلامة ، وفيها لغتان : المد والقصر ، أي : لاحت علامات التهجد بالليل وأمارات السهر . وفي سنن ابن ماجه قال : حدثنا إسماعيل بن محمد الطلحي قال حدثنا ثابت بن موسى أبو يزيد عن شريك عن الأعمش عن أبي سفيان عن جابر قال : قال رسول الله - صلى الله عليه وسلم - : من كثرت صلاته بالليل حسن وجهه بالنهار . وقال ابن العربي : ودسه قوم في حديث النبي - صلى الله عليه وسلم - على وجه الغلط ، وليس عن النبي - صلى الله عليه وسلم - فيه ذكر بحرف . وقد روى ابن وهب عن مالك سيماهم في وجوههم من أثر السجود ذلك مما يتعلق بجباههم من الأرض عند السجود ، وبه قال سعيد بن جبير . وفي الحديث الصحيح عن النبي - صلى الله عليه وسلم - : صلى صبيحة إحدى وعشرين من رمضان وقد وكف المسجد وكان على عريش ، فانصرف النبي - صلى الله عليه وسلم - من صلاته وعلى جبهته وأرنبته أثر الماء والطين . وقال الحسن : هو بياض يكون في الوجه يوم القيامة . وقاله سعيد بن جبير أيضا ، ورواه العوفي عن ابن عباس ، قاله الزهري . وفي الصحيح عن رسول الله - صلى الله عليه وسلم - من حديث أبي هريرة ، وفيه : [ حتى إذا فرغ الله من القضاء بين العباد وأراد أن يخرج برحمته من أراد من أهل النار أمر الملائكة أن يخرجوا من النار من كان لا يشرك بالله شيئا ممن أراد الله أن يرحمه ممن يقول لا إله إلا الله فيعرفونهم في النار بأثر السجود تأكل النار ابن آدم إلا أثر السجود حرم الله على النار أن تأكل أثر السجود ] . وقال شهر بن حوشب : يكون موضع السجود من وجوههم كالقمر ليلة البدر . وقال ابن عباس ومجاهد : السيما في الدنيا وهو السمت الحسن . وعن مجاهد أيضا : هو الخشوع والتواضع . قال منصور : سألت مجاهدا عن قوله تعالى : سيماهم في وجوههم أهو أثر يكون بين عيني الرجل ؟ قال لا ، ربما يكون بين عيني الرجل مثل ركبة العنز وهو أقسى قلبا من الحجارة ولكنه نور في وجوههم من الخشوع . وقال ابن جريج : هو الوقار والبهاء . وقال شمر بن عطية : هو صفرة الوجه من قيام الليل . قال الحسن : إذا رأيتهم حسبتهم مرضى وما هم بمرضى . وقال الضحاك : أما إنه ليس بالندب في وجوههم ولكنه الصفرة . وقال سفيان الثوري : يصلون بالليل فإذا أصبحوا رئي ذلك في وجوههم ، بيانه قوله - صلى الله عليه وسلم - : من كثرت صلاته بالليل حسن وجهه بالنهار . وقد مضى القول فيه آنفا . وقال عطاء الخراساني : دخل في هذه الآية كل من حافظ على الصلوات الخمس .\nالثالثة : قوله تعالى : ذلك مثلهم في التوراة ومثلهم في الإنجيل قال الفراء : فيه وجهان ، إن شئت قلت المعنى ذلك مثلهم في التوراة وفي الإنجيل أيضا ، كمثلهم في القرآن ، فيكون الوقف على الإنجيل وإن شئت قلت : تمام الكلام ذلك مثلهم في التوراة ، ثم ابتدأ فقال : ومثلهم في الإنجيل . وكذا قال ابن عباس وغيره : هما مثلان ، أحدهما في التوراة والآخر في الإنجيل ، فيوقف على هذا على التوراة وقال مجاهد : هو مثل واحد ، يعني أن هذه صفتهم في التوراة والإنجيل ، فلا يوقف على التوراة على هذا ، ويوقف على الإنجيل ويبتدئ كزرع أخرج شطأه على معنى وهم كزرع . وشطأه يعني فراخه وأولاده ، قاله ابن زيد وغيره . وقال مقاتل : هو نبت واحد ، فإذا خرج ما بعده فقد شطأه . قال الجوهري : شطء الزرع والنبات فراخه ، والجمع أشطاء . وقد أشطأ الزرع خرج شطؤه . قال الأخفش في قوله : أخرج شطأه أي : طرفه . وحكاه الثعلبي عن الكسائي . وقال الفراء : أشطأ الزرع فهو مشطئ إذا خرج . قال الشاعر :\nأخرج الشطء على وجه الثرى ومن الأشجار أفنان الثمر\nالزجاج : أخرج شطأه أي : نباته . وقيل : إن الشطء شوك السنبل ، والعرب أيضا تسميه : السفا ، وهو شوك البهمى ، قاله قطرب . وقيل : إنه السنبل ، فيخرج من الحبة عشر سنبلات وتسع وثمان ، قال الفراء ، حكاه الماوردي . وقرأ ابن كثير وابن ذكوان ( شطأه ) بفتح الطاء ، وأسكن الباقون . وقرأ أنس ونصر بن عاصم وابن وثاب ( شطاه ) مثل عصاه . وقرأ الجحدري وابن أبي إسحاق ( شطه ) بغير همز ، وكلها لغات فيها .\nوهذا مثل ضربه الله تعالى لأصحاب النبي - صلى الله عليه وسلم - ، يعني أنهم يكونون قليلا ثم يزدادون ويكثرون ، فكان النبي - صلى الله عليه وسلم - حين بدأ بالدعاء إلى دينه ضعيفا فأجابه الواحد بعد الواحد حتى قوي أمره ، كالزرع يبدو بعد البذر ضعيفا فيقوى حالا بعد حال حتى يغلظ نباته وأفراخه . فكان هذا من أصح مثل وأقوى بيان . وقال قتادة : مثل أصحاب محمد - صلى الله عليه وسلم - في الإنجيل مكتوب أنه سيخرج من قوم ينبتون نبات الزرع ، يأمرون بالمعروف وينهون عن المنكر .\nفآزره أي قواه وأعانه وشده ، أي : قوى الشطء الزرع . وقيل : بالعكس ، أي : قوى الزرع الشطء . وقراءة العامة آزره بالمد . وقرأ ابن ذكوان وأبو حيوة وحميد بن قيس ( فأزره ) مقصورة ، مثل فعله . والمعروف المد . قال امرؤ القيس :\nبمحنية قد آزر الضال نبتها مجر جيوش غانمين وخيب\nفاستوى على سوقه على عوده الذي يقوم عليه فيكون ساقا له . والسوق : جمع الساق . يعجب الزراع أي يعجب هذا الزرع زراعه . وهو مثل كما بينا ، فالزرع محمد - صلى الله عليه وسلم - ، والشطء أصحابه ، كانوا قليلا فكثروا ، وضعفاء فقووا ، قاله الضحاك وغيره . ليغيظ بهم الكفار اللام متعلقة بمحذوف ، أي : فعل الله هذا لمحمد - صلى الله عليه وسلم - وأصحابه ليغيظ بهم الكفار .\nالرابعة : قوله تعالى : وعد الله الذين آمنوا أي وعد الله هؤلاء الذين مع محمد ، وهم المؤمنون الذين أعمالهم صالحة . و ( من ) في قوله : منهم مبعضة لقوم من الصحابة دون قوم ، ولكنها عامة مجنسة ، مثل قوله تعالى : فاجتنبوا الرجس من الأوثان لا يقصد للتبعيض لكنه يذهب إلى الجنس ، أي : فاجتنبوا الرجس من جنس الأوثان ، إذ كان الرجس يقع من أجناس شتى ، منها الزنى والربا وشرب الخمر والكذب ، فأدخل ( من ) يفيد بها الجنس وكذا منهم ، أي : من هذا الجنس ، يعني جنس الصحابة . ويقال : أنفق نفقتك من الدراهم ، أي : اجعل نفقتك هذا الجنس . وقد يخصص أصحاب محمد - صلى الله عليه وسلم - بوعد المغفرة تفضيلا لهم ، وإن وعد الله جميع المؤمنين المغفرة . وفي الآية جواب آخر : وهو أن ( من ) مؤكدة للكلام ، والمعنى وعدهم الله كلهم مغفرة وأجرا عظيما . فجرى مجرى قول العربي : قطعت من الثوب قميصا ، يريد قطعت الثوب كله قميصا . و ( من ) لم يبعض شيئا . وشاهد هذا من القرآن وننزل من القرآن ما هو شفاء معناه وننزل القرآن شفاء ; لأن كل حرف منه يشفي ، وليس الشفاء مختصا به بعضه دون بعض . على أن من اللغويين من يقول : ( من ) مجنسة ، تقديرها ننزل الشفاء من جنس القرآن ، ومن جهة القرآن ، ومن ناحية القرآن . قال زهير :\nأمن أم أوفى دمنة لم تكلم\nأراد من ناحية أم أوفى دمنة ، أم من منازلها دمنة . وقال الآخر [ الأعشى ] :\nأخو رغائب يعطيها ويسألها يأبى الظلامة منه النوفل الزفر\nف ( من ) لم تبعض شيئا ، إذ كان المقصد يأبى الظلامة لأنه نوفل زفر . والنوفل : الكثير العطاء . والزفر : حامل الأثقال والمؤن عن الناس .\nالخامسة : روى أبو عروة الزبيري من ولد الزبير : كنا عند مالك بن أنس ، فذكروا رجلا ينتقص أصحاب رسول الله - صلى الله عليه وسلم - ، فقرأ مالك هذه الآية محمد رسول الله والذين معه حتى بلغ يعجب الزراع ليغيظ بهم الكفار فقال مالك : من أصبح من الناس في قلبه غيظ على أحد من أصحاب رسول الله - صلى الله عليه وسلم - فقد أصابته هذه الآية ، ذكره الخطيب أبو بكر .\nقلت : لقد أحسن مالك في مقالته وأصاب في تأويله . فمن نقص واحدا منهم أو طعن عليه في روايته فقد رد على الله رب العالمين ، وأبطل شرائع المسلمين ، قال الله تعالى : محمد رسول الله والذين معه أشداء على الكفار الآية . وقال : لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة إلى غير ذلك من الآي التي تضمنت الثناء عليهم ، والشهادة لهم بالصدق والفلاح ، قال الله تعالى : رجال صدقوا ما عاهدوا الله عليه وقال : للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم يبتغون فضلا من الله ورضوانا إلى قوله أولئك هم الصادقون ، ثم قال عز من قائل : والذين تبوءوا الدار والإيمان من قبلهم إلى قوله فأولئك هم المفلحون . وهذا كله مع علمه تبارك وتعالى بحالهم ومآل أمرهم ، وقال رسول الله - صلى الله عليه وسلم - : خير الناس قرني ثم الذين يلونهم وقال : لا تسبوا أصحابي فلو أن أحدكم أنفق مثل أحد ذهبا لم يدرك مد أحدهم ولا نصيفه خرجهما البخاري . وفي حديث آخر : فلو أن أحدكم أنفق ما في الأرض لم يدرك مد أحدهم ولا نصيفه .\nقال أبو عبيد : معناه لم يدرك مد أحدهم إذا تصدق به ولا نصف المد ، فالنصيف هو النصف هنا . وكذلك يقال للعشر عشير ، وللخمس خميس ، وللتسع تسيع ، وللثمن ثمين ، وللسبع سبيع ، وللسدس سديس ، وللربع ربيع . ولم تقل العرب للثلث ثليث . وفي البزار عن جابر مرفوعا صحيحا : [ إن الله اختار أصحابي على العالمين سوى النبيين والمرسلين واختار لي من أصحابي أربعة - يعني أبا بكر وعمر وعثمان وعليا - فجعلهم أصحابي ] . وقال : [ في أصحابي كلهم خير ] . وروى عويم بن ساعدة قال : قال رسول الله - صلى الله عليه وسلم - : [ إن الله - عز وجل - اختارني واختار لي أصحابي فجعل لي منهم وزراء وأختانا وأصهارا فمن سبهم فعليه لعنة الله والملائكة والناس أجمعين ولا يقبل الله منه يوم القيامة صرفا ولا عدلا ] . والأحاديث بهذا المعنى كثيرة ، فحذار من الوقوع في أحد منهم ، كما فعل من طعن في الدين فقال : إن المعوذتين ليستا من القرآن ، وما صح حديث عن رسول الله - صلى الله عليه وسلم - في تثبيتهما ودخولهما في جملة التنزيل إلا عن عقبة بن عامر ، وعقبة بن عامر ضعيف لم يوافقه غيره عليها ، فروايته مطرحة . وهذا رد لما ذكرناه من الكتاب والسنة ، وإبطال لما نقلته لنا الصحابة من الملة . فإن عقبة بن عامر بن عيسى الجهني ممن روى لنا الشريعة في الصحيحين البخاري ومسلم وغيرهما ، فهو ممن مدحهم الله ووصفهم وأثنى عليهم ووعدهم مغفرة وأجرا عظيما . فمن نسبه أو واحدا من الصحابة إلى كذب فهو خارج عن الشريعة ، مبطل للقرآن طاعن على رسول الله - صلى الله عليه وسلم - . ومتى ألحق واحد منهم تكذيبا فقد سب ; لأنه لا عار ولا عيب بعد الكفر بالله أعظم من الكذب ، وقد لعن رسول الله - صلى الله عليه وسلم - من سب أصحابه ، فالمكذب لأصغرهم - ولا صغير فيهم - داخل في لعنة الله التي شهد بها رسول الله - صلى الله عليه وسلم - ، وألزمها كل من سب واحدا من أصحابه أو طعن عليه . وعن عمر بن حبيب قال : حضرت مجلس هارون الرشيد فجرت مسألة تنازعها الحضور وعلت أصواتهم ، فاحتج بعضهم بحديث يرويه أبو هريرة عن رسول الله - صلى الله عليه وسلم - ، فرفع بعضهم الحديث وزادت المدافعة والخصام حتى قال قائلون منهم : لا يقبل هذا الحديث على رسول الله - صلى الله عليه وسلم - ; لأن أبا هريرة متهم فيما يرويه ، وصرحوا بتكذيبه ، ورأيت الرشيد قد نحا نحوهم ونصر قولهم فقلت أنا : الحديث صحيح عن رسول الله - صلى الله عليه وسلم - ، وأبو هريرة صحيح النقل صدوق فيما يرويه عن النبي - صلى الله عليه وسلم - وغيره ، فنظر إلي الرشيد نظر مغضب ، وقمت من المجلس فانصرفت إلى منزلي ، فلم ألبث حتى قيل : صاحب البريد بالباب ، فدخل فقال لي : أجب أمير المؤمنين إجابة مقتول ، وتحنط وتكفن فقلت : اللهم إنك تعلم أني دافعت عن صاحب نبيك ، وأجللت نبيك أن يطعن على أصحابه ، فسلمني منه . فأدخلت على الرشيد وهو جالس على كرسي من ذهب ، حاسر عن ذراعيه ، بيده السيف وبين يديه النطع ، فلما بصر بي قال لي : يا عمر بن حبيب ما تلقاني أحد من الرد والدفع لقولي بمثل ما تلقيتني به ، فقلت : يا أمير المؤمنين ، إن الذي قلته وجادلت عنه فيه ازدراء على رسول الله - صلى الله عليه وسلم - وعلى ما جاء به ، إذا كان أصحابه كذابين فالشريعة باطلة ، والفرائض والأحكام في الصيام والصلاة والطلاق والنكاح والحدود كله مردود غير مقبول فرجع إلى نفسه ثم قال : أحييتني يا عمر بن حبيب أحياك الله ، وأمر لي بعشرة آلاف درهم .\nقلت : فالصحابة كلهم عدول ، أولياء الله تعالى وأصفياؤه ، وخيرته من خلقه بعد أنبيائه ورسله . هذا مذهب أهل السنة ، والذي عليه الجماعة من أئمة هذه الأمة . وقد ذهبت شرذمة لا مبالاة بهم إلى أن حال الصحابة كحال غيرهم ، فيلزم البحث عن عدالتهم . ومنهم من فرق بين حالهم في بداءة الأمر فقال : إنهم كانوا على العدالة إذ ذاك ، ثم تغيرت بهم الأحوال فظهرت فيهم الحروب وسفك الدماء ، فلا بد من البحث . وهذا مردود ، فإن خيار الصحابة وفضلاءهم كعلي وطلحة والزبير وغيرهم - رضي الله عنهم - ممن أثنى الله عليهم وزكاهم ورضي عنهم وأرضاهم ووعدهم الجنة بقوله تعالى : مغفرة وأجرا عظيما وخاصة العشرة المقطوع لهم بالجنة بإخبار الرسول هم القدوة مع علمهم بكثير من الفتن والأمور الجارية عليهم بعد نبيهم بإخباره لهم بذلك . وذلك غير مسقط من مرتبتهم وفضلهم ، إذ كانت تلك الأمور مبنية على الاجتهاد ، وكل مجتهد مصيب . وسيأتي الكلام في تلك الأمور في سورة ( الحجرات ) مبينة إن شاء الله تعالى :\nتم تفسير سورة ( الفتح ) والحمد لله .\n                                    ",
        "saadi": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡ‍َٔهُۥ فَ‍َٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا ٩٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن رسوله صلى الله عليه وسلم وأصحابه من المهاجرين والأنصار، أنهم بأكمل الصفات، وأجل الأحوال، وأنهم { أَشِدَّاءُ عَلَى الْكُفَّارِ } أي: جادون ومجتهدون في عداوتهم، وساعون في ذلك بغاية جهدهم، فلم يروا منهم إلا الغلظة والشدة، فلذلك ذل أعداؤهم لهم، وانكسروا، وقهرهم المسلمون، { رُحَمَاءُ بَيْنَهُمْ } أي: متحابون متراحمون متعاطفون، كالجسد الواحد، يحب أحدهم لأخيه ما يحب لنفسه، هذه معاملتهم مع الخلق، وأما معاملتهم مع الخالق فإنك { تَرَاهُمْ رُكَّعًا سُجَّدًا } أي: وصفهم كثرة الصلاة، التي أجل أركانها الركوع والسجود.\n{ يَبْتَغُونَ } بتلك العبادة { فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا } أي: هذا مقصودهم بلوغ رضا ربهم، والوصول إلى ثوابه.\n{ سِيمَاهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ } أي: قد أثرت العبادة -من كثرتها وحسنها- في وجوههم، حتى استنارت، لما استنارت بالصلاة بواطنهم، استنارت [بالجلال] ظواهرهم.\n{ ذَلِكَ } المذكور { مَثَلُهُمْ فِي التَّوْرَاةِ } أي: هذا وصفهم الذي وصفهم الله به، مذكور بالتوراة هكذا.\nوأما مثلهم في الإنجيل، فإنهم موصوفون بوصف آخر، وأنهم في كمالهم وتعاونهم { كَزَرْعٍ أَخْرَجَ شَطْأَهُ فَآزَرَهُ } أي: أخرج فراخه، فوازرته فراخه في الشباب والاستواء.\n{ فَاسْتَغْلَظَ } ذلك الزرع أي: قوي وغلظ { فَاسْتَوَى عَلَى سُوقِهِ } جمع ساق، { يُعْجِبُ الزُّرَّاعَ } من كماله واستوائه، وحسنه واعتداله، كذلك الصحابة رضي الله عنهم، هم كالزرع في نفعهم للخلق واحتياج الناس إليهم، فقوة إيمانهم وأعمالهم بمنزلة قوة عروق الزرع وسوقه، وكون الصغير والمتأخر إسلامه، قد لحق الكبير السابق ووازره وعاونه على ما هو عليه، من إقامة دين الله والدعوة إليه، كالزرع الذي أخرج شطأه، فآزره فاستغلظ، ولهذا قال: { لِيَغِيظَ بِهِمُ الْكُفَّارَ } حين يرون اجتماعهم وشدتهم على دينهم، وحين يتصادمون هم وهم في معارك النزال، ومعامع القتال.\n{ وَعَدَ اللَّهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ مِنْهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا } فالصحابة رضي الله عنهم، الذين جمعوا بين الإيمان والعمل الصالح، قد جمع الله لهم بين المغفرة، التي من لوازمها وقاية شرور الدنيا والآخرة، والأجر العظيم في الدنيا والآخرة.\nولنسق قصة الحديبية بطولها، كما ساقها الإمام شمس الدين ابن القيم في { الهدي النبوي } فإن فيها إعانة على فهم هذه السورة، وتكلم على معانيها وأسرارها، قال -رحمه الله تعالى:-\nفصل في قصة الحديبية\nقال نافع: كانت سنة ست في ذي القعدة، وهذا هو الصحيح، وهو قول الزهري، وقتادة، وموسى بن عقبة، ومحمد بن إسحاق وغيرهم.\nوقال هشام بن عروة، عن أبيه: خرج رسول الله صلى الله عليه وسلم إلى الحديبية في رمضان، وكانت في شوال، وهذا وهم، وإنما كانت غزاة الفتح في رمضان. قال أبو الأسود عن عروة: إنها كانت في ذي القعدة على الصواب.\nوفي الصحيحين عن أنس، أن النبي صلى الله عليه وسلم اعتمر أربع عمر، كلهن في ذي القعدة، فذكر منهن عمرة الحديبية، وكان معه ألف وخمسمائة، هكذا في الصحيحين عن جابر، وعنه فيهما: كانوا ألفا وأربعمائة، وفيهما، عن عبد الله بن أبي أوفى: كنا ألفا وثلاثمائة، قال قتادة: قلت لسعيد بن المسيب: كم كان الجماعة الذين شهدوا بيعة الرضوان؟ قال: خمس عشرة مائة، قال: قلت: فإن جابر بن عبد الله قال: كانوا أربع عشرة مائة، قال: يرحمه الله وهم، وهو حدثني أنهم كانوا خمس عشرة مائة، قلت: وقد صح عن جابر القولان، وصح عنه أنهم نحروا عام الحديبية سبعين بدنة، البدنة عن سبعة، فقيل له: كم كنتم؟ قال: ألفا وأربعمائة، بخيلنا ورجلنا، يعني: فارسهم وراجلهم.\nوالقلب إلى هذا أميل، وهو قول البراء بن عازب، ومعقل بن يسار، وسلمة بن الأكوع، في أصح الروايتين، وقول المسيب بن حزن، قال شعبة، عن قتادة، عن سعيد بن المسيب، عن أبيه: كنا مع رسول الله صلى الله عليه وسلم تحت الشجرة ألفا وأربعمائة، وغلط غلطا بينا من قال: كانوا سبعمائة، وعذره أنهم نحروا يومئذ سبعين بدنة، والبدنة قد جاء إجزاؤها عن سبعة أو عشرة، وهذا لا يدل على ما قاله هذا القائل، فإنه قد صرح بأن البدنة كانت في هذه الغزوة عن سبعة، فلو كانت السبعون عن جميعهم، لكانوا أربعمائة وتسعين رجلا، وقد قال بتمام الحديث بعينه، أنهم كانوا ألفا وأربعمائة.\nفصل\nفلما كانوا بذي الحليفة، قلد رسول الله صلى الله عليه وسلم الهدي وأشعره، وأحرم بالعمرة، وبعث عينا له بين يديه من خزاعة، يخبره عن قريش، حتى إذا كانوا قريبا من عسفان، أتاه عينه، فقال: إني قد تركت كعب بن لؤي، قد جمعوا لك الأحابيش، وجمعوا لك جموعا، وهم مقاتلوك وصادوك عن البيت.\nواستشار النبي صلى الله عليه وسلم أصحابه: أترون أن نميل إلى ذراري هؤلاء الذين أعانوهم فنصيبهم، فإن قعدوا قعدوا موتورين محزونين، وإن نجوا تكن عنقا قطعها الله، أم ترون أن نؤم البيت؟ فمن صدنا عنه قاتلناه؟ قال أبو بكر: الله ورسوله أعلم، إنما جئنا معتمرين، ولم نجئ لقتال أحد، ولكن من حال بيننا وبين البيت قاتلناه، فقال النبي صلى الله عليه وسلم: \"فروحوا إذا\" فراحوا، حتى إذا كانوا ببعض الطريق، قال النبي صلى الله عليه وسلم: \"إن خالد بن الوليد بالغميم في خيل لقريش، فخذوا ذات اليمين\" ، فوالله ما شعر بهم خالد، حتى إذا هو بغبرة الجيش، فانطلق يركض نذيرا لقريش.\nوسار النبي صلى الله عليه وسلم، حتى إذا كان بالثنية التي يهبط عليهم منها، بركت راحلته، فقال الناس: حل حل، فألحت، فقالوا: خلأت القصواء، فقال النبي صلى الله عليه وسلم: \"ما خلأت القصواء، وما ذاك لها بخلق، ولكن حبسها حابس الفيل\" ثم قال: \"والذي نفسي بيده، لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتموها\" ثم زجرها، فوثبت به، فعدل حتى نزل بأقصى الحديبية، على ثمد قليل الماء، إنما يتبرضه الناس تبرضا، فلم يلبث الناس أن نزحوه، فشكوا إلى رسول الله صلى الله عليه وسلم العطش.\nفانتزع سهما من كنانته، ثم أمرهم أن يجعلوها فيه، قال: فوالله ما زال يجيش لهم بالري حتى صدروا عنها، وفزعت قريش لنزوله عليهم، فأحب رسول الله صلى الله عليه وسلم أن يبعث إليهم رجلا من أصحابه، فدعا عمر بن الخطاب ليبعثه إليهم، فقال: يا رسول الله، ليس بمكة أحد من بني كعب يغضب لي، إن أوذيت، فأرسل عثمان بن عفان، فإن عشيرته بها، وإنه مبلغ ما أردت.\nفدعا رسول الله صلى الله عليه وسلم عثمان بن عفان، فأرسله إلى قريش، وقال: \"أخبرهم أنا لم نأت لقتال، إنما جئنا عمارا، وادعهم إلى الإسلام\"\nوأمره أن يأتي رجالا بمكة مؤمنين، ونساء مؤمنات، فيدخل عليهم ويبشرهم بالفتح، ويخبرهم أن الله عز وجل مظهر دينه بمكة، حتى لا يستخفى فيها بالإيمان، فانطلق عثمان، فمر على قريش ببلدح، فقالوا: أين تريد؟ فقال: بعثني رسول الله صلى الله عليه وسلم أدعوكم إلى الله وإلى الإسلام، ونخبركم أنا لم نأت لقتال، وإنما جئنا عمارا، قالوا: قد سمعنا ما تقول، فانفذ لحاجتك.\nوقام إليه أبان بن سعيد بن العاص، فرحب به، وأسرج فرسه، فحمل عثمان على الفرس، فأجاره، وأردفه أبان حتى جاء مكة، وقال المسلمون قبل أن يرجع عثمان: خلص عثمان قبلنا إلى البيت وطاف به، فقال رسول الله صلى الله عليه وسلم: \"ما أظنه طاف بالبيت ونحن محصورون\" فقالوا: وما يمنعه يا رسول الله وقد خلص؟ قال: \"ذاك ظني به، أن لا يطوف بالكعبة حتى نطوف معه\" واختلط المسلمون بالمشركين في أمر الصلح، فرمى رجل من أحد الفريقين رجلا من الفريق الآخر، وكانت معركة، وتراموا بالنبل والحجارة، وصاح الفريقان كلاهما، وارتهن كل واحد من الفريقين بمن فيهم، وبلغ رسول الله صلى الله عليه وسلم أن عثمان قد قتل، فدعا إلى البيعة.\nفثار المسلمون إلى رسول الله صلى الله عليه وسلم، وهو تحت الشجرة، فبايعوه على أن لا يفروا، فأخذ رسول الله صلى الله عليه وسلم بيد نفسه، وقال: \"هذه عن عثمان\" ولما تمت البيعة، رجع عثمان، فقال له المسلمون: اشتفيت يا أبا عبد الله من الطواف بالبيت، فقال: بئسما ظننتم بي، والذي نفسي بيده، لو مكثت بها سنة، ورسول الله صلى الله عليه وسلم، مقيم بالحديبية، ما طفت بها حتى يطوف بها رسول الله صلى الله عليه وسلم ولقد دعتني قريش إلى الطواف بالبيت فأبيت، فقال المسلمون: رسول الله صلى الله عليه وسلم، كان أعلمنا بالله، وأحسننا ظنا.\nوكان عمر أخذ بيد رسول الله صلى الله عليه وسلم للبيعة تحت الشجرة، فبايعه المسلمون كلهم إلا الجد ابن قيس، وكان معقل بن يسار، أخذ بغصنها يرفعه عن رسول الله صلى الله عليه وسلم، وكان أول من بايعه، أبو سنان الأسدي، وبايعه سلمة بن الأكوع ثلاث مرات، في أول الناس، وأوسطهم، وآخرهم.\nفبينما هم كذلك، إذ جاء بديل بن ورقاء الخزاعي، في نفر من خزاعة، وكانوا عيبة نصح لرسول الله صلى الله عليه وسلم، من أهل تهامة، فقال: إني تركت كعب بن لؤي، وعامر بن لؤي، نزلوا أعداد مياه الحديبية، معهم العوذ المطافيل، وهم مقاتلوك، وصادوك عن البيت.\nقال رسول الله صلى الله عليه وسلم: \"إنا لم نجئ لقتال أحد، ولكن جئنا معتمرين، وإن قريشا قد نهكتهم الحرب وأضرت بهم، فإن شاءوا أماددهم ويخلوا بيني وبين الناس، وإن شاءوا أن يدخلوا فيما دخل فيه الناس فعلوا، وإلا فقد جموا، وإن أبوا إلا القتال، فوالذي نفسي بيده، لأقاتلنهم على أمري هذا حتى تنفرد سالفتي، أو لينفذن الله أمره\" قال بديل: سأبلغهم ما تقول.\nفانطلق حتى أتى قريشا، فقال: إني قد جئتكم من عند هذا الرجل، وسمعته يقول قولا، فإن شئتم عرضته عليكم، فقال سفهاؤهم: لا حاجة لنا أن تحدثنا عنه بشيء، وقال ذوو الرأي: منهم: هات ما سمعته، قال: سمعته يقول كذا وكذا، فقال عروة بن مسعود الثقفي: إن هذا قد عرض عليكم خطة رشد، فاقبلوها، ودعوني آته، فقالوا: ائته، فأتاه، فجعل يكلمه، فقال له النبي صلى الله عليه وسلم نحوا من قوله لبديل، فقال له عروة عند ذلك: أي: محمد، أرأيت لو استأصلت قومك، هل سمعت بأحد من العرب اجتاح أهله قبلك؟ وإن تكن الأخرى، فوالله إني لأرى وجوها، وأرى أوباشا من الناس، خليقا أن يفروا ويدعوك، فقال له أبو بكر: امصص بظر اللات، أنحن نفر عنه وندعه؟ قال: من ذا؟ قال: أبو بكر، قال: أما والذي نفسي بيده، لولا يد كانت لك عندي لم أجزك بها، لأجبتك.\nوجعل يكلم النبي صلى الله عليه وسلم، وكلما كلمه أخذ بلحيته، والمغيرة بن شعبة على رأس النبي صلى الله عليه وسلم، ومعه السيف، وعليه المغفر فكلما أهوى عروة إلى لحية النبي صلى الله عليه وسلم، ضرب يده بنعل السيف، وقال: أخر يدك عن لحية رسول الله صلى الله عليه وسلم، فرفع عروة رأسه، وقال: من ذا؟ قال: المغيرة بن شعبة، فقال: أي: غدر، أولست أسعى في غدرتك؟ وكان المغيرة صحب قوما في الجاهلية، فقتلهم وأخذ أموالهم، ثم جاء فأسلم، فقال النبي صلى الله عليه وسلم: \"أما الإسلام فأقبل، وأما المال فلست منه في شيء\"\nثم إن عروة جعل يرمق أصحاب رسول الله صلى الله عليه وسلم، فوالله إن تنخم النبي صلى الله عليه وسلم نخامة، إلا وقعت في كف رجل منهم، فدلك بها جلده ووجهه.\nوإذا أمرهم ابتدروا إلى أمره، وإذا توضأ، كادوا يقتتلون على وضوئه، وإذا تكلم، خفضوا أصواتهم عنده، وما يحدون إليه النظر، تعظيما له.\nفرجع عروة إلى أصحابه، فقال: أي قوم، والله لقد وفدت على الملوك، على كسرى، وقيصر، والنجاشي، والله ما رأيت ملكا يعظمه أصحابه، ما يعظم أصحاب محمد محمدا، والله ما تنخم نخامة إلا وقعت في كف رجل منهم، فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره، وإذا توضأ كادوا يقتتلون على وضوئه، وإذا تكلم، خفضوا أصواتهم عنده، وما يحدون إليه النظر تعظيما له، وقد عرض عليكم خطة رشد فاقبلوها.\nفقال رجل من بني كنانة: دعوني آته، فقالوا: ائته.\nفلما أشرف على النبي صلى الله عليه وسلم، قال رسول الله صلى الله عليه وسلم: \"هذا فلان، وهو من قوم يعظمون البدن فابعثوها له\" فبعثوها فاستقبله القوم يلبون، فلما رأى ذلك، قال: سبحان الله، لا ينبغي لهؤلاء أن يصدوا عن البيت.\nفرجع إلى أصحابه، فقال: رأيت البدن قد قلدت وأشعرت، وما أرى أن يصدوا عن البيت فقام مكرز بن حفص، وقال: دعوني آته، فقالوا: ائته، فلما أشرف عليهم، قال النبي صلى الله عليه وسلم: \"هذا مكرز بن حفص، وهو رجل فاجر\" فجعل يكلم رسول الله صلى الله عليه وسلم، فبينا هو يكلمه، إذ جاء سهيل بن عمرو، فقال النبي صلى الله عليه وسلم: \"قد سهل لكم من أمركم\" فقال: هات، اكتب بيننا وبينك كتابا، فدعا الكاتب، فقال: \"اكتب: بسم الله الرحمن الرحيم\" فقال سهيل: أما الرحمن، فوالله ما ندري ما هو، ولكن اكتب: \"باسمك اللهم\" كما كنت تكتب، فقال المسلمون: والله لا نكتبها إلا بسم الله الرحمن الرحيم.\nفقال النبي صلى الله عليه وسلم: \"اكتب باسمك اللهم\"\nثم قال: \"اكتب: هذا ما قاضى عليه محمد رسول الله \" فقال سهيل: فوالله لو نعلم أنك رسول الله، ما صددناك عن البيت ولا قاتلناك، ولكن اكتب: محمد بن عبد الله، فقال النبي صلى الله عليه وسلم: \"إني رسول الله وإن كذبتموني، اكتب: محمد بن عبد الله \" فقال النبي صلى الله عليه وسلم: \"على أن تخلوا بيننا وبين البيت فنطوف به\" فقال سهيل: والله لا تتحدث العرب أنا أخذنا ضغطة، ولكن لك من العام المقبل، فكتب.\nفقال سهيل: على أن لا يأتيك منا رجل، وإن كان على دينك، إلا رددته علينا.\nفقال المسلمون: سبحان الله، كيف يرد إلى المشركين وقد جاء مسلما؟\nفبينما هم كذلك إذ جاء أبو جندل بن سهيل يرسف في قيوده، قد خرج من أسفل مكة، حتى رمى بنفسه بين أظهر المسلمين، فقال سهيل: هذا يا محمد أول ما قاضيتك عليه، أن ترده، فقال النبي صلى الله عليه وسلم: \"إنا لم نقض الكتاب بعد\" فقال: فوالله إذا لا أصالحك على شيء أبدا، فقال النبي صلى الله عليه وسلم: \"فأجزه لي\" فقال: ما أنا بمجيزه، فقال: \"بلى فافعل\" قال: ما أنا بفاعل، قال مكرز: قد أجزناه.\nفقال أبو جندل: يا معشر المسلمين، أرد إلى المشركين وقد جئت مسلما، ألا ترون ما لقيت؟ وكان قد عذب في الله عذابا شديدا.\nقال عمر بن الخطاب: والله ما شككت منذ أسلمت إلا يومئذ، فأتيت النبي صلى الله عليه وسلم، فقلت: يا رسول الله ألست نبي الله؟ قال: \"بلى\" قلت: ألسنا على الحق، وعدونا على الباطل؟ قال: \"بلى\" فقلت: علام نعطي الدنية في ديننا ونرجع ولما يحكم الله بيننا وبين أعدائنا؟ فقال: \"إني رسول الله، وهو ناصري، ولست أعصيه\" قلت: أولست كنت تحدثنا أنا سنأتي البيت ونطوف به؟ قال: \"بلى، أفأخبرتك أنك تأتيه العام؟\" قلت: لا، قال: \"فإنك آتيه ومطوف به\"\nقال: فأتيت أبا بكر، فقلت له كما قلت لرسول الله صلى الله عليه وسلم، ورد عليه أبو بكر كما رد عليه رسول الله صلى الله عليه وسلم سواء، وزاد: فاستمسك بغرزه حتى تموت، فوالله إنه لعلى الحق، قال عمر: فعملت لذلك أعمالا.\nفلما فرغ من قضية الكتاب، قال رسول الله صلى الله عليه وسلم: \"قوموا وانحروا، ثم احلقوا\" فوالله ما قام منهم رجل حتى قال ثلاث مرات، فلما لم يقم منهم أحد، قام فدخل على أم سلمة، فذكر لها ما لقي من الناس، فقالت: يا رسول الله أتحب ذلك؟ اخرج، ثم لا تكلم أحدا كلمة حتى تنحر بدنك، وتدعو حالقك فيحلق لك، فقام فخرج، فلم يكلم أحدا منهم حتى فعل ذلك، نحر بدنه، ودعا حالقه فحلقه، فلما رأى الناس ذلك، قاموا فنحروا، وجعل بعضهم يحلق بعضا، حتى كاد بعضهم يقتل بعضا غما، ثم جاءت نسوة مؤمنات، فأنزل الله عز وجل: { إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ } حتى بلغ { بِعِصَمِ الْكَوَافِرِ } فطلق عمر يومئذ امرأتين كانتا له في الشرك، فتزوج إحداهما معاوية، والأخرى صفوان بن أمية، ثم رجع إلى المدينة.\nوفي مرجعه أنزل الله عليه: { إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا } إلى آخرها، فقال عمر: أفتح هو يا رسول الله؟ فقال: \"نعم\" فقال الصحابة: هنيئا لك يا رسول الله، فما لنا؟\nفأنزل الله عز وجل: { هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ }\nالآية. انتهى.\nوهذا آخر تفسير سورة الفتح ولله الحمد والمنة\n[وصلى الله على نبينا محمد وعلى آله وصحبه، نقلته من خط المفسر رحمه الله وعفا عنه، وكان الفراغ من كتابته في 13 ذي الحجة 1345 وصلى الله على نبينا محمد وعلى آله وصحبه وسلم تسليما كثيرا إلى يوم الدين آمين.\nبقلم الفقير إلى ربه سليمان بن حمد العبد الله البسام. غفر الله له ولوالديه ولجميع المسلمين آمين. وصلى الله على محمد وعلى آله وصحبه أجمعين وسلم تسليما كثيرا إلى يوم الدين والحمد لله الذي بنعمته تتم الصالحات]\n                                    "
      },
      "originalText": "مُّحَمَّدٞ رَّسُولُ ٱللَّهِۚ وَٱلَّذِينَ مَعَهُۥٓ أَشِدَّآءُ عَلَى ٱلۡكُفَّارِ رُحَمَآءُ بَيۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعٗا سُجَّدٗا يَبۡتَغُونَ فَضۡلٗا مِّنَ ٱللَّهِ وَرِضۡوَٰنٗاۖ سِيمَاهُمۡ فِي وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَٰلِكَ مَثَلُهُمۡ فِي ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِي ٱلۡإِنجِيلِ كَزَرۡعٍ أَخۡرَجَ شَطۡ‍َٔهُۥ فَ‍َٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ يُعۡجِبُ ٱلزُّرَّاعَ لِيَغِيظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ مِنۡهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمَۢا ٩٢"
    },
    {
      "number": 4613,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 1,
      "juz": 26,
      "manzil": 6,
      "page": 515,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ ١\n                                    \n                                    \n                                    تفسير سورة الحجرات وهي مدنية .\nهذه آداب أدب الله بها عباده المؤمنين فيما يعاملون به الرسول - صلى الله عليه وسلم - من التوقير والاحترام والتبجيل والإعظام ، فقال : ( يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله [ واتقوا الله ] ) ، أي : لا تسرعوا في الأشياء بين يديه ، أي : قبله ، بل كونوا تبعا له في جميع الأمور ، حتى يدخل في عموم هذا الأدب الشرعي حديث معاذ ، [ إذ ] قال له النبي - صلى الله عليه وسلم - حين بعثه إلى اليمن : \" بم تحكم ؟ \" قال : بكتاب الله . قال : \" فإن لم تجد ؟ \" قال : بسنة رسول الله . قال : \" فإن لم تجد ؟ \" قال : أجتهد رأيي ، فضرب في صدره وقال : \" الحمد لله الذي وفق رسول رسول الله ، لما يرضي رسول الله \" .\nوقد رواه أحمد ، وأبو داود ، والترمذي ، وابن ماجه . فالغرض منه أنه أخر رأيه ونظره واجتهاده إلى ما بعد الكتاب والسنة ، ولو قدمه قبل البحث عنهما لكان من باب التقديم بين يدي الله ورسوله .\nقال علي بن أبي طلحة ، عن ابن عباس : ( لا تقدموا بين يدي الله ورسوله ) : لا تقولوا خلاف الكتاب والسنة .\nوقال العوفي عنه : نهى أن يتكلموا بين يدي كلامه .\nوقال مجاهد : لا تفتاتوا على رسول الله - صلى الله عليه وسلم - بشيء ، حتى يقضي الله على لسانه .\nوقال الضحاك : لا تقضوا أمرا دون الله ورسوله من شرائع دينكم .\nوقال سفيان الثوري : ( لا تقدموا بين يدي الله ورسوله ) بقول ولا فعل .\nوقال الحسن البصري : ( لا تقدموا بين يدي الله ورسوله ) قال : لا تدعوا قبل الإمام .\nوقال قتادة : ذكر لنا أن ناسا كانوا يقولون : لو أنزل في كذا كذا ، وكذا لو صنع كذا ، فكره الله ذلك ، وتقدم فيه .\n( واتقوا الله ) أي : فيما أمركم به ، ( إن الله سميع ) أي : لأقوالكم ) عليم ) بنياتكم .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ ١\n                                    \n                                    \n                                    تفسير سورة الحجرات .\nمدنية بإجماع . وهي ثماني عشرة آية .\nبسم الله الرحمن الرحيم .\nيا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله واتقوا الله إن الله سميع عليم .\nفيه ثلاث مسائل : الأولى : قوله تعالى : يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله قال العلماء : كان في العربي جفاء وسوء أدب في خطاب النبي - صلى الله عليه وسلم - وتلقيب الناس . فالسورة في الأمر بمكارم الأخلاق ورعاية الآداب . وقرأ الضحاك ويعقوب الحضرمي : ( لا تقدموا ) بفتح التاء والدال من التقدم . الباقون تقدموا بضم التاء وكسر الدال من التقديم . ومعناهما ظاهر ، أي : لا تقدموا قولا ولا فعلا بين يدي الله وقول رسوله وفعله فيما سبيله أن تأخذوه عنه من أمر الدين والدنيا . ومن قدم قوله أو فعله على الرسول - صلى الله عليه وسلم - فقد قدمه على الله تعالى لأن الرسول - صلى الله عليه وسلم - إنما يأمر عن أمر الله عز وجل .\nالثانية : واختلف في سبب نزولها على أقوال ستة :\nالأول : ما ذكره الواحدي من حديث ابن جريج قال : حدثني ابن أبي مليكة أن عبد الله بن الزبير أخبره أنه قدم ركب من بني تميم على رسول الله - صلى الله عليه وسلم - ، فقال أبو بكر : أمر القعقاع بن معبد . وقال عمر : أمر الأقرع بن حابس . فقال أبو بكر : ما أردت إلا خلافي . وقال عمر : ما أردت خلافك . فتماديا حتى ارتفعت أصواتهما ، فنزل في ذلك : يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله - إلى قوله - ولو أنهم صبروا حتى تخرج إليهم رواه البخاري عن الحسن بن محمد بن الصباح ، ذكره المهدوي أيضا .\nالثاني : ما روي أن النبي - صلى الله عليه وسلم - أراد أن يستخلف على المدينة رجلا إذا مضى إلى خيبر ، فأشار عليه عمر برجل آخر ، فنزل : يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله ذكره المهدوي أيضا .\nالثالث : ما ذكره الماوردي عن الضحاك عن ابن عباس - رضي الله عنهما - : أن النبي - صلى الله عليه وسلم - أنفذ أربعة وعشرين رجلا من أصحابه إلى بني عامر فقتلوهم ، إلا ثلاثة تأخروا عنهم فسلموا وانكفئوا إلى المدينة ، فلقوا رجلين من بني سليم فسألوهما عن نسبهما فقالا : من بني عامر لأنهم أعز من بني سليم فقتلوهما ، فجاء نفر من بني سليم إلى رسول الله - صلى الله عليه وسلم - فقالوا : إن بيننا وبينك عهدا ، وقد قتل منا رجلان ، فوداهما النبي - صلى الله عليه وسلم - بمائة بعير ، ونزلت عليه هذه الآية في قتلهم الرجلين .\nالرابع : وقال قتادة : إن ناسا كانوا يقولون لو أنزل في كذا ، لو أنزل في كذا ؟ فنزلت هذه الآية . ابن عباس : نهوا أن يتكلموا بين يدي كلامه . مجاهد : لا تفتاتوا على الله ورسوله حتى يقضي الله على لسان رسوله ، ذكره البخاري أيضا .\n[ الخامس ] : [ وقال ] الحسن : نزلت في قوم ذبحوا قبل أن يصلي رسول الله - صلى الله عليه وسلم - ، فأمرهم أن يعيدوا الذبح . ابن جريج : لا تقدموا أعمال الطاعات قبل وقتها الذي أمر الله تعالى به ورسوله - صلى الله عليه وسلم - .\nقلت : هذه الأقوال الخمسة المتأخرة ذكرها القاضي أبو بكر بن العربي ، وسردها قبله الماوردي . قال القاضي : وهي كلها صحيحة تدخل تحت العموم ، فالله أعلم ما كان السبب المثير للآية منها ، ولعلها نزلت دون سبب ، والله أعلم . قال القاضي : إذا قلنا إنها نزلت في تقديم الطاعات على أوقاتها فهو صحيح ; لأن كل عبادة مؤقتة بميقات لا يجوز تقديمها عليه كالصلاة والصوم والحج ، وذلك بين . إلا أن العلماء اختلفوا في الزكاة ، لما كانت عبادة مالية وكانت مطلوبة لمعنى مفهوم ، وهو سد خلة الفقير ، ولأن النبي - صلى الله عليه وسلم - استعجل من العباس صدقة عامين ، ولما جاء من جمع صدقة الفطر قبل يوم الفطر حتى تعطى لمستحقيها يوم الوجوب وهو يوم الفطر ، فاقتضى ذلك كله جواز تقديمها العام والاثنين . فإن جاء رأس العام والنصاب بحاله وقعت موقعها . وإن جاء رأس العام وقد تغير النصاب تبين أنها صدقة تطوع . وقال أشهب : لا يجوز تقديمها على الحول لحظة كالصلاة ، وكأنه طرد الأصل في العبادات فرأى أنها إحدى دعائم الإسلام فوفاها حقها في النظام وحسن الترتيب . ورأى سائر علمائنا أن التقديم اليسير فيها جائز ; لأنه معفو عنه في الشرع بخلاف الكثير . وما قاله أشهب أصح ، فإن مفارقة اليسير الكثير في أصول الشريعة صحيح ولكنه لمعان تختص باليسير دون الكثير . فأما في مسألتنا فاليوم فيه كالشهر ، والشهر كالسنة . فإما تقديم كلي كما قاله أبو حنيفة والشافعي ، وإما حفظ العبادة على ميقاتها كما قال أشهب .\nالثالثة : قوله تعالى : لا تقدموا بين يدي الله أصل في ترك التعرض لأقوال النبي - صلى الله عليه وسلم - ، وإيجاب اتباعه والاقتداء به ، وكذلك قال النبي - صلى الله عليه وسلم - في مرضه : مروا أبا بكر فليصل بالناس . فقالت عائشة لحفصة - رضي الله عنهما : قولي له إن أبا بكر رجل أسيف ، وإنه متى يقم مقامك لا يسمع الناس من البكاء ، فمر عمر فليصل بالناس . فقال - صلى الله عليه وسلم - : إنكن لأنتن صواحب يوسف . مروا أبا بكر فليصل بالناس . فمعنى قوله ( صواحب يوسف ) الفتنة بالرد عن الجائز إلى غير الجائز . وربما احتج بغاة القياس بهذه الآية . وهو باطل منهم ، فإن ما قامت دلالته فليس في فعله تقديم بين يديه . وقد قامت دلالة الكتاب والسنة على وجوب القول بالقياس في فروع الشرع ، فليس إذا تقدم بين يديه .\nواتقوا الله يعني في التقدم المنهي عنه . إن الله سميع لقولكم عليم بفعلكم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ ١\n                                        \n                                        \n                                        \n                                        هذا متضمن للأدب، مع الله تعالى، ومع رسول الله صلى الله عليه وسلم، والتعظيم له ، واحترامه، وإكرامه، فأمر [الله] عباده المؤمنين، بما يقتضيه الإيمان، بالله وبرسوله، من امتثال أوامر الله، واجتناب نواهيه، وأن يكونوا ماشين، خلف أوامر الله، متبعين لسنة رسول الله صلى الله عليه وسلم، في جميع أمورهم، و [أن] لا يتقدموا بين يدي الله ورسوله، ولا يقولوا، حتى يقول، ولا يأمروا، حتى يأمر، فإن هذا، حقيقة الأدب الواجب، مع الله ورسوله، وهو عنوان سعادة العبد وفلاحه، وبفواته، تفوته السعادة الأبدية، والنعيم السرمدي، وفي هذا، النهي [الشديد] عن تقديم قول غير الرسول صلى الله عليه وسلم، على قوله، فإنه متى استبانت سنة رسول الله صلى الله عليه وسلم، وجب اتباعها، وتقديمها على غيرها، كائنا ما كان\nثم أمر الله بتقواه عمومًا، وهي كما قال طلق بن حبيب: أن تعمل بطاعة الله، على نور من الله، ترجو ثواب الله، وأن تترك معصية الله، على نور من الله، تخشى عقاب الله.\nوقوله: { إِنَّ اللَّهَ سَمِيعٌ } أي: لجميع الأصوات في جميع الأوقات، في خفي المواضع والجهات، { عَلِيمٌ } بالظواهر والبواطن، والسوابق واللواحق، والواجبات والمستحيلات والممكنات\nوفي ذكر الاسمين الكريمين -بعد النهي عن التقدم بين يدي الله ورسوله، والأمر بتقواه- حث على امتثال تلك الأوامر الحسنة، والآداب المستحسنة، وترهيب عن عدم الامتثال\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ ١"
    },
    {
      "number": 4614,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ أَنْ تَحْبَطَ أَعْمَالُكُمْ وَأَنْتُمْ لَا تَشْعُرُونَ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 2,
      "juz": 26,
      "manzil": 6,
      "page": 515,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ ٢\n                                    \n                                    \n                                    وقوله : ( ياأيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ) : هذا أدب ثان أدب الله به المؤمنين ألا يرفعوا أصواتهم بين يدي النبي - صلى الله عليه وسلم - [ فوق صوته ] . وقد روي أنها نزلت في الشيخين أبي بكر وعمر ، رضي الله عنهما .\nوقال البخاري : حدثنا بسرة بن صفوان اللخمي ، حدثنا نافع بن عمر ، عن ابن أبي مليكة قال : كاد الخيران أن يهلكا ، أبو بكر وعمر ، رضي الله عنهما ، رفعا أصواتهما عند النبي - صلى الله عليه وسلم - حين قدم عليه ركب بني تميم ، فأشار أحدهما بالأقرع بن حابس أخي بني مجاشع ، وأشار الآخر برجل آخر - قال نافع : لا أحفظ اسمه - فقال أبو بكر لعمر : ما أردت إلا خلافي . قال : ما أردت خلافك . فارتفعت أصواتهما في ذلك ، فأنزل الله : ( يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض ) الآية ، قال ابن الزبير : فما كان عمر يسمع رسول الله - صلى الله عليه وسلم - بعد هذه الآية حتى يستفهمه ، ولم يذكر ذلك عن أبيه : يعني أبا بكر رضي الله عنه . انفرد به دون مسلم .\nثم قال البخاري : حدثنا حسن بن محمد ، حدثنا حجاج ، عن ابن جريج ، حدثني ابن أبي مليكة : أن عبد الله بن الزبير أخبره : أنه قدم ركب من بني تميم على النبي - صلى الله عليه وسلم - فقال أبو بكر : أمر القعقاع بن معبد . وقال عمر : بل أمر الأقرع بن حابس ، فقال أبو بكر : ما أردت إلى - أو : إلا - خلافي . فقال عمر : ما أردت خلافك ، فتماريا حتى ارتفعت أصواتهما ، فنزلت في ذلك : ( يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله ) ، حتى انقضت الآية ، ( ولو أنهم صبروا حتى تخرج إليهم ) الآية [ الحجرات : 5 ] .\nوهكذا رواه هاهنا منفردا به أيضا .\nوقال الحافظ أبو بكر البزار في مسنده : حدثنا الفضل بن سهل ، حدثنا إسحاق بن منصور ، حدثنا حصين بن عمر ، عن مخارق ، عن طارق بن شهاب ، عن أبي بكر الصديق قال : لما نزلت هذه الآية : ( يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ) ، قلت : يا رسول الله ، والله لا أكلمك إلا كأخي السرار .\nحصين بن عمر هذا - وإن كان ضعيفا - لكن قد رويناه من حديث عبد الرحمن بن عوف ، وأبي هريرة [ رضي الله عنه ] بنحو ذلك ، والله أعلم .\nوقال البخاري : حدثنا علي بن عبد الله ، حدثنا أزهر بن سعد ، أخبرنا ابن عون ، أنبأني موسى بن أنس ، عن أنس بن مالك رضي الله عنه ، أن النبي - صلى الله عليه وسلم - افتقد ثابت بن قيس ، فقال رجل : يا رسول الله ، أنا أعلم لك علمه . فأتاه فوجده في بيته منكسا رأسه ، فقال له : ما شأنك ؟ فقال : شر ، كان يرفع صوته فوق صوت النبي - صلى الله عليه وسلم - فقد حبط عمله ، فهو من أهل النار . فأتى الرجل النبي - صلى الله عليه وسلم - فأخبره أنه قال كذا وكذا ، قال موسى : فرجع إليه المرة الآخرة ببشارة عظيمة فقال : \" اذهب إليه فقل له : إنك لست من أهل النار ، ولكنك من أهل الجنة \" تفرد به البخاري من هذا الوجه .\nوقال الإمام أحمد : حدثنا هاشم ، حدثنا سليمان بن المغيرة ، عن ثابت ، عن أنس قال : لما نزلت هذه الآية : ( يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ) إلى : ( وأنتم لا تشعرون ) ، وكان ثابت بن قيس بن الشماس رفيع الصوت فقال : أنا الذي كنت أرفع صوتي على رسول الله - صلى الله عليه وسلم - حبط عملي ، أنا من أهل النار ، وجلس في أهله حزينا ، ففقده رسول الله - صلى الله عليه وسلم - فانطلق بعض القوم إليه فقالوا له : تفقدك رسول الله - صلى الله عليه وسلم - ما لك ؟ قال : أنا الذي أرفع صوتي فوق صوت النبي - صلى الله عليه وسلم - وأجهر له بالقول حبط عملي ، أنا من أهل النار . فأتوا النبي - صلى الله عليه وسلم - فأخبروه بما قال ، فقال : \" لا بل هو من أهل الجنة \" . قال أنس : فكنا نراه يمشي بين أظهرنا ، ونحن نعلم أنه من أهل الجنة . فلما كان يوم اليمامة كان فينا بعض الانكشاف ، فجاء ثابت بن قيس بن شماس ، وقد تحنط ولبس كفنه ، فقال : بئسما تعودون أقرانكم . فقاتلهم حتى قتل .\nوقال مسلم : حدثنا أبو بكر بن أبي شيبة ، حدثنا الحسن بن موسى ، حدثنا حماد بن سلمة ، عن ثابت البناني ، عن أنس بن مالك قال : لما نزلت هذه الآية : ( يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ) إلى آخر الآية ، جلس ثابت في بيته ، قال : أنا من أهل النار . واحتبس عن النبي - صلى الله عليه وسلم - فقال النبي - صلى الله عليه وسلم - لسعد بن معاذ : \" يا أبا عمرو ، ما شأن ثابت ؟ أشتكى ؟ \" فقال سعد : إنه لجاري ، وما علمت له بشكوى . قال : فأتاه سعد فذكر له قول رسول الله - صلى الله عليه وسلم - فقال ثابت : أنزلت هذه الآية ، ولقد علمتم أني من أرفعكم صوتا على رسول الله - صلى الله عليه وسلم - فأنا من أهل النار . فذكر ذلك سعد للنبي - صلى الله عليه وسلم - فقال رسول الله - صلى الله عليه وسلم - : \" بل هو من أهل الجنة \" .\nثم رواه مسلم عن أحمد بن سعيد الدارمي ، عن حيان بن هلال ، عن سليمان بن المغيرة ، به ، قال : ولم يذكر سعد بن معاذ . وعن قطن بن نسير عن جعفر بن سليمان ، عن ثابت ، عن أنس بنحوه . وقال : ليس فيه ذكر سعد بن معاذ .\nحدثنا هريم بن عبد الأعلى الأسدي ، حدثنا المعتمر بن سليمان ، سمعت أبي يذكر عن ثابت ، عن أنس قال : لما نزلت هذه الآية ، واقتص الحديث ، ولم يذكر سعد بن معاذ ، وزاد : فكنا نراه يمشي بين أظهرنا رجل من أهل الجنة . .\nفهذه الطرق الثلاث معللة لرواية حماد بن سلمة ، فيما تفرد به من ذكر سعد بن معاذ . والصحيح : أن حال نزول هذه الآية لم يكن سعد بن معاذ موجودا ; لأنه كان قد مات بعد بني قريظة بأيام قلائل سنة خمس ، وهذه الآية نزلت في وفد بني تميم ، والوفود إنما تواتروا في سنة تسع من الهجرة ، والله أعلم .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا زيد بن الحباب ، حدثنا أبو ثابت بن ثابت بن قيس بن شماس ، حدثني عمي إسماعيل بن محمد بن ثابت بن قيس بن شماس ، عن أبيه قال : لما نزلت هذه الآية : ( لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول ) قال : قعد ثابت بن قيس في الطريق يبكي ، قال : فمر به عاصم بن عدي من بني العجلان ، فقال : ما يبكيك يا ثابت ؟ قال : هذه الآية ، أتخوف أن تكون نزلت في وأنا صيت ، رفيع الصوت . قال : فمضى عاصم بن عدي إلى رسول الله - صلى الله عليه وسلم - قال : وغلبه البكاء ، فأتى امرأته جميلة ابنة عبد الله بن أبي ابن سلول فقال لها : إذا دخلت بيت فرسي فشدي علي الضبة بمسمار فضربته بمسمار حتى إذا خرج عطفه ، وقال : لا أخرج حتى يتوفاني الله عز وجل ، أو يرضى عني رسول الله - صلى الله عليه وسلم - . قال : وأتى عاصم رسول الله - صلى الله عليه وسلم - فأخبره خبره ، فقال : \" اذهب فادعه لي \" . فجاء عاصم إلى المكان فلم يجده ، فجاء إلى أهله فوجده في بيت الفرس ، فقال له : إن رسول الله - صلى الله عليه وسلم - يدعوك . فقال : اكسر الضبة . قال : فخرجا فأتيا النبي - صلى الله عليه وسلم - فقال له رسول الله - صلى الله عليه وسلم - : \" ما يبكيك يا ثابت ؟ \" . فقال : أنا صيت وأتخوف أن تكون هذه الآية نزلت في : ( لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول ) . فقال له رسول الله - صلى الله عليه وسلم - : \" أما ترضى أن تعيش حميدا ، وتقتل شهيدا ، وتدخل الجنة ؟ \" . فقال : رضيت ببشرى الله ورسوله - صلى الله عليه وسلم - ولا أرفع صوتي أبدا على صوت النبي - صلى الله عليه وسلم - .\nوقال العلماء : يكره رفع الصوت عند قبره ، كما كان يكره في حياته ; لأنه محترم حيا وفي قبره ، صلوات الله وسلامه عليه ، دائما . ثم نهى عن الجهر له بالقول كما يجهر الرجل لمخاطبه ممن عداه ، بل يخاطب بسكينة ووقار وتعظيم ; ولهذا قال : ( ولا تجهروا له بالقول كجهر بعضكم لبعض ) ، كما قال : ( لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا ) [ النور : 63 ] .\nوقوله : ( أن تحبط أعمالكم وأنتم لا تشعرون ) أي : إنما نهيناكم عن رفع الصوت عنده خشية أن يغضب من ذلك ، فيغضب الله لغضبه ، فيحبط الله عمل من أغضبه وهو لا يدري ، كما جاء في الصحيح : \" إن الرجل ليتكلم بالكلمة من رضوان الله لا يلقي لها بالا يكتب له بها الجنة . وإن الرجل ليتكلم بالكلمة من سخط الله لا يلقي لها بالا يهوي بها في النار أبعد ما بين السماوات والأرض \" .\nثم ندب الله عز وجل ، إلى خفض الصوت عنده ، وحث على ذلك ، وأرشد إليه ، ورغب فيه ، فقال : ( إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى ) أي : أخلصها لها وجعلها أهلا ومحلا ( لهم مغفرة وأجر عظيم ) .\nوقد قال الإمام أحمد في كتاب الزهد : حدثنا عبد الرحمن ، حدثنا سفيان ، عن منصور ، عن مجاهد ، قال : كتب إلى عمر يا أمير المؤمنين ، رجل لا يشتهي المعصية ولا يعمل بها ، أفضل ، أم رجل يشتهي المعصية ولا يعمل بها ؟ فكتب عمر ، رضي الله عنه : إن الذين يشتهون المعصية ولا يعملون بها ( أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم ) . قال : وأنزل الله : ( إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى ) .\nوقد ذكر هذه القصة غير واحد من التابعين كذلك ، فقد نهى الله عز وجل ، عن رفع الأصوات بحضرة رسول الله - صلى الله عليه وسلم - وقد روينا عن أمير المؤمنين عمر بن الخطاب [ رضي الله عنه ] أنه سمع صوت رجلين في مسجد رسول الله - صلى الله عليه وسلم - قد ارتفعت أصواتهما ، فجاء ، فقال : أتدريان أين أنتما ؟ ثم قال : من أين أنتما ؟ قالا : من أهل الطائف . فقال : لو كنتما من أهل المدينة لأوجعتكما ضربا . وقال العلماء : يكره رفع الصوت عند قبره ، كما كان يكره في حياته ; لأنه محترم حيا وفي قبره ، صلوات الله وسلامه عليه ، دائما . ثم نهى عن الجهر له بالقول كما يجهر الرجل لمخاطبه ممن عداه ، بل يخاطب بسكينة ووقار وتعظيم ; ولهذا قال : ( ولا تجهروا له بالقول كجهر بعضكم لبعض ) ، كما قال : ( لا تجعلوا دعاء الرسول بينكم كدعاء بعضكم بعضا ) [ النور : 63 ] .\nوقوله : ( أن تحبط أعمالكم وأنتم لا تشعرون ) أي : إنما نهيناكم عن رفع الصوت عنده خشية أن يغضب من ذلك ، فيغضب الله لغضبه ، فيحبط الله عمل من أغضبه وهو لا يدري ، كما جاء في الصحيح : \" إن الرجل ليتكلم بالكلمة من رضوان الله لا يلقي لها بالا يكتب له بها الجنة . وإن الرجل ليتكلم بالكلمة من سخط الله لا يلقي لها بالا يهوي بها في النار أبعد ما بين السماوات والأرض \" .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض أن تحبط أعمالكم وأنتم لا تشعرون .\nفيه ست مسائل : الأولى : قوله تعالى : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي روى البخاري والترمذي عن ابن أبي مليكة قال : حدثني عبد الله بن الزبير أن الأقرع بن حابس قدم على النبي - صلى الله عليه وسلم - ، فقال أبو بكر : يا رسول الله استعمله على قومه ، فقال عمر : لا تستعمله يا رسول الله ، فتكلما عند النبي - صلى الله عليه وسلم - حتى ارتفعت أصواتهما ، فقال أبو بكر لعمر : ما أردت إلا خلافي . فقال عمر : ما أردت خلافك ، قال : فنزلت هذه الآية : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي قال : فكان عمر بعد ذلك إذا تكلم عند النبي - صلى الله عليه وسلم - لم يسمع كلامه حتى يستفهمه . قال : وما ذكر ابن الزبير جده يعني أبا بكر . قال : هذا حديث غريب حسن . وقد رواه بعضهم عن ابن أبي مليكة مرسلا ، لم يذكر فيه عن عبد الله بن الزبير .\nقلت : هو البخاري ، قال : عن ابن أبي مليكة كاد الخيران أن يهلكا أبو بكر وعمر ، رفعا أصواتهما عند النبي - صلى الله عليه وسلم - حين قدم عليه ركب بني تميم ، فأشار أحدهما بالأقرع بن حابس أخي بني مجاشع ، وأشار الآخر برجل آخر ، فقال نافع : لا أحفظ اسمه ، فقال أبو بكر لعمر : ما أردت إلا خلافي . فقال : ما أردت خلافك . فارتفعت أصواتهما في ذلك ، فأنزل الله - عز وجل - : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي الآية . فقال ابن الزبير : فما كان عمر يسمع رسول الله - صلى الله عليه وسلم - بعد هذه الآية حتى يستفهمه . ولم يذكر ذلك عن أبيه ، يعني أبا بكر الصديق .\nوذكر المهدوي عن علي - رضي الله عنه - : نزل قوله : لا ترفعوا أصواتكم فوق صوت النبي فينا لما ارتفعت أصواتنا أنا وجعفر وزيد بن حارثة ، نتنازع ابنة حمزة لما جاء بها زيد من مكة ، فقضى بها رسول الله - صلى الله عليه وسلم - لجعفر ; لأن خالتها عنده . وقد تقدم هذا الحديث في ( آل عمران ) وفي الصحيحين عن أنس بن مالك أن النبي - صلى الله عليه وسلم - افتقد ثابت بن قيس فقال رجل : يا رسول الله ، أنا أعلم لك علمه ، فأتاه فوجده جالسا في بيته منكسا رأسه ، فقال له : ما شأنك ؟ فقال : شر! كان يرفع صوته فوق صوت النبي - صلى الله عليه وسلم - فقد حبط عمله وهو من أهل النار . فأتى الرجل النبي - صلى الله عليه وسلم - فأخبره أنه قال كذا وكذا . فقال موسى : فرجع إليه المرة الآخرة ببشارة عظيمة ، فقال : اذهب إليه فقل له إنك لست من أهل النار ولكنك من أهل الجنة ( لفظ البخاري ) وثابت هذا هو ثابت بن قيس بن شماس الخزرجي يكنى أبا محمد بابنه محمد . وقيل : أبا عبد الرحمن . قتل له يوم الحرة ثلاثة من الولد : محمد ، ويحيى ، وعبد الله . وكان خطيبا بليغا معروفا بذلك ، كان يقال له خطيب رسول الله - صلى الله عليه وسلم - ، كما يقال لحسان شاعر رسول الله - صلى الله عليه وسلم - . ولما قدم وفد تميم على رسول الله - صلى الله عليه وسلم - وطلبوا المفاخرة قام خطيبهم فافتخر ، ثم قام ثابت بن قيس فخطب خطبة بليغة جزلة فغلبهم ، وقام شاعرهم وهو الأقرع بن حابس فأنشد :\nأتيناك كيما يعرف الناس فضلنا إذا خالفونا عند ذكر المكارم وإنا رءوس الناس من كل معشر\nوأن ليس في أرض الحجاز كدارم وإن لنا المرباع في كل غارة\nتكون بنجد أو بأرض التهائم\nفقام حسان فقال :\nبني دارم لا تفخروا إن فخركم يعود وبالا عند ذكر المكارم\nهبلتم علينا تفخرون وأنتم لنا خول من بين ظئر وخادم\nفي أبيات لهما .\nفقالوا : خطيبهم أخطب من خطيبنا ، وشاعرهم أشعر من شاعرنا ، فارتفعت أصواتهم فأنزل الله تعالى : لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول وقال عطاء الخراساني : حدثتني ابنة ثابت بن قيس قالت : لما نزلت : يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي الآية ، دخل أبوها بيته وأغلق عليه بابه ، ففقده النبي - صلى الله عليه وسلم - فأرسل إليه يسأله ما خبره ، فقال : أنا رجل شديد الصوت ، أخاف أن يكون حبط عملي . فقال - عليه السلام - : ( لست منهم بل تعيش بخير وتموت بخير ) . قال : ثم أنزل الله : إن الله لا يحب كل مختال فخور فأغلق بابه وطفق يبكي ، ففقده النبي - صلى الله عليه وسلم - فأرسل إليه فأخبره ، فقال : يا رسول الله ، إني أحب الجمال وأحب أن أسود قومي . فقال : ( لست منهم بل تعيش حميدا وتقتل شهيدا وتدخل الجنة ) . قالت : فلما كان يوم اليمامة خرج مع خالد بن الوليد إلى مسيلمة فلما التقوا انكشفوا ، فقال ثابت وسالم مولى أبي حذيفة : ما هكذا كنا نقاتل مع رسول الله - صلى الله عليه وسلم - ، ثم حفر كل واحد منهما له حفرة فثبتا وقاتلا حتى قتلا ، وعلى ثابت يومئذ درع له نفيسة ، فمر به رجل من المسلمين فأخذها ، فبينا رجل من المسلمين نائم أتاه ثابت في منامه فقال له : أوصيك بوصية ، فإياك أن تقول هذا حلم فتضيعه ، إني لما قتلت أمس مر بي رجل من المسلمين فأخذ درعي ومنزله في أقصى الناس ، وعند خبائه فرس يستن في طوله ، وقد كفأ على الدرع برمة ، وفوق البرمة رحل ، فأت خالدا فمره أن يبعث إلى درعي فيأخذها ، وإذا قدمت المدينة على خليفة رسول الله - صلى الله عليه وسلم - - يعني أبا بكر - فقل له : إن علي من الدين كذا وكذا ، وفلان من رقيقي عتيق وفلان ، فأتى الرجل خالدا فأخبره ، فبعث إلى الدرع فأتي بها وحدث أبا بكر برؤياه فأجاز وصيته . قال : ولا نعلم أحدا أجيزت وصيته بعد موته غير ثابت ، رحمه الله ، ذكره أبو عمر في الاستيعاب .\nالثانية : قوله تعالى : ولا تجهروا له بالقول أي لا تخاطبوه : يا محمد ، ويا أحمد . ولكن : يا نبي الله ، ويا رسول الله ، توقيرا له . وقيل : كان المنافقون يرفعون أصواتهم عند النبي - صلى الله عليه وسلم - ، ليقتدي بهم ضعفة المسلمين فنهي المسلمون عن ذلك . وقيل : لا تجهروا له أي : لا تجهروا عليه ، كما يقال : سقط لفيه ، أي : على فيه . كجهر بعضكم لبعض الكاف كاف التشبيه في محل النصب ، أي : لا تجهروا له جهرا مثل جهر بعضكم لبعض . وفي هذا دليل على أنهم لم ينهوا عن الجهر مطلقا حتى لا يسوغ لهم إلا أن يكلموه بالهمس والمخافتة ، وإنما نهوا عن جهر مخصوص مقيد بصفة ، أعني الجهر المنعوت بمماثلة ما قد اعتادوه منهم فيما بينهم ، وهو الخلو من مراعاة أبهة النبوة وجلالة مقدارها وانحطاط سائر الرتب وإن جلت عن رتبتها . أن تحبط أعمالكم وأنتم لا تشعرون أي من أجل أن تحبط ، أي : تبطل ، هذا قول البصريين . وقال الكوفيون : أي : لئلا تحبط أعمالكم .\nالثالثة : معنى الآية الأمر بتعظيم رسول الله - صلى الله عليه وسلم - وتوقيره ، وخفض الصوت بحضرته وعند مخاطبته ، أي : إذا نطق ونطقتم فعليكم ألا تبلغوا بأصواتكم وراء الحد الذي يبلغه بصوته ، وأن تغضوا منها بحيث يكون كلامه غالبا لكلامكم ، وجهره باهرا لجهركم ، حتى تكون مزيته عليكم لائحة ، وسابقته واضحة ، وامتيازه عن جمهوركم كشية الأبلق . لا أن تغمروا صوته بلغطكم ، وتبهروا منطقه بصخبكم . وفي قراءة ابن مسعود ( لا ترفعوا بأصواتكم ) وقد كره بعض العلماء رفع الصوت عند قبره - عليه السلام - . وكره بعض العلماء رفع الصوت في مجالس العلماء تشريفا لهم ، إذ هم ورثة الأنبياء .\nالرابعة : قال القاضي أبو بكر بن العربي : حرمة النبي - صلى الله عليه وسلم - ميتا كحرمته حيا ، وكلامه المأثور بعد موته في الرقعة مثال كلامه المسموع من لفظه ، فإذا قرئ كلامه ، وجب على كل حاضر ألا يرفع صوته عليه ، ولا يعرض عنه ، كما كان يلزمه ذلك في مجلسه عند تلفظه به . وقد نبه الله سبحانه على دوام الحرمة المذكورة على مرور الأزمنة بقوله تعالى : وإذا قرئ القرآن فاستمعوا له وأنصتوا . وكلامه - صلى الله عليه وسلم - من الوحي ، وله من الحكمة مثل ما للقرآن ، إلا معان مستثناة ، بيانها في كتب الفقه .\nالخامسة : وليس الغرض برفع الصوت ولا الجهر ما يقصد به الاستخفاف والاستهانة ; لأن ذلك كفر والمخاطبون مؤمنون . وإنما الغرض صوت هو في نفسه ، والمسموع من جرسه غير مناسب لما يهاب به العظماء ويوقر الكبراء ، فيتكلف الغض منه ورده إلى حد يميل به إلى ما يستبين فيه المأمور به من التعزير والتوقير . ولم يتناول النهي أيضا رفع الصوت الذي يتأذى به رسول الله - صلى الله عليه وسلم - ، وهو ما كان منهم في حرب أو مجادلة معاند أو إرهاب عدو أو ما أشبه ذلك ، ففي الحديث أنه قال - عليه السلام - للعباس بن عبد المطلب لما انهزم الناس يوم حنين : ( اصرخ بالناس ) ، وكان العباس أجهر الناس صوتا . يروى أن غارة أتتهم يوما فصاح العباس : يا صاحباه! فأسقطت الحوامل لشدة صوته ، وفيه يقول نابغة بني جعدة :\nزجر أبي عروة السباع إذا أشفق أن يختلطن بالغنم\nزعمت الرواة أنه كان يزجر السباع عن الغنم فيفتق مرارة السبع في جوفه .\nالسادسة : قال الزجاج : أن تحبط أعمالكم التقدير لأن تحبط ، أي : فتحبط أعمالكم ، فاللام المقدرة لام الصيرورة وليس قوله : أن تحبط أعمالكم وأنتم لا تشعرون بموجب أن يكفر الإنسان وهو لا يعلم ، فكما لا يكون الكافر مؤمنا إلا باختياره الإيمان على الكفر ، كذلك لا يكون المؤمن كافرا من حيث لا يقصد إلى الكفر ولا يختاره بإجماع . كذلك لا يكون الكافر كافرا من حيث لا يعلم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ ٢\n                                        \n                                        \n                                        \n                                        { يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ وَلَا تَجْهَرُوا لَهُ بِالْقَوْلِ } وهذا أدب مع رسول الله صلى الله عليه وسلم، في خطابه، أي: لا يرفع المخاطب له، صوته معه، فوق صوته، ولا يجهر له بالقول، بل يغض الصوت، ويخاطبه بأدب ولين، وتعظيم وتكريم، وإجلال وإعظام، ولا يكون الرسول كأحدهم، بل يميزوه في خطابهم، كما تميز عن غيره، في وجوب حقه على الأمة، ووجوب الإيمان به، والحب الذي لا يتم الإيمان إلا به، فإن في عدم القيام بذلك، محذورًا، وخشية أن يحبط عمل العبد وهو لا يشعر، كما أن الأدب معه، من أسباب [حصول الثواب و] قبول الأعمال.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَرۡفَعُوٓاْ أَصۡوَٰتَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِيِّ وَلَا تَجۡهَرُواْ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ ٢"
    },
    {
      "number": 4615,
      "text": "إِنَّ الَّذِينَ يَغُضُّونَ أَصْوَاتَهُمْ عِنْدَ رَسُولِ اللَّهِ أُولَٰئِكَ الَّذِينَ امْتَحَنَ اللَّهُ قُلُوبَهُمْ لِلتَّقْوَىٰ ۚ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ عَظِيمٌ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 3,
      "juz": 26,
      "manzil": 6,
      "page": 515,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ ٣\n                                    \n                                    \n                                    ثم ندب الله عز وجل ، إلى خفض الصوت عنده ، وحث على ذلك ، وأرشد إليه ، ورغب فيه ، فقال : ( إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى ) أي : أخلصها لها وجعلها أهلا ومحلا ( لهم مغفرة وأجر عظيم ) .\nوقد قال الإمام أحمد في كتاب الزهد : حدثنا عبد الرحمن ، حدثنا سفيان ، عن منصور ، عن مجاهد ، قال : كتب إلى عمر يا أمير المؤمنين ، رجل لا يشتهي المعصية ولا يعمل بها ، أفضل ، أم رجل يشتهي المعصية ولا يعمل بها ؟ فكتب عمر ، رضي الله عنه : إن الذين يشتهون المعصية ولا يعملون بها ( أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم ) .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ ٣\n                                    \n                                    \n                                    قوله تعالى : إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة وأجر عظيم\nقوله تعالى : إن الذين يغضون أصواتهم عند رسول الله أي يخفضون أصواتهم عنده إذا تكلموا إجلالا له ، أو كلموا غيره بين يديه إجلالا له . قال أبو هريرة : لما نزلت لا ترفعوا أصواتكم قال أبو بكر - رضي الله عنه - : والله لا أرفع صوتي إلا كأخي السرار . وذكر سنيد قال : حدثنا عباد بن العوام عن محمد بن عمرو عن أبي سلمة قال : لما نزلت : لا تقدموا بين يدي الله ورسوله قال أبو بكر : والذي بعثك بالحق لا أكلمك بعد هذا إلا كأخي السرار . وقال عبد الله بن الزبير : لما نزلت : لا ترفعوا أصواتكم ما حدث عمر عند النبي - صلى الله عليه وسلم - بعد ذلك فسمع كلامه حتى يستفهمه مما يخفض ، فنزلت : إن الذين يغضون أصواتهم عند رسول الله أولئك الذين امتحن الله قلوبهم للتقوى . قال الفراء : أي : أخلصها للتقوى . وقال الأخفش : أي : اختصها للتقوى . وقال ابن عباس : امتحن الله قلوبهم للتقوى طهرهم من كل قبيح ، وجعل في قلوبهم الخوف من الله والتقوى . وقال عمر - رضي الله عنه - : أذهب عن قلوبهم الشهوات . والامتحان : افتعال من محنت الأديم محنا حتى أوسعته . فمعنى امتحن الله قلوبهم للتقوى وسعها وشرحها للتقوى . وعلى الأقوال المتقدمة : امتحن قلوبهم فأخلصها ، كقولك : امتحنت الفضة أي : اختبرتها حتى خلصت . ففي الكلام حذف يدل عليه الكلام ، وهو الإخلاص . وقال أبو عمرو : كل شيء جهدته فقد محنته . وأنشد :\nأتت رذايا باديا كلالها قد محنت واضطربت آطالها\nلهم مغفرة وأجر عظيم .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ ٣\n                                        \n                                        \n                                        \n                                        ثم مدح من غض صوته عند رسول الله صلى الله عليه وسلم، بأن الله امتحن قلوبهم للتقوى، أي: ابتلاها واختبرها، فظهرت نتيجة ذلك، بأن صلحت قلوبهم للتقوى، ثم وعدهم المغفرة لذنوبهم، المتضمنة لزوال الشر والمكروه، والأجر العظيم، الذي لا يعلم وصفه إلا الله تعالى، وفي الأجر العظيم وجود المحبوب وفي هذا، دليل على أن الله يمتحن القلوب، بالأمر والنهي والمحن، فمن لازم أمر الله، واتبع رضاه، وسارع إلى ذلك، وقدمه على هواه، تمحض وتمحص للتقوى، وصار قلبه صالحًا لها ومن لم يكن كذلك، علم أنه لا يصلح للتقوى.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ يَغُضُّونَ أَصۡوَٰتَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُوْلَٰٓئِكَ ٱلَّذِينَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةٞ وَأَجۡرٌ عَظِيمٌ ٣"
    },
    {
      "number": 4616,
      "text": "إِنَّ الَّذِينَ يُنَادُونَكَ مِنْ وَرَاءِ الْحُجُرَاتِ أَكْثَرُهُمْ لَا يَعْقِلُونَ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 4,
      "juz": 26,
      "manzil": 6,
      "page": 515,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ ٤\n                                    \n                                    \n                                    ثم إنه تعالى ذم الذين ينادونه من وراء الحجرات ، وهي بيوت نسائه ، كما يصنع أجلاف الأعراب ، فقال : ( أكثرهم لا يعقلون )\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ ٤\n                                    \n                                    \n                                    قوله تعالى : إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون .\nقال مجاهد وغيره : نزلت في أعراب بني تميم ، قدم الوفد منهم على النبي - صلى الله عليه وسلم - ، فدخلوا المسجد ونادوا النبي - صلى الله عليه وسلم - من وراء حجرته أن اخرج إلينا ، فإن مدحنا زين وذمنا شين . وكانوا سبعين رجلا قدموا الفداء ذراري لهم ، وكان النبي - صلى الله عليه وسلم - نام للقائلة . وروي أن الذي نادى الأقرع بن حابس ، وأنه القائل : إن مدحي زين وإن ذمي شين ، فقال النبي - صلى الله عليه وسلم - : ( ذاك الله ) . ذكره الترمذي عن البراء بن عازب أيضا .\nوروى زيد بن أرقم فقال : أتى أناس النبي - صلى الله عليه وسلم - فقال بعضهم لبعض : انطلقوا بنا إلى هذا الرجل ، فإن يكن نبيا فنحن أسعد الناس باتباعه ، وإن يكن ملكا نعش في جنابه . فأتوا النبي - صلى الله عليه وسلم - فجعلوا ينادونه وهو في حجرته : يا محمد ، يا محمد ، فأنزل الله تعالى هذه الآية . قيل : إنهم كانوا من بني تميم . قال مقاتل كانوا تسعة عشر : قيس بن عاصم ، والزبرقان بن بدر ، والأقرع بن حابس ، وسويد بن هاشم ، وخالد بن مالك ، وعطاء بن حابس ، والقعقاع بن معبد ، ووكيع بن وكيع ، وعيينة بن حصن وهو الأحمق المطاع ، وكان من الجرارين يجر عشرة آلاف قناة ، أي : يتبعه ، وكان اسمه حذيفة وسمي عيينة لشتر كان في عينيه ذكر عبد الرزاق في عيينة هذا : أنه الذي نزل فيه ولا تطع من أغفلنا قلبه عن ذكرنا . وقد مضى في آخر ( الأعراف ) من قوله لعمر - رضي الله عنه - ما فيه كفاية ، ذكره البخاري .\nوروي أنهم وفدوا وقت الظهيرة ورسول الله - صلى الله عليه وسلم - راقد ، فجعلوا ينادونه : يا محمد يا محمد ، اخرج إلينا ، فاستيقظ وخرج ، ونزلت . وسئل رسول الله - صلى الله عليه وسلم - فقال : ( هم جفاة بني تميم لولا أنهم من أشد الناس قتالا للأعور الدجال لدعوت الله عليهم أن يهلكهم ) . والحجرات جمع حجرة ، كالغرفات جمع غرفة ، والظلمات جمع ظلمة . وقيل : الحجرات جمع الحجر ، والحجر جمع حجرة ، فهو جمع الجمع . وفيه لغتان : ضم الجيم وفتحها . قال :\nولما رأونا باديا ركباتنا على موطن لا نخلط الجد بالهزل\nوالحجرة : الرقعة من الأرض المحجورة بحائط يحوط عليها . وحظيرة الإبل تسمى الحجرة ، وهي فعلة بمعنى مفعولة . وقرأ أبو جعفر بن القعقاع ( الحجرات ) بفتح الجيم استثقالا للضمتين . وقرئ ( الحجرات ) بسكون الجيم تخفيفا . وأصل الكلمة المنع . وكل ما منعت أن يوصل إليه فقد حجرت عليه . ثم يحتمل أن يكون المنادي بعضا من الجملة فلهذا قال : أكثرهم لا يعقلون أي إن الذين ينادونك من جملة قوم الغالب عليهم الجهل .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ ٤\n                                        \n                                        \n                                        \n                                        نزلت هذه الآيات الكريمة، في أناس من الأعراب، الذين وصفهم الله تعالى بالجفاء، وأنهم أجدر أن لا يعلموا حدود ما أنزل الله على رسوله، قدموا وافدين على رسول الله صلى الله عليه وسلم، فوجدوه في بيته وحجرات نسائه، فلم يصبروا ويتأدبوا حتى يخرج، بل نادوه: يا محمد يا محمد، [أي: اخرج إلينا]، فذمهم الله بعدم العقل، حيث لم يعقلوا عن الله الأدب مع رسوله واحترامه، كما أن من العقل وعلامته استعمال الأدب.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ ٤"
    }
  ]
}