{
  "number": 516,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 4617,
      "text": "وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّىٰ تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَهُمْ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 5,
      "juz": 26,
      "manzil": 6,
      "page": 516,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٥\n                                    \n                                    \n                                    ثم أرشد إلى الأدب في ذلك فقال : ( ولو أنهم صبروا حتى تخرج إليهم لكان خيرا لهم ) أي : لكان لهم في ذلك الخيرة والمصلحة في الدنيا والآخرة .\nثم قال داعيا لهم إلى التوبة والإنابة : ( والله غفور رحيم )\nوقد ذكر أنها نزلت في الأقرع بن حابس التميمي ، فيما أورده غير واحد ، قال الإمام أحمد : حدثنا عفان ، حدثنا وهيب ، حدثنا موسى بن عقبة ، عن أبي سلمة بن عبد الرحمن ، عن الأقرع بن حابس ; أنه نادى رسول الله - صلى الله عليه وسلم - من وراء الحجرات ، فقال : يا محمد ، يا محمد وفي رواية : يا رسول الله - فلم يجبه . فقال : يا رسول الله ، إن حمدي لزين ، وإن ذمي لشين ، فقال : \" ذاك الله عز وجل \" .\nوقال ابن جرير : حدثنا أبو عمار الحسين بن حريث المروزي ، حدثنا الفضل بن موسى ، عن الحسين بن واقد ، عن أبي إسحاق ، عن البراء في قوله : ( إن الذين ينادونك من وراء الحجرات ) قال : جاء رجل رسول الله فقال : يا محمد ، إن حمدي زين ، وذمي شين . فقال : \" ذاك الله عز وجل \" .\nوهكذا ذكره الحسن البصري ، وقتادة مرسلا .\nوقال سفيان الثوري ، عن حبيب بن أبي عمرة قال : كان بشر بن غالب ولبيد بن عطارد - أو بشر بن عطارد ولبيد بن غالب - وهما عند الحجاج جالسان - فقال بشر بن غالب للبيد بن عطارد : نزلت في قومك بني تميم : ( إن الذين ينادونك من وراء الحجرات ) قال : فذكرت ذلك لسعيد بن جبير فقال : أما إنه لو علم بآخر الآية أجابه : ( يمنون عليك أن أسلموا ) [ الحجرات : 17 ] ، قالوا : أسلمنا ، ولم يقاتلك بنو أسد .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا عمرو بن علي الباهلي ، حدثنا المعتمر بن سليمان : سمعت داود الطفاوي يحدث عن أبي مسلم البجلي ، عن زيد بن أرقم قال : اجتمع أناس من العرب فقالوا : انطلقوا بنا إلى هذا الرجل ، فإن يك نبيا فنحن أسعد الناس به ، وإن يك ملكا نعش بجناحه . قال : فأتيت رسول الله - صلى الله عليه وسلم - فأخبرته بما قالوا ، فجاءوا إلى حجرته فجعلوا ينادونه وهو في حجرته : يا محمد ، يا محمد . فأنزل الله [ عز وجل ] : ( إن الذين ينادونك من وراء الحجرات أكثرهم لا يعقلون ) قال : فأخذ رسول الله - صلى الله عليه وسلم - بأذني فمدها ، فجعل يقول : \" لقد صدق الله قولك يا زيد ، لقد صدق الله قولك يا زيد \" .\nورواه ابن جرير ، عن الحسن بن عرفة ، عن المعتمر بن سليمان ، به .\n                                    ",
        "qortoby": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٥\n                                    \n                                    \n                                    قوله تعالى : ولو أنهم صبروا حتى تخرج إليهم لكان خيرا لهم والله غفور رحيم .\nأي لو انتظروا خروجك لكان أصلح في دينهم ودنياهم . وكان - صلى الله عليه وسلم - لا يحتجب عن الناس إلا في أوقات يشتغل فيهما بمهمات نفسه ، فكان إزعاجه في تلك الحالة من سوء الأدب وقيل : كانوا جاءوا شفعاء في أسارى بني عنبر فأعتق رسول الله - صلى الله عليه وسلم - نصفهم ، وفادى على النصف . ولو صبروا لأعتق جميعهم بغير فداء . والله غفور رحيم\n                                    ",
        "saadi": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٥\n                                        \n                                        \n                                        \n                                        فأدب العبد، عنوان عقله، وأن الله مريد به الخير، ولهذا قال: { وَلَوْ أَنَّهُمْ صَبَرُوا حَتَّى تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَهُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ } أي: غفور لما صدر عن عباده من الذنوب، والإخلال بالآداب، رحيم بهم، حيث لم يعاجلهم بذنوبهم بالعقوبات والمثلات.\n                                    "
      },
      "originalText": "وَلَوۡ أَنَّهُمۡ صَبَرُواْ حَتَّىٰ تَخۡرُجَ إِلَيۡهِمۡ لَكَانَ خَيۡرٗا لَّهُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٥"
    },
    {
      "number": 4618,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَنْ تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 6,
      "juz": 26,
      "manzil": 6,
      "page": 516,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ ٦\n                                    \n                                    \n                                    يأمر تعالى بالتثبت في خبر الفاسق ليحتاط له ، لئلا يحكم بقوله فيكون في نفس الأمر - كاذبا أو مخطئا ، فيكون الحاكم بقوله قد اقتفى وراءه ، وقد نهى الله عن اتباع سبيل المفسدين ، ومن هاهنا امتنع طوائف من العلماء من قبول رواية مجهول الحال لاحتمال فسقه في نفس الأمر ، وقبلها آخرون لأنا إنما أمرنا بالتثبت عند خبر الفاسق ، وهذا ليس بمحقق الفسق لأنه مجهول الحال . وقد قررنا هذه المسألة في كتاب العلم من شرح البخاري ، ولله الحمد والمنة .\nوقد ذكر كثير من المفسرين أن هذه الآية نزلت في الوليد بن عقبة بن أبي معيط ، حين بعثه رسول الله - صلى الله عليه وسلم - على صدقات بني المصطلق . وقد روي ذلك من طرق ، ومن أحسنها ما رواه الإمام أحمد في مسنده من رواية ملك بني المصطلق ، وهو الحارث بن ضرار ، والد جويرية بنت الحارث أم المؤمنين ، رضي الله عنها ، قال الإمام أحمد : حدثنا محمد بن سابق ، حدثنا عيسى بن دينار ، حدثني أبي أنه سمع الحارث بن ضرار الخزاعي يقول : قدمت على رسول الله - صلى الله عليه وسلم - فدعاني إلى الإسلام ، فدخلت فيه وأقررت به ، ودعاني إلى الزكاة فأقررت بها ، وقلت : يا رسول الله ، أرجع إليهم فأدعوهم إلى الإسلام وأداء الزكاة ، فمن استجاب لي جمعت زكاته ، ويرسل إلي رسول الله رسولا لإبان كذا وكذا ليأتيك بما جمعت من الزكاة . فلما جمع الحارث الزكاة ممن استجاب له ، وبلغ الإبان الذي أراد رسول الله - صلى الله عليه وسلم - أن يبعث إليه ، احتبس عليه الرسول فلم يأته ، فظن الحارث أنه قد حدث فيه سخطة من الله ورسوله ، فدعا بسروات قومه ، فقال لهم : إن رسول الله - صلى الله عليه وسلم - كان وقت لي وقتا يرسل إلي رسوله ليقبض ما كان عندي من الزكاة ، وليس من رسول الله - صلى الله عليه وسلم - الخلف ، ولا أرى حبس رسوله إلا من سخطة كانت ، فانطلقوا فنأتي رسول الله - صلى الله عليه وسلم - وبعث رسول الله - صلى الله عليه وسلم - الوليد بن عقبة إلى الحارث ليقبض ما كان عنده مما جمع من الزكاة ، فلما أن سار الوليد حتى بلغ بعض الطريق فرق - أي : خاف - فرجع فأتى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله ، إن الحارث منعني الزكاة وأراد قتلي . فضرب رسول الله - صلى الله عليه وسلم - البعث إلى الحارث . وأقبل الحارث بأصحابه حتى إذا استقبل البعث وفصل عن المدينة لقيهم الحارث ، فقالوا : هذا الحارث ، فلما غشيهم قال لهم : إلى من بعثتم ؟ قالوا : إليك . قال : ولم ؟ قالوا : إن رسول الله - صلى الله عليه وسلم - كان بعث إليك الوليد بن عقبة ، فزعم أنك منعته الزكاة وأردت قتله . قال : لا والذي بعث محمدا بالحق ما رأيته بتة ولا أتاني . فلما دخل الحارث على رسول الله - صلى الله عليه وسلم - قال : \" منعت الزكاة وأردت قتل رسولي ؟ \" . قال : لا والذي بعثك بالحق ما رأيته ولا أتاني ، وما أقبلت إلا حين احتبس علي رسول رسول الله - صلى الله عليه وسلم - خشيت أن يكون كانت سخطة من الله ورسوله . قال : فنزلت الحجرات : ( يا أيها الذين آمنوا إن جاءكم فاسق بنبإ ) إلى قوله : ( حكيم )\nورواه ابن أبي حاتم عن المنذر بن شاذان التمار ، عن محمد بن سابق به . ورواه الطبراني من حديث محمد بن سابق ، به ، غير أنه سماه الحارث بن سرار ، والصواب : الحارث بن ضرار ، كما تقدم .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا جعفر بن عون ، عن موسى بن عبيدة ، عن ثابت مولى أم سلمة ، عن أم سلمة قالت : بعث رسول الله - صلى الله عليه وسلم - رجلا في صدقات بني المصطلق بعد الوقيعة ، فسمع بذلك القوم ، فتلقوه يعظمون أمر رسول الله - صلى الله عليه وسلم - قالت : فحدثه الشيطان أنهم يريدون قتله ، قالت : فرجع إلى رسول الله فقال : إن بني المصطلق قد منعوني صدقاتهم . فغضب رسول الله - صلى الله عليه وسلم - والمسلمون . قالت : فبلغ القوم رجوعه فأتوا رسول الله - صلى الله عليه وسلم - فصفوا له حين صلى الظهر ، فقالوا : نعوذ بالله من سخط الله وسخط رسوله ، بعثت إلينا رجلا مصدقا ، فسررنا بذلك ، وقرت به أعيننا ، ثم إنه رجع من بعض الطريق ، فخشينا أن يكون ذلك غضبا من الله ومن رسوله ، فلم يزالوا يكلمونه حتى جاء بلال فأذن بصلاة العصر ، قالت : ونزلت : ( يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا أن تصيبوا قوما بجهالة فتصبحوا على ما فعلتم نادمين ) .\nوروى ابن جرير أيضا من طريق العوفي ، عن ابن عباس في هذه الآية قال : كان رسول الله - صلى الله عليه وسلم - بعث الوليد بن عقبة بن أبي معيط إلى بني المصطلق ليأخذ منهم الصدقات ، وإنهم لما أتاهم الخبر فرحوا وخرجوا يتلقون رسول رسول الله - صلى الله عليه وسلم - وأنه لما حدث الوليد أنهم خرجوا يتلقونه ، رجع الوليد إلى رسول الله - صلى الله عليه وسلم - فقال : يا رسول الله ، إن بني المصطلق قد منعوا الصدقة . فغضب رسول الله - صلى الله عليه وسلم - من ذلك غضبا شديدا ، فبينا هو يحدث نفسه أن يغزوهم إذ أتاه الوفد فقالوا : يا رسول الله ، إنا حدثنا أن رسولك رجع من نصف الطريق ، وإنا خشينا أن ما رده كتاب جاء منك لغضب غضبته علينا ، وإنا نعوذ بالله من غضبه وغضب رسوله . وإن النبي - صلى الله عليه وسلم - استغشهم وهم بهم ، فأنزل الله عذرهم في الكتاب ، فقال : ( يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا ) إلى آخر الآية .\nوقال مجاهد وقتادة : أرسل رسول الله الوليد بن عقبة إلى بني المصطلق ليصدقهم ، فتلقوه بالصدقة ، فرجع فقال : إن بني المصطلق قد جمعت لك لتقاتلك زاد قتادة : وإنهم قد ارتدوا عن الإسلام - فبعث رسول الله خالد بن الوليد إليهم ، وأمره أن يتثبت ولا يعجل . فانطلق حتى أتاهم ليلا فبعث عيونه ، فلما جاءوا أخبروا خالدا أنهم مستمسكون بالإسلام ، وسمعوا أذانهم وصلاتهم ، فلما أصبحوا أتاهم خالد فرأى الذي يعجبه ، فرجع إلى رسول الله - صلى الله عليه وسلم - فأخبره الخبر ، فأنزل الله هذه الآية . قال قتادة : فكان رسول الله - صلى الله عليه وسلم - يقول : \" التبين من الله ، والعجلة من الشيطان \" .\nوكذا ذكر غير واحد من السلف ، منهم : ابن أبي ليلى ، ويزيد بن رومان ، والضحاك ، ومقاتل بن حيان ، وغيرهم في هذه الآية : أنها نزلت في الوليد بن عقبة ، والله أعلم .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ ٦\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا إن جاءكم فاسق بنبإ فتبينوا أن تصيبوا قوما بجهالة فتصبحوا على ما فعلتم نادمين .\nفيه سبع مسائل : الأولى : قوله تعالى : يا أيها الذين آمنوا إن جاءكم فاسق بنبإ قيل : إن هذه الآية نزلت في الوليد بن عقبة بن أبي معيط . وسبب ذلك ما رواه سعيد عن قتادة أن النبي - صلى الله عليه وسلم - بعث الوليد بن عقبة مصدقا إلى بني المصطلق ، فلما أبصروه أقبلوا نحوه فهابهم - في رواية : لإحنة كانت بينه وبينهم - ، فرجع إلى النبي - صلى الله عليه وسلم - فأخبره أنهم قد ارتدوا عن الإسلام . فبعث نبي الله - صلى الله عليه وسلم - خالد بن الوليد وأمره أن يتثبت ولا يعجل ، فانطلق خالد حتى أتاهم ليلا ، فبعث عيونه فلما جاءوا أخبروا خالدا أنهم متمسكون بالإسلام ، وسمعوا أذانهم وصلاتهم ، فلما أصبحوا أتاهم خالد ورأى صحة ما ذكروه ، فعاد إلى نبي الله - صلى الله عليه وسلم - فأخبره ، فنزلت هذه الآية ، فكان يقول نبي الله - صلى الله عليه وسلم - : ( التأني من الله والعجلة من الشيطان ) .\nوفي رواية : أن النبي - صلى الله عليه وسلم - بعثه إلى بني المصطلق بعد إسلامهم ، فلما سمعوا به ركبوا إليه ، فلما سمع بهم خافهم ، فرجع إلى رسول الله - صلى الله عليه وسلم - فأخبره أن القوم قد هموا بقتله ، ومنعوا صدقاتهم . فهم رسول الله - صلى الله عليه وسلم - بغزوهم ، فبينما هم كذلك إذ قدم وفدهم على رسول الله - صلى الله عليه وسلم - فقالوا : يا رسول الله ، سمعنا برسولك فخرجنا إليه لنكرمه ، ونؤدي إليه ما قبلنا من الصدقة ، فاستمر راجعا ، وبلغنا أنه يزعم لرسول الله أنا خرجنا لنقاتله ، والله ما خرجنا لذلك ، فأنزل الله تعالى هذه الآية .\nوسمي الوليد فاسقا أي : كاذبا . قال ابن زيد ومقاتل وسهل بن عبد الله : الفاسق الكذاب . وقال أبو الحسن الوراق : هو المعلن بالذنب . وقال ابن طاهر : الذي لا يستحي من الله . وقرأ حمزة والكسائي ( فتثبتوا ) من التثبت . الباقون فتبينوا من التبيين أن تصيبوا أي لئلا تصيبوا ، ف ( أن ) في محل نصب بإسقاط الخافض . قوما بجهالة أي بخطإ . فتصبحوا على ما فعلتم على العجلة وترك التأني .\nالثانية : في هذه الآية دليل على قبول خبر الواحد إذا كان عدلا ; لأنه إنما أمر فيها بالتثبت عند نقل خبر الفاسق . ومن ثبت فسقه بطل قوله في الأخبار إجماعا ; لأن الخبر أمانة والفسق قرينة يبطلها . وقد استثنى الإجماع من جملة ذلك ما يتعلق بالدعوى والجحود ، وإثبات حق مقصود على الغير ، مثل أن يقول : هذا عبدي ، فإنه يقبل قوله . وإذا قال : قد أنفذ فلان هذا لك هدية ، فإنه يقبل ذلك . وكذلك يقبل في مثله خبر الكافر . وكذلك إذا أقر لغيره بحق على نفسه فلا يبطل إجماعا . وأما في الإنشاء على غيره فقال الشافعي وغيره : لا يكون وليا في النكاح . وقال أبو حنيفة ومالك : يكون وليا لأنه يلي مالها فيلي بضعها . كالعدل ، وهو وإن كان فاسقا في دينه إلا أن غيرته موفرة وبها يحمي الحريم ، وقد يبذل المال ويصون الحرمة ، وإذا ولي المال فالنكاح أولى .\nالثالثة : قال ابن العربي : ومن العجب أن يجوز الشافعي ونظراؤه إمامة الفاسق . ومن لا يؤتمن على حبة مال كيف يصح أن يؤتمن على قنطار دين . وهذا إنما كان أصله أن الولاة الذين كانوا يصلون بالناس لما فسدت أديانهم ولم يمكن ترك الصلاة وراءهم ، ولا استطيعت إزالتهم صلي معهم ووراءهم ، كما قال عثمان : الصلاة أحسن ما يفعل الناس ، فإذا أحسنوا فأحسن ، وإذا أساءوا فاجتنب إساءتهم . ثم كان من الناس من إذا صلى معهم تقية أعادوا الصلاة لله ، ومنهم من كان يجعلها صلاته . وبوجوب الإعادة أقول ، فلا ينبغي لأحد أن يترك الصلاة مع من لا يرضى من الأئمة ، ولكن يعيد سرا في نفسه ، ولا يؤثر ذلك عند غيره .\nالرابعة : وأما أحكامه إن كان واليا فينفذ منها ما وافق الحق ويرد ما خالفه ، ولا ينقض حكمه الذي أمضاه بحال ، ولا تلتفتوا إلى غير هذا القول من رواية تؤثر أو قول يحكى ، فإن الكلام كثير والحق ظاهر .\nالخامسة : لا خلاف في أنه يصح أن يكون رسولا عن غيره في قول يبلغه أو شيء يوصله ، أو إذن يعلمه ، إذا لم يخرج عن حق المرسل ، والمبلغ ، فإن تعلق به حق لغيرهما لم يقبل قوله . وهذا جائز للضرورة الداعية إليه ، فإنه لو لم يتصرف بين الخلق في هذه المعاني إلا العدول لم يحصل منها شيء لعدمهم في ذلك . والله أعلم .\nالسادسة : وفي الآية دليل على فساد من قال : إن المسلمين كلهم عدول حتى تثبت الجرحة ; لأن الله تعالى أمر بالتثبت قبل القبول ، ولا معنى للتثبت بعد إنفاذ الحكم ، فإن حكم الحاكم قبل التثبت فقد أصاب المحكوم عليه بجهالة .\nالسابعة : فإن قضى بما يغلب على الظن لم يكن ذلك عملا بجهالة ، كالقضاء بالشاهدين العدلين ، وقبول قول العالم المجتهد . وإنما العمل بالجهالة قبول قول من لا يحصل غلبة الظن بقبوله . ذكر هذه المسألة القشيري ، والذي قبلها المهدوي .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ ٦\n                                        \n                                        \n                                        \n                                        وهذا أيضًا، من الآداب التي على أولي الألباب، التأدب بها واستعمالها، وهو أنه إذا أخبرهم فاسق بخبر أن يتثبتوا في خبره، ولا يأخذوه مجردًا، فإن في ذلك خطرًا كبيرًا، ووقوعًا في الإثم، فإن خبره إذا جعل بمنزلة خبر الصادق العدل، حكم بموجب ذلك ومقتضاه، فحصل من تلف النفوس والأموال، بغير حق، بسبب ذلك الخبر ما يكون سببًا للندامة، بل الواجب عند خبر الفاسق، التثبت والتبين، فإن دلت الدلائل والقرائن على صدقه، عمل به وصدق، وإن دلت على كذبه، كذب، ولم يعمل به، ففيه دليل، على أن خبر الصادق مقبول، وخبر الكاذب، مردود، وخبر الفاسق متوقف فيه كما ذكرنا، ولهذا كان السلف يقبلون روايات كثير [من] الخوارج، المعروفين بالصدق، ولو كانوا فساقًا.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ ٦"
    },
    {
      "number": 4619,
      "text": "وَاعْلَمُوا أَنَّ فِيكُمْ رَسُولَ اللَّهِ ۚ لَوْ يُطِيعُكُمْ فِي كَثِيرٍ مِنَ الْأَمْرِ لَعَنِتُّمْ وَلَٰكِنَّ اللَّهَ حَبَّبَ إِلَيْكُمُ الْإِيمَانَ وَزَيَّنَهُ فِي قُلُوبِكُمْ وَكَرَّهَ إِلَيْكُمُ الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ۚ أُولَٰئِكَ هُمُ الرَّاشِدُونَ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 7,
      "juz": 26,
      "manzil": 6,
      "page": 516,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ ٧\n                                    \n                                    \n                                    وقوله : ( واعلموا أن فيكم رسول الله ) أي : اعلموا أن بين أظهركم رسول الله فعظموه ووقروه ، وتأدبوا معه ، وانقادوا لأمره ، فإنه أعلم بمصالحكم ، وأشفق عليكم منكم ، ورأيه فيكم أتم من رأيكم لأنفسكم ، كما قال تعالى : ( النبي أولى بالمؤمنين من أنفسهم ) [ الأحزاب : 6 ] .\nثم بين [ تعالى ] أن رأيهم سخيف بالنسبة إلى مراعاة مصالحهم فقال : ( لو يطيعكم في كثير من الأمر لعنتم ) أي : لو أطاعكم في جميع ما تختارونه لأدى ذلك إلى عنتكم وحرجكم ، كما قال تعالى : ( ولو اتبع الحق أهواءهم لفسدت السماوات والأرض ومن فيهن بل أتيناهم بذكرهم فهم عن ذكرهم معرضون ) [ المؤمنون : 71 ] .\nوقوله : ( ولكن الله حبب إليكم الإيمان وزينه في قلوبكم ) أي : حببه إلى نفوسكم وحسنه في قلوبكم .\nقال الإمام أحمد : حدثنا بهز ، حدثنا علي بن مسعدة ، حدثنا قتادة ، عن أنس قال : كان رسول الله - صلى الله عليه وسلم - يقول : \" الإسلام علانية ، والإيمان في القلب \" قال : ثم يشير بيده إلى صدره ثلاث مرات ، ثم يقول : \" التقوى هاهنا ، التقوى هاهنا \" .\n( وكره إليكم الكفر والفسوق والعصيان ) أي : وبغض إليكم الكفر والفسوق ، وهي : الذنوب الكبار . والعصيان وهي جميع المعاصي . وهذا تدريج لكمال النعمة .\nوقوله : ( أولئك هم الراشدون ) أي : المتصفون بهذه الصفة هم الراشدون ، الذين قد آتاهم الله رشدهم .\nقال الإمام أحمد : حدثنا مروان بن معاوية الفزاري ، حدثنا عبد الواحد بن أيمن المكي ، عن ابن رفاعة الزرقي ، عن أبيه قال : لما كان يوم أحد وانكفأ المشركون ، قال رسول الله - صلى الله عليه وسلم - : \" استووا حتى أثني على ربي عز وجل \" فصاروا خلفه صفوفا ، فقال : \" اللهم لك الحمد كله . اللهم لا قابض لما بسطت ، ولا باسط لما قبضت ، ولا هادي لمن أضللت ، ولا مضل لمن هديت . ولا معطي لما منعت ، ولا مانع لما أعطيت . ولا مقرب لما باعدت ، ولا مباعد لما قربت . اللهم ابسط علينا من بركاتك ورحمتك وفضلك ورزقك . اللهم إني أسألك النعيم المقيم الذي لا يحول ولا يزول . اللهم إني أسألك النعيم يوم العيلة ، والأمن يوم الخوف . اللهم إنى عائذ بك من شر ما أعطيتنا ، ومن شر ما منعتنا . اللهم حبب إلينا الإيمان وزينه في قلوبنا ، وكره إلينا الكفر والفسوق والعصيان ، واجعلنا من الراشدين . اللهم توفنا مسلمين ، وأحينا مسلمين ، وألحقنا بالصالحين ، غير خزايا ولا مفتونين . اللهم قاتل الكفرة الذين يكذبون رسلك ويصدون عن سبيلك ، واجعل عليهم رجزك وعذابك . اللهم قاتل الكفرة الذين أوتوا الكتاب ، إله الحق \" .\nورواه النسائي في اليوم والليلة عن زياد بن أيوب ، عن مروان بن معاوية ، عن عبد الواحد بن أيمن ، عن عبيد بن رفاعة ، عن أبيه ، به .\nوفي الحديث المرفوع : \" من سرته حسنته ، وساءته سيئته ، فهو مؤمن \" .\n                                    ",
        "qortoby": "وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ ٧\n                                    \n                                    \n                                    وله تعالى : واعلموا أن فيكم رسول الله لو يطيعكم في كثير من الأمر لعنتم ولكن الله حبب إليكم الإيمان وزينه في قلوبكم وكره إليكم الكفر والفسوق والعصيان أولئك هم الراشدون.\nقوله تعالى : واعلموا أن فيكم رسول الله فلا تكذبوا ، فإن الله يعلمه أنباءكم فتفتضحون . لو يطيعكم في كثير من الأمر لعنتم أي لو تسارع إلى ما أردتم قبل وضوح الأمر لنالكم مشقة وإثم ، فإنه لو قتل القوم الذين سعى بهم الوليد بن عقبة إليه لكان خطأ ، ولعنت من أراد إيقاع الهلاك بأولئك القوم لعداوة كانت بينه وبينهم . ومعنى طاعة الرسول لهم : الائتمار بما يأمر به فيما يبلغونه عن الناس والسماع منهم . والعنت : الإثم ، يقال : عنت الرجل . والعنت أيضا الفجور والزنى ، كما في سورة ( النساء ) والعنت أيضا الوقوع في أمر شاق ، وقد مضى في آخر ( براءة ) القول في عنتم بأكثر من هذا . ولكن الله حبب إليكم الإيمان هذا خطاب للمؤمنين المخلصين الذين لا يكذبون النبي - صلى الله عليه وسلم - ولا يخبرون بالباطل ، أي : جعل الإيمان أحب الأديان إليكم . وزينه بتوفيقه . في قلوبكم أي : حسنه إليكم حتى اخترتموه . وفي هذا رد على القدرية والإمامية وغيرهم ، حسب ما تقدم في غير موضع . فهو سبحانه المنفرد بخلق ذوات الخلق وخلق أفعالهم وصفاتهم واختلاف ألسنتهم وألوانهم ، لا شريك له .\nوكره إليكم الكفر والفسوق والعصيان قال ابن عباس : يريد به الكذب خاصة . وقاله ابن زيد . وقيل : كل ما خرج عن الطاعة ، مشتق من فسقت الرطبة خرجت من قشرها . والفأرة من جحرها . وقد مضى في ( البقرة ) القول فيه مستوفى . والعصيان جمع المعاصي . أولئك هم يعني هم الذين وفقهم الله فحبب إليهم الإيمان وكره إليهم الكفر أي : قبحه عندهم ، الراشدون كقوله تعالى : وما آتيتم من زكاة تريدون وجه الله فأولئك هم المضعفون . قال النابغة :\nيا دار مية بالعلياء فالسند أقوت وطال عليها سالف الأمد\nوالرشد الاستقامة على طريق الحق مع تصلب فيه ، من الرشاد وهي الصخرة . قال أبو الوازع : كل صخرة رشادة . وأنشد :\nوغير مقلد وموشمات صلين الضوء من صم الرشاد\n                                    ",
        "saadi": "وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ ٧\n                                        \n                                        \n                                        \n                                        أي: ليكن لديكم معلومًا أن رسول الله صلى الله عليه وسلم، بين أظهركم، وهو الرسول الكريم، البار، الراشد، الذي يريد بكم الخير وينصح لكم، وتريدون لأنفسكم من الشر والمضرة، ما لا يوافقكم الرسول عليه، ولو يطيعكم في كثير من الأمر لشق عليكم وأعنتكم، ولكن الرسول يرشدكم، والله تعالى يحبب إليكم الإيمان، ويزينه في قلوبكم، بما أودع الله في قلوبكم من محبة الحق وإيثاره، وبما ينصب على الحق من الشواهد، والأدلة الدالة على صحته، وقبول القلوب والفطر له، وبما يفعله تعالى بكم، من توفيقه للإنابة إليه، ويكره إليكم الكفر والفسوق، أي: الذنوب الكبار، والعصيان: هي ما دون ذلك من الذنوب بما أودع في قلوبكم من كراهة الشر، وعدم إرادة فعله، وبما نصبه من الأدلة والشواهد على فساده، وعدم قبول الفطر له، وبما يجعله الله من الكراهة في القلوب له\n{ أُولَئِكَ } أي: الذين زين الله الإيمان في قلوبهم، وحببه إليهم، وكره إليهم الكفر والفسوق والعصيان { هُمُ الرَّاشِدُونَ } أي: الذين صلحت علومهم وأعمالهم، واستقاموا على الدين القويم، والصراط المستقيم.\nوضدهم الغاوون، الذين حبب إليهم الكفر والفسوق والعصيان، وكره إليهم الإيمان، والذنب ذنبهم، فإنهم لما فسقوا طبع الله على قلوبهم، ولما { زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ } ولما لم يؤمنوا بالحق لما جاءهم أول مرة، قلب الله أفئدتهم.\n                                    "
      },
      "originalText": " وَٱعۡلَمُوٓاْ أَنَّ فِيكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ يُطِيعُكُمۡ فِي كَثِيرٖ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيۡكُمُ ٱلۡإِيمَٰنَ وَزَيَّنَهُۥ فِي قُلُوبِكُمۡ وَكَرَّهَ إِلَيۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡيَانَۚ أُوْلَٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ ٧"
    },
    {
      "number": 4620,
      "text": "فَضْلًا مِنَ اللَّهِ وَنِعْمَةً ۚ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 8,
      "juz": 26,
      "manzil": 6,
      "page": 516,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٨\n                                    \n                                    \n                                    ثم قال : ( فضلا من الله ونعمة ) أي : هذا العطاء الذي منحكموه هو فضل منه عليكم ونعمة من لدنه ، ( والله عليم حكيم ) أي : عليم بمن يستحق الهداية ممن يستحق الغواية ، حكيم في أقواله وأفعاله ، وشرعه وقدره .\n                                    ",
        "qortoby": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٨\n                                    \n                                    \n                                    فضلا من الله ونعمة أي فعل الله ذلك بكم فضلا ، أي : الفضل والنعمة ، فهو مفعول له . والله عليم حكيم عليم بما يصلحكم حكيم في تدبيركم .\n                                    ",
        "saadi": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٨\n                                        \n                                        \n                                        \n                                        { فَضْلًا مِنَ اللَّهِ وَنِعْمَةً } أي: ذلك الخير الذي حصل لهم، هو بفضل الله عليهم وإحسانه، لا بحولهم وقوتهم.\n{ وَاللَّهُ عَلِيمٌ حَكِيمٌ } أي: عليم بمن يشكر النعمة، فيوفقه لها، ممن لا يشكرها، ولا تليق به، فيضع فضله، حيث تقتضيه حكمته.\n                                    "
      },
      "originalText": "فَضۡلٗا مِّنَ ٱللَّهِ وَنِعۡمَةٗۚ وَٱللَّهُ عَلِيمٌ حَكِيمٞ ٨"
    },
    {
      "number": 4621,
      "text": "وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا ۖ فَإِنْ بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَىٰ فَقَاتِلُوا الَّتِي تَبْغِي حَتَّىٰ تَفِيءَ إِلَىٰ أَمْرِ اللَّهِ ۚ فَإِنْ فَاءَتْ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ وَأَقْسِطُوا ۖ إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 9,
      "juz": 26,
      "manzil": 6,
      "page": 516,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٩\n                                    \n                                    \n                                    يقول تعالى آمرا بالإصلاح بين المسلمين الباغين بعضهم على بعض : ( وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما ) ، فسماهم مؤمنين مع الاقتتال . وبهذا استدل البخاري وغيره على أنه لا يخرج من الإيمان بالمعصية وإن عظمت ، لا كما يقوله الخوارج ومن تابعهم من المعتزلة ونحوهم . وهكذا ثبت في صحيح البخاري من حديث الحسن ، عن أبي بكرة أن رسول الله - صلى الله عليه وسلم - خطب يوما ومعه على المنبر الحسن بن علي ، فجعل ينظر إليه مرة وإلى الناس أخرى ويقول : \" إن ابني هذا سيد ولعل الله أن يصلح به بين فئتين عظيمتين من المسلمين \" . فكان كما قال ، صلوات الله وسلامه عليه ، أصلح الله به بين أهل الشام وأهل العراق ، بعد الحروب الطويلة والواقعات المهولة .\nوقوله : ( فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله ) أي : حتى ترجع إلى أمر الله وتسمع للحق وتطيعه ، كما ثبت في الصحيح عن أنس : أن رسول الله - صلى الله عليه وسلم - قال : \" انصر أخاك ظالما أو مظلوما \" . قلت : يا رسول الله ، هذا نصرته مظلوما فكيف أنصره ظالما ؟ قال : \" تمنعه من الظلم ، فذاك نصرك إياه \" .\nوقال الإمام أحمد : حدثنا عارم ، حدثنا معتمر قال : سمعت أبي يحدث : أن أنسا قال : قيل للنبي - صلى الله عليه وسلم - : لو أتيت عبد الله بن أبي ؟ فانطلق إليه نبي الله - صلى الله عليه وسلم - وركب حمارا ، وانطلق المسلمون يمشون ، وهي أرض سبخة ، فلما انطلق إليه النبي - صلى الله عليه وسلم - قال : \" إليك عني ، فوالله لقد آذاني ريح حمارك \" فقال رجل من الأنصار : والله لحمار رسول الله أطيب ريحا منك . قال : فغضب لعبد الله رجال من قومه ، فغضب لكل واحد منهما أصحابه ، قال : فكان بينهم ضرب بالجريد والأيدي والنعال ، فبلغنا أنه أنزلت فيهم : ( وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما )\nورواه البخاري في \" الصلح \" عن مسدد ، ومسلم في \" المغازي \" عن محمد بن عبد الأعلى ، كلاهما عن المعتمر بن سليمان ، عن أبيه ، به نحوه .\nوذكر سعيد بن جبير : أن الأوس والخزرج كان بينهما قتال بالسعف والنعال ، فأنزل الله هذه الآية ، فأمر بالصلح بينهما .\nوقال السدي : كان رجل من الأنصار يقال له : \" عمران \" ، كانت له امرأة تدعى أم زيد ، وإن المرأة أرادت أن تزور أهلها فحبسها زوجها وجعلها في علية له لا يدخل عليها أحد من أهلها . وإن المرأة بعثت إلى أهلها ، فجاء قومها وأنزلوها لينطلقوا بها ، وإن الرجل قد كان خرج ، فاستعان أهل الرجل ، فجاء بنو عمه ليحولوا بين المرأة وبين أهلها ، فتدافعوا واجتلدوا بالنعال ، فنزلت فيهم هذه الآية . فبعث إليهم رسول الله - صلى الله عليه وسلم - وأصلح بينهم ، وفاءوا إلى أمر الله .\nوقوله : ( فإن فاءت فأصلحوا بينهما بالعدل وأقسطوا إن الله يحب المقسطين ) أي : اعدلوا بينهم فيما كان أصاب بعضهم لبعض ، بالقسط ، وهو العدل ، ( إن الله يحب المقسطين )\nقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا محمد بن أبي بكر المقدمي ، حدثنا عبد الأعلى ، عن معمر ، عن الزهري ، عن سعيد بن المسيب ، عن عبد الله بن عمر أن رسول الله - صلى الله عليه وسلم - قال : \" إن المقسطين في الدنيا على منابر من لؤلؤ بين يدي الرحمن ، بما أقسطوا في الدنيا \" .\nورواه النسائي عن محمد بن المثنى ، عن عبد الأعلى ، به . وهذا إسناده جيد قوي ، رجاله على شرط الصحيح .\nوحدثنا محمد بن عبد الله بن يزيد ، حدثنا سفيان بن عيينة ، عن عمرو بن دينار ، عن عمرو بن أوس ، عن عبد الله بن عمرو ، عن النبي - صلى الله عليه وسلم - قال : \" المقسطون عند الله يوم القيامة على منابر من نور على يمين العرش ، الذين يعدلون في حكمهم وأهاليهم وما ولوا \" .\nورواه مسلم والنسائي ، من حديث سفيان بن عيينة ، به .\n                                    ",
        "qortoby": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٩\n                                    \n                                    \n                                    قوله تعالى : وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله فإن فاءت فأصلحوا بينهما بالعدل وأقسطوا إن الله يحب المقسطين .\nفيه عشر مسائل :\nالأولى : قوله تعالى : وإن طائفتان من المؤمنين اقتتلوا روى المعتمر بن سليمان عن أنس بن مالك قال : قلت : يا نبي الله ، لو أتيت عبد الله بن أبي ؟ فانطلق إليه النبي - صلى الله عليه وسلم - ، فركب حمارا وانطلق المسلمون يمشون ، وهي أرض سبخة ، فلما أتاه النبي - صلى الله عليه وسلم - قال : إليك عني! فوالله لقد آذاني نتن حمارك . فقال رجل من الأنصار : والله لحمار رسول الله - صلى الله عليه وسلم - أطيب ريحا منك . فغضب لعبد الله رجل من قومه ، وغضب لكل واحد منهما أصحابه ، فكان بينهم حرب بالجريد والأيدي والنعال ، فبلغنا أنه أنزل فيهم هذه الآية .\nوقال مجاهد : نزلت في الأوس والخزرج . قال مجاهد : تقاتل حيان من الأنصار بالعصي والنعال فنزلت الآية . ومثله عن سعيد بن جبير : أن الأوس والخزرج كان بينهم على عهد رسول الله - صلى الله عليه وسلم - قتال بالسعف والنعال ونحوه ، فأنزل الله هذه الآية فيهم .\nوقال قتادة : نزلت في رجلين من الأنصار كانت بينهما مدارأة في حق بينهما! فقال أحدهما : لآخذن حقي عنوة ، لكثرة عشيرته . ودعاه الآخر إلى أن يحاكمه إلى رسول الله - صلى الله عليه وسلم - فأبى أن يتبعه ، فلم يزل الأمر بينهما حتى تواقعا وتناول بعضهم بعضا بالأيدي والنعال والسيوف ، فنزلت هذه الآية . وقال الكلبي : نزلت في حرب سمير وحاطب ، وكان سمير قتل حاطبا ، فاقتتل الأوس والخزرج حتى أتاهم النبي - صلى الله عليه وسلم - ، فنزلت . وأمر الله نبيه - صلى الله عليه وسلم - والمؤمنين أن يصلحوا بينهما . وقال السدي : كانت امرأة من الأنصار يقال لها : أم زيد تحت رجل من غير الأنصار ، فتخاصمت مع زوجها ، أرادت أن تزور قومها فحبسها زوجها وجعلها في علية لا يدخل عليها أحد من أهلها ، وأن المرأة بعثت إلى قومها ، فجاء قومها فأنزلوها لينطلقوا بها ، فخرج الرجل فاستغاث أهله فخرج بنو عمه ليحولوا بين المرأة وأهلها ، فتدافعوا وتجالدوا بالنعال ، فنزلت الآية .\nوالطائفة تتناول الرجل الواحد والجمع والاثنين ، فهو مما حمل على المعنى دون اللفظ ; لأن الطائفتين في معنى القوم والناس . وفي قراءة عبد الله ( حتى يفيئوا إلى أمر الله فإن فاءوا فخذوا بينهم بالقسط ) وقرأ ابن أبي عبلة ( اقتتلتا ) على لفظ الطائفتين . وقد مضى في آخر ( براءة ) القول فيه . وقال ابن عباس في قوله - عز وجل - : وليشهد عذابهما طائفة من المؤمنين قال : الواحد فما فوقه ، والطائفة من الشيء القطعة منه . فأصلحوا بينهما بالدعاء إلى كتاب الله لهما أو عليهما . فإن بغت إحداهما على الأخرى تعدت ولم تجب إلى حكم الله وكتابه . والبغي : التطاول والفساد . فقاتلوا التي تبغي حتى تفيء إلى أمر الله أي ترجع إلى كتابه . فإن فاءت أي فإن رجعت فأصلحوا بينهما بالعدل أي احملوهما على الإنصاف . وأقسطوا أيها الناس فلا تقتتلوا . وقيل : أقسطوا أي : اعدلوا . إن الله يحب المقسطين أي العادلين المحقين .\nالثانية : قال العلماء : لا تخلو الفئتان من المسلمين في اقتتالهما ، إما أن يقتتلا على سبيل البغي منهما جميعا أو لا . فإن كان الأول فالواجب في ذلك أن يمشى بينهما بما يصلح ذات البين ويثمر المكافة والموادعة . فإن لم يتحاجزا ولم يصطلحا وأقامتا على البغي صير إلى مقاتلتهما . وأما إن كان الثاني وهو أن تكون إحداهما باغية على الأخرى ، فالواجب أن تقاتل فئة البغي إلى أن تكف وتتوب ، فإن فعلت أصلح بينها وبين المبغي عليها بالقسط والعدل . فإن التحم القتال بينهما لشبهة دخلت عليهما وكلتاهما عند أنفسهما محقة ، فالواجب إزالة الشبهة بالحجة النيرة والبراهين القاطعة على مراشد الحق . فإن ركبتا متن اللجاج ولم تعملا على شاكلة ما هديتا إليه ونصحتا به من اتباع الحق بعد وضوحه لهما فقد لحقتا بالفئتين الباغيتين . والله أعلم .\nالثالثة : هذه الآية دليل على وجوب قتال الفئة الباغية المعلوم بغيها على الإمام أو على أحد من المسلمين ، وعلى فساد قول من منع من قتال المؤمنين ، واحتج بقوله - عليه السلام - : ( قتال المؤمن كفر ) . ولو كان قتال المؤمن الباغي كفرا لكان الله تعالى قد أمر بالكفر ، تعالى الله عن ذلك! وقد قاتل الصديق - رضي الله عنه - : من تمسك بالإسلام وامتنع من الزكاة ، وأمر ألا يتبع مول ، ولا يجهز على جريح ، ولم تحل أموالهم ، بخلاف الواجب في الكفار . وقال الطبري : لو كان الواجب في كل اختلاف يكون بين الفريقين الهرب منه ولزوم المنازل لما أقيم حد ولا أبطل باطل ، ولوجد أهل النفاق والفجور سبيلا إلى استحلال كل ما حرم الله عليهم من أموال المسلمين وسبي نسائهم وسفك دمائهم ، بأن يتحزبوا عليهم ، ويكف المسلمون أيديهم عنهم ، وذلك مخالف لقوله - عليه السلام - : ( خذوا على أيدي سفهائكم ) .\nالرابعة : قال القاضي أبو بكر بن العربي : هذه الآية أصل في قتال المسلمين ، والعمدة في حرب المتأولين ، وعليها عول الصحابة ، وإليها لجأ الأعيان من أهل الملة ، وإياها عنى النبي - صلى الله عليه وسلم - بقوله : ( تقتل عمارا الفئة الباغية ) . وقوله - عليه السلام - في شأن الخوارج : ( يخرجون على خير فرقة أو على حين فرقة ] ، والرواية الأولى أصح ، لقوله - عليه السلام - : ( تقتلهم أولى الطائفتين إلى الحق ) . وكان الذي قتلهم علي بن أبي طالب ومن كان معه . فتقرر عند علماء المسلمين وثبت بدليل الدين أن عليا - رضي الله عنه - كان إماما ، وأن كل من خرج عليه باغ وأن قتاله واجب حتى يفيء إلى الحق وينقاد إلى الصلح ; لأن عثمان - رضي الله عنه - قتل والصحابة برآء من دمه ; لأنه منع من قتال من ثار عليه وقال : لا أكون أول من خلف رسول الله - صلى الله عليه وسلم - في أمته بالقتل ، فصبر على البلاء ، واستسلم للمحنة وفدى بنفسه الأمة . ثم لم يمكن ترك الناس سدى ، فعرضت على باقي الصحابة الذين ذكرهم عمر في الشورى ، وتدافعوها ، وكان علي كرم الله وجهه أحق بها وأهلها ، فقبلها حوطة على الأمة أن تسفك دماؤها بالتهارج والباطل ، أو يتخرق أمرها إلى ما لا يتحصل . فربما تغير الدين وانقض عمود الإسلام . فلما بويع له طلب أهل الشام في شرط البيعة التمكن من قتلة عثمان وأخذ القود منهم ، فقال لهم علي - رضي الله عنه - : ادخلوا في البيعة واطلبوا الحق تصلوا إليه . فقالوا : لا تستحق بيعة وقتلة عثمان معك تراهم صباحا ومساء . فكان علي في ذلك أشد رأيا وأصوب قيلا ; لأن عليا لو تعاطى القود منهم لتعصبت لهم قبائل وصارت حربا ثالثة ، فانتظر بهم أن يستوثق الأمر وتنعقد البيعة ، ويقع الطلب من الأولياء في مجلس الحكم ، فيجري القضاء بالحق .\nولا خلاف بين الأمة أنه يجوز للإمام تأخير القصاص إذا أدى ذلك إلى إثارة الفتنة أو تشتيت الكلمة . وكذلك جرى لطلحة والزبير ، فإنهما ما خلعا عليا من ولاية ولا اعترضا عليه في ديانة ، وإنما رأيا أن البداءة بقتل أصحاب عثمان أولى .\nقلت : فهذا قول في سبب الحرب الواقع بينهم . وقال جلة من أهل العلم : إن الوقعة بالبصرة بينهم كانت على غير عزيمة منهم على الحرب بل فجأة ، وعلى سبيل دفع كل واحد من الفريقين عن أنفسهم لظنه أن الفريق الآخر قد غدر به ; لأن الأمر كان قد انتظم بينهم ، وتم الصلح والتفرق على الرضا . فخاف قتلة عثمان - رضي الله عنه - من التمكين منهم والإحاطة بهم ، فاجتمعوا وتشاوروا واختلفوا ، ثم اتفقت آراؤهم على أن يفترقوا فريقين ، ويبدءوا بالحرب سحرة في العسكرين ، وتختلف السهام بينهم ، ويصيح الفريق الذي في عسكرعلي : غدر طلحة والزبير . والفريق الذي في عسكر طلحة والزبير : غدر علي . فتم لهم ذلك على ما دبروه ، ونشبت الحرب ، فكان كل فريق دافعا لمكرته عند نفسه ، ومانعا من الإشاطة بدمه . وهذا صواب من الفريقين وطاعة لله تعالى ، إذ وقع القتال والامتناع منهما على هذه السبيل . وهذا هو الصحيح المشهور . والله أعلم .\nالخامسة : قوله تعالى : فقاتلوا التي تبغي حتى تفيء إلى أمر الله أمر بالقتال . وهو فرض على الكفاية إذا قام به البعض سقط عن الباقين ، ولذلك تخلف قوم من الصحابة - رضي الله عنهم - عن هذه المقامات ، كسعد بن أبي وقاص وعبد الله بن عمرو ومحمد بن مسلمة وغيرهم . وصوب ذلك علي بن أبي طالب لهم ، واعتذر إليه كل واحد منهم بعذر قبله منه . ويروى أن معاوية - رضي الله عنه - لما أفضى إليه الأمر ، عاتب سعدا على ما فعل ، وقال له : لم تكن ممن أصلح بين الفئتين حين اقتتلا ، ولا ممن قاتل الفئة الباغية . فقال له سعد : ندمت على تركي قتال الفئة الباغية . فتبين أنه ليس على الكل درك فيما فعل ، وإنما كان تصرفا بحكم الاجتهاد وإعمالا بمقتضى الشرع . والله أعلم .\nالسادسة : وقوله تعالى : فإن فاءت فأصلحوا بينهما بالعدل ومن العدل في صلحهم ألا يطالبوا بما جرى بينهم من دم ولا مال ، فإنه تلف على تأويل . وفي طلبهم تنفير لهم عن الصلح واستشراء في البغي . وهذا أصل في المصلحة . وقد قال لسان الأمة : إن حكمة الله تعالى في حرب الصحابة التعريف منهم لأحكام قتال أهل التأويل ، إذ كان أحكام قتال أهل الشرك قد عرفت على لسان الرسول - صلى الله عليه وسلم - وفعله .\nالسابعة : إذا خرجت على الإمام العدل خارجة باغية ولا حجة لها ، قاتلهم الإمام بالمسلمين كافة أو من فيه كفاية ، ويدعوهم قبل ذلك إلى الطاعة والدخول في الجماعة ، فإن أبوا من الرجوع والصلح قوتلوا . ولا يقتل أسيرهم ولا يتبع مدبرهم ولا يذفف على جريحهم ، ولا تسبى ذراريهم ولا أموالهم . وإذا قتل العادل الباغي ، أو الباغي العادل وهو وليه لم يتوارثا . ولا يرث قاتل عمدا على حال . وقيل : إن العادل يرث الباغي ، قياسا على القصاص .\nالثامنة : وما استهلكه البغاة والخوارج من دم أو مال ثم تابوا لم يؤاخذوا به . وقال أبو حنيفة : يضمنون . وللشافعي قولان . وجه قول أبي حنيفة أنه إتلاف بعدوان فيلزم الضمان . والمعول في ذلك عندنا أن الصحابة - رضي الله عنهم في حروبهم لم يتبعوا مدبرا ولا ذففوا على جريح ولا قتلوا أسيرا ولا ضمنوا نفسا ولا مالا ، وهم القدوة . وقال ابن عمر : قال النبي - صلى الله عليه وسلم - : ( يا عبد الله أتدري كيف حكم الله فيمن بغى من هذه الأمة ) ؟ قال : الله ورسوله أعلم . فقال : ( لا يجهز على جريحها ولا يقتل أسيرها ولا يطلب هاربها ولا يقسم فيؤها ) . فأما ما كان قائما رد بعينه . هذا كله فيمن خرج بتأويل يسوغ له . وذكر الزمخشري في تفسيره : إن كانت الباغية من قلة العدد بحيث لا منعة لها ضمنت بعد الفيئة ما جنت ، وإن كانت كثيرة ذات منعة وشوكة لم تضمن ، إلا عند محمد بن الحسن رحمه الله فإنه كان يفتي بأن الضمان يلزمها إذا فاءت . وأما قبل التجمع والتجند أو حين تتفرق عند وضع الحرب أوزارها ، فما جنته ضمنته عند الجميع . فحمل الإصلاح بالعدل في قوله : فأصلحوا بينهما بالعدل على مذهب محمد واضح منطبق على لفظ التنزيل . وعلى قول غيره وجهه أن يحمل على كون الفئة الباغية قليلة العدد . والذي ذكروا أن الغرض إماتة الضغائن وسل الأحقاد دون ضمان الجنايات ليس بحسن الطباق المأمور به من أعمال العدل ومراعاة القسط . قال الزمخشري : فإن قلت : لم قرن بالإصلاح الثاني العدل دون الأول ؟ قلت : لأن المراد بالاقتتال في أول الآية أن يقتتلا باغيتين أو راكبتي شبهة ، وأيتهما كانت فالذي يجب على المسلمين أن يأخذوا به في شأنهما إصلاح ذات البين وتسكين الدهماء بإراءة الحق والمواعظ الشافية ونفي الشبهة ، إلا إذا أصرتا فحينئذ تجب المقاتلة ، وأما الضمان فلا يتجه . وليس كذلك إذا بغت إحداهما ، فإن الضمان متجه على الوجهين المذكورين .\nالتاسعة : ولو تغلبوا على بلد فأخذوا الصدقات وأقاموا الحدود وحكموا فيهم بالأحكام ، لم تثن عليهم الصدقات ولا الحدود ، ولا ينقض من أحكامهم إلا ما كان خلافا للكتاب أو السنة أو الإجماع ، كما تنقض أحكام أهل العدل والسنة ، قاله مطرف وابن الماجشون . وقال ابن القاسم : لا تجوز بحال . وروي عن أصبغ أنه جائز . وروي عنه أيضا أنه لا يجوز كقول ابن القاسم . وبه قال أبو حنيفة ; لأنه عمل بغير حق ممن لا تجوز توليته . فلم يجز كما لو لم يكونوا بغاة . والعمدة لنا ما قدمناه من أن الصحابة - رضي الله عنهم ، لما انجلت الفتنة وارتفع الخلاف بالهدنة والصلح ، لم يعرضوا لأحد منهم في حكم . قال ابن العربي : الذي عندي أن ذلك لا يصلح ; لأن الفتنة لما انجلت كان الإمام هو الباغي ، ولم يكن هناك من يعترضه والله أعلم .\nالعاشرة : لا يجوز أن ينسب إلى أحد من الصحابة خطأ مقطوع به ، إذ كانوا كلهم اجتهدوا فيما فعلوه وأرادوا الله عز وجل ، وهم كلهم لنا أئمة ، وقد تعبدنا بالكف عما شجر بينهم ، وألا نذكرهم إلا بأحسن الذكر ، لحرمة الصحبة ولنهي النبي - صلى الله عليه وسلم - عن سبهم ، وأن الله غفر لهم ، وأخبر بالرضا عنهم . هذا مع ما قد ورد من الأخبار من طرق مختلفة عن النبي - صلى الله عليه وسلم - أن طلحة شهيد يمشي على وجه الأرض ، فلو كان ما خرج إليه من الحرب عصيانا لم يكن بالقتل فيه شهيدا . وكذلك لو كان ما خرج إليه خطأ في التأويل وتقصيرا في الواجب عليه ; لأن الشهادة لا تكون إلا بقتل في طاعة ، فوجب حمل أمرهم على ما بيناه . ومما يدل على ذلك ما قد صح وانتشر من أخبار علي بأن قاتل الزبير في النار . وقوله : سمعت رسول الله - صلى الله عليه وسلم - يقول : ( بشر قاتل ابن صفية بالنار ) . وإذا كان كذلك فقد ثبت أن طلحة والزبير غير عاصيين ولا آثمين بالقتال ; لأن ذلك لو كان كذلك لم يقل النبي - صلى الله عليه وسلم - في طلحة : ( شهيد ) . ولم يخبر أن قاتل الزبير في النار . وكذلك من قعد غير مخطئ في التأويل . بل صواب أراه الله الاجتهاد . وإذا كان كذلك لم يوجب ذلك لعنهم ، والبراءة منهم وتفسيقهم ، وإبطال فضائلهم وجهادهم ، وعظيم غنائهم في الدين - رضي الله عنهم . وقد سئل بعضهم عن الدماء التي أريقت فيما بينهم فقال : تلك أمة قد خلت لها ما كسبت ولكم ما كسبتم ولا تسألون عما كانوا يعملون .\nسئل بعضهم عنها أيضا فقال : تلك دماء طهر الله منها يدي ، فلا أخضب بها لساني . يعني في التحرز من الوقوع في خطأ ، والحكم على بعضهم بما لا يكون مصيبا فيه . قال ابن فورك : ومن أصحابنا من قال : إن سبيل ما جرت بين الصحابة من المنازعات كسبيل ما جرى بين إخوة يوسف مع يوسف ، ثم إنهم لم يخرجوا بذلك عن حد الولاية والنبوة ، فكذلك الأمر فيما جرى بين الصحابة . وقال المحاسبي : فأما الدماء فقد أشكل علينا القول فيها باختلافهم . وقد سئل الحسن البصري عن قتالهم فقال : قتال شهده أصحاب محمد - صلى الله عليه وسلم - وغبنا ، وعلموا وجهلنا ، واجتمعوا فاتبعنا ، واختلفوا فوقفنا . قال المحاسبي : فنحن نقول كما قال الحسن ، ونعلم أن القوم كانوا أعلم بما دخلوا فيه منا ، ونتبع ما اجتمعوا عليه ، ونقف عند ما اختلفوا فيه ولا نبتدع رأيا منا ، ونعلم أنهم اجتهدوا وأرادوا الله عز وجل ، إذ كانوا غير متهمين في الدين ، ونسأل الله التوفيق .\n                                    ",
        "saadi": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٩\n                                        \n                                        \n                                        \n                                        هذا متضمن لنهي المؤمنين، [عن] أن يبغي بعضهم على بعض، ويقاتل بعضهم بعضًا، وأنه إذا اقتتلت طائفتان من المؤمنين، فإن على غيرهم من المؤمنين أن يتلافوا هذا الشر الكبير، بالإصلاح بينهم، والتوسط بذلك على أكمل وجه يقع به الصلح، ويسلكوا الطريق الموصلة إلى ذلك، فإن صلحتا، فبها ونعمت، وإن { بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَى فَقَاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِيءَ إِلَى أَمْرِ اللَّهِ } أي: ترجع إلى ما حد الله ورسوله، من فعل الخير وترك الشر، الذي من أعظمه، الاقتتال، [وقوله] { فَإِنْ فَاءَتْ فَأَصْلِحُوا بَيْنَهُمَا بِالْعَدْلِ } هذا أمر بالصلح، وبالعدل في الصلح، فإن الصلح، قد يوجد، ولكن لا يكون بالعدل، بل بالظلم والحيف على أحد الخصمين، فهذا ليس هو الصلح المأمور به، فيجب أن لا يراعى أحدهما، لقرابة، أو وطن، أو غير ذلك من المقاصد والأغراض، التي توجب العدول عن العدل، { إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ } أي: العادلين في حكمهم بين الناس وفي جميع الولايات، التي تولوها، حتى إنه، قد يدخل في ذلك عدل الرجل في أهله، وعياله، في أدائه حقوقهم، وفي الحديث الصحيح: \"المقسطون عند الله، على منابر من نور الذين يعدلون في حكمهم وأهليهم، وما ولوا\"\n                                    "
      },
      "originalText": "وَإِن طَآئِفَتَانِ مِنَ ٱلۡمُؤۡمِنِينَ ٱقۡتَتَلُواْ فَأَصۡلِحُواْ بَيۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَٰتِلُواْ ٱلَّتِي تَبۡغِي حَتَّىٰ تَفِيٓءَ إِلَىٰٓ أَمۡرِ ٱللَّهِۚ فَإِن فَآءَتۡ فَأَصۡلِحُواْ بَيۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوٓاْۖ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ ٩"
    },
    {
      "number": 4622,
      "text": "إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 10,
      "juz": 26,
      "manzil": 6,
      "page": 516,
      "ruku": 450,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ ٠١\n                                    \n                                    \n                                    وقوله : ( إنما المؤمنون إخوة ) أي : الجميع إخوة في الدين ، كما قال رسول الله - صلى الله عليه وسلم - : \" المسلم أخو المسلم لا يظلمه ولا يسلمه \" . وفي الصحيح : \" والله في عون العبد ما كان العبد في عون أخيه \" . وفي الصحيح أيضا : \" إذا دعا المسلم لأخيه بظهر الغيب قال الملك : آمين ، ولك بمثله \" . والأحاديث في هذا كثيرة ، وفي الصحيح : \" مثل المؤمنين في توادهم وتراحمهم وتواصلهم كمثل الجسد الواحد ، إذا اشتكى منه عضو تداعى له سائر الجسد بالحمى والسهر \" . وفي الصحيح أيضا : \" المؤمن للمؤمن كالبنيان يشد بعضه بعضا \" وشبك بين أصابعه .\nوقال أحمد : حدثنا أحمد بن الحجاج ، حدثنا عبد الله ، أخبرنا مصعب بن ثابت ، حدثني أبو حازم قال : سمعت سهل بن سعد الساعدي يحدث عن رسول الله - صلى الله عليه وسلم - قال : \" إن المؤمن من أهل الإيمان بمنزلة الرأس من الجسد ، يألم المؤمن لأهل الإيمان ، كما يألم الجسد لما في الرأس \" . تفرد به ولا بأس بإسناده .\nوقوله : ( فأصلحوا بين أخويكم ) يعني : الفئتين المقتتلتين ، ( واتقوا الله ) أي : في جميع أموركم ( لعلكم ترحمون ) ، وهذا تحقيق منه تعالى للرحمة لمن اتقاه .\n                                    ",
        "qortoby": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ ٠١\n                                    \n                                    \n                                    قوله تعالى : إنما المؤمنون إخوة فأصلحوا بين أخويكم واتقوا الله لعلكم ترحمون .\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : إنما المؤمنون إخوة أي في الدين والحرمة لا في النسب ، ولهذا قيل : أخوة الدين أثبت من أخوة النسب ، فإن أخوة النسب تنقطع بمخالفة الدين ، وأخوة الدين لا تنقطع بمخالفة النسب . وفي الصحيحين عن أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : لا تحاسدوا ولا تباغضوا ولا تجسسوا ولا تحسسوا ولا تناجشوا وكونوا عباد الله إخوانا . وفي رواية : لا تحاسدوا ولا تناجشوا ولا تباغضوا ولا تدابروا ولا يبع بعضكم على بيع بعض وكونوا عباد الله إخوانا ، المسلم أخو المسلم لا يظلمه ولا يخذله ولا يحقره ، التقوى هاهنا - ويشير إلى صدره ثلاث مرات - بحسب امرئ من الشر أن يحقر أخاه المسلم ، كل المسلم على المسلم حرام دمه وماله وعرضه لفظ مسلم . وفي غير الصحيحين عن أبي هريرة قال النبي - صلى الله عليه وسلم - : المسلم أخو المسلم لا يظلمه ولا يعيبه ولا يخذله ولا يتطاول عليه في البنيان فيستر عليه الريح إلا بإذنه ولا يؤذيه بقتار قدره إلا أن يغرف له غرفة ولا يشتري لبنيه الفاكهة فيخرجون بها إلى صبيان جاره ولا يطعمونهم منها . ثم قال النبي - صلى الله عليه وسلم - : ( احفظوا ولا يحفظ منكم إلا قليل ) .\nالثانية : قوله تعالى : فأصلحوا بين أخويكم أي بين كل مسلمين تخاصما . وقيل : بين الأوس والخزرج ، على ما تقدم . وقال أبو علي : أراد بالأخوين الطائفتين ; لأن لفظ التثنية يرد والمراد به الكثرة ، كقوله تعالى : بل يداه مبسوطتان وقال أبو عبيدة : أي : أصلحوا بين كل أخوين ، فهو آت على الجميع . وقرأ ابن سيرين ونصر بن عاصم وأبو العالية والجحدري ويعقوب ( بين إخوتكم ) بالتاء على الجمع . وقرأ الحسن ( إخوانكم ) الباقون : أخويكم بالياء على التثنية .\nالثالثة : في هذه الآية والتي قبلها دليل على أن البغي لا يزيل اسم الإيمان ; لأن الله تعالى سماهم إخوة مؤمنين مع كونهم باغين . قال الحارث الأعور : سئل علي بن أبي طالب - رضي الله عنه - وهو القدوة عن قتال أهل البغي من أهل الجمل وصفين : أمشركون هم ؟ قال : لا ، من الشرك فروا . فقيل : أمنافقون ؟ قال : لا ; لأن المنافقين لا يذكرون الله إلا قليلا . قيل له : فما حالهم ؟ قال إخواننا بغوا علينا .\n                                    ",
        "saadi": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ ٠١\n                                        \n                                        \n                                        \n                                        { إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ } هذا عقد، عقده الله بين المؤمنين، أنه إذا وجد من أي شخص كان، في مشرق الأرض ومغربها، الإيمان بالله، وملائكته، وكتبه، ورسله، واليوم الآخر، فإنه أخ للمؤمنين، أخوة توجب أن يحب له المؤمنون، ما يحبون لأنفسهم، ويكرهون له، ما يكرهون لأنفسهم، ولهذا قال النبي صلى الله عليه وسلم آمرًا بحقوق الأخوة الإيمانية: \"لا تحاسدوا، ولا تناجشوا، ولا تباغضوا، ولا يبع أحدكم على بيع بعض، وكونوا عباد الله إخوانًا المؤمن أخو المؤمن، لا يظلمه، ولا يخذله، ولا يحقره\"\nوقال صلى الله عليه وسلم \"المؤمن للمؤمن، كالبنيان يشد بعضه بعضًا\" وشبك صلى الله عليه وسلم بين أصابعه.\nولقد أمر الله ورسوله، بالقيام بحقوق المؤمنين، بعضهم لبعض، وبما به يحصل التآلف والتوادد، والتواصل بينهم، كل هذا، تأييد لحقوق بعضهم على بعض، فمن ذلك، إذا وقع الاقتتال بينهم، الموجب لتفرق القلوب وتباغضها [وتدابرها]، فليصلح المؤمنون بين إخوانهم، وليسعوا فيما به يزول شنآنهم.\nثم أمر بالتقوى عمومًا، ورتب على القيام بحقوق المؤمنين وبتقوى الله، الرحمة [ فقال: { لَعَلَّكُمْ تُرْحَمُونَ } وإذا حصلت الرحمة، حصل خير الدنيا والآخرة، ودل ذلك، على أن عدم القيام بحقوق المؤمنين، من أعظم حواجب الرحمة.\nوفي هاتين الآيتين من الفوائد، غير ما تقدم: أن الاقتتال بين المؤمنين مناف للأخوة الإيمانية، ولهذا، كان من أكبر الكبائر، وأن الإيمان، والأخوة الإيمانية، لا تزول مع وجود القتال كغيره من الذنوب الكبار، التي دون الشرك، وعلى ذلك مذهب أهل السنة والجماعة، وعلى وجوب الإصلاح، بين المؤمنين بالعدل، وعلى وجوب قتال البغاة، حتى يرجعوا إلى أمر الله، وعلى أنهم لو رجعوا، لغير أمر الله، بأن رجعوا على وجه لا يجوز الإقرار عليه والتزامه، أنه لا يجوز ذلك، وأن أموالهم معصومة، لأن الله أباح دماءهم وقت استمرارهم على بغيهم خاصة، دون أموالهم.\n                                    "
      },
      "originalText": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ ٠١"
    },
    {
      "number": 4623,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَسْخَرْ قَوْمٌ مِنْ قَوْمٍ عَسَىٰ أَنْ يَكُونُوا خَيْرًا مِنْهُمْ وَلَا نِسَاءٌ مِنْ نِسَاءٍ عَسَىٰ أَنْ يَكُنَّ خَيْرًا مِنْهُنَّ ۖ وَلَا تَلْمِزُوا أَنْفُسَكُمْ وَلَا تَنَابَزُوا بِالْأَلْقَابِ ۖ بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمَانِ ۚ وَمَنْ لَمْ يَتُبْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ",
      "surah": {
        "number": 49,
        "name": "سورة الحجرات",
        "englishName": "Al-Hujuraat",
        "englishNameTranslation": "The Inner Apartments",
        "revelationType": "Medinan",
        "numberOfAyahs": 18
      },
      "numberInSurah": 11,
      "juz": 26,
      "manzil": 6,
      "page": 516,
      "ruku": 451,
      "hizbQuarter": 206,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ١١\n                                    \n                                    \n                                    ينهى تعالى عن السخرية بالناس ، وهو احتقارهم والاستهزاء بهم ، كما ثبت في الصحيح عن رسول الله - صلى الله عليه وسلم - أنه قال : \" الكبر بطر الحق وغمص الناس \" ويروى : \" وغمط الناس \" والمراد من ذلك : احتقارهم واستصغارهم ، وهذا حرام ، فإنه قد يكون المحتقر أعظم قدرا عند الله وأحب إليه من الساخر منه المحتقر له ; ولهذا قال : ( يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن ) ، فنص على نهي الرجال وعطف بنهي النساء .\nوقوله : ( ولا تلمزوا أنفسكم ) أي : لا تلمزوا الناس . والهماز اللماز من الرجال مذموم ملعون ، كما قال [ تعالى ] : ( ويل لكل همزة لمزة ) [ الهمزة : 1 ] ، فالهمز بالفعل واللمز بالقول ، كما قال : ( هماز مشاء بنميم ) [ القلم : 11 ] أي : يحتقر الناس ويهمزهم طاعنا عليهم ، ويمشي بينهم بالنميمة وهي : اللمز بالمقال ; ولهذا قال هاهنا : ( ولا تلمزوا أنفسكم ) ، كما قال : ( ولا تقتلوا أنفسكم ) [ النساء : 29 ] أي : لا يقتل بعضكم بعضا .\nقال ابن عباس ، ومجاهد ، وسعيد بن جبير ، وقتادة ، ومقاتل بن حيان : ( ولا تلمزوا أنفسكم ) أي : لا يطعن بعضكم على بعض .\nوقوله : ( ولا تنابزوا بالألقاب ) أي : لا تتداعوا بالألقاب ، وهي التي يسوء الشخص سماعها .\nقال الإمام أحمد : حدثنا إسماعيل ، حدثنا داود بن أبي هند ، عن الشعبي قال : حدثني أبو جبيرة بن الضحاك قال : فينا نزلت في بني سلمة : ( ولا تنابزوا بالألقاب ) قال : قدم رسول الله - صلى الله عليه وسلم - المدينة وليس فينا رجل إلا وله اسمان أو ثلاثة ، فكان إذا دعي أحد منهم باسم من تلك الأسماء قالوا : يا رسول الله ، إنه يغضب من هذا . فنزلت : ( ولا تنابزوا بالألقاب )\nورواه أبو داود عن موسى بن إسماعيل ، عن وهيب ، عن داود ، به .\nوقوله : ( بئس الاسم الفسوق بعد الإيمان ) أي : بئس الصفة والاسم الفسوق وهو : التنابز بالألقاب ، كما كان أهل الجاهلية يتناعتون ، بعدما دخلتم في الإسلام وعقلتموه ، ( ومن لم يتب ) أي : من هذا ( فأولئك هم الظالمون )\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن ولا تلمزوا أنفسكم ولا تنابزوا بالألقاب بئس الاسم الفسوق بعد الإيمان ومن لم يتب فأولئك هم الظالمون .\nقوله تعالى : يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن فيه أربع مسائل : الأولى : قوله تعالى : يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم قيل عند الله . وقيل : خيرا منهم أي : معتقدا وأسلم باطنا . والسخرية : الاستهزاء . سخرت منه أسخر سخرا ( بالتحريك ) ومسخرا وسخرا ( بالضم ) . وحكى أبو زيد سخرت به ، وهو أردأ اللغتين . وقال الأخفش : سخرت منه وسخرت به ، وضحكت منه وضحكت به ، وهزئت منه وهزئت به ، كل يقال . والاسم السخرية والسخري ، وقرئ بهما قوله تعالى : ليتخذ بعضهم بعضا سخريا وقد تقدم . وفلان سخرة ، يتسخر في العمل . يقال : خادم سخرة . ورجل سخرة أيضا يسخر منه . وسخرة ( بفتح الخاء ) يسخر من الناس .\nالثانية : واختلف في سبب نزولها ، فقال ابن عباس : نزلت في ثابت بن قيس بن شماس كان في أذنه وقر ، فإذا سبقوه إلى مجلس النبي - صلى الله عليه وسلم - أوسعوا له إذا أتى حتى يجلس إلى جنبه ليسمع ما يقول ، فأقبل ذات يوم وقد فاتته من صلاة الفجر ركعة مع النبي - صلى الله عليه وسلم - ، فلما انصرف النبي - صلى الله عليه وسلم - أخذ أصحابه مجالسهم منه ، فربض كل رجل منهم بمجلسه ، وعضوا فيه فلا يكاد يوسع أحد لأحد حتى يظل الرجل لا يجد مجلسا فيظل قائما ، فلما انصرف ثابت من الصلاة تخطى رقاب الناس ويقول : تفسحوا تفسحوا ، ففسحوا له حتى انتهى إلى النبي - صلى الله عليه وسلم - وبينه وبينه رجل فقال له : تفسح . فقال له الرجل : قد وجدت مجلسا فاجلس! فجلس ثابت من خلفه مغضبا ، ثم قال : من هذا ؟ قالوا فلان ، فقال ثابت : ابن فلانة! يعيره بها ، يعني أما له في الجاهلية ، فاستحيا الرجل ، فنزلت . وقال الضحاك : نزلت في وفد بني تميم الذي تقدم ذكرهم في أول ( السورة ) استهزءوا بفقراء الصحابة ، مثل عمار وخباب وابن فهيرة وبلال وصهيب وسلمان وسالم مولى أبي حذيفة وغيرهم ، لما رأوا من رثاثة حالهم ، فنزلت في الذين آمنوا منهم . وقال مجاهد : هو سخرية الغني من الفقير . وقال ابن زيد : لا يسخر من ستر الله عليه ذنوبه ممن كشفه الله ، فلعل إظهار ذنوبه في الدنيا خير له في الآخرة . وقيل : نزلت في عكرمة بن أبي جهل حين قدم المدينة مسلما ، وكان المسلمون إذا رأوه قالوا ابن فرعون هذه الأمة . فشكا ذلك إلى رسول الله - صلى الله عليه وسلم - فنزلت .\nوبالجملة فينبغي ألا يجترئ أحد على الاستهزاء بمن يقتحمه بعينه إذا رآه رث الحال أو ذا عاهة في بدنه أو غير لبيق في محادثته ، فلعله أخلص ضميرا وأنقى قلبا ممن هو على ضد صفته ، فيظلم نفسه بتحقير من وقره الله ، والاستهزاء بمن عظمه الله . ولقد بلغ بالسلف إفراط توقيهم وتصونهم من ذلك أن قال عمرو بن شرحبيل : لو رأيت رجلا يرضع عنزا فضحكت منه لخشيت أن أصنع مثل الذي صنع . وعن عبد الله بن مسعود : البلاء موكل بالقول ، لو سخرت من كلب لخشيت أن أحول كلبا . وقوم في اللغة للمذكرين خاصة . قال زهير :\nوما أدري وسوف إخال أدري أقوم آل حصن أم نساء\nوسموا قوما لأنهم يقومون مع داعيهم في الشدائد . وقيل : إنه جمع قائم ، ثم استعمل في كل جماعة وإن لم يكونوا قائمين . وقد يدخل في القوم النساء مجازا ، وقد مضى في ( البقرة ) بيانه .\nالثالثة : قوله تعالى : ولا نساء من نساء عسى أن يكن خيرا أفرد النساء بالذكر لأن السخرية منهن أكثر . وقد قال الله تعالى : إنا أرسلنا نوحا إلى قومه فشمل الجميع .\nقال المفسرون : نزلت في امرأتين من أزواج النبي - صلى الله عليه وسلم - سخرتا من أم سلمة ، وذلك أنها ربطت خصريها بسبيبة - وهو ثوب أبيض ، ومثلها السب - وسدلت طرفيها خلفها فكانت تجرها ، فقالت عائشة لحفصة - رضي الله عنهما : انظري! ما تجر خلفها كأنه لسان كلب ، فهذه كانت سخريتهما . وقال أنس وابن زيد : نزلت في نساء النبي - صلى الله عليه وسلم - ، عيرن أم سلمة بالقصر . وقيل : نزلت في عائشة ، أشارت بيدها إلى أم سلمة ، يا نبي الله إنها لقصيرة . وقال عكرمة عن ابن عباس : إن صفية بنت حيي بن أخطب أتت رسول الله - صلى الله عليه وسلم - فقالت : يا رسول الله ، إن النساء يعيرنني ، ويقلن لي يا يهودية بنت يهوديين! فقال رسول الله - صلى الله عليه وسلم - : هلا قلت إن أبي هارون وإن عمي موسى وإن زوجي محمد . فأنزل الله هذه الآية .\nالرابعة : في صحيح الترمذي عن عائشة قالت : حكيت للنبي - صلى الله عليه وسلم - رجلا ، فقال : ما يسرني أني حكيت رجلا وأن لي كذا وكذا . قالت فقلت : يا رسول الله ، إن صفية امرأة - وقالت بيدها - هكذا ، يعني أنها قصيرة . فقال : ( لقد مزجت بكلمة لو مزج بها البحر لمزج ) . وفي البخاري عن عبد الله بن زمعة قال : نهى النبي - صلى الله عليه وسلم - أن يضحك الرجل مما يخرج من الأنفس . وقال : لم يضرب أحدكم امرأته ضرب الفحل ثم لعله يعانقها . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : إن الله لا ينظر إلى صوركم وأموالكم ولكن ينظر إلى قلوبكم وأعمالكم . وهذا حديث عظيم يترتب عليه ألا يقطع بعيب أحد لما يرى عليه من صور أعمال الطاعة أو المخالفة ، فلعل من يحافظ على الأعمال الظاهرة يعلم الله من قلبه وصفا مذموما لا تصح معه تلك الأعمال . ولعل من رأينا عليه تفريطا أو معصية يعلم الله من قلبه وصفا محمودا يغفر له بسببه . فالأعمال أمارات ظنية لا أدلة قطعية . ويترتب عليها عدم الغلو في تعظيم من رأينا عليه أفعالا صالحة ، وعدم الاحتقار لمسلم رأينا عليه أفعالا سيئة . بل تحتقر وتذم تلك الحالة السيئة ، لا تلك الذات المسيئة . فتدبر هذا ، فإنه نظر دقيق ، وبالله التوفيق .\nقوله تعالى : ولا تلمزوا أنفسكم فيه ثلاث مسائل : الأولى : قوله تعالى : ولا تلمزوا أنفسكم اللمز : العيب ، وقد مضى في ( براءة ) عند قوله تعالى : ومنهم من يلمزك في الصدقات وقال الطبري : اللمز باليد والعين واللسان والإشارة . والهمز لا يكون إلا باللسان . وهذه الآية مثل قوله تعالى : ولا تقتلوا أنفسكم أي : لا يقتل بعضكم بعضا ; لأن المؤمنين كنفس واحدة ، فكأنه بقتل أخيه قاتل نفسه . وكقوله تعالى : فسلموا على أنفسكم يعني يسلم بعضكم على بعض . والمعنى : لا يعب بعضكم بعضا . وقال ابن عباس ومجاهد وقتادة وسعيد بن جبير : لا يطعن بعضكم على بعض . وقال الضحاك : لا يلعن بعضكم بعضا . وقرئ : ( ولا تلمزوا ) بالضم . وفي قوله : أنفسكم تنبيه على أن العاقل لا يعيب نفسه ، فلا ينبغي أن يعيب غيره لأنه كنفسه ، قال - صلى الله عليه وسلم - : ( المؤمنون كجسد واحد إن اشتكى عضو منه تداعى له سائر الجسد بالسهر والحمى ) . وقال بكر بن عبد الله المزني : إذا أردت أن تنظر العيوب جمة فتأمل عيابا ، فإنه إنما يعيب الناس بفضل ما فيه من العيب . وقال - صلى الله عليه وسلم - : يبصر أحدكم القذاة في عين أخيه ويدع الجذع في عينه وقيل : من سعادة المرء أن يشتغل بعيوب نفسه عن عيوب غيره . قال الشاعر :\nالمرء إن كان عاقلا ورعا أشغله عن عيوبه ورعه كما السقيم المريض يشغله\nعن وجع الناس كلهم وجعه\nوقال آخر :\nلا تكشفن مساوي الناس ما ستروا فيهتك الله سترا عن مساويكا\nواذكر محاسن ما فيهم إذا ذكروا ولا تعب أحدا منهم بما فيكا\nالثانية : قوله تعالى : ولا تنابزوا بالألقاب النبز ( بالتحريك ) اللقب ، والجمع : الأنباز . والنبز ( بالتسكين ) المصدر ، تقول : نبزه ينبزه نبزا ، أي : لقبه . وفلان ينبز بالصبيان أي : يلقبهم ، شدد للكثرة . ويقال النبز والنزب لقب السوء . وتنابزوا بالألقاب : أي : لقب بعضهم بعضا . وفي الترمذي عن أبي جبيرة بن الضحاك قال : كان الرجل منا يكون له الاسمان والثلاثة فيدعى ببعضها فعسى أن يكره ، فنزلت هذه الآية : ولا تنابزوا بالألقاب قال هذا حديث حسن . وأبو جبيرة هذا هو أخو ثابت بن الضحاك بن خليفة الأنصاري . وأبو زيد سعيد بن الربيع صاحب الهروي ثقة . وفي مصنف أبي داود عنه قال : فينا نزلت هذه الآية ، في بني سلمة ولا تنابزوا بالألقاب بئس الاسم الفسوق بعد الإيمان قال : قدم رسول الله - صلى الله عليه وسلم - وليس منا رجل إلا وله اسمان أو ثلاثة ، فجعل رسول الله - صلى الله عليه وسلم - يقول يا فلان فيقولون مه يا رسول الله ، إنه يغضب من هذا الاسم ، فنزلت هذه الآية : ولا تنابزوا بالألقاب فهذا قول .\nوقول ثان - قال الحسن ومجاهد : كان الرجل يعير بعد إسلامه بكفره يا يهودي يا نصراني ، فنزلت . وروي عن قتادة وأبي العالية وعكرمة . وقال قتادة : هو قول الرجل للرجل يا فاسق يا منافق ، وقاله مجاهد والحسن أيضا .\nوقد روي أن أبا ذر - رضي الله عنه - كان عند النبي - صلى الله عليه وسلم - فنازعه رجل فقال له أبو ذر : يا ابن اليهودية! فقال النبي - صلى الله عليه وسلم - : ( ما ترى هاهنا أحمر وأسود ما أنت بأفضل منه ) يعني بالتقوى ، ونزلت : ولا تنابزوا بالألقاب وقال ابن عباس : التنابز بالألقاب أن يكون الرجل قد عمل السيئات ثم تاب ، فنهى الله أن يعير بما سلف . يدل عليه ما روي أن النبي - صلى الله عليه وسلم - قال : من عير مؤمنا بذنب تاب منه كان حقا على الله أن يبتليه به ويفضحه فيه في الدنيا والآخرة .\nالثالثة : وقع من ذلك مستثنى من غلب عليه الاستعمال كالأعرج والأحدب ولم يكن له فيه كسب يجد في نفسه منه عليه ، فجوزته الأمة واتفق على قوله أهل الملة . قال ابن العربي : وقد ورد لعمر الله من ذلك في كتبهم ما لا أرضاه في صالح حزرة ; لأنه صحف ( خرزة ) فلقب بها . وكذلك قولهم في محمد بن سليمان الحضرمي : مطين ; لأنه وقع في طين ونحو ذلك مما غلب على المتأخرين ، ولا أراه سائغا في الدين . وقد كان موسى بن علي بن رباح المصري يقول : لا أجعل أحدا صغر اسم أبي في حل ، وكان الغالب على اسمه التصغير بضم العين . والذي يضبط هذا كله : أن كل ما يكره الإنسان إذا نودي به فلا يجوز لأجل الأذية . والله أعلم .\nقلت : وعلى هذا المعنى ترجم البخاري رحمه الله في ( كتاب الأدب ) من الجامع الصحيح . في ( باب ما يجوز من ذكر الناس نحو قولهم الطويل والقصير لا يراد به شين الرجل ) قال : وقال النبي - صلى الله عليه وسلم - : ( ما يقول ذو اليدين ) قال أبو عبد الله بن خويز منداد : تضمنت الآية المنع من تلقيب الإنسان بما يكره ، ويجوز تلقيبه بما يحب ، ألا ترى أن النبي - صلى الله عليه وسلم - لقب عمر بالفاروق ، وأبا بكر بالصديق ، وعثمان بذي النورين ، وخزيمة بذي الشهادتين ، وأبا هريرة بذي الشمالين وبذي اليدين ، في أشباه ذلك . الزمخشري : روي عن النبي - صلى الله عليه وسلم - ( من حق المؤمن على المؤمن أن يسميه بأحب أسمائه إليه ) . ولهذا كانت التكنية من السنة والأدب الحسن ، قال عمر - رضي الله عنه - : أشيعوا الكنى فإنها منبهة . ولقد لقب أبو بكر بالعتيق والصديق ، وعمر بالفاروق ، وحمزة بأسد الله ، وخالد بسيف الله . وقل من المشاهير في الجاهلية والإسلام من ليس له لقب . ولم تزل هذه الألقاب الحسنة في الأمم كلها - من العرب والعجم - تجري في مخاطباتهم ومكاتباتهم من غير نكير . قال الماوردي : فأما مستحب الألقاب ومستحسنها فلا يكره . وقد وصف رسول الله - صلى الله عليه وسلم - عددا من أصحابه بأوصاف صارت لهم من أجل الألقاب .\nقلت : فأما ما يكون ظاهرها الكراهة إذا أريد بها الصفة لا العيب فذلك كثير . وقد سئل عبد الله بن المبارك عن الرجل يقول : حميد الطويل ، وسليمان الأعمش ، وحميد الأعرج ، ومروان الأصغر ، فقال : إذا أردت صفته ولم ترد عيبه فلا بأس به . وفي صحيح مسلم عن عبد الله بن سرجس قال : رأيت الأصلع - يعني عمر - يقبل الحجر . في رواية الأصيلع .\nقوله تعالى : ومن لم يتب أي عن هذه الألقاب التي يتأذى بها السامعون . فأولئك هم الظالمون لأنفسهم بارتكاب هذه المناهي .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ١١\n                                        \n                                        \n                                        \n                                        وهذا أيضًا، من حقوق المؤمنين، بعضهم على بعض، أن { لَا يَسْخَرْ قَومٌ مِنْ قَوْمٍ } بكل كلام، وقول، وفعل دال على تحقير الأخ المسلم، فإن ذلك حرام، لا يجوز، وهو دال على إعجاب الساخر بنفسه، وعسى أن يكون المسخور به خيرًا من الساخر، كما هو الغالب والواقع، فإن السخرية، لا تقع إلا من قلب ممتلئ من مساوئ الأخلاق، متحل بكل خلق ذميم، ولهذا قال النبي صلى الله عليه وسلم \"بحسب امرئ من الشر، أن يحقر أخاه المسلم\"\nثم قال: { وَلَا تَلْمِزُوا أَنْفُسَكُمْ } أي: لا يعب بعضكم على بعض، واللمز: بالقول، والهمز: بالفعل، وكلاهما منهي عنه حرام، متوعد عليه بالنار.\nكما قال تعالى: { وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ } الآية، وسمي الأخ المؤمن نفسًا لأخيه، لأن المؤمنين ينبغي أن يكون هكذا حالهم كالجسد الواحد، ولأنه إذا همز غيره، أوجب للغير أن يهمزه، فيكون هو المتسبب لذلك.\n{ وَلَا تَنَابَزُوا بِالْأَلْقَابِ } أي: لا يعير أحدكم أخاه، ويلقبه بلقب ذم يكره أن يطلق عليه وهذا هو التنابز، وأما الألقاب غير المذمومة، فلا تدخل في هذا.\n{ بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمَانِ } أي: بئسما تبدلتم عن الإيمان والعمل بشرائعه، وما تقتضيه، بالإعراض عن أوامره ونواهيه، باسم الفسوق والعصيان، الذي هو التنابز بالألقاب.\n{ وَمَنْ لَمْ يَتُبْ فَأُولَئِكَ هُمُ الظَّالِمُونَ } فهذا [هو] الواجب على العبد، أن يتوب إلى الله تعالى، ويخرج من حق أخيه المسلم، باستحلاله، والاستغفار، والمدح له مقابلة [على] ذمه.\n{ وَمَنْ لَمْ يَتُبْ فَأُولَئِكَ هُمُ الظَّالِمُونَ } فالناس قسمان: ظالم لنفسه غير تائب، وتائب مفلح، ولا ثم قسم ثالث غيرهما.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ١١"
    }
  ]
}