{
  "number": 52,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 309,
      "text": "الَّذِينَ يَقُولُونَ رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 16,
      "juz": 3,
      "manzil": 1,
      "page": 52,
      "ruku": 43,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ ٦١\n                                    \n                                    \n                                    يصف تعالى عباده المتقين الذين وعدهم الثواب الجزيل ، فقال تعالى : ( الذين يقولون ربنا إننا آمنا ) أي : بك وبكتابك وبرسولك ( فاغفر لنا ذنوبنا ) أي بإيماننا بك وبما شرعته لنا فاغفر لنا ذنوبنا وتقصيرنا من أمرنا بفضلك ورحمتك ( وقنا عذاب النار )\n                                    ",
        "qortoby": "ٱلَّذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ ٦١\n                                    \n                                    \n                                    قوله تعالى : الذين يقولون ربنا إننا آمنا فاغفر لنا ذنوبنا وقنا عذاب النار\nقوله تعالى : الذين بدل من قوله للذين اتقوا وإن شئت كان رفعا أي هم الذين ، أو نصبا على المدح .\nربنا أي : يا ربنا . إننا آمنا أي صدقنا . فاغفر لنا ذنوبنا دعاء بالمغفرة . وقنا عذاب النار تقدم في البقرة .\n                                    ",
        "saadi": "ٱلَّذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ ٦١\n                                        \n                                        \n                                        \n                                        { ربنا إننا آمنا فاغفر لنا ذنوبنا وقنا عذاب النار } توسلوا بمنة الله عليهم بتوفيقهم للإيمان أن يغفر لهم ذنوبهم ويقيهم شر آثارها وهو عذاب النار، ثم فصل أوصاف التقوى.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ ٦١"
    },
    {
      "number": 310,
      "text": "الصَّابِرِينَ وَالصَّادِقِينَ وَالْقَانِتِينَ وَالْمُنْفِقِينَ وَالْمُسْتَغْفِرِينَ بِالْأَسْحَارِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 17,
      "juz": 3,
      "manzil": 1,
      "page": 52,
      "ruku": 43,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلصَّٰبِرِينَ وَٱلصَّٰدِقِينَ وَٱلۡقَٰنِتِينَ وَٱلۡمُنفِقِينَ وَٱلۡمُسۡتَغۡفِرِينَ بِٱلۡأَسۡحَارِ ٧١\n                                    \n                                    \n                                    ثم قال : ( الصابرين ) أي : في قيامهم بالطاعات وتركهم المحرمات ( والصادقين ) فيما أخبروا به من إيمانهم بما يلتزمونه من الأعمال الشاقة ( والقانتين ) والقنوت : الطاعة والخضوع ( والمنفقين ) أي : من أموالهم في جميع ما أمروا به من الطاعات ، وصلة الأرحام والقربات ، وسد الخلات ، ومواساة ذوي الحاجات ( والمستغفرين بالأسحار ) دل على فضيلة الاستغفار وقت الأسحار .\nوقد قيل : إن يعقوب ، عليه السلام ، لما قال لبنيه : ( سوف أستغفر لكم ربي ) [ يوسف : 98 ] أنه أخرهم إلى وقت السحر . وثبت في الصحيحين وغيرهما من المساند والسنن ، من غير وجه ، عن جماعة من الصحابة ، أن رسول الله صلى الله عليه وسلم قال : \" ينزل الله تبارك وتعالى في كل ليلة إلى سماء الدنيا حين يبقى ثلث الليل الآخر فيقول : هل من سائل فأعطيه ؟ هل من داع فأستجيب له ؟ هل من مستغفر فأغفر له ؟ \" الحديث ، وقد أفرد الحافظ أبو الحسن الدارقطني في ذلك جزءا على حدة فرواه من طرق متعددة .\nوفي الصحيحين ، عن عائشة ، رضي الله عنها ، قالت : من كل الليل قد أوتر رسول الله صلى الله عليه وسلم ، من أوله وأوسطه وآخره ، فانتهى وتره إلى السحر .\nوكان عبد الله بن عمر يصلي من الليل ، ثم يقول : يا نافع ، هل جاء السحر ؟ فإذا قال : نعم ، أقبل على الدعاء والاستغفار حتى يصبح . رواه ابن أبي حاتم .\nوقال ابن جرير : حدثنا ابن وكيع ، حدثنا أبي ، عن حريث بن أبي مطر ، عن إبراهيم بن حاطب ، عن أبيه قال : سمعت رجلا في السحر في ناحية المسجد وهو يقول : رب أمرتني فأطعتك ، وهذا سحر ، فاغفر لي . فنظرت فإذا ابن مسعود ، رضي الله عنه .\nوروى ابن مردويه عن أنس بن مالك قال : كنا نؤمر إذا صلينا من الليل أن نستغفر في آخر السحر سبعين مرة .\n                                    ",
        "qortoby": "ٱلصَّٰبِرِينَ وَٱلصَّٰدِقِينَ وَٱلۡقَٰنِتِينَ وَٱلۡمُنفِقِينَ وَٱلۡمُسۡتَغۡفِرِينَ بِٱلۡأَسۡحَارِ ٧١\n                                    \n                                    \n                                    الصابرين يعني عن المعاصي والشهوات ، وقيل : على الطاعات . والصادقين أي في الأفعال والأقوال والقانتين الطائعين . والمنفقين يعني في سبيل الله . وقد تقدم في البقرة هذه المعاني على الكمال . ففسر تعالى في هذه الآية أحوال المتقين الموعودين بالجنات .\nواختلف في معنى قوله تعالى : والمستغفرين بالأسحار فقال أنس بن مالك : هم السائلون المغفرة . قتادة : المصلون .\nقلت : ولا تناقض ، فإنهم يصلون ويستغفرون . وخص السحر بالذكر لأنه مظان القبول ووقت إجابة الدعاء . قال رسول الله - صلى الله عليه وسلم - في تفسير قوله تعالى مخبرا عن يعقوب عليه السلام لبنيه : سوف أستغفر لكم ربي : إنه أخر ذلك إلى السحر خرجه الترمذي وسيأتي . وسأل النبي - صلى الله عليه وسلم - جبريل ( أي الليل أسمع ) ؟ فقال : ( لا أدري غير أن العرش يهتز عند السحر ) . يقال سحر وسحر ، بفتح الحاء وسكونها ، وقال الزجاج : السحر من حين يدبر الليل إلى أن يطلع الفجر الثاني ، وقال ابن زيد : السحر هو سدس الليل الآخر .\nقلت : أصح من هذا ما روى الأئمة عن أبي هريرة عن النبي - صلى الله عليه وسلم - قال : ينزل الله - عز وجل - إلى سماء الدنيا كل ليلة حين يمضي ثلث الليل الأول فيقول : أنا الملك ، أنا الملك من ذا الذي يدعوني فأستجيب له ، من ذا الذي يسألني فأعطيه ، من ذا الذي يستغفرني فأغفر له . فلا يزال كذلك حتى يطلع الفجر في رواية \" حتى ينفجر الصبح \" لفظ مسلم . وقد اختلف في تأويله ; وأولى ما قيل فيه ما جاء في كتاب النسائي مفسرا عن أبي هريرة وأبي سعيد - رضي الله عنهما - قالا : قال رسول الله - صلى الله عليه وسلم - : إن الله - عز وجل - يمهل حتى يمضي شطر الليل الأول ثم يأمر مناديا فيقول هل من داع يستجاب له ! هل من مستغفر يغفر له ! هل من سائل يعطى ! . صححه أبو محمد عبد الحق ، وهو يرفع الإشكال ويوضح كل احتمال ، وأن الأول من باب حذف المضاف ، أي ينزل ملك ربنا فيقول . وقد روي \" ينزل \" بضم الياء ، وهو يبين ما ذكرنا ، وبالله توفيقنا . وقد أتينا على ذكره في \" الكتاب الأسنى في شرح أسماء الله الحسنى وصفاته العلى \" .\nمسألة : الاستغفار مندوب إليه ، وقد أثنى الله تعالى على المستغفرين في هذه الآية وغيرها فقال : وبالأسحار هم يستغفرون . وقال أنس بن مالك : أمرنا أن نستغفر بالسحر سبعين استغفارة . وقال سفيان الثوري : بلغني أنه إذا كان أول الليل نادى مناد ليقم القانتون فيقومون كذلك يصلون إلى السحر ، فإذا كان عند السحر نادى مناد : أين المستغفرون فيستغفر أولئك ، ويقوم آخرون فيصلون فيلحقون بهم . فإذا طلع الفجر نادى مناد : ألا ليقم الغافلون فيقومون من فرشهم كالموتى نشروا من قبورهم . وروي عن أنس سمعت النبي - صلى الله عليه وسلم - يقول : إن الله يقول إني لأهم بعذاب أهل الأرض فإذا نظرت إلى عمار بيوتي وإلى المتحابين في وإلى المتهجدين والمستغفرين بالأسحار صرفت عنهم العذاب بهم . قال مكحول : إذا كان في أمة خمسة عشر رجلا يستغفرون الله كل يوم خمسا وعشرين مرة لم يؤاخذ الله تلك الأمة بعذاب العامة . وذكره أبو نعيم في كتاب الحلية له . وقال نافع : كان ابن عمر يحيي الليل ثم يقول : يا نافع أسحرنا ؟ فأقول : لا . فيعاود الصلاة ثم يسأل ، فإذا قلت نعم قعد يستغفر . وروى إبراهيم بن حاطب عن أبيه قال : سمعت رجلا في السحر في ناحية المسجد يقول : يا رب ، أمرتني فأطعتك ، وهذا سحر فاغفر لي . فنظرت فإذا هو ابن مسعود .\nقلت : فهذا كله يدل على أنه استغفار باللسان مع حضور القلب . لا ما قال ابن زيد أن المراد بالمستغفرين الذين يصلون صلاة الصبح في جماعة ، والله أعلم . وقال لقمان لابنه : ( يا بني لا يكن الديك أكيس منك ، ينادي بالأسحار وأنت نائم ) . والمختار من لفظ الاستغفار ما رواه البخاري عن شداد بن أوس ، وليس له في الجامع غيره ، عن النبي - صلى الله عليه وسلم - قال : سيد الاستغفار أن تقول : اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت ، أعوذ بك من شر ما صنعت ، أبوء لك بنعمتك علي وأبوء بذنبي ، فاغفر لي فإنه لا يغفر الذنوب إلا أنت . قال : ومن قالها من النهار موقنا بها فمات من يومه قبل أن يمسي فهو من أهل الجنة ، ومن قالها من الليل وهو موقن بها فمات من ليله قبل أن يصبح فهو من أهل الجنة . وروى أبو محمد عبد الغني بن سعيد من حديث ابن لهيعة عن أبي صخر عن أبي معاوية عن سعيد بن جبير عن أبي الصهباء البكري عن علي بن أبي طالب ، - رضي الله عنه - : أن رسول الله - صلى الله عليه وسلم - أخذ بيد علي بن أبي طالب - رضي الله عنه - ثم قال : ألا أعلمك كلمات تقولهن لو كانت ذنوبك كمدب النمل ، أو كمدب الذر لغفرها الله لك على أنه مغفور لك : اللهم لا إله إلا أنت سبحانك عملت سوءا وظلمت نفسي فاغفر لي فإنه لا يغفر الذنوب إلا أنت .\n                                    ",
        "saadi": "ٱلصَّٰبِرِينَ وَٱلصَّٰدِقِينَ وَٱلۡقَٰنِتِينَ وَٱلۡمُنفِقِينَ وَٱلۡمُسۡتَغۡفِرِينَ بِٱلۡأَسۡحَارِ ٧١\n                                        \n                                        \n                                        \n                                        { الصابرين } أنفسهم على ما يحبه الله من طاعته، وعن معصيته، وعلى أقداره المؤلمة، { والصادقين } في إيمانهم وأقوالهم وأحوالهم { والمنفقين } مما رزقهم الله بأنواع النفقات على المحاويج من الأقارب وغيرهم { والمستغفرين بالأسحار } لما بين صفاتهم الحميدة ذكر احتقارهم لأنفسهم وأنهم لا يرون لأنفسهم، حالا ولا مقاما، بل يرون أنفسهم مذنبين مقصرين فيستغفرون ربهم، ويتوقعون أوقات الإجابة وهي السحر، قال الحسن: مدوا الصلاة إلى السحر، ثم جلسوا يستغفرون ربهم. فتضمنت هذه الآيات حالة الناس في الدنيا وأنها متاع ينقضي، ثم وصف الجنة وما فيها من النعيم وفاضل بينهما، وفضل الآخرة على الدنيا تنبيها على أنه يجب إيثارها والعمل لها، ووصف أهل الجنة وهم المتقون، ثم فصل خصال التقوى، فبهذه الخصال يزن العبد نفسه، هل هو من أهل الجنة أم لا؟\n                                    "
      },
      "originalText": "ٱلصَّٰبِرِينَ وَٱلصَّٰدِقِينَ وَٱلۡقَٰنِتِينَ وَٱلۡمُنفِقِينَ وَٱلۡمُسۡتَغۡفِرِينَ بِٱلۡأَسۡحَارِ ٧١"
    },
    {
      "number": 311,
      "text": "شَهِدَ اللَّهُ أَنَّهُ لَا إِلَٰهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ قَائِمًا بِالْقِسْطِ ۚ لَا إِلَٰهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 18,
      "juz": 3,
      "manzil": 1,
      "page": 52,
      "ruku": 43,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا هُوَ وَٱلۡمَلَٰٓئِكَةُ وَأُوْلُواْ ٱلۡعِلۡمِ قَآئِمَۢا بِٱلۡقِسۡطِۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٨١\n                                    \n                                    \n                                    شهد تعالى - وكفى به شهيدا ، وهو أصدق الشاهدين وأعدلهم ، وأصدق القائلين - ( أنه لا إله إلا هو ) أي : المتفرد بالإلهية لجميع الخلائق ، وأن الجميع عبيده وخلقه ، والفقراء إليه ، وهو الغني عما سواه كما قال تعالى : ( لكن الله يشهد بما أنزل إليك أنزله بعلمه والملائكة يشهدون وكفى بالله شهيدا ) الآية [ النساء : 166 ] .\nثم قرن شهادة ملائكته وأولي العلم بشهادته فقال : ( شهد الله أنه لا إله إلا هو والملائكة وأولو العلم ) وهذه خصوصية عظيمة للعلماء في هذا المقام .\n( قائما بالقسط ) منصوب على الحال ، وهو في جميع الأحوال كذلك .\n( لا إله إلا هو ) تأكيد لما سبق ( العزيز الحكيم ) العزيز الذي لا يرام جنابه عظمة وكبرياء ، الحكيم في أقواله وأفعاله وشرعه وقدره .\nوقال الإمام أحمد : حدثنا يزيد بن عبد ربه ، حدثنا بقية بن الوليد ، حدثني جبير بن عمرو القرشي ، حدثنا أبو سعيد الأنصاري ، عن أبي يحيى مولى آل الزبير بن العوام ، عن الزبير بن العوام ، قال : سمعت رسول الله صلى الله عليه وسلم وهو بعرفة يقرأ هذه الآية : ( شهد الله أنه لا إله إلا هو والملائكة وأولو العلم قائما بالقسط لا إله إلا هو العزيز الحكيم ) \" وأنا على ذلك من الشاهدين يا رب \" .\nوقد رواه ابن أبي حاتم من وجه آخر ، فقال : حدثنا علي بن حسين ، حدثنا محمد بن المتوكل العسقلاني ، حدثنا عمر بن حفص بن ثابت أبو سعيد الأنصاري ، حدثنا عبد الملك بن يحيى بن عباد بن عبد الله بن الزبير ، عن أبيه ، عن جده ، عن الزبير قال : سمعت رسول الله صلى الله عليه وسلم حين قرأ هذه الآية : ( شهد الله أنه لا إله إلا هو والملائكة ) قال : \" وأنا أشهد أي رب \" .\nوقال الحافظ أبو القاسم الطبراني في المعجم الكبير : حدثنا عبدان بن أحمد وعلي بن سعيد الرازي قالا حدثنا عمار بن عمر بن المختار ، حدثني أبي ، حدثني غالب القطان قال : أتيت الكوفة في تجارة ، فنزلت قريبا من الأعمش ، فلما كانت ليلة أردت أن أنحدر ، قام فتهجد من الليل ، فمر بهذه الآية : ( شهد الله أنه لا إله إلا هو والملائكة وأولو العلم قائما بالقسط لا إله إلا هو العزيز الحكيم . إن الدين عند الله الإسلام ) ثم قال الأعمش : وأنا أشهد بما شهد الله به ، وأستودع الله هذه الشهادة ، وهي لي عند الله وديعة : ( إن الدين عند الله الإسلام ) قالها مرارا . قلت : لقد سمع فيها شيئا ، فغدوت إليه فودعته ، ثم قلت : يا أبا محمد ، إني سمعتك تردد هذه الآية . قال : أوما بلغك ما فيها ؟ قلت : أنا عندك منذ شهر لم تحدثني . قال : والله لا أحدثك بها إلى سنة . فأقمت سنة فكنت على بابه ، فلما مضت السنة قلت : يا أبا محمد ، قد مضت السنة . قال : حدثني أبو وائل ، عن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" يجاء بصاحبها يوم القيامة ، فيقول الله عز وجل : عبدي عهد إلي ، وأنا أحق من وفى بالعهد ، أدخلوا عبدي الجنة \" .\n                                    ",
        "qortoby": "شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا هُوَ وَٱلۡمَلَٰٓئِكَةُ وَأُوْلُواْ ٱلۡعِلۡمِ قَآئِمَۢا بِٱلۡقِسۡطِۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٨١\n                                    \n                                    \n                                    قوله تعالى : شهد الله أنه لا إله إلا هو والملائكة وأولو العلم قائما بالقسط لا إله إلا هو العزيز الحكيم فيه أربع مسائل ( الأولى ) قال سعيد بن جبير : كان حول الكعبة ثلاثمائة وستون صنما ، فلما نزلت هذه الآية خررن سجدا . وقال الكلبي : لما ظهر رسول الله - صلى الله عليه وسلم - بالمدينة قدم عليه حبران من أحبار أهل الشام ; فلما أبصرا المدينة قال أحدهما لصاحبه : ما أشبه هذه المدينة بصفة مدينة النبي الذي يخرج في آخر الزمان . فلما دخلا على النبي - صلى الله عليه وسلم - عرفاه بالصفة والنعت ، فقالا له : أنت محمد ؟ قال ( نعم ) . قالا : وأنت أحمد ؟ قال : ( نعم ) . قالا : نسألك عن شهادة ، فإن أنت أخبرتنا بها آمنا بك وصدقناك . فقال لهما رسول الله - صلى الله عليه وسلم - : ( سلاني ) . فقالا : أخبرنا عن أعظم شهادة في كتاب الله . فأنزل الله تعالى على نبيه - صلى الله عليه وسلم - شهد الله أنه لا إله إلا هو والملائكة وأولو العلم قائما بالقسط فأسلم الرجلان وصدقا برسول الله - صلى الله عليه وسلم - . وقد قيل : إن المراد بأولي العلم الأنبياء عليهم السلام . وقال ابن كيسان : المهاجرون والأنصار . مقاتل : مؤمنو أهل الكتاب السدي والكلبي : المؤمنون كلهم ; وهو الأظهر لأنه عام .\n( الثانية ) في هذه الآية دليل على فضل العلم وشرف العلماء وفضلهم ; فإنه لو كان أحد أشرف من العلماء لقرنهم الله باسمه واسم ملائكته كما قرن اسم العلماء . وقال في شرف العلم لنبيه - صلى الله عليه وسلم - : وقل رب زدني علما . فلو كان شيء أشرف من العلم لأمر الله تعالى نبيه - صلى الله عليه وسلم - أن يسأله المزيد منه كما أمر أن يستزيده من العلم . وقال - صلى الله عليه وسلم - : إن العلماء ورثة الأنبياء . وقال : العلماء أمناء الله على خلقه . وهذا شرف للعلماء عظيم ، ومحل لهم في الدين خطير . وخرج أبو محمد عبد الغني الحافظ من حديث بركة بن نشيط - وهو عنكل بن حكارك وتفسيره بركة بن نشيط - وكان حافظا ، حدثنا عمر بن المؤمل حدثنا محمد بن أبي الخصيب حدثنا عنكل حدثنا محمد بن إسحاق حدثنا شريك عن أبي إسحاق عن البراء قال : قال رسول الله - صلى الله عليه وسلم - : العلماء ورثة الأنبياء يحبهم أهل السماء ويستغفر لهم الحيتان في البحر إذا ماتوا إلى يوم القيامة وفي هذا الباب عن أبي الدرداء خرجه أبو داود .\n( الثالثة ) روى غالب القطان قال : أتيت الكوفة في تجارة فنزلت قريبا من الأعمش فكنت أختلف إليه . فلما كان ليلة أردت أن أنحدر إلى البصرة قام فتهجد من الليل فقرأ بهذه الآية : شهد الله أنه لا إله إلا هو والملائكة وأولو العلم قائما بالقسط لا إله إلا هو العزيز الحكيم . إن الدين عند الله الإسلام ، قال الأعمش : وأنا أشهد بما شهد الله به ، وأستودع الله هذه الشهادة ، وهي لي عند الله وديعة ، وإن الدين عند الله الإسلام - قالها مرارا - فغدوت إليه وودعته ثم قلت : إني سمعتك تقرأ هذه الآية فما بلغك فيها ؟ أنا عندك منذ سنة لم تحدثني به . قال : والله لا حدثتك به سنة . قال : فأقمت وكتبت على بابه ذلك اليوم ، فلما مضت السنة قلت : يا أبا محمد قد مضت السنة . قال : حدثني أبو وائل ، عن عبد الله بن مسعود قال : قال رسول الله - صلى الله عليه وسلم - : يجاء بصاحبها يوم القيامة فيقول الله تعالى : عبدي عهد إلي وأنا أحق من وفى أدخلوا عبدي الجنة . قال أبو الفرج الجوزي : غالب القطان هو غالب بن خطاف القطان ، يروي عن الأعمش حديث ( شهد الله ) وهو حديث معضل . قال ابن عدي الضعف على حديثه بين . وقال أحمد بن حنبل : غالب بن خطاف القطان ثقة ثقة . وقال ابن معين : ثقة . وقال أبو حاتم : صدوق صالح .\nقلت : يكفيك من عدالته وثقته أن خرج له البخاري ومسلم في كتابيهما ، وحسبك . وروي من حديث أنس عن النبي - صلى الله عليه وسلم - أنه قال : من قرأ شهد الله أنه لا إله إلا هو والملائكة وأولو العلم قائما بالقسط لا إله إلا هو العزيز الحكيم عند منامه خلق الله له سبعين ألف ملك يستغفرون له إلى يوم القيامة . ويقال من أقر بهذه الشهادة عن عقد من قلبه فقد قام بالعدل . وروي عن سعيد بن جبير أنه قال : كان حول الكعبة ثلاثمائة وستون صنما لكل حي من أحياء العرب صنم أو صنمان . فلما نزلت هذه الآية أصبحت الأصنام قد خرت ساجدة لله .\n( الرابعة ) قوله تعالى : شهد الله أي بين وأعلم ; كما يقال : شهد فلان عند القاضي إذا بين وأعلم لمن الحق ، أو على من هو . قال الزجاج : الشاهد هو الذي يعلم الشيء ويبينه ; فقد دلنا الله تعالى على وحدانيته بما خلق وبين . وقال أبو عبيدة : شهد الله بمعنى قضى الله ، أي أعلم . وقال ابن عطية : وهذا مردود من جهات . وقرأ الكسائي بفتح \" أن \" في قوله أنه لا إله إلا هو وقوله \" أن الدين \" . قال المبرد : التقدير : أن الدين عند الله الإسلام بأنه لا إله إلا هو ، ثم حذفت الباء كما قال : أمرتك الخير . أي بالخير . قال الكسائي : أنصبهما جميعا ، بمعنى شهد الله أنه كذا ، وأن الدين عند الله . قال ابن كيسان : \" أن \" الثانية بدل من الأولى ; لأن الإسلام تفسير المعنى الذي هو التوحيد . وقرأ ابن عباس فيما حكى الكسائي \" شهد الله إنه \" بالكسر أن الدين \" بالفتح . والتقدير : شهد الله أن الدين الإسلام ، ثم ابتدأ فقال : إنه لا إله إلا هو . وقرأ أبو المهلب وكان قارئا - شهداء الله بالنصب على الحال ، وعنه \" شهداء الله \" . وروى شعبة عن عاصم عن زر عن أبي عن النبي - صلى الله عليه وسلم - أنه كان يقرأ \" أن الدين عند الله الحنيفية لا اليهودية ولا النصرانية ولا المجوسية \" . قال أبو بكر الأنباري : ولا يخفى على ذي تمييز أن هذا الكلام من النبي - صلى الله عليه وسلم - على جهة التفسير ، أدخله بعض من نقل الحديث في القرآن . وقائما نصب على الحال المؤكدة من اسمه تعالى في قوله شهد الله أو من قوله إلا هو . وقال الفراء : هو نصب على القطع ، كان أصله القائم ، فلما قطعت الألف واللام نصب كقوله : وله الدين واصبا . وفي قراءة عبد الله \" القائم بالقسط \" على النعت ، والقسط العدل . لا إله إلا هو العزيز الحكيم كرر لأن الأولى حلت محل الدعوى ، والشهادة الثانية حلت محل الحكم . وقال جعفر الصادق : الأولى وصف وتوحيد ، والثانية رسم وتعليم ; يعني قولوا لا إله إلا الله العزيز الحكيم .\n                                    ",
        "saadi": "شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا هُوَ وَٱلۡمَلَٰٓئِكَةُ وَأُوْلُواْ ٱلۡعِلۡمِ قَآئِمَۢا بِٱلۡقِسۡطِۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٨١\n                                        \n                                        \n                                        \n                                        هذا تقرير من الله تعالى للتوحيد بأعظم الطرق الموجبة له، وهي شهادته تعالى وشهادة خواص الخلق وهم الملائكة وأهل العلم، أما شهادته تعالى فيما أقامه من الحجج والبراهين القاطعة على توحيده، وأنه لا إله إلا هو، فنوع الأدلة في الآفاق والأنفس على هذا الأصل العظيم، ولو لم يكن في ذلك إلا أنه ما قام أحد بتوحيده إلا ونصره على المشرك الجاحد المنكر للتوحيد، وكذلك إنعامه العظيم الذي ما بالعباد من نعمة إلا منه، ولا يدفع النقم إلا هو، والخلق كلهم عاجزون عن المنافع والمضار لأنفسهم ولغيرهم، ففي هذا برهان قاطع على وجوب التوحيد وبطلان الشرك، وأما شهادة الملائكة بذلك فنستفيدها بإخبار الله لنا بذلك وإخبار رسله، وأما شهادة أهل العلم فلأنهم هم المرجع في جميع الأمور الدينية خصوصا في أعظم الأمور وأجلها وأشرفها وهو التوحيد، فكلهم من أولهم إلى آخرهم قد اتفقوا على ذلك ودعوا إليه وبينوا للناس الطرق الموصلة إليه، فوجب على الخلق التزام هذا الأمر المشهود عليه والعمل به، وفي هذا دليل على أن أشرف الأمور علم التوحيد لأن الله شهد به بنفسه وأشهد عليه خواص خلقه، والشهادة لا تكون إلا عن علم ويقين، بمنزلة المشاهدة للبصر، ففيه دليل على أن من لم يصل في علم التوحيد إلى هذه الحالة فليس من أولي العلم. وفي هذه الآية دليل على شرف العلم من وجوه كثيرة، منها: أن الله خصهم بالشهادة على أعظم مشهود عليه دون الناس، ومنها: أن الله قرن شهادتهم بشهادته وشهادة ملائكته، وكفى بذلك فضلا، ومنها: أنه جعلهم أولي العلم، فأضافهم إلى العلم، إذ هم القائمون به المتصفون بصفته، ومنها: أنه تعالى جعلهم شهداء وحجة على الناس، وألزم الناس العمل بالأمر المشهود به، فيكونون هم السبب في ذلك، فيكون كل من عمل بذلك نالهم من أجره، وذلك فضل الله يؤتيه من يشاء، ومنها: أن إشهاده تعالى أهل العلم يتضمن ذلك تزكيتهم وتعديلهم وأنهم أمناء على ما استرعاهم عليه، ولما قرر توحيده قرر عدله، فقال: { قائمًا بالقسط } أي: لم يزل متصفا بالقسط في أفعاله وتدبيره بين عباده، فهو على صراط مستقيم في ما أمر به ونهى عنه، وفيما خلقه وقدره، ثم أعاد تقرير توحيده فقال { لا إله إلا هو العزيز الحكيم } واعلم أن هذا الأصل الذي هو توحيد الله وإفراده بالعبودية قد دلت عليه الأدلة النقلية والأدلة العقلية، حتى صار لذوي البصائر أجلى من الشمس، فأما الأدلة النقلية فكل ما في كتاب الله وسنة رسوله، من الأمر به وتقريره، ومحبة أهله وبغض من لم يقم به وعقوباتهم، وذم الشرك وأهله، فهو من الأدلة النقلية على ذلك، حتى كاد القرآن أن يكون كله أدلة عليه، وأما الأدلة العقلية التي تدرك بمجرد فكر العقل وتصوره للأمور فقد أرشد القرآن إليها ونبه على كثير منها، فمن أعظمها: الاعتراف بربوبية الله، فإن من عرف أنه هو الخالق الرازق المدبر لجميع الأمور أنتج له ذلك أنه هو المعبود الذي لا تنبغي العبادة إلا له، ولما كان هذا من أوضح الأشياء وأعظمها أكثر الله تعالى من الاستدلال به في كتابه. ومن الأدلة العقلية على أن الله هو الذي يؤله دون غيره انفراده بالنعم ودفع النقم، فإن من عرف أن النعم الظاهرة والباطنة القليلة والكثيرة كلها من الله، وأنه ما من نقمة ولا شدة ولا كربة إلا وهو الذي ينفرد بدفعها وإن أحدا من الخلق لا يملك لنفسه - فضلا عن غيره- جلب نعمة ولا دفع نقمة، تيقن أن عبودية ما سوى الله من أبطل الباطل وأن العبودية لا تنبغي إلا لمن انفرد بجلب المصالح ودفع المضار، فلهذا أكثر الله في كتابه من التنبيه على هذا الدليل جدا، ومن الأدلة العقلية أيضا على ذلك: ما أخبر به تعالى عن المعبودات التي عبدت من دونه، بأنها لا تملك نفعا ولا ضرا، ولا تنصر غيرها ولا تنصر نفسها، وسلبها الأسماع والأبصار، وأنها على فرض سماعها لا تغني شيئا، وغير ذلك من الصفات الدالة على نقصها غاية النقص، وما أخبر به عن نفسه العظيمة من الصفات الجليلة والأفعال الجميلة، والقدرة والقهر، وغير ذلك من الصفات التي تعرف بالأدلة السمعية والعقلية، فمن عرف ذلك حق المعرفة عرف أن العبادة لا تليق ولا تحسن إلا بالرب العظيم الذي له الكمال كله، والمجد كله، والحمد كله، والقدرة كلها، والكبرياء كلها، لا بالمخلوقات المدبرات الناقصات الصم البكم الذين لا يعقلون، ومن الأدلة العقلية على ذلك ما شاهده العباد بأبصارهم من قديم الزمان وحديثه، من الإكرام لأهل التوحيد، والإهانة والعقوبة لأهل الشرك، وما ذاك إلا لأن التوحيد جعله الله موصلا إلى كل خير دافعا لكل شر ديني ودنيوي، وجعل الشرك به والكفر سببا للعقوبات الدينية والدنيوية، ولهذا إذا ذكر تعالى قصص الرسل مع أمم المطيعين والعاصين، وأخبر عن عقوبات العاصين ونجاة الرسل ومن تبعهم، قال عقب كل قصة: { إن في ذلك لآية } أي: لعبرة يعتبر بها المعتبرون فيعلمون أن توحيده هو الموجب للنجاة، وتركه هو الموجب للهلاك، فهذه من الأدلة الكبار العقلية النقلية الدالة على هذا الأصل العظيم، وقد أكثر الله منها في كتابه وصرفها ونوعها ليحيى من حي عن بينة، ويهلك من هلك عن بينة فله الحمد والشكر والثناء.\n                                    "
      },
      "originalText": "شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا هُوَ وَٱلۡمَلَٰٓئِكَةُ وَأُوْلُواْ ٱلۡعِلۡمِ قَآئِمَۢا بِٱلۡقِسۡطِۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٨١"
    },
    {
      "number": 312,
      "text": "إِنَّ الدِّينَ عِنْدَ اللَّهِ الْإِسْلَامُ ۗ وَمَا اخْتَلَفَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۗ وَمَنْ يَكْفُرْ بِآيَاتِ اللَّهِ فَإِنَّ اللَّهَ سَرِيعُ الْحِسَابِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 19,
      "juz": 3,
      "manzil": 1,
      "page": 52,
      "ruku": 43,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلدِّينَ عِندَ ٱللَّهِ ٱلۡإِسۡلَٰمُۗ وَمَا ٱخۡتَلَفَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۗ وَمَن يَكۡفُرۡ بِ‍َٔايَٰتِ ٱللَّهِ فَإِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ٩١\n                                    \n                                    \n                                    وقوله : ( إن الدين عند الله الإسلام ) إخبار من الله تعالى بأنه لا دين عنده يقبله من أحد سوى الإسلام ، وهو اتباع الرسل فيما بعثهم الله به في كل حين ، حتى ختموا بمحمد صلى الله عليه وسلم ، الذي سد جميع الطرق إليه إلا من جهة محمد صلى الله عليه وسلم ، فمن لقي الله بعد بعثته محمدا صلى الله عليه وسلم بدين على غير شريعته ، فليس بمتقبل . كما قال تعالى : ( ومن يبتغ غير الإسلام دينا فلن يقبل منه [ وهو في الآخرة من الخاسرين ] ) [ آل عمران : 85 ] وقال في هذه الآية مخبرا بانحصار الدين المتقبل عنده في الإسلام : ( إن الدين عند الله الإسلام )\nوذكر ابن جرير أن ابن عباس قرأ : ( شهد الله أنه لا إله إلا هو والملائكة وأولو العلم قائما بالقسط لا إله إلا هو العزيز الحكيم إن الدين عند الله الإسلام ) بكسر \" إنه \" وفتح ( إن الدين عند الله الإسلام ) أي : شهد هو وملائكته وأولو العلم من البشر بأن الدين عند الله الإسلام . والجمهور قرءوها بالكسر على الخبر ، وكلا المعنيين صحيح . ولكن هذا على قول الجمهور أظهر والله أعلم .\nثم أخبر تعالى بأن الذين أوتوا الكتاب الأول إنما اختلفوا بعد ما قامت عليهم الحجة بإرسال الرسل إليهم ، وإنزال الكتب عليهم ، فقال : ( وما اختلف الذين أوتوا الكتاب إلا من بعد ما جاءهم العلم بغيا بينهم ) أي : بغى بعضهم على بعض ، فاختلفوا في الحق لتحاسدهم وتباغضهم وتدابرهم ، فحمل بعضهم بغض البعض الآخر على مخالفته في جميع أقواله وأفعاله ، وإن كانت حقا ، ثم قال : ( ومن يكفر بآيات الله فإن الله سريع الحساب ) أي : من جحد بما أنزل الله في كتابه فإن الله سيجازيه على ذلك ، ويحاسبه على تكذيبه ، ويعاقبه على مخالفته كتابه.\n                                    ",
        "qortoby": "إِنَّ ٱلدِّينَ عِندَ ٱللَّهِ ٱلۡإِسۡلَٰمُۗ وَمَا ٱخۡتَلَفَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۗ وَمَن يَكۡفُرۡ بِ‍َٔايَٰتِ ٱللَّهِ فَإِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ٩١\n                                    \n                                    \n                                    قوله تعالى : إن الدين عند الله الإسلام وما اختلف الذين أوتوا الكتاب إلا من بعد ما جاءهم العلم بغيا بينهم ومن يكفر بآيات الله فإن الله سريع الحساب\nقوله تعالى : إن الدين عند الله الإسلام الدين في هذه الآية الطاعة والملة ، والإسلام بمعنى الإيمان والطاعات ; قاله أبو العالية ، وعليه جمهور المتكلمين . والأصل في مسمى الإيمان والإسلام التغاير ; لحديث جبريل . وقد يكون بمعنى المرادفة . فيسمى كل واحد منهما باسم الآخر ; كما في حديث وفد عبد القيس وأنه أمرهم بالإيمان بالله وحده وقال : ( هل تدرون ما الإيمان ) ؟ قالوا : الله ورسوله أعلم . قال : ( شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وأن تؤدوا خمسا من المغنم ) الحديث . وكذلك قوله - صلى الله عليه وسلم - : ( الإيمان بضع وسبعون بابا فأدناها إماطة الأذى وأرفعها قول لا إله إلا الله ) أخرجه الترمذي . وزاد مسلم ( والحياء شعبة من الإيمان ) . ويكون أيضا بمعنى التداخل وهو أن يطلق أحدهما ويراد به مسماه في الأصل ومسمى الآخر ، كما في هذه الآية إذ قد دخل فيها التصديق والأعمال ; ومنه قوله عليه السلام : الإيمان معرفة بالقلب وقول باللسان وعمل بالأركان . أخرجه ابن ماجه ، وقد تقدم والحقيقة هو الأول وضعا وشرعا وما عداه من باب التوسع ، والله أعلم .\nقوله تعالى : وما اختلف الذين أوتوا الكتاب الآية أخبر تعالى عن اختلاف أهل الكتاب أنه كان على علم منهم بالحقائق ، وأنه كان بغيا وطلبا للدنيا . قاله ابن عمر وغيره . وفي الكلام تقديم وتأخير ، والمعنى : وما اختلف الذين أوتوا الكتاب بغيا بينهم إلا من بعد ما جاءهم العلم ; قاله الأخفش . قال محمد بن جعفر بن الزبير : المراد بهذه الآية النصارى ، وهي توبيخ لنصارى نجران . وقال الربيع بن أنس : المراد بها اليهود . ولفظ الذين أوتوا الكتاب يعم اليهود والنصارى ; أي وما اختلف الذين أوتوا الكتاب يعني في نبوة محمد - صلى الله عليه وسلم - إلا من بعد ما جاءهم العلم يعني بيان صفته ونبوته في كتبهم . وقيل : أي وما اختلف الذين أوتوا الإنجيل في أمر عيسى وفرقوا فيه القول إلا من بعد ما جاءهم العلم بأن الله إله واحد ، وأن عيسى عبد الله ورسوله . بغيا نصب على المفعول من أجله ، أو على الحال من الذين ، والله تعالى أعلم .\n                                    ",
        "saadi": "إِنَّ ٱلدِّينَ عِندَ ٱللَّهِ ٱلۡإِسۡلَٰمُۗ وَمَا ٱخۡتَلَفَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۗ وَمَن يَكۡفُرۡ بِ‍َٔايَٰتِ ٱللَّهِ فَإِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ٩١\n                                        \n                                        \n                                        ولما قرر أنه الإله الحق المعبود، بين العبادة والدين الذي يتعين أن يعبد به ويدان له، وهو الإسلام الذي هو الاستسلام لله بتوحيده وطاعته التي دعت إليها رسله، وحثت عليها كتبه، وهو الذي لا يقبل من أحد دين سواه، وهو متضمن للإخلاص له في الحب والخوف والرجاء والإنابة والدعاء ومتابعة رسوله في ذلك، وهذا هو دين الرسل كلهم، وكل من تابعهم فهو على طريقهم، وإنما اختلف أهل الكتاب بعد ما جاءتهم كتبهم تحثهم على الاجتماع على دين الله، بغيا بينهم، وظلما وعدوانا من أنفسهم، وإلا فقد جاءهم السبب الأكبر الموجب أن يتبعوا الحق ويتركوا الاختلاف، وهذا من كفرهم، فلهذا قال تعالى { وما اختلف الذين أوتوا الكتاب إلا من بعد ما جاءهم العلم بغيًا بينهم ومن يكفر بآيات الله فإن الله سريع الحساب } فيجازي كل عامل بعمله، وخصوصا من ترك الحق بعد معرفته، فهذا مستحق للوعيد الشديد والعقاب الأليم.\n                                    "
      },
      "originalText": "إِنَّ ٱلدِّينَ عِندَ ٱللَّهِ ٱلۡإِسۡلَٰمُۗ وَمَا ٱخۡتَلَفَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۗ وَمَن يَكۡفُرۡ بِ‍َٔايَٰتِ ٱللَّهِ فَإِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ٩١"
    },
    {
      "number": 313,
      "text": "فَإِنْ حَاجُّوكَ فَقُلْ أَسْلَمْتُ وَجْهِيَ لِلَّهِ وَمَنِ اتَّبَعَنِ ۗ وَقُلْ لِلَّذِينَ أُوتُوا الْكِتَابَ وَالْأُمِّيِّينَ أَأَسْلَمْتُمْ ۚ فَإِنْ أَسْلَمُوا فَقَدِ اهْتَدَوْا ۖ وَإِنْ تَوَلَّوْا فَإِنَّمَا عَلَيْكَ الْبَلَاغُ ۗ وَاللَّهُ بَصِيرٌ بِالْعِبَادِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 20,
      "juz": 3,
      "manzil": 1,
      "page": 52,
      "ruku": 43,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِنۡ حَآجُّوكَ فَقُلۡ أَسۡلَمۡتُ وَجۡهِيَ لِلَّهِ وَمَنِ ٱتَّبَعَنِۗ وَقُل لِّلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ وَٱلۡأُمِّيِّ‍ۧنَ ءَأَسۡلَمۡتُمۡۚ فَإِنۡ أَسۡلَمُواْ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُۗ وَٱللَّهُ بَصِيرُۢ بِٱلۡعِبَادِ ٠٢\n                                    \n                                    \n                                    ثم قال تعالى : ( فإن حاجوك ) أي : جادلوك في التوحيد ( فقل أسلمت وجهي لله ومن اتبعن ) أي : فقل أخلصت عبادتي لله وحده ، لا شريك له ولا ند [ له ] ولا ولد ولا صاحبة له ( ومن اتبعن ) على ديني ، يقول كمقالتي ، كما قال تعالى : ( قل هذه سبيلي أدعو إلى الله على بصيرة أنا ومن اتبعني [ وسبحان الله وما أنا من المشركين ] ) [ يوسف : 108 ] .\nثم قال تعالى آمرا لعبده ورسوله محمد صلى الله عليه وسلم أن يدعو إلى طريقته ودينه ، والدخول في شرعه وما بعثه الله به الكتابيين من الملتين والأميين من المشركين فقال : ( وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ ) أي : والله عليه حسابهم وإليه مرجعهم ومآبهم ، وهو الذي يهدي من يشاء ، ويضل من يشاء ، وله الحكمة في ذلك ، والحجة البالغة ، ولهذا قال : ( والله بصير بالعباد ) أي : هو عليم بمن يستحق الهداية ممن يستحق الضلالة ، وهو الذي ( لا يسأل عما يفعل وهم يسألون ) [ الأنبياء : 33 ] وما ذاك إلا لحكمته ورحمته .\nوهذه الآية وأمثالها من أصرح الدلالات على عموم بعثته ، صلوات الله وسلامه عليه ، إلى جميع الخلق ، كما هو معلوم من دينه ضرورة ، وكما دل عليه الكتاب والسنة في غير ما آية وحديث ، فمن ذلك قوله تعالى : ( قل يا أيها الناس إني رسول الله إليكم جميعا ) [ الأعراف : 158 ] وقال تعالى : ( تبارك الذي نزل الفرقان على عبده ليكون للعالمين نذيرا ) [ الفرقان : 1 ] وفي الصحيحين وغيرهما ، مما ثبت تواتره بالوقائع المتعددة ، أنه بعث كتبه صلى الله عليه وسلم يدعو إلى الله ملوك الآفاق ، وطوائف بني آدم من عربهم وعجمهم ، كتابيهم وأميهم ، امتثالا لأمر الله له بذلك . وقد روى عبد الرزاق ، عن معمر ، عن همام ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم أنه قال : \" والذي نفسي بيده ، لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني ، ومات ولم يؤمن بالذي أرسلت به ، إلا كان من أهل النار \" رواه مسلم .\nوقال صلى الله عليه وسلم : \" بعثت إلى الأحمر والأسود \" وقال : \" كان النبي يبعث إلى قومه خاصة وبعثت إلى الناس عامة \" . وقال الإمام أحمد : حدثنا مؤمل ، حدثنا حماد ، حدثنا ثابت عن أنس ، رضي الله عنه : أن غلاما يهوديا كان يضع للنبي صلى الله عليه وسلم وضوءه ويناوله نعليه ، فمرض ، فأتاه النبي صلى الله عليه وسلم فدخل عليه وأبوه قاعد عند رأسه ، فقال له النبي صلى الله عليه وسلم : \" يا فلان ، قل : لا إله إلا الله \" فنظر إلى أبيه ، فسكت أبوه ، فأعاد عليه النبي صلى الله عليه وسلم ، فنظر إلى أبيه ، فقال أبوه : أطع أبا القاسم ، فقال الغلام : أشهد أن لا إله إلا الله وأنك رسول الله ، فخرج النبي صلى الله عليه وسلم وهو يقول : \" الحمد لله الذي أخرجه بي من النار \" أخرجه البخاري في الصحيح إلى غير ذلك من الآيات والأحاديث .\n                                    ",
        "qortoby": "فَإِنۡ حَآجُّوكَ فَقُلۡ أَسۡلَمۡتُ وَجۡهِيَ لِلَّهِ وَمَنِ ٱتَّبَعَنِۗ وَقُل لِّلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ وَٱلۡأُمِّيِّ‍ۧنَ ءَأَسۡلَمۡتُمۡۚ فَإِنۡ أَسۡلَمُواْ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُۗ وَٱللَّهُ بَصِيرُۢ بِٱلۡعِبَادِ ٠٢\n                                    \n                                    \n                                    قوله تعالى : فإن حاجوك فقل أسلمت وجهي لله ومن اتبعن وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ والله بصير بالعباد قوله تعالى : فإن حاجوك فقل أسلمت وجهي لله أي جادلوك بالأقاويل المزورة والمغالطات ، فأسند أمرك إلى ما كلفت من الإيمان والتبليغ وعلى الله نصرك . وقوله وجهي بمعنى ذاتي ; ومنه الحديث سجد وجهي للذي خلقه وصوره . وقيل : الوجه هنا بمعنى القصد ; كما تقول : خرج فلان في وجه كذا . وقد تقدم هذا المعنى في البقرة مستوفى ; والأول أولى . وعبر بالوجه عن سائر الذات إذ هو أشرف أعضاء الشخص وأجمعها للحواس . وقال :\nأسلمت وجهي لمن أسلمت له المزن تحمل عذبا زلالا\nوقد قال حذاق المتكلمين في قوله تعالى : ويبقى وجه ربك : إنها عبارة عن الذات وقيل : العمل الذي يقصد به وجهه . وقوله : ومن اتبعن \" من \" في محل رفع عطفا على التاء في قوله أسلمت أي ومن اتبعني أسلم أيضا ، وجاز العطف على الضمير المرفوع من غير تأكيد للفصل بينهما . وأثبت نافع وأبو عمرو ويعقوب ياء \" اتبعني \" على الأصل ، وحذف الآخرون اتباعا للمصحف إذ وقعت فيه بغير ياء . وقال الشاعر :\nليس تخفى يسارتي قدر يوم ولقد تخفي شيمتي إعساري\nقوله تعالى : وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ والله بصير بالعباد يعني اليهود والنصارى والأميين الذين لا كتاب لهم وهم مشركو العرب . أأسلمتم استفهام معناه التقرير وفي ضمنه الأمر ، أي أسلموا ; كذا قال الطبري وغيره . وقال الزجاج : أأسلمتم تهديد . وهذا حسن لأن المعنى أأسلمتم أم لا . وجاءت العبارة في قوله فقد اهتدوا بالماضي مبالغة في الإخبار بوقوع الهدى لهم وتحصيله . و \" البلاغ \" مصدر بلغ بتخفيف عين الفعل ، أي إنما عليك أن تبلغ . وقيل : إنه مما نسخ بالجهاد . وقال ابن عطية : وهذا يحتاج إلى معرفة تاريخ نزولها ; وأما على ظاهر نزول هذه الآيات في وفد نجران فإنما المعنى فإنما عليك أن تبلغ ما أنزل إليك بما فيه من قتال وغيره .\n                                    ",
        "saadi": "فَإِنۡ حَآجُّوكَ فَقُلۡ أَسۡلَمۡتُ وَجۡهِيَ لِلَّهِ وَمَنِ ٱتَّبَعَنِۗ وَقُل لِّلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ وَٱلۡأُمِّيِّ‍ۧنَ ءَأَسۡلَمۡتُمۡۚ فَإِنۡ أَسۡلَمُواْ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُۗ وَٱللَّهُ بَصِيرُۢ بِٱلۡعِبَادِ ٠٢\n                                        \n                                        \n                                        \n                                        ثم أمر تعالى رسوله صلى الله عليه وسلم عند محاجة النصارى وغيرهم ممن يفضل غير دين الإسلام عليه أن يقول لهم: قد { أسلمت وجهي لله ومن اتبعن } أي: أنا ومن اتبعني قد أقررنا وشهدنا وأسلمنا وجوهنا لربنا، وتركنا ما سوى دين الإسلام، وجزمنا ببطلانه، ففي هذا تأييس لمن طمع فيكم، وتجديد لدينكم عند ورود الشبهات، وحجة على من اشتبه عليه الأمر، لأنه قد تقدم أن الله استشهد على توحيده بأهل العلم من عباده ليكونوا حجة على غيرهم، وسيد أهل العلم وأفضلهم وأعلمهم هو نبينا محمد صلى الله عليه وسلم، ثم من بعده أتباعه على اختلاف مراتبهم وتفاوت درجاتهم، فلهم من العلم الصحيح والعقل الرجيح ما ليس لأحد من الخلق ما يساويهم أو يقاربهم، فإذا ثبت وتقرر توحيد الله ودينه بأدلته الظاهرة، وقام به أكمل الخلق وأعلمهم، حصل بذلك اليقين وانتفى كل شك وريب وقادح، وعرف أن ما سواه من الأديان باطلة، فلهذا قال { وقل للذين أوتوا الكتاب } من النصارى واليهود { والأميين } مشركي العرب وغيرهم { أأسلمتم فإن أسلموا } أي: بمثل ما أمنتم به { فقد اهتدوا } كما اهتديتم وصاروا إخوانكم، لهم ما لكم، وعليهم ما عليكم { وإن تولوا } عن الإسلام ورضوا بالأديان التي تخالفه { فإنما عليك البلاغ } فقد وجب أجرك على ربك، وقامت عليهم الحجة، ولم يبق بعد هذا إلا مجازاتهم بالعقاب على جرمهم، فلهذا قال { والله بصير بالعباد }\n                                    "
      },
      "originalText": "فَإِنۡ حَآجُّوكَ فَقُلۡ أَسۡلَمۡتُ وَجۡهِيَ لِلَّهِ وَمَنِ ٱتَّبَعَنِۗ وَقُل لِّلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ وَٱلۡأُمِّيِّ‍ۧنَ ءَأَسۡلَمۡتُمۡۚ فَإِنۡ أَسۡلَمُواْ فَقَدِ ٱهۡتَدَواْۖ وَّإِن تَوَلَّوۡاْ فَإِنَّمَا عَلَيۡكَ ٱلۡبَلَٰغُۗ وَٱللَّهُ بَصِيرُۢ بِٱلۡعِبَادِ ٠٢"
    },
    {
      "number": 314,
      "text": "إِنَّ الَّذِينَ يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّ وَيَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ مِنَ النَّاسِ فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 21,
      "juz": 3,
      "manzil": 1,
      "page": 52,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَيَقۡتُلُونَ ٱلنَّبِيِّ‍ۧنَ بِغَيۡرِ حَقّٖ وَيَقۡتُلُونَ ٱلَّذِينَ يَأۡمُرُونَ بِٱلۡقِسۡطِ مِنَ ٱلنَّاسِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٍ ١٢\n                                    \n                                    \n                                    هذا ذم من الله تعالى لأهل الكتاب فيما ارتكبوه من المآثم والمحارم في تكذيبهم بآيات الله قديما وحديثا ، التي بلغتهم إياها الرسل ، استكبارا عليهم وعنادا لهم ، وتعاظما على الحق واستنكافا عن اتباعه ، ومع هذا قتلوا من قتلوا من النبيين حين بلغوهم عن الله شرعه ، بغير سبب ولا جريمة منهم إليهم ، إلا لكونهم دعوهم إلى الحق ( ويقتلون الذين يأمرون بالقسط من الناس ) وهذا هو غاية الكبر ، كما قال النبي صلى الله عليه وسلم : \" الكبر بطر الحق وغمط الناس \" .\nوقال ابن أبي حاتم : حدثنا أبو الزبير الحسن بن علي بن مسلم النيسابوري ، نزيل مكة ، حدثني أبو حفص عمر بن حفص - يعني ابن ثابت بن زرارة الأنصاري - حدثنا محمد بن حمزة ، حدثني أبو الحسن مولى لبني أسد ، عن مكحول ، عن قبيصة بن ذؤيب الخزاعي ، عن أبي عبيدة بن الجراح ، رضي الله عنه قال : قلت يا رسول الله ، أي الناس أشد عذابا يوم القيامة ؟ قال : \" رجل قتل نبيا أو من أمر بالمعروف ونهى عن المنكر \" . ثم قرأ رسول الله صلى الله عليه وسلم : ( إن الذين يكفرون بآيات الله ويقتلون النبيين بغير حق ويقتلون الذين يأمرون بالقسط من الناس فبشرهم بعذاب أليم ) [ إلى قوله : ( وما لهم من ناصرين ] ) الآية . ثم قال رسول الله صلى الله عليه وسلم : \" يا أبا عبيدة ، قتلت بنو إسرائيل ثلاثة وأربعين نبيا ، من أول النهار في ساعة واحدة ، فقام مائة وسبعون رجلا من بني إسرائيل ، فأمروا من قتلهم بالمعروف ونهوهم عن المنكر ، فقتلوا جميعا من آخر النهار من ذلك اليوم ، فهم الذين ذكر الله عز وجل \" .\nوهكذا رواه ابن جرير عن أبي عبيد الوصابي محمد بن حفص ، عن ابن حمير ، عن أبي الحسن مولى بني أسد ، عن مكحول ، به .\nوعن عبد الله بن مسعود ، رضي الله عنه ، قال : قتلت بنو إسرائيل ثلاثمائة نبي من أول النهار ، وأقاموا سوق بقلهم من آخره . رواه ابن أبي حاتم . ولهذا لما أن تكبروا عن الحق واستكبروا على الخلق ، قابلهم الله على ذلك بالذلة والصغار في الدنيا والعذاب المهين في الآخرة ، فقال : ( فبشرهم بعذاب أليم ) أي : موجع مهين .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَيَقۡتُلُونَ ٱلنَّبِيِّ‍ۧنَ بِغَيۡرِ حَقّٖ وَيَقۡتُلُونَ ٱلَّذِينَ يَأۡمُرُونَ بِٱلۡقِسۡطِ مِنَ ٱلنَّاسِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٍ ١٢\n                                    \n                                    \n                                    قوله تعالى : إن الذين يكفرون بآيات الله ويقتلون النبيين بغير حق ويقتلون الذين يأمرون بالقسط من الناس فبشرهم بعذاب أليم\nفيه ست مسائل ( الأولى ) قوله تعالى : إن الذين يكفرون بآيات الله ويقتلون النبيين قال أبو العباس المبرد : كان ناس من بني إسرائيل جاءهم النبيون يدعونهم إلى الله - عز وجل - فقتلوهم ، فقام أناس من بعدهم من المؤمنين فأمروهم بالإسلام فقتلوهم ; ففيهم نزلت هذه الآية . وكذلك قال معقل بن أبي مسكين : كانت الأنبياء صلوات الله عليهم تجيء إلى بني إسرائيل بغير كتاب فيقتلونهم ، فيقوم قوم ممن اتبعهم فيأمرون بالقسط ، أي بالعدل ، فيقتلون . وقد روي عن ابن مسعود قال : قال النبي - صلى الله عليه وسلم - : بئس القوم قوم يقتلون الذين يأمرون بالقسط من الناس ، بئس القوم قوم لا يأمرون بالمعروف ولا ينهون عن المنكر ، بئس القوم قوم يمشي المؤمن بينهم بالتقية وروى أبو عبيدة بن الجراح أن النبي - صلى الله عليه وسلم - قال : قتلت بنو إسرائيل ثلاثة وأربعين نبيا من أول النهار في ساعة واحدة فقام مائة رجل واثنا عشر رجلا من عباد بني إسرائيل فأمروا بالمعروف ونهوا عن المنكر فقتلوا جميعا في آخر النهار من ذلك اليوم وهم الذين ذكرهم الله في هذه الآية . ذكره المهدوي وغيره . وروى شعبة عن أبي إسحاق عن أبي عبيدة عن عبد الله قال : كانت بنو إسرائيل تقتل في اليوم سبعين نبيا ثم تقوم سوق بقلهم من آخر النهار .\nفإن قال قائل : الذين وعظوا بهذا لم يقتلوا نبيا . فالجواب عن هذا أنهم رضوا فعل من قتل فكانوا بمنزلته ; وأيضا فإنهم قاتلوا النبي - صلى الله عليه وسلم - وأصحابه وهموا بقتلهم ; قال الله عز وجل : وإذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك .\n( الثانية ) دلت هذه الآية على أن الأمر بالمعروف والنهي عن المنكر كان واجبا في الأمم المتقدمة ، وهو فائدة الرسالة وخلافة النبوة . قال الحسن قال النبي - صلى الله عليه وسلم - : من أمر بالمعروف أو نهى عن المنكر فهو خليفة الله في أرضه وخليفة رسوله وخليفة كتابه . وعن درة بنت أبي لهب قالت : جاء رجل إلى النبي - صلى الله عليه وسلم - وهو على المنبر فقال : من خير الناس يا رسول الله ؟ قال : ( آمرهم بالمعروف وأنهاهم عن المنكر وأتقاهم لله وأوصلهم لرحمه ) . وفي التنزيل : المنافقون والمنافقات بعضهم من بعض يأمرون بالمنكر وينهون عن المعروف ثم قال : والمؤمنون والمؤمنات بعضهم أولياء بعض يأمرون بالمعروف وينهون عن المنكر . فجعل تعالى الأمر بالمعروف والنهي عن المنكر فرقا بين المؤمنين والمنافقين ; فدل على أن أخص أوصاف المؤمن الأمر بالمعروف والنهي عن المنكر ، ورأسها الدعاء إلى الإسلام والقتال عليه . ثم إن الأمر بالمعروف لا يليق بكل أحد ، وإنما يقوم به السلطان إذ كانت إقامة الحدود إليه ، والتعزيز إلى رأيه ، والحبس والإطلاق له ، والنفي والتغريب ; فينصب في كل بلدة رجلا صالحا قويا عالما أمينا ويأمره بذلك ، ويمضي الحدود على وجهها من غير زيادة . قال الله تعالى : الذين إن مكناهم في الأرض أقاموا الصلاة وآتوا الزكاة وأمروا بالمعروف ونهوا عن المنكر .\n( الثالثة ) وليس من شرط الناهي أن يكون عدلا عند أهل السنة ، خلافا للمبتدعة حيث تقول : لا يغيره إلا عدل . وهذا ساقط ; فإن العدالة محصورة في القليل من الخلق ، والأمر بالمعروف والنهي عن المنكر عام في جميع الناس . فإن تشبثوا بقوله تعالى : أتأمرون الناس بالبر وتنسون أنفسكم ، وقوله : كبر مقتا عند الله أن تقولوا ما لا تفعلون ونحوه ، قيل لهم : إنما وقع الذم هاهنا على ارتكاب ما نهي عنه لا على نهيه عن المنكر . ولا شك في أن النهي عنه ممن يأتيه أقبح ممن لا يأتيه ، ولذلك يدور في جهنم كما يدور الحمار بالرحى ، كما بيناه في البقرة عند قوله تعالى : أتأمرون الناس بالبر\n. ( الرابعة ) أجمع المسلمون فيما ذكر ابن عبد البر أن المنكر واجب تغييره على كل من قدر عليه ، وإنه إذا لم يلحقه بتغييره إلا اللوم الذي لا يتعدى إلى الأذى فإن ذلك لا يجب أن يمنعه من تغييره ; فإن لم يقدر فبلسانه ، فإن لم يقدر فبقلبه ليس عليه أكثر من ذلك . وإذا أنكر بقلبه فقد أدى ما عليه إذا لم يستطع سوى ذلك . قال : والأحاديث عن النبي - صلى الله عليه وسلم - في تأكيد الأمر بالمعروف والنهي عن المنكر كثيرة جدا ولكنها مقيدة بالاستطاعة . قال الحسن : إنما يكلم مؤمن يرجى أو جاهل يعلم ; فأما من وضع سيفه أو سوطه فقال : اتقني اتقني فما لك وله . وقال ابن مسعود : بحسب المرء إذا رأى منكرا لا يستطيع تغييره أن يعلم الله من قلبه أنه له كاره . وروى ابن لهيعة عن الأعرج عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : لا يحل لمؤمن أن يذل نفسه . قالوا : يا رسول الله وما إذلاله نفسه ؟ قال : ( يتعرض من البلاء لما لا يقوم له ) .\nقلت : وخرجه ابن ماجه عن علي بن زيد بن جدعان عن الحسن بن جندب عن حذيفة عن النبي - صلى الله عليه وسلم - وكلاهما قد تكلم فيه . وروي عن بعض الصحابة أنه قال : إن الرجل إذا رأى منكرا لا يستطيع النكير عليه فليقل ثلاث مرات \" اللهم إن هذا منكر \" فإذا قال ذلك فقد فعل ما عليه ، وزعم ابن العربي أن من رجا زواله وخاف على نفسه من تغييره الضرب أو القتل جاز له عند أكثر العلماء الاقتحام عند هذا الغرر ، وإن لم يرج زواله فأي فائدة عنده . قال : والذي عندي أن النية إذا خلصت فليقتحم كيف ما كان ولا يبالي .\nقلت : هذا خلاف ما ذكره أبو عمر من الإجماع . وهذه الآية تدل على جواز الأمر بالمعروف والنهي عن المنكر مع خوف القتل . وقال تعالى : وأمر بالمعروف وانه عن المنكر واصبر على ما أصابك . وهذا إشارة إلى الإذاية .\n( الخامسة ) روى الأئمة عن أبي سعيد الخدري قال : سمعت رسول الله - صلى الله عليه وسلم - يقول من رأى منكم منكرا فليغيره بيده فإن لم يستطع فبلسانه فإن لم يستطع فبقلبه وذلك أضعف الإيمان . قال العلماء : الأمر بالمعروف باليد على الأمراء ، وباللسان على العلماء ، وبالقلب على الضعفاء ، يعني عوام الناس . فالمنكر إذا أمكنت إزالته باللسان للناهي فليفعله ، وإن لم يمكنه إلا بالعقوبة أو بالقتل فليفعل ، فإن زال بدون القتل لم يجز القتل ; وهذا تلقي من قول الله تعالى : فقاتلوا التي تبغي حتى تفيء إلى أمر الله . وعليه بنى العلماء أنه إذا دفع الصائل على النفس أو على المال عن نفسه أو عن ماله أو نفس غيره فله ذلك ولا شيء عليه . ولو رأى زيد عمرا وقد قصد مال بكر فيجب عليه أن يدفعه عنه إذا لم يكن صاحب المال قادرا عليه ولا راضيا به ; حتى لقد قال العلماء : لو فرضنا قودا . وقيل : كل بلدة يكون فيها أربعة فأهلها معصومون من البلاء : إمام عادل لا يظلم ، وعالم على سبيل الهدى ، ومشايخ يأمرون بالمعروف وينهون عن المنكر ويحرضون على طلب العلم والقرآن ، ونساؤهم مستورات لا يتبرجن تبرج الجاهلية الأولى .\n( السادسة ) روى أنس بن مالك قال : قيل يا رسول الله ، متى نترك الأمر بالمعروف والنهي عن المنكر ؟ قال : ( إذا ظهر فيكم ما ظهر في الأمم قبلكم ) . قلنا : يا رسول الله وما ظهر في الأمم قبلنا ؟ قال : ( الملك في صغاركم والفاحشة في كباركم والعلم في رذالتكم ) . قال زيد : تفسير معنى قول النبي - صلى الله عليه وسلم - ( والعلم في رذالتكم ) إذا كان العلم في الفساق . خرجه ابن ماجه . وسيأتي لهذا الباب مزيد بيان في \" المائدة \" وغيرها إن شاء الله تعالى وتقدم معنى فبشرهم وحبطت في البقرة فلا معنى للإعادة .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَيَقۡتُلُونَ ٱلنَّبِيِّ‍ۧنَ بِغَيۡرِ حَقّٖ وَيَقۡتُلُونَ ٱلَّذِينَ يَأۡمُرُونَ بِٱلۡقِسۡطِ مِنَ ٱلنَّاسِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٍ ١٢\n                                        \n                                        \n                                        \n                                        هؤلاء الذين أخبر الله عنهم في هذه الآية، أشد الناس جرما وأي: جرم أعظم من الكفر بآيات الله التي تدل دلالة قاطعة على الحق الذي من كفر بها فهو في غاية الكفر والعناد ويقتلون أنبياء الله الذين حقهم أوجب الحقوق على العباد بعد حق الله، الذين أوجب الله طاعتهم والإيمان بهم، وتعزيرهم، وتوقيرهم، ونصرهم وهؤلاء قابلوهم بضد ذلك، ويقتلون أيضا الذين يأمرون الناس بالقسط الذي هو العدل، وهو الأمر بالمعروف والنهي عن المنكر الذي حقيقته إحسان إلى المأمور ونصح له، فقابلوهم شر مقابلة، فاستحقوا بهذه الجنايات المنكرات أشد العقوبات، وهو العذاب المؤلم البالغ في الشدة إلى غاية لا يمكن وصفها، ولا يقدر قدرها المؤلم للأبدان والقلوب والأرواح.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ يَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَيَقۡتُلُونَ ٱلنَّبِيِّ‍ۧنَ بِغَيۡرِ حَقّٖ وَيَقۡتُلُونَ ٱلَّذِينَ يَأۡمُرُونَ بِٱلۡقِسۡطِ مِنَ ٱلنَّاسِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٍ ١٢"
    },
    {
      "number": 315,
      "text": "أُولَٰئِكَ الَّذِينَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُمْ مِنْ نَاصِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 22,
      "juz": 3,
      "manzil": 1,
      "page": 52,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أُوْلَٰٓئِكَ ٱلَّذِينَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ ٢٢\n                                    \n                                    \n                                    أُولَٰئِكَ الَّذِينَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُم مِّن نَّاصِرِينَ\n                                    ",
        "qortoby": "أُوْلَٰٓئِكَ ٱلَّذِينَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ ٢٢\n                                    \n                                    \n                                    أي بطلت وفسدت ; ومنه الحبط وهو فساد يلحق المواشي في بطونها من كثرة أكلها الكلأ فتنتفخ أجوافها ,\n                                    ",
        "saadi": "أُوْلَٰٓئِكَ ٱلَّذِينَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ ٢٢\n                                        \n                                        \n                                        \n                                        وبطلت أعمالهم بما كسبت أيديهم، وما لهم أحد ينصرهم من عذاب الله ولا يدفع عنهم من نقمته مثقال ذرة، بل قد أيسوا من كل خير، وحصل لهم كل شر وضير، وهذه الحالة صفة اليهود ونحوهم، قبحهم الله ما أجرأهم على الله وعلى أنبيائه وعباده الصالحين.\n                                    "
      },
      "originalText": "أُوْلَٰٓئِكَ ٱلَّذِينَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ ٢٢"
    }
  ]
}