{
  "number": 53,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 316,
      "text": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ يُدْعَوْنَ إِلَىٰ كِتَابِ اللَّهِ لِيَحْكُمَ بَيْنَهُمْ ثُمَّ يَتَوَلَّىٰ فَرِيقٌ مِنْهُمْ وَهُمْ مُعْرِضُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 23,
      "juz": 3,
      "manzil": 1,
      "page": 53,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ أُوتُواْ نَصِيبٗا مِّنَ ٱلۡكِتَٰبِ يُدۡعَوۡنَ إِلَىٰ كِتَٰبِ ٱللَّهِ لِيَحۡكُمَ بَيۡنَهُمۡ ثُمَّ يَتَوَلَّىٰ فَرِيقٞ مِّنۡهُمۡ وَهُم مُّعۡرِضُونَ ٣٢\n                                    \n                                    \n                                    يقول تعالى منكرا على اليهود والنصارى ، المتمسكين فيما يزعمون بكتابيهم اللذين بأيديهم ، وهما التوراة والإنجيل ، وإذا دعوا إلى التحاكم إلى ما فيهما من طاعة الله فيما أمرهم به فيهما ، من اتباع محمد صلى الله عليه وسلم ، تولوا وهم معرضون عنهما ، وهذا في غاية ما يكون من ذمهم ، والتنويه بذكرهم بالمخالفة والعناد .\n                                    ",
        "qortoby": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ أُوتُواْ نَصِيبٗا مِّنَ ٱلۡكِتَٰبِ يُدۡعَوۡنَ إِلَىٰ كِتَٰبِ ٱللَّهِ لِيَحۡكُمَ بَيۡنَهُمۡ ثُمَّ يَتَوَلَّىٰ فَرِيقٞ مِّنۡهُمۡ وَهُم مُّعۡرِضُونَ ٣٢\n                                    \n                                    \n                                    قوله تعالى : ألم تر إلى الذين أوتوا نصيبا من الكتاب يدعون إلى كتاب الله ليحكم بينهم ثم يتولى فريق منهم وهم معرضون فيه ثلاث مسائل ( الأولى ) قال ابن عباس : هذه الآية نزلت بسبب أن رسول الله - صلى الله عليه وسلم - دخل بيت المدراس على جماعة من يهود فدعاهم إلى الله . فقال له نعيم بن عمرو والحارث بن زيد : على أي دين أنت يا محمد ؟ فقال النبي - صلى الله عليه وسلم - : ( إني على ملة إبراهيم ) . فقالا : فإن إبراهيم كان يهوديا . فقال النبي - صلى الله عليه وسلم - : ( فهلموا إلى التوراة فهي بيننا وبينكم ) . فأبيا عليه فنزلت الآية . وذكر النقاش أنها نزلت لأن جماعة من اليهود أنكروا نبوة محمد - صلى الله عليه وسلم - فقال لهم النبي - صلى الله عليه وسلم - : ( هلموا إلى التوراة ففيها صفتي ) فأبوا . وقرأ الجمهور ليحكم وقرأ أبو جعفر يزيد بن القعقاع \" ليحكم \" بضم الياء . والقراءة الأولى أحسن ; لقوله تعالى : هذا كتابنا ينطق عليكم بالحق ( الثانية ) في هذه الآية دليل على وجوب ارتفاع المدعو إلى الحاكم لأنه دعي إلى كتاب الله ; فإن لم يفعل كان مخالفا يتعين عليه الزجر بالأدب على قدر المخالف والمخالف . وهذا الحكم جار عندنا بالأندلس وبلاد المغرب وليس بالديار المصرية . وهذا الحكم الذي ذكرناه مبين في التنزيل في سورة \" النور \" في قوله تعالى : وإذا دعوا إلى الله ورسوله ليحكم بينهم إذا فريق منهم معرضون إلى قوله بل أولئك هم الظالمون . وأسند الزهري عن الحسن أن رسول الله - صلى الله عليه وسلم - قال : من دعاه خصمه إلى حاكم من حكام المسلمين فلم يجب فهو ظالم ولا حق له . قال ابن العربي : وهذا حديث باطل . أما قوله \" فهو ظالم \" فكلام صحيح . وأما قوله \" فلا حق له \" فلا يصح ، ويحتمل أن يريد أنه على غير الحق . قال ابن خويز منداد المالكي : واجب على كل من دعي إلى مجلس الحاكم أن يجيب ما لم يعلم أن الحاكم فاسق ، أو يعلم عداؤه من المدعي والمدعى عليه .\n( الثالثة ) وفيها دليل على أن شرائع من قبلنا شريعة لنا إلا ما علمنا نسخه ، وإنه يجب علينا الحكم بشرائع الأنبياء قبلنا ، على ما يأتي بيانه . وإنما لا نقرأ التوراة ولا نعمل بما فيها لأن من هي في يده غير أمين عليها وقد غيرها وبدلها ، ولو علمنا أن شيئا منها لم يتغير ولم يتبدل جاز لنا قراءته . ونحو ذلك روي عن عمر حيث قال لكعب : إن كنت تعلم أنها التوراة التي أنزلها الله على موسى بن عمران فاقرأها . وكان عليه السلام عالما بما لم يغير منها فلذلك دعاهم إليها وإلى الحكم بها . وسيأتي بيان هذا في \" المائدة \" والأخبار الواردة في ذلك إن شاء الله تعالى وقد قيل : إن هذه الآية نزلت في ذلك والله أعلم .\n( الثالثة ) وفيها دليل على أن شرائع من قبلنا شريعة لنا إلا ما علمنا نسخه ، وإنه يجب علينا الحكم بشرائع الأنبياء قبلنا ، على ما يأتي بيانه . وإنما لا نقرأ التوراة ولا نعمل بما فيها لأن من هي في يده غير أمين عليها وقد غيرها وبدلها ، ولو علمنا أن شيئا منها لم يتغير ولم يتبدل جاز لنا قراءته . ونحو ذلك روي عن عمر حيث قال لكعب : إن كنت تعلم أنها التوراة التي أنزلها الله على موسى بن عمران فاقرأها . وكان عليه السلام عالما بما لم يغير منها فلذلك دعاهم إليها وإلى الحكم بها . وسيأتي بيان هذا في \" المائدة \" والأخبار الواردة في ذلك إن شاء الله تعالى وقد قيل : إن هذه الآية نزلت في ذلك والله أعلم .\n                                    ",
        "saadi": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ أُوتُواْ نَصِيبٗا مِّنَ ٱلۡكِتَٰبِ يُدۡعَوۡنَ إِلَىٰ كِتَٰبِ ٱللَّهِ لِيَحۡكُمَ بَيۡنَهُمۡ ثُمَّ يَتَوَلَّىٰ فَرِيقٞ مِّنۡهُمۡ وَهُم مُّعۡرِضُونَ ٣٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن حال أهل الكتاب الذين أنعم الله عليهم بكتابه، فكان يجب أن يكونوا أقوم الناس به وأسرعهم انقيادا لأحكامه، فأخبر الله عنهم أنهم إذا دعوا إلى حكم الكتاب تولى فريق منهم وهم يعرضون، تولوا بأبدانهم، وأعرضوا بقلوبهم، وهذا غاية الذم، وفي ضمنها التحذير لنا أن نفعل كفعلهم، فيصيبنا من الذم والعقاب ما أصابهم، بل الواجب على كل أحد إذا دعي إلى كتاب الله أن يسمع ويطيع وينقاد، كما قال تعالى { إنما كان قول المؤمنين إذا دعوا إلى الله ورسوله ليحكم بينهم أن يقولوا سمعنا وأطعنا }\n                                    "
      },
      "originalText": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ أُوتُواْ نَصِيبٗا مِّنَ ٱلۡكِتَٰبِ يُدۡعَوۡنَ إِلَىٰ كِتَٰبِ ٱللَّهِ لِيَحۡكُمَ بَيۡنَهُمۡ ثُمَّ يَتَوَلَّىٰ فَرِيقٞ مِّنۡهُمۡ وَهُم مُّعۡرِضُونَ ٣٢"
    },
    {
      "number": 317,
      "text": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَعْدُودَاتٍ ۖ وَغَرَّهُمْ فِي دِينِهِمْ مَا كَانُوا يَفْتَرُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 24,
      "juz": 3,
      "manzil": 1,
      "page": 53,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامٗا مَّعۡدُودَٰتٖۖ وَغَرَّهُمۡ فِي دِينِهِم مَّا كَانُواْ يَفۡتَرُونَ ٤٢\n                                    \n                                    \n                                    ثم قال : ( ذلك بأنهم قالوا لن تمسنا النار إلا أياما معدودات ) أي : إنما حملهم وجرأهم على مخالفة الحق افتراؤهم على الله فيما ادعوه لأنفسهم أنهم إنما يعذبون في النار سبعة أيام ، عن كل ألف سنة في الدنيا يوما . وقد تقدم تفسير ذلك في سورة البقرة . ثم قال : ( وغرهم في دينهم ما كانوا يفترون ) [ أي غرهم في دينهم ] أي : ثبتهم على دينهم الباطل ما خدعوا به أنفسهم من زعمهم أن النار لا تمسهم بذنوبهم إلا أياما معدودات ، وهم الذين افتروا هذا من تلقاء أنفسهم وافتعلوه ، ولم ينزل الله به سلطانا\n                                    ",
        "qortoby": "ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامٗا مَّعۡدُودَٰتٖۖ وَغَرَّهُمۡ فِي دِينِهِم مَّا كَانُواْ يَفۡتَرُونَ ٤٢\n                                    \n                                    \n                                    قوله تعالى : ذلك بأنهم قالوا لن تمسنا النار إلا أياما معدودات وغرهم في دينهم ما كانوا يفترون إشارة إلى التولي والإعراض ، واغترار منهم في قولهم : نحن أبناء الله وأحباؤه إلى غير ذلك من أقوالهم وقد مضى الكلام في معنى قولهم : لن تمسنا النار في البقرة .\n                                    ",
        "saadi": "ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامٗا مَّعۡدُودَٰتٖۖ وَغَرَّهُمۡ فِي دِينِهِم مَّا كَانُواْ يَفۡتَرُونَ ٤٢\n                                        \n                                        \n                                        \n                                        والسبب الذي غر أهل الكتاب بتجرئهم على معاصي الله هو قولهم { لن تمسنا النار إلا أياما معدودات وغرهم في دينهم ما كانوا يفترون } افتروا هذا القول فظنوه حقيقة فعملوا على ذلك ولم ينزجروا عن المحارم، لأن أنفسهم منتهم وغرتهم أن مآلهم إلى الجنة، وكذبوا في ذلك، فإن هذا مجرد كذب وافتراء، وإنما مآلهم شر مآل، وعاقبتهم عاقبة وخيمة\n                                    "
      },
      "originalText": "ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامٗا مَّعۡدُودَٰتٖۖ وَغَرَّهُمۡ فِي دِينِهِم مَّا كَانُواْ يَفۡتَرُونَ ٤٢"
    },
    {
      "number": 318,
      "text": "فَكَيْفَ إِذَا جَمَعْنَاهُمْ لِيَوْمٍ لَا رَيْبَ فِيهِ وَوُفِّيَتْ كُلُّ نَفْسٍ مَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 25,
      "juz": 3,
      "manzil": 1,
      "page": 53,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَكَيۡفَ إِذَا جَمَعۡنَٰهُمۡ لِيَوۡمٖ لَّا رَيۡبَ فِيهِ وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ٥٢\n                                    \n                                    \n                                    قال الله تعالى متهددا لهم ومتوعدا : ( فكيف إذا جمعناهم ليوم لا ريب فيه ) أي : كيف يكون حالهم وقد افتروا على الله وكذبوا رسله وقتلوا أنبياءه والعلماء من قومهم ، الآمرين بالمعروف والناهين عن المنكر ، والله تعالى سائلهم عن ذلك كله ، ومحاسبهم عليه ، ومجازيهم به، ولهذا قال : ( فكيف إذا جمعناهم ليوم لا ريب فيه ) لا شك في وقوعه وكونه ( ووفيت كل نفس ما كسبت وهم لا يظلمون )\n                                    ",
        "qortoby": "فَكَيۡفَ إِذَا جَمَعۡنَٰهُمۡ لِيَوۡمٖ لَّا رَيۡبَ فِيهِ وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ٥٢\n                                    \n                                    \n                                    قوله تعالى : فكيف إذا جمعناهم ليوم لا ريب فيه ووفيت كل نفس ما كسبت وهم لا يظلمون خطاب للنبي - صلى الله عليه وسلم - وأمته على جهة التوقيف والتعجب ، أي فكيف يكون حالهم أو كيف يصنعون إذا حشروا يوم القيامة واضمحلت عنهم تلك الزخارف التي ادعوها في الدنيا ، وجوزوا بما اكتسبوه من كفرهم واجترائهم وقبيح أعمالهم . واللام في قوله ليوم بمعنى \" في \" ; قاله الكسائي ، وقال البصريون : المعنى لحساب يوم ، الطبري : لما يحدث في يوم .\n                                    ",
        "saadi": "فَكَيۡفَ إِذَا جَمَعۡنَٰهُمۡ لِيَوۡمٖ لَّا رَيۡبَ فِيهِ وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ٥٢\n                                        \n                                        \n                                        \n                                        أي: كيف يكون حالهم ووخيم ما يقدمون عليه، حالة لا يمكن وصفها ولا يتصور قبحها لأن ذلك اليوم يوم توفية النفوس ما كسبت ومجازاتها بالعدل لا بالظلم، وقد علم أن ذلك على قدر الأعمال، وقد تقدم من أعمالهم ما يبين أنهم من أشد الناس عذابا.\n                                    "
      },
      "originalText": "فَكَيۡفَ إِذَا جَمَعۡنَٰهُمۡ لِيَوۡمٖ لَّا رَيۡبَ فِيهِ وَوُفِّيَتۡ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ٥٢"
    },
    {
      "number": 319,
      "text": "قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَاءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَاءُ وَتُعِزُّ مَنْ تَشَاءُ وَتُذِلُّ مَنْ تَشَاءُ ۖ بِيَدِكَ الْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 26,
      "juz": 3,
      "manzil": 1,
      "page": 53,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلِ ٱللَّهُمَّ مَٰلِكَ ٱلۡمُلۡكِ تُؤۡتِي ٱلۡمُلۡكَ مَن تَشَآءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖ بِيَدِكَ ٱلۡخَيۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٦٢\n                                    \n                                    \n                                    يقول تعالى : ( قل ) يا محمد ، معظما لربك ومتوكلا عليه ، وشاكرا له ومفوضا إليه : ( اللهم مالك الملك ) أي : لك الملك كله ( تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء ) أي : أنت المعطي ، وأنت المانع ، وأنت الذي ما شئت كان وما لم تشأ لم يكن .\nوفي هذه الآية تنبيه وإرشاد إلى شكر نعمة الله تعالى على رسوله صلى الله عليه وسلم وهذه الأمة ، لأن الله حول النبوة من بني إسرائيل إلى النبي العربي القرشي المكي الأمي خاتم الأنبياء على الإطلاق ، ورسول الله إلى جميع الثقلين الإنس والجن ، الذي جمع الله فيه محاسن من كان قبله ، وخصه بخصائص لم يعطها نبيا من الأنبياء ولا رسولا من الرسل ، في العلم بالله وشريعته وإطلاعه على الغيوب الماضية والآتية ، وكشفه عن حقائق الآخرة ونشر أمته في الآفاق ، في مشارق الأرض ومغاربها ، وإظهار دينه وشرعه على سائر الأديان والشرائع ، فصلوات الله وسلامه عليه دائما إلى يوم الدين ، ما تعاقب الليل والنهار . ولهذا قال تعالى : ( قل اللهم مالك الملك [ تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء بيدك الخير إنك على كل شيء قدير ] ) أي : أنت المتصرف في خلقك ، الفعال لما تريد ، كما رد تبارك وتعالى على من يتحكم عليه في أمره ، حيث قال : ( وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم ) [ الزخرف : 31 ] .\nقال الله تعالى ردا عليهم : ( أهم يقسمون رحمة ربك [ نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات ] ) الآية [ الزخرف : 32 ] أي : نحن نتصرف في خلقنا كما نريد ، بلا ممانع ولا مدافع ، ولنا الحكمة والحجة في ذلك ، وهكذا نعطي النبوة لمن نريد ، كما قال تعالى : ( الله أعلم حيث يجعل رسالته ) [ الأنعام : 124 ] وقال تعالى : ( انظر كيف فضلنا بعضهم على بعض [ وللآخرة أكبر درجات وأكبر تفضيلا ] ) [ الإسراء : 21 ] وقد روى الحافظ ابن عساكر في ترجمة \" إسحاق بن أحمد \" من تاريخه عن المأمون الخليفة : أنه رأى في قصر ببلاد الروم مكتوبا بالحميرية ، فعرب له ، فإذا هو :\nباسم الله ما اختلف الليل والنهار ، ولا دارت نجوم السماء في الفلك إلا بنقل النعيم عن ملك\nقد زال سلطانه إلى ملك وملك ذي العرش دائم أبدا\nليس بفان ولا بمشترك\n.\n                                    ",
        "qortoby": "قُلِ ٱللَّهُمَّ مَٰلِكَ ٱلۡمُلۡكِ تُؤۡتِي ٱلۡمُلۡكَ مَن تَشَآءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖ بِيَدِكَ ٱلۡخَيۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٦٢\n                                    \n                                    \n                                    قوله تعالى : قل اللهم مالك الملك تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء بيدك الخير إنك على كل شيء قدير\nقال علي - رضي الله عنه - قال النبي - صلى الله عليه وسلم - : لما أراد الله تعالى أن ينزل فاتحة الكتاب وآية الكرسي وشهد الله وقل اللهم مالك الملك إلى قوله بغير حساب تعلقن بالعرش وليس بينهن وبين الله حجاب وقلن يا رب تهبط بنا دار الذنوب وإلى من يعصيك فقال الله تعالى وعزتي وجلالي لا يقرؤكن عقب كل صلاة مكتوبة إلا أسكنته حظيرة القدس على ما كان منه ، وإلا نظرت إليه بعيني المكنونة في كل يوم سبعين نظرة ، وإلا قضيت له في كل يوم سبعين حاجة أدناها المغفرة ، وإلا أعذته من كل عدو ونصرته عليه ولا يمنعه من دخول الجنة إلا أن يموت . وقال معاذ بن جبل : احتبست عن النبي - صلى الله عليه وسلم - يوما فلم أصل معه الجمعة فقال : ( يا معاذ ما منعك من صلاة الجمعة ؟ ) قلت : يا رسول الله ، كان ليوحنا بن باريا اليهودي علي أوقية من تبر وكان على بابي يرصدني فأشفقت أن يحبسني دونك . قال : ( أتحب يا معاذ أن يقضي الله دينك ؟ ) قلت : نعم . قال : ( قل كل يوم قل اللهم مالك الملك - إلى قوله - بغير حساب رحمن الدنيا والآخرة ورحيمهما تعطي منهما من تشاء وتمنع منهما من تشاء اقض عني ديني فلو كان عليك ملء الأرض ذهبا لأداه الله عنك ) . خرجه أبو نعيم الحافظ ، أيضا عن عطاء الخراساني أن معاذ بن جبل قال : علمني رسول الله - صلى الله عليه وسلم - آيات من القرآن - أو كلمات - ما في الأرض مسلم يدعو بهن وهو مكروب أو غارم أو ذو دين إلا قضى الله عنه وفرج همه ، احتبست عن النبي - صلى الله عليه وسلم - ; فذكره . غريب من حديث عطاء أرسله عن معاذ . وقال ابن عباس وأنس بن مالك : لما افتتح رسول الله - صلى الله عليه وسلم - مكة ووعد أمته ملك فارس والروم قال المنافقون واليهود : هيهات هيهات ! من أين لمحمد ملك فارس والروم هم أعز وأمنع من ذلك ، ألم يكف محمدا مكة والمدينة حتى طمع في ملك فارس والروم ; فأنزل الله تعالى هذه الآية . وقيل : نزلت دامغة لباطل نصارى أهل نجران في قولهم : إن عيسى هو الله ; وذلك أن هذه الأوصاف تبين لكل صحيح الفطرة أن عيسى ليس في شيء منها . قال ابن إسحاق : أعلم الله عز وجل في هذه الآية بعنادهم وكفرهم ، وأن عيسى - صلى الله عليه وسلم - وإن كان الله تعالى أعطاه آيات تدل على نبوته من إحياء الموتى وغير ذلك فإن الله عز وجل هو المنفرد بهذه الأشياء ; من قوله : تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء . وقوله : تولج الليل في النهار وتولج النهار في الليل وتخرج الحي من الميت وتخرج الميت من الحي وترزق من تشاء بغير حساب فلو كان عيسى إلها كان هذا إليه ; فكان في ذلك اعتبار وآية بينة .\nقوله تعالى : قل اللهم اختلف النحويون في تركيب لفظة \" اللهم \" بعد إجماعهم أنها مضمومة الهاء مشددة الميم المفتوحة ، وأنها منادى ; وقد جاءت مخففة الميم في قول الأعشى :\nكدعوة من أبي رباح يسمعها إليهم الكبار\nقال الخليل وسيبويه وجميع البصريين : إن أصل اللهم يا ألله ، فلما استعملت الكلمة دون حرف النداء الذي هو \" يا \" جعلوا بدله هذه الميم المشددة ، فجاءوا بحرفين وهما الميمان عوضا من حرفين وهما الياء والألف ، والضمة في الهاء هي ضمة الاسم المنادى المفرد . وذهب الفراء والكوفيون إلى أن الأصل في اللهم يا ألله أمنا بخير ; فحذف وخلط الكلمتين ، وإن الضمة التي في الهاء هي الضمة التي كانت في أمنا لما حذفت الهمزة انتقلت الحركة . قال النحاس : هذا عند البصريين من الخطأ العظيم ، والقول في هذا ما قال الخليل وسيبويه . قال الزجاج : محال أن يترك الضم الذي هو دليل على النداء المفرد ، وأن يجعل في اسم الله ضمة أم ، هذا إلحاد في اسم الله تعالى . قال ابن عطية : وهذا غلو من الزجاج ، وزعم أنه ما سمع قط \" يا ألله أم \" ، ولا تقول العرب يا اللهم . وقال الكوفيون : إنه قد يدخل حرف النداء على \" اللهم \" وأنشدوا على ذلك قول الراجز :\nغفرت أو عذبت يا اللهما\nآخر :\nوما عليك أن تقولي كلما سبحت أو هللت يا اللهما\nاردد علينا شيخنا مسلما فإننا من خيره لن نعدما\nآخر :\nإني إذا ما حدث ألما أقول يا اللهم يا اللهما\nقالوا : فلو كان الميم عوضا من حرف النداء لما اجتمعا . قال الزجاج : وهذا شاذ ولا يعرف قائله ، ولا يترك له ما كان في كتاب الله وفي جميع ديوان العرب ; وقد ورد مثله في قوله :\nهما نفثا في في من فمويهما على النابح العاوي أشد رجام\nقال الكوفيون : وإنما تزاد الميم مخففة في \" فم وابنم \" ، وأما ميم مشددة فلا تزاد . وقال بعض النحويين : ما قاله الكوفيون خطأ ; لأنه لو كان كما قالوا كان يجب أن يقال : \" اللهم \" ويقتصر عليه لأنه معه دعاء . وأيضا فقد تقول : أنت اللهم الرزاق . فلو كان كما ادعوا لكنت قد فصلت بجملتين بين الابتداء والخبر . قال النضر بن شميل : من قال اللهم فقد دعا الله تعالى بجميع أسمائه كلها وقال الحسن : اللهم تجمع الدعاء .\nقوله تعالى : مالك الملك قال قتادة : بلغني أن النبي - صلى الله عليه وسلم - سأل الله - عز وجل - أن يعطي أمته ملك فارس فأنزل الله هذه الآية . وقال مقاتل : سأل النبي - صلى الله عليه وسلم - أن يجعل الله له ملك فارس والروم في أمته ; فعلمه الله تعالى بأن يدعو بهذا الدعاء . وقد تقدم معناه . و \" مالك \" منصوب عند سيبويه على أنه نداء ثان ; ومثله قوله تعالى : قل اللهم فاطر السماوات والأرض ولا يجوز عنده أن يوصف اللهم لأنه قد ضمت إليه الميم . وخالفه محمد بن يزيد وإبراهيم بن السري الزجاج فقالا : \" مالك \" في الإعراب صفة لاسم الله تعالى ، وكذلك فاطر السماوات والأرض . قال أبو علي ; هو مذهب أبي العباس المبرد ; وما قاله سيبويه أصوب وأبين ; وذلك أنه ليس في الأسماء الموصوفة شيء على حد \" اللهم \" لأنه اسم مفرد ضم إليه صوت ، والأصوات لا توصف ; نحو غاق وما أشبهه . وكان حكم الاسم المفرد ألا يوصف وإن كانوا قد وصفوه في مواضع . فلما ضم هنا ما لا يوصف إلى ما كان قياسه ألا يوصف صار بمنزلة صوت ضم إلى صوت ; نحو حيهل فلم يوصف . و \" الملك \" هنا النبوة ; عن مجاهد . وقيل ، الغلبة . وقيل : المال والعبيد . الزجاج : المعنى مالك العباد وما ملكوا . وقيل : المعنى مالك الدنيا والآخرة .\nومعنى تؤتي الملك أي الإيمان والإسلام . من تشاء أي من تشاء أن تؤتيه إياه ، وكذلك ما بعده ، ولا بد فيه من تقدير الحذف ، أي وتنزع الملك ممن تشاء أن تنزعه منه ، ثم حذف هذا ، وأنشد سيبويه :\nألا هل لهذا الدهر من متعلل على الناس مهما شاء بالناس يفعل\nقال الزجاج : مهما شاء أن يفعل بالناس يفعل . وتعز من تشاء يقال : عز إذا علا وقهر وغلب ; ومنه ، وعزني في الخطاب . وتذل من تشاء ذل يذل إذا غلب وعلا وقهر . قال طرفة :\nبطيء عن الجلى سريع إلى الخنا ذليل بأجماع الرجال ملهد\nبيدك الخير أي بيدك الخير والشر فحذف ; كما قال : سرابيل تقيكم الحر . وقيل : خص الخير لأنه موضع دعاء ورغبة في فضله . قال النقاش : بيدك الخير ، أي النصر والغنيمة . وقال أهل الإشارات . كان أبو جهل يملك المال الكثير ، ووقع في الرس يوم بدر ، والفقراء صهيب وبلال وخباب لم يكن لهم مال ، وكان ملكهم الإيمان ، قل اللهم مالك الملك تؤتي الملك من تشاء تقيم الرسول يتيم أبي طالب على رأس الرس حتى ينادي أبدانا قد انقلبت إلى القليب : يا عتبة ، يا شيبة تعز من تشاء وتذل من تشاء . أي صهيب ، أي بلال ، لا تعتقدوا أنا منعناكم من الدنيا ببغضكم . بيدك الخير ما منعكم من عجز إنك على كل شيء قدير إنعام الحق عام يتولى من يشاء .\n                                    ",
        "saadi": "قُلِ ٱللَّهُمَّ مَٰلِكَ ٱلۡمُلۡكِ تُؤۡتِي ٱلۡمُلۡكَ مَن تَشَآءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖ بِيَدِكَ ٱلۡخَيۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٦٢\n                                        \n                                        \n                                        \n                                        يقول الله لنبيه صلى الله عليه وسلم { قل اللهم مالك الملك } أي: أنت الملك المالك لجميع الممالك، فصفة الملك المطلق لك، والمملكة كلها علويها وسفليها لك والتصريف والتدبير كله لك، ثم فصل بعض التصاريف التي انفرد الباري تعالى بها، فقال: { تؤتي الملك من تشاء وتنزع الملك ممن تشاء } وفيه الإشارة إلى أن الله تعالى سينزع الملك من الأكاسرة والقياصرة ومن تبعهم ويؤتيه أمة محمد، وقد فعل ولله الحمد، فحصول الملك ونزعه تبع لمشيئة الله تعالى، ولا ينافي ذلك ما أجرى الله به سنته من الأسباب الكونية والدينية التي هي سبب بقاء الملك وحصوله وسبب زواله، فإنها كلها بمشيئة الله لا يوجد سبب يستقل بشيء، بل الأسباب كلها تابعة للقضاء والقدر، ومن الأسباب التي جعلها الله سببا لحصول الملك الإيمان والعمل الصالح، التي منها اجتماع المسلمين واتفاقهم، وإعدادهم الآلات التي يقدروا عليها والصبر وعدم التنازع، قال الله تعالى: { وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفنهم في الأرض كما استخلف الذين من قبلهم } الآية فأخبر أن الإيمان والعمل الصالح سبب للاستخلاف المذكور، وقال تعالى: { هو الذي أيدك بنصره وبالمؤمنين وألف بين قلوبهم } الآية وقال تعالى: { يا أيها الذين آمنوا إذا لقيتم فئة فاثبتوا واذكروا الله كثيرا لعلكم تفلحون وأطيعوا الله ورسوله ولا تنازعوا فتفشلوا وتذهب ريحكم واصبروا إن الله مع الصابرين } فأخبر أن ائتلاف قلوب المؤمنين وثباتهم وعدم تنازعهم سبب للنصر على الأعداء، وأنت إذا استقرأت الدول الإسلامية وجدت السبب الأعظم في زوال ملكها ترك الدين والتفرق الذي أطمع فيهم الأعداء وجعل بأسهم بينهم، ثم قال تعالى: { وتعز من تشاء } بطاعتك { وتذل من تشاء } بمعصيتك { إنك على كل شيء قدير } لا يمتنع عليك أمر من الأمور بل الأشياء كلها طوع مشيئتك وقدرتك\n                                    "
      },
      "originalText": "قُلِ ٱللَّهُمَّ مَٰلِكَ ٱلۡمُلۡكِ تُؤۡتِي ٱلۡمُلۡكَ مَن تَشَآءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖ بِيَدِكَ ٱلۡخَيۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٦٢ "
    },
    {
      "number": 320,
      "text": "تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلِ ۖ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيِّ ۖ وَتَرْزُقُ مَنْ تَشَاءُ بِغَيْرِ حِسَابٍ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 27,
      "juz": 3,
      "manzil": 1,
      "page": 53,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۖ وَتُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَتُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّۖ وَتَرۡزُقُ مَن تَشَآءُ بِغَيۡرِ حِسَابٖ ٧٢\n                                    \n                                    \n                                    وقوله : ( تولج الليل في النهار وتولج النهار في الليل ) أي : تأخذ من طول هذا فتزيده في قصر هذا فيعتدلان ، ثم تأخذ من هذا في هذا فيتفاوتان ، ثم يعتدلان . وهكذا في فصول السنة : ربيعا وصيفا وخريفا وشتاء .\nوقوله : ( وتخرج الحي من الميت وتخرج الميت من الحي ) أي : تخرج الحبة من الزرع والزرع من الحبة ، والنخلة من النواة والنواة من النخلة ، والمؤمن من الكافر والكافر من المؤمن ، والدجاجة من البيضة والبيضة من الدجاجة ، وما جرى هذا المجرى من جميع الأشياء ( وترزق من تشاء بغير حساب ) أي : تعطي من شئت من المال ما لا يعده ولا يقدر على إحصائه ، وتقتر على آخرين ، لما لك في ذلك من الحكمة والإرادة والمشيئة والعدل . قال الطبراني : حدثنا محمد بن زكريا الغلابي ، حدثنا جعفر بن جسر بن فرقد ، حدثنا أبي ، عن عمرو بن مالك ، عن أبي الجوزاء ، عن ابن عباس ، عن النبي صلى الله عليه وسلم قال : \" اسم الله الأعظم الذي إذا دعي به أجاب ، في هذه الآية من آل عمران : ( قل اللهم مالك الملك [ تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء بيدك الخير إنك على كل شيء قدير ] ) .\n                                    ",
        "qortoby": "تُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۖ وَتُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَتُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّۖ وَتَرۡزُقُ مَن تَشَآءُ بِغَيۡرِ حِسَابٖ ٧٢\n                                    \n                                    \n                                    قوله تعالى : تولج الليل في النهار وتولج النهار في الليل وتخرج الحي من الميت وتخرج الميت من الحي وترزق من تشاء بغير حساب\nقال ابن عباس ومجاهد والحسن وقتادة والسدي في معنى قوله تولج الليل في النهار الآية ، أي تدخل ما نقص من أحدهما في الآخر ، حتى يصير النهار خمس عشرة ساعة وهو أطول ما يكون ، والليل تسع ساعات وهو أقصر ما يكون . وكذا تولج النهار في الليل وهو قول الكلبي ، وروي عن ابن مسعود . وتحتمل ألفاظ الآية أن يدخل فيها تعاقب الليل والنهار ، كأن زوال أحدهما ولوج في الآخر .\nواختلف المفسرون في معنى قوله تعالى : وتخرج الحي من الميت فقال الحسن : معناه تخرج المؤمن من الكافر والكافر من المؤمن ، وروي نحوه عن سلمان الفارسي . وروى معمر عن الزهري أن النبي - صلى الله عليه وسلم - دخل على نسائه فإذا بامرأة حسنة الهيئة قال : ( من هذه ؟ ) قلن إحدى خالاتك . قال : ( ومن هي ؟ ) قلن : هي خالدة بنت الأسود بن عبد يغوث . فقال النبي - صلى الله عليه وسلم - : ( سبحان الذي يخرج الحي من الميت ) . وكانت امرأة صالحة وكان أبوها كافرا . فالمراد على هذا القول موت قلب الكافر وحياة قلب المؤمن ; فالموت والحياة مستعاران . وذهب كثير من العلماء إلى أن الحياة والموت في الآية حقيقتان ; فقال عكرمة : هي إخراج الدجاجة وهي حية من البيضة وهي ميتة ، وإخراج البيضة وهي ميتة من الدجاجة وهي حية . وقال ابن مسعود : هي النطفة تخرج من الرجل وهي ميتة وهو حي ، ويخرج الرجل منها حيا وهي ميتة . وقال عكرمة والسدي : هي الحبة تخرج من السنبلة والسنبلة تخرج من الحبة ، والنواة من النخلة والنخلة تخرج من النواة ; والحياة في النخلة والسنبلة تشبيه .\nوترزق من تشاء بغير حساب أي بغير تضييق ولا تقتير ; كما تقول : فلان يعطي بغير حساب ; كأنه لا يحسب ما يعطي .\n                                    ",
        "saadi": "تُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۖ وَتُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَتُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّۖ وَتَرۡزُقُ مَن تَشَآءُ بِغَيۡرِ حِسَابٖ ٧٢\n                                        \n                                        \n                                        \n                                        { تولج الليل في النهار وتولج النهار في الليل } أي: تدخل هذا على هذا، وهذا على هذا، فينشأ عن ذلك من الفصول والضياء والنور والشمس والظل والسكون والانتشار، ما هو من أكبر الأدلة على قدرة الله وعظمته وحكمته ورحمته { وتخرج الحي من الميت } كالفرخ من البيضة، وكالشجر من النوى، وكالزرع من بذره، وكالمؤمن من الكافر { وتخرج الميت من الحي } كالبيضة من الطائر وكالنوى من الشجر، وكالحب من الزرع، وكالكافر من المؤمن، وهذا أعظم دليل على قدرة الله، وأن جميع الأشياء مسخرة مدبرة لا تملك من التدبير شيئا، فخلقه تعالى الأضداد، والضد من ضده بيان أنها مقهورة { وترزق من تشاء بغير حساب } أي: ترزق من تشاء رزقا واسعا من حيث لا يحتسب ولا يكتسب\n                                    "
      },
      "originalText": "تُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۖ وَتُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَتُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّۖ وَتَرۡزُقُ مَن تَشَآءُ بِغَيۡرِ حِسَابٖ ٧٢"
    },
    {
      "number": 321,
      "text": "لَا يَتَّخِذِ الْمُؤْمِنُونَ الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ ۖ وَمَنْ يَفْعَلْ ذَٰلِكَ فَلَيْسَ مِنَ اللَّهِ فِي شَيْءٍ إِلَّا أَنْ تَتَّقُوا مِنْهُمْ تُقَاةً ۗ وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ ۗ وَإِلَى اللَّهِ الْمَصِيرُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 28,
      "juz": 3,
      "manzil": 1,
      "page": 53,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّا يَتَّخِذِ ٱلۡمُؤۡمِنُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۖ وَمَن يَفۡعَلۡ ذَٰلِكَ فَلَيۡسَ مِنَ ٱللَّهِ فِي شَيۡءٍ إِلَّآ أَن تَتَّقُواْ مِنۡهُمۡ تُقَىٰةٗۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ ٨٢\n                                    \n                                    \n                                    نهى الله ، تبارك وتعالى ، عباده المؤمنين أن يوالوا الكافرين ، وأن يتخذوهم أولياء يسرون إليهم بالمودة من دون المؤمنين ، ثم توعد على ذلك فقال : ( ومن يفعل ذلك فليس من الله في شيء ) أي : من يرتكب نهي الله في هذا فقد برئ من الله كما قال : ( يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء من دون المؤمنين أتريدون أن تجعلوا لله عليكم سلطانا مبينا ) [ النساء : 144 ] وقال [ تعالى ] ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم [ إن الله لا يهدي القوم الظالمين ] ) [ المائدة : 51 ] .\n[ وقال تعالى ] ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة ) إلى أن قال : ( ومن يفعله منكم فقد ضل سواء السبيل ) [ الممتحنة : 1 ] وقال تعالى - بعد ذكر موالاة المؤمنين للمؤمنين من المهاجرين والأنصار والأعراب - : ( والذين كفروا بعضهم أولياء بعض إلا تفعلوه تكن فتنة في الأرض وفساد كبير ) [ الأنفال : 73 ] .\nوقوله : ( إلا أن تتقوا منهم تقاة ) أي : إلا من خاف في بعض البلدان أو الأوقات من شرهم ، فله أن يتقيهم بظاهره لا بباطنه ونيته ، كما حكاه البخاري عن أبي الدرداء أنه قال : \" إنا لنكشر في وجوه أقوام وقلوبنا تلعنهم \" .\nوقال الثوري : قال ابن عباس ، رضي الله عنهما : ليس التقية بالعمل إنما التقية باللسان ، وكذا رواه العوفي عن ابن عباس : إنما التقية باللسان ، وكذا قال أبو العالية ، وأبو الشعثاء والضحاك ، والربيع بن أنس . ويؤيد ما قالوه قول الله تعالى : ( من كفر بالله من بعد إيمانه إلا من أكره وقلبه مطمئن بالإيمان [ ولكن من شرح بالكفر صدرا فعليهم غضب من الله ولهم عذاب عظيم ] ) [ النحل : 106 ] .\nوقال البخاري : قال الحسن : التقية إلى يوم القيامة .\nثم قال تعالى : ( ويحذركم الله نفسه ) أي : يحذركم نقمته ، أي مخالفته وسطوته في عذابه لمن والى أعداءه وعادى أولياءه .\nثم قال تعالى : ( وإلى الله المصير ) أي : إليه المرجع والمنقلب ، فيجازي كل عامل بعمله .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا سويد بن سعيد ، حدثنا مسلم بن خالد ، عن ابن أبي حسين ، عن عبد الرحمن بن سابط ، عن عمرو بن ميمون [ بن مهران ] قال : قام فينا معاذ بن جبل فقال : يا بني أود ، إني رسول رسول الله إليكم ، تعلمون أن المعاد [ إلى الله ] إلى الجنة أو إلى النار .\n                                    ",
        "qortoby": "لَّا يَتَّخِذِ ٱلۡمُؤۡمِنُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۖ وَمَن يَفۡعَلۡ ذَٰلِكَ فَلَيۡسَ مِنَ ٱللَّهِ فِي شَيۡءٍ إِلَّآ أَن تَتَّقُواْ مِنۡهُمۡ تُقَىٰةٗۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ ٨٢\n                                    \n                                    \n                                    قوله تعالى : لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه وإلى الله المصير\nفيه مسألتان :\nالأولى : قال ابن عباس : نهى الله المؤمنين أن يلاطفوا الكفار فيتخذوهم أولياء ; ومثله لا تتخذوا بطانة من دونكم وهناك يأتي بيان هذا المعنى . ومعنى فليس من الله في شيء أي فليس من حزب الله ولا من أوليائه في شيء ; مثل واسأل القرية . وحكى سيبويه \" هو مني فرسخين \" أي من أصحابي ومعي . ثم استثنى وهي : الثانية : فقال : إلا أن تتقوا منهم تقاة قال معاذ بن جبل ومجاهد : كانت التقية في جدة الإسلام قبل قوة المسلمين ; فأما اليوم فقد أعز الله الإسلام أن يتقوا من عدوهم . قال ابن عباس : هو أن يتكلم بلسانه وقلبه مطمئن بالإيمان ، ولا يقتل ولا يأتي مأثما . وقال الحسن : التقية جائزة للإنسان إلى يوم القيامة ، ولا تقية في القتل . وقرأ جابر بن زيد ومجاهد والضحاك : \" إلا أن تتقوا منهم تقية \" وقيل : إن المؤمن إذا كان قائما بين الكفار فله أن يداريهم باللسان إذا كان خائفا على نفسه وقلبه مطمئن بالإيمان والتقية لا تحل إلا مع خوف القتل أو القطع أو الإيذاء العظيم . ومن أكره على الكفر فالصحيح أن له أن يتصلب ولا يجيب إلى التلفظ بكلمة الكفر ; بل يجوز له ذلك على ما يأتي بيانه في ( النحل ) إن شاء الله تعالى . وأمال حمزة والكسائي \" تقاة \" ، وفخم الباقون ; وأصل ( تقاة ) وقية على وزن فعلة ; مثل تؤدة وتهمة ، قلبت الواو تاء والياء ألفا . وروى الضحاك عن ابن عباس أن هذه الآية نزلت في عبادة بن الصامت الأنصاري وكان بدريا تقيا وكان له حلف من اليهود ; فلما خرج النبي - صلى الله عليه وسلم - يوم الأحزاب قال عبادة : يا نبي الله ، إن معي خمسمائة رجل من اليهود ، وقد رأيت أن يخرجوا معي فأستظهر بهم على العدو . فأنزل الله تعالى : لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين الآية . وقيل : إنها نزلت في عمار بن ياسر حين تكلم ببعض ما أراد منه المشركون ، على ما يأتي بيانه في ( النحل ) .\nقوله تعالى : ويحذركم الله نفسه قال الزجاج : أي : ويحذركم الله إياه . ثم استغنوا عن ذلك بذا وصار المستعمل ; قال تعالى : تعلم ما في نفسي ولا أعلم ما في نفسك فمعناه تعلم ما عندي وما في حقيقتي ولا أعلم ما عندك ولا ما في حقيقتك . وقال غيره : المعنى ويحذركم الله عقابه ; مثل واسأل القرية . وقال : تعلم ما في نفسي أي مغيبي ، فجعلت النفس في موضع الإضمار لأنه فيها يكون . وإلى الله المصير أي : وإلى جزاء الله المصير . وفيه إقرار بالبعث .\n                                    ",
        "saadi": "لَّا يَتَّخِذِ ٱلۡمُؤۡمِنُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۖ وَمَن يَفۡعَلۡ ذَٰلِكَ فَلَيۡسَ مِنَ ٱللَّهِ فِي شَيۡءٍ إِلَّآ أَن تَتَّقُواْ مِنۡهُمۡ تُقَىٰةٗۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ ٨٢\n                                        \n                                        \n                                        \n                                        وهذا نهي من الله تعالى للمؤمنين عن موالاة الكافرين بالمحبة والنصرة والاستعانة بهم على أمر من أمور المسلمين، وتوعد على ذلك فقال: { ومن يفعل ذلك فليس من الله في شيء } أي: فقد انقطع عن الله، وليس له في دين الله نصيب، لأن موالاة الكافرين لا تجتمع مع الإيمان، لأن الإيمان يأمر بموالاة الله وموالاة أوليائه المؤمنين المتعاونين على إقامة دين الله وجهاد أعدائه، قال تعالى: { والمؤمنون والمؤمنات بعضهم أولياء بعض } فمن والى - الكافرين من دون المؤمنين الذين يريدون أن يطفؤا نور الله ويفتنوا أولياءه خرج من حزب المؤمنين، وصار من حزب الكافرين، قال تعالى: { ومن يتولهم منكم فإنه منهم } وفي هذه الآية دليل على الابتعاد عن الكفار وعن معاشرتهم وصداقتهم، والميل إليهم والركون إليهم، وأنه لا يجوز أن يولى كافر ولاية من ولايات المسلمين، ولا يستعان به على الأمور التي هي مصالح لعموم المسلمين. قال الله تعالى: { إلا أن تتقوا منهم تقاة } أي: تخافوهم على أنفسكم فيحل لكم أن تفعلوا ما تعصمون به دماءكم من التقية باللسان وإظهار ما به تحصل التقية. ثم قال تعالى: { ويحذركم الله نفسه } أي: فلا تتعرضوا لسخطه بارتكاب معاصيه فيعاقبكم على ذلك { وإلى الله المصير } أي: مرجع العباد ليوم التناد، فيحصي أعمالهم ويحاسبهم عليها ويجازيهم، فإياكم أن تفعلوا من الأعمال القباح ما تستحقون به العقوبة، واعملوا ما به يحصل الأجر والمثوبة.\n                                    "
      },
      "originalText": "لَّا يَتَّخِذِ ٱلۡمُؤۡمِنُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۖ وَمَن يَفۡعَلۡ ذَٰلِكَ فَلَيۡسَ مِنَ ٱللَّهِ فِي شَيۡءٍ إِلَّآ أَن تَتَّقُواْ مِنۡهُمۡ تُقَىٰةٗۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ ٨٢"
    },
    {
      "number": 322,
      "text": "قُلْ إِنْ تُخْفُوا مَا فِي صُدُورِكُمْ أَوْ تُبْدُوهُ يَعْلَمْهُ اللَّهُ ۗ وَيَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 29,
      "juz": 3,
      "manzil": 1,
      "page": 53,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ إِن تُخۡفُواْ مَا فِي صُدُورِكُمۡ أَوۡ تُبۡدُوهُ يَعۡلَمۡهُ ٱللَّهُۗ وَيَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩٢\n                                    \n                                    \n                                    يخبر تبارك وتعالى عباده أنه يعلم السرائر والضمائر والظواهر ، وأنه لا يخفى عليه منهم خافية ، بل علمه محيط بهم في سائر الأحوال والآنات واللحظات وجميع الأوقات ، وبجميع ما في السماوات والأرض ، لا يغيب عنه مثقال ذرة ، ولا أصغر من ذلك في جميع أقطار الأرض والبحار والجبال ، وهو ( على كل شيء قدير ) أي : قدرته نافذة في جميع ذلك .\nوهذا تنبيه منه لعباده على خوفه وخشيته ، وألا يرتكبوا ما نهى عنه وما يبغضه منهم ، فإنه عالم بجميع أمورهم ، وهو قادر على معاجلتهم بالعقوبة ، وإن أنظر من أنظر منهم ، فإنه يمهل ثم يأخذ أخذ عزيز مقتدر ، ولهذا قال بعد هذا :\n                                    ",
        "qortoby": "قُلۡ إِن تُخۡفُواْ مَا فِي صُدُورِكُمۡ أَوۡ تُبۡدُوهُ يَعۡلَمۡهُ ٱللَّهُۗ وَيَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩٢\n                                    \n                                    \n                                    قوله تعالى : قل إن تخفوا ما في صدوركم أو تبدوه يعلمه الله ويعلم ما في السماوات وما في الأرض والله على كل شيء قدير\nفهو العالم بخفيات الصدور وما اشتملت عليه ، وبما في السماوات والأرض وما احتوت عليه ، علام الغيوب لا يعزب عنه مثقال ذرة ولا يغيب عنه شيء ، سبحانه لا إله إلا هو عالم الغيب والشهادة .\n                                    ",
        "saadi": "قُلۡ إِن تُخۡفُواْ مَا فِي صُدُورِكُمۡ أَوۡ تُبۡدُوهُ يَعۡلَمۡهُ ٱللَّهُۗ وَيَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩٢\n                                        \n                                        \n                                        \n                                        ثم أخبر عن سعة علمه لما في النفوس خصوصا، ولما في السماء والأرض عموما، وعن كمال قدرته، ففيه إرشاد إلى تطهير القلوب واستحضار علم الله كل وقت فيستحي العبد من ربه أن يرى قلبه محلا لكل فكر رديء، بل يشغل أفكاره فيما يقرب إلى الله من تدبر آية من كتاب، أو سنة من أحاديث رسول الله، أو تصور وبحث في علم ينفعه، أو تفكر في مخلوقات الله ونعمه، أو نصح لعباد الله، وفي ضمن أخبار الله عن علمه وقدرته الإخبار بما هو لازم ذلك من المجازاة على الأعمال، ومحل ذلك يوم القيامة، فهو الذي توفى به النفوس بأعمالها فلهذا قال { يوم تجد كل نفس ما عملت من خير محضرًا }\n                                    "
      },
      "originalText": "قُلۡ إِن تُخۡفُواْ مَا فِي صُدُورِكُمۡ أَوۡ تُبۡدُوهُ يَعۡلَمۡهُ ٱللَّهُۗ وَيَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٩٢"
    }
  ]
}