{
  "number": 54,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 323,
      "text": "يَوْمَ تَجِدُ كُلُّ نَفْسٍ مَا عَمِلَتْ مِنْ خَيْرٍ مُحْضَرًا وَمَا عَمِلَتْ مِنْ سُوءٍ تَوَدُّ لَوْ أَنَّ بَيْنَهَا وَبَيْنَهُ أَمَدًا بَعِيدًا ۗ وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ ۗ وَاللَّهُ رَءُوفٌ بِالْعِبَادِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 30,
      "juz": 3,
      "manzil": 1,
      "page": 54,
      "ruku": 44,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَوۡمَ تَجِدُ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ مِنۡ خَيۡرٖ مُّحۡضَرٗا وَمَا عَمِلَتۡ مِن سُوٓءٖ تَوَدُّ لَوۡ أَنَّ بَيۡنَهَا وَبَيۡنَهُۥٓ أَمَدَۢا بَعِيدٗاۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ ٠٣\n                                    \n                                    \n                                    ( يوم تجد كل نفس ما عملت من خير محضرا [ وما عملت من سوء تود لو أن بينها وبينه أمدا بعيدا ] ) الآية ، يعني : يوم القيامة يحضر للعبد جميع أعماله من خير وشر كما قال تعالى : ( ينبأ الإنسان يومئذ بما قدم وأخر ) [ القيامة : 13 ] فما رأى من أعماله حسنا سره ذلك وأفرحه ، وما رأى من قبيح ساءه وغاظه ، وود لو أنه تبرأ منه ، وأن يكون بينهما أمد بعيد ، كما يقول لشيطانه الذي كان مقترنا به في الدنيا ، وهو الذي جرأه على فعل السوء : ( يا ليت بيني وبينك بعد المشرقين فبئس القرين ) [ الزخرف : 38 ] .\nثم قال تعالى مؤكدا ومهددا ومتوعدا : ( ويحذركم الله نفسه ) أي : يخوفكم عقابه ، ثم قال مرجيا لعباده لئلا ييأسوا من رحمته ويقنطوا من لطفه : ( والله رءوف بالعباد )\nقال الحسن البصري : من رأفته بهم حذرهم نفسه . وقال غيره : أي رحيم بخلقه ، يحب لهم أن يستقيموا على صراطه المستقيم ودينه القويم ، وأن يتبعوا رسوله الكريم .\n                                    ",
        "qortoby": "يَوۡمَ تَجِدُ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ مِنۡ خَيۡرٖ مُّحۡضَرٗا وَمَا عَمِلَتۡ مِن سُوٓءٖ تَوَدُّ لَوۡ أَنَّ بَيۡنَهَا وَبَيۡنَهُۥٓ أَمَدَۢا بَعِيدٗاۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ ٠٣\n                                    \n                                    \n                                    قوله تعالى : يوم تجد كل نفس ما عملت من خير محضرا وما عملت من سوء تود لو أن بينها وبينه أمدا بعيدا ويحذركم الله نفسه والله رؤوف بالعباد\n( يوم ) منصوب متصل بقوله : ويحذركم الله نفسه . يوم تجد . وقيل : هو متصل بقوله : وإلى الله المصير . يوم تجد . وقيل : هو متصل بقوله : والله على كل شيء قدير . يوم تجد ويجوز أن يكون منقطعا على إضمار اذكر ; ومثله قوله : إن الله عزيز ذو انتقام يوم تبدل الأرض .\nو ( محضرا ) حال من الضمير المحذوف من صلة \" ما \" تقديره يوم تجد كل نفس ، ما عملته من خير محضرا . هذا على أن يكون تجد من وجدان الضالة . و ( ما ) من قوله وما عملت من سوء عطف على ( ما ) الأولى . و ( تود ) في موضع الحال من ( ما ) الثانية . وإن جعلت تجد بمعنى تعلم كان محضرا المفعول الثاني ، وكذلك تكون تود في موضع المفعول الثاني ; تقديره يوم تجد كل نفس جزاء ما عملت محضرا . ويجوز أن تكون \" ما \" الثانية رفعا بالابتداء ، و ( تود ) في موضع رفع على أنه خبر الابتداء ، ولا يصح أن تكون \" ما \" بمعنى الجزاء ; لأن تود مرفوع ، ولو كان ماضيا لجاز أن يكون جزاء ، وكان يكون معنى الكلام : وما عملت من سوء ودت لو أن بينها وبينه أمدا بعيدا ; أي كما بين المشرق والمغرب . ولا يكون المستقبل إذا جعلت ( ما ) للشرط إلا مجزوما ; إلا أن تحمله على تقدير حذف الفاء ، على تقدير : وما عملت من سوء فهي تود . أبو علي : هو قياس قول الفراء عندي ; لأنه قال في قوله تعالى : وإن أطعتموهم إنكم لمشركون : إنه على حذف الفاء . والأمد : الغاية ، وجمعه آماد . ويقال : استولى على الأمد ، أي غلب سابقا . قال النابغة :\nإلا لمثلك أو من أنت سابقه سبق الجواد إذا استولى على الأمد\nوالأمد : الغضب . يقال : أمد أمدا ، إذا غضب غضبا .\n                                    ",
        "saadi": "يَوۡمَ تَجِدُ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ مِنۡ خَيۡرٖ مُّحۡضَرٗا وَمَا عَمِلَتۡ مِن سُوٓءٖ تَوَدُّ لَوۡ أَنَّ بَيۡنَهَا وَبَيۡنَهُۥٓ أَمَدَۢا بَعِيدٗاۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ ٠٣\n                                        \n                                        \n                                        \n                                        { يوم تجد كل نفس ما عملت من خير محضرًا } أي: كاملا موفرا لم ينقص مثقال ذرة، كما قال تعالى: { فمن يعمل مثقال ذرة خيرًا يره } والخير: اسم جامع لكل ما يقرب إلى الله من الأعمال الصالحة صغيرها وكبيرها، كما أن السوء اسم جامع لكل ما يسخط الله من الأعمال السيئة صغيرها وكبيرها { وما عملت من سوء تود لو أن بينها وبينه أمدًا بعيدًا } أي: مسافة بعيدة، لعظم أسفها وشدة حزنها، فليحذر العبد من أعمال السوء التي لا بد أن يحزن عليها أشد الحزن، وليتركها وقت الإمكان قبل أن يقول { يا حسرتا على ما فرطت في جنب الله } { يومئذ يود الذين كفروا وعصوا الرسول لو تسوى بهم الأرض } { ويوم يعض الظالم على يديه يقول يا ليتني اتخذت مع الرسول سبيلا يا ويلتا ليتني لم أتخذ فلانًا خليلا } { حتى إذا جاءنا قال يا ليت بيني وبينك بعد المشرقين فبئس القرين } فوالله لترك كل شهوة ولذة وان عسر تركها على النفس في هذه الدار أيسر من معاناة تلك الشدائد واحتمال تلك الفضائح، ولكن العبد من ظلمه وجهله لا ينظر إلا الأمر الحاضر، فليس له عقل كامل يلحظ به عواقب الأمور فيقدم على ما ينفعه عاجلا وآجلا، ويحجم عن ما يضره عاجلا وآجلا، ثم أعاد تعالى تحذيرنا نفسه رأفة بنا ورحمة لئلا يطول علينا الأمد فتقسو قلوبنا، وليجمع لنا بين الترغيب الموجب للرجاء والعمل الصالح، والترهيب الموجب للخوف وترك الذنوب، فقال { ويحذركم الله نفسه والله رءوفٌ بالعباد } فنسأله أن يمن علينا بالحذر منه على الدوام، حتى لا نفعل ما يسخطه ويغضبه.\n                                    "
      },
      "originalText": "يَوۡمَ تَجِدُ كُلُّ نَفۡسٖ مَّا عَمِلَتۡ مِنۡ خَيۡرٖ مُّحۡضَرٗا وَمَا عَمِلَتۡ مِن سُوٓءٖ تَوَدُّ لَوۡ أَنَّ بَيۡنَهَا وَبَيۡنَهُۥٓ أَمَدَۢا بَعِيدٗاۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ ٠٣"
    },
    {
      "number": 324,
      "text": "قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 31,
      "juz": 3,
      "manzil": 1,
      "page": 54,
      "ruku": 45,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِي يُحۡبِبۡكُمُ ٱللَّهُ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ١٣\n                                    \n                                    \n                                    هذه الآية الكريمة حاكمة على كل من ادعى محبة الله ، وليس هو على الطريقة المحمدية فإنه كاذب في دعواه في نفس الأمر ، حتى يتبع الشرع المحمدي والدين النبوي في جميع أقواله وأحواله ، كما ثبت في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال : \" من عمل عملا ليس عليه أمرنا فهو رد \" ولهذا قال : ( قل إن كنتم تحبون الله فاتبعوني يحببكم الله ) أي : يحصل لكم فوق ما طلبتم من محبتكم إياه ، وهو محبته إياكم ، وهو أعظم من الأول ، كما قال بعض الحكماء العلماء : ليس الشأن أن تحب ، إنما الشأن أن تحب ، وقال الحسن البصري وغيره من السلف : زعم قوم أنهم يحبون الله فابتلاهم الله بهذه الآية ، فقال : ( قل إن كنتم تحبون الله فاتبعوني يحببكم الله ) .\nوقد قال ابن أبي حاتم : حدثنا أبي ، حدثنا علي بن محمد الطنافسي ، حدثنا عبيد الله بن موسى عن عبد الأعلى بن أعين ، عن يحيى بن أبي كثير ، عن عروة ، عن عائشة ، رضي الله عنها ، قالت : قال رسول الله صلى الله عليه وسلم : \" وهل الدين إلا الحب والبغض ؟ قال الله تعالى : ( قل إن كنتم تحبون الله فاتبعوني يحببكم الله ) قال أبو زرعة : عبد الأعلى هذا منكر الحديث .\nثم قال : ( ويغفر لكم ذنوبكم والله غفور رحيم ) أي : باتباعكم للرسول صلى الله عليه وسلم يحصل لكم هذا كله ببركة سفارته .\n                                    ",
        "qortoby": "قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِي يُحۡبِبۡكُمُ ٱللَّهُ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ١٣\n                                    \n                                    \n                                    قوله تعالى : قل إن كنتم تحبون الله فاتبعوني يحببكم الله ويغفر لكم ذنوبكم والله غفور رحيم .\nالحب : المحبة ، وكذلك الحب بالكسر . والحب أيضا الحبيب ; مثل الخدن والخدين ; يقال أحبه فهو محب ، وحبه يحبه ( بالكسر ) فهو محبوب . قال الجوهري : وهذا شاذ ; لأنه لا يأتي في المضاعف يفعل بالكسر . قال أبو الفتح : والأصل فيه حبب كظرف ، فأسكنت الباء وأدغمت في الثانية . قال ابن الدهان سعيد : في حب لغتان : حب وأحب ، وأصل \" حب \" في هذا البناء حبب كظرف ; يدل على ذلك قولهم : حببت ، وأكثر ما ورد فعيل من فعل . قال أبو الفتح : والدلالة على \" أحب \" قوله تعالى : يحبهم ويحبونه بضم الياء . و اتبعوني يحببكم الله و \" حب \" يرد على فعل لقولهم حبيب . وعلى فعل كقولهم محبوب : ولم يرد اسم الفاعل من حب المتعدي ، فلا يقال : أنا حاب . ولم يرد اسم المفعول من أفعل إلا قليلا ; كقوله :\nمني بمنزلة المحب المكرم\nوحكى أبو زيد : حببته أحبه . وأنشد :\nفوالله لولا تمره ما حببته ولا كان أدنى من عويف وهاشم\nوأنشد :\nلعمرك إنني وطلاب مصر لكالمزداد مما حب بعدا\nوحكى الأصمعي فتح حرف المضارعة مع الياء وحدها . والحب الخابية ، فارسي معرب ، والجمع حباب وحببة ; حكاه الجوهري . والآية نزلت في وفد نجران إذ زعموا أن ما ادعوه في عيسى حب لله عز وجل ; قاله محمد بن جعفر بن الزبير . وقال الحسن وابن جريج : نزلت في قوم من أهل الكتاب قالوا : نحن الذين نحب ربنا . وروي أن المسلمين قالوا : يا رسول الله ، والله إنا لنحب ربنا ; فأنزل الله عز وجل : قل إن كنتم تحبون الله فاتبعوني . قال ابن عرفة : المحبة عند العرب إرادة الشيء على قصد له . وقال الأزهري : محبة العبد لله ورسوله طاعته لهما واتباعه أمرهما ; قال الله تعالى : قل إن كنتم تحبون الله فاتبعوني . ومحبة الله للعباد إنعامه عليهم بالغفران ; قال الله تعالى : إن الله لا يحب الكافرين ; أي لا يغفر لهم . وقال سهل بن عبد الله : علامة حب الله حب القرآن ، وعلامة حب القرآن حب النبي - صلى الله عليه وسلم - وعلامة حب النبي - صلى الله عليه وسلم - حب السنة ; وعلامة حب الله وحب القرآن وحب النبي - صلى الله عليه وسلم - وحب السنة حب الآخرة ، وعلامة حب الآخرة أن يحب نفسه ، وعلامة حب نفسه أن يبغض الدنيا ، وعلامة بغض الدنيا ألا يأخذ منها إلا الزاد والبلغة . وروى أبو الدرداء عن رسول الله - صلى الله عليه وسلم - في قوله تعالى : قل إن كنتم تحبون الله فاتبعوني يحببكم الله قال : ( على البر والتقوى والتواضع وذلة النفس ) خرجه أبو عبد الله الترمذي . وروي عن النبي - صلى الله عليه وسلم - أنه قال : من أراد أن يحبه الله فعليه بصدق الحديث وأداء الأمانة وألا يؤذي جاره . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : إن الله إذا أحب عبدا دعا جبريل فقال إني أحب فلانا فأحبه قال فيحبه جبريل ثم ينادي في السماء فيقول إن الله يحب فلانا فأحبوه فيحبه أهل السماء - قال - ثم يوضع له القبول في الأرض ، وإذا أبغض عبدا دعا جبريل فيقول إني أبغض فلانا فأبغضه قال فيبغضه جبريل ثم ينادي في أهل السماء إن الله يبغض فلانا فأبغضوه - قال - فيبغضونه ثم توضع له البغضاء في الأرض . وسيأتي لهذا مزيد بيان في آخر سورة \" مريم \" إن شاء الله تعالى . وقرأ أبو رجاء العطاردي ( فاتبعوني ) بفتح الباء ، ( ويغفر لكم ) عطف على ( يحببكم ) . وروى محبوب عن أبي عمرو بن العلاء أنه أدغم الراء من ( يغفر ) في اللام من ( لكم ) . قال النحاس : لا يجيز الخليل وسيبويه إدغام الراء في اللام ، وأبو عمرو أجل من أن يغلط في مثل هذا ، ولعله كان يخفي الحركة كما يفعل في أشياء كثيرة .\n                                    ",
        "saadi": "قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِي يُحۡبِبۡكُمُ ٱللَّهُ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ١٣\n                                        \n                                        \n                                        \n                                        وهذه الآية فيها وجوب محبة الله، وعلاماتها، ونتيجتها، وثمراتها، فقال { قل إن كنتم تحبون الله } أي: ادعيتم هذه المرتبة العالية، والرتبة التي ليس فوقها رتبة فلا يكفي فيها مجرد الدعوى، بل لابد من الصدق فيها، وعلامة الصدق اتباع رسوله صلى الله عليه وسلم في جميع أحواله، في أقواله وأفعاله، في أصول الدين وفروعه، في الظاهر والباطن، فمن اتبع الرسول دل على صدق دعواه محبة الله تعالى، وأحبه الله وغفر له ذنبه، ورحمه وسدده في جميع حركاته وسكناته، ومن لم يتبع الرسول فليس محبا لله تعالى، لأن محبته لله توجب له اتباع رسوله، فما لم يوجد ذلك دل على عدمها وأنه كاذب إن ادعاها، مع أنها على تقدير وجودها غير نافعة بدون شرطها، وبهذه الآية يوزن جميع الخلق، فعلى حسب حظهم من اتباع الرسول يكون إيمانهم وحبهم لله، وما نقص من ذلك نقص.\n                                    "
      },
      "originalText": "قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِي يُحۡبِبۡكُمُ ٱللَّهُ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ١٣"
    },
    {
      "number": 325,
      "text": "قُلْ أَطِيعُوا اللَّهَ وَالرَّسُولَ ۖ فَإِنْ تَوَلَّوْا فَإِنَّ اللَّهَ لَا يُحِبُّ الْكَافِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 32,
      "juz": 3,
      "manzil": 1,
      "page": 54,
      "ruku": 45,
      "hizbQuarter": 21,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ أَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَۖ فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡكَٰفِرِينَ ٢٣\n                                    \n                                    \n                                    ثم قال آمرا لكل أحد من خاص وعام : ( قل أطيعوا الله والرسول فإن تولوا ) أي : خالفوا عن أمره ( فإن الله لا يحب الكافرين ) فدل على أن مخالفته في الطريقة كفر ، والله لا يحب من اتصف بذلك ، وإن ادعى وزعم في نفسه أنه يحب لله ويتقرب إليه ، حتى يتابع الرسول النبي الأمي خاتم الرسل ، ورسول الله إلى جميع الثقلين الجن والإنس الذي لو كان الأنبياء - بل المرسلون ، بل أولو العزم منهم - في زمانه لما وسعهم إلا اتباعه ، والدخول في طاعته ، واتباع شريعته ، كما سيأتي تقريره عند قوله : ( وإذ أخذ الله ميثاق النبيين ) الآية [ آل عمران : 31 ] [ إن شاء الله تعالى ] .\n                                    ",
        "qortoby": "قُلۡ أَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَۖ فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡكَٰفِرِينَ ٢٣\n                                    \n                                    \n                                    قوله تعالى : قل أطيعوا الله والرسول فإن تولوا فإن الله لا يحب الكافرين قوله تعالى : قل أطيعوا الله والرسول يأتي بيانه في \" النساء \" . فإن تولوا شرط ، إلا أنه ماض لا يعرب . والتقدير فإن تولوا على كفرهم وأعرضوا عن طاعة الله ورسوله . فإن الله لا يحب الكافرين أي لا يرضى فعلهم ولا يغفر لهم كما تقدم . وقال فإن الله ولم يقل \" فإنه \" لأن العرب إذا عظمت الشيء أعادت ذكره ; وأنشد سيبويه :\nلا أرى الموت يسبق الموت شيء نغص الموت ذا الغنى والفقيرا\n                                    ",
        "saadi": "قُلۡ أَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَۖ فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡكَٰفِرِينَ ٢٣\n                                        \n                                        \n                                        \n                                        وهذا أمر من الله تعالى لعباده بأعم الأوامر، وهو طاعته وطاعة رسوله التي يدخل بها الإيمان والتوحيد، وما هو من فروع ذلك من الأعمال والأقوال الظاهرة والباطنة، بل يدخل في طاعته وطاعة رسوله اجتناب ما نهى عنه، لأن اجتنابه امتثالا لأمر الله هو من طاعته، فمن أطاع الله ورسوله، فأولئك هم المفلحون { فإن تولوا } أي: أعرضوا عن طاعة الله ورسوله فليس ثم أمر يرجعون إليه إلا الكفر وطاعة كل شيطان مريد { كتب عليه أنه من تولاه فأنه يضله ويهديه إلى عذاب السعير } فلهذا قال: { فإن تولوا فإن الله لا يحب الكافرين } بل يبغضهم ويمقتهم ويعاقبهم أشد العقوبة، وكأن في هذه الآية الكريمة بيانا وتفسيرا لاتباع رسوله، وأن ذلك بطاعة الله وطاعة رسوله، هذا هو الاتباع الحقيقي، ثم قال تعالى:\n                                    "
      },
      "originalText": "قُلۡ أَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَۖ فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡكَٰفِرِينَ ٢٣"
    },
    {
      "number": 326,
      "text": "۞ إِنَّ اللَّهَ اصْطَفَىٰ آدَمَ وَنُوحًا وَآلَ إِبْرَاهِيمَ وَآلَ عِمْرَانَ عَلَى الْعَالَمِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 33,
      "juz": 3,
      "manzil": 1,
      "page": 54,
      "ruku": 45,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱللَّهَ ٱصۡطَفَىٰٓ ءَادَمَ وَنُوحٗا وَءَالَ إِبۡرَٰهِيمَ وَءَالَ عِمۡرَٰنَ عَلَى ٱلۡعَٰلَمِينَ ٣٣\n                                    \n                                    \n                                    يخبر تعالى أنه اختار هذه البيوت على سائر أهل الأرض ، فاصطفى آدم ، عليه السلام ، خلقه بيده ، ونفخ فيه من روحه ، وأسجد له ملائكته ، وعلمه أسماء كل شيء ، وأسكنه الجنة ثم أهبطه منها ، لما له في ذلك من الحكمة .\nواصطفى نوحا ، عليه السلام ، وجعله أول رسول [ بعثه ] إلى أهل الأرض ، لما عبد الناس الأوثان ، وأشركوا في دين الله ما لم ينزل به سلطانا ، وانتقم له لما طالت مدته بين ظهراني قومه ، يدعوهم إلى الله ليلا ونهارا ، سرا وجهارا ، فلم يزدهم ذلك إلا فرارا ، فدعا عليهم ، فأغرقهم الله عن آخرهم ، ولم ينج منهم إلا من اتبعه على دينه الذي بعثه الله به .\nواصطفى آل إبراهيم ، ومنهم : سيد البشر وخاتم الأنبياء على الإطلاق محمد صلى الله عليه وسلم ، وآل عمران ، والمراد بعمران هذا : هو والد مريم بنت عمران ، أم عيسى ابن مريم ، عليهم السلام .\n                                    ",
        "qortoby": "إِنَّ ٱللَّهَ ٱصۡطَفَىٰٓ ءَادَمَ وَنُوحٗا وَءَالَ إِبۡرَٰهِيمَ وَءَالَ عِمۡرَٰنَ عَلَى ٱلۡعَٰلَمِينَ ٣٣\n                                    \n                                    \n                                    قوله تعالى : إن الله اصطفى آدم ونوحا وآل إبراهيم وآل عمران على العالمين\nقوله تعالى : إن الله اصطفى آدم ونوحا اصطفى اختار ، وقد تقدم في البقرة . وتقدم فيها اشتقاق آدم وكنيته ، والتقدير إن الله اصطفى دينهم وهو دين الإسلام ; فحذف المضاف . وقال الزجاج : اختارهم للنبوة على عالمي زمانهم . ونوحا قيل إنه مشتق من ناح ينوح ، وهو اسم أعجمي إلا أنه انصرف لأنه على ثلاثة أحرف ، وهو شيخ المرسلين ، وأول رسول بعثه الله إلى أهل الأرض بعد آدم عليه السلام بتحريم البنات والأخوات والعمات والخالات وسائر القرابات ، ومن قال : إن إدريس كان قبله من المؤرخين فقد وهم على ما يأتي بيانه في \" الأعراف \" إن شاء الله تعالى .\nقوله تعالى : وآل إبراهيم وآل عمران على العالمين تقدم في البقرة معنى الآل وعلى ما يطلق مستوفى . وفي البخاري عن ابن عباس قال : آل إبراهيم وآل عمران المؤمنون من آل إبراهيم وآل عمران وآل ياسين وآل محمد ; يقول الله تعالى : إن أولى الناس بإبراهيم للذين اتبعوه وهذا النبي والذين آمنوا والله ولي المؤمنين وقيل : آل إبراهيم إسماعيل وإسحاق ويعقوب والأسباط ، وإن محمدا - صلى الله عليه وسلم - من آل إبراهيم . وقيل : آل إبراهيم نفسه ، وكذا آل عمران ; ومنه قوله تعالى : وبقية مما ترك آل موسى وآل هارون . وفي الحديث : لقد أعطي مزمارا من مزامير آل داود ; وقال الشاعر :\nولا تبك ميتا بعد ميت أحبه علي وعباس وآل أبي بكر\nوقال آخر :\nيلاقي من تذكر آل ليلى كما يلقى السليم من العداد\nأراد من تذكر ليلى نفسها . وقيل : آل عمران آل إبراهيم ; كما قال : ذرية بعضها من بعض . وقيل : المراد عيسى ، لأن أمه ابنة عمران . وقيل : نفسه كما ذكرنا . قال مقاتل : هو عمران أبو موسى وهارون ، وهو عمران بن يصهر بن فاهاث بن لاوى بن يعقوب . وقال الكلبي : هو عمران أبو مريم ، وهو من ولد سليمان عليه السلام . وحكى السهيلي : عمران بن ماتان ، وامرأته حنة ( بالنون ) . وخص هؤلاء بالذكر من بين الأنبياء لأن الأنبياء والرسل بقضهم وقضيضهم من نسلهم . ولم ينصرف عمران لأن في آخره ألفا ونونا زائدتين . ومعنى قوله : على العالمين أي على عالمي زمانهم ، في قول أهل التفسير . وقال الترمذي الحكيم أبو عبد الله محمد بن علي : جميع الخلق كلهم . وقيل على العالمين : على جميع الخلق كلهم إلى يوم الصور ، وذلك أن هؤلاء رسل وأنبياء فهم صفوة الخلق ; فأما محمد - صلى الله عليه وسلم - فقد جازت مرتبته الاصطفاء لأنه حبيب ورحمة . قال الله تعالى : وما أرسلناك إلا رحمة للعالمين فالرسل خلقوا للرحمة ، ومحمد - صلى الله عليه وسلم - خلق بنفسه رحمة ، فلذلك صار أمانا للخلق ، لما بعثه الله أمن الخلق العذاب إلى نفخة الصور . وسائر الأنبياء لم يحلوا هذا المحل ; ولذلك قال ، عليه السلام : أنا رحمة مهداة يخبر أنه بنفسه رحمة للخلق من الله . وقوله ( مهداة ) أي هدية من الله للخلق . ويقال : اختار آدم بخمسة أشياء : أولها أنه خلقه بيده في أحسن صورة بقدرته ، والثاني أنه علمه الأسماء كلها ، والثالث أمر الملائكة بأن يسجدوا له ، والرابع أسكنه الجنة ، والخامس جعله أبا البشر . واختار نوحا بخمسة أشياء : أولها أنه جعله أبا البشر ; لأن الناس كلهم غرقوا وصار ذريته هم الباقين ، والثاني أنه أطال عمره ; ويقال : طوبى لمن طال عمره وحسن عمله ، والثالث أنه استجاب دعاءه على الكافرين والمؤمنين ، والرابع أنه حمله على السفينة ، والخامس أنه كان أول من نسخ الشرائع ; وكان قبل ذلك لم يحرم تزويج الخالات والعمات . واختار إبراهيم بخمسة أشياء : أولها أنه جعله أبا الأنبياء ; لأنه روي أنه خرج من صلبه ألف نبي من زمانه إلى زمن النبي - صلى الله عليه وسلم - والثاني أنه اتخذه خليلا ، والثالث أنه أنجاه من النار ، والرابع أنه جعله إماما للناس ، والخامس أنه ابتلاه بالكلمات فوفقه حتى أتمهن . ثم قال : ( وآل عمران ) فإن كان عمران أبا موسى وهارون فإنما اختارهما على العالمين حيث بعث على قومه المن والسلوى وذلك لم يكن لأحد من الأنبياء في العالم . وإن كان أبا مريم فإنه اصطفى له مريم بولادة عيسى بغير أب ولم يكن ذلك لأحد في العالم ، والله أعلم .\n                                    ",
        "saadi": "إِنَّ ٱللَّهَ ٱصۡطَفَىٰٓ ءَادَمَ وَنُوحٗا وَءَالَ إِبۡرَٰهِيمَ وَءَالَ عِمۡرَٰنَ عَلَى ٱلۡعَٰلَمِينَ ٣٣\n                                        \n                                        \n                                        \n                                        يخبر تعالى باختيار من اختاره من أوليائه وأصفيائه وأحبابه، فأخبر أنه اصطفى آدم، أي: اختاره على سائر المخلوقات، فخلقه بيده ونفخ فيه من روحه، وأمر الملائكة بالسجود له، وأسكنه جنته، وأعطاه من العلم والحلم والفضل ما فاق به سائر المخلوقات، ولهذا فضل بنيه، فقال تعالى: { ولقد كرمنا بني آدم وحملناهم في البر والبحر ورزقناهم من الطيبات وفضلناهم على كثير ممن خلقنا تفضيلا } واصطفى نوحا فجعله أول رسول إلى أهل الأرض حين عبدت الأوثان، ووفقه من الصبر والاحتمال والشكر والدعوة إلى الله في جميع الأوقات ما أوجب اصطفاءه واجتباءه، وأغرق الله أهل الأرض بدعوته، ونجاه ومن معه في الفلك المشحون، وجعل ذريته هم الباقين، وترك عليه ثناء يذكر في جميع الأحيان والأزمان. واصطفى آل إبراهيم وهو إبراهيم خليل الرحمن الذي اختصه الله بخلته، وبذل نفسه للنيران وولده للقربان وماله للضيفان، ودعا إلى ربه ليلا ونهارا وسرا وجهارا، وجعله الله أسوة يقتدي به من بعده، وجعل في ذريته النبوة والكتاب، ويدخل في آل إبراهيم جميع الأنبياء الذين بعثوا من بعده لأنهم من ذريته، وقد خصهم بأنواع الفضائل ما كانوا به صفوة على العالمين، ومنهم سيد ولد آدم نبينا محمد صلى الله عليه وسلم فإن الله تعالى جمع فيه من الكمال ما تفرق في غيره، وفاق صلى الله عليه وسلم الأولين والآخرين، فكان سيد المرسلين المصطفى من ولد إبراهيم. واصطفى الله آل عمران وهو والد مريم بنت عمران، أو والد موسى بن عمران عليه السلام، فهذه البيوت التي ذكرها الله هي صفوته من العالمين، وتسلسل الصلاح والتوفيق بذرياتهم.\n                                    "
      },
      "originalText": "۞ إِنَّ ٱللَّهَ ٱصۡطَفَىٰٓ ءَادَمَ وَنُوحٗا وَءَالَ إِبۡرَٰهِيمَ وَءَالَ عِمۡرَٰنَ عَلَى ٱلۡعَٰلَمِينَ ٣٣"
    },
    {
      "number": 327,
      "text": "ذُرِّيَّةً بَعْضُهَا مِنْ بَعْضٍ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 34,
      "juz": 3,
      "manzil": 1,
      "page": 54,
      "ruku": 45,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذُرِّيَّةَۢ بَعۡضُهَا مِنۢ بَعۡضٖۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٤٣\n                                    \n                                    \n                                    قال محمد بن إسحاق بن يسار رحمه الله : هو عمران بن ياشم بن أمون بن ميشا بن حزقيا بن أحزيق بن يوثم بن عزاريا بن أمصيا بن ياوش بن أجريهو بن يازم بن يهفاشاط بن إنشا بن أبيان بن رخيعم بن سليمان بن داود ، عليهما السلام . فعيسى ، عليه السلام ، من ذرية إبراهيم ، كما سيأتي بيانه في سورة الأنعام ، إن شاء الله وبه الثقة .\n                                    ",
        "qortoby": "ذُرِّيَّةَۢ بَعۡضُهَا مِنۢ بَعۡضٖۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٤٣\n                                    \n                                    \n                                    قوله تعالى : ذرية بعضها من بعض والله سميع عليم تقدم في البقرة معنى الذرية واشتقاقها . وهي نصب على الحال ; قاله الأخفش . أي في حال كون بعضهم من بعض ، أي ذرية بعضها من ولد بعض . الكوفيون : على القطع . الزجاج : بدل ، أي اصطفى ذرية بعضها من بعض ، ومعنى بعضها من بعض ، يعني في التناصر في الدين ; كما قال : المنافقون والمنافقات بعضهم من بعض يعني في الضلالة ; قاله الحسن وقتادة . وقيل : في الاجتباء والاصطفاء والنبوة . وقيل : المراد به التناسل ، وهذا أضعفها .\n                                    ",
        "saadi": "ذُرِّيَّةَۢ بَعۡضُهَا مِنۢ بَعۡضٖۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٤٣\n                                        \n                                        \n                                        \n                                        { ذرية بعضها من بعض } أي: حصل التناسب والتشابه بينهم في الخلق والأخلاق الجميلة، كما قال تعالى لما ذكر جملة من الأنبياء الداخلين في ضمن هذه البيوت الكبار { ومن آبائهم وإخوانهم وذرياتهم واجتبيناهم وهديناهم إلى صراط مستقيم } { والله سميع عليم } يعلم من يستحق الاصطفاء فيصطفيه ومن لا يستحق ذلك فيخذله ويرديه، ودل هذا على أن هؤلاء اختارهم لما علم من أحوالهم الموجبة لذلك فضلا منه وكرما، ومن الفائدة والحكمة في قصه علينا أخبار هؤلاء الأصفياء أن نحبهم ونقتدي بهم، ونسأل الله أن يوفقنا لما وفقهم، وأن لا نزال نزري أنفسنا بتأخرنا عنهم وعدم اتصافنا بأوصافهم ومزاياهم الجميلة، وهذا أيضا من لطفه بهم، وإظهاره الثناء عليهم في الأولين والآخرين، والتنويه بشرفهم، فلله ما أعظم جوده وكرمه وأكثر فوائد معاملته، لو لم يكن لهم من الشرف إلا أن أذكارهم مخلدة ومناقبهم مؤبدة لكفى بذلك فضلا\n                                    "
      },
      "originalText": "ذُرِّيَّةَۢ بَعۡضُهَا مِنۢ بَعۡضٖۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ ٤٣"
    },
    {
      "number": 328,
      "text": "إِذْ قَالَتِ امْرَأَتُ عِمْرَانَ رَبِّ إِنِّي نَذَرْتُ لَكَ مَا فِي بَطْنِي مُحَرَّرًا فَتَقَبَّلْ مِنِّي ۖ إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 35,
      "juz": 3,
      "manzil": 1,
      "page": 54,
      "ruku": 45,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ قَالَتِ ٱمۡرَأَتُ عِمۡرَٰنَ رَبِّ إِنِّي نَذَرۡتُ لَكَ مَا فِي بَطۡنِي مُحَرَّرٗا فَتَقَبَّلۡ مِنِّيٓۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٥٣\n                                    \n                                    \n                                    امرأة عمران هذه أم مريم [ بنت عمران ] عليها السلام وهي حنة بنت فاقوذ ، قال محمد بن إسحاق : وكانت امرأة لا تحمل ، فرأت يوما طائرا يزق فرخه ، فاشتهت الولد ، فدعت الله ، عز وجل ، أن يهبها ولدا ، فاستجاب الله دعاءها ، فواقعها زوجها ، فحملت منه ، فلما تحققت الحمل نذرته أن يكون ( محررا ) أي : خالصا مفرغا للعبادة ، ولخدمة بيت المقدس ، فقالت : ( رب إني نذرت لك ما في بطني محررا فتقبل مني إنك أنت السميع العليم ) أي : السميع لدعائي ، العليم بنيتي ، ولم تكن تعلم ما في بطنها أذكرا أم أنثى ؟\n                                    ",
        "qortoby": "إِذۡ قَالَتِ ٱمۡرَأَتُ عِمۡرَٰنَ رَبِّ إِنِّي نَذَرۡتُ لَكَ مَا فِي بَطۡنِي مُحَرَّرٗا فَتَقَبَّلۡ مِنِّيٓۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٥٣\n                                    \n                                    \n                                    قوله تعالى : إذ قالت امرأة عمران رب إني نذرت لك ما في بطني محررا فتقبل مني إنك أنت السميع العليم\nفيه مسائل :\nالأولى : قوله تعالى : إذ قالت امرأة عمران قال أبو عبيدة : ( إذ ) زائدة . وقال محمد بن يزيد : التقدير : اذكر إذ . وقال الزجاج : المعنى واصطفى آل عمران إذ قالت امرأة عمران . وهي حنة ( بالحاء المهملة والنون ) بنت فاقود بن قنبل أم مريم جدة عيسى عليه السلام ، وليس باسم عربي ولا يعرف في العربية حنة اسم امرأة . وفي العربية أبو حنة البدري ، ويقال فيه : أبو حبة ( بالباء بواحدة ) وهو أصح ، واسمه عامر ، ودير حنة بالشام ، ودير آخر أيضا يقال له كذلك ; قال أبو نواس :\nيا دير حنة من ذات الأكيراح من يصح عنك فإني لست بالصاحي\nوحبة في العرب كثير ، منهم أبو حبة الأنصاري ، وأبو السنابل بن بعكك المذكور في حديث سبيعة حبة ، ولا يعرف خنة بالخاء المعجمة إلا بنت يحيى بن أكثم القاضي ، وهي أم محمد بن نصر ، ولا يعرف جنة ( بالجيم ) إلا أبو جنة ، وهو خال ذي الرمة الشاعر . كل هذا من كتاب ابن ماكولا .\nالثانية : قوله تعالى : رب إني نذرت لك ما في بطني محررا تقدم معنى النذر ، وأنه لا يلزم العبد إلا بأن يلزمه نفسه . ويقال : إنها لما حملت قالت : لئن نجاني الله ووضعت ما في بطني لجعلته محررا . ومعنى لك أي لعبادتك . محررا نصب على الحال ، وقيل : نعت لمفعول محذوف ، أي إني نذرت لك ما في بطني غلاما محررا ، والأول أولى من جهة التفسير وسياق الكلام والإعراب : أما الإعراب فإن إقامة النعت مقام المنعوت لا يجوز في مواضع ، ويجوز على المجاز في أخرى ، وأما التفسير فقيل إن سبب قول امرأة عمران هذا أنها كانت كبيرة لا تلد ، وكانوا أهل بيت من الله بمكان ، وإنها كانت تحت شجرة فبصرت بطائر يزق فرخا فتحركت نفسها لذلك ، ودعت ربها أن يهب لها ولدا ، ونذرت إن ولدت أن تجعل ولدها محررا : أي عتيقا خالصا لله تعالى ، خادما للكنيسة حبيسا عليها ، مفرغا لعبادة الله تعالى . وكان ذلك جائزا في شريعتهم ، وكان على أولادهم أن يطيعوهم . فلما وضعت مريم قالت : رب إني وضعتها أنثى يعني أن الأنثى لا تصلح لخدمة الكنيسة . قيل لما يصيبها من الحيض والأذى . وقيل : لا تصلح لمخالطة الرجال . وكانت ترجو أن يكون ذكرا فلذلك حررت .\nالثالثة : قال ابن العربي : لا خلاف أن امرأة عمران لا يتطرق إلى حملها نذر لكونها حرة ، فلو كانت امرأته أمة فلا خلاف أن المرء لا يصح له نذر في ولده وكيفما تصرفت حاله ; فإنه إن كان الناذر عبدا فلم يتقرر له قول في ذلك ; وإن كان حرا فلا يصح أن يكون مملوكا له ، وكذلك المرأة مثله ; فأي وجه للنذر فيه ؟ وإنما معناه - والله أعلم - أن المرء إنما يريد ولده للأنس به والاستنصار والتسلي ، فطلبت هذه المرأة الولد أنسا به وسكونا إليه ; فلما من الله تعالى عليها به نذرت أن حظها من الأنس به متروك فيه ، وهو على خدمة الله تعالى موقوف ، وهذا نذر الأحرار من الأبرار . وأرادت به محررا من جهتي ، محررا من رق الدنيا وأشغالها ; وقد قال رجل من الصوفية لأمه : يا أمه : ذريني لله أتعبد له وأتعلم العلم ، فقالت : نعم . فسار حتى تبصر ثم عاد إليها فدق الباب ، فقالت من ؟ فقال لها : ابنك فلان ، قالت : قد تركناك لله ولا نعود فيك .\nالرابعة : قوله تعالى : محررا مأخوذ من الحرية التي هي ضد العبودية ; من هذا تحرير الكتاب ، وهو تخليصه من الاضطراب والفساد . وروى خصيف عن عكرمة ومجاهد : أن المحرر الخالص لله عز وجل لا يشوبه شيء من أمر الدنيا . وهذا معروف في اللغة أن يقال لكل ما خلص : حر ، ومحرر بمعناه ; قال ذو الرمة :\nوالقرط في حرة الذفرى معلقه تباعد الحبل منه فهو يضطرب\nوطين حر لا رمل فيه ، وباتت فلانة بليلة حرة إذا لم يصل إليها زوجها أول ليلة ; فإن تمكن منها فهي بليلة شيباء .\n.\n                                    ",
        "saadi": "إِذۡ قَالَتِ ٱمۡرَأَتُ عِمۡرَٰنَ رَبِّ إِنِّي نَذَرۡتُ لَكَ مَا فِي بَطۡنِي مُحَرَّرٗا فَتَقَبَّلۡ مِنِّيٓۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٥٣\n                                        \n                                        \n                                        \n                                        ولما ذكر فضائل هذه البيوت الكريمة ذكر ما جرى لمريم والدة عيسى وكيف لطف الله بها في تربيتها ونشأتها، فقال: { إذ قالت امرأة عمران } أي: والدة مريم لما حملت { رب إني نذرت لك ما في بطني محررًا } أي: جعلت ما في بطني خالصا لوجهك، محررا لخدمتك وخدمة بيتك { فتقبل مني } هذا العمل المبارك { إنك أنت السميع العليم } تسمع دعائي وتعلم نيتي وقصدي، هذا وهي في البطن قبل وضعها\n                                    "
      },
      "originalText": "إِذۡ قَالَتِ ٱمۡرَأَتُ عِمۡرَٰنَ رَبِّ إِنِّي نَذَرۡتُ لَكَ مَا فِي بَطۡنِي مُحَرَّرٗا فَتَقَبَّلۡ مِنِّيٓۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ٥٣"
    },
    {
      "number": 329,
      "text": "فَلَمَّا وَضَعَتْهَا قَالَتْ رَبِّ إِنِّي وَضَعْتُهَا أُنْثَىٰ وَاللَّهُ أَعْلَمُ بِمَا وَضَعَتْ وَلَيْسَ الذَّكَرُ كَالْأُنْثَىٰ ۖ وَإِنِّي سَمَّيْتُهَا مَرْيَمَ وَإِنِّي أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 36,
      "juz": 3,
      "manzil": 1,
      "page": 54,
      "ruku": 45,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَلَمَّا وَضَعَتۡهَا قَالَتۡ رَبِّ إِنِّي وَضَعۡتُهَآ أُنثَىٰ وَٱللَّهُ أَعۡلَمُ بِمَا وَضَعَتۡ وَلَيۡسَ ٱلذَّكَرُ كَٱلۡأُنثَىٰۖ وَإِنِّي سَمَّيۡتُهَا مَرۡيَمَ وَإِنِّيٓ أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ٦٣\n                                    \n                                    \n                                    ( فلما وضعتها قالت رب إني وضعتها أنثى والله أعلم بما وضعت ) قرئ برفع التاء على أنها تاء المتكلم ، وأن ذلك من تمام قولها ، وقرئ بتسكين التاء على أنه من قول الله عز وجل ( وليس الذكر كالأنثى ) أي : في القوة والجلد في العبادة وخدمة المسجد الأقصى ( وإني سميتها مريم ) فيه دلالة على جواز التسمية يوم الولادة كما هو الظاهر من السياق ، لأنه شرع من قبلنا ، وقد حكي مقررا ، وبذلك ثبتت السنة عن رسول الله صلى الله عليه وسلم حيث قال : \" ولد لي الليلة ولد سميته باسم أبي إبراهيم \" . أخرجاه وكذلك ثبت فيهما أن أنس بن مالك ذهب بأخيه ، حين ولدته أمه ، إلى رسول الله صلى الله عليه وسلم ، فحنكه وسماه عبد الله وفي صحيح البخاري : أن رجلا قال : يا رسول الله ، ولد لي ولد ، فما أسميه ؟ قال : \" اسم ولدك عبد الرحمن \" وثبت في الصحيح أيضا : أنه لما جاءه أبو أسيد بابنه ليحنكه ، فذهل عنه ، فأمر به أبوه فرده إلى منزلهم ، فلما ذكر رسول الله صلى الله عليه وسلم في المجلس سماه المنذر .\nفأما حديث قتادة ، عن الحسن البصري ، عن سمرة بن جندب ، أن رسول الله صلى الله عليه وسلم قال : \" كل غلام رهين بعقيقته ، يذبح عنه يوم سابعه ، ويسمى ويحلق رأسه \" فقد رواه أحمد وأهل السنن ، وصححه الترمذي بهذا اللفظ ، ويروي : \" ويدمى \" ، وهو أثبت وأحفظ والله أعلم . وكذا ما رواه الزبير بن بكار في كتاب النسب : أن رسول الله صلى الله عليه وسلم عق عن ولده إبراهيم يوم سابعه وسماه إبراهيم . فإسناده لا يثبت ، وهو مخالف لما في الصحيح ولو صح لحمل على أنه أشهر اسمه بذلك يومئذ ، والله أعلم .\nوقوله إخبارا عن أم مريم أنها قالت : ( وإني أعيذها بك وذريتها من الشيطان الرجيم ) أي : عوذتها بالله ، عز وجل ، من شر الشيطان ، وعوذت ذريتها ، وهو ولدها عيسى ، عليه السلام . فاستجاب الله لها ذلك كما قال عبد الرزاق : أنبأنا معمر ، عن الزهري ، عن ابن المسيب ، عن أبي هريرة ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" ما من مولود يولد إلا مسه الشيطان حين يولد ، فيستهل صارخا من مسه إياه ، إلا مريم وابنها \" . ثم يقول أبو هريرة : اقرأوا إن شئتم : ( وإني أعيذها بك وذريتها من الشيطان الرجيم ) أخرجاه من حديث عبد الرزاق . ورواه ابن جرير ، عن أحمد بن الفرج ، عن بقية ، [ عن الزبيدي ] عن الزهري ، عن أبي سلمة ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم ، بنحوه . وروى من حديث قيس ، عن الأعمش ، عن أبي صالح ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" ما من مولود إلا وقد عصره الشيطان عصرة أو عصرتين إلا عيسى ابن مريم ومريم \" . ثم قرأ رسول الله صلى الله عليه وسلم : ( وإني أعيذها بك وذريتها من الشيطان الرجيم ) .\nومن حديث العلاء عن أبيه عن أبي هريرة . ورواه مسلم ، عن أبي الطاهر ، عن ابن وهب ، عن عمرو بن الحارث ، عن أبي يونس ، عن أبي هريرة . ورواه وهب أيضا ، عن ابن أبي ذئب ، عن عجلان مولى المشمعل ، عن أبي هريرة . ورواه محمد بن إسحاق ، عن يزيد بن عبد الله بن قسيط ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم بأصل الحديث . وهكذا رواه الليث بن سعد ، عن جعفر بن ربيعة ، عن عبد الرحمن بن هرمز ، الأعرج قال : قال أبو هريرة : قال رسول الله صلى الله عليه وسلم : \" كل بني آدم يطعن الشيطان في جنبه حين تلده أمه ، إلا عيسى ابن مريم ، ذهب يطعن فطعن في الحجاب \" .\n                                    ",
        "qortoby": "فَلَمَّا وَضَعَتۡهَا قَالَتۡ رَبِّ إِنِّي وَضَعۡتُهَآ أُنثَىٰ وَٱللَّهُ أَعۡلَمُ بِمَا وَضَعَتۡ وَلَيۡسَ ٱلذَّكَرُ كَٱلۡأُنثَىٰۖ وَإِنِّي سَمَّيۡتُهَا مَرۡيَمَ وَإِنِّيٓ أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ٦٣\n                                    \n                                    \n                                    قوله تعالى : فلما وضعتها قالت رب إني وضعتها أنثى قال ابن عباس : إنما قالت هذا لأنه لم يكن يقبل في النذر إلا الذكور ، فقبل الله مريم . و أنثى حال ، وإن شئت بدل . فقيل : إنها ربتها حتى ترعرعت وحينئذ أرسلتها ; رواه أشهب عن مالك : وقيل : لفتها في خرقتها وأرسلت بها إلى المسجد ، فوفت بنذرها وتبرأت منها . ولعل الحجاب لم يكن عندهم كما كان في صدر الإسلام ; ففي البخاري ومسلم أن امرأة سوداء كانت تقم المسجد على عهد رسول الله - صلى الله عليه وسلم - فماتت . الحديث .\nقوله تعالى : والله أعلم بما وضعت هو على قراءة من قرأ \" وضعت \" بضم التاء من جملة كلامها ; فالكلام متصل . وهي قراءة أبي بكر وابن عامر ، وفيها معنى التسليم لله والخضوع والتنزيه له أن يخفى عليه شيء ، ولم تقله على طريق الإخبار لأن علم الله في كل شيء قد تقرر في نفس المؤمن ، وإنما قالته على طريق التعظيم والتنزيه لله تعالى . وعلى قراءة الجمهور هو من كلام الله عز وجل قدم ، وتقديره أن يكون مؤخرا بعد وإني أعيذها بك وذريتها من الشيطان الرجيم والله أعلم بما وضعت ; قال المهدوي . وقال مكي : هو إعلام من الله تعالى لنا على طريق التثبيت فقال : والله أعلم بما وضعت أم مريم قالته أو لم تقله . ويقوي ذلك أنه لو كان من كلام أم مريم لكان وجه الكلام : وأنت أعلم بما وضعت ; لأنها نادته في أول الكلام في قولها : رب إني وضعتها أنثى . وروي عن ابن عباس ( بما وضعت ) بكسر التاء ، أي قيل لها هذا .\nقوله تعالى : وليس الذكر كالأنثى استدل به بعض الشافعية على أن المطاوعة في نهار رمضان لزوجها على الوطء لا تساويه في وجوب الكفارة عليها ، ابن العربي ، وهذه منه غفلة ، فإن هذا خبر عن شرع من قبلنا وهم لا يقولون به ، وهذه الصالحة إنما قصدت بكلامها ما تشهد له به بينة حالها ومقطع كلامها ، فإنها نذرت خدمة المسجد في ولدها ، فلما رأته أنثى لا تصلح وأنها عورة اعتذرت إلى ربها من وجودها لها على خلاف ما قصدته فيها . ولم ينصرف ( مريم ) لأنه مؤنث معرفة ، وهو أيضا أعجمي ; قاله النحاس . والله تعالى أعلم .\nقوله تعالى : وإني سميتها مريم يعني خادم الرب في لغتهم . وإني أعيذها بك يعني مريم . وذريتها يعني عيسى . وهذا يدل على أن الذرية قد تقع على الولد خاصة . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : ما من مولود يولد إلا نخسه الشيطان فيستهل صارخا من نخسة الشيطان إلا ابن مريم وأمه ثم قال أبو هريرة : اقرءوا إن شئتم : وإني أعيذها بك وذريتها من الشيطان الرجيم . قال علماؤنا : فأفاد هذا الحديث أن الله تعالى استجاب دعاء أم مريم ، فإن الشيطان ينخس جميع ولد آدم حتى الأنبياء والأولياء إلا مريم وابنها . قال قتادة : كل مولود يطعن الشيطان في جنبه حين يولد غير عيسى وأمه جعل بينهما حجاب فأصابت الطعنة الحجاب ولم ينفذ لهما منه شيء ، قال علماؤنا : وإن لم يكن كذلك بطلت الخصوصية بهما ، ولا يلزم من هذا أن نخس الشيطان يلزم منه إضلال الممسوس وإغواؤه فإن ذلك ظن فاسد ; فكم تعرض الشيطان للأنبياء والأولياء بأنواع الإفساد والإغواء ومع ذلك فعصمهم الله مما يرومه الشيطان ، كما قال تعالى : إن عبادي ليس لك عليهم سلطان . هذا مع أن كل واحد من بني آدم قد وكل به قرينه من الشياطين ; كما قال رسول الله - صلى الله عليه وسلم - فمريم وابنها وإن عصما من نخسه فلم يعصما من ملازمته لهما ومقارنته ، والله أعلم\n                                    ",
        "saadi": "فَلَمَّا وَضَعَتۡهَا قَالَتۡ رَبِّ إِنِّي وَضَعۡتُهَآ أُنثَىٰ وَٱللَّهُ أَعۡلَمُ بِمَا وَضَعَتۡ وَلَيۡسَ ٱلذَّكَرُ كَٱلۡأُنثَىٰۖ وَإِنِّي سَمَّيۡتُهَا مَرۡيَمَ وَإِنِّيٓ أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ٦٣\n                                        \n                                        \n                                        \n                                        { فلما وضعتها قالت رب إني وضعتها أنثى } كأنها تشوفت أن يكون ذكرا ليكون أقدر على الخدمة وأعظم موقعا، ففي كلامها [نوع] عذر من ربها، فقال الله: { والله أعلم بما وضعت } أي: لا يحتاج إلى إعلامها، بل علمه متعلق بها قبل أن تعلم أمها ما هي { وليس الذكر كالأنثى وإني سميتها مريم } فيه دلالة على تفضيل الذكر على الأنثى، وعلى التسمية وقت الولادة، وعلى أن للأم تسمية الولد إذا لم يكره الأب { وإني أعيذها بك وذريتها من الشيطان الرجيم } دعت لها ولذريتها أن يعيذهم الله من الشيطان الرجيم.\n                                    "
      },
      "originalText": "فَلَمَّا وَضَعَتۡهَا قَالَتۡ رَبِّ إِنِّي وَضَعۡتُهَآ أُنثَىٰ وَٱللَّهُ أَعۡلَمُ بِمَا وَضَعَتۡ وَلَيۡسَ ٱلذَّكَرُ كَٱلۡأُنثَىٰۖ وَإِنِّي سَمَّيۡتُهَا مَرۡيَمَ وَإِنِّيٓ أُعِيذُهَا بِكَ وَذُرِّيَّتَهَا مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ ٦٣"
    },
    {
      "number": 330,
      "text": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٍ وَأَنْبَتَهَا نَبَاتًا حَسَنًا وَكَفَّلَهَا زَكَرِيَّا ۖ كُلَّمَا دَخَلَ عَلَيْهَا زَكَرِيَّا الْمِحْرَابَ وَجَدَ عِنْدَهَا رِزْقًا ۖ قَالَ يَا مَرْيَمُ أَنَّىٰ لَكِ هَٰذَا ۖ قَالَتْ هُوَ مِنْ عِنْدِ اللَّهِ ۖ إِنَّ اللَّهَ يَرْزُقُ مَنْ يَشَاءُ بِغَيْرِ حِسَابٍ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 37,
      "juz": 3,
      "manzil": 1,
      "page": 54,
      "ruku": 45,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٖ وَأَنۢبَتَهَا نَبَاتًا حَسَنٗا وَكَفَّلَهَا زَكَرِيَّاۖ كُلَّمَا دَخَلَ عَلَيۡهَا زَكَرِيَّا ٱلۡمِحۡرَابَ وَجَدَ عِندَهَا رِزۡقٗاۖ قَالَ يَٰمَرۡيَمُ أَنَّىٰ لَكِ هَٰذَاۖ قَالَتۡ هُوَ مِنۡ عِندِ ٱللَّهِۖ إِنَّ ٱللَّهَ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٍ ٧٣\n                                    \n                                    \n                                    يخبر ربنا أنه تقبلها من أمها نذيرة ، وأنه ( أنبتها نباتا حسنا ) أي : جعلها شكلا مليحا ومنظرا بهيجا ، ويسر لها أسباب القبول ، وقرنها بالصالحين من عباده تتعلم منهم الخير والعلم والدين . ولهذا قال : ( وكفلها زكريا ) وفي قراءة : ( وكفلها زكريا ) بتشديد الفاء ونصب زكريا على المفعولية ، أي جعله كافلا لها .\nقال ابن إسحاق : وما ذاك إلا أنها كانت يتيمة . وذكر غيره أن بني إسرائيل أصابتهم سنة جدب ، فكفل زكريا مريم لذلك . ولا منافاة بين القولين . والله أعلم .\nوإنما قدر الله كون زكريا كافلها لسعادتها ، لتقتبس منه علما جما نافعا وعملا صالحا ، ولأنه كان زوج خالتها ، على ما ذكره ابن إسحاق وابن جرير [ وغيرهما ] وقيل : زوج أختها ، كما ورد في الصحيح : \" فإذا بيحيى وعيسى ، وهما ابنا الخالة \" ، وقد يطلق على ما ذكره ابن إسحاق ذلك أيضا توسعا ، فعلى هذا كانت في حضانة خالتها . وقد ثبت في الصحيحين أن النبي صلى الله عليه وسلم قضى في عمارة بنت حمزة أن تكون في حضانة خالتها امرأة جعفر بن أبي طالب وقال : \" الخالة بمنزلة الأم \" .\nثم أخبر تعالى عن سيادتها وجلالتها في محل عبادتها ، فقال : ( كلما دخل عليها زكريا المحراب وجد عندها رزقا ) قال مجاهد ، وعكرمة ، وسعيد بن جبير ، وأبو الشعثاء ، وإبراهيم النخعي ، والضحاك ، وقتادة ، والربيع بن أنس ، وعطية العوفي ، والسدي [ والشعبي ] يعني وجد عندها فاكهة الصيف في الشتاء وفاكهة الشتاء في الصيف . وعن مجاهد ( وجد عندها رزقا ) أي : علما ، أو قال : صحفا فيها علم . رواه ابن أبي حاتم ، والأول أصح ، وفيه دلالة على كرامات الأولياء . وفي السنة لهذا نظائر كثيرة . فإذا رأى زكريا هذا عندها ( قال يا مريم أنى لك هذا ) أي : يقول من أين لك هذا ؟ ( قالت هو من عند الله إن الله يرزق من يشاء بغير حساب ) .\nوقال الحافظ أبو يعلى : حدثنا سهل بن زنجلة ، حدثنا عبد الله بن صالح ، حدثنا عبد الله بن لهيعة ، عن محمد بن المنكدر ، عن جابر ، أن رسول الله صلى الله عليه وسلم أقام أياما لم يطعم طعاما ، حتى شق ذلك عليه ، فطاف في منازل أزواجه فلم يجد عند واحدة منهن شيئا ، فأتى فاطمة فقال : \" يا بنية ، هل عندك شيء آكله ، فإني جائع ؟ \" فقالت : لا والله بأبي أنت وأمي . فلما خرج من عندها بعثت إليها جارة لها برغيفين وقطعة لحم ، فأخذته منها فوضعته في جفنة لها ، وقالت : والله لأوثرن بهذا رسول الله [ صلى الله عليه وسلم ] على نفسي ومن عندي . وكانوا جميعا محتاجين إلى شبعة طعام ، فبعثت حسنا أو حسينا إلى رسول الله [ صلى الله عليه وسلم ] فرجع إليها فقالت له : بأبي وأمي قد أتى الله بشيء فخبأته لك . قال : \" هلمي يا بنية \" قالت : فأتيته بالجفنة . فكشفت عن الجفنة فإذا هي مملوءة خبزا ولحما ، فلما نظرت إليها بهتت وعرفت أنها بركة من الله ، فحمدت الله وصلت على نبيه ، وقدمته إلى رسول الله صلى الله عليه وسلم . فلما رآه حمد الله وقال : \" من أين لك هذا يا بنية ؟ \" فقالت يا أبت ، ( هو من عند الله إن الله يرزق من يشاء بغير حساب ) فحمد الله وقال : \" الحمد لله الذي جعلك - يا بنية - شبيهة بسيدة نساء بني إسرائيل ، فإنها كانت إذا رزقها الله شيئا فسئلت عنه قالت : ( هو من عند الله إن الله يرزق من يشاء بغير حساب ) فبعث رسول الله صلى الله عليه وسلم إلى علي ثم أكل رسول الله صلى الله عليه وسلم وأكل علي ، وفاطمة ، وحسن ، وحسين ، وجميع أزواج النبي صلى الله عليه وسلم وأهل بيته جميعا حتى شبعوا . قالت : وبقيت الجفنة كما هي ، فأوسعت ببقيتها على جميع الجيران ، وجعل الله فيها بركة وخيرا كثيرا .\n                                    ",
        "qortoby": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٖ وَأَنۢبَتَهَا نَبَاتًا حَسَنٗا وَكَفَّلَهَا زَكَرِيَّاۖ كُلَّمَا دَخَلَ عَلَيۡهَا زَكَرِيَّا ٱلۡمِحۡرَابَ وَجَدَ عِندَهَا رِزۡقٗاۖ قَالَ يَٰمَرۡيَمُ أَنَّىٰ لَكِ هَٰذَاۖ قَالَتۡ هُوَ مِنۡ عِندِ ٱللَّهِۖ إِنَّ ٱللَّهَ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٍ ٧٣\n                                    \n                                    \n                                    قوله تعالى : فتقبلها ربها بقبول حسن وأنبتها نباتا حسنا وكفلها زكريا كلما دخل عليها زكريا المحراب وجد عندها رزقا قال يا مريم أنى لك هذا قالت هو من عند الله إن الله يرزق من يشاء بغير حساب\nقوله تعالى : فتقبلها ربها بقبول حسن المعنى : سلك بها طريق السعداء ; عن ابن عباس . وقال قوم : معنى التقبل التكفل في التربية والقيام بشأنها . وقال الحسن : معنى التقبل أنه ما عذبها ساعة قط من ليل ولا نهار . وأنبتها نباتا حسنا يعني سوى خلقها من غير زيادة ولا نقصان ، فكانت تنبت في اليوم ما ينبت المولود في عام واحد . والقبول والنبات مصدران على غير المصدر ، والأصل تقبلا وإنباتا . قال الشاعر :\nأكفرا بعد رد الموت عني وبعد عطائك المائة الرتاعا\nأراد بعد إعطائك ، لكن لما قال أنبتها دل على نبت ; كما قال امرؤ القيس :\nفصرنا إلى الحسنى ورق كلامنا ورضت فذلت صعبة أي إذلال\nوإنما مصدر ذلت ذل ، ولكنه رده على معنى أذللت ; وكذلك كل ما يرد عليك في هذا الباب . فمعنى تقبل وقبل واحد ، فالمعنى فقبلها ربها بقبول حسن . ونظيره قول رؤبة :\nوقد تطويت انطواء الحضب\nالأفعى لأن معنى تطويت وانطويت واحد ; ومثله قول القطامي :\nوخير الأمر ما استقبلت منه وليس بأن تتبعه اتباعا\nلأن تتبعت واتبعت واحد . وفي قراءة ابن مسعود ( وأنزل الملائكة تنزيلا ) لأن معنى نزل وأنزل واحد . وقال المفضل : معناه وأنبتها فنبتت نباتا حسنا . ومراعاة المعنى أولى كما ذكرنا . والأصل في القبول الضم ; لأنه مصدر مثل الدخول والخروج ، والفتح جاء في حروف قليلة ; مثل الولوع والوزوع ; هذه الثلاثة لا غير ; قال أبو عمر والكسائي والأئمة . وأجاز الزجاج ( بقبول ) بضم القاف على الأصل .\nقوله تعالى : وكفلها زكريا أي ضمها إليه . أبو عبيدة : ضمن القيام بها . وقرأ الكوفيون وكفلها بالتشديد ، فهو يتعدى إلى مفعولين ; والتقدير وكفلها ربها زكريا ، أي ألزمه كفالتها وقدر ذلك عليه ويسره له . وفي مصحف أبي ( وأكفلها ) والهمزة كالتشديد في التعدي ; وأيضا فإن قبله فتقبلها ، و أنبتها فأخبر تعالى عن نفسه بما فعل بها ; فجاء كفلها بالتشديد على ذلك . وخففه الباقون على إسناد الفعل إلى زكريا . فأخبر الله تعالى أنه هو الذي تولى كفالتها والقيام بها ; بدلالة قوله : أيهم يكفل مريم . قال مكي : وهو الاختيار ; لأن التشديد يرجع إلى التخفيف ، لأن الله تعالى إذا كفلها زكريا كفلها بأمر الله ، ولأن زكريا إذا كفلها فعن مشيئة الله وقدرته ; فعلى ذلك فالقراءتان متداخلتان . وروى عمرو بن موسى عن عبد الله بن كثير وأبي عبد الله المزني \" وكفلها \" بكسر الفاء . قال الأخفش : يقال كفل يكفل وكفل يكفل ولم أسمع كفل ، وقد ذكرت . وقرأ مجاهد \" فتقبلها \" بإسكان اللام على المسألة والطلب . \" ربها \" بالنصب نداء مضاف . \" وأنبتها \" بإسكان التاء \" وكفلها \" بإسكان اللام \" زكرياء \" بالمد والنصب . وقرأ حفص وحمزة والكسائي زكريا بغير مد ولا همزة ، ومده الباقون وهمزوه . وقال الفراء : أهل الحجاز يمدون \" زكرياء \" ويقصرونه ، وأهل نجد يحذفون منه الألف ويصرفونه فيقولون : زكري . قال الأخفش : فيه أربع لغات : المد والقصر ، وزكري بتشديد الياء والصرف ، وزكر ورأيت زكريا . قال أبو حاتم : زكري بلا صرف لأنه أعجمي وهذا غلط ; لأن ما كان فيه \" يا \" مثل هذا انصرف مثل كرسي ويحيى ، ولم ينصرف زكرياء في المد والقصر لأن فيه ألف تأنيث والعجمة والتعريف .\nقوله تعالى : كلما دخل عليها زكريا المحراب وجد عندها رزقا إلى قوله إنك سميع الدعاء\nفيه مسائل :\nقوله تعالى : كلما دخل عليها زكريا المحراب المحراب في اللغة أكرم موضع في المجلس . وسيأتي له مزيد بيان في سورة ( مريم ) . وجاء في الخبر : إنها كانت في غرفة كان زكريا يصعد إليها بسلم . قال وضاح اليمن :\nربة محراب إذا جئتها لم ألقها حتى أرتقي سلما\nأي ربة غرفة . روى أبو صالح عن ابن عباس قال : حملت امرأة عمران بعدما أسنت فنذرت ما في بطنها محررا فقال لها عمران : ويحك ما صنعت ؟ أرأيت إن كانت أنثى ؟ فاغتما لذلك جميعا . فهلك عمران وحنة حامل فولدت أنثى فتقبلها الله بقبول حسن ، وكان لا يحرر إلا الغلمان فتساهم عليها الأحبار بالأقلام التي يكتبون بها الوحي ، على ما يأتي . فكفلها زكريا وأخذ لها موضعا فلما أسنت جعل لها محرابا لا يرتقى إليه إلا بسلم ، واستأجر لها ظئرا وكان يغلق عليها بابا ، وكان لا يدخل عليها إلا زكريا حتى كبرت ، فكانت إذا حاضت أخرجها إلى منزله فتكون عند خالتها وكانت خالتها امرأة زكريا في قول الكلبي . قال مقاتل : كانت أختها امرأة زكريا . وكانت إذا طهرت من حيضتها واغتسلت ردها إلى المحراب . وقال بعضهم : كانت لا تحيض وكانت مطهرة من الحيض . وكان زكريا إذا دخل عليها يجد عندها فاكهة الشتاء في القيظ وفاكهة القيظ في الشتاء فقال : يا مريم أنى لك هذا ؟ فقالت : هو من عند الله . فعند ذلك طمع زكريا في الولد وقال : إن الذي يأتيها بهذا قادر أن يرزقني ولدا . ومعنى أنى من أين ; قاله أبو عبيدة . قال النحاس : وهذا فيه تساهل ; لأن \" أين \" سؤال عن المواضع و \" أنى \" سؤال عن المذاهب والجهات . والمعنى من أي المذاهب ومن أي الجهات لك هذا . وقد فرق الكميت بينهما فقال :\nأنى ومن أين آبك الطرب من حيث لا صبوة ولا ريب\nو كلما منصوب ب وجد ، أي كل دخلة .\nإن الله يرزق من يشاء بغير حساب قيل : هو من قول مريم ، ويجوز أن يكون مستأنفا ; فكان ذلك سبب دعاء زكريا وسؤاله الولد .\n                                    ",
        "saadi": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٖ وَأَنۢبَتَهَا نَبَاتًا حَسَنٗا وَكَفَّلَهَا زَكَرِيَّاۖ كُلَّمَا دَخَلَ عَلَيۡهَا زَكَرِيَّا ٱلۡمِحۡرَابَ وَجَدَ عِندَهَا رِزۡقٗاۖ قَالَ يَٰمَرۡيَمُ أَنَّىٰ لَكِ هَٰذَاۖ قَالَتۡ هُوَ مِنۡ عِندِ ٱللَّهِۖ إِنَّ ٱللَّهَ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٍ ٧٣\n                                        \n                                        \n                                        \n                                        { فتقبلها ربها بقبول حسن } أي: جعلها نذيرة مقبولة، وأجارها وذريتها من الشيطان { وأنبتها نباتًا حسنًا } أي: نبتت نباتا حسنا في بدنها وخلقها وأخلاقها، لأن الله تعالى قيض لها زكريا عليه السلام { وكفلها } إياه، وهذا من رفقه بها ليربيها على أكمل الأحوال، فنشأت في عبادة ربها وفاقت النساء، وانقطعت لعبادة ربها، ولزمت محرابها أي: مصلاها فكان { كلما دخل عليها زكريا المحراب وجد عندها رزقًا } أي: من غير كسب ولا تعب، بل رزق ساقه الله إليها، وكرامة أكرمها الله بها، فيقول لها زكريا { أنى لك هذا قالت هو من عند الله } فضلا وإحسانا { إن الله يرزق من يشاء بغير حساب } أي: من غير حسبان من العبد ولا كسب، قال تعالى: { ومن يتق الله يجعل له مخرجًا ويرزقه من حيث لا يحتسب } وفي هذه الآية دليل على إثبات كرامات الأولياء الخارقة للعادة كما قد تواترت الأخبار بذلك، خلافا لمن نفى ذلك، فلما رأى زكريا عليه السلام ما من الله به على مريم، وما أكرمها به من رزقه الهنيء الذي أتاها بغير سعي منها ولا كسب، طمعت نفسه بالولد\n                                    "
      },
      "originalText": "فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٖ وَأَنۢبَتَهَا نَبَاتًا حَسَنٗا وَكَفَّلَهَا زَكَرِيَّاۖ كُلَّمَا دَخَلَ عَلَيۡهَا زَكَرِيَّا ٱلۡمِحۡرَابَ وَجَدَ عِندَهَا رِزۡقٗاۖ قَالَ يَٰمَرۡيَمُ أَنَّىٰ لَكِ هَٰذَاۖ قَالَتۡ هُوَ مِنۡ عِندِ ٱللَّهِۖ إِنَّ ٱللَّهَ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٍ ٧٣"
    }
  ]
}