{
  "number": 540,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 5094,
      "text": "وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ أُولَٰئِكَ هُمُ الصِّدِّيقُونَ ۖ وَالشُّهَدَاءُ عِنْدَ رَبِّهِمْ لَهُمْ أَجْرُهُمْ وَنُورُهُمْ ۖ وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ",
      "surah": {
        "number": 57,
        "name": "سورة الحديد",
        "englishName": "Al-Hadid",
        "englishNameTranslation": "The Iron",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 19,
      "juz": 27,
      "manzil": 7,
      "page": 540,
      "ruku": 473,
      "hizbQuarter": 216,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦٓ أُوْلَٰٓئِكَ هُمُ ٱلصِّدِّيقُونَۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمۡ لَهُمۡ أَجۡرُهُمۡ وَنُورُهُمۡۖ وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِ‍َٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ ٩١\n                                    \n                                    \n                                    وقوله : ( والذين آمنوا بالله ورسله أولئك هم الصديقون ) هذا تمام لجملة وصف المؤمنين بالله ورسله بأنهم صديقون .\nقال العوفي ، عن ابن عباس في قوله : ( والذين آمنوا بالله ورسله أولئك هم الصديقون ) هذه مفصولة ( والشهداء عند ربهم لهم أجرهم ونورهم ) .\nوقال أبو الضحى : ( أولئك هم الصديقون ) ثم استأنف الكلام فقال : ( والشهداء عند ربهم ) وهكذا قال مسروق ، والضحاك ، ومقاتل بن حيان ، وغيرهم .\nوقال الأعمش ، عن أبي الضحى ، عن مسروق ، عن عبد الله في قوله : ( أولئك هم الصديقون والشهداء عند ربهم ) قال : هم ثلاثة أصناف : يعني المصدقين ، والصديقين ، والشهداء ، كما قال [ الله ] تعالى : ( ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين ) [ النساء : 69 ] ففرق بين الصديقين والشهداء ، فدل على أنهما صنفان . ولا شك أن الصديق أعلى مقاما من الشهيد ، كما رواه الإمام مالك بن أنس ، رحمه الله ، في كتابه الموطإ ، عن صفوان بن سليم ، عن عطاء بن يسار ، عن أبي سعيد الخدري أن رسول الله - صلى الله عليه وسلم - قال : \" إن أهل الجنة ليتراءون أهل الغرف من فوقهم ، كما تتراءون الكوكب الدري الغابر في الأفق من المشرق أو المغرب ، لتفاضل ما بينهم \" . قالوا : يا رسول الله ، تلك منازل الأنبياء لا يبلغها غيرهم ؟ قال : \" بلى والذي نفسي بيده ، رجال آمنوا بالله وصدقوا المرسلين \" .\nاتفق البخاري ، ومسلم على إخراجه من حديث مالك به\nوقال آخرون : بل المراد من قوله : ( أولئك هم الصديقون والشهداء عند ربهم ) فأخبر عن المؤمنين بالله ورسله بأنهم صديقون وشهداء . حكاه ابن جرير ، عن مجاهد ، ثم قال ابن جرير :\nحدثني صالح بن حرب أبو معمر ، حدثنا إسماعيل بن يحيى ، حدثنا ابن عجلان ، عن زيد بن أسلم ، عن البراء بن عازب قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" مؤمنو أمتي شهداء \" . قال : ثم تلا - صلى الله عليه وسلم - هذه الآية ( والذين آمنوا بالله ورسله أولئك هم الصديقون والشهداء عند ربهم لهم أجرهم ) هذا حديث غريب\nوقال أبو إسحاق ، عن عمرو بن ميمون في قوله : ( والذين آمنوا بالله ورسله أولئك هم الصديقون والشهداء عند ربهم لهم أجرهم ونورهم ) قال : يجيئون يوم القيامة معا كالإصبعين .\nوقوله : ( والشهداء عند ربهم ) أي : في جنات النعيم ، كما جاء في الصحيحين : \" إن أرواح الشهداء في حواصل طير خضر تسرح في الجنة حيث شاءت ، ثم تأوي إلى تلك القناديل ، فاطلع عليهم ربك اطلاعة فقال : ماذا تريدون ؟ فقالوا : نحب أن تردنا إلى الدار الدنيا فنقاتل فيك فنقتل كما قتلنا أول مرة . فقال إني قضيت أنهم إليها لا يرجعون \"\nوقوله : ( لهم أجرهم ونورهم ) أي : لهم عند ربهم أجر جزيل ونور عظيم يسعى بين أيديهم ، وهم في ذلك يتفاوتون بحسب ما كانوا في الدار الدنيا من الأعمال ، كما قال الإمام أحمد :\nحدثنا يحيى بن إسحاق ، حدثنا ابن لهيعة ، عن عطاء بن دينار ، عن أبي يزيد الخولاني قال : سمعت فضالة بن عبيد يقول : سمعت عمر بن الخطاب يقول : سمعت النبي - صلى الله عليه وسلم - يقول : \" الشهداء أربعة : رجل مؤمن جيد الإيمان ، لقي العدو فصدق الله فقتل ، فذلك الذي ينظر الناس إليه هكذا - ورفع رأسه حتى سقطت قلنسوة رسول الله - صلى الله عليه وسلم - أو قلنسوة عمر ، والثاني مؤمن لقي العدو فكأنما يضرب ظهره بشوك الطلح ، جاءه سهم غرب فقتله ، فذاك في الدرجة الثانية ، والثالث رجل مؤمن خلط عملا صالحا وآخر سيئا لقي العدو فصدق الله حتى قتل ، فذاك في الدرجة الثالثة ، والرابع رجل مؤمن أسرف على نفسه إسرافا كثيرا ، لقي العدو فصدق الله حتى قتل ، فذاك في الدرجة الرابعة \" .\nوهكذا رواه علي بن المديني ، عن أبي داود الطيالسي ، عن ابن المبارك عن ابن لهيعة ، وقال : هذا إسناد مصري صالح . ورواه الترمذي من حديث ابن لهيعة وقال : حسن غريب\nوقوله : ( والذين كفروا وكذبوا بآياتنا أولئك أصحاب الجحيم ) لما ذكر السعداء ومآلهم ، عطف بذكر الأشقياء وبين حالهم .\n                                    ",
        "qortoby": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦٓ أُوْلَٰٓئِكَ هُمُ ٱلصِّدِّيقُونَۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمۡ لَهُمۡ أَجۡرُهُمۡ وَنُورُهُمۡۖ وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِ‍َٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ ٩١\n                                    \n                                    \n                                    قوله تعالى : والذين آمنوا بالله ورسله أولئك هم الصديقون والشهداء عند ربهم لهم أجرهم ونورهم اختلف في الشهداء هل هو مقطوع مما قبل أو متصل به . فقال مجاهد وزيد بن أسلم : إن الشهداء والصديقين هم المؤمنون وأنه متصل ، وروي معناه عن النبي صلى الله عليه وسلم فلا يوقف على هذا على قوله : الصديقون وهذا قول ابن مسعود في تأويل الآية . قال القشيري قال الله تعالى : فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين فالصديقون هم الذين يتلون الأنبياء ، والشهداء هم الذين يتلون الصديقين ، والصالحون يتلون الشهداء ، فيجوز أن تكون هذه الآية في جملة من صدق بالرسل ، أعني والذين آمنوا بالله ورسله أولئك هم الصديقون والشهداء . ويكون المعني بالشهداء من شهد لله بالوحدانية ، فيكون صديق فوق صديق في الدرجات ، كما قال النبي صلى الله عليه وسلم : إن أهل الجنات العلا ليراهم من دونهم كما يرى أحدكم الكوكب الذي في أفق السماء وإن أبا بكر وعمر منهم وأنعما وروي عن ابن عباس ومسروق أن الشهداء غير الصديقين . فالشهداء على هذا منفصل مما قبله والوقف على قوله : الصديقون حسن . والمعنى والشهداء عند ربهم لهم أجرهم ونورهم أي : لهم أجر أنفسهم ونور أنفسهم . وفيهم قولان ؛ أحدهما : أنهم الرسل يشهدون على أممهم بالتصديق والتكذيب ؛ قاله الكلبي ، ودليله قوله تعالى : وجئنا بك على هؤلاء شهيدا . الثاني : أنهم أمم الرسل يشهدون يوم القيامة ، وفيما يشهدون به قولان ؛ أحدهما : أنهم يشهدون على أنفسهم بما عملوا من طاعة ومعصية . وهذا معنى قول مجاهد ، الثاني : يشهدون لأنبيائهم بتبليغهم الرسالة إلى أممهم ؛ قاله الكلبي . وقال مقاتل قولا ثالثا : إنهم القتلى في سبيل الله تعالى . ونحوه عن ابن عباس أيضا ، قال : أراد شهداء المؤمنين . والواو واو الابتداء . والصديقون على هذا القول مقطوع من الشهداء .\nوقد اختلف في تعيينهم ، فقال الضحاك : هم ثمانية نفر ، أبو بكر وعلي وزيد وعثمان وطلحة والزبير وسعد وحمزة . وتابعهم عمر بن الخطاب رضي الله عنهم ، ألحقه الله بهم لما صدق نبيه صلى الله عليه وسلم . وقال مقاتل بن حيان : الصديقون هم الذين آمنوا بالرسل ولم يكذبوهم طرفة عين ، مثل مؤمن آل فرعون ، وصاحب آل ياسين ، وأبي بكر الصديق ، وأصحاب الأخدود .\nقوله تعالى : والذين كفروا وكذبوا بآياتنا أي : بالرسل والمعجزات أولئك أصحاب الجحيم فلا أجر لهم ولا نور .\n                                    ",
        "saadi": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦٓ أُوْلَٰٓئِكَ هُمُ ٱلصِّدِّيقُونَۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمۡ لَهُمۡ أَجۡرُهُمۡ وَنُورُهُمۡۖ وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِ‍َٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ ٩١\n                                        \n                                        \n                                        \n                                        { وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ } والإيمان عند أهل السنة: هو ما دل عليه الكتاب والسنة، هو قول القلب واللسان، وعمل القلب واللسان والجوارح، فيشمل ذلك جميع شرائع الدين الظاهرة والباطنة، فالذين جمعوا بين هذه الأمور هم الصديقون أي: الذين مرتبتهم فوق مرتبة عموم المؤمنين، ودون مرتبة الأنبياء.\n[وقوله:] { وَالشُّهَدَاءُ عِنْدَ رَبِّهِمْ لَهُمْ أَجْرُهُمْ وَنُورُهُمْ } كما ورد في الحديث الصحيح: { إن في الجنة مائة درجة، ما بين الدرجتين كما بين السماء والأرض، أعدها الله للمجاهدين في سبيله } وهذا يقتضي شدة علوهم ورفعتهم، وقربهم الله تعالى.\n{ وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَئِكَ أَصْحَابُ الْجَحِيمِ } فهذه الآيات جمعت أصناف الخلق، المتصدقين، والصديقين، والشهداء، وأصحاب الجحيم، فالمتصدقون الذين كان جل عملهم الإحسان إلى الخلق، وبذل النفع إليهم بغاية ما يمكنهم، خصوصا بالنفع بالمال في سبيل الله.\nوالصديقون هم الذين كملوا مراتب الإيمان والعمل الصالح، والعلم النافع، واليقين الصادق، والشهداء هم الذين قاتلوا في سبيل الله [لإعلاء كلمة الله، وبذلوا أنفسهم وأموالهم] فقتلوا، وأصحاب الجحيم هم الكفار الذين كذبوا بآيات الله.\nوبقي قسم ذكرهم الله في سورة فاطر، وهم المقتصدون الذين أدوا الواجبات وتركوا المحرمات، إلا أنهم حصل منهم تقصير ببعض حقوق الله وحقوق عباده، فهؤلاء مآلهم الجنة، وإن حصل لهم عقوبة ببعض ما فعلوا.\n                                    "
      },
      "originalText": "وَٱلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦٓ أُوْلَٰٓئِكَ هُمُ ٱلصِّدِّيقُونَۖ وَٱلشُّهَدَآءُ عِندَ رَبِّهِمۡ لَهُمۡ أَجۡرُهُمۡ وَنُورُهُمۡۖ وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِ‍َٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلۡجَحِيمِ ٩١"
    },
    {
      "number": 5095,
      "text": "اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ ۖ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَامًا ۖ وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِنَ اللَّهِ وَرِضْوَانٌ ۚ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ",
      "surah": {
        "number": 57,
        "name": "سورة الحديد",
        "englishName": "Al-Hadid",
        "englishNameTranslation": "The Iron",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 20,
      "juz": 27,
      "manzil": 7,
      "page": 540,
      "ruku": 474,
      "hizbQuarter": 216,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ ٠٢\n                                    \n                                    \n                                    قول تعالى موهنا أمر الحياة الدنيا ومحقرا لها : ( أنما الحياة الدنيا لعب ولهو وزينة وتفاخر بينكم وتكاثر في الأموال والأولاد ) أي : إنما حاصل أمرها عند أهلها هذا ، كما قال : ( زين للناس حب الشهوات من النساء والبنين والقناطير المقنطرة من الذهب والفضة والخيل المسومة والأنعام والحرث ذلك متاع الحياة الدنيا والله عنده حسن المآب ) [ آل عمران : 14 ]\nثم ضرب تعالى مثل الحياة الدنيا في أنها زهرة فانية ونعمة زائلة فقال : ( كمثل غيث ) وهو : المطر الذي يأتي بعد قنوط الناس ، كما قال : ( وهو الذي ينزل الغيث من بعد ما قنطوا وينشر رحمته ) [ الشورى : 28 ]\nوقوله : ( أعجب الكفار نباته ) أي : يعجب الزراع نبات ذلك الزرع الذي نبت بالغيث ; وكما يعجب الزراع ذلك كذلك تعجب الحياة الدنيا الكفار ، فإنهم أحرص شيء عليها ، وأميل الناس إليها ، ( ثم يهيج فتراه مصفرا ثم يكون حطاما ) أي : يهيج ذلك الزرع فتراه مصفرا بعد ما كان خضرا نضرا ، ثم يكون بعد ذلك كله حطاما ، أي : يصير يبسا متحطما ، هكذا الحياة الدنيا تكون أولا شابة ، ثم تكتهل ، ثم تكون عجوزا شوهاء ، والإنسان كذلك في أول عمره وعنفوان شبابه غضا طريا لين الأعطاف ، بهي المنظر ، ثم إنه يشرع في الكهولة ، فتتغير طباعه وينفد بعض قواه ، ثم يكبر فيصير شيخا كبيرا ، ضعيف القوى ، قليل الحركة ، يعجزه الشيء اليسير ، كما قال تعالى : ( الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفا وشيبة يخلق ما يشاء وهو العليم القدير ) [ الروم : 54 ] . ولما كان هذا المثل دالا على زوال الدنيا وانقضائها وفراغها لا محالة ، وأن الآخرة كائنة لا محالة ، حذر من أمرها ورغب فيما فيها من الخير ، فقال : ( وفي الآخرة عذاب شديد ومغفرة من الله ورضوان وما الحياة الدنيا إلا متاع الغرور ) أي : وليس في الآخرة الآتية القريبة إلا إما هذا وإما هذا : إما عذاب شديد ، وإما مغفرة من الله ورضوان .\nوقوله : ( وما الحياة الدنيا إلا متاع الغرور ) أي : هي متاع فان غار لمن ركن إليه فإنه يغتر بها وتعجبه حتى يعتقد أنه لا دار سواها ولا معاد وراءها ، وهي حقيرة قليلة بالنسبة إلى الدار الآخرة .\nقال ابن جرير : حدثنا علي ابن حرب الموصلي ، حدثنا المحاربي ، حدثنا محمد بن عمرو ، عن أبي سلمة ، عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : \" موضع سوط في الجنة خير من الدنيا وما فيها . اقرءوا : ( وما الحياة الدنيا إلا متاع الغرور )\nوهذا الحديث ثابت في الصحيح بدون هذه الزيادة والله أعلم .\nوقال الإمام أحمد : حدثنا ابن نمير ، ووكيع ، كلاهما عن الأعمش ، عن شقيق ، عن عبد الله قال : قال رسول الله - صلى الله عليه وسلم - : \" للجنة أقرب إلى أحدكم من شراك نعله ، والنار مثل ذلك \" .\nانفرد بإخراجه البخاري في \" الرقاق \" ، من حديث الثوري ، عن الأعمش به\nففي هذا الحديث دليل على اقتراب الخير والشر من الإنسان ، وإذا كان الأمر كذلك ; فلهذا حثه الله على المبادرة إلى الخيرات ، من فعل الطاعات ، وترك المحرمات ، التي تكفر عنه الذنوب والزلات ، وتحصل له الثواب والدرجات\n                                    ",
        "qortoby": "ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ ٠٢\n                                    \n                                    \n                                    قوله تعالى : اعلموا أنما الحياة الدنيا لعب ولهو وجه الاتصال أن الإنسان قد يترك الجهاد خوفا على نفسه من القتل ، وخوفا من لزوم الموت ، فبين أن الحياة الدنيا منقضية فلا ينبغي أن يترك أمر الله محافظة على ما لا يبقى . و \" ما \" صلة تقديره : اعلموا أن الحياة الدنيا لعب باطل ، ولهو فرح ثم ينقضي . وقال قتادة : لعب ولهو : أكل وشرب . وقيل : إنه على المعهود من اسمه ، قال مجاهد : كل لعب لهو . وقد مضى هذا المعنى في ( الأنعام ) وقيل : اللعب ما رغب في الدنيا ، واللهو ما ألهى عن الآخرة ، أي : شغل عنها . وقيل : اللعب : الاقتناء ، واللهو : النساء .\n\" وزينة \" الزينة ما يتزين به ، فالكافر يتزين بالدنيا ولا يعمل للآخرة ، وكذلك من تزين في غير طاعة الله .\nوتفاخر بينكم أي : يفخر بعضكم على بعض بها . وقيل : بالخلقة والقوة . وقيل : بالأنساب على عادة العرب في المفاخرة بالآباء . وفي صحيح مسلم عن النبي صلى الله عليه وسلم قال : إن الله أوحى إلي أن تواضعوا حتى لا يبغي أحد على أحد ولا يفخر أحد على أحد وصح عنه عليه الصلاة والسلام أنه قال : أربع في أمتي من أمر الجاهلية : الفخر في الأحساب الحديث . وقد تقدم جميع هذا .\nوتكاثر في الأموال والأولاد لأن عادة الجاهلية أن تتكاثر بالأبناء والأموال ، وتكاثر المؤمنين بالإيمان والطاعة . قال بعض المتأخرين : لعب كلعب الصبيان ولهو كلهو الفتيان وزينة كزينة النسوان وتفاخر كتفاخر الأقران وتكاثر كتكاثر الدهقان . وقيل : المعنى أن الدنيا كهذه الأشياء في الزوال والفناء . وعن علي رضي الله عنه قال لعمار : لا تحزن على الدنيا ، فإن الدنيا ستة أشياء : مأكول ومشروب وملبوس ومشموم ومركوب ومنكوح ، فأحسن طعامها العسل وهو بزقة ذبابة ، وأكثر شرابها الماء يستوي فيه جميع الحيوان ، وأفضل ملبوسها الديباج وهو نسج دودة ، وأفضل المشموم المسك وهو دم فأرة ، وأفضل المركوب الفرس وعليها يقتل الرجال ، وأما المنكوح فالنساء وهو مبال في مبال ، والله إن المرأة لتزين أحسنها يراد به أقبحها . ثم ضرب الله تعالى لها مثلا بالزرع في غيث فقال : كمثل غيث أي : مطر أعجب الكفار نباته الكفار هنا : الزراع لأنهم يغطون البذر . والمعنى أن الحياة الدنيا كالزرع يعجب الناظرين إليه لخضرته بكثرة الأمطار ، ثم لا يلبث أن يصير هشيما كأن لم يكن ، وإذا أعجب الزراع فهو غاية ما يستحسن . وقد مضى معنى هذا المثل في ( يونس ) و ( الكهف ) . وقيل : الكفار هنا الكافرون بالله عز وجل ، لأنهم أشد إعجابا بزينة الدنيا من المؤمنين . وهذا قول حسن ، فإن أصل الإعجاب لهم وفيهم ، ومنهم يظهر ذلك ، وهو التعظيم للدنيا وما فيها . وفي الموحدين من ذلك فروع تحدث من شهواتهم ، وتتقلل عندهم وتدق إذا ذكروا الآخرة . وموضع الكاف رفع على الصفة . ثم يهيج أي : يجف بعد خضرته فتراه مصفرا أي : متغيرا عما كان عليه من النضرة . ثم يكون حطاما أي : فتاتا وتبنا فيذهب بعد حسنه ، كذلك دنيا الكافر . وفي الآخرة عذاب شديد أي : للكافرين . والوقف عليه حسن ، ويبتدئ ومغفرة من الله ورضوان أي : للمؤمنين .\n. وقال الفراء : وفي الآخرة عذاب شديد ومغفرة تقديره إما عذاب شديد وإما مغفرة ، فلا يوقف على شديد . وما الحياة الدنيا إلا متاع الغرور هذا تأكيد ما سبق ، أي : تغر الكفار ، فأما المؤمن فالدنيا له متاع بلاغ إلى الجنة . وقيل : العمل للحياة الدنيا متاع الغرور تزهيدا في العمل للدنيا ، وترغيبا في العمل للآخرة .\n                                    ",
        "saadi": "ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ ٠٢\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن حقيقة الدنيا وما هي عليه، ويبين غايتها وغاية أهلها، بأنها لعب ولهو، تلعب بها الأبدان، وتلهو بها القلوب، وهذا مصداقه ما هو موجود وواقع من أبناء الدنيا، فإنك تجدهم قد قطعوا أوقات أعمارهم بلهو القلوب، والغفلة عن ذكر الله وعما أمامهم من الوعد والوعيد، وتراهم قد اتخذوا دينهم لعبا ولهوا، بخلاف أهل اليقظة وعمال الآخرة، فإن قلوبهم معمورة بذكر الله، ومعرفته ومحبته، وقد أشغلوا أوقاتهم بالأعمال التي تقربهم إلى الله، من النفع القاصر والمتعدي.\n[وقوله:] { وَزِينَةً } أي: تزين في اللباس والطعام والشراب، والمراكب والدور والقصور والجاه. [وغير ذلك] { وَتَفَاخُرٌ بَيْنَكُمْ } أي: كل واحد من أهلها يريد مفاخرة الآخر، وأن يكون هو الغالب في أمورها، والذي له الشهرة في أحوالها، { وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ } أي: كل يريد أن يكون هو الكاثر لغيره في المال والولد، وهذا مصداقه، وقوعه من محبي الدنيا والمطمئنين إليها.\nبخلاف من عرف الدنيا وحقيقتها، فجعلها معبرا ولم يجعلها مستقرا، فنافس فيما يقربه إلى الله، واتخذ الوسائل التي توصله إلى الله وإذا رأى من يكاثره وينافسه بالأموال والأولاد، نافسه بالأعمال الصالحة.\nثم ضرب للدنيا مثلا بغيث نزل على الأرض، فاختلط به نبات الأرض مما يأكل الناس والأنعام، حتى إذا أخذت الأرض زخرفها، وأعجب نباته الكفار، الذين قصروا همهم ونظرهم إلى الدنيا جاءها من أمر الله [ما أتلفها] فهاجت ويبست، فعادت على حالها الأولى، كأنه لم ينبت فيها خضراء، ولا رؤي لها مرأى أنيق، كذلك الدنيا، بينما هي زاهية لصاحبها زاهرة، مهما أراد من مطالبها حصل، ومهما توجه لأمر من أمورها وجد أبوابه مفتحة، إذ أصابها القدر بما أذهبها من يده، وأزال تسلطه عليها، أو ذهب به عنها، فرحل منها صفر اليدين، لم يتزود منها سوى الكفن، فتبا لمن أضحت هي غاية أمنيته ولها عمله وسعيه.\nوأما العمل للآخرة فهو الذي ينفع، ويدخر لصاحبه، ويصحب العبد على الأبد، ولهذا قال تعالى: { وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِنَ اللَّهِ وَرِضْوَانٌ } أي: حال الآخرة، ما يخلو من هذين الأمرين: إما العذاب الشديد في نار جهنم، وأغلالها وسلاسلها وأهوالها لمن كانت الدنيا هي غايته ومنتهى مطلبه، فتجرأ على معاصي الله، وكذب بآيات الله، وكفر بأنعم الله.\nوإما مغفرة من الله للسيئات، وإزالة للعقوبات، ورضوان من الله، يحل من أحله به دار الرضوان لمن عرف الدنيا، وسعى للآخرة سعيها.\nفهذا كله مما يدعو إلى الزهد في الدنيا، والرغبة في الآخرة، ولهذا قال: { وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ } أي: إلا متاع يتمتع به وينتفع به، ويستدفع به الحاجات، لا يغتر به ويطمئن إليه إلا أهل العقول الضعيفة الذين يغرهم بالله الغرور.\n                                    "
      },
      "originalText": "ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ ٠٢"
    },
    {
      "number": 5096,
      "text": "سَابِقُوا إِلَىٰ مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَاءِ وَالْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ ۚ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
      "surah": {
        "number": 57,
        "name": "سورة الحديد",
        "englishName": "Al-Hadid",
        "englishNameTranslation": "The Iron",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 21,
      "juz": 27,
      "manzil": 7,
      "page": 540,
      "ruku": 474,
      "hizbQuarter": 216,
      "sajda": false,
      "tafsier": {
        "ibnkther": "سَابِقُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أُعِدَّتۡ لِلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ ١٢\n                                    \n                                    \n                                    فقال تعالى : ( سابقوا إلى مغفرة من ربكم وجنة عرضها كعرض السماء والأرض ) والمراد جنس السماء والأرض ، كما قال في الآية الأخرى : ( وسارعوا إلى مغفرة من ربكم وجنة عرضها السماوات والأرض أعدت للمتقين ) [ آل عمران : 133 ] . وقال ها هنا : ( أعدت للذين آمنوا بالله ورسله ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيم ) أي : هذا الذي أهلهم الله له هو من فضله ومنه عليهم وإحسانه إليهم ، كما قدمنا في الصحيح : أن فقراء المهاجرين قالوا : يا رسول الله ، ذهب أهل الدثور بالدرجات العلى والنعيم المقيم . قال : \" وما ذاك ؟ \" . قالوا : يصلون كما نصلي ، ويصومون كما نصوم ، ويتصدقون ولا نتصدق ، ويعتقون ولا نعتق . قال : \" أفلا أدلكم على شيء إذا فعلتموه سبقتم من بعدكم ، ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم : تسبحون وتكبرون وتحمدون دبر كل صلاة ثلاثا وثلاثين \" . قال : فرجعوا فقالوا : سمع إخواننا أهل الأموال ما فعلنا ، ففعلوا مثله ! فقال رسول الله - صلى الله عليه وسلم - : \" ذلك فضل الله يؤتيه من يشاء \"\n\n                                    ",
        "qortoby": "سَابِقُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أُعِدَّتۡ لِلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ ١٢\n                                    \n                                    \n                                    قوله تعالى : سابقوا إلى مغفرة من ربكم أي : سارعوا بالأعمال الصالحة التي توجب المغفرة لكم من ربكم . وقيل : سارعوا بالتوبة ، لأنها تؤدي إلى المغفرة ؛ قاله الكلبي . وقيل التكبيرة الأولى مع الإمام ؛ قاله مكحول . وقيل : الصف الأول . وجنة عرضها كعرض السماء والأرض لو وصل بعضها ببعض . قال الحسن : يعني جميع السماوات والأرضين مبسوطتان كل واحدة إلى صاحبتها . وقيل : يريد لرجل واحد أي : لكل واحد جنة بهذه السعة . وقال ابن كيسان : عنى به جنة واحدة من الجنات . والعرض أقل من الطول ، ومن عادة العرب أنها تعبر عن سعة الشيء بعرضه دون طوله . قال :\nكأن بلاد الله وهي عريضة على الخائف المطلوب كفة حابل\nوقد مضى هذا كله في ( آل عمران ) . وقال طارق بن شهاب : قال قوم من أهل الحيرة لعمر رضي الله عنه : أرأيت قول الله عز وجل : وجنة عرضها كعرض السماء والأرض فأين النار ؟ فقال لهم عمر : أرأيتم الليل إذا ولى وجاء النهار أين يكون الليل ؟ فقالوا : لقد نزعت بما في التوراة مثله . أعدت للذين آمنوا بالله ورسله شرط الإيمان لا غير ، وفيه تقوية الرجاء . وقد قيل : شرط الإيمان هنا ، وزاد عليه في ( آل عمران ) فقال : أعدت للمتقين الذين ينفقون في السراء والضراء والكاظمين الغيظ والعافين عن الناس .\nذلك فضل الله يؤتيه من يشاء أي : إن الجنة لا تنال ولا تدخل إلا برحمة الله تعالى وفضله . وقد مضى هذا في ( الأعراف ) وغيرها . والله ذو الفضل العظيم \n                                    ",
        "saadi": "سَابِقُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أُعِدَّتۡ لِلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ ١٢\n                                        \n                                        \n                                        \n                                        ثم أمر بالمسابقة إلى مغفرة الله ورضوانه وجنته، وذلك يكون بالسعي بأسباب المغفرة، من التوبة النصوح، والاستغفار النافع، والبعد عن الذنوب ومظانها، والمسابقة إلى رضوان الله بالعمل الصالح، والحرص على ما يرضي الله على الدوام، من الإحسان في عبادة الخالق، والإحسان إلى الخلق بجميع وجوه النفع، ولهذا ذكر الله الأعمال الموجبة لذلك، فقال: { وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَاءِ وَالْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ } والإيمان بالله ورسله يدخل فيه أصول الدين وفروعها، { ذَلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ } أي: هذا الذي بيناه لكم، وذكرنا لكم فيه الطرق الموصلة إلى الجنة، والطرق الموصلة إلى النار، وأن فضل الله بالثواب الجزيل والأجر العظيم من أعظم منته على عباده وفضله. { وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ } الذي لا يحصي ثناء عليه، بل هو كما أثنى على نفسه، وفوق ما يثني عليه عباده\n                                    "
      },
      "originalText": "سَابِقُوٓاْ إِلَىٰ مَغۡفِرَةٖ مِّن رَّبِّكُمۡ وَجَنَّةٍ عَرۡضُهَا كَعَرۡضِ ٱلسَّمَآءِ وَٱلۡأَرۡضِ أُعِدَّتۡ لِلَّذِينَ ءَامَنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ ذَٰلِكَ فَضۡلُ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۚ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ ١٢"
    },
    {
      "number": 5097,
      "text": "مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ إِلَّا فِي كِتَابٍ مِنْ قَبْلِ أَنْ نَبْرَأَهَا ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
      "surah": {
        "number": 57,
        "name": "سورة الحديد",
        "englishName": "Al-Hadid",
        "englishNameTranslation": "The Iron",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 22,
      "juz": 27,
      "manzil": 7,
      "page": 540,
      "ruku": 474,
      "hizbQuarter": 216,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَآ أَصَابَ مِن مُّصِيبَةٖ فِي ٱلۡأَرۡضِ وَلَا فِيٓ أَنفُسِكُمۡ إِلَّا فِي كِتَٰبٖ مِّن قَبۡلِ أَن نَّبۡرَأَهَآۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ ٢٢\n                                    \n                                    \n                                    يخبر تعالى عن قدره السابق في خلقه قبل أن يبرأ البرية فقال : ( ما أصاب من مصيبة في الأرض ولا في أنفسكم ) أي : في الآفاق وفي نفوسكم ( إلا في كتاب من قبل أن نبرأها ) أي : من قبل أن نخلق الخليقة ونبرأ النسمة .\nوقال بعضهم : ( من قبل أن نبرأها ) عائد على النفوس . وقيل : عائد على المصيبة . والأحسن عوده على الخليقة والبرية ; لدلالة الكلام عليها ، كما قال ابن جرير :\nحدثني يعقوب ، حدثنا ابن علية ، عن منصور بن عبد الرحمن قال : كنت جالسا مع الحسن ، فقال رجل : سله عن قوله : ( ما أصاب من مصيبة في الأرض ولا في أنفسكم إلا في كتاب من قبل أن نبرأها ) فسألته عنها ، فقال : سبحان الله ! ومن يشك في هذا ؟ كل مصيبة بين السماء والأرض ، ففي كتاب الله من قبل أن يبرأ النسمة\nوقال قتادة : ( ما أصاب من مصيبة في الأرض ) قال : هي السنون . يعني : الجدب ، ( ولا في أنفسكم ) يقول : الأوجاع والأمراض . قال : وبلغنا أنه ليس أحد يصيبه خدش عود ولا نكبة قدم ، ولا خلجان عرق إلا بذنب ، وما يعفو الله عنه أكثر .\nوهذه الآية الكريمة من أدل دليل على القدرية نفاة العلم السابق - قبحهم الله - وقال الإمام أحمد :\nحدثنا أبو عبد الرحمن ، حدثنا حيوة ، وابن لهيعة قالا حدثنا أبو هانئ الخولاني : أنه سمع أبا عبد الرحمن الحبلي يقول : سمعت عبد الله بن عمرو بن العاص يقول : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" قدر الله المقادير قبل أن يخلق السماوات والأرض بخمسين ألف سنة \" .\nورواه مسلم في صحيحه ، من حديث عبد الله بن وهب ، وحيوة بن شريح ، ونافع بن يزيد ، وثلاثتهم عن أبي هانئ به . وزاد بن وهب : \" وكان عرشه على الماء \" . ورواه الترمذي وقال : حسن صحيح\nوقوله : ( إن ذلك على الله يسير ) أي : أن علمه تعالى الأشياء قبل كونها ، وكتابته لها طبق ما يوجد في حينها سهل على الله ، عز وجل ; لأنه يعلم ما كان وما يكون وما لم يكن لو كان كيف كان يكون .\n                                    ",
        "qortoby": "مَآ أَصَابَ مِن مُّصِيبَةٖ فِي ٱلۡأَرۡضِ وَلَا فِيٓ أَنفُسِكُمۡ إِلَّا فِي كِتَٰبٖ مِّن قَبۡلِ أَن نَّبۡرَأَهَآۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ ٢٢\n                                    \n                                    \n                                    قوله تعالى : ما أصاب من مصيبة في الأرض قال مقاتل : القحط وقلة النبات والثمار . وقيل : الجوائح في الزرع .\nولا في أنفسكم بالأوصاب والأسقام ؛ قاله قتادة . وقيل : إقامة الحدود ؛ قاله ابن حيان . وقيل : ضيق المعاش ، وهذا معنى رواه ابن جريج .\nإلا في كتاب يعني في اللوح المحفوظ . من قبل أن نبرأها الضمير في نبرأها عائد على النفوس أو الأرض أو المصائب أو الجميع . وقال ابن عباس : من قبل أن يخلق المصيبة .\nوقال سعيد بن جبير : من قبل أن يخلق الأرض والنفس . إن ذلك على الله يسير أي : خلق ذلك وحفظ جميعه على الله يسير هين . قال الربيع بن صالح : لما أخذ سعيد بن جبير رضي الله عنه بكيت ، فقال : ما يبكيك ؟ قلت : أبكي لما أرى بك ولما تذهب إليه . قال : فلا تبك ، فإنه كان في علم الله أن يكون ، ألم تسمع قوله تعالى : ما أصاب من مصيبة في الأرض ولا في أنفسكم الآية . وقال ابن عباس : لما خلق الله القلم قال له : اكتب ، فكتب ما هو كائن إلى يوم القيامة . ولقد ترك لهذه الآية جماعة من الفضلاء الدواء في أمراضهم فلم يستعملوه ؛ ثقة بربهم وتوكلا عليه ، وقالوا : قد علم الله أيام المرض وأيام الصحة ، فلو حرص الخلق على تقليل ذلك أو زيادته ما قدروا ، قال الله تعالى : ما أصاب من مصيبة في الأرض ولا في أنفسكم إلا في كتاب من قبل أن نبرأها .\nوقد قيل : إن هذه الآية تتصل بما قبل ، وهو أن الله سبحانه هون عليهم ما يصيبهم في الجهاد من قتل وجرح ، وبين أن ما يخلفهم عن الجهاد من المحافظة على الأموال وما يقع فيها من خسران ، فالكل مكتوب مقدر لا مدفع له ، وإنما على المرء امتثال الأمر .\n                                    ",
        "saadi": "مَآ أَصَابَ مِن مُّصِيبَةٖ فِي ٱلۡأَرۡضِ وَلَا فِيٓ أَنفُسِكُمۡ إِلَّا فِي كِتَٰبٖ مِّن قَبۡلِ أَن نَّبۡرَأَهَآۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ ٢٢\n                                        \n                                        \n                                        \n                                        يقول تعالى مخبرا عن عموم قضائه وقدره: { مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ } وهذا شامل لعموم المصائب التي تصيب الخلق، من خير وشر، فكلها قد كتبت في اللوح المحفوظ، صغيرها وكبيرها، وهذا أمر عظيم لا تحيط به العقول، بل تذهل عنده أفئدة أولي الألباب، ولكنه على الله يسير، وأخبر الله عباده بذلك لأجل أن تتقرر هذه القاعدة عندهم، ويبنوا عليها ما أصابهم من الخير والشر،\n                                    "
      },
      "originalText": "مَآ أَصَابَ مِن مُّصِيبَةٖ فِي ٱلۡأَرۡضِ وَلَا فِيٓ أَنفُسِكُمۡ إِلَّا فِي كِتَٰبٖ مِّن قَبۡلِ أَن نَّبۡرَأَهَآۚ إِنَّ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٞ ٢٢"
    },
    {
      "number": 5098,
      "text": "لِكَيْلَا تَأْسَوْا عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ",
      "surah": {
        "number": 57,
        "name": "سورة الحديد",
        "englishName": "Al-Hadid",
        "englishNameTranslation": "The Iron",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 23,
      "juz": 27,
      "manzil": 7,
      "page": 540,
      "ruku": 474,
      "hizbQuarter": 216,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لِّكَيۡلَا تَأۡسَوۡاْ عَلَىٰ مَا فَاتَكُمۡ وَلَا تَفۡرَحُواْ بِمَآ ءَاتَىٰكُمۡۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٍ ٣٢\n                                    \n                                    \n                                    وقوله : ( لكي لا تأسوا على ما فاتكم ولا تفرحوا بما آتاكم ) أي : أعلمناكم بتقدم علمنا وسبق كتابتنا للأشياء قبل كونها ، وتقديرنا الكائنات قبل وجودها ، لتعلموا أن ما أصابكم لم يكن ليخطئكم ، وما أخطأكم لم يكن ليصيبكم ، فلا تأسوا على ما فاتكم ، فإنه لو قدر شيء لكان ( ولا تفرحوا بما آتاكم ) أي : جاءكم ، ويقرأ : \" آتاكم \" أي : أعطاكم . وكلاهما متلازمان ، أي : لا تفخروا على الناس بما أنعم الله به عليكم ، فإن ذلك ليس بسعيكم ولا كدكم ، وإنما هو عن قدر الله ورزقه لكم ، فلا تتخذوا نعم الله أشرا وبطرا ، تفخرون بها على الناس ; ولهذا قال : ( والله لا يحب كل مختال فخور ) أي : مختال في نفسه متكبر فخور ، أي : على غيره .\nوقال عكرمة : ليس أحد إلا وهو يفرح ويحزن ، ولكن اجعلوا الفرح شكرا والحزن صبرا .\n                                    ",
        "qortoby": "لِّكَيۡلَا تَأۡسَوۡاْ عَلَىٰ مَا فَاتَكُمۡ وَلَا تَفۡرَحُواْ بِمَآ ءَاتَىٰكُمۡۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٍ ٣٢\n                                    \n                                    \n                                    ثم أدبهم فقال هذا : لكيلا تأسوا على ما فاتكم أي : حتى لا تحزنوا على ما فاتكم من الرزق ، وذلك أنهم إذا علموا أن الرزق قد فرغ منه لم يأسوا على ما فاتهم منه . وعن ابن مسعود أن نبي الله صلى الله عليه وسلم قال : لا يجد أحدكم طعم الإيمان حتى يعلم أن ما أصابه لم يكن ليخطئه وما أخطأه لم يكن ليصيبه ثم قرأ لكيلا تأسوا على ما فاتكم أي : كي لا تحزنوا على ما فاتكم من الدنيا ، فإنه لم يقدر لكم ولو قدر لكم لم يفتكم ولا تفرحوا بما آتاكم أي : من الدنيا ؛ قاله ابن عباس . وقال سعيد بن جبير : من العافية والخصب . وروى عكرمة عن ابن عباس : ليس من أحد إلا وهو يحزن ويفرح ، ولكن المؤمن يجعل مصيبته صبرا ، وغنيمته شكرا . والحزن والفرح المنهي عنهما هما اللذان يتعدى فيهما إلى ما لا يجوز . وقراءة العامة \" آتاكم \" بمد الألف أي : أعطاكم من الدنيا . واختاره أبو حاتم . وقرأ أبو العالية ونصر بن عاصم وأبو عمرو \" أتاكم \" بقصر الألف واختاره أبو عبيد . أي : جاءكم ، وهو معادل ل \" فاتكم \" ولهذا لم يقل أفاتكم . قال جعفر بن محمد الصادق : يا ابن آدم ما لك تأسى على مفقود لا يرده عليك الفوت ، أو تفرح بموجود لا يتركه في يديك الموت . وقيل لبرزجمهر : أيها الحكيم ! مالك لا تحزن على ما فات ، ولا تفرح بما هو آت ؟ قال : لأن الفائت لا يتلافى بالعبرة ، والآتي لا يستدام بالحبرة . وقال الفضيل بن عياض في هذا المعنى : الدنيا مبيد ومفيد ، فما أباد فلا رجعة له ، وما أفاد آذن بالرحيل . وقيل : المختال الذي ينظر إلى نفسه بعين الافتخار ، والفخور الذي ينظر إلى الناس بعين الاحتقار ، وكلاهما شرك خفي . والفخور بمنزلة المصراة تشد أخلافها ليجتمع فيها اللبن ، فيتوهم المشتري أن ذلك معتاد وليس كذلك ، فكذلك الذي يرى من نفسه حالا وزينة وهو مع ذلك مدع فهو الفخور .\nوالله لا يحب كل مختال فخور\n                                    ",
        "saadi": "لِّكَيۡلَا تَأۡسَوۡاْ عَلَىٰ مَا فَاتَكُمۡ وَلَا تَفۡرَحُواْ بِمَآ ءَاتَىٰكُمۡۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٍ ٣٢\n                                        \n                                        \n                                        \n                                        فلا يأسوا ويحزنوا على ما فاتهم، مما طمحت له أنفسهم وتشوفوا إليه، لعلمهم أن ذلك مكتوب في اللوح المحفوظ، لا بد من نفوذه ووقوعه، فلا سبيل إلى دفعه، ولا يفرحوا بما آتاهم الله فرح بطر وأشر، لعلمهم أنهم ما أدركوه بحولهم وقوتهم، وإنما أدركوه بفضل الله ومنه، فيشتغلوا بشكر من أولى النعم ودفع النقم، ولهذا قال: { وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ } أي: متكبر فظ غليظ، معجب بنفسه، فخور بنعم الله، ينسبها إلى نفسه، وتطغيه وتلهيه، كما قال تبارك وتعالى: { ثُمَّ إِذَا خَوَّلْنَاهُ نِعْمَةً مِنَّا قَالَ إِنَّمَا أُوتِيتُهُ عَلَى عِلْمٍ بل هي فتنة }\n                                    "
      },
      "originalText": "لِّكَيۡلَا تَأۡسَوۡاْ عَلَىٰ مَا فَاتَكُمۡ وَلَا تَفۡرَحُواْ بِمَآ ءَاتَىٰكُمۡۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٍ ٣٢"
    },
    {
      "number": 5099,
      "text": "الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ ۗ وَمَنْ يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ",
      "surah": {
        "number": 57,
        "name": "سورة الحديد",
        "englishName": "Al-Hadid",
        "englishNameTranslation": "The Iron",
        "revelationType": "Medinan",
        "numberOfAyahs": 29
      },
      "numberInSurah": 24,
      "juz": 27,
      "manzil": 7,
      "page": 540,
      "ruku": 474,
      "hizbQuarter": 216,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ ٤٢\n                                    \n                                    \n                                    ثم قال : ( الذين يبخلون ويأمرون الناس بالبخل ) أي : يفعلون المنكر ويحضون الناس عليه ، ( ومن يتول ) أي : عن أمر الله وطاعته ( فإن الله هو الغني الحميد ) كما قال موسى عليه السلام : ( إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد ) [ إبراهيم : 8 ] .\n                                    ",
        "qortoby": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ ٤٢\n                                    \n                                    \n                                    قوله تعالى : الذين يبخلون أي : لا يحب المختالين الذين يبخلون ف \" الذين \" في موضع خفض نعتا للمختال . وقيل : رفع بابتداء أي : الذين يبخلون فالله غني عنهم . قيل : أراد رؤساء اليهود الذين يبخلون ببيان صفة محمد صلى الله عليه وسلم التي في كتبهم ، لئلا يؤمن به الناس فتذهب مأكلتهم ، قال السدي والكلبي . وقال سعيد بن جبير : الذين يبخلون يعني بالعلم ويأمرون الناس بالبخل أي : بألا يعلموا الناس شيئا . زيد بن أسلم : إنه البخل بأداء حق الله عز وجل . وقيل : إنه البخل بالصدقة والحقوق ، قال عامر بن عبد الله الأشعري . وقال طاوس : إنه البخل بما في يديه . وهذه الأقوال الثلاثة متقاربة المعنى . وفرق أصحاب الخواطر بين البخل والسخاء بفرقين ، أحدهما : أن البخيل الذي يلتذ بالإمساك . والسخي الذي يلتذ بالإعطاء . الثاني : أن البخيل الذي يعطي عند السؤال ، والسخي الذي يعطي بغير سؤال .\nومن يتول أي : عن الإيمان فإن الله غني عنه . ويجوز أن يكون لما حث على الصدقة أعلمهم أن الذين يبخلون بها ويأمرون الناس بالبخل بها فإن الله غني عنهم . وقراءة العامة بالبخل بضم الباء وسكون الخاء . وقرأ أنس وعبيد بن عمير ويحيى بن يعمر ومجاهد وحميد وابن محيصن وحمزة والكسائي \" بالبخل \" بفتحتين وهي لغة الأنصار . وقرأ أبو العالية وابن السميفع \" بالبخل \" بفتح الباء وإسكان الخاء . وعن نصر بن عاصم \" البخل \" بضمتين ، وكلها لغات مشهورة . وقد تقدم الفرق بين البخل والشح في آخر ( آل عمران ) .\nوقرأ نافع وابن عامر \" فإن الله الغني الحميد \" بغير \" هو \" . والباقون هو الغني على أن يكون فصلا . ويجوز أن يكون مبتدأ والغني خبره ، والجملة خبر \" إن \" . ومن حذفها فالأحسن أن يكون فصلا ، لأن حذف الفصل أسهل من حذف المبتدإ .\n                                    ",
        "saadi": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ ٤٢\n                                        \n                                        \n                                        \n                                        { الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ } أي: يجمعون بين الأمرين الذميمين، اللذين كل منهما كاف في الشر البخل: وهو منع الحقوق الواجبة، ويأمرون الناس بذلك، فلم يكفهم بخلهم، حتى أمروا الناس بذلك، وحثوهم على هذا الخلق الذميم، بقولهم وفعلهم، وهذا من إعراضهم عن طاعة ربهم وتوليهم عنها، { وَمَنْ يَتَوَلَّ } عن طاعة الله فلا يضر إلا نفسه، ولن يضر الله شيئا، { فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ } الذي غناه من لوازم ذاته، الذي له ملك السماوات والأرض، وهو الذي أغنى عباده وأقناهم، الحميد الذي له كل اسم حسن، ووصف كامل، وفعل جميل، يستحق أن يحمد عليه ويثنى ويعظم.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِۗ وَمَن يَتَوَلَّ فَإِنَّ ٱللَّهَ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ ٤٢"
    }
  ]
}