{
  "number": 543,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 5111,
      "text": "أَلَمْ تَرَ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ مَا يَكُونُ مِنْ نَجْوَىٰ ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَىٰ مِنْ ذَٰلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا ۖ ثُمَّ يُنَبِّئُهُمْ بِمَا عَمِلُوا يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ",
      "surah": {
        "number": 58,
        "name": "سورة المجادلة",
        "englishName": "Al-Mujaadila",
        "englishNameTranslation": "The Pleading Woman",
        "revelationType": "Medinan",
        "numberOfAyahs": 22
      },
      "numberInSurah": 7,
      "juz": 28,
      "manzil": 7,
      "page": 543,
      "ruku": 477,
      "hizbQuarter": 217,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ مَا يَكُونُ مِن نَّجۡوَىٰ ثَلَٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَآ أَدۡنَىٰ مِن ذَٰلِكَ وَلَآ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَيۡنَ مَا كَانُواْۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُواْ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ ٧\n                                    \n                                    \n                                    ثم قال تعالى مخبرا عن إحاطة علمه بخلقه واطلاعه عليهم ، وسماعه كلامهم ، ورؤيته مكانهم حيث كانوا وأين كانوا ، فقال : ( ألم تر أن الله يعلم ما في السماوات وما في الأرض ما يكون من نجوى ثلاثة ) أي : من سر ثلاثة ( إلا هو رابعهم ولا خمسة إلا هو سادسهم ولا أدنى من ذلك ولا أكثر إلا هو معهم أين ما كانوا ) أي : يطلع عليهم يسمع كلامهم وسرهم ونجواهم ، ورسله أيضا مع ذلك تكتب ما يتناجون به ، مع علم الله وسمعه لهم ، كما قال : ( ألم يعلموا أن الله يعلم سرهم ونجواهم وأن الله علام الغيوب ) [ التوبة : 78 ] وقال ( أم يحسبون أنا لا نسمع سرهم ونجواهم بلى ورسلنا لديهم يكتبون ) [ الزخرف : 80 ] ; ولهذا حكى غير واحد الإجماع على أن المراد بهذه الآية معية علم الله تعالى ولا شك في إرادة ذلك ولكن سمعه أيضا مع علمه محيط بهم ، وبصره نافذ فيهم ، فهو سبحانه مطلع على خلقه ، لا يغيب عنه من أمورهم شيء .\nثم قال : ( ثم ينبئهم بما عملوا يوم القيامة إن الله بكل شيء عليم ) قال الإمام أحمد : افتتح الآية بالعلم ، واختتمها بالعلم .\n                                    \n                                    \n                                    \n                                    ",
        "qortoby": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ مَا يَكُونُ مِن نَّجۡوَىٰ ثَلَٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَآ أَدۡنَىٰ مِن ذَٰلِكَ وَلَآ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَيۡنَ مَا كَانُواْۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُواْ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ ٧\n                                    \n                                    \n                                    قوله تعالى : ألم تر أن الله يعلم ما في السماوات وما في الأرض فلا يخفى عليه سر ولا علانية .\nما يكون من نجوى قراءه العامة بالياء ، لأجل الحائل بينهما . وقرأ أبو جعفر بن القعقاع والأعرج وأبو حيوة وعيسى \" ما تكون \" بالتاء لتأنيث الفعل . والنجوى : السرار ، وهو مصدر ، والمصدر قد يوصف به ، يقال : قوم نجوى أي : ذوو نجوى ، ومنه قوله تعالى : وإذ هم نجوى .\nوقوله تعالى : ثلاثة خفض بإضافة نجوى إليها . قال الفراء : ثلاثة نعت للنجوى فانخفضت ، وإن شئت أضفت نجوى إليها . ولو نصب على إضمار فعل جاز ، وهي قراءة ابن أبي عبلة \" ثلاثة \" و \" خمسة \" بالنصب على الحال بإضمار يتناجون ؛ لأن نجوى يدل عليه ؛ قاله الزمخشري . ويجوز رفع \" ثلاثة \" على البدل من موضع \" نجوى \" . ثم قيل : كل سرار نجوى . وقيل : النجوى : ما يكون من خلوة ثلاثة يسرون شيئا ويتناجون به . والسرار : ما كان بين اثنين .\nإلا هو رابعهم يعلم ويسمع نجواهم ، يدل عليه افتتاح الآية بالعلم ثم ختمها بالعلم . وقيل : \" النجوى \" من النجوة وهي ما ارتفع من الأرض ، فالمتناجيان يتناجيان ويخلوان بسرهما كخلو المرتفع من الأرض عما يتصل به ، والمعنى أن سمع الله محيط بكل كلام ، وقد سمع الله مجادلة المرأة التي ظاهر منها زوجها .\nولا أدنى من ذلك ولا أكثر قرأ سلام ويعقوب وأبو العالية ونصر وعيسى بالرفع على موضع من نجوى قبل دخول \" من \" لأن تقديره : ما يكون نجوى ، و ثلاثة يجوز أن يكون مرفوعا على محل لا مع أدنى كقولك : لا حول ولا قوة إلا بالله بفتح الحول ورفع القوة . ويجوز أن يكونا مرفوعين على الابتداء ، كقولك لا حول ولا قوة إلا بالله . وقد مضى في ( البقرة ) بيان هذا مستوفى . وقرأ الزهري وعكرمة \" أكبر \" بالباء . والعامة بالثاء وفتح الراء على اللفظ وموضعها جر . وقال الفراء في قوله : ما يكون من نجوى ثلاثة إلا هو رابعهم ولا خمسة إلا هو سادسهم قال : المعنى غير مصمود والعدد غير مقصود لأنه - تعالى - إنما قصد - وهو أعلم - أنه مع كل عدد قل أو كثر ، يعلم ما يقولون سرا وجهرا ولا تخفى عليه خافية ، فمن أجل ذلك اكتفى بذكر بعض العدد دون بعض . وقيل : معنى ذلك أن الله معهم بعلمه حيث كانوا من غير زوال ولا انتقال . ونزل ذلك في قوم من المنافقين كانوا فعلوا شيئا سرا فأعلم الله أنه لا يخفى عليه ذلك ، قال ابن عباس . وقال قتادة ومجاهد : نزلت في اليهود . ثم ينبئهم يخبرهم بما عملوا من حسن وسيئ يوم القيامة إن الله بكل شيء عليم .\n                                    \n                                    \n                                    \n                                    ",
        "saadi": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ مَا يَكُونُ مِن نَّجۡوَىٰ ثَلَٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَآ أَدۡنَىٰ مِن ذَٰلِكَ وَلَآ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَيۡنَ مَا كَانُواْۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُواْ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ ٧\n                                        \n                                        \n                                        \n                                        وأنه { مَا يَكُونُ مِنْ نَجْوَى ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَى مِنْ ذَلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَمَا كَانُوا } والمراد بهذه المعية معية العلم والإحاطة بما تناجوا به وأسروه فيما بينهم، ولهذا قال: { إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ } ثم قال تعالى:\n                                    \n                                        \n                                        \n                                        \n                                    "
      },
      "originalText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ مَا يَكُونُ مِن نَّجۡوَىٰ ثَلَٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَآ أَدۡنَىٰ مِن ذَٰلِكَ وَلَآ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَيۡنَ مَا كَانُواْۖ ثُمَّ يُنَبِّئُهُم بِمَا عَمِلُواْ يَوۡمَ ٱلۡقِيَٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَيۡءٍ عَلِيمٌ ٧"
    },
    {
      "number": 5112,
      "text": "أَلَمْ تَرَ إِلَى الَّذِينَ نُهُوا عَنِ النَّجْوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُوا عَنْهُ وَيَتَنَاجَوْنَ بِالْإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُولِ وَإِذَا جَاءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللَّهُ وَيَقُولُونَ فِي أَنْفُسِهِمْ لَوْلَا يُعَذِّبُنَا اللَّهُ بِمَا نَقُولُ ۚ حَسْبُهُمْ جَهَنَّمُ يَصْلَوْنَهَا ۖ فَبِئْسَ الْمَصِيرُ",
      "surah": {
        "number": 58,
        "name": "سورة المجادلة",
        "englishName": "Al-Mujaadila",
        "englishNameTranslation": "The Pleading Woman",
        "revelationType": "Medinan",
        "numberOfAyahs": 22
      },
      "numberInSurah": 8,
      "juz": 28,
      "manzil": 7,
      "page": 543,
      "ruku": 477,
      "hizbQuarter": 217,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نُهُواْ عَنِ ٱلنَّجۡوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنۡهُ وَيَتَنَٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِۖ وَإِذَا جَآءُوكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِيٓ أَنفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ يَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِيرُ ٨\n                                    \n                                    \n                                    قال ابن أبي نجيح ، عن مجاهد في قوله ( ألم تر إلى الذين نهوا عن النجوى ) قال : اليهود وكذا قال مقاتل بن حيان ، وزاد : كان بين النبي - صلى الله عليه وسلم - وبين اليهود موادعة ، وكانوا إذا مر بهم رجل من أصحاب النبي - صلى الله عليه وسلم - جلسوا يتناجون بينهم ، حتى يظن المؤمن أنهم يتناجون بقتله - أو : بما يكره المؤمن - فإذا رأى المؤمن ذلك خشيهم ، فترك طريقه عليهم . فنهاهم النبي - صلى الله عليه وسلم - عن النجوى ، فلم ينتهوا وعادوا إلى النجوى ، فأنزل الله : ( ألم تر إلى الذين نهوا عن النجوى ثم يعودون لما نهوا عنه ) .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا إبراهيم بن المنذر الحزامي ، حدثني سفيان بن حمزة ، عن كثير ، عن زيد ، عن ربيح بن عبد الرحمن بن أبي سعيد الخدري ، عن أبيه ، عن جده قال : كنا نتناوب رسول الله - صلى الله عليه وسلم - نبيت عنده ; يطرقه من الليل أمر وتبدو له حاجة . فلما كانت ذات ليلة كثر أهل النوب والمحتسبون حتى كنا أندية نتحدث ، فخرج علينا رسول الله - صلى الله عليه وسلم - فقال : \" ما هذا النجوى ؟ ألم تنهوا عن النجوى ؟ \" . قلنا : تبنا إلى الله يا رسول الله ، إنا كنا في ذكر المسيح فرقا منه . فقال : \" ألا أخبركم بما هو أخوف عليكم عندي منه ؟ \" . قلنا : بلى يا رسول الله ، قال : \" الشرك الخفي ، أن يقوم الرجل يعمل لمكان رجل \" . هذا إسناد غريب ، وفيه بعض الضعفاء\nوقوله : ( ويتناجون بالإثم والعدوان ومعصيت الرسول ) أي : يتحدثون فيما بينهم بالإثم ، وهو ما يختص بهم ، والعدوان وهو ما يتعلق بغيرهم ، ومنه معصية الرسول ومخالفته ، يصرون عليها ويتواصون بها .\nوقوله : ( وإذا جاءوك حيوك بما لم يحيك به الله ) قال ابن أبي حاتم :\nحدثنا أبو سعيد الأشج ، حدثنا ابن نمير ، عن الأعمش ، عن مسلم عن مسروق ، عن عائشة قالت : دخل على رسول الله - صلى الله عليه وسلم - يهود فقالوا : السام عليك يا أبا القاسم . فقالت عائشة : وعليكم السام واللعنة قالت : فقال رسول الله - صلى الله عليه وسلم - : \" يا عائشة ، إن الله لا يحب الفحش ولا التفحش \" . قلت : ألا تسمعهم يقولون : السام عليك ؟ فقال رسول الله : \" أوما سمعت أقول : وعليكم ؟ \" . فأنزل الله : ( وإذا جاءوك حيوك بما لم يحيك به الله )\nوفي رواية في الصحيح أنها قالت لهم : عليكم السام والذام واللعنة . وأن رسول الله - صلى الله عليه وسلم - قال : \" إنه يستجاب لنا فيهم ، ولا يستجاب لهم فينا \"\nوقال ابن جرير : حدثنا بشر ، حدثنا يزيد ، حدثنا سعيد ، عن قتادة ، عن أنس بن مالك : أن رسول الله - صلى الله عليه وسلم - بينما هو جالس مع أصحابه ، إذ أتى عليهم يهودي فسلم عليهم ، فردوا عليه ، فقال نبي الله - صلى الله عليه وسلم - : \" هل تدرون ما قال ؟ \" . قالوا : سلم يا رسول الله . قال : \" بل قال : سام عليكم ، أي : تسامون دينكم \" . قال رسول الله : \" ردوه \" . فردوه عليه . فقال نبي الله : \" أقلت : سام عليكم ؟ \" . قال : نعم . فقال رسول الله - صلى الله عليه وسلم - : \" إذا سلم عليكم أحد من أهل الكتاب فقولوا : عليك \" أي : عليك ما قلت\nوأصل حديث أنس مخرج في الصحيح ، وهذا الحديث في الصحيح عن عائشة بنحوه\nوقوله : ( ويقولون في أنفسهم لولا يعذبنا الله بما نقول ) أي : يفعلون هذا ، ويقولون ما يحرفون من الكلام وإيهام السلام ، وإنما هو شتم في الباطن ، ومع هذا يقولون في أنفسهم : لو كان هذا نبيا لعذبنا الله بما نقول له في الباطن ; لأن الله يعلم ما نسره ، فلو كان هذا نبيا حقا لأوشك أن يعاجلنا الله بالعقوبة في الدنيا ، فقال الله تعالى : ( حسبهم جهنم ) أي : جهنم كفايتهم في الدار الآخرة ( يصلونها فبئس المصير )\nوقال الإمام أحمد : حدثنا عبد الصمد ، حدثنا حماد ، عن عطاء بن السائب ، عن أبيه ، عن عبد الله بن عمرو أن اليهود كانوا يقولون لرسول الله - صلى الله عليه وسلم - : سام عليك ، ثم يقولون في أنفسهم : ( لولا يعذبنا الله بما نقول ) ؟ ، فنزلت هذه الآية : ( وإذا جاءوك حيوك بما لم يحيك به الله ويقولون في أنفسهم لولا يعذبنا الله بما نقول حسبهم جهنم يصلونها فبئس المصير ) إسناد حسن ولم يخرجوه\nوقال العوفي ، عن ابن عباس : ( وإذا جاءوك حيوك بما لم يحيك به الله ) قال : كان المنافقون يقولون لرسول الله إذا حيوه : \" سام عليك \" قال الله : ( حسبهم جهنم يصلونها فبئس المصير ) .\n                                    \n                                    \n                                    \n                                    ",
        "qortoby": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نُهُواْ عَنِ ٱلنَّجۡوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنۡهُ وَيَتَنَٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِۖ وَإِذَا جَآءُوكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِيٓ أَنفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ يَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِيرُ ٨\n                                    \n                                    \n                                    قوله تعالى : ألم تر إلى الذين نهوا عن النجوى ثم يعودون لما نهوا عنه ويتناجون بالإثم والعدوان ومعصية الرسول وإذا جاءوك حيوك بما لم يحيك به الله ويقولون في أنفسهم لولا يعذبنا الله بما نقول حسبهم جهنم يصلونها فبئس المصير\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : ألم تر إلى الذين نهوا عن النجوى ثم يعودون لما نهوا عنه قيل : إن هذا في اليهود والمنافقين حسب ما قدمناه . وقيل : في المسلمين . قال ابن عباس : نزلت في اليهود والمنافقين ؛ كانوا يتناجون فيما بينهم ، وينظرون للمؤمنين ويتغامزون بأعينهم ، فيقول المؤمنون : لعلهم بلغهم عن إخواننا وقرابتنا من المهاجرين والأنصار قتل أو مصيبة أو هزيمة ، ويسوءهم ذلك ، فكثرت شكواهم إلى النبي صلى الله عليه وسلم ، فنهاهم عن النجوى فلم ينتهوا فنزلت . وقال مقاتل : كان بين النبي صلى الله عليه وسلم وبين اليهود موادعة ، فإذا مر بهم رجل من المؤمنين تناجوا بينهم حتى يظن المؤمن شرا ، فيعرج عن طريقه ، فنهاهم رسول الله صلى الله عليه وسلم فلم ينتهوا ؛ فنزلت . وقال عبد الرحمن بن زيد بن أسلم : كان الرجل يأتي النبي صلى الله عليه وسلم فيسأل الحاجة ويناجيه والأرض يومئذ حرب ، فيتوهمون أنه يناجيه في حرب أو بلية أو أمر مهم فيفزعون لذلك فنزلت .\nالثانية : روى أبو سعيد الخدري قال : كنا ذات ليلة نتحدث إذ خرج علينا رسول الله صلى الله عليه وسلم فقال : ما هذه النجوى ألم تنهوا عن النجوى فقلنا : تبنا إلى الله يا رسول الله ، إنا كنا في ذكر المسيخ - يعني الدجال - فرقا منه . فقال : ألا أخبركم بما هو أخوف عندي منه ؟ قلنا : بلى يا رسول الله ، قال : الشرك الخفي أن يقوم الرجل يعمل لمكان رجل ذكره الماوردي .\nوقرأ حمزة وخلف ورويس عن يعقوب \" وينتجون \" في وزن يفتعلون وهي قراءة عبد الله وأصحابه . وقرأ الباقون \" ويتناجون \" في وزن يتفاعلون ، واختاره أبو عبيد وأبو حاتم ، لقوله تعالى : إذا تناجيتم و تناجوا . النحاس : وحكى سيبويه أن تفاعلوا وافتعلوا يأتيان بمعنى واحد ، نحو تخاصموا واختصموا ، وتقاتلوا واقتتلوا فعلى هذا يتناجون و \" ينتجون \" واحد . ومعنى بالإثم والعدوان أي : الكذب والظلم .\nومعصية الرسول أي : مخالفته . وقرأ الضحاك ومجاهد وحميد \" ومعصيات الرسول \" بالجمع .\nالثالثة : قوله تعالى : وإذا جاءوك حيوك بما لم يحيك به الله لا خلاف بين النقلة أن المراد بها اليهود ، كانوا يأتون النبي صلى الله عليه وسلم فيقولون : السام عليك . يريدون بذلك السلام ظاهرا وهم يعنون الموت باطنا ، فيقول النبي صلى الله عليه وسلم : عليكم في رواية ، وفي رواية أخرى : وعليكم . قال ابن العربي : وهي مشكلة . وكانوا يقولون : لو كان محمد نبيا لما أمهلنا الله بسبه والاستخفاف به ، وجهلوا أن الباري تعالى حليم لا يعاجل من سبه ، فكيف من سب نبيه . وقد ثبت أن النبي صلى الله عليه وسلم قال : لا أحد أصبر على الأذى من الله ، يدعون له الصاحبة والولد وهو يعافيهم ويرزقهم فأنزل الله تعالى هذا كشفا لسرائرهم ، وفضحا لبواطنهم ، معجزة لرسوله صلى الله عليه وسلم . وقد ثبت عن قتادة عن أنس أن يهوديا أتى على رسول الله صلى الله عليه وسلم وعلى أصحابه فقال : السام عليكم . فرد عليه النبي صلى الله عليه وسلم وقال : أتدرون ما قال هذا ؟ قالوا : الله ورسوله أعلم . قال : قال : \" كذا ردوه علي \" فردوه ، قال : \" قلت السام عليكم \" قال : نعم . فقال النبي صلى الله عليه وسلم عند ذلك : إذا سلم عليكم أهل الكتاب فقولوا عليك ما قلت فأنزل الله تعالى : وإذا جاءوك حيوك بما لم يحيك به الله .\nقلت : خرجه الترمذي وقال هذا حديث حسن صحيح . وثبت عن عائشة أنها قالت : جاء أناس من اليهود إلى النبي صلى الله عليه وسلم فقالوا : السام عليك يا أبا القاسم . فقلت : السام عليكم وفعل الله بكم وفعل . فقال عليه السلام : مه يا عائشة فإن الله لا يحب الفحش ولا التفحش فقلت : يا رسول الله ألست ترى ما يقولون ؟ فقال : ألست ترين أرد عليهم ما يقولون أقول وعليكم فنزلت هذه الآية بما لم يحيك به الله أي : إن الله سلم عليك وهم يقولون السام عليك ، والسام الموت . خرجه البخاري ومسلم بمعناه . وفي الصحيحين من حديث أنس بن مالك رضي الله عنه قال : قال النبي صلى الله عليه وسلم : إذا سلم عليكم أهل الكتاب فقولوا وعليكم كذا الرواية \" وعليكم \" بالواو ، تكلم عليها العلماء ، لأن الواو العاطفة يقتضي التشريك فيلزم منه أن يدخل معهم فيما دعوا به علينا من الموت ، أو من سآمة ديننا وهو الملال . يقال : سئم يسأم سآمة وسآما . فقال بعضهم : الواو زائدة كما زيدت في قول الشاعر :\nفلما أجزنا ساحة الحي وانتحى\nأي : لما أجزنا انتحى ، فزاد الواو . وقال بعضهم : هي للاستئناف ، كأنه قال : والسام عليكم . وقال بعضهم : هي على بابها من العطف ولا يضرنا ذلك ، لأنا نجاب عليهم ولا يجابون علينا ، كما قال النبي صلى الله عليه وسلم . روى الزبير أنه سمع جابر بن عبد الله يقول : سلم ناس من يهود على رسول الله صلى الله عليه وسلم ، فقالوا : السام عليك يا أبا القاسم ، فقال : وعليكم فقالت عائشة وغضبت : ألم تسمع ما قالوا ؟ قال : بلى قد سمعت فرددت عليهم ، وإنا نجاب عليهم ولا يجابون علينا خرجه مسلم . ورواية الواو أحسن معنى ، وإثباتها أصح رواية وأشهر .\nوقد اختلف في رد السلام على أهل الذمة هل هو واجب كالرد على المسلمين ، وإليه ذهب ابن عباس والشعبي وقتادة ، للأمر بذلك . وذهب مالك فيما روى عنه أشهب وابن وهب إلى أن ذلك ليس بواجب فإن رددت فقل : عليك . وقد اختار ابن طاوس أن يقول في الرد عليهم : علاك السلام أي : ارتفع عنك . واختار بعض أصحابنا : \" السلام \" بكسر السين ، يعني الحجارة . وما قاله مالك أولى اتباعا للسنة ، والله أعلم . وروى مسروق عن عائشة قالت : أتى النبي صلى الله عليه وسلم ناس من اليهود ، فقالوا : السام عليك يا أبا القاسم ، قال : وعليكم ، قالت عائشة : قلت : بل عليكم السام والذام . فقال رسول الله صلى الله عليه وسلم : يا عائشة لا تكوني فاحشة فقالت : ما سمعت ما قالوا ؟ فقال : أوليس قد رددت عليهم الذي قالوا قلت : وعليكم . وفي رواية قال : ففطنت بهم عائشة فسبتهم ، فقال رسول الله صلى الله عليه وسلم : مه يا عائشة فإن الله لا يحب الفحش والتفحش وزاد : فأنزل الله تبارك وتعالى : وإذا جاءوك حيوك بما لم يحيك به الله إلى آخر الآية . \" الذام \" بتخفيف الميم هو العيب ، وفي المثل ( لا تعدم الحسناء ذاما ) أي : عيبا ، ويهمز ولا يهمز ، يقال : ذأمه يذأمه ، مثل ذأب يذأب ، والمفعول \" مذءوم \" مهموزا ، ومنه مذءوما مدحورا ويقال : ذامه يذومه مخففا كرامه يرومه .\nقوله تعالى : ويقولون في أنفسهم لولا يعذبنا الله بما نقول قالوا : لو كان محمد نبيا لعذبنا الله بما نقول فهلا يعذبنا الله . وقيل : قالوا : إنه يرد علينا ويقول : وعليكم السام والسام الموت ، فلو كان نبيا لاستجيب له فينا ومتنا . وهذا موضع تعجب منهم ؛ فإنهم كانوا أهل كتاب ، وكانوا يعلمون أن الأنبياء قد يغضبون فلا يعاجل من يغضبهم بالعذاب .\nحسبهم جهنم يصلونها أي : كافيهم جهنم عقابا غدا فبئس المصير أي : المرجع .\n                                    \n                                    \n                                    \n                                    ",
        "saadi": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نُهُواْ عَنِ ٱلنَّجۡوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنۡهُ وَيَتَنَٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِۖ وَإِذَا جَآءُوكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِيٓ أَنفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ يَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِيرُ ٨\n                                        \n                                        \n                                        \n                                        النجوى هي: التناجي بين اثنين فأكثر، وقد تكون في الخير، وتكون في الشر.\nفأمر الله تعالى المؤمنين أن يتناجوا بالبر، وهو اسم جامع لكل خير وطاعة، وقيام بحق لله ولعباده والتقوى، وهي [هنا]: اسم جامع لترك جميع المحارم والمآثم، فالمؤمن يمتثل هذا الأمر الإلهي، فلا تجده مناجيا ومتحدثا إلا بما يقربه من الله، ويباعده من سخطه، والفاجر يتهاون بأمر الله، ويناجي بالإثم والعدوان ومعصية الرسول، كالمنافقين الذين هذا دأبهم وحالهم مع الرسول صلى الله عليه وسلم.\nقال تعالى { وَإِذَا جَاءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللَّهُ } أي: يسيئون الأدب معك في تحيتهم لك، { وَيَقُولُونَ فِي أَنْفُسِهِمْ } أي: يسرون في أنفسهم ما ذكره عالم الغيب والشهادة عنهم، وهو قولهم: { لَوْلَا يُعَذِّبُنَا اللَّهُ بِمَا نَقُولُ } ومعنى ذلك أنهم يتهاونون بذلك، ويستدلون بعدم تعجيل العقوبة عليهم، أن ما يقولون غير محذور، قال تعالى في بيان أنه يمهل ولا يهمل: { حَسْبُهُمْ جَهَنَّمُ يَصْلَوْنَهَا فَبِئْسَ الْمَصِيرُ } أي: تكفيهم جهنم التي جمعت كل شقاء وعذاب [عليهم]، تحيط بهم، ويعذبون بها { فَبِئْسَ الْمَصِيرُ } وهؤلاء المذكورون إما أناس من المنافقين يظهرون الإيمان، ويخاطبون الرسول صلى الله عليه وسلم بهذا الخطاب الذي يوهمون أنهم أرادوا به خيرا وهم كذبة في ذلك، وإما أناس من أهل الكتاب، الذين إذا سلموا على النبي صلى الله عليه وسلم، قالوا: \"السام عليك يا محمد\" يعنون بذلك الموت.\n                                    \n                                        \n                                        \n                                        \n                                    "
      },
      "originalText": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نُهُواْ عَنِ ٱلنَّجۡوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنۡهُ وَيَتَنَٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِۖ وَإِذَا جَآءُوكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِيٓ أَنفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ يَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِيرُ ٨"
    },
    {
      "number": 5113,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَنَاجَيْتُمْ فَلَا تَتَنَاجَوْا بِالْإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُولِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوَىٰ ۖ وَاتَّقُوا اللَّهَ الَّذِي إِلَيْهِ تُحْشَرُونَ",
      "surah": {
        "number": 58,
        "name": "سورة المجادلة",
        "englishName": "Al-Mujaadila",
        "englishNameTranslation": "The Pleading Woman",
        "revelationType": "Medinan",
        "numberOfAyahs": 22
      },
      "numberInSurah": 9,
      "juz": 28,
      "manzil": 7,
      "page": 543,
      "ruku": 477,
      "hizbQuarter": 217,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا تَنَٰجَيۡتُمۡ فَلَا تَتَنَٰجَوۡاْ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِ وَتَنَٰجَوۡاْ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ ٩\n                                    \n                                    \n                                    ثم قال الله مؤدبا عباده المؤمنين ألا يكونوا مثل الكفرة والمنافقين : ( يا أيها الذين آمنوا إذا تناجيتم فلا تتناجوا بالإثم والعدوان ومعصيت الرسول ) أي : كما يتناجى به الجهلة من كفرة أهل الكتاب ومن مالأهم على ضلالهم من المنافقين ، ( وتناجوا بالبر والتقوى واتقوا الله الذي إليه تحشرون ) أي : فيخبركم بجميع أعمالكم وأقوالكم التي أحصاها عليكم ، وسيجزيكم بها .\nقال الإمام أحمد : حدثنا بهز ، وعفان قالا : أخبرنا همام ، حدثنا قتادة ، عن صفوان بن محرز قال : كنت آخذا بيد ابن عمر ، إذ عرض له رجل فقال : كيف سمعت رسول الله - صلى الله عليه وسلم - يقول في النجوى يوم القيامة ؟ قال : سمعت رسول الله - صلى الله عليه وسلم - يقول : \" إن الله يدني المؤمن فيضع عليه كنفه ويستره من الناس ، ويقرره بذنوبه ، ويقول له : أتعرف ذنب كذا ؟ أتعرف ذنب كذا ؟ أتعرف ذنب كذا ؟ حتى إذا قرره بذنوبه ورأى في نفسه أن قد هلك ، قال : فإني قد سترتها عليك في الدنيا ، وأنا أغفرها لك اليوم . ثم يعطى كتاب حسناته ، وأما الكفار والمنافقون فيقول الأشهاد : هؤلاء الذين كذبوا على ربهم ، ألا لعنة الله على الظالمين \" .\nأخرجاه في الصحيحين من حديث قتادة\n                                    \n                                    \n                                    \n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا تَنَٰجَيۡتُمۡ فَلَا تَتَنَٰجَوۡاْ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِ وَتَنَٰجَوۡاْ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ ٩\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا إذا تناجيتم فلا تتناجوا بالإثم والعدوان ومعصية الرسول وتناجوا بالبر والتقوى واتقوا الله الذي إليه تحشرون\nقوله تعالى : يا أيها الذين آمنوا إذا نهى المؤمنين أن يتناجوا فيما بينهم كفعل المنافقين واليهود فقال : يا أيها الذين آمنوا إذا تناجيتم أي : تساررتم .\nفلا تتناجوا هذه قراءة العامة . وقرأ يحيى بن وثاب وعاصم ورويس عن يعقوب \" فلا تنتجوا \" من الانتجاء بالإثم والعدوان ومعصية الرسول وتناجوا بالبر أي : بالطاعة والتقوى بالعفاف عما نهى الله عنه . وقيل : الخطاب للمنافقين ، أي : يا أيها الذين آمنوا بزعمهم . وقيل : أي : يا أيها الذين آمنوا بموسى . واتقوا الله الذي إليه تحشرون أي : تجمعون في الآخرة .\n                                    \n                                    \n                                    \n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا تَنَٰجَيۡتُمۡ فَلَا تَتَنَٰجَوۡاْ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِ وَتَنَٰجَوۡاْ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ ٩\n                                        \n                                        \n                                        \n                                        يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا تَنَاجَيْتُمْ فَلَا تَتَنَاجَوْا بِالْإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَتِ الرَّسُولِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوَىٰ ۖ وَاتَّقُوا اللَّهَ الَّذِي إِلَيْهِ تُحْشَرُونَ\n                                    \n                                        \n                                        \n                                        \n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا تَنَٰجَيۡتُمۡ فَلَا تَتَنَٰجَوۡاْ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِ وَتَنَٰجَوۡاْ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ ٩"
    },
    {
      "number": 5114,
      "text": "إِنَّمَا النَّجْوَىٰ مِنَ الشَّيْطَانِ لِيَحْزُنَ الَّذِينَ آمَنُوا وَلَيْسَ بِضَارِّهِمْ شَيْئًا إِلَّا بِإِذْنِ اللَّهِ ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
      "surah": {
        "number": 58,
        "name": "سورة المجادلة",
        "englishName": "Al-Mujaadila",
        "englishNameTranslation": "The Pleading Woman",
        "revelationType": "Medinan",
        "numberOfAyahs": 22
      },
      "numberInSurah": 10,
      "juz": 28,
      "manzil": 7,
      "page": 543,
      "ruku": 477,
      "hizbQuarter": 217,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّيۡطَٰنِ لِيَحۡزُنَ ٱلَّذِينَ ءَامَنُواْ وَلَيۡسَ بِضَآرِّهِمۡ شَيۡ‍ًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٠١\n                                    \n                                    \n                                    ثم قال تعالى : ( إنما النجوى من الشيطان ليحزن الذين آمنوا وليس بضارهم شيئا إلا بإذن الله وعلى الله فليتوكل المؤمنون ) أي : إنما النجوى - وهي المسارة - حيث يتوهم مؤمن بها سوءا ( من الشيطان ليحزن الذين آمنوا ) يعني : إنما يصدر هذا من المتناجين عن تسويل الشيطان وتزيينه ، ( ليحزن الذين آمنوا ) أي : ليسوءهم ، وليس ذلك بضارهم شيئا إلا بإذن الله ، ومن أحس من ذلك شيئا فليستعذ بالله وليتوكل على الله ، فإنه لا يضره شيء بإذن الله .\nوقد وردت السنة بالنهي عن التناجي حيث يكون في ذلك تأذ على مؤمن ، كما قال الإمام أحمد : حدثنا وكيع ، وأبو معاوية قالا : حدثنا الأعمش ، عن أبي وائل ، عن عبد الله بن مسعود قال : قال رسول الله - صلى الله عليه وسلم - : \" إذا كنتم ثلاثة فلا يتناجين اثنان دون صاحبهما ، فإن ذلك يحزنه \" . وأخرجاه من حديث الأعمش\nوقال عبد الرزاق ، أخبرنا معمر ، عن أيوب ، عن نافع ، عن ابن عمر قال : قال رسول الله - صلى الله عليه وسلم - : \" إذا كنتم ثلاثة فلا يتناج اثنان دون الثالث إلا بإذنه ; فإن ذلك يحزنه \" . انفرد بإخراجه مسلم عن أبي الربيع ، وأبي كامل ، كلاهما عن حماد بن زيد ، عن أيوب به\n                                    \n                                    \n                                    \n                                    ",
        "qortoby": "إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّيۡطَٰنِ لِيَحۡزُنَ ٱلَّذِينَ ءَامَنُواْ وَلَيۡسَ بِضَآرِّهِمۡ شَيۡ‍ًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٠١\n                                    \n                                    \n                                    قوله تعالى : إنما النجوى من الشيطان ليحزن الذين آمنوا وليس بضارهم شيئا إلا بإذن الله وعلى الله فليتوكل المؤمنون\nفيه مسألتان :\nالأولى : قوله تعالى : إنما النجوى من الشيطان أي : من تزيين الشياطين ليحزن الذين آمنوا إذ توهموا أن المسلمين أصيبوا في السرايا ، أو إذا أجروا اجتماعهم على مكايدة المسلمين ، وربما كانوا يناجون النبي صلى الله عليه وسلم فيظن المسلمون أنهم ينتقصونهم عند النبي صلى الله عليه وسلموليس بضارهم أي : التناجي شيئا إلا بإذن الله أي : بمشيئته وقيل : بعلمه . وعن ابن عباس : بأمره .\nوعلى الله فليتوكل المؤمنون أي : يكلون أمرهم إليه ، ويفوضون جميع شئونهم إلى عونه ، ويستعيذون به من الشيطان ومن كل شر ، فهو الذي سلط الشيطان بالوساوس ابتلاء للعبد وامتحانا ولو شاء لصرفه عنه .\nالثانية : في الصحيحين عن ابن عمر أن رسول الله صلى الله عليه وسلم قال : إذا كان ثلاثة فلا يتناجى اثنان دون الواحد . وعن عبد الله بن مسعود قال : قال رسول الله صلى الله عليه وسلم : إذا كنتم ثلاثة فلا يتناجى اثنان دون الآخر حتى تختلطوا بالناس من أجل أن يحزنه فبين في هذا الحديث غاية المنع وهي أن يجد الثالث من يتحدث معه كما فعل ابن عمر ، ذلك أنه كان يتحدث مع رجل فجاء آخر يريد أن يناجيه فلم يناجه حتى دعا رابعا ، فقال له وللأول : تأخرا وناجى الرجل الطالب للمناجاة . خرجه الموطأ . وفيه أيضا التنبيه على التعليل بقوله : من أجل أن يحزنه أي : يقع في نفسه ما يحزن لأجله . وذلك بأن يقدر في نفسه أن الحديث عنه بما يكره ، أو أنه لم يروه أهلا ليشركوه في حديثهم ، إلى غير ذلك من ألقيات الشيطان وأحاديث النفس . وحصل ذلك كله من بقائه وحده ، فإذا كان معه غيره أمن ذلك ، وعلى هذا يستوي في ذلك كل الأعداد ، فلا يتناجى أربعة دون واحد ولا عشرة ولا ألف مثلا ؛ لوجود ذلك المعنى في حقه ، بل وجوده في العدد الكثير أمكن وأوقع ، فيكون بالمنع أولى . وإنما خص الثلاثة بالذكر ، لأنه أول عدد يتأتى ذلك المعنى فيه . وظاهر الحديث يعم جميع الأزمان والأحوال ، وإليه ذهب ابن عمر ومالك والجمهور . وسواء أكان التناجي في مندوب أو مباح أو واجب فإن الحزن يقع به . وقد ذهب بعض الناس إلى أن ذلك كان في أول الإسلام ، لأن ذلك كان في حال المنافقين فيتناجى المنافقون دون المؤمنين ، فلما فشا الإسلام سقط ذلك . وقال بعضهم : ذلك خاص بالسفر في المواضع التي لا يأمن الرجل فيها صاحبه ، فأما في الحضر وبين العمارة فلا ، فإنه يجد من يعينه ، بخلاف السفر فإنه مظنة الاغتيال وعدم المغيث . والله أعلم .\n                                    \n                                    \n                                    \n                                    ",
        "saadi": "إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّيۡطَٰنِ لِيَحۡزُنَ ٱلَّذِينَ ءَامَنُواْ وَلَيۡسَ بِضَآرِّهِمۡ شَيۡ‍ًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٠١\n                                        \n                                        \n                                        \n                                        يقول تعالى: { إِنَّمَا النَّجْوَى } أي: تناجي أعداء المؤمنين بالمؤمنين، بالمكر والخديعة، وطلب السوء من الشيطان، الذي كيده ضعيف ومكره غير مفيد.\n{ لِيَحزن الَّذِينَ آمَنُوا } هذا غاية هذا المكر ومقصوده، { وَلَيْسَ بِضَارِّهِمْ شَيْئًا إِلَّا بِإِذْنِ اللَّهِ } فإن الله تعالى وعد المؤمنين بالكفاية والنصر على الأعداء، وقال تعالى: { وَلَا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلَّا بِأَهْلِهِ } فأعداء الله ورسوله والمؤمنين، مهما تناجوا ومكروا، فإن ضرر ذلك عائد إلى أنفسهم، ولا يضر المؤمنين إلا شيء قدره الله وقضاه، { وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ } أي: ليعتمدوا عليه ويثقوا بوعده، فإن من توكل على الله كفاه، وتولى أمر دينه ودنياه\n                                    \n                                        \n                                        \n                                        \n                                    "
      },
      "originalText": "إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّيۡطَٰنِ لِيَحۡزُنَ ٱلَّذِينَ ءَامَنُواْ وَلَيۡسَ بِضَآرِّهِمۡ شَيۡ‍ًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٠١"
    },
    {
      "number": 5115,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قِيلَ لَكُمْ تَفَسَّحُوا فِي الْمَجَالِسِ فَافْسَحُوا يَفْسَحِ اللَّهُ لَكُمْ ۖ وَإِذَا قِيلَ انْشُزُوا فَانْشُزُوا يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "surah": {
        "number": 58,
        "name": "سورة المجادلة",
        "englishName": "Al-Mujaadila",
        "englishNameTranslation": "The Pleading Woman",
        "revelationType": "Medinan",
        "numberOfAyahs": 22
      },
      "numberInSurah": 11,
      "juz": 28,
      "manzil": 7,
      "page": 543,
      "ruku": 477,
      "hizbQuarter": 217,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِ فَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ١١\n                                    \n                                    \n                                    يقول تعالى مؤدبا عباده المؤمنين ، وآمرا لهم أن يحسن بعضهم إلى بعض في المجالس : ( يا أيها الذين آمنوا إذا قيل لكم تفسحوا في المجالس ) وقرئ ) في المجلس ) ( فافسحوا يفسح الله لكم ) وذلك أن الجزاء من جنس العمل ، كما جاء في الحديث الصحيح : \" من بنى لله مسجدا بنى الله له بيتا في الجنة \" وفي الحديث الآخر : \" ومن يسر على معسر يسر الله عليه في الدنيا والآخرة ، ومن ستر مسلما ستره الله في الدنيا والآخرة ، والله في عون العبد ما كان العبد في عون أخيه \" ولهذا أشباه كثيرة ; ولهذا قال : ( فافسحوا يفسح الله لكم ) .\nقال قتادة : نزلت هذه الآية في مجالس الذكر ، وذلك أنهم كانوا إذا رأوا أحدهم مقبلا ضنوا بمجالسهم عند رسول الله - صلى الله عليه وسلم - فأمرهم الله أن يفسح بعضهم لبعض .\nوقال مقاتل بن حيان : أنزلت هذه الآية يوم جمعة وكان رسول الله - صلى الله عليه وسلم - يومئذ في الصفة ، وفي المكان ضيق ، وكان يكرم أهل بدر من المهاجرين والأنصار ، فجاء ناس من أهل بدر وقد سبقوا إلى المجالس ، فقاموا حيال رسول الله - صلى الله عليه وسلم - فقالوا : السلام عليك أيها النبي ورحمة الله وبركاته . فرد النبي - صلى الله عليه وسلم - ثم سلموا على القوم بعد ذلك ، فردوا عليهم ، فقاموا على أرجلهم ينتظرون أن يوسع لهم ، فعرف النبي - صلى الله عليه وسلم - ما يحملهم على القيام ، فلم يفسح لهم ، فشق ذلك على النبي - صلى الله عليه وسلم - فقال لمن حوله من المهاجرين والأنصار ، من غير أهل بدر : \" قم يا فلان ، وأنت يا فلان \" . فلم يزل يقيمهم بعدة النفر الذين هم قيام بين يديه من المهاجرين والأنصار من أهل بدر ، فشق ذلك على من أقيم من مجلسه ، وعرف النبي - صلى الله عليه وسلم - الكراهة في وجوههم ، فقال المنافقون : ألستم تزعمون أن صاحبكم هذا يعدل بين الناس ؟ والله ما رأيناه قبل عدل على هؤلاء ، إن قوما أخذوا مجالسهم وأحبوا القرب لنبيهم ، فأقامهم وأجلس من أبطأ عنه . فبلغنا أن رسول الله - صلى الله عليه وسلم - قال : \" رحم الله رجلا فسح لأخيه \" . فجعلوا يقومون بعد ذلك سراعا ، فتفسح القوم لإخوانهم ، ونزلت هذه الآية يوم الجمعة . رواه ابن أبي حاتم .\nوقد قال الإمام أحمد ، والشافعي : حدثنا سفيان ، عن أيوب ، عن نافع ، عن ابن عمر ، أن رسول الله - صلى الله عليه وسلم - قال : \" لا يقيم الرجل الرجل من مجلسه فيجلس فيه ، ولكن تفسحوا وتوسعوا \" .\nوأخرجاه في الصحيحين من حديث نافع به\nوقال الشافعي : أخبرنا عبد المجيد ، عن ابن جريج قال : قال سليمان بن موسى ، عن جابر بن عبد الله . أن رسول الله - صلى الله عليه وسلم - قال : \" لا يقيمن أحدكم أخاه يوم الجمعة ، ولكن ليقل : افسحوا \" . على شرط السنن ولم يخرجوه\nوقال الإمام أحمد : حدثنا عبد الملك بن عمرو ، حدثنا فليح ، عن أيوب عن عبد الرحمن بن أبي صعصعة ، عن يعقوب بن أبي يعقوب ، عن أبي هريرة ، عن النبي - صلى الله عليه وسلم - قال : \" لا يقم الرجل الرجل من مجلسه ، ثم يجلس فيه ، ولكن افسحوا يفسح الله لكم \"\nورواه أيضا عن سريج بن يونس ، ويونس بن محمد المؤدب ، عن فليح به . ولفظه : \" لا يقوم الرجل للرجل من مجلسه ، ولكن افسحوا يفسح الله لكم \" تفرد به أحمد\nوقد اختلف الفقهاء في جواز القيام للوارد إذا جاء على أقوال : فمنهم من رخص في ذلك محتجا بحديث : \" قوموا إلى سيدكم \" ومنهم من منع من ذلك محتجا بحديث : \" من أحب أن يتمثل له الرجال قياما فليتبوأ مقعده من النار \" ومنهم من فصل فقال : يجوز عند القدوم من سفر ، وللحاكم في محل ولايته ، كما دل عليه قصة سعد بن معاذ ، فإنه لما استقدمه النبي - صلى الله عليه وسلم - حاكما في بني قريظة فرآه مقبلا قال للمسلمين : \" قوموا إلى سيدكم \" . وما ذاك إلا ليكون أنفذ لحكمه ، والله أعلم . فأما اتخاذه ديدنا فإنه من شعار العجم . وقد جاء في السنن أنه لم يكن شخص أحب إليهم من رسول الله - صلى الله عليه وسلم - وكان إذا جاء لا يقومون له ، لما يعلمون من كراهته لذلك\nوفي الحديث المروي في السنن : أن رسول الله - صلى الله عليه وسلم - كان يجلس حيث انتهى به المجلس ، ولكن حيث يجلس يكون صدر ذلك المجلس ، وكان الصحابة ، رضي الله عنهم ، يجلسون منه على مراتبهم فالصديق يجلسه عن يمينه ، وعمر عن يساره ، وبين يديه غالبا عثمان ، وعلي ; لأنهما كانا ممن يكتب الوحي ، وكان يأمرهما بذلك ، كما رواه مسلم من حديث الأعمش ، عن عمارة بن عمير ، عن أبي معمر ، عن أبي مسعود ، أن رسول الله - صلى الله عليه وسلم - كان يقول : \" ليليني منكم أولو الأحلام والنهى ، ثم الذين يلونهم ، ثم الذين يلونهم \" وما ذاك إلا ليعقلوا عنه ما يقوله ، صلوات الله وسلامه عليه ; ولهذا أمر أولئك النفر بالقيام ليجلس الذين وردوا من أهل بدر ، إما لتقصير أولئك في حق البدريين ، أو ليأخذ البدريون من العلم بنصيبهم ، كما أخذ أولئك قبلهم ، أو تعليما بتقديم الأفاضل إلى الأمام .\nوقال الإمام أحمد : حدثنا وكيع ، عن الأعمش ، عن عمارة بن عمير التيمي عن أبي معمر ، عن أبي مسعود قال : كان رسول الله - صلى الله عليه وسلم - يمسح مناكبنا في الصلاة ويقول : \" استووا ولا تختلفوا فتختلف قلوبكم ، ليليني منكم أولو الأحلام والنهى ، ثم الذين يلونهم ، ثم الذين يلونهم \" . قال أبو مسعود فأنتم اليوم أشد اختلافا .\nوكذا رواه مسلم وأهل السنن ، إلا الترمذي ، من طرق عن الأعمش به .\nوإذا كان هذا أمره لهم في الصلاة أن يليه العقلاء ثم العلماء ، فبطريق الأولى أن يكون ذلك في غير الصلاة .\nوروى أبو داود من حديث معاوية بن صالح ، عن أبي الزاهرية ، عن كثير بن مرة ، عن عبد الله بن عمر أن رسول الله - صلى الله عليه وسلم - قال : \" أقيموا الصفوف ، وحاذوا بين المناكب ، وسدوا الخلل ، ولينوا بأيدي إخوانكم ، ولا تذروا فرجات للشيطان ، ومن وصل صفا وصله الله ، ومن قطع صفا قطعه الله \"\nولهذا كان أبي بن كعب - سيد القراء - إذا انتهى إلى الصف الأول انتزع منه رجلا يكون من أفناء الناس ، ويدخل هو في الصف المقدم ، ويحتج بهذا الحديث : \" ليليني منكم أولو الأحلام والنهى \" . وأما عبد الله بن عمر فكان لا يجلس في المكان الذي يقوم له صاحبه عنه ، عملا بمقتضى ما تقدم من روايته الحديث الذي أوردناه . ولنقتصر على هذا المقدار من الأنموذج المتعلق بهذه الآية ، وإلا فبسطه يحتاج إلى غير هذا الموضع ، وفي الحديث الصحيح : بينا رسول الله - صلى الله عليه وسلم - جالس ، إذ أقبل ثلاثة نفر ، فأما أحدهم فوجد فرجة في الحلقة فدخل فيها ، وأما الآخر فجلس وراء الناس ، وأدبر الثالث ذاهبا . فقال رسول الله - صلى الله عليه وسلم - : \" ألا أنبئكم بخبر الثلاثة ، أما الأول فآوى إلى الله فآواه الله ، وأما الثاني فاستحيا فاستحيا الله منه ، وأما الثالث فأعرض فأعرض الله عنه \"\nوقال الإمام أحمد : حدثنا عتاب بن زياد ، أخبرنا عبد الله ، أخبرنا أسامة بن زيد ، عن عمرو بن شعيب ، عن أبيه ، عن عبد الله بن عمرو أن رسول الله - صلى الله عليه وسلم - قال : \" لا يحل لرجل أن يفرق بين اثنين إلا بإذنهما \" .\nورواه أبو داود ، والترمذي ، من حديث أسامة بن زيد الليثي به . وحسنه الترمذي .\nوقد روي عن ابن عباس ، والحسن البصري ، وغيرهما أنهم قالوا في قوله تعالى : ( إذا قيل لكم تفسحوا في المجلس فافسحوا ) يعني : في مجالس الحرب ، قالوا : ومعنى قوله : ( وإذا قيل انشزوا فانشزوا ) أي : انهضوا للقتال .\nوقال قتادة : ( وإذا قيل انشزوا فانشزوا ) أي : إذا دعيتم إلى خير فأجيبوا .\nوقال مقاتل بن حيان إذا دعيتم إلى الصلاة فارتفعوا إليها .\nوقال عبد الرحمن بن زيد بن أسلم : كانوا إذا كانوا عند النبي - صلى الله عليه وسلم - في بيته فأرادوا الانصراف أحب كل منهم أن يكون هو آخرهم خروجا من عنده ، فربما يشق ذلك عليه - عليه السلام - وقد تكون له الحاجة ، فأمروا أنهم إذا أمروا بالانصراف أن ينصرفوا ، كقوله : ( وإن قيل لكم ارجعوا فارجعوا ) [ النور : 28 ]\nوقوله : ( يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات والله بما تعملون خبير ) أي : لا تعتقدوا أنه إذا فسح أحد منكم لأخيه إذا أقبل ، أو إذا أمر بالخروج فخرج ، أن يكون ذلك نقصا في حقه ، بل هو رفعة ومزية عند الله ، والله تعالى لا يضيع ذلك له ، بل يجزيه بها في الدنيا والآخرة ، فإن من تواضع لأمر الله رفع الله قدره ، ونشر ذكره ; ولهذا قال : ( يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات والله بما تعملون خبير ) أي : خبير بمن يستحق ذلك وبمن لا يستحقه .\nقال الإمام أحمد : حدثنا أبو كامل ، حدثنا إبراهيم ، حدثنا ابن شهاب ، عن أبي الطفيل عامر بن واثلة ، أن نافع بن عبد الحارث لقي عمر بن الخطاب بعسفان ، وكان عمر استعمله على مكة ، فقال له عمر : من استخلفت على أهل الوادي ؟ قال : استخلفت عليهم ابن أبزى . قال : وما ابن أبزى ؟ فقال : رجل من موالينا . فقال عمر بن الخطاب استخلفت عليهم مولى ؟ . فقال : يا أمير المؤمنين ، إنه قارئ لكتاب الله ، عالم بالفرائض ، قاض . فقال عمر ، رضي الله عنه : أما إن نبيكم - صلى الله عليه وسلم - قد قال : \" إن الله يرفع بهذا الكتاب قوما ويضع به آخرين \"\nوهكذا رواه مسلم من غير وجه ، عن الزهري به . وقد ذكرت فضل العلم وأهله وما ورد في ذلك من الأحاديث مستقصاة في شرح \" كتاب العلم \" من صحيح البخاري ، ولله الحمد والمنة .\n                                    \n                                    \n                                    \n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِ فَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ١١\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا إذا قيل لكم تفسحوا في المجالس فافسحوا يفسح الله لكم وإذا قيل انشزوا فانشزوا يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات والله بما تعملون خبير فيه سبع مسائل :\nالأولى : قوله تعالى : \" يا أيها الذين آمنوا إذا قيل لكم تفسحوا في المجلس \" لما بين أن اليهود يحيونه بما لم يحيه به الله وذمهم على ذلك ، وصل به الأمر بتحسين الأدب في مجالسة رسول الله صلى الله عليه وسلم ، حتى لا يضيقوا عليه المجلس ، وأمر المسلمين بالتعاطف والتآلف حتى يفسح بعضهم لبعض ، حتى يتمكنوا من الاستماع من رسول الله صلى الله عليه وسلم والنظر إليه . قال قتادة ومجاهد : كانوا يتنافسون في مجلس النبي صلى الله عليه وسلم ، فأمروا أن يفسح بعضهم لبعض . وقاله الضحاك . وقال ابن عباس : المراد بذلك مجالس القتال إذا اصطفوا للحرب . قال الحسن ويزيد بن أبي حبيب : كان النبي صلى الله عليه وسلم إذا قاتل المشركين تشاح أصحابه على الصف الأول فلا يوسع بعضهم لبعض ، رغبة في القتال والشهادة فنزلت . فيكون كقوله : مقاعد للقتال . وقال مقاتل : كان النبي صلى الله عليه وسلم في الصفة ، وكان في المكان ضيق يوم الجمعة ، وكان النبي صلى الله عليه وسلم يكرم أهل بدر من المهاجرين والأنصار ، فجاء أناس من أهل بدر فيهم ثابت بن قيس بن شماس وقد سبقوا في المجلس ، فقاموا حيال النبي صلى الله عليه وسلم على أرجلهم ينتظرون أن يوسع لهم فلم يفسحوا لهم ، فشق ذلك على النبي صلى الله عليه وسلم ، فقال لمن حوله من غير أهل بدر : قم يا فلان وأنت يا فلان بعدد القائمين من أهل بدر ، فشق ذلك على من أقيم ، وعرف النبي صلى الله عليه وسلم الكراهية في وجوههم ، فغمز المنافقون وتكلموا بأن قالوا : ما أنصف هؤلاء وقد أحبوا القرب من نبيهم فسبقوا إلى المكان ، فأنزل الله عز وجل هذه الآية . تفسحوا أي : توسعوا . وفسح فلان لأخيه في مجلسه يفسح فسحا أي : وسع له ، ومنه قولهم : بلد فسيح ولك في كذا فسحة ، وفسح يفسح مثل منع يمنع ، أي : وسع في المجلس ، وفسح يفسح فساحة مثل كرم يكرم كرامة أي : صار واسعا ، ومنه مكان فسيح .\nالثانية : قرأ السلمي وزر بن حبيش وعاصم في المجالس . وقرأ قتادة وداود بن أبي هند والحسن باختلاف عنه \" إذا قيل لكم تفاسحوا \" الباقون \" تفسحوا في المجلس \" فمن جمع فلأن قول : تفسحوا في المجالس ينبئ أن لكل واحد مجلسا . وكذلك إن أريد به الحرب . وكذلك يجوز أن يراد مسجد النبي صلى الله عليه وسلم وجمع لأن لكل جالس مجلسا . وكذلك يجوز إن أريد بالمجلس المفرد مجلس النبي صلى الله عليه وسلم ، ويجوز أن يراد به الجمع على مذهب الجنس ، كقولهم : كثر الدينار والدرهم .\nقلت : الصحيح في الآية أنها عامة في كل مجلس اجتمع المسلمون فيه للخير والأجر ، سواء كان مجلس حرب أو ذكر أو مجلس يوم الجمعة ، فإن كل واحد أحق بمكانه الذي سبق إليه قال صلى الله عليه وسلم : من سبق إلى ما لم يسبق إليه فهو أحق به ولكن يوسع لأخيه ما لم يتأذ فيخرجه الضيق عن موضعه . روى البخاري ومسلم عن ابن عمر عن النبي صلى الله عليه وسلم قال : لا يقيم الرجل الرجل من مجلسه ثم يجلس فيه . وعنه عن النبي صلى الله عليه وسلم أنه نهى أن يقام الرجل من مجلسه ويجلس فيه آخر ، ولكن تفسحوا وتوسعوا . وكان ابن عمر يكره أن يقوم الرجل من مجلسه ثم يجلس مكانه . لفظ البخاري .\nالثالثة : إذا قعد واحد من الناس في موضع من المسجد لا يجوز لغيره أن يقيمه حتى يقعد مكانه ، لما روى مسلم عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم قال : لا يقيمن أحدكم أخاه يوم الجمعة ثم يخالف إلى مقعده فيقعد فيه ولكن يقول : افسحوا .\nفرع : القاعد في المكان إذا قام حتى يقعد غيره موضعه نظر ؛ فإن كان الموضع الذي قام إليه مثل الأول في سماع كلام الإمام لم يكره له ذلك ، وإن كان أبعد من الإمام كره له ذلك ، لأن فيه تفويت حظه .\nالرابعة : إذا أمر إنسان إنسانا أن يبكر إلى الجامع فيأخذ له مكانا يقعد فيه لا يكره ، فإذا جاء الآمر يقوم من الموضع ، لما روي : أن ابن سيرين كان يرسل غلامه إلى مجلس له في يوم الجمعة فيجلس له فيه ، فإذا جاء قام له منه .\nفرع : وعلى هذا من أرسل بساطا أو سجادة فتبسط له في موضع من المسجد .\nالخامسة : روى مسلم عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال : إذا قام أحدكم - وفي حديث أبي عوانة من قام من مجلسه - ثم رجع إليه فهو أحق به قال علماؤنا : هذا يدل على صحة القول بوجوب اختصاص الجالس بموضعه إلى أن يقوم منه ، لأنه إذا كان أولى به بعد قيامه فقبله أولى به وأحرى . وقد قيل : إن ذلك على الندب ، لأنه موضع غير متملك لأحد لا قبل الجلوس ولا بعده . وهذا فيه نظر ، وهو أن يقال : سلمنا أنه غير متملك لكنه يختص به إلى أن يفرغ غرضه منه ، فصار كأنه يملك منفعته ؛ إذ قد منع غيره من أن يزاحمه عليه . والله أعلم .\nالسادسة : قوله تعالى : يفسح الله لكم أي : في قبوركم . وقيل : في قلوبكم . وقيل : يوسع عليكم في الدنيا والآخرة .\nوإذا قيل انشزوا فانشزوا قرأ نافع وابن عامر وعاصم بضم الشين فيهما . وكسر الباقون ، وهما لغتان مثل يعكفون و يعرشون والمعنى : انهضوا إلى الصلاة والجهاد وعمل الخير ، قال أكثر المفسرين . وقال مجاهد والضحاك : إذا نودي للصلاة فقوموا إليها . وذلك أن رجالا تثاقلوا عن الصلاة فنزلت . وقال الحسن ومجاهد أيضا : أي : انهضوا إلى الحرب . وقال ابن زيد : هذا في بيت النبي صلى الله عليه وسلم ، كان كل رجل منهم يحب أن يكون آخر عهده بالنبي صلى الله عليه وسلم ، فقال الله تعالى : وإذا قيل انشزوا عن النبي صلى الله عليه وسلم فانشزوا ؛ فإن له حوائج فلا تمكثوا . وقال قتادة : المعنى أجيبوا إذا دعيتم إلى أمر بمعروف ، وهذا هو الصحيح ؛ لأنه يعم . والنشز : الارتفاع ، مأخوذ من نشز الأرض وهو ارتفاعها ، يقال : نشز ينشز وينشز إذا انتحى من موضعه ، أي : ارتفع منه . وامرأة ناشز منتحية عن زوجها . وأصل هذا من النشز ، والنشز هو ما ارتفع من الأرض وتنحى ؛ ذكره النحاس .\nالسابعة : قوله تعالى : يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات أي : في الثواب في الآخرة وفي الكرامة في الدنيا ، فيرفع المؤمن على من ليس بمؤمن ، والعالم على من ليس بعالم . وقال ابن مسعود : مدح الله العلماء في هذه الآية . والمعنى أنه يرفع الله الذين أوتوا العلم على الذين آمنوا ولم يؤتوا العلم درجات أي : درجات في دينهم إذا فعلوا ما أمروا به . وقيل : كان أهل الغنى يكرهون أن يزاحمهم من يلبس الصوف فيستبقون إلى مجلس النبي صلى الله عليه وسلم ، فالخطاب لهم . ورأى عليه الصلاة والسلام رجلا من الأغنياء يقبض ثوبه نفورا من بعض الفقراء أراد أن يجلس إليه فقال : يا فلان خشيت أن يتعدى غناك إليه أو فقره إليك وبين في هذه الآية أن الرفعة عند الله تعالى بالعلم والإيمان لا بالسبق إلى صدور المجالس . وقيل : أراد بالذين أوتوا العلم الذين قرءوا القرآن . وقال يحيى بن يحيى عن مالك : يرفع الله الذين آمنوا منكم الصحابة والذين أوتوا العلم درجات يرفع الله بها العالم والطالب للحق .\nقلت : والعموم أوقع في المسألة وأولى بمعنى الآية ، فيرفع المؤمن بإيمانه أولا ثم بعلمه ثانيا . وفي الصحيح أن عمر بن الخطاب رضي الله عنه كان يقدم عبد الله بن عباس على الصحابة ، فكلموه في ذلك فدعاهم ودعاه ، وسألهم عن تفسير إذا جاء نصر الله والفتح فسكتوا ، فقال ابن عباس : هو أجل رسول الله صلى الله عليه وسلم أعلمه الله إياه . فقال عمر : ما أعلم منها إلا ما تعلم . وفي البخاري عن عبد الله بن عباس قال : قدم عيينة بن حصن بن حذيفة بن بدر فنزل على ابن أخيه الحر بن قيس بن حصن ، وكان من النفر الذين يدنيهم عمر ، وكان القراء أصحاب مجالس عمر ومشاورته كهولا كانوا أو شبانا . الحديث ، وقد مضى في آخر ( الأعراف ) . وفي صحيح مسلم أن نافع بن الحارث لقي عمر بعسفان وكان عمر يستعمله على مكة فقال : من استعملته على أهل الوادي ؟ فقال : ابن أبزى . فقال : ومن ابن أبزى ؟ قال : مولى من موالينا . قال : فاستخلفت عليهم مولى ! قال : إنه قارئ لكتاب الله وإنه عالم بالفرائض . قال عمر : أما إن نبيكم صلى الله عليه وسلم قد قال : إن الله يرفع بهذا الكتاب أقواما ويضع به آخرين وقد مضى أول الكتاب . ومضى القول في فضل العلم والعلماء في غير موضع من هذا الكتاب والحمد لله . وروي عن النبي صلى الله عليه وسلم أنه قال : بين العالم والعابد مائة درجة ، بين كل درجتين حضر الجواد المضمر سبعين سنة . وعنه صلى الله عليه وسلم : فضل العالم على العابد كفضل القمر ليلة البدر على سائر الكواكب . وعنه عليه الصلاة والسلام : يشفع يوم القيامة ثلاثة : الأنبياء ثم العلماء ثم الشهداء فأعظم بمنزلة هي واسطة بين النبوة والشهادة بشهادة رسول الله صلى الله عليه وسلم . وعن ابن عباس : خير سليمان عليه السلام بين العلم والمال والملك فاختار العلم فأعطي المال والملك معه .\n                                    \n                                    \n                                    \n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِ فَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ١١\n                                        \n                                        \n                                        \n                                        هذا تأديب من الله لعباده المؤمنين، إذا اجتمعوا في مجلس من مجالس مجتمعاتهم، واحتاج بعضهم أو بعض القادمين عليهم للتفسح له في المجلس، فإن من الأدب أن يفسحوا له تحصيلا لهذا المقصود.\nوليس ذلك بضار للجالس شيئا، فيحصل مقصود أخيه من غير ضرر يلحقه هو، والجزاء من جنس العمل، فإن من فسح فسح الله له، ومن وسع لأخيه، وسع الله عليه.\n{ وَإِذَا قِيلَ انْشُزُوا } أي: ارتفعوا وتنحوا عن مجالسكم لحاجة تعرض، { فَانْشُزُوا } أي: فبادروا للقيام لتحصيل تلك المصلحة، فإن القيام بمثل هذه الأمور من العلم والإيمان، والله تعالى يرفع أهل العلم والإيمان درجات بحسب ما خصهم الله به، من العلم والإيمان.\n{ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ } فيجازي كل عامل بعمله، إن خيرا فخير، وإن شرا فشر.\nوفي هذه الآية فضيلة العلم، وأن زينته وثمرته التأدب بآدابه والعمل بمقتضاه.s\n                                    \n                                        \n                                        \n                                        \n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِ فَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ ١١"
    }
  ]
}