{
  "number": 545,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 5126,
      "text": "لَا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ وَرَسُولَهُ وَلَوْ كَانُوا آبَاءَهُمْ أَوْ أَبْنَاءَهُمْ أَوْ إِخْوَانَهُمْ أَوْ عَشِيرَتَهُمْ ۚ أُولَٰئِكَ كَتَبَ فِي قُلُوبِهِمُ الْإِيمَانَ وَأَيَّدَهُمْ بِرُوحٍ مِنْهُ ۖ وَيُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ أُولَٰئِكَ حِزْبُ اللَّهِ ۚ أَلَا إِنَّ حِزْبَ اللَّهِ هُمُ الْمُفْلِحُونَ",
      "surah": {
        "number": 58,
        "name": "سورة المجادلة",
        "englishName": "Al-Mujaadila",
        "englishNameTranslation": "The Pleading Woman",
        "revelationType": "Medinan",
        "numberOfAyahs": 22
      },
      "numberInSurah": 22,
      "juz": 28,
      "manzil": 7,
      "page": 545,
      "ruku": 478,
      "hizbQuarter": 218,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّا تَجِدُ قَوۡمٗا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ يُوَآدُّونَ مَنۡ حَآدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوٓاْ ءَابَآءَهُمۡ أَوۡ أَبۡنَآءَهُمۡ أَوۡ إِخۡوَٰنَهُمۡ أَوۡ عَشِيرَتَهُمۡۚ أُوْلَٰٓئِكَ كَتَبَ فِي قُلُوبِهِمُ ٱلۡإِيمَٰنَ وَأَيَّدَهُم بِرُوحٖ مِّنۡهُۖ وَيُدۡخِلُهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ رَضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ أُوْلَٰٓئِكَ حِزۡبُ ٱللَّهِۚ أَلَآ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ ٢٢\n                                    \n                                    \n                                    ثم قال تعالى : ( لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله ولو كانوا آباءهم أو أبناءهم أو إخوانهم أو عشيرتهم ) أي : لا يوادون المحادين ولو كانوا من الأقربين ، كما قال تعالى : ( لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه ) [ آل عمران : 28 ] الآية ، وقال تعالى : ( قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم وعشيرتكم وأموال اقترفتموها وتجارة تخشون كسادها ومساكن ترضونها أحب إليكم من الله ورسوله وجهاد في سبيله فتربصوا حتى يأتي الله بأمره والله لا يهدي القوم الفاسقين ) [ التوبة : 24 ]\nوقد قال سعيد بن عبد العزيز وغيره : أنزلت هذه الآية ( لا تجد قوما يؤمنون بالله واليوم الآخر ) إلى آخرها في أبي عبيدة عامر بن عبد الله بن الجراح ، حين قتل أباه يوم بدر ولهذا قال عمر بن الخطاب ، رضي الله عنه ، حين جعل الأمر شورى بعده في أولئك الستة ، رضي الله عنهم : \" ولو كان أبو عبيدة حيا لاستخلفته \" .\nوقيل في قوله : ( ولو كانوا آباءهم ) نزلت في أبي عبيدة قتل أباه يوم بدر ( أو أبناءهم ) في الصديق هم يومئذ بقتل ابنه عبد الرحمن ، ( أو إخوانهم ) في مصعب بن عمير ، قتل أخاه عبيد بن عمير يومئذ ( أو عشيرتهم ) في عمر قتل قريبا له يومئذ أيضا ، وفي حمزة وعلي وعبيدة بن الحارث ، قتلوا عتبة ، وشيبة ، والوليد بن عتبة يومئذ ، والله أعلم .\nقلت : ومن هذا القبيل حين استشار رسول الله - صلى الله عليه وسلم - المسلمين في أسارى بدر فأشار الصديق بأن يفادوا ، فيكون ما يؤخذ منهم قوة للمسلمين ، وهم بنو العم والعشيرة ، ولعل الله أن يهديهم . وقالعمر : لا أرى ما رأى يا رسول الله ، هل تمكني من فلان ؟ - قريب لعمر - فأقتله ، وتمكن عليا من عقيل وتمكن فلانا من فلان ، ليعلم الله أنه ليست في قلوبنا هوادة للمشركين . . . القصة بكاملها .\nوقوله : ( أولئك كتب في قلوبهم الإيمان وأيدهم بروح منه ) أي : من اتصف بأنه لا يواد من حاد الله ورسوله ولو كان أباه أو أخاه ، فهذا ممن كتب الله في قلبه الإيمان ، أي : كتب له السعادة وقررها في قلبه وزين الإيمان في بصيرته .\nوقال السدي : ( كتب في قلوبهم الإيمان ) جعل في قلوبهم الإيمان .\nوقال ابن عباس : ( وأيدهم بروح منه ) أي : قواهم .\nوقوله : ( ويدخلهم جنات تجري من تحتها الأنهار خالدين فيها رضي الله عنهم ورضوا عنه ) كل هذا تقدم تفسيره غير مرة .\nوفي قوله : ( رضي الله عنهم ورضوا عنه ) سر بديع ، وهو أنه لما سخطوا على القرائب والعشائر في الله عوضهم الله بالرضا عنهم ، وأرضاهم عنه بما أعطاهم من النعيم المقيم ، والفوز العظيم ، والفضل العميم .\nوقوله : ( أولئك حزب الله ألا إن حزب الله هم المفلحون ) أي : هؤلاء حزب الله ، أي : عباد الله وأهل كرامته .\nوقوله : ( ألا إن حزب الله هم المفلحون ) تنويه بفلاحهم وسعادتهم ونصرهم في الدنيا والآخرة ، في مقابلة ما أخبر عن أولئك بأنهم حزب الشيطان . ثم قال : ( ألا إن حزب الشيطان هم الخاسرون )\nوقد قال ابن أبي حاتم : حدثنا هارون بن حميد الواسطي ، حدثنا الفضل بن عنبسة عن رجل قد سماه - يقال هو عبد الحميد بن سليمان انقطع من كتابي - عن الذيال بن عباد قال : كتب أبو حازم الأعرج إلى الزهري : اعلم أن الجاه جاهان ، جاه يجريه الله على أيدي أوليائه لأوليائه ، وأنهم الخامل ذكرهم ، الخفية شخوصهم ، ولقد جاءت صفتهم على لسان رسول الله - صلى الله عليه وسلم - . \" إن الله يحب الأخفياء الأتقياء الأبرياء ، الذين إذا غابوا لم يفتقدوا ، وإذا حضروا لم يدعوا ، قلوبهم مصابيح الهدى ، يخرجون من كل فتنة سوداء مظلمة فهؤلاء أولياء الله تعالى الذين قال الله : ( أولئك حزب الله ألا إن حزب الله هم المفلحون )\nوقال نعيم بن حماد : حدثنا محمد بن ثور ، عن يونس ، عن الحسن قال : قال رسول الله - صلى الله عليه وسلم - : \" اللهم ، لا تجعل لفاجر ولا لفاسق عندي يدا ولا نعمة ، فإني وجدت فيما أوحيته إلي : ( لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله ) قال سفيان : يرون أنها نزلت فيمن يخالط السلطان . ورواه أبو أحمد العسكري .\n                                    ",
        "qortoby": "لَّا تَجِدُ قَوۡمٗا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ يُوَآدُّونَ مَنۡ حَآدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوٓاْ ءَابَآءَهُمۡ أَوۡ أَبۡنَآءَهُمۡ أَوۡ إِخۡوَٰنَهُمۡ أَوۡ عَشِيرَتَهُمۡۚ أُوْلَٰٓئِكَ كَتَبَ فِي قُلُوبِهِمُ ٱلۡإِيمَٰنَ وَأَيَّدَهُم بِرُوحٖ مِّنۡهُۖ وَيُدۡخِلُهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ رَضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ أُوْلَٰٓئِكَ حِزۡبُ ٱللَّهِۚ أَلَآ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ ٢٢\n                                    \n                                    \n                                    قوله تعالى : لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله ولو كانوا آباءهم أو أبناءهم أو إخوانهم أو عشيرتهم أولئك كتب في قلوبهم الإيمان وأيدهم بروح منه ويدخلهم جنات تجري من تحتها الأنهار خالدين فيها رضي الله عنهم ورضوا عنه أولئك حزب الله ألا إن حزب الله هم المفلحون\nفيه مسألتان :\nالأولى : قوله تعالى : لا تجد قوما يؤمنون بالله واليوم الآخر يوادون أي : يحبون ويوالون من حاد الله ورسوله تقدم . ولو كانوا آباءهم قال السدي نزلت في عبد الله بن عبد الله بن أبي ، جلس إلى النبي صلى الله عليه وسلم ، فشرب النبي صلى الله عليه وسلم ماء ، فقال له : بالله يا رسول الله ما أبقيت من شرابك فضلة أسقيها أبي ، لعل الله يطهر بها قلبه ؟ فأفضل له ، فأتاه بها ، فقال له عبد الله : ما هذا ؟ فقال : هي فضلة من شراب النبي صلى الله عليه وسلم جئتك بها تشربها ، لعل الله يطهر قلبك بها ، فقال له أبوه : فهلا جئتني ببول أمك فإنه أطهر منها . فغضب وجاء إلى النبي صلى الله عليه وسلم ، وقال : يا رسول الله ! أما أذنت لي في قتل أبي ؟ فقال النبي صلى الله عليه وسلم : بل ترفق به وتحسن إليه . وقال ابن جريج : حدثت أن أبا قحافة سب النبي صلى الله عليه وسلم فصكه أبو بكر ابنه صكة فسقط منها على وجهه ، ثم أتى النبي صلى الله عليه وسلم فذكر ذلك له ، فقال : أو فعلته ، لا تعد إليه فقال : والذي بعثك بالحق نبيا لو كان السيف مني قريبا لقتلته . وقال ابن مسعود : نزلت في أبي عبيدة بن الجراح ، قتل أباه عبد الله بن الجراح يوم أحد وقيل : يوم بدر . وكان الجراح يتصدى لأبي عبيدة وأبو عبيدة يحيد عنه ، فلما أكثر قصد إليه أبو عبيدة فقتله ، فأنزل الله حين قتل أباه : لا تجد قوما يؤمنون بالله واليوم الآخر الآية . قال الواقدي : كذلك يقول أهل الشام . ولقد سألت رجالا من بني الحارث بن فهر فقالوا : توفي أبوه من قبل الإسلام . أو أبناءهم يعني أبا بكر دعا ابنه عبد الله إلى البراز يوم بدر ، فقال النبي صلى الله عليه وسلم : متعنا بنفسك يا أبا بكر أما تعلم أنك عندي بمنزلة السمع والبصر . أو إخوانهم يعني مصعب بن عمير قتل أخاه عبيد بن عمير يوم بدر . أو عشيرتهم يعني عمر بن الخطاب قتل خاله العاص بن هشام بن المغيرة يوم بدر ، وعليا وحمزة قتلا عتبة وشيبة والوليد يوم بدر . وقيل : إن الآية نزلت في حاطب بن أبي بلتعة ، لما كتب إلى أهل مكة بمسير النبي صلى الله عليه وسلم عام الفتح ، على ما يأتي بيانه أول سورة ( الممتحنة ) إن شاء الله تعالى . بين أن الإيمان يفسد بموالاة الكفار وإن كانوا أقارب .\nالثانية : استدل مالك رحمه الله من هذه الآية على معاداة القدرية وترك مجالستهم . قال أشهب عن مالك : لا تجالس القدرية وعادهم في الله ، لقوله تعالى : لا تجد قوما يؤمنون بالله واليوم الآخر يوادون من حاد الله ورسوله .\nقلت : وفي معنى أهل القدر جميع أهل الظلم والعدوان . وعن الثوري أنه قال : كانوا يرون أنها نزلت في من كان يصحب السلطان . وعن عبد العزيز بن أبي داود أنه لقي المنصور في الطواف فلما عرفه هرب منه وتلاها . وعن النبي صلى الله عليه وسلم أنه كان يقول : اللهم لا تجعل لفاجر عندي نعمة فإني وجدت فيما أوحيت لا تجد قوما يؤمنون بالله واليوم الآخر - إلى قوله - أولئك كتب في قلوبهم الإيمان أي : خلق في قلوبهم التصديق ، يعني من لم يوال من حاد الله . وقيل : كتب أثبت ؛ قاله الربيع بن أنس . وقيل : جعل ، كقوله تعالى : فاكتبنا مع الشاهدين أي : اجعلنا . وقوله : فسأكتبها للذين يتقون وقيل : كتب أي : جمع ، ومنه الكتيبة ، أي : لم يكونوا ممن يقول نؤمن ببعض ونكفر ببعض . وقراءة العامة بفتح الكاف من \" كتب \" ونصب النون من \" الإيمان \" بمعنى : كتب الله ، وهو الأجود ؛ لقوله تعالى : وأيدهم بروح منه وقرأ أبو العالية وزر بن حبيش والمفضل عن عاصم \" كتب \" على ما لم يسم فاعله \" الإيمان \" برفع النون . وقرأ زر بن حبيش \" وعشيراتهم \" بألف وكسر التاء على الجمع ، ورواها الأعمش عن أبي بكر عن عاصم . وقيل : كتب في قلوبهم أي : على قلوبهم ، كما في قوله في جذوع النخل وخص القلوب بالذكر لأنها موضع الإيمان .\nوأيدهم قواهم ونصرهم بروح منه ، قال الحسن : وبنصر منه . وقال الربيع بن أنس : بالقرآن وحججه . وقال ابن جريج : بنور وإيمان وبرهان وهدى . وقيل : برحمة من الله . وقال بعضهم : أيدهم بجبريل عليه السلام .\nويدخلهم جنات تجري من تحتها الأنهار خالدين فيها رضي الله عنهم أي : قبل أعمالهم ورضوا عنه فرحوا بما أعطاهم أولئك حزب الله ألا إن حزب الله هم المفلحون قال سعيد بن أبي سعيد الجرجاني عن بعض مشايخه ، قال داود عليه السلام : إلهي ، من حزبك وحول عرشك ؟ فأوحى الله إليه : \" يا داود الغاضة أبصارهم ، النقية قلوبهم ، السليمة أكفهم ، أولئك حزبي وحول عرشي \" .\n                                    ختمت والحمد لله سورة ( المجادلة ) .\n                                    ",
        "saadi": "لَّا تَجِدُ قَوۡمٗا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ يُوَآدُّونَ مَنۡ حَآدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوٓاْ ءَابَآءَهُمۡ أَوۡ أَبۡنَآءَهُمۡ أَوۡ إِخۡوَٰنَهُمۡ أَوۡ عَشِيرَتَهُمۡۚ أُوْلَٰٓئِكَ كَتَبَ فِي قُلُوبِهِمُ ٱلۡإِيمَٰنَ وَأَيَّدَهُم بِرُوحٖ مِّنۡهُۖ وَيُدۡخِلُهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ رَضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ أُوْلَٰٓئِكَ حِزۡبُ ٱللَّهِۚ أَلَآ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ ٢٢\n                                        \n                                        \n                                        \n                                        يقول تعالى: { لَا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ وَرَسُولَهُ } أي: لا يجتمع هذا وهذا، فلا يكون العبد مؤمنا بالله واليوم الآخر حقيقة، إلا كان عاملا على مقتضى الإيمان ولوازمه، من محبة من قام بالإيمان وموالاته، وبغض من لم يقم به ومعاداته، ولو كان أقرب الناس إليه.\nوهذا هو الإيمان على الحقيقة، الذي وجدت ثمرته والمقصود منه، وأهل هذا الوصف هم الذين كتب الله في قلوبهم الإيمان أي: رسمه وثبته وغرسه غرسا، لا يتزلزل، ولا تؤثر فيه الشبه والشكوك.\nوهم الذين قواهم الله بروح منه أي: بوحيه، ومعونته، ومدده الإلهي وإحسانه الرباني.\nوهم الذين لهم الحياة الطيبة في هذه الدار، ولهم جنات النعيم في دار القرار، التي فيها من كل ما تشتهيه الأنفس، وتلذ الأعين، وتختار، ولهم أكبر النعيم وأفضله، وهو أن الله يحل عليهم رضوانه فلا يسخط عليهم أبدا، ويرضون عن ربهم بما يعطيهم من أنواع الكرامات، ووافر المثوبات، وجزيل الهبات، ورفيع الدرجات بحيث لا يرون فوق ما أعطاهم مولاهم غاية، ولا فوقه نهاية\nوأما من يزعم أنه يؤمن بالله واليوم الآخر، وهو مع ذلك مواد لأعداء الله، محب لمن ترك الإيمان وراء ظهره، فإن هذا إيمان زعمي لا حقيقة له، فإن كل أمر لا بد له من برهان يصدقه، فمجرد الدعوى، لا تفيد شيئا ولا يصدق صاحبها.\nتم تفسير قد سمع الله، بحمد الله وعونه وتسديده.\nوالحمد لله رب العالمين، وصلى الله على محمد وسلم تسليما\n                                    "
      },
      "originalText": "لَّا تَجِدُ قَوۡمٗا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ يُوَآدُّونَ مَنۡ حَآدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوٓاْ ءَابَآءَهُمۡ أَوۡ أَبۡنَآءَهُمۡ أَوۡ إِخۡوَٰنَهُمۡ أَوۡ عَشِيرَتَهُمۡۚ أُوْلَٰٓئِكَ كَتَبَ فِي قُلُوبِهِمُ ٱلۡإِيمَٰنَ وَأَيَّدَهُم بِرُوحٖ مِّنۡهُۖ وَيُدۡخِلُهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ رَضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُۚ أُوْلَٰٓئِكَ حِزۡبُ ٱللَّهِۚ أَلَآ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ ٢٢"
    },
    {
      "number": 5127,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 1,
      "juz": 28,
      "manzil": 7,
      "page": 545,
      "ruku": 479,
      "hizbQuarter": 218,
      "sajda": false,
      "tafsier": {
        "ibnkther": "سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ١\n                                    \n                                    \n                                    تفسير سورة الحشر\nوكان ابن عباس يقول : سورة بني النضير . وهي مدنية .\nقال سعيد بن منصور : حدثنا هشيم عن أبي بشر ، عن سعيد بن جبير قال : قلت لابن عباس : سورة الحشر ؟ قال : أنزلت في بني النضير . ورواه البخاري ومسلم من وجه آخر ، عن هشيم به . ورواه البخاري من حديث أبي عوانة عن أبي بشر ، عن سعيد بن جبير قال : قلت لابن عباس : سورة الحشر ؟ قال : قل : سورة النضير .\nيخبر تعالى أن جميع ما في السماوات وما في الأرض من شيء يسبح له ويمجده ويقدسه ، ويصلي له ويوحده كقوله : ( تسبح له السماوات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم ) [ الإسراء : 44 ] . وقوله : ( وهو العزيز ) أي : منيع الجناب ) الحكيم ) في قدره وشرعه .\n                                    ",
        "qortoby": "سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ١\n                                    \n                                    \n                                    مدنية في قول الجميع ، وهي أربع وعشرون آية .\nروى ابن عباس أن رسول الله صلى الله عليه وسلم قال : من قرأ سورة الحشر لم يبق شيء من الجنة والنار والعرش والكرسي والسموات والأرض والهوام والريح والسحاب والطير والدواب والشجر والجبال والشمس والقمر والملائكة إلا صلوا عليه واستغفروا له . فإن مات من يومه أو ليلته مات شهيدا . خرجه الثعلبي . وخرج الثعالبي عن يزيد الرقاشي عن أنس أن رسول الله صلى الله عليه وسلم قال : من قرأ آخر سورة الحشر : لو أنزلنا هذا القرآن على جبل إلى آخرها فمات من ليلته مات شهيدا .\nوروى الترمذي عن معقل بن يسار قال : قال رسول الله صلى الله عليه وسلم : \" من قال حين يصبح ثلاث مرات : أعوذ بالله السميع العليم من الشيطان الرجيم وقرأ ثلاث آيات من آخر سورة الحشر وكل الله به سبعين الف ملك يصلون عليه حتى يمسي ، وإن مات في يومه مات شهيدا ، ومن قرأها حين يمسي فكذلك \" . قال : حديث حسن غريب .\nبسم الله الرحمن الرحيم\nسبح لله ما في السماوات وما في الأرض وهو العزيز الحكيم\nتقدم\n                                    ",
        "saadi": "سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ١\n                                        \n                                        \n                                        \n                                        هذه السورة تسمى { سورة بني النضير } وهم طائفة كبيرة من اليهود في جانب المدينة، وقت بعثة النبي صلى الله عليه وسلم، فلما بعث النبي صلى الله عليه وسلم، وهاجر إلى المدينة، كفروا به في جملة من كفر من اليهود، فلما هاجر النبي صلى الله عليه وسلم إلى المدينة هادن سائر طوائف اليهود الذين هم جيرانه في المدينة، فلما كان بعد [وقعة] بدر بستة أشهر أو نحوها، خرج إليهم النبي صلى الله عليه وسلم، وكلمهم أن يعينوه في دية الكلابيين الذين قتلهم عمرو بن أمية الضمري، فقالوا: نفعل يا أبا القاسم، اجلس هاهنا حتى نقضي حاجتك، فخلا بعضهم ببعض، وسول لهم الشيطان الشقاء الذي كتب عليهم، فتآمروا بقتله صلى الله عليه وسلم، وقالوا: أيكم يأخذ هذه الرحى فيصعد فيلقيها على رأسه يشدخه بها؟ فقال أشقاهم عمرو بن جحاش: أنا، فقال لهم سلام بن مشكم: لا تفعلوا، فوالله ليخبرن بما هممتم به، وإنه لنقض العهد الذي بيننا وبينه، وجاء الوحي على الفور إليه من ربه، بما هموا به، فنهض مسرعا، فتوجه إلى المدينة، ولحقه أصحابه، فقالوا: نهضت ولم نشعر بك، فأخبرهم بما همت يهود به.\nوبعث إليهم رسول الله صلى الله عليه وسلم: \"أن اخرجوا من المدينة ولا تساكنوني بها، وقد أجلتكم عشرا، فمن وجدت بعد ذلك بها ضربت عنقه\"\nفأقاموا أياما يتجهزون، وأرسل إليهم المنافق عبد الله بن أبي [بن سلول]: \"أن لا تخرجوا من دياركم، فإن معي ألفين يدخلون معكم حصنكم، فيموتون دونكم، وتنصركم قريظة وحلفاؤكم من غطفان\".\nوطمع رئيسهم حيي بن أخطب فيما قال له، وبعث إلى رسول الله صلى الله عليه وسلم يقول: إنا لا نخرج من ديارنا، فاصنع ما بدا لك.\nفكبر رسول الله صلى عليه وسلم وأصحابه، ونهضوا إليهم، وعلي بن أبي طالب يحمل اللواء.\nفأقاموا على حصونهم يرمون بالنبل والحجارة، واعتزلتهم قريظة، وخانهم ابن أبي وحلفاؤهم من غطفان، فحاصرهم رسول الله صلى الله عليه وسلم، وقطع نخلهم وحرق. فأرسلوا إليه: نحن نخرج من المدينة، فأنزلهم على أن يخرجوا منها بنفوسهم، وذراريهم، وأن لهم ما حملت إبلهم إلا السلاح، وقبض رسول الله صلى الله عليه وسلم، الأموال والسلاح.\nوكانت بنو النضير، خالصة لرسول الله صلى الله عليه وسلم لنوائبه ومصالح المسلمين، ولم يخمسها، لأن الله أفاءها عليه، ولم يوجف المسلمون عليها بخيل ولا ركاب، وأجلاهم إلى خيبر وفيهم حيي بن أخطب كبيرهم، واستولى على أرضهم وديارهم، وقبض السلاح، فوجد من السلاح خمسين درعا، وخمسين بيضة، وثلاثمائة وأربعين سيفا، هذا حاصل قصتهم كما ذكرها أهل السير.\nفافتتح تعالى هذه السورة بالإخبار أن جميع من في السماوات والأرض تسبح بحمد ربها، وتنزهه عما لا يليق بجلاله، وتعبده وتخضع لجلاله لأنه العزيز الذي قد قهر كل شيء، فلا يمتنع عليه شيء، ولا يستعصي عليه مستعصي الحكيم في خلقه وأمره، فلا يخلق شيئا عبثا، ولا يشرع ما لا مصلحة فيه، ولا يفعل إلا ما هو مقتضى حكمته.\nومن ذلك، نصر الله لرسوله صلى الله عليه وسلم على الذين كفروا من أهل الكتاب من بني النضير حين غدروا برسوله فأخرجهم من ديارهم وأوطانهم التي ألفوها وأحبوها.\n                                    "
      },
      "originalText": "سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ١"
    },
    {
      "number": 5128,
      "text": "هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ ۚ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا ۖ وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا ۖ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ ۚ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 2,
      "juz": 28,
      "manzil": 7,
      "page": 545,
      "ruku": 479,
      "hizbQuarter": 218,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱلَّذِيٓ أَخۡرَجَ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن دِيَٰرِهِمۡ لِأَوَّلِ ٱلۡحَشۡرِۚ مَا ظَنَنتُمۡ أَن يَخۡرُجُواْۖ وَظَنُّوٓاْ أَنَّهُم مَّانِعَتُهُمۡ حُصُونُهُم مِّنَ ٱللَّهِ فَأَتَىٰهُمُ ٱللَّهُ مِنۡ حَيۡثُ لَمۡ يَحۡتَسِبُواْۖ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَۚ يُخۡرِبُونَ بُيُوتَهُم بِأَيۡدِيهِمۡ وَأَيۡدِي ٱلۡمُؤۡمِنِينَ فَٱعۡتَبِرُواْ يَٰٓأُوْلِي ٱلۡأَبۡصَٰرِ ٢\n                                    \n                                    \n                                    وقوله : ( هو الذي أخرج الذين كفروا من أهل الكتاب ) يعني : يهود بني النضير . قاله ابن عباس ، ومجاهد ، والزهري ، وغير واحد : كان رسول الله - صلى الله عليه وسلم - لما قدم المدينة هادنهم وأعطاهم عهدا وذمة ، على ألا يقاتلهم ولا يقاتلوه ، فنقضوا العهد الذي كان بينهم وبينه ، فأحل الله بهم بأسه الذي لا مرد له ، وأنزل عليهم قضاءه الذي لا يصد ، فأجلاهم النبي - صلى الله عليه وسلم - وأخرجهم من حصونهم الحصينة التي ما طمع فيها المسلمون ، وظنوا هم أنها مانعتهم من بأس الله ، فما أغنى عنهم من الله شيئا ، وجاءهم ما لم يكن ببالهم ، وسيرهم رسول الله وأجلاهم من المدينة فكان منهم طائفة ذهبوا إلى أذرعات من أعالي الشام وهي أرض المحشر والمنشر ، ومنهم طائفة ذهبوا إلى خيبر . وكان قد أنزلهم منها على أن لهم ما حملت إبلهم ، فكانوا يخربون ما في بيوتهم من المنقولات التي يمكن أن تحمل معهم ; ولهذا قال : ( يخربون بيوتهم بأيديهم وأيدي المؤمنين فاعتبروا يا أولي الأبصار ) أي : تفكروا في عاقبة من خالف أمر الله وخالف رسوله ، وكذب كتابه ، كيف يحل به من بأسه المخزي له في الدنيا ، مع ما يدخره له في الآخرة من العذاب الأليم .\nقال أبو داود : حدثنا محمد بن داود ، وسفيان ، حدثنا عبد الرزاق ، أخبرنا معمر ، عن الزهري ، عن عبد الرحمن بن كعب بن مالك ، عن رجل من أصحاب النبي - صلى الله عليه وسلم - أن كفار قريش كتبوا إلى ابن أبي ، ومن كان معه يعبد معه الأوثان من الأوس ، والخزرج ورسول الله - صلى الله عليه وسلم - يومئذ بالمدينة قبل وقعة بدر : إنكم آويتم صاحبنا ، وإنا نقسم بالله لنقاتلنه ، أو لتخرجنه ، أو لنسيرن إليكم بأجمعنا ، حتى نقتل مقاتلتكم ، ونستبيح نساءكم ، فلما بلغ ذلك عبد الله بن أبي ومن كان معه من عبدة الأوثان ، اجتمعوا لقتال النبي - صلى الله عليه وسلم - فلما بلغ ذلك النبي - صلى الله عليه وسلم - لقيهم ، فقال : \" لقد بلغ وعيد قريش منكم المبالغ ، ما كانت تكيدكم بأكثر مما تريد أن تكيدوا به أنفسكم ، تريدون أن تقاتلوا أبناءكم وإخوانكم ؟ \" ، فلما سمعوا ذلك من النبي - صلى الله عليه وسلم - تفرقوا ، فبلغ ذلك كفار قريش ، فكتبت كفار قريش بعد وقعة بدر إلى اليهود : إنكم أهل الحلقة والحصون ، وإنكم لتقاتلن مع صاحبنا أو لنفعلن كذا وكذا ، ولا يحول بيننا وبين خدم نسائكم شيء - وهي الخلاخيل - فلما بلغ كتابهم النبي - صلى الله عليه وسلم - اجتمعت بنو النضير بالغدر ، فأرسلوا إلى النبي - صلى الله عليه وسلم - : اخرج إلينا في ثلاثين رجلا من أصحابك ليخرج منا ثلاثون حبرا ، حتى نلتقي بمكان المنصف فيسمعوا منك ، فإن صدقوك وآمنوا بك آمنا بك ، فلما كان الغد غدا عليهم رسول الله - صلى الله عليه وسلم - بالكتائب فحصرهم ، قال لهم : \" إنكم والله لا تأمنوا عندي إلا بعهد تعاهدوني عليه \" . فأبوا أن يعطوه عهدا ، فقاتلهم يومهم ذلك ، ثم غدا الغد على بني قريظة بالكتائب ، وترك بني النضير ، ودعاهم إلى أن يعاهدوه ، فعاهدوه ، فانصرف عنهم . وغدا إلى بني النضير بالكتائب فقاتلهم ، حتى نزلوا على الجلاء . فجلت بنو النضير ، واحتملوا ما أقلت الإبل من أمتعتهم وأبواب بيوتهم وخشبها ، وكان نخل بني النضير لرسول الله - صلى الله عليه وسلم - خاصة ، أعطاه الله أياها وخصه بها ، فقال : ( وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ) يقول : بغير قتال ، فأعطى النبي - صلى الله عليه وسلم - أكثرها للمهاجرين ، قسمها بينهم ، وقسم منها لرجلين من الأنصار وكانا ذوي حاجة ، ولم يقسم من الأنصار غيرهما ، وبقي منها صدقة رسول الله - صلى الله عليه وسلم - التي في أيدي بني فاطمة .\nولنذكر ملخص غزوة بني النضير على وجه الاختصار ، وبالله المستعان .\nوكان سبب ذلك فيما ذكره أصحاب المغازي والسير : أنه لما قتل أصحاب بئر معونة ، من أصحاب رسول الله - صلى الله عليه وسلم - وكانوا سبعين ، وأفلت منهم عمرو بن أمية الضمري ، فلما كان في أثناء الطريق راجعا إلى المدينة قتل رجلين من بني عامر ، وكان معهما عهد من رسول الله - صلى الله عليه وسلم - وأمان لم يعلم به عمرو فلما رجع أخبر رسول الله - صلى الله عليه وسلم - فقال له رسول الله - صلى الله عليه وسلم - : \" لقد قتلت رجلين ، لأدينهما \" وكان بين بني النضير وبني عامر حلف وعهد ، فخرج رسول الله - صلى الله عليه وسلم - إلى بني النضير يستعينهم في دية ذينك الرجلين ، وكان منازل بني النضير ظاهر المدينة على أميال منها شرقيها .\nقال محمد بن إسحاق بن يسار في كتابه السيرة : ثم خرج رسول الله إلى بني النضير ، يستعينهم في دية ذينك القتيلين من بني عامر اللذين قتل عمرو بن أمية الضمري ; للجوار الذي كان رسول الله - صلى الله عليه وسلم - عقد لهما ، فيما حدثني يزيد بن رومان ، وكان بين بني النضير ، وبني عامر عقد وحلف . فلما أتاهم رسول الله - صلى الله عليه وسلم - يستعينهم في دية ذينك القتيلين قالوا : نعم ، يا أبا القاسم ، نعينك على ما أحببت ، مما استعنت بنا عليه . ثم خلا بعضهم ببعض فقالوا : إنكم لن تجدوا الرجل على مثل حاله هذه - ورسول الله - صلى الله عليه وسلم - إلى جنب جدار من بيوتهم - فمن رجل يعلو على هذا البيت ، فيلقي عليه صخرة ، فيريحنا منه ؟ فانتدب لذلك عمرو بن جحاش بن كعب أحدهم ، فقال : أنا لذلك ، فصعد ليلقي عليه صخرة كما قال ، ورسول الله - صلى الله عليه وسلم - في نفر من أصحابه ، فيهم أبو بكر ، وعمر ، وعلي رضي الله عنهم . فأتى رسول الله - صلى الله عليه وسلم - الخبر من السماء بما أراد القوم ، فقام وخرج راجعا إلى المدينة فلما استلبث النبي - صلى الله عليه وسلم - أصحابه قاموا في طلبه فلقوا رجلا مقبلا من المدينة فسألوه عنه ، فقال : رأيته داخلا المدينة . فأقبل أصحاب رسول الله - صلى الله عليه وسلم - حتى انتهوا إليه ، فأخبرهم الخبر بما كانت يهود أرادت من الغدر به ، وأمر رسول الله - صلى الله عليه وسلم - بالتهيؤ لحربهم والمسير إليهم . ثم سار حتى نزل بهم فتحصنوا منه في الحصون ، فأمر رسول الله - صلى الله عليه وسلم - بقطع النخل والتحريق فيها . فنادوه : أن يا محمد قد كنت تنهى عن الفساد وتعيبه على من صنعه ، فما بال قطع النخل وتحريقها ؟\nوقد كان رهط من بني عوف بن الخزرج ، منهم عبد الله بن أبي بن سلول ، ووديعة ، ومالك بن أبي قوقل ، وسويد ، وداعس ، قد بعثوا إلى بني النضير : أن اثبتوا وتمنعوا فإنا لن نسلمكم ، إن قوتلتم قاتلنا معكم ، وإن أخرجتم خرجنا معكم ، فتربصوا ذلك من نصرهم ، فلم يفعلوا ، وقذف الله في قلوبهم الرعب ، فسألوا رسول الله - صلى الله عليه وسلم - أن يجليهم ويكف عن دمائهم ، على أن لهم ما حملت الإبل من أموالهم إلا الحلقة ، ففعل ، فاحتملوا من أموالهم ما استقلت به الإبل ، فكان الرجل منهم يهدم بيته عن نجاف بابه ، فيضعه على ظهر بعيره فينطلق به . فخرجوا إلى خيبر ومنهم من سار إلى الشام وخلوا الأموال إلى رسول الله - صلى الله عليه وسلم - فكانت لرسول الله خاصة يضعها حيث شاء ، فقسمها على المهاجرين الأولين دون الأنصار . إلا أن سهل بن حنيف ، وأبا دجانة سماك بن خرشة ذكرا فقرا ، فأعطاهما رسول الله - صلى الله عليه وسلم - .\nقال : ولم يسلم من بني النضير إلا رجلان : يامين بن عمير بن كعب بن عمرو بن جحاش وأبو سعد بن وهب أسلما على أموالهما فأحرزاها .\nقال : ابن إسحاق : قد حدثني بعض آل يامين : أن رسول الله - صلى الله عليه وسلم - قال ليامين : \" ألم تر ما لقيت من ابن عمك ، وما هم به من شأني \" . فجعل يامين بن عمير لرجل جعلا على أن يقتل عمرو بن جحاش فقتله فيما يزعمون .\nقال ابن إسحاق : ونزل في بني النضير سورة الحشر بأسرها .\nوهكذا روى يونس بن بكير ، عن ابن إسحاق ، بنحو ما تقدم .\nفقوله : ( هو الذي أخرج الذين كفروا من أهل الكتاب ) يعني : بني النضير ( من ديارهم لأول الحشر ) .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا ابن أبي عمر ، حدثنا سفيان ، عن أبي سعد ، عن عكرمة ، عن ابن عباس قال : من شك في أن أرض المحشر ها هنا - يعني الشام فليتل هذه الآية : ( هو الذي أخرج الذين كفروا من أهل الكتاب من ديارهم لأول الحشر ) قال لهم رسول الله - صلى الله عليه وسلم - : \" اخرجوا \" . قالوا : إلى أين ؟ قال : \" إلى أرض المحشر \" .\nوحدثنا أبو سعيد الأشج ، حدثنا أبو أسامة ، عن عوف ، عن الحسن قال : لما أجلى رسول الله - صلى الله عليه وسلم - بني النضير قال : \" هذا أول الحشر ، وأنا على الأثر \" .\nورواه ابن جرير ، عن بندار عن ابن أبي عدي ، عن عوف عن الحسن به . وقوله : ( ما ظننتم أن يخرجوا ) أي : في مدة حصاركم لهم وقصرها ، وكانت ستة أيام ، مع شدة حصونهم ومنعتها ; ولهذا قال : ( وظنوا أنهم مانعتهم حصونهم من الله فأتاهم الله من حيث لم يحتسبوا ) أي : جاءهم من أمر الله ما لم يكن لهم في بال ، كما قال في الآية الأخرى : ( قد مكر الذين من قبلهم فأتى الله بنيانهم من القواعد فخر عليهم السقف من فوقهم وأتاهم العذاب من حيث لا يشعرون ) [ النحل : 26 ] .\nوقوله : ( وقذف في قلوبهم الرعب ) أي : الخوف والهلع والجزع ، وكيف لا يحصل لهم ذلك وقد حاصرهم الذي نصر بالرعب مسيرة شهر ، صلوات الله وسلامه عليه .\nوقوله : ( يخربون بيوتهم بأيديهم وأيدي المؤمنين ) قد تقدم تفسير ابن إسحاق لذلك ، وهو نقض ما استحسنوه من سقوفهم وأبوابهم ، وتحملها على الإبل ، وكذا قال عروة بن الزبير ، وعبد الرحمن بن زيد بن أسلم ، وغير واحد .\nوقال مقاتل بن حيان : كان رسول الله - صلى الله عليه وسلم - يقاتلهم ، فإذا ظهر على درب أو دار ، هدم حيطانها ليتسع المكان للقتال . وكان اليهود إذا علوا مكانا أو غلبوا على درب أو دار ، نقبوا من أدبارها ثم حصنوها ودربوها ، يقول الله تعالى : ( فاعتبروا يا أولي الأبصار ) .\n                                    ",
        "qortoby": "هُوَ ٱلَّذِيٓ أَخۡرَجَ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن دِيَٰرِهِمۡ لِأَوَّلِ ٱلۡحَشۡرِۚ مَا ظَنَنتُمۡ أَن يَخۡرُجُواْۖ وَظَنُّوٓاْ أَنَّهُم مَّانِعَتُهُمۡ حُصُونُهُم مِّنَ ٱللَّهِ فَأَتَىٰهُمُ ٱللَّهُ مِنۡ حَيۡثُ لَمۡ يَحۡتَسِبُواْۖ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَۚ يُخۡرِبُونَ بُيُوتَهُم بِأَيۡدِيهِمۡ وَأَيۡدِي ٱلۡمُؤۡمِنِينَ فَٱعۡتَبِرُواْ يَٰٓأُوْلِي ٱلۡأَبۡصَٰرِ ٢\n                                    \n                                    \n                                    قوله تعالى : هو الذي أخرج الذين كفروا من أهل الكتاب من ديارهم لأول الحشر ما ظننتم أن يخرجوا وظنوا أنهم مانعتهم حصونهم من الله فأتاهم الله من حيث لم يحتسبوا وقذف في قلوبهم الرعب يخربون بيوتهم بأيديهم وأيدي المؤمنين فاعتبروا يا أولي الأبصار\nقوله تعالى : هو الذي أخرج الذين كفروا من أهل الكتاب من ديارهم لأول الحشر فيه ثلاث مسائل : الأولى : قوله تعالى : هو الذي أخرج الذين كفروا من أهل الكتاب من ديارهم قال سعيد بن جبير : قلت لابن عباس : سورة الحشر ؟ قال : قل سورة النضير ; وهم رهط من اليهود من ذرية هارون عليه السلام ، نزلوا المدينة في فتن بني إسرائيل انتظارا لمحمد صلى الله عليه وسلم ، وكان من أمرهم ما نص الله عليه .\nالثانية : قوله تعالى : لأول الحشر ؛ الحشر الجمع ; وهو على أربعة أوجه : حشران في الدنيا وحشران في الآخرة ; أما الذي في الدنيا فقوله تعالى : هو الذي أخرج الذين كفروا من أهل الكتاب من ديارهم لأول الحشر قال الزهري : كانوا من سبط لم يصبهم جلاء ، وكان الله عز وجل قد كتب عليهم الجلاء ; فلولا ذلك لعذبهم في الدنيا ، وكان أول حشر حشروا في الدنيا إلى الشام . قال ابن عباس وعكرمة : من شك أن المحشر في الشام فليقرأ هذه الآية ، وأن النبي صلى الله عليه وسلم قال لهم : \" اخرجوا \" . قالوا : إلى أين ؟ قال : \" إلى أرض المحشر \" . قال قتادة : هذا أول المحشر . قال ابن عباس : هم أول من حشر من أهل الكتاب وأخرج من دياره . وقيل : إنهم أخرجوا إلى خيبر ، وأن معنى \" لأول الحشر \" إخراجهم من حصونهم إلى خيبر ، وآخره إخراج عمر رضي الله عنه إياهم من خيبر إلى نجد وأذرعات . وقيل تيماء وأريحاء ، وذلك بكفرهم ونقض عهدهم .\nوأما الحشر الثاني : فحشرهم قرب القيامة . قال قتادة : تأتي نار تحشر الناس من المشرق إلى المغرب ، تبيت معهم حيث باتوا ، وتقيل معهم حيث قالوا ، وتأكل منهم من تخلف . وهذا ثابت في الصحيح ، وقد ذكرناه في ( كتاب التذكرة ) . ونحوه روى ابن وهب عن مالك قال : قلت لمالك هو جلاؤهم من ديارهم ؟ فقال لي : الحشر يوم القيامة حشر اليهود . قال : وأجلى رسول الله صلى الله عليه وسلم اليهود إلى خيبر حين سئلوا عن المال فكتموه ; فاستحلهم بذلك . قال ابن العربي : للحشر أول ووسط وآخر ; فالأول إجلاء بني النضير ، والأوسط إجلاء خيبر ، والآخر حشر يوم القيامة . وعن الحسن : هم بنو قريظة . وخالفه بقية المفسرين وقالوا : بنو قريظة ما حشروا ولكنهم قتلوا . حكاه الثعلبي .\nالثالثة : قال الكيا الطبري : ومصالحة أهل الحرب على الجلاء من ديارهم من غير شيء لا يجوز الآن ، وإنما كان ذلك في أول الإسلام ثم نسخ . والآن فلا بد من قتالهم أو سبيهم أو ضرب الجزية عليهم .\nقوله تعالى : ما ظننتم أن يخرجوا يريد لعظم أمر اليهود ومنعتهم وقوتهم في صدور المسلمين ، واجتماع كلمتهم .\nوظنوا أنهم مانعتهم حصونهم قيل : هي الوطيح والنطاة والسلالم والكتيبة .\nمن الله أي من أمره . وكانوا أهل حلقة - أي سلاح كثير - وحصون منيعة ; فلم يمنعهم شيء منها .\nفأتاهم الله أي أمره وعذابه .\nمن حيث لم يحتسبوا أي لم يظنوا . وقيل : من حيث لم يعلموا . وقيل : من حيث لم يحتسبوا بقتل كعب بن الأشرف ; قاله ابن جريج والسدي وأبو صالح .\nقوله تعالى : وقذف في قلوبهم الرعب بقتل سيدهم كعب بن الأشرف ; وكان الذي قتله هو محمد بن مسلمة وأبو نائلة سلكان بن سلامة بن وقش - وكان أخا كعب بن الأشرف من الرضاعة - وعباد بن بشر بن وقش ، والحارث بن أوس بن معاذ ، وأبو عبس بن جبر . وخبره مشهور في السيرة . وفي الصحيح أن النبي صلى الله عليه وسلم قال : \" نصرت بالرعب بين يدي مسيرة شهر \" فكيف لا ينصر به مسيرة ميل من المدينة إلى محلة بني النضير . وهذه خصيصى لمحمد صلى الله عليه وسلم دون غيره .\nقوله تعالى : يخربون بيوتهم قراءة العامة بالتخفيف من أخرب ; أي يهدمون . وقرأ السلمي والحسن ونصر بن عاصم وأبو العالية وقتادة وأبو عمرو \" يخربون \" بالتشديد من التخريب . قال أبو عمرو : إنما اخترت التشديد لأن الإخراب ترك الشيء خرابا بغير ساكن ، وبنو النضر لم يتركوها خرابا وإنما خربوها بالهدم .\nيؤيده قوله تعالى : بأيديهم وأيدي المؤمنين وقال آخرون : التخريب والإخراب بمعنى واحد ، والتشديد بمعنى التكثير . وحكى سيبويه : أن معنى فعلت وأفعلت يتعاقبان ; نحو أخربته وخربته وأفرحته وفرحته . واختار أبو عبيد وأبو حاتم الأولى . قال قتادة والضحاك : كان المؤمنون يخربون من خارج ليدخلوا ، واليهود يخربون من داخل ليبنوا به ما خرب من حصنهم . فروي أنهم صالحوا رسول الله صلى الله عليه وسلم على ألا يكونوا عليه ولا له ; فلما ظهر يوم بدر قالوا : هو النبي الذي نعت في التوراة ، فلا ترد له راية . فلما هزم المسلمون يوم أحد ارتابوا ونكثوا ، فخرج كعب بن الأشرف في أربعين راكبا إلى مكة ، فحالفوا عليه قريشا عند الكعبة ، فأمر عليه السلام محمد بن مسلمة الأنصاري فقتل كعبا غيلة ، ثم صبحهم بالكتائب ; فقال لهم : اخرجوا من المدينة . فقالوا : الموت أحب إلينا من ذلك ; فتنادوا بالحرب . وقيل : استمهلوا رسول الله صلى الله عليه وسلم عشرة أيام ليتجهزوا للخروج ، فدس إليهم عبد الله بن أبي المنافق وأصحابه : لا تخرجوا من الحصن ، فإن قاتلوكم فنحن معكم لا نخذلكم ، ولئن أخرجتم لنخرجن معكم . فدربوا على الأزقة وحصنوها إحدى وعشرين ليلة ، فلما قذف الله في قلوبهم الرعب وأيسوا من نصر المنافقين طلبوا الصلح ; فأبى عليهم إلا الجلاء ; على ما يأتي بيانه . وقال الزهري وابن زيد وعروة بن الزبير : لما صالحهم النبي صلى الله عليه وسلم على أن لهم ما أقلت الإبل ; كانوا يستحسنون الخشبة والعمود فيهدمون بيوتهم ويحملون ذلك على إبلهم ويخرب المؤمنون باقيها . وعن ابن زيد أيضا : كانوا يخربونها لئلا يسكنها المسلمون بعدهم . وقال ابن عباس : كانوا كلما ظهر المسلمون على دار من دورهم هدموها ليتسع موضع القتال ، وهم ينقبون دورهم من أدبارها إلى التي بعدها ليتحصنوا فيها ، ويرموا بالتي أخرجوا منها المسلمين . وقيل : ليسدوا بها أزقتهم . وقال عكرمة بأيديهم في إخراب دواخلها وما فيها لئلا يأخذه المسلمون . و أيدي المؤمنين في إخراب ظاهرها ليصلوا بذلك إليهم . قال عكرمة : كانت منازلهم مزخرفة فحسدوا المسلمين أن يسكنوها ، فخربوها من داخل وخربها المسلمون من خارج . وقيل : يخربون بيوتهم بنقض المواعدة ، وأيدي المؤمنين بالمقاتلة ; قاله الزهري أيضا . وقال أبو عمرو بن العلاء \" بأيديهم \" في تركهم لها . و \" أيدي المؤمنين \" في إجلائهم عنها . قال ابن العربي : التناول للإفساد إذا كان باليد كان حقيقة ، وإذا كان بنقض العهد كان مجازا ; إلا أن قول الزهري في المجاز أمثل من قول أبي عمرو بن العلاء .\nقوله تعالى : \" فاعتبروا يا أولي \" أي اتعظوا يا أصحاب العقول والألباب . وقيل : يا من عاين ذلك ببصره ; فهو جمع للبصر . ومن جملة الاعتبار هنا أنهم اعتصموا بالحصون من الله فأنزلهم الله منها . ومن وجوهه : أنه سلط عليهم من كان ينصرهم . ومن وجوهه أيضا : أنهم هدموا أموالهم بأيديهم . ومن لم يعتبر بغيره اعتبر في نفسه . وفي الأمثال الصحيحة : \" السعيد من وعظ بغيره \" .\n                                    ",
        "saadi": "هُوَ ٱلَّذِيٓ أَخۡرَجَ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن دِيَٰرِهِمۡ لِأَوَّلِ ٱلۡحَشۡرِۚ مَا ظَنَنتُمۡ أَن يَخۡرُجُواْۖ وَظَنُّوٓاْ أَنَّهُم مَّانِعَتُهُمۡ حُصُونُهُم مِّنَ ٱللَّهِ فَأَتَىٰهُمُ ٱللَّهُ مِنۡ حَيۡثُ لَمۡ يَحۡتَسِبُواْۖ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَۚ يُخۡرِبُونَ بُيُوتَهُم بِأَيۡدِيهِمۡ وَأَيۡدِي ٱلۡمُؤۡمِنِينَ فَٱعۡتَبِرُواْ يَٰٓأُوْلِي ٱلۡأَبۡصَٰرِ ٢\n                                        \n                                        \n                                        \n                                        وكان إخراجهم منها أول حشر وجلاء كتبه الله عليهم على يد رسوله محمد صلى الله عليه وسلم، فجلوا إلى خيبر، ودلت الآية الكريمة أن لهم حشرا وجلاء غير هذا، فقد وقع حين أجلاهم النبي صلى الله عليه وسلم من خيبر، ثم عمر رضي الله عنه، [أخرج بقيتهم منها].\n{ مَا ظَنَنْتُمْ } أيها المسلمون { أَنْ يَخْرُجُوا } من ديارهم، لحصانتها، ومنعتها، وعزهم فيها.\n{ وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ } فأعجبوا بها وغرتهم، وحسبوا أنهم لا ينالون بها، ولا يقدر عليها أحد، وقدر الله تعالى وراء ذلك كله، لا تغني عنه الحصون والقلاع، ولا تجدي فيهم القوة والدفاع.\nولهذا قال: { فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا } أي: من الأمر والباب، الذي لم يخطر ببالهم أن يؤتوا منه، وهو أنه تعالى { قذف فِي قُلُوبِهِمُ الرُّعْبَ } وهو الخوف الشديد، الذي هو جند الله الأكبر، الذي لا ينفع معه عدد ولا عدة، ولا قوة ولا شدة، فالأمر الذي يحتسبونه ويظنون أن الخلل يدخل عليهم منه إن دخل هو الحصون التي تحصنوا بها، واطمأنت نفوسهم إليها، ومن وثق بغير الله فهو مخذول، ومن ركن إلى غير الله فهو عليه وبال فأتاهم أمر سماوي نزل على قلوبهم، التي هي محل الثبات والصبر، أو الخور والضعف، فأزال الله قوتها وشدتها، وأورثها ضعفا وخورا وجبنا، لا حيلة لهم ولا منعة معه فصار ذلك عونا عليهم، ولهذا قال: { يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ } وذلك أنهم صالحوا النبي صلى الله عليه وسلم، على أن لهم ما حملت الإبل.\nفنقضوا لذلك كثيرا من سقوفهم، التي استحسنوها، وسلطوا المؤمنين بسبب بغيهم على إخراب ديارهم وهدم حصونهم، فهم الذين جنوا على أنفسهم، وصاروا من أكبر عون عليها، { فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ } أي: البصائر النافذة، والعقول الكاملة، فإن في هذا معتبرا يعرف به صنع الله تعالى في المعاندين للحق، المتبعين لأهوائهم، الذين لم تنفعهم عزتهم، ولا منعتهم قوتهم، ولا حصنتهم حصونهم، حين جاءهم أمر الله، ووصل إليهم النكال بذنوبهم، والعبرة بعموم اللفظ لا بخصوص السبب، فإن هذه الآية تدل على الأمر بالاعتبار، وهو اعتبار النظير بنظيره، وقياس الشيء على مثله، والتفكر فيما تضمنته الأحكام من المعاني والحكم التي هي محل العقل والفكرة، وبذلك يزداد العقل، وتتنور البصيرة ويزداد الإيمان، ويحصل الفهم الحقيقي، ثم أخبر تعالى أن هؤلاء اليهود لم يصبهم جميع ما يستحقون من العقوبة، وأن الله خفف عنهم.\n                                    "
      },
      "originalText": "هُوَ ٱلَّذِيٓ أَخۡرَجَ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن دِيَٰرِهِمۡ لِأَوَّلِ ٱلۡحَشۡرِۚ مَا ظَنَنتُمۡ أَن يَخۡرُجُواْۖ وَظَنُّوٓاْ أَنَّهُم مَّانِعَتُهُمۡ حُصُونُهُم مِّنَ ٱللَّهِ فَأَتَىٰهُمُ ٱللَّهُ مِنۡ حَيۡثُ لَمۡ يَحۡتَسِبُواْۖ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَۚ يُخۡرِبُونَ بُيُوتَهُم بِأَيۡدِيهِمۡ وَأَيۡدِي ٱلۡمُؤۡمِنِينَ فَٱعۡتَبِرُواْ يَٰٓأُوْلِي ٱلۡأَبۡصَٰرِ ٢"
    },
    {
      "number": 5129,
      "text": "وَلَوْلَا أَنْ كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 3,
      "juz": 28,
      "manzil": 7,
      "page": 545,
      "ruku": 479,
      "hizbQuarter": 218,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡلَآ أَن كَتَبَ ٱللَّهُ عَلَيۡهِمُ ٱلۡجَلَآءَ لَعَذَّبَهُمۡ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابُ ٱلنَّارِ ٣\n                                    \n                                    \n                                    وقوله : ( ولولا أن كتب الله عليهم الجلاء لعذبهم في الدنيا ) أي : لولا أن كتب الله عليهم هذا الجلاء ، وهو النفي من ديارهم وأموالهم ، لكان لهم عند الله عذاب آخر من القتل والسبي ، ونحو ذلك ، قاله الزهري ، عن عروة ، والسدي ، وابن زيد ; لأن الله قد كتب عليهم أنه سيعذبهم في الدار الدنيا مع ما أعد لهم في الآخرة من العذاب في نار جهنم .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا عبد الله بن صالح - كاتب الليث - حدثني الليث عن عقيل ، عن ابن شهاب قال : أخبرني عروة بن الزبير قال : ثم كانت وقعة بني النضير ، وهم طائفة من اليهود على رأس ستة أشهر من وقعة بدر . وكان منزلهم بناحية من المدينة فحاصرهم رسول الله - صلى الله عليه وسلم - حتى نزلوا من الجلاء ، وأن لهم ما أقلت الإبل من الأموال والأمتعة إلا الحلقة ، وهي السلاح ، فأجلاهم رسول الله - صلى الله عليه وسلم - قبل الشام . قال : والجلاء أنه كتب عليهم في آي من التوراة ، وكانوا من سبط لم يصبهم الجلاء قبل ما سلط عليه رسول الله - صلى الله عليه وسلم - وأنزل الله فيهم : ( سبح لله ما في السماوات وما في الأرض ) إلى قوله ( وليخزي الفاسقين ) .\nوقال عكرمة : الجلاء : القتل . وفي رواية عنه : الفناء .\nوقال قتادة : الجلاء : خروج الناس من البلد إلى البلد .\nوقال الضحاك : أجلاهم إلى الشام وأعطى كل ثلاثة بعيرا وسقاء ، فهذا الجلاء .\nوقد قال الحافظ أبو بكر البيهقي : أخبرنا أبو عبد الله الحافظ ، أخبرنا أحمد بن كامل القاضي ، حدثنا محمد بن سعيد العوفي ، حدثني أبي ، عن عمي ، حدثني أبي ، عن جدي ، عن ابن عباس قال : كان النبي - صلى الله عليه وسلم - قد حاصرهم حتى بلغ منهم كل مبلغ ، فأعطوه ما أراد منهم ، فصالحهم على أن يحقن لهم دماءهم ، وأن يخرجهم من أرضهم ، ومن ديارهم ، وأوطانهم ، وأن يسيرهم إلى أذرعات الشام وجعل لكل ثلاثة منهم بعيرا وسقاء ، والجلاء إخراجهم من أرضهم إلى أرض أخرى\nوروي أيضا من حديث يعقوب بن محمد الزهري ، عن إبراهيم بن جعفر بن محمود بن محمد بن مسلمة ، عن أبيه ، عن جده ، عن محمد بن مسلمة أن رسول الله - صلى الله عليه وسلم - بعثه إلى بني النضير ، وأمره أن يؤجلهم في الجلاء ثلاث ليال .\nوقوله : ( ولهم في الآخرة عذاب النار ) أي : حتم لازم لا بد لهم منه .\n                                    ",
        "qortoby": "وَلَوۡلَآ أَن كَتَبَ ٱللَّهُ عَلَيۡهِمُ ٱلۡجَلَآءَ لَعَذَّبَهُمۡ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابُ ٱلنَّارِ ٣\n                                    \n                                    \n                                    قوله تعالى : ولولا أن كتب الله عليهم الجلاء لعذبهم في الدنيا ولهم في الآخرة عذاب النار\nقوله تعالى : ولولا أن كتب الله عليهم الجلاء أي لولا أنه قضى أنه سيجليهم عن دارهم وأنهم يبقون مدة فيؤمن بعضهم ويولد لهم من يؤمن .\nلعذبهم في الدنيا أي بالقتل والسبي كما فعل ببني قريظة . والجلاء مفارقة الوطن يقال : جلا بنفسه جلاء ، وأجلاه غيره إجلاء . والفرق بين الجلاء والإخراج وإن كان معناهما في الإبعاد واحدا من وجهين : أحدهما : أن الجلاء ما كان مع الأهل والولد ، والإخراج قد يكون مع بقاء الأهل والولد . الثاني : أن الجلاء لا يكون إلا لجماعة ، والإخراج يكون لواحد ولجماعة ; قاله الماوردي .\n                                    ",
        "saadi": "وَلَوۡلَآ أَن كَتَبَ ٱللَّهُ عَلَيۡهِمُ ٱلۡجَلَآءَ لَعَذَّبَهُمۡ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابُ ٱلنَّارِ ٣\n                                        \n                                        \n                                        \n                                        فلولا أنه كتب عليهم الجلاء الذي أصابهم وقضاه عليهم وقدره بقدره الذي لا يبدل ولا يغير، لكان لهم شأن آخر من عذاب الدنيا ونكالها، ولكنهم - وإن فاتهم العذاب الشديد الدنيوي - فإن لهم في الآخرة عذاب النار، الذي لا يمكن أن يعلم شدته إلا الله تعالى، فلا يخطر ببالهم أن عقوبتهم قد انقضت وفرغت ولم يبق لهم منها بقية، فما أعد الله لهم من العذاب في الآخرة أعظم وأطم.\n                                    "
      },
      "originalText": "وَلَوۡلَآ أَن كَتَبَ ٱللَّهُ عَلَيۡهِمُ ٱلۡجَلَآءَ لَعَذَّبَهُمۡ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابُ ٱلنَّارِ ٣"
    }
  ]
}