{
  "number": 547,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 5136,
      "text": "وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 10,
      "juz": 28,
      "manzil": 7,
      "page": 547,
      "ruku": 479,
      "hizbQuarter": 218,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّذِينَ جَآءُو مِنۢ بَعۡدِهِمۡ يَقُولُونَ رَبَّنَا ٱغۡفِرۡ لَنَا وَلِإِخۡوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلۡإِيمَٰنِ وَلَا تَجۡعَلۡ فِي قُلُوبِنَا غِلّٗا لِّلَّذِينَ ءَامَنُواْ رَبَّنَآ إِنَّكَ رَءُوفٞ رَّحِيمٌ ٠١\n                                    \n                                    \n                                    وقوله : ( والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رءوف رحيم ) هؤلاء هم القسم الثالث ممن يستحق فقراؤهم من مال الفيء ، وهم المهاجرون ثم الأنصار ، ثم التابعون بإحسان ، كما قال في آية \" براءة \" : ( والسابقون الأولون من المهاجرين والأنصار والذين اتبعوهم بإحسان رضي الله عنهم ) [ التوبة : 100 ] فالتابعون لهم بإحسان هم : المتبعون لآثارهم الحسنة وأوصافهم الجميلة ، الداعون لهم في السر والعلانية ; ولهذا قال في هذه الآية الكريمة : ( والذين جاءوا من بعدهم يقولون ) أي : قائلين : ( ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا ) أي : بغضا وحسدا ( للذين آمنوا ربنا إنك رءوف رحيم ) وما أحسن ما استنبط الإمام مالك من هذه الآية الكريمة : أن الرافضي الذي يسب الصحابة ليس له في مال الفيء نصيب لعدم اتصافه بما مدح الله به هؤلاء في قولهم : ( ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رءوف رحيم ) .\nوقال ابن أبي حاتم : حدثنا موسى بن عبد الرحمن المسروقي ، حدثنا محمد بن بشر ، حدثنا إسماعيل بن إبراهيم بن مهاجر ، عن أبيه ، عن عائشة أنها قالت : أمروا أن يستغفروا لهم ، فسبوهم ! ثم قرأت هذه الآية : ( والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ) الآية .\nوقال إسماعيل بن علية ، عن عبد الملك بن عمير ، عن مسروق ، عن عائشة قالت : أمرتم بالاستغفار لأصحاب محمد - صلى الله عليه وسلم - فسببتموهم . سمعت نبيكم - صلى الله عليه وسلم - يقول : \" لا تذهب هذه الأمة حتى يلعن آخرها أولها \" . رواه البغوي . .\nوقال أبو داود : حدثنا مسدد ، حدثنا إسماعيل بن إبراهيم ، حدثنا أيوب ، عن الزهري قال : قال عمر رضي الله عنه : ( وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ) قال الزهري : قال عمر : هذه لرسول الله - صلى الله عليه وسلم - خاصة ، قرى عربية : فدك وكذا وكذا ، فما أفاء الله على رسوله من أهل القرى فلله وللرسول ولذي القربى واليتامى والمساكين وابن السبيل وللفقراء الذين أخرجوا من ديارهم وأموالهم ، ( والذين تبوءوا الدار والإيمان من قبلهم ) ( والذين جاءوا من بعدهم ) فاستوعبت هذه الآية الناس ، فلم يبق أحد من المسلمين إلا له فيها حق - قال أيوب : أو قال : حظ - إلا بعض من تملكون من أرقائكم . كذا رواه أبو داود ، وفيه انقطاع .\nوقال ابن جرير : حدثنا ابن عبد الأعلى ، حدثنا ابن ثور ، عن معمر ، عن أيوب ، عن عكرمة بن خالد ، عن مالك بن أوس بن الحدثان قال : قرأ عمر بن الخطاب : ( إنما الصدقات للفقراء والمساكين ) حتى بلغ ( عليم حكيم ) [ التوبة : 60 ] ، ثم قال هذه لهؤلاء ، ثم قرأ : ( واعلموا أنما غنمتم من شيء فأن لله خمسه وللرسول ولذي القربى واليتامى والمساكين ) [ الأنفال : 41 ] ، ثم قال : هذه لهؤلاء ، ثم قرأ : ( ما أفاء الله على رسوله من أهل القرى ) حتى بلغ للفقراء ( والذين تبوءوا الدار والإيمان ) ( والذين جاءوا من بعدهم ) ثم قال : استوعبت هذه الآية المسلمين عامة وليس أحد إلا له فيها حق ، ثم قال : لئن عشت ليأتين الراعي - وهو بسرو حمير - نصيبه فيها ، لم يعرق فيها جبينه .\n                                    ",
        "qortoby": "وَٱلَّذِينَ جَآءُو مِنۢ بَعۡدِهِمۡ يَقُولُونَ رَبَّنَا ٱغۡفِرۡ لَنَا وَلِإِخۡوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلۡإِيمَٰنِ وَلَا تَجۡعَلۡ فِي قُلُوبِنَا غِلّٗا لِّلَّذِينَ ءَامَنُواْ رَبَّنَآ إِنَّكَ رَءُوفٞ رَّحِيمٌ ٠١\n                                    \n                                    \n                                    قوله تعالى : والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رءوف رحيم\nفيه أربع مسائل :\nالأولى : قوله تعالى : والذين جاءوا من بعدهم يعني التابعين ومن دخل في الإسلام إلى يوم القيامة . قال ابن أبي ليلى : الناس على ثلاثة منازل : المهاجرون ، والذين تبوءوا الدار والإيمان ، والذين جاءوا من بعدهم . فاجهد ألا تخرج من هذه المنازل . وقال بعضهم : كن شمسا ، فإن لم تستطع فكن قمرا ، فإن لم تستطع فكن كوكبا مضيئا ، فإن لم تستطع فكن كوكبا صغيرا ، ومن جهة النور لا تنقطع . ومعنى هذا : كن مهاجريا . فإن قلت : لا أجد ، فكن أنصاريا . فإن لم تجد فاعمل كأعمالهم ، فإن لم تستطع فأحبهم واستغفر لهم كما أمرك الله . وروى مصعب بن سعد قال : الناس على ثلاثة منازل ، فمضت منزلتان وبقيت منزلة ; فأحسن ما أنتم عليه أن تكونوا بهذه المنزلة التي بقيت . وعن جعفر بن محمد بن علي عن أبيه عن جده علي بن الحسين رضي الله عنه ، أنه جاءه رجل فقال له : يا ابن بنت رسول الله صلى الله عليه وسلم ، ما تقول في عثمان ؟ فقال له : يا أخي أنت من قوم قال الله فيهم : للفقراء المهاجرين الآية . قال : لا . قال : فوالله لئن لم تكن من أهل الآية فأنت من قوم قال الله فيهم : والذين تبوءوا الدار والإيمان الآية . قال : لا . قال : فوالله لئن لم تكن من أهل الآية الثالثة لتخرجن من الإسلام وهي قوله تعالى : والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان الآية . وقد قيل : إن محمد بن علي بن الحسين ، رضي الله عنهم ، روى عن أبيه : أن نفرا من أهل العراق جاءوا إليه ، فسبوا أبا بكر وعمر - رضي الله عنهما - ثم عثمان - رضي الله عنه - فأكثروا ; فقال لهم : أمن المهاجرين الأولين أنتم ؟ قالوا : لا . فقال : أفمن الذين تبوءوا الدار والإيمان من قبلهم ؟ فقالوا : لا . فقال : قد تبرأتم من هذين الفريقين ! أنا أشهد أنكم لستم من الذين قال الله عز وجل : والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رءوف رحيم قوموا ، فعل الله بكم وفعل ذكره النحاس .\nالثانية : هذه الآية دليل على وجوب محبة الصحابة ; لأنه جعل لمن بعدهم حظا في الفيء ما أقاموا على محبتهم وموالاتهم والاستغفار لهم ، وأن من سبهم أو واحدا منهم أو اعتقد فيه شرا أنه لا حق له في الفيء ; روي ذلك عن مالك وغيره . قال مالك : من كان يبغض أحدا من أصحاب محمد صلى الله عليه وسلم ، أو كان في قلبه عليهم غل ، فليس له حق في فيء المسلمين ; ثم قرأ : والذين جاءوا من بعدهم الآية .\nالثالثة : هذه الآية تدل على أن الصحيح من أقوال العلماء قسمة المنقول ، وإبقاء العقار والأرض شملا بين المسلمين أجمعين ; كما فعل عمر رضي الله عنه ; إلا أن يجتهد الوالي فينفذ أمرا فيمضي عمله فيه لاختلاف الناس عليه وأن هذه الآية قاضية بذلك ; لأن الله تعالى أخبر عن الفيء وجعله لثلاث طوائف : المهاجرين والأنصار - وهم معلومون - والذين جاءوا من بعدهم يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان . فهي عامة في جميع التابعين والآتين بعدهم إلى يوم الدين . وفي الحديث الصحيح : أن النبي صلى الله عليه وسلم خرج إلى المقبرة فقال : \" السلام عليكم دار قوم مؤمنين ، وإنا إن شاء الله بكم لاحقون ، وددت أن رأيت إخواننا \" . قالوا : يا رسول الله ، ألسنا بإخوانك ؟ فقال : \" بل أنتم أصحابي ، وإخواننا الذين لم يأتوا بعد ، وأنا فرطهم على الحوض \" . فبين صلى الله عليه وسلم أن إخوانهم كل من يأتي بعدهم ; لا كما قال السدي والكلبي : إنهم الذين هاجروا بعد ذلك . وعن الحسن أيضا والذين جاءوا من بعدهم من قصد إلى النبي صلى الله عليه وسلم إلى المدينة بعد انقطاع الهجرة .\nالرابعة : قوله تعالى : يقولون نصب في موضع الحال ; أي قائلين .\nربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان فيه وجهان : أحدهما : أمروا أن يستغفروا لمن سبق هذه الأمة من مؤمني أهل الكتاب . قالت عائشة رضي الله عنها : فأمروا أن يستغفروا لهم فسبوهم . الثاني : أمروا أن يستغفروا للسابقين الأولين من المهاجرين والأنصار . قال ابن عباس : أمر الله تعالى بالاستغفار لأصحاب محمد صلى الله عليه وسلم ، وهو يعلم أنهم سيفتنون . وقالت عائشة : أمرتم بالاستغفار لأصحاب محمد فسببتموهم ، سمعت نبيكم صلى الله عليه وسلم يقول : \" لا تذهب هذه الأمة حتى يلعن آخرها أولها \" وقال ابن عمر : سمعت رسول الله صلى الله عليه وسلم يقول : \" إذا رأيتم الذين يسبون أصحابي فقولوا لعن الله أشركم \" . وقال العوام بن حوشب : أدركت صدر هذه الأمة يقولون : اذكروا محاسن أصحاب رسول الله صلى الله عليه وسلم حتى تألف عليهم القلوب ، ولا تذكروا ما شجر بينهم فتجسروا الناس عليهم . وقال الشعبي : تفاضلت اليهود والنصارى على الرافضة بخصلة ، سئلت اليهود : من خير أهل ملتكم ؟ فقالوا : أصحاب موسى . وسئلت النصارى : من خير أهل ملتكم ؟ فقالوا : أصحاب عيسى . وسئلت الرافضة من شر أهل ملتكم ؟ فقالوا : أصحاب محمد ، أمروا بالاستغفار لهم فسبوهم ، فالسيف عليهم مسلول إلى يوم القيامة ، لا تقوم لهم راية ، ولا تثبت لهم قدم ، ولا تجتمع لهم كلمة ، كلما أوقدوا نارا للحرب أطفأها الله بسفك دمائهم وإدحاض حجتهم . أعاذنا الله وإياكم من الأهواء المضلة . ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رءوف رحيم أي حقدا وحسدا ربنا إنك رءوف رحيم\n                                    ",
        "saadi": "وَٱلَّذِينَ جَآءُو مِنۢ بَعۡدِهِمۡ يَقُولُونَ رَبَّنَا ٱغۡفِرۡ لَنَا وَلِإِخۡوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلۡإِيمَٰنِ وَلَا تَجۡعَلۡ فِي قُلُوبِنَا غِلّٗا لِّلَّذِينَ ءَامَنُواْ رَبَّنَآ إِنَّكَ رَءُوفٞ رَّحِيمٌ ٠١\n                                        \n                                        \n                                        \n                                        وحسب من بعدهم من الفضل أن يسير خلفهم، ويأتم بهداهم، ولهذا ذكر الله من اللاحقين، من هو مؤتم بهم وسائر خلفهم فقال: { وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ } أي: من بعد المهاجرين والأنصار { يَقُولُونَ } على وجه النصح لأنفسهم ولسائر المؤمنين: { رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ }\nوهذا دعاء شامل لجميع المؤمنين، السابقين من الصحابة، ومن قبلهم ومن بعدهم، وهذا من فضائل الإيمان أن المؤمنين ينتفع بعضهم ببعض، ويدعو بعضهم لبعض، بسبب المشاركة في الإيمان المقتضي لعقد الأخوة بين المؤمنين التي من فروعها أن يدعو بعضهم لبعض، وأن يحب بعضهم بعضا.\nولهذا ذكر الله في الدعاء نفي الغل عن القلب، الشامل لقليل الغل وكثيره الذي إذا انتفى ثبت ضده، وهو المحبة بين المؤمنين والموالاة والنصح، ونحو ذلك مما هو من حقوق المؤمنين.\nفوصف الله من بعد الصحابة بالإيمان، لأن قولهم: { سَبَقُونَا بِالْإِيمَانِ } دليل على المشاركة في الإيمان وأنهم تابعون للصحابة في عقائد الإيمان وأصوله، وهم أهل السنة والجماعة، الذين لا يصدق هذا الوصف التام إلا عليهم، ووصفهم بالإقرار بالذنوب والاستغفار منها، واستغفار بعضهم لبعض، واجتهادهم في إزالة الغل والحقد عن قلوبهم لإخوانهم المؤمنين، لأن دعاءهم بذلك مستلزم لما ذكرنا، ومتضمن لمحبة بعضهم بعضا، وأن يحب أحدهم لأخيه ما يحب لنفسه وأن ينصح له حاضرا وغائبا، حيا وميتا، ودلت الآية الكريمة [على] أن هذا من جملة حقوق المؤمنين بعضهم لبعض، ثم ختموا دعاءهم باسمين كريمين، دالين على كمال رحمة الله وشدة رأفته وإحسانه بهم، الذي من جملته، بل من أجله، توفيقهم للقيام بحقوق الله وحقوق عباده.\nفهؤلاء الأصناف الثلاثة هم أصناف هذه الأمة، وهم المستحقون للفيء الذي مصرفه راجع إلى مصالح الإسلام.\nوهؤلاء أهله الذين هم أهله، جعلنا الله منهم، بمنه وكرمه.\n                                    "
      },
      "originalText": "وَٱلَّذِينَ جَآءُو مِنۢ بَعۡدِهِمۡ يَقُولُونَ رَبَّنَا ٱغۡفِرۡ لَنَا وَلِإِخۡوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلۡإِيمَٰنِ وَلَا تَجۡعَلۡ فِي قُلُوبِنَا غِلّٗا لِّلَّذِينَ ءَامَنُواْ رَبَّنَآ إِنَّكَ رَءُوفٞ رَّحِيمٌ ٠١"
    },
    {
      "number": 5137,
      "text": "۞ أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِنْ قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 11,
      "juz": 28,
      "manzil": 7,
      "page": 547,
      "ruku": 480,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نَافَقُواْ يَقُولُونَ لِإِخۡوَٰنِهِمُ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ لَئِنۡ أُخۡرِجۡتُمۡ لَنَخۡرُجَنَّ مَعَكُمۡ وَلَا نُطِيعُ فِيكُمۡ أَحَدًا أَبَدٗا وَإِن قُوتِلۡتُمۡ لَنَنصُرَنَّكُمۡ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ ١١\n                                    \n                                    \n                                    يخبر تعالى عن المنافقين كعبد الله بن أبي وأضرابه ، حين بعثوا إلى يهود بني النضير يعدونهم النصر من أنفسهم ، فقال تعالى : ( ألم تر إلى الذين نافقوا يقولون لإخوانهم الذين كفروا من أهل الكتاب لئن أخرجتم لنخرجن معكم ولا نطيع فيكم أحدا أبدا وإن قوتلتم لننصرنكم ) قال الله تعالى : ( والله يشهد إنهم لكاذبون ) أي : لكاذبون فيما وعدوهم به إما أنهم قالوا لهم قولا من نيتهم ألا يفوا لهم به ، وإما أنهم لا يقع منهم الذي قالوه ;\n                                    ",
        "qortoby": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نَافَقُواْ يَقُولُونَ لِإِخۡوَٰنِهِمُ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ لَئِنۡ أُخۡرِجۡتُمۡ لَنَخۡرُجَنَّ مَعَكُمۡ وَلَا نُطِيعُ فِيكُمۡ أَحَدًا أَبَدٗا وَإِن قُوتِلۡتُمۡ لَنَنصُرَنَّكُمۡ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ ١١\n                                    \n                                    \n                                    قوله تعالى : ألم تر إلى الذين نافقوا يقولون لإخوانهم الذين كفروا من أهل الكتاب لئن أخرجتم لنخرجن معكم ولا نطيع فيكم أحدا أبدا وإن قوتلتم لننصرنكم والله يشهد إنهم لكاذبون\nتعجب من اغترار اليهود بما وعدهم المنافقون من النصر مع علمهم بأنهم لا يعتقدون دينا ولا كتابا . ومن جملة المنافقين عبد الله بن أبي ابن سلول ، وعبد الله بن نبتل ، ورفاعة بن زيد . وقيل : رافعة بن تابوت ، وأوس بن قيظي ، كانوا من الأنصار ولكنهم نافقوا ، وقالوا ليهود قريظة والنضير .\nلئن أخرجتم لنخرجن معكم وقيل : هو من قول بني النضير لقريظة .\nقوله تعالى : ولا نطيع فيكم أحدا أبدا يعنون محمدا صلى الله عليه وسلم ; لا نطيعه في قتالكم . وفي هذا دليل على صحة نبوة محمد صلى الله عليه وسلم من جهة علم الغيب ; لأنهم أخرجوا فلم يخرجوا ، وقوتلوا فلم ينصروهم ; كما قال الله تعالى .\nوالله يشهد إنهم لكاذبون أي في قولهم وفعلهم .\n                                    ",
        "saadi": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نَافَقُواْ يَقُولُونَ لِإِخۡوَٰنِهِمُ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ لَئِنۡ أُخۡرِجۡتُمۡ لَنَخۡرُجَنَّ مَعَكُمۡ وَلَا نُطِيعُ فِيكُمۡ أَحَدًا أَبَدٗا وَإِن قُوتِلۡتُمۡ لَنَنصُرَنَّكُمۡ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ ١١\n                                        \n                                        \n                                        \n                                        ثم تعجب تعالى من حال المنافقين، الذين طمعوا إخوانهم من أهل الكتاب، في نصرتهم، وموالاتهم على المؤمنين، وأنهم يقولون لهم: { لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا } أي: لا نطيع في عدم نصرتكم أحدا يعذلنا أو يخوفنا، { وَإِنْ قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ } في هذا الوعد الذي غروا به إخوانهم.\n                                    "
      },
      "originalText": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نَافَقُواْ يَقُولُونَ لِإِخۡوَٰنِهِمُ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ لَئِنۡ أُخۡرِجۡتُمۡ لَنَخۡرُجَنَّ مَعَكُمۡ وَلَا نُطِيعُ فِيكُمۡ أَحَدًا أَبَدٗا وَإِن قُوتِلۡتُمۡ لَنَنصُرَنَّكُمۡ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ ١١"
    },
    {
      "number": 5138,
      "text": "لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِنْ قُوتِلُوا لَا يَنْصُرُونَهُمْ وَلَئِنْ نَصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنْصَرُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 12,
      "juz": 28,
      "manzil": 7,
      "page": 547,
      "ruku": 480,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَئِنۡ أُخۡرِجُواْ لَا يَخۡرُجُونَ مَعَهُمۡ وَلَئِن قُوتِلُواْ لَا يَنصُرُونَهُمۡ وَلَئِن نَّصَرُوهُمۡ لَيُوَلُّنَّ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يُنصَرُونَ ٢١\n                                    \n                                    \n                                    ولهذا قال : ( ولئن قوتلوا لا ينصرونهم ) أي : لا يقاتلون معهم ، ( ولئن نصروهم ) أي : قاتلوا معهم ( ليولن الأدبار ثم لا ينصرون ) وهذه بشارة مستقلة بنفسها .\n                                    ",
        "qortoby": "لَئِنۡ أُخۡرِجُواْ لَا يَخۡرُجُونَ مَعَهُمۡ وَلَئِن قُوتِلُواْ لَا يَنصُرُونَهُمۡ وَلَئِن نَّصَرُوهُمۡ لَيُوَلُّنَّ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يُنصَرُونَ ٢١\n                                    \n                                    \n                                    قوله تعالى : لئن أخرجوا لا يخرجون معهم ولئن قوتلوا لا ينصرونهم ولئن نصروهم ليولن الأدبار ثم لا ينصرون\nقوله تعالى : لئن أخرجوا لا يخرجون معهم ولئن قوتلوا لا ينصرونهم ولئن نصروهم ليولن الأدبار أي منهزمين . ثم لا ينصرون قيل : معنى لا ينصرونهم طائعين . ولئن نصروهم مكرهين ليولن الأدبار . وقيل : معنى لا ينصرونهم لا يدومون على نصرهم . هذا على أن الضميرين متفقان . وقيل : إنهما مختلفان ; والمعنى لئن أخرج اليهود لا يخرج معهم المنافقون ، ولئن قوتلوا لا ينصرونهم . ولئن نصروهم أي ولئن نصر اليهود المنافقين ليولن الأدبار . وقيل : لئن أخرجوا لا يخرجون معهم ؛ أي علم الله منهم أنهم لا يخرجون إن أخرجوا . ولئن قوتلوا لا ينصرونهم أي علم الله منهم ذلك . ثم قال : ليولن الأدبار فأخبر عما قد أخبر أنه لا يكون كيف كان يكون لو كان ؟ وهو كقوله تعالى : ولو ردوا لعادوا لما نهوا عنه . وقيل : معنى ولئن نصروهم أي ولئن شئنا أن ينصروهم زينا ذلك لهم . ليولن الأدبار .\n                                    ",
        "saadi": "لَئِنۡ أُخۡرِجُواْ لَا يَخۡرُجُونَ مَعَهُمۡ وَلَئِن قُوتِلُواْ لَا يَنصُرُونَهُمۡ وَلَئِن نَّصَرُوهُمۡ لَيُوَلُّنَّ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يُنصَرُونَ ٢١\n                                        \n                                        \n                                        \n                                        ولا يستكثر هذا عليهم، فإن الكذب وصفهم، والغرور والخداع، مقارنهم، والنفاق والجبن يصحبهم، ولهذا كذبهم [الله] بقوله، الذي وجد مخبره كما أخبر الله به، ووقع طبق ما قال، فقال: { لَئِنْ أُخْرِجُوا } من ديارهم جلاء ونفيا { لَا يَخْرُجُونَ مَعَهُمْ } لمحبتهم للأوطان، وعدم صبرهم على القتال، وعدم وفائهم بوعدهم\n{ وَلَئِنْ قُوتِلُوا لَا يَنْصُرُونَهُمْ } بل يستولي عليهم الجبن، ويملكهم الفشل، ويخذلون إخوانهم، أحوج ما كانوا إليهم.\n{ وَلَئِنْ نَصَرُوهُمْ } على الفرض والتقدير { لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنْصَرُونَ } أي: ليحصل منهم الإدبار عن القتال والنصرة، ولا يحصل لهم نصر من الله.\n                                    "
      },
      "originalText": "لَئِنۡ أُخۡرِجُواْ لَا يَخۡرُجُونَ مَعَهُمۡ وَلَئِن قُوتِلُواْ لَا يَنصُرُونَهُمۡ وَلَئِن نَّصَرُوهُمۡ لَيُوَلُّنَّ ٱلۡأَدۡبَٰرَ ثُمَّ لَا يُنصَرُونَ ٢١"
    },
    {
      "number": 5139,
      "text": "لَأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 13,
      "juz": 28,
      "manzil": 7,
      "page": 547,
      "ruku": 480,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَأَنتُمۡ أَشَدُّ رَهۡبَةٗ فِي صُدُورِهِم مِّنَ ٱللَّهِۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ ٣١\n                                    \n                                    \n                                    ثم قال تعالى : ( لأنتم أشد رهبة في صدورهم من الله ) أي : يخافون منكم أكثر من خوفهم من الله ، كقوله : ( إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية ) [ النساء : 77 ] ; ولهذا قال : ( ذلك بأنهم قوم لا يفقهون )\n                                    ",
        "qortoby": "لَأَنتُمۡ أَشَدُّ رَهۡبَةٗ فِي صُدُورِهِم مِّنَ ٱللَّهِۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ ٣١\n                                    \n                                    \n                                    وله تعالى : لأنتم أشد رهبة في صدورهم من الله ذلك بأنهم قوم لا يفقهون\nقوله تعالى : لأنتم يا معشر المسلمين\nأشد رهبة أي خوفا وخشية\nفي صدورهم من الله يعني صدور بني النضير . وقيل : في صدور المنافقين . ويحتمل أن يرجع إلى الفريقين ; أي يخافون منكم أكثر مما يخافون من ربهم ذلك الخوف .\nذلك بأنهم قوم لا يفقهون أي لا يفقهون قدر عظمة الله وقدرته .\n                                    ",
        "saadi": "لَأَنتُمۡ أَشَدُّ رَهۡبَةٗ فِي صُدُورِهِم مِّنَ ٱللَّهِۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ ٣١\n                                        \n                                        \n                                        \n                                        والسبب الذي أوجب لهم ذلك أنكم - أيها المؤمنون - { أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ } فخافوا منكم أعظم مما يخافون الله، وقدموا مخافة المخلوق الذي لا يملك لنفسه ولا لغيره نفعا ولا ضرا، على مخافة الخالق، الذي بيده الضر والنفع، والعطاء والمنع.\n{ ذَلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ } مراتب الأمور، ولا يعرفون حقائق الأشياء، ولا يتصورون العواقب، وإنما الفقه كل الفقه، أن يكون خوف الخالق ورجاؤه ومحبته مقدمة على غيرها، وغيرها تبعا لها.\n                                    "
      },
      "originalText": "لَأَنتُمۡ أَشَدُّ رَهۡبَةٗ فِي صُدُورِهِم مِّنَ ٱللَّهِۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَفۡقَهُونَ ٣١"
    },
    {
      "number": 5140,
      "text": "لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ ۚ بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ ۚ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 14,
      "juz": 28,
      "manzil": 7,
      "page": 547,
      "ruku": 480,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَا يُقَٰتِلُونَكُمۡ جَمِيعًا إِلَّا فِي قُرٗى مُّحَصَّنَةٍ أَوۡ مِن وَرَآءِ جُدُرِۢۚ بَأۡسُهُم بَيۡنَهُمۡ شَدِيدٞۚ تَحۡسَبُهُمۡ جَمِيعٗا وَقُلُوبُهُمۡ شَتَّىٰۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ ٤١\n                                    \n                                    \n                                    ثم قال ( لا يقاتلونكم جميعا إلا في قرى محصنة أو من وراء جدر ) يعني : أنهم من جبنهم وهلعهم لا يقدرون على مواجهة جيش الإسلام بالمبارزة والمقابلة بل إما في حصون أو من وراء جدر محاصرين ، فيقاتلون للدفع عنهم ضرورة .\nثم قال ( بأسهم بينهم شديد ) أي : عداوتهم فيما بينهم شديدة ، كما قال : ( ويذيق بعضكم بأس بعض ) [ الأنعام : 65 ] ; ولهذا قال : ( تحسبهم جميعا وقلوبهم شتى ) أي : تراهم مجتمعين فتحسبهم مؤتلفين ، وهم مختلفون غاية الاختلاف .\nقال : إبراهيم النخعي : يعني : أهل الكتاب والمنافقين ( ذلك بأنهم قوم لا يعقلون )\n                                    ",
        "qortoby": "لَا يُقَٰتِلُونَكُمۡ جَمِيعًا إِلَّا فِي قُرٗى مُّحَصَّنَةٍ أَوۡ مِن وَرَآءِ جُدُرِۢۚ بَأۡسُهُم بَيۡنَهُمۡ شَدِيدٞۚ تَحۡسَبُهُمۡ جَمِيعٗا وَقُلُوبُهُمۡ شَتَّىٰۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ ٤١\n                                    \n                                    \n                                    قوله تعالى : لا يقاتلونكم جميعا إلا في قرى محصنة أو من وراء جدر بأسهم بينهم شديد تحسبهم جميعا وقلوبهم شتى ذلك بأنهم قوم لا يعقلون\nقوله تعالى : لا يقاتلونكم جميعا يعني اليهود\nإلا في قرى محصنة أي بالحيطان والدور ; يظنون أنها تمنعهم منكم .\nأو من وراء جدر أي من خلف حيطان يستترون بها لجبنهم ورهبتهم . وقراءة العامة ( جدر ) على الجمع ، وهو اختيار أبي عبيدة وأبي حاتم ; لأنها نظير قوله تعالى : في قرى محصنة وذلك جمع . وقرأ ابن عباس ومجاهد وابن كثير وابن محيصن وأبو عمرو \" جدار \" على التوحيد ; لأن التوحيد يؤدي عن الجمع . وروي عن بعض المكيين \" جدر \" ( بفتح الجيم وإسكان الدال ) ; وهي لغة في الجدار . ويجوز أن يكون معناه من وراء نخيلهم وشجرهم ; يقال : أجدر النخل إذا طلعت رءوسه في أول الربيع . والجدر : نبت واحدته جدرة . وقرئ \" جدر \" ( بضم الجيم وإسكان الدال ) جمع الجدار . ويجوز أن تكون الألف في الواحد كألف كتاب ، وفي الجمع كألف ظراف . ومثله ناقة هجان ونوق هجان ; لأنك تقول في التثنية : هجانان ; فصار لفظ الواحد والجمع مشتبهين في اللفظ مختلفين في المعنى ; قاله ابن جني .\nقوله تعالى : بأسهم بينهم شديد يعني عداوة بعضهم لبعض . وقال مجاهد : بأسهم بينهم شديد أي بالكلام والوعيد لنفعلن كذا . وقال السدي : المراد اختلاف قلوبهم حتى لا يتفقوا على أمر واحد . وقيل : بأسهم بينهم شديد أي إذا لم يلقوا عدوا نسبوا أنفسهم إلى الشدة والبأس ، ولكن إذا لقوا العدو انهزموا .\nتحسبهم جميعا وقلوبهم شتى يعني اليهود والمنافقين ; قاله مجاهد . وعنه أيضا يعني المنافقين . الثوري : هم المشركون وأهل الكتاب . وقال قتادة : تحسبهم جميعا أي مجتمعين على أمر ورأي .\nوقلوبهم شتى متفرقة . فأهل الباطل مختلفة آراؤهم ، مختلفة شهادتهم ، مختلفة أهواؤهم وهم مجتمعون في عداوة أهل الحق . وعن مجاهد أيضا : أراد أن دين المنافقين مخالف لدين اليهود ; وهذا ليقوي أنفس المؤمنين عليهم . وقال الشاعر :\nإلى الله أشكو نية شقت العصا هي اليوم شتى وهي أمس جمع\nوفي قراءة ابن مسعود \" وقلوبهم أشت \" يعني أشد تشتيتا ; أي أشد اختلافا .\nذلك بأنهم قوم لا يعقلون أي ذلك التشتيت والكفر بأنهم لا عقل لهم يعقلون به أمر الله .\n                                    ",
        "saadi": "لَا يُقَٰتِلُونَكُمۡ جَمِيعًا إِلَّا فِي قُرٗى مُّحَصَّنَةٍ أَوۡ مِن وَرَآءِ جُدُرِۢۚ بَأۡسُهُم بَيۡنَهُمۡ شَدِيدٞۚ تَحۡسَبُهُمۡ جَمِيعٗا وَقُلُوبُهُمۡ شَتَّىٰۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ ٤١\n                                        \n                                        \n                                        \n                                        { لَا يُقَاتِلُونَكُمْ جَمِيعًا } أي: في حال الاجتماع { إِلَّا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ } أي: لا يثبتون لقتالكم ولا يعزمون عليه، إلا إذا كانوا متحصنين في القرى، أو من وراء الجدر والأسوار.\nفإنهم إذ ذاك ربما يحصل منهم امتناع، اعتمادا [على] حصونهم وجدرهم، لا شجاعة بأنفسهم، وهذا من أعظم الذم، { بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ } أي: بأسهم فيما بينهم شديد، لا آفة في أبدانهم ولا في قوتهم، وإنما الآفة في ضعف إيمانهم وعدم اجتماع كلمتهم، ولهذا قال: { تَحْسَبُهُمْ جَمِيعًا } حين تراهم مجتمعين ومتظاهرين.\n{ و } لكن { قلوبهم شَتَّى } أي: متباغضة متفرقة متشتتة.\n{ ذَلِكَ } الذي أوجب لهم اتصافهم بما ذكر { بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ } أي: لا عقل عندهم، ولا لب، فإنهم لو كانت لهم عقول، لآثروا الفاضل على المفضول، ولما رضوا لأنفسهم بأبخس الخطتين، ولكانت كلمتهم مجتمعة، وقلوبهم مؤتلفة، فبذلك يتناصرون ويتعاضدون، ويتعاونون على مصالحهم ومنافعهم الدينية والدنيوية.\nمثل هؤلاء المخذولين من أهل الكتاب، الذين انتصر الله لرسوله منهم، وأذاقهم الخزي في الحياة الدنيا.\n                                    "
      },
      "originalText": "لَا يُقَٰتِلُونَكُمۡ جَمِيعًا إِلَّا فِي قُرٗى مُّحَصَّنَةٍ أَوۡ مِن وَرَآءِ جُدُرِۢۚ بَأۡسُهُم بَيۡنَهُمۡ شَدِيدٞۚ تَحۡسَبُهُمۡ جَمِيعٗا وَقُلُوبُهُمۡ شَتَّىٰۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ ٤١"
    },
    {
      "number": 5141,
      "text": "كَمَثَلِ الَّذِينَ مِنْ قَبْلِهِمْ قَرِيبًا ۖ ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 15,
      "juz": 28,
      "manzil": 7,
      "page": 547,
      "ruku": 480,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كَمَثَلِ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَرِيبٗاۖ ذَاقُواْ وَبَالَ أَمۡرِهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٥١\n                                    \n                                    \n                                    ثم قال : ( كمثل الذين من قبلهم قريبا ذاقوا وبال أمرهم ولهم عذاب أليم ) قال مجاهد ، والسدي ، ومقاتل بن حيان : يعني كمثل ما أصاب كفار قريش يوم بدر .\nوقال ابن عباس : ( كمثل الذين من قبلهم ) يعني : يهود بني قينقاع . وكذا قال قتادة ، ومحمد بن إسحاق .\nوهذا القول أشبه بالصواب ، فإن يهود بني قينقاع كان رسول الله - صلى الله عليه وسلم - قد أجلاهم قبل هذا .\n                                    ",
        "qortoby": "كَمَثَلِ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَرِيبٗاۖ ذَاقُواْ وَبَالَ أَمۡرِهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٥١\n                                    \n                                    \n                                    قوله تعالى : كمثل الذين من قبلهم قريبا ذاقوا وبال أمرهم ولهم عذاب أليم\nقال ابن عباس : يعني به قينقاع ; أمكن الله منهم قبل بني النضير . وقال قتادة : يعني بني النضير ; أمكن الله منهم قبل قريظة . مجاهد : يعني كفار قريش يوم بدر . وقيل : هو عام في كل من انتقم منه على كفره قبل بني النضير من نوح إلى محمد صلى الله عليه وسلم . ومعنى وبال جزاء كفرهم . ومن قال : هم بنو قريظة ، جعل وبال أمرهم نزولهم على حكم سعد بن معاذ ; فحكم فيهم بقتل المقاتلة وسبي الذرية . وهو قول الضحاك . ومن قال : المراد بنو النضير قال : وبال أمرهم الجلاء والنفي . وكان بين النضير وقريظة سنتان . وكانت وقعة بدر قبل غزوة بني النضير بستة أشهر ، فلذلك قال : قريبا ، وقد قال قوم : غزوة بني النضير بعد وقعة أحد . ولهم عذاب أليم في الآخرة .\n                                    ",
        "saadi": "كَمَثَلِ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَرِيبٗاۖ ذَاقُواْ وَبَالَ أَمۡرِهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٥١\n                                        \n                                        \n                                        \n                                        وعدم نصر من وعدهم بالمعاونة { كَمَثَلِ الَّذِينَ مِنْ قَبْلِهِمْ قَرِيبًا } وهم كفار قريش الذين زين لهم الشيطان أعمالهم، وقال: { لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَإِنِّي جَارٌ لَكُمْ فَلَمَّا تَرَاءَتِ الْفِئَتَانِ نَكَصَ عَلَى عَقِبَيْهِ [وَقَالَ إِنِّي بَرِيءٌ مِنْكُمْ إِنِّي أَرَى مَا لَا تَرَوْنَ] } الآية.\nفغرتهم أنفسهم، وغرهم من غرهم، الذين لم ينفعوهم، ولم يدفعوا عنهم العذاب، حتى أتوا \"بدرا\" بفخرهم وخيلائهم، ظانين أنهم مدركون برسول الله والمؤمنين أمانيهم.\nفنصر الله رسوله والمؤمنين عليهم، فقتلوا كبارهم وصناديدهم، وأسروا من أسروا منهم، وفر من فر، وذاقوا بذلك وبال أمرهم وعاقبة شركهم وبغيهم، هذا في الدنيا، { وَلَهُمْ } في الآخرة عذاب النار.\n                                    "
      },
      "originalText": "كَمَثَلِ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَرِيبٗاۖ ذَاقُواْ وَبَالَ أَمۡرِهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٥١"
    },
    {
      "number": 5142,
      "text": "كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 16,
      "juz": 28,
      "manzil": 7,
      "page": 547,
      "ruku": 480,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كَمَثَلِ ٱلشَّيۡطَٰنِ إِذۡ قَالَ لِلۡإِنسَٰنِ ٱكۡفُرۡ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيٓءٞ مِّنكَ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ ٦١\n                                    \n                                    \n                                    وقوله : ( كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك ) يعني : مثل هؤلاء اليهود في اغترارهم بالذين وعدوهم النصر من المنافقين ، وقول المنافقين لهم : ( وإن قوتلتم لننصرنكم ) ثم لما حقت الحقائق وجد بهم الحصار والقتال ، تخلوا عنهم وأسلموهم للهلكة ، مثالهم في هذا كمثل الشيطان إذ سول للإنسان - والعياذ بالله - الكفر ، فإذا دخل فيما سوله تبرأ منه وتنصل ، وقال : ( إني أخاف الله رب العالمين )\nوقد ذكر بعضهم ها هنا قصة لبعض عباد بني إسرائيل هي كالمثال لهذا المثل ، لا أنها المرادة وحدها بالمثل ، بل هي منه مع غيرها من الوقائع المشاكلة لها ، فقال ابن جرير :\nحدثنا خلاد بن أسلم ، أخبرنا النضر بن شميل ، أخبرنا شعبة ، عن أبي إسحاق ، سمعت عبد الله بن نهيك قال : سمعت عليا رضي الله عنه ، يقول : إن راهبا تعبد ستين سنة ، وإن الشيطان أراده فأعياه ، فعمد إلى امرأة فأجنها ولها إخوة ، فقال لإخوتها : عليكم بهذا القس فيداويها . قال : فجاءوا بها إليه فداواها ، وكانت عنده ، فبينما هو يوما عندها إذ أعجبته ، فأتاها فحملت ، فعمد إليها فقتلها ، فجاء إخوتها ، فقال الشيطان للراهب : أنا صاحبك ، إنك أعييتني ، أنا صنعت هذا بك فأطعني أنجك مما صنعت بك ، فاسجد لي سجدة . فسجد له ، فلما سجد له قال : إني بريء منك ، إني أخاف الله رب العالمين ، فذلك قوله : ( كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله رب العالمين ) .\nوقال ابن جرير : حدثني يحيى بن إبراهيم المسعودي ، حدثنا أبي ، عن أبيه ، عن جده ، عن الأعمش ، عن عمارة ، عن عبد الرحمن بن يزيد ، عن عبد الله بن مسعود في هذه الآية : ( كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله رب العالمين ) قال : كانت امرأة ترعى الغنم ، وكان لها أربعة إخوة ، وكانت تأوي بالليل إلى صومعة راهب . قال : فنزل الراهب ففجر بها ، فحملت ، فأتاه الشيطان فقال له : اقتلها ثم ادفنها ، فإنك رجل مصدق يسمع قولك . فقتلها ثم دفنها . قال : فأتى الشيطان إخوتها في المنام فقال لهم : إن الراهب صاحب الصومعة فجر بأختكم ، فلما أحبلها قتلها ثم دفنها في مكان كذا وكذا . فلما أصبحوا قال رجل منهم : والله لقد رأيت البارحة رؤيا ما أدري أقصها عليكم أم أترك ؟ قالوا : لا بل قصها علينا . قال : فقصها ، فقال الآخر : وأنا والله لقد رأيت ذلك ، فقال الآخر : وأنا والله لقد رأيت ذلك . فقالوا : فوالله ما هذا إلا لشيء . قال : فانطلقوا فاستعدوا ملكهم على ذلك الراهب ، فأتوه فأنزلوه ثم انطلقوا به فلقيه الشيطان فقال : إني أنا الذي أوقعتك في هذا ، ولن ينجيك منه غيري ، فاسجد لي سجدة واحدة وأنجيك مما أوقعتك فيه . قال : فسجد له ، فلما أتوا به ملكهم تبرأ منه ، وأخذ فقتل .\nوكذا روي عن ابن عباس ، وطاوس ، ومقاتل بن حيان ، نحو ذلك . واشتهر عند كثير من الناس أن هذا العابد هو برصيصا ، والله أعلم . وهذه القصة مخالفة لقصة جريج العابد ، فإن جريجا اتهمته امرأة بغي بنفسها ، وادعت أن حملها منه ، ورفعت أمره إلى ولي الأمر ، فأمر به فأنزل من صومعته وخر‍بت صومعته وهو يقول : ما لكم ؟ ما لكم ؟ فقالوا : يا عدو الله ، فعلت بهذه المرأة كذا وكذا . فقال : جريج : اصبروا . ثم أخذ ابنها وهو صغير جدا ، ثم قال : يا غلام ، من أبوك ؟ قال أبي الراعي - وكانت قد أمكنته من نفسها فحملت منه - فلما رأى بنو إسرائيل ذلك عظموه كلهم تعظيما بليغا ، وقالوا : نعيد صومعتك من ذهب . قال : لا بل أعيدوها من طين ، كما كانت .\n                                    ",
        "qortoby": "كَمَثَلِ ٱلشَّيۡطَٰنِ إِذۡ قَالَ لِلۡإِنسَٰنِ ٱكۡفُرۡ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيٓءٞ مِّنكَ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ ٦١\n                                    \n                                    \n                                    قوله تعالى : كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله رب العالمين فكان عاقبتهما أنهما في النار خالدين فيها وذلك جزاء الظالمين\nقوله تعالى : كمثل الشيطان إذ قال للإنسان اكفر هذا ضرب مثل للمنافقين واليهود في تخاذلهم وعدم الوفاء في نصرتهم . وحذف حرف العطف ، ولم يقل : وكمثل الشيطان ; لأن حذف حرف العطف كثير كما تقول : أنت عاقل أنت كريم أنت عالم . وقد روي عن النبي صلى الله عليه وسلم : أن الإنسان الذي قال له الشيطان اكفر ، راهب تركت عنده امرأة أصابها لمم ليدعو لها ، فزين له الشيطان فوطئها فحملت ، ثم قتلها خوفا أن يفتضح ، فدل الشيطان قومها على موضعها ، فجاءوا فاستنزلوا الراهب ليقتلوه ، فجاء الشيطان فوعده أنه إن سجد له أنجاه منهم ، فسجد له فتبرأ منه فأسلمه . ذكره القاضي إسماعيل وعلي بن المديني عن سفيان بن عيينة عن عمرو بن دينار عن عروة بن عامر عن عبيد بن رفاعة الزرقي عن النبي صلى الله عليه وسلم . وذكر خبره مطولا ابن عباس ووهب بن منبه . ولفظهما مختلف . قال ابن عباس في قوله تعالى : كمثل الشيطان : كان راهب في الفترة يقال له : برصيصا ; قد تعبد في صومعته سبعين سنة ، لم يعص الله فيها طرفة عين ، حتى أعيا إبليس ، فجمع إبليس مردة الشياطين فقال : ألا أجد منكم من يكفيني أمر برصيصا ؟ فقال الأبيض ، وهو صاحب الأنبياء ، وهو الذي قصد النبي صلى الله عليه وسلم في صورة جبريل ليوسوس إليه على وجه الوحي ، فجاء جبريل فدخل بينهما ، ثم دفعه بيده حتى وقع بأقصى الهند فذلك قوله تعالى : ذي قوة عند ذي العرش مكين فقال : أنا أكفيكه ; فانطلق فتزيا بزي الرهبان ، وحلق وسط رأسه حتى أتى صومعة برصيصا فناداه فلم يجبه ; وكان لا ينفتل من صلاته إلا في كل عشرة أيام يوما ، ولا يفطر إلا في كل عشرة أيام ; وكان يواصل العشرة الأيام والعشرين والأكثر ; فلما رأى الأبيض أنه لا يجيبه أقبل على العبادة في أصل صومعته ; فلما انفتل برصيصا من صلاته ، رأى الأبيض قائما يصلي في هيئة حسنة من هيئة الرهبان ; فندم حين لم يجبه ، فقال : ما حاجتك ؟ فقال : أن أكون معك ، فأتأدب بأدبك ، وأقتبس من عملك ، ونجتمع على العبادة ; فقال : إني في شغل عنك ; ثم أقبل على صلاته ; وأقبل الأبيض أيضا على الصلاة ; فلما رأى برصيصا شدة اجتهاده وعبادته قال له : ما حاجتك ؟ فقال : أن تأذن لي فأرتفع إليك . فأذن له فأقام الأبيض معه حولا لا يفطر إلا في كل أربعين يوما يوما واحدا ، ولا ينفتل من صلاته إلا في كل أربعين يوما ، وربما مد إلى الثمانين ; فلما رأى برصيصا اجتهاده تقاصرت إليه نفسه . ثم قال الأبيض : عندي دعوات يشفي الله بها السقيم والمبتلى والمجنون ; فعلمه إياها . ثم جاء إلى إبليس فقال : قد والله أهلكت الرجل . ثم تعرض لرجل فخنقه ، ثم قال لأهله - وقد تصور في صورة الآدميين - : إن بصاحبكم جنونا أفأطبه ؟ قالوا : نعم . فقال : لا أقوى على جنيته ، ولكن اذهبوا به إلى برصيصا ، فإن عنده اسم الله الأعظم الذي إذا سئل به أعطى ، وإذا دعي به أجاب ; فجاءوه فدعا بتلك الدعوات ، فذهب عنه الشيطان . ثم جعل الأبيض يفعل بالناس ذلك ويرشدهم إلى برصيصا فيعافون . فانطلق إلى جارية من بنات الملوك بين ثلاثة إخوة ، وكان أبوهم ملكا فمات واستخلف أخاه ، وكان عمها ملكا في بني إسرائيل فعذبها وخنقها . ثم جاء إليهم في صورة رجل متطبب ليعالجها فقال : إن شيطانها مارد لا يطاق ، ولكن اذهبوا بها إلى برصيصا فدعوها عنده ، فإذا جاء شيطانها دعا لها فبرئت ; فقالوا : لا يجيبنا إلى هذا ; قال : فابنوا صومعة في جانب صومعته ثم ضعوها فيها ، وقولوا : هي أمانة عندك فاحتسب فيها . فسألوه ذلك فأبى ، فبنوا صومعة ووضعوا فيها الجارية ; فلما انفتل من صلاته عاين الجارية وما بها من الجمال فأسقط في يده ، فجاءها الشيطان فخنقها فانفتل من صلاته ودعا لها فذهب عنها الشيطان ، ثم أقبل على صلاته فجاءها الشيطان فخنقها . وكان يكشف عنها ويتعرض بها لبرصيصا ، ثم جاءه الشيطان فقال : ويحك ! واقعها ، فما تجد مثلها ثم تتوب بعد ذلك . فلم يزل به حتى واقعها فحملت وظهر حملها . فقال له الشيطان : ويحك ! قد افتضحت . فهل لك أن تقتلها ثم تتوب فلا تفتضح ، فإن جاءوك وسألوك فقل جاءها شيطانها فذهب بها . فقتلها برصيصا ودفنها ليلا ; فأخذ الشيطان طرف ثوبها حتى بقي خارجا من التراب ; ورجع برصيصا إلى صلاته . ثم جاء الشيطان إلى إخوتها في المنام فقال : إن برصيصا فعل بأختكم كذا وكذا ، وقتلها ودفنها في جبل كذا وكذا ; فاستعظموا ذلك وقالوا لبرصيصا : ما فعلت أختنا ؟ فقال : ذهب بها شيطانها ; فصدقوه وانصرفوا . ثم جاءهم الشيطان في المنام وقال : إنها مدفونة في موضع كذا وكذا ، وإن طرف ردائها خارج من التراب ; فانطلقوا فوجدوها ، فهدموا صومعته وأنزلوه وخنقوه ، وحملوه إلى الملك فأقر على نفسه فأمر بقتله . فلما صلب قال الشيطان : أتعرفني ؟ قال : لا والله ، قال : أنا صاحبك الذي علمتك الدعوات ، أما اتقيت الله أما استحيت وأنت أعبد بني إسرائيل ثم لم يكفك صنيعك حتى فضحت نفسك ، وأقررت عليها وفضحت أشباهك من الناس ، فإن مت على هذه الحالة لم يفلح أحد من نظرائك بعدك . فقال : كيف أصنع ؟ قال : تطيعني في خصلة واحدة وأنجيك منهم وآخذ بأعينهم . قال : وما ذاك ؟ قال : تسجد لي سجدة واحدة ; فقال : أنا أفعل ; فسجد له من دون الله . فقال : يا برصيصا ، هذا أردت منك ; كان عاقبة أمرك أن كفرت بربك ، إني بريء منك ، إني أخاف الله رب العالمين . وقال وهب بن منبه : إن عابدا كان في بني إسرائيل ، وكان من أعبد أهل زمانه ، وكان في زمانه ثلاثة إخوة لهم أخت ، وكانت بكرا ، ليست لهم أخت غيرها ، فخرج البعث على ثلاثتهم ، فلم يدروا عند من يخلفون أختهم ، ولا عند من يأمنون عليها ، ولا عند من يضعونها . قال : فاجتمع رأيهم على أن يخلفوها عند عابد بني إسرائيل ، وكان ثقة في أنفسهم ، فأتوه فسألوه أن يخلفوها عنده ، فتكون في كنفه وجواره إلى أن يقفلوا من غزاتهم ، فأبى ذلك عليهم وتعوذ بالله منهم ومن أختهم . قال : فلم يزالوا به حتى أطاعهم ، فقال : أنزلوها في بيت حذاء صومعتي ، فأنزلوها في ذلك البيت ثم انطلقوا وتركوها ، فمكثت في جوار ذلك العابد زمانا ، ينزل إليها الطعام من صومعته ، فيضعه عند باب الصومعة ، ثم يغلق بابه ويصعد في صومعته ، ثم يأمرها فتخرج من بيتها فتأخذ ما وضع لها من الطعام . قال : فتلطف له الشيطان فلم يزل يرغبه في الخير ، ويعظم عليه خروج الجارية من بيتها نهارا ، ويخوفه أن يراها أحد فيعلقها . قال : فلبث بذلك زمانا ، ثم جاءه إبليس فرغبه في الخير والأجر ، وقال له : لو كنت تمشي إليها بطعامها حتى تضعه في بيتها كان أعظم لأجرك ; قال : فلم يزل به حتى مشى إليها بطعامها فوضعه في بيتها ، قال : فلبث بذلك زمانا ثم جاءه إبليس فرغبه في الخير وحضه عليه ، وقال : لو كنت تكلمها وتحدثها فتأنس بحديثك ، فإنها قد استوحشت وحشة شديدة . قال : فلم يزل به حتى حدثها زمانا يطلع عليها من فوق صومعته . قال : ثم أتاه إبليس بعد ذلك فقال : لو كنت تنزل إليها فتقعد على باب صومعتك وتحدثها وتقعد على باب بيتها فتحدثك كان آنس لها . فلم يزل به حتى أنزله وأجلسه على باب صومعته يحدثها ، وتخرج الجارية من بيتها ، فلبثا زمانا يتحدثان ، ثم جاءه إبليس فرغبه في الخير والثواب فيما يصنع بها ، وقال : لو خرجت من باب صومعتك فجلست قريبا من باب بيتها كان آنس لها . فلم يزل به حتى فعل . قال : فلبثا زمانا ، ثم جاءه إبليس فرغبه في الخير وفيما له من حسن الثواب فيما يصنع بها ، وقال له : لو دنوت من باب بيتها فحدثتها ولم تخرج من بيتها ، ففعل . فكان ينزل من صومعته فيقعد على باب بيتها فيحدثها . فلبثا بذلك حينا ثم جاءه إبليس فقال : لو دخلت البيت معها تحدثها ولم تتركها تبرز وجهها لأحد كان أحسن بك . فلم يزل به حتى دخل البيت ، فجعل يحدثها نهاره كله ، فإذا أمسى صعد في صومعته . قال : ثم أتاه إبليس بعد ذلك ، فلم يزل يزينها له حتى ضرب العابد على فخذها وقبلها . فلم يزل به إبليس يحسنها في عينه ويسول له حتى وقع عليها فأحبلها ، فولدت له غلاما ، فجاءه إبليس فقال له : أرأيت إن جاء إخوة هذه الجارية وقد ولدت منك ! كيف تصنع ! لا آمن عليك أن تفتضح أو يفضحوك ! فاعمد إلى ابنها فاذبحه وادفنه ، فإنها ستكتم عليك مخافة إخوتها أن يطلعوا على ما صنعت بها ، ففعل . فقال له : أتراها تكتم إخوتها ما صنعت بها وقتلت ابنها ! خذها فاذبحها وادفنها مع ابنها . فلم يزل به حتى ذبحها وألقاها في الحفيرة مع ابنها ، وأطبق عليها صخرة عظيمة ، وسوى عليها التراب ، وصعد في صومعته يتعبد فيها ; فمكث بذلك ما شاء الله أن يمكث ; حتى قفل إخوتها من الغزو ، فجاءوه فسألوه عنها فنعاها لهم وترحم عليها ، وبكى لهم وقال : كانت خير أمة ، وهذا قبرها فانظروا إليه . فأتى إخوتها القبر فبكوا على قبرها وترحموا عليها ، وأقاموا على قبرها أياما ثم انصرفوا إلى أهاليهم . فلما جن عليهم الليل وأخذوا مضاجعهم ، أتاهم الشيطان في صورة رجل مسافر ، فبدأ بأكبرهم فسأله عن أختهم ; فأخبره بقول العابد وموتها وترحمه عليها ، وكيف أراهم موضع قبرها ; فكذبه الشيطان وقال : لم يصدقكم أمر أختكم ، إنه قد أحبل أختكم وولدت منه غلاما فذبحه وذبحها معه فزعا منكم ، وألقاها في حفيرة احتفرها خلف الباب الذي كانت فيه عن يمين من دخله . فانطلقوا فادخلوا البيت الذي كانت فيه عن يمين من دخله ، فإنكم ستجدونهما هنالك جميعا كما أخبرتكم . قال : وأتى الأوسط في منامه وقال له مثل ذلك . ثم أتى أصغرهم فقال له مثل ذلك . فلما استيقظ القوم استيقظوا متعجبين لما رأى كل واحد منهم . فأقبل بعضهم على بعض ، يقول كل واحد منهم : لقد رأيت عجبا ، فأخبر بعضهم بعضا بما رأى . قال أكبرهم : هذا حلم ليس بشيء ، فامضوا بنا ودعوا هذا . قال أصغرهم : لا أمضي حتى آتي ذلك المكان فأنظر فيه . قال : فانطلقوا جميعا حتى دخلوا البيت الذي كانت فيه أختهم ، ففتحوا الباب وبحثوا الموضع الذي وصف لهم في منامهم ، فوجدوا أختهم وابنها مذبوحين في الحفيرة كما قيل لهم ، فسألوا العابد فصدق قول إبليس فيما صنع بهما . فاستعدوا عليه ملكهم ، فأنزل من صومعته فقدموه ليصلب ، فلما أوقفوه على الخشبة أتاه الشيطان فقال له : قد علمت أني صاحبك الذي فتنتك في المرأة حتى أحبلتها وذبحتها وذبحت ابنها ، فإن أنت أطعتني اليوم وكفرت بالله الذي خلقك خلصتك مما أنت فيه . قال : فكفر العابد بالله ; فلما كفر خلى عنه الشيطان بينه وبين أصحابه فصلبوه . قال : ففيه نزلت هذه الآية : كمثل الشيطان إذ قال للإنسان اكفر فلما كفر قال إني بريء منك إني أخاف الله رب العالمين إلى قوله جزاء الظالمين . قال ابن عباس : فضرب الله هذا مثلا للمنافقين من اليهود . وذلك أن الله تعالى أمر نبيه عليه السلام أن يجلي بني النضير من المدينة ، فدس إليهم المنافقون ألا تخرجوا من دياركم ، فإن قاتلوكم كنا معكم ، وإن أخرجوكم كنا معكم ، فحاربوا النبي صلى الله عليه وسلم فخذلهم المنافقون ، وتبرءوا منهم كما تبرأ الشيطان من برصيصا العابد . فكان الرهبان بعد ذلك لا يمشون إلا بالتقية والكتمان . وطمع أهل الفسوق والفجور في الأحبار فرموهم بالبهتان والقبيح ، حتى كان أمر جريج الراهب ، وبرأه الله فانبسطت بعده الرهبان وظهروا للناس . وقيل : المعنى مثل المنافقين في غدرهم لبني النضير كمثل إبليس إذ قال لكفار قريش : لا غالب لكم اليوم من الناس ، وإني جار لكم وقال مجاهد المراد بالإنسان هاهنا جميع الناس في غرور الشيطان إياهم . ومعنى قوله تعالى : إذ قال للإنسان اكفر أي أغواه حتى قال : إني كافر .\nإني أخاف الله رب العالمين وليس قول الشيطان حقيقة ، إنما هو على وجه التبرؤ من الإنسان ، فهو تأكيد لقوله تعالى : إني بريء منك وفتح الياء من \" إني \" نافع وابن كثير وأبو عمرو . وأسكن الباقون .\n                                    ",
        "saadi": "كَمَثَلِ ٱلشَّيۡطَٰنِ إِذۡ قَالَ لِلۡإِنسَٰنِ ٱكۡفُرۡ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيٓءٞ مِّنكَ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ ٦١\n                                        \n                                        \n                                        \n                                        ومثل هؤلاء المنافقين الذين غروا إخوانهم من أهل الكتاب { كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنْسَانِ اكْفُرْ } أي: زين له الكفر وحسنه ودعاه إليه، فلما اغتر به وكفر، وحصل له الشقاء، لم ينفعه الشيطان، الذي تولاه ودعاه إلى ما دعاه إليه، بل تبرأ منه و { قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ } أي: ليس لي قدرة على دفع العذاب عنك، ولست بمغن عنك مثقال ذرة من الخير.\n                                    "
      },
      "originalText": "كَمَثَلِ ٱلشَّيۡطَٰنِ إِذۡ قَالَ لِلۡإِنسَٰنِ ٱكۡفُرۡ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيٓءٞ مِّنكَ إِنِّيٓ أَخَافُ ٱللَّهَ رَبَّ ٱلۡعَٰلَمِينَ ٦١"
    }
  ]
}