{
  "number": 548,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 5143,
      "text": "فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 17,
      "juz": 28,
      "manzil": 7,
      "page": 548,
      "ruku": 480,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَكَانَ عَٰقِبَتَهُمَآ أَنَّهُمَا فِي ٱلنَّارِ خَٰلِدَيۡنِ فِيهَاۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ ٧١\n                                    \n                                    \n                                    وقوله : ( فكان عاقبتهما أنهما في النار خالدين فيها ) أي : فكانت عاقبة الآمر بالكفر والفاعل له ، وتصيرهما إلى نار جهنم خالدين فيها ، ( وذلك جزاء الظالمين ) أي : جزاء كل ظالم .\n                                    ",
        "qortoby": "فَكَانَ عَٰقِبَتَهُمَآ أَنَّهُمَا فِي ٱلنَّارِ خَٰلِدَيۡنِ فِيهَاۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ ٧١\n                                    \n                                    \n                                    فكان عاقبتهما أي عاقبة الشيطان وذلك الإنسان\nأنهما في النار خالدين فيها نصب على الحال . والتثنية ظاهرة فيمن جعل الآية مخصوصة في الراهب والشيطان . ومن جعلها في الجنس فالمعنى : وكان عاقبة الفريقين أو الصنفين . ونصب عاقبتهما على أنه خبر كان . والاسم أنهما في النار ، وقرأ الحسن \" فكان عاقبتهما \" بالرفع على الضد من ذلك . وقرأ الأعمش \" خالدان فيها \" بالرفع وذلك خلاف المرسوم . ورفعه على أنه خبر \" أن \" والظرف ملغى .\n                                    ",
        "saadi": "فَكَانَ عَٰقِبَتَهُمَآ أَنَّهُمَا فِي ٱلنَّارِ خَٰلِدَيۡنِ فِيهَاۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ ٧١\n                                        \n                                        \n                                        \n                                        { فَكَانَ عَاقِبَتَهُمَا } أي: الداعي الذي هو الشيطان، والمدعو الذي هو الإنسان حين أطاعه { أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا } كما قال تعالى: { إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ } { وَذَلِكَ جَزَاءُ الظَّالِمِينَ } الذين اشتركوا في الظلم والكفر، وإن اختلفوا في شدة العذاب وقوته، وهذا دأب الشيطان مع كل أوليائه، فإنه يدعوهم ويدليهم إلى ما يضرهم بغرور، حتى إذا وقعوا في الشباك، وحاقت بهم أسباب الهلاك، تبرأ منهم وتخلى عنهم.\nواللوم كل اللوم على من أطاعه، فإن الله قد حذر منه وأنذر، وأخبر بمقاصده وغايته ونهايته، فالمقدم على طاعته، عاص على بصيرة لا عذر له.\n                                    "
      },
      "originalText": "فَكَانَ عَٰقِبَتَهُمَآ أَنَّهُمَا فِي ٱلنَّارِ خَٰلِدَيۡنِ فِيهَاۚ وَذَٰلِكَ جَزَٰٓؤُاْ ٱلظَّٰلِمِينَ ٧١"
    },
    {
      "number": 5144,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 18,
      "juz": 28,
      "manzil": 7,
      "page": 548,
      "ruku": 481,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَلۡتَنظُرۡ نَفۡسٞ مَّا قَدَّمَتۡ لِغَدٖۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ ٨١\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن عون بن أبي جحيفة ، عن المنذر بن جرير ، عن أبيه قال : كنا عند رسول الله - صلى الله عليه وسلم - في صدر النهار ، قال : فجاءه قوم حفاة عراة مجتابي النمار - أو العباء - متقلدي السيوف ، عامتهم من مضر ، بل كلهم من مضر فتغير وجه رسول الله - صلى الله عليه وسلم - لما رأى بهم من الفاقة ، قال : فدخل ثم خرج ، فأمر بلالا فأذن وأقام الصلاة ، فصلى ثم خطب ، فقال : ( يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة ) إلى آخر الآية : ( إن الله كان عليكم رقيبا ) [ النساء : 1 ] . وقرأ الآية التي في الحشر : ( ولتنظر نفس ما قدمت لغد ) تصدق رجل من ديناره ، من درهمه ، من ثوبه ، من صاع بره ، من صاع تمره - حتى قال - : ولو بشق تمرة \" . قال : فجاء رجل من الأنصار بصرة كادت كفه تعجز عنها ، بل قد عجزت ، ثم تتابع الناس حتى رأيت كومين من طعام وثياب ، حتى رأيت رسول الله - صلى الله عليه وسلم - يتهلل وجهه كأنه مذهبة ، فقال رسول الله - صلى الله عليه وسلم - : \" من سن في الإسلام سنة حسنة ، فله أجرها وأجر من عمل بها بعده ، من غير أن ينقص من أجورهم شيء ، ومن سن في الإسلام سنة سيئة ، كان عليه وزرها ووزر من عمل بها من غير أن ينقص من أوزارهم شيء \" .\nانفرد بإخراجه مسلم من حديث شعبة بإسناد مثله .\nفقوله تعالى : ( يا أيها الذين آمنوا اتقوا الله ) أمر بتقواه ، وهي تشمل فعل ما به أمر ، وترك ما عنه زجر .\nوقوله : ( ولتنظر نفس ما قدمت لغد ) أي : حاسبوا أنفسكم قبل أن تحاسبوا ، وانظروا ماذا ادخرتم لأنفسكم من الأعمال الصالحة ليوم معادكم وعرضكم على ربكم ، ( واتقوا الله ) تأكيد ثان ، ( إن الله خبير بما تعملون ) أي : اعلموا أنه عالم بجميع أعمالكم وأحوالكم لا تخفى عليه منكم خافية ، ولا يغيب عنه من أموركم جليل ولا حقير .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَلۡتَنظُرۡ نَفۡسٞ مَّا قَدَّمَتۡ لِغَدٖۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ ٨١\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا اتقوا الله ولتنظر نفس ما قدمت لغد واتقوا الله إن الله خبير بما تعملون\nقوله تعالى : يا أيها الذين آمنوا اتقوا الله في أوامره ونواهيه ، وأداء فرائضه واجتناب معاصيه .\nولتنظر نفس ما قدمت لغد يعني يوم القيامة . والعرب تكني عن المستقبل بالغد . وقيل : ذكر الغد تنبيها على أن الساعة قريبة ; كما قال الشاعر قرار بن أجدع :\nفإن بك صدر هذا اليوم ولى وإن غدا لناظره قريب\nوقال الحسن وقتادة : قرب الساعة حتى جعلها كغد . ولا شك أن كل آت قريب ; والموت لا محالة آت . ومعنى ما قدمت يعني من خير أو شر .\nواتقوا الله ، أعاد هذا تكريرا ، كقولك : اعجل اعجل ، ارم ارم . وقيل : التقوى الأولى التوبة فيما مضى من الذنوب ، والثانية اتقاء المعاصي في المستقبل .\nإن الله خبير بما تعملون قال سعيد بن جبير : أي بما يكون منكم . والله أعلم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَلۡتَنظُرۡ نَفۡسٞ مَّا قَدَّمَتۡ لِغَدٖۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ ٨١\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده المؤمنين بما يوجبه الإيمان ويقتضيه من لزوم تقواه، سرا وعلانية، في جميع الأحوال، وأن يراعوا ما أمرهم الله به من أوامره وشرائعه وحدوده، وينظروا ما لهم وما عليهم، وماذا حصلوا عليه من الأعمال التي تنفعهم أو تضرهم في يوم القيامة، فإنهم إذا جعلوا الآخرة نصب أعينهم وقبلة قلوبهم، واهتموا بالمقام بها، اجتهدوا في كثرة الأعمال الموصلة إليها، وتصفيتها من القواطع والعوائق التي توقفهم عن السير أو تعوقهم أو تصرفهم، وإذا علموا أيضا، أن الله خبير بما يعملون، لا تخفى عليه أعمالهم، ولا تضيع لديه ولا يهملها، أوجب لهم الجد والاجتهاد.\nوهذه الآية الكريمة أصل في محاسبة العبد نفسه، وأنه ينبغي له أن يتفقدها، فإن رأى زللا تداركه بالإقلاع عنه، والتوبة النصوح، والإعراض عن الأسباب الموصلة إليه، وإن رأى نفسه مقصرا في أمر من أوامر الله، بذل جهده واستعان بربه في تكميله وتتميمه، وإتقانه، ويقايس بين منن الله عليه وإحسانه وبين تقصيره، فإن ذلك يوجب له الحياء بلا محالة.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَلۡتَنظُرۡ نَفۡسٞ مَّا قَدَّمَتۡ لِغَدٖۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ ٨١"
    },
    {
      "number": 5145,
      "text": "وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنْسَاهُمْ أَنْفُسَهُمْ ۚ أُولَٰئِكَ هُمُ الْفَاسِقُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 19,
      "juz": 28,
      "manzil": 7,
      "page": 548,
      "ruku": 481,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَكُونُواْ كَٱلَّذِينَ نَسُواْ ٱللَّهَ فَأَنسَىٰهُمۡ أَنفُسَهُمۡۚ أُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ ٩١\n                                    \n                                    \n                                    وقال ( ولا تكونوا كالذين نسوا الله فأنساهم أنفسهم ) أي : لا تنسوا ذكر الله فينسيكم العمل لمصالح أنفسكم التي تنفعكم في معادكم ، فإن الجزاء من جنس العمل ; ولهذا قال : ( أولئك هم الفاسقون ) أي : الخارجون عن طاعة الله ، الهالكون يوم القيامة ، الخاسرون يوم معادهم ، كما قال : ( يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون ) [ المنافقون : 9 ] .\nوقال الحافظ أبو القاسم الطبراني : حدثنا أحمد بن عبد الوهاب بن نجدة الحوطي ، حدثنا أبو المغيرة ، حدثنا حريز بن عثمان ، عن نعيم بن نمحة قال : كان في خطبة أبي بكر الصديق ، رضي الله عنه : أما تعلمون أنكم تغدون وتروحون لأجل معلوم ؟ فمن استطاع أن يقضي الأجل وهو في عمل الله ، عز وجل ، فليفعل ، ولن تنالوا ذلك إلا بالله ، عز وجل . إن قوما جعلوا آجالهم لغيرهم ، فنهاكم الله تكونوا أمثالهم : ( ولا تكونوا كالذين نسوا الله فأنساهم أنفسهم ) أين من تعرفون من إخوانكم ؟ قدموا على ما قدموا في أيام سلفهم ، وخلوا بالشقوة والسعادة ، أين الجبارون الأولون الذين بنوا المدائن وحصنوها بالحوائط ؟ قد صاروا تحت الصخر والآبار ، هذا كتاب الله لا تفنى عجائبه فاستضيئوا منه ليوم ظلمة ، وائتضحوا بسنائه وبيانه ، إن الله أثنى على زكريا وأهل بيته فقال : ( إنهم كانوا يسارعون في الخيرات ويدعوننا رغبا ورهبا وكانوا لنا خاشعين ) [ الأنبياء : 90 ] ، لا خير في قول لا يراد به وجه الله ، ولا خير في مال لا ينفق في سبيل الله ، ولا خير فيمن يغلب جهله حلمه ، ولا خير فيمن يخاف في الله لومة لائم .\nهذا إسناد جيد ، ورجاله كلهم ثقات ، وشيخ حريز بن عثمان ، وهو نعيم بن نمحة ، لا أعرفه بنفي ولا إثبات ، غير أن أبا داود السجستاني قد حكم بأن شيوخ حريز كلهم ثقات . وقد روي لهذه الخطبة شواهد من وجوه أخر ، والله أعلم .\n                                    ",
        "qortoby": "وَلَا تَكُونُواْ كَٱلَّذِينَ نَسُواْ ٱللَّهَ فَأَنسَىٰهُمۡ أَنفُسَهُمۡۚ أُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ ٩١\n                                    \n                                    \n                                    قوله تعالى : ولا تكونوا كالذين نسوا الله فأنساهم أنفسهم أولئك هم الفاسقون\nقوله تعالى : ولا تكونوا كالذين نسوا الله أي تركوا أمره .\nفأنساهم أنفسهم أن يعملوا لها خيرا ; قاله ابن حبان . وقيل : نسوا حق الله فأنساهم حق أنفسهم ; قاله سفيان . وقيل : نسوا الله بترك شكره وتعظيمه . فأنساهم أنفسهم بالعذاب أن يذكر بعضهم بعضا ; حكاه ابن عيسى . وقال سهل بن عبد الله : نسوا الله عند الذنوب فأنساهم أنفسهم عند التوبة . ونسب تعالى الفعل إلى نفسه في أنساهم إذ كان ذلك بسبب أمره ونهيه الذي تركوه . وقيل : معناه وجدهم تاركين أمره ونهيه ; كقولك : أحمدت الرجل إذا وجدته محمودا . وقيل : نسوا الله في الرخاء فأنساهم أنفسهم في الشدائد .\nأولئك هم الفاسقون قال ابن جبير : العاصون . وقال ابن زيد : الكاذبون . وأصل الفسق الخروج ; أي الذين خرجوا عن طاعة الله .\n                                    ",
        "saadi": "وَلَا تَكُونُواْ كَٱلَّذِينَ نَسُواْ ٱللَّهَ فَأَنسَىٰهُمۡ أَنفُسَهُمۡۚ أُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ ٩١\n                                        \n                                        \n                                        \n                                        والحرمان كل الحرمان، أن يغفل العبد عن هذا الأمر، ويشابه قوما نسوا الله وغفلوا عن ذكره والقيام بحقه، وأقبلوا على حظوظ أنفسهم وشهواتها، فلم ينجحوا، ولم يحصلوا على طائل، بل أنساهم الله مصالح أنفسهم، وأغفلهم عن منافعها وفوائدها، فصار أمرهم فرطا، فرجعوا بخسارة الدارين، وغبنوا غبنا، لا يمكنهم تداركه، ولا يجبر كسره، لأنهم هم الفاسقون، الذين خرجوا عن طاعة ربهم وأوضعوا في معاصيه.\n                                    "
      },
      "originalText": "وَلَا تَكُونُواْ كَٱلَّذِينَ نَسُواْ ٱللَّهَ فَأَنسَىٰهُمۡ أَنفُسَهُمۡۚ أُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ ٩١"
    },
    {
      "number": 5146,
      "text": "لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ ۚ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 20,
      "juz": 28,
      "manzil": 7,
      "page": 548,
      "ruku": 481,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَا يَسۡتَوِيٓ أَصۡحَٰبُ ٱلنَّارِ وَأَصۡحَٰبُ ٱلۡجَنَّةِۚ أَصۡحَٰبُ ٱلۡجَنَّةِ هُمُ ٱلۡفَآئِزُونَ ٠٢\n                                    \n                                    \n                                    وقوله : ( لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة ) أي لا يستوي هؤلاء وهؤلاء في حكم الله يوم القيامة ، كما قال : ( أم حسب الذين اجترحوا السيئات أن نجعلهم كالذين آمنوا وعملوا الصالحات سواء محياهم ومماتهم ساء ما يحكمون ) [ الجاثية : 21 ] ، وقال ( وما يستوي الأعمى والبصير والذين آمنوا وعملوا الصالحات ولا المسيء ) الآية [ غافر : 58 ] . قال : ( أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار ) ؟ في آيات أخر دالات على أن الله سبحانه يكرم الأبرار ، ويهين الفجار ; ولهذا قال ها هنا : ( أصحاب الجنة هم الفائزون ) أي : الناجون المسلمون من عذاب الله عز وجل .\n                                    ",
        "qortoby": "لَا يَسۡتَوِيٓ أَصۡحَٰبُ ٱلنَّارِ وَأَصۡحَٰبُ ٱلۡجَنَّةِۚ أَصۡحَٰبُ ٱلۡجَنَّةِ هُمُ ٱلۡفَآئِزُونَ ٠٢\n                                    \n                                    \n                                    قوله تعالى : لا يستوي أصحاب النار وأصحاب الجنة أصحاب الجنة هم الفائزون\nقوله تعالى : لا يستوي أصحاب النار وأصحاب الجنة أي في الفضل والرتبة .\nأصحاب الجنة هم الفائزون أي المقربون المكرمون . وقيل : الناجون من النار . وقد مضى الكلام في معنى هذه الآية في \" المائدة \" عند قوله تعالى : قل لا يستوي الخبيث والطيب وفي سورة \" السجدة \" عند قوله تعالى : أفمن كان مؤمنا كمن كان فاسقا لا يستوون . وفي سورة \" ص \" أم نجعل الذين آمنوا وعملوا الصالحات كالمفسدين في الأرض أم نجعل المتقين كالفجار فلا معنى للإعادة ، والحمد لله .\n                                    ",
        "saadi": "لَا يَسۡتَوِيٓ أَصۡحَٰبُ ٱلنَّارِ وَأَصۡحَٰبُ ٱلۡجَنَّةِۚ أَصۡحَٰبُ ٱلۡجَنَّةِ هُمُ ٱلۡفَآئِزُونَ ٠٢\n                                        \n                                        \n                                        \n                                        فهل يستوي من حافظ على تقوى الله ونظر لما قدم لغده، فاستحق جنات النعيم، والعيش السليم - مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين - ومن غفل عن ذكر الله، ونسي حقوقه، فشقي في الدنيا، واستحق العذاب في الآخرة، فالأولون هم الفائزون، والآخرون هم الخاسرون.\n                                    "
      },
      "originalText": "لَا يَسۡتَوِيٓ أَصۡحَٰبُ ٱلنَّارِ وَأَصۡحَٰبُ ٱلۡجَنَّةِۚ أَصۡحَٰبُ ٱلۡجَنَّةِ هُمُ ٱلۡفَآئِزُونَ ٠٢"
    },
    {
      "number": 5147,
      "text": "لَوْ أَنْزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 21,
      "juz": 28,
      "manzil": 7,
      "page": 548,
      "ruku": 481,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ ١٢\n                                    \n                                    \n                                    يقول تعالى معظما لأمر القرآن ، ومبينا علو قدره ، وأنه ينبغي أن تخشع له القلوب ، وتتصدع عند سماعه لما فيه من الوعد والوعيد الأكيد : ( لو أنزلنا هذا القرآن على جبل لرأيته خاشعا متصدعا من خشية الله ) أي : فإن كان الجبل في غلظته وقساوته ، لو فهم هذا القرآن فتدبر ما فيه ، لخشع وتصدع من خوف الله ، عز وجل ، فكيف يليق بكم أيها البشر ألا تلين قلوبكم وتخشع ، وتتصدع من خشية الله ، وقد فهمتم عن الله أمره وتدبرتم كتابه ؟ ولهذا قال تعالى : ( وتلك الأمثال نضربها للناس لعلهم يتفكرون ) .\nقال العوفي : عن ابن عباس في قوله : ( لو أنزلنا هذا القرآن على جبل لرأيته خاشعا ) إلى آخرها ، يقول : لو أني أنزلت هذا القرآن على جبل حملته إياه ، لتصدع وخشع من ثقله ، ومن خشية الله . فأمر الله الناس إذا نزل عليهم القرآن أن يأخذوه بالخشية الشديدة والتخشع . ثم قال : كذلك يضرب الله الأمثال للناس لعلهم يتفكرون . وكذا قال قتادة ، وابن جرير .\nوقد ثبت في الحديث المتواتر : أن رسول الله - صلى الله عليه وسلم - لما عمل له المنبر ، وقد كان يوم الخطبة يقف إلى جانب جذع من جذوع المسجد ، فلما وضع المنبر أول ما وضع ، وجاء النبي - صلى الله عليه وسلم - ليخطب فجاوز الجذع إلى نحو المنبر ، فعند ذلك حن الجذع وجعل يئن كما يئن الصبي الذي يسكن ، لما كان يسمع من الذكر والوحي عنده . ففي بعض روايات هذا الحديث قال الحسن البصري بعد إيراده : \" فأنتم أحق أن تشتاقوا إلى رسول الله - صلى الله عليه وسلم - من الجذع \" . وهكذا هذه الآية الكريمة ، إذا كانت الجبال الصم لو سمعت كلام الله وفهمته ، لخشعت وتصدعت من خشيته فكيف بكم وقد سمعتم وفهمتم ؟ وقد قال تعالى : ( ولو أن قرآنا سيرت به الجبال أو قطعت به الأرض أو كلم به الموتى ) الآية [ الرعد : 31 ] . وقد تقدم أن معنى ذلك : أي لكان هذا القرآن . وقال تعالى : ( وإن من الحجارة لما يتفجر منه الأنهار وإن منها لما يشقق فيخرج منه الماء وإن منها لما يهبط من خشية الله ) [ البقرة : 74 ] .\n                                    ",
        "qortoby": "لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ ١٢\n                                    \n                                    \n                                    قوله تعالى : لو أنزلنا هذا القرآن على جبل لرأيته خاشعا متصدعا من خشية الله وتلك الأمثال نضربها للناس لعلهم يتفكرون\nقوله تعالى : لو أنزلنا هذا القرآن على جبل لرأيته خاشعا حث على تأمل مواعظ القرآن وبين أنه لا عذر في ترك التدبر ; فإنه لو خوطب بهذا القرآن الجبال مع تركيب العقل فيها لانقادت لمواعظه ، ولرأيتها على صلابتها ورزانتها خاشعة متصدعة ; أي متشققة من خشية الله . والخاشع : الذليل . والمتصدع : المتشقق . وقيل : خاشعا لله بما كلفه من طاعته .\nمتصدعا من خشية الله أن يعصيه فيعاقبه . وقيل : هو على وجه المثل للكفار .\nقوله تعالى : وتلك الأمثال نضربها للناس أي أنه لو أنزل هذا القرآن على جبل لخشع لوعده وتصدع لوعيده ، وأنتم أيها المقهورون بإعجازه لا ترغبون في وعده ، ولا ترهبون من وعيده وقيل : الخطاب للنبي صلى الله عليه وسلم ; أي لو أنزلنا هذا القرآن يا محمد على جبل لما ثبت ، وتصدع من نزوله عليه ; وقد أنزلناه عليك وثبتناك له ; فيكون ذلك امتنانا عليه أن ثبته لما لا تثبت له الجبال . وقيل : إنه خطاب للأمة ، وأن الله تعالى لو أنذر بهذا القرآن الجبال لتصدعت من خشية الله . والإنسان أقل قوة وأكثر ثباتا ; فهو يقوم بحقه إن أطاع ، ويقدر على رده إن عصى ; لأنه موعود بالثواب ، ومزجور بالعقاب .\n\n                                    ",
        "saadi": "لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ ١٢\n                                        \n                                        \n                                        \n                                        ولما بين تعالى لعباده ما بين، وأمرهم ونهاهم في كتابه العزيز، كان هذا موجبا لأن يبادروا إلى ما دعاهم إليه وحثهم عليه، ولو كانوا في القسوة وصلابة القلوب كالجبال الرواسي، فإن هذا القرآن لو أنزله على جبل لرأيته خاشعا متصدعا من خشية الله أي: لكمال تأثيره في القلوب، فإن مواعظ القرآن أعظم المواعظ على الإطلاق، وأوامره ونواهيه محتوية على الحكم والمصالح المقرونة بها، وهي من أسهل شيء على النفوس، وأيسرها على الأبدان، خالية من التكلف لا تناقض فيها ولا اختلاف، ولا صعوبة فيها ولا اعتساف، تصلح لكل زمان ومكان، وتليق لكل أحد.\nثم أخبر تعالى أنه يضرب للناس الأمثال، ويوضح لعباده في كتابه الحلال والحرام، لأجل أن يتفكروا في آياته ويتدبروها، فإن التفكر فيها يفتح للعبد خزائن العلم، ويبين له طرق الخير والشر، ويحثه على مكارم الأخلاق، ومحاسن الشيم، ويزجره عن مساوئ الأخلاق، فلا أنفع للعبد من التفكر في القرآن والتدبر لمعانيه.\n                                    "
      },
      "originalText": "لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ ١٢"
    },
    {
      "number": 5148,
      "text": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 22,
      "juz": 28,
      "manzil": 7,
      "page": 548,
      "ruku": 481,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَۖ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۖ هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ ٢٢\n                                    \n                                    \n                                    ثم قال تعالى : ( هو الله الذي لا إله إلا هو عالم الغيب والشهادة هو الرحمن الرحيم ) أخبر تعالى أنه الذي لا إله إلا هو فلا رب غيره ، ولا إله للوجود سواه ، وكل ما يعبد من دونه فباطل ، وأنه عالم الغيب والشهادة ، أي : يعلم جميع الكائنات المشاهدات لنا والغائبات عنا فلا يخفى عليه شيء في الأرض ، ولا في السماء من جليل وحقير ، وصغير وكبير ، حتى الذر في الظلمات .\nوقوله : ( هو الرحمن الرحيم ) قد تقدم الكلام على ذلك في أول التفسير ، بما أغنى عن إعادته ها هنا . والمراد أنه ذو الرحمة الواسعة الشاملة لجميع المخلوقات ، فهو رحمن الدنيا والآخرة ورحيمهما ، وقد قال تعالى : ( ورحمتي وسعت كل شيء ) [ الأعراف : 156 ] ، وقال ( كتب ربكم على نفسه الرحمة ) [ الأنعام : 54 ] ، وقال ( قل بفضل الله وبرحمته فبذلك فليفرحوا هو خير مما يجمعون ) [ يونس : 58 ] .\n                                    ",
        "qortoby": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَۖ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۖ هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ ٢٢\n                                    \n                                    \n                                    قوله تعالى : هو الله الذي لا إله إلا هو عالم الغيب والشهادة هو الرحمن الرحيم\nقوله تعالى : هو الله الذي لا إله إلا هو عالم الغيب والشهادة قال ابن عباس : عالم السر والعلانية . وقيل : ما كان وما يكون . وقال سهل : عالم بالآخرة والدنيا . وقيل : الغيب ما لم يعلم العباد ولا عاينوه . والشهادة ما علموا وشاهدوا .\nهو الرحمن الرحيم تقدم .\n                                    ",
        "saadi": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَۖ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۖ هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ ٢٢\n                                        \n                                        \n                                        \n                                        هذه الآيات الكريمات قد اشتملت على كثير من أسماء الله الحسنى وأوصافه العلى، عظيمة الشأن، وبديعة البرهان، فأخبر أنه الله المألوه المعبود، الذي لا إله إلا هو، وذلك لكماله العظيم، وإحسانه الشامل، وتدبيره العام، وكل إله سواه فإنه باطل لا يستحق من العبادة مثقال ذرة، لأنه فقير عاجز ناقص، لا يملك لنفسه ولا لغيره شيئا، ثم وصف نفسه بعموم العلم الشامل، لما غاب عن الخلق وما يشاهدونه، وبعموم رحمته التي وسعت كل شيء ووصلت إلى كل حي.\n\n                                    "
      },
      "originalText": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَۖ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۖ هُوَ ٱلرَّحۡمَٰنُ ٱلرَّحِيمُ ٢٢"
    },
    {
      "number": 5149,
      "text": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 23,
      "juz": 28,
      "manzil": 7,
      "page": 548,
      "ruku": 481,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ ٣٢\n                                    \n                                    \n                                    وقوله ( هو الله الذي لا إله إلا هو الملك ) أي : المالك لجميع الأشياء المتصرف فيها بلا ممانعة ولا مدافعة .\nوقوله : ( القدوس ) قال وهب بن منبه : أي الطاهر . وقال مجاهد ، وقتادة : أي المبارك : وقال ابن جريج : تقدسه الملائكة الكرام .\n( السلام ) أي : من جميع العيوب والنقائص ; بكماله في ذاته وصفاته وأفعاله .\nوقوله : ( المؤمن ) قال الضحاك عن ابن عباس : أي أمن خلقه من أن يظلمهم . وقال قتادة : أمن بقوله : إنه حق . وقال ابن زيد : صدق عباده المؤمنين في إيمانهم به .\nوقوله : ( المهيمن ) قال ابن عباس وغير واحد : أي الشاهد على خلقه بأعمالهم ، بمعنى : هو رقيب عليهم ، كقوله : ( والله على كل شيء شهيد ) [ البروج : 9 ] ، وقوله ( ثم الله شهيد على ما يفعلون ) [ يونس : 46 ] .\nوقوله : ( أفمن هو قائم على كل نفس بما كسبت ) الآية [ الرعد : 33 ] .\nوقوله : ( العزيز ) أي : الذي قد عز كل شيء فقهره ، وغلب الأشياء فلا ينال جنابه لعزته ، وعظمته ، وجبروته ، وكبريائه ; ولهذا قال : ( الجبار المتكبر ) أي : الذي لا تليق الجبرية إلا له ، ولا التكبر إلا لعظمته ، كما تقدم في الصحيح : \" العظمة إزاري ، والكبرياء ردائي ، فمن نازعني واحدا منهما عذبته \" .\nوقال قتادة : الجبار : الذي جبر خلقه على ما يشاء .\nوقال ابن جرير : الجبار : المصلح أمور خلقه ، المتصرف فيهم بما فيه صلاحهم .\nوقال قتادة : المتكبر : يعني عن كل سوء .\nثم قال : ( سبحان الله عما يشركون ) .\n                                    ",
        "qortoby": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ ٣٢\n                                    \n                                    \n                                    قوله تعالى : هو الله الذي لا إله إلا هو الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر سبحان الله عما يشركون\nقوله تعالى : هو الله الذي لا إله إلا هو الملك القدوس أي المنزه عن كل نقص ، والطاهر عن كل عيب . والقدس ( بالتحريك ) : السطل بلغة أهل الحجاز ; لأنه يتطهر به . ومنه القادوس لواحد الأواني التي يستخرج بها الماء من البئر بالسانية . وكان سيبويه يقول : قدوس وسبوح ; بفتح أولهما . وحكى أبو حاتم عن يعقوب أنه سمع عند الكسائي أعرابيا فصيحا يكنى أبا الدينار يقرأ \" القدوس \" بفتح القاف . قال ثعلب : كل اسم على فعول فهو مفتوح الأول ; مثل سفود وكلوب وتنور وسمور وشبوط ، إلا السبوح والقدوس فإن الضم فيهما أكثر ; وقد يفتحان . وكذلك الذروح ( بالضم ) وقد يفتح .\nالسلام أي ذو السلامة من النقائص . وقال ابن العربي : اتفق العلماء رحمة الله عليهم على أن معنى قولنا في الله السلام : النسبة ، تقديره ذو السلامة . ثم اختلفوا في ترجمة النسبة على ثلاثة أقوال :\nالأول : معناه الذي سلم من كل عيب وبرئ من كل نقص . الثاني : معناه ذو السلام ; أي المسلم على عباده في الجنة ; كما قال : سلام قولا من رب رحيم . الثالث : أن معناه الذي سلم الخلق من ظلمه .\nقلت : وهذا قول الخطابي ; وعليه والذي قبله يكون صفة فعل . وعلى أنه البريء من العيوب والنقائص يكون صفة ذات . وقيل : السلام معناه المسلم لعباده .\nالمؤمن أي المصدق لرسله بإظهار معجزاته عليهم ومصدق المؤمنين ما وعدهم به من الثواب ومصدق الكافرين ما أوعدهم من العقاب . وقيل : المؤمن الذي يؤمن أولياءه من عذابه ويؤمن عباده من ظلمه ; يقال : آمنه من الأمان الذي هو ضد الخوف ; كما قال تعالى : وآمنهم من خوف فهو مؤمن ; قال النابغة :\nوالمؤمن العائذات الطير يمسحها ركبان مكة بين الغيل والسند\nوقال مجاهد : المؤمن الذي وحد نفسه بقوله : شهد الله أنه لا إله إلا هو . وقال ابن عباس : إذا كان يوم القيامة أخرج أهل التوحيد من النار . وأول من يخرج من وافق اسمه اسم نبي ، حتى إذا لم يبق فيها من يوافق اسمه اسم نبي قال الله تعالى لباقيهم : أنتم المسلمون وأنا السلام ، وأنتم المؤمنون وأنا المؤمن ، فيخرجهم من النار ببركة هذين الاسمين .\nالمهيمن العزيز تقدم الكلام في المهيمن في المائدة ، وفي العزيز في غير موضع .\nالجبار قال ابن عباس : هو العظيم . وجبروت الله عظمته . وهو على هذا القول صفة ذات ، من قولهم : نخلة جبارة . قال امرؤ القيس :\nسوامق جبار أثيث فروعه وعالين قنوانا من البسر أحمرا\nيعني النخلة التي فاتت اليد . فكان هذا الاسم يدل على عظمة الله وتقديسه عن أن تناله النقائص وصفات الحدث . وقيل : هو من الجبر وهو الإصلاح ، يقال : جبرت العظم فجبر ، إذا أصلحته بعد الكسر ، فهو فعال من جبر إذا أصلح الكسير وأغنى الفقير . وقال الفراء : هو من أجبره على الأمر أي قهره . قال : ولم أسمع فعالا من أفعل إلا في جبار ودراك من أدرك . وقيل : الجبار الذي لا تطاق سطوته .\nالمتكبر الذي تكبر بربوبيته فلا شيء مثله . وقيل : المتكبر عن كل سوء المتعظم عما لا يليق به من صفات الحدث والذم . وأصل الكبر والكبرياء الامتناع وقلة الانقياد . وقال حميد بن ثور :\nعفت مثل ما يعفو الفصيل فأصبحت بها كبرياء الصعب وهي ذلول\nوالكبرياء في صفات الله مدح ، وفي صفات المخلوقين ذم . وفي الصحيح عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال فيما يرويه عن ربه تبارك وتعالى أنه قال : ( الكبرياء ردائي والعظمة إزاري فمن نازعني في واحد منهما قصمته ثم قذفته في النار ) . وقيل : المتكبر معناه العالي . وقيل : معناه الكبير لأنه أجل من أن يتكلف كبرا . وقد يقال : تظلم بمعنى ظلم ، وتشتم بمعنى شتم ، واستقر بمعنى قر . كذلك المتكبر بمعنى الكبير . وليس كما يوصف به المخلوق إذا وصف بتفعل إذا نسب إلى ما لم يكن منه .\nثم نزه نفسه فقال : سبحان الله عما يشركون أي تنزيها لجلالته وعظمته عما يشركون .\n                                    ",
        "saadi": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ ٣٢\n                                        \n                                        \n                                        \n                                        ثم كرر [ذكر] عموم إلهيته وانفراده بها، وأنه المالك لجميع الممالك، فالعالم العلوي والسفلي وأهله، الجميع، مماليك لله، فقراء مدبرون.\n{ الْقُدُّوسُ السَّلَامُ } أي: المقدس السالم من كل عيب وآفة ونقص، المعظم الممجد، لأن القدوس يدل على التنزيه عن كل نقص، والتعظيم لله في أوصافه وجلاله.\n{ الْمُؤْمِنُ } أي: المصدق لرسله وأنبيائه بما جاءوا به، بالآيات البينات، والبراهين القاطعات، والحجج الواضحات.\n{ الْعَزِيزُ } الذي لا يغالب ولا يمانع، بل قد قهر كل شيء، وخضع له كل شيء، { الْجَبَّارُ } الذي قهر جميع العباد، وأذعن له سائر الخلق، الذي يجبر الكسير، ويغني الفقير، { الْمُتَكَبِّرُ } الذي له الكبرياء والعظمة، المتنزه عن جميع العيوب والظلم والجور.\n{ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ } وهذا تنزيه عام عن كل ما وصفه به من أشرك به وعانده.\n                                    "
      },
      "originalText": "هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ سُبۡحَٰنَ ٱللَّهِ عَمَّا يُشۡرِكُونَ ٣٢"
    },
    {
      "number": 5150,
      "text": "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 59,
        "name": "سورة الحشر",
        "englishName": "Al-Hashr",
        "englishNameTranslation": "The Exile",
        "revelationType": "Medinan",
        "numberOfAyahs": 24
      },
      "numberInSurah": 24,
      "juz": 28,
      "manzil": 7,
      "page": 548,
      "ruku": 481,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤٢\n                                    \n                                    \n                                    وقوله : ( هو الله الخالق البارئ المصور ) الخلق : التقدير ، والبراء : هو الفري ، وهو التنفيذ وإبراز ما قدره وقرره إلى الوجود ، وليس كل من قدر شيئا ورتبه يقدر على تنفيذه وإيجاده سوى الله عز وجل . قال الشاعر يمدح آخر\nولأنت تفري ما خلقت وبعض القوم يخلق ثم لا يفري\nأي : أنت تنفذ ما خلقت ، أي : قدرت بخلاف غيرك فإنه لا يستطيع ما يريد . فالخلق : التقدير . والفري : التنفيذ . ومنه يقال : قدر الجلاد ثم فرى ، أي : قطع على ما قدره بحسب ما يريده .\nوقوله تعالى : ( الخالق البارئ المصور ) أي : الذي إذا أراد شيئا قال له : كن ، فيكون على الصفة التي يريد ، والصورة التي يختار . كقوله : ( في أي صورة ما شاء ركبك ) [ الانفطار : 8 ] ولهذا قال : ( المصور ) أي : الذي ينفذ ما يريد إيجاده على الصفة التي يريدها .\nوقوله : ( له الأسماء الحسنى ) قد تقدم الكلام على ذلك في \" سورة الأعراف \" ، وذكر الحديث المروي في الصحيحين عن أبي هريرة ، عن رسول الله - صلى الله عليه وسلم - : \" إن لله تعالى تسعة وتسعين اسما ، مائة إلا واحدا ، من أحصاها دخل الجنة ، وهو وتر يحب الوتر \" . وتقدم سياق الترمذي ، وابن ماجه له ، عن أبي هريرة أيضا ، وزاد بعد قوله : \" وهو وتر يحب الوتر \" - واللفظ للترمذي - : \" هو الله الذي لا إله إلا هو ، الرحمن ، الرحيم ، الملك ، القدوس ، السلام ، المؤمن ، المهيمن ، العزيز ، الجبار ، المتكبر ، الخالق ، البارئ ، المصور ، الغفار ، القهار ، الوهاب ، الرزاق ، الفتاح ، العليم ، القابض ، الباسط ، الخافض ، الرافع ، المعز ، المذل ، السميع ، البصير ، الحكم ، العدل ، اللطيف ، الخبير ، الحليم ، العظيم ، الغفور ، الشكور ، العلي ، الكبير ، الحفيظ ، المقيت ، الحسيب ، الجليل ، الكريم ، الرقيب ، المجيب ، الواسع ، الحكيم ، الودود ، المجيد ، الباعث ، الشهيد ، الحق ، الوكيل ، القوي ، المتين ، الولي ، الحميد ، المحصي ، المبدئ ، المعيد ، المحيي ، المميت ، الحي ، القيوم ، الواجد ، الماجد ، الواحد ، الصمد ، القادر ، المقتدر ، المقدم ، المؤخر ، الأول ، الآخر ، الظاهر ، الباطن ، الوالي ، المتعالي ، البر ، التواب ، المنتقم ، العفو ، الرءوف ، مالك الملك ، ذو الجلال والإكرام ، المقسط ، الجامع ، الغني ، المغني ، المانع ، الضار ، النافع ، النور ، الهادي ، البديع ، الباقي ، الوارث ، الرشيد ، الصبور \" .\nوسياق ابن ماجه بزيادة ، ونقصان ، وتقديم ، وتأخير ، وقد قدمنا ذلك مبسوطا مطولا بطرقه ، وألفاظه بما أغنى عن إعادته هنا .\nوقوله : ( يسبح له ما في السماوات والأرض ) كقوله ( تسبح له السماوات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم إنه كان حليما غفورا ) [ الإسراء : 44 ] .\nوقوله : ( وهو العزيز ) أي : فلا يرام جنابه ) الحكيم ) في شرعه وقدره . وقد قال الإمام أحمد :\nحدثنا أبو أحمد الزبيري ، حدثنا خالد - يعني : ابن طهمان أبو العلاء الخفاف - حدثنا نافع بن أبي نافع ، عن معقل بن يسار ، عن النبي - صلى الله عليه وسلم - قال : \" من قال حين يصبح ثلاث مرات : أعوذ بالله السميع العليم من الشيطان الرجيم ، ثم قرأ ثلاث آيات من آخر سورة الحشر ، وكل الله به سبعين ألف ملك يصلون عليه حتى يمسي ، وإن مات في ذلك اليوم مات شهيدا ، ومن قالها حين يمسي كان بتلك المنزلة \" .\nورواه الترمذي ، عن محمود بن غيلان ، عن أبي أحمد الزبيري به . ، وقال : غريب لا نعرفه إلا من هذا الوجه .\nآخر تفسير سورة الحشر ولله الحمد والمنة.\n                                    ",
        "qortoby": "هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤٢\n                                    \n                                    \n                                    قوله تعالى : هو الله الخالق البارئ المصور له الأسماء الحسنى يسبح له ما في السماوات والأرض وهو العزيز الحكيم\nقوله تعالى : هو الله الخالق البارئ المصور الخالق هنا المقدر . والبارئ المنشئ المخترع . والمصور مصور الصور ومركبها على هيئات مختلفة . فالتصوير مرتب على الخلق والبراية وتابع لهما . ومعنى التصوير التخطيط والتشكيل . وخلق الله الإنسان في أرحام الأمهات ثلاث خلق : جعله علقة ، ثم مضغة ، ثم جعله صورة وهو التشكيل الذي يكون به صورة وهيئة يعرف بها ويتميز عن غيره بسمتها . فتبارك الله أحسن الخالقين . وقال النابغة :\nالخالق البارئ المصور في ال أرحام ماء حتى يصير دما\nوقد جعل بعض الناس الخلق بمعنى التصوير ، وليس كذلك ، وإنما التصوير آخرا والتقدير أولا والبراية بينهما . ومنه قوله الحق : وإذ تخلق من الطين كهيئة الطير . وقال زهير :\nولأنت تفري ما خلقت وبع ض القوم يخلق ثم لا يفري\nيقول : تقدر ما تقدر ثم تفريه ، أي تمضيه على وفق تقديرك ، وغيرك يقدر ما لا يتم له ولا يقع فيه مراده ، إما لقصوره في تصور تقديره أو لعجزه عن تمام مراده . وقد أتينا على هذا كله في \" الكتاب الأسنى في شرح أسماء الله الحسنى \" والحمد لله . وعن حاطب بن أبي بلتعة أنه قرأ \" البارئ المصور \" بفتح الواو ونصب الراء ، أي الذي يبرأ المصور ، أي يميز ما يصوره بتفاوت الهيئات . ذكره الزمخشري .\nله الأسماء الحسنى يسبح له ما في السماوات والأرض وهو العزيز الحكيم تقدم الكلام فيه . وعن أبي هريرة قال : سألت خليلي أبا القاسم رسول الله صلى الله عليه وسلم عن اسم الله الأعظم ، فقال : \" يا أبا هريرة ، عليك بآخر سورة الحشر فأكثر قراءتها \" فأعدت عليه فأعاد علي ، فأعدت عليه فأعاد علي . وقال جابر بن زيد : إن اسم الله الأعظم هو الله لمكان هذه الآية . وعن أنس بن مالك : أن رسول الله صلى الله عليه وسلم قال : \" من قرأ سورة الحشر غفر الله له ما تقدم من ذنبه وما تأخر \" . وعن أبي أمامة قال : قال النبي صلى الله عليه وسلم : \" من قرأ خواتيم سورة الحشر في ليل أو نهار فقبضه الله في تلك الليلة أو ذلك اليوم فقد أوجب الله له الجنة \" . .\n                                    ",
        "saadi": " هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤٢\n                                        \n                                        \n                                        \n                                        { هُوَ اللَّهُ الْخَالِقُ } لجميع المخلوقات { الْبَارِئُ } للمبروءات { الْمُصَوِّرُ } للمصورات، وهذه الأسماء متعلقة بالخلق والتدبير والتقدير، وأن ذلك كله قد انفرد الله به، لم يشاركه فيه مشارك.\n{ لَهُ الْأَسْمَاءُ الْحُسْنَى } أي: له الأسماء الكثيرة جدا، التي لا يحصيها ولا يعلمها أحد إلا الله هو، ومع ذلك، فكلها حسنى أي: صفات كمال، بل تدل على أكمل الصفات وأعظمها، لا نقص في شيء منها بوجه من الوجوه، ومن حسنها أن الله يحبها، ويحب من يحبها، ويحب من عباده أن يدعوه ويسألوه بها.\nومن كماله، وأن له الأسماء الحسنى، والصفات العليا، أن جميع من في السماوات والأرض مفتقرون إليه على الدوام، يسبحون بحمده، ويسألونه حوائجهم، فيعطيهم من فضله وكرمه ما تقتضيه رحمته وحكمته، { وَهُوَ الْعَزِيزُ الْحَكِيمُ } الذي لا يريد شيئا إلا ويكون، ولا يكون شيئا إلا لحكمة ومصلحة.\nتم تفسير سورة الحشر،\nفلله الحمد على ذلك،\nوالمنة والإحسان.\n                                    "
      },
      "originalText": "هُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖ لَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ يُسَبِّحُ لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٤٢"
    }
  ]
}