{
  "number": 549,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 5151,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُمْ مِنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ ۙ أَنْ تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ إِنْ كُنْتُمْ خَرَجْتُمْ جِهَادًا فِي سَبِيلِي وَابْتِغَاءَ مَرْضَاتِي ۚ تُسِرُّونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِمَا أَخْفَيْتُمْ وَمَا أَعْلَنْتُمْ ۚ وَمَنْ يَفْعَلْهُ مِنْكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ",
      "surah": {
        "number": 60,
        "name": "سورة الممتحنة",
        "englishName": "Al-Mumtahana",
        "englishNameTranslation": "She that is to be examined",
        "revelationType": "Medinan",
        "numberOfAyahs": 13
      },
      "numberInSurah": 1,
      "juz": 28,
      "manzil": 7,
      "page": 549,
      "ruku": 482,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ١\n                                    \n                                    \n                                    تفسير سورة الممتحنة وهي مدنية .\nكان سبب نزول صدر هذه السورة الكريمة قصة حاطب بن أبي بلتعة ، وذلك أن حاطبا هذا كان رجلا من المهاجرين ، وكان من أهل بدر أيضا ، وكان له بمكة أولاد ومال ، ولم يكن من قريش أنفسهم ، بل كان حليفا لعثمان . فلما عزم رسول الله - صلى الله عليه وسلم - على فتح مكة لما نقض أهلها العهد ، فأمر النبي - صلى الله عليه وسلم - المسلمين بالتجهيز لغزوهم ، وقال : \" اللهم ، عم عليهم خبرنا \" . فعمد حاطب هذا فكتب كتابا ، وبعثه مع امرأة من قريش إلى أهل مكة ، يعلمهم بما عزم عليه رسول الله - صلى الله عليه وسلم - من غزوهم ، ليتخذ بذلك عندهم يدا ، فأطلع الله رسوله على ذلك استجابة لدعائه . فبعث في أثر المرأة فأخذ الكتاب منها ، وهذا بين في هذا الحديث المتفق على صحته . قال الإمام أحمد :\nحدثنا سفيان ، عن عمرو ، أخبرني حسن بن محمد بن علي ، أخبرني عبيد الله بن أبي رافع - وقال مرة : إن عبيد الله بن أبي رافع أخبره : أنه سمع عليا رضي الله عنه ، يقول : بعثني رسول الله - صلى الله عليه وسلم - أنا ، والزبير ، والمقداد فقال : \" انطلقوا حتى تأتوا روضة خاخ فإن بها ظعينة معها كتاب ، فخذوه منها \" . فانطلقنا تعادى بنا خيلنا حتى أتينا الروضة ، فإذا نحن بالظعينة ، قلنا : أخرجي الكتاب . قالت : ما معي كتاب . قلنا : لتخرجن الكتاب أو لنلقين الثياب . قال : فأخرجت الكتاب من عقاصها ، فأخذنا الكتاب فأتينا به رسول الله - صلى الله عليه وسلم - فإذا فيه : من حاطب بن أبي بلتعة إلى ناس من المشركين بمكة يخبرهم ببعض أمر رسول الله - صلى الله عليه وسلم - . فقال رسول الله - صلى الله عليه وسلم - : \" يا حاطب ، ما هذا ؟ \" . قال : لا تعجل علي ، إني كنت امرأ ملصقا في قريش ، ولم أكن من أنفسهم ، وكان من معك من المهاجرين لهم قرابات يحمون أهليهم بمكة ، فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ فيهم يدا يحمون بها قرابتي ، وما فعلت ذلك كفرا ولا ارتدادا عن ديني ولا رضا بالكفر بعد الإسلام . فقال رسول الله - صلى الله عليه وسلم - : \" إنه صدقكم \" . فقال عمر : دعني أضرب عنق هذا المنافق . فقال : \" إنه قد شهد بدرا ما يدريك لعل الله اطلع إلى أهل بدر فقال : اعملوا ما شئتم فقد غفرت لكم \" .\nوهكذا أخرجه الجماعة إلا ابن ماجه ، من غير وجه ، عن سفيان بن عيينة به . . وزاد البخاري في كتاب \" المغازي \" : فأنزل الله السورة : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء ) . وقال في كتاب التفسير : قال عمرو : ونزلت فيه : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء ) قال : \" لا أدري الآية في الحديث أو قال عمرو \" . قال البخاري : قال علي - يعني : ابن المديني - : قيل لسفيان في هذا : نزلت ( لا تتخذوا عدوي وعدوكم أولياء ) ؟ فقال سفيان : هذا في حديث الناس ، حفظته من عمرو ما تركت منه حرفا ، وما أرى أحدا حفظه غيري .\nوقد أخرجاه في الصحيحين من حديث حصين بن عبد الرحمن ، عن سعد بن عبيدة عن أبي عبد الرحمن السلمي ، عن علي قال : بعثني رسول الله - صلى الله عليه وسلم - وأبا مرثد والزبير بن العوام ، وكلنا فارس ، وقال : انطلقوا حتى تأتوا روضة خاخ ، فإن بها امرأة من المشركين معها كتاب من حاطب إلى المشركين : فأدركناها تسير على بعير لها حيث قال رسول الله - صلى الله عليه وسلم - فقلنا : الكتاب ؟ فقالت : ما معي كتاب . فأنخناها فالتمسنا فلم نر كتابا ، فقلنا : ما كذب رسول الله - صلى الله عليه وسلم - ! لتخرجن الكتاب أو لنجردنك . فلما رأت الجد أهوت إلى حجزتها وهي محتجزة بكساء فأخرجته . فانطلقنا بها إلى رسول الله - صلى الله عليه وسلم - فقال عمر : يا رسول الله ، قد خان الله ورسوله والمؤمنين ، فدعني فلأضرب عنقه . فقال : \" ما حملك على ما صنعت ؟ \" . قال : والله ما بي إلا أن أكون مؤمنا بالله ورسوله ، أردت أن تكون لي عند القوم يد يدفع الله بها عن أهلي ومالي ، وليس أحد من أصحابك إلا له هنالك من عشيرته من يدفع الله به عن أهله وماله . فقال : \" صدق ، لا تقولوا له إلا خيرا \" . فقال عمر : إنه قد خان الله ورسوله والمؤمنين ، فدعني فلأضرب عنقه . فقال : \" أليس من أهل بدر ؟ \" فقال : \" لعل الله قد اطلع إلى أهل بدر فقال : اعملوا ما شئتم فقد وجبت لكم الجنة - أو : قد غفرت لكم \" . فدمعت عينا عمر ، وقال : الله ورسوله أعلم .\nهذا لفظ البخاري في \" المغازي \" في غزوة بدر وقد روي من وجه آخر عن علي قال ابن أبي حاتم :\nحدثنا علي بن الحسن الهسنجاني ، حدثنا عبيد بن يعيش ، حدثنا إسحاق بن سليمان الرازي ، عن أبي سنان - هو سعيد بن سنان ، - عن عمرو بن مرة الجملي ، عن أبي البختري الطائي ، عن الحارث عن علي قال : لما أراد النبي - صلى الله عليه وسلم - أن يأتي مكة أسر إلى أناس من أصحابه أنه يريد مكة ، فيهم حاطب بن أبي بلتعة وأفشى في الناس أنه يريد خيبر . قال : فكتب حاطب بن أبي بلتعة إلى أهل مكة أن رسول الله - صلى الله عليه وسلم - يريدكم . فأخبر رسول الله - صلى الله عليه وسلم - قال : فبعثني رسول الله - صلى الله عليه وسلم - وأبا مرثد ، وليس منا رجل إلا وعنده فرس ، فقال : \" ائتوا روضة خاخ فإنكم ستلقون بها امرأة معها كتاب ، فخذوه منها \" . فانطلقنا حتى رأيناها بالمكان الذي ذكر رسول الله - صلى الله عليه وسلم - . فقلنا لها : هات الكتاب . فقالت : ما معي كتاب . فوضعنا متاعها وفتشناها فلم نجده في متاعها ، فقال أبو مرثد : لعله ألا يكون معها . فقلت : ما كذب رسول الله - صلى الله عليه وسلم - ولا كذبنا . فقلنا لها : لتخرجنه أو لنعرينك . فقالت : أما تتقون الله ؟ ! ألستم مسلمين ؟ فقلنا : لتخرجنه أو لنعرينك . قال عمرو بن مرة : فأخرجته من حجزتها . وقال حبيب بن أبي ثابت : أخرجته من قبلها . فأتينا به رسول الله - صلى الله عليه وسلم - فإذا الكتاب من حاطب بن أبي بلتعة . فقام عمر فقال : يا رسول الله ، خان الله ورسوله ، فائذن لي فلأضرب عنقه . فقال رسول الله : \" أليس قد شهد بدرا ؟ \" . قالوا : بلى . وقال عمر : بلى ، ولكنه قد نكث وظاهر أعداءك عليك . فقال رسول الله - صلى الله عليه وسلم - : \" فلعل الله اطلع إلى أهل بدر فقال : اعملوا ما شئتم ، إني بما تعملون بصير \" . ففاضت عينا عمر وقال : الله ورسوله أعلم . فأرسل رسول الله - صلى الله عليه وسلم - إلى حاطب فقال : \" يا حاطب ، ما حملك على ما صنعت ؟ \" . فقال : يا رسول الله ، إني كنت امرأ ملصقا في قريش ، وكان لي بها مال وأهل ، ولم يكن من أصحابك أحد إلا وله بمكة من يمنع أهله وماله ، فكتبت إليهم بذلك ووالله - يا رسول الله - إني لمؤمن بالله ورسوله . فقال رسول الله - صلى الله عليه وسلم - : \" صدق حاطب ، فلا تقولوا لحاطب إلا خيرا \" . قال حبيب بن أبي ثابت : فأنزل الله : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة ) الآية .\nوهكذا رواه ابن جرير ، عن ابن حميد ، عن مهران ، عن أبي سنان - سعيد بن سنان - بإسناده مثله . وقد ذكر ذلك أصحاب المغازي والسير ، فقال محمد بن إسحاق بن يسار في السيرة .\nحدثني محمد بن جعفر بن الزبير ، عن عروة بن الزبير وغيره من علمائنا قال : لما أجمع رسول الله - صلى الله عليه وسلم - المسير إلى مكة ، كتب حاطب بن أبي بلتعة كتابا إلى قريش يخبرهم بالذي أجمع عليه رسول الله - صلى الله عليه وسلم - من الأمر في السير إليهم ، ثم أعطاه امرأة - زعم محمد بن جعفر أنها من مزينة وزعم غيره أنها : سارة مولاة لبني عبد المطلب - وجعل لها جعلا على أن تبلغه قريشا فجعلته في رأسها ، ثم فتلت عليه قرونها ، ثم خرجت به . وأتى رسول الله - صلى الله عليه وسلم - الخبر من السماء بما صنع حاطب ، فبعث علي بن أبي طالب ، والزبير بن العوام ، فقال : \" أدركا امرأة قد كتب معها حاطب بكتاب إلى قريش ، يحذرهم ما قد أجمعنا له من أمرهم \" .\nفخرجا حتى أدركاها بالخليفة - خليفة بني أبي أحمد - فاستنزلاها بالخليفة ، فالتمسا في رحلها فلم يجدا شيئا ، فقال لها علي بن أبي طالب : إني أحلف بالله ما كذب رسول الله وما كذبنا ولتخرجن لنا هذا الكتاب أو لنكشفنك . فلما رأت الجد منه قالت : أعرض . فأعرض ، فحلت قرون رأسها ، فاستخرجت الكتاب منها ، فدفعته إليه . فأتى به رسول الله - صلى الله عليه وسلم - فدعا رسول الله حاطبا فقال : \" يا حاطب ما حملك على هذا ؟ \" . فقال : يا رسول الله ، أما والله إني لمؤمن بالله ورسوله ما غيرت ولا بدلت ، ولكني كنت امرأ ليس لي في القوم من أهل ولا عشيرة ، وكان لي بين أظهرهم ولد وأهل فصانعتهم عليهم فقال عمر بن الخطاب : يا رسول الله ، دعني فلأضرب عنقه ، فإن الرجل قد نافق . فقال رسول الله - صلى الله عليه وسلم - : \" وما يدريك يا عمر ! لعل الله قد اطلع إلى أصحاب بدر يوم بدر فقال : اعملوا ما شئتم ، فقد غفرت لكم \" . فأنزل الله ، عز وجل ، في حاطب : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة ) إلى قوله : ( قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العداوة والبغضاء أبدا حتى تؤمنوا بالله وحده ) [ الممتحنة : 4 ] إلى آخر القصة .\nوروى معمر ، عن الزهري ، عن عروة نحو ذلك . وهكذا ذكر مقاتل بن حيان : أن هذه الآيات نزلت في حاطب بن أبي بلتعة : أنه بعث سارة مولاة بني هاشم ، وأنه أعطاها عشرة دراهم ، وأن رسول الله - صلى الله عليه وسلم - بعث في أثرها عمر بن الخطاب ، وعلي بن أبي طالب ، رضي الله عنهما ، فأدركاها بالجحفة . . . وذكر تمام القصة كنحو ما تقدم . وعن السدي قريبا منه . وهكذا قال العوفي ، عن ابن عباس ، ومجاهد ، وقتادة ، وغير واحد : أن هذه الآيات نزلت في حاطب بن أبي بلتعة .\nفقوله تعالى : ( يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة وقد كفروا بما جاءكم من الحق ) يعني : المشركين والكفار الذين هم محاربون لله ولرسوله وللمؤمنين ، الذين شرع الله عداوتهم ومصارمتهم ، ونهى أن يتخذوا أولياء ، وأصدقاء ، وأخلاء ، كما قال ( يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم ) [ المائدة : 51 ] . وهذا تهديد شديد ووعيد أكيد ، وقال تعالى : ( يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم والكفار أولياء واتقوا الله إن كنتم مؤمنين ) [ المائدة : 57 ] وقال تعالى : ( يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء من دون المؤمنين أتريدون أن تجعلوا لله عليكم سلطانا مبينا ) [ النساء : 144 ] . وقال تعالى : ( لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه ) [ آل عمران : 28 ] ; ولهذا قبل رسول الله - صلى الله عليه وسلم - عذر حاطب لما ذكر أنه إنما فعل ذلك مصانعة لقريش ، لأجل ما كان له عندهم من الأموال والأولاد .\nويذكر ها هنا الحديث الذي رواه الإمام أحمد :\nحدثنا مصعب بن سلام ، حدثنا الأجلح ، عن قيس بن أبي مسلم ، عن ربعي بن حراش ، سمعت حذيفة يقول : ضرب لنا رسول الله - صلى الله عليه وسلم - أمثالا : واحدا ، وثلاثة ، وخمسة ، وسبعة ، وتسعة ، وأحد عشر - قال : فضرب لنا منها مثلا وترك سائرها ، قال : \" إن قوما كانوا أهل ضعف ومسكنة ، قاتلهم أهل تجبر وعداء ، فأظهر الله أهل الضعف عليهم ، فعمدوا إلى عدوهم فاستعملوهم وسلطوهم ، فأسخطوا الله عليهم إلى يوم يلقونه \" .\nوقوله : ( يخرجون الرسول وإياكم ) هذا مع ما قبله من التهييج على عداوتهم وعدم موالاتهم ، لأنهم أخرجوا الرسول وأصحابه من بين أظهرهم كراهة لما هم عليه من التوحيد وإخلاص العبادة لله وحده ; ولهذا قال : ( أن تؤمنوا بالله ربكم ) أي : لم يكن لكم عندهم ذنب إلا إيمانكم بالله رب العالمين ، كقوله : ( وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد ) [ البروج : 8 ] ، وكقوله ( الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله ) [ الحج : 40 ] .\nوقوله : ( إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي ) أي : إن كنتم كذلك فلا تتخذوهم أولياء ، إن كنتم خرجتم مجاهدين في سبيلي باغين لمرضاتي عنكم فلا توالوا أعدائي وأعداءكم ، وقد أخرجوكم من دياركم وأموالكم حنقا عليكم وسخطا لدينكم .\nوقوله : ( تسرون إليهم بالمودة وأنا أعلم بما أخفيتم وما أعلنتم ) أي : تفعلون ذلك وأنا العالم بالسرائر والضمائر والظواهر ( ومن يفعله منكم فقد ضل سواء السبيل)\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ١\n                                    \n                                    \n                                    مدنية في قول الجميع ، وهي ثلاث عشرة آية .\nالممتحنة ( بكسر الحاء ) أي المختبرة ، أضيف الفعل إليها مجازا ، كما سميت سورة \" التوبة \" المبعثرة والفاضحة ; لما كشفت من عيوب المنافقين . ومن قال في هذه السورة : الممتحنة ( بفتح الحاء ) فإنه أضافها إلى المرأة التي نزلت فيها ، وهي أم كلثوم بنت عقبة بن أبي معيط ، قال الله تعالى : فامتحنوهن الله أعلم بإيمانهن الآية . وهي امرأة عبد الرحمن بن عوف ، ولدت له إبراهيم بن عبد الرحمن .\nبسم الله الرحمن الرحيم\nيا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة وقد كفروا بما جاءكم من الحق يخرجون الرسول وإياكم أن تؤمنوا بالله ربكم إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي تسرون إليهم بالمودة وأنا أعلم بما أخفيتم وما أعلنتم ومن يفعله منكم فقد ضل سواء السبيل\nقوله تعالى : يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء عدى اتخذ إلى مفعولين وهما عدوكم أولياء . والعدو فعول من عدا ، كعفو من عفا . ولكونه على زنة المصدر أوقع على الجماعة إيقاعه على الواحد .\nوفي هذه الآية سبع مسائل :\nالأولى : قوله تعالى : يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم روى الأئمة - واللفظ لمسلم - عن علي رضي الله عنه قال : بعثنا رسول الله صلى الله عليه وسلم أنا والزبير والمقداد فقال : \" ائتوا روضة خاخ فإن بها ظعينة معها كتاب فخذوه منها \" ، فانطلقنا تعادى بنا خيلنا ، فإذا نحن بالمرأة ، فقلنا : أخرجي الكتاب ، فقالت : ما معي كتاب . فقلنا : لتخرجن الكتاب أو لتلقين الثياب ، فأخرجته من عقاصها . فأتينا به رسول الله صلى الله عليه وسلم فإذا فيه : من حاطب بن أبي بلتعة . . . إلى ناس من المشركين من أهل مكة يخبرهم ببعض أمر رسول الله صلى الله عليه وسلم . فقال رسول الله صلى الله عليه وسلم : \" يا حاطب ، ما هذا ؟ \" قال : لا تعجل علي يا رسول الله ، إني كنت امرأ ملصقا في قريش - قال سفيان : كان حليفا لهم ، ولم يكن من أنفسها - وكان ممن كان معك من المهاجرين لهم قرابات يحمون بها أهليهم ، فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ فيهم يدا يحمون بها قرابتي ، ولم أفعله كفرا ولا ارتدادا عن ديني ، ولا رضا بالكفر بعد الإسلام . فقال النبي صلى الله عليه وسلم : \" صدق \" . فقال عمر : دعني يا رسول الله أضرب عنق هذا المنافق . فقال : \" إنه قد شهد بدرا ، وما يدريك لعل الله اطلع على أهل بدر فقال : اعملوا ما شئتم فقد غفرت لكم \" . فأنزل الله عز وجل : يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء . قيل : اسم المرأة سارة من موالي قريش . وكان في الكتاب : \" أما بعد ، فإن رسول الله صلى الله عليه وسلم قد توجه إليكم بجيش كالليل يسير كالسيل ، وأقسم بالله لو لم يسر إليكم إلا وحده لأظفره الله بكم ، وأنجز له موعده فيكم ، فإن الله وليه وناصره . ذكره بعض المفسرين . وذكر القشيري والثعلبي : أن حاطب بن أبي بلتعة كان رجلا من أهل اليمن ، وكان له حلف بمكة في بني أسد بن عبد العزى رهط الزبير بن العوام . وقيل : كان حليفا للزبير بن العوام ، فقدمت من مكة سارة مولاة أبي عمرو بن صيفي بن هشام بن عبد مناف إلى المدينة ، ورسول الله صلى الله عليه وسلم يتجهز لفتح مكة . وقيل : كان هذا في زمن الحديبية ; فقال لها رسول الله صلى الله عليه وسلم : \" أمهاجرة جئت يا سارة ؟ \" . فقالت : لا . قال : \" أمسلمة جئت ؟ \" قالت : لا . قال : \" فما جاء بك ؟ \" قالت : كنتم الأهل والموالي والأصل والعشيرة ، وقد ذهب الموالي - تعني قتلوا يوم بدر - وقد احتجت حاجة شديدة فقدمت عليكم لتعطوني وتكسوني ; فقال عليه الصلاة والسلام : \" فأين أنت عن شباب أهل مكة \" وكانت مغنية ، قالت : ما طلب مني شيء بعد وقعة بدر . فحث رسول الله صلى الله عليه وسلم بني عبد المطلب وبني المطلب على إعطائها ; فكسوها وأعطوها وحملوها فخرجت إلى مكة ، وأتاها حاطب فقال : أعطيك عشرة دنانير وبردا على أن تبلغي هذا الكتاب إلى أهل مكة . وكتب في الكتاب : أن رسول الله صلى الله عليه وسلم يريدكم فخذوا حذركم . فخرجت سارة ، ونزل جبريل فأخبر النبي صلى الله عليه وسلم بذلك ، فبعث عليا والزبير وأبا مرثد الغنوي . وفي رواية : عليا والزبير والمقداد . وفي رواية : أرسل عليا وعمار بن ياسر . وفي رواية : عليا وعمارا وعمر والزبير وطلحة والمقداد وأبا مرثد - وكانوا كلهم فرسانا - وقال لهم : \" انطلقوا حتى تأتوا روضة خاخ فإن بها ظعينة ومعها كتاب من حاطب إلى المشركين ، فخذوه منها وخلوا سبيلها ، فإن لم تدفعه لكم فاضربوا عنقها \" فأدركوها في ذلك المكان ، فقالوا لها : أين الكتاب ؟ فحلفت ما معها كتاب ، ففتشوا أمتعتها فلم يجدوا معها كتابا ، فهموا بالرجوع فقال علي : والله ما كذبنا ولا كذبنا ! وسل سيفه وقال : أخرجي الكتاب وإلا والله لأجردنك ولأضربن عنقك ، فلما رأت الجد أخرجته من ذؤابتها - وفي رواية من حجزتها - فخلوا سبيلها ورجعوا بالكتاب إلى رسول الله صلى الله عليه وسلم . فأرسل إلى حاطب فقال : \" هل تعرف الكتاب ؟ \" قال : نعم . وذكر الحديث بنحو ما تقدم . وروي أن النبي صلى الله عليه وسلم أمن جميع الناس يوم الفتح إلا أربعة هي أحدهم .\nالثانية : السورة أصل في النهي عن موالاة الكفار . وقد مضى ذلك في غير موضع . من ذلك قوله تعالى : لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين . يا أيها الذين آمنوا لا تتخذوا بطانة من دونكم . يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء . ومثله كثير . وذكر أن حاطبا لما سمع يا أيها الذين آمنوا غشي عليه من الفرح بخطاب الإيمان .\nالثالثة : قوله تعالى : تلقون إليهم بالمودة يعني بالظاهر ; لأن قلب حاطب كان سليما ; بدليل أن النبي صلى الله عليه وسلم قال لهم : \" أما صاحبكم فقد صدق \" وهذا نص في سلامة فؤاده وخلوص اعتقاده . والباء في بالمودة زائدة ; كما تقول : قرأت السورة وقرأت بالسورة ، ورميت إليه ما في نفسي وبما في نفسي . ويجوز أن تكون ثابتة على أن مفعول تلقون محذوف ; معناه تلقون إليهم أخبار رسول الله صلى الله عليه وسلم بسبب المودة التي بينكم وبينهم . وكذلك : تسرون إليهم بالمودة أي بسبب المودة . وقال الفراء : تلقون إليهم بالمودة من صلة أولياء ، ودخول الباء في المودة وخروجها سواء . ويجوز أن تتعلق ب لا تتخذوا حالا من ضميره . وب أولياء صفة له ، ويجوز أن تكون استئنافا . ومعنى تلقون إليهم بالمودة تخبرونهم بسرائر المسلمين وتنصحون لهم ; وقاله الزجاج .\nالرابعة : من كثر تطلعه على عورات المسلمين وينبه عليهم ويعرف عدوهم بأخبارهم لم يكن بذلك كافرا إذا كان فعله لغرض دنيوي ، واعتقاده على ذلك سليم ; كما فعل حاطب حين قصد بذلك اتخاذ اليد ولم ينو الردة عن الدين .\nالخامسة : إذا قلنا لا يكون بذلك كافرا فهل يقتل بذلك حدا أم لا ؟ اختلف الناس فيه ; فقال مالك وابن القاسم وأشهب : يجتهد في ذلك الإمام . وقال عبد الملك : إذا كانت عادته تلك قتل لأنه جاسوس ، وقد قال مالك بقتل الجاسوس - وهو صحيح لإضراره بالمسلمين وسعيه بالفساد في الأرض . ولعل ابن الماجشون إنما اتخذ التكرار في هذا لأن حاطبا أخذ في أول فعله . والله أعلم .\nالسادسة : فإن كان الجاسوس كافرا ، فقال الأوزاعي : يكون نقضا لعهده . وقال أصبغ : الجاسوس الحربي يقتل ، والجاسوس المسلم والذمي يعاقبان إلا إن تظاهرا على الإسلام فيقتلان . وقد روي عن علي بن أبي طالب رضي الله عنه أن النبي صلى الله عليه وسلم أتى بعين للمشركين اسمه فرات بن حيان ، فأمر به أن يقتل ; فصاح : يا معشر الأنصار ، أقتل وأنا أشهد أن لا إله إلا الله وأن محمدا رسول الله ! فأمر به النبي صلى الله عليه وسلم فخلى سبيله . ثم قال : \" إن منكم من أكله إلى إيمانه منهم فرات بن حيان \" . وقوله : \" وقد كفروا \" حال ، إما من : لا تتخذوا ، وإما من \" تلقون \" ؛ أي لا تتولوهم أو توادوهم ، وهذه حالهم . وقرأ الجحدري \" لما جاءكم \" أي كفروا لأجل ما جاءكم من الحق .\nالسابعة : قوله تعالى : يخرجون الرسول استئناف كلام كالتفسير لكفرهم وعتوهم ، أو حال من كفروا . وإياكم أن تؤمنوا بالله ربكم تعليل ل يخرجون ؛ المعنى يخرجون الرسول ويخرجونكم من مكة لأن تؤمنوا بالله أي لأجل إيمانكم بالله . قال ابن عباس : وكان حاطب ممن أخرج مع النبي صلى الله عليه وسلم . وقيل : في الكلام تقديم وتأخير ، والتقدير لا تتخذوا عدوي وعدوكم أولياء إن كنتم خرجتم مجاهدين في سبيلي . وقيل : في الكلام حذف ، والمعنى إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي ، فلا تلقوا إليهم بالمودة .\nقيل : إن كنتم خرجتم جهادا في سبيلي وابتغاء مرضاتي شرط وجوابه مقدم . والمعنى إن كنتم خرجتم جهادا في سبيلي فلا تتخذوا عدوي وعدوكم أولياء . ونصب جهادا وابتغاء ؛ لأنه مفعول . وقوله : تسرون إليهم بالمودة بدل من تلقون ومبين عنه . والأفعال تبدل من الأفعال ، كما قال تعالى : ومن يفعل ذلك يلق أثاما يضاعف له العذاب . وأنشد سيبويه :\nمتى تأتنا تلمم بنا في ديارنا تجد حطبا جزلا ونارا تأججا\nوقيل : هو على تقدير أنتم تسرون إليهم بالمودة ، فيكون استئنافا . وهذا كله معاتبة لحاطب . وهو يدل على فضله وكرامته ونصيحته لرسول الله صلى الله عليه وسلم وصدق إيمانه ، فإن المعاتبة لا تكون إلا من محب لحبيبه . كما قال :\nأعاتب ذا المودة من صديق إذا ما رابني منه اجتناب\nإذا ذهب العتاب فليس ود ويبقى الود ما بقي العتاب\nومعنى بالمودة أي بالنصيحة في الكتاب إليهم . والباء زائدة كما ذكرنا ، أو ثابتة غير زائدة .\nقوله تعالى : وأنا أعلم بما أخفيتم : أضمرتم ، وما أعلنتم : أظهرتم . والباء في بما زائدة ; يقال : علمت كذا ، وعلمت بكذا . وقيل : وأنا أعلم من كل أحد بما تخفون وما تعلنون ، فحذف من كل أحد . كما يقال : فلان أعلم وأفضل من غيره . وقال ابن عباس : وأنا أعلم بما أخفيتم في صدوركم ، وما أظهرتم بألسنتكم من الإقرار والتوحيد .\nومن يفعله منكم أي من يسر إليهم ويكاتبهم منكم .\nفقد ضل سواء السبيل أي أخطأ قصد الطريق .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ١\n                                        \n                                        \n                                        \n                                        ذكر كثير من المفسرين، [رحمهم الله]، أن سبب نزول هذه الآيات الكريمات في قصة حاطب بن أبي بلتعة، حين غزا النبي صلى الله عليه وسلم غزوة الفتح، فكتب حاطب إلى قريش يخبرهم بمسير رسول الله صلى الله عليه وسلم إليهم، ليتخذ بذلك يدا عندهم لا [شكا و] نفاقا، وأرسله مع امرأة، فأخبر النبي صلى الله عليه وسلم بشأنه، فأرسل إلى المرأة قبل وصولها وأخذ منها الكتاب.\nوعاتب حاطبا، فاعتذر رضي الله عنه بعذر قبله النبي صلى الله عليه وسلم، وهذه الآيات فيها النهي الشديد عن موالاة الكفار من المشركين وغيرهم، وإلقاء المودة إليهم، وأن ذلك مناف للإيمان، ومخالف لملة إبراهيم الخليل عليه الصلاة والسلام، ومناقض للعقل الذي يوجب الحذر كل الحذر من العدو، الذي لا يبقي من مجهوده في العداوة شيئا، وينتهز الفرصة في إيصال الضرر إلى عدوه، فقال تعالى: { يَا أَيُّهَا الَّذِينَ آمَنُوا } اعملوا بمقتضى إيمانكم، من ولاية من قام بالإيمان، ومعاداة من عاداه، فإنه عدو لله، وعدو للمؤمنين.\nفلا تتخذوا عدو الله { وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ } أي: تسارعون في مودتهم وفي السعي بأسبابها، فإن المودة إذا حصلت، تبعتها النصرة والموالاة، فخرج العبد من الإيمان، وصار من جملة أهل الكفران، وانفصل عن أهل الإيمان.\nوهذا المتخذ للكافر وليا، عادم المروءة أيضا، فإنه كيف يوالي أعدى أعدائه الذي لا يريد له إلا الشر، ويخالف ربه ووليه الذي يريد به الخير، ويأمره به، ويحثه عليه؟! ومما يدعو المؤمن أيضا إلى معاداة الكفار، أنهم قد كفروا بما جاء المؤمنين من الحق، ولا أعظم من هذه المخالفة والمشاقة، فإنهم قد كفروا بأصل دينكم، وزعموا أنكم ضلال على غير هدى.\nوالحال أنهم كفروا بالحق الذي لا شك فيه ولا مرية، ومن رد الحق فمحال أن يوجد له دليل أو حجة تدل على صحة قوله، بل مجرد العلم بالحق يدل على بطلان قول من رده وفساده.\nومن عداوتهم البليغة أنهم { يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ } أيها المؤمنون من دياركم، ويشردونكم من أوطانكم، ولا ذنب لكم في ذلك عندهم، إلا أنكم تؤمنون بالله ربكم الذي يتعين على الخلق كلهم القيام بعبوديته، لأنه رباهم، وأنعم عليهم، بالنعم الظاهرة والباطنة، وهو الله تعالى.\nفلما أعرضوا عن هذا الأمر، الذي هو أوجب الواجبات، وقمتم به، عادوكم، وأخرجوكم - من أجله - من دياركم، فأي دين، وأي مروءة وعقل، يبقى مع العبد إذا والى الكفار الذين هذا وصفهم في كل زمان أو مكان؟\" ولا يمنعهم منه إلا خوف، أو مانع قوي.\n{ إِنْ كُنْتُمْ خَرَجْتُمْ جِهَادًا فِي سَبِيلِي وَابْتِغَاءَ مَرْضَاتِي } أي: إن كان خروجكم مقصودكم به الجهاد في سبيل الله، لإعلاء كلمة الله، وابتغاء مرضاة الله فاعملوا بمقتضى هذا، من موالاة أولياء الله ومعاداة أعدائه، فإن هذا هو الجهاد في سبيله وهو من أعظم ما يتقرب به المتقربون إلى ربهم ويبتغون به رضاه.\n{ تُسِرُّونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِمَا أَخْفَيْتُمْ وَمَا أَعْلَنْتُمْ } أي: كيف تسرون المودة للكافرين وتخفونها، مع علمكم أن الله عالم بما تخفون وما تعلنون؟!، فهو وإن خفي على المؤمنين، فلا يخفى على الله تعالى، وسيجازي العباد بما يعلمه منهم من الخير والشر، { وَمَنْ يَفْعَلْهُ مِنْكُمْ } أي: موالاة الكافرين بعد ما حذركم الله منها { فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ } لأنه سلك مسلكا مخالفا للشرع وللعقل والمروءة الإنسانية.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ١"
    },
    {
      "number": 5152,
      "text": "إِنْ يَثْقَفُوكُمْ يَكُونُوا لَكُمْ أَعْدَاءً وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُمْ بِالسُّوءِ وَوَدُّوا لَوْ تَكْفُرُونَ",
      "surah": {
        "number": 60,
        "name": "سورة الممتحنة",
        "englishName": "Al-Mumtahana",
        "englishNameTranslation": "She that is to be examined",
        "revelationType": "Medinan",
        "numberOfAyahs": 13
      },
      "numberInSurah": 2,
      "juz": 28,
      "manzil": 7,
      "page": 549,
      "ruku": 482,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ ٢\n                                    \n                                    \n                                    إن يثقفوكم يكونوا لكم أعداء ويبسطوا إليكم أيديهم وألسنتهم بالسوء ) أي : لو قدروا عليكم لما اتقوا فيكم من أذى ينالونكم به بالمقال والفعال . ( وودوا لو تكفرون ) أي : ويحرصون على ألا تنالوا خيرا ، فهم عداوتهم لكم كامنة وظاهرة ، فكيف توالون مثل هؤلاء ؟ وهذا تهييج على عداوتهم أيضا .\n                                    ",
        "qortoby": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ ٢\n                                    \n                                    \n                                    قوله تعالى : إن يثقفوكم يكونوا لكم أعداء ويبسطوا إليكم أيديهم وألسنتهم بالسوء وودوا لو تكفرون\nقوله تعالى : \" إن يثقفوكم \" : يلقوكم ويصادفوكم ; ومنه المثاقفة ; أي طلب مصادفة الغرة في المسايفة وشبهها . وقيل : يثقفوكم يظفروا بكم ويتمكنوا منكم .\nيكونوا لكم أعداء ويبسطوا إليكم أيديهم وألسنتهم بالسوء أي أيديهم بالضرب والقتل ، وألسنتهم بالشتم .\nوودوا لو تكفرون بمحمد ; فلا تناصحوهم فإنهم لا يناصحونكم .\n                                    ",
        "saadi": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ ٢\n                                        \n                                        \n                                        \n                                        ثم بين تعالى شدة عداوتهم، تهييجا للمؤمنين على عداوتهم، { إِنْ يَثْقَفُوكُمْ } أي: يجدوكم، وتسنح لهم الفرصة في أذاكم، { يَكُونُوا لَكُمْ أَعْدَاءً } ظاهرين { وَيَبْسُطُوا إِلَيْكُمْ أَيْدِيَهُمْ } بالقتل والضرب، ونحو ذلك.\n{ وَأَلْسِنَتَهُمْ بِالسُّوءِ } أي: بالقول الذي يسوء، من شتم وغيره، { وَوَدُّوا لَوْ تَكْفُرُونَ } فإن هذا غاية ما يريدون منكم.\n                                    "
      },
      "originalText": "إِن يَثۡقَفُوكُمۡ يَكُونُواْ لَكُمۡ أَعۡدَآءٗ وَيَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ وَأَلۡسِنَتَهُم بِٱلسُّوٓءِ وَوَدُّواْ لَوۡ تَكۡفُرُونَ ٢"
    },
    {
      "number": 5153,
      "text": "لَنْ تَنْفَعَكُمْ أَرْحَامُكُمْ وَلَا أَوْلَادُكُمْ ۚ يَوْمَ الْقِيَامَةِ يَفْصِلُ بَيْنَكُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "surah": {
        "number": 60,
        "name": "سورة الممتحنة",
        "englishName": "Al-Mumtahana",
        "englishNameTranslation": "She that is to be examined",
        "revelationType": "Medinan",
        "numberOfAyahs": 13
      },
      "numberInSurah": 3,
      "juz": 28,
      "manzil": 7,
      "page": 549,
      "ruku": 482,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٣\n                                    \n                                    \n                                    وقوله : ( لن تنفعكم أرحامكم ولا أولادكم يوم القيامة يفصل بينكم والله بما تعملون بصير ) أي : قراباتكم لا تنفعكم عند الله إذا أراد الله بكم سوءا ، ونفعهم لا يصل إليكم إذا أرضيتموهم بما يسخط الله ، ومن وافق أهله على الكفر ليرضيهم فقد خاب وخسر وضل عمله ، ولا ينفعه عند الله قرابته من أحد ، ولو كان قريبا إلى نبي من الأنبياء . قال الإمام أحمد :\nحدثنا عفان ، حدثنا حماد ، عن ثابت ، عن أنس أن رجلا قال : يا رسول الله : أين أبي ؟ قال : \" في النار \" فلما قفى دعاه فقال : \" إن أبي وأباك في النار \" .\nورواه مسلم ، وأبو داود ، من حديث حماد بن سلمة به .\n                                    ",
        "qortoby": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٣\n                                    \n                                    \n                                    قوله تعالى : لن تنفعكم أرحامكم ولا أولادكم يوم القيامة يفصل بينكم والله بما تعملون بصير\nقوله تعالى : لن تنفعكم أرحامكم لما اعتذر حاطب بأن له أولادا وأرحاما فيما بينهم ، بين الرب عز وجل أن الأهل والأولاد لا ينفعون شيئا يوم القيامة إن عصي من أجل ذلك .\nيفصل بينكم فيدخل المؤمنين الجنة ويدخل الكافرين النار . وفي يفصل قراءات سبع : قرأ عاصم \" يفصل \" بفتح الياء وكسر الصاد مخففا . وقرأ حمزة والكسائي مشددا إلا أنه على ما لم يسم فاعله . وقرأ طلحة والنخعي بالنون وكسر الصاد مشددة . وروي عن علقمة كذلك بالنون مخففة . وقرأ قتادة وأبو حيوة \" يفصل \" بضم الياء وكسر الصاد مخففة من أفصل . وقرأ الباقون \" يفصل \" بياء مضمومة وتخفيف الفاء وفتح الصاد على الفعل المجهول ، واختاره أبو عبيد . فمن خفف فلقوله : وهو خير الفاصلين وقوله : إن يوم الفصل . ومن شدد فلأن ذلك أبين في الفعل الكثير المكرر المتردد . ومن أتى به على ما لم يسم فاعله فلأن الفاعل معروف . ومن أتى به مسمى الفاعل رد الضمير إلى الله تعالى . ومن قرأ بالنون فعلى التعظيم .\nوالله بما تعملون بصير\n                                    ",
        "saadi": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٣\n                                        \n                                        \n                                        \n                                        فإن احتججتم وقلتم: نوالي الكفار لأجل القرابة والأموال، فلن تغني عنكم أموالكم ولا أولادكم من الله شيئا. { والله بما تعملون بصير } فلذلك حذركم من موالاة الكافرين الذين تضركم موالاتهم.\n                                    "
      },
      "originalText": "لَن تَنفَعَكُمۡ أَرۡحَامُكُمۡ وَلَآ أَوۡلَٰدُكُمۡۚ يَوۡمَ ٱلۡقِيَٰمَةِ يَفۡصِلُ بَيۡنَكُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٣"
    },
    {
      "number": 5154,
      "text": "قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِي إِبْرَاهِيمَ وَالَّذِينَ مَعَهُ إِذْ قَالُوا لِقَوْمِهِمْ إِنَّا بُرَآءُ مِنْكُمْ وَمِمَّا تَعْبُدُونَ مِنْ دُونِ اللَّهِ كَفَرْنَا بِكُمْ وَبَدَا بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَاءُ أَبَدًا حَتَّىٰ تُؤْمِنُوا بِاللَّهِ وَحْدَهُ إِلَّا قَوْلَ إِبْرَاهِيمَ لِأَبِيهِ لَأَسْتَغْفِرَنَّ لَكَ وَمَا أَمْلِكُ لَكَ مِنَ اللَّهِ مِنْ شَيْءٍ ۖ رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",
      "surah": {
        "number": 60,
        "name": "سورة الممتحنة",
        "englishName": "Al-Mumtahana",
        "englishNameTranslation": "She that is to be examined",
        "revelationType": "Medinan",
        "numberOfAyahs": 13
      },
      "numberInSurah": 4,
      "juz": 28,
      "manzil": 7,
      "page": 549,
      "ruku": 482,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٤\n                                    \n                                    \n                                    يقول تعالى لعباده المؤمنين الذين أمرهم بمصارمة الكافرين ، وعداوتهم ، ومجانبتهم ، والتبري منهم : ( قد كانت لكم أسوة حسنة في إبراهيم والذين معه ) أي : وأتباعه الذين آمنوا معه ( إذ قالوا لقومهم إنا برآء منكم ) أي : تبرأنا منكم ( ومما تعبدون من دون الله كفرنا بكم ) أي : بدينكم وطريقكم ( وبدا بيننا وبينكم العداوة والبغضاء أبدا ) يعني : وقد شرعت العداوة والبغضاء من الآن بيننا وبينكم ، ما دمتم على كفركم فنحن أبدا نتبرأ منكم ونبغضكم ( حتى تؤمنوا بالله وحده ) أي : إلى أن توحدوا الله فتعبدوه وحده لا شريك له ، وتخلعوا ما تعبدون معه من الأنداد والأوثان .\nوقوله : ( إلا قول إبراهيم لأبيه لأستغفرن لك ) أي : لكم في إبراهيم وقومه أسوة حسنة تتأسون بها ، إلا في استغفار إبراهيم لأبيه ، فإنه إنما كان عن موعدة وعدها إياه ، فلما تبين له أنه عدو لله تبرأ منه . وذلك أن بعض المؤمنين كانوا يدعون لآبائهم الذين ماتوا على الشرك ويستغفرون لهم ، ويقولون : إن إبراهيم كان يستغفر لأبيه ، فأنزل الله ، عز وجل : ( ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى من بعد ما تبين لهم أنهم أصحاب الجحيم وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه إن إبراهيم لأواه حليم ) [ التوبة : 113 ، 114 ] . وقال تعالى في هذه الآية الكريمة : ( قد كانت لكم أسوة حسنة في إبراهيم والذين معه ) إلى قوله : ( إلا قول إبراهيم لأبيه لأستغفرن لك وما أملك لك من الله من شيء ) أي : ليس لكم في ذلك أسوة ، أي : في الاستغفار للمشركين ، هكذا قال ابن عباس ، ومجاهد ، وقتادة ، ومقاتل ، والضحاك ، وغير واحد .\nثم قال تعالى مخبرا عن قول إبراهيم والذين معه ، حين فارقوا قومهم وتبرءوا منهم ، فلجئوا إلى الله وتضرعوا إليه فقالوا : ( ربنا عليك توكلنا وإليك أنبنا وإليك المصير ) أي : توكلنا عليك في جميع الأمور ، وسلمنا أمورنا إليك ، وفوضناها إليك ( وإليك المصير ) أي : المعاد في الدار الآخرة .\n                                    ",
        "qortoby": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٤\n                                    \n                                    \n                                    قوله تعالى : قد كانت لكم أسوة حسنة في إبراهيم والذين معه إذ قالوا لقومهم إنا برآء منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العداوة والبغضاء أبدا حتى تؤمنوا بالله وحده إلا قول إبراهيم لأبيه لأستغفرن لك وما أملك لك من الله من شيء ربنا عليك توكلنا وإليك أنبنا وإليك المصير\nقوله تعالى : قد كانت لكم أسوة حسنة في إبراهيم لما نهى عز وجل عن موالاة الكفار ذكر قصة إبراهيم عليه السلام ، وأن من سيرته التبرؤ من الكفار ; أي فاقتدوا به وأتموا ; إلا في استغفاره لأبيه . والإسوة والأسوة ما يتأسى به ، مثل القدوة والقدوة . ويقال : هو إسوتك ; أي مثلك وأنت مثله . وقرأ عاصم أسوة بضم الهمزة لغتان .\nوالذين معه يعني أصحاب إبراهيم من المؤمنين . وقال ابن زيد : هم الأنبياء\nإذ قالوا لقومهم الكفار .\nإنا برآء منكم ومما تعبدون من دون الله أي الأصنام . وبرآء جمع بريء ; مثل شريك وشركاء ، وظريف وظرفاء . وقراءة العامة على وزن فعلاء . وقرأ عيسى بن عمر وابن أبي إسحاق \" براء \" بكسر الباء على وزن فعال ; مثل قصير وقصار ، وطويل وطوال ، وظريف وظراف . ويجوز ترك الهمزة حتى تقول : برا ; وتنون . وقرئ \" براء \" على الوصف بالمصدر . وقرئ \" براء \" على إبدال الضم من الكسر ; كرخال ورباب . والآية نص في الأمر بالاقتداء بإبراهيم عليه السلام في فعله . وذلك يصحح أن شرع من قبلنا شرع لنا فيما أخبر الله ورسوله .\n\" كفرنا بكم \" أي بما آمنتم به من الأوثان . وقيل : أي بأفعالكم وكذبناها وأنكرنا أن تكونوا على حق .\nوبدا بيننا وبينكم العداوة والبغضاء أبدا أي هذا دأبنا معكم ما دمتم على كفركم .\nحتى تؤمنوا بالله وحده فحينئذ تنقلب المعاداة موالاة .\nإلا قول إبراهيم لأبيه لأستغفرن لك فلا تتأسوا به في الاستغفار فتستغفرون للمشركين ; فإنه كان عن موعدة منه له ; قاله قتادة ومجاهد وغيرهما . وقيل : معنى الاستثناء أن إبراهيم هجر قومه وباعدهم إلا في الاستغفار لأبيه ، ثم بين عذره في سورة \" التوبة \" . وفي هذا دلالة على تفضيل نبينا عليه الصلاة والسلام على سائر الأنبياء ; لأنا حين أمرنا بالاقتداء به أمرنا أمرا مطلقا في قوله تعالى : وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا وحين أمرنا بالاقتداء بإبراهيم عليه السلام استثنى بعض أفعاله . وقيل : هو استثناء منقطع ; أي لكن قول إبراهيم لأبيه لأستغفرن لك ، إنما جرى لأنه ظن أنه أسلم ، فلما بان له أنه لم يسلم تبرأ منه . وعلى هذا يجوز الاستغفار لمن يظن أنه أسلم ; وأنتم لم تجدوا مثل هذا الظن ، فلم توالوهم .\nوما أملك لك من الله من شيء هذا من قول إبراهيم عليه السلام لأبيه ; أي ما أدفع عنك من عذاب الله شيئا إن أشركت به .\n\" ربنا عليك توكلنا \" هذا من دعاء إبراهيم عليه السلام وأصحابه . وقيل : علم المؤمنين أن يقولوا هذا . أي تبرءوا من الكفار وتوكلوا على الله وقولوا : ربنا عليك توكلنا ؛ أي اعتمدنا .\nوإليك أنبنا ؛ أي رجعنا .\n\" وإليك المصير \" لك الرجوع في الآخرة .\n                                    ",
        "saadi": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٤\n                                        \n                                        \n                                        \n                                        قد كان لكم يا معشر المؤمنين { أُسْوَةٌ حَسَنَةٌ } أي: قدوة صالحة وائتمام ينفعكم، { فِي إِبْرَاهِيمَ وَالَّذِينَ مَعَهُ } من المؤمنين، لأنكم قد أمرتم أن تتبعوا ملة إبراهيم حنيفا، { إِذْ قَالُوا لِقَوْمِهِمْ إِنَّا بُرَآءُ مِنْكُمْ وَمِمَّا تَعْبُدُونَ مِنْ دُونِ اللَّهِ } أي: إذ تبرأ إبراهيم عليه السلام ومن معه من المؤمنين، من قومهم المشركين ومما يعبدون من دون الله.\nثم صرحوا بعداوتهم غاية التصريح، فقالوا: { كَفَرْنَا بِكُمْ وَبَدَا } أي: ظهر وبان { بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَاءُ } أي: البغض بالقلوب، وزوال مودتها، والعداوة بالأبدان، وليس لتلك العداوة والبغضاء وقت ولا حد، بل ذلك { أَبَدًا } ما دمتم مستمرين على كفركم { حَتَّى تُؤْمِنُوا بِاللَّهِ وَحْدَهُ } أي: فإذا آمنتم بالله وحده، زالت العداوة والبغضاء، وانقلبت مودة وولاية، فلكم أيها المؤمنون أسوة [حسنة] في إبراهيم ومن معه في القيام بالإيمان والتوحيد، والقيام بلوازم ذلك ومقتضياته، وفي كل شيء تعبدوا به لله وحده، { إِلَّا } في خصلة واحدة وهي { قَوْلَ إِبْرَاهِيمَ لِأَبِيهِ } آزر المشرك، الكافر، المعاند، حين دعاه إلى الإيمان والتوحيد، فامتنع، فقال إبراهيم : { لَأَسْتَغْفِرَنَّ لَكَ و } الحال أني لا { أَمْلِكُ لَكَ مِنَ اللَّهِ مِنْ شَيْءٍ } لكني أدعو ربي عسى أن لا أكون بدعاء ربي شقيا، فليس لكم أن تقتدوا بإبراهيم في هذه الحالة التي دعا بها للمشرك، فليس لكم أن تدعوا للمشركين، وتقولوا: إنا في ذلك متبعون لملة إبراهيم، فإن الله ذكر عذر إبراهيم في ذلك بقوله: { وَمَا كَانَ اسْتِغْفَارُ إِبْرَاهِيمَ لِأَبِيهِ إِلَّا عَنْ مَوْعِدَةٍ وَعَدَهَا إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ إن إبراهيم لأواه حليم }\nولكم أسوة حسنة في إبراهيم ومن معه، حين دعوا الله وتوكلوا عليه وأنابوا إليه، واعترفوا بالعجز والتقصير، فقالوا: { رَبَّنَا عَلَيْكَ تَوَكَّلْنَا } أي: اعتمدنا عليك في جلب ما ينفعنا ودفع ما يضرنا، ووثقنا بك يا ربنا في ذلك.\n{ وَإِلَيْكَ أَنَبْنَا } أي: رجعنا إلى طاعتك ومرضاتك وجميع ما يقرب إليك، فنحن في ذلك ساعون، وبفعل الخيرات مجتهدون، ونعلم أنا إليك نصير، فسنستعد للقدوم عليك، ونعمل ما يقربنا الزلفى إليك\n                                    "
      },
      "originalText": "قَدۡ كَانَتۡ لَكُمۡ أُسۡوَةٌ حَسَنَةٞ فِيٓ إِبۡرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذۡ قَالُواْ لِقَوۡمِهِمۡ إِنَّا بُرَءَٰٓؤُاْ مِنكُمۡ وَمِمَّا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ كَفَرۡنَا بِكُمۡ وَبَدَا بَيۡنَنَا وَبَيۡنَكُمُ ٱلۡعَدَٰوَةُ وَٱلۡبَغۡضَآءُ أَبَدًا حَتَّىٰ تُؤۡمِنُواْ بِٱللَّهِ وَحۡدَهُۥٓ إِلَّا قَوۡلَ إِبۡرَٰهِيمَ لِأَبِيهِ لَأَسۡتَغۡفِرَنَّ لَكَ وَمَآ أَمۡلِكُ لَكَ مِنَ ٱللَّهِ مِن شَيۡءٖۖ رَّبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَإِلَيۡكَ أَنَبۡنَا وَإِلَيۡكَ ٱلۡمَصِيرُ ٤"
    },
    {
      "number": 5155,
      "text": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 60,
        "name": "سورة الممتحنة",
        "englishName": "Al-Mumtahana",
        "englishNameTranslation": "She that is to be examined",
        "revelationType": "Medinan",
        "numberOfAyahs": 13
      },
      "numberInSurah": 5,
      "juz": 28,
      "manzil": 7,
      "page": 549,
      "ruku": 482,
      "hizbQuarter": 219,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٥\n                                    \n                                    \n                                    ( ربنا لا تجعلنا فتنة للذين كفروا ) قال مجاهد : معناه : لا تعذبنا بأيديهم ، ولا بعذاب من عندك ، فيقولوا : لو كان هؤلاء على حق ما أصابهم هذا . وكذا قال الضحاك .\nوقال قتادة لا تظهرهم علينا فيفتتنوا بذلك ، يرون أنهم إنما ظهروا علينا لحق هم عليه . واختاره ابن جرير .\nوقال علي بن أبي طلحة ، عن ابن عباس : لا تسلطهم علينا فيفتنونا .\nوقوله : ( واغفر لنا ربنا إنك أنت العزيز الحكيم ) أي : واستر ذنوبنا عن غيرك ، واعف عنها فيما بيننا وبينك ، ( إنك أنت العزيز الحكيم ) أي : الذي لا يضام من لاذ بجناحك ) الحكيم ) في أقوالك وأفعالك وشرعك وقدرك .\n                                    ",
        "qortoby": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٥\n                                    \n                                    \n                                    ربنا لا تجعلنا فتنة للذين كفروا أي لا تظهر عدونا علينا فيظنوا أنهم على حق فيفتتنوا بذلك . وقيل : لا تسلطهم علينا فيفتنونا ويعذبونا .\nواغفر لنا ربنا إنك أنت العزيز الحكيم\n                                    ",
        "saadi": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٥\n                                        \n                                        \n                                        \n                                        { رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا } أي: لا تسلطهم علينا بذنوبنا، فيفتنونا، ويمنعونا مما يقدرون عليه من أمور الإيمان، ويفتنون أيضا بأنفسهم، فإنهم إذا رأوا لهم الغلبة، ظنوا أنهم على الحق وأنا على الباطل، فازدادوا كفرا وطغيانا، { وَاغْفِرْ لَنَا } ما اقترفنا من الذنوب والسيئات، وما قصرنا به من المأمورات، { رَبَّنَا إِنَّكَ أَنْتَ الْعَزِيزُ } القاهر لكل شيء، { الْحَكِيمُ } الذي يضع الأشياء مواضعها، فبعزتك وحكمتك انصرنا على أعدائنا، واغفر لنا ذنوبنا، وأصلح عيوبنا.\n                                    "
      },
      "originalText": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلَّذِينَ كَفَرُواْ وَٱغۡفِرۡ لَنَا رَبَّنَآۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٥"
    }
  ]
}