{
  "number": 558,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 5218,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُوا الْعِدَّةَ ۖ وَاتَّقُوا اللَّهَ رَبَّكُمْ ۖ لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ ۚ وَتِلْكَ حُدُودُ اللَّهِ ۚ وَمَنْ يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ ۚ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا",
      "surah": {
        "number": 65,
        "name": "سورة الطلاق",
        "englishName": "At-Talaaq",
        "englishNameTranslation": "Divorce",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 1,
      "juz": 28,
      "manzil": 7,
      "page": 558,
      "ruku": 492,
      "hizbQuarter": 223,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا ١\n                                    \n                                    \n                                    تفسير سورة الطلاق وهي مدنية .\nخوطب النبي - صلى الله عليه وسلم - أولا تشريفا وتكريما ، ثم خاطب الأمة تبعا فقال : ( يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن )\nوقال ابن أبي حاتم : حدثنا محمد بن ثواب بن سعيد الهباري ، حدثنا أسباط بن محمد ، عن سعيد ، عن قتادة ، عن أنس قال : طلق رسول الله - صلى الله عليه وسلم - حفصة فأتت أهلها ، فأنزل الله ، عز وجل : ( يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن ) فقيل له : راجعها فإنها صوامة قوامة ، وهي من أزواجك ونسائك في الجنة .\nورواه ابن جرير ، عن ابن بشار ، عن عبد الأعلى ، عن سعيد ، عن قتادة . . . فذكره مرسلا ، وقد ورد من غير وجه : أن رسول الله - صلى الله عليه وسلم - طلق حفصة ثم راجعها .\nوقال البخاري : حدثنا يحيى بن بكير ، حدثنا الليث ، وعقيل ، عن ابن شهاب ، أخبرني ، سالم : أن عبد الله بن عمر أخبره : أنه طلق امرأة له وهي حائض ، فذكر عمر لرسول الله - صلى الله عليه وسلم - فتغيظ رسول الله - صلى الله عليه وسلم - ثم قال : \" ليراجعها ، ثم يمسكها حتى تطهر ، ثم تحيض فتطهر ، فإن بدا له أن يطلقها فليطلقها طاهرا قبل أن يمسها ، فتلك العدة التي أمر الله ، عز وجل \"\nهكذا رواه البخاري ها هنا وقد رواه في مواضع من كتابه ومسلم ولفظه : \" فتلك العدة التي أمر الله أن يطلق لها النساء \"\nورواه أصحاب الكتب والمسانيد من طرق متعددة وألفاظ كثيرة ، ومواضع استقصائها كتب الأحكام .\nوأمس لفظ يورد ها هنا ما رواه مسلم في صحيحه ، من طريق ابن جريج : أخبرني أبو الزبير : أنه سمع عبد الرحمن بن أيمن - مولى عزة يسأل ابن عمر - وأبو الزبير يسمع ذلك : كيف ترى في رجل طلق امرأته حائضا ؟ فقال : طلق ابن عمر امرأته حائضا على عهد رسول الله - صلى الله عليه وسلم - فسأل عمر رسول الله - صلى الله عليه وسلم - فقال : إن عبد الله بن عمر طلق امرأته وهي حائض ، فقال رسول الله - صلى الله عليه وسلم - : \" ليراجعها \" فردها ، وقال : \" إذا طهرت فليطلق أو يمسك \" . قال ابن عمر : وقرأ النبي - صلى الله عليه وسلم - : ( يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن ) .\nوقال الأعمش ، عن مالك بن الحارث ، عن عبد الرحمن بن يزيد ، عن عبد الله في قوله : ( فطلقوهن لعدتهن ) قال : الطهر من غير جماع وروي عن ابن عمر ، وعطاء ، ومجاهد ، والحسن ، ، وابن سيرين ، وقتادة ، وميمون بن مهران ، ومقاتل بن حيان مثل ذلك ، وهو رواية عن عكرمة ، والضحاك .\nوقال علي بن أبي طلحة ، عن ابن عباس في قوله تعالى : ( فطلقوهن لعدتهن ) قال : لا يطلقها وهي حائض ولا في طهر قد جامعها فيه ، ولكن : تتركها حتى إذا حاضت وطهرت طلقها تطليقة .\nوقال عكرمة : ( فطلقوهن لعدتهن ) العدة : الطهر ، والقرء الحيضة ، أن يطلقها حبلى مستبينا حملها ، ولا يطلقها وقد طاف عليها ، ولا يدري حبلى هي أم لا .\nومن ها هنا أخذ الفقهاء أحكام الطلاق وقسموه إلى طلاق سنة وطلاق بدعة ، فطلاق السنة : أن يطلقها طاهرا من غير جماع ، أو حاملا قد استبان حملها . والبدعي : هو أن يطلقها في حال الحيض ، أو في طهر قد جامعها فيه ، ولا يدري أحملت أم لا ؟ وطلاق ثالث لا سنة فيه ولا بدعة ، وهو طلاق الصغيرة والآيسة ، وغير المدخول بها ، وتحرير الكلام في ذلك وما يتعلق به مستقصى في كتب الفروع ، والله سبحانه وتعالى أعلم .\nوقوله ( وأحصوا العدة ) أي : احفظوها واعرفوا ابتداءها وانتهاءها ; لئلا تطول العدة على المرأة فتمتنع من الأزواج . ( واتقوا الله ربكم ) أي : في ذلك .\nوقوله : ( لا تخرجوهن من بيوتهن ولا يخرجن ) أي : في مدة العدة لها حق السكنى على الزوج ما دامت معتدة منه ، فليس للرجل أن يخرجها ، ولا يجوز لها أيضا الخروج لأنها معتقلة لحق الزوج أيضا .\nوقوله : ( إلا أن يأتين بفاحشة مبينة ) أي : لا يخرجن من بيوتهن إلا أن ترتكب المرأة فاحشة مبينة ، فتخرج من المنزل ، والفاحشة المبينة تشمل الزنا ، كما قاله ابن مسعود ، وابن عباس ، وسعيد بن المسيب ، والشعبي ، والحسن ، وابن سيرين ، ومجاهد ، وعكرمة ، وسعيد بن جبير ، وأبو قلابة ، وأبو صالح ، والضحاك ، وزيد بن أسلم ، وعطاء الخراساني ، والسدي ، وسعيد بن أبي هلال ، وغيرهم ، وتشمل ما إذا نشزت المرأة أو بذت على أهل الرجل وآذتهم في الكلام والفعال ، كما قاله أبي بن كعب ، وابن عباس ، وعكرمة ، وغيرهم .\nوقوله : ( وتلك حدود الله ) أي : شرائعه ومحارمه ( ومن يتعد حدود الله ) أي : يخرج عنها ويتجاوزها إلى غيرها ولا يأتمر بها ( فقد ظلم نفسه ) أي : بفعل ذلك .\nوقوله : ( لا تدري لعل الله يحدث بعد ذلك أمرا ) أي : إنما أبقينا المطلقة في منزل الزوج في مدة العدة ، لعل الزوج يندم على طلاقها ويخلق الله في قلبه رجعتها ، فيكون ذلك أيسر وأسهل .\nقال الزهري ، عن عبيد الله بن عبد الله ، عن فاطمة بنت قيس في قوله : ( لا تدري لعل الله يحدث بعد ذلك أمرا ) قال : هي الرجعة . وكذا قال الشعبي ، وعطاء ، وقتادة ، والضحاك ، ومقاتل بن حيان ، والثوري . ومن ها هنا ذهب من ذهب من السلف ، ومن تابعهم كالإمام أحمد بن حنبل رحمه الله تعالى إلى أنه لا تجب السكنى للمبتوتة ، وكذا المتوفى عنها زوجها ، واعتمدوا أيضا على حديث فاطمة بنت قيس الفهرية حين طلقها زوجها أبو عمرو بن حفص آخر ثلاث تطليقات ، وكان غائبا عنها باليمن فأرسل إليها بذلك ، فأرسل إليها وكيله بشعير - يعني نفقة - فتسخطته فقال : والله ليس لك علينا نفقة . فأتت رسول الله - صلى الله عليه وسلم - فقال : \" ليس لك عليه نفقة \" . ولمسلم : ولا سكنى ، وأمرها أن تعتد في بيت أم شريك ثم قال : \" تلك امرأة يغشاها أصحابي ، اعتدي عند ابن أم مكتوم فإنه رجل أعمى تضعين ثيابك \" الحديث\nوقد رواه الإمام أحمد من طريق أخرى بلفظ آخر ، فقال :\nحدثنا يحيى بن سعيد ، حدثنا مجالد ، حدثنا عامر ، قال : قدمت المدينة فأتيت فاطمة بنت قيس ، فحدثتني أن زوجها طلقها على عهد النبي - صلى الله عليه وسلم - فبعثه رسول الله - صلى الله عليه وسلم - في سرية . قالت : فقال لي أخوه : اخرجي من الدار . فقلت : إن لي نفقة وسكنى حتى يحل الأجل . قال : لا . قالت : فأتيت رسول الله - صلى الله عليه وسلم - فقلت : إن فلانا طلقني ، وإن أخاه أخرجني ومنعني السكنى والنفقة ، فأرسل إليه فقال : \" ما لك ولابنة آل قيس \" ، قال : يا رسول الله ، إن أخي طلقها ثلاثا جميعا . قالت : فقال رسول الله - صلى الله عليه وسلم - : \" انظري يا بنت آل قيس ، إنما النفقة والسكنى للمرأة على زوجها ما كان له عليها رجعة ، فإذا لم يكن له عليها رجعة فلا نفقة ولا سكنى . اخرجي فانزلي على فلانة \" . ثم قال : \" إنه يتحدث إليها ، انزلي على ابن أم مكتوم فإنه أعمى لا يراك \" وذكر تمام الحديث\nوقال أبو القاسم الطبراني : حدثنا أحمد بن عبد الله البزار التستري ، حدثنا إسحاق بن إبراهيم الصواف ، حدثنا بكر بن بكار ، حدثنا سعيد بن يزيد البجلي ، حدثنا عامر الشعبي : أنه دخل على فاطمة بنت قيس أخت الضحاك بن قيس القرشي وزوجها أبو عمرو بن حفص بن المغيرة المخزومي فقالت : إن أبا عمرو بن حفص أرسل إلي وهو منطلق في جيش إلى اليمن بطلاقي ، فسألت أولياءه النفقة علي والسكنى ، فقالوا : ما أرسل إلينا في ذلك شيئا ، ولا أوصانا به . فانطلقت إلى رسول الله - صلى الله عليه وسلم - فقلت : يا رسول الله ، إن أبا عمرو بن حفص أرسل إلي بطلاقي ، فطلبت السكنى والنفقة علي ، فقال : أولياؤه : لم يرسل إلينا في ذلك بشيء . فقال رسول الله - صلى الله عليه وسلم - : \" إنما النفقة والسكنى للمرأة إذا كان لزوجها عليها رجعة ، فإذا كانت لا تحل له حتى تنكح زوجا غيره فلا نفقة لها ولا سكنى \" .\nوكذا رواه النسائي ، عن أحمد بن يحيى الصوفي ، عن أبي نعيم الفضل بن دكين ، عن سعيد بن يزيد ، وهو الأحمسي البجلي الكوفي . قال أبو حاتم الرازي : وهو شيخ ، يروي عنه\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا ١\n                                    \n                                    \n                                    سورة الطلاق\nمدنية في قول الجميع\nوهي إحدى عشرة آية ، أو اثنتا عشرة آية\nبسم الله الرحمن الرحيم\nياأيها النبي إذا طلقتم النساء فطلقوهن لعدتهن وأحصوا العدة واتقوا الله ربكم لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة وتلك حدود الله ومن يتعد حدود الله فقد ظلم نفسه لا تدري لعل الله يحدث بعد ذلك أمرا\nفيه أربع عشرة مسألة :\nالأولى : قوله تعالى : يا أيها النبي إذا طلقتم النساء الخطاب للنبي صلى الله عليه وسلم ، خوطب بلفظ الجماعة تعظيما وتفخيما . وفي سنن ابن ماجه عن سعيد بن جبير عن ابن عباس عن عمر بن الخطاب أن رسول الله صلى الله عليه وسلم طلق حفصة رضي الله عنها ثم راجعها . وروى قتادة عن أنس قال : طلق رسول الله صلى الله عليه وسلم حفصة رضي الله عنها فأتت أهلها ، فأنزل الله تعالى عليه : يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن . وقيل له : \" راجعها فإنها قوامة صوامة ، وهي من أزواجك في الجنة \" . ذكره الماوردي والقشيري والثعلبي . زاد القشيري : ونزل في خروجها إلى أهلها قوله تعالى : لا تخرجوهن من بيوتهن . وقال الكلبي : سبب نزول هذه الآية غضب رسول الله صلى الله عليه وسلم على حفصة ، لما أسر إليها حديثا فأظهرته لعائشة فطلقها تطليقة ، فنزلت الآية . وقال السدي : نزلت في عبد الله بن عمر ، طلق امرأته حائضا تطليقة واحدة فأمره رسول الله صلى الله عليه وسلم بأن يراجعها ثم يمسكها حتى تطهر وتحيض ثم تطهر ، فإذا أراد أن يطلقها فليطلقها حين تطهر من قبل أن يجامعها . فتلك العدة التي أمر الله تعالى أن يطلق لها النساء . وقد قيل : إن رجالا فعلوا مثل ما فعل عبد الله بن عمر ، منهم عبد الله بن عمرو بن العاص ، وعمرو بن سعيد بن العاص ، وعتبة بن غزوان ، فنزلت الآية فيهم . قال ابن العربي : وهذا كله وإن لم يكن صحيحا فالقول الأول أمثل . والأصح فيه أنه بيان لشرع مبتدأ . وقد قيل : إنه خطاب للنبي صلى الله عليه وسلم والمراد أمته . وغاير بين اللفظين من حاضر وغائب وذلك لغة فصيحة ، كما قال : حتى إذا كنتم في الفلك وجرين بهم بريح طيبة . تقديره : يا أيها النبي قل لهم إذا طلقتم النساء فطلقوهن لعدتهن . وهذا هو قولهم : إن الخطاب له وحده والمعنى له وللمؤمنين . وإذا أراد الله بالخطاب المؤمنين لاطفه بقوله : \" يا أيها النبي \" . فإذا كان الخطاب باللفظ والمعنى جميعا له قال : يا أيها الرسول .\nقلت : ويدل على صحة هذا القول نزول العدة في أسماء بنت يزيد بن السكن الأنصارية . ففي كتاب أبي داود عنها أنها طلقت على عهد النبي صلى الله عليه وسلم ، ولم يكن للمطلقة عدة ، فأنزل الله تعالى حين طلقت أسماء بالعدة للطلاق ، فكانت أول من أنزل فيها العدة للطلاق . وقيل : المراد به نداء النبي صلى الله عليه وسلم تعظيما ، ثم ابتدأ فقال : إذا طلقتم النساء ; كقوله تعالى : يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام الآية . فذكر المؤمنين على معنى تقديمهم وتكريمهم ; ثم افتتح فقال : إنما الخمر والميسر والأنصاب والأزلام الآية .\nالثانية : روى الثعلبي من حديث ابن عمر قال : قال رسول الله صلى الله عليه وسلم : \" إن من أبغض الحلال إلى الله تعالى الطلاق \" . وعن علي عن النبي صلى الله عليه وسلم قال : \" تزوجوا ولا تطلقوا ؛ فإن الطلاق يهتز منه العرش \" . وعن أبي موسى قال : قال رسول الله صلى الله عليه وسلم : \" لا تطلقوا النساء إلا من ريبة ؛ فإن الله عز وجل لا يحب الذواقين ولا الذواقات \" . وعن أنس قال : قال رسول الله صلى الله عليه وسلم : \" ما حلف بالطلاق ولا استحلف به إلا منافق \" . أسند جميعه الثعلبي رحمه الله في كتابه . وروى الدارقطني قال : حدثنا أبو العباس محمد بن موسى بن علي الدولابي ويعقوب بن إبراهيم قالا : حدثنا الحسن بن عرفة قال : حدثنا إسماعيل بن عياش عن حميد بن مالك اللخمي عن مكحول عن معاذ بن جبل قال : قال لي رسول الله صلى الله عليه وسلم : \" يا معاذ ، ما خلق الله شيئا على وجه الأرض أحب إليه من العتاق ، ولا خلق الله شيئا على وجه الأرض أبغض من الطلاق . فإذا قال الرجل لمملوكه : أنت حر إن شاء الله ، فهو حر ولا استثناء له . وإذا قال الرجل لامرأته : أنت طالق إن شاء الله فله استثناؤه ولا طلاق عليه \" . حدثنا محمد بن موسى بن علي قال : حدثنا حميد بن الربيع قال : حدثنا يزيد بن هارون حدثنا إسماعيل بن عياش بإسناده نحوه . قال حميد : قال لي يزيد بن هارون : وأي حديث لو كان حميد بن مالك معروفا ؟ قلت : هو جدي . قال يزيد : سررتني سررتني ! الآن صار حديثا . حدثنا عثمان بن أحمد الدقاق قال : حدثنا إسحاق بن إبراهيم بن سنين حدثنا عمر بن إبراهيم بن خالد حدثنا حميد بن مالك اللخمي حدثنا مكحول عن مالك بن يخامر عن معاذ بن جبل قال : قال رسول الله صلى الله عليه وسلم : \" ما أحل الله شيئا أبغض إليه من الطلاق ، فمن طلق واستثنى فله ثنياه \" . قال ابن المنذر : اختلفوا في الاستثناء في الطلاق والعتق ; فقالت طائفة : ذلك جائز . وروينا هذا القول عن طاوس . وبه قال حماد الكوفي والشافعي وأبو ثور وأصحاب الرأي . ولا يجوز الاستثناء في الطلاق في قول مالك والأوزاعي . وهذا قول قتادة في الطلاق خاصة . قال ابن المنذر : وبالقول الأول أقول .\nالثالثة : روى الدارقطني من حديث عبد الرزاق أخبرني عمي وهب بن نافع قال : سمعت عكرمة يحدث عن ابن عباس يقول : الطلاق على أربعة وجوه : وجهان حلالان ووجهان حرامان ; فأما الحلال فأن يطلقها طاهرا عن غير جماع وأن يطلقها حاملا مستبينا حملها . وأما الحرام فأن يطلقها وهي حائض ، أو يطلقها حين يجامعها ، لا تدري اشتمل الرحم على ولد أم لا .\nالرابعة : قوله تعالى : فطلقوهن لعدتهن في كتاب أبي داود عن أسماء بنت يزيد بن السكن الأنصارية أنها طلقت على عهد النبي صلى الله عليه وسلم ولم يكن للمطلقة عدة ، فأنزل الله سبحانه حين طلقت أسماء بالعدة للطلاق ; فكانت أول من أنزل فيها العدة للطلاق . وقد تقدم .\nالخامسة : قوله تعالى : \" لعدتهن \" يقتضي أنهن اللاتي دخل بهن من الأزواج ; لأن غير المدخول بهن خرجن بقوله تعالى : يا أيها الذين آمنوا إذا نكحتم المؤمنات ثم طلقتموهن من قبل أن تمسوهن فما لكم عليهن من عدة تعتدونها .\nالسادسة : من طلق في طهر لم يجامع فيه نفذ طلاقه وأصاب السنة . وإن طلقها حائضا نفذ طلاقه وأخطأ السنة . وقال سعيد بن المسيب في أخرى : لا يقع الطلاق في الحيض لأنه خلاف السنة . وإليه ذهبت الشيعة . وفي الصحيحين - واللفظ للدارقطني - عن عبد الله بن عمر قال : طلقت امرأتي وهي حائض ; فذكر ذلك عمر لرسول الله صلى الله عليه وسلم ; فتغيظ رسول الله صلى الله عليه وسلم فقال : \" ليراجعها ثم ليمسكها حتى تحيض حيضة مستقبلة سوى حيضتها التي طلقها فيها ، فإن بدا له أن يطلقها فليطلقها طاهرا من حيضتها قبل أن يمسها ، فذلك الطلاق للعدة كما أمر الله \" . وكان عبد الله بن عمر طلقها تطليقة ، فحسبت من طلاقها وراجعها عبد الله بن عمر كما أمره رسول الله صلى الله عليه وسلم . في رواية عن ابن عمر أن رسول الله صلى الله عليه وسلم قال : هي واحدة . وهذا نص . وهو يرد على الشيعة قولهم .\nالسابعة : عن عبد الله بن مسعود قال : طلاق السنة أن يطلقها في كل طهر تطليقة ; فإذا كان آخر ذلك فتلك العدة التي أمر الله تعالى بها . رواه الدارقطني عن الأعمش عن أبي إسحاق عن أبي الأحوص عن عبد الله . قال علماؤنا : طلاق السنة ما جمع شروطا سبعة : وهو أن يطلقها واحدة ، وهي ممن تحيض ، طاهرا ، لم يمسها في ذلك الطهر ، ولا تقدمه طلاق في حيض ، ولا تبعه طلاق في طهر يتلوه ، وخلا عن العوض . وهذه الشروط السبعة من حديث ابن عمر المتقدم . وقال الشافعي : طلاق السنة أن يطلقها في كل طهر خاصة ، ولو طلقها ثلاثا في طهر لم يكن بدعة . وقال أبو حنيفة : طلاق السنة أن يطلقها في كل طهر طلقة . وقال الشعبي : يجوز أن يطلقها في طهر جامعها فيه . فعلماؤنا قالوا : يطلقها واحدة في طهر لم يمس فيه ، ولا تبعه طلاق في عدة ، ولا يكون الطهر تاليا لحيض وقع فيه الطلاق ; لقول النبي صلى الله عليه وسلم : \" مره فليراجعها ثم ليمسكها حتى تطهر ثم تحيض ثم تطهر ، ثم إن شاء أمسك وإن شاء طلق . فتلك العدة التي أمر الله أن يطلق لها النساء \" . وتعلق الإمام الشافعي بظاهر قوله تعالى : فطلقوهن لعدتهن وهذا عام في كل طلاق كان واحدة أو اثنتين أو أكثر . وإنما راعى الله سبحانه الزمان في هذه الآية ولم يعتبر العدد . وكذلك حديث ابن عمر لأن النبي صلى الله عليه وسلم علمه الوقت لا العدد . قال ابن العربي : وهذه غفلة عن الحديث الصحيح ; فإنه قال : \" مره فليراجعها \" وهذا يدفع الثلاث . وفي الحديث أنه قال : \" أرأيت لو طلقها ثلاثا ؟ قال : حرمت عليك وبانت منك بمعصية \" . وقال أبو حنيفة : ظاهر الآية يدل على أن الطلاق الثلاث والواحدة سواء . وهو مذهب الشافعي لولا قوله بعد ذلك : لا تدري لعل الله يحدث بعد ذلك أمرا . وهذا يبطل دخول الثلاث تحت الآية . وكذلك قال أكثر العلماء ; وهو بديع لهم . وأما مالك فلم يخف عليه إطلاق الآية كما قالوا ، ولكن الحديث فسرها كما قلنا . وأما قول الشعبي : إنه يجوز طلاق في طهر جامعها فيه ، فيرده حديث ابن عمر بنصه ومعناه . أما نصه فقد قدمناه ، وأما معناه فلأنه إذا منع من طلاق الحائض لعدم الاعتداد به ، فالطهر المجامع فيه أولى بالمنع ; لأنه يسقط الاعتداد به مخافة شغل الرحم وبالحيض التالي له .\nقلت : وقد احتج الشافعي في طلاق الثلاث بكلمة واحدة بما رواه الدارقطني عن سلمة بن أبي سلمة بن عبد الرحمن عن أبيه أن عبد الرحمن بن عوف طلق امرأته تماضر بنت الأصبغ الكلبية وهي أم أبي سلمة ثلاث تطليقات في كلمة واحدة ; فلم يبلغنا أن أحدا من أصحابه عاب ذلك . قال : وحدثنا سلمة بن أبي سلمة عن أبيه أن حفص بن المغيرة طلق امرأته فاطمة بنت قيس على عهد رسول الله صلى الله عليه وسلم ثلاث تطليقات في كلمة ; فأبانها منه رسول الله صلى الله عليه وسلم ، ولم يبلغنا أن النبي صلى الله عليه وسلم عاب ذلك عليه . واحتج أيضا بحديث عويمر العجلاني لما لاعن قال : يا رسول الله ، هي طالق ثلاث . فلم ينكر عليه النبي صلى الله عليه وسلم . وقد انفصل علماؤنا عن هذا أحسن انفصال . بيانه في غير هذا الموضع . وقد ذكرناه في كتاب ( المقتبس من شرح موطأ مالك بن أنس ) . وعن سعيد بن المسيب وجماعة من التابعين أن من خالف السنة في الطلاق فأوقعه في حيض أو ثلاث لم يقع ; فشبهوه بمن وكل بطلاق السنة فخالف .\nالثامنة : قال الجرجاني : اللام في قوله تعالى : \" لعدتهن \" بمعنى في ; كقوله تعالى : هو الذي أخرج الذين كفروا من أهل الكتاب من ديارهم لأول الحشر . أي في أول الحشر . فقوله : لعدتهن أي في عدتهن ; أي في الزمان الذي يصلح لعدتهن . وحصل الإجماع على أن الطلاق في الحيض ممنوع وفي الطهر مأذون فيه . ففيه دليل على أن القرء هو الطهر . وقد مضى القول فيه في \" البقرة \" فإن قيل : معنى فطلقوهن لعدتهن أي في قبل عدتهن ، أو لقبل عدتهن . وهي قراءة النبي صلى الله عليه وسلم ; كما قال ابن عمر في صحيح مسلم وغيره . فقبل العدة آخر الطهر حتى يكون القرء الحيض ، قيل له : هذا هو الدليل الواضح لمالك ومن قال بقوله ; على أن الأقراء هي الأطهار . ولو كان كما قال الحنفي ومن تبعه لوجب أن يقال : إن من طلق في أول الطهر لا يكون مطلقا لقبل الحيض ; لأن الحيض لم يقبل بعد . وأيضا إقبال الحيض يكون بدخول الحيض ، وبانقضاء الطهر لا يتحقق إقبال الحيض . ولو كان إقبال الشيء إدبار ضده لكان الصائم مفطرا قبل مغيب الشمس ; إذ الليل يكون مقبلا في إدبار النهار قبل انقضاء النهار . ثم إذا طلق في آخر الطهر فبقية الطهر قرء ، ولأن بعض القرء يسمى قرءا لقوله تعالى : الحج أشهر معلومات يعني شوالا وذا القعدة وبعض ذي الحجة ; لقوله تعالى : فمن تعجل في يومين فلا إثم عليه وهو ينفر في بعض اليوم الثاني . وقد مضى هذا كله في \" البقرة \" مستوفى .\nالتاسعة : قوله تعالى : \" وأحصوا العدة \" يعني في المدخول بها ; لأن غير المدخول بها لا عدة عليها ، وله أن يراجعها فيما دون الثلاث قبل انقضاء العدة ، ويكون بعدها كأحد الخطاب . ولا تحل له في الثلاث إلا بعد زوج .\nالعاشرة : قوله تعالى : وأحصوا العدة معناه احفظوها ; أي احفظوا الوقت الذي وقع فيه الطلاق ، حتى إذا انفصل المشروط منه وهو الثلاثة قروء في قوله تعالى : والمطلقات يتربصن بأنفسهن ثلاثة قروء حلت للأزواج . وهذا يدل على أن العدة هي الأطهار وليست بالحيض . ويؤكده ويفسره قراءة النبي صلى الله عليه وسلم \" لقبل عدتهن \" وقبل الشيء بعضه لغة وحقيقة ، بخلاف استقباله فإنه يكون غيره .\nالحادية عشرة : من المخاطب بأمر الإحصاء ؟ وفيه ثلاث أقوال : أحدها : أنهم الأزواج . الثاني : أنهم الزوجات . الثالث : أنهم المسلمون . ابن العربي : والصحيح أن المخاطب بهذا اللفظ الأزواج ; لأن الضمائر كلها من \" طلقتم \" و \" أحصوا \" و \" لا تخرجوهن \" على نظام واحد يرجع إلى الأزواج ، ولكن الزوجات داخلة فيه بالإلحاق بالزوج ; لأن الزوج يحصي ليراجع ، وينفق أو يقطع ، وليسكن أو يخرج وليلحق نسبه أو يقطع . وهذه كلها أمور مشتركة بينه وبين المرأة ، وتنفرد المرأة دونه بغير ذلك . وكذلك الحاكم يفتقر إلى الإحصاء للعدة للفتوى عليها ، وفصل الخصومة عند المنازعة فيها . وهذه فوائد الإحصاء المأمور به .\nالثانية عشرة : قوله تعالى : واتقوا الله ربكم أي لا تعصوه .\nلا تخرجوهن من بيوتهن أي ليس للزوج أن يخرجها من مسكن النكاح ما دامت في العدة ، ولا يجوز لها الخروج أيضا لحق الزوج إلا لضرورة ظاهرة ، فإن خرجت أثمت ولا تنقطع العدة . والرجعية والمبتوتة في هذا سواء . وهذا لصيانة ماء الرجل . وهذا معنى إضافة البيوت إليهن ; كقوله تعالى : واذكرن ما يتلى في بيوتكن من آيات الله والحكمة ، وقوله تعالى : وقرن في بيوتكن فهو إضافة إسكان وليس إضافة تمليك . وقوله : لا تخرجوهن يقتضي أن يكون حقا في الأزواج . ويقتضي قوله : \" ولا يخرجن \" أنه حق على الزوجات . وفي صحيح الحديث عن جابر بن عبد الله قال : طلقت خالتي فأرادت أن تجد نخلها فزجرها رجل أن تخرج ; فأتت النبي صلى الله عليه وسلم فقال : \" بلى فجدي نخلك ، فإنك عسى أن تصدقي أو تفعلي معروفا \" . خرجه مسلم . ففي هذا الحديث دليل لمالك والشافعي وابن حنبل والليث على قولهم : إن المعتدة تخرج بالنهار في حوائجها ، وإنما تلزم منزلها بالليل . وسواء عند مالك كانت رجعية أو بائنة . وقال الشافعي في الرجعية : لا تخرج ليلا ولا نهارا ، وإنما تخرج نهارا المبتوتة . وقال أبو حنيفة : ذلك في المتوفى عنها زوجها ، وأما المطلقة فلا تخرج لا ليلا ولا نهارا . والحديث يرد عليه . وفي الصحيحين أن أبا حفص بن عمرو خرج مع علي بن أبي طالب إلى اليمن ، فأرسل إلى امرأته فاطمة بنت قيس بتطليقة كانت بقيت من طلاقها ، وأمر لها الحارث بن هشام وعياش بن أبي ربيعة بنفقة ; فقالا لها : والله ما لك من نفقة إلا أن تكوني حاملا . فأتت النبي صلى الله عليه وسلم فذكر له قولهما . فقال : \" لا نفقة لك \" فاستأذنته في الانتقال فأذن لها ; فقالت : أين يا رسول الله ؟ فقال : \" إلى ابن أم مكتوم \" ، وكان أعمى تضع ثيابها عنده ولا يراها . فلما مضت عدتها أنكحها النبي صلى الله عليه وسلم أسامة بن زيد . فأرسل إليها مروان قبيصة بن ذؤيب يسألها عن الحديث ، فحدثته . فقال مروان : لم نسمع هذا الحديث إلا من امرأة ، سنأخذ بالعصمة التي وجدنا الناس عليها . فقالت فاطمة حين بلغها قول مروان : فبيني وبينكم القرآن ، قال الله عز وجل : لا تخرجوهن من بيوتهن الآية ، قالت : هذا لمن كانت له رجعة ; فأي أمر يحدث بعد الثلاث ؟ فكيف تقولون : لا نفقة لها إذا لم تكن حاملا ، فعلام تحبسونها ؟ لفظ مسلم . فبين أن الآية في تحريم الإخراج والخروج إنما هو في الرجعية . وكذلك استدلت فاطمة بأن الآية التي تليها إنما تضمنت النهي عن خروج المطلقة الرجعية ; لأنها بصدد أن يحدث لمطلقها رأي في ارتجاعها ما دامت في عدتها ; فكأنها تحت تصرف الزوج في كل وقت . وأما البائن فليس له شيء من ذلك ; فيجوز لها أن تخرج إذا دعتها إلى ذلك حاجة ، أو خافت عورة منزلها ; كما أباح لها النبي صلى الله عليه وسلم ذلك . وفي مسلم : قالت فاطمة : يا رسول الله ، زوجي طلقني ثلاثا وأخاف أن يقتحم علي . قال : فأمرها فتحولت . وفي البخاري عن عائشة أنها كانت في مكان وحش فخيف على ناحيتها ; فلذلك أرخص النبي صلى الله عليه وسلم لها . وهذا كله يرد على الكوفي قوله . وفي حديث فاطمة : أن زوجها أرسل إليها بتطليقة كانت بقيت من طلاقها ; فهو حجة لمالك وحجة على الشافعي . وهو أصح من حديث سلمة بن أبي سلمة عن أبيه أن حفص بن المغيرة طلق امرأته ثلاث تطليقات في كلمة ; على ما تقدم .\nالثالثة عشرة : قوله تعالى : إلا أن يأتين بفاحشة مبينة قال ابن عباس وابن عمر والحسن والشعبي ومجاهد : هو الزنى ; فتخرج ويقام عليها الحد . وعن ابن عباس أيضا والشافعي : أنه البذاء على أحمائها ; فيحل لهم إخراجها . وروي عن سعيد بن المسيب أنه قال في فاطمة : تلك امرأة استطالت على أحمائها بلسانها فأمرها عليه السلام أن تنتقل . وفي كتاب أبي داود قال سعيد : تلك امرأة فتنت الناس ، إنها كانت لسنة فوضعت على يدي ابن أم مكتوم الأعمى . قال عكرمة : في مصحف أبي \" إلا أن يفحشن عليكم \" . ويقوي هذا أن محمد بن إبراهيم بن الحارث روى أن عائشة قالت لفاطمة بنت قيس : اتقي الله فإنك تعلمين لم أخرجت ؟ وعن ابن عباس أيضا : الفاحشة كل معصية كالزنى والسرقة والبذاء على الأهل . وهو اختيار الطبري . وعن ابن عمر أيضا والسدي : الفاحشة خروجها من بيتها في العدة . وتقدير الآية : إلا أن يأتين بفاحشة مبينة بخروجهن من بيوتهن بغير حق ; أي لو خرجت كانت عاصية . وقال قتادة : الفاحشة النشوز ، وذلك أن يطلقها على النشوز فتتحول عن بيته . قال ابن العربي : أما من قال : إنه الخروج للزنى ; فلا وجه له ; لأن ذلك الخروج هو خروج القتل والإعدام : وليس ذلك بمستثنى في حلال ولا حرام . وأما من قال : إنه البذاء ; فهو مفسر في حديث فاطمة بنت قيس . وأما من قال : إنه كل معصية ; فوهم لأن الغيبة ونحوها من المعاصي لا تبيح الإخراج ولا الخروج . وأما من قال : إنه الخروج بغير حق ; فهو صحيح . وتقدير الكلام : لا تخرجوهن من بيوتهن ولا يخرجن شرعا إلا أن يخرجن تعديا .\nالرابعة عشرة : قوله تعالى : وتلك حدود الله أي هذه الأحكام التي بينها أحكام الله على العباد ، وقد منع التجاوز عنها ، فمن تجاوز فقد ظلم نفسه وأوردها مورد الهلاك .\nلا تدري لعل الله يحدث بعد ذلك أمرا الأمر الذي يحدثه الله أن يقلب قلبه من بغضها إلى محبتها ، ومن الرغبة عنها إلى الرغبة فيها ، ومن عزيمة الطلاق إلى الندم عليه ; فيراجعها . وقال جميع المفسرين : أراد بالأمر هنا الرغبة في الرجعة . ومعنى القول : التحريض على طلاق الواحدة والنهي عن الثلاث ; فإنه إذا طلق أضر بنفسه عند الندم على الفراق والرغبة في الارتجاع ، فلا يجد عند الرجعة سبيلا . وقال مقاتل : بعد ذلك أي بعد طلقة أو طلقتين أمرا أي المراجعة من غير خلاف .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا ١\n                                        \n                                        \n                                        \n                                        يقول تعالى مخاطبًا لنبيه صلى الله عليه وسلم وللمؤمنين:\n{ يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ } أي: أردتم طلاقهن { فـ } التمسوا لطلاقهن الأمر المشروع، ولا تبادروا بالطلاق من حين يوجد سببه، من غير مراعاة لأمر الله.\nبل { طَلِّقُوهُنَّ لِعِدَّتِهِنَّ } أي: لأجل عدتهن، بأن يطلقها زوجها وهي طاهر، في طهر لم يجامعها فيه، فهذا الطلاق هو الذي تكون العدة فيه واضحة بينة، بخلاف ما لو طلقها وهي حائض، فإنها لا تحتسب تلك الحيضة، التي وقع فيها الطلاق، وتطول عليها العدة بسبب ذلك، وكذلك لو طلقها في طهر وطئ فيه، فإنه لا يؤمن حملها، فلا يتبين و [لا] يتضح بأي عدة تعتد، وأمر تعالى بإحصاء العدة، أي: ضبطها بالحيض إن كانت تحيض، أو بالأشهر إن لم تكن تحيض، وليست حاملاً، فإن في إحصائها أداء لحق الله، وحق الزوج المطلق، وحق من سيتزوجها بعد، [وحقها في النفقة ونحوها] فإذا ضبطت عدتها، علمت حالها على بصيرة، وعلم ما يترتب عليها من الحقوق، وما لها منها، وهذا الأمر بإحصاء العدة، يتوجه [للزوج] وللمرأة، إن كانت مكلفة، وإلا فلوليها، وقوله: { وَاتَّقُوا اللَّهَ رَبَّكُمْ } أي: في جميع أموركم، وخافوه في حق الزوجات المطلقات، فـ { لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ } مدة العدة، بل يلزمن بيوتهن الذي طلقها زوجها وهي فيها.\n{ وَلَا يَخْرُجْنَ } أي: لا يجوز لهن الخروج منها، أما النهي عن إخراجها، فلأن المسكن، يجب على الزوج للزوجة ، لتكمل فيه عدتها التي هي حق من حقوقه.\nوأما النهي عن خروجها، فلما في خروجها، من إضاعة حق الزوج وعدم صونه.\nويستمر هذا النهي عن الخروج من البيوت، والإخراج إلى تمام العدة.\n{ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ } أي: بأمر قبيح واضح، موجب لإخراجها، بحيث يدخل على أهل البيت الضرر من عدم إخراجها، كالأذى بالأقوال والأفعال الفاحشة، ففي هذه الحال يجوز لهم إخراجها، لأنها هي التي تسببت لإخراج نفسها، والإسكان فيه جبر لخاطرها، ورفق بها، فهي التي أدخلت الضرر على نفسها ، وهذا في المعتدة الرجعية، وأما البائن، فليس لها سكنى واجبة، لأن السكن تبع للنفقة، والنفقة تجب للرجعية دون البائن، { وَتِلْكَ حُدُودُ اللَّهِ } [أي:] التي حددها لعباده وشرعها لهم، وأمرهم بلزومها، والوقوف معها، { وَمَنْ يَتَعَدَّ حُدُودَ اللَّهِ } بأن لم يقف معها، بل تجاوزها، أو قصر عنها، { فَقَدْ ظَلَمَ نَفْسَهُ } أي: بخسها حظها، وأضاع نصيبه من اتباع حدود الله التي هي الصلاح في الدنيا والآخرة. { لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْرًا } أي: شرع الله العدة، وحدد الطلاق بها، لحكم عظيمة: فمنها: أنه لعل الله يحدث في قلب المطلق الرحمة والمودة، فيراجع من طلقها، ويستأنف عشرتها، فيتمكن من ذلك مدة العدة، أولعله يطلقها لسبب منها، فيزول ذلك السبب في مدة العدة، فيراجعها لانتفاء سبب الطلاق.\nومن الحكم: أنها مدة التربص، يعلم براءة رحمها من زوجها.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا ١"
    },
    {
      "number": 5219,
      "text": "فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُوا ذَوَيْ عَدْلٍ مِنْكُمْ وَأَقِيمُوا الشَّهَادَةَ لِلَّهِ ۚ ذَٰلِكُمْ يُوعَظُ بِهِ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا",
      "surah": {
        "number": 65,
        "name": "سورة الطلاق",
        "englishName": "At-Talaaq",
        "englishNameTranslation": "Divorce",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 2,
      "juz": 28,
      "manzil": 7,
      "page": 558,
      "ruku": 492,
      "hizbQuarter": 223,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَأَمۡسِكُوهُنَّ بِمَعۡرُوفٍ أَوۡ فَارِقُوهُنَّ بِمَعۡرُوفٖ وَأَشۡهِدُواْ ذَوَيۡ عَدۡلٖ مِّنكُمۡ وَأَقِيمُواْ ٱلشَّهَٰدَةَ لِلَّهِۚ ذَٰلِكُمۡ يُوعَظُ بِهِۦ مَن كَانَ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مَخۡرَجٗا ٢\n                                    \n                                    \n                                    يقول تعالى : فإذا بلغت المعتدات أجلهن ، أي : شارفن على انقضاء العدة وقاربن ذلك ، ولكن لم تفرغ العدة بالكلية ، فحينئذ إما أن يعزم الزوج على إمساكها ، وهو رجعتها إلى عصمة نكاحه والاستمرار بها على ما كانت عليه عنده . ( بمعروف ) أي : محسنا إليها في صحبتها ، وإما أن يعزم على مفارقتها ( بمعروف ) أي : من غير مقابحة ، ولا مشاتمة ، ولا تعنيف ، بل يطلقها على وجه جميل وسبيل حسن .\nوقوله : ( وأشهدوا ذوي عدل منكم ) أي : على الرجعة إذا عزمتم عليها ، كما رواه أبو داود ، وابن ماجه ، عن عمران بن حصين : أنه سئل عن الرجل يطلق امرأته ، ثم يقع بها ولم يشهد على طلاقها ، ولا على رجعتها ، فقال : طلقت لغير سنة ، ورجعت لغير سنة ، أشهد على طلاقها وعلى رجعتها ، ولا تعد\nوقال ابن جريج : كان عطاء يقول : ( وأشهدوا ذوي عدل منكم ) قال : لا يجوز في نكاح ، ولا طلاق ، ولا رجاع إلا شاهدا عدل ، كما قال الله ، عز وجل ، إلا أن يكون من عذر .\nوقوله : ( ذلكم يوعظ به من كان يؤمن بالله واليوم الآخر ) أي : هذا الذي أمرناكم به من الإشهاد وإقامة الشهادة ، إنما يأتمر به من يؤمن بالله وأنه شرع هذا ، ومن يخاف عقاب الله في الدار الآخرة .\nومن ها هنا ذهب الشافعي - في أحد قوليه - إلى وجوب الإشهاد في الرجعة ، كما يجب عنده في ابتداء النكاح . وقد قال بهذا طائفة من العلماء ، ومن قال بهذا يقول : إن الرجعة لا تصح إلا بالقول ليقع الإشهاد عليها .\nوقوله : ( ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب ) أي : ومن يتق الله فيما أمره به ، وترك ما نهاه عنه يجعل له من أمره مخرجا ، ويرزقه من حيث لا يحتسب ، أي : من جهة لا تخطر بباله .\nقال الإمام أحمد : حدثنا يزيد ، أخبرنا كهمس بن الحسن ، حدثنا أبو السليل ، عن أبي ذر قال : جعل رسول الله - صلى الله عليه وسلم - يتلو علي هذه الآية : ( ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب ) حتى فرغ من الآية ، ثم قال : \" يا أبا ذر لو أن الناس كلهم أخذوا بها كفتهم \" . وقال : فجعل يتلوها ويرددها علي حتى نعست ، ثم قال : \" يا أبا ذر ، كيف تصنع إن أخرجت من المدينة ؟ . \" قلت : إلى السعة والدعة أنطلق ، فأكون حمامة من حمام مكة . قال : \" كيف تصنع إن أخرجت من مكة ؟ \" . قال : قلت : إلى السعة والدعة ، وإلى الشام ، والأرض المقدسة . قال : \" وكيف تصنع إن أخرجت من الشام ؟ \" . قلت : إذا - والذي بعثك بالحق - أضع سيفي على عاتقي . قال : \" أوخير من ذلك ؟ \" . قلت : أوخير من ذلك ؟ قال : \" تسمع وتطيع ، وإن كان عبدا حبشيا \"\nوقال ابن أبي حاتم : حدثنا أحمد بن منصور الرمادي ، حدثنا يعلى بن عبيد ، حدثنا زكريا ، عن عامر ، عن شتير بن شكل قال : سمعت عبد الله بن مسعود يقول : إن أجمع آية في القرآن : ( إن الله يأمر بالعدل والإحسان ) [ النحل : 90 ] وإن أكثر آية في القرآن فرجا : ( ومن يتق الله يجعل له مخرجا )\nوفي المسند : حدثني مهدي بن جعفر ، حدثنا الوليد بن مسلم ، عن الحكم بن مصعب ، عن محمد بن علي بن عبد الله بن عباس ، عن أبيه ، عن جده عبد الله بن عباس قال : قال رسول الله - صلى الله عليه وسلم - : \" من أكثر من الاستغفار جعل الله له من كل هم فرجا ، ومن كل ضيق مخرجا ، ورزقه من حيث لا يحتسب \"\nوقال علي بن أبي طلحة ، عن ابن عباس : ( ومن يتق الله يجعل له مخرجا ) يقول : ينجيه من كل كرب في الدنيا والآخرة ، ( ويرزقه من حيث لا يحتسب )\nوقال الربيع بن خثيم : ( يجعل له مخرجا ) أي : من كل شيء ضاق على الناس .\nوقال عكرمة : من طلق كما أمره الله يجعل له مخرجا . وكذا روي عن ابن عباس ، والضحاك .\nوقال ابن مسعود ، ومسروق : ( ومن يتق الله يجعل له مخرجا ) يعلم أن الله إن شاء منع ، وإن شاء أعطى ( من حيث لا يحتسب ) أي من حيث لا يدري .\nوقال قتادة : ( ومن يتق الله يجعل له مخرجا ) أي : من شبهات الأمور والكرب عند الموت ، ( ويرزقه من حيث لا يحتسب ) ومن حيث لا يرجو أو لا يأمل .\nوقال السدي : ( ومن يتق الله ) يطلق للسنة ، ويراجع للسنة ، وزعم أن رجلا من أصحاب رسول الله - صلى الله عليه وسلم - يقال له : \" عوف بن مالك الأشجعي \" كان له ابن ، وأن المشركين أسروه ، فكان فيهم ، وكان أبوه يأتي رسول الله - صلى الله عليه وسلم - فيشكو إليه مكان ابنه وحاله التي هو بها وحاجته ، فكان رسول الله - صلى الله عليه وسلم - يأمره بالصبر ، ويقول له : \" إن الله سيجعل لك فرجا \" ، فلم يلبث بعد ذلك إلا يسيرا أن انفلت ابنه من أيدي العدو فمر بغنم من أغنام العدو ، فاستاقها فجاء بها إلى أبيه ، وجاء معه بغنى قد أصابه من الغنم ، فنزلت فيه هذه الآية : ( ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب )\nرواه ابن جرير ، وروي أيضا من طريق سالم بن أبي الجعد ، مرسلا نحوه\nوقال الإمام أحمد ، حدثنا ، وكيع ، حدثنا سفيان ، عن عبد الله بن عيسى ، عن عبد الله بن أبي الجعد ، عن ثوبان ، قال : قال رسول الله - صلى الله عليه وسلم - : \" إن العبد ليحرم الرزق بالذنب يصيبه ، ولا يرد القدر إلا الدعاء ، ولا يزيد في العمر إلا البر \" .\nورواه النسائي ، وابن ماجه من حديث سفيان - وهو الثوري - به\nوقال محمد بن إسحاق : جاء مالك الأشجعي إلى رسول الله - صلى الله عليه وسلم - فقال : له أسر ابني عوف . فقال له رسول الله - صلى الله عليه وسلم - : \" أرسل إليه أن رسول الله يأمرك أن تكثر من قول : لا حول ولا قوة إلا بالله \" . وكانوا قد شدوه بالقد فسقط القد عنه ، فخرج ، فإذا هو بناقة لهم فركبها ، وأقبل فإذا بسرح القوم الذين كانوا قد شدوه فصاح بهم ، فاتبع أولها آخرها ، فلم يفجأ أبويه إلا وهو ينادي بالباب ، فقال أبوه : عوف ورب الكعبة . فقالت أمه : واسوأتاه . وعوف كيف يقدم لما هو فيه من القد - فاستبقا الباب والخادم ، فإذا عوف قد ملأ الفناء إبلا فقص على أبيه أمره ، وأمر الإبل ، فقال أبوه : قفا حتى آتي رسول الله - صلى الله عليه وسلم - فأسأله عنها . فأتى رسول الله - صلى الله عليه وسلم - فأخبره بخبر عوف ، وخبر الإبل ، فقال له رسول الله - صلى الله عليه وسلم - : \" اصنع بها ما أحببت ، وما كنت صانعا بمالك \" . ونزل : ( ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب )\nرواه ابن أبي حاتم .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا محمد بن علي بن الحسن بن شقيق ، حدثنا إبراهيم بن الأشعث ، حدثنا الفضيل بن عياض ، عن هشام بن حسان ، عن عمران بن حصين قال : قال رسول الله - صلى الله عليه وسلم - : \" من انقطع إلى الله كفاه الله كل مئونة ، ورزقه من حيث لا يحتسب ، ومن انقطع إلى الدنيا وكله إليها \"\n                                    ",
        "qortoby": "فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَأَمۡسِكُوهُنَّ بِمَعۡرُوفٍ أَوۡ فَارِقُوهُنَّ بِمَعۡرُوفٖ وَأَشۡهِدُواْ ذَوَيۡ عَدۡلٖ مِّنكُمۡ وَأَقِيمُواْ ٱلشَّهَٰدَةَ لِلَّهِۚ ذَٰلِكُمۡ يُوعَظُ بِهِۦ مَن كَانَ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مَخۡرَجٗا ٢\n                                    \n                                    \n                                    قوله تعالى : فإذا بلغن أجلهن أي قاربن انقضاء العدة ; كقوله تعالى : وإذا طلقتم النساء فبلغن أجلهن فأمسكوهن أي قربن من انقضاء الأجل .\nفأمسكوهن بمعروف يعني المراجعة بالمعروف ; أي بالرغبة من غير قصد المضارة في الرجعة تطويلا لعدتها . كما تقدم في \" البقرة \" .\nأو فارقوهن بمعروف أي اتركوهن حتى تنقضي عدتهن فيملكن أنفسهن . وفي قوله تعالى : فإذا بلغن أجلهن ما يوجب أن يكون القول قول المرأة في انقضاء العدة إذا ادعت ذلك ، على ما بيناه في سورة \" البقرة \" عند قوله تعالى : ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن الآية .\nقوله تعالى : وأشهدوا ذوي عدل منكم فيه مسائل :\nالأولى : قوله تعالى : \" وأشهدوا \" أمر بالإشهاد على الطلاق . وقيل : على الرجعة . والظاهر رجوعه إلى الرجعة لا إلى الطلاق . فإن راجع من غير إشهاد ففي صحة الرجعة قولان للفقهاء . وقيل : المعنى وأشهدوا عند الرجعة والفرقة جميعا . وهذا الإشهاد مندوب إليه عند أبي حنيفة ; كقوله تعالى : وأشهدوا إذا تبايعتم . وعند الشافعي واجب في الرجعة ، مندوب إليه في الفرقة . وفائدة الإشهاد ألا يقع بينهما التجاحد ، وألا يتهم في إمساكها ، ولئلا يموت أحدهما فيدعي الباقي ثبوت الزوجية ليرث .\nالثانية : الإشهاد عند أكثر العلماء على الرجعة ندب . وإذا جامع أو قبل أو باشر يريد بذلك الرجعة ، وتكلم بالرجعة يريد به الرجعة فهو مراجع عند مالك ، وإن لم يرد بذلك الرجعة فليس بمراجع . وقال أبو حنيفة وأصحابه : إذا قبل أو باشر أو لامس بشهوة فهو رجعة . وقالوا : والنظر إلى الفرج رجعة . وقال الشافعي وأبو ثور : إذا تكلم بالرجعة فهو رجعة . وقد قيل : وطؤه مراجعة على كل حال ، نواها أو لم ينوها . وروي ذلك عن طائفة من أصحاب مالك . وإليه ذهب الليث . وكان مالك يقول : إذا وطئ ولم ينو الرجعة فهو وطء فاسد ; ولا يعود لوطئها حتى يستبرئها من مائه الفاسد ، وله الرجعة في بقية العدة الأولى ، وليس له رجعة في هذا الاستبراء .\nالثالثة : أوجب الإشهاد في الرجعة أحمد بن حنبل في أحد قوليه ، والشافعي كذلك لظاهر الأمر . وقال مالك وأبو حنيفة وأحمد والشافعي في القول الآخر : إن الرجعة لا تفتقر إلى القبول ، فلم تفتقر إلى الإشهاد كسائر الحقوق ، وخصوصا حل الظهار بالكفارة . قال ابن العربي : وركب أصحاب الشافعي على وجوب الإشهاد في الرجعة أنه لا يصح أن يقول : كنت راجعت أمس وأنا أشهد اليوم على الإقرار بالرجعة ، ومن شرط الرجعة الإشهاد فلا تصح دونه . وهذا فاسد مبني على أن الإشهاد في الرجعة تعبد . ونحن لا نسلم فيها ولا في النكاح بأن نقول : إنه موضع للتوثق ، وذلك موجود في الإقرار كما هو موجود في الإنشاء .\nالرابعة : من ادعى بعد انقضاء العدة أنه راجع امرأته في العدة ، فإن صدقته جاز وإن أنكرت حلفت ، فإن أقام بينة أنه ارتجعها في العدة ولم تعلم بذلك لم يضره جهلها بذلك ، وكانت زوجته ، وإن كانت قد تزوجت ولم يدخل بها ثم أقام الأول البينة على رجعتها فعن مالك في ذلك روايتان : إحداهما : أن الأول أحق بها . والأخرى : أن الثاني أحق بها . فإن كان الثاني قد دخل بها فلا سبيل للأول إليها .\nالخامسة : قوله تعالى : ذوي عدل منكم قال الحسن : من المسلمين . وعن قتادة : من أحراركم . وذلك يوجب اختصاص الشهادة على الرجعة بالذكور دون الإناث ; لأن ذوي مذكر . ولذلك قال علماؤنا : لا مدخل للنساء فيما عدا الأموال . وقد مضى ذلك في سورة \" البقرة \" .\nالسادسة : قوله تعالى : وأقيموا الشهادة لله أي تقربا إلى الله في إقامة الشهادة على وجهها ، إذا مست الحاجة إليها من غير تبديل ولا تغيير . وقد مضى في سورة \" البقرة \" معناه عند قوله تعالى : وأقوم للشهادة .\nقوله تعالى : ذلكم يوعظ به أي يرضى به .\nمن كان يؤمن بالله واليوم الآخر فأما غير المؤمن فلا ينتفع بهذه المواعظ .\nقوله تعالى : ومن يتق الله يجعل له مخرجا عن النبي صلى الله عليه وسلم أنه سئل عمن طلق ثلاثا أو ألفا هل له من مخرج ؟ فتلاها . وقال ابن عباس والشعبي والضحاك : هذا في الطلاق خاصة ; أي من طلق كما أمره الله يكن له مخرج في الرجعة في العدة ، وأن يكون كأحد الخطاب بعد العدة . وعن ابن عباس أيضا يجعل له مخرجا ينجيه من كل كرب في الدنيا والآخرة . وقيل : المخرج هو أن يقنعه الله بما رزقه ; قاله علي بن صالح . وقال الكلبي : ومن يتق الله بالصبر عند المصيبة . يجعل له مخرجا من النار إلى الجنة . وقال الحسن : مخرجا مما نهى الله عنه . وقال أبو العالية : مخرجا من كل شدة . الربيع بن خيثم : يجعل له مخرجا من كل شيء ضاق على الناس . الحسين بن الفضل : ومن يتق الله في أداء الفرائض ، يجعل له مخرجا من العقوبة .\nويرزقه الثواب\n                                    ",
        "saadi": "فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَأَمۡسِكُوهُنَّ بِمَعۡرُوفٍ أَوۡ فَارِقُوهُنَّ بِمَعۡرُوفٖ وَأَشۡهِدُواْ ذَوَيۡ عَدۡلٖ مِّنكُمۡ وَأَقِيمُواْ ٱلشَّهَٰدَةَ لِلَّهِۚ ذَٰلِكُمۡ يُوعَظُ بِهِۦ مَن كَانَ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مَخۡرَجٗا ٢\n                                        \n                                        \n                                        \n                                        { فَإِذَا بَلَغْنَ أَجَلَهُنَّ } أي: إذا قاربن انقضاء العدة، لأنهن لو خرجن من العدة، لم يكن الزوج مخيرًا بين الإمساك والفراق. { فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ } أي: على وجه المعاشرة [الحسنة]، والصحبة الجميلة، لا على وجه الضرار، وإرادة الشر والحبس، فإن إمساكها على هذا الوجه، لا يجوز، { أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ } أي: فراقًا لا محذور فيه، من غير تشاتم ولا تخاصم، ولا قهر لها على أخذ شيء من مالها.\n{ وَأَشْهِدُوا } على طلاقها ورجعتها { ذَوَيْ عَدْلٍ مِنْكُمْ } أي: رجلين مسلمين عدلين، لأن في الإشهاد المذكور، سدًا لباب المخاصمة، وكتمان كل منهما ما يلزمه بيانه.\n{ وَأَقِيمُوا } أيها الشهداء { الشَّهَادَةَ لِلَّهِ } أي: ائتوا بها على وجهها، من غير زيادة ولا نقص، واقصدوا بإقامتها وجه الله وحده ولا تراعوا بها قريبًا لقرابته، ولا صاحبًا لمحبته، { ذَلِكُمْ } الذي ذكرنا لكم من الأحكام والحدود { يُوعَظُ بِهِ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ } فإن من يؤمن بالله، واليوم الآخر، يوجب له ذلك أن يتعظ بمواعظ الله، وأن يقدم لآخرته من الأعمال الصالحة، ما يتمكن منها، بخلاف من ترحل الإيمان عن قلبه، فإنه لا يبالي بما أقدم عليه من الشر، ولا يعظم مواعظ الله لعدم الموجب لذلك، ولما كان الطلاق قد يوقع في الضيق والكرب والغم، أمر تعالى بتقواه، وأن من اتقاه في الطلاق وغيره فإن الله يجعل له فرجًا ومخرجًا.\nفإذا أراد العبد الطلاق، ففعله على الوجه الشرعي، بأن أوقعه طلقة واحدة، في غير حيض ولا طهر قد وطئ فيه فإنه لا يضيق عليه الأمر، بل جعل الله له فرجًا وسعة يتمكن بها من مراجعة النكاح إذا ندم على الطلاق، والآية، وإن كانت في سياق الطلاق والرجعة، فإن العبرة بعموم اللفظ، فكل من اتقى الله تعالى، ولازم مرضاة الله في جميع أحواله، فإن الله يثيبه في الدنيا والآخرة.\nومن جملة ثوابه أن يجعل له فرجًا ومخرجًا من كل شدة ومشقة، وكما أن من اتقى الله جعل له فرجًا ومخرجًا، فمن لم يتق الله، وقع في الشدائد والآصار والأغلال، التي لا يقدر على التخلص منها والخروج من تبعتها، واعتبر ذلك بالطلاق، فإن العبد إذا لم يتق الله فيه، بل أوقعه على الوجه المحرم، كالثلاث ونحوها، فإنه لا بد أن يندم ندامة لا يتمكن من استدراكها والخروج منها.\n                                    "
      },
      "originalText": "فَإِذَا بَلَغۡنَ أَجَلَهُنَّ فَأَمۡسِكُوهُنَّ بِمَعۡرُوفٍ أَوۡ فَارِقُوهُنَّ بِمَعۡرُوفٖ وَأَشۡهِدُواْ ذَوَيۡ عَدۡلٖ مِّنكُمۡ وَأَقِيمُواْ ٱلشَّهَٰدَةَ لِلَّهِۚ ذَٰلِكُمۡ يُوعَظُ بِهِۦ مَن كَانَ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مَخۡرَجٗا ٢"
    },
    {
      "number": 5220,
      "text": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا",
      "surah": {
        "number": 65,
        "name": "سورة الطلاق",
        "englishName": "At-Talaaq",
        "englishNameTranslation": "Divorce",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 3,
      "juz": 28,
      "manzil": 7,
      "page": 558,
      "ruku": 492,
      "hizbQuarter": 223,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۥٓۚ إِنَّ ٱللَّهَ بَٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا ٣\n                                    \n                                    \n                                    وقوله : ( ومن يتوكل على الله فهو حسبه ) قال الإمام أحمد :\nحدثنا يونس ، حدثنا ليث ، حدثنا قيس بن الحجاج ، عن حنش الصنعاني ، عن عبد الله بن عباس : أنه حدثه أنه ركب خلف رسول الله - صلى الله عليه وسلم - يوما ، فقال له رسول الله - صلى الله عليه وسلم - : \" يا غلام ، إني معلمك كلمات : احفظ الله يحفظك ، احفظ الله تجده تجاهك ، وإذا سألت فاسأل الله ، وإذا استعنت فاستعن بالله ، واعلم أن الأمة لو اجتمعوا على أن ينفعوك ، لم ينفعوك إلا بشيء كتبه الله لك ، ولو اجتمعوا على أن يضروك ، لم يضروك إلا بشيء قد كتبه الله عليك ، رفعت الأقلام ، وجفت الصحف \" .\nوقد رواه الترمذي من حديث الليث بن سعد ، وابن لهيعة به ، وقال : حسن صحيح .\nوقال الإمام أحمد : حدثنا وكيع ، حدثنا بشير بن سلمان ، عن سيار أبي الحكم ، عن طارق بن شهاب ، عن عبد الله - هو ابن مسعود - قال : قال رسول الله - صلى الله عليه وسلم - : \" من نزل به حاجة ، فأنزلها بالناس كان قمنا أن لا تسهل حاجته ، ومن أنزلها بالله أتاه الله برزق عاجل ، أو بموت آجل \" .\nثم رواه عن عبد الرزاق ، عن سفيان ، عن بشير ، عن سيار أبي حمزة ، ثم قال : وهو الصواب ، وسيار أبو الحكم لم يحدث عن طارق\nوقوله : ( إن الله بالغ أمره ) أي : منفذ قضاياه ، وأحكامه في خلقه بما يريده ويشاؤه ( قد جعل الله لكل شيء قدرا ) كقوله : ( وكل شيء عنده بمقدار ) [ الرعد : 8 ]\n                                    ",
        "qortoby": "وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۥٓۚ إِنَّ ٱللَّهَ بَٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا ٣\n                                    \n                                    \n                                    من حيث لا يحتسب أي يبارك له فيما آتاه . وقال سهل بن عبد الله : ومن يتق الله في اتباع السنة يجعل له مخرجا من عقوبة أهل البدع ، ويرزقه الجنة من حيث لا يحتسب . وقيل : ومن يتق الله في الرزق بقطع العلائق يجعل له مخرجا بالكفاية . وقال عمر بن عثمان الصدفي : ومن يتق الله فيقف عند حدوده ويجتنب معاصيه يخرجه من الحرام إلى الحلال ، ومن الضيق إلى السعة ، ومن النار إلى الجنة . ويرزقه من حيث لا يحتسب من حيث لا يرجو . وقال ابن عيينة : هو البركة في الرزق . وقال أبو سعيد الخدري : ومن يبرأ من حوله وقوته بالرجوع إلى الله يجعل له مخرجا مما كلفه بالمعونة له . وتأول ابن مسعود ومسروق الآية على العموم . وقال أبو ذر : قال النبي صلى الله عليه وسلم : \" إني لأعلم آية لو أخذ بها الناس لكفتهم \" ثم تلا ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب . فما زال يكررها ويعيدها . وقال ابن عباس : قرأ النبي صلى الله عليه وسلم ومن يتق الله يجعل له مخرجا . ويرزقه من حيث لا يحتسب قال : \" مخرجا من شبهات الدنيا ومن غمرات الموت ومن شدائد يوم القيامة \" . وقال أكثر المفسرين فيما ذكر الثعلبي : إنها نزلت في عوف بن مالك الأشجعي . روى الكلبي عن أبي صالح عن ابن عباس قال : جاء عوف بن مالك الأشجعي إلى النبي صلى الله عليه وسلم فقال : يا رسول الله ، إن ابني أسره العدو وجزعت الأم . وعن جابر بن عبد الله : نزلت في عوف بن مالك الأشجعي أسر المشركون ابنا له يسمى سالما ، فأتى رسول الله صلى الله عليه وسلم وشكا إليه الفاقة وقال : إن العدو أسر ابني وجزعت الأم ، فما تأمرني ؟ فقال عليه السلام : \" اتق الله واصبر ، وآمرك وإياها أن تستكثرا من قول لا حول ولا قوة إلا بالله \" . فعاد إلى بيته وقال لامرأته : إن رسول الله صلى الله عليه وسلم أمرني وإياك أن نستكثر من قول لا حول ولا قوة إلا بالله . فقالت : نعم ما أمرنا به . فجعلا يقولان ; فغفل العدو عن ابنه ، فساق غنمهم وجاء بها إلى أبيه ; وهي أربعة آلاف شاة . فنزلت الآية ، وجعل النبي صلى الله عليه وسلم تلك الأغنام له . في رواية : أنه جاء وقد أصاب إبلا من العدو وكان فقيرا . قال الكلبي : أصاب خمسين بعيرا . وفي رواية : فأفلت ابنه من الأسر وركب ناقة للقوم ، ومر في طريقه بسرح لهم فاستاقه . وقال مقاتل : أصاب غنما ومتاعا فسأل النبي صلى الله عليه وسلم : أيحل لي أن آكل مما أتى به ابني ؟ قال : \" نعم \" . ونزلت : ومن يتق الله يجعل له مخرجا ويرزقه من حيث لا يحتسب . فروى الحسن عن عمران بن الحصين قال : قال رسول الله صلى الله عليه وسلم : \" من انقطع إلى الله كفاه الله كل مئونة ، ورزقه من حيث لا يحتسب . ومن انقطع إلى الدنيا وكله الله إليها \" . وقال الزجاج : أي إذا اتقى وآثر الحلال والتصبر على أهله ، فتح الله عليه إن كان ذا ضيقة ورزقه من حيث لا يحتسب . وعن ابن عباس أن النبي صلى الله عليه وسلم قال : \" من أكثر الاستغفار جعل الله له من كل هم فرجا ، ومن كل ضيق مخرجا ، ورزقه من حيث لا يحتسب \" .\nقوله تعالى : ومن يتوكل على الله فهو حسبه أي من فوض إليه أمره كفاه ما أهمه . وقيل : أي من اتقى الله وجانب المعاصي وتوكل عليه ، فله فيما يعطيه في الآخرة من ثوابه كفاية . ولم يرد الدنيا ; لأن المتوكل قد يصاب في الدنيا وقد يقتل .\nإن الله بالغ أمره قال مسروق : أي قاض أمره فيمن توكل عليه وفيمن لم يتوكل عليه ; إلا أن من توكل عليه فيكفر عنه سيئاته ويعظم له أجرا . وقراءة العامة \" بالغ \" منونا . \" أمره \" نصبا . وقرأ عاصم \" بالغ أمره \" بالإضافة وحذف التنوين استخفافا . وقرأ المفضل \" بالغا أمره \" على أن قوله : \" قد جعل الله \" خبر إن و \" بالغا \" حال . وقرأ داود بن أبي هند \" بالغ أمره \" بالتنوين ورفع الراء . قال الفراء : أي أمره بالغ . وقيل : \" أمره \" مرتفع ب \" بالغ \" والمفعول محذوف ; والتقدير : بالغ أمره ما أراد .\nقد جعل الله لكل شيء قدرا أي لكل شيء من الشدة والرخاء أجلا ينتهي إليه . وقيل تقديرا . وقال السدي : هو قدر الحيض في الأجل والعدة . وقال عبد الله بن رافع : لما نزل قوله تعالى : ومن يتوكل على الله فهو حسبه قال أصحاب النبي صلى الله عليه وسلم : فنحن إذا توكلنا عليه نرسل ما كان لنا ولا نحفظه ; فنزلت : إن الله بالغ أمره فيكم وعليكم . وقال الربيع بن خيثم : إن الله تعالى قضى على نفسه أن من توكل عليه كفاه ومن آمن به هداه ، ومن أقرضه جازاه ، ومن وثق به نجاه ، ومن دعاه أجاب له . وتصديق ذلك في كتاب الله : ومن يؤمن بالله يهد قلبه . ومن يتوكل على الله فهو حسبه . إن تقرضوا الله قرضا حسنا يضاعفه لكم . ومن يعتصم بالله فقد هدي إلى صراط مستقيم . وإذا سألك عبادي عني فإني قريب أجيب دعوة الداع إذا دعان .\n                                    ",
        "saadi": "وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۥٓۚ إِنَّ ٱللَّهَ بَٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا ٣\n                                        \n                                        \n                                        \n                                        { وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ } أي: يسوق الله الرزق للمتقي، من وجه لا يحتسبه ولا يشعر به.\n{ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ } أي: في أمر دينه ودنياه، بأن يعتمد على الله في جلب ما ينفعه ودفع ما يضره، ويثق به في تسهيل ذلك { فَهُوَ حَسْبُهُ } أي: كافيه الأمر الذي توكل عليه به، وإذا كان الأمر في كفالة الغني القوي [العزيز] الرحيم، فهو أقرب إلى العبد من كل شيء، ولكن ربما أن الحكمة الإلهية اقتضت تأخيره إلى الوقت المناسب له؛ فلهذا قال تعالى: { إِنَّ اللَّهَ بَالِغُ أَمْرِهِ } أي: لا بد من نفوذ قضائه وقدره، ولكنه { قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا } أي: وقتًا ومقدارًا، لا يتعداه ولا يقصر عنه.\n                                    "
      },
      "originalText": "وَيَرۡزُقۡهُ مِنۡ حَيۡثُ لَا يَحۡتَسِبُۚ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَهُوَ حَسۡبُهُۥٓۚ إِنَّ ٱللَّهَ بَٰلِغُ أَمۡرِهِۦۚ قَدۡ جَعَلَ ٱللَّهُ لِكُلِّ شَيۡءٖ قَدۡرٗا ٣"
    },
    {
      "number": 5221,
      "text": "وَاللَّائِي يَئِسْنَ مِنَ الْمَحِيضِ مِنْ نِسَائِكُمْ إِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلَاثَةُ أَشْهُرٍ وَاللَّائِي لَمْ يَحِضْنَ ۚ وَأُولَاتُ الْأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ ۚ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا",
      "surah": {
        "number": 65,
        "name": "سورة الطلاق",
        "englishName": "At-Talaaq",
        "englishNameTranslation": "Divorce",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 4,
      "juz": 28,
      "manzil": 7,
      "page": 558,
      "ruku": 492,
      "hizbQuarter": 223,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱلَّٰٓـِٔي يَئِسۡنَ مِنَ ٱلۡمَحِيضِ مِن نِّسَآئِكُمۡ إِنِ ٱرۡتَبۡتُمۡ فَعِدَّتُهُنَّ ثَلَٰثَةُ أَشۡهُرٖ وَٱلَّٰٓـِٔي لَمۡ يَحِضۡنَۚ وَأُوْلَٰتُ ٱلۡأَحۡمَالِ أَجَلُهُنَّ أَن يَضَعۡنَ حَمۡلَهُنَّۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مِنۡ أَمۡرِهِۦ يُسۡرٗا ٤\n                                    \n                                    \n                                    يقول تعالى مبينا لعدة الآيسة - وهي التي قد انقطع عنها الحيض لكبرها - : أنها ثلاثة أشهر ، عوضا عن الثلاثة قروء في حق من تحيض ، كما دلت على ذلك آية \" البقرة \" وكذا الصغار اللائي لم يبلغن سن الحيض أن عدتهن كعدة الآيسة ثلاثة أشهر ; ولهذا قال : ( واللائي لم يحضن )\nوقوله : ( إن ارتبتم ) فيه قولان :\nأحدهما - وهو قول طائفة من السلف كمجاهد ، والزهري ، وابن زيد - : أي إن رأين دما وشككتم في كونه حيضا ، أو استحاضة ، وارتبتم فيه .\nوالقول الثاني : إن ارتبتم في حكم عدتهن ، ولم تعرفوه فهو ثلاث أشهر . وهذا مروي ، عن سعيد بن جبير . وهو اختيار ابن جرير وهو أظهر في المعنى ، واحتج عليه بما رواه عن أبي كريب ، وأبي السائب قالا : حدثنا ابن إدريس ، أخبرنا مطرف ، عن عمرو بن سالم قال : قال أبي بن كعب : يا رسول الله ، إن عددا من عدد النساء لم تذكر في الكتاب : الصغار ، والكبار ، وأولات الأحمال ، قال : فأنزل الله عز وجل : ( واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر واللائي لم يحضن وأولات الأحمال أجلهن أن يضعن حملهن )\nورواه ابن أبي حاتم بأبسط من هذا السياق فقال : حدثنا أبي ، حدثنا يحيى بن المغيرة ، أخبرنا جرير ، عن مطرف ، عن عمر بن سالم ، عن أبي بن كعب ، قال : قلت لرسول الله - صلى الله عليه وسلم - : إن ناسا من أهل المدينة لما أنزلت هذه الآية التي في \" البقرة \" في عدة النساء قالوا : لقد بقي من عدة النساء عدد لم يذكرن في القرآن : الصغار ، والكبار اللائي قد انقطع عنهن الحيض ، وذوات الحمل . قال : فأنزلت التي في النساء القصرى : ( واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر واللائي لم يحضن )\nوقوله : ( وأولات الأحمال أجلهن أن يضعن حملهن ) يقول تعالى : ومن كانت حاملا فعدتها بوضعه ، ولو كان بعد الطلاق أو الموت بفواق ناقة في قول جمهور العلماء من السلف والخلف ، كما هو نص هذه الآية الكريمة ، وكما وردت به السنة النبوية . وقد روي عن علي ، وابن عباس رضي الله عنهم أنهما ذهبا في المتوفى عنها زوجها أنها تعتد بأبعد الأجلين من الوضع أو الأشهر ، عملا بهذه الآية الكريمة ، والتي في سورة \" البقرة \" . وقد قال البخاري :\nحدثنا سعد بن حفص ، حدثنا شيبان ، عن يحيى ، قال : أخبرني أبو سلمة قال : جاء رجل إلى ابن عباس ، - وأبو هريرة جالس - فقال : أفتني في امرأة ولدت بعد زوجها بأربعين ليلة . فقال : ابن عباس آخر الأجلين . قلت أنا : ( وأولات الأحمال أجلهن أن يضعن حملهن ) قال أبو هريرة : أنا مع ابن أخي - يعني أبا سلمة - فأرسل ابن عباس غلامه كريبا إلى أم سلمة يسألها ، فقالت : قتل زوج سبيعة الأسلمية وهي حبلى ، فوضعت بعد موته بأربعين ليلة ، فخطبت ، فأنكحها رسول الله - صلى الله عليه وسلم - وكان أبو السنابل فيمن خطبها\nهكذا أورد البخاري هذا الحديث ها هنا مختصرا . وقد رواه هو ، ومسلم ، وأصحاب الكتب مطولا من وجوه أخر ، وقال الإمام أحمد :\nحدثنا حماد بن أسامة ، أخبرنا هشام ، عن أبيه ، عن المسور بن مخرمة ; أن سبيعة الأسلمية توفي عنها زوجها وهي حامل ، فلم تمكث إلا ليالي حتى وضعت ، فلما تعلت من نفاسها خطبت ، فاستأذنت رسول الله - صلى الله عليه وسلم - في النكاح ، فأذن لها أن تنكح فنكحت .\nورواه البخاري في صحيحه ، ومسلم ، وأبو داود ، والنسائي ، وابن ماجه من طرق عنها كما قال مسلم بن الحجاج :\nحدثني أبو الطاهر ، أخبرنا ابن وهب ، حدثني يونس بن يزيد ، عن ابن شهاب ، حدثني عبيد الله بن عبد الله بن عتبة : أن أباه كتب إلى عمر بن عبد الله بن الأرقم الزهري يأمره أن يدخل على سبيعة بنت الحارث الأسلمية فيسألها عن حديثها ، وعما قال لها رسول الله - صلى الله عليه وسلم - حين استفتته . فكتب عمر بن عبد الله يخبره أن سبيعة أخبرته أنها كانت تحت سعد بن خولة - وكان ممن شهد بدرا - فتوفي عنها في حجة الوداع وهي حامل ، فلم تنشب أن وضعت حملها بعد وفاته ، فلما تعلت من نفاسها تجملت للخطاب ، فدخل عليها أبو السنابل بن بعكك فقال لها : مالي أراك متجملة ؟ لعلك ترجين النكاح ، إنك والله ما أنت بناكح حتى تمر عليك أربعة أشهر وعشر . قالت سبيعة : فلما قال لي ذلك جمعت علي ثيابي حين أمسيت فأتيت رسول الله - صلى الله عليه وسلم - فسألته عن ذلك ، فأفتاني بأني قد حللت حين وضعت حملي ، وأمرني بالتزويج إن بدا لي .\nهذا لفظ مسلم . ورواه البخاري مختصرا ، ثم قال البخاري بعد ذلك ، أي : بعد رواية الحديث الأول عند هذه الآية :\nوقال سليمان بن حرب ، وأبو النعمان : حدثنا حماد بن زيد ، عن أيوب ، عن محمد - هو ابن سيرين - قال : كنت في حلقة فيها عبد الرحمن بن أبي ليلى رحمه الله ، وكان أصحابه يعظمونه ، فذكر آخر الأجلين ، فحدثت بحديث سبيعة بنت الحارث ، عن عبد الله بن عتبة قال : فضمزلي بعض أصحابه ، وقال محمد : ففطنت له فقلت : له إني لجريء أن أكذب على عبد الله وهو في ناحية الكوفة . قال : فاستحيا وقال : لكن عمه لم يقل ذلك . فلقيت أبا عطية مالك بن عامر فسألته ، فذهب يحدثني بحديث سبيعة فقلت : هل سمعت عن عبد الله شيئا ؟ فقال : كنا عند عبد الله ، فقال : أتجعلون عليها التغليظ ، ولا تجعلون عليها الرخصة ؟ نزلت سورة النساء القصرى بعد الطولى : ( وأولات الأحمال أجلهن أن يضعن حملهن )\nورواه ابن جرير من طريق سفيان بن عيينة وإسماعيل بن علية ، عن أيوب به مختصرا ، ورواه النسائي في التفسير عن محمد بن عبد الأعلى ، عن خالد بن الحارث ، عن ابن عون ، عن محمد بن سيرين فذكره\nوقال ابن جرير : حدثني زكريا بن يحيى بن أبان المصري ، حدثنا سعيد بن أبي مريم ، حدثنا محمد بن جعفر ، حدثني ابن شبرمة الكوفي ، عن إبراهيم ، عن علقمة بن قيس أن عبد الله بن مسعود ، قال : من شاء لاعنته ، ما نزلت : ( وأولات الأحمال أجلهن أن يضعن حملهن ) إلا بعد آية المتوفى عنها زوجها . قال : وإذا وضعت المتوفى عنها زوجها فقد حلت . يريد بآية المتوفى عنها زوجها ( والذين يتوفون منكم ويذرون أزواجا يتربصن بأنفسهن أربعة أشهر وعشرا ) [ البقرة : 234 ]\nوقد رواه النسائي من حديث سعيد بن أبي مريم به ، ثم قال ابن جرير :\nحدثنا أحمد بن منيع ، حدثنا محمد بن عبيد ، حدثنا إسماعيل بن أبي خالد ، عن الشعبي ، قال : ذكر عند ابن مسعود آخر الأجلين ، فقال : من شاء قاسمته بالله إن هذه الآية التي في النساء القصرى نزلت بعد الأربعة الأشهر والعشر ، ثم قال : أجل الحامل أن تضع ما في بطنها .\nوقال ابن أبي حاتم : حدثنا أحمد بن سنان الواسطي ، حدثنا عبد الرحمن بن مهدي ، عن سفيان ، عن الأعمش ، عن أبي الضحى ، عن مسروق ، قال : بلغ ابن مسعود أن عليا رضي الله عنه ، يقول : آخر الأجلين . فقال : من شاء لاعنته ، إن التي في النساء القصرى نزلت بعد البقرة : ( وأولات الأحمال أجلهن أن يضعن حملهن )\nورواه أبو داود ، وابن ماجه من حديث أبي معاوية ، عن الأعمش\nوقال عبد الله بن الإمام أحمد : حدثني محمد بن أبي بكر المقدمي ، أخبرنا عبد الوهاب الثقفي ، حدثنا المثنى ، عن عمرو بن شعيب ، عن أبيه ، عن عبد الله بن عمرو ، عن أبي بن كعب قال : قلت للنبي - صلى الله عليه وسلم - : ( وأولات الأحمال أجلهن أن يضعن حملهن ) المطلقة ثلاثا أو المتوفى عنها ؟ فقال : \" هي المطلقة ثلاثا والمتوفى عنها \"\nهذا حديث غريب جدا ، بل منكر ; لأن في إسناده المثنى بن الصباح وهو متروك الحديث بمرة ، ولكن رواه ابن أبي حاتم بسند آخر ، فقال :\nحدثنا محمد بن داود السمناني ، حدثنا عمرو بن خالد - يعني : الحراني - حدثنا ابن لهيعة ، عن عمرو بن شعيب ، عن سعيد بن المسيب ، عن أبي بن كعب أنه لما نزلت هذه الآية قال لرسول الله - صلى الله عليه وسلم - : لا أدري أمشتركة أم مبهمة ، قال رسول الله - صلى الله عليه وسلم - : \" أية آية ؟ \" . قال : ( أجلهن أن يضعن حملهن ) المتوفى عنها والمطلقة ؟ قال : \" نعم \" .\nوكذا رواه ابن جرير ، عن أبي كريب ، عن موسى بن داود ، عن ابن لهيعة به . ثم رواه عن أبي كريب أيضا ، عن مالك بن إسماعيل ، عن ابن عيينة ، عن عبد الكريم بن أبي المخارق أنه حدث عن أبي بن كعب ، قال : سألت رسول الله - صلى الله عليه وسلم - عن : ( وأولات الأحمال أجلهن أن يضعن حملهن ) قال : \" أجل كل حامل أن تضع ما في بطنها \"\nعبد الكريم هذا ضعيف ، ولم يدرك أبيا .\nوقوله : ( ومن يتق الله يجعل له من أمره يسرا ) أي : يسهل له أمره ، وييسره عليه ، ويجعل له فرجا قريبا ومخرجا عاجلا .\n                                    ",
        "qortoby": "وَٱلَّٰٓـِٔي يَئِسۡنَ مِنَ ٱلۡمَحِيضِ مِن نِّسَآئِكُمۡ إِنِ ٱرۡتَبۡتُمۡ فَعِدَّتُهُنَّ ثَلَٰثَةُ أَشۡهُرٖ وَٱلَّٰٓـِٔي لَمۡ يَحِضۡنَۚ وَأُوْلَٰتُ ٱلۡأَحۡمَالِ أَجَلُهُنَّ أَن يَضَعۡنَ حَمۡلَهُنَّۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مِنۡ أَمۡرِهِۦ يُسۡرٗا ٤\n                                    \n                                    \n                                    قوله تعالى : واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر فيه سبع مسائل :\nالأولى : قوله تعالى : واللائي يئسن من المحيض من نسائكم لما بين أمر الطلاق والرجعة في التي تحيض ، وكانوا قد عرفوا عدة ذوات الأقراء ، عرفهم في هذه السورة عدة التي لا ترى الدم . وقال أبو عثمان عمر بن سالم : لما نزلت عدة النساء في سورة \" البقرة \" في المطلقة والمتوفى عنها زوجها قال أبي بن كعب : يا رسول الله ، إن ناسا يقولون قد بقي من النساء من لم يذكر فيهن شيء : الصغار وذوات الحمل ، فنزلت : واللائي يئسن . . الآية . وقال مقاتل : لما ذكر قوله تعالى : والمطلقات يتربصن بأنفسهن ثلاثة قروء قال خلاد بن النعمان : يا رسول الله ، فما عدة التي لم تحض ، وعدة التي انقطع حيضها ، وعدة الحبلى ؟ فنزلت : واللائي يئسن من المحيض من نسائكم يعني قعدن عن المحيض . وقيل : إن معاذ بن جبل سأل عن عدة الكبيرة التي يئست ; فنزلت الآية . والله أعلم . وقال مجاهد : الآية واردة في المستحاضة لا تدري دم حيض هو أو دم علة .\nالثانية : قوله تعالى : إن ارتبتم أي شككتم ، وقيل تيقنتم . وهو من الأضداد ; يكون شكا ويقينا كالظن . واختيار الطبري أن يكون المعنى : إن شككتم فلم تدروا ما الحكم فيهن . وقال الزجاج : إن ارتبتم في حيضها وقد انقطع عنها الحيض وكانت ممن يحيض مثلها . القشيري : وفي هذا نظر ; لأنا إذا شككنا هل بلغت سن اليأس لم نقل عدتها ثلاثة أشهر . والمعتبر في سن اليأس في قول : أقصى عادة امرأة في العالم . وفي قول : غالب نساء عشيرة المرأة . وقال مجاهد : قوله إن ارتبتم للمخاطبين ; يعني إن لم تعلموا كم عدة اليائسة والتي لم تحض فالعدة هذه . وقيل : المعنى إن ارتبتم أن الدم الذي يظهر منها من أجل كبر أو من الحيض المعهود أو من الاستحاضة فالعدة ثلاثة أشهر . وقال عكرمة وقتادة : من الريبة المرأة المستحاضة التي لا يستقيم لها الحيض ; تحيض في أول الشهر مرارا وفي الأشهر مرة . وقيل : إنه متصل بأول السورة . والمعنى : لا تخرجوهن من بيوتهن إن ارتبتم في انقضاء العدة . وهو أصح ما قيل فيه .\nالثالثة : المرتابة في عدتها لا تنكح حتى تستبرئ نفسها من ريبتها ، ولا تخرج من العدة إلا بارتفاع الريبة . وقد قيل في المرتابة التي ترفعها حيضتها وهي لا تدري ما ترفعها : إنها تنتظر سنة من يوم طلقها زوجها ; منها تسعة أشهر استبراء ، وثلاثة عدة . فإن طلقها فحاضت حيضة أو حيضتين ثم ارتفع عنها بغير يأس منها انتظرت تسعة أشهر ، ثم ثلاثة من يوم طهرت من حيضتها ثم حلت للأزواج . وهذا قاله الشافعي بالعراق . فعلى قياس هذا القول تقيم الحرة المتوفى عنها زوجها المستبرأة بعد التسعة أشهر أربعة أشهر وعشرا ، والأمة شهرين وخمس ليال بعد التسعة الأشهر . وروي عن الشافعي أيضا أن أقراءها على ما كانت حتى تبلغ سن اليائسات . وهو قول النخعي والثوري وغيرهما ، وحكاه أبو عبيد عن أهل العراق . فإن كانت المرأة شابة وهي :\nالمسألة الرابعة : استؤني بها هل هي حامل أم لا ; فإن استبان حملها فإن أجلها وضعه . وإن لم يستبن فقال مالك : عدة التي ارتفع حيضها وهي شابة سنة . وبه قال أحمد وإسحاق ورووه عن عمر بن الخطاب رضي الله عنه وغيره . وأهل العراق يرون أن عدتها ثلاث حيض بعدما كانت حاضت مرة واحدة في عمرها ، وإن مكثت عشرين سنة ، إلا أن تبلغ من الكبر مبلغا تيأس فيه من الحيض فتكون عدتها بعد الإياس ثلاثة أشهر . قال الثعلبي : وهذا الأصح من مذهب الشافعي وعليه جمهور العلماء . وروي ذلك عن ابن مسعود وأصحابه . قال الكيا : وهو الحق ; لأن الله تعالى جعل عدة الآيسة ثلاثة أشهر ; والمرتابة ليست آيسة .\nالخامسة : وأما من تأخر حيضها لمرض ; فقال مالك وابن القاسم وعبد الله بن أصبغ : تعتد تسعة أشهر ثم ثلاثة . وقال أشهب : هي كالمرضع بعد الفطام بالحيض أو بالسنة . وقد طلق حبان بن منقذ امرأته وهي ترضع ; فمكثت سنة لا تحيض لأجل الرضاع ، ثم مرض حبان فخاف أن ترثه فخاصمها إلى عثمان وعنده علي وزيد ، فقالا : نرى أن ترثه ; لأنها ليست من القواعد ولا من الصغار ; فمات حبان فورثته واعتدت عدة الوفاة .\nالسادسة : ولو تأخر الحيض لغير مرض ولا رضاع فإنها تنتظر سنة لا حيض فيها ، تسعة أشهر ثم ثلاثة ; على ما ذكرناه . فتحل ما لم ترتب بحمل ; فإن ارتابت بحمل أقامت أربعة أعوام ، أو خمسة ، أو سبعة ; على اختلاف الروايات عن علمائنا . ومشهورها خمسة أعوام ; فإن تجاوزتها حلت . وقال أشهب : لا تحل أبدا حتى تنقطع عنها الريبة . قال ابن العربي : وهو الصحيح ; لأنه إذا جاز أن يبقى الولد في بطنها خمسة أعوام جاز أن يبقى عشرة وأكثر من ذلك . وقد روي عن مالك مثله .\nالسابعة : وأما التي جهل حيضها بالاستحاضة ففيها ثلاثة أقوال : قال ابن المسيب : تعتد سنة . وهو قول الليث . قال الليث : عدة المطلقة وعدة المتوفى عنها زوجها إذا كانت مستحاضة سنة . وهو مشهور قول علمائنا ; سواء علمت دم حيضها من دم استحاضتها ، وميزت ذلك أو لم تميزه ، عدتها في ذلك كله عند مالك في تحصيل مذهبه سنة ; منها تسعة أشهر استبراء وثلاثة عدة . وقال الشافعي في أحد أقواله : عدتها ثلاثة أشهر . وهو قول جماعة من التابعين والمتأخرين من القرويين . ابن العربي : وهو الصحيح عندي . وقال أبو عمر : المستحاضة إذا كان دمها ينفصل فعلمت إقبال حيضتها أو إدبارها اعتدت ثلاثة قروء . وهذا أصح في النظر ، وأثبت في القياس والأثر .\nقوله تعالى : واللائي لم يحضن يعني الصغيرة فعدتهن ثلاثة أشهر ; فأضمر الخبر . وإنما كانت عدتها بالأشهر لعدم الأقراء فيها عادة ، والأحكام إنما أجراها الله تعالى على العادات ; فهي تعتد بالأشهر . فإذا رأت الدم في زمن احتماله عند النساء انتقلت إلى الدم لوجود الأصل ، وإذا وجد الأصل لم يبق للبدل حكم ; كما أن المسنة إذا اعتدت بالدم ثم ارتفع عادت إلى الأشهر . وهذا إجماع .\nقوله تعالى : وأولات الأحمال أجلهن أن يضعن حملهن فيه مسألتان :\nالأولى : قوله تعالى : وأولات الأحمال أجلهن وضع الحمل ، وإن كان ظاهرا في المطلقة لأنه عليها عطف وإليها رجع عقب الكلام ; فإنه في المتوفى عنها زوجها كذلك ; لعموم الآية وحديث سبيعة . وقد مضى في \" البقرة \" القول فيه مستوفى .\nالثانية : إذا وضعت المرأة ما وضعت من علقة أو مضغة حلت . وقال الشافعي وأبو حنيفة : لا تحل إلا بما يكون ولدا . وقد مضى القول فيه في سورة \" البقرة \" وسورة \" الرعد \" والحمد لله .\nقوله تعالى : ومن يتق الله يجعل له من أمره يسرا قال الضحاك : أي من يتقه في طلاق السنة يجعل له من أمره يسرا في الرجعة . مقاتل : ومن يتق الله في اجتناب معاصيه يجعل له من أمره يسرا في توفيقه للطاعة .\n                                    ",
        "saadi": "وَٱلَّٰٓـِٔي يَئِسۡنَ مِنَ ٱلۡمَحِيضِ مِن نِّسَآئِكُمۡ إِنِ ٱرۡتَبۡتُمۡ فَعِدَّتُهُنَّ ثَلَٰثَةُ أَشۡهُرٖ وَٱلَّٰٓـِٔي لَمۡ يَحِضۡنَۚ وَأُوْلَٰتُ ٱلۡأَحۡمَالِ أَجَلُهُنَّ أَن يَضَعۡنَ حَمۡلَهُنَّۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مِنۡ أَمۡرِهِۦ يُسۡرٗا ٤\n                                        \n                                        \n                                        \n                                        لما ذكر تعالى أن الطلاق المأمور به يكون لعدة النساء، ذكر تعالى العدة، فقال:\n{ وَاللَّائِي يَئِسْنَ مِنَ الْمَحِيضِ مِنْ نِسَائِكُمْْ } بأن كن يحضن، ثم ارتفع حيضهن، لكبر أو غيره، ولم يرج رجوعه، فإن عدتها ثلاثة أشهر، جعل لكل شهر، مقابلة حيضة.\n{ وَاللَّائِي لَمْ يَحِضْنَ } أي: الصغار، اللائي لم يأتهن الحيض بعد، و البالغات اللاتي لم يأتهن حيض بالكلية، فإنهن كالآيسات، عدتهن ثلاثة أشهر، وأما اللائي يحضن، فذكر الله عدتهن في قوله: { وَالْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ ثَلَاثَةَ قُرُوءٍ } [وقوله:] { وَأُولَاتُ الْأَحْمَالِ أَجَلُهُنَّ } أي: عدتهن { أَنْ يَضَعْنَ حَمْلَهُنَّ } أي: جميع ما في بطونهن، من واحد، ومتعدد، ولا عبرة حينئذ، بالأشهر ولا غيرها، { وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا } أي: من اتقى الله تعالى، يسر له الأمور، وسهل عليه كل عسير.\n                                    "
      },
      "originalText": "وَٱلَّٰٓـِٔي يَئِسۡنَ مِنَ ٱلۡمَحِيضِ مِن نِّسَآئِكُمۡ إِنِ ٱرۡتَبۡتُمۡ فَعِدَّتُهُنَّ ثَلَٰثَةُ أَشۡهُرٖ وَٱلَّٰٓـِٔي لَمۡ يَحِضۡنَۚ وَأُوْلَٰتُ ٱلۡأَحۡمَالِ أَجَلُهُنَّ أَن يَضَعۡنَ حَمۡلَهُنَّۚ وَمَن يَتَّقِ ٱللَّهَ يَجۡعَل لَّهُۥ مِنۡ أَمۡرِهِۦ يُسۡرٗا ٤"
    },
    {
      "number": 5222,
      "text": "ذَٰلِكَ أَمْرُ اللَّهِ أَنْزَلَهُ إِلَيْكُمْ ۚ وَمَنْ يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا",
      "surah": {
        "number": 65,
        "name": "سورة الطلاق",
        "englishName": "At-Talaaq",
        "englishNameTranslation": "Divorce",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 5,
      "juz": 28,
      "manzil": 7,
      "page": 558,
      "ruku": 492,
      "hizbQuarter": 223,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَٰلِكَ أَمۡرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيۡكُمۡۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرۡ عَنۡهُ سَيِّ‍َٔاتِهِۦ وَيُعۡظِمۡ لَهُۥٓ أَجۡرًا ٥\n                                    \n                                    \n                                    ثم قال : ( ذلك أمر الله أنزله إليكم ) أي : حكمه وشرعه أنزله إليكم بواسطة رسول الله - صلى الله عليه وسلم - ( ومن يتق الله يكفر عنه سيئاته ويعظم له أجرا ) أي : يذهب عنه المحذور ، ويجزل له الثواب على العمل اليسير .\n                                    ",
        "qortoby": "ذَٰلِكَ أَمۡرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيۡكُمۡۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرۡ عَنۡهُ سَيِّ‍َٔاتِهِۦ وَيُعۡظِمۡ لَهُۥٓ أَجۡرًا ٥\n                                    \n                                    \n                                    ذلك أمر الله أي الذي ذكر من الأحكام أمر الله أنزله إليكم وبينه لكم .\nومن يتق الله أي يعمل بطاعته .\nيكفر عنه سيئاته من الصلاة إلى الصلاة ، ومن الجمعة إلى الجمعة .\nويعظم له أجرا أي في الآخرة .\n\n                                    ",
        "saadi": "ذَٰلِكَ أَمۡرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيۡكُمۡۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرۡ عَنۡهُ سَيِّ‍َٔاتِهِۦ وَيُعۡظِمۡ لَهُۥٓ أَجۡرًا ٥\n                                        \n                                        \n                                        \n                                        { ذَلِكَ } [أي:] الحكم الذي بينه الله لكم { أَمْرُ اللَّهِ أَنْزَلَهُ إِلَيْكُمْ } لتمشوا عليه، [وتأتموا] وتقوموا به وتعظموه.\n{ وَمَنْ يَتَّقِ اللَّهَ يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُعْظِمْ لَهُ أَجْرًا } أي: يندفع عنه المحذور، ويحصل له المطلوب.\n                                    "
      },
      "originalText": "ذَٰلِكَ أَمۡرُ ٱللَّهِ أَنزَلَهُۥٓ إِلَيۡكُمۡۚ وَمَن يَتَّقِ ٱللَّهَ يُكَفِّرۡ عَنۡهُ سَيِّ‍َٔاتِهِۦ وَيُعۡظِمۡ لَهُۥٓ أَجۡرًا ٥"
    }
  ]
}