{
  "number": 56,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 339,
      "text": "وَيُكَلِّمُ النَّاسَ فِي الْمَهْدِ وَكَهْلًا وَمِنَ الصَّالِحِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 46,
      "juz": 3,
      "manzil": 1,
      "page": 56,
      "ruku": 46,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗا وَمِنَ ٱلصَّٰلِحِينَ ٦٤\n                                    \n                                    \n                                    وقوله : ( ويكلم الناس في المهد وكهلا ) أي : يدعو إلى عبادة الله وحده لا شريك له ، في حال صغره ، معجزة وآية ، و [ في ] حال كهوليته حين يوحي الله إليه بذلك ( ومن الصالحين ) أي : في قوله وعمله ، له علم صحيح وعمل صالح .\nقال محمد بن إسحاق ، عن يزيد بن عبد الله بن قسيط ، عن محمد بن شرحبيل ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" ما تكلم مولود في صغره إلا عيسى وصاحب جريج \" .\nوقال ابن أبي حاتم : حدثنا أبو الصقر يحيى بن محمد بن قزعة ، حدثنا الحسين - يعني المروزي - حدثنا جرير - يعني ابن حازم - عن محمد ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم قال : \" لم يتكلم في المهد إلا ثلاثة ، عيسى ، وصبي كان في زمن جريج ، وصبي آخر \" .\n\n                                    ",
        "qortoby": "وَيُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗا وَمِنَ ٱلصَّٰلِحِينَ ٦٤\n                                    \n                                    \n                                    ويكلم الناس عطف على ( وجيها ) قاله الأخفش أيضا . و ( المهد ) مضجع الصبي في رضاعه . ومهدت الأمر هيأته ووطأته . وفي التنزيل فلأنفسهم يمهدون . وامتهد الشيء ارتفع كما يمتهد سنام البعير . وكهلا الكهل بين حال الغلومة وحال الشيخوخة . وامرأة كهلة . واكتهلت الروضة إذا عمها النور . يقول : يكلم الناس في المهد آية ، ويكلمهم كهلا بالوحي والرسالة . وقال أبو العباس : كلمهم في المهد حين برأ أمه فقال : إني عبد الله الآية . وأما كلامه وهو كهل فإذا أنزله الله تعالى من السماء أنزله على صورة ابن ثلاث وثلاثين سنة وهو الكهل فيقول لهم : إني عبد الله كما قال في المهد . فهاتان آيتان وحجتان . قال المهدوي : وفائدة الآية أنه أعلمهم أن عيسى عليه السلام يكلمهم في المهد ويعيش إلى أن يكلمهم كهلا ، إذ كانت العادة أن من تكلم في المهد لم يعش . قال الزجاج : وكهلا بمعنى ويكلم الناس كهلا . وقال الفراء والأخفش : هو معطوف على ( وجيها ) . وقيل : المعنى ويكلم الناس صغيرا وكهلا . وروى ابن جريج عن مجاهد قال : الكهل الحليم . قال النحاس : هذا لا يعرف في اللغة ، وإنما الكهل عند أهل اللغة من ناهز الأربعين . وقال بعضهم : يقال له حدث إلى ست عشرة سنة . ثم شاب إلى اثنتين وثلاثين . ثم يكتهل في ثلاث وثلاثين ; قاله الأخفش . ( ومن الصالحين ) عطف على ( وجيها ) أي وهو من العباد الصالحين . ذكر أبو بكر بن أبي شيبة حدثنا عبد الله بن إدريس عن حصين عن هلال بن يساف . قال : لم يتكلم في المهد إلا ثلاثة : عيسى وصاحب يوسف وصاحب جريج ، كذا قال : \" وصاحب يوسف \" . وهو في صحيح مسلم عن أبي هريرة عن النبي - صلى الله عليه وسلم - قال : لم يتكلم في المهد إلا ثلاثة : عيسى ابن مريم وصاحب جريج وصاحب الجبار وبينا صبي يرضع من أمه وذكر الحديث بطوله . وقد جاء من حديث صهيب في قصة الأخدود أن امرأة جيء بها لتلقى في النار على إيمانها ومعها صبي . في غير كتاب مسلم يرضع فتقاعست أن تقع فيها فقال الغلام : يا أمه ! اصبري فإنك على الحق . وقال الضحاك : تكلم في المهد ستة : شاهد يوسف ، وصبي ماشطة امرأة فرعون ، وعيسى ، ويحيى ، وصاحب جريج ، وصاحب الجبار . ولم يذكر الأخدود ، فأسقط صاحب الأخدود وبه يكون المتكلمون سبعة . ولا معارضة بين هذا وبين قوله عليه السلام : ( لم يتكلم في المهد إلا ثلاثة ) بالحصر فإنه أخبر بما كان في علمه مما أوحي إليه في تلك الحال ، ثم بعد هذا أعلمه الله تعالى بما شاء من ذلك فأخبر به .\nقلت : أما صاحب يوسف فيأتي الكلام فيه ، وأما صاحب جريج وصاحب الجبار وصاحب الأخدود ففي صحيح مسلم . وستأتي قصة الأخدود في سورة \" البروج \" إن شاء الله تعالى . وأما صبي ماشطة امرأة فرعون ، فذكر البيهقي عن ابن عباس قال : قال النبي - صلى الله عليه وسلم - : لما أسري بي سرت في رائحة طيبة فقلت ما هذه الرائحة قالوا ماشطة ابنة فرعون وأولادها سقط مشطها من يديها فقالت : بسم الله . قالت ابنة فرعون : أبي ؟ قالت : ربي وربك ورب أبيك . قالت : أولك رب غير أبي ؟ قالت : نعم ربي وربك ورب أبيك الله . قال : فدعاها فرعون ، فقال : ألك رب غيري ؟ قالت : نعم ربي وربك الله . قال : فأمر بنقرة من نحاس فأحميت ثم أمر بها لتلقى فيها قالت : إن لي إليك حاجة قال : ما هي ؟ قالت : تجمع عظامي وعظام ولدي في موضع واحد . قال : ذاك لك لما لك علينا من الحق . فأمر بهم فألقوا واحدا بعد واحد حتى بلغ رضيعا فيهم فقال قعي يا أمه ولا تقاعسي فإنا على الحق . قال : وتكلم أربعة وهم صغار : هذا ، وشاهد يوسف ، وصاحب جريج ، وعيسى ابن مريم .\n                                    ",
        "saadi": "وَيُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗا وَمِنَ ٱلصَّٰلِحِينَ ٦٤\n                                        \n                                        \n                                        \n                                        { ويكلم الناس فى المهد وكهلا } وهذا غير التكليم المعتاد، بل المراد يكلم الناس بما فيه صلاحهم وفلاحهم، وهو تكليم المرسلين، ففي هذا إرساله ودعوته الخلق إلى ربهم، وفي تكليمهم في المهد آية عظيمة من آيات الله ينتفع بها المؤمنون، وتكون حجة على المعاندين، أنه رسول رب العالمين، وأنه عبد الله، وليكون نعمة وبراءة لوالدته مما رميت به { ومن الصالحين } أي: يمن عليه بالصلاح، من من عليهم، ويدخله في جملتهم، وفي هذا عدة بشارات لمريم مع ما تضمن من التنويه بذكر المسيح عليه السلام.\n                                    "
      },
      "originalText": "وَيُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗا وَمِنَ ٱلصَّٰلِحِينَ ٦٤"
    },
    {
      "number": 340,
      "text": "قَالَتْ رَبِّ أَنَّىٰ يَكُونُ لِي وَلَدٌ وَلَمْ يَمْسَسْنِي بَشَرٌ ۖ قَالَ كَذَٰلِكِ اللَّهُ يَخْلُقُ مَا يَشَاءُ ۚ إِذَا قَضَىٰ أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 47,
      "juz": 3,
      "manzil": 1,
      "page": 56,
      "ruku": 46,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَالَتۡ رَبِّ أَنَّىٰ يَكُونُ لِي وَلَدٞ وَلَمۡ يَمۡسَسۡنِي بَشَرٞۖ قَالَ كَذَٰلِكِ ٱللَّهُ يَخۡلُقُ مَا يَشَآءُۚ إِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ ٧٤\n                                    \n                                    \n                                    فلما سمعت بشارة الملائكة لها بذلك ، عن الله ، عز وجل ، قالت في مناجاتها : ( رب أنى يكون لي ولد ولم يمسسني بشر ) تقول : كيف يوجد هذا الولد مني وأنا لست بذات زوج ولا من عزمي أن أتزوج ، ولست بغيا ؟ حاشا لله . فقال لها الملك - عن الله ، عز وجل ، في جواب هذا السؤال - : ( كذلك الله يخلق ما يشاء ) أي : هكذا أمر الله عظيم ، لا يعجزه شيء . وصرح هاهنا بقوله : ( يخلق ) ولم يقل : \" يفعل \" كما في قصة زكريا ، بل نص هاهنا على أنه يخلق ، لئلا يبقى شبهة ، وأكد ذلك بقوله : ( إذا قضى أمرا فإنما يقول له كن فيكون ) أي : فلا يتأخر شيئا ، بل يوجد عقيب الأمر بلا مهلة ، كقوله تعالى : ( وما أمرنا إلا واحدة كلمح بالبصر ) [ القمر : 50 ] أي : إنما نأمر مرة واحدة لا مثنوية فيها ، فيكون ذلك الشيء سريعا كلمح بالبصر .\n                                    ",
        "qortoby": "قَالَتۡ رَبِّ أَنَّىٰ يَكُونُ لِي وَلَدٞ وَلَمۡ يَمۡسَسۡنِي بَشَرٞۖ قَالَ كَذَٰلِكِ ٱللَّهُ يَخۡلُقُ مَا يَشَآءُۚ إِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ ٧٤\n                                    \n                                    \n                                    قوله تعالى : قالت رب أنى يكون لي ولد ولم يمسسني بشر قال كذلك الله يخلق ما يشاء إذا قضى أمرا فإنما يقول له كن فيكون\nقوله تعالى : قالت رب أي يا سيدي . تخاطب جبريل عليه السلام ; لأنه لما تمثل لها قال لها : إنما أنا رسول ربك ليهب لك غلاما زكيا . فلما سمعت ذلك من قوله استفهمت عن طريق الولد فقالت : أنى يكون لي ولد ولم يمسسني بشر ؟ أي بنكاح . في سورتها ولم أك بغيا ذكرت هذا تأكيدا ; لأن قولها لم يمسسني بشر يشمل الحرام والحلال . تقول : العادة الجارية التي أجراها الله في خلقه أن الولد لا يكون إلا عن نكاح أو سفاح . وقيل : ما استبعدت من قدرة الله تعالى شيئا ، ولكن أرادت كيف يكون هذا الولد : أمن قبل زوج في المستقبل أم يخلقه الله ابتداء ؟\nفروي أن جبريل - عليه السلام - حين قال لها : كذلك الله يخلق ما يشاء ، قال كذلك قال ربك هو علي هين . نفخ في جيب درعها وكمها ; قال ابن جريج . قال ابن عباس : أخذ جبريل ردن قميصها بأصبعه فنفخ فيه فحملت من ساعتها بعيسى . وقيل غير ذلك على ما يأتي بيانه في سورتها إن شاء الله تعالى . وقال بعضهم : وقع نفخ جبريل في رحمها فعلقت بذلك . وقال بعضهم : لا يجوز أن يكون الخلق من نفخ جبريل لأنه يصير الولد بعضه من الملائكة وبعضه من الإنس ، ولكن سبب ذلك أن الله تعالى لما خلق آدم وأخذ الميثاق من ذريته فجعل بعض الماء في أصلاب الآباء وبعضه في أرحام الأمهات فإذا اجتمع الماءان صارا ولدا ، وأن الله تعالى جعل الماءين جميعا في مريم بعضه في رحمها وبعضه في صلبها ، فنفخ فيه جبريل لتهيج شهوتها ; لأن المرأة ما لم تهج شهوتها لا تحبل ، فلما هاجت شهوتها بنفخ جبريل وقع الماء الذي كان في صلبها في رحمها فاختلط الماءان فعلقت بذلك ; فذلك قوله تعالى : إذا قضى أمرا يعني إذا أراد أن يخلق خلقا فإنما يقول له كن ، وقد تقدم في \" البقرة \" القول فيه مستوفى .\n                                    ",
        "saadi": "قَالَتۡ رَبِّ أَنَّىٰ يَكُونُ لِي وَلَدٞ وَلَمۡ يَمۡسَسۡنِي بَشَرٞۖ قَالَ كَذَٰلِكِ ٱللَّهُ يَخۡلُقُ مَا يَشَآءُۚ إِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ ٧٤\n                                        \n                                        \n                                        \n                                        { قالت رب أنى يكون لي ولد ولم يمسسني بشر } والولد في العادة لا يكون إلا من مس البشر، وهذا استغراب منها، لا شك في قدرة الله تعالى: { قال كذلك الله يخلق ما يشاء إذا قضى أمرا فإنما يقول له كن فيكون } فأخبرها أن هذا أمر خارق للعادة، خلقه من يقول لكل أمر أراده: كن فيكون، فمن تيقن ذلك زال عنه الاستغراب والتعجب، ومن حكمة الباري تعالى أن تدرج بأخبار العباد من الغريب إلى ما هو أغرب منه، فذكر وجود يحيى بن زكريا بين أبوين أحدهما كبير والآخر عاقر، ثم ذكر أغرب من ذلك وأعجب، وهو وجود عيسى عليه السلام من أم بلا أب ليدل عباده أنه الفعال لما يريد وأنه ما شاء كان وما لم يشاء لم يكن.\n                                    "
      },
      "originalText": "قَالَتۡ رَبِّ أَنَّىٰ يَكُونُ لِي وَلَدٞ وَلَمۡ يَمۡسَسۡنِي بَشَرٞۖ قَالَ كَذَٰلِكِ ٱللَّهُ يَخۡلُقُ مَا يَشَآءُۚ إِذَا قَضَىٰٓ أَمۡرٗا فَإِنَّمَا يَقُولُ لَهُۥ كُن فَيَكُونُ ٧٤"
    },
    {
      "number": 341,
      "text": "وَيُعَلِّمُهُ الْكِتَابَ وَالْحِكْمَةَ وَالتَّوْرَاةَ وَالْإِنْجِيلَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 48,
      "juz": 3,
      "manzil": 1,
      "page": 56,
      "ruku": 46,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَيُعَلِّمُهُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ ٨٤\n                                    \n                                    \n                                    يقول تعالى - مخبرا عن تمام بشارة الملائكة لمريم بابنها عيسى ، عليه السلام - أن الله يعلمه ( الكتاب والحكمة ) الظاهر أن المراد بالكتاب هاهنا الكتابة . والحكمة تقدم الكلام على تفسيرها في سورة البقرة .\n( والتوراة والإنجيل ) فالتوراة : هو الكتاب الذي أنزله الله على موسى بن عمران . والإنجيل : الذي أنزله الله على عيسى عليهما السلام ، وقد كان [ عيسى ] عليه السلام ، يحفظ هذا وهذا .\n                                    ",
        "qortoby": "وَيُعَلِّمُهُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ ٨٤\n                                    \n                                    \n                                    قوله تعالى : ويعلمه الكتاب والحكمة والتوراة والإنجيل\nقوله تعالى : ويعلمه الكتاب والحكمة والتوراة والإنجيل قال ابن جريج : الكتاب الكتابة والخط . وقيل : هو كتاب غير التوراة والإنجيل علمه الله عيسى عليه السلام .\n                                    ",
        "saadi": "وَيُعَلِّمُهُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ ٨٤\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى عن منته العظيمة على عبده ورسوله عيسى عليه السلام، فقال { ويعلمه الكتاب } يحتمل أن يكون المراد جنس الكتاب، فيكون ذكر التوراة والإنجيل تخصيصا لهما، لشرفهما وفضلهما واحتوائهما على الأحكام والشرائع التي يحكم بها أنبياء بني إسرائيل والتعليم، لذلك يدخل فيه تعليم ألفاظه ومعانيه، ويحتمل أن يكون المراد بقوله { ويعلمه الكتاب } أي: الكتابة، لأن الكتابة من أعظم نعم الله على عباده ولهذا امتن تعالى على عباده بتعليمهم بالقلم في أول سورة أنزلها فقال { اقرأ باسم ربك الذي خلق خلق الإنسان من علق اقرأ وربك الأكرم الذي علم بالقلم } والمراد بالحكمة معرفة أسرار الشرع، ووضع الأشياء مواضعها، فيكون ذلك امتنانا على عيسى عليه السلام بتعليمه الكتابة والعلم والحكمة، وهذا هو الكمال للإنسان في نفسه.\n                                    "
      },
      "originalText": "وَيُعَلِّمُهُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ ٨٤"
    },
    {
      "number": 342,
      "text": "وَرَسُولًا إِلَىٰ بَنِي إِسْرَائِيلَ أَنِّي قَدْ جِئْتُكُمْ بِآيَةٍ مِنْ رَبِّكُمْ ۖ أَنِّي أَخْلُقُ لَكُمْ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ فَأَنْفُخُ فِيهِ فَيَكُونُ طَيْرًا بِإِذْنِ اللَّهِ ۖ وَأُبْرِئُ الْأَكْمَهَ وَالْأَبْرَصَ وَأُحْيِي الْمَوْتَىٰ بِإِذْنِ اللَّهِ ۖ وَأُنَبِّئُكُمْ بِمَا تَأْكُلُونَ وَمَا تَدَّخِرُونَ فِي بُيُوتِكُمْ ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 49,
      "juz": 3,
      "manzil": 1,
      "page": 56,
      "ruku": 46,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَرَسُولًا إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنِّي قَدۡ جِئۡتُكُم بِ‍َٔايَةٖ مِّن رَّبِّكُمۡ أَنِّيٓ أَخۡلُقُ لَكُم مِّنَ ٱلطِّينِ كَهَيۡ‍َٔةِ ٱلطَّيۡرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيۡرَۢا بِإِذۡنِ ٱللَّهِۖ وَأُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ وَأُحۡيِ ٱلۡمَوۡتَىٰ بِإِذۡنِ ٱللَّهِۖ وَأُنَبِّئُكُم بِمَا تَأۡكُلُونَ وَمَا تَدَّخِرُونَ فِي بُيُوتِكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ ٩٤\n                                    \n                                    \n                                    وقوله : ( ورسولا إلى بني إسرائيل ) أي : [ و ] يجعله رسولا إلى بني إسرائيل ، قائلا لهم : ( أني قد جئتكم بآية من ربكم أني أخلق لكم من الطين كهيئة الطير فأنفخ فيه فيكون طيرا بإذن الله ) وكذلك كان يفعل : يصور من الطين شكل طير ، ثم ينفخ فيه ، فيطير عيانا بإذن الله ، عز وجل ، الذي جعل هذا معجزة يدل على أن الله أرسله .\n( وأبرئ الأكمه ) قيل : هو الذي يبصر نهارا ولا يبصر ليلا . وقيل بالعكس . وقيل : هو الأعشى . وقيل : الأعمش . وقيل : هو الذي يولد أعمى . وهو أشبه ، لأنه أبلغ في المعجزة وأقوى في التحدي ) والأبرص ) معروف .\n( وأحيي الموتى بإذن الله ) قال كثير من العلماء : بعث الله كل نبي من الأنبياء بمعجزة تناسب أهل زمانه ، فكان الغالب على زمان موسى ، عليه السلام ، السحر وتعظيم السحرة . فبعثه الله بمعجزة بهرت الأبصار وحيرت كل سحار ، فلما استيقنوا أنها من عند العظيم الجبار انقادوا للإسلام ، وصاروا من الأبرار . وأما عيسى ، عليه السلام ، فبعث في زمن الأطباء وأصحاب علم الطبيعة ، فجاءهم من الآيات بما لا سبيل لأحد إليه ، إلا أن يكون مؤيدا من الذي شرع الشريعة . فمن أين للطبيب قدرة على إحياء الجماد ، أو على مداواة الأكمه والأبرص ، وبعث من هو في قبره رهين إلى يوم التناد ؟ وكذلك محمد صلى الله عليه وسلم بعثه [ الله ] في زمن الفصحاء والبلغاء ونحارير الشعراء ، فأتاهم بكتاب من الله ، عز وجل ، لو اجتمعت الإنس والجن على أن يأتوا بمثله ، أو بعشر سور من مثله ، أو بسورة من مثله لم يستطيعوا أبدا ، ولو كان بعضهم لبعض ظهيرا ، وما ذاك إلا لأن كلام الرب لا يشبهه كلام الخلق أبدا .\nوقوله : ( وأنبئكم بما تأكلون وما تدخرون في بيوتكم ) أي : أخبركم بما أكل أحدكم الآن ، وما هو مدخر [ له ] في بيته لغده ( إن في ذلك ) أي : في ذلك كله ( لآية لكم ) أي : على صدقي فيما جئتكم به . ( إن كنتم مؤمنين )\n                                    ",
        "qortoby": "وَرَسُولًا إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنِّي قَدۡ جِئۡتُكُم بِ‍َٔايَةٖ مِّن رَّبِّكُمۡ أَنِّيٓ أَخۡلُقُ لَكُم مِّنَ ٱلطِّينِ كَهَيۡ‍َٔةِ ٱلطَّيۡرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيۡرَۢا بِإِذۡنِ ٱللَّهِۖ وَأُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ وَأُحۡيِ ٱلۡمَوۡتَىٰ بِإِذۡنِ ٱللَّهِۖ وَأُنَبِّئُكُم بِمَا تَأۡكُلُونَ وَمَا تَدَّخِرُونَ فِي بُيُوتِكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ ٩٤\n                                    \n                                    \n                                    ورسولا أي ونجعله رسولا . أو يكلمهم رسولا . وقيل : هو معطوف على قوله ( وجيها ) . وقال الأخفش : وإن شئت جعلت الواو في قوله ورسولا مقحمة والرسول حالا للهاء ، تقديره ويعلمه الكتاب رسولا . وفي حديثأبي ذر الطويل ( وأول أنبياء بني إسرائيل موسى وآخرهم عيسى عليه السلام ) .\nأني أخلق لكم أي أصور وأقدر لكم . من الطين كهيئة الطير قرأ الأعرج وأبو جعفر ( كهية ) بالتشديد . الباقون بالهمز . والطير يذكر ويؤنث .\nفأنفخ فيه أي في الواحد منه أو منها أو في الطين فيكون طائرا . وطائر وطير مثل تاجر وتجر . قال وهب : كان يطير ما دام الناس ينظرون إليه فإذا غاب عن أعينهم سقط ميتا ليتميز فعل الخلق من فعل الله تعالى . وقيل : لم يخلق غير الخفاش لأنه أكمل الطير خلقا ليكون أبلغ في القدرة لأن لها ثديا وأسنانا وأذنا ، وهي تحيض وتطهر وتلد . ويقال : إنما طلبوا خلق خفاش لأنه أعجب من سائر الخلق ; ومن عجائبه أنه لحم ودم يطير بغير ريش ويلد كما يلد الحيوان ولا يبيض كما يبيض سائر الطيور ، فيكون له الضرع يخرج منه اللبن ، ولا يبصر في ضوء النهار ولا في ظلمة الليل ، وإنما يرى في ساعتين : بعد غروب الشمس ساعة وبعد طلوع الفجر ساعة قبل أن يسفر جدا ، ويضحك كما يضحك الإنسان ، ويحيض كما تحيض المرأة . ويقال : إن سؤالهم كان له على وجه التعنت فقالوا : اخلق لنا خفاشا واجعل فيه روحا إن كنت صادقا في مقالتك ; فأخذ طينا وجعل منه خفاشا ثم نفخ فيه فإذا هو يطير بين السماء والأرض ; وكان تسوية الطين والنفخ من عيسى والخلق من الله ، كما أن النفخ من جبريل والخلق من الله .\nقوله تعالى : وأبرئ الأكمه والأبرص وأحيي الموتى بإذن الله الأكمه : الذي يولد أعمى ; عن ابن عباس . وكذا قال أبو عبيدة قال : هو الذي يولد أعمى ; وأنشد لرؤبة :\nفارتد ارتداد الأكمه\nوقال ابن فارس : الكمه العمى يولد به الإنسان وقد يعرض . قال سويد :\nكمهت عيناه حتى ابيضتا\nمجاهد : هو الذي يبصر بالنهار ولا يبصر بالليل . عكرمة : هو الأعمش ، ولكنه في اللغة العمى ; يقال كمه يكمه كمها وكمهتها أنا إذا أعميتها . والبرص معروف وهو بياض يعتري الجلد ، والأبرص القمر ، وسام أبرص معروف ، ويجمع على الأبارص . وخص هذان بالذكر لأنهما عياءان . وكان الغالب على زمن عيسى عليه السلام الطب فأراهم الله المعجزة من جنس ذلك . وأحيي الموتى بإذن الله قيل : أحيا أربعة أنفس : العاذر : وكان صديقا له ، وابن العجوز وابنة العاشر وسام بن نوح ; فالله أعلم . فأما العاذر فإنه كان قد توفي قبل ذلك بأيام فدعا الله فقام بإذن الله وودكه يقطر فعاش وولد له ، وأما ابن العجوز فإنه مر به يحمل على سريره فدعا الله فقام ولبس ثيابه وحمل السرير على عنقه ورجع إلى أهله . وأما بنت العاشر فكان أتى عليها ليلة فدعا الله فعاشت بعد ذلك وولد لها ; فلما رأوا ذلك قالوا : إنك تحيي من كان موته قريبا فلعلهم لم يموتوا فأصابتهم سكتة فأحيي لنا سام بن نوح . فقال لهم : دلوني على قبره ، فخرج وخرج القوم معه ، حتى انتهى إلى قبره فدعا الله فخرج من قبره وقد شاب رأسه . فقال له عيسى : كيف شاب رأسك ولم يكن في زمانكم شيب ؟ فقال : يا روح الله ، إنك دعوتني فسمعت صوتا يقول : أجب روح الله ، فظننت أن القيامة قد قامت ، فمن هول ذلك شاب رأسي . فسأله عن النزع فقال : يا روح الله إن مرارة النزع لم تذهب عن حنجرتي ; وقد كان من وقت موته أكثر من أربعة آلاف سنة ، فقال للقوم : صدقوه فإنه نبي ; فآمن به بعضهم وكذبه بعضهم وقالوا : هذا سحر . وروي من حديث إسماعيل بن عياش قال : حدثني محمد بن طلحة عن رجل أن عيسى ابن مريم كان إذا أراد أن يحيي الموتى صلى ركعتين يقرأ في الأولى : تبارك الذي بيده الملك . وفي الثانية \" تنزيل السجدة \" فإذا فرغ حمد الله وأثنى عليه ثم دعا بسبعة أسماء : يا قديم يا خفي يا دائم يا فرد يا وتر يا أحد يا صمد ; ذكره البيهقي وقال : ليس إسناده بالقوي .\nقوله تعالى : وأنبئكم بما تأكلون وما تدخرون في بيوتكم إن في ذلك لآية لكم إن كنتم مؤمنين أي بالذي تأكلونه وما تدخرون . وذلك أنهم لما أحيا لهم الموتى طلبوا منه آية أخرى وقالوا : أخبرنا بما نأكل في بيوتنا وما ندخر للغد ; فأخبرهم فقال : يا فلان أنت أكلت كذا وكذا ، وأنت أكلت كذا وكذا وادخرت كذا وكذا ; فذلك قوله وأنبئكم الآية . وقرأ مجاهد والزهري والسختياني \" وما تذخرون \" بالذال المعجمة مخففا . وقال سعيد بن جبير وغيره : وكان يخبر الصبيان في الكتاب بما يدخرون حتى منعهم آباؤهم من الجلوس معه . قتادة : أخبرهم بما أكلوه من المائدة وما ادخروه منها خفية .\n                                    ",
        "saadi": "وَرَسُولًا إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنِّي قَدۡ جِئۡتُكُم بِ‍َٔايَةٖ مِّن رَّبِّكُمۡ أَنِّيٓ أَخۡلُقُ لَكُم مِّنَ ٱلطِّينِ كَهَيۡ‍َٔةِ ٱلطَّيۡرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيۡرَۢا بِإِذۡنِ ٱللَّهِۖ وَأُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ وَأُحۡيِ ٱلۡمَوۡتَىٰ بِإِذۡنِ ٱللَّهِۖ وَأُنَبِّئُكُم بِمَا تَأۡكُلُونَ وَمَا تَدَّخِرُونَ فِي بُيُوتِكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ ٩٤\n                                        \n                                        \n                                        \n                                        ثم ذكر له كمالا آخر وفضلا زائدا على ما أعطاه الله من الفضائل، فقال { ورسولا إلى بني إسرائيل } فأرسله الله إلى هذا الشعب الفاضل الذين هم أفضل العالمين في زمانهم يدعوهم إلى الله، وأقام له من الآيات ما دلهم أنه رسول الله حقا ونبيه صدقا ولهذا قال { أني قد جئتكم بآية من ربكم أني أخلق لكم من الطين } طيرا، أي: أصوره على شكل الطير { فأنفخ فيه فيكون طيرا بإذن الله } أي: طيرا له روح تطير بإذن الله { وأبرى الأكمه } وهو الذي يولد أعمى { والأبرص } بإذن الله { وأحيي الموتى بإذن الله وأنبئكم بما تأكلون وما تدخرون في بيوتكم إن في ذلك لآية لكم إن كنتم مؤمنين } وأي: آية أعظم من جعل الجماد حيوانا، وإبراء ذوي العاهات التي لا قدرة للأطباء في معالجتها، وإحياء الموتى، والإخبار بالأمور الغيبية، فكل واحدة من هذه الأمور آية عظيمة بمفردها، فكيف بها إذا اجتمعت وصدق بعضها بعضها؟ فإنها موجبة للإيقان وداعية للإيمان.\n                                    "
      },
      "originalText": "وَرَسُولًا إِلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنِّي قَدۡ جِئۡتُكُم بِ‍َٔايَةٖ مِّن رَّبِّكُمۡ أَنِّيٓ أَخۡلُقُ لَكُم مِّنَ ٱلطِّينِ كَهَيۡ‍َٔةِ ٱلطَّيۡرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيۡرَۢا بِإِذۡنِ ٱللَّهِۖ وَأُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ وَأُحۡيِ ٱلۡمَوۡتَىٰ بِإِذۡنِ ٱللَّهِۖ وَأُنَبِّئُكُم بِمَا تَأۡكُلُونَ وَمَا تَدَّخِرُونَ فِي بُيُوتِكُمۡۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ ٩٤"
    },
    {
      "number": 343,
      "text": "وَمُصَدِّقًا لِمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَلِأُحِلَّ لَكُمْ بَعْضَ الَّذِي حُرِّمَ عَلَيْكُمْ ۚ وَجِئْتُكُمْ بِآيَةٍ مِنْ رَبِّكُمْ فَاتَّقُوا اللَّهَ وَأَطِيعُونِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 50,
      "juz": 3,
      "manzil": 1,
      "page": 56,
      "ruku": 46,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمُصَدِّقٗا لِّمَا بَيۡنَ يَدَيَّ مِنَ ٱلتَّوۡرَىٰةِ وَلِأُحِلَّ لَكُم بَعۡضَ ٱلَّذِي حُرِّمَ عَلَيۡكُمۡۚ وَجِئۡتُكُم بِ‍َٔايَةٖ مِّن رَّبِّكُمۡ فَٱتَّقُواْ ٱللَّهَ وَأَطِيعُونِ ٠٥\n                                    \n                                    \n                                    ( ومصدقا لما بين يدي من التوراة ) أي : مقرر لهم ومثبت ( ولأحل لكم بعض الذي حرم عليكم ) فيه دلالة على أن عيسى ، عليه السلام ، نسخ بعض شريعة التوراة ، وهو الصحيح من القولين ، ومن العلماء من قال : لم ينسخ منها شيئا ، وإنما أحل لهم بعض ما كانوا يتنازعون فيه فأخطئوا ، فكشف لهم عن المغطى في ذلك ، كما قال في الآية الأخرى : ( ولأبين لكم بعض الذي تختلفون فيه ) [ الزخرف : 63 ] والله أعلم .\nثم قال : ( وجئتكم بآية من ربكم ) أي : بحجة ودلالة على صدقي فيما أقوله لكم . ( فاتقوا الله وأطيعون)\n                                    ",
        "qortoby": "وَمُصَدِّقٗا لِّمَا بَيۡنَ يَدَيَّ مِنَ ٱلتَّوۡرَىٰةِ وَلِأُحِلَّ لَكُم بَعۡضَ ٱلَّذِي حُرِّمَ عَلَيۡكُمۡۚ وَجِئۡتُكُم بِ‍َٔايَةٖ مِّن رَّبِّكُمۡ فَٱتَّقُواْ ٱللَّهَ وَأَطِيعُونِ ٠٥\n                                    \n                                    \n                                    ومصدقا لما بين يدي من التوراة ولأحل لكم بعض الذي حرم عليكم وجئتكم بآية من ربكم فاتقوا الله وأطيعون\n( ومصدقا ) عطف على قوله : ( ورسولا ) وقيل : المعنى وجئتكم مصدقا . لما بين يدي لما قبلي . ولأحل لكم فيه حذف ، أي ولأحل لكم جئتكم . بعض الذي حرم عليكم يعني من الأطعمة . قيل : إنما أحل لهم عيسى عليه السلام ما حرم عليهم بذنوبهم ولم يكن في التوراة ، نحو أكل الشحوم وكل ذي ظفر . وقيل : إنما أحل لهم أشياء حرمتها عليهم الأحبار ولم تكن في التوراة محرمة عليهم . قال أبو عبيدة : يجوز أن يكون ( بعض ) بمعنى كل ; وأنشد لبيد :\nتراك أمكنة إذا لم أرضها أو يرتبط بعض النفوس حمامها\nوهذا القول غلط عند أهل النظر من أهل اللغة ; لأن البعض والجزء لا يكونان بمعنى الكل في هذا الموضع ، لأن عيسى - صلى الله عليه وسلم - إنما أحل لهم أشياء مما حرمها عليهم موسى من أكل الشحوم وغيرها ولم يحل لهم القتل ولا السرقة ولا فاحشة . والدليل على هذا أنه روي عن قتادة أنه قال : جاءهم عيسى بألين مما جاء به موسى ، صلى الله عليهما وعلى نبينا ; لأن موسى جاءهم بتحريم الإبل وأشياء من الشحوم فجاءهم عيسى بتحليل بعضها . وقرأ النخعي \" بعض الذي حرم عليكم \" مثل كرم ، أي صار حراما . وقد يوضع البعض بمعنى الكل إذا انضمت إليه قرينة تدل عليه ; كما قال الشاعر :\nأبا منذر أفنيت فاستبق بعضنا حنانيك بعض الشر أهون من بعض\nيريد بعض الشر أهون من كله .\nوجئتكم بآية من ربكم إنما وحد وهي آيات لأنها جنس واحد في الدلالة على رسالته .\n                                    ",
        "saadi": "وَمُصَدِّقٗا لِّمَا بَيۡنَ يَدَيَّ مِنَ ٱلتَّوۡرَىٰةِ وَلِأُحِلَّ لَكُم بَعۡضَ ٱلَّذِي حُرِّمَ عَلَيۡكُمۡۚ وَجِئۡتُكُم بِ‍َٔايَةٖ مِّن رَّبِّكُمۡ فَٱتَّقُواْ ٱللَّهَ وَأَطِيعُونِ ٠٥\n                                        \n                                        \n                                        \n                                        { ومصدقا لما بين يدي من التوراة } أي: أتيت بجنس ما جاءت به التوراة وما جاء به موسى عليه السلام، وعلامة الصادق أن يكون خبره من جنس خبر الصادقين، يخبر بالصدق، ويأمر بالعدل من غير تخالف ولا تناقض، بخلاف من ادعى دعوى كاذبة، خصوصا أعظم الدعاوى وهي دعوى النبوة، فالكاذب فيها لابد أن يظهر لكل أحد كذب صاحبها وتناقضه ومخالفته لأخبار الصادقين وموافقته لأخبار الكاذبين، هذا موجب السنن الماضية والحكمة الإلهية والرحمة الربانية بعباده، إذ لا يشتبه الصادق بالكاذب في دعوى النبوة أبدا، بخلاف بعض الأمور الجزئية، فإنه قد يشتبه فيها الصادق بالكاذب، وأما النبوة فإنه يترتب عليها هداية الخلق أو ضلالهم وسعادتهم وشقاؤهم، ومعلوم أن الصادق فيها من أكمل الخلق، والكاذب فيها من أخس الخلق وأكذبهم وأظلمهم، فحكمة الله ورحمته بعباده أن يكون بينهما من الفروق ما يتبين لكل من له عقل، ثم أخبر عيسى عليه السلام أن شريعة الإنجيل شريعة فيها سهولة ويسرة فقال { ولأحل لكم بعض الذي حرم عليكم } فدل ذلك على أن أكثر أحكام التوراة لم ينسخها الإنجيل بل كان متمما لها ومقررا { وجئتكم بآية من ربكم } تدل على صدقي ووجوب اتباعي، وهي ما تقدم من الآيات، والمقصود من ذلك كله قوله { فاتقوا الله } بفعل ما أمر به وترك ما نهى عنه وأطيعوني فإن طاعة الرسول طاعة لله.\n                                    "
      },
      "originalText": "وَمُصَدِّقٗا لِّمَا بَيۡنَ يَدَيَّ مِنَ ٱلتَّوۡرَىٰةِ وَلِأُحِلَّ لَكُم بَعۡضَ ٱلَّذِي حُرِّمَ عَلَيۡكُمۡۚ وَجِئۡتُكُم بِ‍َٔايَةٖ مِّن رَّبِّكُمۡ فَٱتَّقُواْ ٱللَّهَ وَأَطِيعُونِ ٠٥"
    },
    {
      "number": 344,
      "text": "إِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۗ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 51,
      "juz": 3,
      "manzil": 1,
      "page": 56,
      "ruku": 46,
      "hizbQuarter": 22,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱللَّهَ رَبِّي وَرَبُّكُمۡ فَٱعۡبُدُوهُۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ ١٥\n                                    \n                                    \n                                    ( إن الله ربي وربكم فاعبدوه ) أي : أنا وأنتم سواء في العبودية له والخضوع والاستكانة إليه ) هذا صراط مستقيم )\n                                    ",
        "qortoby": "إِنَّ ٱللَّهَ رَبِّي وَرَبُّكُمۡ فَٱعۡبُدُوهُۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ ١٥\n                                    \n                                    \n                                    ",
        "saadi": "إِنَّ ٱللَّهَ رَبِّي وَرَبُّكُمۡ فَٱعۡبُدُوهُۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ ١٥\n                                        \n                                        \n                                        \n                                        { إن الله ربي وربكم فاعبدوه } استدل بتوحيد الربوبية الذي يقر به كل أحد على توحيد الإلهية الذي ينكره المشركون، فكما أن الله هو الذي خلقنا ورزقنا وأنعم علينا نعما ظاهرة وباطنة، فليكن هو معبودنا الذي نألهه بالحب والخوف والرجاء والدعاء والاستعانة وجميع أنواع العبادة، وفي هذا رد على النصارى القائلين بأن عيسى إله أو ابن الله، وهذا إقراره عليه السلام بأنه عبد مدبر مخلوق، كما قال { إني عبد الله آتاني الكتاب وجعلني نبيا } وقال تعالى: { وإذ قال الله يا عيسى ابن مريم أأنت قلت للناس اتخذوني وأمي إلهين من دون الله قال سبحانك ما يكون لي أن أقول ما ليس لي بحق إن كنت قلته فقد علمته } إلى قوله { ما قلت لهم إلا ما أمرتني به أن اعبدوا الله ربي وربكم } وقوله { هذا } أي: عبادة الله وتقواه وطاعة رسوله { صراط مستقيم } موصل إلى الله وإلى جنته، وما عدا ذلك فهي طرق موصلة إلى الجحيم.\n                                    "
      },
      "originalText": "إِنَّ ٱللَّهَ رَبِّي وَرَبُّكُمۡ فَٱعۡبُدُوهُۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ ١٥"
    },
    {
      "number": 345,
      "text": "۞ فَلَمَّا أَحَسَّ عِيسَىٰ مِنْهُمُ الْكُفْرَ قَالَ مَنْ أَنْصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ آمَنَّا بِاللَّهِ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 52,
      "juz": 3,
      "manzil": 1,
      "page": 56,
      "ruku": 46,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": " فَلَمَّآ أَحَسَّ عِيسَىٰ مِنۡهُمُ ٱلۡكُفۡرَ قَالَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشۡهَدۡ بِأَنَّا مُسۡلِمُونَ ٢٥\n                                    \n                                    \n                                    يقول تعالى : ( فلما أحس عيسى ) أي : استشعر منهم التصميم على الكفر والاستمرار على الضلال قال : ( من أنصاري إلى الله ) قال مجاهد : أي من يتبعني إلى الله ؟ وقال سفيان الثوري وغيره : من أنصاري مع الله ؟ وقول مجاهد أقرب .\nوالظاهر أنه أراد من أنصاري في الدعوة إلى الله ؟ كما كان النبي صلى الله عليه وسلم يقول في مواسم الحج ، قبل أن يهاجر : \" من رجل يؤويني على [ أن ] أبلغ كلام ربي ، فإن قريشا قد منعوني أن أبلغ كلام ربي \" حتى وجد الأنصار فآووه ونصروه ، وهاجر إليهم فآسوه ومنعوه من الأسود والأحمر . وهكذا عيسى ابن مريم ، انتدب له طائفة من بني إسرائيل فآمنوا به وآزروه ونصروه واتبعوا النور الذي أنزل معه . ولهذا قال تعالى مخبرا عنهم : ( قال الحواريون نحن أنصار الله آمنا بالله واشهد بأنا مسلمون . ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين ) الحواريون ، قيل : كانوا قصارين وقيل : سموا بذلك لبياض ثيابهم ، وقيل : صيادين . والصحيح أن الحواري الناصر ، كما ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم لما ندب الناس يوم الأحزاب ، فانتدب الزبير ، ثم ندبهم فانتدب الزبير [ ثم ندبهم فانتدب الزبير ] فقال : \" إن لكل نبي حواريا وحواري الزبير \" .\n                                    ",
        "qortoby": " فَلَمَّآ أَحَسَّ عِيسَىٰ مِنۡهُمُ ٱلۡكُفۡرَ قَالَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشۡهَدۡ بِأَنَّا مُسۡلِمُونَ ٢٥\n                                    \n                                    \n                                    قوله تعالى : فلما أحس عيسى منهم الكفر قال من أنصاري إلى الله قال الحواريون نحن أنصار الله آمنا بالله واشهد بأنا مسلمون\nقوله تعالى : فلما أحس عيسى منهم الكفر أي من بني إسرائيل . وأحس معناه علم ووجد قاله الزجاج . وقال أبو عبيدة : معنى ( أحس ) عرف ، وأصل ذلك وجود الشيء بالحاسة . والإحساس : العلم بالشيء ; قال الله تعالى : هل تحس منهم من أحد والحس القتل ; قال الله تعالى : إذ تحسونهم بإذنه . ومنه الحديث في الجراد ( إذا حسه البرد ) . منهم الكفر أي الكفر بالله . وقيل : سمع منهم كلمة الكفر . وقال الفراء : أرادوا قتله .\nقال من أنصاري إلى الله استنصر عليهم . قال السدي والثوري وغيرهما : المعنى مع الله ، فإلى بمعنى مع ; كقوله تعالى : ولا تأكلوا أموالهم إلى أموالكم ; أي مع ، والله أعلم . وقال الحسن : المعنى من أنصاري في السبيل إلى الله ; لأنه دعاهم إلى الله عز وجل . وقيل : المعنى من يضم نصرته إلى نصرة الله عز وجل . ( فإلى ) على هذين القولين على بابها ، وهو الجيد . وطلب النصرة ليحتمي بها من قومه ويظهر الدعوة ; عن الحسن ومجاهد . وهذه سنة الله في أنبيائه وأوليائه . وقد قال لوط : لو أن لي بكم قوة أو آوي إلى ركن شديد ; أي عشيرة وأصحاب ينصرونني . قال الحواريون نحن أنصار الله أي أنصار نبيه ودينه . والحواريون أصحاب عيسى عليه السلام ، وكانوا اثني عشر رجلا ; قاله الكلبي وأبو روق .\nواختلف في تسميتهم بذلك ; فقال ابن عباس : سموا بذلك لبياض ثيابهم ، وكانوا صيادين . ابن أبي نجيح وابن أرطاة : كانوا قصارين فسموا بذلك لتبييضهم الثياب . قال عطاء : أسلمت مريم عيسى إلى أعمال شتى ، وآخر ما دفعته إلى الحواريين وكانوا قصارين وصباغين ، فأراد معلم عيسى السفر فقال لعيسى : عندي ثياب كثيرة مختلفة الألوان وقد علمتك الصبغة فاصبغها . فطبخ عيسى حبا واحدا وأدخله جميع الثياب وقال : كوني بإذن الله على ما أريد منك . فقدم الحواري والثياب كلها في الحب فلما رآها قال : قد أفسدتها ; فأخرج عيسى ثوبا أحمر وأصفر وأخضر إلى غير ذلك مما كان على كل ثوب مكتوب عليه صبغة ; فعجب الحواري ، وعلم أن ذلك من الله ودعا الناس إليه فآمنوا به ; فهم الحواريون . قتادة والضحاك : سموا بذلك لأنهم كانوا خاصة الأنبياء . يريدان لنقاء قلوبهم . وقيل . كانوا ملوكا ، وذلك أن الملك صنع طعاما فدعا الناس إليه فكان عيسى على قصعة فكانت لا تنقص ، فقال الملك له : من أنت ؟ قال : عيسى ابن مريم . قال : إني أترك ملكي هذا وأتبعك . فانطلق بمن اتبعه معه ، فهم الحواريون ; قاله ابن عون . وأصل الحور في اللغة البياض ، وحورت الثياب بيضتها ، والحواري من الطعام ما حور ، أي بيض ، واحور ابيض ، والجفنة المحورة : المبيضة بالسنام ، والحواري أيضا الناصر ; قال رسول الله - صلى الله عليه وسلم - : لكل نبي حواري وحواريي الزبير . والحواريات : النساء لبياضهن ; وقال :\nفقل للحواريات يبكين غيرنا ولا تبكنا إلا الكلاب النوابح\n                                    ",
        "saadi": " فَلَمَّآ أَحَسَّ عِيسَىٰ مِنۡهُمُ ٱلۡكُفۡرَ قَالَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشۡهَدۡ بِأَنَّا مُسۡلِمُونَ ٢٥\n                                        \n                                        \n                                        \n                                        { فلما أحس عيسى منهم الكفر } أي: رأى منهم عدم الانقياد له، وقالوا هذا سحر مبين، وهموا بقتله وسعوا في ذلك { قال من أنصاري إلى الله } من يعاونني ويقوم معي بنصرة دين الله { قال الحواريون } وهم الأنصار { نحن أنصار الله } أي: انتدبوا معه وقاموا بذلك. وقالوا: { آمنا بالله } { فاكتبنا مع الشاهدين } أي: الشهادة النافعة، وهي الشهادة بتوحيد الله وتصديق رسوله مع القيام بذلك، فلما قاموا مع عيسى بنصر دين الله وإقامة شرعه آمنت طائفة من بني إسرائيل وكفرت طائفة، فاقتتلت الطائفتان فأيد الله الذين آمنوا بنصره على عدوهم فأصبحوا ظاهرين، فلهذا قال تعالى هنا { ومكروا } أي: الكفار بإرادة قتل نبي الله وإطفاء نوره { ومكر الله } بهم جزاء لهم على مكرهم { والله خير الماكرين } رد الله كيدهم في نحورهم، فانقلبوا خاسرين.\n                                    "
      },
      "originalText": "۞ فَلَمَّآ أَحَسَّ عِيسَىٰ مِنۡهُمُ ٱلۡكُفۡرَ قَالَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشۡهَدۡ بِأَنَّا مُسۡلِمُونَ ٢٥"
    }
  ]
}