{
  "number": 560,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 5230,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ۖ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 66,
        "name": "سورة التحريم",
        "englishName": "At-Tahrim",
        "englishNameTranslation": "The Prohibition",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 1,
      "juz": 28,
      "manzil": 7,
      "page": 560,
      "ruku": 494,
      "hizbQuarter": 224,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ١\n                                    \n                                    \n                                    اختلف في سبب نزول صدر هذه السورة فقيل نزلت في شأن مارية وكان رسول الله صلى الله عليه وسلم قد حرمها فنزل قوله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك تبتغي مرضات أزواجك\" الآية قال أبو عبدالرحمن النسائي أخبرنا إبراهيم بن يونس بن محمد حدثنا أبي حدثنا حماد بن سلمة عن ثابت عن أنس أن رسول الله صلى الله عليه وسلم كانت له أمة يطؤها فلم تزل به عائشة وحفصة حتى حرمها فأنزل الله عز وجل \"يا أيها النبي لم تحرم ما أحل الله لك\" إلى آخر الآية.\nوقال ابن جرير حدثني ابن عبدالرحيم البرقي حدثنا ابن أبي مريم ثنا أبو غسان حدثني زيد بن أسلم أن رسول الله صلى الله عليه وسلم أصاب أم إبراهيم في بيت بعض نسائه فقالت أي رسول الله في بيتي وعلى فراشي؟ فجعلها عليه حراما قالت أي رسول الله كيف يحرم عليك الحلال؟ فحلف لها بالله لا يصيبها فأنزل الله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك\" قال زيد بن أسلم فقوله أنت علي حرام لغو وهكذا روى عبدالرحمن بن زيد عن أبيه وقال ابن جرير أيضا حدثنا يونس ثنا ابن وهب عن مالك عن زيد بن أسلم قال: قال لها \"أنت علي حرام والله لا أطؤك\" وقال سفيان الثوري بن علية عن داود بن أبي هند عن الشعبي عن مسروق قال آلى رسول الله صلى الله عليه وسلم وحرم فعوتب في التحريم وأمر بالكفارة فى اليمين رواه ابن جرير وكذا روي عن قتادة وغيره عن الشعبي نفسه وكذا قال غير واحد من السلف منهم الضحاك والحسن وقتادة ومقاتل بن حيان وروى العوفي عن ابن عباس قال: قلت لعمر بن الخطاب من المرأتان؟ قال عائشة وحفصة وكان بدء الحديث في شأن أم إبراهيم مارية أصابها النبي صلى الله عليه وسلم في بيت حفصة في نوبتها فوجدت حفصة فقالت يا نبي الله لقد جئت إلي شيئا ما جئت إلى أحد من أزواجك في يومي وفي دوري وعلى فراشي قال \"ألا ترضين أن أحرمها فلا أقربها\" قالت بلى فحرمها وقال لها \"لا تذكري ذلك لأحد\" فذكرته لعائشة فأظهره الله عليه فأنزل الله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك تبتغي مرضات أزواجك\" الآيات كلها فبلغنا أن رسول الله صلى الله عليه وسلم كفر عن يمينه وأصاب جاريته وقال الهيثم بن كليب في مسنده ثنا أبو قلابة عبدالملك بن محمد الرقاشي ثنا مسلم بن إبراهيم ثنا جرير بن حازم عن أيوب عن نافع عن ابن عمر عن عمر قال: قال النبي صلى الله عليه وسلم لحفصة \"لا تخبري أحدا وإن أم إبراهيم علي حرام\" فقالت أتحرم ما أحل الله لك؟ قال \"فوالله لا أقربها\" قال فلم يقربها حتى أخبرت عائشة.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ١\n                                    \n                                    \n                                    سورة التحريم\nمدنية في قول الجميع\nوهي اثنتا عشرة آية . وتسمى سورة \" النبي \" .\nبسم الله الرحمن الرحيم\nياأيها النبي لم تحرم ما أحل الله لك تبتغي مرضاة أزواجك والله غفور رحيم\nقوله تعالى : يا أيها النبي لم تحرم ما أحل الله لك فيه خمس مسائل :\nالأولى : قوله تعالى : يا أيها النبي لم تحرم ما أحل الله لك ثبت في صحيح مسلم عن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش فيشرب عندها عسلا ، قالت فتواطأت أنا وحفصة أن أيتنا ما دخل عليها رسول الله صلى الله عليه وسلم فلتقل : إني أجد منك ريح مغافير ! أكلت مغافير ؟ فدخل على إحداهما فقالت له ذلك . فقال : \" بل شربت عسلا عند زينب بنت جحش ولن أعود له \" . فنزل : لم تحرم ما أحل الله لك إلى قوله إن تتوبا : ( لعائشة وحفصة ) ، وإذ أسر النبي إلى بعض أزواجه حديثا لقوله : \" بل شربت عسلا \" . وعنها أيضا قالت : كان رسول الله صلى الله عليه وسلم يحب الحلواء والعسل ، فكان إذا صلى العصر دار على نسائه فيدنو منهن ، فدخل على حفصة فاحتبس عندها أكثر مما كان يحتبس ، فسألت عن ذلك فقيل لي : أهدت لها امرأة من قومها عكة من عسل ، فسقت رسول الله صلى الله عليه وسلم منه شربة . فقلت : أما والله لنحتالن له ، فذكرت ذلك لسودة وقلت : إذا دخل عليك فإنه سيدنو منك فقولي له : يا رسول الله ، أكلت مغافير ؟ فإنه سيقول لك : لا . فقولي له : ما هذه الريح ؟ - وكان رسول الله صلى الله عليه وسلم يشتد عليه أن يوجد منه الريح - فإنه سيقول لك سقتني حفصة شربة عسل . فقولي له : جرست نحله العرفط . وسأقول ذلك له ، وقوليه أنت يا صفية . فلما دخل على سودة - قالت : تقول سودة : والله الذي لا إله إلا هو لقد كدت أن أبادئه بالذي قلت لي ، وإنه لعلى الباب ، فرقا منك . فلما دنا رسول الله صلى الله عليه وسلم قالت : يا رسول الله ، أكلت مغافير ؟ قال : \" لا \" . قالت : فما هذه الريح ؟ قال : \" سقتنيحفصة شربة عسل \" . قال : جرست نحله العرفط . فلما دخل علي قلت له مثل ذلك . ثم دخل على صفية فقالت بمثل ذلك . فلما دخل على حفصة قالت : يا رسول الله ، ألا أسقيك منه . قال : لا حاجة لي به . قالت : تقول سودة : سبحان الله ! والله لقد حرمناه . قالت : قلت لها اسكتي . ففي هذه الرواية أن التي شرب عندها العسل حفصة . وفي الأولى زينب . وروى ابن أبي مليكة عن ابن عباس أنه شربه عند سودة . وقد قيل : إنما هي أم سلمة ، رواه أسباط عن السدي . وقاله عطاء بن أبي مسلم . ابن العربي : وهذا كله جهل أو تصور بغير علم . فقال باقي نسائه حسدا وغيرة لمن شرب ذلك عندها : إنا لنجد منك ريح المغافير . والمغافير : بقلة أو صمغة متغيرة الرائحة ، فيها حلاوة . واحدها مغفور ، وجرست : أكلت . والعرفط : نبت له ريح كريح الخمر . وكان عليه السلام يعجبه أن يوجد منه الريح الطيبة أو يجدها ، ويكره الريح الخبيثة لمناجاة الملك . فهذا قول . وقول آخر : أنه أراد بذلك المرأة التي وهبت نفسها للنبي صلى الله عليه وسلم فلم يقبلها لأجل أزواجه ، قاله ابن عباس وعكرمة . والمرأة أم شريك . وقول ثالث : إن التي حرم مارية القبطية ، وكان قد أهداها له المقوقس ملك الإسكندرية . قال ابن إسحاق : هي من كورة أنصنا من بلد يقال له حفن فواقعها في بيت حفصة . روى الدارقطني عن ابن عباس عن عمر قال : دخل رسول الله صلى الله عليه وسلم بأم ولده مارية في بيت حفصة ، فوجدته حفصة معها - وكانت حفصة غابت إلى بيت أبيها - فقالت له : تدخلها بيتي ! ما صنعت بي هذا من بين نسائك إلا من هواني عليك . فقال لها : \" لا تذكري هذا لعائشة فهي علي حرام إن قربتها \" . قالت حفصة : وكيف تحرم عليك وهي جاريتك ؟ فحلف لها ألا يقربها . فقال النبي صلى الله عليه وسلم : \" لا تذكريه لأحد \" . فذكرته لعائشة ، فآلى لا يدخل على نسائه شهرا ، فاعتزلهن تسعا وعشرين ليلة ، فأنزل الله عز وجل لم تحرم ما أحل الله لك الآية .\nالثانية : أصح هذه الأقوال أولها . وأضعفها أوسطها . قال ابن العربي : أما ضعفه في السند فلعدم عدالة رواته ، وأما ضعفه في معناه فلأن رد النبي صلى الله عليه وسلم للموهوبة ليس تحريما لها ، لأن من رد ما وهب له لم يحرم عليه ، إنما حقيقة التحريم بعد التحليل . وأما من روى أنه حرم مارية القبطية فهو أمثل في السند وأقرب إلى المعنى ، لكنه لم يدون في الصحيح . وروي مرسلا . وقد روى ابن وهب عن مالك عن زيد بن أسلم قال : حرم رسول الله صلى الله عليه وسلم أم إبراهيم فقال : \" أنت علي حرام ، والله لا آتينك \" . فأنزل الله عز وجل في ذلك : يا أيها النبي لم تحرم ما أحل الله لك وروى مثله ابن القاسم عنه . وروى أشهب عن مالك قال : راجعت عمر امرأة من الأنصار في شيء فاقشعر من ذلك وقال : ما كان النساء هكذا ! قالت : بلى ، وقد كان أزواج النبي صلى الله عليه وسلم يراجعنه . فأخذ ثوبه فخرج إلى حفصة فقال لها : أتراجعين رسول الله صلى الله عليه وسلم ؟ قالت : نعم ، ولو أعلم أنك تكره ما فعلت . فلما بلغ عمر أن رسول الله صلى الله عليه وسلم هجر نساءه قال : رغم أنف حفصة . وإنما الصحيح أنه كان في العسل وأنه شربه عند زينب ، وتظاهرت عليه عائشة وحفصة فيه ، فجرى ما جرى فحلف ألا يشربه وأسر ذلك . ونزلت الآية في الجميع .\nالثالثة : قوله تعالى : \" لم تحرم \" إن كان النبي صلى الله عليه وسلم حرم ولم يحلف فليس ذلك بيمين عندنا . ولا يحرم قول الرجل : \" هذا علي حرام \" شيئا حاشا الزوجة . وقال أبو حنيفة : إذا أطلق حمل على المأكول والمشروب دون الملبوس ، وكانت يمينا توجب الكفارة . وقال زفر : هو يمين في الكل حتى في الحركة والكون . وعول المخالف على أن النبي صلى الله عليه وسلم حرم العسل فلزمته الكفارة . وقد قال الله تعالى : قد فرض الله لكم تحلة أيمانكم فسماه يمينا . ودليلنا قول الله تعالى : يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا ، وقوله تعالى : قل أرأيتم ما أنزل الله لكم من رزق فجعلتم منه حراما وحلالا قل آلله أذن لكم أم على الله تفترون فذم الله المحرم للحلال ولم يوجب عليه كفارة . قال الزجاج : ليس لأحد أن يحرم ما أحل الله . ولم يجعل لنبيه صلى الله عليه وسلم أن يحرم إلا ما حرم الله عليه . فمن قال لزوجته أو أمته : أنت علي حرام ; ولم ينو طلاقا ولا ظهارا فهذا اللفظ يوجب كفارة اليمين . ولو خاطب بهذا اللفظ جمعا من الزوجات والإماء فعليه كفارة واحدة . ولو حرم على نفسه طعاما أو شيئا آخر لم يلزمه بذلك كفارة عند الشافعي ومالك . وتجب بذلك كفارة عند ابن مسعود والثوري وأبي حنيفة .\nالرابعة : واختلف العلماء في الرجل يقول لزوجته : \" أنت علي حرام \" على ثمانية عشر قولا : أحدها : لا شيء عليه . وبه قال الشعبي ومسروق وربيعة وأبو سلمة وأصبغ . وهو عندهم كتحريم الماء والطعام ; قال الله تعالى : يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم والزوجة من الطيبات ومما أحل الله . وقال تعالى : ولا تقولوا لما تصف ألسنتكم الكذب هذا حلال وهذا حرام . وما لم يحرمه الله فليس لأحد أن يحرمه ، ولا أن يصير بتحريمه حراما . ولم يثبت عن رسول الله صلى الله عليه وسلم أنه قال لما أحله الله هو علي حرام . وإنما امتنع من مارية ليمين تقدمت منه وهو قوله : والله لا أقربها بعد اليوم فقيل له : لم تحرم ما أحل الله لك ; أي لم تمتنع منه بسبب اليمين . يعني أقدم عليه وكفر .\nوثانيها : أنها يمين يكفرها ; قاله أبو بكر الصديق وعمر بن الخطاب وعبد الله بن مسعود وابن عباس وعائشة - رضي الله عنهم - والأوزاعي ; وهو مقتضى الآية . قال سعيد بن جبير عن ابن عباس : إذا حرم الرجل عليه امرأته فإنما هي يمين يكفرها . وقال ابن عباس : لقد كان لكم في رسول الله أسوة حسنة ; يعني أن النبي صلى الله عليه وسلم كان حرم جاريته فقال الله تعالى : لم تحرم ما أحل الله لك إلى قوله تعالى قد فرض الله لكم تحلة أيمانكم فكفر عن يمينه وصير الحرام يمينا . خرجه الدارقطني .\nوثالثها : أنها تجب فيها كفارة وليست بيمين ; قاله ابن مسعود وابن عباس أيضا في إحدى روايتيه ، والشافعي في أحد قوليه ، وفي هذا القول نظر . والآية ترده على ما يأتي .\nورابعها : هي ظهار ; ففيها كفارة الظهار ، قاله عثمان وأحمد بن حنبل وإسحاق .\nوخامسها : أنه إن نوى الظهار وهو ينوي أنها محرمة كتحريم ظهر أمه كان ظهارا . وإن نوى تحريم عينها عليه بغير طلاق تحريما مطلقا وجبت كفارة يمين . وإن لم ينو شيئا فعليه كفارة يمين ، قاله الشافعي .\nوسادسها : أنها طلقة رجعية ، قاله عمر بن الخطاب والزهري وعبد العزيز بن أبي سلمة وابن الماجشون . وسابعها : أنها طلقة بائنة ، قاله حماد بن أبي سليمان وزيد بن ثابت . ورواه ابن خويز منداد عن مالك .\nوثامنها : أنها ثلاث تطليقات ، قاله علي بن أبي طالب وزيد بن ثابت أيضا وأبو هريرة .\nوتاسعها : هي في المدخول بها ثلاث ، وينوي في غير المدخول بها ، قاله الحسن وعلي بن زيد والحكم . وهو مشهور مذهب مالك .\nوعاشرها : هي ثلاث ; ولا ينوي بحال ولا في محل وإن لم يدخل ; قاله عبد الملك في المبسوط ، وبه قال ابن أبي ليلى .\nوحادي عشرها : هي في التي لم يدخل بها واحدة ، وفي التي دخل بها ثلاث ; قاله أبو مصعب ومحمد بن عبد الحكم .\nوثاني عشرها : أنه إن نوى الطلاق أو الظهار كان ما نوى . فإن نوى الطلاق فواحدة بائنة إلا أن ينوي ثلاثا . فإن نوى ثنتين فواحدة . فإن لم ينو شيئا كانت يمينا وكان الرجل موليا من امرأته ; قاله أبو حنيفة وأصحابه . وبمثله قال زفر ; إلا أنه قال : إذا نوى اثنتين ألزمناه .\nوثالث عشرها : أنه لا تنفعه نية الظهار وإنما يكون طلاقا ; قاله ابن القاسم .\nورابع عشرها : قال يحيى بن عمر : يكون طلاقا ; فإن ارتجعها لم يجز له وطؤها حتى يكفر كفارة الظهار .\nوخامس عشرها : إن نوى الطلاق فما أراد من أعداده . وإن نوى واحدة فهي رجعية . وهو قول الشافعي رضي الله عنه . وروي مثله عن أبي بكر وعمر وغيرهم من الصحابة والتابعين .\nوسادس عشرها : إن نوى ثلاثا فثلاثا ، وإن واحدة فواحدة . وإن نوى يمينا فهي يمين . وإن لم ينو شيئا فلا شيء عليه . وهو قول سفيان . وبمثله قال الأوزاعي وأبو ثور ; إلا أنهما قالا : إن لم ينو شيئا فهي واحدة .\nوسابع عشرها : له نيته ولا يكون أقل من واحدة ; قاله ابن شهاب . وإن لم ينو شيئا لم يكن شيء ; قاله ابن العربي . ورأيت لسعيد بن جبير وهو :\nالثامن عشر : أن عليه عتق رقبة وإن لم يجعلها ظهارا . ولست أعلم لها وجها ، ولا يبعد في المقالات عندي .\nقلت : قد ذكره الدارقطني في سننه عن ابن عباس فقال : حدثنا الحسين بن إسماعيل قال : حدثنا محمد بن منصور قال : حدثنا روح قال : حدثنا سفيان الثوري عن سالم الأفطس عن سعيد بن جبير عن ابن عباس أنه أتاه رجل فقال : إني جعلت امرأتي علي حراما . فقال : كذبت ! ليست عليك بحرام ; ثم تلا : يا أيها النبي لم تحرم ما أحل الله لك عليك أغلظ الكفارات : عتق رقبة . وقد قال جماعة من أهل التفسير : إنه لما نزلت هذه الآية كفر عن يمينه بعتق رقبة ، وعاد إلى مارية صلى الله عليه وسلم ; قاله زيد بن أسلم وغيره .\nالخامسة : قال علماؤنا : سبب الاختلاف في هذا الباب أنه ليس في كتاب الله ولا في سنة رسول الله صلى الله عليه وسلم نص ولا ظاهر صحيح يعتمد عليه في هذه المسألة ، فتجاذبها العلماء لذلك . فمن تمسك بالبراءة الأصلية فقال : لا حكم ، فلا يلزم بها شيء . وأما من قال إنها يمين ; فقال : سماها الله يمينا . وأما من قال : تجب فيها كفارة وليست بيمين ; فبناه على أحد أمرين : أحدهما أنه ظن أن الله تعالى أوجب الكفارة فيها وإن لم تكن يمينا . والثاني أن معنى اليمين عنده التحريم ، فوقعت الكفارة على المعنى . وأما من قال : إنها طلقة رجعية ; فإنه حمل اللفظ على أقل وجوهه ، والرجعية محرمة الوطء كذلك ; فيحمل اللفظ عليه . وهذا يلزم مالكا ، لقوله : إن الرجعية محرمة الوطء . وكذلك وجه من قال : إنها ثلاث ، فحمله على أكبر معناه وهو الطلاق الثلاث . وأما من قال : إنه ظهار ، فلأنه أقل درجات التحريم ، فإنه تحريم لا يرفع النكاح . وأما من قال : إنه طلقة بائنة ، فعول على أن الطلاق الرجعي لا يحرم المطلقة ، وأن الطلاق البائن يحرمها . وأما قول يحيى بن عمر فإنه احتاط بأن جعله طلاقا ، فلما ارتجعها احتاط بأن يلزمه الكفارة . ابن العربي : وهذا لا يصح ، لأنه جمع بين المتضادين ، فإنه لا يجتمع ظهار وطلاق في معنى لفظ واحد ، فلا وجه للاحتياط فيما لا يصح اجتماعه في الدليل .\nوأما من قال : إنه ينوى في التي لم يدخل بها ، فلأن الواحدة تبينها وتحرمها شرعا إجماعا . وكذلك قال من لم يحكم باعتبار نيته : إن الواحدة تكفي قبل الدخول في التحريم بالإجماع ، فيكفي أخذا بالأقل المتفق عليه . وأما من قال : إنه ثلاث فيهما ، فلأنه أخذ بالحكم الأعظم ، فإنه لو صرح بالثلاث لنفذت في التي لم يدخل بها نفوذها في التي دخل بها . ومن الواجب أن يكون المعنى مثله وهو التحريم . والله أعلم .\nوهذا كله في الزوجة . وأما في الأمة فلا يلزم فيها شيء من ذلك ، إلا أنه ينوي به العتق عند مالك . وذهب عامة العلماء إلى أن عليه كفارة يمين . ابن العربي : والصحيح أنها طلقة واحدة ، لأنه لو ذكر الطلاق لكان أقله وهو الواحدة إلا أن يعدده . كذلك إذا ذكر التحريم يكون أقله إلا أن يقيده بالأكثر ، مثل أن يقول : أنت علي حرام إلا بعد زوج ، فهذا نص على المراد .\nقلت : أكثر المفسرين على أن الآية نزلت في حفصة لما خلا النبي صلى الله عليه وسلم في بيتها بجاريته ; ذكره الثعلبي . وعلى هذا فكأنه قال : لا يحرم عليك ما حرمته على نفسك ولكن عليك كفارة يمين ، وإن كان في تحريم العسل والجارية أيضا . فكأنه قال : لم يحرم عليك ما حرمته ، ولكن ضممت إلى التحريم يمينا فكفر عن اليمين . وهذا صحيح ، فإن النبي صلى الله عليه وسلم حرم ثم حلف ، كما ذكره الدارقطني . وذكر البخاري معناه في قصة العسل عن عبيد بن عمير عن عائشة قالت : كان رسول الله صلى الله عليه وسلم يشرب عند زينب بنت جحش عسلا ويمكث عندها ، فتواطأت أنا وحفصة على أيتنا دخل عليها فلتقل : أكلت مغافير ؟ إني لأجد منك ريح مغافير ! قال : \" لا ، ولكن شربت عسلا ولن أعود له ، وقد حلفت ، لا تخبري بذلك أحدا \" . يبتغي مرضات أزواجه . فيعني بقوله : ولن أعود له على جهة التحريم . وبقوله : حلفت ؛ أي بالله ، بدليل أن الله تعالى أنزل عليه عند ذلك معاتبته على ذلك ، وحوالته على كفارة اليمين بقوله تعالى : يا أيها النبي لم تحرم ما أحل الله لك يعني العسل المحرم بقوله : لن أعود له . تبتغي مرضات أزواجك أي تفعل ذلك طلبا لرضاهن . والله غفور رحيم غفور لما أوجب المعاتبة ، رحيم برفع المؤاخذة . وقد قيل : إن ذلك كان ذنبا من الصغائر . والصحيح أنه معاتبة على ترك الأولى ، وأنه لم تكن له صغيرة ولا كبيرة .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ١\n                                        \n                                        \n                                        \n                                        هذا عتاب من الله لنبيه محمد صلى الله عليه وسلم، حين حرم على نفسه سريته \"مارية\" أو شرب العسل، مراعاة لخاطر بعض زوجاته، في قصة معروفة، فأنزل الله [تعالى] هذه الآيات { يَا أَيُّهَا النَّبِيُّ } أي: يا أيها الذي أنعم الله عليه بالنبوة والوحي والرسالة { لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ } من الطيبات، التي أنعم الله بها عليك وعلى أمتك.\n{ تَبْتَغِيَ } بذلك التحريم { مَرْضَاةَ أَزْوَاجِكَ وَاللَّهُ غَفُورٌ رَحِيمٌ } هذا تصريح بأن الله قد غفر لرسوله، ورفع عنه اللوم، ورحمه، وصار ذلك التحريم الصادر منه، سببًا لشرع حكم عام لجميع الأمة، فقال تعالى حاكما حكما عاما في جميع الأيمان\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ١"
    },
    {
      "number": 5231,
      "text": "قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ ۚ وَاللَّهُ مَوْلَاكُمْ ۖ وَهُوَ الْعَلِيمُ الْحَكِيمُ",
      "surah": {
        "number": 66,
        "name": "سورة التحريم",
        "englishName": "At-Tahrim",
        "englishNameTranslation": "The Prohibition",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 2,
      "juz": 28,
      "manzil": 7,
      "page": 560,
      "ruku": 494,
      "hizbQuarter": 224,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَدۡ فَرَضَ ٱللَّهُ لَكُمۡ تَحِلَّةَ أَيۡمَٰنِكُمۡۚ وَٱللَّهُ مَوۡلَىٰكُمۡۖ وَهُوَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ ٢\n                                    \n                                    \n                                    قال فأنزل الله تعالى \"قد فرض الله لكم تحلة أيمانكم\" وهذا إسناد صحيح ولم يخرجه أحد من أصحاب الكتب الستة وقد اختاره الحافظ الضياء المقدسي في كتابه المستخرج.\nوقال ابن جرير أيضا حدثني يعقوب بن إبراهيم ثنا ابن عليه ثنا هشام الدستوائي قال كتب إلي يحيى يحدث عن يعلى بن حكيم عن سعيد بن جبير أن ابن عباس كان يقول في الحرام يمين تكفرها وقال ابن عباس \"لقد كان لكم في رسول الله أسوة حسنة\" يعني أن رسول الله صلى الله عليه وسلم حرم جاريته فقال الله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك - إلى قوله - قد فرض الله لكم تحلة أيمانكم\" فكفر يمينه فصير الحرام يمينا.\nورواه البخاري عن معاذ بن فضالة عن هشام هو الدستوائي عن يحيى هو ابن أبي كثير عن ابن حكيم وهو يعلى عن سعيد بن جبير عن ابن عباس في الحرام يمين تكفر وقال ابن عباس \"لقد كان لكم في رسول الله أسوة حسنة\" ورواه مسلم من حديث هشام الدستوائي به وقال النسائي أنا عبدالله بن عبد الصمد بن علي ثنا مخلد بن يزيد ثنا سفيان عن سالم عن سعيد بن جبير عن ابن عباس قال أتاه رجل فقال إني جعلت امرأتي علي حراما قال كذبت ليس عليك بحرام ثم تلا هذه الآية \"يا أيها النبي لم تحرم ما أحل الله لك\" عليك أغلظ الكفارات عتق رقبة تفرد به النسائي من هذا الوجه بهذا اللفظ وقال الطبراني ثنا محمد بن زكريا ثنا عبدالله بن رجاء ثنا إسرائيل عن مسلم عن مجاهد عن ابن عباس في قوله تعالى \"يا أيها النبي لم تحرم ما أحل الله لك\" قال حرم رسول الله صلى الله عليه وسلم سريته ومن ههنا ذهب من ذهب من الفقهاء ممن قال بوجوب الكفارة على من حرم جاريته أو زوجته أو طعاما أو شرابا أو ملبسا أو شيئا من المباحات وهو مذهب الإمام أحمد وطائفة وذهب الشافعي إلى أنه لا تجب الكفارة فيما عدا الزوجة والجارية إذا حرم عينيهما أو أطلق التحريم فيهما في قول فأما إذا نوى بالتحريم طلاق الزوجة أو عتق الأمة نفذ فيهما وقال ابن أبي حاتم حدثني أبو عبدالله الطهراني أنا حفص بن عمر العدني أنا الحكم بن أبان أنا عكرمة عن ابن عباس قال نزلت هذه الآية \"يا أيها النبي لم تحرم ما أحل الله لك\" في المرأة التي وهبت نفسها للنبي صلى الله عليه وسلم وهذا قول غريب.\nوالصحيح أن ذلك كان في تحريمه العسل كما قال البخاري عند هذه الآية ثنا إبراهيم بن موسى أنا هشام بن يوسف عن ابن جريج عن عطاء عن عبيد بن عمير عن عائشة قالت كان النبي صلى الله عليه وسلم يشرب عسلا عند زينب بنت جحش ويمكث عندها فتواطأت أنا وحفصة على أيتنا دخل عليها فلتقل له: أكلت مغافير إني أجد منك ريح مغافير.\nقال \"لا ولكني كنت أشرب عسلا عند زينب بنت جحش فلن أعود له وقد حلفت لا تخبري بذلك أحدا\" \"تبتغي مرضاة أزواجك\" هكذا أورد هذا الحديث ههنا بهذا اللفظ.\nوقال في كتاب الأيمان والنذور ثنا الحسن بن محمد ثنا الحجاج عن ابن جريج قال زعم عطاء أنه سمع عبيد بن عمير يقول سمعت عائشة تزعم أن رسول الله صلى الله عليه وسلم كان يمكث عند زينب بنت جحش ويشرب عندها عسلا فتواطأت أنا وحفصة أن أيتنا دخل عليها النبي صلى الله عليه وسلم فلتقل له إني أجد منك ريح مغافير أكلت مغافير فدخل على إحداهما النبي صلى الله عليه وسلم فقالت ذلك له فقال: \"لا بل شربت عسلا عند زينب بنت جحش ولن أعود له\" فنزلت \"يا أيها النبي لم تحرم ما أحل الله لك - إلى قوله تعالى - إن تتوبا إلى الله فقد صغت قلوبكما\" لعائشة وحفصة.\n                                    ",
        "qortoby": "قَدۡ فَرَضَ ٱللَّهُ لَكُمۡ تَحِلَّةَ أَيۡمَٰنِكُمۡۚ وَٱللَّهُ مَوۡلَىٰكُمۡۖ وَهُوَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ ٢\n                                    \n                                    \n                                    قوله تعالى : قد فرض الله لكم تحلة أيمانكم والله مولاكم وهو العليم الحكيم\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : قد فرض الله لكم تحلة أيمانكم تحليل اليمين كفارتها . أي إذا أحببتم استباحة المحلوف عليه ، وهو قوله تعالى في سورة \" المائدة \" : فكفارته إطعام عشرة مساكين . ويتحصل من هذا أن من حرم شيئا من المأكول والمشروب لم يحرم عليه عندنا ، لأن الكفارة لليمين لا للتحريم على ما بيناه . وأبو حنيفة يراه يمينا في كل شيء ، ويعتبر الانتفاع المقصود فيما يحرمه ، فإذا حرم طعاما فقد حلف على أكله ، أو أمة فعلى وطئها ، أو زوجة فعلى الإيلاء منها إذا لم يكن له نية ، وإن نوى الظهار فظهار ، وإن نوى الطلاق فطلاق بائن . وكذلك إن نوى ثنتين أو ثلاثا . وإن قال : نويت الكذب دين فيما بينه وبين الله تعالى . ولا يدين في القضاء بإبطال الإيلاء . وإن قال : كل حلال عليه حرام ; فعلى الطعام والشراب إذا لم ينو ، وإلا فعلى ما نوى . ولا يراه الشافعي يمينا ولكن سببا في الكفارة في النساء وحدهن . وإن نوى الطلاق فهو رجعي عنده ، على ما تقدم بيانه . فإن حلف ألا يأكله حنث ويبر بالكفارة .\nالثانية : فإن حرم أمته أو زوجته فكفارة يمين ، كما في صحيح مسلم عن ابن عباس قال : إذا حرم الرجل عليه امرأته ، فهي يمين يكفرها . وقال : لقد كان لكم في رسول الله أسوة حسنة .\nالثالثة : قيل : إن النبي صلى الله عليه وسلم كفر عن يمينه . وعن الحسن : لم يكفر ، لأن النبي صلى الله عليه وسلم قد غفر له ما تقدم من ذنبه وما تأخر ، وكفارة اليمين في هذه السورة إنما أمر بها الأمة . والأول أصح ، وأن المراد بذلك النبي صلى الله عليه وسلم . ثم إن الأمة تقتدي به في ذلك . وقد قدمنا عن زيد بن أسلم أنه عليه السلام كفر بعتق رقبة . وعن مقاتل أن رسول الله صلى الله عليه وسلم أعتق رقبة في تحريم مارية . والله أعلم . وقيل : أي قد فرض الله لكم تحليل ملك اليمين ، فبين في قوله تعالى : ما كان على النبي من حرج فيما فرض الله له أي فيما شرعه له في النساء المحللات . أي حلل لكم ملك الأيمان ، فلم تحرم مارية على نفسك مع تحليل الله إياها لك . وقيل : تحلة اليمين الاستثناء ، أي فرض الله لكم الاستثناء المخرج عن اليمين . ثم عند قوم يجوز الاستثناء من الأيمان متى شاء وإن تحلل مدة . وعند المعظم لا يجوز إلا متصلا ، فكأنه قال : استثن بعد هذا فيما تحلف عليه . وتحلة اليمين تحليلها بالكفارة ، والأصل تحللة ، فأدغمت . وتفعلة من مصادر فعل ; كالتسمية والتوصية . فالتحلة تحليل اليمين . فكأن اليمين عقد ، والكفارة حل . وقيل : التحلة الكفارة ; أي إنها تحل للحالف ما حرم على نفسه ; أي إذا كفر صار كمن لم يحلف .\n\" والله مولاكم \" وليكم وناصركم بإزالة الحظر فيما تحرمونه على أنفسكم ، وبالترخيص لكم في تحليل أيمانكم بالكفارة ، وبالثواب على ما تخرجونه في الكفارة .\n                                    ",
        "saadi": "قَدۡ فَرَضَ ٱللَّهُ لَكُمۡ تَحِلَّةَ أَيۡمَٰنِكُمۡۚ وَٱللَّهُ مَوۡلَىٰكُمۡۖ وَهُوَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ ٢\n                                        \n                                        \n                                        \n                                        { قَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ } أي: قد شرع لكم، وقدر ما به تنحل أيمانكم قبل الحنث، وما به الكفارة بعد الحنث، وذلك كما في قوله تعالى: { يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ وَلَا تَعْتَدُوا } إلى أن قال: { فَكَفَّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلَاثَةِ أَيَّامٍ ذَلِكَ كَفَّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ } .\nفكل من حرم حلالًا عليه، من طعام أو شراب أو سرية، أو حلف يمينًا بالله، على فعل أو ترك، ثم حنث أو أراد الحنث، فعليه هذه الكفارة المذكورة، وقوله: { وَاللَّهُ مَوْلَاكُمْ } أي: متولي أموركم، ومربيكم أحسن تربية، في أمور دينكم ودنياكم، وما به يندفع عنكم الشر، فلذلك فرض لكم تحلة أيمانكم، لتبرأ ذممكم، { وَهُوَ الْعَلِيمُ الْحَكِيمُ } الذي أحاط علمه بظواهركم وبواطنكم، وهو الحكيم في جميع ما خلقه وحكم به، فلذلك شرع لكم من الأحكام، ما يعلم أنه موافق لمصالحكم، ومناسب لأحوالكم.\n                                    "
      },
      "originalText": "قَدۡ فَرَضَ ٱللَّهُ لَكُمۡ تَحِلَّةَ أَيۡمَٰنِكُمۡۚ وَٱللَّهُ مَوۡلَىٰكُمۡۖ وَهُوَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ ٢"
    },
    {
      "number": 5232,
      "text": "وَإِذْ أَسَرَّ النَّبِيُّ إِلَىٰ بَعْضِ أَزْوَاجِهِ حَدِيثًا فَلَمَّا نَبَّأَتْ بِهِ وَأَظْهَرَهُ اللَّهُ عَلَيْهِ عَرَّفَ بَعْضَهُ وَأَعْرَضَ عَنْ بَعْضٍ ۖ فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ مَنْ أَنْبَأَكَ هَٰذَا ۖ قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ",
      "surah": {
        "number": 66,
        "name": "سورة التحريم",
        "englishName": "At-Tahrim",
        "englishNameTranslation": "The Prohibition",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 3,
      "juz": 28,
      "manzil": 7,
      "page": 560,
      "ruku": 494,
      "hizbQuarter": 224,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعۡضِ أَزۡوَٰجِهِۦ حَدِيثٗا فَلَمَّا نَبَّأَتۡ بِهِۦ وَأَظۡهَرَهُ ٱللَّهُ عَلَيۡهِ عَرَّفَ بَعۡضَهُۥ وَأَعۡرَضَ عَنۢ بَعۡضٖۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتۡ مَنۡ أَنۢبَأَكَ هَٰذَاۖ قَالَ نَبَّأَنِيَ ٱلۡعَلِيمُ ٱلۡخَبِيرُ ٣\n                                    \n                                    \n                                    \"وإذ أسر النبي إلى بعض أزواجه حديثا\" لقوله \"بل شربت عسلا\" وقال إبراهيم بن موسى عن هشام \"ولن أعود له وقد حلفت فلا تخبري بذلك أحدا\" وهكذا رواه في كتاب الطلاق بهذا الإسناد ولفظه قريب منه.\nثم قال المغافير شبيه بالصمغ يكون في الرمث فيه حلاوة أغفر الرمث إذا ظهر فيه واحدها مغفور ويقال مغافير وهكذا قال الجوهري قال وقد يكون المغفور أيضا للعشر والثمام والسلم والطلح قال والرمث بالكسر مرعى من مراعي الإبل وهو من الحمض قال والعرفط شجر من العظاة ينضح المغفور.\nوقد روى مسلم هذا الحديث في كتاب الطلاق من صحيحه عن محمد بن حاتم عن حجاج عن ابن جريج أخبرني عطاء عن عبيد بن عمير عن عائشة به ولفظه كما أورده البخاري فى الأيمان والنذور ثم قال البخاري في كتاب الطلاق ثنا فروة بن أبي المغراء ثنا علي بن مسهر عن هشام بن عروة عن أبيه عن عائشة قالت: كان رسول الله صلى الله عليه وسلم يحب الحلوى والعسل وكان إذا انصرف من العصر دخل على نسائه فيدنو من إحداهن فدخل على حفصة بنت عمر فاحتبس أكثر ما كان يحتبس فغرت فسألت عن ذلك فقيل لي أهدت لها امرأة من قومها عكة عسل فسقت النبي صلى الله عليه وسلم منه شربة فقلت أما والله لنحتالن له فقلت لسودة بنت زمعة إنه سيدنو منك فإذا دنا منك فقولي أكلت مغافير فإنه سيقول لك لا فقولي له ما هذه الريح التي أجد فإنه سيقول لك سقتني حفصة شربة عسل فقولي جرست نحله العرفط وسأقول ذلك وقولي له أنت يا صفية ذلك قالت تقول سودة فوالله ما هو إلا أن قام على الباب فأردت أن أناديه بما أمرتني فرقا منك فلما دنا منها قالت له سودة يا رسول الله أكلت مغافير؟ قال \"لا\" قالت فما هذه الريح التي أجد منك؟ قال \"سقتني حفصة شربة عسل\" قالت جرست نحله العرفط فلما دار إلي قلت نحو ذلك فلما دار إلى صفية قالت له مثل ذلك فلما دار إلى حفصة قالت له يا رسول الله ألا أسقيك منه؟ قال \"لا حاجة لي فيه\" قالت تقول سودة والله لقد حرمناه قلت لها اسكتي هذا لفظ البخاري.\nوقد رواه مسلم عن سويد بن سعيد عن علي بن مسهر به وعن أبي كريب وهارون بن عبدالله والحسن بن بشر ثلاثتهم عن أبي أسامة حماد بن أسامة عن هشام بن عروة به وعنده: قالت وكان رسول الله صلى الله عليه وسلم يشتد عليه أن يوجد منه الريح يعني الريح الخبيثة ولهذا قلن له أكلت مغافير لأن ريحها فيه شيء فلما قال \"بل شربت عسلا\" قلن جرست نحله العرفط أي رعت نحله شجر العرفط الذي صمغه المغافير فلهذا ظهر ريحه في العسل الذي شربته قال الجوهري جرست النحل العرفط تجرس إذا أكلته ومنه قيل للنحل جوارس قال الشاعر تظل على الثمراء منها جوارس وقال الجرس والجرس الصوت الخفي ويقال سمعت جرس الطير إذا سمعت صوت مناقيرها على شيء تأكله وفي الحديث \"فيسمعون جرس طير الجنة\" قال الأصمعي كنت في مجلس شعبة قال فيسمعون جرش طير الجنة بالشين فقلت جرس فنظر إلي فقال: خذوها عنه فإنه أعلم بهذا منا.\nوالغرض أن هذا السياق فيه أن حفصة هي الساقية للعسل وهو من طريق هشام بن عروة عن أبيه عن خالته عن عائشة وفي طريق ابن جريج عن عطاء عن عبيد بن عمير عن عائشة أن زينب بنت جحش هي التي سقته العسل وأن عائشة وحفصة تواطأتا وتظاهرتا عليه فالله أعلم.\nوقد يقال أنهما واقعتان ولا بعد في ذلك إلا أن كونهما سببا لنزول هذه الآية فيه نظر والله أعلم.\nومما يدل على أن عائشة وحفصة رضي الله عنهما هما المتظاهرتان الحديث الذي رواه الإمام أحمد في مسنده حيث قال ثنا عبدالرزاق أنا معمر عن الزهري عن عبيدالله بن عبدالله بن أبي ثور عن ابن عباس قال: لم أزل حريصا على أن أسأل عمر عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين.\n                                    ",
        "qortoby": "وَإِذۡ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعۡضِ أَزۡوَٰجِهِۦ حَدِيثٗا فَلَمَّا نَبَّأَتۡ بِهِۦ وَأَظۡهَرَهُ ٱللَّهُ عَلَيۡهِ عَرَّفَ بَعۡضَهُۥ وَأَعۡرَضَ عَنۢ بَعۡضٖۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتۡ مَنۡ أَنۢبَأَكَ هَٰذَاۖ قَالَ نَبَّأَنِيَ ٱلۡعَلِيمُ ٱلۡخَبِيرُ ٣\n                                    \n                                    \n                                    قوله تعالى : وإذ أسر النبي إلى بعض أزواجه حديثا فلما نبأت به وأظهره الله عليه عرف بعضه وأعرض عن بعض فلما نبأها به قالت من أنبأك هذا قال نبأني العليم الخبير\nقوله تعالى : وإذ أسر النبي إلى بعض أزواجه حديثا أي واذكر إذ أسر النبي إلى حفصة حديثا يعني تحريم مارية على نفسه واستكتامه إياها ذلك . وقال الكلبي : أسر إليها أن أباك وأبا عائشة يكونان خليفتي على أمتي من بعدي ; وقاله ابن عباس . قال : أسر أمر الخلافة بعده إلى حفصة فذكرته حفصة . روى الدارقطني في سننه عن الكلبي عن أبي صالح عن ابن عباس في قوله تعالى : وإذ أسر النبي إلى بعض أزواجه حديثا قال : اطلعت حفصة على النبي صلى الله عليه وسلم مع أم إبراهيم فقال : \" لا تخبري عائشة \" وقال لها : \" إن أباك وأباها سيملكان أو سيليان بعدي فلا تخبري عائشة \" قال : فانطلقت حفصة فأخبرت عائشة فأظهره الله عليه ، فعرف بعضه وأعرض عن بعض . قال أعرض عن قوله : \" إن أباك وأباها يكونان بعدي \" . كره رسول الله صلى الله عليه وسلم أن ينشر ذلك في الناس .\nفلما نبأت به أي أخبرت به عائشة لمصافاة كانت بينهما ، وكانتا متظاهرتين على نساء النبي صلى الله عليه وسلم .\nوأظهره الله عليه أي أطلعه الله على أنها قد نبأت به . وقرأ طلحة بن مصرف \" فلما أنبأت \" وهما لغتان : أنبأ ونبأ .\nومعنى عرف بعضه وأعرض عن بعض عرف حفصة بعض ما أوحي إليه من أنها أخبرت عائشة بما نهاها عن أن تخبرها ، وأعرض عن بعض تكرما ; قاله السدي . وقال الحسن : ما استقصى كريم قط ، قال الله تعالى : عرف بعضه وأعرض عن بعض . وقال مقاتل : يعني أخبرها ببعض ما قالت لعائشة ، وهو حديث أم ولده ولم يخبرها ببعض وهو قول حفصة لعائشة : إن أبا بكر وعمر سيملكان بعده . وقراءة العامة عرف مشددا ، ومعناه ما ذكرناه . واختاره أبو عبيد وأبو حاتم ، يدل عليه قوله تعالى : وأعرض عن بعض أي لم يعرفها إياه . ولو كانت مخففة لقال في ضده وأنكر بعضا . وقرأ علي وطلحة بن مصرف وأبو عبد الرحمن السلمي والحسن وقتادة والكلبي والكسائي والأعمش عن أبي بكر \" عرف \" مخففة . قال عطاء : كان أبو عبد الرحمن السلمي إذا قرأ عليه الرجل عرف مشددة حصبه بالحجارة . قال الفراء : وتأويل قوله عز وجل : \" عرف بعضه \" بالتخفيف ، أي غضب فيه وجازى عليه ; وهو كقولك لمن أساء إليك : لأعرفن لك ما فعلت ، أي لأجازينك عليه . وجازاها النبي صلى الله عليه وسلم بأن طلقها طلقة واحدة . فقال عمر : لو كان في آل الخطاب خير لما كان رسول الله صلى الله عليه وسلم طلقك . فأمره جبريل بمراجعتها وشفع فيها . واعتزل النبي صلى الله عليه وسلم نساءه شهرا ، وقعد في مشربة مارية أم إبراهيم حتى نزلت آية التحريم على ما تقدم . وقيل : هم بطلاقها حتى قال له جبريل : \" لا تطلقها فإنها صوامة قوامة ، وإنها من نسائك في الجنة \" فلم يطلقها .\nفلما نبأها به أي أخبر حفصة بما أظهره الله عليه .\nقالت من أنبأك هذا يا رسول الله عني . فظنت أن عائشة أخبرته ، فقال عليه السلام :\nنبأني العليم الخبير أي الذي لا يخفى عليه شيء . وهذا سد مسد مفعولي \" أنبأ \" . و \" نبأ \" الأول تعدى إلى مفعولين ، و \" نبأ \" الثاني تعدى إلى مفعول واحد ، لأن نبأ وأنبأ إذا لم يدخلا على المبتدأ والخبر جاز أن يكتفى فيهما بمفعول واحد وبمفعولين ، فإذا دخلا على الابتداء والخبر تعدى كل واحد منهما إلى ثلاثة مفاعيل . ولم يجز الاقتصار على الاثنين دون الثالث ، لأن الثالث هو خبر المبتدأ في الأصل فلا يقتصر دونه ، كما لا يقتصر على المبتدأ دون الخبر .\n                                    ",
        "saadi": "وَإِذۡ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعۡضِ أَزۡوَٰجِهِۦ حَدِيثٗا فَلَمَّا نَبَّأَتۡ بِهِۦ وَأَظۡهَرَهُ ٱللَّهُ عَلَيۡهِ عَرَّفَ بَعۡضَهُۥ وَأَعۡرَضَ عَنۢ بَعۡضٖۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتۡ مَنۡ أَنۢبَأَكَ هَٰذَاۖ قَالَ نَبَّأَنِيَ ٱلۡعَلِيمُ ٱلۡخَبِيرُ ٣\n                                        \n                                        \n                                        \n                                        { وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا } قال كثير من المفسرين: هي حفصة أم المؤمنين رضي الله عنها، أسر لها النبي صلى الله عليه وسلم حديثًا، وأمر أن لا تخبر به أحدًا، فحدثت به عائشة رضي الله عنهما، وأخبره الله بذلك الخبر الذي أذاعته، فعرفها صلى الله عليه وسلم، ببعض ما قالت، وأعرض عن بعضه، كرمًا منه صلى الله عليه وسلم، وحلمًا، فـ { قَالَتِ } له: { مَنْ أَنْبَأَكَ هَذَا } الخبر الذي لم يخرج منا؟ { قَالَ نَبَّأَنِيَ الْعَلِيمُ الْخَبِيرُ } الذي لا تخفى عليه خافية، يعلم السر وأخفى.\n                                    "
      },
      "originalText": "وَإِذۡ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعۡضِ أَزۡوَٰجِهِۦ حَدِيثٗا فَلَمَّا نَبَّأَتۡ بِهِۦ وَأَظۡهَرَهُ ٱللَّهُ عَلَيۡهِ عَرَّفَ بَعۡضَهُۥ وَأَعۡرَضَ عَنۢ بَعۡضٖۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتۡ مَنۡ أَنۢبَأَكَ هَٰذَاۖ قَالَ نَبَّأَنِيَ ٱلۡعَلِيمُ ٱلۡخَبِيرُ ٣"
    },
    {
      "number": 5233,
      "text": "إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا ۖ وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ ۖ وَالْمَلَائِكَةُ بَعْدَ ذَٰلِكَ ظَهِيرٌ",
      "surah": {
        "number": 66,
        "name": "سورة التحريم",
        "englishName": "At-Tahrim",
        "englishNameTranslation": "The Prohibition",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 4,
      "juz": 28,
      "manzil": 7,
      "page": 560,
      "ruku": 494,
      "hizbQuarter": 224,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن تَتُوبَآ إِلَى ٱللَّهِ فَقَدۡ صَغَتۡ قُلُوبُكُمَاۖ وَإِن تَظَٰهَرَا عَلَيۡهِ فَإِنَّ ٱللَّهَ هُوَ مَوۡلَىٰهُ وَجِبۡرِيلُ وَصَٰلِحُ ٱلۡمُؤۡمِنِينَۖ وَٱلۡمَلَٰٓئِكَةُ بَعۡدَ ذَٰلِكَ ظَهِيرٌ ٤\n                                    \n                                    \n                                    قال الله تعالى \"إن تتوبا إلى الله فقد صغت قلوبكما\" حتى حج عمر وحججت معه فلما كان ببعض الطريق عدل عمر وعدلت معه بالإداوة فتبرز ثم أتاني فسكبت على يديه فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله تعالى \"إن تتوبا إلى الله فقد صغت قلوبكما\" فقال عمر: واعجبا لك يا ابن عباس قال الزهري: كره والله ما سأله عنه ولم يكتمه قال هي عائشة وحفصة قال ثم أخذ يسوق الحديث قال: كنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم: قال وكان منزلي في دار أمية بن زيد بالعوالي قال فغضبت يوما على امرأتي فإذا هي تراجعني فأنكرت أن تراجعني فقالت ما تنكر أن أراجعك؟ فوالله إن أزواج رسول الله صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل قال فانطلقت فدخلت على حفصة فقلت أتراجعين رسول الله صلى الله عليه وسلم؟ قالت نعم.\nقلت: وتهجره إحد اليوم إلى الليل؟ قالت نعم قلت قد خاب من فعل ذلك منكن وخسر أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله فإذا هي قد هلكت لا تراجعي رسول الله صلى الله عليه وسلم ولا تسأليه شيئا وسليني من مالي ما بدالك ولا يغرنك إن كانت جارتك هي أوسم - أي أجمل - وأحب إلى رسول الله صلى الله عليه وسلم منك يريد عائشة قال - وكان لي جار من الأنصار وكنا نتناوب النزول إلى رسول الله صلى الله عليه وسلم ينزل يوما وأنزل يوما فيأتيني بخبر الوحي وغيره وآتيه بمثل ذلك وقال وكنا نتحدث أن غسان تنعل الخيل لتغزونا فنزل صاحبي يوما ثم أتى عشاء فضرب بابي ثم ناداني فخرجت إليه فقال حدث أمر عظيم فقلت وما ذاك أجاءت غسان؟ قال لا بل أعظم من ذلك وأطول طلق رسول الله صلى الله عليه وسلم نساءه فقلت قد خابت حفصة وخسرت قد كنت أظن هذا كائنا حتى إذا صليت الصبح شددت علي ثيابي ثم نزلت فدخلت على حفصة وهي تبكي فقلت أطلقكن رسول الله صلى الله عليه وسلم؟ فقالت لا أدري هو هذا معتزل في هذه المشربة فأتيت غلاما له أسود فقلت استأذن لعمر فدخل الغلام ثم خرج إلي فقال له فصمت فانطلقت حتى أتيت المنبر فإذا عنده رهط جلوس يبكي بعضهم فجلست عنده قليلا ثم غلبني ما أجد فأتيت الغلام فقلت: استأذن لعمر فدخل ثم خرج إلي فقال قد ذكرتك له فصمت فخرجت فجلست إلى المنبر ثم غلبني ما أجد فأتيت الغلام فقلت استأذن لعمر فدخل ثم خرج إلي فقال: قد ذكرتك له فصمت فوليت مدبرا فإذا الغلام يدعوني فقال ادخل قد أذن لك فدخلت فسلمت على رسول الله صلى الله عليه وسلم فإذا هو متكئ على رمال حصير- قال الإمام أحمد: وحدثناه يعقوب في حديث صالح قال رمال حصير - وقد أثر في جنبه فقلت: أطلقت يا رسول الله نساءك؟ فرفع رأسه إلي وقال \"لا\" فقلت الله أكبر ولو رأيتنا يا رسول الله وكنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فغضبت علي امرأتي يوما فإذا هي تراجعني فأنكرت أن تراجعني فقالت ما تنكر أن أراجعك؟ فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل فقلت قد خاب من فعل ذلك منكن وخسرت أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله فإذا هي قد هلكت فتبسم رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد دخلت على حفصة فقلت لا يغرنك إن كانت جارتك هي أوسم أو أحب إلى رسول الله صلى الله عليه وسلم منك فتبسم أخرى فقلت أستأنس يا رسول الله؟ قال \"نعم\" فجلست فرفعت رأسي في البيت فوالله ما رأيت في البيت شيئا يرد البصر إلا أهب مقامة فقلت أدع الله يا رسول الله أن يوسع على أمتك فقد وسع على فارس والروم وهم لا يعبدون الله فاستوى جالسا وقال \"أفي شك أنت يا ابن الخطاب؟ أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا\" فقلت استغفر لي يا رسول الله وكان أقسم أن لا يدخل عليهن شهرا من شدة موجدته عليهن حتى عاتبه الله عز وجل وقد رواه البخاري ومسلم والترمذي والنسائي من طرق عن الزهري به وأخرجه الشيخان من حديث يحيى بن سعيد الأنصاري عن سعيد بن جبير عن ابن عباس قال: مكثت سنة أريد أن أسأل عمر بن الخطاب عن آية فما أستطيع أن أسأله هيبة له حتى خرج حاجا فخرجت معه فلما رجعنا وكنا ببعض الطريق عدل إلى الأراك لحاجة له قال فوقفت حتى فرغ ثم سرت معه فقلت يا أمير المؤمنين من اللتان تظاهرتا على النبي صلى الله عليه وسلم؟ هذا لفظ البخاري ولمسلم من المرأتان اللتان قال الله تعالى \"وإن تظاهرا عليه\" قال عائشة وحفصة ثم ساق الحديث بطوله ومنهم من اختصره.\nوقال مسلم أيضا حدثني زهير بن حرب حدثنا عمر بن يونس الحنفي ثنا عكرمة بن عمار عن سماك بن الوليد أبي زميل حدثني عبدالله بن عباس حدثني عمر بن الخطاب قال: لما اعتزل نبي الله صلى الله عليه وسلم نساءه دخلت المسجد فإذا الناس ينكتون بالحصى ويقولون طلق رسول الله صلى الله عليه وسلم نساءه وذلك قبل أن يؤمر بالحجاب فقلت لأعلمن ذلك اليوم فذكر الحديث في دخوله على عائشة وحفصة ووعظه إياهما إلى أن قال فدخلت فإذا أنا برباح غلام رسول الله صلى الله عليه وسلم على أسكفة المشربة فناديت فقلت يا رباح استأذن لي على رسول الله صلى الله عليه وسلم فذكر نحو ما تقدم - إلى أن قال - فقلت يا رسول الله ما يشق عليك من أمر النساء فإن كنت طلقتهن فإن الله معك وملائكته وجبريل وميكال وأنا وأبو بكر والمؤمنون معك وقلما تكلمت - وأحمد الله - بكلام إلا رجوت أن يكون الله يصدق قولي.\n                                    ",
        "qortoby": "إِن تَتُوبَآ إِلَى ٱللَّهِ فَقَدۡ صَغَتۡ قُلُوبُكُمَاۖ وَإِن تَظَٰهَرَا عَلَيۡهِ فَإِنَّ ٱللَّهَ هُوَ مَوۡلَىٰهُ وَجِبۡرِيلُ وَصَٰلِحُ ٱلۡمُؤۡمِنِينَۖ وَٱلۡمَلَٰٓئِكَةُ بَعۡدَ ذَٰلِكَ ظَهِيرٌ ٤\n                                    \n                                    \n                                    قوله تعالى : إن تتوبا إلى الله فقد صغت قلوبكما وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير\nقوله تعالى : إن تتوبا إلى الله يعني حفصة وعائشة ، حثهما على التوبة على ما كان منهما من الميل إلى خلاف محبة رسول الله صلى الله عليه وسلم .\nفقد صغت قلوبكما أي زاغت ومالت عن الحق . وهو أنهما أحبتا ما كره النبي صلى الله عليه وسلم من اجتناب جاريته واجتناب العسل ، وكان عليه السلام يحب العسل والنساء . قال ابن زيد : مالت قلوبهما بأن سرهما أن يحتبس عن أم ولده ، فسرهما ما كرهه رسول الله صلى الله عليه وسلم . وقيل : فقد مالت قلوبكما إلى التوبة . وقال : فقد صغت قلوبكما ولم يقل : فقد صغى قلباكما ، ومن شأن العرب إذا ذكروا الشيئين ، من اثنين جمعوهما ، لأنه لا يشكل . وقد مضى هذا المعنى في \" المائدة \" في قوله تعالى : فاقطعوا أيديهما . وقيل : كلما ثبتت الإضافة فيه مع التثنية فلفظ الجمع أليق به ، لأنه أمكن وأخف . وليس قوله : فقد صغت قلوبكما جزاء للشرط ، لأن هذا الصغو كان سابقا ، فجواب الشرط محذوف للعلم به . أي إن تتوبا كان خيرا لكما ، إذ قد صغت قلوبكما .\nقوله تعالى : وإن تظاهرا عليه أي تتظاهرا وتتعاونا على النبي صلى الله عليه وسلم بالمعصية والإيذاء . وفي صحيح مسلم عن ابن عباس قال : مكثت سنة وأنا أريد أن أسأل عمر بن الخطاب عن آية فما أستطيع أن أسأله هيبة له ، حتى خرج حاجا فخرجت معه ، فلما رجع فكنا ببعض الطريق عدل إلى الأراك لحاجة له ، فوقفت حتى فرغ ، ثم سرت معه فقلت : يا أمير المؤمنين ، من اللتان تظاهرتا على رسول الله صلى الله عليه وسلم من أزواجه ؟ فقال : تلك حفصة وعائشة . قال : فقلت له : والله إن كنت لأريد أن أسألك عن هذا منذ سنة فما أستطيع هيبة لك . قال : فلا تفعل ، ما ظننت أن عندي من علم فسلني عنه ، فإن كنت أعلمه أخبرتك . . . وذكر الحديث .\nفإن الله هو مولاه أي وليه وناصره ، فلا يضره ذلك التظاهر منهما .\nوجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير قال عكرمة وسعيد بن جبير : أبو بكر وعمر ، لأنهما أبوا عائشة وحفصة ، وقد كانا عونا له عليهما . وقيل : صالح المؤمنين علي رضي الله عنه . وقيل : خيار المؤمنين . وصالح : اسم جنس كقوله تعالى : والعصر إن الإنسان لفي خسر ، قاله الطبري . وقيل : صالح المؤمنين هم الأنبياء ، قاله العلاء بن زيادة وقتادة وسفيان . وقال ابن زيد : هم الملائكة . السدي : هم أصحاب محمد صلى الله عليه وسلم . وقيل : صالح المؤمنين ليس لفظ الواحد وإنما هو صالحو المؤمنين : فأضاف الصالحين إلى المؤمنين ، وكتب بغير واو على اللفظ لأن لفظ الواحد والجمع واحد فيه . كما جاءت أشياء في المصحف متنوع فيها حكم اللفظ دون وضع الخط . وفي صحيح مسلم عن ابن عباس قال : حدثني عمر بن الخطاب رضي الله عنه قال : لما اعتزل نبي الله صلى الله عليه وسلم نساءه قال دخلت المسجد فإذا الناس ينكتون بالحصى ويقولون : طلق رسول الله صلى الله عليه وسلم نساءه - وذلك قبل أن يؤمرن بالحجاب - فقال عمر : فقلت لأعلمن ذلك اليوم ، قال : فدخلت على عائشة فقلت : يا بنت أبي بكر ، أقد بلغ من شأنك أن تؤذي رسول الله صلى الله عليه وسلم ! فقالت : مالي ومالك يا ابن الخطاب ! عليك بعيبتك ! قال : فدخلت على حفصة بنت عمر فقلت لها : يا حفصة ، أقد بلغ من شأنك أن تؤذي رسول الله صلى الله عليه وسلم ! والله لقد علمت أن رسول الله صلى الله عليه وسلم لا يحبك ، ولولا أنا لطلقك رسول الله صلى الله عليه وسلم . فبكت أشد البكاء ، فقلت لها : أين رسول الله صلى الله عليه وسلم ؟ قالت : هو في خزانته في المشربة . فدخلت فإذا أنا برباح غلام رسول الله صلى الله عليه وسلم قاعدا على أسكفة المشربة مدل رجليه على نقير من خشب ، وهو جذع يرقى عليه رسول الله صلى الله عليه وسلم وينحدر . فناديت : يا رباح ، استأذن لي عندك على رسول الله ، فنظر رباح إلى الغرفة ثم نظر إلي فلم يقل شيئا . ثم قلت : يا رباح ، استأذن لي عندك على رسول الله صلى الله عليه وسلم ، فنظر رباح إلى الغرفة ثم نظر إلي فلم يقل شيئا . ثم رفعت صوتي فقلت : يا رباح ، استأذن لي عندك على رسول الله صلى الله عليه وسلم ، فإني أظن أن رسول الله صلى الله عليه وسلم ظن أني جئت من أجل حفصة ، والله لئن أمرني رسول الله صلى الله عليه وسلم بضرب عنقها لأضربن عنقها ، ورفعت صوتي فأومأ إلي أن ارقه ; فدخلت على رسول الله صلى الله عليه وسلم وهو مضطجع على حصير ، فجلست فأدنى عليه إزاره وليس عليه غيره ; وإذا الحصير قد أثر في جنبه ، فنظرت ببصري في خزانة رسول الله صلى الله عليه وسلم فإذا أنا بقبضة من شعير نحو الصاع ، ومثلها قرظا في ناحية الغرفة ; وإذا أفيق معلق - قال - فابتدرت عيناي . قال : \" ما يبكيك يا ابن الخطاب ؟ \" قلت : يا نبي الله ، ومالي لا أبكي وهذا الحصير قد أثر في جنبك ، وهذه خزانتك لا أرى فيها إلا ما أرى ! وذاك قيصر وكسرى في الثمار والأنهار وأنت رسول الله صلى الله عليه وسلم وصفوته ، وهذه خزانتك ! فقال : \" يا ابن الخطاب ألا ترضى أن تكون لنا الآخرة ولهم الدنيا \" . قلت : بلى . قال : ودخلت عليه حين دخلت وأنا أرى في وجهه الغضب ، فقلت : يا رسول الله ، ما يشق عليك من شأن النساء ; فإن كنت طلقتهن فإن الله معك وملائكته وجبريل وميكائيل ، وأنا وأبو بكر والمؤمنون معك . وقلما تكلمت - وأحمد الله - بكلام إلا رجوت أن يكون الله عز وجل يصدق قولي الذي أقول ، ونزلت هذه الآية ، آية التخيير : عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن . وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير . وكانت عائشة بنت أبي بكر وحفصة تظاهران على سائر نساء رسول الله صلى الله عليه وسلم . فقلت : يا رسول الله ، أطلقتهن ؟ قال : \" لا \" . قلت : يا رسول الله ، إني دخلت المسجد والمسلمون ينكتون بالحصى يقولون : طلق رسول الله صلى الله عليه وسلم نساءه أفأنزل فأخبرهم أنك لم تطلقهن ؟ قال : \" نعم إن شئت \" . فلم أزل أحدثه حتى تحسر الغضب عن وجهه ، وحتى كشر فضحك ، وكان من أحسن الناس ثغرا . ثم نزل نبي الله صلى الله عليه وسلم ونزلت ; فنزلت أتشبث بالجذع ، ونزل رسول الله صلى الله عليه وسلم كأنما يمشي على الأرض ما يمسه بيده . فقلت : يا رسول الله ، إنما كنت في الغرفة تسعا وعشرين . قال : \" إن الشهر يكون تسعا وعشرين \" فقمت على باب المسجد فناديت بأعلى صوتي : لم يطلق رسول الله صلى الله عليه وسلم نساءه . ونزلت هذه الآية : وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ولو ردوه إلى الرسول وإلى أولي الأمر منهم لعلمه الذين يستنبطونه منهم . فكنت أنا استنبطت ذلك الأمر ; وأنزل الله آية التخيير .\nقوله تعالى : وجبريل فيه لغات تقدمت في سورة \" البقرة \" . ويجوز أن يكون معطوفا على \" مولاه \" والمعنى : الله وليه وجبريل وليه ; فلا يوقف على مولاه ويوقف على جبريل ويكون \" وصالح المؤمنين \" مبتدأ والملائكة معطوفا عليه . و \" ظهير \" خبرا ; وهو بمعنى الجمع . وصالح المؤمنين أبو بكر ; قاله المسيب بن شريك . وقال سعيد بن جبير : عمر . وقال عكرمة : أبو بكر وعمر . وروى شقيق عن عبد الله عن النبي صلى الله عليه وسلم في قول الله تعالى : فإن الله هو مولاه وجبريل وصالح المؤمنين قال : إن صالح المؤمنين أبو بكر وعمر . وقيل : هو علي . عن أسماء بنت عميس قالت : سمعت رسول الله صلى الله عليه وسلم يقول : وصالح المؤمنين علي بن أبي طالب . وقيل غير هذا مما تقدم القول فيه . ويجوز أن يكون وجبريل مبتدأ وما بعده معطوفا عليه . والخبر ظهير وهو بمعنى الجمع أيضا . فيوقف على هذا على مولاه . ويجوز أن يكون جبريل وصالح المؤمنين معطوفا على مولاه فيوقف على المؤمنين ويكون والملائكة بعد ذلك ظهير ابتداء وخبرا . ومعنى \" ظهير \" أعوان . وهو بمعنى ظهراء ; كقوله تعالى : وحسن أولئك رفيقا . وقال أبو علي : قد جاء فعيل للكثرة كقوله تعالى : ولا يسأل حميم حميما يبصرونهم وقيل : كان التظاهر منهما في التحكم على النبي صلى الله عليه وسلم في النفقة ، ولهذا آلى منهن شهرا واعتزلهن . وفي صحيح مسلم عن جابر بن عبد الله قال : دخل أبو بكر يستأذن على رسول الله صلى الله عليه وسلم فوجد الناس جلوسا ببابه لم يؤذن لأحد منهم ، قال : فأذن لأبي بكر فدخل ، ثم أقبل عمر فاستأذن فأذن له ، فوجد النبي صلى الله عليه وسلم جالسا حوله نساؤه واجما ساكتا - قال - فقال : لأقولن شيئا أضحك النبي صلى الله عليه وسلم ; فقال : يا رسول الله ، لو رأيت بنت خارجة سألتني النفقة فقمت إليها فوجأت عنقها ; فضحك رسول الله صلى الله عليه وسلم وقال : \" هن حولي كما ترى يسألنني النفقة \" . فقام أبو بكر إلى عائشة يجأ عنقها ، وقام عمر إلى حفصة يجأ عنقها ; كلاهما يقول : تسألن رسول الله صلى الله عليه وسلم ما ليس عنده ! فقلن : والله لا نسأل رسول الله صلى الله عليه وسلم شيئا أبدا ليس عنده . ثم اعتزلهن شهرا أو تسعا وعشرين . ثم نزلت عليه هذه الآية : يا أيها النبي قل لأزواجك حتى بلغ للمحسنات منكن أجرا عظيما الحديث . وقد ذكراه في سورة \" الأحزاب \" .\n                                    ",
        "saadi": "إِن تَتُوبَآ إِلَى ٱللَّهِ فَقَدۡ صَغَتۡ قُلُوبُكُمَاۖ وَإِن تَظَٰهَرَا عَلَيۡهِ فَإِنَّ ٱللَّهَ هُوَ مَوۡلَىٰهُ وَجِبۡرِيلُ وَصَٰلِحُ ٱلۡمُؤۡمِنِينَۖ وَٱلۡمَلَٰٓئِكَةُ بَعۡدَ ذَٰلِكَ ظَهِيرٌ ٤\n                                        \n                                        \n                                        \n                                        { إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا } الخطاب للزوجتين الكريمتين من أزواجه صلى الله عليه وسلم عائشة وحفصة رضي الله عنهما، كانتا سببًا لتحريم النبي صلى الله عليه وسلم على نفسه ما يحبه، فعرض الله عليهما التوبة، وعاتبهما على ذلك، وأخبرهما أن قلوبهما قد صغت أي: مالت وانحرفت عما ينبغي لهن، من الورع والأدب مع الرسول صلى الله عليه وسلم، واحترامه، وأن لا يشققن عليه، { وَإِنْ تَظَاهَرَا عَلَيْهِ } أي: تعاونا على ما يشق عليه، ويستمر هذا الأمر منكن، { فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ وَالْمَلَائِكَةُ بَعْدَ ذَلِكَ ظَهِيرٌ } أي: الجميع أعوان للرسول، مظاهرون، ومن كان هؤلاء أعوانه فهو المنصور، وغيره ممن يناوئه مخذول وفي هذا أكبر فضيلة وشرف لسيد المرسلين، حيث جعل الباري نفسه [الكريمة]، وخواص خلقه، أعوانًا لهذا الرسول الكريم.\n                                    "
      },
      "originalText": "إِن تَتُوبَآ إِلَى ٱللَّهِ فَقَدۡ صَغَتۡ قُلُوبُكُمَاۖ وَإِن تَظَٰهَرَا عَلَيۡهِ فَإِنَّ ٱللَّهَ هُوَ مَوۡلَىٰهُ وَجِبۡرِيلُ وَصَٰلِحُ ٱلۡمُؤۡمِنِينَۖ وَٱلۡمَلَٰٓئِكَةُ بَعۡدَ ذَٰلِكَ ظَهِيرٌ ٤"
    },
    {
      "number": 5234,
      "text": "عَسَىٰ رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا",
      "surah": {
        "number": 66,
        "name": "سورة التحريم",
        "englishName": "At-Tahrim",
        "englishNameTranslation": "The Prohibition",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 5,
      "juz": 28,
      "manzil": 7,
      "page": 560,
      "ruku": 494,
      "hizbQuarter": 224,
      "sajda": false,
      "tafsier": {
        "ibnkther": "عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبۡدِلَهُۥٓ أَزۡوَٰجًا خَيۡرٗا مِّنكُنَّ مُسۡلِمَٰتٖ مُّؤۡمِنَٰتٖ قَٰنِتَٰتٖ تَٰٓئِبَٰتٍ عَٰبِدَٰتٖ سَٰٓئِحَٰتٖ ثَيِّبَٰتٖ وَأَبۡكَارٗا ٥\n                                    \n                                    \n                                    فنزلت هذه الآية آية التخيير \"عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن - وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير\" فقلت أطلقتهن؟ قال \"لا\" فقمت على باب المسجد فناديت بأعلى صوتي لم يطلق نساءه ونزلت هذه الآية \"وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ولو ردوه إلى الرسول وإلى أولي الأمر منهم لعلمه الذين يستنبطونه منهم\" فكنت أنا استنبطت ذلك الأمر وكذا قال سعيد بن جبير وعكرمة ومقاتل بن حيان والضحاك وغيرهم \"وصالح المؤمنين\" أبو بكر وعمر زاد الحسن البصري وعثمان قال ليث بن أبي سليم عن مجاهد \"وصالح المؤمنين\" قال علي بن أبي طالب وقال ابن أبي حاتم حدثنا علي بن الحسين ثنا محمد بن أبي عمر ثنا محمد بن جعفر بن محمد بن الحسين قال أخبرني رجل ثقة يرفعه إلى علي قال: قال رسول الله صلى الله عليه وسلم في قوله تعالى \"وصالح المؤمنين\" قال \"هو علي بن أبي طالب\" إسناده ضعيف وهو منكر جدا وقال البخاري ثنا عمرو بن عون ثنا هشيم عن حميد عن أنس قال: قال عمر اجتمع نساء النبي صلى الله عليه وسلم في الغيرة عليه فقلت لهن \"عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن\" فنزلت هذه الآية وقد تقدم أنه وافق القرآن في أماكن منها في نزول الحجاب ومنها في أسارى بدر ومنها قوله لو اتخذت من مقام إبراهيم مصلى فأنزل الله تعالى \"واتخذوا من مقام إبراهيم مصلى\" وقال ابن أبي حاتم ثنا أبي حدثنا الأنصاري ثنا حميد عن أنس قال: قال عمر بن الخطاب بلغني شيء كان بين أمهات المؤمنين وبين النبي صلى الله عليه وسلم فاستقريتهن أقول لتكفن عن رسول الله صلى الله عليه وسلم أو ليبدلنه الله أزواجا خيرا منكن حتى أتيت على آخر أمهات المؤمنين فقالت: يا عمر أما في رسول الله ما يعظ نساءه حتى تعظهن؟.\nفأمسكت فأنزل الله عز وجل \"عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن مسلمات مؤمنات قانتات تائبات عابدات سائحات ثيبات وأبكارا\" وهذه المرأة التي ردته عما كان فيه من وعظ النساء هي أم سلمة كما ثبت ذلك في صحيح البخاري وقال الطبراني ثنا إبراهيم بن نائلة الأصبهاني ثنا إسماعيل البجلي ثنا أبو عوانة عن أبي سنان عن الضحاك عن ابن عباس في قوله \"وإذ أسر النبي إلى بعض أزواجه حديثا\" قال دخلت حفصة على النبي صلى الله عليه وسلم في بيتها وهو يطأ مارية فقال لها رسول الله صلى الله عليه وسلم \"لا تخبري عائشة حتى أبشرك ببشارة إن أباك يلي الأمر من بعد أبي بكر إذا أنا مت\" فذهبت حفصة فأخبرت عائشة فقالت عائشة لرسول الله صلى الله عليه وسلم من أنبأك هذا؟ قال \"نبأني العليم الخبير\" فقالت عائشة لا أنظر إليك حتى تحرم مارية فحرمها فأنزل الله تعالى \"يا أيها النبي لم تحرم\" إسناده فيه نظر وقد تبين مما أوردناه تفسير هذه الآيات الكريمات ومعنى قوله \"مسلمات مؤمنات قانتات تائبات عابدات\" ظاهر وقوله تعالى \"سائحات\" أي صائمات قاله أبو هريرة وعائشة وابن عباس وعكرمة ومجاهد وسعيد بن جبير وعطاء ومحمد بن كعب القرظي وأبو عبدالرحمن السلمي وأبو مالك وإبراهيم النخعي والحسن وقتادة والضحاك والربيع بن أنس والسدي وغيرهم.\nوتقدم فيه حديث مرفوع عند قوله \"السائحون\" في سورة براءة ولفظه \"سياحة هذه الأمة الصيام\" وقال زيد بن أسلم وابنه عبدالرحمن \"سائحات\" أي مهاجرات وتلا عبدالرحمن \"السائحون\" أي المهاجرون والقول الأول أولى والله أعلم.\nوقوله تعالى \"ثيبات وأبكارا\" أي منهن ثيبات ومنهن أبكارا ليكون ذلك أشهى إلى النفس فإن التنوع يبسط النفس ولهذا قال \"ثيبات وأبكارا\" وقال أبو القاسم الطبراني في معجمه الكبير ثنا أبو بكر بن صدقة ثنا محمد بن محمد بن مرزوق ثنا عبدالله بن أبي أمية ثنا عبدالقدوس عن صالح بن حيان عن ابن بريدة عن أبيه \"ثيبات وأبكارا\" قال وعد الله نبيه صلى الله عليه وسلم في هذه الآية أن يزوجه فالثيب آسية امرأة فرعون وبالأبكار مريم بنت عمران.\nوذكر الحافظ ابن عساكر فى ترجمة مريم عليها السلام من طريق سويد بن سعيد ثنا محمد بن صالح بن عمر عن الضحاك ومجاهد عن ابن عمر قال: جاء جبريل إلى رسول الله صلى الله عليه وسلم فمرت خديجة فقال إن الله يقرئها السلام ويبشرها ببيت في الجنة من قصب بعيد من اللهب لا نصب فيه ولا صخب من لؤلؤة جوفاء بين بيت مريم بنت عمران وبيت آسية بنت مزاحم.\nومن حديث أبي بكر الهذلي عن عكرمة عن ابن عباس أن النبي صلى الله عليه وسلم دخل على خديجة وهي في الموت فقال \"يا خديجة إذا لقيت ضرائرك فأقرئيهن مني السلام\" فقالت يا رسول الله وهل تزوجت قبلي؟ قال \"لا ولكن الله زوجني مريم بنت عمران وآسية امرأة فرعون وكلثم أخت موسى\" ضعيف أيضا وقال أبو يعلى ثنا إبراهيم بن عرعرة ثنا عبدالنور بن عبدالله ثنا يوسف بن شعيب عن أبي أمامة قال: قال رسول الله صلى الله عليه وسلم \"أعلمت أن الله زوجني في الجنة مريم بنت عمران وكلثم أخت موسى وآسية امرأة فرعون؟\" فقلت هنيئا لك يا رسول الله وهذا أيضا ضعيف وروى مرسلا عن ابن أبي داود.\n                                    ",
        "qortoby": "عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبۡدِلَهُۥٓ أَزۡوَٰجًا خَيۡرٗا مِّنكُنَّ مُسۡلِمَٰتٖ مُّؤۡمِنَٰتٖ قَٰنِتَٰتٖ تَٰٓئِبَٰتٍ عَٰبِدَٰتٖ سَٰٓئِحَٰتٖ ثَيِّبَٰتٖ وَأَبۡكَارٗا ٥\n                                    \n                                    \n                                    قوله تعالى : عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن مسلمات مؤمنات قانتات تائبات عابدات سائحات ثيبات وأبكارا\nقوله تعالى : عسى ربه إن طلقكن قد تقدم في الصحيح أن هذه الآية نزلت على لسان عمر رضي الله عنه . ثم قيل : كل \" عسى \" في القرآن واجب ; إلا هذا . وقيل : هو واجب ، ولكن الله عز وجل علقه بشرط وهو التطليق ولم يطلقهن .\nأن يبدله أزواجا خيرا منكن لأنكن لو كنتن خيرا منهن ما طلقكن رسول الله صلى الله عليه وسلم قال معناه السدي . وقيل : هذا وعد من الله تعالى لرسوله صلى الله عليه وسلم ، لو طلقهن في الدنيا أن يزوجه في الدنيا نساء خيرا منهن . وقرئ \" أن يبدله \" بالتشديد والتخفيف . والتبديل والإبدال بمعنى ، كالتنزيل والإنزال . والله كان عالما بأنه كان لا يطلقهن ، ولكن أخبر عن قدرته ، على أنه إن طلقهن أبدله خيرا منهن تخويفا لهن . وهو كقوله تعالى : وإن تتولوا يستبدل قوما غيركم . وهو إخبار عن القدرة وتخويف لهم ، لا أن في الوجود من هو خير من أصحاب رسول الله صلى الله عليه وسلم .\nقوله تعالى : مسلمات يعني مخلصات ، قاله سعيد بن جبير . وقيل : معناه مسلمات لأمر الله تعالى وأمر رسوله .\nمؤمنات مصدقات بما أمرن به ونهين عنه .\nقانتات مطيعات . والقنوت : الطاعة . وقد تقدم .\nتائبات أي من ذنوبهن ; قاله السدي . وقيل : راجعات إلى أمر رسول الله صلى الله عليه وسلم تاركات لمحاب أنفسهن .\nعابدات أي كثيرات العبادة لله تعالى . وقال ابن عباس : كل عبادة في القرآن فهو التوحيد .\nسائحات صائبات ; قال ابن عباس والحسن وابن جبير . وقال زيد بن أسلم وابنه عبد الرحمن ويمان : مهاجرات . قال زيد : وليس في أمة محمد صلى الله عليه وسلم سياحة إلا الهجرة . والسياحة الجولان في الأرض . وقال الفراء والقتبي وغيرهما : سمي الصائم سائحا لأن السائح لا زاد معه ، وإنما يأكل من حيث يجد الطعام . وقيل : ذاهبات في طاعة الله عز وجل ; من ساح الماء إذا ذهب . وقد مضى في سورة \" التوبة \" والحمد لله .\nثيبات وأبكارا أي منهن ثيب ومنهن بكر . وقيل : إنما سميت الثيب ثيبا لأنها راجعة إلى زوجها إن أقام معها ، أو إلى غيره إن فارقها . وقيل : لأنها ثابت إلى بيت أبويها . وهذا أصح ; لأنه ليس كل ثيب تعود إلى زوج . وأما البكر فهي العذراء ; سميت بكرا لأنها على أول حالتها التي خلقت بها . وقال الكلبي : أراد بالثيب مثل آسية امرأة فرعون ، وبالبكر مثل مريم ابنة عمران .\nقلت : وهذا إنما يمشي على قول من قال : إن التبديل وعد من الله لنبيه لو طلقهن في الدنيا زوجه في الآخرة خيرا منهن . والله أعلم .\n                                    ",
        "saadi": "عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبۡدِلَهُۥٓ أَزۡوَٰجًا خَيۡرٗا مِّنكُنَّ مُسۡلِمَٰتٖ مُّؤۡمِنَٰتٖ قَٰنِتَٰتٖ تَٰٓئِبَٰتٍ عَٰبِدَٰتٖ سَٰٓئِحَٰتٖ ثَيِّبَٰتٖ وَأَبۡكَارٗا ٥\n                                        \n                                        \n                                        \n                                        وهذا فيه من التحذير للزوجتين الكريمتين ما لا يخفى، ثم خوفهما أيضا، بحالة تشق على النساء غاية المشقة، وهو الطلاق، الذي هو أكبر شيء عليهن، فقال: { عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ } .\n{ عَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ } أي: فلا ترفعن عليه، فإنه لو طلقكن، لم يضق عليه الأمر، ولم يكن مضطرًا إليكن، فإنه سيلقى ويبدله الله أزواجًا خيرًا منكن، دينا وجمالًا، وهذا من باب التعليق الذي لم يوجد، ولا يلزم وجوده، فإنه ما طلقهن، ولو طلقهن، لكان ما ذكره الله من هذه الأزواج الفاضلات، الجامعات بين الإسلام، وهو القيام بالشرائع الظاهرة، والإيمان، وهو: القيام بالشرائع الباطنة، من العقائد وأعمال القلوب.\nالقنوت هو دوام الطاعة واستمرارها { تَائِبَاتٍ } عما يكرهه الله، فوصفهن بالقيام بما يحبه الله، والتوبة عما يكرهه الله، { ثَيِّبَاتٍ وَأَبْكَارًا } أي: بعضهن ثيب، وبعضهن أبكار، ليتنوع صلى الله عليه وسلم، فيما يحب، فلما سمعن -رضي الله عنهن- هذا التخويف والتأديب، بادرن إلى رضا رسول الله صلى الله عليه وسلم، فكان هذا الوصف منطبقًا عليهن، فصرن أفضل نساء المؤمنين، وفي هذا دليل على أن الله لا يختار لرسوله صلى الله عليه وسلم إلا أكمل الأحوال وأعلى الأمور، فلما اختار الله لرسوله بقاء نسائه المذكورات معه دل على أنهن خير النساء وأكملهن.\n                                    "
      },
      "originalText": "عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبۡدِلَهُۥٓ أَزۡوَٰجًا خَيۡرٗا مِّنكُنَّ مُسۡلِمَٰتٖ مُّؤۡمِنَٰتٖ قَٰنِتَٰتٖ تَٰٓئِبَٰتٍ عَٰبِدَٰتٖ سَٰٓئِحَٰتٖ ثَيِّبَٰتٖ وَأَبۡكَارٗا ٥"
    },
    {
      "number": 5235,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ",
      "surah": {
        "number": 66,
        "name": "سورة التحريم",
        "englishName": "At-Tahrim",
        "englishNameTranslation": "The Prohibition",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 6,
      "juz": 28,
      "manzil": 7,
      "page": 560,
      "ruku": 494,
      "hizbQuarter": 224,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قُوٓاْ أَنفُسَكُمۡ وَأَهۡلِيكُمۡ نَارٗا وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُ عَلَيۡهَا مَلَٰٓئِكَةٌ غِلَاظٞ شِدَادٞ لَّا يَعۡصُونَ ٱللَّهَ مَآ أَمَرَهُمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ ٦\n                                    \n                                    \n                                    قال سفيان الثوري عن منصور عن رجل عن علي رضي الله عنه في قوله تعالى \"قوا أنفسكم وأهليكم نارا\" يقول أدبوهم وعلموهم وقال علي بن أبي طلحة عن ابن عباس \"قوا أنفسكم وأهليكم نارا\" يقول اعملوا بطاعة الله واتقوا معاصي الله وأمروا أهليكم بالذكر ينجيكم الله من النار.\nوقال مجاهد \"قوا أنفسكم وأهليكم نارا\" قال اتقوا الله وأوصوا أهليكم بتقوى الله وقال قتادة تأمرهم بطاعة الله وتنهاهم عن معصية الله وأن تقوم عليهم بأمر الله وتأمرهم به وتساعدهم عليه فإذا رأيت لله معصية قذعتهم عنها وزجرتهم عنها وهكذا قال الضحاك ومقاتل حق المسلم أن يعلم أهله من قرابته وإمائه وعبيده ما فرض الله عليهم وما نهاهم الله عنه.\nوفي معنى هذه الآية الحديث الذي رواه أحمد وأبو داود والترمذي من حديث عبدالملك بن الربيع بن سبرة عن أبيه عن جده قال: قال رسول الله صلى الله عليه وسلم \"مروا الصبي بالصلاة إذا بلغ سبع سنين فإذا بلغ عشر سنين فاضربوه عليها\" هذا لفظ أبي داود وقال الترمذي هذا حديث حسن وروى أبو داود من حديث عمرو بن شعيب عن أبيه عن جده عن رسول الله صلى الله عليه وسلم مثل ذلك قال الفقهاء وهكذا في الصوم ليكون ذلك تمرينا له على العبادة لكي يبلغ وهو مستمر علي العبادة والطاعة ومجانبة المعاصي وترك المنكر والله الموفق.\nوقوله تعالى \"وقودها الناس والحجارة\" وقودها أي حطبها الذي يلقي فيه جثث بني آدم \"والحجارة\" قيل المراد بها الأصنام التي تعبد لقوله تعالى \"إنكم وما تعبدون من دون الله حصب جهنم\" وقال ابن مسعود ومجاهد وأبو جعفر الباقر والسدي هي حجارة من كبريت زاد مجاهد: أنتن من الجيفة وروى ذلك ابن أبي حاتم رحمه الله قال ثنا أبي ثنا عبدالرحمن بن سنان المنقري ثنا عبدالعزيز - يعني ابن أبي داود - قال بلغني أن رسول الله صلى الله عليه وسلم تلا هذه الآية \"يا أيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة\" وعنده بعض أصحابه وفيهم شيخ فقال الشيخ يا رسول الله حجارة جهنم كحجارة الدنيا؟ فقال النبي صلي الله عليه وسلم \"والذي نفسي بيده لصخرة من صخر جهنم أعظم من جبال الدنيا كلها\" قال فوقع الشيخ مغشيا عليه فوضع النبي صلى الله عليه وسلم يده على فؤاده فإذا هو حي فناداه قال \"يا شيخ قل لا إله إلا الله\" فقالها فبشره بالجنة قال: فقال أصحابه يا رسول الله أمن بيننا؟ قال \"نعم يقول الله تعالى \"ذلك لمن خاف مقامي وخاف وعيد\" هذا حديث مرسل غريب وقوله تعالى \"عليها ملائكة غلاظ شداد\" أي طباعهم غليظة قد نزعت من قلوبهم الرحمة بالكافرين بالله \"شداد\" أي تركيبهم في غاية الشدة والكثافة والمنظر المزعج كما قال ابن أبي حاتم ثنا أبي ثنا سلمة بن شبيب ثنا إبراهيم بن الحكم بن أبان ثنا أبي عن عكرمة أنه قال إذا وصل أول أهل النار إلى النار وجدوا على الباب أربعمائة ألف من خزنة جهنم سود وجوههم كالحة أنيابهم قد نزع الله من قلوبهم الرحمة ليس في قلب واحد منهم مثقال ذرة من الرحمة لو طير الطير من منكب أحدهم لطار شهرين قبل أن يبلغ منكبه الآخر ثم يجدون على الباب التسعة عشر عرض صدر أحدهم سبعون خريفا ثم يهوون من باب إلى باب خمسمائة سنة ثم يجدون على كل باب منها مثل ما وجدوا على الباب الأول حتى ينتهوا إلى آخرها وقوله \"لا يعصون الله ما أمرهم ويفعلون ما يؤمرون\" أي مهما أمرهم به تعالى يبادروا إليه لا يتأخرون عنه طرفة عين وهم قادرون على فعله ليس بهم عجز عنه.\nوهؤلاء هم الزبانية - عياذا بالله منهم.\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قُوٓاْ أَنفُسَكُمۡ وَأَهۡلِيكُمۡ نَارٗا وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُ عَلَيۡهَا مَلَٰٓئِكَةٌ غِلَاظٞ شِدَادٞ لَّا يَعۡصُونَ ٱللَّهَ مَآ أَمَرَهُمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ ٦\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة عليها ملائكة غلاظ شداد لا يعصون الله ما أمرهم ويفعلون ما يؤمرون\nفيه مسألة واحدة :\nوهي الأمر بوقاية الإنسان نفسه وأهله النار . قال الضحاك : معناه قوا أنفسكم ، وأهلوكم فليقوا أنفسهم نارا . وروى علي بن أبي طلحة عن ابن عباس : قوا أنفسكم وأمروا أهليكم بالذكر والدعاء حتى يقيهم الله بكم . وقال علي رضي الله عنه وقتادة ومجاهد : قوا أنفسكم بأفعالكم وقوا أهليكم بوصيتكم . ابن العربي : وهو الصحيح ، والفقه الذي يعطيه العطف الذي يقتضي التشريك بين المعطوف والمعطوف عليه في معنى الفعل ; كقوله :\nعلفتها تبنا وماء باردا\nوكقوله :\nورأيت زوجك في الوغى متقلدا سيفا ورمحا\nفعلى الرجل أن يصلح نفسه بالطاعة ، ويصلح أهله إصلاح الراعي للرعية . ففي صحيح الحديث أن النبي صلى الله عليه وسلم قال : \" كلكم راع وكلكم مسئول عن رعيته ، فالإمام الذي على الناس راع وهو مسئول عنهم ، والرجل راع على أهل بيته وهو مسئول عنهم \" . وعن هذا عبر الحسن في هذه الآية بقوله : يأمرهم وينهاهم . وقال بعض العلماء لما قال : قوا أنفسكم دخل فيه الأولاد ; لأن الولد بعض منه . كما دخل في قوله تعالى : ولا على أنفسكم أن تأكلوا من بيوتكم فلم يفردوا بالذكر إفراد سائر القرابات . فيعلمه الحلال والحرام ، ويجنبه المعاصي والآثام ، إلى غير ذلك من الأحكام . وقال عليه السلام : حق الولد على الوالد أن يحسن اسمه ويعلمه الكتابة ويزوجه إذا بلغ . وقال عليه السلام : \" ما نحل والد ولدا أفضل من أدب حسن \" . وقد روى عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم \" مروا أبناءكم بالصلاة لسبع ، واضربوهم عليها لعشر ، وفرقوا بينهم في المضاجع \" . خرجه جماعة من أهل الحديث . وهذا لفظ أبي داود . وخرج أيضا عن سمرة بن جندب قال : قال النبي صلى الله عليه وسلم : \" مروا الصبي بالصلاة إذا بلغ سبع سنين ، فإذا بلغ عشر سنين فاضربوه عليها \" . وكذلك يخبر أهله بوقت الصلاة ووجوب الصيام ووجوب الفطر إذا وجب ; مستندا في ذلك إلى رؤية الهلال . وقد روى مسلم أن النبي صلى الله عليه وسلم كان إذا أوتر يقول : \" قومي فأوتري يا عائشة \" . وروي أن النبي صلى الله عليه وسلم قال : \" رحم الله امرأ قام من الليل فصلى فأيقظ أهله ، فإن لم تقم رش وجهها بالماء ، رحم الله امرأة قامت من الليل تصلي وأيقظت زوجها ، فإذا لم يقم رشت على وجهه من الماء \" . ومنه قوله صلى الله عليه وسلم : \" أيقظوا صواحب الحجر \" . ويدخل هذا في عموم قوله تعالى : وتعاونوا على البر والتقوى . وذكر القشيري أن عمر رضي الله عنه قال لما نزلت هذه الآية : يا رسول الله ، نقي أنفسنا ، فكيف لنا بأهلينا ؟ . فقال : \" تنهونهم عما نهاكم الله وتأمرونهم بما أمر الله \" . وقال مقاتل : ذلك حق عليه في نفسه وولده وأهله وعبيده وإمائه . قال الكيا : فعلينا تعليم أولادنا وأهلينا الدين والخير ، وما لا يستغنى عنه من الأدب . وهو قوله تعالى : وأمر أهلك بالصلاة واصطبر عليها . ونحو قوله تعالى للنبي صلى الله عليه وسلم : وأنذر عشيرتك الأقربين . . وفي الحديث : \" مروهم بالصلاة وهم أبناء سبع \" .\nوقودها الناس والحجارة تقدم في سورة \" البقرة \" .\nعليها ملائكة غلاظ شداد يعني الملائكة الزبانية غلاظ القلوب لا يرحمون إذا استرحموا ، خلقوا من الغضب ، وحبب إليهم عذاب الخلق كما حبب لبني آدم أكل الطعام والشراب . شداد أي شداد الأبدان . وقيل : غلاظ الأقوال شداد الأفعال . وقيل غلاظ في أخذهم أهل النار شداد عليهم . يقال : فلان شديد على فلان ; أي قوي عليه يعذبه بأنواع العذاب . وقيل : أراد بالغلاظ ضخامة أجسامهم ، وبالشدة القوة . قال ابن عباس : ما بين منكبي الواحد منهم مسيرة سنة ، وقوة الواحد منهم أن يضرب بالمقمع فيدفع بتلك الضربة سبعين ألف إنسان في قعر جهنم . وذكر ابن وهب قال : وحدثنا عبد الرحمن بن زيد قال : قال رسول الله صلى الله عليه وسلم في خزنة جهنم : \" ما بين منكبي أحدهم كما بين المشرق والمغرب \" .\nقوله تعالى : لا يعصون الله ما أمرهم أي لا يخالفونه في أمره من زيادة أو نقصان .\nويفعلون ما يؤمرون أي في وقته ، فلا يؤخرونه ولا يقدمونه . وقيل أي لذتهم في امتثال أمر الله ; كما أن سرور أهل الجنة في الكون في الجنة ; ذكره بعض المعتزلة . وعندهم أنه يستحيل التكليف غدا . ولا يخفى معتقد أهل الحق في أن الله يكلف العبد اليوم وغدا ، ولا ينكر التكليف في حق الملائكة . ولله أن يفعل ما يشاء .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قُوٓاْ أَنفُسَكُمۡ وَأَهۡلِيكُمۡ نَارٗا وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُ عَلَيۡهَا مَلَٰٓئِكَةٌ غِلَاظٞ شِدَادٞ لَّا يَعۡصُونَ ٱللَّهَ مَآ أَمَرَهُمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ ٦\n                                        \n                                        \n                                        \n                                        أي: يا من من الله عليهم بالإيمان، قوموا بلوازمه وشروطه.\nفـ { قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا } موصوفة بهذه الأوصاف الفظيعة، ووقاية الأنفس بإلزامها أمر الله، والقيام بأمره امتثالًا، ونهيه اجتنابًا، والتوبة عما يسخط الله ويوجب العذاب، ووقاية الأهل [والأولاد]، بتأديبهم وتعليمهم، وإجبارهم على أمر الله، فلا يسلم العبد إلا إذا قام بما أمر الله به في نفسه، وفيما يدخل تحت ولايته من الزروجات والأولاد وغيرهم ممن هو تحت ولايته وتصرفه.\nووصف الله النار بهذه الأوصاف، ليزجر عباده عن التهاون بأمره فقال: { وَقُودُهَا النَّاسُ وَالْحِجَارَةُ } كما قال تعالى: { إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ أَنْتُمْ لَهَا وَارِدُونَ } .\n{ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ } أي: غليظة أخلاقهم، عظيم انتهارهم، يفزعون بأصواتهم ويخيفون بمرآهم، ويهينون أصحاب النار بقوتهم، ويمتثلون فيهم أمر الله، الذي حتم عليهم العذاب وأوجب عليهم شدة العقاب، { لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ } وهذا فيه أيضًا مدح للملائكة الكرام، وانقيادهم لأمر الله، وطاعتهم له في كل ما أمرهم به.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ قُوٓاْ أَنفُسَكُمۡ وَأَهۡلِيكُمۡ نَارٗا وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُ عَلَيۡهَا مَلَٰٓئِكَةٌ غِلَاظٞ شِدَادٞ لَّا يَعۡصُونَ ٱللَّهَ مَآ أَمَرَهُمۡ وَيَفۡعَلُونَ مَا يُؤۡمَرُونَ ٦"
    },
    {
      "number": 5236,
      "text": "يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ ۖ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ",
      "surah": {
        "number": 66,
        "name": "سورة التحريم",
        "englishName": "At-Tahrim",
        "englishNameTranslation": "The Prohibition",
        "revelationType": "Medinan",
        "numberOfAyahs": 12
      },
      "numberInSurah": 7,
      "juz": 28,
      "manzil": 7,
      "page": 560,
      "ruku": 494,
      "hizbQuarter": 224,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ كَفَرُواْ لَا تَعۡتَذِرُواْ ٱلۡيَوۡمَۖ إِنَّمَا تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ ٧\n                                    \n                                    \n                                    قال سفيان الثوري ، عن منصور ، عن رجل ، عن علي رضي الله عنه ، في قوله تعالى : ( قوا أنفسكم وأهليكم نارا ) يقول : أدبوهم ، علموهم .\nوقال علي بن أبي طلحة ، عن ابن عباس : ( قوا أنفسكم وأهليكم نارا ) يقول : اعملوا بطاعة الله ، واتقوا معاصي الله ، ومروا أهليكم بالذكر ، ينجيكم الله من النار .\nوقال مجاهد : ( قوا أنفسكم وأهليكم نارا ) قال : اتقوا الله ، وأوصوا أهليكم بتقوى الله . .\nوقال قتادة : يأمرهم بطاعة الله ، وينهاهم عن معصية الله ، وأن يقوم عليهم بأمر الله ، ويأمرهم به ويساعدهم عليه ، فإذا رأيت لله معصية ، قدعتهم عنها ، وزجرتهم عنها .\nوهكذا قال الضحاك ، ومقاتل : حق على المسلم أن يعلم أهله من قرابته ، وإمائه ، وعبيده ما فرض الله عليهم ، وما نهاهم الله عنه .\nوفي معنى هذه الآية الحديث الذي رواه الإمام أحمد ، وأبو داود ، والترمذي ، من حديث عبد الملك بن الربيع بن سبرة ، عن أبيه ، عن جده ، قال : قال رسول الله - صلى الله عليه وسلم - : \" مروا الصبي بالصلاة إذا بلغ سبع سنين ، فإذا بلغ عشر سنين فاضربوه عليها \" .\nهذا لفظ أبي داود ، وقال الترمذي : هذا حديث حسن .\nوروى أبو داود من حديث عمرو بن شعيب ، عن أبيه ، عن جده ، عن النبي - صلى الله عليه وسلم - مثل ذلك .\nقال الفقهاء : وهكذا في الصوم ; ليكون ذلك تمرينا له على العبادة ، لكي يبلغ وهو مستمر على العبادة ، والطاعة ، ومجانبة المعصية ، وترك المنكر ، والله الموفق .\nوقوله : ( وقودها الناس والحجارة ) ( وقودها ) أي : حطبها الذي يلقى فيها جثث بني آدم . ( والحجارة ) قيل : المراد بذلك الأصنام التي كانت تعبد لقوله : ( إنكم وما تعبدون من دون الله حصب جهنم ) [ الأنبياء : 98 ] .\nوقال ابن مسعود ، ومجاهد ، وأبو جعفر الباقر ، والسدي : هي حجارة من كبريت - زاد مجاهد : أنتن من الجيفة .\nوروى ذلك ابن أبي حاتم رحمه الله ، ثم قال : حدثنا أبي ، حدثنا عبد الرحمن بن سنان المنقري ، حدثنا عبد العزيز - يعني ابن أبي راود - قال : بلغني أن رسول الله - صلى الله عليه وسلم - تلا هذه الآية : ( يا أيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة ) وعنده بعض أصحابه ، وفيهم شيخ ، فقال الشيخ : يا رسول الله ، حجارة جهنم كحجارة الدنيا ؟ فقال النبي - صلى الله عليه وسلم - : \" والذي نفسي بيده ، لصخرة من صخر جهنم أعظم من جبال الدنيا كلها \" . قال : فوقع الشيخ مغشيا عليه ، فوضع النبي - صلى الله عليه وسلم - يده على فؤاده فإذا هو حي فناداه قال : \" يا شيخ \" ، قل : \" لا إله إلا الله \" . فقالها ، فبشره بالجنة ، قال : فقال أصحابه : يا رسول الله ، أمن بيننا ؟ قال : \" نعم ، يقول الله تعالى : ( ذلك لمن خاف مقامي وخاف وعيد ) [ إبراهيم : 14 ] هذا حديث مرسل غريب .\nوقوله : ( عليها ملائكة غلاظ شداد ) أي : طباعهم غليظة ، قد نزعت من قلوبهم الرحمة بالكافرين بالله ، ( شداد ) أي : تركيبهم في غاية الشدة ، والكثافة ، والمنظر المزعج .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا سلمة بن شبيب ، حدثنا إبراهيم بن الحكم بن أبان ، حدثنا أبي ، عن عكرمة أنه قال : إذا وصل أول أهل النار إلى النار ، وجدوا على الباب أربعمائة ألف من خزنة جهنم ، سود وجوههم ، كالحة أنيابهم ، قد نزع الله من قلوبهم الرحمة ، ليس في قلب واحد منهم مثقال ذرة من الرحمة ، لو طير الطير من منكب أحدهم لطار شهرين قبل أن يبلغ منكبه الآخر ، ثم يجدون على الباب التسعة عشر ، عرض صدر أحدهم سبعون خريفا ، ثم يهوون من باب إلى باب خمسمائة سنة ، ثم يجدون على كل باب منها مثل ما وجدوا على الباب الأول ، حتى ينتهوا إلى آخرها .\nوقوله : ( لا يعصون الله ما أمرهم ويفعلون ما يؤمرون ) أي : مهما أمرهم به تعالى يبادروا إليه ، لا يتأخرون عنه طرفة عين ، وهم قادرون على فعله ليس بهم عجز عنه . وهؤلاء هم الزبانية عياذا بالله منهم . وقوله : ( يا أيها الذين كفروا لا تعتذروا اليوم إنما تجزون ما كنتم تعملون ) أي : يقال للكفرة يوم القيامة : لا تعتذروا فإنه لا يقبل منكم ، وإنما تجزون اليوم بأعمالكم .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ كَفَرُواْ لَا تَعۡتَذِرُواْ ٱلۡيَوۡمَۖ إِنَّمَا تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ ٧\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين كفروا لا تعتذروا اليوم إنما تجزون ما كنتم تعملون\nقوله تعالى : يا أيها الذين كفروا لا تعتذروا اليوم فإن عذركم لا ينفع . وهذا النهي لتحقيق اليأس .\nإنما تجزون ما كنتم تعملون في الدنيا . ونظيره : فيومئذ لا ينفع الذين ظلموا معذرتهم ولا هم يستعتبون . وقد تقدم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ كَفَرُواْ لَا تَعۡتَذِرُواْ ٱلۡيَوۡمَۖ إِنَّمَا تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ ٧\n                                        \n                                        \n                                        \n                                        أي: يوبخ أهل النار يوم القيامة بهذا التوبيخ فيقال لهم: { يَا أَيُّهَا الَّذِينَ كَفَرُوا لَا تَعْتَذِرُوا الْيَوْمَ } [أي:] فإنه ذهب وقت الاعتذار، وزال نفعه، فلم يبق الآن إلا الجزاء على الأعمال، وأنتم لم تقدموا إلا الكفر بالله، والتكذيب بآياته، ومحاربة رسله وأوليائه.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ كَفَرُواْ لَا تَعۡتَذِرُواْ ٱلۡيَوۡمَۖ إِنَّمَا تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ ٧"
    }
  ]
}