{
  "number": 57,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 346,
      "text": "رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 53,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 46,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلۡتَ وَٱتَّبَعۡنَا ٱلرَّسُولَ فَٱكۡتُبۡنَا مَعَ ٱلشَّٰهِدِينَ ٣٥\n                                    \n                                    \n                                    وقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا وكيع ، حدثنا إسرائيل ، عن سماك ، عن عكرمة ، عن ابن عباس في قوله : ( فاكتبنا مع الشاهدين ) قال مع أمة محمد صلى الله عليه وسلم . وهذا إسناد جيد .\n                                    ",
        "qortoby": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلۡتَ وَٱتَّبَعۡنَا ٱلرَّسُولَ فَٱكۡتُبۡنَا مَعَ ٱلشَّٰهِدِينَ ٣٥\n                                    \n                                    \n                                    قوله تعالى : ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين\nقوله تعالى : ربنا آمنا بما أنزلت أي يقولون ربنا آمنا . بما أنزلت يعني في كتابك وما أظهرته من حكمك . واتبعنا الرسول يعني عيسى .\nفاكتبنا مع الشاهدين يعني أمة محمد - صلى الله عليه وسلم - ; عن ابن عباس . والمعنى أثبت أسماءنا مع أسمائهم واجعلنا من جملتهم . وقيل : المعنى فاكتبنا مع الذين شهدوا لأنبيائك بالصدق .\n                                    ",
        "saadi": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلۡتَ وَٱتَّبَعۡنَا ٱلرَّسُولَ فَٱكۡتُبۡنَا مَعَ ٱلشَّٰهِدِينَ ٣٥\n                                        \n                                        \n                                        \n                                        { فلما أحس عيسى منهم الكفر } أي: رأى منهم عدم الانقياد له، وقالوا هذا سحر مبين، وهموا بقتله وسعوا في ذلك { قال من أنصاري إلى الله } من يعاونني ويقوم معي بنصرة دين الله { قال الحواريون } وهم الأنصار { نحن أنصار الله } أي: انتدبوا معه وقاموا بذلك. وقالوا: { آمنا بالله } { فاكتبنا مع الشاهدين } أي: الشهادة النافعة، وهي الشهادة بتوحيد الله وتصديق رسوله مع القيام بذلك، فلما قاموا مع عيسى بنصر دين الله وإقامة شرعه آمنت طائفة من بني إسرائيل وكفرت طائفة، فاقتتلت الطائفتان فأيد الله الذين آمنوا بنصره على عدوهم فأصبحوا ظاهرين\n                                    "
      },
      "originalText": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلۡتَ وَٱتَّبَعۡنَا ٱلرَّسُولَ فَٱكۡتُبۡنَا مَعَ ٱلشَّٰهِدِينَ ٣٥"
    },
    {
      "number": 347,
      "text": "وَمَكَرُوا وَمَكَرَ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 54,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 46,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَكَرُواْ وَمَكَرَ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ ٤٥\n                                    \n                                    \n                                    ثم قال تعالى مخبرا عن [ ملأ ] بني إسرائيل فيما هموا به من الفتك بعيسى ، عليه السلام ، وإرادته بالسوء والصلب ، حين تمالئوا عليه ووشوا به إلى ملك ذلك الزمان ، وكان كافرا ، فأنهوا إليه أن هاهنا رجلا يضل الناس ويصدهم عن طاعة الملك ، ويفند الرعايا ، ويفرق بين الأب وابنه إلى غير ذلك مما تقلدوه في رقابهم ورموه به من الكذب ، وأنه ولد زانية حتى استثاروا غضب الملك ، فبعث في طلبه من يأخذه ويصلبه وينكل به ، فلما أحاطوا بمنزله وظنوا أنهم قد ظفروا به ، نجاه الله من بينهم ، ورفعه من روزنة ذلك البيت إلى السماء ، وألقى الله شبهه على رجل [ ممن ] كان عنده في المنزل ، فلما دخل أولئك اعتقدوه في ظلمة الليل عيسى ، عليه السلام ، فأخذوه وأهانوه وصلبوه ، ووضعوا على رأسه الشوك . وكان هذا من مكر الله بهم ، فإنه نجى نبيه ورفعه من بين أظهرهم ، وتركهم في ضلالهم يعمهون ، يعتقدون أنهم قد ظفروا بطلبتهم ، وأسكن الله في قلوبهم قسوة وعنادا للحق ملازما لهم ، وأورثهم ذلة لا تفارقهم إلى يوم التناد ، ولهذا قال تعالى : ( ومكروا ومكر الله والله خير الماكرين ) .\n                                    ",
        "qortoby": "وَمَكَرُواْ وَمَكَرَ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ ٤٥\n                                    \n                                    \n                                    قوله تعالى : ومكروا ومكر الله والله خير الماكرين\nقوله تعالى : ومكروا يعني كفار بني إسرائيل الذين أحس منهم الكفر ، أي قتله . وذلك أن عيسى عليه السلام لما أخرجه قومه وأمه من بين أظهرهم عاد إليهم مع الحواريين وصاح فيهم بالدعوة فهموا بقتله وتواطئوا على الفتك به ، فذلك مكرهم . ومكر الله : استدراجه لعباده من حيث لا يعلمون ; عن الفراء وغيره . قال ابن عباس : كلما أحدثوا خطيئة جددنا لهم نعمة . وقال الزجاج : مكر الله مجازاتهم على مكرهم ; فسمي الجزاء باسم الابتداء ; كقوله : الله يستهزئ بهم ، وهو خادعهم . وقد تقدم في البقرة . وأصل المكر في اللغة الاحتيال والخداع . والمكر : خدالة الساق . وامرأة ممكورة الساقين . والمكر : ضرب من الثياب . ويقال : بل هو المغرة ; حكاه ابن فارس . وقيل : \" مكر الله \" إلقاء شبه عيسى على غيره ورفع عيسى إليه ، وذلك أن اليهود لما اجتمعوا على قتل عيسى دخل البيت هاربا منهم فرفعه جبريل من الكوة إلى السماء ، فقال ملكهم لرجل منهم خبيث يقال له يهوذا : ادخل عليه فاقتله ، فدخل الخوخة فلم يجد هناك عيسى وألقى الله عليه شبه عيسى ، فلما خرج رأوه على شبه عيسى فأخذوه وقتلوه وصلبوه . ثم قالوا : وجهه يشبه وجه عيسى ، وبدنه يشبه بدن صاحبنا ; فإن كان هذا صاحبنا فأين عيسى وإن كان هذا عيسى فأين صاحبنا فوقع بينهم قتال فقتل بعضهم بعضا ; فذلك قوله تعالى : ومكروا ومكر الله . وقيل غير هذا على ما يأتي .\nوالله خير الماكرين اسم فاعل من مكر يمكر مكرا . وقد عده بعض العلماء في أسماء الله تعالى فيقول إذا دعا به : يا خير الماكرين امكر لي . وكان عليه السلام يقول في دعائه : ( اللهم امكر لي ولا تمكر علي ) . وقد ذكرناه في الكتاب الأسنى في شرح أسماء الله الحسنى ، والله أعلم .\n                                    ",
        "saadi": "وَمَكَرُواْ وَمَكَرَ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ ٤٥\n                                        \n                                        \n                                        \n                                        فلهذا قال تعالى هنا { ومكروا } أي: الكفار بإرادة قتل نبي الله وإطفاء نوره { ومكر الله } بهم جزاء لهم على مكرهم { والله خير الماكرين } رد الله كيدهم في نحورهم، فانقلبوا خاسرين.\n                                    "
      },
      "originalText": "وَمَكَرُواْ وَمَكَرَ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ ٤٥"
    },
    {
      "number": 348,
      "text": "إِذْ قَالَ اللَّهُ يَا عِيسَىٰ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ الَّذِينَ كَفَرُوا وَجَاعِلُ الَّذِينَ اتَّبَعُوكَ فَوْقَ الَّذِينَ كَفَرُوا إِلَىٰ يَوْمِ الْقِيَامَةِ ۖ ثُمَّ إِلَيَّ مَرْجِعُكُمْ فَأَحْكُمُ بَيْنَكُمْ فِيمَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 55,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ قَالَ ٱللَّهُ يَٰعِيسَىٰٓ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُواْ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوۡقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۖ ثُمَّ إِلَيَّ مَرۡجِعُكُمۡ فَأَحۡكُمُ بَيۡنَكُمۡ فِيمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٥٥\n                                    \n                                    \n                                    اختلف المفسرون في قوله : ( إني متوفيك ورافعك إلي ) فقال قتادة وغيره : هذا من المقدم والمؤخر ، تقديره : إني رافعك إلي ومتوفيك ، يعني بعد ذلك .\nوقال علي بن أبي طلحة عن ابن عباس : ( إني متوفيك ) أي : مميتك .\nوقال محمد بن إسحاق ، عمن لا يتهم ، عن وهب بن منبه ، قال : توفاه الله ثلاث ساعات من النهار حين رفعه الله إليه .\nقال ابن إسحاق : والنصارى يزعمون أن الله توفاه سبع ساعات ثم أحياه .\nوقال إسحاق بن بشر عن إدريس ، عن وهب : أماته الله ثلاثة أيام ، ثم بعثه ، ثم رفعه .\nوقال مطر الوراق : متوفيك من الدنيا وليس بوفاة موت وكذا قال ابن جرير : توفيه هو رفعه .\nوقال الأكثرون : المراد بالوفاة هاهنا : النوم ، كما قال تعالى : ( وهو الذي يتوفاكم بالليل [ ويعلم ما جرحتم بالنهار ] ) [ الأنعام : 60 ] وقال تعالى : ( الله يتوفى الأنفس حين موتها والتي لم تمت في منامها فيمسك التي قضى عليها الموت ويرسل الأخرى إلى أجل مسمى إن في ذلك لآيات لقوم يتفكرون ] ) [ الزمر : 42 ] وكان رسول الله صلى الله عليه وسلم يقول - إذا قام من النوم - : \" الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور \" ، وقال الله تعالى : ( وبكفرهم وقولهم على مريم بهتانا عظيما وقولهم إنا قتلنا المسيح عيسى ابن مريم رسول الله ) إلى قوله [ تعالى ] ( وما قتلوه يقينا بل رفعه الله إليه وكان الله عزيزا حكيما وإن من أهل الكتاب إلا ليؤمنن به قبل موته ويوم القيامة يكون عليهم شهيدا ) [ النساء : 156 - 159 ] والضمير في قوله : ( قبل موته ) عائد على عيسى ، عليه السلام ، أي : وإن من أهل الكتاب إلا يؤمن بعيسى قبل موت عيسى ، وذلك حين ينزل إلى الأرض قبل يوم القيامة ، على ما سيأتي بيانه ، فحينئذ يؤمن به أهل الكتاب كلهم ، لأنه يضع الجزية ولا يقبل إلا الإسلام .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا أحمد بن عبد الرحمن ، حدثنا عبد الله بن أبي جعفر ، عن أبيه ، حدثنا الربيع بن أنس ، عن الحسن أنه قال في قوله : ( إني متوفيك ) يعني وفاة المنام ، رفعه الله في منامه . قال الحسن : قال رسول الله صلى الله عليه وسلم لليهود : \" إن عيسى لم يمت ، وإنه راجع إليكم قبل يوم القيامة \" .\nوقوله تعالى : ( ومطهرك من الذين كفروا ) أي : برفعي إياك إلى السماء ( وجاعل الذين اتبعوك فوق الذين كفروا إلى يوم القيامة ) وهكذا وقع ، فإن المسيح ، عليه السلام ، لما رفعه الله إلى السماء تفرقت أصحابه شيعا بعده ، فمنهم من آمن بما بعثه الله به على أنه عبد الله ورسوله وابن أمته ، ومنهم من غلا فيه فجعله ابن الله ، وآخرون قالوا : هو الله . وآخرون قالوا : هو ثالث ثلاثة . وقد حكى الله مقالاتهم في القرآن ، ورد على كل فريق ، فاستمروا كذلك قريبا من ثلاثمائة سنة ، ثم نبع لهم ملك من ملوك اليونان ، يقال له : قسطنطين ، فدخل في دين النصرانية ، قيل : حيلة ليفسده ، فإنه كان فيلسوفا ، وقيل : جهلا منه ، إلا أنه بدل لهم دين المسيح وحرفه ، وزاد فيه ونقص منه ، ووضعت له القوانين والأمانة الكبيرة - التي هي الخيانة الحقيرة - وأحل في زمانه لحم الخنزير ، وصلوا له إلى المشرق وصوروا له الكنائس ، وزادوا في صيامهم عشرة أيام من أجل ذنب ارتكبه ، فيما يزعمون . وصار دين المسيح دين قسطنطين إلا أنه بنى لهم من الكنائس والمعابد والصوامع والديارات ما يزيد على اثني عشر ألف معبد ، وبنى المدينة المنسوبة إليه ، واتبعه الطائفة الملكية منهم . وهم في هذا كله قاهرون لليهود ، أيدهم الله عليهم لأنهم أقرب إلى الحق منهم ، وإن كان الجميع كفارا ، عليهم لعائن الله .\nفلما بعث الله محمدا صلى الله عليه وسلم ، فكان من آمن به يؤمن بالله وملائكته وكتبه ورسله على الوجه الحق - كانوا هم أتباع كل نبي على وجه الأرض - إذ قد صدقوا الرسول النبي الأمي ، خاتم الرسل ، وسيد ولد آدم ، الذي دعاهم إلى التصديق بجميع الحق ، فكانوا أولى بكل نبي من أمته ، الذين يزعمون أنهم على ملته وطريقته ، مع ما قد حرفوا وبدلوا .\nثم لو لم يكن شيء من ذلك لكان قد نسخ الله بشريعته شريعة جميع الرسل بما بعث به محمدا صلى الله عليه وسلم من الدين الحق ، الذي لا يغير ولا يبدل إلى قيام الساعة ، ولا يزال قائما منصورا ظاهرا على كل دين . فلهذا فتح الله لأصحابه مشارق الأرض ومغاربها ، واحتازوا جميع الممالك ، ودانت لهم جميع الدول ، وكسروا كسرى ، وقصروا قيصر ، وسلبوهما كنوزهما ، وأنفقت في سبيل الله ، كما أخبرهم بذلك نبيهم عن ربهم ، عز وجل ، في قوله : ( وعد الله الذين آمنوا منكم وعملوا الصالحات ليستخلفنهم في الأرض كما استخلف الذين من قبلهم وليمكنن لهم دينهم الذي ارتضى لهم وليبدلنهم من بعد خوفهم أمنا ) الآية [ النور : 65 ] ولهذا لما كانوا هم المؤمنين بالمسيح حقا سلبوا النصارى بلاد الشام وأجلوهم إلى الروم ، فلجئوا إلى مدينتهم القسطنطينية ، ولا يزال الإسلام وأهله فوقهم إلى يوم القيامة . وقد أخبر الصادق المصدوق أمته بأن آخرهم سيفتحون القسطنطينية ، ويستفيئون ما فيها من الأموال ، ويقتلون الروم مقتلة عظيمة جدا ، لم ير الناس مثلها ولا يرون بعدها نظيرها ، وقد جمعت في هذا جزءا مفردا . ولهذا قال تعالى : ( وجاعل الذين اتبعوك فوق الذين كفروا إلى يوم القيامة ثم إلي مرجعكم ) أي : يوم القيامة ( فأحكم بينكم فيما كنتم فيه تختلفون)\n                                    ",
        "qortoby": "إِذۡ قَالَ ٱللَّهُ يَٰعِيسَىٰٓ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُواْ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوۡقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۖ ثُمَّ إِلَيَّ مَرۡجِعُكُمۡ فَأَحۡكُمُ بَيۡنَكُمۡ فِيمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٥٥\n                                    \n                                    \n                                    إِذْ قَالَ اللَّهُ يَا عِيسَى إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ الَّذِينَ كَفَرُوا العامل في \" إذ \" مكروا , أو فعل مضمر .\nوقال جماعة من أهل المعاني منهم الضحاك والفراء في قوله تعالى : \" إني متوفيك ورافعك إلي \" على التقديم والتأخير ; لأن الواو لا توجب الرتبة .\nوالمعنى : إنى رافعك إلي ومطهرك من الذين كفروا ومتوفيك بعد أن تنزل من السماء ; كقوله : \" ولولا كلمة سبقت من ربك لكان لزاما وأجل مسمى \" [ طه : 129 ] ; والتقدير ولولا كلمة سبقت من ربك وأجل مسمى لكان لزاما .\nقال الشاعر : ألا يا نخلة من ذات عرق عليك ورحمة الله السلام أي عليك السلام ورحمة الله .\nوقال الحسن وابن جريج : معنى متوفيك قابضك ورافعك إلى السماء من غير موت ; مثل توفيت مالي من فلان أي قبضته .\nوقال وهب بن منبه : توفى الله عيسى عليه السلام ثلاث ساعات من نهار ثم رفعه إلى السماء .\nوهذا فيه بعد ; فإنه صح في الأخبار عن النبي صلى الله عليه وسلم نزوله وقتله الدجال على ما بيناه في كتاب التذكرة , وفي هذا الكتاب حسب ما تقدم , ويأتي .\nوقال ابن زيد : متوفيك قابضك , ومتوفيك ورافعك واحد ولم يمت بعد .\nوروى ابن طلحة عن ابن عباس معنى متوفيك مميتك .\nالربيع بن أنس : وهي وفاة نوم ; قال الله تعالى : \" وهو الذي يتوفاكم بالليل \" [ الأنعام : 60 ] أي ينيمكم لأن النوم أخو الموت ; كما قال صلى الله عليه وسلم لما سئل : أفي الجنة نوم ؟ قال : ( لا النوم أخو الموت , والجنة لا موت فيها ) .\nأخرجه الدارقطني .\nوالصحيح أن الله تعالى رفعه إلى السماء من غير وفاة ولا نوم كما قال الحسن وابن زيد , وهو اختيار الطبري , وهو الصحيح عن ابن عباس , وقاله الضحاك .\nقال الضحاك : كانت القصة لما أرادوا قتل عيسى اجتمع الحواريون في غرفة وهم اثنا عشر رجلا فدخل عليهم المسيح من مشكاة الغرفة , فأخبر إبليس جمع اليهود فركب منهم أربعة آلاف رجل فأخذوا باب الغرفة .\nفقال المسيح للحواريين : أيكم يخرج ويقتل ويكون معي في الجنة ؟ فقال رجل : أنا يا نبي الله ; فألقى إليه مدرعة من صوف وعمامة من صوف وناوله عكازه وألقى عليه شبه عيسى , فخرج على اليهود فقتلوه وصلبوه .\nوأما المسيح فكساه الله الريش وألبسه النور وقطع عنه لذة المطعم والمشرب فطار مع الملائكة .\nوذكر أبو بكر بن أبي شيبة حدثنا أبو معاوية حدثنا الأعمش عن المنهال عن سعيد بن جبير عن ابن عباس قال : لما أراد الله تبارك وتعالى أن يرفع عيسى إلى السماء خرج على أصحابه وهم اثنا عشر رجلا من عين في البيت ورأسه يقطر ماء فقال لهم : أما إن منكم من سيكفر بي اثنتي عشرة مرة بعد أن آمن بي , ثم قال : أيكم يلقى عليه شبهي فيقتل مكاني ويكون معي في درجتي ؟ فقام شاب من أحدثهم فقال أنا .\nفقال عيسى : اجلس , ثم أعاد عليهم فقام الشاب فقال أنا .\nفقال عيسى : اجلس .\nثم أعاد عليهم فقام الشاب فقال أنا .\nفقال نعم أنت ذاك .\nفألقى الله عليه شبه عيسى عليه السلام .\nقال : ورفع الله تعالى عيسى من روزنة كانت في البيت إلى السماء .\nقال : وجاء الطلب من اليهود فأخذوا الشبيه فقتلوه ثم صلبوه , وكفر به بعضهم اثنتي عشرة مرة بعد أن آمن به ; فتفرقوا ثلاث فرق : قالت فرقة : كان فينا الله ما شاء ثم صعد إلى السماء , وهؤلاء اليعقوبية .\nوقالت فرقة : كان فينا ابن الله ما شاء الله ثم رفعه الله إليه , وهؤلاء النسطورية .\nوقالت فرقة : كان فينا عبد الله ورسوله ما شاء الله ثم رفعه إليه , وهؤلاء المسلمون .\nفتظاهرت الكافرتان على المسلمة فقتلوها , فلم يزل الإسلام طامسا حتى بعث الله محمدا صلى الله عليه وسلم فقتلوا ; فأنزل الله تعالى : \" فآمنت طائفة من بني إسرائيل وكفرت طائفة فأيدنا الذين آمنوا \" [ الصف : 14 ] أي آمن آباؤهم في زمن عيسى \" على عدوهم \" بإظهار دينهم على دين الكفار \" فأصبحوا ظاهرين \" .\nوفي صحيح مسلم عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم : ( والله لينزلن ابن مريم حكما عادلا فليكسرن الصليب وليقتلن الخنزير وليضعن الجزية ولتتركن القلاص فلا يسعى عليها ولتذهبن الشحناء والتباغض والتحاسد وليدعون إلى المال فلا يقبله أحد ) .\nوعنه أيضا عن النبي صلى الله عليه وسلم قال : ( والذي نفسي بيده ليهلن ابن مريم بفج الروحاء حاجا أو معتمرا أو ليثنينهما ) ولا ينزل بشرع مبتدإ فينسخ به شريعتنا بل ينزل مجددا لما درس منها متبعا .\nكما في صحيح مسلم عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : ( كيف أنتم إذا نزل ابن مريم فيكم وإمامكم منكم ) .\nوفي رواية : ( فأمكم منكم ) .\nقال ابن أبي ذئب : تدري ما أمكم منكم ؟ .\nقلت : تخبرني .\nقال : فأمكم بكتاب ربكم تبارك وتعالى وسنة نبيكم صلى الله عليه وسلم .\nوقد زدنا هذا الباب بيانا في كتاب ( التذكرة ) والحمد لله .\nو \" متوفيك \" أصله متوفيك حذفت الضمة استثقالا , وهو خبر إن .\n\" ورافعك \" عطف عليه , وكذا \" مطهرك \" وكذا \" وجاعل الذين اتبعوك \" .\nويجوز \" وجاعل الذين \" وهو الأصل .\nوقيل : إن الوقف التام عند قوله : \" ومطهرك من الذين كفروا \" .\nقال النحاس : وهو قول حسن . كَفَرُوا وَجَاعِلُ الَّذِينَ يا محمد اتَّبَعُوكَ فَوْقَ الَّذِينَ كَفَرُوا إِلَى يَوْمِ الْقِيَامَةِ ثُمَّ إِلَيَّ مَرْجِعُكُمْ فَأَحْكُمُ بَيْنَكُمْ فِيمَا كُنْتُمْ فِيهِ أي بالحجة وإقامة البرهان .\nوقيل بالعز والغلبة .\nوقال الضحاك ومحمد بن أبان : المراد الحواريون .\nوالله تعالى أعلم .\n                                    ",
        "saadi": "إِذۡ قَالَ ٱللَّهُ يَٰعِيسَىٰٓ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُواْ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوۡقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۖ ثُمَّ إِلَيَّ مَرۡجِعُكُمۡ فَأَحۡكُمُ بَيۡنَكُمۡ فِيمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٥٥\n                                        \n                                        \n                                        \n                                        { إذ قال الله يا عيسى إني متوفيك ورافعك إلي ومطهرك من الذين كفروا } فرفع الله عبده ورسوله عيسى إليه، وألقي شبهه على غيره، فأخذوا من ألقي شبهه عليه فقتلوه وصلبوه، وباءوا بالإثم العظيم بنيتهم أنه رسول الله، قال الله { وما قتلوه وما صلبوه ولكن شبه لهم } وفي هذه الآية دليل على علو الله تعالى واستوائه على عرشه حقيقة، كما دلت على ذلك النصوص القرآنية والأحاديث النبوية التي تلقاها أهل السنة بالقبول والإيمان والتسليم، وكان الله عزيزا قويا قاهرا، ومن عزته أن كف بني إسرائيل بعد عزمهم الجازم وعدم المانع لهم عن قتل عيسى عليه السلام، كما قال تعالى { وإذ كففت بني إسرائيل عنك إذ جئتهم بالبينات فقال الذين كفروا منهم إن هذا إلا سحر مبين } حكيم يضع الأشياء مواضعها، وله أعظم حكمة في إلقاء الشبه على بني إسرائيل، فوقعوا في الشبه كما قال تعالى { وإن الذين اختلفوا فيه لفي شك منه ما لهم به من علم إلا اتباع الظن وما قتلوه يقينا } ثم قال تعالى: { وجاعل الذين اتبعوك فوق الذين كفروا إلى يوم القيامة } وتقدم أن الله أيد المؤمنين منهم على الكافرين، ثم إن النصارى المنتسبين لعيسى عليه السلام لم يزالوا قاهرين لليهود لكون النصارى أقرب إلى اتباع عيسى من اليهود، حتى بعث الله نبينا محمدا صلى الله عليه وسلم فكان المسلمون هم المتبعين لعيسى حقيقة، فأيدهم الله ونصرهم على اليهود والنصارى وسائر الكفار، وإنما يحصل في بعض الأزمان إدالة الكفار من النصارى وغيرهم على المسلمين، حكمة من الله وعقوبة على تركهم لاتباع الرسول صلى الله عليه وسلم { ثم إلي مرجعكم } أي: مصير الخلائق كلها { فأحكم بينكم فيما كنتم فيه تختلفون } كل يدعي أن الحق معه وأنه المصيب وغيره مخطئ، وهذا مجرد دعاوى تحتاج إلى برهان.\n                                    "
      },
      "originalText": "إِذۡ قَالَ ٱللَّهُ يَٰعِيسَىٰٓ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُواْ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوۡقَ ٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۖ ثُمَّ إِلَيَّ مَرۡجِعُكُمۡ فَأَحۡكُمُ بَيۡنَكُمۡ فِيمَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ ٥٥"
    },
    {
      "number": 349,
      "text": "فَأَمَّا الَّذِينَ كَفَرُوا فَأُعَذِّبُهُمْ عَذَابًا شَدِيدًا فِي الدُّنْيَا وَالْآخِرَةِ وَمَا لَهُمْ مِنْ نَاصِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 56,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَأَمَّا ٱلَّذِينَ كَفَرُواْ فَأُعَذِّبُهُمۡ عَذَابٗا شَدِيدٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ ٦٥\n                                    \n                                    \n                                    ( فأما الذين كفروا فأعذبهم عذابا شديدا في الدنيا والآخرة وما لهم من ناصرين ) وكذلك فعل تعالى بمن كفر بالمسيح من اليهود ، أو غلا فيه وأطراه من النصارى ، عذبهم في الدنيا بالقتل والسبي وأخذ الأموال وإزالة الأيدي عن الممالك ، وفي الدار الآخرة عذابهم أشد وأشق ( وما لهم من الله من واق ) [ الرعد : 34 ] .\n                                    ",
        "qortoby": "فَأَمَّا ٱلَّذِينَ كَفَرُواْ فَأُعَذِّبُهُمۡ عَذَابٗا شَدِيدٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ ٦٥\n                                    \n                                    \n                                    يعني بالقتل والصلب والسبي والجزية , وفي الآخرة بالنار\n                                    ",
        "saadi": "فَأَمَّا ٱلَّذِينَ كَفَرُواْ فَأُعَذِّبُهُمۡ عَذَابٗا شَدِيدٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ ٦٥\n                                        \n                                        \n                                        \n                                        ثم أخبر عن حكمه بينهم بالقسط والعدل، فقال { فأما الذين كفروا } أي: بالله وآياته ورسله { فأعذبهم عذابا شديدا في الدنيا والآخرة } أما عذاب الدنيا، فهو ما أصابهم الله به من القوارع والعقوبات المشاهدة والقتل والذل، وغير ذلك مما هو نموذج من عذاب الآخرة، وأما عذاب الآخرة فهو الطامة الكبرى والمصيبة العظمى، ألا وهو عذاب النار وغضب الجبار وحرمانهم ثواب الأبرار { وما لهم من ناصرين } ينصرونهم من عذاب الله، لا من زعموا أنهم شفعاء لهم عند الله، ولا ما اتخذوهم أولياء من دونه، ولا أصدقائهم وأقربائهم، ولا أنفسهم ينصرون.\n                                    "
      },
      "originalText": "فَأَمَّا ٱلَّذِينَ كَفَرُواْ فَأُعَذِّبُهُمۡ عَذَابٗا شَدِيدٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمَا لَهُم مِّن نَّٰصِرِينَ ٦٥"
    },
    {
      "number": 350,
      "text": "وَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُوَفِّيهِمْ أُجُورَهُمْ ۗ وَاللَّهُ لَا يُحِبُّ الظَّالِمِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 57,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّٰلِمِينَ ٧٥\n                                    \n                                    \n                                    \"وأما الذين آمنوا وعملوا الصالحات فيوفيهم أجورهم\" أي في الدنيا والآخرة في الدنيا بالنصر والظفر وفي الآخرة بالجنات العاليات \"والله لا يحب الظالمين\".\n                                    ",
        "qortoby": "وَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّٰلِمِينَ ٧٥\n                                    \n                                    \n                                    \n                                    ",
        "saadi": "وَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّٰلِمِينَ ٧٥\n                                        \n                                        \n                                        \n                                        { وأما الذين آمنوا } بالله وملائكته وكتبه ورسله والبعث بعد الموت وغير ذلك مما أمر الله بالإيمان به { وعملوا الصالحات } القلبية والقولية والبدنية التي جاءت بشرعها المرسلون، وقصدوا بها رضا رب العالمين { فيوفيهم أجورهم } دل ذلك على أنه يحصل لهم في الدنيا ثواب لأعمالهم من الإكرام والإعزاز والنصر والحياة الطيبة، وإنما توفية الأجور يوم القيامة، يجدون ما قدموه من الخيرات محضرا موفرا، فيعطي منهم كل عامل أجر عمله ويزيدهم من فضله وكرمه { والله لا يحب الظالمين } بل يبغضهم ويحل عليهم سخطه وعذابه.\n                                    "
      },
      "originalText": "وَأَمَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ فَيُوَفِّيهِمۡ أُجُورَهُمۡۗ وَٱللَّهُ لَا يُحِبُّ ٱلظَّٰلِمِينَ ٧٥"
    },
    {
      "number": 351,
      "text": "ذَٰلِكَ نَتْلُوهُ عَلَيْكَ مِنَ الْآيَاتِ وَالذِّكْرِ الْحَكِيمِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 58,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَٰلِكَ نَتۡلُوهُ عَلَيۡكَ مِنَ ٱلۡأٓيَٰتِ وَٱلذِّكۡرِ ٱلۡحَكِيمِ ٨٥\n                                    \n                                    \n                                    ثم قال تعالى : ( ذلك نتلوه عليك من الآيات والذكر الحكيم ) أي : هذا الذي قصصناه عليك يا محمد في أمر عيسى ومبدأ ميلاده وكيفية أمره ، هو مما قاله الله تعالى ، وأوحاه إليك ونزله عليك من اللوح المحفوظ ، فلا مرية فيه ولا شك ، كما قال تعالى في سورة مريم : ( ذلك عيسى ابن مريم قول الحق الذي فيه يمترون . ما كان لله أن يتخذ من ولد سبحانه إذا قضى أمرا فإنما يقول له كن فيكون ) [ مريم : 34 - 35 ] وهاهنا قال تعالى .\n                                    ",
        "qortoby": "ذَٰلِكَ نَتۡلُوهُ عَلَيۡكَ مِنَ ٱلۡأٓيَٰتِ وَٱلذِّكۡرِ ٱلۡحَكِيمِ ٨٥\n                                    \n                                    \n                                    ذلك نتلوه عليك ذلك في موضع رفع بالابتداء وخبره نتلوه . ويجوز : الأمر ذلك ، على إضمار المبتدأ .\n                                    ",
        "saadi": "ذَٰلِكَ نَتۡلُوهُ عَلَيۡكَ مِنَ ٱلۡأٓيَٰتِ وَٱلذِّكۡرِ ٱلۡحَكِيمِ ٨٥\n                                        \n                                        \n                                        \n                                        { ذلك نتلوه عليك من الآيات والذكر الحكيم } وهذا منة عظيمة على رسوله محمد صلى الله عليه وسلم وعلى أمته، حيث أنزل عليهم هذا الذكر الحكيم، المحكم المتقن، المفصل للأحكام والحلال والحرام وإخبار الأنبياء الأقدمين، وما أجرى الله على أيديهم من الآيات البينات والمعجزات الباهرات، فهذا القرآن يقص علينا كل ما ينفعنا من الأخبار والأحكام، فيحصل فيها العلم والعبرة وتثبيت الفؤاد ما هو من أعظم رحمة رب العباد\n                                    "
      },
      "originalText": "ذَٰلِكَ نَتۡلُوهُ عَلَيۡكَ مِنَ ٱلۡأٓيَٰتِ وَٱلذِّكۡرِ ٱلۡحَكِيمِ ٨٥"
    },
    {
      "number": 352,
      "text": "إِنَّ مَثَلَ عِيسَىٰ عِنْدَ اللَّهِ كَمَثَلِ آدَمَ ۖ خَلَقَهُ مِنْ تُرَابٍ ثُمَّ قَالَ لَهُ كُنْ فَيَكُونُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 59,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ مَثَلَ عِيسَىٰ عِندَ ٱللَّهِ كَمَثَلِ ءَادَمَۖ خَلَقَهُۥ مِن تُرَابٖ ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ ٩٥\n                                    \n                                    \n                                    يقول تعالى : ( إن مثل عيسى عند الله ) في قدرة الله تعالى حيث خلقه من غير أب ( كمثل آدم ) فإن الله تعالى خلقه من غير أب ولا أم ، بل ( خلقه من تراب ثم قال له كن فيكون ) والذي خلق آدم قادر على خلق عيسى بطريق الأولى والأحرى ، وإن جاز ادعاء البنوة في عيسى بكونه مخلوقا من غير أب ، فجواز ذلك في آدم بالطريق الأولى ، ومعلوم بالاتفاق أن ذلك باطل ، فدعواها في عيسى أشد بطلانا وأظهر فسادا . ولكن الرب ، عز وجل ، أراد أن يظهر قدرته لخلقه ، حين خلق آدم لا من ذكر ولا من أنثى ، وخلق حواء من ذكر بلا أنثى ، وخلق عيسى من أنثى بلا ذكر كما خلق بقية البرية من ذكر وأنثى ، ولهذا قال تعالى في سورة مريم : ( ولنجعله آية للناس ) [ مريم : 21 ] .\n                                    ",
        "qortoby": "إِنَّ مَثَلَ عِيسَىٰ عِندَ ٱللَّهِ كَمَثَلِ ءَادَمَۖ خَلَقَهُۥ مِن تُرَابٖ ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ ٩٥\n                                    \n                                    \n                                    قوله تعالى : إن مثل عيسى عند الله كمثل آدم خلقه من تراب ثم قال له كن فيكون\nقوله تعالى : إن مثل عيسى عند الله كمثل آدم خلقه من تراب دليل على صحة القياس . والتشبيه واقع على أن عيسى خلق من غير أب كآدم ، لا على أنه خلق من تراب . والشيء قد يشبه بالشيء وإن كان بينهما فرق كبير بعد أن يجتمعا في وصف واحد ; فإن آدم خلق من تراب ولم يخلق عيسى من تراب فكان بينهما فرق من هذه الجهة ، ولكن شبه ما بينهما أنهما خلقهما من غير أب ; ولأن أصل خلقتهما كان من تراب لأن آدم لم يخلق من نفس التراب ، ولكنه جعل التراب طينا ثم جعله صلصالا ثم خلقه منه ، فكذلك عيسى حوله من حال إلى حال ، ثم جعله بشرا من غير أب . ونزلت هذه الآية بسبب وفد نجران حين أنكروا على النبي - صلى الله عليه وسلم - قوله : ( إن عيسى عبد الله وكلمته ) فقالوا : أرنا عبدا خلق من غير أب ; فقال لهم النبي - صلى الله عليه وسلم - : ( آدم من كان أبوه أعجبتم من عيسى ليس له أب ؟ فآدم عليه السلام ليس له أب ولا أم ) . فذلك قوله تعالى : ولا يأتونك بمثل أي في عيسى إلا جئناك بالحق في آدم وأحسن تفسيرا وروي أنه عليه السلام لما دعاهم إلى الإسلام قالوا : قد كنا مسلمين قبلك . فقال : ( كذبتم يمنعكم من الإسلام ثلاث : قولكم اتخذ الله ولدا ، وأكلكم الخنزير ، وسجودكم للصليب ) . فقالوا : من أبو عيسى ؟ فأنزل الله تعالى : إن مثل عيسى عند الله كمثل آدم خلقه من تراب إلى قوله : فنجعل لعنة الله على الكاذبين . فدعاهم النبي - صلى الله عليه وسلم - فقال بعضهم لبعض : إن فعلتم اضطرم الوادي عليكم نارا . فقالوا : أما تعرض علينا سوى هذا ؟ فقال : ( الإسلام أو الجزية أو الحرب ) فأقروا بالجزية على ما يأتي . وتم الكلام عند قوله ( آدم ) .\nثم قال خلقه من تراب ثم قال له كن فيكون أي فكان . والمستقبل يكون في موضع الماضي إذا عرف المعنى .\n                                    ",
        "saadi": "إِنَّ مَثَلَ عِيسَىٰ عِندَ ٱللَّهِ كَمَثَلِ ءَادَمَۖ خَلَقَهُۥ مِن تُرَابٖ ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ ٩٥\n                                        \n                                        \n                                        \n                                        يخبر تعالى محتجا على النصارى الزاعمين بعيسى عليه السلام ما ليس له بحق، بغير برهان ولا شبهة، بل بزعمهم أنه ليس له والد استحق بذلك أن يكون ابن الله أو شريكا لله في الربوبية، وهذا ليس بشبهة فضلا أن يكون حجة، لأن خلقه كذلك من آيات الله الدالة على تفرد الله بالخلق والتدبير وأن جميع الأسباب طوع مشيئته وتبع لإرادته، فهو على نقيض قولهم أدل، وعلى أن أحدا لا يستحق المشاركة لله بوجه من الوجوه أولى، ومع هذا فآدم عليه السلام خلقه الله من تراب لا من أب ولا أم، فإذا كان ذلك لا يوجب لآدم ما زعمه النصارى في المسيح، فالمسيح المخلوق من أم بلا أب من باب أولى وأحرى، فإن صح إدعاء البنوة والإلهية في المسيح، فادعاؤها في آدم من باب أولى وأحرى، فلهذا قال تعالى { إن مثل عيسى عند الله كمثل آدم خلقه من تراب ثم قال له كن فيكون}\n                                    "
      },
      "originalText": "إِنَّ مَثَلَ عِيسَىٰ عِندَ ٱللَّهِ كَمَثَلِ ءَادَمَۖ خَلَقَهُۥ مِن تُرَابٖ ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ ٩٥"
    },
    {
      "number": 353,
      "text": "الْحَقُّ مِنْ رَبِّكَ فَلَا تَكُنْ مِنَ الْمُمْتَرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 60,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ ٱلۡمُمۡتَرِينَ ٠٦\n                                    \n                                    \n                                    وقال هاهنا : ( الحق من ربك فلا تكن من الممترين ) أي : هذا القول هو الحق في عيسى ، الذي لا محيد عنه ولا صحيح سواه ، وماذا بعد الحق إلا الضلال .\n                                    ",
        "qortoby": "ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ ٱلۡمُمۡتَرِينَ ٠٦\n                                    \n                                    \n                                    قال الفراء : الحق من ربك مرفوع بإضمار هو . أبو عبيدة : هو استئناف كلام وخبره في قوله من ربك . وقيل هو فاعل ، أي جاءك الحق .\nفلا تكن من الممترين الخطاب للنبي - صلى الله عليه وسلم - والمراد أمته ; لأنه - صلى الله عليه وسلم - لم يكن شاكا في أمرعيسى عليه السلام .\n                                    ",
        "saadi": "ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ ٱلۡمُمۡتَرِينَ ٠٦\n                                        \n                                        \n                                        \n                                        الحق من ربك } أي: هذا الذي أخبرناك به من شأن المسيح عليه السلام هو الحق الذي في أعلى رتب الصدق، لكونه من ربك الذي من جملة تربيته الخاصة لك ولأمتك أن قص عليكم ما قص من أخبار الأنبياء عليهم السلام. { فلا تكن من الممترين } أي: الشاكين في شيء مما أخبرك به ربك، وفي هذه الآية وما بعدها دليل على قاعدة شريفة وهو أن ما قامت الأدلة على أنه حق وجزم به العبد من مسائل العقائد وغيرها، فإنه يجب أن يجزم بأن كل ما عارضه فهو باطل، وكل شبهة تورد عليه فهي فاسدة، سواء قدر العبد على حلها أم لا، فلا يوجب له عجزه عن حلها القدح فيما علمه، لأن ما خالف الحق فهو باطل، قال تعالى { فماذا بعد الحق إلا الضلال } وبهذه القاعدة الشرعية تنحل عن الإنسان إشكالات كثيرة يوردها المتكلمون ويرتبها المنطقيون، إن حلها الإنسان فهو تبرع منه، وإلا فوظيفته أن يبين الحق بأدلته ويدعو إليه.\n                                    "
      },
      "originalText": "ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُن مِّنَ ٱلۡمُمۡتَرِينَ ٠٦"
    },
    {
      "number": 354,
      "text": "فَمَنْ حَاجَّكَ فِيهِ مِنْ بَعْدِ مَا جَاءَكَ مِنَ الْعِلْمِ فَقُلْ تَعَالَوْا نَدْعُ أَبْنَاءَنَا وَأَبْنَاءَكُمْ وَنِسَاءَنَا وَنِسَاءَكُمْ وَأَنْفُسَنَا وَأَنْفُسَكُمْ ثُمَّ نَبْتَهِلْ فَنَجْعَلْ لَعْنَتَ اللَّهِ عَلَى الْكَاذِبِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 61,
      "juz": 3,
      "manzil": 1,
      "page": 57,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَمَنۡ حَآجَّكَ فِيهِ مِنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ فَقُلۡ تَعَالَوۡاْ نَدۡعُ أَبۡنَآءَنَا وَأَبۡنَآءَكُمۡ وَنِسَآءَنَا وَنِسَآءَكُمۡ وَأَنفُسَنَا وَأَنفُسَكُمۡ ثُمَّ نَبۡتَهِلۡ فَنَجۡعَل لَّعۡنَتَ ٱللَّهِ عَلَى ٱلۡكَٰذِبِينَ ١٦\n                                    \n                                    \n                                    ثم قال تعالى - آمرا رسوله صلى الله عليه وسلم أن يباهل من عاند الحق في أمر عيسى بعد ظهور البيان : ( فمن حاجك فيه من بعد ما جاءك من العلم فقل تعالوا ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم ) أي : نحضرهم في حال المباهلة ( ثم نبتهل فنجعل لعنة الله على الكاذبين ) أي : نلتعن ( فنجعل لعنة الله على الكاذبين ) أي : منا أو منكم .\nوكان سبب نزول هذه المباهلة وما قبلها من أول السورة إلى هنا في وفد نجران ، أن النصارى حين قدموا فجعلوا يحاجون في عيسى ، ويزعمون فيه ما يزعمون من البنوة والإلهية ، فأنزل الله صدر هذه السورة ردا عليهم ، كما ذكره الإمام محمد بن إسحاق بن يسار وغيره .\nقال ابن إسحاق في سيرته المشهورة وغيره : وقدم على رسول الله صلى الله عليه وسلم وفد نصارى نجران ، ستون راكبا ، فيهم أربعة عشر رجلا من أشرافهم يئول إليهم أمرهم ، وهم : العاقب ، واسمه عبد المسيح ، والسيد ، وهو الأيهم ، وأبو حارثة بن علقمة أخو بكر بن وائل ، وأوس بن الحارث وزيد ، وقيس ، ويزيد ، ونبيه ، وخويلد ، وعمرو ، وخالد ، وعبد الله ، ويحنس .\nوأمر هؤلاء يئول إلى ثلاثة منهم ، وهم : العاقب وكان أمير القوم وذا رأيهم وصاحب مشورتهم ، والذي لا يصدرون إلا عن رأيه ، والسيد وكان عالمهم وصاحب رحلهم ومجتمعهم ، وأبو حارثة بن علقمة وكان أسقفهم وحبرهم وإمامهم وصاحب مدارسهم ، وكان رجلا من العرب من بني بكر بن وائل ، ولكنه تنصر ، فعظمته الروم وملوكها وشرفوه ، وبنوا له الكنائس ومولوه وأخدموه ، لما يعلمونه من صلابته في دينهم . وقد كان يعرف أمر رسول الله صلى الله عليه وسلم وشأنه وصفته بما علمه من الكتب المتقدمة جيدا ، ولكن احتمله جهله على الاستمرار في النصرانية لما يرى [ من ] تعظيمه فيها ووجاهته عند أهلها .\nقال ابن إسحاق : وحدثني محمد بن جعفر بن الزبير ، قال : قدموا على رسول الله صلى الله عليه وسلم المدينة فدخلوا عليه مسجده حين صلى العصر ، عليهم ثياب الحبرات : جبب وأردية ، في جمال رجال بني الحارث بن كعب . قال : يقول بعض من رآهم من أصحاب النبي صلى الله عليه وسلم : ما رأينا بعدهم وفدا مثلهم . وقد حانت صلاتهم ، فقاموا في مسجد رسول الله صلى الله عليه وسلم يصلون ، فقال رسول الله صلى الله عليه وسلم : دعوهم فصلوا إلى المشرق .\nقال : فكلم رسول الله صلى الله عليه وسلم منهم أبو حارثة بن علقمة ، والعاقب عبد المسيح ، أو السيد الأيهم ، وهم من النصرانية على دين الملك ، مع اختلاف أمرهم ، يقولون : هو الله ، ويقولون : هو ولد الله ، ويقولون : هو ثالث ثلاثة . تعالى الله [ عن ذلك علوا كبيرا ] وكذلك قول النصرانية ، فهم يحتجون في قولهم : \" هو الله \" بأنه كان يحيي الموتى ، ويبرئ الأسقام ، ويخبر بالغيوب ، ويخلق من الطين كهيئة الطير ، ثم ينفخ فيه فيكون طيرا وذلك كله بأمر الله ، وليجعله آية للناس .\nويحتجون في قولهم بأنه ابن الله ، يقولون : لم يكن له أب يعلم ، وقد تكلم في المهد بشيء لم يصنعه أحد من بني آدم قبله .\nويحتجون في قولهم بأنه ثالث ثلاثة ، بقول الله تعالى : فعلنا ، وأمرنا ، وخلقنا ، وقضينا ، فيقولون : لو كان واحدا ما قال إلا فعلت وقضيت وأمرت وخلقت ، ولكنه هو وعيسى ومريم وفي كل ذلك من قولهم قد نزل القرآن .\nفلما كلمه الحبران قال لهما رسول الله صلى الله عليه وسلم : \" أسلما \" قالا قد أسلمنا . قال : \" إنكما لم تسلما فأسلما \" قالا بلى ، قد أسلمنا قبلك . قال : \" كذبتما ، يمنعكما من الإسلام دعاؤكما لله ولدا ، وعبادتكما الصليب وأكلكما الخنزير \" . قالا فمن أبوه يا محمد ؟ فصمت رسول الله صلى الله عليه وسلم عنهما فلم يجبهما ، فأنزل الله في ذلك من قولهم ، واختلاف أمرهم ، صدر سورة آل عمران إلى بضع وثمانين آية منها .\nثم تكلم ابن إسحاق على التفسير إلى أن قال : فلما أتى رسول الله صلى الله عليه وسلم الخبر من الله ، والفصل من القضاء بينه وبينهم ، وأمر بما أمر به من ملاعنتهم إن ردوا ذلك عليه ، دعاهم إلى ذلك ، فقالوا : يا أبا القاسم ، دعنا ننظر في أمرنا ، ثم نأتيك بما نريد أن نفعل فيما دعوتنا إليه ، فانصرفوا عنه ، ثم خلوا بالعاقب ، وكان ذا رأيهم ، فقالوا : يا عبد المسيح ، ماذا ترى ؟ فقال : والله يا معشر النصارى لقد عرفتم أن محمدا لنبي مرسل ، ولقد جاءكم بالفصل من خبر صاحبكم ، ولقد علمتم أنه ما لاعن قوم نبيا قط فبقي كبيرهم ، ولا نبت صغيرهم ، وإنه للاستئصال منكم إن فعلتم ، فإن كنتم [ قد ] أبيتم إلا إلف دينكم والإقامة على ما أنتم عليه من القول في صاحبكم ، فوادعوا الرجل وانصرفوا إلى بلادكم .\nفأتوا النبي صلى الله عليه وسلم ، فقالوا : يا أبا القاسم ، قد رأينا ألا نلاعنك ، ونتركك على دينك ، ونرجع على ديننا ، ولكن ابعث معنا رجلا من أصحابك ترضاه لنا ، يحكم بيننا في أشياء اختلفنا فيها من أموالنا ، فإنكم عندنا رضا .\nقال محمد بن جعفر : فقال رسول الله صلى الله عليه وسلم : \" ائتوني العشية أبعث معكم القوي الأمين \" ، فكان عمر بن الخطاب يقول : ما أحببت الإمارة قط حبي إياها يومئذ ، رجاء أن أكون صاحبها ، فرحت إلى الظهر مهجرا ، فلما صلى رسول الله صلى الله عليه وسلم الظهر سلم ، ثم نظر عن يمينه وعن يساره ، فجعلت أتطاول له ليراني ، فلم يزل يلتمس ببصره حتى رأى أبا عبيدة بن الجراح ، فدعاه : \" اخرج معهم ، فاقض بينهم بالحق فيما اختلفوا فيه \" . قال عمر : فذهب بها أبو عبيدة ، رضي الله عنه .\nوقد روى ابن مردويه من طريق محمد بن إسحاق ، عن عاصم بن عمر بن قتادة ، عن محمود بن لبيد ، عن رافع بن خديج : أن وفد أهل نجران قدموا على رسول الله صلى الله عليه وسلم فذكر نحوه ، إلا أنه قال في الأشراف : كانوا اثني عشر . وذكر بقيته بأطول من هذا السياق ، وزيادات أخر .\nوقال البخاري : حدثنا عباس بن الحسين ، حدثنا يحيى بن آدم ، عن إسرائيل ، عن أبي إسحاق ، عن صلة بن زفر ، عن حذيفة قال : جاء العاقب والسيد صاحبا نجران إلى رسول الله صلى الله عليه وسلم يريدان أن يلاعناه ، قال : فقال أحدهما لصاحبه : لا تفعل ، فوالله إن كان نبيا فلاعناه لا نفلح نحن ولا عقبنا من بعدنا . قالا إنا نعطيك ما سألتنا ، وابعث معنا رجلا أمينا ، ولا تبعث معنا إلا أمينا . فقال : \" لأبعثن معكم رجلا أمينا حق أمين \" ، فاستشرف لها أصحاب رسول الله صلى الله عليه وسلم ، فقال : \" قم يا أبا عبيدة بن الجراح \" فلما قام قال رسول الله صلى الله عليه وسلم : \" هذا أمين هذه الأمة \" .\n[ و ] رواه البخاري أيضا ، ومسلم ، والترمذي ، والنسائي ، وابن ماجه من طرق عن أبي إسحاق السبيعي ، عن صلة ، عن حذيفة ، بنحوه .\nوقد رواه أحمد ، والنسائي ، وابن ماجه ، من حديث إسرائيل عن أبي إسحاق ، عن صلة عن ابن مسعود ، بنحوه .\nوقال البخاري : حدثنا أبو الوليد ، حدثنا شعبة ، عن خالد ، عن أبي قلابة ، عن أنس عن النبي صلى الله عليه وسلم قال : \" لكل أمة أمين وأمين هذه الأمة أبو عبيدة بن الجراح \" .\nوقال الإمام أحمد : حدثنا إسماعيل بن يزيد الرقي أبو يزيد ، حدثنا فرات ، عن عبد الكريم بن مالك الجزري \" عن عكرمة ، عن ابن عباس ، قال : قال أبو جهل : إن رأيت رسول الله صلى الله عليه وسلم يصلي عند الكعبة لآتينه حتى أطأ على عنقه . قال : فقال : \" لو فعل لأخذته الملائكة عيانا ، ولو أن اليهود تمنوا الموت لماتوا ورأوا مقاعدهم من النار ، ولو خرج الذين يباهلون رسول الله صلى الله عليه وسلم لرجعوا لا يجدون مالا ولا أهلا \" .\nوقد رواه الترمذي ، والنسائي ، من حديث عبد الرزاق ، عن معمر ، عن عبد الكريم ، به . وقال الترمذي : [ حديث ] حسن صحيح .\nوقد روى البيهقي في دلائل النبوة قصة وفد نجران مطولة جدا ، ولنذكره فإن فيه فوائد كثيرة ، وفيه غرابة وفيه مناسبة لهذا المقام ، قال البيهقي :\nحدثنا أبو عبد الله الحافظ وأبو سعيد محمد بن موسى بن الفضل ، قالا حدثنا أبو العباس محمد بن يعقوب ، حدثنا أحمد بن عبد الجبار ، حدثنا يونس بن بكير ، عن سلمة بن عبد يسوع ، عن أبيه ، عن جده قال يونس - وكان نصرانيا فأسلم - : إن رسول الله صلى الله عليه وسلم كتب إلى أهل نجران قبل أن ينزل عليه طس سليمان : \" باسم إله إبراهيم وإسحاق ويعقوب ، من محمد النبي رسول الله إلى أسقف نجران وأهل نجران سلم أنتم ، فإني أحمد إليكم إله إبراهيم وإسحاق ويعقوب . أما بعد ، فإني أدعوكم إلى عبادة الله من عبادة العباد ، وأدعوكم إلى ولاية الله من ولاية العباد ، فإن أبيتم فالجزية ، فإن أبيتم آذنتكم بحرب والسلام \" .\nفلما أتى الأسقف الكتاب فقرأه فظع به ، وذعره ذعرا شديدا ، وبعث إلى رجل من أهل نجران يقال له : شرحبيل بن وداعة - وكان من همدان ولم يكن أحد يدعى إذا نزلت معضلة قبله ، لا الأيهم ولا السيد ولا العاقب - فدفع الأسقف كتاب رسول الله صلى الله عليه وسلم إلى شرحبيل ، فقرأه ، فقال الأسقف : يا أبا مريم ، ما رأيك ؟ فقال شرحبيل : قد علمت ما وعد الله إبراهيم في ذرية إسماعيل من النبوة ، فما يؤمن أن يكون هذا هو ذاك الرجل ، ليس لي في النبوة رأي ، ولو كان أمر من أمور الدنيا لأشرت عليك فيه برأيي ، وجهدت لك ، فقال له الأسقف : تنح فاجلس . فتنحى شرحبيل فجلس ناحية ، فبعث الأسقف إلى رجل من أهل نجران ، يقال له : عبد الله بن شرحبيل ، وهو من ذي أصبح من حمير ، فأقرأه الكتاب ، وسأله عن الرأي فيه ، فقال له مثل قول شرحبيل ، فقال له الأسقف : فاجلس ، فتنحى فجلس ناحية . وبعث الأسقف إلى رجل من أهل نجران ، يقال له : جبار بن فيض ، من بني الحارث بن كعب ، أحد بني الحماس ، فأقرأه الكتاب ، وسأله عن الرأي فيه ؟ فقال له مثل قول شرحبيل وعبد الله ، فأمره الأسقف فتنحى فجلس ناحية .\nفلما اجتمع الرأي منهم على تلك المقالة جميعا ، أمر الأسقف بالناقوس فضرب به ، ورفعت النيران والمسوح في الصوامع ، وكذلك كانوا يفعلون إذا فزعوا بالنهار ، وإذا كان فزعهم ليلا ضربوا بالناقوس ، ورفعت النيران في الصوامع ، فاجتمعوا حين ضرب بالناقوس ورفعت المسوح أهل الوادي أعلاه وأسفله - وطول الوادي مسيرة يوم للراكب السريع ، وفيه ثلاث وسبعون قرية ، وعشرون ومائة ألف مقاتل . فقرأ عليهم كتاب رسول الله صلى الله عليه وسلم ، وسألهم عن الرأي فيه ، فاجتمع رأي أهل الرأي منهم على أن يبعثوا شرحبيل بن وداعة الهمداني ، وعبد الله بن شرحبيل الأصبحي ، وجبار بن فيض الحارثي ، فيأتونهم بخبر رسول الله صلى الله عليه وسلم . فانطلق الوفد حتى إذا كانوا بالمدينة وضعوا ثياب السفر عنهم ، ولبسوا حللا لهم يجرونها من حبرة ، وخواتيم الذهب ، ثم انطلقوا حتى أتوا رسول الله صلى الله عليه وسلم ، فسلموا عليه ، فلم يرد عليهم وتصدوا لكلامه نهارا طويلا فلم يكلمهم وعليهم تلك الحلل وخواتيم الذهب . فانطلقوا يتبعون عثمان بن عفان وعبد الرحمن بن عوف ، وكانا معرفة لهم ، فوجدوهما في ناس من المهاجرين والأنصار في مجلس ، فقالوا : يا عثمان ويا عبد الرحمن ، إن نبيكم كتب إلينا بكتاب ، فأقبلنا مجيبين له ، فأتيناه فسلمنا عليه فلم يرد سلامنا ، وتصدينا لكلامه نهارا طويلا فأعيانا أن يكلمنا ، فما الرأي منكما ، أترون أن نرجع ؟ فقالا لعلي بن أبي طالب - وهو في القوم - : ما ترى يا أبا الحسن في هؤلاء القوم ؟ فقال علي لعثمان ولعبد الرحمن : أرى أن يضعوا حللهم هذه وخواتيمهم ، ويلبسوا ثياب سفرهم ثم يعودا إليه . ففعلوا فسلموا ، فرد سلامهم ، ثم قال : \" والذي بعثني بالحق لقد أتوني المرة الأولى ، وإن إبليس لمعهم \" ثم ساءلهم وساءلوه ، فلم تزل به وبهم المسألة حتى قالوا : ما تقول في عيسى ، فإنا نرجع إلى قومنا ونحن نصارى ، يسرنا إن كنت نبيا أن نسمع ما تقول فيه ؟ قال رسول الله صلى الله عليه وسلم : \" ما عندي فيه شيء يومي هذا ، فأقيموا حتى أخبركم بما يقول لي ربي في عيسى \" . فأصبح الغد وقد أنزل الله ، عز وجل ، هذه الآية : ( إن مثل عيسى عند الله كمثل آدم [ خلقه من تراب ثم قال له كن فيكون . الحق من ربك فلا تكن من الممترين . فمن حاجك فيه من بعد ما جاءك من العلم فقل تعالوا ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم ثم نبتهل فنجعل لعنة الله على ] الكاذبين ) فأبوا أن يقروا بذلك ، فلما أصبح رسول الله صلى الله عليه وسلم الغد بعد ما أخبرهم الخبر ، أقبل مشتملا على الحسن والحسين في خميل له وفاطمة تمشي عند ظهره للملاعنة ، وله يومئذ عدة نسوة ، فقال شرحبيل لصاحبيه : قد علمتما أن الوادي إذا اجتمع أعلاه وأسفله لم يردوا ولم يصدروا إلا عن رأيي وإني والله أرى أمرا ثقيلا والله لئن كان هذا الرجل ملكا مبعوثا ، فكنا أول العرب طعن في عينيه ورد عليه أمره ، لا يذهب لنا من صدره ولا من صدور أصحابه حتى يصيبونا بجائحة ، وإنا لأدنى العرب منهم جوارا ، ولئن كان هذا الرجل نبيا مرسلا فلاعناه لا يبقى على وجه الأرض منا شعر ولا ظفر إلا هلك . فقال له صاحباه : يا أبا مريم ، فما الرأي ؟ فقال : أرى أن أحكمه ، فإني أرى رجلا لا يحكم شططا أبدا . فقالا له : أنت وذاك . قال : فلقيشرحبيل رسول الله صلى الله عليه وسلم ، فقال له : إني قد رأيت خيرا من ملاعنتك . فقال : \" وما هو ؟ \" فقال : حكمك اليوم إلى الليل وليلتك إلى الصباح ، فمهما حكمت فينا فهو جائز . فقال رسول الله صلى الله عليه وسلم : \" لعل وراءك أحدا يثرب عليك ؟ \" فقال شرحبيل : سل صاحبي . فسألهما فقالا ما يرد الوادي ولا يصدر إلا عن رأي شرحبيل : فرجع رسول الله صلى الله عليه وسلم فلم يلاعنهم ، حتى إذا كان الغد أتوه فكتب لهم هذا الكتاب : \" بسم الله الرحمن الرحيم ، هذا ما كتب محمد النبي رسول الله لنجران - إن كان عليهم حكمه - في كل ثمرة وكل صفراء وبيضاء وسوداء ورقيق فاضل عليهم ، وترك ذلك كله لهم ، على ألفي حلة ، في كل رجب ألف حلة ، وفي كل صفر ألف حلة \" وذكر تمام الشروط وبقية السياق .\nوالغرض أن وفودهم كان في سنة تسع ، لأن الزهري قال : كان أهل نجران أول من أدى الجزية إلى رسول الله صلى الله عليه وسلم ، وآية الجزية إنما أنزلت بعد الفتح ، وهي قوله تعالى : ( قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر [ ولا يحرمون ما حرم الله ورسوله ولا يدينون دين الحق من الذين أوتوا الكتاب حتى يعطوا الجزية عن يد وهم صاغرون ] ) [ التوبة : 29 ] .\nوقال أبو بكر بن مردويه : حدثنا سليمان بن أحمد ، حدثنا أحمد بن داود المكي ، حدثنا بشر بن مهران ، أخبرنا محمد بن دينار ، عن داود بن أبي هند ، عن الشعبي ، عن جابر قال : قدم على النبي صلى الله عليه وسلم العاقب والطيب ، فدعاهما إلى الملاعنة فواعداه على أن يلاعناه الغداة . قال : فغدا رسول الله صلى الله عليه وسلم ، فأخذ بيد علي وفاطمة والحسن والحسين ، ثم أرسل إليهما فأبيا أن يجيئا وأقرا بالخراج ، قال : فقال رسول الله صلى الله عليه وسلم : \" والذي بعثني بالحق لو قالا لا لأمطر عليهم الوادي نارا \" قال جابر : فيهم نزلت ( ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم ) قال جابر : ( وأنفسنا وأنفسكم ) رسول الله صلى الله عليه وسلم وعلي بن أبي طالب ) وأبناءنا ) : الحسن والحسين ( ونساءنا ) فاطمة .\nوهكذا رواه الحاكم في مستدركه ، عن علي بن عيسى ، عن أحمد بن محمد الأزهري عن علي بن حجر ، عن علي بن مسهر ، عن داود بن أبي هند ، به بمعناه . ثم قال : صحيح على شرط مسلم ، ولم يخرجاه .\nهكذا قال : وقد رواه أبو داود الطيالسي ، عن شعبة ، عن المغيرة عن الشعبي مرسلا وهذا أصح وقد روي عن ابن عباس والبراء نحو ذلك .\n                                    ",
        "qortoby": "فَمَنۡ حَآجَّكَ فِيهِ مِنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ فَقُلۡ تَعَالَوۡاْ نَدۡعُ أَبۡنَآءَنَا وَأَبۡنَآءَكُمۡ وَنِسَآءَنَا وَنِسَآءَكُمۡ وَأَنفُسَنَا وَأَنفُسَكُمۡ ثُمَّ نَبۡتَهِلۡ فَنَجۡعَل لَّعۡنَتَ ٱللَّهِ عَلَى ٱلۡكَٰذِبِينَ ١٦\n                                    \n                                    \n                                    قوله : فمن حاجك فيه من بعد ما جاءك من العلم فقل تعالوا ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم ثم نبتهل فنجعل لعنة الله على الكاذبين\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : فمن حاجك فيه أي جادلك وخاصمك يا محمد فيه ، أي في عيسى من بعد ما جاءك من العلم بأنه عبد الله ورسوله .\nفقل تعالوا أي أقبلوا . وضع لمن له جلالة ورفعة ثم صار في الاستعمال لكل داع إلى الإقبال ، وسيأتي له مزيد بيان في ( الأنعام ) . ( ندع ) في موضع جزم . ( أبناءنا ) دليل على أن أبناء البنات يسمون أبناء ; وذلك أن النبي - صلى الله عليه وسلم - جاء بالحسن والحسين وفاطمة تمشي خلفه وعلي خلفها وهو يقول لهم : ( إن أنا دعوت فأمنوا ) . ثم نبتهل أي نتضرع في الدعاء ; عن ابن عباس . أبو عبيدة والكسائي : نلتعن . وأصل الابتهال الاجتهاد في الدعاء باللعن وغيره . قال لبيد :\nفي كهول سادة من قومه نظر الدهر إليهم فابتهل\nأي اجتهد في إهلاكهم . يقال : بهله الله أي لعنه . والبهل : اللعن . والبهل : الماء القليل . وأبهلته إذا خليته وإرادته . وبهلته أيضا . وحكى أبو عبيدة : بهله الله يبهله بهلة أي لعنه . قال ابن عباس : هم أهل نجران : السيد والعاقب وابن الحارث رؤساؤهم . فنجعل لعنة الله على الكاذبين\nالثانية : هذه الآية من أعلام نبوة محمد - صلى الله عليه وسلم - لأنه دعاهم إلى المباهلة فأبوا منها ورضوا بالجزية بعد أن أعلمهم كبيرهم العاقب أنهم إن باهلوه اضطرم عليهم الوادي نارا فإن محمدا نبي مرسل ، ولقد تعلمون أنه جاءكم بالفصل في أمر عيسى ; فتركوا المباهلة وانصرفوا إلى بلادهم على أن يؤدوا في كل عام ألف حلة في صفر وألف حلة في رجب فصالحهم رسول الله - صلى الله عليه وسلم - على ذلك بدلا من الإسلام .\nالثالثة : قال كثير من العلماء : إن قوله عليه السلام في الحسن والحسين لما باهل ندع أبناءنا وأبناءكم وقوله في الحسن : إن ابني هذا سيد . مخصوص بالحسن والحسين أن يسميا ابني النبي - صلى الله عليه وسلم - دون غيرهما ; لقوله عليه السلام : كل سبب ونسب ينقطع يوم القيامة إلا نسبي وسببي ولهذا قال بعض أصحاب الشافعي فيمن أوصى لولد فلان ولم يكن له ولد لصلبه وله ولد ابن وولد ابنة : إن الوصية لولد الابن دون ولد الابنة ; وهو قول الشافعي . وسيأتي لهذا مزيد بيان في \" الأنعام والزخرف \" إن شاء الله تعالى .\n                                    ",
        "saadi": "فَمَنۡ حَآجَّكَ فِيهِ مِنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ فَقُلۡ تَعَالَوۡاْ نَدۡعُ أَبۡنَآءَنَا وَأَبۡنَآءَكُمۡ وَنِسَآءَنَا وَنِسَآءَكُمۡ وَأَنفُسَنَا وَأَنفُسَكُمۡ ثُمَّ نَبۡتَهِلۡ فَنَجۡعَل لَّعۡنَتَ ٱللَّهِ عَلَى ٱلۡكَٰذِبِينَ ١٦\n                                        \n                                        \n                                        \n                                        أي: { فمن } جادلك { وحاجك } في عيسى عليه السلام وزعم أنه فوق منزلة العبودية، بل رفعه فوق منزلته { من بعد ما جاءك من العلم } بأنه عبد الله ورسوله وبينت لمن جادلك ما عندك من الأدلة الدالة على أنه عبد أنعم الله عليه، دل على عناد من لم يتبعك في هذا العلم اليقيني، فلم يبق في مجادلته فائدة تستفيدها ولا يستفيدها هو، لأن الحق قد تبين، فجداله فيه جدال معاند مشاق لله ورسوله، قصده اتباع هواه، لا اتباع ما أنزل الله، فهذا ليس فيه حيلة، فأمر الله نبيه أن ينتقل إلى مباهلته وملاعنته، فيدعون الله ويبتهلون إليه أن يجعل لعنته وعقوبته على الكاذب من الفريقين، هو وأحب الناس إليه من الأولاد والأبناء والنساء، فدعاهم النبي صلى الله عليه وسلم إلى ذلك فتولوا وأعرضوا ونكلوا، وعلموا أنهم إن لاعنوه رجعوا إلى أهليهم وأولادهم فلم يجدوا أهلا ولا مالا وعوجلوا بالعقوبة، فرضوا بدينهم مع جزمهم ببطلانه، وهذا غاية الفساد والعناد، فلهذا قال تعالى { فإن تولوا فإن الله عليم بالمفسدين } فيعاقبهم على ذلك أشد العقوبة.\n                                    "
      },
      "originalText": "فَمَنۡ حَآجَّكَ فِيهِ مِنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ فَقُلۡ تَعَالَوۡاْ نَدۡعُ أَبۡنَآءَنَا وَأَبۡنَآءَكُمۡ وَنِسَآءَنَا وَنِسَآءَكُمۡ وَأَنفُسَنَا وَأَنفُسَكُمۡ ثُمَّ نَبۡتَهِلۡ فَنَجۡعَل لَّعۡنَتَ ٱللَّهِ عَلَى ٱلۡكَٰذِبِينَ ١٦"
    }
  ]
}