{
  "number": 58,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 355,
      "text": "إِنَّ هَٰذَا لَهُوَ الْقَصَصُ الْحَقُّ ۚ وَمَا مِنْ إِلَٰهٍ إِلَّا اللَّهُ ۚ وَإِنَّ اللَّهَ لَهُوَ الْعَزِيزُ الْحَكِيمُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 62,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ هَٰذَا لَهُوَ ٱلۡقَصَصُ ٱلۡحَقُّۚ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٢٦\n                                    \n                                    \n                                    ثم قال الله تعالى : ( إن هذا لهو القصص الحق ) أي : هذا الذي قصصناه عليك يا محمد في شأن عيسى هو الحق الذي لا معدل عنه ولا محيد ( وما من إله إلا الله وإن الله لهو العزيز الحكيم)\n                                    ",
        "qortoby": "إِنَّ هَٰذَا لَهُوَ ٱلۡقَصَصُ ٱلۡحَقُّۚ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٢٦\n                                    \n                                    \n                                    قوله تعالى : إن هذا لهو القصص الحق وما من إله إلا الله وإن الله لهو العزيز الحكيم\nقوله تعالى : إن هذا لهو القصص الحق الإشارة في قوله إن هذا إلى القرآن وما فيه من الأقاصيص ، سميت قصصا لأن المعاني تتتابع فيها ; فهو من قولهم : فلان يقص أثر فلان ، أي يتبعه .\nوما من إله إلا الله \" من \" زائدة للتوكيد ، والمعنى وما إله إلا الله العزيز أي الذي لا يغلب . الحكيم ذو الحكمة . وقد تقدم مثله والحمد لله .\n                                    ",
        "saadi": "إِنَّ هَٰذَا لَهُوَ ٱلۡقَصَصُ ٱلۡحَقُّۚ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٢٦\n                                        \n                                        \n                                        \n                                        وأخبر تعالى { إن هذا } الذي قصه الله على عباده هو { القصص الحق } وكل قصص يقص عليهم مما يخالفه ويناقضه فهو باطل { وما من إله إلا الله } فهو المألوه المعبود حقا الذي لا تنبغي العبادة إلا له، ولا يستحق غيره مثقال ذرة من العبادة { وإن الله لهو العزيز } الذي قهر كل شيء وخضع له كل شيء { الحكيم } الذي يضع الأشياء مواضعها، وله الحكمة التامة في ابتلاء المؤمنين بالكافرين، يقاتلونهم ويجادلونهم ويجاهدونهم بالقول والفعل\n                                    "
      },
      "originalText": "إِنَّ هَٰذَا لَهُوَ ٱلۡقَصَصُ ٱلۡحَقُّۚ وَمَا مِنۡ إِلَٰهٍ إِلَّا ٱللَّهُۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ ٢٦"
    },
    {
      "number": 356,
      "text": "فَإِنْ تَوَلَّوْا فَإِنَّ اللَّهَ عَلِيمٌ بِالْمُفْسِدِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 63,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 47,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ عَلِيمُۢ بِٱلۡمُفۡسِدِينَ ٣٦\n                                    \n                                    \n                                    ( فإن تولوا ) أي : عن هذا إلى غيره . ( فإن الله عليم بالمفسدين ) أي : من عدل عن الحق إلى الباطل فهو المفسد والله عليم به ، وسيجزيه على ذلك شر الجزاء ، وهو القادر ، الذي لا يفوته شيء [ سبحانه وبحمده ونعوذ به من حلول نقمه ] .\n                                    ",
        "qortoby": "فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ عَلِيمُۢ بِٱلۡمُفۡسِدِينَ ٣٦\n                                    \n                                    \n                                    فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ عَلِيمُۢ بِٱلۡمُفۡسِدِينَ ٣٦\n                                    ",
        "saadi": "فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ عَلِيمُۢ بِٱلۡمُفۡسِدِينَ ٣٦\n                                        \n                                        \n                                        \n                                        أي: { فمن } جادلك { وحاجك } في عيسى عليه السلام وزعم أنه فوق منزلة العبودية، بل رفعه فوق منزلته { من بعد ما جاءك من العلم } بأنه عبد الله ورسوله وبينت لمن جادلك ما عندك من الأدلة الدالة على أنه عبد أنعم الله عليه، دل على عناد من لم يتبعك في هذا العلم اليقيني، فلم يبق في مجادلته فائدة تستفيدها ولا يستفيدها هو، لأن الحق قد تبين، فجداله فيه جدال معاند مشاق لله ورسوله، قصده اتباع هواه، لا اتباع ما أنزل الله، فهذا ليس فيه حيلة، فأمر الله نبيه أن ينتقل إلى مباهلته وملاعنته، فيدعون الله ويبتهلون إليه أن يجعل لعنته وعقوبته على الكاذب من الفريقين، هو وأحب الناس إليه من الأولاد والأبناء والنساء، فدعاهم النبي صلى الله عليه وسلم إلى ذلك فتولوا وأعرضوا ونكلوا، وعلموا أنهم إن لاعنوه رجعوا إلى أهليهم وأولادهم فلم يجدوا أهلا ولا مالا وعوجلوا بالعقوبة، فرضوا بدينهم مع جزمهم ببطلانه، وهذا غاية الفساد والعناد، فلهذا قال تعالى { فإن تولوا فإن الله عليم بالمفسدين } فيعاقبهم على ذلك أشد العقوبة.\n                                    "
      },
      "originalText": "فَإِن تَوَلَّوۡاْ فَإِنَّ ٱللَّهَ عَلِيمُۢ بِٱلۡمُفۡسِدِينَ ٣٦"
    },
    {
      "number": 357,
      "text": "قُلْ يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَىٰ كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ ۚ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 64,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 48,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ تَعَالَوۡاْ إِلَىٰ كَلِمَةٖ سَوَآءِۢ بَيۡنَنَا وَبَيۡنَكُمۡ أَلَّا نَعۡبُدَ إِلَّا ٱللَّهَ وَلَا نُشۡرِكَ بِهِۦ شَيۡ‍ٔٗا وَلَا يَتَّخِذَ بَعۡضُنَا بَعۡضًا أَرۡبَابٗا مِّن دُونِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَقُولُواْ ٱشۡهَدُواْ بِأَنَّا مُسۡلِمُونَ ٤٦\n                                    \n                                    \n                                    هذا الخطاب يعم أهل الكتاب من اليهود والنصارى ، ومن جرى مجراهم ( قل يا أهل الكتاب تعالوا إلى كلمة ) والكلمة تطلق على الجملة المفيدة كما قال هاهنا . ثم وصفها بقوله : ( سواء بيننا وبينكم ) أي : عدل ونصف ، نستوي نحن وأنتم فيها . ثم فسرها بقوله : ( ألا نعبد إلا الله ولا نشرك به شيئا ) لا وثنا ، ولا صنما ، ولا صليبا ولا طاغوتا ، ولا نارا ، ولا شيئا بل نفرد العبادة لله وحده لا شريك له . وهذه دعوة جميع الرسل ، قال الله تعالى : ( وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون ) [ الأنبياء : 25 ] . [ وقال تعالى ] ( ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت ) [ النحل : 36 ] .\nثم قال : ( ولا يتخذ بعضنا بعضا أربابا من دون الله ) وقال ابن جريج : يعني : يطيع بعضنا بعضا في معصية الله . وقال عكرمة : يعني : يسجد بعضنا لبعض .\n( فإن تولوا فقولوا اشهدوا بأنا مسلمون ) أي : فإن تولوا عن هذا النصف وهذه الدعوة فأشهدوهم أنتم على استمراركم على الإسلام الذي شرعه الله لكم .\nوقد ذكرنا في شرح البخاري ، عند روايته من طريق الزهري ، عن عبيد الله بن عبد الله بن عتبة بن مسعود ، عن ابن عباس ، عن أبي سفيان ، في قصته حين دخل على قيصر ، فسألهم عن نسب رسول الله صلى الله عليه وسلم وعن صفته ونعته وما يدعو إليه ، فأخبره بجميع ذلك على الجلية ، مع أن أبا سفيان كان إذ ذاك مشركا لم يسلم بعد ، وكان ذلك بعد صلح الحديبية وقبل الفتح ، كما هو مصرح به في الحديث ، ولأنه لما قال هل يغدر ؟ قال : فقلت : لا ، ونحن منه في مدة لا ندري ما هو صانع فيها . قال : ولم يمكني كلمة أزيد فيها شيئا سوى هذه : والغرض أنه قال : ثم جيء بكتاب رسول الله صلى الله عليه وسلم فقرأه ، فإذا فيه :\n\" بسم الله الرحمن الرحيم ، من محمد رسول الله إلى هرقل عظيم الروم ، سلام على من اتبع الهدى . أما بعد ، فأسلم تسلم ، وأسلم يؤتك الله أجرك مرتين فإن توليت فإن عليك إثم الأريسيين ، و ( يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم ألا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون ) .\nوقد ذكر محمد بن إسحاق وغير واحد أن صدر سورة آل عمران إلى بضع وثمانين آية منها نزلت في وفد نجران ، وقال الزهري : هم أول من بذل الجزية . ولا خلاف أن آية الجزية نزلت بعد الفتح ، فما الجمع بين كتابة هذه الآية قبل الفتح إلى هرقل في جملة الكتاب ، وبين ما ذكره محمد بن إسحاق والزهري ؟ والجواب من وجوه :\nأحدها : يحتمل أن هذه الآية نزلت مرتين ، مرة قبل الحديبية ، ومرة بعد الفتح .\nالثاني : يحتمل أن صدر سورة آل عمران نزل في وفد نجران إلى عند هذه الآية ، وتكون هذه الآية نزلت قبل ذلك ، ويكون قول ابن إسحاق : \" إلى بضع وثمانين آية \" ليس بمحفوظ ، لدلالة حديث أبي سفيان .\nالثالث : يحتمل أن قدوم وفد نجران كان قبل الحديبية ، وأن الذي بذلوه مصالحة عن المباهلة لا على وجه الجزية ، بل يكون من باب المهادنة والمصالحة ، ووافق نزول آية الجزية بعد ذلك على وفق ذلك كما جاء فرض الخمس والأربعة الأخماس وفق ما فعله عبد الله بن جحش في تلك السرية قبل بدر ، ثم نزلت فريضة القسم على وفق ذلك .\nالرابع : يحتمل أن رسول الله صلى الله عليه وسلم لما أمر بكتب هذا [ الكلام ] في كتابه إلى هرقل لم يكن أنزل بعد ، ثم نزل القرآن موافقة له كما نزل بموافقة عمر بن الخطاب رضي الله عنه في الحجاب وفي الأسارى ، وفي عدم الصلاة على المنافقين ، وفي قوله : ( واتخذوا من مقام إبراهيم مصلى ) [ البقرة : 125 ] وفي قوله : ( عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن ) الآية [ التحريم : 5 ] .\n                                    ",
        "qortoby": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ تَعَالَوۡاْ إِلَىٰ كَلِمَةٖ سَوَآءِۢ بَيۡنَنَا وَبَيۡنَكُمۡ أَلَّا نَعۡبُدَ إِلَّا ٱللَّهَ وَلَا نُشۡرِكَ بِهِۦ شَيۡ‍ٔٗا وَلَا يَتَّخِذَ بَعۡضُنَا بَعۡضًا أَرۡبَابٗا مِّن دُونِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَقُولُواْ ٱشۡهَدُواْ بِأَنَّا مُسۡلِمُونَ ٤٦\n                                    \n                                    \n                                    قوله تعالى : قل ياأهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم ألا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : قل يا أهل الكتاب الخطاب في قول الحسن وابن زيد والسدي لأهل نجران . وفي قول قتادة وابن جريج وغيرهما ليهود المدينة ، خوطبوا بذلك لأنهم جعلوا أحبارهم في الطاعة لهم كالأرباب . وقيل : هو لليهود والنصارى جميعا . وفي كتاب النبي - صلى الله عليه وسلم - إلى هرقل \" بسم الله الرحمن الرحيم : من محمد رسول الله إلى هرقل عظيم الروم سلام على من اتبع الهدى ، أما بعد ، فإني أدعوك بدعاية الإسلام أسلم تسلم وأسلم يؤتك الله أجرك مرتين وإن توليت فإن عليك إثم الأريسيين ، ويا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ، إلى قوله : فقولوا اشهدوا بأنا مسلمون . لفظ مسلم . والسواء العدل والنصفة ; قاله قتادة . وقال زهير :\nأروني خطة لا ضيم فيها يسوي بيننا فيها السواء\nالفراء : ويقال في معنى العدل سوى وسوى ، فإذا فتحت السين مددت وإذا كسرت أو ضممت قصرت ; كقوله تعالى : ( مكانا سوى ) . قال : وفي قراءة عبد الله \" إلى كلمة عدل بيننا وبينكم \" وقرأ قعنب ( كلمة ) بإسكان اللام ، ألقى حركة اللام على الكاف ; كما يقال : كبد . فالمعنى أجيبوا إلى ما دعيتم إليه ، وهو الكلمة العادلة المستقيمة التي ليس فيها ميل عن الحق .\nوقد فسرها بقوله تعالى : ألا نعبد إلا الله فموضع \" أن \" خفض على البدل من ( كلمة ) ، أو رفع على إضمار مبتدأ ، التقدير هي أن لا نعبد إلا الله . أو تكون مفسرة لا موضع لها ، ويجوز مع ذلك في ( نعبد ) وما عطف عليه الرفع والجزم : فالجزم على أن تكون \" أن \" مفسرة بمعنى أي ; كما قال عز وجل : أن امشوا وتكون \" لا \" جازمة . هذا مذهب سيبويه . ويجوز على هذا أن ترفع ( نعبد ) وما بعده يكون خبرا . ويجوز الرفع بمعنى أنه لا نعبد ; ومثله ألا يرجع إليهم قولا ولا يملك لهم ضرا ولا نفعا . وقال الكسائي والفراء : ( ولا نشرك به شيئا ولا يتخذ ) بالجزم على التوهم أنه ليس في أول الكلام ( أن ) .\nالثانية : قوله تعالى : ولا يتخذ بعضنا بعضا أربابا من دون الله أي لا نتبعه في تحليل شيء أو تحريمه إلا فيما حلله الله تعالى . وهو نظير قوله تعالى : اتخذوا أحبارهم ورهبانهم أربابا من دون الله معناه أنهم أنزلوهم منزلة ربهم في قبول تحريمهم وتحليلهم لما لم يحرمه الله ولم يحله الله . وهذا يدل على بطلان القول بالاستحسان المجرد الذي لا يستند إلى دليل شرعي ; قال الكيا الطبري : مثل استحسانات أبي حنيفة في التقديرات التي قدرها دون مستندات بينة . وفيه رد على الروافض الذين يقولون : يجب قبول قول الإمام دون إبانة مستند شرعي ، وإنه يحل ما حرمه الله من غير أن يبين مستندا من الشريعة . وأرباب جمع رب . و ( دون ) هنا بمعنى غير .\nالثالثة قوله تعالى : فإن تولوا أي أعرضوا عما دعوا إليه . فقولوا اشهدوا بأنا مسلمون أي متصفون بدين الإسلام منقادون لأحكامه معترفون بما لله علينا في ذلك من المنن والإنعام ، غير متخذين أحدا ربا لا عيسى ولا عزيرا ولا الملائكة ; لأنهم بشر مثلنا محدث كحدوثنا ، ولا نقبل من الرهبان شيئا بتحريمهم علينا ما لم يحرمه الله علينا ، فنكون قد اتخذناهم أربابا .\nوقال عكرمة : معنى يتخذ يسجد . وقد تقدم أن السجود كان إلى زمن النبي - صلى الله عليه وسلم - ثم نهى النبي - صلى الله عليه وسلم - معاذا لما أراد أن يسجد ; كما مضى في البقرة بيانه . وروى أنس بن مالك قال : قلنا يا رسول الله ، أينحني بعضنا لبعض ؟ قال ( لا ) قلنا : أيعانق بعضنا بعضا ؟ قال ( لا ولكن تصافحوا ) أخرجه ابن ماجه في سننه . وسيأتي لهذا المعنى زيادة بيان في سورة ( يوسف ) إن شاء الله ، وفي \" الواقعة \" مس القرآن أو بعضه على غير طهارة إن شاء الله تعالى .\n                                    ",
        "saadi": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ تَعَالَوۡاْ إِلَىٰ كَلِمَةٖ سَوَآءِۢ بَيۡنَنَا وَبَيۡنَكُمۡ أَلَّا نَعۡبُدَ إِلَّا ٱللَّهَ وَلَا نُشۡرِكَ بِهِۦ شَيۡ‍ٔٗا وَلَا يَتَّخِذَ بَعۡضُنَا بَعۡضًا أَرۡبَابٗا مِّن دُونِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَقُولُواْ ٱشۡهَدُواْ بِأَنَّا مُسۡلِمُونَ ٤٦\n                                        \n                                        \n                                        \n                                        أي: قل لأهل الكتاب من اليهود والنصارى { تعالوا إلى كلمة سواء بيننا وبينكم } أي: هلموا نجتمع عليها وهي الكلمة التي اتفق عليها الأنبياء والمرسلون، ولم يخالفها إلا المعاندون والضالون، ليست مختصة بأحدنا دون الآخر، بل مشتركة بيننا وبينكم، وهذا من العدل في المقال والإنصاف في الجدال، ثم فسرها بقوله { ألا نعبد إلا الله ولا نشرك به شيئا } فنفرد الله بالعبادة ونخصه بالحب والخوف والرجاء ولا نشرك به نبيا ولا ملكا ولا وليا ولا صنما ولا وثنا ولا حيوانا ولا جمادا { ولا يتخذ بعضنا بعضا أربابا من دون الله } بل تكون الطاعة كلها لله ولرسله، فلا نطيع المخلوقين في معصية الخالق، لأن ذلك جعل للمخلوقين في منزلة الربوبية، فإذا دعي أهل الكتاب أو غيرهم إلى ذلك، فإن أجابوا كانوا مثلكم، لهم ما لكم وعليهم ما عليكم، وإن تولوا فهم معاندون متبعون أهواءهم فاشهدوهم أنكم مسلمون، ولعل الفائدة في ذلك أنكم إذا قلتم لهم ذلك وأنتم أهل العلم على الحقيقة، كان ذلك زيادة على إقامة الحجة عليهم كما استشهد تعالى بأهل العلم حجة على المعاندين، وأيضا فإنكم إذا أسلمتم أنتم وآمنتم فلا يعبأ الله بعدم إسلام غيركم لعدم زكائهم ولخبث طويتهم، كما قال تعالى { قل آمنوا به أو لا تؤمنوا إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا } الآية وأيضا فإن في ورود الشبهات على العقيدة الإيمانية مما يوجب للمؤمن أن يجدد إيمانه ويعلن بإسلامه، إخبارا بيقينه وشكرا لنعمة ربه.\n                                    "
      },
      "originalText": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ تَعَالَوۡاْ إِلَىٰ كَلِمَةٖ سَوَآءِۢ بَيۡنَنَا وَبَيۡنَكُمۡ أَلَّا نَعۡبُدَ إِلَّا ٱللَّهَ وَلَا نُشۡرِكَ بِهِۦ شَيۡ‍ٔٗا وَلَا يَتَّخِذَ بَعۡضُنَا بَعۡضًا أَرۡبَابٗا مِّن دُونِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَقُولُواْ ٱشۡهَدُواْ بِأَنَّا مُسۡلِمُونَ ٤٦"
    },
    {
      "number": 358,
      "text": "يَا أَهْلَ الْكِتَابِ لِمَ تُحَاجُّونَ فِي إِبْرَاهِيمَ وَمَا أُنْزِلَتِ التَّوْرَاةُ وَالْإِنْجِيلُ إِلَّا مِنْ بَعْدِهِ ۚ أَفَلَا تَعْقِلُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 65,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 48,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تُحَآجُّونَ فِيٓ إِبۡرَٰهِيمَ وَمَآ أُنزِلَتِ ٱلتَّوۡرَىٰةُ وَٱلۡإِنجِيلُ إِلَّا مِنۢ بَعۡدِهِۦٓۚ أَفَلَا تَعۡقِلُونَ ٥٦\n                                    \n                                    \n                                    ينكر تعالى على اليهود والنصارى في محاجتهم في إبراهيم الخليل ، ودعوى كل طائفة منهم أنه كان منهم ، كما قال محمد بن إسحاق بن يسار :\nحدثني محمد بن أبي محمد مولى زيد بن ثابت ، حدثني سعيد بن جبير أو عكرمة ، عن ابن عباس قال : اجتمعت نصارى نجران وأحبار يهود عند رسول الله صلى الله عليه وسلم ، فتنازعوا عنده ، فقالت الأحبار : ما كان إبراهيم إلا يهوديا . وقالت النصارى ما كان إبراهيم إلا نصرانيا . فأنزل الله تعالى : ( يا أهل الكتاب لم تحاجون في إبراهيم [ وما أنزلت التوراة والإنجيل إلا من بعده أفلا تعقلون ] ) أي : كيف تدعون ، أيها اليهود ، أنه كان يهوديا ، وقد كان زمنه قبل أن ينزل الله التوراة على موسى ، وكيف تدعون ، أيها النصارى ، أنه كان نصرانيا ، وإنما حدثت النصرانية بعد زمنه بدهر . ولهذا قال : ( أفلا تعقلون ) .\n                                    ",
        "qortoby": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تُحَآجُّونَ فِيٓ إِبۡرَٰهِيمَ وَمَآ أُنزِلَتِ ٱلتَّوۡرَىٰةُ وَٱلۡإِنجِيلُ إِلَّا مِنۢ بَعۡدِهِۦٓۚ أَفَلَا تَعۡقِلُونَ ٥٦\n                                    \n                                    \n                                    قوله تعالى : يا أهل الكتاب لم تحاجون في إبراهيم وما أنزلت التوراة والإنجيل إلا من بعده أفلا تعقلون\nقوله تعالى : يا أهل الكتاب لم تحاجون في إبراهيم الأصل \" لما \" فحذفت الألف فرقا بين الاستفهام والخبر . وهذه الآية نزلت بسبب دعوى كل فريق من اليهود والنصارى أن إبراهيم كان على دينه ، فأكذبهم الله تعالى بأن اليهودية والنصرانية إنما كانتا من بعده . وذلك قوله : وما أنزلت التوراة والإنجيل إلا من بعده قال الزجاج : هذه الآية أبين حجة على اليهود والنصارى ; إذ التوراة والإنجيل أنزلا من بعده وليس فيهما اسم لواحد من الأديان ، واسم الإسلام في كل كتاب . ويقال : كان بين إبراهيم وموسى ألف سنة ، وبين موسى وعيسى أيضا ألف سنة . أفلا تعقلون دحوض حجتكم وبطلان قولكم ، والله أعلم . والله أعلم\n                                    ",
        "saadi": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تُحَآجُّونَ فِيٓ إِبۡرَٰهِيمَ وَمَآ أُنزِلَتِ ٱلتَّوۡرَىٰةُ وَٱلۡإِنجِيلُ إِلَّا مِنۢ بَعۡدِهِۦٓۚ أَفَلَا تَعۡقِلُونَ ٥٦\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 65الى 68 :ـ لما ادعى اليهود أن إبراهيم كان يهوديا، والنصارى أنه نصراني، وجادلوا على ذلك، رد تعالى محاجتهم ومجادلتهم من ثلاثة أوجه، أحدها: أن جدالهم في إبراهيم جدال في أمر ليس لهم به علم، فلا يمكن لهم ولا يسمح لهم أن يحتجوا ويجادلوا في أمر هم أجانب عنه وهم جادلوا في أحكام التوراة والإنجيل سواء أخطأوا أم أصابوا فليس معهم المحاجة في شأن إبراهيم، الوجه الثاني: أن اليهود ينتسبون إلى أحكام التوراة، والنصارى ينتسبون إلى أحكام الإنجيل، والتوراة والإنجيل ما أنزلا إلا من بعد إبراهيم، فكيف ينسبون إبراهيم إليهم وهو قبلهم متقدم عليهم، فهل هذا يعقل؟! فلهذا قال { أفلا تعقلون } أي: فلو عقلتم ما تقولون لم تقولوا ذلك، الوجه الثالث: أن الله تعالى برأ خليله من اليهود والنصارى والمشركين، وجعله حنيفا مسلما، وجعل أولى الناس به من آمن به من أمته، وهذا النبي وهو محمد صلى الله على وسلم ومن آمن معه، فهم الذين اتبعوه وهم أولى به من غيرهم، والله تعالى وليهم وناصرهم ومؤيدهم، وأما من نبذ ملته وراء ظهره كاليهود والنصارى والمشركين، فليسوا من إبراهيم وليس منهم، ولا ينفعهم مجرد الانتساب الخالي من الصواب. وقد اشتملت هذه الآيات على النهي عن المحاجة والمجادلة بغير علم، وأن من تكلم بذلك فهو متكلم في أمر لا يمكن منه ولا يسمح له فيه، وفيها أيضا حث على علم التاريخ، وأنه طريق لرد كثير من الأقوال الباطلة والدعاوى التي تخالف ما علم من التاريخ\n                                    "
      },
      "originalText": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تُحَآجُّونَ فِيٓ إِبۡرَٰهِيمَ وَمَآ أُنزِلَتِ ٱلتَّوۡرَىٰةُ وَٱلۡإِنجِيلُ إِلَّا مِنۢ بَعۡدِهِۦٓۚ أَفَلَا تَعۡقِلُونَ ٥٦"
    },
    {
      "number": 359,
      "text": "هَا أَنْتُمْ هَٰؤُلَاءِ حَاجَجْتُمْ فِيمَا لَكُمْ بِهِ عِلْمٌ فَلِمَ تُحَاجُّونَ فِيمَا لَيْسَ لَكُمْ بِهِ عِلْمٌ ۚ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 66,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 48,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هَٰٓأَنتُمۡ هَٰٓؤُلَآءِ حَٰجَجۡتُمۡ فِيمَا لَكُم بِهِۦ عِلۡمٞ فَلِمَ تُحَآجُّونَ فِيمَا لَيۡسَ لَكُم بِهِۦ عِلۡمٞۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ ٦٦\n                                    \n                                    \n                                    ثم قال : ( ها أنتم هؤلاء حاججتم فيما لكم به علم فلم تحاجون فيما ليس لكم به علم والله يعلم وأنتم لا تعلمون ) هذا إنكار على من يحاج فيما لا علم له به ، فإن اليهود والنصارى تحاجوا في إبراهيم بلا علم ، ولو تحاجوا فيما بأيديهم منه علم مما يتعلق بأديانهم التي شرعت لهم إلى حين بعثة محمد صلى الله عليه وسلم لكان أولى بهم ، وإنما تكلموا فيما لم يعلموا به ، فأنكر الله عليهم ذلك ، وأمرهم برد ما لا علم لهم به إلى عالم الغيب والشهادة ، الذي يعلم الأمور على حقائقها وجلياتها ، ولهذا قال : ( والله يعلم وأنتم لا تعلمون )\n                                    ",
        "qortoby": "هَٰٓأَنتُمۡ هَٰٓؤُلَآءِ حَٰجَجۡتُمۡ فِيمَا لَكُم بِهِۦ عِلۡمٞ فَلِمَ تُحَآجُّونَ فِيمَا لَيۡسَ لَكُم بِهِۦ عِلۡمٞۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ ٦٦\n                                    \n                                    \n                                    قوله تعالى : ها أنتم هؤلاء حاججتم فيما لكم به علم فلم تحاجون فيما ليس لكم به علم والله يعلم وأنتم لا تعلمون\nفيه مسألتان :\nالأولى : قوله تعالى : ها أنتم هؤلاء حاججتم يعني في أمر محمد - صلى الله عليه وسلم - ; لأنهم كانوا يعلمونه فيما يجدون من نعته في كتابهم فحاجوا فيه بالباطل . فلم تحاجون فيما ليس لكم به علم يعني دعواهم في إبراهيم أنه كان يهوديا أو نصرانيا . والأصل في \" ها أنتم \" أأنتم فأبدل من الهمزة الأولى هاء لأنها أختها ; عن أبي عمرو بن العلاء والأخفش . قال النحاس : وهذا قول حسن . وقرأ قنبل عن ابن كثير \" هأنتم \" مثل هعنتم . والأحسن منه أن يكون الهاء بدلا من همزة فيكون أصله أأنتم . ويجوز أن تكون ها للتنبيه دخلت على \" أنتم \" وحذفت الألف لكثرة الاستعمال . وفي \" هؤلاء \" لغتان المد والقصر ومن العرب من يقصرها . وأنشد أبو حاتم :\nلعمرك إنا والأحاليف هاؤلا لفي محنة أظفارها لم تقلم\nوهؤلاء هاهنا في موضع النداء يعني يا هؤلاء . ويجوز هؤلاء خبر أنتم ، على أن يكون أولاء بمعنى الذين وما بعده صلة له . ويجوز أن يكون خبر \" أنتم \" حاججتم . وقد تقدم هذا في \" البقرة \" والحمد لله .\nالثانية : في الآية دليل على المنع من الجدال لمن لا علم له ، والحظر على من لا تحقيق عنده فقال عز وجل : ها أنتم هؤلاء حاججتم فيما لكم به علم فلم تحاجون فيما ليس لكم به علم . وقد ورد الأمر بالجدال لمن علم وأيقن فقال تعالى : وجادلهم بالتي هي أحسن . وروي عن النبي - صلى الله عليه وسلم - أنه أتاه رجل أنكر ولده فقال : يا رسول الله ، إن امرأتي ولدت غلاما أسود . فقال رسول الله - صلى الله عليه وسلم - : ( هل لك من إبل ) ؟ قال نعم . قال : ( ما ألوانها ) ؟ قال : حمر : ( هل فيها من أورق ) ؟ قال نعم . قال : ( فمن أين ذلك ) ؟ قال : لعل عرقا نزعه . فقال رسول الله - صلى الله عليه وسلم - : ( وهذا الغلام لعل عرقا نزعه ) . وهذا حقيقة الجدال ونهاية في تبيين الاستدلال من رسول الله - صلى الله عليه وسلم - .\n                                    ",
        "saadi": "هَٰٓأَنتُمۡ هَٰٓؤُلَآءِ حَٰجَجۡتُمۡ فِيمَا لَكُم بِهِۦ عِلۡمٞ فَلِمَ تُحَآجُّونَ فِيمَا لَيۡسَ لَكُم بِهِۦ عِلۡمٞۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ ٦٦\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 65الى 68 :ـ لما ادعى اليهود أن إبراهيم كان يهوديا، والنصارى أنه نصراني، وجادلوا على ذلك، رد تعالى محاجتهم ومجادلتهم من ثلاثة أوجه، أحدها: أن جدالهم في إبراهيم جدال في أمر ليس لهم به علم، فلا يمكن لهم ولا يسمح لهم أن يحتجوا ويجادلوا في أمر هم أجانب عنه وهم جادلوا في أحكام التوراة والإنجيل سواء أخطأوا أم أصابوا فليس معهم المحاجة في شأن إبراهيم، الوجه الثاني: أن اليهود ينتسبون إلى أحكام التوراة، والنصارى ينتسبون إلى أحكام الإنجيل، والتوراة والإنجيل ما أنزلا إلا من بعد إبراهيم، فكيف ينسبون إبراهيم إليهم وهو قبلهم متقدم عليهم، فهل هذا يعقل؟! فلهذا قال { أفلا تعقلون } أي: فلو عقلتم ما تقولون لم تقولوا ذلك، الوجه الثالث: أن الله تعالى برأ خليله من اليهود والنصارى والمشركين، وجعله حنيفا مسلما، وجعل أولى الناس به من آمن به من أمته، وهذا النبي وهو محمد صلى الله على وسلم ومن آمن معه، فهم الذين اتبعوه وهم أولى به من غيرهم، والله تعالى وليهم وناصرهم ومؤيدهم، وأما من نبذ ملته وراء ظهره كاليهود والنصارى والمشركين، فليسوا من إبراهيم وليس منهم، ولا ينفعهم مجرد الانتساب الخالي من الصواب. وقد اشتملت هذه الآيات على النهي عن المحاجة والمجادلة بغير علم، وأن من تكلم بذلك فهو متكلم في أمر لا يمكن منه ولا يسمح له فيه، وفيها أيضا حث على علم التاريخ، وأنه طريق لرد كثير من الأقوال الباطلة والدعاوى التي تخالف ما علم من التاريخ\n                                    "
      },
      "originalText": "هَٰٓأَنتُمۡ هَٰٓؤُلَآءِ حَٰجَجۡتُمۡ فِيمَا لَكُم بِهِۦ عِلۡمٞ فَلِمَ تُحَآجُّونَ فِيمَا لَيۡسَ لَكُم بِهِۦ عِلۡمٞۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ ٦٦"
    },
    {
      "number": 360,
      "text": "مَا كَانَ إِبْرَاهِيمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلَٰكِنْ كَانَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 67,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 48,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَا كَانَ إِبۡرَٰهِيمُ يَهُودِيّٗا وَلَا نَصۡرَانِيّٗا وَلَٰكِن كَانَ حَنِيفٗا مُّسۡلِمٗا وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٧٦\n                                    \n                                    \n                                    ثم قال تعالى : ( ما كان إبراهيم يهوديا ولا نصرانيا ولكن كان حنيفا مسلما ) أي : متحنفا عن الشرك قصدا إلى الإيمان ( وما كان من المشركين ) [ البقرة : 135 ]\nوهذه الآية كالتي تقدمت في سورة البقرة : ( وقالوا كونوا هودا أو نصارى تهتدوا [ قل بل ملة إبراهيم حنيفا وما كان من المشركين ] ) [ البقرة : 135 ] .\n                                    ",
        "qortoby": "مَا كَانَ إِبۡرَٰهِيمُ يَهُودِيّٗا وَلَا نَصۡرَانِيّٗا وَلَٰكِن كَانَ حَنِيفٗا مُّسۡلِمٗا وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٧٦\n                                    \n                                    \n                                    قوله تعالى : ما كان إبراهيم يهوديا ولا نصرانيا ولكن كان حنيفا مسلما وما كان من المشركين\nنزهه تعالى من دعاويهم الكاذبة ، وبين أنه كان على الحنيفية الإسلامية ولم يكن مشركا . والحنيف : الذي يوحد ويحج ويضحي ويختتن ويستقبل القبلة . وقد مضى في \" البقرة \" اشتقاقه . والمسلم في اللغة : المتذلل لأمر الله تعالى المنطاع له . وقد تقدم في \" البقرة \" معنى الإسلام مستوفى والحمد لله .\n                                    ",
        "saadi": "مَا كَانَ إِبۡرَٰهِيمُ يَهُودِيّٗا وَلَا نَصۡرَانِيّٗا وَلَٰكِن كَانَ حَنِيفٗا مُّسۡلِمٗا وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٧٦\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 65الى 68 :ـ لما ادعى اليهود أن إبراهيم كان يهوديا، والنصارى أنه نصراني، وجادلوا على ذلك، رد تعالى محاجتهم ومجادلتهم من ثلاثة أوجه، أحدها: أن جدالهم في إبراهيم جدال في أمر ليس لهم به علم، فلا يمكن لهم ولا يسمح لهم أن يحتجوا ويجادلوا في أمر هم أجانب عنه وهم جادلوا في أحكام التوراة والإنجيل سواء أخطأوا أم أصابوا فليس معهم المحاجة في شأن إبراهيم، الوجه الثاني: أن اليهود ينتسبون إلى أحكام التوراة، والنصارى ينتسبون إلى أحكام الإنجيل، والتوراة والإنجيل ما أنزلا إلا من بعد إبراهيم، فكيف ينسبون إبراهيم إليهم وهو قبلهم متقدم عليهم، فهل هذا يعقل؟! فلهذا قال { أفلا تعقلون } أي: فلو عقلتم ما تقولون لم تقولوا ذلك، الوجه الثالث: أن الله تعالى برأ خليله من اليهود والنصارى والمشركين، وجعله حنيفا مسلما، وجعل أولى الناس به من آمن به من أمته، وهذا النبي وهو محمد صلى الله على وسلم ومن آمن معه، فهم الذين اتبعوه وهم أولى به من غيرهم، والله تعالى وليهم وناصرهم ومؤيدهم، وأما من نبذ ملته وراء ظهره كاليهود والنصارى والمشركين، فليسوا من إبراهيم وليس منهم، ولا ينفعهم مجرد الانتساب الخالي من الصواب. وقد اشتملت هذه الآيات على النهي عن المحاجة والمجادلة بغير علم، وأن من تكلم بذلك فهو متكلم في أمر لا يمكن منه ولا يسمح له فيه، وفيها أيضا حث على علم التاريخ، وأنه طريق لرد كثير من الأقوال الباطلة والدعاوى التي تخالف ما علم من التاريخ\n                                    "
      },
      "originalText": "مَا كَانَ إِبۡرَٰهِيمُ يَهُودِيّٗا وَلَا نَصۡرَانِيّٗا وَلَٰكِن كَانَ حَنِيفٗا مُّسۡلِمٗا وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٧٦"
    },
    {
      "number": 361,
      "text": "إِنَّ أَوْلَى النَّاسِ بِإِبْرَاهِيمَ لَلَّذِينَ اتَّبَعُوهُ وَهَٰذَا النَّبِيُّ وَالَّذِينَ آمَنُوا ۗ وَاللَّهُ وَلِيُّ الْمُؤْمِنِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 68,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 48,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ أَوۡلَى ٱلنَّاسِ بِإِبۡرَٰهِيمَ لَلَّذِينَ ٱتَّبَعُوهُ وَهَٰذَا ٱلنَّبِيُّ وَٱلَّذِينَ ءَامَنُواْۗ وَٱللَّهُ وَلِيُّ ٱلۡمُؤۡمِنِينَ ٨٦\n                                    \n                                    \n                                    ثم قال تعالى : ( إن أولى الناس بإبراهيم للذين اتبعوه وهذا النبي والذين آمنوا والله ولي المؤمنين ) يقول تعالى : أحق الناس بمتابعة إبراهيم الخليل الذين اتبعوه على دينه ، وهذا النبي - يعني محمدا صلى الله عليه وسلم - والذين آمنوا من أصحابه المهاجرين والأنصار ومن بعدهم .\nقال سعيد بن منصور : أخبرنا أبو الأحوص ، عن سعيد بن مسروق ، عن أبي الضحى ، عن مسروق ، عن ابن مسعود ، رضي الله عنه ، أن رسول الله صلى الله عليه وسلم قال : \" إن لكل نبي ولاة من النبيين ، وإن وليي منهم أبي وخليل ربي عز وجل \" . ثم قرأ : ( إن أولى الناس بإبراهيم للذين اتبعوه [ وهذا النبي والذين آمنوا والله ولي المؤمنين ] ) .\nوقد رواه الترمذي والبزار من حديث أبي أحمد الزبيري ، عن سفيان الثوري ، عن أبيه ، به ثم قال البزار : ورواه غير أبي أحمد ، عن سفيان ، عن أبيه ، عن أبي الضحى ، عن عبد الله ، ولم يذكر مسروقا . وكذا رواه الترمذي من طريق وكيع ، عن سفيان ، ثم قال : وهذا أصح لكن رواه وكيع في تفسيره فقال : حدثنا سفيان ، عن أبيه ، عن أبي إسحاق ، عن عبد الله بن مسعود قال : قال رسول الله صلى الله عليه وسلم . . . فذكره .\nوقوله : ( والله ولي المؤمنين ) أي : ولي جميع المؤمنين برسله .\n                                    ",
        "qortoby": "إِنَّ أَوۡلَى ٱلنَّاسِ بِإِبۡرَٰهِيمَ لَلَّذِينَ ٱتَّبَعُوهُ وَهَٰذَا ٱلنَّبِيُّ وَٱلَّذِينَ ءَامَنُواْۗ وَٱللَّهُ وَلِيُّ ٱلۡمُؤۡمِنِينَ ٨٦\n                                    \n                                    \n                                    قوله تعالى : إن أولى الناس بإبراهيم للذين اتبعوه وهذا النبي والذين آمنوا والله ولي المؤمنين\nوقال ابن عباس : قال رؤساء اليهود : والله يا محمد لقد علمت أنا أولى الناس بدين إبراهيم منك ومن غيرك ، فإنه كان يهوديا وما بك إلا الحسد ; فأنزل الله تعالى هذه الآية . ( أولى ) معناه أحق ، قيل : بالمعونة والنصرة . وقيل بالحجة .\nللذين اتبعوه على ملته وسنته . وهذا النبي أفرد ذكره تعظيما له ; كما قال فيهما فاكهة ونخل ورمان وقد تقدم في \" البقرة \" هذا المعنى مستوفى . و \" هذا \" في موضع رفع عطف على الذين ، و ( النبي ) نعت لهذا أو عطف بيان ، ولو نصب لكان جائزا في الكلام عطفا على الهاء في اتبعوه . والله ولي المؤمنين أي ناصرهم . وعن ابن مسعود أن النبي - صلى الله عليه وسلم - قال : إن لكل نبي ولاة من النبيين وإن وليي منهم أبي وخليل ربي ثم قرأ - إن أولى الناس بإبراهيم للذين اتبعوه وهذا النبي .\n                                    ",
        "saadi": "إِنَّ أَوۡلَى ٱلنَّاسِ بِإِبۡرَٰهِيمَ لَلَّذِينَ ٱتَّبَعُوهُ وَهَٰذَا ٱلنَّبِيُّ وَٱلَّذِينَ ءَامَنُواْۗ وَٱللَّهُ وَلِيُّ ٱلۡمُؤۡمِنِينَ ٨٦\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 65الى 68 :ـ لما ادعى اليهود أن إبراهيم كان يهوديا، والنصارى أنه نصراني، وجادلوا على ذلك، رد تعالى محاجتهم ومجادلتهم من ثلاثة أوجه، أحدها: أن جدالهم في إبراهيم جدال في أمر ليس لهم به علم، فلا يمكن لهم ولا يسمح لهم أن يحتجوا ويجادلوا في أمر هم أجانب عنه وهم جادلوا في أحكام التوراة والإنجيل سواء أخطأوا أم أصابوا فليس معهم المحاجة في شأن إبراهيم، الوجه الثاني: أن اليهود ينتسبون إلى أحكام التوراة، والنصارى ينتسبون إلى أحكام الإنجيل، والتوراة والإنجيل ما أنزلا إلا من بعد إبراهيم، فكيف ينسبون إبراهيم إليهم وهو قبلهم متقدم عليهم، فهل هذا يعقل؟! فلهذا قال { أفلا تعقلون } أي: فلو عقلتم ما تقولون لم تقولوا ذلك، الوجه الثالث: أن الله تعالى برأ خليله من اليهود والنصارى والمشركين، وجعله حنيفا مسلما، وجعل أولى الناس به من آمن به من أمته، وهذا النبي وهو محمد صلى الله على وسلم ومن آمن معه، فهم الذين اتبعوه وهم أولى به من غيرهم، والله تعالى وليهم وناصرهم ومؤيدهم، وأما من نبذ ملته وراء ظهره كاليهود والنصارى والمشركين، فليسوا من إبراهيم وليس منهم، ولا ينفعهم مجرد الانتساب الخالي من الصواب. وقد اشتملت هذه الآيات على النهي عن المحاجة والمجادلة بغير علم، وأن من تكلم بذلك فهو متكلم في أمر لا يمكن منه ولا يسمح له فيه، وفيها أيضا حث على علم التاريخ، وأنه طريق لرد كثير من الأقوال الباطلة والدعاوى التي تخالف ما علم من التاريخ\n                                    "
      },
      "originalText": "إِنَّ أَوۡلَى ٱلنَّاسِ بِإِبۡرَٰهِيمَ لَلَّذِينَ ٱتَّبَعُوهُ وَهَٰذَا ٱلنَّبِيُّ وَٱلَّذِينَ ءَامَنُواْۗ وَٱللَّهُ وَلِيُّ ٱلۡمُؤۡمِنِينَ ٨٦"
    },
    {
      "number": 362,
      "text": "وَدَّتْ طَائِفَةٌ مِنْ أَهْلِ الْكِتَابِ لَوْ يُضِلُّونَكُمْ وَمَا يُضِلُّونَ إِلَّا أَنْفُسَهُمْ وَمَا يَشْعُرُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 69,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 48,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَدَّت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ لَوۡ يُضِلُّونَكُمۡ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ ٩٦\n                                    \n                                    \n                                    يخبر تعالى عن حسد اليهود للمؤمنين وبغيهم إياهم الإضلال وأخبر أن وبال ذلك إنما يعود على أنفسهم وهم لا يشعرون أنهم ممكور بهم.\n                                    ",
        "qortoby": "وَدَّت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ لَوۡ يُضِلُّونَكُمۡ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ ٩٦\n                                    \n                                    \n                                    قوله تعالى : ودت طائفة من أهل الكتاب لو يضلونكم وما يضلون إلا أنفسهم وما يشعرون\nنزلت في معاذ بن جبل وحذيفة بن اليمان وعمار بن ياسر حين دعاهم اليهود من بني النضير وقريظة وبني قينقاع إلى دينهم . وهذه الآية نظير قوله تعالى : ود كثير من أهل الكتاب لو يردونكم من بعد إيمانكم كفارا حسدا . و ( من ) على هذا القول للتبعيض . وقيل : جميع أهل الكتاب ، فتكون \" من \" لبيان الجنس .\nومعنى لو يضلونكم أي يكسبونكم المعصية بالرجوع عن دين الإسلام والمخالفة له . وقال ابن جريج : يضلونكم أي يهلكونكم ; ومنه قول الأخطل :\nكنت القدى في موج أكدر مزبد قذف الأتي به فضل ضلالا\nأي هلك هلاكا .\nوما يضلون إلا أنفسهم نفي وإيجاب . وما يشعرون أي يفطنون أنهم لا يصلون إلى إضلال المؤمنين . وقيل : وما يشعرون أي لا يعلمون بصحة الإسلام وواجب عليهم أن يعلموا ; لأن البراهين ظاهرة والحجج باهرة ، والله أعلم .\n                                    ",
        "saadi": "وَدَّت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ لَوۡ يُضِلُّونَكُمۡ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ ٩٦\n                                        \n                                        \n                                        \n                                        يحذر تعالى عباده المؤمنين عن مكر هذه الطائفة الخبيثة من أهل الكتاب، وأنهم يودون أن يضلوكم، كما قال تعالى { ود كثير من أهل الكتاب لو يردونكم من بعد إيمانكم كفارا } ومن المعلوم أن من ود شيئا سعى بجهده على تحصيل مراده، فهذه الطائفة تسعى وتبذل جهدها في رد المؤمنين وإدخال الشبه عليهم بكل طريق يقدرون عليه، ولكن من لطف الله أنه لا يحيق المكر السيئ إلا بأهله فلهذا قال تعالى { وما يضلون إلا أنفسهم } فسعيهم في إضلال المؤمنين زيادة في ضلال أنفسهم وزيادة عذاب لهم، قال تعالى { الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون } { وما يشعرون } بذلك أنهم يسعون في ضرر أنفسهم وأنهم لا يضرونكم شيئا.\n                                    "
      },
      "originalText": "وَدَّت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ لَوۡ يُضِلُّونَكُمۡ وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ ٩٦"
    },
    {
      "number": 363,
      "text": "يَا أَهْلَ الْكِتَابِ لِمَ تَكْفُرُونَ بِآيَاتِ اللَّهِ وَأَنْتُمْ تَشْهَدُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 70,
      "juz": 3,
      "manzil": 1,
      "page": 58,
      "ruku": 48,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَأَنتُمۡ تَشۡهَدُونَ ٠٧\n                                    \n                                    \n                                    قال تعالى منكرا عليهم \"يا أهل الكتاب لم تكفرون بآيات الله وأنتم تشهدون\" أي تعلمون صدقها وتتحققون حقها.\n                                    ",
        "qortoby": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَأَنتُمۡ تَشۡهَدُونَ ٠٧\n                                    \n                                    \n                                    قوله تعالى : يا أهل الكتاب لم تكفرون بآيات الله وأنتم تشهدون أي بصحة الآيات التي عندكم في كتبكم ; عن قتادة والسدي . وقيل : المعنى وأنتم تشهدون بمثلها من آيات الأنبياء التي أنتم مقرون بها .\n                                    ",
        "saadi": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَأَنتُمۡ تَشۡهَدُونَ ٠٧\n                                        \n                                        \n                                        \n                                        { يا أهل الكتاب لم تكفرون بآيات الله وأنتم تشهدون } أي: ما الذي دعاكم إلى الكفر بآيات الله مع علمكم بأن ما أنتم عليه باطل، وأن ما جاءكم به محمد صلى الله عليه وسلم هو الحق الذي لا تشكون فيه، بل تشهدون به ويسر به بعضكم إلى بعض في بعض الأوقات، فهذا نهيهم عن ضلالهم.\n                                    "
      },
      "originalText": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَأَنتُمۡ تَشۡهَدُونَ ٠٧"
    }
  ]
}