{
  "number": 59,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 364,
      "text": "يَا أَهْلَ الْكِتَابِ لِمَ تَلْبِسُونَ الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُونَ الْحَقَّ وَأَنْتُمْ تَعْلَمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 71,
      "juz": 3,
      "manzil": 1,
      "page": 59,
      "ruku": 48,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَلۡبِسُونَ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُونَ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ ١٧\n                                    \n                                    \n                                    \"يا أهل الكتاب لم تلبسون الحق بالباطل وتكتمون الحق وأنتم تعلمون\" أي تكتمون ما في كتبكم من صفة محمد صلى الله عليه وسلم وأنتم تعرفون ذلك وتتحققونه.\n                                    ",
        "qortoby": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَلۡبِسُونَ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُونَ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ ١٧\n                                    \n                                    \n                                    قوله تعالى : يا أهل الكتاب لم تلبسون الحق بالباطل وتكتمون الحق وأنتم تعلمون\nاللبس الخلط ، وقد تقدم في البقرة . ومعنى هذه الآية والتي قبلها معنى ذلك وتكتمون الحق ويجوز \" تكتموا \" على جواب الاستفهام . وأنتم تعلمون جملة في موضع الحال .\n                                    ",
        "saadi": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَلۡبِسُونَ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُونَ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ ١٧\n                                        \n                                        \n                                        \n                                        ثم وبخهم على إضلالهم الخلق، فقال { يا أهل الكتاب لم تلبسون الحق بالباطل وتكتمون الحق وأنتم تعلمون } فوبخهم على لبس الحق بالباطل وعلى كتمان الحق، لأنهم بهذين الأمرين يضلون من انتسب إليهم، فإن العلماء إذا لبسوا الحق بالباطل فلم يميزوا بينهما، بل أبقوا الأمر مبهما وكتموا الحق الذي يجب عليهم إظهاره، ترتب على ذلك من خفاء الحق وظهور الباطل ما ترتب، ولم يهتد العوام الذين يريدون الحق لمعرفته حتى يؤثروه، والمقصود من أهل العلم أن يظهروا للناس الحق ويعلنوا به، ويميزوا الحق من الباطل، ويظهروا الخبيث من الطيب، والحلال والحرام ، والعقائد الصحيحة من العقائد الفاسدة، ليهتدي المهتدون ويرجع الضالون وتقوم الحجة على المعاندين قال تعالى { وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه فنبذوه وراء ظهورهم }\n                                    "
      },
      "originalText": "يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَلۡبِسُونَ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُونَ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ ١٧"
    },
    {
      "number": 365,
      "text": "وَقَالَتْ طَائِفَةٌ مِنْ أَهْلِ الْكِتَابِ آمِنُوا بِالَّذِي أُنْزِلَ عَلَى الَّذِينَ آمَنُوا وَجْهَ النَّهَارِ وَاكْفُرُوا آخِرَهُ لَعَلَّهُمْ يَرْجِعُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 72,
      "juz": 3,
      "manzil": 1,
      "page": 59,
      "ruku": 49,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَقَالَت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ ءَامِنُواْ بِٱلَّذِيٓ أُنزِلَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَجۡهَ ٱلنَّهَارِ وَٱكۡفُرُوٓاْ ءَاخِرَهُۥ لَعَلَّهُمۡ يَرۡجِعُونَ ٢٧\n                                    \n                                    \n                                    ( وقالت طائفة من أهل الكتاب آمنوا بالذي أنزل على الذين آمنوا وجه النهار واكفروا آخره [ لعلهم يرجعون ] ) هذه مكيدة أرادوها ليلبسوا على الضعفاء من الناس أمر دينهم ، وهو أنهم اشتوروا بينهم أن يظهروا الإيمان أول النهار ويصلوا مع المسلمين صلاة الصبح ، فإذا جاء آخر النهار ارتدوا إلى دينهم ليقول الجهلة من الناس : إنما ردهم إلى دينهم اطلاعهم على نقيصة وعيب في دين المسلمين ، ولهذا قالوا : ( لعلهم يرجعون ) .\nقال ابن أبي نجيح ، عن مجاهد ، في قوله تعالى إخبارا عن اليهود بهذه الآية : يعني يهود صلت مع النبي صلى الله عليه وسلم صلاة الفجر وكفروا آخر النهار ، مكرا منهم ، ليروا الناس أن قد بدت لهم منه الضلالة ، بعد أن كانوا اتبعوه .\nوقال العوفي ، عن ابن عباس : قالت طائفة من أهل الكتاب : إذا لقيتم أصحاب محمد أول النهار فآمنوا ، وإذا كان آخره فصلوا صلاتكم ، لعلهم يقولون : هؤلاء أهل الكتاب وهم أعلم منا . [ وهكذا روي عن قتادة والسدي والربيع وأبي مالك ] .\n                                    ",
        "qortoby": "وَقَالَت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ ءَامِنُواْ بِٱلَّذِيٓ أُنزِلَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَجۡهَ ٱلنَّهَارِ وَٱكۡفُرُوٓاْ ءَاخِرَهُۥ لَعَلَّهُمۡ يَرۡجِعُونَ ٢٧\n                                    \n                                    \n                                    قوله تعالى : وقالت طائفة من أهل الكتاب آمنوا بالذي أنزل على الذين آمنوا وجه النهار واكفروا آخره لعلهم يرجعون\nنزلت في كعب بن الأشرف ومالك بن الصيف وغيرهما ، قالوا للسفلة من قومهم : آمنوا بالذي أنزل على الذين آمنوا وجه النهار ، يعني أوله . وسمي وجها لأنه أحسنه ، وأول ما يواجه منه أوله . قال الشاعر :\nوتضيء في وجه النهار منيرة كجمانة البحري سل نظامها\nوقال آخر :\nمن كان مسرورا بمقتل مالك فليأت نسوتنا بوجه نهار\nوهو منصوب على الظرف ، وكذلك ( آخره ) . ومذهب قتادة أنهم فعلوا ذلك ليشككوا المسلمين . والطائفة : الجماعة ، من طاف يطوف ، وقد يستعمل للواحد على معنى نفس طائفة . ومعنى الآية أن اليهود قال بعضهم لبعض : أظهروا الإيمان بمحمد في أول النهار ثم اكفروا به آخره ; فإنكم إذا فعلتم ذلك ظهر لمن يتبعه ارتياب في دينه فيرجعون عن دينه إلى دينكم ، ويقولون إن أهل الكتاب أعلم به منا . وقيل : المعنى آمنوا بصلاته في أول النهار إلى بيت المقدس فإنه الحق ، واكفروا بصلاته آخر النهار إلى الكعبة لعلهم يرجعون إلى قبلتكم ; عن ابن عباس وغيره . وقال مقاتل : معناه أنهم جاءوا محمدا - صلى الله عليه وسلم - أول النهار ورجعوا من عنده فقالوا للسفلة : هو حق فاتبعوه ، ثم قالوا : حتى ننظر في التوراة ثم رجعوا في آخر النهار فقالوا : قد نظرنا في التوراة فليس هو به . يقولون إنه ليس بحق ، وإنما أرادوا أن يلبسوا على السفلة وأن يشككوا فيه .\n                                    ",
        "saadi": "وَقَالَت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ ءَامِنُواْ بِٱلَّذِيٓ أُنزِلَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَجۡهَ ٱلنَّهَارِ وَٱكۡفُرُوٓاْ ءَاخِرَهُۥ لَعَلَّهُمۡ يَرۡجِعُونَ ٢٧\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى عن ما همت به هذه الطائفة الخبيثة، وإرادة المكر بالمؤمنين، فقال { وقالت طائفة من أهل الكتاب آمنوا بالذي أنزل على الذين آمنوا وجه النهار واكفروا آخره } أي: ادخلوا في دينهم على وجه المكر والكيد أول النهار، فإذا كان آخر النهار فاخرجوا منه { لعلهم يرجعون } عن دينهم، فيقولون لو كان صحيحا لما خرج منه أهل العلم والكتاب، هذا الذي أرادوه عجبا بأنفهسم وظنا أن الناس سيحسنون ظنهم بهم ويتابعونهم على ما يقولونه ويفعلونه، ولكن يأبى الله إلا أن يتم نوره ولو كره الكافرون.\n                                    "
      },
      "originalText": "وَقَالَت طَّآئِفَةٞ مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ ءَامِنُواْ بِٱلَّذِيٓ أُنزِلَ عَلَى ٱلَّذِينَ ءَامَنُواْ وَجۡهَ ٱلنَّهَارِ وَٱكۡفُرُوٓاْ ءَاخِرَهُۥ لَعَلَّهُمۡ يَرۡجِعُونَ ٢٧"
    },
    {
      "number": 366,
      "text": "وَلَا تُؤْمِنُوا إِلَّا لِمَنْ تَبِعَ دِينَكُمْ قُلْ إِنَّ الْهُدَىٰ هُدَى اللَّهِ أَنْ يُؤْتَىٰ أَحَدٌ مِثْلَ مَا أُوتِيتُمْ أَوْ يُحَاجُّوكُمْ عِنْدَ رَبِّكُمْ ۗ قُلْ إِنَّ الْفَضْلَ بِيَدِ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ ۗ وَاللَّهُ وَاسِعٌ عَلِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 73,
      "juz": 3,
      "manzil": 1,
      "page": 59,
      "ruku": 49,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تُؤۡمِنُوٓاْ إِلَّا لِمَن تَبِعَ دِينَكُمۡ قُلۡ إِنَّ ٱلۡهُدَىٰ هُدَى ٱللَّهِ أَن يُؤۡتَىٰٓ أَحَدٞ مِّثۡلَ مَآ أُوتِيتُمۡ أَوۡ يُحَآجُّوكُمۡ عِندَ رَبِّكُمۡۗ قُلۡ إِنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ ٣٧\n                                    \n                                    \n                                    وقوله : ( ولا تؤمنوا إلا لمن تبع دينكم ) أي : لا تطمئنوا وتظهروا سركم وما عندكم إلا لمن تبع دينكم ولا تظهروا ما بأيديكم إلى المسلمين ، فيؤمنوا به ويحتجوا به عليكم ، قال الله تعالى : ( قل إن الهدى هدى الله ) أي هو الذي يهدي قلوب المؤمنين إلى أتم الإيمان ، بما ينزله على عبده ورسوله محمد صلى الله عليه وسلم من الآيات البينات ، والدلائل القاطعات ، والحجج الواضحات ، وإن كتمتم - أيها اليهود - ما بأيديكم من صفة محمد في كتبكم التي نقلتموها عن الأنبياء الأقدمين .\nوقوله ( أن يؤتى أحد مثل ما أوتيتم أو يحاجوكم عند ربكم ) يقولون : لا تظهروا ما عندكم من العلم للمسلمين ، فيتعلموه منكم ، ويساووكم فيه ، ويمتازوا به عليكم لشدة الإيمان به ، أو يحاجوكم به عند الله ، أي : يتخذوه حجة عليكم مما بأيديكم ، فتقوم به عليكم الدلالة وتتركب الحجة في الدنيا والآخرة . قال الله تعالى : ( قل إن الفضل بيد الله يؤتيه من يشاء ) أي الأمور كلها تحت تصريفه ، وهو المعطي المانع ، يمن على من يشاء بالإيمان والعلم والتصور التام ، ويضل من يشاء ويعمي بصره وبصيرته ، ويختم على سمعه وقلبه ، ويجعل على بصره غشاوة ، وله الحجة والحكمة .\n( والله واسع عليم )\n                                    ",
        "qortoby": "وَلَا تُؤۡمِنُوٓاْ إِلَّا لِمَن تَبِعَ دِينَكُمۡ قُلۡ إِنَّ ٱلۡهُدَىٰ هُدَى ٱللَّهِ أَن يُؤۡتَىٰٓ أَحَدٞ مِّثۡلَ مَآ أُوتِيتُمۡ أَوۡ يُحَآجُّوكُمۡ عِندَ رَبِّكُمۡۗ قُلۡ إِنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ ٣٧\n                                    \n                                    \n                                    قوله تعالى : ولا تؤمنوا إلا لمن تبع دينكم قل إن الهدى هدى الله أن يؤتى أحد مثل ما أوتيتم أو يحاجوكم عند ربكم قل إن الفضل بيد الله يؤتيه من يشاء والله واسع عليم\nقوله تعالى : ولا تؤمنوا إلا لمن تبع دينكم هذا نهي ، وهو من كلام اليهود بعضهم لبعض ، أي قال ذلك الرؤساء للسفلة . وقال السدي : من قول يهود خيبر ليهود المدينة . وهذه الآية أشكل ما في السورة . فروي عن الحسن ومجاهد أن معنى الآية ولا تؤمنوا إلا لمن تبع دينكم ، ولا تؤمنوا أن يحاجوكم عند ربكم لأنهم لا حجة لهم فإنكم أصح منهم دينا . و ( أن ) و ( يحاجوكم ) في موضع خفض ، أي بأن يحاجوكم أي باحتجاجهم ، أي لا تصدقوهم في ذلك فإنهم لا حجة لهم . أن يؤتى أحد مثل ما أوتيتم من التوراة والمن والسلوى وفرق البحر وغيرها من الآيات والفضائل . فيكون أن يؤتى مؤخرا بعد أو يحاجوكم ، وقوله إن الهدى هدى الله اعتراض بين كلامين . وقال الأخفش : المعنى ولا تؤمنوا إلا لمن تبع دينكم ولا تؤمنوا أن يؤتى أحد مثل ما أوتيتم ولا تصدقوا أن يحاجوكم ; يذهب إلى أنه معطوف . وقيل : المعنى ولا تؤمنوا إلا لمن تبع دينكم أن يؤتى أحد مثل ما أوتيتم ; فالمد على الاستفهام أيضا تأكيد للإنكار الذي قالوه أنه لا يؤتى أحد مثل ما أوتوه ; لأن علماء اليهود قالت لهم : لا تؤمنوا إلا لمن تبع دينكم أن يؤتى أحد مثل ما أوتيتم ; أي لا يؤتى أحد مثل ما أوتيتم ; فالكلام على نسقه . و ( أن ) في موضع رفع على قول من رفع في قولك أزيد ضربته ، والخبر محذوف تقديره أن يؤتى أحد مثل ما أوتيتم تصدقون أو تقرون ، أي إيتاء موجود مصدق أو مقر به ، أي لا تصدقون بذلك . ويجوز أن تكون أن في موضع نصب على إضمار فعل ; كما جاز في قولك أزيدا ضربته ، وهذا أقوى في العربية لأن الاستفهام بالفعل أولى ، والتقدير أتقرون أن يؤتى ، أو أتشيعون ذلك ، أو أتذكرون ذلك ونحوه . وبالمد قرأ ابن كثير وابن محيصن وحميد . وقال أبو حاتم : \" أن \" معناه \" ألأن \" ، فحذفت لام الجر استخفافا وأبدلت مدة ; كقراءة من قرأ أن كان ذا مال ; أي ألأن . وقوله أو يحاجوكم على هذه القراءة رجوع إلى خطاب المؤمنين ; أو تكون ( أو ) بمعنى \" أن \" لأنهما حرفا شك وجزاء يوضع أحدهما موضع الآخر . وتقدير الآية : وأن يحاجوكم عند ربكم يا معشر المؤمنين ، فقل : يا محمد إن الهدى هدى الله ونحن عليه . ومن قرأ بترك المد قال : إن النفي الأول دل على إنكارهم في قولهم ولا تؤمنوا . فالمعنى أن علماء اليهود قالت لهم : لا تصدقوا بأن يؤتى أحد مثل ما أوتيتم ، أي لا إيمان لهم ولا حجة ; فعطف على المعنى من العلم والحكمة والكتاب والحجة والمن والسلوى وفلق البحر وغيرها من الفضائل والكرامات ، أي أنها لا تكون إلا فيكم فلا تؤمنوا أن يؤتى أحد مثل ما أوتيتم إلا من تبع دينكم . فالكلام فيه تقديم وتأخير على هذه القراءة واللام زائدة . ومن استثنى ليس من الأول ، وإلا لم يجز الكلام . ودخلت أحد لأن أول الكلام نفي ، فدخلت في صلة ( أن ) لأنه مفعول الفعل المنفي ; فأن في موضع نصب لعدم الخافض . وقال الخليل : ( أن ) في موضع خفض بالخافض المحذوف . وقيل : إن اللام ليست بزائدة ، و تؤمنوا محمول على تقروا . وقال ابن جريج : المعنى ولا تؤمنوا إلا لمن تبع دينكم كراهية أن يؤتى أحد مثل ما أوتيتم . وقيل : المعنى لا تخبروا بما في كتابكم من صفة محمد - صلى الله عليه وسلم - إلا لمن تبع دينكم لئلا يكون طريقا إلى عبدة الأوثان إلى تصديقه . وقال الفراء : يجوز أن يكون قد انقطع كلام اليهود عند قوله عز وجل إلا لمن تبع دينكم ثم قال لمحمد - صلى الله عليه وسلم - قل إن الهدى هدى الله أي إن البيان الحق هو بيان الله عز وجل\nأن يؤتى أحد مثل ما أوتيتم بين ألا يؤتى أحد مثل ما أوتيتم ، و \" لا \" مقدرة بعد \" أن \" أي لئلا يؤتى ; كقوله يبين الله لكم أن تضلوا ; أي لئلا تضلوا ، فلذلك صلح دخول \" أحد \" في الكلام . و \" أو \" بمعنى \" حتى \" و \" إلا أن \" ; كما قال امرؤ القيس :\nفقلت له لا تبك عينك إنما نحاول ملكا أو نموت فنعذرا\nوقال آخر :\nوكنت إذا غمزت قناة قوم كسرت كعوبها أو تستقيما\nومثله قولهم : لا نلتقي أو تقوم الساعة ، بمعنى \" حتى \" أو \" إلى أن \" ; وكذلك مذهب الكسائي . وهي عند الأخفش عاطفة على ولا تؤمنوا وقد تقدم . أي لا إيمان لهم ولا حجة ; فعطف على المعنى . ويحتمل أن تكون الآية كلها خطابا للمؤمنين من الله تعالى على جهة التثبيت لقلوبهم والتشحيذ لبصائرهم ; لئلا يشكوا عند تلبيس اليهود وتزويرهم في دينهم . والمعنى لا تصدقوا يا معشر المؤمنين إلا من تبع دينكم ، ولا تصدقوا أن يؤتى أحد مثل ما أوتيتم من الفضل والدين ، ولا تصدقوا أن يحاجكم في دينكم عند ربكم من خالفكم أو يقدر على ذلك ، فإن الهدى هدى الله وإن الفضل بيد الله . قال الضحاك : إن اليهود قالوا إنا نحاج عند ربنا من خالفنا في ديننا ; فبين الله تعالى أنهم هم المدحضون المعذبون وأن المؤمنين هم الغالبون . ومحاجتهم خصومتهم يوم القيامة . ففي الخبر عن رسول الله - صلى الله عليه وسلم - : ( إن اليهود والنصارى يحاجونا عند ربنا فيقولون أعطيتنا أجرا واحدا وأعطيتهم أجرين فيقول هل ظلمتكم من حقوقكم شيئا قالوا لا قال فإن ذلك فضلي أوتيه من أشاء ) . قال علماؤنا : فلو علموا أن ذلك من فضل الله لم يحاجونا عند ربنا ; فأعلم الله نبيه صلى أنهم يحاجونكم يوم القيامة عند ربكم ، ثم قال : قل لهم الآن إن الفضل بيد الله يؤتيه من يشاء والله واسع عليم . وقرأ ابن كثير ( آن يؤتى ) بالمد على الاستفهام ; كما قال الأعشى :\nأأن رأت رجلا أعشى أضر به ريب المنون ودهر متبل خبل\nوقرأ الباقون بغير مد على الخبر . وقرأ سعيد بن جبير \" إن يؤتى \" بكسر الهمزة ، على معنى النفي ; ويكون من كلام الله تعالى كما قال الفراء . والمعنى : قل يا محمد إن الهدى هدى الله إن يؤتى أحد مثل ما أوتيتم أو يحاجوكم عند ربكم يعني اليهود - بالباطل فيقولون نحن أفضل منكم . ونصب \" أو يحاجوكم \" يعني بإضمار \" أن \" و \" أو \" تضمر بعدها \" أن \" إذا كانت بمعنى \" حتى \" و \" إلا أن \" . وقرأ الحسن \" أن يؤتي \" بكسر التاء وياء مفتوحة ، على معنى أن يؤتي أحد أحدا مثل ما أوتيتم ، فحذف المفعول .\nقوله تعالى : قل إن الهدى هدى الله فيه قولان :\n( أحدهما ) إن الهدى إلى الخير والدلالة إلى الله عز وجل بيد الله جل ثناؤه يؤتيه أنبياءه ، فلا تنكروا أن يؤتى أحد سواكم مثل ما أوتيتم ، فإن أنكروا ذلك فقل لهم : إن الفضل بيد الله يؤتيه من يشاء . ( والقول الآخر ) قل إن الهدى هدى الله الذي آتاه المؤمنين من التصديق بمحمد - صلى الله عليه وسلم - لا غيره . وقال بعض أهل الإشارات في هذه الآية : لا تعاشروا إلا من يوافقكم على أحوالكم وطريقتكم فإن من لا يوافقكم لا يرافقكم ، والله أعلم .\n                                    ",
        "saadi": "وَلَا تُؤۡمِنُوٓاْ إِلَّا لِمَن تَبِعَ دِينَكُمۡ قُلۡ إِنَّ ٱلۡهُدَىٰ هُدَى ٱللَّهِ أَن يُؤۡتَىٰٓ أَحَدٞ مِّثۡلَ مَآ أُوتِيتُمۡ أَوۡ يُحَآجُّوكُمۡ عِندَ رَبِّكُمۡۗ قُلۡ إِنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ ٣٧\n                                        \n                                        \n                                        \n                                        { و } قال بعضهم لبعض { لا تؤمنوا إلا لمن تبع دينكم } أي: لا تثقوا ولا تطمئنوا ولا تصدقوا إلا من تبع دينكم، واكتموا أمركم، فإنكم إذا أخبرتم غيركم وغير من هو على دينكم حصل لهم من العلم ما حصل لكم فصاروا مثلكم، أو حاجوكم عند ربكم وشهدوا عليكم أنها قامت عليكم الحجة وتبين لكم الهدى فلم تتبعوه، فالحاصل أنهم جعلوا عدم إخبار المؤمنين بما معهم من العلم قاطعا عنهم العلم، لأن العلم بزعمهم لا يكون إلا عندهم وموجبا للحجة عليهم، فرد الله عليهم بأن { الهدى هدى الله } فمادة الهدى من الله تعالى لكل من اهتدى، فإن الهدى إما علم الحق، أو إيثارة، ولا علم إلا ما جاءت به رسل الله، ولا موفق إلا من وفقه الله، وأهل الكتاب لم يؤتوا من العلم إلا قليلا، وأما التوفيق فقد انقطع حظهم منه لخبث نياتهم وسوء مقاصدهم، وأما هذه الأمة فقد حصل لهم ولله الحمد من هداية الله من العلوم والمعارف مع العمل بذلك ما فاقوا به وبرزوا على كل أحد، فكانوا هم الهداة الذين يهدون بأمر الله، وهذا من فضل الله عليها وإحسانه العظيم، فلهذا قال تعالى { قل إن الفضل بيد الله } أي: الله هو الذي يحسن على عباده بأنواع الإحسان { يؤتيه من يشاء } ممن أتى بأسبابه { والله واسع } الفضل كثير الإحسان { عليم } بمن يصلح للإحسان فيعطيه، ومن لا يستحقه فيحرمه إياه.\n                                    "
      },
      "originalText": "وَلَا تُؤۡمِنُوٓاْ إِلَّا لِمَن تَبِعَ دِينَكُمۡ قُلۡ إِنَّ ٱلۡهُدَىٰ هُدَى ٱللَّهِ أَن يُؤۡتَىٰٓ أَحَدٞ مِّثۡلَ مَآ أُوتِيتُمۡ أَوۡ يُحَآجُّوكُمۡ عِندَ رَبِّكُمۡۗ قُلۡ إِنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ ٣٧"
    },
    {
      "number": 367,
      "text": "يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ ۗ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 74,
      "juz": 3,
      "manzil": 1,
      "page": 59,
      "ruku": 49,
      "hizbQuarter": 23,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَخۡتَصُّ بِرَحۡمَتِهِۦ مَن يَشَآءُۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ ٤٧\n                                    \n                                    \n                                    ( يختص برحمته من يشاء والله ذو الفضل العظيم ) أي : اختصكم - أيها المؤمنون - من الفضل بما لا يحد ولا يوصف ، بما شرف به نبيكم محمدا صلى الله عليه وسلم على سائر الأنبياء وهداكم به لأحمد الشرائع .\n                                    ",
        "qortoby": "يَخۡتَصُّ بِرَحۡمَتِهِۦ مَن يَشَآءُۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ ٤٧\n                                    \n                                    \n                                    قوله تعالى : يختص برحمته من يشاء والله ذو الفضل العظيم\nأي بنبوته وهدايته ; عن الحسن ومجاهد وغيرهما . ابن جريج : بالإسلام والقرآن من يشاء . قال أبو عثمان : أجمل القول ليبقى معه رجاء الراجي وخوف الخائف . والله ذو الفضل العظيم .\n                                    ",
        "saadi": "يَخۡتَصُّ بِرَحۡمَتِهِۦ مَن يَشَآءُۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ ٤٧\n                                        \n                                        \n                                        \n                                        { يختص برحمته من يشاء } أي: برحمته المطلقة التي تكون في الدنيا متصلة بالآخرة وهي نعمة الدين ومتمماته { والله ذو الفضل العظيم } الذي لا يصفه الواصفون ولا يخطر بقلب بشر، بل وصل فضله وإحسانه إلى ما وصل إليه علمه، ربنا وسعت كل شيء رحمة وعلما.\n                                    "
      },
      "originalText": "يَخۡتَصُّ بِرَحۡمَتِهِۦ مَن يَشَآءُۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ ٤٧"
    },
    {
      "number": 368,
      "text": "۞ وَمِنْ أَهْلِ الْكِتَابِ مَنْ إِنْ تَأْمَنْهُ بِقِنْطَارٍ يُؤَدِّهِ إِلَيْكَ وَمِنْهُمْ مَنْ إِنْ تَأْمَنْهُ بِدِينَارٍ لَا يُؤَدِّهِ إِلَيْكَ إِلَّا مَا دُمْتَ عَلَيْهِ قَائِمًا ۗ ذَٰلِكَ بِأَنَّهُمْ قَالُوا لَيْسَ عَلَيْنَا فِي الْأُمِّيِّينَ سَبِيلٌ وَيَقُولُونَ عَلَى اللَّهِ الْكَذِبَ وَهُمْ يَعْلَمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 75,
      "juz": 3,
      "manzil": 1,
      "page": 59,
      "ruku": 49,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمِنۡ أَهۡلِ ٱلۡكِتَٰبِ مَنۡ إِن تَأۡمَنۡهُ بِقِنطَارٖ يُؤَدِّهِۦٓ إِلَيۡكَ وَمِنۡهُم مَّنۡ إِن تَأۡمَنۡهُ بِدِينَارٖ لَّا يُؤَدِّهِۦٓ إِلَيۡكَ إِلَّا مَا دُمۡتَ عَلَيۡهِ قَآئِمٗاۗ ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَيۡسَ عَلَيۡنَا فِي ٱلۡأُمِّيِّ‍ۧنَ سَبِيلٞ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ ٥٧\n                                    \n                                    \n                                    يخبر تعالى عن اليهود بأن فيهم الخونة ، ويحذر المؤمنين من الاغترار بهم ، فإن منهم ( من إن تأمنه بقنطار ) أي : من المال ( يؤده إليك ) أي : وما دونه بطريق الأولى أن يؤديه إليك ( ومنهم من إن تأمنه بدينار لا يؤده إليك إلا ما دمت عليه قائما ) أي : بالمطالبة والملازمة والإلحاح في استخلاص حقك ، وإذا كان هذا صنيعه في الدينار فما فوقه أولى ألا يؤديه .\nوقد تقدم الكلام على القنطار في أول السورة ، وأما الدينار فمعروف .\nوقد قال ابن أبي حاتم : حدثنا سعيد بن عمرو السكوني ، حدثنا بقية ، عن زياد بن الهيثم ، حدثني مالك بن دينار قال : إنما سمي الدينار لأنه دين ونار . وقال : معناه : أنه من أخذه بحقه فهو دينه ، ومن أخذه بغير حقه فله النار .\nومناسب أن يكون هاهنا الحديث الذي علقه البخاري في غير موضع من صحيحه ، ومن أحسنها سياقه في كتاب الكفالة حيث قال : وقال الليث : حدثني جعفر بن ربيعة ، عن عبد الرحمن بن هرمز الأعرج ، عن أبي هريرة رضي الله عنه ، عن رسول الله صلى الله عليه وسلم : أنه ذكر رجلا من بني إسرائيل سأل [ بعض ] بني إسرائيل أن يسلفه ألف دينار ، فقال : ائتني بالشهداء أشهدهم . فقال : كفى بالله شهيدا . قال : ائتني بالكفيل . قال : كفى بالله كفيلا . قال : صدقت . فدفعها إليه إلى أجل مسمى ، فخرج في البحر فقضى حاجته ، ثم التمس مركبا يركبها يقدم عليه للأجل الذي أجله ، فلم يجد مركبا ، فأخذ خشبة فنقرها فأدخل فيها ألف دينار ، وصحيفة منه إلى صاحبه ، ثم زجج موضعها ، ثم أتى بها إلى البحر ، فقال : اللهم إنك تعلم أني استسلفت فلانا ألف دينار فسألني كفيلا فقلت : كفى بالله كفيلا ، فرضي بك . وسألني شهيدا ، فقلت : كفى بالله شهيدا ، فرضي بك ، وإني جهدت أن أجد مركبا أبعث إليه الذي له فلم أقدر ، وإني استودعتكها . فرمى بها في البحر حتى ولجت فيه ، ثم انصرف وهو في ذلك يلتمس مركبا يخرج إلى بلده ، فخرج الرجل الذي كان أسلفه ينظر لعل مركبا يجيئه بماله ، فإذا بالخشبة التي فيها المال ، فأخذها لأهله حطبا ، فلما كسرها وجد المال والصحيفة ، ثم قدم الذي كان تسلف منه ، فأتاه بألف دينار ، وقال : والله ما زلت جاهدا في طلب مركب لآتيك بمالك ، فما وجدت مركبا قبل الذي أتيت فيه . قال : هل كنت بعثت إلي بشيء ؟ قال : ألم أخبرك أني لم أجد مركبا قبل هذا ؟ قال : فإن الله قد أدى عنك الذي بعثت في الخشبة ، فانصرف بألف دينار راشدا .\nهكذا رواه البخاري في موضعه معلقا بصيغة الجزم ، وأسنده في بعض المواضع من الصحيح عن عبد الله بن صالح كاتب الليث عنه . ورواه الإمام أحمد في مسنده هكذا مطولا عن يونس بن محمد المؤدب ، عن الليث به ، ورواه البزار في مسنده ، عن الحسن بن مدرك ، عن يحيى بن حماد ، عن أبي عوانة ، عن عمر بن أبي سلمة ، عن أبيه ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم بنحوه ، ثم قال : لا يروى عن النبي صلى الله عليه وسلم إلا من هذا الوجه بهذا الإسناد . كذا قال ، وهو خطأ ، لما تقدم .\nوقوله : ( ذلك بأنهم قالوا ليس علينا في الأميين سبيل ) أي : إنما حملهم على جحود الحق أنهم يقولون : ليس علينا في ديننا حرج في أكل أموال الأميين ، وهم العرب ، فإن الله قد أحلها لنا . قال الله تعالى : ( ويقولون على الله الكذب وهم يعلمون ) أي : وقد اختلقوا هذه المقالة ، وائتفكوا بهذه الضلالة ، فإن الله حرم عليهم أكل الأموال إلا بحقها ، وإنما هم قوم بهت .\nقال عبد الرزاق : أنبأنا معمر ، عن أبي إسحاق الهمداني ، عن [ أبي ] صعصعة بن يزيد ، أن رجلا سأل ابن عباس ، قال : إنا نصيب في الغزو من أموال أهل الذمة الدجاجة والشاة ؟ قال ابن عباس : فتقولون ماذا ؟ قال : نقول ليس علينا بذلك بأس . قال : هذا كما قال أهل الكتاب : ( ليس علينا في الأميين سبيل ) إنهم إذا أدوا الجزية لم تحل لكم أموالهم إلا بطيب أنفسهم .\nوكذا رواه الثوري ، عن أبي إسحاق بنحوه .\nوقال ابن أبي حاتم : حدثنا محمد بن يحيى ، أخبرنا أبو الربيع الزهراني حدثنا يعقوب ، حدثنا جعفر ، عن سعيد بن جبير قال : لما قال أهل الكتاب : ( ليس علينا في الأميين سبيل ) قال نبي الله [ صلى الله عليه وسلم ] كذب أعداء الله ، ما من شيء كان في الجاهلية إلا وهو تحت قدمي هاتين إلا الأمانة ، فإنها مؤداة إلى البر والفاجر \"\n                                    ",
        "qortoby": "وَمِنۡ أَهۡلِ ٱلۡكِتَٰبِ مَنۡ إِن تَأۡمَنۡهُ بِقِنطَارٖ يُؤَدِّهِۦٓ إِلَيۡكَ وَمِنۡهُم مَّنۡ إِن تَأۡمَنۡهُ بِدِينَارٖ لَّا يُؤَدِّهِۦٓ إِلَيۡكَ إِلَّا مَا دُمۡتَ عَلَيۡهِ قَآئِمٗاۗ ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَيۡسَ عَلَيۡنَا فِي ٱلۡأُمِّيِّ‍ۧنَ سَبِيلٞ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ ٥٧\n                                    \n                                    \n                                    قوله تعالى : ومن أهل الكتاب من إن تأمنه بقنطار يؤده إليك ومنهم من إن تأمنه بدينار لا يؤده إليك إلا ما دمت عليه قائما ذلك بأنهم قالوا ليس علينا في الأميين سبيل ويقولون على الله الكذب وهم يعلمون\nفيه ثمان مسائل :\nالأولى : قوله تعالى : ومن أهل الكتاب من إن تأمنه بقنطار يؤده إليك مثل عبد الله بن سلام . ومنهم من إن تأمنه بدينار لا يؤده إليك وهو فنحاص بن عازوراء اليهودي أودعه رجل دينارا فخانه . وقيل : كعب بن الأشرف وأصحابه . وقرأ ابن وثاب والأشهب العقيلي \" من إن تيمنه \" على لغة من قرأ \" نستعين \" وهي لغة بكر وتميم . وفي حرف عبد الله \" ما لك لا تيمنا على يوسف \" والباقون بالألف . وقرأ نافع والكسائي ( يؤد هي ) بياء في الإدراج . قال أبو عبيد : واتفق أبو عمرو والأعمش وعاصم وحمزة في رواية أبي بكر على وقف الهاء ، فقرءوا ( يؤده إليك ) . قال النحاس : بإسكان الهاء لا يجوز إلا في الشعر عند بعض النحويين ، وبعضهم لا يجيزه ألبتة ويرى أنه غلط ممن قرأ به ، وإنه توهم أن الجزم يقع على الهاء ، وأبو عمرو أجل من أن يجوز عليه مثل هذا . والصحيح عنه أنه كان يكسر الهاء ; وهي قراءة يزيد بن القعقاع . وقال الفراء : مذهب بعض العرب يجزمون الهاء إذا تحرك ما قبلها ، يقولون : ضربته ضربا شديدا ; كما يسكنون ميم أنتم وقمتم وأصلها الرفع ; كما قال الشاعر :\nلما رأى ألا دعه ولا شبع مال إلى أرطاة حقف فاضطجع\nوقيل : إنما جاز إسكان الهاء في هذا الموضع لأنها وقعت في موضع الجزم وهي الياء الذاهبة . وقرأ أبو المنذر سلام والزهري \" يؤده \" بضم الهاء بغير واو . وقرأ قتادة وحميد ومجاهد \" يؤدهو \" بواو في الإدراج ، اختير لها الواو لأن الواو من الشفة والهاء بعيدة المخرج . قال سيبويه : الواو في المذكر بمنزلة الألف في المؤنث ويبدل منها ياء لأن الياء أخف إذا كان قبلها كسرة أو ياء ، وتحذف الياء وتبقى الكسرة لأن الياء قد كانت تحذف والفعل مرفوع فأثبتت بحالها .\nالثانية : أخبر تعالى أن في أهل الكتاب الخائن والأمين ، والمؤمنون لا يميزون ذلك ، فينبغي اجتناب جميعهم . وخص أهل الكتاب بالذكر وإن كان المؤمنون كذلك ; لأن الخيانة فيهم أكثر ، فخرج الكلام على الغالب ، والله أعلم . وقد مضى تفسير القنطار . وأما الدينار فأربعة وعشرون قيراطا والقيراط ثلاث حبات من وسط الشعير ، فمجموعه اثنتان وسبعون حبة ، وهو مجمع عليه . ومن حفظ الكثير وأداه فالقليل أولى ، ومن خان في اليسير أو منعه فذلك في الكثير أكثر . وهذا أدل دليل على القول بمفهوم الخطاب . وفيه بين العلماء خلاف كثير مذكور في أصول الفقه . وذكر تعالى قسمين : من يؤدي ومن لا يؤدي إلا بالملازمة عليه ; وقد يكون من الناس من لا يؤدي وإن دمت عليه قائما . فذكر تعالى القسمين لأنه الغالب والمعتاد والثالث نادر ; فخرج الكلام على الغالب . وقرأ طلحة بن مصرف وأبو عبد الرحمن السلمي وغيرهما ( دمت ) بكسر الدال وهما لغتان ، والكسر لغة أزد السراة ; من \" دمت تدام \" مثل خفت تخاف . وحكى الأخفش دمت تدوم ، شاذا .\nالثالثة : استدل أبو حنيفة على مذهبه في ملازمة الغريم بقوله تعالى : إلا ما دمت عليه قائما وأباه سائر العلماء ، وقد تقدم في البقرة . وقد استدل بعض البغداديين من علمائنا على حبس المديان بقوله تعالى : ومنهم من إن تأمنه بدينار لا يؤده إليك إلا ما دمت عليه قائما فإذا كان له ملازمته ومنعه من التصرف ، جاز حبسه . وقيل : إن معنى إلا ما دمت عليه قائما أي بوجهك فيهابك ويستحي منك ، فإن الحياء في العينين ; ألا ترى إلى قول ابن عباس - رضي الله عنه - : لا تطلبوا من الأعمى حاجة فإن الحياء في العينين . وإذا طلبت من أخيك حاجة فانظر إليه بوجهك حتى يستحي فيقضيها . ويقال : قائما أي ملازما له ; فإن أنظرته أنكرك . وقيل : أراد بالقيام إدامة المطالبة لا عين القيام . والدينار أصله دنار فعوضت من إحدى النونين ياء طلبا للتخفيف لكثرة استعماله . يدل عليه أنه يجمع دنانير ويصغر دنينير .\nالرابعة : الأمانة عظيمة القدر في الدين ، ومن عظم قدرها أنها تقوم هي والرحم على جنبتي الصراط ; كما في صحيح مسلم . فلا يمكن من الجواز إلا من حفظهما . وروى مسلم عن حذيفة قال : حدثنا النبي - صلى الله عليه وسلم - عن رفع الأمانة ، قال : ينام الرجل النومة فتقبض الأمانة من قلبه الحديث . وقد تقدم بكماله أول البقرة . وروى ابن ماجه حدثنا محمد بن المصفى حدثنا محمد بن حرب عن سعيد بن سنان عن أبي الزاهرية عن أبي شجرة كثير بن مرة عن ابن عمر أن النبي - صلى الله عليه وسلم - قال : إن الله عز وجل إذا أراد أن يهلك عبدا نزع منه الحياء فإذا نزع منه الحياء لم تلقه إلا مقيتا ممقتا فإذا لم تلقه إلا مقيتا ممقتا نزعت منه الأمانة فإذا نزعت منه الأمانة لم تلقه إلا خائنا مخونا فإذا لم تلقه إلا خائنا مخونا نزعت منه الرحمة فإذا نزعت منه الرحمة لم تلقه إلا رجيما ملعنا فإذا لم تلقه إلا رجيما ملعنا نزعت منه ربقة الإسلام . وقد مضى في البقرة معنى قوله عليه السلام : أد الأمانة إلى من ائتمنك ولا تخن من خانك ، والله أعلم .\nالخامسة : ليس في هذه الآية تعديل لأهل الكتاب ولا لبعضهم خلافا لمن ذهب إلى ذلك ; لأن فساق المسلمين يوجد فيهم من يؤدي الأمانة ويؤمن على المال الكثير ولا يكونون بذلك عدولا . فطريق العدالة والشهادة ليس يجزئ فيه أداء الأمانة في المال من جهة المعاملة والوديعة ; ألا ترى قولهم : ليس علينا في الأميين سبيل فكيف يعدل من يعتقد استباحة أموالنا وحريمنا بغير حرج عليه ; ولو كان ذلك كافيا في تعديلهم لسمعت شهادتهم على المسلمين .\nالسادسة : قوله تعالى : ذلك بأنهم قالوا يعني اليهود ليس علينا في الأميين سبيل قيل : إن اليهود كانوا إذا بايعوا المسلمين يقولون : ليس علينا في الأميين سبيل - أي حرج في ظلمهم - لمخالفتهم إيانا . وادعوا أن ذلك في كتابهم ; فأكذبهم الله عز وجل ورد عليهم فقال : \" بلى \" أي بلى عليهم سبيل العذاب بكذبهم واستحلالهم أموال العرب . قال أبو إسحاق الزجاج : وتم الكلام . ثم قال : من أوفى بعهده واتقى ويقال : إن اليهود كانوا قد استدانوا من الأعراب أموالا فلما أسلم أرباب الحقوق قالت اليهود : ليس لكم علينا شيء ، لأنكم تركتم دينكم فسقط عنا دينكم . وادعوا أنه حكم التوراة فقال الله تعالى : بلى ردا لقولهم ليس علينا في الأميين سبيل . أي ليس كما تقولون ، ثم استأنف فقال : من أوفى بعهده واتقى الشرك فليس من الكاذبين بل يحبه الله ورسوله .\nالسابعة : قال رجل لابن عباس : إنا نصيب في العمد من أموال أهل الذمة الدجاجة والشاة ونقول : ليس علينا في ذلك بأس . فقال له : هذا كما قال أهل الكتاب ليس علينا في الأميين سبيل إنهم إذا أدوا الجزية لم تحل لكم أموالهم إلا عن طيب أنفسهم ; ذكره عبد الرزاق عن معمر عن أبي إسحاق الهمداني عن صعصعة أن رجلا قال لابن عباس ; فذكره .\nالثامنة : قوله تعالى : ويقولون على الله الكذب وهم يعلمون يدل على أن الكافر لا يجعل أهلا لقبول شهادته ; لأن الله تعالى وصفه بأنه كذاب . وفيه رد على الكفرة الذين يحرمون ويحللون غير تحريم الله وتحليله ويجعلون ذلك من الشرع . قال ابن العربي : ومن هذا يخرج الرد على من يحكم بالاستحسان من غير دليل ، ولست أعلم أحدا من أهل القبلة قاله . وفي الخبر : لما نزلت هذه الآية قال النبي - صلى الله عليه وسلم - : ما شيء كان في الجاهلية إلا وهو تحت قدمي إلا الأمانة فإنها مؤداة إلى البر والفاجر .\n                                    ",
        "saadi": "وَمِنۡ أَهۡلِ ٱلۡكِتَٰبِ مَنۡ إِن تَأۡمَنۡهُ بِقِنطَارٖ يُؤَدِّهِۦٓ إِلَيۡكَ وَمِنۡهُم مَّنۡ إِن تَأۡمَنۡهُ بِدِينَارٖ لَّا يُؤَدِّهِۦٓ إِلَيۡكَ إِلَّا مَا دُمۡتَ عَلَيۡهِ قَآئِمٗاۗ ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَيۡسَ عَلَيۡنَا فِي ٱلۡأُمِّيِّ‍ۧنَ سَبِيلٞ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ ٥٧\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن حال أهل الكتاب في الوفاء والخيانة في الأموال، لما ذكر خيانتهم في الدين ومكرهم وكتمهم الحق، فأخبر أن منهم الخائن والأمين، وأن منهم { من إن تأمنه بقنطار } وهو المال الكثير { يؤده } وهو على أداء ما دونه من باب أولى، ومنهم { من إن تأمنه بدينار لا يؤده إليك } وهو على عدم أداء ما فوقه من باب أولى وأحرى، والذي أوجب لهم الخيانة وعدم الوفاء إليكم بأنهم زعموا أنه { ليس } عليهم { في الأميين سبيل } أي: ليس عليهم إثم في عدم أداء أموالهم إليهم، لأنهم بزعمهم الفاسد ورأيهم الكاسد قد احتقروهم غاية الاحتقار، ورأوا أنفسهم في غاية العظمة، وهم الأذلاء الأحقرون، فلم يجعلوا للأميين حرمة، وأجازوا ذلك، فجمعوا بين أكل الحرام واعتقاد حله وكان هذا كذبا على الله، لأن العالم الذي يحلل الأشياء المحرمة قد كان عند الناس معلوم أنه يخبر عن حكم الله ليس يخبر عن نفسه، وذلك هو الكذب، فلهذا قال { ويقولون على الله الكذب وهم يعلمون } وهذا أعظم إثما من القول على الله بلا علم، ثم رد عليهم زعمهم الفاسد.\n                                    "
      },
      "originalText": "۞ وَمِنۡ أَهۡلِ ٱلۡكِتَٰبِ مَنۡ إِن تَأۡمَنۡهُ بِقِنطَارٖ يُؤَدِّهِۦٓ إِلَيۡكَ وَمِنۡهُم مَّنۡ إِن تَأۡمَنۡهُ بِدِينَارٖ لَّا يُؤَدِّهِۦٓ إِلَيۡكَ إِلَّا مَا دُمۡتَ عَلَيۡهِ قَآئِمٗاۗ ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَيۡسَ عَلَيۡنَا فِي ٱلۡأُمِّيِّ‍ۧنَ سَبِيلٞ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ ٥٧"
    },
    {
      "number": 369,
      "text": "بَلَىٰ مَنْ أَوْفَىٰ بِعَهْدِهِ وَاتَّقَىٰ فَإِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 76,
      "juz": 3,
      "manzil": 1,
      "page": 59,
      "ruku": 49,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَلَىٰۚ مَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ ٦٧\n                                    \n                                    \n                                    ثم قال تعالى : ( بلى من أوفى بعهده واتقى ) أي : لكن من أوفى بعهده منكم يا أهل الكتاب الذي عاهدكم الله عليه ، من الإيمان بمحمد صلى الله عليه وسلم إذا بعث ، كما أخذ العهد والميثاق على الأنبياء وأممهم بذلك ، واتقى محارم الله تعالى واتبع طاعته وشريعته التي بعث بها خاتم رسله وسيد البشر \" فإن الله يحب المتقين \"\n                                    ",
        "qortoby": "بَلَىٰۚ مَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ ٦٧\n                                    \n                                    \n                                    قوله تعالى : بلى من أوفى بعهده واتقى فإن الله يحب المتقين\n\" من \" رفع بالابتداء وهو شرط . و أوفى في موضع جزم . و اتقى معطوف عليه ، أي واتقى الله ولم يكذب ولم يستحل ما حرم عليه . فإن الله يحب المتقين أي يحب أولئك . وقد تقدم معنى حب الله لأوليائه . والهاء في قوله بعهده راجعة إلى الله عز وجل . وقد جرى ذكره في قوله ويقولون على الله الكذب وهم يعلمون ويجوز أن تعود على الموفي ومتقي الكفر والخيانة ونقض العهد . والعهد مصدر يضاف إلى الفاعل والمفعول .\n                                    ",
        "saadi": "بَلَىٰۚ مَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ ٦٧\n                                        \n                                        \n                                        \n                                        فقال { بلى } أي: ليس الأمر كما تزعمون أنه ليس عليكم في الأميين حرج، بل عليكم في ذلك أعظم الحرج وأشد الإثم. { من أوفى بعهده واتقى } والعهد يشمل العهد الذي بين العبد وبين ربه، وهو جميع ما أوجبه الله على العبد من حقه، ويشمل العهد الذي بينه وبين العباد، والتقوى تكون في هذا الموضع، ترجع إلى اتقاء المعاصي التي بين العبد وبين ربه، وبينه وبين الخلق، فمن كان كذلك فإنه من المتقين الذين يحبهم الله تعالى، سواء كانوا من الأميين أو غيرهم، فمن قال ليس علينا في الأميين سبيل، فلم يوف بعهده ولم يتق الله، فلم يكن ممن يحبه الله، بل ممن يبغضه الله، وإذا كان الأمييون قد عرفوا بوفاء العهود وبتقوى الله وعدم التجرئ على الأموال المحترمة، كانوا هم المحبوبين لله، المتقين الذين أعدت لهم الجنة، وكانوا أفضل خلق الله وأجلهم، بخلاف الذين يقولون ليس علينا في الأميين سبيل، فإنهم داخلون في قوله: { إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا }\n                                    "
      },
      "originalText": "بَلَىٰۚ مَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَّقِينَ ٦٧"
    },
    {
      "number": 370,
      "text": "إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا أُولَٰئِكَ لَا خَلَاقَ لَهُمْ فِي الْآخِرَةِ وَلَا يُكَلِّمُهُمُ اللَّهُ وَلَا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 77,
      "juz": 3,
      "manzil": 1,
      "page": 59,
      "ruku": 49,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ يَشۡتَرُونَ بِعَهۡدِ ٱللَّهِ وَأَيۡمَٰنِهِمۡ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ لَا خَلَٰقَ لَهُمۡ فِي ٱلۡأٓخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيۡهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٧٧\n                                    \n                                    \n                                    يقول تعالى : إن الذين يعتاضون عما عهدهم الله عليه ، من اتباع محمد صلى الله عليه وسلم ، وذكر صفته الناس ، وبيان أمره ، وعن أيمانهم الكاذبة الفاجرة الآثمة بالأثمان القليلة الزهيدة ، وهي عروض هذه الدنيا الفانية الزائلة أولئك لا خلاق لهم في الآخرة أي : لا نصيب لهم فيها ، ولا حظ لهم منها \" ولا يكلمهم الله ولا ينظر إليهم يوم القيامة \" أي : برحمة منه لهم ، بمعنى : لا يكلمهم كلام لطف بهم ، ولا ينظر إليهم بعين الرحمة \" ولا يزكيهم \" أي : من الذنوب والأدناس ، بل يأمر بهم إلى النار \" ولهم عذاب أليم \" وقد وردت أحاديث تتعلق بهذه الآية الكريمة فلنذكر ما تيسر منها :\nالحديث الأول : قال الإمام أحمد : حدثنا عفان ، حدثنا شعبة قال : علي بن مدرك أخبرني قال : سمعت أبا زرعة ، عن خرشة بن الحر ، عن أبي ذر ، قال : قال رسول الله صلى الله عليه وسلم : \" ثلاثة لا يكلمهم الله ولا ينظر إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم \" قلت : يا رسول الله ، من هم ؟ خابوا وخسروا . قال : وأعاده رسول الله [ صلى الله عليه وسلم ] ثلاث مرات قال : \" المسبل ، والمنفق سلعته بالحلف الكاذب ، والمنان \" . ورواه مسلم ، وأهل السنن ، من حديث شعبة ، به .\nطريق أخرى : قال أحمد : حدثنا إسماعيل ، عن الحريري ، عن أبي العلاء بن الشخير ، عن أبي الأحمس قال : لقيت أبا ذر ، فقلت له : بلغني عنك أنك تحدث حديثا عن رسول الله صلى الله عليه وسلم . فقال : أما إنه لا تخالني أكذب على رسول الله صلى الله عليه وسلم بعد ما سمعته منه ، فما الذي بلغك عني ؟ قلت : بلغني أنك تقول : ثلاثة يحبهم الله ، وثلاثة يشنؤهم الله عز وجل . قال : قلته وسمعته . قلت : فمن هؤلاء الذين يحبهم الله ؟ قال : الرجل يلقى العدو في فئة فينصب لهم نحره حتى يقتل أو يفتح لأصحابه . والقوم يسافرون فيطول سراهم حتى يحنوا أن يمسوا الأرض فينزلون ، فيتنحى أحدهم فيصلي حتى يوقظهم لرحيلهم . والرجل يكون له الجار يؤذيه فيصبر على أذاه حتى يفرق بينهما موت أو ظعن . قلت : ومن هؤلاء الذين يشنأ الله ؟ قال : التاجر الحلاف - أو البائع الحلاف - والفقير المختال ، والبخيل المنان غريب من هذا الوجه .\nالحديث الثاني : قال الإمام أحمد : حدثنا يحيى بن سعيد ، عن جرير بن حازم قال : حدثنا عدي بن عدي ، أخبرني رجاء بن حيوة والعرس بن عميرة عن أبيه عدي - هو ابن عميرة الكندي - قال : خاصم رجل من كندة يقال له : امرؤ القيس بن عابس رجلا من حضرموت إلى رسول الله صلى الله عليه وسلم في أرض ، فقضى على الحضرمي بالبينة ، فلم يكن له بينة ، فقضى على امرئ القيس باليمين . فقال الحضرمي : إن أمكنته من اليمين يا رسول الله ذهبت ورب الكعبة أرضي . فقال النبي صلى الله عليه وسلم : \" من حلف على يمين كاذبة ليقتطع بها مال أحد لقي الله عز وجل وهو عليه غضبان \" قال رجاء : وتلا رسول الله صلى الله عليه وسلم : ( إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا ) فقال امرؤ القيس : ماذا لمن تركها يا رسول الله ؟ فقال : الجنة \" قال : فاشهد أني قد تركتها له كلها . ورواه النسائي من حديث عدي بن عدي ، به .\nالحديث الثالث : قال أحمد : حدثنا أبو معاوية ، حدثنا الأعمش ، عن شقيق ، عن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" من حلف على يمين هو فيها فاجر ، ليقتطع بها مال امرئ مسلم ، لقي الله عز وجل وهو عليه غضبان \" .\nفقال الأشعث : في والله كان ذلك ، كان بيني وبين رجل من اليهود أرض فجحدني ، فقدمته إلى رسول الله صلى الله عليه وسلم فقال لي رسول الله صلى الله عليه وسلم : \" ألك بينة ؟ \" قلت : لا ، فقال لليهودي : \" احلف \" فقلت : يا رسول الله ، إذا يحلف فيذهب مالي . فأنزل الله عز وجل : ( إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا ) [ إلى آخر ] الآية : أخرجاه من حديث الأعمش .\nطريق أخرى : قال أحمد : حدثنا يحيى بن آدم ، حدثنا أبو بكر بن عياش ، عن عاصم بن أبي النجود ، عن شقيق بن سلمة ، حدثنا عبد الله بن مسعود قال : قال رسول الله صلى الله عليه وسلم : \" من اقتطع مال امرئ مسلم بغير حق لقي الله وهو عليه غضبان \" قال : فجاء الأشعث بن قيس فقال : ما يحدثكم أبو عبد الرحمن ؟ فحدثناه ، فقال : في كان هذا الحديث ، خاصمت ابن عم لي إلى رسول الله صلى الله عليه وسلم في بئر لي كانت في يده ، فجحدني ، فقال رسول الله صلى الله عليه وسلم : \" بينتك أنها بئرك وإلا فيمينه \" قال : قلت : يا رسول الله ، ما لي بينة ، وإن تجعلها بيمينه تذهب بئري ، إن خصمي امرؤ فاجر . فقال رسول الله صلى الله عليه وسلم : \" من اقتطع مال امرئ مسلم بغير حق لقي الله وهو عليه غضبان \" قال : وقرأ رسول الله صلى الله عليه وسلم هذه الآية : ( إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا [ أولئك لا خلاق لهم في الآخرة ولا يكلمهم الله ولا ينظر إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم ] ) .\nالحديث الرابع : قال الإمام أحمد : حدثنا يحيى بن غيلان ، حدثنا رشدين عن زبان ، عن سهل بن معاذ بن أنس ، عن أبيه ، عن النبي صلى الله عليه وسلم : \" إن لله تعالى عبادا لا يكلمهم يوم القيامة ولا يزكيهم ولا ينظر إليهم \" قيل : ومن أولئك يا رسول الله ؟ قال : \" متبرئ من والديه راغب عنهما ، ومتبرئ من ولده ، ورجل أنعم عليه قوم فكفر نعمتهم وتبرأ منهم \" .\nالحديث الخامس : قال ابن أبي حاتم : حدثنا الحسن بن عرفة ، حدثنا هشيم ، أنبأنا العوام - يعني ابن حوشب - عن إبراهيم بن عبد الرحمن - يعني السكسكي - عن عبد الله بن أبي أوفى : أن رجلا أقام سلعة له في السوق ، فحلف بالله لقد أعطى بها ما لم يعطه ، ليوقع فيها رجلا من المسلمين ، فنزلت هذه الآية : ( إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا ) ورواه البخاري ، من غير وجه ، عن العوام .\nالحديث السادس : قال الإمام أحمد : حدثنا وكيع ، حدثنا الأعمش ، عن أبي صالح ، عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : \" ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ، ولا يزكيهم ولهم عذاب أليم : رجل منع ابن السبيل فضل ماء عنده ، ورجل حلف على سلعة بعد العصر - يعني كاذبا - ورجل بايع إماما ، فإن أعطاه وفى له ، وإن لم يعطه لم يف له \" . ورواه أبو داود ، والترمذي ، من حديث وكيع ، وقال الترمذي : حسن صحيح .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ يَشۡتَرُونَ بِعَهۡدِ ٱللَّهِ وَأَيۡمَٰنِهِمۡ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ لَا خَلَٰقَ لَهُمۡ فِي ٱلۡأٓخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيۡهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٧٧\n                                    \n                                    \n                                    قوله تعالى : إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا أولئك لا خلاق لهم في الآخرة ولا يكلمهم الله ولا ينظر إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم\nفيه مسألتان :\nالأولى روى الأئمة عن الأشعث بن قيس قال : كان بيني وبين رجل من اليهود أرض فجحدني فقدمته إلى النبي - صلى الله عليه وسلم - فقال لي رسول الله - صلى الله عليه وسلم - : ( هل لك بينة ) ؟ قلت لا ، قال لليهودي : ( احلف ) قلت : إذا يحلف فيذهب بمالي ; فأنزل الله تعالى : إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا إلى آخر الآية . وروى الأئمة أيضا عن أبي أمامة أن رسول الله - صلى الله عليه وسلم - قال : من اقتطع حق امرئ مسلم بيمينه فقد أوجب الله له النار وحرم عليه الجنة . فقال له رجل : وإن كان شيئا يسيرا يا رسول الله ؟ قال : ( وإن كان قضيبا من أراك ) . وقد مضى في البقرة معنى لا يكلمهم الله ولا ينظر إليهم يوم القيامة ولا يزكيهم .\nالثانية : ودلت هذه الآية والأحاديث أن حكم الحاكم لا يحل المال في الباطن بقضاء الظاهر إذا علم المحكوم له بطلانه ; وقد روى الأئمة عن أم سلمة قالت : قال رسول الله - صلى الله عليه وسلم - : إنكم تختصمون إلي وإنما أنا بشر ولعل بعضكم أن يكون ألحن بحجته من بعض وإنما أقضي بينكم على نحو مما أسمع منكم فمن قضيت له من حق أخيه شيئا فلا يأخذه فإنما أقطع له قطعة من النار يأتي بها يوم القيامة . وهذا لا خلاف فيه بين الأئمة ، وإنما ناقض أبو حنيفة وغلا وقال : إن حكم الحاكم المبني على الشهادة الباطلة يحل الفرج لمن كان محرما عليه ; كما تقدم في البقرة . وزعم أنه لو شهد شاهدا زور على رجل بطلاق زوجته وحكم الحاكم بشهادتهما فإن فرجها يحل لمتزوجها ممن يعلم أن القضية باطل . وقد شنع عليه بإعراضه عن هذا الحديث الصحيح الصريح ، وبأنه صان الأموال ولم ير استباحتها بالأحكام الفاسدة ، ولم يصن الفروج عن ذلك ، والفروج أحق أن يحتاط لها وتصان . وسيأتي بطلان قوله في آية اللعان إن شاء الله تعالى .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ يَشۡتَرُونَ بِعَهۡدِ ٱللَّهِ وَأَيۡمَٰنِهِمۡ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ لَا خَلَٰقَ لَهُمۡ فِي ٱلۡأٓخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيۡهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٧٧\n                                        \n                                        \n                                        \n                                        الذين يقولون ليس علينا في الأميين سبيل، فإنهم داخلون في قوله: { إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا } ويدخل في ذلك كل من أخذ شيئا من الدنيا في مقابلة ما تركه من حق الله أو حق عباده، وكذلك من حلف على يمين يقتطع بها مال معصوم فهو داخل في هذه الآية، فهؤلاء { لا خلاق لهم في الآخرة } أي: لا نصيب لهم من الخير { ولا يكلمهم الله } يوم القيامة غضبا عليهم وسخطا، لتقديمهم هوى أنفسهم على رضا ربهم { ولا يزكيهم } أي: يطهرهم من ذنوبهم، ولا يزيل عيوبهم { ولهم عذاب أليم } أي: موجع للقلوب والأبدان، وهو عذاب السخط والحجاب، وعذاب جهنم، نسأل الله العافية.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ يَشۡتَرُونَ بِعَهۡدِ ٱللَّهِ وَأَيۡمَٰنِهِمۡ ثَمَنٗا قَلِيلًا أُوْلَٰٓئِكَ لَا خَلَٰقَ لَهُمۡ فِي ٱلۡأٓخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيۡهِمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَلَا يُزَكِّيهِمۡ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٧٧"
    }
  ]
}