{
  "number": 60,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 371,
      "text": "وَإِنَّ مِنْهُمْ لَفَرِيقًا يَلْوُونَ أَلْسِنَتَهُمْ بِالْكِتَابِ لِتَحْسَبُوهُ مِنَ الْكِتَابِ وَمَا هُوَ مِنَ الْكِتَابِ وَيَقُولُونَ هُوَ مِنْ عِنْدِ اللَّهِ وَمَا هُوَ مِنْ عِنْدِ اللَّهِ وَيَقُولُونَ عَلَى اللَّهِ الْكَذِبَ وَهُمْ يَعْلَمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 78,
      "juz": 3,
      "manzil": 1,
      "page": 60,
      "ruku": 49,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنَّ مِنۡهُمۡ لَفَرِيقٗا يَلۡوُۥنَ أَلۡسِنَتَهُم بِٱلۡكِتَٰبِ لِتَحۡسَبُوهُ مِنَ ٱلۡكِتَٰبِ وَمَا هُوَ مِنَ ٱلۡكِتَٰبِ وَيَقُولُونَ هُوَ مِنۡ عِندِ ٱللَّهِ وَمَا هُوَ مِنۡ عِندِ ٱللَّهِ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ ٨٧\n                                    \n                                    \n                                    يخبر تعالى عن اليهود ، عليهم لعائن الله ، أن منهم فريقا يحرفون الكلم عن مواضعه ويبدلون كلام الله ، ويزيلونه عن المراد به ، ليوهموا الجهلة أنه في كتاب الله كذلك ، وينسبونه إلى الله ، وهو كذب على الله ، وهم يعلمون من أنفسهم أنهم قد كذبوا وافتروا في ذلك كله ، ولهذا قال : ( ويقولون على الله الكذب وهم يعلمون )\nوقال مجاهد ، والشعبي ، والحسن ، وقتادة ، والربيع بن أنس : ( يلوون ألسنتهم بالكتاب ) يحرفونه .\nوهكذا روى البخاري عن ابن عباس : أنهم يحرفون ويزيدون وليس أحد من خلق الله يزيل لفظ كتاب من كتب الله ، لكنهم يحرفونه : يتأولونه على غير تأويله .\nوقال وهب بن منبه : إن التوراة والإنجيل كما أنزلهما الله لم يغير منهما حرف ، ولكنهم يضلون بالتحريف والتأويل ، وكتب كانوا يكتبونها من عند أنفسهم ، ( ويقولون هو من عند الله وما هو من عند الله ) فأما كتب الله فإنها محفوظة ولا تحول .\nرواه ابن أبي حاتم ، فإن عنى وهب ما بأيديهم من ذلك ، فلا شك أنه قد دخلها التبديل والتحريف والزيادة والنقص ، وأما تعريب ذلك المشاهد بالعربية ففيه خطأ كبير ، وزيادات كثيرة ونقصان ، ووهم فاحش . وهو من باب تفسير المعبر المعرب ، وفهم كثير منهم بل أكثرهم بل جميعهم فاسد . وأما إن عنى كتب الله التي هي كتبه من عنده ، فتلك كما قال محفوظة لم يدخلها شيء .\n                                    ",
        "qortoby": "وَإِنَّ مِنۡهُمۡ لَفَرِيقٗا يَلۡوُۥنَ أَلۡسِنَتَهُم بِٱلۡكِتَٰبِ لِتَحۡسَبُوهُ مِنَ ٱلۡكِتَٰبِ وَمَا هُوَ مِنَ ٱلۡكِتَٰبِ وَيَقُولُونَ هُوَ مِنۡ عِندِ ٱللَّهِ وَمَا هُوَ مِنۡ عِندِ ٱللَّهِ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ ٨٧\n                                    \n                                    \n                                    قوله تعالى : وإن منهم لفريقا يلوون ألسنتهم بالكتاب لتحسبوه من الكتاب وما هو من الكتاب ويقولون هو من عند الله وما هو من عند الله ويقولون على الله الكذب وهم يعلمون\nيعني طائفة من اليهود . يلوون ألسنتهم بالكتاب وقرأ أبو جعفر وشيبة \" يلوون \" على التكثير . إذا أماله ; ومنه والمعنى يحرفون الكلم ويعدلون به عن القصد . وأصل اللي الميل . لوى بيده ، ولوى برأسه قوله تعالى : ليا بألسنتهم ; أي عنادا عن الحق وميلا عنه إلى غيره . ومعنى ولا تلوون على أحد ; أي لا تعرجون عليه ; يقال لوى عليه إذا عرج وأقام . واللي المطل . لواه بدينه يلويه وليانا مطله . قال :\nقد كنت داينت بها حسانا مخافة الإفلاس والليانا يحسن بيع الأصل والعيانا\nوقال ذو الرمة :\nتريدين لياني وأنت ملية وأحسن يا ذات الوشاح التقاضيا\nوفي الحديث لي الواجد يحل عرضه وعقوبته . وألسنة جمع لسان في لغة من ذكر ، ومن أنث قال ألسن .\n                                    ",
        "saadi": "وَإِنَّ مِنۡهُمۡ لَفَرِيقٗا يَلۡوُۥنَ أَلۡسِنَتَهُم بِٱلۡكِتَٰبِ لِتَحۡسَبُوهُ مِنَ ٱلۡكِتَٰبِ وَمَا هُوَ مِنَ ٱلۡكِتَٰبِ وَيَقُولُونَ هُوَ مِنۡ عِندِ ٱللَّهِ وَمَا هُوَ مِنۡ عِندِ ٱللَّهِ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ ٨٧\n                                        \n                                        \n                                        \n                                        يخبر تعالى أن من أهل الكتاب فريقا يلوون ألسنتهم بالكتاب، أي: يميلونه ويحرفونه عن المقصود به، وهذا يشمل اللي والتحريف لألفاظه ومعانيه، وذلك أن المقصود من الكتاب حفظ ألفاظه وعدم تغييرها، وفهم المراد منها وإفهامه، وهؤلاء عكسوا القضية وأفهموا غير المراد من الكتاب، إما تعريضا وإما تصريحا، فالتعريض في قوله { لتحسبوه من الكتاب } أي: يلوون ألسنتهم ويوهمونكم أنه هو المراد من كتاب الله، وليس هو المراد، والتصريح في قولهم: { ويقولون هو من عند الله وما هو من عند الله ويقولون على الله الكذب وهم يعلمون } وهذا أعظم جرما ممن يقول على الله بلا علم، هؤلاء يقولون على الله الكذب فيجمعون بين نفي المعنى الحق، وإثبات المعنى الباطل، وتنزيل اللفظ الدال على الحق على المعنى الفاسد، مع علمهم بذلك.\n                                    "
      },
      "originalText": "وَإِنَّ مِنۡهُمۡ لَفَرِيقٗا يَلۡوُۥنَ أَلۡسِنَتَهُم بِٱلۡكِتَٰبِ لِتَحۡسَبُوهُ مِنَ ٱلۡكِتَٰبِ وَمَا هُوَ مِنَ ٱلۡكِتَٰبِ وَيَقُولُونَ هُوَ مِنۡ عِندِ ٱللَّهِ وَمَا هُوَ مِنۡ عِندِ ٱللَّهِ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ ٨٧"
    },
    {
      "number": 372,
      "text": "مَا كَانَ لِبَشَرٍ أَنْ يُؤْتِيَهُ اللَّهُ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُوا عِبَادًا لِي مِنْ دُونِ اللَّهِ وَلَٰكِنْ كُونُوا رَبَّانِيِّينَ بِمَا كُنْتُمْ تُعَلِّمُونَ الْكِتَابَ وَبِمَا كُنْتُمْ تَدْرُسُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 79,
      "juz": 3,
      "manzil": 1,
      "page": 60,
      "ruku": 49,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَا كَانَ لِبَشَرٍ أَن يُؤۡتِيَهُ ٱللَّهُ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُواْ عِبَادٗا لِّي مِن دُونِ ٱللَّهِ وَلَٰكِن كُونُواْ رَبَّٰنِيِّ‍ۧنَ بِمَا كُنتُمۡ تُعَلِّمُونَ ٱلۡكِتَٰبَ وَبِمَا كُنتُمۡ تَدۡرُسُونَ ٩٧\n                                    \n                                    \n                                    قال محمد بن إسحاق : حدثنا محمد بن أبي محمد ، عن عكرمة أو سعيد بن جبير ، عن ابن عباس قال : قال أبو رافع القرظي ، حين اجتمعت الأحبار من اليهود والنصارى من أهل نجران ، عند رسول الله صلى الله عليه وسلم ودعاهم إلى الإسلام : أتريد يا محمد أن نعبدك كما تعبد النصارى عيسى ابن مريم ؟ فقال رجل من أهل نجران نصراني يقال له الرئيس : أوذاك تريد منا يا محمد ، وإليه تدعوننا ؟ أو كما قال . فقال رسول الله صلى الله عليه وسلم : \" معاذ الله أن نعبد غير الله ، أو أن نأمر بعبادة غيره ، ما بذلك بعثني ، ولا بذلك أمرني \" . أو كما قال صلى الله عليه وسلم ، فأنزل الله عز وجل في ذلك من قولهما : ( ما كان لبشر أن يؤتيه الله الكتاب والحكم والنبوة ) [ الآية ] إلى قوله : ( بعد إذ أنتم مسلمون ) .\nفقوله ( ما كان لبشر أن يؤتيه الله الكتاب والحكم والنبوة ثم يقول للناس كونوا عبادا لي من دون الله ) أي : ما ينبغي لبشر آتاه الله الكتاب والحكم والنبوة أن يقول للناس : اعبدوني من دون الله . أي : مع الله ، فإذا كان هذا لا يصلح لنبي ولا لمرسل ، فلأن لا يصلح لأحد من الناس غيرهم بطريق الأولى والأحرى ، ولهذا قال الحسن البصري : لا ينبغي هذا لمؤمن أن يأمر الناس بعبادته . قال : وذلك أن القوم كان يعبد بعضهم بعضا - يعني أهل الكتاب - كانوا يتعبدون لأحبارهم ورهبانهم ، كما قال الله تعالى : ( اتخذوا أحبارهم ورهبانهم أربابا من دون الله [ والمسيح ابن مريم وما أمروا إلا ليعبدوا إلها واحدا لا إله إلا هو سبحانه عما يشركون ] ) [ التوبة : 31 ] وفي المسند ، والترمذي - كما سيأتي - أن عدي بن حاتم قال : يا رسول الله ، ما عبدوهم . قال : \" بلى ، إنهم أحلوا لهم الحرام وحرموا عليهم الحلال ، فاتبعوهم ، فذلك عبادتهم إياهم \" .\nفالجهلة من الأحبار والرهبان ومشايخ الضلال يدخلون في هذا الذم والتوبيخ ، بخلاف الرسل وأتباعهم من العلماء العاملين ، فإنما يأمرون بما أمر الله به وبلغتهم إياه رسله الكرام . إنما ينهونهم عما نهاهم الله عنه وبلغتهم إياه رسله الكرام . فالرسل ، صلوات الله وسلامه عليهم أجمعين ، هم السفراء بين الله وبين خلقه في أداء ما حملوه من الرسالة وإبلاغ الأمانة ، فقاموا بذلك أتم قيام ، ونصحوا الخلق ، وبلغوهم الحق .\nوقوله : ( ولكن كونوا ربانيين بما كنتم تعلمون الكتاب وبما كنتم تدرسون ) أي : ولكن يقول الرسول للناس : كونوا ربانيين . قال ابن عباس وأبو رزين وغير واحد ، أي : حكماء علماء حلماء . وقال الحسن وغير واحد : فقهاء ، وكذا روي عن ابن عباس ، وسعيد بن جبير ، وقتادة ، وعطاء الخراساني ، وعطية العوفي ، والربيع بن أنس . وعن الحسن أيضا : يعني أهل عبادة وأهل تقوى .\nوقال الضحاك في قوله : ( بما كنتم تعلمون الكتاب وبما كنتم تدرسون ) حق على من تعلم القرآن أن يكون فقيها : \" تعلمون \" أي : تفهمون معناه . وقرئ ( تعلمون ) بالتشديد من التعليم ( وبما كنتم تدرسون ) تحفظون ألفاظه .\n                                    ",
        "qortoby": "مَا كَانَ لِبَشَرٍ أَن يُؤۡتِيَهُ ٱللَّهُ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُواْ عِبَادٗا لِّي مِن دُونِ ٱللَّهِ وَلَٰكِن كُونُواْ رَبَّٰنِيِّ‍ۧنَ بِمَا كُنتُمۡ تُعَلِّمُونَ ٱلۡكِتَٰبَ وَبِمَا كُنتُمۡ تَدۡرُسُونَ ٩٧\n                                    \n                                    \n                                    قوله تعالى : ما كان لبشر أن يؤتيه الله الكتاب والحكم والنبوة ثم يقول للناس كونوا عبادا لي من دون الله ولكن كونوا ربانيين بما كنتم تعلمون الكتاب وبما كنتم تدرسون\n( ما كان ) معناه ما ينبغي ; كما قال : وما كان لمؤمن أن يقتل مؤمنا إلا خطأ و ما كان لله أن يتخذ من ولد . و ما يكون لنا أن نتكلم بهذا يعني ما ينبغي . والبشر يقع للواحد والجمع لأنه بمنزلة المصدر ; والمراد به هنا عيسى في قول الضحاك والسدي . والكتاب : القرآن . والحكم : العلم والفهم . وقيل أيضا : الأحكام . أي إن الله لا يصطفي لنبوته الكذبة ، ولو فعل ذلك بشر لسلبه الله آيات النبوة وعلاماتها .\nونصب ثم يقول على الاشتراك بين أن يؤتيه وبين يقول أي لا يجتمع لنبي إتيان النبوة وقوله : كونوا عبادا لي من دون الله .\nولكن كونوا ربانيين أي ولكن جائز أن يكون النبي يقول لهم كونوا ربانيين . وهذه الآية قيل إنها نزلت في نصارى نجران . وكذلك روي أن السورة كلها إلى قوله وإذ غدوت من أهلك كان سبب نزولها نصارى نجران ولكن مزج معهم اليهود ; لأنهم فعلوا من الجحد والعناد فعلهم .\nوالربانيون واحدهم رباني منسوب إلى الرب . والرباني الذي يربي الناس بصغار العلم قبل كباره ; وكأنه يقتدي بالرب سبحانه في تيسير الأمور ; روي معناه عن ابن عباس . قال بعضهم : كان في الأصل ربي فأدخلت الألف والنون للمبالغة ; كما يقال للعظيم اللحية : لحياني ولعظيم الجمة جماني ولغليظ الرقبة رقباني . وقال المبرد : الربانيون أرباب العلم ، واحدهم ربان ، من قولهم : ربه يربه فهو ربان إذا دبره وأصلحه ; فمعناه على هذا يدبرون أمور الناس ويصلحونها . والألف والنون للمبالغة كما قالوا ريان وعطشان ، ثم ضمت إليها ياء النسبة كما قيل : لحياني ورقباني وجماني . قال الشاعر :\nلو كنت مرتهنا في الجو أنزلني منه الحديث ورباني أحباري\nفمعنى الرباني العالم بدين الرب الذي يعمل بعلمه ; لأنه إذا لم يعمل بعلمه فليس بعالم . وقد تقدم هذا المعنى في البقرة : وقال أبو رزين : الرباني هو العالم الحكيم . وروى شعبة عن عاصم عن زر عن عبد الله بن مسعود ولكن كونوا ربانيين قال : حكماء علماء . ابن جبير : حكماء أتقياء . وقال الضحاك : لا ينبغي لأحد أن يدع حفظ القرآن جهده فإن الله تعالى يقول : ولكن كونوا ربانيين . وقال ابن زيد : الربانيون الولاة ، والأحبار العلماء . وقال مجاهد : الربانيون فوق الأحبار . قال النحاس : وهو قول حسن ; لأن الأحبار هم العلماء . والرباني الذي يجمع إلى العلم البصر بالسياسة ; مأخوذ من قول العرب : رب أمر الناس يربه إذا أصلحه وقام به ، فهو راب ورباني على التكثير . قال أبو عبيدة : سمعت عالما يقول : الرباني العالم بالحلال والحرام والأمر والنهي ، العارف بأنباء الأمة وما كان وما يكون . وقال محمد بن الحنفية يوم مات أبي عباس : اليوم مات رباني هذه الأمة . وروي عن النبي - صلى الله عليه وسلم - أنه قال : ما من مؤمن ذكر ولا أنثى حر ولا مملوك إلا ولله عز وجل عليه حق أن يتعلم من القرآن ويتفقه في دينه - ثم تلا هذه الآية - ولكن كونوا ربانيين الآية . رواه ابن عباس .\nقوله تعالى : بما كنتم تعلمون الكتاب وبما كنتم تدرسون قرأه أبو عمرو وأهل المدينة بالتخفيف من العلم . واختار هذه القراءة أبو حاتم . قال أبو عمرو : وتصديقها تدرسون ولم يقل \" تدرسون \" بالتشديد من التدريس . وقرأ ابن عامر وأهل الكوفة تعلمون بالتشديد من التعليم ; واختارها أبو عبيد . قال : لأنها تجمع المعنيين \" تعلمون ، و ( تدرسون ) . قال مكي : التشديد أبلغ ، لأن كل معلم عالم بمعنى يعلم وليس كل من علم شيئا معلما ، فالتشديد يدل على العلم والتعليم ، والتخفيف إنما يدل على العلم فقط ، فالتعليم أبلغ وأمدح وغيره أبلغ في الذم . احتج من رجح قراءة التخفيف بقول ابن مسعود كونوا ربانيين قال : حكماء علماء ; فيبعد أن يقال كونوا فقهاء حكماء علماء بتعليمكم . قال الحسن كونوا حكماء علماء بعلمكم . وقرأ أبو حيوة ( تدرسون ) من أدرس يدرس . وقرأ مجاهد ( تعلمون ) بفتح التاء وتشديد اللام ، أي تتعلمون .\n                                    ",
        "saadi": "مَا كَانَ لِبَشَرٍ أَن يُؤۡتِيَهُ ٱللَّهُ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُواْ عِبَادٗا لِّي مِن دُونِ ٱللَّهِ وَلَٰكِن كُونُواْ رَبَّٰنِيِّ‍ۧنَ بِمَا كُنتُمۡ تُعَلِّمُونَ ٱلۡكِتَٰبَ وَبِمَا كُنتُمۡ تَدۡرُسُونَ ٩٧\n                                        \n                                        \n                                        \n                                        وهذه الآية نزلت ردا لمن قال من أهل الكتاب للنبي صلى الله عليه وسلم لما أمرهم بالإيمان به ودعاهم إلى طاعته: أتريد يا محمد أن نعبدك مع الله، فقوله { ما كان لبشر } أي: يمتنع ويستحيل على بشر من الله عليه بإنزال الكتاب وتعليمه ما لم يكن يعلم وإرساله للخلق { أن يقول للناس كونوا عبادا لي من دون الله } فهذا من أمحل المحال صدوره من أحد من الأنبياء عليهم أفضل الصلاة والسلام، لأن هذا أقبح الأوامر على الإطلاق، والأنبياء أكمل الخلق على الإطلاق، فأوامرهم تكون مناسبة لأحوالهم، فلا يأمرون إلا بمعالي الأمور وهم أعظم الناس نهيا عن الأمور القبيحة، فلهذا قال { ولكن كونوا ربانيين بما كنتم تعلمون الكتاب وبما كنتم تدرسون } أي: ولكن يأمرهم بأن يكونوا ربانيين، أي: علماء حكماء حلماء معلمين للناس ومربيهم، بصغار العلم قبل كباره، عاملين بذلك، فهم يأمرون بالعلم والعمل والتعليم التي هي مدار السعادة، وبفوات شيء منها يحصل النقص والخلل، والباء في قوله { بما كنتم تعلمون } إلخ، باء السببية، أي: بسبب تعليمكم لغيركم المتضمن لعلمكم ودرسكم لكتاب الله وسنة نبيه، التي بدرسها يرسخ العلم ويبقى، تكونون ربانيين.\n                                    "
      },
      "originalText": "مَا كَانَ لِبَشَرٍ أَن يُؤۡتِيَهُ ٱللَّهُ ٱلۡكِتَٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ ثُمَّ يَقُولَ لِلنَّاسِ كُونُواْ عِبَادٗا لِّي مِن دُونِ ٱللَّهِ وَلَٰكِن كُونُواْ رَبَّٰنِيِّ‍ۧنَ بِمَا كُنتُمۡ تُعَلِّمُونَ ٱلۡكِتَٰبَ وَبِمَا كُنتُمۡ تَدۡرُسُونَ ٩٧"
    },
    {
      "number": 373,
      "text": "وَلَا يَأْمُرَكُمْ أَنْ تَتَّخِذُوا الْمَلَائِكَةَ وَالنَّبِيِّينَ أَرْبَابًا ۗ أَيَأْمُرُكُمْ بِالْكُفْرِ بَعْدَ إِذْ أَنْتُمْ مُسْلِمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 80,
      "juz": 3,
      "manzil": 1,
      "page": 60,
      "ruku": 49,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا يَأۡمُرَكُمۡ أَن تَتَّخِذُواْ ٱلۡمَلَٰٓئِكَةَ وَٱلنَّبِيِّ‍ۧنَ أَرۡبَابًاۗ أَيَأۡمُرُكُم بِٱلۡكُفۡرِ بَعۡدَ إِذۡ أَنتُم مُّسۡلِمُونَ ٠٨\n                                    \n                                    \n                                    ثم قال : ( ولا يأمركم أن تتخذوا الملائكة والنبيين أربابا ) أي : ولا يأمركم بعبادة أحد غير الله ، لا نبي مرسل ولا ملك مقرب ( أيأمركم بالكفر بعد إذ أنتم مسلمون ) أي : لا يفعل ذلك ، لأن من دعا إلى عبادة غير الله فقد دعا إلى الكفر ، والأنبياء إنما يأمرون بالإيمان ، وهو عبادة الله وحده لا شريك له ، كما قال تعالى : ( وما أرسلنا من قبلك من رسول إلا نوحي إليه أنه لا إله إلا أنا فاعبدون ) [ الأنبياء : 25 ] وقال تعالى : ( ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت ) الآية ، [ النحل : 36 ] وقال تعالى ( واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون ) [ الزخرف : 45 ] وقال [ تعالى ] إخبارا عن الملائكة : ( ومن يقل منهم إني إله من دونه فذلك نجزيه جهنم كذلك نجزي الظالمين ) [ الأنبياء : 29 ] .\n                                    ",
        "qortoby": "وَلَا يَأۡمُرَكُمۡ أَن تَتَّخِذُواْ ٱلۡمَلَٰٓئِكَةَ وَٱلنَّبِيِّ‍ۧنَ أَرۡبَابًاۗ أَيَأۡمُرُكُم بِٱلۡكُفۡرِ بَعۡدَ إِذۡ أَنتُم مُّسۡلِمُونَ ٠٨\n                                    \n                                    \n                                    قوله تعالى : ولا يأمركم أن تتخذوا الملائكة والنبيين أربابا أيأمركم بالكفر بعد إذ أنتم مسلمون\nقرأ ابن عامر وعاصم وحمزة بالنصب عطفا على أن يؤتيه . ويقويه أن اليهود قالت للنبي - صلى الله عليه وسلم - : أتريد أن نتخذك يا محمد ربا ؟ فقال الله تعالى : ما كان لبشر أن يؤتيه الله الكتاب والحكم والنبوة - إلى قوله : ولا يأمركم . وفيه ضمير البشر ، أي ولا يأمركم البشر يعني عيسى وعزيرا . وقرأ الباقون بالرفع على الاستئناف والقطع من الكلام الأول ، وفيه ضمير اسم الله عز وجل ، أي ولا يأمركم الله أن تتخذوا . ويقوي هذه القراءة أن في مصحف عبد الله ( ولن يأمركم ) فهذا يدل على الاستئناف ، والضمير أيضا لله عز وجل ; ذكره مكي ، وقال سيبويه والزجاج . وقال ابن جريج وجماعة : ولا يأمركم محمد عليه السلام . وهذه قراءة أبي عمرو والكسائي وأهل الحرمين . أن تتخذوا أي بأن تتخذوا الملائكة والنبيين أربابا . وهذا موجود في النصارى يعظمون الأنبياء والملائكة حتى يجعلوهم لهم أربابا .\nأيأمركم بالكفر بعد إذ أنتم مسلمون على طريق الإنكار والتعجب ; فحرم الله تعالى على الأنبياء أن يتخذوا الناس عبادا يتألهون لهم ولكن ألزم الخلق حرمتهم . وقد ثبت عن النبي - صلى الله عليه وسلم - أنه قال : لا يقولن أحدكم عبدي وأمتي وليقل فتاي وفتاتي ولا يقل أحدكم ربي وليقل سيدي . وفي التنزيل اذكرني عند ربك . وهناك يأتي بيان هذا المعنى إن شاء الله تعالى .\n                                    ",
        "saadi": "وَلَا يَأۡمُرَكُمۡ أَن تَتَّخِذُواْ ٱلۡمَلَٰٓئِكَةَ وَٱلنَّبِيِّ‍ۧنَ أَرۡبَابًاۗ أَيَأۡمُرُكُم بِٱلۡكُفۡرِ بَعۡدَ إِذۡ أَنتُم مُّسۡلِمُونَ ٠٨\n                                        \n                                        \n                                        \n                                        { ولا يأمركم أن تتخذوا الملائكة والنبيين أربابا } وهذا تعميم بعد تخصيص، أي: لا يأمركم بعبادة نفسه ولا بعبادة أحد من الخلق من الملائكة والنبيين وغيرهم { أيأمركم بالكفر بعد إذ أنتم مسلمون } هذا ما لا يكون ولا يتصور أن يصدر من أحد من الله عليه بالنبوة، فمن قدح في أحد منهم بشيء من ذلك فقد ارتكب إثما عظيما وكفرا وخيما.\n                                    "
      },
      "originalText": "وَلَا يَأۡمُرَكُمۡ أَن تَتَّخِذُواْ ٱلۡمَلَٰٓئِكَةَ وَٱلنَّبِيِّ‍ۧنَ أَرۡبَابًاۗ أَيَأۡمُرُكُم بِٱلۡكُفۡرِ بَعۡدَ إِذۡ أَنتُم مُّسۡلِمُونَ ٠٨"
    },
    {
      "number": 374,
      "text": "وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ النَّبِيِّينَ لَمَا آتَيْتُكُمْ مِنْ كِتَابٍ وَحِكْمَةٍ ثُمَّ جَاءَكُمْ رَسُولٌ مُصَدِّقٌ لِمَا مَعَكُمْ لَتُؤْمِنُنَّ بِهِ وَلَتَنْصُرُنَّهُ ۚ قَالَ أَأَقْرَرْتُمْ وَأَخَذْتُمْ عَلَىٰ ذَٰلِكُمْ إِصْرِي ۖ قَالُوا أَقْرَرْنَا ۚ قَالَ فَاشْهَدُوا وَأَنَا مَعَكُمْ مِنَ الشَّاهِدِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 81,
      "juz": 3,
      "manzil": 1,
      "page": 60,
      "ruku": 50,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلنَّبِيِّ‍ۧنَ لَمَآ ءَاتَيۡتُكُم مِّن كِتَٰبٖ وَحِكۡمَةٖ ثُمَّ جَآءَكُمۡ رَسُولٞ مُّصَدِّقٞ لِّمَا مَعَكُمۡ لَتُؤۡمِنُنَّ بِهِۦ وَلَتَنصُرُنَّهُۥۚ قَالَ ءَأَقۡرَرۡتُمۡ وَأَخَذۡتُمۡ عَلَىٰ ذَٰلِكُمۡ إِصۡرِيۖ قَالُوٓاْ أَقۡرَرۡنَاۚ قَالَ فَٱشۡهَدُواْ وَأَنَا۠ مَعَكُم مِّنَ ٱلشَّٰهِدِينَ ١٨\n                                    \n                                    \n                                    يخبر تعالى أنه أخذ ميثاق كل نبي بعثه من لدن آدم ، عليه السلام ، إلى عيسى ، عليه السلام ، لمهما آتى الله أحدهم من كتاب وحكمة ، وبلغ أي مبلغ ، ثم جاءه رسول من بعده ، ليؤمنن به ولينصرنه ، ولا يمنعه ما هو فيه من العلم والنبوة من اتباع من بعث بعده ونصرته ، ولهذا قال تعالى وتقدس : ( وإذ أخذ الله ميثاق النبيين لما آتيتكم من كتاب وحكمة ) أي : لمهما أعطيتكم من كتاب وحكمة ( ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتنصرنه قال أأقررتم وأخذتم على ذلكم إصري )\nوقال ابن عباس ، ومجاهد ، والربيع ، وقتادة ، والسدي : يعني عهدي .\nوقال محمد بن إسحاق : ( إصري ) أي : ثقل ما حملتم من عهدي ، أي ميثاقي الشديد المؤكد .\n( قالوا أقررنا قال فاشهدوا وأنا معكم من الشاهدين)\n                                    ",
        "qortoby": "وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلنَّبِيِّ‍ۧنَ لَمَآ ءَاتَيۡتُكُم مِّن كِتَٰبٖ وَحِكۡمَةٖ ثُمَّ جَآءَكُمۡ رَسُولٞ مُّصَدِّقٞ لِّمَا مَعَكُمۡ لَتُؤۡمِنُنَّ بِهِۦ وَلَتَنصُرُنَّهُۥۚ قَالَ ءَأَقۡرَرۡتُمۡ وَأَخَذۡتُمۡ عَلَىٰ ذَٰلِكُمۡ إِصۡرِيۖ قَالُوٓاْ أَقۡرَرۡنَاۚ قَالَ فَٱشۡهَدُواْ وَأَنَا۠ مَعَكُم مِّنَ ٱلشَّٰهِدِينَ ١٨\n                                    \n                                    \n                                    قوله تعالى : وإذ أخذ الله ميثاق النبيين لما آتيتكم من كتاب وحكمة ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتنصرنه قال أأقررتم وأخذتم على ذلكم إصري قالوا أقررنا قال فاشهدوا وأنا معكم من الشاهدين\nقيل : أخذ الله تعالى ميثاق الأنبياء أن يصدق بعضهم بعضا ويأمر بعضهم بالإيمان بعضا ; فذلك معنى النصرة بالتصديق . وهذا قول سعيد بن جبير وقتادة وطاوس والسدي والحسن ، وهو ظاهر الآية . قال طاوس : أخذ الله ميثاق الأول من الأنبياء أن يؤمن بما جاء به الآخر . وقرأ ابن مسعود \" وإذ أخذ الله ميثاق الذين أوتوا الكتاب \" . قال الكسائي : يجوز أن يكون وإذ أخذ الله ميثاق النبيين بمعنى وإذ أخذ الله ميثاق الذين مع النبيين . وقال البصريون : إذا أخذ الله ميثاق النبيين فقد أخذ ميثاق الذين معهم ; لأنهم قد اتبعوهم وصدقوهم . و \" ما \" في قوله لما بمعنى الذي . قال سيبويه : سألت الخليل بن أحمد عن قوله عز وجل : وإذ أخذ الله ميثاق النبيين لما آتيتكم من كتاب وحكمة فقال : لما بمعنى الذي قال النحاس : التقدير على قول الخليل للذي آتيتكموه ، ثم حذف الهاء لطول الاسم . و \" الذي \" رفع بالابتداء وخبره من كتاب وحكمة . و ( من ) لبيان الجنس . وهذا كقول القائل : لزيد أفضل منك ; وهو قول الأخفش أنها لام الابتداء . قال المهدوي : وقوله ثم جاءكم وما بعده جملة معطوفة على الصلة ، والعائد منها على الموصول محذوف ; والتقدير ثم جاءكم رسول مصدق به .\nقوله تعالى : ثم جاءكم رسول مصدق لما معكم لتؤمنن به ولتنصرنه الرسول هنا محمد - صلى الله عليه وسلم - في قول علي وابن عباس رضي الله عنهما . واللفظ وإن كان نكرة فالإشارة إلى معين ; كقوله تعالى : وضرب الله مثلا قرية كانت آمنة مطمئنة إلى قوله : ولقد جاءهم رسول منهم فكذبوه\nفأخذ الله ميثاق النبيين أجمعين أن يؤمنوا بمحمد عليه السلام وينصروه إن أدركوه ، وأمرهم أن يأخذوا بذلك الميثاق على أممهم . واللام من قوله لتؤمنن به جواب القسم الذي هو أخذ الميثاق ، إذ هو بمنزلة الاستحلاف . وهو كما تقول في الكلام : أخذت ميثاقك لتفعلن كذا ، كأنك قلت أستحلفك ، وفصل بين القسم وجوابه بحرف الجر الذي هو \" لما \" في قراءة ابن كثير على ما يأتي . ومن فتحها جعلها متلقية للقسم الذي هو أخذ الميثاق . واللام في لتؤمنن به جواب قسم محذوف ، أي والله لتؤمنن به . وقال المبرد والكسائي والزجاج : \" ما \" شرط دخلت عليها لام التحقيق كما تدخل على إن ، ومعناه لمهما آتيتكم ; فموضع \" ما \" نصب ، وموضع \" آتيتكم \" جزم ، و \" ثم جاءكم \" معطوف عليه ، \" لتؤمنن به \" اللام في قوله \" لتؤمنن به \" جواب الجزاء ; كقوله تعالى : ولئن شئنا لنذهبن ونحوه . وقال الكسائي : لتؤمنن به معتمد القسم فهو متصل بالكلام الأول ، وجواب الجزاء قوله فمن تولى بعد ذلك . ولا يحتاج على هذا الوجه إلى تقدير عائد . وقرأ أهل الكوفة \" لما آتيتكم \" بكسر اللام ، وهي أيضا بمعنى الذي وهي متعلقة بأخذ ، أي أخذ الله ميثاقهم لأجل الذي آتاهم من كتاب وحكمة ثم إن جاءكم رسول مصدق لما معكم لتؤمنن به من بعد الميثاق ; لأن أخذ الميثاق في معنى الاستحلاف كما تقدم . قال النحاس : ولأبي عبيدة في هذا قول حسن . قال : المعنى وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتؤمنن به لما آتيتكم من ذكر التوراة . وقيل : في الكلام حذف ، والمعنى إذ أخذ الله ميثاق النبيين لتعلمن الناس لما جاءكم من كتاب وحكمة ، ولتأخذن على الناس أن يؤمنوا . ودل على هذا الحذف وأخذتم على ذلكم إصري . وقيل : إن اللام في قوله \" لما \" في قراءة من كسرها بمعنى بعد ، يعني بعدما آتيتكم من كتاب وحكمة ; كما قال النابغة :\nتوهمت آيات لها فعرفتها لستة أعوام وذا العام سابع\nأي بعد ستة أعوام . وقرأ سعيد بن جبير \" لما \" بالتشديد ، ومعناه حين آتيتكم . واحتمل أن يكون أصلها التخفيف فزيدت \" من \" على مذهب من يرى زيادتها في الواجب فصارت لمن ما ، وقلبت النون ميما للإدغام فاجتمعت ثلاث ميمات فحذفت الأولى منهن استخفافا . وقرأ أهل المدينة \" آتيناكم \" على التعظيم . والباقون آتيتكم على لفظ الواحد . ثم كل الأنبياء لم يؤتوا الكتاب وإنما أوتي البعض ، ولكن الغلبة للذين أوتوا الكتاب . والمراد أخذ ميثاق جميع الأنبياء فمن لم يؤت الكتاب فهو في حكم من أوتي الكتاب لأنه أوتي الحكم والنبوة . وأيضا من لم يؤت الكتاب أمر بأن يأخذ بكتاب من قبله فدخل تحت صفة من أوتي الكتاب .\nقوله تعالى : أأقررتم وأخذتم على ذلكم إصري قالوا أقررنا قال فاشهدوا وأنا معكم من الشاهدين \" أقررتم \" من الإقرار ، والإصر والأصر لغتان ، وهو العهد . والإصر في اللغة الثقل ; فسمي العهد إصرا لأنه منع وتشديد . قال فاشهدوا أي اعلموا ; عن ابن عباس . الزجاج : بينوا لأن الشاهد هو الذي يصحح دعوى المدعي . وقيل : المعنى اشهدوا أنتم على أنفسكم وعلى أتباعكم . وأنا معكم من الشاهدين عليكم وعليهم . وقال سعيد بن المسيب : قال الله عز وجل للملائكة فاشهدوا عليهم ، فتكون كناية عن غير مذكور .\n                                    ",
        "saadi": "وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلنَّبِيِّ‍ۧنَ لَمَآ ءَاتَيۡتُكُم مِّن كِتَٰبٖ وَحِكۡمَةٖ ثُمَّ جَآءَكُمۡ رَسُولٞ مُّصَدِّقٞ لِّمَا مَعَكُمۡ لَتُؤۡمِنُنَّ بِهِۦ وَلَتَنصُرُنَّهُۥۚ قَالَ ءَأَقۡرَرۡتُمۡ وَأَخَذۡتُمۡ عَلَىٰ ذَٰلِكُمۡ إِصۡرِيۖ قَالُوٓاْ أَقۡرَرۡنَاۚ قَالَ فَٱشۡهَدُواْ وَأَنَا۠ مَعَكُم مِّنَ ٱلشَّٰهِدِينَ ١٨\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه أخذ ميثاق النبيين وعهدهم المؤكد بسبب ما أعطاهم من كتاب الله المنزل، والحكمة الفاصلة بين الحق والباطل والهدى والضلال، إنه إن بعث الله رسولا مصدقا لما معهم أن يؤمنوا به ويصدقوه ويأخذوا ذلك على أممهم، فالأنبياء عليهم الصلاة والسلام قد أوجب الله عليهم أن يؤمن بعضهم ببعض، ويصدق بعضهم بعضا لأن جميع ما عندهم هو من عند الله، وكل ما من عند الله يجب التصديق به والإيمان، فهم كالشيء الواحد، فعلى هذا قد علم أن محمدا صلى الله عليه وسلم هو خاتمهم، فكل الأنبياء عليهم الصلاة والسلام لو أدركوه لوجب عليهم الإيمان به واتباعه ونصرته، وكان هو إمامهم ومقدمهم ومتبوعهم، فهذه الآية الكريمة من أعظم الدلائل على علو مرتبته وجلالة قدره، وأنه أفضل الأنبياء وسيدهم صلى الله عليه وسلم لما قررهم تعالى { قالوا أقررنا } أي: قبلنا ما أمرتنا به على الرأس والعين { قال } الله لهم: { فاشهدوا } على أنفسكم وعلى أممكم بذلك، قال { وأنا معكم من الشاهدين فمن تولى بعد ذلك } العهد والميثاق المؤكد بالشهادة من الله ومن رسله\n                                    "
      },
      "originalText": "وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلنَّبِيِّ‍ۧنَ لَمَآ ءَاتَيۡتُكُم مِّن كِتَٰبٖ وَحِكۡمَةٖ ثُمَّ جَآءَكُمۡ رَسُولٞ مُّصَدِّقٞ لِّمَا مَعَكُمۡ لَتُؤۡمِنُنَّ بِهِۦ وَلَتَنصُرُنَّهُۥۚ قَالَ ءَأَقۡرَرۡتُمۡ وَأَخَذۡتُمۡ عَلَىٰ ذَٰلِكُمۡ إِصۡرِيۖ قَالُوٓاْ أَقۡرَرۡنَاۚ قَالَ فَٱشۡهَدُواْ وَأَنَا۠ مَعَكُم مِّنَ ٱلشَّٰهِدِينَ ١٨"
    },
    {
      "number": 375,
      "text": "فَمَنْ تَوَلَّىٰ بَعْدَ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الْفَاسِقُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 82,
      "juz": 3,
      "manzil": 1,
      "page": 60,
      "ruku": 50,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَمَن تَوَلَّىٰ بَعۡدَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ ٢٨\n                                    \n                                    \n                                    ( فمن تولى بعد ذلك ) أي : عن هذا العهد والميثاق ، ( فأولئك هم الفاسقون )\nقال علي بن أبي طالب وابن عمه عبد الله بن عباس ، رضي الله عنهما : ما بعث الله نبيا من الأنبياء إلا أخذ عليه الميثاق ، لئن بعث محمد وهو حي ليؤمنن به ولينصرنه ، وأمره أن يأخذ الميثاق على أمته : لئن بعث محمد [ صلى الله عليه وسلم ] وهم أحياء ليؤمنن به ولينصرنه .\nوقال طاوس ، والحسن البصري ، وقتادة : أخذ الله ميثاق النبيين أن يصدق بعضهم بعضا .\nوهذا لا يضاد ما قاله علي وابن عباس ولا ينفيه ، بل يستلزمه ويقتضيه . ولهذا رواه عبد الرزاق ، عن معمر ، عن ابن طاوس ، عن أبيه مثل قول علي وابن عباس .\nوقد قال الإمام أحمد : حدثنا عبد الرزاق ، أنبأنا سفيان ، عن جابر ، عن الشعبي ، عن عبد الله بن ثابت قال : جاء عمر إلى النبي صلى الله عليه وسلم فقال : يا رسول الله ، إني مررت بأخ لي من قريظة ، فكتب لي جوامع من التوراة ، ألا أعرضها عليك ؟ قال : فتغير وجه رسول الله صلى الله عليه وسلم - قال عبد الله بن ثابت : قلت له : ألا ترى ما بوجه رسول الله صلى الله عليه وسلم ؟ فقال عمر : رضينا بالله ربا ، وبالإسلام دينا ، وبمحمد رسولا - قال : فسري عن رسول الله صلى الله عليه وسلم وقال : \" والذي نفس محمد بيده لو أصبح فيكم موسى عليه السلام ، ثم اتبعتموه وتركتموني لضللتم ، إنكم حظي من الأمم ، وأنا حظكم من النبيين \" .\nحديث آخر : قال الحافظ أبو بكر حدثنا إسحاق ، حدثنا حماد ، عن مجالد ، عن الشعبي ، عن جابر قال : قال رسول الله صلى الله عليه وسلم : \" لا تسألوا أهل الكتاب عن شيء ، فإنهم لن يهدوكم وقد ضلوا ، وإنكم إما أن تصدقوا بباطل وإما أن تكذبوا بحق ، وإنه - والله - لو كان موسى حيا بين أظهركم ما حل له إلا أن يتبعني \" .\nوفي بعض الأحاديث [ له ] : \" لو كان موسى وعيسى حيين لما وسعهما إلا اتباعي \" .\nفالرسول محمد خاتم الأنبياء صلوات الله وسلامه عليه ، دائما إلى يوم الدين ، وهو الإمام الأعظم الذي لو وجد في أي عصر وجد لكان هو الواجب الطاعة المقدم على الأنبياء كلهم ، ولهذا كان إمامهم ليلة الإسراء لما اجتمعوا ببيت المقدس ، وكذلك هو الشفيع في يوم الحشر في إتيان الرب لفصل القضاء ، وهو المقام المحمود الذي لا يليق إلا له ، والذي يحيد عنه أولو العزم من الأنبياء والمرسلين ، حتى تنتهي النوبة إليه ، فيكون هو المخصوص به .\n                                    ",
        "qortoby": "فَمَن تَوَلَّىٰ بَعۡدَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ ٢٨\n                                    \n                                    \n                                    قوله تعالى : فمن تولى بعد ذلك فأولئك هم الفاسقون \" من \" شرط . فمن تولى من أمم الأنبياء عن الإيمان بعد أخذ الميثاق فأولئك هم الفاسقون أي الخارجون عن الإيمان . والفاسق الخارج . وقد تقدم .\n                                    ",
        "saadi": "فَمَن تَوَلَّىٰ بَعۡدَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ ٢٨\n                                        \n                                        \n                                        \n                                        { فأولئك هم الفاسقون } فعلى هذا كل من ادعى أنه من أتباع الأنبياء كاليهود والنصارى ومن تبعهم، فقد تولوا عن هذا الميثاق الغليظ، واستحقوا الفسق الموجب للخلود في النار إن لم يؤمنوا بمحمد صلى الله عليه وسلم.\n                                    "
      },
      "originalText": "فَمَن تَوَلَّىٰ بَعۡدَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ ٢٨"
    },
    {
      "number": 376,
      "text": "أَفَغَيْرَ دِينِ اللَّهِ يَبْغُونَ وَلَهُ أَسْلَمَ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَإِلَيْهِ يُرْجَعُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 83,
      "juz": 3,
      "manzil": 1,
      "page": 60,
      "ruku": 50,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَفَغَيۡرَ دِينِ ٱللَّهِ يَبۡغُونَ وَلَهُۥٓ أَسۡلَمَ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَإِلَيۡهِ يُرۡجَعُونَ ٣٨\n                                    \n                                    \n                                        يقول تعالى منكرا على من أراد دينا سوى دين الله ، الذي أنزل به كتبه وأرسل به رسله ، وهو عبادته وحده لا شريك له ، الذي ( له أسلم من في السماوات والأرض ) أي : استسلم له من فيهما طوعا وكرها ، كما قال تعالى : ( ولله يسجد من في السماوات والأرض طوعا وكرها وظلالهم بالغدو والآصال ) [ الرعد : 15 ] وقال تعالى : ( أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون . ولله يسجد ما في السماوات وما في الأرض من دابة والملائكة وهم لا يستكبرون يخافون ربهم من فوقهم ويفعلون ما يؤمرون ) [ النحل : 48 - 50 ] .\nفالمؤمن مستسلم بقلبه وقالبه لله ، والكافر مستسلم لله كرها ، فإنه تحت التسخير والقهر والسلطان العظيم ، الذي لا يخالف ولا يمانع . وقد ورد حديث في تفسير هذه الآية ، على معنى آخر فيه غرابة ، فقال الحافظ أبو القاسم الطبراني :\nحدثنا أحمد بن النضر العسكري ، حدثنا سعيد بن حفص النفيلي ، حدثنا محمد بن محصن العكاشي ، حدثنا الأوزاعي ، عن عطاء بن أبي رباح ، عن النبي صلى الله عليه وسلم : ( وله أسلم من في السماوات والأرض طوعا وكرها ) أما من في السماوات فالملائكة ، وأما من في الأرض فمن ولد على الإسلام ، وأما كرها فمن أتي به من سبايا الأمم في السلاسل والأغلال ، يقادون إلى الجنة وهم كارهون \" .\nوقد ورد في الصحيح : \" عجب ربك من قوم يقادون إلى الجنة في السلاسل \" وسيأتي له شاهد من وجه آخر ولكن المعنى الأول للآية أقوى .\nوقد قال وكيع في تفسيره : حدثنا سفيان ، عن منصور ، عن مجاهد : ( وله أسلم من في السماوات والأرض طوعا وكرها ) قال : هو كقوله : ( ولئن سألتهم من خلق السماوات والأرض ليقولن الله ) [ لقمان : 25 ] .\nوقال أيضا : حدثنا سفيان ، عن الأعمش ، عن مجاهد ، عن ابن عباس : ( وله أسلم من في السماوات والأرض طوعا وكرها ) قال : حين أخذ الميثاق .\n( وإليه يرجعون ) أي : يوم المعاد ، فيجازي كلا بعمله .\n                                    ",
        "qortoby": "أَفَغَيۡرَ دِينِ ٱللَّهِ يَبۡغُونَ وَلَهُۥٓ أَسۡلَمَ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَإِلَيۡهِ يُرۡجَعُونَ ٣٨\n                                    \n                                    \n                                    قوله تعالى : أفغير دين الله يبغون وله أسلم من في السماوات والأرض طوعا وكرها وإليه يرجعون\nقوله تعالى : أفغير دين الله يبغون قال الكلبي : إن كعب بن الأشرف وأصحابه اختصموا مع النصارى إلى النبي - صلى الله عليه وسلم - فقالوا : أينا أحق بدين إبراهيم ؟ فقال النبي - صلى الله عليه وسلم - : ( كلا الفريقين بريء من دينه ) . فقالوا : ما نرضى بقضائك ولا نأخذ بدينك ; فنزل أفغير دين الله يبغون يعني يطلبون . ونصبت غير بيبغون ، أي يبغون غير دين الله . وقرأ أبو عمرو وحده \" يبغون \" بالياء على الخبر \" وإليه ترجعون \" بالتاء على المخاطبة . قال : لأن الأول خاص والثاني عام ففرق بينهما لافتراقهما في المعنى . وقرأ حفص وغيره يبغون ، و ( يرجعون ) بالياء فيهما ; لقوله : فأولئك هم الفاسقون . وقرأ الباقون بالتاء فيهما على الخطاب ; لقوله لما آتيتكم من كتاب وحكمة ، والله أعلم .\nقوله تعالى : وله أسلم أي استسلم وانقاد وخضع وذل ، وكل مخلوق فهو منقاد مستسلم ; لأنه مجبول على ما لا يقدر أن يخرج عنه . قال قتادة : أسلم المؤمن طوعا والكافر عند موته كرها ولا ينفعه ذلك ; لقوله : فلم يك ينفعهم إيمانهم لما رأوا بأسنا . قال مجاهد : إسلام الكافر كرها بسجوده لغير الله وسجود ظله لله ، أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون ولله يسجد من في السماوات والأرض طوعا وكرها وظلالهم بالغدو والآصال . وقيل : المعنى أن الله خلق الخلق على ما أراد منهم ; فمنهم الحسن والقبيح والطويل والقصير والصحيح والمريض وكلهم منقادون اضطرارا ، فالصحيح منقاد طائع محب لذلك ; والمريض منقاد خاضع وإن كان كارها . والطوع الانقياد والاتباع بسهولة . والكره ما كان بمشقة وإباء من النفس .\nطوعا وكرها مصدران في موضع الحال ، أي طائعين ومكرهين . وروى أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - في قوله عز وجل : وله أسلم من في السماوات والأرض طوعا وكرها قال : الملائكة أطاعوه في السماء والأنصار وعبد القيس في الأرض . وقال عليه السلام : لا تسبوا أصحابي فإن أصحابي أسلموا من خوف الله وأسلم الناس من خوف السيف . وقال عكرمة : طوعا من أسلم من غير محاجة وكرها من اضطرته الحجة إلى التوحيد . يدل عليه قوله عز وجل : ولئن سألتهم من خلقهم ليقولن الله ولئن سألتهم من خلق السماوات والأرض وسخر الشمس والقمر ليقولن الله . قال الحسن : هو عموم معناه الخصوص . وعنه : \" أسلم من في السماوات \" وتم الكلام . ثم قال : \" والأرض طوعا وكرها \" . قال : والكاره المنافق لا ينفعه عمله . و طوعا وكرها مصدران في موضع الحال . عن مجاهد عن ابن عباس قال : إذا استصعبت دابة أحدكم أو كانت شموسا فليقرأ في أذنها هذه الآية : أفغير دين الله يبغون وله أسلم من في السماوات والأرض طوعا وكرها إلى آخر الآية .\n                                    ",
        "saadi": "أَفَغَيۡرَ دِينِ ٱللَّهِ يَبۡغُونَ وَلَهُۥٓ أَسۡلَمَ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَإِلَيۡهِ يُرۡجَعُونَ ٣٨\n                                        \n                                        \n                                        \n                                        أي: أيطلب الطالبون ويرغب الراغبون في غير دين الله؟ لا يحسن هذا ولا يليق، لأنه لا أحسن دينا من دين الله { وله أسلم من في السماوات والأرض طوعا وكرها } أي: الخلق كلهم منقادون بتسخيره مستسلمون له طوعا واختيارا، وهم المؤمنون المسلمون المنقادون لعبادة ربهم، وكرها وهم سائر الخلق، حتى الكافرون مستسلمون لقضائه وقدره لا خروج لهم عنه، ولا امتناع لهم منه، وإليه مرجع الخلائق كلها، فيحكم بينهم ويجازيهم بحكمه الدائر بين الفضل والعدل.\n                                    "
      },
      "originalText": "أَفَغَيۡرَ دِينِ ٱللَّهِ يَبۡغُونَ وَلَهُۥٓ أَسۡلَمَ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَإِلَيۡهِ يُرۡجَعُونَ ٣٨"
    }
  ]
}