{
  "number": 62,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 385,
      "text": "لَنْ تَنَالُوا الْبِرَّ حَتَّىٰ تُنْفِقُوا مِمَّا تُحِبُّونَ ۚ وَمَا تُنْفِقُوا مِنْ شَيْءٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 92,
      "juz": 3,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 24,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَن تَنَالُواْ ٱلۡبِرَّ حَتَّىٰ تُنفِقُواْ مِمَّا تُحِبُّونَۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ ٢٩\n                                    \n                                    \n                                    [ روى وكيع في تفسيره عن شريك ، عن أبي إسحاق ، عن عمرو بن ميمون ( لن تنالوا البر ) قال : البر الجنة ] وقال الإمام أحمد : حدثنا روح ، حدثنا مالك ، عن إسحاق بن عبد الله بن أبي طلحة ، سمع أنس بن مالك يقول : كان أبو طلحة أكثر أنصاري بالمدينة مالا وكان أحب أمواله إليه بيرحاء - وكانت مستقبلة المسجد ، وكان النبي صلى الله عليه وسلم يدخلها ويشرب من ماء فيها طيب - قال أنس : فلما نزلت : ( لن تنالوا البر حتى تنفقوا مما تحبون ) قال أبو طلحة : يا رسول الله ، إن الله يقول : ( لن تنالوا البر حتى تنفقوا مما تحبون ) وإن أحب أموالي إلي بيرحاء وإنها صدقة لله أرجو برها وذخرها عند الله تعالى ، فضعها يا رسول الله حيث أراك الله [ تعالى ] فقال النبي صلى الله عليه وسلم : \" بخ ، ذاك مال رابح ، ذاك مال رابح ، وقد سمعت ، وأنا أرى أن تجعلها في الأقربين \" . فقال أبو طلحة : أفعل يا رسول الله . فقسمها أبو طلحة في أقاربه وبني عمه . أخرجاه .\nوفي الصحيحين أن عمر [ رضي الله عنه ] قال : يا رسول الله ، لم أصب مالا قط هو أنفس عندي من سهمي الذي هو بخيبر ، فما تأمرني به ؟ قال حبس الأصل وسبل الثمرة \" .\nوقال الحافظ أبو بكر البزار : حدثنا أبو الخطاب زياد بن يحيى الحساني ، حدثنا يزيد بن هارون ، حدثنا محمد بن عمرو ، عن أبي عمرو بن حماس عن حمزة بن عبد الله بن عمر ، قال : قال عبد الله : حضرتني هذه الآية : ( لن تنالوا البر حتى تنفقوا مما تحبون ) فذكرت ما أعطاني الله ، فلم أجد شيئا أحب إلي من جارية رومية ، فقلت ، هي حرة لوجه الله . فلو أني أعود في شيء جعلته لله لنكحتها ، يعني تزوجتها .\n                                    ",
        "qortoby": "لَن تَنَالُواْ ٱلۡبِرَّ حَتَّىٰ تُنفِقُواْ مِمَّا تُحِبُّونَۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ ٢٩\n                                    \n                                    \n                                    قوله تعالى : لن تنالوا البر حتى تنفقوا مما تحبون وما تنفقوا من شيء فإن الله به عليم\nفيه مسألتان :\nالأولى : روى الأئمة واللفظ للنسائي عن أنس قال : لما نزلت هذه الآية : لن تنالوا البر حتى تنفقوا مما تحبون قال أبو طلحة : إن ربنا ليسألنا من أموالنا فأشهدك يا رسول الله أني جعلت أرضي لله . فقال رسول الله - صلى الله عليه وسلم - : اجعلها في قرابتك في حسان بن ثابت وأبي بن كعب . وفي الموطأ وكانت أحب أمواله إليه بئر حاء ، وكانت مستقبلة المسجد ، وكان رسول الله - صلى الله عليه وسلم - يدخلها ويشرب من ماء فيها طيب . وذكر الحديث . ففي هذه الآية دليل على استعمال ظاهر الخطاب وعمومه ; فإن الصحابة رضوان الله عليهم أجمعين لم يفهموا من فحوى الخطاب حين نزلت الآية غير ذلك . ألا ترى أبا طلحة حين سمع لن تنالوا البر حتى تنفقوا الآية ، لم يحتج أن يقف حتى يرد البيان الذي يريد الله أن ينفق منه عباده بآية أخرى أو سنة مبينة لذلك فإنهم يحبون أشياء كثيرة . وكذلك فعل زيد بن حارثة ، عمد مما يحب إلى فرس يقال له ( سبل ) وقال : اللهم إنك تعلم أنه ليس لي مال أحب إلي من فرسي هذه ; فجاء بها إلى النبي - صلى الله عليه وسلم - فقال : هذا في سبيل الله . فقال لأسامة بن زيد ( اقبضه ) . فكأن زيدا وجد من ذلك في نفسه . فقال رسول الله - صلى الله عليه وسلم - : ( إن الله قد قبلها منك ) . ذكره أسد بن موسى . وأعتق ابن عمر نافعا مولاه ، وكان أعطاه فيه عبد الله بن جعفر ألف دينار . قالت صفية بنت أبي عبيدة : أظنه تأول قول الله عز وجل : لن تنالوا البر حتى تنفقوا مما تحبون . وروى شبل عن أبي نجيح عن مجاهد قال : كتب عمر بن الخطاب إلى أبي موسى الأشعري أن يبتاع له جارية من سبي جلولاء يوم فتح مدائن كسرى ; فقال سعد بن أبي وقاص : فدعا بها عمر فأعجبته ، فقال إن الله عز وجل يقول : لن تنالوا البر حتى تنفقوا مما تحبون فأعتقها عمر - رضي الله عنه - . وروي عن الثوري أنه بلغه أن أم ولد الربيع بن خيثم قالت : كان إذا جاءه السائل يقول لي : يا فلانة أعطي السائل سكرا ، فإن الربيع يحب السكر . قال سفيان : يتأول قوله جل وعز : لن تنالوا البر حتى تنفقوا مما تحبون . وروي عن عمر بن عبد العزيز أنه كان يشتري أعدالا من سكر ويتصدق بها . فقيل له : هلا تصدقت بقيمتها ؟ فقال : لأن السكر أحب إلي فأردت أن أنفق مما أحب . وقال الحسن : إنكم لن تنالوا ما تحبون إلا بترك ما تشتهون ، ولا تدركوا ما تأملون إلا بالصبر على ما تكرهون .\nالثانية : واختلفوا في تأويل البر فقيل الجنة ; عن ابن مسعود وابن عباس وعطاء ومجاهد وعمرو بن ميمون والسدي . والتقدير لن تنالوا ثواب البر حتى تنفقوا مما تحبون . والنوال العطاء ، من قولك نولته تنويلا أعطيته . ونالني من فلان معروف ينالني ، أو وصل إلي . فالمعنى لن تصلوا إلى الجنة وتعطوها حتى تنفقوا مما تحبون . وقيل : البر العمل الصالح . وفي الحديث الصحيح : عليكم بالصدق فإنه يهدي إلى البر وإن البر يهدي إلى الجنة . وقد مضى في البقرة . قال عطية العوفي : يعني الطاعة . عطاء : لن تنالوا شرف الدين والتقوى حتى تتصدقوا وأنتم أصحاء أشحاء تأملون العيش وتخشون الفقر . وعن الحسن حتى تنفقوا هي الزكاة المفروضة . مجاهد والكلبي : هي منسوخة ، نسختها آية الزكاة . وقيل : المعنى حتى تنفقوا مما تحبون في سبيل الخير من صدقة أو غيرها من الطاعات ، وهذا جامع . وروى النسائي عن صعصعة بن معاوية قال : لقيت أبا ذر قال : قلت : حدثني قال : نعم . قال رسول الله - صلى الله عليه وسلم - : ما من عبد مسلم ينفق من كل ماله زوجين في سبيل الله إلا استقبلته حجبة الجنة كلهم يدعوه إلى ما عنده . قلت : وكيف ذلك ؟ قال : إن كانت إبلا فبعيرين ، وإن كانت بقرا فبقرتين . وقال أبو بكر الوراق : دلهم بهذه الآية على الفتوة . أي لن تنالوا بري بكم إلا ببركم بإخوانكم والإنفاق عليهم من أموالكم وجاهكم ; فإذا فعلتم ذلك نالكم بري وعطفي . قال مجاهد : وهو مثل قوله : ويطعمون الطعام على حبه مسكينا . وما تنفقوا من شيء فإن الله به عليم أي وإذا علم جازى عليه .\n                                    ",
        "saadi": "لَن تَنَالُواْ ٱلۡبِرَّ حَتَّىٰ تُنفِقُواْ مِمَّا تُحِبُّونَۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ ٢٩\n                                        \n                                        \n                                        \n                                        هذا حث من الله لعباده على الإنفاق في طرق الخيرات، فقال { لن تنالوا } أي: تدركوا وتبلغوا البر الذي هو كل خير من أنواع الطاعات وأنواع المثوبات الموصل لصاحبه إلى الجنة، { حتى تنفقوا مما تحبون } أي: من أموالكم النفيسة التي تحبها نفوسكم، فإنكم إذا قدمتم محبة الله على محبة الأموال فبذلتموها في مرضاته، دل ذلك على إيمانكم الصادق وبر قلوبكم ويقين تقواكم، فيدخل في ذلك إنفاق نفائس الأموال، والإنفاق في حال حاجة المنفق إلى ما أنفقه، والإنفاق في حال الصحة، ودلت الآية أن العبد بحسب إنفاقه للمحبوبات يكون بره، وأنه ينقص من بره بحسب ما نقص من ذلك، ولما كان الإنفاق على أي: وجه كان مثابا عليه العبد، سواء كان قليلا أو كثيرا، محبوبا للنفس أم لا، وكان قوله { لن تنالوا البر حتى تنفقوا مما تحبون } مما يوهم أن إنفاق غير هذا المقيد غير نافع، احترز تعالى عن هذا الوهم بقوله { وما تنفقوا من شيء فإن الله به عليم } فلا يضيق عليكم، بل يثيبكم عليه على حسب نياتكم ونفعه.\n                                    "
      },
      "originalText": "لَن تَنَالُواْ ٱلۡبِرَّ حَتَّىٰ تُنفِقُواْ مِمَّا تُحِبُّونَۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ ٢٩"
    },
    {
      "number": 386,
      "text": "۞ كُلُّ الطَّعَامِ كَانَ حِلًّا لِبَنِي إِسْرَائِيلَ إِلَّا مَا حَرَّمَ إِسْرَائِيلُ عَلَىٰ نَفْسِهِ مِنْ قَبْلِ أَنْ تُنَزَّلَ التَّوْرَاةُ ۗ قُلْ فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِنْ كُنْتُمْ صَادِقِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 93,
      "juz": 4,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 25,
      "sajda": false,
      "tafsier": {
        "ibnkther": "كُلُّ ٱلطَّعَامِ كَانَ حِلّٗا لِّبَنِيٓ إِسۡرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسۡرَٰٓءِيلُ عَلَىٰ نَفۡسِهِۦ مِن قَبۡلِ أَن تُنَزَّلَ ٱلتَّوۡرَىٰةُۚ قُلۡ فَأۡتُواْ بِٱلتَّوۡرَىٰةِ فَٱتۡلُوهَآ إِن كُنتُمۡ صَٰدِقِينَ ٣٩\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا هاشم بن القاسم ، حدثنا عبد الحميد ، حدثنا شهر قال : قال ابن عباس [ رضي الله عنه ] حضرت عصابة من اليهود نبي الله صلى الله عليه وسلم فقالوا : حدثنا عن خلال نسألك عنهن لا يعلمهن إلا نبي . قال : \" سلوني عما شئتم ، ولكن اجعلوا لي ذمة الله ، وما أخذ يعقوب على بنيه لئن أنا حدثتكم شيئا فعرفتموه لتتابعني على الإسلام \" . قالوا : فذلك لك . قال : \" فسلوني عما شئتم \" قالوا : أخبرنا عن أربع خلال : أخبرنا أي الطعام حرم إسرائيل على نفسه ؟ وكيف ماء المرأة وماء الرجل ؟ كيف هذا النبي الأمي في النوم ؟ ومن وليه من الملائكة ؟ فأخذ عليهم العهد لئن أخبرهم ليتابعنه وقال : \" أنشدكم بالذي أنزل التوراة على موسى : هل تعلمون أن إسرائيل مرض مرضا شديدا وطال سقمه ، فنذر لله نذرا لئن شفاه الله من سقمه ليحرمن أحب الشراب إليه وأحب الطعام إليه ، وكان أحب الطعام إليه لحمان الإبل ، وأحب الشراب إليه ألبانها \" فقالوا : اللهم نعم . قال : \" اللهم اشهد عليهم \" . وقال : أنشدكم بالله الذي لا إله إلا هو ، الذي أنزل التوراة على موسى : هل تعلمون أن ماء الرجل أبيض غليظ ، وماء المرأة أصفر رقيق ، فأيهما علا كان له الولد والشبه بإذن الله ، إن علا ماء الرجل ماء المرأة كان ذكرا بإذن الله وإن علا ماء المرأة ماء الرجل كان أنثى بإذن الله \" . قالوا : نعم . قال : \" اللهم اشهد عليهم \" . وقال : \" أنشدكم بالذي أنزل التوراة على موسى : هل تعلمون أن هذا النبي الأمي تنام عيناه ولا ينام قلبه \" . قالوا : اللهم نعم . قال : \" اللهم اشهد \" . قالوا : وأنت الآن فحدثنا من وليك من الملائكة ؟ فعندها نجامعك أو نفارقك قال : \" إن وليي جبريل ، ولم يبعث الله نبيا قط إلا وهو وليه \" . قالوا : فعندها نفارقك ، ولو كان وليك غيره لتابعناك ، فعند ذلك قال الله تعالى : ( قل من كان عدوا لجبريل ) الآية [ البقرة : 97 ] .\nورواه أحمد أيضا ، عن حسين بن محمد ، عن عبد الحميد ، به .\nطريق أخرى : قال أحمد : حدثنا أبو أحمد الزبيري حدثنا عبد الله بن الوليد العجلي ، عن بكير بن شهاب ، عن سعيد بن جبير ، عن ابن عباس قال : أقبلت يهود على رسول الله صلى الله عليه وسلم ، فقالوا : يا أبا القاسم ، نسألك عن خمسة أشياء ، فإن أنبأتنا بهن عرفنا أنك نبي واتبعناك ، فأخذ عليهم ما أخذ إسرائيل على بنيه إذ قال : ( الله على ما نقول وكيل ) [ يوسف : 66 ] . قال : \" هاتوا \" . قالوا : أخبرنا عن علامة النبي ؟ قال : \" تنام عيناه ولا ينام قلبه \" . قالوا : أخبرنا كيف تؤنث المرأة وكيف تذكر ؟ قال : \" يلتقي الماءان ، فإذا علا ماء الرجل ماء المرأة أذكرت ، وإذا علا ماء المرأة آنثت . قالوا : أخبرنا ما حرم إسرائيل على نفسه ، قال : \" كان يشتكي عرق النسا ، فلم يجد شيئا يلائمه إلا ألبان كذا وكذا - قال أحمد : قال بعضهم : يعني الإبل - فحرم لحومها \" . قالوا : صدقت . قالوا : أخبرنا ما هذا الرعد ؟ قال : \" ملك من ملائكة الله موكل بالسحاب بيده - أو في يده - مخراق من نار يزجر به السحاب ، يسوقه حيث أمره الله عز وجل \" . قالوا : فما هذا الصوت الذي يسمع ؟ قال : \" صوته \" . قالوا : صدقت ، إنما بقيت واحدة ، وهي التي نتابعك إن أخبرتنا بها ، فإنه ليس من نبي إلا له ملك يأتيه بالخبر ، فأخبرنا من صاحبك ؟ قال : \" جبريل عليه السلام \" . قالوا : جبريل ذاك ينزل بالحرب والقتال والعذاب عدونا . لو قلت : ميكائيل الذي ينزل بالرحمة والنبات والقطر لكان ، فأنزل الله عز وجل : ( قل من كان عدوا لجبريل فإنه نزله على قلبك بإذن الله مصدقا لما بين يديه وهدى وبشرى للمؤمنين ) [ البقرة : 97 ] .\nوقد رواه الترمذي ، والنسائي ، من حديث عبد الله بن الوليد العجلي ، به نحوه ، وقال الترمذي : حسن غريب .\nوقال ابن جريج والعوفي ، عن ابن عباس : كان إسرائيل - وهو يعقوب عليه السلام - يعتريه عرق النسا بالليل ، وكان يقلقه ويزعجه عن النوم ، ويقلع الوجع عنه بالنهار ، فنذر لله لئن عافاه الله لا يأكل عرقا ولا يأكل ولد له عرقا .\nوهكذا قال الضحاك والسدي . كذا حكاه ورواه ابن جرير في تفسيره . قال : فاتبعه بنوه في تحريم ذلك استنانا به واقتداء بطريقه . قال : وقوله : ( من قبل أن تنزل التوراة ) أي : حرم ذلك على نفسه من قبل أن تنزل التوراة .\nقلت : ولهذا السياق بعد ما تقدم مناسبتان .\nإحداهما : أن إسرائيل ، عليه السلام ، حرم أحب الأشياء إليه وتركها لله ، وكان هذا سائغا في شريعتهم فله مناسبة بعد قوله : (لن تنالوا البر حتى تنفقوا مما تحبون ) فهذا هو المشروع عندنا وهو الإنفاق في طاعة الله مما يحبه العبد ويشتهيه ، كما قال : ( وآتى المال على حبه ) [ البقرة : 177 ] وقال ( ويطعمون الطعام على حبه ) [ الإنسان : 8 ] .\nالمناسبة الثانية : لما تقدم السياق في الرد على النصارى ، واعتقادهم الباطل في المسيح وتبين زيف ما ذهبوا إليه . وظهور الحق واليقين في أمر عيسى وأمه ، وكيف خلقه الله بقدرته ومشيئته ، وبعثه إلى بني إسرائيل يدعو إلى عبادة ربه تعالى - شرع في الرد على اليهود ، قبحهم الله ، وبيان أن النسخ الذي أنكروا وقوعه وجوازه قد وقع ، فإن الله ، عز وجل ، قد نص في كتابهم التوراة أن نوحا ، عليه السلام ، لما خرج من السفينة أباح الله له جميع دواب الأرض يأكل منها ، ثم بعد هذا حرم إسرائيل على نفسه لحمان الإبل وألبانها ، فاتبعه بنوه في ذلك ، وجاءت التوراة بتحريم ذلك ، وأشياء أخر زيادة على ذلك . وكان الله ، عز وجل ، قد أذن لآدم في تزويج بناته من بنيه ، وقد حرم ذلك بعد ذلك . وكان التسري على الزوجة مباحا في شريعة إبراهيم ، وقد فعله [ الخليل ] إبراهيم في هاجر لما تسرى بها على سارة ، وقد حرم مثل هذا في التوراة عليهم . وكذلك كان الجمع بين الأختين شائعا وقد فعله يعقوب ، عليه السلام ، جمع بين الأختين ، ثم حرم ذلك عليهم في التوراة . وهذا كله منصوص عليه في التوراة عندهم ، فهذا هو النسخ بعينه ، فكذلك فليكن ما شرعه الله للمسيح ، عليه السلام ، في إحلاله بعض ما حرم في التوراة ، فما بالهم لم يتبعوه ؟ بل كذبوه وخالفوه ؟ وكذلك ما بعث الله به محمدا صلى الله عليه وسلم من الدين القويم ، والصراط المستقيم ، وملة أبيه إبراهيم فما بالهم لا يؤمنون ؟ ولهذا قال [ تعالى ] ( كل الطعام كان حلا لبني إسرائيل إلا ما حرم إسرائيل على نفسه من قبل أن تنزل التوراة ) أي : كان حلا لهم جميع الأطعمة قبل نزول التوراة إلا ما حرمه إسرائيل ، ثم قال : ( قل فأتوا بالتوراة فاتلوها إن كنتم صادقين ) ، فإنها ناطقة بما قلناه\n                                    ",
        "qortoby": "كُلُّ ٱلطَّعَامِ كَانَ حِلّٗا لِّبَنِيٓ إِسۡرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسۡرَٰٓءِيلُ عَلَىٰ نَفۡسِهِۦ مِن قَبۡلِ أَن تُنَزَّلَ ٱلتَّوۡرَىٰةُۚ قُلۡ فَأۡتُواْ بِٱلتَّوۡرَىٰةِ فَٱتۡلُوهَآ إِن كُنتُمۡ صَٰدِقِينَ ٣٩\n                                    \n                                    \n                                    قوله تعالى : كل الطعام كان حلا لبني إسرائيل إلا ما حرم إسرائيل على نفسه من قبل أن تنزل التوراة قل فأتوا بالتوراة فاتلوها إن كنتم صادقين\nفيه مسائل :\nالأولى : حلا أي حلالا ، ثم استثنى فقال : إلا ما حرم إسرائيل على نفسه وهو يعقوب عليه السلام . في الترمذي عن ابن عباس أن اليهود قالوا للنبي - صلى الله عليه وسلم - : أخبرنا ، ما حرم إسرائيل على نفسه ؟ قال : ( كان يسكن البدو فاشتكى عرق النسا فلم يجد شيئا يلائمه إلا لحوم الإبل وألبانها فلذلك حرمها ) . قالوا : صدقت . وذكر الحديث . ويقال : إنه نذر إن برأ منه ليتركن أحب الطعام والشراب إليه ، وكان أحب الطعام والشراب إليه لحوم الإبل وألبانها . وقال ابن عباس ومجاهد وقتادة والسدي : أقبل يعقوب عليه السلام من حران يريد بيت المقدس حين هرب من أخيه عيصو ، وكان رجلا بطشا قويا ، فلقيه ملك فظن يعقوب أنه لص فعالجه أن يصرعه ، فغمز الملك فخذ يعقوب عليه السلام ، ثم صعد الملك إلى السماء ويعقوب ينظر إليه فهاج عليه عرق النسا ، ولقي من ذلك بلاء شديدا ، فكان لا ينام الليل من الوجع ويبيت وله زقاء أي صياح ، فحلف يعقوب عليه السلام إن شفاه الله جل وعز ألا يأكل عرقا ، ولا يأكل طعاما فيه عرق فحرمها على نفسه ; فجعل بنوه يتبعون بعد ذلك العروق فيخرجونها من اللحم . وكان سبب غمز الملك ليعقوب أنه كان نذر إن وهب الله له اثني عشر ولدا وأتى بيت المقدس صحيحا أن يذبح آخرهم . فكان ذلك للمخرج من نذره ; عن الضحاك .\nالثانية : واختلف هل كان التحريم من يعقوب باجتهاد منه أو بإذن من الله تعالى ؟ والصحيح الأول ; لأن الله تعالى أضاف التحريم إليه بقوله تعالى : إلا ما حرم وأن النبي إذا أداه اجتهاده إلى شيء كان دينا يلزمنا اتباعه لتقرير الله سبحانه إياه على ذلك . وكما يوحى إليه ويلزم اتباعه ، كذلك يؤذن له ويجتهد ، ويتعين موجب اجتهاده إذا قدر عليه ، ولولا تقدم الإذن له في تحريم ذلك ما تسور على التحليل والتحريم . وقد حرم نبينا - صلى الله عليه وسلم - العسل على الرواية الصحيحة ، أو خادمه مارية فلم يقر الله تحريمه ونزل : لم تحرم ما أحل الله لك على ما يأتي بيانه في ( التحريم ) . قال الكيا الطبري : فيمكن أن يقال : مطلق قوله تعالى : لم تحرم ما أحل الله يقتضي ألا يختص بمارية ; وقد رأى الشافعي أن وجوب الكفارة في ذلك غير معقول المعنى ، فجعلها مخصوصا بموضع النص ، وأبو حنيفة رأى ذلك أصلا في تحريم كل مباح وأجراه مجرى اليمين .\nالثالثة : قوله تعالى : قل فأتوا بالتوراة فاتلوها إن كنتم صادقين قال ابن عباس : لما أصاب يعقوب عليه السلام عرق النسا وصف الأطباء له أن يجتنب لحوم الإبل فحرمها على نفسه . فقالت اليهود : إنما نحرم على أنفسنا لحوم الإبل ; لأن يعقوب حرمها وأنزل الله تحريمها في التوراة ; فأنزل الله هذه الآية . قال الضحاك : فكذبهم الله ورد عليهم فقال : يا محمد قل فأتوا بالتوراة فاتلوها إن كنتم صادقين فلم يأتوا .\n                                    ",
        "saadi": "كُلُّ ٱلطَّعَامِ كَانَ حِلّٗا لِّبَنِيٓ إِسۡرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسۡرَٰٓءِيلُ عَلَىٰ نَفۡسِهِۦ مِن قَبۡلِ أَن تُنَزَّلَ ٱلتَّوۡرَىٰةُۚ قُلۡ فَأۡتُواْ بِٱلتَّوۡرَىٰةِ فَٱتۡلُوهَآ إِن كُنتُمۡ صَٰدِقِينَ ٣٩\n                                        \n                                        \n                                        \n                                        وهذا رد على اليهود بزعمهم الباطل أن النسخ غير جائز، فكفروا بعيسى ومحمد صلى الله عليهما وسلم، لأنهما قد أتيا بما يخالف بعض أحكام التوراة بالتحليل والتحريم فمن تمام الإنصاف في المجادلة إلزامهم بما في كتابهم التوراة من أن جميع أنواع الأطعمة محللة لبني إسرائيل { إلا ما حرم إسرائيل } وهو يعقوب عليه السلام { على نفسه } أي: من غير تحريم من الله تعالى، بل حرمه على نفسه لما أصابه عرق النسا نذر لئن شفاه الله تعالى ليحرمن أحب الأطعمة عليه، فحرم فيما يذكرون لحوم الإبل وألبانها وتبعه بنوه على ذلك وكان ذلك قبل نزول التوراة، ثم نزل في التوراة أشياء من المحرمات غير ما حرم إسرائيل مما كان حلالا لهم طيبا، كما قال تعالى { فبظلم من الذين هادوا حرمنا عليهم طيبات أحلت لهم } وأمر الله رسوله إن أنكروا ذلك أن يأمرهم بإحضار التوراة، فاستمروا بعد هذا على الظلم والعناد\n                                    "
      },
      "originalText": "۞ كُلُّ ٱلطَّعَامِ كَانَ حِلّٗا لِّبَنِيٓ إِسۡرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسۡرَٰٓءِيلُ عَلَىٰ نَفۡسِهِۦ مِن قَبۡلِ أَن تُنَزَّلَ ٱلتَّوۡرَىٰةُۚ قُلۡ فَأۡتُواْ بِٱلتَّوۡرَىٰةِ فَٱتۡلُوهَآ إِن كُنتُمۡ صَٰدِقِينَ ٣٩"
    },
    {
      "number": 387,
      "text": "فَمَنِ افْتَرَىٰ عَلَى اللَّهِ الْكَذِبَ مِنْ بَعْدِ ذَٰلِكَ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 94,
      "juz": 4,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 25,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَمَنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ ٱلۡكَذِبَ مِنۢ بَعۡدِ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٤٩\n                                    \n                                    \n                                    ( فمن افترى على الله الكذب من بعد ذلك فأولئك هم الظالمون ) أي : فمن كذب على الله وادعى أنه شرع لهم السبت والتمسك بالتوراة دائما ، وأنه لم يبعث نبيا آخر يدعو إلى الله بالبراهين والحجج بعد هذا الذي بيناه من وقوع النسخ وظهور ما ذكرناه ( فأولئك هم الظالمون ) .\n                                    ",
        "qortoby": "فَمَنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ ٱلۡكَذِبَ مِنۢ بَعۡدِ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٤٩\n                                    \n                                    \n                                    فقال عز وجل : فمن افترى على الله الكذب من بعد ذلك فأولئك هم الظالمون قال الزجاج : في هذه الآية أعظم دلالة لنبوة محمد نبينا - صلى الله عليه وسلم - ، أخبرهم أنه ليس في كتابهم ، وأمرهم أن يأتوا بالتوراة فأبوا ; يعني عرفوا أنه قال ذلك بالوحي . وقال عطية العوفي : إنما كان ذلك حراما عليهم بتحريم يعقوب ذلك عليهم . وذلك أن إسرائيل قال حين أصابه عرق النسا : والله لئن عافاني الله منه لا يأكله لي ولد ; ولم يكن ذلك محرما عليهم . وقال الكلبي : لم يحرمه الله عز وجل في التوراة عليهم وإنما حرمه بعد التوراة بظلمهم وكفرهم ، وكانت بنو إسرائيل إذا أصابوا ذنبا عظيما حرم الله تعالى عليهم طعاما طيبا ، أو صب عليهم رجزا وهو الموت ; فذلك قوله تعالى : فبظلم من الذين هادوا حرمنا عليهم طيبات أحلت لهم الآية . وقوله : وعلى الذين هادوا حرمنا كل ذي ظفر الآية - إلى قوله : ذلك جزيناهم ببغيهم وإنا لصادقون .\nالرابعة : ترجم ابن ماجه في سننه \" دواء عرق النسا \" حدثنا هشام بن عمار وراشد بن سعيد الرملي قالا حدثنا الوليد بن مسلم حدثنا هشام بن حسان حدثنا أنس بن سيرين أنه سمع أنس بن مالك يقول : سمعت رسول الله - صلى الله عليه وسلم - يقول : شفاء عرق النسا ألية شاة أعرابية تذاب ثم تجزأ ثلاثة أجزاء ثم يشرب على الريق في كل يوم جزء . وأخرجه الثعلبي في تفسيره أيضا من حديث أنس بن مالك قال : قال رسول الله - صلى الله عليه وسلم - في عرق النسا : تؤخذ ألية كبش عربي لا صغير ولا كبير فتقطع صغارا فتخرج إهالته فتنقسم ثلاثة أقسام في كل يوم على ريق النفس ثلثا قال أنس : فوصفته لأكثر من مائة فبرأ بإذن الله تعالى . شعبة : حدثني شيخ في زمن الحجاج بن يوسف في عرق النسا : أقسم لك بالله الأعلى لئن لم تنته لأكوينك بنار أو لأحلقنك بموسى . قال شعبة : قد جربته ، تقوله ، وتمسح على ذلك الموضع .\n                                    ",
        "saadi": "فَمَنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ ٱلۡكَذِبَ مِنۢ بَعۡدِ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٤٩\n                                        \n                                        \n                                        \n                                        { فمن افترى على الله الكذب من بعد ذلك فأولئك هم الظالمون } وأي: ظلم أعظم من ظلم من يدعى إلى تحكيم كتابه فيمتنع من ذلك عنادا وتكبرا وتجبرا، وهذا من أعظم الأدلة على صحة نبوة نبينا محمد صلى الله عليه وسلم وقيام الآيات البينات المتنوعات على صدقه وصدق من نبأه وأخبره بما أخبره به من الأمور التي لا يعلمها إلا بإخبار ربه له بها\n                                    "
      },
      "originalText": "فَمَنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ ٱلۡكَذِبَ مِنۢ بَعۡدِ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ ٤٩"
    },
    {
      "number": 388,
      "text": "قُلْ صَدَقَ اللَّهُ ۗ فَاتَّبِعُوا مِلَّةَ إِبْرَاهِيمَ حَنِيفًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 95,
      "juz": 4,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 25,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ صَدَقَ ٱللَّهُۗ فَٱتَّبِعُواْ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٥٩\n                                    \n                                    \n                                    قال تعالى : ( قل صدق الله ) أي : قل يا محمد : صدق فيما أخبر به وفيما شرعه في القرآن ( فاتبعوا ملة إبراهيم حنيفا وما كان من المشركين ) أي : اتبعوا ملة إبراهيم التي شرعها الله في القرآن على لسان محمد صلى الله عليه وسلم ، فإنه الحق الذي لا شك فيه ولا مرية ، وهي الطريقة التي لم يأت نبي بأكمل منها ولا أبين ولا أوضح ولا أتم ، كما قال تعالى : ( قل إنني هداني ربي إلى صراط مستقيم دينا قيما ملة إبراهيم حنيفا وما كان من المشركين ) [ الأنعام : 161 ] وقال تعالى : ( ثم أوحينا إليك أن اتبع ملة إبراهيم حنيفا وما كان من المشركين ) [ النحل : 123 ] .\n                                    ",
        "qortoby": "قُلۡ صَدَقَ ٱللَّهُۗ فَٱتَّبِعُواْ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٥٩\n                                    \n                                    \n                                    قوله تعالى : قل صدق الله فاتبعوا ملة إبراهيم حنيفا وما كان من المشركين\nأي قل يا محمد صدق الله . إنه لم يكن ذلك في التوراة محرما . فاتبعوا ملة إبراهيم حنيفا أمر باتباع دينه . وما كان من المشركين رد عليهم في دعواهم الباطل كما تقدم .\n                                    ",
        "saadi": "قُلۡ صَدَقَ ٱللَّهُۗ فَٱتَّبِعُواْ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٥٩\n                                        \n                                        \n                                        \n                                        { قل صدق الله } أي: فيما أخبر به وحكم، وهذا أمر من الله لرسوله ولمن يتبعه أن يقولوا بألسنتهم: صدق الله، معتقدين بذلك في قلوبهم عن أدلة يقينية، مقيمين هذه الشهادة على من أنكرها، ومن هنا تعلم أن أعظم الناس تصديقا لله أعظمهم علما ويقينا بالأدلة التفصيلية السمعية والعقلية، ثم أمرهم باتباع ملة أبيهم إبراهيم عليه السلام بالتوحيد وترك الشرك الذي هو مدار السعادة، وبتركه حصول الشقاوة، وفي هذا دليل على أن اليهود وغيرهم ممن ليس على ملة إبراهيم مشركون غير موحدين، ولما أمرهم باتباع ملة إبراهيم في التوحيد وترك الشرك أمرهم باتباعه بتعظيم بيته الحرام بالحج وغيره\n                                    "
      },
      "originalText": "قُلۡ صَدَقَ ٱللَّهُۗ فَٱتَّبِعُواْ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ ٥٩"
    },
    {
      "number": 389,
      "text": "إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبَارَكًا وَهُدًى لِلْعَالَمِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 96,
      "juz": 4,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 25,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ أَوَّلَ بَيۡتٖ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبَارَكٗا وَهُدٗى لِّلۡعَٰلَمِينَ ٦٩\n                                    \n                                    \n                                    يخبر تعالى أن أول بيت وضع للناس ، أي : لعموم الناس ، لعبادتهم ونسكهم ، يطوفون به ويصلون إليه ويعتكفون عنده ( للذي ببكة ) يعني : الكعبة التي بناها إبراهيم الخليل [ عليه السلام ] الذي يزعم كل من طائفتي النصارى واليهود أنهم على دينه ومنهجه ، ولا يحجون إلى البيت الذي بناه عن أمر الله له في ذلك ونادى الناس إلى حجه . ولهذا قال : ( مباركا ) أي وضع مباركا ( وهدى للعالمين )\nوقد قال الإمام أحمد : حدثنا سفيان ، عن الأعمش ، عن إبراهيم التيمي ، عن أبيه ، عن أبي ذر ، رضي الله عنه ، قال قلت : يا رسول الله ، أي مسجد وضع في الأرض أول ؟ قال : \" المسجد الحرام \" . قلت : ثم أي ؟ قال : \" المسجد الأقصى \" . قلت : كم بينهما ؟ قال : \" أربعون سنة \" . قلت : ثم أي ؟ قال : ثم حيث أدركت الصلاة فصل ، فكلها مسجد \" .\nوأخرجه البخاري ، ومسلم ، من حديث الأعمش ، به .\nوقال ابن أبي حاتم : حدثنا الحسن بن محمد بن الصباح ، حدثنا سعيد بن سليمان ، حدثنا شريك عن مجالد ، عن الشعبي عن علي في قوله تعالى : ( إن أول بيت وضع للناس للذي ببكة مباركا ) قال : كانت البيوت قبلة ، ولكنه كان أول بيت وضع لعبادة الله [ تعالى ] .\n[ قال ] وحدثنا أبي ، حدثنا الحسن بن الربيع ، حدثنا أبو الأحوص ، عن سماك ، عن خالد بن عرعرة قال : قام رجل إلى علي فقال : ألا تحدثني عن البيت : أهو أول بيت وضع في الأرض ؟ قال لا ، ولكنه أول بيت وضع فيه البركة مقام إبراهيم ، ومن دخله كان آمنا . وذكر تمام الخبر في كيفية بناء إبراهيم البيت ، وقد ذكرنا ذلك مستقصى في سورة البقرة فأغنى عن إعادته .\nوزعم السدي أنه أول بيت وضع على وجه الأرض مطلقا . والصحيح قول علي [ رضي الله عنه ] فأما الحديث الذي رواه البيهقي في بناء الكعبة في كتابه دلائل النبوة ، من طريق ابن لهيعة ، عن يزيد بن أبي حبيب ، عن أبي الخير ، عن عبد الله بن عمرو بن العاص مرفوعا : \" بعث الله جبريل إلى آدم وحواء ، فأمرهما ببناء الكعبة ، فبناه آدم ، ثم أمر بالطواف به ، وقيل له : أنت أول الناس ، وهذا أول بيت وضع للناس \" فإنه كما ترى من مفردات ابن لهيعة ، وهو ضعيف . والأشبه ، والله أعلم ، أن يكون هذا موقوفا على عبد الله بن عمرو . ويكون من الزاملتين اللتين أصابهما يوم اليرموك ، من كلام أهل الكتاب .\nوقوله تعالى : ( للذي ببكة ) بكة : من أسماء مكة على المشهور ، قيل سميت بذلك لأنها تبك أعناق الظلمة والجبابرة ، بمعنى : يبكون بها ويخضعون عندها . وقيل : لأن الناس يتباكون فيها ، أي : يزدحمون .\nقال قتادة : إن الله بك به الناس جميعا ، فيصلي النساء أمام الرجال ، ولا يفعل ذلك ببلد غيرها .\nوكذا روي عن مجاهد ، وعكرمة ، وسعيد بن جبير ، وعمرو بن شعيب ، ومقاتل بن حيان .\nوذكر حماد بن سلمة ، عن عطاء بن السائب ، عن سعيد بن جبير ، عن ابن عباس قال : مكة من الفج إلى التنعيم ، وبكة من البيت إلى البطحاء .\nوقال شعبة ، عن المغيرة ، عن إبراهيم : بكة : البيت والمسجد . وكذا قال الزهري .\nوقال عكرمة في رواية ، وميمون بن مهران : البيت وما حوله بكة ، وما وراء ذلك مكة .\nوقال أبو صالح ، وإبراهيم النخعي ، وعطية [ العوفي ] ومقاتل بن حيان : بكة موضع البيت ، وما سوى ذلك مكة .\nوقد ذكروا لمكة أسماء كثيرة : مكة ، وبكة ، والبيت العتيق ، والبيت الحرام ، والبلد الأمين ، والمأمون ، وأم رحم ، وأم القرى ، وصلاح ، والعرش على وزن بدر ، والقادس ، لأنها تطهر من الذنوب ، والمقدسة ، والناسة : بالنون ، وبالباء أيضا ، والحاطمة ، والنساسة ، والرأس ، وكوثى ، والبلدة ، والبنية ، والكعبة .\n                                    ",
        "qortoby": "إِنَّ أَوَّلَ بَيۡتٖ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبَارَكٗا وَهُدٗى لِّلۡعَٰلَمِينَ ٦٩\n                                    \n                                    \n                                    قوله تعالى : إن أول بيت وضع للناس للذي ببكة مباركا وهدى للعالمين\nفيه مسائل :\nالأولى : ثبت في صحيح مسلم عن أبي ذر قال : سألت رسول الله - صلى الله عليه وسلم - عن أول مسجد وضع في الأرض قال : ( المسجد الحرام ) . قلت : ثم أي ؟ قال : ( المسجد الأقصى ) . قلت : كم بينهما ؟ قال : ( أربعون عاما ثم الأرض لك مسجد فحيثما أدركتك الصلاة فصل ) . قال مجاهد وقتادة : لم يوضع قبله بيت . قال علي - رضي الله عنه - : كان قبل البيت بيوت كثيرة ، والمعنى أنه أول بيت وضع للعبادة . وعن مجاهد قال : تفاخر المسلمون واليهود فقالت اليهود : بيت المقدس أفضل وأعظم من الكعبة ; لأنه مهاجر الأنبياء وفي الأرض المقدسة . وقال المسلمون : بل الكعبة أفضل ; فأنزل الله هذه الآية . وقد مضى في البقرة بنيان البيت وأول من بناه . قال مجاهد : خلق الله موضع هذا البيت قبل أن يخلق شيئا من الأرض بألفي سنة ، وأن قواعده لفي الأرض السابعة السفلى . وأما المسجد الأقصى فبناه سليمان عليه السلام ; كما خرجه النسائي بإسناد صحيح من حديث عبد الله بن عمرو . وعن النبي - صلى الله عليه وسلم - : أن سليمان بن داود عليه السلام لما بنى بيت المقدس سأل الله خلالا ثلاثة سأل الله عز وجل حكما يصادف حكمه فأوتيه ، وسأل الله عز وجل ملكا لا ينبغي لأحد من بعده فأوتيه ، وسأل الله عز وجل حين فرغ من بناء المسجد ألا يأتيه أحد لا ينهزه إلا الصلاة فيه أن يخرجه من خطيئته كيوم ولدته أمه فأوتيه . فجاء إشكال بين الحديثين ; لأن بين إبراهيم وسليمان آمادا طويلة . قال أهل التواريخ : أكثر من ألف سنة . فقيل : إن إبراهيم وسليمان عليهما السلام إنما جددا ما كان أسسه غيرهما . وقد روي أن أول من بنى البيت آدم عليه السلام كما تقدم . فيجوز أن يكون غيره من ولده وضع بيت المقدس من بعده بأربعين عاما ، ويجوز أن تكون الملائكة أيضا بنته بعد بنائها البيت بإذن الله ; وكل محتمل ، والله أعلم . وقال علي بن أبي طالب - رضي الله عنه - : أمر الله تعالى الملائكة ببناء بيت في الأرض وأن يطوفوا به ; وكان هذا قبل خلق آدم ، ثم إن آدم بنى منه ما بنى وطاف به ، ثم الأنبياء بعده ، ثم استتم بناءه إبراهيم عليه السلام .\nالثانية : قوله تعالى : للذي ببكة خبر \" إن \" واللام توكيد . و بكة موضع البيت ، ومكة سائر البلد ; عن مالك بن أنس . وقال محمد بن شهاب : بكة المسجد ، ومكة الحرم كله ، تدخل فيه البيوت . قال مجاهد : بكة هي مكة . فالميم على هذا مبدلة من الباء ; كما قالوا : طين لازب ولازم . وقاله الضحاك والمؤرج . ثم قيل : بكة مشتقة من البك وهو الازدحام . تباك القوم ازدحموا . وسميت بكة لازدحام الناس في موضع طوافهم . والبك : دق العنق . وقيل : سميت بذلك لأنها كانت تدق رقاب الجبابرة إذا ألحدوا فيها بظلم . قال عبد الله بن الزبير : لم يقصدها جبار قط بسوء إلا وقصه الله عز وجل . وأما مكة فقيل إنها سميت بذلك لقلة مائها وقيل : سميت بذلك لأنها تمك المخ من العظم مما ينال قاصدها من المشقة ; من قولهم : مككت العظم إذا أخرجت ما فيه . ومك الفصيل ضرع أمه وامتكه إذا امتص كل ما فيه من اللبن وشربه ; قال الشاعر :\nمكت فلم تبق في أجوافها دررا\nوقيل : سميت بذلك لأنها تمك من ظلم فيها ، أي تهلكه وتنقصه . وقيل : سميت بذلك لأن الناس كانوا يمكون ويضحكون فيها ; من قوله : وما كان صلاتهم عند البيت إلا مكاء وتصدية أي تصفيقا وتصفيرا . وهذا لا يوجبه التصريف ; لأن \" مكة \" ثنائي مضاعف و \" مكاء \" ثلاثي معتل .\nالثالثة : قوله تعالى : مباركا جعله مباركا لتضاعف العمل فيه ; فالبركة كثرة الخير ، ونصب على الحال من المضمر في ( وضع ) أو بالظرف من بكة ، المعنى الذي استقر ببكة مباركا ويجوز في غير القرآن ( مبارك ) ; على أن يكون خبرا ثانيا ، أو على البدل من الذي ، أو على إضمار مبتدأ .\nوهدى للعالمين عطف عليه ، ويكون بمعنى وهو هدى للعالمين . ويجوز في غير القرآن \" مبارك \" بالخفض يكون نعتا للبيت .\n                                    ",
        "saadi": "إِنَّ أَوَّلَ بَيۡتٖ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبَارَكٗا وَهُدٗى لِّلۡعَٰلَمِينَ ٦٩\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن شرف هذا البيت الحرام، وأنه أول بيت وضعه الله للناس، يتعبدون فيه لربهم فتغفر أوزارهم، وتقال عثارهم، ويحصل لهم به من الطاعات والقربات ما ينالون به رضى ربهم والفوز بثوابه والنجاة من عقابه، ولهذا قال: { مباركا } أي: فيه البركة الكثيرة في المنافع الدينية والدنيوية كما قال تعالى { ليشهدوا منافع لهم ويذكروا اسم الله على ما رزقهم من بهيمة الأنعام } { وهدى للعالمين } والهدى نوعان: هدى في المعرفة، وهدى في العمل، فالهدى في العمل ظاهر، وهو ما جعل الله فيه من أنواع التعبدات المختصة به، وأما هدى العلم فبما يحصل لهم بسببه من العلم بالحق بسبب الآيات البينات التي ذكر الله تعالى في قوله { فيه آيات بينات }\n                                    "
      },
      "originalText": "إِنَّ أَوَّلَ بَيۡتٖ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبَارَكٗا وَهُدٗى لِّلۡعَٰلَمِينَ ٦٩"
    },
    {
      "number": 390,
      "text": "فِيهِ آيَاتٌ بَيِّنَاتٌ مَقَامُ إِبْرَاهِيمَ ۖ وَمَنْ دَخَلَهُ كَانَ آمِنًا ۗ وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلًا ۚ وَمَنْ كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 97,
      "juz": 4,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 25,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فِيهِ ءَايَٰتُۢ بَيِّنَٰتٞ مَّقَامُ إِبۡرَٰهِيمَۖ وَمَن دَخَلَهُۥ كَانَ ءَامِنٗاۗ وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلۡبَيۡتِ مَنِ ٱسۡتَطَاعَ إِلَيۡهِ سَبِيلٗاۚ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنِ ٱلۡعَٰلَمِينَ ٧٩\n                                    \n                                    \n                                    ( فيه آيات بينات ) أي : دلالات ظاهرة أنه من بناء إبراهيم ، وأن الله تعالى عظمه وشرفه .\nثم قال تعالى : ( مقام إبراهيم ) يعني : الذي لما ارتفع البناء استعان به على رفع القواعد منه والجدران ، حيث كان يقف عليه ويناوله ولده إسماعيل ، وقد كان ملتصقا بجدار البيت ، حتى أخره عمر بن الخطاب ، رضي الله عنه ، في إمارته إلى ناحية الشرق بحيث يتمكن الطواف ، ولا يشوشون على المصلين عنده بعد الطواف ، لأن الله تعالى قد أمرنا بالصلاة عنده حيث قال : ( واتخذوا من مقام إبراهيم مصلى ) [ البقرة : 125 ] وقد قدمنا الأحاديث في ذلك ، فأغنى عن إعادته هاهنا ، ولله الحمد والمنة .\nوقال العوفي عن ابن عباس في قوله : ( فيه آيات بينات مقام إبراهيم ) أي : فمنهن مقام إبراهيم والمشعر .\nوقال مجاهد : أثر قدميه في المقام آية بينة . وكذا روي عن عمر بن عبد العزيز ، والحسن ، وقتادة ، والسدي ، ومقاتل بن حيان ، وغيرهم .\nوقال أبو طالب في قصيدته :\nوموطئ إبراهيم في الصخر رطبة على قدميه حافيا غير ناعل\nوقال ابن أبي حاتم : حدثنا أبو سعيد وعمرو الأودي قالا حدثنا وكيع ، حدثنا سفيان ، عن ابن جريج ، عن عطاء ، عن ابن عباس في قوله : ( مقام إبراهيم ) قال : الحرم كله مقام إبراهيم . ولفظ عمرو : الحجر كله مقام إبراهيم .\nوروي عن سعيد بن جبير أنه قال : الحج مقام إبراهيم . هكذا رأيت في النسخة ، ولعله الحجر كله مقام إبراهيم ، وقد صرح بذلك مجاهد .\nوقوله : ( ومن دخله كان آمنا ) يعني : حرم مكة إذا دخله الخائف يأمن من كل سوء ، وكذلك كان الأمر في حال الجاهلية ، كما قال الحسن البصري وغيره : كان الرجل يقتل فيضع في عنقه صوفة ويدخل الحرم فيلقاه ابن المقتول فلا يهيجه حتى يخرج .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا أبو يحيى التيمي ، عن عطاء ، عن سعيد بن جبير ، عن ابن عباس في قوله : ( ومن دخله كان آمنا ) قال : من عاذ بالبيت أعاذه البيت ، ولكن لا يؤوى ولا يطعم ولا يسقى ، فإذا خرج أخذ بذنبه .\nوقال الله تعالى : ( أولم يروا أنا جعلنا حرما آمنا ويتخطف الناس من حولهم ) [ العنكبوت : 67 ] وقال تعالى : ( فليعبدوا رب هذا البيت الذي أطعمهم من جوع وآمنهم من خوف ) [ قريش : 3 ، 4 ] وحتى إنه من جملة تحريمها حرمة اصطياد صيدها وتنفيره عن أوكاره ، وحرمة قطع أشجارها وقلع حشيشها ، كما ثبتت الأحاديث والآثار في ذلك عن جماعة من الصحابة مرفوعا وموقوفا .\nففي الصحيحين ، واللفظ لمسلم ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم يوم الفتح فتح مكة : \" لا هجرة ولكن جهاد ونية ، وإذا استنفرتم فانفروا \" ، وقال يوم الفتح فتح مكة : \" إن هذا البلد حرمه الله يوم خلق السموات والأرض ، فهو حرام بحرمة الله إلى يوم القيامة ، وإنه لم يحل القتال فيه لأحد قبلي ، ولم يحل لي إلا في ساعة من نهار ، فهو حرام بحرمة الله إلى يوم القيامة ، لا يعضد شوكه ، ولا ينفر صيده ، ولا يلتقط لقطته إلا من عرفها ، ولا يختلى خلاها . فقال العباس : يا رسول الله ، إلا الإذخر ، فإنه لقينهم ولبيوتهم ، فقال : \" إلا الإذخر \" .\nولهما عن أبي هريرة ، مثله أو نحوه ولهما واللفظ لمسلم أيضا عن أبي شريح العدوي أنه قال لعمرو بن سعيد ، وهو يبعث البعوث إلى مكة : ائذن لي أيها الأمير أن أحدثك قولا قام به رسول الله صلى الله عليه وسلم الغد من يوم الفتح سمعته أذناي ووعاه قلبي وأبصرته عيناي حين تكلم به ، إنه حمد الله وأثنى عليه ثم قال : \" إن مكة حرمها الله ولم يحرمها الناس ، فلا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك بها دما ، ولا يعضد بها شجرة ، فإن أحد ترخص بقتال رسول الله صلى الله عليه وسلم فيها فقولوا له : إن الله أذن لرسوله ولم يأذن لكم ، وإنما أذن لي فيها ساعة من نهار ، وقد عادت حرمتها اليوم كحرمتها بالأمس فليبلغ الشاهد الغائب \" فقيل لأبي شريح : ما قال لك عمرو ؟ قال : أنا أعلم بذلك منك يا أبا شريح ، إن الحرم لا يعيذ عاصيا ولا فارا بدم ولا فارا بخزية .\nوعن جابر قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" لا يحل لأحدكم أن يحمل بمكة السلاح \" رواه مسلم .\nوعن عبد الله بن عدي بن الحمراء الزهري أنه سمع رسول الله صلى الله عليه وسلم يقول ، وهو واقف بالحزورة في سوق مكة : \" والله إنك لخير أرض الله ، وأحب أرض الله إلى الله ، ولولا أني أخرجت منك ما خرجت \" .\nرواه الإمام أحمد ، وهذا لفظه ، والترمذي ، والنسائي ، وابن ماجه . وقال الترمذي : حسن صحيح وكذا صحح من حديث ابن عباس نحوه ، وروى أحمد عن أبي هريرة ، نحوه .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا بشر بن آدم ابن بنت أزهر السمان حدثنا أبو عاصم ، عن زريق بن مسلم الأعمى مولى بني مخزوم ، حدثني زياد بن أبي عياش ، عن يحيى بن جعدة بن هبيرة ، في قوله تعالى : ( ومن دخله كان آمنا ) قال : آمنا من النار .\nوفي معنى هذا القول الحديث الذي رواه البيهقي : أخبرنا أبو الحسن علي بن أحمد بن عبدان ، أخبرنا أحمد بن عبيد ، حدثنا محمد بن سليمان الواسطي ، حدثنا سعيد بن سليمان ، حدثنا ابن المؤمل ، عن ابن محيصن ، عن عطاء ، عن عبد الله بن عباس قال : قال رسول الله صلى الله عليه وسلم : \" من دخل البيت دخل في حسنة وخرج من سيئة ، وخرج مغفورا له \" : ثم قال : تفرد به عبد الله بن المؤمل ، وليس بقوي .\nوقوله : ( ولله على الناس حج البيت من استطاع إليه سبيلا ) هذه آية وجوب الحج عند الجمهور . وقيل : بل هي قوله : ( وأتموا الحج والعمرة لله ) [ البقرة : 196 ] والأول أظهر .\nوقد وردت الأحاديث المتعددة بأنه أحد أركان الإسلام ودعائمه وقواعده ، وأجمع المسلمون على ذلك إجماعا ضروريا ، وإنما يجب على المكلف في العمر مرة واحدة بالنص والإجماع .\nقال الإمام أحمد : حدثنا يزيد بن هارون ، أخبرنا الربيع بن مسلم القرشي ، عن محمد بن زياد ، عن أبي هريرة قال : خطبنا رسول الله صلى الله عليه وسلم فقال : \" أيها الناس ، قد فرض عليكم الحج فحجوا \" . فقال رجل : أكل عام يا رسول الله ؟ فسكت ، حتى قالها ثلاثا . فقال رسول الله صلى الله عليه وسلم : \" لو قلت : نعم ، لوجبت ، ولما استطعتم \" . ثم قال : \" ذروني ما تركتكم ، فإنما هلك من كان قبلكم بكثرة سؤالهم واختلافهم على أنبيائهم ، وإذا أمرتكم بشيء فأتوا منه ما استطعتم ، وإذا نهيتكم عن شيء فدعوه \" . ورواه مسلم ، عن زهير بن حرب ، عن يزيد بن هارون ، به نحوه .\nوقد روى سفيان بن حسين ، وسليمان بن كثير ، وعبد الجليل بن حميد ، ومحمد بن أبي حفصة ، عن الزهري ، عن أبي سنان الدؤلي - واسمه يزيد بن أمية - عن ابن عباس قال : خطبنا رسول الله صلى الله عليه وسلم فقال : \" يا أيها الناس ، إن الله كتب عليكم الحج \" . فقام الأقرع بن حابس فقال : يا رسول الله ، أفي كل عام ؟ قال : \" لو قلتها ، لوجبت ، ولو وجبت لم تعملوا بها ، ولم تستطيعوا أن تعملوا بها ، الحج مرة ، فمن زاد فهو تطوع \" .\nرواه أحمد ، وأبو داود ، والنسائي ، وابن ماجه ، والحاكم من حديث الزهري ، به . ورواه شريك ، عن سماك ، عن عكرمة ، عن ابن عباس ، بنحوه . وروي من حديث أسامة يزيد .\n[ و ] قال الإمام أحمد : حدثنا منصور بن وردان ، عن علي بن عبد الأعلى ، عن أبيه ، عن أبي البختري ، عن علي قال : لما نزلت : ( ولله على الناس حج البيت من استطاع إليه سبيلا ) قالوا : يا رسول الله ، في كل عام ؟ فسكت ، قالوا : يا رسول الله ، في كل عام ؟ قال : \" لا ، ولو قلت : نعم ، لوجبت \" . فأنزل الله تعالى : ( يا أيها الذين آمنوا لا تسألوا عن أشياء إن تبد لكم تسؤكم ) [ المائدة : 101 ] .\nوكذا رواه الترمذي ، وابن ماجه ، والحاكم ، من حديث منصور بن وردان ، به : ثم قال الترمذي : حسن غريب . وفيما قال نظر ، لأن البخاري قال : لم يسمع أبو البختري من علي .\nوقال ابن ماجه : حدثنا محمد بن عبد الله بن نمير ، حدثنا محمد بن أبي عبيدة ، عن أبيه ، عن الأعمش ، عن أبي سفيان ، عن أنس بن مالك قال : قالوا : يا رسول الله ، الحج في كل عام ؟ قال : \" لو قلت نعم ، لوجبت ، ولو وجبت لم تقوموا بها ، ولو لم تقوموا بها لعذبتم \" .\nوفي الصحيحين من حديث ابن جريج ، عن عطاء ، عن جابر ، عن سراقة بن مالك قال : يا رسول الله ، متعتنا هذه لعامنا هذا أم للأبد ؟ قال : \" لا ، بل للأبد \" . وفي رواية : \" بل لأبد أبد \" .\nوفي مسند الإمام أحمد ، وسنن أبي داود ، من حديث واقد بن أبي واقد الليثي ، عن أبيه ، أن رسول الله صلى الله عليه وسلم قال لنسائه في حجته : \" هذه ثم ظهور الحصر \" يعني : ثم الزمن ظهور الحصر ، ولا تخرجن من البيوت .\nوأما الاستطاعة فأقسام : تارة يكون الشخص مستطيعا بنفسه ، وتارة بغيره ، كما هو مقرر في كتب الأحكام .\nقال أبو عيسى الترمذي : حدثنا عبد بن حميد ، أخبرنا عبد الرزاق ، أخبرنا إبراهيم بن يزيد قال : سمعت محمد بن عباد بن جعفر يحدث عن ابن عمر قال : قام رجل إلى رسول الله صلى الله عليه وسلم فقال : من الحاج يا رسول الله ؟ قال : \" الشعث التفل \" فقام آخر فقال : أي الحج أفضل يا رسول الله ؟ قال : \" العج والثج \" ، فقام آخر فقال : ما السبيل يا رسول الله ؟ قال : \" الزاد والراحلة \" .\nوهكذا رواه ابن ماجه من حديث إبراهيم بن يزيد وهو الخوزي . قال الترمذي : ولا نعرفه إلا من حديثه ، وقد تكلم فيه بعض أهل العلم من قبل حفظه . كذا قال هاهنا . وقال في كتاب الحج : هذا حديث حسن .\n[ و ] لا يشك أن هذا الإسناد رجاله كلهم ثقات سوى الخوزي هذا ، وقد تكلموا فيه من أجل هذا الحديث .\nلكن قد تابعه غيره ، فقال ابن أبي حاتم : حدثنا أبي ، حدثنا عبد العزيز بن عبد الله العامري ، حدثنا محمد بن عبد الله بن عبيد بن عمير الليثي ، عن محمد بن عباد بن جعفر قال : جلست إلى عبد الله بن عمر قال : جاء رجل إلى رسول الله صلى الله عليه وسلم فقال له : ما السبيل ؟ قال : \" الزاد والراحلة \" . وكذا رواه ابن مردويه من رواية محمد بن عبد الله بن عبيد بن عمير ، به .\nثم قال ابن أبي حاتم : وقد روي عن ابن عباس ، وأنس ، والحسن ، ومجاهد ، وعطاء ، وسعيد بن جبير ، والربيع بن أنس ، وقتادة - نحو ذلك .\nوقد روي هذا الحديث من طرق أخر من حديث أنس ، وعبد الله بن عباس ، وابن مسعود ، وعائشة كلها مرفوعة ، ولكن في أسانيدها مقال كما هو مقرر في كتاب الأحكام ، والله أعلم .\nوقد اعتنى الحافظ أبو بكر بن مردويه بجمع طرق هذا الحديث . ورواه الحاكم من حديث قتادة عن حماد بن سلمة ، عن قتادة ، عن أنس ، أن رسول الله صلى الله عليه وسلم سئل عن قول الله : ( من استطاع إليه سبيلا ) فقيل ما السبيل ؟ قال : \" الزاد والراحلة \" . ثم قال : صحيح على شرط مسلم ، ولم يخرجاه .\nوقال ابن جرير : حدثني يعقوب ، حدثنا ابن علية ، عن يونس ، عن الحسن قال : قرأ رسول الله صلى الله عليه وسلم : ( ولله على الناس حج البيت من استطاع إليه سبيلا ) قالوا : يا رسول الله ، ما السبيل ؟ قال : \" الزاد والراحلة \" .\nورواه وكيع في تفسيره ، عن سفيان ، عن يونس ، به .\nوقال الإمام أحمد : حدثنا عبد الرزاق ، أنبأنا الثوري ، عن إسماعيل - وهو أبو إسرائيل الملائي - عن فضيل - يعني ابن عمرو - عن سعيد بن جبير ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : \" تعجلوا إلى الحج - يعني الفريضة - فإن أحدكم لا يدري ما يعرض له \" .\nوقال أحمد أيضا : حدثنا أبو معاوية ، حدثنا الحسن بن عمرو الفقيمي ، عن مهران بن أبي صفوان عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : \" من أراد الحج فليتعجل \" .\nورواه أبو داود ، عن مسدد ، عن أبي معاوية الضرير ، به .\nوقد روى ابن جبير ، عن ابن عباس في قوله : ( من استطاع إليه سبيلا ) قال : من ملك ثلاثمائة درهم فقد استطاع إليه سبيلا .\nوعن عكرمة مولاه أنه قال : السبيل الصحة .\nوروى وكيع بن الجراح ، عن أبي جناب - يعني الكلبي - عن الضحاك بن مزاحم ، عن ابن عباس قال : ( من استطاع إليه سبيلا ) قال : الزاد والبعير .\nوقوله : ( ومن كفر فإن الله غني عن العالمين ) قال ابن عباس ومجاهد وغير واحد : أي ومن جحد فريضة الحج فقد كفر ، والله غني عنه .\nوقال سعيد بن منصور ، عن سفيان ، عن ابن أبي نجيح ، عن عكرمة قال : لما نزلت : ( ومن يبتغ غير الإسلام دينا فلن يقبل منه ) قالت اليهود : فنحن مسلمون . قال الله ، عز وجل فاخصمهم فحجهم - يعني فقال لهم النبي صلى الله عليه وسلم : \" إن الله فرض على المسلمين حج البيت من استطاع إليه سبيلا \" فقالوا : لم يكتب علينا ، وأبوا أن يحجوا . قال الله : ( ومن كفر فإن الله غني عن العالمين ) .\nوروى ابن أبي نجيح ، عن مجاهد ، نحوه .\nوقال أبو بكر بن مردويه : حدثنا عبد الله بن جعفر ، أخبرنا إسماعيل بن عبد الله بن مسعود ، أخبرنا مسلم بن إبراهيم وشاذ بن فياض قالا أخبرنا هلال أبو هاشم الخراساني ، أخبرنا أبو إسحاق الهمداني ، عن الحارث ، عن علي ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" من ملك زادا وراحلة ولم يحج بيت الله ، فلا يضره مات يهوديا أو نصرانيا ، ذلك بأن الله قال : ( ولله على الناس حج البيت من استطاع إليه سبيلا ومن كفر فإن الله غني عن العالمين ) .\nورواه ابن جرير من حديث مسلم بن إبراهيم ، به .\nوهكذا رواه ابن أبي حاتم عن أبي زرعة الرازي : حدثنا هلال بن فياض ، حدثنا هلال أبو هاشم الخراساني ، فذكره بإسناده مثله . ورواه الترمذي عن محمد بن يحيى القطعي ، عن مسلم بن إبراهيم ، عن هلال بن عبد الله مولى ربيعة بن عمرو بن مسلم الباهلي ، به ، وقال : [ هذا ] حديث غريب لا نعرفه إلا من هذا الوجه ، وفي إسناده مقال ، وهلال مجهول ، والحارث يضعف في الحديث .\nوقال البخاري : هلال هذا منكر الحديث . وقال ابن عدي : هذا الحديث ليس بمحفوظ .\nوقد روى أبو بكر الإسماعيلي الحافظ من حديث [ أبي ] عمرو الأوزاعي ، حدثني إسماعيل بن عبيد الله بن أبي المهاجر ، حدثني عبد الرحمن بن غنم أنه سمع عمر بن الخطاب يقول : من أطاق الحج فلم يحج ، فسواء عليه يهوديا مات أو نصرانيا .\nوهذا إسناد صحيح إلى عمر رضي الله عنه ، وروى سعيد بن منصور في سننه عن الحسن البصري قال : قال عمر بن الخطاب : لقد هممت أن أبعث رجالا إلى هذه الأمصار فينظروا كل من كان له جدة فلم يحج ، فيضربوا عليهم الجزية ، ما هم بمسلمين . ما هم بمسلمين .\n                                    ",
        "qortoby": "فِيهِ ءَايَٰتُۢ بَيِّنَٰتٞ مَّقَامُ إِبۡرَٰهِيمَۖ وَمَن دَخَلَهُۥ كَانَ ءَامِنٗاۗ وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلۡبَيۡتِ مَنِ ٱسۡتَطَاعَ إِلَيۡهِ سَبِيلٗاۚ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنِ ٱلۡعَٰلَمِينَ ٧٩\n                                    \n                                    \n                                    قوله تعالى : فيه آيات بينات رفع بالابتداء أو بالصفة . وقرأ أهل مكة وابن عباس ومجاهد وسعيد بن جبير \" آية بينة \" على التوحيد ، يعني مقام إبراهيم وحده . قالوا : أثر قدميه في المقام آية بينة . وفسر مجاهد مقام إبراهيم بالحرم كله ; فذهب إلى أن من آياته الصفا والمروة والركن والمقام . والباقون بالجمع . أرادوا مقام إبراهيم والحجر الأسود والحطيم وزمزم والمشاعر كلها . قال : أبو جعفر النحاس : من قرأ آيات بينات فقراءته أبين ; لأن الصفا والمروة من الآيات ، ومنها أن الطائر لا يعلو البيت صحيحا ، ومنها أن الجارح يطلب الصيد فإذا دخل الحرم تركه ، ومنها أن الغيث إذا كان ناحية الركن اليماني كان الخصب باليمن ، وإذا كان بناحية الشامي كان الخصب بالشام ، وإذا عم البيت كان الخصب في جميع البلدان ، ومنها أن الجمار على ما يزاد عليها ترى على قدر واحد . والمقام من قولهم : قمت مقاما ، وهو الموضع الذي يقام فيه . والمقام من قولك : أقمت مقاما . وقد مضى هذا في البقرة ، ومضى الخلاف أيضا في المقام والصحيح منه . وارتفع المقام على الابتداء والخبر محذوف ; والتقدير منها مقام إبراهيم ; قاله الأخفش . وحكي عن محمد بن يزيد أنه قال : مقام بدل من آيات . وفيه قول ثالث بمعنى هي مقام إبراهيم . وقول الأخفش معروف في كلام العرب . كما قال زهير :\nلها متاع وأعوان غدون به قتب وغرب إذا ما أفرغ انسحقا\nأي مضى وبعد سيلانه . وقول أبي العباس : إن مقاما بمعنى مقامات ; لأنه مصدر . قال الله تعالى : ختم الله على قلوبهم وعلى سمعهم . وقال الشاعر \" جرير \" :\nإن العيون التي في طرفها حور قتلننا ثم لم يحيين قتلانا\nأي في أطرافها . ويقوي هذا الحديث المروي الحج كله مقام إبراهيم .\nقوله تعالى : ومن دخله كان آمنا قال قتادة : ذلك أيضا من آيات الحرم . قال النحاس : وهو قول حسن ; لأن الناس كانوا يتخطفون من حواليه ، ولا يصل إليه جبار ، وقد وصل إلى بيت المقدس وخرب ، ولم يوصل إلى الحرم . قال الله تعالى : ألم تر كيف فعل ربك بأصحاب الفيل . وقال بعض أهل المعاني : صورة الآية خبر ومعناها أمر ، تقديرها ومن دخله فأمنوه ; كقوله : فلا رفث ولا فسوق ولا جدال في الحج أي لا ترفثوا ولا تفسقوا ولا تجادلوا . ولهذا المعنى قال الإمام السابق النعمان بن ثابت : من اقترف ذنبا واستوجب به حدا ثم لجأ إلى الحرم عصمه ، لقوله تعالى : ومن دخله كان آمنا ; فأوجب الله سبحانه الأمن لمن دخله . وروي ذلك عن جماعة من السلف منهم ابن عباس وغيره من الناس قال ابن العربي : \" وكل من قال هذا فقد وهم من جهتين : إحداهما أنه لم يفهم من الآية أنها خبر عما مضى ، ولم يقصد بها إثبات حكم مستقبل ، الثاني أنه لم يعلم أن ذلك الأمن قد ذهب وأن القتل والقتال قد وقع بعد ذلك فيها ، وخبر الله لا يقع بخلاف مخبره ; فدل ذلك على أنه كان في الماضي هذا . وقد ناقض أبو حنيفة فقال ، إذا لجأ إلى الحرم لا يطعم ولا يسقى ولا يعامل ولا يكلم حتى يخرج ، فاضطراره إلى الخروج ليس يصح معه أمن . وروي عنه أنه قال : يقع القصاص في الأطراف في الحرم ولا أمن أيضا مع هذا . والجمهور من العلماء على أن الحدود تقام في الحرم ، وقد أمر النبي - صلى الله عليه وسلم - بقتل ابن خطل وهو متعلق بأستار الكعبة\nقلت : وروى الثوري عن منصور عن مجاهد عن ابن عباس : من أصاب حدا في الحرم أقيم عليه فيه ، وإن أصابه في الحل ولجأ إلى الحرم لم يكلم ولم يبايع حتى يخرج من الحرم فيقام عليه الحد ; وهو قول الشعبي . فهذه حجة الكوفيين ، وقد فهم ابن عباس ذلك من معنى الآية ، وهو حبر الأمة وعالمها . والصحيح أنه قصد بذلك تعديد النعم على كل من كان بها جاهلا ولها منكرا من العرب ; كما قال تعالى : أولم يروا أنا جعلنا حرما آمنا ويتخطف الناس من حولهم فكانوا في الجاهلية من دخله ولجأ إليه أمن من الغارة والقتل ; على ما يأتي بيانه في \" المائدة \" إن شاء الله تعالى . قال قتادة ومن دخله في الجاهلية كان آمنا . وهذا حسن . وروي أن بعض الملحدة قال لبعض العلماء : أليس في القرآن ومن دخله كان آمنا فقد دخلناه وفعلنا كذا وكذا فلم يأمن من كان فيه قال له : ألست من العرب ما الذي يريد القائل من دخل داري كان آمنا ؟ أليس أن يقول لمن أطاعه : كف عنه فقد أمنته وكففت عنه ؟ قال : بلى . قال : فكذلك قوله ومن دخله كان آمنا . وقال يحيى بن جعدة : معنى ومن دخله كان آمنا يعني من النار .\nقلت : وهذا ليس على عمومه ; لأن في صحيح مسلم عن أبي سعيد الخدري حديث الشفاعة الطويل فوالذي نفسي بيده ما منكم من أحد بأشد مناشدة لله في استقصاء الحق من المؤمنين لله يوم القيامة لإخوانهم الذين في النار يقولون ربنا كانوا يصومون معنا ويحجون فيقال لهم أخرجوا من عرفتم الحديث . وإنما يكون آمنا من النار من دخله لقضاء النسك معظما له عارفا بحقه متقربا إلى الله تعالى . قال جعفر الصادق : من دخله على الصفاء كما دخله الأنبياء والأولياء كان آمنا من عذابه . وهذا معنى قوله عليه السلام : من حج فلم يرفث ولم يفسق خرج من ذنوبه كيوم ولدته أمه و الحج المبرور ليس له جزاء إلا الجنة . قال الحسن : الحج المبرور هو أن يرجع زاهدا في الدنيا راغبا في الآخرة . وأنشد :\nيا كعبة الله دعوة اللاجي دعوة مستشعر ومحتاج\nودع أحبابه ومسكنه فجاء ما بين خائف راجي\nإن يقبل الله سعيه كرما نجا ، وإلا فليس بالناجي\nوأنت ممن ترجى شفاعته فاعطف على وافد بن حجاج\nوقيل : المعنى ومن دخله عام عمرة القضاء مع محمد - صلى الله عليه وسلم - كان آمنا . دليله قوله تعالى : لتدخلن المسجد الحرام إن شاء الله آمنين . وقد قيل : إن \" من \" هاهنا لمن لا يعقل ; والآية في أمان الصيد ; وهو شاذ ; وفي التنزيل : فمنهم من يمشي على بطنه الآية .\nقوله تعالى : ولله على الناس حج البيت من استطاع إليه سبيلا ومن كفر فإن الله غني عن العالمين فيه تسع مسائل :\nالأولى : قوله تعالى : ولله اللام في قوله \" ولله \" لام الإيجاب والإلزام ، ثم أكده بقوله تعالى : على التي هي من أوكد ألفاظ الوجوب عند العرب ; فإذا قال العربي : لفلان علي كذا ; فقد وكده وأوجبه . فذكر الله تعالى الحج بأبلغ ألفاظ الوجوب تأكيدا لحقه وتعظيما لحرمته . ولا خلاف في فريضته ، وهو أحد قواعد الإسلام ، وليس يجب إلا مرة في العمر . وقال بعض الناس : يجب في كل خمسة أعوام مرة ; ورووا في ذلك حديثا أسندوه إلى النبي - صلى الله عليه وسلم - والحديث باطل لا يصح ، والإجماع صاد في وجوههم .\nقلت : وذكر عبد الرزاق قال : حدثنا سفيان الثوري عن العلاء بن المسيب عن أبيه عن أبي سعيد الخدري أن النبي - صلى الله عليه وسلم - قال : يقول الرب جل وعز إن عبدا أوسعت عليه في الرزق فلم يعد إلي في كل أربعة أعوام لمحروم مشهور من حديث العلاء بن المسيب بن رافع الكاهلي الكوفي من أولاد المحدثين ، روى عنه غير واحد ، منهم من قال : في كل خمسة أعوام ، ومنهم من قال : عن العلاء عن يونس بن خباب عن أبي سعيد ، في غير ذلك من الاختلاف . وأنكرت الملحدة الحج ، فقالت : إن فيه تجريد الثياب وذلك يخالف الحياء ، والسعي وهو يناقض الوقار ، ورمي الجمار لغير مرمى وذلك يضاد العقل ; فصاروا إلى أن هذه الأفعال كلها باطلة ; إذ لم يعرفوا لها حكمة ولا علة ، وجهلوا أنه ليس من شرط المولى مع العبد ، أن يفهم المقصود بجميع ما يأمره به ، ولا أن يطلع على فائدة تكليفه ، وإنما يتعين عليه الامتثال ، ويلزمه الانقياد من غير طلب فائدة ولا سؤال عن مقصود . ولهذا المعنى كان عليه السلام يقول في تلبيته : ( لبيك حقا حقا تعبدا ورقا لبيك إله الحق ) . وروى الأئمة عن أبي هريرة قال : خطبنا رسول الله - صلى الله عليه وسلم - فقال : ( أيها الناس قد فرض الله عليكم الحج فحجوا ) . فقال رجل : كل عام يا رسول الله ؟ فسكت ، حتى قالها ثلاثا ، فقال رسول الله - صلى الله عليه وسلم - : ( لو قلت نعم لوجبت ولما استطعتم ) ثم قال : ذروني ما تركتكم فإنما هلك من كان قبلكم بكثرة سؤالهم واختلافهم على أنبيائهم فإذا أمرتكم بشيء فأتوا منه ما استطعتم وإذا نهيتكم عن شيء فدعوه ) لفظ مسلم . فبين هذا الحديث أن الخطاب إذا توجه على المكلفين بفرض أنه يكفي منه فعل مرة ولا يقتضي التكرار ; خلافا للأستاذ أبي إسحق الإسفراييني وغيره . وثبت أن النبي - صلى الله عليه وسلم - قال له أصحابه : يا رسول الله ، أحجنا لعامنا هذا أم للأبد ؟ فقال : ( لا بل للأبد ) . وهذا نص في الرد على من قال : يجب في كل خمس سنين مرة . وقد كان الحج معلوما عند العرب مشهورا لديهم ، وكان مما يرغب فيه لأسواقها وتبررها وتحنفها ; فلما جاء الإسلام خوطبوا بما علموا وألزموا بما عرفوا . وقد حج النبي - صلى الله عليه وسلم - قبل حج الفرض ، وقد وقف بعرفة ولم يغير من شرع إبراهيم ما غيروا ; حين كانت قريش تقف بالمشعر الحرام ويقولون : نحن أهل الحرم فلا نخرج منه ; ونحن الحمس . حسب ما تقدم بيانه في ( البقرة ) .\nقلت : من أغرب ما رأيته أن النبي - صلى الله عليه وسلم - حج قبل الهجرة مرتين وأن الفرض سقط عنه بذلك ; لأنه قد أجاب نداء إبراهيم حين قيل له : وأذن في الناس بالحج . قال الكيا الطبري : وهذا بعيد ; فإنه إذا ورد في شرعه : ولله على الناس حج البيت فلا بد من وجوبه عليه بحكم الخطاب في شرعه . ولئن قيل : إنما خاطب من لم يحج ، كان تحكما وتخصيصا لا دليل عليه ، ويلزم عليه ألا يجب بهذا الخطاب على من حج على دين إبراهيم ، وهذا في غاية البعد .\nالثانية : ودل الكتاب والسنة على أن الحج على التراخي لا على الفور ; وهو تحصيل مذهب مالك فيما ذكر ابن خويز منداد ، وهو قول الشافعي ومحمد بن الحسن وأبي يوسف في رواية عنه . وذهب بعض البغداديين من المتأخرين من المالكيين إلى أنه على الفور ، ولا يجوز تأخيره مع القدرة عليه ; وهو قول داود . والصحيح الأول ; لأن الله تعالى قال في سورة الحج : وأذن في الناس بالحج يأتوك رجالا وسورة الحج مكية . وقال تعالى : ولله على الناس حج البيت الآية . وهذه السورة نزلت عام أحد بالمدينة سنة ثلاث من الهجرة ولم يحج رسول الله - صلى الله عليه وسلم - إلى سنة عشر . أما السنة فحديث ضمام بن ثعلبة السعدي من بني سعد بن بكر قدم على النبي - صلى الله عليه وسلم - فسأله عن الإسلام فذكر الشهادة والصلاة والزكاة والصيام والحج . رواه ابن عباس وأبو هريرة وأنس ، وفيها كلها ذكر الحج ، وأنه كان مفروضا ، وحديث أنس أحسنها سياقا وأتمها . واختلف في وقت قدومه ; فقيل : سنة خمس . وقيل : سنة سبع . وقيل : سنة تسع ; ذكره ابن هشام عن أبي عبيدة الواقدي عام الخندق بعد انصراف الأحزاب . قال ابن عبد البر : ومن الدليل على أن الحج على التراخي إجماع العلماء على ترك تفسيق القادر على الحج إذا أخره العام والعامين ونحوهما ، وأنه إذا حج من بعد أعوام من حين استطاعته فقد أدى الحج الواجب عليه في وقته ، وليس هو عند الجميع كمن فاتته الصلاة حتى خرج وقتها فقضاها بعد خروج وقتها ، ولا كمن فاته صيام رمضان لمرض أو سفر فقضاه . ولا كمن أفسد حجه فقضاه ، فلما أجمعوا على أنه لا يقال لمن حج بعد أعوام من وقت استطاعته : أنت قاض لما وجب عليك ; علمنا أن وقت الحج موسع فيه وأنه على التراخي لا على الفور . قال أبو عمر : كل من قال بالتراخي لا يحد في ذلك حدا ; إلا ما روي عن سحنون وقد سئل عن الرجل يجد ما يحج به فيؤخر ذلك إلى سنين كثيرة مع قدرته على ذلك هل يفسق بتأخيره الحج وترد شهادته ؟ قال : لا وإن مضى من عمره ستون سنة ، فإذا زاد على الستين فسق وردت شهادته . وهذا توقيف وحد ، والحدود في الشرع لا تؤخذ إلا عمن له أن يشرع .\nقلت : وحكاه ابن خويز منداد عن ابن القاسم . قال ابن القاسم وغيره : إن أخره ستين سنة لم يحرج ، وإن أخره بعد الستين حرج ; لأن النبي - صلى الله عليه وسلم - قال : أعمار أمتي ما بين الستين إلى السبعين وقل من يتجاوزها فكأنه في هذا العشر قد يتضايق عليه الخطاب . قال أبو عمر : وقد احتج بعض الناس كسحنون بقوله - صلى الله عليه وسلم - : معترك أمتي بين الستين إلى السبعين وقل من يجاوز ذلك . ولا حجة فيه ; لأنه كلام خرج على الأغلب من أعمار أمته لو صح الحديث . وفيه دليل على التوسعة إلى السبعين لأنه من الأغلب أيضا ، ولا ينبغي أن يقطع بتفسيق من صحت عدالته وأمانته بمثل هذا من التأويل الضعيف . وبالله التوفيق .\nالثالثة : أجمع العلماء على أن الخطاب بقوله تعالى : ولله على الناس حج البيت عام في جميعهم مسترسل على جملتهم . قال ابن العربي : \" وإن كان الناس قد اختلفوا في مطلق العمومات بيد أنهم اتفقوا على حمل هذه الآية على جميع الناس ذكرهم وأنثاهم ، خلا الصغير فإنه خارج بالإجماع عن أصول التكليف ، وكذلك العبد لم يدخل فيه ; لأنه أخرجه عن مطلق العموم قوله تعالى في التمام : من استطاع إليه سبيلا والعبد غير مستطيع ; لأن السيد يمنعه لحقوقه عن هذه العبادة . وقد قدم الله سبحانه حق السيد على حقه رفقا بالعباد ومصلحة لهم . ولا خلاف فيه بين الأمة ولا بين الأئمة ، فلا نهرف بما لا نعرف ، ولا دليل عليه إلا الإجماع . قال ابن المنذر : أجمع عامة أهل العلم إلا من شذ منهم ممن لا يعد خلافا ، على أن الصبي إذا حج في حال صغره ، والعبد إذا حج في حال رقه ، ثم بلغ الصبي وعتق العبد أن عليهما حجة الإسلام إذا وجدا إليها سبيلا . وقال أبو عمر : خالف داود جماعة فقهاء الأمصار وأئمة الأثر في المملوك وأنه عنده مخاطب بالحج ، وهو عند جمهور العلماء خارج من الخطاب العام في قوله تعالى : ولله على الناس حج البيت من استطاع إليه سبيلا بدليل عدم التصرف ، وأنه ليس له أن يحج بغير إذن سيده ; كما خرج من خطاب الجمعة وهو قوله تعالى : يا أيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة الآية - عند عامة العلماء إلا من شذ . وكما خرج من خطاب إيجاب الشهادة ، قال الله تعالى : ولا يأب الشهداء إذا ما دعوا فلم يدخل في ذلك العبد . وكما جاز خروج الصبي من قوله : ولله على الناس حج البيت وهو من الناس بدليل رفع القلم عنه . وخرجت المرأة من قوله : يا أيها الذين آمنوا إذا نودي للصلاة وهي ممن شمله اسم الإيمان ، وكذلك خروج العبد من الخطاب المذكور . وهو قول فقهاء الحجاز والعراق والشام والمغرب ، ومثلهم لا يجوز عليهم تحريف تأويل الكتاب . فإن قيل : إذا كان حاضر المسجد الحرام وأذن له سيده فلم لا يلزمه الحج ؟ قيل له : هذا سؤال على الإجماع وربما لا يعلل ذلك ، ولكن إذا ثبت هذا الحكم على الإجماع استدللنا به على أنه لا يعتد بحجه في حال الرق عن حجة الإسلام ; وقد روي عن ابن عباس عن النبي - صلى الله عليه وسلم - أنه قال : أيما صبي حج ثم أدرك فعليه أن يحج حجة أخرى وأيما أعرابي حج ثم هاجر فعليه أن يحج حجة أخرى وأيما عبد حج ثم أعتق فعليه أن يحج حجة أخرى . قال ابن العربي . \" وقد تساهل بعض علمائنا فقال : إنما لم يثبت الحج على العبد وإن أذن له السيد لأنه كان كافرا في الأصل ولم يكن حج الكافر معتدا به ، فلما ضرب عليه الرق ضربا مؤبدا لم يخاطب بالحج ; وهذا فاسد من ثلاثة أوجه فاعلموه : أحدها : أن الكفار عندنا مخاطبون بفروع الشريعة ، ولا خلاف فيه في قول مالك . الثاني : أن سائر العبادات تلزمه من صلاة وصوم مع كونه رقيقا ، ولو فعلها في حال كفره لم يعتد بها ، فوجب أن يكون الحج مثلها . الثالث : أن الكفر قد ارتفع بالإسلام فوجب ارتفاع حكمه . فتبين أن المعتمد ما ذكرناه من تقدم حقوق السيد \" . والله الموفق .\nالرابعة : قوله تعالى : من استطاع إليه سبيلا ( من ) في موضع خفض على بدل البعض من الكل ; هذا قول أكثر النحويين . وأجاز الكسائي أن يكون ( من ) في موضع رفع بحج ، التقدير أن يحج البيت من . وقيل هي شرط . و استطاع في موضع جزم ، والجواب محذوف ، أي من استطاع إليه سبيلا فعليه الحج . روى الدارقطني عن ابن عباس قال : قيل يا رسول الله الحج كل عام ؟ قال : ( لا بل حجة ) ؟ قيل : فما السبيل ، قال : ( الزاد والراحلة ) . ورواه عن أنس وابن مسعود وابن عمر وجابر وعائشة وعمرو بن شعيب عن أبيه عن جده . وعن علي بن أبي طالب - رضي الله عنه - عن النبي - صلى الله عليه وسلم - ولله على الناس حج البيت من استطاع إليه سبيلا قال فسئل عن ذلك فقال النبي - صلى الله عليه وسلم - : أن تجد ظهر بعير . وأخرج حديث ابن عمر أيضا ابن ماجه في سننه ، وأبو عيسى الترمذي في جامعه وقال : \" حديث حسن ، والعمل عليه عند أهل العلم أن الرجل إذا ملك زادا وراحلة وجب عليه الحج \" . وإبراهيم بن يزيد هو الخوزي المكي ، وقد تكلم فيه بعض أهل الحديث من قبل حفظه . وأخرجاه عن وكيع والدارقطني عن سفيان بن سعيد قالوا : حدثنا إبراهيم بن يزيد عن محمد بن عباد عن ابن عمر قال : قام رجل إلى النبي - صلى الله عليه وسلم - فقال : يا رسول الله ، ما يوجب الحج ؟ . قال : ( الزاد والراحلة ) قال : يا رسول الله ، فما الحاج ؟ قال : ( الشعث التفل ) . وقام آخر فقال يا رسول الله وما الحج ؟ قال : ( العج والثج ) . قال وكيع : يعني بالعج العجيج بالتلبية والثج نحر البدن ; لفظ ابن ماجه . وممن قال إن الزاد والراحلة شرط في وجوب الحج : عمر بن الخطاب وابنه عبد الله وعبد الله بن عباس والحسن البصري وسعيد بن جبير وعطاء ومجاهد . وإليه ذهب الشافعي والثوري وأبو حنيفة وأصحابه وأحمد وإسحاق وعبد العزيز بن أبي سلمة وابن حبيب ، وذكر عبدوس مثله عن سحنون . قال الشافعي : الاستطاعة وجهان : أحدهما : أن يكون مستطيعا ببدنه واجدا من ماله ما يبلغه الحج . والثاني : أن يكون معضوبا في بدنه لا يثبت على مركبه وهو قادر على من يطيعه إذا أمره أن يحج عنه بأجرة وبغير أجرة ، على ما يأتي بيانه . أما المستطيع ببدنه فإنه يلزمه فرض الحج بالكتاب بقوله عز وجل : من استطاع إليه سبيلا . وأما المستطيع بالمال فقد لزمه فرض الحج بالسنة بحديث الخثعمية على ما يأتي . وأما المستطيع بنفسه وهو القوي الذي لا تلحقه مشقة غير محتملة في الركوب على الراحلة ; فإن هذا إذا ملك الزاد والراحلة لزمه فرض الحج بنفسه ، وإن عدم الزاد والراحلة أو أحدهما سقط عنه فرض الحج ; فإن كان قادرا على المشي مطيقا له ووجد الزاد أو قدر على كسب الزاد في طريقه بصنعة مثل الخرز والحجامة أو نحوهما فالمستحب له أن يحج ماشيا رجلا كان أو امرأة . قال الشافعي : والرجل أقل عذرا من المرأة لأنه أقوى . وهذا عندهم على طريق الاستحباب لا على طريق الإيجاب ، فأما إن قدر على الزاد بمسألة الناس في الطريق كرهت له أن يحج لأنه يصير كلا على الناس . وقال مالك بن أنس رحمه الله : إذا قدر على المشي ووجد الزاد فعليه فرض الحج ، وإن لم يجد الراحلة وقدر على المشي نظر ; فإن كان مالكا للزاد وجب عليه فرض الحج ، وإن لم يكن مالكا للزاد ولكنه يقدر على كسب حاجته منه في الطريق نظر أيضا ; فإن كان من أهل المروءات ممن لا يكتسب بنفسه لا يجب عليه ، وإن كان ممن يكتسب كفايته بتجارة أو صناعة لزمه فرض الحج ، وهكذا إن كانت عادته مسألة الناس لزمه فرض الحج . وكذلك أوجب مالك على المطيق المشي الحج ، وإن لم يكن معه زاد وراحلة . وهو قول عبد الله بن الزبير والشعبي وعكرمة . وقال الضحاك : إن كان شابا قويا صحيحا ليس له مال فعليه أن يؤجر نفسه بأكله أو عقبه حتى يقضي حجه . فقال له مقاتل : كلف الله الناس أن يمشوا إلى البيت ؟ فقال : لو أن لأحدهم ميراثا بمكة أكان تاركه ؟ بل ينطلق إليه ولو حبوا ، كذلك يجب عليه الحج . واحتج هؤلاء بقوله عز وجل : وأذن في الناس بالحج يأتوك رجالا أي مشاة . قالوا : ولأن الحج من عبادات الأبدان من فرائض الأعيان ، فوجب ألا يكون الزاد من شروط وجوبها ولا الراحلة كالصلاة والصيام . قالوا : ولو صح حديث الخوزي \" الزاد والراحلة \" لحملناه على عموم الناس والغالب منهم في الأقطار البعيدة . وخروج مطلق الكلام على غالب الأحوال كثير في الشريعة وفي كلام العرب وأشعارها . وقد روى ابن وهب وابن القاسم وأشهب عن مالك أنه سئل عن هذه الآية فقال : الناس في ذلك على قدر طاقتهم ويسرهم وجلدهم . قال أشهب لمالك : أهو الزاد والراحلة ؟ . قال : لا والله ، ما ذاك إلا على قدر طاقة الناس ، وقد يجد الزاد والراحلة ولا يقدر على السير ، وآخر يقدر أن يمشي على رجليه .\nالخامسة : إذا وجدت الاستطاعة وتوجه فرض الحج فقد يعرض ما يمنع منه كالغريم يمنعه عن الخروج حتى يؤدي الدين ; ولا خلاف في ذلك . أو يكون له عيال يجب عليه نفقتهم فلا يلزمه الحج حتى يكون لهم نفقتهم مدة غيبته لذهابه ورجوعه ، لأن هذا الإنفاق فرض على الفور ، والحج فرض على التراخي ، فكان تقديم العيال أولى . وقد قال النبي - صلى الله عليه وسلم - : كفى بالمرء إثما أن يضيع من يقوت . وكذلك الأبوان يخاف الضيعة عليهما وعدم العوض في التلطف بهما ، فلا سبيل له إلى الحج ; فإن منعاه لأجل الشوق والوحشة فلا يلتفت إليه . والمرأة يمنعها زوجها ، وقيل لا يمنعها . والصحيح المنع ; لا سيما إذا قلنا إن الحج لا يلزمه على الفور . والبحر لا يمنع الوجوب إذا كان غالبه السلامة - كما تقدم بيانه في البقرة - ويعلم من نفسه أنه لا يميد . فإن كان الغالب عليه العطب أو الميد حتى يعطل الصلاة فلا . وإن كان لا يجد موضعا لسجوده لكثرة الراكب وضيق المكان فقد قال مالك : إذا لم يستطع الركوع والسجود إلا على ظهر أخيه فلا يركبه . ثم قال : أيركب حيث لا يصلي ويل لمن ترك الصلاة ويسقط الحج إذا كان في الطريق عدو يطلب الأنفس أو يطلب من الأموال ما لم يتحدد بحد مخصوص أو يتحدد بقدر مجحف . وفي سقوطه بغير المجحف خلاف . وقال الشافعي : لا يعطى حبة ويسقط فرض الحج . ويجب على المتسول إذا كانت تلك عادته وغلب على ظنه أنه يجد من يعطيه . وقيل لا يجب ، على ما تقدم من مراعاة الاستطاعة .\nالسادسة : إذا زالت الموانع ولم يكن عنده من الناض ما يحج به وعنده عروض فيلزمه أن يبيع من عروضه للحج ما يباع عليه في الدين . وسئل ابن القاسم عن الرجل تكون له القربة ليس له غيرها ، أيبيعها في حجة الإسلام ويترك ولده ولا شيء لهم يعيشون به ؟ . قال : نعم ، ذلك عليه ويترك ولده في الصدقة . والصحيح القول الأول ; لقوله عليه السلام : كفى بالمرء إثما أن يضيع من يقوت وهو قول الشافعي . والظاهر من مذهبه أنه لا يلزم الحج إلا من له ما يكفيه من النفقة ذاهبا وراجعا - قاله في الإملاء - وإن لم يكن له أهل وعيال . وقال بعضهم : لا يعتبر الرجوع لأنه ليس عليه كبير مشقة في تركه القيام ببلده ; لأنه لا أهل له فيه ولا عيال وكل البلاد له وطن . والأول أصوب ; لأن الإنسان يستوحش لفراق وطنه كما يستوحش لفراق سكنه . ألا ترى أن البكر إذا زنى جلد وغرب عن بلده سواء كان له أهل أو لم يكن . قال الشافعي في الأم : إذا كان له مسكن وخادم وله نفقة أهله بقدر غيبته يلزمه الحج . وظاهر هذا أنه اعتبر أن يكون مال الحج فاضلا عن الخادم والمسكن ; لأنه قدمه على نفقة أهله ، فكأنه قال بعد هذا كله . وقال أصحابه : يلزمه أن يبيع المسكن والخادم ويكتري مسكنا وخادما لأهله ، فإن كان له بضاعة يتجر بها وربحها قدر كفايته وكفاية عياله على الدوام ، ومتى أنفق من أصل البضاعة اختل عليه ربحها ولم يكن فيه قدر كفايته ، فهل يلزمه الحج من أصل البضاعة أم لا ؟ قولان : الأول للجمهور وهو الصحيح المشهور ; لأنه لا خلاف في أنه لو كان له عقار تكفيه غلته لزمه أن يبيع أصل العقار في الحج ، فكذلك البضاعة . وقال ابن شريح : لا يلزمه ذلك ويبقي البضاعة ولا يحج من أصلها ; لأن الحج إنما يجب عليه في الفاضل من كفايته . فهذا الكلام في الاستطاعة بالبدن والمال .\nالسابعة : المريض والمعضوب ، والعضب القطع ، ومنه سمي السيف عضبا ، وكأن من انتهى إلى ألا يقدر أن يستمسك على الراحلة ولا يثبت عليها بمنزلة من قطعت أعضاؤه ; إذ لا يقدر على شيء . وقد اختلف العلماء في حكمهما بعد إجماعهم أنه لا يلزمهما المسير إلى الحج ; لأن الحج إنما فرضه على المستطيع إجماعا ، والمريض والمعضوب لا استطاعة لهما . فقال مالك : إذا كان معضوبا سقط عنه فرض الحج أصلا ، سواء كان قادرا على من يحج عنه بالمال أو بغير المال لا يلزمه فرض الحج . ولو وجب عليه الحج ثم عضب وزمن سقط عنه فرض الحج ; ولا يجوز أن يحج عنه في حال حياته بحال ، بل إن أوصى أن يحج عنه بعد موته حج عنه من الثلث ، وكان تطوعا ; واحتج بقوله تعالى : وأن ليس للإنسان إلا ما سعى فأخبر أنه ليس له إلا ما سعى . فمن قال : إنه له سعي غيره فقد خالف ظاهر الآية . وبقوله تعالى : ولله على الناس حج البيت وهذا غير مستطيع ; لأن الحج هو قصد المكلف البيت بنفسه ولأنها عبادة لا تدخلها النيابة مع العجز عنها كالصلاة . وروى محمد بن المنكدر عن جابر قال : قال رسول الله - صلى الله عليه وسلم - : إن الله عز وجل ليدخل بالحجة الواحدة ثلاثة الجنة الميت والحاج عنه والمنفذ ذلك . خرجه الطبراني أبو القاسم سليمان بن أحمد قال حدثنا عمرو بن حصين السدوسي قال حدثنا أبو معشر عن محمد بن المنكدر ; فذكره .\nقلت : أبو معشر اسمه نجيح وهو ضعيف عندهم . وقال الشافعي : في المريض الزمن والمعضوب والشيخ الكبير يكون قادرا على من يطيعه إذا أمره بالحج عنه فهو مستطيع استطاعة ما . وهو على وجهين : أحدهما أن يكون قادرا على مال يستأجر به من يحج عنه فإنه يلزمه فرض الحج ; وهذا قول علي بن أبي طالب - رضي الله عنه - ، روي عنه أنه قال لشيخ كبير لم يحج : جهز رجلا يحج عنك . وإلى هذا ذهب الثوري وأبو حنيفة وأصحابه وابن المبارك وأحمد وإسحاق . والثاني أن يكون قادرا على من يبذل له الطاعة والنيابة فيحج عنه ; فهذا أيضا يلزمه الحج عنه عند الشافعي وأحمد وابن راهويه ، وقال أبو حنيفة : لا يلزم الحج ببذل الطاعة بحال . استدل الشافعي بما رواه ابن عباس أن امرأة من خثعم سألت النبي - صلى الله عليه وسلم - فقالت : يا رسول الله ، إن فريضة الله على عباده في الحج أدركت أبي شيخا كبيرا لا يستطيع أن يثبت على الراحلة ، أفأحج عنه قال : ( نعم ) . وذلك في حجة الوداع . في رواية : لا يستطيع أن يستوي على ظهر بعيره . فقال النبي - صلى الله عليه وسلم - : فحجي عنه أرأيت لو كان على أبيك دين أكنت قاضيته ) ؟ قالت : نعم . قال : ( فدين الله أحق أن يقضى ) . فأوجب النبي - صلى الله عليه وسلم - الحج بطاعة ابنته إياه وبذلها من نفسها له بأن تحج عنه ; فإذا وجب ذلك بطاعة البنت له كان بأن يجب عليه بقدرته على المال الذي يستأجر به أولى . فأما إن بذل له المال دون الطاعة فالصحيح أنه لا يلزمه قبوله والحج به عن نفسه ولا يصير ببذل المال له مستطيعا . وقال علماؤنا : حديث الخثعمية ليس مقصوده الإيجاب وإنما مقصوده الحث على بر الوالدين والنظر في مصالحهما دنيا ودينا وجلب المنفعة إليهما جبلة وشرعا ; فلما رأى من المرأة انفعالا وطواعية ظاهرة ورغبة صادقة في برها بأبيها وحرصا على إيصال الخير والثواب إليه ، وتأسفت أن تفوته بركة الحج أجابها إلى ذلك . كما قال للأخرى التي قالت : إن أمي نذرت أن تحج فلم تحج حتى ماتت أفأحج عنها ؟ قال : ( حجي عنها أرأيت لو كان على أمك دين أكنت قاضيته ) ؟ قالت : نعم . ففي هذا ما يدل على أنه من باب التطوعات وإيصال البر والخيرات للأموات ; ألا ترى أنه قد شبه فعل الحج بالدين . وبالإجماع لو مات ميت وعليه دين لم يجب على وليه قضاؤه من ماله ، فإن تطوع بذلك تأدى الدين عنه . ومن الدليل على أن الحج في هذا الحديث ليس بفرض على أبيها ما صرحت به هذه المرأة بقولها \" لا يستطيع \" ومن لا يستطيع لا يجب عليه . وهذا تصريح بنفي الوجوب ومنع الفريضة ، فلا يجوز ما انتفى في أول الحديث قطعا أن يثبت في آخره ظنا ; يحققه قوله : ( فدين الله أحق أن يقضى ) فإنه ليس على ظاهره إجماعا ; فإن دين العبد أولى بالقضاء ، وبه يبدأ إجماعا لفقر الآدمي واستغناء الله تعالى ; قاله ابن العربي . وذكر أبو عمر بن عبد البر أن حديث الخثعمية عند مالك وأصحابه مخصوص بها . وقال آخرون : فيه اضطراب . وقال ابن وهب وأبو مصعب : هو في حق الولد خاصة . وقال ابن حبيب : جاءت الرخصة في الحج عن الكبير الذي لا منهض له ولم يحج وعمن مات ولم يحج ، أن يحج عنه ولده وإن لم يوص به ويجزئه إن شاء الله تعالى . فهذا الكلام على المعضوب وشبهه . وحديث الخثعمية أخرجه الأئمة ، وهو يرد على الحسن قوله : إنه لا يجوز حج المرأة عن الرجل .\nالثامنة : وأجمع العلماء على أنه إذا لم يكن للمكلف قوت يتزوده في الطريق لم يلزمه الحج . وإن وهب له أجنبي مالا يحج به لم يلزمه قبوله إجماعا ; لما يلحقه من المنة في ذلك . فلو كان رجل وهب لأبيه مالا فقد قال الشافعي : يلزمه قبوله ; لأن ابن الرجل من كسبه ولا منة عليه في ذلك . وقال مالك وأبو حنيفة : لا يلزمه قبوله ; لأن فيه سقوط حرمة الأبوة ; إذ يقال : قد جزاه وقد وفاه ، والله أعلم .\nالتاسعة : قوله تعالى : ومن كفر فإن الله غني عن العالمين قال ابن عباس وغيره : المعنى ومن كفر بفرض الحج ولم يره واجبا . وقال الحسن البصري وغيره : إن من ترك الحج وهو قادر عليه فهو كافر . وروى الترمذي عن الحارث عن علي قال : قال رسول الله - صلى الله عليه وسلم - : من ملك زادا وراحلة تبلغه إلى بيت الله ولم يحج فلا عليه أن يموت يهوديا أو نصرانيا وذلك أن الله يقول في كتابه ولله على الناس حج البيت من استطاع إليه سبيلا . قال أبو عيسى : ( هذا حديث غريب لا نعرفه إلا من هذا الوجه ، وفي إسناده مقال ، وهلال بن عبد الله مجهول ، والحارث يضعف ) . وروي نحوه عن أبي أمامة وعمر بن الخطاب رضي الله عنهما . وعن عبد خير بن يزيد عن علي بن أبي طالب - رضي الله عنه - أن رسول الله - صلى الله عليه وسلم - قال في خطبته : يا أيها الناس إن الله فرض عليكم الحج على من استطاع إليه سبيلا ومن لم يفعل فليمت على أي حال شاء إن شاء يهوديا أو نصرانيا أو مجوسيا إلا أن يكون به عذر من مرض أو سلطان جائر ألا نصيب له في شفاعتي ولا ورود حوضي . وقال ابن عباس قال رسول الله - صلى الله عليه وسلم - : من كان عنده مال يبلغه الحج فلم يحج أو عنده مال تحل فيه الزكاة فلم يزكه سأل عند الموت الرجعة . فقيل يا ابن عباس إنا كنا نرى هذا للكافرين . فقال : أنا أقرأ عليكم به قرآنا : يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون . وأنفقوا مما رزقناكم من قبل أن يأتي أحدكم الموت فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين . قال الحسن بن صالح في تفسيره : فأزكي وأحج . وعن النبي - صلى الله عليه وسلم - أن رجلا سأل عن الآية فقال : ( من حج لا يرجو ثوابا أو جلس لا يخاف عقابا فقد كفر به ) . وروى قتادة عن الحسن قال : قال عمر - رضي الله عنه - : لقد هممت أن أبعث رجالا إلى الأمصار فينظرون إلى من كان له مال ولم يحج فيضربون عليه الجزية ; فذلك قوله تعالى : ومن كفر فإن الله غني عن العالمين .\nقلت : هذا خرج مخرج التغليظ ; ولهذا قال علماؤنا : تضمنت الآية أن من مات ولم يحج وهو قادر فالوعيد يتوجه عليه ، ولا يجزئ أن يحج عنه غيره ; لأن حج الغير لو أسقط عنه الفرض لسقط عنه الوعيد ، والله أعلم . وقال سعيد بن جبير : لو مات جار لي وله ميسرة ولم يحج لم أصل عليه .\n                                    ",
        "saadi": "فِيهِ ءَايَٰتُۢ بَيِّنَٰتٞ مَّقَامُ إِبۡرَٰهِيمَۖ وَمَن دَخَلَهُۥ كَانَ ءَامِنٗاۗ وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلۡبَيۡتِ مَنِ ٱسۡتَطَاعَ إِلَيۡهِ سَبِيلٗاۚ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنِ ٱلۡعَٰلَمِينَ ٧٩\n                                        \n                                        \n                                        \n                                        أي: أدلة واضحات، وبراهين قاطعات على أنواع من العلوم الإلهية والمطالب العالية، كالأدلة على توحيده ورحمته وحكمته وعظمته وجلاله وكمال علمه وسعة جوده، وما مَنَّ به على أوليائه وأنبيائه، فمن الآيات { مقام إبراهيم } يحتمل أن المراد به المقام المعروف وهو الحجر الذي كان يقوم عليه الخليل لبنيان الكعبة لما ارتفع البنيان، وكان ملصقا في جدار الكعبة، فلما كان عمر رضي الله عنه وضعه في مكانه الموجود فيه الآن، والآية فيه قيل أثر قدمي إبراهيم، قد أثرت في الصخرة وبقي ذلك الأثر إلى أوائل هذه الأمة، وهذا من خوارق العادات، وقيل إن الآية فيه ما أودعه الله في القلوب من تعظيمه وتكريمه وتشريفه واحترامه، ويحتمل أن المراد بمقام إبراهيم أنه مفرد مضاف يراد به مقاماته في مواضع المناسك كلها، فيكون على هذا جميع أجزاء الحج ومفرداته آيات بينات، كالطواف والسعي ومواضعها، والوقوف بعرفة ومزدلفة، والرمي، وسائر الشعائر، والآية في ذلك ما جعله الله في القلوب من تعظيمها واحترامها وبذل نفائس النفوس والأموال في الوصول إليها وتحمل كل مشقة لأجلها، وما في ضمنها من الأسرار البديعة والمعاني الرفيعة، وما في أفعالها من الحكم والمصالح التي يعجز الخلق عن إحصاء بعضها، ومن الآيات البينات فيها أن من دخله كان آمنا شرعا وقدرا، فالشرع قد أمر الله رسوله إبراهيم ثم رسوله محمد باحترامه وتأمين من دخله، وأن لا يهاج، حتى إن التحريم في ذلك شمل صيودها وأشجارها ونباتها، وقد استدل بهذه الآية من ذهب من العلماء أن من جنى جناية خارج الحرم ثم لجأ إليه أنه يأمن ولا يقام عليه الحد حتى يخرج منه، وأما تأمينها قدرا فلأن الله تعالى بقضائه وقدره وضع في النفوس حتى نفوس المشركين به الكافرين بربهم احترامه، حتى إن الواحد منهم مع شدة حميتهم ونعرتهم وعدم احتمالهم للضيم يجد أحدهم قاتل أبيه في الحرم فلا يهيجه، ومن جعله حرما أن كل من أراده بسوء فلا بد أن يعاقبه عقوبة عاجلة، كما فعل بأصحاب الفيل وغيرهم، وقد رأيت لابن القيم هاهنا كلاما حسنا أحببت إيراده لشدة الحاجة إليه قال فائدة: { ولله على الناس حج البيت من استطاع إليه سبيلا } \"حج البيت\" مبتدأ وخبره في أحد المجرورين قبله، والذي يقتضيه المعنى أن يكون في قوله: \"على الناس\" لأنه وجوب، والوجوب يقتضي \"على\" ويجوز أن يكون في قوله: \"ولله\" لأنه متضمن الوجوب والاستحقاق، ويرجح هذا التقدير أن الخبر محط الفائدة وموضعها، وتقديمه في هذا الباب في نية التأخير، فكان الأحسن أن يكون \"ولله على الناس\" . ويرجح الوجه الأول بأن يقال قوله: \"حج البيت على الناس\" أكثر استعمالا في باب الوجوب من أن يقال: \"حج البيت لله\" أي: حق واجب لله، فتأمله. وعلى هذا ففي تقديم المجرور الأول وليس بخبر فائدتان: إحداهما: أنه اسم للموجب للحج، فكان أحق بالتقديم من ذكر الوجوب، فتضمنت الآية ثلاثة أمور مرتبة بحسب الوقائع: أحدها: الموجب لهذا الفرض فبدأ بذكره، والثاني: مؤدي الواجب وهو المفترض عليه وهم الناس، والثالث: النسبة، والحق المتعلق به إيجابا وبهم وجوبا وأداء، وهو الحج. والفائدة الثانية: أن الاسم المجرور من حيث كان اسما لله سبحانه، وجب الاهتمام بتقديمه تعظيما لحرمة هذا الواجب الذي أوجبه، وتخويفا من تضييعه، إذ ليس ما أوجبه الله سبحانه بمثابة ما يوجبه غيره. وأما قوله: \"مَنْ\" فهي بدل، وقد استهوى طائفة من الناس القول بأنها فاعل بالمصدر، كأنه قال: أن يحج البيت من استطاع إليه سبيلا، وهذا القول يضعف من وجوه، منها: أن الحج فرض عين، ولو كان معنى الآية ما ذكره لأفهم فرض الكفاية، لأنه إذا حج المستطيعون برئت ذمم غيرهم، لأن المعنى يؤل إلى: ولله على الناس حج البيت مستطيعهم، فإذا أدى المستطيعون الواجب لم يبق واجبا على غير المستطيعين، وليس الأمر كذلك، بل الحج فرض عين على كل أحد، حج المستطيعون أو قعدوا، ولكن الله سبحانه عذر غير المستطيع بعجزه عن أداء الواجب، فلا يؤاخذه به ولا يطالبه بأدائه، فإذا حج سقط الفرض عن نفسه، وليس حج المستطيعين بمسقط الفرض عن العاجزين، وإذا أردت زيادة إيضاح، فإذا قلت: واجب على أهل هذه الناحية أن يجاهد منهم الطائفة المستطيعون للجهاد، فإذا جاهدت تلك الطائفة انقطع تعلق الوجوب في غيرهم، وإذا قلت واجب على الناس كلهم أن يجاهد منهم المستطيع، كان الوجوب متعلقا بالجميع وعذر العاجز بعجزه، ففي نظم الآية على هذا الوجه دون أن يقال: ولله حج البيت على المستطيعين، هذه النكتة البديعة فتأملها. الوجه الثاني: أن إضافة المصدر إلى الفاعل إذا وجد أولى من إضافته إلى المفعول ولا يعدل عن هذا الأصل إلا بدليل منقول، فلو كان من هو الفاعل لأضيف المصدر إليه فكان يقال: \"ولله على الناس حج مَنْ استطاع\" وحمله على باب \"يعجبني ضرب زيد عمرا\" وفيما يفصل فيه بين المصدر وفاعله المضاف إليه بالمفعول والظرف حمل على المكتوب المرجوح، وهي قراءة ابن عامر ( قتل أولادهم شركائهم )، فلا يصار إليه.وإذا ثبت أن \"من\" بدل بعض من كل وجب أن يكون في الكلام ضمير يعود إلى \"الناس\" كأنه قيل: من استطاع منهم، وحذف هذا الضمير في أكثر الكلام لا يحسن، وحسنه هاهنا أمور منها: أن \"من\" واقعة على من لا يعقل، كالاسم المبدل منه فارتبطت به، ومنها: أنها موصولة بما هو أخص من الاسم الأول، ولو كانت الصلة أعم لقبح حذف الضمير العائد، ومثال ذلك إذا قلت: رأيت إخوتك من ذهب إلى السوق منهم، كان قبيحا، لأن الذاهب إلى السوق أعم من الإخوة، وكذلك لو قلت: البس الثياب ما حسن وجمل، يريد منها، ولم يذكر الضمير كان أبعد في الجواز، لأن لفظ ما حسن أعم من الثياب. وباب البعض من الكل أن يكون أخص من المبدل منه، فإذا كان أعم وأضفته إلى ضمير أو قيدته بضمير يعود إلى الأول ارتفع العموم وبقي الخصوص، ومما حسن حذف المضاف في هذه أيضا مع ما تقدم طول الكلام بالصلة والموصول. وأما المجرور من قوله \"لله\" فيحتمل وجهين: أحدهما: أن يكون في موضع من سبيل، كأنه نعت نكرة قدم عليها، لأنه لو تأخر لكان في موضع النعت لسبيل، والثاني: أن يكون متعلقا بسبيل، فإن قلت: كيف يتعلق به وليس فيه معنى الفعل؟ قيل: السبيل لما كان عبارة هاهنا عن الموصل إلى البيت من قوت وزاد ونحوهما، كان فيه رائحة الفعل، ولم يقصد به السبيل الذي هو الطريق، فصلح تعلق المجرور به، واقتضى حسن النظم وإعجاز اللفظ تقديم المجرور وإن كان موضعه التأخير، لأنه ضمير يعود على البيت، والبيت هو المقصود به الاعتناء، وهم يقدمون في كلامهم ما هم به أهم وببيانه أعني هذا تقرير السهيلي، وهذا بعيد جدا بل الصواب في متعلق الجار والمجرور وجه آخر أحسن من هذين، ولا يليق بالآية سواه، وهو الوجوب المفهوم من قوله \"على الناس\" أي: يجب لله على الناس الحج، فهو حق واجب لله، وأما تعليقه بالسبيل وجعله حالا منها، ففي غاية البعد فتأمله، ولا يكاد يخطر بالبال من الآية، وهذا كما تقول: لله عليك الصلاة والزكاة والصيام. ومن فوائد الآية وأسرارها أنه سبحانه إذا ذكر ما يوجبه ويحرمه يذكره بلفظ الأمر والنهي، وهو الأكثر، وبلفظ الإيجاب والكتابة والتحريم نحو { كتب عليكم الصيام } { حرمت عليكم الميتة } { قل تعالوا أتل ما حرم ربكم عليكم } وفي الحج أتى بهذا اللفظ الدال على تأكد الوجوب من عشرة أوجه، أحدها أنه قدم اسمه تعالى وأدخل عليه لام الاستحقاق والاختصاص ثم ذكر من أوجبه عليهم بصيغة العموم الداخلة عليها حرف على أبدل منه أهل الاستطاعة، ثم نكر السبيل في سياق الشرط إيذانا بأنه يجب الحج على أي: سبيل تيسرت، من قوت أو مال، فعلق الوجوب بحصول ما يسمى سبيلا، ثم أتبع ذلك بأعظم التهديد بالكفر فقال { ومن كفر } أي: لعدم التزامه هذا الواجب وتركه ثم عظم الشأن وأكد الوعيد بإخباره ما يستغنى به عنه، والله تعالى هو الغني الحميد، ولا حاجة به إلى حج أحد، وإنما في ذكر استغنائه عنه هنا من الإعلام بمقته له وسخطه عليه وإعراضه بوجهه عنه ما هو أعظم التهديد وأبلغه، ثم أكد ذلك بذكر اسم \"العالمين\" عموما، ولم يقل: فإن الله غني عنه، لأنه إذا كان غنيا عن العالمين كلهم فله الغنى الكامل التام من كل وجه بكل اعتبار، فكان أدل لعظم مقته لتارك حقه الذي أوجبه عليه، ثم أكد هذا المعنى بأداة \"إن\" الدالة على التأكيد، فهذه عشرة أوجه تقتضي تأكد هذا الفرض العظيم. وتأمل سر البدل في الآية المقتضي لذكر الإسناد مرتين، مرة بإسناده إلى عموم الناس، ومرة بإسناده إلى خصوص المستطيعين، وهذا من فوائد البدل تقوية المعنى وتأكيده بتكرر الإسناد ولهذا كان في نية تكرار العامل وإعادته. ثم تأمل ما في الآية من الإيضاح بعد الإبهام والتفصيل بعد الإجمال، وكيف تضمن ذلك إيراد الكلام في صورتين وخلتين، اعتناء به وتأكيد لشأنه، ثم تأمل كيف افتتح هذا الإيجاب بذكر محاسن البيت وعظم شأنه بما تدعوا النفوس إلى قصده وحجه وان لم يطلب ذلك منها، فقال: { إن أول بيت } إلخ، فوصفه بخمس صفات: أحدها كونه أسبق بيوت العالم وضع في الأرض، الثاني: أنه مبارك، والبركة كثرة الخير ودوامه، وليس في بيوت العالم أبرك منه ولا أكثر خيرا ولا أدوم ولا أنفع للخلائق، الثالث: أنه هدى، ووصفه بالمصدر نفسه مبالغة، حتى كأنه نفس الهدى، الرابع ما تضمن من الآيات البينات التي تزيد على أربعين آية، الخامس: الأمن الحاصل لداخله، وفي وصفه بهذه الصفات دون إيجاب قصده ما يبعث النفوس على حجه وإن شطت بالزائرين الديار وتناءت بهم الأقطار، ثم أتبع ذلك بصريح الوجوب المؤكد بتلك التأكيدات، وهذا يدل على الاعتناء منه سبحانه لهذا البيت العظيم، والتنويه بذكره، والتعظيم لشأنه، والرفعة من قدره، ولو لم يكن له شرف إلا إضافته إياه إلى نفسه بقوله { وطهر بيتي } لكفى بهذه الإضافة فضلا وشرفا، وهذه الإضافة هي التي أقبلت بقلوب العالمين إليه، وسلبت نفوسهم حباله وشوقا إلى رؤيته، فهذه المثابة للمحبين يثوبون إليه ولا يقضون منه وطرا أبدا، كلما ازدادوا له زيارة ازدادوا له حبا وإليه اشتياقا، فلا الوصال يشفيهم ولا البعاد يسليهم، كما قيل: أطوف به والنفس بعد مشوقة إليه وهل بعـد الطـواف تداني وألثم منه الركـن أطلـب برد ما بقلبي من شـوق ومن هيمان فـوالله مـا ازداد إلا صبــابة ولا القــلب إلا كثرة الخفقان فيـا جنة المأوى ويا غاية المنى ويا منيتي من دون كل أمـان أبت غلبـات الشـوق إلا تقـربا إليـك فمـا لي بالبـعاد يدان ومـا كان صدى عنك صد ملالة ولي شـاهد من مقلتي ولسان دعوت اصطباري عنك بعدك والبكا فلبى البكا والصبر عنك عصاني وقـد زعموا أن المـحب إذا نأى سيبلى هـواه بعد طـول زمان ولـو كان هذا الزعم حقا لكان ذا دواء الهوى في الناس كل زمان بلى إنـه يبلـى والهـوى عـلى حاله لم يبله الملـوان وهذا محـب قاده الشوق والهوى بغـير زمـام قائد وعنــان أتاك عـلى بعد المـزار ولو ونت مطيته جــاءت به القـدمان انتهى كلامه رحمه الله تعالى.\n                                    "
      },
      "originalText": "فِيهِ ءَايَٰتُۢ بَيِّنَٰتٞ مَّقَامُ إِبۡرَٰهِيمَۖ وَمَن دَخَلَهُۥ كَانَ ءَامِنٗاۗ وَلِلَّهِ عَلَى ٱلنَّاسِ حِجُّ ٱلۡبَيۡتِ مَنِ ٱسۡتَطَاعَ إِلَيۡهِ سَبِيلٗاۚ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنِ ٱلۡعَٰلَمِينَ ٧٩"
    },
    {
      "number": 391,
      "text": "قُلْ يَا أَهْلَ الْكِتَابِ لِمَ تَكْفُرُونَ بِآيَاتِ اللَّهِ وَاللَّهُ شَهِيدٌ عَلَىٰ مَا تَعْمَلُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 98,
      "juz": 4,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 25,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَٱللَّهُ شَهِيدٌ عَلَىٰ مَا تَعۡمَلُونَ ٨٩\n                                    \n                                    \n                                    هذا تعنيف من الله تعالى لكفرة أهل الكتاب ، على عنادهم للحق ، وكفرهم بآيات الله ، وصدهم عن سبيله من أراده من أهل الإيمان بجهدهم وطاقتهم مع علمهم بأن ما جاء به الرسول حق من الله ، بما عندهم من العلم عن الأنبياء الأقدمين ، والسادة المرسلين ، صلوات الله وسلامه عليهم أجمعين ، وما بشروا به ونوهوا ، من ذكر النبي [ صلى الله عليه وسلم ] الأمي الهاشمي العربي المكي ، سيد ولد آدم ، وخاتم الأنبياء ، ورسول رب الأرض والسماء . وقد توعدهم [ الله ] تعالى على ذلك بأنه شهيد على صنيعهم ذلك بما خالفوا ما بأيديهم عن الأنبياء ، ومقابلتهم الرسول المبشر بالتكذيب والجحود والعناد ، وأخبر تعالى أنه ليس بغافل عما يعملون ، أي : وسيجزيهم على ذلك يوم لا ينفعهم مال ولا بنون .\n                                    ",
        "qortoby": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَٱللَّهُ شَهِيدٌ عَلَىٰ مَا تَعۡمَلُونَ ٨٩\n                                    \n                                    \n                                    قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَٱللَّهُ شَهِيدٌ عَلَىٰ مَا تَعۡمَلُونَ ٨٩\n                                    ",
        "saadi": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَٱللَّهُ شَهِيدٌ عَلَىٰ مَا تَعۡمَلُونَ ٨٩\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 98 الى 101 :ـ يوبخ تعالى أهل الكتاب من اليهود والنصارى على كفرهم بآيات الله التي أنزلها الله على رسله، التي جعلها رحمة لعباده يهتدون بها إليه، ويستدلون بها على جميع المطالب المهمة والعلوم النافعة، فهؤلاء الكفرة جمعوا بين الكفر بها وصد من آمن بالله عنها وتحريفها وتعويجها عما جعلت له، وهم شاهدون بذلك عالمون بأن ما فعلوه أعظم الكفر الموجب لأعظم العقوبة { الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون } فلهذا توعدهم هنا بقوله: { وما الله بغافل عما تعملون } بل محيط بأعمالكم ونياتكم ومكركم السيء، فمجازيكم عليه أشر الجزاء لما توعدهم ووبخهم عطف برحمته وجوده وإحسانه وحذر عباده المؤمنين منهم لئلا يمكروا بهم من حيث لا يشعرون، فقال: { يا أيها الذين آمنوا إن تطيعوا فريقا من الذين أوتوا الكتاب يردوكم بعد إيمانكم كافرين } وذلك لحسدهم وبغيهم عليكم، وشدة حرصهم على ردكم عن دينكم، كما قال تعالى: { ود كثير من أهل الكتاب لو يردونكم من بعد إيمانكم كفارا حسدا من عند أنفسهم من بعد ما تبين لهم الحق } ثم ذكر تعالى السبب الأعظم والموجب الأكبر لثبات المؤمنين على إيمانهم، وعدم تزلزلهم عن إيقانهم، وأن ذلك من أبعد الأشياء، فقال: { وكيف تكفرون وأنتم تتلى عليكم آيات الله وفيكم رسوله } أي: الرسول بين أظهركم يتلو عليكم آيات ربكم كل وقت، وهي الآيات البينات التي توجب القطع بموجبها والجزم بمقتضاها وعدم الشك فيما دلت عليه بوجه من الوجوه، خصوصا والمبين لها أفضل الخلق وأعلمهم وأفصحهم وأنصحهم وأرأفهم بالمؤمنين، الحريص على هداية الخلق وإرشادهم بكل طريق يقدر عليه، فصلوات الله وسلامه عليه، فلقد نصح وبلغ البلاغ المبين، فلم يبق في نفوس القائلين مقالا ولم يترك لجائل في طلب الخير مجالا، ثم أخبر أن من اعتصم به فتوكل عليه وامتنع بقوته ورحمته عن كل شر، واستعان به على كل خير { فقد هدي إلى صراط مستقيم } موصل له إلى غاية المرغوب، لأنه جمع بين اتباع الرسول في أقواله وأفعاله وأحواله وبين الاعتصام بالله.\n                                    "
      },
      "originalText": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَكۡفُرُونَ بِ‍َٔايَٰتِ ٱللَّهِ وَٱللَّهُ شَهِيدٌ عَلَىٰ مَا تَعۡمَلُونَ ٨٩"
    },
    {
      "number": 392,
      "text": "قُلْ يَا أَهْلَ الْكِتَابِ لِمَ تَصُدُّونَ عَنْ سَبِيلِ اللَّهِ مَنْ آمَنَ تَبْغُونَهَا عِوَجًا وَأَنْتُمْ شُهَدَاءُ ۗ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 99,
      "juz": 4,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 25,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنۡ ءَامَنَ تَبۡغُونَهَا عِوَجٗا وَأَنتُمۡ شُهَدَآءُۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٩٩\n                                    \n                                    \n                                    هذا تعنيف من الله تعالى لكفرة أهل الكتاب ، على عنادهم للحق ، وكفرهم بآيات الله ، وصدهم عن سبيله من أراده من أهل الإيمان بجهدهم وطاقتهم مع علمهم بأن ما جاء به الرسول حق من الله ، بما عندهم من العلم عن الأنبياء الأقدمين ، والسادة المرسلين ، صلوات الله وسلامه عليهم أجمعين ، وما بشروا به ونوهوا ، من ذكر النبي [ صلى الله عليه وسلم ] الأمي الهاشمي العربي المكي ، سيد ولد آدم ، وخاتم الأنبياء ، ورسول رب الأرض والسماء . وقد توعدهم [ الله ] تعالى على ذلك بأنه شهيد على صنيعهم ذلك بما خالفوا ما بأيديهم عن الأنبياء ، ومقابلتهم الرسول المبشر بالتكذيب والجحود والعناد ، وأخبر تعالى أنه ليس بغافل عما يعملون ، أي : وسيجزيهم على ذلك يوم لا ينفعهم مال ولا بنون .\n                                    ",
        "qortoby": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنۡ ءَامَنَ تَبۡغُونَهَا عِوَجٗا وَأَنتُمۡ شُهَدَآءُۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٩٩\n                                    \n                                    \n                                    قل يا أهل الكتاب لم تصدون عن سبيل الله من آمن تبغونها عوجا وأنتم شهداء وما الله بغافل عما تعملون\nقوله تعالى : قل يا أهل الكتاب لم تصدون عن سبيل الله أي تصرفون عن دين الله من آمن وقرأ الحسن \" تصدون \" بضم التاء وكسر الصاد وهما لغتان : صد وأصد ; مثل صل اللحم وأصل إذا أنتن ، وخم وأخم أيضا إذا تغير . تبغونها عوجا تطلبون لها ، فحذف اللام ; مثل وإذا كالوهم يقال : بغيت له كذا أي طلبته . وأبغيته كذا أي أعنته . والعوج : الميل والزيغ ( بكسر العين ) في الدين والقول والعمل وما خرج عن طريق الاستواء . و ( بالفتح ) في الحائط والجدار وكل شخص قائم ; عن أبي عبيدة وغيره . ومعنى قوله تعالى : يتبعون الداعي لا عوج له أي لا يقدرون أن يعوجوا عن دعائه . وعاج بالمكان وعوج أقام ووقف . والعائج الواقف ; قال الشاعر :\nهل أنتم عائجون بنا لعنا نرى العرصات أو أثر الخيام\nوالرجل الأعوج : السيئ الخلق ، وهو بين العوج . والعوج من الخيل التي في أرجلها تحنيب . والأعوجية من الخيل تنسب إلى فرس كان في الجاهلية سابقا . ويقال : فرس محنب إذا كان بعيد ما بين الرجلين بغير فحج ، وهو مدح . ويقال : الحنب اعوجاج في الساقين . قال الخليل التحنيب يوصف في الشدة ، وليس ذلك باعوجاج .\nقوله تعالى : وأنتم شهداء أي عقلاء . وقيل : شهداء أن في التوراة مكتوبا أن دين الله الذي لا يقبل غيره الإسلام ، إذ فيه نعت محمد - صلى الله عليه وسلم .\n                                    ",
        "saadi": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنۡ ءَامَنَ تَبۡغُونَهَا عِوَجٗا وَأَنتُمۡ شُهَدَآءُۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٩٩\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 98 الى 101 :ـ يوبخ تعالى أهل الكتاب من اليهود والنصارى على كفرهم بآيات الله التي أنزلها الله على رسله، التي جعلها رحمة لعباده يهتدون بها إليه، ويستدلون بها على جميع المطالب المهمة والعلوم النافعة، فهؤلاء الكفرة جمعوا بين الكفر بها وصد من آمن بالله عنها وتحريفها وتعويجها عما جعلت له، وهم شاهدون بذلك عالمون بأن ما فعلوه أعظم الكفر الموجب لأعظم العقوبة { الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون } فلهذا توعدهم هنا بقوله: { وما الله بغافل عما تعملون } بل محيط بأعمالكم ونياتكم ومكركم السيء، فمجازيكم عليه أشر الجزاء لما توعدهم ووبخهم عطف برحمته وجوده وإحسانه وحذر عباده المؤمنين منهم لئلا يمكروا بهم من حيث لا يشعرون، فقال: { يا أيها الذين آمنوا إن تطيعوا فريقا من الذين أوتوا الكتاب يردوكم بعد إيمانكم كافرين } وذلك لحسدهم وبغيهم عليكم، وشدة حرصهم على ردكم عن دينكم، كما قال تعالى: { ود كثير من أهل الكتاب لو يردونكم من بعد إيمانكم كفارا حسدا من عند أنفسهم من بعد ما تبين لهم الحق } ثم ذكر تعالى السبب الأعظم والموجب الأكبر لثبات المؤمنين على إيمانهم، وعدم تزلزلهم عن إيقانهم، وأن ذلك من أبعد الأشياء، فقال: { وكيف تكفرون وأنتم تتلى عليكم آيات الله وفيكم رسوله } أي: الرسول بين أظهركم يتلو عليكم آيات ربكم كل وقت، وهي الآيات البينات التي توجب القطع بموجبها والجزم بمقتضاها وعدم الشك فيما دلت عليه بوجه من الوجوه، خصوصا والمبين لها أفضل الخلق وأعلمهم وأفصحهم وأنصحهم وأرأفهم بالمؤمنين، الحريص على هداية الخلق وإرشادهم بكل طريق يقدر عليه، فصلوات الله وسلامه عليه، فلقد نصح وبلغ البلاغ المبين، فلم يبق في نفوس القائلين مقالا ولم يترك لجائل في طلب الخير مجالا، ثم أخبر أن من اعتصم به فتوكل عليه وامتنع بقوته ورحمته عن كل شر، واستعان به على كل خير { فقد هدي إلى صراط مستقيم } موصل له إلى غاية المرغوب، لأنه جمع بين اتباع الرسول في أقواله وأفعاله وأحواله وبين الاعتصام بالله.\n                                    "
      },
      "originalText": "قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَصُدُّونَ عَن سَبِيلِ ٱللَّهِ مَنۡ ءَامَنَ تَبۡغُونَهَا عِوَجٗا وَأَنتُمۡ شُهَدَآءُۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ ٩٩"
    },
    {
      "number": 393,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تُطِيعُوا فَرِيقًا مِنَ الَّذِينَ أُوتُوا الْكِتَابَ يَرُدُّوكُمْ بَعْدَ إِيمَانِكُمْ كَافِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 100,
      "juz": 4,
      "manzil": 1,
      "page": 62,
      "ruku": 51,
      "hizbQuarter": 25,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تُطِيعُواْ فَرِيقٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ يَرُدُّوكُم بَعۡدَ إِيمَٰنِكُمۡ كَٰفِرِينَ ٠٠١\n                                    \n                                    \n                                    يحذر تعالى عباده المؤمنين عن أن يطيعوا طائفة من الذين أوتوا الكتاب ، الذين يحسدون المؤمنين على ما آتاهم الله من فضله ، وما منحهم به من إرسال رسوله كما قال تعالى : ( ود كثير من أهل الكتاب لو يردونكم من بعد إيمانكم كفارا حسدا من عند أنفسهم ) [ البقرة : 109 ] وهكذا قال هاهنا : ( إن تطيعوا فريقا من الذين أوتوا الكتاب يردوكم بعد إيمانكم كافرين ) ثم قال\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تُطِيعُواْ فَرِيقٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ يَرُدُّوكُم بَعۡدَ إِيمَٰنِكُمۡ كَٰفِرِينَ ٠٠١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا إن تطيعوا فريقا من الذين أوتوا الكتاب يردوكم بعد إيمانكم كافرين\nنزلت في يهودي أراد تجديد الفتنة بين الأوس والخزرج بعد انقطاعها بالنبي - صلى الله عليه وسلم - فجلس بينهم وأنشدهم شعرا قاله أحد الحيين في حربهم . فقال الحي الآخر : قد قال شاعرنا في يوم كذا وكذا ، فكأنهم دخلهم من ذلك شيء ، فقالوا : تعالوا نرد الحرب جذعاء كما كانت . فنادى هؤلاء : يا آل أوس . ونادى هؤلاء . يا آل خزرج ; فاجتمعوا وأخذوا السلاح واصطفوا للقتال فنزلت هذه الآية ; فجاء النبي - صلى الله عليه وسلم - حتى وقف بين الصفين فقرأها ورفع صوته ، فلما سمعوا صوته أنصتوا له وجعلوا يستمعون ، فلما فرغ ألقوا السلاح وعانق بعضهم بعضا وجعلوا يبكون ; عن عكرمة وابن زيد وابن عباس . والذي فعل ذلك شاس بن قيس اليهودي ، دس على الأوس والخزرج من يذكرهم ما كان بينهم من الحروب ، وأن النبي - صلى الله عليه وسلم - أتاهم وذكرهم ، فعرف القوم أنها نزغة من الشيطان ، وكيد من عدوهم ; فألقوا السلاح من أيديهم وبكوا وعانق بعضهم بعضا ، ثم انصرفوا مع النبي - صلى الله عليه وسلم - سامعين مطيعين ; فأنزل الله عز وجل يا أيها الذين آمنوا يعني الأوس والخزرج . إن تطيعوا فريقا من الذين أوتوا الكتاب يعني شاسا وأصحابه يردوكم بعد إيمانكم كافرين قال جابر بن عبد الله : ما كان طالع أكره إلينا من رسول الله - صلى الله عليه وسلم - فأومأ إلينا بيده فكففنا وأصلح الله تعالى ما بيننا ; فما كان شخص أحب إلينا من رسول الله - صلى الله عليه وسلم - فما رأيت يوما أقبح ولا أوحش أولا وأحسن آخرا من ذلك اليوم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تُطِيعُواْ فَرِيقٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ يَرُدُّوكُم بَعۡدَ إِيمَٰنِكُمۡ كَٰفِرِينَ ٠٠١\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 98 الى 101 :ـ يوبخ تعالى أهل الكتاب من اليهود والنصارى على كفرهم بآيات الله التي أنزلها الله على رسله، التي جعلها رحمة لعباده يهتدون بها إليه، ويستدلون بها على جميع المطالب المهمة والعلوم النافعة، فهؤلاء الكفرة جمعوا بين الكفر بها وصد من آمن بالله عنها وتحريفها وتعويجها عما جعلت له، وهم شاهدون بذلك عالمون بأن ما فعلوه أعظم الكفر الموجب لأعظم العقوبة { الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون } فلهذا توعدهم هنا بقوله: { وما الله بغافل عما تعملون } بل محيط بأعمالكم ونياتكم ومكركم السيء، فمجازيكم عليه أشر الجزاء لما توعدهم ووبخهم عطف برحمته وجوده وإحسانه وحذر عباده المؤمنين منهم لئلا يمكروا بهم من حيث لا يشعرون، فقال: { يا أيها الذين آمنوا إن تطيعوا فريقا من الذين أوتوا الكتاب يردوكم بعد إيمانكم كافرين } وذلك لحسدهم وبغيهم عليكم، وشدة حرصهم على ردكم عن دينكم، كما قال تعالى: { ود كثير من أهل الكتاب لو يردونكم من بعد إيمانكم كفارا حسدا من عند أنفسهم من بعد ما تبين لهم الحق } ثم ذكر تعالى السبب الأعظم والموجب الأكبر لثبات المؤمنين على إيمانهم، وعدم تزلزلهم عن إيقانهم، وأن ذلك من أبعد الأشياء، فقال: { وكيف تكفرون وأنتم تتلى عليكم آيات الله وفيكم رسوله } أي: الرسول بين أظهركم يتلو عليكم آيات ربكم كل وقت، وهي الآيات البينات التي توجب القطع بموجبها والجزم بمقتضاها وعدم الشك فيما دلت عليه بوجه من الوجوه، خصوصا والمبين لها أفضل الخلق وأعلمهم وأفصحهم وأنصحهم وأرأفهم بالمؤمنين، الحريص على هداية الخلق وإرشادهم بكل طريق يقدر عليه، فصلوات الله وسلامه عليه، فلقد نصح وبلغ البلاغ المبين، فلم يبق في نفوس القائلين مقالا ولم يترك لجائل في طلب الخير مجالا، ثم أخبر أن من اعتصم به فتوكل عليه وامتنع بقوته ورحمته عن كل شر، واستعان به على كل خير { فقد هدي إلى صراط مستقيم } موصل له إلى غاية المرغوب، لأنه جمع بين اتباع الرسول في أقواله وأفعاله وأحواله وبين الاعتصام بالله.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تُطِيعُواْ فَرِيقٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ يَرُدُّوكُم بَعۡدَ إِيمَٰنِكُمۡ كَٰفِرِينَ ٠٠١"
    }
  ]
}