{
  "number": 66,
  "ayahsNumber": 11,
  "ayahs": [
    {
      "number": 415,
      "text": "إِذْ هَمَّتْ طَائِفَتَانِ مِنْكُمْ أَنْ تَفْشَلَا وَاللَّهُ وَلِيُّهُمَا ۗ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 122,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 54,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ هَمَّت طَّآئِفَتَانِ مِنكُمۡ أَن تَفۡشَلَا وَٱللَّهُ وَلِيُّهُمَاۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٢٢١\n                                    \n                                    \n                                    وقوله : ( إذ همت طائفتان منكم أن تفشلا [ والله وليهما وعلى الله فليتوكل المؤمنون ] ) قال البخاري : حدثنا علي بن عبد الله ، حدثنا سفيان قال : قال عمرو : سمعت جابر بن عبد الله يقول : فينا نزلت : ( إذ همت طائفتان منكم أن تفشلا [ والله وليهما وعلى الله فليتوكل المؤمنون ] ) قال : نحن الطائفتان بنو حارثة وبنو سلمة ، وما نحب - وقال سفيان مرة : وما يسرني - أنها لم تنزل ، لقول الله تعالى : ( والله وليهما ) .\nوكذا رواه مسلم من حديث سفيان بن عيينة به . وكذا قال غير واحد من السلف : إنهم بنو حارثة وبنو سلمة .\n                                    ",
        "qortoby": "إِذۡ هَمَّت طَّآئِفَتَانِ مِنكُمۡ أَن تَفۡشَلَا وَٱللَّهُ وَلِيُّهُمَاۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٢٢١\n                                    \n                                    \n                                    قوله تعالى : إذ همت طائفتان منكم أن تفشلا والله وليهما وعلى الله فليتوكل المؤمنون\nالعامل في \" إذ - تبوئ \" أو \" سميع عليم \" . والطائفتان : بنو سلمة من الخزرج ، وبنو حارثة من الأوس ، وكانا جناحي العسكر يوم أحد . ومعنى أن تفشلا أن تجبنا . وفي البخاري عن جابر قال : فينا نزلت إذ همت طائفتان منكم أن تفشلا والله وليهما قال : نحن الطائفتان : بنو حارثة وبنو سلمة ، وما نحب أنها لم تنزل ; لقول الله عز وجل : والله وليهما . وقيل : هم بنو الحارث وبنو الخزرج وبنو النبيت ، والنبيت هو عمرو بن مالك من بني الأوس . والفشل عبارة عن الجبن ; وكذلك هو في اللغة . والهم من الطائفتين كان بعد الخروج لما رجع عبد الله بن أبي بمن معه من المنافقين فحفظ الله قلوبهم فلم يرجعوا ; فذلك قوله تعالى : والله وليهما يعني حافظ قلوبهما عن تحقيق هذا الهم . وقيل : أرادوا التقاعد عن الخروج ، وكان ذلك صغيرة منهم . وقيل : كان ذلك حديث نفس منهم خطر ببالهم فأطلع الله نبيه عليه السلام عليه فازدادوا بصيرة ; ولم يكن ذلك الخور مكتسبا لهم فعصمهم الله ، وذم بعضهم بعضا ، ونهضوا مع النبي - صلى الله عليه وسلم - فمضى رسول الله - صلى الله عليه وسلم - حتى أطل على المشركين ، وكان خروجه من المدينة في ألف ، فرجع عنه عبد الله بن أبي بن سلول بثلاثمائة رجل مغاضبا ; إذ خولف رأيه حين أشار بالقعود والقتال في المدينة إن نهض إليهم العدو ، وكان رأيه وافق رأي رسول الله - صلى الله عليه وسلم - وأبى ذلك أكثر الأنصار ، وسيأتي . ونهض رسول الله - صلى الله عليه وسلم - بالمسلمين فاستشهد منهم من أكرمه الله بالشهادة . قال مالك رحمه الله : قتل من المهاجرين يوم أحد أربعة ، ومن الأنصار سبعون رضي الله عنهم . والمقاعد : جمع مقعد وهو مكان القعود ، وهذا بمنزلة مواقف ، ولكن لفظ القعود دال على الثبوت ; ولا سيما أن الرماة كانوا قعودا . هذا معنى حديث غزاة أحد على الاختصار ، وسيأتي من تفصيلها ما فيه شفاء . وكان مع المشركين يومئذ مائة فرس عليها خالد بن الوليد ، ولم يكن مع المسلمين يومئذ فرس . وفيها جرح رسول الله - صلى الله عليه وسلم - في وجهه وكسرت رباعيته اليمنى السفلى بحجر وهشمت البيضة من على رأسه - صلى الله عليه وسلم - وجزاه عن أمته بأفضل ما جزى به نبيا من أنبيائه على صبره . وكان الذي تولى ذلك من النبي - صلى الله عليه وسلم - عمرو بن قميئة الليثي ، وعتبة بن أبي وقاص . وقد قيل : إن عبد الله بن شهاب جد الفقيه محمد بن مسلم بن شهاب هو الذي شج رسول الله - صلى الله عليه وسلم - في جبهته . قال الواقدي : والثابت عندنا أن الذي رمى في وجه النبي - صلى الله عليه وسلم - ابن قميئة ، والذي أدمى شفته وأصاب رباعيته عتبة بن أبي وقاص . قال الواقدي بإسناده عن نافع بن جبير قال : سمعت رجلا من المهاجرين يقول : شهدت أحدا فنظرت إلى النبل تأتي من كل ناحية ورسول الله - صلى الله عليه وسلم - وسطها كل ذلك يصرف عنه . ولقد رأيت عبد الله بن شهاب الزهري يقول يومئذ دلوني على محمد دلوني على محمد ، فلا نجوت إن نجا . وإن رسول الله - صلى الله عليه وسلم - إلى جنبه ما معه أحد ثم جاوزه ، فعاتبه في ذلك صفوان فقال : والله ما رأيته ، أحلف بالله إنه منا ممنوع ! خرجنا أربعة فتعاهدنا وتعاقدنا على قتله فلم نخلص إلى ذلك . وأكبت الحجارة على رسول الله - صلى الله عليه وسلم - حتى سقط في حفرة ، كان أبو عامر الراهب قد حفرها مكيدة للمسلمين ، فخر عليه السلام على جنبه واحتضنه طلحة حتى قام ، ومص مالك بن سنان والد أبي سعيد الخدري من جرح رسول الله - صلى الله عليه وسلم - الدم ، ونشبت حلقتان من درع المغفر في وجهه - صلى الله عليه وسلم - فانتزعهما أبو عبيدة بن الجراح وعض عليهما بثنيته فسقطتا ; فكان أهتم يزينه هتمه - رضي الله عنه - . وفي هذه الغزاة قتل حمزة - رضي الله عنه - ، قتله وحشي ، وكان وحشي مملوكا لجبير بن مطعم . وقد كان جبير قال له : إن قتلت محمدا جعلنا لك أعنة الخيل ، وإن أنت قتلت علي بن أبي طالب جعلنا لك مائة ناقة كلها سود الحدق ، وإن أنت قتلت حمزة فأنت حر . فقال وحشي : أما محمد فعليه حافظ من الله لا يخلص إليه أحد . وأما علي ما برز إليه أحد إلا قتله . وأما حمزة فرجل شجاع ، وعسى أن أصادفه فأقتله . وكانت هند كلما تهيأ وحشي أو مرت به قالت : إيها أبا دسمة اشف واستشف . فكمن له خلف صخرة ، وكان حمزة حمل على القوم من المشركين ; فلما رجع من حملته ومر بوحشي زرقه بالمزراق فأصابه فسقط ميتا رحمه الله ورضي عنه . قال ابن إسحاق : فبقرت هند عن كبد حمزة فلاكتها ولم تستطع أن تسيغها فلفظتها ثم علت على صخرة مشرفة فصرخت بأعلى صوتها فقالت :\nنحن جزيناكم بيوم بدر والحرب بعد الحرب ذات سعر ما كان عن عتبة لي من صبر\nولا أخي وعمه وبكري شفيت نفسي وقضيت نذري\nشفيت وحشي غليل صدري فشكر وحشي علي عمري\nحتى ترم أعظمي في قبري\nفأجابتها هند بنت أثاثة بن عباد بن عبد المطلب فقالت :\nخزيت في بدر وبعد بدر يا بنت وقاع عظيم الكفر\nصبحك الله غداة الفجر ملهاشميين الطوال الزهر\nبكل قطاع حسام يفري حمزة ليثي وعلي صقري\nإذ رام شيب وأبوك غدري فخضبا منه ضواحي النحر\nونذرك السوء فشر نذر\nوقال عبد الله بن رواحة يبكي حمزة - رضي الله عنه - :\nبكت عيني وحق لها بكاها وما يغني البكاء ولا العويل\nعلى أسد الإله غداة قالوا أحمزة ذاكم الرجل القتيل\nأصيب المسلمون به جميعا هناك وقد أصيب به الرسول\nأبا يعلى لك الأركان هدت وأنت الماجد البر الوصول\nعليك سلام ربك في جنان مخالطها نعيم لا يزول\nألا يا هاشم الأخيار صبرا فكل فعالكم حسن جميل\nرسول الله مصطبر كريم بأمر الله ينطق إذ يقول\nألا من مبلغ عني لؤيا فبعد اليوم دائلة تدول\nوقبل اليوم ما عرفوا وذاقوا وقائعنا بها يشفى الغليل\nنسيتم ضربنا بقليب بدر غداة أتاكم الموت العجيل\nغداة ثوى أبو جهل صريعا عليه الطير حائمة تجول\nوعتبة وابنه خرا جميعا وشيبة عضه السيف الصقيل\nومتركنا أمية مجلعبا وفي حيزومه لدن نبيل\nوهام بني ربيعة سائلوها ففي أسيافنا منها فلول\nألا يا هند لا تبدي شماتا بحمزة إن عزكم ذليل\nألا يا هند فابكي لا تملي فأنت الواله العبرى الهبول\nورثته أيضا أخته صفية ، وذلك مذكور في السيرة ، رضي الله عنهم أجمعين .\nقوله تعالى : وعلى الله فليتوكل المؤمنون فيه مسألة واحدة ، وهي بيان التوكل . والتوكل في اللغة إظهار العجز والاعتماد على الغير . وواكل فلان إذا ضيع أمره متكلا على غيره .\nواختلف العلماء في حقيقة التوكل ; فسئل عنه سهل بن عبد الله فقال : قالت فرقة الرضا بالضمان ، وقطع الطمع من المخلوقين . وقال قوم : التوكل ترك الأسباب والركون إلى مسبب الأسباب ; فإذا شغله السبب عن المسبب زال عنه اسم التوكل . قال سهل : من قال إن التوكل يكون بترك السبب فقد طعن في سنة رسول الله - صلى الله عليه وسلم - لأن الله عز وجل يقول : فكلوا مما غنمتم حلالا طيبا فالغنيمة اكتساب . وقال تعالى : فاضربوا فوق الأعناق واضربوا منهم كل بنان فهذا عمل . وقال النبي - صلى الله عليه وسلم - إن الله يحب العبد المحترف . وكان أصحاب رسول الله - صلى الله عليه وسلم - يقرضون على السرية . وقال غيره : وهذا قول عامة الفقهاء ، وأن التوكل على الله هو الثقة بالله والإيقان بأن قضاءه ماض ، واتباع سنة نبيه - صلى الله عليه وسلم - في السعي فيما لا بد منه من الأسباب من مطعم ومشرب وتحرز من عدو وإعداد الأسلحة واستعمال ما تقتضيه سنة الله تعالى المعتادة . وإلى هذا ذهب محققو الصوفية ، لكنه لا يستحق اسم التوكل عندهم مع الطمأنينة إلى تلك الأسباب والالتفات إليها بالقلوب ; فإنها لا تجلب نفعا ولا تدفع ضرا ، بل السبب والمسبب فعل الله تعالى ، والكل منه وبمشيئته ; ومتى وقع من المتوكل ركون إلى تلك الأسباب فقد انسلخ عن ذلك الاسم . ثم المتوكلون على حالين : الأول : حال المتمكن في التوكل فلا يلتفت إلى شيء من تلك الأسباب بقلبه ، ولا يتعاطاه إلا بحكم الأمر . الثاني : حال غير المتمكن وهو الذي يقع له الالتفات إلى تلك الأسباب أحيانا غير أنه يدفعها عن نفسه بالطرق العلمية ، والبراهين القطعية ، والأذواق الحالية ; فلا يزال كذلك إلى أن يرقيه الله بجوده إلى مقام المتوكلين المتمكنين ، ويلحقه بدرجات العارفين .\n                                    ",
        "saadi": "إِذۡ هَمَّت طَّآئِفَتَانِ مِنكُمۡ أَن تَفۡشَلَا وَٱللَّهُ وَلِيُّهُمَاۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٢٢١\n                                        \n                                        \n                                        \n                                        ومن لطفه بهم وإحسانه إليهم أنه، لما { همت طائفتان } من المؤمنين بالفشل وهم بنو سلمة وبنو حارثة كما تقدم ثبتهما الله تعالى نعمة عليهما وعلى سائر المؤمنين، فلهذا قال { والله وليهما } أي: بولايته الخاصة، التي هي لطفه بأوليائه، وتوفيقهم لما فيه صلاحهم وعصمتهم عما فيه مضرتهم، فمن توليه لهما أنهما لما هما بهذه المعصية العظيمة وهي الفشل والفرار عن رسول الله عصمهما، لما معهما من الإيمان كما قال تعالى: { الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور } ثم قال { وعلى الله فليتوكل المؤمنون } ففيها الأمر بالتوكل الذي هو اعتماد القلب على الله في جلب المنافع ودفع المضار، مع الثقة بالله، وأنه بحسب إيمان العبد يكون توكله، وأن المؤمنين أولى بالتوكل على الله من غيرهم، وخصوصا في مواطن الشدة والقتال، فإنهم مضطرون إلى التوكل والاستعانة بربهم والاستنصار له، والتبري من حولهم وقوتهم، والاعتماد على حول الله وقوته، فبذلك ينصرهم ويدفع عنهم البلايا والمحن، ثم قال تعالى:\n                                    "
      },
      "originalText": "إِذۡ هَمَّت طَّآئِفَتَانِ مِنكُمۡ أَن تَفۡشَلَا وَٱللَّهُ وَلِيُّهُمَاۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٢٢١"
    },
    {
      "number": 416,
      "text": "وَلَقَدْ نَصَرَكُمُ اللَّهُ بِبَدْرٍ وَأَنْتُمْ أَذِلَّةٌ ۖ فَاتَّقُوا اللَّهَ لَعَلَّكُمْ تَشْكُرُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 123,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 54,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ نَصَرَكُمُ ٱللَّهُ بِبَدۡرٖ وَأَنتُمۡ أَذِلَّةٞۖ فَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تَشۡكُرُونَ ٣٢١\n                                    \n                                    \n                                    وقوله : ( ولقد نصركم الله ببدر وأنتم أذلة فاتقوا الله لعلكم تشكرون ) أي : يوم بدر ، وكان في جمعة وافق السابع عشر من رمضان ، من سنة اثنتين من الهجرة ، وهو يوم الفرقان الذي أعز الله فيه الإسلام وأهله ، ودمغ فيه الشرك وخرب محله ، [ هذا ] مع قلة عدد المسلمين يومئذ ، فإنهم كانوا ثلاثمائة وثلاثة عشر رجلا فيهم فرسان وسبعون بعيرا ، والباقون مشاة ، ليس معهم من العدد جميع ما يحتاجون إليه ، وكان العدو يومئذ ما بين التسعمائة إلى الألف في سوابغ الحديد والبيض ، والعدة الكاملة والخيول المسومة والحلي الزائد ، فأعز الله رسوله ، وأظهر وحيه وتنزيله ، وبيض وجه النبي وقبيله ، وأخزى الشيطان وجيله ولهذا قال تعالى - ممتنا على عباده المؤمنين وحزبه المتقين : ( ولقد نصركم الله ببدر وأنتم أذلة ) أي : قليل عددكم ليعلموا أن النصر إنما هو من عند الله ، لا بكثرة العدد والعدد ، ولهذا قال في الآية الأخرى : ( ويوم حنين إذ أعجبتكم كثرتكم فلم تغن عنكم شيئا [ وضاقت عليكم الأرض بما رحبت ثم وليتم مدبرين ثم أنزل الله سكينته على رسوله وعلى المؤمنين وأنزل جنودا لم تروها وعذب الذين كفروا وذلك جزاء الكافرين ثم يتوب الله من بعد ذلك على من يشاء ] والله غفور رحيم ) [ التوبة : 25 - 27 ] .\nوقال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن سماك قال : سمعت عياضا الأشعري قال : شهدت اليرموك وعلينا خمسة أمراء : أبو عبيدة ، ويزيد بن أبي سفيان ، وابن حسنة ، وخالد بن الوليد ، وعياض - وليس عياض هذا الذي حدث سماكا - قال : وقال عمر ، رضي الله عنه : إذا كان قتال فعليكم أبو عبيدة . قال : فكتبنا إليه إنه قد جاش إلينا الموت ، واستمددناه ، فكتب إلينا : إنه قد جاءني كتابكم تستمدونني وإني أدلكم على من هو أعز نصرا ، وأحصن جندا : الله عز وجل ، فاستنصروه ، فإن محمدا صلى الله عليه وسلم قد نصر يوم بدر في أقل من عدتكم ، فإذا جاءكم كتابي فقاتلوهم ولا تراجعوني . قال فقاتلناهم فهزمناهم أربعة فراسخ ، قال : وأصبنا أموالا فتشاورنا ، فأشار علينا عياض أن نعطي عن كل ذي رأس عشرة . قال : وقال أبو عبيدة : من يراهنني ؟ فقال شاب : أنا ، إن لم تغضب . قال : فسبقه ، فرأيت عقيصتي أبي عبيدة تنقزان وهو خلفه على فرس عري .\nوهذا إسناد صحيح وقد أخرجه ابن حبان في صحيحه من حديث بندار ، عن غندر ، بنحوه ، واختاره الحافظ الضياء المقدسي في كتابه .\nوبدر محلة بين مكة والمدينة ، تعرف ببئرها ، منسوبة إلى رجل حفرها يقال له : \" بدر بن النارين \" . قال الشعبي : بدر بئر لرجل يسمى بدرا .\nوقوله : ( فاتقوا الله لعلكم تشكرون ) أي : تقومون بطاعته .\n                                    ",
        "qortoby": "وَلَقَدۡ نَصَرَكُمُ ٱللَّهُ بِبَدۡرٖ وَأَنتُمۡ أَذِلَّةٞۖ فَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تَشۡكُرُونَ ٣٢١\n                                    \n                                    \n                                    قوله تعالى : ولقد نصركم الله ببدر وأنتم أذلة فاتقوا الله لعلكم تشكرون\nفيه مسائل :\nالأولى : قوله تعالى : ولقد نصركم الله ببدر كانت بدر يوم سبعة عشر من رمضان ، يوم جمعة لثمانية عشر شهرا من الهجرة ، وبدر ماء هنالك وبه سمي الموضع . وقال الشعبي : كان ذلك الماء لرجل من جهينة يسمى بدرا ، وبه سمي الموضع . والأول أكثر . وقال الواقدي وغيره : بدر اسم لموضع غير منقول . وسيأتي في قصة بدر في \" الأنفال \" إن شاء الله تعالى . و ( أذلة ) معناها قليلون ; وذلك أنهم كانوا ثلاثمائة وثلاثة عشر أو أربعة عشر رجلا . وكان عددهم ما بين التسعمائة إلى الألف . وأذلة جمع ذليل . واسم الذل في هذا الموضع مستعار ، ولم يكونوا في أنفسهم إلا أعزة ، ولكن نسبتهم إلى عدوهم وإلى جميع الكفار في أقطار الأرض تقتضي عند التأمل ذلتهم وأنهم يغلبون . والنصر العون ; فنصرهم الله يوم بدر ، وقتل فيه صناديد المشركين ، وعلى ذلك اليوم ابتني الإسلام ، وكان أول قتال قاتله النبي - صلى الله عليه وسلم - . وفي صحيح مسلم عن بريدة قال : غزا رسول الله - صلى الله عليه وسلم - سبع عشرة غزوة ، قاتل في ثمان منهن . وفيه عن ابن إسحاق قال : لقيت زيد بن أرقم فقلت له : كم غزا رسول الله - صلى الله عليه وسلم - ؟ قال تسع عشرة غزوة . فقلت : فكم غزوت أنت معه ؟ فقال : سبع عشرة غزوة . قال فقلت : فما أول غزوة غزاها ؟ قال : ذات العسير أو العشير . وهذا كله مخالف لما عليه أهل التواريخ والسير . قال محمد بن سعد في كتاب الطبقات له : إن غزوات رسول الله - صلى الله عليه وسلم - سبع وعشرون غزوة ، وسراياه ست وخمسون ، وفي رواية ست وأربعون ، والتي قاتل فيها رسول الله - صلى الله عليه وسلم - : بدر وأحد والمريسيع والخندق وخيبر وقريظة والفتح وحنين والطائف . قال ابن سعد : هذا الذي اجتمع لنا عليه . وفي بعض الروايات أنه قاتل في بني النضير وفي وادي القرى منصرفه من خيبر وفي الغابة . وإذا تقرر هذا فنقول : زيد وبريدة إنما أخبر كل واحد منهما بما في علمه أو شاهده . وقول زيد : \" إن أول غزاة غزاها ذات العسيرة \" مخالف أيضا لما قال أهل التواريخ والسير . قال محمد بن سعد : كان قبل غزوة العشيرة ثلاث غزوات ، يعني غزاها بنفسه . وقال ابن عبد البر في كتاب الدرر في المغازي والسير . أول غزاة غزاها رسول الله - صلى الله عليه وسلم - غزوة ودان غزاها بنفسه في صفر ; وذلك أنه وصل إلى المدينة لاثنتي عشرة ليلة خلت من ربيع الأول ، أقام بها بقية ربيع الأول ، وباقي العام كله . إلى صفر من سنة اثنتين من الهجرة : ثم خرج في صفر المذكور واستعمل على المدينة سعد بن عبادة حتى بلغ ودان فوادع بني ضمرة ، ثم رجع إلى المدينة ولم يلق حربا ، وهي المسماة بغزوة الأبواء . ثم أقام بالمدينة إلى شهر ربيع الآخر من السنة المذكورة ، ثم خرج فيها واستعمل على المدينة السائب بن عثمان بن مظعون حتى بلغ بواط من ناحية رضوى ، ثم رجع إلى المدينة ولم يلق حربا ، ثم أقام بها بقية ربيع الآخر وبعض جمادى الأولى ، ثم خرج غازيا واستخلف على المدينة أبا سلمة بن عبد الأسد ، وأخذ على طريق ملك إلى العسيرة .\nقلت : ذكر ابن إسحاق عن عمار بن ياسر قال : كنت أنا وعلي بن أبي طالب رفيقين في غزوة العشيرة من بطن ينبع فلما نزلها رسول الله - صلى الله عليه وسلم - أقام بها شهرا فصالح بها بني مدلج وحلفاءهم من بني ضمرة فوادعهم ; فقال لي علي بن أبي طالب : هل لك أبا اليقظان أن تأتي هؤلاء - نفر من بني مدلج يعملون في عين لهم - ننظر كيف يعملون ؟ فأتيناهم فنظرنا إليهم ساعة ثم غشينا النوم فعمدنا إلى صور من النخل في دقعاء من الأرض فنمنا فيه ; فوالله ما أهبنا إلا رسول الله - صلى الله عليه وسلم - بقدمه ; فجلسنا وقد تتربنا من تلك الدقعاء فيومئذ قال رسول الله - صلى الله عليه وسلم - لعلي : ( ما بالك يا أبا تراب ) ; فأخبرناه بما كان من أمرنا فقال : ( ألا أخبركم بأشقى الناس رجلين ) قلنا : بلى يا رسول الله ; فقال : ( أحيمر ثمود الذي عقر الناقة ، والذي يضربك يا علي على هذه - ووضع رسول الله - صلى الله عليه وسلم - يده على رأسه - حتى يبل منها هذه ) ووضع يده على لحيته . فقال أبو عمر : فأقام بها بقية جمادى الأولى وليالي من جمادى الآخرة ، ووادع فيها بني مدلج ثم رجع ولم يلق حربا . ثم كانت بعد ذلك غزوة بدر الأولى بأيام قلائل ، هذا الذي لا يشك فيه أهل التواريخ والسير ، فزيد بن أرقم إنما أخبر عما عنده ، والله أعلم . ويقال : ذات العسير بالسين والشين ، ويزاد عليها هاء فيقال : العشيرة . ثم غزوة بدر الكبرى وهي أعظم المشاهد فضلا لمن شهدها ، وفيها أمد الله بملائكته نبيه والمؤمنين في قول جماعة العلماء ، وعليه يدل ظاهر الآية ، لا في يوم أحد . ومن قال : إن ذلك كان يوم أحد جعل قوله تعالى : ولقد نصركم الله ببدر إلى قوله : تشكرون اعتراضا بين الكلامين . هذا قول عامر الشعبي ، وخالفه الناس .\nوتظاهرت الروايات بأن الملائكة حضرت يوم بدر وقاتلت ; ومن ذلك قول أبي أسيد بن مالك بن ربيعة وكان شهيد بدر : لو كنت معكم الآن ببدر ومعي بصري لأريتكم الشعب الذي خرجت منه الملائكة ، لا أشك ولا أمتري . رواه عقيل عن الزهري عن أبي حازم سلمة بن دينار . قال ابن أبي حاتم : لا يعرف للزهري عن أبي حازم غير هذا الحديث الواحد ، وأبو أسيد يقال إنه آخر من مات من أهل بدر ; ذكره أبو عمر في الاستيعاب وغيره . وفي صحيح مسلم من حديث عمر بن الخطاب قال : لما كان يوم بدر نظر رسول الله - صلى الله عليه وسلم - إلى المشركين وهم ألف ، وأصحابه ثلاثمائة وتسعة عشر رجلا ، فاستقبل نبي الله - صلى الله عليه وسلم - القبلة ثم مد يديه فجعل يهتف بربه : ( اللهم أنجز لي ما وعدتني ، اللهم آت ما وعدتني ، اللهم إن تهلك هذه العصابة من أهل الإسلام لا تعبد في الأرض ) فما زال يهتف بربه مادا يديه مستقبل القبلة حتى سقط رداؤه عن منكبيه ، فأتاه أبو بكر فأخذ رداءه فألقاه على منكبيه ، ثم التزمه من ورائه وقال : يا نبي الله ، كفاك مناشدتك ربك ، فإنه سينجز لك ما وعدك ; فأنزل الله عز وجل : إذ تستغيثون ربكم فاستجاب لكم أني ممدكم بألف من الملائكة مردفين فأمده الله تعالى بالملائكة . قال أبو زميل : فحدثني ابن عباس قال : بينما رجل من المسلمين يومئذ يشتد في أثر رجل من المشركين أمامه إذ سمع ضربة بالسوط فوقه وصوت الفارس يقول : أقدم حيزوم ; فنظر إلى المشرك أمامه فخر مستلقيا ، فنظر إليه فإذا هو قد خطم أنفه وشق وجهه كضربة السوط فاخضر ذلك أجمع . فجاء الأنصاري فحدث بذلك رسول الله - صلى الله عليه وسلم - فقال : ( صدقت ذلك من مدد السماء الثالثة ) فقتلوا يومئذ سبعين وأسروا سبعين . وذكر الحديث . وسيأتي تمامه في آخر \" الأنفال \" إن شاء الله تعالى . فتظاهرت السنة والقرآن على ما قاله الجمهور ، والحمد لله . وعن خارجة بن إبراهيم عن أبيه قال : قال رسول الله - صلى الله عليه وسلم - لجبريل : ( من القائل يوم بدر من الملائكة أقدم حيزوم ؟ ) فقال جبريل : ( يا محمد ما كل أهل السماء أعرف ) . وعن علي - رضي الله عنه - أنه خطب الناس فقال : بينا أنا أمتح من قليب بدر جاءت ريح شديدة لم أر مثلها قط ، ثم ذهبت ، ثم جاءت ريح شديدة لم أر مثلها قط إلا التي كانت قبلها . قال : وأظنه ذكر : ثم جاءت ريح شديدة ، فكانت الريح الأولى جبريل نزل في ألف من الملائكة مع رسول الله - صلى الله عليه وسلم - وكانت الريح الثانية ميكائيل نزل في ألف من الملائكة عن يمين رسول الله - صلى الله عليه وسلم - وكان أبو بكر عن يمينه ، وكانت الريح الثالثة إسرافيل نزل في ألف من الملائكة عن ميسرة رسول الله - صلى الله عليه وسلم - وأنا في الميسرة . وعن سهل بن حنيف - رضي الله عنه - قال : لقد رأيتنا يوم بدر وأن أحدنا يشير بسيفه إلى رأس المشرك فيقع رأسه عن جسده قبل أن يصل إليه . وعن الربيع بن أنس قال : كان الناس يوم بدر يعرفون قتلى الملائكة ممن قتلوهم بضرب فوق الأعناق وعلى البنان مثل سمة النار قد أحرق به ; ذكر جميعه البيهقي رحمه الله . وقال بعضهم : إن الملائكة كانوا يقاتلون وكانت علامة ضربهم في الكفار ظاهرة ; لأن كل موضع أصابت ضربتهم اشتعلت النار في ذلك الموضع ، حتى إن أبا جهل قال لابن مسعود : أنت قتلتني ؟ إنما قتلني الذي لم يصل سناني إلى سنبك فرسه وإن اجتهدت . وإنما كانت الفائدة في كثرة الملائكة لتسكين قلوب المؤمنين ; ولأن الله تعالى جعل أولئك الملائكة مجاهدين إلى يوم القيامة ; فكل عسكر صبر واحتسب تأتيهم الملائكة ويقاتلون معهم . وقال ابن عباس ومجاهد : لم تقاتل الملائكة إلا يوم بدر ، وفيما سوى ذلك يشهدون ولا يقاتلون إنما يكونون عددا أو مددا . وقال بعضهم : إنما كانت الفائدة في كثرة الملائكة أنهم كانوا يدعون ويسبحون ، ويكثرون الذين يقاتلون يومئذ ; فعلى هذا لم تقاتل الملائكة يوم بدر وإنما حضروا للدعاء بالتثبيت ، والأول أكثر .\nقال قتادة : كان هذا يوم بدر ، أمدهم الله بألف ثم صاروا ثلاثة آلاف ، ثم صاروا خمسة آلاف ; فذلك قوله تعالى : إذ تستغيثون ربكم فاستجاب لكم أني ممدكم بألف من الملائكة مردفين وقوله : ألن يكفيكم أن يمدكم ربكم بثلاثة آلاف من الملائكة منزلين وقوله : بلى إن تصبروا وتتقوا ويأتوكم من فورهم هذا يمددكم ربكم بخمسة آلاف من الملائكة مسومين فصبر المؤمنون يوم بدر واتقوا الله فأمدهم الله بخمسة آلاف من الملائكة على ما وعدهم ; فهذا كله يوم بدر . وقال الحسن : فهؤلاء الخمسة آلاف ردء للمؤمنين إلى يوم القيامة . قال الشعبي : بلغ النبي - صلى الله عليه وسلم - وأصحابه يوم بدر أن كرز بن جابر المحاربي يريد أن يمد المشركين فشق ذلك على النبي - صلى الله عليه وسلم - وعلى المسلمين ;\n                                    ",
        "saadi": "وَلَقَدۡ نَصَرَكُمُ ٱللَّهُ بِبَدۡرٖ وَأَنتُمۡ أَذِلَّةٞۖ فَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تَشۡكُرُونَ ٣٢١\n                                        \n                                        \n                                        \n                                        وهذا امتنان منه على عباده المؤمنين، وتذكير لهم بما نصرهم به يوم بدر وهم أذلة في قلة عَددهم وعُددهم مع كثرة عدد عدوهم وعُددهم، وكانت وقعة بدر في السنة الثانية من الهجرة، خرج النبي صلى الله عليه وسلم من المدينة بثلاث مئة وبضعة عشر من أصحابه، ولم يكن معهم إلا سبعون بعيرا وفرسان لطلب عير لقريش قدمت من الشام، فسمع به المشركون فتجهزوا من مكة لفكاك عيرهم، وخرجوا في زهاء ألف مقاتل مع العدة الكاملة والسلاح العام والخيل الكثيرة، فالتقوا همم والمسلمون في ماء يقال له \"بدر\" بين مكة والمدينة فاقتتلوا، ونصر الله المسلمين نصرا عظيما، فقتلوا من المشركين سبعين قتيلا من صناديد المشركين وشجعانهم، وأسروا سبعين، واحتووا على معسكرهم ستأتي - إن شاء الله - القصة في سورة الأنفال، فإن ذلك موضعها، ولكن الله تعالى هنا أتى بها ليتذكر بها المؤمنون ليتقوا ربهم ويشكروه، فلهذا قال { فاتقوا الله لعلكم تشكرون } لأن من اتقى ربه فقد شكره، ومن ترك التقوى فلم يشكره، إذ تقول يا محمد للمؤمنين يوم بدر مبشرا لهم بالنصر.\n                                    "
      },
      "originalText": "وَلَقَدۡ نَصَرَكُمُ ٱللَّهُ بِبَدۡرٖ وَأَنتُمۡ أَذِلَّةٞۖ فَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تَشۡكُرُونَ ٣٢١"
    },
    {
      "number": 417,
      "text": "إِذْ تَقُولُ لِلْمُؤْمِنِينَ أَلَنْ يَكْفِيَكُمْ أَنْ يُمِدَّكُمْ رَبُّكُمْ بِثَلَاثَةِ آلَافٍ مِنَ الْمَلَائِكَةِ مُنْزَلِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 124,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 54,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِذۡ تَقُولُ لِلۡمُؤۡمِنِينَ أَلَن يَكۡفِيَكُمۡ أَن يُمِدَّكُمۡ رَبُّكُم بِثَلَٰثَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُنزَلِينَ ٤٢١\n                                    \n                                    \n                                    ختلف المفسرون في هذا الوعد : هل كان يوم بدر أو يوم أحد ؟ على قولين :\nأحدهما : أن قوله : ( إذ تقول للمؤمنين ) متعلق بقوله : ( ولقد نصركم الله ببدر ) وروي هذا عن الحسن البصري ، وعامر الشعبي ، والربيع بن أنس ، وغيرهم . واختاره ابن جرير .\nقال عباد بن منصور ، عن الحسن في قوله : ( إذ تقول للمؤمنين ألن يكفيكم أن يمدكم ربكم بثلاثة آلاف من الملائكة ) قال : هذا يوم بدر . رواه ابن أبي حاتم ، ثم قال :\nحدثنا أبي ، حدثنا موسى بن إسماعيل ، حدثنا وهيب عن داود ، عن عامر - يعني الشعبي - أن المسلمين بلغهم يوم بدر أن كرز بن جابر يمد المشركين ، فشق ذلك عليهم ، فأنزل الله : ( ألن يكفيكم أن يمدكم ربكم بثلاثة آلاف من الملائكة منزلين ) إلى قوله : ( مسومين ) قال : فبلغت كرزا الهزيمة ، فلم يمد المشركين ولم يمد الله المسلمين بالخمسة .\nوقال الربيع بن أنس : أمد الله المسلمين بألف ، ثم صاروا ثلاثة آلاف ، ثم صاروا خمسة آلاف .\nفإن قيل : فما الجمع بين هذه الآية - على هذا القول - وبين قوله تعالى في قصة بدر : ( إذ تستغيثون ربكم فاستجاب لكم أني ممدكم بألف من الملائكة مردفين [ وما جعله الله إلا بشرى ولتطمئن به قلوبكم وما النصر إلا من عند الله ] إن الله عزيز حكيم ) [ الأنفال : 9 ، 10 ] فالجواب : أن التنصيص على الألف هاهنا لا ينافي الثلاثة الآلاف فما فوقها ، لقوله : ( مردفين ) بمعنى يردفهم غيرهم ويتبعهم ألوف أخر مثلهم . وهذا السياق شبيه بهذا السياق في سورة آل عمران . فالظاهر أن ذلك كان يوم بدر كما هو المعروف من أن قتال الملائكة إنما كان يوم بدر ، والله أعلم ، قال سعيد بن أبي عروبة ، عن قتادة : أمد الله المؤمنين يوم بدر بخمسة آلاف .\nالقول الثاني : أن هذا الوعد متعلق بقوله : ( وإذ غدوت من أهلك تبوئ المؤمنين مقاعد للقتال ) وذلك يوم أحد . وهو قول مجاهد ، وعكرمة ، والضحاك ، والزهري ، وموسى بن عقبة وغيرهم . لكن قالوا : لم يحصل الإمداد بالخمسة الآلاف ، لأن المسلمين فروا يومئذ - زاد عكرمة : ولا بالثلاثة الآلاف ، لقوله : ( بلى إن تصبروا وتتقوا ) فلم يصبروا ، بل فروا ، فلم يمدوا بملك واحد .\n                                    ",
        "qortoby": "إِذۡ تَقُولُ لِلۡمُؤۡمِنِينَ أَلَن يَكۡفِيَكُمۡ أَن يُمِدَّكُمۡ رَبُّكُم بِثَلَٰثَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُنزَلِينَ ٤٢١\n                                    \n                                    \n                                    فأنزل الله تعالى : ألن يكفيكم إلى قوله : مسومين فبلغ كرزا الهزيمة فلم يمدهم ورجع ، فلم يمدهم الله أيضا بالخمسة آلاف ، وكانوا قد مدوا بألف . وقيل : إنما وعد الله المؤمنين يوم بدر إن صبروا على طاعته ، واتقوا محارمه أن يمدهم أيضا في حروبهم كلها ، فلم يصبروا ولم يتقوا محارمه إلا في يوم الأحزاب ، فأمدهم حين حاصروا قريظة . وقيل : إنما كان هذا يوم أحد ، وعدهم الله المدد إن صبروا ، فما صبروا فلم يمدهم بملك واحد ، ولو أمدوا لما هزموا ; قاله عكرمة والضحاك . فإن قيل : فقد ثبت عن سعد بن أبي وقاص أنه قال : رأيت عن يمين رسول الله - صلى الله عليه وسلم - وعن يساره يوم بدر رجلين عليهما ثياب بيض يقاتلان عنه أشد القتال ، ما رأيتهما قبل ولا بعد . قيل له : لعل هذا مختص بالنبي - صلى الله عليه وسلم - خصه بملكين يقاتلان عنه ، ولا يكون هذا إمدادا للصحابة ، والله أعلم .\nنزول الملائكة سبب من أسباب النصر لا يحتاج إليه الرب تعالى ، وإنما يحتاج إليه المخلوق فليعلق القلب بالله وليثق به ، فهو الناصر بسبب وبغير سبب ; إنما أمره إذا أراد شيئا أن يقول له كن فيكون . لكن أخبر بذلك ليمتثل الخلق ما أمرهم به من الأسباب التي قد خلت من قبل ، ولن تجد لسنة الله تبديلا ، ولا يقدح ذلك في التوكل . وهو رد على من قال : إن الأسباب إنما سنت في حق الضعفاء لا للأقوياء ; فإن النبي - صلى الله عليه وسلم - وأصحابه كانوا الأقوياء وغيرهم هم الضعفاء ; وهذا واضح . و \" مد \" في الشر و \" أمد \" في الخير . وقد تقدم في البقرة . وقرأ أبو حيوة \" منزلين \" بكسر الزاي مخففا ، يعني منزلين النصر . وقرأ ابن عامر مشددة الزاي مفتوحة على التكثير .\n                                    ",
        "saadi": "إِذۡ تَقُولُ لِلۡمُؤۡمِنِينَ أَلَن يَكۡفِيَكُمۡ أَن يُمِدَّكُمۡ رَبُّكُم بِثَلَٰثَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُنزَلِينَ ٤٢١\n                                        \n                                        \n                                        \n                                        { ألن يكفيكم أن يمدكم ربكم بثلاثة آلاف من الملائكة منزلين }\n                                    "
      },
      "originalText": "إِذۡ تَقُولُ لِلۡمُؤۡمِنِينَ أَلَن يَكۡفِيَكُمۡ أَن يُمِدَّكُمۡ رَبُّكُم بِثَلَٰثَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُنزَلِينَ ٤٢١"
    },
    {
      "number": 418,
      "text": "بَلَىٰ ۚ إِنْ تَصْبِرُوا وَتَتَّقُوا وَيَأْتُوكُمْ مِنْ فَوْرِهِمْ هَٰذَا يُمْدِدْكُمْ رَبُّكُمْ بِخَمْسَةِ آلَافٍ مِنَ الْمَلَائِكَةِ مُسَوِّمِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 125,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 54,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "بَلَىٰٓۚ إِن تَصۡبِرُواْ وَتَتَّقُواْ وَيَأۡتُوكُم مِّن فَوۡرِهِمۡ هَٰذَا يُمۡدِدۡكُمۡ رَبُّكُم بِخَمۡسَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُسَوِّمِينَ ٥٢١\n                                    \n                                    \n                                    وقوله : ( بلى إن تصبروا وتتقوا ) يعني : تصبروا على مصابرة عدوكم وتتقوني وتطيعوا أمري .\nوقوله : ( ويأتوكم من فورهم هذا ) قال الحسن ، وقتادة ، والربيع ، والسدي : أي من وجههم هذا . وقال مجاهد ، وعكرمة ، وأبو صالح : أي من غضبهم هذا . وقال الضحاك : من غضبهم ووجههم . وقال العوفي عن ابن عباس : من سفرهم هذا . ويقال : من غضبهم هذا .\nوقوله : ( يمددكم ربكم بخمسة آلاف من الملائكة مسومين ) أي : معلمين بالسيما .\nوقال أبو إسحاق السبيعي ، عن حارثة بن مضرب ، عن علي بن أبي طالب ، رضي الله عنه ، قال : كان سيما الملائكة يوم بدر الصوف الأبيض ، وكان سيماهم أيضا في نواصي خيلهم .\nرواه ابن أبي حاتم ، ثم قال : حدثنا أبو زرعة ، حدثنا هدبة بن خالد ، حدثنا حماد بن سلمة ، عن محمد بن عمرو بن علقمة ، عن أبي سلمة ، عن أبي هريرة في هذه الآية : ( مسومين ) قال : بالعهن الأحمر .\nوقال مجاهد : ( مسومين ) أي : محذقة أعرافها ، معلمة نواصيها بالصوف الأبيض في أذناب الخيل .\nوقال العوفي ، عن ابن عباس ، قال : أتت الملائكة محمدا صلى الله عليه وسلم مسومين بالصوف ، فسوم محمد وأصحابه أنفسهم وخيلهم على سيماهم بالصوف .\nوقال عكرمة وقتادة ( مسومين ) أي : بسيما القتال ، وقال مكحول : ( مسومين ) بالعمائم .\nوروى ابن مردويه ، من حديث عبد القدوس بن حبيب ، عن عطاء بن أبي رباح ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم في قوله : ( مسومين ) قال : \" معلمين . وكان سيما الملائكة يوم بدر عمائم سودا ، ويوم حنين عمائم حمرا \" .\nوروي من حديث حصين بن مخارق ، عن سعيد ، عن الحكم ، عن مقسم ، عن ابن عباس قال : لم تقاتل الملائكة إلا يوم بدر .\nوقال ابن إسحاق : حدثني من لا أتهم ، عن مقسم ، عن ابن عباس قال : كان سيما الملائكة يوم بدر عمائم بيضا قد أرسلوها في ظهورهم ، ويوم حنين عمائم حمرا . ولم تضرب الملائكة في يوم سوى يوم بدر ، وكانوا يكونون فيما سواه من الأيام عددا ومددا لا يضربون .\nثم رواه عن الحسن بن عمارة ، عن الحكم ، عن مقسم عن ابن عباس ، فذكر نحوه .\nوقال ابن أبي حاتم : حدثنا الأحمسي حدثنا وكيع ، حدثنا هشام بن عروة ، عن يحيى بن عباد : أن الزبير [ بن العوام ] رضي الله عنه ، كان عليه يوم بدر عمامة صفراء معتجرا بها ، فنزلت الملائكة عليهم عمائم صفر .\nرواه ابن مردويه من طريق هشام بن عروة ، عن أبيه ، عن عبد الله بن الزبير ، فذكره .\n                                    ",
        "qortoby": "بَلَىٰٓۚ إِن تَصۡبِرُواْ وَتَتَّقُواْ وَيَأۡتُوكُم مِّن فَوۡرِهِمۡ هَٰذَا يُمۡدِدۡكُمۡ رَبُّكُم بِخَمۡسَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُسَوِّمِينَ ٥٢١\n                                    \n                                    \n                                    ثم قال : بلى وتم الكلام . إن تصبروا شرط ، أي على لقاء العدو . وتتقوا عطف عليه ، أي معصيته . والجواب يمددكم . ومعنى من فورهم من وجههم . هذا عن عكرمة وقتادة والحسن والربيع والسدي وابن زيد . وقيل : من غضبهم ; عن مجاهد والضحاك . كانوا قد غضبوا يوم أحد ليوم بدر مما لقوا . وأصل الفور القصد إلى الشيء والأخذ فيه بجد ; وهو من قولهم : فارت القدر تفور فورا وفورانا إذا غلت . والفور الغليان . وفار غضبه إذا جاش . وفعله من فوره أي قبل أن يسكن . والفوارة ما يفور من القدر . وفي التنزيل وفار التنور . قال الشاعر :\nتفور علينا قدرهم فنديمها\nقوله تعالى : \" مسومين \" بفتح الواو اسم مفعول ، وهي قراءة ابن عامر وحمزة والكسائي ونافع . أي معلمين بعلامات . و ( مسومين ) بكسر الواو اسم فاعل ، وهي قراءة أبي عمرو وابن كثير وعاصم ; فيحتمل من المعنى ما تقدم ، أي قد أعلموا أنفسهم بعلامة ، وأعلموا خيلهم . ورجح الطبري وغيره هذه القراءة . وقال كثير من المفسرين : مسومين أي مرسلين خيلهم في الغارة . وذكر المهدوي هذا المعنى في \" مسومين \" بفتح الواو ، أي أرسلهم الله تعالى على الكفار . وقاله ابن فورك أيضا . وعلى القراءة الأولى اختلفوا في سيما الملائكة ; فروي عن علي بن أبي طالب وابن عباس وغيرهما أن الملائكة اعتمت بعمائم بيض قد أرسلوها بين أكتافهم ; ذكره البيهقي عن ابن عباس وحكاه المهدوي عن الزجاج . إلا جبريل فإنه كان بعمامة صفراء على مثال الزبير بن العوام ، وقاله ابن إسحاق . وقال الربيع : كانت سيماهم أنهم كانوا على خيل بلق .\nقلت : ذكر البيهقي عن سهيل بن عمرو - رضي الله عنه - قال : لقد رأيت يوم بدر رجالا بيضا على خيل بلق بين السماء والأرض معلمين يقتلون ويأسرون . فقوله : ( معلمين ) دل على أن الخيل البلق ليست السيما ، والله أعلم . وقال مجاهد : كانت خيلهم مجزوزة الأذناب والأعراف معلمة النواصي والأذناب بالصوف والعهن . وروي عن ابن عباس : تسومت الملائكة يوم بدر بالصوف الأبيض في نواصي الخيل وأذنابها . وقال عباد بن عبد الله بن الزبير وهشام بن عروة والكلبي : نزلت الملائكة في سيما الزبير عليهم عمائم صفر على أكتافهم . وقال ذلك عبد الله وعروة ابنا الزبير . وقال عبد الله : كانت ملاءة صفراء اعتم بها الزبير - رضي الله عنه - .\nقلت : و دلت الآية : على اتخاذ الشارة والعلامة للقبائل والكتائب يجعلها السلطان لهم ; لتتميز كل قبيلة وكتيبة من غيرها عند الحرب ، وعلى فضل الخيل البلق لنزول الملائكة عليها . قلت : ولعلها نزلت عليها موافقة لفرس المقداد ; فإنه كان أبلق ولم يكن لهم فرس غيره ، فنزلت الملائكة على الخيل البلق إكراما للمقداد ; كما نزل جبريل معتجرا بعمامة صفراء على مثال الزبير ، والله أعلم .\nودلت الآية أيضا : على لباس الصوف وقد لبسه الأنبياء والصالحون . وروى أبو داود وابن ماجه واللفظ له عن أبي بردة عن أبيه قال : قال لي أبي : لو شهدتنا ونحن مع رسول الله - صلى الله عليه وسلم - إذا أصابتنا السماء لحسبت أن ريحنا ريح الضأن . ولبس - صلى الله عليه وسلم - جبة رومية من صوف ضيقة الكمين ; رواه الأئمة . ولبسها يونس عليه السلام ; رواه مسلم . وسيأتي لهذا المعنى مزيد بيان في \" النحل \" إن شاء الله تعالى .\nقلت : وأما ما ذكره مجاهد من أن خيلهم كانت مجزوزة الأذناب والأعراف فبعيد ; فإن في مصنف أبي داود عن عتبة بن عبد السلمي أنه سمع رسول الله - صلى الله عليه وسلم - يقول : لا تقصوا نواصي الخيل ولا معارفها ولا أذنابها فإن أذنابها مذابها ، ومعارفها دفاؤها ، ونواصيها معقود فيها الخير . فقول مجاهد يحتاج إلى توقيف من أن خيل الملائكة كانت على تلك الصفة ، والله أعلم .\nودلت الآية على حسن الأبيض والأصفر من الألوان لنزول الملائكة بذلك ، وقد قال ابن عباس : من لبس نعلا أصفر قضيت حاجته . وقال عليه السلام : البسوا من ثيابكم البياض فإنه من خير ثيابكم وكفنوا فيه موتاكم وأما العمائم فتيجان العرب ولباسها . وروى ركانة - وكان صارع النبي - صلى الله عليه وسلم - فصرعه النبي - صلى الله عليه وسلم - قال ركانة : وسمعت النبي - صلى الله عليه وسلم - يقول : فرق ما بيننا وبين المشركين العمائم على القلانس أخرجه أبو داود . قال البخاري : إسناده مجهول لا يعرف سماع بعضه من بعض .\n                                    ",
        "saadi": "بَلَىٰٓۚ إِن تَصۡبِرُواْ وَتَتَّقُواْ وَيَأۡتُوكُم مِّن فَوۡرِهِمۡ هَٰذَا يُمۡدِدۡكُمۡ رَبُّكُم بِخَمۡسَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُسَوِّمِينَ ٥٢١\n                                        \n                                        \n                                        \n                                        {بلى إن تصبروا وتتقوا ويأتوكم من فورهم هذا } أي: من مقصدهم هذا، وهو وقعة بدر { يمددكم ربكم بخمسة آلاف من الملائكة مسومين } أي: معلمين بعلامة الشجعان، فشرط الله لإمدادهم ثلاثة شروط: الصبر، والتقوى، وإتيان المشركين من فورهم هذا، فهذا الوعد بإنزال الملائكة المذكورين وإمدادهم بهم، وأما وعد النصر وقمع كيد الأعداء فشرط الله له الشرطين الأولين كما تقدم في قوله: { وإن تصبروا وتتقوا لا يضركم كيدهم شيئا }\n                                    "
      },
      "originalText": "بَلَىٰٓۚ إِن تَصۡبِرُواْ وَتَتَّقُواْ وَيَأۡتُوكُم مِّن فَوۡرِهِمۡ هَٰذَا يُمۡدِدۡكُمۡ رَبُّكُم بِخَمۡسَةِ ءَالَٰفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُسَوِّمِينَ ٥٢١"
    },
    {
      "number": 419,
      "text": "وَمَا جَعَلَهُ اللَّهُ إِلَّا بُشْرَىٰ لَكُمْ وَلِتَطْمَئِنَّ قُلُوبُكُمْ بِهِ ۗ وَمَا النَّصْرُ إِلَّا مِنْ عِنْدِ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 126,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 54,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ لَكُمۡ وَلِتَطۡمَئِنَّ قُلُوبُكُم بِهِۦۗ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ ٦٢١\n                                    \n                                    \n                                    وقوله : ( وما جعله الله إلا بشرى لكم ولتطمئن قلوبكم به ) أي : وما أنزل الله الملائكة وأعلمكم بإنزالها إلا بشارة لكم وتطييبا لقلوبكم وتطمينا ، وإلا فإنما النصر من عند الله ، الذي لو شاء لانتصر من أعدائه بدونكم ، ومن غير احتياج إلى قتالكم لهم ، كما قال تعالى بعد أمره المؤمنين بالقتال : ( ذلك ولو يشاء الله لانتصر منهم ولكن ليبلو بعضكم ببعض والذين قتلوا في سبيل الله فلن يضل أعمالهم . سيهديهم ويصلح بالهم . ويدخلهم الجنة عرفها لهم . ) [ محمد : 4 - 6 ] . ولهذا قال هاهنا : ( وما جعله الله إلا بشرى لكم ولتطمئن قلوبكم به وما النصر إلا من عند الله العزيز الحكيم ) أي : هو ذو العزة التي لا ترام ، والحكمة في قدره والإحكام .\n                                    ",
        "qortoby": "وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ لَكُمۡ وَلِتَطۡمَئِنَّ قُلُوبُكُم بِهِۦۗ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ ٦٢١\n                                    \n                                    \n                                    قوله تعالى : وما جعله الله إلا بشرى لكم ولتطمئن قلوبكم به وما النصر إلا من عند الله العزيز الحكيم\nويدل عليه يمددكم أو للتسويم أو للإنزال أو العدد على المعنى ; لأن خمسة آلاف عدد . ولتطمئن قلوبكم به اللام لام كي ، أي ولتطمئن قلوبكم به جعله ; كقوله : وزينا السماء الدنيا بمصابيح وحفظا أي وحفظا لها جعل ذلك . وما النصر إلا من عند الله يعني نصر المؤمنين ، ولا يدخل في ذلك نصر الكافرين ; لأن ما وقع لهم من غلبة إنما هو إملاء محفوف بخذلان وسوء عاقبة وخسران .\n                                    ",
        "saadi": "وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ لَكُمۡ وَلِتَطۡمَئِنَّ قُلُوبُكُم بِهِۦۗ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ ٦٢١\n                                        \n                                        \n                                        \n                                        { وما جعله الله } أي: إمداده لكم بالملائكة { إلا بشرى } تستبشرون بها وتفرحون { ولتطمئن قلوبكم به وما النصر إلا من عند الله } فلا تعتمدوا على ما معكم من الأسباب، بل الأسباب فيها طمأنينة لقلوبكم، وأما النصر الحقيقي الذي لا معارض له، فهو مشيئة الله لنصر من يشاء من عباده، فإنه إن شاء نصر من معه الأسباب كما هي سنته في خلقه، وإن شاء نصر المستضعفين الأذلين ليبين لعباده أن الأمر كله بيديه، ومرجع الأمور إليه، ولهذا قال { عند الله العزيز } فلا يمتنع عليه مخلوق، بل الخلق كلهم أذلاء مدبرون تحت تدبيره وقهره { الحكيم } الذي يضع الأشياء مواضعها، وله الحكمة في إدالة الكفار في بعض الأوقات على المسلمين إدالة غير مستقرة، قال تعالى: { ذلك ولو يشاء الله لانتصر منهم ولكن ليبلو بعضكم ببعض }\n                                    "
      },
      "originalText": "وَمَا جَعَلَهُ ٱللَّهُ إِلَّا بُشۡرَىٰ لَكُمۡ وَلِتَطۡمَئِنَّ قُلُوبُكُم بِهِۦۗ وَمَا ٱلنَّصۡرُ إِلَّا مِنۡ عِندِ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ ٦٢١"
    },
    {
      "number": 420,
      "text": "لِيَقْطَعَ طَرَفًا مِنَ الَّذِينَ كَفَرُوا أَوْ يَكْبِتَهُمْ فَيَنْقَلِبُوا خَائِبِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 127,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 54,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لِيَقۡطَعَ طَرَفٗا مِّنَ ٱلَّذِينَ كَفَرُوٓاْ أَوۡ يَكۡبِتَهُمۡ فَيَنقَلِبُواْ خَآئِبِينَ ٧٢١\n                                    \n                                    ثم قال تعالى : ( ليقطع طرفا من الذين كفروا ) أي : أمركم بالجهاد والجلاد ، لما له في ذلك من الحكمة في كل تقدير ، ولهذا ذكر جميع الأقسام الممكنة في الكفار المجاهدين . فقال : ( ليقطع طرفا ) أي : ليهلك أمة ( من الذين كفروا أو يكبتهم ) أي : يخزيهم ويردهم بغيظهم لما لم ينالوا منكم ما أرادوا ، ولهذا قال : ( أو يكبتهم فينقلبوا ) أي : يرجعوا ( خائبين ) أي : لم يحصلوا على ما أملوا .\n                                    ",
        "qortoby": "لِيَقۡطَعَ طَرَفٗا مِّنَ ٱلَّذِينَ كَفَرُوٓاْ أَوۡ يَكۡبِتَهُمۡ فَيَنقَلِبُواْ خَآئِبِينَ ٧٢١\n                                    \n                                    \n                                    ليقطع طرفا من الذين كفروا أي بالقتل . ونظم الآية : ولقد نصركم الله ببدر ليقطع . وقيل : المعنى وما النصر إلا من عند الله ليقطع . ويجوز أن يكون متعلقا ب يمددكم ، أي يمددكم ليقطع . والمعنى : من قتل من المشركين يوم بدر ، عن الحسن وغيره . السدي : يعني به من قتل من المشركين يوم أحد وكانوا ثمانية عشر رجلا . ومعنى يكبتهم يحزنهم ; والمكبوت المحزون . وروي أن النبي - صلى الله عليه وسلم - جاء إلى أبي طلحة فرأى ابنه مكبوتا فقال : ( ما شأنه ) ؟ فقيل : مات بعيره . وأصله فيما ذكر بعض أهل اللغة \" يكبدهم \" أي يصيبهم بالحزن والغيظ في أكبادهم ، فأبدلت الدال تاء ، كما قلبت في سبت رأسه وسبده أي حلقه . كبت الله العدو كبتا إذا صرفه وأذله ، كبده ، أصابه في كبده ; يقال : قد أحرق الحزن كبده ، وأحرقت العداوة كبده . وتقول العرب للعدو : أسود الكبد ; قال الأعشى :\nفما أجشمت من إتيان قوم هم الأعداء والأكباد سود\nكأن الأكباد لما احترقت بشدة العداوة اسودت . وقرأ أبو مجلز \" أو يكبدهم \" بالدال . والخائب : المنقطع الأمل . خاب يخيب إذا لم ينل ما طلب . والخياب : القدح لا يوري .\n                                    ",
        "saadi": "لِيَقۡطَعَ طَرَفٗا مِّنَ ٱلَّذِينَ كَفَرُوٓاْ أَوۡ يَكۡبِتَهُمۡ فَيَنقَلِبُواْ خَآئِبِينَ ٧٢١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أن نصره عباده المؤمنين لأحد أمرين: إما أن يقطع طرفا من الذين كفروا، أي: جانبا منهم وركنا من أركانهم، إما بقتل، أو أسر، أو استيلاء على بلد، أو غنيمة مال، فيقوى بذلك المؤمنون ويذل الكافرون، وذلك لأن مقاومتهم ومحاربتهم للإسلام تتألف من أشخاصهم وسلاحهم وأموالهم وأرضهم فبهذه الأمور تحصل منهم المقاومة والمقاتلة فقطع شيء من ذلك ذهاب لبعض قوتهم، الأمر الثاني أن يريد الكفار بقوتهم وكثرتهم، طمعا في المسلمين، ويمنوا أنفسهم ذلك، ويحرصوا عليه غاية الحرص، ويبذلوا قواهم وأموالهم في ذلك، فينصر الله المؤمنين عليهم ويردهم خائبين لم ينالوا مقصودهم، بل يرجعون بخسارة وغم وحسرة، وإذا تأملت الواقع رأيت نصر الله لعباده المؤمنين دائرا بين هذين الأمرين، غير خارج عنهما إما نصر عليهم أو خذل لهم.\n                                    "
      },
      "originalText": "لِيَقۡطَعَ طَرَفٗا مِّنَ ٱلَّذِينَ كَفَرُوٓاْ أَوۡ يَكۡبِتَهُمۡ فَيَنقَلِبُواْ خَآئِبِينَ ٧٢١"
    },
    {
      "number": 421,
      "text": "لَيْسَ لَكَ مِنَ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 128,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 54,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَيۡسَ لَكَ مِنَ ٱلۡأَمۡرِ شَيۡءٌ أَوۡ يَتُوبَ عَلَيۡهِمۡ أَوۡ يُعَذِّبَهُمۡ فَإِنَّهُمۡ ظَٰلِمُونَ ٨٢١\n                                    \n                                    \n                                    ثم اعترض بجملة دلت على أن الحكم في الدنيا والآخرة له وحده لا شريك له ، فقال : ( ليس لك من الأمر شيء ) أي : بل الأمر كله إلي ، كما قال : ( فإنما عليك البلاغ وعلينا الحساب ) [ الرعد : 40 ] وقال ( ليس عليك هداهم ولكن الله يهدي من يشاء ) [ البقرة : 272 ] . وقال ( إنك لا تهدي من أحببت ولكن الله يهدي من يشاء ) [ القصص : 56 ] .\nقال محمد بن إسحاق في قوله : ( ليس لك من الأمر شيء ) أي : ليس لك من الحكم شيء في عبادي إلا ما أمرتك به فيهم .\nثم ذكر تعالى بقية الأقسام فقال : ( أو يتوب عليهم ) أي : مما هم فيه من الكفر ويهديهم بعد الضلالة ( أو يعذبهم ) أي : في الدنيا والآخرة على كفرهم وذنوبهم ، ولهذا قال : ( فإنهم ظالمون ) أي : يستحقون ذلك .\nوقال البخاري : حدثنا حبان بن موسى ، أخبرنا عبد الله ، أخبرنا معمر ، عن الزهري ، حدثني سالم ، عن أبيه : أنه سمع رسول الله صلى الله عليه وسلم يقول ، إذا رفع رأسه من الركوع في الركعة الثانية من الفجر اللهم العن فلانا وفلانا \" بعد ما يقول : \" سمع الله لمن حمده ، ربنا ولك الحمد \" فأنزل الله تعالى ( ليس لك من الأمر شيء [ أو يتوب عليهم أو يعذبهم فإنهم ظالمون ] ) .\nوهكذا رواه النسائي ، من حديث عبد الله بن المبارك وعبد الرزاق ، كلاهما ، عن معمر ، به .\nوقال الإمام أحمد : حدثنا أبو النضر ، حدثنا أبو عقيل - قال أحمد : وهو عبد الله بن عقيل ، صالح الحديث ثقة - قال : حدثنا عمر بن حمزة ، عن سالم ، عن أبيه قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" اللهم العن فلانا ، اللهم العن الحارث بن هشام ، اللهم العن سهيل بن عمرو ، اللهم العن صفوان بن أمية \" . فنزلت هذه الآية : ( ليس لك من الأمر شيء أو يتوب عليهم أو يعذبهم فإنهم ظالمون ) فتيب عليهم كلهم .\nوقال أحمد : حدثنا أبو معاوية الغلابي ، حدثنا خالد بن الحارث ، حدثنا محمد بن عجلان ، عن نافع ، عن عبد الله ، أن رسول الله صلى الله عليه وسلم كان يدعو على أربعة قال : فأنزل الله : ( ليس لك من الأمر شيء [ أو يتوب عليهم أو يعذبهم فإنهم ظالمون ] ) قال : وهداهم الله للإسلام .\nوقال محمد بن عجلان ، عن نافع ، عن ابن عمر قال : كان رسول الله صلى الله عليه وسلم يدعو على رجال من المشركين يسميهم بأسمائهم ، حتى أنزل الله : ( ليس لك من الأمر شيء ) الآية .\nوقال البخاري أيضا : حدثنا موسى بن إسماعيل ، حدثنا إبراهيم بن سعد ، عن ابن شهاب ، عن سعيد بن المسيب ، وأبي سلمة بن عبد الرحمن ، عن أبي هريرة ، رضي الله عنه ، أن رسول الله صلى الله عليه وسلم كان إذا أراد أن يدعو على أحد - أو يدعو لأحد - قنت بعد الركوع ، وربما قال - إذا قال : \" سمع الله لمن حمده ، ربنا ولك الحمد - : \" اللهم أنج الوليد بن الوليد ، وسلمة بن هشام ، وعياش بن أبي ربيعة ، والمستضعفين من المؤمنين ، اللهم اشدد وطأتك على مضر ، واجعلها عليهم سنين كسني يوسف \" . يجهر بذلك ، وكان يقول - في بعض صلاته في صلاة الفجر - : \" اللهم العن فلانا وفلانا \" لأحياء من أحياء العرب ، حتى أنزل الله ( ليس لك من الأمر شيء ) الآية .\nوقال البخاري : قال حميد وثابت ، عن أنس بن مالك : شج النبي صلى الله عليه وسلم يوم أحد ، فقال : \" كيف يفلح قوم شجوا نبيهم ؟ \" . فنزلت : ( ليس لك من الأمر شيء ) وقد أسند هذا الحديث الذي علقه البخاري رحمه الله .\nوقال البخاري في غزوة أحد : حدثنا يحيى بن عبد الله السلمي ، حدثنا عبد الله - أخبرنا معمر ، عن الزهري ، حدثني سالم بن عبد الله ، عن أبيه أنه سمع رسول الله صلى الله عليه وسلم يقول - إذا رفع رأسه من الركوع ، في الركعة الأخيرة من الفجر - : \" اللهم العن فلانا وفلانا وفلانا \" بعد ما يقول : \" سمع الله لمن حمده ، ربنا ولك الحمد \" . فأنزل الله : ( ليس لك من الأمر شيء ) [ إلى قوله : ( فإنهم ظالمون ) ] .\nوعن حنظلة بن أبي سفيان قال : سمعت سالم بن عبد الله قال : كان رسول الله صلى الله عليه وسلم يدعو على صفوان بن أمية ، وسهيل بن عمرو ، والحارث بن هشام ، فنزلت : ( ليس لك من الأمر شيء [ أو يتوب عليهم أو يعذبهم ] فإنهم ظالمون ) .\nهكذا ذكر هذه الزيادة البخاري معلقة مرسلة - مسندة متصلة في مسند أحمد ، متصلة آنفا .\nوقال الإمام أحمد : حدثنا هشيم ، حدثنا حميد ، عن أنس ، رضي الله عنه أن النبي صلى الله عليه وسلم كسرت رباعيته يوم أحد ، وشج في جبهته حتى سال الدم على وجهه ، فقال : \" كيف يفلح قوم فعلوا هذا بنبيهم ، وهو يدعوهم إلى ربهم ، عز وجل \" . فأنزل الله تعالى : ( ليس لك من الأمر شيء أو يتوب عليهم أو يعذبهم فإنهم ظالمون )\nانفرد به مسلم ، فرواه [ عن ] القعنبي ، عن حماد ، عن ثابت ، عن أنس ، فذكره .\nوقال ابن جرير : حدثنا ابن حميد ، حدثنا يحيى بن واضح ، حدثنا الحسين بن واقد ، عن مطر ، عن قتادة قال : أصيب النبي صلى الله عليه وسلم يوم أحد وكسرت رباعيته ، وفرق حاجبه ، فوقع وعليه درعان والدم يسيل ، فمر به سالم مولى أبي حذيفة ، فأجلسه ومسح عن وجهه ، فأفاق وهو يقول : \" كيف بقوم فعلوا هذا بنبيهم ، وهو يدعوهم إلى الله ؟ \" فأنزل الله : ( ليس لك من الأمر شيء [ أو يتوب عليهم أو يعذبهم فإنهم ظالمون ] ) .\nوكذا رواه عبد الرزاق ، عن معمر ، عن قتادة ، بنحوه ، ولم يقل : فأفاق .\n                                    ",
        "qortoby": "لَيۡسَ لَكَ مِنَ ٱلۡأَمۡرِ شَيۡءٌ أَوۡ يَتُوبَ عَلَيۡهِمۡ أَوۡ يُعَذِّبَهُمۡ فَإِنَّهُمۡ ظَٰلِمُونَ ٨٢١\n                                    \n                                    \n                                    قوله تعالى : ليس لك من الأمر شيء أو يتوب عليهم أو يعذبهم فإنهم ظالمون\nفيه مسائل :\nالأولى : ثبت في صحيح مسلم أن النبي - صلى الله عليه وسلم - كسرت رباعيته يوم أحد ، وشج في رأسه ، فجعل يسلت الدم عنه ويقول : كيف يفلح قوم شجوا رأس نبيهم وكسروا رباعيته وهو يدعوهم إلى الله تعالى فأنزل الله تعالى : ليس لك من الأمر شيء . الضحاك : هم النبي - صلى الله عليه وسلم - أن يدعو على المشركين فأنزل الله تعالى : ليس لك من الأمر شيء . وقيل : استأذن في أن يدعو في استئصالهم ، فلما نزلت هذه الآية علم أن منهم من سيسلم وقد آمن كثير منهم خالد بن الوليد وعمرو بن العاص وعكرمة بن أبي جهل وغيرهم . وروى الترمذي عن ابن عمر قال : وكان النبي - صلى الله عليه وسلم - يدعو على أربعة نفر فأنزل الله عز وجل : ليس لك من الأمر شيء فهداهم الله للإسلام وقال : هذا حديث حسن غريب صحيح . وقوله تعالى : أو يتوب عليهم قيل : هو معطوف على ليقطع طرفا . والمعنى : ليقتل طائفة منهم ، أو يحزنهم بالهزيمة أو يتوب عليهم أو يعذبهم . وقد تكون \" أو \" هاهنا بمعنى \" حتى \" و \" إلا أن \" . قال امرؤ القيس :\nفقلت له لا تبل عينك إنما نحاول ملكا أو نموت فنعذرا\nقوله عليه السلام : ( كيف يفلح قوم شجوا رأس نبيهم ) استبعاد لتوفيق من فعل ذلك به . وقوله تعالى : ليس لك من الأمر شيء تقريب لما استبعده وإطماع في إسلامهم ، ولما أطمع في ذلك قال - صلى الله عليه وسلم - : اللهم اغفر لقومي فإنهم لا يعلمون كما في صحيح مسلم عن ابن مسعود قال : كأني أنظر إلى رسول الله - صلى الله عليه وسلم - يحكي نبيا من الأنبياء ضربه قومه وهو يمسح الدم عن وجهه ويقول : رب اغفر لقومي فإنهم لا يعلمون . قال علماؤنا : فالحاكي في حديث ابن مسعود هو الرسول عليه الصلاة والسلام ، وهو المحكي عنه ; بدليل ما قد جاء صريحا مبينا أنه عليه الصلاة والسلام لما كسرت رباعيته وشج وجهه يوم أحد شق ذلك على أصحابه شقا شديدا وقالوا : لو دعوت عليهم ! فقال : ( إني لم أبعث لعانا ولكني بعثت داعيا ورحمة ، اللهم اغفر لقومي فإنهم لا يعلمون ) . فكأنه عليه السلام أوحي إليه بذلك قبل وقوع قضية أحد ، ولم يعين له ذلك النبي ; فلما وقع له ذلك تعين أنه المعني بذلك بدليل ما ذكرنا . وبينه أيضا ما قاله عمر له في بعض كلامه : بأبي أنت وأمي يا رسول الله ! لقد دعا نوح على قومه فقال : رب لا تذر على الأرض من الكافرين ديارا الآية . ولو دعوت علينا مثلها لهلكنا من عند آخرنا ; فقد وطئ ظهرك وأدمي وجهك وكسرت رباعيتك فأبيت أن تقول إلا خيرا ، فقلت : ( رب اغفر لقومي فإنهم لا يعلمون ) . وقوله : ( اشتد غضب الله على قوم كسروا رباعية نبيهم ) يعني بذلك المباشر لذلك ، وقد ذكرنا اسمه على اختلاف في ذلك ، وإنما قلنا إنه خصوص في المباشر ; لأنه قد أسلم جماعة ممن شهد أحدا وحسن إسلامهم .\nالثانية : زعم بعض الكوفيين أن هذه الآية ناسخة للقنوت الذي كان النبي - صلى الله عليه وسلم - يفعله بعد الركوع في الركعة الأخيرة من الصبح ، واحتج بحديث ابن عمر أنه سمع النبي - صلى الله عليه وسلم - يقول في صلاة الفجر بعد رفع رأسه من الركوع فقال : ( اللهم ربنا ولك الحمد في الآخرة ، ثم قال : اللهم العن فلانا وفلانا ) فأنزل الله عز وجل ليس لك من الأمر شيء أو يتوب عليهم أو يعذبهم الآية . أخرجه البخاري ، وأخرجه مسلم أيضا من حديث أبي هريرة أتم منه . وليس هذا موضع نسخ وإنما نبه الله تعالى على نبيه على أن الأمر ليس إليه ، وأنه لا يعلم من الغيب شيئا إلا ما أعلمه ، وأن الأمر كله لله يتوب على من يشاء ويعجل العقوبة لمن يشاء . والتقدير : ليس لك من الأمر شيء ولله ما في السماوات وما في الأرض دونك ودونهم يغفر لمن يشاء ويتوب على من يشاء . فلا نسخ ، والله أعلم . وبين بقوله : ليس لك من الأمر شيء أن الأمور بقضاء الله وقدره ردا على القدرية وغيرهم .\nالثالثة : واختلف العلماء في القنوت في صلاة الفجر وغيرها ; فمنع الكوفيون منه في الفجر وغيرها . وهو مذهب الليث ويحيى بن يحيى الليثي الأندلسي صاحب مالك ، وأنكره الشعبي . وفي الموطأ عن ابن عمر : أنه كان لا يقنت في شيء من الصلاة . وروى النسائي ، أنبأنا قتيبة ، عن خلف ، عن أبي مالك الأشجعي عن أبيه قال : صليت خلف النبي - صلى الله عليه وسلم - فلم يقنت ، وصليت خلف أبي بكر فلم يقنت ، وصليت خلف عمر فلم يقنت ، وصليت خلف عثمان فلم يقنت ، وصليت خلف علي فلم يقنت ; ثم قال : يا بني إنها بدعة . وقيل : يقنت في الفجر دائما وفي سائر الصلوات إذا نزل بالمسلمين نازلة ; قاله الشافعي والطبري . وقيل : هو مستحب في صلاة الفجر ، وروي عن الشافعي . وقال الحسن وسحنون : إنه سنة . وهو مقتضى رواية علي بن زياد عن مالك بإعادة تاركه للصلاة عمدا . وحكى الطبري الإجماع على أن تركه غير مفسد للصلاة . وعن الحسن : في تركه سجود السهو ; وهو أحد قولي الشافعي . وذكر الدارقطني عن سعيد بن عبد العزيز فيمن نسي القنوت في صلاة الصبح قال : يسجد سجدتي السهو . واختار مالك قبل الركوع ; وهو قول إسحاق . وروي أيضا عن مالك بعد الركوع ، وروي عن الخلفاء الأربعة ، وهو قول الشافعي وأحمد وإسحاق أيضا . وروى عن جماعة من الصحابة التخيير في ذلك . وروى الدارقطني بإسناد صحيح عن أنس أنه قال : ما زال رسول الله - صلى الله عليه وسلم - يقنت في صلاة الغداة حتى فارق الدنيا . وذكر أبو داود في المراسيل عن خالد بن أبي عمران قال : بينا رسول الله - صلى الله عليه وسلم - يدعو على مضر إذ جاءه جبريل فأومأ إليه أن اسكت فسكت ; فقال : ( يا محمد إن الله لم يبعثك سبابا ولا لعانا ، وإنما بعثك رحمة ولم يبعثك عذابا ليس لك من الأمر شيء أو يتوب عليهم أو يعذبهم فإنهم ظالمون قال : ثم علمه هذا القنوت فقال : ( اللهم إنا نستعينك ونستغفرك ونؤمن بك ونخنع لك ونخلع ونترك من يكفرك اللهم إياك نعبد ولك نصلي ونسجد وإليك نسعى ونحفد ونرجو رحمتك ونخاف عذابك الجد إن عذابك بالكافرين ملحق ) .\n                                    ",
        "saadi": "لَيۡسَ لَكَ مِنَ ٱلۡأَمۡرِ شَيۡءٌ أَوۡ يَتُوبَ عَلَيۡهِمۡ أَوۡ يُعَذِّبَهُمۡ فَإِنَّهُمۡ ظَٰلِمُونَ ٨٢١\n                                        \n                                        \n                                        \n                                        لما جرى يوم \"أحد\" ما جرى، وجرى على النبي صلى الله عليه وسلم مصائب، رفع الله بها درجته، فشج رأسه وكسرت رباعيته، قال \"كيف يفلح قوم شجوا نبيهم\" وجعل يدعو على رؤساء من المشركين مثل أبي سفيان بن حرب، وصفوان بن أمية وسهيل بن عمرو، والحارث بن هشام، أنزل الله تعالى على رسوله نهيا له عن الدعاء عليهم باللعنة والطرد عن رحمة الله { ليس لك من الأمر شيء } إنما عليك البلاغ وإرشاد الخلق والحرص على مصالحهم، وإنما الأمر لله تعالى هو الذي يدبر الأمور، ويهدي من يشاء ويضل من يشاء، فلا تدع عليهم بل أمرهم راجع إلى ربهم، إن اقتضت حكمته ورحمته أن يتوب عليهم ويمن عليهم بالإسلام فعل، وإن اقتضت حكمته إبقاءهم على كفرهم وعدم هدايتهم، فإنهم هم الذين ظلموا أنفسهم وضروها وتسببوا بذلك، فعل، وقد تاب الله على هؤلاء المعينين وغيرهم، فهداهم للإسلام رضي الله عنهم، وفي هذه الآية مما يدل على أن اختيار الله غالب على اختيار العباد، وأن العبد وإن ارتفعت درجته وعلا قدره قد يختار شيئا وتكون الخيرة والمصلحة في غيره، وأن الرسول صلى الله عليه وسلم ليس له من الأمر شيء فغيره من باب أولى ففيها أعظم رد على من تعلق بالأنبياء أو غيرهم من الصالحين وغيرهم، وأن هذا شرك في العبادة، نقص في العقل، يتركون من الأمر كله له ويدعون من لا يملك من الأمر مثقال ذرة، إن هذا لهو الضلال البعيد، وتأمل كيف لما ذكر تعالى توبته عليهم أسند الفعل إليه، ولم يذكر منهم سببا موجبا لذلك، ليدل ذلك على أن النعمة محض فضله على عبده، من غير سبق سبب من العبد ولا وسيلة، ولما ذكر العذاب ذكر معه ظلمهم، ورتبه على العذاب بالفاء المفيدة للسببية، فقال { أو يعذبهم فإنهم ظالمون } ليدل ذلك على كمال عدل الله وحكمته، حيث وضع العقوبة موضعها، ولم يظلم عبده بل العبد هو الذي ظلم نفسه\n                                    "
      },
      "originalText": "لَيۡسَ لَكَ مِنَ ٱلۡأَمۡرِ شَيۡءٌ أَوۡ يَتُوبَ عَلَيۡهِمۡ أَوۡ يُعَذِّبَهُمۡ فَإِنَّهُمۡ ظَٰلِمُونَ ٨٢١"
    },
    {
      "number": 422,
      "text": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ يَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 129,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 54,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٩٢١\n                                    \n                                    \n                                    ثم قال تعالى : ( ولله ما في السماوات وما في الأرض ) أي : الجميع ملك له ، وأهلهما عبيد بين يديه ( يغفر لمن يشاء ويعذب من يشاء ) أي : هو المتصرف فلا معقب لحكمه ، ولا يسأل عما يفعل وهم يسألون ، والله غفور رحيم .\n                                    ",
        "qortoby": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٩٢١\n                                    \n                                    \n                                    وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٩٢١\n                                    ",
        "saadi": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٩٢١\n                                        \n                                        \n                                        \n                                        ولما نفى عن رسوله أنه ليس له من الأمر شيء قرر من الأمر له فقال { ولله ما في السماوات وما في الأرض } من الملائكة والإنس والجن والحيوانات والأفلاك والجمادات كلها، وجميع ما في السماوات والأرض، الكل ملك لله مخلوقون مدبرون متصرف فيهم تصرف المماليك، فليس لهم مثقال ذرة من الملك، وإذا كانوا كذلك فهم دائرون بين مغفرته وتعذيبه فيغفر لمن يشاء بأن يهديه للإسلام فيغفر شركه ويمن عليه بترك العصيان فيغفر له ذنبه، { ويعذب من يشاء } بأن يكله إلى نفسه الجاهلة الظالمة المقتضية لعمل الشر فيعمل الشر ويعذبه على ذلك، ثم ختم الآية باسمين كريمين دالين على سعة رحمته وعموم مغفرته وسعة إحسانه وعميم إحسانه، فقال { والله غفور رحيم } ففيها أعظم بشارة بأن رحمته غلبت غضبه، ومغفرته غلبت مؤاخذته، فالآية فيها الإخبار عن حالة الخلق وأن منهم من يغفر الله له ومنهم من يعذبه، فلم يختمها باسمين أحدهما دال على الرحمة، والثاني دال على النقمة، بل ختمها باسمين كليهما يدل على الرحمة، فله تعالى رحمة وإحسان سيرحم بها عباده لا تخطر ببال بشر، ولا يدرك لها وصف، فنسأله تعالى أن يتغمدنا ويدخلنا برحمته في عباده الصالحين.\n                                    "
      },
      "originalText": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ ٩٢١"
    },
    {
      "number": 423,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا الرِّبَا أَضْعَافًا مُضَاعَفَةً ۖ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 130,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 55,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُواْ ٱلرِّبَوٰٓاْ أَضۡعَٰفٗا مُّضَٰعَفَةٗۖ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ ٠٣١\n                                    \n                                    \n                                    يقول تعالى ناهيا عباده المؤمنين عن تعاطي الربا وأكله أضعافا مضاعفة ، كما كانوا يقولون في الجاهلية - إذا حل أجل الدين : إما أن يقضي وإما أن يربي ، فإن قضاه وإلا زاده في المدة وزاده الآخر في القدر ، وهكذا كل عام ، فربما تضاعف القليل حتى يصير كثيرا مضاعفا .\nوأمر تعالى عباده بالتقوى لعلهم يفلحون في الأولى والأخرى\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُواْ ٱلرِّبَوٰٓاْ أَضۡعَٰفٗا مُّضَٰعَفَةٗۖ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ ٠٣١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا لا تأكلوا الربا أضعافا مضاعفة واتقوا الله لعلكم تفلحون\nقوله تعالى : يا أيها الذين آمنوا لا تأكلوا الربا أضعافا هذا النهي عن أكل الربا اعتراض بين أثناء قصة أحد . قال ابن عطية : ولا أحفظ في ذلك شيئا مرويا .\nقلت : قال مجاهد : كانوا يبيعون البيع إلى أجل ، فإذا حل الأجل زادوا في الثمن على أن يؤخروا ; فأنزل الله عز وجل : يا أيها الذين آمنوا لا تأكلوا الربا أضعافا مضاعفة قلت وإنما خص الربا من بين سائر المعاصي ; لأنه الذي أذن الله فيه بالحرب في قوله : فإن لم تفعلوا فأذنوا بحرب من الله ورسوله والحرب يؤذن بالقتل ; فكأنه يقول : إن لم تتقوا الربا هزمتم وقتلتم . فأمرهم بترك الربا ; لأنه كان معمولا به عندهم ، والله أعلم . و ( أضعافا ) نصب على الحال و ( مضاعفة ) نعته . وقرئ \" مضعفة \" ومعناه : الربا الذي كانت العرب تضعف فيه الدين فكان الطالب يقول : أتقضي أم تربي ؟ كما تقدم في \" البقرة \" . و ( مضاعفة ) إشارة إلى تكرار التضعيف عاما بعد عام كما كانوا يصنعون ; فدلت هذه العبارة المؤكدة على شنعة فعلهم وقبحه ، ولذلك ذكرت حالة التضعيف خاصة .قوله تعالى : واتقوا الله أي في أموال الربا فلا تأكلوها .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُواْ ٱلرِّبَوٰٓاْ أَضۡعَٰفٗا مُّضَٰعَفَةٗۖ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ ٠٣١\n                                        \n                                        \n                                        \n                                        تقدم في مقدمة هذا التفسير أن العبد ينبغي له مراعاة الأوامر والنواهي في نفسه وفي غيره، وأن الله تعالى إذا أمره بأمر وجب عليه -أولا- أن يعرف حده، وما هو الذي أمر به ليتمكن بذلك من امتثاله، فإذا عرف ذلك اجتهد، واستعان بالله على امتثاله في نفسه وفي غيره، بحسب قدرته وإمكانه، وكذلك إذا نهي عن أمر عرف حده، وما يدخل فيه وما لا يدخل، ثم اجتهد واستعان بربه في تركه، وأن هذا ينبغي مراعاته في جميع الأوامر الإلهية والنواهي، وهذه الآيات الكريمات قد اشتملت عن أوامر وخصال من خصال الخير، أمر الله [بها] وحث على فعلها، وأخبر عن جزاء أهلها، وعلى نواهي حث على تركها. ولعل الحكمة -والله أعلم- في إدخال هذه الآيات أثناء قصة \"أحد\" أنه قد تقدم أن الله تعالى وعد عباده المؤمنين، أنهم إذا صبروا واتقوا نصرهم على أعدائهم، وخذل الأعداء عنهم، كما في قوله تعالى: { وإن تصبروا وتتقوا لا يضركم كيدهم شيئا } ثم قال: { بلى إن تصبروا وتتقوا ويأتوكم من فورهم هذا يمددكم ربكم } الآيات. فكأن النفوس اشتاقت إلى معرفة خصال التقوى، التي يحصل بها النصر والفلاح والسعادة، فذكر الله في هذه الآيات أهم خصال التقوى التي إذا قام العبد بها فقيامه بغيرها من باب أولى وأحرى، ويدل على ما قلنا أن الله ذكر لفظ \"التقوى\" في هذه الآيات ثلاث مرات: مرة مطلقة وهي قوله: { أعدت للمتقين } ومرتين مقيدتين، فقال: { واتقوا الله } { واتقوا النار } فقوله تعالى: { يا أيها الذين آمنوا } كل ما في القرآن من قوله تعالى: { يا أيها الذين آمنوا } افعلوا كذا، أو اتركوا كذا، يدل على أن الإيمان هو السبب الداعي والموجب لامتثال ذلك الأمر، واجتناب ذلك النهي؛ لأن الإيمان هو التصديق الكامل بما يجب التصديق به، المستلزم لأعمال الجوارح، فنهاهم عن أكل الربا أضعافا مضاعفة، وذلك هو ما اعتاده أهل الجاهلية، ومن لا يبالي بالأوامر الشرعية من أنه إذا حل الدين، على المعسر ولم يحصل منه شيء، قالوا له: إما أن تقضي ما عليك من الدين، وإما أن نزيد في المدة، ويزيد ما في ذمتك، فيضطر الفقير ويستدفع غريمه ويلتزم ذلك، اغتناما لراحته الحاضرة، ، فيزداد -بذلك- ما في ذمته أضعافا مضاعفة، من غير نفع وانتفاع. ففي قوله: { أضعافًا مضاعفة } تنبيه على شدة شناعته بكثرته، وتنبيه لحكمة تحريمه، وأن تحريم الربا حكمته أن الله منع منه لما فيه من الظلم. وذلك أن الله أوجب إنظار المعسر، وبقاء ما في ذمته من غير زيادة، فإلزامه بما فوق ذلك ظلم متضاعف، فيتعين على المؤمن المتقي تركه وعدم قربانه، لأن تركه من موجبات التقوى. والفلاح متوقف على التقوى\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُواْ ٱلرِّبَوٰٓاْ أَضۡعَٰفٗا مُّضَٰعَفَةٗۖ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ ٠٣١"
    },
    {
      "number": 424,
      "text": "وَاتَّقُوا النَّارَ الَّتِي أُعِدَّتْ لِلْكَافِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 131,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 55,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱتَّقُواْ ٱلنَّارَ ٱلَّتِيٓ أُعِدَّتۡ لِلۡكَٰفِرِينَ ١٣١\n                                    \n                                    \n                                    ثم توعدهم بالنار وحذرهم منها ، فقال : ( واتقوا النار التي أعدت للكافرين وأطيعوا الله والرسول لعلكم ترحمون ) .\n                                    ",
        "qortoby": "وَٱتَّقُواْ ٱلنَّارَ ٱلَّتِيٓ أُعِدَّتۡ لِلۡكَٰفِرِينَ ١٣١\n                                    \n                                    \n                                    ثم خوفهم فقال : واتقوا النار التي أعدت للكافرين قال كثير من المفسرين : وهذا الوعيد لمن استحل الربا ، ومن استحل الربا فإنه يكفر ويكفر . وقيل : معناه اتقوا العمل الذي ينزع منكم الإيمان فتستوجبون النار ; لأن من الذنوب ما يستوجب به صاحبه نزع الإيمان ويخاف عليه ; من ذلك عقوق الوالدين . وقد جاء في ذلك أثر أن رجلا كان عاقا لوالديه يقال له علقمة ; فقيل له عند الموت : قل لا إله إلا الله ، فلم يقدر على ذلك حتى جاءته أمه فرضيت عنه . ومن ذلك قطيعة الرحم وأكل الربا والخيانة في الأمانة وذكر أبو بكر الوراق عن أبي حنيفة أنه قال : أكثر ما ينزع الإيمان من العبد عند الموت . ثم قال أبو بكر : فنظرنا في الذنوب التي تنزع الإيمان فلم نجد شيئا أسرع نزعا للإيمان من ظلم العباد . وفي هذه الآية دليل على أن النار مخلوقة ردا على الجهمية ; لأن المعدوم لا يكون معدا .\n                                    ",
        "saadi": "وَٱتَّقُواْ ٱلنَّارَ ٱلَّتِيٓ أُعِدَّتۡ لِلۡكَٰفِرِينَ ١٣١\n                                        \n                                        \n                                        \n                                        { واتقوا النار التي أعدت للكافرين } بترك ما يوجب دخولها، من الكفر والمعاصي، على اختلاف درجاتها، فإن المعاصي كلها- وخصوصا المعاصي الكبار- تجر إلى الكفر، بل هي من خصال الكفر الذي أعد الله النار لأهله، فترك المعاصي ينجي من النار، ويقي من سخط الجبار، وأفعال الخير والطاعة توجب رضا الرحمن، ودخول الجنان، وحصول الرحمة\n                                    "
      },
      "originalText": "وَٱتَّقُواْ ٱلنَّارَ ٱلَّتِيٓ أُعِدَّتۡ لِلۡكَٰفِرِينَ ١٣١"
    },
    {
      "number": 425,
      "text": "وَأَطِيعُوا اللَّهَ وَالرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 132,
      "juz": 4,
      "manzil": 1,
      "page": 66,
      "ruku": 55,
      "hizbQuarter": 26,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَأَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَ لَعَلَّكُمۡ تُرۡحَمُونَ ٢٣١\n                                    \n                                    \n                                    وَأَطِيعُوا اللَّهَ وَالرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ\n                                    ",
        "qortoby": "وَأَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَ لَعَلَّكُمۡ تُرۡحَمُونَ ٢٣١\n                                    \n                                    \n                                    ثم قال : وأطيعوا الله يعني أطيعوا الله في الفرائض والرسول في السنن : وقيل : أطيعوا الله في تحريم الربا والرسول فيما بلغكم من التحريم . لعلكم ترحمون أي كي يرحمكم الله . وقد تقدم .\n                                    ",
        "saadi": "وَأَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَ لَعَلَّكُمۡ تُرۡحَمُونَ ٢٣١\n                                        \n                                        \n                                        \n                                        { وأطيعوا الله والرسول } بفعل الأوامر امتثالا، واجتناب النواهي { لعلكم ترحمون } فطاعة الله وطاعة رسوله، من أسباب حصول الرحمة كما قال تعالى: { ورحمتي وسعت كل شيء فسأكتبها للذين يتقون ويؤتون الزكاة } الآيات.\n                                    "
      },
      "originalText": "وَأَطِيعُواْ ٱللَّهَ وَٱلرَّسُولَ لَعَلَّكُمۡ تُرۡحَمُونَ ٢٣١"
    }
  ]
}