{
  "number": 68,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 434,
      "text": "وَلِيُمَحِّصَ اللَّهُ الَّذِينَ آمَنُوا وَيَمْحَقَ الْكَافِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 141,
      "juz": 4,
      "manzil": 1,
      "page": 68,
      "ruku": 55,
      "hizbQuarter": 27,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِيُمَحِّصَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَيَمۡحَقَ ٱلۡكَٰفِرِينَ ١٤١\n                                    \n                                    \n                                    أي : يكفر عنهم من ذنوبهم ، إن كان لهم ذنوب وإلا رفع لهم في درجاتهم بحسب ما أصيبوا به ، وقوله : ( ويمحق الكافرين ) أي : فإنهم إذا ظفروا بغوا وبطروا فيكون ذلك سبب دمارهم وهلاكهم ومحقهم وفنائهم .\n                                    ",
        "qortoby": "وَلِيُمَحِّصَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَيَمۡحَقَ ٱلۡكَٰفِرِينَ ١٤١\n                                    \n                                    \n                                    قوله تعالى : وليمحص الله الذين آمنوا ويمحق الكافرين فيه ثلاثة أقوال : يمحص يختبر . الثاني : يطهر ; أي من ذنوبهم فهو على حذف مضاف . المعنى : وليمحص الله ذنوب الذين آمنوا ; قاله الفراء . الثالث : يمحص يخلص ; فهذا أغربها . قال الخليل : يقال محص الحبل يمحص محصا إذا انقطع وبره ; ومنه ( اللهم محص عنا ذنوبنا ) أي خلصنا من عقوبتها . وقال أبو إسحاق الزجاج : قرأت على محمد بن يزيد عن الخليل : التمحيص التخليص . يقال : محصه يمحصه محصا إذا خلصه ; فالمعنى عليه ليبتلي المؤمنين ليثيبهم ويخلصهم من ذنوبهم . ويمحق الكافرين أي يستأصلهم بالهلاك .\n                                    ",
        "saadi": "وَلِيُمَحِّصَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَيَمۡحَقَ ٱلۡكَٰفِرِينَ ١٤١\n                                        \n                                        \n                                        \n                                        { وليمحص الله الذين آمنوا } وهذا أيضا من الحكم أن الله يمحص بذلك المؤمنين من ذنوبهم وعيوبهم، يدل ذلك على أن الشهادة والقتال في سبيل الله يكفر الذنوب، ويزيل العيوب، وليمحص الله أيضا المؤمنين من غيرهم من المنافقين، فيتخلصون منهم، ويعرفون المؤمن من المنافق، ومن الحكم أيضا أنه يقدر ذلك، ليمحق الكافرين، أي: ليكون سببا لمحقهم واستئصالهم بالعقوبة، فإنهم إذا انتصروا، بغوا، وازدادوا طغيانا إلى طغيانهم، يستحقون به المعاجلة بالعقوبة، رحمة بعباده المؤمنين.\n                                    "
      },
      "originalText": "وَلِيُمَحِّصَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَيَمۡحَقَ ٱلۡكَٰفِرِينَ ١٤١"
    },
    {
      "number": 435,
      "text": "أَمْ حَسِبْتُمْ أَنْ تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُوا مِنْكُمْ وَيَعْلَمَ الصَّابِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 142,
      "juz": 4,
      "manzil": 1,
      "page": 68,
      "ruku": 55,
      "hizbQuarter": 27,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَمۡ حَسِبۡتُمۡ أَن تَدۡخُلُواْ ٱلۡجَنَّةَ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَيَعۡلَمَ ٱلصَّٰبِرِينَ ٢٤١\n                                    \n                                    \n                                    ثم قال : ( أم حسبتم أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين ) أي : أحسبتم أن تدخلوا الجنة ولم تبتلوا بالقتال والشدائد ، كما قال تعالى في سورة البقرة : ( أم حسبتم أن تدخلوا الجنة ولما يأتكم مثل الذين خلوا من قبلكم مستهم البأساء والضراء وزلزلوا [ حتى يقول الرسول والذين آمنوا معه متى نصر الله ألا إن نصر الله قريب ] ) [ البقرة : 214 ] وقال تعالى : ( الم أحسب الناس أن يتركوا أن يقولوا آمنا وهم لا يفتنون ولقد فتنا الذين من قبلهم فليعلمن الله الذين صدقوا وليعلمن الكاذبين ) [ العنكبوت : 1 - 3 ] ، ولهذا قال هاهنا : ( أم حسبتم أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين ) أي : لا يحصل لكم دخول الجنة حتى تبتلوا ويرى الله منكم المجاهدين في سبيله والصابرين على مقارنة الأعداء .\n                                    ",
        "qortoby": "أَمۡ حَسِبۡتُمۡ أَن تَدۡخُلُواْ ٱلۡجَنَّةَ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَيَعۡلَمَ ٱلصَّٰبِرِينَ ٢٤١\n                                    \n                                    \n                                    قوله تعالى : أم حسبتم أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين\n\" أم \" بمعنى بل . وقيل : الميم زائدة ، والمعنى أحسبتم يا من انهزم يوم أحد أن تدخلوا الجنة كما دخل الذين قتلوا وصبروا على ألم الجراح والقتل من غير أن تسلكوا طريقهم وتصبروا صبرهم لا ; حتى يعلم الله الذين جاهدوا منكم أي علم شهادة حتى يقع عليه الجزاء . والمعنى : ولم تجاهدوا فيعلم ذلك منكم ; فلما بمعنى \" لم \" . وفرق سيبويه بين \" لم \" و \" لما \" فزعم أن \" لم يفعل \" نفي فعل ، وأن : \" لما يفعل \" . نفي قد فعل . ويعلم الصابرين منصوب بإضمار أن ; عن الخليل . وقرأ الحسن ويحيى بن يعمر \" يعلم الصابرين \" بالجزم على النسق . وقرئ بالرفع على القطع ، أي وهو يعلم . وروى هذه القراءة عبد الوارث عن أبي عمرو . وقال الزجاج . الواو هنا بمعنى حتى ، أي ولما يعلم الله الذين جاهدوا منكم حتى يعلم صبرهم كما تقدم آنفا .\n                                    ",
        "saadi": "أَمۡ حَسِبۡتُمۡ أَن تَدۡخُلُواْ ٱلۡجَنَّةَ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَيَعۡلَمَ ٱلصَّٰبِرِينَ ٢٤١\n                                        \n                                        \n                                        \n                                        ثم قال تعالى: { أم حسبتم أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين } هذا استفهام إنكاري، أي: لا تظنوا، ولا يخطر ببالكم أن تدخلوا الجنة من دون مشقة واحتمال المكاره في سبيل الله وابتغاء مرضاته، فإن الجنة أعلى المطالب، وأفضل ما به يتنافس المتنافسون، وكلما عظم المطلوب عظمت وسيلته، والعمل الموصل إليه، فلا يوصل إلى الراحة إلا بترك الراحة، ولا يدرك النعيم إلا بترك النعيم، ولكن مكاره الدنيا التي تصيب العبد في سبيل الله عند توطين النفس لها، وتمرينها عليها ومعرفة ما تئول إليه، تنقلب عند أرباب البصائر منحا يسرون بها، ولا يبالون بها، وذلك فضل الله يؤتيه من يشاء.\n                                    "
      },
      "originalText": "أَمۡ حَسِبۡتُمۡ أَن تَدۡخُلُواْ ٱلۡجَنَّةَ وَلَمَّا يَعۡلَمِ ٱللَّهُ ٱلَّذِينَ جَٰهَدُواْ مِنكُمۡ وَيَعۡلَمَ ٱلصَّٰبِرِينَ ٢٤١"
    },
    {
      "number": 436,
      "text": "وَلَقَدْ كُنْتُمْ تَمَنَّوْنَ الْمَوْتَ مِنْ قَبْلِ أَنْ تَلْقَوْهُ فَقَدْ رَأَيْتُمُوهُ وَأَنْتُمْ تَنْظُرُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 143,
      "juz": 4,
      "manzil": 1,
      "page": 68,
      "ruku": 55,
      "hizbQuarter": 27,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَقَدۡ كُنتُمۡ تَمَنَّوۡنَ ٱلۡمَوۡتَ مِن قَبۡلِ أَن تَلۡقَوۡهُ فَقَدۡ رَأَيۡتُمُوهُ وَأَنتُمۡ تَنظُرُونَ ٣٤١\n                                    \n                                    \n                                    وقوله : ( ولقد كنتم تمنون الموت من قبل أن تلقوه فقد رأيتموه وأنتم تنظرون ) أي : قد كنتم - أيها المؤمنون - قبل هذا اليوم تتمنون لقاء العدو وتتحرقون عليهم ، وتودون مناجزتهم ومصابرتهم ، فها قد حصل لكم الذي تمنيتموه وطلبتموه ، فدونكم فقاتلوا وصابروا .\nوقد ثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال : \" لا تمنوا لقاء العدو ، وسلوا الله العافية ، فإذا لقيتموهم فاصبروا ، واعلموا أن الجنة تحت ظلال السيوف \" .\nولهذا قال : ( فقد رأيتموه ) يعني الموت شاهدتموه في لمعان السيوف وحد الأسنة واشتباك الرماح ، وصفوف الرجال للقتال .\nوالمتكلمون يعبرون عن هذا بالتخييل ، وهو مشاهدة ما ليس بمحسوس كالمحسوس كما تتخيل الشاة صداقة الكبش وعداوة الذئب .\n                                    ",
        "qortoby": "وَلَقَدۡ كُنتُمۡ تَمَنَّوۡنَ ٱلۡمَوۡتَ مِن قَبۡلِ أَن تَلۡقَوۡهُ فَقَدۡ رَأَيۡتُمُوهُ وَأَنتُمۡ تَنظُرُونَ ٣٤١\n                                    \n                                    \n                                    قوله تعالى : ولقد كنتم تمنون الموت من قبل أن تلقوه فقد رأيتموه وأنتم تنظرون\nقوله تعالى : ولقد كنتم تمنون الموت أي الشهادة من قبل أن تلقوه . وقرأ الأعمش \" من قبل أن تلاقوه \" أي من قبل القتل . وقيل : من قبل أن تلقوا أسباب الموت وذلك أن كثيرا ممن لم يحضروابدرا كانوا يتمنون يوما يكون فيه قتال ، فلما كان يوم أحد انهزموا ، وكان منهم من تجلد حتى قتل ، ومنهم أنس بن النضر عم أنس بن مالك ، فإنه قال لما انكشف المسلمون : اللهم إني أبرأ إليك مما جاء به هؤلاء ، وباشر القتال وقال : إيها إنها ريح الجنة ! إني لأجدها ، ومضى حتى استشهد . قال أنس : فما عرفناه إلا ببنانه ووجدنا فيه بضعا وثمانين جراحة . وفيه وفي أمثاله نزل رجال صدقوا ما عاهدوا الله عليه . فالآية عتاب في حق من انهزم ، لا سيما وكان منهم حمل للنبي - صلى الله عليه وسلم - على الخروج من المدينة ، وسيأتي . وتمني الموت يرجع من المسلمين إلى تمني الشهادة المبنية على الثبات والصبر على الجهاد ، لا إلى قتل الكفار لهم ; لأنه معصية وكفر ولا يجوز إرادة المعصية ، وعلى هذا يحمل سؤال المسلمين من الله أن يرزقهم الشهادة ، فيسألون الصبر على الجهاد وإن أدى إلى القتل .\nقوله تعالى : وأنتم تنظرون قال الأخفش : هو تكرير بمعنى التأكد لقوله : فقد رأيتموه مثل ولا طائر يطير بجناحيه . وقيل : معناه وأنتم بصراء ليس في أعينكم علل ; كما تقول : قد رأيت كذا وكذا وليس في عينيك علة ، أي فقد رأيته رؤية حقيقية ; وهذا راجع إلى معنى التوكيد . وقال بعضهم : وأنتم تنظرون إلى محمد - صلى الله عليه وسلم - . وفي الآية إضمار ، أي فقد رأيتموه وأنتم تنظرون فلم انهزمتم ؟\n                                    ",
        "saadi": "وَلَقَدۡ كُنتُمۡ تَمَنَّوۡنَ ٱلۡمَوۡتَ مِن قَبۡلِ أَن تَلۡقَوۡهُ فَقَدۡ رَأَيۡتُمُوهُ وَأَنتُمۡ تَنظُرُونَ ٣٤١\n                                        \n                                        \n                                        \n                                        ثم وبخهم تعالى على عدم صبرهم بأمر كانوا يتمنونه ويودون حصوله، فقال: { ولقد كنتم تمنون الموت من قبل أن تلقوه } وذلك أن كثيرا من الصحابة رضي الله عنهم ممن فاته بدر يتمنون أن يحضرهم الله مشهدا يبذلون فيه جهدهم، قال الله [تعالى] لهم: { فقد رأيتموه } أي: رأيتم ما تمنيتم بأعينكم { وأنتم تنظرون } فما بالكم وترك الصبر؟ هذه حالة لا تليق ولا تحسن، خصوصا لمن تمنى ذلك، وحصل له ما تمنى، فإن الواجب عليه بذل الجهد، واستفراغ الوسع في ذلك. وفي هذه الآية دليل على أنه لا يكره تمني الشهادة، ووجه الدلالة أن الله تعالى أقرهم على أمنيتهم، ولم ينكر عليهم، وإنما أنكر عليهم عدم العمل بمقتضاها، والله أعلم.\n                                    "
      },
      "originalText": "وَلَقَدۡ كُنتُمۡ تَمَنَّوۡنَ ٱلۡمَوۡتَ مِن قَبۡلِ أَن تَلۡقَوۡهُ فَقَدۡ رَأَيۡتُمُوهُ وَأَنتُمۡ تَنظُرُونَ ٣٤١"
    },
    {
      "number": 437,
      "text": "وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ ۚ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَىٰ أَعْقَابِكُمْ ۚ وَمَنْ يَنْقَلِبْ عَلَىٰ عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا ۗ وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 144,
      "juz": 4,
      "manzil": 1,
      "page": 68,
      "ruku": 56,
      "hizbQuarter": 27,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا مُحَمَّدٌ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُۚ أَفَإِيْن مَّاتَ أَوۡ قُتِلَ ٱنقَلَبۡتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡۚ وَمَن يَنقَلِبۡ عَلَىٰ عَقِبَيۡهِ فَلَن يَضُرَّ ٱللَّهَ شَيۡ‍ٔٗاۗ وَسَيَجۡزِي ٱللَّهُ ٱلشَّٰكِرِينَ ٤٤١\n                                    \n                                    \n                                    لما انهزم من انهزم من المسلمين يوم أحد ، وقتل من قتل منهم ، نادى الشيطان : ألا إن محمدا قد قتل . ورجع ابن قميئة إلى المشركين فقال لهم : قتلت محمدا . وإنما كان قد ضرب رسول الله صلى الله عليه وسلم ، فشجه في رأسه ، فوقع ذلك في قلوب كثير من الناس واعتقدوا أن رسول الله قد قتل ، وجوزوا عليه ذلك ، كما قد قص الله عن كثير من الأنبياء ، عليهم السلام ، فحصل وهن وضعف وتأخر عن القتال ففي ذلك أنزل الله [ عز وجل ] على رسوله صلى الله عليه وسلم : ( وما محمد إلا رسول قد خلت من قبله الرسل ) أي : له أسوة بهم في الرسالة وفي جواز القتل عليه .\nقال ابن أبي نجيح ، عن أبيه ، أن رجلا من المهاجرين مر على رجل من الأنصار وهو يتشحط في دمه ، فقال له : يا فلان أشعرت أن محمدا صلى الله عليه وسلم قد قتل ؟ فقال الأنصاري : إن كان محمد [ صلى الله عليه وسلم ] قد قتل فقد بلغ ، فقاتلوا عن دينكم ، فنزل : ( وما محمد إلا رسول قد خلت من قبله الرسل ) رواه [ الحافظ أبو بكر ] البيهقي في دلائل النبوة .\nثم قال تعالى منكرا على من حصل له ضعف : ( أفإن مات أو قتل انقلبتم على أعقابكم ) أي : رجعتم القهقرى ( ومن ينقلب على عقبيه فلن يضر الله شيئا وسيجزي الله الشاكرين ) أي الذين قاموا بطاعته وقاتلوا عن دينه ، واتبعوا رسوله حيا وميتا .\nوكذلك ثبت في الصحاح والمساند والسنن وغيرها من كتب الإسلام من طرق متعددة تفيد القطع ، وقد ذكرت ذلك في مسندي الشيخين أبي بكر وعمر ، رضي الله عنهما ، أن الصديق - رضي الله عنه - تلا هذه الآية لما مات رسول الله صلى الله عليه وسلم .\nوقال البخاري : حدثنا يحيى بن بكير ، حدثنا الليث ، عن عقيل عن ابن شهاب ، أخبرني أبو سلمة ، أن عائشة ، رضي الله عنها ، أخبرته أن أبا بكر ، رضي الله عنه ، أقبل على فرس من مسكنه بالسنح حتى نزل فدخل المسجد ، فلم يكلم الناس حتى دخل على عائشة فتيمم رسول الله صلى الله عليه وسلم وهو مغشى بثوب حبرة ، فكشف عن وجهه [ صلى الله عليه وسلم ] ثم أكب عليه وقبله وبكى ، ثم قال : بأبي أنت وأمي . والله لا يجمع الله عليك موتتين ، أما الموتة التي كتبت عليك فقد متها .\nوقال الزهري : وحدثني أبو سلمة عن ابن عباس ، أن أبا بكر خرج وعمر يحدث الناس فقال : اجلس يا عمر فأبى عمر أن يجلس ، فأقبل الناس إليه وتركوا عمر ، فقال أبو بكر : أما بعد ، من كان يعبد محمدا فإن محمدا قد مات ، ومن كان يعبد الله فإن الله حي لا يموت ، قال الله تعالى : ( وما محمد إلا رسول قد خلت من قبله الرسل ) إلى قوله : ( وسيجزي الله الشاكرين ) قال : فوالله لكأن الناس لم يعلموا أن الله أنزل هذه الآية حتى تلاها أبو بكر ، فتلقاها الناس منه كلهم ، فما سمعها بشر من الناس إلا تلاها .\nوأخبرني سعيد بن المسيب أن عمر قال : والله ما هو إلا أن سمعت أبا بكر تلاها فعقرت حتى ما تقلني رجلاي وحتى هويت إلى الأرض .\nوقال أبو القاسم الطبراني : حدثنا علي بن عبد العزيز ، حدثنا عمرو بن حماد بن طلحة القناد ، حدثنا أسباط بن نصر ، عن سماك بن حرب ، عن عكرمة ، عن ابن عباس أن عليا كان يقول في حياة رسول الله : ( أفإن مات أو قتل انقلبتم على أعقابكم ) والله لا ننقلب على أعقابنا بعد إذ هدانا الله ، والله لئن مات أو قتل لأقاتلن على ما قاتل عليه حتى أموت ، والله إني لأخوه ، ووليه ، وابن عمه ، ووارثه فمن أحق به مني ؟ .\n                                    ",
        "qortoby": "وَمَا مُحَمَّدٌ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُۚ أَفَإِيْن مَّاتَ أَوۡ قُتِلَ ٱنقَلَبۡتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡۚ وَمَن يَنقَلِبۡ عَلَىٰ عَقِبَيۡهِ فَلَن يَضُرَّ ٱللَّهَ شَيۡ‍ٔٗاۗ وَسَيَجۡزِي ٱللَّهُ ٱلشَّٰكِرِينَ ٤٤١\n                                    \n                                    \n                                    قوله تعالى : وما محمد إلا رسول قد خلت من قبله الرسل أفإن مات أو قتل انقلبتم على أعقابكم ومن ينقلب على عقبيه فلن يضر الله شيئا وسيجزي الله الشاكرين\nفيه خمس مسائل :\nالأولى : روي أنها نزلت بسبب انهزام المسلمين يوم أحد حين صاح الشيطان : قد قتل محمد . قال عطية العوفي : فقال بعض الناس : قد أصيب محمد فأعطوهم بأيديكم فإنما هم إخوانكم . وقال بعضهم : إن كان محمد قد أصيب ألا تمضون على ما مضى عليه نبيكم حتى تلحقوا به ; فأنزل الله تعالى في ذلك وما محمد إلا رسول قد خلت من قبله الرسل إلى قوله : فآتاهم الله ثواب الدنيا . و \" ما \" نافية ، وما بعدها ابتداء وخبر ، وبطل عمل \" ما \" . وقرأ ابن عباس \" قد خلت من قبله رسل \" بغير ألف ولام . فأعلم الله تعالى في هذه الآية أن الرسل ليست بباقية في قومها أبدا ، وأنه يجب التمسك بما أتت به الرسل وإن فقد الرسول بموت أو قتل . وأكرم نبيه - صلى الله عليه وسلم - وصفيه باسمين مشتقين من اسمه : محمد وأحمد ، تقول العرب : رجل محمود ومحمد إذا كثرت خصاله المحمودة ، قال الشاعر :\nإلى الماجد القرم الجواد المحمد\nوقد مضى هذا في الفاتحة . وقال عباس بن مرداس :\nيا خاتم النبآء إنك مرسل بالخير كل هدى السبيل هداكا\nإن الإله بنى عليك محبة في خلقه ومحمدا سماكا\nفهذه الآية من تتمة العتاب مع المنهزمين ، أي لم يكن لهم الانهزام وإن قتل محمد ، والنبوة لا تدرأ الموت ، والأديان لا تزول بموت الأنبياء ، والله أعلم .\nالثانية : هذه الآية أدل دليل على شجاعة الصديق وجراءته ، فإن الشجاعة والجرأة حدهما ثبوت القلب عند حلول المصائب ، ولا مصيبة أعظم من موت النبي - صلى الله عليه وسلم - كما تقدم بيانه في \" البقرة \" فظهرت عنده شجاعته وعلمه . قال الناس : لم يمت رسول الله - صلى الله عليه وسلم - منهم عمر ، وخرس عثمان ، واستخفى علي ، واضطرب الأمر فكشفه الصديق بهذه الآية حين قدومه من مسكنه بالسنح ، الحديث ; كذا في البخاري . وفي سنن ابن ماجه عن عائشة قالت : لما قبض رسول الله - صلى الله عليه وسلم - وأبو بكر عند امرأته ابنة خارجة بالعوالي ، فجعلوا يقولون : لم يمت النبي - صلى الله عليه وسلم - إنما هو بعض ما كان يأخذه عند الوحي . فجاء أبو بكر فكشف عن وجهه وقبل بين عينيه وقال : أنت أكرم على الله من أن يميتك مرتين . قد والله مات رسول الله - صلى الله عليه وسلم - وعمر في ناحية المسجد يقول : والله ما مات رسول الله - صلى الله عليه وسلم - ولا يموت حتى يقطع أيدي أناس من المنافقين كثير وأرجلهم . فقام أبو بكر فصعد المنبر فقال : من كان يعبد الله فإن الله حي لم يمت ، ومن كان يعبد محمدا فإن محمدا قد مات وما محمد إلا رسول قد خلت من قبله الرسل أفإن مات أو قتل انقلبتم على أعقابكم ومن ينقلب على عقبيه فلن يضر الله شيئا وسيجزي الله الشاكرين . قال عمر : \" فلكأني لم أقرأها إلا يومئذ \" . ورجع عن مقالته التي قالها فيما ذكر الوائلي أبو نصر عبيد الله في كتابه الإبانة : عن أنس بن مالك أنه سمع عمر بن الخطاب حين بويع أبو بكر في مسجد رسول الله - صلى الله عليه وسلم - واستوى على منبر رسول الله - صلى الله عليه وسلم - تشهد قبلأبي بكر فقال : أما بعد فإني قلت لكم أمس مقالة وإنها لم تكن كما قلت ، وإني والله ما وجدت المقالة التي قلت لكم في كتاب أنزله الله ولا في عهد عهده إلي رسول الله - صلى الله عليه وسلم - ولكني كنت أرجو أن يعيش رسول الله - صلى الله عليه وسلم - حتى يدبرنا - يريد أن يقول حتى يكون آخرنا موتا - فاختار الله عز وجل لرسوله الذي عنده على الذي عندكم ، وهذا الكتاب الذي هدى الله به رسوله فخذوا به تهتدوا لما هدي له رسول الله - صلى الله عليه وسلم - . قال الوائلي أبو نصر : المقالة التي قالها ثم رجع عنها هي \" أن النبي - صلى الله عليه وسلم - لم يمت ولن يموت حتى يقطع أيدي رجال وأرجلهم \" وكان قال ذلك لعظيم ما ورد عليه ، وخشي الفتنة وظهور المنافقين ، فلما شاهد قوة يقينالصديق الأكبر أبي بكر ، وتفوهه بقول الله عز وجل : كل نفس ذائقة الموت وقوله : إنك ميت وإنهم ميتون وما قاله ذلك اليوم تنبيه وتثبيت وقال : كأني لم أسمع بالآية إلا من أبي بكر . وخرج الناس يتلونها في سكك المدينة ، كأنها لم تنزل قط إلا ذلك اليوم ومات - صلى الله عليه وسلم - يوم الاثنين بلا اختلاف ، في وقت دخولهالمدينة في هجرته حين اشتد الضحاء ، ودفن يوم الثلاثاء ، وقيل ليلة الأربعاء . وقالت صفية بنت عبد المطلب ترثي رسول الله - صلى الله عليه وسلم - :\nألا يا رسول الله كنت رجاءنا وكنت بنا برا ولم تك جافيا\nوكنت رحيما هاديا ومعلما ليبك عليك اليوم من كان باكيا\nلعمرك ما أبكي النبي لفقده ولكن لما أخشى من الهرج آتيا\nكأن على قلبي لذكر محمد وما خفت من بعد النبي المكاويا\nأفاطم صلى الله رب محمد على جدث أمسى بيثرب ثاويا\nفدى لرسول الله أمي وخالتي وعمي وآبائي ونفسي وماليا\nصدقت وبلغت الرسالة صادقا ومت صليب العود أبلج صافيا\nفلو أن رب الناس أبقى نبينا سعدنا ولكن أمره كان ماضيا\nعليك من الله السلام تحية وأدخلت جنات من العدن راضيا\nأرى حسنا أيتمته وتركته يبكي ويدعو جده اليوم ناعيا\nفإن قيل وهي :\nالثالثة : فلم أخر دفن رسول الله - صلى الله عليه وسلم - وقد قال لأهل بيت أخروا دفن ميتهم : ( عجلوا دفن جيفتكم ولا تؤخروها ) . فالجواب من ثلاثة أوجه : الأول : ما ذكرناه من عدم اتفاقهم على موته . الثاني : لأنهم لا يعلمون حيث يدفنونه . قال قوم في البقيع ، وقال آخرون في المسجد ، وقال قوم : يحبس حتى يحمل إلى أبيه إبراهيم . حتى قال العالم الأكبر : سمعته يقول : ما دفن نبي إلا حيث يموت ذكره ابن ماجه والموطأ وغيرهما . الثالث : أنهم اشتغلوا بالخلاف الذي وقع بين المهاجرين والأنصار في البيعة ، فنظروا فيها حتى استتب الأمر وانتظم الشمل واستوثقت الحال ، واستقرت الخلافة في نصابها فبايعوا أبا بكر ، ثم بايعوه من الغد بيعة أخرى عن ملأ منهم ورضا ; فكشف الله به الكربة من أهل الردة ، وقام به الدين ، والحمد لله رب العالمين . ثم رجعوا بعد ذلك إلى النبي - صلى الله عليه وسلم - فنظروا في دفنه وغسلوه وكفنوه ، والله أعلم .\nالرابعة : واختلف هل صلي عليه أم لا ، فمنهم من قال : لم يصل عليه أحد ، وإنما وقف كل واحد يدعو ، لأنه كان أشرف من أن يصلى عليه . وقال ابن العربي : وهذا كلام ضعيف ; لأن السنة تقام بالصلاة عليه في الجنازة ، كما تقام بالصلاة عليه في الدعاء ، فيقول : اللهم صل على محمد إلى يوم القيامة ، وذلك منفعة لنا . وقيل : لم يصل عليه ; لأنه لم يكن هناك إمام . وهذا ضعيف لأن الذي كان يقيم بهم الصلاة الفريضة هو الذي كان يؤم بهم في الصلاة . وقيل : صلى عليه الناس أفذاذا ; لأنه كان آخر العهد به ، فأرادوا أن يأخذ كل أحد بركته مخصوصا دون أن يكون فيها تابعا لغيره . والله أعلم بصحة ذلك .\nقلت : قد خرج ابن ماجه بإسناد حسن بل صحيح من حديث ابن عباس وفيه : فلما فرغوا من جهازه يوم الثلاثاء وضع على سريره في بيته ، ثم دخل الناس على رسول الله - صلى الله عليه وسلم - أرسالا يصلون عليه ، حتى إذا فرغوا أدخلوا النساء ، حتى إذا فرغن أدخلوا الصبيان ، ولم يؤم الناس على رسول الله - صلى الله عليه وسلم - أحد . خرجه عن نصر بن علي الجهضمي أنبأنا وهب بن جرير حدثنا أبي عن محمد بن إسحاق . قال حدثني حسين بن عبد الله عن عكرمة عن ابن عباس ، الحديث بطوله .\nالخامسة : في تغيير الحال بعد موت النبي - صلى الله عليه وسلم - عن أنس قال : لما كان اليوم الذي دخل فيه رسول الله - صلى الله عليه وسلم - المدينة أضاء منها كل شيء ، فلما كان اليوم الذي مات فيه أظلم منها كل شيء ، وما نفضنا عن النبي - صلى الله عليه وسلم - الأيدي حتى أنكرنا قلوبنا . أخرجه ابن ماجه ، وقال : حدثنا محمد بن بشار أخبرنا عبد الرحمن بن مهدي حدثنا سفيان عن عبد الله بن دينار عن ابن عمر قال : كنا نتقي الكلام والانبساط إلى نسائنا على عهد رسول الله - صلى الله عليه وسلم - مخافة أن ينزل فينا القرآن ، فلما مات رسول الله - صلى الله عليه وسلم - تكلمنا . وأسند عن أم سلمة بنت أبي أمية زوج النبي - صلى الله عليه وسلم - أنها قالت : كان الناس في عهد رسول الله - صلى الله عليه وسلم - إذا قام المصلي يصلي لم يعد بصر أحدهم موضع قدميه ، فلما توفي رسول الله - صلى الله عليه وسلم - وكان أبو بكر ، فكان الناس إذا قام أحدهم يصلي لم يعد بصر أحدهم موضع جبينه ، فتوفي أبو بكر وكان عمر ، فكان الناس إذا قام أحدهم يصلي لم يعد بصر أحدهم موضع القبلة ، فكان عثمان بن عفان فكانت الفتنة فتلفت الناس في الصلاة يمينا وشمالا .\nقوله تعالى : أفإن مات أو قتل انقلبتم على أعقابكم أفإن مات شرط أو قتل عطف عليه ، والجواب انقلبتم . ودخل حرف الاستفهام على حرف الجزاء لأن الشرط قد انعقد به وصار جملة واحدة وخبرا واحدا . والمعنى : أفتنقلبون على أعقابكم إن مات أو قتل ؟ وكذلك كل استفهام دخل على حرف الجزاء ; فإنه في غير موضعه ، وموضعه أن يكون قبل جواب الشرط . وقوله انقلبتم على أعقابكم تمثيل ، ومعناه ارتددتم كفارا بعد إيمانكم ، قال قتادة وغيره . ويقال لمن عاد إلى ما كان عليه : انقلب على عقبيه . ومنه نكص على عقبيه . وقيل : المراد بالانقلاب هنا الانهزام ، فهو حقيقة لا مجاز . وقيل : المعنى فعلتم فعل المرتدين وإن لم تكن ردة .\nقوله تعالى : ومن ينقلب على عقبيه فلن يضر الله شيئا بل يضر نفسه ويعرضها للعقاب بسبب المخالفة ، والله تعالى لا تنفعه الطاعة ولا تضره المعصية لغناه . وسيجزي الله الشاكرين ، أي الذين صبروا وجاهدوا واستشهدوا . وجاء وسيجزي الله الشاكرين بعد قوله : فلن يضر الله شيئا فهو اتصال وعد بوعيد .\n                                    ",
        "saadi": "وَمَا مُحَمَّدٌ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُۚ أَفَإِيْن مَّاتَ أَوۡ قُتِلَ ٱنقَلَبۡتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡۚ وَمَن يَنقَلِبۡ عَلَىٰ عَقِبَيۡهِ فَلَن يَضُرَّ ٱللَّهَ شَيۡ‍ٔٗاۗ وَسَيَجۡزِي ٱللَّهُ ٱلشَّٰكِرِينَ ٤٤١\n                                        \n                                        \n                                        \n                                        يقول تعالى: { وما محمد إلا رسول قد خلت من قبله الرسل } أي: ليس ببدع من الرسل، بل هو من جنس الرسل الذين قبله، وظيفتهم تبليغ رسالات ربهم وتنفيذ أوامره، ليسوا بمخلدين، وليس بقاؤهم شرطا في امتثال أوامر الله، بل الواجب على الأمم عبادة ربهم في كل وقت وبكل حال، ولهذا قال: { أفإن مات أو قتل انقلبتم على أعقابكم } بترك ما جاءكم من إيمان أو جهاد، أو غير ذلك. قال [الله] تعالى: { ومن ينقلب على عقبيه فلن يضر الله شيئا } إنما يضر نفسه، وإلا فالله تعالى غني عنه، وسيقيم دينه، ويعز عباده المؤمنين، فلما وبخ تعالى من انقلب على عقبيه، مدح من ثبت مع رسوله، وامتثل أمر ربه، فقال: { وسيجزي الله الشاكرين } والشكر لا يكون إلا بالقيام بعبودية الله تعالى في كل حال. وفي هذه الآية الكريمة إرشاد من الله تعالى لعباده أن يكونوا بحالة لا يزعزعهم عن إيمانهم أو عن بعض لوازمه، فقدُ رئيس ولو عظم، وما ذاك إلا بالاستعداد في كل أمر من أمور الدين بعدة أناس من أهل الكفاءة فيه، إذا فقد أحدهم قام به غيره، وأن يكون عموم المؤمنين قصدهم إقامة دين الله، والجهاد عنه، بحسب الإمكان، لا يكون لهم قصد في رئيس دون رئيس، فبهذه الحال يستتب لهم أمرهم، وتستقيم أمورهم. وفي هذه الآية أيضا أعظم دليل على فضيلة الصديق الأكبر أبي بكر، وأصحابه الذين قاتلوا المرتدين بعد رسول الله صلى الله عليه وسلم لأنهم هم سادات الشاكرين.\n                                    "
      },
      "originalText": "وَمَا مُحَمَّدٌ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُۚ أَفَإِيْن مَّاتَ أَوۡ قُتِلَ ٱنقَلَبۡتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡۚ وَمَن يَنقَلِبۡ عَلَىٰ عَقِبَيۡهِ فَلَن يَضُرَّ ٱللَّهَ شَيۡ‍ٔٗاۗ وَسَيَجۡزِي ٱللَّهُ ٱلشَّٰكِرِينَ ٤٤١"
    },
    {
      "number": 438,
      "text": "وَمَا كَانَ لِنَفْسٍ أَنْ تَمُوتَ إِلَّا بِإِذْنِ اللَّهِ كِتَابًا مُؤَجَّلًا ۗ وَمَنْ يُرِدْ ثَوَابَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَنْ يُرِدْ ثَوَابَ الْآخِرَةِ نُؤْتِهِ مِنْهَا ۚ وَسَنَجْزِي الشَّاكِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 145,
      "juz": 4,
      "manzil": 1,
      "page": 68,
      "ruku": 56,
      "hizbQuarter": 27,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كَانَ لِنَفۡسٍ أَن تَمُوتَ إِلَّا بِإِذۡنِ ٱللَّهِ كِتَٰبٗا مُّؤَجَّلٗاۗ وَمَن يُرِدۡ ثَوَابَ ٱلدُّنۡيَا نُؤۡتِهِۦ مِنۡهَا وَمَن يُرِدۡ ثَوَابَ ٱلۡأٓخِرَةِ نُؤۡتِهِۦ مِنۡهَاۚ وَسَنَجۡزِي ٱلشَّٰكِرِينَ ٥٤١\n                                    \n                                    \n                                    وقوله : ( وما كان لنفس أن تموت إلا بإذن الله كتابا مؤجلا ) أي : لا يموت أحد إلا بقدر الله ، وحتى يستوفي المدة التي ضربها الله له ، ولهذا قال : ( كتابا مؤجلا ) كقوله ( وما يعمر من معمر ولا ينقص من عمره إلا في كتاب ) [ فاطر : 11 ] وكقوله ( هو الذي خلقكم من طين ثم قضى أجلا وأجل مسمى عنده ) [ الأنعام : 2 ] .\nوهذه الآية فيها تشجيع للجبناء وترغيب لهم في القتال ، فإن الإقدام والإحجام لا ينقص من العمر ولا يزيد فيه كما قال ابن أبي حاتم :\nحدثنا العباس بن يزيد العبدي قال : سمعت أبا معاوية ، عن الأعمش ، عن حبيب بن صهبان ، قال : قال رجل من المسلمين - وهو حجر بن عدي - : ما يمنعكم أن تعبروا إلى هؤلاء العدو ، هذه النطفة ؟ - يعني دجلة - ( وما كان لنفس أن تموت إلا بإذن الله كتابا مؤجلا ) ثم أقحم فرسه دجلة فلما أقحم أقحم الناس فلما رآهم العدو قالوا : دبوان ، فهربوا .\nوقوله : ( ومن يرد ثواب الدنيا نؤته منها ومن يرد ثواب الآخرة نؤته منها ) أي : من كان عمله للدنيا فقد نال منها ما قدره الله له ، ولم يكن له في الآخرة [ من ] نصيب ، ومن قصد بعمله الدار الآخرة أعطاه الله منها مع ما قسم له في الدنيا كما قال : ( من كان يريد حرث الآخرة نزد له في حرثه ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب ) [ الشورى : 20 ] وقال تعالى : ( من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها مذموما مدحورا ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكورا ) [ الإسراء : 18 ، 19 ] وهكذا قال هاهنا : ( وسنجزي الشاكرين ) أي : سنعطيهم من فضلنا ورحمتنا في الدنيا والآخرة بحسب شكرهم وعملهم .\n                                    ",
        "qortoby": "وَمَا كَانَ لِنَفۡسٍ أَن تَمُوتَ إِلَّا بِإِذۡنِ ٱللَّهِ كِتَٰبٗا مُّؤَجَّلٗاۗ وَمَن يُرِدۡ ثَوَابَ ٱلدُّنۡيَا نُؤۡتِهِۦ مِنۡهَا وَمَن يُرِدۡ ثَوَابَ ٱلۡأٓخِرَةِ نُؤۡتِهِۦ مِنۡهَاۚ وَسَنَجۡزِي ٱلشَّٰكِرِينَ ٥٤١\n                                    \n                                    \n                                    وله تعالى : وما كان لنفس أن تموت إلا بإذن الله كتابا مؤجلا ومن يرد ثواب الدنيا نؤته منها ومن يرد ثواب الآخرة نؤته منها وسنجزي الشاكرين\nقوله تعالى : وما كان لنفس أن تموت إلا بإذن الله كتابا مؤجلا هذا حض على الجهاد ، وإعلام أن الموت لا بد منه وأن كل إنسان مقتول أو غير مقتول ميت إذا بلغ أجله المكتوب له ; لأن معنى مؤجلا إلى أجل . ومعنى بإذن الله بقضاء الله وقدره . و كتابا نصب على المصدر ، أي كتب الله كتابا مؤجلا . وأجل الموت هو الوقت الذي في معلومه سبحانه ، أن روح الحي تفارق جسده ، ومتى قتل العبد علمنا أن ذلك أجله . ولا يصح أن يقال : لو لم يقتل لعاش . والدليل على قوله : كتابا مؤجلا إذا جاء أجلهم لا يستأخرون ساعة ولا يستقدمون إن أجل الله لآت لكل أجل كتاب . والمعتزلي يقول : يتقدم الأجل ويتأخر ، وإن من قتل فإنما يهلك قبل أجله ، وكذلك كل ما ذبح من الحيوان كان هلاكه قبل أجله ; لأنه يجب على القاتل الضمان والدية . وقد بين الله تعالى في هذه الآية أنه لا تهلك نفس قبل أجلها . وسيأتي لهذا مزيد بيان في \" الأعراف \" إن شاء الله تعالى . وفيه دليل على كتب العلم وتدوينه . وسيأتي بيانه في \" طه \" عند قوله . قال علمها عند ربي في كتاب إن شاء الله تعالى .\nقوله تعالى : ومن يرد ثواب الدنيا نؤته منها يعني الغنيمة . نزلت في الذين تركوا المركز طلبا للغنيمة . وقيل : هي عامة في كل من أراد الدنيا دون الآخرة ; والمعنى نؤته منها ما قسم له . وفي التنزيل : من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد\nومن يرد ثواب الآخرة نؤته منها أي نؤته جزاء عمله ، على ما وصف الله تعالى من تضعيف الحسنات لمن يشاء . وقيل : المراد منها عبد الله بن جبير ومن لزم المركز معه حتى قتلوا . وسنجزي الشاكرين أي نؤتيهم الثواب الأبدي جزاء لهم على ترك الانهزام ، فهو تأكيد ما تقدم من إيتاء مزيد الآخرة . وقيل : وسنجزي الشاكرين من الرزق في الدنيا لئلا يتوهم أن الشاكر يحرم ما قسم له مما يناله الكافر .\n                                    ",
        "saadi": "وَمَا كَانَ لِنَفۡسٍ أَن تَمُوتَ إِلَّا بِإِذۡنِ ٱللَّهِ كِتَٰبٗا مُّؤَجَّلٗاۗ وَمَن يُرِدۡ ثَوَابَ ٱلدُّنۡيَا نُؤۡتِهِۦ مِنۡهَا وَمَن يُرِدۡ ثَوَابَ ٱلۡأٓخِرَةِ نُؤۡتِهِۦ مِنۡهَاۚ وَسَنَجۡزِي ٱلشَّٰكِرِينَ ٥٤١\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى أن النفوس جميعها متعلقة بآجالها بإذن الله وقدره وقضائه، فمن حتَّم عليه بالقدر أن يموت، مات ولو بغير سبب، ومن أراد بقاءه، فلو أتى من الأسباب كل سبب، لم يضره ذلك قبل بلوغ أجله، وذلك أن الله قضاه وقدره وكتبه إلى أجل مسمى: { إذا جاء أجلهم فلا يستأخرون ساعة ولا يستقدمون } ثم أخبر تعالى أنه يعطي الناس من ثواب الدنيا والآخرة ما تعلقت به إراداتهم، فقال: { ومن يرد ثواب الدنيا نؤته منها ومن يرد ثواب الآخرة نؤته منها } قال الله تعالى: { كلاًّ نمدُّ هؤلاء وهؤلاء من عطاء ربك وما كان عطاء ربك محظورا انظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا } { وسنجزي الشاكرين } ولم يذكر جزاءهم ليدل ذلك على كثرته وعظمته، وليعلم أن الجزاء على قدر الشكر، قلة وكثرة وحسنا.\n                                    "
      },
      "originalText": "وَمَا كَانَ لِنَفۡسٍ أَن تَمُوتَ إِلَّا بِإِذۡنِ ٱللَّهِ كِتَٰبٗا مُّؤَجَّلٗاۗ وَمَن يُرِدۡ ثَوَابَ ٱلدُّنۡيَا نُؤۡتِهِۦ مِنۡهَا وَمَن يُرِدۡ ثَوَابَ ٱلۡأٓخِرَةِ نُؤۡتِهِۦ مِنۡهَاۚ وَسَنَجۡزِي ٱلشَّٰكِرِينَ ٥٤١"
    },
    {
      "number": 439,
      "text": "وَكَأَيِّنْ مِنْ نَبِيٍّ قَاتَلَ مَعَهُ رِبِّيُّونَ كَثِيرٌ فَمَا وَهَنُوا لِمَا أَصَابَهُمْ فِي سَبِيلِ اللَّهِ وَمَا ضَعُفُوا وَمَا اسْتَكَانُوا ۗ وَاللَّهُ يُحِبُّ الصَّابِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 146,
      "juz": 4,
      "manzil": 1,
      "page": 68,
      "ruku": 56,
      "hizbQuarter": 27,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَكَأَيِّن مِّن نَّبِيّٖ قَٰتَلَ مَعَهُۥ رِبِّيُّونَ كَثِيرٞ فَمَا وَهَنُواْ لِمَآ أَصَابَهُمۡ فِي سَبِيلِ ٱللَّهِ وَمَا ضَعُفُواْ وَمَا ٱسۡتَكَانُواْۗ وَٱللَّهُ يُحِبُّ ٱلصَّٰبِرِينَ ٦٤١\n                                    \n                                    \n                                    ثم قال تعالى - مسليا للمسلمين عما كان وقع في نفوسهم يوم أحد - : ( وكأين من نبي قاتل معه ربيون كثير ) قيل : معناه : كم من نبي قتل وقتل معه ربيون من أصحابه كثير . وهذا القول هو اختيار ابن جرير ، فإنه قال : وأما الذين قرءوا : ( قتل معه ربيون كثير ) فإنهم قالوا : إنما عنى بالقتل النبي وبعض من معه من الربيين دون جميعهم ، وإنما نفى الوهن والضعف عمن بقي من الربيين ممن لم يقتل .\nقال : ومن قرأ ( قاتل ) فإنه اختار ذلك لأنه قال : لو قتلوا لم يكن لقوله : ( فما وهنوا ) وجه معروف ، لأنهم يستحيل أن يوصفوا بأنهم لم يهنوا ولم يضعفوا بعد ما قتلوا .\nثم اختار قراءة من قرأ ( قتل معه ربيون كثير ) ، لأن الله [ تعالى ] عاتب بهذه الآيات والتي قبلها من انهزم يوم أحد ، وتركوا القتال أو سمعوا الصائح يصيح : \" إن محمدا قد قتل \" . فعذلهم الله على فرارهم وتركهم القتال فقال لهم : ( أفإن مات أو قتل ) أيها المؤمنون ارتددتم عن دينكم وانقلبتم على أعقابكم ؟ .\nوقيل : وكم من نبي قتل بين يديه من أصحابه ربيون كثير .\nوكلام ابن إسحاق في السيرة يقتضي قولا آخر ، [ فإنه ] قال : أي وكأين من نبي أصابه القتل ، ومعه ربيون ، أي : جماعات فما وهنوا بعد نبيهم ، وما ضعفوا عن عدوهم ، وما استكانوا لما أصابهم في الجهاد عن الله وعن دينهم ، وذلك الصبر ، ( والله يحب الصابرين ) .\nفجعل قوله : ( معه ربيون كثير ) حالا وقد نصر هذا القول السهيلي وبالغ فيه ، وله اتجاه لقوله : ( فما وهنوا لما أصابهم ) الآية ، وكذلك حكاه الأموي في مغازيه ، عن كتاب محمد بن إبراهيم ، ولم يقل غيره .\nوقرأ بعضهم : ( قاتل معه ربيون كثير ) قال سفيان الثوري ، عن عاصم ، عن زر ، عن ابن مسعود ( ربيون كثير ) أي : ألوف .\nوقال ابن عباس ، ومجاهد وسعيد بن جبير ، وعكرمة ، والحسن ، وقتادة ، والسدي ، والربيع ، وعطاء الخراساني : الربيون : الجموع الكثيرة .\nوقال عبد الرزاق ، عن معمر عن الحسن : ( ربيون كثير ) أي : علماء كثير ، وعنه أيضا : علماء صبر أبرار أتقياء .\nوحكى ابن جرير ، عن بعض نحاة البصرة : أن الربيين هم الذين يعبدون الرب ، عز وجل ، قال : ورد بعضهم عليه قال : لو كان كذلك لقيل ربيون ، بفتح الراء .\nوقال ابن زيد : \" الربيون : الأتباع ، والرعية ، والربابيون : الولاة .\n( فما وهنوا لما أصابهم في سبيل الله وما ضعفوا وما استكانوا ) قال قتادة والربيع بن أنس : ( وما ضعفوا ) بقتل نبيهم ( وما استكانوا ) يقول : فما ارتدوا عن نصرتهم ولا عن دينهم ، أن قاتلوا على ما قاتل عليه نبي الله حتى لحقوا بالله .\nوقال ابن عباس ( وما استكانوا ) تخشعوا . وقال السدي وابن زيد : وما ذلوا لعدوهم .\nوقال محمد بن إسحاق ، وقتادة والسدي : أي ما أصابهم ذلك حين قتل نبيهم .\n( والله يحب الصابرين)\n                                    ",
        "qortoby": "وَكَأَيِّن مِّن نَّبِيّٖ قَٰتَلَ مَعَهُۥ رِبِّيُّونَ كَثِيرٞ فَمَا وَهَنُواْ لِمَآ أَصَابَهُمۡ فِي سَبِيلِ ٱللَّهِ وَمَا ضَعُفُواْ وَمَا ٱسۡتَكَانُواْۗ وَٱللَّهُ يُحِبُّ ٱلصَّٰبِرِينَ ٦٤١\n                                    \n                                    \n                                    قوله تعالى : وكأين من نبي قاتل معه ربيون كثير فما وهنوا لما أصابهم في سبيل الله وما ضعفوا وما استكانوا والله يحب الصابرين\nقوله تعالى : وكأين من نبي قاتل معه ربيون كثير قال الزهري : صاح الشيطان يوم أحد : قتل محمد ; فانهزم جماعة من المسلمين . قال كعب بن مالك : فكنت أول من عرف رسول الله - صلى الله عليه وسلم - رأيت عينيه من تحت المغفر تزهران ، فناديت بأعلى صوتي : هذا رسول الله - صلى الله عليه وسلم - فأومأ إلي أن اسكت ، فأنزل الله عز وجل : وكأين من نبي قاتل معه ربيون كثير فما وهنوا لما أصابهم في سبيل الله وما ضعفوا الآية . و كأين بمعنى كم . قال الخليل وسيبويه : هي أي دخلت عليها كاف التشبيه وبنيت معها فصار في الكلام معنى وكم وصورت في المصحف نونا ; لأنها كلمة . نقلت عن أصلها فغير لفظها لتغير معناها ، ثم كثر استعمالها فتلعبت بها العرب وتصرفت فيها بالقلب والحذف ، فحصل فيها لغات أربع قرئ بها . وقرأ ابن كثير \" وكائن \" مثل وكاعن ، على وزن فاعل ، وأصله كيء فقلبت الياء ألفا ، كما قلبت في ييأس فقيل ياءس ; قال الشاعر :\nوكائن بالأباطح من صديق يراني لو أصبت هو المصابا\nوقال آخر :\nوكائن رددنا عنكم من مدجج يجيء أمام الركب يردي مقنعا\nوقال آخر :\nوكائن في المعاشر من أناس أخوهم فوقهم وهم كرام\nوقرأ ابن محيصن \" وكئن \" مهموزا مقصورا مثل وكعن ، وهو من كائن حذفت ألفه . وعنه أيضا \" وكأين \" مثل وكعين وهو مقلوب كيء المخفف . وقرأ الباقون كأين بالتشديد مثل كعين وهو الأصل ، قال الشاعر :\nكأين من أناس لم يزالوا أخوهم فوقهم وهم كرام\nوقال آخر :\nكأين أبدنا من عدو بعزنا وكائن أجرنا من ضعيف وخائف\nفجمع بين لغتين : كأين وكائن ، ولغة خامسة كيئن مثل كيعن ، وكأنه مخفف من كيء مقلوب كأين . ولم يذكر الجوهري غير لغتين : كائن مثل كاعن ، وكأين مثل كعين ; تقول كأين رجلا لقيت ; بنصب ما بعد كأين على التمييز . وتقول أيضا : كأين من رجل لقيت ; وإدخال \" من \" بعد كأين أكثر من النصب بها وأجود . وبكأين تبيع هذا الثوب ؟ أي بكم تبيع ; قال ذو الرمة :\nوكائن ذعرنا من مهاة ورامح بلاد العدا ليست له ببلاد\nقال النحاس : ووقف أبو عمرو \" وكأي \" بغير نون ; لأنه تنوين . وروى ذلك سورة بن المبارك عن الكسائي . ووقف الباقون بالنون اتباعا لخط المصحف . ومعنى الآية تشجيع المؤمنين ، والأمر بالاقتداء بمن تقدم من خيار أتباع الأنبياء ; أي كثير من الأنبياء قتل معه ربيون كثير ، أو كثير من الأنبياء قتلوا فما ارتد أممهم ; قولان : الأول للحسن وسعيد بن جبير . قال الحسن : ما قتل نبي في حرب قط . وقال ابن جبير : ما سمعنا أن نبيا قتل في القتال . والثاني عن قتادة وعكرمة . والوقف - على هذا القول - على \" قتل \" جائز ، وهي قراءة نافع وابن جبير وأبي عمرو ويعقوب . وهي قراءة ابن عباس واختارها أبو حاتم . وفيه وجهان : أحدهما أن يكون \" قتل \" واقعا على النبي وحده ، وحينئذ يكون تمام الكلام عند قوله \" قتل \" ويكون في الكلام إضمار ، أي ومعه ربيون كثير ; كما يقال : قتل الأمير معه جيش عظيم ، أي ومعه جيش . وخرجت معي تجارة ; أي ومعي . الوجه الثاني أن يكون القتل نال النبي ومن معه من الربيين ، ويكون وجه الكلام قتل بعض من كان معه ; تقول العرب : قتلنا بني تميم وبني سليم ، وإنما قتلوا بعضهم . ويكون قوله فما وهنوا راجعا إلى من بقي منهم . قلت : وهذا القول أشبه بنزول الآية وأنسب ، فإن النبي - صلى الله عليه وسلم - لم يقتل ، وقتل معه جماعة من أصحابه . وقرأ الكوفيون وابن عامر قاتل وهي قراءة ابن مسعود ; واختارها أبو عبيد وقال . إن الله إذا حمد من قاتل كان من قتل داخلا فيه ، وإذا حمد من قتل لم يدخل فيه غيرهم ; فقاتل أعم وأمدح . و \" الربيون \" بكسر الراء قراءة الجمهور . وقراءة علي - رضي الله عنه - بضمها . وابن عباس بفتحها ; ثلاث لغات . والربيون الجماعات الكثيرة ; عن مجاهد . وقتادة والضحاك وعكرمة ، واحدهم ربي بضم الراء وكسرها ; منسوب إلى الربة بكسر الراء أيضا وضمها ، وهي الجماعة . وقال عبد الله بن مسعود : الربيون الألوف الكثيرة . وقال ابن زيد : الربيون الأتباع . والأول أعرف في اللغة ; ومنه يقال للخرقة التي تجمع فيها القداح : ربة وربة . والرباب قبائل تجمعت . وقال أبان بن ثعلب : الربي عشرة آلاف . وقال الحسن : هم العلماء الصبر . ابن عباس ومجاهد وقتادة والربيع والسدي : الجمع الكثير ; قال حسان :\nوإذا معشر تجافوا عن الحق حملنا عليهم ربيا\nوقال الزجاج : هاهنا قراءتان \" ربيون \" بضم الراء \" وربيون \" بكسر الراء ; أما الربيون ( بالضم ) : الجماعات الكثيرة . ويقال : عشرة آلاف . قلت : وقد روي عن ابن عباس \" ربيون \" بفتح الراء منسوب إلى الرب . قال الخليل : الربي الواحد من العباد الذين صبروا مع الأنبياء . وهم الربانيون نسبوا إلى التأله والعبادة ومعرفة الربوبية لله تعالى ، والله أعلم .\nقوله تعالى : فما وهنوا لما أصابهم في سبيل الله وهنوا أي ضعفوا ، وقد تقدم . والوهن انكسار الجد بالخوف . وقرأ الحسن وأبو السمال \" وهنوا \" بكسر الهاء وضمها ، لغتان عن أبي زيد . وهن الشيء يهن وهنا . وأوهنته أنا ووهنته ضعفته . والواهنة : أسفل الأضلاع وقصارها . والوهن من الإبل : الكثيف . والوهن : ساعة تمضي من الليل ، وكذلك الموهن . وأوهنا صرنا في تلك الساعة ; أي ما وهنوا لقتل نبيهم ، أو لقتل من قتل منهم ، أي ما وهن باقيهم ; فحذف المضاف . وما ضعفوا أي عن عدوهم . وما استكانوا أي لما أصابهم في الجهاد . والاستكانة : الذلة والخضوع ; وأصلها \" استكنوا \" على افتعلوا ; فأشبعت فتحة الكاف فتولدت منها ألف . ومن جعلها من الكون فهي استفعلوا ; والأول أشبه بمعنى الآية . وقرئ \" فما وهنوا وما ضعفوا \" بإسكان الهاء والعين . وحكى الكسائي \" ضعفوا \" بفتح العين . ثم أخبر تعالى عنهم بعد أن قتل منهم أو قتل نبيهم بأنهم صبروا ولم يفروا ووطنوا أنفسهم على الموت ، واستغفروا ليكون موتهم على التوبة من الذنوب إن رزقوا الشهادة ، ودعوا في الثبات حتى لا ينهزموا ، وبالنصر على أعدائهم . وخصوا الأقدام بالثبات دون غيرها من الجوارح لأن الاعتماد عليها . يقول : فهلا فعلتم وقلتم مثل ذلك يا أصحاب محمد ؟ فأجاب دعاءهم وأعطاهم النصر والظفر والغنيمة في الدنيا والمغفرة في الآخرة إذا صاروا إليها . وهكذا يفعل الله مع عباده المخلصين التائبين الصادقين الناصرين لدينه ، الثابتين عند لقاء عدوه بوعده الحق ، وقوله الصدق . والله يحب الصابرين يعني الصابرين على الجهاد .\n                                    ",
        "saadi": "وَكَأَيِّن مِّن نَّبِيّٖ قَٰتَلَ مَعَهُۥ رِبِّيُّونَ كَثِيرٞ فَمَا وَهَنُواْ لِمَآ أَصَابَهُمۡ فِي سَبِيلِ ٱللَّهِ وَمَا ضَعُفُواْ وَمَا ٱسۡتَكَانُواْۗ وَٱللَّهُ يُحِبُّ ٱلصَّٰبِرِينَ ٦٤١\n                                        \n                                        \n                                        \n                                        هذا تسلية للمؤمنين، وحث على الاقتداء بهم، والفعل كفعلهم، وأن هذا أمر قد كان متقدما، لم تزل سنة الله جارية بذلك، فقال: { وكأين من نبي } أي: وكم من نبي { قاتل معه ربيون كثير } أي: جماعات كثيرون من أتباعهم، الذين قد ربتهم الأنبياء بالإيمان والأعمال الصالحة، فأصابهم قتل وجراح وغير ذلك. { فما وهنوا لما أصابهم في سبيل الله وما ضعفوا وما استكانوا } أي: ما ضعفت قلوبهم، ولا وهنت أبدانهم، ولا استكانوا، أي: ذلوا لعدوهم، بل صبروا وثبتوا، وشجعوا أنفسهم، ولهذا قال: { والله يحب الصابرين }\n                                    "
      },
      "originalText": "وَكَأَيِّن مِّن نَّبِيّٖ قَٰتَلَ مَعَهُۥ رِبِّيُّونَ كَثِيرٞ فَمَا وَهَنُواْ لِمَآ أَصَابَهُمۡ فِي سَبِيلِ ٱللَّهِ وَمَا ضَعُفُواْ وَمَا ٱسۡتَكَانُواْۗ وَٱللَّهُ يُحِبُّ ٱلصَّٰبِرِينَ ٦٤١"
    },
    {
      "number": 440,
      "text": "وَمَا كَانَ قَوْلَهُمْ إِلَّا أَنْ قَالُوا رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 147,
      "juz": 4,
      "manzil": 1,
      "page": 68,
      "ruku": 56,
      "hizbQuarter": 27,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كَانَ قَوۡلَهُمۡ إِلَّآ أَن قَالُواْ رَبَّنَا ٱغۡفِرۡ لَنَا ذُنُوبَنَا وَإِسۡرَافَنَا فِيٓ أَمۡرِنَا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٧٤١\n                                    \n                                    \n                                    أي لم يكن لهم هِجِّيرٌ إلا ذلك ربنا اغفر لنا ذنوبنا وإسرافنا في أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين.\n                                    ",
        "qortoby": "وَمَا كَانَ قَوۡلَهُمۡ إِلَّآ أَن قَالُواْ رَبَّنَا ٱغۡفِرۡ لَنَا ذُنُوبَنَا وَإِسۡرَافَنَا فِيٓ أَمۡرِنَا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٧٤١\n                                    \n                                    \n                                    وقرأ بعضهم \" وما كان قولهم \" بالرفع ; جعل القول اسما لكان ; فيكون معناه وما كان قولهم إلا قولهم ربنا اغفر لنا ذنوبنا ومن قرأ بالنصب جعل القول خبر كان . واسمها إلا أن قالوا ربنا اغفر لنا ذنوبنا يعني الصغائر وإسرافنا يعني الكبائر . والإسراف : الإفراط في الشيء ومجاوزة الحد . وفي صحيح مسلم عن أبي موسى الأشعري عن النبي - صلى الله عليه وسلم - أنه كان يدعو بهذا الدعاء اللهم اغفر لي خطيئتي وجهلي وإسرافي في أمري وما أنت أعلم به مني وذكر الحديث . فعلى الإنسان أن يستعمل ما في كتاب الله وصحيح السنة من الدعاء ويدع ما سواه ، ولا يقول أختار كذا ; فإن الله تعالى قد اختار لنبيه وأوليائه وعلمهم كيف يدعون .\n                                    ",
        "saadi": "وَمَا كَانَ قَوۡلَهُمۡ إِلَّآ أَن قَالُواْ رَبَّنَا ٱغۡفِرۡ لَنَا ذُنُوبَنَا وَإِسۡرَافَنَا فِيٓ أَمۡرِنَا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٧٤١\n                                        \n                                        \n                                        \n                                        ثم ذكر قولهم واستنصارهم لربهم، فقال: { وما كان قولهم } أي: في تلك المواطن الصعبة { إلا أن قالوا ربنا اغفر لنا ذنوبنا وإسرافنا في أمرنا } والإسراف: هو مجاوزة الحد إلى ما حرم، علموا أن الذنوب والإسراف من أعظم أسباب الخذلان، وأن التخلي منها من أسباب النصر، فسألوا ربهم مغفرتها. ثم إنهم لم يتكلوا على ما بذلوا جهدهم به من الصبر، بل اعتمدوا على الله، وسألوه أن يثبت أقدامهم عند ملاقاة الأعداء الكافرين، وأن ينصرهم عليهم، فجمعوا بين الصبر وترك ضده، والتوبة والاستغفار، والاستنصار بربهم، لا جرم أن الله نصرهم، وجعل لهم العاقبة في الدنيا والآخرة\n                                    "
      },
      "originalText": "وَمَا كَانَ قَوۡلَهُمۡ إِلَّآ أَن قَالُواْ رَبَّنَا ٱغۡفِرۡ لَنَا ذُنُوبَنَا وَإِسۡرَافَنَا فِيٓ أَمۡرِنَا وَثَبِّتۡ أَقۡدَامَنَا وَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ٧٤١"
    },
    {
      "number": 441,
      "text": "فَآتَاهُمُ اللَّهُ ثَوَابَ الدُّنْيَا وَحُسْنَ ثَوَابِ الْآخِرَةِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 148,
      "juz": 4,
      "manzil": 1,
      "page": 68,
      "ruku": 56,
      "hizbQuarter": 27,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَ‍َٔاتَىٰهُمُ ٱللَّهُ ثَوَابَ ٱلدُّنۡيَا وَحُسۡنَ ثَوَابِ ٱلۡأٓخِرَةِۗ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ ٨٤١\n                                    \n                                    \n                                    أي النصر والظفر والعاقبة \"وحسن ثواب الآخرة\" أي جمع لهم ذلك مع هذا \"والله يحب المحسنين\".\n                                    ",
        "qortoby": "فَ‍َٔاتَىٰهُمُ ٱللَّهُ ثَوَابَ ٱلدُّنۡيَا وَحُسۡنَ ثَوَابِ ٱلۡأٓخِرَةِۗ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ ٨٤١\n                                    \n                                    \n                                    قوله تعالى : فآتاهم الله ثواب الدنيا وحسن ثواب الآخرة والله يحب المحسنين قوله تعالى : فآتاهم الله أي أعطاهم ثواب الدنيا ، يعني النصر والظفر على عدوهم . وحسن ثواب الآخرة يعني الجنة . وقرأ الجحدري \" فأثابهم الله \" من الثواب . والله يحب المحسنين تقدم .\n                                    ",
        "saadi": "فَ‍َٔاتَىٰهُمُ ٱللَّهُ ثَوَابَ ٱلدُّنۡيَا وَحُسۡنَ ثَوَابِ ٱلۡأٓخِرَةِۗ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ ٨٤١\n                                        \n                                        \n                                        \n                                        { فآتاهم الله ثواب الدنيا } من النصر والظفر والغنيمة، { وحُسن ثواب الآخرة } وهو الفوز برضا ربهم، والنعيم المقيم الذي قد سلم من جميع المنكدات، وما ذاك إلا أنهم أحسنوا له الأعمال، فجازاهم بأحسن الجزاء، فلهذا قال: { والله يحب المحسنين } في عبادة الخالق ومعاملة الخلق، ومن الإحسان أن يفعل عند جهاد الأعداء، كفعل هؤلاء الموصوفين\n                                    "
      },
      "originalText": "فَ‍َٔاتَىٰهُمُ ٱللَّهُ ثَوَابَ ٱلدُّنۡيَا وَحُسۡنَ ثَوَابِ ٱلۡأٓخِرَةِۗ وَٱللَّهُ يُحِبُّ ٱلۡمُحۡسِنِينَ ٨٤١"
    }
  ]
}