{
  "number": 70,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 447,
      "text": "ثُمَّ أَنْزَلَ عَلَيْكُمْ مِنْ بَعْدِ الْغَمِّ أَمَنَةً نُعَاسًا يَغْشَىٰ طَائِفَةً مِنْكُمْ ۖ وَطَائِفَةٌ قَدْ أَهَمَّتْهُمْ أَنْفُسُهُمْ يَظُنُّونَ بِاللَّهِ غَيْرَ الْحَقِّ ظَنَّ الْجَاهِلِيَّةِ ۖ يَقُولُونَ هَلْ لَنَا مِنَ الْأَمْرِ مِنْ شَيْءٍ ۗ قُلْ إِنَّ الْأَمْرَ كُلَّهُ لِلَّهِ ۗ يُخْفُونَ فِي أَنْفُسِهِمْ مَا لَا يُبْدُونَ لَكَ ۖ يَقُولُونَ لَوْ كَانَ لَنَا مِنَ الْأَمْرِ شَيْءٌ مَا قُتِلْنَا هَاهُنَا ۗ قُلْ لَوْ كُنْتُمْ فِي بُيُوتِكُمْ لَبَرَزَ الَّذِينَ كُتِبَ عَلَيْهِمُ الْقَتْلُ إِلَىٰ مَضَاجِعِهِمْ ۖ وَلِيَبْتَلِيَ اللَّهُ مَا فِي صُدُورِكُمْ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمْ ۗ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 154,
      "juz": 4,
      "manzil": 1,
      "page": 70,
      "ruku": 57,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ أَنزَلَ عَلَيۡكُم مِّنۢ بَعۡدِ ٱلۡغَمِّ أَمَنَةٗ نُّعَاسٗا يَغۡشَىٰ طَآئِفَةٗ مِّنكُمۡۖ وَطَآئِفَةٞ قَدۡ أَهَمَّتۡهُمۡ أَنفُسُهُمۡ يَظُنُّونَ بِٱللَّهِ غَيۡرَ ٱلۡحَقِّ ظَنَّ ٱلۡجَٰهِلِيَّةِۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلۡأَمۡرِ مِن شَيۡءٖۗ قُلۡ إِنَّ ٱلۡأَمۡرَ كُلَّهُۥ لِلَّهِۗ يُخۡفُونَ فِيٓ أَنفُسِهِم مَّا لَا يُبۡدُونَ لَكَۖ يَقُولُونَ لَوۡ كَانَ لَنَا مِنَ ٱلۡأَمۡرِ شَيۡءٞ مَّا قُتِلۡنَا هَٰهُنَاۗ قُل لَّوۡ كُنتُمۡ فِي بُيُوتِكُمۡ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيۡهِمُ ٱلۡقَتۡلُ إِلَىٰ مَضَاجِعِهِمۡۖ وَلِيَبۡتَلِيَ ٱللَّهُ مَا فِي صُدُورِكُمۡ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمۡۚ وَٱللَّهُ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ ٤٥١\n                                    \n                                    \n                                    يقول تعالى ممتنا على عباده فيما أنزل عليهم من السكينة والأمنة ، وهو النعاس الذي غشيهم وهم مستلئمو السلاح في حال همهم وغمهم ، والنعاس في مثل تلك الحال دليل على الأمان كما قال تعالى في سورة الأنفال ، في قصة بدر : ( إذ يغشيكم النعاس أمنة منه [ وينزل عليكم من السماء ماء ليطهركم به ويذهب عنكم رجز الشيطان وليربط على قلوبكم ويثبت به الأقدام ] ) [ الأنفال : 11 ] .\nوقال [ الإمام ] أبو محمد عبد الرحمن بن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا أبو نعيم ووكيع عن سفيان ، عن عاصم ، عن أبي رزين ، عن عبد الله بن مسعود قال : النعاس في القتال من الله ، وفي الصلاة من الشيطان .\nقال البخاري : قال لي خليفة : حدثنا يزيد بن زريع ، حدثنا سعيد ، عن قتادة ، عن أنس ، عن أبي طلحة ، رضي الله عنه ، قال : كنت فيمن تغشاه النعاس يوم أحد ، حتى سقط سيفي من يدي مرارا ، يسقط وآخذه ، ويسقط وآخذه .\nهكذا رواه في المغازي معلقا . ورواه في كتاب التفسير مسندا عن شيبان ، عن قتادة ، عن أنس ، عن أبي طلحة قال : غشينا النعاس ونحن في مصافنا يوم أحد . قال : فجعل سيفي يسقط من يدي وآخذه ، ويسقط وآخذه .\nوقد رواه الترمذي والنسائي والحاكم ، من حديث حماد بن سلمة ، عن ثابت ، عن أنس ، عن أبي طلحة قال : رفعت رأسي يوم أحد ، وجعلت أنظر وما منهم يومئذ أحد إلا يميد تحت حجفته من النعاس . لفظ الترمذي ، وقال : حسن صحيح .\nورواه النسائي أيضا ، عن محمد بن المثنى ، عن خالد بن الحارث ، عن أبي قتيبة ، عن ابن أبي عدي ، كلاهما عن حميد ، عن أنس قال : قال أبو طلحة : كنت فيمن ألقي عليه النعاس - الحديث .\nوهكذا روي عن الزبير وعبد الرحمن بن عوف ، رضي الله عنه .\nوقال البيهقي : أخبرنا أبو عبد الله الحافظ أخبرني أبو الحسين محمد بن يعقوب ، أخبرنا محمد بن إسحاق الثقفي ، حدثنا محمد بن عبد الله بن المبارك المخزومي ، حدثنا يونس بن محمد ، حدثنا شيبان ، عن قتادة ، حدثنا أنس بن مالك ، أن أبا طلحة قال : غشينا النعاس ونحن في مصافنا يوم أحد ، فجعل سيفي يسقط من يدي وآخذه ، ويسقط وآخذه ، قال : والطائفة الأخرى المنافقون ليس لهم هم إلا أنفسهم ، أجبن قوم وأرعنه ، وأخذله للحق ( يظنون بالله غير الحق ظن الجاهلية ) كذبة ، أهل شك وريب في الله عز وجل .\nهكذا رواه بهذه الزيادة ، وكأنها من كلام قتادة ، رحمه الله ، وهو كما قال ، فإن الله عز وجل يقول : ( ثم أنزل عليكم من بعد الغم أمنة نعاسا يغشى طائفة منكم ) يعني : أهل الإيمان واليقين والثبات والتوكل الصادق ، وهم الجازمون بأن الله سينصر رسوله وينجز له مأموله ، ولهذا قال : ( وطائفة قد أهمتهم أنفسهم ) يعني : لا يغشاهم النعاس من القلق والجزع والخوف ( يظنون بالله غير الحق ظن الجاهلية ) كما قال في الآية الأخرى : ( بل ظننتم أن لن ينقلب الرسول والمؤمنون إلى أهليهم أبدا [ وزين ذلك في قلوبكم وظننتم ظن السوء وكنتم قوما بورا ] ) [ الفتح : 12 ] وهكذا هؤلاء ، اعتقدوا أن المشركين لما ظهروا تلك الساعة أنها الفيصلة وأن الإسلام قد باد وأهله ، هذا شأن أهل الريب والشك إذا حصل أمر من الأمور الفظيعة ، تحصل لهم هذه الظنون الشنيعة .\nثم أخبر تعالى عنهم أنهم ( يقولون ) في تلك الحال : ( هل لنا من الأمر من شيء ) قال الله تعالى : ( قل إن الأمر كله لله يخفون في أنفسهم ما لا يبدون لك ) ثم فسر ما أخفوه في أنفسهم بقوله : ( يقولون لو كان لنا من الأمر شيء ما قتلنا هاهنا ) أي : يسرون هذه المقالة عن رسول الله صلى الله عليه وسلم .\nقال [ محمد ] بن إسحاق بن يسار : فحدثني يحيى بن عباد بن عبد الله بن الزبير ، عن أبيه ، عن عبد الله بن الزبير قال : قال الزبير : لقد رأيتني مع رسول الله صلى الله عليه وسلم حين اشتد الخوف علينا ، أرسل الله علينا النوم ، فما منا من رجل إلا ذقنه في صدره ، قال : فوالله إني لأسمع قول معتب بن قشير ، ما أسمعه إلا كالحلم ، [ يقول ] ( لو كان لنا من الأمر شيء ما قتلنا هاهنا ) فحفظتها منه ، وفي ذلك أنزل الله [ تعالى ] ( لو كان لنا من الأمر شيء ما قتلنا هاهنا ) لقول معتب . رواه ابن أبي حاتم .\nقال الله تعالى : ( قل لو كنتم في بيوتكم لبرز الذين كتب عليهم القتل إلى مضاجعهم ) أي : هذا قدر مقدر من الله عز وجل ، وحكم حتم لا يحاد عنه ، ولا مناص منه .\nوقوله : ( وليبتلي الله ما في صدوركم وليمحص ما في قلوبكم ) أي يختبركم بما جرى عليكم ، وليميز الخبيث من الطيب ، ويظهر أمر المؤمن والمنافق للناس في الأقوال والأفعال ، ( والله عليم بذات الصدور ) أي : بما يختلج في الصدور من السرائر والضمائر .\n                                    ",
        "qortoby": "ثُمَّ أَنزَلَ عَلَيۡكُم مِّنۢ بَعۡدِ ٱلۡغَمِّ أَمَنَةٗ نُّعَاسٗا يَغۡشَىٰ طَآئِفَةٗ مِّنكُمۡۖ وَطَآئِفَةٞ قَدۡ أَهَمَّتۡهُمۡ أَنفُسُهُمۡ يَظُنُّونَ بِٱللَّهِ غَيۡرَ ٱلۡحَقِّ ظَنَّ ٱلۡجَٰهِلِيَّةِۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلۡأَمۡرِ مِن شَيۡءٖۗ قُلۡ إِنَّ ٱلۡأَمۡرَ كُلَّهُۥ لِلَّهِۗ يُخۡفُونَ فِيٓ أَنفُسِهِم مَّا لَا يُبۡدُونَ لَكَۖ يَقُولُونَ لَوۡ كَانَ لَنَا مِنَ ٱلۡأَمۡرِ شَيۡءٞ مَّا قُتِلۡنَا هَٰهُنَاۗ قُل لَّوۡ كُنتُمۡ فِي بُيُوتِكُمۡ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيۡهِمُ ٱلۡقَتۡلُ إِلَىٰ مَضَاجِعِهِمۡۖ وَلِيَبۡتَلِيَ ٱللَّهُ مَا فِي صُدُورِكُمۡ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمۡۚ وَٱللَّهُ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ ٤٥١\n                                    \n                                    \n                                    قوله تعالى : ثم أنزل عليكم من بعد الغم أمنة نعاسا الأمنة والأمن سواء . وقيل : الأمنة إنما تكون مع أسباب الخوف ، والأمن مع عدمه . وهي منصوبة ب أنزل ، ونعاسا بدل منها . وقيل : نصب على المفعول له ; كأنه قال : أنزل عليكم للأمنة نعاسا . وقرأ ابن محيصن \" أمنة \" بسكون الميم . تفضل الله تعالى على المؤمنين بعد هذه الغموم في يوم أحد بالنعاس حتى نام أكثرهم ; وإنما ينعس من يأمن والخائف لا ينام . روى البخاري عن أنس أن أبا طلحة قال : غشينا النعاس ونحن في مصافنا يوم أحد ، قال : فجعل سيفي يسقط من يدي وآخذه ، ويسقط وآخذه .\nيغشى قرئ بالياء والتاء . الياء للنعاس ، . والتاء للأمنة . وطائفة قد أهمتهم أنفسهم والطائفة تطلق على الواحد والجماعة . يعني المنافقين : معتب بن قشير وأصحابه ، وكانوا خرجوا طمعا في الغنيمة وخوف المؤمنين فلم يغشهم النعاس وجعلوا يتأسفون على الحضور ، ويقولون الأقاويل . ومعنى قد أهمتهم أنفسهم حملتهم على الهم ، والهم ما هممت به ; يقال : أهمني الشيء أي كان من همي . وأمر مهم : شديد . وأهمني الأمر : أقلقني : وهمني : أذابني . والواو في قوله وطائفة واو الحال بمعنى إذ ، أي إذ طائفة يظنون أن أمر محمد - صلى الله عليه وسلم - باطل ، وأنه لا ينصر . ظن الجاهلية أي ظن أهل الجاهلية ، فحذف . يقولون هل لنا من الأمر من شيء لفظه استفهام ومعناه الجحد ، أي ما لنا شيء من الأمر ، أي من أمر الخروج ، وإنما خرجنا كرها ; يدل عليه قوله تعالى إخبارا عنهم : لو كان لنا من الأمر شيء ما قتلنا هاهنا . قال الزبير : أرسل علينا النوم ذلك اليوم ، وإني لأسمع قول معتب بن قشير والنعاس يغشاني يقول : لو كان لنا من الأمر شيء ما قتلنا هاهنا . وقيل : المعنى يقول ليس لنا من الظفر الذي وعدنا به محمد شيء ، والله أعلم .\nقوله تعالى : قل إن الأمر كله لله قرأ أبو عمرو ويعقوب \" كله \" بالرفع على الابتداء ، وخبره \" لله \" ، والجملة خبر \" إن \" . وهو كقوله : ويوم القيامة ترى الذين كذبوا على الله وجوههم مسودة . والباقون بالنصب ; كما تقول : إن الأمر أجمع لله . فهو توكيد ، وهو بمعنى أجمع في الإحاطة والعموم ، وأجمع لا يكون إلا توكيدا . وقيل : نعت للأمر . وقال الأخفش : بدل ; أي النصر بيد الله ينصر من يشاء ويخذل من يشاء . وقال جويبر عن الضحاك عن ابن عباس في قوله يظنون بالله غير الحق ظن الجاهلية يعني التكذيب بالقدر . وذلك أنهم تكلموا فيه ، فقال الله تعالى : قل إن الأمر كله لله يعني القدر خيره وشره من الله .\nيخفون في أنفسهم أي من الشرك والكفر والتكذيب . ما لا يبدون لك يظهرون لك . يقولون لو كان لنا من الأمر شيء ما قتلنا هاهنا أي ما قتل عشائرنا . فقيل : إن المنافقين قالوا لو كان لنا عقل ما خرجنا إلى قتال أهل مكة ، ولما قتل رؤساؤنا . فرد الله عليهم فقال : قل لو كنتم في بيوتكم لبرز أي لخرج . الذين كتب أي فرض . عليهم القتل يعني في اللوح المحفوظ . إلى مضجاعهم أي مصارعهم . وقيل : كتب عليهم القتل أي فرض عليهم القتال ، فعبر عنه بالقتل ; لأنه قد يئول إليه . وقرأ أبو حيوة \" لبرز \" بضم الباء وشد الراء ; بمعنى يجعل يخرج . وقيل : لو تخلفتم أيها المنافقون لبرزتم إلى موطن آخر غيره تصرعون فيه حتى يبتلي الله ما في الصدور ويظهره للمؤمنين . والواو في قوله : وليبتلي مقحمة كقوله : وليكون من الموقنين أي ليكون ، وحذف الفعل الذي مع لام كي . والتقدير وليبتلي الله ما في صدوركم وليمحص ما في قلوبكم فرض الله عليكم القتال والحرب ولم ينصركم يوم أحد ليختبر صبركم وليمحص عنكم سيئاتكم إن تبتم وأخلصتم . وقيل : معنى ليبتلي ليعاملكم معاملة المختبر . وقيل : ليقع منكم مشاهدة ما علمه غيبا . وقيل : هو على حذف مضاف ، والتقدير ليبتلي أولياء الله تعالى . وقد تقدم معنى التمحيص . والله عليم بذات الصدور أي ما فيها من خير وشر . وقيل : ذات الصدور هي الصدور ; لأن ذات الشيء نفسه .\n                                    ",
        "saadi": "ثُمَّ أَنزَلَ عَلَيۡكُم مِّنۢ بَعۡدِ ٱلۡغَمِّ أَمَنَةٗ نُّعَاسٗا يَغۡشَىٰ طَآئِفَةٗ مِّنكُمۡۖ وَطَآئِفَةٞ قَدۡ أَهَمَّتۡهُمۡ أَنفُسُهُمۡ يَظُنُّونَ بِٱللَّهِ غَيۡرَ ٱلۡحَقِّ ظَنَّ ٱلۡجَٰهِلِيَّةِۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلۡأَمۡرِ مِن شَيۡءٖۗ قُلۡ إِنَّ ٱلۡأَمۡرَ كُلَّهُۥ لِلَّهِۗ يُخۡفُونَ فِيٓ أَنفُسِهِم مَّا لَا يُبۡدُونَ لَكَۖ يَقُولُونَ لَوۡ كَانَ لَنَا مِنَ ٱلۡأَمۡرِ شَيۡءٞ مَّا قُتِلۡنَا هَٰهُنَاۗ قُل لَّوۡ كُنتُمۡ فِي بُيُوتِكُمۡ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيۡهِمُ ٱلۡقَتۡلُ إِلَىٰ مَضَاجِعِهِمۡۖ وَلِيَبۡتَلِيَ ٱللَّهُ مَا فِي صُدُورِكُمۡ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمۡۚ وَٱللَّهُ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ ٤٥١\n                                        \n                                        \n                                        \n                                        ويحتمل أن معنى قوله: { لكيلا تحزنوا على ما فاتكم ولا ما أصابكم } يعني: أنه قدَّر ذلك الغم والمصيبة عليكم، لكي تتوطن نفوسكم، وتمرنوا على الصبر على المصيبات، ويخف عليكم تحمل المشقات: { ثم أنزل عليكم من بعد الغم } الذي أصابكم { أمنة نعاسا يغشى طائفة منكم } ولا شك أن هذا رحمة بهم، وإحسان وتثبيت لقلوبهم، وزيادة طمأنينة؛ لأن الخائف لا يأتيه النعاس لما في قلبه من الخوف، فإذا زال الخوف عن القلب أمكن أن يأتيه النعاس. وهذه الطائفة التي أنعم الله عليها بالنعاس هم المؤمنون الذين ليس لهم هم إلا إقامة دين الله، ورضا الله ورسوله، ومصلحة إخوانهم المسلمين. وأما الطائفة الأخرى الذين { قد أهمتهم أنفسهم } فليس لهم هم في غيرها، لنفاقهم أو ضعف إيمانهم، فلهذا لم يصبهم من النعاس ما أصاب غيرهم، { يقولون هل لنا من الأمر من شيء } وهذا استفهام إنكاري، أي: ما لنا من الأمر -أي: النصر والظهور- شيء، فأساءوا الظن بربهم وبدينه ونبيه، وظنوا أن الله لا يتم أمر رسوله، وأن هذه الهزيمة هي الفيصلة والقاضية على دين الله، قال الله في جوابهم: { قل إن الأمر كله لله } الأمر يشمل الأمر القدري، والأمر الشرعي، فجميع الأشياء بقضاء الله وقدره، وعاقبة النصر والظفر لأوليائه وأهل طاعته، وإن جرى عليهم ما جرى. { يخفون } يعني المنافقين { في أنفسهم ما لا يبدون لك } ثم بين الأمر الذي يخفونه، فقال: { يقولون لو كان لنا من الأمر شيء } أي: لو كان لنا في هذه الواقعة رأي ومشورة { ما قتلنا هاهنا } وهذا إنكار منهم وتكذيب بقدر الله، وتسفيه منهم لرأي رسول الله صلى الله عليه وسلم، ورأي أصحابه، وتزكية منهم لأنفسهم، فرد الله عليهم بقوله: { قل لو كنتم في بيوتكم } التي هي أبعد شيء عن مظان القتل { لبرز الذين كتب عليهم القتل إلى مضاجعهم } فالأسباب -وإن عظمت- إنما تنفع إذا لم يعارضها القدر والقضاء، فإذا عارضها القدر لم تنفع شيئا، بل لا بد أن يمضي الله ما كتب في اللوح المحفوظ من الموت والحياة، { وليبتلي الله ما في صدوركم } أي: يختبر ما فيها من نفاق وإيمان وضعف إيمان، { وليمحص ما في قلوبكم } من وساوس الشيطان، وما تأثر عنها من الصفات غير الحميدة. { والله عليم بذات الصدور } أي: بما فيها وما أكنته، فاقتضى علمه وحكمته أن قدر من الأسباب، ما به تظهر مخبآت الصدور وسرائر الأمور.\n                                    "
      },
      "originalText": "ثُمَّ أَنزَلَ عَلَيۡكُم مِّنۢ بَعۡدِ ٱلۡغَمِّ أَمَنَةٗ نُّعَاسٗا يَغۡشَىٰ طَآئِفَةٗ مِّنكُمۡۖ وَطَآئِفَةٞ قَدۡ أَهَمَّتۡهُمۡ أَنفُسُهُمۡ يَظُنُّونَ بِٱللَّهِ غَيۡرَ ٱلۡحَقِّ ظَنَّ ٱلۡجَٰهِلِيَّةِۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلۡأَمۡرِ مِن شَيۡءٖۗ قُلۡ إِنَّ ٱلۡأَمۡرَ كُلَّهُۥ لِلَّهِۗ يُخۡفُونَ فِيٓ أَنفُسِهِم مَّا لَا يُبۡدُونَ لَكَۖ يَقُولُونَ لَوۡ كَانَ لَنَا مِنَ ٱلۡأَمۡرِ شَيۡءٞ مَّا قُتِلۡنَا هَٰهُنَاۗ قُل لَّوۡ كُنتُمۡ فِي بُيُوتِكُمۡ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيۡهِمُ ٱلۡقَتۡلُ إِلَىٰ مَضَاجِعِهِمۡۖ وَلِيَبۡتَلِيَ ٱللَّهُ مَا فِي صُدُورِكُمۡ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمۡۚ وَٱللَّهُ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ ٤٥١"
    },
    {
      "number": 448,
      "text": "إِنَّ الَّذِينَ تَوَلَّوْا مِنْكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ إِنَّمَا اسْتَزَلَّهُمُ الشَّيْطَانُ بِبَعْضِ مَا كَسَبُوا ۖ وَلَقَدْ عَفَا اللَّهُ عَنْهُمْ ۗ إِنَّ اللَّهَ غَفُورٌ حَلِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 155,
      "juz": 4,
      "manzil": 1,
      "page": 70,
      "ruku": 57,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱلَّذِينَ تَوَلَّوۡاْ مِنكُمۡ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِ إِنَّمَا ٱسۡتَزَلَّهُمُ ٱلشَّيۡطَٰنُ بِبَعۡضِ مَا كَسَبُواْۖ وَلَقَدۡ عَفَا ٱللَّهُ عَنۡهُمۡۗ إِنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ ٥٥١\n                                    \n                                    \n                                    ثم قال ( إن الذين تولوا منكم يوم التقى الجمعان إنما استزلهم الشيطان ببعض ما كسبوا ) أي : ببعض ذنوبهم السالفة ، كما قال بعض السلف : إن من ثواب الحسنة الحسنة بعدها ، وإن من جزاء السيئة السيئة بعدها .\nثم قال تعالى : ( ولقد عفا الله عنهم ) أي : عما كان منهم من الفرار ( إن الله غفور حليم ) أي : يغفر الذنب ويحلم عن خلقه ، ويتجاوز عنهم ، وقد تقدم حديث ابن عمر في شأن عثمان ، رضي الله عنه ، وتوليه يوم أحد ، وأن الله [ قد ] عفا عنهم ، عند قوله : ( ولقد عفا عنكم ) ومناسب ذكره هاهنا .\nقال الإمام أحمد : حدثنا معاوية بن عمرو ، حدثنا زائدة ، عن عاصم ، عن شقيق ، قال : لقي عبد الرحمن بن عوف الوليد بن عقبة ، فقال له الوليد : ما لي أراك جفوت أمير المؤمنين عثمان ؟ فقال له عبد الرحمن : أبلغه أني لم أفر يوم عينين - قال عاصم : يقول يوم أحد - ولم أتخلف عن بدر ، ولم أترك سنة عمر . قال : فانطلق فخبر ذلك عثمان ، قال : فقال : أما قوله : إني لم أفر يوم عينين فكيف يعيرني بذنب قد عفا الله عنه ، فقال : ( إن الذين تولوا منكم يوم التقى الجمعان إنما استزلهم الشيطان ببعض ما كسبوا ولقد عفا الله عنهم ) وأما قوله : إني تخلفت يوم بدر فإني كنت أمرض رقية بنت رسول الله صلى الله عليه وسلم حتى ماتت ، وقد ضرب لي رسول الله صلى الله عليه وسلم بسهم ، ومن ضرب له رسول الله صلى الله عليه وسلم بسهم فقد شهد . وأما قوله : \" إني لم أترك سنة عمر \" فإني لا أطيقها ولا هو ، فأته فحدثه بذلك .\n                                    ",
        "qortoby": "إِنَّ ٱلَّذِينَ تَوَلَّوۡاْ مِنكُمۡ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِ إِنَّمَا ٱسۡتَزَلَّهُمُ ٱلشَّيۡطَٰنُ بِبَعۡضِ مَا كَسَبُواْۖ وَلَقَدۡ عَفَا ٱللَّهُ عَنۡهُمۡۗ إِنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ ٥٥١\n                                    \n                                    \n                                    قوله تعالى : إن الذين تولوا منكم يوم التقى الجمعان إنما استزلهم الشيطان ببعض ما كسبوا ولقد عفا الله عنهم إن الله غفور حليم\nقوله تعالى : إنما استزلهم الشيطان ببعض ما كسبوا هذه الجملة هي خبر إن الذين تولوا والمراد من تولى عن المشركين يوم أحد ; عن عمر - رضي الله عنه - وغيره . السدي : يعني من هرب إلى المدينة في وقت الهزيمة دون من صعد الجبل . وقيل : هي في قوم بأعيانهم تخلفوا عن النبي - صلى الله عليه وسلم - في وقت هزيمتهم ثلاثة أيام ثم انصرفوا . ومعنى استزلهم الشيطان استدعى زللهم بأن ذكرهم خطايا سلفت منهم ، فكرهوا الثبوت لئلا يقتلوا . وهو معنى ببعض ما كسبوا وقيل : استزلهم حملهم على الزلل ، وهو استفعل من الزلة وهي الخطيئة . وقيل : زل وأزل بمعنى واحد . ثم قيل : كرهوا القتال قبل إخلاص التوبة ، فإنما تولوا لهذا ، وهذا على القول الأول . وعلى الثاني بمعصيتهم النبي - صلى الله عليه وسلم - في تركهم المركز وميلهم إلى الغنيمة . وقال الحسن : ما كسبوا قبولهم من إبليس ما وسوس إليهم . وقال الكلبي : زين لهم الشيطان أعمالهم . وقيل : لم يكن الانهزام معصية ; لأنهم أرادوا التحصن بالمدينة ، فيقطع العدو طمعه فيهم لما سمعوا أن النبي - صلى الله عليه وسلم - قتل . ويجوز أن يقال : لم يسمعوا دعاء النبي - صلى الله عليه وسلم - للهول الذي كانوا فيه . ويجوز أن يقال : زاد عدد العدو على الضعف ; لأنهم كانوا سبعمائة والعدو ثلاثة آلاف . وعند هذا يجوز الانهزام ولكن الانهزام عن النبي - صلى الله عليه وسلم - خطأ لا يجوز ، ولعلهم توهموا أن النبي - صلى الله عليه وسلم - انحاز إلى الجبل أيضا . وأحسنها الأول . وعلى الجملة فإن حمل الأمر على ذنب محقق فقد عفا الله عنه ، وإن حمل على انهزام مسوغ فالآية فيمن أبعد في الهزيمة وزاد على القدر المسوغ . وذكر أبو الليث السمرقندي نصر بن محمد بن إبراهيم قال : حدثنا الخليل بن أحمد قال حدثنا السراج قال حدثنا قتيبة قال حدثنا أبو بكر بن غيلان عن جرير : أن عثمان كان بينه وبين عبد الرحمن بن عوف كلام ، فقال له عبد الرحمن بن عوف : أتسبني وقد شهدت بدرا ولم تشهد ، وقد بايعت تحت الشجرة ولم تبايع ، وقد كنت تولى مع من تولى يوم الجمع ، يعني يوم أحد . فرد عليه عثمان فقال : أما قولك : أنا شهدت بدرا ولم تشهد ، فإني لم أغب عن شيء شهده رسول الله - صلى الله عليه وسلم - إلا أن بنت رسول الله - صلى الله عليه وسلم - كانت مريضة وكنت معها أمرضها ، فضرب لي رسول الله - صلى الله عليه وسلم - سهما في سهام المسلمين ، وأما بيعة الشجرة فإن رسول الله - صلى الله عليه وسلم - بعثني ربيئة على المشركين بمكة - الربيئة هو الناظر - فضرب رسول الله - صلى الله عليه وسلم - يمينه على شماله فقال : ( هذه لعثمان ) فيمين رسول الله - صلى الله عليه وسلم - وشماله خير لي من يميني وشمالي . وأما يوم الجمع فقال الله عنهم ولقد عفا الله عنهم فكنت فيمن عفا الله عنهم . فحج عثمان عبد الرحمن .\nقلت : وهذا المعنى صحيح أيضا عن ابن عمر ، كما في صحيح البخاري قال : حدثنا عبدان أخبرنا أبو حمزة عن عثمان بن موهب قال : جاء رجل حج البيت فرأى قوما جلوسا فقال : من هؤلاء القعود ؟ قالوا : هؤلاء قريش . قال : من الشيخ ؟ قالوا : ابن عمر ; فأتاه فقال : إني سائلك عن شيء أتحدثني ؟ قال : أنشدك بحرمة هذا البيت ، أتعلم أن عثمان بن عفان فر يوم أحد ؟ قال : نعم . قال : فتعلمه تغيب عن بدر فلم يشهدها ؟ قال : نعم . قال : فتعلم أنه تخلف عن بيعة الرضوان فلم يشهدها ؟ قال نعم . قال : فكبر . قال ابن عمر : تعال لأخبرك ولأبين لك عما سألتني عنه ; أما فراره يوم أحد فأشهد أن الله عفا عنه . وأما تغيبه عن بدر فإنه كان تحته بنت رسول الله - صلى الله عليه وسلم - وكانت مريضة ، فقال له النبي - صلى الله عليه وسلم - ( إن لك أجر رجل ممن شهد بدرا وسهمه ) . وأما تغيبه عن بيعة الرضوان فإنه لو كان أحد أعز ببطن مكة من عثمان بن عفان لبعثه مكانه ، فبعث عثمان وكانت بيعة الرضوان بعدما ذهب عثمان إلى مكة ; فقال النبي - صلى الله عليه وسلم - بيده اليمنى : ( هذه يد عثمان ) فضرب بها على يده فقال : ( هذه لعثمان ) . اذهب بهذا الآن معك .\nقلت : ونظير هذه الآية توبة الله على آدم عليه السلام . وقوله عليه السلام : ( فحج آدم موسى ) أي غلبه بالحجة ; وذلك أن موسى عليه السلام أراد توبيخ آدم ولومه في إخراج نفسه وذريته من الجنة بسبب أكله من الشجرة ; فقال له آدم : ( أفتلومني على أمر قدره الله تعالى علي قبل أن أخلق بأربعين سنة تاب علي منه ومن تاب عليه فلا ذنب له ومن لا ذنب له لا يتوجه عليه لوم ) . وكذلك من عفا الله عنه . وإنما كان هذا لإخباره تعالى بذلك ، وخبره صدق . وغيرهما من المذنبين التائبين يرجون رحمته ويخافون عذابه ، فهم على وجل وخوف ألا تقبل توبتهم ، وإن قبلت فالخوف أغلب عليهم إذ لا علم لهم بذلك . فاعلم .\n                                    ",
        "saadi": "إِنَّ ٱلَّذِينَ تَوَلَّوۡاْ مِنكُمۡ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِ إِنَّمَا ٱسۡتَزَلَّهُمُ ٱلشَّيۡطَٰنُ بِبَعۡضِ مَا كَسَبُواْۖ وَلَقَدۡ عَفَا ٱللَّهُ عَنۡهُمۡۗ إِنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ ٥٥١\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن حال الذين انهزموا يوم \"أحد\" وما الذي أوجب لهم الفرار، وأنه من تسويل الشيطان، وأنه تسلط عليهم ببعض ذنوبهم. فهم الذين أدخلوه على أنفسهم، ومكنوه بما فعلوا من المعاصي، لأنها مركبه ومدخله، فلو اعتصموا بطاعة ربهم لما كان له عليهم من سلطان. قال تعالى: { إن عبادي ليس لك عليهم سلطان } ثم أخبر أنه عفا عنهم بعدما فعلوا ما يوجب المؤاخذة، وإلا فلو واخذهم لاستأصلهم. { إن الله غفور } للمذنبين الخطائين بما يوفقهم له من التوبة والاستغفار، والمصائب المكفرة، { حليم } لا يعاجل من عصاه، بل يستأني به، ويدعوه إلى الإنابة إليه، والإقبال عليه. ثم إن تاب وأناب قبل منه، وصيره كأنه لم يجر منه ذنب، ولم يصدر منه عيب، فلله الحمد على إحسانه.\n                                    "
      },
      "originalText": "إِنَّ ٱلَّذِينَ تَوَلَّوۡاْ مِنكُمۡ يَوۡمَ ٱلۡتَقَى ٱلۡجَمۡعَانِ إِنَّمَا ٱسۡتَزَلَّهُمُ ٱلشَّيۡطَٰنُ بِبَعۡضِ مَا كَسَبُواْۖ وَلَقَدۡ عَفَا ٱللَّهُ عَنۡهُمۡۗ إِنَّ ٱللَّهَ غَفُورٌ حَلِيمٞ ٥٥١"
    },
    {
      "number": 449,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَكُونُوا كَالَّذِينَ كَفَرُوا وَقَالُوا لِإِخْوَانِهِمْ إِذَا ضَرَبُوا فِي الْأَرْضِ أَوْ كَانُوا غُزًّى لَوْ كَانُوا عِنْدَنَا مَا مَاتُوا وَمَا قُتِلُوا لِيَجْعَلَ اللَّهُ ذَٰلِكَ حَسْرَةً فِي قُلُوبِهِمْ ۗ وَاللَّهُ يُحْيِي وَيُمِيتُ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 156,
      "juz": 4,
      "manzil": 1,
      "page": 70,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ كَفَرُواْ وَقَالُواْ لِإِخۡوَٰنِهِمۡ إِذَا ضَرَبُواْ فِي ٱلۡأَرۡضِ أَوۡ كَانُواْ غُزّٗى لَّوۡ كَانُواْ عِندَنَا مَا مَاتُواْ وَمَا قُتِلُواْ لِيَجۡعَلَ ٱللَّهُ ذَٰلِكَ حَسۡرَةٗ فِي قُلُوبِهِمۡۗ وَٱللَّهُ يُحۡيِۦ وَيُمِيتُۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٦٥١\n                                    \n                                    \n                                    ينهى تعالى عباده المؤمنين عن مشابهة الكفار في اعتقادهم الفاسد ، الدال عليه قولهم عن إخوانهم الذين ماتوا في الأسفار وفي الحروب : لو كانوا تركوا ذلك لما أصابهم ما أصابهم . فقال : ( يا أيها الذين آمنوا لا تكونوا كالذين كفروا وقالوا لإخوانهم ) أي : عن إخوانهم ( إذا ضربوا في الأرض ) أي : سافروا للتجارة ونحوها ( أو كانوا غزى ) أي : في الغزو ( لو كانوا عندنا ) أي : في البلد ( ما ماتوا وما قتلوا ) أي : ما ماتوا في السفر ولا قتلوا في الغزو .\nوقوله : ( ليجعل الله ذلك حسرة في قلوبهم ) أي : خلق هذا الاعتقاد في نفوسهم ليزدادوا حسرة على موتهم وقتلهم ثم قال تعالى ردا عليهم : ( والله يحيي ويميت ) أي : بيده الخلق وإليه يرجع الأمر ، ولا يحيا أحد ولا يموت إلا بمشيئته وقدره ، ولا يزاد في عمر أحد ولا ينقص منه إلا بقضائه وقدره ( والله بما تعملون بصير ) أي : وعلمه وبصره نافذ في جميع خلقه ، لا يخفى عليه من أمورهم شيء .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ كَفَرُواْ وَقَالُواْ لِإِخۡوَٰنِهِمۡ إِذَا ضَرَبُواْ فِي ٱلۡأَرۡضِ أَوۡ كَانُواْ غُزّٗى لَّوۡ كَانُواْ عِندَنَا مَا مَاتُواْ وَمَا قُتِلُواْ لِيَجۡعَلَ ٱللَّهُ ذَٰلِكَ حَسۡرَةٗ فِي قُلُوبِهِمۡۗ وَٱللَّهُ يُحۡيِۦ وَيُمِيتُۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٦٥١\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا لا تكونوا كالذين كفروا وقالوا لإخوانهم إذا ضربوا في الأرض أو كانوا غزى لو كانوا عندنا ما ماتوا وما قتلوا ليجعل الله ذلك حسرة في قلوبهم والله يحيي ويميت والله بما تعملون بصير\nقوله تعالى : يا أيها الذين آمنوا لا تكونوا كالذين كفروا يعني المنافقين . وقالوا لإخوانهم يعني في النفاق أو في النسب في السرايا التي بعث النبي - صلى الله عليه وسلم - إلى بئر معونة . لو كانوا عندنا ما ماتوا وما قتلوا فنهي المسلمون أن يقولوا مثل قولهم . وقوله : إذا ضربوا هو لما مضى ; أي إذ ضربوا ; لأن في الكلام معنى الشرط من حيث كان \" الذين \" مبهما غير موقت ، فوقع \" إذا \" موقع \" إذ \" كما يقع الماضي في الجزاء موضع المستقبل . ومعنى ضربوا في الأرض سافروا فيها وساروا لتجارة أو غيرها فماتوا .\nأو كانوا غزى غزاة فقتلوا . والغزى جمع منقوص لا يتغير لفظها في رفع وخفض ، واحدهم غاز ، كراكع وركع ، وصائم وصوم ، ونائم ونوم ، وشاهد وشهد ، وغائب وغيب . ويجوز في الجمع غزاة مثل قضاة ، وغزاء بالمد مثل ضراب وصوام . ويقال : غزى جمع الغزاة . قال الشاعر :\nقل للقوافل والغزى إذا غزوا\nوروي عن الزهري أنه قرأه \" غزى \" بالتخفيف . والمغزية المرأة التي غزا زوجها . وأتان مغزية متأخرة النتاج ثم تنتج . وأغزت الناقة إذا عسر لقاحها . والغزو قصد الشيء . والمغزى المقصد . ويقال في النسب إلى الغزو : غزوي .\nقوله تعالى : ليجعل الله ذلك حسرة في قلوبهم يعني ظنهم وقولهم . واللام متعلقة بقوله قالوا أي ليجعل ظنهم أنهم لو لم يخرجوا ما قتلوا . حسرة أي ندامة في قلوبهم . والحسرة الاهتمام على فائت لم يقدر بلوغه ; قال الشاعر :\nفواحسرتي لم أقض منها لبانتي ولم أتمتع بالجوار وبالقرب\nوقيل : هي متعلقة بمحذوف . والمعنى : لا تكونوا مثلهم \" ليجعل الله ذلك \" القول \" حسرة في قلوبهم \" لأنهم ظهر نفاقهم . وقيل : المعنى لا تصدقوهم ولا تلتفتوا إليهم ; فكان ذلك حسرة في قلوبهم . وقيل : ليجعل الله ذلك حسرة في قلوبهم يوم القيامة لما هم فيه من الخزي والندامة ، ولما فيه المسلمون من النعيم والكرامة .\nوالله يحيي ويميت أي يقدر على أن يحيي من يخرج إلى القتال ، ويميت من أقام في أهله .\nوالله بما تعملون بصير قرئ بالياء والتاء . ثم أخبر تعالى أن القتل في سبيل الله والموت فيه خير من جميع الدنيا .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ كَفَرُواْ وَقَالُواْ لِإِخۡوَٰنِهِمۡ إِذَا ضَرَبُواْ فِي ٱلۡأَرۡضِ أَوۡ كَانُواْ غُزّٗى لَّوۡ كَانُواْ عِندَنَا مَا مَاتُواْ وَمَا قُتِلُواْ لِيَجۡعَلَ ٱللَّهُ ذَٰلِكَ حَسۡرَةٗ فِي قُلُوبِهِمۡۗ وَٱللَّهُ يُحۡيِۦ وَيُمِيتُۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٦٥١\n                                        \n                                        \n                                        \n                                        ينهى تعالى عباده المؤمنين أن يشابهوا الكافرين، الذين لا يؤمنون بربهم، ولا بقضائه وقدره، من المنافقين وغيرهم. ينهاهم عن مشابهتهم في كل شيء، وفي هذا الأمر الخاص وهو أنهم يقولون لإخوانهم في الدين أو في النسب: { إذا ضربوا في الأرض } أي: سافروا للتجارة { أو كانوا غزى } أي: غزاة، ثم جرى عليهم قتل أو موت، يعارضون القدر ويقولون: { لو كانوا عندنا ما ماتوا وما قتلوا } وهذا كذب منهم، فقد قال تعالى: { قل لو كنتم في بيوتكم لبرز الذين كتب عليهم القتل إلى مضاجعهم } ولكن هذا التكذيب لم يفدهم، إلا أن الله يجعل هذا القول، وهذه العقيدة حسرة في قلوبهم، فتزداد مصيبتهم، وأما المؤمنون بالله فإنهم يعلمون أن ذلك بقدر الله، فيؤمنون ويسلمون، فيهدي الله قلوبهم ويثبتها، ويخفف بذلك عنهم المصيبة. قال الله ردا عليهم: { والله يحيي ويميت } أي: هو المنفرد بذلك، فلا يغني حذر عن قدر. { والله بما تعملون بصير } فيجازيكم بأعمالكم وتكذيبكم.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ كَفَرُواْ وَقَالُواْ لِإِخۡوَٰنِهِمۡ إِذَا ضَرَبُواْ فِي ٱلۡأَرۡضِ أَوۡ كَانُواْ غُزّٗى لَّوۡ كَانُواْ عِندَنَا مَا مَاتُواْ وَمَا قُتِلُواْ لِيَجۡعَلَ ٱللَّهُ ذَٰلِكَ حَسۡرَةٗ فِي قُلُوبِهِمۡۗ وَٱللَّهُ يُحۡيِۦ وَيُمِيتُۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ ٦٥١"
    },
    {
      "number": 450,
      "text": "وَلَئِنْ قُتِلْتُمْ فِي سَبِيلِ اللَّهِ أَوْ مُتُّمْ لَمَغْفِرَةٌ مِنَ اللَّهِ وَرَحْمَةٌ خَيْرٌ مِمَّا يَجْمَعُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 157,
      "juz": 4,
      "manzil": 1,
      "page": 70,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَئِن قُتِلۡتُمۡ فِي سَبِيلِ ٱللَّهِ أَوۡ مُتُّمۡ لَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرَحۡمَةٌ خَيۡرٞ مِّمَّا يَجۡمَعُونَ ٧٥١\n                                    \n                                    \n                                    وقوله : ( ولئن قتلتم في سبيل الله أو متم لمغفرة من الله ورحمة خير مما يجمعون ) تضمن هذا أن القتل في سبيل الله ، والموت أيضا ، وسيلة إلى نيل رحمة الله وعفوه ورضوانه ، وذلك خير من البقاء في الدنيا وجمع حطامها الفاني .\n                                    ",
        "qortoby": "وَلَئِن قُتِلۡتُمۡ فِي سَبِيلِ ٱللَّهِ أَوۡ مُتُّمۡ لَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرَحۡمَةٌ خَيۡرٞ مِّمَّا يَجۡمَعُونَ ٧٥١\n                                    \n                                    \n                                    قوله تعالى : ولئن قتلتم في سبيل الله أو متم لمغفرة من الله ورحمة خير مما يجمعون\nجواب الجزاء محذوف ، استغني عنه بجواب القسم في قوله : لمغفرة من الله ورحمة وكان الاستغناء بجواب القسم أولى ; لأن له صدر الكلام ، ومعناه ليغفرن لكم . وأهل الحجاز يقولون : متم ، بكسر الميم مثل نمتم ، من مات يمات مثل خفت يخاف . وسفلى مضر يقولون : متم ، بضم الميم مثل صمتم ، من مات يموت . كقولك كان يكون ، وقال يقول . هذا قول الكوفيين وهو حسن .\n                                    ",
        "saadi": "وَلَئِن قُتِلۡتُمۡ فِي سَبِيلِ ٱللَّهِ أَوۡ مُتُّمۡ لَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرَحۡمَةٌ خَيۡرٞ مِّمَّا يَجۡمَعُونَ ٧٥١\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى أن القتل في سبيله أو الموت فيه، ليس فيه نقص ولا محذور، وإنما هو مما ينبغي أن يتنافس فيه المتنافسون، لأنه سبب مفض وموصل إلى مغفرة الله ورحمته، وذلك خير مما يجمع أهل الدنيا من دنياهم، وأن الخلق أيضا إذا ماتوا أو قتلوا بأي حالة كانت، فإنما مرجعهم إلى الله، ومآلهم إليه، فيجازي كلا بعمله، فأين الفرار إلا إلى الله، وما للخلق عاصم إلا الاعتصام بحبل الله؟\"\n                                    "
      },
      "originalText": "وَلَئِن قُتِلۡتُمۡ فِي سَبِيلِ ٱللَّهِ أَوۡ مُتُّمۡ لَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرَحۡمَةٌ خَيۡرٞ مِّمَّا يَجۡمَعُونَ ٧٥١"
    }
  ]
}