{
  "number": 71,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 451,
      "text": "وَلَئِنْ مُتُّمْ أَوْ قُتِلْتُمْ لَإِلَى اللَّهِ تُحْشَرُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 158,
      "juz": 4,
      "manzil": 1,
      "page": 71,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَئِن مُّتُّمۡ أَوۡ قُتِلۡتُمۡ لَإِلَى ٱللَّهِ تُحۡشَرُونَ ٨٥١\n                                    \n                                    \n                                    ثم أخبر بأن كل من مات أو قتل فمصيره ومرجعه إلى الله ، عز وجل ، فيجزيه بعمله ، إن خيرا فخير ، وإن شرا فشر فقال : ( ولئن متم أو قتلتم لإلى الله تحشرون )\n                                    ",
        "qortoby": "وَلَئِن مُّتُّمۡ أَوۡ قُتِلۡتُمۡ لَإِلَى ٱللَّهِ تُحۡشَرُونَ ٨٥١\n                                    \n                                    \n                                    وقوله : لإلى الله تحشرون وعظ . وعظهم الله بهذا القول ، أي لا تفروا من القتال ومما أمركم به ، بل فروا من عقابه وأليم عذابه ، فإن مردكم إليه لا يملك لكم أحد ضرا ولا نفعا غيره . والله سبحانه وتعالى أعلم .\n                                    ",
        "saadi": "وَلَئِن مُّتُّمۡ أَوۡ قُتِلۡتُمۡ لَإِلَى ٱللَّهِ تُحۡشَرُونَ ٨٥١\n                                        \n                                        \n                                        \n                                        ثم أخبر تعالى أن القتل في سبيله أو الموت فيه، ليس فيه نقص ولا محذور، وإنما هو مما ينبغي أن يتنافس فيه المتنافسون، لأنه سبب مفض وموصل إلى مغفرة الله ورحمته، وذلك خير مما يجمع أهل الدنيا من دنياهم، وأن الخلق أيضا إذا ماتوا أو قتلوا بأي حالة كانت، فإنما مرجعهم إلى الله، ومآلهم إليه، فيجازي كلا بعمله، فأين الفرار إلا إلى الله، وما للخلق عاصم إلا الاعتصام بحبل الله؟\"\n                                    "
      },
      "originalText": "وَلَئِن مُّتُّمۡ أَوۡ قُتِلۡتُمۡ لَإِلَى ٱللَّهِ تُحۡشَرُونَ ٨٥١"
    },
    {
      "number": 452,
      "text": "فَبِمَا رَحْمَةٍ مِنَ اللَّهِ لِنْتَ لَهُمْ ۖ وَلَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا مِنْ حَوْلِكَ ۖ فَاعْفُ عَنْهُمْ وَاسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِي الْأَمْرِ ۖ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللَّهِ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَوَكِّلِينَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 159,
      "juz": 4,
      "manzil": 1,
      "page": 71,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا غَلِيظَ ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ فَٱعۡفُ عَنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِي ٱلۡأَمۡرِۖ فَإِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَوَكِّلِينَ ٩٥١\n                                    \n                                    \n                                    يقول تعالى مخاطبا رسوله صلى الله عليه وسلم ، ممتنا عليه وعلى المؤمنين فيما ألان به قلبه على أمته ، المتبعين لأمره ، التاركين لزجره ، وأطاب لهم لفظه : ( فبما رحمة من الله لنت لهم ) أي : أي شيء جعلك لهم لينا لولا رحمة الله بك وبهم .\nقال قتادة : ( فبما رحمة من الله لنت لهم ) يقول : فبرحمة من الله لنت لهم . و \" ما \" صلة ، والعرب تصلها بالمعرفة كقوله : ( فبما نقضهم ميثاقهم ) [ النساء : 155 ، المائدة : 13 ] وبالنكرة كقوله : ( عما قليل ) [ المؤمنون : 40 ] وهكذا هاهنا قال : ( فبما رحمة من الله لنت لهم ) أي : برحمة من الله .\nوقال الحسن البصري : هذا خلق محمد صلى الله عليه وسلم بعثه الله به .\nوهذه الآية الكريمة شبيهة بقوله تعالى : ( لقد جاءكم رسول من أنفسكم عزيز عليه ما عنتم حريص عليكم بالمؤمنين رءوف رحيم ) [ التوبة : 128 ] .\nوقال الإمام أحمد : حدثنا حيوة ، حدثنا بقية ، حدثنا محمد بن زياد ، حدثني أبو راشد الحبراني قال : أخد بيدي أبو أمامة الباهلي وقال : أخذ بيدي رسول الله صلى الله عليه وسلم فقال : \" يا أبا أمامة ، إن من المؤمنين من يلين لي قلبه \" . انفرد به أحمد .\nثم قال تعالى : ( ولو كنت فظا غليظ القلب لانفضوا من حولك ) الفظ : الغليظ ، [ و ] المراد به هاهنا غليظ الكلام ، لقوله بعد ذلك : ( غليظ القلب ) أي : لو كنت سيئ الكلام قاسي القلب عليهم لانفضوا عنك وتركوك ، ولكن الله جمعهم عليك ، وألان جانبك لهم تأليفا لقلوبهم ، كما قال عبد الله بن عمرو : إنه رأى صفة رسول الله صلى الله عليه وسلم في الكتب المتقدمة : أنه ليس بفظ ، ولا غليظ ، ولا سخاب في الأسواق ، ولا يجزي بالسيئة السيئة ، ولكن يعفو ويصفح .\nوروى أبو إسماعيل محمد بن إسماعيل الترمذي ، أنبأنا بشر بن عبيد الدارمي ، حدثنا عمار بن عبد الرحمن ، عن المسعودي ، عن ابن أبي مليكة ، عن عائشة ، قالت : قال رسول الله صلى الله عليه وسلم : \" إن الله أمرني بمداراة الناس كما أمرني بإقامة الفرائض \" حديث غريب .\nولهذا قال تعالى : ( فاعف عنهم واستغفر لهم وشاورهم في الأمر ) ولذلك كان رسول الله صلى الله عليه وسلم يشاور أصحابه في الأمر إذا حدث ، تطييبا لقلوبهم ، ليكونوا فيما يفعلونه أنشط لهم [ كما ] شاورهم يوم بدر في الذهاب إلى العير فقالوا : يا رسول الله ، لو استعرضت بنا عرض البحر لقطعناه معك ، ولو سرت بنا إلى برك الغماد لسرنا معك ، ولا نقول لك كما قال قوم موسى لموسى : اذهب أنت وربك فقاتلا إنا هاهنا قاعدون ، ولكن نقول : اذهب ، فنحن معك وبين يديك وعن يمينك وعن [ شمالك ] مقاتلون .\nوشاورهم - أيضا - أين يكون المنزل ؟ حتى أشار المنذر بن عمرو المعنق ليموت ، بالتقدم إلى أمام القوم ، وشاورهم في أحد في أن يقعد في المدينة أو يخرج إلى العدو ، فأشار جمهورهم بالخروج إليهم ، فخرج إليهم .\nوشاورهم يوم الخندق في مصالحة الأحزاب بثلث ثمار المدينة عامئذ ، فأبى عليه ذلك السعدان : سعد بن معاذ وسعد بن عبادة ، فترك ذلك .\nوشاورهم يوم الحديبية في أن يميل على ذراري المشركين ، فقال له الصديق : إنا لم نجئ لقتال أحد ، وإنما جئنا معتمرين ، فأجابه إلى ما قال .\nوقال عليه السلام في قصة الإفك : \" أشيروا علي معشر المسلمين في قوم أبنوا أهلي ورموهم ، وايم الله ما علمت على أهلي من سوء ، وأبنوهم بمن - والله - ما علمت عليه إلا خيرا \" . واستشار عليا وأسامة في فراق عائشة ، رضي الله عنها .\nفكان [ صلى الله عليه وسلم ] يشاورهم في الحروب ونحوها . وقد اختلف الفقهاء : هل كان ذلك واجبا عليه أو من باب الندب تطييبا لقلوبهم ؟ على قولين .\nوقد قال الحاكم في مستدركه : حدثنا أبو جعفر محمد بن محمد البغدادي ، حدثنا يحيى بن أيوب العلاف بمصر ، حدثنا سعيد بن [ أبي ] مريم ، أنبأنا سفيان بن عيينة ، عن عمرو بن دينار ، عن ابن عباس في قوله : ( وشاورهم في الأمر ) قال : أبو بكر وعمر ، رضي الله عنهما . ثم قال : صحيح على شرط الشيخين ولم يخرجاه .\nوهكذا رواه الكلبي ، عن أبي صالح ، عن ابن عباس قال : نزلت في أبي بكر وعمر ، وكانا حواري رسول الله صلى الله عليه وسلم ووزيريه وأبوي المسلمين .\nوقد روى الإمام أحمد : حدثنا وكيع ، حدثنا عبد الحميد ، عن شهر بن حوشب ، عن عبد الرحمن بن غنم أن رسول الله صلى الله عليه وسلم قال لأبي بكر وعمر : \" لو اجتمعنا في مشورة ما خالفتكما \" .\nوروى ابن مردويه ، عن علي بن أبي طالب ، رضي الله عنه ، قال : سئل رسول الله صلى الله عليه وسلم عن العزم ؟ قال \" مشاورة أهل الرأي ثم اتباعهم \" .\nوقد قال ابن ماجه : حدثنا أبو بكر بن أبي شيبة ، حدثنا يحيى بن أبي بكير عن شيبان عن عبد الملك بن عمير ، عن أبي سلمة ، عن أبي هريرة ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" المستشار مؤتمن \" .\nورواه أبو داود والترمذي ، وحسنه [ و ] النسائي ، من حديث عبد الملك بن عمير بأبسط منه .\nثم قال ابن ماجه : حدثنا أبو بكر بن أبي شيبة ، حدثنا أسود بن عامر ، عن شريك ، عن الأعمش ، عن أبي عمرو الشيباني ، عن أبي مسعود قال : قال رسول الله صلى الله عليه وسلم : \" المستشار مؤتمن \" . تفرد به .\n[ وقال أيضا ] وحدثنا أبو بكر ، حدثنا يحيى بن زكريا بن أبي زائدة وعلي بن هاشم ، عن ابن أبي ليلى ، عن أبي الزبير ، عن جابر قال : قال رسول الله صلى الله عليه وسلم \" إذا استشار أحدكم أخاه فليشر عليه . تفرد به أيضا .\nوقوله : ( فإذا عزمت فتوكل على الله ) أي : إذا شاورتهم في الأمر وعزمت عليه فتوكل على الله فيه ( إن الله يحب المتوكلين )\n                                    ",
        "qortoby": "فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا غَلِيظَ ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ فَٱعۡفُ عَنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِي ٱلۡأَمۡرِۖ فَإِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَوَكِّلِينَ ٩٥١\n                                    \n                                    \n                                    قوله تعالى : فبما رحمة من الله لنت لهم ولو كنت فظا غليظ القلب لانفضوا من حولك فاعف عنهم واستغفر لهم وشاورهم في الأمر فإذا عزمت فتوكل على الله إن الله يحب المتوكلين\n\" ما \" صلة فيها معنى التأكيد ، أي فبرحمة ; كقوله : عما قليل فبما نقضهم ميثاقهم جند ما هنالك مهزوم . وليست بزائدة على الإطلاق ، وإنما أطلق عليها سيبويه معنى الزيادة من حيث زال عملها . ابن كيسان : \" ما \" نكرة في موضع جر بالباء ورحمة بدل منها . ومعنى الآية : أنه عليه السلام لما رفق بمن تولى يوم أحد ولم يعنفهم بين الرب تعالى أنه إنما فعل ذلك بتوفيق الله تعالى إياه . وقيل : \" ما \" استفهام . والمعنى : فبأي رحمة من الله لنت لهم ; فهو تعجيب . وفيه بعد ; لأنه لو كان كذلك لكان \" فبم \" بغير ألف . لنت من لان يلين لينا وليانا بالفتح . والفظ الغليظ الجافي . فظظت تفظ فظاظة وفظاظا فأنت فظ . والأنثى فظة والجمع أفظاظ . وفي صفة النبي عليه السلام ليس بفظ ولا غليظ ولا صخاب في الأسواق ; وأنشد المفضل في المذكر :\nوليس بفظ في الأداني والأولى يؤمون جدواه ولكنه سهل وفظ على أعدائه يحذرونه\nفسطوته حتف ونائله جزل\nوقال آخر في المؤنث :\nأموت من الضر في منزلي وغيري يموت من الكظه\nودنيا تجود على الجاهلي ن وهي على ذي النهى فظه\nوغلظ القلب عبارة عن تجهم الوجه ، وقلة الانفعال في الرغائب ، وقلة الإشفاق والرحمة ، ومن ذلك قول الشاعر :\nيبكى علينا ولا نبكي على أحد لنحن أغلظ أكبادا من الإبل\nومعنى لانفضوا لتفرقوا ; فضضتهم فانفضوا ، أي فرقتهم فتفرقوا ; ومن ذلك قول أبي النجم يصف إبلا :\nمستعجلات القيض غير جرد ينفض عنهن الحصى بالصمد\nوأصل الفض الكسر ; ومنه قولهم : لا يفضض الله فاك . والمعنى : يا محمد لولا رفقك لمنعهم الاحتشام والهيبة من القرب منك بعد ما كان من توليهم .\nقوله تعالى : فاعف عنهم واستغفر لهم وشاورهم في الأمر فيه ثمان مسائل : الأولى : قال العلماء : أمر الله تعالى نبيه - صلى الله عليه وسلم - بهذه الأوامر التي هي بتدريج بليغ ; وذلك أنه أمره بأن يعفو عنهم ما له في خاصته عليهم من تبعة ; فلما صاروا في هذه الدرجة أمره أن يستغفر فيما لله عليهم من تبعة أيضا ، فإذا صاروا في هذه الدرجة صاروا أهلا للاستشارة في الأمور . قال أهل اللغة : الاستشارة مأخوذة من قول العرب : شرت الدابة وشورتها إذا علمت خبرها بجري أو غيره . ويقال للموضع الذي تركض فيه : مشوار . وقد يكون من قولهم : شرت العسل واشترته فهو مشور ومشتار إذا أخذته من موضعه ، قال عدي بن زيد :\nفي سماع يأذن الشيخ له وحديث مثل ماذي مشار\nالثانية : قال ابن عطية : والشورى من قواعد الشريعة وعزائم الأحكام ; من لا يستشير أهل العلم والدين فعزله واجب . هذا ما لا خلاف فيه . وقد مدح الله المؤمنين بقوله : وأمرهم شورى بينهم . قال أعرابي : ما غبنت قط حتى يغبن قومي ; قيل : وكيف ذلك ؟ قال لا أفعل شيئا حتى أشاورهم . وقال ابن خويز منداد : واجب على الولاة مشاورة العلماء فيما لا يعلمون ، وفيما أشكل عليهم من أمور الدين ، ووجوه الجيش فيما يتعلق بالحرب ، ووجوه الناس فيما يتعلق بالمصالح ، ووجوه الكتاب والوزراء والعمال فيما يتعلق بمصالح البلاد وعمارتها . وكان يقال : ما ندم من استشار . وكان يقال : من أعجب برأيه ضل .\nالثالثة : قوله تعالى : وشاورهم في الأمر يدل على جواز الاجتهاد في الأمور والأخذ بالظنون مع إمكان الوحي ; فإن الله أذن لرسوله - صلى الله عليه وسلم - في ذلك . واختلف أهل التأويل في المعنى الذي أمر الله نبيه عليه السلام أن يشاور فيه أصحابه ; فقالت طائفة : ذلك في مكائد الحروب ، وعند لقاء العدو ، وتطييبا لنفوسهم ، ورفعا لأقدارهم ، وتألفا على دينهم ، وإن كان الله تعالى قد أغناه عن رأيهم بوحيه . روي هذا عن قتادة والربيع وابن إسحاق والشافعي . قال الشافعي : هو كقوله ( والبكر تستأمر ) تطيبا لقلبها ; لا أنه واجب . وقال مقاتل وقتادة والربيع : كانت سادات العرب إذا لم يشاوروا في الأمر شق عليهم : فأمر الله تعالى ; نبيه عليه السلام أن يشاورهم في الأمر : فإن ذلك أعطف لهم عليه وأذهب لأضغانهم ، وأطيب لنفوسهم . فإذا شاورهم عرفوا إكرامه لهم . وقال آخرون : ذلك فيما لم يأته فيه وحي . روي ذلك عن الحسن البصري والضحاك قالا : ما أمر الله تعالى نبيه بالمشاورة لحاجة منه إلى رأيهم ، وإنما أراد أن يعلمهم ما في المشاورة من الفضل ، ولتقتدي به أمته من بعده . وفي قراءة ابن عباس : \" وشاورهم في بعض الأمر \" ولقد أحسن القائل :\nشاور صديقك في الخفي المشكل واقبل نصيحة ناصح متفضل\nفالله قد أوصى بذاك نبيه في قوله : ( شاورهم ) و ( توكل )\nجاء في مصنف أبي داود عن أبي هريرة قال : قال رسول الله - صلى الله عليه وسلم - : المستشار مؤتمن . قال العلماء : وصفة المستشار إن كان في الأحكام أن يكون عالما دينا ، وقلما يكون ذلك إلا في عاقل . قال الحسن : ما كمل دين امرئ ما لم يكمل عقله . فإذا استشير من هذه صفته واجتهد في الصلاح وبذل جهده فوقعت الإشارة خطأ فلا غرامة عليه ; قاله الخطابي وغيره .\nالخامسة : وصفة المستشار في أمور الدنيا أن يكون عاقلا مجربا وادا في المستشير . قال :\nشاور صديقك في الخفي المشكل\nوقد تقدم . وقال آخر :\nوإن باب أمر عليك التوى فشاور لبيبا ولا تعصه\nفي أبيات . والشورى بركة . وقال عليه السلام : ما ندم من استشار ولا خاب من استخار . وروى سهل بن سعد الساعدي عن رسول الله - صلى الله عليه وسلم - ما شقي قط عبد بمشورة وما سعد باستغناء رأي . وقال بعضهم : شاور من جرب الأمور ; فإنه يعطيك من رأيه ما وقع عليه غاليا وأنت تأخذه مجانا . وقد جعل عمر بن الخطاب - رضي الله عنه - الخلافة - وهي أعظم النوازل - شورى . قال البخاري : وكانت الأئمة بعد النبي - صلى الله عليه وسلم - يستشيرون الأمناء من أهل العلم في الأمور المباحة ليأخذوا بأسهلها . وقال سفيان الثوري : ليكن أهل مشورتك أهل التقوى والأمانة ، ومن يخشى الله تعالى . وقال الحسن : والله ما تشاور قوم بينهم إلا هداهم لأفضل ما يحضر بهم . وروي عن علي بن أبي طالب - رضي الله عنه - قال : قال رسول الله - صلى الله عليه وسلم - : ما من قوم كانت لهم مشورة فحضر معهم من اسمه أحمد أو محمد فأدخلوه في مشورتهم إلا خير لهم .\nالسادسة : والشورى مبنية على اختلاف الآراء ، والمستشير ينظر في ذلك الخلاف ، وينظر أقربها قولا إلى الكتاب والسنة إن أمكنه ، فإذا أرشده الله تعالى إلى ما شاء منه عزم عليه وأنفذه متوكلا عليه ، إذ هذه غاية الاجتهاد المطلوب ; وبهذا أمر الله تعالى نبيه في هذه الآية .\nالسابعة : قوله تعالى : فإذا عزمت فتوكل على الله قال قتادة : أمر الله تعالى نبيه عليه السلام إذا عزم على أمر أن يمضي فيه ويتوكل على الله ، لا على مشاورتهم . والعزم هو الأمر المروى المنقح ، وليس ركوب الرأي دون روية عزما ، إلا على مقطع المشيحين من فتاك العرب ; كما قال :\nإذا هم ألقى بين عينيه عزمه ونكب عن ذكر العواقب جانبا\nولم يستشر في رأيه غير نفسه ولم يرض إلا قائم السيف صاحبا\nوقال النقاش : العزم والحزم واحد ، والحاء مبدلة من العين . قال ابن عطية : وهذا خطأ ; فالحزم جودة النظر في الأمر وتنقيحه والحذر من الخطأ فيه . والعزم قصد الإمضاء ; والله تعالى يقول : وشاورهم في الأمر فإذا عزمت . فالمشاورة وما كان في معناها هو الحزم . والعرب تقول : قد أحزم لو أعزم . وقرأ جعفر الصادق وجابر بن زيد : \" فإذا عزمت \" بضم التاء . نسب العزم إلى نفسه سبحانه إذ هو بهدايته وتوفيقه ; كما قال : وما رميت إذ رميت ولكن الله رمى . ومعنى الكلام أي عزمت لك ووفقتك وأرشدتك فتوكل على الله . والباقون بفتح التاء . قال المهلب : وامتثل هذا النبي - صلى الله عليه وسلم - من أمر ربه فقال : لا ينبغي لنبي يلبس لأمته أن يضعها حتى يحكم الله . أي ليس ينبغي له إذا عزم أن ينصرف ; لأنه نقض للتوكل الذي شرطه الله عز وجل مع العزيمة . فلبسه لأمته - صلى الله عليه وسلم - حين أشار عليه بالخروج يوم أحد من أكرمه الله بالشهادة فيه ، وهم صلحاء المؤمنين ممن كان فاتته بدر : يا رسول الله اخرج بنا إلى عدونا ; دال على العزيمة . وكان - صلى الله عليه وسلم - أشار بالقعود ، وكذلك عبد الله بن أبي أشار بذلك وقال : أقم يا رسول الله ولا تخرج إليهم بالناس ، فإن هم أقاموا أقاموا بشر مجلس ، وإن جاءونا إلى المدينة قاتلناهم في الأفنية وأفواه السكك ، ورماهم النساء والصبيان بالحجارة من الآطام ، فوالله ما حاربنا قط عدو في هذه المدينة إلا غلبناه ، ولا خرجنا منها إلى عدو إلا غلبنا . وأبى هذا الرأي من ذكرنا ، وشجعوا الناس ودعوا إلى الحرب . فصلى رسول الله - صلى الله عليه وسلم - الجمعة ، ودخل إثر صلاته بيته ولبس سلاحه ، فندم أولئك القوم وقالوا : أكرهنا رسول الله - صلى الله عليه وسلم - ; فلما خرج عليهم في سلاحه قالوا : يا رسول الله ، أقم إن شئت فإنا لا نريد أن نكرهك ، فقال النبي - صلى الله عليه وسلم - : لا ينبغي لنبي إذا لبس سلاحه أن يضعها حتى يقاتل .\nالثامنة : قوله تعالى : فتوكل على الله إن الله يحب المتوكلين التوكل : الاعتماد على الله مع إظهار العجز ، والاسم التكلان . يقال منه : اتكلت عليه في أمري ، وأصله : \" اوتكلت \" قلبت الواو ياء لانكسار ما قبلها ، ثم أبدلت منها التاء وأدغمت في تاء الافتعال . ويقال : وكلته بأمري توكيلا ، والاسم الوكالة بكسر الواو وفتحها .\nواختلف العلماء في التوكل ; فقالت طائفة من المتصوفة : لا يستحقه إلا من لم يخالط قلبه خوف غير الله من سبع أو غيره ، وحتى يترك السعي في طلب الرزق لضمان الله تعالى . وقال عامة الفقهاء : ما تقدم ذكره عند قوله تعالى : وعلى الله فليتوكل المؤمنون . وهو الصحيح كما بيناه . وقد خاف موسى وهارون بإخبار الله تعالى عنهما في قوله لا تخافا . وقال : فأوجس في نفسه خيفة موسى قلنا لا تخف وأخبر عن إبراهيم بقوله : فلما رأى أيديهم لا تصل إليه نكرهم وأوجس منهم خيفة قالوا لا تخف . فإذا كان الخليل وموسى الكليم قد خافا - وحسبك بهما - فغيرهما أولى . وسيأتي بيان هذا المعنى .\n                                    ",
        "saadi": "فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا غَلِيظَ ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ فَٱعۡفُ عَنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِي ٱلۡأَمۡرِۖ فَإِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَوَكِّلِينَ ٩٥١\n                                        \n                                        \n                                        \n                                        أي: برحمة الله لك ولأصحابك، منَّ الله عليك أن ألنت لهم جانبك، وخفضت لهم جناحك، وترققت عليهم، وحسنت لهم خلقك، فاجتمعوا عليك وأحبوك، وامتثلوا أمرك. { ولو كنت فظا } أي: سيئ الخلق { غليظ القلب } أي: قاسيه، { لانفضوا من حولك } لأن هذا ينفرهم ويبغضهم لمن قام به هذا الخلق السيئ. فالأخلاق الحسنة من الرئيس في الدين، تجذب الناس إلى دين الله، وترغبهم فيه، مع ما لصاحبه من المدح والثواب الخاص، والأخلاق السيئة من الرئيس في الدين تنفر الناس عن الدين، وتبغضهم إليه، مع ما لصاحبها من الذم والعقاب الخاص، فهذا الرسول المعصوم يقول الله له ما يقول، فكيف بغيره؟! أليس من أوجب الواجبات، وأهم المهمات، الاقتداء بأخلاقه الكريمة، ومعاملة الناس بما يعاملهم به صلى الله عليه وسلم، من اللين وحسن الخلق والتأليف، امتثالا لأمر الله، وجذبا لعباد الله لدين الله. ثم أمره الله تعالى بأن يعفو عنهم ما صدر منهم من التقصير في حقه صلى الله عليه وسلم، ويستغفر لهم في التقصير في حق الله، فيجمع بين العفو والإحسان. { وشاورهم في الأمر } أي: الأمور التي تحتاج إلى استشارة ونظر وفكر، فإن في الاستشارة من الفوائد والمصالح الدينية والدنيوية ما لا يمكن حصره: منها: أن المشاورة من العبادات المتقرب بها إلى الله. ومنها: أن فيها تسميحا لخواطرهم، وإزالة لما يصير في القلوب عند الحوادث، فإن من له الأمر على الناس -إذا جمع أهل الرأي: والفضل وشاورهم في حادثة من الحوادث- اطمأنت نفوسهم وأحبوه، وعلموا أنه ليس بمستبد عليهم، وإنما ينظر إلى المصلحة الكلية العامة للجميع، فبذلوا جهدهم ومقدورهم في طاعته، لعلمهم بسعيه في مصالح العموم، بخلاف من ليس كذلك، فإنهم لا يكادون يحبونه محبة صادقة، ولا يطيعونه وإن أطاعوه فطاعة غير تامة. ومنها: أن في الاستشارة تنور الأفكار، بسبب إعمالها فيما وضعت له، فصار في ذلك زيادة للعقول. ومنها: ما تنتجه الاستشارة من الرأي: المصيب، فإن المشاور لا يكاد يخطئ في فعله، وإن أخطأ أو لم يتم له مطلوب، فليس بملوم، فإذا كان الله يقول لرسوله -صلى الله عليه وسلم- وهو أكمل الناس عقلا، وأغزرهم علما، وأفضلهم رأيا-: { وشاورهم في الأمر } فكيف بغيره؟! ثم قال تعالى: { فإذا عزمت } أي: على أمر من الأمور بعد الاستشارة فيه، إن كان يحتاج إلى استشارة { فتوكل على الله } أي: اعتمد على حول الله وقوته، متبرئا من حولك وقوتك، { إن الله يحب المتوكلين } عليه، اللاجئين إليه.\n                                    "
      },
      "originalText": "فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا غَلِيظَ ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ فَٱعۡفُ عَنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِي ٱلۡأَمۡرِۖ فَإِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَوَكِّلِينَ ٩٥١"
    },
    {
      "number": 453,
      "text": "إِنْ يَنْصُرْكُمُ اللَّهُ فَلَا غَالِبَ لَكُمْ ۖ وَإِنْ يَخْذُلْكُمْ فَمَنْ ذَا الَّذِي يَنْصُرُكُمْ مِنْ بَعْدِهِ ۗ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 160,
      "juz": 4,
      "manzil": 1,
      "page": 71,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن يَنصُرۡكُمُ ٱللَّهُ فَلَا غَالِبَ لَكُمۡۖ وَإِن يَخۡذُلۡكُمۡ فَمَن ذَا ٱلَّذِي يَنصُرُكُم مِّنۢ بَعۡدِهِۦۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٠٦١\n                                    \n                                    \n                                    وقوله : ( إن ينصركم الله فلا غالب لكم وإن يخذلكم فمن ذا الذي ينصركم من بعده وعلى الله فليتوكل المؤمنون ) وهذا كما تقدم من قوله : ( وما النصر إلا من عند الله العزيز الحكيم ) [ آل عمران : 126 ] ثم أمرهم بالتوكل عليه فقال : ( وعلى الله فليتوكل المؤمنون )\n                                    ",
        "qortoby": "إِن يَنصُرۡكُمُ ٱللَّهُ فَلَا غَالِبَ لَكُمۡۖ وَإِن يَخۡذُلۡكُمۡ فَمَن ذَا ٱلَّذِي يَنصُرُكُم مِّنۢ بَعۡدِهِۦۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٠٦١\n                                    \n                                    \n                                    قوله تعالى : إن ينصركم الله فلا غالب لكم وإن يخذلكم فمن ذا الذي ينصركم من بعده وعلى الله فليتوكل المؤمنون\nقوله تعالى : إن ينصركم الله فلا غالب لكم أي عليه توكلوا فإنه إن يعنكم ويمنعكم من عدوكم لن تغلبوا . وإن يخذلكم يترككم من معونته . فمن ذا الذي ينصركم من بعده أي لا ينصركم أحد من بعده ، أي من بعد خذلانه إياكم ; لأنه قال : وإن يخذلكم والخذلان ترك العون . والمخذول : المتروك لا يعبأ به . وخذلت الوحشية أقامت على ولدها في المرعى وتركت صواحباتها ; فهي خذول . قال طرفة :\nخذول تراعي ربربا بخميلة تناول أطراف البرير وترتدي\nوقال أيضا :\nنظرت إليك بعين جارية خذلت صواحبها على طفل\nوقيل : هذا من المقلوب ; لأنها هي المخذولة إذا تركت . وتخاذلت رجلاه إذا ضعفتا . قال :\nوخذول الرجل من غير كسح\nورجل خذلة للذي لا يزال يخذل ، والله أعلم .\n                                    ",
        "saadi": "إِن يَنصُرۡكُمُ ٱللَّهُ فَلَا غَالِبَ لَكُمۡۖ وَإِن يَخۡذُلۡكُمۡ فَمَن ذَا ٱلَّذِي يَنصُرُكُم مِّنۢ بَعۡدِهِۦۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٠٦١\n                                        \n                                        \n                                        \n                                        أي: إن يمددكم الله بنصره ومعونته { فلا غالب لكم } فلو اجتمع عليكم من في أقطارها وما عندهم من العدد والعُدد، لأن الله لا مغالب له، وقد قهر العباد وأخذ بنواصيهم، فلا تتحرك دابة إلا بإذنه، ولا تسكن إلا بإذنه. { وإن يخذلكم } ويكلكم إلى أنفسكم { فمن ذا الذي ينصركم من بعده } فلا بد أن تنخذلوا ولو أعانكم جميع الخلق. وفي ضمن ذلك الأمر بالاستنصار بالله والاعتماد عليه، والبراءة من الحول والقوة، ولهذا قال: { وعلى الله فليتوكل المؤمنون } بتقديم المعمول يؤذن بالحصر، أي: على الله توكلوا لا على غيره، لأنه قد علم أنه هو الناصر وحده، فالاعتماد عليه توحيد محصل للمقصود، والاعتماد على غيره شرك غير نافع لصاحبه، بل ضار. وفي هذه الآية الأمر بالتوكل على الله وحده، وأنه بحسب إيمان العبد يكون توكله.\n                                    "
      },
      "originalText": "إِن يَنصُرۡكُمُ ٱللَّهُ فَلَا غَالِبَ لَكُمۡۖ وَإِن يَخۡذُلۡكُمۡ فَمَن ذَا ٱلَّذِي يَنصُرُكُم مِّنۢ بَعۡدِهِۦۗ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ ٠٦١"
    },
    {
      "number": 454,
      "text": "وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ ۚ وَمَنْ يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ ۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 161,
      "juz": 4,
      "manzil": 1,
      "page": 71,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كَانَ لِنَبِيٍّ أَن يَغُلَّۚ وَمَن يَغۡلُلۡ يَأۡتِ بِمَا غَلَّ يَوۡمَ ٱلۡقِيَٰمَةِۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١٦١\n                                    \n                                    \n                                    وقوله : ( وما كان لنبي أن يغل ) قال ابن عباس ، ومجاهد ، والحسن ، وغير واحد : ما ينبغي لنبي أن يخون .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا المسيب بن واضح ، حدثنا أبو إسحاق الفزاري ، عن سفيان [ عن ] خصيف ، عن عكرمة عن ابن عباس قال : فقدوا قطيفة يوم بدر فقالوا : لعل رسول الله صلى الله عليه وسلم أخذها . فأنزل الله : ( وما كان لنبي أن يغل ) أي يخون .\nوقال ابن جرير : حدثنا محمد بن عبد الملك بن أبي الشوارب ، حدثنا عبد الواحد بن زياد ، حدثنا خصيف ، حدثنا مقسم حدثني ابن عباس أن هذه الآية : ( وما كان لنبي أن يغل ) نزلت في قطيفة حمراء فقدت يوم بدر ، فقال بعض الناس : أخذها قال فأكثروا في ذلك ، فأنزل الله : ( وما كان لنبي أن يغل ومن يغلل يأت بما غل يوم القيامة )\nوكذا رواه أبو داود ، رحمه الله ، والترمذي جميعا ، عن قتيبة ، عن عبد الواحد بن زياد ، به . وقال الترمذي : حسن غريب . ورواه بعضهم عن خصيف ، عن مقسم - يعني مرسلا .\nوروى ابن مردويه من طريق أبي عمرو بن العلاء ، عن مجاهد ، عن ابن عباس قال : اتهم المنافقون رسول الله صلى الله عليه وسلم بشيء فقد ، فأنزل الله ، عز وجل : ( وما كان لنبي أن يغل )\nوقد روي من غير وجه عن ابن عباس نحو ما تقدم . وهذا تبرئة له ، صلوات الله وسلامه عليه ، عن جميع وجوه الخيانة في أداء الأمانة وقسم الغنيمة وغير ذلك .\nوقال العوفي عن ابن عباس : ( وما كان لنبي أن يغل ) أي : بأن يقسم لبعض السرايا ويترك بعضا وكذا قال الضحاك .\nوقال محمد بن إسحاق : ( وما كان لنبي أن يغل ) بأن يترك بعض ما أنزل إليه فلا يبلغه أمته .\nوقرأ الحسن البصري وطاوس ، ومجاهد ، والضحاك : ( وما كان لنبي أن يغل ) بضم الياء أي : يخان .\nوقال قتادة والربيع بن أنس : نزلت هذه الآية يوم بدر ، وقد غل بعض أصحابه . رواه ابن جرير عنهما ، ثم حكى عن بعضهم أنه قرأ هذه القراءة بمعنى يتهم بالخيانة .\nثم قال تعالى : ( ومن يغلل يأت بما غل يوم القيامة ثم توفى كل نفس ما كسبت وهم لا يظلمون ) وهذا تهديد شديد ووعيد أكيد . وقد وردت السنة بالنهي عن ذلك أيضا في أحاديث متعددة .\nقال الإمام أحمد : حدثنا عبد الملك ، حدثنا زهير - يعني ابن محمد - عن عبد الله بن محمد بن عقيل ، عن عطاء بن يسار ، عن أبي مالك الأشجعي [ رضي الله عنه ] عن النبي صلى الله عليه وسلم أعظم الغلول عند الله ذراع من الأرض ، تجدون الرجلين جارين في الأرض - أو في الدار - فيقطع أحدهما من حظ صاحبه ذراعا ، فإذا اقتطعه طوقه من سبع أرضين إلى يوم القيامة \" .\n[ \" وفي الصحيحين عن سعيد بن زيد قال : قال رسول الله صلى الله عليه وسلم : \" من ظلم قيد شبر من الأرض طوقه يوم القيامة من سبع أرضين \" ] .\nحديث آخر : قال الإمام أحمد : حدثنا موسى بن داود ، حدثنا ابن لهيعة ، عن ابن هبيرة والحارث بن يزيد عن عبد الرحمن بن جبير . قال : سمعت المستورد بن شداد يقول : سمعت رسول الله صلى الله عليه وسلم يقول : \" من ولي لنا عملا وليس له منزل فليتخذ منزلا ، أو ليست له زوجة فليتزوج ، أو ليس له خادم فليتخذ خادما ، أو ليست له دابة فليتخذ دابة ، ومن أصاب شيئا سوى ذلك فهو غال \" .\nهكذا رواه الإمام أحمد ، وقد رواه أبو داود بسند آخر وسياق آخر فقال :\nحدثنا موسى بن مروان الرقي ، حدثنا المعافى ، حدثنا الأوزاعي ، عن الحارث بن يزيد عن جبير بن نفير ، عن المستورد بن شداد . قال : سمعت رسول الله صلى الله عليه وسلم يقول : \" من كان لنا عاملا فليكتسب زوجة ، فإن لم يكن له خادم فليكتسب خادما ، فإن لم يكن له مسكن فليكتسب مسكنا \" . قال : قال أبو بكر : أخبرت أن النبي صلى الله عليه وسلم قال : \" من اتخذ غير ذلك فهو غال ، أو سارق \" .\nقال شيخنا الحافظ المزي [ رحمه الله ] رواه جعفر بن محمد الفريابي ، عن موسى بن مروان فقال : عن عبد الرحمن بن جبير بدل جبير بن نفير ، وهو أشبه بالصواب .\nحديث آخر : قال ابن جرير : حدثنا أبو كريب ، حدثنا حفص بن بشر ، حدثنا يعقوب القمي حدثنا حفص بن حميد ، عن عكرمة ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم \" لا أعرفن أحدكم يأتي يوم القيامة يحمل شاة لها ثغاء ، فينادي : يا محمد ، يا محمد ، فأقول : لا أملك [ لك ] من الله شيئا ، قد بلغتك . ولا أعرفن أحدكم [ يأتي ] يوم القيامة يحمل جملا له رغاء ، فيقول : يا محمد ، يا محمد . فأقول : لا أملك لك من الله شيئا ، قد بلغتك . ولا أعرفن أحدكم يأتي يوم القيامة يحمل فرسا له حمحمة ، ينادي : يا محمد ، يا محمد . فأقول : لا أملك لك من الله شيئا ، قد بلغتك . ولا أعرفن أحدكم يأتي يوم القيامة يحمل [ قشعا ] من أدم ، ينادي : يا محمد ، يا محمد . فأقول : لا أملك لك من الله شيئا ، قد بلغتك \" .\nلم يروه أحد من أهل الكتب الستة .\nحديث آخر : قال الإمام أحمد : حدثنا سفيان ، عن الزهري ، سمع عروة يقول : أخبرنا أبو حميد الساعدي قال : استعمل رسول الله صلى الله عليه وسلم رجلا من الأزد يقال له : ابن اللتبية على الصدقة ، فجاء فقال : هذا لكم وهذا أهدي لي . فقام رسول الله صلى الله عليه وسلم على المنبر فقال : \" ما بال العامل نبعثه فيجيء فيقول : هذا لكم وهذا أهدي لي . أفلا جلس في بيت أبيه وأمه فينظر أيهدى إليه أم لا ؟ والذي نفس محمد بيده ، لا يأتي أحد منكم منها بشيء إلا جاء به يوم القيامة على رقبته إن كان بعيرا له رغاء ، أو بقرة لها خوار ، أو شاة تيعر \" ثم رفع يديه حتى رأينا عفرة إبطيه ثم قال : \" اللهم هل بلغت \" ثلاثا .\nوزاد هشام بن عروة : فقال أبو حميد : بصر عيني ، وسمع أذني ، وسلوا زيد بن ثابت .\nأخرجاه من حديث سفيان بن عيينة وعند البخاري : وسلوا زيد بن ثابت . ومن غير وجه عن الزهري ، ومن طريق عن هشام بن عروة ، كلاهما عن عروة ، به .\nحديث آخر : قال الإمام أحمد : حدثنا إسحاق بن عيسى ، حدثنا إسماعيل بن عياش ، عن يحيى بن سعيد ، عن عروة بن الزبير ، عن أبي حميد أن رسول الله صلى الله عليه وسلم قال : \" هدايا العمال غلول \" .\nوهذا الحديث من أفراد أحمد وهو ضعيف الإسناد ، وكأنه مختصر من الذي قبله ، والله أعلم .\nحديث آخر : قال أبو عيسى الترمذي في كتاب الأحكام ، حدثنا أبو كريب ، حدثنا أبو أسامة ، عن داود بن يزيد الأودي ، عن المغيرة بن شبل ، عن قيس بن أبي حازم ، عن معاذ بن جبل قال : بعثني رسول الله صلى الله عليه وسلم إلى اليمن ، فلما سرت أرسل في أثري فرددت ، فقال : \" أتدري لم بعثت إليك ؟ لا تصيبن شيئا بغير إذني فإنه غلول ، ( ومن يغلل يأت بما غل يوم القيامة ) لهذا دعوتك ، فامض لعملك \" .\nهذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ، وفي الباب عن عدي بن عميرة ، وبريدة ، والمستورد بن شداد ، وأبي حميد ، وابن عمر .\nحديث آخر : قال الإمام أحمد : حدثنا إسماعيل ابن علية ، حدثنا أبو حيان يحيى بن سعيد التيمي ، عن أبي زرعة بن عمر بن جرير ، عن أبي هريرة ، قال : قام فينا رسول الله صلى الله عليه وسلم يوما ، فذكر الغلول فعظمه وعظم أمره ، ثم قال : \" لا ألفين أحدكم يجيء يوم القيامة على رقبته بعير له رغاء ، فيقول : يا رسول الله ، أغثني . فأقول : لا أملك لك من الله شيئا ، قد أبلغتك . لا ألفين أحدكم يجيء يوم القيامة على رقبته فرس له حمحمة ، فيقول : يا رسول الله ، أغثني . فأقول : لا أملك لك من الله شيئا ، قد أبلغتك . لا ألفين أحدكم يجيء يوم القيامة على رقبته رقاع تخفق ، فيقول : يا رسول الله ، أغثني ، فأقول : لا أملك لك من الله شيئا ، قد أبلغتك . لا ألفين أحدكم يجيء يوم القيامة على رقبته صامت فيقول : يا رسول الله أغثني . فأقول : لا أملك لك من الله شيئا ، قد بلغتك \" .\nأخرجاه من حديث أبي حيان ، به .\nحديث آخر : قال الإمام أحمد : حدثنا يحيى بن سعيد ، عن إسماعيل بن أبي خالد ، حدثني قيس ، عن عدي بن عميرة الكندي قال : قال رسول الله صلى الله عليه وسلم : \" يا أيها الناس ، من عمل لنا [ منكم ] عملا فكتمنا منه مخيطا فما فوقه فهو غل يأتي به يوم القيامة \" قال : فقال رجل من الأنصار أسود - قال مجالد : هو سعد بن عبادة - كأني أنظر إليه ، فقال : يا رسول الله ، اقبل عني عملك . قال : \" وما ذاك ؟ \" قال : سمعتك تقول كذا وكذا . قال : \" وأنا أقول ذاك الآن : من استعملناه على عمل فليجئ بقليله وكثيره ، فما أوتي منه أخذه . وما نهي عنه انتهى \" . وكذا رواه مسلم ، وأبو داود ، من طرق عن إسماعيل بن أبي خالد ، به .\nحديث آخر : قال الإمام أحمد : حدثنا أبو معاوية ، حدثنا أبو إسحاق الفزاري ، عن ابن جريج ، حدثني منبوذ ، رجل من آل أبي رافع ، عن الفضل بن عبيد الله بن أبي رافع ، عن أبي رافع قال : كان رسول الله صلى الله عليه وسلم إذا صلى العصر ربما ذهب إلى بني عبد الأشهل فيتحدث معهم حتى ينحدر المغرب ، قال أبو رافع : فبينا رسول الله صلى الله عليه وسلم مسرعا إلى المغرب إذ مر بالبقيع فقال : \" أف لك . . أف لك \" مرتين ، فكبر في [ ذرعي ] وتأخرت وظننت أنه يريدني ، فقال : \" ما لك ؟ امش \" قال : قلت : أحدثت حدثا يا رسول الله ؟ قال : \" وما ذاك ؟ \" قلت : أففت بي ، قال : \" لا ، ولكن هذا قبر فلان ، بعثته ساعيا على آل فلان ، فغل نمرة فدرع الآن مثله من نار \" .\nحديث آخر : قال عبد الله بن الإمام أحمد : حدثنا عبد الله بن سالم الكوفي المفلوج - وكان بمكة - حدثنا عبيدة بن الأسود ، عن القاسم بن الوليد ، عن أبي صادق ، عن ربيعة بن ناجد ، عن عبادة بن الصامت ، أن النبي صلى الله عليه وسلم كان يأخذ الوبرة من جنب البعير من المغنم ، ثم يقول : \" ما لي فيه إلا مثل ما لأحدكم ، إياكم والغلول ، فإن الغلول خزي على صاحبه يوم القيامة ، أدوا الخيط والمخيط وما فوق ذلك ، وجاهدوا في سبيل الله القريب والبعيد ، في الحضر والسفر ، فإن الجهاد باب من أبواب الجنة ، إنه لينجي الله به من الهم والغم ، وأقيموا حدود الله في القريب والبعيد ، ولا تأخذكم في الله لومة لائم \" . وقد روى ابن ماجه بعضه عن المفلوج ، به .\nحديث آخر : عن عمرو بن شعيب ، عن أبيه ، عن جده قال : قال رسول الله صلى الله عليه وسلم : \" ردوا الخياط والمخيط ، فإن الغلول عار ونار وشنار على أهله يوم القيامة \" .\nحديث آخر : قال أبو داود : حدثنا عثمان بن أبي شيبة ، حدثنا جرير ، عن مطرف ، عن أبي الجهم ، عن أبي مسعود الأنصاري قال : بعثني رسول الله صلى الله عليه وسلم ساعيا ثم قال : \" انطلق - أبا مسعود - لا ألفينك يوم القيامة تجيء على ظهرك بعير من إبل الصدقة له رغاء قد غللته \" . قال : إذا لا أنطلق . قال : إذا لا أكرهك \" . تفرد به أبو داود .\nحديث آخر : قال أبو بكر بن مردويه : أنبأنا محمد بن أحمد بن إبراهيم ، أنبأنا محمد بن عثمان بن أبي شيبة ، أنبأنا عبد الحميد بن صالح أنبأنا أحمد بن أبان ، عن علقمة بن مرثد ، عن ابن بريدة ، عن أبيه ، عن النبي صلى الله عليه وسلم قال : إن الحجر ليرمى به [ في ] جهنم فيهوي سبعين خريفا ما يبلغ قعرها ، ويؤتى بالغلول فيقذف معه \" ، ثم يقال لمن غل ائت به ، فذلك قوله : ( ومن يغلل يأت بما غل يوم القيامة ) .\nحديث آخر : قال الإمام أحمد : حدثنا هاشم بن القاسم ، حدثنا عكرمة بن عمار ، حدثني سماك الحنفي أبو زميل ، حدثني عبد الله بن عباس ، حدثني عمر بن الخطاب قال : لما كان يوم خيبر أقبل نفر من أصحاب النبي صلى الله عليه وسلم فقالوا : فلان شهيد ، وفلان شهيد . حتى أتوا على رجل فقالوا : فلان شهيد ؟ فقال رسول الله صلى الله عليه وسلم : \" كلا إني رأيته في النار في بردة غلها - أو عباءة \" . ثم قال رسول الله صلى الله عليه وسلم : \" يا ابن الخطاب اذهب فناد في الناس : إنه لا يدخل الجنة إلا المؤمنون \" . قال : فخرجت فناديت : ألا إنه لا يدخل الجنة إلا المؤمنون .\nوكذا رواه مسلم ، والترمذي من حديث عكرمة بن عمار به . وقال الترمذي : حسن صحيح .\nحديث آخر : قال ابن جرير : حدثنا سعيد بن يحيى الأموي ، حدثنا أبي ، حدثنا يحيى بن سعيد ، عن نافع ، عن ابن عمر ، أن رسول الله صلى الله عليه وسلم بعث سعد بن عبادة مصدقا ، فقال : \" إياك يا سعد أن تجيء يوم القيامة ببعير تحمله له رغاء \" قال : لا آخذه ولا أجيء به . فأعفاه . ثم رواه من طريق عبيد الله عن نافع ، به ، نحوه .\nحديث آخر : قال الإمام أحمد : حدثنا أبو سعيد ، حدثنا عبد العزيز بن محمد ، حدثنا صالح بن محمد بن زائدة ، عن سالم بن عبد الله ، أنه كان مع مسلمة بن عبد الملك في أرض الروم ، فوجد في متاع رجل غلول . قال : فسأل سالم بن عبد الله فقال : حدثني أبي عبد الله ، عن عمر بن الخطاب ، رضي الله عنه : أن رسول الله صلى الله عليه وسلم قال : \" من وجدتم في متاعه غلولا فأحرقوه \" : قال : وأحسبه قال : واضربوه ، قال : فأخرج متاعه في السوق ، فوجد فيه مصحفا ، فسأل سالما ، فقال : بعه وتصدق بثمنه .\nوهكذا رواه علي بن المديني ، وأبو داود ، والترمذي من حديث عبد العزيز بن محمد الدراوردي - زاد أبو داود : وأبو إسحاق الفزاري - كلاهما عن أبي واقد الليثي الصغير صالح بن محمد بن زائدة ، به .\nوقد قال علي بن المديني ، رحمه الله ، والبخاري وغيرهما : هذا حديث منكر من رواية أبي واقد هذا . وقال الدارقطني : الصحيح أنه من فتوى سالم فقط ، وقد ذهب إلى القول بمقتضى هذا الحديث الإمام [ أحمد ] بن حنبل ، رحمه الله ، ومن تابعه من أصحابه ، وخالفه أبو حنيفة ، ومالك ، والشافعي ، والجمهور ، فقالوا : لا يحرق متاع الغال ، بل يعزر تعزير مثله . وقال البخاري : وقد امتنع رسول الله صلى الله عليه وسلم من الصلاة على الغال ، ولم يحرق متاعه ، والله أعلم .\nطريق أخرى عن عمر : قال ابن جرير : حدثنا أحمد بن عبد الرحمن بن وهب ، حدثنا عبد الله بن وهب ، أخبرني عمرو بن الحارث : أن موسى بن جبير حدثه : أن عبد الله بن عبد الرحمن بن الحباب الأنصاري حدثه : أن عبد الله بن أنيس حدثه : أنه تذاكر هو وعمر بن الخطاب يوما الصدقة فقال : ألم تسمع رسول الله صلى الله عليه وسلم حين ذكر غلول الصدقة : \" من غل منها بعيرا أو شاة ، فإنه يحمله يوم القيامة \" ؟ قال عبد الله بن أنيس : بلى .\nورواه ابن ماجه ، عن عمرو بن سواد ، عن عبد الله بن وهب ، به .\nورواه الأموي عن معاوية ، عن أبي إسحاق ، عن يونس بن عبيد ، عن الحسن قال : عقوبة الغال أن يخرج رحله ويحرق على ما فيه .\nثم روي عن معاوية ، عن أبي إسحاق ، عن عثمان بن عطاء ، عن أبيه ، عن علي [ رضي الله عنه ] قال : الغال يجمع رحله فيحرق ويجلد دون حد [ المملوك ، ويحرم نصيبه ، وخالفه أبو حنيفة ومالك والشافعي والجمهور فقالوا : لا يحرق متاع الغال ، بل يعزر تعزير مثله ، وقد قال البخاري : وقد امتنع رسول الله صلى الله عليه وسلم من الصلاة على الغال ولم يحرق متاعه ، والله أعلم ] .\nوقال الإمام أحمد : حدثنا أسود بن عامر ، أنبأنا إسرائيل ، عن أبي إسحاق ، عن خمير بن مالك قال : أمر بالمصاحف أن تغير قال : فقال ابن مسعود : من استطاع منكم أن يغل مصحفا فليغله ، فإنه من غل شيئا جاء به يوم القيامة ، ثم قال قرأت من فم رسول الله صلى الله عليه وسلم سبعين سورة ، أفأترك ما أخذت من في رسول الله صلى الله عليه وسلم ؟\nوروى وكيع في تفسيره عن شريك ، عن إبراهيم بن مهاجر ، عن إبراهيم ، قال : لما أمر بتحريق المصاحف قال عبد الله : يا أيها الناس ، غلوا المصاحف ، فإنه من غل يأت بما غل يوم القيامة ، ونعم الغل المصحف . يأتي به أحدكم يوم القيامة .\nوقال [ أبو ] داود عن سمرة بن جندب قال : كان رسول الله صلى الله عليه وسلم إذا غنم غنيمة أمر بلالا فينادي في الناس ، فيجيئون بغنائمهم يخمسه ويقسمه ، فجاء رجل يوما بعد النداء بزمام من شعر فقال : يا رسول الله ، هذا كان مما أصبنا من الغنيمة . فقال : \" أسمعت بلالا ينادي ثلاثا ؟ \" ، قال : نعم . قال : \" فما منعك أن تجيء به ؟ \" فاعتذر إليه ، فقال : \" كلا أنت تجيء به يوم القيامة ، فلن أقبله منك \" .\n                                    ",
        "qortoby": "وَمَا كَانَ لِنَبِيٍّ أَن يَغُلَّۚ وَمَن يَغۡلُلۡ يَأۡتِ بِمَا غَلَّ يَوۡمَ ٱلۡقِيَٰمَةِۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١٦١\n                                    \n                                    \n                                    قوله تعالى : وما كان لنبي أن يغل ومن يغلل يأت بما غل يوم القيامة ثم توفى كل نفس ما كسبت وهم لا يظلمون\nفيه إحدى عشرة مسألة :\nالأولى : لما أخل الرماة يوم أحد بمراكزهم - على ما تقدم - خوفا من أن يستولي المسلمون على الغنيمة فلا يصرف إليهم شيء ، بين الله سبحانه أن النبي - صلى الله عليه وسلم - لا يجور في القسمة ; فما كان من حقكم أن تتهموه . وقال الضحاك : بل السبب أن رسول الله - صلى الله عليه وسلم - بعث طلائع في بعض غزواته ثم غنم قبل مجيئهم ; فقسم للناس ولم يقسم للطلائع ; فأنزل الله عليه عتابا : وما كان لنبي أن يغل ومن يغلل أي يقسم لبعض ويترك بعضا . وروي نحو هذا القول عن ابن عباس . وقال ابن عباس أيضا وعكرمة وابن جبير وغيرهم : نزلت بسبب قطيفة حمراء فقدت في المغانم يوم بدر ; فقال بعض من كان مع النبي - صلى الله عليه وسلم - : لعل أن يكون النبي - صلى الله عليه وسلم - أخذها ، فنزلت الآية أخرجه أبو داود والترمذي وقال : هذا حديث حسن غريب . قال ابن عطية : قيل كانت هذه المقالة من مؤمنين لم يظنوا أن في ذلك حرجا . وقيل : كانت من المنافقين . وقد روي أن المفقود كان سيفا . وهذه الأقوال تخرج على قراءة يغل بفتح الياء وضم الغين . وروى أبو صخر عن محمد بن كعب وما كان لنبي أن يغل قال : تقول وما كان لنبي أن يكتم شيئا من كتاب الله . وقيل : اللام فيه منقولة ، أي وما كان نبي ليغل ; كقوله : ما كان لله أن يتخذ من ولد سبحانه . أي ما كان الله ليتخذ ولدا . وقرئ \" يغل \" بضم الياء وفتح الغين . وقال ابن السكيت : لم نسمع في المغنم إلا غل غلولا ، وقرئ وما كان لنبي أن يغل ويغل . قال : فمعنى \" يغل \" يخون ، ومعنى \" يغل \" يخون ، ويحتمل معنيين : أحدهما يخان أي يؤخذ من غنيمته ، والآخر يخون أن ينسب إلى الغلول : ثم قيل : إن كل من غل شيئا في خفاء فقد غل يغل غلولا : قال ابن عرفة : سميت غلولا لأن الأيدي مغلولة منها ، أي ممنوعة . وقال أبو عبيد : الغلول من المغنم خاصة ، ولا نراه من الخيانة ولا من الحقد .\nومما يبين ذلك أنه يقال من الخيانة : أغل يغل ، ومن الحقد : غل يغل بالكسر ، ومن الغلول : غل يغل بالضم . وغل البعير أيضا يغل غلة إذا لم يقض ريه وأغل الرجل خان ، قال النمر :\nجزى الله عنا حمزة ابنة نوفل جزاء مغل بالأمانة كاذب\nوفي الحديث : ( لا إغلال ولا إسلال ) أي لا خيانة ولا سرقة ، ويقال : لا رشوة . وقال شريح : ليس على المستعير غير المغل ضمان . وقال - صلى الله عليه وسلم - : ثلاث لا يغل عليهن قلب مؤمن من رواه بالفتح فهو من الضغن . وغل دخل يتعدى ولا يتعدى ; يقال : غل فلان المفاوز ، أي دخلها وتوسطها . وغل من المغنم غلولا ، أي خان . وغل الماء بين الأشجار إذا جرى فيها ; يغل بالضم في جميع ذلك . وقيل : الغلول في اللغة أن يأخذ من المغنم شيئا يستره عن أصحابه ; ومنه تغلغل الماء في الشجر إذا تخللها . والغلل : الماء الجاري في أصول الشجر ، لأنه مستتر بالأشجار ، كما قال :\nلعب السيول به فأصبح ماؤه غللا يقطع في أصول الخروع\nومنه الغلالة للثوب الذي يلبس تحت الثياب . والغال : أرض مطمئنة ذات شجر . ومنابت السلم والطلح يقال لها : غال . والغال أيضا نبت ، والجمع غلان بالضم . وقال بعض الناس : إن معنى يغل يوجد غالا ; كما تقول : أحمدت الرجل وجدته محمودا . فهذه القراءة على هذا التأويل ترجع إلى معنى \" يغل \" بفتح الياء وضم الغين . ومعنى \" يغل \" عند جمهور أهل العلم أي ليس لأحد أن يغله ، أي يخونه في الغنيمة . فالآية في معنى نهي الناس عن الغلول في الغنائم ، والتوعد عليه . وكما لا يجوز أن يخان النبي - صلى الله عليه وسلم - لا يجوز أن يخان غيره ، ولكن خصه بالذكر لأن الخيانة معه أشد وقعا وأعظم وزرا ; لأن المعاصي تعظم بحضرته لتعين توقيره . والولاة إنما هم على أمر النبي - صلى الله عليه وسلم - فلهم حظهم من التوقير . وقيل : معنى يغل أي ما غل نبي قط ، وليس الغرض النهي .\nالثانية : قوله تعالى : ومن يغلل يأت بما غل يوم القيامة أي يأتي به حاملا له على ظهره ورقبته ، معذبا بحمله وثقله ، ومرعوبا بصوته ، وموبخا بإظهار خيانته على رءوس الأشهاد ; على ما يأتي . وهذه الفضيحة التي يوقعها الله تعالى بالغال نظير الفضيحة التي توقع بالغادر ، في أن ينصب له لواء عند إسته بقدر غدرته . وجعل الله تعالى هذه المعاقبات حسبما يعهده البشر ويفهمونه ; ألا ترى إلى قول الشاعر :\nأسمي ويحك هل سمعت بغدرة رفع اللواء لنا بها في المجمع\nوكانت العرب ترفع للغادر لواء ، وكذلك يطاف بالجاني مع جنايته . وفي صحيح مسلم عن أبي هريرة قال : قام فينا رسول الله - صلى الله عليه وسلم - ذات يوم فذكر الغلول فعظمه وعظم أمره ثم قال : لا ألفين أحدكم يجيء يوم القيامة على رقبته بعير له رغاء يقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك لا ألفين أحدكم يجيء يوم القيامة على رقبته فرس له حمحمة فيقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك لا ألفين أحدكم يجيء يوم القيامة على رقبته شاة لها ثغاء يقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك لا ألفين أحدكم يجيء يوم القيامة على رقبته نفس لها صياح فيقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك لا ألفين أحدكم يجيء يوم القيامة على رقبته رقاع تخفق فيقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك لا ألفين أحدكم يجيء يوم القيامة على رقبته صامت فيقول يا رسول الله أغثني فأقول لا أملك لك شيئا قد أبلغتك وروى أبو داود عن سمرة بن جندب قال : كان رسول الله - صلى الله عليه وسلم - إذا أصاب غنيمة أمر بلالا فنادى في الناس فيجيئون بغنائمهم فيخمسه ويقسمه ، فجاء رجل يوما بعد النداء بزمام من الشعر فقال : يا رسول الله هذا كان فيما أصبناه من الغنيمة . فقال : ( أسمعت بلالا ينادي ثلاثا ) ؟ قال : نعم . قال : ( فما منعك أن تجيء به ) ؟ فاعتذر إليه . فقال : ( كلا أنت تجيء به يوم القيامة فلن أقبله منك ) . قال بعض العلماء : أراد يوافي بوزر ذلك يوم القيامة ، كما قال في آية أخرى : وهم يحملون أوزارهم على ظهورهم ألا ساء ما يزرون . وقيل : الخبر محمول على شهرة الأمر ; أي يأتي يوم القيامة قد شهر الله أمره كما يشهر لو حمل بعيرا له رغاء أو فرسا له حمحمة .\nقلت : وهذا عدول عن الحقيقة إلى المجاز والتشبيه ، وإذا دار الكلام بين الحقيقة والمجاز فالحقيقة الأصل كما في كتب الأصول . وقد أخبر النبي - صلى الله عليه وسلم - بالحقيقة ، ولا عطر بعد عروس . ويقال : إن من غل شيئا في الدنيا يمثل له يوم القيامة في النار ، ثم يقال له : انزل إليه فخذه ، فيهبط إليه ، فإذا انتهى إليه حمله ، حتى إذا انتهى إلى الباب سقط عنه إلى أسفل جهنم ، فيرجع إليه فيأخذه ; لا يزال هكذا إلى ما شاء الله . ويقال يأت بما غل يعني تشهد عليه يوم القيامة تلك الخيانة والغلول .\nالثالثة : قال العلماء : والغلول كبيرة من الكبائر ; بدليل هذه الآية وما ذكرناه من حديث أبي هريرة : أنه يحمله على عنقه . وقد قال - صلى الله عليه وسلم - في مدعم : والذي نفسي بيده إن الشملة التي أخذ يوم خيبر من المغانم لم تصبها المقاسم لتشتعل عليه نارا قال : فلما سمع الناس ذلك جاء رجل بشراك أو شراكين إلى رسول الله - صلى الله عليه وسلم - ; فقال رسول الله - صلى الله عليه وسلم - : ( شراك أو شراكان من نار ) . أخرجه الموطأ . فقوله عليه السلام : ( والذي نفسي بيده ) وامتناعه من الصلاة على من غل دليل على تعظيم الغلول وتعظيم الذنب فيه وأنه من الكبائر ، وهو من حقوق الآدميين ولا بد فيه من القصاص بالحسنات والسيئات ، ثم صاحبه في المشيئة . وقوله : ( شراك أو شراكان من نار ) مثل قوله : ( أدوا الخياط والمخيط ) . وهذا يدل على أن القليل والكثير لا يحل أخذه في الغزو قبل المقاسم ، إلا ما أجمعوا عليه من أكل المطاعم في أرض الغزو ومن الاحتطاب والاصطياد . وقد روي عن الزهري أنه قال : لا يؤخذ الطعام في أرض العدو إلا بإذن الإمام . وهذا لا أصل له ; لأن الآثار تخالفه ، على ما يأتي . قال الحسن : كان أصحاب رسول الله - صلى الله عليه وسلم - إذا افتتحوا المدينة أو الحصن أكلوا من السويق والدقيق والسمن والعسل . وقال إبراهيم : كانوا يأكلون من أرض العدو الطعام في أرض الحرب ويعلفون قبل أن يخمسوا . وقال عطاء : في الغزاة يكونون في السرية فيصيبون أنحاء السمن والعسل والطعام فيأكلون ، وما بقي ردوه إلى إمامهم ; وعلى هذا جماعة العلماء .\nالرابعة : وفي هذا الحديث دليل على أن الغال لا يحرق متاعه ; لأن رسول الله - صلى الله عليه وسلم - لم يحرق متاع الرجل الذي أخذ الشملة ، ولا أحرق متاع صاحب الخرزات الذي ترك الصلاة عليه ، ولو كان حرق متاعه واجبا لفعله - صلى الله عليه وسلم - ولو فعله لنقل ذلك في الحديث . وأما ما روي عن عمر بن الخطاب - رضي الله عنه - عن النبي - صلى الله عليه وسلم - قال : إذا وجدتم الرجل قد غل فأحرقوا متاعه واضربوه . فرواه أبو داود والترمذي من حديث صالح بن محمد بن زائدة ، وهو ضعيف لا يحتج به . قال الترمذي : سألت محمدا - يعني البخاري - عن هذا الحديث فقال : إنما روى هذا صالح بن محمد وهو أبو واقد الليثي وهو منكر الحديث . وروى أبو داود أيضا عنه قال : غزونا مع الوليد بن هشام ومعنا سالم بن عبد الله بن عمر وعمر بن عبد العزيز ، فغل رجل متاعا فأمر الوليد بمتاعه فأحرق ، وطيف به ولم يعطه سهمه . قال أبو داود : وهذا أصح الحديثين . وروي من حديث عمرو بن شعيب عن أبيه عن جده أن رسول الله - صلى الله عليه وسلم - وأبا بكر وعمر حرقوا متاع الغال وضربوه . قال أبو داود : وزاد فيه علي بن بحر عن الوليد - ولم أسمعه منه - : ومنعوه سهمه . قال أبو عمر : قال بعض رواة هذا الحديث : واضربوا عنقه وأحرقوا متاعه . وهذا الحديث يدور على صالح بن محمد وليس ممن يحتج به . وقد ثبت عن النبي - صلى الله عليه وسلم - أنه قال : لا يحل دم امرئ مسلم إلا بإحدى ثلاث وهو ينفي القتل في الغلول . وروى ابن جريج عن أبي الزبير عن جابر عن النبي - صلى الله عليه وسلم - قال : ليس على الخائن ولا على المنتهب ولا على المختلس قطع . وهذا يعارض حديث صالح بن محمد وهو أقوى من جهة الإسناد . والغال خائن في اللغة والشريعة وإذا انتفى عنه القطع فأحرى القتل . وقال الطحاوي : لو صح حديث صالح المذكور احتمل أن يكون حين كانت العقوبات في الأموال ; كما قال في مانع الزكاة : إنا آخذوها وشطر ماله ، عزمة من عزمات الله تعالى . وكما قال أبو هريرة في ضالة الإبل المكتومة : فيها غرامتها ومثلها معها . وكما روى عبد الله بن عمرو بن العاص في الثمر المعلق غرامة مثليه وجلدات نكال وهذا كله منسوخ ، والله أعلم .\nالخامسة : فإذا غل الرجل في المغنم ووجد أخذ منه ، وأدب وعوقب بالتعزير . وعند مالك والشافعي وأبي حنيفة وأصحابهم والليث : لا يحرق متاعه . وقال الشافعي والليث وداود : إن كان عالما بالنهي عوقب . وقال الأوزاعي : يحرق متاع الغال كله إلا سلاحه وثيابه التي عليه وسرجه ، ولا تنزع منه دابته ، ولا يحرق الشيء الذي غل . وهذا قول أحمد وإسحاق ، وقاله الحسن ، إلا أن يكون حيوانا أو مصحفا . وقال ابن خويز منداد : وروي أن أبا بكر وعمر رضي الله عنهما ضربا الغال وأحرقا متاعه . قال ابن عبد البر : وممن قال يحرق رحل الغال ومتاعه مكحول وسعيد بن عبد العزيز . وحجة من ذهب إلى هذا حديث صالح المذكور . وهو عندنا حديث لا يجب به انتهاك حرمة ، ولا إنفاذ حكم ; لما يعارضه من الآثار التي هي أقوى منه . وما ذهب إليه مالك ومن تابعه من هذه المسألة أصح من جهة النظر وصحيح الأثر ، والله أعلم .\nالسادسة : لم يختلف مذهب مالك في العقوبة على البدن ، فأما في المال فقال في الذمي يبيع الخمر من المسلم : تراق الخمر على المسلم ، وينزع الثمن من الذمي عقوبة له ; لئلا يبيع الخمر من المسلمين . فعلى هذا يجوز أن يقال : تجوز العقوبة في المال . وقد أراق عمر - رضي الله عنه - لبنا شيب بماء .\nالسابعة : أجمع العلماء على أن للغال أن يرد جميع ما غل إلى صاحب المقاسم قبل أن يفترق الناس إن وجد السبيل إلى ذلك ، وإنه إذا فعل ذلك فهي توبة له ، وخروج عن ذنبه . واختلفوا فيما يفعل به إذا افترق أهل العسكر ولم يصل إليه ; فقال جماعة من أهل العلم : يدفع إلى الإمام خمسه ويتصدق بالباقي . هذا مذهب الزهري ومالك والأوزاعي والليث والثوري ; وروي عن عبادة بن الصامت ومعاوية والحسن البصري . وهو يشبه مذهب ابن مسعود وابن عباس ; لأنهما كانا يريان أن يتصدق بالمال الذي لا يعرف صاحبه ; وهو مذهب أحمد بن حنبل . وقال الشافعي : ليس له الصدقة بمال غيره . قال أبو عمر : فهذا عندي فيما يمكن وجود صاحبه والوصول إليه أو إلى ورثته ، وأما إن لم يكن شيء من ذلك فإن الشافعي لا يكره الصدقة حينئذ إن شاء الله . وقد أجمعوا في اللقطة على جواز الصدقة بها بعد التعريف لها وانقطاع صاحبها ، وجعلوه إذا جاء - مخيرا بين الأجر والضمان ، وكذلك المغصوب . وبالله التوفيق . وفي تغريم الغلول دليل على اشتراك الغانمين في الغنيمة ، فلا يحل لأحد أن يستأثر بشيء منها دون الآخر ; فمن غصب شيئا منها أدب اتفاقا ، على ما تقدم .\nالثامنة : وإن وطئ جارية أو سرق نصابا فاختلف العلماء في إقامة الحد عليه ; فرأى جماعة أنه لا قطع عليه .\nالتاسعة : ومن الغلول هدايا العمال ، وحكمه في الفضيحة في الآخرة حكم الغال . روى أبو داود في سننه ومسلم في صحيحه عن أبي حميد الساعدي أن النبي - صلى الله عليه وسلم - استعمل رجلا من الأزد يقال له ابن اللتبية قال ابن السرح ابن الأتبية على الصدقة ، فجاء فقال : هذا لكم وهذا أهدي لي . فقام النبي - صلى الله عليه وسلم - على المنبر فحمد الله وأثنى عليه وقال : ما بال العامل نبعثه فيجيء فيقول هذا لكم وهذا أهدي لي ألا جلس في بيت أمه أو أبيه فينظر أيهدى إليه أم لا ، لا يأتي أحد منكم بشيء من ذلك إلا جاء به يوم القيامة إن كان بعيرا فله رغاء وإن كانت بقرة فلها خوار أو شاة تيعر ) - ثم رفع يديه حتى رأينا عفرتي إبطيه ثم قال : ( اللهم هل بلغت اللهم هل بلغت ) . وروى أبو داود عن بريدة عن النبي - صلى الله عليه وسلم - قال : من استعملناه على عمل فرزقناه رزقا فما أخذ بعد ذلك فهو غلول . وروى أيضا عن أبي مسعود الأنصاري قال : بعثني رسول الله - صلى الله عليه وسلم - ساعيا ثم قال : ( انطلق أبا مسعود ولا ألفينك يوم القيامة تأتي على ظهرك بعير من إبل الصدقة له رغاء قد غللته ) . قال : إذا لا أنطلق . قال : ( إذا لا أكرهك ) . وقد قيد هذه الأحاديث ما رواه أبو داود أيضا عن المستورد بن شداد قال : سمعت النبي - صلى الله عليه وسلم - يقول : من كان لنا عاملا فليكتسب زوجة فإن لم يكن له خادم فليكتسب خادما فإن لم يكن له مسكن فليكتسب مسكنا . قال فقال أبو بكر : أخبرت أن النبي - صلى الله عليه وسلم - قال : ( من اتخذ غير ذلك فهو غال سارق ) ، والله أعلم .\nالعاشرة : ومن الغلول حبس الكتب عن أصحابها ، ويدخل غيرها في معناها . قال الزهري : إياك وغلول الكتب . فقيل له : وما غلول الكتب ؟ قال : حبسها عن أصحابها . وقد قيل في تأويل قوله تعالى : وما كان لنبي أن يغل أن يكتم شيئا من الوحي رغبة أو رهبة أو مداهنة . وذلك أنهم كانوا يكرهون ما في القرآن من عيب دينهم وسب آلهتهم ، فسألوه أن يطوي ذلك ; فأنزل الله هذه الآية ; قاله محمد بن بشار . وما بدأنا به قول الجمهور .\nالحادية عشرة : قوله تعالى : ثم توفى كل نفس ما كسبت وهم لا يظلمون تقدم القول فيه .\n                                    ",
        "saadi": "وَمَا كَانَ لِنَبِيٍّ أَن يَغُلَّۚ وَمَن يَغۡلُلۡ يَأۡتِ بِمَا غَلَّ يَوۡمَ ٱلۡقِيَٰمَةِۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١٦١\n                                        \n                                        \n                                        \n                                        الغلول هو: الكتمان من الغنيمة، [والخيانة في كل مال يتولاه الإنسان] وهو محرم إجماعا، بل هو من الكبائر، كما تدل عليه هذه الآية الكريمة وغيرها من النصوص، فأخبر الله تعالى أنه ما ينبغي ولا يليق بنبي أن يغل، لأن الغلول -كما علمت- من أعظم الذنوب وأشر العيوب. وقد صان الله تعالى أنبياءه عن كل ما يدنسهم ويقدح فيهم، وجعلهم أفضل العالمين أخلاقا، وأطهرهم نفوسا، وأزكاهم وأطيبهم، ونزههم عن كل عيب، وجعلهم محل رسالته، ومعدن حكمته { الله أعلم حيث يجعل رسالته }. فبمجرد علم العبد بالواحد منهم، يجزم بسلامتهم من كل أمر يقدح فيهم، ولا يحتاج إلى دليل على ما قيل فيهم من أعدائهم، لأن معرفته بنبوتهم، مستلزم لدفع ذلك، ولذلك أتى بصيغة يمتنع معها وجود الفعل منهم، فقال: { وما كان لنبي أن يغل } أي: يمتنع ذلك ويستحيل على من اختارهم الله لنبوته. ثم ذكر الوعيد على من غل، فقال: { ومن يغلل يأت بما غل يوم القيامة } أي: يأت به حامله على ظهره، حيوانا كان أو متاعا، أو غير ذلك، ليعذب به يوم القيامة، { ثم توفى كل نفس ما كسبت } الغال وغيره، كل يوفى أجره ووزره على مقدار كسبه، { وهم لا يظلمون } أي: لا يزاد في سيئاتهم، ولا يهضمون شيئا من حسناتهم، وتأمل حسن هذا الاحتراز في هذه الآية الكريمة. لما ذكر عقوبة الغال، وأنه يأتي يوم القيامة بما غله، ولما أراد أن يذكر توفيته وجزاءه، وكان الاقتصار على الغال يوهم -بالمفهوم- أن غيره من أنواع العاملين قد لا يوفون -أتى بلفظ عام جامع له ولغيره.\n                                    "
      },
      "originalText": "وَمَا كَانَ لِنَبِيٍّ أَن يَغُلَّۚ وَمَن يَغۡلُلۡ يَأۡتِ بِمَا غَلَّ يَوۡمَ ٱلۡقِيَٰمَةِۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ ١٦١"
    },
    {
      "number": 455,
      "text": "أَفَمَنِ اتَّبَعَ رِضْوَانَ اللَّهِ كَمَنْ بَاءَ بِسَخَطٍ مِنَ اللَّهِ وَمَأْوَاهُ جَهَنَّمُ ۚ وَبِئْسَ الْمَصِيرُ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 162,
      "juz": 4,
      "manzil": 1,
      "page": 71,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَفَمَنِ ٱتَّبَعَ رِضۡوَٰنَ ٱللَّهِ كَمَنۢ بَآءَ بِسَخَطٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ ٢٦١\n                                    \n                                    \n                                    وقوله : ( أفمن اتبع رضوان الله كمن باء بسخط من الله ومأواه جهنم وبئس المصير ) أي : لا يستوي من اتبع رضوان الله فيما شرعه ، فاستحق رضوان الله وجزيل ثوابه وأجير من وبيل عقابه ، ومن استحق غضب الله وألزم به ، فلا محيد له عنه ، ومأواه يوم القيامة جهنم وبئس المصير .\nوهذه لها نظائر في القرآن كثيرة كقوله تعالى : ( أفمن يعلم أنما أنزل إليك من ربك الحق كمن هو أعمى ) [ الرعد : 19 ] وكقوله ( أفمن وعدناه وعدا حسنا فهو لاقيه كمن متعناه متاع الحياة الدنيا [ ثم هو يوم القيامة من المحضرين ] ) [ القصص : 61 ] .\n                                    ",
        "qortoby": "أَفَمَنِ ٱتَّبَعَ رِضۡوَٰنَ ٱللَّهِ كَمَنۢ بَآءَ بِسَخَطٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ ٢٦١\n                                    \n                                    \n                                    قوله تعالى : أفمن اتبع رضوان الله كمن باء بسخط من الله ومأواه جهنم وبئس المصير\nقوله تعالى : أفمن اتبع رضوان الله يريد بترك الغلول والصبر على الجهاد . كمن باء بسخط من الله يريد بكفر أو غلول أو تول عن النبي - صلى الله عليه وسلم - في الحرب . ومأواه جهنم أي مثواه النار ، أي إن لم يتب أو يعف الله عنه . وبئس المصير أي المرجع . وقرئ رضوان بكسر الراء وضمها كالعدوان والعدوان .\n                                    ",
        "saadi": "أَفَمَنِ ٱتَّبَعَ رِضۡوَٰنَ ٱللَّهِ كَمَنۢ بَآءَ بِسَخَطٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ ٢٦١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه لا يستوي من كان قصده رضوان ربه، والعمل على ما يرضيه، كمن ليس كذلك، ممن هو مكب على المعاصي، مسخط لربه، هذان لا يستويان في حكم الله، وحكمة الله، وفي فطر عباد الله.\n                                        ولهذا قال هنا:\n                                        { أفمن كان مؤمنا كمن كان فاسقا لا يستوون }\n                                    "
      },
      "originalText": "أَفَمَنِ ٱتَّبَعَ رِضۡوَٰنَ ٱللَّهِ كَمَنۢ بَآءَ بِسَخَطٖ مِّنَ ٱللَّهِ وَمَأۡوَىٰهُ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ ٢٦١"
    },
    {
      "number": 456,
      "text": "هُمْ دَرَجَاتٌ عِنْدَ اللَّهِ ۗ وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 163,
      "juz": 4,
      "manzil": 1,
      "page": 71,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "هُمۡ دَرَجَٰتٌ عِندَ ٱللَّهِۗ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ ٣٦١\n                                    \n                                    \n                                    ثم قال : ( هم درجات عند الله ) قال الحسن البصري ومحمد بن إسحاق : يعني : أهل الخير وأهل الشر درجات ، وقال أبو عبيدة والكسائي : منازل ، يعني : متفاوتون في منازلهم ودرجاتهم في الجنة ودركاتهم في النار ، كما قال تعالى : ( ولكل درجات مما عملوا ) الآية [ الأنعام : 132 ] ، ولهذا قال : ( والله بصير بما يعملون ) أي : وسيوفيهم إياها ، لا يظلمهم خيرا ولا يزيدهم شرا ، بل يجازي كلا بعمله .\n                                    ",
        "qortoby": "هُمۡ دَرَجَٰتٌ عِندَ ٱللَّهِۗ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ ٣٦١\n                                    \n                                    \n                                    هم درجات عند الله أي ليس من اتبع رضوان الله كمن باء بسخط منه . قيل : هم درجات متفاوتة ، أي هم مختلفو المنازل عند الله ; فلمن اتبع رضوانه الكرامة والثواب العظيم ، ولمن باء بسخط منه المهانة والعذاب الأليم . ومعنى هم درجات - أي ذوو درجات . أو على درجات ، أو في درجات ، أو لهم درجات . وأهل النار أيضا ذوو درجات ; كما قال : ( وجدته في غمرات من النار فأخرجته إلى ضحضاح ) . فالمؤمن والكافر لا يستويان في الدرجة ; ثم المؤمنون يختلفون أيضا ، فبعضهم أرفع درجة من بعض ، وكذلك الكفار . والدرجة الرتبة ، ومنه الدرج ; لأنه يطوى رتبة بعد رتبة . والأشهر في منازل جهنم دركات ; كما قال : إن المنافقين في الدرك الأسفل من النار فلمن لم يغل درجات في الجنة ، ولمن غل دركات في النار . قال أبو عبيدة : جهنم أدراك ، أي منازل ; يقال لكل منزل منها : درك ودرك . والدرك إلى أسفل ، والدرج إلى أعلى .\n                                    ",
        "saadi": "هُمۡ دَرَجَٰتٌ عِندَ ٱللَّهِۗ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ ٣٦١\n                                        \n                                        \n                                        \n                                        { هم درجات عند الله } أي: كل هؤلاء متفاوتون في درجاتهم ومنازلهم بحسب تفاوتهم في أعمالهم. فالمتبعون لرضوان الله يسعون في نيل الدرجات العاليات، والمنازل والغرفات، فيعطيهم الله من فضله وجوده على قدر أعمالهم، والمتبعون لمساخط الله يسعون في النزول في الدركات إلى أسفل سافلين، كل على حسب عمله، والله تعالى بصير بأعمالهم، لا يخفى عليه منها شيء، بل قد علمها، وأثبتها في اللوح المحفوظ، ووكل ملائكته الأمناء الكرام، أن يكتبوها ويحفظوها، ويضبطونها.\n                                    "
      },
      "originalText": "هُمۡ دَرَجَٰتٌ عِندَ ٱللَّهِۗ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ ٣٦١"
    },
    {
      "number": 457,
      "text": "لَقَدْ مَنَّ اللَّهُ عَلَى الْمُؤْمِنِينَ إِذْ بَعَثَ فِيهِمْ رَسُولًا مِنْ أَنْفُسِهِمْ يَتْلُو عَلَيْهِمْ آيَاتِهِ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَإِنْ كَانُوا مِنْ قَبْلُ لَفِي ضَلَالٍ مُبِينٍ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 164,
      "juz": 4,
      "manzil": 1,
      "page": 71,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "قَدۡ مَنَّ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ إِذۡ بَعَثَ فِيهِمۡ رَسُولٗا مِّنۡ أَنفُسِهِمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٍ ٤٦١\n                                    \n                                    \n                                    وقوله : ( لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم ) أي : من جنسهم ليتمكنوا من مخاطبته وسؤاله ومجالسته والانتفاع به ، كما قال تعالى : ( ومن آياته أن خلق لكم من أنفسكم أزواجا لتسكنوا إليها ) [ الروم : 21 ] أي : من جنسكم . وقال تعالى : ( قل إنما أنا بشر مثلكم يوحى إلي ) [ الكهف : 110 ] وقال تعالى : ( وما أرسلنا قبلك من المرسلين إلا إنهم ليأكلون الطعام ويمشون في الأسواق ) [ الفرقان : 20 ] وقال تعالى : ( وما أرسلنا من قبلك إلا رجالا نوحي إليهم من أهل القرى ) [ يوسف : 109 ] وقال تعالى : ( يا معشر الجن والإنس ألم يأتكم رسل منكم ) [ الأنعام : 130 ] فهذا أبلغ في الامتنان أن يكون الرسل إليهم منهم ، بحيث يمكنهم مخاطبته ومراجعته في فهم الكلام عنه ، ولهذا قال : ( يتلو عليهم آياته ) يعني : القرآن ) ويزكيهم ) أي : يأمرهم بالمعروف وينهاهم عن المنكر لتزكو نفوسهم وتطهر من الدنس والخبث الذي كانوا متلبسين به في حال شركهم وجاهليتهم ( ويعلمهم الكتاب والحكمة ) يعني : القرآن والسنة ( وإن كانوا من قبل ) أي : من قبل هذا الرسول ( لفي ضلال مبين ) أي : لفي غي وجهل ظاهر جلي بين لكل أحد .\n                                    ",
        "qortoby": "قَدۡ مَنَّ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ إِذۡ بَعَثَ فِيهِمۡ رَسُولٗا مِّنۡ أَنفُسِهِمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٍ ٤٦١\n                                    \n                                    \n                                    قوله تعالى : لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة وإن كانوا من قبل لفي ضلال مبين\nبين الله تعالى عظيم منته عليهم ببعثه محمدا - صلى الله عليه وسلم - . والمعنى في المنة فيه أقوال : منها أن يكون معنى \" من أنفسهم \" أي بشر مثلهم . فلما أظهر البراهين وهو بشر مثلهم علم أن ذلك من عند الله . وقيل : من أنفسهم منهم . فشرفوا به - صلى الله عليه وسلم - فكانت تلك المنة . وقيل : من أنفسهم ليعرفوا حاله ولا تخفى عليهم طريقته . وإذا كان محله فيهم هذا كانوا أحق بأن يقاتلوا عنه ولا ينهزموا دونه . وقرئ في الشواذ \" من أنفسهم \" ( بفتح الفاء ) يعني من أشرفهم ; لأنه من بني هاشم ، وبنو هاشم أفضل من قريش ، وقريش أفضل من العرب ، والعرب أفضل من غيرهم . ثم قيل : لفظ المؤمنين عام ومعناه خاص في العرب ; لأنه ليس حي من أحياء العرب إلا وقد ولده - صلى الله عليه وسلم - ولهم فيه نسب ; إلا بني تغلب فإنهم كانوا نصارى فطهره الله من دنس النصرانية . وبيان هذا التأويل قوله تعالى : هو الذي بعث في الأميين رسولا منهم . وذكر أبو محمد عبد الغني قال : حدثنا أبو أحمد البصري حدثنا أحمد بن علي بن سعيد القاضي أبو بكر المروزي حدثنا يحيى بن معين حدثنا هشام بن يوسف عن عبد الله بن سليمان النوفلي عن الزهري عن عروة عن عائشة رضي الله عنها : لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم قالت : هذه للعرب خاصة . وقال آخرون : أراد به المؤمنين كلهم . ومعنى من أنفسهم أنه واحد منهم وبشر ومثلهم ، وإنما امتاز عنهم بالوحي ; وهو معنى قوله لقد جاءكم رسول من أنفسكم وخص المؤمنين بالذكر لأنهم المنتفعون به ، فالمنة عليهم أعظم .\nيتلو عليهم \" يتلو \" في موضع نصب نعت لرسول ، ومعناه يقرأ . والتلاوة القراءة . ويعلمهم الكتاب والحكمة تقدم في البقرة . وإن كانوا من قبل لفي ضلال مبين أي ولقد كانوا من قبل ، أي من قبل محمد ، وقيل : \" إن \" بمعنى \" ما \" ، واللام في الخبر بمعنى إلا . أي وما كانوا من قبل إلا في ضلال مبين . ومثله وإن كنتم من قبله لمن الضالين أي وما كنتم من قبله إلا من الضالين . وهذا مذهب الكوفيين . وقد تقدم في \" البقرة \" معنى هذه الآية .\n                                    ",
        "saadi": "قَدۡ مَنَّ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ إِذۡ بَعَثَ فِيهِمۡ رَسُولٗا مِّنۡ أَنفُسِهِمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٍ ٤٦١\n                                        \n                                        \n                                        \n                                        هذه المنة التي امتن الله بها على عباده، أكبر النعم، بل أصلها، وهي الامتنان عليهم بهذا الرسول الكريم الذي أنقذهم الله به من الضلالة، وعصمهم به من الهلكة، فقال: { لقد منَّ الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم } يعرفون نسبه، وحاله، ولسانه، من قومهم وقبيلتهم، ناصحا لهم، مشفقا عليهم، يتلو عليهم آيات الله، يعلمهم ألفاظها ومعانيها. { ويزكيهم } من الشرك، والمعاصي، والرذائل، وسائر مساوئ الأخلاق. و { يعلمهم الكتاب } إما جنس الكتاب الذي هو القرآن، فيكون قوله: { يتلو عليهم آياته } المراد به الآيات الكونية، أو المراد بالكتاب -هنا- الكتابة، فيكون قد امتن عليهم، بتعليم الكتاب والكتابة، التي بها تدرك العلوم وتحفظ، { والحكمة } هي: السنة، التي هي شقيقة القرآن، أو وضع الأشياء مواضعها، ومعرفة أسرار الشريعة. فجمع لهم بين تعليم الأحكام، وما به تنفذ الأحكام، وما به تدرك فوائدها وثمراتها، ففاقوا بهذه الأمور العظيمة جميع المخلوقين، وكانوا من العلماء الربانيين، { وإن كانوا من قبل } بعثة هذا الرسول { لفي ضلال مبين } لا يعرفون الطريق الموصل إلى ربهم، ولا ما يزكي النفوس ويطهرها، بل ما زين لهم جهلهم فعلوه، ولو ناقض ذلك عقول العالمين.\n                                    "
      },
      "originalText": "قَدۡ مَنَّ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ إِذۡ بَعَثَ فِيهِمۡ رَسُولٗا مِّنۡ أَنفُسِهِمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٍ ٤٦١"
    },
    {
      "number": 458,
      "text": "أَوَلَمَّا أَصَابَتْكُمْ مُصِيبَةٌ قَدْ أَصَبْتُمْ مِثْلَيْهَا قُلْتُمْ أَنَّىٰ هَٰذَا ۖ قُلْ هُوَ مِنْ عِنْدِ أَنْفُسِكُمْ ۗ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 165,
      "juz": 4,
      "manzil": 1,
      "page": 71,
      "ruku": 58,
      "hizbQuarter": 28,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَوَلَمَّآ أَصَٰبَتۡكُم مُّصِيبَةٞ قَدۡ أَصَبۡتُم مِّثۡلَيۡهَا قُلۡتُمۡ أَنَّىٰ هَٰذَاۖ قُلۡ هُوَ مِنۡ عِندِ أَنفُسِكُمۡۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٥٦١\n                                    \n                                    \n                                    قول تعالى : ( أولما أصابتكم مصيبة ) وهي ما أصيب منهم يوم أحد من قتل السبعين منهم ( قد أصبتم مثليها ) يعني : يوم بدر ، فإنهم قتلوا من المشركين سبعين قتيلا وأسروا سبعين أسيرا ( قلتم أنى هذا ) أي : من أين جرى علينا هذا ؟ ( قل هو من عند أنفسكم )\nقال ابن أبي حاتم : ذكره أبي ، أنبأنا أبو بكر بن أبي شيبة ، حدثنا قراد أبو نوح ، حدثنا عكرمة بن عمار ، حدثنا سماك الحنفي أبو زميل ، حدثني ابن عباس ، حدثني عمر بن الخطاب قال : لما كان يوم أحد من العام المقبل ، عوقبوا بما صنعوا يوم بدر من أخذهم الفداء ، فقتل منهم سبعون وفر أصحاب رسول الله صلى الله عليه وسلم عنه ، وكسرت رباعيته وهشمت البيضة على رأسه ، وسال الدم على وجهه ، فأنزل الله عز وجل : ( أولما أصابتكم مصيبة قد أصبتم مثليها قلتم أنى هذا قل هو من عند أنفسكم ) بأخذكم الفداء .\nوهكذا رواه الإمام أحمد عن عبد الرحمن بن غزوان ، وهو قراد أبو نوح ، بإسناده ولكن بأطول منه ، وكذا قال الحسن البصري .\nوقال ابن جرير : حدثنا القاسم ، حدثنا الحسين ، حدثنا إسماعيل ابن علية عن ابن عون ، عن محمد عن عبيدة ( ح ) قال سنيد - وهو حسين - : وحدثني حجاج عن جرير ، عن محمد ، عن عبيدة ، عن علي ، رضي الله عنه ، قال : جاء جبريل ، عليه السلام ، إلى النبي صلى الله عليه وسلم فقال : يا محمد ، إن الله قد كره ما صنع قومك في أخذهم الأسارى ، وقد أمرك أن تخيرهم بين أمرين ، إما أن يقدموا فتضرب أعناقهم ، وبين أن يأخذوا الفداء ، على أن يقتل منهم عدتهم . قال : فدعا رسول الله صلى الله عليه وسلم الناس فذكر ذلك لهم ، فقالوا : يا رسول الله ، عشائرنا وإخواننا ، ألا نأخذ فداءهم فنتقوى به على قتال عدونا ، ويستشهد منا عدتهم ، فليس في ذلك ما نكره ؟ قال : فقتل منهم يوم أحد سبعون رجلا عدة أسارى أهل بدر .\nوهكذا رواه الترمذي والنسائي من حديث أبي داود الحفري ، عن يحيى بن زكريا بن أبي زائدة ، عن سفيان بن سعيد ، عن هشام بن حسان ، عن محمد بن سيرين ، به . ثم قال الترمذي : حسن غريب لا نعرفه إلا من حديث ابن أبي زائدة . وروى أبو أسامة عن هشام نحوه . وروى عن ابن سيرين عن عبيدة ، عن النبي صلى الله عليه وسلم مرسلا .\nوقال محمد بن إسحاق ، وابن جريج ، والربيع بن أنس ، والسدي : ( قل هو من عند أنفسكم ) أي : بسبب عصيانكم رسول الله صلى الله عليه وسلم حين أمركم أن لا تبرحوا من مكانكم فعصيتم ، يعني بذلك الرماة ( إن الله على كل شيء قدير ) أي : ويفعل ما يشاء ويحكم ما يريد ، لا معقب لحكمه .\n                                    ",
        "qortoby": "أَوَلَمَّآ أَصَٰبَتۡكُم مُّصِيبَةٞ قَدۡ أَصَبۡتُم مِّثۡلَيۡهَا قُلۡتُمۡ أَنَّىٰ هَٰذَاۖ قُلۡ هُوَ مِنۡ عِندِ أَنفُسِكُمۡۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٥٦١\n                                    \n                                    \n                                    قوله تعالى : أولما أصابتكم مصيبة قد أصبتم مثليها قلتم أنى هذا قل هو من عند أنفسكم إن الله على كل شيء قدير\n\" الألف للاستفهام ، والواو للعطف . مصيبة أي غلبة . قد أصبتم مثليها يوم بدر بأن قتلتم منهم سبعين وأسرتم سبعين . والأسير في حكم المقتول ; لأن الآسر يقتل أسيره إن أراد . أي فهزمتموهم يوم بدر ويوم أحد أيضا في الابتداء ، وقتلتم فيه قريبا من عشرين ، قتلتم منهم في يومين ، ونالوا منكم في يوم أحد . قلتم أنى هذا أي من أين أصابنا هذا الانهزام والقتل ، ونحن نقاتل في سبيل الله ، ونحن مسلمون ، وفينا النبي والوحي ، وهم مشركون .\nقل هو من عند أنفسكم يعني مخالفة الرماة . وما من قوم أطاعوا نبيهم في حرب إلا نصروا ; لأنهم إذا أطاعوا فهم حزب الله ، وحزب الله هم الغالبون . وقال قتادة والربيع بن أنس : يعني سؤالهم النبي - صلى الله عليه وسلم - أن يخرج بعد ما أراد الإقامة بالمدينة . وتأولها في الرؤيا التي رآها درعا حصينة . علي بن أبي طالب - رضي الله عنه - : هو اختيارهم الفداء يوم بدر على القتل . وقد قيل لهم : إن فاديتم الأسارى قتل منكم على عدتهم . وروى البيهقي عن علي بن أبي طالب - رضي الله عنه - قال : قال النبي - صلى الله عليه وسلم - في الأسارى يوم بدر : ( إن شئتم قتلتموهم وإن شئتم فاديتموهم واستمتعتم بالفداء واستشهد منكم بعدتهم ) . فكان آخر السبعين ثابت بن قيس قتل يوم اليمامة . فمعنى من عند أنفسكم على القولين الأولين بذنوبكم . وعلى القول الأخير باختياركم .\n                                    ",
        "saadi": "أَوَلَمَّآ أَصَٰبَتۡكُم مُّصِيبَةٞ قَدۡ أَصَبۡتُم مِّثۡلَيۡهَا قُلۡتُمۡ أَنَّىٰ هَٰذَاۖ قُلۡ هُوَ مِنۡ عِندِ أَنفُسِكُمۡۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٥٦١\n                                        \n                                        \n                                        \n                                        هذا تسلية من الله تعالى لعباده المؤمنين، حين أصابهم ما أصابهم يوم \"أحد\" وقتل منهم نحو سبعين، فقال الله: إنكم { قد أصبتم } من المشركين { مثليها } يوم بدر فقتلتم سبعين من كبارهم وأسرتم سبعين، فليهن الأمر ولتخف المصيبة عليكم، مع أنكم لا تستوون أنتم وهم، فإن قتلاكم في الجنة وقتلاهم في النار. { قلتم أنى هذا } أي: من أين أصابنا ما أصابنا وهزمنا؟ { قل هو من عند أنفسكم } حين تنازعتم وعصيتم من بعد ما أراكم ما تحبون، فعودوا على أنفسكم باللوم، واحذروا من الأسباب المردية. { إن الله على كل شيء قدير } فإياكم وسوء الظن بالله، فإنه قادر على نصركم، ولكن له أتم الحكمة في ابتلائكم ومصيبتكم. { ذلك ولو يشاء الله لانتصر منهم ولكن ليبلو بعضكم ببعض }\n                                    "
      },
      "originalText": "أَوَلَمَّآ أَصَٰبَتۡكُم مُّصِيبَةٞ قَدۡ أَصَبۡتُم مِّثۡلَيۡهَا قُلۡتُمۡ أَنَّىٰ هَٰذَاۖ قُلۡ هُوَ مِنۡ عِندِ أَنفُسِكُمۡۗ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ٥٦١"
    }
  ]
}