{
  "number": 75,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 480,
      "text": "وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلَا تَكْتُمُونَهُ فَنَبَذُوهُ وَرَاءَ ظُهُورِهِمْ وَاشْتَرَوْا بِهِ ثَمَنًا قَلِيلًا ۖ فَبِئْسَ مَا يَشْتَرُونَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 187,
      "juz": 4,
      "manzil": 1,
      "page": 75,
      "ruku": 60,
      "hizbQuarter": 30,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَتُبَيِّنُنَّهُۥ لِلنَّاسِ وَلَا تَكۡتُمُونَهُۥ فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمۡ وَٱشۡتَرَوۡاْ بِهِۦ ثَمَنٗا قَلِيلٗاۖ فَبِئۡسَ مَا يَشۡتَرُونَ ٧٨١\n                                    \n                                    \n                                    هذا توبيخ من الله وتهديد لأهل الكتاب ، الذين أخذ عليهم العهد على ألسنة الأنبياء أن يؤمنوا بمحمد صلى الله عليه وسلم ، وأن ينوهوا بذكره في الناس ليكونوا على أهبة من أمره ، فإذا أرسله الله تابعوه ، فكتموا ذلك وتعوضوا عما وعدوا عليه من الخير في الدنيا والآخرة بالدون الطفيف ، والحظ الدنيوي السخيف ، فبئست الصفقة صفقتهم ، وبئست البيعة بيعتهم .\nوفي هذا تحذير للعلماء أن يسلكوا مسلكهم فيصيبهم ما أصابهم ، ويسلك بهم مسلكهم ، فعلى العلماء أن يبذلوا ما بأيديهم من العلم النافع ، الدال على العمل الصالح ، ولا يكتموا منه شيئا ، فقد ورد في الحديث المروي من طرق متعددة عن النبي صلى الله عليه وسلم أنه قال : \" من سئل عن علم فكتمه ألجم يوم القيامة بلجام من نار \" .\n                                    ",
        "qortoby": "وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَتُبَيِّنُنَّهُۥ لِلنَّاسِ وَلَا تَكۡتُمُونَهُۥ فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمۡ وَٱشۡتَرَوۡاْ بِهِۦ ثَمَنٗا قَلِيلٗاۖ فَبِئۡسَ مَا يَشۡتَرُونَ ٧٨١\n                                    \n                                    \n                                    قوله تعالى : وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه فنبذوه وراء ظهورهم واشتروا به ثمنا قليلا فبئس ما يشترون\nفيه مسألتان :\nالأولى : قوله تعالى : وإذ أخذ الله ميثاق الذين أوتوا الكتاب هذا متصل بذكر اليهود ; فإنهم أمروا بالإيمان بمحمد عليه السلام وبيان أمره ، فكتموا نعته . فالآية توبيخ لهم ، ثم مع ذلك هو خبر عام لهم ولغيرهم . قال الحسن وقتادة : هي في كل من أوتي علم شيء من الكتاب . فمن علم شيئا فليعلمه ، وإياكم وكتمان العلم فإنه هلكة . وقال محمد بن كعب : لا يحل لعالم أن يسكت على علمه ، ولا للجاهل أن يسكت على جهله ; قال الله تعالى : وإذ أخذ الله ميثاق الذين أوتوا الكتاب الآية . وقال : فاسألوا أهل الذكر إن كنتم لا تعلمون . وقال أبو هريرة : لولا ما أخذ الله على أهل الكتاب ما حدثتكم بشيء ; ثم تلا هذه الآية وإذا أخذ الله ميثاق الذين أوتوا الكتاب . وقال الحسن بن عمارة : أتيت الزهري بعدما ترك الحديث ، فألفيته على بابه فقلت : إن رأيت أن تحدثني . فقال : أما علمت أني تركت الحديث ؟ فقلت : إما أن تحدثني وإما أن أحدثك . قال حدثني . قلت : حدثني الحكم بن عتيبة عن يحيى بن الجزار قال سمعت علي بن أبي طالب يقول : ما أخذ الله على الجاهلين أن يتعلموا حتى أخذ على العلماء أن يعلموا . قال : فحدثني أربعين حديثا .\nالثانية : الهاء في قوله : لتبيننه للناس ترجع إلى محمد - صلى الله عليه وسلم - وإن لم يجر له ذكر . وقيل : ترجع إلى الكتاب ; ويدخل فيه بيان أمر النبي - صلى الله عليه وسلم - ; لأنه في الكتاب . ولا تكتمونه ولم يقل تكتمنه لأنه في معنى الحال ، أي لتبيننه غير كاتمين . وقرأ أبو عمرو وعاصم في رواية أبي بكر وأهل مكة لتبيننه بالتاء على حكاية الخطاب . والباقون بالياء لأنهم غيب . وقرأ ابن عباس \" وإذ أخذ الله ميثاق النبيين ليبيننه \" . فيجيء قوله فنبذوه عائدا على الناس الذين بين لهم الأنبياء . وفي قراءة ابن مسعود \" ليبينونه \" دون النون الثقيلة . والنبذ الطرح . وقد تقدم بيانه في \" البقرة \" . وراء ظهورهم مبالغة في الاطراح ، ومنه واتخذتموه وراءكم ظهريا وقد تقدم في \" البقرة \" بيانه أيضا . وتقدم معنى قوله : واشتروا به ثمنا قليلا في \" البقرة \" فلا معنى لإعادته . فبئس ما يشترون تقدم أيضا . والحمد لله\n                                    ",
        "saadi": "وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَتُبَيِّنُنَّهُۥ لِلنَّاسِ وَلَا تَكۡتُمُونَهُۥ فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمۡ وَٱشۡتَرَوۡاْ بِهِۦ ثَمَنٗا قَلِيلٗاۖ فَبِئۡسَ مَا يَشۡتَرُونَ ٧٨١\n                                        \n                                        \n                                        \n                                        الميثاق هو العهد الثقيل المؤكد، وهذا الميثاق أخذه الله تعالى على كل من أعطاه [الله] الكتب وعلمه العلم، أن يبين للناس ما يحتاجون إليه مما علمه الله، ولا يكتمهم ذلك، ويبخل عليهم به، خصوصا إذا سألوه، أو وقع ما يوجب ذلك، فإن كل من عنده علم يجب عليه في تلك الحال أن يبينه، ويوضح الحق من الباطل. فأما الموفقون، فقاموا بهذا أتم القيام، وعلموا الناس مما علمهم الله، ابتغاء مرضاة ربهم، وشفقة على الخلق، وخوفا من إثم الكتمان. وأما الذين أوتوا الكتاب، من اليهود والنصارى ومن شابههم، فنبذوا هذه العهود والمواثيق وراء ظهورهم، فلم يعبأوا بها، فكتموا الحق، وأظهروا الباطل، تجرؤا على محارم الله، وتهاونا بحقوق الله، وحقوق الخلق، واشتروا بذلك الكتمان ثمنا قليلا، وهو ما يحصل لهم إن حصل من بعض الرياسات، والأموال الحقيرة، من سفلتهم المتبعين أهواءهم، المقدمين شهواتهم على الحق، { فبئس ما يشترون } لأنه أخس العوض، والذي رغبوا عنه -وهو بيان الحق، الذي فيه السعادة الأبدية، والمصالح الدينية والدنيوية- أعظم المطالب وأجلها، فلم يختاروا الدنيء الخسيس ويتركوا العالي النفيس، إلا لسوء حظهم وهوانهم، وكونهم لا يصلحون لغير ما خلقوا له.\n                                    "
      },
      "originalText": "وَإِذۡ أَخَذَ ٱللَّهُ مِيثَٰقَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَتُبَيِّنُنَّهُۥ لِلنَّاسِ وَلَا تَكۡتُمُونَهُۥ فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمۡ وَٱشۡتَرَوۡاْ بِهِۦ ثَمَنٗا قَلِيلٗاۖ فَبِئۡسَ مَا يَشۡتَرُونَ ٧٨١"
    },
    {
      "number": 481,
      "text": "لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَلَا تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِنَ الْعَذَابِ ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 188,
      "juz": 4,
      "manzil": 1,
      "page": 75,
      "ruku": 60,
      "hizbQuarter": 30,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَا تَحۡسَبَنَّ ٱلَّذِينَ يَفۡرَحُونَ بِمَآ أَتَواْ وَّيُحِبُّونَ أَن يُحۡمَدُواْ بِمَا لَمۡ يَفۡعَلُواْ فَلَا تَحۡسَبَنَّهُم بِمَفَازَةٖ مِّنَ ٱلۡعَذَابِۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٨٨١\n                                    \n                                    \n                                    وقوله تعالى : ( لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا [ فلا تحسبنهم بمفازة من العذاب ] ) الآية ، يعني بذلك المرائين المتكثرين بما لم يعطوا ، كما جاء في الصحيحين عن رسول الله صلى الله عليه وسلم : \" من ادعى دعوى كاذبة ليتكثر بها لم يزده الله إلا قلة \" وفي الصحيح : \" المتشبع بما لم يعط كلابس ثوبي زور \" .\nوقال الإمام أحمد : حدثنا حجاج ، عن ابن جريج ، أخبرني ابن أبي مليكة أن حميد بن عبد الرحمن بن عوف أخبره : أن مروان قال : اذهب يا رافع - لبوابه - إلى ابن عباس ، رضي الله عنه ، فقل لئن كان كل امرئ منا فرح بما أتى وأحب أن يحمد بما لم يفعل - معذبا ، لنعذبن أجمعون ؟ فقال ابن عباس : وما لكم وهذه ؟ إنما نزلت هذه في أهل الكتاب ، ثم تلا ابن عباس : ( وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه فنبذوه وراء ظهورهم واشتروا به ثمنا قليلا فبئس ما يشترون ) وتلا ابن عباس : ( لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا ) الآية . وقال ابن عباس : سألهم النبي صلى الله عليه وسلم عن شيء ، فكتموه وأخبروه بغيره ، فخرجوا قد أروه أن قد أخبروه بما سألهم عنه ، واستحمدوا بذلك إليه ، وفرحوا بما أوتوا من كتمانهم ما سألهم عنه .\nوهكذا رواه البخاري في التفسير ، ومسلم ، والترمذي والنسائي في تفسيريهما ، وابن أبي حاتم وابن جرير وابن مردويه ، والحاكم في مستدركه ، كلهم من حديث عبد الملك بن جريج ، بنحوه ورواه البخاري أيضا من حديث ابن جريج عن ابن أبي مليكة عن علقمة بن وقاص : أن مروان قال لبوابه : اذهب يا رافع إلى ابن عباس ، فذكره .\nوقال البخاري : حدثنا سعيد بن أبي مريم ، أنبأنا محمد بن جعفر ، حدثني زيد بن أسلم ، عن عطاء بن يسار ، عن أبي سعيد الخدري ، رضي الله عنه ، أن رجالا من المنافقين على عهد رسول الله صلى الله عليه وسلم كان إذا خرج رسول الله صلى الله عليه وسلم إلى الغزو تخلفوا عنه ، وفرحوا بمقعدهم خلاف رسول الله صلى الله عليه وسلم ، فإذا قدم رسول الله صلى الله عليه وسلم من الغزو اعتذروا إليه وحلفوا ، وأحبوا أن يحمدوا بما لم يفعلوا ، فنزلت : ( لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا ) الآية .\nوكذا رواه مسلم من حديث ابن أبي مريم ، بنحوه وقد رواه ابن مردويه في تفسيره من حديث الليث بن سعد ، عن هشام بن سعد ، عن زيد بن أسلم قال : كان أبو سعيد ورافع بن خديج وزيد بن ثابت عند مروان فقال : يا أبا سعيد ، رأيت قول الله تعالى : ( لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا ) ونحن نفرح بما أتينا ونحب أن نحمد بما لم نفعل ؟ فقال أبو سعيد : إن هذا ليس من ذاك ، إنما ذاك أن ناسا من المنافقين كانوا يتخلفون إذا بعث رسول الله صلى الله عليه وسلم بعثا ، فإن كان فيه نكبة فرحوا بتخلفهم ، وإن كان لهم نصر من الله وفتح حلفوا لهم ليرضوهم ويحمدوهم على سرورهم بالنصر والفتح . فقال مروان : أين هذا من هذا ؟ فقال أبو سعيد : وهذا يعلم هذا ، فقال مروان : أكذلك يا زيد ؟ قال : نعم ، صدق أبو سعيد . ثم قال أبو سعيد : وهذا يعلم ذاك - يعني رافع بن خديج - ولكنه يخشى إن أخبرك أن تنزع قلائصه في الصدقة . فلما خرجوا قال زيد لأبي سعيد الخدري : ألا تحمدني على شهادة لك ؟ فقال أبو سعيد : شهدت الحق . فقال زيد : أو لا تحمدني على ما شهدت الحق ؟\nثم رواه من حديث مالك ، عن زيد بن أسلم ، عن رافع بن خديج : أنه كان هو وزيد بن ثابت عند مروان بن الحكم ، وهو أمير المدينة ، فقال مروان : يا رافع ، في أي شيء نزلت هذه ؟ فذكره كما تقدم عن أبي سعيد ، رضي الله عنهم ، وكان مروان يبعث بعد ذلك يسأل ابن عباس كما تقدم ، فقال له ما ذكرناه ، ولا منافاة بين ما ذكره ابن عباس وما قاله هؤلاء ، لأن الآية عامة في جميع ما ذكر ، والله أعلم .\nوقد روى ابن مردويه أيضا من حديث محمد بن أبي عتيق وموسى بن عقبة ، عن الزهري ، عن محمد بن ثابت الأنصاري ، أن ثابت بن قيس الأنصاري قال : يا رسول الله ، والله لقد خشيت أن أكون هلكت . قال : \" لم ؟ \" قال : نهى الله المرء أن يحب أن يحمد بما لم يفعل ، وأجدني أحب الحمد . ونهى الله عن الخيلاء ، وأجدني أحب الجمال ، ونهى الله أن نرفع أصواتنا فوق صوتك ، وأنا امرؤ جهوري الصوت . فقال رسول الله صلى الله عليه وسلم : \" ألا ترضى أن تعيش حميدا ، وتقتل شهيدا ، وتدخل الجنة ؟ \" قال : بلى يا رسول الله . فعاش حميدا ، وقتل شهيدا يوم مسيلمة الكذاب .\nوقوله : ( فلا تحسبنهم بمفازة من العذاب ) يقرأ بالتاء على مخاطبة المفرد ، وبالياء على الإخبار عنهم ، أي : لا تحسبون أنهم ناجون من العذاب ، بل لا بد لهم منه ، ولهذا قال : ( ولهم عذاب أليم )\n                                    ",
        "qortoby": "لَا تَحۡسَبَنَّ ٱلَّذِينَ يَفۡرَحُونَ بِمَآ أَتَواْ وَّيُحِبُّونَ أَن يُحۡمَدُواْ بِمَا لَمۡ يَفۡعَلُواْ فَلَا تَحۡسَبَنَّهُم بِمَفَازَةٖ مِّنَ ٱلۡعَذَابِۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٨٨١\n                                    \n                                    \n                                    قوله تعالى : لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا فلا تحسبنهم بمفازة من العذاب ولهم عذاب أليم\nأي بما فعلوا من القعود في التخلف عن الغزو وجاءوا به من العذر . ثبت في الصحيحين عن أبي سعيد الخدري أن رجالا من المنافقين في عهد رسول الله - صلى الله عليه وسلم - كان إذا خرج النبي - صلى الله عليه وسلم - إلى الغزو تخلفوا عنه وفرحوا بمقعدهم خلاف رسول الله - صلى الله عليه وسلم - فإذا قدم النبي - صلى الله عليه وسلم - اعتذروا إليه وحلفوا ، وأحبوا أن يحمدوا بما لم يفعلوا ; فنزلت لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا الآية . وفي الصحيحين أيضا أن مروان قال لبوابه : اذهب يا رافع إلى ابن عباس فقل له : لئن كان كل امرئ منا فرح بما أوتي وأحب أن يحمد بما لم يفعل معذبا لنعذبن أجمعون . فقال ابن عباس : ما لكم ولهذه الآية ! إنما أنزلت هذه الآية في أهل الكتاب . ثم تلا ابن عباس وإذا أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه و لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا . وقال ابن عباس : سألهم النبي - صلى الله عليه وسلم - عن شيء فكتموه إياه ، وأخبروه بغيره ; فخرجوا وقد أروه أن قد أخبروه بما سألهم عنه واستحمدوا بذلك إليه ، وفرحوا بما أتوا من كتمانهم إياه ، وما سألهم عنه . وقال محمد بن كعب القرظي : نزلت في علماء بني إسرائيل الذين كتموا الحق ، وأتوا ملوكهم من العلم ما يوافقهم في باطلهم ، واشتروا به ثمنا قليلا أي بما أعطاهم الملوك من الدنيا ; فقال الله لنبيه - صلى الله عليه وسلم - : لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا فلا تحسبنهم بمفازة من العذاب ولهم عذاب أليم . فأخبر أن لهم عذابا أليما بما أفسدوا من الدين على عباد الله . وقال الضحاك : إن اليهود كانوا يقولون للملوك إنا نجد في كتابنا أن الله يبعث نبينا في آخر الزمان يختم به النبوة ; فلما بعثه الله سألهم الملوك أهو هذا الذي تجدونه في كتابكم ؟ فقال اليهود طمعا في أموال الملوك : هو غير ذلك ، فأعطاهم الملوك الخزائن ; فقال الله تعالى : لا تحسبن الذين يفرحون بما أتوا الملوك من الكذب حتى يأخذوا عرض الدنيا . والحديث الأول خلاف مقتضى الحديث الثاني . ويحتمل أن يكون نزولها على السببين لاجتماعهما في زمن واحد ، فكانت جوابا للفريقين ، والله أعلم . وقوله : واستحمدوا بذلك إليه ، أي طلبوا أن يحمدوا . وقول مروان : لئن كان كل امرئ منا إلخ دليل على أن للعموم صيغا مخصوصة ، وأن \" الذين \" منها . وهذا مقطوع به من تفهم ذلك من القرآن والسنة . وقوله تعالى : ويحبون أن يحمدوا بما لم يفعلوا إذا كانت الآية في أهل الكتاب لا في المنافقين المتخلفين ; لأنهم كانوا يقولون : نحن على دين إبراهيم ولم يكونوا على دينه ، وكانوا يقولون : نحن أهل الصلاة والصوم والكتاب ; يريدون أن يحمدوا بذلك . و ( الذين ) فاعل بيحسبن بالياء . وهي قراءة نافع وابن عامر وابن كثير وأبي عمرو ; أي لا يحسبن الفارحون فرحهم منجيا لهم من العذاب . وقيل : المفعول الأول محذوف ، وهو أنفسهم . والثاني بمفازة . وقرأ الكوفيون تحسبن بالتاء على الخطاب للنبي - صلى الله عليه وسلم - ; أي لا تحسبن يا محمد الفارحين بمفازة من العذاب . وقوله فلا تحسبنهم بالتاء وفتح الباء ، إعادة تأكيد ، ومفعوله الأول الهاء والميم ، والمفعول الثاني محذوف ; أي كذلك ، والفاء عاطفة أو زائدة على بدل الفعل الثاني من الأول . وقرأ الضحاك وعيسى بن عمر بالتاء وضم الباء \" فلا تحسبنهم \" أراد محمدا - صلى الله عليه وسلم - وأصحابه . وقرأ مجاهد وابن كثير وأبو عمرو ويحيى بن يعمر بالياء وضم الباء خبرا عن الفارحين ; أي فلا يحسبن أنفسهم ; \" بمفازة \" المفعول الثاني . ويكون \" فلا يحسبنهم \" تأكيدا . وقيل : \" الذين \" فاعل \" بيحسبن \" ومفعولاها محذوفان لدلالة \" يحسبنهم \" عليه ; كما قال الشاعر :\nبأي كتاب أم بأية آية ترى حبهم عارا علي وتحسب\nاستغنى بذكر مفعول الواحد عن ذكر مفعول ، الثاني ، و \" بمفازة \" الثاني ، وهو بدل من الفعل الأول فأغنى لإبداله منه عن ذكر مفعوليه ، والفاء زائدة . وقيل : قد تجيء هذه الأفعال ملغاة لا في حكم الجمل المفيدة نحو قول الشاعر :\nوما خلت أبقى بيننا من مودة عراض المذاكي المسنفات القلائص\nالمذاكي : الخيل التي قد أتى عليها بعد قروحها سنة أو سنتان ; الواحد مذك ، مثل المخلف من الإبل ; وفي المثل جري المذكيات غلاب ، والمسنفات اسم مفعول ; يقال : سنفت البعير أسنفه سنفا إذا كففته بزمامه وأنت راكبه ، وأسنف البعير لغة في سنفه ، وأسنف البعير بنفسه إذا رفع رأسه ; يتعدى ولا يتعدى . وكانت العرب تركب الإبل وتجنب الخيل ; تقول : الحرب لا تبقي مودة . وقال كعب بن أبي سلمى :\nأرجو وآمل أن تدنو مودتها وما إخال لدينا منك تنويل\nوقرأ جمهور القراء السبعة وغيرهم أتوا بقصر الألف ، أي بما جاءوا به من الكذب والكتمان . وقرأ مروان بن الحكم والأعمش وإبراهيم النخعي \" آتوا \" بالمد ، بمعنى أعطوا : وقرأ سعيد بن جبير \" أوتوا \" على ما لم يسم فاعله ; أي أعطوا . والمفازة المنجاة ، مفعلة من فاز يفوز إذا نجا ; أي ليسوا بفائزين . وسمي موضع المخاوف مفازة على جهة التفاؤل ; قاله الأصمعي . وقيل : لأنها موضع تفويز ومظنة هلاك ; تقول العرب : فوز الرجل إذا مات . قال ثعلب : حكيت لابن الأعرابي قول الأصمعي فقال أخطأ ، قال لي أبو المكارم : إنما سميت مفازة ; لأن من قطعها فاز . وقال الأصمعي : سمي اللديغ سليما تفاؤلا . قال ابن الأعرابي : لأنه مستسلم لما أصابه . وقيل : لا تحسبنهم بمكان بعيد من العذاب ; لأن الفوز التباعد عن المكروه ، والله أعلم .\n                                    ",
        "saadi": "لَا تَحۡسَبَنَّ ٱلَّذِينَ يَفۡرَحُونَ بِمَآ أَتَواْ وَّيُحِبُّونَ أَن يُحۡمَدُواْ بِمَا لَمۡ يَفۡعَلُواْ فَلَا تَحۡسَبَنَّهُم بِمَفَازَةٖ مِّنَ ٱلۡعَذَابِۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٨٨١\n                                        \n                                        \n                                        \n                                        ثم قال تعالى: { لا تحسبن الذين يفرحون بما أتوا } أي: من القبائح والباطل القولي والفعلي. { ويحبون أن يحمدوا بما لم يفعلوا } أي: بالخير الذي لم يفعلوه، والحق الذي لم يقولوه، فجمعوا بين فعل الشر وقوله، والفرح بذلك ومحبة أن يحمدوا على فعل الخير الذي ما فعلوه. { فلا تحسبنهم بمفازة من العذاب } أي: بمحل نجوة منه وسلامة، بل قد استحقوه، وسيصيرون إليه، ولهذا قال: { ولهم عذاب أليم } ويدخل في هذه الآية الكريمة أهل الكتاب الذين فرحوا بما عندهم من العلم، ولم ينقادوا للرسول، وزعموا أنهم هم المحقون في حالهم ومقالهم، وكذلك كل من ابتدع بدعة قولية أو فعلية، وفرح بها، ودعا إليها، وزعم أنه محق وغيره مبطل، كما هو الواقع من أهل البدع. ودلت الآية بمفهومها على أن من أحب أن يحمد ويثنى عليه بما فعله من الخير واتباع الحق، إذا لم يكن قصده بذلك الرياء والسمعة، أنه غير مذموم، بل هذا من الأمور المطلوبة، التي أخبر الله أنه يجزي بها المحسنين له الأعمال والأقوال، وأنه جازى بها خواص خلقه، وسألوها منه، كما قال إبراهيم عليه السلام: { واجعل لي لسان صدق في الآخرين } وقال: { سلام على نوح في العالمين، إنا كذلك نجزي المحسنين } وقد قال عباد الرحمن: { واجعلنا للمتقين إماما } وهي من نعم الباري على عبده، ومننه التي تحتاج إلى الشكر.\n                                    "
      },
      "originalText": "لَا تَحۡسَبَنَّ ٱلَّذِينَ يَفۡرَحُونَ بِمَآ أَتَواْ وَّيُحِبُّونَ أَن يُحۡمَدُواْ بِمَا لَمۡ يَفۡعَلُواْ فَلَا تَحۡسَبَنَّهُم بِمَفَازَةٖ مِّنَ ٱلۡعَذَابِۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ ٨٨١"
    },
    {
      "number": 482,
      "text": "وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 189,
      "juz": 4,
      "manzil": 1,
      "page": 75,
      "ruku": 60,
      "hizbQuarter": 30,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٨١\n                                    \n                                    \n                                    ثم قال : ( ولله ملك السماوات والأرض والله على كل شيء قدير ) أي : هو مالك كل شيء ، والقادر على كل شيء فلا يعجزه شيء ، فهابوه ولا تخالفوه ، واحذروا نقمته وغضبه ، فإنه العظيم الذي لا أعظم منه ، القدير الذي لا أقدر منه .\n                                    ",
        "qortoby": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٨١\n                                    \n                                    \n                                    قوله تعالى : ولله ملك السماوات والأرض والله على كل شيء قدير\nهذا احتجاج على الذين قالوا إن الله فقير ونحن أغنياء ، وتكذيب لهم . وقيل : المعنى لا تظنن الفرحين ينجون من العذاب ; فإن لله كل شيء ، وهم في قبضة القدير ; فيكون معطوفا على الكلام الأول ، أي إنهم لا ينجون من عذابه ، يأخذهم متى شاء . والله على كل شيء أي ممكن قدير وقد مضى في \" البقرة \" .\n                                    ",
        "saadi": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٨١\n                                        \n                                        \n                                        \n                                        أي: هو المالك للسماوات والأرض وما فيهما، من سائر أصناف الخلق، المتصرف فيهم بكمال القدرة، وبديع الصنعة، فلا يمتنع عليه منهم أحد، ولا يعجزه أحد.\n                                    "
      },
      "originalText": "وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ٩٨١"
    },
    {
      "number": 483,
      "text": "إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لِأُولِي الْأَلْبَابِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 190,
      "juz": 4,
      "manzil": 1,
      "page": 75,
      "ruku": 61,
      "hizbQuarter": 30,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ لَأٓيَٰتٖ لِّأُوْلِي ٱلۡأَلۡبَٰبِ ٠٩١\n                                    \n                                    \n                                    قال الطبراني : حدثنا الحسن بن إسحاق التستري ، حدثنا يحيى الحماني ، حدثنا يعقوب القمي ، عن جعفر بن أبي المغيرة ، عن سعيد بن جبير ، عن ابن عباس قال : أتت قريش اليهود فقالوا : بم جاءكم موسى ؟ قالوا : عصاه ويده بيضاء للناظرين . وأتوا النصارى فقالوا : كيف كان عيسى ؟ قالوا : كان يبرئ الأكمه والأبرص ويحيي الموتى : فأتوا النبي صلى الله عليه وسلم فقالوا : ادع لنا ربك يجعل لنا الصفا ذهبا . فدعا ربه ، فنزلت هذه الآية : ( إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ) فليتفكروا فيها . وهذا مشكل ، فإن هذه الآية مدنية . وسؤالهم أن يكون الصفا ذهبا كان بمكة . والله أعلم .\nومعنى الآية أنه يقول تعالى : ( إن في خلق السماوات والأرض ) أي : هذه في ارتفاعها واتساعها ، وهذه في انخفاضها وكثافتها واتضاعها وما فيهما من الآيات المشاهدة العظيمة من كواكب سيارات ، وثوابت وبحار ، وجبال وقفار وأشجار ونبات وزروع وثمار ، وحيوان ومعادن ومنافع ، مختلفة الألوان والطعوم والروائح والخواص ( واختلاف الليل والنهار ) أي : تعاقبهما وتقارضهما الطول والقصر ، فتارة يطول هذا ويقصر هذا ، ثم يعتدلان ، ثم يأخذ هذا من هذا فيطول الذي كان قصيرا ، ويقصر الذي كان طويلا وكل ذلك تقدير العزيز الحكيم ، ولهذا قال : ( لأولي الألباب ) أي العقول التامة الذكية التي تدرك الأشياء بحقائقها على جلياتها ، وليسوا كالصم البكم الذين لا يعقلون الذين قال الله [ تعالى ] فيهم : ( وكأين من آية في السماوات والأرض يمرون عليها وهم عنها معرضون وما يؤمن أكثرهم بالله إلا وهم مشركون ) [ يوسف : 105 ، 106 ] .\n                                    ",
        "qortoby": "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ لَأٓيَٰتٖ لِّأُوْلِي ٱلۡأَلۡبَٰبِ ٠٩١\n                                    \n                                    \n                                    قوله تعالى : إن في خلق السماوات والأرض تقدم معنى هذه الآية في \" البقرة \" في غير موضع . فختم تعالى هذه السورة بالأمر بالنظر والاستدلال في آياته ; إذ لا تصدر إلا عن حي قيوم قدير وقدوس سلام غني عن العالمين ، حتى يكون إيمانهم مستندا إلى اليقين لا إلى التقليد .\nلآيات لأولي الألباب الذين يستعملون عقولهم في تأمل الدلائل . وروي عن عائشة رضي الله عنها أنها قالت لما نزلت هذه الآية على النبي قام يصلي ، فأتاه بلال يؤذنه بالصلاة ، فرآه يبكي فقال : يا رسول الله ، أتبكي وقد غفر الله لك ما تقدم من ذنبك وما تأخر ! فقال : يا بلال : أفلا أكون عبدا شكورا ، ولقد أنزل الله علي الليلة آية إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب - ثم قال : ( ويل لمن قرأها ولم يتفكر فيها ) .\nقال العلماء : يستحب لمن انتبه من نومه أن يمسح على وجهه ، ويستفتح قيامه بقراءة هذه العشر الآيات اقتداء بالنبي - صلى الله عليه وسلم - ثبت ذلك في الصحيحين وغيرهما وسيأتي ، ثم يصلي ما كتب له ، فيجمع بين التفكر والعمل ، وهو أفضل العمل على ما يأتي بيانه في هذه الآية بعد هذا . وروي عن أبي هريرة أن رسول الله - صلى الله عليه وسلم - كان يقرأ عشر آيات من آخر سورة \" آل عمران \" كل ليلة ، خرجه أبو نصر الوائلي السجستاني الحافظ في كتاب \" الإبانة \" من حديث سليمان بن موسى عن مظاهر بن أسلم المخزومي عن المقبري عن أبي هريرة . وقد تقدم أول السورة عن عثمان قال : من قرأ آخر آل عمران في ليلة كتب له قيام ليلة .\n                                    ",
        "saadi": "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ لَأٓيَٰتٖ لِّأُوْلِي ٱلۡأَلۡبَٰبِ ٠٩١\n                                        \n                                        \n                                        \n                                        يخبر تعالى: { إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب } وفي ضمن ذلك حث العباد على التفكر فيها، والتبصر بآياتها، وتدبر خلقها، وأبهم قوله: { آيات } ولم يقل: \"على المطلب الفلاني\" إشارة لكثرتها وعمومها، وذلك لأن فيها من الآيات العجيبة ما يبهر الناظرين، ويقنع المتفكرين، ويجذب أفئدة الصادقين، وينبه العقول النيرة على جميع المطالب الإلهية، فأما تفصيل ما اشتملت عليه، فلا يمكن لمخلوق أن يحصره، ويحيط ببعضه، وفي الجملة فما فيها من العظمة والسعة، وانتظام السير والحركة، يدل على عظمة خالقها، وعظمة سلطانه وشمول قدرته. وما فيها من الإحكام والإتقان، وبديع الصنع، ولطائف الفعل، يدل على حكمة الله ووضعه الأشياء مواضعها، وسعة علمه. وما فيها من المنافع للخلق، يدل على سعة رحمة الله، وعموم فضله، وشمول بره، ووجوب شكره. وكل ذلك يدل على تعلق القلب بخالقها ومبدعها، وبذل الجهد في مرضاته، وأن لا يشرك به سواه، ممن لا يملك لنفسه ولا لغيره مثقال ذرة في الأرض ولا في السماء. وخص الله بالآيات أولي الألباب، وهم أهل العقول؛ لأنهم هم المنتفعون بها، الناظرون إليها بعقولهم لا بأبصارهم.\n                                    "
      },
      "originalText": "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ لَأٓيَٰتٖ لِّأُوْلِي ٱلۡأَلۡبَٰبِ ٠٩١"
    },
    {
      "number": 484,
      "text": "الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 191,
      "juz": 4,
      "manzil": 1,
      "page": 75,
      "ruku": 61,
      "hizbQuarter": 30,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَذۡكُرُونَ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِهِمۡ وَيَتَفَكَّرُونَ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ رَبَّنَا مَا خَلَقۡتَ هَٰذَا بَٰطِلٗا سُبۡحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ ١٩١\n                                    \n                                    \n                                    ثم وصف تعالى أولي الألباب فقال : ( الذين يذكرون الله قياما وقعودا وعلى جنوبهم ) كما ثبت في صحيح البخاري عن عمران بن حصين ، رضي الله عنه ، أن رسول الله صلى الله عليه وسلم قال : \" صل قائما ، فإن لم تستطع فقاعدا ، فإن لم تستطع فعلى جنبك أي : لا يقطعون ذكره في جميع أحوالهم بسرائرهم وضمائرهم وألسنتهم ( ويتفكرون في خلق السماوات والأرض ) أي : يفهمون ما فيهما من الحكم الدالة على عظمة الخالق وقدرته ، وعلمه وحكمته ، واختياره ورحمته .\nوقال الشيخ أبو سليمان الداراني : إني لأخرج من منزلي ، فما يقع بصري على شيء إلا رأيت لله علي فيه نعمة ، أو لي فيه عبرة . رواه ابن أبي الدنيا في كتاب \" التفكر والاعتبار \" .\nوعن الحسن البصري أنه قال : تفكر ساعة خير من قيام ليلة . وقال الفضيل : قال الحسن : الفكرة مرآة تريك حسناتك وسيئاتك . وقال سفيان بن عيينة : الفكرة نور يدخل قلبك . وربما تمثل بهذا البيت :\nإذا المرء كانت له فكرة ففي كل شيء له عبرة\nوعن عيسى ، عليه السلام ، أنه قال : طوبى لمن كان قيله تذكرا ، وصمته تفكرا ، ونظره عبرا .\nوقال لقمان الحكيم : إن طول الوحدة ألهم للفكرة ، وطول الفكرة دليل على طرق باب الجنة .\nوقال وهب بن منبه : ما طالت فكرة امرئ قط إلا فهم ، وما فهم امرؤ قط إلا علم ، وما علم امرؤ قط إلا عمل .\nوقال عمر بن عبد العزيز : الكلام بذكر الله ، عز وجل ، حسن ، والفكرة في نعم الله أفضل العبادة .\nوقال مغيث الأسود : زوروا القبور كل يوم تفكركم ، وشاهدوا الموقف بقلوبكم ، وانظروا إلى المنصرف بالفريقين إلى الجنة أو النار ، وأشعروا قلوبكم وأبدانكم ذكر النار ومقامعها وأطباقها ، وكان يبكي عند ذلك حتى يرفع صريعا من بين أصحابه ، قد ذهب عقله .\nوقال عبد الله بن المبارك : مر رجل براهب عند مقبرة ومزبلة ، فناداه فقال : يا راهب ، إن عندك كنزين من كنوز الدنيا لك فيهما معتبر ، كنز الرجال وكنز الأموال .\nوعن ابن عمر : أنه كان إذا أراد أن يتعاهد قلبه ، يأتي الخربة فيقف على بابها ، فينادي بصوت حزين فيقول : أين أهلك ؟ ثم يرجع إلى نفسه فيقول : ( كل شيء هالك إلا وجهه ) [ القصص : 88 ] .\nوعن ابن عباس أنه قال : ركعتان مقتصدتان في تفكر ، خير من قيام ليلة والقلب ساه .\nوقال الحسن : يا ابن آدم ، كل في ثلث بطنك ، واشرب في ثلثه ، ودع ثلثه الآخر تتنفس للفكرة .\nوقال بعض الحكماء : من نظر إلى الدنيا بغير العبرة انطمس من بصر قلبه بقدر تلك الغفلة .\nوقال بشر بن الحارث الحافي : لو تفكر الناس في عظمة الله تعالى لما عصوه .\nوقال الحسن ، عن عامر بن عبد قيس قال : سمعت غير واحد ولا اثنين ولا ثلاثة من أصحاب النبي صلى الله عليه وسلم يقولون : إن ضياء الإيمان أو نور الإيمان التفكر .\nوعن عيسى ، عليه السلام ، أنه قال : يا ابن آدم الضعيف ، اتق الله حيثما كنت ، وكن في الدنيا ضيفا ، واتخذ المساجد بيتا ، وعلم عينيك البكاء ، وجسدك الصبر ، وقلبك الفكر ، ولا تهتم برزق غد .\nوعن أمير المؤمنين عمر بن عبد العزيز ، رضي الله عنه ، أنه بكى يوما بين أصحابه ، فسئل عن ذلك ، فقال : فكرت في الدنيا ولذاتها وشهواتها ، فاعتبرت منها بها ، ما تكاد شهواتها تنقضي حتى تكدرها مرارتها ، ولئن لم يكن فيها عبرة لمن اعتبر ، إن فيها مواعظ لمن ادكر .\nوقال ابن أبي الدنيا : أنشدني الحسين بن عبد الرحمن :\nنزهة المؤمن الفكر لذة المؤمن العبر\nنحمد الله وحده نحن كل على خطر\nرب لاه وعمره قد تقضى وما شعر\nرب عيش قد كان فو ق المنى مونق الزهر\nفي خرير من العيو ن وظل من الشجر\nوسرور من النبا ت وطيب من الثمر\nغيرته وأهله سرعة الدهر بالغير\nنحمد الله وحده إن في ذا لمعتبر\nإن في ذا لعبرة للبيب إن اعتبر\nوقد ذم الله تعالى من لا يعتبر بمخلوقاته الدالة على ذاته وصفاته وشرعه وقدره وآياته ، فقال : ( وكأين من آية في السماوات والأرض يمرون عليها وهم عنها معرضون . وما يؤمن أكثرهم بالله إلا وهم مشركون ) [ يوسف : 105 ، 106 ]\nومدح عباده المؤمنين : ( الذين يذكرون الله قياما وقعودا وعلى جنوبهم ويتفكرون في خلق السماوات والأرض ) قائلين ( ربنا ما خلقت هذا باطلا ) أي : ما خلقت هذا الخلق عبثا ، بل بالحق لتجزي الذين أساءوا بما عملوا ، وتجزي الذين أحسنوا بالحسنى ، ثم نزهوه عن العبث وخلق الباطل فقالوا : ( سبحانك ) أي : عن أن تخلق شيئا باطلا ( فقنا عذاب النار ) أي : يا من خلق الخلق بالحق والعدل ، يا من هو منزه عن النقائص والعيب والعبث ، قنا من عذاب النار بحولك وقوتك وقيضنا لأعمال ترضى بها عنا ، ووفقنا لعمل صالح تهدينا به إلى جنات النعيم ، وتجيرنا به من عذابك الأليم .\n                                    ",
        "qortoby": "ٱلَّذِينَ يَذۡكُرُونَ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِهِمۡ وَيَتَفَكَّرُونَ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ رَبَّنَا مَا خَلَقۡتَ هَٰذَا بَٰطِلٗا سُبۡحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ ١٩١\n                                    \n                                    \n                                    الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَامًا وَقُعُودًا وَعَلَى جُنُوبِهِمْ ذكر تعالى ثلاث هيئات لا يخلو ابن آدم منها في غالب أمره , فكأنها تحصر زمانه .\nومن هذا المعنى قول عائشة رضي الله عنها : كان رسول الله صلى الله عليه وسلم يذكر الله على كل أحيانه .\nأخرجه مسلم .\nفدخل في ذلك كونه على الخلاء وغير ذلك .\nوقد اختلف العلماء في هذا ; فأجاز ذلك عبد الله بن عمرو وابن سيرين والنخعي , وكره ذلك ابن عباس وعطاء والشعبي .\nوالأول أصح لعموم الآية والحديث .\nقال النخعي : لا بأس بذكر الله في الخلاء فإنه يصعد .\nالمعنى : تصعد به الملائكة مكتوبا في صحفهم ; فحذف المضاف .\nدليله قوله تعالى : \" ما يلفظ من قول إلا لديه رقيب عتيد \" [ ق : 18 ] .\nوقال : \" وإن عليكم لحافظين كراما كاتبين \" [ الانفطار : 10 - 11 ] .\nلأن الله عز وجل أمر عباده بالذكر على كل حال ولم يستثن فقال : \" اذكروا الله ذكرا كثيرا \" [ الأحزاب : 41 ] وقال : \" فاذكروني أذكركم \" [ البقرة : 152 ] وقال : \" إنا لا نضيع أجر من أحسن عملا \" [ الكهف : 3 ] فعم .\nفذاكر الله تعالى على كل حالاته مثاب مأجور إن شاء الله تعالى .\nوذكر أبو نعيم قال : حدثنا أبو بكر بن مالك حدثنا عبد الله بن أحمد بن حنبل قال حدثني أبي قال حدثنا وكيع قال حدثنا سفيان عن عطاء بن أبي مروان عن أبيه عن كعب الأحبار قال قال موسى عليه السلام : ( يا رب أقريب أنت فأناجيك أم بعيد فأناديك قال : يا موسى أنا جليس من ذكرني قال : يا رب فإنا نكون من الحال على حال نجلك ونعظمك أن نذكرك قال : وما هي ؟ قال : الجنابة والغائط قال : يا موسى اذكرني على كل حال ) .\nوكراهية من كره ذلك إما لتنزيه ذكر الله تعالى في المواضع المرغوب عن ذكره فيها ككراهية قراءة القرآن في الحمام , وإما إبقاء على الكرام الكاتبين على أن يحلهم موضع الأقذار والأنجاس لكتابة ما يلفظ به .\nوالله أعلم .\nو \" قياما وقعودا \" نصب على الحال .\n\" وعلى جنوبهم \" في موضع الحال ; أي ومضطجعين ومثله قوله تعالى : \" دعانا لجنبه أو قاعدا أو قائما \" [ يونس : 12 ] على العكس ; أي دعانا مضطجعا على جنبه .\nوذهب , جماعة من المفسرين منهم الحسن وغيره إلى أن قوله \" يذكرون الله \" إلى آخره , إنما هو عبارة عن الصلاة ; أي لا يضيعونها , ففي حال العذر يصلونها قعودا أو على جنوبهم .\nوهي مثل قوله تعالى : \" فإذا قضيتم الصلاة فاذكروا الله قياما وقعودا وعلى جنوبكم \" [ النساء : 103 ] في قول ابن مسعود على , ما يأتي بيانه .\nوإذا كانت الآية في الصلاة ففقهها أن الإنسان يصلي قائما , فإن لم يستطع فقاعدا , فإن لم يستطع فعلى جنبه ; كما ثبت عن عمران بن حصين قال : كان بي البواسير فسألت النبي صلى الله عليه وسلم عن الصلاة فقال : ( صل قائما , فإن لم تستطع فقاعدا , فإن لم تستطع فعلى جنب ) رواه الأئمة : وقد كان صلى الله عليه وسلم يصلي قاعدا قبل موته بعام في النافلة ; على ما في صحيح مسلم .\nوروى النسائي عن عائشة رضي الله عنها قالت : رأيت رسول الله صلى الله عليه وسلم يصلي متربعا .\nقال أبو عبد الرحمن : لا أعلم أحدا روى هذا الحديث غير أبي داود الحفري وهو ثقة , ولا أحسب هذا الحديث إلا خطأ .\nوالله أعلم .\nواختلف العلماء في كيفية صلاة المريض والقاعد وهيئتها ; فذكر ابن عبد الحكم عن مالك أنه يتربع في قيامه , وقاله البويطي عن الشافعي فإذا أراد السجود تهيأ للسجود على قدر ما يطيق , قال : وكذلك المتنفل .\nونحوه قول الثوري , وكذلك قال الليث وأحمد وإسحاق وأبو يوسف ومحمد .\nوقال الشافعي في رواية المزني : يجلس في صلاته كلها كجلوس التشهد .\nوروي هذا عن مالك وأصحابه ; والأول المشهور وهو ظاهر المدونة .\nوقال أبو حنيفة وزفر : يجلس كجلوس التشهد , وكذلك يركع ويسجد .\nقال : فإن لم يستطع القعود صلى على جنبه أو ظهره على التخيير ; هذا مذهب المدونة وحكى ابن حبيب عن ابن القاسم يصلي على ظهره , فإن لم يستطع فعلى جنبه الأيمن ثم على جنبه الأيسر .\nوفي كتاب ابن المواز عكسه , يصلي على جنبه الأيمن , وإلا فعلى الأيسر , وإلا فعلى الظهر .\nوقال سحنون : يصلي على الأيمن كما يجعل في لحده , وإلا فعلى ظهره وإلا فعلى الأيسر .\nوقال مالك وأبو حنيفة : إذا صلى مضطجعا تكون رجلاه مما يلي القبلة .\nوالشافعي والثوري : يصلي على جنبه ووجهه إلى القبلة .\nفإن قوي لخفة المرض وهو في الصلاة ; قال ابن القاسم : إنه يقوم فيما بقي من صلاته ويبني على ما مضى ; وهو قول الشافعي وزفر والطبري .\nوقال أبو حنيفة وصاحباه يعقوب ومحمد فيمن صلى مضطجعا ركعة ثم صح : أنه يستقبل الصلاة من أولها , ولو كان قاعدا يركع ويسجد ثم صح بنى في قول أبي حنيفة ولم يبن في قول محمد .\nوقال أبو حنيفة وأصحابه : إذا افتتح الصلاة قائما ثم صار إلى حد الإيماء فليبن ; وروي عن أبي يوسف .\nوقال مالك في المريض الذي لا يستطيع الركوع ولا السجود وهو يستطيع القيام والجلوس : إنه يصلي قائما ويومئ إلى الركوع , فإذا أراد السجود جلس وأومأ إلى السجود ; وهو قول أبي يوسف وقياس قول الشافعي وقال , أبو حنيفة وأصحابه : يصلي قاعدا .\nوأما صلاة الراقد الصحيح فروي عن حديث عمران بن حصين زيادة ليست موجودة في غيره , وهي \" صلاة الراقد مثل نصف صلاة القاعد \" .\nقال أبو عمر : وجمهور أهل العلم لا يجيزون النافل مضطجعا ; وهو حديث لم يروه إلا حسين المعلم وهو حسين بن ذكوان عن عبد الله بن بريدة عن عمران بن حصين , وقد اختلف على حسين في إسناده ومتنه اختلافا يوجب التوقف عنه , وإن صح فلا أدري ما وجهه ; فإن كان أحد من أهل العلم قد أجاز النافلة مضطجعا لمن قدر على القعود أو على القيام فوجهه هذه الزيادة في هذا الخبر , وهي حجة لمن ذهب إلى ذلك .\nوإن أجمعوا على كراهة النافلة راقدا لمن قدر على القعود أو القيام , فحديث حسين هذا إما غلط وإما منسوخ وقيل : المراد بالآية الذين يستدلون بخلق السموات والأرض على أن المتغير لا بد له من مغير , وذلك المغير يجب أن يكون قادرا على الكمال , وله أن يبعث الرسل , فإن بعث رسولا ودل على صدقه بمعجزة واحدة لم يبق لأحد عذر ; فهؤلاء الذين يذكرون الله على كل حال .\nوالله أعلم . وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ قد بينا معنى \" ويذكرون \" وهو إما ذكر باللسان وإما الصلاة فرضها ونفلها ; فعطف تعالى عبادة أخرى على إحداهما بعبادة أخرى , وهي التفكر في قدرة الله تعالى ومخلوقاته والعبر الذي بث ; ليكون ذلك أزيد بصائرهم : وفي كل شيء له آية تدل على أنه واحد وقيل : \" يتفكرون \" عطف على الحال .\nوقيل : يكون منقطعا ; والأول أشبه .\nوالفكرة : تردد القلب في الشيء ; يقال : تفكر , ورجل فكير كثير الفكر , ومر النبي صلى الله عليه وسلم على قوم يتفكرون في الله فقال : ( تفكروا في الخلق , ولا تتفكروا في الخالق فإنكم لا تقدرون قدره ) وإنما التفكر والاعتبار وانبساط الذهن في المخلوقات كما قال : \" ويتفكرون في خلق السموات والأرض \" .\nوحكي أن سفيان الثوري رضي الله عنه صلى خلف المقام ركعتين , ثم رفع رأسه إلى السماء فلما رأى الكواكب غشي عليه , وكان يبول الدم من طول حزنه وفكرته .\nوروي عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : ( بينما رجل مستلق على فراشه إذ رفع رأسه فنظر إلى النجوم وإلى السماء فقال أشهد أن لك , ربا وخالقا اللهم اغفر لي فنظر الله إليه فغفر له ) وقال صلى الله عليه وسلم : ( لا عبادة كتفكر ) .\nوروي عنه عليه السلام قال : ( تفكر ساعة خير من عبادة سنة ) .\nوروى ابن القاسم عن مالك قال : قيل لأم الدرداء : ما كان أكثر شأن أبي الدرداء ؟ قالت : كان أكثر شأنه التفكر .\nقيل له : أفترى التفكر عمل من الأعمال ؟ قال : نعم , هو اليقين .\nوقيل لابن المسيب في الصلاة بين الظهر والعصر , قال : ليست هذه عبادة , إنما العبادة الورع عما حرم الله والتفكر في أمر الله .\nوقال الحسن : تفكر ساعة خير من قيام ليلة ; وقال ابن العباس وأبو الدرداء .\nوقال الحسن : الفكرة مرآة المؤمن ينظر فيها إلى حسناته وسيئاته .\nومما يتفكر فيه مخاوف الآخرة من الحشر والنشر والجنة ونعيمها والنار وعذابها .\nويروى أن أبا سليمان الداراني رضي الله عنه أخذ قدح الماء ليتوضأ لصلاة الليل وعنده ضيف , فرآه لما أدخل أصبعه في أذن القدح أقام لذلك متفكرا حتى طلع الفجر ; فقال له : ما هذا يا أبا سليمان ؟ قال : إني لما طرحت أصبعي في أذن القدح تفكرت في قول الله تعالى \" إذ الأغلال في أعناقهم والسلاسل يسحبون \" [ المؤمن : 71 ] تفكرت , في حالي وكيف أتلقى الغل إن طرح في عنقي يوم القيامة , فما زلت في ذلك حتى أصبحت .\nقال ابن عطية : \" وهذا نهاية الخوف , وخير الأمور أوساطها , وليس علماء الأمة الذين هم الحجة على هذا المنهاج , وقراءة علم كتاب الله تعالى ومعاني سنة رسول الله صلى الله عليه وسلم لمن يفهم ويرجى نفعه أفضل من هذا \" .\nقال ابن العربي : اختلف الناس أي العملين أفضل : التفكر أم الصلاة ; فذهب الصوفية إلى أن التفكر أفضل ; فإنه يثمر المعرفة وهو أفضل , المقامات الشرعية .\nوذهب الفقهاء إلى أن الصلاة أفضل ; لما ورد في الحديث من الحث عليها والدعاء إليها والترغيب فيها .\nوفي الصحيحين عن ابن عباس أنه بات عند خالته ميمونة , وفيه : فقام رسول الله صلى الله عليه وسلم فمسح النوم عن وجهه ثم قرأ الآيات العشر الخواتم من سورة آل عمران , وقام إلى شن معلق فتوضأ وضوءا خفيفا ثم صلى ثلاث عشرة ركعة ; الحديث .\nفانظروا رحمكم الله إلى جمعه بين التفكر في المخلوقات ثم إقباله على صلاته بعده ; وهذه السنة هي التي يعتمد عليها .\nفأما طريقة الصوفية أن يكون الشيخ منهم يوما وليلة وشهرا مفكرا لا يفتر ; فطريقة بعيدة عن الصواب غير لائقة بالبشر , ولا مستمرة على السنن .\nقال ابن عطية : وحدثني أبي عن بعض علماء المشرق قال : كنت بائتا في مسجد الأقدام بمصر فصليت العتمة فرأيت رجلا قد اضطجع في كساء له مسجى بكسائه حتى أصبح , وصلينا نحن تلك الليلة ; فلما أقيمت صلاة الصبح قام ذلك الرجل فاستقبل القبلة وصلى مع الناس , فاستعظمت جراءته في الصلاة بغير وضوء ; فلما فرغت الصلاة خرج فتبعته لأعظه , فلما دنوت منه سمعته ينشد شعرا : مسجى الجسم غائب حاضر منتبه القلب صامت ذاكر منقبض في الغيوب منبسط كذاك من كان عارفا ذاكر يبيت في ليله أخا فكر فهو مدى الليل نائم ساهر قال : فعلمت أنه ممن يعبد بالفكرة , فانصرفت عنه . رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ أي يقولون : ما خلقته عبثا وهزلا , بل خلقته دليلا على قدرتك وحكمتك .\nوالباطل : الزائل الذاهب .\nومنه قول لبيد : ألا كل شيء ما خلا الله باطل أي زائل .\nو \" باطلا \" نصب لأنه نعت مصدر محذوف ; أي خلقا باطلا وقيل : انتصب على نزع الخافض , أي ما خلقتها للباطل .\nوقيل : على المفعول الثاني , ويكون خلق بمعنى جعل .\n\" سبحانك \" أسند النحاس عن موسى بن طلحة قال : سئل رسول الله صلى الله عليه وسلم عن معنى \" سبحان الله \" فقال : ( تنزيه الله عن السوء ) وقد تقدم في \" البقرة \" معناه مستوفى .\n\" وقنا عذاب النار \" أجرنا من عذابها , وقد تقدم .\n                                    ",
        "saadi": "ٱلَّذِينَ يَذۡكُرُونَ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِهِمۡ وَيَتَفَكَّرُونَ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ رَبَّنَا مَا خَلَقۡتَ هَٰذَا بَٰطِلٗا سُبۡحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ ١٩١\n                                        \n                                        \n                                        \n                                        ثم وصف أولي الألباب بأنهم { يذكرون الله } في جميع أحوالهم: { قياما وقعودا وعلى جنوبهم } وهذا يشمل جميع أنواع الذكر بالقول والقلب، ويدخل في ذلك الصلاة قائما، فإن لم يستطع فقاعدا، فإن لم يستطع فعلى جنب، وأنهم { يتفكرون في خلق السماوات والأرض } أي: ليستدلوا بها على المقصود منها، ودل هذا على أن التفكر عبادة من صفات أولياء الله العارفين، فإذا تفكروا بها، عرفوا أن الله لم يخلقها عبثا، فيقولون: { ربنا ما خلقت هذا باطلا سبحانك } عن كل ما لا يليق بجلالك، بل خلقتها بالحق وللحق، مشتملة على الحق. { فقنا عذاب النار } بأن تعصمنا من السيئات، وتوفقنا للأعمال الصالحات، لننال بذلك النجاة من النار. ويتضمن ذلك سؤال الجنة، لأنهم إذا وقاهم الله عذاب النار حصلت لهم الجنة، ولكن لما قام الخوف بقلوبهم، دعوا الله بأهم الأمور عندهم.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَذۡكُرُونَ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِهِمۡ وَيَتَفَكَّرُونَ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ رَبَّنَا مَا خَلَقۡتَ هَٰذَا بَٰطِلٗا سُبۡحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ ١٩١"
    },
    {
      "number": 485,
      "text": "رَبَّنَا إِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ ۖ وَمَا لِلظَّالِمِينَ مِنْ أَنْصَارٍ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 192,
      "juz": 4,
      "manzil": 1,
      "page": 75,
      "ruku": 61,
      "hizbQuarter": 30,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَآ إِنَّكَ مَن تُدۡخِلِ ٱلنَّارَ فَقَدۡ أَخۡزَيۡتَهُۥۖ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٖ ٢٩١\n                                    \n                                    \n                                    ثم قالوا : ( ربنا إنك من تدخل النار فقد أخزيته ) أي : أهنته وأظهرت خزيه لأهل الجمع ( وما للظالمين من أنصار ) أي : يوم القيامة لا مجير لهم منك ، ولا محيد لهم عما أردت بهم .\n                                    ",
        "qortoby": "رَبَّنَآ إِنَّكَ مَن تُدۡخِلِ ٱلنَّارَ فَقَدۡ أَخۡزَيۡتَهُۥۖ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٖ ٢٩١\n                                    \n                                    \n                                    رَبَّنَا إِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ أي أذللته وأهنته .\nوقال المفضل أي أهلكته ; وأنشد : أخزى الإله من الصليب عبيده واللابسين قلانس الرهبان وقيل : فضحته وأبعدته ; يقال : أخزاه الله : أبعده ومقته .\nوالاسم الخزي .\nقال ابن السكيت : خزي يخزى خزيا إذا وقع في بلية .\nوقد تمسك بهذه الآية أصحاب الوعيد وقالوا : من أدخل النار ينبغي ألا يكون مؤمنا ; لقوله تعالى : \" فقد أخزيته \" فإن الله يقول : \" يوم لا يخزي الله النبي والذين آمنوا معه \" [ التحريم : 8 ] .\nوما قالوه مردود ; لقيام الأدلة على أن من ارتكب كبيرة لا يزول عنه اسم الإيمان , كما تقدم ويأتي .\nوالمراد من قوله : \" من تدخل النار \" من تخلد في النار ; قاله أنس بن مالك .\nوقال قتادة : تدخل مقلوب تخلد , ولا نقول كما قال أهل حروراء .\nوقال سعيد بن المسيب : الآية خاصة في قوم لا يخرجون من النار ; ولهذا قال وَمَا لِلظَّالِمِينَ مِنْ أَنْصَارٍ أي الكفار .\nوقال أهل المعاني , : الخزي يحتمل أن يكون بمعنى الحياء ; يقال : خزي يخزى خزاية إذا استحيا , فهو خزيان .\nقال ذو الرمة : خزاية أدركته عند جولته من جانب الحبل مخلوطا بها الغضب فخزي المؤمنين يومئذ استحياؤهم في دخول النار من سائر أهل الأديان إلى أن يخرجوا منها .\nوالخزي للكافرين هو إهلاكهم فيها من غير موت ; والمؤمنون يموتون , فافترقوا .\nكذا ثبت في صحيح السنة من حديث أبي سعيد الخدري , أخرجه مسلم , وقد تقدم ويأتي .\n                                    ",
        "saadi": "رَبَّنَآ إِنَّكَ مَن تُدۡخِلِ ٱلنَّارَ فَقَدۡ أَخۡزَيۡتَهُۥۖ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٖ ٢٩١\n                                        \n                                        \n                                        \n                                        { ربنا إنك من تدخل النار فقد أخزيته } أي: لحصوله على السخط من الله، ومن ملائكته، وأوليائه، ووقوع الفضيحة التي لا نجاة منها، ولا منقذ منها، ولهذا قال: { وما للظالمين من أنصار } ينقذونهم من عذابه، وفيه دلالة على أنهم دخلوها بظلمهم.\n                                    "
      },
      "originalText": "رَبَّنَآ إِنَّكَ مَن تُدۡخِلِ ٱلنَّارَ فَقَدۡ أَخۡزَيۡتَهُۥۖ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٖ ٢٩١"
    },
    {
      "number": 486,
      "text": "رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 193,
      "juz": 4,
      "manzil": 1,
      "page": 75,
      "ruku": 61,
      "hizbQuarter": 30,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَّبَّنَآ إِنَّنَا سَمِعۡنَا مُنَادِيٗا يُنَادِي لِلۡإِيمَٰنِ أَنۡ ءَامِنُواْ بِرَبِّكُمۡ فَ‍َٔامَنَّاۚ رَبَّنَا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَكَفِّرۡ عَنَّا سَيِّ‍َٔاتِنَا وَتَوَفَّنَا مَعَ ٱلۡأَبۡرَارِ ٣٩١\n                                    \n                                    \n                                    ( ربنا إننا سمعنا مناديا ينادي للإيمان ) أي : داعيا يدعو إلى الإيمان ، وهو الرسول صلى الله عليه وسلم ( أن آمنوا بربكم فآمنا ) أي يقول : ( آمنوا بربكم فآمنا ) أي : فاستجبنا له واتبعناه ( ربنا فاغفر لنا ذنوبنا ) أي : بإيماننا واتباعنا نبيك فاغفر لنا ذنوبنا ، أي : استرها ( وكفر عنا سيئاتنا ) أي : فيما بيننا وبينك ( وتوفنا مع الأبرار ) أي : ألحقنا بالصالحين\n                                    ",
        "qortoby": "رَّبَّنَآ إِنَّنَا سَمِعۡنَا مُنَادِيٗا يُنَادِي لِلۡإِيمَٰنِ أَنۡ ءَامِنُواْ بِرَبِّكُمۡ فَ‍َٔامَنَّاۚ رَبَّنَا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَكَفِّرۡ عَنَّا سَيِّ‍َٔاتِنَا وَتَوَفَّنَا مَعَ ٱلۡأَبۡرَارِ ٣٩١\n                                    \n                                    \n                                    رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أي محمدا صلى الله عليه وسلم ; قاله ابن مسعود وابن عباس وأكثر المفسرين .\nوقال قتادة ومحمد بن كعب القرظي : هو القرآن , وليس كلهم سمع رسول الله صلى الله عليه وسلم .\nدليل هذا القول ما أخبر الله تعالى عن مؤمني الجن إذ قالوا : \" إنا سمعنا قرآنا عجبا يهدي إلى الرشد \" [ الجن : 1 - 2 ] .\nوأجاب الأولون فقالوا : من سمع القرآن فكأنما لقي النبي صلى الله عليه وسلم ; وهذا صحيح معنى .\nوأن من أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا في موضع نصب على حذف حرف الخفض , أي بأن آمنوا .\nوفي الكلام تقديم وتأخير , أي سمعنا مناديا للإيمان ينادي ; عن أبي عبيدة .\nوقيل : اللام بمعنى إلى , أي إلى الإيمان ; كقوله : \" ثم يعودون لما نهوا عنه \" [ المجادلة : 8 ] .\nوقوله : \" بأن ربك أوحى لها \" [ الزلزلة : 5 ] وقوله : \" الحمد لله الذي هدانا لهذا \" [ الأعراف : 43 ] أي إلى هذا , ومثله كثير .\nوقيل : هي لام أجل , أي لأجل الإيمان . رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا تأكيد ومبالغة في الدعاء .\nومعنى اللفظين واحد ; فإن الغفر والكفر : الستر . وَتَوَفَّنَا مَعَ الْأَبْرَارِ أي أبرارا مع الأنبياء , أي في جملتهم .\nواحدهم بر وبار وأصله من الاتساع ; فكأن البر متسع في طاعة الله ومتسعة له رحمة الله .\n                                    ",
        "saadi": "رَّبَّنَآ إِنَّنَا سَمِعۡنَا مُنَادِيٗا يُنَادِي لِلۡإِيمَٰنِ أَنۡ ءَامِنُواْ بِرَبِّكُمۡ فَ‍َٔامَنَّاۚ رَبَّنَا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَكَفِّرۡ عَنَّا سَيِّ‍َٔاتِنَا وَتَوَفَّنَا مَعَ ٱلۡأَبۡرَارِ ٣٩١\n                                        \n                                        \n                                        \n                                        ( ربنا إننا سمعنا مناديا ينادي للإيمان ) وهو محمد صلى الله عليه وسلم، أي: يدعو الناس إليه، ويرغبهم فيه، في أصوله وفروعه.\n( فآمنا ) أي: أجبناه مبادرة، وسارعنا إليه، وفي هذا إخبار منهم بمنة الله عليهم، وتبجح بنعمته، وتوسل إليه بذلك، أن يغفر ذنوبهم ويكفر سيئاتهم، لأن الحسنات يذهبن السيئات، والذي من عليهم بالإيمان، سيمن عليهم بالأمان التام.\n( وتوفنا مع الأبرار ) يتضمن هذا الدعاء التوفيق لفعل الخير، وترك الشر، الذي به يكون العبد من الأبرار، والاستمرار عليه، والثبات إلى الممات.\n\n                                    "
      },
      "originalText": "رَّبَّنَآ إِنَّنَا سَمِعۡنَا مُنَادِيٗا يُنَادِي لِلۡإِيمَٰنِ أَنۡ ءَامِنُواْ بِرَبِّكُمۡ فَ‍َٔامَنَّاۚ رَبَّنَا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَكَفِّرۡ عَنَّا سَيِّ‍َٔاتِنَا وَتَوَفَّنَا مَعَ ٱلۡأَبۡرَارِ ٣٩١"
    },
    {
      "number": 487,
      "text": "رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
      "surah": {
        "number": 3,
        "name": "سورة آل عمران",
        "englishName": "Aal-i-Imraan",
        "englishNameTranslation": "The Family of Imraan",
        "revelationType": "Medinan",
        "numberOfAyahs": 200
      },
      "numberInSurah": 194,
      "juz": 4,
      "manzil": 1,
      "page": 75,
      "ruku": 61,
      "hizbQuarter": 30,
      "sajda": false,
      "tafsier": {
        "ibnkther": "رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخۡزِنَا يَوۡمَ ٱلۡقِيَٰمَةِۖ إِنَّكَ لَا تُخۡلِفُ ٱلۡمِيعَادَ ٤٩١\n                                    \n                                    \n                                    ( ربنا وآتنا ما وعدتنا على رسلك ) قيل : معناه : على الإيمان برسلك . وقيل : معناه : على ألسنة رسلك . وهذا أظهر .\nوقد قال الإمام أحمد : حدثنا أبو اليمان ، حدثنا إسماعيل بن عياش ، عن عمرو بن محمد ، عن أبي عقال ، عن أنس بن مالك ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" عسقلان أحد العروسين ، يبعث الله منها يوم القيامة سبعين ألفا لا حساب عليهم ، ويبعث منها خمسين ألفا شهداء وفودا إلى الله ، وبها صفوف الشهداء ، رءوسهم مقطعة في أيديهم ، تثج أوداجهم دما ، يقولون : ( ربنا وآتنا ما وعدتنا على رسلك ولا تخزنا يوم القيامة إنك لا تخلف الميعاد ) فيقول : صدق عبدي ، اغسلوهم بنهر البيضة . فيخرجون منه نقاء بيضا ، فيسرحون في الجنة حيث شاءوا \" .\nوهذا الحديث يعد من غرائب المسند ، ومنهم من يجعله موضوعا ، والله أعلم .\n( ولا تخزنا يوم القيامة ) أي : على رءوس الخلائق ( إنك لا تخلف الميعاد ) أي : لا بد من الميعاد الذي أخبرت عنه رسلك ، وهو القيام يوم القيامة بين يديك .\nوقد قال الحافظ أبو يعلى : حدثنا الحارث بن سريج حدثنا المعتمر ، حدثنا الفضل بن عيسى ، حدثنا محمد بن المنكدر ، أن جابر بن عبد الله حدثه : أن رسول الله صلى الله عليه وسلم قال : \" العار والتخزية تبلغ من ابن آدم في القيامة في المقام بين يدي الله ، عز وجل ، ما يتمنى العبد أن يؤمر به إلى النار \" حديث غريب .\nوقد ثبت أن رسول الله صلى الله عليه وسلم كان يقرأ هذه الآيات العشر من آخر آل عمران إذا قام من الليل لتهجده ، فقال البخاري ، رحمه الله :\nحدثنا سعيد بن أبي مريم ، حدثنا محمد بن جعفر ، أخبرني شريك بن عبد الله بن أبي نمر ، عن كريب عن ابن عباس قال : بت عند خالتي ميمونة ، فتحدث رسول الله صلى الله عليه وسلم مع أهله ساعة ثم رقد ، فلما كان ثلث الليل الآخر قعد فنظر إلى السماء فقال : ( إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ) ثم قام فتوضأ واستن . فصلى إحدى عشرة ركعة . ثم أذن بلال فصلى ركعتين ، ثم خرج فصلى بالناس الصبح .\nوكذا رواه مسلم عن أبي بكر بن إسحاق الصنعاني ، عن ابن أبي مريم ، به ثم رواه البخاري من طرق عن مالك ، عن مخرمة بن سليمان ، عن كريب ، عن ابن عباس أنه بات عند ميمونة زوج النبي صلى الله عليه وسلم ، وهي خالته ، قال : فاضطجعت في عرض الوسادة ، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها ، فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل - أو قبله بقليل ، أو بعده بقليل - استيقظ رسول الله صلى الله عليه وسلم من منامه ، فجعل يمسح النوم عن وجهه بيده ، ثم قرأ العشر الآيات الخواتيم من سورة آل عمران ، ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام يصلي - قال ابن عباس : فقمت فصنعت مثل ما صنع ، ثم ذهبت فقمت إلى جنبه - فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي ، وأخذ بأذني اليمنى يفتلها فصلى ركعتين ، ثم ركعتين ، ثم ركعتين ، ثم ركعتين ، ثم ركعتين ، ثم ركعتين ثم أوتر ، ثم اضطجع حتى جاءه المؤذن ، فقام فصلى ركعتين خفيفتين ، ثم خرج فصلى الصبح .\nوهكذا أخرجه بقية الجماعة من طرق عن مالك ، به ورواه مسلم أيضا وأبو داود من وجوه أخر ، عن مخرمة بن سليمان ، به .\n\" طريق أخرى \" لهذا الحديث عن ابن عباس [ رضي الله عنهما ] .\nقال أبو بكر بن مردويه : حدثنا محمد بن أحمد بن محمد بن علي ، أخبرنا أبو يحيى بن أبي مسرة أنبأنا خلاد بن يحيى ، أنبأنا يونس بن أبي إسحاق ، عن المنهال بن عمرو ، عن علي بن عبد الله بن عباس ، عن عبد الله بن عباس قال : أمرني العباس أن أبيت بآل رسول الله صلى الله عليه وسلم وأحفظ صلاته . قال : فصلى رسول الله صلى الله عليه وسلم بالناس صلاة العشاء الآخرة ، حتى إذا لم يبق في المسجد أحد غيره قام فمر بي ، فقال : \" من هذا ؟ عبد الله ؟ \" فقلت نعم . قال : \" فمه ؟ \" قلت : أمرني العباس أن أبيت بكم الليلة . قال : \" فالحق الحق \" فلما أن دخل قال : \" افرشن عبد الله ؟ \" فأتى بوسادة من مسوح ، قال فنام رسول الله صلى الله عليه وسلم عليها حتى سمعت غطيطه ، ثم استوى على فراشه قاعدا ، قال : فرفع رأسه إلى السماء فقال : \" سبحان الملك القدوس \" ثلاث مرات ، ثم تلا هذه الآيات من آخر سورة آل عمران حتى ختمها .\nوقد روى مسلم وأبو داود والنسائي ، من حديث علي بن عبد الله بن عباس حديثا في ذلك أيضا .\nطريق أخرى رواها ابن مردويه ، من حديث عاصم بن بهدلة ، عن بعض أصحابه ، عن سعيد بن جبير ، عن ابن عباس ، أن النبي صلى الله عليه وسلم خرج ذات ليلة بعد ما مضى ليل ، فنظر إلى السماء ، وتلا هذه الآية : ( إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ) إلى آخر السورة . ثم قال : \" اللهم اجعل في قلبي نورا ، وفي سمعي نورا ، وفي بصري نورا ، وعن يميني نورا ، وعن شمالي نورا ، ومن بين يدي نورا ، ومن خلفي نورا ، ومن فوقي نورا ، ومن تحتي نورا ، وأعظم لي نورا يوم القيامة \" وهذا الدعاء ثابت في بعض طرق الصحيح ، من رواية كريب ، عن ابن عباس ، رضي الله عنه . .\nثم روى ابن مردويه وابن أبي حاتم من حديث جعفر بن أبي المغيرة ، عن سعيد بن جبير ، عن ابن عباس قال : أتت قريش اليهود فقالوا : بما جاءكم موسى من الآيات ؟ قالوا : عصاه ويده البيضاء للناظرين . وأتوا النصارى فقالوا : كيف كان عيسى فيكم ؟ قالوا : كان يبرئ الأكمه والأبرص ويحيي الموتى . فأتوا النبي صلى الله عليه وسلم فقالوا : ادع لنا ربك يجعل لنا الصفا ذهبا . فدعا ربه ، عز وجل ، فنزلت : ( إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ) قال : \" فليتفكروا فيها \" لفظ ابن مردويه . وقد تقدم سياق الطبراني لهذا الحديث في أول الآية ، وهذا يقتضي أن تكون هذه الآيات مكية ، والمشهور أنها مدنية ، ودليله الحديث الآخر ، قال ابن مردويه :\nحدثنا إسماعيل بن علي بن إسماعيل ، أخبرنا أحمد بن علي الحراني ، حدثنا شجاع بن أشرس ، حدثنا حشرج بن نباتة الواسطي أبو مكرم ، عن الكلبي - هو أبو جناب [ الكلبي ] - عن عطاء قال : انطلقت أنا وابن عمر وعبيد بن عمير إلى عائشة ، رضي الله عنها ، فدخلنا عليها وبيننا وبينها حجاب ، فقالت : يا عبيد ، ما يمنعك من زيارتنا ؟ قال : قول الشاعر :\nزر غبا تزدد حبا\nفقال ابن عمر : ذرينا أخبرينا بأعجب شيء رأيته من رسول الله صلى الله عليه وسلم . فبكت وقالت : كل أمره كان عجبا ، أتاني في ليلتي حتى مس جلده جلدي ، ثم قال : ذريني أتعبد لربي [ عز وجل ] قالت : فقلت : والله إني لأحب قربك ، وإني أحب أن تعبد لربك . فقام إلى القربة فتوضأ ولم يكثر صب الماء ، ثم قام يصلي ، فبكى حتى بل لحيته ، ثم سجد فبكى حتى بل الأرض ، ثم اضطجع على جنبه فبكى ، حتى إذا أتى بلال يؤذنه بصلاة الصبح قالت : فقال : يا رسول الله ، ما يبكيك ؟ وقد غفر الله لك ذنبك ما تقدم وما تأخر ، فقال : \" ويحك يا بلال ، وما يمنعني أن أبكي وقد أنزل علي في هذه الليلة : ( إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ) \" ثم قال : \" ويل لمن قرأها ولم يتفكر فيها \" .\nوقد رواه عبد بن حميد ، عن جعفر بن عون ، عن أبي جناب الكلبي عن عطاء ، بأطول من هذا وأتم سياقا .\nوهكذا رواه أبو حاتم بن حبان في صحيحه ، عن عمران بن موسى ، عن عثمان بن أبي شيبة ، عن يحيى بن زكريا ، عن إبراهيم بن سويد النخعي ، عن عبد الملك بن أبي سليمان ، عن عطاء قال : دخلت أنا [ وعبد الله بن عمر ] وعبيد بن عمير على عائشة فذكر نحوه .\nوهكذا رواه عبد الله بن محمد بن أبي الدنيا في كتاب \" التفكر والاعتبار \" عن شجاع بن أشرص ، به . ثم قال : حدثني الحسن بن عبد العزيز : سمعت سنيدا يذكر عن سفيان - هو الثوري - رفعه قال : من قرأ آخر آل عمران فلم يتفكر فيه ويله . يعد بأصابعه عشرا . قال الحسن بن عبد العزيز : فأخبرني عبيد بن السائب قال : قيل للأوزاعي : ما غاية التفكر فيهن ؟ قال : يقرؤهن وهو يعقلهن .\nقال ابن أبي الدنيا : وحدثني قاسم بن هاشم ، حدثنا علي بن عياش ، حدثنا عبد الرحمن بن سليمان قال : سألت الأوزاعي عن أدنى ما يتعلق به المتعلق من الفكر فيهن وما ينجيه من هذا الويل ؟ فأطرق هنية ثم قال : يقرؤهن وهو يعقلهن .\n[ حديث آخر فيه غرابة : قال أبو بكر بن مردويه : أنبأنا عبد الرحمن بن بشير بن نمير ، أنبأنا إسحاق بن إبراهيم البستي ح وقال : أنبأنا إسحاق بن إبراهيم بن زيد ، حدثنا أحمد بن عمرو قالا أنبأنا هشام بن عمار ، أنبأنا سليمان بن موسى الزهري ، أنبأنا مظاهر بن أسلم المخزومي ، أنبأنا سعيد بن أبي سعيد المقبري عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقرأ عشر آيات من آخر سورة آل عمران كل ليلة . مظاهر بن أسلم ضعيف ] .\n                                    ",
        "qortoby": "رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخۡزِنَا يَوۡمَ ٱلۡقِيَٰمَةِۖ إِنَّكَ لَا تُخۡلِفُ ٱلۡمِيعَادَ ٤٩١\n                                    \n                                    \n                                    رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَى رُسُلِكَ أي على ألسنة رسلك ; مثل \" واسأل القرية \" .\nوقرأ الأعمش والزهري \" رسلك \" بالتخفيف , وهو ما ذكر من استغفار الأنبياء والملائكة للمؤمنين ; والملائكة يستغفرون لمن في الأرض .\nوما ذكر من دعاء نوح للمؤمنين ودعاء إبراهيم واستغفار النبي صلى الله عليه وسلم لأمته . وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ أي لا تعذبنا ولا تهلكنا ولا تفضحنا , ولا تهنا ولا تبعدنا ولا تمقتنا يوم القيامة إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ إن قيل : ما وجه قولهم \" ربنا وآتنا ما وعدتنا على رسلك \" [ آل عمران : 194 ] وقد علموا أنه لا يخلف الميعاد ; فالجواب من ثلاثة أوجه : الأول : أن الله سبحانه وعد من آمن بالجنة , فسألوا أن يكونوا ممن وعد بذلك دون الخزي والعقاب .\nالثاني : أنهم دعوا بهذا الدعاء على جهة العبادة والخضوع ; والدعاء مخ العبادة .\nوهذا كقوله \" قال رب احكم بالحق \" [ الأنبياء : 112 ] وإن كان هو لا يقضي إلا بالحق .\nالثالث : سألوا أن يعطوا ما وعدوا به من النصر على عدوهم معجلا ; لأنها حكاية عن أصحاب النبي صلى الله عليه وسلم , فسألوه ذلك إعزازا للدين .\nوالله أعلم .\nوروى أنس بن مالك أن رسول الله صلى الله عليه وسلم قال : ( من وعده الله عز وجل على عمل ثوابا فهو منجز له رحمة ومن وعده على عمل عقابا فهو فيه بالخيار ) .\nوالعرب تذم بالمخالفة في الوعد وتمدح بذلك في الوعيد ; حتى قال قائلهم : ولا يرهب ابن العم ما عشت صولتي ولا أختفي من خشية المتهدد وإني متى أوعدته أو وعدته لمخلف إيعادي ومنجز موعدي\n                                    ",
        "saadi": "رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخۡزِنَا يَوۡمَ ٱلۡقِيَٰمَةِۖ إِنَّكَ لَا تُخۡلِفُ ٱلۡمِيعَادَ ٤٩١\n                                        \n                                        \n                                        \n                                        ولما ذكروا توفيق الله إياهم للإيمان، وتوسلهم به إلى تمام النعمة، سألوه الثواب على ذلك، وأن ينجز لهم ما وعدهم به على ألسنة رسله من النصر، والظهور في الدنيا، ومن الفوز برضوان الله وجنته في الآخرة، فإنه تعالى لا يخلف الميعاد، فأجاب الله دعاءهم، وقبل تضرعهم، فلهذا قال:\n                                    "
      },
      "originalText": "رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخۡزِنَا يَوۡمَ ٱلۡقِيَٰمَةِۖ إِنَّكَ لَا تُخۡلِفُ ٱلۡمِيعَادَ ٤٩١"
    }
  ]
}