{
  "number": 77,
  "ayahsNumber": 6,
  "ayahs": [
    {
      "number": 494,
      "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً ۚ وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ ۚ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 1,
      "juz": 4,
      "manzil": 1,
      "page": 77,
      "ruku": 62,
      "hizbQuarter": 31,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالٗا كَثِيرٗا وَنِسَآءٗۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِي تَسَآءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَيۡكُمۡ رَقِيبٗا ١\n                                    \n                                    \n                                    قال العوفي عن ابن عباس : نزلت سورة النساء بالمدينة . وكذا روى ابن مردويه عن عبد الله بن الزبير ، وزيد بن ثابت ، وروى من طريق عبد الله بن لهيعة ، عن أخيه عيسى ، عن عكرمة عن ابن عباس قال : لما نزلت سورة النساء قال رسول الله صلى الله عليه وسلم : \" لا حبس \" .\nوقال الحاكم في مستدركه : حدثنا أبو العباس محمد بن يعقوب ، حدثنا أبو البختري عبد الله بن محمد بن شاكر ، حدثنا محمد بن بشر العبدي ، حدثنا مسعر بن كدام ، عن معن بن عبد الرحمن بن عبد الله بن مسعود عن أبيه ، عن عبد الله بن مسعود ، رضي الله عنه ، قال : إن في سورة النساء لخمس آيات ما يسرني أن لي بها الدنيا وما فيها : ( إن الله لا يظلم مثقال ذرة ) الآية ، و ( إن تجتنبوا كبائر ما تنهون عنه ) الآية ، و ( إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء ) و ( ولو أنهم إذ ظلموا أنفسهم جاءوك ) الآية ، و ( ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما ) ثم قال : هذا إسناد صحيح إن كان عبد الرحمن سمع من أبيه ، فقد اختلف في ذلك .\nوقال عبد الرزاق : أخبرنا معمر ، عن رجل ، عن ابن مسعود قال في خمس آيات من النساء : لهن أحب إلي من الدنيا جميعا : ( إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم ) وقوله : ( وإن تك حسنة يضاعفها ) وقوله : ( إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء ) وقوله : ( ومن يعمل سوءا أو يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما ) وقوله : ( والذين آمنوا بالله ورسله ولم يفرقوا بين أحد منهم أولئك سوف يؤتيهم أجورهم وكان الله غفورا رحيما ) رواه ابن جرير : ثم روى من طريق صالح المري ، عن قتادة ، عن ابن عباس قال : ثمان آيات نزلت في سورة النساء هي خير لهذه الأمة مما طلعت عليه الشمس وغربت ، أولاهن : ( يريد الله ليبين لكم ويهديكم سنن الذين من قبلكم ويتوب عليكم والله عليم حكيم ) والثانية : ( والله يريد أن يتوب عليكم ويريد الذين يتبعون الشهوات أن تميلوا ميلا عظيما ) والثالثة : ( يريد الله أن يخفف عنكم وخلق الإنسان ضعيفا ) .\nثم ذكر قول ابن مسعود سواء ، يعني في الخمسة . الباقية .\nوروى الحاكم من طريق أبي نعيم ، عن سفيان بن عيينة ، عن عبيد الله بن أبي يزيد ، عن ابن أبي مليكة ; سمعت ابن عباس يقول : سلوني عن سورة النساء ، فإني قرأت القرآن وأنا صغير . ثم قال : هذا حديث صحيح على شرط الشيخين ، ولم يخرجاه .\nبسم الله الرحمن الرحيم\n( ياأيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء واتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا ( 1 ) )\nيقول تعالى آمرا خلقه بتقواه ، وهي عبادته وحده لا شريك له ، ومنبها لهم على قدرته التي خلقهم بها من نفس واحدة ، وهي آدم ، عليه السلام ( وخلق منها زوجها ) وهي حواء ، عليها السلام ، خلقت من ضلعه الأيسر من خلفه وهو نائم ، فاستيقظ فرآها فأعجبته ، فأنس إليها وأنست إليه .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا محمد بن مقاتل ، حدثنا وكيع ، عن أبي هلال ، عن قتادة ، عن ابن عباس قال : خلقت المرأة من الرجل ، فجعل نهمتها في الرجل ، وخلق الرجل من الأرض ، فجعل نهمته في الأرض ، فاحبسوا نساءكم .\nوفي الحديث الصحيح : \" إن المرأة خلقت من ضلع ، وإن أعوج شيء في الضلع أعلاه ، فإن ذهبت تقيمه كسرته ، وإن استمتعت بها استمتعت بها وفيها عوج \" .\nوقوله : ( وبث منهما رجالا كثيرا ونساء ) أي : وذرأ منهما ، أي : من آدم وحواء رجالا كثيرا ونساء ، ونشرهم في أقطار العالم على اختلاف أصنافهم وصفاتهم وألوانهم ولغاتهم ، ثم إليه بعد ذلك المعاد والمحشر .\nثم قال تعالى : ( واتقوا الله الذي تساءلون به والأرحام ) أي : واتقوا الله بطاعتكم إياه ، قال إبراهيم ومجاهد والحسن : ( الذي تساءلون به ) أي : كما يقال : أسألك بالله وبالرحم . وقال الضحاك : واتقوا الله الذي به تعاقدون وتعاهدون ، واتقوا الأرحام أن تقطعوها ، ولكن بروها وصلوها ، قاله ابن عباس ، ومجاهد ، وعكرمة ، والحسن ، والضحاك ، والربيع وغير واحد .\nوقرأ بعضهم : ( والأرحام ) بالخفض على العطف على الضمير في به ، أي : تساءلون بالله وبالأرحام ، كما قال مجاهد وغيره .\nوقوله : ( إن الله كان عليكم رقيبا ) أي : هو مراقب لجميع أعمالكم وأحوالكم كما قال : ( والله على كل شيء شهيد ) [ البروج : 9 ] .\nوفي الحديث الصحيح : \" اعبد الله كأنك تراه ، فإن لم تكن تراه فإنه يراك \" وهذا إرشاد وأمر بمراقبة الرقيب ; ولهذا ذكر تعالى أن أصل الخلق من أب [ واحد ] وأم واحدة; ليعطف بعضهم على بعض ، ويحننهم على ضعفائهم ، وقد ثبت في صحيح مسلم ، من حديث جرير بن عبد الله البجلي; أن رسول الله صلى الله عليه وسلم حين قدم عليه أولئك النفر من مضر - وهم مجتابو النمار - أي من عريهم وفقرهم - قام فخطب الناس بعد صلاة الظهر فقال في خطبته : ( ياأيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة ) حتى ختم الآية وقال : ( يا أيها الذين آمنوا اتقوا الله ولتنظر نفس ما قدمت لغد [ واتقوا الله ] ) [ الحشر : 18 ] ثم حضهم على الصدقة فقال : \" تصدق رجل من ديناره ، من درهمه ، من صاع بره ، صاع تمره . . . \" وذكر تمام الحديث .\nوهكذا رواه الإمام أحمد وأهل السنن عن ابن مسعود في خطبة الحاجة وفيها ثم يقرأ ثلاث آيات هذه منها : ( يا أيها الناس اتقوا ربكم [ الذي خلقكم من نفس واحدة ] ) الآية .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالٗا كَثِيرٗا وَنِسَآءٗۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِي تَسَآءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَيۡكُمۡ رَقِيبٗا ١\n                                    \n                                    \n                                    سورة النساء\nوهي مدنية إلا آية واحدة نزلت بمكة عام الفتح في عثمان بن طلحة الحجبي وهي قوله : إن الله يأمركم أن تؤدوا الأمانات إلى أهلها على ما يأتي بيانه . قال النقاش : وقيل : نزلت عند هجرة النبي صلى الله عليه وسلم من مكة إلى المدينة . وقد قال بعض الناس : إن قوله تعالى : يا أيها الناس حيث وقع إنما هو مكي ، وقاله علقمة وغيره ، فيشبه أن يكون صدر السورة مكيا ، وما نزل بعد الهجرة فإنما هو مدني . وقال النحاس : هذه السورة مكية .\nقلت : والصحيح الأول ، فإن في صحيح البخاري عن عائشة أنها قالت : ما نزلت سورة النساء إلا وأنا عند رسول الله صلى الله عليه وسلم ؛ تعني قد بنى بها . ولا خلاف بين العلماء أن النبي صلى الله عليه وسلم إنما بنى بعائشة بالمدينة . ومن تبين أحكامها علم أنها مدنية لا شك فيها . وأما من قال : إن قوله : يا أيها الناس مكي حيث وقع فليس بصحيح ؛ فإن البقرة مدنية وفيها قوله ، يا أيها الناس في موضعين ، وقد تقدم . والله أعلم\nقوله يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء واتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا\nفيه ست مسائل :\nالأولى : قوله تعالى : يا أيها الناس اتقوا ربكم الذي خلقكم قد مضى في \" البقرة \" اشتقاق الناس ومعنى التقوى والرب والخلق والزوج والبث ، فلا معنى للإعادة . وفي الآية تنبيه على الصانع . وقال : \" واحدة \" على تأنيث لفظ النفس . ولفظ النفس يؤنث وإن عني به مذكر . ويجوز في الكلام \" من نفس واحد \" وهذا على مراعاة المعنى ؛ إذ المراد بالنفس آدم عليه السلام ، قاله مجاهد وقتادة . وهي قراءة ابن أبي عبلة \" واحد \" بغير هاء . وبث : فرق ونشر في الأرض ؛ ومنه وزرابي مبثوثة وقد تقدم في \" البقرة \" .\nومنهما يعني آدم وحواء . قال مجاهد : خلقت حواء من قصيرى آدم . وفي الحديث : خلقت المرأة من ضلع عوجاء ، وقد مضى في البقرة . رجالا كثيرا ونساء حصر ذريتهما في نوعين ؛ فاقتضى أن الخنثى ليس بنوع ، لكن له حقيقة ترده إلى هذين النوعين وهي الآدمية فيلحق بأحدهما ، على ما تقدم ذكره في \" البقرة \" من اعتبار نقص الأعضاء وزيادتها .\nالثانية : قوله تعالى واتقوا الله الذي تساءلون به والأرحام كرر الاتقاء تأكيدا وتنبيها لنفوس المأمورين . والذي في موضع نصب على النعت . والأرحام معطوف . أي اتقوا الله أن تعصوه ، واتقوا الأرحام أن تقطعوها . وقرأ أهل المدينة \" تساءلون \" بإدغام التاء في السين . وأهل الكوفة بحذف التاء ، لاجتماع تاءين ، وتخفيف السين ؛ لأن المعنى يعرف ؛ وهو كقوله : ولا تعاونوا على الإثم وتنزل وشبهه .\nوقرأ إبراهيم النخعي وقتادة والأعمش وحمزة \" الأرحام \" بالخفض .\nوقد تكلم النحويون في ذلك . فأما البصريون فقال رؤساؤهم : هو لحن لا تحل القراءة به . وأما الكوفيون فقالوا : هو قبيح ؛ ولم يزيدوا على هذا ولم يذكروا علة قبحه ؛ قال النحاس : فيما علمت .\nوقال سيبويه : لم يعطف على المضمر المخفوض ؛ لأنه بمنزلة التنوين ، والتنوين لا يعطف عليه . وقال جماعة : هو معطوف على المكني ؛ فإنهم كانوا يتساءلون بها ، يقول الرجل : سألتك بالله والرحم ؛ هكذا فسره الحسن والنخعي ومجاهد ، وهو الصحيح في المسألة ، على ما يأتي . وضعفه أقوام منهم الزجاج ، وقالوا : يقبح عطف الاسم الظاهر على المضمر في الخفض إلا بإظهار الخافض ؛ كقوله فخسفنا به وبداره الأرض ويقبح \" مررت به وزيد \" . قال الزجاج : عن المازني : لأن المعطوف والمعطوف عليه شريكان ، يحل كل واحد منهما محل صاحبه ؛ فكما لا يجوز \" مررت بزيد وك \" كذلك لا يجوز \" مررت بك وزيد \" . وأما سيبويه فهي عنده قبيحة ولا تجوز إلا في الشعر ؛ كما قال :\nفاليوم قربت تهجونا وتشتمنا فاذهب فما بك والأيام من عجب\nعطف \" الأيام \" على الكاف في \" بك \" بغير الباء للضرورة . وكذلك قول الآخر :\nنعلق في مثل السواري سيوفنا وما بينها والكعب مهوى نفانف\nعطف \" الكعب \" على الضمير في \" بينها \" ضرورة . وقال أبو علي : ذلك ضعيف في القياس . وفي كتاب التذكرة المهدية عن الفارسي أن أبا العباس المبرد قال : لو صليت خلف إمام يقرأ ما أنتم بمصرخي و اتقوا الله الذي تساءلون به والأرحام لأخذت نعلي ومضيت . قال الزجاج : قراءة حمزة مع ضعفها وقبحها في العربية خطأ عظيم في أصول أمر الدين ؛ لأن النبي صلى الله عليه وسلم قال : لا تحلفوا بآبائكم فإذا لم يجز الحلف بغير الله فكيف يجوز بالرحم . ورأيت إسماعيل بن إسحاق يذهب إلى أن الحلف بغير الله أمر عظيم ، وأنه خاص لله تعالى . قال النحاس : وقول بعضهم \" والأرحام \" قسم خطأ من المعنى والإعراب ؛ لأن الحديث عن النبي صلى الله عليه وسلم يدل على النصب . وروى شعبة عن عون بن أبي جحيفة ، عن المنذر بن جرير ، عن أبيه قال : كنا عند النبي صلى الله عليه وسلم حتى جاء قوم من مضر حفاة عراة ، فرأيت وجه رسول الله صلى الله عليه وسلم يتغير لما رأى من فاقتهم ؛ ثم صلى الظهر وخطب الناس فقال : يا أيها الناس اتقوا ربكم ، إلى : والأرحام ؛ ثم قال : تصدق رجل بديناره تصدق رجل بدرهمه تصدق رجل بصاع تمره . . . وذكر الحديث . فمعنى هذا على النصب ؛ لأنه حضهم على صلة أرحامهم . وأيضا فقد صح عن النبي صلى الله عليه وسلم من كان حالفا فليحلف بالله أو ليصمت . فهذا يرد قول من قال : المعنى أسألك بالله وبالرحم . وقد قال أبو إسحاق : معنى تساءلون به يعني تطلبون حقوقكم به . ولا معنى للخفض أيضا مع هذا .\nقلت : هذا ما وقفت عليه من القول لعلماء اللسان في منع قراءة \" والأرحام \" بالخفض ، واختاره ابن عطية . ورده الإمام أبو نصر عبد الرحيم بن عبد الكريم القشيري ، واختار العطف فقال : ومثل هذا الكلام مردود عند أئمة الدين ؛ لأن القراءات التي قرأ بها أئمة القراء ثبتت عن النبي صلى الله عليه وسلم تواترا يعرفه أهل الصنعة ، وإذا ثبت شيء عن النبي صلى الله عليه وسلم فمن رد ذلك فقد رد على النبي صلى الله عليه وسلم ، واستقبح ما قرأ به ، وهذا مقام محذور ، ولا يقلد فيه أئمة اللغة والنحو ؛ فإن العربية تتلقى من النبي صلى الله عليه وسلم ، ولا يشك أحد في فصاحته . وأما ما ذكر من الحديث ففيه نظر ؛ لأنه عليه السلام قال لأبي العشراء : وأبيك لو طعنت في خاصرته . ثم النهي إنما جاء في الحلف بغير الله ، وهذا توسل إلى الغير بحق الرحم فلا نهي فيه . قال القشيري : وقد قيل هذا إقسام بالرحم ، أي اتقوا الله وحق الرحم ؛ كما تقول : افعل كذا وحق أبيك . وقد جاء في التنزيل : والنجم ، والطور ، والتين ، لعمرك وهذا تكلف\nقلت : لا تكلف فيه فإنه لا يبعد أن يكون \" والأرحام \" من هذا القبيل ، فيكون أقسم بها كما أقسم بمخلوقاته الدالة على وحدانيته وقدرته تأكيدا لها حتى قرنها بنفسه . والله أعلم .\nولله أن يقسم بما شاء ويمنع ما شاء ويبيح ما شاء ، فلا يبعد أن يكون قسما . والعرب تقسم بالرحم . ويصح أن تكون الباء مرادة فحذفها كما حذفها في قوله :\nمشائيم ليسوا مصلحين عشيرة ولا ناعب إلا ببين غرابها\nفجر وإن لم يتقدم باء . قال ابن الدهان أبو محمد سعيد بن مبارك : والكوفي يجيز عطف الظاهر على المجرور ولا يمنع منه . ومنه قوله :\nآبك أيه بي أو مصدر من حمر الجلة جأب حشور\nومنه :\nفاذهب فما بك والأيام من عجب\nوقول الآخر :\nوما بينها والكعب غوط نفانف\nومنه :\nفحسبك والضحاك سيف مهند\nوقول الآخر :\nوقد رام آفاق السماء فلم يجد له مصعدا فيها ولا الأرض مقعدا\nوقول الآخر :\nما إن بها والأمور من تلف ما حم من أمر غيبه وقعا\nوقول الآخر :\nأمر على الكتيبة لست أدري أحتفي كان فيها أم سواها\nف \" سواها \" مجرور الموضع بفي . وعلى هذا حمل بعضهم قوله تعالى : وجعلنا لكم فيها معايش ومن لستم له برازقين فعطف على الكاف والميم . وقرأ عبد الله بن يزيد \" والأرحام \" بالرفع على الابتداء ، والخبر مقدر ، تقديره : والأرحام أهل أن توصل . ويحتمل أن يكون إغراء ؛ لأن من العرب من يرفع المغرى . وأنشد الفراء :\nإن قوما منهم عمير وأشبا ه عمير ومنهم السفاح\nلجديرون باللقاء إذا قا ل أخو النجدة السلاح السلاح\nوقد قيل : إن \" والأرحام \" بالنصب عطف على موضع به ؛ لأن موضعه نصب ، ومنه قوله :\nفلسنا بالجبال ولا الحديدا\nوكانوا يقولون : أنشدك بالله والرحم . والأظهر أنه نصب بإضمار فعل كما ذكرنا .\nالثالثة : اتفقت الملة على أن صلة الرحم واجبة وأن قطيعتها محرمة . وقد صح أن النبي صلى الله عليه وسلم قال لأسماء وقد سألته أأصل أمي ؟ نعم صلي أمك فأمرها بصلتها وهي كافرة .\nفلتأكيدها دخل الفضل في صلة الكافر ، حتى انتهى الحال بأبي حنيفة وأصحابه فقالوا بتوارث ذوي الأرحام إن لم يكن عصبة ولا فرض مسمى ، ويعتقون على من اشتراهم من ذوي رحمهم لحرمة الرحم ؛ وعضدوا ذلك بما رواه أبو داود أن النبي صلى الله عليه وسلم قال : من ملك ذا رحم محرم فهو حر . وهو قول أكثر أهل العلم . روي ذلك عن عمر بن الخطاب رضي الله عنه وعبد الله بن مسعود ، ولا يعرف لهما مخالف من الصحابة . وهو قول الحسن البصري وجابر بن زيد وعطاء والشعبي والزهري ، وإليه ذهب الثوري وأحمد وإسحاق . ولعلمائنا في ذلك ثلاثة أقوال : الأول - أنه مخصوص بالآباء والأجداد .\nالثاني - الجناحان يعني الإخوة .\nالثالث - كقول أبي حنيفة .\nوقال الشافعي : لا يعتق عليه إلا أولاده وآباؤه وأمهاته ، ولا يعتق عليه إخوته ولا أحد من ذوي قرابته ولحمته .\nوالصحيح الأول للحديث الذي ذكرناه وأخرجه الترمذي والنسائي . وأحسن طرقه رواية النسائي له ؛ رواه من حديث ضمرة ، عن سفيان ، عن عبد الله بن دينار ، عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : من ملك ذا رحم محرم فقد عتق عليه . وهو حديث ثابت بنقل العدل عن العدل ولم يقدح فيه أحد من الأئمة بعلة توجب تركه ؛ غير أن النسائي قال في آخره : هذا حديث منكر . وقال غيره : تفرد به ضمرة . وهذا هو معنى المنكر والشاذ في اصطلاح المحدثين . وضمرة عدل ثقة ، وانفراد الثقة بالحديث لا يضره . والله أعلم .\nالرابعة : واختلفوا من هذا الباب في ذوي المحارم من الرضاعة . فقال أكثر أهل العلم لا يدخلون في مقتضى الحديث . وقال شريك القاضي بعتقهم . وذهب أهل الظاهر وبعض المتكلمين إلى أن الأب لا يعتق على الابن إذا ملكه ؛ واحتجوا بقوله عليه السلام : لا يجزي ولد والدا إلا أن يجده مملوكا فيشتريه فيعتقه . قالوا : فإذا صح الشراء فقد ثبت الملك ، ولصاحب الملك التصرف . وهذا جهل منهم بمقاصد الشرع ؛ فإن الله تعالى يقول : وبالوالدين إحسانا فقد قرن بين عبادته وبين الإحسان للوالدين في الوجوب ، وليس من الإحسان أن يبقى والده في ملكه وتحت سلطانه ؛ فإذا يجب عليه عتقه إما لأجل الملك عملا بالحديث فيشتريه فيعتقه ، أو لأجل الإحسان عملا بالآية . ومعنى الحديث عند الجمهور أن الولد لما تسبب إلى عتق أبيه باشترائه نسب الشرع العتق إليه نسبة الإيقاع منه . وأما اختلاف العلماء فيمن يعتق بالملك ، فوجه القول الأول ما ذكرناه من معنى الكتاب والسنة ، ووجه الثاني إلحاق القرابة القريبة المحرمة بالأب المذكور في الحديث ، ولا أقرب للرجل من ابنه فيحمل على الأب ، والأخ يقاربه في ذلك لأنه يدلي بالأبوة ؛ فإنه يقول : أنا ابن أبيه . وأما القول الثالث فمتعلقه حديث ضمرة وقد ذكرناه . والله أعلم .\nالخامسة : قوله تعالى : والأرحام الرحم اسم لكافة الأقارب من غير فرق بين المحرم وغيره . وأبو حنيفة يعتبر الرحم المحرم في منع الرجوع في الهبة ، ويجوز الرجوع في حق بني الأعمام مع أن القطيعة موجودة والقرابة حاصلة ؛ ولذلك تعلق بها الإرث والولاية وغيرهما من الأحكام . فاعتبار المحرم زيادة على نص الكتاب من غير مستند . وهم يرون ذلك نسخا ، سيما وفيه إشارة إلى التعليل بالقطيعة ، وقد جوزوها في حق بني الأعمام وبني الأخوال والخالات . والله أعلم .\nالسادسة : قوله تعالى : إن الله كان عليكم رقيبا أي حفيظا ؛ عن ابن عباس ومجاهد . ابن زيد : عليما . وقيل : رقيبا حافظا ؛ قيل : بمعنى فاعل . فالرقيب من صفات الله تعالى ، والرقيب : الحافظ والمنتظر ؛ تقول رقبت أرقب رقبة ورقبانا إذا انتظرت . والمرقب : المكان العالي المشرف ، يقف عليه الرقيب . والرقيب : السهم الثالث من السبعة التي لها أنصباء . ويقال : إن الرقيب ضرب من الحيات ، فهو لفظ مشترك . والله أعلم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالٗا كَثِيرٗا وَنِسَآءٗۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِي تَسَآءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَيۡكُمۡ رَقِيبٗا ١\n                                        \n                                        \n                                        \n                                        افتتح تعالى هذه السورة بالأمر بتقواه، والحث على عبادته، والأمر بصلة الأرحام، والحث على ذلك. وبيَّن السبب الداعي الموجب لكل من ذلك، وأن الموجب لتقواه لأنه { رَبَّكُمُ الَّذِي خَلَقَكُمْ } ورزقكم، ورباكم بنعمه العظيمة، التي من جملتها خلقكم { مِن نَّفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا } ليناسبها، فيسكن إليها، وتتم بذلك النعمة، ويحصل به السرور، وكذلك من الموجب الداعي لتقواه تساؤلكم به وتعظيمكم، حتى إنكم إذا أردتم قضاء حاجاتكم ومآربكم، توسلتم بـها بالسؤال بالله. فيقول من يريد ذلك لغيره: أسألك بالله أن تفعل الأمر الفلاني؛ لعلمه بما قام في قلبه من تعظيم الله الداعي أن لا يرد من سأله بالله، فكما عظمتموه بذلك فلتعظموه بعبادته وتقواه. وكذلك الإخبار بأنه رقيب، أي: مطلع على العباد في حال حركاتـهم وسكونـهم، وسرهم وعلنهم، وجميع أحوالهم، مراقبا لهم فيها مما يوجب مراقبته، وشدة الحياء منه، بلزوم تقواه. وفي الإخبار بأنه خلقهم من نفس واحدة، وأنه بثهم في أقطار الأرض، مع رجوعهم إلى أصل واحد -ليعطف بعضهم على بعض، ويرقق بعضهم على بعض. وقرن الأمر بتقواه بالأمر ببر الأرحام والنهي عن قطيعتها، ليؤكد هذا الحق، وأنه كما يلزم القيام بحق الله، كذلك يجب القيام بحقوق الخلق، خصوصا الأقربين منهم، بل القيام بحقوقهم هو من حق الله الذي أمر به. وتأمل كيف افتتح هذه السورة بالأمر بالتقوى، وصلة الأرحام والأزواج عموما، ثم بعد ذلك فصل هذه الأمور أتم تفصيل، من أول السورة إلى آخرها. فكأنـها مبنية على هذه الأمور المذكورة، مفصلة لما أجمل منها، موضحة لما أبهم. وفي قوله: { وخلق مِنْهَا زَوْجَهَا } تنبيه على مراعاة حق الأزواج والزوجات والقيام به، لكون الزوجات مخلوقات من الأزواج، فبينهم وبينهن أقرب نسب وأشد اتصال، وأقرب علاقة.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالٗا كَثِيرٗا وَنِسَآءٗۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِي تَسَآءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَيۡكُمۡ رَقِيبٗا ١"
    },
    {
      "number": 495,
      "text": "وَآتُوا الْيَتَامَىٰ أَمْوَالَهُمْ ۖ وَلَا تَتَبَدَّلُوا الْخَبِيثَ بِالطَّيِّبِ ۖ وَلَا تَأْكُلُوا أَمْوَالَهُمْ إِلَىٰ أَمْوَالِكُمْ ۚ إِنَّهُ كَانَ حُوبًا كَبِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 2,
      "juz": 4,
      "manzil": 1,
      "page": 77,
      "ruku": 62,
      "hizbQuarter": 31,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَءَاتُواْ ٱلۡيَتَٰمَىٰٓ أَمۡوَٰلَهُمۡۖ وَلَا تَتَبَدَّلُواْ ٱلۡخَبِيثَ بِٱلطَّيِّبِۖ وَلَا تَأۡكُلُوٓاْ أَمۡوَٰلَهُمۡ إِلَىٰٓ أَمۡوَٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبٗا كَبِيرٗا ٢\n                                    \n                                    \n                                    يأمر تعالى بدفع أموال اليتامى إليهم إذا بلغوا الحلم كاملة موفرة ، وينهى عن أكلها وضمها إلى أموالهم; ولهذا قال : ( ولا تتبدلوا الخبيث بالطيب ) قال سفيان الثوري ، عن أبي صالح : لا تعجل بالرزق الحرام قبل أن يأتيك الرزق الحلال الذي قدر لك .\nوقال سعيد بن جبير : لا تبدلوا الحرام من أموال الناس بالحلال من أموالكم ، يقول : لا تبذروا أموالكم الحلال وتأكلوا أموالهم الحرام .\nوقال سعيد بن المسيب والزهري : لا تعط مهزولا وتأخذ سمينا .\nوقال إبراهيم النخعي والضحاك : لا تعط زائفا وتأخذ جيدا .\nوقال السدي : كان أحدهم يأخذ الشاة السمينة من غنم اليتيم ، ويجعل فيها مكانها الشاة المهزولة ، ويقول شاة بشاة ، ويأخذ الدرهم الجيد ويطرح مكانه الزيف ، ويقول : درهم بدرهم .\nوقوله : ( ولا تأكلوا أموالهم إلى أموالكم ) قال مجاهد ، وسعيد بن جبير ، ومقاتل بن حيان ، والسدي ، وسفيان بن حسين : أي لا تخلطوها فتأكلوها جميعا .\nوقوله : ( إنه كان حوبا كبيرا ) قال ابن عباس : أي إثما كبيرا عظيما .\nوقد رواه ابن مردويه ، عن أبي هريرة قال : سئل رسول الله صلى الله عليه وسلم عن قوله : ( حوبا كبيرا ) قال : \" إثما كبيرا \" . ولكن في إسناده محمد بن يونس الكديمي وهو ضعيف وهكذا روي عن مجاهد ، وعكرمة ، وسعيد بن جبير ، والحسن ، وابن سيرين ، وقتادة ، والضحاك ، ومقاتل بن حيان ، وأبي مالك ، وزيد بن أسلم ، وأبي سنان مثل قول ابن عباس .\nوفي الحديث المروي في سنن أبي داود : \" اغفر لنا حوبنا وخطايانا \" .\nوروى ابن مردويه بإسناده إلى واصل ، مولى أبي عيينة ، عن محمد بن سيرين ، عن ابن عباس : أن أبا أيوب طلق امرأته ، فقال له النبي صلى الله عليه وسلم : \" يا أبا أيوب ، إن طلاق أم أيوب كان حوبا \" قال ابن سيرين : الحوب الإثم .\nثم قال ابن مردويه : حدثنا عبد الباقي ، حدثنا بشر بن موسى ، أخبرنا هوذة بن خليفة ، أخبرنا عوف ، عن أنس : أن أبا أيوب أراد طلاق أم أيوب ، فاستأذن رسول الله صلى الله عليه وسلم فقال : \" إن طلاق أم أيوب لحوب فأمسكها \" ثم رواه ابن مردويه والحاكم في مستدركه من حديث علي بن عاصم ، عن حميد الطويل ، سمعت أنس بن مالك يقول : أراد أبو طلحة أن يطلق أم سليم فقال النبي صلى الله عليه وسلم : \" إن طلاق أم سليم لحوب \" فكف .\nوالمعنى : إن أكلكم أموالهم مع أموالكم إثم عظيم وخطأ كبير فاجتنبوه .\n                                    ",
        "qortoby": "وَءَاتُواْ ٱلۡيَتَٰمَىٰٓ أَمۡوَٰلَهُمۡۖ وَلَا تَتَبَدَّلُواْ ٱلۡخَبِيثَ بِٱلطَّيِّبِۖ وَلَا تَأۡكُلُوٓاْ أَمۡوَٰلَهُمۡ إِلَىٰٓ أَمۡوَٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبٗا كَبِيرٗا ٢\n                                    \n                                    \n                                    قوله تعالى : وآتوا اليتامى أموالهم ولا تتبدلوا الخبيث بالطيب ولا تأكلوا أموالهم إلى أموالكم إنه كان حوبا كبيرا\nفيه خمس مسائل :\nالأولى قوله تعالى : وآتوا اليتامى أموالهم وأراد باليتامى الذين كانوا أيتاما ؛ كقوله : وألقي السحرة ساجدين ولا سحر مع السجود ، فكذلك لا يتم مع البلوغ . وكان يقال للنبي صلى الله عليه وسلم : \" يتيم أبي طالب \" استصحابا لما كان . وآتوا أي أعطوا . والإيتاء الإعطاء . ولفلان أتو ، أي عطاء . أبو زيد : أتوت الرجل آتوه إتاوة ، وهي الرشوة . واليتيم من لم يبلغ الحلم ، وقد تقدم في \" البقرة \" مستوفى . وهذه الآية خطاب للأولياء والأوصياء . نزلت - في قول مقاتل والكلبي - في رجل من غطفان كان معه مال كثير لابن أخ له يتيم ، فلما بلغ اليتيم طلب المال فمنعه عمه ؛ فنزلت ، فقال العم : نعوذ بالله من الحوب الكبير ! ورد المال . فقال النبي صلى الله عليه وسلم : من يوق شح نفسه ورجع به هكذا فإنه يحل داره يعني جنته . فلما قبض الفتى المال أنفقه في سبيل الله ، فقال عليه السلام : ثبت الأجر وبقي الوزر . فقيل : كيف يا رسول الله ؟ فقال : ثبت الأجر للغلام وبقي الوزر على والده لأنه كان مشركا .\nالثانية : وإيتاء اليتامى أموالهم يكون بوجهين :\nأحدهما - إجراء الطعام والكسوة ما دامت الولاية ؛ إذ لا يمكن إلا ذلك لمن لا يستحق الأخذ الكلي والاستبداد كالصغير والسفيه الكبير .\nالثاني - الإيتاء بالتمكن وإسلام المال إليه ، وذلك عند الابتلاء والإرشاد ، وتكون تسميته مجازا ، المعنى : الذي كان يتيما ، وهو استصحاب الاسم ؛ كقوله تعالى : وألقي السحرة ساجدين أي الذين كانوا سحرة . وكان يقال للنبي صلى الله عليه وسلم : \" يتيم أبي طالب \" . فإذا تحقق الولي رشده حرم عليه إمساك ماله عنه وكان عاصيا . وقال أبو حنيفة : إذا بلغ خمسا وعشرين سنة أعطي ماله كله على كل حال ، لأنه يصير جدا .\nقلت : لما لم يذكر الله تعالى في هذه الآية إيناس الرشد وذكره في قوله تعالى : وابتلوا اليتامى حتى إذا بلغوا النكاح فإن آنستم منهم رشدا فادفعوا إليهم أموالهم . قال أبو بكر الرازي الحنفي في أحكام القرآن : لما لم يقيد الرشد في موضع وقيد في موضع وجب استعمالهما ، فأقول : إذا بلغ خمسا وعشرين سنة وهو سفيه لم يؤنس منه الرشد ، وجب دفع المال إليه ، وإن كان دون ذلك لم يجب ، عملا بالآيتين . وقال أبو حنيفة : لما بلغ أشده صار يصلح أن يكون جدا فإذا صار يصلح أن يكون جدا فكيف يصح إعطاؤه المال بعلة اليتم وباسم اليتيم ؟ ! وهل ذلك إلا في غاية البعد ؟ . قال ابن العربي : وهذا باطل لا وجه له ؛ لا سيما على أصله الذي يرى المقدرات لا تثبت قياسا وإنما تؤخذ من جهة النص ، وليس في هذه المسألة . وسيأتي ما للعلماء في الحجر إن شاء الله تعالى .\nالثالثة : قوله تعالى : ولا تتبدلوا الخبيث بالطيب أي لا تتبدلوا الشاة السمينة من مال اليتيم بالهزيلة ، ولا الدرهم الطيب بالزيف . وكانوا في الجاهلية لعدم الدين لا يتحرجون عن أموال اليتامى ، فكانوا يأخذون الطيب والجيد من أموال اليتامى ويبدلونه بالرديء من أموالهم ؛ ويقولون : اسم باسم ورأس برأس ؛ فنهاهم الله عن ذلك . هذا قول سعيد بن المسيب والزهري والسدي والضحاك وهو ظاهر الآية . وقيل : المعنى لا تأكلوا أموال اليتامى وهي محرمة خبيثة وتدعوا الطيب وهو مالكم . وقالمجاهد وأبو صالح وباذان : لا تتعجلوا أكل الخبيث من أموالهم وتدعوا انتظار الرزق الحلال من عند الله . وقال ابن زيد : كان أهل الجاهلية لا يورثون النساء والصبيان ويأخذ الأكبر الميراث . عطاء : لا تربح على يتيمك الذي عندك وهو غر صغير . وهذان القولان خارجان عن ظاهر الآية ؛ فإنه يقال : تبدل الشيء بالشيء أي أخذه مكانه . ومنه البدل .\nالرابعة : قوله تعالى : ولا تأكلوا أموالهم إلى أموالكم قال مجاهد : وهذه الآية ناهية عن الخلط في الإنفاق ؛ فإن العرب كانت تخلط نفقتها بنفقة أيتامها فنهوا عن ذلك ، ثم نسخ بقوله وإن تخالطوهم فإخوانكم . وقال ابن فورك ، عن الحسن : تأول الناس في هذه الآية النهي عن الخلط فاجتنبوه من قبل أنفسهم ، فخفف عنهم في آية البقرة . وقالت طائفة من المتأخرين : إن إلى بمعنى مع ، كقوله تعالى : من أنصاري إلى الله . وأنشد القتبي :\nيسدون أبواب القباب بضمر إلى عنن مستوثقات الأواصر\nوليس بجيد . وقال الحذاق : إلى على بابها وهي تتضمن الإضافة ، أي لا تضيفوا أموالهم وتضموها إلى أموالكم في الأكل . فنهوا أن يعتقدوا أموال اليتامى كأموالهم فيتسلطوا عليها بالأكل والانتفاع .\nالخامسة : قوله تعالى : إنه كان حوبا كبيرا \" إنه \" أي الأكل كان حوبا كبيرا أي إثما كبيرا ؛ عن ابن عباس والحسن وغيرهما . يقال : حاب الرجل يحوب حوبا إذا أثم . وأصله الزجر للإبل ؛ فسمي الإثم حوبا ؛ لأنه يزجر عنه وبه . ويقال في الدعاء : اللهم اغفر حوبتي ؛ أي إثمي . والحوبة أيضا الحاجة . ومنه في الدعاء : إليك أرفع حوبتي ؛ أي حاجتي . والحوب الوحشة ؛ ومنه قوله عليه السلام لأبي أيوب : إن طلاق أم أيوب لحوب . وفيه ثلاث لغات \" حوبا \" بضم الحاء وهي قراءة العامة ولغة أهل الحجاز . وقرأ الحسن \" حوبا \" بفتح الحاء . وقال الأخفش : وهي لغة تميم . مقاتل : لغة الحبش .\nوالحوب المصدر ، وكذلك الحيابة . والحوب الاسم . وقرأ أبي بن كعب \" حابا \" على المصدر مثل القال . ويجوز أن يكون اسما مثل الزاد . والحوأب ( بهمزة بعد الواو ) . المكان الواسع . والحوأب ماء أيضا . ويقال : ألحق الله به الحوبة أي المسكنة والحاجة ؛ ومنه قولهم : بات بحيبة سوء . وأصل الياء الواو . وتحوب فلان أي تعبد وألقى الحوب عن نفسه . والتحوب أيضا التحزن . وهو أيضا الصياح الشديد ؛ كالزجر ، وفلان يتحوب من كذا أي يتوجع وقال طفيل :\nفذوقوا كما ذقنا غداة محجر من الغيظ في أكبادنا والتحوب\n                                    ",
        "saadi": "وَءَاتُواْ ٱلۡيَتَٰمَىٰٓ أَمۡوَٰلَهُمۡۖ وَلَا تَتَبَدَّلُواْ ٱلۡخَبِيثَ بِٱلطَّيِّبِۖ وَلَا تَأۡكُلُوٓاْ أَمۡوَٰلَهُمۡ إِلَىٰٓ أَمۡوَٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبٗا كَبِيرٗا ٢\n                                        \n                                        \n                                        \n                                        وقوله تعالى: { وَآتُوا الْيَتَامَى أَمْوَالَهُمْ ولا تتبدلوا الخبيث بالطيب ولا تأكلوا أموالهم إلى أموالكم إنه كان حوبا كبيرا } هذا أول ما أوصى به من حقوق الخلق في هذه السورة. وهم اليتامى الذين فقدوا آباءهم الكافلين لهم، وهم صغار ضعاف لا يقومون بمصالحهم. فأمر الرءوف الرحيم عباده أن يحسنوا إليهم، وأن لا يقربوا أموالهم إلا بالتي هي أحسن، وأن يؤتوهم أموالهم إذا بلغوا ورشدوا، كاملة موفرة، وأن لا { تَتَبَدَّلُوا الْخَبِيثَ } الذي هو أكل مال اليتيم بغير حق. { بِالطَّيِّبِ } وهو الحلال الذي ما فيه حرج ولا تبعة. { وَلَا تَأْكُلُوا أَمْوَالَهُمْ إِلَى أَمْوَالِكُمْ } أي: مع أموالكم، ففيه تنبيه لقبح أكل مالهم بهذه الحالة، التي قد استغنى بها الإنسان بما جعل الله له من الرزق في ماله. فمن تجرأ على هذه الحالة، فقد أتى { حُوبًا كَبِيرًا } أي: إثمًا عظيمًا، ووزرًا جسيمًا. ومن استبدال الخبيث بالطيب أن يأخذ الولي من مال اليتيم النفيس، ويجعل بدله من ماله الخسيس. وفيه الولاية على اليتيم، لأن مِنْ لازم إيتاء اليتيم ماله، ثبوت ولاية المؤتي على ماله. وفيه الأمر بإصلاح مال اليتيم، لأن تمام إيتائه ماله حفظه والقيام به بما يصلحه وينميه وعدم تعريضه للمخاوف والأخطار.\n                                    "
      },
      "originalText": "وَءَاتُواْ ٱلۡيَتَٰمَىٰٓ أَمۡوَٰلَهُمۡۖ وَلَا تَتَبَدَّلُواْ ٱلۡخَبِيثَ بِٱلطَّيِّبِۖ وَلَا تَأۡكُلُوٓاْ أَمۡوَٰلَهُمۡ إِلَىٰٓ أَمۡوَٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبٗا كَبِيرٗا ٢"
    },
    {
      "number": 496,
      "text": "وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَىٰ فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ ۖ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ۚ ذَٰلِكَ أَدْنَىٰ أَلَّا تَعُولُوا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 3,
      "juz": 4,
      "manzil": 1,
      "page": 77,
      "ruku": 62,
      "hizbQuarter": 31,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُواْ فِي ٱلۡيَتَٰمَىٰ فَٱنكِحُواْ مَا طَابَ لَكُم مِّنَ ٱلنِّسَآءِ مَثۡنَىٰ وَثُلَٰثَ وَرُبَٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُواْ فَوَٰحِدَةً أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُكُمۡۚ ذَٰلِكَ أَدۡنَىٰٓ أَلَّا تَعُولُواْ ٣\n                                    \n                                    \n                                    وقوله : ( وإن خفتم ألا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء مثنى ) أي : إذا كان تحت حجر أحدكم يتيمة وخاف ألا يعطيها مهر مثلها ، فليعدل إلى ما سواها من النساء ، فإنهن كثير ، ولم يضيق الله عليه .\nوقال البخاري : حدثنا إبراهيم بن موسى ، حدثنا هشام ، عن ابن جريج ، أخبرني هشام بن عروة ، عن أبيه ، عن عائشة; أن رجلا كانت له يتيمة فنكحها ، وكان لها عذق . وكان يمسكها عليه ، ولم يكن لها من نفسه شيء فنزلت فيه : ( وإن خفتم ألا تقسطوا [ في اليتامى ] ) أحسبه قال : كانت شريكته في ذلك العذق وفي ماله .\nثم قال البخاري : حدثنا عبد العزيز بن عبد الله ، حدثنا إبراهيم بن سعد ، عن صالح بن كيسان ، عن ابن شهاب قال : أخبرني عروة بن الزبير أنه سأل عائشة عن قول الله تعالى ( وإن خفتم ألا تقسطوا في اليتامى ) قالت : يا ابن أختي هذه اليتيمة تكون في حجر وليها تشركه في ماله ويعجبه مالها وجمالها ، فيريد وليها أن يتزوجها بغير أن يقسط في صداقها فيعطيها مثل ما يعطيها غيره ، فنهوا أن ينكحوهن إلا أن يقسطوا لهن ، ويبلغوا بهن أعلى سنتهن في الصداق ، وأمروا أن ينكحوا ما طاب لهم من النساء سواهن . قال عروة : قالت عائشة : وإن الناس استفتوا رسول الله صلى الله عليه وسلم بعد هذه الآية ، فأنزل الله [ تعالى ] ( ويستفتونك في النساء ) قالت عائشة : وقول الله في الآية الأخرى : ( وترغبون أن تنكحوهن ) [ النساء : 127 ] رغبة أحدكم عن يتيمته حين تكون قليلة المال والجمال . فنهوا أن ينكحوا من رغبوا في ماله وجماله من يتامى النساء إلا بالقسط ، من أجل رغبتهم عنهن إذا كن قليلات المال والجمال .\nوقوله : ( مثنى وثلاث ورباع ) أي : انكحوا ما شئتم من النساء سواهن إن شاء أحدكم ثنتين ، [ وإن شاء ثلاثا ] وإن شاء أربعا ، كما قال تعالى : ( جاعل الملائكة رسلا أولي أجنحة مثنى وثلاث ورباع ) [ فاطر : 1 ] أي : منهم من له جناحان ، ومنهم من له ثلاثة ، ومنهم من له أربعة ، ولا ينفي ما عدا ذلك في الملائكة لدلالة الدليل عليه ، بخلاف قصر الرجال على أربع ، فمن هذه الآية كما قاله ابن عباس وجمهور العلماء; لأن المقام مقام امتنان وإباحة ، فلو كان يجوز الجمع بين أكثر من أربع لذكره .\nقال الشافعي : وقد دلت سنة رسول الله صلى الله عليه وسلم المبينة عن الله أنه لا يجوز لأحد غير رسول الله صلى الله عليه وسلم أن يجمع بين أكثر من أربع نسوة .\nوهذا الذي قاله الشافعي ، رحمه الله ، مجمع عليه بين العلماء ، إلا ما حكي عن طائفة من الشيعة أنه يجوز الجمع بين أكثر من أربع إلى تسع . وقال بعضهم : بلا حصر . وقد يتمسك بعضهم بفعل النبي صلى الله عليه وسلم في جمعه بين أكثر من أربع إلى تسع كما ثبت في الصحيحين ، وأما إحدى عشرة كما جاء في بعض ألفاظ البخاري . وقد علقه البخاري ، وقد روينا عن أنس أن رسول الله صلى الله عليه وسلم تزوج بخمس عشرة امرأة ، ودخل منهن بثلاث عشرة ، واجتمع عنده إحدى عشرة ومات عن تسع . وهذا عند العلماء من خصائص رسول الله صلى الله عليه وسلم دون غيره من الأمة ، لما سنذكره من الأحاديث الدالة على الحصر في أربع .\nذكر الأحاديث في ذلك :\nقال الإمام أحمد : حدثنا إسماعيل ومحمد بن جعفر قالا حدثنا معمر ، عن الزهري . قال ابن جعفر في حديثه : أنبأنا ابن شهاب ، عن سالم ، عن أبيه : أن غيلان بن سلمة الثقفي أسلم وتحته عشرة نسوة ، فقال له النبي صلى الله عليه وسلم : اختر منهن أربعا . فلما كان في عهد عمر طلق نساءه ، وقسم ماله بين بنيه ، فبلغ ذلك عمر فقال : إني لأظن الشيطان فيما يسترق من السمع سمع بموتك فقذفه في نفسك ولعلك لا تمكث إلا قليلا . وايم الله لتراجعن نساءك ولترجعن في مالك أو لأورثهن منك ، ولآمرن بقبرك فيرجم ، كما رجم قبر أبي رغال .\nوهكذا رواه الشافعي والترمذي وابن ماجه والدارقطني والبيهقي وغيرهم عن اسماعيل بن علية وغندر ويزيد بن زريع وسعيد بن أبي عروبة ، وسفيان الثوري ، وعيسى بن يونس ، وعبد الرحمن بن محمد المحاربي ، والفضل بن موسى وغيرهم من الحفاظ ، عن معمر - بإسناده - مثله إلى قوله : اختر منهن أربعا . وباقي الحديث في قصة عمر من أفراد أحمد وهي زيادة حسنة وهي مضعفة لما علل به البخاري هذا الحديث فيما حكاه عنه الترمذي ، حيث قال بعد روايته له : سمعت البخاري يقول : هذا حديث غير محفوظ ، والصحيح ما روى شعيب وغيره ، عن الزهري ، حدثت عن محمد بن سويد الثقفي أن غيلان بن سلمة ، فذكره . قال البخاري : وإنما حديث الزهري عن سالم عن أبيه : أن رجلا من ثقيف طلق نساءه ، فقال له عمر : لتراجعن نساءك أو لأرجمن قبرك كما رجم قبر أبي رغال .\nوهذا التعليل فيه نظر ، والله أعلم . وقد رواه عبد الرزاق ، عن معمر ، عن الزهري مرسلا وهكذا رواه مالك ، عن الزهري مرسلا . قال أبو زرعة : وهو أصح .\nقال البيهقي : ورواه عقيل ، عن الزهري : بلغنا عن عثمان بن محمد بن أبي سويد .\nقال أبو حاتم : وهذا وهم ، إنما هو الزهري عن عثمان بن أبي سويد بلغنا أن رسول الله صلى الله عليه وسلم ، فذكره .\nقال البيهقي : ورواه يونس وابن عيينة ، عن الزهري ، عن محمد بن أبي سويد .\nوهذا كما علله البخاري . وهذا الإسناد الذي قدمناه من مسند الإمام أحمد رجاله ثقات على شرط الصحيحين ثم قد روي من غير طريق معمر ، بل والزهري قال الحافظ أبو بكر البيهقي : أخبرنا أبو عبد الله الحافظ ، حدثنا أبو علي الحافظ ، حدثنا أبو عبد الرحمن النسائي ، حدثنا أبو بريد عمرو بن يزيد الجرمي أخبرنا سيف بن عبيد حدثنا سرار بن مجشر ، عن أيوب ، عن نافع وسالم ، عن ابن عمر : أن غيلان بن سلمة كان عنده عشر نسوة فأسلم وأسلمن معه ، فأمره النبي صلى الله عليه وسلم أن يختار منهن أربعا . هكذا أخرجه النسائي في سننه . قال أبو علي بن السكن : تفرد به سرار بن مجشر وهو ثقة ، وكذا وثقه ابن معين . قال أبو علي : وكذلك رواه السميدع بن واهب عن سرار .\nقال البيهقي : وروينا من حديث قيس بن الحارث أو الحارث بن قيس ، وعروة بن مسعود الثقفي ، وصفوان بن أمية - يعني حديث غيلان بن سلمة .\nفوجه الدلالة أنه لو كان يجوز الجمع بين أكثر من أربع لسوغ له رسول الله صلى الله عليه وسلم سائرهن في بقاء العشرة وقد أسلمن معه ، فلما أمره بإمساك أربع وفراق سائرهن دل على أنه لا يجوز الجمع بين أكثر من أربع بحال ، وإذا كان هذا في الدوام ، ففي الاستئناف بطريق الأولى والأحرى ، والله سبحانه وتعالى أعلم بالصواب .\nحديث آخر في ذلك : روى أبو داود وابن ماجه في سننهما من طريق محمد بن عبد الرحمن ابن أبي ليلى ، عن حميضة بن الشمردل - وعند ابن ماجه : بنت الشمردل ، وحكى أبو داود أن منهم من يقول : الشمرذل بالذال المعجمة - عن قيس بن الحارث . وعند أبي داود في رواية : الحارث بن قيس بن عميرة الأسدي قال : أسلمت وعندي ثمان نسوة ، فذكرت للنبي صلى الله عليه وسلم فقال : \" اختر منهن أربعا \" .\nوهذا الإسناد حسن ، ومجرد هذا الاختلاف لا يضر مثله ، لما للحديث من الشواهد .\nحديث آخر في ذلك : قال الإمام أبو عبد الله محمد بن إدريس الشافعي ، رحمه الله ، في مسنده : أخبرني من سمع ابن أبي الزناد يقول : أخبرني عبد المجيد بن سهيل بن عبد الرحمن عن عوف بن الحارث ، عن نوفل بن معاوية الديلي ، رضي الله عنه ، قال : أسلمت وعندي خمس نسوة ، فقال لي رسول الله صلى الله عليه وسلم : \" اختر أربعا أيتهن شئت ، وفارق الأخرى \" ، فعمدت إلى أقدمهن صحبة عجوز عاقر معي منذ ستين سنة ، فطلقتها .\nفهذه كلها شواهد بصحة ما تقدم من حديث غيلان كما قاله الحافظ أبو بكر البيهقي ، رحمه الله .\nوقوله : ( فإن خفتم ألا تعدلوا فواحدة أو ما ملكت أيمانكم ) أي : فإن خشيتم من تعداد النساء ألا تعدلوا بينهن ، كما قال تعالى : ( ولن تستطيعوا أن تعدلوا بين النساء ولو حرصتم ) [ النساء : 129 ] فمن خاف من ذلك فيقتصر على واحدة ، أو على الجواري السراري ، فإنه لا يجب قسم بينهن ، ولكن يستحب ، فمن فعل فحسن ، ومن لا فلا حرج .\nوقوله : ( ذلك أدنى ألا تعولوا ) قال بعضهم : [ أي ] أدنى ألا تكثر عائلتكم . قاله زيد بن أسلم وسفيان بن عيينة والشافعي ، رحمهم الله ، وهذا مأخوذ من قوله تعالى : ( وإن خفتم عيلة ) أي فقرا ( فسوف يغنيكم الله من فضله ) [ التوبة : 28 ] وقال الشاعر\nفما يدري الفقير متى غناه وما يدري الغني متى يعيل\nوتقول العرب : عال الرجل يعيل عيلة ، إذا افتقر ولكن في هذا التفسير هاهنا نظر; فإنه كما يخشى كثرة العائلة من تعداد الحرائر ، كذلك يخشى من تعداد السراري أيضا . والصحيح قول الجمهور : ( ذلك أدنى ألا تعولوا ) أي : لا تجوروا . يقال : عال في الحكم : إذا قسط وظلم وجار ، وقال أبو طالب في قصيدته المشهورة :\nبميزان قسط لا يخيس شعيرة له شاهد من نفسه غير عائل\nوقال هشيم : عن أبي إسحاق قال : كتب عثمان بن عفان إلى أهل الكوفة في شيء عاتبوه فيه : إني لست بميزان لا أعول . رواه ابن جرير .\nوقد روى ابن أبي حاتم ، وابن مردويه ، وأبو حاتم ابن حبان في صحيحه ، من طريق عبد الرحمن بن إبراهيم دحيم ، حدثنا محمد بن شعيب ، عن عمر بن محمد بن زيد ، عن عبد الله بن عمر ، عن هشام بن عروة ، عن أبيه ، عن عائشة عن النبي صلى الله عليه وسلم ( ذلك أدنى ألا تعولوا ) قال : \" لا تجوروا \" .\nقال ابن أبي حاتم : قال أبي : هذا حديث خطأ ، والصحيح : عن عائشة . موقوف .\nوقال ابن أبي حاتم : وروي عن ابن عباس ، وعائشة ، ومجاهد ، وعكرمة ، والحسن ، وأبي مالك وأبي رزين والنخعي ، والشعبي ، والضحاك ، وعطاء الخراساني ، وقتادة ، والسدي ، ومقاتل بن حيان : أنهم قالوا : لا تميلوا وقد استشهد عكرمة ، رحمه الله ، ببيت أبي طالب الذي قدمناه ، ولكن ما أنشده كما هو المروي في السيرة ، وقد رواه ابن جرير ، ثم أنشده جيدا ، واختار ذلك .\n                                    ",
        "qortoby": "وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُواْ فِي ٱلۡيَتَٰمَىٰ فَٱنكِحُواْ مَا طَابَ لَكُم مِّنَ ٱلنِّسَآءِ مَثۡنَىٰ وَثُلَٰثَ وَرُبَٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُواْ فَوَٰحِدَةً أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُكُمۡۚ ذَٰلِكَ أَدۡنَىٰٓ أَلَّا تَعُولُواْ ٣\n                                    \n                                    \n                                    قوله تعالى : وإن خفتم ألا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء مثنى وثلاث ورباع فإن خفتم ألا تعدلوا فواحدة أو ما ملكت أيمانكم ذلك أدنى ألا تعولوا\nفيه أربع عشرة مسألة :\nالأولى : قوله تعالى : وإن خفتم شرط ، وجوابه فانكحوا . أي إن خفتم ألا تعدلوا في مهورهن وفي النفقة عليهن فانكحوا ما طاب لكم أي غيرهن . وروى الأئمة واللفظ لمسلم عن عروة بن الزبير ، عن عائشة في قول الله تعالى : وإن خفتم ألا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء مثنى وثلاث ورباع قالت : يا ابن أختي هي اليتيمة تكون في حجر وليها تشاركه في ماله فيعجبه مالها وجمالها فيريد وليها أن يتزوجها من غير أن يقسط في صداقها فيعطيها مثل ما يعطيها غيره ، فنهوا أن ينكحوهن إلا أن يقسطوا لهن ويبلغوا بهن أعلى سنتهن من الصداق وأمروا أن ينكحوا ما طاب لهم من النساء سواهن . وذكر الحديث . وقال ابن خويز منداد : ولهذا قلنا إنه يجوز أن يشتري الوصي من مال اليتيم لنفسه ، ويبيع من نفسه من غير محاباة . وللموكل النظر فيما اشترى وكيله لنفسه أو باع منها . وللسلطان النظر فيما يفعله الوصي من ذلك . فأما الأب فليس لأحد عليه نظر ما لم تظهر عليه المحاباة فيعترض عليه السلطان حينئذ ؛ وقد مضى في \" البقرة \" القول في هذا . وقال الضحاك والحسن وغيرهما : إن الآية ناسخة لما كان في الجاهلية وفي أول الإسلام ؛ من أن للرجل أن يتزوج من الحرائر ما شاء ، فقصرتهن الآية على أربع . وقال ابن عباس وابن جبير وغيرهما : المعنى وإن خفتم ألا تقسطوا في اليتامى فكذلك خافوا في النساء ؛ لأنهم كانوا يتحرجون في اليتامى ولا يتحرجون في النساء و \" خفتم \" من الأضداد ؛ فإنه يكون المخوف منه معلوم الوقوع ، وقد يكون مظنونا ؛ فلذلك اختلف العلماء في تفسير هذا الخوف . فقال أبو عبيدة : خفتم بمعنى أيقنتم . وقال آخرون : خفتم ظننتم . قال ابن عطية : وهذا الذي اختاره الحذاق ، وأنه على بابه من الظن لا من اليقين . التقدير من غلب على ظنه التقصير في القسط لليتيمة فليعدل عنها .\nو \" تقسطوا \" معناه تعدلوا . يقال : أقسط الرجل إذا عدل . وقسط إذا جار وظلم صاحبه . قال الله تعالى : وأما القاسطون فكانوا لجهنم حطبا يعني الجائرون . وقال عليه السلام : المقسطون في الدين على منابر من نور يوم القيامة يعني العادلين . وقرأ ابن وثاب والنخعي \" تقسطوا \" بفتح التاء من قسط على تقدير زيادة \" لا \" كأنه قال : وإن خفتم أن تجوروا .\nالثانية : قوله تعالى : فانكحوا ما طاب لكم من النساء إن قيل : كيف جاءت ما للآدميين وإنما أصلها لما لا يعقل ؛ فعنه أجوبة خمسة :\nالأول - أن \" من \" و \" ما \" قد يتعاقبان ؛ قال الله تعالى : والسماء وما بناها أي ومن بناها . وقال فمنهم من يمشي على بطنه ومنهم من يمشي على رجلين ومنهم من يمشي على أربع . فما هاهنا لمن يعقل وهن النساء ؛ لقوله بعد ذلك من النساء مبينا لمبهم . وقرأ ابن أبي عبلة \" من طاب \" على ذكر من يعقل .\nالثاني : قال البصريون : \" ما \" تقع للنعوت كما تقع لما لا يعقل يقال : ما عندك ؟ فيقال : ظريف وكريم . فالمعنى فانكحوا الطيب من النساء ؛ أي الحلال ، وما حرمه الله فليس بطيب . وفي التنزيل وما رب العالمين فأجابه موسى على وفق ما سأل ؛ وسيأتي .\nالثالث : حكى بعض الناس أن ما في هذه الآية ظرفية ، أي ما دمتم تستحسنون النكاح قال ابن عطية : وفي هذا المنزع ضعف .\nجواب رابع : قال الفراء ما هاهنا مصدر . وقال النحاس : وهذا بعيد جدا ؛ لا يصح فانكحوا الطيبة . قال الجوهري : طاب الشيء يطيب طيبة وتطيابا . قال علقمة :\nكأن تطيابها في الأنف مشموم\nجواب خامس : وهو أن المراد بما هنا العقد ؛ أي فانكحوا نكاحا طيبا . وقراءة ابن أبي عبلة ترد هذه الأقوال الثلاثة . وحكى أبو عمرو بن العلاء أن أهل مكة إذا سمعوا الرعد قالوا : سبحان ما سبح له الرعد . أي سبحان من سبح له الرعد . ومثله قولهم : سبحان ما سخركن لنا . أي من سخركن .\nواتفق كل من يعاني العلوم على أن قوله تعالى : وإن خفتم ألا تقسطوا في اليتامى ليس له مفهوم ؛ إذ قد أجمع المسلمون على أن من لم يخف القسط في اليتامى له أن ينكح أكثر من واحدة : اثنتين أو ثلاثا أو أربعا كمن خاف . فدل على أن الآية نزلت جوابا لمن خاف ذلك ، وأن حكمها أعم من ذلك .\nالثالثة : تعلق أبو حنيفة بهذه الآية في تجويزه نكاح اليتيمة قبل البلوغ . وقال : إنما تكون يتيمة قبل البلوغ ، وبعد البلوغ هي امرأة مطلقة لا يتيمة ؛ بدليل أنه لو أراد البالغة لما نهى عن حطها عن صداق مثلها ؛ لأنها تختار ذلك فيجوز إجماعا .\nوذهب مالك والشافعي والجمهور من العلماء إلى أن ذلك لا يجوز حتى تبلغ وتستأمر ؛ لقوله تعالى : ويستفتونك في النساء والنساء اسم ينطلق على الكبار كالرجال في الذكور ، واسم الرجل لا يتناول الصغير ؛ فكذلك اسم النساء ، والمرأة لا يتناول الصغيرة .\nوقد قال : في يتامى النساء والمراد به هناك اليتامى هنا ؛ كما قالت عائشة رضي الله عنها . فقد دخلت اليتيمة الكبيرة في الآية فلا تزوج إلا بإذنها ، ولا تنكح الصغيرة إذ لا إذن لها ، فإذا بلغت جاز نكاحها لكن لا تزوج إلا بإذنها . كما رواه الدارقطني من حديث محمد بن إسحاق ، عن نافع ، عن ابن عمر قال : زوجني خالي قدامة بن مظعون بنت أخيه عثمان بن مظعون ، فدخل المغيرة بن شعبة على أمها ، فأرغبها في المال وخطبها إليها ، فرفع شأنها إلى النبي صلى الله عليه وسلم فقال قدامة : يا رسول الله ابنة أخي وأنا وصي أبيها ولم أقصر بها ، زوجتها من قد علمت فضله وقرابته . فقال له رسول الله صلى الله عليه وسلم : إنها يتيمة واليتيمة أولى بأمرها فنزعت مني وزوجها المغيرة بن شعبة . قال الدارقطني : لم يسمعه محمد بن إسحاق من نافع ، وإنما سمعه من عمر بن حسين عنه . ورواه ابن أبي ذئب ، عن عمر بن حسين ، عن نافع عن عبد الله بن عمر : أنه تزوج بنت خاله عثمان بن مظعون قال : فذهبت أمها إلى رسول الله صلى الله عليه وسلم فقالت : إن ابنتي تكره ذلك . فأمره النبي صلى الله عليه وسلم أن يفارقها ففارقها . وقال : ولا تنكحوا اليتامى حتى تستأمروهن فإذا سكتن فهو إذنها . فتزوجها بعد عبد الله بن المغيرة بن شعبة . فهذا يرد ما يقوله أبو حنيفة من أنها إذا بلغت لم تحتج إلى ولي ، بناء على أصله في عدم اشتراط الولي في صحة النكاح . وقد مضى في \" البقرة \" ذكره ؛ فلا معنى لقولهم : إن هذا الحديث محمول على غير البالغة لقوله إلا بإذنها فإنه كان لا يكون لذكر اليتيم معنى والله أعلم .\nالرابعة : وفي تفسير عائشة للآية من الفقه ما قال به مالك صداق المثل ، والرد إليه فيما فسد من الصداق ووقع الغبن في مقداره ؛ لقولها : ( بأدنى من سنة صداقها ) . فوجب أن يكون صداق المثل معروفا لكل صنف من الناس على قدر أحوالهم . وقد قال مالك : للناس مناكح عرفت لهم وعرفوا لها . أي صدقات وأكفاء . وسئل مالك عن رجل زوج ابنته من ابن أخ له فقير فاعترضت أمها فقال : إني لأرى لها في ذلك متكلما . فسوغ لها في ذلك الكلام حتى يظهر هو من نظره ما يسقط اعتراض الأم عليه . وروي \" لا أرى \" بزيادة الألف والأول أصح . وجائز لغير اليتيمة أن تنكح بأدنى من صداق مثلها ؛ لأن الآية إنما خرجت في اليتامى . هذا مفهومها وغير اليتيمة بخلافها .\nالخامسة : فإذا بلغت اليتيمة وأقسط الولي في صداقها جاز له أن يتزوجها ، ويكون هو الناكح والمنكح على ما فسرته عائشة . وبه قال أبو حنيفة والأوزاعي والثوري وأبو ثور ، وقاله من التابعين الحسن وربيعة ، وهو قول الليث . وقال زفر والشافعي : لا يجوز له أن يتزوجها إلا بإذن السلطان ، أو يزوجها منه ولي لها هو أقعد بها منه ؛ أو مثله في القعدد ؛ وأما أن يتولى طرفي العقد بنفسه فيكون ناكحا منكحا فلا . واحتجوا بأن الولاية شرط من شروط العقد لقوله عليه السلام : لا نكاح إلا بولي وشاهدي عدل . فتعديد الناكح والمنكح والشهود واجب ؛ فإذا اتحد اثنان منهم سقط واحد من المذكورين . وفي المسألة قول ثالث ، وهو أن تجعل أمرها إلى رجل يزوجها منه . روي هذا عن المغيرة بن شعبة ، وبه قال أحمد ، ذكره ابن المنذر .\nالسادسة : قوله تعالى : ما طاب لكم من النساء معناه ما حل لكم ؛ عن الحسن وابن جبير وغيرهما . واكتفى بذكر من يجوز نكاحه ؛ لأن المحرمات من النساء كثير . وقرأ ابن إسحاق والجحدري وحمزة \" طاب \" \" بالإمالة \" وفي مصحف أبي \" طيب \" بالياء ؛ فهذا دليل الإمالة . \" من النساء \" دليل على أنه لا يقال نساء إلا لمن بلغ الحلم . وواحد النساء نسوة ، ولا واحد لنسوة من لفظه ، ولكن يقال امرأة .\nالسابعة : قوله تعالى : مثنى وثلاث ورباع وموضعها من الإعراب نصب على البدل من ما وهي نكرة لا تنصرف ؛ لأنها معدولة وصفة ؛ كذا قال أبو علي . وقال الطبري : هي معارف ؛ لأنها لا يدخلها الألف واللام ، وهي بمنزلة عمر في التعريف ؛ قاله الكوفي . وخطأ الزجاج هذا القول . وقيل : لم ينصرف ؛ لأنه معدول عن لفظه ومعناه ، فأحاد معدول عن واحد واحد ، ومثنى معدولة عن اثنين اثنين ، وثلاث معدولة عن ثلاثة ثلاثة ، ورباع عن أربعة أربعة . وفي كل واحد منها لغتان : فعال ومفعل ؛ يقال أحاد وموحد وثناء ومثنى وثلاث ومثلث ورباع ومربع ، وكذلك إلى معشر وعشار . وحكى أبو إسحاق الثعلبي لغة ثالثة : أحد وثنى وثلث وربع مثل عمر وزفر . وكذلك قرأ النخعي في هذه الآية . وحكى المهدوي ، عن النخعي وابن وثاب \" ثلاث وربع \" بغير ألف في ربع فهو مقصور من رباع استخفافا ؛ كما قال :\nأقبل سيل جاء من عند الله يحرد حرد الجنة المغله\nقال الثعلبي : ولا يزاد من هذا البناء على الأربع إلا بيت جاء عن الكميت :\nفلم يستثيروك حتى رمي ت فوق الرجال خصالا عشارا\nيعني طعنت عشرة . وقال ابن الدهان : وبعضهم يقف على المسموع وهو من أحاد إلى رباع ولا يعتبر بالبيت لشذوذه . وقال أبو عمرو بن الحاجب : ويقال أحاد وموحد وثناء ومثنى وثلاث ومثلث ورباع ومربع . وهل يقال فيما عداه إلى التسعة أو لا يقال ؟ فيه خلاف أصحها أنه لم يثبت . وقد نص البخاري في صحيحه على ذلك .\nوكونه معدولا عن معناه أنه لا يستعمل في موضع تستعمل فيه الأعداد غير المعدولة ؛ تقول : جاءني اثنان وثلاثة ، ولا يجوز مثنى وثلاث حتى يتقدم قبله جمع ، مثل جاءني القوم أحاد وثناء وثلاث ورباع من غير تكرار . وهي في موضع الحال هنا وفي الآية ، وتكون صفة ؛ ومثال كون هذه الأعداد صفة يتبين في قوله تعالى : أولي أجنحة مثنى وثلاث ورباع فهي صفة للأجنحة وهي نكرة . وقال ساعدة بن جؤية :\nولكنما أهلي بواد أنيسه ذئاب تبغى الناس مثنى وموحد\nوأنشد الفراء :\nقتلنا به من بين مثنى وموحد بأربعة منكم وآخر خامس\nفوصف ذئابا وهي نكرة بمثنى وموحد ، وكذلك بيت الفراء ؛ أي قتلنا به ناسا ، فلا تنصرف إذا هذه الأسماء في معرفة ولا نكرة . وأجاز الكسائي والفراء صرفه في العدد على أنه نكرة . وزعم الأخفش أنه إن سمى به صرفه في المعرفة والنكرة ؛ لأنه قد زال عنه العدل .\nالثامنة : اعلم أن هذا العدد مثنى وثلاث ورباع لا يدل على إباحة تسع ، كما قاله من بعد فهمه للكتاب والسنة ، وأعرض عما كان عليه سلف هذه الأمة ، وزعم أن الواو جامعة ؛ وعضد ذلك بأن النبي صلى الله عليه وسلم نكح تسعا ، وجمع بينهن في عصمته . والذي صار إلى هذه الجهالة ، وقال هذه المقالة الرافضة وبعض أهل الظاهر ؛ فجعلوا مثنى مثل اثنين ، وكذلك ثلاث ورباع . وذهب بعض أهل الظاهر أيضا إلى أقبح منها ، فقالوا بإباحة الجمع بين ثمان عشرة ؛ تمسكا منه بأن العدل في تلك الصيغ يفيد التكرار والواو للجمع ؛ فجعل مثنى بمعنى اثنين اثنين وكذلك ثلاث ورباع . وهذا كله جهل باللسان والسنة ، ومخالفة لإجماع الأمة ، إذ لم يسمع عن أحد من الصحابة ولا التابعين أنه جمع في عصمته أكثر من أربع . وأخرج مالك في موطئه ، والنسائي والدارقطني في سننهما أن النبي صلى الله عليه وسلم قال لغيلان بن أمية الثقفي وقد أسلم وتحته عشر نسوة : اختر منهن أربعا وفارق سائرهن . في كتاب أبي داود ، عن الحارث بن قيس ، قال : أسلمت وعندي ثمان نسوة ، فذكرت ذلك للنبي صلى الله عليه وسلم فقال : اختر منهن أربعا . وقال مقاتل : إن قيس بن الحارث كان عنده ثمان نسوة حرائر ؛ فلما نزلت هذه الآية أمره رسول الله صلى الله عليه وسلم أن يطلق أربعا ويمسك أربعا . كذا قال : \" قيس بن الحارث \" ، والصواب أن ذلك كان حارث بن قيس الأسدي كما ذكر أبو داود . وكذا روى محمد بن الحسن في كتاب السير الكبير : أن ذلك كان حارث بن قيس ، وهو المعروف عند الفقهاء . وأما ما أبيح من ذلك للنبي صلى الله عليه وسلم فذلك من خصوصياته ؛ على ما يأتي بيانه في \" الأحزاب \" . وأما قولهم : إن الواو جامعة ؛ فقد قيل ذلك ، لكن الله تعالى خاطب العرب بأفصح اللغات . والعرب لا تدع أن تقول تسعة وتقول اثنين وثلاثة وأربعة . وكذلك تستقبح ممن يقول : أعط فلانا أربعة ستة ثمانية ، ولا يقول ثمانية عشر . وإنما الواو في هذا الموضع بدل ؛ أي انكحوا ثلاثا بدلا من مثنى ، ورباع بدلا من ثلاث ؛ ولذلك عطف بالواو ولم يعطف بأو . ولو جاء بأو لجاز ألا يكون لصاحب المثنى ثلاث ، ولا لصاحب الثلاث رباع . وأما قولهم : إن مثنى تقتضي اثنين ، وثلاث ثلاثة ، ورباع أربعة ، فتحكم بما لا يوافقهم أهل اللسان عليه ، وجهالة منهم . وكذلك جهل الآخرين ، بأن مثنى تقتضي اثنين اثنين ، وثلاث ثلاثة ثلاثة ، ورباع أربعة أربعة ، ولم يعلموا أن اثنين اثنين ، وثلاثا ثلاثا ، وأربعا أربعا ، حصر للعدد . ومثنى وثلاث ورباع بخلافها . ففي العدد المعدول عند العرب زيادة معنى ليست في الأصل ؛ وذلك أنها إذا قالت : جاءت الخيل مثنى ، إنما تعني بذلك اثنين اثنين ؛ أي جاءت مزدوجة . قال الجوهري : وكذلك معدول العدد . وقال غيره : إذا قلت جاءني قوم مثنى أو ثلاث أو أحاد أو عشار ، فإنما تريد أنهم جاءوك واحدا واحدا ، أو اثنين اثنين ، أو ثلاثة ثلاثة ، أو عشرة عشرة ، وليس هذا المعنى في الأصل ؛ لأنك إذا قلت جاءني قوم ثلاثة ثلاثة ، أو قوم عشرة عشرة ، فقد حصرت عدة القوم بقولك ثلاثة وعشرة . فإذا قلت : جاءوني رباع وثناء فلم تحصر عدتهم . وإنما تريد أنهم جاءوك أربعة أربعة أو اثنين اثنين . وسواء كثر عددهم أو قل في هذا الباب ، فقصرهم كل صيغة على أقل ما تقتضيه بزعمه تحكم .\nوأما اختلاف علماء المسلمين في الذي يتزوج خامسة وعنده أربع وهي :\nالتاسعة : فقال مالك والشافعي : عليه الحد إن كان عالما . وبه قال أبو ثور . وقال الزهري : يرجم إذا كان عالما ، وإن كان جاهلا أدنى الحدين الذي هو الجلد ، ولها مهرها ويفرق بينهما ولا يجتمعان أبدا . وقالت طائفة : لا حد عليه في شيء من ذلك . هذا قول النعمان . وقال يعقوب ومحمد : يحد في ذات المحرم ولا يحد في غير ذلك من النكاح . وذلك مثل أن يتزوج مجوسية أو خمسة في عقدة أو تزوج متعة أو تزوج بغير شهود ، أو أمة تزوجها بغير إذن مولاها . وقال أبو ثور : إذا علم أن هذا لا يحل له يجب أن يحد فيه كله إلا التزوج بغير شهود . وفيه قول ثالث قاله النخعي في الرجل ينكح الخامسة متعمدا قبل أن تنقضي عدة الرابعة من نسائه : جلد مائة ولا ينفى . فهذه فتيا علمائنا في الخامسة على ما ذكره ابن المنذر فكيف بما فوقها .\nالعاشرة : ذكر الزبير بن بكار حدثني إبراهيم الحزامي ، عن محمد بن معن الغفاري ، قال : أتت امرأة إلى عمر بن الخطاب رضي الله عنه ؛ فقالت : يا أمير المؤمنين ، إن زوجي يصوم النهار ويقوم الليل وأنا أكره أن أشكوه ، وهو يعمل بطاعة الله عز وجل . فقال لها : نعم الزوج زوجك : فجعلت تكرر عليه القول وهو يكرر عليها الجواب . فقال له كعب الأسدي : يا أمير المؤمنين ، هذه المرأة تشكو زوجها في مباعدته إياها عن فراشه . فقال عمر : كما فهمت كلامها فاقض بينهما . فقال كعب : علي بزوجها ، فأتي به فقال له : إن امرأتك هذه تشكوك . قال : أفي طعام أم شراب ؟ قال لا . فقالت المرأة :\nيا أيها القاضي الحكيم رشده ألهى خليلي عن فراشي مسجده\nزهده في مضجعي تعبده فاقض القضا كعب ولا تردده\nنهاره وليله ما يرقده فلست في أمر النساء أحمده\nفقال زوجها :\nزهدني في فرشها وفي الحجل أني امرؤ أذهلني ما قد نزل\nفي سورة النحل وفي السبع الطول وفي كتاب الله تخويف جلل\nفقال كعب :\nإن لها عليك حقا يا رجل نصيبها في أربع لمن عقل\nفأعطها ذاك ودع عنك العلل\nثم قال : إن الله عز وجل قد أحل لك من النساء مثنى وثلاث ورباع ، فلك ثلاثة أيام ولياليهن تعبد فيهن ربك . فقال عمر : والله ما أدري من أي أمريك أعجب ؟ أمن فهمك أمرهما أم من حكمك بينهما ؟ اذهب فقد وليتك قضاء البصرة . وروى أبو هدبة إبراهيم بن هدبة حدثنا أنس بن مالك قال : أتت النبي صلى الله عليه وسلم امرأة تستعدي زوجها ، فقالت : ليس لي ما للنساء ؛ زوجي يصوم الدهر . قال : لك يوم وله يوم ، للعبادة يوم وللمرأة يوم .\nالحادية عشرة : قوله تعالى : فإن خفتم ألا تعدلوا فواحدة قال الضحاك وغيره : في الميل والمحبة والجماع والعشرة والقسم بين الزوجات الأربع والثلاث والاثنتين\nفواحدة فمنع من الزيادة التي تؤدي إلى ترك العدل في القسم وحسن العشرة . وذلك دليل على وجوب ذلك ، والله أعلم . وقرئت بالرفع ، أي فواحدة فيها كفاية أو كافية . وقال الكسائي : فواحدة تقنع . وقرئت بالنصب بإضمار فعل ، أي فانكحوا واحدة .\nالثانية عشرة : قوله تعالى : أو ما ملكت أيمانكم يريد الإماء . وهو عطف على \" فواحدة \" أي إن خاف ألا يعدل في واحدة فما ملكت يمينه . وفي هذا دليل على ألا حق لملك اليمين في الوطء ولا القسم ؛ لأن المعنى فإن خفتم ألا تعدلوا في القسم فواحدة أو ما ملكت أيمانكم فجعل ملك اليمين كله بمنزلة واحدة ، فانتفى بذلك أن يكون للإماء حق في الوطء أو في القسم . إلا أن ملك اليمين في العدل قائم بوجوب حسن الملكة والرفق بالرقيق . وأسند تعالى الملك إلى اليمين إذ هي صفة مدح ، واليمين مخصوصة بالمحاسن لتمكنها . ألا ترى أنها المنفقة ؟ كما قال عليه السلام : حتى لا تعلم شماله ما تنفق يمينه وهي المعاهدة المبايعة ، وبها سميت الألية يمينا ، وهي المتلقية لرايات المجد ؛ كما قال :\nإذا ما راية رفعت لمجد تلقاها عرابة باليمين\nالثالثة عشرة : قوله تعالى : ذلك أدنى ألا تعولوا أي ذلك أقرب إلى ألا تميلوا عن الحق وتجوروا ؛ عن ابن عباس ومجاهد وغيرهما . يقال : عال الرجل يعول إذا جار ومال . ومنه قولهم : عال السهم عن الهدف مال عنه . قال ابن عمر : إنه لعائل الكيل والوزن ؛ قال الشاعر :\nقالوا اتبعنا رسول الله واطرحوا قول الرسول وعالوا في الموازين\nأي جاروا . وقال أبو طالب :\nبميزان صدق لا يغل شعيرة له شاهد من نفسه غير عائل\nيريد غير مائل . وقال آخر :\nثلاثة أنفس وثلاث ذود لقد عال الزمان على عيالي\nأي جار ومال . وعال الرجل يعيل إذا افتقر فصار عالة . ومنه قوله تعالى : وإن خفتم عيلة . ومنه قول الشاعر :\nوما يدري الفقير متى غناه وما يدري الغني متى يعيل\nوهو عائل وقوم عيلة ، والعيلة والعالة الفاقة ، وعالني الشيء يعولني إذا غلبني وثقل علي ، وعال الأمر اشتد وتفاقم . وقال الشافعي : ألا تعولوا ألا تكثر عيالكم .\nقال الثعلبي : وما قال هذا غيره ، وإنما يقال : أعال يعيل إذا كثر عياله . وزعم ابن العربي أن عال على سبعة معان لا ثامن لها ، يقال : عال : مال ، الثاني : زاد ، الثالث : جار ، الرابع : افتقر ، الخامس : أثقل ، حكاه ابن دريد . قالت الخنساء :\nويكفي العشيرة ما عالها\nالسادس : عال قام بمئونة العيال ؛ ومنه قوله عليه السلام : وابدأ بمن تعول .\nالسابع : عال غلب ؛ ومنه عيل صبره . أي غلب . ويقال : أعال الرجل كثر عياله . وأما عال بمعنى كثر عياله فلا يصح .\nقلت : أما قول الثعلبي \" ما قاله غيره \" فقد أسنده الدارقطني في سننه عن زيد بن أسلم ، وهو قول جابر بن زيد ؛ فهذان إمامان من علماء المسلمين وأئمتهم قد سبقا الشافعي إليه . وأما ما ذكره ابن العربي من الحصر وعدم الصحة فلا يصح . وقد ذكرنا : عال الأمر اشتد وتفاقم ، حكاه الجوهري . وقال الهروي في غريبيه : \" وقال أبو بكر : يقال عال الرجل في الأرض يعيل فيها أي ضرب فيها . وقال الأحمر : يقال عالني الشيء يعيلني عيلا ومعيلا إذا أعجزك \" . وأما عال كثر عياله فذكره الكسائي وأبو عمر الدوري وابن الأعرابي . قال الكسائي أبو الحسن علي بن حمزة : العرب تقول عال يعول وأعال يعيل أي كثر عياله .\nوقال أبو حاتم : كان الشافعي أعلم بلغة العرب منا ، ولعله لغة . قال الثعلبي المفسر : قال أستاذنا أبو القاسم بن حبيب : سألت أبا عمر الدوري عن هذا وكان إماما في اللغة غير مدافع فقال : هي لغة حمير ؛ وأنشد :\nوإن الموت يأخذ كل حي بلا شك وإن أمشى وعالا\nيعني وإن كثرت ماشيته وعياله . وقال أبو عمرو بن العلاء : لقد كثرت وجوه العرب حتى خشيت أن آخذ عن لاحن لحنا . وقرأ طلحة بن مصرف \" ألا تعيلوا \" وهي حجة الشافعي رضي الله عنه . قال ابن عطية : وقدح الزجاج وغيره في تأويل عال من العيال بأن قال : إن الله تعالى قد أباح كثرة السراري وفي ذلك تكثير العيال ، فكيف يكون أقرب إلى ألا يكثر العيال . وهذا القدح غير صحيح ؛ لأن السراري إنما هي مال يتصرف فيه بالبيع ، وإنما العيال القادح الحرائر ذوات الحقوق الواجبة . وحكى ابن الأعرابي أن العرب تقول : عال الرجل إذا كثر عياله .\nالرابعة عشرة : تعلق بهذه الآية من أجاز للمملوك أن يتزوج أربعا ، لأن الله تعالى قال : فانكحوا ما طاب لكم من النساء يعني ما حل مثنى وثلاث ورباع ولم يخص عبدا من حر . وهو قول داود والطبري وهو المشهور عن مالك وتحصيل مذهبه على ما في موطئه ، وكذلك روى عنه ابن القاسم وأشهب . وذكر ابن المواز أن ابن وهب روى عن مالك أن العبد لا يتزوج إلا اثنتين ؛ قال وهو قول الليث . قال أبو عمر : قال الشافعي وأبو حنيفة وأصحابهما والثوري والليث بن سعد : لا يتزوج العبد أكثر من اثنتين ؛ وبه قال أحمد وإسحاق . وروي عن عمر بن الخطاب وعلي بن أبي طالب وعبد الرحمن بن عوف في العبد لا ينكح أكثر من اثنتين ؛ ولا أعلم لهم مخالفا من الصحابة . وهو قول الشعبي وعطاء وابن سيرين والحكم وإبراهيم وحماد . والحجة لهذا القول القياس الصحيح على طلاقه وحده . وكل من قال حده نصف حد الحر ، وطلاقه تطليقتان ، وإيلاؤه شهران ، ونحو ذلك من أحكامه فغير بعيد أن يقال : تناقض في قوله \" ينكح أربعا \" والله أعلم .\n                                    ",
        "saadi": "وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُواْ فِي ٱلۡيَتَٰمَىٰ فَٱنكِحُواْ مَا طَابَ لَكُم مِّنَ ٱلنِّسَآءِ مَثۡنَىٰ وَثُلَٰثَ وَرُبَٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُواْ فَوَٰحِدَةً أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُكُمۡۚ ذَٰلِكَ أَدۡنَىٰٓ أَلَّا تَعُولُواْ ٣\n                                        \n                                        \n                                        \n                                        أي: وإن خفتم ألا تعدلوا في يتامى النساء اللاتي تحت حجوركم وولايتكم وخفتم أن لا تقوموا بحقهن لعدم محبتكم إياهن، فاعدلوا إلى غيرهن، وانكحوا { مَا طَابَ لَكُم مِّنَ النِّسَاء } أي: ما وقع عليهن اختياركم من ذوات الدين، والمال، والجمال، والحسب، والنسب، وغير ذلك من الصفات الداعية لنكاحهن، فاختاروا على نظركم، ومن أحسن ما يختار من ذلك صفة الدين كما قال النبي صلى الله عليه وسلم: \"تنكح المرأة لأربع لمالها ولجمالها ولحسبها ولدينها فاظفر بذات الدين تَرِبَتْ يمينك\" وفي هذه الآية - أنه ينبغي للإنسان أن يختار قبل النكاح، بل وقد أباح له الشارع النظر إلى مَنْ يريد تزوجها ليكون على بصيرة من أمره. ثم ذكر العدد الذي أباحه من النساء فقال: { مَثْنَى وَثُلَاثَ وَرُبَاعَ } أي: من أحب أن يأخذ اثنتين فليفعل، أو ثلاثا فليفعل، أو أربعا فليفعل، ولا يزيد عليها، لأن الآية سيقت لبيان الامتنان، فلا يجوز الزيادة على غير ما سمى الله تعالى إجماعا. وذلك لأن الرجل قد لا تندفع شهوته بالواحدة، فأبيح له واحدة بعد واحدة، حتى يبلغ أربعا، لأن في الأربع غنية لكل أحد، إلا ما ندر، ومع هذا فإنما يباح له ذلك إذا أمن على نفسه الجور والظلم، ووثق بالقيام بحقوقهن. فإن خاف شيئا من هذا فليقتصر على واحدة، أو على ملك يمينه. فإنه لا يجب عليه القسم في ملك اليمين { ذَلِك } أي: الاقتصار على واحدة أو ما ملكت اليمين { أَدْنَى أَلَّا تَعُولُوا } أي: تظلموا. وفي هذا أن تعرض العبد للأمر الذي يخاف منه الجور والظلم، وعدم القيام بالواجب -ولو كان مباحًا- أنه لا ينبغي له أن يتعرض، له بل يلزم السعة والعافية، فإن العافية خير ما أعطي العبد.\n                                    "
      },
      "originalText": "وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُواْ فِي ٱلۡيَتَٰمَىٰ فَٱنكِحُواْ مَا طَابَ لَكُم مِّنَ ٱلنِّسَآءِ مَثۡنَىٰ وَثُلَٰثَ وَرُبَٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُواْ فَوَٰحِدَةً أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُكُمۡۚ ذَٰلِكَ أَدۡنَىٰٓ أَلَّا تَعُولُواْ ٣"
    },
    {
      "number": 497,
      "text": "وَآتُوا النِّسَاءَ صَدُقَاتِهِنَّ نِحْلَةً ۚ فَإِنْ طِبْنَ لَكُمْ عَنْ شَيْءٍ مِنْهُ نَفْسًا فَكُلُوهُ هَنِيئًا مَرِيئًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 4,
      "juz": 4,
      "manzil": 1,
      "page": 77,
      "ruku": 62,
      "hizbQuarter": 31,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَءَاتُواْ ٱلنِّسَآءَ صَدُقَٰتِهِنَّ نِحۡلَةٗۚ فَإِن طِبۡنَ لَكُمۡ عَن شَيۡءٖ مِّنۡهُ نَفۡسٗا فَكُلُوهُ هَنِيٓ‍ٔٗا مَّرِيٓ‍ٔٗا ٤\n                                    \n                                    \n                                    وقوله : ( وآتوا النساء صدقاتهن نحلة ) قال علي بن أبي طلحة ، عن ابن عباس : النحلة : المهر .\nوقال محمد بن إسحاق ، عن الزهري ، عن عروة ، عن عائشة : نحلة : فريضة . وقال مقاتل وقتادة وابن جريج : نحلة : أي فريضة . زاد ابن جريج : مسماه . وقال ابن زيد : النحلة في كلام العرب : الواجب ، يقول : لا تنكحها إلا بشيء واجب لها ، وليس ينبغي لأحد بعد النبي صلى الله عليه وسلم أن ينكح امرأة إلا بصداق واجب ، ولا ينبغي أن يكون تسمية الصداق كذبا بغير حق .\nومضمون كلامهم : أن الرجل يجب عليه دفع الصداق إلى المرأة حتما ، وأن يكون طيب النفس بذلك ، كما يمنح المنيحة ويعطي النحلة طيبا بها ، كذلك يجب أن يعطي المرأة صداقها طيبا بذلك ، فإن طابت هي له به بعد تسميته أو عن شيء منه فليأكله حلالا طيبا; ولهذا قال [ تعالى ] ( فإن طبن لكم عن شيء منه نفسا فكلوه هنيئا مريئا )\nقال ابن أبي حاتم : حدثنا أحمد بن سنان ، حدثنا عبد الرحمن بن مهدي ، عن سفيان ، عن السدي ، عن يعقوب بن المغيرة بن شعبة ، عن علي قال : إذا اشتكى أحدكم شيئا ، فليسأل امرأته ثلاثة دراهم أو نحو ذلك ، فليبتع بها عسلا ثم ليأخذ ماء السماء فيجتمع هنيئا مريئا شفاء مباركا .\nوقال هشيم ، عن سيار ، عن أبي صالح قال : كان الرجل إذا زوج ابنته أخذ صداقها دونها ، فنهاهم الله عن ذلك ، ونزل : ( وآتوا النساء صدقاتهن نحلة ) رواه ابن أبي حاتم وابن جرير .\nوقال ابن أبي حاتم : حدثنا محمد بن إسماعيل الأحمسي ، حدثنا وكيع ، عن سفيان عن عمير الخثعمي ، عن عبد الملك بن المغيرة الطائفي ، عن عبد الرحمن بن البيلماني قال : قال رسول الله صلى الله عليه وسلم : ( وآتوا النساء صدقاتهن نحلة ) قالوا : يا رسول الله ، فما العلائق بينهم ؟ قال : \" ما تراضى عليه أهلوهم \" .\nوقد روى ابن مردويه من طريق حجاج بن أرطاة ، عن عبد الملك بن المغيرة ، عن عبد الرحمن بن البيلماني عن عمر بن الخطاب قال : خطب رسول الله صلى الله عليه وسلم فقال : \" أنكحوا الأيامى \" ثلاثا ، فقام إليه رجل فقال : يا رسول الله ، ما العلائق بينهم ؟ قال : \" ما تراضى عليه أهلوهم \" .\nابن البيلماني ضعيف ، ثم فيه انقطاع أيضا .\n                                    ",
        "qortoby": "وَءَاتُواْ ٱلنِّسَآءَ صَدُقَٰتِهِنَّ نِحۡلَةٗۚ فَإِن طِبۡنَ لَكُمۡ عَن شَيۡءٖ مِّنۡهُ نَفۡسٗا فَكُلُوهُ هَنِيٓ‍ٔٗا مَّرِيٓ‍ٔٗا ٤\n                                    \n                                    \n                                    قوله تعالى : وآتوا النساء صدقاتهن نحلة فإن طبن لكم عن شيء منه نفسا فكلوه هنيئا مريئا\nفيه عشرة مسائل :\nالأولى : قوله تعالى : وآتوا النساء صدقاتهن الصدقات جمع ، الواحدة صدقة . قال الأخفش : وبنو تميم يقولون صدقة والجمع صدقات ، وإن شئت فتحت وإن شئت أسكنت . قال المازني : يقال صداق المرأة بالكسر ، ولا يقال بالفتح . وحكى يعقوب وأحمد بن يحيى بالفتح ، عن النحاس . والخطاب في هذه الآية للأزواج ؛ قاله ابن عباس وقتادة وابن زيد وابن جريج . أمرهم الله تعالى بأن يتبرعوا بإعطاء المهور نحلة منهم لأزواجهم . وقيل : الخطاب للأولياء ؛ قاله أبو صالح . وكان الولي يأخذ مهر المرأة ولا يعطيها شيئا ، فنهوا عن ذلك وأمروا أن يدفعوا ذلك إليهن . قال في رواية الكلبي : أن أهل الجاهلية كان الولي إذا زوجها فإن كانت معه في العشرة لم يعطها من مهرها كثيرا ولا قليلا ، وإن كانت غريبة حملها على بعير إلى زوجها ولم يعطها شيئا غير ذلك البعير ؛ فنزل : وآتوا النساء صدقاتهن نحلة . وقال المعتمر بن سليمان ، عن أبيه : زعم حضرمي أن المراد بالآية المتشاغرون الذين كانوا يتزوجون امرأة بأخرى ، فأمروا أن يضربوا المهور . والأول أظهر ؛ فإن الضمائر واحدة وهي بجملتها للأزواج فهم المراد ؛ لأنه قال : وإن خفتم ألا تقسطوا في اليتامى إلى قوله : وآتوا النساء صدقاتهن نحلة . وذلك يوجب تناسق الضمائر وأن يكون الأول فيها هو الآخر .\nالثانية : هذه الآية تدل على وجوب الصداق للمرأة ، وهو مجمع عليه ولا خلاف فيه إلا ما روي عن بعض أهل العلم من أهل العراق أن السيد إذا زوج عبده من أمته أنه لا يجب فيه صداق ؛ وليس بشيء ؛ لقوله تعالى وآتوا النساء صدقاتهن نحلة فعم . وقال : فانكحوهن بإذن أهلهن وآتوهن أجورهن بالمعروف . وأجمع العلماء أيضا أنه لا حد لكثيره ، واختلفوا في قليله على ما يأتي بيانه في قوله : وآتيتم إحداهن قنطارا . وقرأ الجمهور \" صدقاتهن \" بفتح الصاد وضم الدال . وقرأ قتادة \" صدقاتهن \" بضم الصاد وسكون الدال . وقرأ النخعي وابن وثاب بضمهما والتوحيد \" صدقتهن \"\nالثالثة : قوله تعالى : نحلة النحلة والنحلة ، بكسر النون وضمها لغتان . وأصلها من العطاء ؛ نحلت فلانا شيئا أعطيته . فالصداق عطية من الله تعالى للمرأة . وقيل : نحلة أي عن طيب نفس من الأزواج من غير تنازع . وقال قتادة : معنى نحلة فريضة واجبة . ابن جريج وابن زيد : فريضة مسماة . قال أبو عبيد : ولا تكون النحلة إلا مسماة معلومة . وقال الزجاج : نحلة تدينا . والنحلة الديانة والملة . يقال . هذا نحلته أي دينه . وهذا يحسن مع كون الخطاب للأولياء الذين كانوا يأخذونه في الجاهلية ، حتى قال بعض النساء في زوجها :\nلا يأخذ الحلوان من بناتنا\nتقول : لا يفعل ما يفعله غيره . فانتزعه الله منهم وأمر به للنساء . و \" نحلة \" منصوبة على أنها حال من الأزواج بإضمار فعل من لفظها تقديره أنحلوهن نحلة . وقيل : هي نصب وقيل على التفسير . وقيل : هي مصدر على غير الصدر في موضع الحال .\nالرابعة : قوله تعالى : فإن طبن لكم عن شيء منه نفسا مخاطبة للأزواج ، ويدل بعمومه على أن هبة المرأة صداقها لزوجها بكرا كانت أو ثيبا جائزة ؛ وبه قال جمهور الفقهاء . ومنع مالك من هبة البكر الصداق لزوجها وجعل ذلك للولي مع أن الملك لها . وزعم الفراء أنه مخاطبة للأولياء ؛ لأنهم كانوا يأخذون الصداق ولا يعطون المرأة منه شيئا ، فلم يبح لهم منه إلا ما طابت به نفس المرأة . والقول الأول أصح ؛ لأنه لم يتقدم للأولياء ذكر ، والضمير في منه عائد على الصداق . وكذلك قال عكرمة وغيره . وسبب الآية فيما ذكر أن قوما تحرجوا أن يرجع إليهم شيء مما دفعوه إلى الزوجات فنزلت فإن طبن لكم .\nالخامسة : واتفق العلماء على أن المرأة المالكة لأمر نفسها إذا وهبت صداقها لزوجها نفذ ذلك عليها ، ولا رجوع لها فيه . إلا أن شريحا رأى الرجوع لها فيه ، واحتج بقوله : فإن طبن لكم عن شيء منه نفسا وإذا كانت طالبة له لم تطب به نفسا . قال ابن العربي : وهذا باطل ؛ لأنها قد طابت وقد أكل فلا كلام لها ؛ إذ ليس المراد صورة الأكل ، وإنما هو كناية عن الإحلال والاستحلال ، وهذا بين .\nالسادسة : فإن شرطت عليه عند عقد النكاح ألا يتزوج عليها ، وحطت عنه لذلك شيئا من صداقها ، ثم تزوج عليها فلا شيء لها عليه في رواية ابن القاسم ؛ لأنها شرطت عليه ما لا يجوز شرطه . كما اشترط أهل بريرة أن تعتقها عائشة والولاء لبائعها ، فصحح النبي صلى الله عليه وسلم العقد وأبطل الشرط . كذلك هاهنا يصح إسقاط بعض الصداق عنه وتبطل الزيجة . قال ابن عبد الحكم : إن كان بقي من صداقها مثل صداق مثلها أو أكثر لم ترجع عليه بشيء ، وإن كانت وضعت عنه شيئا من صداقها فتزوج عليها رجعت عليه بتمام صداق مثلها ؛ لأنه شرط على نفسه شرطا وأخذ عنه عوضا كان لها واجبا أخذه منه ، فوجب عليه الوفاء لقوله عليه السلام : المؤمنون عند شروطهم .\nوفي الآية دليل على أن العتق لا يكون صداقا ؛ لأنه ليس بمال ؛ إذ لا يمكن للمرأة هبته ولا الزوج أكله . وبه قال مالك وأبو حنيفة وزفر ومحمد والشافعي . وقال أحمد بن حنبل وإسحاق ويعقوب : يكون صداقا ولا مهر لها غير العتق ؛ على حديث صفية - رواه الأئمة - أن النبي صلى الله عليه وسلم أعتقها وجعل عتقها صداقها . وروي عن أنس أنه فعله ، وهو راوي حديث صفية . وأجاب الأولون بأن قالوا : لا حجة في حديث صفية ؛ لأن النبي صلى الله عليه وسلم كان مخصوصا في النكاح بأن يتزوج بغير صداق ، وقد أراد زينب فحرمت على زيد فدخل عليها بغير ولي ولا صداق . فلا ينبغي الاستدلال بمثل هذا ؛ والله أعلم .\nالثامنة : قوله تعالى : نفسا قيل : هو منصوب على البيان . ولا يجيز سيبويه ولا الكوفيون أن يتقدم ما كان منصوبا على البيان ، وأجاز ذلك المازني وأبو العباس المبرد إذا كان العامل فعلا . وأنشد :\nوما كان نفسا بالفراق تطيب\nوفي التنزيل خشعا أبصارهم يخرجون فعلى هذا يجوز \" شحما تفقأت . ووجها حسنت \" . وقال أصحاب سيبويه : إن نفسا منصوبة بإضمار فعل تقديره أعني نفسا ، وليست منصوبة على التمييز ؛ وإذا كان هذا فلا حجة فيه . وقال الزجاج . الرواية :\nوما كان نفسي . . .\nواتفق الجميع على أنه لا يجوز تقديم المميز إذا كان العامل غير متصرف كعشرين درهما .\nالتاسعة : قوله تعالى : فكلوه ليس المقصود صورة الأكل ، وإنما المراد به الاستباحة بأي طريق كان ، وهو المعني بقوله في الآية التي بعدها إن الذين يأكلون أموال اليتامى ظلما . وليس المراد نفس الأكل ؛ إلا أن الأكل لما كان أوفى أنواع التمتع بالمال عبر عن التصرفات بالأكل . ونظيره قوله تعالى : إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله وذروا البيع يعلم أن صورة البيع غير مقصودة ، وإنما المقصود ما يشغله عن ذكر الله تعالى مثل النكاح وغيره ؛ ولكن ذكر البيع لأنه أهم ما يشتغل به عن ذكر الله تعالى .\nالعاشرة : قوله تعالى : هنيئا مريئا منصوب على الحال من الهاء في كلوه وقيل : نعت لمصدر محذوف ، أي أكلا هنيئا بطيب الأنفس . هنأه الطعام والشراب يهنؤه ، وما كان هنيئا ؛ ولقد هنؤ ، والمصدر الهنء . وكل ما لم يأت بمشقة ولا عناء فهو هنيء . وهنيء اسم فاعل من هنؤ كظريف من ظرف . وهنئ يهنأ فهو هنئ على فعل كزمن . وهنأني الطعام ومرأني على الإتباع ؛ فإذا لم يذكر \" هنأني \" قلت : أمرأني الطعام بالألف ، أي انهضم . قال أبو علي : وهذا كما جاء في الحديث ارجعن مأزورات غير مأجورات . فقلبوا الواو من ( موزورات ) ألفا إتباعا للفظ مأجورات . وقال أبو العباس عن ابن الأعرابي : يقال هنيء وهنأني ومرأني وأمرأني ولا يقال مرئني ؛ حكاه الهروي . وحكى القشيري أنه يقال : هنئني ومرئني بالكسر يهنأني ويمرأني ، وهو قليل . وقيل : هنيئا لا إثم فيه ، ومريئا لا داء فيه . قال كثير :\nهنيئا مريئا غير داء مخامر لعزة من أعراضنا ما استحلت\nودخل رجل على علقمة وهو يأكل شيئا وهبته امرأته من مهرها فقال له : كل من الهنيء المريء . وقيل : الهنيء الطيب المساغ الذي لا ينغصه شيء ، والمريء المحمود العاقبة ، التام الهضم الذي لا يضر ولا يؤذي . يقول : لا تخافون في الدنيا به مطالبة ، ولا في الآخرة تبعة . يدل عليه ما روى ابن عباس ، عن النبي صلى الله عليه وسلم أنه سئل عن هذه الآية فإن طبن لكم عن شيء منه نفسا فكلوه فقال : إذا جادت لزوجها بالعطية طائعة غير مكرهة لا يقضي به عليكم سلطان ، ولا يؤاخذكم الله تعالى به في الآخرة وروي عن علي بن أبي طالب رضي الله عنه قال : ( إذا اشتكى أحدكم شيئا فليسأل امرأته درهما من صداقها ثم ليشتر به عسلا فليشربه بماء السماء ؛ فيجمع الله عز وجل له الهنيء والمريء والماء المبارك ) . والله أعلم .\n                                    ",
        "saadi": "وَءَاتُواْ ٱلنِّسَآءَ صَدُقَٰتِهِنَّ نِحۡلَةٗۚ فَإِن طِبۡنَ لَكُمۡ عَن شَيۡءٖ مِّنۡهُ نَفۡسٗا فَكُلُوهُ هَنِيٓ‍ٔٗا مَّرِيٓ‍ٔٗا ٤\n                                        \n                                        \n                                        \n                                        ولما كان كثير من الناس يظلمون النساء ويهضمونـهن حقوقهن، خصوصا الصداق الذي يكون شيئا كثيرًا، ودفعة واحدة، يشق دفعه للزوجة، أمرهم وحثهم على إيتاء النساء { صَدُقَاتِهِنَّ } أي: مهورهن { نِحْلَةً } أي: عن طيب نفس، وحال طمأنينة، فلا تمطلوهن أو تبخسوا منه شيئا. وفيه: أن المهر يدفع إلى المرأة إذا كانت مكلفة، وأنـها تملكه بالعقد، لأنه أضافه إليها، والإضافة تقتضي التمليك. { فَإِنْ طِبْنَ لَكُم عَنْ شَيْءٍ مِّنْهُ } أي: من الصداق { نَفْسًا } بأن سمحن لكم عن رضا واختيار بإسقاط شيء منه، أو تأخيره أو المعاوضة عنه. { فَكُلُوهُ هَنِيئًا مَرِيئًا } أي: لا حرج عليكم في ذلك ولا تبعة. وفيه دليل على أن للمرأة التصرف في مالها -ولو بالتبرع- إذا كانت رشيدة، فإن لم تكن كذلك فليس لعطيتها حكم، وأنه ليس لوليها من الصداق شيء، غير ما طابت به. وفي قوله: { فَانْكِحُوا مَا طَابَ لَكُم مِّنَ النِّسَاء } دليل على أن نكاح الخبيثة غير مأمور به، بل منهي عنه كالمشركة، وكالفاجرة، كما قال تعالى: { وَلَا تَنكِحُوا الْمُشْرِكَاتِ حَتَّى يُؤْمِنَّ } وقال: { وَالزَّانِيَةُ لَا يَنكِحُهَا إِلَّا زَانٍ أَوْ مُشْرِكٌ }\n                                    "
      },
      "originalText": "وَءَاتُواْ ٱلنِّسَآءَ صَدُقَٰتِهِنَّ نِحۡلَةٗۚ فَإِن طِبۡنَ لَكُمۡ عَن شَيۡءٖ مِّنۡهُ نَفۡسٗا فَكُلُوهُ هَنِيٓ‍ٔٗا مَّرِيٓ‍ٔٗا ٤"
    },
    {
      "number": 498,
      "text": "وَلَا تُؤْتُوا السُّفَهَاءَ أَمْوَالَكُمُ الَّتِي جَعَلَ اللَّهُ لَكُمْ قِيَامًا وَارْزُقُوهُمْ فِيهَا وَاكْسُوهُمْ وَقُولُوا لَهُمْ قَوْلًا مَعْرُوفًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 5,
      "juz": 4,
      "manzil": 1,
      "page": 77,
      "ruku": 62,
      "hizbQuarter": 31,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تُؤۡتُواْ ٱلسُّفَهَآءَ أَمۡوَٰلَكُمُ ٱلَّتِي جَعَلَ ٱللَّهُ لَكُمۡ قِيَٰمٗا وَٱرۡزُقُوهُمۡ فِيهَا وَٱكۡسُوهُمۡ وَقُولُواْ لَهُمۡ قَوۡلٗا مَّعۡرُوفٗا ٥\n                                    \n                                    \n                                    ينهى تعالى عن تمكين السفهاء من التصرف في الأموال التي جعلها الله للناس قياما ، أي : تقوم بها معايشهم من التجارات وغيرها . ومن هاهنا يؤخذ الحجر على السفهاء ، وهم أقسام : فتارة يكون الحجر للصغر; فإن الصغير مسلوب العبارة . وتارة يكون الحجر للجنون ، وتارة لسوء التصرف لنقص العقل أو الدين ، وتارة يكون الحجر للفلس ، وهو ما إذا أحاطت الديون برجل وضاق ماله عن وفائها ، فإذا سأل الغرماء الحاكم الحجر عليه حجر عليه .\nوقد قال الضحاك ، عن ابن عباس في قوله : ( ولا تؤتوا السفهاء أموالكم ) قال : هم بنوك والنساء ، وكذا قال ابن مسعود ، والحكم بن عتيبة والحسن ، والضحاك : هم النساء والصبيان .\nوقال سعيد بن جبير : هم اليتامى . وقال مجاهد وعكرمة وقتادة : هم النساء .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا هشام بن عمار ، حدثنا صدقة بن خالد ، حدثنا عثمان بن أبي العائكة ، عن علي بن يزيد ، عن القاسم ، عن أبي أمامة قال : قال رسول الله صلى الله عليه وسلم : \" وإن النساء السفهاء إلا التي أطاعت قيمها \" .\nورواه ابن مردويه مطولا .\nوقال ابن أبي حاتم : ذكر عن مسلم بن إبراهيم ، حدثنا حرب بن سريج عن معاوية بن قرة عن أبي هريرة ( ولا تؤتوا السفهاء أموالكم ) قال : الخدم ، وهم شياطين الإنس وهم الخدم .\nوقوله : ( وارزقوهم فيها واكسوهم وقولوا لهم قولا معروفا ) قال علي بن أبي طلحة ، عن ابن عباس يقول [ تعالى ] لا تعمد إلى مالك وما خولك الله ، وجعله معيشة ، فتعطيه امرأتك أو بنيك ، ثم تنظر إلى ما في أيديهم ، ولكن أمسك مالك وأصلحه ، وكن أنت الذي تنفق عليهم من كسوتهم ومؤنتهم ورزقهم .\nوقال ابن جرير : حدثنا ابن المثنى : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن فراس ، عن الشعبي ، عن أبي بردة ، عن أبي موسى قال : ثلاثة يدعون الله فلا يستجيب لهم : رجل كانت له امرأة سيئة الخلق فلم يطلقها ، ورجل أعطى ماله سفيها ، وقد قال : ( ولا تؤتوا السفهاء أموالكم ) ورجل كان له على رجل دين فلم يشهد عليه .\nوقال مجاهد : ( وقولوا لهم قولا معروفا ) يعني في البر والصلة .\nوهذه الآية الكريمة انتظمت الإحسان إلى العائلة ، ومن تحت الحجر بالفعل ، من الإنفاق في الكساوى والإنفاق والكلام الطيب ، وتحسين الأخلاق .\n                                    ",
        "qortoby": "وَلَا تُؤۡتُواْ ٱلسُّفَهَآءَ أَمۡوَٰلَكُمُ ٱلَّتِي جَعَلَ ٱللَّهُ لَكُمۡ قِيَٰمٗا وَٱرۡزُقُوهُمۡ فِيهَا وَٱكۡسُوهُمۡ وَقُولُواْ لَهُمۡ قَوۡلٗا مَّعۡرُوفٗا ٥\n                                    \n                                    \n                                    قوله تعالى : ولا تؤتوا السفهاء أموالكم التي جعل الله لكم قياما وارزقوهم فيها واكسوهم وقولوا لهم قولا معروفا\nفيه عشر مسائل :\nالأولى : لما أمر الله تعالى بدفع أموال اليتامى إليهم في قوله : وآتوا اليتامى أموالهم وإيصال الصدقات إلى الزوجات ، بين أن السفيه وغير البالغ لا يجوز دفع ماله إليه . فدلت الآية على ثبوت الوصي والولي والكفيل للأيتام . وأجمع أهل العلم على أن الوصية إلى المسلم الحر الثقة العدل جائزة . واختلفوا في الوصية إلى المرأة الحرة ؛ فقال عوام أهل العلم : الوصية لها جائزة . واحتج أحمد بأن عمر رضي الله عنه أوصى إلى حفصة . وروي عن عطاء بن أبي رباح أنه قال في رجل أوصى إلى امرأته قال : لا تكون المرأة وصيا ؛ فإن فعل حولت إلى رجل من قومه . واختلفوا في الوصية إلى العبد ؛ فمنعه الشافعي وأبو ثور ومحمد ويعقوب . وأجازه مالك والأوزاعي وابن عبد الحكم . وهو قول النخعي إذا أوصى إلى عبده . وقد مضى القول في هذا في \" البقرة \" مستوفى .\nالثانية : قوله تعالى : السفهاء قد مضى في \" البقرة \" معنى السفه لغة . واختلف العلماء في هؤلاء السفهاء ، من هم ؟ فروى سالم الأفطس ، عن سعيد بن جبير قال : هم اليتامى لا تؤتوهم أموالكم . قال النحاس : وهذا من أحسن ما قيل في الآية . وروى إسماعيل بن أبي خالد ، عن أبي مالك قال : هم الأولاد الصغار ، لا تعطوهم أموالكم فيفسدوها وتبقوا بلا شيء . وروى سفيان ، عن حميد الأعرج ، عن مجاهد قال : هم النساء . قال النحاس وغيره : وهذا القول لا يصح ؛ إنما تقول العرب في النساء سفائه أو سفيهات ؛ لأنه الأكثر في جمع فعيلة . ويقال : لا تدفع مالك مضاربة ولا إلى وكيل لا يحسن التجارة . وروي عن عمر أنه قال : من لم يتفقه فلا يتجر في سوقنا ؛ فذلك قوله تعالى : ولا تؤتوا السفهاء أموالكم يعني الجهال بالأحكام . ويقال : لا تدفع إلى الكفار ؛ ولهذا كره العلماء أن يوكل المسلم ذميا بالشراء والبيع ، أو يدفع إليه مضاربة . وقال أبو موسى الأشعري رضي الله عنه : ( السفهاء هنا كل من يستحق الحجر ) . وهذا جامع . وقال ابن خويز منداد : وأما الحجر على السفيه فالسفيه له أحوال : حال يحجر عليه لصغره ، وحالة لعدم عقله بجنون أو غيره ، وحالة لسوء نظره لنفسه في ماله . فأما المغمى عليه فاستحسن مالك ألا يحجر عليه لسرعة زوال ما به . والحجر يكون مرة في حق الإنسان ومرة في حق غيره ؛ فأما المحجور عليه في حق نفسه من ذكرنا . والمحجور عليه في حق غيره العبد والمديان والمريض في الثلثين ، والمفلس وذات الزوج لحق الزوج ، والبكر في حق نفسها . فأما الصغير والمجنون فلا خلاف في الحجر عليهما . وأما الكبير فلأنه لا يحسن النظر لنفسه في ماله ، ولا يؤمن منه إتلاف ماله في غير وجه ، فأشبه الصبي ؛ وفيه خلاف يأتي . ولا فرق بين أن يتلف ماله في المعاصي أو القرب والمباحات . واختلف أصحابنا إذا أتلف ماله في القرب ؛ فمنهم من حجر عليه ، ومنهم من لم يحجر عليه . والعبد لا خلاف فيه . والمديان ينزع ما بيده لغرمائه ؛ لإجماع الصحابة ، وفعل عمر ذلك بأسيفع جهينة ؛ ذكره مالك في الموطأ . والبكر ما دامت في الخدر محجور عليها ؛ لأنها لا تحسن النظر لنفسها . حتى إذا تزوجت ودخل إليها الناس ، وخرجت وبرز وجهها عرفت المضار من المنافع . وأما ذات الزوج فلأن رسول الله صلى الله عليه وسلم قال : لا يجوز لامرأة ملك زوجها عصمتها قضاء في مالها إلا في ثلثها .\nقلت : وأما الجاهل بالأحكام وإن كان غير محجور عليه لتنميته لماله وعدم تدبيره ، فلا يدفع إليه المال ؛ لجهله بفاسد البياعات وصحيحها وما يحل وما يحرم منها . وكذلك الذمي مثله في الجهل بالبياعات ولما يخاف من معاملته بالربا وغيره . والله أعلم .\nواختلفوا في وجه إضافة المال إلى المخاطبين على هذا ، وهي للسفهاء ؛ فقيل : أضافها إليهم لأنها بأيديهم وهم الناظرون فيها فنسبت إليهم اتساعا ؛ كقوله تعالى : فسلموا على أنفسكم وقوله فاقتلوا أنفسكم .\nوقيل : أضافها إليهم لأنها من جنس أموالهم ؛ فإن الأموال جعلت مشتركة بين الخلق تنتقل من يد إلى يد ، ومن ملك إلى ملك ، أي هي لهم إذا احتاجوها كأموالكم التي تقي أعراضكم وتصونكم وتعظم أقداركم ، وبها قوام أمركم .\nوقول ثان قاله أبو موسى الأشعري وابن عباس والحسن وقتادة : ( أن المراد أموال المخاطبين حقيقة ) . قال ابن عباس : ( لا تدفع مالك الذي هو سبب معيشتك إلى امرأتك وابنك وتبقى فقيرا تنظر إليهم وإلى ما في أيديهم ؛ بل كن أنت الذي تنفق عليهم ) . فالسفهاء على هذا هم النساء والصبيان ؛ صغار ولد الرجل وامرأته . وهذا يخرج مع قول مجاهد وأبي مالك في السفهاء .\nالثالثة : ودلت الآية على جواز الحجر على السفيه ؛ لأمر الله عز وجل بذلك في قوله : ولا تؤتوا السفهاء أموالكم وقال فإن كان الذي عليه الحق سفيها أو ضعيفا . فأثبت الولاية على السفيه كما أثبتها على الضعيف . وكان معنى الضعيف راجعا إلى الصغير ، ومعنى السفيه إلى الكبير البالغ ؛ لأن السفه اسم ذم ولا يذم الإنسان على ما لم يكتسبه ، والقلم مرفوع عن غير البالغ ، فالذم والحرج منفيان عنه ؛ قاله الخطابي . الرابعة : واختلف العلماء في أفعال السفيه قبل الحجر عليه ؛ فقال مالك وجميع أصحابه غير ابن القاسم : إن فعل السفيه وأمره كله جائز حتى يضرب الإمام على يده . وهو قول الشافعي وأبي يوسف . وقال ابن القاسم : أفعاله غير جائزة وإن لم يضرب عليه الإمام . وقال أصبغ : إن كان ظاهر السفه فأفعاله مردودة ، وإن كان غير ظاهر السفه فلا ترد أفعاله حتى يحجر عليه الإمام . واحتج سحنون لقول مالك بأن قال : لو كانت أفعال السفيه مردودة قبل الحجر ما احتاج السلطان أن يحجر على أحد . وحجة ابن القاسم ما رواه البخاري من حديث جابر أن رجلا أعتق عبدا ليس له مال غيره فرده النبي صلى الله عليه وسلم ولم يكن حجر عليه قبل ذلك .\nالخامسة : واختلفوا في الحجر على الكبير ؛ فقال مالك وجمهور الفقهاء : يحجر عليه . وقال أبو حنيفة : لا يحجر على من بلغ عاقلا إلا أن يكون مفسدا لماله ؛ فإذا كان كذلك منع من تسليم المال إليه حتى يبلغ خمسا وعشرين سنة ، فإذا بلغها سلم إليه بكل حال ، سواء كان مفسدا أو غير مفسد ؛ لأنه يحبل منه لاثنتي عشرة سنة ، ثم يولد له لستة أشهر فيصير جدا وأبا ، وأنا أستحيي أن أحجر على من يصلح أن يكون جدا . وقيل عنه : إن في مدة المنع من المال إذا بلغ مفسدا ينفذ تصرفه على الإطلاق ، وإنما يمنع من تسليم المال احتياطا . وهذا كله ضعيف في النظر والأثر . وقد روى الدارقطني : حدثنا محمد بن أحمد بن الحسن الصواف أخبرنا حامد بن شعيب أخبرنا شريح بن يونس أخبرنا يعقوب بن إبراهيم - هو أبو يوسف القاضي - أخبرنا هشام بن عروة ، عن أبيه أن عبد الله بن جعفر أتى الزبير فقال : إني اشتريت بيع كذا وكذا ، وإن عليا يريد أن يأتي أمير المؤمنين فيسأله أن يحجر علي فيه . فقال الزبير : أنا شريكك في البيع . فأتى علي عثمان فقال : إن ابن جعفر اشترى بيع كذا وكذا فاحجر عليه . فقال الزبير : فأنا شريكه في البيع . فقال عثمان : كيف أحجر على رجل في بيع شريكه فيه الزبير ؟ قال يعقوب : أنا آخذ بالحجر وأراه ، وأحجر وأبطل بيع المحجور عليه وشراءه ، وإذا اشترى أو باع قبل الحجر أجزت بيعه . قال يعقوب بن إبراهيم : وإن أبا حنيفة لا يحجر ولا يأخذ بالحجر . فقول عثمان : كيف أحجر على رجل ، دليل على جواز الحجر على الكبير ؛ فإن عبد الله بن جعفر ولدته أمه بأرض الحبشة ، وهو أول مولود ولد في الإسلام بها ، وقدم مع أبيه على النبي صلى الله عليه وسلم عام خيبر فسمع منه وحفظ عنه . وكانت خيبر سنة خمس من الهجرة . وهذا يرد على أبي حنيفة قوله . وستأتي حجته إن شاء الله تعالى .\nالسادسة : قوله تعالى : التي جعل الله لكم قياما أي لمعاشكم وصلاح دينكم .\nوفي التي ثلاث لغات : التي واللت بكسر التاء واللت بإسكانها . وفي تثنيتها أيضا ثلاث لغات : اللتان واللتا بحذف النون واللتان بشد النون . وأما الجمع فتأتي لغاته في موضعه من هذه السورة إن شاء الله تعالى .\nوالقيام والقوام : ما يقيمك بمعنى . يقال : فلان قيام أهله وقوام بيته ، وهو الذي يقيم شأنه ، أي يصلحه . ولما انكسرت القاف من قوام أبدلوا الواو ياء . وقراءة أهل المدينة \" قيما \" بغير ألف . قال الكسائي والفراء : قيما وقواما بمعنى قياما ، وانتصب عندهما على المصدر . أي ولا تؤتوا السفهاء أموالكم التي تصلح بها أموركم فيقوموا بها قياما . وقال الأخفش : المعنى قائمة بأموركم . يذهب إلى أنها جمع . وقال البصريون : قيما جمع قيمة ؛ كديمة وديم ، أي جعلها الله قيمة للأشياء . وخطأ أبو علي هذا القول وقال : هي مصدر كقيام وقوام وأصلها قوم ، ولكن شذت في الرد إلى الياء كما شذ قولهم : جياد في جمع جواد ونحوه . وقوما وقواما وقياما معناها ثباتا في صلاح الحال ودواما في ذلك . وقرأ الحسن والنخعي \" اللاتي \" جعل على جمع التي ، وقراءة العامة \" التي \" على لفظ الجماعة . قال الفراء : الأكثر في كلام العرب \" النساء اللواتي ، والأموال التي \" وكذلك غير الأموال ؛ ذكره النحاس :\nالسابعة : قوله تعالى : وارزقوهم فيها واكسوهم قيل : معناه اجعلوا لهم فيها أو افرضوا لهم فيها . وهذا فيمن يلزم الرجل نفقته وكسوته من زوجته وبنيه الأصاغر . فكان هذا دليلا على وجوب نفقة الولد على الوالد والزوجة على زوجها . وفي البخاري ، عن أبي هريرة رضي الله عنه قال : قال النبي صلى الله عليه وسلم : أفضل الصدقة ما ترك غنى واليد العليا خير من اليد السفلى وابدأ بمن تعول تقول المرأة : إما أن تطعمني وإما أن تطلقني ويقول العبد أطعمني واستعملني ويقول الابن أطعمني إلى من تدعني ؟ فقالوا : يا أبا هريرة ، سمعت هذا من رسول الله صلى الله عليه وسلم ؟ قال : لا ، هذا من كيس أبي هريرة ! . قال المهلب : النفقة على الأهل والعيال واجبة بإجماع ؛ وهذا الحديث حجة في ذلك .\nالثامنة : قال ابن المنذر : واختلفوا في نفقة من بلغ من الأبناء ولا مال له ولا كسب ؛ فقالت طائفة : على الأب أن ينفق على ولده الذكور حتى يحتلموا ، وعلى النساء حتى يتزوجن ويدخل بهن . فإن طلقها بعد البناء أو مات عنها فلا نفقة لها على أبيها . وإن طلقها قبل البناء فهي على نفقتها .\nالتاسعة : ولا نفقة لولد الولد على الجد ؛ هذا قول مالك . وقالت طائفة : ينفق على ولد ولده حتى يبلغوا الحلم والمحيض . ثم لا نفقة عليه إلا أن يكونوا زمنى ، وسواء في ذلك الذكور والإناث ما لم يكن لهم أموال ، وسواء في ذلك ولده أو ولد ولده وإن سفلوا ما لم يكن لهم أب دونه يقدر على النفقة عليهم ؛ هذا قول الشافعي . وأوجبت طائفة النفقة لجميع الأطفال والبالغين من الرجال والنساء إذا لم يكن لهم أموال يستغنون بها عن نفقة الوالد ؛ على ظاهر قوله عليه السلام لهند : خذي ما يكفيك وولدك بالمعروف . وفي حديث أبي هريرة يقول الابن أطعمني إلى من تدعني ؟ يدل على أنه إنما يقول ذلك من لا طاقة له على الكسب والتحرف . ومن بلغ سن الحلم فلا يقول ذلك ؛ لأنه قد بلغ حد السعي على نفسه والكسب لها ، بدليل قوله تعالى : حتى إذا بلغوا النكاح الآية . فجعل بلوغ النكاح حدا في ذلك . وفي قوله : تقول المرأة إما أن تطعمني وإما أن تطلقني يرد على من قال : لا يفرق بالإعسار ويلزم المرأة الصبر ؛ وتتعلق النفقة بذمته بحكم الحاكم . هذا قول عطاء والزهري . وإليه ذهب الكوفيون متمسكين بقوله تعالى : وإن كان ذو عسرة فنظرة إلى ميسرة . قالوا : فوجب أن ينظر إلى أن يوسر . وقوله تعالى : وأنكحوا الأيامى منكم الآية . قالوا : فندب تعالى إلى إنكاح الفقير ؛ فلا يجوز أن يكون الفقر سببا للفرقة وهو مندوب منعه إلى النكاح . ولا حجة لهم في هذه الآية على ما يأتي بيانه في موضعها . والحديث نص في موضع الخلاف . وقيل : الخطاب لولي اليتيم لينفق عليه من ماله الذي له تحت نظره ؛ على ما تقدم من الخلاف في إضافة المال . فالوصي ينفق على اليتيم على قدر ماله وحاله ؛ فإن كان صغيرا وماله كثير اتخذ له ظئرا وحواضن ووسع عليه في النفقة . وإن كان كبيرا قدر له ناعم اللباس وشهي الطعام والخدم . وإن كان دون ذلك فبحسبه . وإن كان دون ذلك فخشن الطعام واللباس قدر الحاجة . فإن كان اليتيم فقيرا لا مال له وجب على الإمام القيام به من بيت المال ؛ فإن لم يفعل الإمام وجب ذلك على المسلمين الأخص به فالأخص . وأمه أخص به فيجب عليها إرضاعه والقيام به . ولا ترجع عليه ولا على أحد . وقد مضى في البقرة عند قوله : والوالدات يرضعن أولادهن .\nالعاشرة : قوله تعالى : وقولوا لهم قولا معروفا أراد تليين الخطاب والوعد الجميل . واختلف في القول المعروف ؛ فقيل : معناه ادعوا لهم : بارك الله فيكم ، وحاطكم وصنع لكم ، وأنا ناظر لك ، وهذا الاحتياط يرجع نفعه إليك . وقيل : معناه وعدوهم وعدا حسنا ؛ أي إن رشدتم دفعنا إليكم أموالكم . ويقول الأب لابنه : مالي إليك مصيره ، وأنت إن شاء الله صاحبه إذا ملكت رشدك وعرفت تصرفك .\n                                    ",
        "saadi": "وَلَا تُؤۡتُواْ ٱلسُّفَهَآءَ أَمۡوَٰلَكُمُ ٱلَّتِي جَعَلَ ٱللَّهُ لَكُمۡ قِيَٰمٗا وَٱرۡزُقُوهُمۡ فِيهَا وَٱكۡسُوهُمۡ وَقُولُواْ لَهُمۡ قَوۡلٗا مَّعۡرُوفٗا ٥\n                                        \n                                        \n                                        \n                                        وقوله تعالى: { ولا تؤتوا السفهاء أموالكم التي جعل الله لكم قياما وارزقوهم فيها واكسوهم وقولوا لهم قولا معروفا } السفهاء: جمع \"سفيه\" وهو: من لا يحسن التصرف في المال، إما لعدم عقله كالمجنون والمعتوه، ونحوهما، وإما لعدم رشده كالصغير وغير الرشيد. فنهى الله الأولياء أن يؤتوا هؤلاء أموالهم خشية إفسادها وإتلافها، لأن الله جعل الأموال قياما لعباده في مصالح دينهم ودنياهم، وهؤلاء لا يحسنون القيام عليها وحفظها، فأمر الولي أن لا يؤتيهم إياها، بل يرزقهم منها ويكسوهم، ويبذل منها ما يتعلق بضروراتهم وحاجاتهم الدينية والدنيوية، وأن يقولوا لهم قولا معروفا، بأن يعدوهم -إذا طلبوها- أنهم سيدفعونها لهم بعد رشدهم، ونحو ذلك، ويلطفوا لهم في الأقوال جبرًا لخواطرهم. وفي إضافته تعالى الأموال إلى الأولياء، إشارة إلى أنه يجب عليهم أن يعملوا في أموال السفهاء ما يفعلونه في أموالهم، من الحفظ والتصرف وعدم التعريض للأخطار. وفي الآية دليل على أن نفقة المجنون والصغير والسفيه في مالهم، إذا كان لهم مال، لقوله: { وَارْزُقُوهُمْ فِيهَا وَاكْسُوهُمْ } وفيه دليل على أن قول الولي مقبول فيما يدعيه من النفقة الممكنة والكسوة؛ لأن الله جعله مؤتمنا على مالهم فلزم قبول قول الأمين.\n                                    "
      },
      "originalText": "وَلَا تُؤۡتُواْ ٱلسُّفَهَآءَ أَمۡوَٰلَكُمُ ٱلَّتِي جَعَلَ ٱللَّهُ لَكُمۡ قِيَٰمٗا وَٱرۡزُقُوهُمۡ فِيهَا وَٱكۡسُوهُمۡ وَقُولُواْ لَهُمۡ قَوۡلٗا مَّعۡرُوفٗا ٥"
    },
    {
      "number": 499,
      "text": "وَابْتَلُوا الْيَتَامَىٰ حَتَّىٰ إِذَا بَلَغُوا النِّكَاحَ فَإِنْ آنَسْتُمْ مِنْهُمْ رُشْدًا فَادْفَعُوا إِلَيْهِمْ أَمْوَالَهُمْ ۖ وَلَا تَأْكُلُوهَا إِسْرَافًا وَبِدَارًا أَنْ يَكْبَرُوا ۚ وَمَنْ كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ ۖ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ ۚ فَإِذَا دَفَعْتُمْ إِلَيْهِمْ أَمْوَالَهُمْ فَأَشْهِدُوا عَلَيْهِمْ ۚ وَكَفَىٰ بِاللَّهِ حَسِيبًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 6,
      "juz": 4,
      "manzil": 1,
      "page": 77,
      "ruku": 62,
      "hizbQuarter": 31,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱبۡتَلُواْ ٱلۡيَتَٰمَىٰ حَتَّىٰٓ إِذَا بَلَغُواْ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدٗا فَٱدۡفَعُوٓاْ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡۖ وَلَا تَأۡكُلُوهَآ إِسۡرَافٗا وَبِدَارًا أَن يَكۡبَرُواْۚ وَمَن كَانَ غَنِيّٗا فَلۡيَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِيرٗا فَلۡيَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡ فَأَشۡهِدُواْ عَلَيۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا ٦\n                                    \n                                    \n                                    وقوله تعالى : ( وابتلوا اليتامى ) قال ابن عباس ، ومجاهد ، والحسن ، والسدي ، ومقاتل بن حيان : أي اختبروهم ( حتى إذا بلغوا النكاح ) قال مجاهد : يعني : الحلم . قال الجمهور من العلماء : البلوغ في الغلام تارة يكون بالحلم ، وهو أن يرى في منامه ما ينزل به الماء الدافق الذي يكون منه الولد . وقد روى أبو داود في سننه عن أمير المؤمنين علي بن أبي طالب ، رضي الله عنه ، قال : حفظت من رسول الله صلى الله عليه وسلم : \" لا يتم بعد احتلام ولا صمات يوم إلى الليل \" .\nوفي الحديث الآخر عن عائشة وغيرها من الصحابة ، رضي الله عنهم ، عن النبي صلى الله عليه وسلم قال : \" رفع القلم عن ثلاثة : عن الصبي حتى يحتلم ، وعن النائم حتى يستيقظ ، وعن المجنون حتى يفيق \" أو يستكمل خمس عشرة سنة ، وأخذوا ذلك من الحديث الثابت في الصحيحين عن عبد الله بن عمر قال : عرضت على النبي صلى الله عليه وسلم يوم أحد وأنا ابن أربع عشرة ، فلم يجزني ، وعرضت عليه يوم الخندق وأنا ابن خمس عشرة فأجازني ، فقال أمير المؤمنين عمر بن عبد العزيز - لما بلغه هذا الحديث - إن هذا الفرق بين الصغير والكبير .\nواختلفوا في إنبات الشعر الخشن حول الفرج ، وهو الشعرة ، هل تدل على بلوغ أم لا ؟ على ثلاثة أقوال ، يفرق في الثالث بين صبيان المسلمين ، فلا يدل على ذلك لاحتمال المعالجة ، وبين صبيان أهل الذمة فيكون بلوغا في حقهم ; لأنه لا يتعجل بها إلا ضرب الجزية عليه ، فلا يعالجها . والصحيح أنها بلوغ في حق الجميع لأن هذا أمر جبلي يستوي فيه الناس ، واحتمال المعالجة بعيد ، ثم قد دلت السنة على ذلك في الحديث الذي رواه الإمام أحمد ، عن عطية القرظي ، رضي الله عنه قال : عرضنا على رسول الله صلى الله عليه وسلم يوم قريظة فكان من أنبت قتل ، ومن لم ينبت خلي سبيله ، فكنت فيمن لم ينبت ، فخلى سبيلي .\nوقد أخرجه أهل السنن الأربعة بنحوه وقال الترمذي : حسن صحيح . وإنما كان كذلك; لأن سعد بن معاذ ، رضي الله عنه ، كان قد حكم فيهم بقتل المقاتلة وسبي الذرية .\nوقال الإمام أبو عبيد القاسم بن سلام في كتاب \" الغريب \" : حدثنا ابن علية ، عن إسماعيل بن أمية ، عن محمد بن يحيى بن حيان ، عن عمر : أن غلاما ابتهر جارية في شعره ، فقال عمر ، رضي الله عنه : انظروا إليه . فلم يوجد أنبت ، فدرأ عنه الحد . قال أبو عبيد : ابتهرها : أي قذفها ، والابتهار أن يقول : فعلت بها وهو كاذب فإن كان صادقا فهو الابتيار ، قال الكميت في شعره .\nقبيح بمثلي نعت الفتاة إما ابتهارا وإما ابتيارا\nوقوله : ( فإن آنستم منهم رشدا فادفعوا إليهم أموالهم ) قال سعيد بن جبير : يعني : صلاحا في دينهم وحفظا لأموالهم . وكذا روي عن ابن عباس ، والحسن البصري ، وغير واحد من الأئمة . وهكذا قال الفقهاء متى بلغ الغلام مصلحا لدينه وماله ، انفك الحجر عنه ، فيسلم إليه ماله الذي تحت يد وليه بطريقه .\nوقوله : ( ولا تأكلوها إسرافا وبدارا أن يكبروا ) ينهى تعالى عن أكل أموال اليتامى من غير حاجة ضرورية إسرافا ومبادرة قبل بلوغهم .\nثم قال تعالى : ( ومن كان غنيا فليستعفف ) [ أي ] من كان في غنية عن مال اليتيم فليستعفف عنه ، ولا يأكل منه شيئا . قال الشعبي : هو عليه كالميتة والدم .\n( ومن كان فقيرا فليأكل بالمعروف ) قال ابن أبي حاتم : حدثنا الأشج ، حدثنا عبد الله بن سليمان ، حدثنا هشام ، عن أبيه ، عن عائشة : ( ومن كان غنيا فليستعفف ) نزلت في مال اليتيم .\nوحدثنا الأشج وهارون بن إسحاق قالا حدثنا عبدة بن سليمان ، عن هشام ، عن أبيه ، عن . . ، قالت : نزلت في والي اليتيم الذي يقوم عليه ويصلحه إذا كان محتاجا أن يأكل منه .\nوحدثنا أبي ، حدثنا محمد بن سعيد الأصبهاني ، حدثنا علي بن مسهر ، عن هشام ، عن أبيه ، عن عائشة قالت : أنزلت هذه الآية في والي اليتيم ( ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف ) بقدر قيامه عليه .\nورواه البخاري عن إسحاق عن عبد الله بن نمير ، عن هشام ، به .\nقال الفقهاء : له أن يأكل أقل الأمرين : أجرة مثله أو قدر حاجته . واختلفوا : هل يرد إذا أيسر ، على قولين : أحدهما : لا; لأنه أكل بأجرة عمله وكان فقيرا . وهذا هو الصحيح عند أصحاب الشافعي; لأن الآية أباحت الأكل من غير بدل . وقد قال الإمام أحمد :\nحدثنا عبد الوهاب ، حدثنا حسين ، عن عمرو بن شعيب ، عن أبيه ، عن جده : أن رجلا سأل رسول الله صلى الله عليه وسلم فقال : ليس لي مال ، ولي يتيم ؟ فقال : \" كل من مال يتيمك غير مسرف ولا مبذر ولا متأثل مالا ومن غير أن تقي مالك - أو قال : تفدي مالك - بماله \" شك حسين .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا أبو خالد الأحمر ، حدثنا حسين المكتب ، عن عمرو بن شعيب ، عن أبيه ، عن جده قال : جاء رجل إلى النبي صلى الله عليه وسلم فقال : إن عندي يتيما عنده مال - وليس عنده شيء ما - آكل من ماله ؟ قال : \" بالمعروف غير مسرف \" .\nورواه أبو داود ، والنسائي ، وابن ماجه من حديث حسين المعلم به .\nوروى أبو حاتم ابن حبان في صحيحه ، وابن مردويه في تفسيره من حديث يعلى بن مهدي ، عن جعفر بن سليمان ، عن أبي عامر الخزاز ، عن عمرو بن دينار ، عن جابر : أن رجلا قال : يا رسول الله ، فيم أضرب يتيمي ؟ قال : ما كنت ضاربا منه ولدك ، غير واق مالك بماله ، ولا متأثل منه مالا .\nوقال ابن جرير : حدثنا الحسن بن يحيى ، أخبرنا عبد الرزاق ، أخبرنا الثوري ، عن يحيى بن سعيد ، عن القاسم بن محمد قال : جاء أعرابي إلى ابن عباس فقال : إن في حجري أيتاما ، وإن لهم إبلا ولي إبل ، وأنا أمنح في إبلي وأفقر ، فماذا يحل لي من ألبانها ؟ فقال : إن كنت تبغي ضالتها وتهنأ جرباها ، وتلوط حوضها ، وتسقي عليها ، فاشرب غير مضر بنسل ، ولا ناهك في الحلب .\nورواه مالك في موطئه ، عن يحيى بن سعيد به .\nوبهذا القول - وهو عدم أداء البدل - يقول عطاء بن أبي رباح ، وعكرمة ، وإبراهيم النخعي ، وعطية العوفي ، والحسن البصري .\nوالثاني : نعم; لأن مال اليتيم على الحظر ، وإنما أبيح للحاجة ، فيرد بدله كأكل مال الغير للمضطر عند الحاجة . وقد قال أبو بكر ابن أبي الدنيا : حدثنا ابن خيثمة ، حدثنا وكيع ، عن سفيان وإسرائيل ، عن أبي إسحاق ، عن حارثة بن مضرب قال : قال عمر [ بن الخطاب ] رضي الله عنه : إنى أنزلت نفسي من هذا المال بمنزلة والي اليتيم ، إن استغنيت استعففت ، وإن احتجت استقرضت ، فإذا أيسرت قضيت .\nطريق أخرى : قال سعيد بن منصور : حدثنا أبو الأحوص ، عن أبي إسحاق ، عن البراء قال : قال لي عمر ، رضي الله عنه : إني أنزلت نفسي من مال الله بمنزلة والي اليتيم ، إن احتجت أخذت منه ، فإذا أيسرت رددته ، وإن استغنيت استعففت .\nإسناد صحيح وروى البيهقي عن ابن عباس نحو ذلك . وهكذا رواه ابن أبي حاتم من طريق علي بن أبي طلحة ، عن ابن عباس في قوله : ( ومن كان فقيرا فليأكل بالمعروف ) يعني : القرض . قال : وروي عن عبيدة ، وأبي العالية ، وأبي وائل ، وسعيد بن جبير - في إحدى الروايات - ومجاهد ، والضحاك ، والسدي نحو ذلك . وروي من طريق السدي ، عن عكرمة ، عن ابن عباس في قوله : ( فليأكل بالمعروف ) قال : يأكل بثلاث أصابع .\nثم قال : حدثنا أحمد بن سنان ، حدثنا ابن مهدي ، حدثنا سفيان ، عن الحكم ، عن مقسم ، عن ابن عباس : ( ومن كان فقيرا فليأكل بالمعروف ) قال : يأكل من ماله ، يقوت على يتيمه حتى لا يحتاج إلى مال اليتيم . قال : وروي عن مجاهد وميمون بن مهران في إحدى الروايات والحكم نحو ذلك .\nوقال عامر الشعبي : لا يأكل منه إلا أن يضطر إليه ، كما يضطر إلى [ أكل ] الميتة ، فإن أكل منه قضاه . رواه ابن أبي حاتم .\nوقال ابن وهب : حدثني نافع بن أبي نعيم القارئ قال : سألت يحيى بن سعيد الأنصاري وربيعة عن قول الله : ( فليأكل بالمعروف ) فقالا ذلك في اليتيم ، إن كان فقيرا أنفق عليه بقدر فقره ، ولم يكن للولي منه شيء .\nوهذا بعيد من السياق; لأنه قال : ( ومن كان غنيا فليستعفف ) يعني : من الأولياء ( ومن كان فقيرا فليأكل بالمعروف ) أي : منهم ( فليأكل بالمعروف ) أي : بالتي هي أحسن ، كما قال في الآية الأخرى : ( ولا تقربوا مال اليتيم إلا بالتي هي أحسن حتى يبلغ أشده ) [ الإسراء : 34 ] أي : لا تقربوه إلا مصلحين له ، وإن احتجتم إليه أكلتم منه بالمعروف .\nوقوله : ( فإذا دفعتم إليهم أموالهم ) يعني : بعد بلوغهم الحلم وإيناس الرشد [ منهم ] فحينئذ سلموهم أموالهم ، فإذا دفعتم إليهم أموالهم ( فأشهدوا عليهم ) وهذا أمر الله تعالى للأولياء أن يشهدوا على الأيتام إذا بلغوا الحلم وسلموا إليهم أموالهم; لئلا يقع من بعضهم جحود وإنكار لما قبضه وتسلمه .\nثم قال : ( وكفى بالله حسيبا ) أي : وكفى بالله محاسبا وشهيدا ورقيبا على الأولياء في حال نظرهم للأيتام ، وحال تسليمهم للأموال : هل هي كاملة موفرة ، أو منقوصة مبخوسة مدخلة مروج حسابها مدلس أمورها ؟ الله عالم بذلك كله . ولهذا ثبت في صحيح مسلم أن رسول الله صلى الله عليه وسلم قال : \" يا أبا ذر ، إني أراك ضعيفا ، وإني أحب لك ما أحب لنفسي ، لا تأمرن على اثنين ، ولا تلين مال يتيم \" .\n                                    ",
        "qortoby": "وَٱبۡتَلُواْ ٱلۡيَتَٰمَىٰ حَتَّىٰٓ إِذَا بَلَغُواْ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدٗا فَٱدۡفَعُوٓاْ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡۖ وَلَا تَأۡكُلُوهَآ إِسۡرَافٗا وَبِدَارًا أَن يَكۡبَرُواْۚ وَمَن كَانَ غَنِيّٗا فَلۡيَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِيرٗا فَلۡيَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡ فَأَشۡهِدُواْ عَلَيۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا ٦\n                                    \n                                    \n                                    قوله تعالى : وابتلوا اليتامى حتى إذا بلغوا النكاح فإن آنستم منهم رشدا فادفعوا إليهم أموالهم ولا تأكلوها إسرافا وبدارا أن يكبروا ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف فإذا دفعتم إليهم أموالهم فأشهدوا عليهم وكفى بالله حسيبا\nفيه سبع عشرة مسائل :\nالأولى : قوله تعالى : وابتلوا اليتامى الابتلاء الاختبار ؛ وقد تقدم . وهذه الآية خطاب للجميع في بيان كيفية دفع أموالهم . وقيل : إنها نزلت في ثابت بن رفاعة وفي عمه . وذلك أن رفاعة توفي وترك ابنه وهو صغير ، فأتى عم ثابت إلى النبي صلى الله عليه وسلم فقال : إن ابن أخي يتيم في حجري فما يحل لي من ماله ، ومتى أدفع إليه ماله ؟ فأنزل الله تعالى هذه الآية .\nالثانية : واختلف العلماء في معنى الاختبار ؛ فقيل : هو أن يتأمل الوصي أخلاق يتيمه ، ويستمع إلى أغراضه ، فيحصل له العلم بنجابته ، والمعرفة بالسعي في مصالحه وضبط ماله ، والإهمال لذلك . فإذا توسم الخير قال علماؤنا وغيرهم : لا بأس أن يدفع إليه شيئا من ماله يبيح له التصرف فيه ، فإن نماه وحسن النظر فيه فقد وقع الاختبار ، ووجب على الوصي تسليم جميع ماله إليه . وإن أساء النظر فيه وجب عليه إمساك ماله عنده . وليس في العلماء من يقول : إنه إذا اختبر الصبي فوجده رشيدا ترتفع الولاية عنه ، وأنه يجب دفع ماله إليه وإطلاق يده في التصرف ؛ لقوله تعالى : حتى إذا بلغوا النكاح . وقال جماعة من الفقهاء : الصغير لا يخلو من أحد أمرين ؛ إما أن يكون غلاما أو جارية ؛ فإن كان غلاما رد النظر إليه في نفقة الدار شهرا ، أو أعطاه شيئا نزرا يتصرف فيه ؛ ليعرف كيف تدبيره وتصرفه ، وهو مع ذلك يراعيه لئلا يتلفه ؛ فإن أتلفه فلا ضمان على الوصي . فإذا رآه متوخيا سلم إليه ماله وأشهد عليه . وإن كانت جارية رد إليها ما يرد إلى ربة البيت من تدبير بيتها والنظر فيه ، في الاستغزال والاستقصاء على الغزالات في دفع القطن وأجرته ، واستيفاء الغزل وجودته . فإن رآها رشيدة سلم أيضا إليها مالها وأشهد عليها . وإلا بقيا تحت الحجر حتى يؤنس رشدهما . وقال الحسن ومجاهد وغيرهما : اختبروهم في عقولهم وأديانهم وتنمية أموالهم .\nالثالثة : قوله تعالى : حتى إذا بلغوا النكاح أي الحلم ؛ لقوله تعالى : وإذا بلغ الأطفال منكم الحلم أي البلوغ ، وحال النكاح . والبلوغ يكون بخمسة أشياء : ثلاثة يشترك فيها الرجال والنساء ، واثنان يختصان بالنساء وهما الحيض والحبل . فأما الحيض والحبل فلم يختلف العلماء في أنه بلوغ ، وأن الفرائض والأحكام تجب بهما . واختلفوا في الثلاث ؛ فأما الإنبات والسن فقال الأوزاعي والشافعي وابن حنبل : خمس عشرة سنة بلوغ لمن لم يحتلم . وهو قول ابن وهب وأصبغ وعبد الملك بن الماجشون وعمر بن عبد العزيز وجماعة من أهل المدينة ، واختاره ابن العربي . وتجب الحدود والفرائض عندهم على من بلغ هذا السن . قال أصبغ بن الفرج : والذي نقول به أن حد البلوغ الذي تلزم به الفرائض والحدود خمس عشرة سنة ؛ وذلك أحب ما فيه إلي وأحسنه عندي ؛ لأنه الحد الذي يسهم فيه في الجهاد ولمن حضر القتال . واحتج بحديث ابن عمر إذ عرض يوم الخندق وهو ابن خمس عشرة سنة فأجيز ، ولم يجز يوم أحد ؛ لأنه كان ابن أربع عشرة سنة . أخرجه مسلم . قال أبو عمر بن عبد البر : هذا فيمن عرف مولده ، وأما من جهل مولده وعدة سنه أو جحده فالعمل فيه بما روى نافع ، عن أسلم ، عن عمر بن الخطاب رضي الله عنه ، أنه كتب إلى أمراء الأجناد : ( ألا تضربوا الجزية إلا على من جرت عليه المواسي ) . وقال عثمان في غلام سرق : انظروا إن كان قد اخضر مئزره فاقطعوه . وقال عطية القرظي : عرض رسول الله صلى الله عليه وسلم بني قريظة ؛ فكل من أنبت منهم قتله بحكم سعد بن معاذ ، ومن لم ينبت منهم استحياه ؛ فكنت فيمن لم ينبت فتركني .\nوقال مالك وأبو حنيفة وغيرهما : لا يحكم لمن لم يحتلم حتى يبلغ ما لم يبلغه أحد إلا احتلم ، وذلك سبع عشرة سنة ؛ فيكون عليه حينئذ الحد إذا أتى ما يجب عليه الحد . وقال مالك مرة : بلوغه أن يغلظ صوته وتنشق أرنبته . وعن أبي حنيفة رواية أخرى : تسع عشرة سنة ؛ وهي الأشهر . وقال في الجارية : بلوغها لسبع عشرة سنة وعليها النظر . وروى اللؤلئي عنه ثمان عشرة سنة . وقال داود : لا يبلغ بالسن ما لم يحتلم ولو بلغ أربعين سنة . فأما الإنبات فمنهم من قال : يستدل به على البلوغ ؛ روي عن ابن القاسم وسالم ، وقال مالك مرة ، والشافعي في أحد قوليه ، وبه قال أحمد وإسحاق وأبو ثور . وقيل : هو بلوغ ؛ إلا أنه يحكم به في الكفار فيقتل من أنبت ويجعل من لم ينبت في الذراري ؛ قاله الشافعي في القول الآخر ؛ لحديث عطية القرظي . ولا اعتبار بالخضرة والزغب ، وإنما يترتب الحكم على الشعر . وقال ابن القاسم : سمعت مالكا يقول : العمل عندي على حديث عمر بن الخطاب : لو جرت عليه المواسي لحددته . قال أصبغ : قال لي ابن القاسم وأحب إلي ألا يقام عليه الحد إلا باجتماع الإنبات والبلوغ . وقال أبو حنيفة : لا يثبت بالإنبات حكم ، وليس هو ببلوغ ولا دلالة على البلوغ . وقال الزهري وعطاء : لا حد على من لم يحتلم ؛ وهو قول الشافعي ، ومال إليه مالك مرة ، وقال به بعض أصحابه . وظاهره عدم اعتبار الإنبات والسن . قال ابن العربي : \" إذا لم يكن حديث ابن عمر دليلا في السن فكل عدد يذكرونه من السنين فإنه دعوى ، والسن التي أجازها رسول الله صلى الله عليه وسلم أولى من سن لم يعتبرها ، ولا قام في الشرع دليل عليها ، وكذلك اعتبر النبي صلى الله عليه وسلم الإنبات في بني قريظة ؛ فمن عذيري ممن ترك أمرين اعتبرهما النبي صلى الله عليه وسلم فيتأوله ويعتبر ما لم يعتبره النبي صلى الله عليه وسلم لفظا ، ولا جعل الله له في الشريعة نظرا \" .\nقلت : هذا قوله هنا ، وقال في سورة الأنفال عكسه ؛ إذ لم يعرج على حديث ابن عمر هناك ، وتأوله كما تأول علماؤنا ، وأن موجبه الفرق بين من يطيق القتال ويسهم له وهو ابن خمس عشرة سنة ، ومن لا يطيقه فلا يسهم له فيجعل في العيال . وهو الذي فهمه عمر بن عبد العزيز من الحديث . والله أعلم .\nالرابعة : قوله تعالى : فإن آنستم منهم رشدا فادفعوا إليهم أموالهم أي أبصرتم ورأيتم ؛ ومنه قوله تعالى : آنس من جانب الطور نارا أي أبصر ورأى . قال الأزهري : تقول العرب اذهب فاستأنس هل ترى أحدا ؛ معناه تبصر . قال النابغة :\nكأن رحلي وقد زال النهار بنا يوم الجليل على مستأنس وحد\nأراد ثورا وحشيا يتبصر هل يرى قانصا فيحذره . وقيل : آنست وأحسست ووجدت بمعنى واحد ؛ ومنه قوله تعالى : فإن آنستم منهم رشدا أي علمتم . والأصل فيه أبصرتم . وقراءة العامة \" رشدا \" بضم الراء وسكون الشين . وقرأ السلمي وعيسى والثقفي وابن مسعود رضي الله عنهم \" رشدا \" بفتح الراء والشين ، وهما لغتان . وقيل : رشدا مصدر رشد . ورشدا مصدر رشد ، وكذلك الرشاد . والله أعلم .\nالخامسة : واختلف العلماء في تأويل رشدا فقال الحسن وقتادة وغيرهما : صلاحا في العقل والدين . وقال ابن عباس والسدي والثوري : ( صلاحا في العقل وحفظ المال ) . قال سعيد بن جبير والشعبي : إن الرجل ليأخذ بلحيته وما بلغ رشده ؛ فلا يدفع إلى اليتيم ماله وإن كان شيخا حتى يؤنس منه رشده . وهكذا قال الضحاك : لا يعطى اليتيم وإن بلغ مائة سنة حتى يعلم منه إصلاح ماله . وقال مجاهد : رشدا يعني في العقل خاصة . وأكثر العلماء على أن الرشد لا يكون إلا بعد البلوغ ، وعلى أنه إن لم يرشد بعد بلوغ الحلم وإن شاخ لا يزول الحجر عنه ؛ وهو مذهب مالك وغيره . وقال أبو حنيفة : لا يحجر على الحر البالغ إذا بلغ مبلغ الرجال ، ولو كان أفسق الناس وأشدهم تبذيرا إذا كان عاقلا . وبه قال زفر بن الهذيل ؛ وهو مذهب النخعي . واحتجوا في ذلك بما رواه قتادة ، عن أنس أن حبان بن منقذ كان يبتاع وفي عقدته ضعف ، فقيل : يا رسول الله احجر عليه ؛ فإنه يبتاع وفي عقدته ضعف . فاستدعاه النبي صلى الله عليه وسلم فقال : لا تبع . فقال : لا أصبر . فقال له : فإذا بايعت فقل لا خلابة ولك الخيار ثلاثا . قالوا : فلما سأله القوم الحجر عليه لما كان في تصرفه من الغبن ولم يفعل عليه السلام ، ثبت أن الحجر لا يجوز . وهذا لا حجة لهم فيه ؛ لأنه مخصوص بذلك على ما بيناه في البقرة ، فغيره بخلافه . وقال الشافعي : إن كان مفسدا لماله ودينه ، أو كان مفسدا لماله دون دينه حجر عليه ، وإن كان مفسدا لدينه مصلحا لماله فعلى وجهين : أحدهما يحجر عليه ؛ وهو اختيار أبي العباس بن شريح . والثاني لا حجر عليه ؛ وهو اختيار إسحاق المروزي ، والأظهر من مذهب الشافعي . قال الثعلبي : وهذا الذي ذكرناه من الحجر على السفيه قول عثمان وعلي والزبير وعائشة وابن عباس وعبد الله بن جعفر رضوان الله عليهم ، ومن التابعين شريح ، وبه قال الفقهاء : مالك وأهل المدينة والأوزاعي وأهل الشام وأبو يوسف ومحمد وأحمد وإسحاق وأبو ثور . قال الثعلبي : وادعى أصحابنا الإجماع في هذه المسألة .\nالسادسة : إذا ثبت هذا فاعلم أن دفع المال يكون بشرطين : إيناس الرشد والبلوغ ، فإن وجد أحدهما دون الآخر لم يجز تسليم المال ، كذلك نص الآية . وهو رواية ابن القاسم وأشهب وابن وهب عن مالك في الآية . وهو قول جماعة الفقهاء إلا أبا حنيفة وزفر والنخعي فإنهم أسقطوا إيناس الرشد ببلوغ خمس وعشرين سنة . قال أبو حنيفة : لكونه جدا وهذا يدل على ضعف قوله ، وضعف ما احتج به أبو بكر الرازي في أحكام القرآن له من استعمال الآيتين حسب ما تقدم ؛ فإن هذا من باب المطلق والمقيد ، والمطلق يرد إلى المقيد باتفاق أهل الأصول . وماذا يغني كونه جدا إذا كان غير جد ، أي بخت . إلا أن علماءنا شرطوا في الجارية دخول الزوج بها مع البلوغ ، وحينئذ يقع الابتلاء في الرشد . ولم يره أبو حنيفة والشافعي ، ورأوا الاختبار في الذكر والأنثى على ما تقدم . وفرق علماؤنا بينهما بأن قالوا : الأنثى مخالفة للغلام لكونها محجوبة لا تعاني الأمور ولا تبرز لأجل البكارة فلذلك وقف فيها على وجود النكاح ؛ فبه تفهم المقاصد كلها . والذكر بخلافها ؛ فإنه بتصرفه وملاقاته للناس من أول نشئه إلى بلوغه يحصل له الاختبار ، ويكمل عقله بالبلوغ ، فيحصل له الغرض . وما قاله الشافعي أصوب ؛ فإن نفس الوطء بإدخال الحشفة لا يزيدها في رشدها إذا كانت عارفة بجميع أمورها ومقاصدها ، غير مبذرة لمالها . ثم زاد علماؤنا فقالوا : لا بد بعد دخول زوجها من مضي مدة من الزمان تمارس فيها الأحوال . قال ابن العربي : وذكر علماؤنا في تحديدها أقوالا عديدة ؛ منها الخمسة الأعوام والستة والسبعة في ذات الأب . وجعلوا في اليتيمة التي لا أب لها ولا وصي عليها عاما واحدا بعد الدخول ، وجعلوا في المولى عليها مؤبدا حتى يثبت رشدها . وليس في هذا كله دليل ، وتحديد الأعوام في ذات الأب عسير ؛ وأعسر منه تحديد العام في اليتيمة . وأما تمادي الحجر في المولى عليها حتى يتبين رشدها فيخرجها الوصي عنه ، أو يخرجها الحكم منه فهو ظاهر القرآن . والمقصود من هذا كله داخل تحت قوله تعالى : فإن آنستم منهم رشدا فتعين اعتبار الرشد ولكن يختلف إيناسه بحسب اختلاف حال الراشد . فاعرفه وركب عليه واجتنب التحكم الذي لا دليل عليه .\nالسابعة : واختلفوا فيما فعلته ذات الأب في تلك المدة ؛ فقيل : هو محمول على الرد لبقاء الحجر ، وما عملته بعده فهو محمول على الجواز . وقال بعضهم : ما عملته في تلك المدة محمول على الرد إلا أن يتبين فيه السداد ، وما عملته بعد ذلك محمول على الإمضاء حتى يتبين فيه السفه .\nالثامنة : واختلفوا في دفع المال إلى المحجور عليه هل يحتاج إلى السلطان أم لا ؟ فقالت فرقة : لا بد من رفعه إلى السلطان ، ويثبت عنده رشده ثم يدفع إليه ماله . وقالت فرقة : ذلك موكول إلى اجتهاد الوصي دون أن يحتاج إلى رفعه إلى السلطان . قال ابن عطية : والصواب في أوصياء زماننا ألا يستغنى عن رفعه إلى السلطان وثبوت الرشد عنده ، لما حفظ من تواطؤ الأوصياء على أن يرشد الصبي ، ويبرأ المحجور عليه لسفهه وقلة تحصيله في ذلك الوقت .\nالتاسعة : فإذا سلم المال إليه بوجود الرشد ، ثم عاد إلى السفه بظهور تبذير وقلة تدبير عاد إليه الحجر عندنا ، وعند الشافعي في أحد قوليه . وقال أبو حنيفة : لا يعود ؛ لأنه بالغ عاقل ؛ بدليل جواز إقراره في الحدود والقصاص . ودليلنا قوله تعالى : ولا تؤتوا السفهاء أموالكم التي جعل الله لكم قياما وقال تعالى : فإن كان الذي عليه الحق سفيها أو ضعيفا أو لا يستطيع أن يمل هو فليملل وليه بالعدل ولم يفرق بين أن يكون محجورا سفيها أو يطرأ ذلك عليه بعد الإطلاق .\nالعاشرة : ويجوز للوصي أن يصنع في مال اليتيم ما كان للأب أن يصنع من تجارة وإبضاع وشراء وبيع . وعليه أن يؤدي الزكاة من سائر أمواله : عين وحرث وماشية وفطرة . ويؤدي عنه أروش الجنايات وقيم المتلفات ، ونفقة الوالدين وسائر الحقوق اللازمة . ويجوز أن يزوجه ويؤدي عنه الصداق ، ويشتري له جارية يتسررها ، ويصالح له وعليه على وجه النظر له . وإذا قضى الوصي بعض الغرماء وبقي من المال بقية تفي ما عليه من الدين كان فعل الوصي جائزا . فإن تلف باقي المال فلا شيء لباقي الغرماء على الوصي ولا على الذين اقتضوا . وإن اقتضى الغرماء جميع المال ثم أتى غرماء آخرون فإن كان عالما بالدين الباقي أو كان الميت معروفا بالدين الباقي ضمن الوصي لهؤلاء الغرماء ما كان يصيبهم في المحاصة ، ورجع على الذين اقتضوا دينهم بذلك . وإن لم يكن عالما بذلك ، ولا كان الميت معروفا بالدين فلا شيء على الوصي . وإذا دفع الوصي دين الميت بغير إشهاد ضمن . وأما إن أشهد وطال الزمان حتى مات الشهود فلا شيء عليه . وقد مضى في البقرة عند قوله تعالى : وإن تخالطوهم فإخوانكم من أحكام الوصي في الإنفاق وغيره ما فيه كفاية ، والحمد لله .\nالحادية عشرة : قوله تعالى : ولا تأكلوها إسرافا وبدارا أن يكبروا ليس يريد أن أكل مالهم من غير إسراف جائز ، فيكون له دليل خطاب ، بل المراد ولا تأكلوا أموالهم فإنه إسراف . فنهى الله سبحانه وتعالى الأوصياء عن أكل أموال اليتامى بغير الواجب المباح لهم ؛ على ما يأتي بيانه .\nوالإسراف في اللغة الإفراط ومجاوزة الحد . وقد تقدم في آل عمران والسرف الخطأ في الإنفاق . ومنه قول الشاعر :\nأعطوا هنيدة يحدوها ثمانية ما في عطائهم من ولا سرف\nأي ليس يخطئون مواضع العطاء . وقال آخر :\nوقال قائلهم والخيل تخبطهم أسرفتم فأجبنا أننا سرف\nقال النضر بن شميل : السرف التبذير ، والسرف الغفلة . وسيأتي لمعنى الإسراف زيادة بيان في \" الأنعام \" إن شاء الله تعالى . \" وبدارا \" معناه : ومبادرة كبرهم ، وهو حال البلوغ .\nوالبدار والمبادرة كالقتال والمقاتلة . وهو معطوف على إسرافا . و أن يكبروا في موضع نصب ب بدارا ، أي لا تستغنم مال محجورك فتأكله وتقول أبادر كبره لئلا يرشد ويأخذ ماله ؛ عن ابن عباس وغيره .\nالثانية عشرة : قوله تعالى : ومن كان غنيا فليستعفف الآية . بين الله تعالى ما يحل لهم من أموالهم ؛ فأمر الغني بالإمساك وأباح للوصي الفقير أن يأكل من مال وليه بالمعروف . يقال : عف الرجل عن الشيء واستعف إذا أمسك . والاستعفاف عن الشيء تركه . ومنه قوله تعالى : وليستعفف الذين لا يجدون نكاحا .\nوالعفة : الامتناع عما لا يحل ولا يجب فعله . روى أبو داود من حديث حسين المعلم ، عن عمرو بن شعيب ، عن أبيه ، عن جده ، أن رجلا أتى النبي صلى الله عليه وسلم فقال : إني فقير ليس لي شيء ولي يتيم . قال : فقال : كل من مال يتيمك غير مسرف ولا مبادر ولا متأثل .\nالثالثة عشرة : واختلف العلماء من المخاطب والمراد بهذه الآية ؟ ففي صحيح مسلم ، عن عائشة في قوله تعالى : ومن كان فقيرا فليأكل بالمعروف قالت : نزلت في ولي اليتيم الذي يقوم عليه ويصلحه إذا كان محتاجا جاز أن يأكل منه . في رواية : بقدر ماله بالمعروف .\nوقال بعضهم : المراد اليتيم إن كان غنيا وسع عليه وأعف عن ماله ، وإن كان فقيرا أنفق عليه بقدره ؛ قال ربيعة ويحيى بن سعيد . والأول قول الجمهور وهو الصحيح ؛ لأن اليتيم لا يخاطب بالتصرف في ماله لصغره ولسفهه . والله أعلم .\nالرابعة عشرة : واختلف الجمهور في الأكل بالمعروف ما هو ؟ فقال قوم : ( هو القرض إذا احتاج ويقضي إذا أيسر ) ؛ قاله عمر بن الخطاب وابن عباس وعبيدة وابن جبير والشعبي ومجاهد وأبو العالية ، وهو قول الأوزاعي . ولا يستسلف أكثر من حاجته . قال عمر : ( ألا إني أنزلت نفسي من مال الله منزلة الولي من مال اليتيم ، إن استغنيت استعففت ، وإن افتقرت أكلت بالمعروف ؛ فإذا أيسرت قضيت ) . روى عبد الله بن المبارك ، عن عاصم ، عن أبي العالية ومن كان فقيرا فليأكل بالمعروف قال : قرضا - ثم تلا فإذا دفعتم إليهم أموالهم فأشهدوا عليهم .\nوقول ثان - روي عن إبراهيم وعطاء والحسن البصري والنخعي وقتادة : لا قضاء على الوصي الفقير فيما يأكل بالمعروف ؛ لأن ذلك حق النظر ، وعليه الفقهاء . قال الحسن : هو طعمة من الله له ؛ وذلك أنه يأكل ما يسد جوعته ، ويكتسي ما يستر عورته ، ولا يلبس الرفيع من الكتان ولا الحلل . والدليل على صحة هذا القول إجماع الأمة على أن الإمام الناظر للمسلمين لا يجب عليه غرم ما أكل بالمعروف ؛ لأن الله تعالى قد فرض سهمه في مال الله . فلا حجة لهم في قول عمر : ( فإذا أيسرت قضيت ) - أن لو صح . وقد روي عن ابن عباس وأبي العالية والشعبي أن ( الأكل بالمعروف هو كالانتفاع بألبان المواشي ، واستخدام العبيد ، وركوب الدواب إذا لم يضر بأصل المال ؛ كما يهنأ الجرباء ، وينشد الضالة ، ويلوط الحوض ، ويجذ التمر . فأما أعيان الأموال وأصولها فليس للوصي أخذها ) . وهذا كله يخرج مع قول الفقهاء : إنه يأخذ بقدر أجر عمله ؛ وقالت به طائفة وأن ذلك هو المعروف ، ولا قضاء عليه ، والزيادة على ذلك محرمة .\nوفرق الحسن بن صالح بن حي - ويقال ابن حيان - بين وصي الأب والحاكم ؛ فلوصي الأب أن يأكل بالمعروف ، وأما وصي الحاكم فلا سبيل له إلى المال بوجه ؛ وهو القول الثالث .\nوقول رابع روي عن مجاهد قال : ليس له أن يأخذ قرضا ولا غيره . وذهب إلى أن الآية منسوخة ، نسخها قوله تعالى : يا أيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم وهذا ليس بتجارة . وقال زيد بن أسلم : إن الرخصة في هذه الآية منسوخة بقوله تعالى : إن الذين يأكلون أموال اليتامى ظلما الآية . وحكى بشر بن الوليد ، عن ابن يوسف ، قال : لا أدري ، لعل هذه الآية منسوخة بقوله عز وجل : يا أيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم .\nوقول خامس - وهو الفرق بين الحضر والسفر ؛ فيمنع إذا كان مقيما معه في المصر . فإذا احتاج أن يسافر من أجله فله أن يأخذ ما يحتاج إليه ، ولا يقتني شيئا ؛ قاله أبو حنيفة وصاحباه أبو يوسف ومحمد .\nوقول سادس - قال أبو قلابة : فليأكل بالمعروف مما يجني من الغلة ؛ فأما المال الناض فليس له أن يأخذ منه شيئا قرضا ولا غيره .\nوقول سابع - روى عكرمة ، عن ابن عباس ومن كان فقيرا فليأكل بالمعروف قال : ( إذا احتاج واضطر ) . وقال الشعبي : كذلك إذا كان منه بمنزلة الدم ولحم الخنزير أخذ منه ؛ فإن وجد أوفى . قال النحاس : وهذا لا معنى له لأنه إذا اضطر هذا الاضطرار كان له أخذ ما يقيمه من مال يتيمه أو غيره من قريب أو بعيد . وقال ابن عباس أيضا والنخعي : ( المراد أن يأكل الوصي بالمعروف من مال نفسه حتى لا يحتاج إلى مال اليتيم ؛ فيستعفف الغني بغناه ، والفقير يقتر على نفسه حتى لا يحتاج إلى مال يتيمه ) . قال النحاس : وهذا من أحسن ما روي في تفسير الآية ؛ لأن أموال الناس محظورة لا يطلق شيء منها إلا بحجة قاطعة .\nقلت : وقد اختار هذا القول الكيا الطبري في أحكام القرآن له ؛ فقال : \" توهم متوهمون من السلف بحكم الآية أن للوصي أن يأكل من مال الصبي قدرا لا ينتهي إلى حد السرف ، وذلك خلاف ما أمر الله تعالى به من قوله : - لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم ولا يتحقق ذلك في مال اليتيم . فقوله : ومن كان غنيا فليستعفف يرجع إلى أكل مال نفسه دون مال اليتيم . فمعناه ولا تأكلوا أموال اليتيم مع أموالكم ، بل اقتصروا على أكل أموالكم . وقد دل عليه قوله تعالى : ولا تأكلوا أموالهم إلى أموالكم إنه كان حوبا كبيرا وبان بقوله تعالى : ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف الاقتصار على البلغة ، حتى لا يحتاج إلى أكل مال اليتيم ؛ فهذا تمام معنى الآية . فقد وجدنا آيات محكمات تمنع أكل مال الغير دون رضاه ، سيما في حق اليتيم . وقد وجدنا هذه الآية محتملة للمعاني ، فحملها على موجب الآيات المحكمات متعين . فإن قال من ينصر مذهب السلف : إن القضاة يأخذون أرزاقهم لأجل عملهم للمسلمين ، فهلا كان الوصي كذلك إذا عمل لليتيم ، ولم لا يأخذ الأجرة بقدر عمله ؟ قيل له : اعلم أن أحدا من السلف لم يجوز للوصي أن يأخذ من مال الصبي مع غنى الوصي ، بخلاف القاضي ؛ فذلك فارق بين المسألتين . وأيضا فالذي يأخذه الفقهاء والقضاة والخلفاء القائمون بأمور الإسلام لا يتعين له مالك . وقد جعل الله ذلك المال الضائع لأصناف بأوصاف ، والقضاة من جملتهم ، والوصي إنما يأخذ بعمله مال شخص معين من غير رضاه ؛ وعمله مجهول وأجرته مجهولة وذلك بعيد عن الاستحقاق .\nقلت : وكان شيخنا الإمام أبو العباس يقول : إن كان مال اليتيم كثيرا يحتاج إلى كبير قيام عليه بحيث يشغل الولي عن حاجاته ومهماته فرض له فيه أجر عمله ، وإن كان تافها لا يشغله عن حاجاته فلا يأكل منه شيئا ؛ غير أنه يستحب له شرب قليل اللبن وأكل القليل من الطعام والسمن ، غير مضر به ولا مستكثر له ، بل على ما جرت العادة بالمسامحة فيه . قال شيخنا : وما ذكرته من الأجرة ، ونيل اليسير من التمر واللبن كل واحد منهما معروف ؛ فصلح حمل الآية على ذلك . والله أعلم .\nقلت : والاحتراز عنه أفضل ، إن شاء الله .\nوأما ما يأخذه قاضي القسمة ويسميه رسما ونهب أتباعه فلا أدري له وجها ولا حلا ، وهم داخلون في عموم قوله تعالى : إن الذين يأكلون أموال اليتامى ظلما إنما يأكلون في بطونهم نارا .\nالخامسة عشرة : قوله تعالى : فإذا دفعتم إليهم أموالهم فأشهدوا عليهم أمر الله تعالى بالإشهاد تنبيها على التحصين وزوالا للتهم . وهذا الإشهاد مستحب عند طائفة من العلماء ؛ فإن القول قول الوصي ؛ لأنه أمين . وقالت طائفة : هو فرض ؛ وهو ظاهر الآية ، وليس بأمين فيقبل قوله ، كالوكيل إذا زعم أنه قد رد ما دفع إليه أو المودع ، وإنما هو أمين للأب ، ومتى ائتمنه الأب لا يقبل قوله على غيره . ألا ترى أن الوكيل لو ادعى أنه قد دفع لزيد ما أمره به بعدالته لم يقبل قوله إلا ببينة ؛ فكذلك الوصي . ورأى عمر بن الخطاب رضي الله عنه وابن جبير أن هذا الإشهاد إنما هو على دفع الوصي في يسره ما استقرضه من مال يتيمه حالة فقره . قال عبيدة : هذه الآية دليل على وجوب القضاء على من أكل ؛ المعنى : فإذا اقترضتم أو أكلتم فأشهدوا إذا غرمتم . والصحيح أن اللفظ يعم هذا وسواه . والظاهر أن المراد إذا أنفقتم شيئا على المولى عليه فأشهدوا ، حتى ولو وقع خلاف أمكن إقامة البينة ؛ فإن كل مال قبض على وجه الأمانة بإشهاد لا يبرأ منه إلا بالإشهاد على دفعه ، لقوله تعالى : فأشهدوا فإذا دفع لمن دفع إليه بغير إشهاد فلا يحتاج في دفعها لإشهاد إن كان قبضها بغير إشهاد . والله أعلم .\nالسادسة عشرة : قوله تعالى : كما على الوصي والكفيل حفظ مال يتيمه والتثمير له ، كذلك عليه حفظ الصبي في بدنه . فالمال يحفظه بضبطه ، والبدن يحفظه بأدبه . وقد مضى هذا المعنى في \" البقرة \" . وروي أن رجلا قال للنبي صلى الله عليه وسلم : إن في حجري يتيما أآكل من ماله ؟ قال : نعم غير متأثل مالا ولا واق مالك بماله . قال : يا رسول الله ، أفأضربه ؟ قال : ما كنت ضاربا منه ولدك . قال ابن العربي : وإن لم يثبت مسندا فليس يجد أحد عنه ملتحدا .\nالسابعة عشرة : قوله تعالى : وكفى بالله حسيبا أي كفى الله حاسبا لأعمالكم ومجازيا بها . ففي هذا وعيد لكل جاحد حق . والباء زائدة ، وهو في موضع رفع .\n                                    ",
        "saadi": "وَٱبۡتَلُواْ ٱلۡيَتَٰمَىٰ حَتَّىٰٓ إِذَا بَلَغُواْ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدٗا فَٱدۡفَعُوٓاْ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡۖ وَلَا تَأۡكُلُوهَآ إِسۡرَافٗا وَبِدَارًا أَن يَكۡبَرُواْۚ وَمَن كَانَ غَنِيّٗا فَلۡيَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِيرٗا فَلۡيَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡ فَأَشۡهِدُواْ عَلَيۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا ٦\n                                        \n                                        \n                                        \n                                        الابتلاء: هو الاختبار والامتحان، وذلك بأن يدفع لليتيم المقارب للرشد، الممكن رشده، شيئا من ماله، ويتصرف فيه التصرف اللائق بحاله، فيتبين بذلك رشده من سفهه، فإن استمر غير محسن للتصرف لم يدفع إليه ماله، بل هو باق على سفهه، ولو بلغ عمرا كثيرا. فإن تبين رشده وصلاحه في ماله وبلغ النكاح { فَادْفَعُوا إِلَيْهِمْ أَمْوَالَهُمْ } كاملة موفرة. { وَلَا تَأْكُلُوهَا إِسْرَافًا } أي: مجاوزة للحد الحلال الذي أباحه الله لكم من أموالكم، إلى الحرام الذي حرمه الله عليكم من أموالهم. { وَبِدَارًا أَنْ يَكْبَرُوا } أي: ولا تأكلوها في حال صغرهم التي لا يمكنهم فيها أخذها منكم، ولا منعكم من أكلها، تبادرون بذلك أن يكبروا، فيأخذوها منكم ويمنعوكم منها. وهذا من الأمور الواقعة من كثير من الأولياء، الذين ليس عندهم خوف من الله، ولا رحمة ومحبة للمولى عليهم، يرون هذه الحال حال فرصة فيغتنمونها ويتعجلون ما حرم الله عليهم، فنهى الله تعالى عن هذه الحالة بخصوصها.\n                                    "
      },
      "originalText": "وَٱبۡتَلُواْ ٱلۡيَتَٰمَىٰ حَتَّىٰٓ إِذَا بَلَغُواْ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدٗا فَٱدۡفَعُوٓاْ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡۖ وَلَا تَأۡكُلُوهَآ إِسۡرَافٗا وَبِدَارًا أَن يَكۡبَرُواْۚ وَمَن كَانَ غَنِيّٗا فَلۡيَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِيرٗا فَلۡيَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡ فَأَشۡهِدُواْ عَلَيۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا ٦"
    }
  ]
}