{
  "number": 79,
  "ayahsNumber": 3,
  "ayahs": [
    {
      "number": 505,
      "text": "۞ وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِنْ لَمْ يَكُنْ لَهُنَّ وَلَدٌ ۚ فَإِنْ كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ مِمَّا تَرَكْنَ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَا أَوْ دَيْنٍ ۚ وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِنْ لَمْ يَكُنْ لَكُمْ وَلَدٌ ۚ فَإِنْ كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُمْ ۚ مِنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَوْ دَيْنٍ ۗ وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلَالَةً أَوِ امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ فَلِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ ۚ فَإِنْ كَانُوا أَكْثَرَ مِنْ ذَٰلِكَ فَهُمْ شُرَكَاءُ فِي الثُّلُثِ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصَىٰ بِهَا أَوْ دَيْنٍ غَيْرَ مُضَارٍّ ۚ وَصِيَّةً مِنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَلِيمٌ",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 12,
      "juz": 4,
      "manzil": 1,
      "page": 79,
      "ruku": 63,
      "hizbQuarter": 32,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَكُمۡ نِصۡفُ مَا تَرَكَ أَزۡوَٰجُكُمۡ إِن لَّمۡ يَكُن لَّهُنَّ وَلَدٞۚ فَإِن كَانَ لَهُنَّ وَلَدٞ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكۡنَۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصِينَ بِهَآ أَوۡ دَيۡنٖۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكۡتُمۡ إِن لَّمۡ يَكُن لَّكُمۡ وَلَدٞۚ فَإِن كَانَ لَكُمۡ وَلَدٞ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكۡتُمۚ مِّنۢ بَعۡدِ وَصِيَّةٖ تُوصُونَ بِهَآ أَوۡ دَيۡنٖۗ وَإِن كَانَ رَجُلٞ يُورَثُ كَلَٰلَةً أَوِ ٱمۡرَأَةٞ وَلَهُۥٓ أَخٌ أَوۡ أُخۡتٞ فَلِكُلِّ وَٰحِدٖ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوٓاْ أَكۡثَرَ مِن ذَٰلِكَ فَهُمۡ شُرَكَآءُ فِي ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصَىٰ بِهَآ أَوۡ دَيۡنٍ غَيۡرَ مُضَآرّٖۚ وَصِيَّةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَلِيمٞ ٢١\n                                    \n                                    \n                                    يقول تعالى : ولكم - أيها الرجال - نصف ما ترك أزواجكم إذا متن عن غير ولد ، فإن كان لهن ولد فلكم الربع مما تركن من بعد [ وصية ] يوصين بها أو دين . وقد تقدم أن الدين مقدم على الوصية ، وبعده الوصية ثم الميراث ، وهذا أمر مجمع عليه بين العلماء ، وحكم أولاد البنين وإن سفلوا حكم أولاد الصلب .\nثم قال : ( ولهن الربع مما تركتم [ إن لم يكن لكم ولد فإن كان لكم ولد فلهن الثمن مما تركتم ] ) إلخ ، وسواء في الربع أو الثمن الزوجة والزوجتان الاثنتان والثلاث والأربع يشتركن فيه .\nوقوله : ( من بعد وصية ) إلخ ، الكلام عليه كما تقدم .\nوقوله : ( وإن كان رجل يورث كلالة ) الكلالة : مشتقة من الإكليل ، وهو الذي يحيط بالرأس من جوانبه ، والمراد هنا من يرثه من حواشيه لا أصوله ولا فروعه ، كما روى الشعبي عن أبي بكر الصديق : أنه سئل عن الكلالة ، فقال : أقول فيها برأيي ، فإن يكن صوابا فمن الله ، وإن يكن خطأ فمني ومن الشيطان ، والله ورسوله بريئان منه : الكلالة من لا ولد له ولا والد . فلما ولي عمر بن الخطاب قال : إني لأستحيي أن أخالف أبا بكر في رأي رآه . رواه ابن جرير وغيره .\nوقال ابن أبي حاتم ، رحمه الله ، في تفسيره : حدثنا محمد بن عبد الله بن يزيد ، حدثنا سفيان ، عن سليمان الأحول ، عن طاوس قال : سمعت عبد الله بن عباس يقول : كنت آخر الناس عهدا بعمر بن الخطاب ، فسمعته يقول : القول ما قلت ، وما قلت وما قلت . قال : الكلالة من لا ولد له ولا والد .\nوهكذا قال علي بن أبي طالب وابن مسعود ، وصح عن غير وجه عن عبد الله بن عباس ، وزيد بن ثابت ، وبه يقول الشعبي والنخعي ، والحسن البصري ، وقتادة ، وجابر بن زيد ، والحكم . وبه يقول أهل المدينة والكوفة والبصرة . وهو قول الفقهاء السبعة والأئمة الأربعة وجمهور السلف والخلف بل جميعهم . وقد حكى الإجماع على ذلك غير واحد ، وورد فيه حديث مرفوع . قال أبو الحسين بن اللبان : وقد روي عن ابن عباس ما يخالف ذلك ، وهو أنه لا ولد له . والصحيح عنه الأول ، ولعل الراوي ما فهم عنه ما أراد .\nوقوله : ( وله أخ أو أخت ) أي : من أم ، كما هو في قراءة بعض السلف ، منهم سعد بن أبي وقاص ، وكذا فسرها أبو بكر الصديق فيما رواه قتادة عنه ، ( فلكل واحد منهما السدس فإن كانوا أكثر من ذلك فهم شركاء في الثلث )\nوإخوة الأم يخالفون بقية الورثة من وجوه ، أحدها : أنهم يرثون مع من أدلوا به وهي الأم . الثاني : أن ذكرهم وأنثاهم سواء . الثالث : أنهم لا يرثون إلا إذا كان ميتهم يورث كلالة ، فلا يرثون مع أب ، ولا جد ، ولا ولد ، ولا ولد ابن . الرابع : أنهم لا يزادون على الثلث ، وإن كثر ذكورهم وإناثهم .\nقال ابن أبي حاتم : حدثنا يونس ، حدثنا ابن وهب ، أخبرنا يونس ، عن الزهري قال : قضى عمر بن الخطاب ، رضي الله عنه ، أن ميراث الإخوة من الأم بينهم ، للذكر مثل الأنثى قال محمد بن شهاب الزهري : ولا أرى عمر قضى بذلك حتى علم بذلك من رسول الله صلى الله عليه وسلم ، ولهذه الآية التي قال الله تعالى : ( فإن كانوا أكثر من ذلك فهم شركاء في الثلث )\nواختلف العلماء في المسألة المشتركة ، وهي : زوج ، وأم أو جدة ، واثنان من ولد الأم وواحد أو أكثر من ولد الأبوين . فعلى قول الجمهور : للزوج النصف ، وللأم أو الجدة السدس ، ولولد الأم الثلث ، ويشاركهم فيه ولد الأب والأم بما بينهم من القدر المشترك وهو إخوة الأم .\nوقد وقعت هذه المسألة في زمن أمير المؤمنين عمر بن الخطاب ، فأعطى الزوج النصف ، والأم السدس ، وجعل الثلث لأولاد الأم ، فقال له أولاد الأبوين : يا أمير المؤمنين ، هب أن أبانا كان حمارا ، ألسنا من أم واحدة ؟ فشرك بينهم .\nوصح التشريك عنه وعن أمير المؤمنين عثمان ، وهو إحدى الروايتين عن ابن مسعود ، وزيد بن ثابت ، وابن عباس ، رضي الله عنهم . وبه يقول سعيد بن المسيب ، وشريح القاضي ، ومسروق ، وطاوس ، ومحمد بن سيرين وإبراهيم النخعي ، وعمر بن عبد العزيز ، والثوري ، وشريك وهو مذهب مالك والشافعي ، وإسحاق ابن راهويه .\nوكان علي بن أبي طالب لا يشرك بينهم ، بل يجعل الثلث لأولاد الأم ، ولا شيء لأولاد الأبوين ، والحالة هذه ، لأنهم عصبة . وقال وكيع بن الجراح : لم يختلف عنه في ذلك ، وهذا قول أبي بن كعب وأبي موسى الأشعري ، وهو المشهور عن ابن عباس ، وهو مذهب الشعبي وابن أبي ليلى ، وأبي يوسف ، ومحمد بن الحسن ، والحسن بن زياد ، وزفر بن الهذيل ، والإمام أحمد بن حنبل ، ويحيى بن آدم ونعيم بن حماد ، وأبي ثور ، وداود بن علي الظاهري ، واختاره أبو الحسين بن اللبان الفرضي ، رحمه الله ، في كتابه \" الإيجاز \" .\nوقوله : ( من بعد وصية يوصى بها أو دين غير مضار ) أي : لتكون وصيته على العدل ، لا على الإضرار والجور والحيف بأن يحرم بعض الورثة ، أو ينقصه ، أو يزيده على ما قدر الله له من الفريضة فمتى سعى في ذلك كان كمن ضاد الله في حكمته وقسمته; ولهذا قال ابن أبي حاتم :\nحدثنا أبي ، حدثنا أبو النضر الدمشقي الفراديسي ، حدثنا عمر بن المغيرة ، عن داود بن أبي هند ، عن عكرمة ، عن ابن عباس ، عن النبي صلى الله عليه وسلم قال : \" الإضرار في الوصية من الكبائر \" .\nوكذا رواه ابن جرير من طريق عمر بن المغيرة هذا وهو أبو حفص بصري سكن المصيصة ، قال أبو القاسم ابن عساكر : ويعرف بمفتي المساكين . وروى عنه غير واحد من الأئمة . وقال فيه أبو حاتم الرازي : هو شيخ . وقال علي بن المديني : هو مجهول لا أعرفه . لكن رواه النسائي في سننه عن علي ابن حجر ، عن علي بن مسهر ، عن داود بن أبي هند ، عن عكرمة ، عن ابن عباس ، موقوفا : \" الإضرار في الوصية من الكبائر \" . وكذا رواه ابن أبي حاتم عن أبي سعيد الأشج ، عن عائذ بن حبيب ، عن داود بن أبي هند . ورواه ابن جرير من حديث جماعة من الحفاظ ، عن داود ، عن عكرمة ، عن ابن عباس موقوفا وفي بعضها : ويقرأ ابن عباس : ( غير مضار )\nقال ابن جريج والصحيح الموقوف .\nولهذا اختلف الأئمة في الإقرار للوارث : هل هو صحيح أم لا ؟ على قولين : أحدهما : لا يصح لأنه مظنة التهمة أن يكون قد أوصى له بصيغة الإقرار وقد ثبت في الحديث الصحيح أن رسول الله صلى الله عليه وسلم قال : \" إن الله قد أعطى كل ذي حق حقه ، فلا وصية لوارث \" . وهذا مذهب أبي حنيفة ومالك ، وأحمد بن حنبل ، والقول القديم للشافعي ، رحمهم الله ، وذهب في الجديد إلى أنه يصح الإقرار . وهو مذهب طاوس ، وعطاء ، والحسن ، وعمر بن عبد العزيز .\nوهو اختيار أبي عبد الله البخاري في صحيحه . واحتج بأن رافع بن خديج أوصى ألا تكشف الفزارية عما أغلق عليه بابها قال : وقال بعض الناس : لا يجوز إقراره لسوء الظن به للورثة ، وقد قال النبي صلى الله عليه وسلم : \" إياكم والظن ، فإن الظن أكذب الحديث \" . وقال الله تعالى : ( إن الله يأمركم أن تؤدوا الأمانات إلى أهلها ) [ النساء : 58 ] فلم يخص وارثا ولا غيره . انتهى ما ذكره .\nفمتى كان الإقرار صحيحا مطابقا لما في نفس الأمر جرى فيه هذا الخلاف ، ومتى كان حيلة ووسيلة إلى زيادة بعض الورثة ونقصان بعضهم ، فهو حرام بالإجماع وبنص هذه الآية الكريمة ( غير مضار وصية من الله والله عليم حليم ) [ ثم قال الله ]\n                                    ",
        "qortoby": "وَلَكُمۡ نِصۡفُ مَا تَرَكَ أَزۡوَٰجُكُمۡ إِن لَّمۡ يَكُن لَّهُنَّ وَلَدٞۚ فَإِن كَانَ لَهُنَّ وَلَدٞ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكۡنَۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصِينَ بِهَآ أَوۡ دَيۡنٖۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكۡتُمۡ إِن لَّمۡ يَكُن لَّكُمۡ وَلَدٞۚ فَإِن كَانَ لَكُمۡ وَلَدٞ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكۡتُمۚ مِّنۢ بَعۡدِ وَصِيَّةٖ تُوصُونَ بِهَآ أَوۡ دَيۡنٖۗ وَإِن كَانَ رَجُلٞ يُورَثُ كَلَٰلَةً أَوِ ٱمۡرَأَةٞ وَلَهُۥٓ أَخٌ أَوۡ أُخۡتٞ فَلِكُلِّ وَٰحِدٖ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوٓاْ أَكۡثَرَ مِن ذَٰلِكَ فَهُمۡ شُرَكَآءُ فِي ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصَىٰ بِهَآ أَوۡ دَيۡنٍ غَيۡرَ مُضَآرّٖۚ وَصِيَّةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَلِيمٞ ٢١\n                                    \n                                    \n                                    ولكم نصف ما ترك أزواجكم إن لم يكن لهن ولد فإن كان لهن ولد فلكم الربع مما تركن من بعد وصية يوصين بها أو دين ولهن الربع مما تركتم إن لم يكن لكم ولد فإن كان لكم ولد فلهن الثمن مما تركتم من بعد وصية توصون بها أو دين وإن كان رجل يورث كلالة أو امرأة وله أخ أو أخت فلكل واحد منهما السدس فإن كانوا أكثر من ذلك فهم شركاء في الثلث من بعد وصية يوصى بها أو دين غير مضار وصية من الله والله عليم حليم فيه ثمانية مسائل :\nالأولى : قوله تعالى : ولكم نصف ما ترك أزواجكم الآيتين . الخطاب للرجال . والولد هنا بنو الصلب وبنو بنيهم وإن سفلوا ، ذكرانا وإناثا واحدا فما زاد بإجماع . وأجمع العلماء على أن للزوج النصف مع عدم الولد أو ولد الولد ، وله مع وجوده الربع . وترث المرأة من زوجها الربع مع فقد الولد ، والثمن مع وجوده . وأجمعوا على أن حكم الواحدة من الأزواج والثنتين والثلاث والأربع في الربع إن لم يكن له ولد ، وفي الثمن إن كان له ولد واحد ، وأنهن شركاء في ذلك ؛ لأن الله عز وجل لم يفرق بين حكم الواحدة منهن وبين حكم الجميع ، كما فرق بين حكم الواحدة من البنات والواحدة من الأخوات وبين حكم الجميع منهن .\nالثانية : قوله تعالى : وإن كان رجل يورث كلالة أو امرأة الكلالة مصدر ؛ من تكلله النسب أي أحاط به . وبه سمي الإكليل ، وهي منزلة من منازل القمر لإحاطتها بالقمر إذا احتل بها . ومنه الإكليل أيضا وهو التاج والعصابة المحيطة بالرأس . ( فإذا مات الرجل وليس له ولد ولا والد فورثته كلالة ) . هذا قول أبي بكر الصديق وعمر وعلي وجمهور أهل العلم . وذكر يحيى بن آدم عن شريك وزهير وأبي الأحوص عن أبي إسحاق عن سليمان بن عبد قال : ما رأيتهم إلا وقد تواطئوا وأجمعوا على أن الكلالة من مات ليس له ولد ولا والد . وهكذا قال صاحب كتاب العين وأبو منصور اللغوي وابن عرفة والقتبي وأبو عبيد وابن الأنباري . فالأب والابن طرفان للرجل ؛ فإذا ذهبا تكلله النسب . ومنه قيل : روضة مكللة إذا حفت بالنور . وأنشدوا :\nمسكنه روضة مكللة عم بها الأيهقان والذرق\nيعني نبتين . وقال امرؤ القيس :\nأصاح ترى برقا أريك وميضه كلمع اليدين في حبي مكلل\nفسموا القرابة كلالة ؛ لأنهم أطافوا بالميت من جوانبه وليسوا منه ولا هو منهم ، وإحاطتهم به أنهم ينتسبون معه . كما قال أعرابي : مالي كثير ويرثني كلالة متراخ نسبهم . وقال الفرزدق :\nورثتم قناة المجد لا عن كلالة عن ابني مناف عبد شمس وهاشم\nوقال آخر :\nوإن أبا المرء أحمى له ومولى الكلالة لا يغضب\nوقيل : إن الكلالة مأخوذة من الكلال وهو الإعياء ؛ فكأنه يصير الميراث إلى الوارث عن بعد وإعياء . قال الأعشى :\nفآليت لا أرثي لها من كلالة ولا من وجى حتى تلاقي محمدا\nوذكر أبو حاتم والأثرم عن أبي عبيدة قال : الكلالة كل من لم يرثه أب أو ابن أو أخ فهو عند العرب كلالة . قال أبو عمر : ذكر أبي عبيدة الأخ هنا مع الأب والابن في شرط الكلالة غلط لا وجه له ، ولم يذكره في شرط الكلالة غيره . وروي عن عمر بن الخطاب أن ( الكلالة من لا ولد له خاصة ) ؛ وروي عن أبي بكر ثم رجعا عنه . وقال ابن زيد : الكلالة الحي والميت جميعا . وعن عطاء : الكلالة المال . قال ابن العربي : وهذا قول طريف لا وجه له .\nقلت : له وجه يتبين بالإعراب آنفا . وروي عن ابن الأعرابي أن الكلالة بنو العم الأباعد .\nوعن السدي أن الكلالة الميت . وعنه مثل قول الجمهور . وهذه الأقوال تتبين وجوهها بالإعراب ؛ فقرأ بعض الكوفيين \" يورث كلالة \" بكسر الراء وتشديدها . وقرأ الحسن وأيوب \" يورث \" بكسر الراء وتخفيفها ، على اختلاف عنهما . وعلى هاتين القراءتين لا تكون الكلالة إلا الورثة أو المال . كذلك حكى أصحاب المعاني ؛ فالأول من ورث ، والثاني من أورث .\nوكلالة مفعوله وكان بمعنى وقع . ومن قرأ \" يورث \" بفتح الراء احتمل أن تكون الكلالة المال ، والتقدير : يورث وراثة كلالة فتكون نعتا لمصدر محذوف . ويجوز أن تكون الكلالة اسما للورثة وهي خبر كان ؛ فالتقدير : ذا ورثة . ويجوز أن تكون تامة بمعنى وقع ، ويورث نعت لرجل ، ورجل رفع بكان ، وكلالة نصب على التفسير أو الحال ؛ على أن الكلالة هو الميت ، التقدير : وإن كان رجل يورث متكلل النسب إلى الميت .\nالثامنة والعشرون : ذكر الله عز وجل في كتابه الكلالة في موضعين : آخر السورة وهنا ، ولم يذكر في الموضعين وارثا غير الإخوة . فأما هذه الآية فأجمع العلماء على أن الإخوة فيها عنى بها الإخوة للأم ؛ لقوله تعالى : فإن كانوا أكثر من ذلك فهم شركاء في الثلث . وكان سعد بن أبي وقاص يقرأ \" وله أخ أو أخت من أمه \" . ولا خلاف بين أهل العلم أن الإخوة للأب والأم أو الأب ليس ميراثهم كهذا ؛ فدل إجماعهم على أن الإخوة المذكورين في آخر السورة هم إخوة المتوفى لأبيه وأمه أو لأبيه ؛ لقوله عز وجل وإن كانوا إخوة رجالا ونساء فللذكر مثل حظ الأنثيين . ولم يختلفوا أن ميراث الإخوة للأم ليس هكذا ؛ فدلت الآيتان أن الإخوة كلهم جميعا كلالة . وقال الشعبي : ( الكلالة ما كان سوى الولد والوالد من الورثة إخوة أو غيرهم من العصبة ) . كذلك قال علي وابن مسعود وزيد وابن عباس ، وهو القول الأول الذي بدأنا به . قال الطبري : والصواب أن الكلالة هم الذين يرثون الميت من عدا ولده ووالده ، لصحة خبر جابر : فقلت يا رسول الله إنما يرثني كلالة ، أفأوصي بمالي كله ؟ قال : لا .\nالثالثة : قال أهل اللغة : يقال رجل كلالة وامرأة كلالة . ولا يثنى ولا يجمع ؛ لأنه مصدر كالوكالة والدلالة والسماحة والشجاعة . وأعاد ضمير مفرد في قوله : وله أخ ولم يقل لهما . ومضى ذكر الرجل والمرأة على عادة العرب إذا ذكرت اسمين ثم أخبرت عنهما وكانا في الحكم سواء ربما أضافت إلى أحدهما وربما أضافت إليهما جميعا ؛ تقول : من كان عنده غلام وجارية فليحسن إليه وإليها وإليهما وإليهم ؛ قال الله تعالى : واستعينوا بالصبر والصلاة وإنها لكبيرة . وقال تعالى : إن يكن غنيا أو فقيرا فالله أولى بهما ويجوز أولى بهم ؛ عن الفراء وغيره . ويقال في امرأة : مرأة ، وهو الأصل . وأخ أصله أخو ، يدل عليه أخوان ؛ فحذف منه وغير على غير قياس . قال الفراء ضم أول أخت ، لأن المحذوف منها واو ، وكسر أول بنت ؛ لأن المحذوف منها ياء . وهذا الحذف والتعليل على غير قياس أيضا .\nالرابعة : قوله تعالى : فإن كانوا أكثر من ذلك فهم شركاء في الثلث هذا التشريك يقتضي التسوية بين الذكر والأنثى وإن كثروا . وإذا كانوا يأخذون بالأم فلا يفضل الذكر على الأنثى . وهذا إجماع من العلماء ، وليس في الفرائض موضع يكون فيه الذكر والأنثى سواء إلا في ميراث الإخوة للأم . فإذا ماتت امرأة وتركت زوجها وأمها وأخاها لأمها فللزوج النصف وللأم الثلث وللأخ من الأم السدس . فإن تركت أخوين وأختين - والمسألة بحالها - فللزوج النصف وللأم السدس وللأخوين والأختين الثلث ، وقد تمت الفريضة . وعلى هذا عامة الصحابة ؛ لأنهم حجبوا الأم بالأخ والأخت من الثلث إلى السدس . وأما ابن عباس فإنه لم ير العول ولو جعل للأم الثلث لعالت المسألة ، وهو لا يرى ذلك . والعول مذكور في غير هذا الموضع ، ليس هذا موضعه . فإن تركت زوجها وإخوة لأم وأخا لأب وأم ؛ فللزوج النصف ، ولإخوتها لأمها الثلث ، وما بقي فلأخيها لأمها وأبيها . وهكذا من له فرض مسمى أعطيه ، والباقي للعصبة إن فضل . فإن تركت ستة إخوة مفترقين فهذه الحمارية ، وتسمى أيضا المشتركة . قال قوم : ( للإخوة للأم الثلث ، وللزوج النصف ، وللأم السدس ) ، وسقط الأخ والأخت من الأب والأم ، والأخ والأخت من الأب .\nروي عن علي وابن مسعود وأبي موسى والشعبي وشريك ويحيى بن آدم ، وبه قال أحمد بن حنبل واختاره ابن المنذر ؛ لأن الزوج والأم والأخوين للأم أصحاب فرائض مسماة ولم يبق للعصبة شيء . وقال قوم : ( الأم واحدة ، وهب أن أباهم كان حمارا ! وأشركوا بينهم في الثلث ) ؛ ولهذا سميت المشتركة والحمارية . روي هذا عن عمر وعثمان وابن مسعود أيضا وزيد بن ثابت ومسروق وشريح ، وبه قال مالك والشافعي وإسحاق . ولا تستقيم هذه المسألة أن لو كان الميت رجلا . فهذه جملة من علم الفرائض تضمنتها الآية ، والله الموفق للهداية .\nوكانت الوراثة في الجاهلية بالرجولية والقوة ، وكانوا يورثون الرجال دون النساء ؛ فأبطل الله عز وجل ذلك بقوله : للرجال نصيب مما اكتسبوا وللنساء نصيب كما تقدم . وكانت الوراثة أيضا في الجاهلية وبدء الإسلام بالمحالفة ، قال الله عز وجل : والذين عقدت أيمانكم على ما يأتي بيانه . ثم صارت بعد المحالفة بالهجرة ؛ قال الله تعالى : والذين آمنوا ولم يهاجروا ما لكم من ولايتهم من شيء حتى يهاجروا الأنفال : وسيأتي . وهناك يأتي القول في ذوي الأرحام وميراثهم ، إن شاء الله تعالى . وسيأتي في سورة \" النور \" ميراث ابن الملاعنة وولد الزنا والمكاتب بحول الله تعالى . والجمهور من العلماء على أن الأسير المعلوم حياته أن ميراثه ثابت ؛ لأنه داخل في جملة المسلمين الذين أحكام الإسلام جارية عليهم . وقد روي عن سعيد بن المسيب أنه قال في الأسير في يد العدو : لا يرث . وقد تقدم ميراث المرتد في سورة \" البقرة \" والحمد لله .\nالخامسة : قوله تعالى : غير مضار نصب على الحال والعامل يوصى .\nأي يوصي بها غير مضار ، أي غير مدخل الضرر على الورثة . أي لا ينبغي أن يوصي بدين ليس عليه ليضر بالورثة ؛ ولا يقر بدين . فالإضرار راجع إلى الوصية والدين ؛ أما رجوعه إلى الوصية فبأن يزيد على الثلث أو يوصي لوارث ، فإن زاد فإنه يرد ، إلا أن يجيزه الورثة ؛ لأن المنع لحقوقهم لا لحق الله تعالى . وإن أوصى لوارث فإنه يرجع ميراثا . وأجمع العلماء على أن الوصية للوارث لا تجوز . وقد تقدم هذا في \" البقرة \" . وأما رجوعه إلى الدين فبالإقرار في حالة لا يجوز له فيها ؛ كما لو أقر في مرضه لوارثه أو لصديق ملاطف ؛ فإن ذلك لا يجوز عندنا . وروي عن الحسن أنه قرأ غير مضار وصية من الله \" على الإضافة . قال النحاس : وقد زعم بعض أهل اللغة أن هذا لحن ؛ لأن اسم الفاعل لا يضاف إلى المصدر . والقراءة حسنة على حذف ، والمعنى : غير مضار ذي وصية ، أي غير مضار بها ورثته في ميراثهم . وأجمع العلماء على أن إقراره بدين لغير وارث حال المرض جائز إذا لم يكن عليه دين في الصحة .\nالسادسة : فإن كان عليه دين في الصحة ببينة وأقر لأجنبي بدين ؛ فقالت طائفة : يبدأ بدين الصحة ؛ هذا قول النخعي والكوفيين . قالوا : فإذا استوفاه صاحبه فأصحاب الإقرار في المرض يتحاصون . وقالت طائفة : هما سواء إذا كان لغير وارث . هذا قول الشافعي وأبي ثور وأبي عبيد ، وذكر أبو عبيد أنه قول أهل المدينة ورواه عن الحسن .\nالسابعة : قد مضى في \" البقرة \" الوعيد في الإضرار في الوصية ووجوهها . وقد روى أبو داود من حديث شهر بن حوشب ( وهو مطعون فيه ) عن أبي هريرة حدثه أن رسول الله صلى الله عليه وسلم قال : إن الرجل أو المرأة ليعمل بطاعة الله ستين سنة ثم يحضرهما الموت فيضاران في الوصية فتجب لهما النار . قال : وقرأ علي أبو هريرة من هاهنا من بعد وصية يوصى بها أو دين غير مضار حتى بلغ ذلك الفوز العظيم . وقال ابن عباس : ( الإضرار في الوصية من الكبائر ) ؛ ورواه عن النبي صلى الله عليه وسلم ، إلا أن مشهور مذهب مالك وابن القاسم أن الموصي لا يعد فعله مضارة في ثلثه ؛ لأن ذلك حقه فله التصرف فيه كيف شاء . وفي المذهب قوله : أن ذلك مضارة ترد . وبالله التوفيق .\nالثامنة : قوله تعالى : وصية نصب على المصدر في موضع الحال والعامل \" يوصيكم \" ويصح أن يعمل فيها مضار والمعنى أن يقع الضرر بها أو بسببها فأوقع عليها تجوزا ، قال ابن عطية ؛ وذكر أن الحسن بن أبي الحسن قرأ \" غير مضار وصية \" بالإضافة ؛ كما تقول : شجاع حرب . وبضة المتجرد ؛ في قول طرفة بن العبد . والمعنى على ما ذكرناه من التجوز في اللفظ لصحة المعنى .\nثم قال : والله عليم حليم يعني عليم بأهل الميراث حليم على أهل الجهل منكم . وقرأ بعض المتقدمين \" والله عليم حكيم يعني حكيم بقسمة الميراث والوصية .\n                                    ",
        "saadi": "وَلَكُمۡ نِصۡفُ مَا تَرَكَ أَزۡوَٰجُكُمۡ إِن لَّمۡ يَكُن لَّهُنَّ وَلَدٞۚ فَإِن كَانَ لَهُنَّ وَلَدٞ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكۡنَۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصِينَ بِهَآ أَوۡ دَيۡنٖۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكۡتُمۡ إِن لَّمۡ يَكُن لَّكُمۡ وَلَدٞۚ فَإِن كَانَ لَكُمۡ وَلَدٞ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكۡتُمۚ مِّنۢ بَعۡدِ وَصِيَّةٖ تُوصُونَ بِهَآ أَوۡ دَيۡنٖۗ وَإِن كَانَ رَجُلٞ يُورَثُ كَلَٰلَةً أَوِ ٱمۡرَأَةٞ وَلَهُۥٓ أَخٌ أَوۡ أُخۡتٞ فَلِكُلِّ وَٰحِدٖ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوٓاْ أَكۡثَرَ مِن ذَٰلِكَ فَهُمۡ شُرَكَآءُ فِي ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصَىٰ بِهَآ أَوۡ دَيۡنٍ غَيۡرَ مُضَآرّٖۚ وَصِيَّةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَلِيمٞ ٢١\n                                        \n                                        \n                                        \n                                        { وَلَكُمْ } أيها الأزواج { نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِن لَّمْ يَكُن لَّهُنَّ وَلَدٌ فَإِنْ كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ مِمَّا تَرَكْنَ مِن بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَا أَوْ دَيْنٍ وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِن لَّمْ يَكُنْ لَّكُمْ وَلَدٌ فَإِن كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُم مِّنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَوْ دَيْنٍ } ويدخل في مسمى الولد المشروط وجوده أو عدمه، ولد الصلب أو ولد الابن الذكر والأُنثى، الواحد والمتعدد، الذي من الزوج أو من غيره، ويخرج عنه ولد البنات إجماعًا. ثم قال تعالى: { وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلَالَةً أَوِ امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ } أي: من أم، كما هي في بعض القراءات. وأجمع العلماء على أن المراد بالإخوة هنا الإخوة للأُم، فإذا كان يورث كلالة أي: ليس للميت والد ولا ولد أي: لا أب ولا جد ولا ابن ولا ابن ابن ولا بنت ولا بنت ابن وإن نزلوا. وهذه هي الكلالة كما فسرها بذلك أبو بكر الصديق رضي الله عنه، وقد حصل على ذلك الاتفاق ولله الحمد. { فَلِكُلِّ وَاحِدٍ مِّنْهُمَا } أي: من الأخ والأخت { السُّدُسُ }، { فَإِن كَانُوا أَكْثَرَ مِنْ ذَلِكَ } أي: من واحد { فَهُمْ شُرَكَاءُ فِي الثُّلُثِ } أي: لا يزيدون على الثلث ولو زادوا عن اثنين. ودل قوله: { فَهُمْ شُرَكَاءُ فِي الثُّلُثِ } أن ذَكَرهم وأنثاهم سواء، لأن لفظ \"التشريك\" يقتضي التسوية. ودل لفظ { الْكَلَالَةِ } على أن الفروع وإن نزلوا، والأصولَ الذكور وإن علوا، يُسقطون أولاد الأُم، لأن الله لم يورثهم إلا في الكلالة، فلو لم يكن يورث كلالة، لم يرثوا منه شيئًا اتفاقًا. ودل قوله: { فَهُمْ شُرَكَاءُ فِي الثُّلُثِ } أن الإخوة الأشقاء يَسقُطون في المسألة المسماة بالحمارية. وهى: زوج، وأم، وإخوة لأم، وإخوة أشقاء. للزوج النصف، وللأم السدس، وللأخوة للأم الثلث، ويسقط الأشقاء، لأن الله أضاف الثلث للإخوة من الأُم، فلو شاركهم الأشقاء لكان جمعا لما فرَّق الله حكمه. وأيضا فإن الإخوة للأم أصحاب فروض، والأشقاء عصبات. وقد قال النبي صلى الله عليه وسلم: - \"ألحقوا الفرائض بأهلها فما بقي فلأولى رجل ذكر\" - وأهل الفروض هم الذين قدَّر الله أنصباءهم، ففي هذه المسألة لا يبقى بعدهم شيء، فيَسْقُط الأشقاء، وهذا هو الصواب في ذلك. وأما ميراث الإخوة والأخوات الأشقاء أو لأب، فمذكور في قوله: { يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلَالَةِ } الآية. فالأخت الواحدة شقيقة أو لأب لها النصف، والثنتان لهما الثلثان، والشقيقة الواحدة مع الأخت للأب أو الأخوات تأخذ النصف، والباقي من الثلثين للأخت أو الأخوات لأب وهو السدس تكملة الثلثين. وإذ استغرقت الشقيقات الثلثين سقط الأخوات للأب كما تقدم في البنات وبنات الابن. وإن كان الإخوة رجالاً ونساءً فللذكر مثل حظ الأنثيين. فإن قيل: فهل يستفاد حكم ميراث القاتل، والرقيق، والمخالف في الدين، والمبعض، والخنثى، والجد مع الإخوة لغير أم، والعول، والرد، وذوي الأرحام، وبقية العصبة، والأخوات لغير أم مع البنات أو بنات الابن من القرآن أم لا؟ قيل: نعم، فيه تنبيهات وإشارات دقيقة يعسر فهمها على غير المتأمل تدل على جميع المذكورات. فأما (القاتل والمخالف في الدين) فيعرف أنهما غير وارثين من بيان الحكمة الإلهية في توزيع المال على الورثة بحسب قربهم ونفعهم الديني والدنيوي. وقد أشار تعالى إلى هذه الحكمة بقوله: { لَا تَدْرُونَ أَيُّهُمْ أَقْرَبُ لَكُمْ نَفْعًا } وقد عُلم أن القاتل قد سعى لمورثه بأعظم الضرر، فلا ينتهض ما فيه من موجب الإرث أن يقاوم ضرر القتل الذي هو ضد النفع الذي رتب عليه الإرث. فعُلم من ذلك أن القتل أكبر مانع يمنع الميراث، ويقطع الرحم الذي قال الله فيه: { وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ } مع أنه قد استقرت القاعدة الشرعية أن \"من استعجل شيئا قبل أوانه عوقب بحرمانه\" وبهذا ونحوه يعرف أن المخالف لدين الموروث لا إرث له، وذلك أنه قد تعارض الموجب الذي هو اتصال النسب الموجب للإرث، والمانعُ الذي هو المخالفة في الدين الموجبة للمباينة من كل وجه، فقوي المانع ومنع موجب الإرث الذي هو النسب، فلم يعمل الموجب لقيام المانع. يوضح ذلك أن الله تعالى قد جعل حقوق المسلمين أولى من حقوق الأقارب الكفار الدنيوية، فإذا مات المسلم انتقل ماله إلى من هو أولى وأحق به. فيكون قوله تعالى: { وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ } إذا اتفقت أديانهم، وأما مع تباينهم فالأخوة الدينية مقدمة على الأخوة النسبية المجردة. قال ابن القيم في \"جلاء الأفهام\": وتأمل هذا المعنى في آية المواريث، وتعليقه سبحانه التوارث فيها بلفظ الزوجة دون المرأة، كما في قوله تعالى: { وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ } إيذانا بأن هذا التوارث إنما وقع بالزوجية المقتضية للتشاكل والتناسب، والمؤمن والكافر لا تشاكل بينهما ولا تناسب، فلا يقع بينهما التوارث. وأسرار مفردات القرآن ومركباته فوق عقول العالمين [انتهى]. وأما ( الرقيق ) فإنه لا يرث ولا يورث، أما كونه لا يورث فواضح، لأنه ليس له مال يورث عنه، بل كل ما معه فهو لسيده. وأما كونه لا يرث فلأنه لا يملك، فإنه لو ملك لكان لسيده، وهو أجنبي من الميت فيكون مثل قوله تعالى: { لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْن } { وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ } { فَلِكُلِّ وَاحِدٍ مِّنْهُمَا السُّدُسُ } ونحوها لمن يتأتى منه التملك، وأما الرقيق فلا يتأتى منه ذلك، فعلم أنه لا ميراث له. وأما مَنْ بعضه حر وبعضه رقيق فإنه تتبعض أحكامه. فما فيه من الحرية يستحق بها ما رتبه الله في المواريث، لكون ما فيه من الحرية قابلا للتملك، وما فيه من الرق فليس بقابل لذلك، فإذا يكون المبعض، يرث ويورث، ويحجب بقدر ما فيه من الحرية. وإذا كان العبد يكون محمودا مذموما، مثابا ومعاقبا، بقدر ما فيه من موجبات ذلك، فهذا كذلك. وأما ( الخنثى ) فلا يخلو إما أن يكون واضحا ذكوريته أو أنوثيته، أو مشكلا. فإن كان واضحا فالأمر فيه واضح. إن كان ذكرا فله حكم الذكور، ويشمله النص الوارد فيهم. وإن كان أنثى فله حكم الإناث، ويشملها النص الوارد فيهن. وإن كان مشكلا، فإن كان الذكر والأنثى لا يختلف إرثهما -كالإخوة للأم- فالأمر فيه واضح، وإن كان يختلف إرثه بتقدير ذكوريته وبتقدير أنوثيته، ولم يبق لنا طريق إلى العلم بذلك، لم نعطه أكثر التقديرين، لاحتمال ظلم من معه من الورثة، ولم نعطه الأقل، لاحتمال ظلمنا له. فوجب التوسط بين الأمرين، وسلوكُ أعدل الطريقين، قال تعالى: { اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَى } وليس لنا طريق إلى العدل في مثل هذا أكثر من هذا الطريق المذكور. و { لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا } { فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ } وأما ( ميراث الجد ) مع الإخوة الأشقاء أو لأب، وهل يرثون معه أم لا؟ فقد دل كتاب الله على قول أبي بكر الصديق رضي الله عنه، وأن الجد يحجب الإخوة أشقاء أو لأب أو لأم، كما يحجبهم الأب. وبيان ذلك: أن الجد أب في غير موضع من القرآن كقوله تعالى: { إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِنْ بَعْدِي قَالُوا نَعْبُدُ إِلَهَكَ وَإِلَهَ آبَائِكَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ } الآية. وقال يوسف عليه السلام: { وَاتَّبَعْتُ مِلَّةَ آبَائِي إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ } فسمى الله الجد وجد الأب أبا، فدل ذلك على أن الجد بمنزلة الأب، يرث ما يرثه الأب، ويحجب من يحجبه. وإذا كان العلماء قد أجمعوا على أن الجد حكمه حكم الأب عند عدمه في ميراثه مع الأولاد وغيرهم من بني الإخوة والأعمام وبنيهم، وسائر أحكام المواريث، فينبغي أيضا أن يكون حكمُه حكمَه في حجب الإخوة لغير أم. وإذا كان ابن الابن بمنزلة ابن الصلب فلم لا يكون الجد بمنزلة الأب؟ وإذا كان جد الأب مع ابن الأخ قد اتفق العلماء على أنه يحجبه. فلم لا يحجب جد الميت أخاه؟ فليس مع مَنْ يورِّث الإخوةَ مع الجد، نص ولا إشارة ولا تنبيه ولا قياس صحيح. وأما مسائل (العول) فإنه يستفاد حكمها من القرآن، وذلك أن الله تعالى قد فرض وقدر لأهل المواريث أنصباء، وهم بين حالتين: إما أن يحجب بعضهم بعضًا أو لا. فإن حجب بعضهم بعضا، فالمحجوب ساقط لا يزاحِم ولا يستحق شيئا، وإن لم يحجب بعضهم بعضا فلا يخلو، إما أن لا تستغرق الفروض التركة، أو تستغرقها من غير زيادة ولا نقص، أو تزيد الفروض على التركة، ففي الحالتين الأوليين كل يأخذ فرضه كاملا. وفي الحالة الأخيرة وهي ما إذا زادت الفروض على التركة فلا يخلو من حالين: إما أن ننقص بعضَ الورثة عن فرضه الذي فرضه الله له، ونكمل للباقين منهم فروضهم، وهذا ترجيح بغير مرجح، وليس نقصان أحدهم بأولى من الآخر، فتعينت الحال الثانية، وهي: أننا نعطي كل واحد منهم نصيبه بقدر الإمكان، ونحاصص بينهم كديون الغرماء الزائدة على مال الغريم، ولا طريق موصل إلى ذلك إلا بالعول، فعلم من هذا أن العول في الفرائض قد بينه الله في كتابه. وبعكس هذه الطريقة بعينها يعلم ( الرد ) فإن أهل الفروض إذا لم تستغرق فروضُهم التركةَ وبقي شيء ليس له مستحق من عاصب قريب ولا بعيد، فإن رده على أحدهم ترجيح بغير مرجح، وإعطاؤه غيرَهم ممن ليس بقريب للميت جنف وميل، ومعارضة لقوله: { وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ } فتعين أن يُرَدَّ على أهل الفروض بقدر فروضهم. ولما كان الزوجان ليسا من القرابة، لم يستحقا زيادة على فرضهم المقدر [هذا عند من لا يورِّث الزوجين بالرد، وهم جمهور القائلين بالرد، فعلى هذا تكون علة الرد كونه صاحب فرض قريبا، وعلى القول الآخر، أن الزوجين كغيرهما من ذوي الفروض يُرَدُّ عليهما؛ فكما ينقصان بالعول فإنهما يزادان بالرد كغيرهما، فالعلة على هذا كونه وارثا صاحب فرض، فهذا هو الظاهر من دلالة الكتاب والسنة، والقياس الصحيح، والله أعلم] وبهذا يعلم أيضا ( ميراث ذوي الأرحام ) فإن الميت إذا لم يخلف صاحب فرض ولا عاصبا، وبقي الأمر دائرا بين كون ماله يكون لبيت المال لمنافع الأجانب، وبين كون ماله يرجع إلى أقاربه المدلين بالورثة المجمع عليهم، ويدل على ذلك قوله تعالى: { وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ } فصرفه لغيرهم ترك لمن هو أولى من غيره، فتعين توريث ذوي الأرحام. وإذا تعين توريثهم، فقد علم أنه ليس لهم نصيب مقدر بأعيانهم في كتاب الله. وأن بينهم وبين الميت وسائط، صاروا بسببها من الأقارب. فينزلون منزلة من أدلوا به من تلك الوسائط. والله أعلم. وأما ( ميراث بقية العصبة ) كالبنوة والأخوة وبنيهم، والأعمام وبنيهم إلخ فإن النبي صلى الله عليه وسلم قال: \"ألحقوا الفرائض بأهلها فما بقي فلأولي رجل ذكر\" وقال تعالى: { وَلِكُلٍّ جَعَلْنَا مَوَالِيَ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ } فإذا ألحقنا الفروض بأهلها ولم يبق شيء، لم يستحق العاصب شيئًا، وإن بقي شيء أخذه أولي العصبة، وبحسب جهاتهم ودرجاتهم. فإن جهات العصوبة خمس: البنوة، ثم الأبوة، ثم الأخوة وبنوهم، ثم العمومة وبنوهم، ثم الولاء، فيقدم منهم الأقرب جهة. فإن كانوا في جهة واحدة فالأقرب منزلة، فإن كانوا في منزلة واحدة فالأقوى، وهو الشقيق، فإن تساووا من كل وجه اشتركوا. والله أعلم. وأما كون الأخوات لغير أم مع البنات أو بنات الابن عصبات، يأخذن ما فضل عن فروضهن، فلأنه ليس في القرآن ما يدل على أن الأخوات يسقطن بالبنات. فإذا كان الأمر كذلك، وبقي شيء بعد أخذ البنات فرضهن، فإنه يعطى للأخوات ولا يعدل عنهن إلى عصبة أبعد منهن، كابن الأخ والعم، ومن هو أبعد منهم. والله أعلم.\n                                    "
      },
      "originalText": "۞ وَلَكُمۡ نِصۡفُ مَا تَرَكَ أَزۡوَٰجُكُمۡ إِن لَّمۡ يَكُن لَّهُنَّ وَلَدٞۚ فَإِن كَانَ لَهُنَّ وَلَدٞ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكۡنَۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصِينَ بِهَآ أَوۡ دَيۡنٖۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكۡتُمۡ إِن لَّمۡ يَكُن لَّكُمۡ وَلَدٞۚ فَإِن كَانَ لَكُمۡ وَلَدٞ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكۡتُمۚ مِّنۢ بَعۡدِ وَصِيَّةٖ تُوصُونَ بِهَآ أَوۡ دَيۡنٖۗ وَإِن كَانَ رَجُلٞ يُورَثُ كَلَٰلَةً أَوِ ٱمۡرَأَةٞ وَلَهُۥٓ أَخٌ أَوۡ أُخۡتٞ فَلِكُلِّ وَٰحِدٖ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوٓاْ أَكۡثَرَ مِن ذَٰلِكَ فَهُمۡ شُرَكَآءُ فِي ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصَىٰ بِهَآ أَوۡ دَيۡنٍ غَيۡرَ مُضَآرّٖۚ وَصِيَّةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَلِيمٞ ٢١ "
    },
    {
      "number": 506,
      "text": "تِلْكَ حُدُودُ اللَّهِ ۚ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ وَذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 13,
      "juz": 4,
      "manzil": 1,
      "page": 79,
      "ruku": 63,
      "hizbQuarter": 32,
      "sajda": false,
      "tafsier": {
        "ibnkther": "تِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ وَذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٣١\n                                    \n                                    \n                                    أي : هذه الفرائض والمقادير التي جعلها الله للورثة بحسب قربهم من الميت واحتياجهم إليه وفقدهم له عند عدمه ، هي حدود الله فلا تعتدوها ولا تجاوزوها; ولهذا قال : ( ومن يطع الله ورسوله ) أي : فيها ، فلم يزد بعض الورثة ولم ينقص بعضا بحيلة ووسيلة ، بل تركهم على حكم الله وفريضته وقسمته ( يدخله جنات تجري من تحتها الأنهار خالدين فيها وذلك الفوز العظيم.\n                                    ",
        "qortoby": "تِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ وَذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٣١\n                                    \n                                    \n                                    قوله : تلك حدود الله ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار خالدين فيها وذلك الفوز العظيم\nقوله تعالى : تلك حدود الله وتلك بمعنى هذه ، أي هذه أحكام الله قد بينها لكم لتعرفوها وتعملوا بها .\nومن يطع الله ورسوله في قسمة المواريث فيقر بها ويعمل بها كما أمره الله تعالى يدخله جنات تجري من تحتها الأنهار جملة في موضع نصب على النعت لجنات\n                                    ",
        "saadi": "تِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ وَذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٣١\n                                        \n                                        \n                                        \n                                        أي: تلك التفاصيل التي ذكرها في المواريث حدود الله التي يجب الوقوف معها وعدم مجاوزتها، ولا القصور عنها، وفي ذلك دليل على أن الوصية للوارث منسوخة بتقديره تعالى أنصباء الوارثين. ثم قوله تعالى: { تِلْكَ حُدُودُ اللَّهِ } فالوصية للوارث بزيادة على حقه يدخل في هذا التعدي، مع قوله صلى الله عليه وسلم: \"لا وصية لوارث\" ثم ذكر طاعة الله ورسوله ومعصيتهما عموما ليدخل في العموم لزوم حدوده في الفرائض أو ترك ذلك فقال: { وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ } بامتثال أمرهما الذي أعظمه طاعتهما في التوحيد، ثم الأوامر على اختلاف درجاتها واجتناب نهيهما الذي أعظمُه الشرك بالله، ثم المعاصي على اختلاف طبقاتها { يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا } فمن أدى الأوامر واجتنب النواهي فلا بد له من دخول الجنة والنجاة من النار. { وَذَلِكَ الْفَوْزُ الْعَظِيمُ } الذي حصل به النجاة من سخطه وعذابه، والفوز بثوابه ورضوانه بالنعيم المقيم الذي لا يصفه الواصفون.\n                                    "
      },
      "originalText": "تِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ وَذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ ٣١"
    },
    {
      "number": 507,
      "text": "وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ وَيَتَعَدَّ حُدُودَهُ يُدْخِلْهُ نَارًا خَالِدًا فِيهَا وَلَهُ عَذَابٌ مُهِينٌ",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 14,
      "juz": 4,
      "manzil": 1,
      "page": 79,
      "ruku": 63,
      "hizbQuarter": 32,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ وَيَتَعَدَّ حُدُودَهُۥ يُدۡخِلۡهُ نَارًا خَٰلِدٗا فِيهَا وَلَهُۥ عَذَابٞ مُّهِينٞ ٤١\n                                    \n                                    \n                                    أي ، لكونه غير ما حكم الله به وضاد الله في حكمه . وهذا إنما يصدر عن عدم الرضا بما قسم الله وحكم به ، ولهذا يجازيه بالإهانة في العذاب الأليم المقيم .\nقال الإمام أحمد : حدثنا عبد الرزاق ، أخبرنا معمر ، عن أيوب ، عن أشعث بن عبد الله ، عن شهر بن حوشب ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" إن الرجل ليعمل بعمل أهل الخير سبعين سنة ، فإذا أوصى حاف في وصيته ، فيختم بشر عمله ، فيدخل النار; وإن الرجل ليعمل بعمل أهل الشر سبعين سنة ، فيعدل في وصيته ، فيختم له بخير عمله فيدخل الجنة \" . قال : ثم يقول أبو هريرة : اقرءوا إن شئتم ( تلك حدود الله ) إلى قوله : ( عذاب مهين ) .\n[ و ] قال أبو داود في باب الإضرار في الوصية من سننه : حدثنا عبدة بن عبد الله أخبرنا عبد الصمد ، حدثنا [ نصر ] بن علي الحداني ، حدثنا الأشعث بن عبد الله بن جابر الحداني ، حدثني شهر بن حوشب : أن أبا هريرة حدثه : أن رسول الله صلى الله عليه وسلم قال : \" إن الرجل ليعمل أو المرأة بطاعة الله ستين سنة ، ثم يحضرهما الموت فيضاران في الوصية ، فتجب لهما النار \" وقال : قرأ علي أبو هريرة من هاهنا : ( من بعد وصية يوصى بها أو دين غير مضار ) حتى بلغ : ( [ و ] ذلك الفوز العظيم ) .\nوهكذا رواه الترمذي وابن ماجه من حديث ابن عبد الله بن جابر الحداني به ، وقال الترمذي : حسن غريب ، وسياق الإمام أحمد أتم وأكمل .\n                                    ",
        "qortoby": "وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ وَيَتَعَدَّ حُدُودَهُۥ يُدۡخِلۡهُ نَارًا خَٰلِدٗا فِيهَا وَلَهُۥ عَذَابٞ مُّهِينٞ ٤١\n                                    \n                                    \n                                    وقوله : ومن يعص الله ورسوله يريد في قسمة المواريث فلم يقسمها ولم يعمل بها ويتعد حدوده أي يخالف أمره يدخله نارا خالدا فيها والعصيان إن أريد به الكفر فالخلود على بابه ، وإن أريد به الكبائر وتجاوز أوامر الله تعالى فالخلود مستعار لمدة ما . كما تقول : خلد الله ملكه . وقال زهير :\nولا خالدا إلا الجبال الرواسيا\nوقد تقدم هذا المعنى في غير موضع . وقرأ نافع وابن عامر \" ندخله \" بالنون في الموضعين ، على معنى الإضافة إلى نفسه سبحانه . الباقون بالياء كلاهما ؛ لأنه سبق ذكر اسم الله تعالى أي يدخله الله .\n                                    ",
        "saadi": "وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ وَيَتَعَدَّ حُدُودَهُۥ يُدۡخِلۡهُ نَارًا خَٰلِدٗا فِيهَا وَلَهُۥ عَذَابٞ مُّهِينٞ ٤١\n                                        \n                                        \n                                        \n                                        { وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ وَيَتَعَدَّ حُدُودَهُ يُدْخِلْهُ نَارًا خَالِدًا فِيهَا وَلَهُ عَذَابٌ مُّهِينٌ } ويدخل في اسم المعصية الكفر فما دونه من المعاصي، فلا يكون فيها شبهة للخوارج القائلين بكفر أهل المعاصي فإن الله تعالى رتب دخول الجنة على طاعته وطاعة رسوله. ورتب دخول النار على معصيته ومعصية رسوله، فمن أطاعه طاعة تامة دخل الجنة بلا عذاب. ومن عصى الله ورسوله معصية تامة يدخل فيها الشرك فما دونه، دخل النار وخلد فيها، ومن اجتمع فيه معصية وطاعة، كان فيه من موجب الثواب والعقاب بحسب ما فيه من الطاعة والمعصية. وقد دلت النصوص المتواترة على أن الموحدين الذين معهم طاعة التوحيد، غير مخلدين في النار، فما معهم من التوحيد مانع لهم من الخلود فيها.\n                                    "
      },
      "originalText": "وَمَن يَعۡصِ ٱللَّهَ وَرَسُولَهُۥ وَيَتَعَدَّ حُدُودَهُۥ يُدۡخِلۡهُ نَارًا خَٰلِدٗا فِيهَا وَلَهُۥ عَذَابٞ مُّهِينٞ ٤١"
    }
  ]
}