{
  "number": 8,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 56,
      "text": "وَإِذْ نَجَّيْنَاكُمْ مِنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ يُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ ۚ وَفِي ذَٰلِكُمْ بَلَاءٌ مِنْ رَبِّكُمْ عَظِيمٌ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 49,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ نَجَّيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُذَبِّحُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ ٩٤\n                                    \n                                    \n                                    قول تعالى : واذكروا يا بني إسرائيل نعمتي عليكم إذ نجيناكم من آل فرعون أي :\nخلصتكم منهم وأنقذتكم من أيديهم صحبة موسى ، عليه السلام ، وقد كانوا يسومونكم ، أي : يوردونكم ويذيقونكم ويولونكم سوء العذاب . وذلك أن فرعون - لعنه الله - كان قد رأى رؤيا هالته ، رأى نارا خرجت من بيت المقدس فدخلت دور القبط ببلاد مصر ، إلا بيوت بني إسرائيل ، مضمونها أن زوال ملكه يكون على يدي رجل من بني إسرائيل ، ويقال : بل تحدث سماره عنده بأن بني إسرائيل يتوقعون خروج رجل منهم ، يكون لهم به دولة ورفعة ، وهكذا جاء في حديث الفتون ، كما سيأتي في موضعه [ في سورة طه ] إن شاء الله ، فعند ذلك أمر فرعون - لعنه الله - بقتل كل [ ذي ] ذكر يولد بعد ذلك من بني إسرائيل ، وأن تترك البنات ، وأمر باستعمال بني إسرائيل في مشاق الأعمال وأراذلها .\nوهاهنا فسر العذاب بذبح الأبناء ، وفي سورة إبراهيم عطف عليه ، كما قال : ( يسومونكم سوء العذاب ويذبحون أبناءكم ويستحيون نساءكم ) [ إبراهيم : 6 ] وسيأتي تفسير ذلك في أول سورة القصص ، إن شاء الله تعالى ، وبه الثقة والمعونة والتأييد .\nومعنى ( يسومونكم ) أي : يولونكم ، قاله أبو عبيدة ، كما يقال : سامه خطة خسف إذا أولاه إياها ، قال عمرو بن كلثوم :\nإذا ما الملك سام الناس خسفا أبينا أن نقر الخسف فينا\nوقيل : معناه : يديمون عذابكم ، كما يقال : سائمة الغنم من إدامتها الرعي ، نقله القرطبي ، وإنما قال هاهنا : ( يذبحون أبناءكم ويستحيون نساءكم ) ليكون ذلك تفسيرا للنعمة عليهم في قوله : ( يسومونكم سوء العذاب ) ثم فسره بهذا لقوله هاهنا ( اذكروا نعمتي التي أنعمت عليكم ) وأما في سورة إبراهيم فلما قال : ( وذكرهم بأيام الله ) [ إبراهيم : 5 ] ، أي : بأياديه ونعمه عليهم فناسب أن يقول هناك : ( يسومونكم سوء العذاب ويذبحون أبناءكم ويستحيون نساءكم ) فعطف عليه الذبح ليدل على تعدد النعم والأيادي .\nوفرعون علم على كل من ملك مصر ، كافرا من العماليق وغيرهم ، كما أن قيصر علم على كل من ملك الروم مع الشام كافرا ، وكسرى لكل من ملك الفرس ، وتبع لمن ملك اليمن كافرا [ والنجاشي لمن ملك الحبشة ، وبطليموس لمن ملك الهند ] ويقال : كان اسم فرعون الذي كان في زمن موسى ، عليه السلام ، الوليد بن مصعب بن الريان ، وقيل : مصعب بن الريان ، أيا ما كان فعليه لعنة الله ، [ وكان من سلالة عمليق بن داود بن إرم بن سام بن نوح ، وكنيته أبو مرة ، وأصله فارسي من استخر ] .\nوقوله تعالى : ( وفي ذلكم بلاء من ربكم عظيم ) قال ابن جرير : وفي الذي فعلنا بكم من إنجائنا إياكم مما كنتم فيه من عذاب آل فرعون بلاء لكم من ربكم عظيم . أي : نعمة عظيمة عليكم في ذلك .\nوقال علي بن أبي طلحة ، عن ابن عباس [ في ] قوله : ( بلاء من ربكم عظيم ) قال : نعمة . وقال مجاهد : ( بلاء من ربكم عظيم ) قال : نعمة من ربكم عظيمة . وكذا قال أبو العالية ، وأبو مالك ، والسدي ، وغيرهم .\nوأصل البلاء : الاختبار ، وقد يكون بالخير والشر ، كما قال تعالى : ( ونبلوكم بالشر والخير فتنة ) [ الأنبياء : 25 ] ، وقال : ( وبلوناهم بالحسنات والسيئات ) [ الأعراف : 168 ] .\nقال ابن جرير : وأكثر ما يقال في الشر : بلوته أبلوه بلاء ، وفي الخير : أبليه إبلاء وبلاء ، قال زهير بن أبي سلمى :\nجزى الله بالإحسان ما فعلا بكم وأبلاهما خير البلاء الذي يبلو\nقال : فجمع بين اللغتين ؛ لأنه أراد فأنعم الله عليهما خير النعم التي يختبر بها عباده .\n[ وقيل : المراد بقوله : ( وفي ذلكم بلاء ) إشارة إلى ما كانوا فيه من العذاب المهين من ذبح الأبناء واستحياء النساء ؛ قال القرطبي : وهذا قول الجمهور ولفظه بعدما حكى القول الأول ، ثم قال : وقال الجمهور : الإشارة إلى الذبح ونحوه ، والبلاء هاهنا في الشر ، والمعنى في الذبح مكروه وامتحان ] .\n                                    ",
        "qortoby": "وَإِذۡ نَجَّيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُذَبِّحُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ ٩٤\n                                    \n                                    \n                                    قوله تعالى : وإذ نجيناكم من آل فرعون يسومونكم سوء العذاب يذبحون أبناءكم ويستحيون نساءكم وفي ذلكم بلاء من ربكم عظيم\nفيه ثلاث عشرة مسألة : الأولى : قوله تعالى : وإذ نجيناكم من آل فرعون إذ في موضع نصب عطف على اذكروا نعمتي وهذا وما بعده تذكير ببعض النعم التي كانت له عليهم أي اذكروا نعمتي بإنجائكم من عدوكم وجعل الأنبياء فيكم ، والخطاب للموجودين ، والمراد من سلف من الآباء كما قال إنا لما طغى الماء حملناكم في الجارية أي حملنا آباءكم وقيل إنما قال نجيناكم ؛ لأن نجاة الآباء كانت سببا لنجاة هؤلاء الموجودين ، ومعنى نجيناكم ألقيناكم على نجوة من الأرض ، وهي ما ارتفع منها هذا هو الأصل ثم سمي كل فائز ناجيا فالناجي من خرج من ضيق إلى سعة وقرئ ( وإذ نجيتكم ) على التوحيد\nالثانية : قوله تعالى : من آل فرعون آل فرعون قومه وأتباعه وأهل دينه وكذلك آل الرسول صلى الله عليه وسلم من هو على دينه وملته في عصره وسائر الأعصار سواء كان نسيبا له أو لم يكن ، ومن لم يكن على دينه وملته فليس من آله ولا أهله وإن كان نسيبه وقريبه خلافا للرافضة حيث قالت إن آل رسول الله صلى الله عليه وسلم فاطمة والحسن والحسين فقط دليلنا قوله تعالى وأغرقنا آل فرعون أدخلوا آل فرعون أشد العذاب أي آل دينه ؛ إذ لم يكن له ابن ولا بنت ولا أب ولا عم ولا أخ ولا عصبة ؛ ولأنه لا خلاف أن من ليس بمؤمن ولا موحد فإنه ليس من آل محمد وإن كان قريبا له ولأجل هذا يقال إن أبا لهب وأبا جهل ليسا من آله ولا من أهله وإن كان بينهما وبين النبي صلى الله عليه وسلم قرابة ولأجل هذا قال الله تعالى في ابن نوح إنه ليس من أهلك إنه عمل غير صالح وفي صحيح مسلم عن عمرو بن العاص قال سمعت رسول الله صلى الله عليه وسلم جهارا غير سر يقول ألا إن آل أبي يعني فلانا ليسوا لي بأولياء إنما وليي الله وصالح المؤمنين وقالت طائفة آل محمد أزواجه وذريته خاصة لحديث أبي حميد الساعدي أنهم قالوا يا رسول الله كيف نصلي عليك ؟ قال : قولوا اللهم صل على محمد وعلى أزواجه وذريته كما صليت على آل إبراهيم وبارك على محمد وعلى أزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد رواه مسلم ، وقالت طائفة من أهل العلم الأهل معلوم والآل الأتباع والأول أصح لما ذكرناه ولحديث عبد الله بن أبي أوفى أن رسول الله صلى الله عليه وسلم كان إذا أتاه قوم بصدقتهم قال ( اللهم صل عليهم ) فأتاه أبي بصدقته فقال اللهم صل على آل أبي أوفى .\nالثالثة : اختلف النحاة هل يضاف الآل إلى البلدان أو لا فقال الكسائي إنما يقال آل فلان وآل فلانة ولا يقال في البلدان هو من آل حمص ولا من آل المدينة قال الأخفش إنما يقال في الرئيس الأعظم نحو آل محمد صلى الله عليه وسلم وآل فرعون ؛ لأنه رئيسهم في الضلالة قال وقد سمعناه في البلدان قالوا أهل المدينة وآل المدينة .\nالرابعة : واختلف النحاة أيضا هل يضاف الآل إلى المضمر أو لا فمنع من ذلك النحاس والزبيدي والكسائي فلا يقال إلا اللهم صل على محمد وآل محمد ولا يقال وآله والصواب أن يقال أهله وذهبت طائفة أخرى إلى أن ذلك يقال منهم ابن السيد وهو الصواب ؛ لأن السماع الصحيح يعضده فإنه قد جاء في قول عبد المطلب\nلا هم إن العبد يم نع رحله فامنع حلالك وانصر على آل الصلي\nب \" وعابديه \" اليوم آلك\nوقال ندبة\nأنا الفارس الحامي حقيقة والدي وآلي كما تحمي حقيقة آلكا\nالحقيقة [ بقافين ] ما يحق على الإنسان أن يحميه أي تجب عليه حمايته .\nالخامسة : واختلفوا أيضا في أصل آل فقال النحاس أصله أهل ثم أبدل من الهاء ألفا فإن صغرته رددته إلى أصله فقلت أهيل وقال المهدوي : أصله أول وقيل أهل قلبت الهاء همزة ثم أبدلت الهمزة ألفا وجمعه آلون وتصغيره أويل فيما حكى الكسائي ، وحكى غيره أهيل وقد ذكرنا عن النحاس ، وقال أبو الحسن بن كيسان إذا جمعت آلا قلت آلون فإن جمعت آلا الذي هو السراب قلت : آوال ، مثل مال وأموال .\nالسادسة : قوله تعالى : فرعون فرعون قيل إنه اسم ذلك الملك بعينه . وقيل إنه اسم كل ملك من ملوك العمالقة مثل كسرى للفرس وقيصر للروم والنجاشي للحبشة وإن اسم فرعون موسى قابوس في قول أهل الكتاب وقال وهب اسمه الوليد بن مصعب بن الريان ويكنى أبا مرة وهو من بني عمليق بن لاوذ بن إرم بن سام بن نوح عليه السلام قال السهيلي ، وكل من ولي القبط ومصر فهو فرعون ، وكان فارسيا من أهل إصطخر قال المسعودي لا يعرف لفرعون تفسير بالعربية قال الجوهري : فرعون لقب الوليد بن مصعب ملك مصر وكل عات فرعون والعتاة الفراعنة وقد تفرعن وهو ذو فرعنة أي دهاء ونكر وفي الحديث ( أخذنا فرعون هذه الأمة ) و \" فرعون \" في موضع خفض إلا أنه لا ينصرف لعجمته\nالسابعة : قوله تعالى : يسومونكم قيل معناه يذيقونكم ويلزمونكم إياه ، وقال أبو عبيدة يولونكم يقال سامه خطة خسف إذا أولاه إياها ومنه قول عمرو بن كلثوم\nإذا ما الملك سام الناس خسفا أبينا أن نقر الذل فينا\nوقيل يديمون تعذيبكم والسوم الدوام ، ومنه سائمة الغنم لمداومتها الرعي قال الأخفش : وهو في موضع رفع على الابتداء ، وإن شئت كان في موضع نصب على الحال أي سائمين لكم .\nالثامنة : قوله تعالى : سوء العذاب مفعول ثان ل \" يسومونكم \" ومعناه أشد العذاب ، ويجوز أن يكون بمعنى سوم العذاب ، وقد يجوز أن يكون نعتا بمعنى سوما سيئا فروي أن فرعون جعل بني إسرائيل خدما وخولا وصنفهم في أعماله فصنف يبنون وصنف يحرثون ويزرعون وصنف يتخدمون ، وكان قومه جندا ملوكا ومن لم يكن منهم في عمل من هذه الأعمال ضربت عليه الجزية فذلك سوء العذاب\nالتاسعة : قوله تعالى : يذبحون أبناءكم يذبحون بغير واو على البدل من قوله يسومونكم كما قال أنشده سيبويه\nمتى تأتنا تلمم بنا في ديارنا تجد حطبا جزلا ونارا تأججا\nقال الفراء وغيره يذبحون بغير واو على التفسير لقوله يسومونكم سوء العذاب كما تقول أتاني القوم زيد وعمرو فلا تحتاج إلى الواو في زيد . ونظيره : ومن يفعل ذلك يلق أثاما يضاعف له العذاب وفي سورة إبراهيم ويذبحون بالواو ؛ لأن المعنى يعذبونكم بالذبح وبغير الذبح فقوله ويذبحون أبناءكم جنس آخر من العذاب لا تفسير لما قبله والله أعلم .\nقلت : قد يحتمل أن يقال إن الواو زائدة بدليل سورة \" البقرة \" والواو قد تزاد كما قال :\nفلما أجزنا ساحة الحي وانتحى\nأي قد انتحى . وقال آخر\nإلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم\nأراد إلى الملك القرم بن الهمام ليث الكتيبة ، وهو كثير .\nالعاشرة : قوله تعالى : يذبحون قراءة الجماعة بالتشديد على التكثير وقرأ ابن محيصن \" يذبحون \" بفتح الباء والذبح الشق والذبح المذبوح والذباح تشقق في أصول الأصابع وذبحت الدن بزلته أي كشفته ، وسعد الذابح : أحد السعود ، والمذابح : المحاريب ، والمذابح جمع مذبح ، وهو إذا جاء السيل فخد في الأرض فما كان كالشبر ونحوه سمي مذبحا فكان فرعون يذبح الأطفال ويبقي البنات وعبر عنهم باسم النساء بالمآل وقالت طائفة \" يذبحون أبناءكم \" يعني الرجال وسموا أبناء لما كانوا كذلك واستدل هذا القائل بقوله \" نساءكم \" والأول أصح ؛ لأنه الأظهر والله أعلم .\nالحادية عشرة : نسب الله تعالى الفعل إلى آل فرعون وهم إنما كانوا يفعلون بأمره وسلطانه لتوليهم ذلك بأنفسهم وليعلم أن المباشر مأخوذ بفعله قال الطبري ويقتضي أن من أمره ظالم بقتل أحد فقتله المأمور فهو المأخوذ به .\nقلت : وقد اختلف العلماء في هذه المسألة على ثلاثة أقوال يقتلان جميعا ، هذا بأمره والمأمور بمباشرته هكذا قال النخعي وقاله الشافعي ومالك في تفصيل لهما قال الشافعي إذا أمر السلطان رجلا بقتل رجل والمأمور يعلم أنه أمر بقتله ظلما كان عليه وعلى الإمام القود كقاتلين معا وإن أكرهه الإمام عليه وعلم أنه يقتله ظلما كان على الإمام القود ، وفي المأمور قولان أحدهما أن عليه القود والآخر لا قود عليه وعليه نصف الدية حكاه ابن المنذر ، وقال علماؤنا : لا يخلو المأمور أن يكون ممن تلزمه طاعة الآمر ويخاف شره كالسلطان والسيد لعبده فالقود في ذلك لازم لهما أو يكون ممن لا يلزمه ذلك فيقتل المباشر وحده دون الآمر وذلك كالأب يأمر ولده أو المعلم بعض صبيانه أو الصانع بعض متعلميه إذا كان محتلما فإن كان غير محتلم فالقتل على الآمر ، وعلى عاقلة الصبي نصف الدية وقال ابن نافع لا يقتل السيد إذا أمر عبده وإن كان أعجميا بقتل إنسان قال ابن حبيب وبقول ابن القاسم أقول إن القتل عليهما فأما أمر من لا خوف على المأمور في مخالفته فإنه لا يلحق بالإكراه بل يقتل المأمور دون الآمر ويضرب الآمر ويحبس وقال أحمد في السيد يأمر عبده أن يقتل رجلا يقتل السيد وروي هذا القول عن علي بن أبي طالب وأبي هريرة رضي الله عنهما وقال علي ويستودع العبد السجن وقال أحمد ويحبس العبد ويضرب ويؤدب وقال الثوري يعزر السيد وقال الحكم وحماد يقتل العبد وقال قتادة يقتلان جميعا وقال الشافعي إن كان العبد فصيحا يعقل قتل العبد وعوقب السيد وإن كان العبد أعجميا فعلى السيد القود وقال سليمان بن موسى لا يقتل الآمر ولكن تقطع يديه ثم يعاقب ويحبس وهو القول الثاني ويقتل المأمور للمباشرة وكذلك قال عطاء والحكم وحماد والشافعي وأحمد وإسحاق في الرجل يأمر الرجل بقتل الرجل وذكره ابن المنذر وقال زفر : لا يقتل واحد منهما ، وهو القول الثالث حكاه أبو المعالي في البرهان ورأى أن الآمر والمباشر ليس كل واحد منهما مستقلا في القود فلذلك لا يقتل واحد منهما عنده ، والله أعلم .\nالثانية عشرة : قرأ الجمهور يذبحون بالتشديد على المبالغة وقرأ ابن محيصن \" يذبحون \" بالتخفيف والأول أرجح إذ الذبح متكرر وكان فرعون على ما روي قد رأى في منامه نارا خرجت من بيت المقدس فأحرقت بيوت مصر فأولت له رؤياه أن مولودا من بني إسرائيل ينشأ فيكون خراب ملكه على يديه وقيل غير هذا والمعنى متقارب\nالثالثة عشرة : وفي ذلكم إشارة إلى جملة الأمر إذ هو خبر فهو كمفرد حاضر أي وفي فعلهم ذلك بكم بلاء أي امتحان واختبار و بلاء نعمة ومنه قوله تعالى وليبلي المؤمنين منه بلاء حسنا قال أبو الهيثم البلاء يكون حسنا ويكون سيئا وأصله المحنة والله عز وجل يبلو عبده بالصنع الجميل ليمتحن شكره ويبلوه بالبلوى التي يكرهها ليمتحن صبره فقيل للحسن بلاء وللسيئ بلاء حكاه الهروي وقال قوم الإشارة ب \" ذلكم \" إلى التنجية فيكون البلاء على هذا في الخير أي : تنجيتكم نعمة من الله عليكم وقال الجمهور الإشارة إلى الذبح ونحوه والبلاء هنا في الشر ، والمعنى وفي الذبح مكروه وامتحان وقال ابن كيسان ويقال في الخير أبلاه الله وبلاه وأنشد :\nجزى الله بالإحسان ما فعلا بكم وأبلاهما خير البلاء الذي يبلو\nفجمع بين اللغتين والأكثر في الخير أبليته وفي الشر بلوته وفي الاختبار ابتليته وبلوته قاله النحاس .\n                                    ",
        "saadi": "وَإِذۡ نَجَّيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُذَبِّحُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ ٩٤\n                                        \n                                        \n                                        \n                                        هذا شروع في تعداد نعمه على بني إسرائيل على وجه التفصيل فقال: { وَإِذْ نَجَّيْنَاكُمْ مِنْ آلِ فِرْعَوْنَ } أي: من فرعون وملئه وجنوده وكانوا قبل ذلك { يَسُومُونَكُمْ } أي: يولونهم ويستعملونهم، { سُوءَ الْعَذَابِ } أي: أشده بأن كانوا { يُذَبِّحُونَ أَبْنَاءَكُمْ } خشية نموكم، { وَيَسْتَحْيُونَ نِسَاءَكُمْ } أي: فلا يقتلونهن، فأنتم بين قتيل ومذلل بالأعمال الشاقة، مستحيي على وجه المنة عليه والاستعلاء عليه فهذا غاية الإهانة، فمن الله عليهم بالنجاة التامة وإغراق عدوهم وهم ينظرون لتقر أعينهم. { وَفِي ذَلِكم } أي: الإنجاء { بَلَاءٌ } أي: إحسان { مِنْ رَبِّكُمْ عَظِيمٌ } فهذا مما يوجب عليكم الشكر والقيام بأوامره.\n                                    "
      },
      "originalText": "وَإِذۡ نَجَّيۡنَٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ يُذَبِّحُونَ أَبۡنَآءَكُمۡ وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ ٩٤"
    },
    {
      "number": 57,
      "text": "وَإِذْ فَرَقْنَا بِكُمُ الْبَحْرَ فَأَنْجَيْنَاكُمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ وَأَنْتُمْ تَنْظُرُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 50,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ فَرَقۡنَا بِكُمُ ٱلۡبَحۡرَ فَأَنجَيۡنَٰكُمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَ وَأَنتُمۡ تَنظُرُونَ ٠٥\n                                    \n                                    \n                                    وقوله تعالى : ( وإذ فرقنا بكم البحر فأنجيناكم وأغرقنا آل فرعون وأنتم تنظرون ) معناه : وبعد أن أنقذناكم من آل فرعون ، وخرجتم مع موسى ، عليه السلام ، خرج فرعون في طلبكم ، ففرقنا بكم البحر ، كما أخبر تعالى عن ذلك مفصلا كما سيأتي في مواضعه ومن أبسطها في سورة الشعراء إن شاء الله .\n( فأنجيناكم ) أي : خلصناكم منهم ، وحجزنا بينكم وبينهم ، وأغرقناهم وأنتم تنظرون ؛ ليكون ذلك أشفى لصدوركم ، وأبلغ في إهانة عدوكم .\nقال عبد الرزاق : أنبأنا معمر ، عن أبي إسحاق الهمداني ، عن عمرو بن ميمون الأودي في قوله تعالى : ( وإذ فرقنا بكم البحر ) إلى قوله : ( وأنتم تنظرون ) قال : لما خرج موسى ببني إسرائيل ، بلغ ذلك فرعون فقال : لا تتبعوهم حتى تصيح الديكة . قال : فوالله ما صاح ليلتئذ ديك\nحتى أصبحوا ؛ فدعا بشاة فذبحت ، ثم قال : لا أفرغ من كبدها حتى يجتمع إلي ستمائة ألف من القبط . فلم يفرغ من كبدها حتى اجتمع إليه ستمائة ألف من القبط ثم سار ، فلما أتى موسى البحر ، قال له رجل من أصحابه ، يقال له : يوشع بن نون : أين أمر ربك ؟ قال : أمامك ، يشير إلى البحر . فأقحم يوشع فرسه في البحر حتى بلغ الغمر ، فذهب به الغمر ، ثم رجع . فقال : أين أمر ربك يا موسى ؟ فوالله ما كذبت ولا كذبت . فعل ذلك ثلاث مرات ، ثم أوحى الله إلى موسى : ( أن اضرب بعصاك البحر ) فضربه ( فانفلق فكان كل فرق كالطود العظيم ) [ الشعراء : 63 ] ، يقول : مثل الجبل . ثم سار موسى ومن معه وأتبعهم فرعون في طريقهم ، حتى إذا تتاموا فيه أطبقه الله عليهم فلذلك قال : ( وأغرقنا آل فرعون وأنتم تنظرون ) .\nوكذلك قال غير واحد من السلف ، كما سيأتي بيانه في مواضعه . وقد ورد أن هذا اليوم كان يوم عاشوراء ، كما قال الإمام أحمد :\nحدثنا عفان ، حدثنا عبد الوارث ، حدثنا أيوب ، عن عبد الله بن سعيد بن جبير ، عن أبيه ، عن ابن عباس ، قال : قدم رسول الله صلى الله عليه وسلم المدينة فرأى اليهود يصومون يوم عاشوراء ، فقال : ما هذا اليوم الذي تصومون ؟ . قالوا : هذا يوم صالح ، هذا يوم نجى الله عز وجل فيه بني إسرائيل من عدوهم ، فصامه موسى ، عليه السلام ، فقال رسول الله صلى الله عليه وسلم : أنا أحق بموسى منكم . فصامه رسول الله صلى الله عليه وسلم ، وأمر بصومه .\nوروى هذا الحديث البخاري ، ومسلم ، والنسائي ، وابن ماجه من طرق ، عن أيوب السختياني ، به نحو ما تقدم .\nوقال أبو يعلى الموصلي : حدثنا أبو الربيع ، حدثنا سلام - يعني ابن سليم - عن زيد العمي عن يزيد الرقاشي عن أنس ، عن النبي صلى الله عليه وسلم قال : فلق الله البحر لبني إسرائيل يوم عاشوراء .\nوهذا ضعيف من هذا الوجه فإن زيدا العمي فيه ضعف ، وشيخه يزيد الرقاشي أضعف منه .\n                                    ",
        "qortoby": "وَإِذۡ فَرَقۡنَا بِكُمُ ٱلۡبَحۡرَ فَأَنجَيۡنَٰكُمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَ وَأَنتُمۡ تَنظُرُونَ ٠٥\n                                    \n                                    \n                                    قوله تعالى : وإذ فرقنا بكم البحر فأنجيناكم وأغرقنا آل فرعون وأنتم تنظرون\nقوله تعالى : وإذ فرقنا بكم البحر فأنجيناكم إذ في موضع نصب و فرقنا فلقنا فكان كل فرق كالطود العظيم أي الجبل العظيم وأصل الفرق الفصل ومنه فرق الشعر ، ومنه الفرقان ؛ لأنه يفرق بين الحق والباطل أي يفصل ومنه فالفارقات فرقا يعني الملائكة تنزل بالفرق بين الحق والباطل ومنه يوم الفرقان يعني يوم بدر كان فيه فرق بين الحق والباطل ومنه وقرآنا فرقناه أي فصلناه وأحكمناه وقرأ الزهري \" فرقنا \" بتشديد الراء أي جعلناه فرقا ومعنى بكم أي لكم فالباء بمعنى اللام وقيل الباء في مكانها أي فرقنا البحر بدخولكم إياه أي صاروا بين الماءين فصار الفرق بهم وهذا أولى يبينه فانفلق .\nقوله تعالى : \" البحر \" البحر معروف سمي بذلك لاتساعه ويقال فرس بحر إذا كان واسع الجري أي كثيره ومن ذلك قول رسول الله صلى الله عليه وسلم في مندوب فرس أبي طلحة ( وإن وجدناه لبحرا ) والبحر الماء الملح ويقال أبحر الماء ملح قال نصيب\nوقد عاد ماء الأرض بحرا فزادني إلى مرضي أن أبحر المشرب العذب\nوالبحر البلدة يقال هذه بحرتنا أي بلدتنا قاله الأموي والبحر السلال يصيب الإنسان . ويقولون لقيته صحرة بحرة أي بارزا مكشوفا ، وفي الخبر عن كعب الأحبار قال إن لله ملكا يقال له صندفاييل البحار كلها في نقرة إبهامه ذكره أبو نعيم عن ثور بن يزيد عن خالد بن معدان عن كعب\nقوله تعالى : فأنجيناكم أي أخرجناكم منه يقال نجوت من كذا نجاء ، ممدود ، ونجاة ، مقصور ، والصدق منجاة وأنجيت غيري ونجيته وقرئ بهما وإذ نجيناكم فأنجيناكم .\nقوله تعالى : وأغرقنا آل فرعون يقال غرق في الماء غرقا فهو غرق وغارق أيضا ومنه قول أبي النجم :\nمن بين مقتول وطاف غارق\nوأغرقه غيره وغرقه فهو مغرق وغريق ولجام مغرق بالفضة أي محلى والتغريق القتل قال الأعشى\nألا ليت قيسا غرقته القوابل\nوذلك أن القابلة كانت تغرق المولود في ماء السلى عام القحط ذكرا كان أو أنثى حتى يموت ثم جعل كل قتل تغريقا ، ومنه قول ذي الرمة :\nإذا غرقت أرباضها ثني بكرة بتيهاء لم تصبح رءوما سلوبها\nوالأرباض الحبال والبكرة الناقة الفتية وثنيها بطنها . الثاني : وإنما لم تعطف على ولدها لما لحقها من التعب .\nالقول في اختلاف العلماء في كيفية إنجاء بني إسرائيل\nفذكر الطبري أن موسى عليه السلام أوحي إليه أن يسري من مصر ببني إسرائيل فأمرهم موسى أن يستعيروا الحلي والمتاع من القبط وأحل الله ذلك لبني إسرائيل فسرى بهم موسى من أول الليل فأعلم فرعون فقال لا يتبعهم أحد حتى تصيح الديكة فلم يصح تلك الليلة بمصر ديك وأمات الله تلك الليلة كثيرا من أبناء القبط فاشتغلوا في الدفن وخرجوا في الأتباع مشرقين كما قال تعالى فأتبعوهم مشرقين وذهب موسى إلى ناحية البحر حتى بلغه وكانت عدة بني إسرائيل نيفا على ستمائة ألف وكانت عدة فرعون ألف ألف ومائتي ألف . وقيل : إن فرعون اتبعه في ألف ألف حصان سوى الإناث وقيل دخل إسرائيل وهو يعقوب عليه السلام مصر في ستة وسبعين نفسا من ولده وولد ولده فأنمى الله عددهم وبارك في ذريته حتى خرجوا إلى البحر يوم فرعون وهم ستمائة ألف من المقاتلة سوى الشيوخ والذرية والنساء وذكر أبو بكر عبد الله بن محمد بن أبي شيبة قال حدثنا شبابة بن سوار عن يونس بن أبي إسحاق عن أبي إسحاق عن عمرو بن ميمون عن عبد الله بن مسعود أن موسى عليه السلام حين أسرى ببني إسرائيل بلغ فرعون فأمر بشاة فذبحت ثم قال : لا والله لا يفرغ من سلخها حتى تجتمع لي ستمائة ألف من القبط قال فانطلق موسى حتى انتهى إلى البحر فقال له : افرق فقال له البحر لقد استكبرت يا موسى وهل فرقت لأحد من ولد آدم فأفرق لك ؟ ! قال ومع موسى رجل على حصان له قال فقال له ذلك الرجل : أين أمرت يا نبي الله ؟ قال ما أمرت إلا بهذا الوجه قال فأقحم فرسه فسبح فخرج فقال أين أمرت يا نبي الله ؟ قال ما أمرت إلا بهذا الوجه قال والله ما كذبت ولا كذبت ثم اقتحم الثانية فسبح به حتى خرج فقال أين أمرت يا نبي الله ؟ فقال ما أمرت إلا بهذا الوجه قال والله ما كذبت ولا كذبت قال فأوحى الله إليه أن اضرب بعصاك البحر فضربه موسى بعصاه فانفلق فكان كل فرق كالطود العظيم فكان فيه اثنا عشر فرقا لاثني عشر سبطا لكل سبط طريق يتراءون ، وذلك أن أطواد الماء صار فيها طيقانا وشبابيك يرى منها بعضهم بعضا فلما خرج أصحاب موسى وقام أصحاب فرعون التطم البحر عليهم فأغرقهم ، ويذكر أن البحر هو بحر القلزم ، وأن الرجل الذي كان مع موسى على الفرس هو فتاه يوشع بن نون ، وأن الله تعالى أوحى إلى البحر أن انفرق لموسى إذا ضربك فبات البحر تلك الليلة يضطرب فحين أصبح ضرب البحر وكناه أبا خالد ذكره ابن أبي شيبة أيضا ، وقد أكثر المفسرون في قصص هذا المعنى ، وما ذكرناه كاف وسيأتي في سورة \" يونس والشعراء \" زيادة بيان إن شاء الله تعالى .\nفصل\nذكر الله تعالى الإنجاء والإغراق ولم يذكر اليوم الذي كان ذلك فيه فروى مسلم عن ابن عباس أن رسول الله صلى الله عليه وسلم قدم المدينة فوجد اليهود صياما يوم عاشوراء فقال لهم رسول الله صلى الله عليه وسلم ( ما هذا اليوم الذي تصومونه ) فقالوا هذا يوم عظيم أنجى الله فيهموسى وقومه وغرق فرعون وقومه فصامه موسى شكرا فنحن نصومه فقال رسول الله صلى الله عليه وسلم فنحن أحق وأولى بموسى منكم فصامه رسول الله صلى الله عليه وسلم وأمر بصيامه وأخرجه البخاري أيضا عن ابن عباس ، وأن النبي صلى الله عليه وسلم قال لأصحابه أنتم أحق بموسى منهم فصوموا .\nمسألة : ظاهر هذه الأحاديث تدل على أن النبي صلى الله عليه وسلم إنما صام عاشوراء وأمر بصيامه اقتداء بموسى عليه السلام على ما أخبره به اليهود ، وليس كذلك لما روته عائشة رضي الله عنها قالت كان يوم عاشوراء تصومه قريش في الجاهلية ، وكان رسول الله صلى الله عليه وسلم يصومه في الجاهلية فلما قدم المدينة صامه وأمر بصيامه فلما فرض رمضان ترك صيام يوم عاشوراء فمن شاء صامه ، ومن شاء تركه أخرجه البخاري ومسلم .\nفإن قيل يحتمل أن تكون قريش إنما صامته بإخبار اليهود لها ؛ لأنهم كانوا يسمعون منهم ؛ لأنهم كانوا عندهم أهل علم فصامه النبي عليه السلام كذلك في الجاهلية أي بمكة فلما قدم المدينة ، ووجد اليهود يصومونه قال ( نحن أحق وأولى بموسى منكم ) فصامه اتباعا لموسى ( وأمر بصيامه ) أي أوجبه وأكد أمره حتى كانوا يصومونه الصغار قلنا هذه شبهة من قال إن النبي صلى الله عليه وسلم لعله كان متعبدا بشريعة موسى وليس كذلك على ما يأتي بيانه في \" الأنعام \" عند قوله تعالى فبهداهم اقتده .\nمسألة : اختلف في يوم عاشوراء هل هو التاسع من المحرم أو العاشر ؟ فذهب الشافعي إلى أنه التاسع لحديث الحكم بن الأعرج قال انتهيت إلى ابن عباس رضي الله عنهما وهو متوسد رداءه في زمزم فقلت له أخبرني عن صوم عاشوراء فقال إذا رأيت هلال المحرم فاعدد وأصبح يوم التاسع صائما قلت هكذا كان محمد صلى الله عليه وسلم يصومه قال نعم خرجه مسلم وذهب سعيد بن المسيب والحسن البصري ومالك وجماعة من السلف إلى أنه العاشر وذكر الترمذي حديث الحكم ولم يصفه بصحة ولا حسن ثم أردفه أنبأنا قتيبة أنبأنا عبد الوارث عن يونس عن الحسن عن ابن عباس قال أمر رسول الله صلى الله عليه وسلم بصوم عاشوراء يوم العاشر قال أبو عيسى حديث ابن عباس حديث حسن صحيح قال الترمذي وروي عن ابن عباس أنه قال صوموا التاسع والعاشر وخالفوا اليهود ، وبهذا الحديث يقول الشافعي وأحمد بن حنبل وإسحاق قال غيره : وقول ابن عباس للسائل ( فاعدد وأصبح يوم التاسع صائما ) ليس فيه دليل على ترك صوم العاشر بل وعد أن يصوم التاسع مضافا إلى العاشر قالوا فصيام اليومين جمع بين الأحاديث وقول ابن عباس للحكم لما قال له هكذا كان محمد صلى الله عليه وسلم يصومه قال نعم معناه أن لو عاش ، وإلا فما كان النبي صلى الله عليه وسلم صام التاسع قط يبينه ما خرجه ابن ماجه في سننه ومسلم في صحيحه عن ابن عباس قال قال رسول الله صلى الله عليه وسلم لئن بقيت إلى قابل لأصومن اليوم التاسع .\nفضيلة : روى أبو قتادة أن النبي صلى الله عليه وسلم قال صيام يوم عاشوراء أحتسب على الله أن يكفر السنة التي قبله أخرجه مسلم والترمذي ، وقال : لا نعلم في شيء من الروايات أنه قال ( صيام يوم عاشوراء كفارة سنة ) إلا في حديث أبي قتادة\nقوله تعالى : وأنتم تنظرون جملة في موضع الحال ومعناه بأبصاركم فيقال : إن آل فرعون طفوا على الماء فنظروا إليهم يغرقون وإلى أنفسهم ينجون ففي هذا أعظم المنة ، وقد قيل إنهم أخرجوا لهم حتى رأوهم فهذه منة بعد منة ، وقيل المعنى وأنتم تنظرون أي ببصائركم الاعتبار ؛ لأنهم كانوا في شغل عن الوقوف والنظر بالأبصار وقيل المعنى وأنتم بحال من ينظر لو نظر كما تقول : هذا الأمر منك بمرأى ومسمع ؛ أي بحال تراه وتسمعه إن شئت . وهذا القول والأول أشبه بأحوال بني إسرائيل لتوالي عدم الاعتبار فيما صدر من بني إسرائيل بعد خروجهم من البحر ، وذلك أن الله تعالى لما أنجاهم وغرق عدوهم قالوا يا موسى إن قلوبنا لا تطمئن ، إن فرعون قد غرق حتى أمر الله البحر فلفظه فنظروا إليه .\nذكر أبو بكر بن أبي شيبة عن قيس بن عباد أن بني إسرائيل قالت ما مات فرعون ، وما كان ليموت أبدا قال فلما أن سمع الله تكذيبهم نبيه عليه السلام رمى به على ساحل البحر كأنه ثور أحمر يتراءاه بنو إسرائيل فلما اطمأنوا وبعثوا من طريق البر إلى مدائن فرعون حتى نقلوا كنوزه وغرقوا في النعمة رأوا قوما يعكفون على أصنام لهم قالوا يا موسى اجعل لنا إلها كما لهم آلهة حتى زجرهم موسى ، وقال أغير الله أبغيكم إلها ، وهو فضلكم على العالمين أي عالمي زمانه ثم أمرهم أن يسيروا إلى الأرض المقدسة التي كانت مساكن آبائهم ويتطهروا من أرض فرعون وكانت الأرض المقدسة في أيدي الجبارين قد غلبوا عليها فاحتاجوا إلى دفعهم عنها بالقتال فقالوا أتريد أن تجعلنا لحمة للجبارين فلو أنك تركتنا في يد فرعون كان خيرا لنا قال ياقوم ادخلوا الأرض المقدسة التي كتب الله لكم إلى قوله قاعدون حتى دعا عليهم وسماهم فاسقين فبقوا في التيه أربعين سنة عقوبة ثم رحمهم فمن عليهم بالسلوى وبالغمام على ما يأتي بيانه ثم سار موسى إلى طور سيناء ليجيئهم بالتوراة فاتخذوا العجل على ما يأتي بيانه ثم قيل لهم : قد وصلتم إلى بيت المقدس فادخلوا الباب سجدا وقولوا حطة على ما يأتي وكان موسى عليه السلام شديد الحياء ستيرا فقالوا إنه آدر فلما اغتسل وضع على الحجر ثوبه فعدا الحجر بثوبه إلى مجالس بني إسرائيل وموسى على أثره عريان وهو يقول يا حجر ثوبي فذلك قوله تعالى يأيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا على ما يأتي بيانه ثم لما مات هارون قالوا له أنت قتلت هارون وحسدته حتى نزلت الملائكة بسريره وهارون ميت عليه وسيأتي في المائدة ثم سألوه أن يعلموا آية في قبول قربانهم فجعلت نار تجيء من السماء فتقبل قربانهم ثم سألوه أن بين لنا كفارات ذنوبنا في الدنيا فكان من أذنب ذنبا أصبح على بابه مكتوب ( عملت كذا وكفارته قطع عضو من أعضائك ) يسميه له ومن أصابه بول لم يطهر حتى يقرضه ويزيل جلدته من بدنه ثم بدلوا التوراة وافتروا على الله وكتبوا بأيديهم واشتروا به عرضا ثم صار أمرهم إلى أن قتلوا أنبياءهم ورسلهم . فهذه معاملتهم مع ربهم وسيرتهم في دينهم وسوء أخلاقهم وسيأتي بيان كل فصل من هذه الفصول مستوفى في موضعه إن شاء الله تعالى ، وقال الطبري وفي أخبار القرآن على لسان محمد عليه السلام بهذه المغيبات التي لم تكن من علم العرب ولا وقعت إلا في حق بني إسرائيل دليل واضح عند بني إسرائيل قائم عليهم بنبوة محمد صلى الله عليه وسلم\n                                    ",
        "saadi": "وَإِذۡ فَرَقۡنَا بِكُمُ ٱلۡبَحۡرَ فَأَنجَيۡنَٰكُمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَ وَأَنتُمۡ تَنظُرُونَ ٠٥\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 50 الى 55 :ـ ثم ذكر منته عليهم بوعده لموسى أربعين ليلة لينزل عليهم التوراة المتضمنة للنعم العظيمة والمصالح العميمة، ثم إنهم لم يصبروا قبل استكمال الميعاد حتى عبدوا العجل من بعده, أي: ذهابه. { وَأَنْتُمْ ظَالِمُونَ } عالمون بظلمكم, قد قامت عليكم الحجة, فهو أعظم جرما وأكبر إثما. ثم إنه أمركم بالتوبة على لسان نبيه موسى بأن يقتل بعضكم بعضا فعفا الله عنكم بسبب ذلك { لَعَلَّكُمْ تَشْكُرُونَ } الله.\n                                    "
      },
      "originalText": "وَإِذۡ فَرَقۡنَا بِكُمُ ٱلۡبَحۡرَ فَأَنجَيۡنَٰكُمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَ وَأَنتُمۡ تَنظُرُونَ ٠٥"
    },
    {
      "number": 58,
      "text": "وَإِذْ وَاعَدْنَا مُوسَىٰ أَرْبَعِينَ لَيْلَةً ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِنْ بَعْدِهِ وَأَنْتُمْ ظَالِمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 51,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ وَٰعَدۡنَا مُوسَىٰٓ أَرۡبَعِينَ لَيۡلَةٗ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ ١٥\n                                    \n                                    \n                                    يقول تعالى : واذكروا نعمتي عليكم في عفوي عنكم ، لما عبدتم العجل بعد ذهاب موسى لميقات ربه ، عند انقضاء أمد المواعدة ، وكانت أربعين يوما ، وهي المذكورة في الأعراف ، في قوله تعالى : ( وواعدنا موسى ثلاثين ليلة وأتممناها بعشر ) [ الأعراف : 142 ] قيل : إنها ذو القعدة بكماله وعشر من ذي الحجة ، وكان ذلك بعد خلاصهم من قوم فرعون وإنجائهم من البحر .\n                                    ",
        "qortoby": "وَإِذۡ وَٰعَدۡنَا مُوسَىٰٓ أَرۡبَعِينَ لَيۡلَةٗ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ ١٥\n                                    \n                                    \n                                    قوله تعالى : وإذ واعدنا موسى أربعين ليلة ثم اتخذتم العجل من بعده وأنتم ظالمون\nفيه ست مسائل :\nالأولى : قوله تعالى وإذ واعدنا موسى أربعين ليلة : قرأ أبو عمرو \" وعدنا \" بغير ألف ، واختاره أبو عبيد ورجحه وأنكر واعدنا قال : لأن المواعدة إنما تكون من البشر فأما الله جل وعز فإنما هو المنفرد بالوعد والوعيد . على هذا وجدنا القرآن ، كقوله عز وجل : وعدكم وعد الحق ( إبراهيم : 22 ) وقوله : وعد الله الذين آمنوا منكم وعملوا الصالحات ( الفتح : 29 ) وقوله : وإذ يعدكم الله إحدى الطائفتين أنها لكم قال مكي : وأيضا فإن ظاهر اللفظ فيه وعد من الله تعالى لموسى ، وليس فيه وعد من موسى ، فوجب حمله على الواحد ، لظاهر النص أن الفعل مضاف إلى الله تعالى وحده ، وهي قراءة الحسن وأبي رجاء وأبي جعفر وشيبة وعيسى بن عمر ، وبه قرأ قتادة وابن أبي إسحاق قال أبو حاتم : قراءة العامة عندنا \" وعدنا \" بغير ألف ; لأن المواعدة أكثر ما تكون بين المخلوقين والمتكافئين ، كل واحد منهما يعد صاحبه . قال الجوهري : الميعاد : المواعدة والوقت والموضع . قال مكي : المواعدة أصلها من اثنين ، وقد تأتي المفاعلة من واحد في كلام العرب ، قالوا : طارقت النعل ، وداويت العليل ، وعاقبت اللص ، والفعل من واحد . فيكون لفظ المواعدة من الله خاصة لموسى كمعنى وعدنا ، فتكون القراءتان بمعنى واحد والاختيار واعدنا بالألف ؛ لأنه بمعنى \" وعدنا \" في أحد معنييه ، ولأنه لا بد لموسى من وعد أو قبول يقوم مقام الوعد فتصح المفاعلة . قال النحاس : وقراءة \" واعدنا \" بالألف أجود وأحسن ، وهي قراءة مجاهد والأعرج وابن كثير ونافع والأعمش وحمزة والكسائي ، وليس قوله عز وجل : وعد الله الذين آمنوا منكم وعملوا الصالحات من هذا في شيء ; لأن واعدنا موسى إنما هو من باب الموافاة ، وليس هذا من الوعد والوعيد في شيء ، وإنما هو من قولك : موعدك يوم الجمعة ، وموعدك موضع كذا . والفصيح في هذا أن يقال : واعدته . قال أبو إسحاق الزجاج : واعدنا ها هنا بالألف جيد ؛ لأن الطاعة في القبول بمنزلة المواعدة ، فمن الله جل وعز وعد ، ومن موسى قبول واتباع يجري مجرى المواعدة . قال ابن عطية . ورجح أبو عبيدة \" وعدنا \" وليس بصحيح ; لأن قبول موسى لوعد الله والتزامه وارتقابه يشبه المواعدة .\nالثانية : قوله تعالى : \" موسى \" موسى اسم أعجمي لا ينصرف للعجمة والتعريف والقبط على - ما يروى - يقولون للماء : مو ، وللشجر : شا . فلما وجد موسى في التابوت عند ماء وشجر سمي موسى . قال السدي : لما خافت عليه أمه جعلته في التابوت وألقته في اليم - كما أوحى الله إليها - فألقته في اليم بين أشجار عند بيت فرعون ، فخرج جواري آسية امرأة فرعون يغتسلن فوجدنه ، فسمي باسم المكان . وذكر النقاش وغيره : أن اسم الذي التقطته صابوث . قال ابن إسحاق : وموسى هو موسى بن عمران بن يصهر بن قاهث بن لاوي بن يعقوب إسرائيل الله بن إسحاق بن إبراهيم عليه السلام .\nالثالثة : قوله تعالى : أربعين ليلة أربعين نصب على المفعول الثاني ، وفي الكلام حذف قال الأخفش : التقدير وإذ واعدنا موسى تمام أربعين ليلة كما قال واسأل القرية والأربعون كلها داخلة في الميعاد .\nوالأربعون في قول أكثر المفسرين ذو القعدة وعشرة من ذي الحجة ، وكان ذلك بعد أن جاوز البحر وسأله قومه أن يأتيهم بكتاب من عند الله فخرج إلى الطور في سبعين من خيار بني إسرائيل وصعدوا الجبل وواعدهم إلى تمام أربعين ليلة فعدوا فيما ذكر المفسرون عشرين يوما وعشرين ليلة وقالوا قد أخلفنا موعده فاتخذوا العجل وقال لهم السامري هذا إلهكم وإله موسى فاطمأنوا إلى قوله ونهاهم هارون وقال يا قوم إنما فتنتم به وإن ربكم الرحمن فاتبعوني وأطيعوا أمري قالوا لن نبرح عليه عاكفين حتى يرجع إلينا موسى فلم يتبع هارون ولم يطعه في ترك عبادة العجل إلا اثنا عشر ألفا فيما روي في الخبر وتهافت في عبادته سائرهم وهم أكثر من ألفي ألف فلما رجع موسى ووجدهم على تلك الحال ألقى الألواح فرفع من جملتها ستة أجزاء وبقي جزء واحد ، وهو الحلال والحرام وما يحتاجون ، وأحرق العجل وذراه في البحر فشربوا من مائه حبا للعجل فظهرت على شفاههم صفرة وورمت بطونهم فتابوا ولم تقبل توبتهم دون أن يقتلوا أنفسهم فذلك قوله تعالى فتوبوا إلى بارئكم فاقتلوا أنفسكم فقاموا بالخناجر والسيوف بعضهم إلى بعض من لدن طلوع الشمس إلى ارتفاع الضحى فقتل بعضهم بعضا لا يسأل والد عن ولده ولا ولد عن والده ولا أخ عن أخيه ولا أحد عن أحد كل من استقبله ضربه بالسيف وضربه الآخر بمثله حتى عج موسى إلى الله صارخا يا رباه قد فنيت بنو إسرائيل فرحمهم الله وجاد عليهم . بفضله فقبل توبة من بقي وجعل من قتل في الشهداء على ما يأتي .\nالرابعة : إن قيل لم خص الليالي بالذكر دون الأيام ؟ قيل له ؛ لأن الليلة أسبق من اليوم فهي قبله في الرتبة ; ولذلك وقع بها التاريخ فالليالي أول الشهور والأيام تبع لها .\nالخامسة : قال النقاش : في هذه الآية إشارة إلى صلة الصوم ; لأنه تعالى لو ذكر الأيام لأمكن أن يعتقد أنه كان يفطر بالليل فلما نص على الليالي اقتضت قوة الكلام أنه عليه السلام واصل أربعين يوما بلياليها قال ابن عطية : سمعت أبي يقول : سمعت الشيخ الزاهد الإمام الواعظ أبا الفضل الجوهري رحمه الله يعظ الناس في الخلوة بالله والدنو منه في الصلاة ونحوه وأن ذلك يشغل عن كل طعام وشراب ويقول أين حال موسى في القرب من الله ووصال ثمانين من الدهر من قوله حين سار إلى الخضر لفتاه في بعض يوم آتنا غداءنا .\nقلت : وبهذا استدل علماء الصوفية على الوصال ، وأن أفضله أربعون يوما وسيأتي الكلام في الوصال في آي الصيام من هذه السورة إن شاء الله تعالى ويأتي في \" الأعراف \" زيادة أحكام لهذه الآية عند قوله تعالى وواعدنا موسى ثلاثين ليلة ويأتي لقصة العجل بيان في كيفيته وخواره هناك وفي \" طه \" إن شاء الله تعالى .\nالسادسة : قوله تعالى : ثم اتخذتم العجل من بعده أي اتخذتموه إلها من بعد موسى وأصل اتخذتم ائتخذتم من الأخذ ووزنه افتعلتم سهلت الهمزة الثانية لامتناع همزتين فجاء ايتخذتم فاضطربت الياء في التصريف ، جاءت ألفا في ياتخذ وواوا في موتخذ فبدلت بحرف جلد ثابت من جنس ما بعدها وهي التاء وأدغمت ثم اجتلبت ألف الوصل للنطق ، وقد يستغنى عنها إذا كان معنى الكلام التقرير كقوله تعالى قل أتخذتم عند الله عهدا فاستغنى عن ألف الوصل بألف التقرير قال الشاعر :\nأستحدث الركب عن أشياعهم خبرا أم راجع القلب من أطرابه طرب\nونحوه في القرآن أطلع الغيب أصطفى البنات أستكبرت أم كنت ومذهب أبي علي الفارسي أن \" اتخذتم \" من تخذ لا من أخذ . وأنتم ظالمون جملة في موضع الحال وقد تقدم معنى الظلم . والحمد لله\n                                    ",
        "saadi": "وَإِذۡ وَٰعَدۡنَا مُوسَىٰٓ أَرۡبَعِينَ لَيۡلَةٗ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ ١٥\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 50 الى 55 :ـ ثم ذكر منته عليهم بوعده لموسى أربعين ليلة لينزل عليهم التوراة المتضمنة للنعم العظيمة والمصالح العميمة، ثم إنهم لم يصبروا قبل استكمال الميعاد حتى عبدوا العجل من بعده, أي: ذهابه. { وَأَنْتُمْ ظَالِمُونَ } عالمون بظلمكم, قد قامت عليكم الحجة, فهو أعظم جرما وأكبر إثما. ثم إنه أمركم بالتوبة على لسان نبيه موسى بأن يقتل بعضكم بعضا فعفا الله عنكم بسبب ذلك { لَعَلَّكُمْ تَشْكُرُونَ } الله.\n                                    "
      },
      "originalText": "وَإِذۡ وَٰعَدۡنَا مُوسَىٰٓ أَرۡبَعِينَ لَيۡلَةٗ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ ١٥"
    },
    {
      "number": 59,
      "text": "ثُمَّ عَفَوْنَا عَنْكُمْ مِنْ بَعْدِ ذَٰلِكَ لَعَلَّكُمْ تَشْكُرُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 52,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ عَفَوۡنَا عَنكُم مِّنۢ بَعۡدِ ذَٰلِكَ لَعَلَّكُمۡ تَشۡكُرُونَ ٢٥\n                                    \n                                    \n                                    يقول تعالى : واذكروا نعمتي عليكم في عفوي عنكم ، لما عبدتم العجل بعد ذهاب موسى لميقات ربه ، عند انقضاء أمد المواعدة ، وكانت أربعين يوما ، وهي المذكورة في الأعراف ، في قوله تعالى : ( وواعدنا موسى ثلاثين ليلة وأتممناها بعشر ) [ الأعراف : 142 ] قيل : إنها ذو القعدة بكماله وعشر من ذي الحجة ، وكان ذلك بعد خلاصهم من قوم فرعون وإنجائهم من البحر \n                                    ",
        "qortoby": "ثُمَّ عَفَوۡنَا عَنكُم مِّنۢ بَعۡدِ ذَٰلِكَ لَعَلَّكُمۡ تَشۡكُرُونَ ٢٥\n                                    \n                                    \n                                    قوله تعالى : ثم عفونا عنكم من بعد ذلك لعلكم تشكرون\nفيه أربع مسائل : الأولى : قوله تعالى : ثم عفونا عنكم العفو : عفو الله جل وعز عن خلقه ، وقد يكون بعد العقوبة وقبلها بخلاف الغفران فإنه لا يكون معه عقوبة البتة ، وكل من استحق عقوبة فتركت له فقد عفي عنه فالعفو محو الذنب أي محونا ذنوبكم وتجاوزنا عنكم مأخوذ من قولك عفت الريح الأثر أي أذهبته وعفا الشيء كثر فهو من الأضداد ومنه قوله تعالى حتى عفوا .\nالثانية : قوله تعالى : من بعد ذلك أي من بعد عبادتكم العجل وسمي العجل عجلا لاستعجالهم عبادته والله أعلم والعجل ولد البقرة والعجول مثله والجمع العجاجيل والأنثى عجلة عن أبي الجراح .\nالثالثة : قوله تعالى : لعلكم تشكرون كي تشكروا عفو الله عنكم ، وقد تقدم معنى لعل وأما الشكر فهو في اللغة الظهور من قوله دابة شكور إذا ظهر عليها من السمن فوق ما تعطى من العلف وحقيقته الثناء على الإنسان بمعروف يوليكه كما تقدم في الفاتحة قال الجوهري الشكر الثناء على المحسن بما أولاكه من المعروف يقال شكرته وشكرت له وباللام أفصح والشكران خلاف الكفران وتشكرت له مثل شكرت له ، وروى الترمذي وأبو داود عن أبي هريرة عن النبي صلى الله عليه وسلم قال لا يشكر الله من لا يشكر الناس قال الخطابي هذا الكلام يتأول على معنيين : أحدهما أن من كان من طبعه كفران نعمة الناس وترك الشكر لمعروفهم كان من عادته كفران نعمة الله عز وجل وترك الشكر له ، والوجه الآخر أن الله سبحانه لا يقبل شكر العبد على إحسانه إليه إذا كان العبد لا يشكر إحسان الناس إليه ، ويكفر معروفهم لاتصال أحد الأمرين بالآخر .\nالرابعة : في عبارات العلماء في معنى الشكر فقال سهل بن عبد الله الشكر الاجتهاد في بذل الطاعة مع الاجتناب للمعصية في السر والعلانية ، وقالت فرقة أخرى : الشكر هو الاعتراف في تقصير الشكر للمنعم ولذلك قال تعالى اعملوا آل داود شكرا فقال داود : كيف أشكرك يا رب والشكر نعمة منك قال الآن قد عرفتني وشكرتني إذ قد عرفت أن الشكر مني نعمة قال يا رب فأرني أخفى نعمك علي قال يا داود تنفس فتنفس داود فقال الله تعالى من يحصي هذه النعمة الليل والنهار وقال موسى عليه السلام كيف أشكرك وأصغر نعمة وضعتها بيدي من نعمك لا يجازي بها عملي كله فأوحى الله إليه يا موسى الآن شكرتني ، وقال الجنيد حقيقة الشكر العجز عن الشكر وعنه قال كنت بين يدي السري السقطي ألعب وأنا ابن سبع سنين وبين يديه جماعة يتكلمون في الشكر فقال لي يا غلام ما الشكر ؟ فقلت ألا يعصى الله بنعمه فقال لي أخشى أن يكون حظك من الله لسانك قال الجنيد فلا أزال أبكي على هذه الكلمة التي قالها السري لي وقال الشبلي الشكر التواضع والمحافظة على الحسنات ومخالفة الشهوات وبذل الطاعات ومراقبة جبار الأرض والسماوات وقال ذو النون المصري أبو الفيض الشكر لمن فوقك بالطاعة ولنظيرك بالمكافأة ولمن دونك بالإحسان والإفضال .\n                                    ",
        "saadi": "ثُمَّ عَفَوۡنَا عَنكُم مِّنۢ بَعۡدِ ذَٰلِكَ لَعَلَّكُمۡ تَشۡكُرُونَ ٢٥\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 50 الى 55 :ـ ثم ذكر منته عليهم بوعده لموسى أربعين ليلة لينزل عليهم التوراة المتضمنة للنعم العظيمة والمصالح العميمة، ثم إنهم لم يصبروا قبل استكمال الميعاد حتى عبدوا العجل من بعده, أي: ذهابه. { وَأَنْتُمْ ظَالِمُونَ } عالمون بظلمكم, قد قامت عليكم الحجة, فهو أعظم جرما وأكبر إثما. ثم إنه أمركم بالتوبة على لسان نبيه موسى بأن يقتل بعضكم بعضا فعفا الله عنكم بسبب ذلك { لَعَلَّكُمْ تَشْكُرُونَ } الله.\n                                    "
      },
      "originalText": "ثُمَّ عَفَوۡنَا عَنكُم مِّنۢ بَعۡدِ ذَٰلِكَ لَعَلَّكُمۡ تَشۡكُرُونَ ٢٥"
    },
    {
      "number": 60,
      "text": "وَإِذْ آتَيْنَا مُوسَى الْكِتَابَ وَالْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 53,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَٱلۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُونَ ٣٥\n                                    \n                                    \n                                    وقوله : ( وإذ آتينا موسى الكتاب ) يعني : التوراة ( والفرقان ) وهو ما يفرق بين الحق والباطل ، والهدى والضلال ( لعلكم تهتدون ) وكان ذلك - أيضا - بعد خروجهم من البحر ، كما دل عليه سياق الكلام في سورة الأعراف . ولقوله تعالى : ( ولقد آتينا موسى الكتاب من بعد ما أهلكنا القرون الأولى بصائر للناس وهدى ورحمة لعلهم يتذكرون ) [ القصص : 43 ] .\nوقيل : الواو زائدة ، والمعنى : ولقد آتينا موسى الكتاب والفرقان وهذا غريب ، وقيل : عطف عليه وإن كان المعنى واحدا ، كما في قول الشاعر :\nوقدمت الأديم لراقشيه فألفى قولها كذبا ومينا\nوقال الآخر :\nألا حبذا هند وأرض بها هند وهند أتى من دونها النأي والبعد\nفالكذب هو المين ، والنأي : هو البعد . وقال عنترة :\nحييت من طلل تقادم عهده أقوى وأقفر بعد أم الهيثم\nفعطف الإقفار على الإقواء وهو هو .\n                                    ",
        "qortoby": "وَإِذۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَٱلۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُونَ ٣٥\n                                    \n                                    \n                                    قوله تعالى : وإذ آتينا موسى الكتاب والفرقان لعلكم تهتدون\n\" إذ \" اسم للوقت الماضي و \" إذا \" اسم للوقت المستقبل وآتينا أعطينا ، وقد تقدم جميع هذا والكتاب التوراة بإجماع من المتأولين واختلف في الفرقان فقال الفراء وقطرب : المعنى آتينا موسى التوراة ومحمدا عليه السلام الفرقان قال النحاس هذا خطأ في الإعراب والمعنى أما الإعراب فإن المعطوف على الشيء مثله وعلى هذا القول يكون المعطوف على الشيء خلافه وأما المعنى فقد قال تعالى ولقد آتينا موسى وهارون الفرقان قال أبو إسحاق الزجاج يكون الفرقان هو الكتاب ، أعيد ذكره باسمين تأكيدا وحكي عن الفراء ومنه قول الشاعر [ عدي بن يزيد ] :\nوقدمت الأديم لراهشيه وألفى قولها كذبا ومينا\nوقال آخر [ الحطيئة ] :\nألا حبذا هند وأرض بها هند وهند أتى من دونها النأي والبعد\nفنسق البعد على النأي والمين على الكذب لاختلاف اللفظين تأكيدا ، ومنه قول عنترة\nحييت من طلل تقادم عهده أقوى وأقفر بعد أم الهيثم\nقال النحاس وهذا إنما يجيء في الشعر وأحسن ما قيل في هذا قول مجاهد فرقا بين الحق والباطل أي الذي علمه إياه وقال ابن زيد الفرقان انفراق البحر له حتى صار فرقا فعبروا ، وقيل الفرقان الفرج من الكرب ؛ لأنهم كانوا مستعبدين مع القبط ، ومنه قوله تعالى إن تتقوا الله يجعل لكم فرقانا أي فرجا ومخرجا وقيل : إنه الحجة والبيان قاله ابن بحر وقيل الواو صلة والمعنى آتينا موسى الكتاب الفرقان والواو قد تزاد في النعوت كقولهم فلان حسن وطويل وأنشد\nإلى الملك القرم وابن الهمام وليث الكتيبة في المزدحم\nأراد إلى الملك القرم ابن الهمام ليث الكتيبة ودليل هذا التأويل قوله عز وجل : ثم آتينا موسى الكتاب تماما على الذي أحسن وتفصيلا لكل شيء أي بين الحرام والحلال والكفر والإيمان والوعد والوعيد وغير ذلك ، وقيل الفرقان الفرق بينهم وبين قوم فرعون أنجى هؤلاء وأغرق أولئك ونظيره يوم الفرقان فقيل يعني به يوم بدر نصر الله فيه محمدا صلى الله عليه وسلم وأصحابه وأهلك أبا جهل وأصحابه . لعلكم تهتدون لكي تهتدوا من الضلالة وقد تقدم .\n                                    ",
        "saadi": "وَإِذۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَٱلۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُونَ ٣٥\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 50 الى 55 :ـ ثم ذكر منته عليهم بوعده لموسى أربعين ليلة لينزل عليهم التوراة المتضمنة للنعم العظيمة والمصالح العميمة، ثم إنهم لم يصبروا قبل استكمال الميعاد حتى عبدوا العجل من بعده, أي: ذهابه. { وَأَنْتُمْ ظَالِمُونَ } عالمون بظلمكم, قد قامت عليكم الحجة, فهو أعظم جرما وأكبر إثما. ثم إنه أمركم بالتوبة على لسان نبيه موسى بأن يقتل بعضكم بعضا فعفا الله عنكم بسبب ذلك { لَعَلَّكُمْ تَشْكُرُونَ } الله.\n                                    "
      },
      "originalText": "وَإِذۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَٱلۡفُرۡقَانَ لَعَلَّكُمۡ تَهۡتَدُونَ ٣٥"
    },
    {
      "number": 61,
      "text": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يَا قَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنْفُسَكُمْ بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوبُوا إِلَىٰ بَارِئِكُمْ فَاقْتُلُوا أَنْفُسَكُمْ ذَٰلِكُمْ خَيْرٌ لَكُمْ عِنْدَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 54,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ إِنَّكُمۡ ظَلَمۡتُمۡ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلۡعِجۡلَ فَتُوبُوٓاْ إِلَىٰ بَارِئِكُمۡ فَٱقۡتُلُوٓاْ أَنفُسَكُمۡ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ عِندَ بَارِئِكُمۡ فَتَابَ عَلَيۡكُمۡۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٤٥\n                                    \n                                    \n                                    هذه صفة توبته تعالى على بني إسرائيل من عبادة العجل ، قال الحسن البصري ، رحمه الله ، في قوله تعالى : ( وإذ قال موسى لقومه يا قوم إنكم ظلمتم أنفسكم باتخاذكم العجل ) فقال ذلك حين وقع في قلوبهم من شأن عبادتهم العجل ما وقع حين قال الله تعالى : ( ولما سقط في أيديهم ورأوا أنهم قد ضلوا قالوا لئن لم يرحمنا ربنا ويغفر لنا ) الآية [ الأعراف : 149 ] .\nقال : فذلك حين يقول موسى : ( يا قوم إنكم ظلمتم أنفسكم باتخاذكم العجل )\nوقال أبو العالية ، وسعيد بن جبير ، والربيع بن أنس : ( فتوبوا إلى بارئكم ) أي إلى خالقكم .\nقلت : وفي قوله هاهنا : ( إلى بارئكم ) تنبيه على عظم جرمهم ، أي : فتوبوا إلى الذي خلقكم وقد عبدتم معه غيره .\nوروى النسائي وابن جرير وابن أبي حاتم ، من حديث يزيد بن هارون ، عن الأصبغ بن زيد الوراق عن القاسم بن أبي أيوب ، عن سعيد بن جبير ، عن ابن عباس ، قال : قال الله تعالى : إن توبتهم أن يقتل كل رجل منهم كل من لقي من ولد ووالد فيقتله بالسيف ، ولا يبالي من قتل في ذلك الموطن . فتاب أولئك الذين كانوا خفي على موسى وهارون ما اطلع الله من ذنوبهم ، فاعترفوا بها ، وفعلوا ما أمروا به فغفر الله تعالى للقاتل والمقتول . وهذا قطعة من حديث الفتون ، وسيأتي في تفسير سورة طه بكماله ، إن شاء الله .\nوقال ابن جرير : حدثني عبد الكريم بن الهيثم ، حدثنا إبراهيم بن بشار ، حدثنا سفيان بن عيينة ، قال : قال أبو سعيد : عن عكرمة ، عن ابن عباس ، قال : قال موسى لقومه : ( فتوبوا إلى بارئكم فاقتلوا أنفسكم ذلكم خير لكم عند بارئكم فتاب عليكم إنه هو التواب الرحيم ) قال : أمر موسى قومه - من أمر ربه عز وجل - أن يقتلوا أنفسهم قال : واحتبى الذين عبدوا العجل فجلسوا ، وقام الذين لم يعكفوا على العجل ، فأخذوا الخناجر بأيديهم ، وأصابتهم ظلة شديدة ، فجعل يقتل بعضهم بعضا ، فانجلت الظلة عنهم ، وقد أجلوا عن سبعين ألف قتيل ، كل من قتل منهم كانت له توبة ، وكل من بقي كانت له توبة .\nوقال ابن جريج : أخبرني القاسم بن أبي بزة أنه سمع سعيد بن جبير ومجاهدا يقولان في قوله تعالى : ( فاقتلوا أنفسكم ) قالا قام بعضهم إلى بعض بالخناجر فقتل بعضهم بعضا ، لا يحنو رجل على قريب ولا بعيد ، حتى ألوى موسى بثوبه ، فطرحوا ما بأيديهم ، فكشف عن سبعين ألف قتيل . وإن الله أوحى إلى موسى : أن حسبي ، فقد اكتفيت ، فذلك حين ألوى موسى بثوبه ، [ وروي عن علي رضي الله عنه نحو ذلك ] .\nوقال قتادة : أمر القوم بشديد من الأمر ، فقاموا يتناحرون بالشفار يقتل بعضهم بعضا ، حتى بلغ الله فيهم نقمته ، فسقطت الشفار من أيديهم ، فأمسك عنهم القتل ، فجعل لحيهم توبة ، وللمقتول شهادة .\nوقال الحسن البصري : أصابتهم ظلمة حندس ، فقتل بعضهم بعضا [ نقمة ] ثم انكشف عنهم ، فجعل توبتهم في ذلك .\nوقال السدي في قوله : ( فاقتلوا أنفسكم ) قال : فاجتلد الذين عبدوه والذين لم يعبدوه بالسيوف ، فكان من قتل من الفريقين شهيدا ، حتى كثر القتل ، حتى كادوا أن يهلكوا ، حتى قتل بينهم سبعون ألفا ، وحتى دعا موسى وهارون : ربنا أهلكت بني إسرائيل ، ربنا البقية البقية ،\nفأمرهم أن يضعوا السلاح وتاب عليهم ، فكان من قتل منهم من الفريقين شهيدا ، ومن بقي مكفرا عنه ؛ فذلك قوله : ( فتاب عليكم إنه هو التواب الرحيم )\nوقال الزهري : لما أمرت بنو إسرائيل بقتل أنفسها ، برزوا ومعهم موسى ، فاضطربوا بالسيوف ، وتطاعنوا بالخناجر ، وموسى رافع يديه ، حتى إذا أفنوا بعضهم ، قالوا : يا نبي الله ، ادع الله لنا . وأخذوا بعضديه يسندون يديه ، فلم يزل أمرهم على ذلك ، حتى إذا قبل الله توبتهم قبض أيديهم ، بعضهم عن بعض ، فألقوا السلاح ، وحزن موسى وبنو إسرائيل للذي كان من القتل فيهم ، فأوحى الله ، جل ثناؤه ، إلى موسى : ما يحزنك ؟ أما من قتل منكم فحي عندي يرزقون ، وأما من بقي فقد قبلت توبته . فسر بذلك موسى ، وبنو إسرائيل .\nرواه ابن جرير بإسناد جيد عنه .\nوقال ابن إسحاق : لما رجع موسى إلى قومه ، وأحرق العجل وذراه في اليم ، خرج إلى ربه بمن اختار من قومه ، فأخذتهم الصاعقة ، ثم بعثوا ، فسأل موسى ربه التوبة لبني إسرائيل من عبادة العجل . فقال : لا إلا أن يقتلوا أنفسهم قال : فبلغني أنهم قالوا لموسى : نصبر لأمر الله . فأمر موسى من لم يكن عبد العجل أن يقتل من عبده . فجلسوا بالأفنية وأصلت عليهم القوم السيوف ، فجعلوا يقتلونهم ، وبكى موسى ، وبهش إليه النساء والصبيان ، يطلبون العفو عنهم ، فتاب الله عليهم ، وعفا عنهم وأمر موسى أن ترفع عنهم السيوف .\nوقال عبد الرحمن بن زيد بن أسلم : لما رجع موسى إلى قومه ، وكان سبعون رجلا قد اعتزلوا مع هارون العجل لم يعبدوه . فقال لهم موسى : انطلقوا إلى موعد ربكم . فقالوا : يا موسى ، ما من توبة ؟ قال : بلى ، ( فاقتلوا أنفسكم ذلكم خير لكم عند بارئكم فتاب عليكم ) الآية ، فاخترطوا السيوف والجرزة والخناجر والسكاكين . قال : وبعث عليهم ضبابة . قال : فجعلوا يتلامسون بالأيدي ، ويقتل بعضهم بعضا . قال : ويلقى الرجل أباه وأخاه فيقتله ولا يدري . قال : ويتنادون [ فيها ] : رحم الله عبدا صبر نفسه حتى يبلغ الله رضاه ، قال : فقتلاهم شهداء ، وتيب على أحيائهم ، ثم قرأ : ( فتاب عليكم إنه هو التواب الرحيم )\n                                    ",
        "qortoby": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ إِنَّكُمۡ ظَلَمۡتُمۡ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلۡعِجۡلَ فَتُوبُوٓاْ إِلَىٰ بَارِئِكُمۡ فَٱقۡتُلُوٓاْ أَنفُسَكُمۡ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ عِندَ بَارِئِكُمۡ فَتَابَ عَلَيۡكُمۡۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٤٥\n                                    \n                                    \n                                    قوله تعالى : وإذ قال موسى لقومه يا قوم إنكم ظلمتم أنفسكم باتخاذكم العجل فتوبوا إلى بارئكم فاقتلوا أنفسكم ذلكم خير لكم عند بارئكم فتاب عليكم إنه هو التواب الرحيم\nقوله تعالى : وإذ قال موسى لقومه القوم الجماعة الرجال دون النساء قال الله تعالى لا يسخر قوم من قوم ثم قال ولا نساء من نساء وقال زهير :\nوما أدري وسوف إخال أدري أقوم آل حصن أم نساء\nوقال تعالى ولوطا إذ قال لقومه أراد الرجال دون النساء وقد يقع القوم على الرجال والنساء قال الله تعالى إنا أرسلنا نوحا إلى قومه وكذا كل نبي مرسل إلى النساء والرجال جميعا\nقوله تعالى : يا قوم\nمنادى مضاف وحذفت الياء في يا قوم ؛ لأنه موضع حذف والكسرة تدل عليها ، وهي بمنزلة التنوين فحذفتها كما تحذف التنوين من المفرد ويجوز في غير القرآن إثباتها ساكنة فتقول يا قومي ؛ لأنها اسم وهي في موضع خفض وإن شئت فتحتها وإن شئت ألحقت معها هاء فقلت يا قوميه وإن شئت أبدلت منها ألفا ؛ لأنها أخف فقلت يا قوما وإن شئت قلت يا قوم بمعنى يا أيها القوم وإن جعلتهم نكرة نصبت ونونت وواحد القوم امرؤ على غير اللفظ وتقول قوم وأقوام وأقاوم جمع الجمع والمراد هنا بالقوم عبدة العجل وكانت مخاطبته عليه السلام لهم بأمر من الله تعالى .\nقوله تعالى : إنكم ظلمتم أنفسكم استغنى بالجمع القليل عن الكثير ، والكثير نفوس وقد يوضع الجمع الكثير موضع جمع القلة والقليل موضع الكثرة قال الله تعالى ثلاثة قروء وقال وفيها ما تشتهيه الأنفس ويقال لكل من فعل فعلا يعود عليه ضرره إنما أسأت إلى نفسك ، وأصل الظلم وضع الشيء في غير موضعه . ثم قال تعالى : باتخاذكم العجل قال بعض أرباب المعاني عجل كل إنسان نفسه فمن أسقطه وخالف مراده فقد برئ من ظلمه والصحيح أنه هنا عجل على الحقيقة عبدوه كما نطق به التنزيل والحمد لله\nقوله تعالى : فتوبوا إلى بارئكم لما قال لهم فتوبوا إلى بارئكم قالوا كيف ؟ قال فاقتلوا أنفسكم قال أرباب الخواطر ذللوها بالطاعات وكفوها عن الشهوات والصحيح أنه قتل على الحقيقة هنا ، والقتل إماتة الحركة وقتلت الخمر كسرت شدتها بالماء قال سفيان بن عيينة التوبة نعمة من الله أنعم الله بها على هذه الأمة دون غيرها من الأمم وكانت توبة بني إسرائيل القتل وأجمعوا على أنه لم يؤمر كل واحد من عبدة العجل بأن يقتل نفسه بيده قال الزهري لما قيل لهم فتوبوا إلى بارئكم فاقتلوا أنفسكم قاموا صفين وقتل بعضهم بعضا حتى قيل لهم كفوا فكان ذلك شهادة للمقتول وتوبة للحي على ما تقدم ، وقال بعض المفسرين : أرسل الله عليهم ظلاما ففعلوا ذلك وقيل : وقف الذين عبدوا العجل صفا ودخل الذين لم يعبدوه عليهم بالسلاح فقتلوهم وقيل قام السبعون الذين كانوا مع موسى فقتلوا - إذ لم يعبدوا العجل - من عبد العجل . ويروى أن يوشع بن نون خرج عليهم وهم محتبون فقال ملعون من حل حبوته أو مد طرفه إلى قاتله أو اتقاه بيد أو رجل فما حل أحد منهم حبوته حتى قتل منهم يعني من قتل ، وأقبل الرجل يقتل من يليه . ذكره النحاس وغيره ، وإنما عوقب الذين لم يعبدوا العجل بقتل أنفسهم على القول الأول ; لأنهم لم يغيروا المنكر حين عبدوه ، وإنما اعتزلوا وكان الواجب عليهم أن يقاتلوا من عبده ، وهذه سنة الله في عباده إذا فشا المنكر ، ولم يغير عوقب الجميع روى جرير قال قال رسول الله صلى الله عليه وسلم ما من قوم يعمل فيهم بالمعاصي هم أعز منهم وأمنع لا يغيرون إلا عمهم الله بعقاب أخرجه ابن ماجه في سننه ، وسيأتي الكلام في هذا المعنى إن شاء الله تعالى فلما استحر فيهم القتل ، وبلغ سبعين ألفا عفا الله عنهم قاله ابن عباس وعلي رضي الله عنهما ، وإنما رفع الله عنهم القتل ؛ لأنهم أعطوا المجهود في قتل أنفسهم فما أنعم الله على هذه الأمة نعمة بعد الإسلام هي أفضل من التوبة ، وقرأ قتادة \" فأقيلوا أنفسكم \" من الإقالة أي استقبلوها من العثرة بالقتل .\nوله تعالى : بارئكم البارئ الخالق وبينهما فرق ، وذلك أن البارئ هو المبدع المحدث والخالق هو المقدر الناقل من حال إلى حال والبرية الخلق ، وهي فعيلة بمعنى مفعولة غير أنها لا تهمز وقرأ أبو عمرو \" بارئكم \" بسكون الهمزة ويشعركم وينصركم ويأمركم واختلف النحاة في هذا فمنهم من يسكن الضمة والكسرة في الوصل ، وذلك في الشعر وقال أبو العباس المبرد : لا يجوز التسكين مع توالي الحركات في حرف الإعراب في كلام ولا شعر وقراءة أبي عمرو لحن قال النحاس وغيره : وقد أجاز ذلك النحويون القدماء الأئمة وأنشدوا\nإذا اعوججن قلت صاحب قوم بالدو أمثال السفين العوم\nوقال امرؤ القيس\nفاليوم أشرب غير مستحقب إثما من الله ولا واغل\nوقال آخر\nقالت سليمى اشتر لنا سويقا\nوقال الآخر\nرحت وفي رجليك ما فيهما وقد بدا هنك من المئزر\nفمن أنكر التسكين في حرف الإعراب فحجته أن ذلك لا يجوز من حيث كان علما للإعراب . قال أبو علي : وأما حركة البناء فلم يختلف النحاة في جواز تسكينها مع توالي الحركات ، وأصل برأ من تبرى الشيء من الشيء ، وهو انفصاله منه فالخلق قد فصلوا من العدم إلى الوجود ومنه برأت من المرض برءا ( بالفتح ) كذا يقول أهل الحجاز وغيرهم يقول برئت من المرض برءا ( بالضم ) وبرئت منك ومن الديون والعيوب براءة ومنه المبارأة للمرأة . وقد بارأ شريكه وامرأته\nقوله تعالى : فتاب عليكم في الكلام حذف تقديره ففعلتم فتاب عليكم أي فتجاوز عنكم أي على الباقين منكم .\nإنه هو التواب الرحيم تقدم معناه ، والحمد لله .\n                                    ",
        "saadi": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ إِنَّكُمۡ ظَلَمۡتُمۡ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلۡعِجۡلَ فَتُوبُوٓاْ إِلَىٰ بَارِئِكُمۡ فَٱقۡتُلُوٓاْ أَنفُسَكُمۡ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ عِندَ بَارِئِكُمۡ فَتَابَ عَلَيۡكُمۡۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٤٥\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 50 الى 55 :ـ ثم ذكر منته عليهم بوعده لموسى أربعين ليلة لينزل عليهم التوراة المتضمنة للنعم العظيمة والمصالح العميمة، ثم إنهم لم يصبروا قبل استكمال الميعاد حتى عبدوا العجل من بعده, أي: ذهابه. { وَأَنْتُمْ ظَالِمُونَ } عالمون بظلمكم, قد قامت عليكم الحجة, فهو أعظم جرما وأكبر إثما. ثم إنه أمركم بالتوبة على لسان نبيه موسى بأن يقتل بعضكم بعضا فعفا الله عنكم بسبب ذلك { لَعَلَّكُمْ تَشْكُرُونَ } الله.\n                                    "
      },
      "originalText": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ إِنَّكُمۡ ظَلَمۡتُمۡ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلۡعِجۡلَ فَتُوبُوٓاْ إِلَىٰ بَارِئِكُمۡ فَٱقۡتُلُوٓاْ أَنفُسَكُمۡ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ عِندَ بَارِئِكُمۡ فَتَابَ عَلَيۡكُمۡۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ٤٥"
    },
    {
      "number": 62,
      "text": "وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَنْ نُؤْمِنَ لَكَ حَتَّىٰ نَرَى اللَّهَ جَهْرَةً فَأَخَذَتْكُمُ الصَّاعِقَةُ وَأَنْتُمْ تَنْظُرُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 55,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذۡ قُلۡتُمۡ يَٰمُوسَىٰ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡكُمُ ٱلصَّٰعِقَةُ وَأَنتُمۡ تَنظُرُونَ ٥٥\n                                    \n                                    \n                                    يقول تعالى : واذكروا نعمتي عليكم في بعثي لكم بعد الصعق ، إذ سألتم رؤيتي جهرة عيانا ، مما لا يستطاع لكم ولا لأمثالكم ، كما قال ابن جريج ، قال ابن عباس في هذه الآية : ( وإذ قلتم يا موسى لن نؤمن لك حتى نرى الله جهرة ) قال : علانية .\nوكذا قال إبراهيم بن طهمان عن عباد بن إسحاق ، عن أبي الحويرث ، عن ابن عباس ، أنه قال في قول الله تعالى : ( لن نؤمن لك حتى نرى الله جهرة ) أي علانية ، أي حتى نرى الله .\nوقال قتادة ، والربيع بن أنس : ( حتى نرى الله جهرة ) أي عيانا .\nوقال أبو جعفر عن الربيع بن أنس : هم السبعون الذين اختارهم موسى فساروا معه . قال : فسمعوا كلاما ، فقالوا : ( لن نؤمن لك حتى نرى الله جهرة ) قال : فسمعوا صوتا فصعقوا ، يقول : ماتوا .\nوقال مروان بن الحكم ، فيما خطب به على منبر مكة : الصاعقة : صيحة من السماء .\nوقال السدي في قوله : ( فأخذتكم الصاعقة ) الصاعقة : نار .\nوقال عروة بن رويم في قوله : ( وأنتم تنظرون ) قال : فصعق بعضهم وبعض ينظرون ، ثم بعث هؤلاء وصعق هؤلاء .\nوقال السدي : ( فأخذتكم الصاعقة ) فماتوا ، فقام موسى يبكي ويدعو الله ، ويقول : رب ، ماذا أقول لبني إسرائيل إذا أتيتهم وقد أهلكت خيارهم ( لو شئت أهلكتهم من قبل وإياي أتهلكنا بما فعل السفهاء منا ) [ الأعراف : 155 ] . فأوحى الله إلى موسى أن هؤلاء السبعين ممن اتخذوا العجل ، ثم إن الله أحياهم فقاموا وعاشوا رجل رجل ، ينظر بعضهم إلى بعض : كيف يحيون ؟ قال : فذلك قوله تعالى : ( ثم بعثناكم من بعد موتكم لعلكم تشكرون )\n                                    ",
        "qortoby": "وَإِذۡ قُلۡتُمۡ يَٰمُوسَىٰ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡكُمُ ٱلصَّٰعِقَةُ وَأَنتُمۡ تَنظُرُونَ ٥٥\n                                    \n                                    \n                                    قوله تعالى : وإذ قلتم يا موسى لن نؤمن لك حتى نرى الله جهرة فأخذتكم الصاعقة وأنتم تنظرون ثم بعثناكم من بعد موتكم لعلكم تشكرون\nفيه خمس مسائل : الأولى : \" وإذ قلتم \" معطوف . \" يا موسى \" نداء مفرد . لن نؤمن لك أي نصدقك حتى نرى الله جهرة قيل هم السبعون الذين اختارهم موسى ، وذلك أنهم لما أسمعهم كلام الله تعالى قالوا له بعد ذلك لن نؤمن لك . والإيمان بالأنبياء واجب بعد ظهور معجزاتهم فأرسل الله عليهم نارا من السماء فأحرقهم ثم دعا موسى ربه فأحياهم كما قال تعالى ثم بعثناكم من بعد موتكم وستأتي قصة السبعين في الأعراف إن شاء الله تعالى قال ابن فورك يحتمل أن تكون معاقبتهم لإخراجهم طلب الرؤية عن طريقه بقولهم لموسى أرنا الله جهرة وليس ذلك من مقدور موسى عليه السلام .\nوقد اختلف في جواز رؤية الله تعالى فأكثر المبتدعة على إنكارها في الدنيا والآخرة وأهل السنة والسلف على جوازها فيهما ووقوعها في الآخرة فعلى هذا لم يطلبوا من الرؤية محالا ; وقد سألها موسى عليه السلام وسيأتي الكلام في الرؤية في \" الأنعام \" و \" الأعراف \" إن شاء الله تعالى\nالثانية : قوله تعالى : : جهرة مصدر في موضع الحال ومعناه علانية وقيل عيانا قاله ابن عباس وأصل الجهر الظهور ومنه الجهر بالقراءة إنما هو إظهارها والمجاهرة بالمعاصي المظاهرة بها ورأيت الأمير جهارا وجهرة أي غير مستتر بشيء وقرأ ابن عباس ( جهرة ) بفتح الهاء ، وهما لغتان مثل زهرة وزهرة وفي الجهر وجهان : أحدهما : أنه صفة لخطابهم لموسى أنهم جهروا به وأعلنوا فيكون في الكلام تقديم وتأخير والتقدير وإذ قلتم جهرة يا موسى . الثاني : أنه صفة لما سألوه من رؤية الله تعالى أن يروه جهرة وعيانا فيكون الكلام على نسقه لا تقديم فيه ولا تأخير وأكد بالجهر فرقا بين رؤية العيان ورؤية المنام\nالثالثة قوله تعالى : فأخذتكم الصاعقة قد تقدم في أول السورة معنى الصاعقة ، وقرأ عمر وعثمان وعلي ( الصعقة ) وهي قراءة ابن محيصن في جميع القرآن .\nوأنتم تنظرون جملة في موضع الحال ويقال كيف يموتون وهم ينظرون ؟ فالجواب أن العرب تقول دور آل فلان تراءى أي يقابل بعضها بعضا ، وقيل المعنى تنظرون أي إلى حالكم وما نزل بكم من الموت وآثار الصعقة\n                                    ",
        "saadi": "وَإِذۡ قُلۡتُمۡ يَٰمُوسَىٰ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡكُمُ ٱلصَّٰعِقَةُ وَأَنتُمۡ تَنظُرُونَ ٥٥\n                                        \n                                        \n                                        \n                                        تفسير الآيات من 50 الى 55 :ـ ثم ذكر منته عليهم بوعده لموسى أربعين ليلة لينزل عليهم التوراة المتضمنة للنعم العظيمة والمصالح العميمة، ثم إنهم لم يصبروا قبل استكمال الميعاد حتى عبدوا العجل من بعده, أي: ذهابه. { وَأَنْتُمْ ظَالِمُونَ } عالمون بظلمكم, قد قامت عليكم الحجة, فهو أعظم جرما وأكبر إثما. ثم إنه أمركم بالتوبة على لسان نبيه موسى بأن يقتل بعضكم بعضا فعفا الله عنكم بسبب ذلك { لَعَلَّكُمْ تَشْكُرُونَ } الله.\n                                    "
      },
      "originalText": "وَإِذۡ قُلۡتُمۡ يَٰمُوسَىٰ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ نَرَى ٱللَّهَ جَهۡرَةٗ فَأَخَذَتۡكُمُ ٱلصَّٰعِقَةُ وَأَنتُمۡ تَنظُرُونَ ٥٥"
    },
    {
      "number": 63,
      "text": "ثُمَّ بَعَثْنَاكُمْ مِنْ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 56,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ثُمَّ بَعَثۡنَٰكُم مِّنۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ ٦٥\n                                    \n                                    \n                                    وقال الربيع بن أنس : كان موتهم عقوبة لهم ، فبعثوا من بعد الموت ليستوفوا آجالهم . وكذا قال قتادة .\nوقال ابن جرير : حدثنا محمد بن حميد ، حدثنا سلمة بن الفضل ، عن محمد بن إسحاق ، قال : لما رجع موسى إلى قومه فرأى ما هم عليه من عبادة العجل ، وقال لأخيه وللسامري ما قال ، وحرق العجل وذراه في اليم ، اختار موسى منهم سبعين رجلا الخير فالخير ، وقال : انطلقوا إلى الله وتوبوا إلى الله مما صنعتم وسلوه التوبة على من تركتم وراءكم من قومكم ، صوموا وتطهروا وطهروا ثيابكم . فخرج بهم إلى طور سيناء لميقات وقته له ربه ، وكان لا يأتيه إلا بإذن منه وعلم ، فقال له السبعون - فيما ذكر لي - حين صنعوا ما أمروا به وخرجوا للقاء الله ، قالوا : يا موسى ، اطلب لنا إلى ربك نسمع كلام ربنا ، فقال : أفعل . فلما دنا موسى من الجبل ، وقع عليه الغمام حتى تغشى الجبل كله ، ودنا موسى فدخل فيه ، وقال للقوم : ادنوا . وكان موسى إذا كلمه الله وقع على جبهته نور ساطع ،\nلا يستطيع أحد من بني آدم أن ينظر إليه ، فضرب دونه بالحجاب ، ودنا القوم حتى إذا دخلوا في الغمام وقعوا سجودا فسمعوه وهو يكلم موسى يأمره وينهاه : افعل ولا تفعل . فلما فرغ إليه من أمره انكشف عن موسى الغمام ، فأقبل إليهم ، فقالوا لموسى : ( لن نؤمن لك حتى نرى الله جهرة ) فأخذتهم الرجفة ، وهي الصاعقة ، فماتوا جميعا . وقام موسى يناشد ربه ويدعوه ويرغب إليه ، ويقول : ( رب لو شئت أهلكتهم من قبل [ وإياي ] ) [ الأعراف : 155 ] قد سفهوا ، أفتهلك من ورائي من بني إسرائيل بما يفعل السفهاء منا ؟ أي : إن هذا لهم هلاك . اخترت منهم سبعين رجلا الخير فالخير ، أرجع إليهم وليس معي منهم رجل واحد! فما الذي يصدقوني به ويأمنوني عليه بعد هذا ؟ ( إنا هدنا إليك ) [ الأعراف : 156 ] فلم يزل موسى يناشد ربه عز وجل ، ويطلب إليه حتى رد إليهم أرواحهم ، وطلب إليه التوبة لبني إسرائيل من عبادة العجل ، فقال : لا ؛ إلا أن يقتلوا أنفسهم .\nهذا سياق محمد بن إسحاق .\nوقال إسماعيل بن عبد الرحمن السدي الكبير : لما تابت بنو إسرائيل من عبادة العجل وتاب الله عليهم بقتل بعضهم بعضا كما أمرهم به ، أمر الله موسى أن يأتيه في كل أناس من بني إسرائيل ، يعتذرون إليه من عبادة العجل ، ووعدهم موسى ، فاختار موسى قومه سبعين رجلا على عينه ، ثم ذهب بهم ليعتذروا . وساق البقية .\n[ وهذا السياق يقتضي أن الخطاب توجه إلى بني إسرائيل في قوله : ( وإذ قلتم يا موسى لن نؤمن لك حتى نرى الله جهرة ) والمراد السبعون المختارون منهم ، ولم يحك كثير من المفسرين سواه ، وقد أغرب فخر الدين الرازي في تفسيره حين حكى في قصة هؤلاء السبعين : أنهم بعد إحيائهم قالوا : يا موسى ، إنك لا تطلب من الله شيئا إلا أعطاك ، فادعه أن يجعلنا أنبياء ، فدعا بذلك فأجاب الله دعوته ، وهذا غريب جدا ، إذ لا يعرف في زمان موسى نبي سوى هارون ثم يوشع بن نون ، وقد غلط أهل الكتاب أيضا في دعواهم أن هؤلاء رأوا الله عز وجل ، فإن موسى الكليم ، عليه السلام ، قد سأل ذلك فمنع منه فكيف يناله هؤلاء السبعون ؟\nالقول الثاني في الآية ] قال عبد الرحمن بن زيد بن أسلم في تفسير هذه الآية : قال لهم موسى - لما رجع من عند ربه بالألواح ، قد كتب فيها التوراة ، فوجدهم يعبدون العجل ، فأمرهم بقتل أنفسهم ، ففعلوا ، فتاب الله عليهم ، فقال : إن هذه الألواح فيها كتاب الله ، فيه أمركم الذي أمركم به ونهيكم الذي نهاكم عنه . فقالوا : ومن يأخذه بقولك أنت ؟ لا والله حتى نرى الله جهرة ، حتى\nيطلع الله علينا فيقول : هذا كتابي فخذوه ، فما له لا يكلمنا كما يكلمك أنت يا موسى ! وقرأ قول الله : ( لن نؤمن لك حتى نرى الله جهرة ) قال : فجاءت غضبة من الله ، فجاءتهم صاعقة بعد التوبة ، فصعقتهم فماتوا أجمعون . قال : ثم أحياهم الله من بعد موتهم ، وقرأ قول الله : ( ثم بعثناكم من بعد موتكم لعلكم تشكرون ) فقال لهم موسى : خذوا كتاب الله . فقالوا : لا فقال : أي شيء أصابكم ؟ فقالوا : أصابنا أنا متنا ثم حيينا . قال : خذوا كتاب الله . قالوا : لا . فبعث الله ملائكة فنتقت الجبل فوقهم .\n[ وهذا السياق يدل على أنهم كلفوا بعد ما أحيوا . وقد حكى الماوردي في ذلك قولين : أحدهما : أنه سقط التكليف عنهم لمعاينتهم الأمر جهرة حتى صاروا مضطرين إلى التصديق ؛ والثاني : أنهم مكلفون لئلا يخلو عاقل من تكليف ، قال القرطبي : وهذا هو الصحيح لأن معاينتهم للأمور الفظيعة لا تمنع تكليفهم ؛ لأن بني إسرائيل قد شاهدوا أمورا عظاما من خوارق العادات ، وهم في ذلك مكلفون وهذا واضح ، والله أعلم ] .\n                                    ",
        "qortoby": "ثُمَّ بَعَثۡنَٰكُم مِّنۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ ٦٥\n                                    \n                                    \n                                    قوله تعالى : ثم بعثناكم من بعد موتكم أي أحييناكم قال قتادة ماتوا وذهبت أرواحهم ثم ردوا لاستيفاء آجالهم . قال النحاس : وهذا احتجاج على من لم يؤمن بالبعث من قريش واحتجاج على أهل الكتاب إذ خبروا بهذا والمعنى لعلكم تشكرون ما فعل بكم من البعث بعد الموت وقيل ماتوا موت همود يعتبر به الغير ثم أرسلوا وأصل البعث الإرسال وقيل بل أصله إثارة الشيء من محله يقال بعثت الناقة أثرتها أي حركتها قال امرؤ القيس :\nوفتيان صدق قد بعثت بسحرة فقاموا جميعا بين عاث ونشوان\nوقال عنترة :\nوصحابة شم الأنوف بعثتهم ليلا وقد مال الكرى بطلاها\nوقال بعضهم بعثناكم من بعد موتكم علمناكم من بعد جهلكم .\nقلت : والأول أصح ؛ لأن الأصل الحقيقة وكان موت عقوبة ومنه قوله تعالى ألم تر إلى الذين خرجوا من ديارهم وهم ألوف حذر الموت فقال لهم الله موتوا ثم أحياهم على ما يأتي .\nالخامسة : قال الماوردي واختلف في بقاء تكليف من أعيد بعد موته ومعاينة الأحوال المضطرة إلى المعرفة على قولين : أحدهما بقاء تكليفهم ؛ لئلا يخلو عاقل من تعبد . الثاني : سقوط تكليفهم معتبرا بالاستدلال دون الاضطرار .\nقلت : والأول أصح فإن بني إسرائيل قد رأوا الجبل في الهواء ساقطا عليهم والنار محيطة بهم ، وذلك مما اضطرهم إلى الإيمان ، وبقاء التكليف ثابت عليهم ومثلهم قوم يونس ومحال أن يكونوا غير مكلفين والله أعلم\n                                    ",
        "saadi": "ثُمَّ بَعَثۡنَٰكُم مِّنۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ ٦٥\n                                        \n                                        \n                                        \n                                        { وَإِذْ قُلْتُمْ يَا مُوسَى لَنْ نُؤْمِنَ لَكَ حَتَّى نَرَى اللَّهَ جَهْرَةً } وهذا غاية الظلم والجراءة على الله وعلى رسوله، { فَأَخَذَتْكُمُ الصَّاعِقَةُ } إما الموت أو الغشية العظيمة، { وَأَنْتُمْ تَنْظُرُونَ } وقوع ذلك, كل ينظر إلى صاحبه، { ثُمَّ بَعَثْنَاكُمْ مِنْ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ }\n                                    "
      },
      "originalText": "ثُمَّ بَعَثۡنَٰكُم مِّنۢ بَعۡدِ مَوۡتِكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ ٦٥"
    },
    {
      "number": 64,
      "text": "وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَأَنْزَلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَىٰ ۖ كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ ۖ وَمَا ظَلَمُونَا وَلَٰكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ",
      "surah": {
        "number": 2,
        "name": "سورة البقرة",
        "englishName": "Al-Baqara",
        "englishNameTranslation": "The Cow",
        "revelationType": "Medinan",
        "numberOfAyahs": 286
      },
      "numberInSurah": 57,
      "juz": 1,
      "manzil": 1,
      "page": 8,
      "ruku": 7,
      "hizbQuarter": 3,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَظَلَّلۡنَا عَلَيۡكُمُ ٱلۡغَمَامَ وَأَنزَلۡنَا عَلَيۡكُمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٧٥\n                                    \n                                    \n                                    لما ذكر تعالى ما دفعه عنهم من النقم ، شرع يذكرهم - أيضا - بما أسبغ عليهم من النعم ، فقال : ( وظللنا عليكم الغمام ) وهو جمع غمامة ، سمي بذلك لأنه يغم السماء ، أي : يواريها ويسترها . وهو السحاب الأبيض ، ظللوا به في التيه ليقيهم حر الشمس . كما رواه النسائي وغيره عن ابن عباس في حديث الفتون ، قال : ثم ظلل عليهم في التيه بالغمام .\nقال ابن أبي حاتم : وروي عن ابن عمر ، والربيع بن أنس ، وأبي مجلز ، والضحاك ، والسدي ، نحو قول ابن عباس .\nوقال الحسن وقتادة : ( وظللنا عليكم الغمام ) [ قال ] كان هذا في البرية ظلل عليهم الغمام من الشمس .\nوقال ابن جرير قال آخرون : وهو غمام أبرد من هذا ، وأطيب .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا أبو حذيفة ، حدثنا شبل ، عن ابن أبي نجيح ، عن مجاهد : ( وظللنا عليكم الغمام ) قال : ليس بالسحاب ، هو الغمام الذي يأتي الله فيه يوم القيامة ، ولم يكن إلا لهم .\nوهكذا رواه ابن جرير ، عن المثنى بن إبراهيم ، عن أبي حذيفة .\nوكذا رواه الثوري ، وغيره ، عن ابن أبي نجيح ، عن مجاهد ، وكأنه يريد ، والله أعلم ، أنه ليس من زي هذا السحاب ، بل أحسن منه وأطيب وأبهى منظرا ، كما قال سنيد في تفسيره عن حجاج بن محمد ، عن ابن جريج قال : قال ابن عباس : ( وظللنا عليكم الغمام ) قال : غمام أبرد من هذا وأطيب ، وهو الذي يأتي الله فيه في قوله : ( هل ينظرون إلا أن يأتيهم الله في ظلل من الغمام والملائكة ) [ البقرة : 210 ] وهو الذي جاءت فيه الملائكة يوم بدر . قال ابن عباس : وكان معهم في التيه .\nوقوله : ( وأنزلنا عليكم المن ) اختلفت عبارات المفسرين في المن : ما هو ؟ فقال علي بن أبي طلحة ، عن ابن عباس : كان المن ينزل عليهم على الأشجار ، فيغدون إليه فيأكلون منه ما شاءوا .\nوقال مجاهد : المن : صمغة . وقال عكرمة : المن : شيء أنزله الله عليهم مثل الطل ، شبه الرب الغليظ .\nوقال السدي : قالوا : يا موسى ، كيف لنا بما هاهنا ؟ أين الطعام ؟ فأنزل الله عليهم المن ، فكان يسقط على شجر الزنجبيل .\nوقال قتادة : كان المن ينزل عليهم في محلتهم سقوط الثلج ، أشد بياضا من اللبن ، وأحلى من العسل ، يسقط عليهم من طلوع الفجر إلى طلوع الشمس ، يأخذ الرجل منهم قدر ما يكفيه يومه ذلك ؛ فإذا تعدى ذلك فسد ولم يبق ، حتى إذا كان يوم سادسه ، ليوم جمعته ، أخذ ما يكفيه ليوم سادسه ويوم سابعه ؛ لأنه كان يوم عيد لا يشخص فيه لأمر معيشته ولا يطلبه لشيء ، وهذا كله في البرية .\nوقال الربيع بن أنس : المن شراب كان ينزل عليهم مثل العسل ، فيمزجونه بالماء ثم يشربونه .\nوقال وهب بن منبه - وسئل عن المن - فقال : خبز الرقاق مثل الذرة أو مثل النقي .\nوقال أبو جعفر بن جرير : حدثني أحمد بن إسحاق ، حدثنا أبو أحمد ، حدثنا إسرائيل ، عن جابر ، عن عامر وهو الشعبي ، قال : عسلكم هذا جزء من سبعين جزءا من المن .\nوكذا قال عبد الرحمن بن زيد بن أسلم : إنه العسل .\nووقع في شعر أمية بن أبي الصلت ، حيث قال :\nفرأى الله أنهم بمضيع لا بذي مزرع ولا مثمورا فسناها عليهم غاديات\nوترى مزنهم خلايا وخورا عسلا ناطفا وماء فراتا\nوحليبا ذا بهجة مرمورا\nفالناطف : هو السائل ، والحليب المرمور : الصافي منه .\nوالغرض أن عبارات المفسرين متقاربة في شرح المن ، فمنهم من فسره بالطعام ، ومنهم من فسره بالشراب ، والظاهر ، والله أعلم ، أنه كل ما امتن الله به عليهم من طعام وشراب ، وغير ذلك ، مما ليس لهم فيه عمل ولا كد ، فالمن المشهور إن أكل وحده كان طعاما وحلاوة ، وإن مزج مع الماء صار شرابا طيبا ، وإن ركب مع غيره صار نوعا آخر ، ولكن ليس هو المراد من الآية وحده ؛ والدليل على ذلك قول البخاري :\nحدثنا أبو نعيم ، حدثنا سفيان ، عن عبد الملك ، عن عمرو بن حريث عن سعيد بن زيد - رضي الله عنه - قال : قال النبي صلى الله عليه وسلم : الكمأة من المن ، وماؤها شفاء للعين .\nوهذا الحديث رواه الإمام أحمد ، عن سفيان بن عيينة ، عن عبد الملك ، وهو ابن عمير ، به .\nوأخرجه الجماعة في كتبهم ، إلا أبا داود ، من طرق عن عبد الملك ، وهو ابن عمير ، به . وقال الترمذي : حسن صحيح ، ورواه البخاري ومسلم والنسائي من رواية الحكم ، عن الحسن العرني ، عن عمرو بن حريث ، به .\nوقال الترمذي : حدثنا أبو عبيدة بن أبي السفر ومحمود بن غيلان ، قالا حدثنا سعيد بن عامر ، عن محمد بن عمرو ، عن أبي سلمة ، عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم : العجوة من الجنة ، وفيها شفاء من السم ، والكمأة من المن وماؤها شفاء للعين .\nتفرد بإخراجه الترمذي ، ثم قال : هذا حديث حسن غريب ، لا نعرفه إلا من حديث محمد بن عمرو ، وإلا من حديث سعيد بن عامر ، عنه ، وفي الباب عن سعيد بن زيد ، وأبي سعيد وجابر .\nكذا قال ، وقد رواه الحافظ أبو بكر بن مردويه في تفسيره ، من طريق آخر ، عن أبي هريرة ، فقال : حدثنا أحمد بن الحسن بن أحمد البصري ، حدثنا أسلم بن سهل ، حدثنا القاسم بن عيسى ، حدثنا طلحة بن عبد الرحمن ، عن قتادة عن سعيد بن المسيب ، عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم : الكمأة من المن ، وماؤها شفاء للعين .\nوهذا حديث غريب من هذا الوجه ، وطلحة بن عبد الرحمن هذا سلمي واسطي ، يكنى بأبي محمد\n، وقيل : أبو سليمان المؤدب قال فيه الحافظ أبو أحمد بن عدي : روى عن قتادة أشياء لا يتابع عليها .\nثم قال [ الترمذي ] حدثنا محمد بن بشار ، حدثنا معاذ بن هشام ، حدثنا أبي ، عن قتادة ، عن شهر بن حوشب ، عن أبي هريرة : أن ناسا من أصحاب النبي صلى الله عليه وسلم قالوا : الكمأة جدري الأرض ، فقال نبي الله صلى الله عليه وسلم : الكمأة من المن ، وماؤها شفاء للعين ، والعجوة من الجنة وهي شفاء من السم .\nوهذا الحديث قد رواه النسائي ، عن محمد بن بشار ، به . وعنه ، عن غندر ، عن شعبة ، عن أبي بشر جعفر بن إياس ، عن شهر بن حوشب ، عن أبي هريرة ، به . وعن محمد بن بشار ، عن عبد الأعلى ، عن خالد الحذاء ، عن شهر بن حوشب . بقصة الكمأة فقط .\nوروى النسائي - أيضا - وابن ماجه من حديث محمد بن بشار ، عن أبي عبد الصمد عبد العزيز بن عبد الصمد ، عن مطر الوراق ، عن شهر : بقصة العجوة عند النسائي ، وبالقصتين عند ابن ماجه .\nوهذه الطريق منقطعة بين شهر بن حوشب وأبي هريرة فإنه لم يسمعه منه ، بدليل ما رواه النسائي في الوليمة من سننه ، عن علي بن الحسين الدرهمي عن عبد الأعلى ، عن سعيد بن أبي عروبة ، عن قتادة ، عن شهر بن حوشب ، عن عبد الرحمن بن غنم ، عن أبي هريرة ، قال : خرج رسول الله صلى الله عليه وسلم وهم يذكرون الكمأة ، وبعضهم يقول جدري الأرض ، فقال : الكمأة من المن ، وماؤها شفاء للعين .\nوروي عن شهر بن حوشب عن أبي سعيد وجابر ، كما قال الإمام أحمد :\nحدثنا أسباط بن محمد ، حدثنا الأعمش ، عن جعفر بن إياس ، عن شهر بن حوشب ، عن جابر بن عبد الله وأبي سعيد الخدري ، قالا قال 1 270\nرسول الله صلى الله عليه وسلم : الكمأة من المن وماؤها شفاء للعين والعجوة من الجنة وهي شفاء من السم .\nقال النسائي في الوليمة أيضا : حدثنا محمد بن بشار ، حدثنا محمد بن جعفر ، حدثنا شعبة ، عن أبي بشر جعفر بن إياس عن شهر بن حوشب ، عن أبي سعيد وجابر ، رضي الله عنهما ، أن رسول الله صلى الله عليه وسلم قال : الكمأة من المن ، وماؤها شفاء للعين . ثم رواه - أيضا - ، وابن ماجه من طرق ، عن الأعمش ، عن أبي بشر ، عن شهر ، عنهما ، به .\nوقد رويا - أعني النسائي وابن ماجه - من حديث سعيد بن مسلم كلاهما عن الأعمش ، عن جعفر بن إياس عن أبي نضرة ، عن أبي سعيد ، زاد النسائي : [ وحديث ] جابر ، عن النبي صلى الله عليه وسلم قال : الكمأة من المن ، وماؤها شفاء للعين .\nورواه ابن مردويه ، عن أحمد بن عثمان ، عن عباس الدوري ، عن لاحق بن صواب عن عمار بن رزيق عن الأعمش ، كابن ماجه .\nوقال ابن مردويه أيضا : حدثنا أحمد بن عثمان ، حدثنا عباس الدوري ، حدثنا الحسن بن الربيع ، حدثنا أبو الأحوص ، عن الأعمش ، عن المنهال بن عمرو ، عن عبد الرحمن بن أبي ليلى ، عن أبي سعيد الخدري ، قال : خرج علينا رسول الله صلى الله عليه وسلم وفي يده كمآت ، فقال : الكمأة من المن ، وماؤها شفاء للعين .\nوأخرجه النسائي ، عن عمرو بن منصور ، عن الحسن بن الربيع ثم [ رواه ] ابن مردويه . رواه أيضا عن عبد الله بن إسحاق عن الحسن بن سلام ، عن عبيد الله بن موسى ، عن شيبان عن الأعمش به ، وكذا رواه النسائي عن أحمد بن عثمان بن حكيم ، عن عبيد الله بن موسى [ به ] .\nوقد روى من حديث أنس بن مالك ، رضي الله عنه كما قال ابن مردويه :\nحدثنا محمد بن عبد الله بن إبراهيم ، حدثنا حمدون بن أحمد ، حدثنا حوثرة بن أشرس ، حدثنا حماد ، عن شعيب بن الحبحاب عن أنس : أن أصحاب رسول الله صلى الله عليه وسلم تدارؤوا في الشجرة التي اجتثت من فوق الأرض ما لها من قرار ، فقال بعضهم : نحسبه الكمأة . فقال رسول الله صلى الله عليه وسلم : الكمأة من المن وماؤها شفاء للعين ، والعجوة من الجنة ، وفيها شفاء من السم .\nوهذا الحديث محفوظ أصله من رواية حماد بن سلمة . وقد روى الترمذي والنسائي من طريقه شيئا من هذا ، والله أعلم .\n[ وقد ] روي عن شهر ، عن ابن عباس ، كما رواه النسائي - أيضا - في الوليمة ، عن أبي بكر أحمد بن علي بن سعيد ، عن عبد الله بن عون الخراز ، عن أبي عبيدة الحداد ، عن عبد الجليل بن عطية ، عن شهر ، عن عبد الله بن عباس ، عن النبي صلى الله عليه وسلم قال : الكمأة من المن ، وماؤها شفاء للعين .\nفقد اختلف - كما ترى فيه - على شهر بن حوشب ، ويحتمل عندي أنه حفظه ورواه من هذه الطرق كلها ، وقد سمعه من بعض الصحابة وبلغه عن بعضهم ، فإن الأسانيد إليه جيدة ، وهو لا يتعمد الكذب ، وأصل الحديث محفوظ عن رسول الله صلى الله عليه وسلم ، كما تقدم من رواية سعيد بن زيد .\nوأما السلوى فقال علي بن أبي طلحة عن ابن عباس : السلوى طائر شبيه بالسمانى ، كانوا يأكلون منه .\nوقال السدي في خبر ذكره عن أبي مالك وعن أبي صالح ، عن ابن عباس - وعن مرة ، عن ابن مسعود ، وعن ناس من الصحابة : السلوى : طائر يشبه السمانى .\nوقال ابن أبي حاتم : حدثنا الحسن بن محمد بن الصباح ، حدثنا عبد الصمد بن عبد الوارث ، حدثنا قرة بن خالد ، عن جهضم ، عن ابن عباس ، قال : السلوى : هو السمانى .\nوكذا قال مجاهد ، والشعبي ، والضحاك ، والحسن ، وعكرمة ، والربيع بن أنس ، رحمهم الله .\nوعن عكرمة : أما السلوى فطير كطير يكون بالجنة أكبر من العصفور ، أو نحو ذلك .\nوقال قتادة : السلوى من طير إلى الحمرة ، تحشرها عليهم الريح الجنوب . وكان الرجل يذبح منها قدر ما يكفيه يومه ذلك ، فإذا تعدى فسد ولم يبق عنده ، حتى إذا كان يوم سادسه ليوم جمعته أخذ ما يكفيه ليوم سادسه ويوم سابعه ؛ لأنه كان يوم عبادة لا يشخص فيه لشيء ولا يطلبه .\nوقال وهب بن منبه : السلوى : طير سمين مثل الحمام ، كان يأتيهم فيأخذون منه من سبت إلى سبت . وفي رواية عن وهب ، قال : سألت بنو إسرائيل موسى عليه السلام ، اللحم ، فقال الله : لأطعمنهم من أقل لحم يعلم في الأرض ، فأرسل عليهم ريحا ، فأذرت عند مساكنهم السلوى ، وهو السمانى مثل ميل في ميل قيد رمح إلى السماء فخبئوا للغد فنتن اللحم وخنز الخبز .\nوقال السدي : لما دخل بنو إسرائيل التيه ، قالوا لموسى ، عليه السلام : كيف لنا بما هاهنا ؟ أين الطعام ؟ فأنزل الله عليهم المن فكان يسقط على الشجر الزنجبيل ، والسلوى وهو طائر يشبه السمانى أكبر منه ، فكان يأتي أحدهم فينظر إلى الطير ، فإن كان سمينا ذبحه وإلا أرسله ، فإذا سمن أتاه ، فقالوا : هذا الطعام فأين الشراب ؟ فأمر موسى فضرب بعصاه الحجر ، فانفجرت منه اثنتا عشرة عينا ، فشرب كل سبط من عين ، فقالوا : هذا الشراب ، فأين الظل ؟ فظلل عليهم الغمام . فقالوا : هذا الظل ، فأين اللباس ؟ فكانت ثيابهم تطول معهم كما يطول الصبيان ، ولا ينخرق لهم ثوب ، فذلك قوله تعالى : ( وظللنا عليكم الغمام وأنزلنا عليكم المن والسلوى ) وقوله ( وإذ استسقى موسى لقومه فقلنا اضرب بعصاك الحجر فانفجرت منه اثنتا عشرة عينا قد علم كل أناس مشربهم ) [ البقرة : 60 ] .\nوروي عن وهب بن منبه ، وعبد الرحمن بن زيد بن أسلم نحو ما قاله السدي .\nوقال سنيد ، عن حجاج ، عن ابن جريج ، قال : قال ابن عباس : خلق لهم في التيه ثياب لا تخرق ولا تدرن ، قال ابن جريج : فكان الرجل إذا أخذ من المن والسلوى فوق طعام يوم فسد ، إلا أنهم كانوا يأخذون في يوم الجمعة طعام يوم السبت فلا يصبح فاسدا .\n[ قال ابن عطية : السلوى : طير بإجماع المفسرين ، وقد غلط الهذلي في قوله : إنه العسل ، وأنشد في ذلك مستشهدا :\nوقاسمها بالله جهدا لأنتم ألذ من السلوى إذا ما أشورها\nقال : فظن أن السلوى عسلا قال القرطبي : دعوى الإجماع لا تصح ؛ لأن المؤرج أحد علماء اللغة والتفسير قال : إنه العسل ، واستدل ببيت الهذلي هذا ، وذكر أنه كذلك في لغة كنانة ؛ لأنه يسلى به ومنه عين سلوان ، وقال الجوهري : السلوى العسل ، واستشهد ببيت الهذلي - أيضا - ، والسلوانة بالضم خرزة ، كانوا يقولون إذا صب عليها ماء المطر فشربها العاشق سلا قال الشاعر :\nشربت على سلوانة ماء مزنة فلا وجديد العيش يا مي ما أسلو\nواسم ذلك الماء السلوان ، وقال بعضهم : السلوان دواء يشفي الحزين فيسلو والأطباء يسمونه ( مفرج ) ، قالوا : والسلوى جمع بلفظ - الواحد - أيضا ، كما يقال : سمانى للمفرد والجمع وويلى كذلك ، وقال الخليل واحده سلواة ، وأنشد :\nوإني لتعروني لذكراك هزة كما انتفض السلواة من بلل القطر\nوقال الكسائي : السلوى واحدة وجمعه سلاوي ، نقله كله القرطبي ] .\nوقوله تعالى : ( كلوا من طيبات ما رزقناكم ) أمر إباحة وإرشاد وامتنان . وقوله : ( وما ظلمونا ولكن كانوا أنفسهم يظلمون ) [ البقرة : 57 ] ، أي أمرناهم بالأكل مما رزقناهم وأن يعبدوا ، كما قال : ( كلوا من رزق ربكم واشكروا له ) [ سبأ : 15 ] فخالفوا وكفروا فظلموا أنفسهم ، هذا مع ما شاهدوه من الآيات البينات والمعجزات القاطعات ، وخوارق العادات ، ومن هاهنا تتبين فضيلة أصحاب محمد صلى الله عليه وسلم ورضي عنهم ، على سائر أصحاب الأنبياء في صبرهم وثباتهم وعدم تعنتهم ، كما كانوا معه في أسفاره وغزواته ، منها عام تبوك ، في ذلك القيظ والحر الشديد والجهد ، لم يسألوا خرق عادة ، ولا إيجاد أمر ، مع أن ذلك كان سهلا على الرسول صلى الله عليه وسلم ، ولكن لما أجهدهم الجوع سألوه في تكثير طعامهم فجمعوا ما معهم ، فجاء قدر مبرك الشاة ، فدعا [ الله ] فيه ، وأمرهم فملئوا كل وعاء معهم ، وكذا لما احتاجوا إلى الماء سأل الله تعالى ، فجاءت سحابة فأمطرتهم ، فشربوا وسقوا الإبل وملئوا أسقيتهم . ثم نظروا فإذا هي لم تجاوز العسكر . فهذا هو الأكمل في الاتباع : المشي مع قدر الله ، مع متابعة الرسول صلى الله عليه وسلم .\n                                    ",
        "qortoby": "وَظَلَّلۡنَا عَلَيۡكُمُ ٱلۡغَمَامَ وَأَنزَلۡنَا عَلَيۡكُمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٧٥\n                                    \n                                    \n                                    قوله تعالى : وظللنا عليكم الغمام وأنزلنا عليكم المن والسلوى كلوا من طيبات ما رزقناكم وما ظلمونا ولكن كانوا أنفسهم يظلمون\nفيه ثماني مسائل : الأولى : قوله تعالى : وظللنا عليكم الغمام أي جعلناه عليكم كالظلة والغمام جمع غمامة كسحابة وسحاب قاله الأخفش سعيد . قال الفراء ويجوز غمائم وهي السحاب ؛ لأنها تغم السماء أي تسترها وكل مغطى فهو مغموم ، ومنه المغموم على عقله وغم الهلال إذا غطاه الغيم والغين مثل الغيم ، ومنه قوله عليه السلام ( إنه ليغان على قلبي ) قال صاحب العين : غين عليه غطي عليه والغين شجر ملتف وقال السدي الغمام السحاب الأبيض وفعل هذا بهم ليقيهم حر الشمس نهارا ، وينجلي في آخره ليستضيئوا بالقمر ليلا وذكر المفسرون أن هذا جرى في التيه بين مصر والشام لما امتنعوا من دخول مدينة الجبارين وقتالهم وقالوا لموسى فاذهب أنت وربك فقاتلا فعوقبوا في ذلك الفحص أربعين سنة يتيهون في خمسة فراسخ أو ستة ، روي أنهم كانوا يمشون النهار كله وينزلون للمبيت فيصبحون حيث كانوا بكرة أمس ، وإذ كانوا بأجمعهم في التيه قالوا لموسى : من لنا بالطعام ؟ فأنزل الله عليهم المن والسلوى ، قالوا : من لنا من حر الشمس ؟ فظلل عليهم الغمام ، قالوا : فبم نستصبح ؟ فضرب لهم عمود نور في وسط محلتهم . وذكر مكي : عمود من نار ، قالوا : من لنا بالماء ؟ فأمر موسى بضرب الحجر ، قالوا : من لنا باللباس ؟ فأعطوا ألا يبلى لهم ثوب ولا يخلق ولا يدرن ، وأن تنمو صغارها حسب نمو الصبيان ، والله أعلم .\nالثانية : قوله تعالى : وأنزلنا عليكم المن والسلوى اختلف في المن ما هو ، وتعيينه على أقوال ؛ فقيل : الترنجبين بتشديد الراء وتسكين النون ، ذكره النحاس ويقال : الطرنجبين بالطاء ، وعلى هذا أكثر المفسرين . وقيل : صمغة حلوة ، وقيل : عسل ، وقيل : شراب حلو ، وقيل : خبز الرقاق عن وهب بن منبه ، وقيل : \" المن \" مصدر يعم جميع ما من الله به على عباده من غير تعب ولا زرع ، ومنه قول رسول الله صلى الله عليه وسلم في حديث سعيد بن زيد بن عمرو بن نفيل : الكمأة من المن الذي أنزل الله على بني إسرائيل ، وماؤها شفاء للعين في رواية : من المن الذي أنزل الله على موسى رواه مسلم . قال علماؤنا : وهذا الحديث يدل على أن الكمأة مما أنزل الله على بني إسرائيل أي : مما خلقه الله لهم في التيه قال أبو عبيد : إنما شبهها بالمن لأنه لا مئونة فيها ببذر ولا سقي ولا علاج ، فهي منه ، أي : من جنس من بني إسرائيل في أنه كان دون تكلف ، روي أنه كان ينزل عليهم من طلوع الفجر إلى طلوع الشمس كالثلج ، فيأخذ الرجل ما يكفيه ليومه ، فإن ادخر منه شيئا فسد عليه إلا في يوم الجمعة ، فإنهم كانوا يدخرون ليوم السبت فلا يفسد عليهم ؛ لأن يوم السبت يوم عبادة ، وما كان ينزل عليهم يوم السبت شيء .\nالثالثة : لما نص عليه السلام على أن ماء الكمأة شفاء للعين قال بعض أهل العلم بالطب : إما لتبريد العين من بعض ما يكون فيها من الحرارة ، فتستعمل بنفسها مفردة ، وإما لغير ذلك فمركبة مع غيرها وذهب أبو هريرة رضي الله عنه إلى استعمالها بحتا في جميع مرض العين ، وهذا كما استعمل أبو وجزة العسل في جميع الأمراض كلها حتى في الكحل على ما يأتي بيانه في سورة \" النحل \" إن شاء الله تعالى ، وقال أهل اللغة : الكمء واحد ، وكمآن اثنان ، وأكمؤ ثلاثة ، فإذا زادوا قالوا : كمأة بالتاء ، على عكس شجرة وشجر ، والمن اسم جنس لا واحد له من لفظه مثل الخير والشر ، قاله الأخفش .\nالرابعة : قوله تعالى : والسلوى اختلف في السلوى ، فقيل : هو السمانى بعينه ، قاله الضحاك ، قال ابن عطية : السلوى طير بإجماع المفسرين ، وقد غلط الهذلي [ خالد بن زهير ] فقال :\nوقاسمها بالله جهدا لأنتم ألذ من السلوى إذا ما نشورها\nظن السلوى العسل .\nقلت : ما ادعاه من الإجماع لا يصح ، وقد قال المؤرج - أحد علماء اللغة والتفسير - : إنه العسل ، واستدل ببيت الهذلي ، وذكر أنه كذلك بلغة كنانة ، سمي به لأنه يسلى به ، ومنه عين السلوان ، وأنشد :\nلو أشرب السلوان ما سليت ما بي غنى عنك وإن غنيت\nوقال الجوهري : والسلوى : العسل ، وذكر بيت الهذلي :\nألذ من السلوى إذا ما نشورها\nولم يذكر غلطا ، والسلوانة ( بالضم ) خرزة كانوا يقولون إذا صب عليها ماء المطر فشربه العاشق سلا ، قال :\nشربت على سلوانة ماء مزنة فلا وجديد العيش يا مي ما أسلو\nواسم ذلك الماء السلوان ، وقال بعضهم : السلوان دواء يسقاه الحزين فيسلو ، والأطباء يسمونه المفرح ، يقال : سليت وسلوت لغتان ، وهو في سلوة من العيش أي : في رغد ، عن أبي زيد .\nالخامسة : واختلف في السلوى ، هل هو جمع أو مفرد ، فقال الأخفش : جمع لا واحد له من لفظه ، مثل الخير والشر ، وهو يشبه أن يكون واحده سلوى ، مثل جماعته ، كما قالوا : دفلى للواحد والجماعة وسمانى وشكاعى في الواحد والجميع ، وقال الخليل : واحده سلواة ، وأنشد :\nوإني لتعروني لذكراك هزة كما انتفض السلواة من بلل القطر\nوقال الكسائي : السلوى واحدة ، وجمعه سلاوي .\nالسادسة : السلوى عطف على المن ولم يظهر فيه الإعراب ؛ لأنه مقصور ، ووجب هذا في المقصور كله ؛ لأنه لا يخلو من أن يكون في آخره ألف ، قال الخليل : والألف حرف هوائي لا مستقر له ، فأشبه الحركة ، فاستحالت حركته ، وقال الفراء : لو حركت الألف صارت همزة .\nالسابعة : قوله تعالى : كلوا من طيبات ما رزقناكم كلوا فيه حذف تقديره : وقلنا كلوا ، فحذف اختصارا لدلالة الظاهر عليه ، والطيبات هنا قد جمعت الحلال واللذيذ .\nالثامنة : قوله تعالى : وما ظلمونا يقدر قبله : فعصوا ولم يقابلوا النعم بالشكر .\nولكن كانوا أنفسهم يظلمون لمقابلتهم النعم بالمعاصي .\n                                    ",
        "saadi": "وَظَلَّلۡنَا عَلَيۡكُمُ ٱلۡغَمَامَ وَأَنزَلۡنَا عَلَيۡكُمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٧٥\n                                        \n                                        \n                                        \n                                        ثم ذكر نعمته عليكم في التيه والبرية الخالية من الظلال وسعة الأرزاق، فقال: { وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَأَنْزَلْنَا عَلَيْكُمُ الْمَنَّ } وهو اسم جامع لكل رزق حسن يحصل بلا تعب، ومنه الزنجبيل والكمأة والخبز وغير ذلك. { وَالسَّلْوَى } طائر صغير يقال له السماني، طيب اللحم، فكان ينزل عليهم من المن والسلوى ما يكفيهم ويقيتهم { كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ } أي: رزقا لا يحصل نظيره لأهل المدن المترفهين, فلم يشكروا هذه النعمة, واستمروا على قساوة القلوب وكثرة الذنوب. { وَمَا ظَلَمُونَا } يعني بتلك الأفعال المخالفة لأوامرنا لأن الله لا تضره معصية العاصين, كما لا تنفعه طاعات الطائعين، { وَلَكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ } فيعود ضرره عليهم.\n                                    "
      },
      "originalText": "وَظَلَّلۡنَا عَلَيۡكُمُ ٱلۡغَمَامَ وَأَنزَلۡنَا عَلَيۡكُمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡۚ وَمَا ظَلَمُونَا وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ ٧٥"
    }
  ]
}