{
  "number": 83,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 520,
      "text": "وَاللَّهُ يُرِيدُ أَنْ يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَنْ تَمِيلُوا مَيْلًا عَظِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 27,
      "juz": 5,
      "manzil": 1,
      "page": 83,
      "ruku": 66,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيۡكُمۡ وَيُرِيدُ ٱلَّذِينَ يَتَّبِعُونَ ٱلشَّهَوَٰتِ أَن تَمِيلُواْ مَيۡلًا عَظِيمٗا ٧٢\n                                    \n                                    \n                                    وله : ( [ والله يريد أن يتوب عليكم ] ويريد الذين يتبعون الشهوات أن تميلوا ميلا عظيما ) أي : يريد أتباع الشياطين من اليهود والنصارى والزناة ( أن تميلوا ) يعني : عن الحق إلى الباطل ( ميلا عظيما )\n                                    ",
        "qortoby": "وَٱللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيۡكُمۡ وَيُرِيدُ ٱلَّذِينَ يَتَّبِعُونَ ٱلشَّهَوَٰتِ أَن تَمِيلُواْ مَيۡلًا عَظِيمٗا ٧٢\n                                    \n                                    \n                                    قوله تعالى : والله يريد أن يتوب عليكم ويريد الذين يتبعون الشهوات أن تميلوا ميلا عظيما\nقوله تعالى : والله يريد أن يتوب عليكم ابتداء وخبر . وأن في موضع نصب ب يريد وكذلك يريد الله أن يخفف عنكم ؛ ف ( أن ) يخفف في موضع نصب ب ( يريد ) والمعنى : يريد توبتكم ، أي يقبلها فيتجاوز عن ذنوبكم ويريد التخفيف عنكم . قيل : هذا في جميع أحكام الشرع ، وهو الصحيح . وقيل : المراد بالتخفيف نكاح الأمة ، أي لما علمنا ضعفكم عن الصبر عن النساء خففنا عنكم بإباحة الإماء ؛ قاله مجاهد وابن زيد وطاوس . قال طاوس : ليس يكون الإنسان في شيء أضعف منه في أمر النساء . واختلف في تعيين المتبعين للشهوات ؛ فقال مجاهد : هم الزناة . السدي : هم اليهود والنصارى . وقالت فرقة : هم اليهود خاصة ؛ لأنهم أرادوا أن يتبعهم المسلمون في نكاح الأخوات من الأب . وقال ابن زيد : ذلك على العموم ، وهو الأصح . والميل : العدول عن طريق الاستواء ؛ فمن كان عليها أحب أن يكون أمثاله عليها حتى لا تلحقه معرة .\n                                    ",
        "saadi": "وَٱللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيۡكُمۡ وَيُرِيدُ ٱلَّذِينَ يَتَّبِعُونَ ٱلشَّهَوَٰتِ أَن تَمِيلُواْ مَيۡلًا عَظِيمٗا ٧٢\n                                        \n                                        \n                                        \n                                        وقوله: { وَاللَّهُ يُرِيدُ أَنْ يَتُوبَ عَلَيْكُمْ } أي: توبة تلم شعثكم، وتجمع متفرقكم، وتقرب بعيدكم. { وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ } أي: يميلون معها حيث مالت ويقدمونها على ما فيه رضا محبوبهم، ويعبدون أهواءهم، من أصناف الكفرة والعاصين، المقدمين لأهوائهم على طاعة ربهم، فهؤلاء يريدون { أَنْ تَمِيلُوا مَيْلًا عَظِيمًا } أي: [أن] تنحرفوا عن الصراط المستقيم إلى صراط المغضوب عليهم والضالين. يريدون أن يصرفوكم عن طاعة الرحمن إلى طاعة الشيطان، وعن التزام حدود من السعادة كلها في امتثال أوامره، إلى مَنْ الشقاوةُ كلها في اتباعه. فإذا عرفتم أن الله تعالى يأمركم بما فيه صلاحكم وفلاحكم وسعادتكم، وأن هؤلاء المتبعين لشهواتهم يأمرونكم بما فيه غاية الخسار والشقاء، فاختاروا لأنفسكم أوْلى الداعيين، وتخيّروا أحسن الطريقتين.\n                                    "
      },
      "originalText": "وَٱللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيۡكُمۡ وَيُرِيدُ ٱلَّذِينَ يَتَّبِعُونَ ٱلشَّهَوَٰتِ أَن تَمِيلُواْ مَيۡلًا عَظِيمٗا ٧٢"
    },
    {
      "number": 521,
      "text": "يُرِيدُ اللَّهُ أَنْ يُخَفِّفَ عَنْكُمْ ۚ وَخُلِقَ الْإِنْسَانُ ضَعِيفًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 28,
      "juz": 5,
      "manzil": 1,
      "page": 83,
      "ruku": 66,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يُرِيدُ ٱللَّهُ أَن يُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَٰنُ ضَعِيفٗا ٨٢\n                                    \n                                    \n                                    أي : في شرائعه وأوامره ونواهيه وما يقدره لكم ، ولهذا أباح [ نكاح ] الإماء بشروطه ، كما قال مجاهد وغيره : ( خلق الإنسان ضعيفا ) فناسبه التخفيف; لضعفه في نفسه وضعف عزمه وهمته .\nوقال ابن أبي حاتم : حدثنا محمد بن إسماعيل [ الأحمسي ] حدثنا وكيع ، عن سفيان ، عن ابن طاوس ، عن أبيه : ( خلق الإنسان ضعيفا ) أي : في أمر النساء ، وقال وكيع : يذهب عقله عندهن .\nوقال موسى الكليم عليه الصلاة والسلام لنبينا صلوات الله وسلامه عليه ليلة الإسراء حين مر عليه راجعا من عند سدرة المنتهى ، فقال له : ماذا فرض عليكم ؟ فقال : \" أمرني بخمسين صلاة في كل يوم وليلة \" فقال له : ارجع إلى ربك فاسأله التخفيف; فإن أمتك لا تطيق ذلك ، فإني قد بلوت الناس قبلك على ما هو أقل من ذلك فعجزوا ، وإن أمتك أضعف أسماعا وأبصارا وقلوبا ، فرجع فوضع عشرا ، ثم رجع إلى موسى فلم يزل كذلك حتى بقيت خمسا [ قال الله عز وجل : \" هن خمس وهن خمسون ، الحسنة بعشر أمثالها \" ] الحديث .\n                                    ",
        "qortoby": "يُرِيدُ ٱللَّهُ أَن يُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَٰنُ ضَعِيفٗا ٨٢\n                                    \n                                    \n                                    قوله تعالى : وخلق الإنسان ضعيفا نصب على الحال ؛ والمعنى أن هواه يستميله وشهوته وغضبه يستخفانه ، وهذا أشد الضعف فاحتاج إلى التخفيف . وقال طاوس : ذلك في أمر النساء خاصة . وروي عن ابن عباس أنه قرأ \" وخلق الإنسان ضعيفا \" أي وخلق الله الإنسان ضعيفا ، أي لا يصبر عن النساء . قال ابن المسيب : لقد أتى علي ثمانون سنة وذهبت إحدى عيني وأنا أعشو بالأخرى وصاحبي أعمى أصم - يعني ذكره - وإني أخاف من فتنة النساء . ونحوه عن عبادة بن الصامت رضي الله عنه ، قال عبادة : ألا تروني لا أقوم إلا رفدا ولا آكل إلا ما لوق لي - قال يحيى : يعني لين وسخن - وقد مات صاحبي منذ زمان - قال يحيى : يعني ذكره - وما يسرني أني خلوت بامرأة لا تحل لي ، وأن لي ما تطلع عليه الشمس مخافة أن يأتيني الشيطان فيحركه علي ، إنه لا سمع له ولا بصر .\n                                    ",
        "saadi": "يُرِيدُ ٱللَّهُ أَن يُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَٰنُ ضَعِيفٗا ٨٢\n                                        \n                                        \n                                        \n                                        { يُرِيدُ اللَّهُ أَنْ يُخَفِّفَ عَنْكُمْ } أي: بسهولة ما أمركم به و [ما] نهاكم عنه، ثم مع حصول المشقة في بعض الشرائع أباح لكم ما تقتضيه حاجتكم، كالميتة والدم ونحوهما للمضطر، وكتزوج الأمة للحر بتلك الشروط السابقة. وذلك لرحمته التامة وإحسانه الشامل، وعلمه وحكمته بضعف الإنسان من جميع الوجوه، ضعف البنية، وضعف الإرادة، وضعف العزيمة، وضعف الإيمان، وضعف الصبر، فناسب ذلك أن يخفف الله عنه، ما يضعف عنه وما لا يطيقه إيمانه وصبره وقوته.\n                                    "
      },
      "originalText": "يُرِيدُ ٱللَّهُ أَن يُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَٰنُ ضَعِيفٗا ٨٢"
    },
    {
      "number": 522,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَأْكُلُوا أَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ إِلَّا أَنْ تَكُونَ تِجَارَةً عَنْ تَرَاضٍ مِنْكُمْ ۚ وَلَا تَقْتُلُوا أَنْفُسَكُمْ ۚ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 29,
      "juz": 5,
      "manzil": 1,
      "page": 83,
      "ruku": 66,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُوٓاْ أَمۡوَٰلَكُم بَيۡنَكُم بِٱلۡبَٰطِلِ إِلَّآ أَن تَكُونَ تِجَٰرَةً عَن تَرَاضٖ مِّنكُمۡۚ وَلَا تَقۡتُلُوٓاْ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِيمٗا ٩٢\n                                    \n                                    \n                                    نهى تبارك وتعالى عباده المؤمنين عن أن يأكلوا أموال بعضهم بعضا بالباطل ، أي : بأنواع المكاسب التي هي غير شرعية ، كأنواع الربا والقمار ، وما جرى مجرى ذلك من سائر صنوف الحيل ، وإن ظهرت في غالب الحكم الشرعي مما يعلم الله أن متعاطيها إنما يريد الحيلة على الربا ، حتى قال ابن جرير :\nحدثني ابن المثنى ، حدثنا عبد الوهاب ، حدثنا داود ، عن عكرمة ، عن ابن عباس - في الرجل يشتري من الرجل الثوب فيقول : إن رضيته أخذته وإلا رددته ورددت معه درهما - قال : هو الذي قال الله عز وجل : ( ولا تأكلوا أموالكم بينكم بالباطل )\nوقال ابن أبي حاتم : حدثنا علي بن حرب الموصلي ، حدثنا ابن فضيل ، عن داود الأودي عن عامر ، عن علقمة ، عن عبد الله [ ( ياأيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل ) ] قال : إنها [ كلمة ] محكمة ، ما نسخت ، ولا تنسخ إلى يوم القيامة .\nوقال علي بن أبي طلحة ، عن ابن عباس : لما أنزل الله : ( ياأيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل ) قال المسلمون : إن الله قد نهانا أن نأكل أموالنا بيننا بالباطل ، والطعام هو أفضل الأموال ، فلا يحل لأحد منا أن يأكل عند أحد ، فكيف للناس ! فأنزل الله بعد ذلك : ( ليس على الأعمى حرج ) [ النور : 61 ] الآية ، [ وكذا قال قتادة بن دعامة ] .\nوقوله : ( إلا أن تكون تجارة عن تراض منكم ) قرئ : تجارة بالرفع وبالنصب ، وهو استثناء منقطع ، كأنه يقول : لا تتعاطوا الأسباب المحرمة في اكتساب الأموال ، لكن المتاجر المشروعة التي تكون عن تراض من البائع والمشتري فافعلوها وتسببوا بها في تحصيل الأموال . كما قال [ الله ] تعالى : ( ولا تقتلوا النفس التي حرم الله إلا بالحق ) [ الأنعام : 151 ] ، وكقوله ( لا يذوقون فيها الموت إلا الموتة الأولى ) [ الدخان : 56 ] .\nومن هذه الآية الكريمة احتج الشافعي [ رحمه الله ] على أنه لا يصح البيع إلا بالقبول; لأنه يدل على التراضي نصا ، بخلاف المعاطاة فإنها قد لا تدل على الرضا ولا بد ، وخالف الجمهور في ذلك مالك وأبو حنيفة وأحمد وأصحابهم ، فرأوا أن الأقوال كما تدل على التراضي ، وكذلك الأفعال تدل في بعض المحال قطعا ، فصححوا بيع المعاطاة مطلقا ، ومنهم من قال : يصح في المحقرات ، وفيما يعده الناس بيعا ، وهو احتياط نظر من محققي المذهب ، والله أعلم .\nقال مجاهد : ( إلا أن تكون تجارة عن تراض منكم ) بيعا أو عطاء يعطيه أحد أحدا . ورواه ابن جرير [ ثم ] قال :\nوحدثنا ابن وكيع ، حدثنا أبي ، عن القاسم ، عن سليمان الجعفي ، عن أبيه ، عن ميمون بن مهران قال : قال رسول الله صلى الله عليه وسلم : \" البيع عن تراض والخيار بعد الصفقة ولا يحل لمسلم أن يغش مسلما \" . هذا حديث مرسل .\nومن تمام التراضي إثبات خيار المجلس ، كما ثبت في الصحيحين : أن رسول الله صلى الله عليه وسلم قال : \" البيعان بالخيار ما لم يتفرقا \" وفي لفظ البخاري : \" إذا تبايع الرجلان فكل واحد منهما بالخيار ما لم يتفرقا \" .\nوذهب إلى القول بمقتضى هذا الحديث الشافعي ، وأحمد [ بن حنبل ] وأصحابهما ، وجمهور السلف والخلف . ومن ذلك مشروعية خيار الشرط بعد العقد إلى ثلاثة أيام ، [ كما هو متفق عليه بين العلماء إلى ما هو أزيد من ثلاثة أيام ] بحسب ما يتبين فيه مال البيع ، ولو إلى سنة في القرية ونحوها ، كما هو المشهور عن مالك ، رحمه الله . وصححوا بيع المعاطاة مطلقا ، وهو قول في مذهب الشافعي ، ومنهم من قال : يصح بيع المعاطاة في المحقرات فيما يعده الناس بيعا ، وهو اختيار طائفة من الأصحاب .\nوقوله : ( ولا تقتلوا أنفسكم ) أي : بارتكاب محارم الله وتعاطي معاصيه وأكل أموالكم بينكم بالباطل ( إن الله كان بكم رحيما ) أي : فيما أمركم به ، ونهاكم عنه .\nقال الإمام أحمد : حدثنا حسن بن موسى ، حدثنا ابن لهيعة ، حدثنا يزيد بن أبي حبيب ، عن عمران بن أبي أنس ، عن عبد الرحمن بن جبير ، عن عمرو بن العاص ، رضي الله عنه ، أنه قال لما بعثه النبي صلى الله عليه وسلم عام ذات السلاسل قال : احتلمت في ليلة باردة شديدة البرد فأشفقت إن اغتسلت أن أهلك ، فتيممت ثم صليت بأصحابي صلاة الصبح ، قال : فلما قدمت على رسول الله صلى عليه وسلم ذكرت ذلك له ، فقال : \" يا عمرو صليت بأصحابك وأنت جنب! \" قال : قلت يا رسول الله إني احتلمت في ليلة باردة شديدة البرد ، فأشفقت إن اغتسلت أن أهلك ، فذكرت قول الله [ عز وجل ] ( ولا تقتلوا أنفسكم إن الله كان بكم رحيما ) فتيممت ثم صليت . فضحك رسول الله صلى الله عليه وسلم ولم يقل شيئا .\nوهكذا رواه أبو داود من حديث يحيى بن أيوب ، عن يزيد بن أبي حبيب ، به . ورواه أيضا عن محمد بن أبي سلمة ، عن ابن وهب ، عن ابن لهيعة وعمر بن الحارث ، كلاهما عن يزيد بن أبي حبيب ، عن عمران بن أبي أنس ، عن عبد الرحمن بن جبير المصري ، عن أبي قيس مولى عمرو بن العاص ، عنه ، فذكر نحوه . وهذا ، والله أعلم ، أشبه بالصواب .\nوقال أبو بكر بن مردويه : حدثنا عبد الرحمن بن محمد بن حامد البلخي ، حدثنا محمد بن صالح بن سهل البلخي ، حدثنا عبيد الله بن عمر القواريري ، حدثنا يوسف بن خالد ، حدثنا زياد بن سعد ، عن عكرمة ، عن ابن عباس : أن عمرو بن العاص صلى بالناس وهو جنب ، فلما قدموا على رسول الله صلى الله عليه وسلم ذكروا ذلك له ، فدعاه فسأله عن ذلك ، فقال : يا رسول الله ، خفت أن يقتلني البرد ، وقد قال الله تعالى : ( ولا تقتلوا أنفسكم [ إن الله كان بكم رحيما ] ) قال : فسكت عنه رسول الله صلى الله عليه وسلم .\nثم أورد ابن مردويه عند هذه الآية الكريمة من حديث الأعمش ، عن أبي صالح ، عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم : \" من قتل نفسه بحديدة فحديدته في يده ، يجأ بها بطنه يوم القيامة في نار جهنم خالدا مخلدا فيها أبدا ، ومن قتل نفسه بسم ، فسمه في يده ، يتحساه في نار جهنم خالدا مخلدا فيها أبدا ، ومن تردى من جبل فقتل نفسه ، فهو مترد في نار جهنم خالدا مخلدا فيها أبدا \" .\nوهذا الحديث ثابت في الصحيحين وكذلك رواه أبو الزناد ، عن الأعرج ، عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه ، وعن أبي قلابة ، عن ثابت بن الضحاك ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" من قتل نفسه بشيء عذب به يوم القيامة \" . وقد أخرجه الجماعة في كتبهم من طريق أبي قلابة وفي الصحيحين من حديث الحسن ، عن جندب بن عبد الله البجلي قال : قال رسول الله صلى الله عليه وسلم : \" كان رجل ممن كان قبلكم وكان به جرح ، فأخذ سكينا نحر بها يده ، فما رقأ الدم حتى مات ، قال الله عز وجل : عبدي بادرني بنفسه ، حرمت عليه الجنة \" .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُوٓاْ أَمۡوَٰلَكُم بَيۡنَكُم بِٱلۡبَٰطِلِ إِلَّآ أَن تَكُونَ تِجَٰرَةً عَن تَرَاضٖ مِّنكُمۡۚ وَلَا تَقۡتُلُوٓاْ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِيمٗا ٩٢\n                                    \n                                    \n                                    قوله تعالى : ياأيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم ولا تقتلوا أنفسكم إن الله كان بكم رحيما\nفيه تسع مسائل :\nالأولى : قوله تعالى : بالباطل أي بغير حق . ووجوه ذلك تكثر على ما بيناه ؛ وقد قدمنا معناه في البقرة . ومن أكل المال بالباطل بيع العربان ؛ وهو أن يأخذ منك السلعة أو يكتري منك الدابة ويعطيك درهما فما فوقه ، على أنه إن اشتراها أو ركب الدابة فهو من ثمن السلعة أو كراء الدابة ؛ وإن ترك ابتياع السلعة أو كراء الدابة فما أعطاك فهو لك . فهذا لا يصلح ولا يجوز عند جماعة فقهاء الأمصار من الحجازيين والعراقيين ، لأنه من باب بيع القمار والغرر والمخاطرة ، وأكل المال بالباطل بغير عوض ولا هبة ، وذلك باطل بإجماع . وبيع العربان مفسوخ إذا وقع على هذا الوجه قبل القبض وبعده ، وترد السلعة إن كانت قائمة ، فإن فاتت رد قيمتها يوم قبضها . وقد روي عن قوم منهم ابن سيرين ومجاهد ونافع بن عبد الحارث وزيد بن أسلم أنهم أجازوا بيع العربان على ما وصفنا . وكان زيد بن أسلم يقول : أجازه رسول الله صلى الله عليه وسلم قال أبو عمر : هذا لا يعرف عن النبي صلى الله عليه وسلم من وجه يصح ، وإنما ذكره عبد الرزاق عن الأسلمي عن زيد بن أسلم مرسلا ؛ وهذا ومثله ليس حجة . ويحتمل أن يكون بيع العربان الجائز على ما تأوله مالك والفقهاء معه ؛ وذلك أن يعربنه ثم يحسب عربانه من الثمن إذا اختار تمام البيع . وهذا لا خلاف في جوازه عن مالك وغيره ؛ وفي موطأ مالك عن الثقة عنده عن عمرو بن شعيب عن أبيه عن جده أن رسول الله صلى الله عليه وسلم ( نهى عن بيع العربان ) . قال أبو عمر : قد تكلم الناس في الثقة عنده في هذا الموضع ، وأشبه ما قيل فيه : أنه أخذه عن ابن لهيعة أو عن ابن وهب عن ابن لهيعة ؛ لأن ابن لهيعة سمعه من عمرو بن شعيب ورواه عنه . حدث به عن ابن لهيعة ابن وهب وغيره ، وابن لهيعة أحد العلماء إلا أنه يقال : إنه احترقت كتبه فكان إذا حدث بعد ذلك من حفظه غلط . وما رواه عنه ابن المبارك وابن وهب فهو عند بعضهم صحيح . ومنهم من يضعف حديثه كله . ، وكان عنده علم واسع وكان كثير الحديث ، إلا أن حاله عندهم كما وصفنا .\nالثانية : قوله تعالى : إلا أن تكون تجارة عن تراض منكم هذا استثناء منقطع ، أي ولكن تجارة عن تراض . والتجارة هي البيع والشراء ؛ وهذا مثل قوله تعالى : وأحل الله البيع وحرم الربا على ما تقدم . وقرئ \" تجارة \" ، بالرفع أي إلا أن تقع تجارة ؛ وعليه أنشد سيبويه :\nفدى لبني ذهل بن شيبان ناقتي إذا كان يوم ذو كواكب أشهب\nوتسمى هذه كان التامة ؛ لأنها تمت بفاعلها ولم تحتج إلى مفعول . وقرئ \" تجارة \" بالنصب ؛ فتكون كان ناقصة ؛ لأنها لا تتم بالاسم دون الخبر ، فاسمها مضمر فيها ، وإن شئت قدرته ، أي إلا أن تكون الأموال أموال تجارة ؛ فحذف المضاف وأقيم المضاف إليه مقامه ، وقد تقدم هذا ؛ ومنه قوله تعالى : وإن كان ذو عسرة .\nالثالثة : قوله تعالى : تجارة التجارة في اللغة عبارة عن المعاوضة ؛ ومنه الأجر الذي يعطيه البارئ سبحانه العبد عوضا عن الأعمال الصالحة التي هي بعض من فعله ؛ قال الله تعالى : يا أيها الذين آمنوا هل أدلكم على تجارة تنجيكم من عذاب أليم . وقال تعالى : يرجون تجارة لن تبور . وقال تعالى : إن الله اشترى من المؤمنين أنفسهم وأموالهم الآية . فسمى ذلك كله بيعا وشراء على وجه المجاز ، تشبيها بعقود الأشربة والبياعات التي تحصل بها الأغراض ، وهي نوعان : تقلب في الحضر من غير نقلة ولا سفر ، وهذا تربص واحتكار قد رغب عنه أولو الأقدار ، وزهد فيه ذوو الأخطار . والثاني تقلب المال بالأسفار ونقله إلى الأمصار ، فهذا أليق بأهل المروءة ، وأعم جدوى ومنفعة ، غير أنه أكثر خطرا وأعظم غررا . وقد روي عن النبي صلى الله عليه وسلم أنه قال : إن المسافر وماله لعلى قلت إلا ما وقى الله . يعني على خطر . وقيل : في التوراة يا ابن آدم ، أحدث سفرا أحدث لك رزقا . الطبري : وهذه الآية أدل دليل على فساد قول : . . . . .\nالرابعة : اعلم أن كل معاوضة تجارة على أي وجه كان العوض إلا أن قوله بالباطل أخرج منها كل عوض لا يجوز شرعا من ربا أو جهالة أو تقدير عوض فاسد كالخمر والخنزير وغير ذلك . وخرج منها أيضا كل عقد جائز لا عوض فيه ؛ كالقرض والصدقة والهبة لا للثواب . وجازت عقود التبرعات بأدلة أخرى مذكورة في مواضعها . فهذان طرفان متفق عليهما . وخرج منها أيضا دعاء أخيك إياك إلى طعامه . روى أبو داود عن ابن عباس في قوله تعالى : لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم فكان الرجل يحرج أن يأكل عند أحد من الناس بعد ما نزلت هذه الآية ؛ فنسخ ذلك بالآية الأخرى التي في \" النور \" ؛ فقال : ليس على الأعمى حرج ولا على الأعرج حرج ولا على المريض حرج ولا على أنفسكم أن تأكلوا من بيوتكم إلى قوله أشتاتا ؛ فكان الرجل الغني يدعو الرجل من أهله إلى طعامه فيقول : إني لأجنح أن آكل منه - والتجنح الحرج ويقول : المسكين أحق به مني . فأحل في ذلك أن يأكلوا مما ذكر اسم الله عليه ، وأحل طعام أهل الكتاب .\nالخامسة : لو اشتريت من السوق شيئا ؛ فقال لك صاحبه قبل الشراء : ذقه وأنت في حل ؛ فلا تأكل منه ؛ لأن إذنه بالأكل لأجل الشراء ؛ فربما لا يقع بينكما شراء فيكون ذلك شبهة ، ولكن لو وصف لك صفة فاشتريته فلم تجده على تلك الصفة فأنت بالخيار .\nالسادسة : والجمهور على جواز الغبن في التجارة ؛ مثل أن يبيع رجل ياقوتة به بدرهم وهي تساوي مائة فذلك جائز ، وأن المالك الصحيح الملك جائز له أن يبيع ماله الكثير بالتافه اليسير ، وهذا ما لا اختلاف فيه بين العلماء إذا عرف قدر ذلك ، كما تجوز الهبة لو وهب . واختلفوا فيه إذا لم يعرف قدر ذلك ؛ فقال قوم : عرف قدر ذلك أو لم يعرف فهو جائز إذا كان رشيدا حرا بالغا . وقالت فرقة : الغبن إذا تجاوز الثلث مردود ، وإنما أبيح منه المتقارب المتعارف في التجارات ، وأما المتفاحش الفادح فلا ؛ وقاله ابن وهب من أصحاب مالك رحمه الله . والأول أصح ؛ لقوله عليه السلام في حديث الأمة الزانية . فليبعها ولو بضفير وقوله عليه السلام لعمر : لا تبتعه يعني الفرس - ولو أعطاكه بدرهم واحد وقوله عليه السلام : دعوا الناس يرزق الله بعضهم من بعض وقوله عليه السلام : لا يبع حاضر لباد وليس فيها تفصيل بين القليل والكثير من ثلث ولا غيره .\nالسابعة : قوله تعالى : عن تراض منكم أي عن رضا ، إلا أنها جاءت من المفاعلة إذ التجارة من اثنين . واختلف العلماء في التراضي ؛ فقالت طائفة : تمامه وجزمه بافتراق الأبدان بعد عقدة البيع ، أو بأن يقول أحدهما لصاحبه : اختر ؛ فيقول : قد اخترت ، وذلك بعد العقدة أيضا فينجزم أيضا وإن لم يتفرقا ؛ قاله جماعة من الصحابة والتابعين ، وبه قال الشافعي والثوري والأوزاعي والليث وابن عيينة وإسحاق وغيرهم . قال الأوزاعي : هما بالخيار ما لم يتفرقا ؛ إلا بيوعا ثلاثة : بيع السلطان المغانم ، والشركة في الميراث ، والشركة في التجارة ؛ فإذا صافقه في هذه الثلاثة فقد وجب البيع وليسا فيه بالخيار . وقال : وحد التفرقة أن يتوارى كل واحد منهما عن صاحبه ؛ وهو قول أهل الشام . وقال الليث : التفرق أن يقوم أحدهما . وكان أحمد بن حنبل يقول : هما بالخيار أبدا ما لم يتفرقا بأبدانهما ، وسواء قالا : اخترنا أو لم يقولاه حتى يفترقا بأبدانهما من مكانهما ؛ وقاله الشافعي أيضا . وهو الصحيح في هذا الباب للأحاديث الواردة في ذلك . وهو مروي عن ابن عمر وأبي برزة وجماعة من العلماء . وقال مالك وأبو حنيفة : تمام البيع هو أن يعقد البيع بالألسنة فينجزم العقد بذلك ويرتفع الخيار . قال محمد بن الحسن : معنى قوله في الحديث البيعان بالخيار ما لم يتفرقا أن البائع إذا قال : قد بعتك ، فله أن يرجع ما لم يقل المشتري قد قبلت . وهو قول أبي حنيفة ، ونص مذهب مالك أيضا ، حكاه ابن خويز منداد . وقيل : ليس له أن يرجع . وقد مضى في \" البقرة \" . واحتج الأولون بما ثبت من حديث سمرة بن جندب وأبي برزة وابن عمر وعبد الله بن عمرو بن العاص وأبي هريرة وحكيم بن حزام وغيرهم عن النبي صلى الله عليه وسلم البيعان بالخيار ما لم يتفرقا أو يقول أحدهما لصاحبه اختر . رواه أيوب عن نافع عن ابن عمر ؛ فقوله عليه السلام في هذه الرواية : أو يقول أحدهما لصاحبه اختر هو معنى الرواية الأخرى إلا بيع الخيار وقوله : إلا أن يكون بيعهما عن خيار ونحوه . أي يقول أحدهما بعد تمام البيع لصاحبه : اختر إنفاذ البيع أو فسخه ؛ فإن اختار إمضاء البيع تم البيع بينهم وإن لم يتفرقا . وكان ابن عمر وهو راوي الحديث إذا بايع أحدا وأحب أن ينفذ البيع مشى قليلا ثم رجع . وفي الأصول : إن من روى حديثا فهو أعلم بتأويله ، لا سيما الصحابة إذ هم أعلم بالمقال وأقعد بالحال . وروى أبو داود والدارقطني عن أبي الوضيء قال : كنا في سفر في عسكر فأتى رجل معه فرس فقال له رجل منا : أتبيع هذا الفرس بهذا الغلام ؟ قال : نعم ؛ فباعه ثم بات معنا ، فلما أصبح قام إلى فرسه ، فقال له صاحبنا : ما لك والفرس ! أليس قد بعتنيها ؟ فقال : ما لي في هذا البيع من حاجة . فقال : ما لك ذلك ، لقد بعتني . فقال لهما القوم : هذا أبو برزة صاحب رسول الله صلى الله عليه وسلم فأتياه ؛ فقال لهما : أترضيان بقضاء رسول الله صلى الله عليه وسلم ؟ فقالا : نعم . فقال : قال رسول الله صلى الله عليه وسلم : البيعان بالخيار ما لم يتفرقا وإني لا أراكما افترقتما . فهذان صحابيان قد علما مخرج الحديث وعملا بمقتضاه ، بل هذا كان عمل الصحابة . قال سالم : قال ابن عمر : كنا إذا تبايعنا كان كل واحد منا بالخيار ما لم يتفرق المتبايعان . قال : فتبايعت أنا وعثمان فبعته مالي بالوادي بمال له بخيبر ؛ قال : فلما بعته طفقت أنكص القهقرى ، خشية أن يرادني عثمان البيع قبل أن أفارقه . أخرجه الدارقطني ثم قال : إن أهل اللغة فرقوا بين فرقت مخففا وفرقت مثقلا ؛ فجعلوه بالتخفيف في الكلام وبالتثقيل في الأبدان . قال أحمد بن يحيى ثعلب : أخبرني ابن الأعرابي عن المفضل قال : يقال فرقت بين الكلامين مخففا فافترقا وفرقت بين اثنين مشددا فتفرقا ؛ فجعل الافتراق في القول ، والتفرق في الأبدان . احتجت المالكية بما تقدم بيانه في آية الدين ، وبقوله تعالى : أوفوا بالعقود وهذان قد تعاقدا . وفي هذا الحديث إبطال الوفاء بالعقود . قالوا : وقد يكون التفرق بالقول كعقد النكاح ووقوع الطلاق الذي قد سماه الله فراقا ؛ قال الله تعالى : وإن يتفرقا يغن الله كلا من سعته وقال تعالى : ولا تكونوا كالذين تفرقوا وقال عليه السلام : تفترق أمتي ولم يقل بأبدانها . وقد روى الدارقطني وغيره عن عمرو بن شعيب قال : سمعت شعيبا يقول : سمعت عبد الله بن عمرو يقول : سمعت النبي صلى الله عليه وسلم يقول : أيما رجل ابتاع من رجل بيعة فإن كل واحد منهما بالخيار حتى يتفرقا من مكانهما إلا أن تكون صفقة خيار فلا يحل لأحدهما أن يفارق صاحبه مخافة أن يقيله . قالوا : فهذا يدل على أنه قد تم البيع بينهما قبل الافتراق ؛ لأن الإقالة لا تصح إلا فيما قد تم من البيوع . قالوا : ومعنى قوله المتبايعان بالخيار أي المتساومان بالخيار ما لم يعقدا فإذا عقدا بطل الخيار فيه . والجواب : أما ما اعتلوا به من الافتراق بالكلام فإنما المراد بذلك الأديان كما بيناه في \" آل عمران \" ، وإن كان صحيحا في بعض المواضع فهو في هذا الموضع غير صحيح . وبيانه أن يقال : خبرونا عن الكلام الذي وقع به الاجتماع وتم به البيع ، أهو الكلام الذي أريد به الافتراق أم غيره ؟ فإن قالوا : هو غيره فقد أحالوا وجاءوا بما لا يعقل ؛ لأنه ليس ثم كلام غير ذلك . وإن قالوا : هو ذلك الكلام بعينه قيل لهم : كيف يجوز أن يكون الكلام الذي به اجتمعا وتم به بيعهما ، به افترقا ، هذا عين المحال والفاسد من القول . وأما قوله : ولا يحل له أن يفارق صاحبه مخافة أن يقيله فمعناه - إن صح - على الندب ؛ بدليل قوله عليه السلام . من أقال مسلما أقاله الله عثرته وبإجماع المسلمين على أن ذلك يحل لفاعله على خلاف ظاهر الحديث ، ولإجماعهم أنه جائز له أن يفارقه لينفذ بيعه ولا يقيله إلا أن يشاء . وفيما أجمعوا عليه من ذلك رد لرواية من روى ( لا يحل ) فإن لم يكن وجه هذا الخبر الندب ، وإلا فهو باطل بالإجماع . وأما تأويل \" المتبايعان \" بالمتساومين فعدول عن ظاهر اللفظ ، وإنما معناه المتبايعان بعد عقدهما مخيران ما داما في مجلسهما ، إلا بيعا يقول أحدهما لصاحبه فيه : اختر فيختار ؛ فإن الخيار ينقطع بينهما وإن لم يتفرقا ؛ فإن فرض خيار فالمعنى : إلا بيع الخيار فإنه يبقى الخيار بعد التفرد بالأبدان . وتتميم هذا الباب في كتب الخلاف . وفي قول عمرو بن شعيب \" سمعت أبي يقول \" دليل على صحة حديثه ؛ فإن الدارقطني قال حدثنا أبو بكر النيسابوري حدثنا محمد بن علي الوراق قال : قلت لأحمد بن حنبل : شعيب سمع من أبيه شيئا ؟ قال : يقول حدثني أبي . قال : فقلت : فأبوه سمع من عبد الله بن عمرو ؟ قال : نعم ، أراه قد سمع منه . قال الدارقطني سمعت أبا بكر النيسابوري يقول : هو عمرو بن شعيب بن محمد بن عبد الله بن عمرو بن العاص ، وقد صح سماع عمرو بن شعيب من أبيه شعيب وسماع شعيب من جده عبد الله بن عمرو .\nالثامنة : روى الدارقطني عن ابن عمر قال : قال رسول الله صلى الله عليه وسلم : التاجر الصدوق الأمين المسلم مع النبيين والصديقين والشهداء يوم القيامة . ويكره للتاجر أن يحلف لأجل ترويج السلعة وتزيينها ، أو يصلي على النبي صلى الله عليه وسلم في عرض سلعته ؛ وهو أن يقول : صلى الله على محمد ! ما أجود هذا . ويستحب للتاجر ألا تشغله تجارته عن أداء الفرائض ؛ فإذا جاء وقت الصلاة ينبغي أن يترك تجارته حتى يكون من أهل هذه الآية : رجال لا تلهيهم تجارة ولا بيع عن ذكر الله وسيأتي .\nالتاسعة : وفي هذه الآية مع الأحاديث التي ذكرناها ما يرد قول من ينكر طلب الأقوات بالتجارات والصناعات من المتصوفة الجهلة ؛ لأن الله تعالى حرم أكلها بالباطل وأحلها بالتجارة ، وهذا بين .\nقوله تعالى : ولا تقتلوا أنفسكم فيه مسألة واحدة - قرأ الحسن \" تقتلوا \" على التكثير . وأجمع أهل التأويل على أن المراد بهذه الآية النهي أن يقتل بعض الناس بعضا . ثم لفظها يتناول أن يقتل الرجل نفسه بقصد منه للقتل في الحرص على الدنيا وطلب المال بأن يحمل نفسه على الغرر المؤدي إلى التلف . ويحتمل أن يقال : ولا تقتلوا أنفسكم في حال ضجر أو غضب ؛ فهذا كله يتناوله النهي . وقد احتج عمرو بن العاص بهذه الآية حين امتنع من الاغتسال بالماء البارد حين أجنب في غزوة ذات السلاسل خوفا على نفسه منه ؛ فقرر النبي صلى الله عليه وسلم احتجاجه وضحك عنده ولم يقل شيئا . خرجه أبو داود وغيره ، وسيأتي .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُوٓاْ أَمۡوَٰلَكُم بَيۡنَكُم بِٱلۡبَٰطِلِ إِلَّآ أَن تَكُونَ تِجَٰرَةً عَن تَرَاضٖ مِّنكُمۡۚ وَلَا تَقۡتُلُوٓاْ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِيمٗا ٩٢\n                                        \n                                        \n                                        \n                                        ينهى تعالى عباده المؤمنين أن يأكلوا أموالهم بينهم بالباطل، وهذا يشمل أكلها بالغصوب والسرقات، وأخذها بالقمار والمكاسب الرديئة. بل لعله يدخل في ذلك أكل مال نفسك على وجه البطر والإسراف، لأن هذا من الباطل وليس من الحق. ثم إنه -لما حرم أكلها بالباطل- أباح لهم أكلها بالتجارات والمكاسب الخالية من الموانع، المشتملة على الشروط من التراضي وغيره. { وَلَا تَقْتُلُوا أَنْفُسَكُمْ } أي: لا يقتل بعضكم بعضًا، ولا يقتل الإنسان نفسه. ويدخل في ذلك الإلقاءُ بالنفس إلى التهلكة، وفعلُ الأخطار المفضية إلى التلف والهلاك { إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا } ومن رحمته أن صان نفوسكم وأموالكم، ونهاكم عن إضاعتها وإتلافها، ورتب على ذلك ما رتبه من الحدود. وتأمل هذا الإيجاز والجمع في قوله: { لَا تَأْكُلُوا أَمْوَالَكُمْ } { وَلَا تَقْتُلُوا أَنْفُسَكُمْ } كيف شمل أموال غيرك ومال نفسك وقتل نفسك وقتل غيرك بعبارة أخصر من قوله: \"لا يأكل بعضكم مال بعض\" و \"لا يقتل بعضكم بعضًا\" مع قصور هذه العبارة على مال الغير ونفس الغير فقط. مع أن إضافة الأموال والأنفس إلى عموم المؤمنين فيه دلالة على أن المؤمنين في توادهم وتراحمهم وتعاطفهم ومصالحهم كالجسد الواحد، حيث كان الإيمان يجمعهم على مصالحهم الدينية والدنيوية. ولما نهى عن أكل الأموال بالباطل التي فيها غاية الضرر عليهم، على الآكل، ومن أخذ ماله، أباح لهم ما فيه مصلحتهم من أنواع المكاسب والتجارات، وأنواع الحرف والإجارات، فقال: { إِلَّا أَنْ تَكُونَ تِجَارَةً عَنْ تَرَاضٍ مِنْكُمْ } أي: فإنها مباحة لكم. وشرط التراضي -مع كونها تجارة- لدلالة أنه يشترط أن يكون العقد غير عقد ربا لأن الربا ليس من التجارة، بل مخالف لمقصودها، وأنه لا بد أن يرضى كل من المتعاقدين ويأتي به اختيارًا. ومن تمام الرضا أن يكون المعقود عليه معلوما، لأنه إذا لم يكن كذلك لا يتصور الرضا مقدورًا على تسليمه، لأن غير المقدور عليه شبيه ببيع القمار، فبيع الغرر بجميع أنواعه خال من الرضا فلا ينفذ عقده. وفيها أنه تنعقد العقود بما دل عليها من قول أو فعل، لأن الله شرط الرضا فبأي طريق حصل الرضا انعقد به العقد. ثم ختم الآية بقوله: { إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا } ومن رحمته أن عصم دماءكم وأموالكم وصانها ونهاكم عن انتهاكها.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُوٓاْ أَمۡوَٰلَكُم بَيۡنَكُم بِٱلۡبَٰطِلِ إِلَّآ أَن تَكُونَ تِجَٰرَةً عَن تَرَاضٖ مِّنكُمۡۚ وَلَا تَقۡتُلُوٓاْ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِيمٗا ٩٢"
    },
    {
      "number": 523,
      "text": "وَمَنْ يَفْعَلْ ذَٰلِكَ عُدْوَانًا وَظُلْمًا فَسَوْفَ نُصْلِيهِ نَارًا ۚ وَكَانَ ذَٰلِكَ عَلَى اللَّهِ يَسِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 30,
      "juz": 5,
      "manzil": 1,
      "page": 83,
      "ruku": 66,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَن يَفۡعَلۡ ذَٰلِكَ عُدۡوَٰنٗا وَظُلۡمٗا فَسَوۡفَ نُصۡلِيهِ نَارٗاۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا ٠٣\n                                    \n                                    \n                                    ولهذا قال الله تعالى : ( ومن يفعل ذلك عدوانا وظلما ) أي : ومن يتعاطى ما نهاه الله عنه متعديا فيه ظالما في تعاطيه ، أي : عالما بتحريمه متجاسرا على انتهاكه ( فسوف نصليه نارا [ وكان ذلك على الله يسيرا ] ) وهذا تهديد شديد ووعيد أكيد ، فليحذر منه كل عاقل لبيب ممن ألقى السمع وهو شهيد .\n                                    ",
        "qortoby": "وَمَن يَفۡعَلۡ ذَٰلِكَ عُدۡوَٰنٗا وَظُلۡمٗا فَسَوۡفَ نُصۡلِيهِ نَارٗاۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا ٠٣\n                                    \n                                    \n                                    قوله تعالى : ومن يفعل ذلك عدوانا وظلما فسوف نصليه نارا وكان ذلك على الله يسيرا ذلك إشارة إلى القتل ؛ لأنه أقرب مذكور ؛ قاله عطاء . وقيل : هو عائد إلى أكل المال بالباطل وقتل النفس ؛ لأن النهي عنهما جاء متسقا مسرودا ، ثم ورد الوعيد حسب النهي . وقيل : هو عام على كل ما نهى عنه من القضايا ، من أول السورة إلى قوله تعالى : ومن يفعل ذلك . وقال الطبري : ذلك عائد على ما نهى عنه من آخر وعيد ، وذلك قوله تعالى : يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها لأن كل ما نهي عنه من أول السورة قرن به وعيد ، إلا من قوله : يا أيها الذين آمنوا لا يحل لكم فإنه لا وعيد بعده إلا قوله : ومن يفعل ذلك عدوانا . والعدوان تجاوز الحد . والظلم وضع الشيء في غير موضعه ، وقد تقدم . وقيد الوعيد بذكر العدوان والظلم ليخرج منه فعل السهو والغلط ، وذكر العدوان والظلم مع تقارب معانيهما لاختلاف ألفاظهما ، وحسن ذلك في الكلام كما قال عدي بن زيد :\nفقددت الأديم لراهشه وألفى قولها كذبا ومينا\nوحسن العطف لاختلاف اللفظين ؛ يقال : بعدا وسحقا ؛ ومنه قول يعقوب : إنما أشكو بثي وحزني إلى الله . فحسن ذلك لاختلاف اللفظ . ونصليه معناه نمسه حرها . وقد بينا معنى الجمع بين هذه الآي وحديث أبي سعيد الخدري في العصاة وأهل الكبائر لمن أنفذ عليه الوعيد ؛ فلا معنى لإعادة ذلك . وقرأ الأعمش والنخعي \" نصليه \" بفتح النون ، على أنه منقول من صلى نارا ، أي أصليته ؛ وفي الخبر \" شاة مصلية \" . ومن ضم النون منقول بالهمزة ، مثل طعمت وأطعمت .\n                                    ",
        "saadi": "وَمَن يَفۡعَلۡ ذَٰلِكَ عُدۡوَٰنٗا وَظُلۡمٗا فَسَوۡفَ نُصۡلِيهِ نَارٗاۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا ٠٣\n                                        \n                                        \n                                        \n                                        ثم قال: { وَمَنْ يَفْعَلْ ذَلِكَ } أي: أكل الأموال بالباطل وقتل النفوس { عُدْوَانًا وَظُلْمًا } أي: لا جهلا ونسيانا { فَسَوْفَ نُصْلِيهِ نَارًا } أي: عظيمة كما يفيده التنكير { وَكَانَ ذَلِكَ عَلَى اللَّهِ يَسِيرًا }\n                                    "
      },
      "originalText": "وَمَن يَفۡعَلۡ ذَٰلِكَ عُدۡوَٰنٗا وَظُلۡمٗا فَسَوۡفَ نُصۡلِيهِ نَارٗاۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا ٠٣"
    },
    {
      "number": 524,
      "text": "إِنْ تَجْتَنِبُوا كَبَائِرَ مَا تُنْهَوْنَ عَنْهُ نُكَفِّرْ عَنْكُمْ سَيِّئَاتِكُمْ وَنُدْخِلْكُمْ مُدْخَلًا كَرِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 31,
      "juz": 5,
      "manzil": 1,
      "page": 83,
      "ruku": 66,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن تَجۡتَنِبُواْ كَبَآئِرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَيِّ‍َٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلٗا كَرِيمٗا ١٣\n                                    \n                                    \n                                    وقوله : ( إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم [ وندخلكم مدخلا كريما ] ) . أي : إذا اجتنبتم كبائر الآثام التي نهيتم عنها كفرنا عنكم صغائر الذنوب وأدخلناكم الجنة; ولهذا قال : ( وندخلكم مدخلا كريما ) .\nوقال الحافظ أبو بكر البزار : حدثنا مؤمل بن هشام ، حدثنا إسماعيل بن إبراهيم ، حدثنا خالد بن أيوب ، عن معاوية بن قرة ، عن أنس [ يرفعه ] : \" الذي بلغنا عن ربنا ، عز وجل ، ثم لم نخرج له عن كل أهل ومال أن تجاوز لنا عما دون الكبائر ، يقول الله [ تعالى ] ( إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم [ وندخلكم مدخلا كريما ] ) \" .\nوقد وردت أحاديث متعلقة بهذه الآية الكريمة فلنذكر منها ما تيسر :\nقال الإمام أحمد : حدثنا هشيم عن مغيرة ، عن أبي معشر ، عن إبراهيم ، عن قرثع الضبي ، عن سلمان الفارسي قال : قال لي النبي صلى الله عليه وسلم : \" أتدري ما يوم الجمعة ؟ \" قلت : هو اليوم الذي جمع الله فيه أباكم . قال : \" لكن أدري ما يوم الجمعة ، لا يتطهر الرجل فيحسن طهوره ، ثم يأتي الجمعة فينصت حتى يقضي الإمام صلاته ، إلا كان كفارة له ما بينه وبين الجمعة المقبلة ، ما اجتنبت المقتلة وقد روى البخاري من وجه آخر عن سلمان نحوه .\nوقال أبو جعفر بن جرير : حدثني المثنى [ بن إبراهيم ] حدثنا أبو صالح ، حدثنا الليث ، حدثني خالد ، عن سعيد بن أبي هلال ، عن نعيم المجمر ، أخبرني صهيب مولى العتواري ، أنه سمع من أبي هريرة وأبي سعيد يقولان : خطبنا رسول الله صلى الله عليه وسلم يوما فقال : \" والذي نفسي بيده \" - ثلاث مرات - ثم أكب ، فأكب كل رجل منا يبكي ، لا ندري على ماذا حلف عليه ثم رفع رأسه وفي وجهه البشر فكان أحب إلينا من حمر النعم ، فقال [ صلى الله عليه وسلم ] ما من عبد يصلي الصلوات الخمس ، ويصوم رمضان ، ويخرج الزكاة ، ويجتنب الكبائر السبع ، إلا فتحت له أبواب الجنة ، ثم قيل له : ادخل بسلام \" .\nوهكذا رواه النسائي ، والحاكم في مستدركه ، من حديث الليث بن سعد ، رواه الحاكم أيضا وابن حبان في صحيحه ، من حديث عبد الله بن وهب ، عن عمرو بن الحارث ، عن سعيد بن أبي هلال ، به . ثم قال الحاكم : صحيح على شرط الشيخين ، ولم يخرجاه .\nتفسير هذه السبع :\nوذلك بما ثبت في الصحيحين من حديث سليمان بن بلال ، عن ثور بن زيد ، عن سالم أبي الغيث ، عن أبي هريرة ; أن رسول الله صلى الله عليه وسلم قال : \" اجتنبوا السبع الموبقات \" قيل : يا رسول الله ، وما هن ؟ قال : \" الشرك بالله ، وقتل النفس التي حرم الله إلا بالحق ، والسحر ، وأكل الربا ، وأكل مال اليتيم ، والتولي يوم الزحف ، وقذف المحصنات المؤمنات الغافلات \" .\nطريق أخرى عنه : قال ابن أبي حاتم : حدثنا أبي ، حدثنا فهد بن عوف ، حدثنا أبو عوانة ، عن عمرو بن أبي سلمة ، عن أبيه ، عن أبي هريرة ; أن رسول الله صلى الله عليه وسلم قال : \" الكبائر سبع ، أولها الإشراك بالله ، ثم قتل النفس بغير حقها ، وأكل الربا ، وأكل مال اليتيم إلى أن يكبر ، والفرار من الزحف ، ورمي المحصنات ، والانقلاب إلى الأعراب بعد الهجرة \" .\nفالنص على هذه السبع بأنهن كبائر لا ينفي ما عداهن ، إلا عند من يقول بمفهوم اللقب ، وهو ضعيف عند عدم القرينة ، ولا سيما عند قيام الدليل بالمنطوق على عدم المفهوم ، كما سنورده من الأحاديث المتضمنة من الكبائر غير هذه السبع ، فمن ذلك ما رواه الحاكم في مستدركه حيث قال :\nحدثنا أحمد بن كامل القاضي ، إملاء حدثنا أبو قلابة عبد الملك بن محمد ، حدثنا معاذ بن هانئ ، حدثنا حرب بن شداد ، حدثنا يحيى بن أبي كثير ، عن عبد الحميد بن سنان ، عن عبيد بن عمير ، عن أبيه - يعني عمير بن قتادة - رضي الله عنه أنه حدثه - وكانت له صحبة - أن رسول الله صلى الله عليه وسلم قال في حجة الوداع : \" ألا إن أولياء الله المصلون من يقيم الصلوات الخمس التي كتبت عليه ، ويصوم رمضان ويحتسب صومه ، يرى أنه عليه حق ، ويعطي زكاة ماله يحتسبها ، ويجتنب الكبائر التي نهى الله عنها \" . ثم إن رجلا سأله فقال : يا رسول الله ، ما الكبائر ؟ فقال : \" تسع : الشرك بالله ، وقتل نفس مؤمن بغير حق وفرار يوم الزحف ، وأكل مال اليتيم ، وأكل الربا ، وقذف المحصنة وعقوق الوالدين المسلمين ، واستحلال البيت الحرام قبلتكم أحياء وأمواتا ، ثم قال : لا يموت رجل لا يعمل هؤلاء الكبائر ، ويقيم الصلاة ، ويؤتي الزكاة ، إلا كان مع النبي صلى الله عليه وسلم في دار أبوابها مصاريع من ذهب \" .\nوهكذا رواه الحاكم مطولا وقد أخرجه أبو داود والترمذي مختصرا من حديث معاذ بن هانئ ، به وكذا رواه ابن أبي حاتم من حديثه مبسوطا ثم قال الحاكم : رجاله كلهم يحتج بهم في الصحيحين إلا عبد الحميد بن سنان .\nقلت : وهو حجازي لا يعرف إلا بهذا الحديث ، وقد ذكره ابن حبان في كتاب الثقات ، وقال البخاري : في حديثه نظر .\nوقد رواه ابن جرير ، عن سليمان بن ثابت الجحدري ، عن سلم بن سلام ، عن أيوب بن عتبة ، عن يحيى بن أبي كثير ، عن عبيد بن عمير ، عن أبيه ، فذكره . ولم يذكر في الإسناد : عبد الحميد بن سنان ، فالله أعلم .\nحديث آخر في معنى ما تقدم : قال ابن مردويه : حدثنا عبد الله بن جعفر ، حدثنا أحمد بن يونس ، حدثنا يحيى بن عبد الحميد ، حدثنا عبد العزيز بن مسلم بن الوليد ، عن المطلب عن عبد الله بن حنطب عن عبد الله بن عمرو قال : صعد النبي صلى الله عليه وسلم المنبر فقال : \" لا أقسم ، لا أقسم \" . ثم نزل فقال : \" أبشروا ، أبشروا ، من صلى الصلوات الخمس ، واجتنب الكبائر السبع ، نودي من أبواب الجنة : ادخل \" . قال عبد العزيز : لا أعلمه إلا قال : \" بسلام \" . قال المطلب : سمعت من سأل عبد الله بن عمرو : أسمعت رسول الله صلى الله عليه وسلم يذكرهن ؟ قال : نعم : \" عقوق الوالدين ، وإشراك بالله ، وقتل النفس ، وقذف المحصنات ، وأكل مال اليتيم ، والفرار من الزحف ، وأكل الربا \" .\nحديث آخر في معناه : قال أبو جعفر بن جرير في التفسير : حدثنا يعقوب ، حدثنا ابن علية ، أخبرنا زياد بن مخراق عن طيسلة بن مياس قال : كنت مع النجدات ، فأصبت ذنوبا لا أراها إلا من الكبائر ، فلقيت ابن عمر فقلت له : إني أصبت ذنوبا لا أراها إلا من الكبائر قال : ما هي ؟ قلت : أصبت كذا وكذا . قال : ليس من الكبائر . قلت : وأصبت كذا وكذا . قال : ليس من الكبائر قال - بشيء لم يسمه طيسلة - قال : هي تسع وسأعدهن عليك : الإشراك بالله ، وقتل النفس بغير حقها والفرار من الزحف ، وقذف المحصنة ، وأكل الربا ، وأكل مال اليتيم ظلما ، وإلحاد في المسجد الحرام ، والذي يستسحر وبكاء الوالدين من العقوق . قال زياد : وقال طيسلة لما رأى ابن عمر : فرقي . قال : أتخاف النار أن تدخلها ؟ قلت : نعم . قال : وتحب أن تدخل الجنة ؟ قلت : نعم . قال : أحي والداك ؟ قلت : عندي أمي . قال : فوالله لئن أنت ألنت لها الكلام ، وأطعمتها الطعام ، لتدخلن الجنة ما اجتنبت الموجبات .\nطريق أخرى : قال ابن جرير : حدثنا سليمان بن ثابت الجحدري الواسطي ، حدثنا سلم بن سلام ، حدثنا أيوب بن عتبة ، عن طيسلة بن علي النهدي قال : أتيت ابن عمر وهو في ظل أراك يوم عرفة ، وهو يصب الماء على رأسه ووجهه قلت أخبرني عن الكبائر ؟ قال : هي تسع . قلت : ما هي ؟ قال : الإشراك بالله ، وقذف المحصنة - قال : قلت : قبل القتل ؟ قال : نعم ورغما - وقتل النفس المؤمنة ، والفرار من الزحف ، والسحر ، وأكل الربا ، وأكل مال اليتيم ، وعقوق الوالدين المسلمين ، وإلحاد بالبيت الحرام ، قبلتكم أحياء وأمواتا .\nهكذا رواه من هذين الطريقين موقوفا ، وقد رواه علي بن الجعد ، عن أيوب بن عتبة ، عن طيسلة بن علي [ النهدي ] قال : أتيت ابن عمر عشية عرفة ، وهو تحت ظل أراكة ، وهو يصب الماء على رأسه ، فسألته عن الكبائر ، فقال : سمعت رسول الله صلى الله عليه وسلم يقول : \" هن سبع \" . قال : قلت : وما هن ؟ قال : \" الإشراك بالله ، وقذف المحصنة - قال : قلت : قبل الدم ؟ قال : نعم ورغما - وقتل النفس المؤمنة ، والفرار من الزحف ، والسحر ، وأكل الربا ، وأكل مال اليتيم ، وعقوق الوالدين ، وإلحاد بالبيت الحرام قبلتكم أحياء وأمواتا \" .\nوكذا رواه الحسن بن موسى الأشيب ، عن أيوب بن عتبة اليماني - وفيه ضعف - والله أعلم .\nحديث آخر : قال الإمام أحمد : حدثنا زكريا بن عدي ، حدثنا بقية ، عن بحير بن سعد عن خالد بن معدان : أن أبا رهم السمعي حدثهم ، عن أبي أيوب قال : قال رسول الله صلى الله عليه وسلم : \" من عبد الله لا يشرك به شيئا ، وأقام الصلاة ، وآتى الزكاة ، وصام رمضان ، واجتنب الكبائر ، فله الجنة - أو دخل الجنة \" فسأله رجل : ما الكبائر ؟ فقال الشرك بالله ، وقتل نفس مسلمة ، والفرار يوم الزحف \" .\nورواه أحمد أيضا والنسائي ، من غير وجه ، عن بقية .\nحديث آخر : روى الحافظ أبو بكر بن مردويه في تفسيره ، من طريق سليمان بن داود اليماني - وهو ضعيف - عن الزهري ، عن أبي بكر بن محمد بن عمرو بن حزم ، عن أبيه ، عن جده قال : كتب رسول الله صلى الله عليه وسلم إلى أهل اليمن كتابا فيه الفرائض والسنن والديات ، وبعث به مع عمرو بن حزم ، قال : وكان في الكتاب : \" إن أكبر الكبائر عند الله يوم القيامة : إشراك بالله وقتل النفس المؤمنة بغير حق ، والفرار في سبيل الله يوم الزحف ، وعقوق الوالدين ، ورمي المحصنة ، وتعلم السحر ، وأكل الربا ، وأكل مال اليتيم \" .\nحديث آخر : فيه ذكر شهادة الزور; قال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، حدثني عبيد الله بن أبي بكر قال : سمعت أنس بن مالك قال : ذكر رسول الله صلى الله عليه وسلم الكبائر - أو سئل عن الكبائر - فقال : \" الشرك بالله ، وقتل النفس ، وعقوق الوالدين \" . وقال : \" ألا أنبئكم بأكبر الكبائر ؟ \" قال : \" قول الزور - أو شهادة الزور \" . قال شعبة : أكبر ظني أنه قال \" \" شهادة الزور \" .\nأخرجاه من حديث شعبة به . وقد رواه ابن مردويه من طريقين آخرين غريبين عن أنس ، بنحوه .\nحديث آخر : أخرجه الشيخان من حديث عبد الرحمن بن أبي بكرة ، عن أبيه قال : قال النبي صلى الله عليه وسلم : \" ألا أنبئكم بأكبر الكبائر ؟ \" ، قلنا : بلى يا رسول الله ، قال : \" الإشراك بالله ، وعقوق الوالدين \" وكان متكئا فجلس فقال : \" ألا وشهادة الزور ، ألا وقول الزور \" . فما زال يكررها حتى قلنا : ليته سكت .\nحديث آخر : فيه ذكر قتل الولد ، وهو ثابت في الصحيحين ، عن عبد الله بن مسعود قال : قلت : يا رسول الله ، أي الذنب أعظم ؟ - وفي رواية : أكبر - قال : \" أن تجعل لله ندا وهو خلقك \" قلت : ثم أي ؟ قال : \" أن تقتل ولدك خشية أن يطعم معك \" . قلت : ثم أي ؟ قال : \" أن تزاني حليلة جارك \" ثم قرأ : ( والذين لا يدعون مع الله إلها آخر [ ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما ] ) إلى قوله : ( إلا من تاب ) [ الفرقان : 68 ] .\nحديث ] آخر [ فيه ذكر شرب الخمر . قال ابن أبي حاتم : أخبرنا يونس بن عبد الأعلى ، أخبرنا ابن وهب ، حدثني أبو صخر : أن رجلا حدثه عن عمرة بن حزم أنه سمع عبد الله بن عمرو بن العاص وهو بالحجر بمكة وسئل عن الخمر ، فقال : والله إن عظيما عند الله الشيخ مثلي يكذب في هذا المقام على رسول الله صلى الله عليه وسلم ، فذهب فسأله ثم رجع فقال : سألته عن الخمر فقال : \" هي أكبر الكبائر ، وأم الفواحش ، من شرب الخمر ترك الصلاة ووقع على أمه وخالته وعمته \" غريب من هذا الوجه .\nطريق أخرى : رواها الحافظ أبو بكر بن مردويه من حديث عبد العزيز بن محمد الدراوردي ، عن داود بن صالح ، عن سالم بن عبد الله ، عن أبيه : أن أبا بكر الصديق ، رضي الله عنه ، وعمر بن الخطاب وأناسا من أصحاب رسول الله صلى الله عليه وسلم ، ورضي الله عنهم أجمعين ، جلسوا بعد وفاة رسول الله صلى الله عليه وسلم ، فذكروا أعظم الكبائر ، فلم يكن عندهم ما ينتهون إليه ، فأرسلوني إلى عبد الله بن عمرو بن العاص أسأله عن ذلك ، فأخبرني أن أعظم الكبائر شرب الخمر ، فأتيتهم فأخبرتهم ، فأنكروا ذلك ، فوثبوا إليه حتى أتوه في داره ، فأخبرهم أنهم تحدثوا عند رسول الله صلى الله عليه وسلم أن ملكا من بني إسرائيل أخذ رجلا فخيره بين أن يشرب خمرا أو يقتل نفسا ، أو يزاني أو يأكل لحم خنزير ، أو يقتله فاختار شرب الخمر وإنه لما شربها لم يمتنع من شيء أراده منه ، وإن رسول الله صلى الله عليه وسلم قال لنا مجيبا : \" ما من أحد يشرب خمرا إلا لم تقبل له صلاة أربعين ليلة ، ولا يموت أحد في مثانته منها شيء إلا حرم الله عليه الجنة فإن مات في أربعين ليلة مات ميتة جاهلية \" .\nهذا حديث غريب من هذا الوجه جدا ، وداود بن صالح هو التمار المدني مولى الأنصار ، قال الإمام أحمد : لا أرى به بأسا . وذكره ابن حبان في الثقات ، ولم أر أحدا جرحه .\nحديث آخر : عن عبد الله بن عمرو وفيه ذكر اليمين الغموس . قال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن فراس ، عن الشعبي ، عن عبد الله بن عمرو ، عن النبي صلى الله عليه وسلم أنه قال : \" أكبر الكبائر الإشراك بالله ، وعقوق الوالدين ، أو قتل النفس - شعبة الشاك - واليمين الغموس \" . ورواه البخاري والترمذي والنسائي من حديث شعبة : زاد البخاري وشيبان ، كلاهما عن ، به .\nحديث آخر : في اليمين الغموس : \" قال ابن أبي حاتم : حدثنا أبي ، حدثنا أبو صالح كاتب الليث ، حدثنا الليث بن سعد ، حدثنا هشام بن سعد ، عن محمد بن يزيد بن مهاجر بن قنفذ التيمي ، عن أبي أمامة الأنصاري ، عن عبد الله بن أنيس الجهني ، عن رسول الله صلى الله عليه وسلم قال : أكبر الكبائر الشرك بالله ، وعقوق الوالدين ، واليمين الغموس ، وما حلف حالف بالله يمين صبر فأدخل فيها مثل جناح البعوضة ، إلا كانت وكتة في قلبه إلى يوم القيامة \" . وهكذا رواه ] الإمام [ أحمد في مسنده ، وعبد بن حميد في تفسيره ، كلاهما عن يونس بن محمد المؤدب ، عن الليث بن سعد ، به . وأخرجه الترمذي ] في تفسيره [ عن عبد بن حميد ] به [ ثم قال : وهذا حديث حسن غريب ، وأبو أمامة الأنصاري هذا هو ابن ثعلبة ، ولا يعرف اسمه . وقد روى عن النبي صلى الله عليه وسلم أحاديث .\nقال شيخنا الحافظ أبو الحجاج المزي : وقد رواه عبد الرحمن بن إسحاق المدني ، عن محمد بن زيد ، عن عبد الله بن أبي أمامة ، عن أبيه عن عبد الله بن أنيس . فزاد عبد الله بن أبي أمامة .\nقلت : هكذا وقع في تفسير ابن مردويه وصحيح ابن حبان ، من طريق عبد الرحمن بن إسحاق كما ذكره شيخنا ، فسح الله في أجله .\nحديث آخر : عن عبد الله بن عمرو ، في التسبب إلى شتم الوالدين . قال ابن أبي حاتم : حدثنا عمرو بن عبد الله الأودي ، حدثنا وكيع ، عن مسعر وسفيان ، عن سعد بن إبراهيم ، عن حميد بن عبد الرحمن ، عن عبد الله بن عمرو - رفعه سفيان إلى النبي صلى الله عليه وسلم ، ووقفه مسعر على عبد الله بن عمرو - قال : \" من الكبائر أن يشتم الرجل والديه \" : قالوا : وكيف يشتم الرجل والديه ؟ قال : \" يسب الرجل أبا الرجل فيسب أباه ، ويسب أمه فيسب أمه \" .\nوقد أخرج هذا الحديث البخاري عن أحمد بن يونس ، عن إبراهيم بن سعد بن إبراهيم بن عبد الرحمن بن عوف ، عن أبيه ، عن عمه حميد بن عبد الرحمن بن عوف ، عن عبد الله بن عمرو قال : قال رسول الله صلى الله عليه وسلم : \" إن من أكبر الكبائر أن يلعن الرجل والديه \" . قالوا : وكيف يلعن الرجل والديه ؟ ! قال : \" يسب الرجل أبا الرجل فيسب أباه ، ويسب أمه فيسب أمه \" .\nوهكذا رواه مسلم من حديث سفيان وشعبة ويزيد بن الهاد ، ثلاثتهم عن سعد بن إبراهيم ، به مرفوعا بنحوه . وقال الترمذي : صحيح .\nوثبت في الصحيح عن رسول الله صلى الله عليه وسلم أنه قال : \" سباب المسلم فسوق ، وقتاله كفر \" .\nحديث آخر في ذلك : قال ابن أبي حاتم : حدثنا عبد الرحمن بن إبراهيم دحيم ، حدثنا عمرو بن أبي سلمة ، حدثنا زهير بن محمد ، عن العلاء بن عبد الرحمن ، عن أبيه ، عن أبي هريرة ، أن رسول الله صلى الله عليه وسلم قال : \" من أكبر الكبائر عرض الرجل المسلم ، والسبتان والسبة \" .\nهكذا روي هذا الحديث ، وقد أخرجه أبو داود في كتاب الأدب في سننه ، عن جعفر بن مسافر ، عن عمرو بن أبي سلمة ، عن زهير بن محمد ، عن العلاء ، عن أبيه ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم قال : \" من أكبر الكبائر استطالة المرء في عرض رجل مسلم بغير حق ، ومن الكبائر السبتان بالسبة \" .\nوكذا رواه ابن مردويه من طريق عبد الله بن العلاء بن زير عن العلاء ، عن أبيه ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم ، فذكر مثله .\nحديث آخر : في ذكر الجمع بين الصلاتين من غير عذر; قال ابن أبي حاتم : حدثنا أبي ، حدثنا نعيم بن حماد ، حدثنا معتمر بن سليمان ، عن أبيه ، عن حنش عن عكرمة ، عن ابن عباس ، عن النبي صلى الله عليه وسلم قال : \" من جمع بين الصلاتين من غير عذر ، فقد أتى بابا من أبواب الكبائر \" . وهكذا رواه أبو عيسى الترمذي عن أبي سلمة يحيى بن خلف ، عن المعتمر بن سليمان ، به ثم قال : حنش هو أبو علي الرحبي ، وهو حسين بن قيس ، وهو ضعيف عند أهل الحديث ، ضعفه أحمد وغيره .\nوقد روى ابن أبي حاتم : حدثنا الحسن بن محمد بن الصباح ، حدثنا إسماعيل بن علية ، عن خالد الحذاء ، عن حميد بن هلال ، عن أبي قتادة - يعني العدوي - قال : قرئ علينا كتاب عمر : من الكبائر جمع بين الصلاتين - يعني بغير عذر - والفرار من الزحف ، والنهبة .\nوهذا إسناد صحيح : والغرض أنه إذا كان الوعيد فيمن جمع بين الصلاتين كالظهر والعصر تقديما أو تأخيرا ، وكذا المغرب والعشاء هما من شأنه أن يجمع بسبب من الأسباب الشرعية ، فإذا تعاطاه أحد بغير شيء من تلك الأسباب يكون مرتكبا كبيرة ، فما ظنك بمن ترك الصلاة بالكلية ؟ ولهذا روى مسلم في صحيحه ، عن رسول الله صلى الله عليه وسلم أنه قال : \" بين العبد وبين الشرك ترك الصلاة \" وفي السنن عنه ، عليه السلام ، أنه قال : \" العهد الذي بيننا وبينهم الصلاة ، فمن تركها فقد كفر \" وقال : \" من ترك صلاة العصر فقد حبط عمله \" وقال : \" من فاتته صلاة العصر فكأنما وتر أهله وماله \" .\nحديث آخر : فيه اليأس من روح الله ، والأمن من مكر الله . قال ابن أبي حاتم : حدثنا أحمد بن عمرو بن أبي عاصم النبيل ، حدثنا أبي ، حدثنا شبيب بن بشر ، عن عكرمة ، عن ابن عباس ; أن رسول الله صلى الله عليه وسلم كان متكئا فدخل عليه رجل فقال : ما الكبائر ؟ فقال : \" الشرك بالله ، واليأس من روح الله ، والقنوط من رحمة الله ، والأمن من مكر الله ، وهذا أكبر الكبائر \" .\nوقد رواه البزار ، عن عبد الله بن إسحاق العطار ، عن أبي عاصم النبيل ، عن شبيب بن بشر ، عن عكرمة ، عن ابن عباس ; أن رجلا قال : يا رسول الله ، ما الكبائر ؟ قال : \" الإشراك بالله ، واليأس من روح الله ، والقنوط من رحمة الله عز وجل \" .\nوفي إسناده نظر ، والأشبه أن يكون موقوفا ، فقد روي عن ابن مسعود نحو ذلك قال ابن جرير :\nحدثني يعقوب بن إبراهيم ، حدثنا هشيم ، أخبرنا مطرف ، عن وبرة بن عبد الرحمن ، عن أبي الطفيل قال : قال ابن مسعود : أكبر الكبائر الإشراك بالله والإياس من روح الله ، والقنوط من رحمة الله ، والأمن من مكر الله .\nوكذا رواه من حديث الأعمش وأبي إسحاق ، عن وبرة ، عن أبي الطفيل ، عن ابن مسعود ، به ثم رواه من طرق عدة ، عن أبي الطفيل ، عن ابن مسعود . وهو صحيح إليه بلا شك .\nحديث آخر : فيه سوء الظن بالله; قال ابن مردويه : حدثنا محمد بن إبراهيم بن بندار ، حدثنا أبو حاتم بكر بن عبدان ، حدثنا محمد بن مهاجر حدثنا أبو حذيفة البخاري ، عن محمد بن عجلان ، عن نافع ، عن ابن عمر أنه قال : ] قال رسول الله صلى الله عليه وسلم [ \" أكبر الكبائر سوء الظن بالله عز وجل \" . حديث غريب جدا .\nحديث آخر : فيه التعرب بعد الهجرة ، قد تقدم في رواية عمرو بن أبي سلمة ، عن أبيه ، عن أبي هريرة مرفوعا ، قال أبو بكر بن مردويه : حدثنا سليمان بن أحمد ، حدثنا أحمد بن رشدين ، حدثنا عمرو بن خالد الحراني ، حدثنا ابن لهيعة عن يزيد بن أبي حبيب ، عن محمد بن سهل بن أبي حثمة عن أبيه قال : سمعت النبي صلى الله عليه وسلم يقول : \" الكبائر سبع ، ألا تسألوني عنهن ؟ الشرك بالله ، وقتل النفس ، والفرار يوم الزحف ، وأكل مال اليتيم ، وأكل الربا ، وقذف المحصنة ، والتعرب بعد الهجرة \" .\nوفي إسناده نظر ، ورفعه غلط فاحش والصواب ما رواه ابن جرير : حدثنا تميم بن المنتصر ، أخبرنا يزيد ، أخبرنا محمد بن إسحاق ، عن محمد بن سهيل بن أبي حثمة عن أبيه قال : إني لفي هذا المسجد - مسجد الكوفة - وعلي ، رضي الله عنه ، يخطب الناس على المنبر ، فقال : يا أيها الناس ، الكبائر سبع فأصاخ الناس ، فأعادها ثلاث مرات ، ثم قال : لم لا تسألوني عنها ؟ قالوا : يا أمير المؤمنين ما هي ؟ قال : الإشراك بالله ، وقتل النفس التي حرم الله وقذف المحصنة ، وأكل مال اليتيم ، وأكل الربا ، والفرار يوم الزحف ، والتعرب بعد الهجرة . فقلت لأبي : يا أبت ، التعرب بعد الهجرة ، كيف لحق هاهنا ؟ قال : يا بني ، وما أعظم من أن يهاجر الرجل ، حتى إذا وقع سهمه في الفيء ، ووجب عليه الجهاد خلع ذلك من عنقه فرجع أعرابيا كما كان .\nحديث آخر : قال الإمام أحمد : حدثنا هاشم ، حدثنا أبو معاوية - يعني شيبان - عن منصور ، عن هلال بن يساف ، عن سلمة بن قيس الأشجعي قال : قال رسول الله صلى الله عليه وسلم في حجة الوداع : \" ألا إنما هن أربع : ألا تشركوا بالله شيئا ، ولا تقتلوا النفس التي حرم الله إلا بالحق ، ولا تزنوا ، ولا تسرقوا \" . قال : فما أنا بأشح عليهن مني ، إذ سمعتهن من رسول الله صلى الله عليه وسلم .\nثم رواه أحمد أيضا والنسائي وابن مردويه ، من حديث منصور ، بإسناده مثله .\nحديث آخر : تقدم من رواية عمر بن المغيرة ، عن داود بن أبي هند ، عن عكرمة ، عن ابن عباس ، عن النبي صلى الله عليه وسلم أنه قال : \" الإضرار في الوصية من الكبائر \" . والصحيح ما رواه غيره ، عن داود ، عن عكرمة ، عن ابن عباس [ قوله ] قال ابن أبي حاتم : وهو الصحيح عن ابن عباس من قوله .\nحديث آخر في ذلك : \" قال ابن جرير : حدثنا أبو كريب ، حدثنا أحمد بن عبد الرحمن ، حدثنا عباد بن عباد ، عن جعفر بن الزبير ، عن القاسم ، عن أبي أمامة ; أن ناسا من أصحاب النبي صلى الله عليه وسلم ذكروا الكبائر وهو متكئ ، فقالوا : الشرك بالله ، وأكل مال اليتيم ، وفرار من الزحف ، وقذف المحصنة ، وعقوق الوالدين ، وقول الزور ، والغلول ، والسحر ، وأكل الربا ، فقال رسول الله صلى الله عليه وسلم : \" فأين تجعلون ( الذين يشترون بعهد الله وأيمانهم ثمنا قليلا ) [ آل عمران : 77 ] ؟ ! إلى آخر الآية . في إسناده ضعف ، وهو حسن .\nذكر أقوال السلف في ذلك :\nقد تقدم ما روي عن أمير المؤمنين عمر وعلي ، رضي الله عنهما ، في ضمن الأحاديث المذكورة . وقال ابن جرير :\nحدثني يعقوب بن إبراهيم ، حدثنا ابن علية ، عن ابن عون ، عن الحسن : أن ناسا سألوا عبد الله بن عمرو بمصر فقالوا : نرى أشياء من كتاب الله ، أمر أن يعمل بها فلا يعمل بها ، فأردنا أن نلقى أمير المؤمنين في ذلك ؟ فقدم وقدموا معه ، فلقيه عمر ، رضي الله عنه ، فقال : متى قدمت ؟ فقال : منذ كذا وكذا قال : أبإذن قدمت ؟ قال : فلا أدري كيف رد عليه . فقال : يا أمير المؤمنين ، إن ناسا لقوني بمصر فقالوا : إنا نرى أشياء من كتاب الله ، أمر أن يعمل بها فلا يعمل بها فأحبوا أن يلقوك في ذلك فقال : اجمعهم لي . قال : فجمعتهم له - قال ابن عون : أظنه قال : في بهو - فأخذ أدناهم رجلا فقال : نشدتك بالله وبحق الإسلام عليك ، أقرأت القرآن كله ؟ قال : نعم قال فهل أحصيته في نفسك ؟ قال اللهم لا . قال : ولو قال : نعم لخصمه . قال : فهل أحصيته في بصرك ؟ فهل أحصيته في لفظك ؟ هل أحصيته في أمرك ؟ ثم تتبعهم حتى أتى على آخرهم . قال : فثكلت عمر أمه . أتكلفونه أن يقيم الناس على كتاب الله ؟ ! قد علم ربنا أنه ستكون لنا سيئات . قال : وتلا ( إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم وندخلكم مدخلا كريما ] ) ثم قال : هل علم أهل المدينة - أو قال : هل علم أحد - بما قدمتم ؟ قالوا : لا . قال : لو علموا لوعظت بكم .\nإسناد حسن ومتن حسن ، وإن كان من رواية الحسن عن عمر ، وفيها انقطاع ، إلا أن مثل هذا اشتهر فتكفي شهرته .\nوقال ابن أبي حاتم : حدثنا أحمد بن سنان ، حدثنا أبو أحمد - يعني الزبيري - حدثنا علي بن صالح ، عن عثمان بن المغيرة ، عن مالك بن جوين ، عن علي ، رضي الله عنه ، قال : الكبائر الإشراك بالله ، وقتل النفس ، وأكل مال اليتيم ، وقذف المحصنة ، والفرار من الزحف ، والتعرب بعد الهجرة ، والسحر ، وعقوق الوالدين ، وأكل الربا ، وفراق الجماعة ، ونكث الصفقة .\nوتقدم عن ابن مسعود أنه قال : أكبر الكبائر الإشراك بالله ، واليأس من روح الله ، والقنوط من رحمة الله ، والأمن من مكر الله ، عز وجل .\nوروى ابن جرير ، من حديث الأعمش ، عن أبي الضحى ، عن مسروق ، والأعمش ، عن إبراهيم ، عن علقمة ، كلاهما عن ابن مسعود قال : الكبائر من أول سورة النساء إلى ثلاثين آية منها . ومن حديث سفيان الثوري وشعبة ، عن عاصم بن أبي النجود ، عن زر بن حبيش ، عن ابن مسعود قال : الكبائر من أول سورة النساء إلى ثلاثين آية منها ثم تلا ( إن تجتنبوا كبائر ما تنهون عنه [ نكفر عنكم سيئاتكم وندخلكم مدخلا كريما ] )\nوقال ابن أبي حاتم : حدثنا المنذر بن شاذان ، حدثنا يعلى بن عبيد ، حدثنا صالح بن حيان ، عن ابن بريدة ، عن أبيه قال : أكبر الكبائر : الشرك بالله ، وعقوق الوالدين ، ومنع فضول الماء بعد الري ، ومنع طروق الفحل إلا بجعل .\nوفي الصحيحين ، عن النبي صلى الله عليه وسلم أنه قال : \" لا يمنع فضل الماء ليمنع به الكلأ \" وفيهما عنه صلى الله عليه وسلم أنه قال : \" ثلاثة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم : رجل على فضل ماء بالفلاة يمنعه ابن السبيل \" ، وذكر الحديث بتمامه .\nوفي مسند الإمام أحمد ، من حديث عمرو بن شعيب ، عن أبيه ، عن جده مرفوعا : \" من منع فضل الماء وفضل الكلأ منعه الله فضله يوم القيامة \" .\nوقال ابن أبي حاتم : حدثنا الحسين بن محمد بن شنبة الواسطي ، حدثنا أبو أحمد حدثنا سفيان ، عن الأعمش ، عن مسلم ، عن مسروق ، عن عائشة ، قالت : ما أخذ على النساء من الكبائر . قال ابن أبي حاتم : يعني قوله : ( على أن لا يشركن بالله شيئا ولا يسرقن [ ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ولا يعصينك ] ) الآية [ الممتحنة : 12 ] .\nوقال ابن جرير : حدثني يعقوب بن إبراهيم ، حدثنا ابن علية ، حدثنا زياد بن مخراق ، عن معاوية بن قرة قال : أتينا أنس بن مالك ، فكان فيما حدثنا قال : لم أر مثل الذي بلغنا عن ربنا تعالى ثم لم نخرج له عن كل أهل ومال . ثم سكت هنية ثم قال : والله لما كلفنا ربنا أهون من ذلك ، لقد تجاوز لنا عما دون الكبائر ، فما لنا ولها ، ثم تلا ( إن تجتنبوا كبائر ما تنهون عنه [ نكفر عنكم سيئاتكم وندخلكم مدخلا كريما ] ) .\nأقوال ابن عباس في ذلك :\nروى ابن جرير ، من حديث المعتمر بن سليمان ، عن أبيه ، عن طاوس قال : ذكروا عند ابن عباس الكبائر فقالوا : هي سبع ، فقال : هي أكثر من سبع وسبع . قال سليمان : فما أدري كم قالها من مرة .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا قبيصة ، حدثنا سفيان ، عن ليث ، عن طاوس قال : قلت لابن عباس : ما السبع الكبائر ؟ قال : هي إلى السبعين أقرب منها إلى السبع .\nورواه ابن جرير ، عن ابن حميد ، عن ليث ، عن طاوس قال : جاء رجل إلى ابن عباس فقال : أرأيت الكبائر السبع التي ذكرهن الله ؟ ما هن ؟ قال : هن إلى السبعين أدنى منهن إلى سبع .\nوقال عبد الرزاق : أخبرنا معمر عن طاوس ، عن أبيه قال : قيل لابن عباس : الكبائر سبع ؟ قال : هن إلى السبعين أقرب ، وكذا قال أبو العالية الرياحي ، رحمه الله .\nوقال ابن جرير : حدثنا المثنى ، حدثنا أبو حذيفة ، حدثنا شبل ، عن قيس عن سعد ، عن سعيد بن جبير ; أن رجلا قال لابن عباس : كم الكبائر ؟ سبع ؟ قال : هن إلى سبعمائة أقرب منها إلى سبع ، غير أنه لا كبيرة مع استغفار ، ولا صغيرة مع إصرار . وكذا رواه ابن أبي حاتم ، من حديث شبل ، به .\nوقال علي بن أبي طلحة ، عن ابن عباس في قوله ( إن تجتنبوا كبائر ما تنهون عنه ) قال : الكبائر كل ذنب ختمه الله بنار أو غضب أو لعنة أو عذاب . ورواه ابن جرير .\nوقال ابن أبي حاتم : حدثنا علي بن حرب الموصلي ، حدثنا ابن فضيل ، حدثنا شبيب ، عن عكرمة ، عن ابن عباس قال : الكبائر : كل ما وعد الله عليه النار كبيرة . وكذا قال سعيد بن جبير والحسن البصري .\nوقال ابن جرير : حدثني يعقوب ، حدثنا ابن علية ، أخبرنا أيوب ، عن محمد بن سيرين قال : نبئت أن ابن عباس كان يقول : كل ما نهى الله عنه كبيرة . وقد ذكرت الطرفة [ فيه ] قال : هي النظرة .\nوقال أيضا : حدثنا أحمد بن حازم ، أخبرنا أبو نعيم ، حدثنا عبد الله بن معدان ، عن أبي الوليد قال : سألت ابن عباس عن الكبائر فقال هي كل شيء عصي الله فيه فهو كبيرة .\nأقوال التابعين\nقال ابن جرير : حدثني يعقوب بن إبراهيم ، حدثنا ابن علية ، عن ابن عون ، عن محمد قال : سألت عبيدة عن الكبائر ، فقال : الإشراك بالله ، وقتل النفس التي حرم الله بغير حقها ، وفرار يوم الزحف ، وأكل مال اليتيم بغير حقه ، وأكل الربا ، والبهتان . قال : ويقولون : أعرابية بعد هجرة . قال ابن عون : فقلت لمحمد : فالسحر ؟ قال : إن البهتان يجمع شرا كبيرا .\nوقال ابن جرير : حدثني محمد بن عبيد المحاربي حدثنا أبو الأحوص سلام بن سليم ، عن أبي إسحاق ، عن عبيد بن عمير قال : الكبائر سبع ، ليس منهن كبيرة إلا وفيها آية من كتاب الله : الإشراك بالله منهن : ( ومن يشرك بالله فكأنما خر من السماء فتخطفه الطير أو تهوي به الريح ) [ الحج : 31 ] و ( إن الذين يأكلون أموال اليتامى ظلما إنما يأكلون في بطونهم نارا ) [ النساء : 10 ] ( الذين يأكلون الربا لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس ) [ البقرة : 275 ] و ( إن الذين يرمون المحصنات الغافلات المؤمنات ) [ النور : 23 ] والفرار من الزحف : ( يا أيها الذين آمنوا إذا لقيتم الذين كفروا زحفا [ فلا تولوهم الأدبار ] ) [ الأنفال : 15 ] ، والتعرب بعد الهجرة : ( إن الذين ارتدوا على أدبارهم من بعد ما تبين لهم الهدى ) [ محمد : 25 ] ، وقتل المؤمن : ( ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها ) الآية [ النساء : 93 ] .\nوكذا رواه ابن أبي حاتم من حديث أبي إسحاق ، عن عبيد ، بنحوه .\nوقال ابن جرير : حدثنا المثنى ، حدثنا أبو حذيفة ، حدثنا شبل ، عن ابن أبي نجيح ، عن عطاء - يعني ابن أبي رباح - قال : الكبائر سبع : قتل النفس ، وأكل الربا وأكل مال اليتيم ، ورمي المحصنة ، وشهادة الزور ، وعقوق الوالدين ، والفرار من الزحف .\nوقال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا عثمان بن أبي شيبة ، حدثنا جرير ، عن مغيرة قال : كان يقال شتم أبي بكر وعمر ، رضي الله عنهما ، من الكبائر .\nقلت : وقد ذهب طائفة من العلماء إلى تكفير من سب الصحابة ، وهو رواية عن مالك بن أنس ، رحمه الله : وقال محمد بن سيرين : ما أظن أحدا ينتقص أبا بكر ، وعمر ، وهو يحب رسول الله صلى الله عليه وسلم . رواه الترمذي .\nوقال ابن أبي حاتم أيضا : حدثنا يونس ، أخبرنا ابن وهب ، أخبرني عبد الله بن عياش ، قال زيد بن أسلم في قول الله عز وجل : ( إن تجتنبوا كبائر ما تنهون عنه ) من الكبائر : الشرك ، والكفر بآيات الله ورسوله ، والسحر ، وقتل الأولاد ، ومن دعا لله ولدا أو صاحبة ، ومثل ذلك من الأعمال ، والقول الذي لا يصلح معه عمل ، وأما كل ذنب يصلح معه دين ، ويقبل معه عمل فإن الله يغفر السيئات بالحسنات .\nوقال ابن جرير : حدثنا بشر بن معاذ ، حدثنا يزيد ، حدثنا سعيد ، عن قتادة : ( إن تجتنبوا كبائر ما تنهون عنه ) الآية : إنما وعد الله المغفرة لمن اجتنب الكبائر . وذكر لنا أن نبي الله صلى الله عليه وسلم قال : \" اجتنبوا الكبائر ، وسددوا ، وأبشروا \" .\nوقد روى ابن مردويه من طرق عن أنس ، وعن جابر مرفوعا : \" شفاعتي لأهل الكبائر من أمتي \" ولكن في إسناده من جميع طرقه ضعف ، إلا ما رواه عبد الرزاق : أخبرنا معمر ، عن ثابت ، عن أنس قال : قال رسول الله صلى الله عليه وسلم : \" شفاعتي لأهل الكبائر من أمتي \" . فإنه إسناد صحيح على شرط الشيخين وقد رواه أبو عيسى الترمذي منفردا به من هذا الوجه ، عن عباس العنبري ، عن عبد الرزاق ثم قال : هذا حديث حسن صحيح وفي الصحيح شاهد لمعناه ، وهو قوله صلى الله عليه وسلم بعد ذكر الشفاعة : \" أترونها للمؤمنين المتقين ؟ لا ولكنها للخاطئين ال متلوثين \" .\nوقد اختلف علماء الأصول والفروع في حد الكبيرة فمن قائل : هي ما عليه حد في الشرع .\nومنهم من قال : هي ما عليه وعيد لخصوصه من الكتاب والسنة . وقيل غير ذلك . قال أبو القاسم عبد الكريم بن محمد الرافعي ، في كتابه \" الشرح الكبير \" الشهير ، في كتاب الشهادات منه : ثم اختلف الصحابة ، رضي الله [ تعالى ] عنهم ، فمن بعدهم في الكبائر ، وفي الفرق بينها وبين الصغائر ، ولبعض الأصحاب في تفسير الكبيرة وجوه :\nأحدها : أنها المعصية الموجبة للحد .\nوالثاني : أنها المعصية التي يلحق صاحبها الوعيد الشديد بنص كتاب أو سنة . وهذا أكثر ما يوجد لهم ، وهو وإلى الأول أميل ، لكن الثاني أوفق لما ذكروه عند تفسير الكبائر .\nوالثالث : قال إمام الحرمين في \" الإرشاد \" وغيره : كل جريمة تنبئ بقلة اكتراث مرتكبها بالدين ورقة الديانة ، فهي مبطلة للعدالة .\nوالرابع : ذكر القاضي أبو سعيد الهروي أن الكبيرة : كل فعل نص الكتاب على تحريمه ، وكل معصية توجب في جنسها حدا من قتل أو غيره ، وترك كل فريضة مأمور بها على الفور ، والكذب في الشهادة ، والرواية ، واليمين .\nهذا ما ذكره على سبيل الضبط .\nثم قال : وفصل القاضي الروياني فقال : الكبائر سبع : قتل النفس بغير الحق ، والزنا ، واللواط ، وشرب الخمر ، والسرقة ، وأخذ المال غصبا ، والقذف . وزاد في \" الشامل \" على السبع المذكورة : شهادة الزور . وأضاف إليها صاحب العدة : أكل الربا ، والإفطار في رمضان بلا عذر ، واليمين الفاجرة ، وقطع الرحم ، وعقوق الوالدين ، والفرار من الزحف ، وأكل مال اليتيم ، والخيانة في الكيل والوزن ، وتقديم الصلاة على وقتها ، وتأخيرها عن وقتها ، بلا عذر ، وضرب المسلم بلا حق ، والكذب على النبي صلى الله عليه وسلم عمدا ، وسب أصحابه ، وكتمان الشهادة بلا عذر ، وأخذ الرشوة ، والقيادة بين الرجال والنساء ، والسعاية عند السلطان ، ومنع الزكاة ، وترك الأمر بالمعروف والنهي عن المنكر مع القدرة ، ونسيان القرآن بعد تعلمه ، وإحراق الحيوان بالنار ، وامتناع المرأة من زوجها بلا سبب ، واليأس من رحمة الله ، والأمن من مكر الله ويقال : الوقيعة في أهل العلم وحملة القرآن . ومما يعد من الكبائر : الظهار ، وأكل لحم الخنزير والميتة إلا عن ضرورة .\nثم قال الرافعي : وللتوقف مجال في بعض هذه الخصال .\nقلت : وقد صنف الناس في الكبائر مصنفات ، منها ما جمعه شيخنا الحافظ أبو عبد الله الذهبي الذي بلغ نحوا من سبعين كبيرة ، وإذا قيل : إن الكبيرة [ هى ] ما توعد الشارع عليها بالنار بخصوصها ، كما قال ابن عباس ، وغيره ، وتتبع ذلك ، اجتمع منه شيء كثير ، وإذا قيل : كل ما نهى الله [ تعالى ] عنه فكثير جدا ، والله [ تعالى ] أعلم .\n                                    ",
        "qortoby": "إِن تَجۡتَنِبُواْ كَبَآئِرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَيِّ‍َٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلٗا كَرِيمٗا ١٣\n                                    \n                                    \n                                    قوله تعالى : إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم وندخلكم مدخلا كريما\nفيه مسألتان :\nالأولى : لما نهى تعالى في هذه السورة عن آثام هي كبائر ، وعد على اجتنابها التخفيف من الصغائر ، ودل هذا على أن في الذنوب كبائر وصغائر . وعلى هذا جماعة أهل التأويل وجماعة الفقهاء ، وأن اللمسة والنظرة تكفر باجتناب الكبائر قطعا بوعده الصدق وقوله الحق ، لا أنه يجب عليه ذلك . ونظير الكلام في هذا ما تقدم بيانه في قبول التوبة في قوله تعالى : إنما التوبة على الله ، فالله تعالى يغفر الصغائر باجتناب الكبائر ، لكن بضميمة أخرى إلى الاجتناب وهي إقامة الفرائض . روى مسلم عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات ما بينهن إذا اجتنب الكبائر . وروى أبو حاتم البستي في صحيح مسنده عن أبي هريرة وأبي سعيد الخدري أن رسول الله صلى الله عليه وسلم جلس على المنبر ثم قال : والذي نفسي بيده ثلاث مرات ، ثم سكت فأكب كل رجل منا يبكي حزينا ليمين رسول الله صلى الله عليه وسلم ثم قال : ما من عبد يؤدي الصلوات الخمس ويصوم رمضان ويجتنب الكبائر السبع إلا فتحت له ثمانية أبواب من الجنة يوم القيامة حتى إنها لتصفق ثم تلا إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم . فقد تعاضد الكتاب وصحيح السنة بتكفير الصغائر قطعا كالنظر وشبهه . وبينت السنة أن المراد ب تجتنبوا ليس كل الاجتناب لجميع الكبائر . والله أعلم . وأما الأصوليون فقالوا : لا يجب على القطع تكفير الصغائر باجتناب الكبائر ، وإنما محمل ذلك على غلبة الظن وقوة الرجاء والمشيئة ثابتة . ودل على ذلك أنه لو قطعنا لمجتنب الكبائر وممتثل الفرائض تكفير صغائره قطعا لكانت له في حكم المباح الذي يقطع بألا تباعة فيه ، وذلك نقض لعرى الشريعة . ولا صغيرة عندنا . قال القشيري عبد الرحيم : والصحيح أنها كبائر ولكن بعضها أعظم وقعا من بعض ، والحكمة في عدم التمييز أن يجتنب العبد جميع المعاصي .\nقلت : وأيضا فإن من نظر إلى نفس المخالفة كما قال بعضهم : - لا تنظر إلى صغر الذنب ولكن انظر من عصيت - كانت الذنوب بهذه النسبة كلها كبائر ، وعلى هذا النحو يخرج كلام القاضي أبي بكر بن الطيب والأستاذ أبي إسحاق الإسفراييني وأبي المعالي وأبي نصر عبد الرحيم القشيري وغيرهم ؛ قالوا : وإنما يقال لبعضها صغيرة بالإضافة إلى ما هو أكبر منها ، كما يقال الزنى صغيرة بإضافته إلى الكفر ، والقبلة المحرمة صغيرة بالنسبة إلى الزنى ، ولا ذنب عندنا يغفر باجتناب ذنب آخر ، بل كل ذلك كبيرة ومرتكبه في المشيئة غير الكفر ، لقوله تعالى : إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء واحتجوا بقراءة من قرأ \" إن تجتنبوا كبير ما تنهون عنه \" على التوحيد ؛ وكبير الإثم الشرك . قالوا : وعلى الجمع فالمراد أجناس الكفر . والآية التي قيدت الحكم فترد إليها هذه المطلقات كلها قوله تعالى : ويغفر ما دون ذلك لمن يشاء . واحتجوا بما رواه مسلم وغيره عن أبي أمامة أن رسول الله صلى الله عليه وسلم قال : من اقتطع حق امرئ مسلم بيمينه فقد أوجب الله له النار وحرم عليه الجنة فقال له رجل : يا رسول الله ، وإن كان شيئا يسيرا ؟ قال : وإن كان قضيبا من أراك . فقد جاء الوعيد الشديد على اليسير كما جاء على الكثير . وقال ابن عباس : الكبيرة كل ذنب ختمه الله بنار أو غضب أو لعنة أو عذاب . وقال ابن مسعود : الكبائر ما نهى الله عنه في هذه السورة إلى ثلاث وثلاثين آية ؛ وتصديقه قوله تعالى : إن تجتنبوا كبائر ما تنهون عنه . وقال طاوس : قيل لابن عباس الكبائر سبع ؟ قال : هي إلى السبعين أقرب . وقال سعيد بن جبير : قال رجل لابن عباس الكبائر سبع ؟ قال : هي إلى السبعمائة أقرب منها إلى السبع ؛ غير أنه لا كبيرة مع استغفار ولا صغيرة مع إصرار . وروي عن ابن مسعود أنه قال : الكبائر أربعة : اليأس من روح الله ، والقنوط من رحمة الله ، والأمن من مكر الله ، والشرك بالله ؛ دل عليها القرآن .\nوروي عن ابن عمر : هي تسع : قتل النفس ، وأكل الربا ، وأكل مال اليتيم ، ورمي المحصنة ، وشهادة الزور ، وعقوق الوالدين ، والفرار من الزحف ، والسحر ، والإلحاد في البيت الحرام . ومن الكبائر عند العلماء : القمار والسرقة وشرب الخمر وسب السلف الصالح وعدول الحكام عن الحق واتباع الهوى واليمين الفاجرة والقنوط من رحمة الله وسب الإنسان أبويه - بأن يسب رجلا فيسب ذلك الرجل أبويه - والسعي في الأرض فسادا - ؛ إلى غير ذلك مما يكثر تعداده حسب ما جاء بيانها في القرآن ، وفي أحاديث خرجها الأئمة ، وقد ذكر مسلم في كتاب الإيمان منها جملة وافرة .\nوقد اختلف الناس في تعدادها وحصرها لاختلاف الآثار فيها ؛ والذي أقول : إنه قد جاءت فيها أحاديث كثيرة صحاح وحسان لم يقصد بها الحصر ، ولكن بعضها أكبر من بعض بالنسبة إلى ما يكثر ضرره ، فالشرك أكبر ذلك كله ، وهو الذي لا يغفر لنص الله تعالى على ذلك ، وبعده اليأس من رحمة الله ؛ لأن فيه تكذيب القرآن ؛ إذ يقول وقوله الحق : ورحمتي وسعت كل شيء وهو يقول : لا يغفر له ؛ فقد حجر واسعا . هذا إذا كان معتقدا لذلك ؛ ولذلك قال الله تعالى : إنه لا ييأس من روح الله إلا القوم الكافرون . وبعده القنوط ؛ قال الله تعالى : ومن يقنط من رحمة ربه إلا الضالون . وبعده الأمن من مكر الله فيسترسل في المعاصي ويتكل على رحمة الله من غير عمل ؛ قال الله تعالى : أفأمنوا مكر الله فلا يأمن مكر الله إلا القوم الخاسرون . وقال تعالى : وذلكم ظنكم الذي ظننتم بربكم أرداكم فأصبحتم من الخاسرين . وبعده القتل ؛ لأن فيه إذهاب النفوس وإعدام الوجود ، واللواط فيه قطع النسل ، والزنى فيه اختلاط الأنساب بالمياه ، والخمر فيه ذهاب العقل الذي هو مناط التكليف ، وترك الصلاة والأذان فيه ترك إظهار شعائر الإسلام ، وشهادة الزور فيها استباحة الدماء والفروج والأموال ، إلى غير ذلك مما هو بين الضرر ؛ فكل ذنب عظم الشرع التوعد عليه بالعقاب وشدده ، أو عظم ضرره في الوجود كما ذكرنا فهو كبيرة وما عداه صغيرة . فهذا يربط لك هذا الباب ويضبطه ، والله أعلم .\nالثانية : قوله تعالى : وندخلكم مدخلا كريما قرأ أبو عمرو وأكثر الكوفيين \" مدخلا \" بضم الميم ، فيحتمل أن يكون مصدرا ، أي إدخالا ، والمفعول محذوف أي وندخلكم الجنة إدخالا . ويحتمل أن يكون بمعنى المكان فيكون مفعولا . وقرأ أهل المدينة بفتح الميم ، فيجوز أن يكون مصدر دخل وهو منصوب بإضمار فعل ؛ التقدير وندخلكم فتدخلون مدخلا ، ودل الكلام عليه . ويجوز أن يكون اسم مكان فينتصب على أنه مفعول به ، أي وندخلكم مكانا كريما وهو الجنة . وقال أبو سعيد بن الأعرابي : سمعت أبا داود السجستاني يقول : سمعت أبا عبد الله أحمد بن حنبل يقول : المسلمون كلهم في الجنة ؛ فقلت له : وكيف ؟ قال : يقول الله عز وجل : إن تجتبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم وندخلكم مدخلا كريما يعني الجنة . وقال النبي صلى الله عليه وسلم : ادخرت شفاعتي لأهل الكبائر من أمتي . فإذا كان الله عز وجل يغفر ما دون الكبائر والنبي صلى الله عليه وسلم يشفع في الكبائر فأي ذنب يبقى على المسلمين .\nوقال علماؤنا : الكبائر عند أهل السنة تغفر لمن أقلع عنها قبل الموت حسب ما تقدم . وقد يغفر لمن مات عليها من المسلمين كما قال تعالى : ويغفر ما دون ذلك لمن يشاء والمراد بذلك من مات على الذنوب ؛ فلو كان المراد من تاب قبل الموت لم يكن للتفرقة بين الإشراك وغيره معنى ؛ إذ التائب من الشرك أيضا مغفور له . وروي عن ابن مسعود أنه قال : خمس آيات من سورة النساء هي أحب إلي من الدنيا جميعا ، قوله تعالى : إن تجتنبوا كبائر ما تنهون عنه وقوله إن الله لا يغفر أن يشرك به ويغفر الآية ، وقوله تعالى : ومن يعمل سوءا أو يظلم نفسه الآية ، وقوله تعالى : وإن تك حسنة يضاعفها ، وقوله تعالى : والذين آمنوا بالله ورسله . وقال ابن عباس : ثمان آيات في سورة النساء ، هن خير لهذه الأمة مما طلعت عليه الشمس وغربت : يريد الله ليبين لكم ، والله يريد أن يتوب عليكم ، يريد الله أن يخفف عنكم ، إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم ، الآية ، إن الله لا يغفر أن يشرك به ، إن الله لا يظلم مثقال ذرة ، ومن يعمل سوءا أو يظلم نفسه ، ما يفعل الله بعذابكم الآية .\n                                    ",
        "saadi": "إِن تَجۡتَنِبُواْ كَبَآئِرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَيِّ‍َٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلٗا كَرِيمٗا ١٣\n                                        \n                                        \n                                        \n                                        وهذا من فضل الله وإحسانه على عباده المؤمنين وعدهم أنهم إذا اجتنبوا كبائر المنهيات غفر لهم جميع الذنوب والسيئات وأدخلهم مدخلا كريما كثير الخير وهو الجنة المشتملة على ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر. ويدخل في اجتناب الكبائر فعل الفرائض التي يكون تاركها مرتكبا كبيرة، كالصلوات الخمس، والجمعة، وصوم رمضان، كما قال النبي صلى الله عليه وسلم \"الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات لما بينهما ما اجتنبت الكبائر\" . وأحسن ما حُدت به الكبائر، أن الكبيرة ما فيه حد في الدنيا، أو وعيد في الآخرة، أو نفي إيمان، أو ترتيب لعنة، أو غضب عليه.\n                                    "
      },
      "originalText": "إِن تَجۡتَنِبُواْ كَبَآئِرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَيِّ‍َٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلٗا كَرِيمٗا ١٣"
    },
    {
      "number": 525,
      "text": "وَلَا تَتَمَنَّوْا مَا فَضَّلَ اللَّهُ بِهِ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِلرِّجَالِ نَصِيبٌ مِمَّا اكْتَسَبُوا ۖ وَلِلنِّسَاءِ نَصِيبٌ مِمَّا اكْتَسَبْنَ ۚ وَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ ۗ إِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 32,
      "juz": 5,
      "manzil": 1,
      "page": 83,
      "ruku": 66,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَتَمَنَّوۡاْ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖۚ لِّلرِّجَالِ نَصِيبٞ مِّمَّا ٱكۡتَسَبُواْۖ وَلِلنِّسَآءِ نَصِيبٞ مِّمَّا ٱكۡتَسَبۡنَۚ وَسۡ‍َٔلُواْ ٱللَّهَ مِن فَضۡلِهِۦٓۚ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا ٢٣\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا سفيان ، عن ابن أبي نجيح ، عن مجاهد قال : قالت أم سلمة : يا رسول الله ، يغزو الرجال ولا نغزو ، ولنا نصف الميراث . فأنزل الله عز وجل : ( ولا تتمنوا ما فضل الله به بعضكم على بعض )\nورواه الترمذي عن ابن أبي عمر ، عن سفيان ، عن ابن أبي نجيح ، عن مجاهد ، عن أم سلمة أنها قالت : قلت : يا رسول الله . . . فذكره ، وقال : غريب ورواه بعضهم عن ابن أبي نجيح ، عن مجاهد ، أن أم سلمة قالت . . .\nورواه ابن أبي حاتم ، وابن جرير وابن مردويه ، والحاكم في مستدركه ، من حديث الثوري ، عن ابن أبي نجيح ، عن مجاهد قال : قالت أم سلمة : يا رسول الله ، لا نقاتل فنستشهد ، ولا نقطع الميراث! فنزلت : ( ولا تتمنوا ما فضل الله به بعضكم على بعض للرجال نصيب مما اكتسبوا وللنساء نصيب مما اكتسبن ) ثم نزلت : ( أني لا أضيع عمل عامل منكم من ذكر أو أنثى ) [ آل عمران : 195 ] .\nثم قال ابن أبي حاتم : وكذا روى سفيان بن عيينة ، يعني عن ابن أبي نجيح بهذا اللفظ . وروى يحيى القطان ووكيع بن الجراح ، عن الثوري ، وعن ابن أبي نجيح ، عن مجاهد ، عن أم سلمة قالت : قلت : يا رسول الله . . . وروي عن مقاتل بن حيان وخصيف نحو ذلك .\nوروى ابن جرير من حديث ابن جريج ، عن عكرمة ومجاهد أنهما قالا أنزلت في أم سلمة .\nوقال عبد الرزاق : أخبرنا معمر ، عن شيخ من أهل مكة قال : نزلت هذه الآية في قول النساء : ليتنا الرجال فنجاهد كما يجاهدون ونغزو في سبيل الله عز وجل .\nوقال ابن أبي حاتم أيضا : حدثنا أحمد بن القاسم بن عطية ، حدثني أحمد بن عبد الرحمن ، حدثني أبي ، حدثنا الأشعث بن إسحاق ، عن جعفر - يعني ابن أبي المغيرة - عن سعيد بن جبير ، عن ابن عباس في ] قوله [ ( ولا تتمنوا ما فضل الله به بعضكم على بعض للرجال نصيب مما اكتسبوا وللنساء نصيب مما اكتسبن ) قال : أتت امرأة النبي صلى الله عليه وسلم فقالت : يا نبي الله ، للذكر مثل حظ الأنثيين ، وشهادة امرأتين برجل ، فنحن في العمل هكذا ، إن عملت امرأة حسنة كتبت لها نصف حسنة . فأنزل الله هذه الآية : ( ولا تتمنوا ) فإنه عدل مني ، وأنا صنعته .\nوقال السدي : قوله : في الآية ( ولا تتمنوا ما فضل الله به بعضكم على بعض ) فإن الرجال قالوا : نريد أن يكون لنا من الأجر الضعف على أجر النساء ، كما لنا في السهام سهمان . وقالت النساء : نريد أن يكون لنا أجر مثل أجر الرجال الشهداء ، فإنا لا نستطيع أن نقاتل ، ولو كتب علينا القتال لقاتلنا فأبى الله ذلك ، ولكن قال لهم : سلوني من فضلي قال : ليس بعرض الدنيا .\nوقد روي عن قتادة نحو ذلك . وقال علي بن أبي طلحة ، عن ابن عباس : قوله : ( ولا تتمنوا ما فضل الله به بعضكم على بعض ) قال ولا يتمنى الرجل فيقول : \" ليت لو أن لي مال فلان وأهله! \" فنهى الله عن ذلك ، ولكن يسأل الله من فضله .\nوكذا قال محمد بن سيرين والحسن والضحاك وعطاء نحو ذلك وهو الظاهر من الآية ولا يرد على هذا ما ثبت في الصحيح : \" لا حسد إلا في اثنتين : رجل آتاه الله مالا فسلطه على هلكته في الحق ، فيقول رجل : لو أن لي مثل ما لفلان لعملت مثله . فهما في الأجر سواء \" فإن هذا شيء غير ما نهت الآية عنه ، وذلك أن الحديث حض على تمني مثل نعمة هذا ، والآية نهت عن تمني عين نعمة هذا ، فقال : ( ولا تتمنوا ما فضل الله به بعضكم على بعض ) أي : في الأمور الدنيوية ، وكذا الدينية أيضا لحديث أم سلمة ، وابن عباس . وهكذا قال عطاء بن أبي رباح : نزلت في النهي عن تمني ما لفلان ، وفي تمني النساء أن يكن رجالا فيغزون . رواه ابن جرير .\nثم قال : ( للرجال نصيب مما اكتسبوا وللنساء نصيب مما اكتسبن ) أي : كل له جزاء على عمله بحسبه ، إن خيرا فخير ، وإن شرا فشر . وهو قول ابن جرير .\nوقيل : المراد بذلك في الميراث ، أي : كل يرث بحسبه . رواه الترمذي عن ابن عباس :\nثم أرشدهم إلى ما يصلحهم فقال : ( واسألوا الله من فضله ) ] أي [ لا تتمنوا ما فضل به بعضكم على بعض ، فإن هذا أمر محتوم ، والتمني لا يجدي شيئا ، ولكن سلوني من فضلي أعطكم; فإني كريم وهاب .\nوقد روى الترمذي ، وابن مردويه من حديث حماد بن واقد : سمعت إسرائيل عن أبي إسحاق عن أبي الأحوص ، عن عبد الله بن مسعود قال : قال رسول الله صلى الله عليه وسلم : \" سلوا الله من فضله; فإن الله يحب أن يسأل وإن أفضل العبادة انتظار الفرج \" .\nثم قال الترمذي : كذا رواه حماد بن واقد ، وليس بالحافظ ، ورواه أبو نعيم ، عن إسرائيل ، عن حكيم بن جبير ، عن رجل ، عن النبي صلى الله عليه وسلم ، وحديث أبي نعيم أشبه أن يكون أصح\nوكذا رواه ابن مردويه من حديث وكيع ، عن إسرائيل . ثم رواه من حديث قيس بن الربيع ، عن حكيم بن جبير ، عن سعيد بن جبير ، عن ابن عباس قال : قال رسول الله : \" سلوا الله من فضله ، فإن الله يحب أن يسأل ، وإن أحب عباده إليه الذي يحب الفرج \" .\nثم قال : ( إن الله كان بكل شيء عليما ) أي : هو عليم بمن يستحق الدنيا فيعطيه منها ، وبمن يستحق الفقر فيفقره ، وعليم بمن يستحق الآخرة فيقيضه لأعمالها ، وبمن يستحق الخذلان فيخذله عن تعاطي الخير وأسبابه; ولهذا قال : ( إن الله كان بكل شيء عليما )\n                                    ",
        "qortoby": "وَلَا تَتَمَنَّوۡاْ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖۚ لِّلرِّجَالِ نَصِيبٞ مِّمَّا ٱكۡتَسَبُواْۖ وَلِلنِّسَآءِ نَصِيبٞ مِّمَّا ٱكۡتَسَبۡنَۚ وَسۡ‍َٔلُواْ ٱللَّهَ مِن فَضۡلِهِۦٓۚ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا ٢٣\n                                    \n                                    \n                                    قوله تعالى : ولا تتمنوا ما فضل الله به بعضكم على بعض للرجال نصيب مما اكتسبوا وللنساء نصيب مما اكتسبن واسألوا الله من فضله إن الله كان بكل شيء عليما\nفيه أربع مسائل :\nالأولى : روى الترمذي عن أم سلمة أنها قالت : يغزو الرجال ولا يغزو النساء وإنما لنا نصف الميراث ؛ فأنزل الله تعالى : ولا تتمنوا ما فضل الله به بعضكم على بعض . قال مجاهد : وأنزل فيها إن المسلمين والمسلمات ، وكانت أم سلمة أول ظعينة قدمت المدينة مهاجرة . قال أبو عيسى : هذا حديث مرسل ، ورواه بعضهم عن ابن أبي نجيح عن مجاهد ، مرسل أن أم سلمة قالت كذا . وقال قتادة : كان الجاهلية لا يورثون النساء ولا الصبيان ؛ فلما ورثوا وجعل للذكر مثل حظ الأنثيين تمنى النساء أن لو جعل أنصباؤهن كأنصباء الرجال . وقال الرجال : إنا لنرجو أن نفضل على النساء بحسناتنا في الآخرة كما فضلنا عليهن في الميراث ؛ فنزلت ، ولا تتمنوا ما فضل الله به بعضكم على بعض .\nالثانية : قوله تعالى : \" ولا تتمنوا \" : التمني نوع من الإرادة يتعلق بالمستقبل ، كالتلهف نوع منها يتعلق بالماضي ؛ فنهى الله سبحانه المؤمنين عن التمني ؛ لأن فيه تعلق البال ونسيان الأجل . وقد اختلف العلماء هل يدخل في هذا النهي الغبطة ، وهي أن يتمنى الرجل أن يكون له حال صاحبه وإن لم يتمن زوال حاله . والجمهور على إجازة ذلك : مالك وغيره ؛ وهي المراد عند بعضهم في قوله عليه السلام لا حسد إلا في اثنتين رجل آتاه الله القرآن فهو يقوم به آناء الليل وآناء النهار ورجل آتاه الله مالا فهو ينفقه آناء الليل وآناء النهار . فمعنى قوله : لا حسد أي : لا غبطة أعظم وأفضل من الغبطة في هذين الأمرين . وقد نبه البخاري على هذا المعنى حيث بوب على هذا الحديث ( باب الاغتباط في العلم والحكمة ) قال المهلب : بين الله تعالى في هذه الآية ما لا يجوز تمنيه ، وذلك ما كان من عرض الدنيا وأشباهها . قال ابن عطية : وأما التمني في الأعمال الصالحة فذلك هو الحسن ، وأما إذا تمنى المرء على الله من غير أن يقرن أمنيته بشيء مما قدمنا ذكره فذلك جائز ؛ وذلك موجود في حديث النبي صلى الله عليه وسلم في قول : وددت أن أحيا ثم أقتل .\nقلت : هذا الحديث هو الذي صدر به البخاري كتاب التمني في صحيحه ، وهو يدل على تمني الخير وأفعال البر والرغبة فيها ، وفيه فضل الشهادة على سائر أعمال البر ؛ لأنه عليه السلام تمناها دون غيرها ، وذلك لرفيع منزلتها وكرامة أهلها ، فرزقه الله إياها ؛ لقوله : ما زالت أكلة خيبر تعاودني الآن أوان قطعت أبهري . وفي الصحيح : إن الشهيد يقال له تمن فيقول أتمنى أن أرجع إلى الدنيا حتى أقتل في سبيلك مرة أخرى . وكان رسول الله صلى الله عليه وسلم يتمنى إيمان أبي طالب وإيمان أبي لهب وصناديد قريش مع علمه بأنه لا يكون ؛ وكان يقول : واشوقاه إلى إخواني الذين يجيئون من بعدي يؤمنون بي ولم يروني . وهذا كله يدل على أن التمني لا ينهى عنه إذا لم يكن داعية إلى الحسد والتباغض ، والتمني المنهي عنه في الآية من هذا القبيل ؛ فيدخل فيه أن يتمنى الرجل حال الآخر من دين أو دنيا على أن يذهب ما عند الآخر ، وسواء تمنيت مع ذلك أن يعود إليك أو لا . وهذا هو الحسد بعينه ، وهو الذي ذمه الله تعالى بقوله : أم يحسدون الناس على ما آتاهم الله من فضله ويدخل فيه أيضا خطبة الرجل على خطبة أخيه وبيعه على بيعه ؛ لأنه داعية الحسد والمقت . وقد كره بعض العلماء الغبطة وأنها داخلة في النهي ، والصحيح جوازها على ما بينا ، وبالله توفيقنا . وقال الضحاك : لا يحل لأحد أن يتمنى مال أحد ، ألم تسمع الذين قالوا : يا ليت لنا مثل ما أوتي قارون إلى أن قال : وأصبح الذين تمنوا مكانه بالأمس حين خسف به وبداره وبأمواله لولا أن من الله علينا لخسف بنا وقال الكلبي : لا يتمن الرجل مال أخيه ولا امرأته ولا خادمه ولا دابته ؛ ولكن ليقل : اللهم ارزقني مثله . وهو كذلك في التوراة ، وكذلك قوله في القرآن واسألوا الله من فضله . وقال ابن عباس : نهى الله سبحانه أن يتمنى الرجل مال فلان وأهله ، وأمر عباده المؤمنين أن يسألوه من فضله . ومن الحجة للجمهور قوله صلى الله عليه وسلم : إنما الدنيا لأربعة نفر : رجل آتاه الله مالا وعلما فهو يتقي فيه ربه ويصل به رحمه ويعلم لله فيه حقا فهذا بأفضل المنازل ، ورجل آتاه الله علما ولم يؤته مالا فهو صادق النية يقول لو أن لي مالا لعملت فيه بعمل فلان فهو بنيته فأجرهما سواء الحديث . . . وقد تقدم . خرجه الترمذي وصححه .\nوقال الحسن : لا يتمن أحدكم المال وما يدريه لعل هلاكه فيه ؛ وهذا إنما يصح إذا تمناه للدنيا ، وأما إذا تمناه للخير فقد جوزه الشرع ، فيتمناه العبد ليصل به إلى الرب ، ويفعل الله ما يشاء .\nالثالثة : قوله تعالى : للرجال نصيب مما اكتسبوا يريد من الثواب والعقاب وللنساء كذلك ؛ قال قتادة . فللمرأة الجزاء على الحسنة بعشر أمثالها كما للرجال . وقال ابن عباس : المراد بذلك الميراث . والاكتساب على هذا القول بمعنى الإصابة ، للذكر مثل حظ الأنثيين ؛ فنهى الله عز وجل عن التمني على هذا الوجه لما فيه من دواعي الحسد ؛ ولأن الله تعالى أعلم بمصالحهم منهم ؛ فوضع القسمة بينهم على التفاوت على ما علم من مصالحهم .\nالرابعة : قوله تعالى : واسألوا الله من فضله روى الترمذي عن عبد الله قال : قال رسول الله صلى الله عليه وسلم : سلوا الله من فضله فإنه يحب أن يسأل وأفضل العبادة انتظار الفرج وخرج أيضا ابن ماجه عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : من لم يسأل الله يغضب عليه . وهذا يدل على أن الأمر بالسؤال لله تعالى واجب ؛ وقد أخذ بعض العلماء هذا المعنى فنظمه فقال :\nالله يغضب إن تركت سؤاله وبني آدم حين يسأل يغضب\nوقال أحمد بن المعذل أبو الفضل الفقيه المالكي فأحسن :\nالتمس الأرزاق عند الذي ما دونه إن سيل من حاجب\nمن يبغض التارك تسآله جودا ومن يرضى عن الطالب\nومن إذا قال جرى قوله بغير توقيع إلى كاتب\nوقد أشبعنا القول في هذا المعنى في كتاب \" قمع الحرص بالزهد والقناعة \" . وقال سعيد بن جبير : واسألوا الله من فضله العبادة ، ليس من أمر الدنيا . وقيل : سلوه التوفيق للعمل بما يرضيه . وعن عائشة رضي الله عنها أنها قالت : سلوا ربكم حتى الشبع ؛ فإنه إن لم ييسره الله عز وجل لم يتيسر . وقال سفيان بن عيينة : لم يأمر بالسؤال إلا ليعطي .\nوقرأ الكسائي وابن كثير : \" وسلوا الله من فضله \" بغير همز في جميع القرآن . الباقون بالهمز . \" واسألوا الله \" . وأصله بالهمز إلا أنه حذفت الهمزة للتخفيف . والله أعلم .\n                                    ",
        "saadi": "وَلَا تَتَمَنَّوۡاْ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖۚ لِّلرِّجَالِ نَصِيبٞ مِّمَّا ٱكۡتَسَبُواْۖ وَلِلنِّسَآءِ نَصِيبٞ مِّمَّا ٱكۡتَسَبۡنَۚ وَسۡ‍َٔلُواْ ٱللَّهَ مِن فَضۡلِهِۦٓۚ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا ٢٣\n                                        \n                                        \n                                        \n                                        ينهى تعالى المؤمنين عن أن يتمنى بعضهم ما فضل الله به غيره من الأمور الممكنة وغير الممكنة. فلا تتمنى النساء خصائص الرجال التي بها فضلهم على النساء، ولا صاحب الفقر والنقص حالة الغنى والكمال تمنيا مجردا لأن هذا هو الحسد بعينه، تمني نعمة الله على غيرك أن تكون لك ويسلب إياها. ولأنه يقتضي السخط على قدر الله والإخلاد إلى الكسل والأماني الباطلة التي لا يقترن بها عمل ولا كسب. وإنما المحمود أمران: أن يسعى العبد على حسب قدرته بما ينفعه من مصالحه الدينية والدنيوية، ويسأل الله تعالى من فضله، فلا يتكل على نفسه ولا على غير ربه. ولهذا قال تعالى: { لِلرِّجَالِ نَصِيبٌ مِمَّا اكْتَسَبُوا } أي: من أعمالهم المنتجة للمطلوب. { وَلِلنِّسَاءِ نَصِيبٌ مِمَّا اكْتَسَبْنَ } فكل منهم لا يناله غير ما كسبه وتعب فيه. { وَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ } أي: من جميع مصالحكم في الدين والدنيا. فهذا كمال العبد وعنوان سعادته لا من يترك العمل، أو يتكل على نفسه غير مفتقر لربه، أو يجمع بين الأمرين فإن هذا مخذول خاسر. وقوله: { إِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا } فيعطي من يعلمه أهلا لذلك، ويمنع من يعلمه غير مستحق.\n                                    "
      },
      "originalText": "وَلَا تَتَمَنَّوۡاْ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضٖۚ لِّلرِّجَالِ نَصِيبٞ مِّمَّا ٱكۡتَسَبُواْۖ وَلِلنِّسَآءِ نَصِيبٞ مِّمَّا ٱكۡتَسَبۡنَۚ وَسۡ‍َٔلُواْ ٱللَّهَ مِن فَضۡلِهِۦٓۚ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَيۡءٍ عَلِيمٗا ٢٣"
    },
    {
      "number": 526,
      "text": "وَلِكُلٍّ جَعَلْنَا مَوَالِيَ مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ ۚ وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ فَآتُوهُمْ نَصِيبَهُمْ ۚ إِنَّ اللَّهَ كَانَ عَلَىٰ كُلِّ شَيْءٍ شَهِيدًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 33,
      "juz": 5,
      "manzil": 1,
      "page": 83,
      "ruku": 66,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِكُلّٖ جَعَلۡنَا مَوَٰلِيَ مِمَّا تَرَكَ ٱلۡوَٰلِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِينَ عَقَدَتۡ أَيۡمَٰنُكُمۡ فَ‍َٔاتُوهُمۡ نَصِيبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدًا ٣٣\n                                    \n                                    \n                                    قال ابن عباس ، ومجاهد ، وسعيد بن جبير ، وأبو صالح ، وقتادة ، وزيد بن أسلم ، والسدي ، والضحاك ، ومقاتل بن حيان ، وغيرهم في قوله : ( ولكل جعلنا موالي ) أي : ورثة . وعن ابن عباس في رواية : أي عصبة . قال ابن جرير : والعرب تسمي ابن العم مولى ، كما قال الفضل بن عباس :\nمهلا بني عمنا مهلا موالينا لا تظهرن لنا ما كان مدفونا\nقال : ويعني بقوله : ( مما ترك الوالدان والأقربون ) من تركة والديه وأقربيه من الميراث ، فتأويل الكلام : ولكلكم - أيها الناس - جعلنا عصبة يرثونه مما ترك والداه وأقربوه من ميراثهم له .\nوقوله : ( والذين عقدت أيمانكم فآتوهم نصيبهم ) أي : والذين تحالفتم بالأيمان المؤكدة - أنتم وهم - فآتوهم نصيبهم من الميراث ، كما وعدتموهم في الأيمان المغلظة ، إن الله شاهد بينكم في تلك العهود والمعاقدات ، وقد كان هذا في ابتداء الإسلام ، ثم نسخ بعد ذلك ، وأمروا أن يوفوا لمن عاقدوا ، ولا ينشئوا بعد نزول هذه الآية معاقدة .\nقال البخاري : حدثنا الصلت بن محمد ، حدثنا أبو أسامة ، عن إدريس ، عن طلحة بن مصرف ، عن سعيد بن جبير ، عن ابن عباس : ( ولكل جعلنا موالي ) قال : ورثة ، ( والذين عقدت أيمانكم ) كان المهاجرون لما قدموا المدينة يرث المهاجري الأنصاري ، دون ذوي رحمه; للأخوة التي آخى النبي صلى الله عليه وسلم بينهم ، فلما نزلت ( ولكل جعلنا موالي ) نسخت ، ثم قال : ( والذين عقدت أيمانكم فآتوهم نصيبهم ) من النصر والرفادة والنصيحة ، وقد ذهب الميراث ويوصى له .\nثم قال البخاري : سمع أبو أسامة إدريس ، وسمع إدريس عن طلحة .\nوقال ابن أبي حاتم : حدثنا أبو سعيد الأشج ، حدثنا أبو أسامة ، حدثنا إدريس الأودي ، أخبرني طلحة بن مصرف ، عن سعيد بن جبير ، عن ابن عباس في قوله : ( والذين عقدت أيمانكم [ فآتوهم نصيبهم ] ) الآية ، قال : كان المهاجرون حين قدموا المدينة يرث المهاجري الأنصاري ، دون ذوي رحمه; بالأخوة التي آخى رسول الله صلى الله عليه وسلم بينهم ، فلما نزلت هذه الآية : ( ولكل جعلنا موالي مما ترك الوالدان والأقربون ) نسخت . ثم قال : ( والذين عقدت أيمانكم فآتوهم نصيبهم )\nوحدثنا الحسن بن محمد بن الصباح ، حدثنا حجاج ، عن ابن جريج - وعثمان بن عطاء ، عن عطاء ، عن ابن عباس قال : ( والذين عقدت أيمانكم فآتوهم نصيبهم ) فكان الرجل قبل الإسلام يعاقد الرجل ، يقول : ترثني وأرثك وكان الأحياء يتحالفون ، فقال رسول الله صلى الله عليه وسلم : \" كل حلف كان في الجاهلية أو عقد أدركه الإسلام ، فلا يزيده الإسلام إلا شدة ، ولا عقد ولا حلف في الإسلام \" . فنسختها هذه الآية : ( وأولو الأرحام بعضهم أولى ببعض في كتاب الله ) [ الأنفال : 75 ] .\nثم قال : وروي عن سعيد بن المسيب ، ومجاهد ، وعطاء ، والحسن ، وسعيد بن جبير ، وأبي صالح ، والشعبي ، وسليمان بن يسار ، وعكرمة ، والسدي ، والضحاك ، وقتادة ، ومقاتل بن حيان أنهم قالوا : هم الحلفاء .\nوقال الإمام أحمد : حدثنا عفان ، حدثنا شريك ، عن سماك ، عن عكرمة ، عن ابن عباس - ورفعه - قال : \" ما كان من حلف في الجاهلية لم يزده الإسلام إلا حدة وشدة \" .\nوقال ابن جرير : حدثنا أبو كريب ، حدثنا وكيع ، عن شريك ، عن سماك ، عن عكرمة ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم - وحدثنا أبو كريب ، حدثنا مصعب بن المقدام ، عن إسرائيل عن يونس ، عن محمد بن عبد الرحمن مولى آل طلحة ، عن عكرمة ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : \" لا حلف في الإسلام ، وكل حلف كان في الجاهلية فلم يزده الإسلام إلا شدة ، وما يسرني أن لي حمر النعم وإني نقضت الحلف الذي كان في دار الندوة \" هذا لفظ ابن جرير .\nوقال ابن جرير أيضا : حدثنا يعقوب بن إبراهيم ، حدثنا ابن علية ، عن عبد الرحمن بن إسحاق عن الزهري ، عن محمد بن جبير بن مطعم ، عن أبيه ، عن عبد الرحمن بن عوف أن رسول الله صلى الله عليه وسلم قال : \" شهدت حلف المطيبين ، وأنا غلام مع عمومتي ، فما أحب أن لي حمر النعم وأنا أنكثه \" . قال الزهري : قال رسول الله صلى الله عليه وسلم : \" لم يصب الإسلام حلفا إلا زاده شدة \" . قال : \" ولا حلف في الإسلام \" . وقد ألف النبي صلى الله عليه وسلم بين قريش والأنصار .\nوهكذا رواه الإمام أحمد عن بشر بن المفضل عن عبد الرحمن بن إسحاق ، عن الزهري ، بتمامه .\nوحدثني يعقوب بن إبراهيم ، حدثنا هشيم ، أخبرني مغيرة ، عن أبيه ، عن شعبة بن التوأم ، عن قيس بن عاصم : أنه سأل النبي صلى الله عليه وسلم عن الحلف ، قال : فقال : \" ما كان من حلف في الجاهلية فتمسكوا به ، ولا حلف في الإسلام \" .\nوكذا رواه أحمد عن هشيم .\nوحدثنا أبو كريب حدثنا وكيع ، عن داود بن أبي عبد الله ، عن ابن جدعان ، عن جدته ، عن أم سلمة : أن رسول الله صلى الله عليه وسلم قال : \" لا حلف في الإسلام ، وما كان من حلف في الجاهلية لم يزده الإسلام إلا شدة \" .\nوحدثنا أبو كريب ، حدثنا يونس بن بكير حدثنا محمد بن إسحاق ، عن عمرو بن شعيب ، عن أبيه عن جده قال : لما كان النبي صلى الله عليه وسلم بمكة عام الفتح قام خطيبا في الناس فقال : \" يا أيها الناس ، ما كان من حلف في الجاهلية ، لم يزده الإسلام إلا شدة ، ولا حلف في الإسلام \" .\nثم رواه من حديث حسين المعلم ، وعبد الرحمن بن الحارث ، عن عمرو بن شعيب ، به .\nوقال الإمام أحمد : حدثنا عبد الله بن محمد ، حدثنا ابن نمير وأبو أسامة ، عن زكريا ، عن سعد بن إبراهيم ، عن أبيه ، عن جبير بن مطعم قال : قال رسول الله صلى الله عليه وسلم \" لا حلف في الإسلام ، وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة \" .\nوهكذا رواه مسلم عن عبد الله بن محمد ، وهو أبو بكر بن أبي شيبة ، بإسناده ، مثله . ورواه أبو داود عن عثمان عن محمد بن أبي شيبة ، عن محمد بن بشر وابن نمير وأبي أسامة ، ثلاثتهم عن زكريا - وهو ابن أبي زائدة - بإسناده ، مثله .\nورواه ابن جرير من حديث محمد بن بشر ، به . ورواه النسائي من حديث إسحاق بن يوسف الأزرق ، عن زكريا ، عن سعد بن إبراهيم ، عن نافع بن جبير بن مطعم ، عن أبيه ، به .\nوقال الإمام أحمد : حدثنا هشيم ، قال : مغيرة أخبرني ، عن أبيه ، عن شعبة بن التوأم ، عن قيس بن عاصم : أنه سأل النبي صلى الله عليه وسلم عن الحلف ، فقال : \" ما كان من حلف في الجاهلية فتمسكوا به ، ولا حلف في الإسلام \" .\nوكذا رواه شعبة ، عن مغيرة - وهو ابن مقسم - عن أبيه ، به .\nوقال محمد بن إسحاق ، عن داود بن الحصين قال : كنت أقرأ على أم سعد بنت الربيع ، مع ابن ابنها موسى بن سعد - وكانت يتيمة في حجر أبي بكر - فقرأت عليها ( والذين عقدت أيمانكم ) فقالت : لا ولكن : ( والذين عقدت أيمانكم ) قالت : إنما نزلت في أبي بكر وابنه عبد الرحمن ، حين أبى أن يسلم ، فحلف أبو بكر أن لا يورثه ، فلما أسلم حين حمل على الإسلام بالسيف أمر الله أن يؤتيه نصيبه .\nرواه ابن أبي حاتم ، وهذا قول غريب ، والصحيح الأول ، وأن هذا كان في ابتداء الإسلام يتوارثون بالحلف ، ثم نسخ وبقي تأثير الحلف بعد ذلك ، وإن كانوا قد أمروا أن يوفوا بالعقود والعهود ، والحلف الذي كانوا قد تعاقدوا قبل ذلك تقدم في حديث جبير بن مطعم وغيره من الصحابة : لا حلف في الإسلام ، وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة .\nوهذا نص في الرد على ما ذهب إلى التوارث بالحلف اليوم كما هو مذهب أبي حنيفة وأصحابه ، ورواية عن أحمد بن حنبل ، رحمه الله .\nوالصحيح قول الجمهور ومالك والشافعي وأحمد في المشهور عنه; ولهذا قال تعالى : ( ولكل جعلنا موالي مما ترك الوالدان والأقربون ) أي : ورثه من أقربائه من أبويه وأقربيه ، وهم يرثونه دون سائر الناس ، كما ثبت في الصحيحين ، عن ابن عباس ; أن رسول الله صلى الله عليه وسلم قال : \" ألحقوا الفرائض بأهلها ، فما بقي فهو لأولى رجل ذكر \" أي : اقسموا الميراث على أصحاب الفروض الذين ذكرهم الله في آيتي الفرائض ، فما بقي بعد ذلك فأعطوه العصبة ، وقوله : ( والذين عقدت أيمانكم ) أي : قبل نزول هذه الآية فآتوهم نصيبهم ، أي من الميراث ، فأيما حلف عقد بعد ذلك فلا تأثير له .\nوقد قيل : إن هذه الآية نسخت الحلف في المستقبل ، وحكم الماضي أيضا ، فلا توارث به ، كما قال ابن أبي حاتم .\nحدثنا أبو سعيد الأشج ، حدثنا أبو أسامة ، حدثنا إدريس الأودي ، أخبرني طلحة بن مصرف ، عن سعيد بن جبير عن ابن عباس : ( فآتوهم نصيبهم ) قال : من النصرة والنصيحة والرفادة ، ويوصى له ، وقد ذهب الميراث .\nورواه ابن جرير ، عن أبي كريب ، عن أبي أسامة وكذا روي عن مجاهد ، وأبي مالك ، نحو ذلك .\nوقال علي بن أبي طلحة عن ابن عباس قوله : ( والذين عقدت أيمانكم ) قال : كان الرجل يعاقد الرجل ، أيهما مات ورثه الآخر ، فأنزل الله : ( وأولوا الأرحام بعضهم أولى ببعض في كتاب الله من المؤمنين والمهاجرين إلا أن تفعلوا إلى أوليائكم معروفا ) [ الأحزاب : 6 ] . يقول : إلا أن يوصوا لأوليائهم الذين عاقدوا وصية فهو لهم جائز من ثلث مال الميت ، وذلك هو المعروف .\nوهذا نص غير واحد من السلف : أنها منسوخة بقوله : ( وأولوا الأرحام بعضهم أولى ببعض في كتاب الله من المؤمنين والمهاجرين إلا أن تفعلوا إلى أوليائكم معروفا )\nوقال سعيد بن جبير : ( فآتوهم نصيبهم ) أي : من الميراث . قال : وعاقد أبو بكر مولى فورثه . رواه ابن جرير .\nوقال الزهري عن سعيد بن المسيب : أنزلت هذه الآية في الذين كانوا يتبنون رجالا غير أبنائهم ، يورثونهم ، فأنزل الله فيهم ، فجعل لهم نصيبا في الوصية ، ورد الميراث إلى الموالي في ذي الرحم والعصبة وأبى الله للمدعين ميراثا ممن ادعاهم وتبناهم ، ولكن جعل لهم نصيبا من الوصية . رواه ابن جرير .\nوقد اختار ابن جرير أن المراد بقوله : ( فآتوهم نصيبهم ) أي : من النصرة والنصيحة والمعونة ، لا أن المراد فآتوهم نصيبهم من الميراث - حتى تكون الآية منسوخة ، ولا أن ذلك كان حكما ثم نسخ ، بل إنما دلت الآية على الوفاء بالحلف المعقود على النصرة والنصيحة فقط ، فهي محكمة لا منسوخة .\nوهذا الذي قاله فيه نظر ، فإن من الحلف ما كان على المناصرة والمعاونة ، ومنه ما كان على الإرث ، كما حكاه غير واحد من السلف ، وكما قال ابن عباس : كان المهاجري يرث الأنصاري دون قراباته وذوي رحمه ، حتى نسخ ذلك ، فكيف يقول : إن هذه الآية محكمة غير منسوخة ؟ ! والله أعلم .\n                                    ",
        "qortoby": "وَلِكُلّٖ جَعَلۡنَا مَوَٰلِيَ مِمَّا تَرَكَ ٱلۡوَٰلِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِينَ عَقَدَتۡ أَيۡمَٰنُكُمۡ فَ‍َٔاتُوهُمۡ نَصِيبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدًا ٣٣\n                                    \n                                    \n                                    قوله تعالى : ولكل جعلنا موالي مما ترك الوالدان والأقربون والذين عقدت أيمانكم فآتوهم نصيبهم إن الله كان على كل شيء شهيدا\nفيه خمس مسائل :\nالأولى : بين تعالى أن لكل إنسان ورثة وموالي ؛ فلينتفع كل واحد بما قسم الله له من الميراث ، ولا يتمن مال غيره . وروى البخاري في كتاب الفرائض من رواية سعيد بن جبير عن ابن عباس : \" ولكل جعلنا موالي مما ترك الوالدان والأقربون والذين عاقدت أيمانكم \" قال : كان المهاجرون حين قدموا المدينة يرث الأنصاري المهاجري دون ذوي رحمه ؛ للأخوة التي آخى رسول الله صلى الله عليه وسلم بينهم ، فلما نزلت ولكل جعلنا موالي قال : نسختها \" والذين عاقدت أيمانكم \" . قال أبو الحسن بن بطال : وقع في جميع النسخ ولكل جعلنا موالي قال : نسختها \" والذين عاقدت أيمانكم \" . والصواب أن الآية الناسخة ولكل جعلنا موالي والمنسوخة \" والذين عاقدت أيمانكم \" ، وكذا رواه الطبري في روايته . وروي عن جمهور السلف أن الآية الناسخة لقوله : \" والذين عاقدت أيمانكم \" قوله تعالى في \" الأنفال \" : وأولوا الأرحام بعضهم أولى ببعض . روي هذا عن ابن عباس وقتادة والحسن البصري ؛ وهو الذي أثبته أبو عبيد في كتاب \" الناسخ والمنسوخ \" له . وفيها قول آخر رواه الزهري عن سعيد بن المسيب قال : أمر الله عز وجل الذين تبنوا غير أبنائهم في الجاهلية وورثوا في الإسلام أن يجعلوا لهم نصيبا في الوصية ورد الميراث إلى ذوي الرحم والعصبة . وقالت طائفة : قوله تعالى : \" والذين عاقدت أيمانكم \" محكم وليس بمنسوخ ؛ وإنما أمر الله المؤمنين أن يعطوا الحلفاء أنصباءهم من النصرة والنصيحة وما أشبه ذلك ؛ ذكره الطبري عن ابن عباس . \" والذين عاقدت أيمانكم فآتوهم نصيبهم \" من النصرة والنصيحة والرفادة ويوصي لهم وقد ذهب الميراث ؛ وهو قول مجاهد والسدي .\nقلت : واختاره النحاس ؛ ورواه عن سعيد بن جبير ، ولا يصح النسخ ؛ فإن الجمع ممكن كما بينه ابن عباس فيما ذكره الطبري ، ورواه البخاري عنه في كتاب التفسير . وسيأتي ميراث \" ذوي الأرحام \" في \" الأنفال \" إن شاء الله تعالى .\nالثانية : \" كل \" في كلام العرب معناها الإحاطة والعموم . فإذا جاءت مفردة فلا بد أن يكون في الكلام حذف عند جميع النحويين ؛ حتى إن بعضهم أجاز مررت بكل ، مثل قبل وبعد . وتقدير الحذف : ولكل أحد جعلنا موالي ، يعني ورثة . \" والذين عاقدت أيمانكم \" يعني بالحلف ؛ عن قتادة . وذلك أن الرجل كان يعاقد الرجل فيقول : دمي دمك ، وهدمي هدمك ، وثأري ثأرك ، وحربي حربك ، وسلمي سلمك ، وترثني وأرثك ، وتطلب بي وأطلب بك ، وتعقل عني وأعقل عنك ؛ فيكون للحليف السدس من ميراث الحليف ثم نسخ .\nالثالثة : قوله تعالى : \" موالي \" اعلم أن المولى لفظ مشترك يطلق على وجوه ؛ فيسمى المعتق مولى والمعتق مولى . ويقال : المولى الأسفل والأعلى أيضا . ويسمى الناصر المولى ؛ ومنه قوله تعالى : وأن الكافرين لا مولى لهم . ويسمى ابن العم مولى والجار مولى . فأما قوله تعالى : ولكل جعلنا موالي يريد عصبة ؛ لقوله عليه السلام : ما أبقت السهام فلأولى عصبة ذكر . ومن العصبات المولى الأعلى لا الأسفل ، على قول أكثر العلماء ؛ لأن المفهوم في حق المعتق أنه المنعم على المعتق ، كالموجد له ؛ فاستحق ميراثه لهذا المعنى . وحكى الطحاوي عن الحسن بن زياد أن المولى الأسفل يرث من الأعلى ؛ واحتج فيه بما روي أن رجلا أعتق عبدا له فمات المعتق ولم يترك إلا المعتق فجعل رسول الله صلى الله عليه وسلم ميراثه للغلام المعتق . قال الطحاوي : ولا معارض لهذا الحديث ، فوجب القول به ؛ ولأنه إذا أمكن إثبات الميراث للمعتق على تقدير أنه كان كالموجد له ، فهو شبيه بالأب ؛ والمولى الأسفل شبيه بالابن ؛ وذلك يقتضي التسوية بينهما في الميراث ، والأصل أن الاتصال يعم . وفي الخبر ( مولى القوم منهم ) . والذين خالفوا هذا وهم الجمهور قالوا : الميراث . يستدعي القرابة ولا قرابة ، غير أنا أثبتنا للمعتق الميراث بحكم الإنعام على المعتق ؛ فيقتضي مقابلة الإنعام بالمجازاة ، وذلك لا ينعكس في المولى الأسفل . وأما الابن فهو أولى الناس بأن يكون خليفة أبيه وقائما مقامه ، وليس المعتق صالحا لأن يقوم مقام معتقه ، وإنما المعتق قد أنعم عليه فقابله الشرع بأن جعله أحق بمولاه المعتق ، ولا يوجد هذا في المولى الأسفل ؛ فظهر الفرق بينهما والله أعلم .\nالرابعة : قوله تعالى : \" والذين عاقدت أيمانكم \" روى علي بن كبشة عن حمزة \" عقدت \" بتشديد القاف على التكثير . والمشهور عن حمزة \" عقدت أيمانكم \" مخففة القاف ، وهي قراءة عاصم والكسائي ، وهي قراءة بعيدة ؛ لأن المعاقدة لا تكون إلا من اثنين فصاعدا ، فبابها فاعل . قال أبو جعفر النحاس : وقراءة حمزة تجوز على غموض في العربية ، يكون التقدير فيها والذين عقدتهم أيمانكم الحلف ، وتعدى إلى مفعولين ؛ وتقديره : عقدت لهم أيمانكم الحلف ، ثم حذفت اللام مثل قوله تعالى : وإذا كالوهم أي كالوا لهم . وحذف المفعول الثاني ، كما يقال : كلتك أي كلت لك برا . وحذف المفعول الأول لأنه متصل في الصلة .\nالخامسة : قوله تعالى : إن الله كان على كل شيء شهيدا أي قد شهد معاقدتكم إياهم ، وهو عز وجل يحب الوفاء .\n                                    ",
        "saadi": "وَلِكُلّٖ جَعَلۡنَا مَوَٰلِيَ مِمَّا تَرَكَ ٱلۡوَٰلِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِينَ عَقَدَتۡ أَيۡمَٰنُكُمۡ فَ‍َٔاتُوهُمۡ نَصِيبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدًا ٣٣\n                                        \n                                        \n                                        \n                                        أي: { وَلِكُلٍّ } من الناس { جَعَلْنَا مَوَالِيَ } أي: يتولونه ويتولاهم بالتعزز والنصرة والمعاونة على الأمور. { مِمَّا تَرَكَ الْوَالِدَانِ وَالْأَقْرَبُونَ } وهذا يشمل سائر الأقارب من الأصول والفروع والحواشي، هؤلاء الموالي من القرابة. ثم ذكر نوعا آخر من الموالي فقال: { وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ } أي: حالفتموهم بما عقدتم معهم من عقد المحالفة على النصرة والمساعدة والاشتراك بالأموال وغير ذلك. وكل هذا من نعم الله على عباده، حيث كان الموالي يتعاونون بما لا يقدر عليه بعضهم مفردا. قال تعالى: { فَآتُوهُمْ نَصِيبَهُمْ } أي: آتوا الموالي نصيبهم الذي يجب القيام به من النصرة والمعاونة والمساعدة على غير معصية الله. والميراث للأقارب الأدنين من الموالي. { إِنَّ اللَّهَ كَانَ عَلَى كُلِّ شَيْءٍ شَهِيدًا } أي: مطلعا على كل شيء بعلمه لجميع الأمور، وبصره لحركات عباده، وسمعه لجميع أصواتهم.\n                                    "
      },
      "originalText": "وَلِكُلّٖ جَعَلۡنَا مَوَٰلِيَ مِمَّا تَرَكَ ٱلۡوَٰلِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِينَ عَقَدَتۡ أَيۡمَٰنُكُمۡ فَ‍َٔاتُوهُمۡ نَصِيبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدًا ٣٣"
    }
  ]
}