{
  "number": 84,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 527,
      "text": "الرِّجَالُ قَوَّامُونَ عَلَى النِّسَاءِ بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَا أَنْفَقُوا مِنْ أَمْوَالِهِمْ ۚ فَالصَّالِحَاتُ قَانِتَاتٌ حَافِظَاتٌ لِلْغَيْبِ بِمَا حَفِظَ اللَّهُ ۚ وَاللَّاتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ ۖ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا ۗ إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 34,
      "juz": 5,
      "manzil": 1,
      "page": 84,
      "ruku": 67,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضٖ وَبِمَآ أَنفَقُواْ مِنۡ أَمۡوَٰلِهِمۡۚ فَٱلصَّٰلِحَٰتُ قَٰنِتَٰتٌ حَٰفِظَٰتٞ لِّلۡغَيۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّٰتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِي ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُواْ عَلَيۡهِنَّ سَبِيلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِيّٗا كَبِيرٗا ٤٣\n                                    \n                                    \n                                    يقول تعالى : ( الرجال قوامون على النساء ) أي : الرجل قيم على المرأة ، أي هو رئيسها وكبيرها والحاكم عليها ومؤدبها إذا اعوجت ( بما فضل الله بعضهم على بعض ) أي : لأن الرجال أفضل من النساء ، والرجل خير من المرأة; ولهذا كانت النبوة مختصة بالرجال وكذلك الملك الأعظم; لقوله صلى الله عليه وسلم : \" لن يفلح قوم ولوا أمرهم امرأة \" رواه البخاري من حديث عبد الرحمن بن أبي بكرة ، عن أبيه وكذا منصب القضاء وغير ذلك .\n( وبما أنفقوا من أموالهم ) أي : من المهور والنفقات والكلف التي أوجبها الله عليهم لهن في كتابه وسنة نبيه صلى الله عليه وسلم ، فالرجل أفضل من المرأة في نفسه ، وله الفضل عليها والإفضال ، فناسب أن يكون قيما عليها ، كما قال ] الله [ تعالى : ( وللرجال عليهن درجة ) الآية [ البقرة : 228 ] .\nوقال علي بن أبي طلحة عن ابن عباس : ( الرجال قوامون على النساء ) يعني : أمراء عليها أي تطيعه فيما أمرها به من طاعته ، وطاعته : أن تكون محسنة إلى أهله حافظة لماله . وكذا قال مقاتل ، والسدي ، والضحاك .\nوقال الحسن البصري : جاءت امرأة إلى النبي صلى الله عليه وسلم تستعديه على زوجها أنه لطمها ، فقال رسول الله صلى الله عليه وسلم : \" القصاص \" ، فأنزل الله عز وجل : ( الرجال قوامون على النساء ) الآية ، فرجعت بغير قصاص .\nرواه ابن جرير وابن أبي حاتم ، من طرق ، عنه . وكذلك أرسل هذا الخبر قتادة ، وابن جريج والسدي ، أورد ذلك كله ابن جرير . وقد أسنده ابن مردويه من وجه آخر فقال :\nحدثنا أحمد بن علي النسائي ، حدثنا محمد بن عبد الله الهاشمي ، حدثنا محمد بن محمد الأشعث ، حدثنا موسى بن إسماعيل بن موسى بن جعفر بن محمد ، حدثني أبي ، عن جدي ، عن جعفر بن محمد ، عن أبيه ، عن علي قال : أتى النبي رجل من الأنصار بامرأة له ، فقالت : يا رسول الله ، إن زوجها فلان بن فلان الأنصاري ، وإنه ضربها فأثر في وجهها ، فقال رسول الله صلى الله عليه وسلم : \" ليس ذلك له \" . فأنزل الله : ( الرجال قوامون على النساء [ بما فضل الله بعضهم على بعض ] ) أي : قوامون على النساء في الأدب . فقال رسول الله صلى الله عليه وسلم : \" أردت أمرا وأراد الله غيره \" .\nوقال الشعبي في هذه الآية : ( الرجال قوامون على النساء بما فضل الله بعضهم على بعض وبما أنفقوا من أموالهم ) قال : الصداق الذي أعطاها ، ألا ترى أنه لو قذفها لاعنها ، ولو قذفته جلدت .\nوقوله : ( فالصالحات ) أي : من النساء ( قانتات ) قال ابن عباس وغير واحد : يعني مطيعات لأزواجهن ( حافظات للغيب ) .\nقال السدي وغيره : أي تحفظ زوجها في غيبته في نفسها وماله .\nوقوله : ( بما حفظ الله ) أي : المحفوظ من حفظه .\nقال ابن جرير : حدثني المثنى ، حدثنا أبو صالح ، حدثنا أبو معشر ، حدثنا سعيد بن أبي سعيد المقبري ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" خير النساء امرأة إذا نظرت إليها سرتك وإذا أمرتها أطاعتك وإذا غبت عنها حفظتك في نفسها ومالك \" . قال : ثم قرأ رسول الله صلى الله عليه وسلم هذه الآية : ( الرجال قوامون على النساء ) إلى آخرها .\nورواه ابن أبي حاتم ، عن يونس بن حبيب ، عن أبي داود الطيالسي ، عن محمد بن عبد الرحمن بن أبي ذئب ، عن سعيد المقبري ، به مثله سواء .\nوقال الإمام أحمد : حدثنا يحيى بن إسحاق ، حدثنا ابن لهيعة ، عن عبيد الله بن أبي جعفر : أن ابن قارظ أخبره : أن عبد الرحمن بن عوف قال : قال رسول الله صلى الله عليه وسلم : \" إذا صلت المرأة خمسها ، وصامت شهرها وحفظت فرجها; وأطاعت زوجها قيل لها : ادخلي الجنة من أي أبواب الجنة شئت \" .\nتفرد به أحمد من طريق عبد الله بن قارظ عن عبد الرحمن بن عوف .\nوقوله تعالى ( واللاتي تخافون نشوزهن ) أي : والنساء اللاتي تتخوفون أن ينشزن على أزواجهن . والنشوز : هو الارتفاع ، فالمرأة الناشز هي المرتفعة على زوجها ، التاركة لأمره ، المعرضة عنه ، المبغضة له . فمتى ظهر له منها أمارات النشوز فليعظها وليخوفها عقاب الله في عصيانه فإن الله قد أوجب حق الزوج عليها وطاعته ، وحرم عليها معصيته لما له عليها من الفضل والإفضال . وقد قال رسول الله صلى الله عليه وسلم : \" لو كنت آمرا أحدا أن يسجد لأحد لأمرت المرأة أن تسجد لزوجها ، من عظم حقه عليها \" وروى البخاري ، عن أبي هريرة ، رضي الله عنه ، قال : قال رسول الله صلى الله عليه وسلم : \" إذا دعا الرجل امرأته إلى فراشه فأبت عليه ، لعنتها الملائكة حتى تصبح \" ورواه مسلم ، ولفظه : \" إذا باتت المرأة هاجرة فراش زوجها ، لعنتها الملائكة حتى تصبح \" ; ولهذا قال تعالى : ( واللاتي تخافون نشوزهن فعظوهن ) .\nوقوله : ( واهجروهن في المضاجع ) قال علي بن أبي طلحة ، عن ابن عباس : الهجران هو أن لا يجامعها ، ويضاجعها على فراشها ويوليها ظهره . وكذا قال غير واحد ، وزاد آخرون - منهم : السدي ، والضحاك ، وعكرمة ، وابن عباس في رواية - : ولا يكلمها مع ذلك ولا يحدثها .\nوقال علي بن أبي طلحة أيضا ، عن ابن عباس : يعظها ، فإن هي قبلت وإلا هجرها في المضجع ، ولا يكلمها من غير أن يذر نكاحها ، وذلك عليها شديد .\nوقال مجاهد ، والشعبي ، وإبراهيم ، ومحمد بن كعب ، ومقسم ، وقتادة : الهجر : هو أن لا يضاجعها .\nوقد قال أبو داود : حدثنا موسى بن إسماعيل ، حدثنا حماد ، عن علي بن زيد ، عن أبي حرة الرقاشي ، عن عمه أن النبي صلى الله عليه وسلم قال : \" فإن خفتم نشوزهن فاهجروهن في المضاجع \" قال حماد : يعني النكاح .\nوفي السنن والمسند عن معاوية بن حيدة القشيري أنه قال : يا رسول الله ، ما حق امرأة أحدنا ؟ قال : \" أن تطعمها إذا طعمت ، وتكسوها إذا اكتسيت ، ولا تضرب الوجه ولا تقبح ، ولا تهجر إلا في البيت \" .\nوقوله : ( واضربوهن ) أي : إذا لم يرتدعن بالموعظة ولا بالهجران ، فلكم أن تضربوهن ضربا غير مبرح ، كما ثبت في صحيح مسلم عن جابر عن النبي صلى الله عليه وسلم : أنه قال في حجة الوداع : \" واتقوا الله في النساء ، فإنهن عندكم عوان ، ولكم عليهن ألا يوطئن فرشكم أحدا تكرهونه ، فإن فعلن فاضربوهن ضربا غير مبرح ، ولهن رزقهن وكسوتهن بالمعروف \" .\nوكذا قال ابن عباس وغير واحد : ضربا غير مبرح . قال الحسن البصري : يعني غير مؤثر . قال الفقهاء : هو ألا يكسر فيها عضوا ولا يؤثر فيها شيئا .\nوقال علي بن أبي طلحة عن ابن عباس : يهجرها في المضجع ، فإن أقبلت وإلا فقد أذن الله لك أن تضرب ضربا غير مبرح ، ولا تكسر لها عظما ، فإن أقبلت وإلا فقد حل لك منها الفدية .\nوقال سفيان بن عيينة ، عن الزهري ، عن عبد الله بن عبد الله بن عمر ، عن إياس بن عبد الله بن أبي ذباب قال : قال رسول الله صلى الله عليه وسلم : \" لا تضربوا إماء الله \" . فجاء عمر إلى رسول الله صلى الله عليه وسلم فقال : ذئرت النساء على أزواجهن . فرخص في ضربهن ، فأطاف بآل رسول الله صلى الله عليه وسلم نساء كثير يشكون أزواجهن ، فقال رسول الله صلى الله عليه وسلم : \" لقد أطاف بآل محمد نساء كثير يشكون أزواجهن ، ليس أولئك بخياركم \" رواه أبو داود والنسائي وابن ماجه .\nوقال الإمام أحمد : حدثنا سليمان بن داود - يعني أبا داود الطيالسي - حدثنا أبو عوانة ، عن داود الأودي ، عن عبد الرحمن المسلي عن الأشعث بن قيس ، قال ضفت عمر ، فتناول امرأته فضربها ، وقال : يا أشعث ، احفظ عني ثلاثا حفظتهن عن رسول الله صلى الله عليه وسلم : لا تسأل الرجل فيم ضرب امرأته ، ولا تنم إلا على وتر . . . ونسي الثالثة .\nوكذا رواه أبو داود والنسائي وابن ماجه ، من حديث عبد الرحمن بن مهدي ، عن أبي عوانة ، عن داود الأودي ، به .\nوقوله : ( فإن أطعنكم فلا تبغوا عليهن سبيلا ) أي : فإذا أطاعت المرأة زوجها في جميع ما يريد منها ، مما أباحه الله له منها ، فلا سبيل له عليها بعد ذلك ، وليس له ضربها ولا هجرانها .\nوقوله : ( إن الله كان عليا كبيرا ) تهديد للرجال إذا بغوا على النساء من غير سبب ، فإن الله العلي الكبير وليهن وهو منتقم ممن ظلمهن وبغى عليهن .\n                                    ",
        "qortoby": "ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضٖ وَبِمَآ أَنفَقُواْ مِنۡ أَمۡوَٰلِهِمۡۚ فَٱلصَّٰلِحَٰتُ قَٰنِتَٰتٌ حَٰفِظَٰتٞ لِّلۡغَيۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّٰتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِي ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُواْ عَلَيۡهِنَّ سَبِيلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِيّٗا كَبِيرٗا ٤٣\n                                    \n                                    \n                                    قوله تعالى : الرجال قوامون على النساء بما فضل الله بعضهم على بعض وبما أنفقوا من أموالهم فالصالحات قانتات حافظات للغيب بما حفظ الله واللاتي تخافون نشوزهن فعظوهن واهجروهن في المضاجع واضربوهن فإن أطعنكم فلا تبغوا عليهن سبيلا إن الله كان عليا كبيرا\nفيه إحدى عشرة مسألة :\nالأولى : قوله تعالى : الرجال قوامون على النساء ابتداء وخبر ، أي يقومون بالنفقة عليهن والذب عنهن ؛ وأيضا فإن فيهم الحكام والأمراء ومن يغزو ، وليس ذلك في النساء . يقال : قوام وقيم . والآية نزلت في سعد بن الربيع نشزت عليه امرأته حبيبة بنت زيد بن خارجة بن أبي زهير فلطمها ؛ فقال أبوها : يا رسول الله ، أفرشته كريمتي فلطمها ! فقال عليه السلام : لتقتص من زوجها . فانصرفت مع أبيها لتقتص منه ، فقال عليه السلام : ارجعوا هذا جبريل أتاني فأنزل الله هذه الآية ؛ فقال عليه السلام : أردنا أمرا وأراد الله غيره . وفي رواية أخرى : أردت شيئا وما أراد الله خير . ونقض الحكم الأول . وقد قيل : إن في هذا الحكم المردود نزل ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه . ذكر إسماعيل بن إسحاق قال : حدثنا حجاج بن المنهال وعارم بن الفضل - واللفظ لحجاج - قال حدثنا جرير بن حازم قال : سمعت الحسن يقول : إن امرأة أتت النبي صلى الله عليه وسلم فقالت : إن زوجي لطم وجهي . فقال : بينكما القصاص ، فأنزل الله تعالى : ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه . وأمسك النبي صلى الله عليه وسلم حتى نزل : الرجال قوامون على النساء . وقال أبو روق : نزلت في جميلة بنت أبي وفي زوجها ثابت بن قيس بن شماس . وقال الكلبي : نزلت في عميرة بنت محمد بن مسلمة وفي زوجها سعد بن الربيع . وقيل : سببها قول أم سلمة المتقدم . ووجه النظم أنهن تكلمن في تفضيل الرجال على النساء في الإرث ، فنزلت ولا تتمنوا الآية . ثم بين تعالى أن تفضيلهم عليهن في الإرث لما على الرجال من المهر والإنفاق ؛ ثم فائدة تفضيلهم عائدة إليهن . ويقال : إن الرجال لهم فضيلة في زيادة العقل والتدبير ؛ فجعل لهم حق القيام عليهن لذلك . وقيل : للرجال زيادة قوة في النفس والطبع ما ليس للنساء ؛ لأن طبع الرجال غلب عليه الحرارة واليبوسة ، فيكون فيه قوة وشدة ، وطبع النساء غلب عليه الرطوبة والبرودة ، فيكون فيه معنى اللين والضعف ؛ فجعل لهم حق القيام عليهن بذلك ، وبقوله تعالى : وبما أنفقوا من أموالهم .\nالثانية : ودلت هذه الآية على تأديب الرجال نساءهم ، فإذا حفظن حقوق الرجال فلا ينبغي أن يسيء الرجل عشرتها . و \" قوام \" فعال للمبالغة ؛ من القيام على الشيء والاستبداد بالنظر فيه وحفظه بالاجتهاد . فقيام الرجال على النساء هو على هذا الحد ؛ وهو أن يقوم بتدبيرها وتأديبها وإمساكها في بيتها ومنعها من البروز ، وأن عليها طاعته وقبول أمره ما لم تكن معصية ؛ وتعليل ذلك بالفضيلة والنفقة والعقل والقوة في أمر الجهاد والميراث والأمر بالمعروف والنهي عن المنكر . وقد راعى بعضهم في التفضيل اللحية - وليس بشيء ؛ فإن اللحية قد تكون وليس معها شيء مما ذكرنا . وقد مضى الرد على هذا في \" البقرة \" .\nالثالثة : قوله تعالى : وبما أنفقوا من أموالهم أنه متى عجز عن نفقتها لم يكن قواما عليها ، وإذا لم يكن قواما عليها كان لها فسخ العقد ؛ لزوال المقصود الذي شرع لأجله النكاح . وفيه دلالة واضحة من هذا الوجه على ثبوت فسخ النكاح عند الإعسار بالنفقة والكسوة ؛ وهو مذهب مالك والشافعي . وقال أبو حنيفة : لا يفسخ ؛ لقوله تعالى : وإن كان ذو عسرة فنظرة إلى ميسرة وقد تقدم القول في هذا في هذه السورة .\nالرابعة : قوله تعالى : فالصالحات قانتات حافظات للغيب هذا كله خبر ، ومقصوده الأمر بطاعة الزوج والقيام بحقه في ماله وفي نفسها في حال غيبة الزوج . وفي مسند أبي داود الطيالسي عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : خير النساء التي إذا نظرت إليها سرتك وإذا أمرتها أطاعتك وإذا غبت عنها حفظتك في نفسها ومالك قال : وتلا هذه الآية الرجال قوامون على النساء إلى آخر الآية . وقال صلى الله عليه وسلم لعمر : ألا أخبرك بخير ما يكنزه المرء المرأة الصالحة إذا نظر إليها سرته وإذا أمرها أطاعته وإذا غاب عنها حفظته أخرجه أبو داود . وفي مصحف ابن مسعود \" فالصوالح قوانت حوافظ \" . وهذا بناء يختص بالمؤنث . قال ابن جني : والتكسير أشبه لفظا بالمعنى ؛ إذ هو يعطي الكثرة وهي المقصود هاهنا . وما في قوله : بما حفظ الله مصدرية ، أي بحفظ الله لهن . ويصح أن تكون بمعنى الذي ، ويكون العائد في حفظ ضمير نصب . وفي قراءة أبي جعفر \" بما حفظ الله \" بالنصب . قال النحاس : الرفع أبين ؛ أي حافظات لمغيب أزواجهن بحفظ الله ومعونته وتسديده . وقيل : بما حفظهن الله في مهورهن وعشرتهن . وقيل : بما استحفظهن الله إياه من أداء الأمانات إلى أزواجهن . ومعنى قراءة النصب : بحفظهن الله ؛ أي بحفظهن أمره أو دينه . وقيل في التقدير : بما حفظن الله ، ثم وحد الفعل ؛ كما قيل :\nفإن الحوادث أودى بها\nوقيل : المعنى بحفظ الله ؛ مثل حفظت الله .\nالخامسة : قوله تعالى : واللاتي تخافون نشوزهن اللاتي جمع التي وقد تقدم . قال ابن عباس : تخافون بمعنى تعلمون وتتيقنون . وقيل هو على بابه . والنشوز العصيان ؛ مأخوذ من النشز ، وهو ما ارتفع من الأرض . يقال : نشز الرجل ينشز وينشز إذا كان قاعدا فنهض قائما ؛ ومنه قوله عز وجل : وإذا قيل انشزوا فانشزوا أي ارتفعوا وانهضوا إلى حرب أو أمر من أمور الله تعالى . فالمعنى : أي تخافون عصيانهن وتعاليهن عما أوجب الله عليهن من طاعة الأزواج . وقال أبو منصور اللغوي : النشوز كراهية كل واحد من الزوجين صاحبه ؛ يقال : نشزت تنشز فهي ناشز بغير هاء . ونشصت تنشص ، وهي السيئة للعشرة . وقال ابن فارس : ونشزت المرأة استصعبت على بعلها ، ونشز بعلها عليها إذا ضربها وجفاها . قال ابن دريد : نشزت المرأة ونشست ونشصت بمعنى واحد .\nالسادسة : قوله تعالى : فعظوهن أي بكتاب الله ؛ أي ذكروهن ما أوجب الله عليهن من حسن الصحبة وجميل العشرة للزوج ، والاعتراف بالدرجة التي له عليها ، ويقول : إن النبي صلى الله عليه وسلم قال : لو أمرت أحدا أن يسجد لأحد لأمرت المرأة أن تسجد لزوجها . وقال : لا تمنعه نفسها وإن كانت على ظهر قتب . وقال : أيما امرأة باتت هاجرة فراش زوجها لعنتها الملائكة حتى تصبح في رواية حتى تراجع وتضع يدها في يده . وما كان مثل هذا .\nالسابعة : قوله تعالى : واهجروهن في المضاجع وقرأ ابن مسعود والنخعي وغيرهما \" في المضجع \" على الإفراد ؛ كأنه اسم جنس يؤدي عن الجمع . والهجر في المضاجع هو أن يضاجعها ويوليها ظهره ولا يجامعها ؛ عن ابن عباس وغيره . وقال مجاهد : جنبوا مضاجعهن ؛ فيتقدر على هذا الكلام حذف ، ويعضده اهجروهن من الهجران ، وهو البعد ؛ يقال : هجره أي تباعد ونأى عنه . ولا يمكن بعدها إلا بترك مضاجعتها . وقال معناه إبراهيم النخعي والشعبي وقتادة والحسن البصري ، ورواه ابن وهب وابن القاسم عن مالك ، واختاره ابن العربي وقال : حملوا الأمر على الأكثر الموفي . ويكون هذا القول كما تقول : اهجره في الله . وهذا أصل مالك .\nقلت : هذا قول حسن ؛ فإن الزوج إذا أعرض عن فراشها فإن كانت محبة للزوج فذلك يشق عليها فترجع للصلاح ، وإن كانت مبغضة فيظهر النشوز منها ؛ فيتبين أن النشوز من قبلها . وقيل : اهجروهن من الهجر وهو القبيح من الكلام ، أي غلظوا عليهن في القول وضاجعوهن للجماع وغيره ؛ قال معناه سفيان ، وروي عن ابن عباس . وقيل : أي شدوهن وثاقا في بيوتهن ؛ من قولهم : هجر البعير أي ربطه بالهجار ، وهو حبل يشد به البعير ، وهو اختيار الطبري وقدح في سائر الأقوال . وفي كلامه في هذا الموضع نظر . وقد رد عليه القاضي أبو بكر بن العربي في أحكامه فقال : يا لها من هفوة من عالم بالقرآن والسنة ! والذي حمله على هذا التأويل حديث غريب رواه ابن وهب عن مالك أن أسماء بنت أبي بكر الصديق امرأة الزبير بن العوام كانت تخرج حتى عوتب في ذلك . قال : وعتب عليها وعلى ضرتها ، فعقد شعر واحدة بالأخرى ثم ضربهما ضربا شديدا ، وكانت الضرة أحسن اتقاء ، وكانت أسماء لا تتقي فكان الضرب بها أكثر ؛ فشكت إلى أبيها أبي بكر رضي الله عنه فقال لها : أي بنية اصبري فإن الزبير رجل صالح ، ولعله أن يكون زوجك في الجنة ؛ ولقد بلغني أن الرجل إذا ابتكر بامرأة تزوجها في الجنة . فرأى الربط والعقد مع احتمال اللفظ مع فعل الزبير فأقدم على هذا التفسير . وهذا الهجر غايته عند العلماء شهر ؛ كما فعل النبي صلى الله عليه وسلم حين أسر إلى حفصة فأفشته إلى عائشة ، وتظاهرتا عليه . ولا يبلغ به الأربعة الأشهر التي ضرب الله أجلا عذرا للمولى .\nالثامنة : قوله تعالى : واضربوهن أمر الله أن يبدأ النساء بالموعظة أولا ثم بالهجران ، فإن لم يتجعا فالضرب ؛ فإنه هو الذي يصلحها له ويحملها على توفية حقه . والضرب في هذه الآية هو ضرب الأدب غير المبرح ، وهو الذي لا يكسر عظما ولا يشين جارحة كاللكزة ونحوها ؛ فإن المقصود منه الصلاح لا غير . فلا جرم إذا أدى إلى الهلاك وجب الضمان ، وكذلك القول في ضرب المؤدب غلامه لتعليم القرآن والأدب . وفي صحيح مسلم : اتقوا الله في النساء فإنكم أخذتموهن بأمانة الله واستحللتم فروجهن بكلمة الله ولكم عليهن ألا يوطئن فرشكم أحدا تكرهونه فإن فعلن فاضربوهن ضربا غير مبرح الحديث . أخرجه من حديث جابر الطويل في الحج ، أي لا يدخلن منازلكم أحدا ممن تكرهونه من الأقارب والنساء الأجانب . وعلى هذا يحمل ما رواه الترمذي وصححه عن عمرو بن الأحوص أنه شهد حجة الوداع مع رسول الله صلى الله عليه وسلم ، فحمد الله وأثنى عليه وذكر ووعظ فقال : ألا واستوصوا بالنساء خيرا فإنهن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم من تكرهون ، ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن . وقال : هذا حديث حسن صحيح . فقوله : بفاحشة مبينة يريد لا يدخلن من يكرهه أزواجهن ولا يغضبنهم . وليس المراد بذلك الزنى ؛ فإن ذلك محرم ويلزم عليه الحد . وقد قال عليه الصلاة والسلام : اضربوا النساء إذا عصينكم في معروف ضربا غير مبرح . قال عطاء : قلت لابن عباس ما الضرب غير المبرح ؟ قال بالسواك ونحوه . وروي أن عمر رضي الله عنه ضرب امرأته فعذل في ذلك فقال : سمعت رسول الله صلى الله عليه وسلم يقول : لا يسأل الرجل فيم ضرب أهله .\nالتاسعة : قوله تعالى : فإن أطعنكم أي تركوا النشوز . فلا تبغوا عليهن سبيلا أي لا تجنوا عليهن بقول أو فعل . وهذا نهي عن ظلمهن بعد تقرير الفضل عليهن والتمكين من أدبهن . وقيل : المعنى لا تكلفوهن الحب لكم فإنه ليس إليهن .\nالعاشرة : قوله تعالى : إن الله كان عليا كبيرا إشارة إلى الأزواج بخفض الجناح ولين الجانب ؛ أي إن كنتم تقدرون عليهن فتذكروا قدرة الله ؛ فيده بالقدرة فوق كل يد . فلا يستعلي أحد على امرأته فالله بالمرصاد فلذلك حسن الاتصاف ، هنا بالعلو والكبر .\nالحادية عشرة : وإذا ثبت هذا فاعلم . أن الله عز وجل لم يأمر في شيء من كتابه بالضرب صراحا إلا هنا وفي الحدود العظام ؛ فساوى معصيتهن بأزواجهن بمعصية الكبائر ، وولى الأزواج ذلك دون الأئمة ، وجعله لهم دون القضاة بغير شهود ولا بينات ائتمانا من الله تعالى للأزواج على النساء . قال المهلب : إنما جوز ضرب النساء من أجل امتناعهن على أزواجهن في المباضعة . واختلف في وجوب ضربها في الخدمة ، والقياس يوجب أنه إذا جاز ضربها في المباضعة جاز ضربها في الخدمة الواجبة للزوج عليها بالمعروف . وقال ابن خويز منداد . والنشوز يسقط النفقة وجميع الحقوق الزوجية ، ويجوز معه أن يضربها الزوج ضرب الأدب غير المبرح ، والوعظ والهجر حتى ترجع عن نشوزها ، فإذا رجعت عادت حقوقها ؛ وكذلك كل ما اقتضى الأدب فجائز للزوج تأديبها . ويختلف الحال في أدب الرفيعة والدنيئة ؛ فأدب الرفيعة العذل ، وأدب الدنيئة السوط . وقد قال النبي صلى الله عليه وسلم : رحم الله امرأ علق سوطه وأدب أهله . وقال : إن أبا جهم لا يضع عصاه عن عاتقه . وقال بشار :\nالحر يلحى والعصا للعبد\nيلحى أي يلام ؛ وقال ابن دريد :\nواللوم للحر مقيم رادع والعبد لا يردعه إلا العصا\nقال ابن المنذر : اتفق أهل العلم على وجوب نفقات الزوجات على أزواجهن إذا كانوا جميعا بالغين إلا الناشز منهن الممتنعة . وقال أبو عمر : من نشزت عنه امرأته بعد دخوله سقطت عنه نفقتها إلا أن تكون حاملا . وخالف ابن القاسم جماعة الفقهاء في نفقة الناشز فأوجبها . وإذا عادت الناشز إلى زوجها وجب في المستقبل نفقتها . ولا تسقط نفقة المرأة عن زوجها لشيء غير النشوز ؛ لا من مرض ولا حيض ولا نفاس ولا صوم ولا حج ولا مغيب زوجها ولا حبسه عنها في حق أو جور غير ما ذكرنا . والله أعلم .\n                                    ",
        "saadi": "ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضٖ وَبِمَآ أَنفَقُواْ مِنۡ أَمۡوَٰلِهِمۡۚ فَٱلصَّٰلِحَٰتُ قَٰنِتَٰتٌ حَٰفِظَٰتٞ لِّلۡغَيۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّٰتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِي ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُواْ عَلَيۡهِنَّ سَبِيلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِيّٗا كَبِيرٗا ٤٣\n                                        \n                                        \n                                        \n                                        يخبر تعالى أن الرِّجَال { قَوَّامُونَ عَلَى النِّسَاءِ } أي: قوامون عليهن بإلزامهن بحقوق الله تعالى، من المحافظة على فرائضه وكفهن عن المفاسد، والرجال عليهم أن يلزموهن بذلك، وقوامون عليهن أيضا بالإنفاق عليهن، والكسوة والمسكن، ثم ذكر السبب الموجب لقيام الرجال على النساء فقال: { بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَى بَعْضٍ وَبِمَا أَنفَقُوا مِنْ أَمْوَالِهِمْ } أي: بسبب فضل الرجال على النساء وإفضالهم عليهن، فتفضيل الرجال على النساء من وجوه متعددة: من كون الولايات مختصة بالرجال، والنبوة، والرسالة، واختصاصهم بكثير من العبادات كالجهاد والأعياد والجمع. وبما خصهم الله به من العقل والرزانة والصبر والجلد الذي ليس للنساء مثله. وكذلك خصهم بالنفقات على الزوجات بل وكثير من النفقات يختص بها الرجال ويتميزون عن النساء. ولعل هذا سر قوله: { وَبِمَا أَنْفَقُوا } وحذف المفعول ليدل على عموم النفقة. فعلم من هذا كله أن الرجل كالوالي والسيد لامرأته، وهي عنده عانية أسيرة خادمة،فوظيفته أن يقوم بما استرعاه الله به. ووظيفتها: القيام بطاعة ربها وطاعة زوجها فلهذا قال: { فَالصَّالِحَاتُ قَانِتَاتٌ } أي: مطيعات لله تعالى { حَافِظَاتٌ لِلْغَيْبِ } أي: مطيعات لأزواجهن حتى في الغيب تحفظ بعلها بنفسها وماله، وذلك بحفظ الله لهن وتوفيقه لهن، لا من أنفسهن، فإن النفس أمارة بالسوء، ولكن من توكل على الله كفاه ما أهمه من أمر دينه ودنياه. ثم قال: { وَاللَّاتِي تَخَافُونَ نُشُوزَهُنَّ } أي: ارتفاعهن عن طاعة أزواجهن بأن تعصيه بالقول أو الفعل فإنه يؤدبها بالأسهل فالأسهل، { فَعِظُوهُنَّ } أي: ببيان حكم الله في طاعة الزوج ومعصيته والترغيب في الطاعة، والترهيب من معصيته، فإن انتهت فذلك المطلوب، وإلا فيهجرها الزوج في المضجع، بأن لا يضاجعها، ولا يجامعها بمقدار ما يحصل به المقصود، وإلا ضربها ضربًا غير مبرح، فإن حصل المقصود بواحد من هذه الأمور وأطعنكم { فَلَا تَبْغُوا عَلَيْهِنَّ سَبِيلًا } أي: فقد حصل لكم ما تحبون فاتركوا معاتبتها على الأمور الماضية، والتنقيب عن العيوب التي يضر ذكرها ويحدث بسببه الشر. { إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا } أي: له العلو المطلق بجميع الوجوه والاعتبارات، علو الذات وعلو القدر وعلو القهر الكبير الذي لا أكبر منه ولا أجل ولا أعظم، كبير الذات والصفات.\n                                    "
      },
      "originalText": "ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضٖ وَبِمَآ أَنفَقُواْ مِنۡ أَمۡوَٰلِهِمۡۚ فَٱلصَّٰلِحَٰتُ قَٰنِتَٰتٌ حَٰفِظَٰتٞ لِّلۡغَيۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّٰتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِي ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُواْ عَلَيۡهِنَّ سَبِيلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِيّٗا كَبِيرٗا ٤٣"
    },
    {
      "number": 528,
      "text": "وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِنْ أَهْلِهِ وَحَكَمًا مِنْ أَهْلِهَا إِنْ يُرِيدَا إِصْلَاحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 35,
      "juz": 5,
      "manzil": 1,
      "page": 84,
      "ruku": 67,
      "hizbQuarter": 33,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنۡ خِفۡتُمۡ شِقَاقَ بَيۡنِهِمَا فَٱبۡعَثُواْ حَكَمٗا مِّنۡ أَهۡلِهِۦ وَحَكَمٗا مِّنۡ أَهۡلِهَآ إِن يُرِيدَآ إِصۡلَٰحٗا يُوَفِّقِ ٱللَّهُ بَيۡنَهُمَآۗ إِنَّ ٱللَّهَ كَانَ عَلِيمًا خَبِيرٗا ٥٣\n                                    \n                                    \n                                    ذكر [ تعالى ] الحال الأول ، وهو إذا كان النفور والنشوز من الزوجة ، ثم ذكر الحال الثاني وهو : إذا كان النفور من الزوجين فقال تعالى : ( وإن خفتم شقاق بينهما فابعثوا حكما من أهله وحكما من أهلها )\nقال الفقهاء : إذا وقع الشقاق بين الزوجين ، أسكنهما الحاكم إلى جنب ثقة ، ينظر في أمرهما ، ويمنع الظالم منهما من الظلم ، فإن تفاقم أمرهما وطالت خصومتهما ، بعث الحاكم ثقة من أهل المرأة ، وثقة من قوم الرجل ، ليجتمعا وينظرا في أمرهما ، ويفعلا ما فيه المصلحة مما يريانه من التفريق أو التوفيق ، وتشوف الشارع إلى التوفيق; ولهذا قال : ( إن يريدا إصلاحا يوفق الله بينهما )\nوقال علي بن أبي طلحة ، عن ابن عباس : أمر الله عز وجل ، أن يبعثوا رجلا صالحا من أهل الرجل ، ورجلا مثله من أهل المرأة ، فينظران أيهما المسيء ، فإن كان الرجل هو المسيء ، حجبوا عنه امرأته وقصروه على النفقة ، وإن كانت المرأة هي المسيئة ، قصروها على زوجها ومنعوها النفقة . فإن اجتمع رأيهما على أن يفرقا أو يجمعا ، فأمرهما جائز . فإن رأيا أن يجمعا ، فرضي أحد الزوجين وكره ذلك الآخر ، ثم مات أحدهما ، فإن الذي رضي يرث الذي كره ولا يرث الكاره الراضي . رواه ابن أبي حاتم وابن جرير .\nوقال عبد الرزاق : أخبرنا معمر ، عن ابن طاوس ، عن عكرمة بن خالد ، عن ابن عباس قال : بعثت أنا ومعاوية حكمين ، قال معمر : بلغني أن عثمان بعثهما ، وقال لهما : إن رأيتما أن تجمعا جمعتما ، وإن رأيتما أن تفرقا فرقتما .\nوقال : أنبأنا ابن جريج ، حدثني ابن أبي مليكة ، أن عقيل بن أبي طالب تزوج فاطمة بنت عتبة بن ربيعة فقالت : تصير إلي وأنفق عليك . فكان إذا دخل عليها قالت : أين عتبة بن ربيعة وشيبة بن ربيعة ؟ قال : على يسارك في النار إذا دخلت . فشدت عليها ثيابها فجاءت عثمان ، فذكرت له ذلك فضحك وأرسل ابن عباس ومعاوية ، فقال ابن عباس : لأفرقن بينهما . فقال معاوية : ما كنت لأفرق بين شيخين من بني عبد مناف . فأتياهما فوجداهما قد أغلقا عليهما أبوابهما فرجعا .\nوقال عبد الرزاق : أخبرنا معمر ، عن أيوب ، عن محمد بن سيرين ، عن عبيدة قال : شهدت عليا وجاءته امرأة وزوجها ، مع كل واحد منهما فئام من الناس ، فأخرج هؤلاء حكما وهؤلاء حكما ، فقال علي للحكمين : أتدريان ما عليكما ؟ إن عليكما إن رأيتما أن تجمعا ، جمعتما . فقالت المرأة : رضيت بكتاب الله لي وعلي . وقال الزوج : أما الفرقة فلا . فقال علي : كذبت ، والله لا تبرح حتى ترضى بكتاب الله ، عز وجل ، لك وعليك .\nرواه ابن أبي حاتم ، ورواه ابن جرير ، عن يعقوب ، عن ابن علية ، عن أيوب ، عن ابن سيرين ، عن عبيدة ، عن علي ، مثله . ورواه من وجه آخر ، عن ابن سيرين ، عن عبيدة ، عن علي ، به .\nوهذا مذهب جمهور العلماء : أن الحكمين إليهما الجمع والتفرقة ، حتى قال إبراهيم النخعي : إن شاء الحكمان أن يفرقا بينهما بطلقة أو بطلقتين أو ثلاث فعلا . وهو رواية عن مالك .\nوقال الحسن البصري : الحكمان يحكمان في الجمع ولا يحكمان في التفريق ، وكذا قال قتادة ، وزيد بن أسلم . وبه قال أحمد بن حنبل ، وأبو ثور ، وداود ، ومأخذهم قوله تعالى : ( إن يريدا إصلاحا يوفق الله بينهما ) ولم يذكر التفريق .\nوأما إذا كانا وكيلين من جهة الزوجين ، فإنه ينفذ حكمهما في الجمع والتفرقة بلا خلاف .\nوقد اختلف الأئمة في الحكمين : هل هما منصوبان من عند الحاكم ، فيحكمان وإن لم يرض الزوجان ، أو هما وكيلان من جهة الزوجين ؟ على قولين : فالجمهور على الأول; لقوله تعالى : ( فابعثوا حكما من أهله وحكما من أهلها ) فسماهما حكمين ، ومن شأن الحكم أن يحكم بغير رضا المحكوم عليه ، وهذا ظاهر الآية ، والجديد من مذهب الشافعي ، وهو قول أبي حنيفة وأصحابه .\nالثاني منهما ، بقول علي ، رضي الله عنه ، للزوج - حين قال : أما الفرقة فلا - قال : كذبت ، حتى تقر بما أقرت به ، قالوا : فلو كانا حاكمين لما افتقر إلى إقرار الزوج ، والله أعلم .\nقال الشيخ أبو عمر بن عبد البر : وأجمع العلماء على أن الحكمين - إذا اختلف قولهما - فلا عبرة بقول الآخر ، وأجمعوا على أن قولهما نافذ في الجمع وإن لم يوكلهما الزوجان ، واختلفوا : هل ينفذ قولهما في التفرقة ؟ ثم حكي عن الجمهور أنه ينفذ قولهما فيها أيضا .\n                                    ",
        "qortoby": "وَإِنۡ خِفۡتُمۡ شِقَاقَ بَيۡنِهِمَا فَٱبۡعَثُواْ حَكَمٗا مِّنۡ أَهۡلِهِۦ وَحَكَمٗا مِّنۡ أَهۡلِهَآ إِن يُرِيدَآ إِصۡلَٰحٗا يُوَفِّقِ ٱللَّهُ بَيۡنَهُمَآۗ إِنَّ ٱللَّهَ كَانَ عَلِيمًا خَبِيرٗا ٥٣\n                                    \n                                    \n                                    قوله تعالى : وإن خفتم شقاق بينهما فابعثوا حكما من أهله وحكما من أهلها إن يريدا إصلاحا يوفق الله بينهما إن الله كان عليما خبيرا\nفيه خمس مسائل :\nالأولى : قوله تعالى وإن خفتم شقاق بينهما قد تقدم معنى الشقاق في \" البقرة \" . فكأن كل واحد من الزوجين يأخذ شقا غير شق صاحبه ، أي ناحية غير ناحية صاحبه . والمراد إن خفتم شقاقا بينهما ؛ فأضيف المصدر إلى الظرف كقولك : يعجبني سير الليلة المقمرة ، وصوم يوم عرفة . وفي التنزيل : بل مكر الليل والنهار . وقيل : إن \" بين \" أجري مجرى الأسماء وأزيل عنه الظرفية ؛ إذ هو بمعنى حالهما وعشرتهما ، أي وإن خفتم تباعد عشرتهما وصحبتهما فابعثوا . وخفتم على الخلاف المتقدم . قال سعيد بن جبير : الحكم أن يعظها أولا ، فإن قبلت وإلا هجرها ، فإن هي قبلت وإلا ضربها ، فإن هي قبلت وإلا بعث الحاكم حكما من أهله وحكما من أهلها ، فينظران ممن الضرر ، وعند ذلك يكون الخلع . وقد قيل : له أن يضرب قبل الوعظ . والأول أصح لترتيب ذلك في الآية .\nالثانية : والجمهور من العلماء على أن المخاطب بقوله : \" وإن خفتم \" الحكام والأمراء . وأن قوله : إن يريدا إصلاحا يوفق الله بينهما يعني الحكمين ؛ في قول ابن عباس ومجاهد وغيرهما . أي إن يرد الحكمان إصلاحا يوفق الله بين الزوجين . وقيل : المراد الزوجان ؛ أي إن يرد الزوجان إصلاحا وصدقا فيما أخبرا به الحكمين يوفق الله بينهما . وقيل : الخطاب للأولياء . يقول : إن خفتم أي علمتم خلافا بين الزوجين فابعثوا حكما من أهله وحكما من أهلها والحكمان لا يكونان إلا من أهل الرجل والمرأة ؛ إذ هما أقعد بأحوال الزوجين ، ويكونان من أهل العدالة وحسن النظر والبصر بالفقه . فإن لم يوجد من أهلهما من يصلح لذلك فيرسل من غيرهما عدلين عالمين ؛ وذلك إذا أشكل أمرهما ولم يدر ممن الإساءة منهما . فأما إن عرف الظالم فإنه يؤخذ منه الحق لصاحبه ويجبر على إزالة الضرر . ويقال : إن الحكم من أهل الزوج يخلو به ويقول له : أخبرني بما في نفسك أتهواها أم لا حتى أعلم مرادك ؟ فإن قال : لا حاجة لي فيها خذ لي منها ما استطعت وفرق بيني وبينها ، فيعرف أن من قبله النشوز . وإن قال : إني أهواها فأرضها من مالي بما شئت ولا تفرق بيني وبينها ، فيعلم أنه ليس بناشز . ويخلو الحكم من جهتها بالمرأة ويقول لها : أتهوين زوجك أم لا ؛ فإن قالت : فرق بيني وبينه وأعطه من مالي ما أراد ؛ فيعلم أن النشوز من قبلها . وإن قالت : لا تفرق بيننا ولكن حثه على أن يزيد في نفقتي ويحسن إلي ، علم أن النشوز ليس من قبلها . فإذا ظهر لهما الذي كان النشوز من قبله يقبلان عليه بالعظة والزجر والنهي ؛ فذلك قوله تعالى : فابعثوا حكما من أهله وحكما من أهلها .\nالثالثة : قال العلماء : قسمت هذه الآية النساء تقسيما عقليا ؛ لأنهن إما طائعة وإما ناشز ؛ والنشوز إما أن يرجع إلى الطواعية أو لا . فإن كان الأول تركا ؛ لما رواه النسائي أن عقيل بن أبي طالب تزوج فاطمة بنت عتبة بن ربيعة فكان إذا دخل عليها تقول : يا بني هاشم ، والله لا يحبكم قلبي أبدا ! أين الذين أعناقهم كأباريق الفضة ! ترد أنوفهم قبل شفاههم ، أين عتبة بن ربيعة ، أين شيبة بن ربيعة ؛ فيسكت عنها ، حتى دخل عليها يوما وهو برم فقالت له : أين عتبة بن ربيعة ؟ فقال : على يسارك في النار إذا دخلت ؛ فنشرت عليها ثيابها ، فجاءت عثمان فذكرت له ذلك ؛ فأرسل ابن عباس ومعاوية ، فقال ابن عباس : لأفرقن بينهما ؛ وقال معاوية : ما كنت لأفرق بين شيخين من بني عبد مناف . فأتياهما فوجداهما قد سدا عليهما أبوابهما وأصلحا أمرهما . فإن وجداهما قد اختلفا ولم يصطلحا وتفاقم أمرهما سعيا في الألفة جهدهما ، وذكرا بالله وبالصحبة . فإن أنابا ورجعا تركاهما ، وإن كانا غير ذلك ورأيا الفرقة فرقا بينهما . وتفريقهما جائز على الزوجين ؛ وسواء وافق حكم قاضي البلد أو خالفه ، وكلهما الزوجان بذلك أو لم يوكلاهما . والفراق في ذلك طلاق بائن . وقال قوم : ليس لهما الطلاق ما لم يوكلهما الزوج في ذلك ، وليعرفا الإمام ؛ وهذا بناء على أنهما رسولان شاهدان . ثم الإمام يفرق إن أراد ويأمر الحكم بالتفريق . وهذا أحد قولي الشافعي ؛ وبه قال الكوفيون ، وهو قول عطاء وابن زيد والحسن ، وبه قال أبو ثور . والصحيح الأول ، لأن للحكمين التطليق دون توكيل ؛ وهو قول مالك والأوزاعي وإسحاق وروي عن عثمان وعلي وابن عباس ، وعن الشعبي والنخعي ، وهو قول الشافعي ؛ لأن الله تعالى قال : فابعثوا حكما من أهله وحكما من أهلها وهذا نص من الله سبحانه بأنهما قاضيان لا وكيلان ولا شاهدان . وللوكيل اسم في الشريعة ومعنى ، وللحكم اسم في الشريعة ومعنى ؛ فإذا بين الله كل واحد منهما فلا ينبغي لشاذ - فكيف لعالم - أن يركب معنى أحدهما على الآخر ! . وقد روى الدارقطني من حديث محمد بن سيرين عن عبيدة في هذه الآية وإن خفتم شقاق بينهما فابعثوا حكما من أهله وحكما من أهلها قال : جاء رجل وامرأة إلى علي مع كل واحد منهما فئام من الناس فأمرهم فبعثوا حكما من أهله وحكما من أهلها ، وقال للحكمين : هل تدريان ما عليكما ؟ عليكما إن رأيتما أن تفرقا فرقتما . فقالت المرأة : رضيت بكتاب الله بما علي فيه ولي . وقال الزوج : أما الفرقة فلا . فقال علي : كذبت ، والله لا تبرح حتى تقر بمثل الذي أقرت به . وهذا إسناد صحيح ثابت روي عن علي من وجوه ثابتة عن ابن سيرين عن عبيدة ؛ قاله أبو عمر . فلو كانا وكيلين أو شاهدين لم يقل لهما : أتدريان ما عليكما ؟ إنما كان يقول : أتدريان بما وكلتما ؟ وهذا بين . احتج أبو حنيفة بقول علي رضي الله عنه للزوج : لا تبرح حتى ترضى بما رضيت به . فدل على أن مذهبه أنهما لا يفرقان إلا برضا الزوج ، وبأن الأصل المجتمع عليه أن الطلاق بيد الزوج أو بيد من جعل ذلك إليه . وجعله مالك ومن تابعه من باب طلاق السلطان على المولى والعنين .\nالرابعة : فإن اختلف الحكمان لم ينفذ قولهما ولم يلزم من ذلك شيء إلا ما اجتمعا عليه . وكذلك كل حكمين حكما في أمر ؛ فإن حكم أحدهما بالفرقة ولم يحكم بها الآخر ، أو حكم أحدهما بمال وأبى الآخر فليسا بشيء حتى يتفقا . وقال مالك في الحكمين يطلقان ثلاثا قال : تلزم واحدة وليس لهما الفراق بأكثر من واحدة بائنة ؛ وهو قول ابن القاسم . وقال ابن القاسم أيضا : تلزمه الثلاث إن اجتمعا عليها ؛ وقاله المغيرة وأشهب وابن الماجشون وأصبغ . وقال ابن المواز : إن حكم أحدهما بواحدة والآخر بثلاث فهي واحدة . وحكى ابن حبيب عن أصبغ أن ذلك ليس بشيء .\nالخامسة : ويجزئ إرسال الواحد ؛ لأن الله سبحانه حكم في الزنى بأربعة شهود ، ثم قد أرسل النبي صلى الله عليه وسلم إلى المرأة الزانية أنيسا وحده وقال له : إن اعترفت فارجمها وكذلك قال عبد الملك في المدونة .\nقلت : وإذا جاز إرسال الواحد فلو حكم الزوجان واحدا لأجزأ ، وهو بالجواز أولى إذا رضيا بذلك ، وإنما خاطب الله بالإرسال الحكام دون الزوجين . فإن أرسل الزوجان حكمين وحكما نفذ حكمهما ؛ لأن التحكيم عندنا جائز ، وينفذ فعل الحكم في كل مسألة . هذا إذا كان كل واحد منهما عدلا ، ولو كان غير عدل قال عبد الملك : حكمه منقوض ؛ لأنهما تخاطرا بما لا ينبغي من الغرر . قال ابن العربي : والصحيح نفوذه ؛ لأنه إن كان توكيلا ففعل الوكيل نافذ ، وإن كان تحكيما فقد قدماه على أنفسهما وليس الغرر بمؤثر فيه كما لم يؤثر في باب التوكيل ، وباب القضاء مبني على الغرر كله ، وليس يلزم فيه معرفة المحكوم عليه بما يئول إليه الحكم . قال ابن العربي : مسألة الحكمين نص الله عليها وحكم بها عند ظهور الشقاق بين الزوجين ، واختلاف ما بينهما . وهي مسألة عظيمة اجتمعت الأمة على أصلها في البعث ، وإن اختلفوا في تفاصيل ما ترتب عليه . وعجبا لأهل بلدنا حيث غفلوا عن موجب الكتاب والسنة في ذلك وقالوا : يجعلان على يدي أمين ؛ وفي هذا من معاندة النص ما لا يخفى عليكم ، فلا بكتاب الله ائتمروا ولا بالأقيسة اجتزءوا . وقد ندبت إلى ذلك فما أجابني إلى بعث الحكمين عند الشقاق إلا قاض واحد ، ولا بالقضاء باليمين مع الشاهد إلا آخر ، فلما ملكني الله الأمر أجريت السنة كما ينبغي . ولا تعجب لأهل بلدنا لما غمرهم من الجهالة ، ولكن اعجب لأبي حنيفة ليس للحكمين عنده خبر ، بل اعجب مرتين للشافعي فإنه قال : الذي يشبه ظاهر الآية أنه فيما عم الزوجين معا حتى يشتبه فيه حالاهما . قال : وذلك أني وجدت الله عز وجل أذن في نشوز الزوج بأن يصطلحا وأذن في خوفهما ألا يقيما حدود الله بالخلع وذلك يشبه أن يكون برضا المرأة . وحظر أن يأخذ الزوج مما أعطى شيئا إذا أراد استبدال زوج مكان زوج ؛ فلما أمر فيمن خفنا الشقاق بينهما بالحكمين دل على أن حكمهما غير حكم الأزواج ، فإذا كان كذلك بعث حكما من أهله وحكما من أهلها ، ولا يبعث الحكمين إلا مأمونين برضا الزوجين وتوكيلهما بأن يجمعا أو يفرقا إذا رأيا ذلك . وذلك يدل على أن الحكمين وكيلان للزوجين . قال ابن العربي : هذا منتهى كلام الشافعي ، وأصحابه يفرحون به وليس فيه ما يلتفت إليه ولا يشبه نصابه في العلم ، وقد تولى الرد عليه القاضي أبو إسحاق ولم ينصفه في الأكثر . أما قوله : \" الذي يشبه ظاهر الآية أنه فيما عم الزوجين \" فليس بصحيح بل هو نصه ، وهي من أبين آيات القرآن وأوضحها جلاء ؛ فإن الله تعالى قال : الرجال قوامون على النساء - ومن خاف من امرأته نشوزا وعظها ، فإن أنابت وإلا هجرها في المضجع ، فإن ارعوت وإلا ضربها ، فإن استمرت في غلوائها مشى الحكمان إليهما . وهذا إن لم يكن نصا فليس في القرآن بيان . ودعه لا يكون نصا ، يكون ظاهرا ؛ فأما أن يقول الشافعي : يشبه الظاهر فلا ندري ما الذي أشبه الظاهر ؟ . ثم قال : \" وأذن في خوفهما ألا يقيما حدود الله بالخلع وذلك يشبه أن يكون برضا المرأة ، بل يجب أن يكون كذلك وهو نصه \" . ثم قال : \" فلما أمر بالحكمين علمنا أن حكمهما غير حكم الأزواج ، ويجب أن يكون غيره بأن ينفذ عليهما من غير اختيارهما فتتحقق الغيرية . فأما إذا أنفذا عليهما ما وكلاهما به فلم يحكما بخلاف أمرهما فلم تتحقق الغيرية \" . وأما قوله \" برضى الزوجين وتوكيلهما \" فخطأ صراح ؛ فإن الله سبحانه خاطب غير الزوجين إذا خاف الشقاق بين الزوجين بإرسال الحكمين ، وإذا كان المخاطب غيرهما كيف يكون ذلك بتوكيلهما ، ولا يصح لهما حكم إلا بما اجتمعا عليه . هذا وجه الإنصاف والتحقيق في الرد عليه . وفي هذه الآية دليل على إثبات التحكيم ، وليس كما تقول الخوارج إنه ليس التحكيم لأحد سوى الله تعالى . وهذه كلمة حق ولكن يريدون بها الباطل .\n                                    ",
        "saadi": "وَإِنۡ خِفۡتُمۡ شِقَاقَ بَيۡنِهِمَا فَٱبۡعَثُواْ حَكَمٗا مِّنۡ أَهۡلِهِۦ وَحَكَمٗا مِّنۡ أَهۡلِهَآ إِن يُرِيدَآ إِصۡلَٰحٗا يُوَفِّقِ ٱللَّهُ بَيۡنَهُمَآۗ إِنَّ ٱللَّهَ كَانَ عَلِيمًا خَبِيرٗا ٥٣\n                                        \n                                        \n                                        \n                                        أي: وإن خفتم الشقاق بين الزوجين والمباعدة والمجانبة حتى يكون كل منهما في شق { فَابْعَثُوا حَكَمًا مِنْ أَهْلِهِ وَحَكَمًا مِنْ أَهْلِهَا } أي: رجلين مكلفين مسلمين عدلين عاقلين يعرفان ما بين الزوجين، ويعرفان الجمع والتفريق. وهذا مستفاد من لفظ \"الحكم\" لأنه لا يصلح حكما إلا من اتصف بتلك الصفات. فينظران ما ينقم كل منهما على صاحبه، ثم يلزمان كلا منهما ما يجب، فإن لم يستطع أحدهما ذلك، قنَّعا الزوج الآخر بالرضا بما تيسر من الرزق والخلق، ومهما أمكنهما الجمع والإصلاح فلا يعدلا عنه. فإن وصلت الحال إلى أنه لا يمكن اجتماعهما وإصلاحهما إلا على وجه المعاداة والمقاطعة ومعصية الله، ورأيا أن التفريق بينهما أصلح، فرقا بينهما. ولا يشترط رضا الزوج، كما يدل عليه أن الله سماهما حكمين، والحكم يحكم ولو لم يرض المحكوم عليه، ولهذا قال: { إِنْ يُرِيدَا إِصْلَاحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا } أي: بسبب الرأي الميمون والكلام الذي يجذب القلوب ويؤلف بين القرينين. { إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا } أي: عالمًا بجميع الظواهر والبواطن، مطلعا على خفايا الأمور وأسرارها. فمن علمه وخبره أن شرع لكم هذه الأحكام الجليلة والشرائع الجميلة.\n                                    "
      },
      "originalText": "وَإِنۡ خِفۡتُمۡ شِقَاقَ بَيۡنِهِمَا فَٱبۡعَثُواْ حَكَمٗا مِّنۡ أَهۡلِهِۦ وَحَكَمٗا مِّنۡ أَهۡلِهَآ إِن يُرِيدَآ إِصۡلَٰحٗا يُوَفِّقِ ٱللَّهُ بَيۡنَهُمَآۗ إِنَّ ٱللَّهَ كَانَ عَلِيمًا خَبِيرٗا ٥٣"
    },
    {
      "number": 529,
      "text": "۞ وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَالْجَارِ ذِي الْقُرْبَىٰ وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنْبِ وَابْنِ السَّبِيلِ وَمَا مَلَكَتْ أَيْمَانُكُمْ ۗ إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ مُخْتَالًا فَخُورًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 36,
      "juz": 5,
      "manzil": 1,
      "page": 84,
      "ruku": 67,
      "hizbQuarter": 34,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَٱعۡبُدُواْ ٱللَّهَ وَلَا تُشۡرِكُواْ بِهِۦ شَيۡ‍ٔٗاۖ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنٗا وَبِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱلۡجَارِ ذِي ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِيلِ وَمَا مَلَكَتۡ أَيۡمَٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا يُحِبُّ مَن كَانَ مُخۡتَالٗا فَخُورًا ٦٣\n                                    \n                                    \n                                    يأمر تبارك وتعالى بعبادته وحده لا شريك له; فإنه هو الخالق الرازق المنعم المتفضل على خلقه في جميع الآنات والحالات ، فهو المستحق منهم أن يوحدوه ، ولا يشركوا به شيئا من مخلوقاته ، كما قال رسول الله صلى الله عليه وسلم لمعاذ : \" أتدري ما حق الله على العباد ؟ \" قال : الله ورسوله أعلم . قال : \" أن يعبدوه ولا يشركوا به شيئا \" ، ثم قال : \" أتدري ما حق العباد على الله إذا فعلوا ذلك ؟ ألا يعذبهم \" ثم أوصى بالإحسان إلى الوالدين ، فإن الله ، سبحانه ، جعلهما سببا لخروجك من العدم إلى الوجود ، وكثيرا ما يقرن الله ، سبحانه ، بين عبادته والإحسان إلى الوالدين ، كقوله : ( أن اشكر لي ولوالديك ) [ لقمان : 14 ] وكقوله : ( وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا ) [ الإسراء : 23 ] .\nثم عطف على الإحسان إلى الوالدين الإحسان إلى القرابات من الرجال والنساء ، كما جاء في الحديث : \" الصدقة على المسكين صدقة ، وعلى ذي الرحم صدقة وصلة \" .\nثم قال : ( واليتامى ) وذلك لأنهم قد فقدوا من يقوم بمصالحهم ، ومن ينفق عليهم ، فأمر الله بالإحسان إليهم والحنو عليهم .\nثم قال : ( والمساكين ) وهم المحاويج من ذوي الحاجات الذين لا يجدون ما يقوم بكفايتهم ، فأمر الله بمساعدتهم بما تتم به كفايتهم وتزول به ضرورتهم . وسيأتي الكلام على الفقير والمسكين في سورة براءة .\nوقوله : ( والجار ذي القربى والجار الجنب ) قال علي بن أبي طلحة ، عن ابن عباس : ( والجار ذي القربى ) يعني الذي بينك وبينه قرابة ، ( والجار الجنب ) الذي ليس بينك وبينه قرابة . وكذا روي عن عكرمة ، ومجاهد ، وميمون بن مهران ، والضحاك ، وزيد بن أسلم ، ومقاتل بن حيان ، وقتادة .\nوقال أبو إسحاق عن نوف البكالي في قوله : ( والجار ذي القربى ) يعني المسلم ( والجار الجنب ) يعني اليهودي والنصراني رواه ابن جرير ، وابن أبي حاتم .\nوقال جابر الجعفي ، عن الشعبي ، عن علي وابن مسعود : ( والجار ذي القربى ) يعني المرأة . وقال مجاهد أيضا في قوله : ( والجار الجنب ) يعني الرفيق في السفر .\nوقد وردت الأحاديث بالوصايا بالجار ، فنذكر منها ما تيسر ، والله المستعان :\nالحديث الأول : قال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن عمر بن محمد بن زيد : أنه سمع أباه محمدا يحدث ، عن عبد الله بن عمر أن رسول الله صلى الله عليه وسلم قال : \" ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه \" .\nأخرجاه في الصحيح من حديث عمر بن محمد بن زيد بن عبد الله بن عمر ، به .\nالحديث الثاني : قال الإمام أحمد : حدثنا سفيان ، عن داود بن شابور ، عن مجاهد ، عن عبد الله بن عمرو قال : قال رسول الله صلى الله عليه وسلم : \" ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه \" .\nوروى أبو داود والترمذي نحوه ، من حديث سفيان بن عيينة ، عن بشير أبي إسماعيل - زاد الترمذي : وداود بن شابور - كلاهما عن مجاهد ، به ثم قال الترمذي : حسن غريب من هذا الوجه وقد روي عن مجاهد عن عائشة وأبي هريرة عن النبي صلى الله عليه وسلم .\nالحديث الثالث عنه : قال أحمد أيضا : حدثنا عبد الله بن يزيد ، أخبرنا حيوة ، أخبرنا شرحبيل بن شريك أنه سمع أبا عبد الرحمن الحبلي يحدث عن عبد الله بن عمرو بن العاص ، عن رسول الله صلى الله عليه وسلم أنه قال : \" خير الأصحاب عند الله خيرهم لصاحبه ، وخير الجيران عند الله خيرهم لجاره \" .\nورواه الترمذي عن أحمد بن محمد ، عن عبد الله بن المبارك ، عن حيوة بن شريح - به ، وقال : [ حديث ] حسن غريب .\nالحديث الرابع : قال الإمام أحمد : حدثنا عبد الرحمن بن مهدي ، حدثنا سفيان ، عن أبيه ، عن عباية بن رفاعة عن عمر قال : قال رسول الله صلى الله عليه وسلم : \" لا يشبع الرجل دون جاره \" . تفرد به أحمد .\nالحديث الخامس : قال الإمام أحمد : حدثنا علي بن عبد الله ، حدثنا محمد بن فضيل بن غزوان ، حدثنا محمد بن سعد الأنصاري ، سمعت أبا ظبية الكلاعي ، سمعت المقداد بن الأسود يقول : قال رسول الله صلى الله عليه وسلم لأصحابه : [ \" ما تقولون في الزنا ؟ \" قالوا : حرام حرمه الله ورسوله ، فهو حرام إلى يوم القيامة . فقال : رسول الله صلى الله عليه وسلم ] لأن يزني الرجل بعشر نسوة ، أيسر عليه من أن يزني بامرأة جاره \" . قال : ما تقولون في السرقة ؟ قالوا : حرمها الله ورسوله فهي حرام . قال \" لأن يسرق الرجل من عشرة أبيات ، أيسر عليه من أن يسرق من جاره \" .\nتفرد به أحمد وله شاهد في الصحيحين من حديث ابن مسعود : قلت : يا رسول الله ، أي الذنب أعظم ؟ قال : \" أن تجعل لله ندا وهو خلقك \" . قلت : ثم أي ؟ قال : \" أن تقتل ولدك خشية أن يطعم معك \" . قلت : ثم أي ؟ قال : \" أن تزاني حليلة جارك \" .\nالحديث السادس : قال الإمام أحمد : حدثنا يزيد ، أخبرنا هشام ، عن حفصة ، عن أبي العالية ، عن رجل من الأنصار قال : خرجت من أهلي أريد النبي صلى الله عليه وسلم ، فإذا به قائم ورجل معه مقبل عليه ، فظننت أن لهما حاجة - قال الأنصاري : لقد قام رسول الله صلى الله عليه وسلم حتى جعلت أرثي لرسول الله صلى الله عليه وسلم من طول القيام ، فلما انصرف قلت : يا رسول الله ، لقد قام بك هذا الرجل حتى جعلت أرثي لك من طول القيام . قال : \" ولقد رأيته ؟ \" قلت : نعم . قال : \" أتدري من هو ؟ \" قلت : لا . قال : \" ذاك جبريل ، ما زال يوصيني بالجار حتى ظننت أنه سيورثه . ثم قال : أما إنك لو سلمت عليه ، رد عليك السلام \" .\nالحديث السابع : قال عبد بن حميد في مسنده : حدثنا يعلى بن عبيد ، حدثنا أبو بكر - يعني المدني - عن جابر بن عبد الله قال : جاء رجل من العوالي ورسول الله صلى الله عليه وسلم وجبريل عليه السلام يصليان حيث يصلى على الجنائز ، فلما انصرف قال الرجل : يا رسول الله ، من هذا الرجل الذي رأيت معك ؟ قال : \" وقد رأيته ؟ \" قال : نعم . قال : \" لقد رأيت خيرا كثيرا ، هذا جبريل ما زال يوصيني بالجار حتى رئيت أنه سيورثه \" .\nتفرد به من هذا الوجه وهو شاهد للذي قبله .\nالحديث الثامن : قال أبو بكر البزار : حدثنا عبيد الله بن محمد أبو الربيع الحارثي ، حدثنا محمد بن إسماعيل بن أبي فديك ، أخبرني عبد الرحمن بن الفضل عن عطاء الخراساني ، عن الحسن ، عن جابر بن عبد الله قال : قال رسول الله صلى الله عليه وسلم : \" الجيران ثلاثة : جار له حق واحد ، وهو أدنى الجيران حقا ، وجار له حقان ، وجار له ثلاثة حقوق ، وهو أفضل الجيران حقا ، فأما الذي له حق واحد فجار مشرك لا رحم له ، له حق الجوار . وأما الذي له حقان فجار مسلم ، له حق الإسلام وحق الجوار ، وأما الذي له ثلاثة حقوق ، فجار مسلم ذو رحم له حق الجوار وحق الإسلام وحق الرحم \" .\nقال البزار : لا نعلم أحدا روى عن عبد الرحمن بن الفضيل إلا ابن أبي فديك .\nالحديث التاسع : قال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن أبي عمران ، عن طلحة بن عبد الله ، عن عائشة; أنها سألت رسول الله صلى الله عليه وسلم فقالت : \" إن لي جارين ، فإلى أيهما أهدي ؟ قال : \" إلى أقربهما منك بابا \" .\nورواه البخاري من حديث شعبة ، به .\nوقوله : ( والصاحب بالجنب ) قال الثوري ، عن جابر الجعفي ، عن الشعبي ، عن علي وابن مسعود قالا هي المرأة .\nوقال ابن أبي حاتم : وروي عن عبد الرحمن بن أبي ليلى ، وإبراهيم النخعي ، والحسن ، وسعيد بن جبير - في إحدى الروايات - نحو ذلك .\nوقال ابن عباس ومجاهد ، وعكرمة ، وقتادة : هو الرفيق في السفر . وقال سعيد بن جبير : هو الرفيق الصالح . وقال زيد بن أسلم : هو جليسك في الحضر ، ورفيقك في السفر .\nوأما ) ابن السبيل ) فعن ابن عباس وجماعة هو : الضيف .\n4\nوقال مجاهد ، وأبو جعفر الباقر ، والحسن ، والضحاك ، ومقاتل : هو الذي يمر عليك مجتازا في السفر .\nوهذا أظهر ، وإن كان مراد القائل بالضيف : المار في الطريق ، فهما سواء . وسيأتي الكلام على أبناء السبيل في سورة براءة ، وبالله الثقة وعليه التكلان .\nوقوله : ( وما ملكت أيمانكم ) وصية بالأرقاء ; لأن الرقيق ضعيف الحيلة أسير في أيدي الناس ، ولهذا ثبت أن رسول الله صلى الله عليه وسلم جعل يوصي أمته في مرض الموت يقول : \" الصلاة الصلاة وما ملكت أيمانكم \" . فجعل يرددها حتى ما يفيض بها لسانه .\nوقال الإمام أحمد : حدثنا إبراهيم بن أبي العباس ، حدثنا بقية ، حدثنا بحير بن سعد ، عن خالد بن معدان ، عن المقدام بن معد يكرب قال : قال رسول الله صلى الله عليه وسلم : \" ما أطعمت نفسك فهو لك صدقة ، وما أطعمت ولدك فهو لك صدقة ، وما أطعمت زوجتك فهو لك صدقة ، وما أطعمت خادمك فهو لك صدقه \" .\nورواه النسائي من حديث بقية ، وإسناده صحيح ولله الحمد .\nوعن عبد الله بن عمرو أنه قال لقهرمان له : هل أعطيت الرقيق قوتهم ؟ قال : لا . قال : فانطلق فأعطهم ; فإن رسول الله صلى الله عليه وسلم قال : \" كفى بالمرء إثما أن يحبس عمن يملك قوتهم \" رواه مسلم .\nوعن أبي هريرة عن النبي صلى الله عليه وسلم قال : \" للمملوك طعامه وكسوته ، ولا يكلف من العمل إلا ما يطيق \" . رواه مسلم أيضا .\nوعنه ، عن النبي صلى الله عليه وسلم قال : \" إذا أتى أحدكم خادمه بطعامه ، فإن لم يجلسه معه ، فليناوله لقمة أو لقمتين أو أكلة أو أكلتين ، فإنه ولي حره وعلاجه \" .\nأخرجاه ولفظه للبخاري ولمسلم فليقعده معه فليأكل ، فإن كان الطعام مشفوها قليلا فليضع في يده أكلة أو أكلتين \" .\nوعن أبي ذر ، رضي الله عنه عن النبي صلى الله عليه وسلم قال : \" هم إخوانكم خولكم ، جعلهم الله تحت أيديكم ، فمن كان أخوه تحت يده فليطعمه مما يأكل ، وليلبسه مما يلبس ، ولا تكلفوهم ما يغلبهم ، فإن كلفتموهم ، فأعينوهم \" . أخرجاه .\nوقوله : ( إن الله لا يحب من كان مختالا فخورا ) أي : مختالا في نفسه ، معجبا متكبرا ، فخورا على الناس ، يرى أنه خير منهم ، فهو في نفسه كبير ، وهو عند الله حقير ، وعند الناس بغيض .\nقال مجاهد في قوله : ( إن الله لا يحب من كان مختالا ) يعني : متكبرا ( فخورا ) يعني : يعد ما أعطي ، وهو لا يشكر الله ، عز وجل . يعني : يفخر على الناس بما أعطاه الله من نعمه ، وهو قليل الشكر لله على ذلك .\nوقال ابن جرير : حدثني القاسم ، حدثنا الحسين ، حدثنا محمد بن كثير ، عن عبد الله بن واقد أبي رجاء الهروي قال : لا تجد سيئ الملكة إلا وجدته مختالا فخورا - وتلا ( وما ملكت أيمانكم [ إن الله لا يحب من كان مختالا فخورا ] ) ولا عاقا إلا وجدته جبارا شقيا - وتلا ( وبرا بوالدتي ولم يجعلني جبارا شقيا ) [ مريم : 32 ] .\nوروى ابن أبي حاتم ، عن العوام بن حوشب ، مثله في المختال الفخور . وقال :\nحدثنا أبي ، حدثنا أبو نعيم ، حدثنا الأسود بن شيبان ، حدثنا يزيد بن عبد الله بن الشخير قال : قال مطرف : كان يبلغني عن أبي ذر حديث كنت أشتهي لقاءه ، فلقيته فقلت : يا أبا ذر ، بلغني أنك تزعم أن رسول الله صلى الله عليه وسلم حدثكم : \" إن الله يحب ثلاثة ويبغض ثلاثة \" ؟ قال : أجل ، فلا إخالني أكذب على خليلي ، ثلاثا . قلت : من الثلاثة الذين يبغض الله ؟ قال : المختال الفخور ، أوليس تجدونه عندكم في كتاب الله المنزل ؟ ثم قرأ الآية : ( إن الله لا يحب من كان مختالا فخورا ) [ النساء : 36 ] .\nوحدثنا أبي ، حدثنا موسى بن إسماعيل ، حدثنا وهيب عن خالد ، عن أبي تميمة عن رجل من بلهجيم قال : قلت يا رسول الله ، أوصني . قال : \" إياك وإسبال الإزار ، فإن إسبال الإزار من المخيلة ، وإن الله لا يحب المخيلة \" .\n                                    ",
        "qortoby": "وَٱعۡبُدُواْ ٱللَّهَ وَلَا تُشۡرِكُواْ بِهِۦ شَيۡ‍ٔٗاۖ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنٗا وَبِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱلۡجَارِ ذِي ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِيلِ وَمَا مَلَكَتۡ أَيۡمَٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا يُحِبُّ مَن كَانَ مُخۡتَالٗا فَخُورًا ٦٣\n                                    \n                                    \n                                    قوله تعالى واعبدوا الله ولا تشركوا به شيئا وبالوالدين إحسانا وبذي القربى واليتامى والمساكين والجار ذي القربى والجار الجنب والصاحب بالجنب وابن السبيل وما ملكت أيمانكم إن الله لا يحب من كان مختالا فخورا\nفيه ثمان عشرة مسألة :\nالأولى : أجمع العلماء على أن هذه الآية من المحكم المتفق عليه ، ليس منها شيء منسوخ . وكذلك هي في جميع الكتب . ولو لم يكن كذلك لعرف ذلك من جهة العقل ، وإن لم ينزل به الكتاب . وقد مضى معنى العبودية وهي التذلل والافتقار ، لمن له الحكم والاختيار ؛ فأمر الله تعالى عباده بالتذلل له والإخلاص فيه ، فالآية أصل في خلوص الأعمال لله تعالى وتصفيتها من شوائب الرياء وغيره ؛ قال الله تعالى فمن كان يرجو لقاء ربه فليعمل عملا صالحا ولا يشرك بعبادة ربه أحدا حتى لقد قال بعض علمائنا : إنه من تطهر تبردا أو صام محما لمعدته ونوى مع ذلك التقرب لم يجزه ؛ لأنه مزج في نية التقرب نية دنياوية وليس لله إلا العمل الخالص ؛ كما قال تعالى : ألا لله الدين الخالص . وقال تعالى : وما أمروا إلا ليعبدوا الله مخلصين له الدين . وكذلك إذا أحس الرجل بداخل في الركوع وهو إمام لم ينتظره ؛ لأنه يخرج ركوعه بانتظاره عن كونه خالصا لله تعالى . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : قال الله تبارك وتعالى : أنا أغنى الشركاء عن الشرك من عمل عملا أشرك فيه معي غيري تركته وشركه . وروى الدارقطني عن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : يجاء يوم القيامة بصحف مختمة فتنصب بين يدي الله تعالى فيقول الله تعالى للملائكة : ألقوا هذا واقبلوا هذا فتقول الملائكة : وعزتك ما رأينا إلا خيرا فيقول الله عز وجل - وهو أعلم - : إن هذا كان لغيري ولا أقبل اليوم من العمل إلا ما كان ابتغي به وجهي . وروي أيضا عن الضحاك بن قيس الفهري قال : قال رسول الله صلى الله عليه وسلم : إن الله تعالى يقول : أنا خير شريك فمن أشرك معي شريكا فهو لشريكي ، يا أيها الناس أخلصوا أعمالكم لله تعالى فإن الله لا يقبل إلا ما خلص له ولا تقولوا هذا لله وللرحم فإنها للرحم وليس لله منها شيء ولا تقولوا هذا لله ولوجوهكم فإنها لوجوهكم وليس لله تعالى منها شيء .\nمسألة : إذا ثبت هذا فاعلم أن علماءنا رضي الله عنهم قالوا : الشرك على ثلاث مراتب وكله محرم .\nوأصله اعتقاد شريك لله في ألوهيته ، وهو الشرك الأعظم وهو شرك الجاهلية ، وهو المراد بقوله تعالى : إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء . ويليه في الرتبة اعتقاد شريك لله تعالى في الفعل ، وهو قول من قال : إن موجودا ما غير الله تعالى يستقل بإحداث فعل وإيجاده وإن لم يعتقد كونه إلها كالقدرية مجوس هذه الأمة ، وقد تبرأ منهم ابن عمر كما في حديث جبريل عليه السلام . ويلي هذه الرتبة الإشراك في العبادة وهو الرياء ؛ وهو أن يفعل شيئا من العبادات التي أمر الله بفعلها له لغيره . وهذا هو الذي سيقت الآيات والأحاديث لبيان تحريمه ، وهو مبطل للأعمال وهو خفي لا يعرفه كل جاهل غبي . ورضي الله عن المحاسبي فقد أوضحه في كتابه \" الرعاية \" وبين إفساده للأعمال . وفي سنن ابن ماجه عن أبي سعيد بن أبي فضالة الأنصاري وكان من الصحابة قال : قال رسول الله صلى الله عليه وسلم : إذا جمع الله الأولين والآخرين ليوم القيامة ليوم لا ريب فيه نادى مناد من كان أشرك في عمل عمله لله عز وجل أحدا فليطلب ثوابه من عند غير الله فإن الله أغنى الشركاء عن الشرك . وفيه عن أبي سعيد الخدري قال : خرج علينا رسول الله صلى الله عليه وسلم ونحن نتذاكر المسيح الدجال فقال : ألا أخبركم بما هو أخوف عليكم عندي من المسيح الدجال ؟ قال : فقلنا بلى يا رسول الله ؛ فقال : الشرك الخفي أن يقوم الرجل يصلي فيزين صلاته لما يرى من نظر رجل . وفيه عن شداد بن أوس قال : قال رسول الله صلى الله عليه وسلم : إن أخوف ما أتخوف على أمتي الإشراك بالله أما إني لست أقول يعبدون شمسا ولا قمرا ولا وثنا ولكن أعمالا لغير الله وشهوة خفية خرجه الترمذي الحكيم . وسيأتي في آخر الكهف ، وفيه بيان الشهوة الخفية . وروى ابن لهيعة عن يزيد بن أبي حبيب قال : سئل رسول الله صلى الله عليه وسلم عن الشهوة الخفية فقال : هو الرجل يتعلم العلم يحب أن يجلس إليه . قال سهل بن عبد الله التستري رضي الله عنه : الرياء على ثلاثة وجوه ؛ أحدها : أن يعقد في أصل فعله لغير الله ويريد به أن يعرف أنه لله ، فهذا صنف من النفاق وتشكك في الإيمان . والآخر : يدخل في الشيء لله فإذا اطلع عليه غير الله نشط ، فهذا إذا تاب يزيد أن يعيد جميع ما عمل . والثالث : دخل في العمل بالإخلاص وخرج به لله فعرف بذلك ومدح عليه وسكن إلى مدحهم ؛ فهذا الرياء الذي نهى الله عنه . قال سهل : قال لقمان لابنه : الرياء أن تطلب ثواب عملك في دار الدنيا ، وإنما عمل القوم للآخرة . قيل له : فما دواء الرياء ؟ قال كتمان العمل ، قيل له : فكيف يكتم العمل ؟ قال : ما كلفت إظهاره من العمل فلا تدخل فيه إلا بالإخلاص ، وما لم تكلف إظهاره أحب ألا يطلع عليه إلا الله . قال : وكل عمل اطلع عليه الخلق فلا تعده من العمل . وقال أيوب السختياني : ما هو بعاقل من أحب أن يعرف مكانه من عمله .\nقلت : قول سهل \" والثالث دخل في العمل بالإخلاص \" إلى آخره ، إن كان سكونه وسروره إليهم لتحصل منزلته في قلوبهم فيحمدوه ويجلوه ويبروه وينال ما يريده منهم من مال أو غيره فهذا مذموم ؛ لأن قلبه مغمور فرحا باطلاعهم عليه ، وإن كانوا قد اطلعوا عليه بعد الفراغ . فأما من أطلع الله عليه خلقه وهو لا يحب اطلاعهم عليه فيسر بصنع الله وبفضله عليه فسروره بفضل الله طاعة ؛ كما قال تعالى : قل بفضل الله وبرحمته فبذلك فليفرحوا هو خير مما يجمعون . وبسط هذا وتتميمه في كتاب \" الرعاية للمحاسبي \" ، فمن أراده فليقف عليه هناك . وقد سئل سهل عن حديث النبي صلى الله عليه وسلم أني أسر العمل فيطلع عليه فيعجبني قال : يعجبه من جهة الشكر لله الذي أظهره الله عليه أو نحو هذا . فهذه جملة كافية في الرياء وخلوص الأعمال . وقد مضى في \" البقرة \" . حقيقة الإخلاص . والحمد لله .\nالثانية : قوله تعالى : وبالوالدين إحسانا قد تقدم في صدر هذه السورة أن من الإحسان إليهما عتقهما ، ويأتي في \" سبحان \" حكم برهما معنى مستوفى . وقرأ ابن أبي عبلة \" إحسان \" بالرفع أي واجب الإحسان إليهما . الباقون بالنصب ، على معنى أحسنوا إليهما إحسانا . قال العلماء : فأحق الناس بعد الخالق المنان بالشكر والإحسان والتزام البر والطاعة له والإذعان من قرن الله الإحسان إليه بعبادته وطاعته وشكره بشكره وهما الوالدان ؛ فقال تعالى : أن اشكر لي ولوالديك . وروى شعبة وهشيم الواسطيان عن يعلى بن عطاء عن أبيه عن عبد الله بن عمرو بن العاص قال : قال رسول الله صلى الله عليه وسلم رضا الرب في رضا الوالدين وسخطه في سخط الوالدين .\nالثالثة : قوله تعالى : وبذي القربى واليتامى والمساكين وقد مضى الكلام فيه في البقرة\nالرابعة : قوله تعالى : والجار ذي القربى والجار الجنب أما الجار فقد أمر الله تعالى بحفظه والقيام بحقه والوصاة برعي ذمته في كتابه وعلى لسان نبيه . ألا تراه سبحانه أكد ذكره بعد الوالدين والأقربين فقال تعالى : والجار ذي القربى أي القريب . والجار الجنب أي الغريب ؛ قاله ابن عباس ، وكذلك هو في اللغة . ومنه فلان أجنبي ، وكذلك الجنابة البعد . وأنشد أهل اللغة :\nفلا تحرمني نائلا عن جنابة فإني امرؤ وسط القباب غريب\nوقال الأعشى :\nأتيت حريثا زائرا عن جنابة فكان حريث عن عطائي جامدا\nوقرأ الأعمش والمفضل \" والجار الجنب \" بفتح الجيم وسكون النون وهما لغتان ؛ يقال : جنب وجنب وأجنب وأجنبي إذا لم يكن بينهما قرابة ، وجمعه أجانب . وقيل : على تقدير حذف المضاف ، أي والجار ذي الجنب أي ذي الناحية . وقال نوف الشامي : الجار ذي القربى المسلم والجار الجنب اليهودي والنصراني .\nقلت : وعلى هذا فالوصاة بالجار مأمور بها مندوب إليها مسلما كان أو كافرا ، وهو الصحيح . والإحسان قد يكون بمعنى المواساة ، وقد يكون بمعنى حسن العشرة وكف الأذى والمحاماة دونه . روى البخاري عن عائشة عن النبي صلى الله عليه وسلم قال : ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه . وروي عن أبي شريح أن النبي صلى الله عليه وسلم قال : والله لا يؤمن والله لا يؤمن والله لا يؤمن ) قيل : يا رسول الله ومن ؟ قال : ( الذي لا يأمن جاره بوائقه وهذا عام في كل جار . وقد أكد عليه السلام ترك إذايته بقسمه ثلاث مرات ، وأنه لا يؤمن الإيمان الكامل من آذى جاره . فينبغي للمؤمن أن يحذر أذى جاره ، وينتهي عما نهى الله ورسوله عنه ، ويرغب فيما رضياه وحضا العباد عليه . وروي عن النبي صلى الله عليه وسلم أنه قال : الجيران ثلاثة فجار له ثلاثة حقوق وجار له حقان وجار له حق واحد فأما الجار الذي له ثلاثة حقوق فالجار المسلم القريب له حق الجوار وحق القرابة وحق الإسلام والجار الذي له حقان فهو الجار المسلم فله حق الإسلام وحق الجوار والجار الذي له حق واحد هو الكافر له حق الجوار .\nالخامسة : روى البخاري عن عائشة قالت : قلت يا رسول الله ، إن لي جارين فإلى أيهما أهدي ، قال : إلى أقربهما منك بابا . فذهب جماعة من العلماء إلى أن هذا الحديث يفسر المراد من قوله تعالى : والجار ذي القربى وأنه القريب المسكن منك . والجار الجنب هو البعيد المسكن منك . واحتجوا بهذا على إيجاب الشفعة للجار ، وعضدوه وبقوله عليه السلام : الجار أحق بصقبه . ولا حجة في ذلك ، فإن عائشة رضي الله عنها إنما سألت النبي صلى الله عليه وسلم عمن تبدأ به من جيرانها في الهدية فأخبرها أن من قرب بابه فإنه أولى بها من غيره . قال ابن المنذر : فدل هذا الحديث على أن الجار يقع على غير اللصيق . وقد خرج أبو حنيفة عن ظاهر هذا الحديث فقال : إن الجار اللصيق إذا ترك الشفعة وطلبها الذي يليه وليس له جدار إلى الدار ولا طريق لا شفعة فيه له . وعوام العلماء يقولون : إن أوصى الرجل لجيرانه أعطي اللصيق وغيره ؛ إلا أبا حنيفة فإنه فارق عوام العلماء وقال : لا يعطى إلا اللصيق وحده .\nالسادسة : واختلف الناس في حد الجيرة ؛ فكان الأوزاعي يقول : أربعون دارا من كل ناحية ؛ وقاله ابن شهاب . وروي أن رجلا جاء إلى النبي صلى الله عليه وسلم فقال : إني نزلت محلة قوم وإن أقربهم إلي جوارا أشدهم لي أذى ؛ فبعث النبي صلى الله عليه وسلم أبا بكر وعمر وعليا يصيحون على أبواب المساجد : ألا إن أربعين دارا جار ولا يدخل الجنة من لا يأمن جاره بوائقه . وقال علي بن أبي طالب : من سمع النداء فهو جار . وقالت فرقة : من سمع إقامة الصلاة فهو جار ذلك المسجد . وقالت فرقة : من ساكن رجلا في محلة أو مدينة فهو جار . قال الله تعالى : لئن لم ينته المنافقون إلى قوله : ثم لا يجاورونك فيها إلا قليلا فجعل تعالى اجتماعهم في المدينة جوارا . والجيرة مراتب بعضها ألصق من بعض ، أدناها الزوجة ؛ كما قال :\nأيا جارتا بيني فإنك طالقه\nالسابعة : ومن إكرام الجار ما رواه مسلم عن أبي ذر قال : قال رسول الله صلى الله عليه وسلم : يا أبا ذر إذا طبخت مرقة فأكثر ماءها وتعاهد جيرانك . فحض عليه السلام على مكارم الأخلاق ؛ لما رتب عليها من المحبة وحسن العشرة ودفع الحاجة والمفسدة ؛ فإن الجار قد يتأذى بقتار قدر جاره ، وربما تكون له ذرية فتهيج من ضعفائهم الشهوة ، ويعظم على القائم عليهم الألم والكلفة ، لا سيما إن كان القائم ضعيفا أو أرملة فتعظم المشقة ويشتد منهم الألم والحسرة . وهذه كانت عقوبة يعقوب في فراق يوسف عليهما السلام فيما قيل . وكل هذا يندفع بتشريكهم في شيء من الطبيخ يدفع إليهم ، ولهذا المعنى حض عليه السلام الجار القريب بالهدية ؛ لأنه ينظر إلى ما يدخل دار جاره وما يخرج منها ، فإذا رأى ذلك أحب أن يشارك فيه ؛ وأيضا فإنه أسرع إجابة لجاره عندما ينوبه من حاجة في أوقات الغفلة والغرة ؛ فلذلك بدأ به على من بعد بابه وإن كانت داره أقرب . والله أعلم .\nالثامنة : قال العلماء : لما قال عليه السلام فأكثر ماءها نبه بذلك على تيسير الأمر على البخيل تنبيها لطيفا ، وجعل الزيادة فيما ليس له ثمن وهو الماء ؛ ولذلك لم يقل : إذا طبخت مرقة فأكثر لحمها ؛ إذ لا يسهل ذلك على كل أحد . ولقد أحسن القائل :\nقدري وقدر الجار واحدة وإليه قبلي ترفع القدر\nولا يهدي النزر اليسير المحتقر ؛ لقوله عليه السلام : ثم انظر أهل بيت من جيرانك فأصبهم منها بمعروف أي بشيء يهدى عرفا ؛ فإن القليل وإن كان مما يهدى فقد لا يقع ذلك الموقع ، فلو لم يتيسر إلا القليل فليهده ولا يحتقر ، وعلى المهدى إليه قبوله ؛ لقوله عليه السلام :يا نساء المؤمنات لا تحتقرن إحداكن لجارتها ولو كراع شاة محرقا أخرجه مالك في موطئه . وكذا قيدناه ( يا نساء المؤمنات ) بالرفع على غير الإضافة ، والتقدير : يا أيها النساء المؤمنات ؛ كما تقول يا رجال الكرام ؛ فالمنادى محذوف وهو يا أيها ، والنساء في التقدير النعت لأيها ، والمؤمنات نعت للنساء . قد قيل : فيه : يا نساء المؤمنات بالإضافة ، والأول أكثر .\nالتاسعة : من إكرام الجار ألا يمنع من غرز خشبة له إرفاقا به ؛ قال رسول الله صلى الله عليه وسلم لا يمنع أحدكم جاره أن يغرز خشبة في جداره . ثم يقول أبو هريرة : ما لي أراكم عنها معرضين ، والله لأرمين بها بين أكنافكم . روي \" خشبه وخشبة \" على الجمع والإفراد . وروي \" أكتافهم \" بالتاء و \" أكنافهم \" بالنون . ومعنى \" لأرمين بها \" أي بالكلمة والقصة . وهل يقضى بهذا على الوجوب أو الندب ؟ فيه خلاف بين العلماء . فذهب مالك وأبو حنيفة وأصحابهما إلى أن معناه الندب إلى بر الجار والتجاوز له والإحسان إليه ، وليس ذلك على الوجوب ؛ بدليل قوله عليه السلام : لا يحل مال امرئ مسلم إلا عن طيب نفس منه . قالوا : ومعنى قوله ( لا يمنع أحدكم جاره ) هو مثل معنى قوله عليه السلام : إذا استأذنت أحدكم امرأته إلى المسجد فلا يمنعها . وهذا معناه عند الجميع الندب ، على ما يراه الرجل من الصلاح والخير في ذلك . وقال الشافعي وأصحابه وأحمد بن حنبل وإسحاق وأبو ثور وداود بن علي وجماعة أهل الحديث : إلى أن ذلك على الوجوب . قالوا : ولولا أن أبا هريرة فهم فيما سمع من النبي صلى الله عليه وسلم معنى الوجوب ما كان ليوجب عليهم غير واجب . وهو مذهب عمر بن الخطاب رضي الله عنه ؛ فإنه قضى على محمد بن مسلمة للضحاك بن خليفة في الخليج أن يمر به في أرض محمد بن مسلمة ، فقال محمد بن مسلمة : لا والله . فقال عمر : والله ليمرن به ولو على بطنك . فأمره عمر أن يمر به ففعل الضحاك ؛ رواه مالك في الموطأ . وزعم الشافعي في كتاب \" الرد \" أن مالكا لم يرو عن أحد من الصحابة خلاف عمر في هذا الباب ؛ وأنكر على مالك أنه رواه وأدخله في كتابه ولم يأخذ به ورده برأيه . قال أبو عمر : ليس كما زعم الشافعي ؛ لأن محمد بن مسلمة كان رأيه في ذلك خلاف رأي عمر ، ورأي الأنصار أيضا كان خلافا لرأي عمر ، وعبد الرحمن بن عوف في قصة الربيع وتحويله - والربيع الساقية - وإذا اختلفت الصحابة وجب الرجوع إلى النظر ، والنظر يدل على أن دماء المسلمين وأموالهم وأعراضهم بعضهم على بعض حرام إلا ما تطيب به النفس خاصة ؛ فهذا هو الثابت عن النبي صلى الله عليه وسلم . ويدل على الخلاف في ذلك قول أبي هريرة : ما لي أراكم عنها معرضين والله لأرمينكم بها ؛ هذا أو نحوه . أجاب الأولون فقالوا : القضاء بالمرفق خارج بالسنة عن معنى قوله عليه السلام : لا يحل مال امرئ مسلم إلا عن طيب نفس منه لأن هذا معناه التمليك والاستهلاك وليس المرفق من ذلك ؛ لأن النبي صلى الله عليه وسلم قد فرق بينهما في الحكم . فغير واجب أن يجمع بين ما فرق رسول الله صلى الله عليه وسلم . وحكى مالك أنه كان بالمدينة قاض يقضي به يسمى أبو المطلب . واحتجوا من الأثر بحديث الأعمش عن أنس قال : استشهد منا غلام يوم أحد فجعلت أمه تمسح التراب عن وجهه وتقول : أبشر هنيئا لك الجنة ؛ فقال لها النبي صلى الله عليه وسلم وما يدريك لعله كان يتكلم فيما لا يعنيه ويمنع ما لا يضره . والأعمش لا يصح له سماع من أنس ، والله أعلم . قاله أبو عمر .\nالعاشرة : ورد حديث جمع النبي صلى الله عليه وسلم فيه مرافق الجار ، وهو حديث معاذ بن جبل قال : قلنا يا رسول الله ، ما حق الجار ؟ قال : إن استقرضك أقرضته وإن استعانك أعنته وإن احتاج أعطيته وإن مرض عدته وإن مات تبعت جنازته وإن أصابه خير سرك وهنيته وإن أصابته مصيبة ساءتك وعزيته ولا تؤذه بقتار قدرك إلا أن تغرف له منها ولا تستطل عليه بالبناء لتشرف عليه وتسد عليه الريح إلا بإذنه وإن اشتريت فاكهة فأهد له منها وإلا فأدخلها سرا لا يخرج ولدك بشيء منه يغيظون به ولده وهل تفقهون ما أقول لكم لن يؤدي حق الجار إلا القليل ممن رحم الله أو كلمة نحوها . هذا حديث جامع وهو حديث حسن ، في إسناده أبو الفضل عثمان بن مطر الشيباني غير مرضي .\nالحادية عشرة : قال العلماء : الأحاديث في إكرام الجار جاءت مطلقة غير مقيدة حتى الكافر كما بينا . وفي الخبر قالوا : يا رسول الله أنطعمهم من لحوم النسك ؟ قال : لا تطعموا المشركين من نسك المسلمين . ونهيه صلى الله عليه وسلم عن إطعام المشركين من نسك المسلمين يحتمل النسك الواجب في الذمة الذي لا يجوز للناسك أن يأكل منه ولا أن يطعمه الأغنياء ؛ فأما غير الواجب الذي يجزيه إطعام الأغنياء فجائز أن يطعمه أهل الذمة . قال النبي صلى الله عليه وسلم لعائشة عند تفريق لحم الأضحية : ابدئي بجارنا اليهودي . وروي أن شاة ذبحت في أهل عبد الله بن عمرو فلما جاء قال : أهديتم لجارنا اليهودي ؟ - ثلاث مرات - سمعت رسول الله صلى الله عليه وسلم يقول : ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه .\nالثانية عشرة : قوله تعالى : والصاحب بالجنب أي الرفيق في السفر . وأسند الطبري أن رسول الله صلى الله عليه وسلم كان معه رجل من أصحابه وهما على راحلتين فدخل رسول الله صلى الله عليه وسلم غيضة ، فقطع قضيبين أحدهما معوج ، فخرج وأعطى لصاحبه القويم ؛ فقال : كنت يا رسول الله أحق بهذا ! فقال : يا فلان إن كل صاحب يصحب آخر فإنه مسئول عن صحابته ولو ساعة من نهار . وقال ربيعة بن أبي عبد الرحمن : للسفر مروءة وللحضر مروءة ؛ فأما المروءة في السفر فبذل الزاد ، وقلة الخلاف على الأصحاب ، وكثرة المزاح في غير مساخط الله . وأما المروءة في الحضر فالإدمان إلى المساجد ، وتلاوة القرآن وكثرة الإخوان في الله عز وجل . ولبعض بني أسد - وقيل إنها لحاتم الطائي :\nإذا ما رفيقي لم يكن خلف ناقتي له مركب فضلا فلا حملت رجلي\nولم يك من زادي له شطر مزودي فلا كنت ذا زاد ولا كنت ذا فضل\nشريكان فيما نحن فيه وقد أرى علي له فضلا بما نال من فضلي\nوقال علي وابن مسعود وابن أبي ليلى : الصاحب بالجنب الزوجة . ابن جريج : هو الذي يصحبك ويلزمك رجاء نفعك . والأول أصح ؛ وهو قول ابن عباس وابن جبير وعكرمة ومجاهد والضحاك . وقد تتناول الآية الجميع بالعموم . والله أعلم .\nالثالثة عشرة : قوله تعالى : وابن السبيل قال مجاهد : هو الذي يجتاز بك مارا . والسبيل الطريق ؛ فنسب المسافر إليه لمروره عليه ولزومه إياه . ومن الإحسان إليه إعطاؤه وإرفاقه وهدايته ورشده .\nالرابعة عشرة : قوله تعالى : وما ملكت أيمانكم أمر الله تعالى بالإحسان إلى المماليك ، وبين ذلك النبي صلى الله عليه وسلم ؛ فروى مسلم وغيره عن المعرور بن سويد قال : مررنا بأبي ذر بالربذة وعليه برد وعلى غلامه مثله ، فقلنا : يا أبا ذر لو جمعت بينهما كانت حلة ؛ فقال : إنه كان بيني وبين رجل من إخواني كلام ، وكانت أمه أعجمية فعيرته بأمه ، فشكاني إلى النبي صلى الله عليه وسلم فلقيت النبي صلى الله عليه وسلم فقال : يا أبا ذر إنك امرؤ فيك جاهلية قلت : يا رسول الله ، من سب الرجال سبوا أباه وأمه . قال : يا أبا ذر إنك امرؤ فيك جاهلية هم إخوانكم جعلهم الله تحت أيديكم فأطعموهم مما تأكلون وألبسوهم مما تلبسون ولا تكلفوهم ما يغلبهم فإن كلفتموهم فأعينوهم . وروي عن أبي هريرة أنه ركب بغلة ذات يوم فأردف غلامه خلفه ، فقال له قائل : لو أنزلته يسعى خلف دابتك ؛ فقال أبو هريرة : لأن يسعى معي ضغثان من نار يحرقان مني ما أحرقا أحب إلي من أن يسعى غلامي خلفي . وخرج أبو داود عن أبي ذر قال : قال رسول الله صلى الله عليه وسلم : من لايمكم من مملوكيكم فأطعموه مما تأكلون واكسوه مما تكتسون ومن لا يلايمكم منهم فبيعوه ولا تعذبوا خلق الله . لايمكم وافقكم . والملايمة الموافقة . وروى مسلم عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال : للمملوك طعامه وكسوته ولا يكلف من العمل إلا ما يطيق وقال عليه السلام : لا يقل أحدكم عبدي وأمتي بل ليقل فتاي وفتاتي وسيأتي بيانه في سورة يوسف عليه السلام . فندب صلى الله عليه وسلم السادة إلى مكارم الأخلاق وحضهم عليها وأرشدهم إلى الإحسان وإلى سلوك طريق التواضع حتى لا يروا لأنفسهم مزية على عبيدهم ، إذ الكل عبيد الله والمال مال الله ، لكن سخر بعضهم لبعض ، وملك بعضهم بعضا إتماما للنعمة وتنفيذا للحكمة ؛ فإن أطعموهم أقل مما يأكلون ، وألبسوهم أقل مما يلبسون صفة ومقدارا جاز إذا قام بواجبه عليه . ولا خلاف في ذلك والله أعلم . وروى مسلم عن عبد الله بن عمرو إذ جاءه قهرمان له فدخل فقال : أعطيت الرقيق قوتهم ؟ قال لا . قال : فانطلق فأعطهم ، قال رسول الله صلى الله عليه وسلم : كفى بالمرء إثما أن يحبس عمن يملك قوتهم .\nالخامسة عشرة : ثبت عن النبي صلى الله عليه وسلم أنه قال : من ضرب عبده حدا لم يأته أو لطمه فكفارته أن يعتقه . ومعناه أن يضربه قدر الحد ولم يكن عليه حد . وجاء عن نفر من الصحابة أنهم اقتصوا للخادم من الولد في الضرب وأعتقوا الخادم لما لم يرد القصاص وقال عليه السلام : من قذف مملوكه بالزنى أقام عليه الحد يوم القيامة ثمانين . وقال عليه السلام : لا يدخل الجنة سيئ الملكة . وقال عليه السلام : سوء الخلق شؤم وحسن الملكة نماء وصلة الرحم تزيد في العمر والصدقة تدفع ميتة السوء .\nالسادسة عشرة : واختلف العلماء من هذا الباب أيهما أفضل الحر أو العبد ؛ فروى مسلم ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : للعبد المملوك المصلح أجران والذي نفس أبي هريرة بيده لولا الجهاد في سبيل الله والحج وبر أمي لأحببت أن أموت وأنا مملوك . وروي عن ابن عمر أن رسول الله صلى الله عليه وسلم قال : إن العبد إذا نصح لسيده وأحسن عبادة الله فله أجره مرتين . فاستدل بهذا وما كان مثله من فضل العبد ؛ لأنه مخاطب من جهتين : مطالب بعبادة الله ، مطالب بخدمة سيده . وإلى هذا ذهب أبو عمر يوسف بن عبد البر النمري وأبو بكر محمد بن عبد الله بن أحمد العامري البغدادي الحافظ .\nاستدل من فضل الحر بأن قال : الاستقلال بأمور الدين والدنيا إنما يحصل بالأحرار والعبد كالمفقود لعدم استقلاله ، وكالآلة المصرفة بالقهر ، وكالبهيمة المسخرة بالجبر ؛ ولذلك سلب مناصب الشهادات ومعظم الولايات ، ونقصت حدوده عن حدود الأحرار إشعارا بخسة المقدار ، والحر وإن طولب من جهة واحدة فوظائفه فيها أكثر ، وعناؤه أعظم فثوابه أكثر . وقد أشار إلى هذا أبو هريرة بقوله : لولا الجهاد والحج ؛ أي لولا النقص الذي يلحق العبد لفوت هذه الأمور . والله أعلم .\nالسابعة عشرة : روى أنس بن مالك ، عن النبي صلى الله عليه وسلم أنه قال : ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه ، وما زال يوصيني بالنساء حتى ظننت أنه سيحرم طلاقهن ، وما زال يوصيني بالمماليك حتى ظننت أنه سيجعل لهم مدة إذا انتهوا إليها عتقوا ، وما زال يوصيني بالسواك حتى خشيت أن يحفي فمي - وروي حتى كاد - وما زال يوصيني بقيام الليل حتى ظننت أن خيار أمتي لا ينامون ليلا . ذكره أبو الليث السمرقندي في تفسيره .\nالثامنة عشرة : قوله تعالى : إن الله لا يحب - أي لا يرضى - من كان مختالا فخورا . فنفى سبحانه محبته ورضاه عمن هذه صفته ؛ أي لا يظهر عليه آثار نعمه في الآخرة . وفي هذا ضرب من التوعد . والمختال ذو الخيلاء أي الكبر . والفخور : الذي يعدد مناقبه كبرا . والفخر : البذخ والتطاول . وخص هاتين الصفتين بالذكر هنا لأنهما تحملان صاحبيهما على الأنفة من القريب الفقير والجار الفقير وغيرهم ممن ذكر في الآية فيضيع أمر الله بالإحسان إليهم . وقرأ عاصم فيما ذكر المفضل عنه \" والجار الجنب \" بفتح الجيم وسكون النون . قال المهدوي : هو على تقدير حذف المضاف ؛ أي والجار ذي الجنب أي ذي الناحية . وأنشد الأخفش :\nالناس جنب والأمير جنب\nوالجنب الناحية ، أي المتنحي عن القرابة . والله أعلم .\n                                    ",
        "saadi": "وَٱعۡبُدُواْ ٱللَّهَ وَلَا تُشۡرِكُواْ بِهِۦ شَيۡ‍ٔٗاۖ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنٗا وَبِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱلۡجَارِ ذِي ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِيلِ وَمَا مَلَكَتۡ أَيۡمَٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا يُحِبُّ مَن كَانَ مُخۡتَالٗا فَخُورًا ٦٣\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده بعبادته وحده لا شريك له، وهو الدخول تحت رق عبوديته، والانقياد لأوامره ونواهيه، محبة وذلا وإخلاصا له، في جميع العبادات الظاهرة والباطنة. وينهى عن الشرك به شيئا لا شركا أصغر ولا أكبر، لا ملكا ولا نبيا ولا وليا ولا غيرهم من المخلوقين الذين لا يملكون لأنفسهم نفعا ولا ضرا ولا موتا ولا حياة ولا نشورا، بل الواجب المتعين إخلاص العبادة لمن له الكمال المطلق من جميع الوجوه، وله التدبير الكامل الذي لا يشركه ولا يعينه عليه أحد. ثم بعد ما أمر بعبادته والقيام بحقه أمر بالقيام بحقوق العباد الأقرب فالأقرب. فقال: { وَبِالْوَالِدَيْنِ إِحْسَانًا } أي: أحسنوا إليهم بالقول الكريم والخطاب اللطيف والفعل الجميل بطاعة أمرهما واجتناب نهيهما والإنفاق عليهما وإكرام من له تعلق بهما وصلة الرحم التي لا رحم لك إلا بهما. وللإحسان ضدان، الإساءةُ وعدمُ الإحسان. وكلاهما منهي عنه. { وَبِذِي الْقُرْبَى } أيضا إحسانا، ويشمل ذلك جميع الأقارب، قربوا أو بعدوا، بأن يحسن إليهم بالقول والفعل، وأن لا يقطع برحمه بقوله أو فعله. { وَالْيَتَامَى } أي: الذين فقدوا آباءهم وهم صغار، فلهم حق على المسلمين، سواء كانوا أقارب أو غيرهم بكفالتهم وبرهم وجبر خواطرهم وتأديبهم، وتربيتهم أحسن تربية في مصالح دينهم ودنياهم. { وَالْمَسَاكِين } وهم الذين أسكنتهم الحاجة والفقر، فلم يحصلوا على كفايتهم، ولا كفاية من يمونون، فأمر الله تعالى بالإحسان إليهم، بسد خلتهم وبدفع فاقتهم، والحض على ذلك، والقيام بما يمكن منه. { وَالْجَارِ ذِي الْقُرْبَى } أي: الجار القريب الذي له حقان حق الجوار وحق القرابة، فله على جاره حق وإحسان راجع إلى العرف. { و } كذلك { الْجَارِ الْجُنُبِ } أي: الذي ليس له قرابة. وكلما كان الجار أقرب بابًا كان آكد حقًّا، فينبغي للجار أن يتعاهد جاره بالهدية والصدقة والدعوة واللطافة بالأقوال والأفعال وعدم أذيته بقول أو فعل. { وَالصَّاحِبِ بِالْجَنْبِ } قيل: الرفيق في السفر، وقيل: الزوجة، وقيل الصاحب مطلقا، ولعله أولى، فإنه يشمل الصاحب في الحضر والسفر ويشمل الزوجة. فعلى الصاحب لصاحبه حق زائد على مجرد إسلامه، من مساعدته على أمور دينه ودنياه، والنصح له؛ والوفاء معه في اليسر والعسر، والمنشط والمكره، وأن يحب له ما يحب لنفسه، ويكره له ما يكره لنفسه، وكلما زادت الصحبة تأكد الحق وزاد. { وَابْنَ السَّبِيلِ } وهو: الغريب الذي احتاج في بلد الغربة أو لم يحتج، فله حق على المسلمين لشدة حاجته وكونه في غير وطنه بتبليغه إلى مقصوده أو بعض مقصوده [وبإكرامه وتأنيسه] { وَمَا مَلَكَتْ أَيْمَانُكُمْ } : أي: من الآدميين والبهائم بالقيام بكفايتهم وعدم تحميلهم ما يشق عليهم وإعانتهم على ما يتحملون، وتأديبهم لما فيه مصلحتهم. فمن قام بهذه المأمورات فهو الخاضع لربه، المتواضع لعباد الله، المنقاد لأمر الله وشرعه، الذي يستحق الثواب الجزيل والثناء الجميل، ومن لم يقم بذلك فإنه عبد معرض عن ربه، غير منقاد لأوامره، ولا متواضع للخلق، بل هو متكبر على عباد الله معجب بنفسه فخور بقوله، ولهذا قال: { إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ مُخْتَالًا } أي: معجبا بنفسه متكبرًا على الخلق { فَخُورًا } يثني على نفسه ويمدحها على وجه الفخر والبطر على عباد الله، فهؤلاء ما بهم من الاختيال والفخر يمنعهم من القيام بالحقوق.\n                                    "
      },
      "originalText": "۞ وَٱعۡبُدُواْ ٱللَّهَ وَلَا تُشۡرِكُواْ بِهِۦ شَيۡ‍ٔٗاۖ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنٗا وَبِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱلۡجَارِ ذِي ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِيلِ وَمَا مَلَكَتۡ أَيۡمَٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا يُحِبُّ مَن كَانَ مُخۡتَالٗا فَخُورًا ٦٣"
    },
    {
      "number": 530,
      "text": "الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَيَكْتُمُونَ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ ۗ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 37,
      "juz": 5,
      "manzil": 1,
      "page": 84,
      "ruku": 67,
      "hizbQuarter": 34,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِ وَيَكۡتُمُونَ مَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَأَعۡتَدۡنَا لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ٧٣\n                                    \n                                    \n                                    يقول تعالى ذاما الذين يبخلون بأموالهم أن ينفقوها فيما أمرهم الله به - من بر الوالدين ، والإحسان إلى الأقارب واليتامى والمساكين ، والجار ذي القربى ، والجار الجنب ، والصاحب بالجنب ، وابن السبيل ، وما ملكت أيمانكم من الأرقاء - ولا يدفعون حق الله فيها ، ويأمرون الناس بالبخل أيضا . وقد قال رسول الله صلى الله عليه وسلم : \" وأي داء أدوأ من البخل ؟ \" . وقال : \" إياكم والشح ، فإنه أهلك من كان قبلكم ، أمرهم بالقطيعة فقطعوا ، وأمرهم بالفجور ففجروا \" .\nوقوله : ( ويكتمون ما آتاهم الله من فضله ) فالبخيل جحود لنعمة الله عليه لا تظهر عليه ولا تبين ، لا في أكله ولا في ملبسه ، ولا في إعطائه وبذله ، كما قال تعالى : ( إن الإنسان لربه لكنود . وإنه على ذلك لشهيد ) [ العاديات : 6 ، 7 ] أي : بحاله وشمائله ، ( وإنه لحب الخير لشديد ) [ العاديات : 8 ] وقال هاهنا : ( ويكتمون ما آتاهم الله من فضله ) ولهذا توعدهم بقوله : ( وأعتدنا للكافرين عذابا مهينا ) والكفر هو الستر والتغطية ، فالبخيل يستر نعمة الله عليه ويكتمها ويجحدها ، فهو كافر لنعم الله عليه .\nوفي الحديث : \" إن الله إذا أنعم نعمة على عبد أحب أن يظهر أثرها عليه \" وفي الدعاء النبوي : \" واجعلنا شاكرين لنعمتك ، مثنين بها عليك قابليها - ويروى : قائليها - وأتممها علينا \" .\nوقد حمل بعض السلف هذه الآية على بخل اليهود بإظهار العلم الذي عندهم ، من صفة النبي صلى الله عليه وسلم وكتمانهم ذلك ; ولهذا قال : ( وأعتدنا للكافرين عذابا مهينا ) رواه ابن إسحاق ، عن محمد بن أبي محمد ، عن عكرمة أو سعيد بن جبير ، عن ابن عباس . وقاله مجاهد وغير واحد .\nولا شك أن الآية محتملة لذلك ، والظاهر أن السياق في البخل بالمال ، وإن كان البخل بالعلم داخلا في ذلك بطريق الأولى ; فإن سياق الكلام في الإنفاق على الأقارب والضعفاء ،وكذا الآية التي بعدها ، وهي قوله :\n                                    ",
        "qortoby": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِ وَيَكۡتُمُونَ مَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَأَعۡتَدۡنَا لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ٧٣\n                                    \n                                    \n                                    قوله تعالى : الذين يبخلون ويأمرون الناس بالبخل ويكتمون ما آتاهم الله من فضله وأعتدنا للكافرين عذابا مهينا\nقوله تعالى : الذين يبخلون ويأمرون الناس بالبخل فيه مسألتان :\nالأولى : قوله تعالى : الذين يبخلون الذين في موضع نصب على البدل من \" من \" في قوله : من كان ولا يكون صفة ؛ لأن \" من \" و \" ما \" لا يوصفان ولا يوصف بهما . ويجوز أن يكون في موضع رفع بدلا من المضمر الذي في فخور . ويجوز أن يكون في موضع رفع فيعطف عليه . ويجوز أن يكون ابتداء والخبر محذوف ، أي الذين يبخلون ، لهم كذا ، أو يكون الخبر إن الله لا يظلم مثقال ذرة . ويجوز أن يكون منصوبا بإضمار أعني ، فتكون الآية في المؤمنين ؛ فتجيء الآية على هذا التأويل أن الباخلين منفية عنهم محبة الله ، فأحسنوا أيها المؤمنون إلى من سمي فإن الله لا يحب من فيه الخلال المانعة من الإحسان .\nالثانية : قوله تعالى : يبخلون ويأمرون الناس بالبخل البخل المذموم في الشرع هو الامتناع من أداء ما أوجب الله تعالى عليه . وهو مثل قوله تعالى : ولا يحسبن الذين يبخلون بما آتاهم الله من فضله الآية . وقد مضى في \" آل عمران \" القول في البخل وحقيقته ، والفرق بينه وبين الشح مستوفى . والمراد بهذه الآية في قول ابن عباس وغيره اليهود ؛ فإنهم جمعوا بين الاختيال والفخر والبخل بالمال وكتمان ما أنزل الله من التوراة من نعت محمد صلى الله عليه وسلم . وقيل : المراد المنافقون الذي كان إنفاقهم وإيمانهم تقية ، والمعنى إن الله لا يحب كل مختال فخور ، ولا الذين يبخلون ؛ على ما ذكرنا من إعرابه .\nقوله تعالى : وأعتدنا للكافرين عذابا مهينا فصل تعالى توعد المؤمنين الباخلين من توعد الكافرين بأن جعل الأول عدم المحبة والثاني عذابا مهينا .\n                                    ",
        "saadi": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِ وَيَكۡتُمُونَ مَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَأَعۡتَدۡنَا لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ٧٣\n                                        \n                                        \n                                        \n                                        { الَّذِينَ يَبْخَلُونَ } أي: يمنعون ما عليهم من الحقوق الواجبة. { وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ } بأقوالهم وأفعالهم { وَيَكْتُمُونَ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ } أي: من العلم الذي يهتدي به الضالون ويسترشد به الجاهلون فيكتمونه عنهم، ويظهرون لهم من الباطل ما يحول بينهم وبين الحق. فجمعوا بين البخل بالمال والبخل بالعلم، وبين السعي في خسارة أنفسهم وخسارة غيرهم، وهذه هي صفات الكافرين، فلهذا قال تعالى: { وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا } أي: كما تكبروا على عباد الله ومنعوا حقوقه وتسببوا في منع غيرهم من البخل وعدم الاهتداء، أهانهم بالعذاب الأليم والخزي الدائم. فعياذًا بك اللهم من كل سوء.\n                                    "
      },
      "originalText": "ٱلَّذِينَ يَبۡخَلُونَ وَيَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِ وَيَكۡتُمُونَ مَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَأَعۡتَدۡنَا لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ٧٣"
    }
  ]
}