{
  "number": 89,
  "ayahsNumber": 9,
  "ayahs": [
    {
      "number": 559,
      "text": "وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ اقْتُلُوا أَنْفُسَكُمْ أَوِ اخْرُجُوا مِنْ دِيَارِكُمْ مَا فَعَلُوهُ إِلَّا قَلِيلٌ مِنْهُمْ ۖ وَلَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ لَكَانَ خَيْرًا لَهُمْ وَأَشَدَّ تَثْبِيتًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 66,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 70,
      "hizbQuarter": 35,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَوۡ أَنَّا كَتَبۡنَا عَلَيۡهِمۡ أَنِ ٱقۡتُلُوٓاْ أَنفُسَكُمۡ أَوِ ٱخۡرُجُواْ مِن دِيَٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٞ مِّنۡهُمۡۖ وَلَوۡ أَنَّهُمۡ فَعَلُواْ مَا يُوعَظُونَ بِهِۦ لَكَانَ خَيۡرٗا لَّهُمۡ وَأَشَدَّ تَثۡبِيتٗا ٦٦\n                                    \n                                    \n                                    يخبر تعالى عن أكثر الناس أنهم لو أمروا بما هم مرتكبونه من المناهي لما فعلوه ; لأن طباعهم الرديئة مجبولة على مخالفة الأمر ، وهذا من علمه - تبارك وتعالى - بما لم يكن أو كان فكيف كان يكون ; ولهذا قال تعالى : ( ولو أنا كتبنا عليهم أن اقتلوا أنفسكم أو اخرجوا من دياركم ما فعلوه إلا قليل منهم )\nقال ابن جرير : حدثني المثنى ، حدثني إسحاق ، حدثنا أبو زهير عن إسماعيل ، عن أبي إسحاق السبيعي ، قال : لما نزلت : ( ولو أنا كتبنا عليهم أن اقتلوا أنفسكم أو اخرجوا من دياركم ما فعلوه إلا قليل [ منهم ] ) الآية ، قال رجل : لو أمرنا لفعلنا ، والحمد لله الذي عافانا . فبلغ ذلك النبي صلى الله عليه وسلم فقال : \" إن من أمتي لرجالا الإيمان أثبت في قلوبهم من الجبال الرواسي \" .\nوقال ابن أبي حاتم : حدثنا جعفر بن منير ، حدثنا روح ، حدثنا ، عن الحسن قال : لما نزلت هذه الآية : ( ولو أنا كتبنا عليهم أن اقتلوا أنفسكم ) الآية . قال أناس من أصحاب النبي صلى الله عليه وسلم : لو فعل ربنا لفعلنا ، فبلغ النبي صلى الله عليه وسلم فقال : \" للإيمان أثبت في قلوب أهله من الجبال الرواسي \" .\nوقال السدي : افتخر ثابت بن قيس بن شماس ورجل من اليهود ، فقال اليهودي : والله لقد كتب الله علينا القتل فقتلنا أنفسنا . فقال ثابت : والله لو كتب علينا : ( أن اقتلوا أنفسكم ) لقتلنا . فأنزل الله هذه الآية . رواه ابن أبي حاتم .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا محمود بن غيلان ، حدثنا بشر بن السري ، حدثنا مصعب بن ثابت ، عن عمه عامر بن عبد الله بن الزبير ، قال : لما نزلت [ ( ولو أنا كتبنا عليهم أن اقتلوا أنفسكم ) قال أبو بكر : يا رسول الله ، والله لو أمرتني أن أقتل نفسي لفعلت ، قال : \" صدقت يا أبا بكر \" .\nحدثنا أبي ، حدثنا محمد بن أبي عمر العدني قال : سئل سفيان عن قوله ] ( ولو أنا كتبنا عليهم أن اقتلوا أنفسكم أو اخرجوا من دياركم ما فعلوه إلا قليل منهم ) قال : قال رسول الله صلى الله عليه وسلم : \" لو نزلت لكان ابن أم عبد منهم \" .\nوحدثنا أبي ، حدثنا أبو اليمان ، حدثنا إسماعيل بن عياش ، عن صفوان بن عمرو ، عن شريح بن عبيد قال : لما تلا رسول الله صلى الله عليه وسلم هذه الآية : ( ولو أنا كتبنا عليهم أن اقتلوا أنفسكم [ أو اخرجوا من دياركم ما فعلوه إلا قليل منهم ] ) الآية ، أشار رسول الله صلى الله عليه وسلم بيده إلى عبد الله بن رواحة ، فقال : \" لو أن الله كتب ذلك لكان هذا من أولئك القليل \" يعني : ابن رواحة .\nولهذا قال تعالى : ( ولو أنهم فعلوا ما يوعظون به ) أي : ولو أنهم فعلوا ما يؤمرون به ، وتركوا ما ينهون عنه ( لكان خيرا لهم ) أي : من مخالفة الأمر وارتكاب النهي ( وأشد تثبيتا ) قال السدي : أي : وأشد تصديقا .\n                                    ",
        "qortoby": "وَلَوۡ أَنَّا كَتَبۡنَا عَلَيۡهِمۡ أَنِ ٱقۡتُلُوٓاْ أَنفُسَكُمۡ أَوِ ٱخۡرُجُواْ مِن دِيَٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٞ مِّنۡهُمۡۖ وَلَوۡ أَنَّهُمۡ فَعَلُواْ مَا يُوعَظُونَ بِهِۦ لَكَانَ خَيۡرٗا لَّهُمۡ وَأَشَدَّ تَثۡبِيتٗا ٦٦\n                                    \n                                    \n                                    قوله تعالى : ولو أنا كتبنا عليهم أن اقتلوا أنفسكم أو اخرجوا من دياركم ما فعلوه إلا قليل منهم ولو أنهم فعلوا ما يوعظون به لكان خيرا لهم وأشد تثبيتا\nسبب نزولها ما روي أن ثابت بن قيس بن شماس تفاخر هو ويهودي ؛ فقال اليهودي : والله لقد كتب علينا أن نقتل أنفسنا فقتلنا ، وبلغت القتلى سبعين ألفا ؛ فقال ثابت : والله لو كتب الله علينا أن اقتلوا أنفسكم لفعلنا . وقال أبو إسحاق السبيعي : لما نزلت ولو أنا كتبنا عليهم الآية ، قال رجل : لو أمرنا لفعلنا ، والحمد لله الذي عافانا . فبلغ ذلك رسول الله صلى الله عليه وسلم فقال : إن من أمتي رجالا الإيمان أثبت في قلوبهم من الجبال الرواسي . قال ابن وهب قال مالك : القائل ذلك هو أبو بكر الصديق رضي الله عنه ؛ وهكذا ذكر مكي أنه أبو بكر . وذكر النقاش أنه عمر بن الخطاب رضي الله عنه . وذكر عن أبي بكر رضي الله عنه أنه قال : لو كتب علينا ذلك لبدأت بنفسي وأهل بيتي . وذكر أبو الليث السمرقندي : أن القائل منهم عمار بن ياسر وابن مسعود وثابت بن قيس ، قالوا : لو أن الله أمرنا أن نقتل أنفسنا أو نخرج من ديارنا لفعلنا ؛ فقال النبي صلى الله عليه وسلم : الإيمان أثبت في قلوب الرجال من الجبال الرواسي . ولو حرف يدل على امتناع الشيء لامتناع غيره ؛ فأخبر الله سبحانه أنه لم يكتب ذلك علينا رفقا بنا لئلا تظهر معصيتنا . فكم من أمر قصرنا عنه مع خفته فكيف بهذا الأمر مع ثقله ! لكن أما والله لقد ترك المهاجرون مساكنهم خاوية وخرجوا يطلبون بها عيشة راضية . ما فعلوه أي القتل والخروج إلا قليل منهم قليل بدل من الواو ، والتقدير ما فعله أحد إلا قليل . وأهل الكوفة يقولون : هو على التكرير ما فعلوه ما فعله إلا قليل منهم . وقرأ عبد الله بن عامر وعيسى بن عمر \" إلا قليلا \" على الاستثناء . وكذلك هو في مصاحف أهل الشام . الباقون بالرفع ، والرفع أجود عند جميع النحويين . وقيل : انتصب على إضمار فعل ، تقديره إلا أن يكون قليلا منهم . وإنما صار الرفع أجود لأن اللفظ أولى من المعنى ، وهو أيضا يشتمل على المعنى . وكان من القليل أبو بكر وعمر وثابت بن قيس كما ذكرنا . وزاد الحسن ومقاتل عمارا وابن مسعود وقد ذكرناهما . ولو أنهم فعلوا ما يوعظون به لكان خيرا لهم أي في الدنيا والآخرة . وأشد تثبيتا أي على الحق .\n                                    ",
        "saadi": "وَلَوۡ أَنَّا كَتَبۡنَا عَلَيۡهِمۡ أَنِ ٱقۡتُلُوٓاْ أَنفُسَكُمۡ أَوِ ٱخۡرُجُواْ مِن دِيَٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٞ مِّنۡهُمۡۖ وَلَوۡ أَنَّهُمۡ فَعَلُواْ مَا يُوعَظُونَ بِهِۦ لَكَانَ خَيۡرٗا لَّهُمۡ وَأَشَدَّ تَثۡبِيتٗا ٦٦\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه لو كتب على عباده الأوامر الشاقة على النفوس من قتل النفوس والخروج من الديار لم يفعله إلا القليل منهم والنادر، فليحمدوا ربهم وليشكروه على تيسير ما أمرهم به من الأوامر التي تسهل على كل أحد، ولا يشق فعلها، وفي هذا إشارة إلى أنه ينبغي أن يلحظ العبد ضد ما هو فيه من المكروهات، لتخف عليه العبادات، ويزداد حمدًا وشكرًا لربه. ثم أخبر أنهم لو فعلوا ما يوعظون به أي: ما وُظِّف عليهم في كل وقت بحسبه، فبذلوا هممهم، ووفروا نفوسهم للقيام به وتكميله، ولم تطمح نفوسهم لما لم يصلوا إليه، ولم يكونوا بصدده، وهذا هو الذي ينبغي للعبد، أن ينظر إلى الحالة التي يلزمه القيام بها فيكملها، ثم يتدرج شيئًا فشيئًا حتى يصل إلى ما قدر له من العلم والعمل في أمر الدين والدنيا، وهذا بخلاف من طمحت نفسه إلى أمر لم يصل إليه ولم يؤمر به بعد، فإنه لا يكاد يصل إلى ذلك بسبب تفريق الهمة، وحصول الكسل وعدم النشاط. ثم رتب ما يحصل لهم على فعل ما يوعظون به، وهو أربعة أمور: (أحدها) الخيرية في قوله: { لَكَانَ خَيْرًا لَهُمْ } أي: لكانوا من الأخيار المتصفين بأوصافهم من أفعال الخير التي أمروا بها، أي: وانتفى عنهم بذلك صفة الأشرار، لأن ثبوت الشيء يستلزم نفي ضده. (الثاني) حصول التثبيت والثبات وزيادته، فإن الله يثبت الذين آمنوا بسبب ما قاموا به من الإيمان، الذي هو القيام بما وعظوا به، فيثبتهم في الحياة الدنيا عند ورود الفتن في الأوامر والنواهي والمصائب، فيحصل لهم ثبات يوفقون لفعل الأوامر وترك الزواجر التي تقتضي النفس فعلها، وعند حلول المصائب التي يكرهها العبد. فيوفق للتثبيت بالتوفيق للصبر أو للرضا أو للشكر. فينزل عليه معونة من الله للقيام بذلك، ويحصل له الثبات على الدين، عند الموت وفي القبر. وأيضا فإن العبد القائم بما أمر به، لا يزال يتمرن على الأوامر الشرعية حتى يألفها ويشتاق إليها وإلى أمثالها، فيكون ذلك معونة له على الثبات على الطاعات. (الثالث) قوله: { وَإِذًا لَآتَيْنَاهُمْ مِنْ لَدُنَّا أَجْرًا عَظِيمًا } أي: في العاجل والآجل الذي يكون للروح والقلب والبُدن، ومن النعيم المقيم مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر. (الرابع) الهداية إلى صراط مستقيم. وهذا عموم بعد خصوص، لشرف الهداية إلى الصراط المستقيم، من كونها متضمنة للعلم بالحق، ومحبته وإيثاره والعمل به، وتوقف السعادة والفلاح على ذلك، فمن هُدِيَ إلى صراط مستقيم، فقد وُفِّقَ لكل خير واندفع عنه كل شر وضير.\n                                    "
      },
      "originalText": "وَلَوۡ أَنَّا كَتَبۡنَا عَلَيۡهِمۡ أَنِ ٱقۡتُلُوٓاْ أَنفُسَكُمۡ أَوِ ٱخۡرُجُواْ مِن دِيَٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٞ مِّنۡهُمۡۖ وَلَوۡ أَنَّهُمۡ فَعَلُواْ مَا يُوعَظُونَ بِهِۦ لَكَانَ خَيۡرٗا لَّهُمۡ وَأَشَدَّ تَثۡبِيتٗا ٦٦"
    },
    {
      "number": 560,
      "text": "وَإِذًا لَآتَيْنَاهُمْ مِنْ لَدُنَّا أَجْرًا عَظِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 67,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 70,
      "hizbQuarter": 35,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذٗا لَّأٓتَيۡنَٰهُم مِّن لَّدُنَّآ أَجۡرًا عَظِيمٗا ٧٦\n                                    \n                                    \n                                    ( وإذا لآتيناهم من لدنا ) أي : من عندنا ، ( أجرا عظيما ) يعني : الجنة .\n                                    ",
        "qortoby": "وَإِذٗا لَّأٓتَيۡنَٰهُم مِّن لَّدُنَّآ أَجۡرًا عَظِيمٗا ٧٦\n                                    \n                                    \n                                    وإذا لآتيناهم من لدنا أجرا عظيما أي ثوابا في الآخرة . وقيل : اللام لام الجواب ، وإذا دالة على الجزاء ، والمعنى لو فعلوا ما يوعظون به لآتيناهم .\n                                    ",
        "saadi": "وَإِذٗا لَّأٓتَيۡنَٰهُم مِّن لَّدُنَّآ أَجۡرًا عَظِيمٗا ٧٦\n                                        \n                                        \n                                        \n                                        رتب ما يحصل لهم على فعل ما يوعظون به، وهو أربعة أمور:(الثالث) قوله: { وَإِذًا لَآتَيْنَاهُمْ مِنْ لَدُنَّا أَجْرًا عَظِيمًا } أي: في العاجل والآجل الذي يكون للروح والقلب والبُدن، ومن النعيم المقيم مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.\n                                    "
      },
      "originalText": "وَإِذٗا لَّأٓتَيۡنَٰهُم مِّن لَّدُنَّآ أَجۡرًا عَظِيمٗا ٧٦"
    },
    {
      "number": 561,
      "text": "وَلَهَدَيْنَاهُمْ صِرَاطًا مُسْتَقِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 68,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 70,
      "hizbQuarter": 35,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَهَدَيۡنَٰهُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٨٦\n                                    \n                                    \n                                    ( ولهديناهم صراطا مستقيما ) أي في الدنيا والآخرة .\n                                    ",
        "qortoby": "وَلَهَدَيۡنَٰهُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٨٦\n                                    \n                                    \n                                    أصل الصراط في كلام العرب الطريق ; قال عامر بن الطفيل : شحنا أرضهم بالخيل حتى تركناهم أذل من الصراط وقال جرير : أمير المؤمنين على صراط إذا اعوج الموارد مستقيم وقال آخر : فصد عن نهج الصراط الواضح حكى النقاش : الصراط الطريق بلغة الروم ; فقال ابن عطية : وهذا ضعيف جدا .\nوقرئ : السراط ( بالسين ) من الاستراط بمعنى الابتلاع ; كأن الطريق يسترط من يسلكه .\nوقرئ بين الزاي والصاد .\nوقرئ بزاي خالصة والسين الأصل .\nوحكى سلمة عن الفراء قال : الزراط بإخلاص الزاي لغة لعذرة وكلب وبني القين , قال : وهؤلاء يقولون [ في أصدق ] : أزدق .\nوقد قالوا الأزد والأسد ولسق به ولصق به .\nو \" الصراط \" نصب على المفعول الثاني ; لأن الفعل من الهداية يتعدى إلى المفعول الثاني بحرف جر ; قال الله تعالى : \" فاهدوهم إلى صراط الجحيم \" .\n[ الصافات : 23 ] .\nوبغير حرف كما في هذه الآية .\n\" المستقيم \" صفة ل \" الصراط \" وهو الذي لا اعوجاج فيه ولا انحراف ; ومنه قوله تعالى : \" وأن هذا صراطي مستقيما فاتبعوه \" [ الأنعام : 153 ] وأصله مستقوم , نقلت الحركة إلى القاف وانقلبت الواو ياء لانكسار ما قبلها .\n                                    ",
        "saadi": "وَلَهَدَيۡنَٰهُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٨٦\n                                        \n                                        \n                                        \n                                        رتب ما يحصل لهم على فعل ما يوعظون به، وهو أربعة أمور: ( الرابع ) الهداية إلى صراط مستقيم. وهذا عموم بعد خصوص، لشرف الهداية إلى الصراط المستقيم، من كونها متضمنة للعلم بالحق، ومحبته وإيثاره والعمل به، وتوقف السعادة والفلاح على ذلك، فمن هُدِيَ إلى صراط مستقيم، فقد وُفِّقَ لكل خير واندفع عنه كل شر وضير.\n                                    "
      },
      "originalText": "وَلَهَدَيۡنَٰهُمۡ صِرَٰطٗا مُّسۡتَقِيمٗا ٨٦"
    },
    {
      "number": 562,
      "text": "وَمَنْ يُطِعِ اللَّهَ وَالرَّسُولَ فَأُولَٰئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ ۚ وَحَسُنَ أُولَٰئِكَ رَفِيقًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 69,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 70,
      "hizbQuarter": 35,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَن يُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُوْلَٰٓئِكَ مَعَ ٱلَّذِينَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِم مِّنَ ٱلنَّبِيِّ‍ۧنَ وَٱلصِّدِّيقِينَ وَٱلشُّهَدَآءِ وَٱلصَّٰلِحِينَۚ وَحَسُنَ أُوْلَٰٓئِكَ رَفِيقٗا ٩٦\n                                    \n                                    \n                                    ثم قال تعالى : ( ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا ) أي : من عمل بما أمره الله ورسوله ، وترك ما نهاه الله عنه ورسوله ، فإن الله عز وجل يسكنه دار كرامته ، ويجعله مرافقا للأنبياء ثم لمن بعدهم في الرتبة ، وهم الصديقون ، ثم الشهداء ، ثم عموم المؤمنين وهم الصالحون الذين صلحت سرائرهم وعلانيتهم .\nثم أثنى عليهم تعالى فقال : ( وحسن أولئك رفيقا )\nوقال البخاري : حدثنا محمد بن عبد الله بن حوشب ، حدثنا إبراهيم بن سعد ، عن أبيه ، عن عروة ، عن عائشة قالت : سمعت رسول الله صلى الله عليه وسلم يقول : \" ما من نبي يمرض إلا خير بين الدنيا والآخرة \" وكان في شكواه التي قبض فيه ، فأخذته بحة شديدة فسمعته يقول : ( مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين ) فعلمت أنه خير .\nوكذا رواه مسلم من حديث شعبة ، عن سعد بن إبراهيم به .\nوهذا معنى قوله صلى الله عليه وسلم في الحديث الآخر : \" اللهم في الرفيق الأعلى \" ثلاثا ثم قضى ، عليه أفضل الصلاة والتسليم .\nذكر سبب نزول هذه الآية الكريمة :\nقال ابن جرير : حدثنا ابن حميد ، حدثنا يعقوب القمي ، عن جعفر بن أبي المغيرة ، عن سعيد بن جبير قال : جاء رجل من الأنصار إلى النبي صلى الله عليه وسلم وهو محزون ، فقال له النبي صلى الله عليه وسلم : \" يا فلان ، ما لي أراك محزونا ؟ \" قال : يا نبي الله شيء فكرت فيه ؟ قال : \" ما هو ؟ \" قال : نحن نغدو عليك ونروح ، ننظر إلى وجهك ونجالسك ، وغدا ترفع مع النبيين فلا نصل إليك . فلم يرد النبي صلى الله عليه وسلم عليه شيئا ، فأتاه جبريل بهذه الآية : ( ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين [ والصديقين والشهداء والصالحين وحسن أولئك رفيقا ] ) فبعث النبي صلى الله عليه وسلم فبشره .\nقد روي هذا الأثر مرسلا عن مسروق ، وعكرمة ، وعامر الشعبي ، وقتادة ، وعن الربيع بن أنس ، وهو من أحسنها سندا .\nقال ابن جرير : حدثنا المثنى ، حدثنا ابن أبي جعفر ، عن أبيه ، عن الربيع ، قوله : ( ومن يطع الله والرسول [ فأولئك مع الذين أنعم الله عليهم من ] ) الآية ، قال : إن أصحاب النبي صلى الله عليه وسلم قالوا : قد علمنا أن النبي صلى الله عليه وسلم له فضل على من آمن به في درجات الجنة ممن اتبعه وصدقه ، وكيف لهم إذا اجتمعوا في الجنة أن يرى بعضهم بعضا ؟ فأنزل الله في ذلك - يعني هذه الآية - فقال : يعني رسول الله صلى الله عليه وسلم : \" إن الأعلين ينحدرون إلى من هو أسفل منهم ، فيجتمعون في رياضها ، فيذكرون ما أنعم الله عليهم ويثنون عليه ، وينزل لهم أهل الدرجات فيسعون عليهم بما يشتهون وما يدعون به ، فهم في روضة يحبرون ويتنعمون فيه \" .\nوقد روي مرفوعا من وجه آخر ، فقال أبو بكر بن مردويه : حدثنا عبد الرحيم بن محمد بن مسلم ، حدثنا إسماعيل بن أحمد بن أسيد ، حدثنا عبد الله بن عمران ، حدثنا فضيل بن عياض ، عن منصور ، عن إبراهيم ، عن الأسود ، عن عائشة قالت : جاء رجل إلى النبي صلى الله عليه وسلم فقال : يا رسول الله : إنك لأحب إلي من نفسي وأحب إلي من أهلي ، وأحب إلي من ولدي ، وإني لأكون في البيت فأذكرك فما أصبر حتى آتيك فأنظر إليك ، وإذا ذكرت موتي وموتك عرفت أنك إذا دخلت الجنة رفعت مع النبيين ، وإن دخلت الجنة خشيت ألا أراك . فلم يرد عليه النبي صلى الله عليه وسلم حتى نزلت عليه : ( ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا )\nوهكذا رواه الحافظ أبو عبد الله المقدسي في كتابه : \" صفة الجنة \" ، من طريق الطبراني ، عن أحمد بن عمرو بن مسلم الخلال ، عن عبد الله بن عمران العابدي ، به . ثم قال : لا أرى بإسناده بأسا والله أعلم .\nوقال ابن مردويه أيضا : حدثنا سليمان بن أحمد ، حدثنا العباس بن الفضل الأسفاطي ، حدثنا أبو بكر بن ثابت بن عباس المصري حدثنا خالد بن عبد الله ، عن عطاء بن السائب ، عن عامر الشعبي ، عن ابن عباس ، أن رجلا أتى النبي صلى الله عليه وسلم فقال : يا رسول الله ، إني لأحبك حتى إني لأذكرك في المنزل فيشق ذلك علي وأحب أن أكون معك في الدرجة . فلم يرد عليه رسول الله صلى الله عليه وسلم شيئا ، فأنزل الله عز وجل [ ( ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا ) ] .\nوقد رواه ابن جرير ، عن ابن حميد ، عن جرير ، عن عطاء ، عن الشعبي ، مرسلا . وثبت في صحيح مسلم من حديث هقل بن زياد ، عن الأوزاعي ، عن يحيى بن أبي كثير عن أبي سلمة بن عبد الرحمن ، عن ربيعة بن كعب الأسلمي أنه قال : كنت أبيت عند النبي صلى الله عليه وسلم فأتيته بوضوئه وحاجته ، فقال لي : \" سل \" . فقلت : يا رسول الله ، أسألك مرافقتك في الجنة . فقال : \" أو غير ذلك ؟ \" قلت : هو ذاك . قال : \" فأعني على نفسك بكثرة السجود \" .\nوقال الإمام أحمد : حدثنا يحيى بن إسحاق ، أخبرنا ابن لهيعة ، عن عبيد الله بن أبي جعفر ، عن عيسى بن طلحة ، عن عمرو بن مرة الجهني قال : جاء رجل إلى النبي صلى الله عليه وسلم فقال : يا رسول الله شهدت أن لا إله إلا الله وأنك رسول الله وصليت الخمس وأديت زكاة مالي وصمت شهر رمضان . فقال رسول الله صلى الله عليه وسلم : \" من مات على هذا كان مع النبيين والصديقين والشهداء يوم القيامة هكذا - ونصب أصبعيه - ما لم يعق والديه \" تفرد به أحمد .\nقال الإمام أحمد أيضا : حدثنا أبو سعيد مولى أبي هاشم ، حدثنا ابن لهيعة ، عن زبان بن فائد ، عن سهل بن معاذ بن أنس ، عن أبيه ، أن رسول الله صلى الله عليه وسلم قال : \" من قرأ ألف آية في سبيل الله كتب يوم القيامة مع النبيين والصديقين والشهداء والصالحين ، وحسن أولئك رفيقا ، إن شاء الله \" .\nوروى الترمذي من طريق سفيان الثوري ، عن أبي حمزة ، عن الحسن البصري ، عن أبي سعيد قال : قال رسول الله صلى الله عليه وسلم : \" التاجر الصدوق الأمين مع النبيين والصديقين والشهداء \" .\nثم قال : هذا حديث حسن لا نعرفه إلا من هذا الوجه ، وأبو حمزة اسمه عبد الله بن جابر شيخ بصري .\nوأعظم من هذا كله بشارة ما ثبت في الصحاح والمسانيد وغيرهما ، من طرق متواترة عن جماعة من الصحابة : أن رسول الله صلى الله عليه وسلم سئل عن الرجل يحب القوم ولما يلحق بهم ؟ فقال : \" المرء مع من أحب \" قال أنس : فما فرح المسلمون فرحهم بهذا الحديث .\nوفي رواية عن أنس أنه قال : إني أحب رسول الله صلى الله عليه وسلم ، وأحب أبا بكر وعمر ، رضي الله عنهما وأرجو أن يبعثني الله معهم وإن لم أعمل كعملهم .\nوقال الإمام مالك بن أنس ، عن صفوان بن سليم ، عن عطاء بن يسار ، عن أبي سعيد الخدري أن رسول الله صلى الله عليه وسلم قال : \" إن أهل الجنة ليتراءون أهل الغرف من فوقهم ، كما تتراءون الكوكب الدري الغابر من الأفق من المشرق أو المغرب لتفاضل ما بينهم \" . قالوا : يا رسول الله ، تلك منازل الأنبياء لا يبلغها غيرهم ؟ قال : \" بلى ، والذي نفسي بيده ، رجال آمنوا بالله وصدقوا المرسلين \" .\nأخرجاه في الصحيحين من حديث مالك ولفظه لمسلم .\nوقال الإمام أحمد بن حنبل : حدثنا فزارة ، أخبرني فليح ، عن هلال - يعني ابن علي - عن عطاء ، عن أبي هريرة ; أن رسول الله صلى الله عليه وسلم قال : \" إن أهل الجنة ليتراءون في الجنة كما تراءون - أو ترون - الكوكب الدري الغارب في الأفق والطالع في تفاضل الدرجات \" . قالوا : يا رسول الله ، أولئك النبيون ؟ قال : \" بلى ، والذي نفسي بيده ، وأقوام آمنوا بالله وصدقوا المرسلين \" .\nقال الحافظ الضياء المقدسي : هذا الحديث على شرط البخاري والله أعلم .\nوقال الحافظ أبو القاسم الطبراني في معجمه الكبير : حدثنا علي بن عبد العزيز ، حدثنا محمد بن عمار الموصلي ، حدثنا عفيف بن سالم ، عن أيوب بن عتبة عن عطاء ، عن ابن عمر قال : أتى رجل من الحبشة إلى رسول الله صلى الله عليه وسلم يسأله ، فقال له رسول الله صلى الله عليه وسلم : \" سل واستفهم \" . فقال : يا رسول الله ، فضلتم علينا بالصور والألوان والنبوة ، أفرأيت إن آمنت بما آمنت به ، وعملت مثل ما عملت به ، إني لكائن معك في الجنة ؟ قال رسول الله صلى الله عليه وسلم : \" نعم ، والذي نفسي بيده إنه ليضيء بياض الأسود في الجنة من مسيرة ألف عام \" قال : ثم قال رسول الله صلى الله عليه وسلم : \" من قال : لا إله إلا الله ، كان له بها عهد عند الله ، ومن قال : سبحان الله وبحمده ، كتب له بها مائة ألف حسنة وأربعة وعشرون ألف حسنة \" فقال رجل : كيف نهلك بعدها يا رسول الله ؟ فقال رسول الله صلى الله عليه وسلم : \" إن الرجل ليأتي يوم القيامة بالعمل لو وضع على جبل لأثقله ، فتقوم النعمة من نعم الله فتكاد أن تستنفد ذلك كله إلا أن يتطاول الله برحمته \" ونزلت هذه الآيات ( هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا ) إلى قوله : ( نعيما وملكا كبيرا ) [ الإنسان : 1 - 20 ] فقال الحبشي : وإن عيني لتريان ما ترى عيناك في الجنة ؟ فقال النبي صلى الله عليه وسلم : \" نعم \" . فاستبكى حتى فاضت نفسه ، قال ابن عمر : لقد رأيت رسول الله صلى الله عليه وسلم يدليه في حفرته بيديه .\nفيه غرابة ونكارة ، وسنده ضعيف .\n                                    ",
        "qortoby": "وَمَن يُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُوْلَٰٓئِكَ مَعَ ٱلَّذِينَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِم مِّنَ ٱلنَّبِيِّ‍ۧنَ وَٱلصِّدِّيقِينَ وَٱلشُّهَدَآءِ وَٱلصَّٰلِحِينَۚ وَحَسُنَ أُوْلَٰٓئِكَ رَفِيقٗا ٩٦\n                                    \n                                    \n                                    قوله تعالى : ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين وحسن أولئك رفيقا\nفيه مسائل : الأولى : قوله تعالى : ومن يطع الله والرسول لما ذكر تعالى الأمر الذي لو فعله المنافقون حين وعظوا به وأنابوا إليه لأنعم عليهم ، ذكر بعد ذلك ثواب من يفعله . وهذه الآية تفسير قوله تعالى : اهدنا الصراط المستقيم صراط الذين أنعمت عليهم وهي المراد في قوله عليه السلام عند موته اللهم الرفيق الأعلى . وفي البخاري عن عائشة قالت : سمعت رسول الله صلى الله عليه وسلم يقول : ما من نبي يمرض إلا خير بين الدنيا والآخرة كان في شكواه الذي مرض فيه أخذته بحة شديدة فسمعته يقول مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين فعلمت أنه خير . وقالت طائفة : إنما نزلت هذه الآية لما قال عبد الله بن زيد بن عبد ربه الأنصاري - الذي أري الأذان - : يا رسول الله ، إذا مت ومتنا كنت في عليين لا نراك ولا نجتمع بك ؛ وذكر حزنه على ذلك فنزلت هذه الآية . وذكر مكي عن عبد الله هذا وأنه لما مات النبي صلى الله عليه وسلم قال : اللهم أعمني حتى لا أرى شيئا بعده ؛ فعمي مكانه . وحكاه القشيري فقال : اللهم أعمني فلا أرى شيئا بعد حبيبي حتى ألقى حبيبي ؛ فعمي مكانه . وحكى الثعلبي : أنها نزلت في ثوبان مولى رسول الله صلى الله عليه وسلم ، وكان شديد الحب له قليل الصبر عنه ، فأتاه ذات يوم وقد تغير لونه ونحل جسمه ، يعرف في وجهه الحزن ؛ فقال له : يا ثوبان ما غير لونك فقال : يا رسول الله ما بي ضر ولا وجع ، غير أني إذا لم أرك اشتقت إليك واستوحشت وحشة شديدة حتى ألقاك ، ثم ذكرت الآخرة وأخاف ألا أراك هناك ؛ لأني عرفت أنك ترفع مع النبيين وأني إن دخلت الجنة كنت في منزلة هي أدنى من منزلتك ، وإن لم أدخل فذلك حين لا أراك أبدا ؛ فأنزل الله تعالى هذه الآية . ذكره الواحدي عن الكلبي . وأسند عن مسروق قال : قال أصحاب رسول الله صلى الله عليه وسلم : ما ينبغي لنا أن نفارقك في الدنيا ، فإنك إذا فارقتنا رفعت فوقنا ؛ فأنزل الله تعالى : ومن يطع الله والرسول فأولئك مع الذين أنعم الله عليهم من النبيين . وفي طاعة الله طاعة رسوله ولكنه ذكره تشريفا لقدره وتنويها باسمه صلى الله عليه وسلم وعلى آله .\nفأولئك مع الذين أنعم الله عليهم أي هم معهم في دار واحدة ونعيم واحد يستمتعون برؤيتهم والحضور معهم ، لا أنهم يساوونهم في الدرجة ؛ فإنهم يتفاوتون لكنهم يتزاورون للاتباع في الدنيا والاقتداء . وكل من فيها قد رزق الرضا بحاله ، وقد ذهب عنه اعتقاد أنه مفضول . قال الله تعالى : ونزعنا ما في صدورهم من غل . والصديق فعيل ، المبالغ في الصدق أو في التصديق ، والصديق هو الذي يحقق بفعله ما يقول بلسانه . وقيل : هم فضلاء أتباع الأنبياء الذين يسبقونهم إلى التصديق كأبي بكر الصديق . وقد تقدم في البقرة اشتقاق الصديق ومعنى الشهيد . والمراد هنا بالشهداء عمر وعثمان وعلي ، والصالحين سائر الصحابة رضي الله عنهم أجمعين . وقيل : والشهداء القتلى في سبيل الله . والصالحين صالحي أمة محمد رسول الله صلى الله عليه وسلم .\nقلت : واللفظ يعم كل صالح وشهيد ، والله أعلم . والرفق لين الجانب . وسمي الصاحب رفيقا لارتفاقك بصحبته ؛ ومنه الرفقة لارتفاق بعضهم ببعض . ويجوز \" وحسن أولئك رفقاء \" . قال الأخفش : رفيقا منصوب على الحال وهو بمعنى رفقاء ؛ وقال : انتصب على التمييز فوحد لذلك ؛ فكأن المعنى وحسن كل واحد منهم رفيقا . كما قال تعالى : ثم نخرجكم طفلا أي نخرج كل واحد منكم طفلا . وقال تعالى : ينظرون من طرف خفي وينظر معنى هذه الآية قوله صلى الله عليه وسلم : خير الرفقاء أربعة ولم يذكر الله تعالى هنا إلا أربعة فتأمله .\nالثانية : في هذه الآية دليل على خلافة أبي بكر رضي الله عنه ؛ وذلك أن الله تعالى لما ذكر مراتب أوليائه في كتابه بدأ بالأعلى منهم وهم النبيون ، ثم ثنى بالصديقين ولم يجعل بينهما واسطة . وأجمع المسلمون على تسمية أبي بكر الصديق رضي الله عنه صديقا ، كما أجمعوا على تسمية محمد عليه السلام رسولا ، وإذا ثبت هذا وصح أنه الصديق وأنه ثاني رسول الله صلى الله عليه وسلم لم يجز أن يتقدم بعده أحد . والله أعلم .\n                                    ",
        "saadi": "وَمَن يُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُوْلَٰٓئِكَ مَعَ ٱلَّذِينَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِم مِّنَ ٱلنَّبِيِّ‍ۧنَ وَٱلصِّدِّيقِينَ وَٱلشُّهَدَآءِ وَٱلصَّٰلِحِينَۚ وَحَسُنَ أُوْلَٰٓئِكَ رَفِيقٗا ٩٦\n                                        \n                                        \n                                        \n                                        أي: كل مَنْ أطاع الله ورسوله على حسب حاله وقدر الواجب عليه من ذكر وأنثى وصغير وكبير، { فَأُولَئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ } أي: النعمة العظيمة التي تقتضي الكمال والفلاح والسعادة { مِنَ النَّبِيِّينَ } الذين فضلهم الله بوحيه، واختصهم بتفضيلهم بإرسالهم إلى الخلق، ودعوتهم إلى الله تعالى { وَالصِّدِّيقِينَ } وهم: الذين كمل تصديقهم بما جاءت به الرسل، فعلموا الحق وصدقوه بيقينهم، وبالقيام به قولا وعملا وحالا ودعوة إلى الله، { وَالشُّهَدَاءِ } الذين قاتلوا في سبيل الله لإعلاء كلمة الله فقتلوا، { وَالصَّالِحِينَ } الذين صلح ظاهرهم وباطنهم فصلحت أعمالهم، فكل من أطاع الله تعالى كان مع هؤلاء في صحبتهم { وَحَسُنَ أُولَئِكَ رَفِيقًا } بالاجتماع بهم في جنات النعيم والأُنْس بقربهم في جوار رب العالمين.\n                                    "
      },
      "originalText": "وَمَن يُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُوْلَٰٓئِكَ مَعَ ٱلَّذِينَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِم مِّنَ ٱلنَّبِيِّ‍ۧنَ وَٱلصِّدِّيقِينَ وَٱلشُّهَدَآءِ وَٱلصَّٰلِحِينَۚ وَحَسُنَ أُوْلَٰٓئِكَ رَفِيقٗا ٩٦"
    },
    {
      "number": 563,
      "text": "ذَٰلِكَ الْفَضْلُ مِنَ اللَّهِ ۚ وَكَفَىٰ بِاللَّهِ عَلِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 70,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 70,
      "hizbQuarter": 35,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ذَٰلِكَ ٱلۡفَضۡلُ مِنَ ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ عَلِيمٗا ٠٧\n                                    \n                                    \n                                    ولهذا قال تعالى : ( ذلك الفضل من الله ) أي : من عند الله برحمته ، هو الذي أهلهم لذلك ، لا بأعمالهم . ( وكفى بالله عليما ) أي : هو عليم بمن يستحق الهداية والتوفيق .\n                                    ",
        "qortoby": "ذَٰلِكَ ٱلۡفَضۡلُ مِنَ ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ عَلِيمٗا ٠٧\n                                    \n                                    \n                                    الثالثة : قوله تعالى : ذلك الفضل من الله أخبر تعالى أنهم لم ينالوا الدرجة بطاعتهم بل نالوها بفضل الله تعالى وكرمه . خلافا لما قالت المعتزلة : إنما ينال العبد ذلك بفعله . فلما امتن الله سبحانه على أوليائه بما آتاهم من فضله ، وكان لا يجوز لأحد أن يثني على نفسه بما لم يفعله دل ذلك على بطلان قولهم . والله أعلم .\n                                    ",
        "saadi": "ذَٰلِكَ ٱلۡفَضۡلُ مِنَ ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ عَلِيمٗا ٠٧\n                                        \n                                        \n                                        \n                                        { ذَلِكَ الْفَضْلُ } الذي نالوه { مِنَ اللَّهِ } فهو الذي وفقهم لذلك، وأعانهم عليه، وأعطاهم من الثواب ما لا تبلغه أعمالهم. { وَكَفَى بِاللَّهِ عَلِيمًا } يعلم أحوال عباده ومن يستحق منهم الثواب الجزيل، بما قام به من الأعمال الصالحة التي تواطأ عليها القلب والجوارح.\n                                    "
      },
      "originalText": "ذَٰلِكَ ٱلۡفَضۡلُ مِنَ ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ عَلِيمٗا ٠٧"
    },
    {
      "number": 564,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا خُذُوا حِذْرَكُمْ فَانْفِرُوا ثُبَاتٍ أَوِ انْفِرُوا جَمِيعًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 71,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 71,
      "hizbQuarter": 35,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ خُذُواْ حِذۡرَكُمۡ فَٱنفِرُواْ ثُبَاتٍ أَوِ ٱنفِرُواْ جَمِيعٗا ١٧\n                                    \n                                    \n                                    يأمر الله عباده المؤمنين بأخذ الحذر من عدوهم ، وهذا يستلزم التأهب لهم بإعداد الأسلحة والعدد وتكثير العدد بالنفير في سبيله .\n( ثبات ) أي : جماعة بعد جماعة ، وفرقة بعد فرقة ، وسرية بعد سرية ، والثبات : جمع ثبة ، وقد تجمع الثبة على ثبين .\nقال علي بن أبي طلحة ، عن ابن عباس قوله : ( فانفروا ثبات ) أي : عصبا يعني : سرايا متفرقين ( أو انفروا جميعا ) يعني : كلكم .\nوكذا روي عن مجاهد ، وعكرمة ، والسدي ، وقتادة ، والضحاك ، وعطاء الخراساني ، ومقاتل بن حيان ، وخصيف الجزري .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ خُذُواْ حِذۡرَكُمۡ فَٱنفِرُواْ ثُبَاتٍ أَوِ ٱنفِرُواْ جَمِيعٗا ١٧\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا خذوا حذركم فانفروا ثبات أو انفروا جميعا\nفيه خمس مسائل :\nالأولى : قوله تعالى : يا أيها الذين آمنوا خذوا حذركم هذا خطاب للمؤمنين المخلصين من أمة محمد صلى الله عليه وسلم ، وأمر لهم بجهاد الكفار والخروج في سبيل الله وحماية الشرع . ووجه النظم والاتصال بما قبل أنه لما ذكر طاعة الله وطاعة رسوله ، أمر أهل الطاعة بالقيام بإحياء دينه وإعلاء دعوته ، وأمرهم ألا يقتحموا على عدوهم على جهالة حتى يتحسسوا إلى ما عندهم ، ويعلموا كيف يردون عليهم ، فذلك أثبت لهم فقال : خذوا حذركم فعلمهم مباشرة الحروب . ولا ينافي هذا التوكل بل هو مقام عين التوكل كما تقدم في \" آل عمران \" ويأتي . والحذر والحذر لغتان كالمثل والمثل . قال الفراء : أكثر الكلام الحذر ، والحذر مسموع أيضا ؛ يقال : خذ حذرك ، أي احذر . وقيل : خذوا السلاح حذرا ؛ لأنه به الحذر والحذر لا يدفع القدر . وهي :\nالثانية : خلافا للقدرية في قولهم : إن الحذر يدفع ويمنع من مكائد الأعداء ، ولو لم يكن كذلك ما كان لأمرهم بالحذر معنى . فيقال لهم : ليس في الآية دليل على أن الحذر يمنع من القدر شيئا ؛ ولكنا تعبدنا بألا نلقي بأيدينا إلى التهلكة ؛ ومنه الحديث اعقلها وتوكل . وإن كان القدر جاريا على ما قضي ، ويفعل الله ما يشاء ، فالمراد منه طمأنينة النفس ، لا أن ذلك ينفع من القدر وكذلك أخذ الحذر . والدليل على ذلك أن الله تعالى أثنى على أصحاب نبيه صلى الله عليه وسلم بقوله : قل لن يصيبنا إلا ما كتب الله لنا فلو كان يصيبهم غير ما قضى عليهم لم يكن لهذا الكلام معنى .\nالثالثة : قوله تعالى : فانفروا ثبات يقال : نفر ينفر ( بكسر الفاء ) نفيرا . ونفرت الدابة تنفر ( بضم الفاء ) نفورا ؛ المعنى : انهضوا لقتال العدو . واستنفر الإمام الناس دعاهم إلى النفر ، أي للخروج إلى قتال العدو . والنفير اسم للقوم الذين ينفرون ، وأصله من النفار والنفور وهو الفزع ؛ ومنه قوله تعالى : ولوا على أدبارهم نفورا أي نافرين . ومنه نفر الجلد أي ورم . وتخلل رجل بالقصب فنفر فمه أي ورم . قال أبو عبيد : إنما هو من نفار الشيء من الشيء وهو تجافيه عنه وتباعده منه . قال ابن فارس : النفر عدة رجال من ثلاثة إلى عشرة . والنفير النفر أيضا ، وكذلك النفر والنفرة ، حكاها الفراء بالهاء . ويوم النفر : يوم ينفر الناس عن منى .\n( ثبات ) معناه جماعات متفرقات . ويقال : ثبين يجمع جمع السلامة في التأنيث والتذكير . قال عمرو بن كلثوم :\nفأما يوم خشيتنا عليهم فتصبح خيلنا عصبا ثبينا\nفقوله تعالى : ( ثبات ) كناية عن السرايا ، الواحدة ثبة وهي العصابة من الناس . وكانت في الأصل الثبية . وقد ثبيت الجيش جعلتهم ثبة ثبة . والثبة : وسط الحوض الذي يثوب إليه الماء أي يرجع قال النحاس : وربما توهم الضعيف في العربية أنهما واحد ، وأن أحدهما من الآخر ؛ وبينهما فرق ، فثبة الحوض يقال في تصغيرها : ثويبة ؛ لأنها من ثاب يثوب . ويقال في ثبة الجماعة : ثبية . قال غيره : فثبة الحوض محذوفة الواو وهو عين الفعل ، وثبة الجماعة معتل اللام من ثبا يثبو مثل خلا يخلو . ويجوز أن يكون الثبة بمعنى الجماعة من ثبة الحوض ؛ لأن الماء إذا ثاب اجتمع ؛ فعلى هذا تصغر به الجماعة ثويبة فتدخل إحدى الياءين في الأخرى . وقد قيل : إن ثبة الجماعة إنما اشتقت من ثبيت على الرجل إذا أثنيت عليه في حياته وجمعت محاسن ذكره فيعود إلى الاجتماع .\nالرابعة : قوله تعالى : أو انفروا جميعا معناه الجيش الكثيف مع الرسول عليه السلام ؛ قاله ابن عباس وغيره . ولا تخرج السرايا إلا بإذن الإمام ليكون متجسسا لهم ، عضدا من ورائهم ، وربما احتاجوا إلى درئه . وسيأتي حكم السرايا وغنائمهم وأحكام الجيوش ووجوب النفير في \" الأنفال \" و \" براءة إن شاء الله تعالى .\nالخامسة : ذكر ابن خويز منداد : وقيل إن هذه الآية منسوخة بقوله تعالى : انفروا خفافا وثقالا وبقوله : إلا تنفروا يعذبكم ؛ ولأن يكون انفروا خفافا وثقالا منسوخا بقوله : فانفروا ثبات أو انفروا جميعا وبقوله : وما كان المؤمنون لينفروا كافة أولى ؛ لأن فرض الجهاد تقرر على الكفاية ، فمتى سد الثغور بعض المسلمين أسقط الفرض عن الباقين . والصحيح أن الآيتين جميعا محكمتان ، إحداهما في الوقت الذي يحتاج فيه إلى تعين الجميع ، والأخرى عند الاكتفاء بطائفة دون غيرها .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ خُذُواْ حِذۡرَكُمۡ فَٱنفِرُواْ ثُبَاتٍ أَوِ ٱنفِرُواْ جَمِيعٗا ١٧\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده المؤمنين بأخذ حذرهم من أعدائهم الكافرين. وهذا يشمل الأخذ بجميع الأسباب، التي بها يستعان على قتالهم ويستدفع مكرهم وقوتهم، من استعمال الحصون والخنادق، وتعلم الرمي والركوب، وتعلم الصناعات التي تعين على ذلك، وما به يعرف مداخلهم، ومخارجهم، ومكرهم، والنفير في سبيل الله. ولهذا قال: { فَانْفِرُوا ثُبَاتٍ } أي: متفرقين بأن تنفر سرية أو جيش، ويقيم غيرهم { أَوِ انْفِرُوا جَمِيعًا } وكل هذا تبع للمصلحة والنكاية، والراحة للمسلمين في دينهم، وهذه الآية نظير قوله تعالى: { وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ }\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ خُذُواْ حِذۡرَكُمۡ فَٱنفِرُواْ ثُبَاتٍ أَوِ ٱنفِرُواْ جَمِيعٗا ١٧"
    },
    {
      "number": 565,
      "text": "وَإِنَّ مِنْكُمْ لَمَنْ لَيُبَطِّئَنَّ فَإِنْ أَصَابَتْكُمْ مُصِيبَةٌ قَالَ قَدْ أَنْعَمَ اللَّهُ عَلَيَّ إِذْ لَمْ أَكُنْ مَعَهُمْ شَهِيدًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 72,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 71,
      "hizbQuarter": 35,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنَّ مِنكُمۡ لَمَن لَّيُبَطِّئَنَّ فَإِنۡ أَصَٰبَتۡكُم مُّصِيبَةٞ قَالَ قَدۡ أَنۡعَمَ ٱللَّهُ عَلَيَّ إِذۡ لَمۡ أَكُن مَّعَهُمۡ شَهِيدٗا ٢٧\n                                    \n                                    \n                                    وقوله : ( وإن منكم لمن ليبطئن ) قال مجاهد وغير واحد : نزلت في المنافقين ، وقال مقاتل بن حيان : ( ليبطئن ) أي : ليتخلفن عن الجهاد .\nويحتمل أن يكون المراد أنه يتباطأ هو في نفسه ، ويبطئ غيره عن الجهاد ، كما كان عبد الله بن أبي ابن - قبحه الله - يفعل ، يتأخر عن الجهاد ، ويثبط الناس عن الخروج فيه . وهذا قول ابن جريج وابن جرير ; ولهذا قال تعالى إخبارا عن المنافق أنه يقول إذا تأخر عن الجهاد : ( فإن أصابتكم مصيبة ) أي : قتل وشهادة وغلب العدو لكم ، لما لله في ذلك من الحكمة ( قال قد أنعم الله علي إذ لم أكن معهم شهيدا ) أي : إذ لم أحضر معهم وقعة القتال ، يعد ذلك من نعم الله عليه ، ولم يدر ما فاته من الأجر في الصبر أو الشهادة إن قتل .\n                                    ",
        "qortoby": "وَإِنَّ مِنكُمۡ لَمَن لَّيُبَطِّئَنَّ فَإِنۡ أَصَٰبَتۡكُم مُّصِيبَةٞ قَالَ قَدۡ أَنۡعَمَ ٱللَّهُ عَلَيَّ إِذۡ لَمۡ أَكُن مَّعَهُمۡ شَهِيدٗا ٢٧\n                                    \n                                    \n                                    قوله تعالى : وإن منكم لمن ليبطئن فإن أصابتكم مصيبة قال قد أنعم الله علي إذ لم أكن معهم شهيدا\nقوله تعالى : وإن منكم لمن ليبطئن يعني المنافقين . والتبطئة والإبطاء التأخر ، تقول : ما أبطأك عنا ؛ فهو لازم . ويجوز بطأت فلانا عن كذا أي أخرته ؛ فهو متعد . والمعنيان مراد في الآية ؛ فكانوا يقعدون عن الخروج ويقعدون غيرهم . والمعنى أن من دخلائكم وجنسكم وممن أظهر إيمانه لكم . فالمنافقون في ظاهر الحال من أعداد المسلمين بإجراء أحكام المسلمين عليهم . واللام في قوله ( لمن ) لام توكيد ، والثانية لام قسم ، ومن في موضع نصب ، وصلتها ليبطئن لأن فيه معنى اليمين ، والخبر منكم . وقرأ مجاهد والنخعي والكلبي \" وإن منكم لمن ليبطئن \" بالتخفيف ، والمعنى واحد . وقيل : المراد بقوله وإن منكم لمن ليبطئن بعض المؤمنين ؛ لأن الله خاطبهم بقوله : وإن منكم وقد فرق الله تعالى بين المؤمنين والمنافقين بقوله وما هم منكم وهذا يأباه مساق الكلام وظاهره . وإنما جمع بينهم في الخطاب من جهة الجنس والنسب كما بينا لا من جهة الإيمان . هذا قول الجمهور وهو الصحيح إن شاء الله تعالى ، والله أعلم . يدل عليه قوله :فإن أصابتكم مصيبة أي قتل وهزيمة قال قد أنعم الله علي إذ لم أكن معهم شهيدا يعني بالقعود ، وهذا لا يصدر إلا من منافق ؛ لا سيما في ذلك الزمان الكريم ، بعيد أن يقوله مؤمن . وينظر إلى هذه الآية ما رواه الأئمة عن أبي هريرة عن النبي صلى الله عليه وسلم إخبارا عن المنافقين إن أثقل صلاة عليهم صلاة العشاء وصلاة الفجر ولو يعلمون ما فيهما لأتوهما ولو حبوا الحديث . في رواية ولو علم أحدهم أنه يجد عظما سمينا لشهدها يعني صلاة العشاء . يقول : لو لاح شيء من الدنيا يأخذونه وكانوا على يقين منه لبادروا إليه .\n                                    ",
        "saadi": "وَإِنَّ مِنكُمۡ لَمَن لَّيُبَطِّئَنَّ فَإِنۡ أَصَٰبَتۡكُم مُّصِيبَةٞ قَالَ قَدۡ أَنۡعَمَ ٱللَّهُ عَلَيَّ إِذۡ لَمۡ أَكُن مَّعَهُمۡ شَهِيدٗا ٢٧\n                                        \n                                        \n                                        \n                                        ثم أخبر عن ضعفاء الإيمان المتكاسلين عن الجهاد فقال: { وَإِنَّ مِنْكُمْ } أي: أيها المؤمنون { لَمَنْ لَيُبَطِّئَنَّ } أي: يتثاقل عن الجهاد في سبيل الله ضعفا وخورا وجبنا، هذا الصحيح. وقيل معناه: ليبطئن غيرَه أي: يزهده عن القتال، وهؤلاء هم المنافقون، ولكن الأول أَولى لوجهين: أحدهما: قوله { مِنْكُمْ } والخطاب للمؤمنين. والثاني: قوله في آخر الآية: { كَأَنْ لَمْ تَكُنْ بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ } فإن الكفار من المشركين والمنافقين قد قطع الله بينهم وبين المؤمنين المودة. وأيضا فإن هذا هو الواقع، فإن المؤمنين على قسمين: صادقون في إيمانهم أوجب لهم ذلك كمال التصديق والجهاد. وضعفاء دخلوا في الإسلام فصار معهم إيمان ضعيف لا يقوى على الجهاد. كما قال تعالى: { قَالَتِ الْأَعْرَابُ آمَنَّا قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا } إلى آخر الآيات. ثم ذكر غايات هؤلاء المتثاقلين ونهاية مقاصدهم، وأن معظم قصدهم الدنيا وحطامها فقال: { فَإِنْ أَصَابَتْكُمْ مُصِيبَةٌ } أي: هزيمة وقتل، وظفر الأعداء عليكم في بعض الأحوال لما لله في ذلك من الحكم. { قَالَ } ذلك المتخلف { قَدْ أَنْعَمَ اللَّهُ عَلَيَّ إِذْ لَمْ أَكُنْ مَعَهُمْ شَهِيدًا } رأى من ضعف عقله وإيمانه أن التقاعد عن الجهاد الذي فيه تلك المصيبة نعمة. ولم يدر أن النعمة الحقيقية هي التوفيق لهذه الطاعة الكبيرة، التي بها يقوى الإيمان، ويسلم بها العبد من العقوبة والخسران، ويحصل له فيها عظيم الثواب ورضا الكريم الوهاب. وأما القعود فإنه وإن استراح قليلاً، فإنه يعقبه تعب طويل وآلام عظيمة، ويفوته ما يحصل للمجاهدين.\n                                    "
      },
      "originalText": "وَإِنَّ مِنكُمۡ لَمَن لَّيُبَطِّئَنَّ فَإِنۡ أَصَٰبَتۡكُم مُّصِيبَةٞ قَالَ قَدۡ أَنۡعَمَ ٱللَّهُ عَلَيَّ إِذۡ لَمۡ أَكُن مَّعَهُمۡ شَهِيدٗا ٢٧"
    },
    {
      "number": 566,
      "text": "وَلَئِنْ أَصَابَكُمْ فَضْلٌ مِنَ اللَّهِ لَيَقُولَنَّ كَأَنْ لَمْ تَكُنْ بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ يَا لَيْتَنِي كُنْتُ مَعَهُمْ فَأَفُوزَ فَوْزًا عَظِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 73,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 71,
      "hizbQuarter": 35,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَئِنۡ أَصَٰبَكُمۡ فَضۡلٞ مِّنَ ٱللَّهِ لَيَقُولَنَّ كَأَن لَّمۡ تَكُنۢ بَيۡنَكُمۡ وَبَيۡنَهُۥ مَوَدَّةٞ يَٰلَيۡتَنِي كُنتُ مَعَهُمۡ فَأَفُوزَ فَوۡزًا عَظِيمٗا ٣٧\n                                    \n                                    \n                                    ( ولئن أصابكم فضل من الله ) أي : نصر وظفر وغنيمة ( ليقولن كأن لم تكن بينكم وبينه مودة ) أي : كأنه ليس من أهل دينكم ( يا ليتني كنت معهم فأفوز فوزا عظيما ) أي : بأن يضرب لي بسهم معهم فأحصل عليه . وهو أكبر قصده وغاية مراده .\n                                    ",
        "qortoby": "وَلَئِنۡ أَصَٰبَكُمۡ فَضۡلٞ مِّنَ ٱللَّهِ لَيَقُولَنَّ كَأَن لَّمۡ تَكُنۢ بَيۡنَكُمۡ وَبَيۡنَهُۥ مَوَدَّةٞ يَٰلَيۡتَنِي كُنتُ مَعَهُمۡ فَأَفُوزَ فَوۡزًا عَظِيمٗا ٣٧\n                                    \n                                    \n                                    قوله : ولئن أصابكم فضل من الله أي غنيمة وفتح ليقولن هذا المنافق قول نادم حاسد يا ليتني كنت معهم فأفوز فوزا عظيما كأن لم يكن بينكم وبينه مودة فالكلام فيه تقديم وتأخير . وقيل : المعنى ليقولن كأن لم يكن بينكم وبينه مودة أي كأن لم يعاقدكم على الجهاد . وقيل : هو في موضع نصب على الحال . وقرأ الحسن \" ليقولن \" بضم اللام على معنى \" من \" ؛ لأن معنى قوله لمن ليبطئن ليس يعني رجلا بعينه . ومن فتح اللام أعاد فوحد الضمير على لفظ من . وقرأ ابن كثير وحفص عن عاصم كأن لم تكن بالتاء على لفظ المودة . ومن قرأ بالياء جعل مودة بمعنى الود . وقول المنافق يا ليتني كنت معهم على وجه الحسد أو الأسف على فوت الغنيمة مع الشك في الجزاء من الله . ( فأفوز ) جواب التمني ولذلك نصب . وقرأ الحسن \" فأفوز \" بالرفع على أنه تمنى الفوز ، فكأنه قال : يا ليتني أفوز فوزا عظيما . والنصب على الجواب ؛ والمعنى إن أكن معهم أفز . والنصب فيه بإضمار \" أن \" لأنه محمول على تأويل المصدر ؛ التقدير يا ليتني كان لي حضور ففوز .\n                                    ",
        "saadi": "وَلَئِنۡ أَصَٰبَكُمۡ فَضۡلٞ مِّنَ ٱللَّهِ لَيَقُولَنَّ كَأَن لَّمۡ تَكُنۢ بَيۡنَكُمۡ وَبَيۡنَهُۥ مَوَدَّةٞ يَٰلَيۡتَنِي كُنتُ مَعَهُمۡ فَأَفُوزَ فَوۡزًا عَظِيمٗا ٣٧\n                                        \n                                        \n                                        \n                                        { وَلَئِنْ أَصَابَكُمْ فَضْلٌ مِنَ اللَّهِ } أي: نصر وغنيمة { لَيَقُولَنَّ كَأَنْ لَمْ تَكُنْ بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ يَا لَيْتَنِي كُنْتُ مَعَهُمْ فَأَفُوزَ فَوْزًا عَظِيمًا } أي: يتمنى أنه حاضر لينال من المغانم، ليس له رغبة ولا قصد في غير ذلك، كأنه ليس منكم يا معشر المؤمنين ولا بينكم وبينه المودة الإيمانية التي من مقتضاها أن المؤمنين مشتركون في جميع مصالحهم ودفع مضارهم، يفرحون بحصولها ولو على يد غيرهم من إخوانهم المؤمنين ويألمون بفقدها، ويسعون جميعا في كل أمر يصلحون به دينهم ودنياهم، فهذا الذي يتمنى الدنيا فقط، ليست معه الروح الإيمانية المذكورة.\n                                    "
      },
      "originalText": "وَلَئِنۡ أَصَٰبَكُمۡ فَضۡلٞ مِّنَ ٱللَّهِ لَيَقُولَنَّ كَأَن لَّمۡ تَكُنۢ بَيۡنَكُمۡ وَبَيۡنَهُۥ مَوَدَّةٞ يَٰلَيۡتَنِي كُنتُ مَعَهُمۡ فَأَفُوزَ فَوۡزًا عَظِيمٗا ٣٧"
    },
    {
      "number": 567,
      "text": "۞ فَلْيُقَاتِلْ فِي سَبِيلِ اللَّهِ الَّذِينَ يَشْرُونَ الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ ۚ وَمَنْ يُقَاتِلْ فِي سَبِيلِ اللَّهِ فَيُقْتَلْ أَوْ يَغْلِبْ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 74,
      "juz": 5,
      "manzil": 1,
      "page": 89,
      "ruku": 71,
      "hizbQuarter": 36,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَلۡيُقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ ٱلَّذِينَ يَشۡرُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا بِٱلۡأٓخِرَةِۚ وَمَن يُقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ فَيُقۡتَلۡ أَوۡ يَغۡلِبۡ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٤٧\n                                    \n                                    \n                                    ثم قال تعالى : ( فليقاتل ) أي : المؤمن النافر ( في سبيل الله الذين يشرون الحياة الدنيا بالآخرة ) أي : يبيعون دينهم بعرض قليل من الدنيا ، وما ذلك إلا لكفرهم وعدم إيمانهم .\nثم قال تعالى : ( ومن يقاتل في سبيل الله فيقتل أو يغلب فسوف نؤتيه أجرا عظيما ) أي : كل من قاتل في سبيل الله - سواء قتل أو غلب وسلب - فله عند الله مثوبة عظيمة وأجر جزيل ، كما ثبت في الصحيحين وتكفل الله للمجاهد في سبيله ، إن توفاه أن يدخله الجنة ، أو يرجعه إلى مسكنه الذي خرج منه نائلا ما نال من أجر أو غنيمة .\n                                    ",
        "qortoby": "فَلۡيُقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ ٱلَّذِينَ يَشۡرُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا بِٱلۡأٓخِرَةِۚ وَمَن يُقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ فَيُقۡتَلۡ أَوۡ يَغۡلِبۡ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٤٧\n                                    \n                                    \n                                    قوله تعالى : فليقاتل في سبيل الله الذين يشرون الحياة الدنيا بالآخرة ومن يقاتل في سبيل الله فيقتل أو يغلب فسوف نؤتيه أجرا عظيما فيه ثلاث مسائل :\nالأولى : قوله تعالى : فليقاتل في سبيل الله الخطاب للمؤمنين ؛ أي فليقاتل في سبيل الله الكفار ( الذين يشرون ) أي يبيعون ، أي يبذلون أنفسهم وأموالهم لله عز وجل بالآخرة أي بثواب الآخرة .\nالثانية : قوله تعالى : ومن يقاتل في سبيل الله شرط . فيقتل أو يغلب عطف عليه ، والمجازاة فسوف نؤتيه أجرا عظيما . ومعنى فيقتل فيستشهد . أو يغلب يظفر فيغنم . وقرأت طائفة \" ومن يقاتل \" \" فليقاتل \" بسكون لام الأمر . وقرأت فرقة \" فليقاتل \" بكسر لام الأمر . فذكر تعالى غايتي حالة المقاتل واكتفى بالغايتين عما بينهما ؛ ذكره ابن عطية .\nالثالثة : ظاهر الآية يقتضي التسوية بين من قتل شهيدا أو انقلب غانما . وفي صحيح مسلم عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : تضمن الله لمن خرج في سبيله لا يخرجه إلا جهاد في سبيلي وإيمان بي وتصديق برسلي فهو علي ضامن أن أدخله الجنة أو أرجعه إلى مسكنه الذي خرج منه نائلا ما نال من أجر أو غنيمة وذكر الحديث . وفيه عن عبد الله بن عمرو أن رسول الله صلى الله عليه وسلم قال : ما من غازية تغزو في سبيل الله فيصيبون الغنيمة إلا تعجلوا ثلثي أجرهم من الآخرة ويبقى لهم الثلث وإن لم يصيبوا غنيمة تم لهم أجرهم . فقوله : نائلا ما نال من أجر أو غنيمة يقتضي أن لمن يستشهد من المجاهدين أحد الأمرين ؛ إما الأجر إن لم يغنم ، وإما الغنيمة ولا أجر ، بخلاف حديث عبد الله بن عمرو ، ولما كان هذا قال قوم : حديث عبد الله بن عمرو ليس بشيء ؛ لأن في إسناده حميد بن هانئ وليس بمشهور ، ورجحوا الحديث الأول عليه لشهرته . وقال آخرون : ليس بينهما تعارض ولا اختلاف . و \" أو \" في حديث أبي هريرة بمعنى الواو ، كما يقول الكوفيون وقد دلت عليه رواية أبي داود فإنه قال فيه : ( من أجر وغنيمة ) بالواو الجامعة . وقد رواه بعض رواة مسلم بالواو الجامعة أيضا . وحميد بن هانئ مصري سمع أبا عبد الرحمن الحبلي وعمرو بن مالك ، وروى عنه حيوة بن شريح وابن وهب ؛ فالحديث الأول محمول على مجرد النية والإخلاص في الجهاد ؛ فذلك الذي ضمن الله له إما الشهادة ، وإما رده إلى أهله مأجورا غانما ، ويحمل الثاني على ما إذا نوى الجهاد ولكن مع نيل المغنم ، فلما انقسمت نيته انحط أجره ؛ فقد دلت السنة على أن للغانم أجرا كما دل عليه الكتاب فلا تعارض . ثم قيل : إن نقص أجر الغانم على من يغنم إنما هو بما فتح الله عليه من الدنيا فتمتع به وأزال عن نفسه شظف عيشه ؛ ومن أخفق فلم يصب شيئا بقي على شظف عيشه والصبر على حالته ، فبقي أجره موفرا بخلاف الأول . ومثله قوله في الحديث الآخر : فمنا من مات لم يأكل من أجره شيئا - منهم مصعب بن عمير - ومنا من أينعت له ثمرته فهو يهدبها .\n                                    ",
        "saadi": "فَلۡيُقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ ٱلَّذِينَ يَشۡرُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا بِٱلۡأٓخِرَةِۚ وَمَن يُقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ فَيُقۡتَلۡ أَوۡ يَغۡلِبۡ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٤٧\n                                        \n                                        \n                                        \n                                        ومن لطف الله بعباده أن لا يقطع عنهم رحمته، ولا يغلق عنهم أبوابها. بل من حصل منه غير ما يليق أمره ودعاه إلى جبر نقصه وتكميل نفسه، فلهذا أمر هؤلاء بالإخلاص والخروج في سبيله فقال: { فَلْيُقَاتِلْ فِي سَبِيلِ اللَّهِ الَّذِينَ يَشْرُونَ الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ } هذا أحد الأقوال في هذه الآية وهو أصحها. وقيل: إن معناه: فليقاتل في سبيل الله المؤمنون الكاملو الإيمان، الصادقون في إيمانهم { الَّذِينَ يَشْرُونَ الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ } أي: يبيعون الدنيا رغبة عنها بالآخرة رغبة فيها. فإن هؤلاء الذين يوجه إليهم الخطاب لأنهم الذين قد أعدوا أنفسهم ووطَّنوها على جهاد الأعداء، لما معهم من الإيمان التام المقتضي لذلك. وأما أولئك المتثاقلون، فلا يعبأ بهم خرجوا أو قعدوا، فيكون هذا نظير قوله تعالى: { قُلْ آمِنُوا بِهِ أَوْ لَا تُؤْمِنُوا إِنَّ الَّذِينَ أُوتُوا الْعِلْمَ مِنْ قَبْلِهِ إِذَا يُتْلَى عَلَيْهِمْ يَخِرُّونَ لِلْأَذْقَانِ سُجَّدًا } إلى آخر الآيات. وقوله: { فَإِنْ يَكْفُرْ بِهَا هَؤُلَاءِ فَقَدْ وَكَّلْنَا بِهَا قَوْمًا لَيْسُوا بِهَا بِكَافِرِينَ } وقيل: إن معنى الآية: فليقاتل المقاتل والمجاهد للكفار الذين يشرون الحياة الدنيا بالآخرة، فيكون على هذا الوجه \"الذين\" في محل نصب على المفعولية. { وَمَنْ يُقَاتِلْ فِي سَبِيلِ اللَّهِ } بأن يكون جهادا قد أمر الله به ورسوله، ويكون العبد مخلصا لله فيه قاصدا وجه الله. { فَيُقْتَلْ أَوْ يَغْلِبْ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا } زيادة في إيمانه ودينه، وغنيمة، وثناء حسنا، وثواب المجاهدين في سبيل الله الذين أعد الله لهم في الجنة ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.\n                                    "
      },
      "originalText": "۞ فَلۡيُقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ ٱلَّذِينَ يَشۡرُونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا بِٱلۡأٓخِرَةِۚ وَمَن يُقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ فَيُقۡتَلۡ أَوۡ يَغۡلِبۡ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٤٧"
    }
  ]
}