{
  "number": 90,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 568,
      "text": "وَمَا لَكُمْ لَا تُقَاتِلُونَ فِي سَبِيلِ اللَّهِ وَالْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ الَّذِينَ يَقُولُونَ رَبَّنَا أَخْرِجْنَا مِنْ هَٰذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ وَلِيًّا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ نَصِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 75,
      "juz": 5,
      "manzil": 1,
      "page": 90,
      "ruku": 71,
      "hizbQuarter": 36,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا لَكُمۡ لَا تُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلۡوِلۡدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخۡرِجۡنَا مِنۡ هَٰذِهِ ٱلۡقَرۡيَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِيّٗا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِيرًا ٥٧\n                                    \n                                    \n                                    يحرض تعالى عباده المؤمنين على الجهاد في سبيله وعلى السعي في استنقاذ المستضعفين بمكة من الرجال والنساء والصبيان المتبرمين بالمقام بها ; ولهذا قال تعالى : ( الذين يقولون ربنا أخرجنا من هذه القرية ) يعني : مكة ، كقوله تعالى : ( وكأين من قرية هي أشد قوة من قريتك التي أخرجتك ) [ محمد : 13 ] .\nثم وصفها بقوله : ( الظالم أهلها واجعل لنا من لدنك وليا واجعل لنا من لدنك نصيرا ) أي : سخر لنا من عندك وليا وناصرا .\nقال البخاري : حدثنا عبد الله بن محمد ، حدثنا سفيان ، عن عبيد الله قال : سمعت ابن عباس قال : كنت أنا وأمي من المستضعفين .\nحدثنا سليمان بن حرب ، حدثنا حماد بن زيد ، عن أيوب ، عن ابن [ أبي ] مليكة أن ابن عباس تلا ( إلا المستضعفين من الرجال والنساء والولدان ) قال : كنت أنا وأمي ممن عذر الله عز وجل .\n                                    ",
        "qortoby": "وَمَا لَكُمۡ لَا تُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلۡوِلۡدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخۡرِجۡنَا مِنۡ هَٰذِهِ ٱلۡقَرۡيَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِيّٗا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِيرًا ٥٧\n                                    \n                                    \n                                    قوله تعالى : وما لكم لا تقاتلون في سبيل الله والمستضعفين من الرجال والنساء والولدان الذين يقولون ربنا أخرجنا من هذه القرية الظالم أهلها واجعل لنا من لدنك وليا واجعل لنا من لدنك نصيرا\nفيه ثلاث مسائل :\nالأولى : قوله تعالى : وما لكم لا تقاتلون في سبيل الله حض على الجهاد ، وهو يتضمن تخليص المستضعفين من أيدي الكفرة المشركين الذين يسومونهم سوء العذاب ، ويفتنونهم عن الدين ؛ فأوجب تعالى الجهاد لإعلاء كلمته وإظهار دينه واستنقاذ المؤمنين الضعفاء من عباده ، وإن كان في ذلك تلف النفوس . وتخليص الأسارى واجب على جماعة المسلمين إما بالقتال وإما بالأموال ؛ وذلك أوجب لكونها دون النفوس إذ هي أهون منها . قال مالك : واجب على الناس أن يفدوا الأسارى بجميع أموالهم . وهذا لا خلاف فيه ؛ لقوله عليه السلام ( فكوا العاني ) وقد مضى في \" البقرة \" . وكذلك قالوا : عليهم أن يواسوهم فإن المواساة دون المفاداة . فإن كان الأسير غنيا فهل يرجع عليه الفادي أم لا ؛ قولان للعلماء ، أصحهما الرجوع .\nالثانية : قوله تعالى : والمستضعفين عطف على اسم الله عز وجل ، أي وفي سبيل المستضعفين ، فإن خلاص المستضعفين من سبيل الله . وهذا اختيار الزجاج وقاله الزهري . وقال محمد بن يزيد : أختار أن يكون المعنى وفي المستضعفين فيكون عطفا على السبيل ؛ أي وفي المستضعفين لاستنقاذهم ؛ فالسبيلان مختلفان . ويعني بالمستضعفين من كان بمكة من المؤمنين تحت إذلال كفرة قريش وأذاهم وهم المعنيون بقوله عليه السلام : اللهم أنج الوليد بن الوليد وسلمة بن هشام وعياش بن أبي ربيعة والمستضعفين من المؤمنين . وقال ابن عباس : كنت أنا وأمي من المستضعفين . في البخاري عنه إلا المستضعفين من الرجال والنساء والولدان فقال : كنت أنا وأمي ممن عذر الله ، أنا من الولدان وأمي من النساء .\nالثالثة : قوله تعالى : من هذه القرية الظالم أهلها القرية هنا مكة بإجماع من المتأولين . ووصفها بالظلم وإن كان الفعل للأهل لعلقة الضمير . وهذا كما تقول : مررت بالرجل الواسعة داره ، والكريم أبوه ، والحسنة جاريته . وإنما وصف الرجل بها للعلقة اللفظية بينهما وهو الضمير ، فلو قلت : مررت بالرجل الكريم عمرو لم تجز المسألة ؛ لأن الكرم لعمرو فلا يجوز أن يجعل صفة لرجل إلا بعلقة وهي الهاء . ولا تثنى هذه الصفة ولا تجمع ، لأنها تقوم مقام الفعل ، فالمعنى أي التي ظلم أهلها ولهذا لم يقل الظالمين . وتقول : مررت برجلين كريم أبواهما حسنة جاريتاهما ، وبرجال كريم آباؤهم حسنة جواريهم . واجعل لنا من لدنك أي من عندك . وليا أي من يستنقذنا واجعل لنا من لدنك نصيرا أي ينصرنا عليهم .\n                                    ",
        "saadi": "وَمَا لَكُمۡ لَا تُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلۡوِلۡدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخۡرِجۡنَا مِنۡ هَٰذِهِ ٱلۡقَرۡيَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِيّٗا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِيرًا ٥٧\n                                        \n                                        \n                                        \n                                        هذا حث من الله لعباده المؤمنين وتهييج لهم على القتال في سبيله، وأن ذلك قد تعين عليهم، وتوجه اللوم العظيم عليهم بتركه، فقال: { وَمَا لَكُمْ لَا تُقَاتِلُونَ فِي سَبِيلِ اللَّهِ } والحال أن المستضعفين من الرجال والنساء والولدان الذين لا يستطيعون حيلة ولا يهتدون سبيلاً، ومع هذا فقد نالهم أعظم الظلم من أعدائهم، فهم يدعون الله أن يخرجهم من هذه القرية الظالم أهلها لأنفسهم بالكفر والشرك، وللمؤمنين بالأذى والصد عن سبيل الله، ومنعهم من الدعوة لدينهم والهجرة. ويدعون الله أن يجعل لهم وليًّا ونصيرًا يستنقذهم من هذه القرية الظالم أهلها، فصار جهادكم على هذا الوجه من باب القتال والذب عن عيلاتكم وأولادكم ومحارمكم، لا من باب الجهاد الذي هو الطمع في الكفار، فإنه وإن كان فيه فضل عظيم ويلام المتخلف عنه أعظم اللوم، فالجهاد الذي فيه استنقاذ المستضعفين منكم أعظم أجرًا وأكبر فائدة، بحيث يكون من باب دفع الأعداء.\n                                    "
      },
      "originalText": "وَمَا لَكُمۡ لَا تُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلۡوِلۡدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخۡرِجۡنَا مِنۡ هَٰذِهِ ٱلۡقَرۡيَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِيّٗا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِيرًا ٥٧"
    },
    {
      "number": 569,
      "text": "الَّذِينَ آمَنُوا يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ وَالَّذِينَ كَفَرُوا يُقَاتِلُونَ فِي سَبِيلِ الطَّاغُوتِ فَقَاتِلُوا أَوْلِيَاءَ الشَّيْطَانِ ۖ إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 76,
      "juz": 5,
      "manzil": 1,
      "page": 90,
      "ruku": 71,
      "hizbQuarter": 36,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱلَّذِينَ ءَامَنُواْ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِۖ وَٱلَّذِينَ كَفَرُواْ يُقَٰتِلُونَ فِي سَبِيلِ ٱلطَّٰغُوتِ فَقَٰتِلُوٓاْ أَوۡلِيَآءَ ٱلشَّيۡطَٰنِۖ إِنَّ كَيۡدَ ٱلشَّيۡطَٰنِ كَانَ ضَعِيفًا ٦٧\n                                    \n                                    \n                                    ثم قال تعالى : ( الذين آمنوا يقاتلون في سبيل الله والذين كفروا يقاتلون في سبيل الطاغوت ) أي : المؤمنون يقاتلون في طاعة الله ورضوانه ، والكافرون يقاتلون في طاعة الشيطان .\nثم هيج تعالى المؤمنين على قتال أعدائه بقوله : ( فقاتلوا أولياء الشيطان إن كيد الشيطان كان ضعيفا )\n                                    ",
        "qortoby": "ٱلَّذِينَ ءَامَنُواْ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِۖ وَٱلَّذِينَ كَفَرُواْ يُقَٰتِلُونَ فِي سَبِيلِ ٱلطَّٰغُوتِ فَقَٰتِلُوٓاْ أَوۡلِيَآءَ ٱلشَّيۡطَٰنِۖ إِنَّ كَيۡدَ ٱلشَّيۡطَٰنِ كَانَ ضَعِيفًا ٦٧\n                                    \n                                    \n                                    قوله تعالى : الذين آمنوا يقاتلون في سبيل الله والذين كفروا يقاتلون في سبيل الطاغوت فقاتلوا أولياء الشيطان إن كيد الشيطان كان ضعيفا\nقوله تعالى : الذين آمنوا يقاتلون في سبيل الله أي في طاعته والذين كفروا يقاتلون في سبيل الطاغوت قال أبو عبيدة والكسائي : الطاغوت يذكر ويؤنث . قال أبو عبيد : وإنما ذكر وأنث لأنهم كانوا يسمون الكاهن والكاهنة طاغوتا . قال : حدثنا حجاج عن ابن جريج قال : حدثنا أبو الزبير أنه سمع جابر بن عبد الله وسئل عن الطاغوت التي كانوا يتحاكمون إليها فقال : كانت في جهينة واحدة وفي أسلم واحدة ، وفي كل حي واحدة . قال أبو إسحاق : الدليل على أنه الشيطان قوله عز وجل : فقاتلوا أولياء الشيطان إن كيد الشيطان كان ضعيفا أي مكره ومكر من اتبعه . ويقال : أراد به يوم بدر حين قال للمشركين لا غالب لكم اليوم من الناس وإني جار لكم فلما تراءت الفئتان نكص على عقبيه وقال إني بريء منكم على ما يأتي .\n                                    ",
        "saadi": "ٱلَّذِينَ ءَامَنُواْ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِۖ وَٱلَّذِينَ كَفَرُواْ يُقَٰتِلُونَ فِي سَبِيلِ ٱلطَّٰغُوتِ فَقَٰتِلُوٓاْ أَوۡلِيَآءَ ٱلشَّيۡطَٰنِۖ إِنَّ كَيۡدَ ٱلشَّيۡطَٰنِ كَانَ ضَعِيفًا ٦٧\n                                        \n                                        \n                                        \n                                        هذا إخبار من الله بأن المؤمنين يقاتلون في سبيله { وَالَّذِينَ كَفَرُوا يُقَاتِلُونَ فِي سَبِيلِ الطَّاغُوتِ } الذي هو الشيطان. في ضمن ذلك عدة فوائد: منها: أنه بحسب إيمان العبد يكون جهاده في سبيل الله، وإخلاصه ومتابعته. فالجهاد في سبيل الله من آثار الإيمان ومقتضياته ولوازمه، كما أن القتال في سبيل الطاغوت من شعب الكفر ومقتضياته. ومنها: أن الذي يقاتل في سبيل الله ينبغي له ويحسن منه من الصبر والجلد ما لا يقوم به غيره، فإذا كان أولياء الشيطان يصبرون ويقاتلون وهم على باطل، فأهل الحق أولى بذلك، كما قال تعالى في هذا المعنى: { إِنْ تَكُونُوا تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ وَتَرْجُونَ مِنَ اللَّهِ مَا لَا يَرْجُونَ } الآية. ومنها: أن الذي يقاتل في سبيل الله معتمد على ركن وثيق، وهو الحق، والتوكل على الله. فصاحب القوة والركن الوثيق يطلب منه من الصبر والثبات والنشاط ما لا يطلب ممن يقاتل عن الباطل، الذي لا حقيقة له ولا عاقبة حميدة. فلهذا قال تعالى: { فَقَاتِلُوا أَوْلِيَاءَ الشَّيْطَانِ إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا } والكيد: سلوك الطرق الخفية في ضرر العدو، فالشيطان وإن بلغ مَكْرُهُ مهما بلغ فإنه في غاية الضعف، الذي لا يقوم لأدنى شيء من الحق ولا لكيد الله لعباده المؤمنين.\n                                    "
      },
      "originalText": "ٱلَّذِينَ ءَامَنُواْ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِۖ وَٱلَّذِينَ كَفَرُواْ يُقَٰتِلُونَ فِي سَبِيلِ ٱلطَّٰغُوتِ فَقَٰتِلُوٓاْ أَوۡلِيَآءَ ٱلشَّيۡطَٰنِۖ إِنَّ كَيۡدَ ٱلشَّيۡطَٰنِ كَانَ ضَعِيفًا ٦٧"
    },
    {
      "number": 570,
      "text": "أَلَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ إِذَا فَرِيقٌ مِنْهُمْ يَخْشَوْنَ النَّاسَ كَخَشْيَةِ اللَّهِ أَوْ أَشَدَّ خَشْيَةً ۚ وَقَالُوا رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا الْقِتَالَ لَوْلَا أَخَّرْتَنَا إِلَىٰ أَجَلٍ قَرِيبٍ ۗ قُلْ مَتَاعُ الدُّنْيَا قَلِيلٌ وَالْآخِرَةُ خَيْرٌ لِمَنِ اتَّقَىٰ وَلَا تُظْلَمُونَ فَتِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 77,
      "juz": 5,
      "manzil": 1,
      "page": 90,
      "ruku": 72,
      "hizbQuarter": 36,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمۡ كُفُّوٓاْ أَيۡدِيَكُمۡ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ إِذَا فَرِيقٞ مِّنۡهُمۡ يَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡيَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡيَةٗۚ وَقَالُواْ رَبَّنَا لِمَ كَتَبۡتَ عَلَيۡنَا ٱلۡقِتَالَ لَوۡلَآ أَخَّرۡتَنَآ إِلَىٰٓ أَجَلٖ قَرِيبٖۗ قُلۡ مَتَٰعُ ٱلدُّنۡيَا قَلِيلٞ وَٱلۡأٓخِرَةُ خَيۡرٞ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِيلًا ٧٧\n                                    \n                                    \n                                    كان المؤمنون في ابتداء الإسلام - وهم بمكة - مأمورين بالصلاة والزكاة وإن لم تكن ذات النصب ، لكن كانوا مأمورين بمواساة الفقراء منهم ، وكانوا مأمورين بالصفح والعفو عن المشركين والصبر إلى حين ، وكانوا يتحرقون ويودون لو أمروا بالقتال ليشتفوا من أعدائهم ، ولم يكن الحال إذ ذاك مناسبا لأسباب كثيرة ، منها : قلة عددهم بالنسبة إلى كثرة عدد عدوهم ، ومنها كونهم كانوا في بلدهم وهو بلد حرام وأشرف بقاع الأرض ، فلم يكن الأمر بالقتال فيه ابتداء لائقا . فلهذا لم يؤمر بالجهاد إلا بالمدينة ، لما صارت لهم دار ومنعة وأنصار ، ومع هذا لما أمروا بما كانوا يودونه جزع بعضهم منه وخافوا من مواجهة الناس خوفا شديدا ( وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب ) أي : لو ما أخرت فرضه إلى مدة أخرى ، فإن فيه سفك الدماء ، ويتم الأبناء ، وتأيم النساء ، وهذه الآية في معنى قوله تعالى ( ويقول الذين آمنوا لولا نزلت سورة فإذا أنزلت سورة محكمة وذكر فيها القتال [ رأيت الذين في قلوبهم مرض ينظرون إليك نظر المغشي عليه من الموت فأولى لهم طاعة وقول معروف فإذا عزم الأمر فلو صدقوا الله لكان خيرا لهم ] ) [ محمد : 20 ، 21 ] .\nوقال ابن أبي حاتم : حدثنا علي بن الحسين ، حدثنا محمد بن عبد العزيز بن أبي رزمة وعلي بن زنجة قالا حدثنا علي بن الحسن ، عن الحسين بن واقد ، عن عمرو بن دينار ، عن عكرمة ، عن ابن عباس : أن عبد الرحمن بن عوف وأصحابا له أتوا النبي صلى الله عليه وسلم بمكة ، فقالوا : يا نبي الله ، كنا في عز ونحن مشركون ، فلما آمنا صرنا أذلة : قال : \" إني أمرت بالعفو فلا تقاتلوا القوم \" . فلما حوله الله إلى المدينة أمره بالقتال ، فكفوا . فأنزل الله : ( ألم تر إلى الذين قيل لهم كفوا أيديكم [ وأقيموا الصلاة وآتوا الزكاة فلما كتب عليهم القتال إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية ] ) الآية .\nورواه النسائي ، والحاكم ، وابن مردويه ، من حديث علي بن الحسن بن شقيق ، به .\nوقال أسباط ، عن السدي : لم يكن عليهم إلا الصلاة والزكاة ، فسألوا الله أن يفرض عليهم القتال ، فلما كتب عليهم القتال : ( إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب ) وهو الموت ، قال الله تعالى : ( قل متاع الدنيا قليل والآخرة خير لمن اتقى )\nوعن مجاهد : إن هذه الآيات نزلت في اليهود . رواه ابن جرير .\nوقوله : ( قل متاع الدنيا قليل والآخرة خير لمن اتقى ) أي : آخرة المتقي خير من دنياه .\n( ولا تظلمون فتيلا ) أي : من أعمالكم بل توفونها أتم الجزاء . وهذه تسلية لهم عن الدنيا . وترغيب لهم في الآخرة ، وتحريض لهم على الجهاد .\nقال ابن أبي حاتم : حدثنا أبي ، حدثنا يعقوب بن إبراهيم الدورقي ، حدثنا عبد الرحمن بن مهدي ، حدثنا حماد بن زيد ، عن قال : قرأ الحسن : ( قل متاع الدنيا قليل ) قال : رحم الله عبدا صحبها على حسب ذلك ، ما الدنيا كلها أولها وآخرها إلا كرجل نام نومة ، فرأى في منامه بعض ما يحب ، ثم انتبه .\nوقال ابن معين : كان أبو مسهر ينشد :\nولا خير في لمن لم يكن له من الله في دار المقام نصيب فإن تعجب الدنيا رجالا فإنها\nمتاع قليل والزوال قريب\n                                    ",
        "qortoby": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمۡ كُفُّوٓاْ أَيۡدِيَكُمۡ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ إِذَا فَرِيقٞ مِّنۡهُمۡ يَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡيَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡيَةٗۚ وَقَالُواْ رَبَّنَا لِمَ كَتَبۡتَ عَلَيۡنَا ٱلۡقِتَالَ لَوۡلَآ أَخَّرۡتَنَآ إِلَىٰٓ أَجَلٖ قَرِيبٖۗ قُلۡ مَتَٰعُ ٱلدُّنۡيَا قَلِيلٞ وَٱلۡأٓخِرَةُ خَيۡرٞ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِيلًا ٧٧\n                                    \n                                    \n                                    قوله تعالى : ألم تر إلى الذين قيل لهم كفوا أيديكم وأقيموا الصلاة وآتوا الزكاة فلما كتب عليهم القتال إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا روى عمرو بن دينار عن عكرمة عن ابن عباس أن عبد الرحمن بن عوف وأصحابا له أتوا النبي صلى الله عليه وسلم بمكة فقالوا : يا نبي الله ، كنا في عز ونحن مشركون ، فلما آمنا صرنا أذلة ؟ فقال : إني أمرت بالعفو فلا تقاتلوا القوم . فلما حوله الله تعالى إلى المدينة أمره بالقتال فكفوا ، فنزلت الآية . أخرجه النسائي في سننه ، وقاله الكلبي . وقال مجاهد : هم يهود . قال الحسن : هي في المؤمنين ؛ لقوله : يخشون الناس أي مشركي مكة كخشية الله فهي على ما طبع عليه البشر من المخافة لا على المخالفة . قال السدي : هم قوم أسلموا قبل فرض القتال فلما فرض كرهوه . وقيل : هو وصف للمنافقين ؛ والمعنى يخشون القتل من المشركين كما يخشون الموت من الله . أو أشد خشية أي عندهم وفي اعتقادهم .\nقلت : وهذا أشبه بسياق الآية ، لقوله : وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب أي هلا ، ولا يليها إلا الفعل . ومعاذ الله أن يصدر هذا القول من صحابي كريم يعلم أن الآجال محدودة والأرزاق مقسومة ، بل كانوا لأوامر الله ممتثلين سامعين طائعين ، يرون الوصول إلى الدار الآجلة خيرا من المقام في الدار العاجلة ، على ما هو معروف من سيرتهم رضي الله عنهم . اللهم إلا أن يكون قائله ممن لم يرسخ في الإيمان قدمه ، ولا انشرح بالإسلام جنانه ، فإن أهل الإيمان متفاضلون فمنهم الكامل ومنهم الناقص ، وهو الذي تنفر نفسه عما يؤمر به فيما تلحقه فيه المشقة وتدركه فيه الشدة . والله أعلم .\nقوله تعالى : قل متاع الدنيا قليل ابتداء وخبر . وكذا والآخرة خير لمن اتقى أي المعاصي ؛ وقد مضى القول في هذا في \" البقرة \" ومتاع الدنيا منفعتها والاستمتاع بلذاتها وسماه قليلا لأنه لا بقاء له . وقال النبي صلى الله عليه وسلم مثلي ومثل الدنيا كراكب قال قيلولة تحت شجرة ثم راح وتركها وقد تقدم هذا المعنى في \" البقرة \" مستوفى .\n                                    ",
        "saadi": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمۡ كُفُّوٓاْ أَيۡدِيَكُمۡ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ إِذَا فَرِيقٞ مِّنۡهُمۡ يَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡيَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡيَةٗۚ وَقَالُواْ رَبَّنَا لِمَ كَتَبۡتَ عَلَيۡنَا ٱلۡقِتَالَ لَوۡلَآ أَخَّرۡتَنَآ إِلَىٰٓ أَجَلٖ قَرِيبٖۗ قُلۡ مَتَٰعُ ٱلدُّنۡيَا قَلِيلٞ وَٱلۡأٓخِرَةُ خَيۡرٞ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِيلًا ٧٧\n                                        \n                                        \n                                        \n                                        كان المسلمون -إذ كانوا بمكة- مأمورين بالصلاة والزكاة أي: مواساة الفقراء، لا الزكاة المعروفة ذات النصب والشروط، فإنها لم تفرض إلا بالمدينة، ولم يؤمروا بجهاد الأعداء لعدة فوائد: منها: أن من حكمة الباري تعالى أن يشرع لعباده الشرائع على وجه لا يشق عليهم؛ ويبدأ بالأهم فالأهم، والأسهل فالأسهل. ومنها: أنه لو فرض عليهم القتال -مع قلة عَدَدِهِم وعُدَدِهِم وكثرة أعدائهم- لأدى ذلك إلى اضمحلال الإسلام، فروعي جانب المصلحة العظمى على ما دونها ولغير ذلك من الحِكَم. وكان بعض المؤمنين يودون أن لو فرض عليهم القتال في تلك الحال، غير اللائق فيها ذلك، وإنما اللائق فيها القيام بما أمروا به في ذلك الوقت من التوحيد والصلاة والزكاة ونحو ذلك كما قال تعالى: { وَلَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ لَكَانَ خَيْرًا لَهُمْ وَأَشَدَّ تَثْبِيتًا } فلما هاجروا إلى المدينة وقوي الإسلام، كُتب عليهم القتال في وقته المناسب لذلك، فقال فريق من الذين يستعجلون القتال قبل ذلك خوفا من الناس وضعفا وخورا: { رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا الْقِتَالَ } ؟ وفي هذا تضجرهم واعتراضهم على الله، وكان الذي ينبغي لهم ضد هذه الحال، التسليم لأمر الله والصبر على أوامره، فعكسوا الأمر المطلوب منهم فقالوا: { لَوْلَا أَخَّرْتَنَا إِلَى أَجَلٍ قَرِيبٍ } أي: هلَّا أخرت فرض القتال مدة متأخرة عن الوقت الحاضر، وهذه الحال كثيرًا ما تعرض لمن هو غير رزين واستعجل في الأمور قبل وقتها، فالغالب عليه أنه لا يصبر عليها وقت حلولها ولا ينوء بحملها، بل يكون قليل الصبر. ثم إن الله وعظهم عن هذه الحال التي فيها التخلف عن القتال فقال: { قُلْ مَتَاعُ الدُّنْيَا قَلِيلٌ وَالْآخِرَةُ خَيْرٌ لِمَنِ اتَّقَى } أي: التمتع بلذات الدنيا وراحتها قليل، فتحمل الأثقال في طاعة الله في المدة القصيرة مما يسهل على النفوس ويخف عليها؛ لأنها إذا علمت أن المشقة التي تنالها لا يطول لبثها هان عليها ذلك، فكيف إذا وازنت بين الدنيا والآخرة، وأن الآخرة خير منها، في ذاتها، ولذاتها وزمانها، فذاتها -كما ذكر النبي صلى الله عليه وسلم في الحديث الثابت عنه- \"أن موضع سوط في الجنة خير من الدنيا وما فيها\" . ولذاتها صافية عن المكدرات، بل كل ما خطر بالبال أو دار في الفكر من تصور لذة، فلذة الجنة فوق ذلك كما قال تعالى: { فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ } وقال الله على لسان نبيه: \"أعددت لعبادي الصالحين ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر\" . وأما لذات الدنيا فإنها مشوبة بأنواع التنغيص الذي لو قوبل بين لذاتها وما يقترن بها من أنواع الآلام والهموم والغموم، لم يكن لذلك نسبة بوجه من الوجوه. وأما زمانها، فإن الدنيا منقضية، وعمر الإنسان بالنسبة إلى الدنيا شيء يسير، وأما الآخرة فإنها دائمة النعيم وأهلها خالدون فيها، فإذا فكّر العاقل في هاتين الدارين وتصور حقيقتهما حق التصور، عرف ما هو أحق بالإيثار، والسعي له والاجتهاد لطلبه، ولهذا قال: { وَالْآخِرَةُ خَيْرٌ لِمَنِ اتَّقَى } أي: اتقى الشرك، وسائر المحرمات. { وَلَا تُظْلَمُونَ فَتِيلًا } أي: فسعيكم للدار الآخرة ستجدونه كاملاً موفرًا غير منقوص منه شيئًا.\n\n                                    "
      },
      "originalText": "أَلَمۡ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمۡ كُفُّوٓاْ أَيۡدِيَكُمۡ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ إِذَا فَرِيقٞ مِّنۡهُمۡ يَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡيَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡيَةٗۚ وَقَالُواْ رَبَّنَا لِمَ كَتَبۡتَ عَلَيۡنَا ٱلۡقِتَالَ لَوۡلَآ أَخَّرۡتَنَآ إِلَىٰٓ أَجَلٖ قَرِيبٖۗ قُلۡ مَتَٰعُ ٱلدُّنۡيَا قَلِيلٞ وَٱلۡأٓخِرَةُ خَيۡرٞ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِيلًا ٧٧"
    },
    {
      "number": 571,
      "text": "أَيْنَمَا تَكُونُوا يُدْرِكْكُمُ الْمَوْتُ وَلَوْ كُنْتُمْ فِي بُرُوجٍ مُشَيَّدَةٍ ۗ وَإِنْ تُصِبْهُمْ حَسَنَةٌ يَقُولُوا هَٰذِهِ مِنْ عِنْدِ اللَّهِ ۖ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ يَقُولُوا هَٰذِهِ مِنْ عِنْدِكَ ۚ قُلْ كُلٌّ مِنْ عِنْدِ اللَّهِ ۖ فَمَالِ هَٰؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 78,
      "juz": 5,
      "manzil": 1,
      "page": 90,
      "ruku": 72,
      "hizbQuarter": 36,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أَيۡنَمَا تَكُونُواْ يُدۡرِككُّمُ ٱلۡمَوۡتُ وَلَوۡ كُنتُمۡ فِي بُرُوجٖ مُّشَيَّدَةٖۗ وَإِن تُصِبۡهُمۡ حَسَنَةٞ يَقُولُواْ هَٰذِهِۦ مِنۡ عِندِ ٱللَّهِۖ وَإِن تُصِبۡهُمۡ سَيِّئَةٞ يَقُولُواْ هَٰذِهِۦ مِنۡ عِندِكَۚ قُلۡ كُلّٞ مِّنۡ عِندِ ٱللَّهِۖ فَمَالِ هَٰٓؤُلَآءِ ٱلۡقَوۡمِ لَا يَكَادُونَ يَفۡقَهُونَ حَدِيثٗا ٨٧\n                                    \n                                    \n                                    وقوله : ( أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة ) أي : أنتم صائرون إلى الموت لا محالة ، ولا ينجو منه أحد منكم ، كما قال تعالى : ( كل من عليها فان [ ويبقى وجه ربك ذو الجلال والإكرام ] ) [ الرحمن : 26 ، 27 ] وقال تعالى ( كل نفس ذائقة الموت ) [ آل عمران : 185 ] وقال تعالى : ( وما جعلنا لبشر من قبلك الخلد ) [ الأنبياء : 34 ] والمقصود : أن كل أحد صائر إلى الموت لا محالة ، ولا ينجيه من ذلك شيء ، وسواء عليه جاهد أو لم يجاهد ، فإن له أجلا محتوما ، وأمدا مقسوما ، كما قال خالد بن الوليد حين جاءه الموت على فراشه : لقد شهدت كذا وكذا موقفا ، وما من عضو من أعضائي إلا وفيه جرح من طعنة أو رمية ، وها أنا أموت على فراشي ، فلا نامت أعين الجبناء .\nوقوله : ( ولو كنتم في بروج مشيدة ) أي : حصينة منيعة عالية رفيعة . وقيل : هي بروج في السماء . قاله السدي ، وهو ضعيف . والصحيح : أنها المنيعة . أي : لا يغني حذر وتحصن من الموت ، كما قال زهير بن أبي سلمى :\nومن خاف أسباب المنية يلقها ولو رام أسباب السماء بسلم\nثم قيل : \" المشيدة \" هي المشيدة كما قال : ( وقصر مشيد ) [ الحج : 45 ] وقيل : بل بينهما فرق ، وهو أن المشيدة بالتشديد ، هي : المطولة ، وبالتخفيف هي : المزينة بالشيد وهو الجص .\nوقد ذكر ابن جرير ، وابن أبي حاتم هاهنا حكاية مطولة عن مجاهد : أنه ذكر أن امرأة فيمن كان قبلنا أخذها الطلق ، فأمرت أجيرها أن يأتيها بنار ، فخرج ، فإذا هو برجل واقف على الباب ، فقال : ما ولدت المرأة ؟ فقال : جارية ، فقال : أما إنها ستزني بمائة رجل ، ثم يتزوجها أجيرها ، ويكون موتها بالعنكبوت . قال : فكر راجعا ، فبعج الجارية بسكين في بطنها ، فشقه ، ثم ذهب هاربا ، وظن أنها قد ماتت ، فخاطت أمها بطنها ، فبرئت وشبت وترعرعت ، ونشأت أحسن امرأة ببلدتها فذهب ذاك [ الأجير ] ما ذهب ، ودخل البحور فاقتنى أموالا جزيلة ، ثم رجع إلى بلده وأراد التزويج ، فقال لعجوز : أريد أن أتزوج بأحسن امرأة بهذه البلدة . فقالت له : ليس هنا أحسن من فلانة . فقال : اخطبيها علي . فذهبت إليها فأجابت ، فدخل بها فأعجبته إعجابا شديدا ، فسألته عن أمره ومن أين مقدمه ؟ فأخبرها خبره ، وما كان من أمره في هربه . فقالت : أنا هي . وأرته مكان السكين ، فتحقق ذلك فقال : لئن كنت إياها فلقد أخبرتني باثنتين لا بد منهما ، إحداهما : أنك قد زنيت بمائة رجل . فقالت : لقد كان شيء من ذلك ، ولكن لا أدري ما عددهم ؟ فقال : هم مائة . والثانية : أنك تموتين بالعنكبوت . فاتخذ لها قصرا منيعا شاهقا ، ليحرزها من ذلك ، فبينا هم يوما إذا بالعنكبوت في السقف ، فأراها إياها ، فقالت : أهذه التي تحذرها علي ، والله لا يقتلها إلا أنا ، فأنزلوها من السقف فعمدت إليها فوطئتها بإبهام رجلها فقتلتها ، فطار من سمها شيء فوقع بين ظفرها ولحمها ، فاسودت رجلها وكان في ذلك أجلها .\nونذكر هاهنا قصة صاحب الحضر ، وهو \" الساطرون \" لما احتال عليه \" سابور \" حتى حصره فيه ، وقتل من فيه بعد محاصرة سنتين ، وقالت العرب في ذلك أشعارا منها :\nوأخو الحضر إذ بناه وإذ دج لة تجبى إليه والخابور\nشاده مرمرا وجلله كل سا فللطير في ذراه وكور\nلم تهبه أيدي المنون فباد ال ملك عنه فبابه مهجور\nولما دخل على عثمان يقول : اللهم اجمع أمة محمد ، ثم تمثل بقول الشاعر :\nأرى الموت لا يبقي عزيزا ولم يدع لعاد ملاذا في البلاد ومربعا\nيبيت أهل الحصن والحصن مغلق ويأتي الجبال في شماريخها معا\nوقوله : ( وإن تصبهم حسنة ) أي : خصب ورزق من ثمار وزروع وأولاد ونحو ذلك هذا معنى قول ابن عباس وأبي العالية والسدي ( يقولوا هذه من عند الله وإن تصبهم سيئة ) أي : قحط وجدب ونقص في الثمار والزروع أو موت أولاد أو نتاج أو غير ذلك . كما يقوله أبو العالية والسدي . ( يقولوا هذه من عندك ) أي : من قبلك وبسبب اتباعنا لك واقتدائنا بدينك . كما قال تعالى عن قوم فرعون : ( فإذا جاءتهم الحسنة قالوا لنا هذه وإن تصبهم سيئة يطيروا بموسى ومن معه ) [ الأعراف : 131 ] وكما قال تعالى : ( ومن الناس من يعبد الله على حرف [ فإن أصابه خير اطمأن به وإن أصابته فتنة انقلب على وجهه خسر الدنيا والآخرة ] ) الآية [ الحج : 11 ] . وهكذا قال هؤلاء المنافقون الذين دخلوا في الإسلام ظاهرا وهم كارهون له في نفس الأمر ; ولهذا إذا أصابهم شر إنما يسندونه إلى اتباعهم للنبي صلى الله عليه وسلم وقال السدي : ( وإن تصبهم حسنة ) قال : والحسنة الخصب ، تنتج خيولهم وأنعامهم ومواشيهم ، ويحسن وتلد نساؤهم الغلمان قالوا : ( هذه من عند الله وإن تصبهم سيئة ) والسيئة : الجدب والضرر في أموالهم ، تشاءموا بمحمد صلى الله عليه وسلم وقالوا : ( هذه من عندك ) يقولون : بتركنا واتباعنا محمدا أصابنا هذا البلاء ، فأنزل الله عز وجل : ( قل كل من عند الله ) فقوله ( قل كل من عند الله ) أي الجميع بقضاء الله وقدره ، وهو نافذ في البر والفاجر ، والمؤمن والكافر .\nقال علي بن أبي طلحة ، عن ابن عباس : ( قل كل من عند الله ) أي : الحسنة والسيئة . وكذا قال الحسن البصري .\nثم قال تعالى منكرا على هؤلاء القائلين هذه المقالة الصادرة عن شك وريب . وقلة فهم وعلم ، وكثرة جهل وظلم : ( فمال هؤلاء القوم لا يكادون يفقهون حديثا )\nذكر حديث غريب يتعلق بقوله تعالى : ( قل كل من عند الله )\nقال الحافظ أبو بكر البزار : حدثنا السكن بن سعيد ، حدثنا عمر بن يونس ، حدثنا إسماعيل بن حماد ، عن مقاتل بن حيان ، عن عمرو بن شعيب ، عن أبيه ، عن جده قال : كنا جلوسا عند رسول الله صلى الله عليه وسلم ; فأقبل أبو بكر وعمر في قبيلتين من الناس ، وقد ارتفعت أصواتهما ، فجلس أبو بكر قريبا من رسول الله صلى الله عليه وسلم ; وجلس عمر قريبا من أبي بكر ، فقال رسول الله صلى الله عليه وسلم : \" لم ارتفعت أصواتكما ؟ \" فقال رجل : يا رسول الله ، قال أبو بكر : الحسنات من الله والسيئات من أنفسنا . فقال رسول الله صلى الله عليه وسلم : \" فما قلت يا عمر ؟ \" قال : قلت : الحسنات والسيئات من الله تعالى . فقال رسول الله صلى الله عليه وسلم : \" إن أول من تكلم فيه جبريل وميكائيل ، فقال ميكائيل مقالتك يا أبا بكر ، وقال جبريل مقالتك يا عمر فقال : نختلف فيختلف أهل السماء وإن يختلف أهل السماء يختلف أهل الأرض . فتحاكما إلى إسرافيل ، فقضى بينهم أن الحسنات والسيئات من الله \" . ثم أقبل على أبي بكر وعمر فقال \" احفظا قضائي بينكما ، لو أراد الله ألا يعصى لم يخلق إبليس \" .\nقال شيخ الإسلام تقي الدين أبو العباس ابن تيمية : هذا حديث موضوع مختلق باتفاق أهل المعرفة .\n                                    ",
        "qortoby": "أَيۡنَمَا تَكُونُواْ يُدۡرِككُّمُ ٱلۡمَوۡتُ وَلَوۡ كُنتُمۡ فِي بُرُوجٖ مُّشَيَّدَةٖۗ وَإِن تُصِبۡهُمۡ حَسَنَةٞ يَقُولُواْ هَٰذِهِۦ مِنۡ عِندِ ٱللَّهِۖ وَإِن تُصِبۡهُمۡ سَيِّئَةٞ يَقُولُواْ هَٰذِهِۦ مِنۡ عِندِكَۚ قُلۡ كُلّٞ مِّنۡ عِندِ ٱللَّهِۖ فَمَالِ هَٰٓؤُلَآءِ ٱلۡقَوۡمِ لَا يَكَادُونَ يَفۡقَهُونَ حَدِيثٗا ٨٧\n                                    \n                                    \n                                    قوله تعالى : أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة وإن تصبهم حسنة يقولوا هذه من عند الله وإن تصبهم سيئة يقولوا هذه من عندك قل كل من عند الله فمال هؤلاء القوم لا يكادون يفقهون حديثا\nفيه أربع مسائل :\nالأولى : قوله تعالى : أينما تكونوا يدرككم الموت شرط ومجازاة ، و \" ما \" زائدة وهذا الخطاب عام وإن كان المراد المنافقين أو ضعفة المؤمنين الذين قالوا : لولا أخرتنا إلى أجل قريب أي إلى أن نموت بآجالنا ، وهو أشبه المنافقين كما ذكرنا ، لقولهم لما أصيب أهل أحد ، قالوا : لو كانوا عندنا ما ماتوا وما قتلوا فرد الله عليهم أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة قال ابن عباس في رواية أبي صالح عنه . وواحد البروج برج ، وهو البناء المرتفع والقصر العظيم . قال طرفة يصف ناقة :\nكأنها برج رومي تكففها بان بشيد وآجر وأحجار\nوقرأ طلحة بن سليمان \" يدرككم \" برفع الكاف على إضمار الفاء ، وهو قليل لم يأت إلا في الشعر نحو قوله :\nمن يفعل الحسنات الله يشكرها\nأراد فالله يشكرها .\nواختلف العلماء وأهل التأويل في المراد بهذه البروج ، فقال الأكثر وهو الأصح . إنه أراد البروج في الحصون التي في الأرض المبنية ، لأنها غاية البشر في التحصن والمنعة ، فمثل الله لهم بها . وقال قتادة : في قصور محصنة . وقاله ابن جريج والجمهور ، ومنه قول عامر بن الطفيل للنبي صلى الله عليه وسلم : هل لك في حصن حصين ومنعة ؟ وقال مجاهد : البروج القصور . ابن عباس : البروج الحصون والآطام والقلاع . ومعنى مشيدة مطولة ، قاله الزجاج والقتبي . عكرمة : المزينة بالشيد وهو الجص . قال قتادة : محصنة . والمشيد والمشيد سواء ، ومنه وقصر مشيد والتشديد للتكثير . وقيل المشيد المطول ، والمشيد المطلي بالشيد . يقال : شاد البنيان وأشاد بذكره . وقال السدي : المراد بالبروج بروج في السماء الدنيا مبنية . وحكى هذا القول مكي عن مالك وأنه قال ألا ترى إلى قوله تعالى : والسماء ذات البروج و جعل في السماء بروجا ولقد جعلنا في السماء بروجا . وحكاه ابن العربي أيضا عن ابن القاسم عن مالك . وحكى النقاش عن ابن عباس أنه قال : في بروج مشيدة معناه في قصور من حديد . قال ابن عطية : وهذا لا يعطيه ظاهر اللفظ .\nالثانية : هذه الآية ترد على القدرية في الآجال ، لقوله تعالى : أينما تكونوا يدرككم الموت ولو كنتم في بروج مشيدة فعرفهم بذلك أن الآجال متى انقضت فلا بد من مفارقة الروح الجسد ، كان ذلك بقتل أو موت أو غير ذلك مما أجرى الله العادة بزهوقها به . وقالت المعتزلة : إن المقتول لو لم يقتله القاتل لعاش . وقد تقدم الرد عليهم في \" آل عمران \" ويأتي فوافقوا بقولهم هذا الكفار والمنافقين .\nالثالثة : اتخاذ البلاد وبناؤها ليمتنع بها في حفظ الأموال والنفوس ، وهي سنة الله في عباده . وفي ذلك أدل دليل على رد قول من يقول : التوكل ترك الأسباب ، فإن اتخاذ البلاد من أكبر الأسباب وأعظمها وقد أمرنا بها ، واتخذها الأنبياء وحفروا حولها الخنادق عدة وزيادة في التمنع . وقد قيل للأحنف : ما حكمة السور ؟ فقال : ليردع السفيه حتى يأتي الحكيم فيحميه .\nالرابعة : وإذا تنزلنا على قول مالك والسدي في أنها بروج السماء ، فبروج الفلك اثنا عشر برجا مشيدة من الرفع ، وهي الكواكب العظام . وقيل للكواكب بروج لظهورها ، من برج يبرج إذا ظهر وارتفع ؛ ومنه قوله : ولا تبرجن تبرج الجاهلية الأولى وخلقها الله تعالى منازل للشمس والقمر وقدره فيها ، ورتب الأزمنة عليها ، وجعلها جنوبية وشمالية دليلا على المصالح وعلما على القبلة ، وطريقا إلى تحصيل آناء الليل وآناء النهار لمعرفة أوقات التهجد وغير ذلك من أحوال المعاش .\nقوله تعالى : وإن تصبهم حسنة يقولوا هذه من عند الله أي إن يصب المنافقين خصب قالوا : هذا من عند الله . وإن تصبهم سيئة أي جدب ومحل قالوا : هذا من عندك ، أي أصابنا ذلك بشؤمك وشؤم أصحابك . وقيل : الحسنة : السلامة والأمن ، والسيئة : الأمراض والخوف . وقيل : الحسنة : الغنى ، والسيئة : الفقر . وقيل : الحسنة : النعمة والفتح والغنيمة يوم بدر ، والسيئة : البلية والشدة والقتل يوم أحد . وقيل : الحسنة : السراء ، والسيئة : الضراء . هذه أقوال المفسرين وعلماء التأويل - ابن عباس وغيره - في الآية . وأنها نزلت في اليهود والمنافقين ، وذلك أنها لما قدم رسول الله صلى الله عليه وسلم المدينة عليهم قالوا : ما زلنا نعرف النقص في ثمارنا ومزارعنا مذ قدم علينا هذا الرجل وأصحابه . قال ابن عباس : ومعنى من عندك أي بسوء تدبيرك . وقيل : من عندك بشؤمك ، كما ذكرنا ، أي بشؤمك الذي لحقنا ، قالوه على جهة التطير . قال الله تعالى قل كل من عند الله أي الشدة والرخاء والظفر والهزيمة من عند الله ، أي بقضاء الله وقدره . فمال هؤلاء القوم يعني المنافقين لا يكادون يفقهون حديثا أي ما شأنهم لا يفقهون أن كلا من عند الله .\n                                    ",
        "saadi": "أَيۡنَمَا تَكُونُواْ يُدۡرِككُّمُ ٱلۡمَوۡتُ وَلَوۡ كُنتُمۡ فِي بُرُوجٖ مُّشَيَّدَةٖۗ وَإِن تُصِبۡهُمۡ حَسَنَةٞ يَقُولُواْ هَٰذِهِۦ مِنۡ عِندِ ٱللَّهِۖ وَإِن تُصِبۡهُمۡ سَيِّئَةٞ يَقُولُواْ هَٰذِهِۦ مِنۡ عِندِكَۚ قُلۡ كُلّٞ مِّنۡ عِندِ ٱللَّهِۖ فَمَالِ هَٰٓؤُلَآءِ ٱلۡقَوۡمِ لَا يَكَادُونَ يَفۡقَهُونَ حَدِيثٗا ٨٧\n                                        \n                                        \n                                        \n                                        ثم أخبر أنه لا يغني حذر عن قدر، وأن القاعد لا يدفع عنه قعوده شيئًا، فقال: { أَيْنَمَا تَكُونُوا يُدْرِكُكُمُ الْمَوْتُ } أي: في أي زمان وأي مكان. { وَلَوْ كُنْتُمْ فِي بُرُوجٍ مُشَيَّدَةٍ } أي: قصور منيعة ومنازل رفيعة، وكل هذا حث على الجهاد في سبيل الله تارة بالترغيب في فضله وثوابه، وتارة بالترهيب من عقوبة تركه، وتارة بالإخبار أنه لا ينفع القاعدين قعودُهم، وتارة بتسهيل الطريق في ذلك وقصرها.يخبر تعالى عن الذين لا يعلمون المعرضين عما جاءت به الرسل، المعارضين لهم أنهم إذا جاءتهم حسنة أي: خصب وكثرة أموال، وتوفر أولاد وصحة، قالوا: { هَذِهِ مِنْ عِنْدِ اللَّهِ } وأنهم إن أصابتهم سيئة أي: جدب وفقر، ومرض وموت أولاد وأحباب قالوا: { هَذِهِ مِنْ عِنْدِكَ } أي: بسبب ما جئتنا به يا محمد، تطيروا برسول الله صلى الله عليه وسلم كما تطير أمثالهم برسل الله، كما أخبر الله عن قوم فرعون أنهم قالوا لموسى { فَإِذَا جَاءَتْهُمُ الْحَسَنَةُ قَالُوا لَنَا هَذِهِ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ يَطَّيَّرُوا بِمُوسَى وَمَنْ مَعَهُ } وقال قوم صالح: { قالوا اطَّيَّرْنَا بِكَ وَبِمَنْ مَعَكَ } وقال قوم ياسين لرسلهم: { إِنَّا تَطَيَّرْنَا بِكُمْ لَئِنْ لَمْ تَنْتَهُوا لَنَرْجُمَنَّكُمْ } الآية. فلما تشابهت قلوبهم بالكفر تشابهت أقوالهم وأعمالهم. وهكذا كل من نسب حصول الشر أو زوال الخير لما جاءت به الرسل أو لبعضه فهو داخل في هذا الذم الوخيم. قال الله في جوابهم: { قُلْ كُلٌّ } أي: من الحسنة والسيئة والخير والشر. { مِنْ عِنْدِ اللَّهِ } أي: بقضائه وقدره وخلقه. { فَمَا لهَؤُلَاءِ الْقَوْم } أي: الصادر منهم تلك المقالة الباطلة. { لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا } أي: لا يفهمون حديثا بالكلية ولا يقربون من فهمه، أو لا يفهمون منه إلا فهمًا ضعيفًا، وعلى كل فهو ذم لهم وتوبيخ على عدم فهمهم وفقههم عن الله وعن رسوله، وذلك بسبب كفرهم وإعراضهم. وفي ضمن ذلك مدْح من يفهم عن الله وعن رسوله، والحث على ذلك، وعلى الأسباب المعينة على ذلك، من الإقبال على كلامهما وتدبره، وسلوك الطرق الموصلة إليه. فلو فقهوا عن الله لعلموا أن الخير والشر والحسنات والسيئات كلها بقضاء الله وقدره، لا يخرج منها شيء عن ذلك. وأن الرسل عليهم الصلاة والسلام لا يكونون سببا لشر يحدث، هم ولا ما جاءوا به لأنهم بعثوا بصلاح الدنيا والآخرة والدين.\n                                    "
      },
      "originalText": "أَيۡنَمَا تَكُونُواْ يُدۡرِككُّمُ ٱلۡمَوۡتُ وَلَوۡ كُنتُمۡ فِي بُرُوجٖ مُّشَيَّدَةٖۗ وَإِن تُصِبۡهُمۡ حَسَنَةٞ يَقُولُواْ هَٰذِهِۦ مِنۡ عِندِ ٱللَّهِۖ وَإِن تُصِبۡهُمۡ سَيِّئَةٞ يَقُولُواْ هَٰذِهِۦ مِنۡ عِندِكَۚ قُلۡ كُلّٞ مِّنۡ عِندِ ٱللَّهِۖ فَمَالِ هَٰٓؤُلَآءِ ٱلۡقَوۡمِ لَا يَكَادُونَ يَفۡقَهُونَ حَدِيثٗا ٨٧"
    },
    {
      "number": 572,
      "text": "مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ ۖ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ ۚ وَأَرْسَلْنَاكَ لِلنَّاسِ رَسُولًا ۚ وَكَفَىٰ بِاللَّهِ شَهِيدًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 79,
      "juz": 5,
      "manzil": 1,
      "page": 90,
      "ruku": 72,
      "hizbQuarter": 36,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَّآ أَصَابَكَ مِنۡ حَسَنَةٖ فَمِنَ ٱللَّهِۖ وَمَآ أَصَابَكَ مِن سَيِّئَةٖ فَمِن نَّفۡسِكَۚ وَأَرۡسَلۡنَٰكَ لِلنَّاسِ رَسُولٗاۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ٩٧\n                                    \n                                    \n                                    ثم قال تعالى - مخاطبا - للرسول [ صلى الله عليه وسلم ] والمراد جنس الإنسان ليحصل الجواب : ( ما أصابك من حسنة فمن الله ) أي : من فضل الله ومنه ولطفه ورحمته ( وما أصابك من سيئة فمن نفسك ) أي : فمن قبلك ، ومن عملك أنت كما قال تعالى : ( وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير ) [ الشورى : 30 ] .\nقال السدي ، والحسن البصري ، وابن جريج ، وابن زيد : ( فمن نفسك ) أي : بذنبك .\nوقال قتادة : ( ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك ) عقوبة يا ابن آدم بذنبك . قال : وذكر لنا أن نبي الله صلى الله عليه وسلم كان يقول : \" لا يصيب رجلا خدش عود ، ولا عثرة قدم ، ولا اختلاج عرق ، إلا بذنب ، وما يعفو الله أكثر \" .\nوهذا الذي أرسله قتادة قد روي متصلا في الصحيح : \" والذي نفسي بيده ، لا يصيب المؤمن هم ولا حزن ، ولا نصب ، حتى الشوكة يشاكها إلا كفر الله عنه بها من خطاياه \" .\nوقال أبو صالح : ( ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك ) أي : بذنبك ، وأنا الذي قدرتها عليك . رواه ابن جرير .\nوقال ابن أبي حاتم : حدثنا محمد بن عمار ، حدثنا سهل - يعني ابن بكار - حدثنا الأسود بن شيبان ، حدثني عقبة بن واصل بن أخي مطرف ، عن مطرف بن عبد الله قال : ما تريدون من القدر ، أما تكفيكم الآية التي في سورة النساء : ( وإن تصبهم حسنة يقولوا هذه من عند الله وإن تصبهم سيئة يقولوا هذه من عندك ) أي : من نفسك ، والله ما وكلوا إلى القدر وقد أمروا وإليه يصيرون .\nوهذا كلام متين قوي في الرد على القدرية والجبرية أيضا ، ولبسطه موضع آخر .\nوقوله تعالى : ( وأرسلناك للناس رسولا ) أي : تبلغهم شرائع الله ، وما يحبه ويرضاه ، وما يكرهه ويأباه .\n( وكفى بالله شهيدا ) أي : على أنه أرسلك ، وهو شهيد أيضا بينك وبينهم ، وعالم بما تبلغهم إياه ، وبما يردون عليك من الحق كفرا وعنادا .\n                                    ",
        "qortoby": "مَّآ أَصَابَكَ مِنۡ حَسَنَةٖ فَمِنَ ٱللَّهِۖ وَمَآ أَصَابَكَ مِن سَيِّئَةٖ فَمِن نَّفۡسِكَۚ وَأَرۡسَلۡنَٰكَ لِلنَّاسِ رَسُولٗاۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ٩٧\n                                    \n                                    \n                                    قوله تعالى : ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك وأرسلناك للناس رسولا وكفى بالله شهيدا\nقوله تعالى : ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك أي ما أصابك يا محمد من خصب ورخاء وصحة وسلامة فبفضل الله عليك وإحسانه إليك ، وما أصابك من جدب وشدة فبذنب أتيته عوقبت عليه . والخطاب للنبي صلى الله عليه وسلم والمراد أمته . أي ما أصابكم يا معشر الناس من خصب واتساع رزق فمن تفضل الله عليكم ، وما أصابكم من جدب وضيق رزق فمن أنفسكم ؛ أي من أجل ذنوبكم وقع ذلك بكم . قاله الحسن والسدي وغيرهما ؛ كما قال تعالى : يا أيها النبي إذا طلقتم النساء . وقد قيل : الخطاب للإنسان والمراد به الجنس ؛ كما قال تعالى : والعصر إن الإنسان لفي خسر أي إن الناس لفي خسر ، ألا تراه استثنى منهم فقال إلا الذين آمنوا ولا يستثنى إلا من جملة أو جماعة . وعلى هذا التأويل يكون قوله ما أصابك استئنافا . وقيل : في الكلام حذف تقديره يقولون ؛ وعليه يكون الكلام متصلا ؛ والمعنى فمال هؤلاء القوم لا يكادون يفقهون حديثا حتى يقولوا ما أصابك من حسنة فمن الله . وقيل : إن ألف الاستفهام مضمرة ؛ والمعنى أفمن نفسك ؟ ومثله قوله تعالى : وتلك نعمة تمنها علي والمعنى أوتلك نعمة ؟ وكذا قوله تعالى : فلما رأى القمر بازغا قال هذا ربي أي أهذا ربي ؟ قال أبو خراش الهذلي :\nرموني وقالوا يا خويلد لم ترع فقلت وأنكرت الوجوه هم هم\nأراد \" أهم \" فأضمر ألف الاستفهام وهو كثير وسيأتي . قال الأخفش \" ما \" بمعنى الذي . وقيل : هو شرط . قال النحاس : والصواب قول الأخفش ؛ لأنه نزل في شيء بعينه من الجدب ، وليس هذا من المعاصي في شيء ولو كان منها لكان وما أصبت من سيئة . وروى عبد الوهاب بن مجاهد عن أبيه عن ابن عباس وأبي وابن مسعود \" ما أصابك من حسنة فمن الله وما أصابك من سيئة فمن نفسك وأنا كتبتها عليك \" فهذه قراءة على التفسير ، وقد أثبتها بعض أهل الزيغ من القرآن ، والحديث بذلك عن ابن مسعود وأبي منقطع ؛ لأن مجاهدا لم ير عبد الله ولا أبيا . وعلى قول من قال : الحسنة الفتح والغنيمة يوم بدر ، والسيئة ما أصابهم يوم أحد ؛ أنهم عوقبوا عند خلاف الرماة الذين أمرهم رسول الله صلى الله عليه وسلم أن يحموا ظهره ولا يبرحوا من مكانهم ، فرأوا الهزيمة على قريش والمسلمون يغنمون أموالهم فتركوا مصافهم ، فنظر خالد بن الوليد - وكان مع الكفار يومئذ - ظهر رسول الله صلى الله عليه وسلم قد انكشف من الرماة فأخذ سرية من الخيل ودار حتى صار خلف المسلمين وحمل عليهم ، ولم يكن خلف رسول الله صلى الله عليه وسلم من الرماة إلا صاحب الراية ، حفظ وصية رسول الله صلى الله عليه وسلم فوقف حتى استشهد مكانه ؛ على ما تقدم في \" آل عمران \" بيانه . فأنزل الله تعالى نظير هذه الآية وهو قوله تعالى : أولما أصابتكم مصيبة يعني يوم أحد قد أصبتم مثليها يعني يوم بدر قلتم أنى هذا قل هو من عند أنفسكم . ولا يجوز أن تكون الحسنة هاهنا الطاعة والسيئة المعصية كما قالت القدرية ؛ إذ لو كان كذلك لكان ما أصبت كما قدمنا ، إذ هو بمعنى الفعل عندهم والكسب عندنا ، وإنما تكون الحسنة الطاعة والسيئة المعصية في نحو قوله : من جاء بالحسنة فله عشر أمثالها ومن جاء بالسيئة فلا يجزى إلا مثلها وأما في هذه الآية فهي كما تقدم شرحنا له من الخصب والجدب والرخاء والشدة على نحو ما جاء في آية \" الأعراف \" وهي قوله تعالى : ولقد أخذنا آل فرعون بالسنين ونقص من الثمرات لعلهم يذكرون . وبالسنين بالجدب سنة بعد سنة ؛ حبس المطر عنهم فنقصت ثمارهم وغلت أسعارهم . فإذا جاءتهم الحسنة قالوا لنا هذه وإن تصبهم سيئة يطيروا بموسى ومن معه أي يتشاءمون بهم ويقولون هذا من أجل اتباعنا لك وطاعتنا إياك ؛ فرد الله عليهم بقوله : ألا إنما طائرهم عند الله يعني أن طائر البركة وطائر الشؤم من الخير والشر والنفع والضر من الله تعالى لا صنع فيه لمخلوق ؛ فكذلك قوله تعالى فيما أخبر عنهم أنهم يضيفونه للنبي صلى الله عليه وسلم حيث قال : وإن تصبهم سيئة يقولوا هذه من عندك قل كل من عند الله كما قال : ألا إنما طائرهم عند الله وكما قال تعالى : وما أصابكم يوم التقى الجمعان فبإذن الله أي بقضاء الله وقدره وعلمه ، وآيات الكتاب يشهد بعضها لبعض . قال علماؤنا : ومن كان يؤمن بالله واليوم الآخر فلا يشك في أن كل شيء بقضاء الله وقدره وإرادته ومشيئته ؛ كما قال تعالى : ونبلوكم بالشر والخير فتنة وقال تعالى : وإذا أراد الله بقوم سوءا فلا مرد له وما لهم من دونه من وال .\nمسألة : وقد تجاذب بعض جهال أهل السنة هذه الآية واحتج بها ؛ كما تجاذبها القدرية واحتجوا بها ، ووجه احتجاجهم بها أن القدرية يقولون : إن الحسنة ها هنا الطاعة ، والسيئة المعصية ؛ قالوا : وقد نسب المعصية في قوله تعالى : وما أصابك من سيئة فمن نفسك إلى الإنسان دون الله تعالى ؛ فهذا وجه تعلقهم بها . ووجه تعلق الآخرين منها قوله تعالى : قل كل من عند الله قالوا : فقد أضاف الحسنة والسيئة إلى نفسه دون خلقه . وهذه الآية إنما يتعلق بها الجهال من الفريقين جميعا ؛ لأنهم بنوا ذلك على أن السيئة هي المعصية ، وليست كذلك لما بيناه . والله أعلم . والقدرية إن قالوا ما أصابك من حسنة أي من طاعة فمن الله فليس هذا اعتقادهم ؛ لأن اعتقادهم الذي بنوا عليه مذهبهم أن الحسنة فعل المحسن والسيئة فعل المسيء . وأيضا فلو كان لهم فيها حجة لكان يقول : ما أصبت من حسنة وما أصبت من سيئة ؛ لأنه الفاعل للحسنة والسيئة جميعا ، فلا يضاف إليه إلا بفعله لهما لا بفعل غيره . نص على هذه المقالة الإمام أبو الحسن شبيب بن إبراهيم بن محمد بن حيدرة في كتابه المسمى بحز الغلاصم في إفحام المخاصم .\nقوله تعالى : وأرسلناك للناس رسولا مصدر مؤكد ، ويجوز أن يكون المعنى ذا رسالة وكفى بالله شهيدا نصب على البيان والباء زائدة ، أي كفى الله شهيدا على صدق رسالة نبيه وأنه صادق .\n                                    ",
        "saadi": "مَّآ أَصَابَكَ مِنۡ حَسَنَةٖ فَمِنَ ٱللَّهِۖ وَمَآ أَصَابَكَ مِن سَيِّئَةٖ فَمِن نَّفۡسِكَۚ وَأَرۡسَلۡنَٰكَ لِلنَّاسِ رَسُولٗاۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ٩٧\n                                        \n                                        \n                                        \n                                        { مَا أَصَابَكَ مِنْ حَسَنَةٍ } أي: في الدين والدنيا { فَمِنَ اللَّهِ } هو الذي مَنَّ بها ويسرها بتيسير أسبابها. { وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ } في الدين والدنيا { فَمِنْ نَفْسِكَ } أي: بذنوبك وكسبك، وما يعفو الله عنه أكثر. فالله تعالى قد فتح لعباده أبواب إحسانه وأمرهم بالدخول لبره وفضله، وأخبرهم أن المعاصي مانعة من فضله، فإذا فعلها العبد فلا يلومن إلا نفسه فإنه المانع لنفسه عن وصول فضل الله وبره. ثم أخبر عن عموم رسالة رسوله محمد صلى الله عليه وسلم فقال: { وَأَرْسَلْنَاكَ لِلنَّاسِ رَسُولًا وَكَفَى بِاللَّهِ شَهِيدًا } على أنك رسول الله حقا بما أيدك بنصره والمعجزات الباهرة والبراهين الساطعة، فهي أكبر شهادة على الإطلاق، كما قال تعالى: { قُلْ أَيُّ شَيْءٍ أَكْبَرُ شَهَادَةً قُلِ اللَّهُ شَهِيدٌ بَيْنِي وَبَيْنَكُمْ } فإذا علم أن الله تعالى كامل العلم، تام القدرة عظيم الحكمة، وقد أيد الله رسوله بما أيده، ونصره نصرا عظيما، تيقن بذلك أنه رسول الله، وإلا فلو تقول عليه بعض الأقاويل لأخذ منه باليمين، ثم لقطع منه الوتين.\n                                    "
      },
      "originalText": "مَّآ أَصَابَكَ مِنۡ حَسَنَةٖ فَمِنَ ٱللَّهِۖ وَمَآ أَصَابَكَ مِن سَيِّئَةٖ فَمِن نَّفۡسِكَۚ وَأَرۡسَلۡنَٰكَ لِلنَّاسِ رَسُولٗاۚ وَكَفَىٰ بِٱللَّهِ شَهِيدٗا ٩٧"
    }
  ]
}