{
  "number": 92,
  "ayahsNumber": 5,
  "ayahs": [
    {
      "number": 580,
      "text": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۚ لَيَجْمَعَنَّكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ ۗ وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 87,
      "juz": 5,
      "manzil": 1,
      "page": 92,
      "ruku": 72,
      "hizbQuarter": 36,
      "sajda": false,
      "tafsier": {
        "ibnkther": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۚ لَيَجۡمَعَنَّكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِۗ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ حَدِيثٗا ٧٨\n                                    \n                                    \n                                    وقوله : ( الله لا إله إلا هو ) إخبار بتوحيده وتفرده بالإلهية لجميع المخلوقات ، وتضمن قسما ، لقوله : ( ليجمعنكم إلى يوم القيامة لا ريب فيه ) وهذه اللام موطئة للقسم ، فقوله : ( الله لا إله إلا هو ) خبر وقسم أنه سيجمع الأولين والآخرين في صعيد واحد فيجازي كل عامل بعمله .\nوقوله تعالى : ( ومن أصدق من الله حديثا ) أي : لا أحد أصدق منه في حديثه وخبره ، ووعده ووعيده ، فلا إله إلا هو ، ولا رب سواه .\n                                    ",
        "qortoby": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۚ لَيَجۡمَعَنَّكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِۗ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ حَدِيثٗا ٧٨\n                                    \n                                    \n                                اللَّهُ لَا إِلَهَ إِلَّا هُوَ لَيَجْمَعَنَّكُمْ\nابتداء وخبر .\nواللام في قول \" ليجمعنكم \" لام القسم ; نزلت في الذين شكوا في البعث فأقسم الله تعالى بنفسه .\nوكل لام بعدها نون مشددة فهو لام القسم .\nومعناه في الموت وتحت الأرض\nإِلَى يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ\nوقال بعضهم : \" إلى \" صلة في الكلام , معناه ليجمعنكم يوم القيامة .\nوسميت القيامة قيامة لأن الناس يقومون فيه لرب العالمين جل وعز ; قال الله تعالى : \" ألا يظن أولئك أنهم مبعوثون ليوم عظيم .\nيوم يقوم الناس لرب العالمين \" [ المطففين : 4 - 6 ] .\nوقيل : سمي يوم القيامة لأن الناس يقومون من قبورهم إليها ; قال الله تعالى : \" يوم يخرجون من الأجداث سراعا \" [ المعارج : 43 ] وأصل القيامة الواو .\nوَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا\nنصب على البيان , والمعنى لا أحد أصدق من الله .\nوقرأ حمزة والكسائي \" ومن أزدق \" بالزاي .\nالباقون : بالصاد , وأصله الصاد إلا أن لقرب مخرجها جعل مكانها زاي .\n                                    ",
        "saadi": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۚ لَيَجۡمَعَنَّكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِۗ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ حَدِيثٗا ٧٨\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن انفراده بالوحدانية وأنه لا معبود ولا مألوه إلا هو، لكماله في ذاته وأوصافه ولكونه المنفرد بالخلق والتدبير، والنعم الظاهرة والباطنة. وذلك يستلزم الأمر بعبادته والتقرب إليه بجميع أنواع العبودية. لكونه المستحق لذلك وحده والمجازي للعباد بما قاموا به من عبوديته أو تركوه منها، ولذلك أقسم على وقوع محل الجزاء وهو يوم القيامة، فقال: { لَيَجْمَعَنَّكُمْ } أي: أولكم وآخِركم في مقام واحد. في { يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ } أي: لا شك ولا شبهة بوجه من الوجوه، بالدليل العقلي والدليل السمعي، فالدليل العقلي ما نشاهده من إحياء الأرض بعد موتها، ومن وجود النشأة الأولى التي وقوع الثانية أَوْلى منها بالإمكان، ومن الحكمة التي تجزم بأن الله لم يخلق خلقه عبثًا، يحيون ثم يموتون. وأما الدليل السمعي فهو إخبار أصدق الصادقين بذلك، بل إقسامه عليه ولهذا قال: { وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا } كذلك أمر رسوله صلى الله عليه وسلم أن يقسم عليه في غير موضع من القرآن، كقوله تعالى: { زَعَمَ الَّذِينَ كَفَرُوا أَنْ لَنْ يُبْعَثُوا قُلْ بَلَى وَرَبِّي لَتُبْعَثُنَّ ثُمَّ لَتُنَبَّؤُنَّ بِمَا عَمِلْتُمْ وَذَلِكَ عَلَى اللَّهِ يَسِيرٌ } وفي قوله: { وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا } { وَمَنْ أَصْدَقُ مِنَ اللَّهِ قِيلًا } إخبار بأن حديثه وأخباره وأقواله في أعلى مراتب الصدق، بل أعلاها. فكل ما قيل في العقائد [والعلوم] والأعمال مما يناقض ما أخبر الله به، فهو باطل لمناقضته للخبر الصادق اليقين، فلا يمكن أن يكون حقًّا.\n                                    "
      },
      "originalText": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَۚ لَيَجۡمَعَنَّكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِۗ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ حَدِيثٗا ٧٨"
    },
    {
      "number": 581,
      "text": "۞ فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُمْ بِمَا كَسَبُوا ۚ أَتُرِيدُونَ أَنْ تَهْدُوا مَنْ أَضَلَّ اللَّهُ ۖ وَمَنْ يُضْلِلِ اللَّهُ فَلَنْ تَجِدَ لَهُ سَبِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 88,
      "juz": 5,
      "manzil": 1,
      "page": 92,
      "ruku": 73,
      "hizbQuarter": 37,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَمَا لَكُمۡ فِي ٱلۡمُنَٰفِقِينَ فِئَتَيۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوٓاْۚ أَتُرِيدُونَ أَن تَهۡدُواْ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ٨٨\n                                    \n                                    \n                                    يقول تعالى منكرا على المؤمنين في اختلافهم في المنافقين على قولين ، واختلف في سبب ذلك ، فقال الإمام أحمد :\nحدثنا بهز ، حدثنا شعبة ، قال عدي بن ثابت : أخبرني عبد الله بن يزيد ، عن زيد بن ثابت : أن رسول الله صلى الله عليه وسلم خرج إلى أحد ، فرجع ناس خرجوا معه ، فكان أصحاب رسول الله صلى الله عليه وسلم فيهم فرقتين : فرقة تقول : نقتلهم . وفرقة تقول : لا فأنزل الله : ( فما لكم في المنافقين فئتين ) فقال رسول الله صلى الله عليه وسلم : \" إنها طيبة ، وإنها تنفي الخبث كما تنفي النار خبث الفضة \" .\nأخرجاه في الصحيحين ، من حديث شعبة .\nوقد ذكر محمد بن إسحاق بن يسار في وقعة أحد أن عبد الله بن أبي بن سلول رجع يومئذ بثلث الجيش ، رجع بثلاثمائة وبقي النبي صلى الله عليه وسلم في سبعمائة .\nوقال العوفي ، عن ابن عباس : نزلت في قوم كانوا بمكة ، قد تكلموا بالإسلام ، كانوا يظاهرون المشركين ، فخرجوا من مكة يطلبون حاجة لهم ، فقالوا : إن لقينا أصحاب محمد فليس علينا منهم بأس ، وأن المؤمنين لما أخبروا أنهم قد خرجوا من مكة ، قالت فئة من المؤمنين : اركبوا إلى الجبناء فاقتلوهم ، فإنهم يظاهرون عليكم عدوكم . وقالت فئة أخرى من المؤمنين : سبحان الله ! أو كما قالوا : أتقتلون قوما قد تكلموا بمثل ما تكلمتم به ؟ أمن أجل أنهم لم يهاجروا ولم يتركوا ديارهم تستحل دماؤهم وأموالهم . فكانوا كذلك فئتين ، والرسول عندهم لا ينهى واحدا من الفريقين عن شيء فأنزل الله : ( فما لكم في المنافقين فئتين )\nرواه ابن أبي حاتم ، وقد روي عن أبي سلمة بن عبد الرحمن وعكرمة ومجاهد والضحاك وغيرهم قريب من هذا .\nوقال زيد بن أسلم ، عن ابن لسعد بن معاذ : أنها نزلت في تقاول الأوس والخزرج في شأن عبد الله بن أبي ، حين استعذر منه رسول الله صلى الله عليه وسلم على المنبر في قضية الإفك .\nوهذا غريب ، وقيل غير ذلك .\nوقوله : ( والله أركسهم بما كسبوا ) أي : ردهم وأوقعهم في الخطأ .\nقال ابن عباس : ( أركسهم ) أي : أوقعهم . وقال قتادة : أهلكهم . وقال السدي : أضلهم .\nوقوله : ( بما كسبوا ) أي : بسبب عصيانهم ومخالفتهم الرسول واتباعهم الباطل .\n( أتريدون أن تهدوا من أضل الله ومن يضلل الله فلن تجد له سبيلا ) أي : لا طريق له إلى الهدى ولا مخلص له إليه .\n                                    ",
        "qortoby": "فَمَا لَكُمۡ فِي ٱلۡمُنَٰفِقِينَ فِئَتَيۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوٓاْۚ أَتُرِيدُونَ أَن تَهۡدُواْ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ٨٨\n                                    \n                                    \n                                    فما لكم في المنافقين فئتين والله أركسهم بما كسبوا أتريدون أن تهدوا من أضل الله ومن يضلل الله فلن تجد له سبيلا\nقوله تعالى : فما لكم في المنافقين فئتين فئتين أي فرقتين مختلفتين . روى مسلم عن زيد بن ثابت أن النبي صلى الله عليه وسلم خرج إلى أحد فرجع ناس ممن كان معه ، فكان أصحاب النبي صلى الله عليه وسلم فيهم فرقتين ؛ فقال بعضهم : نقتلهم . وقال بعضهم : لا ؛ فنزلت فما لكم في المنافقين فئتين . وأخرجه الترمذي فزاد : وقال : ( إنها طيبة ) وقال : ( إنها تنفي الخبيث كما تنفي النار خبث الحديد ) قال : حديث حسن صحيح . وقال البخاري : ( إنها طيبة تنفي الخبث كما تنفي النار خبث الفضة ) . والمعني بالمنافقين هنا عبد الله بن أبي وأصحابه الذين خذلوا رسول الله صلى الله عليه وسلم يوم أحد ورجعوا بعسكرهم بعد أن خرجوا ؛ كما تقدم في \" آل عمران \" . وقال ابن عباس : هم قوم بمكة آمنوا وتركوا الهجرة ، قال الضحاك : وقالوا إن ظهر محمد - صلى الله عليه وسلم - فقد عرفنا ، وإن ظهر قومنا فهو أحب إلينا . فصار المسلمون فيهم فئتين قوم يتولونهم وقوم يتبرءون منهم ؛ فقال الله عز وجل : فما لكم في المنافقين فئتين . وذكر أبو سلمة بن عبد الرحمن عن أبيه أنها نزلت في قوم جاءوا إلى المدينة وأظهروا الإسلام ؛ فأصابهم وباء المدينة وحماها ؛ فأركسوا فخرجوا من المدينة ، فاستقبلهم نفر من أصحاب النبي صلى الله عليه وسلم فقالوا : ما لكم رجعتم ؟ فقالوا : أصابنا وباء المدينة فاجتويناها ؛ فقالوا : ما لكم في رسول الله صلى الله عليه وسلم أسوة ؟ فقال بعضهم : نافقوا . وقال بعضهم : لم ينافقوا ، هم مسلمون ؛ فأنزل الله عز وجل : فما لكم في المنافقين فئتين والله أركسهم بما كسبوا الآية . حتى جاءوا المدينة يزعمون أنهم مهاجرون ، ثم ارتدوا بعد ذلك ، فاستأذنوا رسول الله صلى الله عليه وسلم إلى مكة ليأتوا ببضائع لهم يتجرون فيها ، فاختلف فيهم المؤمنون فقائل يقول : هم منافقون ، وقائل يقول : هم مؤمنون ؛ فبين الله تعالى نفاقهم وأنزل هذه الآية وأمر بقتلهم .\nقلت : وهذان القولان يعضدهما سياق آخر الآية من قوله تعالى : حتى يهاجروا ، والأول أصح نقلا ، وهو اختيار البخاري ومسلم والترمذي . وفئتين نصب على الحال ؛ كما يقال : ما لك قائما ؟ عن الأخفش . وقال الكوفيون : هو خبر ( ما لكم ) كخبر كان وظننت ، وأجازوا إدخال الألف واللام فيه وحكى الفراء : \" أركسهم ، وركسهم \" أي ردهم إلى الكفر ونكسهم ؛ وقاله النضر بن شميل والكسائي : والركس والنكس قلب الشيء على رأسه ، أو رد أوله على آخره ، والمركوس المنكوس . وفي قراءة عبد الله وأبي رضي الله عنهما \" والله ركسهم \" . وقال ابن رواحة :\nأركسوا في فتنة مظلمة كسواد الليل يتلوها فتن\nأي نكسوا . وارتكس فلان في أمر كان نجا منه . والركوسية قوم بين النصارى والصابئين . والراكس الثور وسط البيدر والثيران حواليه حين الدياس . أتريدون أن تهدوا من أضل الله أي ترشدوه إلى الثواب بأن يحكم لهم بحكم المؤمنين . تجد له سبيلا أي طريقا إلى الهدى والرشد وطلب الحجة . وفي هذا رد على القدرية وغيرهم القائلين بخلق هداهم وقد تقدم .\n                                    ",
        "saadi": "فَمَا لَكُمۡ فِي ٱلۡمُنَٰفِقِينَ فِئَتَيۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوٓاْۚ أَتُرِيدُونَ أَن تَهۡدُواْ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ٨٨\n                                        \n                                        \n                                        \n                                        المراد بالمنافقين المذكورين في هذه الآيات: المنافقون المظهرون إسلامهم، ولم يهاجروا مع كفرهم، وكان قد وقع بين الصحابة رضوان الله عليهم فيهم اشتباه، فبعضهم تحرج عن قتالهم، وقطع موالاتهم بسبب ما أظهروه من الإيمان، وبعضهم علم أحوالهم بقرائن أفعالهم فحكم بكفرهم.\n                                    "
      },
      "originalText": "۞ فَمَا لَكُمۡ فِي ٱلۡمُنَٰفِقِينَ فِئَتَيۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوٓاْۚ أَتُرِيدُونَ أَن تَهۡدُواْ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ٨٨"
    },
    {
      "number": 582,
      "text": "وَدُّوا لَوْ تَكْفُرُونَ كَمَا كَفَرُوا فَتَكُونُونَ سَوَاءً ۖ فَلَا تَتَّخِذُوا مِنْهُمْ أَوْلِيَاءَ حَتَّىٰ يُهَاجِرُوا فِي سَبِيلِ اللَّهِ ۚ فَإِنْ تَوَلَّوْا فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ ۖ وَلَا تَتَّخِذُوا مِنْهُمْ وَلِيًّا وَلَا نَصِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 89,
      "juz": 5,
      "manzil": 1,
      "page": 92,
      "ruku": 73,
      "hizbQuarter": 37,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَدُّواْ لَوۡ تَكۡفُرُونَ كَمَا كَفَرُواْ فَتَكُونُونَ سَوَآءٗۖ فَلَا تَتَّخِذُواْ مِنۡهُمۡ أَوۡلِيَآءَ حَتَّىٰ يُهَاجِرُواْ فِي سَبِيلِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَيۡثُ وَجَدتُّمُوهُمۡۖ وَلَا تَتَّخِذُواْ مِنۡهُمۡ وَلِيّٗا وَلَا نَصِيرًا ٩٨\n                                    \n                                    \n                                    ثم قال : ( ودوا لو تكفرون كما كفروا فتكونون سواء ) أي : هم يودون لكم الضلالة لتستووا أنتم وإياهم فيها ، وما ذاك إلا لشدة عداوتهم وبغضهم لكم ; ولهذا قال : ( فلا تتخذوا منهم أولياء حتى يهاجروا في سبيل الله فإن تولوا ) أي : تركوا الهجرة ، قاله العوفي عن ابن عباس . وقال السدي : أظهروا كفرهم ( فخذوهم واقتلوهم حيث وجدتموهم ولا تتخذوا منهم وليا ولا نصيرا ) أي : لا توالوهم ولا تستنصروا بهم على الأعداء ما داموا كذلك .\n                                    ",
        "qortoby": "وَدُّواْ لَوۡ تَكۡفُرُونَ كَمَا كَفَرُواْ فَتَكُونُونَ سَوَآءٗۖ فَلَا تَتَّخِذُواْ مِنۡهُمۡ أَوۡلِيَآءَ حَتَّىٰ يُهَاجِرُواْ فِي سَبِيلِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَيۡثُ وَجَدتُّمُوهُمۡۖ وَلَا تَتَّخِذُواْ مِنۡهُمۡ وَلِيّٗا وَلَا نَصِيرًا ٩٨\n                                    \n                                    \n                                    ودوا لو تكفرون كما كفروا فتكونون سواء فلا تتخذوا منهم أولياء حتى يهاجروا في سبيل الله فإن تولوا فخذوهم واقتلوهم حيث وجدتموهم ولا تتخذوا منهم وليا ولا نصيرا\nالأولى : ودوا لو تكفرون أي تمنوا أن تكونوا كهم في الكفر والنفاق شرع سواء ؛ فأمر الله تعالى بالبراءة منهم فقال : فلا تتخذوا منهم أولياء حتى يهاجروا ؛ كما قال تعالى : ما لكم من ولايتهم من شيء حتى يهاجروا والهجرة أنواع : منها الهجرة إلى المدينة لنصرة النبي صلى الله عليه وسلم ، وكانت هذه واجبة أول الإسلام حتى قال : لا هجرة بعد الفتح . وكذلك هجرة المنافقين مع النبي صلى الله عليه وسلم في الغزوات ، وهجرة من أسلم في دار الحرب فإنها واجبة . وهجرة المسلم ما حرم الله عليه ؛ كما قال صلى الله عليه وسلم : والمهاجر من هجر ما حرم الله عليه . وهاتان الهجرتان ثابتتان الآن . وهجرة أهل المعاصي حتى يرجعوا تأديبا لهم فلا يكلمون ولا يخالطون حتى يتوبوا ؛ كما فعل النبي صلى الله عليه وسلم مع كعب وصاحبيه .فإن تولوا فخذوهم واقتلوهم يقول : إن أعرضوا عن التوحيد والهجرة فأسروهم واقتلوهم . حيث وجدتموهم عام في الأماكن من حل وحرم . والله أعلم . ثم استثنى وهي\n                                    ",
        "saadi": "وَدُّواْ لَوۡ تَكۡفُرُونَ كَمَا كَفَرُواْ فَتَكُونُونَ سَوَآءٗۖ فَلَا تَتَّخِذُواْ مِنۡهُمۡ أَوۡلِيَآءَ حَتَّىٰ يُهَاجِرُواْ فِي سَبِيلِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَيۡثُ وَجَدتُّمُوهُمۡۖ وَلَا تَتَّخِذُواْ مِنۡهُمۡ وَلِيّٗا وَلَا نَصِيرًا ٩٨\n                                        \n                                        \n                                        \n                                        فأخبرهم الله تعالى أنه لا ينبغي لكم أن تشتبهوا فيهم ولا تشكوا، بل أمرهم واضح غير مشكل، إنهم منافقون قد تكرر كفرهم، وودوا مع ذلك كفركم وأن تكونوا مثلهم. فإذا تحققتم ذلك منهم { فَلَا تَتَّخِذُوا مِنْهُمْ أَوْلِيَاءَ } وهذا يستلزم عدم محبتهم لأن الولاية فرع المحبة. ويستلزم أيضا بغضهم وعداوتهم لأن النهي عن الشيء أمر بضده، وهذا الأمر موقت بهجرتهم فإذا هاجروا جرى عليهم ما جرى على المسلمين، كما كان النبي صلى الله عليه وسلم يجري أحكام الإسلام لكل مَنْ كان معه وهاجر إليه، وسواء كان مؤمنا حقيقة أو ظاهر الإيمان. وأنهم إن لم يهاجروا وتولوا عنها { فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ } أي: في أي وقت وأي محل كان، وهذا من جملة الأدلة الدالة على نسخ القتال في الأشهر الحرم، كما هو قول جمهور العلماء، والمنازعون يقولون: هذه نصوص مطلقة، محمولة على تقييد التحريم في الأشهر الحرم.\n                                    "
      },
      "originalText": "وَدُّواْ لَوۡ تَكۡفُرُونَ كَمَا كَفَرُواْ فَتَكُونُونَ سَوَآءٗۖ فَلَا تَتَّخِذُواْ مِنۡهُمۡ أَوۡلِيَآءَ حَتَّىٰ يُهَاجِرُواْ فِي سَبِيلِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَيۡثُ وَجَدتُّمُوهُمۡۖ وَلَا تَتَّخِذُواْ مِنۡهُمۡ وَلِيّٗا وَلَا نَصِيرًا ٩٨"
    },
    {
      "number": 583,
      "text": "إِلَّا الَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ أَوْ جَاءُوكُمْ حَصِرَتْ صُدُورُهُمْ أَنْ يُقَاتِلُوكُمْ أَوْ يُقَاتِلُوا قَوْمَهُمْ ۚ وَلَوْ شَاءَ اللَّهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَاتَلُوكُمْ ۚ فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ فَمَا جَعَلَ اللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 90,
      "juz": 5,
      "manzil": 1,
      "page": 92,
      "ruku": 73,
      "hizbQuarter": 37,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِلَّا ٱلَّذِينَ يَصِلُونَ إِلَىٰ قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٌ أَوۡ جَآءُوكُمۡ حَصِرَتۡ صُدُورُهُمۡ أَن يُقَٰتِلُوكُمۡ أَوۡ يُقَٰتِلُواْ قَوۡمَهُمۡۚ وَلَوۡ شَآءَ ٱللَّهُ لَسَلَّطَهُمۡ عَلَيۡكُمۡ فَلَقَٰتَلُوكُمۡۚ فَإِنِ ٱعۡتَزَلُوكُمۡ فَلَمۡ يُقَٰتِلُوكُمۡ وَأَلۡقَوۡاْ إِلَيۡكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمۡ عَلَيۡهِمۡ سَبِيلٗا ٠٩\n                                    \n                                    \n                                    ثم استثنى الله ، سبحانه من هؤلاء فقال : ( إلا الذين يصلون إلى قوم بينكم وبينهم ميثاق ) أي : إلا الذين لجئوا وتحيزوا إلى قوم بينكم وبينهم مهادنة أو عقد ذمة ، فاجعلوا حكمهم كحكمهم . وهذا قول السدي ، وابن زيد ، وابن جرير .\nوقد روى ابن أبي حاتم : حدثنا أبي حدثنا أبو سلمة حدثنا حماد بن سلمة عن علي بن زيد بن جدعان ، عن الحسن : أن سراقة بن مالك المدلجي حدثهم قال : لما ظهر - يعني صلى الله عليه وسلم - على أهل بدر وأحد ، وأسلم من حولهم قال سراقة : بلغني أنه يريد أن يبعث خالد بن الوليد إلى قومي - بني مدلج - فأتيته فقلت : أنشدك النعمة . فقالوا : صه فقال النبي صلى الله عليه وسلم : \" دعوه ، ما تريد ؟ \" . قال : بلغني أنك تريد أن تبعث إلى قومي ، وأنا أريد أن توادعهم ، فإن أسلم قومك أسلموا ودخلوا في الإسلام ، وإن لم يسلموا لم تخشن قلوب قومك عليهم . فأخذ رسول الله صلى الله عليه وسلم بيد خالد بن الوليد فقال : \" اذهب معه فافعل ما يريد \" . فصالحهم خالد على ألا يعينوا على رسول الله صلى الله عليه وسلم وإن أسلمت قريش أسلموا معهم ، [ ومن وصل إليهم من الناس كانوا على مثل عهدهم ] فأنزل الله : ( ودوا لو تكفرون كما كفروا فتكونون سواء فلا تتخذوا منهم أولياء )\nورواه ابن مردويه من طريق حماد بن سلمة ، وقال فأنزل الله : ( إلا الذين يصلون إلى قوم بينكم وبينهم ميثاق ) فكان وصل إليهم كانوا معهم على عهدهم وهذا أنسب لسياق الكلام .\nوفي صحيح البخاري في قصة صلح الحديبية فكان من أحب أن يدخل في صلح قريش وعهدهم ، ومن أحب أن يدخل في صلح محمد وأصحابه وعهدهم .\nوقد روي عن ابن عباس أنه قال : نسخها قوله : ( فإذا انسلخ الأشهر الحرم فاقتلوا المشركين [ حيث وجدتموهم ] ) [ التوبة : 5 ] .\nوقوله : ( أو جاءوكم حصرت صدورهم [ أن يقاتلوكم أو يقاتلوا قومهم ] ) الآية ، هؤلاء قوم آخرون من المستثنين عن الأمر بقتالهم ، وهم الذين يجيئون إلى المصاف وهم حصرة صدورهم أي : ضيقة صدورهم مبغضين أن يقاتلوكم ، ولا يهون عليهم أيضا أن يقاتلوا قومهم معكم ، بل هم لا لكم ولا عليكم . ( ولو شاء الله لسلطهم عليكم فلقاتلوكم ) أي : من لطفه بكم أن كفهم عنكم ( فإن اعتزلوكم فلم يقاتلوكم وألقوا إليكم السلم ) أي : المسالمة ( فما جعل الله لكم عليهم سبيلا ) أي : فليس لكم أن تقتلوهم ، ما دامت حالهم كذلك ، وهؤلاء كالجماعة الذين خرجوا يوم بدر من بني هاشم مع المشركين ، فحضروا القتال وهم كارهون ، كالعباس ونحوه ، ولهذا نهى النبي صلى الله عليه وسلم يومئذ عن قتل العباس وأمر بأسره .\n                                    ",
        "qortoby": "إِلَّا ٱلَّذِينَ يَصِلُونَ إِلَىٰ قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٌ أَوۡ جَآءُوكُمۡ حَصِرَتۡ صُدُورُهُمۡ أَن يُقَٰتِلُوكُمۡ أَوۡ يُقَٰتِلُواْ قَوۡمَهُمۡۚ وَلَوۡ شَآءَ ٱللَّهُ لَسَلَّطَهُمۡ عَلَيۡكُمۡ فَلَقَٰتَلُوكُمۡۚ فَإِنِ ٱعۡتَزَلُوكُمۡ فَلَمۡ يُقَٰتِلُوكُمۡ وَأَلۡقَوۡاْ إِلَيۡكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمۡ عَلَيۡهِمۡ سَبِيلٗا ٠٩\n                                    \n                                    \n                                    فقال إلا الذين يصلون أي يتصلون بهم ويدخلون فيما بينهم من الجوار والحلف ؛ المعنى : فلا تقتلوا قوما بينهم وبين من بينكم وبينهم عهد فإنهم على عهدهم ثم انتسخت العهود فانتسخ هذا . هذا قول مجاهد وابن زيد وغيرهم ، وهو أصح ما قيل في معنى الآية . قال أبو عبيد : يصلون ينتسبون ؛ ومنه قول الأعشى :\nإذا اتصلت قالت لبكر بن وائل وبكر سبتها والأنوف رواغم\nيريد إذا انتسبت . قال المهدوي : وأنكره العلماء ؛ لأن النسب لا يمنع من قتال الكفار وقتلهم . وقال النحاس : وهذا غلط عظيم ؛ لأنه يذهب إلى أن الله تعالى حظر أن يقاتل أحد بينه وبين المسلمين نسب ، والمشركون قد كان بينهم وبين السابقين الأولين أنساب ، وأشد من هذا الجهل بأنه كان ثم نسخ ؛ لأن أهل التأويل مجمعون على أن الناسخ له \" براءة \" وإنما نزلت \" براءة \" بعد الفتح وبعد أن انقطعت الحروب . وقال معناه الطبري .\nقلت : حمل بعض العلماء معنى ينتسبون على الأمان ؛ أي إن المنتسب إلى أهل الأمان آمن إذا أمن الكل منهم ، لا على معنى النسب الذي هو بمعنى القرابة . واختلف في هؤلاء الذين كان بينهم وبين النبي صلى الله عليه وسلم ميثاق ؛ فقيل : بنو مدلج . عن الحسن : كان بينهم وبين قريش عقد ، وكان بين قريش وبين رسول الله صلى الله عليه وسلم عهد . وقال عكرمة : نزلت في هلال بن عويمر وسراقة بن جعشم وخزيمة بن عامر بن عبد مناف كان بينهم وبين النبي صلى الله عليه وسلم عهد . وقيل : خزاعة . وقال الضحاك عن ابن عباس : أنه أراد بالقوم الذين بينكم وبينهم ميثاق بني بكر بن زيد بن مناة ، كانوا في الصلح والهدنة .\nالثالثة : في هذه الآية دليل على إثبات الموادعة بين أهل الحرب وأهل الإسلام إذا كان في الموادعة مصلحة للمسلمين ، على ما يأتي بيانه في \" الأنفال \" \" وبراءة \" إن شاء الله تعالى .\nالرابعة : أو جاءوكم حصرت صدورهم أي ضاقت . وقال لبيد :\nأسهلت وانتصبت كجذع منيفة جرداء يحصر دونها جرامها\nأي تضيق صدورهم من طول هذه النخلة ؛ ومنه الحصر في القول وهو ضيق الكلام على المتكلم . والحصر الكتوم للسر ؛ قال جرير :\nولقد تسقطني الوشاة فصادفوا حصرا بسرك يا أميم ضنينا\nومعنى \" حصرت \" \" قد حصرت \" فأضمرت \" قد \" ، قال الفراء : وهو حال من المضمر المرفوع في جاءوكم كما تقول : جاء فلان ذهب عقله ، أي قد ذهب عقله . وقيل : هو خبر بعد خبر قاله الزجاج . أي جاءوكم ثم أخبر فقال : حصرت صدورهم فعلى هذا يكون حصرت بدلا من جاءوكم كما قيل : حصرت في موضع خفض على النعت لقوم . وفي حرف أبي \" إلا الذين يصلون إلى قوم بينكم وبينهم ميثاق حصرت صدورهم \" ليس فيه أو جاءوكم . وقيل : تقديره أو جاءوكم رجالا أو قوما حصرت صدورهم ؛ فهي صفة موصوف منصوب على الحال . وقرأ الحسن \" أو جاءوكم حصرة صدورهم \" نص على الحال ، ويجوز رفعه على الابتداء والخبر . وحكى \" أو جاءوكم حصرات صدورهم \" ، ويجوز الرفع . وقال محمد بن يزيد : حصرت صدورهم هو دعاء عليهم ؛ كما تقول : لعن الله الكافر ؛ وقاله المبرد . وضعفه بعض المفسرين وقال : هذا يقتضي ألا يقاتلوا قومهم ؛ وذلك فاسد ؛ لأنهم كفار وقومهم كفار . وأجيب بأن معناه صحيح ، فيكون عدم القتال في حق المسلمين تعجيزا لهم ، وفي حق قومهم تحقيرا لهم . وقيل : أو بمعنى الواو ؛ كأنه يقول : إلى قوم بينكم وبينهم ميثاق وجاءوكم ضيقة صدورهم عن قتالكم والقتال معكم فكرهوا قتال الفريقين . ويحتمل أن يكونوا معاهدين على ذلك فهو نوع من العهد ، أو قالوا نسلم ولا نقاتل ؛ فيحتمل أن يقبل ذلك منهم في أول الإسلام حتى يفتح الله قلوبهم للتقوى ويشرحها للإسلام . والأول أظهر . والله أعلم . أو يقاتلوا في موضع نصب ؛ أي عن أن يقاتلوكم .\nالخامسة : قوله تعالى : ولو شاء الله لسلطهم عليكم فلقاتلوكم تسليط الله تعالى المشركين على المؤمنين هو بأن يقدرهم على ذلك ويقويهم إما عقوبة ونقمة عند إذاعة المنكر وظهور المعاصي ، وإما ابتلاء واختبارا كما قال تعالى : ولنبلونكم حتى نعلم المجاهدين منكم والصابرين ونبلو أخباركم ، وإما تمحيصا للذنوب كما قال تعالى : وليمحص الله الذين آمنوا ولله أن يفعل ما يشاء ويسلط من يشاء على من يشاء إذا شاء . ووجه النظم والاتصال بما قبل أي اقتلوا المنافقين الذين اختلفتم فيهم إلا أن يهاجروا ، وإلا أن يتصلوا بمن بينكم وبينهم ميثاق فيدخلون فيما دخلوا فيه فلهم حكمهم ، وإلا الذين جاءوكم قد حصرت صدورهم عن أن يقاتلوكم أو يقاتلوا قومهم فدخلوا فيكم فلا تقتلوهم .\n                                    ",
        "saadi": "إِلَّا ٱلَّذِينَ يَصِلُونَ إِلَىٰ قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٌ أَوۡ جَآءُوكُمۡ حَصِرَتۡ صُدُورُهُمۡ أَن يُقَٰتِلُوكُمۡ أَوۡ يُقَٰتِلُواْ قَوۡمَهُمۡۚ وَلَوۡ شَآءَ ٱللَّهُ لَسَلَّطَهُمۡ عَلَيۡكُمۡ فَلَقَٰتَلُوكُمۡۚ فَإِنِ ٱعۡتَزَلُوكُمۡ فَلَمۡ يُقَٰتِلُوكُمۡ وَأَلۡقَوۡاْ إِلَيۡكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمۡ عَلَيۡهِمۡ سَبِيلٗا ٠٩\n                                        \n                                        \n                                        \n                                        ثم إن الله استثنى من قتال هؤلاء المنافقين ثلاث فِرَق: فرقتين أمر بتركهم وحتَّم [على] ذلك، إحداهما من يصل إلى قوم بينهم وبين المسلمين عهد وميثاق بترك القتال فينضم إليهم، فيكون له حكمهم في حقن الدم والمال. والفرقة الثانية قوم { حَصِرَتْ صُدُورُهُمْ أَنْ يُقَاتِلُوكُمْ أَوْ يُقَاتِلُوا قَوْمَهُمْ } أي: بقوا، لا تسمح أنفسهم بقتالكم، ولا بقتال قومهم، وأحبوا ترك قتال الفريقين، فهؤلاء أيضا أمر بتركهم، وذكر الحكمة في ذلك في قوله: { وَلَوْ شَاءَ اللَّهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَاتَلُوكُمْ } فإن الأمور الممكنة ثلاثة أقسام: إما أن يكونوا معكم ويقاتلوا أعداءكم، وهذا متعذر من هؤلاء، فدار الأمر بين قتالكم مع قومهم وبين ترك قتال الفريقين، وهو أهون الأمرين عليكم، والله قادر على تسليطهم عليكم، فاقبلوا العافية، واحمدوا ربكم الذي كف أيديهم عنكم مع التمكن من ذلك. فـهؤلاء { إن اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ فَمَا جَعَلَ اللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا } الفرقة الثالثة: قوم يريدون مصلحة أنفسهم بقطع النظر عن احترامكم، وهم الذين قال الله فيهم:\n                                    "
      },
      "originalText": "إِلَّا ٱلَّذِينَ يَصِلُونَ إِلَىٰ قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٌ أَوۡ جَآءُوكُمۡ حَصِرَتۡ صُدُورُهُمۡ أَن يُقَٰتِلُوكُمۡ أَوۡ يُقَٰتِلُواْ قَوۡمَهُمۡۚ وَلَوۡ شَآءَ ٱللَّهُ لَسَلَّطَهُمۡ عَلَيۡكُمۡ فَلَقَٰتَلُوكُمۡۚ فَإِنِ ٱعۡتَزَلُوكُمۡ فَلَمۡ يُقَٰتِلُوكُمۡ وَأَلۡقَوۡاْ إِلَيۡكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمۡ عَلَيۡهِمۡ سَبِيلٗا ٠٩"
    },
    {
      "number": 584,
      "text": "سَتَجِدُونَ آخَرِينَ يُرِيدُونَ أَنْ يَأْمَنُوكُمْ وَيَأْمَنُوا قَوْمَهُمْ كُلَّ مَا رُدُّوا إِلَى الْفِتْنَةِ أُرْكِسُوا فِيهَا ۚ فَإِنْ لَمْ يَعْتَزِلُوكُمْ وَيُلْقُوا إِلَيْكُمُ السَّلَمَ وَيَكُفُّوا أَيْدِيَهُمْ فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ۚ وَأُولَٰئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَانًا مُبِينًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 91,
      "juz": 5,
      "manzil": 1,
      "page": 92,
      "ruku": 73,
      "hizbQuarter": 37,
      "sajda": false,
      "tafsier": {
        "ibnkther": "سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأۡمَنُوكُمۡ وَيَأۡمَنُواْ قَوۡمَهُمۡ كُلَّ مَا رُدُّوٓاْ إِلَى ٱلۡفِتۡنَةِ أُرۡكِسُواْ فِيهَاۚ فَإِن لَّمۡ يَعۡتَزِلُوكُمۡ وَيُلۡقُوٓاْ إِلَيۡكُمُ ٱلسَّلَمَ وَيَكُفُّوٓاْ أَيۡدِيَهُمۡ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَيۡثُ ثَقِفۡتُمُوهُمۡۚ وَأُوْلَٰٓئِكُمۡ جَعَلۡنَا لَكُمۡ عَلَيۡهِمۡ سُلۡطَٰنٗا مُّبِينٗا ١٩\n                                    \n                                    \n                                    وقوله : ( ستجدون آخرين يريدون أن يأمنوكم ويأمنوا قومهم [ كلما ردوا إلى الفتنة أركسوا فيها ] ) الآية ، هؤلاء في الصورة الظاهرة كمن تقدمهم ، ولكن نية هؤلاء غير نية أولئك ، فإن هؤلاء منافقون يظهرون للنبي صلى الله عليه وسلم ولأصحابه الإسلام ; ليأمنوا بذلك عندهم على دمائهم وأموالهم وذراريهم ويصانعون الكفار في الباطن ، فيعبدون معهم ما يعبدون ، ليأمنوا بذلك عندهم ، وهم في الباطن مع أولئك ، كما قال تعالى : ( وإذا خلوا إلى شياطينهم قالوا إنا معكم [ إنما نحن مستهزئون ] ) [ البقرة : 14 ] وقال هاهنا : ( كلما ردوا إلى الفتنة أركسوا فيها ) أي : انهمكوا فيها .\nوقال السدي : الفتنة هاهنا : الشرك . وحكى ابن جرير ، عن مجاهد : أنها نزلت في قوم من أهل مكة ، كانوا يأتون النبي صلى الله عليه وسلم فيسلمون رياء ، ثم يرجعون إلى قريش فيرتكسون في الأوثان ، يبتغون بذلك أن يأمنوا هاهنا وهاهنا ، فأمر بقتالهم إن لم يعتزلوا ويصلحوا ; ولهذا قال تعالى : ( فإن لم يعتزلوكم ويلقوا إليكم السلم ويكفوا أيديهم ) أي : عن القتال ( فخذوهم واقتلوهم حيث ثقفتموهم ) أي : أين لقيتموهم ( وأولئكم جعلنا لكم عليهم سلطانا مبينا ) أي : بينا واضحا .\n                                    ",
        "qortoby": "سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأۡمَنُوكُمۡ وَيَأۡمَنُواْ قَوۡمَهُمۡ كُلَّ مَا رُدُّوٓاْ إِلَى ٱلۡفِتۡنَةِ أُرۡكِسُواْ فِيهَاۚ فَإِن لَّمۡ يَعۡتَزِلُوكُمۡ وَيُلۡقُوٓاْ إِلَيۡكُمُ ٱلسَّلَمَ وَيَكُفُّوٓاْ أَيۡدِيَهُمۡ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَيۡثُ ثَقِفۡتُمُوهُمۡۚ وَأُوْلَٰٓئِكُمۡ جَعَلۡنَا لَكُمۡ عَلَيۡهِمۡ سُلۡطَٰنٗا مُّبِينٗا ١٩\n                                    \n                                    \n                                    قوله : ستجدون آخرين يريدون أن يأمنوكم ويأمنوا قومهم كلما ردوا إلى الفتنة أركسوا فيها فإن لم يعتزلوكم ويلقوا إليكم السلم ويكفوا أيديهم فخذوهم واقتلوهم حيث ثقفتموهم وأولئكم جعلنا لكم عليهم سلطانا مبينا\nقوله تعالى : ستجدون آخرين يريدون أن يأمنوكم ويأمنوا قومهم معناها معنى الآية الأولى . قال قتادة : نزلت في قوم من تهامة طلبوا الأمان من النبي صلى الله عليه وسلم ليأمنوا عنده وعند قومهم .\nمجاهد : هي في قوم من أهل مكة . وقال السدي : نزلت في نعيم بن مسعود كان يأمن المسلمين والمشركين . وقال الحسن : هذا في قوم من المنافقين . وقيل : نزلت في أسد وغطفان قدموا المدينة فأسلموا ثم رجعوا إلى ديارهم فأظهروا الكفر .\nقوله تعالى : كلما ردوا إلى الفتنة أركسوا فيها قرأ يحيى بن وثاب والأعمش \" ردوا \" بكسر الراء ؛ لأن الأصل \" رددوا \" فأدغم وقلبت الكسرة على الراء . إلى الفتنة أي الكفر أركسوا فيها . وقيل : أي ستجدون من يظهر لكم الصلح ليأمنوكم ، وإذا سنحت لهم فتنة كان مع أهلها عليكم . ومعنى أركسوا فيها أي انتكسوا عن عهدهم الذين عاهدوا . وقيل : أي إذا دعوا إلى الشرك رجعوا وعادوا إليه .\n                                    ",
        "saadi": "سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأۡمَنُوكُمۡ وَيَأۡمَنُواْ قَوۡمَهُمۡ كُلَّ مَا رُدُّوٓاْ إِلَى ٱلۡفِتۡنَةِ أُرۡكِسُواْ فِيهَاۚ فَإِن لَّمۡ يَعۡتَزِلُوكُمۡ وَيُلۡقُوٓاْ إِلَيۡكُمُ ٱلسَّلَمَ وَيَكُفُّوٓاْ أَيۡدِيَهُمۡ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَيۡثُ ثَقِفۡتُمُوهُمۡۚ وَأُوْلَٰٓئِكُمۡ جَعَلۡنَا لَكُمۡ عَلَيۡهِمۡ سُلۡطَٰنٗا مُّبِينٗا ١٩\n                                        \n                                        \n                                        \n                                        { سَتَجِدُونَ آخَرِينَ } أي: من هؤلاء المنافقين. { يُرِيدُونَ أَنْ يَأْمَنُوكُمْ } أي: خوفا منكم { وَيَأْمَنُوا قَوْمَهُمْ كُلَّمَا رُدُّوا إِلَى الْفِتْنَةِ أُرْكِسُوا فِيهَا } أي: لا يزالون مقيمين على كفرهم ونفاقهم، وكلما عرض لهم عارض من عوارض الفتن أعماهم ونكسهم على رءوسهم، وازداد كفرهم ونفاقهم، وهؤلاء في الصورة كالفرقة الثانية، وفي الحقيقة مخالفة لها. فإن الفرقة الثانية تركوا قتال المؤمنين احترامًا لهم لا خوفا على أنفسهم، وأما هذه الفرقة فتركوه خوفا لا احتراما، بل لو وجدوا فرصة في قتال المؤمنين، فإنهم مستعدون لانتهازها، فهؤلاء إن لم يتبين منهم ويتضح اتضاحًا عظيمًا اعتزال المؤمنين وترك قتالهم، فإنهم يقاتلون، ولهذا قال: { فَإِنْ لَمْ يَعْتَزِلُوكُمْ وَيُلْقُوا إِلَيْكُمُ السَّلَمَ } أي: المسالمة والموادعة { وَيَكُفُّوا أَيْدِيَهُمْ فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأُولَئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَانًا مُبِينًا } أي: حجة بينة واضحة، لكونهم معتدين ظالمين لكم تاركين للمسالمة، فلا يلوموا إلا أنفسهم.\n                                    "
      },
      "originalText": "سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأۡمَنُوكُمۡ وَيَأۡمَنُواْ قَوۡمَهُمۡ كُلَّ مَا رُدُّوٓاْ إِلَى ٱلۡفِتۡنَةِ أُرۡكِسُواْ فِيهَاۚ فَإِن لَّمۡ يَعۡتَزِلُوكُمۡ وَيُلۡقُوٓاْ إِلَيۡكُمُ ٱلسَّلَمَ وَيَكُفُّوٓاْ أَيۡدِيَهُمۡ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَيۡثُ ثَقِفۡتُمُوهُمۡۚ وَأُوْلَٰٓئِكُمۡ جَعَلۡنَا لَكُمۡ عَلَيۡهِمۡ سُلۡطَٰنٗا مُّبِينٗا ١٩"
    }
  ]
}