{
  "number": 93,
  "ayahsNumber": 3,
  "ayahs": [
    {
      "number": 585,
      "text": "وَمَا كَانَ لِمُؤْمِنٍ أَنْ يَقْتُلَ مُؤْمِنًا إِلَّا خَطَأً ۚ وَمَنْ قَتَلَ مُؤْمِنًا خَطَأً فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ وَدِيَةٌ مُسَلَّمَةٌ إِلَىٰ أَهْلِهِ إِلَّا أَنْ يَصَّدَّقُوا ۚ فَإِنْ كَانَ مِنْ قَوْمٍ عَدُوٍّ لَكُمْ وَهُوَ مُؤْمِنٌ فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ ۖ وَإِنْ كَانَ مِنْ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ فَدِيَةٌ مُسَلَّمَةٌ إِلَىٰ أَهْلِهِ وَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ ۖ فَمَنْ لَمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ تَوْبَةً مِنَ اللَّهِ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 92,
      "juz": 5,
      "manzil": 1,
      "page": 93,
      "ruku": 74,
      "hizbQuarter": 37,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَا كَانَ لِمُؤۡمِنٍ أَن يَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَ‍ٔٗاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَ‍ٔٗا فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖ وَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦٓ إِلَّآ أَن يَصَّدَّقُواْۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوّٖ لَّكُمۡ وَهُوَ مُؤۡمِنٞ فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ وَإِن كَانَ مِن قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞ فَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦ وَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ تَوۡبَةٗ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا ٢٩\n                                    \n                                    \n                                    يقول تعالى : ليس لمؤمن أن يقتل أخاه المؤمن بوجه من الوجوه ، كما ثبت في الصحيحين ، عن ابن مسعود أن رسول الله صلى الله عليه وسلم قال : \" لا دم امرئ مسلم يشهد أن لا إله إلا الله ، وأني رسول الله إلا بإحدى ثلاث : النفس بالنفس ، والثيب الزاني ، والتارك لدينه المفارق للجماعة \" .\nثم إذا وقع شيء من هذه الثلاث ، فليس لأحد من آحاد الرعية أن يقتله ، وإنما ذلك إلى الإمام أو نائبه .\nوقوله : ( إلا خطأ ) قالوا : هو استثناء منقطع ، كقول الشاعر\nمن البيض لم تظعن بعيدا ولم تطأ على الأرض إلا ريط برد مرحل\n.\nولهذا شواهد كثيرة .\nواختلف في سبب نزول هذه [ الآية ] فقال مجاهد وغير واحد : نزلت في عياش بن أبي ربيعة أخي أبي جهل لأمه - وهي أسماء بنت مخربة - وذلك أنه قتل رجلا كان يعذبه مع أخيه على الإسلام ، وهو الحارث بن يزيد العامري ، فأضمر له عياش السوء ، فأسلم ذلك الرجل وهاجر ، وعياش لا يشعر ، فلما كان يوم الفتح رآه ، فظن أنه على دينه ، فحمل عليه فقتله . فأنزل الله هذه الآية .\nوقال عبد الرحمن بن زيد بن أسلم : نزلت في أبي الدرداء ; لأنه قتل رجلا وقد قال كلمة الإسلام حين رفع السيف ، فأهوى به إليه ، فقال كلمته ، فلما ذكر ذلك للنبي صلى الله عليه وسلم قال : إنما قالها متعوذا . فقال له : \" هل شققت عن قلبه \" [ وهذه القصة في الصحيح لغير أبي الدرداء ] .\nوقوله : ( ومن قتل مؤمنا خطأ فتحرير رقبة مؤمنة ودية مسلمة إلى أهله [ إلا أن يصدقوا ] ) هذان واجبان في قتل الخطأ ، أحدهما : الكفارة لما ارتكبه من الذنب العظيم ، وإن كان خطأ ، ومن شرطها أن تكون عتق رقبة مؤمنة فلا تجزئ الكفارة .\nوحكى ابن جرير ، عن ابن عباس والشعبي وإبراهيم النخعي والحسن البصري أنهم قالوا : لا يجزئ الصغير حتى يكون قاصدا للإيمان . وروي من طريق عبد الرزاق عن معمر ، عن قتادة قال : في : ( فتحرير رقبة مؤمنة ) لا يجزئ فيها صبي .\nواختار ابن جرير إن كان مولودا بين أبوين مسلمين أجزأ ، وإلا فلا . والذي عليه الجمهور : أنه متى كان مسلما صح عتقه عن الكفارة ، سواء كان صغيرا أو كبيرا .\nوقال الإمام أحمد : أنبأنا عبد الرزاق ، أخبرنا معمر ، عن الزهري ، عن عبد الله بن عبد الله ، عن رجل من الأنصار ; أنه جاء بأمة سوداء ، فقال : يا رسول الله ، إن علي رقبة مؤمنة ، فإن كنت ترى هذه مؤمنة أعتقتها . فقال لها رسول الله صلى الله عليه وسلم : \" أن لا إله إلا الله ؟ \" قالت : نعم . قال : \" أني رسول الله ؟ \" قالت نعم . قال : \" بالبعث بعد الموت ؟ \" قالت : نعم ، قال : \" أعتقها \" .\nوهذا إسناد صحيح ، وجهالة الصحابي لا تضر .\nوفي موطأ [ الإمام ] مالك ومسندي الشافعي وأحمد ، وصحيح مسلم ، وسنن أبي داود والنسائي ، من طريق هلال بن أبي ميمونة ، عن عطاء بن يسار ، عن معاوية بن الحكم أنه لما جاء بتلك الجارية السوداء قال لها رسول الله صلى الله عليه وسلم : \" أين الله ؟ \" قالت : في السماء . قال : \" من أنا \" قالت : أنت رسول الله صلى الله عليه وسلم قال : \" أعتقها فإنها مؤمنة \" .\nوقوله : ( ودية مسلمة إلى أهله ) هو الواجب الثاني فيما بين القاتل وأهل القتيل ، عوضا لهم عما فاتهم من قريبهم . وهذه الدية إنما تجب أخماسا ، كما رواه الإمام أحمد وأهل السنن ، من حديث الحجاج بن أرطأة ، عن زيد بن جبير ، عن خشف بن مالك ، عن ابن مسعود قال : قضى رسول الله صلى الله عليه وسلم في دية الخطأ عشرين بنت مخاض ، وعشرين بني مخاض ذكورا ، وعشرين بنت لبون ، وعشرين جذعة وعشرين حقة .\nلفظ النسائي ، وقال الترمذي : لا نعرفه مرفوعا إلا من هذا الوجه ، وقد روي عن عبد الله موقوفا .\nوكذا روي عن [ علي و ] طائفة .\nوقيل : تجب أرباعا . وهذه الدية إنما تجب على عاقلة القاتل ، لا في ماله ، قال الشافعي ، رحمه الله : لم أعلم مخالفا أن رسول الله صلى الله عليه وسلم قضى بالدية على العاقلة ، وهو أكثر من حديث الخاصة وهذا الذي أشار إليه ، رحمه الله ، قد ثبت في غير ما حديث ، فمن ذلك ما ثبت في الصحيحين عن أبي هريرة قال : اقتتلت امرأتان من هذيل ، فرمت إحداهما الأخرى بحجر فقتلتها وما في بطنها ، فاختصموا إلى رسول الله صلى الله عليه وسلم ، فقضى أن دية جنينها غرة عبد أو أمة ، وقضى بدية المرأة على عاقلتها .\nوهذا يقتضي أن حكم عمد الخطأ حكم الخطأ المحض في وجوب الدية ، لكن هذا تجب فيه الدية أثلاثا كالعمد ، لشبهه به .\nوفي صحيح البخاري ، عن عبد الله بن عمر قال : بعث رسول الله صلى الله عليه وسلم خالد بن الوليد إلى بني جذيمة ، فدعاهم إلى الإسلام ، فلم يحسنوا أن يقولوا : أسلمنا . فجعلوا يقولون : صبأنا صبأنا . فجعل خالد يقتلهم ، فبلغ ذلك رسول الله صلى الله عليه وسلم ، فرفع يديه وقال : \" اللهم إني أبرأ إليك مما صنع خالد \" . وبعث عليا فودى قتلاهم وما أتلف من أموالهم ، حتى ميلغة الكلب .\nوهذا [ الحديث ] يؤخذ منه أن خطأ الإمام أو نائبه يكون في بيت المال .\nوقوله : ( إلا أن يصدقوا ) أي : فتجب فيه الدية مسلمة إلى أهله إلا أن يتصدقوا بها فلا تجب .\nوقوله : ( فإن كان من قوم عدو لكم وهو مؤمن فتحرير رقبة مؤمنة ) أي : إذا كان القتيل مؤمنا ، ولكن أولياؤه من الكفار أهل حرب ، فلا دية لهم ، وعلى القاتل تحرير رقبة مؤمنة لا غير .\nوقوله : ( وإن كان من قوم بينكم وبينهم ميثاق [ فدية مسلمة إلى أهله وتحرير رقبة مؤمنة ] ) الآية ، أي : فإن كان القتيل أولياؤه أهل ذمة أو هدنة ، فلهم دية قتيلهم ، فإن كان مؤمنا فدية كاملة ، وكذا إن كان كافرا أيضا عند طائفة من العلماء . وقيل : يجب في الكافر نصف دية المسلم ، وقيل : ثلثها ، كما هو مفصل في [ كتاب الأحكام ] ويجب أيضا على القاتل تحرير رقبة مؤمنة .\n( فمن لم يجد فصيام شهرين متتابعين ) أي : لا إفطار بينهما ، بل يسرد صومهما إلى آخرهما ، فإن أفطر من غير عذر ، من مرض أو حيض أو نفاس ، استأنف . واختلفوا في السفر : هل يقطع أم لا ؟ على قولين .\nوقوله : ( توبة من الله وكان الله عليما حكيما ) أي : هذه توبة القاتل خطأ إذا لم يجد العتق صام شهرين متتابعين .\nواختلفوا فيمن لا يستطيع الصيام : هل يجب عليه إطعام ستين مسكينا ، كما في كفارة الظهار ؟ على قولين ; أحدهما : نعم . كما هو منصوص عليه في كفارة الظهار ، وإنما لم يذكر هاهنا ; لأن هذا مقام تهديد وتخويف وتحذير ، فلا يناسب أن يذكر فيه الإطعام لما فيه من التسهيل والترخيص . القول الثاني : لا يعدل إلى الإطعام ; لأنه لو كان واجبا لما أخر بيانه عن وقت الحاجة .\n( وكان الله عليما حكيما ) قد تقدم تفسيره غير مرة .\n                                    ",
        "qortoby": "وَمَا كَانَ لِمُؤۡمِنٍ أَن يَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَ‍ٔٗاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَ‍ٔٗا فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖ وَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦٓ إِلَّآ أَن يَصَّدَّقُواْۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوّٖ لَّكُمۡ وَهُوَ مُؤۡمِنٞ فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ وَإِن كَانَ مِن قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞ فَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦ وَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ تَوۡبَةٗ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا ٢٩\n                                    \n                                    \n                                    وما كان لمؤمن أن يقتل مؤمنا إلا خطأ ومن قتل مؤمنا خطأ فتحرير رقبة مؤمنة ودية مسلمة إلى أهله إلا أن يصدقوا فإن كان من قوم عدو لكم وهو مؤمن فتحرير رقبة مؤمنة وإن كان من قوم بينكم وبينهم ميثاق فدية مسلمة إلى أهله وتحرير رقبة مؤمنة فمن لم يجد فصيام شهرين متتابعين توبة من الله وكان الله عليما حكيما\nفيه عشرون مسألة :\nقوله تعالى : وما كان لمؤمن أن يقتل مؤمنا إلا خطأ هذه آية من أمهات الأحكام . والمعنى ما ينبغي لمؤمن أن يقتل مؤمنا إلا خطأ ؛ فقوله : \" وما كان \" ليس على النفي وإنما هو على التحريم والنهي ، كقوله : وما كان لكم أن تؤذوا رسول الله ولو كانت على النفي لما وجد مؤمن قتل مؤمنا قط ؛ لأن ما نفاه الله فلا يجوز وجوده ، كقوله تعالى : ما كان لكم أن تنبتوا شجرها . فلا يقدر العباد أن ينبتوا شجرها أبدا . وقال قتادة : المعنى ما كان له ذلك في عهد الله . وقيل : ما كان له ذلك فيما سلف ، كما ليس له الآن ذلك بوجه ، ثم استثنى استثناء منقطعا ليس من الأول وهو الذي يكون فيه \" إلا \" بمعنى \" لكن \" والتقدير ما كان له أن يقتله ألبتة لكن إن قتله خطأ فعليه كذا ؛ هذا قول سيبويه والزجاج رحمهما الله . ومن الاستثناء المنقطع قوله تعالى : ما لهم به من علم إلا اتباع الظن : وقال النابغة :\nوقفت فيها أصيلانا أسائلها عيت جوابا وما بالربع من أحد إلا الأواري لأيا ما أبينها\nوالنؤي كالحوض بالمظلومة الجلد\nفلما لم تكن \" الأواري \" من جنس أحد حقيقة لم تدخل في لفظه . ومثله قول الآخر أبو خراش الهذلي :\nأمسى سقام خلاء لا أنيس به إلا السباع ومر الريح بالغرف\nوقال آخر :\nوبلدة ليس بها أنيس إلا اليعافير وإلا العيس\nوقال آخر :\nوبعض الرجال نخلة لا جنى لها ولا ظل إلا أن تعد من النخل\nأنشده سيبويه ؛ ومثله كثير ، ومن أبدعه قول جرير :\nمن البيض لم تظعن بعيدا ولم تطأ على الأرض إلا ذيل مرط مرحل\nكأنه قال : لم تطأ على الأرض إلا أن تطأ ذيل البرد . ونزلت الآية بسبب قتل عياش بن أبي ربيعة الحارث بن يزيد بن أبي أنيسة العامري لحنة كانت بينهما ، فلما هاجر الحارث مسلما لقيه عياش فقتله ولم يشعر بإسلامه ، فلما أخبر أتى النبي صلى الله عليه وسلم فقال : يا رسول الله ، إنه قد كان من أمري وأمر الحارث ما قد علمت ، ولم أشعر بإسلامه حتى قتلته فنزلت الآية . وقيل : هو استثناء متصل ، أي وما كان لمؤمن أن يقتل مؤمنا ولا يقتص منه إلا أن يكون خطأ ؛ فلا يقتص منه ؛ ولكن فيه كذا وكذا . ووجه آخر وهو أن يقدر كان بمعنى استقر ووجد ؛ كأنه قال : وما وجد وما تقرر وما ساغ لمؤمن أن يقتل مؤمنا إلا خطأ إذ هو مغلوب فيه أحيانا ؛ فيجيء الاستثناء على هذين التأويلين غير منقطع . وتتضمن الآية على هذا إعظام العمد وبشاعة شأنه ؛ كما تقول : ما كان لك يا فلان أن تتكلم بهذا إلا ناسيا ؟ إعظاما للعمد والقصد مع حظر الكلام به ألبتة .\nوقيل : المعنى ولا خطأ . قال النحاس : ولا يجوز أن تكون إلا بمعنى الواو ، ولا يعرف ذلك في كلام العرب ولا يصح في المعنى ؛ لأن الخطأ لا يحظر . ولا يفهم من دليل خطابه جواز قتل الكافر المسلم فإن المسلم محترم الدم ، وإنما خص المؤمن بالذكر تأكيدا لحنانه وأخوته وشفقته وعقيدته . وقرأ الأعمش \" خطاء \" ممدودا في المواضع الثلاثة . ووجوه الخطأ كثيرة لا تحصى يربطها عدم القصد ؛ مثل أن يرمي صفوف المشركين فيصيب مسلما . أو يسعى بين يديه من يستحق القتل من زان أو محارب أو مرتد فطلبه ليقتله فلقي غيره فظنه هو فقتله فذلك خطأ . أو يرمي إلى غرض فيصيب إنسانا أو ما جرى مجراه ؛ وهذا مما لا خلاف فيه . والخطأ اسم من أخطأ خطأ وإخطاء إذا لم يصنع عن تعمد ؛ فالخطأ الاسم يقوم مقام الإخطاء . ويقال لمن أراد شيئا ففعل غيره : أخطأ ، ولمن فعل غير الصواب : أخطأ . قال ابن المنذر : قال الله تبارك وتعالى : وما كان لمؤمن أن يقتل مؤمنا إلا خطأ إلى قوله تعالى : ودية مسلمة إلى أهله فحكم الله جل ثناؤه في المؤمن يقتل خطأ بالدية ، وثبتت السنة الثابتة عن رسول الله صلى الله عليه وسلم على ذلك وأجمع أهل العلم على القول به .\nالثانية : ذهب داود إلى القصاص بين الحر والعبد في النفس ، وفي كل ما يستطاع القصاص فيه من الأعضاء ؛ تمسكا بقوله تعالى : وكتبنا عليهم فيها أن النفس بالنفس إلى قوله تعالى : والجروح قصاص ، وقوله عليه السلام : المسلمون تتكافأ دماؤهم فلم يفرق بين حر وعبد ؛ وهو قول ابن أبي ليلى . وقال أبو حنيفة وأصحابه : لا قصاص بين الأحرار والعبيد إلا في النفس فيقتل الحر بالعبد ، كما يقتل العبد بالحر ، ولا قصاص بينهما في شيء من الجراح والأعضاء . وأجمع العلماء على أن قوله تعالى : وما كان لمؤمن أن يقتل مؤمنا إلا خطأ أنه لم يدخل فيه العبيد ، وإنما أريد به الأحرار دون العبيد ؛ فكذلك قوله عليه السلام : المسلمون تتكافأ دماؤهم أريد به الأحرار خاصة . والجمهور على ذلك وإذا لم يكن قصاص بين العبيد والأحرار فيما دون النفس فالنفس أحرى بذلك ؛ وقد مضى هذا في \" البقرة \" .\nالثالثة : ومن قتل مؤمنا خطأ فتحرير رقبة مؤمنة أي فعليه تحرير رقبة ؛ هذه الكفارة التي أوجبها الله تعالى في كفارة القتل والظهار أيضا على ما يأتي . واختلف العلماء فيما يجزئ منها ، فقال ابن عباس والحسن والشعبي والنخعي وقتادة وغيرهم : الرقبة المؤمنة هي التي صلت وعقلت الإيمان ، لا تجزئ في ذلك الصغيرة ، وهو الصحيح في هذا الباب قال عطاء بن أبي رباح : يجزئ الصغير المولود بين مسلمين . وقال جماعة منهم مالك والشافعي : يجزئ كل من حكم له بحكم في الصلاة عليه إن مات ودفنه . وقال مالك : من صلى وصام أحب إلي . ولا يجزئ في قول كافة العلماء أعمى ولا مقعد ولا مقطوع اليدين أو الرجلين ولا أشلهما ، ويجزئ عند أكثرهم الأعرج والأعور . قال مالك : إلا أن يكون عرجا شديدا . ولا يجزئ عند مالك والشافعي وأكثر العلماء أقطع إحدى اليدين أو إحدى الرجلين ، ويجزئ عند أبي حنيفة وأصحابه . ولا يجزئ عند أكثرهم المجنون المطبق ولا يجزئ عند مالك الذي يجن ويفيق ، ويجزئ عند الشافعي . ولا يجزئ عند مالك المعتق إلى سنين ، ويجزئ عند الشافعي . ولا يجزئ المدبر عند مالك والأوزاعي وأصحاب الرأي ، ويجزئ في قول الشافعي وأبي ثور ، واختاره ابن المنذر . وقال مالك : لا يصح من أعتق بعضه ؛ لقوله تعالى : فتحرير رقبة . ومن أعتق البعض لا يقال حرر رقبة وإنما حرر بعضها . واختلفوا أيضا في معناها فقيل : أوجبت تمحيصا وطهورا لذنب القاتل ، وذنبه ترك الاحتياط والتحفظ حتى هلك على يديه امرؤ محقون الدم . وقيل : أوجبت بدلا من تعطيل حق الله تعالى في نفس القتيل ، فإنه كان له في نفسه حق وهو التنعم بالحياة والتصرف فيما أحل له تصرف الأحياء . وكان لله سبحانه فيه حق ، وهو أنه كان عبدا من عباده يجب له من أمر العبودية صغيرا كان أو كبيرا حرا كان أو عبدا مسلما كان أو ذميا ما يتميز به عن البهائم والدواب ، ويرتجى مع ذلك أن يكون من نسله من يعبد الله ويطيعه ، فلم يخل قاتله من أن يكون فوت منه الاسم الذي ذكرنا ، والمعنى الذي وصفنا ، فلذلك ضمن الكفارة . وأي واحد من هذين المعنيين كان ، ففيه بيان أن النص وإن وقع على القاتل خطأ فالقاتل عمدا مثله ، بل أولى بوجوب الكفارة عليه منه ، على ما يأتي بيانه ، والله أعلم .\nالرابعة : قوله تعالى : ودية مسلمة الدية ما يعطى عوضا عن دم القتيل إلى وليه . مسلمة مدفوعة مؤداة ، ولم يعين الله في كتابه ما يعطى في الدية ، وإنما في الآية إيجاب الدية مطلقا ، وليس فيها إيجابها على العاقلة أو على القاتل ، وإنما أخذ ذلك من السنة ، ولا شك أن إيجاب المواساة على العاقلة خلاف قياس الأصول في الغرامات وضمان المتلفات ، والذي وجب على العاقلة لم يجب تغليظا ، ولا أن وزر القاتل عليهم ولكنه مواساة محضة .\nواعتقد أبو حنيفة أنها باعتبار النصرة فأوجبها على أهل ديوانه . وثبتت الأخبار عن رسول الله صلى الله عليه وسلم بأن الدية مائة من الإبل ، ووداها صلى الله عليه وسلم في عبد الله بن سهل المقتول بخيبر لحويصة ومحيصة وعبد الرحمن ، فكان ذلك بيانا على لسان نبيه عليه السلام لمجمل كتابه . وأجمع أهل العلم على أن على أهل الإبل مائة من الإبل واختلفوا فيما يجب على غير أهل الإبل ؛ فقالت طائفة : على أهل الذهب ألف دينار ، وهم أهل الشام ومصر والمغرب ؛ هذا قول مالك وأحمد وإسحاق وأصحاب الرأي والشافعي في أحد قوليه ، في القديم . وروي هذا عن عمر وعروة بن الزبير وقتادة . وأما أهل الورق فاثنا عشر ألف درهم ، وهم أهل العراق وفارس وخراسان ؛ هذا مذهب مالك على ما بلغه عن عمر أنه قوم الدية على أهل القرى فجعلها على أهل الذهب ألف دينار وعلى أهل الورق اثني عشر ألف درهم . وقال المزني : قال الشافعي الدية الإبل ؛ فإن أعوزت فقيمتها بالدراهم والدنانير على ما قومها عمر ألف دينار على أهل الذهب واثنا عشر ألف درهم على أهل الورق . وقال أبو حنيفة وأصحابه والثوري : الدية من الورق عشرة آلاف درهم . رواه الشعبي عن عبيدة عن عمر أنه جعل الدية على أهل الذهب ألف دينار ، وعلى أهل الورق عشرة آلاف درهم ، وعلى أهل البقر مائتي بقرة ، وعلى أهل الشاء ألف شاة ، وعلى أهل الإبل مائة من الإبل ، وعلى أهل الحلل مائتي حلة . قال أبو عمر : في هذا الحديث ما يدل على أن الدنانير والدراهم صنف من أصناف الدية لا على وجه البدل والقيمة ؛ وهو الظاهر من الحديث عن عثمان وعلي وابن عباس . وخالف أبو حنيفة ما رواه عن عمر في البقر والشاء والحلل . وبه قال عطاء وطاوس وطائفة من التابعين ، وهو قول الفقهاء السبعة المدنيين . قال ابن المنذر : وقالت طائفة : دية الحر المسلم مائة من الإبل لا دية غيرها كما فرض رسول الله صلى الله عليه وسلم . هذا قول الشافعي وبه قال طاوس . قال ابن المنذر : دية الحر المسلم مائة من الإبل في كل زمان ، كما فرض رسول الله صلى الله عليه وسلم . واختلفت الروايات عن عمر رضي الله عنه في أعداد الدراهم وما منها شيء يصح عنه لأنها مراسيل ، وقد عرفتك مذهب الشافعي وبه نقول .\nالخامسة : واختلف الفقهاء في أسنان دية الإبل ؛ فروى أبو داود من حديث عمرو بن شعيب عن أبيه عن جده أن رسول الله صلى الله عليه وسلم قضى أن من قتل خطأ فديته مائة من الإبل : ثلاثون بنت مخاض ، وثلاثون بنت لبون ، وثلاثون حقة ، وعشر بني لبون . قال الخطابي : هذا الحديث لا أعرف أحدا قال به من الفقهاء ، وإنما قال أكثر العلماء : دية الخطأ أخماس . كذا قال أصحاب الرأي والثوري ، وكذلك مالك وابن سيرين وأحمد بن حنبل إلا أنهم اختلفوا في الأصناف ؛ قال أصحاب الرأي وأحمد : خمس بنو مخاض ، وخمس بنات مخاض ، وخمس بنات لبون ، وخمس حقاق ، وخمس جذاع . وروي هذا القول عن ابن مسعود . وقال مالك والشافعي : خمس حقاق ، وخمس جذاع ، وخمس بنات لبون ، وخمس بنات مخاض ، وخمس بنو لبون . وحكي هذا القول عن عمر بن عبد العزيز وسليمان بن يسار والزهري وربيعة والليث بن سعد . قال الخطابي : ولأصحاب الرأي فيه أثر ، إلا أن راويه عبد الله بن خشف بن مالك وهو مجهول لا يعرف إلا بهذا الحديث . وعدل الشافعي عن القول به . لما ذكرنا من العلة في راويه ، ولأن فيه بني مخاض ولا مدخل لبني مخاض في شيء من أسنان الصدقات . وقد روي عن النبي صلى الله عليه وسلم في قصة القسامة أنه ودى قتيل خيبر مائة من إبل الصدقة وليس في أسنان الصدقة ابن مخاض . قال أبو عمر : وقد روى زيد بن جبير عن خشف بن مالك عن عبد الله بن مسعود أن رسول الله صلى الله عليه وسلم جعل الدية في الخطأ أخماسا ، إلا أن هذا لم يرفعه إلا خشف بن مالك الكوفي الطائي وهو مجهول ؛ لأنه لم يروه عنه إلا زيد بن جبير بن حرمل الطائي الجشمي من بني جشم بن معاوية أحد ثقات الكوفيين .\nقلت : قد ذكر الدارقطني في سننه حديث خشف بن مالك من رواية حجاج بن أرطأة عن زيد بن جبير عن خشف بن مالك عن عبد الله بن مسعود قال : قضى رسول الله صلى الله عليه وسلم في دية الخطأ مائة من الإبل ؛ منها عشرون حقة ، وعشرون جذعة ، وعشرون بنات لبون ، وعشرون بنات مخاض ، وعشرون بني مخاض . قال الدارقطني : \" هذا حديث ضعيف غير ثابت عند أهل المعرفة بالحديث من وجوه عدة ؛ أحدها أنه مخالف لما رواه أبو عبيدة بن عبد الله بن مسعود عن أبيه بالسند الصحيح عنه ، الذي لا مطعن فيه ولا تأويل عليه ، وأبو عبيدة أعلم بحديث أبيه وبمذهبه وفتياه من خشف بن مالك ونظرائه ، وعبد الله بن مسعود أتقى لربه وأشح على دينه من أن يروي عن رسول الله صلى الله عليه وسلم أنه يقضي بقضاء ويفتي هو بخلافه ؛ هذا لا يتوهم مثله على عبد الله بن مسعود وهو القائل في مسألة وردت عليه لم يسمع فيها من رسول الله صلى الله عليه وسلم شيئا ولم يبلغه عنه فيها قول : أقول فيها برأيي فإن يكن صوابا فمن الله ورسوله ، وإن يكن خطأ فمني ؛ ثم بلغه بعد ذلك أن فتياه فيها وافق قضاء رسول الله صلى الله عليه وسلم في مثلها ، فرآه أصحابه عند ذلك فرح فرحا شديدا لم يروه فرح مثله ، لموافقة فتياه قضاء رسول الله صلى الله عليه وسلم . فمن كانت هذه صفته وهذا حاله فكيف يصح عنه أن يروي عن رسول الله صلى الله عليه وسلم شيئا ويخالفه .\nووجه آخر : وهو أن الخبر المرفوع الذي فيه ذكر بني المخاض لا نعلمه رواه إلا خشف بن مالك عن ابن مسعود وهو رجل مجهول لم يروه عنه إلا زيد بن جبير بن حرمل الجشمي وأهل العلم بالحديث لا يحتجون بخبر ينفرد بروايته رجل غير معروف ، وإنما يثبت العلم عندهم بالخبر إذا كان راويه عدلا مشهورا ، أو رجلا قد ارتفع عنه اسم الجهالة ، وارتفاع اسم الجهالة عنه أن يروي عنه رجلان فصاعدا ؛ فإذا كانت هذه صفته ارتفع عنه حينئذ اسم الجهالة ، وصار حينئذ معروفا . فأما من لم يرو عنه إلا رجل واحد وانفرد بخبر وجب التوقف عن خبره ذلك حتى يوافقه عليه غيره . والله أعلم .\nووجه آخر : وهو أن حديث خشف بن مالك لا نعلم أحدا رواه عن زيد بن جبير عنه إلا الحجاج بن أرطأة ، والحجاج رجل مشهور بالتدليس وبأنه يحدث عمن لم يلقه ولم يسمع منه ؛ وترك الرواية عنه سفيان بن عيينة ويحيى بن سعيد القطان وعيسى بن يونس بعد أن جالسوه وخبروه ، وكفاك بهم علما بالرجل ونبلا . وقال يحيى بن معين : حجاج بن أرطأة لا يحتج بحديثه . وقال عبد الله بن إدريس : سمعت الحجاج يقول لا ينبل الرجل حتى يدع الصلاة في الجماعة . وقال عيسى بن يونس : سمعت الحجاج يقول : أخرج إلى الصلاة يزاحمني الحمالون والبقالون . وقال جرير : سمعت الحجاج يقول : أهلكني حب المال والشرف . وذكر أوجها أخر ؛ منها أن جماعة من الثقات رووا هذا الحديث عن الحجاج بن أرطأة فاختلفوا عليه فيه . إلى غير ذلك مما يطول ذكره ؛ وفيما ذكرناه مما ذكروه كفاية ودلالة على ضعف ما ذهب إليه الكوفيون في الدية ، وإن كان ابن المنذر مع جلالته قد اختاره على ما يأتي . وروى حماد بن سلمة حدثنا سليمان التيمي عن أبي مجلز عن أبي عبيدة أن ابن مسعود قال : دية الخطأ خمسة أخماس : عشرون حقة ، وعشرون جذعة ، وعشرون بنات مخاض ، وعشرون بنات لبون ، وعشرون بني لبون ذكور . قال الدارقطني : هذا إسناد حسن ورواته ثقات ، وقد روي عن علقمة عن عبد الله نحو هذا .\nقلت : وهذا هو مذهب مالك والشافعي أن الدية تكون مخمسة . قال الخطابي : وقد روي عن نفر من العلماء أنهم قالوا دية الخطأ أرباع ؛ وهم الشعبي والنخعي والحسن البصري ، وإليه ذهب إسحاق بن راهويه ؛ إلا أنهم قالوا : خمس وعشرون جذعة وخمس وعشرون حقة وخمس وعشرون بنات لبون وخمس وعشرون بنات مخاض . وقد روي ذلك عن علي بن أبي طالب . قال أبو عمر : أما قول مالك والشافعي فروي عن سليمان بن يسار وليس فيه عن صحابي شيء ؛ ولكن عليه عمل أهل المدينة . وكذلك حكى ابن جريج عن ابن شهاب .\nقلت : قد ذكرنا عن ابن مسعود ما يوافق ما صار إليه مالك والشافعي . قال أبو عمر : وأسنان الإبل في الديات لم تؤخذ قياسا ولا نظرا ، وإنما أخذت اتباعا وتسليما ، وما أخذ من جهة الأثر فلا مدخل فيه للنظر ؛ فكل يقول بما قد صح عنده من سلفه ؛ رضي الله عنهم أجمعين .\nقلت : وأما ما حكاه الخطابي من أنه لا يعلم من قال بحديث عمرو بن شعيب فقد حكاه ابن المنذر عن طاوس ومجاهد ، إلا أن مجاهدا جعل مكان بنت مخاض ثلاثين جذعة . قال ابن المنذر : وبالقول الأول أقول . يريد قول عبد الله وأصحاب الرأي الذي ضعفه الدارقطني والخطابي ، وابن عبد البر قال : لأنه الأقل مما قيل ؛ وبحديث مرفوع رويناه عن النبي صلى الله عليه وسلم يوافق هذا القول .\nقلت : وعجبا لابن المنذر ؟ مع نقده واجتهاده كيف قال بحديث لم يوافقه أهل النقد على صحته ! لكن الذهول والنسيان قد يعتري الإنسان ، وإنما الكمال لعزة ذي الجلال .\nالسادسة : ثبتت الأخبار عن النبي المختار محمد صلى الله عليه وسلم أنه قضى بدية الخطأ على العاقلة ، وأجمع أهل العلم على القول به . وفي إجماع أهل العلم أن الدية في الخطأ على العاقلة دليل على أن المراد من قول النبي صلى الله عليه وسلم لأبي رمثة حيث دخل عليه ومعه ابنه : إنه لا يجني عليك ولا تجني عليه العمد دون الخطأ . وأجمعوا على أن ما زاد على ثلث الدية على العاقلة . واختلفوا في الثلث ؛ والذي عليه جمهور العلماء أن العاقلة لا تحمل عمدا ولا اعترافا ولا صلحا ، ولا تحمل من دية الخطأ إلا ما جاوز الثلث وما دون الثلث في مال الجاني . وقالت طائفة : عقل الخطأ على عاقلة الجاني ، قلت الجناية أو كثرت ؛ لأن من غرم الأكثر غرم الأقل . كما عقل العمد في مال الجاني قل أو كثر ؛ هذا قول الشافعي .\nالسابعة : وحكمها أن تكون منجمة على العاقلة ، والعاقلة العصبة . وليس ولد المرأة إذا كان من غير عصبتها من العاقلة . ولا الإخوة من الأم بعصبة لإخوتهم من الأب والأم ، فلا يعقلون عنهم شيئا . وكذلك الديوان لا يكون عاقلة في قول جمهور أهل الحجاز . وقال الكوفيون : يكون عاقلة إن كان من أهل الديوان ؛ فتنجم الدية على العاقلة في ثلاثة أعوام على ما قضاه عمر وعلي ؛ لأن الإبل قد تكون حوامل فتضر به . وكان النبي صلى الله عليه وسلم يعطيها دفعة واحدة لأغراض ؛ منها أنه كان يعطيها صلحا وتسديدا . ومنها أنه كان يعجلها تأليفا . فلما تمهد الإسلام قدرتها الصحابة على هذا النظام ؛ قاله ابن العربي . وقال أبو عمر : أجمع العلماء قديما وحديثا أن الدية على العاقلة لا تكون إلا في ثلاث سنين ولا تكون في أقل منها . وأجمعوا على أنها على البالغين من الرجال . وأجمع أهل السير والعلم أن الدية كانت في الجاهلية تحملها العاقلة فأقرها رسول الله صلى الله عليه وسلم في الإسلام ، وكانوا يتعاقلون بالنصرة ؛ ثم جاء الإسلام فجرى الأمر على ذلك حتى جعل الديوان . واتفق الفقهاء على رواية ذلك والقول به . وأجمعوا أنه لم يكن في زمن رسول الله صلى الله عليه وسلم ولا زمن أبي بكر ديوان ، وأن عمر جعل الديوان وجمع بين الناس ، وجعل أهل كل ناحية يدا ، وجعل عليهم قتال من يليهم من العدو .\nالثامنة : قلت : ومما ينخرط في سلك هذا الباب ويدخل في نظامه قتل الجنين في بطن أمه ؛ وهو أن يضرب بطن أمه فتلقيه حيا ثم يموت ؛ فقال كافة العلماء : فيه الدية كاملة في الخطأ وفي العمد بعد القسامة . وقيل : بغير قسامة . واختلفوا فيما به تعلم حياته بعد اتفاقهم على أنه إذا استهل صارخا أو ارتضع أو تنفس نفسا محققة حي ، فيه الدية كاملة ؛ فإن تحرك فقال الشافعي وأبو حنيفة : الحركة تدل على حياته . وقال مالك : لا ، إلا أن يقارنها طول إقامة . والذكر والأنثى عند كافة العلماء في الحكم سواء . فإن ألقته ميتا ففيه غرة : عبد أو وليدة . فإن لم تلقه وماتت وهو في جوفها لم يخرج فلا شيء فيه . وهذا كله إجماع لا خلاف فيه . وروي عن الليث بن سعد وداود أنهما قالا في المرأة إذا ماتت من ضرب بطنها ثم خرج الجنين ميتا بعد موتها : ففيه الغرة ، وسواء رمته قبل موتها أو بعد موتها ؛ المعتبر حياة أمه في وقت ضربها لا غير . وقال سائر الفقهاء : لا شيء فيه إذا خرج ميتا من بطنها بعد موتها . قال الطحاوي محتجا لجماعة الفقهاء بأن قال : قد أجمعوا والليث معهم على أنه لو ضرب بطنها وهي حية فماتت والجنين في بطنها ولم يسقط أنه لا شيء فيه ؛ فكذلك إذا سقط بعد موتها .\nالتاسعة : ولا تكون الغرة إلا بيضاء . قال أبو عمرو بن العلاء في قول رسول الله صلى الله عليه وسلم : في الجنين غرة عبد أو أمة - لولا أن رسول الله صلى الله عليه وسلم أراد بالغرة معنى لقال : في الجنين عبد أو أمة ، ولكنه عنى البياض ؛ فلا يقبل في الدية إلا غلام أبيض أو جارية بيضاء ، لا يقبل فيها أسود ولا سوداء . واختلف العلماء في قيمتها ؛ فقال مالك : تقوم بخمسين دينارا أو ستمائة درهم ؛ نصف عشر دية الحر المسلم ، وعشر دية أمه الحرة ؛ وهو قول ابن شهاب وربيعة وسائر أهل المدينة . وقال أصحاب الرأي : قيمتها خمسمائة درهم . وقال الشافعي : سن الغرة سبع سنين أو ثمان سنين ؛ وليس عليه أن يقبلها معيبة . ومقتضى مذهب مالك أنه مخير بين إعطاء غرة أو عشر دية الأم ، من الذهب عشرون دينارا إن كانوا أهل ذهب ، ومن الورق - إن كانوا أهل ورق - ستمائة درهم ، أو خمس فرائض من الإبل . قال مالك وأصحابه : هي في مال الجاني ؛ وهو قول الحسن بن حي . وقال أبو حنيفة والشافعي وأصحابهما ، هي على العاقلة . وهو أصح ؛ لحديث المغيرة بن شعبة أن امرأتين كانتا تحت رجلين من الأنصار - في رواية فتغايرتا - فضربت إحداهما الأخرى بعمود فقتلتها ، فاختصم إلى النبي صلى الله عليه وسلم الرجلان فقالا : ندي من لا صاح ولا أكل ، ولا شرب ولا استهل فمثل ذلك يطل ؟ ! فقال : أسجع كسجع الأعراب ؟ فقضى فيه غرة وجعلها على عاقلة المرأة . وهو حديث ثابت صحيح ، نص في موضع الخلاف يوجب الحكم . ولما كانت دية المرأة المضروبة على العاقلة كان الجنين كذلك في القياس والنظر . واحتج علماؤنا بقول الذي قضي عليه : كيف أغرم ؟ قالوا : وهذا يدل على أن الذي قضي عليه معين وهو الجاني . ولو أن دية الجنين قضى بها على العاقلة لقال : فقال الذي قضى عليهم . وفي القياس أن كل جان جنايته عليه ، إلا ما قام بخلافه الدليل الذي لا معارض له ؛ مثل إجماع لا يجوز خلافه ، أو نص سنة من جهة نقل الآحاد العدول لا معارض لها ، فيجب الحكم بها ، وقد قال الله تعالى : ولا تكسب كل نفس إلا عليها ولا تزر وازرة وزر أخرى\nالعاشرة : ولا خلاف بين العلماء أن الجنين إذا خرج حيا فيه الكفارة مع الدية . واختلفوا في الكفارة إذا خرج ميتا ؛ قال مالك : فيه الغرة والكفارة . وقال أبو حنيفة والشافعي : فيه الغرة ولا كفارة . واختلفوا في ميراث الغرة عن الجنين ؛ فقال مالك والشافعي وأصحابهما : الغرة في الجنين موروثة عن الجنين على كتاب الله تعالى ؛ لأنها دية . وقال أبو حنيفة وأصحابه : الغرة للأم وحدها ؛ لأنها جناية جني عليها بقطع عضو من أعضائها وليست بدية . ومن الدليل على ذلك أنه لم يعتبر فيه الذكر والأنثى كما يلزم في الديات ، فدل على أن ذلك كالعضو . وكان ابن هرمز يقول : ديته لأبويه خاصة ؛ لأبيه ثلثاها ولأمه ثلثها ، من كان منهما حيا كان ذلك له ، فإن كان أحدهما قد مات كانت للباقي منهما أبا كان أو أما ، ولا يرث الإخوة شيئا .\nالحادية عشرة : قوله تعالى : إلا أن يصدقوا أصله \" أن يتصدقوا \" فأدغمت التاء في الصاد . والتصدق الإعطاء ؛ يعني إلا أن يبرئ الأولياء ورثة المقتول القاتلين مما أوجب لهم من الدية عليهم . فهو استثناء ليس من الأول . وقرأ أبو عبد الرحمن ونبيح \" إلا أن تصدقوا \" بتخفيف الصاد والتاء . وكذلك قرأ أبو عمرو ، إلا أنه شدد الصاد . ويجوز على هذه القراءة حذف التاء الثانية ، ولا يجوز حذفها على قراءة الياء . وفي حرف أبي وابن مسعود \" إلا أن يتصدقوا \" وأما الكفارة التي هي لله تعالى فلا تسقط بإبرائهم ؛ لأنه أتلف شخصا في عبادة الله سبحانه ، فعليه أن يخلص آخر لعبادة ربه وإنما تسقط الدية التي هي حق لهم . وتجب الكفارة في مال الجاني ولا تتحمل .\nالثانية عشرة : قوله تعالى : فإن كان من قوم عدو لكم وهو مؤمن هذه مسألة المؤمن يقتل في بلاد الكفار أو في حروبهم على أنه من الكفار . والمعنى عند ابن عباس وقتادة والسدي وعكرمة ومجاهد والنخعي : فإن كان هذا المقتول رجلا مؤمنا قد أمن وبقي في قومه وهم كفرة عدو لكم فلا دية فيه ؛ وإنما كفارته تحرير الرقبة . وهو المشهور من قول مالك ، وبه قال أبو حنيفة . وسقطت الدية لوجهين : أحدهما : أن أولياء القتيل كفار فلا يصح أن تدفع إليهم فيتقووا بها . والثاني : أن حرمة هذا الذي آمن ولم يهاجر قليلة ، فلا دية ؛ لقوله تعالى : والذين آمنوا ولم يهاجروا ما لكم من ولايتهم من شيء حتى يهاجروا . وقالت طائفة : بل الوجه في سقوط الدية أن الأولياء كفار فقط ؛ فسواء كان القتل خطأ بين أظهر المسلمين أو بين قومه ولم يهاجر أو هاجر ثم رجع إلى قومه كفارته التحرير ولا دية فيه ، إذ لا يصح دفعها إلى الكفار ، ولو وجبت الدية لوجبت لبيت المال على بيت المال ؛ فلا تجب الدية في هذا الموضع وإن جرى القتل في بلاد الإسلام . هذا قول الشافعي وبه قال الأوزاعي والثوري وأبو ثور . وعلى القول الأول إن قتل المؤمن في بلاد المسلمين وقومه حرب ففيه الدية لبيت المال والكفارة .\nقلت : ومن هذا الباب ما جاء في صحيح مسلم عن أسامة قال : بعثنا رسول الله صلى الله عليه وسلم في سرية فصبحنا الحرقات من جهينة فأدركت رجلا فقال : لا إله إلا الله ؛ فطعنته فوقع في نفسي من ذلك ، فذكرته للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم : أقال لا إله إلا الله وقتلته ! قال : قلت يا رسول الله ، إنما قالها خوفا من السلاح ؛ قال : أفلا شققت عن قلبه حتى تعلم أقالها أم لا ؟ . فلم يحكم عليه صلى الله عليه وسلم بقصاص ولا دية . وروي عن أسامة أنه قال : إن رسول الله صلى الله عليه وسلم استغفر لي بعد ثلاث مرات ، وقال : أعتق رقبة ولم يحكم بقصاص ولا دية . فقال علماؤنا : أما سقوط القصاص فواضح إذ لم يكن القتل عدوانا ؛ وأما سقوط الدية فلأوجه ثلاثة :\nالأول : لأنه كان أذن له في أصل القتال فكان عنه إتلاف نفس محترمة غلطا كالخاتن والطبيب .\nالثاني : لكونه من العدو ولم يكن له ولي من المسلمين تكون له ديته ؛ لقوله تعالى : فإن كان من قوم عدو لكم كما ذكرنا .\nالثالث : أن أسامة اعترف بالقتل ولم تقم بذلك بينة ولا تعقل العاقلة اعترافا ، ولعل أسامة لم يكن له مال تكون فيه الدية . والله أعلم .\nالثالثة عشرة : قوله تعالى : وإن كان من قوم بينكم وبينهم ميثاق هذا في الذمي والمعاهد يقتل خطأ فتجب الدية والكفارة ؛ قاله ابن عباس والشعبي والنخعي والشافعي . واختاره الطبري قال : إلا أن الله سبحانه وتعالى أبهمه ولم يقل وهو مؤمن ، كما قال في القتيل من المؤمنين ومن أهل الحرب . وإطلاقه ما قيد قبل يدل على أنه خلافه . وقال الحسن وجابر بن زيد وإبراهيم أيضا : المعنى وإن كان المقتول خطأ مؤمنا من قوم معاهدين لكم فعهدهم يوجب أنهم أحق بدية صاحبهم ، فكفارته التحرير وأداء الدية . وقرأها الحسن : \" وإن كان من قوم بينكم وبينهم ميثاق وهو مؤمن \" . قال الحسن : إذا قتل المسلم الذمي فلا كفارة عليه . قال أبو عمر : وأما الآية فمعناها عند أهل الحجاز مردود على قوله : وما كان لمؤمن أن يقتل مؤمنا إلا خطأ ثم قال تعالى : وإن كان من قوم يريد ذلك المؤمن . والله أعلم . قال ابن العربي : والذي عندي أن الجملة محمولة حمل المطلق على المقيد .\nقلت : وهذا معنى ما قال الحسن وحكاه أبو عمر عن أهل الحجاز . وقوله فدية مسلمة على لفظ النكرة ليس يقتضي دية بعينها . وقيل : هذا في مشركي العرب الذين كان بينهم وبين النبي عليه السلام عهد على أن يسلموا أو يؤذنوا بحرب إلى أجل معلوم : فمن قتل منهم وجبت فيه الدية والكفارة ثم نسخ بقوله تعالى : براءة من الله ورسوله إلى الذين عاهدتم من المشركين\nالرابعة عشرة : وأجمع العلماء على أن دية المرأة على النصف من دية الرجل ؛ قال أبو عمر : إنما صارت ديتها - والله أعلم - على النصف من دية الرجل من أجل أن لها نصف ميراث الرجل ، وشهادة امرأتين بشهادة رجل . وهذا إنما هو في دية الخطأ ، وأما العمد ففيه القصاص بين الرجال والنساء لقوله عز وجل : النفس بالنفس . و الحر بالحر كما تقدم في \" البقرة \" .\nالخامسة عشرة : روى الدارقطني من حديث موسى بن علي بن رباح اللخمي قال : سمعت أبي يقول إن أعمى كان ينشد في الموسم في خلافة عمر بن الخطاب رضي الله عنه وهو يقول :\nيا أيها الناس لقيت منكرا هل يعقل الأعمى الصحيح المبصرا\nخرا معا كلاهما تكسرا\nوذلك أن الأعمى كان يقوده بصير فوقعا في بئر ، فوقع الأعمى على البصير فمات البصير ؛ فقضى عمر بعقل البصير على الأعمى . وقد اختلف العلماء في رجل يسقط على آخر فيموت أحدهما ؛ فروي عن ابن الزبير : يضمن الأعلى الأسفل ، ولا يضمن الأسفل الأعلى . وهذا قول شريح والنخعي وأحمد وإسحاق . وقال مالك في رجلين جر أحدهما صاحبه حتى سقطا وماتا : على عاقلة الذي جبذه الدية . قال أبو عمر : ما أظن في هذا خلافا - والله أعلم - إلا ما قال بعض المتأخرين من أصحابنا وأصحاب الشافعي : يضمن نصف الدية ؛ لأنه مات من فعله ، ومن سقوط الساقط عليه . وقال الحكم وابن شبرمة : إن سقط رجل على رجل من فوق بيت فمات أحدهما ، قالا : يضمن الحي منهما . وقال الشافعي في رجلين يصدم أحدهما الآخر فماتا ، قال : دية المصدوم على عاقلة الصادم ، ودية الصادم هدر . وقال في الفارسين إذا اصطدما فماتا : على كل واحد منهما نصف دية صاحبه ؛ لأن كل واحد منهما مات من فعل نفسه وفعل صاحبه ؛ وقال عثمان البتي وزفر . وقال مالك والأوزاعي والحسن بن حي وأبو حنيفة وأصحابه في الفارسين يصطدمان فيموتان : على كل واحد منهما دية الآخر على عاقلته . قال ابن خويز منداد : وكذلك عندنا السفينتان تصطدمان إذا لم يكن النوتي صرف السفينة ولا الفارس صرف الفرس . وروي عن مالك في السفينتين والفارسين . على كل واحد منهما الضمان لقيمة ما أتلف لصاحبه كاملا .\nالسادسة عشرة : واختلف العلماء من هذا الباب في تفصيل دية أهل الكتاب ؛ فقال مالك وأصحابه : هي على النصف من دية المسلم ، ودية المجوسي ثمانمائة درهم ، ودية نسائهم على النصف من ذلك . روي هذا القول عن عمر بن عبد العزيز وعروة بن الزبير وعمرو بن شعيب وقال به أحمد بن حنبل . وهذا المعنى قد روى فيه سليمان بن بلال ، عن عبد الرحمن بن الحارث بن عياش بن أبي ربيعة ، عن عمرو بن شعيب ، عن أبيه ، عن جده أن النبي صلى الله عليه وسلم جعل دية اليهودي والنصراني على النصف من دية المسلم . وعبد الرحمن هذا قد روى عنه الثوري أيضا . وقال ابن عباس والشعبي والنخعي : المقتول من أهل العهد خطأ لا تبالي مؤمنا كان أو كافرا على عهد قومه فيه الدية كدية المسلم ؛ وهو قول أبي حنيفة والثوري وعثمان البتي والحسن بن حي ؛ جعلوا الديات كلها سواء ، المسلم واليهودي والنصراني والمجوسي والمعاهد والذمي ، وهو قول عطاء والزهري وسعيد بن المسيب . وحجتهم قوله تعالى : فدية وذلك يقتضي الدية كاملة كدية المسلم . وعضدوا هذا بما رواه محمد بن إسحاق ، عن داود بن الحصين ، عن عكرمة ، عن ابن عباس في قصة بني قريظة والنضير أن رسول الله صلى الله عليه وسلم جعل ديتهم سواء دية كاملة . قال أبو عمر : هذا حديث فيه لين وليس في مثله حجة . وقال الشافعي : دية اليهودي والنصراني ثلث دية المسلم ، ودية المجوسي ثمانمائة درهم ؛ وحجته أن ذلك أقل ما قيل في ذلك ، والذمة بريئة إلا بيقين أو حجة . وروي هذا القول عن عمر وعثمان ، وبه قال ابن المسيب وعطاء والحسن وعكرمة وعمرو بن دينار وأبو ثور وإسحاق .\nالسابعة عشرة : قوله تعالى : فمن لم يجد أي الرقبة ولا اتسع ماله لشرائها . فصيام شهرين أي فعليه صيام شهرين . متتابعين حتى لو أفطر يوما استأنف ؛ هذا قول الجمهور . وقال مكي عن الشعبي : إن صيام الشهرين يجزئ عن الدية والعتق لمن لم يجد . قال ابن عطية : وهذا القول وهم ؛ لأن الدية إنما هي على العاقلة وليست على القاتل . والطبري حكى هذا القول عن مسروق .\nالثامنة عشرة : والحيض لا يمنع التتابع من غير خلاف ، وإنها إذا طهرت ولم تؤخر وصلت باقي صيامها بما سلف منه ، لا شيء عليها غير ذلك إلا أن تكون طاهرا قبل الفجر فتترك صيام ذلك اليوم عالمة بطهرها ، فإن فعلت استأنفت عند جماعة من العلماء ؛ قاله أبو عمر . واختلفوا في المريض الذي قد صام من شهري التتابع بعضها على قولين ؛ فقال مالك : وليس لأحد وجب عليه صيام شهرين متتابعين في كتاب الله تعالى أن يفطر إلا من عذر أو مرض أو حيض ، وليس له أن يسافر فيفطر . وممن قال يبني في المرض سعيد بن المسيب وسليمان بن يسار والحسن والشعبي وعطاء ومجاهد وقتادة وطاوس . وقال سعيد بن جبير والنخعي والحكم بن عيينة وعطاء الخراساني : يستأنف في المرض ؛ وهو قول أبي حنيفة وأصحابه والحسن بن حي ؛ وأحد قولي الشافعي ؛ وله قول آخر : أنه يبني كما قال مالك . وقال ابن شبرمة : يقضي ذلك اليوم وحده إن كان عذر غالب ، كصوم رمضان . قال أبو عمر : حجة من قال يبني لأنه معذور في قطع التتابع لمرضه ولم يتعمد ، وقد تجاوز الله عن غير المتعمد . وحجة من قال يستأنف لأن التتابع فرض لا يسقط لعذر ، وإنما يسقط المأثم ؛ قياسا على الصلاة ؛ لأنها ركعات متتابعات فإذا قطعها عذرا استأنف ولم يبن .\nالتاسعة عشرة : قوله تعالى : توبة من الله نصب على المصدر ، ومعناه رجوعا . وإنما مست حاجة المخطئ إلى التوبة لأنه لم يتحرز وكان من حقه أن يتحفظ . وقيل : أي فليأت بالصيام تخفيفا من الله تعالى عليه بقبول الصوم بدلا عن الرقبة ؛ ومنه قوله تعالى : علم الله أنكم كنتم تختانون أنفسكم فتاب عليكم أي خفف ، وقوله تعالى : علم أن لن تحصوه فتاب عليكم .\nالموفية عشرين : وكان الله أي في أزله وأبده . عليما بجميع المعلومات حكيما فيما حكم وأبرم .\n                                    ",
        "saadi": "وَمَا كَانَ لِمُؤۡمِنٍ أَن يَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَ‍ٔٗاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَ‍ٔٗا فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖ وَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦٓ إِلَّآ أَن يَصَّدَّقُواْۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوّٖ لَّكُمۡ وَهُوَ مُؤۡمِنٞ فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ وَإِن كَانَ مِن قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞ فَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦ وَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ تَوۡبَةٗ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا ٢٩\n                                        \n                                        \n                                        \n                                        هذه الصيغة من صيغ الامتناع، أي: يمتنع ويستحيل أن يصدر من مؤمن قتل مؤمن، أي: متعمدا، وفي هذا الإخبارُ بشدة تحريمه وأنه مناف للإيمان أشد منافاة، وإنما يصدر ذلك إما من كافر، أو من فاسق قد نقص إيمانه نقصا عظيما، ويخشى عليه ما هو أكبر من ذلك، فإن الإيمان الصحيح يمنع المؤمن من قتل أخيه الذي قد عقد الله بينه وبينه الأخوة الإيمانية التي من مقتضاها محبته وموالاته، وإزالة ما يعرض لأخيه من الأذى، وأي أذى أشد من القتل؟ وهذا يصدقه قوله صلى الله عليه وسلم: \"لا ترجعوا بعدي كفارًا يضرب بعضكم رقاب بعض\" فعلم أن القتل من الكفر العملي وأكبر الكبائر بعد الشرك بالله. ولما كان قوله: { وَمَا كَانَ لِمُؤْمِنٍ أَنْ يَقْتُلَ مُؤْمِنًا } لفظا عاما لجميع الأحوال، وأنه لا يصدر منه قتل أخيه بوجه من الوجوه، استثنى تعالى قتل الخطأ فقال: { إِلَّا خَطَأً } فإن المخطئ الذي لا يقصد القتل غير آثم، ولا مجترئ على محارم الله، ولكنه لما كان قد فعل فعلاً شنيعًا وصورته كافية في قبحه وإن لم يقصده أمر تعالى بالكفارة والدية فقال: { وَمَنْ قَتَلَ مُؤْمِنًا خَطَأً } سواء كان القاتل ذكرًا أو أنثى حرًّا أو عبدًا، صغيرًا أو كبيرًا، عاقلاً أو مجنونًا، مسلمًا أو كافرًا، كما يفيده لفظ \"مَنْ\" الدالة على العموم وهذا من أسرار الإتيان بـ \"مَنْ\" في هذا الموضع، فإن سياق الكلام يقتضي أن يقول: فإن قتله، ولكن هذا لفظ لا يشمل ما تشمله \"مَنْ\" وسواء كان المقتول ذكرًا أو أنثى، صغيرًا أو كبيرًا، كما يفيده التنكير في سياق الشرط، فإن على القاتل { تحرير رقبة مؤمنة } كفارة لذلك، تكون في ماله، ويشمل ذلك الصغير والكبير، والذكر والأنثى، والصحيح والمعيب، في قول بعض العلماء. ولكن الحكمة تقتضي أن لا يجزئ عتق المعيب في الكفارة؛ لأن المقصود بالعتق نفع العتيق، وملكه منافع نفسه، فإذا كان يضيع بعتقه، وبقاؤه في الرق أنفع له فإنه لا يجزئ عتقه، مع أن في قوله: { تحرير رقبة } ما يدل على ذلك؛ فإن التحرير: تخليص من استحقت منافعه لغيره أن تكون له، فإذا لم يكن فيه منافع لم يتصور وجود التحرير. فتأمل ذلك فإنه واضح. وأما الدية فإنها تجب على عاقلة القاتل في الخطأ وشبه العمد. { مُسَلَّمَةٌ إِلَى أَهْلِهِ } جبرًا لقلوبهم، والمراد بأهله هنا هم ورثته، فإن الورثة يرثون ما ترك، الميت، فالدية داخلة فيما ترك وللدية تفاصيل كثيرة مذكورة في كتب الفقه. وقوله: { إِلَّا أَنْ يَصَّدَّقُوا } أي: يتصدق ورثة القتيل بالعفو عن الدية، فإنها تسقط، وفي ذلك حث لهم على العفو لأن الله سماها صدقة، والصدقة مطلوبة في كل وقت. { فَإِنْ كَانَ } المقتول { مِنْ قَوْمٍ عَدُوٍّ لَكُمْ } أي: من كفار حربيين { وَهُوَ مُؤْمِنٌ فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ } أي: وليس عليكم لأهله دية، لعدم احترامهم في دمائهم وأموالهم. { وَإِنْ كَانَ } المقتول { مِنْ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ فَدِيَةٌ مُسَلَّمَةٌ إِلَى أَهْلِهِ وَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ } وذلك لاحترام أهله بما لهم من العهد والميثاق. { فَمَنْ لَمْ يَجِدْ } الرقبة ولا ثمنها، بأن كان معسرا بذلك، ليس عنده ما يفضل عن مؤنته وحوائجه الأصلية شيء يفي بالرقبة، { فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ } أي: لا يفطر بينهما من غير عذر، فإن أفطر لعذر فإن العذر لا يقطع التتابع، كالمرض والحيض ونحوهما. وإن كان لغير عذر انقطع التتابع ووجب عليه استئناف الصوم. { تَوْبَةً مِنَ اللَّهِ } أي: هذه الكفارات التي أوجبها الله على القاتل توبة من الله على عباده ورحمة بهم، وتكفير لما عساه أن يحصل منهم من تقصير وعدم احتراز، كما هو واقع كثيرًا للقاتل خطأ. { وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا } أي: كامل العلم كامل الحكمة، لا يخفى عليه مثقال ذرة في الأرض ولا في السماء، ولا أصغر من ذلك ولا أكبر، في أي وقت كان وأي محل كان. ولا يخرج عن حكمته من المخلوقات والشرائع شيء، بل كل ما خلقه وشرعه فهو متضمن لغاية الحكمة، ومن علمه وحكمته أن أوجب على القاتل كفارة مناسبة لما صدر منه، فإنه تسبب لإعدام نفس محترمة، وأخرجها من الوجود إلى العدم، فناسب أن يعتق رقبة ويخرجها من رق العبودية للخلق إلى الحرية التامة، فإن لم يجد هذه الرقبة صام شهرين متتابعين، فأخرج نفسه من رق الشهوات واللذات الحسية القاطعة للعبد عن سعادته الأبدية إلى التعبد لله تعالى بتركها تقربا إلى الله. ومدها تعالى بهذه المدة الكثيرة الشاقة في عددها ووجوب التتابع فيها، ولم يشرع الإطعام في هذا الموضع لعدم المناسبة. بخلاف الظهار، كما سيأتي إن شاء الله تعالى. ومن حكمته أن أوجب في القتل الدية ولو كان خطأ، لتكون رادعة وكافة عن كثير من القتل باستعمال الأسباب العاصمة عن ذلك. ومن حكمته أن وجبت على العاقلة في قتل الخطأ، بإجماع العلماء، لكون القاتل لم يذنب فيشق عليه أن يحمل هذه الدية الباهظة، فناسب أن يقوم بذلك من بينه وبينهم المعاونة والمناصرة والمساعدة على تحصيل المصالح وكف المفاسد [ولعل ذلك من أسباب منعهم لمن يعقلون عنه من القتل حذرًا من تحميلهم] ويخف عنهم بسبب توزيعه عليهم بقدر أحوالهم وطاقتهم، وخففت أيضا بتأجيلها عليهم ثلاث سنين. ومن حكمته وعلمه أن جبر أهل القتيل عن مصيبتهم، بالدية التي أوجبها على أولياء القاتل.\n                                    "
      },
      "originalText": "وَمَا كَانَ لِمُؤۡمِنٍ أَن يَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَ‍ٔٗاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَ‍ٔٗا فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖ وَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦٓ إِلَّآ أَن يَصَّدَّقُواْۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوّٖ لَّكُمۡ وَهُوَ مُؤۡمِنٞ فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ وَإِن كَانَ مِن قَوۡمِۢ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞ فَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦ وَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ تَوۡبَةٗ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا ٢٩"
    },
    {
      "number": 586,
      "text": "وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا وَغَضِبَ اللَّهُ عَلَيْهِ وَلَعَنَهُ وَأَعَدَّ لَهُ عَذَابًا عَظِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 93,
      "juz": 5,
      "manzil": 1,
      "page": 93,
      "ruku": 74,
      "hizbQuarter": 37,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَن يَقۡتُلۡ مُؤۡمِنٗا مُّتَعَمِّدٗا فَجَزَآؤُهُۥ جَهَنَّمُ خَٰلِدٗا فِيهَا وَغَضِبَ ٱللَّهُ عَلَيۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِيمٗا ٣٩\n                                    \n                                    \n                                    ثم لما بين تعالى حكم القتل الخطأ ، شرع في بيان حكم القتل العمد ، فقال : ( ومن يقتل مؤمنا متعمدا [ فجزاؤه جهنم خالدا فيها وغضب الله عليه ولعنه وأعد له عذابا عظيما ] ) وهذا تهديد شديد ووعيد أكيد لمن تعاطى هذا الذنب العظيم ، الذي هو مقرون بالشرك بالله في غير ما آية في كتاب الله ، حيث يقول ، سبحانه ، في سورة الفرقان : ( والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق [ ولا يزنون ] ) الآية [ الفرقان : 68 ] وقال تعالى : ( قل تعالوا أتل ما حرم ربكم عليكم ألا تشركوا به شيئا ) [ إلى أن قال :\n( ولا تقتلوا النفس التي حرم الله إلا بالحق ذلكم وصاكم به لعلكم تعقلون ) [ الأنعام : 151 ] .\nوالأحاديث في تحريم القتل كثيرة جدا . من ذلك ما ثبت في الصحيحين عن ابن مسعود قال : قال رسول الله صلى الله عليه وسلم : \" أول ما يقضى بين الناس يوم القيامة في الدماء \" وفي الحديث الآخر الذي رواه أبو داود ، من رواية عمرو بن الوليد بن عبدة المصري ، عن عبادة بن الصامت قال : قال رسول الله صلى الله عليه وسلم : \" لا يزال المؤمن معنقا صالحا ما لم يصب دما حراما ، فإذا أصاب دما حراما بلح \" وفي حديث آخر : \" لزوال الدنيا أهون عند الله من قتل رجل مسلم \" وفي الحديث الآخر : \" لو أجمع أهل السماوات والأرض على قتل رجل مسلم ، لأكبهم الله في النار \" وفي الحديث الآخر : \" من أعان على قتل مسلم ولو بشطر كلمة ، جاء يوم القيامة مكتوب بين عينيه : آيس من رحمة الله \" .\nوقد كان ابن عباس ، رضي الله عنهما ، يرى أنه لا توبة للقاتل عمدا لمؤمن .\nوقال البخاري : حدثنا آدم ، حدثنا شعبة ، حدثنا مغيرة بن النعمان قال : سمعت ابن جبير قال : اختلف فيها أهل الكوفة ، فرحلت إلى ابن عباس فسألته عنها فقال : نزلت هذه الآية : ( ومن يقتل مؤمنا متعمدا فجزاؤه جهنم [ خالدا ] ) هي آخر ما نزل وما نسخها شيء .\nوكذا رواه هو أيضا ومسلم والنسائي من طرق ، عن شعبة ، به ورواه أبو داود ، عن أحمد بن حنبل ، عن ابن مهدي ، عن سفيان الثوري ، عن مغيرة بن النعمان ، عن سعيد بن جبير ، عن ابن عباس في قوله : ( ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا ) فقال : لم ينسخها شيء .\n[ وقال ابن جرير : حدثنا ابن بشار حدثنا ابن أبي عدي حدثنا شعبة عن أبي بشر عن سعيد بن جبير قال : قال عبد الرحمن بن أبزى : سئل ابن عباس عن قوله : ( ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا ) فقال : لم ينسخها شيء ] وقال في هذه الآية : ( والذين لا يدعون مع الله إلها آخر [ ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما ] ) [ الفرقان : 68 ] قال نزلت في أهل الشرك .\nوقال ابن جرير : حدثنا ابن حميد ، حدثنا جرير ، عن منصور ، حدثني سعيد بن جبير - أو حدثني الحكم ، عن سعيد بن جبير - قال : سألت ابن عباس عن قوله [ تعالى ] ( ومن يقتل مؤمنا متعمدا فجزاؤه جهنم ) قال : إن الرجل إذا عرف الإسلام وشرائع الإسلام ، ثم قتل مؤمنا متعمدا ، فجزاؤه جهنم ولا توبة له . فذكرت ذلك لمجاهد فقال : إلا من ندم .\nحدثنا ابن حميد ، وابن وكيع قالا حدثنا جرير ، عن يحيى الجابر ، عن سالم بن أبي الجعد قال : كنا عند ابن عباس بعد ما كف بصره ، فأتاه رجل فناداه : يا عبد الله بن عباس ، ما ترى في رجل قتل مؤمنا متعمدا ؟ فقال : ( جزاؤه جهنم خالدا فيها وغضب الله عليه ولعنه وأعد له عذابا عظيما ) قال : أفرأيت إن تاب وعمل صالحا ثم اهتدى ؟ قال ابن عباس : ثكلته أمه ، وأنى له التوبة والهدى ؟ والذي نفسي بيده ! لقد سمعت نبيكم صلى الله عليه وسلم يقول : \" ثكلته أمه ، قاتل مؤمن متعمدا ، جاء يوم القيامة آخذه بيمينه أو بشماله ، تشخب أوداجه دما في قبل عرش الرحمن ، يلزم قاتله بشماله بيده الأخرى ، يقول : سل هذا فيم قتلني \" ؟ وايم الذي نفس عبد الله بيده ! لقد أنزلت هذه الآية ، فما نسختها من آية حتى قبض نبيكم صلى الله عليه وسلم ، وما نزل بعدها من برهان .\nوقال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، سمعت يحيى بن المجبر يحدث عن سالم بن أبي الجعد ، عن ابن عباس ; أن رجلا أتاه فقال : أرأيت رجلا قتل رجلا متعمدا ؟ فقال : ( جزاؤه جهنم خالدا فيها [ وغضب الله عليه ولعنه وأعد له عذابا عظيما ] ) قال : لقد نزلت في آخر ما نزل ، ما نسخها شيء حتى قبض رسول الله صلى الله عليه وسلم ، وما نزل وحي بعد رسول الله صلى الله عليه وسلم . قال : أرأيت إن تاب وآمن وعمل صالحا ثم اهتدى ؟ قال : وأنى له بالتوبة . وقد سمعت رسول الله صلى الله عليه وسلم . يقول : \" ثكلته أمه ، رجل قتل رجلا متعمدا ، يجيء يوم القيامة آخذا قاتله بيمينه أو بيساره - وآخذا رأسه بيمينه أو بشماله - تشخب أوداجه دما من قبل العرش يقول : يا رب ، سل عبدك فيم قتلني ؟ \" .\nوقد رواه النسائي عن قتيبة وابن ماجه عن محمد بن الصباح ، عن سفيان بن عيينة ، عن عمار الدهني ، ويحيى الجابر وثابت الثمالي عن سالم بن أبي الجعد ، عن ابن عباس ، فذكره وقد روي هذا عن ابن عباس من طرق كثيرة .\nوممن ذهب إلى أنه لا توبة له من السلف : زيد بن ثابت ، وأبو هريرة ، وعبد الله بن عمر ، وأبو سلمة بن عبد الرحمن ، وعبيد بن عمر ، والحسن ، وقتادة ، والضحاك بن مزاحم ، نقله ابن أبي حاتم .\nوفي الباب أحاديث كثيرة : من ذلك ما رواه أبو بكر بن مردويه الحافظ في تفسيره : حدثنا دعلج بن أحمد ، حدثنا محمد بن إبراهيم بن سعيد البوشنجي وحدثنا عبد الله بن جعفر ، حدثنا إبراهيم بن فهد قالا حدثنا عبيد بن عبيدة ، حدثنا معتمر بن سليمان ، عن أبيه ، عن الأعمش ، عن أبي عمرو بن شرحبيل ، عن عبد الله بن مسعود عن النبي صلى الله عليه وسلم قال : \" يجيء المقتول متعلقا بقاتله يوم القيامة ، آخذا رأسه بيده الأخرى فيقول : يا رب ، سل هذا فيم قتلني ؟ \" قال : \" فيقول : قتلته لتكون العزة لك . فيقول : فإنها لي \" . قال : \" ويجيء آخر متعلقا بقاتله فيقول : رب ، سل هذا فيم قتلني ؟ \" قال : \" فيقول قتلته لتكون العزة لفلان \" . قال : \" فإنها ليست له بؤ بإثمه \" . قال : \" فيهوي في النار سبعين خريفا \" .\nوقد رواه عن النسائي ، عن إبراهيم بن المستمر العوفي ، عن عمرو بن عاصم ، عن معتمر بن سليمان ، به\nحديث آخر : قال الإمام أحمد : حدثنا صفوان بن عيسى ، حدثنا ثور بن يزيد ، عن أبي عون ، عن أبي إدريس قال : سمعت معاوية ، رضي الله عنه ، يقول : سمعت رسول الله صلى الله عليه وسلم يقول : \" كل ذنب عسى الله أن يغفره إلا الرجل يموت كافرا ، أو الرجل يقتل مؤمنا متعمدا \" .\nوكذا رواه النسائي ، عن محمد بن المثنى ، عن صفوان بن عيسى ، به .\nوقال ابن مردويه : حدثنا عبد الله بن جعفر ، حدثنا سمويه ، حدثنا عبد الأعلى بن مسهر ، حدثنا صدقة بن خالد ، حدثنا خالد بن دهقان ، حدثنا ابن أبي زكريا قال : سمعت أم الدرداء تقول : سمعت أبا الدرداء يقول : سمعت رسول الله صلى الله عليه وسلم يقول : \" كل ذنب عسى الله أن يغفره إلا من مات مشركا ، أو من قتل مؤمنا متعمدا \" .\nوهذا غريب جدا من هذا الوجه . والمحفوظ حديث معاوية المتقدم فالله أعلم .\nثم روى ابن مردويه من طريق بقية بن الوليد ، عن نافع بن يزيد ، حدثني ابن جبير الأنصاري ، عن داود بن الحصين ، عن نافع ، عن ابن عمر ، عن النبي صلى الله عليه وسلم قال : \" من قتل مؤمنا متعمدا فقد كفر بالله عز وجل \" .\nوهذا حديث منكر أيضا ، وإسناده تكلم فيه جدا .\nوقال الإمام أحمد : حدثنا النضر ، حدثنا سليمان بن المغيرة ، حدثنا حميد قال : أتاني أبو العالية أنا وصاحب لي ، فقال لنا : هلما فأنتما أشب شيئا مني ، وأوعى للحديث مني ، فانطلق بنا إلى بشر بن عاصم - فقال له أبو العالية : حدث هؤلاء حديثك . فقال : حدثنا عقبة بن مالك الليثي قال : بعث النبي صلى الله عليه وسلم سرية ، فأغارت على قوم ، فشد من القوم رجل ، فاتبعه رجل من السرية شاهرا سيفه فقال الشاد من القوم : إني مسلم . فلم ينظر فيما قال ، فضربه فقتله ، فنمى الحديث إلى رسول الله صلى الله عليه وسلم فقال فيه قولا شديدا ، فبلغ القاتل . فبينا رسول الله صلى الله عليه وسلم يخطب ، إذ قال القاتل : والله ما قال الذي قال إلا تعوذا من القتل . قال : فأعرض رسول الله صلى الله عليه وسلم عنه وعمن قبله من الناس ، وأخذ في خطبته ، ثم قال أيضا : يا رسول الله ، ما قال الذي قال إلا تعوذا من القتل ، فأعرض عنه وعمن قبله من الناس ، وأخذ في خطبته ، ثم لم يصبر ، فقال الثالثة : والله يا رسول الله ما قال إلا تعوذا من القتل . فأقبل عليه رسول الله صلى الله عليه وسلم تعرف المساءة في وجهه ، فقال : \" إن الله أبى على من قتل مؤمنا \" ثلاثا .\nورواه النسائي من حديث سليمان بن المغيرة\nوالذي عليه الجمهور من سلف الأمة وخلفها : أن القاتل له توبة فيما بينه وبين ربه عز وجل ، فإن تاب وأناب وخشع وخضع ، وعمل عملا صالحا ، بدل الله سيئاته حسنات ، وعوض المقتول من ظلامته وأرضاه عن طلابته .\nقال الله تعالى : ( والذين لا يدعون مع الله إلها آخر [ ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما يضاعف له العذاب يوم القيامة ويخلد فيه مهانا ] . إلا من تاب وآمن وعمل عملا صالحا [ فأولئك يبدل الله سيئاتهم حسنات وكان الله غفورا رحيما ] ) [ الفرقان : 68 ، 69 ] وهذا خبر لا يجوز نسخه . وحمله على المشركين ، وحمل هذه الآية على المؤمنين خلاف الظاهر ، ويحتاج حمله إلى دليل ، والله أعلم .\nوقال تعالى : ( قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله [ إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم ] ) [ الزمر : 53 ] وهذا عام في جميع الذنوب ، من كفر وشرك ، وشك ونفاق ، وقتل وفسق ، وغير ذلك : كل من تاب من أي ذلك تاب الله عليه .\nوقال تعالى : ( إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء ) [ النساء : 48 ] . فهذه الآية عامة في جميع الذنوب ما عدا الشرك ، وهي مذكورة في هذه السورة الكريمة بعد هذه الآية وقبلها ، لتقوية الرجاء ، والله أعلم .\nوثبت في الصحيحين خبر الإسرائيلي الذي قتل مائة نفس ، ثم سأل عالما : هل لي من توبة ؟ فقال : ومن يحول بينك وبين التوبة ؟ ! ثم أرشده إلى بلد يعبد الله فيه ، فهاجر إليه ، فمات في الطريق ، فقبضته ملائكة الرحمة . كما ذكرناه غير مرة ، إن كان هذا في بني إسرائيل فلأن يكون في هذه الأمة التوبة مقبولة بطريق الأولى والأحرى ; لأن الله وضع عنا الأغلال والآصار التي كانت عليهم ، وبعث نبينا بالحنيفية السمحة . فأما الآية الكريمة ، وهي قوله تعالى : ( ومن يقتل مؤمنا متعمدا [ فجزاؤه جهنم خالدا فيها وغضب الله عليه ولعنه وأعد له عذابا عظيما ] ) فقد قال أبو هريرة وجماعة من السلف : هذا جزاؤه إن جازاه ، وقد رواه ابن مردويه مرفوعا ، من طريق محمد بن جامع العطار ، عن العلاء بن ميمون العنبري ، عن حجاج الأسود ، عن محمد بن سيرين ، عن أبي هريرة مرفوعا ، ولكن لا يصح ومعنى هذه الصيغة : أن هذا جزاؤه إن جوزي عليه ، وكذا كل وعيد على ذنب ، لكن قد يكون كذلك معارض من أعمال صالحة تمنع وصول ذلك الجزاء إليه ، على قولي أصحاب الموازنة أو الإحباط . وهذا أحسن ما يسلك في باب الوعيد ، والله أعلم بالصواب . وبتقدير دخول القاتل إلى النار ، أما على قول ابن عباس ومن وافقه أنه لا توبة له ، أو على قول الجمهور حيث لا عمل له صالحا ينجو به ، فليس يخلد فيها أبدا ، بل الخلود هو المكث الطويل . وقد تواردت الأحاديث عن رسول الله صلى الله عليه وسلم : أنه يخرج من النار من كان في قلبه أدنى ذرة من إيمان . وأما حديث معاوية : \" كل ذنب عسى الله أن يغفره إلا الرجل يموت كافرا ، أو الرجل يقتل مؤمنا متعمدا \" : \" عسى \" للترجي ، فإذا انتفى الترجي في هاتين الصورتين لا ينتفى وقوع ذلك في أحدهما ، وهو القتل ; لما ذكرنا من الأدلة . وأما من مات كافرا ; فالنص أنه لا يغفر له البتة ، وأما مطالبة المقتول القاتل يوم القيامة فإنه حق من حقوق الآدميين وهي لا تسقط بالتوبة ، ولا فرق بين المقتول والمسروق منه ، والمغصوب منه والمقذوف وسائر حقوق الآدميين ، فإن الإجماع منعقد على أنها لا تسقط بالتوبة ، ولا بد من أدائها إليهم في صحة التوبة ، فإن تعذر ذلك فلا بد من الطلابة يوم القيامة ، لكن لا يلزم من وقوع الطلابة وقوع المجازاة ، وقد يكون للقاتل أعمال صالحة تصرف إلى المقتول أو بعضها ، ثم يفضل له أجر يدخل به الجنة ، أو يعوض الله المقتول من فضله بما يشاء ، من قصور الجنة ونعيمها ، ورفع درجته فيها ونحو ذلك ، والله أعلم .\nثم للقتل العمد أحكام في الدنيا وأحكام في الآخرة أما [ في ] الدنيا فتسلط أولياء المقتول عليه ، قال الله تعالى : ( ومن قتل مظلوما فقد جعلنا لوليه سلطانا [ فلا يسرف في القتل إنه كان منصورا ] ) [ الإسراء : 33 ] ثم هم مخيرون بين أن يقتلوا ، أو يعفوا ، أو يأخذوا دية مغلظة أثلاثا : ثلاثون حقة ، وثلاثون جذعة ، وأربعون خلفة كما هو مقرر في كتب الأحكام .\nواختلف الأئمة : هل تجب عليه كفارة : عتق رقبة ، أو صيام شهرين متتابعين ، أو إطعام ؟ على أحد القولين ، كما تقدم في كفارة الخطأ ، على قولين : فالشافعي وأصحابه وطائفة من العلماء يقولون : نعم ، يجب عليه ; لأنه إذا وجبت الكفارة في الخطأ فلأن تجب عليه في العمد أولى . وطردوا هذا في كفارة اليمين الغموس ، واعتضدوا بقضاء الصلوات المتروكة عمدا ، كما أجمعوا على ذلك في الخطأ .\nقال أصحاب الإمام أحمد وآخرون : قتل العمد أعظم من أن يكفر ، فلا كفارة فيه ، وكذا اليمين الغموس ، ولا سبيل لهم إلى الفرق بين هاتين الصورتين وبين الصلاة المتروكة عمدا ، فإنهم يقولون : بوجوب قضائها وإن تركت عمدا .\nوقد احتج من ذهب إلى وجوب الكفارة في قتل العمد بما رواه الإمام أحمد حيث قال : حدثنا عارم بن الفضل ، حدثنا عبد الله بن المبارك ، عن إبراهيم بن أبي عبلة ، عن الغريف بن عياش ، عن واثلة بن الأسقع قال : أتى النبي صلى الله عليه وسلم نفر من بني سليم فقالوا : إن صاحبا لنا قد أوجب . قال : \" فليعتق رقبة ، يفدي الله بكل عضو منها عضوا منه من النار \" .\nوقال أحمد : حدثنا إبراهيم بن إسحاق ، حدثنا ضمرة بن ربيعة ، عن إبراهيم بن أبي عبلة عن الغريف الديلمي قال : أتينا واثلة بن الأسقع الليثي فقلنا : حدثنا حديثا سمعته من رسول الله صلى الله عليه وسلم قال : أتينا رسول الله صلى الله عليه وسلم في صاحب لنا قد أوجب ، فقال : \" أعتقوا عنه ، يعتق الله بكل عضو منه عضوا منه من النار \" .\nوكذا رواه أبو داود والنسائي ، من حديث إبراهيم بن أبي عبلة ، به ولفظ أبي داود عن الغريف الديلمي قال : أتينا واثلة بن الأسقع فقلنا : حدثنا حديثا ليس فيه زيادة ولا نقصان . فغضب فقال : إن أحدكم ليقرأ ومصحفه معلق في بيته فيزيد وينقص ، قلنا : إنا أردنا حديثا سمعته من رسول الله صلى الله عليه وسلم ، قال : أتينا رسول الله صلى الله عليه وسلم في صاحب لنا قد أوجب - يعني النار - بالقتل ، فقال : \" أعتقوا عنه ، يعتق الله بكل عضو منه عضوا من النار \" .\n                                    ",
        "qortoby": "وَمَن يَقۡتُلۡ مُؤۡمِنٗا مُّتَعَمِّدٗا فَجَزَآؤُهُۥ جَهَنَّمُ خَٰلِدٗا فِيهَا وَغَضِبَ ٱللَّهُ عَلَيۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِيمٗا ٣٩\n                                    \n                                    \n                                    قوله تعالى : ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها وغضب الله عليه ولعنه وأعد له عذابا عظيما\nفيه سبع مسائل :\nالأولى : قوله تعالى : ومن يقتل \" من \" شرط ، وجوابه فجزاؤه وسيأتي . واختلف العلماء في صفة المتعمد في القتل ؛ فقال عطاء والنخعي وغيرهما : هو من قتل بحديدة كالسيف والخنجر وسنان الرمح ونحو ذلك من المشحوذ المعد للقطع أو بما يعلم أن فيه الموت من ثقال الحجارة ونحوها . وقالت فرقة : المتعمد كل من قتل بحديدة كان القتل أو بحجر أو بعصا أو بغير ذلك ، وهذا قول الجمهور .\nالثانية : ذكر الله عز وجل في كتابه العمد والخطأ ولم يذكر شبه العمد وقد اختلف العلماء في القول به ، فقال ابن المنذر : أنكر ذلك مالك ، وقال : ليس في كتاب الله إلا العمد والخطأ . وذكره الخطابي أيضا عن مالك وزاد : وأما شبه العمد فلا نعرفه . قال أبو عمر : أنكر مالك والليث بن سعد شبه العمد ؛ فمن قتل عندهما بما لا يقتل مثله غالبا كالعضة واللطمة وضربة السوط والقضيب وشبه ذلك فإنه عمد وفيه القود . قال أبو عمر : وقال بقولهما جماعة من الصحابة والتابعين . وذهب جمهور فقهاء الأمصار إلى أن هذا كله شبه العمد . وقد ذكر عن مالك وقاله ابن وهب وجماعة من الصحابة والتابعين . قال ابن المنذر : وشبه العمد يعمل به عندنا . وممن أثبت شبه العمد الشعبي والحكم وحماد والنخعي وقتادة وسفيان الثوري وأهل العراق والشافعي ، وروينا ذلك عن عمر بن الخطاب وعلي بن أبي طالب رضي الله عنهما .\nقلت : وهو الصحيح ؛ فإن الدماء أحق ما احتيط لها إذ الأصل صيانتها في أهبها ، فلا تستباح إلا بأمرين لا إشكال فيه ، وهذا فيه إشكال ؛ لأنه لما كان مترددا بين العمد والخطأ حكم له بشبه العمد ؛ فالضرب مقصود والقتل غير مقصود ، وإنما وقع بغير القصد فيسقط القود وتغلظ الدية . وبمثل هذا جاءت السنة ؛ روى أبو داود من حديث عبد الله بن عمرو أن رسول الله صلى الله عليه وسلم قال : ألا إن دية الخطأ شبه العمد ما كان بالسوط والعصا مائة من الإبل منها أربعون في بطونها أولادها . وروى الدارقطني عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم : العمد قود اليد والخطأ عقل لا قود فيه ومن قتل في عمية بحجر أو عصا أو سوط فهو دية مغلظة في أسنان الإبل . وروي أيضا من حديث سليمان بن موسى عن عمرو بن شعيب عن أبيه عن جده قال : قال رسول الله صلى الله عليه وسلم : عقل شبه العمد مغلظ مثل قتل العمد ولا يقتل صاحبه . وهذا نص . وقال طاوس في الرجل يصاب في ماء الرميا في القتال بالعصا أو السوط أو الترامي بالحجارة يودى ولا يقتل به من أجل أنه لا يدرى ، من قاتله . وقال أحمد بن حنبل : العميا هو الأمر الأعمى للعصبية لا تستبين ما وجهه . وقال إسحاق : هذا في تحارج القوم وقتل بعضهم بعضا . فكأن أصله من التعمية وهو التلبيس ؛ ذكره الدارقطني\nمسألة : واختلف القائلون بشبه العمد في الدية المغلظة ، فقال عطاء والشافعي : هي ثلاثون حقة وثلاثون جذعة وأربعون خلفة . وقد روي هذا القول عن عمر وزيد بن ثابت والمغيرة بن شعبة وأبي موسى الأشعري ؛ وهو مذهب مالك حيث يقول بشبه العمد ، ومشهور مذهبه أنه لم يقل به إلا في مثل قصة المدلجي بابنه حيث ضربه بالسيف . وقيل : هي مربعة ربع بنات لبون ، وربع حقاق ، وربع جذاع ، وربع بنات مخاض . هذا قول النعمان ويعقوب ؛ وذكره أبو داود عن سفيان عن أبي إسحاق عن عاصم بن ضمرة عن علي . وقيل : هي مخمسة : عشرون بنت مخاض وعشرون بنت لبون وعشرون ابن لبون وعشرون حقة وعشرون جذعة ؛ هذا قول أبي ثور . وقيل : أربعون جذعة إلى بازل عامها وثلاثون حقة ، وثلاثون بنات لبون . وروي عن عثمان بن عفان وبه قال الحسن البصري وطاوس والزهري . وقيل : أربع وثلاثون خلفة إلى بازل عامها ، وثلاث وثلاثون حقة ، وثلاث وثلاثون جذعة ؛ وبه قال الشعبي والنخعي ، وذكره أبو داود عن أبي الأحوص عن أبي إسحاق عن عاصم بن ضمرة عن علي .\nالثالثة : واختلفوا فيمن تلزمه دية شبه العمد ؛ فقال الحارث العكلي وابن أبي ليلى وابن شبرمة وقتادة وأبو ثور : هو عليه في ماله . وقال الشعبي والنخعي والحكم والشافعي والثوري وأحمد وإسحاق وأصحاب الرأي : هو على العاقلة . قال ابن المنذر : قول الشعبي أصح ؛ لحديث أبي هريرة أن النبي صلى الله عليه وسلم جعل دية الجنين على عاقلة الضاربة .\nالرابعة : أجمع العلماء على أن العاقلة لا تحمل دية العمد وأنها في مال الجاني ؛ وقد تقدم ذكرها في \" البقرة \" . وقد أجمعوا على أن على القاتل خطأ الكفارة ؛ واختلفوا فيها في قتل العمد ؛ فكان مالك والشافعي يريان على قاتل العمد الكفارة كما في الخطأ . قال الشافعي : إذا وجبت الكفارة في الخطأ فلأن تجب في العمد أولى . وقال : إذا شرع السجود في السهو فلأن يشرع في العمد أولى ، وليس ما ذكره الله تعالى في كفارة العمد بمسقط ما قد وجب في الخطأ . وقد قيل : إن القاتل عمدا إنما تجب عليه الكفارة إذا عفي عنه فلم يقتل ، فأما إذا قتل قودا فلا كفارة عليه تؤخذ من ماله . وقيل تجب . ومن قتل نفسه فعليه الكفارة في ماله . وقال الثوري وأبو ثور وأصحاب الرأي : لا تجب الكفارة إلا حيث أوجبها الله تعالى . قال ابن المنذر : وكذلك نقول ؛ لأن الكفارات عبادات ولا يجوز التمثيل . وليس يجوز لأحد أن يفرض فرضا يلزمه عباد الله إلا بكتاب أو سنة أو إجماع ، وليس مع من فرض على القاتل عمدا كفارة حجة من حيث ذكرت .\nالخامسة : واختلفوا في الجماعة يقتلون الرجل خطأ ؛ فقالت طائفة : على كل واحد منهم الكفارة ؛ كذلك قال الحسن وعكرمة والنخعي والحارث العكلي ومالك والثوري والشافعي وأحمد وإسحاق وأبو ثور وأصحاب الرأي . وقالت طائفة : عليهم كلهم كفارة واحدة ؛ هكذا قال أبو ثور ، وحكي ذلك عن الأوزاعي . وفرق الزهري بين العتق والصوم ؛ فقال في الجماعة يرمون بالمنجنيق فيقتلون رجلا : عليهم كلهم عتق رقبة ، وإن كانوا لا يجدون فعلى كل واحد منهم صوم شهرين متتابعين .\nالسادسة : روى النسائي : أخبرنا الحسن بن إسحاق المروزي - ثقة قال : حدثنا خالد بن خداش قال : حدثنا حاتم بن إسماعيل عن بشير بن المهاجر عن عبد الله بن بريدة عن أبيه قال : قال رسول الله صلى الله عليه وسلم : قتل المؤمن أعظم عند الله من زوال الدنيا . وروي عن عبد الله قال : قال رسول الله : أول ما يحاسب به العبد الصلاة وأول ما يقضى بين الناس في الدماء . وروى إسماعيل بن إسحاق عن نافع بن جبير بن مطعم عن عبد الله بن عباس أنه سأل سائل فقال : يا أبا العباس ، هل للقاتل توبة ؟ فقال له ابن عباس كالمتعجب من مسألته : ماذا تقول ! مرتين أو ثلاثا . ثم قال ابن عباس : ويحك ! أنى له توبة ! سمعت نبيكم صلى الله عليه وسلم يقول : يأتي المقتول معلقا رأسه بإحدى يديه متلببا قاتله بيده الأخرى تشخب أوداجه دما حتى يوقفا فيقول المقتول لله سبحانه وتعالى رب هذا قتلني فيقول الله تعالى للقاتل تعست ويذهب به إلى النار . وعن الحسن قال : قال رسول الله صلى الله عليه وسلم : ما نازلت ربي في شيء ما نازلته في قتل المؤمن فلم يجبني .\nالسابعة : واختلف العلماء في قاتل العمد هل له من توبة ؟ فروى البخاري عن سعد بن جبير قال : اختلف فيها أهل الكوفة ، فرحلت فيها إلى ابن عباس ، فسألته عنها فقال : نزلت هذه الآية ومن يقتل مؤمنا متعمدا فجزاؤه جهنم هي آخر ما نزل وما نسخها شيء . وروى النسائي عنه قال : سألت ابن عباس هل لمن قتل مؤمنا متعمدا من توبة ؟ قال : لا . وقرأت عليه الآية التي في الفرقان : والذين لا يدعون مع الله إلها آخر قال : هذه آية مكية نسختها آية مدنية ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خالدا فيها وغضب الله عليه . وروي عن زيد بن ثابت نحوه ، وإن آية النساء نزلت بعد آية الفرقان بستة أشهر ، وفي رواية بثمانية أشهر ؛ ذكرهما النسائي عن زيد بن ثابت . وإلى عموم هذه الآية مع هذه الأخبار عن زيد وابن عباس ذهبت المعتزلة وقالوا : هذا مخصص عموم قوله تعالى : ويغفر ما دون ذلك لمن يشاء ورأوا أن الوعيد نافذ حتما على كل قاتل ؛ فجمعوا بين الآيتين بأن قالوا : التقدير ويغفر ما دون ذلك لمن يشاء إلا من قتل عمدا . وذهب جماعة من العلماء منهم . عبد الله بن عمر - وهو أيضا مروي عن زيد وابن عباس - إلى أن له توبة . روى يزيد بن هارون قال : أخبرنا أبو مالك الأشجعي عن سعد بن عبيدة قال : جاء رجل إلى ابن عباس فقال ألمن قتل مؤمنا متعمدا توبة ؟ قال : لا ، إلا النار ؛ قال : فلما ذهب قال له جلساؤه : أهكذا كنت تفتينا ؟ كنت تفتينا أن لمن قتل توبة مقبولة ؛ قال : إني لأحسبه رجلا مغضبا يريد أن يقتل مؤمنا . قال : فبعثوا في إثره فوجدوه كذلك . وهذا مذهب أهل السنة وهو الصحيح ، وإن هذه الآية مخصوصة ، ودليل التخصيص آيات وأخبار . وقد أجمعوا على أن الآية نزلت في مقيس بن صبابة ؛ وذلك أنه كان قد أسلم هو وأخوه هشام بن صبابة ؛ فوجد هشاما قتيلا في بني النجار فأخبر بذلك النبي صلى الله عليه وسلم ، فكتب له إليهم أن يدفعوا إليه قاتل أخيه وأرسل معه رجلا من بني فهر ؛ فقال بنو النجار : والله ما نعلم له قاتلا ولكنا نؤدي الدية ؛ فأعطوه مائة من الإبل ؛ ثم انصرفا راجعين إلى المدينة فعدا مقيس على الفهري فقتله بأخيه وأخذ الإبل وانصرف إلى مكة كافرا مرتدا ، وجعل ينشد :\nقتلت به فهرا وحملت عقله سراة بني النجار أرباب فارع حللت به وتري وأدركت ثورتي\nوكنت إلى الأوثان أول راجع\nفقال رسول الله صلى الله عليه وسلم : لا أؤمنه في حل ولا حرم . وأمر بقتله يوم فتح مكة وهو متعلق بالكعبة . وإذا ثبت هذا بنقل أهل التفسير وعلماء الدين فلا ينبغي أن يحمل على المسلمين ، ثم ليس الأخذ بظاهر الآية بأولى من الأخذ بظاهر قوله : إن الحسنات يذهبن السيئات ، وقوله تعالى : وهو الذي يقبل التوبة عن عباده وقوله : ويغفر ما دون ذلك لمن يشاء . والأخذ بالظاهرين تناقض فلا بد من التخصيص . ثم إن الجمع بين آية \" الفرقان \" وهذه الآية ممكن فلا نسخ ولا تعارض ، وذلك أن يحمل مطلق آية \" النساء \" على مقيد آية \" الفرقان \" فيكون معناه فجزاؤه كذا إلا من تاب ؛ لا سيما وقد اتحد الموجب وهو القتل والموجب وهو التواعد بالعقاب . وأما الأخبار فكثيرة كحديث عبادة بن الصامت الذي قال فيه : تبايعوني على ألا تشركوا بالله شيئا ولا تزنوا ولا تسرقوا ولا تقتلوا النفس التي حرم الله إلا بالحق فمن وفى منكم فأجره على الله ومن أصاب شيئا من ذلك فعوقب به فهو كفارة له ومن أصاب من ذلك شيئا فستره الله عليه فأمره إلى الله إن شاء عفا عنه وإن شاء عذبه . رواه الأئمة أخرجه الصحيحان . وكحديث أبي هريرة عن النبي صلى الله عليه وسلم في الذي قتل مائة نفس . أخرجه مسلم في صحيحه وابن ماجه في سننه وغيرهما إلى غير ذلك من الأخبار الثابتة . ثم إنهم قد أجمعوا معنا في الرجل يشهد عليه بالقتل ، ويقر بأنه قتل عمدا ، ويأتي السلطان الأولياء فيقام عليه الحد ويقتل قودا ، فهذا غير متبع في الآخرة ، والوعيد غير نافذ عليه إجماعا على مقتضى حديث عبادة ؛ فقد انكسر عليهم ما تعلقوا به من عموم قوله تعالى : ومن يقتل مؤمنا متعمدا فجزاؤه جهنم ودخله التخصيص بما ذكرنا ، وإذا كان كذلك فالوجه أن هذه الآية مخصوصة كما بينا ، أو تكون محمولة على ما حكي عن ابن عباس أنه قال : متعمدا معناه مستحلا لقتله ؛ فهذا أيضا يئول إلى الكفر إجماعا . وقالت جماعة : إن القاتل في المشيئة تاب أو لم يتب ؛ قاله أبو حنيفة وأصحابه . فإن قيل : إن قوله تعالى : فجزاؤه جهنم خالدا فيها وغضب الله عليه ولعنه دليل على كفره ؛ لأن الله تعالى لا يغضب إلا على كافر خارج من الإيمان . قلنا : هذا وعيد ، والخلف في الوعيد كرم ؛ كما قال :\nوإني متى أوعدته أو وعدته لمخلف إيعادي ومنجز موعدي\nوقد تقدم .\nجواب ثان : إن جازاه بذلك ؛ أي هو أهل لذلك ومستحقه لعظيم ذنبه . نص على هذا أبو مجلز لاحق بن حميد وأبو صالح وغيرهما . وروى أنس بن مالك عن رسول الله صلى الله عليه وسلم أنه قال : إذا وعد الله لعبد ثوابا فهو منجزه وإن أوعد له العقوبة فله المشيئة إن شاء عاقبه وإن شاء عفا عنه . وفي هذين التأويلين دخل ، أما الأول - فقال القشيري : وفي هذا نظر ؛ لأن كلام الرب لا يقبل الخلف إلا أن يراد بهذا تخصيص العام ؛ فهو إذا جائز في الكلام . وأما الثاني : وإن روي أنه مرفوع فقال النحاس : وهذا الوجه الغلط فيه بين ، وقد قال الله عز وجل : ذلك جزاؤهم جهنم بما كفروا ولم يقل أحد : إن جازاهم ؛ وهو خطأ في العربية لأن بعده وغضب الله عليه وهو محمول على معنى جازاه .\nوجواب ثالث : فجزاؤه جهنم إن لم يتب وأصر على الذنب حتى وافى ربه على الكفر بشؤم المعاصي . وذكر هبة الله في كتاب \" الناسخ والمنسوخ \" أن هذه الآية منسوخة بقوله تعالى : ويغفر ما دون ذلك لمن يشاء ، وقال : هذا إجماع الناس إلا ابن عباس وابن عمر فإنهما قالا هي محكمة . وفي هذا الذي قاله نظر ؛ لأنه موضع عموم وتخصيص لا موضع نسخ ؛ قاله ابن عطية .\nقلت : هذا حسن ؛ لأن النسخ لا يدخل الأخبار إنما المعنى فهو يجزيه . وقال النحاس في \" معاني القرآن \" له : القول فيه عند العلماء أهل النظر أنه محكم وأنه يجازيه إذا لم يتب ، فإن تاب فقد بين أمره بقوله : وإني لغفار لمن تاب فهذا لا يخرج عنه ، والخلود لا يقتضي الدوام قال الله تعالى : وما جعلنا لبشر من قبلك الخلد الآية . وقال تعالى : يحسب أن ماله أخلده وقال زهير :\nألا لا أرى على الحوادث باقيا ولا خالدا إلا الجبال الرواسيا\nوهذا كله يدل على أن الخلد يطلق على غير معنى التأبيد ؛ فإن هذا يزول بزوال الدنيا . وكذلك العرب تقول : لأخلدن فلانا في السجن ؛ والسجن ينقطع ويفنى ، وكذلك المسجون . ومثله قولهم في الدعاء : خلد الله ملكه وأبد أيامه . وقد تقدم هذا كله لفظا ومعنى . والحمد لله .\n                                    ",
        "saadi": "وَمَن يَقۡتُلۡ مُؤۡمِنٗا مُّتَعَمِّدٗا فَجَزَآؤُهُۥ جَهَنَّمُ خَٰلِدٗا فِيهَا وَغَضِبَ ٱللَّهُ عَلَيۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِيمٗا ٣٩\n                                        \n                                        \n                                        \n                                        تقدم أن الله أخبر أنه لا يصدر قتل المؤمن من المؤمن، وأن القتل من الكفر العملي، وذكر هنا وعيد القاتل عمدا، وعيدا ترجف له القلوب وتنصدع له الأفئدة، وتنزعج منه أولو العقول. فلم يرد في أنواع الكبائر أعظم من هذا الوعيد، بل ولا مثله، ألا وهو الإخبار بأن جزاءه جهنم، أي: فهذا الذنب العظيم قد انتهض وحده أن يجازى صاحبه بجهنم، بما فيها من العذاب العظيم، والخزي المهين، وسخط الجبار، وفوات الفوز والفلاح، وحصول الخيبة والخسار. فعياذًا بالله من كل سبب يبعد عن رحمته. وهذا الوعيد له حكم أمثاله من نصوص الوعيد، على بعض الكبائر والمعاصي بالخلود في النار، أو حرمان الجنة. وقد اختلف الأئمة رحمهم الله في تأويلها مع اتفاقهم على بطلان قول الخوارج والمعتزلة الذين يخلدونهم في النار ولو كانوا موحدين. والصواب في تأويلها ما قاله الإمام المحقق: شمس الدين بن القيم رحمه الله في \"المدارج\" فإنه قال - بعدما ذكر تأويلات الأئمة في ذلك وانتقدها فقال: وقالت فِرقَة: هذه النصوص وأمثالها مما ذكر فيه المقتضي للعقوبة، ولا يلزم من وجود مقتضي الحكم وجوده، فإن الحكم إنما يتم بوجود مقتضيه وانتفاء موانعه. وغاية هذه النصوص الإعلام بأن كذا سبب للعقوبة ومقتض لها، وقد قام الدليل على ذكر الموانع فبعضها بالإجماع، وبعضها بالنص. فالتوبة مانع بالإجماع، والتوحيد مانع بالنصوص المتواترة التي لا مدفع لها، والحسنات العظيمة الماحية مانعة، والمصائب الكبار المكفرة مانعة، وإقامة الحدود في الدنيا مانع بالنص، ولا سبيل إلى تعطيل هذه النصوص فلا بد من إعمال النصوص من الجانبين. ومن هنا قامت الموازنة بين الحسنات والسيئات، اعتبارًا بمقتضي العقاب ومانعه، وإعمالا لأرجحها. قالوا: وعلى هذا بناء مصالح الدارين ومفاسدهما. وعلى هذا بناء الأحكام الشرعية والأحكام القدرية، وهو مقتضى الحكمة السارية في الوجود، وبه ارتباط الأسباب ومسبباتها خلقا وأمرا، وقد جعل الله سبحانه لكل ضد ضدا يدافعه ويقاومه، ويكون الحكم للأغلب منهما. فالقوة مقتضية للصحة والعافية، وفساد الأخلاط وبغيها مانع من عمل الطبيعة، وفعل القوة والحكم للغالب منهما، وكذلك قوى الأدوية والأمراض. والعبد يكون فيه مقتض للصحة ومقتض للعطب، وأحدهما يمنع كمال تأثير الآخر ويقاومه، فإذا ترجح عليه وقهره كان التأثير له. ومِنْ هنا يعلم انقسام الخلق إلى مَنْ يدخل الجنة ولا يدخل النار، وعكسه، ومَنْ يدخل النار ثم يخرج منها ويكون مكثه فيها بحسب ما فيه من مقتضى المكث في سرعة الخروج وبطئه. ومن له بصيرة منورة يرى بها كل ما أخبر الله به في كتابه من أمر المعاد وتفاصيله، حتى كأنه يشاهده رأي عين. ويعلم أن هذا هو مقتضي إلهيته سبحانه، وربوبيته وعزته وحكمته وأنه يستحيل عليه خلاف ذلك، ونسبة ذلك إليه نسبة ما لا يليق به إليه، فيكون نسبة ذلك إلى بصيرته كنسبة الشمس والنجوم إلى بصره. وهذا يقين الإيمان، وهو الذي يحرق السيئات، كما تحرق النار الحطب، وصاحب هذا المقام من الإيمان يستحيل إصراره على السيئات، وإن وقعت منه وكثرت، فإن ما معه من نور الإيمان يأمره بتجديد التوبة كل وقت بالرجوع إلى الله في عدد أنفاسه، وهذا من أحب الخلق إلى الله. انتهى كلامه قدس الله روحه، وجزاه عن الإسلام والمسلمين خيرا.\n                                    "
      },
      "originalText": "وَمَن يَقۡتُلۡ مُؤۡمِنٗا مُّتَعَمِّدٗا فَجَزَآؤُهُۥ جَهَنَّمُ خَٰلِدٗا فِيهَا وَغَضِبَ ٱللَّهُ عَلَيۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِيمٗا ٣٩"
    },
    {
      "number": 587,
      "text": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا ضَرَبْتُمْ فِي سَبِيلِ اللَّهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ أَلْقَىٰ إِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا فَعِنْدَ اللَّهِ مَغَانِمُ كَثِيرَةٌ ۚ كَذَٰلِكَ كُنْتُمْ مِنْ قَبْلُ فَمَنَّ اللَّهُ عَلَيْكُمْ فَتَبَيَّنُوا ۚ إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 94,
      "juz": 5,
      "manzil": 1,
      "page": 93,
      "ruku": 74,
      "hizbQuarter": 37,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا ضَرَبۡتُمۡ فِي سَبِيلِ ٱللَّهِ فَتَبَيَّنُواْ وَلَا تَقُولُواْ لِمَنۡ أَلۡقَىٰٓ إِلَيۡكُمُ ٱلسَّلَٰمَ لَسۡتَ مُؤۡمِنٗا تَبۡتَغُونَ عَرَضَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِيرَةٞۚ كَذَٰلِكَ كُنتُم مِّن قَبۡلُ فَمَنَّ ٱللَّهُ عَلَيۡكُمۡ فَتَبَيَّنُوٓاْۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٤٩\n                                    \n                                    \n                                    قال الإمام أحمد : حدثنا يحيى بن أبي بكير ، وحسين بن محمد ، وخلف بن الوليد ، قالوا : حدثنا إسرائيل ، عن سماك ، عن عكرمة ، عن ابن عباس قال : مر رجل من بني سليم بنفر من أصحاب النبي صلى الله عليه وسلم وهو يسوق غنما له ، فسلم عليهم فقالوا : ما سلم علينا إلا ليتعوذ منا . فعمدوا إليه فقتلوه ، وأتوا بغنمه النبي صلى الله عليه وسلم فنزلت هذه الآية : ( يا أيها الذين آمنوا [ إذا ضربتم في سبيل الله فتبينوا ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا ] ) إلى آخرها .\nورواه الترمذي في التفسير ، عن عبد بن حميد ، عن عبد العزيز بن أبي رزمة ، عن إسرائيل ، به . وقال : هذا حديث حسن ، وفي الباب عن أسامة بن زيد . ورواه الحاكم من طريق عبيد الله بن موسى ، عن إسرائيل ، به . ثم قال : صحيح الإسناد ولم يخرجاه .\nورواه ابن جرير من حديث عبيد الله بن موسى وعبد الرحيم بن سليمان ، كلاهما عن إسرائيل ، به وقال في بعض كتبه غير التفسير - وقد رواه من طريق عبد الرحمن فقط - : وهذا خبر عندنا صحيح سنده ، وقد يجب أن يكون على مذهب الآخرين سقيما ، لعلل منها : أنه لا يعرف له مخرج عن سماك إلا من هذا الوجه ، ومنها : أن عكرمة في روايته عندهم نظر ، ومنها : أن الذي أنزلت فيه الآية مختلف فيه ، فقال بعضهم : أنزلت في محلم بن جثامة ، وقال بعضهم : أسامة بن زيد . وقيل غير ذلك .\nقلت : وهذا كلام غريب ، وهو مردود من وجوه أحدها : أنه ثابت عن سماك ، حدث به عنه غير واحد من الكبار . الثاني : أن عكرمة محتج به في الصحيح . الثالث : أنه مروي من غير هذا الوجه عن ابن عباس ، كما قال البخاري : حدثنا علي بن عبد الله ، حدثنا سفيان ، عن عمرو ، عن عطاء ، عن ابن عباس : ( ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا ) قال : قال ابن عباس : كان رجل في غنيمة له ، فلحقه المسلمون ، فقال : السلام عليكم . فقتلوه وأخذوا غنيمته [ فأنزل الله ذلك إلى قوله : ( تبتغون عرض الحياة الدنيا ) تلك الغنيمة . قرأ ابن عباس ( السلام ) وقال سعيد بن منصور : حدثنا سفيان عن عمرو بن دينار عن عطاء بن يسار عن ابن عباس قال : لحق المسلمون رجلا في غنيمة فقال : السلام عليكم ، فقتلوه وأخذوا غنيمته ] فنزلت : ( ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا )\nورواه ابن جرير وابن أبي حاتم ، من طريق سفيان بن عيينة ، به\nوأما قصة محلم بن جثامة فقال الإمام أحمد : حدثنا يعقوب ، حدثنا أبي ، عن محمد بن إسحاق ، حدثني يزيد بن عبد الله بن قسيط ، عن القعقاع بن عبد الله بن أبي حدرد عن أبيه عبد الله ابن أبي حدرد ، رضي الله عنه ، قال : بعثنا رسول الله صلى الله عليه وسلم إلى إضم ، فخرجت في نفر من المسلمين ، فيهم : أبو قتادة الحارث بن ربعي ، ومحلم بن جثامة بن قيس ، فخرجنا حتى إذا كنا ببطن مر بنا عامر بن الأضبط الأشجعي ، على قعود له ، معه متيع ووطب من لبن ، فلما مر بنا سلم علينا ، فأمسكنا عنه ، وحمل عليه محلم بن جثامة فقتله ، بشيء كان بينه وبينه ، وأخذ بعيره ومتيعه ، فلما قدمنا على رسول الله صلى الله عليه وسلم وأخبرناه الخبر ، نزل فينا القرآن : ( يا أيها الذين آمنوا إذا ضربتم في سبيل الله [ فتبينوا ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا تبتغون عرض الحياة الدنيا فعند الله مغانم كثيرة كذلك كنتم من قبل فمن الله عليكم فتبينوا إن الله كان بما تعملون ] خبيرا . )\nتفرد به أحمد\nوقال ابن جرير : حدثنا ابن وكيع ، حدثنا جرير ، عن ابن إسحاق ، عن نافع ; أن ابن عمر قال : بعث رسول الله صلى الله عليه وسلم محلم بن جثامة مبعثا ، فلقيهم عامر بن الأضبط ، فحياهم بتحية الإسلام وكانت بينهم حنة في الجاهلية ، فرماه محلم بسهم فقتله ، فجاء الخبر إلى رسول الله صلى الله عليه وسلم ، فتكلم فيه عيينة والأقرع ، فقال الأقرع : يا رسول الله ، سن اليوم وغير غدا . فقال عيينة : لا والله ، حتى تذوق نساؤه من الثكل ما ذاق نسائي . فجاء محلم في بردين ، فجلس بين يدي رسول الله صلى الله عليه وسلم ليستغفر له ، فقال رسول الله صلى الله عليه وسلم : \" لا غفر الله لك \" . فقام وهو يتلقى دموعه ببرديه ، فما مضت له سابعة حتى مات ، ودفنوه ، فلفظته الأرض ، فجاءوا إلى النبي صلى الله عليه وسلم فذكروا ذلك له ، فقال : \" إن الأرض تقبل من هو شر من صاحبكم ، ولكن الله أراد أن يعظكم من حرمتكم \" ثم طرحوه بين صدفي جبل وألقوا عليه الحجارة ، ونزلت : ( يا أيها الذين آمنوا إذا ضربتم في سبيل الله فتبينوا ) الآية .\nوقال البخاري : قال حبيب بن أبي عمرة ، عن سعيد ، عن ابن عباس قال : قال رسول الله صلى الله عليه وسلم للمقداد : \" إذا كان رجل مؤمن يخفي إيمانه مع قوم كفار ، فأظهر إيمانه فقتلته ، فكذلك كنت أنت تخفي إيمانك بمكة من قبل \" .\nهكذا ذكر البخاري هذا الحديث معلقا مختصرا وقد روي مطولا موصولا فقال الحافظ أبو بكر البزار :\nحدثنا أحمد بن علي البغدادي ، حدثنا جعفر بن سلمة ، حدثنا أبو بكر بن علي بن مقدم ، حدثنا حبيب بن أبي عمرة ، عن سعيد بن جبير ، عن ابن عباس قال : بعث رسول الله صلى الله عليه وسلم سرية ، فيها المقداد بن الأسود ، فلما أتوا القوم وجدوهم قد تفرقوا ، وبقي رجل له مال كثير لم يبرح فقال : أشهد أن لا إله إلا الله . وأهوى إليه المقداد فقتله ، فقال له رجل من أصحابه : أقتلت رجلا شهد أن لا إله إلا الله ؟ والله لأذكرن ذلك للنبي صلى الله عليه وسلم . فلما قدموا على رسول الله صلى الله عليه وسلم قالوا : يا رسول الله ، إن رجلا شهد أن لا إله إلا الله ، فقتله المقداد . فقال : \" ادعوا لي المقداد . يا مقداد ، أقتلت رجلا يقول : لا إله إلا الله ، فكيف لك بلا إله إلا الله غدا ؟ \" . قال : فأنزل الله : ( يا أيها الذين آمنوا إذا ضربتم في سبيل الله فتبينوا ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا تبتغون عرض الحياة الدنيا فعند الله مغانم كثيرة كذلك كنتم من قبل فمن الله عليكم فتبينوا ) فقال رسول الله صلى الله عليه وسلم للمقداد : \" كان رجل مؤمن يخفي إيمانه مع قوم كفار ، فأظهر إيمانه ، فقتلته ، وكذلك كنت تخفي إيمانك بمكة قبل \" .\nوقوله : ( فعند الله مغانم كثيرة ) أي : خير مما رغبتم فيه من عرض الحياة الدنيا الذي حملكم على قتل مثل هذا الذي ألقى إليكم السلام ، وأظهر إليكم الإيمان ، فتغافلتم عنه ، واتهمتموه بالمصانعة والتقية ; لتبتغوا عرض الحياة الدنيا ، فما عند الله من المغانم الحلال خير لكم من مال هذا .\nوقوله : ( كذلك كنتم من قبل فمن الله عليكم ) أي : قد كنتم من قبل هذه الحال كهذا الذي يسر إيمانه ويخفيه من قومه ، كما تقدم في الحديث المرفوع آنفا ، وكما قال تعالى : ( واذكروا إذ أنتم قليل مستضعفون في الأرض [ تخافون أن يتخطفكم الناس فآواكم وأيدكم بنصره ] ) الآية [ الأنفال : 26 ] ، وهذا هو مذهب سعيد بن جبير ، كما رواه الثوري ، عن حبيب بن أبي عمرة ، عن سعيد بن جبير في قوله : ( كذلك كنتم من قبل ) تخفون إيمانكم في المشركين .\nورواه عبد الرزاق ، عن ابن جريج ، أخبرني عبد الله بن كثير ، عن سعيد بن جبير في قوله : ( كذلك كنتم من قبل ) تستخفون بإيمانكم ، كما استخفى هذا الراعي بإيمانه .\nوهذا اختيار ابن جرير . وقال ابن أبي حاتم : وذكر عن قيس ، عن سالم ، عن سعيد بن جبير قوله : ( كذلك كنتم من قبل ) [ تورعون عن مثل هذا ، وقال الثوري عن منصور ، عن أبي الضحى ، عن مسروق : ( كذلك كنتم من قبل ) ] لم تكونوا مؤمنين ( فمن الله عليكم [ فتبينوا ) وقال السدي : ( فمن الله عليكم ) ] أي : تاب عليكم ، فحلف أسامة لا يقتل رجلا يقول : \" لا إله إلا الله \" بعد ذلك الرجل ، وما لقي من رسول الله صلى الله عليه وسلم فيه .\nوقوله : ( فتبينوا ) تأكيد لما تقدم . وقوله : ( إن الله كان بما تعملون خبيرا ) قال سعيد بن جبير : هذا تهديد ووعيد .\n                                    ",
        "qortoby": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا ضَرَبۡتُمۡ فِي سَبِيلِ ٱللَّهِ فَتَبَيَّنُواْ وَلَا تَقُولُواْ لِمَنۡ أَلۡقَىٰٓ إِلَيۡكُمُ ٱلسَّلَٰمَ لَسۡتَ مُؤۡمِنٗا تَبۡتَغُونَ عَرَضَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِيرَةٞۚ كَذَٰلِكَ كُنتُم مِّن قَبۡلُ فَمَنَّ ٱللَّهُ عَلَيۡكُمۡ فَتَبَيَّنُوٓاْۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٤٩\n                                    \n                                    \n                                    قوله تعالى : يا أيها الذين آمنوا إذا ضربتم في سبيل الله فتبينوا ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا تبتغون عرض الحياة الدنيا فعند الله مغانم كثيرة كذلك كنتم من قبل فمن الله عليكم فتبينوا إن الله كان بما تعملون خبيرا\nفيه إحدى عشرة مسألة :\nالأولى : قوله تعالى : ياأيها الذين آمنوا إذا ضربتم في سبيل الله فتبينوا هذا متصل بذكر القتل والجهاد . والضرب : السير في الأرض ؛ تقول العرب : ضربت في الأرض إذا سرت لتجارة أو غزو أو غيره ؛ مقترنة بفي . وتقول : ضربت الأرض دون \" في \" إذا قصدت قضاء حاجة الإنسان ؛ ومنه قول النبي صلى الله عليه وسلم : لا يخرج الرجلان يضربان الغائط يتحدثان كاشفين عن فرجيهما فإن الله يمقت على ذلك . وهذه الآية نزلت في قوم من المسلمين مروا في سفرهم برجل معه جمل وغنيمة يبيعها فسلم على القوم وقال : لا إله إلا الله محمد رسول الله ؛ فحمل عليه أحدهم فقتله . فلما ذكر ذلك للنبي صلى الله عليه وسلم شق عليه ونزلت الآية . وأخرجه البخاري عن عطاء عن ابن عباس قال : قال ابن عباس : كان رجل في غنيمة له فلحقه المسلمون فقال : السلام عليكم ، فقتلوه وأخذوا غنيمته ؛ فأنزل الله تعالى ذلك إلى قوله : عرض الحياة الدنيا تلك الغنيمة . قال : قرأ ابن عباس \" السلام \" . في غير البخاري : وحمل رسول الله صلى الله عليه وسلم ديته إلى أهله ورد عليه غنيماته . واختلف في تعيين القاتل والمقتول في هذه النازلة ، فالذي عليه الأكثر وهو في سير ابن إسحاق ومصنف أبي داود والاستيعاب لابن عبد البر أن القاتل محلم بن جثامة ، والمقتول عامر بن الأضبط فدعا عليه السلام على محلم فما عاش بعد ذلك إلا سبعا ثم دفن فلم تقبله الأرض ثم دفن فلم تقبله ثم دفن ثالثة فلم تقبله ؛ فلما رأوا أن الأرض لا تقبله ألقوه في بعض تلك الشعاب ؛ وقال عليه السلام : إن الأرض لتقبل من هو شر منه . قال الحسن : أما إنها تحبس من هو شر منه ولكنه وعظ القوم ألا يعودوا . وفي سنن ابن ماجه عن عمران بن حصين قال : بعث رسول الله صلى الله عليه وسلم جيشا من المسلمين إلى المشركين فقاتلوهم قتالا شديدا ، فمنحوهم أكتافهم فحمل رجل من لحمتي على رجل من المشركين بالرمح فلما غشيه قال : أشهد أن لا إله إلا الله ؛ إني مسلم ؛ فطعنه فقتله ؛ فأتى رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، هلكت ! قال : وما الذي صنعت ؟ مرة أو مرتين ، فأخبره بالذي صنع . فقال له رسول الله صلى الله عليه وسلم : فهلا شققت عن بطنه فعلمت ما في قلبه فقال : يا رسول الله لو شققت بطنه أكنت أعلم ما في قلبه ؟ قال : لا فلا أنت قبلت ما تكلم به ولا أنت تعلم ما في قلبه . فسكت عنه رسول الله صلى الله عليه وسلم فلم يلبث إلا يسيرا حتى مات فدفناه ، فأصبح على وجه الأرض . فقلنا : لعل عدوا نبشه ، فدفناه ثم أمرنا غلماننا يحرسونه فأصبح على ظهر الأرض . فقلنا : لعل الغلمان نعسوا ، فدفناه ثم حرسناه بأنفسنا فأصبح على ظهر الأرض ، فألقيناه في بعض تلك الشعاب . وقيل : إن القاتل أسامة بن زيد والمقتول مرداس بن نهيك الغطفاني ثم الفزاري من بني مرة من أهل فدك . وقال ابن القاسم عن مالك . وقيل : كان مرداس هذا قد أسلم من الليلة وأخبر بذلك أهله ؛ ولما عظم النبي صلى الله عليه وسلم الأمر على أسامة حلف عند ذلك ألا يقاتل رجلا يقول : لا إله إلا الله . وقد تقدم القول فيه . وقيل : القاتل أبو قتادة . وقيل : أبو الدرداء . ولا خلاف أن الذي لفظته الأرض حين مات هو محلم الذي ذكرناه . ولعل هذه الأحوال جرت في زمان متقارب فنزلت الآية في الجميع . وقد روي أن النبي صلى الله عليه وسلم رد على أهل المسلم الغنم والجمل وحمل ديته على طريق الائتلاف والله أعلم . وذكر الثعلبي أن أمير تلك السرية رجل يقال له غالب بن فضالة الليثي . وقيل : المقداد حكاه السهيلي .\nالثانية : قوله تعالى : \" فتبينوا \" أي : تأملوا . و \" تبينوا \" قراءة الجماعة ، وهو اختيار أبي عبيد وأبي حاتم ، وقالا : من أمر بالتبين فقد أمر بالتثبيت ؛ يقال : تبينت الأمر وتبين الأمر بنفسه ، فهو متعد ولازم . وقرأ حمزة \" فتثبتوا \" من التثبت بالثاء مثلثة وبعدها باء بواحدة \" وتبينوا \" في هذا أوكد ؛ لأن الإنسان قد يتثبت ولا يبين . وفي إذا معنى الشرط ، فلذلك دخلت الفاء في قوله فتبينوا . وقد يجازى بها كما قال :\nوإذا تصبك خصاصة فتجمل\nوالجيد ألا يجازى بها كما قال الشاعر :\nوالنفس راغبة إذا رغبتها وإذا ترد إلى قليل تقنع\nوالتبين التثبت في القتل واجب حضرا وسفرا ولا خلاف فيه ، وإنما خص السفر بالذكر لأن الحادثة التي فيها نزلت الآية وقعت في السفر .\nالثالثة : قوله تعالى : ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا السلم والسلم ، والسلام واحد ، قاله البخاري . وقرئ بها كلها . واختار أبو عبيد القاسم بن سلام \" السلام \" . وخالفه أهل النظر فقالوا : \" السلم \" هاهنا أشبه ؛ لأنه بمعنى الانقياد والتسليم ، كما قال عز وجل : فألقوا السلم ما كنا نعمل من سوء فالسلم الاستسلام والانقياد . أي لا تقولوا لمن ألقى بيده واستسلم لكم وأظهر دعوتكم لست مؤمنا . وقيل : السلام قول السلام عليكم ، وهو راجع إلى الأول ؛ لأن سلامه بتحية الإسلام مؤذن بطاعته وانقياده ، ويحتمل أن يراد به الانحياز والترك . قال الأخفش : يقال فلان سلام إذا كان لا يخالط أحدا . والسلم ( بشد السين وكسرها وسكون اللام ) الصلح .\nالرابعة : وروي عن أبي جعفر أنه قرأ \" لست مؤمنا \" بفتح الميم الثانية ، من آمنته إذا أجرته فهو مؤمن .\nالخامسة : والمسلم إذا لقي الكافر ولا عهد له جاز له قتله ؛ فإن قال : لا إله إلا الله لم يجز قتله ؛ لأنه قد اعتصم بعصام الإسلام المانع من دمه وماله وأهله : فإن قتله بعد ذلك قتل به . وإنما سقط القتل عن هؤلاء لأجل أنهم كانوا في صدر الإسلام وتأولوا أنه قالها متعوذا وخوفا من السلاح ، وأن العاصم قولها مطمئنا ، فأخبر النبي صلى الله عليه وسلم أنه عاصم كيفما قالها ؛ ولذلك قال لأسامة : أفلا شققت عن قلبه حتى تعلم أقالها أم لا أخرجه مسلم . أي تنظر أصادق هو في قوله أم كاذب ؟ وذلك لا يمكن فلم يبق إلا أن يبين عنه لسانه . وفي هذا من الفقه باب عظيم ، وهو أن الأحكام تناط بالمظان والظواهر لا على القطع واطلاع السرائر .\nالسادسة : فإن قال : سلام عليكم فلا ينبغي أن يقتل أيضا حتى يعلم ما وراء هذا ؛ لأنه موضع إشكال . وقد قال مالك في الكافر يوجد فيقول : جئت مستأمنا أطلب الأمان : هذه أمور مشكلة ، وأرى أن يرد إلى مأمنه ولا يحكم له بحكم الإسلام ؛ لأن الكفر قد ثبت له فلا بد أن يظهر منه ما يدل على قوله ، ولا يكفي أن يقول أنا مسلم ولا أنا مؤمن ولا أن يصلي حتى يتكلم بالكلمة العاصمة التي علق النبي صلى الله عليه وسلم الحكم بها عليه في قوله : أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله .\nالسابعة : فإن صلى أو فعل فعلا من خصائص الإسلام فقد اختلف فيه علماؤنا ؛ فقال ابن العربي : نرى أنه لا يكون بذلك مسلما ، أما أنه يقال له : ما وراء هذه الصلاة ؟ فإن قال : صلاة مسلم ، قيل له : قل لا إله إلا الله ؛ فإن قالها تبين صدقه ، وإن أبى علمنا أن ذلك تلاعب ، وكانت عند من يرى إسلامه ردة ، والصحيح أنه كفر أصلي ليس بردة . وكذلك هذا الذي قال : سلام عليكم ، يكلف الكلمة ، فإن قالها تحقق رشاده ، وإن أبى تبين عناده وقتل . وهذا معنى قوله : فتبينوا أي الأمر المشكل ، أو \" تثبتوا \" ولا تعجلوا المعنيان سواء . فإن قتله أحد فقد أتى منهيا عنه . فإن قيل : فتغليظ النبي صلى الله عليه وسلم على محلم ، ونبذه من قبره كيف مخرجه ؟ قلنا : لأنه علم من نيته أنه لم يبال بإسلامه فقتله متعمدا لأجل الحنة التي كانت بينهما في الجاهلية .\nالثامنة : قوله تعالى : تبتغون عرض الحياة أي تبتغون أخذ ماله : ويسمى متاع الدنيا عرضا لأنه عارض زائل غير ثابت . قال أبو عبيدة : يقال جميع متاع الحياة الدنيا عرض بفتح الراء ؛ ومنه : ( الدنيا عرض حاضر يأكل منها البر والفاجر ) . والعرض ( بسكون الراء ) ما سوى الدنانير والدراهم ؛ فكل عرض عرض ، وليس كل عرض عرضا . وفي صحيح مسلم عن النبي صلى الله عليه وسلم : ليس الغنى عن كثرة العرض إنما الغنى غنى النفس . وقد أخذ بعض العلماء هذا المعنى فنظمه :\nتقنع بما يكفيك واستعمل الرضا فإنك لا تدري أتصبح أم تمسي\nفليس الغنى عن كثرة المال إنما يكون الغنى والفقر من قبل النفس\nوهذا يصحح قول أبي عبيدة : فإن المال يشمل كل ما يتمول . وفي كتاب العين : العرض ما نيل من الدنيا ؛ ومنه قوله تعالى : تريدون عرض الدنيا وجمعه عروض . وفي المجمل لابن فارس : والعرض ما يعترض الإنسان من مرض أو نحوه وعرض الدنيا ما كان فيها من مال قل أو كثر . والعرض من الأثاث ما كان غير نقد . وأعرض الشيء إذا ظهر وأمكن . والعرض خلاف الطول .\nالتاسعة : قوله تعالى : فعند الله مغانم كثيرة عدة من الله تعالى بما يأتي به على وجهه ومن حله دون ارتكاب محظور ، أي فلا تتهافتوا . كذلك كنتم من قبل أي كذلك كنتم تخفون إيمانكم عن قومكم خوفا منكم على أنفسكم حتى من الله عليكم بإعزاز الدين وغلبة المشركين ، فهم الآن كذلك كل واحد منهم في قومه متربص أن يصل إليكم ، فلا يصلح إذ وصل إليكم أن تقتلوه حتى تتبينوا أمره . وقال ابن زيد : المعنى كذلك كنتم كفرة فمن الله عليكم بأن أسلمتم فلا تنكروا أن يكون هو كذلك ثم يسلم لحينه حين لقيكم فيجب أن تتثبتوا في أمره .\nالعاشرة : استدل بهذه الآية من قال : إن الإيمان هو القول ، لقوله تعالى : ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا . قالوا : ولما منع أن يقال لمن قال لا إله إلا الله لست مؤمنا منع من قتلهم بمجرد القول . ولولا الإيمان الذي هو هذا القول لم يعب قولهم . قلنا : إنما شك القوم في حالة أن يكون هذا القول منه تعوذا فقتلوه ، والله لم يجعل لعباده غير الحكم بالظاهر ؛ وقد قال صلى الله عليه وسلم : أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله وليس في ذلك أن الإيمان هو الإقرار فقط ؛ ألا ترى أن المنافقين كانوا يقولون هذا القول وليسوا بمؤمنين حسب ما تقدم بيانه في \" البقرة \" وقد كشف البيان في هذا قوله عليه السلام : أفلا شققت عن قلبه ؟ فثبت أن الإيمان هو الإقرار وغيره ، وأن حقيقته التصديق بالقلب ، ولكن ليس للعبد طريق إليه إلا ما سمع منه فقط . واستدل بهذا أيضا من قال : إن الزنديق تقبل توبته إذا أظهر الإسلام ؛ قال : لأن الله تعالى لم يفرق بين الزنديق وغيره متى أظهر الإسلام . وقد مضى القول في هذا في أول البقرة . وفيها رد على القدرية ، فإن الله تعالى أخبر أنه من على المؤمنين من بين جميع الخلق بأن خصهم بالتوفيق ، والقدرية تقول : خلقهم كلهم للإيمان . ولو كان كما زعموا لما كان لاختصاص المؤمنين بالمنة من بين الخلق معنى .\nالحادية عشرة : قوله تعالى : فتبينوا أعاد الأمر بالتبيين للتأكيد . إن الله كان بما تعملون خبيرا تحذير عن مخالفة أمر الله ؛ أي احفظوا أنفسكم وجنبوها الزلل الموبق لكم .\n                                    ",
        "saadi": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا ضَرَبۡتُمۡ فِي سَبِيلِ ٱللَّهِ فَتَبَيَّنُواْ وَلَا تَقُولُواْ لِمَنۡ أَلۡقَىٰٓ إِلَيۡكُمُ ٱلسَّلَٰمَ لَسۡتَ مُؤۡمِنٗا تَبۡتَغُونَ عَرَضَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِيرَةٞۚ كَذَٰلِكَ كُنتُم مِّن قَبۡلُ فَمَنَّ ٱللَّهُ عَلَيۡكُمۡ فَتَبَيَّنُوٓاْۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٤٩\n                                        \n                                        \n                                        \n                                        يأمر تعالى عباده المؤمنين إذا خرجوا جهادًا في سبيله وابتغاء مرضاته أن يتبينوا ويتثبتوا في جميع أمورهم المشتبهة. فإن الأمور قسمان: واضحة وغير واضحة. فالواضحة البيِّنة لا تحتاج إلى تثبت وتبين، لأن ذلك تحصيل حاصل. وأما الأمور المشكلة غير الواضحة فإن الإنسان يحتاج إلى التثبت فيها والتبين، ليعرف هل يقدم عليها أم لا؟ فإن التثبت في هذه الأمور يحصل فيه من الفوائد الكثيرة، والكف لشرور عظيمة، ما به يعرف دين العبد وعقله ورزانته، بخلاف المستعجل للأمور في بدايتها قبل أن يتبين له حكمها، فإن ذلك يؤدي إلى ما لا ينبغي، كما جرى لهؤلاء الذين عاتبهم الله في الآية لمـَّا لم يتثبتوا وقتلوا من سلم عليهم، وكان معه غنيمة له أو مال غيره، ظنًّا أنه يستكفي بذلك قتلَهم، وكان هذا خطأ في نفس الأمر، فلهذا عاتبهم بقوله: { وَلَا تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا فَعِنْدَ اللَّهِ مَغَانِمُ كَثِيرَةٌ } أي: فلا يحملنكم العرض الفاني القليل على ارتكاب ما لا ينبغي فيفوتكم ما عند الله من الثواب الجزيل الباقي، فما عند الله خير وأبقى. وفي هذا إشارة إلى أن العبد ينبغي له إذا رأى دواعي نفسه مائلة إلى حالة له فيها هوى وهي مضرة له، أن يُذَكِّرها ما أعد الله لمن نهى نفسه عن هواها، وقدَّم مرضاة الله على رضا نفسه، فإن في ذلك ترغيبًا للنفس في امتثال أمر الله، وإن شق ذلك عليها. ثم قال تعالى مذكرًا لهم بحالهم الأولى، قبل هدايتهم إلى الإسلام: { كَذَلِكَ كُنْتُمْ مِنْ قَبْلُ فَمَنَّ اللَّهُ عَلَيْكُمْ } أي: فكما هداكم بعد ضلالكم فكذلك يهدي غيركم، وكما أن الهداية حصلت لكم شيئًا فشيئًا، فكذلك غيركم. فنظر الكامل لحاله الأولى الناقصة، ومعاملته لمن كان على مثلها بمقتضى ما يعرف من حاله الأولى، ودعاؤه له بالحكمة والموعظة الحسنة - من أكبر الأسباب لنفعه وانتفاعه، ولهذا أعاد الأمر بالتبين فقال: { فَتَبَيَّنُوا } فإذا كان من خرج للجهاد في سبيل الله، ومجاهدة أعداء الله، وقد استعد بأنواع الاستعداد للإيقاع بهم، مأمورًا بالتبين لمن ألقى إليه السلام، وكانت القرينة قوية في أنه إنما سلم تعوذا من القتل وخوفا على نفسه - فإن ذلك يدل على الأمر بالتبين والتثبت في كل الأحوال التي يقع فيها نوع اشتباه، فيتثبت فيها العبد، حتى يتضح له الأمر ويتبين الرشد والصواب. { إِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا } فيجازي كُلًّا ما عمله ونواه، بحسب ما علمه من أحوال عباده ونياتهم.\n                                    "
      },
      "originalText": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا ضَرَبۡتُمۡ فِي سَبِيلِ ٱللَّهِ فَتَبَيَّنُواْ وَلَا تَقُولُواْ لِمَنۡ أَلۡقَىٰٓ إِلَيۡكُمُ ٱلسَّلَٰمَ لَسۡتَ مُؤۡمِنٗا تَبۡتَغُونَ عَرَضَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِيرَةٞۚ كَذَٰلِكَ كُنتُم مِّن قَبۡلُ فَمَنَّ ٱللَّهُ عَلَيۡكُمۡ فَتَبَيَّنُوٓاْۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٤٩"
    }
  ]
}