{
  "number": 95,
  "ayahsNumber": 4,
  "ayahs": [
    {
      "number": 595,
      "text": "وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ وَلْيَأْخُذُوا أَسْلِحَتَهُمْ فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَىٰ لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ وَلْيَأْخُذُوا حِذْرَهُمْ وَأَسْلِحَتَهُمْ ۗ وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَىٰ أَنْ تَضَعُوا أَسْلِحَتَكُمْ ۖ وَخُذُوا حِذْرَكُمْ ۗ إِنَّ اللَّهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 102,
      "juz": 5,
      "manzil": 1,
      "page": 95,
      "ruku": 76,
      "hizbQuarter": 38,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِذَا كُنتَ فِيهِمۡ فَأَقَمۡتَ لَهُمُ ٱلصَّلَوٰةَ فَلۡتَقُمۡ طَآئِفَةٞ مِّنۡهُم مَّعَكَ وَلۡيَأۡخُذُوٓاْ أَسۡلِحَتَهُمۡۖ فَإِذَا سَجَدُواْ فَلۡيَكُونُواْ مِن وَرَآئِكُمۡ وَلۡتَأۡتِ طَآئِفَةٌ أُخۡرَىٰ لَمۡ يُصَلُّواْ فَلۡيُصَلُّواْ مَعَكَ وَلۡيَأۡخُذُواْ حِذۡرَهُمۡ وَأَسۡلِحَتَهُمۡۗ وَدَّ ٱلَّذِينَ كَفَرُواْ لَوۡ تَغۡفُلُونَ عَنۡ أَسۡلِحَتِكُمۡ وَأَمۡتِعَتِكُمۡ فَيَمِيلُونَ عَلَيۡكُم مَّيۡلَةٗ وَٰحِدَةٗۚ وَلَا جُنَاحَ عَلَيۡكُمۡ إِن كَانَ بِكُمۡ أَذٗى مِّن مَّطَرٍ أَوۡ كُنتُم مَّرۡضَىٰٓ أَن تَضَعُوٓاْ أَسۡلِحَتَكُمۡۖ وَخُذُواْ حِذۡرَكُمۡۗ إِنَّ ٱللَّهَ أَعَدَّ لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ٢٠١\n                                    \n                                    \n                                    صلاة الخوف أنواع كثيرة ، فإن العدو تارة يكون تجاه القبلة ، وتارة يكون في غير صوبها ، والصلاة تارة تكون رباعية ، وتارة ثلاثية كالمغرب ، وتارة ثنائية ، كالصبح وصلاة السفر ، ثم تارة يصلون جماعة ، وتارة يلتحم الحرب فلا يقدرون على الجماعة ، بل يصلون فرادى مستقبلي القبلة وغير مستقبليها ، ورجالا وركبانا ، ولهم أن يمشوا والحالة هذه ويضربوا الضرب المتتابع في متن الصلاة .\nومن العلماء من قال : يصلون والحالة هذه ركعة واحدة ; لحديث ابن عباس المتقدم ، وبه قال أحمد بن حنبل . قال المنذري في الحواشي : وبه قال عطاء ، وجابر ، والحسن ، ومجاهد ، والحكم ، وقتادة ، وحماد . وإليه ذهب طاوس والضحاك .\nوقد حكى أبو عاصم العبادي عن محمد بن نصر المروزي ; أنه يرى رد الصبح إلى ركعة في الخوف وإليه ذهب ابن حزم أيضا .\nوقال إسحاق ابن راهويه : أما عند المسايفة فيجزيك ركعة واحدة ، تومئ بها إيماء ، فإن لم تقدر فسجدة واحدة ; لأنها ذكر الله .\nوقال آخرون : تكفي تكبيرة واحدة . فلعله أراد ركعة واحدة ، كما قاله أحمد بن حنبل وأصحابه ، ولكن الذين حكوه إنما حكوه على ظاهره في الاجتزاء بتكبيرة واحدة ، كما هو مذهب إسحاق ابن راهويه ، وإليه ذهب الأمير عبد الوهاب بن بخت المكي ، حتى قال : فإن لم يقدر على التكبيرة فلا يتركها في نفسه ، يعني بالنية ، رواه سعيد بن منصور في سننه عن إسماعيل بن عياش ، عن شعيب بن دينار ، عنه ، فالله أعلم .\nومن العلماء من أباح تأخير الصلاة لعذر القتال والمناجزة ، كما أخر النبي صلى الله عليه وسلم يوم الأحزاب صلاة العصر ، قيل : والظهر ، فصلاهما بعد الغروب ، ثم صلى بعدهما المغرب ثم العشاء . وكما قال بعدها - يوم بني قريظة ، حين جهز إليهم الجيش - : \" لا يصلين أحد منكم العصر إلا في بني قريظة \" ، فأدركتهم الصلاة في أثناء الطريق ، فقال منهم قائلون : لم يرد منا رسول الله صلى الله عليه وسلم إلا تعجيل المسير ، ولم يرد منا تأخير الصلاة عن وقتها ، فصلوا الصلاة لوقتها في الطريق . وأخر آخرون منهم العصر ، فصلوها في بني قريظة بعد الغروب ، ولم يعنف رسول الله صلى الله عليه وسلم أحدا من الفريقين وقد تكلمنا على هذا في كتاب السيرة ، وبينا أن الذين صلوا العصر لوقتها أقرب إلى إصابة الحق في نفس الأمر ، وإن كان الآخرون معذورين أيضا ، والحجة هاهنا في عذرهم في تأخير الصلاة لأجل الجهاد والمبادرة إلى حصار الناكثين للعهد من الطائفة الملعونة اليهود . وأما الجمهور فقالوا : هذا كله منسوخ بصلاة الخوف ، فإنها لم تكن نزلت بعد ، فلما نزلت نسخ تأخير الصلاة لذلك ، وهذا بين في حديث أبي سعيد الخدري ، الذي رواه الشافعي وأهل السنن ، ولكن يشكل على هذا ما حكاه البخاري رحمه الله ، في صحيحه ، حيث قال :\n\" باب الصلاة عند مناهضة الحصون ولقاء العدو \" : قال الأوزاعي : إن كان تهيأ الفتح ولم يقدروا على الصلاة ، صلوا إيماء ، كل امرئ لنفسه ، فإن لم يقدروا على الإيماء أخروا الصلاة حتى ينكشف القتال ، أو يأمنوا فيصلوا ركعتين . فإن لم يقدروا صلوا ركعة وسجدتين ، فإن لم يقدروا لا يجزئهم التكبير ، ويؤخرونها حتى يأمنوا . وبه قال مكحول ، وقال أنس بن مالك : حضرت مناهضة حصن تستر عند إضاءة الفجر ، واشتد اشتعال القتال ، فلم يقدروا على الصلاة ، فلم نصل إلا بعد ارتفاع النهار ، فصليناها ونحن مع أبي موسى ، ففتح لنا ، قال أنس : وما يسرني بتلك الصلاة الدنيا وما فيها .\nانتهى ما ذكره ، ثم أتبعه بحديث تأخير الصلاة يوم الأحزاب ، ثم بحديث أمره إياهم ألا يصلوا العصر إلا في بني قريظة ، وكأنه كالمختار لذلك ، والله أعلم .\nولمن جنح إلى ذلك له أن يحتج بصنيع أبي موسى وأصحابه يوم فتح تستر فإنه يشتهر غالبا ، ولكن كان ذلك في إمارة عمر بن الخطاب ، ولم ينقل أنه أنكر عليهم ، ولا أحد من الصحابة ، والله أعلم .\n[ و ] قال هؤلاء : وقد كانت صلاة الخوف مشروعة في الخندق ; لأن ذات الرقاع كانت قبل الخندق في قول جمهور علماء السير والمغازي . وممن نص على ذلك محمد بن إسحاق ، وموسى بن عقبة ، والواقدي ، ومحمد بن سعد كاتبه ، وخليفة بن خياط وغيرهم وقال البخاري وغيره : كانت ذات الرقاع بعد الخندق ، لحديث أبي موسى وما قدم إلا في خيبر ، والله أعلم . والعجب - كل العجب - أن المزني ، وأبا يوسف القاضي ، وإبراهيم بن إسماعيل بن علية ذهبوا إلى أن صلاة الخوف منسوخة بتأخيره ، عليه السلام ، الصلاة يوم الخندق . وهذا غريب جدا ، وقد ثبتت الأحاديث بعد الخندق بصلاة الخوف ، وحمل تأخير الصلاة يومئذ على ما قاله مكحول والأوزاعي أقوى وأقرب ، والله أعلم .\nفقوله تعالى : ( وإذا كنت فيهم فأقمت لهم الصلاة ) أي : إذا صليت بهم إماما في صلاة الخوف ، وهذه حالة غير الأولى ، فإن تلك قصرها إلى ركعة ، كما دل عليه الحديث ، فرادى ورجالا وركبانا ، مستقبلي القبلة وغير مستقبليها ، ثم ذكر حال الاجتماع والائتمام بإمام واحد . وما أحسن ما استدل به من ذهب إلى وجوب الجماعة من هذه الآية الكريمة ، حيث اغتفرت أفعال كثيرة لأجل الجماعة ، فلولا أنها واجبة لما ساغ ذلك ، وأما من استدل بهذه الآية على أن صلاة الخوف منسوخة بعد النبي صلى الله عليه وسلم لقوله : ( وإذا كنت فيهم ) فبعده تفوت هذه الصفة ، فإنه استدلال ضعيف ، ويرد عليه مثل قول مانعي الزكاة ، الذين احتجوا بقوله : (خذ من أموالهم صدقة تطهرهم وتزكيهم بها وصل عليهم إن صلاتك سكن لهم ) [ التوبة : 103 ] قالوا : فنحن لا ندفع زكاتنا بعده صلى الله عليه وسلم إلى أحد ، بل نخرجها نحن بأيدينا على من نراه ، ولا ندفعها إلى من صلاته ، أي : دعاؤه ، سكن لنا ، ومع هذا رد عليهم الصحابة وأبوا عليهم هذا الاستدلال ، وأجبروهم على أداء الزكاة ، وقاتلوا من منعها منهم .\nولنذكر سبب نزول هذه الآية الكريمة أولا قبل ذكر صفتها :\nقال ابن جرير : حدثني المثنى ، حدثنا إسحاق ، حدثنا عبد الله بن هاشم ، أنبأنا سيف عن أبي روق ، عن أبي أيوب ، عن علي ، رضي الله عنه ، قال : سأل قوم من بني النجار رسول الله صلى الله عليه وسلم فقالوا : يا رسول الله ، إنا نضرب في الأرض ، فكيف نصلي ؟ فأنزل الله عز وجل : ( وإذا ضربتم في الأرض فليس عليكم جناح أن تقصروا من الصلاة ) ثم انقطع الوحي ، فلما كان بعد ذلك بحول غزا النبي صلى الله عليه وسلم فصلى الظهر ، فقال المشركون : لقد أمكنكم محمد وأصحابه من ظهورهم ، هلا شددتم عليهم ؟ فقال قائل منهم : إن لهم أخرى مثلها في إثرها . قال : فأنزل الله عز وجل بين الصلاتين : ( إن خفتم أن يفتنكم الذين كفروا [ إن الكافرين كانوا لكم عدوا مبينا . وإذا كنت فيهم فأقمت لهم الصلاة فلتقم طائفة منهم معك ) إلى قوله : ( أعد للكافرين عذابا مهينا ) ] فنزلت صلاة الخوف .\nوهذا سياق غريب جدا ولكن لبعضه شاهد من رواية أبي عياش الزرقي ، واسمه زيد بن الصامت ، رضي الله عنه ، قال الإمام أحمد :\nحدثنا عبد الرزاق ، حدثنا الثوري ، عن منصور ، عن مجاهد ، عن أبي عياش قال : كنا مع رسول الله صلى الله عليه وسلم بعسفان ، فاستقبلنا المشركون ، عليهم خالد بن الوليد ، وهم بيننا وبين القبلة ، فصلى بنا النبي صلى الله عليه وسلم الظهر ، فقالوا : لقد كانوا على حال لو أصبنا غرتهم . ثم قالوا : تأتي عليهم الآن صلاة هي أحب إليهم من أبنائهم وأنفسهم . قال : فنزل جبريل بهذه الآيات بين الظهر والعصر : ( وإذا كنت فيهم فأقمت لهم الصلاة ) قال : فحضرت ، فأمرهم النبي صلى الله عليه وسلم فأخذوا السلاح ، [ قال ] فصفنا خلفه صفين ، قال : ثم ركع فركعنا جميعا ، ثم رفع فرفعنا جميعا ، ثم سجد النبي صلى الله عليه وسلم بالصف الذي يليه والآخرون قيام يحرسونهم ، فلما سجدوا وقاموا جلس الآخرون فسجدوا في مكانهم ثم تقدم هؤلاء إلى مصاف هؤلاء ، وجاء هؤلاء إلى مصاف هؤلاء ، ثم ركع فركعوا جميعا ، ثم رفع فرفعوا جميعا ، ثم سجد النبي صلى الله عليه وسلم والصف الذي يليه ، والآخرون قيام يحرسونهم ، فلما جلسوا جلس الآخرون فسجدوا ، ثم سلم عليهم ، ثم انصرف . قال : فصلاها رسول الله صلى الله عليه وسلم مرتين : مرة بعسفان ، ومرة بأرض بني سليم .\nثم رواه أحمد ، عن غندر ، عن شعبة ، عن منصور ، به نحوه . وهكذا رواه أبو داود ، عن سعيد بن منصور ، عن جرير بن عبد الحميد ، والنسائي من حديث شعبة وعبد العزيز بن عبد الصمد ، كلهم عن منصور ، به .\nوهذا إسناد صحيح ، وله شواهد كثيرة ، فمن ذلك ما رواه البخاري حيث قال : حدثنا حيوة بن شريح ، حدثنا محمد بن حرب ، عن الزبيدي ، عن الزهري ، عن عبيد الله بن عبد الله بن عتبة ، عن ابن عباس قال : قام النبي صلى الله عليه وسلم وقام الناس معه ، فكبر وكبروا معه ، وركع وركع ناس منهم ، ثم سجد وسجدوا معه ، ثم قام الثانية فقام الذين سجدوا ، وحرسوا إخوانهم ، وأتت الطائفة الأخرى فركعوا وسجدوا معه ، والناس كلهم في الصلاة ، ولكن يحرس بعضهم بعضا .\nوقال ابن جرير : حدثنا ابن بشار ، حدثنا معاذ بن هشام ، حدثني أبي ، عن قتادة ، عن سليمان اليشكري : أنه سأل جابر بن عبد الله عن إقصار الصلاة : أي يوم أنزل ؟ أو : أي يوم هو ؟ فقال جابر : انطلقنا نتلقى عير قريش آتية من الشام ، حتى إذا كنا بنخل ، جاء رجل من القوم إلى رسول الله صلى الله عليه وسلم فقال : يا محمد . قال : \" نعم \" ، قال : هل تخافني ؟ قال : \" لا \" . قال : فما يمنعك مني ؟ قال : \" الله يمنعني منك \" . قال : فسل السيف ثم تهدده وأوعده ، ثم نادى بالترحل وأخذ السلاح ، ثم نودي بالصلاة ، فصلى رسول الله صلى الله عليه وسلم بطائفة من القوم وطائفة أخرى تحرسهم . فصلى بالذين يلونه ركعتين ، ثم تأخر الذين يلونه على أعقابهم فقاموا في مصاف أصحابهم ، ثم جاء الآخرون فصلى بهم ركعتين والآخرون يحرسونهم ، ثم سلم . فكانت للنبي صلى الله عليه وسلم أربع ركعات ، والقوم ركعتين ركعتين ، فيومئذ أنزل الله في إقصار الصلاة وأمر المؤمنين بأخذ السلاح .\nوقال الإمام أحمد : حدثنا سريج حدثنا أبو عوانة ، عن أبي بشر ، عن سليمان بن قيس اليشكري ، عن جابر بن عبد الله قال : قاتل رسول الله صلى الله عليه وسلم محارب خصفة فجاء رجل منهم يقال له : \" غورث بن الحارث \" حتى قام على رسول الله صلى الله عليه وسلم بالسيف فقال : من يمنعك مني ؟ قال : \" الله \" ، فسقط السيف من يده ، فأخذه رسول الله صلى الله عليه وسلم فقال : \" ومن يمنعك مني \" ؟ قال : كن خير آخذ . قال : \" أتشهد أن لا إله إلا الله وأني رسول الله ؟ \" قال : لا ولكني أعاهدك ألا أقاتلك ولا أكون مع قوم يقاتلونك . فخلى سبيله ، فأتى قومه فقال : جئتكم من عند خير الناس . فلما حضرت الصلاة صلى رسول الله صلى الله عليه وسلم صلاة الخوف ، فكان الناس طائفتين : طائفة بإزاء ، وطائفة صلوا مع رسول الله صلى الله عليه وسلم . فصلى بالطائفة الذين معه ركعتين ، وانصرفوا ، فكانوا بمكان أولئك الذين بإزاء عدوهم . وانصرف الذين بإزاء عدوهم فصلوا مع رسول الله صلى الله عليه وسلم ركعتين ، فكان لرسول الله صلى الله عليه وسلم أربع ركعات ، وللقوم ركعتين ركعتين .\nتفرد به من هذا الوجه .\nوقال ابن أبي حاتم : حدثنا أحمد بن سنان ، حدثنا أبو قطن عمرو بن الهيثم ، حدثنا المسعودي ، عن يزيد الفقير قال : سألت جابر بن عبد الله عن الركعتين في السفر : أقصرهما ؟ قال : الركعتان في السفر تمام ، إنما القصر واحدة عند القتال ، بينما نحن مع رسول الله صلى الله عليه وسلم في قتال إذ أقيمت الصلاة ، فقام رسول الله صلى فصف طائفة ، وطائفة وجهها قبل العدو ، فصلى بهم ركعة وسجد بهم سجدتين ، ثم الذين خلفوا انطلقوا إلى أولئك فقاموا مقامهم ومكانهم نحو ذا ، وجاء أولئك فقاموا خلف رسول الله صلى الله عليه وسلم فصلى بهم ركعة وسجد بهم سجدتين ، ثم إن رسول الله صلى الله عليه وسلم جلس وسلم ، وسلم الذين خلفه ، وسلم أولئك ، فكانت لرسول الله صلى الله عليه وسلم ركعتين ، وللقوم ركعة ركعة ، ثم قرأ : ( وإذا كنت فيهم فأقمت لهم الصلاة ) .\nوقال الإمام أحمد : حدثنا محمد بن جعفر ، حدثنا شعبة ، عن الحكم ، عن يزيد الفقير ، عن جابر بن عبد الله ; أن رسول الله صلى الله عليه وسلم صلى بهم صلاة الخوف ، فقام صف بين يديه ، وصف خلفه ، فصلى بالذي خلفه ركعة وسجدتين ، ثم تقدم هؤلاء حتى قاموا في مقام أصحابهم ، وجاء أولئك حتى قاموا مقام هؤلاء ، فصلى بهم رسول الله صلى الله عليه وسلم ركعة وسجدتين ، ثم سلم . فكانت للنبي صلى الله عليه وسلم ركعتين ولهم ركعة .\nورواه النسائي من حديث شعبة ، ولهذا الحديث طرق عن جابر وهو في صحيح مسلم من وجه آخر بلفظ آخر وقد رواه عن جابر جماعة كثيرون في الصحيح والسنن والمساند .\nوقال ابن أبي حاتم : حدثنا أبي ، حدثنا نعيم بن حماد ، حدثنا عبد الله بن المبارك ، أنبأنا معمر ، عن الزهري ، عن سالم ، عن أبيه قال : ( وإذا كنت فيهم فأقمت لهم الصلاة ) قال : هي صلاة الخوف ، صلى رسول الله صلى الله عليه وسلم بإحدى الطائفتين ركعة ، والطائفة الأخرى مقبلة على العدو ، وأقبلت الطائفة الأخرى التي كانت مقبلة على العدو فصلى بهم رسول الله صلى الله عليه وسلم ركعة أخرى ، ثم سلم بهم ، ثم قامت كل طائفة منهم فصلت ركعة ركعة . وقد روى هذا الحديث الجماعة في كتبهم من طريق معمر ، به ولهذا الحديث طرق كثيرة عن جماعة من الصحابة ، وقد أجاد الحافظ أبو بكر بن مردويه في سرد طرقه وألفاظه ، وكذا ابن جرير ، ولنحرره في كتاب \" الأحكام الكبير \" إن شاء الله ، وبه الثقة .\nوأما الأمر بحمل السلاح في صلاة الخوف ، فمحمول عند طائفة من العلماء على الوجوب لظاهر الآية ، وهو أحد قولي الشافعي ويدل عليه قوله : ( ولا جناح عليكم إن كان بكم أذى من مطر أو كنتم مرضى أن تضعوا أسلحتكم وخذوا حذركم ) أي : بحيث تكونون على أهبة إذا احتجتم إليها لبستموها بلا كلفة : ( إن الله أعد للكافرين عذابا مهينا )\n                                    ",
        "qortoby": "وَإِذَا كُنتَ فِيهِمۡ فَأَقَمۡتَ لَهُمُ ٱلصَّلَوٰةَ فَلۡتَقُمۡ طَآئِفَةٞ مِّنۡهُم مَّعَكَ وَلۡيَأۡخُذُوٓاْ أَسۡلِحَتَهُمۡۖ فَإِذَا سَجَدُواْ فَلۡيَكُونُواْ مِن وَرَآئِكُمۡ وَلۡتَأۡتِ طَآئِفَةٌ أُخۡرَىٰ لَمۡ يُصَلُّواْ فَلۡيُصَلُّواْ مَعَكَ وَلۡيَأۡخُذُواْ حِذۡرَهُمۡ وَأَسۡلِحَتَهُمۡۗ وَدَّ ٱلَّذِينَ كَفَرُواْ لَوۡ تَغۡفُلُونَ عَنۡ أَسۡلِحَتِكُمۡ وَأَمۡتِعَتِكُمۡ فَيَمِيلُونَ عَلَيۡكُم مَّيۡلَةٗ وَٰحِدَةٗۚ وَلَا جُنَاحَ عَلَيۡكُمۡ إِن كَانَ بِكُمۡ أَذٗى مِّن مَّطَرٍ أَوۡ كُنتُم مَّرۡضَىٰٓ أَن تَضَعُوٓاْ أَسۡلِحَتَكُمۡۖ وَخُذُواْ حِذۡرَكُمۡۗ إِنَّ ٱللَّهَ أَعَدَّ لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ٢٠١\n                                    \n                                    \n                                    قوله : وإذا كنت فيهم فأقمت لهم الصلاة فلتقم طائفة منهم معك وليأخذوا أسلحتهم فإذا سجدوا فليكونوا من ورائكم ولتأت طائفة أخرى لم يصلوا فليصلوا معك وليأخذوا حذرهم وأسلحتهم ود الذين كفروا لو تغفلون عن أسلحتكم وأمتعتكم فيميلون عليكم ميلة واحدة ولا جناح عليكم إن كان بكم أذى من مطر أو كنتم مرضى أن تضعوا أسلحتكم وخذوا حذركم إن الله أعد للكافرين عذابا مهينا\nفيه إحدى عشرة مسألة :\nالأولى : قوله تعالى : وإذا كنت فيهم فأقمت لهم الصلاة روى الدارقطني عن أبي عياش الزرقي قال : كنا مع رسول الله صلى الله عليه وسلم بعسفان ، فاستقبلنا المشركون ، عليهم خالد بن الوليد وهم بيننا وبين القبلة ، فصلى بنا النبي صلى الله عليه وسلم الظهر ، فقالوا : قد كانوا على حال لو أصبنا غرتهم ؛ قال : ثم قالوا تأتي الآن عليهم صلاة هي أحب إليهم من أبنائهم وأنفسهم ؛ قال : فنزل جبريل عليه السلام بهذه الآية بين الظهر والعصر وإذا كنت فيهم فأقمت لهم الصلاة . وذكر الحديث . وسيأتي تمامه إن شاء الله تعالى . وهذا كان سبب إسلام خالد رضي الله عنه . وقد اتصلت هذه الآية بما سبق من ذكر الجهاد . وبين الرب تبارك وتعالى أن الصلاة لا تسقط بعذر السفر ولا بعذر الجهاد وقتال العدو ، ولكن فيها رخص على ما تقدم في \" البقرة \" وهذه السورة ، بيانه من اختلاف العلماء . وهذه الآية خطاب للنبي صلى الله عليه وسلم ، وهو يتناول الأمراء بعده إلى يوم القيامة ، ومثله قوله تعالى : خذ من أموالهم صدقة هذا قول كافة العلماء . وشذ أبو يوسف وإسماعيل ابن علية فقالا : لا نصلي صلاة الخوف بعد النبي صلى الله عليه وسلم ؛ فإن الخطاب كان خاصا له بقوله تعالى : وإذا كنت فيهم وإذا لم يكن فيهم لم يكن ذلك لهم ؛ لأن النبي صلى الله عليه وسلم ليس كغيره في ذلك ، وكلهم كان يحب أن يأتم به ويصلي خلفه ، وليس أحد بعده يقوم في الفضل مقامه ، والناس بعده تستوي أحوالهم وتتقارب ؛ فلذلك يصلي الإمام بفريق ويأمر من يصلي بالفريق الآخر ، وأما أن يصلوا بإمام واحد فلا . وقال الجمهور : إنا قد أمرنا باتباعه والتأسي به في غير ما آية وغير حديث ، فقال تعالى : فليحذر الذين يخالفون عن أمره أن تصيبهم فتنة وقال صلى الله عليه وسلم : صلوا كما رأيتموني أصلي . فلزم اتباعه مطلقا حتى يدل دليل واضح على الخصوص ؛ ولو كان ما ذكروه دليلا على الخصوص للزم قصر الخطابات على من توجهت له ، وحينئذ كان يلزم أن تكون الشريعة قاصرة على من خوطب بها ؛ ثم إن الصحابة رضوان الله عليهم أجمعين اطرحوا توهم الخصوص في هذه الصلاة وعدوه إلى غير النبي صلى الله عليه وسلم ، وهم أعلم بالمقال وأقعد بالحال . وقد قال تعالى : وإذا رأيت الذين يخوضون في آياتنا فأعرض عنهم حتى يخوضوا في حديث غيره وهذا خطاب له ، وأمته داخلة فيه ، ومثله كثير . وقال تعالى : خذ من أموالهم صدقة وذلك لا يوجب الاقتصار عليه وحده ، وأن من بعده يقوم في ذلك مقامه ؛ فكذلك في قوله : وإذا كنت فيهم . ألا ترى أن أبا بكر الصديق في جماعة الصحابة رضي الله عنهم قاتلوا من تأول في الزكاة مثل ما تأولتموه في صلاة الخوف . قال أبو عمر : ليس في أخذ الزكاة التي قد استوى فيها النبي صلى الله عليه وسلم ومن بعده من الخلفاء ما يشبه صلاة من صلى خلف النبي صلى الله عليه وسلم وصلى خلف غيره ؛ لأن أخذ الزكاة فائدتها توصيلها للمساكين ، وليس فيها فضل للمعطى كما في الصلاة فضل للمصلي خلفه .\nالثانية : قوله تعالى : فلتقم طائفة منهم معك يعني جماعة منهم تقف معك في الصلاة . وليأخذوا أسلحتهم يعني الذين يصلون معك . ويقال : وليأخذوا أسلحتهم الذين هم بإزاء العدو ، على ما يأتي بيانه . ولم يذكر الله تعالى في الآية لكل طائفة إلا ركعة واحدة ، ولكن روي في الأحاديث أنهم أضافوا إليها أخرى ، على ما يأتي . وحذفت الكسرة من قوله : فلتقم وفليكونوا لثقلها . وحكى الأخفش والفراء والكسائي أن لام الأمر ولام كي ولام الجحود يفتحن . وسيبويه يمنع من ذلك لعلة موجبة ، وهي الفرق بين لام الجر ولام التأكيد . والمراد من هذا الأمر الانقسام ، أي وسائرهم وجاه العدو حذرا من توقع حملته .\nوقد اختلفت الروايات في هيئة صلاة الخوف ، واختلف العلماء لاختلافها ، فذكر ابن القصار أنه صلى الله عليه وسلم صلاها في عشرة مواضع . قال ابن العربي : روي عن النبي صلى الله عليه وسلم أنه صلى صلاة الخوف أربعا وعشرين مرة . وقال الإمام أحمد بن حنبل ، وهو إمام أهل الحديث والمقدم في معرفة علل النقل فيه : لا أعلم أنه روي في صلاة الخوف إلا حديث ثابت . وهي كلها صحاح ثابتة ، فعلى أي حديث صلى منها المصلي صلاة الخوف أجزأه إن شاء الله . وكذلك قال أبو جعفر الطبري . وأما مالك وسائر أصحابه إلا أشهب فذهبوا في صلاة الخوف إلى حديث سهل بن أبي حثمة ، وهو ما رواه في موطئه عن يحيى بن سعيد عن القاسم بن محمد عن صالح بن خوات الأنصاري أن سهل بن أبي حثمة حدثه أن صلاة الخوف أن يقوم الإمام ومعه طائفة من أصحابه وطائفة مواجهة العدو ، فيركع الإمام ركعة ويسجد بالذين معه ثم يقوم ، فإذا استوى قائما ثبت ، وأتموا لأنفسهم الركعة الباقية ثم يسلمون وينصرفون والإمام قائم ، فيكونون وجاه العدو ، ثم يقبل الآخرون الذين لم يصلوا فيكبرون وراء الإمام فيركع بهم الركعة ويسجد ثم يسلم ، فيقومون ويركعون لأنفسهم الركعة الباقية ثم يسلمون . قال ابن القاسم صاحب مالك : والعمل عند مالك على حديث القاسم بن محمد عن صالح بن خوات . قال ابن القاسم : وقد كان يأخذ بحديث يزيد بن رومان ثم رجع إلى هذا . قال أبو عمر : حديث القاسم وحديث يزيد بن رومان كلاهما عن صالح بن خوات : إلا أن بينهما فصلا في السلام ، ففي حديث القاسم أن الإمام يسلم بالطائفة الثانية ثم يقومون فيقضون لأنفسهم الركعة ، وفي حديث يزيد بن رومان أنه ينتظرهم ويسلم بهم . وبه قال الشافعي وإليه ذهب ؛ قال الشافعي : حديث يزيد بن رومان عن صالح بن خوات هذا أشبه الأحاديث في صلاة الخوف بظاهر كتاب الله ، وبه أقول . ومن حجة مالك في اختياره حديث القاسم القياس على سائر الصلوات ، في أن الإمام ليس له أن ينتظر أحدا سبقه بشيء منها ، وأن السنة المجتمع عليها أن يقضي المأمومون ما سبقوا به بعد سلام الإمام . وقول أبي ثور في هذا الباب كقول مالك ، وقال أحمد كقول الشافعي في المختار عنده ، وكان لا يعيب من فعل شيئا من الأوجه المروية في صلاة الخوف . وذهب أشهب من أصحاب مالك إلى حديث ابن عمر قال : صلى رسول الله صلى الله عليه وسلم صلاة الخوف بإحدى الطائفتين ركعة والطائفة الأخرى مواجهة العدو ، ثم انصرفوا وقاموا مقام أصحابهم مقبلين على العدو ، وجاء أولئك ثم صلى بهم النبي صلى الله عليه وسلم ركعة ثم سلم النبي صلى الله عليه وسلم ، ثم قضى هؤلاء ركعة وهؤلاء ركعة . وقال ابن عمر : فإذا كان خوف أكثر من ذلك صلى راكبا أو قائما يومئ إيماء ، أخرجه البخاري ومسلم ومالك وغيرهم . وإلى هذه الصفة ذهب الأوزاعي ، وهو الذي ارتضاه أبو عمر بن عبد البر ، قال : لأنه أصحها إسنادا ، وقد ورد بنقل أهل المدينة وبهم الحجة على من خالفهم ، ولأنه أشبه بالأصول ، لأن الطائفة الأولى والثانية لم يقضوا الركعة إلا بعد خروج النبي صلى الله عليه وسلم من الصلاة ، وهو المعروف من سنته المجتمع عليها في سائر الصلوات . وأما الكوفيون : أبو حنيفة وأصحابه إلا أبا يوسف القاضي يعقوب فذهبوا إلى حديث عبد الله بن مسعود ، أخرجه أبو داود والدارقطني قال : صلى رسول الله صلى الله عليه وسلم صلاة الخوف فقاموا صفين ، صفا خلف النبي صلى الله عليه وسلم وصفا مستقبل العدو ، فصلى بهم النبي صلى الله عليه وسلم ركعة ، وجاء الآخرون فقاموا مقامهم ، واستقبل هؤلاء العدو فصلى بهم رسول الله صلى الله عليه وسلم ثم سلم ، فقام هؤلاء فصلوا لأنفسهم ركعة ثم سلموا ثم ذهبوا فقاموا مقام أولئك مستقبلين العدو ، ورجع أولئك إلى مقامهم فصلوا لأنفسهم ركعة ثم سلموا . وهذه الصفة والهيئة هي الهيئة المذكورة في حديث ابن عمر إلا أن بينهما فرقا ؛ وهو أن قضاء أولئك في حديث ابن عمر يظهر أنه في حالة واحدة ويبقى الإمام كالحارس وحده ، وهاهنا قضاؤهم متفرق على صفة صلاتهم . وقد تأول بعضهم حديث ابن عمر على ما جاء في حديث ابن مسعود . وقد ذهب إلى حديث ابن مسعود الثوري - في إحدى الروايات الثلاث عنه - وأشهب بن عبد العزيز فيما ذكر أبو الحسن اللخمي عنه ، والأول ذكره أبو عمر وابن يونس وابن حبيب عنه . وروى أبو داود من حديث حذيفة وأبي هريرة وابن عمر أنه عليه السلام صلى بكل طائفة ركعة ولم يقضوا ، وهو مقتضى حديث ابن عباس \" وفي الخوف ركعة \" . وهذا قول إسحاق . وقد تقدم في \" البقرة \" الإشارة إلى هذا ، وأن الصلاة أولى بما احتيط لها ، وأن حديث ابن عباس لا تقوم به حجة ، وقوله في حديث حذيفة وغيره : \" ولم يقضوا \" أي في علم من روى ذلك ، لأنه قد روي أنهم قضوا ركعة في تلك الصلاة بعينها ، وشهادة من زاد أولى . ويحتمل أن يكون المراد لم يقضوا ، أي لم يقضوا إذا أمنوا ، وتكون فائدة أن الخائف إذا أمن لا يقضي ما صلى على تلك الهيئة من الصلوات في الخوف ، قال جميعه أبو عمر . وفي صحيح مسلم عن جابر أنه عليه السلام صلى بطائفة ركعتين ثم تأخروا ، وصلى بالطائفة الأخرى ركعتين . قال : فكان لرسول الله صلى الله عليه وسلم أربع ركعات وللقوم ركعتان . وأخرجه أبو داود والدارقطني من حديث الحسن عن أبي بكرة وذكرا فيه أنه سلم من كل ركعتين . وأخرجه الدارقطني أيضا عن الحسن عن جابر أن رسول الله صلى الله عليه وسلم صلى بهم ركعتين ثم سلم ، ثم صلى بالآخرين ركعتين ثم سلم . قال أبو داود : وبذلك كان الحسن يفتي ، وروي عن الشافعي . وبه يحتج كل من أجاز اختلاف نية الإمام والمأموم في الصلاة ، وهو مذهب الشافعي والأوزاعي وابن علية وأحمد بن حنبل وداود . وعضدوا هذا بحديث جابر : أن معاذا كان يصلي مع النبي صلى الله عليه وسلم العشاء ثم يأتي فيؤم قومه ، الحديث . وقال الطحاوي : إنما كان هذا في أول الإسلام إذ كان يجوز أن تصلي الفريضة مرتين ثم نسخ ذلك ، والله أعلم . فهذه أقاويل العلماء في صلاة الخوف .\nالثالثة : وهذه الصلاة المذكورة في القرآن إنما يحتاج إليها والمسلمون مستدبرون القبلة ووجه العدو القبلة ، وإنما اتفق هذا بذات الرقاع ، فأما بعسفان والموضع الآخر فالمسلمون كانوا في قبالة القبلة . وما ذكرناه من سبب النزول في قصة خالد بن الوليد لا يلائم تفريق القوم إلى طائفتين ، فإن في الحديث بعد قوله : فأقمت لهم الصلاة قال : فحضرت الصلاة فأمرهم النبي صلى الله عليه وسلم أن يأخذوا السلاح وصفنا خلفه صفين ، قال : ثم ركع فركعنا جميعا ، قال : ثم رفع فرفعنا جميعا ، قال : ثم سجد النبي صلى الله عليه وسلم بالصف الذي يليه قال : والآخرون قيام يحرسونهم ، فلما سجدوا وقاموا جلس الآخرون فسجدوا في مكانهم ، قال : ثم تقدم هؤلاء في مصاف هؤلاء وجاء هؤلاء إلى مصاف هؤلاء ، قال : ثم ركع فركعوا جميعا ، ثم رفع فرفعوا جميعا ، ثم سجد النبي صلى الله عليه وسلم والصف الذي يليه ، والأخرون قيام ، يحرسونهم فلما جلس الآخرون سجدوا ثم سلم عليهم . قال : فصلاها رسول الله صلى الله عليه وسلم مرتين : مرة بعسفان ومرة في أرض بني سليم . وأخرجه أبو داود من حديث أبي عياش الزرقي وقال : وهو قول الثوري وهو أحوطها . وأخرجه أبو عيسى الترمذي من حديث أبي هريرة أن رسول الله صلى الله عليه وسلم نزل بين ضجنان وعسفان ؛ الحديث . وفيه أنه عليه السلام صدعهم صدعين وصلى بكل طائفة ركعة ، فكانت للقوم ركعة ركعة ، وللنبي صلى الله عليه وسلم ركعتان ، قال : حديث حسن صحيح غريب . وفي الباب عن عبد الله بن مسعود وزيد بن ثابت وابن عباس وجابر وأبي عياش الزرقي واسمه زيد بن الصامت ، وابن عمر وحذيفة وأبي بكر وسهل بن أبي حثمة .\nقلت : ولا تعارض بين هذه الروايات ، فلعله صلى بهم صلاة كما جاء في حديث أبي عياش مجتمعين ، وصلى بهم صلاة أخرى متفرقين كما جاء في حديث أبي هريرة ، ويكون فيه حجة لمن يقول صلاة الخوف ركعة . قال الخطابي : صلاة الخوف أنواع صلاها النبي صلى الله عليه وسلم في أيام مختلفة وأشكال متباينة ، يتوخى فيها كلها ما هو أحوط للصلاة وأبلغ في الحراسة .\nالرابعة : واختلفوا في كيفية صلاة المغرب ، فروى الدارقطني عن الحسن عن أبي بكرة أن النبي صلى الله عليه وسلم صلى بالقوم صلاة المغرب ثلاث ركعات ثم انصرفوا ، وجاء الآخرون فصلى بهم ثلاث ركعات ، فكانت للنبي صلى الله عليه وسلم ستا وللقوم ثلاثا ثلاثا ، وبه قال الحسن . والجمهور في صلاة المغرب على خلاف هذا ، وهو أنه يصلي بالأولى ركعتين وبالثانية ركعة ، وتقضي على اختلاف أصولهم فيه متى يكون ؟ هل قبل سلام الإمام أو بعده . هذا قول مالك وأبي حنيفة ، لأنه أحفظ لهيئة الصلاة . وقال الشافعي : يصلى بالأولى ركعة ، لأن عليا رضي الله عنه فعلها ليلة الهرير ، والله تعالى أعلم .\nالخامسة : واختلفوا في صلاة الخوف عند التحام الحرب وشدة القتال وخيف خروج الوقت فقال مالك والثوري والأوزاعي والشافعي وعامة العلماء : يصلي كيفما أمكن ، لقول ابن عمر : فإن كان خوف أكثر من ذلك فيصلي راكبا أو قائما يومئ إيماء . قال في الموطأ : مستقبل القبلة وغير مستقبلها ، وقد تقدم في \" البقرة \" قول الضحاك وإسحاق . وقال الأوزاعي : إن كان تهيأ الفتح ولم يقدروا على الصلاة صلوا إيماء كل امرئ لنفسه ؛ فإن لم يقدروا على الإيماء أخروا الصلاة حتى ينكشف القتال ويأمنوا فيصلوا ركعتين ، فإن لم يقدروا صلوا ركعة وسجدتين ، فإن لم يقدروا يجزئهم التكبير ويؤخروها حتى يأمنوا ؛ وبه قال مكحول .\nقلت : وحكاه الكيا الطبري في \" أحكام القرآن \" له عن أبي حنيفة وأصحابه ، قال الكيا : وإذا كان الخوف أشد من ذلك وكان التحام القتال فإن المسلمين يصلون على ما أمكنهم مستقبلي القبلة ومستدبريها ، وأبو حنيفة وأصحابه الثلاثة متفقون على أنهم لا يصلون والحالة هذه بل يؤخرون الصلاة . وإن قاتلوا في الصلاة قالوا : فسدت الصلاة وحكي عن الشافعي أنه إن تابع الطعن والضرب فسدت صلاته .\nقلت : وهذا القول يدل على صحة قول أنس : حضرت مناهضة حصن تستر عند إضاءة الفجر ، واشتد اشتعال القتال فلم نقدر على الصلاة إلا بعد ارتفاع النهار ؛ فصليناها ونحن مع أبي موسى ففتح لنا . قال أنس : وما يسرني بتلك الصلاة الدنيا وما فيها ، ذكره البخاري وإليه كان يذهب شيخنا الأستاذ أبو جعفر أحمد بن محمد بن محمد القيسي القرطبي المعروف بأبي حجة ؛ وهو اختيار البخاري فيما يظهر ؛ لأنه أردفه بحديث جابر ، قال : جاء عمر يوم الخندق فجعل يسب كفار قريش ويقول : يا رسول الله ، ما صليت العصر حتى كادت الشمس أن تغرب ، فقال النبي صلى الله عليه وسلم : وأنا والله ما صليتها قال : فنزل إلى بطحان فتوضأ وصلى العصر بعد ما غربت الشمس ثم صلى المغرب بعدها .\nالسادسة : واختلفوا في صلاة الطالب والمطلوب ؛ فقال مالك وجماعة من أصحابه هما سواء ، كل واحد منهما يصلي على دابته . وقال الأوزاعي والشافعي وفقهاء أصحاب الحديث وابن عبد الحكم : لا يصلي الطالب إلا بالأرض وهو الصحيح ؛ لأن الطلب تطوع ، والصلاة المكتوبة فرضها أن تصلى بالأرض حيثما أمكن ذلك ، ولا يصليها راكب إلا خائف شديد خوفه وليس كذلك الطالب . والله أعلم .\nالسابعة : واختلفوا أيضا في العسكر إذا رأوا سوادا فظنوه عدوا فصلوا صلاة الخوف ثم بان لهم أنه غير شيء ؛ فلعلمائنا فيه روايتان : إحداهما يعيدون ، وبه قال أبو حنيفة . والثانية لا إعادة عليهم ، وهو أظهر قولي الشافعي . ووجه الأولى أنهم تبين لهم الخطأ فعادوا إلى الصواب كحكم الحاكم . ووجه الثانية أنهم عملوا على اجتهادهم فجاز لهم كما لو أخطئوا القبلة ؛ وهذا أولى لأنهم فعلوا ما أمروا به . وقد يقال : يعيدون في الوقت ، فأما بعد خروجه فلا . والله أعلم .\nالثامنة : قوله تعالى : وليأخذوا أسلحتهم وقال وليأخذوا حذرهم وأسلحتهم هذا وصاة بالحذر وأخذ السلاح لئلا ينال العدو أمله ويدرك فرصته . والسلاح ما يدفع به المرء عن نفسه في الحرب ، قال عنترة :\nكسوت الجعد بني أبان سلاحي بعد عري وافتضاح\nيقول : أعرته سلاحي ليمتنع بها بعد عريه من السلاح . قال ابن عباس : وليأخذوا أسلحتهم يعني الطائفة التي وجاه العدو ، لأن المصلية لا تحارب . وقال غيره : هي المصلية أي وليأخذ الذين صلوا أولا أسلحتهم ، ذكره الزجاج . قال : ويحتمل أن تكون الطائفة الذين هم في الصلاة أمروا بحمل السلاح ؛ أي فلتقم طائفة منهم معك وليأخذوا أسلحتهم فإنه أرهب للعدو . النحاس : يجوز أن يكون للجميع ؛ لأنه أهيب للعدو . ويحتمل أن يكون للتي وجاه العدو خاصة . قال أبو عمر : أكثر أهل العلم يستحبون للمصلي أخذ سلاحه إذا صلى في الخوف ، ويحملون قوله : وليأخذوا أسلحتهم على الندب ؛ لأنه شيء لولا الخوف لم يجب أخذه ؛ فكان الأمر به ندبا . وقال أهل الظاهر : أخذ السلاح في صلاة الخوف واجب لأمر الله به ، إلا لمن كان به أذى من مطر ، فإن كان ذلك جاز له وضع سلاحه . قال ابن العربي : إذا صلوا أخذوا سلاحهم عند الخوف ، وبه قال الشافعي وهو نص القرآن . وقال أبو حنيفة : لا يحملونها ؛ لأنه لو وجب عليهم حملها لبطلت الصلاة بتركها . قلنا : لم يجب حملها لأجل الصلاة وإنما وجب عليهم قوة لهم ونظرا .\nالتاسعة : قوله تعالى : فإذا سجدوا الضمير في سجدوا للطائفة المصلية فلينصرفوا ؛ هذا على بعض الهيئات المروية . وقيل : المعنى فإذا سجدوا ركعة القضاء ؛ وهذا على هيئة سهل بن أبي حثمة . ودلت هذه الآية على أن السجود قد يعبر به عن جميع الصلاة ؛ وهو كقوله عليه السلام : إذا دخل أحدكم المسجد فليسجد سجدتين . أي فليصل ركعتين وهو في السنة . والضمير في قوله : فليكونوا يحتمل أن يكون للذين سجدوا ، ويحتمل أن يكون للطائفة القائمة أولا بإزاء العدو .\nالعاشرة : قوله تعالى : ود الذين كفروا أي تمنى وأحب الكافرون غفلتكم عن أخذ السلاح ليصلوا إلى مقصودهم ؛ فبين الله تعالى بهذا وجه الحكمة في الأمر بأخذ السلاح ، وذكر الحذر في الطائفة الثانية دون الأولى ؛ لأنها أولى بأخذ الحذر ، لأن العدو لا يؤخر قصده عن هذا الوقت لأنه آخر الصلاة ؛ وأيضا يقول العدو قد أثقلهم السلاح وكلوا . وفي هذه الآية أدل دليل على تعاطي الأسباب ، واتخاذ كل ما ينجي ذوي الألباب ، ويوصل إلى السلامة ، ويبلغ دار الكرامة . ومعنى ميلة واحدة مبالغة ، أي مستأصلة لا يحتاج معها إلى ثانية .\nالحادية عشرة : قوله تعالى : ولا جناح عليكم إن كان بكم أذى من مطر الآية . للعلماء في وجوب حمل السلاح في الصلاة كلام قد أشرنا إليه ، فإن لم يجب فيستحب للاحتياط . ثم رخص في المطر وضعه ؛ لأنه تبتل المبطنات وتثقل ويصدأ الحديد . وقيل : نزلت في النبي صلى الله عليه وسلم يوم بطن نخلة لما انهزم المشركون وغنم المسلمون ؛ وذلك أنه كان يوما مطيرا وخرج النبي صلى الله عليه وسلم لقضاء حاجته واضعا سلاحه ، فرآه الكفار منقطعا عن أصحابه فقصده غورث بن الحارث فانحدر عليه من الجبل بسيفه ، فقال : من يمنعك مني اليوم ؟ فقال : الله ثم قال : اللهم اكفني الغورث بما شئت . فأهوى بالسيف إلى النبي صلى الله عليه وسلم ليضربه ، فانكب لوجهه لزلقة زلقها . وذكر الواقدي أن جبريل عليه السلام دفعه في صدره على ما يأتي في المائدة ، وسقط السيف من يده فأخذه النبي صلى الله عليه وسلم وقال : من يمنعك مني يا غورث ؟ فقال : لا أحد . فقال : تشهد لي بالحق وأعطيك سيفك ؟ قال : لا ؛ ولكن أشهد ألا أقاتلك بعد هذا ولا أعين عليك عدوا ؛ فدفع إليه السيف ونزلت الآية رخصة في وضع السلاح في المطر . ومرض عبد الرحمن بن عوف من جرح كما في صحيح البخاري ، فرخص الله سبحانه لهم في ترك السلاح والتأهب للعدو بعذر المطر ، ثم أمرهم فقال : خذوا حذركم أي كونوا متيقظين ، وضعتم السلاح أو لم تضعوه . وهذا يدل على تأكيد التأهب والحذر من العدو في كل الأحوال وترك الاستسلام ؛ فإن الجيش ما جاءه مصاب قط إلا من تفريط في حذر ، وقال الضحاك في قوله تعالى : وخذوا حذركم يعني تقلدوا سيوفكم فإن ذلك هيئة الغزاة .\n                                    ",
        "saadi": "وَإِذَا كُنتَ فِيهِمۡ فَأَقَمۡتَ لَهُمُ ٱلصَّلَوٰةَ فَلۡتَقُمۡ طَآئِفَةٞ مِّنۡهُم مَّعَكَ وَلۡيَأۡخُذُوٓاْ أَسۡلِحَتَهُمۡۖ فَإِذَا سَجَدُواْ فَلۡيَكُونُواْ مِن وَرَآئِكُمۡ وَلۡتَأۡتِ طَآئِفَةٌ أُخۡرَىٰ لَمۡ يُصَلُّواْ فَلۡيُصَلُّواْ مَعَكَ وَلۡيَأۡخُذُواْ حِذۡرَهُمۡ وَأَسۡلِحَتَهُمۡۗ وَدَّ ٱلَّذِينَ كَفَرُواْ لَوۡ تَغۡفُلُونَ عَنۡ أَسۡلِحَتِكُمۡ وَأَمۡتِعَتِكُمۡ فَيَمِيلُونَ عَلَيۡكُم مَّيۡلَةٗ وَٰحِدَةٗۚ وَلَا جُنَاحَ عَلَيۡكُمۡ إِن كَانَ بِكُمۡ أَذٗى مِّن مَّطَرٍ أَوۡ كُنتُم مَّرۡضَىٰٓ أَن تَضَعُوٓاْ أَسۡلِحَتَكُمۡۖ وَخُذُواْ حِذۡرَكُمۡۗ إِنَّ ٱللَّهَ أَعَدَّ لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ٢٠١\n                                        \n                                        \n                                        \n                                        تفسير الآيتين 101 و102 :ـ هاتان الآيتان أصل في رخصة القصر، وصلاة الخوف، يقول تعالى: { وَإِذَا ضَرَبْتُمْ فِي الْأَرْضِ } أي: في السفر، وظاهر الآية [أنه] يقتضي الترخص في أي سفر كان ولو كان سفر معصية، كما هو مذهب أبي حنيفة رحمه الله، وخالف في ذلك الجمهور، وهم الأئمة الثلاثة وغيرهم، فلم يجوزوا الترخص في سفر المعصية، تخصيصا للآية بالمعنى والمناسبة، فإن الرخصة سهولة من الله لعباده إذا سافروا أن يقصروا ويفطروا، والعاصي بسفره لا يناسب حاله التخفيف. وقوله: { فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَقْصُرُوا مِنَ الصَّلَاةِ } أي: لا حرج ولا إثم عليكم في ذلك، ولا ينافي ذلك كون القصر هو الأفضل، لأن نفي الحرج إزالة لبعض الوهم الواقع في كثير من النفوس، بل ولا ينافي الوجوب كما تقدم ذلك في سورة البقرة في قوله: { إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ } إلى آخر الآية. وإزالة الوهم في هذا الموضع ظاهرة، لأن الصلاة قد تقرر عند المسلمين وجوبها على هذه الصفة التامة، ولا يزيل هذا عن نفوس أكثرهم إلا بذكر ما ينافيه. ويدل على أفضلية القصر على الإتمام أمران: أحدهما: ملازمة النبي صلى الله عليه وسلم على القصر في جميع أسفاره. والثاني: أن هذا من باب التوسعة والترخيص والرحمة بالعباد، والله تعالى يحب أن تؤتى رخصه كما يكره أن تؤتى معصيته. وقوله: { أَنْ تَقْصُرُوا مِنَ الصَّلَاةِ } ولم يقل أن تقصروا الصلاة فيه فائدتان: إحداهما: أنه لو قال أن تقصروا الصلاة لكان القصر غير منضبط بحد من الحدود، فربما ظن أنه لو قصر معظم الصلاة وجعلها ركعة واحدة لأجزأ، فإتيانه بقوله: { مِنَ الصَّلَاةِ } ليدل ذلك على أن القصر محدود مضبوط، مرجوع فيه إلى ما تقرر من فعل النبي صلى الله عليه وسلم وأصحابه. الثانية: أن { من } تفيد التبعيض ليعلم بذلك أن القصر لبعض الصلوات المفروضات لا جميعها، فإن الفجر والمغرب لا يقصران وإنما الذي يقصر الصلاة الرباعية من أربع إلى ركعتين. فإذا تقرر أن القصر في السفر رخصة، فاعلم أن المفسرين قد اختلفوا في هذا القيد، وهو قوله: { إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمُ الَّذِينَ كَفَرُوا } الذي يدل ظاهره أن القصر لا يجوز إلا بوجود الأمرين كليهما، السفر مع الخوف. ويرجع حاصل اختلافهم إلى أنه هل المراد بقوله: { أَنْ تَقْصُرُوا } قصر العدد فقط؟ أو قصر العدد والصفة؟ فالإشكال إنما يكون على الوجه الأول. وقد أشكل هذا على أمير المؤمنين عمر بن الخطاب رضي الله عنه، حتى سأل عنه النبي صلى الله عليه وسلم فقال: يا رسول الله ما لنا نقصر الصلاة وقد أمِنَّا؟ أي: والله يقول: { إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمُ الَّذِينَ كَفَرُوا } فقال رسول الله صلى الله عليه وسلم: \"صدقة تصدق الله بها عليكم فاقبلوا صدقته\" أو كما قال. فعلى هذا يكون هذا القيد أتى به نظرا لغالب الحال التي كان النبي صلى الله عليه وسلم وأصحابه عليها، فإن غالب أسفاره أسفار جهاد. وفيه فائدة أخرى وهي بيان الحكمة والمصلحة في مشروعية رخصة القصر، فبيَّن في هذه الآية أنهى ما يتصور من المشقة المناسبة للرخصة، وهي اجتماع السفر والخوف، ولا يستلزم ذلك أن لا يقصر مع السفر وحده، الذي هو مظنة المشقة. وأما على الوجه الثاني، وهو أن المراد بالقصر: قصر العدد والصفة فإن القيد على بابه، فإذا وجد السفر والخوف، جاز قصر العدد، وقصر الصفة، وإذا وجد السفر وحده جاز قصر العدد فقط، أو الخوف وحده جاز قصر الصفة. ولذلك أتى بصفة صلاة الخوف بعدها بقوله: { وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ } أي: صليت بهم صلاة تقيمها وتتم ما يجب فيها ويلزم، فعلمهم ما ينبغي لك ولهم فعله. ثم فسَّر ذلك بقوله: { فَلْتَقُمْ طَائِفَةٌ مِنْهُمْ مَعَكَ } أي: وطائفة قائمة بإزاء العدو كما يدل على ذلك ما يأتي: { فَإِذَا سَجَدُوا } أي: الذين معك أي: أكملوا صلاتهم وعبر عن الصلاة بالسجود ليدل على فضل السجود، وأنه ركن من أركانها، بل هو أعظم أركانها. { فَلْيَكُونُوا مِنْ وَرَائِكُمْ وَلْتَأْتِ طَائِفَةٌ أُخْرَى لَمْ يُصَلُّوا } وهم الطائفة الذين قاموا إزاء العدو { فَلْيُصَلُّوا مَعَكَ } ودل ذلك على أن الإمام يبقى بعد انصراف الطائفة الأولى منتظرا للطائفة الثانية، فإذا حضروا صلى بهم ما بقي من صلاته ثم جلس ينتظرهم حتى يكملوا صلاتهم، ثم يسلم بهم وهذا أحد الوجوه في صلاة الخوف. فإنها صحت عن النبي صلى الله عليه وسلم من وجوه كثيرة كلها جائزة، وهذه الآية تدل على أن صلاة الجماعة فرض عين من وجهين: أحدهما: أن الله تعالى أمر بها في هذه الحالة الشديدة، وقت اشتداد الخوف من الأعداء وحذر مهاجمتهم، فإذا أوجبها في هذه الحالة الشديدة فإيجابها في حالة الطمأنينة والأمن من باب أَوْلَى وأحرى. والثاني: أن المصلين صلاة الخوف يتركون فيها كثيرا من الشروط واللوازم، ويعفى فيها عن كثير من الأفعال المبطلة في غيرها، وما ذاك إلا لتأكد وجوب الجماعة، لأنه لا تعارض بين واجب ومستحب، فلولا وجوب الجماعة لم تترك هذه الأمور اللازمة لأجلها. وتدل الآية الكريمة على أن الأولى والأفضل أن يصلوا بإمام واحد. ولو تضمن ذلك الإخلال بشيء لا يخل به لو صلوها بعدة أئمة، وذلك لأجل اجتماع كلمة المسلمين واتفاقهم وعدم تفرق كلمتهم، وليكون ذلك أوقع هيبة في قلوب أعدائهم، وأمر تعالى بأخذ السلاح والحذر في صلاة الخوف، وهذا وإن كان فيه حركة واشتغال عن بعض أحوال الصلاة فإن فيه مصلحة راجحة وهو الجمع بين الصلاة والجهاد، والحذر من الأعداء الحريصين غاية الحرص على الإيقاع بالمسلمين والميل عليهم وعلى أمتعتهم، ولهذا قال تعالى: { وَدَّ الَّذِينَ كَفَرُوا لَوْ تَغْفُلُونَ عَنْ أَسْلِحَتِكُمْ وَأَمْتِعَتِكُمْ فَيَمِيلُونَ عَلَيْكُمْ مَيْلَةً وَاحِدَةً } ثم إن الله عذر من له عذر من مرض أو مطر أن يضع سلاحه، ولكن مع أخذ الحذر فقال: { وَلَا جُنَاحَ عَلَيْكُمْ إِنْ كَانَ بِكُمْ أَذًى مِنْ مَطَرٍ أَوْ كُنْتُمْ مَرْضَى أَنْ تَضَعُوا أَسْلِحَتَكُمْ وَخُذُوا حِذْرَكُمْ إِنَّ اللَّهَ أَعَدَّ لِلْكَافِرِينَ عَذَابًا مُهِينًا } ومن العذاب المهين ما أمر الله به حزبه المؤمنين وأنصار دينه الموحدين من قتلهم وقتالهم حيثما ثقفوهم، ويأخذوهم ويحصروهم، ويقعدوا لهم كل مرصد، ويحذروهم في جميع الأحوال، ولا يغفلوا عنهم، خشية أن ينال الكفار بعض مطلوبهم فيهم. فلله أعظم حمد وثناء على ما مَنَّ به على المؤمنين، وأيَّدَهم بمعونته وتعاليمه التي لو سلكوها على وجه الكمال لم تهزم لهم راية، ولم يظهر عليهم عدو في وقت من الأوقات. وفي قوله: { فَإِذَا سَجَدُوا فَلْيَكُونُوا مِنْ وَرَائِكُمْ } يدل على أن هذه الطائفة تكمل جميع صلاتها قبل ذهابهم إلى موضع الحارسين. وأن الرسول صلى الله عليه وسلم يثبت منتظرا للطائفة الأخرى قبل السلام، لأنه أولا ذكر أن الطائفة تقوم معه، فأخبر عن مصاحبتهم له. ثم أضاف الفعل بعْدُ إليهم دون الرسول، فدل ذلك على ما ذكرناه. وفي قوله: { وَلْتَأْتِ طَائِفَةٌ أُخْرَى لَمْ يُصَلُّوا فَلْيُصَلُّوا مَعَكَ } دليل على أن الطائفة الأولى قد صلوا، وأن جميع صلاة الطائفة الثانية تكون مع الإمام حقيقة في ركعتهم الأولى، وحكما في ركعتهم الأخيرة، فيستلزم ذلك انتظار الإمام إياهم حتى يكملوا صلاتهم، ثم يسلم بهم، وهذا ظاهر للمتأمل.\n                                    "
      },
      "originalText": "وَإِذَا كُنتَ فِيهِمۡ فَأَقَمۡتَ لَهُمُ ٱلصَّلَوٰةَ فَلۡتَقُمۡ طَآئِفَةٞ مِّنۡهُم مَّعَكَ وَلۡيَأۡخُذُوٓاْ أَسۡلِحَتَهُمۡۖ فَإِذَا سَجَدُواْ فَلۡيَكُونُواْ مِن وَرَآئِكُمۡ وَلۡتَأۡتِ طَآئِفَةٌ أُخۡرَىٰ لَمۡ يُصَلُّواْ فَلۡيُصَلُّواْ مَعَكَ وَلۡيَأۡخُذُواْ حِذۡرَهُمۡ وَأَسۡلِحَتَهُمۡۗ وَدَّ ٱلَّذِينَ كَفَرُواْ لَوۡ تَغۡفُلُونَ عَنۡ أَسۡلِحَتِكُمۡ وَأَمۡتِعَتِكُمۡ فَيَمِيلُونَ عَلَيۡكُم مَّيۡلَةٗ وَٰحِدَةٗۚ وَلَا جُنَاحَ عَلَيۡكُمۡ إِن كَانَ بِكُمۡ أَذٗى مِّن مَّطَرٍ أَوۡ كُنتُم مَّرۡضَىٰٓ أَن تَضَعُوٓاْ أَسۡلِحَتَكُمۡۖ وَخُذُواْ حِذۡرَكُمۡۗ إِنَّ ٱللَّهَ أَعَدَّ لِلۡكَٰفِرِينَ عَذَابٗا مُّهِينٗا ٢٠١"
    },
    {
      "number": 596,
      "text": "فَإِذَا قَضَيْتُمُ الصَّلَاةَ فَاذْكُرُوا اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا اطْمَأْنَنْتُمْ فَأَقِيمُوا الصَّلَاةَ ۚ إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 103,
      "juz": 5,
      "manzil": 1,
      "page": 95,
      "ruku": 76,
      "hizbQuarter": 38,
      "sajda": false,
      "tafsier": {
        "ibnkther": "فَإِذَا قَضَيۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُواْ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِيمُواْ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ كَانَتۡ عَلَى ٱلۡمُؤۡمِنِينَ كِتَٰبٗا مَّوۡقُوتٗا ٣٠١\n                                    \n                                    \n                                    يأمر الله تعالى بكثرة الذكر عقيب صلاة الخوف ، وإن كان مشروعا مرغبا فيه أيضا بعد غيرها ، ولكن هاهنا آكد لما وقع فيها من التخفيف في أركانها ، ومن الرخصة في الذهاب فيها والإياب وغير ذلك ، مما ليس يوجد في غيرها ، كما قال تعالى في الأشهر الحرم : ( فلا تظلموا فيهن أنفسكم ) [ التوبة : 36 ] ، وإن كان هذا منهيا عنه في غيرها ، ولكن فيها آكد لشدة حرمتها وعظمها ; ولهذا قال تعالى : ( فإذا قضيتم الصلاة فاذكروا الله قياما وقعودا وعلى جنوبكم ) أي في سائر أحوالكم .\nثم قال : ( فإذا اطمأننتم فأقيموا الصلاة ) أي : فإذا أمنتم وذهب الخوف ، وحصلت الطمأنينة ( فأقيموا الصلاة ) أي : فأتموها وأقيموها كما أمرتم بحدودها ، وخشوعها ، وسجودها وركوعها ، وجميع شئونها .\nوقوله : ( إن الصلاة كانت على المؤمنين كتابا موقوتا ) قال ابن عباس : أي مفروضا . وكذا روي عن مجاهد ، وسالم بن عبد الله ، وعلي بن الحسين ، ومحمد بن علي ، والحسن ، ومقاتل ، والسدي ، وعطية العوفي .\nوقال عبد الرزاق ، عن معمر ، عن قتادة : ( إن الصلاة كانت على المؤمنين كتابا موقوتا ) قال ابن مسعود : إن للصلاة وقتا كوقت الحج .\nوقال زيد بن أسلم : ( إن الصلاة كانت على المؤمنين كتابا موقوتا ) قال : منجما ، كلما مضى نجم ، جاءتهم يعني : كلما مضى وقت جاء وقت .\n                                    ",
        "qortoby": "فَإِذَا قَضَيۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُواْ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِيمُواْ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ كَانَتۡ عَلَى ٱلۡمُؤۡمِنِينَ كِتَٰبٗا مَّوۡقُوتٗا ٣٠١\n                                    \n                                    \n                                    قوله : فإذا قضيتم الصلاة فاذكروا الله قياما وقعودا وعلى جنوبكم فإذا اطمأننتم فأقيموا الصلاة إن الصلاة كانت على المؤمنين كتابا موقوتا\nفيه مسائل :\nالأولى : قضيتم معناه فرغتم من صلاة الخوف وهذا يدل على أن القضاء يستعمل فيما قد فعل في وقته ؛ ومنه قوله تعالى : فإذا قضيتم مناسككم وقد تقدم .\nالثانية : قوله تعالى : فاذكروا الله قياما وقعودا وعلى جنوبكم ذهب الجمهور إلى أن هذا الذكر المأمور به . إنما هو إثر صلاة الخوف ؛ أي إذا فرغتم من الصلاة فاذكروا الله بالقلب واللسان ، على أي حال كنتم قياما وقعودا وعلى جنوبكم وأديموا ذكره بالتكبير والتهليل والدعاء بالنصر لا سيما في حال القتال . ونظيره إذا لقيتم فئة فاثبتوا واذكروا الله كثيرا لعلكم تفلحون . ويقال : فإذا قضيتم الصلاة بمعنى إذا صليتم في دار الحرب فصلوا على الدواب ، أو قياما أو قعودا أو على جنوبكم إن لم تستطيعوا القيام ، إذا كان خوفا أو مرضا ؛ كما قال تعالى في آية أخرى : فإن خفتم فرجالا أو ركبانا وقال قوم : هذه الآية نظيرة التي في \" آل عمران \" ؛ فروي أن عبد الله بن مسعود رأى الناس يضجون في المسجد فقال : ما هذه الضجة ؟ قالوا : أليس الله تعالى يقول فاذكروا الله قياما وقعودا وعلى جنوبكم ؟ قال : إنما يعني بهذا الصلاة المكتوبة إن لم تستطع قائما فقاعدا ، وإن لم تستطع فصل على جنبك . فالمراد نفس الصلاة ؛ لأن الصلاة ذكر الله تعالى ، وقد اشتملت على الأذكار المفروضة والمسنونة ؛ والقول الأول أظهر . والله أعلم .\nالثالثة : قوله تعالى : فإذا اطمأننتم أي أمنتم . والطمأنينة سكون النفس من الخوف . فأقيموا الصلاة أي فأتوها بأركانها وبكمال هيئتها في السفر ، وبكمال عددها في الحضر . إن الصلاة كانت على المؤمنين كتابا موقوتا أي مؤقتة مفروضة . وقال زيد بن أسلم : موقوتا منجما ، أي تؤدونها في أنجمها ؛ والمعنى عند أهل اللغة : مفروض لوقت بعينه ؛ يقال : وقته فهو موقوت . ووقته فهو مؤقت . وهذا قول زيد بن أسلم بعينه . وقال : كتابا والمصدر مذكر ؛ فلهذا قال : موقوتا .\n\n                                    ",
        "saadi": "فَإِذَا قَضَيۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُواْ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِيمُواْ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ كَانَتۡ عَلَى ٱلۡمُؤۡمِنِينَ كِتَٰبٗا مَّوۡقُوتٗا ٣٠١\n                                        \n                                        \n                                        \n                                        أي: فإذا فرغتم من صلاتكم، صلاة الخوف وغيرها، فاذكروا الله في جميع أحوالكم وهيئاتكم، ولكن خصت صلاة الخوف بذلك لفوائد. منها: أن القلب صلاحه وفلاحه وسعادته بالإنابة إلى الله تعالى في المحبة وامتلاء القلب من ذكره والثناء عليه. وأعظم ما يحصل به هذا المقصود الصلاة، التي حقيقتها أنها صلة بين العبد وبين ربه. ومنها: أن فيها من حقائق الإيمان ومعارف الإيقان ما أوجب أن يفرضها الله على عباده كل يوم وليلة. ومن المعلوم أن صلاة الخوف لا تحصل فيها هذه المقاصد الحميدة بسبب اشتغال القلب والبدن والخوف فأمر بجبرها بالذكر بعدها. ومنها: أن الخوف يوجب من قلق القلب وخوفه ما هو مظنة لضعفه، وإذا ضعف القلب ضعف البدن عن مقاومة العدو، والذكر لله والإكثار منه من أعظم مقويات القلب. ومنها: أن الذكر لله تعالى مع الصبر والثبات سبب للفلاح والظفر بالأعداء، كما قال تعالى: { يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا لَقِيتُمْ فِئَةً فَاثْبُتُوا وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ } فأمر بالإكثار منه في هذه الحال إلى غير ذلك من الحِكَم. وقوله: { فَإِذَا اطْمَأْنَنْتُمْ فَأَقِيمُوا الصَّلَاة } أي: إذا أمنتم من الخوف واطمأنت قلوبكم وأبدانكم فأتموا صلاتكم على الوجه الأكمل ظاهرا وباطنا، بأركانها وشروطها وخشوعها وسائر مكملاتها. { إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا } أي: مفروضا في وقته، فدل ذلك على فرضيتها، وأن لها وقتا لا تصح إلا به، وهو هذه الأوقات التي قد تقررت عند المسلمين صغيرهم وكبيرهم، عالمهم وجاهلهم، وأخذوا ذلك عن نبيهم محمد صلى الله عليه وسلم بقوله: \"صلوا كما رأيتموني أصلي\" ودل قوله: { عَلَى الْمُؤْمِنِينَ } على أن الصلاة ميزان الإيمان وعلى حسب إيمان العبد تكون صلاته وتتم وتكمل، ويدل ذلك على أن الكفار وإن كانوا ملتزمين لأحكام المسلمين كأهل الذمة - أنهم لا يخاطبون بفروع الدين كالصلاة، ولا يؤمرون بها، بل ولا تصح منهم ما داموا على كفرهم، وإن كانوا يعاقبون عليها وعلى سائر الأحكام في الآخرة.\n                                    "
      },
      "originalText": "فَإِذَا قَضَيۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُواْ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِيمُواْ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ كَانَتۡ عَلَى ٱلۡمُؤۡمِنِينَ كِتَٰبٗا مَّوۡقُوتٗا ٣٠١"
    },
    {
      "number": 597,
      "text": "وَلَا تَهِنُوا فِي ابْتِغَاءِ الْقَوْمِ ۖ إِنْ تَكُونُوا تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ ۖ وَتَرْجُونَ مِنَ اللَّهِ مَا لَا يَرْجُونَ ۗ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 104,
      "juz": 5,
      "manzil": 1,
      "page": 95,
      "ruku": 76,
      "hizbQuarter": 38,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَا تَهِنُواْ فِي ٱبۡتِغَآءِ ٱلۡقَوۡمِۖ إِن تَكُونُواْ تَأۡلَمُونَ فَإِنَّهُمۡ يَأۡلَمُونَ كَمَا تَأۡلَمُونَۖ وَتَرۡجُونَ مِنَ ٱللَّهِ مَا لَا يَرۡجُونَۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًا ٤٠١\n                                    \n                                    \n                                    وقوله : ( ولا تهنوا في ابتغاء القوم ) أي : لا تضعفوا في طلب عدوكم ، بل جدوا فيهم وقاتلوهم ، واقعدوا لهم كل مرصد : ( إن تكونوا تألمون فإنهم يألمون كما تألمون ) أي : كما يصيبكم الجراح والقتل ، كذلك يحصل لهم ، كما قال ( إن يمسسكم قرح فقد مس القوم قرح مثله ) [ آل عمران : 140 ] .\nثم قال : ( وترجون من الله ما لا يرجون ) أي : أنتم وإياهم سواء فيما يصيبكم وإياهم من الجراح والآلام ، ولكن أنتم ترجون من الله المثوبة والنصر والتأييد ، وهم لا يرجون شيئا من ذلك ، فأنتم أولى بالجهاد منهم ، وأشد رغبة في إقامة كلمة الله وإعلائها .\n( وكان الله عليما حكيما ) أي : هو أعلم وأحكم فيما يقدره ويقضيه ، وينفذه ويمضيه ، من أحكامه الكونية والشرعية ، وهو المحمود على كل حال .\n                                    ",
        "qortoby": "وَلَا تَهِنُواْ فِي ٱبۡتِغَآءِ ٱلۡقَوۡمِۖ إِن تَكُونُواْ تَأۡلَمُونَ فَإِنَّهُمۡ يَأۡلَمُونَ كَمَا تَأۡلَمُونَۖ وَتَرۡجُونَ مِنَ ٱللَّهِ مَا لَا يَرۡجُونَۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًا ٤٠١\n                                    \n                                    \n                                    قوله تعالى : ولا تهنوا أي لا تضعفوا ، وقد تقدم في \" آل عمران \" . في ابتغاء القوم طلبهم قيل : نزلت في حرب أحد حيث أمر النبي صلى الله عليه وسلم بالخروج في آثار المشركين ، وكان بالمسلمين جراحات ، وكان أمر ألا يخرج معه إلا من كان في الوقعة ، كما تقدم في \" آل عمران \" وقيل : هذا في كل جهاد\nقوله تعالى : إن تكونوا تألمون أي تتألمون مما أصابكم من الجراح فهم يتألمون أيضا مما يصيبهم ، ولكم مزية وهي أنكم ترجون ثواب الله وهم لا يرجونه ؛ وذلك أن من لا يؤمن بالله لا يرجو من الله شيئا . ونظير هذه الآية إن يمسسكم قرح فقد مس القوم قرح مثله وقد تقدم . وقرأ عبد الرحمن الأعرج \" أن تكونوا \" بفتح الهمزة ، أي لأن وقرأ منصور بن المعتمر \" إن تكونوا تئلمون \" بكسر التاء . ولا يجوز عند البصريين كسر التاء لثقل الكسر فيها . ثم قيل : الرجاء هنا بمعنى الخوف ؛ لأن من رجا شيئا فهو غير قاطع بحصوله فلا يخلو من خوف فوت ما يرجو . وقال الفراء والزجاج : لا يطلق الرجاء بمعنى الخوف إلا مع النفي ؛ كقوله تعالى : ما لكم لا ترجون لله وقارا أي لا تخافون لله عظمة . وقوله تعالى : للذين لا يرجون أيام الله أي لا يخافون . قال القشيري : ولا يبعد ذكر الخوف من غير أن يكون في الكلام نفي ، ولكنهما ادعيا أنه لم يوجد ذلك إلا مع النفي . والله أعلم .\n                                    ",
        "saadi": "وَلَا تَهِنُواْ فِي ٱبۡتِغَآءِ ٱلۡقَوۡمِۖ إِن تَكُونُواْ تَأۡلَمُونَ فَإِنَّهُمۡ يَأۡلَمُونَ كَمَا تَأۡلَمُونَۖ وَتَرۡجُونَ مِنَ ٱللَّهِ مَا لَا يَرۡجُونَۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًا ٤٠١\n                                        \n                                        \n                                        \n                                        أي: لا تضعفوا ولا تكسلوا في ابتغاء عدوكم من الكفار، أي: في جهادهم والمرابطة على ذلك، فإن وَهَن القلب مستدع لوَهَن البدن، وذلك يضعف عن مقاومة الأعداء. بل كونوا أقوياء نشيطين في قتالهم. ثم ذكر ما يقوي قلوب المؤمنين، فذكر شيئين: الأول: أن ما يصيبكم من الألم والتعب والجراح ونحو ذلك فإنه يصيب أعداءكم، فليس من المروءة الإنسانية والشهامة الإسلامية أن تكونوا أضعف منهم، وأنتم وإياهم قد تساويتم فيما يوجب ذلك، لأن العادة الجارية لا يضعف إلا من توالت عليه الآلام وانتصر عليه الأعداء على الدوام، لا من يدال مرة، ويدال عليه أخرى. الأمر الثاني: أنكم ترجون من الله ما لا يرجون، فترجون الفوز بثوابه والنجاة من عقابه، بل خواص المؤمنين لهم مقاصد عالية وآمال رفيعة من نصر دين الله، وإقامة شرعه، واتساع دائرة الإسلام، وهداية الضالين، وقمع أعداء الدين، فهذه الأمور توجب للمؤمن المصدق زيادة القوة، وتضاعف النشاط والشجاعة التامة؛ لأن من يقاتل ويصبر على نيل عزه الدنيوي إن ناله، ليس كمن يقاتل لنيل السعادة الدنيوية والأخروية، والفوز برضوان الله وجنته، فسبحان من فاوت بين العباد وفرق بينهم بعلمه وحكمته، ولهذا قال: { وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا } كامل العلم كامل الحكمة\n                                    "
      },
      "originalText": "وَلَا تَهِنُواْ فِي ٱبۡتِغَآءِ ٱلۡقَوۡمِۖ إِن تَكُونُواْ تَأۡلَمُونَ فَإِنَّهُمۡ يَأۡلَمُونَ كَمَا تَأۡلَمُونَۖ وَتَرۡجُونَ مِنَ ٱللَّهِ مَا لَا يَرۡجُونَۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًا ٤٠١"
    },
    {
      "number": 598,
      "text": "إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَا أَرَاكَ اللَّهُ ۚ وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 105,
      "juz": 5,
      "manzil": 1,
      "page": 95,
      "ruku": 77,
      "hizbQuarter": 38,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّآ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَيۡنَ ٱلنَّاسِ بِمَآ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَآئِنِينَ خَصِيمٗا ٥٠١\n                                    \n                                    \n                                    يقول تعالى مخاطبا لرسوله محمد صلى الله عليه وسلم : ( إنا أنزلنا إليك الكتاب بالحق ) أي : هو حق من الله ، وهو يتضمن الحق في خبره وطلبه .\nوقوله : ( لتحكم بين الناس بما أراك الله ) احتج به من ذهب من علماء الأصول إلى أنه كان ، عليه السلام ، له أن يحكم بالاجتهاد بهذه الآية ، وبما ثبت في الصحيحين من رواية هشام بن عروة ، عن أبيه ، عن زينب بنت أم سلمة ، عن أم سلمة ; أن رسول الله صلى الله عليه وسلم سمع جلبة خصم بباب حجرته ، فخرج إليهم فقال : \" ألا إنما أنا بشر ، وإنما أقضي بنحو مما أسمع ، ولعل أحدكم أن يكون ألحن بحجته من بعض ، فأقضي له ، فمن قضيت له بحق مسلم فإنما هي قطعة من نار فليحملها أو ليذرها \" .\nوقال الإمام أحمد : حدثنا وكيع ، حدثنا أسامة بن زيد ، عن عبد الله بن رافع ، عن أم سلمة قالت : جاء رجلان من الأنصار يختصمان إلى رسول الله صلى الله عليه وسلم في مواريث بينهما قد درست ، ليس عندهما بينة ، فقال رسول الله صلى الله عليه وسلم : \" إنكم تختصمون إلي ، وإنما أنا بشر ، ولعل بعضكم ألحن بحجته من بعض ، وإنما أقضي بينكم على نحو مما أسمع ، فمن قضيت له من حق أخيه شيئا فلا يأخذه ، فإنما أقطع له قطعة من النار ، يأتي بها إسطاما في عنقه يوم القيامة \" . فبكى الرجلان وقال كل منهما : حقي لأخي فقال رسول الله صلى الله عليه وسلم : \" أما إذا قلتما فاذهبا فاقتسما ، ثم توخيا الحق ، ثم استهما ، ثم ليحلل كل واحد منكما صاحبه \" .\nوقد رواه أبو داود من حديث أسامة بن زيد ، به . وزاد : \" إني إنما أقضي بينكما برأي فيما لم ينزل علي فيه \" .\nوقد روى ابن مردويه ، من طريق العوفي ، عن ابن عباس قال : إن نفرا من الأنصار غزوا مع رسول الله صلى الله عليه وسلم في بعض غزواته ، فسرقت درع لأحدهم ، فأظن بها رجل من الأنصار ، فأتى صاحب الدرع رسول الله صلى الله عليه وسلم فقال : إن طعمة بن أبيرق سرق درعي ، فلما رأى السارق ذلك عمد إليها فألقاها في بيت رجل بريء ، وقال لنفر من عشيرته : إني غيبت الدرع وألقيتها في بيت فلان ، وستوجد عنده . فانطلقوا إلى نبي الله صلى الله عليه وسلم ليلا فقالوا : يا نبي الله ، إن صاحبنا بريء . وإن صاحب الدرع فلان ، وقد أحطنا بذلك علما ، فاعذر صاحبنا على رؤوس الناس وجادل عنه . فإنه إلا يعصمه الله بك يهلك ، فقام رسول الله صلى الله عليه وسلم فبرأه وعذره على رؤوس الناس ، فأنزل الله : ( إنا أنزلنا إليك الكتاب بالحق لتحكم بين الناس بما أراك الله ولا تكن للخائنين خصيما ) [ يقول : احكم بما أنزل الله إليك في الكتاب ] ( واستغفر الله إن الله كان غفورا رحيما . ولا تجادل عن الذين يختانون أنفسهم [ إن الله لا يحب من كان خوانا أثيما ] ) ثم قال للذين أتوا رسول الله صلى الله عليه وسلم مستخفين بالكذب : ( يستخفون من الناس ولا يستخفون من الله [ وهو معهم إذ يبيتون ما لا يرضى من القول وكان الله بما يعملون محيطا . ها أنتم هؤلاء جادلتم عنهم في الحياة الدنيا فمن يجادل الله عنهم يوم القيامة أم من يكون عليهم وكيلا ] ) يعني : الذين أتوا رسول الله صلى الله عليه وسلم مستخفين يجادلون عن الخائنين ثم قال : ( ومن يعمل سوءا أو يظلم نفسه [ ثم يستغفر الله يجد الله غفورا رحيما ] ) يعني : الذين أتوا رسول الله صلى الله عليه وسلم مستخفين بالكذب ، ثم قال : ( ومن يكسب خطيئة أو إثما ثم يرم به بريئا فقد احتمل بهتانا وإثما مبينا ) يعني : السارق والذين جادلوا عن السارق . وهذا سياق غريب وكذا ذكر مجاهد ، وعكرمة ، وقتادة ، والسدي ، وابن زيد وغيرهم في هذه الآية أنها أنزلت في سارق بني أبيرق على اختلاف سياقاتهم ، وهي متقاربة .\nوقد روى هذه القصة محمد بن إسحاق مطولة ، فقال أبو عيسى الترمذي عند تفسير هذه الآية من جامعه ، وابن جرير في تفسيره :\nحدثنا الحسن بن أحمد بن أبي شعيب أبو مسلم الحراني ، حدثنا محمد بن سلمة الحراني ، حدثنا محمد بن إسحاق ، عن عاصم بن عمر بن قتادة ، عن أبيه ، عن جده قتادة بن النعمان ، رضي الله عنه ، قال : كان أهل بيت منا يقال لهم بنو أبيرق : بشر وبشير ومبشر ، وكان بشير رجلا منافقا ، يقول الشعر يهجو به أصحاب النبي صلى الله عليه وسلم ، ثم ينحله بعض العرب ، ثم يقول : قال فلان كذا وكذا ، وقال فلان كذا وكذا ، فإذا سمع أصحاب رسول الله صلى الله عليه وسلم ذلك الشعر قالوا : والله ما يقول هذا الشعر إلا هذا الخبيث ؟ - أو كما قال الرجل - وقالوا ابن الأبيرق قالها . قالوا : وكانوا أهل بيت حاجة وفاقة في الجاهلية والإسلام ، وكان الناس إنما طعامهم بالمدينة التمر والشعير ، وكان الرجل إذا كان له يسار فقدمت ضافطة من الشام من الدرمك ابتاع الرجل منها فخص بها نفسه ، وأما العيال فإنما طعامهم التمر والشعير ، فقدمت ضافطة من الشام ، فابتاع عمي رفاعة بن زيد حملا من الدرمك فحطه في مشربة له ، وفي المشربة سلاح : درع وسيف ، فعدي عليه من تحت البيت ، فنقبت المشربة وأخذ الطعام والسلاح . فلما أصبح أتاني عمي رفاعة فقال : يا ابن أخي ، إنه قد عدي علينا في ليلتنا هذه . فنقبت مشربتنا وذهب بطعامنا وسلاحنا . قال : فتجسسنا في الدار وسألنا ، فقيل لنا : قد رأينا بني أبيرق استوقدوا في هذه الليلة ، ولا نرى فيما نرى إلا على بعض طعامكم .\nقال : وكان بنو أبيرق قالوا - ونحن نسأل في الدار - : والله ما نرى صاحبكم إلا لبيد بن سهل رجلا منا له صلاح وإسلام . فلما سمع لبيد اخترط سيفه وقال : أنا أسرق ؟ والله ليخالطنكم هذا السيف ، أو لتبينن هذه السرقة . قالوا : إليك عنا أيها الرجل ، فما أنت بصاحبها . فسألنا في الدار حتى لم نشك أنهم أصحابها .\nفقال لي عمي : يا ابن أخي ، لو أتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له . قال قتادة : فأتيت رسول الله صلى الله عليه وسلم فقلت : إن أهل بيت منا أهل جفاء عمدوا إلى عمي رفاعة بن زيد ، فنقبوا مشربة له ، وأخذوا سلاحه وطعامه . فليردوا علينا سلاحنا ، فأما الطعام فلا حاجة لنا فيه . فقال النبي صلى الله عليه وسلم \" سآمر في ذلك \" .\nفلما سمع بنو أبيرق أتوا رجلا منهم يقال له : أسير بن عمرو فكلموه في ذلك ، فاجتمع في ذلك أناس من أهل الدار فقالوا : يا رسول الله ، إن قتادة بن النعمان وعمه عمدا إلى أهل بيت منا أهل إسلام وصلاح ، يرمونهم بالسرقة من غير بينة ولا ثبت . قال قتادة : فأتيت النبي صلى الله عليه وسلم فكلمته ، فقال : \" عمدت إلى أهل بيت ذكر منهم إسلام وصلاح ، ترميهم بالسرقة على غير ثبت ولا بينة ؟ ؟\nقال : فرجعت ولوددت أني خرجت من بعض مالي ، ولم أكلم رسول الله صلى الله عليه وسلم في ذلك ، فأتاني عمي رفاعة فقال : يا ابن أخي ، ما صنعت ؟ فأخبرته بما قال لي رسول الله صلى الله عليه وسلم ، فقال : الله المستعان . فلم نلبث أن نزل القرآن : ( إنا أنزلنا إليك الكتاب بالحق لتحكم بين الناس بما أراك الله ولا تكن للخائنين خصيما ) بني أبيرق\n                                    ",
        "qortoby": "إِنَّآ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَيۡنَ ٱلنَّاسِ بِمَآ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَآئِنِينَ خَصِيمٗا ٥٠١\n                                    \n                                    \n                                    قوله تعالى : إنا أنزلنا إليك الكتاب بالحق لتحكم بين الناس بما أراك الله ولا تكن للخائنين خصيما\nفيه أربع مسائل :\nالأولى : في هذه الآية تشريف للنبي صلى الله عليه وسلم وتكريم وتعظيم وتفويض إليه ، وتقويم أيضا على الجادة في الحكم ، وتأنيب على ما رفع إليه من أمر بني أبيرق ! وكانوا ثلاثة إخوة : بشر وبشير ومبشر ، وأسير بن عروة ابن عم لهم ؛ نقبوا مشربة لرفاعة بن زيد في الليل وسرقوا أدراعا له وطعاما ، فعثر على ذلك . وقيل إن السارق بشير وحده ، وكان يكنى أبا طعمة أخذ درعا ؛ قيل : كان الدرع في جراب فيه دقيق ، فكان الدقيق ينتثر من خرق في الجراب حتى انتهى إلى داره ، فجاء ابن أخي رفاعة واسمه قتادة بن النعمان يشكوهم إلى النبي صلى الله عليه وسلم ، فجاء أسير بن عروة إلى النبي صلى الله عليه وسلم فقال : يا رسول الله ، إن هؤلاء عمدوا إلى أهل بيت هم أهل صلاح ودين فأنبوهم بالسرقة ورموهم بها من غير بينة ؛ وجعل يجادل عنهم حتى غضب رسول الله صلى الله عليه وسلم على قتادة ورفاعة ؛ فأنزل الله تعالى : ولا تجادل عن الذين يختانون أنفسهم الآية . وأنزل الله تعالى : ومن يكسب خطيئة أو إثما ثم يرم به بريئا وكان البريء الذي رموه بالسرقة لبيد بن سهل . وقيل : زيد بن السمين وقيل : رجل من الأنصار . فلما أنزل الله ما أنزل ، هرب ابن أبيرق السارق إلى مكة ، ونزل على سلافة بنت سعد بن شهيد ؛ فقال فيها حسان بن ثابت بيتا يعرض فيه بها ، وهو :\nوقد أنزلته بنت سعد وأصبحت ينازعها جلد استها وتنازعه ظننتم بأن يخفى الذي قد صنعتمو\nوفينا نبي عنده الوحي واضعه\nفلما بلغها قالت : إنما أهديت لي شعر حسان ؛ وأخذت رحله فطرحته خارج المنزل ، فهرب إلى خيبر وارتد . ثم إنه نقب بيتا ذات ليلة ليسرق فسقط الحائط عليه فمات مرتدا . ذكر هذا الحديث بكثير من ألفاظه الترمذي وقال : حديث حسن غريب ، لا نعلم أحدا أسنده غير محمد بن سلمة الحراني . وذكره الليث والطبري بألفاظ مختلفة . وذكر قصة موته يحيى بن سلام في تفسيره ، والقشيري كذلك وزاد ذكر الردة . ثم قيل : كان زيد بن السمين ولبيد بن سهل يهوديين . وقيل : كان لبيد مسلما . وذكره المهدوي ، وأدخله أبو عمر في كتاب الصحابة له ، فدل ذلك على إسلامه عنده . وكان بشير رجلا منافقا يهجو أصحاب النبي صلى الله عليه وسلم وينحل الشعر غيره ، وكان المسلمون يقولون : والله ما هو إلا شعر الخبيث . فقال شعرا يتنصل فيه ؛ فمنه قوله :\nأوكلما قال الرجال قصيدة نحلت وقالوا ابن الأبيرق قالها\nوقال الضحاك : أراد النبي صلى الله عليه وسلم أن يقطع يده وكان مطاعا ، فجاءت اليهود شاكين في السلاح فأخذوه وهربوا به ؛ فنزل ها أنتم هؤلاء يعني اليهود . والله أعلم .\nالثانية : قوله تعالى : بما أراك الله معناه على قوانين الشرع ؛ إما بوحي ونص ، أو بنظر جار على سنن الوحي . وهذا أصل في القياس ، وهو يدل على أن النبي صلى الله عليه وسلم إذا رأى شيئا أصاب ؛ لأن الله تعالى أراه ذلك ، وقد ضمن الله تعالى لأنبيائه العصمة ؛ فأما أحدنا إذا رأى شيئا يظنه فلا قطع فيما رآه ، ولم يرد رؤية العين هنا ؛ لأن الحكم لا يرى بالعين . وفي الكلام إضمار ، أي بما أراكه الله ، وفيه إضمار آخر ، وامض الأحكام على ما عرفناك من غير اغترار باستدلالهم .\nالثالثة : قوله تعالى : ولا تكن للخائنين خصيما اسم فاعل ؛ كقولك : جالسته فأنا جليسه ، ولا يكون فعيلا هنا بمعنى مفعول ؛ يدل على ذلك ولا تجادل فالخصيم هو المجادل وجمع الخصيم خصماء . وقيل : خصيما مخاصما اسم فاعل أيضا . فنهى الله عز وجل رسوله عن عضد أهل التهم والدفاع عنهم بما يقوله خصمهم من الحجة . وفي هذا دليل على أن النيابة عن المبطل والمتهم في الخصومة لا تجوز . فلا يجوز لأحد أن يخاصم عن أحد إلا بعد أن يعلم أنه محق . ومشى الكلام في السورة على حفظ أموال اليتامى والناس ؛ فبين أن مال الكافر محفوظ عليه كمال المسلم ، إلا في الموضع الذي أباحه الله تعالى .\nالمسألة الرابعة : قال العلماء : ولا ينبغي إذا ظهر للمسلمين نفاق قوم أن يجادل فريق منهم فريقا عنهم ليحموهم ويدفعوا عنهم ؛ فإن هذا قد وقع على عهد النبي صلى الله عليه وسلم وفيهم نزل قوله تعالى : ولا تكن للخائنين خصيما وقوله : ولا تجادل عن الذين يختانون أنفسهم . والخطاب للنبي صلى الله عليه وسلم والمراد منه الذين كانوا يفعلونه من المسلمين دونه لوجهين : أحدهما : أنه تعالى أبان ذلك بما ذكره بعد بقوله : ها أنتم هؤلاء جادلتم عنهم في الحياة الدنيا . والآخر : أن النبي صلى الله عليه وسلم كان حكما فيما بينهم ، ولذلك كان يعتذر إليه ولا يعتذر هو إلى غيره ، فدل على أن القصد لغيره .\n                                    ",
        "saadi": "إِنَّآ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَيۡنَ ٱلنَّاسِ بِمَآ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَآئِنِينَ خَصِيمٗا ٥٠١\n                                        \n                                        \n                                        \n                                        يخبر تعالى أنه أنزل على عبده ورسوله الكتاب بالحق، أي: محفوظًا في إنزاله من الشياطين، أن يتطرق إليه منهم باطل، بل نزل بالحق، ومشتملا أيضا على الحق، فأخباره صدق، وأوامره ونواهيه عدل { وَتَمَّتْ كَلِمَةُ رَبِّكَ صِدْقًا وَعَدْلًا } وأخبر أنه أنزله ليحكم بين الناس. وفي الآية الأخرى: { وَأَنْزَلْنَا إِلَيْكَ الذِّكْرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ }. فيحتمل أن هذه الآية في الحكم بين الناس في مسائل النزاع والاختلاف، وتلك في تبيين جميع الدين وأصوله وفروعه، ويحتمل أن الآيتين كلتيهما معناهما واحد، فيكون الحكم بين الناس هنا يشمل الحكم بينهم في الدماء والأعراض والأموال وسائر الحقوق وفي العقائد وفي جميع مسائل الأحكام. وقوله: { بِمَا أَرَاكَ اللَّهُ } أي: لا بهواك بل بما علَّمك الله وألهمك، كقوله تعالى: { وَمَا يَنْطِقُ عَنِ الْهَوَى إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى } وفي هذا دليل على عصمته صلى الله عليه وسلم فيما يُبَلِّغ عن الله من جميع الأحكام وغيرها، وأنه يشترط في الحاكم العلم والعدل لقوله: { بِمَا أَرَاكَ اللَّهُ } ولم يقل: بما رأيت. ورتب أيضا الحكم بين الناس على معرفة الكتاب، ولما أمر الله بالحكم بين الناس المتضمن للعدل والقسط نهاه عن الجور والظلم الذي هو ضد العدل فقال: { وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا } أي: لا تخاصم عن مَن عرفت خيانته، من مدع ما ليس له، أو منكرٍ حقا عليه، سواء علم ذلك أو ظنه. ففي هذا دليل على تحريم الخصومة في باطل، والنيابة عن المبطل في الخصومات الدينية والحقوق الدنيوية. ويدل مفهوم الآية على جواز الدخول في نيابة الخصومة لمن لم يعرف منه ظلم.\n                                    "
      },
      "originalText": "إِنَّآ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَيۡنَ ٱلنَّاسِ بِمَآ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَآئِنِينَ خَصِيمٗا ٥٠١"
    }
  ]
}