{
  "number": 97,
  "ayahsNumber": 8,
  "ayahs": [
    {
      "number": 607,
      "text": "۞ لَا خَيْرَ فِي كَثِيرٍ مِنْ نَجْوَاهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَاحٍ بَيْنَ النَّاسِ ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ ابْتِغَاءَ مَرْضَاتِ اللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 114,
      "juz": 5,
      "manzil": 1,
      "page": 97,
      "ruku": 78,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": " لَّا خَيۡرَ فِي كَثِيرٖ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَٰحِۢ بَيۡنَ ٱلنَّاسِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٤١١\n                                    \n                                    \n                                    يقول تعالى : ( لا خير في كثير من نجواهم ) يعني : كلام الناس ( إلا من أمر بصدقة أو معروف أو إصلاح بين الناس ) أي : إلا نجوى من قال ذلك كما جاء في الحديث الذي رواه ابن مردويه :\nحدثنا محمد بن عبد الله بن إبراهيم ، حدثنا محمد بن سليمان بن الحارث ، حدثنا محمد بن يزيد بن خنيس قال : دخلنا على سفيان الثوري نعوده - وأومأ إلى دار العطارين - فدخل عليه سعيد بن حسان المخزومي فقال له سفيان الثوري : الحديث الذي كنت حدثتني به عن أم صالح اردده علي . فقال : حدثتني أم صالح ، عن صفية بنت شيبة ، عن أم حبيبة قالت : قال رسول الله صلى الله عليه وسلم : \" كلام ابن آدم كله عليه لا له ما خلا أمرا بمعروف أو نهيا عن منكر [ أو ذكر الله عز وجل \" ، قال سفيان : فناشدته ] فقال محمد بن يزيد : ما أشد هذا الحديث ؟ فقال سفيان : وما شدة هذا الحديث ؟ إنما جاءت به امرأة عن امرأة ، هذا في كتاب الله الذي أرسل به نبيكم صلى الله عليه وسلم أو ما سمعت الله يقول في كتابه : ( لا خير في كثير من نجواهم إلا من أمر بصدقة أو معروف أو إصلاح بين الناس ) فهو هذا بعينه ، أو ما سمعت الله يقول : ( يوم يقوم الروح والملائكة صفا لا يتكلمون إلا من أذن له الرحمن وقال صوابا ) [ النبأ : 38 ] فهو هذا بعينه ، أو ما سمعت الله يقول في كتابه : ( والعصر . إن الإنسان لفي خسر . [ إلا الذين آمنوا وعملوا الصالحات وتواصوا بالحق وتواصوا بالصبر ] ) [ سورة العصر ] ، فهو هذا بعينه .\nوقد روى هذا الحديث الترمذي وابن ماجه من حديث محمد بن يزيد بن خنيس عن سعيد بن حسان ، به . ولم يذكرا أقوال الثوري إلى آخرها ، ثم قال الترمذي : غريب لا نعرفه إلا من حديث ابن خنيس .\nوقال الإمام أحمد : حدثنا يعقوب ، حدثنا أبي ، حدثنا صالح بن كيسان ، حدثنا محمد بن مسلم بن عبيد الله بن شهاب : أن حميد بن عبد الرحمن بن عوف أخبره ، أن أمه أم كلثوم بنت عقبة أخبرته : أنها سمعت رسول الله صلى الله عليه وسلم يقول : \" ليس الكذاب الذي يصلح بين الناس فينمي خيرا - أو يقول خيرا \" وقالت : لم أسمعه يرخص في شيء مما يقوله الناس إلا في ثلاث : في الحرب ، والإصلاح بين الناس ، وحديث الرجل امرأته ، وحديث المرأة زوجها . قال : وكانت أم كلثوم بنت عقبة من المهاجرات اللاتي بايعن رسول الله صلى الله عليه وسلم .\nوقد رواه الجماعة ، سوى ابن ماجه ، من طرق ، عن الزهري ، به نحوه .\nقال الإمام أحمد : حدثنا أبو معاوية ، عن الأعمش ، عن عمرو بن مرة عن سالم بن أبي الجعد ، عن أم الدرداء ، عن أبي الدرداء قال : قال رسول الله صلى الله عليه وسلم : \" ألا أخبركم بأفضل من درجة الصلاة ، والصيام والصدقة ؟ \" قالوا : بلى . قال : \" إصلاح ذات البين \" قال : \" وفساد ذات البين هي الحالقة \" .\nورواه أبو داود والترمذي ، من حديث أبي معاوية ، وقال الترمذي : حسن صحيح .\nوقال الحافظ أبو بكر البزار : حدثنا محمد بن عبد الرحيم ، حدثنا سريج بن يونس ، حدثنا عبد الرحمن بن عبد الله بن عمر ، حدثنا أبي ، عن حميد ، عن أنس ; أن النبي صلى الله عليه وسلم قال لأبي أيوب : \" ألا أدلك على تجارة ؟ \" قال : بلى : قال : \" تسعى في صلح بين الناس إذا تفاسدوا ، وتقارب بينهم إذا تباعدوا \" ثم قال البزار : وعبد الرحمن بن عبد الله العمري لين ، وقد حدث بأحاديث لم يتابع عليها .\nولهذا قال : ( ومن يفعل ذلك ابتغاء مرضاة الله ) أي : مخلصا في ذلك محتسبا ثواب ذلك عند الله عز وجل ( فسوف نؤتيه أجرا عظيما ) أي : ثوابا كثيرا واسعا .\n                                    ",
        "qortoby": " لَّا خَيۡرَ فِي كَثِيرٖ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَٰحِۢ بَيۡنَ ٱلنَّاسِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٤١١\n                                    \n                                    \n                                    قوله تعالى : لا خير في كثير من نجواهم إلا من أمر بصدقة أو معروف أو إصلاح بين الناس ومن يفعل ذلك ابتغاء مرضاة الله فسوف نؤتيه أجرا عظيما\nأراد ما تفاوض به قوم بني أبيرق من التدبير ، وذكروه للنبي صلى الله عليه وسلم . والنجوى : السر بين الاثنين ، تقول : ناجيت فلانا مناجاة ونجاء وهم ينتجون ويتناجون . ونجوت فلانا أنجوه نجوا ، أي ناجيته ، فنجوى مشتقة من نجوت الشيء أنجوه ، أي خلصته وأفردته ، والنجوة من الأرض المرتفع لانفراده بارتفاعه عما حوله ، قال الشاعر :\nفمن بنجوته كمن بعقوته والمستكين كمن يمشي بقرواح\nفالنجوى المسارة ، مصدر ، وقد تسمى به الجماعة ، كما يقال : قوم عدل ورضا . قال الله تعالى : وإذ هم نجوى فعلى الأول يكون الأمر أمر استثناء من غير الجنس . وهو الاستثناء المنقطع . وقد تقدم ، وتكون \" من \" في موضع رفع ، أي : لكن من أمر بصدقة أو معروف أو إصلاح بين الناس ودعا إليه ففي نجواه خير . ويجوز أن تكون \" من \" في موضع خفض ويكون التقدير : لا خير في كثير من نجواهم إلا نجوى من أمر بصدقة ثم حذف . وعلى الثاني وهو أن يكون النجوى اسما للجماعة المنفردين ، فتكون \" من \" في موضع خفض على البدل ، أي لا خير في كثير من نجواهم إلا فيمن أمر بصدقة . أو تكون في موضع نصب على قول من قال : ما مررت بأحد إلا زيدا . وقال بعض المفسرين منهم الزجاج : النجوى كلام الجماعة المنفردة أو الاثنين كان ذلك سرا أو جهرا ، وفيه بعد . والله أعلم . والمعروف لفظ يعم أعمال البر كلها . وقال مقاتل : المعروف هنا الفرض ، والأول أصح . وقال صلى الله عليه وسلم : كل معروف صدقة وإن من المعروف أن تلقى أخاك بوجه طلق . وقال صلى الله عليه وسلم : المعروف كاسمه وأول من يدخل الجنة يوم القيامة المعروف وأهله . وقال علي بن أبي طالب رضي الله عنه : لا يزهدنك في المعروف كفر من كفره ، فقد يشكر الشاكر بأضعاف جحود الكافر . وقال الحطيئة :\nمن يفعل الخير لا يعدم جوازيه لا يذهب العرف بين الله والناس\nوأنشد الرياشي :\nيد المعروف غنم حيث كانت تحملها كفور أو شكور\nففي شكر الشكور لها جزاء وعند الله ما كفر الكفور\nوقال الماوردي : \" فينبغي لمن يقدر على إسداء المعروف أن يعجله حذار فواته ، ويبادر به خيفة عجزه ، وليعلم أنه من فرص زمانه ، وغنائم إمكانه ، ولا يهمله ثقة بالقدرة عليه ، فكم من واثق بالقدرة فاتت فأعقبت ندما ، ومعول على مكنة زالت فأورثت خجلا ، كما قال الشاعر :\nما زلت أسمع كم من واثق خجل حتى ابتليت فكنت الواثق الخجلا\nولو فطن لنوائب دهره ، وتحفظ من عواقب أمره لكانت مغانمه مذخورة ، ومغارمه مجبورة ، فقد روي عن النبي صلى الله عليه وسلم أنه قال : من فتح عليه باب من الخير فلينتهزه فإنه لا يدري متى يغلق عنه . وروي عنه صلى الله عليه وسلم أنه قال : لكل شيء ثمرة وثمرة المعروف السراح . وقيل لأنوشروان : ما أعظم المصائب عندكم ؟ قال : أن تقدر على المعروف فلا تصطنعه حتى يفوت . وقال عبد الحميد : من أخر الفرصة عن وقتها فليكن على ثقة من فوتها . وقال بعض الشعراء :\nإذا هبت رياحك فاغتنمها فإن لكل خافقة سكون\nولا تغفل عن الإحسان فيها فما تدري السكون متى يكون\nوكتب بعض ذوي الحرمات إلى وال قصر في رعاية حرمته :\nأعلى الصراط تريد رعية حرمتي أم في الحساب تمن بالإنعام\nللنفع في الدنيا أريدك ، فانتبه لحوائجي من رقدة النوام\nوقال العباس رضي الله عنه : لا يتم المعروف إلا بثلاث خصال : تعجيله وتصغيره وستره ، فإذا عجلته هنأته ، وإذا صغرته عظمته ، وإذا سترته أتممته . وقال بعض الشعراء :\nزاد معروفك عندي عظما أنه عندك مستور حقير\nتتناساه كأن لم تأته وهو عند الناس مشهور خطير\nومن شرط المعروف ترك الامتنان به ، وترك الإعجاب بفعله ، لما فيهما من إسقاط الشكر وإحباط الأجر . وقد تقدم في \" البقرة \" بيانه .\nقوله تعالى : أو إصلاح بين الناس عام في الدماء والأموال والأعراض ، وفي كل شيء يقع التداعي والاختلاف فيه بين المسلمين ، وفي كل كلام يراد به وجه الله تعالى . وفي الخبر : ( كلام ابن آدم كله عليه لا له إلا ما كان من أمر بمعروف أو نهي عن منكر أو ذكر لله تعالى ) . فأما من طلب الرياء والترؤس فلا ينال الثواب . وكتب عمر إلى أبي موسى الأشعري رضي الله عنه : رد الخصوم حتى يصطلحوا ، فإن فصل القضاء يورث بينهم الضغائن . وسيأتي في \" المجادلة \" ما يحرم من المناجاة وما يجوز إن شاء الله تعالى . وعن أنس بن مالك رضي الله عنه أنه قال ، : من أصلح بين اثنين أعطاه الله بكل كلمة عتق رقبة . وقال النبي صلى الله عليه وسلم لأبي أيوب : ألا أدلك على صدقة يحبها الله ورسوله ، تصلح بين أناس إذا تفاسدوا ، وتقرب بينهم إذا تباعدوا . وقال الأوزاعي : ما خطوة أحب إلى الله عز وجل من خطوة في إصلاح ذات البين ، ومن أصلح بين اثنين كتب الله له براءة من النار . وقال محمد بن المنكدر : تنازع رجلان في ناحية المسجد فملت إليهما ، فلم أزل بهما حتى اصطلحا ؛ فقال أبو هريرة وهو يراني : سمعت رسول الله صلى الله عليه وسلم يقول : من أصلح بين اثنين استوجب ثواب شهيد . ذكر هذه الأخبار أبو مطيع مكحول بن المفضل النسفي في كتاب اللؤلئيات له ، وجدته بخط المصنف في وريقة ولم ينبه على موضعها رضي الله عنه . و \" ابتغاء \" نصب على المفعول من أجله .\n                                    ",
        "saadi": " لَّا خَيۡرَ فِي كَثِيرٖ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَٰحِۢ بَيۡنَ ٱلنَّاسِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٤١١\n                                        \n                                        \n                                        \n                                        أي: لا خير في كثير مما يتناجى به الناس ويتخاطبون، وإذا لم يكن فيه خير، فإما لا فائدة فيه كفضول الكلام المباح، وإما شر ومضرة محضة كالكلام المحرم بجميع أنواعه. ثم استثنى تعالى فقال: { إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ ْ} من مال أو علم أو أي نفع كان، بل لعله يدخل فيه العبادات القاصرة كالتسبيح والتحميد ونحوه، كما قال النبي صلى الله عليه وسلم: \"إن بكل تسبيحة صدقة، وكل تكبيرة صدقة، وكل تهليلة صدقة، وأمر بالمعروف صدقة، ونهي عن المنكر صدقة، وفي بضع أحدكم صدقة\" الحديث. { أَوْ مَعْرُوفٍ ْ} وهو الإحسان والطاعة وكل ما عرف في الشرع والعقل حسنه، وإذا أطلق الأمر بالمعروف من غير أن يقرن بالنهي عن المنكر دخل فيه النهي عن المنكر، وذلك لأن ترك المنهيات من المعروف، وأيضا لا يتم فعل الخير إلا بترك الشر. وأما عند الاقتران فيفسر المعروف بفعل المأمور، والمنكر بترك المنهي. { أَوْ إِصْلَاحٍ بَيْنَ النَّاسِ ْ} والإصلاح لا يكون إلا بين متنازعين متخاصمين، والنزاع والخصام والتغاضب يوجب من الشر والفرقة ما لا يمكن حصره، فلذلك حث الشارع على الإصلاح بين الناس في الدماء والأموال والأعراض، بل وفي الأديان كما قال تعالى: { وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا ْ} وقال تعالى: { وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا فَإِنْ بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَى فَقَاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِيءَ إِلَى أَمْرِ اللَّهِ ْ} الآية. وقال تعالى: { وَالصُّلْحُ خَيْرٌ ْ} والساعي في الإصلاح بين الناس أفضل من القانت بالصلاة والصيام والصدقة، والمصلح لا بد أن يصلح الله سعيه وعمله. كما أن الساعي في الإفساد لا يصلح الله عمله ولا يتم له مقصوده كما قال تعالى: { إِنَّ اللَّهَ لَا يُصْلِحُ عَمَلَ الْمُفْسِدِينَ ْ}. فهذه الأشياء حيثما فعلت فهي خير، كما دل على ذلك الاستثناء. ولكن كمال الأجر وتمامه بحسب النية والإخلاص، ولهذا قال: { وَمَنْ يَفْعَلْ ذَلِكَ ابْتِغَاءَ مَرْضَاةِ اللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا ْ} فلهذا ينبغي للعبد أن يقصد وجه الله تعالى ويخلص العمل لله في كل وقت وفي كل جزء من أجزاء الخير، ليحصل له بذلك الأجر العظيم، وليتعود الإخلاص فيكون من المخلصين، وليتم له الأجر، سواء تم مقصوده أم لا، لأن النية حصلت واقترن بها ما يمكن من العمل.\n                                    "
      },
      "originalText": "۞ لَّا خَيۡرَ فِي كَثِيرٖ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَٰحِۢ بَيۡنَ ٱلنَّاسِۚ وَمَن يَفۡعَلۡ ذَٰلِكَ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِيهِ أَجۡرًا عَظِيمٗا ٤١١"
    },
    {
      "number": 608,
      "text": "وَمَنْ يُشَاقِقِ الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَىٰ وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّىٰ وَنُصْلِهِ جَهَنَّمَ ۖ وَسَاءَتْ مَصِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 115,
      "juz": 5,
      "manzil": 1,
      "page": 97,
      "ruku": 78,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَمَن يُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُ ٱلۡهُدَىٰ وَيَتَّبِعۡ غَيۡرَ سَبِيلِ ٱلۡمُؤۡمِنِينَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرًا ٥١١\n                                    \n                                    \n                                    وقوله : ( ومن يشاقق الرسول من بعد ما تبين له الهدى ) أي : ومن سلك غير طريق الشريعة التي جاء بها الرسول صلى الله عليه وسلم ، فصار في شق والشرع في شق ، وذلك عن عمد منه بعدما ظهر له الحق وتبين له واتضح له . وقوله : ( ويتبع غير سبيل المؤمنين ) هذا ملازم للصفة الأولى ، ولكن قد تكون المخالفة لنص الشارع ، وقد تكون لما أجمعت عليه الأمة المحمدية ، فيما علم اتفاقهم عليه تحقيقا ، فإنه قد ضمنت لهم العصمة في اجتماعهم من الخطأ ، تشريفا لهم وتعظيما لنبيهم [ صلى الله عليه وسلم ] . وقد وردت في ذلك أحاديث صحيحة كثيرة ، قد ذكرنا منها طرفا صالحا في كتاب \" أحاديث الأصول \" ، ومن العلماء من ادعى تواتر معناها ، والذي عول عليه الشافعي ، رحمه الله ، في الاحتجاج على كون الإجماع حجة تحرم مخالفته هذه الآية الكريمة ، بعد التروي والفكر الطويل . وهو من أحسن الاستنباطات وأقواها ، وإن كان بعضهم قد استشكل ذلك واستبعد الدلالة منها على ذلك .\nولهذا توعد تعالى على ذلك بقوله : ( نوله ما تولى ونصله جهنم وساءت مصيرا ) أي : إذا سلك هذه الطريق جازيناه على ذلك ، بأن نحسنها في صدره ونزينها له - استدراجا له - كما قال تعالى : ( فذرني ومن يكذب بهذا الحديث سنستدرجهم من حيث لا يعلمون ) [ القلم : 44 ] . وقال تعالى : ( فلما زاغوا أزاغ الله قلوبهم ) [ الصف : 5 ] . وقوله ( ونذرهم في طغيانهم يعمهون ) [ الأنعام : 110 ] .\nوجعل النار مصيره في الآخرة ، لأن من خرج عن الهدى لم يكن له طريق إلا إلى النار يوم القيامة ، كما قال تعالى : ( احشروا الذين ظلموا وأزواجهم [ وما كانوا يعبدون . من دون الله فاهدوهم إلى صراط الجحيم ] ) [ الصافات : 22 ، 23 ] . وقال : ( ورأى المجرمون النار فظنوا أنهم مواقعوها ولم يجدوا عنها مصرفا ) [ الكهف : 53 ] .\n                                    ",
        "qortoby": "وَمَن يُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُ ٱلۡهُدَىٰ وَيَتَّبِعۡ غَيۡرَ سَبِيلِ ٱلۡمُؤۡمِنِينَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرًا ٥١١\n                                    \n                                    \n                                    قوله تعالى : ومن يشاقق الرسول من بعد ما تبين له الهدى ويتبع غير سبيل المؤمنين نوله ما تولى ونصله جهنم وساءت مصيرا\nفيه مسألتان :\nالأولى : قال العلماء : هاتان الآيتان نزلتا بسبب ابن أبيرق السارق ، لما حكم النبي صلى الله عليه وسلم عليه بالقطع وهرب إلى مكة وارتد ، قال سعيد بن جبير : لما صار إلى مكة نقب بيتا بمكة فلحقه المشركون فقتلوه ؛ فأنزل الله تعالى : إن الله لا يغفر أن يشرك به إلى قوله : فقد ضل ضلالا بعيدا . وقال الضحاك : قدم نفر من قريش المدينة وأسلموا ثم انقلبوا إلى مكة مرتدين فنزلت هذه الآية ومن يشاقق الرسول . والمشاقة المعاداة . والآية وإن نزلت في سارق الدرع أو غيره فهي عامة في كل من خالف طريق المسلمين . والهدى : الرشد والبيان ، وقد تقدم . وقوله تعالى : نوله ما تولى يقال : إنه نزل فيمن ارتد ؛ والمعنى ؛ نتركه وما يعبد ؛ عن مجاهد . أي نكله إلى الأصنام التي لا تنفع ولا تضر ؛ وقاله مقاتل . وقال الكلبي ؛ نزل قوله تعالى : نوله ما تولى في ابن أبيرق ؛ لما ظهرت حاله وسرقته هرب إلى مكة وارتد ونقب حائطا لرجل بمكة يقال له : حجاج بن علاط ، فسقط فبقي في النقب حتى وجد على حاله ، وأخرجوه من مكة ؛ فخرج إلى الشام فسرق بعض أموال القافلة فرجموه وقتلوه ، فنزلت نوله ما تولى ونصله جهنم وساءت مصيرا . وقرأ عاصم وحمزة وأبو عمرو \" نوله \" \" ونصله \" بجزم الهاء ، والباقون بكسرها ، وهما لغتان .\nالثانية : قال العلماء في قوله تعالى : ومن يشاقق الرسول دليل على صحة القول بالإجماع ،\n                                    ",
        "saadi": "وَمَن يُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُ ٱلۡهُدَىٰ وَيَتَّبِعۡ غَيۡرَ سَبِيلِ ٱلۡمُؤۡمِنِينَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرًا ٥١١\n                                        \n                                        \n                                        \n                                        أي: ومن يخالف الرسول صلى الله عليه وسلم ويعانده فيما جاء به { مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَى ْ} بالدلائل القرآنية والبراهين النبوية. { وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ ْ} وسبيلهم هو طريقهم في عقائدهم وأعمالهم { نُوَلِّهِ مَا تَوَلَّى ْ} أي: نتركه وما اختاره لنفسه، ونخذله فلا نوفقه للخير، لكونه رأى الحق وعلمه وتركه، فجزاؤه من الله عدلاً أن يبقيه في ضلاله حائرا ويزداد ضلالا إلى ضلاله. كما قال تعالى: { فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ ْ} وقال تعالى: { وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ كَمَا لَمْ يُؤْمِنُوا بِهِ أَوَّلَ مَرَّةٍ ْ} ويدل مفهومها على أن من لم يشاقق الرسول، ويتبع سبيل المؤمنين، بأن كان قصده وجه الله واتباع رسوله ولزوم جماعة المسلمين، ثم صدر منه من الذنوب أو الهّم بها ما هو من مقتضيات النفوس، وغلبات الطباع، فإن الله لا يوليه نفسه وشيطانه بل يتداركه بلطفه، ويمن عليه بحفظه ويعصمه من السوء، كما قال تعالى عن يوسف عليه السلام: { كَذَلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاءَ إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ ْ} أي: بسبب إخلاصه صرفنا عنه السوء، وكذلك كل مخلص، كما يدل عليه عموم التعليل. وقوله: { وَنُصْلِهِ جَهَنَّمَ ْ} أي: نعذبه فيها عذابا عظيما. { وَسَاءَتْ مَصِيرًا ْ} أي: مرجعا له ومآلا. وهذا الوعيد المرتب على الشقاق ومخالفة المؤمنين مراتب لا يحصيها إلا الله بحسب حالة الذنب صغرا وكبرا، فمنه ما يخلد في النار ويوجب جميع الخذلان. ومنه ما هو دون ذلك، فلعل الآية الثانية كالتفصيل لهذا المطلق.\n                                    "
      },
      "originalText": "وَمَن يُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُ ٱلۡهُدَىٰ وَيَتَّبِعۡ غَيۡرَ سَبِيلِ ٱلۡمُؤۡمِنِينَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرًا ٥١١"
    },
    {
      "number": 609,
      "text": "إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَنْ يَشَاءُ ۚ وَمَنْ يُشْرِكْ بِاللَّهِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 116,
      "juz": 5,
      "manzil": 1,
      "page": 97,
      "ruku": 79,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِنَّ ٱللَّهَ لَا يَغۡفِرُ أَن يُشۡرَكَ بِهِۦ وَيَغۡفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُۚ وَمَن يُشۡرِكۡ بِٱللَّهِ فَقَدۡ ضَلَّ ضَلَٰلَۢا بَعِيدًا ٦١١\n                                    \n                                    \n                                    قد تقدم الكلام على هذه الآية الكريمة ، وهي قوله : ( إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك [ لمن يشاء ] ) الآية [ النساء : 48 ] ، وذكرنا ما يتعلق بها من الأحاديث في صدر هذه السورة .\nوقد روى الترمذي حديث ثوير بن أبي فاختة سعيد بن علاقة ، عن أبيه ، عن علي رضي الله عنه أنه قال : ما في القرآن آية أحب إلي من هذه الآية : ( إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء ومن يشرك ) الآية ، ثم قال : حسن غريب .\nوقوله : ( ومن يشرك بالله فقد ضل ضلالا بعيدا ) أي : فقد سلك غير الطريق الحق ، وضل عن الهدى وبعد عن الصواب ، وأهلك نفسه وخسرها في الدنيا والآخرة ، وفاتته سعادة الدنيا والآخرة .\n                                    ",
        "qortoby": "إِنَّ ٱللَّهَ لَا يَغۡفِرُ أَن يُشۡرَكَ بِهِۦ وَيَغۡفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُۚ وَمَن يُشۡرِكۡ بِٱللَّهِ فَقَدۡ ضَلَّ ضَلَٰلَۢا بَعِيدًا ٦١١\n                                    \n                                    \n                                    وفي قوله تعالى : إن الله لا يغفر أن يشرك به رد على الخوارج ؛ حيث زعموا أن مرتكب الكبيرة كافر . وقد تقدم القول في هذا المعنى . وروى الترمذي عن علي بن أبي طالب رضي الله عنه قال : ما في القرآن آية أحب إلي من هذه الآية : إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء قال : هذا حديث غريب . قال ابن فورك : وأجمع أصحابنا على أنه لا تخليد إلا للكافر ، وأن الفاسق من أهل القبلة إذا مات غير تائب فإنه إن عذب بالنار فلا محالة أنه يخرج منها بشفاعة الرسول ، أو بابتداء رحمة من الله تعالى . وقال الضحاك : إن شيخا من الأعراب جاء إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، إني شيخ منهمك في الذنوب والخطايا ، إلا أني لم أشرك بالله شيئا منذ عرفته وآمنت به ، فما حالي عند الله ؟ فأنزل الله تعالى : إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء الآية .\n                                    ",
        "saadi": "إِنَّ ٱللَّهَ لَا يَغۡفِرُ أَن يُشۡرَكَ بِهِۦ وَيَغۡفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُۚ وَمَن يُشۡرِكۡ بِٱللَّهِ فَقَدۡ ضَلَّ ضَلَٰلَۢا بَعِيدًا ٦١١\n                                        \n                                        \n                                        \n                                        أن الشرك لا يغفره الله تعالى لتضمنه القدح في رب العالمين وفي وحدانيته وتسوية المخلوق الذي لا يملك لنفسه ضرا ولا نفعا بمن هو مالك النفع والضر، الذي ما من نعمة إلا منه، ولا يدفع النقم إلا هو، الذي له الكمال المطلق من جميع الوجوه، والغنى التام بجميع وجوه الاعتبارات. فمن أعظم الظلم وأبعد الضلال عدم إخلاص العبادة لمن هذا شأنه وعظمته، وصرف شيء منها للمخلوق الذي ليس له من صفات الكمال شيء، ولا له من صفات الغنى شيء بل ليس له إلا العدم. عدم الوجود وعدم الكمال وعدم الغنى، والفقر من جميع الوجوه. وأما ما دون الشرك من الذنوب والمعاصي فهو تحت المشيئة، إن شاء الله غفره برحمته وحكمته، وإن شاء عذب عليه وعاقب بعدله وحكمته، وقد استدل بهذه الآية الكريمة على أن إجماع هذه الأمة حجة وأنها معصومة من الخطأ. ووجه ذلك: أن الله توعد من خالف سبيل المؤمنين بالخذلان والنار، و { سبيل المؤمنين ْ} مفرد مضاف يشمل سائر ما المؤمنون عليه من العقائد والأعمال. فإذا اتفقوا على إيجاب شيء أو استحبابه، أو تحريمه أو كراهته، أو إباحته - فهذا سبيلهم، فمن خالفهم في شيء من ذلك بعد انعقاد إجماعهم عليه، فقد اتبع غير سبيلهم. ويدل على ذلك قوله تعالى: { كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِالْمَعْرُوفِ وَتَنْهَوْنَ عَنِ الْمُنْكَرِ ْ} ووجه الدلالة منها: أن الله تعالى أخبر أن المؤمنين من هذه الأمة لا يأمرون إلا بالمعروف، فإذا اتفقوا على إيجاب شيء أو استحبابه فهو مما أمروا به، فيتعين بنص الآية أن يكون معروفا ولا شيء بعد المعروف غير المنكر، وكذلك إذا اتفقوا على النهي عن شيء فهو مما نهوا عنه فلا يكون إلا منكرا، ومثل ذلك قوله تعالى: { وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاس ْ} فأخبر تعالى أن هذه الأمة جعلها الله وسطا أي: عدلا خيارا ليكونوا شهداء على الناس أي: في كل شيء، فإذا شهدوا على حكم بأن الله أمر به أو نهى عنه أو أباحه، فإن شهادتهم معصومة لكونهم عالمين بما شهدوا به عادلين في شهادتهم، فلو كان الأمر بخلاف ذلك لم يكونوا عادلين في شهادتهم ولا عالمين بها. ومثل ذلك قوله تعالى: { فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ ْ} يفهم منها أن ما لم يتنازعوا فيه بل اتفقوا عليه أنهم غير مأمورين برده إلى الكتاب والسنة، وذلك لا يكون إلا موافقا للكتاب والسنة فلا يكون مخالفا. فهذه الأدلة ونحوها تفيد القطع أن إجماع هذه الأمة حجة قاطعة، ولهذا بيَّن الله قبح ضلال المشركين بقوله:\n                                    "
      },
      "originalText": "إِنَّ ٱللَّهَ لَا يَغۡفِرُ أَن يُشۡرَكَ بِهِۦ وَيَغۡفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُۚ وَمَن يُشۡرِكۡ بِٱللَّهِ فَقَدۡ ضَلَّ ضَلَٰلَۢا بَعِيدًا ٦١١"
    },
    {
      "number": 610,
      "text": "إِنْ يَدْعُونَ مِنْ دُونِهِ إِلَّا إِنَاثًا وَإِنْ يَدْعُونَ إِلَّا شَيْطَانًا مَرِيدًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 117,
      "juz": 5,
      "manzil": 1,
      "page": 97,
      "ruku": 79,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن يَدۡعُونَ مِن دُونِهِۦٓ إِلَّآ إِنَٰثٗا وَإِن يَدۡعُونَ إِلَّا شَيۡطَٰنٗا مَّرِيدٗا ٧١١\n                                    \n                                    \n                                    وقوله : ( إن يدعون من دونه إلا إناثا ) قال ابن أبي حاتم : حدثنا أبي ، حدثنا محمود بن غيلان ، أنبأنا الفضل بن موسى ، أخبرنا الحسن بن واقد ، عن الربيع بن أنس ، عن أبي العالية ، عن أبي بن كعب : ( إن يدعون من دونه إلا إناثا ) قال : مع كل صنم جنية .\nوحدثنا أبي ، حدثنا محمد بن سلمة الباهلي ، عن عبد العزيز بن محمد ، عن - يعني ابن عروة - عن أبيه عن عائشة : ( إن يدعون من دونه إلا إناثا ) قالت : أوثانا .\nوروى عن أبي سلمة بن عبد الرحمن ، وعروة بن الزبير ، ومجاهد ، وأبي مالك ، والسدي ، ومقاتل بن حيان نحو ذلك .\nوقال جويبر عن الضحاك في [ قوله ] ( إن يدعون من دونه إلا إناثا ) قال المشركون : إن الملائكة بنات الله ، وإنما نعبدهم ليقربونا إلى الله زلفى ، قال : اتخذوها أربابا وصوروهن صور الجواري ، فحكموا وقلدوا ، وقالوا : هؤلاء يشبهن بنات الله الذي نعبده ، يعنون الملائكة .\nوهذا التفسير شبيه بقوله تعالى : ( أفرأيتم اللات والعزى . [ ومناة الثالثة الأخرى . ألكم الذكر وله الأنثى . تلك إذا قسمة ضيزى . إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان ] ) [ النجم : 19 - 23 ] ، وقال تعالى : ( وجعلوا الملائكة الذين هم عباد الرحمن إناثا [ أشهدوا خلقهم ستكتب شهادتهم ويسألون ] ) [ الزخرف : 19 ] ، وقال تعالى : ( وجعلوا بينه وبين الجنة نسبا ولقد علمت الجنة إنهم لمحضرون . سبحان الله عما يصفون ] ) [ الصافات : 158 ، 159 ] .\nوقال علي بن أبي طلحة والضحاك ، عن ابن عباس : ( إن يدعون من دونه إلا إناثا ) قال : يعني موتى .\nوقال مبارك - يعني ابن فضالة - عن الحسن : ( إن يدعون من دونه إلا إناثا ) قال الحسن : الإناث كل شيء ميت ليس فيه روح ، إما خشبة يابسة وإما حجر يابس . ورواه ابن أبي حاتم وابن جرير ، وهو غريب .\nوقوله : ( وإن يدعون إلا شيطانا مريدا ) أي : هو الذي أمرهم بذلك وحسنه لهم وزينه ، وهم إنما يعبدون إبليس في نفس الأمر ، كما قال تعالى : ( ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان [ إنه لكم عدو مبين ] ) [ يس : 60 ] وقال تعالى إخبارا عن الملائكة أنهم يقولون يوم القيامة عن المشركين الذين ادعوا عبادتهم في الدنيا : ( بل كانوا يعبدون الجن أكثرهم بهم مؤمنون ) [ سبأ : 41 ] .\n                                    ",
        "qortoby": "إِن يَدۡعُونَ مِن دُونِهِۦٓ إِلَّآ إِنَٰثٗا وَإِن يَدۡعُونَ إِلَّا شَيۡطَٰنٗا مَّرِيدٗا ٧١١\n                                    \n                                    \n                                    قوله تعالى : إن يدعون من دونه إلا إناثا وإن يدعون إلا شيطانا مريدا\nقوله تعالى : إن يدعون من دونه أي من دون الله إلا إناثا ؛ نزلت في أهل مكة إذ عبدوا الأصنام . وإن نافية بمعنى \" ما \" . وإناثا أصناما ، يعني اللات والعزى ومناة . وكان لكل حي صنم يعبدونه ويقولون : أنثى بني فلان ، قال الحسن وابن عباس ، وأتى مع كل صنم شيطانه يتراءى للسدنة والكهنة ويكلمهم ، فخرج الكلام مخرج التعجب ؛ لأن الأنثى من كل جنس أخسه ؛ فهذا جهل ممن يشرك بالله جمادا فيسميه أنثى ، أو يعتقده أنثى . وقيل : إلا إناثا مواتا ؛ لأن الموات لا روح له ، كالخشبة والحجر . والموات يخبر عنه كما يخبر عن المؤنث لاتضاع المنزلة ؛ تقول : الأحجار تعجبني ، كما تقول : المرأة تعجبني . وقيل : إلا إناثا ملائكة ؛ لقولهم : الملائكة بنات الله ، وهي شفعاؤنا عند الله ؛ عن الضحاك . وقراءة ابن عباس \" إلا وثنا \" بفتح الواو والثاء على إفراد اسم الجنس ؛ وقرأ أيضا \" وثنا \" بضم الثاء والواو ؛ جمع وثن . وأوثان أيضا جمع وثن مثل أسد وآساد . النحاس : ولم يقرأ به فيما علمت .\nقلت : قد ذكر أبو بكر الأنباري - حدثنا أبي حدثنا نصر بن داود حدثنا أبو عبيد حدثنا حجاج عن ابن جريج عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها أنها كانت تقرأ : \" إن يدعون من دونه إلا أوثانا \" . وقرأ ابن عباس أيضا \" إلا أثنا \" كأنه جمع وثنا على وثان ؛ كما تقول : جمل وجمال ، ثم جمع أوثانا على وثن ؛ كما تقول : مثال ومثل ؛ ثم أبدل من الواو همزة لما انضمت ؛ كما قال عز وجل : وإذا الرسل أقتت من الوقت ؛ فأثن جمع الجمع . وقرأ النبي صلى الله عليه وسلم : \" إلا أنثا \" جمع أنيث ، كغدير وغدر . وحكىالطبري أنه جمع إناث كثمار وثمر . حكى هذه القراءة عن النبي صلى الله عليه وسلم أبو عمرو الداني ؛ قال : وقرأ بها ابن عباس والحسن وأبو حيوة .\nقوله تعالى : وإن يدعون إلا شيطانا مريدا يريد إبليس ؛ لأنهم إذا أطاعوه فيما سول لهم فقد عبدوه ؛ ونظيره في المعنى : اتخذوا أحبارهم ورهبانهم أربابا من دون الله أي أطاعوهم فيما أمروهم به ؛ لا أنهم عبدوهم . وسيأتي . وقد تقدم اشتقاق لفظ الشيطان . والمريد : العاتي المتمرد ؛ فعيل من مرد إذا عتا . قال الأزهري : المريد الخارج عن الطاعة ، وقد مرد الرجل يمرد مرودا إذا عتا وخرج عن الطاعة ، فهو مارد ومريد ومتمرد . ابن عرفة هو الذي ظهر شره ؛ ومن هذا يقال : شجرة مرداء إذا تساقط ورقها فظهرت عيدانها ؛ ومنه قيل للرجل : أمرد ، أي ظاهر مكان الشعر من عارضيه .\n                                    ",
        "saadi": "إِن يَدۡعُونَ مِن دُونِهِۦٓ إِلَّآ إِنَٰثٗا وَإِن يَدۡعُونَ إِلَّا شَيۡطَٰنٗا مَّرِيدٗا ٧١١\n                                        \n                                        \n                                        \n                                        أي: ما يدعو هؤلاء المشركون من دون الله إلا إناثا، أي: أوثانا وأصناما مسميات بأسماء الإناث كـ \"العزى\" و \"مناة\" ونحوهما، ومن المعلوم أن الاسم دال على المسمى. فإذا كانت أسماؤها أسماء مؤنثة ناقصة، دل ذلك على نقص المسميات بتلك الأسماء، وفقدها لصفات الكمال، كما أخبر الله تعالى في غير موضع من كتابه، أنها لا تخلق ولا ترزق ولا تدفع عن عابديها بل ولا عن نفسها؛ نفعا ولا ضرا ولا تنصر أنفسها ممن يريدها بسوء، وليس لها أسماع ولا أبصار ولا أفئدة، فكيف يُعبد من هذا وصفه ويترك الإخلاص لمن له الأسماء الحسنى والصفات العليا والحمد والكمال، والمجد والجلال، والعز والجمال، والرحمة والبر والإحسان، والانفراد بالخلق والتدبير، والحكمة العظيمة في الأمر والتقدير؟\" هل هذا إلا من أقبح القبيح الدال على نقص صاحبه، وبلوغه من الخسة والدناءة أدنى ما يتصوره متصور، أو يصفه واصف؟\" ومع ذلك فعبادتهم إنما صورتها فقط لهذه الأوثان الناقصة. وبالحقيقة ما عبدوا غير الشيطان الذي هو عدوهم الذي يريد إهلاكهم ويسعى في ذلك بكل ما يقدر عليه، الذي هو في غاية البعد من الله، لعنه الله وأبعده عن رحمته، فكما أبعده الله من رحمته يسعى في إبعاد العباد عن رحمة الله. { إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ ْ} ولهذا أخبر الله عن سعيه في إغواء العباد، وتزيين الشر لهم والفساد وأنه قال لربه مقسما: { لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَفْرُوضًا ْ} أي: مقدرا. علم اللعين أنه لا يقدر على إغواء جميع عباد الله، وأن عباد الله المخلصين ليس له عليهم سلطان، وإنما سلطانه على من تولاه، وآثر طاعته على طاعة مولاه. وأقسم في موضع آخر ليغوينهم { لَأُغْوِيَنَّهُمْ أَجْمَعِينَ إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ ْ} فهذا الذي ظنه الخبيث وجزم به، أخبر الله تعالى بوقوعه بقوله: { وَلَقَدْ صَدَّقَ عَلَيْهِمْ إِبْلِيسُ ظَنَّهُ فَاتَّبَعُوهُ إِلَّا فَرِيقًا مِنَ الْمُؤْمِنِينَ ْ}\n                                    "
      },
      "originalText": "إِن يَدۡعُونَ مِن دُونِهِۦٓ إِلَّآ إِنَٰثٗا وَإِن يَدۡعُونَ إِلَّا شَيۡطَٰنٗا مَّرِيدٗا ٧١١"
    },
    {
      "number": 611,
      "text": "لَعَنَهُ اللَّهُ ۘ وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَفْرُوضًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 118,
      "juz": 5,
      "manzil": 1,
      "page": 97,
      "ruku": 79,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "لَّعَنَهُ ٱللَّهُۘ وَقَالَ لَأَتَّخِذَنَّ مِنۡ عِبَادِكَ نَصِيبٗا مَّفۡرُوضٗا ٨١١\n                                    \n                                    \n                                    وقوله : ( لعنه الله ) أي : طرده وأبعده من رحمته ، وأخرجه من جواره .\nوقال : ( لأتخذن من عبادك نصيبا مفروضا ) أي : معينا مقدرا معلوما . قال مقاتل بن حيان : من كل ألف تسعمائة وتسعة وتسعون إلى النار ، وواحد إلى الجنة .\n                                    ",
        "qortoby": "لَّعَنَهُ ٱللَّهُۘ وَقَالَ لَأَتَّخِذَنَّ مِنۡ عِبَادِكَ نَصِيبٗا مَّفۡرُوضٗا ٨١١\n                                    \n                                    \n                                    قوله تعالى : لعنه الله وقال لأتخذن من عبادك نصيبا مفروضا\nقوله تعالى : لعنه الله أصل اللعن الإبعاد ، وقد تقدم . وهو في العرف إبعاد مقترن بسخط وغضب ؛ فلعنة إبليس - عليه لعنة الله - على التعيين جائزة ، وكذلك سائر الكفرة الموتى كفرعون وهامان وأبي جهل ؛ فأما الأحياء فقد مضى الكلام فيه في \" البقرة \" .\nقوله تعالى : وقال لأتخذن من عبادك نصيبا مفروضا أي وقال الشيطان ؛ والمعنى : لأستخلصنهم . بغوايتي وأضلنهم بإضلالي ، وهم الكفرة والعصاة . وفي الخبر ( من كل ألف واحد لله والباقي للشيطان ) .\nقلت : وهذا صحيح معنى ؛ يعضده قوله تعالى لآدم يوم القيامة : ( ابعث بعث النار فيقول : وما بعث النار ؟ فيقول من كل ألف تسعمائة وتسعة وتسعين ) . أخرجه مسلم . وبعث النار هو نصيب الشيطان ، والله أعلم . وقيل : من النصيب طاعتهم إياه في أشياء ؛ منها أنهم كانوا يضربون للمولود مسمارا عند ولادته ، ودورانهم به يوم أسبوعه ، يقولون : ليعرفه العمار .\n                                    ",
        "saadi": "لَّعَنَهُ ٱللَّهُۘ وَقَالَ لَأَتَّخِذَنَّ مِنۡ عِبَادِكَ نَصِيبٗا مَّفۡرُوضٗا ٨١١\n                                        \n                                        \n                                        \n                                        أي: ما يدعو هؤلاء المشركون من دون الله إلا إناثا، أي: أوثانا وأصناما مسميات بأسماء الإناث كـ \"العزى\" و \"مناة\" ونحوهما، ومن المعلوم أن الاسم دال على المسمى. فإذا كانت أسماؤها أسماء مؤنثة ناقصة، دل ذلك على نقص المسميات بتلك الأسماء، وفقدها لصفات الكمال، كما أخبر الله تعالى في غير موضع من كتابه، أنها لا تخلق ولا ترزق ولا تدفع عن عابديها بل ولا عن نفسها؛ نفعا ولا ضرا ولا تنصر أنفسها ممن يريدها بسوء، وليس لها أسماع ولا أبصار ولا أفئدة، فكيف يُعبد من هذا وصفه ويترك الإخلاص لمن له الأسماء الحسنى والصفات العليا والحمد والكمال، والمجد والجلال، والعز والجمال، والرحمة والبر والإحسان، والانفراد بالخلق والتدبير، والحكمة العظيمة في الأمر والتقدير؟\" هل هذا إلا من أقبح القبيح الدال على نقص صاحبه، وبلوغه من الخسة والدناءة أدنى ما يتصوره متصور، أو يصفه واصف؟\" ومع ذلك فعبادتهم إنما صورتها فقط لهذه الأوثان الناقصة. وبالحقيقة ما عبدوا غير الشيطان الذي هو عدوهم الذي يريد إهلاكهم ويسعى في ذلك بكل ما يقدر عليه، الذي هو في غاية البعد من الله، لعنه الله وأبعده عن رحمته، فكما أبعده الله من رحمته يسعى في إبعاد العباد عن رحمة الله. { إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ ْ} ولهذا أخبر الله عن سعيه في إغواء العباد، وتزيين الشر لهم والفساد وأنه قال لربه مقسما: { لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَفْرُوضًا ْ} أي: مقدرا. علم اللعين أنه لا يقدر على إغواء جميع عباد الله، وأن عباد الله المخلصين ليس له عليهم سلطان، وإنما سلطانه على من تولاه، وآثر طاعته على طاعة مولاه. وأقسم في موضع آخر ليغوينهم { لَأُغْوِيَنَّهُمْ أَجْمَعِينَ إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ ْ} فهذا الذي ظنه الخبيث وجزم به، أخبر الله تعالى بوقوعه بقوله: { وَلَقَدْ صَدَّقَ عَلَيْهِمْ إِبْلِيسُ ظَنَّهُ فَاتَّبَعُوهُ إِلَّا فَرِيقًا مِنَ الْمُؤْمِنِينَ ْ}\n                                    "
      },
      "originalText": "لَّعَنَهُ ٱللَّهُۘ وَقَالَ لَأَتَّخِذَنَّ مِنۡ عِبَادِكَ نَصِيبٗا مَّفۡرُوضٗا ٨١١"
    },
    {
      "number": 612,
      "text": "وَلَأُضِلَّنَّهُمْ وَلَأُمَنِّيَنَّهُمْ وَلَآمُرَنَّهُمْ فَلَيُبَتِّكُنَّ آذَانَ الْأَنْعَامِ وَلَآمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ اللَّهِ ۚ وَمَنْ يَتَّخِذِ الشَّيْطَانَ وَلِيًّا مِنْ دُونِ اللَّهِ فَقَدْ خَسِرَ خُسْرَانًا مُبِينًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 119,
      "juz": 5,
      "manzil": 1,
      "page": 97,
      "ruku": 79,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَأُضِلَّنَّهُمۡ وَلَأُمَنِّيَنَّهُمۡ وَلَأٓمُرَنَّهُمۡ فَلَيُبَتِّكُنَّ ءَاذَانَ ٱلۡأَنۡعَٰمِ وَلَأٓمُرَنَّهُمۡ فَلَيُغَيِّرُنَّ خَلۡقَ ٱللَّهِۚ وَمَن يَتَّخِذِ ٱلشَّيۡطَٰنَ وَلِيّٗا مِّن دُونِ ٱللَّهِ فَقَدۡ خَسِرَ خُسۡرَانٗا مُّبِينٗا ٩١١\n                                    \n                                    \n                                    ( ولأضلنهم ) أي : عن الحق ( ولأمنينهم ) أي : أزين لهم ترك التوبة ، وأعدهم الأماني ، وآمرهم بالتسويف والتأخير ، وأغرهم من أنفسهم .\nوقوله : ( ولآمرنهم فليبتكن آذان الأنعام ) قال قتادة والسدي وغيرهما : يعني تشقيقها وجعلها سمة وعلامة للبحيرة والسائبة .\n( ولآمرنهم فليغيرن خلق الله ) قال ابن عباس : يعني بذلك خصاء الدواب . وكذا روي عن ابن عمر ، وأنس ، وسعيد بن المسيب ، وعكرمة ، وأبي عياض ، وأبي صالح ، وقتادة ، والثوري . وقد ورد في حديث النهي عن ذلك .\nوقال الحسن بن أبي الحسن البصري : يعني بذلك الوشم . وفي صحيح مسلم النهي عن الوشم في الوجه وفي لفظ : \" لعن الله من فعل ذلك \" . وفي الصحيح عن ابن مسعود أنه قال : لعن الله الواشمات والمستوشمات ، والنامصات والمتنمصات ، والمتفلجات للحسن المغيرات خلق الله ، عز وجل ، ثم قال : ألا ألعن من لعن رسول الله صلى الله عليه وسلم وهو في كتاب الله ، عز وجل ، يعني قوله : ( وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا ) [ الحشر : 7 ] .\nوقال ابن عباس في رواية عنه ، ومجاهد ، وعكرمة أيضا وإبراهيم النخعي ، والحسن ، وقتادة ، والحكم ، والسدي ، والضحاك ، وعطاء الخراساني في قوله : ( ولآمرنهم فليغيرن خلق الله ) يعني : دين الله ، عز وجل . وهذا كقوله تعالى : ( فأقم وجهك للدين حنيفا فطرة الله التي فطر الناس عليها لا تبديل لخلق الله ) [ الروم : 30 ] على قول من جعل ذلك أمرا ، أي : لا تبدلوا فطرة الله ، ودعوا الناس على فطرتهم ، كما ثبت في الصحيحين عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" كل مولود يولد على الفطرة ، فأبواه يهودانه ، وينصرانه ، ويمجسانه ، كما تولد البهيمة بهيمة جمعاء ، هل يحسون فيها من جدعاء ؟ \" وفي صحيح مسلم ، عن عياض بن حمار قال : قال رسول الله صلى الله عليه وسلم : \" قال الله عز وجل : إني خلقت عبادي حنفاء ، فجاءتهم الشياطين فاجتالتهم عن دينهم ، وحرمت عليهم ما أحللت لهم \" .\nوقوله تعالى : ( ومن يتخذ الشيطان وليا من دون الله فقد خسر خسرانا مبينا ) أي : فقد خسر الدنيا والآخرة ، وتلك خسارة لا جبر لها ولا استدراك لفائتها .\n                                    ",
        "qortoby": "وَلَأُضِلَّنَّهُمۡ وَلَأُمَنِّيَنَّهُمۡ وَلَأٓمُرَنَّهُمۡ فَلَيُبَتِّكُنَّ ءَاذَانَ ٱلۡأَنۡعَٰمِ وَلَأٓمُرَنَّهُمۡ فَلَيُغَيِّرُنَّ خَلۡقَ ٱللَّهِۚ وَمَن يَتَّخِذِ ٱلشَّيۡطَٰنَ وَلِيّٗا مِّن دُونِ ٱللَّهِ فَقَدۡ خَسِرَ خُسۡرَانٗا مُّبِينٗا ٩١١\n                                    \n                                    \n                                    قوله تعالى : ولأضلنهم ولأمنينهم ولآمرنهم فليبتكن آذان الأنعام ولآمرنهم فليغيرن خلق الله ومن يتخذ الشيطان وليا من دون الله فقد خسر خسرانا مبينا\nفيه تسع مسائل :\nالأولى : قوله تعالى : ولأضلنهم أي لأصرفنهم عن طريق الهدى . ولأمنينهم أي لأسولن لهم ، من التمني ، وهذا لا ينحصر إلى واحد من الأمنية ، لأن كل واحد في نفسه إنما يمنيه بقدر رغبته وقرائن حاله . وقيل : لأمنينهم طول الحياة الخير والتوبة والمعرفة مع الإصرار . ولآمرنهم فليبتكن آذان الأنعام البتك القطع ، ومنه سيف باتك . أي أحملهم على قطع آذان البحيرة والسائبة ونحوه . يقال : بتكه وبتكه ، ( مخففا ومشددا ) وفي يده بتكة أي : قطعة ، والجمع بتك ، قال زهير :\nحتى إذا ما هوت كف الغلام بها طارت وفي كفه من ريشها بتك\nالثانية : قوله تعالى : ولآمرنهم فليغيرن خلق الله اللامات كلها للقسم . واختلف العلماء في هذا التغيير إلى ماذا يرجع ، فقالت طائفة : هو الخصاء وفقء الأعين وقطع الآذان ، قال معناه ابن عباس وأنس وعكرمة وأبو صالح . وذلك كله تعذيب للحيوان ، وتحريم وتحليل بالطغيان ، وقول بغير حجة ولا برهان . والآذان في الأنعام جمال ومنفعة ، وكذلك غيرها من الأعضاء ، فلذلك رأى الشيطان أن يغير بها خلق الله تعالى . وفي حديث عياض بن حمار المجاشعي : ( وإني خلقت عبادي حنفاء كلهم وأن الشياطين أتتهم فاجتالتهم عن دينهم فحرمت عليهم ما أحللت لهم وأمرتهم أن يشركوا بي ما لم أنزل به سلطانا وأمرتهم أن يغيروا خلقي ) . الحديث أخرجه القاضي إسماعيل ومسلم أيضا . وروى إسماعيل قال : حدثنا أبو الوليد وسليمان بن حرب قالا حدثنا شعبة عن أبي إسحاق عن أبي الأحوص عن أبيه قال : أتيت رسول الله صلى الله عليه وسلم وأنا قشف الهيئة ، قال : هل لك من مال ؟ قال قلت : نعم . قال : من أي المال ؟ قلت : من كل المال ، من الخيل والإبل والرقيق - قال أبو الوليد : والغنم - قال : فإذا آتاك الله مالا فلير عليك أثره ثم قال : هل تنتج إبل قومك صحاحا آذانها فتعمد إلى موسى فتشق آذانها وتقول هذه بحر وتشق جلودها وتقول هذه صرم لتحرمها عليك وعلى أهلك ؟ قال : قلت أجل . قال : وكل ما آتاك الله حل وموسى الله أحد من موساك ، وساعد الله أشد من ساعدك . قال قلت : يا رسول الله ، أرأيت رجلا نزلت به فلم يقرني ثم نزل بي أفأقريه أم أكافئه ؟ فقال : بل أقره .\nالثالثة : ولما كان هذا من فعل الشيطان وأثره أمرنا رسول الله صلى الله عليه وسلم \" أن نستشرف العين والأذن ولا نضحي بعوراء ولا مقابلة ولا مدابرة ولا خرقاء ولا شرقاء \" أخرجه أبو داود عن علي قال : أمرنا ؛ فذكره . المقابلة : المقطوعة طرف الأذن . والمدابرة المقطوعة مؤخر الأذن . والشرقاء : مشقوقة الأذن ، والخرقاء التي تخرق أذنها السمة . والعيب في الأذن مراعى عند جماعة العلماء . قال مالك والليث : المقطوعة الأذن أو جل الأذن لا تجزئ ، والشق للميسم يجزئ ، وهو قول الشافعي وجماعة الفقهاء . فإن كانت سكاء ، وهي التي خلقت بلا أذن فقال مالك والشافعي : لا تجوز . وإن كانت صغيرة الأذن أجزأت ، وروي عن أبي حنيفة مثل ذلك .\nالرابعة : وأما خصاء البهائم فرخص فيه جماعة من أهل العلم إذا قصدت فيه المنفعة إما لسمن أو غيره . والجمهور من العلماء وجماعتهم على أنه لا بأس أن يضحى بالخصي ، واستحسنه بعضهم إذا كان أسمن من غيره . ورخص في خصاء الخيل عمر بن عبد العزيز . وخصى عروة بن الزبير بغلا له . ورخص مالك في خصاء ذكور الغنم ، وإنما جاز ذلك لأنه لا يقصد به تعليق الحيوان بالدين لصنم يعبد ، ولا لرب يوحد . وإنما يقصد به تطييب اللحم فيما يؤكل ، وتقوية الذكر إذا انقطع أمله عن الأنثى . ومنهم من كره ذلك ، لقول النبي صلى الله عليه وسلم : إنما يفعل ذلك الذين لا يعلمون . واختاره ابن المنذر وقال : لأن ذلك ثابت عن ابن عمر ، وكان يقول : هو نماء خلق الله ؛ وكره ذلك عبد الملك بن مروان . وقال الأوزاعي : كانوا يكرهون خصاء كل شيء له نسل . وقال ابن المنذر : وفيه حديثان : أحدهما عن ابن عمر أن النبي صلى الله عليه وسلم نهى عن خصاء الغنم والبقر والإبل والخيل . والآخر حديث ابن عباس أن النبي صلى الله عليه وسلم نهى عن صبر الروح وخصاء البهائم . والذي في الموطأ من هذا الباب ما ذكره عن نافع عن ابن عمر أنه كان يكره الإخصاء ويقول : فيه تمام الخلق . قال أبو عمر : يعني في ترك الإخصاء تمام الخلق ، وروي نماء الخلق .\nقلت : أسنده أبو محمد عبد الغني من حديث عمر بن إسماعيل عن نافع عن ابن عمر قال : كان رسول الله صلى الله عليه وسلم يقول : لا تخصوا ما ينمي خلق الله . رواه عن الدارقطني شيخه ، قال : حدثنا أبو عبد الله المعدل حدثنا عباس بن محمد حدثنا أبو مالك النخعي عن عمر بن إسماعيل ، فذكره . قال الدارقطني : ورواه عبد الصمد بن النعمان عن أبي مالك .\nالخامسة : وأما الخصاء في الآدمي فمصيبة ، فإنه إذا خصي بطل قلبه وقوته ، عكس الحيوان ، وانقطع نسله المأمور به في قوله عليه السلام : تناكحوا تناسلوا فإني مكاثر بكم الأمم ثم إن فيه ألما عظيما ربما يفضي بصاحبه إلى الهلاك ، فيكون فيه تضييع مال وإذهاب نفس ، وكل ذلك منهي عنه . ثم هذه مثلة ، وقد نهى النبي صلى الله عليه وسلم عن المثلة ، وهو صحيح . وقد كره جماعة من فقهاء الحجازيين والكوفيين شراء الخصي من الصقالبة وغيرهم وقالوا : لو لم يشتروا منهم لم يخصوا . ولم يختلفوا أن خصاء بني آدم لا يحل ولا يجوز ؛ لأنه مثلة وتغيير لخلق الله تعالى ، وكذلك قطع سائر أعضائهم في غير حد ولا قود ، قاله أبو عمر .\nالسادسة : وإذا تقرر هذا فاعلم أن الوسم والإشعار مستثنى من نهيه عليه السلام عن شريطة الشيطان ، وهي ما قدمناه من نهيه عن تعذيب الحيوان بالنار ، والوسم : الكي بالنار وأصله العلامة ، يقال : وسم الشيء يسمه إذا علمه بعلامة يعرف بها ، ومنه قوله تعالى : سيماهم في وجوههم . فالسيما العلامة والميسم المكواة . وثبت في صحيح مسلم عن أنس قال : رأيت في يد رسول الله صلى الله عليه وسلم الميسم وهو يسم إبل الصدقة والفيء وغير ذلك حتى يعرف كل مال فيؤدى في حقه ، ولا يتجاوز به إلى غيره .\nالسابعة : والوسم جائز في كل الأعضاء غير الوجه ، لما رواه جابر قال : نهى رسول الله صلى الله عليه وسلم عن الضرب في الوجه وعن الوسم في الوجه ، أخرجه مسلم . وإنما كان ذلك لشرفه على الأعضاء ، إذ هو مقر الحسن والجمال ، ولأن به قوام الحيوان ، وقد مر النبي صلى الله عليه وسلم برجل يضرب عبده فقال : اتق الوجه فإن الله خلق آدم على صورته . أي على صورة المضروب ؛ أي وجه هذا المضروب يشبه وجه آدم ، فينبغي أن يحترم لشبهه . وهذا أحسن ما قيل في تأويله والله أعلم . وقالت طائفة : الإشارة بالتغيير إلي الوشم وما جرى مجراه من التصنع للحسن ؛ قاله ابن مسعود والحسن . ومن ذلك الحديث الصحيح عن عبد الله قال : قال رسول الله صلى الله عليه وسلم : لعن الله الواشمات والمستوشمات والنامصات والمتنمصات والمتفلجات للحسن ، المغيرات خلق الله الحديث أخرجه مسلم ، وسيأتي بكماله في الحشر إن شاء الله تعالى . والوشم يكون في اليدين ، وهو أن يغرز ظهر كف المرأة ومعصمها بإبرة ثم يحشى بالكحل أو بالنئور فيخضر . وقد وشمت تشم وشما فهي واشمة . والمستوشمة التي يفعل ذلك بها ؛ قال الهروي . وقال ابن العربي : ورجال صقلية وإفريقية يفعلونه ؛ ليدل كل واحد منهم على رجلته في حداثته . قال القاضي عياض : ووقع في رواية الهروي - أحد رواة مسلم - مكان \" الواشمة والمستوشمة \" \" الواشية والمستوشية \" ( بالياء مكان الميم ) وهو من الوشي وهو التزين ؛ وأصل الوشي نسج الثوب على لونين ، وثور موشى في وجهه وقوائمه سواد ؛ أي تشي المرأة نفسها بما تفعله فيها من التنميص والتفليج والأشر . والمتنمصات جمع متنمصة وهي التي تقلع الشعر من وجهها بالمنماص ، وهو الذي يقلع الشعر ؛ ويقال لها النامصة . ابن العربي : وأهل مصر ينتفون شعر العانة وهو منه ؛ فإن السنة حلق العانة ونتف الإبط ، فأما نتف الفرج فإنه يرخيه ويؤذيه ، ويبطل كثيرا من المنفعة فيه . والمتفلجات جمع متفلجة ، وهي التي تفعل الفلج في أسنانها ؛ أي تعانيه حتى ترجع المصمتة الأسنان خلقة فلجاء صنعة . وفي غير كتاب مسلم : \" الواشرات \" ، وهي جمع واشرة ، وهي التي تشر أسنانها ؛ أي تصنع فيها أشرا ، وهي التحزيزات التي تكون في أسنان الشبان ؛ تفعل ذلك المرأة الكبيرة تشبها بالشابة . وهذه الأمور كلها قد شهدت الأحاديث بلعن فاعلها وأنها من الكبائر . واختلف في المعنى الذي نهي لأجلها ؛ فقيل : لأنها من باب التدليس . وقيل : من باب تغيير خلق الله تعالى ؛ كما قال ابن مسعود ، وهو أصح ، وهو يتضمن المعنى الأول . ثم قيل : هذا المنهي عنه إنما هو فيما يكون باقيا ؛ لأنه من باب تغيير خلق الله تعالى ، فأما ما لا يكون باقيا كالكحل والتزين به للنساء فقد أجاز العلماء ذلك مالك وغيره . وكرهه مالك للرجال . وأجاز مالك أيضا أن تشي المرأة يديها بالحناء . وروي عن عمر إنكار ذلك وقال : إما أن تخضب يديها كلها وإما أن تدع ، وأنكر مالك هذه الرواية عن عمر ، ولا تدع الخضاب بالحناء ؛ فإن النبي صلى الله عليه وسلم رأى امرأة لا تختضب قال : لا تدع إحداكن يدها كأنها يد رجل فما زالت تختضب وقد جاوزت التسعين حتى ماتت . قال القاضي عياض : وجاء حديث بالنهي عن تسويد الحناء ، ذكره صاحب المصابيح ولا تتعطل ، ويكون في عنقها قلادة من سير في خرز ، فإنه يروى عن النبي صلى الله عليه وسلم أنه قال لعائشة رضي الله عنها : إنه لا ينبغي أن تكوني بغير قلادة إما بخيط وإما بسير . وقال أنس : يستحب للمرأة أن تعلق في عنقها في الصلاة ولو سيرا . قال أبو جعفر الطبري : في حديث ابن مسعود دليل على أنه لا يجوز تغيير شيء من خلقها الذي خلقها الله عليه بزيادة أو نقصان ، التماس الحسن لزوج أو غيره ، سواء فلجت أسنانها أو وشرتها ، أو كان لها سن زائدة فأزالتها أو أسنان طوال فقطعت أطرافها . وكذا لا يجوز لها حلق لحية أو شارب أو عنفقة إن نبتت لها ؛ لأن كل ذلك تغيير خلق الله . قال عياض : ويأتي على ما ذكره أن من خلق بأصبع زائدة أو عضو زائد لا يجوز له قطعه ولا نزعه ؛ لأنه من تغيير خلق الله تعالى : إلا أن تكون هذه الزوائد تؤلمه فلا بأس بنزعها عند أبي جعفر وغيره .\nالثامنة : قلت : ومن هذا الباب قوله صلى الله عليه وسلم : لعن الله الواصلة والمستوصلة والواشمة والمستوشمة أخرجه مسلم . فنهى صلى الله عليه وسلم عن وصل المرأة شعرها ؛ وهو أن يضاف إليه شعر آخر يكثر به ، والواصلة هي التي تفعل ذلك ، والمستوصلة هي التي تستدعي من يفعل ذلك بها . مسلم عن جابر قال : زجر النبي صلى الله عليه وسلم أن تصل المرأة بشعرها شيئا . وخرج عن أسماء بنت أبي بكر قالت : جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت : يا رسول الله ، إن لي ابنة عريسا أصابتها حصبة فتمرق شعرها أفأصله ؟ فقال : لعن الله الواصلة والمستوصلة . وهذا كله نص في تحريم وصل الشعر ، وبه قال مالك وجماعة العلماء . ومنعوا الوصل بكل شيء من الصوف والخرق وغير ذلك ؛ لأنه في معنى وصله بالشعر . وشذ الليث بن سعد فأجاز وصله بالصوف والخرق وما ليس بشعر ؛ وهذا أشبه بمذهب أهل الظاهر . وأباح آخرون وضع الشعر على الرأس وقالوا : إنما جاء النهي عن الوصل خاصة ، وهذه ظاهرية محضة وإعراض عن المعنى . وشذ قوم فأجازوا الوصل مطلقا ، وهو قول باطل قطعا ترده الأحاديث . وقد روي عن عائشة رضي الله عنها ولم يصح . وروي عن ابن سيرين أنه سأله رجل فقال : إن أمي كانت تمشط النساء ، أتراني آكل من مالها ؟ فقال : إن كانت تصل فلا . ولا يدخل في النهي ما ربط منه بخيوط الحرير الملونة على وجه الزينة والتجميل ، والله أعلم .\nالتاسعة : وقالت طائفة : المراد بالتغيير لخلق الله هو أن الله تعالى خلق الشمس والقمر والأحجار والنار وغيرها من المخلوقات ؛ ليعتبر بها وينتفع بها ، فغيرها الكفار بأن جعلوها آلهة معبودة . قال الزجاج : إن الله تعالى خلق الأنعام لتركب وتؤكل فحرموها على أنفسهم ، وجعل الشمس والقمر والحجارة مسخرة للناس فجعلوها آلهة يعبدونها ، فقد غيروا ما خلق الله . وقاله جماعة من أهل التفسير : مجاهد والضحاك وسعيد بن جبير وقتادة . وروي عن ابن عباس فليغيرن خلق الله دين الله ؛ وقال النخعي ، واختاره الطبري قال : وإذا كان ذلك معناه دخل فيه فعل كل ما نهى الله عنه من خصاء ووشم وغير ذلك من المعاصي ؛ لأن الشيطان يدعو إلى جميع المعاصي ؛ أي فليغيرن ما خلق الله في دينه . وقال مجاهد أيضا : فليغيرن خلق الله فطرة الله التي فطر الناس عليها ؛ يعني أنهم ولدوا على الإسلام فأمرهم الشيطان بتغييره ، وهو معنى قوله عليه السلام : كل مولود يولد على الفطرة فأبواه يهودانه وينصرانه ويمجسانه . فيرجع معنى الخلق إلى ما أوجده فيهم يوم الذر من الإيمان به في قوله تعالى : ألست بربكم قالوا بلى . قال ابن العربي : روي عن طاوس أنه كان لا يحضر نكاح سوداء بأبيض ولا بيضاء بأسود ويقول : هذا من قول الله فليغيرن خلق الله . قال القاضي : وهذا وإن كان يحتمله اللفظ فهو مخصوص بما أنفذه النبي صلى الله عليه وسلم من نكاح مولاه زيد وكان أبيض بظئره بركة الحبشية أم أسامة وكان أسود من أبيض ، وهذا مما خفي على طاوس مع علمه .\nقلت : ثم أنكح أسامة فاطمة بنت قيس وكانت بيضاء قرشية . وقد كانت تحت بلال أخت عبد الرحمن بن عوف زهرية . وهذا أيضا يخص وقد خفي عليهما .\nقوله تعالى : ومن يتخذ الشيطان وليا من دون الله أي يطيعه ويدع أمر الله . فقد خسر أي نقص نفسه وغبنها بأن أعطى الشيطان حق الله تعالى فيه وتركه من أجله .\n                                    ",
        "saadi": "وَلَأُضِلَّنَّهُمۡ وَلَأُمَنِّيَنَّهُمۡ وَلَأٓمُرَنَّهُمۡ فَلَيُبَتِّكُنَّ ءَاذَانَ ٱلۡأَنۡعَٰمِ وَلَأٓمُرَنَّهُمۡ فَلَيُغَيِّرُنَّ خَلۡقَ ٱللَّهِۚ وَمَن يَتَّخِذِ ٱلشَّيۡطَٰنَ وَلِيّٗا مِّن دُونِ ٱللَّهِ فَقَدۡ خَسِرَ خُسۡرَانٗا مُّبِينٗا ٩١١\n                                        \n                                        \n                                        \n                                        { وَلَأُضِلَّنَّهُمْ ْ} أي: عن الصراط المستقيم ضلالا في العلم، وضلالا في العمل. { وَلَأُمَنِّيَنَّهُمْ ْ} أي: مع الإضلال، لأمنينهم أن ينالوا ما ناله المهتدون. وهذا هو الغرور بعينه، فلم يقتصر على مجرد إضلالهم حتى زين لهم ما هم فيه من الضلال. وهذا زيادة شر إلى شرهم حيث عملوا أعمال أهل النار الموجبة للعقوبة وحسبوا أنها موجبة للجنة، واعتبر ذلك باليهود والنصارى ونحوهم فإنهم كما حكى الله عنهم، { وَقَالُوا لَنْ يَدْخُلَ الْجَنَّةَ إِلَّا مَنْ كَانَ هُودًا أَوْ نَصَارَى تِلْكَ أَمَانِيُّهُمْ ْ} { كَذَلِكَ زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمْ ْ} { قُلْ هَلْ نُنَبِّئُكُمْ بِالْأَخْسَرِينَ أَعْمَالًا الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا ْ} الآية. وقال تعالى عن المنافقين إنهم يقولون يوم القيامة للمؤمنين: { أَلَمْ نَكُنْ مَعَكُمْ قَالُوا بَلَى وَلَكِنَّكُمْ فَتَنْتُمْ أَنْفُسَكُمْ وَتَرَبَّصْتُمْ وَارْتَبْتُمْ وَغَرَّتْكُمُ الْأَمَانِيُّ حَتَّى جَاءَ أَمْرُ اللَّهِ وَغَرَّكُمْ بِاللَّهِ الْغَرُورُ ْ} وقوله: { وَلَآمُرَنَّهُمْ فَلَيُبَتِّكُنَّ آذَانَ الْأَنْعَامِ ْ} أي: بتقطيع آذانها، وذلك كالبحيرة والسائبة والوصيلة والحام فنبه ببعض ذلك على جميعه، وهذا نوع من الإضلال يقتضي تحريم ما أحل الله أو تحليل ما حرم الله، ويلتحق بذلك من الاعتقادات الفاسدة والأحكام الجائرة ما هو من أكبر الإضلال. { وَلَآمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ اللَّهِ ْ} وهذا يتناول تغيير الخلقة الظاهرة بالوشم، والوشر والنمص والتفلج للحسن، ونحو ذلك مما أغواهم به الشيطان فغيروا خلقة الرحمن. وذلك يتضمن التسخط من خلقته والقدح في حكمته، واعتقاد أن ما يصنعون بأيديهم أحسن من خلقة الرحمن، وعدم الرضا بتقديره وتدبيره، ويتناول أيضا تغيير الخلقة الباطنة، فإن الله تعالى خلق عباده حنفاء مفطورين على قبول الحق وإيثاره، فجاءتهم الشياطين فاجتالتهم عن هذا الخلق الجميل، وزينت لهم الشر والشرك والكفر والفسوق والعصيان. فإن كل مولود يولد على الفطرة ولكن أبواه يهوِّدانه أو ينصِّرانه أو يمجِّسانه، ونحو ذلك مما يغيرون به ما فطر الله عليه العباد من توحيده وحبه ومعرفته. فافترستهم الشياطين في هذا الموضع افتراس السبع والذئاب للغنم المنفردة. لولا لطف الله وكرمه بعباده المخلصين لجرى عليهم ما جرى على هؤلاء المفتونين، وهذا الذي جرى عليهم من توليهم عن ربهم وفاطرهم وتوليهم لعدوهم المريد لهم الشر من كل وجه، فخسروا الدنيا والآخرة، ورجعوا بالخيبة والصفقة الخاسرة، ولهذا قال: { وَمَنْ يَتَّخِذِ الشَّيْطَانَ وَلِيًّا مِنْ دُونِ اللَّهِ فَقَدْ خَسِرَ خُسْرَانًا مُبِينًا ْ} وأي خسار أبين وأعظم ممن خسر دينه ودنياه وأوبقته معاصيه وخطاياه؟!! فحصل له الشقاء الأبدي، وفاته النعيم السرمدي. كما أن من تولى مولاه وآثر رضاه، ربح كل الربح، وأفلح كل الفلاح، وفاز بسعادة الدارين، وأصبح قرير العين، فلا مانع لما أعطيت، ولا معطي لما منعت، اللهم تولنا فيمن توليت، وعافنا فيمن عافيت.\n                                    "
      },
      "originalText": "وَلَأُضِلَّنَّهُمۡ وَلَأُمَنِّيَنَّهُمۡ وَلَأٓمُرَنَّهُمۡ فَلَيُبَتِّكُنَّ ءَاذَانَ ٱلۡأَنۡعَٰمِ وَلَأٓمُرَنَّهُمۡ فَلَيُغَيِّرُنَّ خَلۡقَ ٱللَّهِۚ وَمَن يَتَّخِذِ ٱلشَّيۡطَٰنَ وَلِيّٗا مِّن دُونِ ٱللَّهِ فَقَدۡ خَسِرَ خُسۡرَانٗا مُّبِينٗا ٩١١"
    },
    {
      "number": 613,
      "text": "يَعِدُهُمْ وَيُمَنِّيهِمْ ۖ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلَّا غُرُورًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 120,
      "juz": 5,
      "manzil": 1,
      "page": 97,
      "ruku": 79,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "يَعِدُهُمۡ وَيُمَنِّيهِمۡۖ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا ٠٢١\n                                    \n                                    \n                                    وقوله : ( يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا ) وهذا إخبار عن الواقع ; لأن الشيطان يعد أولياءه ويمنيهم بأنهم هم الفائزون في الدنيا والآخرة ، وقد كذب وافترى في ذلك ; ولهذا قال : ( وما يعدهم الشيطان إلا غرورا ) كما قال تعالى مخبرا عن إبليس يوم المعاد : ( وقال الشيطان لما قضي الأمر إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان [ إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ما أنا بمصرخكم وما أنتم بمصرخي إني كفرت بما أشركتمون من قبل ] إن الظالمين لهم عذاب أليم ) [ إبراهيم : 22 ] .\n                                    ",
        "qortoby": "يَعِدُهُمۡ وَيُمَنِّيهِمۡۖ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا ٠٢١\n                                    \n                                    \n                                    قوله : يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا\nقوله تعالى : يعدهم المعنى يعدهم أباطيله وترهاته من المال والجاه والرياسة ، وأن لا بعث ولا عقاب ، ويوهمهم الفقر حتى لا ينفقوا في الخير ويمنيهم كذلك وما يعدهم الشيطان إلا غرورا أي خديعة . قال ابن عرفة : الغرور ما رأيت له ظاهرا تحبه وفيه باطن مكروه أو مجهول . والشيطان غرور ؛ لأنه يحمل على محاب النفس ، ووراء ذلك ما يسوء .\n                                    ",
        "saadi": "يَعِدُهُمۡ وَيُمَنِّيهِمۡۖ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا ٠٢١\n                                        \n                                        \n                                        \n                                        { يَعِدُهُمْ وَيُمَنِّيهِمْ ْ} أي: يعد الشيطان من يسعى في إضلالهم، والوعد يشمل حتى الوعيد كما قال تعالى: { الشَّيْطَانُ يَعِدُكُمُ الْفَقْرَ ْ} فإنه يعدهم إذا أنفقوا في سبيل الله افتقروا، ويخوفهم إذا جاهدوا بالقتل وغيره، كما قال تعالى: { إِنَّمَا ذَلِكُمُ الشَّيْطَانُ يُخَوِّفُ أَوْلِيَاءَهُ ْ} الآية. ويخوفهم عند إيثار مرضاة الله بكل ما يمكن وما لا يمكن مما يدخله في عقولهم حتى يكسلوا عن فعل الخير، وكذلك يمنيهم الأماني الباطلة التي هي عند التحقيق كالسراب الذي لا حقيقة له، ولهذا قال: { وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلَّا غُرُورًا}\n                                    "
      },
      "originalText": "يَعِدُهُمۡ وَيُمَنِّيهِمۡۖ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا ٠٢١"
    },
    {
      "number": 614,
      "text": "أُولَٰئِكَ مَأْوَاهُمْ جَهَنَّمُ وَلَا يَجِدُونَ عَنْهَا مَحِيصًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 121,
      "juz": 5,
      "manzil": 1,
      "page": 97,
      "ruku": 79,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "أُوْلَٰٓئِكَ مَأۡوَىٰهُمۡ جَهَنَّمُ وَلَا يَجِدُونَ عَنۡهَا مَحِيصٗا ١٢١\n                                    \n                                    \n                                    وقوله \"أولئك\" أي المستحسنون له فيما وعدهم ومناهم ( مأواهم جهنم ) أي : مصيرهم ومآلهم يوم حسابهم ( ولا يجدون عنها محيصا ) أي : ليس لهم عنها مندوحة ولا مصرف ، ولا خلاص ولا مناص .\nثم ذكر حال السعداء الأتقياء وما لهم في مآلهم من الكرامة التامة ، فقال :\n                                    ",
        "qortoby": "أُوْلَٰٓئِكَ مَأۡوَىٰهُمۡ جَهَنَّمُ وَلَا يَجِدُونَ عَنۡهَا مَحِيصٗا ١٢١\n                                    \n                                    \n                                    أولئك ابتداء مأواهم ابتداء ثان جهنم خبر الثاني والجملة خبر الأول . ومحيصا ملجأ ، والفعل منه حاص يحيص .\n                                    ",
        "saadi": "أُوْلَٰٓئِكَ مَأۡوَىٰهُمۡ جَهَنَّمُ وَلَا يَجِدُونَ عَنۡهَا مَحِيصٗا ١٢١\n                                        \n                                        \n                                        \n                                        أُولَئِكَ مَأْوَاهُمْ جَهَنَّمُ ْ} أي: من انقاد للشيطان وأعرض عن ربه، وصار من أتباع إبليس وحزبه، مستقرهم النار. { وَلَا يَجِدُونَ عَنْهَا مَحِيصًا ْ} أي: مخلصا ولا ملجأ بل هم خالدون فيها أبد الآباد.\n                                    "
      },
      "originalText": "أُوْلَٰٓئِكَ مَأۡوَىٰهُمۡ جَهَنَّمُ وَلَا يَجِدُونَ عَنۡهَا مَحِيصٗا ١٢١"
    }
  ]
}