{
  "number": 99,
  "ayahsNumber": 7,
  "ayahs": [
    {
      "number": 621,
      "text": "وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا فَلَا جُنَاحَ عَلَيْهِمَا أَنْ يُصْلِحَا بَيْنَهُمَا صُلْحًا ۚ وَالصُّلْحُ خَيْرٌ ۗ وَأُحْضِرَتِ الْأَنْفُسُ الشُّحَّ ۚ وَإِنْ تُحْسِنُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 128,
      "juz": 5,
      "manzil": 1,
      "page": 99,
      "ruku": 80,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ بَعۡلِهَا نُشُوزًا أَوۡ إِعۡرَاضٗا فَلَا جُنَاحَ عَلَيۡهِمَآ أَن يُصۡلِحَا بَيۡنَهُمَا صُلۡحٗاۚ وَٱلصُّلۡحُ خَيۡرٞۗ وَأُحۡضِرَتِ ٱلۡأَنفُسُ ٱلشُّحَّۚ وَإِن تُحۡسِنُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٨٢١\n                                    \n                                    \n                                    يقول تعالى مخبرا ومشرعا عن حال الزوجين : تارة في حال نفور الرجل عن المرأة ، وتارة في حال اتفاقه معها ، وتارة في حال فراقه لها .\nفالحالة الأولى : ما إذا خافت المرأة من زوجها أن ينفر عنها ، أو يعرض عنها ، فلها أن تسقط حقها أو بعضه ، من نفقة أو كسوة ، أو مبيت ، أو غير ذلك من الحقوق عليه ، وله أن يقبل ذلك منها فلا جناح عليها في بذلها ذلك له ، ولا عليه في قبوله منها ; ولهذا قال تعالى : ( فلا جناح عليهما أن يصلحا بينهما صلحا ) ثم قال ( والصلح خير ) أي : من الفراق . وقوله : ( وأحضرت الأنفس الشح ) أي الصلح عند المشاحة خير من الفراق ; ولهذا لما كبرت سودة بنت زمعة عزم رسول الله صلى الله عليه وسلم على فراقها ، فصالحته على أن يمسكها ، وتترك يومها لعائشة ، فقبل ذلك منها وأبقاها على ذلك .\nذكر الرواية بذلك :\nقال أبو داود الطيالسي : حدثنا سليمان بن معاذ ، عن سماك بن حرب ، عن عكرمة ، عن ابن عباس قال : خشيت سودة أن يطلقها رسول الله صلى الله عليه وسلم ، فقالت : يا رسول الله ، لا تطلقني واجعل يومي لعائشة . ففعل ، ونزلت هذه الآية : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا ) الآية ، قال ابن عباس : فما اصطلحا عليه من شيء فهو جائز .\nورواه الترمذي ، عن محمد بن المثنى ، عن أبي داود الطيالسي ، به . وقال : حسن غريب\nوقال الشافعي أخبرنا مسلم ، عن ابن جريج ، عن عطاء ، عن ابن عباس ، أن رسول الله صلى الله عليه وسلم توفي عن تسع نسوة ، وكان يقسم لثمان .\nوفي الصحيحين ، من حديث هشام بن عروة ، عن أبيه ، عن عائشة قالت : لما كبرت سودة بنت زمعة وهبت يومها لعائشة ، فكان رسول الله صلى الله عليه وسلم يقسم لها بيوم سودة .\nوفي صحيح البخاري ، من حديث الزهري ، عن عروة ، عن عائشة ، نحوه .\nوقال سعيد بن منصور : أنبأنا عبد الرحمن بن أبي الزناد ، عن ، عن أبيه عروة قال : أنزل الله تعالى في سودة وأشباهها : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا ) وذلك أن سودة كانت امرأة قد أسنت ، ففزعت أن يفارقها رسول الله صلى الله عليه وسلم ، وضنت بمكانها منه ، وعرفت من حب رسول الله صلى الله عليه وسلم عائشة ومنزلتها منه ، فوهبت يومها من رسول الله صلى الله عليه وسلم لعائشة ، فقبل ذلك النبي صلى الله عليه وسلم .\nقال البيهقي : وقد رواه أحمد بن يونس : عن ابن أبي الزناد موصولا . وهذه الطريق رواها الحاكم في مستدركه فقال :\nحدثنا أبو بكر بن إسحاق الفقيه ، أخبرنا الحسن بن علي بن زياد ، حدثنا أحمد بن يونس ، حدثنا عبد الرحمن بن أبي الزناد ، عن هشام بن عروة ، عن أبيه ، عن عائشة : أنها قالت له : يا ابن أختي ، كان رسول الله صلى الله عليه وسلم لا يفضل بعضنا على بعض في مكثه عندنا ، وكان قل يوم إلا وهو يطوف علينا ، فيدنو من كل امرأة من غير مسيس ، حتى يبلغ إلى من هو يومها فيبيت عندها ، ولقد قالت سودة بنت زمعة - حين أسنت وفرقت أن يفارقها رسول الله صلى الله عليه وسلم - : يا رسول الله ، يومي هذا لعائشة . فقبل ذلك رسول الله صلى الله عليه وسلم . قالت عائشة : ففي ذلك أنزل الله : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا )\nوكذا رواه أبو داود ، عن أحمد بن يونس ، به . ثم قال الحاكم : صحيح الإسناد ولم يخرجاه .\nوقد رواه [ الحافظ أبو بكر ] بن مردويه من طريق أبي بلال الأشعري ، عن عبد الرحمن بن أبي الزناد ، به نحوه . ومن رواية عبد العزيز بن محمد الدراوردي ، عن هشام بن عروة ، بنحوه مختصرا ، والله أعلم .\nوقال أبو العباس محمد بن عبد الرحمن الدغولي في أول معجمه : حدثنا محمد بن يحيى ، حدثنا مسلم بن إبراهيم ، حدثنا هشام الدستوائي ، حدثنا القاسم بن أبي بزة قال : بعث النبي صلى الله عليه وسلم إلى سودة بنت زمعة بطلاقها ، فلما أن أتاها جلست له على طريق عائشة ، فلما رأته قالت له : أنشدك بالذي أنزل عليك كلامه واصطفاك على خلقه لما راجعتني ، فإني قد كبرت ولا حاجة لي في الرجال ، لكن أريد أن أبعث مع نسائك يوم القيامة . فراجعها فقالت : إني جعلت يومي وليلتي لحبة رسول الله صلى الله عليه وسلم . وهذا غريب مرسل .\nوقد قال البخاري : حدثنا محمد بن مقاتل ، أخبرنا عبد الله ، أخبرنا هشام بن عروة ، عن أبيه ، عن عائشة : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا ) قالت : الرجل تكون عنده المرأة ، ليس بمستكثر منها ، يريد أن يفارقها ، فتقول : أجعلك من شأني في حل . فنزلت هذه الآية .\nوقال ابن جرير : حدثنا ابن وكيع ، حدثنا أبي ، عن هشام بن عروة ، عن أبيه ، عن عائشة : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا فلا جناح عليهما أن يصلحا بينهما صلحا والصلح خير ) قالت : هذا في المرأة تكون عند الرجل ، فلعله ألا يكون يستكثر منها ، ولا يكون لها ولد ، ولها صحبة فتقول : لا تطلقني وأنت في حل من شأني .\nحدثني المثنى ، حدثنا حجاج بن منهال ، حدثنا حماد بن سلمة ، عن ، عن عروة ، عن عائشة في قوله : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا ) قالت : هو الرجل يكون له المرأتان : إحداهما قد كبرت ، أو هي دميمة وهو لا يستكثر منها فتقول : لا تطلقني ، وأنت في حل من شأني .\nوهذا الحديث ثابت في الصحيحين ، من غير وجه ، عن هشام بن عروة ، عن أبيه ، عن عائشة بنحو ما تقدم ، ولله الحمد والمنة .\nوقال ابن جرير : حدثنا ابن حميد وابن وكيع قالا حدثنا جرير ، عن أشعث ، عن ابن سيرين قال : جاء رجل إلى عمر ، رضي الله عنه ، فسأله عن آية ، فكره ذلك وضربه بالدرة ، فسأله آخر عن هذه الآية : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا ) فقال : عن مثل هذا فسلوا . ثم قال : هذه المرأة تكون عند الرجل ، قد خلا من سنها ، فيتزوج المرأة الشابة يلتمس ولدها ، فما اصطلحا عليه من شيء فهو جائز . وقال ابن أبي حاتم : حدثنا علي بن الحسن الهسنجاني ، حدثنا مسدد ، حدثنا أبو الأحوص ، عن سماك بن حرب ، عن خالد بن عرعرة قال : جاء رجل إلى علي بن أبي طالب [ رضي الله عنه ] فسأله عن قول الله عز وجل : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا فلا جناح عليهما ) قال علي : يكون الرجل عنده المرأة ، فتنبو عيناه عنها من دمامتها ، أو كبرها ، أو سوء خلقها ، أو قذذها ، فتكره فراقه ، فإن وضعت له من مهرها شيئا حل له ، وإن جعلت له من أيامها فلا حرج .\nوكذا رواه أبو داود الطيالسي ، عن شعبة ، عن حماد بن سلمة وأبي الأحوص . ورواه ابن جرير من طريق إسرائيل أربعتهم عن سماك ، به وكذا فسرها ابن عباس ، وعبيدة السلماني ، ومجاهد بن جبر ، والشعبي ، وسعيد بن جبير ، وعطاء ، وعطية العوفي ومكحول ، والحكم بن عتبة ، والحسن ، وقتادة ، وغير واحد من السلف والأئمة ، ولا أعلم [ في ذلك ] خلافا في أن المراد بهذه الآية هذا والله أعلم .\nوقال الشافعي : أنبأنا ابن عيينة ، عن الزهري ، عن ابن المسيب : أن ابنة محمد بن مسلمة كانت عند رافع بن خديج فكره منها أمرا إما كبرا أو غيره فأراد طلاقها فقالت : لا تطلقني واقسم لي ما بدا لك . فأنزل الله عز وجل : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا ) الآية .\nوقد رواه الحاكم في مستدركه ، من طريق عبد الرزاق ، عن معمر ، عن الزهري ، عن سعيد بن المسيب وسليمان بن يسار بأطول من هذا السياق .\nوقال الحافظ أبو بكر البيهقي : أخبرنا أبو سعيد بن أبي عمرو ، حدثنا أبو محمد أحمد بن عبد الله المزني ، أنبأنا علي بن محمد بن عيسى ، حدثنا أبو اليمان ، أخبرني شعيب بن أبي حمزة ، عن الزهري ، أخبرني سعيد بن المسيب وسليمان بن يسار : أن السنة في هاتين الآيتين اللتين ذكر الله فيهما نشوز المرء وإعراضه عن امرأته في قوله : ( وإن امرأة خافت من بعلها نشوزا أو إعراضا ) إلى تمام الآيتين ، أن المرء إذا نشز عن امرأته وآثر عليها ، فإن من الحق أن يعرض عليها أن يطلقها أو تستقر عنده على ما كانت من أثرة في القسم من ماله ونفسه ، فإن استقرت عنده على ذلك ، وكرهت أن يطلقها ، فلا حرج عليه فيما آثر عليها من ذلك ، فإن لم يعرض عليها الطلاق ، وصالحها على أن يعطيها من ماله ما ترضاه وتقر عنده على الأثرة في القسم من ماله ونفسه ، صلح له ذلك ، وجاز صلحها عليه ، كذلك ذكر سعيد بن المسيب وسليمان الصلح الذي قال الله عز وجل ( فلا جناح عليهما أن يصلحا بينهما صلحا والصلح خير ) .\nوقد ذكر لي أن رافع بن خديج الأنصاري - وكان من أصحاب النبي صلى الله عليه وسلم - كانت عنده امرأة حتى إذا كبرت تزوج عليها فتاة شابة ، وآثر عليها الشابة ، فناشدته الطلاق فطلقها تطليقة ، ثم أمهلها ، حتى إذا كادت تحل راجعها ، ثم عاد فآثر الشابة عليها فناشدته الطلاق فطلقها تطليقة أخرى ، ثم أمهلها ، حتى إذا كادت تحل راجعها ، ثم عاد فآثر الشابة عليها ، فناشدته الطلاق فقال لها : ما شئت ، إنما بقيت لك تطليقة واحدة ، فإن شئت استقررت على ما ترين من الأثرة ، وإن شئت فارقتك ، فقالت : لا بل أستقر على الأثرة . فأمسكها على ذلك ، فكان ذلك صلحهما ، ولم ير رافع عليه إثما حين رضيت أن تستقر عنده على الأثرة فيما آثر به عليها .\nوهذا رواه بتمامه عبد الرحمن بن أبي حاتم ، عن أبيه ، عن أبي اليمان ، عن شعيب ، عن الزهري ، عن سعيد بن المسيب ، وسليمان بن يسار ، فذكره بطوله ، والله أعلم\nوقوله : ( والصلح خير ) قال علي بن أبي طلحة ، عن ابن عباس : يعني التخيير ، أن يخير الزوج لها بين الإقامة والفراق ، خير من تمادي الزوج على أثرة غيرها عليها .\nوالظاهر من الآية أن صلحهما على ترك بعض حقها للزوج ، وقبول الزوج ذلك ، خير من المفارقة بالكلية ، كما أمسك النبي صلى الله عليه وسلم سودة بنت زمعة على أن تركت يومها لعائشة ، رضي الله عنها ، ولم يفارقها بل تركها من جملة نسائه ، وفعله ذلك لتتأسى به أمته في مشروعية ذلك وجوازه ، فهو أفضل في حقه عليه الصلاة والسلام . ولما كان الوفاق أحب إلى الله [ عز وجل ] من الفراق قال : ( والصلح خير ) بل الطلاق بغيض إليه ، سبحانه وتعالى ; ولهذا جاء في الحديث الذي رواه أبو داود وابن ماجه جميعا ، عن كثير بن عبيد ، عن محمد بن خالد ، عن معرف بن واصل ، عن محارب بن دثار ، عن عبد الله بن عمر قال : قال رسول الله صلى الله عليه وسلم : \" أبغض الحلال إلى الله الطلاق \" .\nثم رواه أبو داود عن أحمد بن يونس ، عن معرف عن محارب قال : قال رسول الله صلى الله عليه وسلم . . . فذكر معناه مرسلا .\nوقوله : ( وإن تحسنوا وتتقوا فإن الله كان بما تعملون خبيرا ) [ أي ] وإن تتجشموا مشقة الصبر على من تكرهون منهن ، وتقسموا لهن أسوة أمثالهن ، فإن الله عالم بذلك وسيجزيكم على ذلك أوفر الجزاء .\n                                    ",
        "qortoby": "وَإِنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ بَعۡلِهَا نُشُوزًا أَوۡ إِعۡرَاضٗا فَلَا جُنَاحَ عَلَيۡهِمَآ أَن يُصۡلِحَا بَيۡنَهُمَا صُلۡحٗاۚ وَٱلصُّلۡحُ خَيۡرٞۗ وَأُحۡضِرَتِ ٱلۡأَنفُسُ ٱلشُّحَّۚ وَإِن تُحۡسِنُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٨٢١\n                                    \n                                    \n                                    قوله تعالى : وإن امرأة خافت من بعلها نشوزا أو إعراضا فلا جناح عليهما أن يصلحا بينهما صلحا والصلح خير وأحضرت الأنفس الشح وإن تحسنوا وتتقوا فإن الله كان بما تعملون خبيرا\nفيه سبع مسائل :\nالأولى : وإن امرأة رفع بإضمار فعل يفسره ما بعده . وخافت بمعنى توقعت . وقول من قال : خافت تيقنت خطأ . قال الزجاج : المعنى وإن امرأة . خافت من بعلها دوام النشوز . قال النحاس : الفرق بين النشوز والإعراض أن النشوز التباعد ، والإعراض ألا يكلمها ولا يأنس بها . ونزلت الآية بسبب سودة بنت زمعة . روى الترمذي عن ابن عباس قال : خشيت سودة أن يطلقها رسول الله صلى الله عليه وسلم فقالت : لا تطلقني وأمسكني ، واجعل يومي منك لعائشة ؛ ففعل فنزلت : \" فلا جناح عليهما أن يصلحا بينهما صلحا والصلح خير \" فما اصطلحا عليه من شيء فهو جائز ، قال : هذا حديث حسن غريب . وروى ابن عيينة عن الزهري عن سعيد بن المسيب أن رافع بن خديج كانت تحته خولة بنت محمد بن مسلمة ، فكره من أمرها إما كبرا وإما غيره ، فأراد أن يطلقها فقالت : لا تطلقني واقسم لي ما شئت ؛ فجرت السنة بذلك فنزلت وإن امرأة خافت من بعلها نشوزا أو إعراضا . وروى البخاري عن عائشة رضي الله عنها وإن امرأة خافت من بعلها نشوزا أو إعراضا قالت : الرجل تكون عنده المرأة ليس بمستكثر منها يريد أن يفارقها فتقول : أجعلك من شأني في حل ؛ فنزلت هذه الآية . وقراءة العامة \" أن يصالحا \" . وقرأ أكثر الكوفيين \" أن يصلحا \" . وقرأ الجحدري وعثمان البتي \" أن يصلحا \" والمعنى يصطلحا ثم أدغم .\nالثانية : في هذه الآية من الفقه الرد على الرعن الجهال الذين يرون أن الرجل إذا أخذ شباب المرأة وأسنت لا ينبغي أن يتبدل بها . قال ابن أبي مليكة : إن سودة بنت زمعة لما أسنت أراد النبي صلى الله عليه وسلم أن يطلقها ، فآثرت الكون معه ، فقالت له : أمسكني واجعل يومي لعائشة ؛ ففعل صلى الله عليه وسلم ، وماتت وهي من أزواجه .\nقلت : وكذلك فعلت بنت محمد بن مسلمة ؛ روى مالك عن ابن شهاب عن رافع بن خديج أنه تزوج بنت محمد بن مسلمة الأنصارية ، فكانت عنده حتى كبرت ، فتزوج عليها فتاة شابة ، فآثر الشابة عليها ، فناشدته الطلاق ، فطلقها واحدة ، ثم أهملها حتى إذا كانت تحل راجعها ، ثم عاد فآثر الشابة عليها فناشدته الطلاق فطلقها واحدة ، ثم راجعها فآثر الشابة عليها فناشدته الطلاق فقال : ما شئت إنما بقيت واحدة ، فإن شئت استقررت على ما ترين من الأثرة ، وإن شئت فارقتك . قالت : بل أستقر على الأثرة . فأمسكها على ذلك ؛ ولم ير رافع عليه إثما حين قرت عنده على الأثرة . رواه معمر عن الزهري بلفظه ومعناه وزاد : فذلك الصلح الذي بلغنا أنه نزل فيه وإن امرأة خافت من بعلها نشوزا أو إعراضا فلا جناح عليهما أن يصلحا بينهما صلحا والصلح خير . قال أبو عمر بن عبد البر : قوله والله أعلم : \" فآثر الشابة عليها \" يريد في الميل بنفسه إليها والنشاط لها ؛ لا أنه آثرها عليها في مطعم وملبس ومبيت ؛ لأن هذا لا ينبغي أن يظن بمثل رافع ، والله أعلم . وذكر أبو بكر بن أبي شيبة قال : حدثنا أبو الأحوص عن سماك بن حرب عن خالد بن عرعرة عن علي بن أبي طالب رضي الله عنه أن رجلا سأله عن هذه الآية فقال : هي المرأة تكون عند الرجل فتنبو عيناه عنها من دمامتها أو فقرها أو كبرها أو سوء خلقها وتكره فراقه ؛ فإن وضعت له من مهرها شيئا حل له أن يأخذ وإن جعلت له من أيامها فلا حرج . وقال الضحاك : لا بأس أن ينقصها من حقها إذا تزوج من هي أشب منها وأعجب إليه . وقال مقاتل بن حيان : هو الرجل تكون تحته المرأة الكبيرة فيتزوج عليها الشابة ؛ فيقول لهذه الكبيرة : أعطيك من مالي على أن أقسم لهذه الشابة أكثر مما أقسم لك من الليل والنهار ؛ فترضى الأخرى بما اصطلحا عليه ؛ وإن أبت ألا ترضى فعليه أن يعدل بينهما في القسم .\nالثالثة : قال علماؤنا : وفي هذا أن أنواع الصلح كلها مباحة في هذه النازلة ؛ بأن يعطي الزوج على أن تصبر هي ، أو تعطي هي على أن يؤثر الزوج ، أو على أن يؤثر ويتمسك بالعصمة ، أو يقع الصلح على الصبر والأثرة من غير عطاء ؛ فهذا كله مباح . وقد يجوز أن تصالح إحداهن صاحبتها عن يومها بشيء تعطيها ، كما فعل أزواج النبي صلى الله عليه وسلم ؛ وذلك أن رسول الله صلى الله عليه وسلم كان غضب على صفية ، فقالت لعائشة : أصلحي بيني وبين رسول الله صلى الله عليه وسلم ، وقد وهبت يومي لك . ذكره ابن خويز منداد في أحكامه عن عائشة قالت : وجد رسول الله صلى الله عليه وسلم على صفية في شيء ؛ فقالت لي صفية : هل لك أن ترضين رسول الله صلى الله عليه وسلم عني ولك يومي ؟ قالت : فلبست خمارا كان عندي مصبوغا بزعفران ونضحته ، ثم جئت فجلست إلى جنب رسول الله صلى الله عليه وسلم فقال : إليك عني فإنه ليس بيومك . فقلت : ذلك فضل الله يؤتيه من يشاء ؛ وأخبرته الخبر ، فرضي عنها . وفيه أن ترك التسوية بين النساء وتفضيل بعضهن على بعض لا يجوز إلا بإذن المفضولة ورضاها .\nالرابعة : قرأ الكوفيون \" يصلحا \" . والباقون \" أن يصالحا \" . الجحدري \" يصلحا \" فمن قرأ \" يصالحا \" فوجهه أن المعروف في كلام العرب إذا كان بين قوم تشاجر أن يقال : تصالح القوم ، ولا يقال : أصلح القوم ؟ ولو كان أصلح لكان مصدره إصلاحا . ومن قرأ \" يصلحا \" فقد استعمل مثله في التشاجر والتنازع ؛ كما قال فأصلح بينهم . ونصب قول : \" صلحا \" على هذه القراءة على أنه مفعول ، وهو اسم مثل العطاء من أعطيت . فأصلحت صلحا مثل أصلحت أمرا ؛ وكذلك هو مفعول أيضا على قراءة من قرأ \" يصالحا \" لأن تفاعل قد جاء متعديا ؛ ويحتمل أن يكون مصدرا حذفت زوائده . ومن قرأ \" يصلحا \" فالأصل \" يصتلحا \" ثم صار إلى يصطلحا ، ثم أبدلت الطاء صادا وأدغمت فيها الصاد ؛ ولم تبدل الصاد طاء لما فيها من امتداد الزفير .\nالخامسة : قوله تعالى : والصلح خير لفظ عام مطلق يقتضي أن الصلح الحقيقي الذي تسكن إليه النفوس ويزول به الخلاف خير على الإطلاق . ويدخل في هذا المعنى جميع ما يقع عليه الصلح بين الرجل وامرأته في مال أو وطء أو غير ذلك . خير أي خير من الفرقة ؛ فإن التمادي على الخلاف والشحناء والمباغضة هي قواعد الشر ، وقال عليه السلام في البغضة : إنها الحالقة يعني حالقة الدين لا حالقة الشعر .\nالسادسة : قوله تعالى : وأحضرت الأنفس الشح إخبار بأن الشح في كل أحد . وأن الإنسان لا بد أن يشح بحكم خلقته وجبلته حتى يحمل صاحبه على بعض ما يكره ؛ يقال : شح يشح ( بكسر الشين ) قال ابن جبير : هو شح المرأة بالنفقة من زوجها وبقسمه لها أيامها . وقال ابن زيد : الشح هنا منه ومنها . وقال ابن عطية : وهذا أحسن ؛ فإن الغالب على المرأة الشح بنصيبها من زوجها ، والغالب على الزوج الشح بنصيبه من الشابة . والشح الضبط على المعتقدات والإرادة وفي الهمم والأموال ونحو ذلك ، فما أفرط منه على الدين فهو محمود ، وما أفرط منه في غيره ففيه بعض المذمة ، وهو الذي قال الله فيه : ومن يوق شح نفسه فأولئك هم المفلحون . وما صار إلى حيز منع الحقوق الشرعية أو التي تقتضيها المروءة فهو البخل وهي رذيلة . وإذا آل البخل إلى هذه الأخلاق المذمومة والشيم اللئيمة لم يبق معه خير مرجو ولا صلاح مأمول .\nقلت : وقد روي أن النبي صلى الله عليه وسلم قال للأنصار : من سيدكم ؟ قالوا : الجد بن قيس على بخل فيه . فقال النبي صلى الله عليه وسلم : وأي داء أدوى من البخل ! قالوا : وكيف ذاك يا رسول الله ؟ قال : إن قوما نزلوا بساحل البحر فكرهوا لبخلهم نزول الأضياف بهم فقالوا ليبعد الرجال منا عن النساء حتى يعتذر الرجال إلى الأضياف ببعد النساء وتعتذر النساء ببعد الرجال ، ففعلوا وطال ذلك بهم ، فاشتغل الرجال بالرجال والنساء بالنساء . وقد تقدم ، ذكره الماوردي .\nالسابعة : قوله تعالى : : وإن تحسنوا وتتقوا شرط فإن الله كان بما تعملون خبيرا جوابه وهذا خطاب للأزواج من حيث إن للزوج أن يشح ولا يحسن ؛ أي إن تحسنوا وتتقوا في عشرة النساء بإقامتكم عليهن مع كراهيتكم لصحبتهن واتقاء ظلمهن فهو أفضل لكم .\n                                    ",
        "saadi": "وَإِنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ بَعۡلِهَا نُشُوزًا أَوۡ إِعۡرَاضٗا فَلَا جُنَاحَ عَلَيۡهِمَآ أَن يُصۡلِحَا بَيۡنَهُمَا صُلۡحٗاۚ وَٱلصُّلۡحُ خَيۡرٞۗ وَأُحۡضِرَتِ ٱلۡأَنفُسُ ٱلشُّحَّۚ وَإِن تُحۡسِنُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٨٢١\n                                        \n                                        \n                                        \n                                        أي: إذا خافت المرأة نشوز زوجها أي: ترفعه عنها وعدم رغبته فيها وإعراضه عنها، فالأحسن في هذه الحالة أن يصلحا بينهما صلحا بأن تسمح المرأة عن بعض حقوقها اللازمة لزوجها على وجه تبقى مع زوجها، إما أن ترضى بأقل من الواجب لها من النفقة أو الكسوة أو المسكن، أو القسم بأن تسقط حقها منه، أو تهب يومها وليلتها لزوجها أو لضرتها. فإذا اتفقا على هذه الحالة فلا جناح ولا بأس عليهما فيها، لا عليها ولا على الزوج، فيجوز حينئذ لزوجها البقاء معها على هذه الحال، وهي خير من الفرقة، ولهذا قال: { وَالصُّلْحُ خَيْرٌ ْ} ويؤخذ من عموم هذا اللفظ والمعنى أن الصلح بين مَن بينهما حق أو منازعة في جميع الأشياء أنه خير من استقصاء كل منهما على كل حقه، لما فيها من الإصلاح وبقاء الألفة والاتصاف بصفة السماح. وهو جائز في جميع الأشياء إلا إذا أحلّ حراما أو حرّم حلالا، فإنه لا يكون صلحا وإنما يكون جورا. واعلم أن كل حكم من الأحكام لا يتم ولا يكمل إلا بوجود مقتضيه وانتفاء موانعه، فمن ذلك هذا الحكم الكبير الذي هو الصلح، فذكر تعالى المقتضي لذلك ونبه على أنه خير، والخير كل عاقل يطلبه ويرغب فيه، فإن كان -مع ذلك- قد أمر الله به وحثّ عليه ازداد المؤمن طلبا له ورغبة فيه. وذكر المانع بقوله: { وَأُحْضِرَتِ الْأَنْفُسُ الشُّحّ ْ} أي: جبلت النفوس على الشح، وهو: عدم الرغبة في بذل ما على الإنسان، والحرص على الحق الذي له، فالنفوس مجبولة على ذلك طبعا، أي: فينبغي لكم أن تحرصوا على قلع هذا الخُلُق الدنيء من نفوسكم، وتستبدلوا به ضده وهو السماحة، وهو بذل الحق الذي عليك؛ والاقتناع ببعض الحق الذي لك. فمتى وفق الإنسان لهذا الخُلُق الحسن سهل حينئذ عليه الصلح بينه وبين خصمه ومعامله، وتسهلت الطريق للوصول إلى المطلوب. بخلاف من لم يجتهد في إزالة الشح من نفسه، فإنه يعسر عليه الصلح والموافقة، لأنه لا يرضيه إلا جميع ماله، ولا يرضى أن يؤدي ما عليه، فإن كان خصمه مثله اشتد الأمر. ثم قال: { وَإِنْ تُحْسِنُوا وَتَتَّقُوا ْ} أي: تحسنوا في عبادة الخالق بأن يعبد العبد ربه كأنه يراه فإن لم يكن يراه فإنه يراه، وتحسنوا إلى المخلوقين بجميع طرق الإحسان، من نفع بمال، أو علم، أو جاه، أو غير ذلك. { وَتَتَّقُوا ْ} الله بفعل جميع المأمورات، وترك جميع المحظورات. أو تحسنوا بفعل المأمور، وتتقوا بترك المحظور { فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا ْ} قد أحاط به علما وخبرا، بظاهره وباطنه، فيحفظه لكم، ويجازيكم عليه أتم الجزاء.\n                                    "
      },
      "originalText": "وَإِنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ بَعۡلِهَا نُشُوزًا أَوۡ إِعۡرَاضٗا فَلَا جُنَاحَ عَلَيۡهِمَآ أَن يُصۡلِحَا بَيۡنَهُمَا صُلۡحٗاۚ وَٱلصُّلۡحُ خَيۡرٞۗ وَأُحۡضِرَتِ ٱلۡأَنفُسُ ٱلشُّحَّۚ وَإِن تُحۡسِنُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِيرٗا ٨٢١"
    },
    {
      "number": 622,
      "text": "وَلَنْ تَسْتَطِيعُوا أَنْ تَعْدِلُوا بَيْنَ النِّسَاءِ وَلَوْ حَرَصْتُمْ ۖ فَلَا تَمِيلُوا كُلَّ الْمَيْلِ فَتَذَرُوهَا كَالْمُعَلَّقَةِ ۚ وَإِنْ تُصْلِحُوا وَتَتَّقُوا فَإِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 129,
      "juz": 5,
      "manzil": 1,
      "page": 99,
      "ruku": 80,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلَن تَسۡتَطِيعُوٓاْ أَن تَعۡدِلُواْ بَيۡنَ ٱلنِّسَآءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِيلُواْ كُلَّ ٱلۡمَيۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا ٩٢١\n                                    \n                                    \n                                    وقوله تعالى : ( ولن تستطيعوا أن تعدلوا بين النساء ولو حرصتم ) أي : لن تستطيعوا أيها الناس أن تساووا بين النساء من جميع الوجوه ، فإنه وإن حصل القسم الصوري : ليلة وليلة ، فلا بد من التفاوت في المحبة والشهوة والجماع ، كما قاله ابن عباس ، وعبيدة السلماني ، ومجاهد ، والحسن البصري ، والضحاك بن مزاحم .\nوقد قال ابن أبي حاتم : حدثنا أبو زرعة ، حدثنا ابن أبي شيبة ، حدثنا حسين الجعفي ، عن زائدة ، عن عبد العزيز بن رفيع ، عن ابن أبي مليكة قال : نزلت هذه الآية : ( ولن تستطيعوا أن تعدلوا بين النساء ولو حرصتم ) في عائشة . يعني : أن النبي صلى الله عليه وسلم كان يحبها أكثر من غيرها ، كما جاء في الحديث الذي رواه الإمام أحمد وأهل السنن ، من حديث حماد بن سلمة ، عن أيوب ، عن أبي قلابة ، عن عبد الله بن يزيد ، عن عائشة قالت : كان رسول الله صلى الله عليه وسلم يقسم بين نسائه فيعدل ، ثم يقول : \" اللهم هذا قسمي فيما أملك ، فلا تلمني فيما تملك ولا أملك \" يعني : القلب .\nلفظ أبي داود ، وهذا إسناد صحيح ، لكن قال الترمذي : رواه حماد بن زيد وغير واحد ، عن أيوب ، عن أبي قلابة مرسلا قال : وهذا أصح .\nوقوله ( فلا تميلوا كل الميل ) أي : فإذا ملتم إلى واحدة منهم فلا تبالغوا في الميل بالكلية ( فتذروها كالمعلقة ) أي : فتبقى هذه الأخرى معلقة .\nقال ابن عباس ، ومجاهد ، وسعيد بن جبير ، والحسن ، والضحاك ، والربيع بن أنس ، والسدي ، ومقاتل بن حيان : معناه لا ذات زوج ولا مطلقة .\nوقد قال أبو داود الطيالسي : أنبأنا همام ، عن قتادة ، عن النضر بن أنس ، عن بشير بن نهيك ، عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : \" من كانت له امرأتان فمال إلى إحداهما ، جاء يوم القيامة وأحد شقيه ساقط \" .\nوهكذا رواه الإمام أحمد وأهل السنن ، من حديث همام بن يحيى ، عن قتادة ، به . وقال الترمذي : إنما أسنده همام ، ورواه عن قتادة - قال : \" كان يقال \" . ولا نعرف هذا الحديث مرفوعا إلا من حديث همام .\nوقوله : ( وإن تصلحوا وتتقوا فإن الله كان غفورا رحيما ) أي : وإن أصلحتم في أموركم ، وقسمتم بالعدل فيما تملكون ، واتقيتم الله في جميع الأحوال ، غفر الله لكم ما كان من ميل إلى بعض النساء دون بعض .\n                                    ",
        "qortoby": "وَلَن تَسۡتَطِيعُوٓاْ أَن تَعۡدِلُواْ بَيۡنَ ٱلنِّسَآءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِيلُواْ كُلَّ ٱلۡمَيۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا ٩٢١\n                                    \n                                    \n                                    قوله : ولن تستطيعوا أن تعدلوا بين النساء ولو حرصتم فلا تميلوا كل الميل فتذروها كالمعلقة وإن تصلحوا وتتقوا فإن الله كان غفورا رحيما\nقوله تعالى : ولن تستطيعوا أن تعدلوا بين النساء ولو حرصتم فلا تميلوا كل الميل أخبر تعالى بنفي الاستطاعة في العدل بين النساء ، وذلك في ميل الطبع بالمحبة والجماع والحظ من القلب . فوصف الله تعالى حالة البشر وأنهم بحكم الخلقة لا يملكون ميل قلوبهم إلى بعض دون بعض ؛ ولهذا كان عليه السلام يقول : اللهم إن هذه قسمتي فيما أملك فلا تلمني فيما تملك ولا أملك . ثم نهى فقال : فلا تميلوا كل الميل قال مجاهد : لا تتعمدوا الإساءة بل الزموا التسوية في القسم والنفقة ؛ لأن هذا مما يستطاع . وسيأتي بيان هذا في \" الأحزاب \" مبسوطا إن شاء الله تعالى . وروى قتادة عن النضر بن أنس عن بشير بن نهيك عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم : من كانت له امرأتان فلم يعدل بينهما جاء يوم القيامة وشقه مائل .\nقوله تعالى : فتذروها كالمعلقة أي لا هي مطلقة ولا ذات زوج ؛ قاله الحسن . وهذا تشبيه بالشيء المعلق من شيء ؛ لأنه لا على الأرض استقر ولا على ما علق عليه انحمل ؛ وهذا مطرد في قولهم في المثل : \" ارض من المركب بالتعليق \" . وفي عرف النحويين فمن تعليق الفعل . ومنه في حديث أم زرع في قول المرأة : زوجي العشنق ، إن أنطق أطلق ، وإن أسكت أعلق . وقال قتادة : كالمسجونة ؛ وكذا قرأ أبي \" فتذروها كالمسجونة \" . وقرأ ابن مسعود \" فتذروها كأنها معلقة \" . وموضع \" فتذروها \" نصب ؛ لأنه جواب النهي . والكاف في \" كالمعلقة \" في موضع نصب أيضا .\n                                    ",
        "saadi": "وَلَن تَسۡتَطِيعُوٓاْ أَن تَعۡدِلُواْ بَيۡنَ ٱلنِّسَآءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِيلُواْ كُلَّ ٱلۡمَيۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا ٩٢١\n                                        \n                                        \n                                        \n                                        يخبر تعالى: أن الأزواج لا يستطيعون وليس في قدرتهم العدل التام بين النساء، وذلك لأن العدل يستلزم وجود المحبة على السواء، والداعي على السواء، والميل في القلب إليهن على السواء، ثم العمل بمقتضى ذلك. وهذا متعذر غير ممكن، فلذلك عفا الله عما لا يستطاع، ونهى عما هو ممكن بقوله: { فَلَا تَمِيلُوا كُلَّ الْمَيْلِ فَتَذَرُوهَا كَالْمُعَلَّقَةِ ْ} أي: لا تميلوا ميلا كثيرا بحيث لا تؤدون حقوقهن الواجبة، بل افعلوا ما هو باستطاعتكم من العدل. فالنفقة والكسوة والقسم ونحوها عليكم أن تعدلوا بينهن فيها، بخلاف الحب والوطء ونحو ذلك، فإن الزوجة إذا ترك زوجها ما يجب لها، صارت كالمعلقة التي لا زوج لها فتستريح وتستعد للتزوج، ولا ذات زوج يقوم بحقوقها. { وَإِنْ تُصْلِحُوا ْ} ما بينكم وبين زوجاتكم، بإجبار أنفسكم على فعل ما لا تهواه النفس، احتسابا وقياما بحق الزوجة، وتصلحوا أيضا فيما بينكم وبين الناس، وتصلحوا أيضا بين الناس فيما تنازعوا فيه، وهذا يستلزم الحث على كل طريق يوصل إلى الصلح مطلقا كما تقدم. { وَتَتَّقُوا ْ} الله بفعل المأمور وترك المحظور، والصبر على المقدور. { فَإِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا ْ} يغفر ما صدر منكم من الذنوب والتقصير في الحق الواجب، ويرحمكم كما عطفتم على أزواجكم ورحمتموهن.\n                                    "
      },
      "originalText": "وَلَن تَسۡتَطِيعُوٓاْ أَن تَعۡدِلُواْ بَيۡنَ ٱلنِّسَآءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِيلُواْ كُلَّ ٱلۡمَيۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا ٩٢١"
    },
    {
      "number": 623,
      "text": "وَإِنْ يَتَفَرَّقَا يُغْنِ اللَّهُ كُلًّا مِنْ سَعَتِهِ ۚ وَكَانَ اللَّهُ وَاسِعًا حَكِيمًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 130,
      "juz": 5,
      "manzil": 1,
      "page": 99,
      "ruku": 80,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَإِن يَتَفَرَّقَا يُغۡنِ ٱللَّهُ كُلّٗا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَٰسِعًا حَكِيمٗا ٠٣١\n                                    \n                                    \n                                    ثم قال تعالى : ( وإن يتفرقا يغن الله كلا من سعته وكان الله واسعا حكيما ) وهذه هي الحالة الثالثة ، وهي حالة الفراق ، وقد أخبر تعالى أنهما إذا تفرقا فإن الله يغنيه عنها ويغنيها عنه ، بأن يعوضه بها من هو خير له منها ، ويعوضها عنه بمن هو خير لها منه : ( وكان الله واسعا حكيما ) أي : واسع الفضل عظيم المن ، حكيما في جميع أفعاله وأقداره وشرعه .\n                                    ",
        "qortoby": "وَإِن يَتَفَرَّقَا يُغۡنِ ٱللَّهُ كُلّٗا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَٰسِعًا حَكِيمٗا ٠٣١\n                                    \n                                    \n                                    قوله تعالى : وإن يتفرقا يغن الله كلا من سعته وكان الله واسعا حكيما\nقوله تعالى : وإن يتفرقا يغن الله كلا من سعته أي وإن لم يصطلحا بل تفرقا فليحسنا ظنهما بالله ، فقد يقيض للرجل امرأة تقر بها عينه ، وللمرأة من يوسع عليها . وروي عن جعفر بن محمد أن رجلا شكا إليه الفقر ، فأمره بالنكاح ، فذهب الرجل وتزوج ؛ ثم جاء إليه وشكا إليه الفقر ، فأمره بالطلاق ؛ فسئل عن هذه الآية فقال : أمرته بالنكاح لعله من أهل هذه الآية : إن يكونوا فقراء يغنهم الله من فضله فلما لم يكن من أهل تلك الآية أمرته بالطلاق فقلت : فلعله من أهل هذه الآية وإن يتفرقا يغن الله كلا من سعته .\n                                    ",
        "saadi": "وَإِن يَتَفَرَّقَا يُغۡنِ ٱللَّهُ كُلّٗا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَٰسِعًا حَكِيمٗا ٠٣١\n                                        \n                                        \n                                        \n                                        هذه الحالة الثالثة بين الزوجين، إذا تعذر الاتفاق فإنه لا بأس بالفراق، فقال: { وَإِنْ يَتَفَرَّقَا ْ} أي: بطلاق أو فسخ أو خلع أو غير ذلك { يُغْنِ اللَّهُ كُلًّا ْ} من الزوجين { مِنْ سَعَتِهِ ْ} أي: من فضله وإحسانه الواسع الشامل. فيغني الزوج بزوجة خير له منها، ويغنيها من فضله وإن انقطع نصيبها من زوجها، فإن رزقها على المتكفل بأرزاق جميع الخلق، القائم بمصالحهم، ولعل الله يرزقها زوجا خيرا منه، { وَكَانَ اللَّهُ وَاسِعًا ْ} أي: كثير الفضل واسع الرحمة، وصلت رحمته وإحسانه إلى حيث وصل إليه علمه. ولكنه مع ذلك { حَكِيمًا ْ} أي: يعطي بحكمة، ويمنع لحكمة. فإذا اقتضت حكمته منع بعض عباده من إحسانه، بسبب من العبد لا يستحق معه الإحسان، حرمه عدلا وحكمة.\n                                    "
      },
      "originalText": "وَإِن يَتَفَرَّقَا يُغۡنِ ٱللَّهُ كُلّٗا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَٰسِعًا حَكِيمٗا ٠٣١"
    },
    {
      "number": 624,
      "text": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ وَلَقَدْ وَصَّيْنَا الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ وَإِيَّاكُمْ أَنِ اتَّقُوا اللَّهَ ۚ وَإِنْ تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَانَ اللَّهُ غَنِيًّا حَمِيدًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 131,
      "juz": 5,
      "manzil": 1,
      "page": 99,
      "ruku": 80,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَلَقَدۡ وَصَّيۡنَا ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَإِيَّاكُمۡ أَنِ ٱتَّقُواْ ٱللَّهَۚ وَإِن تَكۡفُرُواْ فَإِنَّ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ غَنِيًّا حَمِيدٗا ١٣١\n                                    \n                                    \n                                    يخبر تعالى أنه مالك السماوات والأرض ، وأنه الحاكم فيهما ; ولهذا قال : ( ولقد وصينا الذين أوتوا الكتاب من قبلكم وإياكم ) أي : وصيناكم بما وصيناهم به ، من تقوى الله ، عز وجل ، بعبادته وحده لا شريك له .\nثم قال : ( وإن تكفروا فإن لله ما في السماوات وما في الأرض [ وكان الله غنيا حميدا ] ) كما قال تعالى إخبارا عن موسى أنه قال لقومه : ( إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد ) [ إبراهيم : 8 ] ، وقال ( فكفروا وتولوا واستغنى الله والله غني حميد ) [ التغابن : 6 ] أي : غني عن عباده ، ( حميد ) أي : محمود في جميع ما يقدره ويشرعه .\n                                    ",
        "qortoby": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَلَقَدۡ وَصَّيۡنَا ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَإِيَّاكُمۡ أَنِ ٱتَّقُواْ ٱللَّهَۚ وَإِن تَكۡفُرُواْ فَإِنَّ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ غَنِيًّا حَمِيدٗا ١٣١\n                                    \n                                    \n                                    قوله تعالى : ولقد وصينا الذين أوتوا الكتاب من قبلكم أي الأمر بالتقوى كان عاما لجميع الأمم : وقد مضى القول في التقوى . وإياكم عطف على الذين . أن اتقوا الله في موضع نصب ؛ قال الأخفش : أي بأن اتقوا الله . وقال بعض العارفين : هذه الآية هي رحى آي القرآن ، لأن جميعه يدور عليها .\nقوله تعالى : وإن تكفروا فإن لله ما في السماوات وما في الأرض وكان الله غنيا حميدا\n                                    ",
        "saadi": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَلَقَدۡ وَصَّيۡنَا ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَإِيَّاكُمۡ أَنِ ٱتَّقُواْ ٱللَّهَۚ وَإِن تَكۡفُرُواْ فَإِنَّ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ غَنِيًّا حَمِيدٗا ١٣١\n                                        \n                                        \n                                        \n                                        يخبر تعالى عن عموم ملكه العظيم الواسع المستلزم تدبيره بجميع أنواع التدبير، وتصرفه بأنواع التصريف قدرا وشرعا، فتصرفه الشرعي أن وصى الأولين والآخرين أهل الكتب السابقة واللاحقة بالتقوى المتضمنة للأمر والنهي، وتشريع الأحكام، والمجازاة لمن قام بهذه الوصية بالثواب، والمعاقبة لمن أهملها وضيعها بأليم العذاب، ولهذا قال: { وَإِنْ تَكْفُرُوا ْ} بأن تتركوا تقوى الله، وتشركوا بالله ما لم ينزل به عليكم سلطانا، فإنكم لا تضرون بذلك إلا أنفسكم، ولا تضرون الله شيئا ولا تنقصون ملكه، وله عبيد خير منكم وأعظم وأكثر، مطيعون له خاضعون لأمره. ولهذا رتب على ذلك قوله: { وَإِنْ تَكْفُرُوا فَإِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَكَانَ اللَّهُ غَنِيًّا حَمِيدًا ْ} له الجود الكامل والإحسان الشامل الصادر من خزائن رحمته التي لا ينقصها الإنفاق ولا يغيضها نفقة، سحاء الليل والنهار، لو اجتمع أهل السماوات وأهل الأرض أولهم وآخرهم، فسأل كل [واحد] منهم ما بلغت أمانيه ما نقص من ملكه شيئا، ذلك بأنه جواد واجد ماجد، عطاؤه كلام وعذابه كلام، إنما أمره لشيء إذا أراد أن يقول له كن فيكون. ومن تمام غناه أنه كامل الأوصاف، إذ لو كان فيه نقص بوجه من الوجوه، لكان فيه نوع افتقار إلى ذلك الكمال، بل له كل صفة كمال، ومن تلك الصفة كمالها، ومن تمام غناه أنه لم يتخذ صاحبة ولا ولدا، ولا شريكا في ملكه ولا ظهيرا، ولا معاونا له على شيء من تدابير ملكه. ومن كمال غناه افتقار العالم العلوي والسفلي في جميع أحوالهم وشئونهم إليه وسؤالهم إياه جميع حوائجهم الدقيقة والجليلة، فقام تعالى بتلك المطالب والأسئلة وأغناهم وأقناهم، ومَنَّ عليهم بلطفه وهداهم. وأما الحميد فهو من أسماء الله تعالى الجليلة الدال على أنه [هو] المستحق لكل حمد ومحبة وثناء وإكرام، وذلك لما اتصف به من صفات الحمد، التي هي صفة الجمال والجلال، ولما أنعم به على خلقه من النِّعم الجزال، فهو المحمود على كل حال. وما أحسن اقتران هذين الاسمين الكريمين { الْغَنِيُّ الْحَمِيدُ ْ}!! فإنه غني محمود، فله كمال من غناه، وكمال من حمده، وكمال من اقتران أحدهما بالآخر.\n                                    "
      },
      "originalText": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَلَقَدۡ وَصَّيۡنَا ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَإِيَّاكُمۡ أَنِ ٱتَّقُواْ ٱللَّهَۚ وَإِن تَكۡفُرُواْ فَإِنَّ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ غَنِيًّا حَمِيدٗا ١٣١"
    },
    {
      "number": 625,
      "text": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۚ وَكَفَىٰ بِاللَّهِ وَكِيلًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 132,
      "juz": 5,
      "manzil": 1,
      "page": 99,
      "ruku": 80,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا ٢٣١\n                                    \n                                    \n                                    وقوله : ( ولله ما في السماوات وما في الأرض وكفى بالله وكيلا ) أي : هو القائم على كل نفس بما كسبت ، الرقيب الشهيد على كل شيء .\n                                    ",
        "qortoby": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا ٢٣١\n                                    \n                                    \n                                    ولله ما في السماوات وما في الأرض وكفى بالله وكيلا إن قال قائل : ما فائدة هذا التكرير ؟ فعنه جوابان : أحدهما : أنه كرر تأكيدا ؛ ليتنبه العباد وينظروا ما في ملكوته وملكه وأنه غني عن العالمين .\nالجواب الثاني : أنه كرر لفوائد : فأخبر في الأول أن الله تعالى يغني كلا من سعته ؛ لأن له ما في السماوات وما في الأرض فلا تنفد خزائنه . ثم قال : أوصيناكم وأهل الكتاب بالتقوى وإن تكفروا أي وإن تكفروا فإنه غني عنكم ؛ لأن له ما في السماوات وما في الأرض . ثم أعلم في الثالث بحفظ خلقه وتدبيره إياهم بقوله : وكفى بالله وكيلا لأن له ما في السماوات وما في الأرض . وقال : ما في السماوات ولم يقل من في السماوات ؛ لأنه ذهب به مذهب الجنس ، وفي السماوات والأرض من يعقل ومن لا يعقل .\n                                    ",
        "saadi": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا ٢٣١\n                                        \n                                        \n                                        \n                                        ثم كرر إحاطة ملكه لما في السماوات وما في الأرض، وأنه على كل شيء وكيل، أي: عالم قائم بتدبير الأشياء على وجه الحكمة، فإن ذلك من تمام الوكالة، فإن الوكالة تستلزم العلم بما هو وكيل عليه، والقوة والقدرة على تنفيذه وتدبيره، وكون ذلك التدبير على وجه الحكمة والمصلحة، فما نقص من ذلك فهو لنقص بالوكيل، والله تعالى منزه عن كل نقص.\n                                    "
      },
      "originalText": "وَلِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًا ٢٣١"
    },
    {
      "number": 626,
      "text": "إِنْ يَشَأْ يُذْهِبْكُمْ أَيُّهَا النَّاسُ وَيَأْتِ بِآخَرِينَ ۚ وَكَانَ اللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 133,
      "juz": 5,
      "manzil": 1,
      "page": 99,
      "ruku": 80,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "إِن يَشَأۡ يُذۡهِبۡكُمۡ أَيُّهَا ٱلنَّاسُ وَيَأۡتِ بِ‍َٔاخَرِينَۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرٗا ٣٣١\n                                    \n                                    \n                                    وقوله : ( إن يشأ يذهبكم أيها الناس ويأت بآخرين وكان الله على ذلك قديرا ) أي : هو قادر على إذهابكم وتبديلكم بغيركم إذا عصيتموه ، وكما قال [ تعالى ] ( وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم ) [ محمد : 38 ] . وقال بعض السلف : ما أهون العباد على الله إذا أضاعوا أمره ! وقال تعالى : ( إن يشأ يذهبكم ويأت بخلق جديد . وما ذلك على الله بعزيز ) [ إبراهيم : 19 ، 20 ] أي : ما هو عليه بممتنع \n                                    ",
        "qortoby": "إِن يَشَأۡ يُذۡهِبۡكُمۡ أَيُّهَا ٱلنَّاسُ وَيَأۡتِ بِ‍َٔاخَرِينَۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرٗا ٣٣١\n                                    \n                                    \n                                    قوله تعالى : إن يشأ يذهبكم أيها الناس ويأت بآخرين وكان الله على ذلك قديرا\nقوله تعالى : إن يشأ يذهبكم يعني : بالموت أيها الناس يريد المشركين والمنافقين ويأت بآخرين يعني بغيركم . ولما نزلت هذه الآية ضرب رسول الله صلى الله عليه وسلم على ظهر سلمان وقال : هم قوم هذا . وقيل : الآية عامة ، أي وإن تكفروا يذهبكم ويأت بخلق أطوع لله منكم . وهذا كما قال في آية أخرى : وإن تتولوا يستبدل قوما غيركم ثم لا يكونوا أمثالكم . وفي الآية تخويف وتنبيه لجميع من كانت له ولاية وإمارة ورياسة فلا يعدل في رعيته ، أو كان عالما فلا يعمل بعلمه ولا ينصح الناس ، أن يذهبه ويأتي بغيره . وكان الله على ذلك قديرا والقدرة صفة أزلية ، لا تتناهى مقدوراته ، كما لا تتناهى معلوماته ، والماضي والمستقبل في صفاته بمعنى واحد ، وإنما خص الماضي بالذكر لئلا يتوهم أنه يحدث في ذاته وصفاته . والقدرة هي التي يكون بها الفعل ولا يجوز وجود العجز معها .\n                                    ",
        "saadi": "إِن يَشَأۡ يُذۡهِبۡكُمۡ أَيُّهَا ٱلنَّاسُ وَيَأۡتِ بِ‍َٔاخَرِينَۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرٗا ٣٣١\n                                        \n                                        \n                                        \n                                        أي: هو الغني الحميد الذي له القدرة الكاملة والمشيئة النافذة فيكم { إِنْ يَشَأْ يُذْهِبْكُمْ أَيُّهَا النَّاسُ وَيَأْتِ بِآخَرِينَ ْ} غيركم هم أطوع لله منكم وخير منكم، وفي هذا تهديد للناس على إقامتهم على كفرهم وإعراضهم عن ربهم، فإن الله لا يعبأ بهم شيئا إن لم يطيعوه، ولكنه يمهل ويملي ولا يهمل.\n                                    "
      },
      "originalText": "إِن يَشَأۡ يُذۡهِبۡكُمۡ أَيُّهَا ٱلنَّاسُ وَيَأۡتِ بِ‍َٔاخَرِينَۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَٰلِكَ قَدِيرٗا ٣٣١"
    },
    {
      "number": 627,
      "text": "مَنْ كَانَ يُرِيدُ ثَوَابَ الدُّنْيَا فَعِنْدَ اللَّهِ ثَوَابُ الدُّنْيَا وَالْآخِرَةِ ۚ وَكَانَ اللَّهُ سَمِيعًا بَصِيرًا",
      "surah": {
        "number": 4,
        "name": "سورة النساء",
        "englishName": "An-Nisaa",
        "englishNameTranslation": "The Women",
        "revelationType": "Medinan",
        "numberOfAyahs": 176
      },
      "numberInSurah": 134,
      "juz": 5,
      "manzil": 1,
      "page": 99,
      "ruku": 80,
      "hizbQuarter": 39,
      "sajda": false,
      "tafsier": {
        "ibnkther": "مَّن كَانَ يُرِيدُ ثَوَابَ ٱلدُّنۡيَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَكَانَ ٱللَّهُ سَمِيعَۢا بَصِيرٗا ٤٣١\n                                    \n                                    \n                                    وقوله : ( من كان يريد ثواب الدنيا فعند الله ثواب الدنيا والآخرة ) أي : يا من ليس همه إلا الدنيا ، اعلم أن عند الله ثواب الدنيا والآخرة ، وإذا سألته من هذه وهذه أعطاك وأغناك وأقناك ، كما قال تعالى : ( فمن الناس من يقول ربنا آتنا في الدنيا وما له في الآخرة من خلاق . ومنهم من يقول ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار . أولئك لهم نصيب مما كسبوا [ والله سريع الحساب ] ) [ البقرة : 200 - 202 ] ، وقال تعالى : ( من كان يريد حرث الآخرة نزد له في حرثه [ ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب ] ) [ الشورى : 20 ] ، وقال تعالى : ( من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها مذموما مدحورا . ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكورا . كلا نمد هؤلاء وهؤلاء من عطاء ربك وما كان عطاء ربك محظورا . انظر كيف فضلنا بعضهم على بعض [ وللآخرة أكبر درجات وأكبر تفضيلا ] ) [ الإسراء : 18 - 21 ] .\nوقد زعم ابن جرير أن المعنى في هذه الآية : ( من كان يريد ثواب الدنيا ) أي : من المنافقين الذين أظهروا الإيمان لأجل ذلك ، ( فعند الله ثواب الدنيا ) وهو ما حصل لهم من المغانم وغيرها مع المسلمين . وقوله : ( والآخرة ) أي : وعند الله ثواب الآخرة ، وهو ما ادخره لهم من العقوبة في نار جهنم . وجعلها كقوله : ( من كان يريد الحياة الدنيا وزينتها [ نوف إليهم أعمالهم فيها ] وهم فيها لا يبخسون . أولئك الذين ليس لهم في الآخرة إلا النار وحبط ما صنعوا فيها وباطل ما كانوا يعملون ) [ هود : 15 ، 16 ] .\nولا شك أن هذه الآية معناها ظاهر ، وأما تفسيره الآية الأولى بهذا ففيه نظر ; فإن قوله ( فعند الله ثواب الدنيا والآخرة ) ظاهر في حضور الخير في الدنيا والآخرة ، أي : بيده هذا وهذا ، فلا يقتصرن قاصر الهمة على السعي للدنيا فقط ، بل لتكن همته سامية إلى نيل المطالب العالية في الدنيا والآخرة ، فإن مرجع ذلك كله إلى الذي بيده الضر والنفع ، وهو الله الذي لا إله إلا هو ، الذي قد قسم السعادة والشقاوة في الدنيا والآخرة بين الناس ، وعدل بينهم فيما علمه فيهم ، ممن يستحق هذا ، وممن يستحق هذا ; ولهذا قال : ( وكان الله سميعا بصيرا )\n                                    ",
        "qortoby": "مَّن كَانَ يُرِيدُ ثَوَابَ ٱلدُّنۡيَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَكَانَ ٱللَّهُ سَمِيعَۢا بَصِيرٗا ٤٣١\n                                    \n                                    \n                                    قوله تعالى : من كان يريد ثواب الدنيا فعند الله ثواب الدنيا والآخرة وكان الله سميعا بصيرا\nأي من عمل بما افترضه الله عليه طلبا للآخرة آتاه الله ذلك في الآخرة ، ومن عمل طلبا للدنيا آتاه بما كتب له في الدنيا وليس له في الآخرة من ثواب ؛ لأنه عمل لغير الله كما قال تعالى : وما له في الآخرة من نصيب . وقال تعالى : أولئك الذين ليس لهم في الآخرة إلا النار . وهذا على أن يكون المراد بالآية المنافقون والكفار ، وهو اختيار الطبري . وروي أن المشركين كانوا لا يؤمنون بالقيامة ، وإنما . يتقربون إلى الله تعالى ليوسع عليهم في الدنيا ويرفع عنهم مكروهها ؛ فأنزل الله عز وجل من كان يريد ثواب الدنيا فعند الله ثواب الدنيا والآخرة وكان الله سميعا بصيرا أي يسمع ما يقولونه ويبصر ما يسرونه .\n                                    ",
        "saadi": "مَّن كَانَ يُرِيدُ ثَوَابَ ٱلدُّنۡيَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَكَانَ ٱللَّهُ سَمِيعَۢا بَصِيرٗا ٤٣١\n                                        \n                                        \n                                        \n                                        ثم أخبر أن مَن كانت همته وإرادته دنية غير متجاوزة ثواب الدنيا، وليس له إرادة في الآخرة فإنه قد قصر سعيه ونظره، ومع ذلك فلا يحصل له من ثواب الدنيا سوى ما كتب الله له منها، فإنه تعالى هو المالك لكل شيء الذي عنده ثواب الدنيا والآخرة، فليطلبا منه ويستعان به عليهما، فإنه لا ينال ما عنده إلا بطاعته، ولا تدرك الأمور الدينية والدنيوية إلا بالاستعانة به، والافتقار إليه على الدوام. وله الحكمة تعالى في توفيق من يوفقه، وخذلان من يخذله وفي عطائه ومنعه، ولهذا قال: { وَكَانَ اللَّهُ سَمِيعًا بَصِيرًا ْ}\n                                    "
      },
      "originalText": "مَّن كَانَ يُرِيدُ ثَوَابَ ٱلدُّنۡيَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَكَانَ ٱللَّهُ سَمِيعَۢا بَصِيرٗا ٤٣١"
    }
  ]
}